//D000000   JOB (02,
// 0049177,5,59,,,85704,111,177),'W015 CLAYTON WILKIE',
// CLASS=7,MSGLEVEL=1,MSGCLASS=X
/*JOBPARM S=ANY  0181  0233
/*PROCLIB=W015.APEMAN.CNTL
//ASMIT  PROC  SOURCE='W015.APEMAN.ASM',OBJLIB='W015.APEMAN.OBJ',      C
//             MODULE=Z,PUNCH=,         PUNCH='DUMMY,',                C
//             CPART=192K,COPTION='LOAD,DECK,XREF,ESD',                C
//             DAUTIL=SYSWK,SEQUTIL=SYSWK,UTRKS=200,                   C
//             MODBLK=3200,MODTRKS=200
//ASM    EXEC  PGM=ASMGASM,REGION=&CPART,PARM='LIST,&COPTION',         X
//             ACCT='ASMGC   '
//STEPLIB DD DSN=SYS1.ASMGV2L7.RELOC,UNIT=3331,VOL=SER=LIBR21,DISP=SHR
//SYSLIB   DD  DSNAME=SYS1.MACLIB,DISP=SHR
//         DD  DSNAME=MVSSP1.AMODGEN,DISP=SHR,UNIT=3350,VOL=SER=DLIBSP
//         DD  DSNAME=W015.APEMAN.ASM,DISP=SHR
//SYSUT1   DD  UNIT=(&SEQUTIL,SEP=SYSLIB),LABEL=(,NL),                 C
//             SPACE=(3520,(&UTRKS,10))
//SYSUT2   DD  UNIT=(&SEQUTIL,SEP=SYSUT1),LABEL=(,NL),                 C
//             SPACE=(3520,(&UTRKS,10))
//SYSUT3   DD  UNIT=(&DAUTIL,SEP=(SYSUT1,SYSUT2)),                     C
//             SPACE=(3303,(&UTRKS,10))
//SYSPRINT DD  SYSOUT=*
//SYSPUNCH DD  &PUNCH.DSN=&OBJLIB(&MODULE),DISP=OLD
//SYSIN    DD DSN=&SOURCE(&MODULE),DISP=OLD
//SYSLIN   DD DSN=&LOADSET,UNIT=(&DAUTIL,SEP=SYSPRINT),                *
//             SPACE=(3520,(&MODTRKS,5)),DISP=(MOD,PASS),              *
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=&MODBLK)
//         PEND
//SCRATCH EXEC PGM=IEHPROGM
//SYSPRINT DD SYSOUT=*
//MESURE DD UNIT=3350,DISP=OLD,VOL=SER=MESURE
//CYSIN DD *
 SCRATCH DSNAME=W015.APEMAN.OBJ,VOL=3350=MESURE,MEMBER=APEDECVB
 SCRATCH DSNAME=W015.APEMAN.OBJ,VOL=3350=MESURE,MEMBER=APEMAN
 SCRATCH DSNAME=W015.APEMAN.OBJ,VOL=3350=MESURE,MEMBER=APEMON#
 SCRATCH DSNAME=W015.APEMAN.OBJ,VOL=3350=MESURE,MEMBER=APEMONP
 SCRATCH DSNAME=W015.APEMAN.OBJ,VOL=3350=MESURE,MEMBER=APEMONQ
 SCRATCH DSNAME=W015.APEMAN.OBJ,VOL=3350=MESURE,MEMBER=APEMONR
 SCRATCH DSNAME=W015.APEMAN.OBJ,VOL=3350=MESURE,MEMBER=APEMONS
 SCRATCH DSNAME=W015.APEMAN.OBJ,VOL=3350=MESURE,MEMBER=APEMONT
 SCRATCH DSNAME=W015.APEMAN.OBJ,VOL=3350=MESURE,MEMBER=APEMONU
 SCRATCH DSNAME=W015.APEMAN.OBJ,VOL=3350=MESURE,MEMBER=APEMONZ
 SCRATCH DSNAME=W015.APEMAN.OBJ,VOL=3350=MESURE,MEMBER=APESPLIT
 SCRATCH DSNAME=W015.APEMAN.OBJ,VOL=3350=MESURE,MEMBER=APEUSER
 SCRATCH DSNAME=W015.APEMAN.OBJ,VOL=3350=MESURE,MEMBER=DYNTRACE
 SCRATCH DSNAME=W015.APEMAN.OBJ,VOL=3350=MESURE,MEMBER=FNDVAL
 SCRATCH DSNAME=W015.APEMAN.OBJ,VOL=3350=MESURE,MEMBER=GETDAT
 SCRATCH DSNAME=W015.APEMAN.OBJ,VOL=3350=MESURE,MEMBER=GETPRM
 SCRATCH DSNAME=W015.APEMAN.OBJ,VOL=3350=MESURE,MEMBER=INPUT
 SCRATCH DSNAME=W015.APEMAN.OBJ,VOL=3350=MESURE,MEMBER=MONRT
 SCRATCH DSNAME=W015.APEMAN.OBJ,VOL=3350=MESURE,MEMBER=MONRUN
 SCRATCH DSNAME=W015.APEMAN.OBJ,VOL=3350=MESURE,MEMBER=MRD
 SCRATCH DSNAME=W015.APEMAN.OBJ,VOL=3350=MESURE,MEMBER=OUTPUT
 SCRATCH DSNAME=W015.APEMAN.OBJ,VOL=3350=MESURE,MEMBER=PARAMS
 SCRATCH DSNAME=W015.APEMAN.OBJ,VOL=3350=MESURE,MEMBER=TIMER
 SCRATCH DSNAME=W015.APEMAN.LOAD,VOL=3350=MESURE,MEMBER=APEMAN
 SCRATCH DSNAME=W015.APEMAN.LOAD,VOL=3350=MESURE,MEMBER=DYNTRACE
 SCRATCH DSNAME=W015.APEMAN.LOAD,VOL=3350=MESURE,MEMBER=MONA
 SCRATCH DSNAME=W015.APEMAN.LOAD,VOL=3350=MESURE,MEMBER=MONB
 SCRATCH DSNAME=W015.APEMAN.LOAD,VOL=3350=MESURE,MEMBER=MONC
 SCRATCH DSNAME=W015.APEMAN.LOAD,VOL=3350=MESURE,MEMBER=MOND
 SCRATCH DSNAME=W015.APEMAN.LOAD,VOL=3350=MESURE,MEMBER=MONE
 SCRATCH DSNAME=W015.APEMAN.LOAD,VOL=3350=MESURE,MEMBER=MONF
 SCRATCH DSNAME=W015.APEMAN.LOAD,VOL=3350=MESURE,MEMBER=MONG
 SCRATCH DSNAME=W015.APEMAN.LOAD,VOL=3350=MESURE,MEMBER=MONH
 SCRATCH DSNAME=W015.APEMAN.LOAD,VOL=3350=MESURE,MEMBER=MONI
 SCRATCH DSNAME=W015.APEMAN.LOAD,VOL=3350=MESURE,MEMBER=MONJ
 SCRATCH DSNAME=W015.APEMAN.LOAD,VOL=3350=MESURE,MEMBER=MONK
 SCRATCH DSNAME=W015.APEMAN.LOAD,VOL=3350=MESURE,MEMBER=MONL
 SCRATCH DSNAME=W015.APEMAN.LOAD,VOL=3350=MESURE,MEMBER=MONM
 SCRATCH DSNAME=W015.APEMAN.LOAD,VOL=3350=MESURE,MEMBER=MONN
 SCRATCH DSNAME=W015.APEMAN.LOAD,VOL=3350=MESURE,MEMBER=MONO
 SCRATCH DSNAME=W015.APEMAN.LOAD,VOL=3350=MESURE,MEMBER=MONP
 SCRATCH DSNAME=W015.APEMAN.LOAD,VOL=3350=MESURE,MEMBER=MONQ
 SCRATCH DSNAME=W015.APEMAN.LOAD,VOL=3350=MESURE,MEMBER=MONR
 SCRATCH DSNAME=W015.APEMAN.LOAD,VOL=3350=MESURE,MEMBER=MONS
 SCRATCH DSNAME=W015.APEMAN.LOAD,VOL=3350=MESURE,MEMBER=MONT
 SCRATCH DSNAME=W015.APEMAN.LOAD,VOL=3350=MESURE,MEMBER=MONU
 SCRATCH DSNAME=W015.APEMAN.LOAD,VOL=3350=MESURE,MEMBER=MONV
 SCRATCH DSNAME=W015.APEMAN.LOAD,VOL=3350=MESURE,MEMBER=MONW
 SCRATCH DSNAME=W015.APEMAN.LOAD,VOL=3350=MESURE,MEMBER=MONX
 SCRATCH DSNAME=W015.APEMAN.LOAD,VOL=3350=MESURE,MEMBER=MONY
 SCRATCH DSNAME=W015.APEMAN.LOAD,VOL=3350=MESURE,MEMBER=MONZ
 SCRATCH DSNAME=W015.APEMAN.LOAD,VOL=3350=MESURE,MEMBER=APESPLIT
 SCRATCH DSNAME=W015.APEMAN.LOAD,VOL=3350=MESURE,MEMBER=APEUSER
 SCRATCH DSNAME=W015.APEMAN.LOG,VOL=3350=MESURE,PURGE
 UNCATLG DSNAME=W015.APEMAN.LOG
 SCRATCH DSNAME=W015.APEMAN.LPAMAP,VOL=3350=MESURE
 UNCATLG DSNAME=W015.APEMAN.LPAMAP
 SCRATCH DSNAME=W015.APEMAN.NUCMAP,VOL=3350=MESURE
 UNCATLG DSNAME=W015.APEMAN.NUCMAP
/* DELIMITER CARD
//COPY EXEC PGM=IEBCOPY
//SYSPRINT DD SYSOUT=*
//SYSUT3 DD UNIT=SYSWK,SPACE=(CYL,(1,1))
//SYSUT4 DD UNIT=SYSWK,SPACE=(CYL,(1,1))
//APEMAN DD DSN=W015.APEMAN.ASM,DISP=OLD
//APEOBJ DD DSN=W015.APEMAN.OBJ,DISP=OLD
//LOADLIB DD DSN=W015.APEMAN.LOAD,DISP=OLD
//SYSIN DD *
 COPY INDD=APEMAN,OUTDD=APEMAN
 COPY INDD=APEOBJ,OUTDD=APEOBJ
 COPY INDD=LOADLIB,OUTDD=LOADLIB
//APEDECVB EXEC ASMIT,MODULE=APEDECVB
//APEMAN   EXEC ASMIT,MODULE=APEMAN
//APEMON#  EXEC ASMIT,MODULE=APEMON#
//APEMONP  EXEC ASMIT,MODULE=APEMONP
//APEMONQ  EXEC ASMIT,MODULE=APEMONQ
//APEMONR  EXEC ASMIT,MODULE=APEMONR
//APEMONS  EXEC ASMIT,MODULE=APEMONS
//APEMONT  EXEC ASMIT,MODULE=APEMONT
//APEMONU  EXEC ASMIT,MODULE=APEMONU
//APEMONZ  EXEC ASMIT,MODULE=APEMONZ
//APESPLIT EXEC ASMIT,MODULE=APESPLIT
//APEUSER  EXEC ASMIT,MODULE=APEUSER
//DYNTRACE EXEC ASMIT,MODULE=DYNTRACE
//FNDVAL   EXEC ASMIT,MODULE=FNDVAL
//GETDAT   EXEC ASMIT,MODULE=GETDAT
//GETPRM   EXEC ASMIT,MODULE=GETPRM
//INPUT    EXEC ASMIT,MODULE=INPUT
//MONRT    EXEC ASMIT,MODULE=MONRT
//MONRUN   EXEC ASMIT,MODULE=MONRUN
//MRD      EXEC ASMIT,MODULE=MRD
//OUTPUT   EXEC ASMIT,MODULE=OUTPUT
//PARAMS   EXEC ASMIT,MODULE=PARAMS
//TIMER    EXEC ASMIT,MODULE=TIMER
//APELINK EXEC PGM=IEWLF128,PARM='LIST,XREF,SIZE=(312K,120K)',
//  REGION=320K,ACCT='LKED    '
//SYSPRINT DD SYSOUT=*,DCB=(RECFM=FBSA,LRECL=121,BLKSIZE=3509)
//SYSLMOD DD DSN=W015.APEMAN.LOAD,DISP=OLD
//SYSLIB DD DSN=W015.APEMAN.OBJ,DISP=SHR
//SYSUT1 DD UNIT=(SYSWK,SEP=(SYSLMOD,SYSLIN)),SPACE=(CYL,(4,1))
//SYSLIN DD *
 INCLUDE SYSLIB(APESPLIT)
 NAME    APESPLIT
 INCLUDE SYSLIB(APEMAN)
 INCLUDE SYSLIB(GETDAT)
 INCLUDE SYSLIB(GETPRM)
 INCLUDE SYSLIB(PARAMS)
 ENTRY   MONITOR
 NAME    APEMAN
 INCLUDE SYSLIB(GETDAT)
 INCLUDE SYSLIB(GETPRM)
 INCLUDE SYSLIB(PARAMS)
 INCLUDE SYSLIB(INPUT)
 INCLUDE SYSLIB(FNDVAL)
 INCLUDE SYSLIB(OUTPUT)
 INCLUDE SYSLIB(APEUSER)
 ENTRY   APEUSER
 NAME    APEUSER
 INCLUDE SYSLIB(APEMONP)
 NAME    MONP
 INCLUDE SYSLIB(APEMONQ)
 NAME    MONQ
 INCLUDE SYSLIB(APEMONR)
 NAME    MONR
 INCLUDE SYSLIB(APEMONS)
 NAME    MONS
 INCLUDE SYSLIB(APEMONT)
 NAME    MONT
 INCLUDE SYSLIB(APEMONU)
 NAME    MONU
 INCLUDE SYSLIB(APEMONZ)
 NAME    MONZ
 INCLUDE SYSLIB(APEMON#)
 ALIAS   MONA
 ALIAS   MONB
 ALIAS   MONC
 ALIAS   MOND
 ALIAS   MONE
 ALIAS   MONF
 ALIAS   MONG
 ALIAS   MONH
 ALIAS   MONI
 ALIAS   MONJ
 ALIAS   MONK
 ALIAS   MONL
 ALIAS   MONM
 ALIAS   MONN
 NAME    MONO
 INCLUDE SYSLIB(APEMON#)
 ALIAS   MONV
 ALIAS   MONW
 ALIAS   MONX
 ALIAS   MONY
 NAME    MONZ
//MAPNUC  EXEC PGM=AMBLIST,REGION=320K
//SYSPRINT DD SYSOUT=*
//SYSLIB DD DSN=SYS1.NUCLEUS,DISP=SHR
//SYSIN  DD *
   LISTLOAD OUTPUT=XREF,MEMBER=IEANUC01,                               X
               TITLE=('LISTING OF NUCLEUS IEANUC01',25)
   LISTLPA
//MAPLPA  EXEC PGM=AMBLIST
//SYSLIB DD DSN=SYS1.NUCLEUS,DISP=SHR
//SYSPRINT DD UNIT=3350,DISP=(NEW,CATLG),VOL=SER=MESURE,
//  DSNAME=W015.APEMAN.LPAMAP,
//  SPACE=(TRK,(20,10)),DCB=(RECFM=FBA,LRECL=121,BLKSIZE=3630)
//SYSIN DD *
   LISTLPA
//PRINTLPA EXEC PGM=IEBGENER,COND=(5,LE)
//SYSPRINT DD SYSOUT=A
//SYSUT1 DD DSN=W015.APEMAN.LPAMAP,DISP=SHR,UNIT=3350,VOL=SER=MESURE
//SYSUT2 DD SYSOUT=A,DCB=(RECFM=FBA,LRECL=121,BLKSIZE=3630)
//SYSIN DD DUMMY
//SETUP EXEC PGM=IEBUPDTE,PARM=NEW
//SYSPRINT DD SYSOUT=*
//SYSUT2 DD DSN=&&PARMS,DCB=(RECFM=FB,LRECL=80,BLKSIZE=80),
//  UNIT=SYSWK,DISP=(,PASS),SPACE=(TRK,(2,1,4))
//*MILLI,INTVAL=100,MAXTIM=5,MONP=600,MONR=200,MONS=300,MONT=1,MONU=600
//*INTVAL=10,MAXTIM=2,MONP=2,MONQ=3,MONR=1,MONS=2,MONU=1
//SYSIN DD *
./       ADD   NAME=APEMAN
MILLI,INTVAL=100,MAXTIM=5,MONQ=300,MONR=100,MONS=100,MONT=1
./       ADD   NAME=MONP
JOB=*PLPA
JOB=I99000DF
JOB=I99000AN
JOB=I8800022
JOB=I8800033
JOB=I8800055
JOB=I8800066
JOB=$ROSCOE
./       ADD   NAME=MONQ
MAJOR=SYSIEFSD
MAJOR=SYSVTOC
MAJOR=SYSZLOGR
./       ADD   NAME=MONT
TYPE=SVC
TYPE=I/O
GTF
./       ADD   NAME=MONU
TYPE=DA
./       ENDUP
/* DELIMITER CARD
//TRACE EXEC PGM=DYNTRACE,PARM=TURNON
//STEPLIB DD DSN=W015.APEMAN.LOAD,DISP=SHR
//SYSABEND DD SYSOUT=A
//SYSPRINT DD SYSOUT=*
//APEMAN EXEC  APEMAN,SER=MESURE,LOG=LOG,TIME=2,OUT=X
//IEFPROC.STEPLIB DD DSN=W015.APEMAN.LOAD,DISP=SHR
//IEFPROC.MONPARM DD DSN=&&PARMS,DISP=(OLD,DELETE)
//IEFPROC.IEFRDER DD DISP=(NEW,CATLG),SPACE=(CYL,(15))
/* DELIMITER CARD
