         TITLE 'ICBME--MSSC MOUNT EQUALIZATION                         *
                        '
ICBME    CSECT ,                                                   0001
@MAINENT DS    0H                                                  0001
         USING *,@15                                               0001
         B     @PROLOG                                             0001
         DC    AL1(16)                                             0001
         DC    C'ICBME     76.338'                                 0001
         DROP  @15
@PROLOG  STM   @14,@12,12(@13)                                     0001
         BALR  @12,0                                               0001
@PSTART  DS    0H                                                  0001
         USING @PSTART,@12                                         0001
         L     @00,@SIZDATD                                        0001
         GETMAIN  R,LV=(0)
         LR    @11,@01                                             0001
         USING @DATD,@11                                           0001
         ST    @13,@SA00001+4                                      0001
         LM    @00,@01,20(@13)                                     0001
         ST    @11,8(,@13)                                         0001
         LR    @13,@11                                             0001
*   ALLOPTR=R1;                     /* ADDRESS ALLOCATION INPUT    0053
*                                                            #Y30LB04*/
         LR    ALLOPTR,R1                                          0053
*   SDGPTR=ADDR(ALOBUF);            /* FIRST OF STAGING DRIVE GRP  0054
*                                      LIST                  @Y30LB04*/
         L     SDGPTR,ALOWKPTR(,ALLOPTR)                           0054
         LA    SDGPTR,ALOBUF(,SDGPTR)                              0054
*   MOUNTED=NO;                     /* INDICATE VOL NOT FOUND MOUNTED
*                                      YET                   #Y30LB04*/
         NI    MOUNTED,B'01111111'                                 0055
*   IF ICBOPT=ZERO THEN             /* SEE IF I HAVE SDG LIST      0056
*                                                            @ZA11005*/
         SLR   @10,@10                                             0056
         L     @07,CVTPTR                                          0056
         L     @07,CVTEXT2(,@07)                                   0056
         L     @07,CVTICB(,@07)                                    0056
         C     @10,ICBOPT(,@07)                                    0056
         BNE   @RF00056                                            0056
*     DO;                           /* NO LIST               @ZA11005*/
*       ALLOCPTR=ZERO;              /* ZERO PTR FOR ALLOC.   @ZA13481*/
         L     @07,ALOULPTR(,ALLOPTR)                              0058
         ST    @10,ALLOCPTR(,@07)                                  0058
*       GO TO MERET;                /* TAKE QUICK EXIT       @ZA11005*/
         B     MERET                                               0059
*     END;                          /* TO AVOID LOW CORE.    @ZA11005*/
*   IF ACALLCNT=FRSTCAL             /* FIRST CALL OF ICBME FOR THIS
*                                      REQ?                  #Y30LB04*/
*     THEN                          /* THIS IS FIRST ENTRY   #Y30LB04*/
@RF00056 L     @10,ALOWKPTR(,ALLOPTR)                              0061
         L     @10,ACALLCNT(,@10)                                  0061
         LTR   @10,@10                                             0061
         BNZ   @RF00061                                            0061
*     DO;                           /* SPECIAL FIRST TIME PROCESSING
*                                                            #Y30LB04*/
*       CALL ICBMEDR;               /* GET STAGING DRIVE GROUP LIST.
*                                      R1 IS SET             @Y30LB04*/
         BAL   @14,ICBMEDR                                         0063
*       RESPECIFY                                                  0064
*         R15 RESTRICTED;           /* RESTRICT REGISTER 15  @Y30LB04*/
*       IF R15^=GOODCODE            /* ICBMEDR ENCOUNTER ERROR?    0065
*                                                            #Y30LB04*/
*         THEN                      /* YES, ERROR IN ICBMEDR #Y30LB04*/
         SLR   @14,@14                                             0065
         CR    R15,@14                                             0065
         BE    @RF00065                                            0065
*         DO;                       /* ERROR CAUSES EXIT     #Y30LB04*/
*           ALLOCPTR=ZERO;          /* ZERO POINTER TO UNIT LIST   0067
*                                                            @ZA13481*/
         L     @10,ALOULPTR(,ALLOPTR)                              0067
         ST    @14,ALLOCPTR(,@10)                                  0067
*           GOTO MERET;             /* MAKE A HASTY EXIT     #Y30LB04*/
         B     MERET                                               0068
*         END;                      /* BACK TO CALLER WITHOUT LIST 0069
*                                                            #Y30LB04*/
*       ELSE                                                       0070
*         ;                         /* ALL WENT WELL FOR ICBMEDR   0070
*                                                            #Y30LB04*/
@RF00065 DS    0H                                                  0071
*       ACALLCNT=ONE;               /* COUNT THIS FIRST ENTRY      0071
*                                                            #Y30LB04*/
         L     @14,ALOWKPTR(,ALLOPTR)                              0071
         MVC   ACALLCNT(4,@14),@CF00063                            0071
*     END;                          /* FIRST TIME PROCESSING #Y30LB04*/
*   ELSE                                                           0073
*     ;                             /* NOT FIRST TIME, NOTHING     0073
*                                      SPECIAL               #Y30LB04*/
@RF00061 DS    0H                                                  0074
*   FABFLAGP=ADDR(FABFLAGS);        /* SET FLAGS FOR IEFAB4UV      0074
*                                                            #Y30LB04*/
         LA    @14,FABFLAGS                                        0074
         ST    @14,FABFLAGP                                        0074
*   FABFLAGS=MEFLAGS;               /* TELL IEFAB4UV THIS IS MSSC  0075
*                                                            @Y30LB04*/
         MVC   FABFLAGS(2),MEFLAGS                                 0075
*   FABUNITP=ADDR(UNITSTUF);        /* LOCATE UNIT INFO FOR IT     0076
*                                                            #Y30LB04*/
         LA    @14,UNITSTUF                                        0076
         ST    @14,FABUNITP                                        0076
*   FABULIST=ZERO;                  /* ZERO FOR IEFAB4UV TO FILL IN
*                                                            #Y30LB04*/
         SLR   @14,@14                                             0077
         ST    @14,FABULIST                                        0077
*   ACALL=ACALLCNT;                 /* NUMBER OF TIMES CALLED      0078
*                                                            #Y30LB04*/
         L     @14,ALOWKPTR(,ALLOPTR)                              0078
         L     @14,ACALLCNT(,@14)                                  0078
         ST    @14,ACALL                                           0078
*   CONTINUE=YES;                   /* STILL LOOKING FOR STAGING   0079
*                                      DRIVE GROUP           @Y30LB04*/
         OI    CONTINUE,B'01000000'                                0079
*   DO ACALLCNT=ACALL TO LISTLEN WHILE CONTINUE=YES;/*       #Y30LB04*/
         B     @DE00080                                            0080
@DL00080 TM    CONTINUE,B'01000000'                                0080
         BNO   @DC00080                                            0080
*     R1=ADDR(FABPARMS);            /* SET UP PARAMETERS     #Y30LB04*/
         LA    R1,FABPARMS                                         0081
*     FABUNAME=SDGPTR->SDGNNBBB(ACALLCNT);/* UNIT NAME       @ZA08838*/
         L     @14,ALOWKPTR(,ALLOPTR)                              0082
         L     @14,ACALLCNT(,@14)                                  0082
         SLA   @14,3                                               0082
         ALR   @14,SDGPTR                                          0082
         AL    @14,@CF01230                                        0082
         MVC   FABUNAME(8),SDGNNBBB(@14)                           0082
*     R15=ICBFAB;                   /* ADDRESS OF IEFAB4UV   #Y30LB04*/
         L     @10,CVTPTR                                          0083
         L     @10,CVTEXT2(,@10)                                   0083
         L     @10,CVTICB(,@10)                                    0083
         L     R15,ICBFAB(,@10)                                    0083
*     RESPECIFY                                                    0084
*       R14 RESTRICTED;             /* RESTRICT REGISTER 14  @Y30LB04*/
*IIEFAB4U:                          /* USE OF IEFAB4UV       @YD00151*/
*     GEN(BALR 14,15);              /* GET UNIT LIST         #Y30LB04*/
IIEFAB4U BALR 14,15
*     RFY                                                          0086
*       R14 UNRSTD;                 /* FREE UP REGISTER 14   #Y30LB04*/
*                                                                  0086
*     /***************************************************************/
*     /*                                                             */
*     /* NOTE -- IEFAB4UV BUILDS THE UNIT LIST AND SETS A    #Y30LB04*/
*     /* POINTER TO IT INTO THE ICBME COMMUNICATION AREA     #Y30LB04*/
*     /*                                                             */
*     /***************************************************************/
*                                                                  0087
*     IF R15^=GOODCODE              /* DID IEFAB4UV BUILD LIST ?   0087
*                                                            #Y30LB04*/
*       THEN                        /* THE LIST WAS NOT BUILT      0087
*                                                            #Y30LB04*/
         LTR   R15,R15                                             0087
         BZ    @RF00087                                            0087
*       DO;                         /* FIND OUT WHY & WHETHER TO   0088
*                                      CONTINUE              #Y30LB04*/
*         IF R15=NOTAVAIL           /* CANNOT THIS HOST USE THIS   0089
*                                      UNIT?                 #Y30LB04*/
*           THEN                    /* THIS HOST CANNOT USE THIS   0089
*                                      UNIT,WILL LOOP        #Y30LB04*/
         C     R15,@CF00055                                        0089
         BE    @RT00089                                            0089
*           ;                       /* THRU AGAIN FOR NEXT STAGING 0090
*                                      DRIVE GROUP           #Y30LB04*/
*         ELSE                      /* ANOTHER FAILURE TO BUILD THE
*                                      LIST                  #Y30LB04*/
*           DO;                     /* WILL NOT CALL IEFAB4UV AGAIN
*                                      THIS TIME             #Y30LB04*/
*             ALLOCPTR=ZERO;        /* ZERO PTR TO UNIT LIST @ZA13481*/
         L     @14,ALOULPTR(,ALLOPTR)                              0092
         SLR   @10,@10                                             0092
         ST    @10,ALLOCPTR(,@14)                                  0092
*             CONTINUE=NO;          /* TIME TO QUIT CALLING IEFAB4UV
*                                                            #Y30LB04*/
         NI    CONTINUE,B'10111111'                                0093
*           END;                    /* IEFAB4UV RETURN WITHOUT LIST
*                                                            #Y30LB04*/
*       END;                        /* LOGIC FOR NO LIST BUILT     0095
*                                                            #Y30LB04*/
*     ELSE                          /* REG 15 WAS 0, HAVE LIST NOW 0096
*                                                            #Y30LB04*/
*       DO;                         /* PROVIDE ADDR FOR CALLER OF  0096
*                                      ICBME                 #Y30LB04*/
         B     @RC00087                                            0096
@RF00087 DS    0H                                                  0097
*         ALLOCPTR=FABULIST;        /* UNIT LIST ADDR INTO ALLOC AREA
*                                                            @ZA13481*/
         L     @14,ALOULPTR(,ALLOPTR)                              0097
         L     @10,FABULIST                                        0097
         ST    @10,ALLOCPTR(,@14)                                  0097
*         CONTINUE=NO;              /* TIME TO QUIT CALLING IEFAB4UV
*                                                            #Y30LB04*/
         NI    CONTINUE,B'10111111'                                0098
*       END;                        /* LIST TO CALLER COMMUNICATION
*                                                            #Y30LB04*/
*   END;                            /* OF THE DO WHILE       #Y30LB04*/
@RC00087 L     @10,ALOWKPTR(,ALLOPTR)                              0100
         LA    @14,1                                               0100
         AL    @14,ACALLCNT(,@10)                                  0100
@DE00080 L     @10,ALOWKPTR(,ALLOPTR)                              0100
         ST    @14,ACALLCNT(,@10)                                  0100
         C     @14,@CF01056                                        0100
         BNH   @DL00080                                            0100
@DC00080 DS    0H                                                  0101
*MERET:                             /*                       #Y30LB04*/
*   RETURN;                         /* BACK TO ICBME CALLER  #Y30LB04*/
@EL00001 L     @13,4(,@13)                                         0101
@EF00001 L     @00,@SIZDATD                                        0101
         LR    @01,@11                                             0101
         FREEMAIN R,LV=(0),A=(1)
@ER00001 LM    @14,@12,12(@13)                                     0101
         BR    @14                                                 0101
*                                                                  0102
*/********************************************************** #Y30LB04*/
*/*                                                          #Y30LB04*/
*/*   ICBMEDR: MSSC MOUNT EQUALIZATION AND DATA REUSE        #Y30LB04*/
*/*                                                          #Y30LB04*/
*/*   INPUT: POINTER TO ALLOCATION PARAMETER LIST            #Y30LB04*/
*/*            MSSC ACTIVITY BUFFER (FOUND VIA CVT AND MSSC  #Y30LB04*/
*/*                        CONTROL BLOCK)                    #Y30LB04*/
*/*                                                          #Y30LB04*/
*/* PROCESSING: COPIES MSSC ACTIVITY BUFFER INTO ALLOCATION  #Y30LB04*/
*/*               BUFFER                                     #Y30LB04*/
*/*            ENTERS KEY ZERO FOR LOCK ENTRIES AND MSSC     #Y30LB04*/
*/*              I/O DRIVER USE                              #Y30LB04*/
*/*            FOR SPECIFIC VOLUME, DOES DIAGNOSTIC READ TO  #Y30LB04*/
*/*              MSC FOR MOUNTED VOLUME TABLE ENTRY          #Y30LB04*/
*/*            IF THAT VOLUME WAS MOUNTED, FINDS THE         #Y30LB04*/
*/*              CORRESPONDING STAGING DRIVE GROUP IN THE    #Y30LB04*/
*/*              MSSC ACTIVITY BUFFER LIST AND MOVES IT TO   #Y30LB04*/
*/*              THE TOP OF THE LIST IN ALLOCATION COPY      #Y30LB04*/
*/*            RETURNS TO KEY OF SCHEDULER                   #Y30LB04*/
*/*                                                          #Y30LB04*/
*/*   OUTPUT:  BUFFER FOR ALLOCATION TO USE IN CHOOSING      #Y30LB04*/
*/*              VOLUME                                      #Y30LB04*/
*/*          R15 IS ZERO IF ALL WENT WELL                    #Y30LB04*/
*/*          R15 CONTAINS ERROR CODE IF ANY PROBLEM          #Y30LB04*/
*/*                                                          #Y30LB04*/
*/********************************************************** #Y30LB04*/
*                                                                  0102
*ICBMEDR:                                                          0102
*   PROCEDURE OPTIONS(NOSAVE,NOSAVEAREA);/* DATA REUSE       #Y30LB04*/
         B     @EL00001                                            0102
ICBMEDR  DS    0H                                                  0103
*   DCL                                                            0103
*     MEDR14 PTR(31) AUTOMATIC;     /* FOR RETURN ADDRESS    @YD00151*/
*   DCL                                                            0104
*     MELOCSAV(5) POINTER(31) AUTOMATIC;/* FOR SETLOCK       #Y30LB04*/
*   RFY                                                            0105
*     R14 RSTD;                     /* RESTRICT REGISTER 14  #Y30LB04*/
*   MEDR14=R14;                     /* SAVE RETURN ADDRESS   #Y30LB04*/
         ST    R14,MEDR14                                          0106
*   RFY                                                            0107
*     R14 UNRSTD;                   /* FREE UP REGISTER 14   #Y30LB04*/
*   RFY                                                            0108
*     R13 RSTD;                     /* RESTRICT REGISTER 13  #Y30LB04*/
*   R13SAVE=R13;                    /* SAVE OWN REGISTER 13  #Y30LB04*/
         ST    R13,R13SAVE                                         0109
*   R13=ADDR(MELOCSAV);             /* PROVIDE REGSAVE TO SETLOCK  0110
*                                                            #Y30LB04*/
         LA    R13,MELOCSAV                                        0110
*IMODESE1:                          /* FIRST ICBME MODESET USE     0111
*                                                            #Y30LB04*/
*   DO;                             /* MODESET KEYADDR(ZERO)         */
IMODESE1 DS    0H                                                  0112
*     SPKA(ZERO);                   /* SET PSW KEY                   */
         SLR   @14,@14                                             0112
         SPKA  0(@14)                                              0112
*   END;                            /* MODESET KEYADDR(ZERO) GET INTO
*                                      KEY 0                 #Y30LB04*/
*ISTAE1:                            /* FIRST STAE MACRO DEPENDENCY IN
*                                      ICBME                 @ZA08838*/
*/* ******************************************************** @ZA08838*/
*/*  STAE REMOTE LIST FOR AUTOMATIC STORAGE                  @ZA08838*/
*/*  NOTE (DEPENDCY) -- THE LENGTH OF STAERL MUST BE         @ZA08838*/
*/*  THE NUMBER OF BYTES GENERATED BY THE EXPANSION OF       @ZA08838*/
*/*  THE STATEMENT STAE MF=L, FOR USE AS A REQUEST LIST      @ZA08838*/
*/*  AT THE STATEMENT LABELED ISTAE2 IN THIS SEGMENT         @ZA08838*/
*/* ******************************************************** @ZA08838*/
*                                                                  0114
*   DCL                                                            0114
*     STAERL CHAR(12) BDY(WORD);    /* STAE REMOTE LIST      @ZA08838*/
ISTAE1   DS    0H                                                  0115
*   BASEVALU=R12;                   /* SAVE BASE ADDRESS FOR MEREXIT
*                                                            @ZA08838*/
         ST    R12,BASEVALU                                        0115
*   STAERL=''B;                     /* ZERO STAE REMOTE PARM LIST  0116
*                                                            @ZA08838*/
         XC    STAERL(12),STAERL                                   0116
*   RFY                                                            0117
*     R1 RSTD;                      /* RESTRICT REGISTER 1   @ZA08838*/
*   R1=ADDR(STAERL);                /* ADDRESS OF STAE LIST  @ZA08838*/
         LA    R1,STAERL                                           0118
*ISTAE2:                            /* ESTABLISH STAE ENVIRONMENT  0119
*                                                            @ZA08838*/
*   GEN(STAE MEREXIT,PARAM=(R11),MF=(E,(1)))/* RECOVERY EXIT @ZA08838*/
*   REFS(MEREXIT,R11,R1) SETS(R15); /* MEREXIT ROUTINE       @ZA08838*/
ISTAE2   STAE MEREXIT,PARAM=(R11),MF=(E,(1))
*ISETLOC1:                          /*                       #Y30LB04*/
*   GEN REFS(R0,R1,R15,PSALITA)     /*                       #Y30LB04*/
*       SETS(R15);                                                 0120
ISETLOC1 DS    0H                                                  0120
*                                                         /*#Y30LB04*/
       SETLOCK OBTAIN,TYPE=LOCAL,MODE=UNCOND,REGS=SAVE,RELATED=(LOCALL**
               OCK,ICBME(ISETLOC3,ISETLOC5))                  @YD00151
*ISETLOC2:                          /*                       #Y30LB04*/
*   GEN REFS(R0,R1,R15,PSALITA)     /*                       #Y30LB04*/
*       SETS(R15);                                                 0121
*                                                                  0121
ISETLOC2 DS    0H                                                  0121
*                                                       /*  #Y30LB04*/
       SETLOCK OBTAIN,TYPE=CMS,MODE=UNCOND,REGS=SAVE,RELATED=(LOCALLOC**
               K,ICBME(ISETLOC4))                             @YD00151
*   /*****************************************************************/
*   /*                                                               */
*   /* NOW COPY THE ACTIVITY BUFFER INTO ALLOCATION          #Y30LB04*/
*   /* PARAMETER LIST, WITH PROTECTION OF LOCAL & CMS LOCKS  #Y30LB04*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0122
*   ALOBUF=ICBOPT->SDGLS;           /* FROM ACTIVITY BUFFER INTO   0122
*                                      ALLOCATION BUFFER     @ZA08838*/
*                                                                  0122
         L     @14,ALOWKPTR(,ALLOPTR)                              0122
         L     @10,CVTPTR                                          0122
         L     @10,CVTEXT2(,@10)                                   0122
         L     @10,CVTICB(,@10)                                    0122
         L     @10,ICBOPT(,@10)                                    0122
         MVC   ALOBUF(240,@14),SDGLS(@10)                          0122
*   /*****************************************************************/
*   /*                                                               */
*   /* FREE THE CMS AND LOCAL LOCKS, NO LONGER REQUIRED      #Y30LB04*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0123
*ISETLOC3:                          /*                       @YD00151*/
*   GEN REFS(R0,R1,R15,PSALITA)     /*                       #Y30LB04*/
*       SETS(R15);                                                 0123
ISETLOC3 DS    0H                                                  0123
*                                                        /* #Y30LB04*/
       SETLOCK RELEASE,TYPE=CMS,REGS=SAVE,RELATED=(CMSLOCK,ICBME(ISETLOO
               C2))                                           @Y30LB04
*ISETLOC4:                          /*                       @YD00151*/
*   GEN REFS(R0,R1,R15,PSALITA)     /*                       #Y30LB04*/
*       SETS(R15);                                                 0124
ISETLOC4 DS    0H                                                  0124
*                                                         /*#Y30LB04*/
       SETLOCK RELEASE,TYPE=LOCAL,REGS=SAVE,RELATED=(LOCALLOCK,ICBME(I**
               SETLOC1))                                      @Y30LB04
*   IF AVOLWORD=NOVOLID             /* WAS NO VOLUME SPECIFIED     0125
*                                                            #Y30LB04*/
*     THEN                          /* NOT SPECIFIC REQUEST  #Y30LB04*/
         L     @14,ALOVLIPT(,ALLOPTR)                              0125
         ICM   @10,15,AVOLWORD(@14)                                0125
         BZ    @RT00125                                            0125
*     ;                             /* SO JUST RETURN        #Y30LB04*/
*   ELSE                            /* HAVE SPECIFIC VOLUME REQUEST
*                                                            #Y30LB04*/
*     DO;                           /* SEE IF MOUNTED TO MSC #Y30LB04*/
*       CALL VOLENTR;               /* GETS MOUNTED VOLUME TABLE   0128
*                                      ENTRY                 #Y30LB04*/
*                                                                  0128
         BAL   @14,VOLENTR                                         0128
*       /*************************************************************/
*       /*                                                           */
*       /* THERE MAY OR NOT BE A MOUNTED VOLUME TABLE ENTRY  #Y30LB04*/
*       /*                                                           */
*       /*************************************************************/
*                                                                  0129
*       IF R15^=GOODCODE            /* WAS THERE AN ERROR ?  #Y30LB04*/
*         THEN                      /* SOME VOLENTR (ETC) PROBLEM  0129
*                                                            #Y30LB04*/
         LTR   R15,R15                                             0129
         BNZ   @RT00129                                            0129
*         ;                         /* NO MORE FOR THIS TIME #Y30LB04*/
*       ELSE                        /* NO ERROR FROM VOLENTR #Y30LB04*/
*         DO;                       /* CONTINUE PROCESSING   #Y30LB04*/
*           IF MOUNTED=NO           /* WAS VOL NOT MOUNTED ? #Y30LB04*/
*             THEN                  /* NO MOUNTED VOLUME TABLE ENTRY
*                                      IN MSC                #Y30LB04*/
         TM    MOUNTED,B'10000000'                                 0132
         BZ    @RT00132                                            0132
*             ;                     /* ACTIVITY BUFFER RETURNS AS IS
*                                                            #Y30LB04*/
*           ELSE                    /* VOLUME WAS MOUNTED    #Y30LB04*/
*             DO;                   /* MAY REARRANGE BUFFER  #Y30LB04*/
*               CALL MATCHSRT;      /* MATCH & PUT ON TOP OF BUFFER
*                                                            @Y30LB04*/
         BAL   @14,MATCHSRT                                        0135
*             END;                  /* PROCESSING WHEN VOLUME MOUNTED
*                                                            #Y30LB04*/
*         END;                      /* SPECIFIC VOLUME REQUEST,NO  0137
*                                      ERROR                 #Y30LB04*/
@RT00132 DS    0H                                                  0138
*     END;                          /* SPECIFIC VOLUME PROCESSING  0138
*                                                            #Y30LB04*/
@RT00129 DS    0H                                                  0139
*   RFY                                                            0139
*     R14 RSTD;                     /* RESTRICT REGISTER 14  @Y30LB04*/
@RT00125 DS    0H                                                  0140
*MEDRRET:                           /*                       @Y30LB04*/
*IMODESE2:                          /* 2ND USE OF MODESET MACRO IN 0140
*                                      ICBME                 @Y30LB04*/
*   DO;                             /* MODESET EXTKEY(SCHED)         */
MEDRRET  DS    0H                                                  0140
IMODESE2 DS    0H                                                  0141
*     SPKA(16);                     /* SET PSW KEY                   */
         LA    @10,16                                              0141
         SPKA  0(@10)                                              0141
*   END;                            /* MODESET EXTKEY(SCHED) BACK TO
*                                      SCHEDULER KEY         @Y30LB04*/
*ISTAE3:                            /* INVOKE STAE MACRO     @ZA08838*/
*   GEN(STAE 0);                    /* DELETE STAE PROTECTION      0143
*                                                            @ZA08838*/
ISTAE3   STAE 0
*   R14=MEDR14;                     /* RESTORE RETURN TO CALLER    0144
*                                                            @Y30LB04*/
         L     R14,MEDR14                                          0144
*   RFY                                                            0145
*     R14 UNRSTD;                   /* FREE UP REGISTER 14   @Y30LB04*/
*   R13=R13SAVE;                    /* RESTORE OWN REGISTER 13     0146
*                                                            @Y30LB04*/
         L     R13,R13SAVE                                         0146
*   RFY                                                            0147
*     R13 UNRSTD;                   /* FREE UP REGISTER 13   @Y30LB04*/
*/********************************************************** @ZA08838*/
*/*                                                          @ZA08838*/
*/*     MEREXIT -- RECOVERY EXIT ROUTINE FOR ICBME,ICBMEDR   @ZA08838*/
*/*                                                          @ZA08838*/
*/*  INPUT:                                                  @ZA08838*/
*/*    R14 HAS THE RETURN ADDRESS                            @ZA08838*/
*/*    R12 TELLS WHETHER A STAE WORK AREA WAS ALLOCATED      @ZA08838*/
*/*   IF THERE WAS NONE,                                     @ZA08838*/
*/*     R2 HAS ADDRESS OF USER PARAMETER LIST                @ZA08838*/
*/*   IF THERE IS ONE                                        @ZA08838*/
*/*     R0 HAS INFORMATION ABOUT I/O ACTIVITY (NOT USED)     @ZA08838*/
*/*     R1 HAS ADDRESS OF STAE WORK AREA, IN WHICH IS        @ZA08838*/
*/*        A POINTER TO USER PARAMETER LIST                  @ZA08838*/
*/*                                                          @ZA08838*/
*/* PROCESSING:  MEREXIT ESTABLISHES ADDRESSABILITY AND      @ZA08838*/
*/*     REASSUMES THE KEY OF THE SCHEDULER, SO THE           @ZA08838*/
*/*     RECOVERY TERMINATION ROUTINES OF ITS CALLERS WILL    @ZA08838*/
*/*     BE ENTERED IN THE APPROPRIATE KEY                    @ZA08838*/
*/*  MEREXIT SETS R15 TO ZERO TO CONTINUE WITH               @ZA08838*/
*/*  TERMINATION                                             @ZA08838*/
*/*  MEREXIT RETURNS AS DIRECTED BY R14 ON ENTRY             @ZA08838*/
*/*                                                          @ZA08838*/
*/*  OUTPUT: NONE                                            @ZA08838*/
*/*                                                          @ZA08838*/
*/*********************************************************  @ZA08838*/
*                                                                  0148
*MEREXIT:                                                          0148
*   PROCEDURE OPTIONS(NOSAVE,NOSAVEAREA);/*                  @ZA08838*/
         B     @PB00003                                            0148
MEREXIT  DS    0H                                                  0149
*   GEN(USING *,R15);               /* ESTABLISH INITIAL           0149
*                                      ADDRESSABILITY        @ZA08838*/
         USING *,R15
*   RESPECIFY                                                      0150
*    (R0,                                                          0150
*     R2,                                                          0150
*     R14) RSTD;                    /*                       @ZA08838*/
*   IF R0=HVNOSDWA THEN             /* IS THERE NO STORAGE WORK AREA
*                                                            @ZA08838*/
         C     R0,@CF00033                                         0151
         BNE   @RF00151                                            0151
*     DO;                           /*                       @ZA08838*/
*       R11=R2;                     /* ADDRESS OF ICBME DATA AREA  0153
*                                      FROM REG              @ZA08838*/
         LR    R11,R2                                              0153
*     END;                          /*                       @ZA08838*/
*   ELSE                            /* THERE IS A STAE WORK AREA   0155
*                                                            @ZA08838*/
*     DO;                           /*                       @ZA08838*/
         B     @RC00151                                            0155
@RF00151 DS    0H                                                  0156
*       R11=STAEWORK;               /* ADDRESS OF ICBME AUTOMATIC  0156
*                                      STORAGE               @ZA08838*/
         L     R11,STAEWORK(,R1)                                   0156
*     END;                          /*                       @ZA08838*/
*                                                                  0157
*   /*****************************************************************/
*   /*                                                               */
*   /* REGISTER ELEVEN WILL NOW CONTAIN THE ADDRESS          @ZA08838*/
*   /* OF ICBME AUTOMATIC STORAGE                            @ZA08838*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0158
*   R12=BASEVALU;                   /*                       @ZA08838*/
@RC00151 L     R12,BASEVALU                                        0158
*   GENERATE REFS(R11,R12,R15);                                    0159
*                            /*CHANGE ADDRESSABILITY        @ZA08838*/
          DROP R15             NO LONGER NEEDED
          USING @PSTART,R12    LOCATE ICBME BEGINNING
          USING @DATD,R11      AND ITS AUTOMATIC STORAGE
*   RFY                                                            0160
*     R15 RSTD;                     /*                       @ZA08838*/
*   R14SAVE=R14;                    /* SAVE ADDRESS FOR RETURN     0161
*                                                            @ZA08838*/
         ST    R14,R14SAVE                                         0161
*   R15=CONTERM;                    /* TO CONTINUE WITH TERMINATION
*                                                            @ZA08838*/
         SLR   R15,R15                                             0162
*   RFY                                                            0163
*     R15 UNRSTD;                   /*                       @ZA08838*/
*IMODESE3:                          /* NEED SCHEDULER KEY FOR ITS  0164
*                                      RECOVERY RTNS         @ZA08838*/
*   DO;                             /* MODESET EXTKEY(SCHED)         */
IMODESE3 DS    0H                                                  0165
*     SPKA(16);                     /* SET PSW KEY                   */
         LA    @15,16                                              0165
         SPKA  0(@15)                                              0165
*   END;                            /* MODESET EXTKEY(SCHED) BACK TO
*                                      SCHEDULER KEY         @ZA08838*/
*   R14=R14SAVE;                    /* RESTORE RETURN TO CALLER    0167
*                                                            @ZA08838*/
         L     R14,R14SAVE                                         0167
*   RFY                                                            0168
*    (R0,                                                          0168
*     R2,                                                          0168
*     R14) UNRSTD;                  /*                       @ZA08838*/
*   RETURN;                         /* BACK TO CALLER        #Y30LB04*/
@EL00003 DS    0H                                                  0169
@EF00003 DS    0H                                                  0169
@ER00003 BR    @14                                                 0169
*   END MEREXIT;                    /*                       @ZA08838*/
*   END ICBMEDR;                    /* END MOUNT EQUALIZATION & DATA
*                                      REUSE                 #Y30LB04*/
@EL00002 DS    0H                                                  0171
@EF00002 DS    0H                                                  0171
@ER00002 BR    @14                                                 0171
*                                                                  0172
*/********************************************************** #Y30LB04*/
*/*                                                          #Y30LB04*/
*/*  VOLENTR: GET MOUNTED VOLUME TABLE ENTRY FROM MSC, FOR   @Y30LB04*/
*/*           VOLID SPECIFIED                                @Y30LB04*/
*/*                                                          @Y30LB04*/
*/*    INPUT:  POINTER TO THE VOLID IN THE ALLOCATION        @Y30LB04*/
*/*         PARAMETER LIST                                   @Y30LB04*/
*/*                                                          @Y30LB04*/
*/*     DETERMINES WHETHER THE VOLUME WAS MOUNTED, AND IF SO #Y30LB04*/
*/*     GETS THE IDENTIFICATION OF WHICH STAGING DRIVE GROUP #Y30LB04*/
*/*     IT WAS MOUNTED ON FROM INFORMATION RETURNED BY THE   #Y30LB04*/
*/*     MSC                                                  #Y30LB04*/
*/*     SETS AN INDICATOR THAT THE VOLUME WAS MOUNTED        @ZA08838*/
*/*                                                          #Y30LB04*/
*/*  OUTPUT:  R15 = 0 IF NO ERROR WAS ENCOUNTERED            #Y30LB04*/
*/*     SETS MOUNTED = YES IF THE VOLUME WAS MOUNTED         #Y30LB04*/
*/*     CONVERTS THE BINARY NUMBER TO EBCDIC, AS THE NN      #Y30LB04*/
*/*     SETS MTDNN TO EBCDIC VERSION OF NUMBER FOUND IN      #Y30LB04*/
*/*     MOUNTED VOLUME TABLE ENTRY                           #Y30LB04*/
*/*                                                          #Y30LB04*/
*/********************************************************** #Y30LB04*/
*                                                                  0172
*VOLENTR:                                                          0172
*   PROCEDURE OPTIONS(NOSAVE,NOSAVEAREA);/* VOL ENTRY        #Y30LB04*/
VOLENTR  DS    0H                                                  0173
*/*  FIRST INDICES ARE OFFSETS IN THE BUFFER (FOR IN OR OUT) #Y30LB04*/
*/*  NOTE THAT INDEX IS CALCULATED BEGINNING WITH ZEROTH     @Y30LB04*/
*/*  BYTE BEING COUNTED AS THE POSITION ONE, CONTRARY TO     @Y30LB04*/
*/*  SOME OTHER COUNTING SYSTEMS...                          @Y30LB04*/
*                                                                  0173
*   DCL                                                            0173
*     VOL14 PTR(31) AUTOMATIC;      /* FOR RETURN ADDRESS    @ZA08838*/
*   DCL                                                            0174
*     VOLINDX FIXED(8) CONSTANT(17);/* VOLID LOC IN BUFFR    #Y30LB04*/
*   DCL                                                            0175
*     MVOLNDX FIXED(8) CONSTANT(45);/* INDIC IF MTD VOL ENTRY      0175
*                                                            #Y30LB04*/
*   DCL                                                            0176
*     SDGNDX FIXED(15) CONSTANT(272);/* BINARY NUMBER LOC.   @Y30LB04*/
*   RFY                                                            0177
*     R14 RSTD;                     /* RESTRICT REGISTER 14  #Y30LB04*/
*   VOL14=R14;                      /* SAVE RETURN ADDRESS   #Y30LB04*/
         ST    R14,VOL14                                           0178
*   RFY                                                            0179
*     R14 UNRSTD;                   /* FREE UP REGISTER 14   #Y30LB04*/
*                                                                  0179
*   /*****************************************************************/
*   /*                                                               */
*   /* SETUP PARM AREA FOR ICBQUERY                          @ZA08838*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0180
*   TABID=MVTTAB;                   /* MVT TABLE ID          @ZA08838*/
         MVC   TABID(1),MVTTAB                                     0180
*   TABRD=MVTRD;                    /* MVT READ ONLY         @ZA08838*/
         MVC   TABRD(1),MVTRD                                      0181
*   TABSEC='0000'X;                 /*                       @ZA08838*/
         MVC   TABSEC(2),@CB01210                                  0182
*   TABMVT=AVOLID;                  /* VOLID                 @ZA08838*/
         L     @10,ALOVLIPT(,ALLOPTR)                              0183
         MVC   TABMVT(6),AVOLID(@10)                               0183
*   TABFILL=''B;                    /*                       @ZA08838*/
         XC    TABFILL(10),TABFILL                                 0184
*   R15SAVE=GOODCODE;               /* PREPARE GOOD RETURN CODE FOR
*                                      CALLER                #Y30LB04*/
         SLR   @10,@10                                             0185
         ST    @10,R15SAVE                                         0185
*ICBQUE1:                                                          0186
*                                                                  0186
*   /*****************************************************************/
*   /*                                                               */
*   /* *******************************************************       */
*   /*                                                       @Z40LB22*/
*   /* MSSC ICBQUERY QSWCS/QLAB/QTAB/QSWCS QCEL MACRO        @Z40LB22*/
*   /* OS/VS2 VERSION-- 03/21/75 LEVEL 00                    @Z40LB22*/
*   /* THIS IS THE OUTPUT FOR THE EXECUTE FORM.              @Z40LB22*/
*   /* THE LIST FORM OF THIS MACRO SHOULD BE                 @Z40LB22*/
*   /* INVOKED FIRST IN ORDER TO SET UP NECESSARY            @Z40LB22*/
*   /* DECLARES. IF THE COMPLETE ARGUMENT IS                 @Z40LB22*/
*   /* SPECIFIED THE REQ BLOCK WILL BE ZEROED.               @Z40LB22*/
*   /* *******************************************************       */
*   /*                                                       @Z40LB22*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0186
*   RFY                                                            0186
*    (QUERR1) RSTD;                 /* RESTRICT R1           @Z40LB22*/
ICBQUE1  DS    0H                                                  0187
*   QUERR1=ADDR(QUERLIST);          /* SET QUERR1 TO REQ BLOCK     0187
*                                                            @Z40LB22*/
         LA    QUERR1,QUERLIST                                     0187
*   QUERLIST=QUERLIST&&QUERLIST;    /* ZERO REQUEST BLOCK    @Z40LB22*/
         XC    QUERLIST(44),QUERLIST                               0188
*   QULEN='2C'X;                    /* SET LENGTH FIELD      @Z40LB22*/
         LA    @10,44                                              0189
         ST    @10,QULEN                                           0189
*   QUORD='05'X;                    /* SET OPCODE FIELD      @Z40LB22*/
         MVI   QUORD,X'05'                                         0190
*   QUCODE='06'X;                   /* SET CODE TYPE         @Z40LB22*/
         MVI   QUCODE,X'06'                                        0191
*   QUPARM=(TABPARM);               /* FILL IN PARAMETERS    @Z40LB22*/
         MVI   QUPARM+20,C' '                                      0192
         MVC   QUPARM+21(11),QUPARM+20                             0192
         MVC   QUPARM(20),TABPARM                                  0192
*   QUPTR=ADDR(BUFFER);             /* ADDR OF DATAPTR FIELD @Z40LB22*/
         LA    @10,BUFFER                                          0193
         ST    @10,QUPTR                                           0193
*   SVC(126);                       /* ISSUE SVC INST.       @Z40LB22*/
         SVC   126                                                 0194
*   RFY                                                            0195
*    (QUERR1) UNRSTD;               /* UNRESTRICT R1         @Z40LB22*/
*                                                                  0195
*   /*****************************************************************/
*   /*                                                               */
*   /*                                                       @ZA08838*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0196
*   RFY                                                            0196
*     R15 RSTD;                     /*                       @ZA08838*/
*   IF R15^=GOODCODE THEN           /* WAS THERE AN ERROR    @ZA08838*/
         LTR   R15,R15                                             0197
         BZ    @RF00197                                            0197
*     DO;                           /*                       @ZA08838*/
*       R15SAVE=R15;                /* SAVE RETURN CODE FOR CALLER 0199
*                                                            @ZA08838*/
         ST    R15,R15SAVE                                         0199
*       RFY                                                        0200
*         R15 UNRSTD;               /*                       @ZA08838*/
*     END;                          /*                       @ZA08838*/
*   ELSE                                                           0202
*     DO;                           /*                       @ZA08838*/
         B     @RC00197                                            0202
@RF00197 DS    0H                                                  0203
*       IF BUFFER(MVOLNDX)^=MVENT   /* SEE IF HAD AN ENTRY   @ZA08838*/
*         THEN                                                     0203
         CLC   BUFFER+44(1),MVENT                                  0203
         BNE   @RT00203                                            0203
*         ;                         /* NO MOUNTED VOL TABLE ENTRY  0204
*                                                            #Y30LB04*/
*       ELSE                        /* THIS VOLUME HAD MTD VOL TBL 0205
*                                      ENTRY                 #Y30LB04*/
*         DO;                       /* USE MTD VOL TABLE ENTRY INFO
*                                                            #Y30LB04*/
*                                                                  0205
*           /*********************************************************/
*           /*                                                       */
*           /* PICK UP THE BINARY REPRESENTATION OF THE NUMBER       */
*           /*                                               #Y30LB04*/
*           /* (NN) OF THE STAGING DRIVE GROUP UPON WHICH    #Y30LB04*/
*           /* THE VOLUME IS OR HAS JUST BEEN MOUNTED        #Y30LB04*/
*           /*                                                       */
*           /*********************************************************/
*                                                                  0206
*           NNBYT=BUFFER(SDGNDX);   /* NN OF STAGING DRIVE GROUP   0206
*                                                            #Y30LB04*/
         SLR   @10,@10                                             0206
         IC    @10,BUFFER+271                                      0206
         STC   @10,NNBYT                                           0206
*           IF NNBYT<LISTLEN        /* IS THIS A VALID NUMBER?     0207
*                                                            #Y30LB04*/
*             THEN                  /* THIS IS A VALID STAGING DRIVE
*                                      GROUP                 #Y30LB04*/
         CLI   NNBYT,28                                            0207
         BNL   @RF00207                                            0207
*             DO;                   /* WILL USE NUMBER RETURNED    0208
*                                                            #Y30LB04*/
*                                                                  0208
*               /*****************************************************/
*               /*                                                   */
*               /* CONVERT BINARY NN TO NN IN EBCDIC, TO MATCH NN OF */
*               /*                                           #Y30LB04*/
*               /* SDGNNBBB THUS FINDING STAGING DRIVE GROUP NUMBER  */
*               /*                                           #Y30LB04*/
*               /*                                                   */
*               /*****************************************************/
*                                                                  0209
*               PLACCONV='000000'X; /* CLEAR CONVERTING PLACE      0209
*                                                            #Y30LB04*/
         MVC   PLACCONV(3),@CB01218                                0209
*               CVD(NNBYT,C2WORK);  /* CONVERT NN TO PACKED DECIMAL
*                                                            #Y30LB04*/
         CVD   @10,@TS00001                                        0210
         MVC   C2WORK(2),@TS00001+6                                0210
*               UNPK(PLACCONV,C2WORK);/* PLACCONV GETS UNPACKED NMBR
*                                                            #Y30LB04*/
         UNPK  PLACCONV(3),C2WORK(2)                               0211
*               MTDNN=MTDNN×FOXZRO; /* OR AN F0 INTO LAST BYTE     0212
*                                                            #Y30LB04*/
*                                                                  0212
         OC    MTDNN(2),FOXZRO                                     0212
*               /*****************************************************/
*               /*                                                   */
*               /* MTDNN HAS EBCDIC VERSION OF STAGING DRIVE GROUP   */
*               /*                                           #Y30LB04*/
*               /* NUMBER                                    #Y30LB04*/
*               /*                                                   */
*               /*****************************************************/
*                                                                  0213
*               MOUNTED=YES;        /* NOTE THAT FOUND MTD VOL TBL 0213
*                                      ENTRY                 #Y30LB04*/
         OI    MOUNTED,B'10000000'                                 0213
*             END;                  /* VALID NUMBER PROCESSING     0214
*                                                            #Y30LB04*/
*           ELSE                    /* STAGING DRIVE GROUP NUMBER WAS
*                                      INVALID               #Y30LB04*/
*             ;                     /* RETURN AS IF NO MOUNTED VOLUME
*                                      TABLE ENTRY FOUND     #Y30LB04*/
@RF00207 DS    0H                                                  0216
*         END;                      /* PROCESSING WHERE THERE WAS AN
*                                      MVT ENTRY             #Y30LB04*/
*     END;                          /*                       @ZA08838*/
*                                                                  0217
@RT00203 DS    0H                                                  0218
*   /*****************************************************************/
*   /*                                                               */
*   /* WILL BE JUST AS IF VOLUME NOT FOUND MOUNTED           #Y30LB04*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0218
*   RFY                                                            0218
*    (R14,                                                         0218
*     R15) RSTD;                    /*                       @ZA08838*/
@RC00197 DS    0H                                                  0219
*   R15=R15SAVE;                    /* RETURN INDICATOR FOR CALLER 0219
*                                                            @ZA08838*/
         L     R15,R15SAVE                                         0219
*   R14=VOL14;                      /* RETURN ADDRESS        #Y30LB04*/
         L     R14,VOL14                                           0220
*   RFY                                                            0221
*    (R14,                                                         0221
*     R15) UNRSTD;                  /*                       @ZA08838*/
*   END VOLENTR;                    /* END OF MTD VOL TBL ENTRY    0222
*                                      SEARCH                #Y30LB04*/
@EL00004 DS    0H                                                  0222
@EF00004 DS    0H                                                  0222
@ER00004 BR    @14                                                 0222
*                                                                  0223
*/********************************************************** #Y30LB04*/
*/*                                                          #Y30LB04*/
*/*     MATCHSRT: MATCH AND SORT STAGING DRIVE GROUP OF      #Y30LB04*/
*/*               MOUNTED VOLUME                             #Y30LB04*/
*/*                                                          #Y30LB04*/
*/*     INPUT: THE FOLLOWING --                              #Y30LB04*/
*/*      MTDNN HAS THE NN CORRESPONDING TO THE STAGING DRIVE #Y30LB04*/
*/*       GROUP OF THE MOUNTED VOLUME                        #Y30LB04*/
*/*      SDGPTR HAS THE ADDRESS OF THE ALLOCATION BUFFER     #Y30LB04*/
*/*      ALOBUF HAS THE LIST OF STAGING DRIVE GROUPS IN THE  #Y30LB04*/
*/*      ORDER AS SORTED BY THE MSSC ACTIVITY MODULE         #Y30LB04*/
*/*                                                          #Y30LB04*/
*/*     PROCESSING:  MATCHES THE EBCDIC VERSION OF THE       #Y30LB04*/
*/*      STAGING DRIVE GROUP NUMBER FROM THE MOUNTED VOLUME  #Y30LB04*/
*/*      TABLE ENTRY WITH ONE IN A LIST ENTRY IN THE COPY OF #Y30LB04*/
*/*      THE MSSC ACTIVITY BUFFER, THUS FINDING THE LIST     #Y30LB04*/
*/*      POSITION OF THAT STAGING DRIVE GROUP ON WHICH THE   #Y30LB04*/
*/*      VOLUME HAS BEEN MOUNTED.                            #Y30LB04*/
*/*      IF THE MATCH IS FOUND IN THE FIRST POSITION,        #Y30LB04*/
*/*      RETURNS TO CALLER WITHOUT REARRANGING THE BUFFER    #Y30LB04*/
*/*      OTHERWISE, MAKES THE LIST ENTRY FOR THAT STAGING    #Y30LB04*/
*/*      DRIVE GROUP THE FIRST OF THE LIST IN A TEMPORARY    #Y30LB04*/
*/*      BUFFER, THEN COPIES ANY PREVIOUSLY PRECEDING        #Y30LB04*/
*/*      ENTRIES AFTER THE MOUNTED LIST ENTRY.               #Y30LB04*/
*/*      AT THIS POINT, THE TOP OF THE LIST (DOWN TO THE     #Y30LB04*/
*/*      POSITION OF THE LIST ENTRY AT WHICH THE MATCH       #Y30LB04*/
*/*      WITH THE STAGING DRIVE GROUP NUMBER OF THE          #Y30LB04*/
*/*      MOUNTED VOLUME TABLE ENTRY) IS WRITTEN IN THE       #Y30LB04*/
*/*      TEMPORARY BUFFER, IN THE REARRANGED ORDER.          #Y30LB04*/
*/*      THE TEMPORARY, REARRANGED TOP-OF-LIST IS THEN       #Y30LB04*/
*/*      WRITTEN BACK OVER THE TOP-OF-THE-LIST IN THE        #Y30LB04*/
*/*      ALLOCATION BUFFER OF LIST ENTRIES.                  #Y30LB04*/
*/*                                                          #Y30LB04*/
*/*                                                          #Y30LB04*/
*/*   OUTPUT:  SORTED LIST, WITH THE ENTRY OF THE MOUNTED    #Y30LB04*/
*/*         VOLUME ON TOP, IN THE ALLOCATION BUFFER          #Y30LB04*/
*/*                                                          #Y30LB04*/
*/********************************************************** #Y30LB04*/
*                                                                  0223
*MATCHSRT:                                                         0223
*   PROCEDURE OPTIONS(NOSAVE,NOSAVEAREA);/* MATCH & SORT (SHIFT,   0223
*                                      REALLY) THE LIST OF UNIT NAMES
*                                                            #Y30LB04*/
MATCHSRT DS    0H                                                  0224
*   DCL                                                            0224
*     MAT14 POINTER(31);            /* FOR RETURN ADDRESS    #Y30LB04*/
*   DCL                                                            0225
*     MAT15 POINTER(31);            /* FOR REGISTER FIFTEEN  #Y30LB04*/
*   RFY                                                            0226
*    (R14,                                                         0226
*     R15) RSTD;                    /* RESTRICT REGISTERS 14 & 15  0226
*                                                            #Y30LB04*/
*   MAT14=R14;                      /* SAVE RETURN ADDRESS   #Y30LB04*/
         ST    R14,MAT14                                           0227
*   RFY                                                            0228
*     R14 UNRSTD;                   /* FREE UP REGISTER FOURTEEN   0228
*                                                            #Y30LB04*/
*   MAT15=R15;                      /* SAVE REGISTER FIFTEEN #Y30LB04*/
         ST    R15,MAT15                                           0229
*   RESPECIFY                                                      0230
*     R15 UNRESTRICTED;             /* FREE UP REGISTER 15   #Y30LB04*/
*   MATCH=NO;                       /* INDICATE NO MATCH YET #Y30LB04*/
         NI    MATCH,B'11011111'                                   0231
*/*   LOOK FOR A MATCH IN THE ENTIRE LIST, WITH THE STAGING  #Y30LB04*/
*/*   DRIVE GROUP FROM THE MOUNTED VOLUME TABLE ENTRY        #Y30LB04*/
*                                                                  0232
*   DO MATCHDX=1 TO LISTLEN WHILE MATCH=NO;/* LOOK LOOP      @ZA08838*/
*                                                                  0232
         LA    @10,1                                               0232
         ST    @10,MATCHDX                                         0232
@DL00232 TM    MATCH,B'00100000'                                   0232
         BNZ   @DC00232                                            0232
*     /***************************************************************/
*     /*                                                             */
*     /* NOTE THAT THERE MUST BE A MATCH                     #Y30LB04*/
*     /*                                                             */
*     /***************************************************************/
*                                                                  0233
*     IF SDGPTR->SDGNN(MATCHDX)=MTDNN/* IS THIS THE NUMBER   @ZA08838*/
*       THEN                        /* YES, THIS IS THE NUMBER FOR 0233
*                                      REUSE                 @ZA08838*/
         SLA   @10,3                                               0233
         ALR   @10,SDGPTR                                          0233
         AL    @10,@CF01234                                        0233
         CLC   SDGNN-3(2,@10),MTDNN                                0233
         BNE   @RF00233                                            0233
*       DO;                         /* KEEP TRACK OF IT      #Y30LB04*/
*         MATCH=YES;                /* HAVE FOUND THE LIST ENTRY   0235
*                                                            #Y30LB04*/
         OI    MATCH,B'00100000'                                   0235
*       END;                        /* WILL QUIT THE SEARCH  #Y30LB04*/
*     ELSE                          /* NOT FOUND YET,        #Y30LB04*/
*       ;                           /* CONTINUE SEARCH       #Y30LB04*/
@RF00233 DS    0H                                                  0238
*   END;                            /* LOOKING FOR THE MATCH #Y30LB04*/
         LA    @10,1                                               0238
         AL    @10,MATCHDX                                         0238
         ST    @10,MATCHDX                                         0238
         C     @10,@CF01056                                        0238
         BNH   @DL00232                                            0238
@DC00232 DS    0H                                                  0239
*   MATCHDX=MATCHDX-ONE;            /* CORRECT SDG INDEX     @ZA08838*/
         L     @10,MATCHDX                                         0239
         BCTR  @10,0                                               0239
         ST    @10,MATCHDX                                         0239
*   IF MATCHDX=ONE                  /* WAS FIND AT TOP OF THE LIST?
*                                                            #Y30LB04*/
*     THEN                          /* YES, SO HAVE ORDER OK IN    0240
*                                      ALLOCATION BUF        #Y30LB04*/
         C     @10,@CF00063                                        0240
         BE    @RT00240                                            0240
*     ;                             /* RETURN WITHOUT SHIFTING ANY 0241
*                                      ENTRIES               #Y30LB04*/
*   ELSE                            /* NO, MUST MOVE IT TO THE TOP 0242
*                                                            #Y30LB04*/
*     DO;                           /* REARRANGE THE ENTRIES IN    0242
*                                      ALLOCATION COPY       @ZA08838*/
*       REUSSDG=SDGPTR->SDGNNBBB(MATCHDX);/* SAVE FOR TOP    @ZA08838*/
*                                                                  0243
         L     @10,MATCHDX                                         0243
         LR    @07,@10                                             0243
         SLA   @07,3                                               0243
         ALR   @07,SDGPTR                                          0243
         AL    @07,@CF01230                                        0243
         MVC   REUSSDG(8),SDGNNBBB(@07)                            0243
*       /*************************************************************/
*       /*                                                           */
*       /* MOVE PREDECESSORS DOWN INTO NEW, NEXT-LOWER POSITIONS, ONE*/
*       /* AT A TIME                                         @ZA08838*/
*       /*                                                           */
*       /*************************************************************/
*                                                                  0244
*       DO IMOVE=MATCHDX TO 2 BY-1; /*                       @ZA08838*/
         ST    @10,IMOVE                                           0244
         B     @DE00244                                            0244
@DL00244 DS    0H                                                  0245
*         SDGPTR->SDGNNBBB(IMOVE)=SDGPTR->SDGNNBBB(IMOVE-1);/*     0245
*                                                            @ZA08838*/
         LR    @07,@10                                             0245
         SLA   @07,3                                               0245
         ST    @07,@TF00001                                        0245
         ALR   @07,SDGPTR                                          0245
         AL    @07,@CF01230                                        0245
         LR    @02,SDGPTR                                          0245
         AL    @02,@TF00001                                        0245
         AL    @02,@CF01236                                        0245
         MVC   SDGNNBBB(8,@07),SDGNNBBB(@02)                       0245
*       END;                        /* NOW HAVE ROOM AT TOP FOR REUSE
*                                      SDG                   @ZA08838*/
*                                                                  0246
         BCTR  @10,0                                               0246
         ST    @10,IMOVE                                           0246
@DE00244 C     @10,@CF00075                                        0246
         BNL   @DL00244                                            0246
*       /*************************************************************/
*       /*                                                           */
*       /* NOW MOVE THE REUSE SDG INTO TOP POSITION          @ZA08838*/
*       /*                                                           */
*       /*************************************************************/
*                                                                  0247
*       SDGPTR->SDGNNBBB(1)=REUSSDG;/*                       @ZA08838*/
         MVC   SDGNNBBB(8,SDGPTR),REUSSDG                          0247
*     END;                          /* OF SHIFTING PROCESS   @Y30LB04*/
*   RFY                                                            0249
*     R14 RSTD;                     /* RESTRICT REGISTER FOURTEEN  0249
*                                                            @Y30LB04*/
@RT00240 DS    0H                                                  0250
*   R14=MAT14;                      /* RESTORE RETURN ADDRESS      0250
*                                                            @Y30LB04*/
         L     R14,MAT14                                           0250
*   RFY                                                            0251
*     R14 UNRSTD;                   /* FREE UP REGISTER FOURTEEN   0251
*                                                            @Y30LB04*/
*   RESPECIFY                                                      0252
*     R15 RESTRICTED;               /* TO RESTORE            @Y30LB04*/
*   R15=MAT15;                      /* RESTORE REGISTER FIFTEEN    0253
*                                                            @Y30LB04*/
         L     R15,MAT15                                           0253
*   END MATCHSRT;                   /* END OF MATCH AND SORT (SHIFT)
*                                                            @Y30LB04*/
@EL00005 DS    0H                                                  0254
@EF00005 DS    0H                                                  0254
@ER00005 BR    @14                                                 0254
*   END ICBME                       /* END OF MAIN PROCEDURE @Y30LB04*/
*                                                                  0255
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */
*/*%INCLUDE SYSLIB  (CVT     )                                       */
*/*%INCLUDE SYSLIB  (IHAPSA  )                                       */
*/*%INCLUDE SYSLIB  (IEZSSC  )                                       */
*/*%INCLUDE SYSLIB  (IEZSDGLS)                                       */
*                                                                  0255
*       ;                                                          0255
@DATA    DS    0H
@DATD    DSECT
         DS    0F
@SA00001 DS    18F
@TF00001 DS    F
ICBME    CSECT
         DS    0F
@CF00063 DC    F'1'
@CF00075 DC    F'2'
@CF00055 DC    F'4'
@CF00033 DC    F'12'
@CF01056 DC    F'28'
@CF01236 DC    F'-16'
@CF01230 DC    F'-8'
@CF01234 DC    F'-5'
@DATD    DSECT
         DS    0D
BASEVALU DS    A
R13SAVE  DS    A
R14SAVE  DS    A
R15SAVE  DS    A
IMOVE    DS    F
MATCHDX  DS    F
ACALL    DS    F
MEDR14   DS    A
VOL14    DS    A
MAT14    DS    A
MAT15    DS    A
NNBYT    DS    FL1
         DS    0D
@TS00001 DS    CL8
METOFAB  DS    CL22
         ORG   METOFAB
FABPARMS DS    CL8
         ORG   FABPARMS
FABUNITP DS    AL4
FABFLAGP DS    AL4
         ORG   METOFAB+8
UNITSTUF DS    CL12
         ORG   UNITSTUF
FABUNAME DS    CL8
FABULIST DS    AL4
         ORG   METOFAB+20
FLAGSTUF DS    CL2
         ORG   FLAGSTUF
FABFLAGS DS    CL2
         ORG   METOFAB+22
REUSSDG  DS    CL8
         DS    CL2
BUFFER   DS    CL512
QUERLIST DS    CL44
         ORG   QUERLIST
QULEN    DS    FL4
QUORD    DS    CL1
QURES    DS    CL1
QUCODE   DS    BL1
         ORG   QUCODE
QULIB    DS    BL1
         ORG   QUERLIST+7
QUSECT   DS    BL1
         ORG   QUSECT
QUXADDR  DS    BL1
         ORG   QUXADDR
QUFLAG   DS    BL1
         ORG   QUFLAG
QURES1   DS    CL1
         ORG   QUERLIST+8
QUPARM   DS    CL32
QUPTR    DS    FL4
         ORG   QUERLIST+44
TABPARM  DS    CL20
         ORG   TABPARM
TABID    DS    CL1
TABRD    DS    CL1
TABSEC   DS    CL2
TABMVT   DS    CL6
TABFILL  DS    CL10
         ORG   TABPARM+20
BITFLGS  DS    CL1
         ORG   BITFLGS
MOUNTED  DS    BL1
CONTINUE EQU   BITFLGS+0
MATCH    EQU   BITFLGS+0
         ORG   BITFLGS+1
PLACCONV DS    CL3
         ORG   PLACCONV
@NM00029 DS    CL1
MTDNN    DS    CL2
         ORG   PLACCONV+3
C2WORK   DS    CL2
         DS    CL2
STAERL   DS    CL12
MELOCSAV DS    5A
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA
@ENDDATD EQU   *
ICBME    CSECT
         DS    0F
@SIZDATD DC    AL1(230)
         DC    AL3(@ENDDATD-@DATD)
         DS    0D
@CB01218 DC    X'000000'
@CB01210 EQU   @CB01218
MEFLAGS  DC    X'1000'
MVTTAB   DC    X'20'
MVTRD    DC    X'01'
MVENT    DC    X'00'
FOXZRO   DC    X'00F0'
MEPATCH  DC    CL140'MEPATCH'
@00      EQU   00                      EQUATES FOR REGISTERS 0-15
@01      EQU   01
@02      EQU   02
@03      EQU   03
@04      EQU   04
@05      EQU   05
@06      EQU   06
@07      EQU   07
@08      EQU   08
@09      EQU   09
@10      EQU   10
@11      EQU   11
@12      EQU   12
@13      EQU   13
@14      EQU   14
@15      EQU   15
R0       EQU   @00
R1       EQU   @01
R2       EQU   @02
R11      EQU   @11
R12      EQU   @12
R13      EQU   @13
R14      EQU   @14
R15      EQU   @15
ALLOPTR  EQU   @03
SDGPTR   EQU   @06
QUERR1   EQU   @01
CVTPTR   EQU   16
PSA      EQU   0
FLCRNPSW EQU   PSA
FLCROPSW EQU   PSA+8
FLCICCW2 EQU   PSA+16
PSAEEPSW EQU   PSA+132
PSAESPSW EQU   PSA+136
FLCSVILC EQU   PSAESPSW+1
PSAEPPSW EQU   PSA+140
FLCPIILC EQU   PSAEPPSW+1
FLCPICOD EQU   PSAEPPSW+2
PSAPICOD EQU   FLCPICOD+1
FLCTEA   EQU   PSAEPPSW+4
FLCPER   EQU   PSA+152
FLCMCLA  EQU   PSA+168
FLCIOEL  EQU   FLCMCLA+4
FLCIOA   EQU   FLCMCLA+16
FLCFSA   EQU   FLCMCLA+80
PSASUPER EQU   PSA+552
PSASUP1  EQU   PSASUPER
PSASUP2  EQU   PSASUPER+1
PSASUP3  EQU   PSASUPER+2
PSASUP4  EQU   PSASUPER+3
PSACLHT  EQU   PSA+640
PSALKSA  EQU   PSA+696
PSAHLHI  EQU   PSA+760
PSALITA  EQU   PSA+764
PSADSSFL EQU   PSA+836
PSADSSF1 EQU   PSADSSFL
PSADSSF3 EQU   PSADSSFL+2
PSADSSF4 EQU   PSADSSFL+3
PSARSVT  EQU   PSA+896
CVTMAP   EQU   0
CVTDAR   EQU   CVTMAP+72
CVTFLGS1 EQU   CVTDAR
CVTDCB   EQU   CVTMAP+116
CVTIERLC EQU   CVTMAP+144
CVTOPTA  EQU   CVTMAP+182
CVTOPTB  EQU   CVTMAP+183
CVTGTF   EQU   CVTMAP+236
CVTGTFST EQU   CVTGTF
CVTGTFS  EQU   CVTGTFST
CVTSTATE EQU   CVTGTFST
CVTTMODE EQU   CVTGTFST
CVTFORM  EQU   CVTGTFST
CVTAQAVT EQU   CVTMAP+240
CVTTCMFG EQU   CVTAQAVT
CVTVOLM2 EQU   CVTMAP+244
CVTTATA  EQU   CVTVOLM2
CVTTSKS  EQU   CVTTATA
CVTVOLF2 EQU   CVTTSKS
CVTTAT   EQU   CVTTATA+1
CVTATER  EQU   CVTMAP+248
CVTEXT1  EQU   CVTMAP+252
CVTPURG  EQU   CVTMAP+260
CVTQMSG  EQU   CVTMAP+268
CVTDMSR  EQU   CVTMAP+272
CVTRSV37 EQU   CVTDMSR
CVTDMSRF EQU   CVTRSV37
CVTERPV  EQU   CVTMAP+316
CVTINTLA EQU   CVTMAP+320
CVTAPF   EQU   CVTMAP+324
CVTEXT2  EQU   CVTMAP+328
CVTHJES  EQU   CVTMAP+332
CVTPGSIA EQU   CVTMAP+348
CVTA1F1  EQU   CVTMAP+356
CVTSYSK  EQU   CVTMAP+357
CVTVOLM1 EQU   CVTMAP+380
CVTVOLF1 EQU   CVTVOLM1
CVTATMCT EQU   CVTMAP+388
CVTXTNT1 EQU   0
CVTXTNT2 EQU   0
CVTDSSV  EQU   CVTXTNT2
CVTFLGBT EQU   CVTXTNT2+5
CVTQID   EQU   CVTXTNT2+24
CVTICB   EQU   CVTXTNT2+48
CVTRV400 EQU   CVTXTNT2+52
CVTRV409 EQU   CVTXTNT2+53
CVTATCVT EQU   CVTXTNT2+64
CVTRV429 EQU   CVTXTNT2+84
CVTRV438 EQU   CVTXTNT2+85
CVTRV457 EQU   CVTXTNT2+112
CVTRV466 EQU   CVTXTNT2+113
CVTFIX   EQU   0
CVTRELNO EQU   CVTFIX+252
ICB2SSCB EQU   0
ICBOPT   EQU   ICB2SSCB+48
ICBFLG   EQU   ICB2SSCB+52
ICBFG1   EQU   ICBFLG
ICBFAB   EQU   ICB2SSCB+108
ICBTRACE EQU   ICB2SSCB+112
SDGLS    EQU   0
SDGNNBBB EQU   SDGLS
SDGNN    EQU   SDGNNBBB+3
SDGBBB   EQU   SDGNNBBB+5
STAEWORK EQU   0
ALLOPARM EQU   0
ALOVLIPT EQU   ALLOPARM
ALOWKPTR EQU   ALLOPARM+4
ALOULPTR EQU   ALLOPARM+8
AVOLID   EQU   0
AVOLWORD EQU   AVOLID
ALOWKA   EQU   0
ACALLCNT EQU   ALOWKA
ALOBUF   EQU   ALOWKA+4
ALLOCPTR EQU   0
CVTS01   EQU   CVTPGSIA
CVTLPDIA EQU   CVTS01+12
CVTDIRST EQU   CVTLPDIA
CVTSLIDA EQU   CVTS01+24
CVTCTLFG EQU   CVTS01+50
CVTRV210 EQU   CVTS01+424
CVTRV219 EQU   CVTS01+425
CVTRV228 EQU   CVTS01+426
CVTRV237 EQU   CVTS01+427
CVTMFRTR EQU   CVTS01+452
CVTRV262 EQU   CVTS01+468
CVTRV271 EQU   CVTS01+469
CVTRV280 EQU   CVTS01+470
CVTRV289 EQU   CVTS01+471
CVTGSDA  EQU   CVTS01+600
PSARSVTE EQU   PSARSVT
QWPARM   EQU   QUPARM
QWRES1   EQU   QWPARM
QWFLAG   EQU   QWPARM+2
QTPARM   EQU   QUPARM
QTID     EQU   QTPARM
QLPARM   EQU   QUPARM
QCPARM   EQU   QUPARM
FLC      EQU   PSA
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS
QCMAD3Z1 EQU   QCPARM+28
QCMAD3Z0 EQU   QCPARM+24
QCMAD2Z1 EQU   QCPARM+20
QCMAD2Z0 EQU   QCPARM+16
QCMAD1Z1 EQU   QCPARM+12
QCMAD1Z0 EQU   QCPARM+8
QCMAD0Z1 EQU   QCPARM+4
QCMAD0Z0 EQU   QCPARM
QLRES    EQU   QLPARM+2
QLZYX    EQU   QLPARM
QTRES    EQU   QTPARM+24
QTDASCHR EQU   QTPARM+20
QTDATA   EQU   QTPARM+2
QTFLAG   EQU   QTPARM+1
QTTABID  EQU   QTID
QWRES2   EQU   QWPARM+3
@NM00028 EQU   QWFLAG
QWMEM    EQU   QWFLAG
QWSSID   EQU   QWRES1
PSARSAV  EQU   PSARSVTE+60
PSARSTK  EQU   PSARSVTE+56
PSAESAV3 EQU   PSARSVTE+52
PSAESTK3 EQU   PSARSVTE+48
PSAESAV2 EQU   PSARSVTE+44
PSAESTK2 EQU   PSARSVTE+40
PSAESAV1 EQU   PSARSVTE+36
PSAESTK1 EQU   PSARSVTE+32
PSAPSAV  EQU   PSARSVTE+28
PSAPSTK  EQU   PSARSVTE+24
PSAMSAV  EQU   PSARSVTE+20
PSAMSTK  EQU   PSARSVTE+16
PSASSAV  EQU   PSARSVTE+12
PSASSTK  EQU   PSARSVTE+8
PSANSTK  EQU   PSARSVTE+4
PSACSTK  EQU   PSARSVTE
CVTRV628 EQU   CVTS01+728
CVTRV627 EQU   CVTS01+724
CVTRV626 EQU   CVTS01+720
CVTRV625 EQU   CVTS01+716
CVTRV624 EQU   CVTS01+712
CVTRV623 EQU   CVTS01+708
CVTRV622 EQU   CVTS01+704
CVTRV621 EQU   CVTS01+700
CVTIHASU EQU   CVTS01+696
CVTRV619 EQU   CVTS01+692
CVTRV618 EQU   CVTS01+688
CVTRV617 EQU   CVTS01+684
CVTRV616 EQU   CVTS01+680
CVTRV615 EQU   CVTS01+676
CVTRV614 EQU   CVTS01+672
CVTRV613 EQU   CVTS01+668
CVTTCASP EQU   CVTS01+664
CVT0PT03 EQU   CVTS01+660
CVT0PT0E EQU   CVTS01+656
CVTRV609 EQU   CVTS01+652
CVTCGK   EQU   CVTS01+648
CVTRAC   EQU   CVTS01+644
CVTRV606 EQU   CVTS01+640
CVTRV605 EQU   CVTS01+636
CVTRV604 EQU   CVTS01+632
CVTEFF02 EQU   CVTS01+628
CVTCBBR  EQU   CVTS01+624
CVTSSCR  EQU   CVTS01+620
CVTEVENT EQU   CVTS01+616
CVTCRCA  EQU   CVTS01+612
CVTTPIO  EQU   CVTS01+608
CVTADV   EQU   CVTS01+604
CVTGSDAB EQU   CVTGSDA
CVTQV3   EQU   CVTS01+596
CVTQV2   EQU   CVTS01+592
CVTQV1   EQU   CVTS01+588
CVTRPT   EQU   CVTS01+584
CVTSSRB  EQU   CVTS01+580
CVTCSDRL EQU   CVTS01+576
CVTEXP1  EQU   CVTS01+572
CVTRMPMT EQU   CVTS01+568
CVTRMPTT EQU   CVTS01+564
CVTVPSA  EQU   CVTS01+560
CVTVSTOP EQU   CVTS01+556
CVTGTFR8 EQU   CVTS01+552
CVTQUIT  EQU   CVTS01+548
CVTVACR  EQU   CVTS01+544
CVTWTCB  EQU   CVTS01+540
CVTSTPRS EQU   CVTS01+536
CVT0PT02 EQU   CVTS01+532
CVTDARCM EQU   CVTS01+528
CVTIRECM EQU   CVTS01+524
CVTJRECM EQU   CVTS01+520
CVTVEMS0 EQU   CVTS01+516
CVTSPFRR EQU   CVTS01+512
CVTRLSTG EQU   CVTS01+508
CVT0TC0A EQU   CVTS01+504
CVTGMBR  EQU   CVTS01+500
CVTLFRM  EQU   CVTS01+496
CVTRMBR  EQU   CVTS01+492
CVTVIOP  EQU   CVTS01+488
CVTRV307 EQU   CVTS01+486
CVTRV306 EQU   CVTS01+484
CVTRV305 EQU   CVTS01+482
CVTRV304 EQU   CVTS01+480
CVTRV303 EQU   CVTS01+478
CVTRV302 EQU   CVTS01+476
CVTTRCA  EQU   CVTS01+472
CVTRV297 EQU   CVTRV289
CVTRV296 EQU   CVTRV289
CVTRV295 EQU   CVTRV289
CVTRV294 EQU   CVTRV289
CVTRV293 EQU   CVTRV289
CVTRV292 EQU   CVTRV289
CVTRV291 EQU   CVTRV289
CVTRV290 EQU   CVTRV289
CVTRV288 EQU   CVTRV280
CVTRV287 EQU   CVTRV280
CVTRV286 EQU   CVTRV280
CVTRV285 EQU   CVTRV280
CVTRV284 EQU   CVTRV280
CVTRV283 EQU   CVTRV280
CVTRV282 EQU   CVTRV280
CVTRV281 EQU   CVTRV280
CVTRV279 EQU   CVTRV271
CVTRV278 EQU   CVTRV271
CVTRV277 EQU   CVTRV271
CVTRV276 EQU   CVTRV271
CVTRV275 EQU   CVTRV271
CVTRV274 EQU   CVTRV271
CVTRV273 EQU   CVTRV271
CVTRV272 EQU   CVTRV271
CVTRV270 EQU   CVTRV262
CVTRV269 EQU   CVTRV262
CVTRV268 EQU   CVTRV262
CVTRV267 EQU   CVTRV262
CVTRV266 EQU   CVTRV262
CVTRV265 EQU   CVTRV262
CVTRV264 EQU   CVTRV262
CVTRV263 EQU   CVTRV262
CVTVFP   EQU   CVTS01+464
CVTVSI   EQU   CVTS01+460
CVTVPSIB EQU   CVTS01+456
CVTMFACT EQU   CVTMFRTR
CVTMFCTL EQU   CVTS01+448
CVTPVBP  EQU   CVTS01+444
CVTPWI   EQU   CVTS01+440
CVTRV254 EQU   CVTS01+438
CVTRV253 EQU   CVTS01+436
CVTRV252 EQU   CVTS01+434
CVTRV251 EQU   CVTS01+433
CVTRV250 EQU   CVTS01+432
CVTRV249 EQU   CVTS01+431
CVTRV248 EQU   CVTS01+430
CVTRV247 EQU   CVTS01+429
CVTRV246 EQU   CVTS01+428
CVTRV245 EQU   CVTRV237
CVTRV244 EQU   CVTRV237
CVTRV243 EQU   CVTRV237
CVTRV242 EQU   CVTRV237
CVTRV241 EQU   CVTRV237
CVTRV240 EQU   CVTRV237
CVTRV239 EQU   CVTRV237
CVTRV238 EQU   CVTRV237
CVTRV236 EQU   CVTRV228
CVTRV235 EQU   CVTRV228
CVTRV234 EQU   CVTRV228
CVTRV233 EQU   CVTRV228
CVTRV232 EQU   CVTRV228
CVTRV231 EQU   CVTRV228
CVTRV230 EQU   CVTRV228
CVTRV229 EQU   CVTRV228
CVTRV227 EQU   CVTRV219
CVTRV226 EQU   CVTRV219
CVTRV225 EQU   CVTRV219
CVTRV224 EQU   CVTRV219
CVTRV223 EQU   CVTRV219
CVTRV222 EQU   CVTRV219
CVTRV221 EQU   CVTRV219
CVTRV220 EQU   CVTRV219
CVTRV218 EQU   CVTRV210
CVTRV217 EQU   CVTRV210
CVTRV216 EQU   CVTRV210
CVTRV215 EQU   CVTRV210
CVTRV214 EQU   CVTRV210
CVTRV213 EQU   CVTRV210
CVTRV212 EQU   CVTRV210
CVTRV211 EQU   CVTRV210
CVTLCCAT EQU   CVTS01+420
CVTPCCAT EQU   CVTS01+416
CVTIPCRP EQU   CVTS01+412
CVTIPCRI EQU   CVTS01+408
CVTIPCDS EQU   CVTS01+404
CVTAIDVT EQU   CVTS01+400
CVTSSAP  EQU   CVTS01+396
CVTEHCIR EQU   CVTS01+392
CVTEHDEF EQU   CVTS01+388
CVTDAIR  EQU   CVTS01+384
CVTPERFM EQU   CVTS01+380
CVT044R2 EQU   CVTS01+376
CVTFETCH EQU   CVTS01+372
CVTRSTWD EQU   CVTS01+368
CVTSPOST EQU   CVTS01+364
CVTIOBP  EQU   CVTS01+360
CVTASMVT EQU   CVTS01+356
CVTRECRQ EQU   CVTS01+352
CVTWSAC  EQU   CVTS01+348
CVTRV149 EQU   CVTS01+344
CVTWSAL  EQU   CVTS01+340
CVTSPSA  EQU   CVTS01+336
CVTGLMN  EQU   CVTS01+332
CVTVEAC0 EQU   CVTS01+328
CVT062R1 EQU   CVTS01+324
CVTRPOST EQU   CVTS01+320
CVTDQIQE EQU   CVTS01+316
CVTCSD   EQU   CVTS01+312
CVTLKRMA EQU   CVTS01+308
CVTRSPIE EQU   CVTS01+304
CVTRENQ  EQU   CVTS01+300
CVTLQCB  EQU   CVTS01+296
CVTFQCB  EQU   CVTS01+292
CVTQCS01 EQU   CVTS01+288
CVTAPFT  EQU   CVTS01+284
CVTPARRL EQU   CVTS01+280
CVTVWAIT EQU   CVTS01+276
CVTGSPL  EQU   CVTS01+272
CVTLSMQ  EQU   CVTS01+268
CVTGSMQ  EQU   CVTS01+264
CVTEXPRO EQU   CVTS01+260
CVTOPCTP EQU   CVTS01+256
CVTSIC   EQU   CVTS01+252
CVTTPIOS EQU   CVTS01+248
CVTRTMS  EQU   CVTS01+244
CVTSDBF  EQU   CVTS01+240
CVTSCBP  EQU   CVTS01+236
CVTSDMP  EQU   CVTS01+232
CVTSV60  EQU   CVTS01+228
CVTRTMCT EQU   CVTS01+224
CVTASCBL EQU   CVTS01+220
CVTASCBH EQU   CVTS01+216
CVTGDA   EQU   CVTS01+212
CVTASVT  EQU   CVTS01+208
CVTVVMDI EQU   CVTS01+204
CVTAQTOP EQU   CVTS01+200
CVTIOSCS EQU   CVTS01+196
CVTSDRM  EQU   CVTS01+192
CVTOPTE  EQU   CVTS01+188
CVTSTXU  EQU   CVTS01+184
CVTQUIS  EQU   CVTS01+180
CVTPARS  EQU   CVTS01+176
CVTS1EE  EQU   CVTS01+172
CVTFRAS  EQU   CVTS01+168
CVTQSAS  EQU   CVTS01+164
CVTCRAS  EQU   CVTS01+160
CVTCRMN  EQU   CVTS01+156
CVTDELCP EQU   CVTS01+152
CVTFRECL EQU   CVTS01+148
CVTGETCL EQU   CVTS01+144
CVTBLDCP EQU   CVTS01+140
CVTAUTHL EQU   CVTS01+136
CVTSCAN  EQU   CVTS01+132
CVTRV144 EQU   CVTS01+130
CVTMAXMP EQU   CVTS01+128
CVTSTCK  EQU   CVTS01+124
CVTRV139 EQU   CVTS01+123
CVTDSSAC EQU   CVTS01+122
CVTRV513 EQU   CVTS01+121
CVTIOSPL EQU   CVTS01+120
CVTPTGT  EQU   CVTS01+116
CVTCSPIE EQU   CVTS01+112
CVTSMFEX EQU   CVTS01+108
CVTOLT0A EQU   CVTS01+104
CVTSRBRT EQU   CVTS01+100
CVTPUTL  EQU   CVTS01+96
CVTASCRL EQU   CVTS01+92
CVTASCRF EQU   CVTS01+88
CVTRV326 EQU   CVTS01+84
CVTRV325 EQU   CVTS01+80
CVTRV324 EQU   CVTS01+76
CVT0VL01 EQU   CVTS01+72
CVTSHRVM EQU   CVTS01+68
CVTRV332 EQU   CVTS01+64
CVTTAS   EQU   CVTS01+60
CVTRSCN  EQU   CVTS01+56
CVTTRAC2 EQU   CVTS01+54
CVTTRACE EQU   CVTS01+52
CVTAPG   EQU   CVTS01+51
CVTSDTRC EQU   CVTCTLFG
CVTGTRCE EQU   CVTCTLFG
CVTNOMP  EQU   CVTCTLFG
CVTRSV79 EQU   CVTCTLFG
CVTDSTAT EQU   CVTCTLFG
CVTRSV78 EQU   CVTCTLFG
CVTRV333 EQU   CVTCTLFG
CVTRV323 EQU   CVTCTLFG
CVTSPVLK EQU   CVTS01+49
CVTRSV77 EQU   CVTS01+48
CVTRV331 EQU   CVTS01+44
CVTRV330 EQU   CVTS01+40
CVTRV329 EQU   CVTS01+36
CVTRV328 EQU   CVTS01+32
CVTRV322 EQU   CVTS01+28
CVTSLID  EQU   CVTSLIDA+1
CVTSYLK  EQU   CVTSLIDA
CVTRV321 EQU   CVTS01+20
CVTRV320 EQU   CVTS01+16
CVTLPDIR EQU   CVTLPDIA+1
CVTRSV69 EQU   CVTDIRST
CVTRSV68 EQU   CVTDIRST
CVTRSV67 EQU   CVTDIRST
CVTRSV66 EQU   CVTDIRST
CVTRSV65 EQU   CVTDIRST
CVTRSV64 EQU   CVTDIRST
CVTRSV63 EQU   CVTDIRST
CVTDICOM EQU   CVTDIRST
CVTPVTP  EQU   CVTS01+8
CVTLPDSR EQU   CVTS01+4
CVTGETL  EQU   CVTS01
SDGIX    EQU   SDGBBB
SDG      EQU   SDGNNBBB
ICBLORD  EQU   ICBTRACE+256
ICBOTRC  EQU   ICBTRACE
ICBRSV2P EQU   ICB2SSCB+104
ICBRSVP  EQU   ICB2SSCB+100
ICBAEAP  EQU   ICB2SSCB+96
ICBSIOBP EQU   ICB2SSCB+92
ICBIATNA EQU   ICB2SSCB+88
ICBIPRGA EQU   ICB2SSCB+84
ICBSRBP  EQU   ICB2SSCB+80
ICBVVICB EQU   ICB2SSCB+76
ICBVVIC  EQU   ICB2SSCB+72
ICBSIOP  EQU   ICB2SSCB+68
ICBMEP   EQU   ICB2SSCB+64
ICBIORCI EQU   ICB2SSCB+60
ICB2ACTP EQU   ICB2SSCB+56
ICBSAMP  EQU   ICBFLG+2
ICBFG2   EQU   ICBFLG+1
@NM00027 EQU   ICBFG1
ICBV     EQU   ICBFG1
ICBR     EQU   ICBFG1
ICBI     EQU   ICBFG1
ICBNVT   EQU   ICBOPT
ICBVN02P EQU   ICB2SSCB+44
ICBTCB   EQU   ICB2SSCB+40
ICBQHEAD EQU   ICB2SSCB+36
ICBAUCB  EQU   ICB2SSCB+32
ICBPUCB  EQU   ICB2SSCB+28
ICBCOMQ  EQU   ICB2SSCB+24
ICBIOR   EQU   ICB2SSCB+20
ICBCOM   EQU   ICB2SSCB+16
ICBACTV  EQU   ICB2SSCB+12
ICBECB   EQU   ICB2SSCB+8
ICBSSNAM EQU   ICB2SSCB
CVTLEVL  EQU   CVTRELNO+2
CVTNUMB  EQU   CVTRELNO
CVTMDL   EQU   CVTFIX+250
@NM00002 EQU   CVTFIX+248
@NM00001 EQU   CVTFIX
CVTRV482 EQU   CVTXTNT2+128
CVTRV481 EQU   CVTXTNT2+124
CVTRV480 EQU   CVTXTNT2+120
CVTRV479 EQU   CVTXTNT2+118
CVTRV478 EQU   CVTXTNT2+117
CVTRV477 EQU   CVTXTNT2+116
CVTRV476 EQU   CVTXTNT2+115
CVTRV475 EQU   CVTXTNT2+114
CVTRV474 EQU   CVTRV466
CVTRV473 EQU   CVTRV466
CVTRV472 EQU   CVTRV466
CVTRV471 EQU   CVTRV466
CVTRV470 EQU   CVTRV466
CVTRV469 EQU   CVTRV466
CVTRV468 EQU   CVTRV466
CVTRV467 EQU   CVTRV466
CVTRV465 EQU   CVTRV457
CVTRV464 EQU   CVTRV457
CVTRV463 EQU   CVTRV457
CVTRV462 EQU   CVTRV457
CVTRV461 EQU   CVTRV457
CVTRV460 EQU   CVTRV457
CVTRV459 EQU   CVTRV457
CVTRV458 EQU   CVTRV457
CVTRV456 EQU   CVTXTNT2+108
CVTRV455 EQU   CVTXTNT2+104
CVTRV454 EQU   CVTXTNT2+100
CVTRV453 EQU   CVTXTNT2+96
CVTRV452 EQU   CVTXTNT2+94
CVTRV451 EQU   CVTXTNT2+92
CVTRV450 EQU   CVTXTNT2+90
CVTRV449 EQU   CVTXTNT2+88
CVTRV448 EQU   CVTXTNT2+87
CVTRV447 EQU   CVTXTNT2+86
CVTRV446 EQU   CVTRV438
CVTRV445 EQU   CVTRV438
CVTRV444 EQU   CVTRV438
CVTRV443 EQU   CVTRV438
CVTRV442 EQU   CVTRV438
CVTRV441 EQU   CVTRV438
CVTRV440 EQU   CVTRV438
CVTRV439 EQU   CVTRV438
CVTRV437 EQU   CVTRV429
CVTRV436 EQU   CVTRV429
CVTRV435 EQU   CVTRV429
CVTRV434 EQU   CVTRV429
CVTRV433 EQU   CVTRV429
CVTRV432 EQU   CVTRV429
CVTRV431 EQU   CVTRV429
CVTRV430 EQU   CVTRV429
CVTRV428 EQU   CVTXTNT2+80
CVTRV427 EQU   CVTXTNT2+76
CVTRV426 EQU   CVTXTNT2+72
CVTRV425 EQU   CVTXTNT2+68
CVTATACT EQU   CVTATCVT
CVTRV423 EQU   CVTXTNT2+62
CVTRV422 EQU   CVTXTNT2+60
CVTRV421 EQU   CVTXTNT2+58
CVTRV420 EQU   CVTXTNT2+56
CVTRV419 EQU   CVTXTNT2+55
CVTRV418 EQU   CVTXTNT2+54
CVTRV417 EQU   CVTRV409
CVTRV416 EQU   CVTRV409
CVTRV415 EQU   CVTRV409
CVTRV414 EQU   CVTRV409
CVTRV413 EQU   CVTRV409
CVTRV412 EQU   CVTRV409
CVTRV411 EQU   CVTRV409
CVTRV410 EQU   CVTRV409
CVTRV408 EQU   CVTRV400
CVTRV407 EQU   CVTRV400
CVTRV406 EQU   CVTRV400
CVTRV405 EQU   CVTRV400
CVTRV404 EQU   CVTRV400
CVTRV403 EQU   CVTRV400
CVTRV402 EQU   CVTRV400
CVTRV401 EQU   CVTRV400
CVTSKTA  EQU   CVTXTNT2+44
CVTRSV99 EQU   CVTXTNT2+40
CVTRSV98 EQU   CVTXTNT2+36
CVTRSV97 EQU   CVTXTNT2+34
CVTRSV96 EQU   CVTXTNT2+32
CVTOLTEP EQU   CVTXTNT2+28
CVTQIDA  EQU   CVTQID+1
CVTRSV95 EQU   CVTQID
CVTRSV94 EQU   CVTXTNT2+20
CVTRSV93 EQU   CVTXTNT2+16
CVTRSV92 EQU   CVTXTNT2+12
CVTDEBVR EQU   CVTXTNT2+8
CVTRSV91 EQU   CVTXTNT2+6
CVTRSV9H EQU   CVTFLGBT
CVTRSV9G EQU   CVTFLGBT
CVTRSV9F EQU   CVTFLGBT
CVTRSV9E EQU   CVTFLGBT
CVTRSV9D EQU   CVTFLGBT
CVTRSV9C EQU   CVTFLGBT
CVTVME   EQU   CVTFLGBT
CVTNPE   EQU   CVTFLGBT
CVTNUCLS EQU   CVTXTNT2+4
CVTDSSVA EQU   CVTDSSV+1
CVTRSV89 EQU   CVTDSSV
CVTRSV88 EQU   CVTXTNT1+8
CVTRSV87 EQU   CVTXTNT1+4
CVTFACHN EQU   CVTXTNT1
CVTRV488 EQU   CVTMAP+412
CVTRV487 EQU   CVTMAP+408
CVTRV486 EQU   CVTMAP+404
CVTRV485 EQU   CVTMAP+400
CVTACTAP EQU   CVTMAP+396
CVTAUTH  EQU   CVTMAP+392
CVTATMCA EQU   CVTATMCT+1
CVTATMST EQU   CVTATMCT
CVTRSV61 EQU   CVTMAP+384
CVTVOLT1 EQU   CVTVOLM1+1
CVTVOLI1 EQU   CVTVOLF1
CVTSTOA  EQU   CVTMAP+376
CVTRSV58 EQU   CVTMAP+374
CVTRSV57 EQU   CVTMAP+372
CVTDDCE  EQU   CVTMAP+368
CVTPNWFR EQU   CVTMAP+364
CVTSMF   EQU   CVTMAP+360
CVTSULK  EQU   CVTMAP+358
CVTSLKO  EQU   CVTSYSK
CVTSLKP  EQU   CVTSYSK
CVTSLKQ  EQU   CVTSYSK
CVTSLKR  EQU   CVTSYSK
CVTRSV56 EQU   CVTSYSK
CVTRSV55 EQU   CVTSYSK
CVTRSV54 EQU   CVTSYSK
CVTRSV53 EQU   CVTSYSK
CVTRSV52 EQU   CVTA1F1
CVTRSV51 EQU   CVTA1F1
CVTRSV50 EQU   CVTA1F1
CVTRSV49 EQU   CVTA1F1
CVTRSV48 EQU   CVTA1F1
CVTRSV47 EQU   CVTA1F1
CVTSRSW  EQU   CVTA1F1
CVTPFSW  EQU   CVTA1F1
CVTPCVT  EQU   CVTMAP+352
CVTRSV46 EQU   CVTMAP+344
CVTRSV45 EQU   CVTMAP+340
CVTRSV44 EQU   CVTMAP+338
CVTRSV43 EQU   CVTMAP+336
CVTHJESA EQU   CVTHJES+1
CVTRSV42 EQU   CVTHJES
CVTEXT2A EQU   CVTEXT2+1
CVTRSV41 EQU   CVTEXT2
CVTAPFA  EQU   CVTAPF+1
CVTRSV40 EQU   CVTAPF
CVTRV518 EQU   CVTINTLA
CVTRV517 EQU   CVTERPV
CVTEORM  EQU   CVTMAP+312
CVTMCHPR EQU   CVTMAP+308
CVTTZ    EQU   CVTMAP+304
CVTJEPS  EQU   CVTMAP+300
CVTJESCT EQU   CVTMAP+296
CVTMODE  EQU   CVTMAP+292
CVTPTRV  EQU   CVTMAP+288
CVTREAL  EQU   CVTMAP+284
CVTRSV39 EQU   CVTMAP+280
CVTRSV38 EQU   CVTMAP+276
CVTDMSRA EQU   CVTDMSR+1
CVTRV634 EQU   CVTDMSRF
CVTRV633 EQU   CVTDMSRF
CVTRV632 EQU   CVTDMSRF
CVTRV631 EQU   CVTDMSRF
CVTRV630 EQU   CVTDMSRF
CVTRV629 EQU   CVTDMSRF
CVTUDUMP EQU   CVTDMSRF
CVTSDUMP EQU   CVTDMSRF
CVTQMSGA EQU   CVTQMSG+1
CVTRSV36 EQU   CVTQMSG
CVTAMFF  EQU   CVTMAP+264
CVTPURGA EQU   CVTPURG+1
CVTRSV35 EQU   CVTPURG
CVTCBSP  EQU   CVTMAP+256
CVTATERA EQU   CVTATER+1
CVTSYST  EQU   CVTATER
CVTVOLT2 EQU   CVTTAT
CVTVOLI2 EQU   CVTVOLF2
CVTAQAVB EQU   CVTAQAVT+1
CVTRSV34 EQU   CVTTCMFG
CVTRSV33 EQU   CVTTCMFG
CVTRSV32 EQU   CVTTCMFG
CVTRSV31 EQU   CVTTCMFG
CVTRSV30 EQU   CVTTCMFG
CVTRSV29 EQU   CVTTCMFG
CVTRSV28 EQU   CVTTCMFG
CVTTCRDY EQU   CVTTCMFG
CVTGTFA  EQU   CVTGTF+1
CVTRSV27 EQU   CVTGTFST
CVTRNIO  EQU   CVTGTFST
CVTUSR   EQU   CVTGTFST
CVTRV318 EQU   CVTFORM
CVTRV317 EQU   CVTTMODE
CVTRV316 EQU   CVTSTATE
CVTRV315 EQU   CVTGTFS
CVTGTFAV EQU   CVTGTFS
CVT0SCR1 EQU   CVTMAP+232
CVTRV515 EQU   CVTMAP+228
CVTRMS   EQU   CVTMAP+224
CVTPATCH EQU   CVTMAP+220
CVTTSCE  EQU   CVTMAP+216
CVTLNKSC EQU   CVTMAP+214
CVTQABST EQU   CVTMAP+212
CVTMDLDS EQU   CVTMAP+208
CVTUSER  EQU   CVTMAP+204
CVTABEND EQU   CVTMAP+200
CVTSMCA  EQU   CVTMAP+196
CVTRSV18 EQU   CVTMAP+192
CVTQLPAQ EQU   CVTMAP+188
CVTQCDSR EQU   CVTMAP+184
CVTRSV17 EQU   CVTOPTB
CVTRSV16 EQU   CVTOPTB
CVTFP    EQU   CVTOPTB
CVTAPTHR EQU   CVTOPTB
CVTNLOG  EQU   CVTOPTB
CVTTOD   EQU   CVTOPTB
CVTCTIMS EQU   CVTOPTB
CVTPROT  EQU   CVTOPTB
CVTXPFP  EQU   CVTOPTA
CVTASCII EQU   CVTOPTA
CVTRSV13 EQU   CVTOPTA
CVTRSV12 EQU   CVTOPTA
CVTNIP   EQU   CVTOPTA
CVTDDR   EQU   CVTOPTA
CVTAPR   EQU   CVTOPTA
CVTCCH   EQU   CVTOPTA
CVTSNCTR EQU   CVTMAP+180
CVTQMWR  EQU   CVTMAP+176
CVTQOCR  EQU   CVTMAP+172
CVT1EF00 EQU   CVTMAP+168
CVTMZ00  EQU   CVTMAP+164
CVTHEAD  EQU   CVTMAP+160
CVTRSV11 EQU   CVTMAP+156
CVT0PT01 EQU   CVTMAP+152
CVTMSER  EQU   CVTMAP+148
CVTRV516 EQU   CVTIERLC
CVTILCH  EQU   CVTMAP+140
CVT0DS   EQU   CVTMAP+136
CVTFBOSV EQU   CVTMAP+132
CVTNUCB  EQU   CVTMAP+128
CVTIXAVL EQU   CVTMAP+124
CVTIOQET EQU   CVTMAP+120
CVTDCBA  EQU   CVTMAP+117
CVTMVS2  EQU   CVTDCB
CVT6DAT  EQU   CVTDCB
CVT4MPS  EQU   CVTDCB
CVTRSV09 EQU   CVTDCB
CVT4MS1  EQU   CVTDCB
CVT2SPS  EQU   CVTDCB
CVT1SSS  EQU   CVTDCB
CVTRSV08 EQU   CVTDCB
CVTSTB   EQU   CVTMAP+112
CVTQTD00 EQU   CVTMAP+108
CVTQTE00 EQU   CVTMAP+104
CVTCUCB  EQU   CVTMAP+100
CVTSJQ   EQU   CVTMAP+96
CVTPBLDL EQU   CVTMAP+92
CVTTPC   EQU   CVTMAP+88
CVTSVDCB EQU   CVTMAP+84
CVTBRET  EQU   CVTMAP+82
CVTEXIT  EQU   CVTMAP+80
CVT0FN00 EQU   CVTMAP+76
CVTDARA  EQU   CVTDAR+1
CVTRSV07 EQU   CVTFLGS1
CVTRSV06 EQU   CVTFLGS1
CVTRSV05 EQU   CVTFLGS1
CVTRSV04 EQU   CVTFLGS1
CVTRSV03 EQU   CVTFLGS1
CVTRSV02 EQU   CVTFLGS1
CVTRSV01 EQU   CVTFLGS1
CVTDMPLK EQU   CVTFLGS1
CVTXITP  EQU   CVTMAP+68
CVTZDTAB EQU   CVTMAP+64
CVTMSLT  EQU   CVTMAP+60
CVTDATE  EQU   CVTMAP+56
CVTBTERM EQU   CVTMAP+52
CVTSYSAD EQU   CVTMAP+48
CVTXTLER EQU   CVTMAP+44
CVTILK2  EQU   CVTMAP+40
CVTILK1  EQU   CVTMAP+36
CVTPRLTV EQU   CVTMAP+32
CVTPCNVT EQU   CVTMAP+28
CVT0VL00 EQU   CVTMAP+24
CVTXAPG  EQU   CVTMAP+20
CVTBUF   EQU   CVTMAP+16
CVTJOB   EQU   CVTMAP+12
CVTLINK  EQU   CVTMAP+8
CVT0EF00 EQU   CVTMAP+4
CVTTCBP  EQU   CVTMAP
CVT      EQU   CVTMAP
@NM00026 EQU   PSA+3668
PSASTAK  EQU   PSA+3072
@NM00025 EQU   PSA+1048
PSAUSEND EQU   PSA+1048
PSARV062 EQU   PSA+1044
PSACDAL  EQU   PSA+1040
PSAWTCOD EQU   PSA+1036
PSAATCVT EQU   PSA+1032
PSAPCPSW EQU   PSA+1024
PSAPIR2  EQU   PSA+1020
PSARV059 EQU   PSA+1018
PSASVC13 EQU   PSA+1016
PSALSFCC EQU   PSA+1012
PSASFACC EQU   PSA+1008
PSASTOP  EQU   PSA+992
PSASTART EQU   PSA+976
PSARSPSW EQU   PSA+968
PSASRPSW EQU   PSA+960
PSARV045 EQU   PSA+892
PSARV044 EQU   PSA+888
PSARV043 EQU   PSA+884
PSARV042 EQU   PSA+880
PSARV041 EQU   PSA+876
PSARV040 EQU   PSA+872
PSARV025 EQU   PSA+868
PSADSSED EQU   PSA+868
PSADSSPR EQU   PSA+864
PSADSSFW EQU   PSA+860
PSADSS14 EQU   PSA+856
PSADSSPP EQU   PSA+848
PSADSSRP EQU   PSA+840
PSADSS05 EQU   PSADSSF4
PSADSS10 EQU   PSADSSF4
PSADSSVE EQU   PSADSSF4
PSADSSDE EQU   PSADSSF4
PSADSSC0 EQU   PSADSSF4
PSADSSIE EQU   PSADSSF4
PSADSS12 EQU   PSADSSF4
PSADSSRC EQU   PSADSSF4
PSARV057 EQU   PSADSSF3
PSARV056 EQU   PSADSSF3
PSARV055 EQU   PSADSSF3
PSADSSMC EQU   PSADSSF3
PSADSSRW EQU   PSADSSF3
PSADSSNM EQU   PSADSSF3
PSADSSES EQU   PSADSSF3
PSADSSGP EQU   PSADSSF3
PSADSSF2 EQU   PSADSSFL+1
PSADSSPI EQU   PSADSSF1
PSADSSOI EQU   PSADSSF1
PSADSSSP EQU   PSADSSF1
PSADSSTP EQU   PSADSSF1
PSADSSDW EQU   PSADSSF1
PSADSSDD EQU   PSADSSF1
PSADSSDM EQU   PSADSSF1
PSADSSMV EQU   PSADSSF1
PSADSSTS EQU   PSA+816
PSADSSWK EQU   PSA+812
PSADSSR3 EQU   PSA+808
PSADSSR2 EQU   PSA+804
PSADSSRS EQU   PSA+800
PSASTOR  EQU   PSA+796
PSACPUSA EQU   PSA+794
PSAVSTAP EQU   PSA+792
PSAWKVAP EQU   PSA+788
PSAWKRAP EQU   PSA+784
PSAMCHIC EQU   PSA+783
PSARV061 EQU   PSA+782
PSASYMSK EQU   PSA+781
PSAMCHFL EQU   PSA+780
PSACR0   EQU   PSA+776
PSAPSWSV EQU   PSA+768
PSACLHS  EQU   PSAHLHI
PSALKR15 EQU   PSALKSA+60
PSALKR14 EQU   PSALKSA+56
PSALKR13 EQU   PSALKSA+52
PSALKR12 EQU   PSALKSA+48
PSALKR11 EQU   PSALKSA+44
PSALKR10 EQU   PSALKSA+40
PSALKR9  EQU   PSALKSA+36
PSALKR8  EQU   PSALKSA+32
PSALKR7  EQU   PSALKSA+28
PSALKR6  EQU   PSALKSA+24
PSALKR5  EQU   PSALKSA+20
PSALKR4  EQU   PSALKSA+16
PSALKR3  EQU   PSALKSA+12
PSALKR2  EQU   PSALKSA+8
PSALKR1  EQU   PSALKSA+4
PSALKR0  EQU   PSALKSA
PSARV023 EQU   PSACLHT+52
PSALOCAL EQU   PSACLHT+48
PSACMSL  EQU   PSACLHT+44
PSAOPTL  EQU   PSACLHT+40
PSATPACL EQU   PSACLHT+36
PSATPDNL EQU   PSACLHT+32
PSATPNCL EQU   PSACLHT+28
PSAIOSLL EQU   PSACLHT+24
PSAIOSUL EQU   PSACLHT+20
PSAIOSCL EQU   PSACLHT+16
PSAIOSSL EQU   PSACLHT+12
PSASALCL EQU   PSACLHT+8
PSAASML  EQU   PSACLHT+4
PSADISPL EQU   PSACLHT
PSASRSA  EQU   PSA+636
PSARV050 EQU   PSA+634
PSADSSGO EQU   PSA+633
PSARECUR EQU   PSA+632
PSAHLHIS EQU   PSA+628
PSAIPCSA EQU   PSA+624
@NM00024 EQU   PSA+621
PSAIPCDM EQU   PSA+620
PSAIPCD  EQU   PSA+616
@NM00023 EQU   PSA+613
PSAIPCRM EQU   PSA+612
PSAIPCR  EQU   PSA+608
PSAMCHEX EQU   PSA+600
PSAMPSW  EQU   PSA+592
PSAEXPS2 EQU   PSA+584
PSAEXPS1 EQU   PSA+576
PSAPIREG EQU   PSA+572
PSARSREG EQU   PSA+568
PSAGPREG EQU   PSA+556
PSARV022 EQU   PSASUP4
PSARV021 EQU   PSASUP4
PSARV020 EQU   PSASUP4
PSARV019 EQU   PSASUP4
PSARV018 EQU   PSASUP4
PSARV017 EQU   PSASUP4
PSARV016 EQU   PSASUP4
PSARV015 EQU   PSASUP4
PSARV014 EQU   PSASUP3
PSARV013 EQU   PSASUP3
PSARV012 EQU   PSASUP3
PSAESTA  EQU   PSASUP3
PSASPR   EQU   PSASUP3
PSAPSREG EQU   PSASUP3
PSAPI2   EQU   PSASUP3
PSAIOSUP EQU   PSASUP3
PSALCR   EQU   PSASUP2
PSARTM   EQU   PSASUP2
PSAACR   EQU   PSASUP2
PSAIPCE2 EQU   PSASUP2
PSAIPCES EQU   PSASUP2
PSAIPCEC EQU   PSASUP2
PSAGTF   EQU   PSASUP2
PSAIPCRI EQU   PSASUP2
PSATYPE6 EQU   PSASUP1
PSATCTL  EQU   PSASUP1
PSADISP  EQU   PSASUP1
PSALOCK  EQU   PSASUP1
PSAPI    EQU   PSASUP1
PSAEXT   EQU   PSASUP1
PSASVC   EQU   PSASUP1
PSAIO    EQU   PSASUP1
PSAAOLD  EQU   PSA+548
PSAANEW  EQU   PSA+544
PSATOLD  EQU   PSA+540
PSATNEW  EQU   PSA+536
PSALCCAR EQU   PSA+532
PSALCCAV EQU   PSA+528
PSAPCCAR EQU   PSA+524
PSAPCCAV EQU   PSA+520
PSACPULA EQU   PSA+518
PSACPUPA EQU   PSA+516
PSAPSA   EQU   PSA+512
FLCHDEND EQU   PSA+512
FLCCRSAV EQU   FLCMCLA+280
FLCGRSAV EQU   FLCMCLA+216
FLCFPSAV EQU   FLCMCLA+184
FLCFLA   EQU   FLCMCLA+88
FLCRGNCD EQU   FLCMCLA+84
FLCFSAA  EQU   FLCFSA+1
@NM00022 EQU   FLCFSA
@NM00021 EQU   FLCMCLA+72
FLCMCIC  EQU   FLCMCLA+64
@NM00020 EQU   FLCMCLA+20
FLCIOAA  EQU   FLCIOA+1
@NM00019 EQU   FLCIOA
@NM00018 EQU   FLCMCLA+15
@NM00017 EQU   FLCMCLA+14
@NM00016 EQU   FLCMCLA+12
FLCLCL   EQU   FLCMCLA+8
FLCIOELA EQU   FLCIOEL+1
@NM00015 EQU   FLCIOEL
FLCCHNID EQU   FLCMCLA
@NM00014 EQU   PSA+160
FLCMTRCD EQU   PSA+157
@NM00013 EQU   PSA+156
FLCPERA  EQU   FLCPER+1
@NM00012 EQU   FLCPER
@NM00011 EQU   PSA+151
FLCPERCD EQU   PSA+150
FLCMCNUM EQU   PSA+149
@NM00010 EQU   PSA+148
FLCTEAA  EQU   FLCTEA+1
@NM00009 EQU   FLCTEA
PSAPIPC  EQU   PSAPICOD
PSAPIMC  EQU   PSAPICOD
PSAPIPER EQU   PSAPICOD
PSARV049 EQU   FLCPICOD
FLCPILCB EQU   FLCPIILC
@NM00008 EQU   FLCPIILC
@NM00007 EQU   PSAEPPSW
FLCSVCN  EQU   PSAESPSW+2
FLCSILCB EQU   FLCSVILC
@NM00006 EQU   FLCSVILC
@NM00005 EQU   PSAESPSW
FLCEICOD EQU   PSAEEPSW+2
PSASPAD  EQU   PSAEEPSW
@NM00004 EQU   PSA+128
FLCINPSW EQU   PSA+120
FLCMNPSW EQU   PSA+112
FLCPNPSW EQU   PSA+104
FLCSNPSW EQU   PSA+96
FLCENPSW EQU   PSA+88
FLCTRACE EQU   PSA+84
FLCTIMER EQU   PSA+80
FLCCVT2  EQU   PSA+76
FLCCAW   EQU   PSA+72
FLCCSW   EQU   PSA+64
FLCIOPSW EQU   PSA+56
FLCMOPSW EQU   PSA+48
FLCPOPSW EQU   PSA+40
FLCSOPSW EQU   PSA+32
FLCEOPSW EQU   PSA+24
@NM00003 EQU   FLCICCW2+4
FLCCVT   EQU   FLCICCW2
FLCICCW1 EQU   FLCROPSW
FLCIPPSW EQU   FLCRNPSW
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS
@RT00089 EQU   @RC00087
MERET    EQU   @EL00001
@PB00003 EQU   @EL00002
@ENDDATA EQU   *
         END   ICBME,(C'PLS2313',0603,76338)
