         TITLE 'IGE0904I, 370X MISCELLANEOUS DATA RECORDER(MDR) INTERFA*
               ACE      '
IGE0904I CSECT ,                                                01S0001
@PROLOG  BALR  @12,0                                            01S0001
@PSTART  DS    0H                                               01S0001
         USING @PSTART,@12                                      01S0001
*                                                               02S0389
*   /*****************************************************************/
*   /*                                                               */
*   /* PROCESS: THIS SEGMENT DOES THE PROCESSING THAT IS NECESSARY TO*/
*   /* PERFORM THE FUNCTION OF THE MODULE.                           */
*   /*                                                               */
*   /*****************************************************************/
*                                                               02S0389
*   DO;                                                         02S0389
*     GEN REFS(RBASE) NOSETS;                                   02S0390
*                       /*
IGE0904I IEDHJN AFTERHJN,HJN           MODULE IDENTIFICATION MACRO
*     RAVT=TCXAVT;                  /* ESTABLISH AVT ADDRESS         */
         L     @09,CVTPTR                                       02S0391
         L     @09,TCXPTR(,@09)                                 02S0391
         L     RAVT,TCXAVT(,@09)                                02S0391
*     IOSBPTR=RPARM;                /* SET UP IOSB ADDRESS   @G36XREB*/
         LR    IOSBPTR,RPARM                                    02S0392
*     RFY                                                       02S0393
*       RPARM UNRSTD;                                           02S0393
*     RLCB=IOSUSE;                  /* GET LCB ADDRESS FROM IOSB
*                                                            @G36XREB*/
         L     RLCB,IOSUSE(,IOSBPTR)                            02S0394
*     IF LCBGETMN=ON                /* IF A GETMAIN HAS ALREADY BEEN
*                                      DONE(WHICH WILL BE TRUE IF WE
*                                      ARE RETURNING FROM IGE0625F TO
*                                      PROCESS THE NEXT RECORD ON THE
*                                      LCB OBR CHAIN)                */
*       THEN                                                    02S0395
         TM    LCBGETMN(RLCB),B'10000000'                       02S0395
         BNO   @RF00395                                         02S0395
*       RMDR=LCBRECAD-LENGTH(MDRFREE);/* ..THEN SETUP GETMAINED AREA
*                                      ADDRESSABILITY                */
         L     RMDR,LCBRECAD-1(,RLCB)                           02S0396
         LA    RMDR,0(,RMDR)                                    02S0396
         BCTR  RMDR,0                                           02S0396
         BCTR  RMDR,0                                           02S0396
*     ELSE                                                      02S0397
*                                                               03S0397
*       /*************************************************************/
*       /*                                                           */
*       /* PROCESS.GETMAIN: THIS SEGMENT GETMAINS A STORAGE AREA IN  */
*       /* WHICH TO FORMAT INFORMATION FOR IGE0625F AND BUILD        */
*       /* MESSAGES FOR THE SYSTEM OPERATOR.                         */
*       /*                                                           */
*       /*************************************************************/
*                                                               03S0397
*       DO;                                                     03S0397
         B     @RC00395                                         03S0397
@RF00395 DS    0H                                               03S0398
*         RFY                                                   03S0398
*           RCORESZE RSTD;                                      03S0398
*         RCORESZE=MAX(RMSLNMAX,AVTKEYLE-F0GARLEN-SRHDRLDF)+LENGTH(
*             TPERHDR)+76;          /* CALCULATE MAXIMUM ACTUAL CORE
*                                      SIZE NEEDED FOR ANY RECORD ON
*                                      THE OBR QUEUE         @OY18083*/
         LH    RCORESZE,AVTKEYLE(,RAVT)                         03S0399
         SL    RCORESZE,@CF03144                                03S0399
         LA    @09,35                                           03S0399
         CR    RCORESZE,@09                                     03S0399
         BNL   *+6
         LR    RCORESZE,@09                                     03S0399
         AL    RCORESZE,@CF03145                                03S0399
*         RCORESZE=RCORESZE+7;      /* THESE TWO INSTRUCTIONS ROUNDUP
*                                      CORE SIZE TO DOUBLEWORD  03S0400
*                                      MULTIPLE                      */
         AL    RCORESZE,@CF00150                                03S0400
*         RCORESZE=RCORESZE&ROUNDMSK;                           03S0401
         N     RCORESZE,@CF03047                                03S0401
*         RFY                                                   03S0402
*          (REG15,                                              03S0402
*           RPARM) RSTD;                                        03S0402
*         GEN CODE REFS(RCORESZE) SETS(REG00,RPARM) NODEFS NOEXIT
*             NOFLOWS SEQFLOW;                                  03S0403
*        /*
 GETMAIN R,LV=(RCORESZE),SP=254
*         IF REG15=0                /* IF THE GETMAIN WORKED         */
*           THEN                                                03S0404
         LTR   REG15,REG15                                      03S0404
         BNZ   @RF00404                                         03S0404
*           DO;                     /* ..THEN SETUP GETMAINED AREA
*                                      ADDRESSABILITY                */
*             RMDR=RPARM;           /* MOVE CORE ADDRESS             */
         LR    RMDR,RPARM                                       03S0406
*             RFY                                               03S0407
*              (RPARM,                                          03S0407
*               REG15) UNRSTD;                                  03S0407
*             LCBRECAD=RMDR+LENGTH(MDRFREE);/* SAVE CORE ADDRESS     */
         LA    @09,2                                            03S0408
         ALR   @09,RMDR                                         03S0408
         STCM  @09,7,LCBRECAD(RLCB)                             03S0408
*             MDRFREE=RCORESZE;     /* SAVE CORE SIZE                */
         STH   RCORESZE,MDRFREE(,RMDR)                          03S0409
*             RFY                                               03S0410
*               RCORESZE UNRSTD;                                03S0410
*             LCBGETMN=ON;          /* INDICATE GETMAIN DONE         */
         OI    LCBGETMN(RLCB),B'10000000'                       03S0411
*           END;                                                03S0412
*         ELSE                                                  03S0413
*           DO WHILE LCBOBRCH^=0;   /* ..ELSE FREE ALL RECORDS ON THE
*                                      LCB OBR QUEUE                 */
         B     @RC00404                                         03S0413
@RF00404 B     @DE00413                                         03S0413
@DL00413 DS    0H                                               03S0414
*             CALL IPCSOBRQ;        /* GET A RECORD FROM THE OBR
*                                      QUEUE                         */
         BAL   @14,IPCSOBRQ                                     03S0414
*             CALL IPCSTCXQ;        /* PUT THE RECORD ON THE TCX
*                                      READY QUEUE FOR POSTING TO
*                                      BUFFER DISPOSITION            */
         BAL   @14,IPCSTCXQ                                     03S0415
*           END;                                                03S0416
@DE00413 L     @09,LCBOBRCH(,RLCB)                              03S0416
         LTR   @09,@09                                          03S0416
         BNZ   @DL00413                                         03S0416
*       END;                                                    03S0417
@RC00404 DS    0H                                               03S0418
*                                                               03S0418
*     /***************************************************************/
*     /*                                                             */
*     /* PROCESS.HANDLE: THIS SEGMENT PROCESSES THE RECORDS ON THE   */
*     /* LCB OBR QUEUE.                                              */
*     /*                                                             */
*     /***************************************************************/
*                                                               03S0418
*     DO UNTIL 1^=1;                /* LOOP UNTIL WE EXIT            */
@RC00395 DS    0H                                               03S0418
@DL00418 DS    0H                                               03S0419
*       IF LCBGETMN=ON              /* IF THERE IS A GETMAINED  03S0419
*                                      STORAGE AREA AVAILABLE        */
*         THEN                                                  03S0419
         TM    LCBGETMN(RLCB),B'10000000'                       03S0419
         BNO   @RF00419                                         03S0419
*         DO;                       /* ..THEN PROCESS THE NEXT RECORD
*                                      ON THE LCB OBR QUEUE          */
*           IF LCBOBRCH^=0          /* IF THERE ARE MORE RECORDS ON
*                                      THE LCB OBR QUEUE             */
*             THEN                                              03S0421
         L     @09,LCBOBRCH(,RLCB)                              03S0421
         LTR   @09,@09                                          03S0421
         BZ    @RF00421                                         03S0421
*             DO;                   /* ..THEN PROCESS THE NEXT RECORD*/
*               CALL IPCSOBRQ;      /* GET THE NEXT RECORD ON THE
*                                      QUEUE                         */
         BAL   @14,IPCSOBRQ                                     03S0423
*                                                               04S0424
*               /*****************************************************/
*               /*                                                   */
*               /* PROCESS.HANDLE.BLDREC: THIS SEGMENT PROCESSES A   */
*               /* RECORD FROM THE LCB OBR QUEUE.                    */
*               /*                                                   */
*               /*****************************************************/
*                                                               04S0424
*               DO;                                             04S0424
*                 GEN CODE REFS(REG10) NOSETS NOEXIT NOFLOWS NODEFS
*                     SEQFLOW;                                  04S0425
*                                                          /*@OY18083*/
          USING @DATD,10                                       @OY18083
*                 RFY                                           04S0426
*                   REG10 RSTD;     /*                       @OY18083*/
*                 REG10=ADDR(COMPSAVE);/* SET ADDRESS COMPILER SAVE
*                                      AREA                  @OY18083*/
         LA    REG10,COMPSAVE(,RMDR)                            04S0427
*                 IF TTHFTYPE=TTHFID1/* IF THE RECORD IS A FID1 RMS
*                                      PIU                           */
*                   THEN                                        04S0428
         LA    @11,PRFPIUO(,RPRF)                               04S0428
         SLR   @09,@09                                          04S0428
         IC    @09,PRFPIUO(,RPRF)                               04S0428
         ALR   @11,@09                                          04S0428
         TM    TTHFTYPE(@11),B'00010000'                        04S0428
         BNO   @RF00428                                         04S0428
         TM    TTHFTYPE(@11),B'11100000'                        04S0428
         BNZ   @RF00428                                         04S0428
*                   DO;             /* ..THEN PROCESS AN RMS PIU     */
*                                                               05S0430
*                     /***********************************************/
*                     /*                                             */
*                     /* PROCESS.HANDLE.BLDREC.BLDMDR: THIS SEGMENT  */
*                     /* FORMATS INFORMATION FROM 370X RMS PIUS IN   */
*                     /* THE GETMAINED STORAGE AREA FOR XCTL TO      */
*                     /* IGE0625F AND SUBSEQUENT RECORDING ON LOGREC.*/
*                     /*                                             */
*                     /***********************************************/
*                                                               05S0430
*                     DO;                                       05S0430
*                       MDRBUFSZ=TTHDCF-LENGTH(IEDRH)-LENGTH(RUCNTL)+
*                           LENGTH(MDRHDR);/* SET DATA AREA SIZE     */
         LA    @09,28                                           05S0431
         SLR   @07,@07                                          05S0431
         ICM   @07,3,TTHDCF(@11)                                05S0431
         ALR   @09,@07                                          05S0431
         STH   @09,MDRBUFSZ(,RMDR)                              05S0431
*                       MDRSECID=TCAM370X;/* SETUP A SECONDARY ID
*                                      FIELD                         */
         MVI   MDRSECID(RMDR),X'8A'                             05S0432
*                       MDRRECID=RURECID;/* SETUP RECORD        05S0433
*                                      IDENTIFICATION                */
         IC    @09,RURECID(,@11)                                05S0433
         STC   @09,MDRRECID(,RMDR)                              05S0433
*                       RFY                                     05S0434
*                         RPARM RSTD;                           05S0434
*                       RPARM=RUNA; /* MOVE NETWORK ADDRESS          */
         SLR   RPARM,RPARM                                      05S0435
         ICM   RPARM,3,RUNA(@11)                                05S0435
*                       RFY                                     05S0436
*                         REG15 RSTD;                           05S0436
*                       CALL IEDIAP03;/* GET TTCIN FOR NETWORK  05S0437
*                                      ADDRESS                       */
         L     @11,AVTSAVTP(,RAVT)                              05S0437
         L     @15,SAVTNAX(,@11)                                05S0437
         BALR  @14,@15                                          05S0437
*                       RFY                                     05S0438
*                         RPARM UNRSTD;                         05S0438
*                       IF REG15^=0 /* IF A TTCIN WAS FOUND          */
*                         THEN                                  05S0439
         LTR   REG15,REG15                                      05S0439
         BZ    @RF00439                                         05S0439
*                         DO;       /* ..THEN MOVE RESOURCE NAME TO
*                                      DATA AREA                     */
*                           NAMEADDR=ADDR(TNTFIRST)+(REG15-1)*(TNTENLEN
*                               +LENGTH(TNTTRMAD));/* CALCULATE ENTRY
*                                      NAME ADDRESS                  */
         L     @14,IEDQNPTR(,RAVT)                              05S0441
         LA    NAMEADDR,82                                      05S0441
         ALR   NAMEADDR,@14                                     05S0441
         LR    @01,REG15                                        05S0441
         BCTR  @01,0                                            05S0441
         SLR   @11,@11                                          05S0441
         IC    @11,TNTENLEN(,@14)                               05S0441
         LA    @14,3                                            05S0441
         ALR   @14,@11                                          05S0441
         MR    @00,@14                                          05S0441
         ALR   NAMEADDR,@01                                     05S0441
*                           RFY                                 05S0442
*                             REG15 UNRSTD;                     05S0442
*                           MDRNAME='';/* BLANK ENTRY NAME FOR SHORT
*                                      NAMES                         */
         MVI   MDRNAME(RMDR),C' '                               05S0443
         MVC   MDRNAME+1(7,RMDR),MDRNAME(RMDR)                  05S0443
*                           MDRNAME(1:TNTENLEN)=TTENAME(1:TNTENLEN);
         BCTR  @11,0                                            05S0444
         EX    @11,@SM03151                                     05S0444
*                                   /* MOVE ENTRY NAME TO DATA AREA  */
*                         END;                                  05S0445
*                       ELSE                                    05S0446
*                         MDRNAME=UNKNOWN;/* ..ELSE SETUP OBVIOUSLY
*                                      ERRONEOUS NAME                */
         B     @RC00439                                         05S0446
@RF00439 MVC   MDRNAME(8,RMDR),@CC03013                         05S0446
*                       MDRNETA=RUNA;/* SET NETWORK ADDRESS IN DATA
*                                      AREA                          */
@RC00439 LA    @11,PRFPIUO(,RPRF)                               05S0447
         SLR   @09,@09                                          05S0447
         IC    @09,PRFPIUO(,RPRF)                               05S0447
         ALR   @09,@11                                          05S0447
         MVC   MDRNETA(2,RMDR),RUNA(@09)                        05S0447
*                       PIUDLEN=TTHDCF-LENGTH(IEDRH)-LENGTH(RUCNTL);
         SLR   PIUDLEN,PIUDLEN                                  05S0448
         ICM   PIUDLEN,3,TTHDCF(@09)                            05S0448
         SL    PIUDLEN,@CF00032                                 05S0448
*                                   /* CALCULATE PIU DATA LENGTH     */
*                       UNITDLEN=ADDR(PRFPIUO)+AVTKEYLE-ADDR(RUDATA);
         AH    @11,AVTKEYLE(,RAVT)                              05S0449
         LA    UNITDLEN,RUDATA(,@09)                            05S0449
         SLR   @11,UNITDLEN                                     05S0449
         LR    UNITDLEN,@11                                     05S0449
*                                   /* CALCULATE HEAD UNIT DATA 05S0450
*                                      LENGTH                        */
*                       IF PIUDLEN<=UNITDLEN/* IF THE PIU IS    05S0450
*                                      CONTAINED IN ONE BUFFER UNIT  */
*                         THEN                                  05S0450
         CR    PIUDLEN,UNITDLEN                                 05S0450
         BH    @RF00450                                         05S0450
*                         MDRDATA(1:PIUDLEN)=RUDATA(1:PIUDLEN);/*
*                                      ..THEN MOVE ALL OF THE PIU'S
*                                      DATA IN ONE OPERATION         */
         LR    @11,PIUDLEN                                      05S0451
         BCTR  @11,0                                            05S0451
         EX    @11,@SM03153                                     05S0451
*                       ELSE                                    05S0452
*                         DO;       /* ..ELSE MOVE ALL OF THE PIU'S
*                                      DATA IN MULTIPLE OPERATIONS   */
         B     @RC00450                                         05S0452
@RF00450 DS    0H                                               05S0453
*                           MDRDATA(1:UNITDLEN)=RUDATA(1:UNITDLEN);/*
*                                      MOVE THE FIRST UNIT'S DATA    */
         LR    @11,UNITDLEN                                     05S0453
         BCTR  @11,0                                            05S0453
         LA    @09,PRFPIUO(,RPRF)                               05S0453
         SLR   @07,@07                                          05S0453
         IC    @07,PRFPIUO(,RPRF)                               05S0453
         ALR   @09,@07                                          05S0453
         EX    @11,@SM03153                                     05S0453
*                           DO LOOPINDX=UNITDLEN TO PIUDLEN-1 BY
*                                 AVTKEYLE;/* MOVE THE REMAINING
*                                      UNITS' DATA-LOOPINDX IS THE
*                                      INDEX INTO THE DATA AREA OF
*                                      THE TARGET OF THE CURRENT
*                                      UNIT'S DATA                   */
         LR    LOOPINDX,UNITDLEN                                05S0454
         B     @DE00454                                         05S0454
@DL00454 DS    0H                                               05S0455
*                             RPRF=PRFTIC;/* GET NEXT UNIT ADDRESS   */
         L     RPRF,PRFTIC(,RPRF)                               05S0455
*                             LENDATTM=MIN(AVTKEYLE,(PIUDLEN-LOOPINDX))
*                                 ; /* CALCULATE SIZE OF DATA TO MOVE*/
         LR    LENDATTM,PIUDLEN                                 05S0456
         SLR   LENDATTM,LOOPINDX                                05S0456
         LH    @11,AVTKEYLE(,RAVT)                              05S0456
         CR    @11,LENDATTM                                     05S0456
         BNH   *+6
         LR    @11,LENDATTM                                     05S0456
         LR    LENDATTM,@11                                     05S0456
*                             MDRDATA(LOOPINDX+1:LOOPINDX+LENDATTM)=
*                                 UNITDATA(1:LENDATTM);/* MOVE THE
*                                      DATA FROM THE UNIT TO THE DATA
*                                      AREA                          */
         LR    @11,RMDR                                         05S0457
         ALR   @11,LOOPINDX                                     05S0457
         LR    @15,LENDATTM                                     05S0457
         BCTR  @15,0                                            05S0457
         EX    @15,@SM03155                                     05S0457
*                           END;                                05S0458
         AH    LOOPINDX,AVTKEYLE(,RAVT)                         05S0458
@DE00454 LR    @11,PIUDLEN                                      05S0458
         BCTR  @11,0                                            05S0458
         CR    LOOPINDX,@11                                     05S0458
         BNH   @DL00454                                         05S0458
*                         END;                                  05S0459
*                       MDRWTO=''B; /* CLEAR AN UNUSED FIELD IN THE
*                                      DATA AREA                     */
@RC00450 XC    MDRWTO(18,RMDR),MDRWTO(RMDR)                     05S0460
*                     END;                                      05S0461
*                     CASEINDX=XCTL;/* SETUP XCTL TO IGE0625F FOR
*                                      WRITE TO LOGREC               */
         LA    CASEINDX,3                                       04S0462
*                   END;                                        04S0463
*                 ELSE                                          04S0464
*                   DO;             /* ..ELSE PROCESS FID0 SOH  04S0464
*                                      RECORDS                       */
         B     @RC00428                                         04S0464
@RF00428 DS    0H                                               04S0465
*                     DATADDR=ADDR(SOHDATA0);/* SETUP DATA ADDRESS   */
         LA    @11,PRFPIUO(,RPRF)                               04S0465
         SLR   @09,@09                                          04S0465
         IC    @09,PRFPIUO(,RPRF)                               04S0465
         ALR   @11,@09                                          04S0465
         LA    @09,SOHDATA0(,@11)                               04S0465
         ST    @09,DATADDR                                      04S0465
*                     IF SOHSTX=DLE /* IF THERE IS A DLE IN THE DATA
*                                      FOR TRANSPARENT MODE          */
*                       THEN                                    04S0466
         CLI   SOHSTX(@11),X'10'                                04S0466
         BNE   @RF00466                                         04S0466
*                       DATADDR=DATADDR+1;/* ..THEN SKIP THE DLE     */
         AL    @09,@CF00095                                     04S0467
         ST    @09,DATADDR                                      04S0467
*                     ELSE                                      04S0468
*                       ;                                       04S0468
@RF00466 DS    0H                                               04S0469
*                     SOHDLEN=MIN((ADDR(PRFPIUO)+AVTKEYLE),(TTHDCF+ADDR
*                         (PIURH)))-ADDR(SOHDATA1);/* DETERMINE 04S0469
*                                      BUFFER UNIT DATA LENGTH       */
         LA    @11,PRFPIUO(,RPRF)                               04S0469
         LH    SOHDLEN,AVTKEYLE(,RAVT)                          04S0469
         ALR   SOHDLEN,@11                                      04S0469
         SLR   @09,@09                                          04S0469
         IC    @09,PRFPIUO(,RPRF)                               04S0469
         ALR   @11,@09                                          04S0469
         LA    @09,PIURH(,@11)                                  04S0469
         SLR   @07,@07                                          04S0469
         ICM   @07,3,TTHDCF(@11)                                04S0469
         ALR   @09,@07                                          04S0469
         CR    SOHDLEN,@09                                      04S0469
         BNH   *+6
         LR    SOHDLEN,@09                                      04S0469
         L     @09,DATADDR                                      04S0469
         LA    @07,SOHDATA1(,@09)                               04S0469
         SLR   SOHDLEN,@07                                      04S0469
*                     IF SOHTYPE=SOHC/* IF THE RECORD IS AN SOH%C PIU*/
*                       THEN                                    04S0470
         CLI   SOHTYPE(@11),C'C'                                04S0470
         BNE   @RF00470                                         04S0470
*                       DO;         /* ..THEN PROCESS AN SOH%C PIU   */
*                                                               05S0472
*                         /*******************************************/
*                         /*                                         */
*                         /* PROCESS.HANDLE.BLDREC.BLDWTO: THIS      */
*                         /* SEGMENT PROCESSES SOH%C RECORDS.        */
*                         /*                                         */
*                         /*******************************************/
*                                                               05S0472
*                         DO;                                   05S0472
*                           MDRFLAGS=WTOBEGFI;/* INITIALIZE WTO FLAGS*/
         MVC   MDRFLAGS(2,RMDR),@CB03015                        05S0473
*                           MDRMSGID=MSGNUM;/* MOVE MESSAGE NUMBER
*                                      INTO DATA AREA                */
         MVI   MDRMSGID+7(RMDR),C' '                            05S0474
         MVC   MDRMSGID(7,RMDR),@CC03019                        05S0474
*                           MDREBCCU=UCBNAME;/* MOVE CHANNEL AND UNIT
*                                      ADDRESS INTO MESSAGE          */
         MVI   MDREBCCU+3(RMDR),C' '                            05S0475
         L     @11,UCBPTR(,IOSBPTR)                             05S0475
         MVC   MDREBCCU(3,RMDR),UCBNAME(@11)                    05S0475
*                           MDRWTOL=LENGTH(WTOHDR)+SOHDLEN;/* SET
*                                      MESSAGE LENGTH                */
         LA    @11,16                                           05S0476
         ALR   @11,SOHDLEN                                      05S0476
         STH   @11,MDRWTOL(,RMDR)                               05S0476
*                           MDRDATA1(1:SOHDLEN)=SOHDATA1(1:SOHDLEN);
         LR    @07,SOHDLEN                                      05S0477
         BCTR  @07,0                                            05S0477
         EX    @07,@SM03157                                     05S0477
*                                   /* MOVE MESSAGE DATA TO DATA AREA*/
*                           WTOENDFG=WTOENDFI;/* SET WTO END FLAGS
*                                      FOR MESSAGE                   */
         LA    @09,WTOHDR(,RMDR)                                05S0478
         ALR   @09,@11                                          05S0478
         MVC   WTOENDFG(4,@09),@CB03017                         05S0478
*                           IF MDRCDE8=ON/* IF THE MESSAGE IS TO GO
*                                      TO THE SYSTEM TP CONSOLE      */
*                             THEN                              05S0479
         TM    MDRCDE8(RMDR),B'00000010'                        05S0479
         BNO   @RF00479                                         05S0479
*                             WTOCDE8=ON;/* ..THEN SO INDICATE       */
         OI    WTOCDE8(@09),B'00000001'                         05S0480
*                           ELSE                                05S0481
*                             IF MDRCDE10=ON/* IF THE MESSAGE IS TO
*                                      GO TO THE SYSTEM MAINTENANCE
*                                      CONSOLE                       */
*                               THEN                            05S0481
         B     @RC00479                                         05S0481
@RF00479 TM    MDRCDE10(RMDR),B'00000100'                       05S0481
         BNO   @RF00481                                         05S0481
*                               WTOCDE10=ON;/* ..THEN SO INDICATE    */
         LA    @11,WTOHDR(,RMDR)                                05S0482
         AH    @11,MDRWTOL(,RMDR)                               05S0482
         OI    WTOCDE10(@11),B'01000000'                        05S0482
*                             ELSE                              05S0483
*                               WTOCDE2=ON;/* ..ELSE INDICATE THAT
*                                      THE MESSAGE IS TO GO TO THE
*                                      SYSTEM MASTER CONSOLE         */
         B     @RC00481                                         05S0483
@RF00481 LA    @11,WTOHDR(,RMDR)                                05S0483
         AH    @11,MDRWTOL(,RMDR)                               05S0483
         OI    WTOCDE2(@11),B'01000000'                         05S0483
*                         END;                                  05S0484
@RC00481 DS    0H                                               05S0484
@RC00479 DS    0H                                               05S0485
*                         CASEINDX=WTO;/* SETUP WTO EXECUTION        */
         LA    CASEINDX,2                                       04S0485
*                       END;                                    04S0486
*                     ELSE                                      04S0487
*                       DO;         /* ..ELSE PROCESS SOH%E AND SOH%R
*                                      RECORDS                       */
         B     @RC00470                                         04S0487
@RF00470 DS    0H                                               04S0488
*                         MDRWTO=''B;/* CLEAR FIELDS IN THE GETMAINED
*                                      WORKAREA WHICH ARE NOT USED
*                                      FOR SOH%E AND SOH%R RECORDS   */
         XC    MDRWTO(18,RMDR),MDRWTO(RMDR)                     04S0488
*                         MDRSECID=''B;                         04S0489
         MVI   MDRSECID(RMDR),X'00'                             04S0489
*                                                               05S0490
*                         /*******************************************/
*                         /*                                         */
*                         /* PROCESS.HANDLE.BLDREC.BLDSOH: THIS      */
*                         /* SEGMENT PROCESSES AN SOH%E OR SOH%R     */
*                         /* RECORD.                                 */
*                         /*                                         */
*                         /*******************************************/
*                                                               05S0490
*                         DO;                                   05S0490
*                           IF SOHTYPE=SOHE/* IF THE RECORD IS AN
*                                      SOH%E PIU                     */
*                             THEN                              05S0491
         LA    @11,PRFPIUO(,RPRF)                               05S0491
         SLR   @09,@09                                          05S0491
         IC    @09,PRFPIUO(,RPRF)                               05S0491
         ALR   @11,@09                                          05S0491
         CLI   SOHTYPE(@11),C'E'                                05S0491
         BNE   @RF00491                                         05S0491
*                             DO;   /* ..THEN PROCESS AN SOH%E RECORD*/
*                               MDRRECID=SOHFLAGS;/* MOVE RECORD ID  */
         L     @11,DATADDR                                      05S0493
         IC    @09,SOHFLAGS(,@11)                               05S0493
         STC   @09,MDRRECID(,RMDR)                              05S0493
*                               IF MDRRECID=ID2715/* IF THE RECORD IS
*                                      FROM A 2715 DEVICE            */
*                                 THEN                          05S0494
         CLI   MDRRECID(RMDR),8                                 05S0494
         BNE   @RF00494                                         05S0494
*                                 DO;/* THEN ADJUST OUR DATAMOVE
*                                      PARAMETERS TO COMPENSATE FOR
*                                      UNIQUE IDIOCY OF THE 2715
*                                      RECORD FORMAT                 */
*                                   DATADDR=DATADDR+GL2715;/* BUMP
*                                      PAST GARBAGE IN THE RECORD    */
         LA    @09,2                                            05S0496
         ALR   @11,@09                                          05S0496
         ST    @11,DATADDR                                      05S0496
*                                   SOHDLEN=SOHDLEN-GL2715;/* REDUCE
*                                      MESSAGE LENGTH BY GARBAGE
*                                      LENGTH                        */
         SLR   SOHDLEN,@09                                      05S0497
*                                 END;                          05S0498
*                               ELSE                            05S0499
*                                 ;                             05S0499
@RF00494 DS    0H                                               05S0500
*                               MDRDATA2(1:SOHDLEN)=SOHDATA1(1:SOHDLEN)
*                                   ;/* MOVE SOH DATA        @OY18083*/
         LR    @11,SOHDLEN                                      05S0500
         BCTR  @11,0                                            05S0500
         L     @09,DATADDR                                      05S0500
         EX    @11,@SM03161                                     05S0500
*                               MDRBUFSZ=LENGTH(SOHHDR)+SOHDLEN;/*
*                                      SET DATA SIZE         @OY18083*/
         LA    @11,26                                           05S0501
         ALR   @11,SOHDLEN                                      05S0501
         STH   @11,MDRBUFSZ(,RMDR)                              05S0501
*                             END;                              05S0502
*                           ELSE                                05S0503
*                             DO;   /* ..ELSE PROCESS AN SOH%R RECORD*/
         B     @RC00491                                         05S0503
@RF00491 DS    0H                                               05S0504
*                               MDRRECID=SOHRID;/* SETUP SOH%R RECORD
*                                      ID                            */
         MVI   MDRRECID(RMDR),X'13'                             05S0504
*                               DATADDR=DATADDR-1;/* BACKUP DATA
*                                      POINTER SINCE THERE IS NO
*                                      CONTROL BYTE AT THE FRONT OF
*                                      SOH%R DATA                    */
         L     @11,DATADDR                                      05S0505
         BCTR  @11,0                                            05S0505
         ST    @11,DATADDR                                      05S0505
*                               SOHDLEN=SOHDLEN+1;/* INCREASE DATA
*                                      SIZE FOR SAME REASON          */
         LA    SOHDLEN,1(,SOHDLEN)                              05S0506
*                               RFY                             05S0507
*                                (ROPCAVT,                      05S0507
*                                 REG11) RSTD;/*             @OY18083*/
*                               REG11=IOSBPTR;/* SAVE RQE PTR   05S0508
*                                                            @OY18083*/
         LR    REG11,IOSBPTR                                    05S0508
*                               REG09=TTHOAF;/* SET CONNECTION  05S0509
*                                                            @OY18083*/
         LA    @07,PRFPIUO(,RPRF)                               05S0509
         SLR   @15,@15                                          05S0509
         IC    @15,PRFPIUO(,RPRF)                               05S0509
         ALR   @07,@15                                          05S0509
         SLR   REG09,REG09                                      05S0509
         ICM   REG09,3,TTHOAF(@07)                              05S0509
*                               IF REG09^=0/* TTCIN VALID    @OY18083*/
*                                 THEN                          05S0510
         LTR   REG09,REG09                                      05S0510
         BZ    @RF00510                                         05S0510
*                                 DO;/*                      @OY18083*/
*                                   NAMEADDR=ADDR(TNTFIRST)+(REG09-1)*(
*                                       TNTENLEN+LENGTH(TNTTRMAD));
         L     @15,IEDQNPTR(,RAVT)                              05S0512
         LA    NAMEADDR,82                                      05S0512
         ALR   NAMEADDR,@15                                     05S0512
         LR    @01,REG09                                        05S0512
         BCTR  @01,0                                            05S0512
         SLR   @14,@14                                          05S0512
         IC    @14,TNTENLEN(,@15)                               05S0512
         LA    @00,3                                            05S0512
         ALR   @00,@14                                          05S0512
         MR    @00,@00                                          05S0512
         ALR   NAMEADDR,@01                                     05S0512
*                                   MDRTNAME='';/* BLANK NAME   05S0513
*                                                            @OY18083*/
         MVI   MDRTNAME(RMDR),C' '                              05S0513
         MVC   MDRTNAME+1(7,RMDR),MDRTNAME(RMDR)                05S0513
*                                   MDRTNAME(1:TNTENLEN)=TTENAME(1:
*                                       TNTENLEN);/* SET NAME   05S0514
*                                                            @OY18083*/
         BCTR  @14,0                                            05S0514
         EX    @14,@SM03163                                     05S0514
*                                   REG6SAVE=RPRF;/* SAVE REG 6 05S0515
*                                                            @OY18083*/
         STCM  RPRF,15,REG6SAVE(RMDR)                           05S0515
*                                   REG07=IEDQNPTR;/* LOAD TNT  05S0516
*                                      ADDRESS               @OY18083*/
         LR    REG07,@15                                        05S0516
*                                   GENERATE(BAL   6,46(,7));/* FIND
*                                      TTE ADDRESS           @OY18083*/
         BAL   6,46(,7)
*                                   RPARM=REG08;/* GET TERMINAL ADDR
*                                                            @OY18083*/
         LR    RPARM,REG08                                      05S0518
*                                   ROPCAVT=AVTOCGET;/* LOAD OPCON
*                                      AVT                   @OY18083*/
         L     ROPCAVT,AVTOCGET(,RAVT)                          05S0519
*                                   REG13=ADDR(REGSAVE);/* LOAD 05S0520
*                                      SAVEAREA              @OY18083*/
         LA    REG13,REGSAVE(,RMDR)                             05S0520
*                                   DO UNTIL TRMTYPE=TRMNSDLC;/*
*                                      LOCATE LINE           @OY18083*/
@DL00521 DS    0H                                               05S0522
*                                    CALL COHORTLK;/* ENTRY  @OY18083*/
         L     @15,OPCHORT(,ROPCAVT)                            05S0522
         BALR  @14,@15                                          05S0522
*                                    REG08=RPARM;/* SET REGISTER
*                                                            @OY18083*/
         LR    REG08,RPARM                                      05S0523
*                                   END;/*                   @OY18083*/
@DE00521 LR    @09,IEDQTPTR                                     05S0524
         AL    @09,@CF03165                                     05S0524
         CLI   TRMTYPE-11(@09),X'20'                            05S0524
         BNE   @DL00521                                         05S0524
*                                   RAVT=TCXAVT;/* RESTORE AVT  05S0525
*                                      ADDRESS               @OY18083*/
         L     @09,CVTPTR                                       05S0525
         L     @09,TCXPTR(,@09)                                 05S0525
         L     RAVT,TCXAVT(,@09)                                05S0525
*                                   REG09=REG00;/* SET CONNECTED
*                                                            @OY18083*/
         LR    REG09,REG00                                      05S0526
*                                   NAMEADDR=ADDR(TNTFIRST)+(REG09-1)*(
*                                       TNTENLEN+LENGTH(TNTTRMAD));
         L     @15,IEDQNPTR(,RAVT)                              05S0527
         LA    NAMEADDR,82                                      05S0527
         ALR   NAMEADDR,@15                                     05S0527
         LR    @01,REG09                                        05S0527
         BCTR  @01,0                                            05S0527
         SLR   @14,@14                                          05S0527
         IC    @14,TNTENLEN(,@15)                               05S0527
         LA    @15,3                                            05S0527
         ALR   @15,@14                                          05S0527
         MR    @00,@15                                          05S0527
         ALR   NAMEADDR,@01                                     05S0527
*                                   MDRLNAME='';/* BLANK NAME   05S0528
*                                                            @OY18083*/
         MVI   MDRLNAME(RMDR),C' '                              05S0528
         MVC   MDRLNAME+1(7,RMDR),MDRLNAME(RMDR)                05S0528
*                                   MDRLNAME(1:TNTENLEN)=TTENAME(1:
*                                       TNTENLEN);/* SET NAME   05S0529
*                                                            @OY18083*/
         BCTR  @14,0                                            05S0529
         EX    @14,@SM03166                                     05S0529
*                                   RPRF=REG6SAVE;/* RESTORE REG 6
*                                                            @OY18083*/
         ICM   RPRF,15,REG6SAVE(RMDR)                           05S0530
*                                 END;/*                     @OY18083*/
*                               ELSE                            05S0532
*                                 DO;/*                      @OY18083*/
         B     @RC00510                                         05S0532
@RF00510 DS    0H                                               05S0533
*                                   MDRTNAME=UNKNOWN;/* BLANK   05S0533
*                                      TERMINAL NAME         @OY18083*/
         MVC   MDRTNAME(8,RMDR),@CC03013                        05S0533
*                                   MDRLNAME=UNKNOWN;/* BLANK LINE
*                                      NAME                  @OY18083*/
         MVC   MDRLNAME(8,RMDR),@CC03013                        05S0534
*                                 END;/*                     @OY18083*/
*                               MDRDATA2(1:SOHDLEN)=SOHDATA1(1:SOHDLEN)
*                                   ;/* MOVE SOH DATA        @OY18083*/
@RC00510 LR    @09,SOHDLEN                                      05S0536
         BCTR  @09,0                                            05S0536
         L     @07,DATADDR                                      05S0536
         EX    @09,@SM03168                                     05S0536
*                               MDRBUFSZ=LENGTH(SOHHDR)+SOHDLEN+16;/*
*                                      SET RECORD LENGTH     @OY18083*/
         LA    @09,42                                           05S0537
         ALR   @09,SOHDLEN                                      05S0537
         STH   @09,MDRBUFSZ(,RMDR)                              05S0537
*                               IOSBPTR=REG11;/* RESTORE RQE @OY18083*/
         LR    IOSBPTR,REG11                                    05S0538
*                               RFY                             05S0539
*                                (ROPCAVT,                      05S0539
*                                 REG11) UNRSTD;/*           @OY18083*/
*                             END;  /*                       @OY18083*/
*                         END;                                  05S0541
@RC00491 DS    0H                                               05S0542
*                         CASEINDX=XCTL;/* SETUP XCTL TO IGE0625F    */
         LA    CASEINDX,3                                       04S0542
*                       END;                                    04S0543
*                   END;                                        04S0544
@RC00470 DS    0H                                               04S0545
*               END;                                            04S0545
@RC00428 DS    0H                                               04S0546
*               CALL IPCSTCXQ;      /* PUT THE PROCESSED RECORD ON
*                                      THE TCX READY QUEUE FOR  03S0546
*                                      POSTING TO BUFFER DISPOSITION */
         BAL   @14,IPCSTCXQ                                     03S0546
*             END;                                              03S0547
*           ELSE                                                03S0548
*             DO;                   /* ..ELSE FREE THE GETMAINED
*                                      STORAGE AREA AND SETUP RETURN
*                                      TO IGG019TH                   */
         B     @RC00421                                         03S0548
@RF00421 DS    0H                                               03S0549
*               RFY                                             03S0549
*                 RCORESZE RSTD;                                03S0549
*               RCORESZE=MDRFREE;   /* GET GETMAINED AREA SIZE FOR
*                                      FREEMAIN                      */
         LH    RCORESZE,MDRFREE(,RMDR)                          03S0550
*               GEN CODE REFS(RCORESZE,RMDR) SETS(REG00,RPARM) NODEFS
*                   NOEXIT NOFLOWS SEQFLOW;                     03S0551
*        /*
 FREEMAIN R,LV=(RCORESZE),A=(RMDR),SP=254
*               RFY                                             03S0552
*                 RCORESZE UNRSTD;                              03S0552
*               LCBGETMN=OFF;       /* NO LONGER INDICATE THAT A
*                                      GETMAIN HAS BEEN DONE         */
         NI    LCBGETMN(RLCB),B'01111111'                       03S0553
*               CASEINDX=ERREXCP;   /* SETUP ERROR EXCP EXIT TO 03S0554
*                                      IGG019TH                      */
         LA    CASEINDX,1                                       03S0554
*             END;                                              03S0555
*         END;                                                  03S0556
*       ELSE                                                    03S0557
*         CASEINDX=ERREXCP;         /* SETUP ERROR EXCP EXIT TO 03S0557
*                                      IGG019TH                      */
         B     @RC00419                                         03S0557
@RF00419 LA    CASEINDX,1                                       03S0557
*                                                               04S0558
*       /*************************************************************/
*       /*                                                           */
*       /* PROCESS.HANDLE.EXIT: THIS SEGMENT DISPOSES OF THE         */
*       /* FORMATTED DATA CREATED IN THE GETMAINED DATA AREA BY THIS */
*       /* MODULE.                                                   */
*       /*                                                           */
*       /*************************************************************/
*                                                               04S0558
*       DO;                                                     04S0558
@RC00419 DS    0H                                               04S0559
*         RFY                                                   04S0559
*           RPARM RSTD;                                         04S0559
*         RPARM=IOSBPTR;            /* RESTORE IOSB POINTER  @G36XREB*/
         LR    RPARM,IOSBPTR                                    04S0560
*         DO;                       /* CASE(CASEINDX)NAMES(CERREXCP,C
*                                      WTO,CXTL625F)                 */
*           DCL                                                 04S0562
*             CL0001@ LABEL BASED(CP0001@(CASEINDX)) VALUERANGE(
*                 CERREXCP,CWTO,CXTL625F);/* BRANCH TARGET           */
*           DCL                                                 04S0563
*             CP0001@(3) PTR(31) INIT(ADDR(CERREXCP),ADDR(CWTO),ADDR(
*                 CXTL625F));                                   04S0563
*           GOTO CL0001@;           /* BRANCH TO SELECTED CASE       */
         LR    @11,CASEINDX                                     04S0564
         SLA   @11,2                                            04S0564
         L     @11,CP0001@-4(@11)                               04S0564
         BR    @11                                              04S0564
*                                                               05S0565
*           /*********************************************************/
*           /*                                                       */
*           /* PROCESS.HANDLE.EXIT.ERREXCP: THIS SEGMENT IS THE      */
*           /* SUBCASE OF THE EXIT CASE WHICH RETURNS CONTROL TO IOS.*/
*           /*                                                       */
*           /*********************************************************/
*                                                               05S0565
*CERREXCP:                                                      05S0565
*           DO;                     /* SUBCASE                       */
CERREXCP DS    0H                                               05S0566
*             SVC(15);              /* ERROR EXCP                    */
         SVC   15                                               05S0566
*             SVC(3);               /* EXIT                          */
         SVC   3                                                05S0567
*             GOTO CE0001@;         /* BRANCH TO END OF CASE         */
         B     CE0001@                                          05S0568
*           END;                    /* END OF SUBCASE                */
*                                                               05S0570
*           /*********************************************************/
*           /*                                                       */
*           /* PROCESS.HANDLE.EXIT.WTO: THIS SEGMENT IS THE SUBCASE  */
*           /* OF THE EXIT CASE WHICH WRITES AN SOHC MESSAGE TO THE  */
*           /* OPERATOR.                                             */
*           /*                                                       */
*           /*********************************************************/
*                                                               05S0570
*CWTO:                                                          05S0570
*           DO;                     /* SUBCASE                       */
CWTO     DS    0H                                               05S0571
*             RPARM=ADDR(WTOHDR);   /* GET ADDRESS OF MESSAGE        */
         LA    RPARM,WTOHDR(,RMDR)                              05S0571
*             GEN CODE NODEFS NOEXIT NOFLOWS REFS(RPARM) SEQFLOW NOSETS
*                 ;                                             05S0572
*                                                          /*
 WTO MF=(E,(RPARM))
*             GOTO CE0001@;         /* BRANCH TO END OF CASE         */
         B     CE0001@                                          05S0573
*           END;                    /* END OF SUBCASE                */
*                                                               05S0575
*           /*********************************************************/
*           /*                                                       */
*           /* PROCESS.HANDLE.EXIT.XCTL: THIS SEGMENT IS THE SUBCASE */
*           /* OF THE EXIT CASE WHICH EXITS TO THE SYSTEM XCTL       */
*           /* ROUTINE TO XCTL TO IGE0625F TO WRITE A RECORD ON      */
*           /* SYS1.LOGREC.                                          */
*           /*                                                       */
*           /*********************************************************/
*                                                               05S0575
*CXTL625F:                                                      05S0575
*           DO;                     /* SUBCASE                       */
CXTL625F DS    0H                                               05S0576
*             MDRCCU=UCBCUA&UCBMASK;/* SETUP CHANNEL AND UNIT ADDRESS*/
         L     @11,UCBPTR(,IOSBPTR)                             05S0576
         MVC   MDRCCU(2,RMDR),UCBCUA(@11)                       05S0576
         NC    MDRCCU(2,RMDR),@CB03010                          05S0576
*             LCBOBR=OFF;           /* MAKE SURE THAT IGE0625F WILL
*                                      CHECK FOR A TCAM REQUEST      */
         NI    LCBOBR(RLCB),B'11111110'                         05S0577
*             EWTCBUFF=LCBRECAD;    /* ADDR OF TPER BUFFER   @G36XREB*/
         L     @11,EWAPTR(,IOSBPTR)                             05S0578
         MVC   EWTCBUFF(3,@11),LCBRECAD(RLCB)                   05S0578
*             EWAMDR=ON;            /* INDICATE TP ERR RECORD   05S0579
*                                                            @G36XREB*/
         OI    EWAMDR(@11),B'10000000'                          05S0579
*             RFY                                               05S0580
*              (REG13,                                          05S0580
*               REG14) RSTD;                                    05S0580
*             REG13=XCTL625F;       /* SETUP XCTL TO IGE0625F        */
         L     REG13,@CF03025                                   05S0581
*             MDRXCTL=XCTL904I;     /* SETUP RETURN XCTL TO THIS
*                                      MODULE                        */
         MVC   MDRXCTL(2,RMDR),@CB03023                         05S0582
*             REG14=CVTXTLER;       /* GET ADDRESS OF SYSTEM XCTL
*                                      ROUTINE                       */
         L     @11,CVTPTR                                       05S0583
         L     REG14,CVTXTLER(,@11)                             05S0583
*             GEN CODE EXIT NOFLOWS REFS(REG13,REG14) NOSEQFLOW NOSETS;
*                                                         /*
 BR    REG14                           BRANCH TO SYSTEM XCTL ROUTINE
*             RFY                                               05S0585
*              (REG13,                                          05S0585
*               REG14) UNRSTD;                                  05S0585
*             GOTO CE0001@;         /* BRANCH TO END OF CASE         */
*           END;                    /* END OF SUBCASE                */
*CE0001@:                                                       04S0588
*         END;                      /* END OF CASE                   */
CE0001@  DS    0H                                               04S0589
*         RFY                                                   04S0589
*           RPARM UNRSTD;                                       04S0589
*       END;                                                    04S0590
*     END;                                                      03S0591
@DE00418 B     @DL00418                                         03S0591
*   END;                                                        02S0592
*                                                               02S0593
*   /*****************************************************************/
*   /*                                                               */
*   /* IPCSOBRQ: THIS INTERNAL PROCEDURE REMOVES RECORDS FROM THE LCB*/
*   /* OBR QUEUE.                                                    */
*   /*                                                               */
*   /*****************************************************************/
*                                                               02S0593
*IPCSOBRQ:                                                      02S0593
*   PROC OPTIONS(NOENTREG,NOPARMREG,NORETREG,NOSAVE,NOSAVEAREA);
@EL00001 DS    0H                                               02S0593
@EF00001 DS    0H                                               02S0593
@ER00001 BR    @14                                              02S0593
IPCSOBRQ DS    0H                                               02S0594
*   RFY                                                         02S0594
*     RPIU RSTD;                                                02S0594
*   RPRF=LCBOBRCH;                  /* GET TOP RECORD                */
         L     RPRF,LCBOBRCH(,RLCB)                             02S0595
*CSLOOP1:                                                       02S0596
*   RPIU=PRFLINK;                   /* GET SECOND RECORD             */
CSLOOP1  L     RPIU,PRFLINK-1(,RPRF)                            02S0596
         LA    RPIU,0(,RPIU)                                    02S0596
*   CS(RPRF,RPIU,LCBOBRCH);         /* COMPARE FIRST AND THIRD  02S0597
*                                      OPERANDS-IF EQUAL, REPLACE
*                                      THIRD OPERAND WITH SECOND
*                                      OPERAND--ELSE REPLACE FIRST
*                                      OPERAND WITH THIRD OPERAND AND
*                                      SET NONZERO CONDITION CODE    */
         CS    RPRF,@05,LCBOBRCH(RLCB)                          02S0597
*   BC(MASK0111,CSLOOP1);           /* REPEAT UNTIL IT WORKS         */
         BC    7,CSLOOP1                                        02S0598
*   RFY                                                         02S0599
*     RPIU UNRSTD;                                              02S0599
*   END IPCSOBRQ;                                               02S0600
@EL00002 DS    0H                                               02S0600
@EF00002 DS    0H                                               02S0600
@ER00002 BR    @14                                              02S0600
*                                                               02S0601
*   /*****************************************************************/
*   /*                                                               */
*   /* IPCSTCXQ: THIS INTERNAL PROCEDURE POSTS TCAM BUFFERS TO BUFFER*/
*   /* DISPOSITION VIA THE TCX READY QUEUE.                          */
*   /*                                                               */
*   /*****************************************************************/
*                                                               02S0601
*IPCSTCXQ:                                                      02S0601
*   PROC OPTIONS(NOENTREG,NOPARMREG,NORETREG,NOSAVE,NOSAVEAREA);
IPCSTCXQ DS    0H                                               02S0602
*   RFY                                                         02S0602
*     RPIU RSTD;                                                02S0602
*   IF LCBSTAT1^=CLSDWNIP           /* IF CLOSEDOWN IS NOT IN   02S0603
*                                      PROGRESS                      */
*     THEN                                                      02S0603
         CLI   LCBSTAT1(RLCB),X'FF'                             02S0603
         BE    @RF00603                                         02S0603
*     DO;                           /* ..THEN DO THE POST            */
*       PRFNBUNT=0;                 /* BUFFER DISPOSITION WILL  02S0605
*                                      CALCULATE THE NUMBER OF UNITS
*                                      IN A BUFFER WHEN PRFNBUNT IS
*                                      ZERO                          */
         MVI   PRFNBUNT(RPRF),X'00'                             02S0605
*       PRFQCBA=ADDR(AVTBFRTB);     /* SETUP QCB TO BE POSTED        */
         LA    @11,AVTBFRTB(,RAVT)                              02S0606
         STCM  @11,7,PRFQCBA(RPRF)                              02S0606
*       PRFPRI=PRIBFRTB;            /* SETUP PRIORITY                */
         MVI   PRFPRI(RPRF),X'E0'                               02S0607
*       RPIU=TCXREADY;              /* GET TOP ELEMENT ON QUEUE      */
         L     @11,CVTPTR                                       02S0608
         L     @11,TCXPTR(,@11)                                 02S0608
         L     RPIU,TCXREADY(,@11)                              02S0608
*CSLOOP2:                                                       02S0609
*       PRFLINK=RPIU;               /* MAKE THE TOP ELEMENT THE 02S0609
*                                      SECOND ELEMENT                */
CSLOOP2  STCM  RPIU,7,PRFLINK(RPRF)                             02S0609
*       CS(RPIU,RPRF,TCXREADY);     /* COMPARE FIRST AND THIRD  02S0610
*                                      OPERANDS-IF EQUAL, REPLACE
*                                      THIRD OPERAND WITH SECOND
*                                      OPERAND--ELSE REPLACE FIRST
*                                      OPERAND WITH THIRD OPERAND AND
*                                      SET NONZERO CONDITION    02S0610
*                                      CODE(COMPARE AND SWAP)        */
         L     @11,CVTPTR                                       02S0610
         L     @11,TCXPTR(,@11)                                 02S0610
         CS    RPIU,@06,TCXREADY(@11)                           02S0610
*       BC(MASK0111,CSLOOP2);       /* REPEAT UNTIL IT WORKS         */
         BC    7,CSLOOP2                                        02S0611
*     END;                                                      02S0612
*   ELSE                                                        02S0613
*     ;                             /* ..ELSE SKIP THE POST          */
@RF00603 DS    0H                                               02S0614
*   RFY                                                         02S0614
*     RPIU UNRSTD;                                              02S0614
*   END IPCSTCXQ;                                               02S0615
@EL00003 DS    0H                                               02S0615
@EF00003 DS    0H                                               02S0615
@ER00003 BR    @14                                              02S0615
*   END IGE0904I                                                01S0616
*                                                               01S0616
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */
*/*%INCLUDE SYSLIB  (TOPCAVTD)                                       */
*/*%INCLUDE SYSLIB  (TTRMD   )                                       */
*/*%INCLUDE SYSLIB  (TAVTD   )                                       */
*/*%INCLUDE SYSLIB  (TBDUD   )                                       */
*/*%INCLUDE SYSLIB  (CVT     )                                       */
*/*%INCLUDE SYSLIB  (EWAMAP  )                                       */
*/*%INCLUDE SYSLIB  (IECDIOSB)                                       */
*/*%INCLUDE SYSLIB  (TLCBD   )                                       */
*/*%INCLUDE SYSLIB  (TPIUD   )                                       */
*/*%INCLUDE SYSLIB  (TPRFD   )                                       */
*/*%INCLUDE SYSLIB  (TPRIOR  )                                       */
*/*%INCLUDE SYSLIB  (TTCXD   )                                       */
*/*%INCLUDE SYSLIB  (TTNTD   )                                       */
*/*%INCLUDE SYSLIB  (TRHD    )                                       */
*/*%INCLUDE SYSLIB  (TTHD    )                                       */
*/*%INCLUDE SYSLIB  (IEFUCBOB)                                       */
*/*%INCLUDE SYSUT5  (RFY     )                                       */
*/*%INCLUDE SYSUT5  (DCL     )                                       */
*/*%INCLUDE SYSUT5  (PROCESS )                                       */
*/*%INCLUDE SYSUT5  (GETMAIN )                                       */
*/*%INCLUDE SYSUT5  (HANDLE  )                                       */
*/*%INCLUDE SYSUT5  (BLDREC  )                                       */
*/*%INCLUDE SYSUT5  (BLDMDR  )                                       */
*/*%INCLUDE SYSUT5  (BLDWTO  )                                       */
*/*%INCLUDE SYSUT5  (BLDSOH  )                                       */
*/*%INCLUDE SYSUT5  (EXIT    )                                       */
*/*%INCLUDE SYSUT5  (ERREXCP )                                       */
*/*%INCLUDE SYSUT5  (WTO     )                                       */
*/*%INCLUDE SYSUT5  (XCTL    )                                       */
*/*%INCLUDE SYSUT5  (IPCSOBRQ)                                       */
*/*%INCLUDE SYSUT5  (IPCSTCXQ)                                       */
*                                                               01S0616
*       ;                                                       01S0616
@DATA    DS    0H
@SM03151 MVC   MDRNAME(0,RMDR),TTENAME(NAMEADDR)
@SM03153 MVC   MDRDATA(0,RMDR),RUDATA(@09)
@SM03155 MVC   MDRDATA(0,@11),UNITDATA(RPRF)
@SM03157 MVC   MDRDATA1(0,RMDR),SOHDATA1(@09)
@SM03161 MVC   MDRDATA2(0,RMDR),SOHDATA1(@09)
@SM03163 MVC   MDRTNAME(0,RMDR),TTENAME(NAMEADDR)
@SM03166 MVC   MDRLNAME(0,RMDR),TTENAME(NAMEADDR)
@SM03168 MVC   MDRDATA2(0,RMDR),SOHDATA1(@07)
@DATD    DSECT
         DS    0F
IGE0904I CSECT
         DS    0F
@CF00095 DC    F'1'
@CF00150 DC    F'7'
@CF00032 DC    F'8'
@CF03144 DC    F'34'
@CF03145 DC    F'114'
@CF03025 DC    F'6256'
@CF03165 DC    F'-3'
@CF03047 DC    XL4'FFFFFFF8'
@DATD    DSECT
         DS    0D
DATADDR  DS    A
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA
@ENDDATD EQU   *
IGE0904I CSECT
         NOPR  ((@ENDDATD-@DATD)/9*16)
         DS    0F
@SIZDATD DC    AL1(0)
         DC    AL3(@ENDDATD-@DATD)
         DS    0D
@CC03013 DC    C'*UNKNOWN'
@CC03019 DC    C'IED151I'
@CB03017 DC    X'10000000'
@CB03010 DC    X'3FFF'
@CB03015 DC    X'8000'
@CB03023 DC    X'2359'
         DS    CL3
CP0001@  DC    AL4(CERREXCP)
         DC    AL4(CWTO)
         DC    AL4(CXTL625F)
@00      EQU   00                      EQUATES FOR REGISTERS 0-15
@01      EQU   01
@02      EQU   02
@03      EQU   03
@04      EQU   04
@05      EQU   05
@06      EQU   06
@07      EQU   07
@08      EQU   08
@09      EQU   09
@10      EQU   10
@11      EQU   11
@12      EQU   12
@13      EQU   13
@14      EQU   14
@15      EQU   15
NAMEADDR EQU   @07
UNITDLEN EQU   @05
PIUDLEN  EQU   @02
LENDATTM EQU   @09
LOOPINDX EQU   @07
CASEINDX EQU   @07
SOHDLEN  EQU   @05
ROPCAVT  EQU   @02
IEDQTPTR EQU   @08
IOSBPTR  EQU   @08
LCBXPTR  EQU   @05
RAVT     EQU   @13
RLCB     EQU   @04
RPRF     EQU   @06
REG00    EQU   @00
RPARM    EQU   @01
RCORESZE EQU   @02
RMDR     EQU   @03
RPIU     EQU   @05
REG07    EQU   @07
REG08    EQU   @08
REG09    EQU   @09
REG10    EQU   @10
REG11    EQU   @11
RBASE    EQU   @12
REG13    EQU   @13
REG14    EQU   @14
REG15    EQU   @15
REG01    EQU   @01
REG02    EQU   @02
REG03    EQU   @03
REG04    EQU   @04
REG05    EQU   @05
REG06    EQU   @06
REG12    EQU   @12
CVTPTR   EQU   16
IEDQOPCD EQU   0
OPCAQCTL EQU   IEDQOPCD+180
OPCLDNME EQU   IEDQOPCD+212
OPCHORT  EQU   IEDQOPCD+256
OPCSPEC  EQU   IEDQOPCD+300
OPCPWCOB EQU   IEDQOPCD+368
OPCPWQCB EQU   OPCPWCOB
OPCPWECB EQU   OPCPWCOB+4
IEDQTRM  EQU   0
TRMSTATE EQU   IEDQTRM
TRMLOG   EQU   TRMSTATE
TRMINSEQ EQU   IEDQTRM+4
TLISTCNT EQU   TRMINSEQ
TRMOUTSQ EQU   IEDQTRM+6
TLISTEN  EQU   TRMOUTSQ
TRMDSORG EQU   TLISTEN
TRMALTD  EQU   IEDQTRM+8
TRMDEVFL EQU   IEDQTRM+10
TRMSTAT  EQU   IEDQTRM+12
IEDNTRM  EQU   0
TRMBYTE4 EQU   IEDNTRM
TRMBYTE3 EQU   IEDNTRM+1
TRMBYTE2 EQU   IEDNTRM+2
TRMINPG  EQU   TRMBYTE2
TRMBYTE1 EQU   IEDNTRM+3
TRMSCPRQ EQU   TRMBYTE1
TRMBYTE0 EQU   IEDNTRM+6
TRMSIBPT EQU   IEDNTRM+7
TRMTYPE  EQU   IEDNTRM+11
IEDQAVTD EQU   0
AVTSAVEX EQU   IEDQAVTD+288
AVTREADD EQU   IEDQAVTD+380
AVTBUFSW EQU   IEDQAVTD+384
@NM00024 EQU   IEDQAVTD+388
AVTCKFLG EQU   @NM00024
AVTOCGET EQU   IEDQAVTD+392
AVTBASE  EQU   IEDQAVTD+412
AVTPKF   EQU   AVTBASE
AVTRNMPT EQU   IEDQAVTD+424
AVTOSECB EQU   IEDQAVTD+492
AVTECB1  EQU   AVTOSECB
AVTHG02  EQU   IEDQAVTD+528
AVTDISP  EQU   IEDQAVTD+552
AVTHD    EQU   IEDQAVTD+556
AVTSCOPT EQU   AVTHD
AVTSAVTP EQU   IEDQAVTD+612
AVTSAVTF EQU   AVTSAVTP
AVTCKPEL EQU   IEDQAVTD+652
AVTCKRMV EQU   AVTCKPEL
AVTCKELF EQU   IEDQAVTD+680
AVTCKBYT EQU   IEDQAVTD+691
AVTHG01  EQU   IEDQAVTD+692
AVTCKLNK EQU   IEDQAVTD+696
AVTCRELE EQU   IEDQAVTD+708
AVTCCELE EQU   AVTCRELE
AVTCLRHI EQU   IEDQAVTD+716
AVTADBUF EQU   IEDQAVTD+720
AVTSYSER EQU   IEDQAVTD+728
AVTBFRFG EQU   IEDQAVTD+784
AVTBFRTB EQU   IEDQAVTD+792
AVTCKPQB EQU   IEDQAVTD+804
AVTCKPTB EQU   AVTCKPQB
AVTCKPEC EQU   AVTCKPQB+4
AVTCKPCC EQU   AVTCKPEC
AVTOPCQB EQU   IEDQAVTD+816
AVTOPCOB EQU   AVTOPCQB
AVTOPCEC EQU   AVTOPCQB+4
AVTOPCCC EQU   AVTOPCEC
AVTOLTQB EQU   IEDQAVTD+828
AVTCWFL1 EQU   IEDQAVTD+924
AVTCWFL2 EQU   IEDQAVTD+925
AVTSUBT  EQU   IEDQAVTD+948
AVTIOTR  EQU   IEDQAVTD+949
AVTKEYLE EQU   IEDQAVTD+1032
AVTBIT1  EQU   IEDQAVTD+1050
AVTBIT2  EQU   IEDQAVTD+1051
AVTBIT3  EQU   IEDQAVTD+1052
AVTBIT4  EQU   IEDQAVTD+1136
@NM00106 EQU   IEDQAVTD+1232
IEDQAPTR EQU   0
IEDNSVTD EQU   0
SAVTDIAG EQU   IEDNSVTD
SAVTDIAF EQU   SAVTDIAG
SAVTLUSQ EQU   IEDNSVTD+88
SAVTTCPU EQU   IEDNSVTD+238
SAVTNAX  EQU   IEDNSVTD+248
SAVTZELM EQU   IEDNSVTD+270
SAVTRDRV EQU   IEDNSVTD+284
SAVTCKQB EQU   IEDNSVTD+300
SAVTCKTB EQU   SAVTCKQB
SAVTCKEC EQU   SAVTCKQB+4
SAVTCKCC EQU   SAVTCKEC
IEDBDU   EQU   0
BDUFNFLG EQU   IEDBDU+2
BDUBDUFG EQU   IEDBDU+3
BDURSP   EQU   IEDBDU+4
BDUSYRSP EQU   BDURSP
BDUEXRSP EQU   BDURSP+1
BDUEND   EQU   IEDBDU+6
CVTMAP   EQU   0
CVTXTLER EQU   CVTMAP+44
CVTDAR   EQU   CVTMAP+72
CVTFLGS1 EQU   CVTDAR
CVTDCB   EQU   CVTMAP+116
CVTIERLC EQU   CVTMAP+144
CVTOPTA  EQU   CVTMAP+182
CVTOPTB  EQU   CVTMAP+183
CVTGTF   EQU   CVTMAP+236
CVTGTFST EQU   CVTGTF
CVTGTFS  EQU   CVTGTFST
CVTSTATE EQU   CVTGTFST
CVTTMODE EQU   CVTGTFST
CVTFORM  EQU   CVTGTFST
CVTAQAVT EQU   CVTMAP+240
CVTTCMFG EQU   CVTAQAVT
CVTVOLM2 EQU   CVTMAP+244
CVTTATA  EQU   CVTVOLM2
CVTTSKS  EQU   CVTTATA
CVTVOLF2 EQU   CVTTSKS
CVTTAT   EQU   CVTTATA+1
CVTATER  EQU   CVTMAP+248
CVTEXT1  EQU   CVTMAP+252
CVTPURG  EQU   CVTMAP+260
CVTQMSG  EQU   CVTMAP+268
CVTDMSR  EQU   CVTMAP+272
CVTRSV37 EQU   CVTDMSR
CVTDMSRF EQU   CVTRSV37
CVTERPV  EQU   CVTMAP+316
CVTINTLA EQU   CVTMAP+320
CVTAPF   EQU   CVTMAP+324
CVTEXT2  EQU   CVTMAP+328
CVTHJES  EQU   CVTMAP+332
CVTPGSIA EQU   CVTMAP+348
CVTA1F1  EQU   CVTMAP+356
CVTSYSK  EQU   CVTMAP+357
CVTVOLM1 EQU   CVTMAP+380
CVTVOLF1 EQU   CVTVOLM1
CVTATMCT EQU   CVTMAP+388
CVTXTNT1 EQU   0
CVTXTNT2 EQU   0
CVTDSSV  EQU   CVTXTNT2
CVTFLGBT EQU   CVTXTNT2+5
CVTQID   EQU   CVTXTNT2+24
CVTSHS   EQU   CVTXTNT2+40
CVTRV400 EQU   CVTXTNT2+52
CVTRV409 EQU   CVTXTNT2+53
CVTATCVT EQU   CVTXTNT2+64
CVTRV429 EQU   CVTXTNT2+84
CVTRV438 EQU   CVTXTNT2+85
CVTRV457 EQU   CVTXTNT2+112
CVTRV466 EQU   CVTXTNT2+113
CVTFIX   EQU   0
CVTRELNO EQU   CVTFIX+252
EWA      EQU   0
EWAHDR   EQU   EWA
EWAFLAGS EQU   EWA+4
EWAFLG1  EQU   EWAFLAGS
EWASCCD  EQU   EWAFLG1
EWASCC3  EQU   EWASCCD
EWAFLG2  EQU   EWAFLAGS+1
EWAMDR   EQU   EWAFLG2
EWAFLG3  EQU   EWAFLAGS+2
EWASNSCT EQU   EWAFLAGS+3
EWACNTRS EQU   EWA+10
EWAERPIB EQU   EWA+16
EWARGFG1 EQU   EWAERPIB+4
EWARGFG2 EQU   EWAERPIB+5
EWAXCSW1 EQU   EWAERPIB+6
EWAXCSW2 EQU   EWAERPIB+7
EWAIERP  EQU   EWA+32
IOSB     EQU   0
IOSFLA   EQU   IOSB
IOSACHN  EQU   IOSFLA
IOSFLB   EQU   IOSB+1
IOSFLC   EQU   IOSB+2
IOSDVALT EQU   IOSFLC
IOSPKEY  EQU   IOSB+12
IOSOPT   EQU   IOSB+14
IOSOPT2  EQU   IOSB+15
IOSUCB   EQU   IOSB+16
@NM00138 EQU   IOSB+20
IOSCSW   EQU   @NM00138+1
IOSTATUS EQU   IOSCSW+3
IOSUSE   EQU   IOSB+32
IOSIPIB  EQU   IOSB+44
IOSERP   EQU   IOSB+52
IOSPATH  EQU   IOSB+86
IOSCHN   EQU   IOSPATH
IOSCKEY  EQU   IOSB+89
IOSEEKA  EQU   IOSB+100
IOSCCHH  EQU   IOSEEKA+3
IOSSKHH  EQU   IOSCCHH+2
IEDQLCB  EQU   0
LCBRCB   EQU   IEDQLCB
LCBTSOB  EQU   IEDQLCB+19
LCBCHAIN EQU   IEDQLCB+20
LCBSCRNN EQU   LCBCHAIN
LCBTETEN EQU   LCBCHAIN
LCBINSRC EQU   IEDQLCB+21
LCBLKMDE EQU   LCBINSRC+2
LCBNTXT  EQU   IEDQLCB+24
LCBSTAT4 EQU   LCBNTXT
LCBPHASE EQU   LCBSTAT4
LCBSCBDA EQU   IEDQLCB+25
LCBMHA   EQU   IEDQLCB+29
LCBFLAG1 EQU   IEDQLCB+32
LCBIOBSN EQU   IEDQLCB+33
LCBSNS   EQU   LCBIOBSN+1
LCBSENS0 EQU   LCBSNS
LCBLOSDT EQU   LCBSENS0
LCBTMOUT EQU   LCBSENS0
LCBFLAG3 EQU   LCBIOBSN+7
LCBOBR   EQU   LCBFLAG3
LCBCSW   EQU   LCBIOBSN+8
LCBCSWST EQU   LCBCSW+3
LCBCSWUS EQU   LCBCSWST
LCBCSWCS EQU   LCBCSWST+1
LCBSIOCC EQU   LCBIOBSN+15
LCBDCBPT EQU   IEDQLCB+52
LCBRCQCB EQU   IEDQLCB+56
LCBRESTR EQU   LCBRCQCB
LCBTHSQ  EQU   IEDQLCB+60
LCBINCAM EQU   LCBTHSQ
LCBGETMN EQU   LCBINCAM
LCBERRCT EQU   IEDQLCB+62
LCBLSPCI EQU   IEDQLCB+65
LCBRCBFR EQU   LCBLSPCI
LCBSTATE EQU   IEDQLCB+70
LCBSTAT1 EQU   LCBSTATE
LCBSTAT2 EQU   LCBSTATE+1
LCBBEOTN EQU   LCBSTAT2
LCBSYNC  EQU   LCBSTAT2
LCBDIAL  EQU   LCBSTAT2
LCBTSTSW EQU   IEDQLCB+72
LCBRECAD EQU   IEDQLCB+73
LCBERB   EQU   IEDQLCB+76
LCBERBST EQU   IEDQLCB+84
LCBDLNKN EQU   LCBERBST
LCBERBCT EQU   IEDQLCB+88
LCBRBCT2 EQU   LCBERBCT+1
LCBMSGFM EQU   IEDQLCB+92
LCBOBRCH EQU   IEDQLCB+96
LCBINVPT EQU   LCBOBRCH+1
LCBBFRW  EQU   LCBINVPT
LCBTPCD  EQU   IEDQLCB+100
LCBSTAT5 EQU   LCBTPCD
LCBSTAT6 EQU   LCBTPCD+4
LCBRSPSV EQU   LCBTPCD+8
LCBSAVSN EQU   IEDQLCB+112
LCBERCCW EQU   IEDQLCB+120
LCBCPA   EQU   IEDQLCB+144
LCBCCW5  EQU   LCBCPA+32
LCBATTEL EQU   LCBCCW5
LCBQEBPL EQU   LCBATTEL
IEDQLPTR EQU   0
IEDQLCBX EQU   0
LCBXCON  EQU   IEDQLCBX
LCBXFLAG EQU   LCBXCON
LCBXDCT  EQU   LCBXCON+1
LCBXRADR EQU   LCBXCON+4
IEDPIU   EQU   0
PIUTH    EQU   IEDPIU
PIURH    EQU   IEDPIU+10
PIURU    EQU   IEDPIU+13
IEDQPRF  EQU   0
PRFRCB   EQU   IEDQPRF
PRFKEY   EQU   PRFRCB
PRFQCBA  EQU   PRFRCB+1
PRFPRI   EQU   PRFRCB+4
PRFLINK  EQU   PRFRCB+5
PRFTIC   EQU   IEDQPRF+8
PRFTICC  EQU   PRFTIC
PRFNBUNT EQU   IEDQPRF+12
PRFSUNIT EQU   PRFNBUNT
PRFPLQCB EQU   PRFSUNIT
PRFPIUO  EQU   PRFPLQCB
@NM00192 EQU   IEDQPRF+16
PRFSVFFO EQU   @NM00192
PRFSTAT1 EQU   IEDQPRF+20
PRFEOFN  EQU   PRFSTAT1
PRFCORE  EQU   IEDQPRF+21
PRFXTRA  EQU   PRFCORE
PRFSCAN  EQU   IEDQPRF+24
PRFTQBCK EQU   IEDQPRF+26
PRFNTXT  EQU   PRFTQBCK
PRFEOBOF EQU   PRFNTXT
PRFCHDR  EQU   IEDQPRF+32
PRFHQBCK EQU   IEDQPRF+35
IEDQPPTR EQU   0
IEDPF1   EQU   0
PRF1FLG1 EQU   IEDPF1+3
PRF1WD2  EQU   IEDPF1+4
PRF1SEQP EQU   PRF1WD2
PRF1SQID EQU   PRF1SEQP
PRF1TAG1 EQU   PRF1SQID
IEDPF2   EQU   0
PRF2FLG2 EQU   IEDPF2
PRF2WD2  EQU   IEDPF2+4
IEDQTCXD EQU   0
TCXAVT   EQU   IEDQTCXD
TCXATTEN EQU   IEDQTCXD+4
TCXREADY EQU   IEDQTCXD+24
TCXFLAG1 EQU   IEDQTCXD+34
TCXBUFA  EQU   IEDQTCXD+80
TCXDSAVE EQU   IEDQTCXD+104
TCXQE8   EQU   IEDQTCXD+216
IEDQTNTD EQU   0
IEDQTCDE EQU   IEDQTNTD
TNTENLEN EQU   IEDQTNTD+40
IEDQTDCE EQU   IEDQTNTD+46
TNTFIRST EQU   0
IEDTNTA  EQU   0
TNTTRMAD EQU   IEDTNTA
IEDRH    EQU   0
TRHBYTE0 EQU   IEDRH
TRHBYTE1 EQU   IEDRH+1
TRHBYTE2 EQU   IEDRH+2
IEDTH    EQU   0
TTHBYTE0 EQU   IEDTH
TTHFTYPE EQU   TTHBYTE0
TTHOAF   EQU   IEDTH+4
TTHSNF   EQU   IEDTH+6
TTHTAG   EQU   TTHSNF
TTHTAG1  EQU   TTHTAG
TTHDCF   EQU   IEDTH+8
UCB      EQU   0
UCBOB    EQU   0
UCBJBNR  EQU   UCBOB
UCBFL5   EQU   UCBOB+1
UCBAF    EQU   UCBFL5
UCBSTAT  EQU   UCBOB+3
UCBCHAN  EQU   UCBOB+4
UCBCHA   EQU   UCBCHAN
UCBSFLS  EQU   UCBOB+6
UCBFLA   EQU   UCBSFLS
UCBFL1   EQU   UCBFLA
UCBBSY   EQU   UCBFL1
UCBNRY   EQU   UCBFL1
UCBPST   EQU   UCBFL1
UCBCUB   EQU   UCBFL1
UCBFLB   EQU   UCBSFLS+1
UCBCHM   EQU   UCBOB+8
UCBCHM1  EQU   UCBCHM
UCBPTH0  EQU   UCBCHM1
UCBPTH1  EQU   UCBCHM1
UCBWGT   EQU   UCBOB+12
UCBNAME  EQU   UCBOB+13
UCBTYP   EQU   UCBOB+16
UCBTBYT1 EQU   UCBTYP
UCB1FEA5 EQU   UCBTBYT1
UCB1FEA6 EQU   UCBTBYT1
UCBTBYT2 EQU   UCBTYP+1
UCB2OPT2 EQU   UCBTBYT2
UCBDUDN1 EQU   UCB2OPT2
UCB2OPT3 EQU   UCBTBYT2
UCBDUDN2 EQU   UCB2OPT3
UCB2OPT4 EQU   UCBTBYT2
UCBRWTAU EQU   UCB2OPT4
UCB2OPT6 EQU   UCBTBYT2
UCB2OPT7 EQU   UCBTBYT2
UCBTBYT3 EQU   UCBTYP+2
UCBDVCLS EQU   UCBTBYT3
UCBTBYT4 EQU   UCBTYP+3
UCBEXTPT EQU   UCBOB+20
UCBFLC   EQU   UCBEXTPT
UCBDEV   EQU   UCBOB+24
UCBCMEXT EQU   0
UCBATI   EQU   UCBCMEXT+3
@NM00214 EQU   UCBATI
UCBFLP1  EQU   UCBCMEXT+5
UCBMT    EQU   0
UCBOCR   EQU   0
UCB3540X EQU   0
UCBDKBYT EQU   UCB3540X+6
UCB3800X EQU   0
UCBOPTNS EQU   UCB3800X
UCBACTIV EQU   UCB3800X+3
UCBMDRBF EQU   UCB3800X+36
UCBUCS   EQU   0
UCBUCSOP EQU   UCBUCS+4
UCBFCBOP EQU   UCBUCS+5
TTENAME  EQU   0
IEDIAP03 EQU   0
COHORTLK EQU   0
MDRMAP   EQU   0
TPERHDR  EQU   MDRMAP
MDRFREE  EQU   TPERHDR
MDRHDR   EQU   TPERHDR+2
MDRBUFSZ EQU   MDRHDR
MDRSECID EQU   MDRHDR+2
MDRXCTL  EQU   MDRHDR+3
MDRRECID EQU   MDRHDR+5
MDRCDE10 EQU   MDRRECID
MDRCDE8  EQU   MDRRECID
MDRWTO   EQU   MDRHDR+6
MDRCCU   EQU   MDRHDR+24
MDRNAME  EQU   MDRHDR+26
MDRNETA  EQU   MDRHDR+34
MDRDATA  EQU   MDRMAP+38
WTOMAP   EQU   0
WTOHDR   EQU   WTOMAP+8
MDRWTOL  EQU   WTOHDR
MDRFLAGS EQU   WTOHDR+2
MDRMSGID EQU   WTOHDR+4
MDREBCCU EQU   WTOHDR+12
MDRDATA1 EQU   WTOMAP+24
SOHMAP   EQU   0
SOHHDR   EQU   SOHMAP+2
MDRDATA2 EQU   SOHMAP+28
MDRTNAME EQU   SOHMAP+32
MDRLNAME EQU   SOHMAP+40
REGSAVE  EQU   SOHMAP+48
COMPSAVE EQU   SOHMAP+96
REG6SAVE EQU   SOHMAP+104
SOHDATA  EQU   0
SOHFLAGS EQU   SOHDATA
SOHDATA1 EQU   SOHDATA+1
WTOENDFG EQU   0
@NM00223 EQU   WTOENDFG+2
WTOCDE2  EQU   @NM00223
WTOCDE8  EQU   @NM00223
@NM00226 EQU   WTOENDFG+3
WTOCDE10 EQU   @NM00226
CL0001@  EQU   0
TNTCODE  EQU   0
TNTDCODE EQU   0
UCBBGN   EQU   0
UCBDCPTR EQU   0
OPCAQWD  EQU   OPCAQCTL
OPCAQWD1 EQU   OPCAQWD
OPCAQWD2 EQU   OPCAQWD+4
OPCAQWD3 EQU   OPCAQWD+8
TRMPRE1  EQU   TRMBYTE4
TRMNCP1  EQU   TRMBYTE4
TRMPRE   EQU   TRMBYTE3
TRMNCP   EQU   TRMBYTE3
TRMPU    EQU   TRMBYTE3
TRMLU    EQU   TRMBYTE3
TRMLINK  EQU   TRMBYTE3
CVTS01   EQU   CVTPGSIA
CVTLPDIA EQU   CVTS01+12
CVTDIRST EQU   CVTLPDIA
CVTSLIDA EQU   CVTS01+24
CVTCTLFG EQU   CVTS01+50
CVTRV210 EQU   CVTS01+424
CVTRV219 EQU   CVTS01+425
CVTRV228 EQU   CVTS01+426
CVTRV237 EQU   CVTS01+427
CVTMFRTR EQU   CVTS01+452
CVTRV262 EQU   CVTS01+468
CVTRV271 EQU   CVTS01+469
CVTRV280 EQU   CVTS01+470
CVTRV289 EQU   CVTS01+471
CVTGSDA  EQU   CVTS01+600
EWAPTR   EQU   IOSERP
EWADDIOS EQU   EWAIERP
IOSATTSC EQU   IOSIPIB
IOSWTOWA EQU   IOSIPIB
IOSPCISC EQU   IOSIPIB
LCBRSPIN EQU   LCBIOBSN
LCBLUSNS EQU   LCBRSPIN+5
LCBSCPRS EQU   LCBRSPIN+9
LCBCSWU1 EQU   LCBSCPRS+2
LCBRSPFG EQU   LCBRSPIN+15
LCBCOREQ EQU   LCBTPCD
@NM00172 EQU   LCBCPA+40
LCBQNX   EQU   LCBERCCW
LCBQNXMN EQU   LCBQNX
LCBCANCL EQU   LCBSAVSN
LCBCANFG EQU   LCBCANCL
TCXPTR   EQU   CVTAQAVT
IEDQNPTR EQU   AVTRNMPT
UCBPTR   EQU   IOSUCB
UCBOBS01 EQU   UCBDEV
UCBSTAB  EQU   UCBOBS01+10
UCBBSVL  EQU   UCBSTAB
UCBPRSRS EQU   UCBSTAB
UCBDMCT  EQU   UCBOBS01+11
UCBFL4   EQU   UCBOBS01+13
UCBOBS02 EQU   UCBDEV
UCBTFL1  EQU   UCBOBS02+19
UCBXTN   EQU   UCBOBS02+20
UCBVOPT  EQU   UCBXTN
UCBOBS03 EQU   UCBDEV
UCBXTADR EQU   UCBOBS03
UCBOBS04 EQU   UCBDEV
UCBBTA   EQU   UCBOBS04+12
UCBOBS06 EQU   UCBDEV
UCBAOF   EQU   UCBOBS06
UCBAOF1  EQU   UCBAOF
UCBAOF2  EQU   UCBAOF+1
@NM00213 EQU   UCBOBS06+3
UCBIRB   EQU   UCBOBS06+4
UCBGRAF  EQU   UCBIRB
UCBLDNCA EQU   UCBOBS06+8
UCBRDYQ  EQU   UCBLDNCA
UCBIRLN  EQU   UCBRDYQ
UCBLDNCB EQU   UCBRDYQ+1
UCBCTLNK EQU   UCBOBS06+12
UCBOBS07 EQU   UCBDEV
UCBOBS08 EQU   UCBDEV
UCBCTCAD EQU   UCBOBS08
UCBCTCF1 EQU   UCBOBS08+4
UCBOBS09 EQU   UCBDEV
UNITDATA EQU   PRFPIUO
UCBCUA   EQU   UCBCHA
RU       EQU   PIURU
RUCNTL   EQU   RU
RUNA     EQU   RUCNTL+3
RUDATA   EQU   RU+5
RURECID  EQU   RUDATA+3
SOHRU    EQU   PIURU
SOHTYPE  EQU   SOHRU+8
SOHSTX   EQU   SOHRU+9
SOHDATA0 EQU   SOHRU+10
ETW      EQU   EWAIERP
EWTCBUFF EQU   ETW+41
BDUTEXT  EQU   BDUEND
PRFSHDR  EQU   IEDQPRF+42
RSRCTNTI EQU   SOHFLAGS
TRMOPT   EQU   IEDQTRM+20
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS
@NM00228 EQU   ETW
@NM00221 EQU   SOHRU
@NM00217 EQU   RUDATA+4
@NM00216 EQU   RUDATA
@NM00215 EQU   RUCNTL
UCBRV066 EQU   UCBOBS09+4
UCBIOSBA EQU   UCBOBS09
UCBRV042 EQU   UCBOBS08+5
UCBRV082 EQU   UCBCTCF1
UCBRV081 EQU   UCBCTCF1
UCBRV080 EQU   UCBCTCF1
UCBRV079 EQU   UCBCTCF1
UCBRV078 EQU   UCBCTCF1
UCBRV077 EQU   UCBCTCF1
UCBRV076 EQU   UCBCTCF1
UCBCTC80 EQU   UCBCTCF1
UCBCTCAL EQU   UCBCTCAD
UCBICNCB EQU   UCBOBS07+4
UCBRV040 EQU   UCBOBS07
UCBCTLNA EQU   UCBCTLNK+1
UCBRLN   EQU   UCBCTLNK
UCBRDYQA EQU   UCBLDNCB
UCBINRLN EQU   UCBIRLN
UCBIRBA  EQU   UCBIRB+1
UCBRV039 EQU   UCBGRAF
UCBDWNR  EQU   UCBGRAF
UCBRPND  EQU   UCBGRAF
UCBUPM   EQU   UCBGRAF
UCBBTAM  EQU   UCBGRAF
UCBDRNO  EQU   UCBGRAF
UCBDRO   EQU   UCBGRAF
UCBOIP   EQU   UCBGRAF
UCBATRCD EQU   @NM00213
UCBSKPFG EQU   @NM00213
UCBRIPND EQU   @NM00213
UCBRTIAC EQU   @NM00213
UCBRSV79 EQU   @NM00213
UCBRSV78 EQU   @NM00213
UCBRSV77 EQU   @NM00213
UCBOLTEP EQU   @NM00213
UCBATNCT EQU   UCBOBS06+2
UCBRSV76 EQU   UCBAOF2
UCBRSV75 EQU   UCBAOF2
UCBRSV74 EQU   UCBAOF2
UCBRSV73 EQU   UCBAOF2
UCBRSV72 EQU   UCBAOF2
UCBRSV71 EQU   UCBAOF2
UCBRSV70 EQU   UCBAOF2
UCBRSV69 EQU   UCBAOF2
UCBRSV68 EQU   UCBAOF1
UCBRSV67 EQU   UCBAOF1
UCBRSV66 EQU   UCBAOF1
UCBRSV65 EQU   UCBAOF1
UCBRSV64 EQU   UCBAOF1
UCBOFNL  EQU   UCBAOF1
UCBOFSP  EQU   UCBAOF1
UCBOFMCR EQU   UCBAOF1
UCBBTB   EQU   UCBBTA+1
UCBDI    EQU   UCBBTA
UCBSNS   EQU   UCBOBS04+8
UCBTEB   EQU   UCBOBS04+4
UCBGCB   EQU   UCBOBS04+3
UCBOPEN  EQU   UCBOBS04+2
UCBSTART EQU   UCBOBS04
UCBXTNB  EQU   UCBXTN+1
UCBRSV22 EQU   UCBVOPT
UCBRSV21 EQU   UCBVOPT
UCBRSV20 EQU   UCBVOPT
UCBESVE  EQU   UCBVOPT
UCBERPC  EQU   UCBVOPT
UCBESVC  EQU   UCBVOPT
UCBEVA   EQU   UCBVOPT
UCBESV   EQU   UCBVOPT
UCBRV009 EQU   UCBTFL1
UCBRV008 EQU   UCBTFL1
UCBRV007 EQU   UCBTFL1
UCBRV006 EQU   UCBTFL1
UCBRV005 EQU   UCBTFL1
UCBRV038 EQU   UCBTFL1
UCBNSLTP EQU   UCBTFL1
UCBNLTP  EQU   UCBTFL1
UCBRES1B EQU   UCBOBS02+18
UCBFSER  EQU   UCBOBS02+12
@NM00212 EQU   UCBOBS02+4
UCBFSEQ  EQU   UCBOBS02+2
UCBFSCT  EQU   UCBOBS02
UCBNEXP  EQU   UCBOBS01+20
UCBBASE  EQU   UCBOBS01+16
UCBRES1A EQU   UCBOBS01+15
UCBUSER  EQU   UCBOBS01+14
UCBFL47  EQU   UCBFL4
UCBFL46  EQU   UCBFL4
UCBFL45  EQU   UCBFL4
UCBRV065 EQU   UCBFL4
UCBDSS   EQU   UCBFL4
UCBRV028 EQU   UCBFL4
UCBWDAV  EQU   UCBFL4
UCBDAVV  EQU   UCBFL4
UCBSQC   EQU   UCBOBS01+12
UCBDATP  EQU   UCBOBS01+12
UCBDMC   EQU   UCBDMCT
UCBMOUNT EQU   UCBDMCT
UCBBNUL  EQU   UCBSTAB
UCBSHAR  EQU   UCBSTAB
UCBBSTR  EQU   UCBSTAB
UCBBPUB  EQU   UCBSTAB
UCBBPRV  EQU   UCBSTAB
UCBBALB  EQU   UCBPRSRS
UCBPGFL  EQU   UCBSTAB
UCBDVSHR EQU   UCBBSVL
UCBVOLI  EQU   UCBOBS01+4
UCBVTOC  EQU   UCBOBS01
@NM00180 EQU   LCBCANCL+3
LCBCANTH EQU   LCBCANCL+1
@NM00179 EQU   LCBCANFG
LCBCANCD EQU   LCBCANFG
@NM00178 EQU   LCBCANFG
LCBCANEB EQU   LCBCANFG
LCBCANXT EQU   LCBCANFG
LCBUNADD EQU   LCBQNX+21
LCBUASZE EQU   LCBQNX+20
LCBDSTEA EQU   LCBQNX+16
@NM00177 EQU   LCBQNX+8
LCBIOSBS EQU   LCBQNX+5
@NM00176 EQU   LCBQNX+4
LCBSTSAV EQU   LCBQNX+1
@NM00175 EQU   LCBQNXMN
LCBNX509 EQU   LCBQNXMN
LCBNX162 EQU   LCBQNXMN
LCBNX142 EQU   LCBQNXMN
LCBNX064 EQU   LCBQNXMN
@NM00174 EQU   @NM00172+4
LCBNCPPT EQU   @NM00172+1
@NM00173 EQU   @NM00172
LCBWRSCH EQU   LCBCOREQ+8
LCBCQLNK EQU   LCBCOREQ+4
LCBCQELE EQU   LCBCOREQ
LCBPAKCH EQU   LCBRSPIN+16
@NM00171 EQU   LCBRSPFG
LCBRSRH  EQU   LCBRSPFG
LCBEXPI  EQU   LCBRSPFG
@NM00170 EQU   LCBRSPIN+12
LCBUSUE1 EQU   LCBCSWU1
@NM00169 EQU   LCBCSWU1
@NM00168 EQU   LCBSCPRS+1
LCBDFCMD EQU   LCBSCPRS
LCBUSER  EQU   LCBLUSNS+2
LCBSMIN  EQU   LCBLUSNS+1
LCBSMAJ  EQU   LCBLUSNS
LCBRHSV  EQU   LCBRSPIN+2
LCBSNS0  EQU   LCBRSPIN+1
@NM00167 EQU   LCBRSPIN
IOSPCIWA EQU   IOSPCISC+44
IOSPCIRS EQU   IOSPCISC+8
@NM00143 EQU   IOSPCISC+4
@NM00142 EQU   IOSPCISC
IOSWRNDR EQU   IOSWTOWA+4
IOSWTOPT EQU   IOSWTOWA+3
IOSWTOCP EQU   IOSWTOWA+2
IOSWTOCH EQU   IOSWTOWA
IOSATTWA EQU   IOSATTSC+40
@NM00141 EQU   IOSATTSC+24
IOSATTSN EQU   IOSATTSC
EWAEND   EQU   EWADDIOS+71
EWASCSW  EQU   EWADDIOS+64
EWASNS   EQU   EWADDIOS
CVTRV628 EQU   CVTS01+728
CVTRV627 EQU   CVTS01+724
CVTRV626 EQU   CVTS01+720
CVTRV625 EQU   CVTS01+716
CVTRV624 EQU   CVTS01+712
CVTRV623 EQU   CVTS01+708
CVTRV622 EQU   CVTS01+704
CVTRV621 EQU   CVTS01+700
CVTRV620 EQU   CVTS01+696
CVTRV619 EQU   CVTS01+692
CVTRV618 EQU   CVTS01+688
CVTRV617 EQU   CVTS01+684
CVTRV616 EQU   CVTS01+680
CVTRV615 EQU   CVTS01+676
CVTRV614 EQU   CVTS01+672
CVTRV613 EQU   CVTS01+668
CVTTCASP EQU   CVTS01+664
CVT0PT03 EQU   CVTS01+660
CVT0PT0E EQU   CVTS01+656
CVTIRM   EQU   CVTS01+652
CVTCGK   EQU   CVTS01+648
CVTRV607 EQU   CVTS01+644
CVTRV606 EQU   CVTS01+640
CVTRV605 EQU   CVTS01+636
CVTRV604 EQU   CVTS01+632
CVTEFF02 EQU   CVTS01+628
CVTCBBR  EQU   CVTS01+624
CVTSSCR  EQU   CVTS01+620
CVTEVENT EQU   CVTS01+616
CVTCRCA  EQU   CVTS01+612
CVTTPIO  EQU   CVTS01+608
CVTADV   EQU   CVTS01+604
CVTGSDAB EQU   CVTGSDA
CVTQV3   EQU   CVTS01+596
CVTQV2   EQU   CVTS01+592
CVTQV1   EQU   CVTS01+588
CVTRPT   EQU   CVTS01+584
CVTSSRB  EQU   CVTS01+580
CVTCSDRL EQU   CVTS01+576
CVTEXP1  EQU   CVTS01+572
CVTRMPMT EQU   CVTS01+568
CVTRMPTT EQU   CVTS01+564
CVTVPSA  EQU   CVTS01+560
CVTVSTOP EQU   CVTS01+556
CVTGTFR8 EQU   CVTS01+552
CVTQUIT  EQU   CVTS01+548
CVTVACR  EQU   CVTS01+544
CVTWTCB  EQU   CVTS01+540
CVTSTPRS EQU   CVTS01+536
CVT0PT02 EQU   CVTS01+532
CVTDARCM EQU   CVTS01+528
CVTIRECM EQU   CVTS01+524
CVTJRECM EQU   CVTS01+520
CVTVEMS0 EQU   CVTS01+516
CVTSPFRR EQU   CVTS01+512
CVTRLSTG EQU   CVTS01+508
CVT0TC0A EQU   CVTS01+504
CVTGMBR  EQU   CVTS01+500
CVTLFRM  EQU   CVTS01+496
CVTRMBR  EQU   CVTS01+492
CVTVIOP  EQU   CVTS01+488
CVTRV307 EQU   CVTS01+486
CVTRV306 EQU   CVTS01+484
CVTRV305 EQU   CVTS01+482
CVTRV304 EQU   CVTS01+480
CVTRV303 EQU   CVTS01+478
CVTRV302 EQU   CVTS01+476
CVTTRCA  EQU   CVTS01+472
CVTRV297 EQU   CVTRV289
CVTRV296 EQU   CVTRV289
CVTRV295 EQU   CVTRV289
CVTRV294 EQU   CVTRV289
CVTRV293 EQU   CVTRV289
CVTRV292 EQU   CVTRV289
CVTRV291 EQU   CVTRV289
CVTRV290 EQU   CVTRV289
CVTRV288 EQU   CVTRV280
CVTRV287 EQU   CVTRV280
CVTRV286 EQU   CVTRV280
CVTRV285 EQU   CVTRV280
CVTRV284 EQU   CVTRV280
CVTRV283 EQU   CVTRV280
CVTRV282 EQU   CVTRV280
CVTRV281 EQU   CVTRV280
CVTRV279 EQU   CVTRV271
CVTRV278 EQU   CVTRV271
CVTRV277 EQU   CVTRV271
CVTRV276 EQU   CVTRV271
CVTRV275 EQU   CVTRV271
CVTRV274 EQU   CVTRV271
CVTRV273 EQU   CVTRV271
CVTRV272 EQU   CVTRV271
CVTRV270 EQU   CVTRV262
CVTRV269 EQU   CVTRV262
CVTRV268 EQU   CVTRV262
CVTRV267 EQU   CVTRV262
CVTRV266 EQU   CVTRV262
CVTRV265 EQU   CVTRV262
CVTRV264 EQU   CVTRV262
CVTRV263 EQU   CVTRV262
CVTVFP   EQU   CVTS01+464
CVTVSI   EQU   CVTS01+460
CVTVPSIB EQU   CVTS01+456
CVTMFACT EQU   CVTMFRTR
CVTMFCTL EQU   CVTS01+448
CVTPVBP  EQU   CVTS01+444
CVTPWI   EQU   CVTS01+440
CVTRV254 EQU   CVTS01+438
CVTRV253 EQU   CVTS01+436
CVTRV252 EQU   CVTS01+434
CVTRV251 EQU   CVTS01+433
CVTRV250 EQU   CVTS01+432
CVTRV249 EQU   CVTS01+431
CVTRV248 EQU   CVTS01+430
CVTRV247 EQU   CVTS01+429
CVTRV246 EQU   CVTS01+428
CVTRV245 EQU   CVTRV237
CVTRV244 EQU   CVTRV237
CVTRV243 EQU   CVTRV237
CVTRV242 EQU   CVTRV237
CVTRV241 EQU   CVTRV237
CVTRV240 EQU   CVTRV237
CVTRV239 EQU   CVTRV237
CVTRV238 EQU   CVTRV237
CVTRV236 EQU   CVTRV228
CVTRV235 EQU   CVTRV228
CVTRV234 EQU   CVTRV228
CVTRV233 EQU   CVTRV228
CVTRV232 EQU   CVTRV228
CVTRV231 EQU   CVTRV228
CVTRV230 EQU   CVTRV228
CVTRV229 EQU   CVTRV228
CVTRV227 EQU   CVTRV219
CVTRV226 EQU   CVTRV219
CVTRV225 EQU   CVTRV219
CVTRV224 EQU   CVTRV219
CVTRV223 EQU   CVTRV219
CVTRV222 EQU   CVTRV219
CVTRV221 EQU   CVTRV219
CVTRV220 EQU   CVTRV219
CVTRV218 EQU   CVTRV210
CVTRV217 EQU   CVTRV210
CVTRV216 EQU   CVTRV210
CVTRV215 EQU   CVTRV210
CVTRV214 EQU   CVTRV210
CVTRV213 EQU   CVTRV210
CVTRV212 EQU   CVTRV210
CVTRV211 EQU   CVTRV210
CVTLCCAT EQU   CVTS01+420
CVTPCCAT EQU   CVTS01+416
CVTIPCRP EQU   CVTS01+412
CVTIPCRI EQU   CVTS01+408
CVTIPCDS EQU   CVTS01+404
CVTAIDVT EQU   CVTS01+400
CVTSSAP  EQU   CVTS01+396
CVTEHCIR EQU   CVTS01+392
CVTEHDEF EQU   CVTS01+388
CVTDAIR  EQU   CVTS01+384
CVTPERFM EQU   CVTS01+380
CVT044R2 EQU   CVTS01+376
CVTFETCH EQU   CVTS01+372
CVTRSTWD EQU   CVTS01+368
CVTSPOST EQU   CVTS01+364
CVTIOBP  EQU   CVTS01+360
CVTASMVT EQU   CVTS01+356
CVTRECRQ EQU   CVTS01+352
CVTWSAC  EQU   CVTS01+348
CVTRV149 EQU   CVTS01+344
CVTWSAL  EQU   CVTS01+340
CVTSPSA  EQU   CVTS01+336
CVTGLMN  EQU   CVTS01+332
CVTVEAC0 EQU   CVTS01+328
CVT062R1 EQU   CVTS01+324
CVTRPOST EQU   CVTS01+320
CVTDQIQE EQU   CVTS01+316
CVTCSD   EQU   CVTS01+312
CVTLKRMA EQU   CVTS01+308
CVTRSPIE EQU   CVTS01+304
CVTRENQ  EQU   CVTS01+300
CVTLQCB  EQU   CVTS01+296
CVTFQCB  EQU   CVTS01+292
CVTQCS01 EQU   CVTS01+288
CVTAPFT  EQU   CVTS01+284
CVTPARRL EQU   CVTS01+280
CVTVWAIT EQU   CVTS01+276
CVTGSPL  EQU   CVTS01+272
CVTLSMQ  EQU   CVTS01+268
CVTGSMQ  EQU   CVTS01+264
CVTEXPRO EQU   CVTS01+260
CVTOPCTP EQU   CVTS01+256
CVTSIC   EQU   CVTS01+252
CVTTPIOS EQU   CVTS01+248
CVTRTMS  EQU   CVTS01+244
CVTSDBF  EQU   CVTS01+240
CVTSCBP  EQU   CVTS01+236
CVTSDMP  EQU   CVTS01+232
CVTSV60  EQU   CVTS01+228
CVTRTMCT EQU   CVTS01+224
CVTASCBL EQU   CVTS01+220
CVTASCBH EQU   CVTS01+216
CVTGDA   EQU   CVTS01+212
CVTASVT  EQU   CVTS01+208
CVTVVMDI EQU   CVTS01+204
CVTAQTOP EQU   CVTS01+200
CVTIOSCS EQU   CVTS01+196
CVTSDRM  EQU   CVTS01+192
CVTOPTE  EQU   CVTS01+188
CVTSTXU  EQU   CVTS01+184
CVTQUIS  EQU   CVTS01+180
CVTPARS  EQU   CVTS01+176
CVTS1EE  EQU   CVTS01+172
CVTFRAS  EQU   CVTS01+168
CVTQSAS  EQU   CVTS01+164
CVTCRAS  EQU   CVTS01+160
CVTCRMN  EQU   CVTS01+156
CVTDELCP EQU   CVTS01+152
CVTFRECL EQU   CVTS01+148
CVTGETCL EQU   CVTS01+144
CVTBLDCP EQU   CVTS01+140
CVTAUTHL EQU   CVTS01+136
CVTSCAN  EQU   CVTS01+132
CVTRV144 EQU   CVTS01+130
CVTMAXMP EQU   CVTS01+128
CVTSTCK  EQU   CVTS01+124
CVTRV139 EQU   CVTS01+123
CVTDSSAC EQU   CVTS01+122
CVTRV513 EQU   CVTS01+121
CVTIOSPL EQU   CVTS01+120
CVTPTGT  EQU   CVTS01+116
CVTCSPIE EQU   CVTS01+112
CVTSMFEX EQU   CVTS01+108
CVTOLT0A EQU   CVTS01+104
CVTSRBRT EQU   CVTS01+100
CVTPUTL  EQU   CVTS01+96
CVTASCRL EQU   CVTS01+92
CVTASCRF EQU   CVTS01+88
CVTRV326 EQU   CVTS01+84
CVTRV325 EQU   CVTS01+80
CVTRV324 EQU   CVTS01+76
CVT0VL01 EQU   CVTS01+72
CVTSHRVM EQU   CVTS01+68
CVTRV332 EQU   CVTS01+64
CVTTAS   EQU   CVTS01+60
CVTRSCN  EQU   CVTS01+56
CVTTRAC2 EQU   CVTS01+54
CVTTRACE EQU   CVTS01+52
CVTAPG   EQU   CVTS01+51
CVTSDTRC EQU   CVTCTLFG
CVTGTRCE EQU   CVTCTLFG
CVTNOMP  EQU   CVTCTLFG
CVTRSV79 EQU   CVTCTLFG
CVTDSTAT EQU   CVTCTLFG
CVTRSV78 EQU   CVTCTLFG
CVTRV333 EQU   CVTCTLFG
CVTRV323 EQU   CVTCTLFG
CVTSPVLK EQU   CVTS01+49
CVTRSV77 EQU   CVTS01+48
CVTRV331 EQU   CVTS01+44
CVTRV330 EQU   CVTS01+40
CVTRV329 EQU   CVTS01+36
CVTRV328 EQU   CVTS01+32
CVTRV322 EQU   CVTS01+28
CVTSLID  EQU   CVTSLIDA+1
CVTSYLK  EQU   CVTSLIDA
CVTRV321 EQU   CVTS01+20
CVTRV320 EQU   CVTS01+16
CVTLPDIR EQU   CVTLPDIA+1
CVTRSV69 EQU   CVTDIRST
CVTRSV68 EQU   CVTDIRST
CVTRSV67 EQU   CVTDIRST
CVTRSV66 EQU   CVTDIRST
CVTRSV65 EQU   CVTDIRST
CVTRSV64 EQU   CVTDIRST
CVTRSV63 EQU   CVTDIRST
CVTDICOM EQU   CVTDIRST
CVTPVTP  EQU   CVTS01+8
CVTLPDSR EQU   CVTS01+4
CVTGETL  EQU   CVTS01
@NM00020 EQU   TRMLINK
TRMLSTAT EQU   TRMLINK
TRMLINT  EQU   TRMLINK
TRMEPMOD EQU   TRMLINK
TRMLULOG EQU   TRMLU
TRMINERR EQU   TRMLU
TRMLUREQ EQU   TRMLU
TRMSESRQ EQU   TRMLU
TRMTDIFF EQU   TRMLU
TRMLUTM  EQU   TRMLU
TRMLUIT  EQU   TRMLU
TRMAUTO  EQU   TRMLU
TRMPCONT EQU   TRMPU
@NM00019 EQU   TRMPU
TRMNCONT EQU   TRMNCP
TRMQUCKN EQU   TRMNCP
TRMSLOWN EQU   TRMNCP
TRMSYGEN EQU   TRMNCP
TRMNCPCL EQU   TRMNCP
TRMIPLDM EQU   TRMNCP
TRMINOUT EQU   TRMPRE
TRMRDOUT EQU   TRMPRE
TRMNLOUT EQU   TRMPRE
TRMWROUT EQU   TRMPRE
TRMASNXI EQU   TRMPRE
TRMSTMM  EQU   TRMPRE
TRMCMODE EQU   TRMPRE
TRMSTPND EQU   TRMPRE
@NM00018 EQU   TRMNCP1
TRMINOP  EQU   TRMNCP1
TRMLYNCH EQU   TRMPRE1
TRMSPOUT EQU   TRMPRE1
TRMERLCK EQU   TRMPRE1
TRMQNPL  EQU   TRMPRE1
TRMSPACT EQU   TRMPRE1
TRMOCNI  EQU   TRMPRE1
TRMSESSN EQU   TRMPRE1
TRMCONT  EQU   TRMPRE1
OPCAQLST EQU   OPCAQWD3+1
OPCAQRQ3 EQU   OPCAQWD3
OPCAQSEC EQU   OPCAQWD2+1
OPCAQRQ2 EQU   OPCAQWD2
OPCAQFST EQU   OPCAQWD1+1
OPCAQREQ EQU   OPCAQWD1
@NM00227 EQU   @NM00226
@NM00225 EQU   @NM00223
@NM00224 EQU   @NM00223
@NM00222 EQU   WTOENDFG
@NM00220 EQU   SOHMAP
@NM00219 EQU   WTOMAP
MDRCDE2  EQU   MDRRECID
@NM00218 EQU   MDRRECID
UCBERADR EQU   UCBUCS+12
UCBFCBID EQU   UCBUCS+8
UCBERCNT EQU   UCBUCS+7
UCBRSV51 EQU   UCBUCS+6
UCBRSV50 EQU   UCBFCBOP
UCBRSV49 EQU   UCBFCBOP
UCBRSV48 EQU   UCBFCBOP
UCBRSV47 EQU   UCBFCBOP
UCBRSV46 EQU   UCBFCBOP
UCBRSV45 EQU   UCBFCBOP
UCBRSV44 EQU   UCBFCBOP
UCBFCBO1 EQU   UCBFCBOP
UCBUCSPE EQU   UCBUCSOP
UCBRSV43 EQU   UCBUCSOP
UCBRSV42 EQU   UCBUCSOP
UCBRSV41 EQU   UCBUCSOP
UCBRSV40 EQU   UCBUCSOP
UCBRSV39 EQU   UCBUCSOP
UCBUCSO2 EQU   UCBUCSOP
UCBUCSO1 EQU   UCBUCSOP
UCBUCSID EQU   UCBUCS
UCBMDRBA EQU   UCBMDRBF+1
UCBRV075 EQU   UCBMDRBF
UCBRV074 EQU   UCB3800X+32
UCBIMAGE EQU   UCB3800X+28
UCBFCBNM EQU   UCB3800X+24
UCBCHAR4 EQU   UCB3800X+20
UCBCHAR3 EQU   UCB3800X+16
UCBCHAR2 EQU   UCB3800X+12
UCBCHAR1 EQU   UCB3800X+8
UCBCGMID EQU   UCB3800X+4
UCBBRSTA EQU   UCBACTIV
UCBRV063 EQU   UCBACTIV
UCBRV062 EQU   UCBACTIV
UCBRV061 EQU   UCBACTIV
UCBRV060 EQU   UCBACTIV
UCBRV059 EQU   UCBACTIV
UCBRV058 EQU   UCBACTIV
UCBRV057 EQU   UCBACTIV
UCBRV050 EQU   UCB3800X+2
UCBCGMNO EQU   UCB3800X+1
UCBRV083 EQU   UCBOPTNS
UCBBRSTR EQU   UCBOPTNS
UCBRV056 EQU   UCBOPTNS
UCBRV055 EQU   UCBOPTNS
UCBRV054 EQU   UCBOPTNS
UCBRV053 EQU   UCBOPTNS
UCBRV052 EQU   UCBOPTNS
UCBRV051 EQU   UCBOPTNS
UCBRV073 EQU   UCB3540X+7
UCBRV072 EQU   UCBDKBYT
UCBRV071 EQU   UCBDKBYT
UCBRV070 EQU   UCBDKBYT
UCBRV069 EQU   UCBDKBYT
UCBRV068 EQU   UCBDKBYT
UCBRV067 EQU   UCBDKBYT
UCBVLVER EQU   UCBDKBYT
UCBDKAMX EQU   UCBDKBYT
UCBVLSER EQU   UCB3540X
UCBRDATA EQU   UCBOCR+4
UCBFRID  EQU   UCBOCR
UCBCLN   EQU   UCBMT+14
UCBERG   EQU   UCBMT+12
UCBMS    EQU   UCBMT+11
UCBNB    EQU   UCBMT+10
UCBPW    EQU   UCBMT+9
UCBPR    EQU   UCBMT+8
UCBSIO   EQU   UCBMT+6
UCBTW    EQU   UCBMT+5
UCBTR    EQU   UCBMT+4
UCBTWT   EQU   UCBMT+3
UCBTRT   EQU   UCBMT+2
UCBCTD   EQU   UCBMT
UCBWTOID EQU   UCBCMEXT+17
UCBRV043 EQU   UCBCMEXT+16
UCBASID  EQU   UCBCMEXT+14
UCBMFCNT EQU   UCBCMEXT+12
UCBPMSK  EQU   UCBCMEXT+10
UCBCCWOF EQU   UCBCMEXT+8
UCBRV041 EQU   UCBCMEXT+6
UCBRV036 EQU   UCBFLP1
UCBRV035 EQU   UCBFLP1
UCBERLOG EQU   UCBFLP1
UCBRV033 EQU   UCBFLP1
UCBRV032 EQU   UCBFLP1
UCBRV031 EQU   UCBFLP1
UCBSHRUP EQU   UCBFLP1
UCBNSRCH EQU   UCBFLP1
UCBSNSCT EQU   UCBCMEXT+4
UCBHPDV  EQU   @NM00214
UCBHALI  EQU   @NM00214
UCBRSV09 EQU   @NM00214
UCBRSV08 EQU   @NM00214
UCBRSV07 EQU   @NM00214
UCBRSV06 EQU   @NM00214
UCBRSV05 EQU   @NM00214
UCBRSV04 EQU   @NM00214
UCBDTI   EQU   UCBCMEXT+2
UCBSTI   EQU   UCBCMEXT+1
UCBETI   EQU   UCBCMEXT
UCBEXTP  EQU   UCBEXTPT+1
UCBDDRSW EQU   UCBFLC
UCBTICBT EQU   UCBFLC
UCBIVRR  EQU   UCBFLC
UCBIVRS  EQU   UCBFLC
UCBITF   EQU   UCBFLC
UCBUDE   EQU   UCBFLC
UCBWAA   EQU   UCBFLC
UCBATTP  EQU   UCBFLC
UCBUNTYP EQU   UCBTBYT4
UCBRSV11 EQU   UCBDVCLS
UCBRSV10 EQU   UCBDVCLS
UCB3CHAR EQU   UCBDVCLS
UCB3UREC EQU   UCBDVCLS
UCB3DISP EQU   UCBDVCLS
UCB3DACC EQU   UCBDVCLS
UCB3COMM EQU   UCBDVCLS
UCB3TAPE EQU   UCBDVCLS
UCBDVPWR EQU   UCB2OPT7
UCBVLPWR EQU   UCB2OPT6
UCB2OPT5 EQU   UCBTBYT2
UCBRVDEV EQU   UCBRWTAU
UCBRPS   EQU   UCBDUDN2
UCBRR    EQU   UCBDUDN1
UCB2OPT1 EQU   UCBTBYT2
UCB2OPT0 EQU   UCBTBYT2
UCB1FEA7 EQU   UCBTBYT1
UCBD6250 EQU   UCB1FEA6
UCBD1600 EQU   UCB1FEA5
UCB1FEA4 EQU   UCBTBYT1
UCB1FEA3 EQU   UCBTBYT1
UCB1FEA2 EQU   UCBTBYT1
UCB1FEA1 EQU   UCBTBYT1
UCB1FEA0 EQU   UCBTBYT1
UCBRV029 EQU   UCBWGT
UCBVHRSN EQU   UCBWGT
UCBVORSN EQU   UCBWGT
UCBMTPXP EQU   UCBWGT
UCBREW   EQU   UCBWGT
UCBPUB   EQU   UCBWGT
UCBOUT   EQU   UCBWGT
UCBIN    EQU   UCBWGT
UCBCPU   EQU   UCBOB+11
UCBLCI   EQU   UCBOB+10
UCBCNT   EQU   UCBOB+9
UCBRV017 EQU   UCBCHM1
UCBRV016 EQU   UCBCHM1
UCBRV015 EQU   UCBCHM1
UCBRV014 EQU   UCBCHM1
UCBSPB   EQU   UCBPTH1
UCBPPB   EQU   UCBPTH1
UCBSPA   EQU   UCBPTH0
UCBPPA   EQU   UCBPTH0
UCBSIGP  EQU   UCBFLB
UCBVALPH EQU   UCBFLB
UCBCRHSN EQU   UCBFLB
UCBCRHRV EQU   UCBFLB
UCBRESVH EQU   UCBFLB
UCBSPST  EQU   UCBFLB
UCBASNS  EQU   UCBFLB
UCBIORST EQU   UCBFLB
UCBQISCE EQU   UCBFL1
UCBACTV  EQU   UCBFL1
UCBSAP   EQU   UCBFL1
UCBNOTRC EQU   UCBCUB
UCBPSNS  EQU   UCBFL1
UCBUSING EQU   UCBPST
UCBNOTRD EQU   UCBNRY
UCBBUSYD EQU   UCBBSY
UCBUA    EQU   UCBCHAN+1
UCBDADI  EQU   UCBSTAT
UCBSYSR  EQU   UCBSTAT
UCBPRES  EQU   UCBSTAT
UCBALOC  EQU   UCBSTAT
UCBUNLD  EQU   UCBSTAT
UCBRESV  EQU   UCBSTAT
UCBCHGS  EQU   UCBSTAT
UCBONLI  EQU   UCBSTAT
UCBID    EQU   UCBOB+2
UCBALTPH EQU   UCBFL5
UCBALTCU EQU   UCBFL5
UCBNALOC EQU   UCBFL5
UCBENVRD EQU   UCBFL5
UCBVSDR  EQU   UCBFL5
UCBSASK  EQU   UCBFL5
UCBAMV   EQU   UCBAF
UCBDCC   EQU   UCBFL5
UCBMONT  EQU   UCBJBNR
UCBRV011 EQU   UCBJBNR
UCBRSV02 EQU   UCBJBNR
UCBOLDSM EQU   UCBJBNR
UCBRV003 EQU   UCBJBNR
UCBDUC   EQU   UCBJBNR
UCBJES3  EQU   UCBJBNR
UCBVRDEV EQU   UCBJBNR
UCBCMSEG EQU   UCBOB
UCBPFXND EQU   UCB+512
UCBIOQ   EQU   UCB+508
UCBLOCK  EQU   UCB+504
UCBPXST  EQU   UCB+504
@NM00211 EQU   UCB
TTHTAG2  EQU   TTHTAG+1
@NM00210 EQU   TTHTAG1
TTHTAGS  EQU   TTHTAG1
TTHDAF   EQU   IEDTH+2
TTHBYTE1 EQU   IEDTH+1
TTHEFI   EQU   TTHBYTE0
@NM00209 EQU   TTHBYTE0
TTHEBIU  EQU   TTHBYTE0
TTHBBIU  EQU   TTHBYTE0
@NM00208 EQU   TRHBYTE2
@NM00207 EQU   TRHBYTE2
@NM00206 EQU   TRHBYTE2
TRHCSI   EQU   TRHBYTE2
@NM00205 EQU   TRHBYTE2
TRHCDI   EQU   TRHBYTE2
TRHEB    EQU   TRHBYTE2
TRHBB    EQU   TRHBYTE2
TRHPI    EQU   TRHBYTE1
@NM00204 EQU   TRHBYTE1
@NM00203 EQU   TRHBYTE1
@NM00202 EQU   TRHBYTE1
TRHER    EQU   TRHBYTE1
TRHDR2   EQU   TRHBYTE1
@NM00201 EQU   TRHBYTE1
TRHDR1   EQU   TRHBYTE1
TRHEC    EQU   TRHBYTE0
TRHBC    EQU   TRHBYTE0
TRHSDI   EQU   TRHBYTE0
TRHFI    EQU   TRHBYTE0
@NM00200 EQU   TRHBYTE0
TRHRUCAT EQU   TRHBYTE0
TRHTYPE  EQU   TRHBYTE0
TNTLEN   EQU   IEDQTNTD+44
TNTMIDEN EQU   IEDQTNTD+41
TNTSRCHX EQU   IEDQTNTD+38
TCXEND   EQU   IEDQTCXD+224
TCXNCPIO EQU   IEDQTCXD+220
TCXACTE8 EQU   TCXQE8
TCXABEPL EQU   IEDQTCXD+212
TCXSRBS  EQU   IEDQTCXD+208
TCXSIOSB EQU   IEDQTCXD+204
TCXESAVE EQU   IEDQTCXD+132
TCXERPPM EQU   IEDQTCXD+128
TCXERPSV EQU   IEDQTCXD+116
TCXSATTN EQU   IEDQTCXD+112
@NM00199 EQU   TCXDSAVE+4
@NM00198 EQU   TCXDSAVE
TCXPLCB  EQU   IEDQTCXD+100
TCXBITS  EQU   IEDQTCXD+98
TCXSCBSZ EQU   IEDQTCXD+97
TCXBIT1  EQU   IEDQTCXD+96
TCXCOMPT EQU   IEDQTCXD+92
TCXAVAIL EQU   IEDQTCXD+88
TCXBUFL  EQU   IEDQTCXD+84
TCXTOTE  EQU   TCXBUFA
TCXCKPM  EQU   IEDQTCXD+79
TCXNCKPR EQU   IEDQTCXD+78
TCXSZAIB EQU   IEDQTCXD+76
TCXAIBC  EQU   IEDQTCXD+72
TCXPEBC  EQU   IEDQTCXD+68
TCXPEWAC EQU   IEDQTCXD+64
TCXQRQ   EQU   IEDQTCXD+60
TCXOCQ   EQU   IEDQTCXD+56
TCXPNTQ  EQU   IEDQTCXD+52
TCXPUTQ  EQU   IEDQTCXD+48
TCXGETQ  EQU   IEDQTCXD+44
TCXTSI   EQU   IEDQTCXD+40
TCXRPT   EQU   IEDQTCXD+36
TCXCC3TS EQU   IEDQTCXD+35
TCXAPDMP EQU   TCXFLAG1
TCXAPPL  EQU   TCXFLAG1
TCXRTM   EQU   TCXFLAG1
TCXMCPCD EQU   TCXFLAG1
TCXAUTH  EQU   TCXFLAG1
TCXASID  EQU   IEDQTCXD+32
TCXASCB  EQU   IEDQTCXD+28
TCXPASWD EQU   IEDQTCXD+16
TCXDISP  EQU   IEDQTCXD+12
TCXTCB   EQU   IEDQTCXD+8
TCXATTLN EQU   TCXATTEN
PRF2SEQP EQU   PRF2WD2
@NM00197 EQU   IEDPF2+1
@NM00196 EQU   PRF2FLG2
PRF2TERM EQU   PRF2FLG2
PRF2SMI  EQU   PRF2FLG2
PRF2FORM EQU   PRF2FLG2
PRF2TNTI EQU   PRF2FLG2
PRF1RULN EQU   PRF1SEQP+2
PRF1TAG2 EQU   PRF1SQID+1
@NM00195 EQU   PRF1TAG1
PRF1TAGS EQU   PRF1TAG1
@NM00194 EQU   PRF1FLG1
PRF1LOGD EQU   PRF1FLG1
PRF1USS  EQU   PRF1FLG1
PRF1FORM EQU   PRF1FLG1
PRF1EXPI EQU   PRF1FLG1
PRF1FIDI EQU   PRF1FLG1
PRF1RH   EQU   IEDPF1
PRFDEST  EQU   IEDQPRF+40
PRFISEQ  EQU   IEDQPRF+38
PRFSTXT  EQU   PRFHQBCK
PRFNHDR  EQU   PRFCHDR
PRFCRCD  EQU   IEDQPRF+29
PRFSVSEQ EQU   PRFNTXT+1
PRFSVPRI EQU   PRFEOBOF
PRFISIZE EQU   PRFSCAN+1
@NM00193 EQU   PRFSCAN
PRFEOB   EQU   PRFXTRA+1
PRFSTSO  EQU   PRFXTRA
PRFNHDRN EQU   PRFSTAT1
PRFNLSTN EQU   PRFSTAT1
PRFLOCK  EQU   PRFEOFN
PRFDUPLN EQU   PRFSTAT1
PRFTSMSG EQU   PRFSTAT1
PRFITCPN EQU   PRFSTAT1
PRFERMGN EQU   PRFSTAT1
PRFCNCLN EQU   PRFSTAT1
PRFSVFLG EQU   @NM00192+3
PRFSIZE  EQU   PRFSVFFO+2
PRFSRCE  EQU   PRFSVFFO
PRFLCB   EQU   IEDQPRF+13
PRFTI0   EQU   PRFTIC+1
@NM00191 EQU   PRFTICC
@NM00190 EQU   PRFTICC
@NM00189 EQU   PRFTICC
PRFTICON EQU   PRFTICC
@NM00188 EQU   PRFTICC
@NM00187 EQU   PRFTICC
PRFBFMM  EQU   PRFTICC
PRFEOMSG EQU   PRFTICC
PRFCOUNT EQU   PRFLINK+1
@NM00186 EQU   PRFLINK
PRFFLAGS EQU   PRFPRI
PRFIOADR EQU   PRFQCBA
PRFOPCDE EQU   PRFKEY
LCBERADR EQU   LCBXRADR+1
LCBPCIRC EQU   LCBXRADR
LCBDCT3  EQU   LCBXDCT+2
LCBDCT2  EQU   LCBXDCT+1
LCBDCT1  EQU   LCBXDCT
@NM00185 EQU   LCBXFLAG
LCBERPND EQU   LCBXFLAG
LCBSRCPF EQU   LCBXFLAG
LCBGPCTV EQU   LCBXFLAG
@NM00184 EQU   LCBXFLAG
@NM00183 EQU   LCBXFLAG
@NM00182 EQU   LCBXFLAG
@NM00181 EQU   LCBXFLAG
LCBCCW10 EQU   LCBCPA+72
LCBCCW9  EQU   LCBCPA+64
LCBCCW8  EQU   LCBCPA+56
LCBCCW7  EQU   LCBCPA+48
LCBCCW6  EQU   LCBCPA+40
LCBCP    EQU   LCBQEBPL+4
LCBIOSB  EQU   LCBQEBPL+1
LCBSIO   EQU   LCBQEBPL
LCBCCW4  EQU   LCBCPA+24
LCBCCW3  EQU   LCBCPA+16
LCBCCW2  EQU   LCBCPA+8
LCBCCW1  EQU   LCBCPA
@NM00166 EQU   LCBERCCW+16
LCBATL05 EQU   LCBERCCW+8
@NM00165 EQU   LCBERCCW
LCBCSWSV EQU   LCBSAVSN+1
LCBSNSV  EQU   LCBSAVSN
LCBBFSNS EQU   LCBRSPSV
LCBWAITC EQU   LCBTPCD+5
LCBINPAK EQU   LCBSTAT6
LCBMHBID EQU   LCBSTAT6
LCBRTRRO EQU   LCBSTAT6
LCBHDRPD EQU   LCBSTAT6
LCBCHN   EQU   LCBSTAT6
LCBBFRSV EQU   LCBTPCD+1
@NM00164 EQU   LCBSTAT5
LCBLUS   EQU   LCBSTAT5
LCBLUNIT EQU   LCBSTAT5
LCBPERM  EQU   LCBSTAT5
LCBNXCMD EQU   LCBBFRW
LCBERMSK EQU   LCBOBRCH
LCBSCBA  EQU   IEDQLCB+93
LCBOLT   EQU   LCBMSGFM
LCBEOT   EQU   LCBMSGFM
LCBENQ   EQU   LCBMSGFM
LCBTTD   EQU   LCBMSGFM
LCBRSTRT EQU   LCBMSGFM
LCBVSTRT EQU   LCBMSGFM
LCBACKI  EQU   LCBMSGFM
LCBNAK   EQU   LCBMSGFM
LCBTTCIN EQU   IEDQLCB+90
@NM00163 EQU   LCBRBCT2
LCBDCNT  EQU   LCBRBCT2
LCBRBCT1 EQU   LCBERBCT
LCBERBCH EQU   IEDQLCB+85
LCBCOMPL EQU   LCBDLNKN
LCBPRCPG EQU   LCBERBST
LCBERROR EQU   LCBERBST
@NM00162 EQU   LCBERBST
LCBINQ   EQU   LCBERBST
LCBRDERR EQU   LCBERBST
LCBEOMSG EQU   LCBERBST
LCBMSG   EQU   LCBERBST
LCBERBLK EQU   IEDQLCB+81
LCBERBPY EQU   IEDQLCB+80
LCBERBQB EQU   LCBERB+1
LCBERBKY EQU   LCBERB
@NM00161 EQU   LCBTSTSW
@NM00160 EQU   LCBTSTSW
@NM00159 EQU   LCBTSTSW
@NM00158 EQU   LCBTSTSW
@NM00157 EQU   LCBTSTSW
@NM00156 EQU   LCBTSTSW
@NM00155 EQU   LCBTSTSW
LCBCONCT EQU   LCBTSTSW
LCBRESP  EQU   LCBSTAT2
LCBBFRAV EQU   LCBDIAL
LCBATTN  EQU   LCBSYNC
LCBNEGRP EQU   LCBSTAT2
LCBSNDPR EQU   LCBSTAT2
LCBCONNN EQU   LCBBEOTN
LCBMSGNN EQU   LCBSTAT2
LCBTRACE EQU   LCBSTAT2
LCBSENDN EQU   LCBSTAT1
LCBRECVN EQU   LCBSTAT1
LCBFREEN EQU   LCBSTAT1
LCBCONT  EQU   LCBSTAT1
LCBINITN EQU   LCBSTAT1
LCBOCNI  EQU   LCBSTAT1
LCBOCWTN EQU   LCBSTAT1
LCBRCLLN EQU   LCBSTAT1
LCBRECOF EQU   IEDQLCB+68
LCBRDBFR EQU   LCBRCBFR
LCBUCBX  EQU   IEDQLCB+64
LCBTTBIN EQU   LCBERRCT
@NM00154 EQU   LCBINCAM
@NM00153 EQU   LCBRESTR+1
LCBCMDSV EQU   LCBRESTR
LCBPCILK EQU   LCBDCBPT
LCBSTART EQU   LCBIOBSN+16
LCBAP4OL EQU   LCBSIOCC
LCBAP3OL EQU   LCBSIOCC
LCBAP2OL EQU   LCBSIOCC
LCBAP1OL EQU   LCBSIOCC
LCBSIOC2 EQU   LCBSIOCC
LCBSIOC1 EQU   LCBSIOCC
@NM00152 EQU   LCBSIOCC
LCBCSWRC EQU   LCBCSW+5
LCBCSCHC EQU   LCBCSWCS
LCBCSICC EQU   LCBCSWCS
LCBCSCCC EQU   LCBCSWCS
LCBCSCDC EQU   LCBCSWCS
LCBCSPTC EQU   LCBCSWCS
LCBCSPGC EQU   LCBCSWCS
LCBCSIL  EQU   LCBCSWCS
LCBCSPCI EQU   LCBCSWCS
LCBUSUE  EQU   LCBCSWUS
LCBUSUC  EQU   LCBCSWUS
LCBUSDE  EQU   LCBCSWUS
LCBUSCE  EQU   LCBCSWUS
LCBUSBSY EQU   LCBCSWUS
LCBUSCUE EQU   LCBCSWUS
LCBUSSM  EQU   LCBCSWUS
LCBUSAT  EQU   LCBCSWUS
LCBCSWCA EQU   LCBCSW
LCBOBRRD EQU   LCBFLAG3
LCBIOMSG EQU   LCBFLAG3
LCBSOHC  EQU   LCBFLAG3
LCBRLAD  EQU   LCBFLAG3
LCBSOHR  EQU   LCBFLAG3
@NM00151 EQU   LCBFLAG3
LCBECBPT EQU   LCBIOBSN+4
LCBECBCC EQU   LCBIOBSN+3
LCBSENS1 EQU   LCBSNS+1
LCBABORT EQU   LCBTMOUT
LCBNOTIN EQU   LCBLOSDT
LCBOVRUN EQU   LCBSENS0
LCBDATCK EQU   LCBSENS0
LCBEQUCK EQU   LCBSENS0
LCBBUSCK EQU   LCBSENS0
LCBINTRQ EQU   LCBSENS0
LCBCMDRJ EQU   LCBSENS0
LCBFLAG2 EQU   LCBIOBSN
@NM00150 EQU   LCBFLAG1
LCBUNREL EQU   LCBFLAG1
LCBEXCPN EQU   LCBFLAG1
@NM00149 EQU   LCBFLAG1
LCBERPIN EQU   LCBFLAG1
@NM00148 EQU   LCBFLAG1
LCBFSBFR EQU   LCBMHA
LCBISZE  EQU   IEDQLCB+28
LCBLNENT EQU   LCBSCBDA+1
@NM00147 EQU   LCBSCBDA
LCBCPGMH EQU   LCBSTAT4
LCBREAL  EQU   LCBPHASE
@NM00146 EQU   LCBSTAT4
LCBACTRQ EQU   LCBSTAT4
LCBIPLRQ EQU   LCBSTAT4
LCBDACRQ EQU   LCBSTAT4
LCBDMPRQ EQU   LCBSTAT4
@NM00145 EQU   LCBLKMDE
LCBLOCKI EQU   LCBLKMDE
LCBLOCKR EQU   LCBLKMDE
LCBHMFLG EQU   LCBLKMDE
LCBBDFLG EQU   LCBLKMDE
@NM00144 EQU   LCBINSRC
LCBABRTN EQU   LCBCHAIN
LCBCTLMD EQU   LCBTETEN
LCBBFRSZ EQU   LCBCHAIN
LCBUREQN EQU   LCBCHAIN
LCBNORTY EQU   LCBCHAIN
LCBERMSG EQU   LCBCHAIN
LCBEXCP  EQU   LCBCHAIN
LCBINVRQ EQU   LCBSCRNN
LCB2741N EQU   LCBTSOB
LCBINHBN EQU   LCBTSOB
LCBCIRCD EQU   LCBTSOB
LCBPREP  EQU   LCBTSOB
LCBSOPL  EQU   LCBTSOB
LCBSATRD EQU   LCBTSOB
LCBTSBUF EQU   LCBTSOB
LCBWRBRK EQU   LCBTSOB
LCBTDL   EQU   IEDQLCB+18
LCBEOLTD EQU   IEDQLCB+16
LCBRSLNK EQU   IEDQLCB+13
LCBRSPRI EQU   IEDQLCB+12
LCBSTCBA EQU   IEDQLCB+9
LCBRSKEY EQU   IEDQLCB+8
LCBLINK  EQU   LCBRCB+5
LCBPRI   EQU   LCBRCB+4
LCBQCBA  EQU   LCBRCB+1
LCBKEY   EQU   LCBRCB
IOSEND   EQU   IOSB+108
IOSSKR   EQU   IOSEEKA+7
IOSSKH2  EQU   IOSSKHH+1
IOSSKH1  EQU   IOSSKHH
IOSSKCC  EQU   IOSCCHH
IOSSKBB  EQU   IOSEEKA+1
IOSSKM   EQU   IOSEEKA
IOSEEK   EQU   IOSB+92
IOSMDM   EQU   IOSB+91
IOSMDB   EQU   IOSB+90
IOSCKEY7 EQU   IOSCKEY
IOSCKEY6 EQU   IOSCKEY
IOSCKEY5 EQU   IOSCKEY
IOSCKEY4 EQU   IOSCKEY
@NM00140 EQU   IOSCKEY
IOSFMSK  EQU   IOSB+88
IOSCUDEV EQU   IOSPATH+1
@NM00139 EQU   IOSCHN
IOSPATH3 EQU   IOSCHN
IOSPATH2 EQU   IOSCHN
IOSEXP   EQU   IOSCHN
IOSGDP   EQU   IOSCHN
IOSAFF   EQU   IOSB+85
IOSRSS1B EQU   IOSB+84
IOSDSID  EQU   IOSB+80
IOSVST   EQU   IOSB+76
IOSRST   EQU   IOSB+72
IOSDIE   EQU   IOSB+68
IOSABN   EQU   IOSB+64
IOSNRM   EQU   IOSB+60
IOSPCI   EQU   IOSB+56
IOSPCHN  EQU   IOSB+48
IOSSNS   EQU   IOSB+42
IOSAPMSK EQU   IOSB+40
IOSRES4A EQU   IOSB+36
IOSSRB   EQU   IOSB+28
IOSCSWRC EQU   IOSCSW+5
IOSTSB   EQU   IOSTATUS+1
IOSTSA   EQU   IOSTATUS
IOSCSWCA EQU   IOSCSW
IOSCC    EQU   @NM00138
IOSOPT2X EQU   IOSOPT2
IOSHTP   EQU   IOSOPT2
IOSRELSE EQU   IOSOPT
IOSAPR   EQU   IOSOPT
IOSTSLL  EQU   IOSOPT
IOSNERP  EQU   IOSOPT
IOSPSLL  EQU   IOSOPT
IOSQISCE EQU   IOSOPT
IOSDEP   EQU   IOSOPT
IOSBYP   EQU   IOSOPT
IOSCOD   EQU   IOSB+13
IOSPKY7  EQU   IOSPKEY
IOSPGDPX EQU   IOSPKEY
IOSIDR   EQU   IOSPKEY
IOSLCL   EQU   IOSPKEY
@NM00137 EQU   IOSPKEY
IOSPGAD  EQU   IOSB+8
IOSASID  EQU   IOSB+6
IOSPRLVL EQU   IOSB+5
IOSDVRID EQU   IOSB+4
IOSPROC  EQU   IOSB+3
IOSFLC7  EQU   IOSFLC
IOSFLC6  EQU   IOSFLC
IOSRWAIT EQU   IOSFLC
IOSTP    EQU   IOSFLC
IOSCC3WE EQU   IOSFLC
IOSVERIF EQU   IOSDVALT
IOSDVMNT EQU   IOSFLC
IOSLOG   EQU   IOSFLB
IOSBDCST EQU   IOSFLB
IOSMSG   EQU   IOSFLB
IOSFLB4  EQU   IOSFLB
IOSFLB3  EQU   IOSFLB
IOSFLB2  EQU   IOSFLB
IOSSDR   EQU   IOSFLB
IOSDIESE EQU   IOSFLB
IOSIOSB  EQU   IOSFLA
IOSDOM   EQU   IOSFLA
IOSEX    EQU   IOSFLA
IOSSMDB  EQU   IOSFLA
IOSSMDA  EQU   IOSFLA
IOSERR   EQU   IOSFLA
IOSCCHN  EQU   IOSACHN
IOSDCHN  EQU   IOSACHN
EWADDISP EQU   EWA+29
EWADCNT  EQU   EWA+28
EWACPU   EQU   EWA+27
@NM00136 EQU   EWA+26
EWACHA   EQU   EWA+24
EWACSEQ  EQU   EWAXCSW2
EWACDIN  EQU   EWAXCSW2
@NM00135 EQU   EWAXCSW2
EWACTEC  EQU   EWAXCSW2
EWACDAV  EQU   EWAXCSW1
EWACCHV  EQU   EWAXCSW1
EWACCMD  EQU   EWAXCSW1
EWACUNS  EQU   EWAXCSW1
EWACSQV  EQU   EWAXCSW1
@NM00134 EQU   EWAXCSW1
EWACITF  EQU   EWAXCSW1
@NM00133 EQU   EWARGFG2
EWACCUE  EQU   EWARGFG2
EWACSTG  EQU   EWARGFG2
EWACSCU  EQU   EWARGFG2
EWACCHA  EQU   EWARGFG2
EWACCPU  EQU   EWARGFG2
EWANORTY EQU   EWARGFG1
EWACCNT  EQU   EWARGFG1
EWACSNS  EQU   EWARGFG1
@NM00132 EQU   EWARGFG1
EWACHIO  EQU   EWARGFG1
EWACTIO  EQU   EWARGFG1
EWACINT  EQU   EWARGFG1
EWACSIO  EQU   EWARGFG1
EWAUCB   EQU   EWAERPIB+1
@NM00131 EQU   EWAERPIB
EWASTUP  EQU   EWA+14
EWACNTR4 EQU   EWACNTRS+3
EWACNTR3 EQU   EWACNTRS+2
EWACNTR2 EQU   EWACNTRS+1
EWACNTR1 EQU   EWACNTRS
EWASSTAT EQU   EWA+8
EWASCTMX EQU   EWASNSCT
@NM00130 EQU   EWASNSCT
EWAJAM   EQU   EWAFLG3
@NM00129 EQU   EWAFLG2
EWADIR   EQU   EWAFLG2
EWACOVF  EQU   EWAFLG2
EWAWTEMP EQU   EWAFLG2
EWABDSNS EQU   EWAFLG1
EWADDMSG EQU   EWAFLG1
EWASCC1  EQU   EWASCC3
EWASCC2  EQU   EWASCC3
@NM00128 EQU   EWAFLG1
EWASLIS  EQU   EWAFLG1
EWAEXT   EQU   EWAHDR
CVTLEVL  EQU   CVTRELNO+2
CVTNUMB  EQU   CVTRELNO
CVTMDL   EQU   CVTFIX+250
@NM00127 EQU   CVTFIX+248
@NM00126 EQU   CVTFIX
CVTRV482 EQU   CVTXTNT2+128
CVTRV481 EQU   CVTXTNT2+124
CVTRV480 EQU   CVTXTNT2+120
CVTRV479 EQU   CVTXTNT2+118
CVTRV478 EQU   CVTXTNT2+117
CVTRV477 EQU   CVTXTNT2+116
CVTRV476 EQU   CVTXTNT2+115
CVTRV475 EQU   CVTXTNT2+114
CVTRV474 EQU   CVTRV466
CVTRV473 EQU   CVTRV466
CVTRV472 EQU   CVTRV466
CVTRV471 EQU   CVTRV466
CVTRV470 EQU   CVTRV466
CVTRV469 EQU   CVTRV466
CVTRV468 EQU   CVTRV466
CVTRV467 EQU   CVTRV466
CVTRV465 EQU   CVTRV457
CVTRV464 EQU   CVTRV457
CVTRV463 EQU   CVTRV457
CVTRV462 EQU   CVTRV457
CVTRV461 EQU   CVTRV457
CVTRV460 EQU   CVTRV457
CVTRV459 EQU   CVTRV457
CVTRV458 EQU   CVTRV457
CVTRV456 EQU   CVTXTNT2+108
CVTRV455 EQU   CVTXTNT2+104
CVTRV454 EQU   CVTXTNT2+100
CVTRV453 EQU   CVTXTNT2+96
CVTRV452 EQU   CVTXTNT2+94
CVTRV451 EQU   CVTXTNT2+92
CVTRV450 EQU   CVTXTNT2+90
CVTRV449 EQU   CVTXTNT2+88
CVTRV448 EQU   CVTXTNT2+87
CVTRV447 EQU   CVTXTNT2+86
CVTRV446 EQU   CVTRV438
CVTRV445 EQU   CVTRV438
CVTRV444 EQU   CVTRV438
CVTRV443 EQU   CVTRV438
CVTRV442 EQU   CVTRV438
CVTRV441 EQU   CVTRV438
CVTRV440 EQU   CVTRV438
CVTRV439 EQU   CVTRV438
CVTRV437 EQU   CVTRV429
CVTRV436 EQU   CVTRV429
CVTRV435 EQU   CVTRV429
CVTRV434 EQU   CVTRV429
CVTRV433 EQU   CVTRV429
CVTRV432 EQU   CVTRV429
CVTRV431 EQU   CVTRV429
CVTRV430 EQU   CVTRV429
CVTRV428 EQU   CVTXTNT2+80
CVTRV427 EQU   CVTXTNT2+76
CVTRV426 EQU   CVTXTNT2+72
CVTRV425 EQU   CVTXTNT2+68
CVTATACT EQU   CVTATCVT
CVTRV423 EQU   CVTXTNT2+62
CVTRV422 EQU   CVTXTNT2+60
CVTRV421 EQU   CVTXTNT2+58
CVTRV420 EQU   CVTXTNT2+56
CVTRV419 EQU   CVTXTNT2+55
CVTRV418 EQU   CVTXTNT2+54
CVTRV417 EQU   CVTRV409
CVTRV416 EQU   CVTRV409
CVTRV415 EQU   CVTRV409
CVTRV414 EQU   CVTRV409
CVTRV413 EQU   CVTRV409
CVTRV412 EQU   CVTRV409
CVTRV411 EQU   CVTRV409
CVTRV410 EQU   CVTRV409
CVTRV408 EQU   CVTRV400
CVTRV407 EQU   CVTRV400
CVTRV406 EQU   CVTRV400
CVTRV405 EQU   CVTRV400
CVTRV404 EQU   CVTRV400
CVTRV403 EQU   CVTRV400
CVTRV402 EQU   CVTRV400
CVTRV401 EQU   CVTRV400
CVTICB   EQU   CVTXTNT2+48
CVTSKTA  EQU   CVTXTNT2+44
CVTSHSB  EQU   CVTSHS
CVTRSV98 EQU   CVTXTNT2+36
CVTRSV97 EQU   CVTXTNT2+34
CVTRSV96 EQU   CVTXTNT2+32
CVTOLTEP EQU   CVTXTNT2+28
CVTQIDA  EQU   CVTQID+1
CVTRSV95 EQU   CVTQID
CVTRSV94 EQU   CVTXTNT2+20
CVTRSV93 EQU   CVTXTNT2+16
CVTRSV92 EQU   CVTXTNT2+12
CVTDEBVR EQU   CVTXTNT2+8
CVTRSV91 EQU   CVTXTNT2+6
CVTRSV9H EQU   CVTFLGBT
CVTRSV9G EQU   CVTFLGBT
CVTRSV9F EQU   CVTFLGBT
CVTRSV9E EQU   CVTFLGBT
CVTRSV9D EQU   CVTFLGBT
CVTRSV9C EQU   CVTFLGBT
CVTVME   EQU   CVTFLGBT
CVTNPE   EQU   CVTFLGBT
CVTNUCLS EQU   CVTXTNT2+4
CVTDSSVA EQU   CVTDSSV+1
CVTRSV89 EQU   CVTDSSV
CVTRSV88 EQU   CVTXTNT1+8
CVTRSV87 EQU   CVTXTNT1+4
CVTFACHN EQU   CVTXTNT1
CVTRV488 EQU   CVTMAP+412
CVTRV487 EQU   CVTMAP+408
CVTRV486 EQU   CVTMAP+404
CVTRV485 EQU   CVTMAP+400
CVTACTAP EQU   CVTMAP+396
CVTAUTH  EQU   CVTMAP+392
CVTATMCA EQU   CVTATMCT+1
CVTATMST EQU   CVTATMCT
CVTRSV61 EQU   CVTMAP+384
CVTVOLT1 EQU   CVTVOLM1+1
CVTVOLI1 EQU   CVTVOLF1
CVTSTOA  EQU   CVTMAP+376
CVTRSV58 EQU   CVTMAP+374
CVTRSV57 EQU   CVTMAP+372
CVTDDCE  EQU   CVTMAP+368
CVTPNWFR EQU   CVTMAP+364
CVTSMF   EQU   CVTMAP+360
CVTSULK  EQU   CVTMAP+358
CVTSLKO  EQU   CVTSYSK
CVTSLKP  EQU   CVTSYSK
CVTSLKQ  EQU   CVTSYSK
CVTSLKR  EQU   CVTSYSK
CVTRSV56 EQU   CVTSYSK
CVTRSV55 EQU   CVTSYSK
CVTRSV54 EQU   CVTSYSK
CVTRSV53 EQU   CVTSYSK
CVTRSV52 EQU   CVTA1F1
CVTRSV51 EQU   CVTA1F1
CVTRSV50 EQU   CVTA1F1
CVTRSV49 EQU   CVTA1F1
CVTRSV48 EQU   CVTA1F1
CVTRSV47 EQU   CVTA1F1
CVTSRSW  EQU   CVTA1F1
CVTPFSW  EQU   CVTA1F1
CVTPCVT  EQU   CVTMAP+352
CVTRSV46 EQU   CVTMAP+344
CVTRSV45 EQU   CVTMAP+340
CVTRSV44 EQU   CVTMAP+338
CVTRSV43 EQU   CVTMAP+336
CVTHJESA EQU   CVTHJES+1
CVTRSV42 EQU   CVTHJES
CVTEXT2A EQU   CVTEXT2+1
CVTRSV41 EQU   CVTEXT2
CVTAPFA  EQU   CVTAPF+1
CVTRSV40 EQU   CVTAPF
CVTRV518 EQU   CVTINTLA
CVTRV517 EQU   CVTERPV
CVTEORM  EQU   CVTMAP+312
CVTMCHPR EQU   CVTMAP+308
CVTTZ    EQU   CVTMAP+304
CVTJEPS  EQU   CVTMAP+300
CVTJESCT EQU   CVTMAP+296
CVTMODE  EQU   CVTMAP+292
CVTPTRV  EQU   CVTMAP+288
CVTREAL  EQU   CVTMAP+284
CVTRSV39 EQU   CVTMAP+280
CVTRSV38 EQU   CVTMAP+276
CVTDMSRA EQU   CVTDMSR+1
CVTRV634 EQU   CVTDMSRF
CVTRV633 EQU   CVTDMSRF
CVTRV632 EQU   CVTDMSRF
CVTRV631 EQU   CVTDMSRF
CVTRV630 EQU   CVTDMSRF
CVTRV629 EQU   CVTDMSRF
CVTUDUMP EQU   CVTDMSRF
CVTSDUMP EQU   CVTDMSRF
CVTQMSGA EQU   CVTQMSG+1
CVTRSV36 EQU   CVTQMSG
CVTAMFF  EQU   CVTMAP+264
CVTPURGA EQU   CVTPURG+1
CVTRSV35 EQU   CVTPURG
CVTCBSP  EQU   CVTMAP+256
CVTATERA EQU   CVTATER+1
CVTSYST  EQU   CVTATER
CVTVOLT2 EQU   CVTTAT
CVTVOLI2 EQU   CVTVOLF2
CVTAQAVB EQU   CVTAQAVT+1
CVTRSV34 EQU   CVTTCMFG
CVTRSV33 EQU   CVTTCMFG
CVTRSV32 EQU   CVTTCMFG
CVTRSV31 EQU   CVTTCMFG
CVTRSV30 EQU   CVTTCMFG
CVTRSV29 EQU   CVTTCMFG
CVTRSV28 EQU   CVTTCMFG
CVTTCRDY EQU   CVTTCMFG
CVTGTFA  EQU   CVTGTF+1
CVTRSV27 EQU   CVTGTFST
CVTRNIO  EQU   CVTGTFST
CVTUSR   EQU   CVTGTFST
CVTRV318 EQU   CVTFORM
CVTRV317 EQU   CVTTMODE
CVTRV316 EQU   CVTSTATE
CVTRV315 EQU   CVTGTFS
CVTGTFAV EQU   CVTGTFS
CVT0SCR1 EQU   CVTMAP+232
CVTRV515 EQU   CVTMAP+228
CVTRMS   EQU   CVTMAP+224
CVTPATCH EQU   CVTMAP+220
CVTTSCE  EQU   CVTMAP+216
CVTLNKSC EQU   CVTMAP+214
CVTQABST EQU   CVTMAP+212
CVTMDLDS EQU   CVTMAP+208
CVTUSER  EQU   CVTMAP+204
CVTABEND EQU   CVTMAP+200
CVTSMCA  EQU   CVTMAP+196
CVTRSV18 EQU   CVTMAP+192
CVTQLPAQ EQU   CVTMAP+188
CVTQCDSR EQU   CVTMAP+184
CVTRSV17 EQU   CVTOPTB
CVTRSV16 EQU   CVTOPTB
CVTFP    EQU   CVTOPTB
CVTAPTHR EQU   CVTOPTB
CVTNLOG  EQU   CVTOPTB
CVTTOD   EQU   CVTOPTB
CVTCTIMS EQU   CVTOPTB
CVTPROT  EQU   CVTOPTB
CVTXPFP  EQU   CVTOPTA
CVTASCII EQU   CVTOPTA
CVTRSV13 EQU   CVTOPTA
CVTRSV12 EQU   CVTOPTA
CVTNIP   EQU   CVTOPTA
CVTDDR   EQU   CVTOPTA
CVTAPR   EQU   CVTOPTA
CVTCCH   EQU   CVTOPTA
CVTSNCTR EQU   CVTMAP+180
CVTQMWR  EQU   CVTMAP+176
CVTQOCR  EQU   CVTMAP+172
CVT1EF00 EQU   CVTMAP+168
CVTMZ00  EQU   CVTMAP+164
CVTHEAD  EQU   CVTMAP+160
CVTRSV11 EQU   CVTMAP+156
CVT0PT01 EQU   CVTMAP+152
CVTMSER  EQU   CVTMAP+148
CVTRV516 EQU   CVTIERLC
CVTILCH  EQU   CVTMAP+140
CVT0DS   EQU   CVTMAP+136
CVTFBOSV EQU   CVTMAP+132
CVTNUCB  EQU   CVTMAP+128
CVTIXAVL EQU   CVTMAP+124
CVTIOQET EQU   CVTMAP+120
CVTDCBA  EQU   CVTMAP+117
CVTMVS2  EQU   CVTDCB
CVT6DAT  EQU   CVTDCB
CVT4MPS  EQU   CVTDCB
CVTRSV09 EQU   CVTDCB
CVT4MS1  EQU   CVTDCB
CVT2SPS  EQU   CVTDCB
CVT1SSS  EQU   CVTDCB
CVTRSV08 EQU   CVTDCB
CVTSTB   EQU   CVTMAP+112
CVTQTD00 EQU   CVTMAP+108
CVTQTE00 EQU   CVTMAP+104
CVTCUCB  EQU   CVTMAP+100
CVTSJQ   EQU   CVTMAP+96
CVTPBLDL EQU   CVTMAP+92
CVTTPC   EQU   CVTMAP+88
CVTSVDCB EQU   CVTMAP+84
CVTBRET  EQU   CVTMAP+82
CVTEXIT  EQU   CVTMAP+80
CVT0FN00 EQU   CVTMAP+76
CVTDARA  EQU   CVTDAR+1
CVTRSV07 EQU   CVTFLGS1
CVTRSV06 EQU   CVTFLGS1
CVTRSV05 EQU   CVTFLGS1
CVTRSV04 EQU   CVTFLGS1
CVTRSV03 EQU   CVTFLGS1
CVTRSV02 EQU   CVTFLGS1
CVTRSV01 EQU   CVTFLGS1
CVTDMPLK EQU   CVTFLGS1
CVTXITP  EQU   CVTMAP+68
CVTZDTAB EQU   CVTMAP+64
CVTMSLT  EQU   CVTMAP+60
CVTDATE  EQU   CVTMAP+56
CVTBTERM EQU   CVTMAP+52
CVTSYSAD EQU   CVTMAP+48
CVTILK2  EQU   CVTMAP+40
CVTILK1  EQU   CVTMAP+36
CVTPRLTV EQU   CVTMAP+32
CVTPCNVT EQU   CVTMAP+28
CVT0VL00 EQU   CVTMAP+24
CVTXAPG  EQU   CVTMAP+20
CVTBUF   EQU   CVTMAP+16
CVTJOB   EQU   CVTMAP+12
CVTLINK  EQU   CVTMAP+8
CVT0EF00 EQU   CVTMAP+4
CVTTCBP  EQU   CVTMAP
CVT      EQU   CVTMAP
BDUXGRPH EQU   BDUEXRSP
BDUXFINL EQU   BDUEXRSP
BDUXINIT EQU   BDUEXRSP
BDURESP  EQU   BDUSYRSP
BDUPHASE EQU   BDUSYRSP
BDUERROR EQU   BDUSYRSP
BDUXERLK EQU   BDUBDUFG
BDUALTAK EQU   BDUFNFLG
BDUNEGAK EQU   BDUFNFLG
BDUPOSAK EQU   BDUFNFLG
BDUTPTX  EQU   BDUFNFLG
BDUFRSTB EQU   BDUFNFLG
BDULEADG EQU   BDUFNFLG
BDUHEADR EQU   BDUFNFLG
BDUSTHDR EQU   BDUFNFLG
BDUMODIF EQU   IEDBDU+1
BDUCMND  EQU   IEDBDU
SAVTLLCB EQU   IEDNSVTD+316
SAVTBITN EQU   IEDNSVTD+312
@NM00125 EQU   SAVTCKQB+8
@NM00124 EQU   SAVTCKEC+1
@NM00123 EQU   SAVTCKCC
SAVTCKPO EQU   SAVTCKCC
SAVTCKWA EQU   SAVTCKCC
SAVTCKCH EQU   SAVTCKTB+1
SAVTCKVT EQU   SAVTCKTB
@NM00122 EQU   IEDNSVTD+297
SAVTRDFG EQU   SAVTRDRV+12
@NM00121 EQU   SAVTRDRV+5
SAVTRDPY EQU   SAVTRDRV+4
SAVTRDQB EQU   SAVTRDRV+1
SAVTRDKY EQU   SAVTRDRV
SAVTNID  EQU   IEDNSVTD+280
SAVTDVAS EQU   IEDNSVTD+276
SAVTPLSZ EQU   IEDNSVTD+274
@NM00120 EQU   IEDNSVTD+273
SAVTSUBL EQU   IEDNSVTD+272
@NM00119 EQU   SAVTZELM+1
SAVTSUBM EQU   SAVTZELM
SAVTMHDX EQU   IEDNSVTD+268
SAVTNAT1 EQU   IEDNSVTD+266
SAVTSH20 EQU   IEDNSVTD+264
SAVTLCBS EQU   IEDNSVTD+260
SAVTRNMP EQU   IEDNSVTD+256
SAVTTNTX EQU   IEDNSVTD+252
SAVTSUBV EQU   IEDNSVTD+247
SAVTSUBA EQU   IEDNSVTD+246
SAVTSIBC EQU   IEDNSVTD+244
SAVTBSM  EQU   IEDNSVTD+240
SAVTSCPT EQU   SAVTTCPU
SAVTRQTG EQU   IEDNSVTD+236
SAVTRQCH EQU   IEDNSVTD+232
SAVTMAND EQU   IEDNSVTD+228
SAVTSPLN EQU   IEDNSVTD+224
SAVTNADL EQU   IEDNSVTD+222
SAVTNATL EQU   IEDNSVTD+220
SAVTMHTB EQU   IEDNSVTD+216
SAVTSSMH EQU   IEDNSVTD+212
SAVTQRS  EQU   IEDNSVTD+208
SAVTRQIN EQU   IEDNSVTD+204
SAVTDFCO EQU   IEDNSVTD+200
SAVTSAO  EQU   IEDNSVTD+196
SAVTSARI EQU   IEDNSVTD+192
SAVTSAC  EQU   IEDNSVTD+188
SAVTSAI  EQU   IEDNSVTD+184
SAVTCSCI EQU   IEDNSVTD+180
SAVTSSRP EQU   IEDNSVTD+176
SAVTSSRQ EQU   IEDNSVTD+172
SAVTSCLU EQU   IEDNSVTD+168
SAVTXTRQ EQU   IEDNSVTD+164
SAVTMVBF EQU   IEDNSVTD+160
@NM00118 EQU   IEDNSVTD+148
SAVTIPCQ EQU   IEDNSVTD+144
@NM00117 EQU   IEDNSVTD+136
SAVTXFMI EQU   IEDNSVTD+132
@NM00116 EQU   IEDNSVTD+124
SAVTXFMO EQU   IEDNSVTD+120
@NM00115 EQU   IEDNSVTD+116
SAVTSSSR EQU   IEDNSVTD+112
SAVTSCPQ EQU   IEDNSVTD+108
SAVTSLCB EQU   IEDNSVTD+104
SAVTLUSR EQU   IEDNSVTD+100
@NM00114 EQU   SAVTLUSQ+8
SAVTLUSP EQU   SAVTLUSQ+4
SAVTLUSB EQU   SAVTLUSQ
@NM00113 EQU   IEDNSVTD+84
SAVTSAT  EQU   IEDNSVTD+80
SAVTNAT  EQU   IEDNSVTD+76
SAVTCLUP EQU   IEDNSVTD+72
SAVTPIUT EQU   IEDNSVTD+68
SAVTRNTA EQU   IEDNSVTD+64
SAVTDNIR EQU   IEDNSVTD+60
SAVTCNIR EQU   IEDNSVTD+56
SAVTFLDH EQU   IEDNSVTD+52
SAVTSRTN EQU   IEDNSVTD+48
SAVTSREQ EQU   IEDNSVTD+44
SAVTFAIL EQU   IEDNSVTD+42
SAVTSUSE EQU   IEDNSVTD+40
SAVTSIB  EQU   IEDNSVTD+36
SAVTPRTN EQU   IEDNSVTD+32
@NM00112 EQU   IEDNSVTD+28
SAVTWH20 EQU   IEDNSVTD+26
SAVTPWT  EQU   IEDNSVTD+24
SAVTPRTQ EQU   IEDNSVTD+20
SAVTPREQ EQU   IEDNSVTD+16
SAVTPH20 EQU   IEDNSVTD+14
SAVTPUSE EQU   IEDNSVTD+12
SAVTPLCB EQU   IEDNSVTD+8
SAVTPOOL EQU   IEDNSVTD+4
SAVTPRMT EQU   SAVTDIAF
SAVTVIRT EQU   SAVTDIAF
AVTCPBNO EQU   IEDQAVTD+1244
AVTHRESS EQU   IEDQAVTD+1243
@NM00111 EQU   IEDQAVTD+1242
@NM00110 EQU   IEDQAVTD+1241
@NM00109 EQU   IEDQAVTD+1240
@NM00108 EQU   IEDQAVTD+1237
@NM00107 EQU   IEDQAVTD+1236
AVTHRESE EQU   @NM00106
AVTRADDR EQU   IEDQAVTD+1228
AVTNADDR EQU   IEDQAVTD+1224
AVTHRESN EQU   IEDQAVTD+1220
AVTVOLRN EQU   IEDQAVTD+1216
AVTTOTNN EQU   IEDQAVTD+1212
AVTTRCYN EQU   IEDQAVTD+1208
AVTRCTRN EQU   IEDQAVTD+1204
AVTNOVON EQU   IEDQAVTD+1200
AVTADEBN EQU   IEDQAVTD+1196
AVTVOLRR EQU   IEDQAVTD+1192
AVTTOTNR EQU   IEDQAVTD+1188
AVTTRCYR EQU   IEDQAVTD+1184
AVTRCTRR EQU   IEDQAVTD+1180
AVTNOVOR EQU   IEDQAVTD+1176
AVTADEBR EQU   IEDQAVTD+1172
AVTLODPT EQU   IEDQAVTD+1168
AVTIOBN  EQU   IEDQAVTD+1164
AVTIOBR  EQU   IEDQAVTD+1160
AVTCPBPT EQU   IEDQAVTD+1156
AVTFCPB  EQU   IEDQAVTD+1152
@NM00105 EQU   IEDQAVTD+1148
AVTINCPQ EQU   IEDQAVTD+1144
@NM00104 EQU   IEDQAVTD+1140
@NM00103 EQU   IEDQAVTD+1137
@NM00102 EQU   AVTBIT4
@NM00101 EQU   AVTBIT4
@NM00100 EQU   AVTBIT4
@NM00099 EQU   AVTBIT4
@NM00098 EQU   AVTBIT4
@NM00097 EQU   AVTBIT4
@NM00096 EQU   AVTBIT4
AVTRUFTN EQU   AVTBIT4
@NM00095 EQU   IEDQAVTD+1132
AVTNOBFQ EQU   IEDQAVTD+1128
@NM00094 EQU   IEDQAVTD+1124
AVTDKENQ EQU   IEDQAVTD+1120
@NM00093 EQU   IEDQAVTD+1116
AVTDKAPQ EQU   IEDQAVTD+1112
AVTCOPY  EQU   IEDQAVTD+1108
AVTIA    EQU   IEDQAVTD+1104
AVTFL    EQU   IEDQAVTD+1100
@NM00092 EQU   IEDQAVTD+1096
AVTNCPBQ EQU   IEDQAVTD+1092
AVTTOTNC EQU   IEDQAVTD+1088
AVTCMAX  EQU   IEDQAVTD+1084
AVTCMIN  EQU   IEDQAVTD+1080
AVTHM02  EQU   IEDQAVTD+1076
AVTOPCIN EQU   IEDQAVTD+1074
AVTDCTLN EQU   IEDQAVTD+1072
AVTOPMSK EQU   IEDQAVTD+1068
AVTDDFT  EQU   IEDQAVTD+1064
AVTSTEAL EQU   IEDQAVTD+1060
AVTOPTN  EQU   IEDQAVTD+1056
AVTDSKCT EQU   IEDQAVTD+1054
AVTCKRST EQU   IEDQAVTD+1053
AVTSTAN  EQU   AVTBIT3
AVTSTACN EQU   AVTBIT3
AVTSTAIN EQU   AVTBIT3
AVTSTAYN EQU   AVTBIT3
AVTOLTBN EQU   AVTBIT3
AVTTSAB  EQU   AVTBIT3
AVTRFULN EQU   AVTBIT3
AVTRECVN EQU   AVTBIT3
@NM00091 EQU   AVTBIT2
@NM00090 EQU   AVTBIT2
AVTOPEIN EQU   AVTBIT2
AVTSTRTN EQU   AVTBIT2
AVTTOPOL EQU   AVTBIT2
AVTCOPYN EQU   AVTBIT2
AVTREUSN EQU   AVTBIT2
AVTEXTSC EQU   AVTBIT2
AVTDISKN EQU   AVTBIT1
AVTQUCKN EQU   AVTBIT1
AVTCLOSN EQU   AVTBIT1
AVTREADN EQU   AVTBIT1
AVTDLAYN EQU   AVTBIT1
AVTAQTAN EQU   AVTBIT1
AVTTSON  EQU   AVTBIT1
AVTAPLKN EQU   AVTBIT1
AVTDUMBR EQU   IEDQAVTD+1048
AVTDLQX  EQU   IEDQAVTD+1046
AVTINTLV EQU   IEDQAVTD+1044
AVTSMCNT EQU   IEDQAVTD+1042
AVTAVFCT EQU   IEDQAVTD+1040
AVTOPCON EQU   IEDQAVTD+1038
AVTOPCNT EQU   IEDQAVTD+1036
AVTLNCNT EQU   IEDQAVTD+1034
AVTHA16  EQU   IEDQAVTD+1030
AVTHA7   EQU   IEDQAVTD+1028
AVTHA4   EQU   IEDQAVTD+1026
AVTHA3   EQU   IEDQAVTD+1024
AVTHA2   EQU   IEDQAVTD+1022
AVTGETMS EQU   IEDQAVTD+1021
@NM00089 EQU   IEDQAVTD+1020
AVTGETMD EQU   IEDQAVTD+1016
AVTGETMN EQU   IEDQAVTD+1012
AVTCWTOT EQU   IEDQAVTD+1008
AVTCWINT EQU   IEDQAVTD+956
AVTDTRAP EQU   IEDQAVTD+952
@NM00088 EQU   IEDQAVTD+950
@NM00087 EQU   AVTIOTR
AVTIOTRH EQU   AVTIOTR
AVTIOTRE EQU   AVTIOTR
@NM00086 EQU   AVTSUBT
AVTSUBPT EQU   AVTSUBT
AVTSUBON EQU   AVTSUBT
AVTAFE30 EQU   IEDQAVTD+944
AVTAFE20 EQU   IEDQAVTD+940
AVTAFE10 EQU   IEDQAVTD+936
AVTCWEC2 EQU   IEDQAVTD+932
AVTCWPM2 EQU   IEDQAVTD+928
AVTCWTS2 EQU   IEDQAVTD+927
AVTCWTS1 EQU   IEDQAVTD+926
AVTCWCLD EQU   AVTCWFL2
AVTCWRAP EQU   AVTCWFL2
@NM00085 EQU   AVTCWFL2
@NM00084 EQU   AVTCWFL2
@NM00083 EQU   AVTCWFL2
@NM00082 EQU   AVTCWFL2
@NM00081 EQU   AVTCWFL2
AVTCWACT EQU   AVTCWFL2
@NM00080 EQU   AVTCWFL1
@NM00079 EQU   AVTCWFL1
@NM00078 EQU   AVTCWFL1
@NM00077 EQU   AVTCWFL1
@NM00076 EQU   AVTCWFL1
@NM00075 EQU   AVTCWFL1
@NM00074 EQU   AVTCWFL1
AVTCOMWN EQU   AVTCWFL1
AVTCWEC1 EQU   IEDQAVTD+920
AVTCWPM1 EQU   IEDQAVTD+916
AVTCAREA EQU   IEDQAVTD+912
AVTFZERO EQU   IEDQAVTD+908
AVTCADDR EQU   IEDQAVTD+904
AVTCOREC EQU   IEDQAVTD+900
@NM00073 EQU   IEDQAVTD+892
AVTCPBCB EQU   IEDQAVTD+888
@NM00072 EQU   IEDQAVTD+880
AVTDSIOB EQU   IEDQAVTD+876
@NM00071 EQU   IEDQAVTD+868
AVTCPRMB EQU   IEDQAVTD+864
@NM00070 EQU   IEDQAVTD+856
AVTCLOSB EQU   IEDQAVTD+852
@NM00069 EQU   IEDQAVTD+844
AVTACTIB EQU   IEDQAVTD+840
@NM00068 EQU   IEDQAVTD+836
AVTOLTEB EQU   IEDQAVTD+832
AVTOLTCH EQU   AVTOLTQB+1
AVTOLTVT EQU   AVTOLTQB
@NM00067 EQU   AVTOPCQB+8
@NM00066 EQU   AVTOPCEC+1
@NM00065 EQU   AVTOPCCC
AVTOPCPO EQU   AVTOPCCC
AVTOPCWA EQU   AVTOPCCC
AVTOPCCH EQU   AVTOPCOB+1
AVTOPCVT EQU   AVTOPCOB
@NM00064 EQU   AVTCKPQB+9
AVTCKPTS EQU   AVTCKPQB+8
@NM00063 EQU   AVTCKPEC+1
@NM00062 EQU   AVTCKPCC
AVTCKPPO EQU   AVTCKPCC
AVTCKPWA EQU   AVTCKPCC
AVTCKPCH EQU   AVTCKPTB+1
AVTCKPVT EQU   AVTCKPTB
@NM00061 EQU   IEDQAVTD+796
@NM00060 EQU   IEDQAVTD+788
AVTSELCH EQU   IEDQAVTD+785
AVTBFRTN EQU   AVTBFRFG
AVTBFREB EQU   IEDQAVTD+780
AVTTIMQ  EQU   IEDQAVTD+776
@NM00059 EQU   IEDQAVTD+772
AVTIMQPS EQU   IEDQAVTD+768
AVTINOUT EQU   IEDQAVTD+766
AVTREFTM EQU   IEDQAVTD+764
@NM00058 EQU   IEDQAVTD+752
AVTDELYB EQU   IEDQAVTD+748
AVTOCQPT EQU   IEDQAVTD+744
AVTTSOPT EQU   IEDQAVTD+740
AVTSUPPT EQU   IEDQAVTD+736
AVTCBQCB EQU   IEDQAVTD+732
AVTMSGS  EQU   IEDQAVTD+729
@NM00057 EQU   AVTSYSER
@NM00056 EQU   AVTSYSER
@NM00055 EQU   AVTSYSER
@NM00054 EQU   AVTSYSER
@NM00053 EQU   AVTSYSER
@NM00052 EQU   AVTSYSER
AVTCMAXN EQU   AVTSYSER
AVTCMINN EQU   AVTSYSER
AVT2260L EQU   IEDQAVTD+724
AVTABEPL EQU   AVTADBUF
AVTHFF   EQU   AVTCLRHI+2
@NM00051 EQU   AVTCLRHI
AVTCCLNK EQU   AVTCRELE+5
AVTCCPRI EQU   AVTCRELE+4
AVTCCQCB EQU   AVTCCELE+1
AVTCCKEY EQU   AVTCCELE
AVTDELAD EQU   IEDQAVTD+704
AVTDELEM EQU   IEDQAVTD+700
AVTBSX   EQU   AVTCKLNK
AVTOPETR EQU   AVTHG01
@NM00050 EQU   AVTCKBYT
AVTCKONQ EQU   AVTCKBYT
@NM00049 EQU   AVTCKBYT
@NM00048 EQU   AVTCKBYT
@NM00047 EQU   AVTCKBYT
@NM00046 EQU   AVTCKBYT
@NM00045 EQU   AVTCKBYT
@NM00044 EQU   AVTCKBYT
AVTOPERT EQU   IEDQAVTD+690
AVTOPXCL EQU   IEDQAVTD+688
AVTOPERL EQU   IEDQAVTD+687
@NM00043 EQU   IEDQAVTD+686
AVTCKTIM EQU   IEDQAVTD+684
AVTCKELV EQU   IEDQAVTD+682
AVTCPRCD EQU   IEDQAVTD+681
AVTWARMN EQU   AVTCKELF
AVTCRTLN EQU   AVTCKELF
AVTCPIPN EQU   AVTCKELF
AVTCCLCN EQU   AVTCKELF
AVTCINCN EQU   AVTCKELF
@NM00042 EQU   AVTCKELF
AVTCMCPN EQU   AVTCKELF
AVTNQBCK EQU   AVTCKELF
AVTCKQAD EQU   IEDQAVTD+677
AVTSCBSZ EQU   IEDQAVTD+676
@NM00041 EQU   IEDQAVTD+672
AVTCKELE EQU   IEDQAVTD+668
@NM00040 EQU   AVTCKPEL+8
AVTCKRLK EQU   AVTCKPEL+5
AVTCKRPR EQU   AVTCKPEL+4
AVTCKRMQ EQU   AVTCKRMV+1
AVTCKRKY EQU   AVTCKRMV
AVTHK    EQU   IEDQAVTD+648
AVTHI    EQU   IEDQAVTD+644
AVTIOT   EQU   IEDQAVTD+640
AVTNX    EQU   IEDQAVTD+636
AVTTONE  EQU   IEDQAVTD+632
AVTA3TL  EQU   IEDQAVTD+628
AVTDMECB EQU   IEDQAVTD+624
AVTABEND EQU   IEDQAVTD+618
AVTPLCBN EQU   IEDQAVTD+616
@NM00039 EQU   AVTSAVTP+1
@NM00038 EQU   AVTSAVTF
AVTSNA   EQU   AVTSAVTF
AVTONSNA EQU   AVTSAVTF
AVTVTMCP EQU   AVTSAVTF
@NM00037 EQU   IEDQAVTD+608
AVTCMBSS EQU   IEDQAVTD+604
AVTRCV   EQU   IEDQAVTD+600
AVTSEND  EQU   IEDQAVTD+596
AVTCSCH  EQU   IEDQAVTD+592
AVTQ1    EQU   IEDQAVTD+588
AVTE7    EQU   IEDQAVTD+584
AVTHB    EQU   IEDQAVTD+580
AVTR1    EQU   IEDQAVTD+576
AVTBZ    EQU   IEDQAVTD+572
AVTEZ    EQU   IEDQAVTD+568
AVTEC    EQU   IEDQAVTD+564
AVTEW    EQU   IEDQAVTD+560
AVTNDIAL EQU   AVTSCOPT
AVTN2741 EQU   AVTSCOPT
AVTCONCO EQU   AVTSCOPT
AVTCONC  EQU   AVTSCOPT
AVTCMBUF EQU   AVTSCOPT
AVTAPDMP EQU   AVTSCOPT
@NM00036 EQU   AVTSCOPT
AVTHA    EQU   AVTDISP
AVTEA    EQU   IEDQAVTD+548
AVTAX    EQU   IEDQAVTD+544
AVTA3    EQU   IEDQAVTD+540
AVTGD    EQU   IEDQAVTD+536
AVTAL    EQU   IEDQAVTD+532
AVTOLTST EQU   AVTHG02
AVTE8    EQU   IEDQAVTD+524
AVTUI    EQU   IEDQAVTD+520
AVTCOMPT EQU   IEDQAVTD+516
AVTCRSRF EQU   IEDQAVTD+512
@NM00035 EQU   IEDQAVTD+508
AVTKA02  EQU   IEDQAVTD+504
AVTOPTPT EQU   IEDQAVTD+500
AVTPCBPT EQU   IEDQAVTD+496
@NM00034 EQU   AVTECB1
AVTCOMP  EQU   AVTECB1
@NM00033 EQU   AVTECB1
AVTOPECA EQU   IEDQAVTD+488
AVTOLECA EQU   IEDQAVTD+484
AVTCKECA EQU   IEDQAVTD+480
AVTCWECA EQU   IEDQAVTD+476
AVTCWTCB EQU   IEDQAVTD+472
AVTOLTCB EQU   IEDQAVTD+468
AVTOCTCB EQU   IEDQAVTD+464
AVTCKTCB EQU   IEDQAVTD+460
AVTAS    EQU   IEDQAVTD+456
AVTNOLBF EQU   IEDQAVTD+454
AVTNCKPR EQU   IEDQAVTD+453
AVTCIB   EQU   IEDQAVTD+452
AVTSPLPT EQU   IEDQAVTD+448
AVTMVBFR EQU   IEDQAVTD+444
AVTSBTA  EQU   IEDQAVTD+440
AVTRARTN EQU   IEDQAVTD+436
AVTBSCAN EQU   IEDQAVTD+432
AVTRDYA  EQU   IEDQAVTD+428
AVTDISTR EQU   IEDQAVTD+420
AVTPARM3 EQU   IEDQAVTD+416
@NM00032 EQU   AVTPKF
@NM00031 EQU   AVTPKF
@NM00030 EQU   AVTPKF
AVTFTCHF EQU   AVTPKF
@NM00029 EQU   AVTPKF
@NM00028 EQU   AVTPKF
@NM00027 EQU   AVTPKF
@NM00026 EQU   AVTPKF
AVTPARM  EQU   IEDQAVTD+408
AVTEXS2A EQU   IEDQAVTD+402
AVTEXA2S EQU   IEDQAVTD+396
AVTCKAVT EQU   @NM00024+1
@NM00025 EQU   AVTCKFLG
AVTCKHLT EQU   AVTCKFLG
AVTCKREQ EQU   AVTCKFLG
AVTCKENV EQU   AVTCKFLG
AVTCKNAC EQU   AVTCKFLG
AVTCKTAC EQU   AVTCKFLG
AVTBUENT EQU   IEDQAVTD+386
@NM00023 EQU   IEDQAVTD+385
AVTFULLT EQU   AVTBUFSW
AVTUNCON EQU   AVTBUFSW
@NM00022 EQU   AVTBUFSW
AVTBUFTR EQU   AVTREADD
AVTREADY EQU   IEDQAVTD+376
AVTRACE  EQU   IEDQAVTD+372
AVTTCB   EQU   IEDQAVTD+368
AVTPASWD EQU   IEDQAVTD+360
AVTCTLCH EQU   IEDQAVTD+352
AVTDOUBL EQU   IEDQAVTD+344
AVTDOUBX EQU   IEDQAVTD+336
AVTDPARM EQU   IEDQAVTD+332
AVTCSTCS EQU   IEDQAVTD+328
AVTDLQ   EQU   AVTSAVEX+32
@NM00021 EQU   AVTSAVEX
AVTSAVE4 EQU   IEDQAVTD+216
AVTSAVE3 EQU   IEDQAVTD+144
AVTSAVE2 EQU   IEDQAVTD+72
AVTSAVE1 EQU   IEDQAVTD
TRMSUBST EQU   IEDNTRM+12
TRMRLMCT EQU   IEDNTRM+10
TRMCOHTG EQU   TRMSIBPT+1
TRMGPCNT EQU   TRMSIBPT
TRMBUFRD EQU   TRMBYTE0
TRMSNA   EQU   TRMBYTE0
TRMGP    EQU   TRMBYTE0
TRMDIAL  EQU   TRMBYTE0
@NM00017 EQU   TRMBYTE0
TRMOUTPT EQU   TRMBYTE0
TRMINPUT EQU   TRMBYTE0
TRMUDEF  EQU   TRMBYTE0
TRMCOHRT EQU   IEDNTRM+4
TRMSTOTE EQU   TRMBYTE1
TRMCKPRN EQU   TRMBYTE1
TRMTSATN EQU   TRMBYTE1
TRMTRACE EQU   TRMBYTE1
TRMSWBCK EQU   TRMBYTE1
TRMAUTOC EQU   TRMBYTE1
TRMINPTP EQU   TRMBYTE1
TRMWTNEG EQU   TRMSCPRQ
TRMWRBRK EQU   TRMBYTE2
TRMNOSND EQU   TRMBYTE2
TRMPREP  EQU   TRMBYTE2
TRMGPACT EQU   TRMBYTE2
TRMANDL  EQU   TRMBYTE2
TRMCLOSN EQU   TRMINPG
TRMREMB  EQU   TRMBYTE2
TRMRSACT EQU   TRMBYTE2
TRMOPTBL EQU   IEDQTRM+18
TRMOPNO  EQU   IEDQTRM+17
TRMCHCIN EQU   IEDQTRM+16
TRMSENSE EQU   TRMSTAT+3
TRMTEMPR EQU   TRMSTAT+2
TRMSIO   EQU   TRMSTAT
@NM00016 EQU   TRMDEVFL+1
TRMTPIN  EQU   TRMDEVFL+1
TRMNCPI  EQU   TRMDEVFL+1
TRMRNTRM EQU   TRMDEVFL+1
@NM00015 EQU   TRMDEVFL+1
TRMLMD   EQU   TRMDEVFL+1
TRMCONC  EQU   TRMDEVFL+1
TRMTSOB  EQU   TRMDEVFL
TRMBFDY  EQU   TRMDEVFL
TRMTBLK  EQU   TRMDEVFL
TRMSBLK  EQU   TRMDEVFL
TRMBLKS  EQU   TRMDEVFL
TRMADDC  EQU   TRMDEVFL
TRMDDIG  EQU   TRMDEVFL
TRMBUFS  EQU   TRMDEVFL
TRMPRILK EQU   TRMALTD
TRMLGB   EQU   TRMDSORG
TRMUTERM EQU   TLISTCNT
TRMDESTQ EQU   IEDQTRM+1
TRMSCNYN EQU   TRMSTATE
TRMOPTFN EQU   TRMSTATE
TRMHELDN EQU   TRMSTATE
TRMACPTN EQU   TRMSTATE
TRMPREF  EQU   TRMSTATE
TRMPROC  EQU   TRMLOG
TRMLIST  EQU   TRMLOG
TRMLINE  EQU   TRMSTATE
OPCBOTTM EQU   IEDQOPCD+1188
OPCDSRWT EQU   IEDQOPCD+1184
@NM00014 EQU   IEDQOPCD+1100
@NM00013 EQU   IEDQOPCD+948
@NM00012 EQU   IEDQOPCD+940
@NM00011 EQU   IEDQOPCD+380
@NM00010 EQU   OPCPWCOB+9
@NM00009 EQU   OPCPWCOB+8
@NM00008 EQU   OPCPWECB+1
OPCPWCCC EQU   OPCPWECB
OPCPWCHN EQU   OPCPWQCB+1
OPCPWVTO EQU   OPCPWQCB
OPCWAITV EQU   IEDQOPCD+364
OPCTOTCK EQU   IEDQOPCD+360
OPCAPXTL EQU   IEDQOPCD+356
OPCDECR  EQU   IEDQOPCD+352
OPCBUFWT EQU   IEDQOPCD+348
OPCWRKSP EQU   IEDQOPCD+320
OPCADGOT EQU   IEDQOPCD+318
OPCRQCNT EQU   IEDQOPCD+316
OPPOLSTP EQU   IEDQOPCD+312
OPCCKCIB EQU   IEDQOPCD+308
OPCEND   EQU   IEDQOPCD+307
OPCSTCBS EQU   IEDQOPCD+306
OPCHNEND EQU   IEDQOPCD+302
OPCOQSW  EQU   IEDQOPCD+301
@NM00007 EQU   OPCSPEC
@NM00006 EQU   OPCSPEC
@NM00005 EQU   OPCSPEC
@NM00004 EQU   OPCSPEC
OPCFRMCA EQU   OPCSPEC
OPCRSTRT EQU   OPCSPEC
OPCPART  EQU   OPCSPEC
OPCALTD  EQU   OPCSPEC
OPCBFEND EQU   IEDQOPCD+296
OPCBFIRS EQU   IEDQOPCD+292
OPCAVBUF EQU   IEDQOPCD+290
OPCIPLCT EQU   IEDQOPCD+289
OPCCLNTS EQU   IEDQOPCD+288
OPCHA8   EQU   IEDQOPCD+286
OPCBFREQ EQU   IEDQOPCD+284
OPCFREBF EQU   IEDQOPCD+280
OPCGETBF EQU   IEDQOPCD+276
OPCNEXT  EQU   IEDQOPCD+272
OPCFMDFC EQU   IEDQOPCD+268
OPCSCNC  EQU   IEDQOPCD+264
OPCHORTG EQU   IEDQOPCD+260
OPCCKPTL EQU   IEDQOPCD+252
OPCCKPTF EQU   IEDQOPCD+248
OPCWAITA EQU   IEDQOPCD+244
OPCWAITR EQU   IEDQOPCD+240
OPCWAITP EQU   IEDQOPCD+236
OPCWAITO EQU   IEDQOPCD+232
OPCWAITN EQU   IEDQOPCD+228
OPCWAITL EQU   IEDQOPCD+224
OPCWAITC EQU   IEDQOPCD+220
@NM00003 EQU   OPCLDNME+5
OPCMODID EQU   OPCLDNME+3
@NM00002 EQU   OPCLDNME
OPCXCTL  EQU   IEDQOPCD+204
OPCWAIT  EQU   IEDQOPCD+192
OPCCKERB EQU   IEDQOPCD+164
OPCBFERB EQU   IEDQOPCD+148
OPCFLAG2 EQU   IEDQOPCD+147
OPCFLAG1 EQU   IEDQOPCD+146
OPCWRKSZ EQU   IEDQOPCD+144
OPCWORK  EQU   IEDQOPCD+140
OPCRSAVE EQU   IEDQOPCD+132
OPCQCBAD EQU   IEDQOPCD+128
OPCSAVE  EQU   IEDQOPCD+56
OPCTRMWA EQU   IEDQOPCD+52
OPCPSTWT EQU   IEDQOPCD+48
OPCTNTEA EQU   IEDQOPCD+44
OPCPGCK  EQU   IEDQOPCD+40
OPCLCB   EQU   IEDQOPCD+36
@NM00001 EQU   IEDQOPCD+32
OPCIPLAD EQU   IEDQOPCD+28
OPCTOFLK EQU   IEDQOPCD+24
OPCOPTLK EQU   IEDQOPCD+20
OPCDCBLK EQU   IEDQOPCD+16
OPCCOPCE EQU   IEDQOPCD+12
OPCAVTPT EQU   IEDQOPCD+8
OPCDOUBL EQU   IEDQOPCD
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS
@RC00421 EQU   @RC00419
@PB00003 EQU   @EL00001
@PB00002 EQU   @PB00003
@ENDDATA EQU   *
         END   IGE0904I,(C'PLS1057',0701,77348)
