         TITLE 'IKTCAS33                                               *
                        '
IKTCAS33 CSECT ,                                                   0001
@MAINENT DS    0H                                                  0001
         USING *,@15                                               0001
         B     @PROLOG                                             0001
         DC    AL1(16)                                             0001
         DC    C'IKTCAS33  77.319'                                 0001
         DROP  @15
@PROLOG  STM   @14,@12,12(@13)                                     0001
         BALR  @12,0                                               0001
@PSTART  DS    0H                                                  0001
         USING @PSTART,@12                                         0001
         ST    @13,@SA00001+4                                      0001
         LA    @14,@SA00001                                        0001
         ST    @14,8(,@13)                                         0001
         LR    @13,@14                                             0001
*TMBEGIN :                                                         0019
*      TWAUEIFC(3)=FCUIMA ;            /* SET FOOTPRINT IN ESTAI PARA*/
TMBEGIN  MVI   TWAUEIFC+16(TWAPTR),X'31'                           0019
*      TWAUERA(3)=ADDR(TMBEGIN) ;      /* SPECIFY RETRY ADDRESS      */
         LA    @06,TMBEGIN                                         0020
         STCM  @06,7,TWAUERA+16(TWAPTR)                            0020
*      TWAUERRS(3)=EVAL(R13+4)->TMWA3; /* STORE SAVE AREA ADDRESS    */
         LA    @06,4                                               0021
         ALR   @06,R13                                             0021
         L     @06,TMWA3(,@06)                                     0021
         ST    @06,TWAUERRS+16(,TWAPTR)                            0021
*/*                                                                  */
*/*          CMS LOCK MUST BE HELD TO MANIPULATE  TSB CHAIN.         */
*/*                                                                  */
*      TCASTPTR=TWATCAST ;                  /* GET TCAST ADDR        */
         L     @06,TWATCAST(,TWAPTR)                               0022
         ST    @06,TCASTPTR                                        0022
*      RFY (R14,R15,R0,R1) RSTD  /* RESTRICT PARA REG*/ ;          0023
*      GEN CODE REFS(PSALITA) ;         /* GET LOCKS                 */
         SETLOCK OBTAIN,TYPE=LOCAL,MODE=UNCOND,REGS=USE,              CC
               RELATED=('CHAIN TSB')
         SETLOCK OBTAIN,TYPE=CMS,MODE=UNCOND,REGS=USE,                CC
               RELATED=('CHAIN TSB')
*    /*                                                              */
*    /*      THE FOLLOWING ROUTINE QUEUES THE TSB ON THE TSB CHAIN   */
*    /*      AND STORE THE APPLID IN THE NEWLY CHAINED TSB.          */
*    /*      THE APPLID BEGIN WITH 'TSO' AND FOLLOWED BY A NUMBER    */
*    /*      WHICH IS THE RELATIVE POSITION OF THIS TSB ON THE       */
*    /*      TSB CHAIN.                                              */
*    /*                                                              */
*      IF R8=FCUIMA                    /* R8 HAS FUNCTION CODE       */
*         THEN DO;                     /* OK                         */
         C     R8,@CF00715                                         0025
         BNE   @RF00025                                            0025
*         RFY WESTD BASED(R10) ;                                   0027
*         R7=WELBUF+4 ;                /* USE LOGON BUF AS SAVE AREA */
         LA    R7,4                                                0028
         AL    R7,WELBUF(,R10)                                     0028
*         TSBPTR=R9 ;                  /* R9 POINTS TO NEW TSB       */
         LR    TSBPTR,R9                                           0029
*         R10=1 ;                      /* R10 HAS COUNT              */
         LA    R10,1                                               0030
*         R15=0 ;                      /* R15 - ADDR OF PREVIOUS TSB */
         SLR   R15,R15                                             0031
*         R14=ADDR(TCASTSB) ;          /* R14 CONTAIN ADDR WHERE NEW */
         L     @05,TCASTPTR                                        0032
         LA    R14,TCASTSB(,@05)                                   0032
*                                      /* TSB ADDR TO BE STORED      */
*         R1=TCASTSB ;                 /* R1 - ADDR OF NEXT TSB      */
         L     R1,TCASTSB(,@05)                                    0033
*         DO WHILE (R1 ^=0 ) ;              /* DO UNTIL END OF CHAIN */
         B     @DE00034                                            0034
@DL00034 DS    0H                                                  0035
*            R9=R1->TSBEXTNT->TSBXAIND ; /* GET TSB INDEX            */
         L     @05,TSBEXTNT(,R1)                                   0035
         LH    R9,TSBXAIND(,@05)                                   0035
*            IF R9 > R10               /* IS THERE A HOLE            */
*               THEN DO ;              /* YES                        */
         CR    R9,R10                                              0036
         BNH   @RF00036                                            0036
*               TSBXFWD=R1  ;               /* STORE FORWARD POINTER */
         L     @04,TSBEXTNT(,TSBPTR)                               0038
         ST    R1,TSBXFWD(,@04)                                    0038
*               R1->TSBEXTNT->TSBXBCK=TSBPTR;/*STORE TSB ADDR IN NEXT*/
         ST    TSBPTR,TSBXBCK(,@05)                                0039
*                                            /* TSB BCK POINTER      */
*               R1=0 ;                 /* TO INDICATE END OF LOOP    */
         SLR   R1,R1                                               0040
*               END ;                                              0041
*               ELSE DO ;              /* CONTINUE TO NEXT TSB       */
         B     @RC00036                                            0042
@RF00036 DS    0H                                                  0043
*            R14=ADDR(R1->TSBEXTNT->TSBXFWD); /* GET NEW ADDR        */
         L     R14,TSBEXTNT(,R1)                                   0043
*            R15=R1 ;                       /* ADVANCE               */
         LR    R15,R1                                              0044
*         R1=R15->TSBEXTNT->TSBXFWD ;       /* NEXT TSB ADDR         */
         L     @05,TSBEXTNT(,R15)                                  0045
         L     R1,TSBXFWD(,@05)                                    0045
*            R10=R10+1;                     /* UPDATE COUNT          */
         AL    R10,@CF00067                                        0046
*            END;                                                  0047
*         END ;                             /* END OF CHAIN          */
@RC00036 DS    0H                                                  0048
@DE00034 LTR   R1,R1                                               0048
         BNZ   @DL00034                                            0048
*         R14->TMWA3=TSBPTR ;               /* STORE TSB A IN LAST T */
         ST    TSBPTR,TMWA3(,R14)                                  0049
*         TSBXBCK=R15 ;                     /* BACK POINTER          */
         L     @05,TSBEXTNT(,TSBPTR)                               0050
         ST    R15,TSBXBCK(,@05)                                   0050
*         CVD(R10,TMWA2) ;                  /* CONVERT TO DECIMAL    */
         CVD   R10,TMWA2                                           0051
*         UNPK(TMWA1,TMWA2) ;               /* UNPACK                */
         UNPK  TMWA1(7),TMWA2(8)                                   0052
*         GEN  SETS(TMWA1) ;                                       0053
         OI   TMWA1+6,X'F0'           MAKE LAST CHAR PRINTABLE
*         TMWA1(1:3)='TSO' ;                /* MAKE FIRST 3 CHAR TSO */
         MVC   TMWA1(3),@CC00769                                   0054
*         TSBXAIND=R10 ;               /* STORE TSB INDEX            */
         L     @05,TSBEXTNT(,TSBPTR)                               0055
         STH   R10,TSBXAIND(,@05)                                  0055
*         R7->TMWA4=TMWA1 ;            /* SAVE APPL ID OF NEW A.S.   */
         MVI   TMWA4+7(R7),C' '                                    0056
         MVC   TMWA4(7,R7),TMWA1                                   0056
*         END ;                                                    0057
*    /*                                                              */
*    /*      PROCESS  LISTING OF  ASCB  ADDRESS                      */
*    /*                                                              */
*    /*      THE FOLLOWING ROUTINE LISTS THE ASCB ADDRESSES OF       */
*    /*      ALL TSO USERS. THE ADDRESSES ARE PLACED IN A STORAGE    */
*    /*      PROVIDED IN R9.                                         */
*    /*                                                              */
*      ELSE                            /* NOT CHAIN TSB FUNCTION     */
*      IF R8=FCUIAA                         /* IS THIS RIGHT FUNC C  */
*         THEN DO ;                         /* YES                   */
         B     @RC00025                                            0058
@RF00025 C     R8,@CF00717                                         0058
         BNE   @RF00058                                            0058
*         TSBPTR=TCASTSB ;                  /* GET  TSB CHAIN        */
         L     @05,TCASTPTR                                        0060
         L     TSBPTR,TCASTSB(,@05)                                0060
*         DO WHILE (TSBPTR ^=0) ;           /* DO ENTIRE CHAIN       */
         B     @DE00061                                            0061
@DL00061 DS    0H                                                  0062
*         R9 -> TMWA3=TSBASCB ;             /* GET ASCB ADDR         */
         L     @05,TSBASCB-1(,TSBPTR)                              0062
         LA    @05,0(,@05)                                         0062
         ST    @05,TMWA3(,R9)                                      0062
*         TSBPTR=TSBXFWD ;                  /* TO NEXT TSB           */
         L     @05,TSBEXTNT(,TSBPTR)                               0063
         L     @05,TSBXFWD(,@05)                                   0063
         LR    TSBPTR,@05                                          0063
*         R9=R9+4 ;                         /* POINTS TO NEXT SLOT   */
         AL    R9,@CF00044                                         0064
*         END ;                             /* DONE                  */
@DE00061 SLR   @05,@05                                             0065
         CR    TSBPTR,@05                                          0065
         BNE   @DL00061                                            0065
*         R9 -> TMWA3=0 ;                   /* ZERO LAST ENTRY       */
         ST    @05,TMWA3(,R9)                                      0066
*         END ;                                                    0067
*      GEN CODE REFS(PSALITA) ;         /* RELEASE THE LOCKS         */
@RF00058 DS    0H                                                  0068
@RC00025 DS    0H                                                  0068
         SETLOCK RELEASE,TYPE=CMS,REGS=USE,                           CC
               RELATED=('CHAIN TSB')
         SETLOCK RELEASE,TYPE=LOCAL,REGS=USE,                         CC
               RELATED=('CHAIN TSB')
*      RFY (R14,R15,R0,R1) UNRSTD /*UNRESTRI PARA R */ ;           0069
*      TWAUEIFC(3)=0 ;                 /* CLEAR FOOTPRINT FOR EXIT   */
         MVI   TWAUEIFC+16(TWAPTR),X'00'                           0070
*      END IKTCAS33                                                0071
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.      *
*/*%INCLUDE SYSLIB  (IHAPSA  )                                        *
*/*%INCLUDE SYSLIB  (IKTTCAST)                                        *
*/*%INCLUDE SYSLIB  (IKJTSB  )                                        *
*/*%INCLUDE SYSLIB  (IKTTSBX )                                        *
*/*%INCLUDE SYSLIB  (IKTCASWA)                                        *
*;                                                                 0071
@EL00001 L     @13,4(,@13)                                         0071
@EF00001 DS    0H                                                  0071
@ER00001 LM    @14,@12,12(@13)                                     0071
         BR    @14                                                 0071
@DATA    DS    0H
         DS    0F
@SA00001 DS    18F
         DS    0F
@CF00067 DC    F'1'
@CF00044 DC    F'4'
@CF00715 DC    XL4'31'
@CF00717 DC    XL4'32'
         DS    0D
TCASTPTR DS    A
@CC00769 DC    C'TSO'
TMWA1    DS    CL7
         DS    CL2
TMWA2    DS    CL8
PATCH    DC    13F'0'
@00      EQU   00                      EQUATES FOR REGISTERS 0-15
@01      EQU   01
@02      EQU   02
@03      EQU   03
@04      EQU   04
@05      EQU   05
@06      EQU   06
@07      EQU   07
@08      EQU   08
@09      EQU   09
@10      EQU   10
@11      EQU   11
@12      EQU   12
@13      EQU   13
@14      EQU   14
@15      EQU   15
TSBPTR   EQU   @06
TWAPTR   EQU   @11
R0       EQU   @00
R1       EQU   @01
R7       EQU   @07
R8       EQU   @08
R9       EQU   @09
R10      EQU   @10
R13      EQU   @13
R14      EQU   @14
R15      EQU   @15
R12      EQU   @12
PSA      EQU   0
FLCRNPSW EQU   PSA
FLCROPSW EQU   PSA+8
FLCICCW2 EQU   PSA+16
PSAEEPSW EQU   PSA+132
PSAESPSW EQU   PSA+136
FLCSVILC EQU   PSAESPSW+1
PSAEPPSW EQU   PSA+140
FLCPIILC EQU   PSAEPPSW+1
FLCPICOD EQU   PSAEPPSW+2
PSAPICOD EQU   FLCPICOD+1
FLCTEA   EQU   PSAEPPSW+4
FLCPER   EQU   PSA+152
FLCMCLA  EQU   PSA+168
FLCIOEL  EQU   FLCMCLA+4
FLCIOA   EQU   FLCMCLA+16
FLCFSA   EQU   FLCMCLA+80
PSASUPER EQU   PSA+552
PSASUP1  EQU   PSASUPER
PSASUP2  EQU   PSASUPER+1
PSASUP3  EQU   PSASUPER+2
PSASUP4  EQU   PSASUPER+3
PSACLHT  EQU   PSA+640
PSALKSA  EQU   PSA+696
PSAHLHI  EQU   PSA+760
PSALITA  EQU   PSA+764
PSADSSFL EQU   PSA+836
PSADSSF1 EQU   PSADSSFL
PSADSSF3 EQU   PSADSSFL+2
PSADSSF4 EQU   PSADSSFL+3
PSARSVT  EQU   PSA+896
TCAST    EQU   0
TCASUSER EQU   TCAST+4
TCASTSB  EQU   TCAST+68
TCASFLG1 EQU   TCAST+88
TCASFLG2 EQU   TCAST+89
TSB      EQU   0
TSBASCBA EQU   TSB
TSBSTAT  EQU   TSBASCBA
TSBASCB  EQU   TSBASCBA+1
TSBFLG1  EQU   TSB+4
TSBFLG2  EQU   TSB+16
TSBFLG3  EQU   TSB+24
TSBFLG5  EQU   TSB+25
TSBTERMC EQU   TSB+26
TSBTERM1 EQU   TSBTERMC
TSBTERM2 EQU   TSBTERMC+1
TSBSTCC  EQU   TSB+34
TSBFLG4  EQU   TSB+41
TSBRCB   EQU   TSB+64
TSBLINKA EQU   TSBRCB+4
TSBTPOST EQU   TSB+72
TSBTPFLG EQU   TSBTPOST
TSBMINL  EQU   TSB+84
TSBEXTNT EQU   TSB+96
TSBX     EQU   0
TSBXFWD  EQU   TSBX
TSBXBCK  EQU   TSBX+4
TSBXFLG1 EQU   TSBX+32
TSBXAIND EQU   TSBX+70
TSBXTERM EQU   TSBX+72
TWAR     EQU   0
TWATCAST EQU   TWAR+20
TWAMFL   EQU   TWAR+80
TWAVFL   EQU   TWAR+81
TWAUFL   EQU   TWAR+82
TWACFL   EQU   TWAR+83
TWAM     EQU   TWAR+84
TWAME    EQU   TWAM+68
TWAMEI   EQU   TWAME
TWAV     EQU   TWAR+184
TWAVE    EQU   TWAV+68
TWAVEI   EQU   TWAVE
TWAVI    EQU   TWAR+284
TWAU     EQU   TWAR+300
TWAUE    EQU   TWAU+68
TWAUEI   EQU   TWAUE
TWAUEIFC EQU   TWAUEI
TWAUERA  EQU   TWAUEI+1
TWAUERRS EQU   TWAUE+4
TWAUI    EQU   TWAR+400
TWAC     EQU   TWAR+408
TWACE    EQU   TWAC+68
TWACEI   EQU   TWACE
TWACI    EQU   TWAR+508
WESTD    EQU   0
WECODE1  EQU   WESTD
WECODE1F EQU   WECODE1+1
WECODE2  EQU   WESTD+2
WECODE2F EQU   WECODE2+1
WERC     EQU   WESTD+8
WELBUF   EQU   WESTD+12
WEVNIB   EQU   WESTD+16
TMWA3    EQU   0
TMWA4    EQU   0
PSARSVTE EQU   PSARSVT
FLC      EQU   PSA
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS
PSARSAV  EQU   PSARSVTE+60
PSARSTK  EQU   PSARSVTE+56
PSAESAV3 EQU   PSARSVTE+52
PSAESTK3 EQU   PSARSVTE+48
PSAESAV2 EQU   PSARSVTE+44
PSAESTK2 EQU   PSARSVTE+40
PSAESAV1 EQU   PSARSVTE+36
PSAESTK1 EQU   PSARSVTE+32
PSAPSAV  EQU   PSARSVTE+28
PSAPSTK  EQU   PSARSVTE+24
PSAMSAV  EQU   PSARSVTE+20
PSAMSTK  EQU   PSARSVTE+16
PSASSAV  EQU   PSARSVTE+12
PSASSTK  EQU   PSARSVTE+8
PSANSTK  EQU   PSARSVTE+4
PSACSTK  EQU   PSARSVTE
WEVRPL   EQU   WESTD+20
WEUECB   EQU   WEVNIB
WEUASCB  EQU   WELBUF
WELEN    EQU   WESTD+10
WERC2    EQU   WERC+1
WERC1    EQU   WERC
WENEXT   EQU   WESTD+4
WECD2MIF EQU   WECODE2F
WECD2MAF EQU   WECODE2F
WECODE2T EQU   WECODE2
WECDMIF  EQU   WECODE1F
WECDMAF  EQU   WECODE1F
WECODE1T EQU   WECODE1
TWAEND   EQU   TWAR+536
TWAWORKE EQU   TWAR+524
@NM00061 EQU   TWACI+13
TWACSKIP EQU   TWACI+12
TWACMODQ EQU   TWACI+8
TWACSTPQ EQU   TWACI+4
TWACECB  EQU   TWACI
TWACERRS EQU   TWACE+4
TWACERA  EQU   TWACEI+1
TWACEIFC EQU   TWACEI
TWACRTFC EQU   TWAC+60
TWACABFC EQU   TWAC+56
TWACTWA  EQU   TWAC+52
TWACEWA  EQU   TWAC+4
TWACID   EQU   TWAC
TWAUACQH EQU   TWAUI+4
TWAUECB  EQU   TWAUI
TWAURTFC EQU   TWAU+60
TWAUABFC EQU   TWAU+56
TWAUTWA  EQU   TWAU+52
TWAUEWA  EQU   TWAU+4
TWAUID   EQU   TWAU
TWAVACQH EQU   TWAVI+12
TWAVTHQH EQU   TWAVI+8
TWAVTEQH EQU   TWAVI+4
TWAVECB  EQU   TWAVI
TWAVERRS EQU   TWAVE+4
TWAVERA  EQU   TWAVEI+1
TWAVEIFC EQU   TWAVEI
TWAVRTFC EQU   TWAV+60
TWAVABFC EQU   TWAV+56
TWAVTWA  EQU   TWAV+52
TWAVEWA  EQU   TWAV+4
TWAVID   EQU   TWAV
TWAMERRS EQU   TWAME+4
TWAMERA  EQU   TWAMEI+1
TWAMEIFC EQU   TWAMEI
TWAMRTFC EQU   TWAM+60
TWAMABFC EQU   TWAM+56
TWAMTWA  EQU   TWAM+52
TWAMEWA  EQU   TWAM+4
TWAMID   EQU   TWAM
@NM00060 EQU   TWACFL
TWACFL4  EQU   TWACFL
TWACFL2  EQU   TWACFL
TWACFL1  EQU   TWACFL
@NM00059 EQU   TWAUFL
TWAUFL4  EQU   TWAUFL
TWAUFL3  EQU   TWAUFL
TWAUFL2  EQU   TWAUFL
TWAUFL1  EQU   TWAUFL
@NM00058 EQU   TWAVFL
TWAVFL6  EQU   TWAVFL
TWAVFL5  EQU   TWAVFL
TWAVFL4  EQU   TWAVFL
TWAVFL3  EQU   TWAVFL
TWAVFL2  EQU   TWAVFL
TWAVFL1  EQU   TWAVFL
@NM00057 EQU   TWAMFL
TWAMFL1  EQU   TWAMFL
TWACCOMP EQU   TWAR+76
TWAUCOMP EQU   TWAR+72
TWAVCOMP EQU   TWAR+68
TWAMECB  EQU   TWAR+64
TWACTCB  EQU   TWAR+60
TWAUTCB  EQU   TWAR+56
TWAVTCB  EQU   TWAR+52
TWAMSG   EQU   TWAR+48
TWADEQAS EQU   TWAR+44
TWAEESR  EQU   TWAR+40
TWAPPSR  EQU   TWAR+36
TWATCSR  EQU   TWAR+32
TWATTSR  EQU   TWAR+28
TWAINIT  EQU   TWAR+24
TWACSCB  EQU   TWAR+16
TWAASCB  EQU   TWAR+12
TWAPASQH EQU   TWAR+8
TWASYNQH EQU   TWAR+4
TWARSON  EQU   TWAR+2
TWACOMP  EQU   TWAR
TSBXEND  EQU   TSBX+120
@NM00056 EQU   TSBX+116
TSBXBIND EQU   TSBX+80
TSBXRPL  EQU   TSBX+76
TSBXTMBF EQU   TSBXTERM+2
@NM00055 EQU   TSBXTERM+1
TSBXTMTP EQU   TSBXTERM
TSBXRSZO EQU   TSBX+69
TSBXRSZI EQU   TSBX+68
TSBXLBUF EQU   TSBX+64
TSBXCSAP EQU   TSBX+60
TSBXSRB  EQU   TSBX+56
TSBXSRBI EQU   TSBX+52
@NM00054 EQU   TSBX+48
TSBXTOM  EQU   TSBX+44
TSBXTIM  EQU   TSBX+40
TSBXTVWA EQU   TSBX+36
@NM00053 EQU   TSBX+33
@NM00052 EQU   TSBXFLG1
TSBXWREC EQU   TSBXFLG1
TSBXLOGF EQU   TSBXFLG1
TSBXACTV EQU   TSBXFLG1
TSBXASCI EQU   TSBXFLG1
TSBXUID  EQU   TSBX+24
@NM00051 EQU   TSBX+16
@NM00050 EQU   TSBX+12
TSBXECB  EQU   TSBX+8
TSBEND   EQU   TSB+120
TSBSF1   EQU   TSB+112
TSBTRMID EQU   TSB+104
TSBALTC  EQU   TSB+103
TSBALTR  EQU   TSB+102
TSBPRMC  EQU   TSB+101
TSBPRMR  EQU   TSB+100
TSBPSWD  EQU   TSB+88
TSBLECB  EQU   TSBMINL
TSBLINE  EQU   TSB+82
TSBSTAX  EQU   TSB+81
TSBATTNC EQU   TSB+80
TSBF1V   EQU   TSBTPOST+7
TSBF1M   EQU   TSBTPOST+6
TSBF2V   EQU   TSBTPOST+5
TSBF2M   EQU   TSBTPOST+4
TSBFLAGV EQU   TSBTPOST+3
TSBFLAGM EQU   TSBTPOST+2
TSBSBASV EQU   TSBTPOST+1
@NM00049 EQU   TSBTPFLG
@NM00048 EQU   TSBTPFLG
@NM00047 EQU   TSBTPFLG
@NM00046 EQU   TSBTPFLG
TSBNEWID EQU   TSBTPFLG
TSBTPAYI EQU   TSBTPFLG
TSBTPQCB EQU   TSBTPFLG
TSBPOSTO EQU   TSBTPFLG
TSBLINKB EQU   TSBLINKA+1
TSBPRI   EQU   TSBLINKA
TSBRQCB  EQU   TSBRCB
TSBCTCB  EQU   TSB+60
TSBERSDS EQU   TSB+56
TSBAUTOI EQU   TSB+52
TSBAUTOS EQU   TSB+48
TSBATNCC EQU   TSB+44
TSBASRCE EQU   TSB+42
TSBHLDL  EQU   TSBFLG4
TSBGETBF EQU   TSBFLG4
TSBCANC  EQU   TSBFLG4
TSBHOLD  EQU   TSBFLG4
TSBHUNG  EQU   TSBFLG4
TSBOWAIT EQU   TSBFLG4
TSBIWAIT EQU   TSBFLG4
TSBOCAB  EQU   TSBFLG4
TSBLNNO  EQU   TSB+40
TSBATNTC EQU   TSB+38
TSBATNLC EQU   TSB+36
TSBCHDCC EQU   TSBSTCC+1
TSBLNDCC EQU   TSBSTCC
TSBWTJID EQU   TSB+32
TSBECB   EQU   TSB+28
TSBC1050 EQU   TSBTERM2
@NM00045 EQU   TSBTERM2
@NM00044 EQU   TSBTERM2
@NM00043 EQU   TSBTERM2
@NM00042 EQU   TSBTERM2
TSBCTWX  EQU   TSBTERM2
@NM00041 EQU   TSBTERM2
@NM00040 EQU   TSBTERM2
@NM00039 EQU   TSBTERM1
@NM00038 EQU   TSBTERM1
@NM00037 EQU   TSBTERM1
TSBC2741 EQU   TSBTERM1
TSBC5041 EQU   TSBTERM1
TSBCATTN EQU   TSBTERM1
TSBCBRK  EQU   TSBTERM1
TSBCIHBN EQU   TSBTERM1
TSBVTAM  EQU   TSBFLG5
TSBKEYS  EQU   TSBFLG5
@NM00036 EQU   TSBFLG5
TSBATMP  EQU   TSBFLG5
TSBNFLOP EQU   TSBFLG3
TSBNOBRK EQU   TSBFLG3
TSBTPUT  EQU   TSBFLG3
TSBAWOIP EQU   TSBFLG3
TSBNBKSP EQU   TSBFLG3
TSBSPIT  EQU   TSBFLG3
TSBTJMSG EQU   TSBFLG3
TSBATTN  EQU   TSBFLG3
TSBIBFP  EQU   TSB+21
TSBNIBF  EQU   TSB+20
TSBITBFP EQU   TSB+17
TSBSATN2 EQU   TSBFLG2
TSBSATN1 EQU   TSBFLG2
TSBSTAUT EQU   TSBFLG2
TSBAUTOC EQU   TSBFLG2
TSBAULST EQU   TSBFLG2
TSBBRKIN EQU   TSBFLG2
TSBAUTON EQU   TSBFLG2
TSBBIPI  EQU   TSBFLG2
TSBOBFP  EQU   TSB+13
TSBNOBF  EQU   TSB+12
TSBOTBFP EQU   TSB+9
TSBLNSZ  EQU   TSB+8
TSBWTCB  EQU   TSB+5
TSBTJBF  EQU   TSBFLG1
TSBTJIP  EQU   TSBFLG1
TSBTJOW  EQU   TSBFLG1
TSBIFLSH EQU   TSBFLG1
TSBWOWIP EQU   TSBFLG1
TSBOWIP  EQU   TSBFLG1
TSBOFLSH EQU   TSBFLG1
TSBANSR  EQU   TSBFLG1
TSBATNLD EQU   TSBSTAT
TSB3270  EQU   TSBSTAT
TSBDISC  EQU   TSBSTAT
TSBITOFF EQU   TSBSTAT
TSBNOBUF EQU   TSBSTAT
TSBDSPLY EQU   TSBSTAT
TSBLWAIT EQU   TSBSTAT
TSBINUSE EQU   TSBSTAT
TCASTEND EQU   TCAST+136
TCASDUMP EQU   TCAST+132
TCASSCHD EQU   TCAST+128
@NM00035 EQU   TCAST+124
TCASOMJR EQU   TCAST+120
@NM00034 EQU   TCAST+118
TCASBR14 EQU   TCAST+116
TCASATTN EQU   TCAST+112
TCASASCI EQU   TCAST+108
TCASTTQH EQU   TCAST+104
@NM00033 EQU   TCAST+102
@NM00032 EQU   TCAST+100
@NM00031 EQU   TCAST+98
@NM00030 EQU   TCAST+96
TCASASCB EQU   TCAST+92
@NM00029 EQU   TCAST+90
@NM00028 EQU   TCASFLG2
@NM00027 EQU   TCASFLG1
TCASNACT EQU   TCASFLG1
@NM00026 EQU   TCASFLG1
TCASABND EQU   TCASFLG1
TCASMDSW EQU   TCASFLG1
TCASBKMD EQU   TCASFLG1
TCASLTE  EQU   TCAST+84
TCASEXIT EQU   TCAST+80
TCASOQM  EQU   TCAST+76
TCASIQM  EQU   TCAST+72
TCASTTL  EQU   TCAST+64
TCASWA   EQU   TCAST+60
TCASFRR  EQU   TCAST+56
TCASMSGS EQU   TCAST+52
TCASDATO EQU   TCAST+48
TCASDATI EQU   TCAST+44
TCASXECB EQU   TCAST+40
TCASTID  EQU   TCAST+32
@NM00025 EQU   TCAST+31
TCASCHNL EQU   TCAST+30
TCASCRSZ EQU   TCAST+28
TCASLBUF EQU   TCAST+24
TCASHBUF EQU   TCAST+20
TCASCLSZ EQU   TCAST+18
TCASRCON EQU   TCAST+16
TCASACBP EQU   TCAST+8
TCASUMAX EQU   TCASUSER+2
TCASUSEC EQU   TCASUSER
TCASID   EQU   TCAST
@NM00024 EQU   PSA+3668
PSASTAK  EQU   PSA+3072
@NM00023 EQU   PSA+1048
PSAUSEND EQU   PSA+1048
PSARV062 EQU   PSA+1044
PSACDAL  EQU   PSA+1040
PSAWTCOD EQU   PSA+1036
PSAATCVT EQU   PSA+1032
PSAPCPSW EQU   PSA+1024
PSAPIR2  EQU   PSA+1020
PSARV059 EQU   PSA+1018
PSASVC13 EQU   PSA+1016
PSALSFCC EQU   PSA+1012
PSASFACC EQU   PSA+1008
PSASTOP  EQU   PSA+992
PSASTART EQU   PSA+976
PSARSPSW EQU   PSA+968
PSASRPSW EQU   PSA+960
PSARV045 EQU   PSA+892
PSARV044 EQU   PSA+888
PSARV043 EQU   PSA+884
PSARV042 EQU   PSA+880
PSARV041 EQU   PSA+876
PSARV040 EQU   PSA+872
PSARV025 EQU   PSA+868
PSADSSED EQU   PSA+868
PSADSSPR EQU   PSA+864
PSADSSFW EQU   PSA+860
PSADSS14 EQU   PSA+856
PSADSSPP EQU   PSA+848
PSADSSRP EQU   PSA+840
PSADSS05 EQU   PSADSSF4
PSADSS10 EQU   PSADSSF4
PSADSSVE EQU   PSADSSF4
PSADSSDE EQU   PSADSSF4
PSADSSC0 EQU   PSADSSF4
PSADSSIE EQU   PSADSSF4
PSADSS12 EQU   PSADSSF4
PSADSSRC EQU   PSADSSF4
PSARV057 EQU   PSADSSF3
PSARV056 EQU   PSADSSF3
PSARV055 EQU   PSADSSF3
PSADSSMC EQU   PSADSSF3
PSADSSRW EQU   PSADSSF3
PSADSSNM EQU   PSADSSF3
PSADSSES EQU   PSADSSF3
PSADSSGP EQU   PSADSSF3
PSADSSF2 EQU   PSADSSFL+1
PSADSSPI EQU   PSADSSF1
PSADSSOI EQU   PSADSSF1
PSADSSSP EQU   PSADSSF1
PSADSSTP EQU   PSADSSF1
PSADSSDW EQU   PSADSSF1
PSADSSDD EQU   PSADSSF1
PSADSSDM EQU   PSADSSF1
PSADSSMV EQU   PSADSSF1
PSADSSTS EQU   PSA+816
PSADSSWK EQU   PSA+812
PSADSSR3 EQU   PSA+808
PSADSSR2 EQU   PSA+804
PSADSSRS EQU   PSA+800
PSASTOR  EQU   PSA+796
PSACPUSA EQU   PSA+794
PSAVSTAP EQU   PSA+792
PSAWKVAP EQU   PSA+788
PSAWKRAP EQU   PSA+784
PSAMCHIC EQU   PSA+783
PSARV061 EQU   PSA+782
PSASYMSK EQU   PSA+781
PSAMCHFL EQU   PSA+780
PSACR0   EQU   PSA+776
PSAPSWSV EQU   PSA+768
PSACLHS  EQU   PSAHLHI
PSALKR15 EQU   PSALKSA+60
PSALKR14 EQU   PSALKSA+56
PSALKR13 EQU   PSALKSA+52
PSALKR12 EQU   PSALKSA+48
PSALKR11 EQU   PSALKSA+44
PSALKR10 EQU   PSALKSA+40
PSALKR9  EQU   PSALKSA+36
PSALKR8  EQU   PSALKSA+32
PSALKR7  EQU   PSALKSA+28
PSALKR6  EQU   PSALKSA+24
PSALKR5  EQU   PSALKSA+20
PSALKR4  EQU   PSALKSA+16
PSALKR3  EQU   PSALKSA+12
PSALKR2  EQU   PSALKSA+8
PSALKR1  EQU   PSALKSA+4
PSALKR0  EQU   PSALKSA
PSARV023 EQU   PSACLHT+52
PSALOCAL EQU   PSACLHT+48
PSACMSL  EQU   PSACLHT+44
PSAOPTL  EQU   PSACLHT+40
PSATPACL EQU   PSACLHT+36
PSATPDNL EQU   PSACLHT+32
PSATPNCL EQU   PSACLHT+28
PSAIOSLL EQU   PSACLHT+24
PSAIOSUL EQU   PSACLHT+20
PSAIOSCL EQU   PSACLHT+16
PSAIOSSL EQU   PSACLHT+12
PSASALCL EQU   PSACLHT+8
PSAASML  EQU   PSACLHT+4
PSADISPL EQU   PSACLHT
PSASRSA  EQU   PSA+636
PSARV050 EQU   PSA+634
PSADSSGO EQU   PSA+633
PSARECUR EQU   PSA+632
PSAHLHIS EQU   PSA+628
PSAIPCSA EQU   PSA+624
@NM00022 EQU   PSA+621
PSAIPCDM EQU   PSA+620
PSAIPCD  EQU   PSA+616
@NM00021 EQU   PSA+613
PSAIPCRM EQU   PSA+612
PSAIPCR  EQU   PSA+608
PSAMCHEX EQU   PSA+600
PSAMPSW  EQU   PSA+592
PSAEXPS2 EQU   PSA+584
PSAEXPS1 EQU   PSA+576
PSAPIREG EQU   PSA+572
PSARSREG EQU   PSA+568
PSAGPREG EQU   PSA+556
PSARV022 EQU   PSASUP4
PSARV021 EQU   PSASUP4
PSARV020 EQU   PSASUP4
PSARV019 EQU   PSASUP4
PSARV018 EQU   PSASUP4
PSARV017 EQU   PSASUP4
PSARV016 EQU   PSASUP4
PSARV015 EQU   PSASUP4
PSARV014 EQU   PSASUP3
PSARV013 EQU   PSASUP3
PSARV012 EQU   PSASUP3
PSARV011 EQU   PSASUP3
PSASPR   EQU   PSASUP3
PSAPSREG EQU   PSASUP3
PSAPI2   EQU   PSASUP3
PSAIOSUP EQU   PSASUP3
PSALCR   EQU   PSASUP2
PSARTM   EQU   PSASUP2
PSAACR   EQU   PSASUP2
PSAIPCE2 EQU   PSASUP2
PSAIPCES EQU   PSASUP2
PSAIPCEC EQU   PSASUP2
PSAGTF   EQU   PSASUP2
PSAIPCRI EQU   PSASUP2
PSARV063 EQU   PSASUP1
PSATCTL  EQU   PSASUP1
PSADISP  EQU   PSASUP1
PSALOCK  EQU   PSASUP1
PSAPI    EQU   PSASUP1
PSAEXT   EQU   PSASUP1
PSASVC   EQU   PSASUP1
PSAIO    EQU   PSASUP1
PSAAOLD  EQU   PSA+548
PSAANEW  EQU   PSA+544
PSATOLD  EQU   PSA+540
PSATNEW  EQU   PSA+536
PSALCCAR EQU   PSA+532
PSALCCAV EQU   PSA+528
PSAPCCAR EQU   PSA+524
PSAPCCAV EQU   PSA+520
PSACPULA EQU   PSA+518
PSACPUPA EQU   PSA+516
PSAPSA   EQU   PSA+512
FLCHDEND EQU   PSA+512
FLCCRSAV EQU   FLCMCLA+280
FLCGRSAV EQU   FLCMCLA+216
FLCFPSAV EQU   FLCMCLA+184
FLCFLA   EQU   FLCMCLA+88
FLCRGNCD EQU   FLCMCLA+84
FLCFSAA  EQU   FLCFSA+1
@NM00020 EQU   FLCFSA
@NM00019 EQU   FLCMCLA+72
FLCMCIC  EQU   FLCMCLA+64
@NM00018 EQU   FLCMCLA+20
FLCIOAA  EQU   FLCIOA+1
@NM00017 EQU   FLCIOA
@NM00016 EQU   FLCMCLA+15
@NM00015 EQU   FLCMCLA+14
@NM00014 EQU   FLCMCLA+12
FLCLCL   EQU   FLCMCLA+8
FLCIOELA EQU   FLCIOEL+1
@NM00013 EQU   FLCIOEL
FLCCHNID EQU   FLCMCLA
@NM00012 EQU   PSA+160
FLCMTRCD EQU   PSA+157
@NM00011 EQU   PSA+156
FLCPERA  EQU   FLCPER+1
@NM00010 EQU   FLCPER
@NM00009 EQU   PSA+151
FLCPERCD EQU   PSA+150
FLCMCNUM EQU   PSA+149
@NM00008 EQU   PSA+148
FLCTEAA  EQU   FLCTEA+1
@NM00007 EQU   FLCTEA
PSAPIPC  EQU   PSAPICOD
PSAPIMC  EQU   PSAPICOD
PSAPIPER EQU   PSAPICOD
PSARV049 EQU   FLCPICOD
FLCPILCB EQU   FLCPIILC
@NM00006 EQU   FLCPIILC
@NM00005 EQU   PSAEPPSW
FLCSVCN  EQU   PSAESPSW+2
FLCSILCB EQU   FLCSVILC
@NM00004 EQU   FLCSVILC
@NM00003 EQU   PSAESPSW
FLCEICOD EQU   PSAEEPSW+2
PSASPAD  EQU   PSAEEPSW
@NM00002 EQU   PSA+128
FLCINPSW EQU   PSA+120
FLCMNPSW EQU   PSA+112
FLCPNPSW EQU   PSA+104
FLCSNPSW EQU   PSA+96
FLCENPSW EQU   PSA+88
FLCTRACE EQU   PSA+84
FLCTIMER EQU   PSA+80
FLCCVT2  EQU   PSA+76
FLCCAW   EQU   PSA+72
FLCCSW   EQU   PSA+64
FLCIOPSW EQU   PSA+56
FLCMOPSW EQU   PSA+48
FLCPOPSW EQU   PSA+40
FLCSOPSW EQU   PSA+32
FLCEOPSW EQU   PSA+24
@NM00001 EQU   FLCICCW2+4
FLCCVT   EQU   FLCICCW2
FLCICCW1 EQU   FLCROPSW
FLCIPPSW EQU   FLCRNPSW
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS
@ENDDATA EQU   *
         END   IKTCAS33,(C'PLS1859',0701,77319)
