)ATTR
   Ö TYPE(TEXT)    INTENS(HIGH)    COLOR(WHITE)
   % TYPE(TEXT)    INTENS(HIGH)    COLOR(YELLOW)
   + TYPE(TEXT)    INTENS(LOW)     COLOR(TURQ)
   _ TYPE(INPUT)   INTENS(HIGH)    COLOR(PINK)
   @ TYPE(OUTPUT)  INTENS(HIGH)    COLOR(WHITE)   CAPS(ON)
   * TYPE(OUTPUT)  INTENS(LOW)     COLOR(BLUE)    CAPS(ON)
   # TYPE(INPUT)   INTENS(LOW)     COLOR(GREEN)   CAPS(ON)
   ^ TYPE(TEXT)    INTENS(LOW)     COLOR(TURQ)    SKIP(ON)
)BODY
ÖPRESS END KEY TO RETURN, HELP KEY FOR COMMANDS-------------------------
ÖCOMMAND ===>_ZCMD                                           ÖSCROLL ===
+
+ Volume %Option+ Data Set Name                                   Member
+-----------------------------------------------------------------------
)MODEL
 *$LCVOL^×  _Z^ ×@$LCDSN                                       ^×#MEMBER
)INIT
.CURSOR = ZCMD
.HELP = TSDPUT31
&AMT = 'PAGE'
&ZCMD = ' '
.ZVARS = '(SELECT)'
)END
