*          DATA SET AM000700   AT LEVEL 001 AS OF 01/11/73
         MACRO
         EQUREGS &LIMITS
.*
.*             MACRO-ID. 'EQUREGS'.
.*             AUTHOR. DON HIGGINS.
.*             DATE WRITTEN. 08/04/70.
.*             REMARKS.
.*                 THIS MACRO GENERATES EQU STATEMENTS FOR 1 TO 16
.*                 SYMBOLIC REGISTER NAMES OF THE FORM R0 UP TO R15
.*             THE REGISTER EQU DESIRED CAN BE SPECIFIED IN THE FORM
.*             OF  (0,15), (14,1), (2,6), ETC.
         LCLA  &LOW,&HIGH
         AIF   (N'&SYSLIST EQ 1).GETLIM
.DEFAULT ANOP
&LOW     SETA  0
&HIGH    SETA  15
.GEN     ANOP
R&LOW    EQU   &LOW
         AIF   (&LOW EQ &HIGH).DONE
&LOW     SETA  &LOW+1
         AIF   (&LOW LE 15).GEN
&LOW     SETA  0
         AGO   .GEN
.GETLIM  AIF   (N'&SYSLIST(1) NE 2).DEFAULT
         AIF   (T'&SYSLIST(1,1) NE 'N').DEFAULT
         AIF   (T'&SYSLIST(1,2) NE 'N').DEFAULT
&LOW     SETA  &SYSLIST(1,1)
         AIF   (&LOW LT 0).DEFAULT
         AIF   (&LOW GT 15).DEFAULT
&HIGH    SETA  &SYSLIST(1,2)
         AIF   (&HIGH LT 0).DEFAULT
         AIF   (&HIGH GT 15).DEFAULT
         AGO   .GEN
.DONE    MEXIT
         MEND
