*          DATA SET GU420000   AT LEVEL 002 AS OF 02/06/79
         TITLE 'GU420000 NOSTAE SUBROUTINE TO CANCEL ABEND RECOVERY'
*
*              PGM-ID. GU420000  ALIAS FPC.SUBLIB(NOSTAE)
*              AUTHOR. DON HIGGINS.
*              DATE.   02/05/79.
*              REMARKS.ANY PROGRAM MAY CALL THIS SUBROUTINE TO
*                      CANCEL THE CURRENT ABEND RECOVERY STAE
*                      EXIT. THIS WILL ALLOW FORTRAN PROGRAMS
*                      TO ABEND 0CX, 322, ETC. RATHER THAN U240.
NOSTAE   SUBENTRY
         STAE   0
         SUBEXIT
         EQUAL
         END
