//* ********************************************************
//* *  INSTALL THE 'UADSORT'  PROGRAM                      *
//* ********************************************************
//UADSORT  EXEC ASMHCL,COND=(0,NE),
//         PARM.ASM='OBJECT,NODECK,TERM,ALIGN,NOLIST,BATCH',
//         PARM.LKED='LIST,MAP'
//SYSTERM  DD SYSOUT=*
//SYSIN    DD DSN=SHARE.SOURCE(UADSORT),DISP=SHR
//LKED.SYSLMOD DD DSN=SYS1.SHARE.LOAD,UNIT=,DISP=SHR,SPACE=
//LKED.SYSIN DD *
 NAME UADSORT(R)
/*
