         MACRO -- $CHEK -- CHECK FOR MISSING MACRO ARGUMENTS
&NAME    $CHEK &A,&B
         AIF   ('&A' NE '' AND '&B' NE '').END
         MNOTE 4,'INSUFFICIENT MACRO ARGUMENTS ***********************'
.END     MEND
