         MACRO -- $CVT -- OS COMMUNICATION VECTOR TABLE DSECT
&CVTNAME $CVT  &LIST=,&DOC=NO,&SYS=AOS2,&OPTIONS=(NOSLICE,INTERVAL,0), C
               &TSO=YES,&PREFIX=NO,&FLAG=00,&FLAGB=00,&PATCH=NO,       C
               &REAL=0,&DSECT=YES,&RPS=YES,&CVTTZ=0,&CTLFLGS=00,       C
               &LOADBAL=NO,&CBMRTN=NO,&WARN=0,&STORAGE=0
         LCLC  &LST
&LST     SETC  '&DOC'
         AIF   ('&LIST' EQ '').A
&LST     SETC  '&LIST'
.A       ANOP
         TITLE 'OS COMMUNICATION VECTOR TABLE (CVT) DSECT'
$CVTPTR  EQU   16                  ADDRESS OF CVT POINTER
         SPACE 2
&CVTNAME CVT   SYS=&SYS,OPTIONS=&OPTIONS,TSO=&TSO,PREFIX=&PREFIX,      C
               FLAG=&FLAG,FLAGB=&FLAGB,PATCH=&PATCH,REAL=&REAL,        C
               DSECT=&DSECT,RPS=&RPS,CVTTZ=&CVTTZ,CTLFLGS=&CTLFLGS,    C
               LIST=&LST,LOADBAL=&LOADBAL,CBMRTN=&CBMRTN,WARN=&WARN,   C
               STORAGE=&STORAGE
CVTDSECT EQU   CVT                 ALTERNATE NAME FOR DSECT
&SYSECT  CSECT                     END OF CVT DSECT
         MEND
