         MACRO -- $PSA -- OS PREFIXED SAVE AREA DSECT
         $PSA  &LIST=,&DOC=NO,&DSECT=YES
         TITLE 'OS PREFIXED SAVE AREA (PSA) DSECT'
         IHAPSA DSECT=&DSECT
PSADSECT EQU   PSA                 ALTERNATE NAME FOR DSECT
&SYSECT  CSECT                     END OF PSA DSECT
         MEND
