         MACRO -- $QREM -- REMOVE ELEMENT FROM HASP JOB QUEUE
&NAME    $QREM &LOC
         $CHEK X,&LOC              INSURE ELEMENT ADDRESS WAS PROVIDED
&NAME    $DECODE &LOC              SET UP ELEMENT ADDRESS IN R1
         BAL   LINK,$QREM          LINK TO CONTROL SERVICE PROGRAM
         MEND
