         MACRO -- $RETURN -- RETURN TO MAIN HASP CONTROL SECTION
&NAME    $RETURN
&NAME    L     LINK,PCERETN        LOAD RETURN ADDRESS
         BR    LINK                 AND RETURN TO MAIN PROCESSOR
         MEND
