         MACRO -- $TGB -- HASP ALLOCATION TRACK GROUP BLOCK DSECT
         $TGB  &DOC=NO
         GBLB  &TGBD
         AIF   (&TGBD).END
&TGBD    SETB  1
         AIF   ('&DOC' NE 'YES').A
.A       TITLE 'HASP ALLOCATION TRACK GROUP BLOCK (TGB) DSECT'
TGBDSECT DSECT                     ALLOCATION TRACK GROUP BLK
TGBENTRY DS    0A                  USED TO REFERENCE NEXT 2 WORDS
TGBYTEN  DS    AL2(*-*)            BYTE NUMBER RELATIVE TO TGM
TGBBITM  DS    AL1(0,*-*)          BIT MASK OF ALLOCATED MTTR
TGBMTTR  DS    A                   ALLOCATED MTTR
         SPACE 1
TGBSIZE  EQU   *-TGBDSECT          TGB DSECT LENGTH
         SPACE 1
&SYSECT  CSECT                     END TGB DSECT
.END     MEND
