//...JOBCARD...
//* BUILD THE ASSIST INTERPRETER AND LINK-EDIT IT TO ITS LOADLIBRARY
//*
//* ADD A JOBCARD
//* CHANGE ALL "THISPDS" TO THIS PDS NAME
//* CHANGE ALL "MYLOADLIB" TO VALID LOADLIBRARY NAME
//*
//* MODIFY MEMBER "ASSYSGEN" BEFORE SUBMITTING THIS JCL
//*
//ASM     EXEC PGM=IEV90,PARM='DECK,NOLOAD,XREF(FULL)'
//SYSLIB   DD  DSN=THISPDS,DISP=SHR         <== CHANGE
//         DD  DSN=SYS1.MACLIB,DISP=SHR     ** MVS MACROS
//         DD  DSN=SYS1.AMODGEN,DISP=SHR    ** MVS & JES2 MACROS
//SYSUT1   DD  DSN=&&SYSUT1,UNIT=VIO,SPACE=(1700,(600,100))
//SYSUT2   DD  DSN=&&SYSUT2,UNIT=VIO,SPACE=(1700,(300,50))
//SYSUT3   DD  DSN=&&SYSUT3,UNIT=VIO,SPACE=(1700,(300,50))
//SYSPRINT DD  SYSOUT=*,DCB=BLKSIZE=1089
//SYSPUNCH DD  DSN=&&OBJSET,UNIT=SYSDA,SPACE=(80,(200,50)),
//             DISP=(NEW,PASS)
//SYSIN    DD  DSN=THISPDS(ASSYSGEN),DISP=SHR
//         DD  DSN=THISPDS(SOURCE1),DISP=SHR
//         DD  DSN=THISPDS(SOURCE2),DISP=SHR
//         DD  DSN=THISPDS(SOURCE3),DISP=SHR
//         DD  DSN=THISPDS(SOURCE4),DISP=SHR
//         DD  DSN=THISPDS(SOURCE5),DISP=SHR
//         DD  DSN=THISPDS(SOURCE6),DISP=SHR
//         DD  *
         END
//*
//LKED    EXEC PGM=IEWL,PARM=(XREF,CALL,LIST,MAP),
//             COND=(0,LT,ASM)
//SYSLIN   DD  DSN=&&OBJSET,DISP=(OLD,DELETE)
//SYSLMOD  DD  DSN=MYLOADLIB(ASSIST),DISP=SHR
//SYSLIB   DD  DSN=MYLOADLIB,DISP=SHR
//SYSUT1   DD  DSN=&&SYSUT1,UNIT=VIO,SPACE=(1024,(50,20))
//SYSPRINT DD  SYSOUT=*,DCB=(RECFM=FB,LRECL=121,BLKSIZE=1210)
