         TITLE '**********  ICKRL01:  READ VOLUME LABEL  ***************
               *********'
        MACRO
        GETMAIN &R,&LV=
        L     REG15,0(REG1)           GDTTBL ADDRESS
        L     REG15,GDTPRL(REG15)     PROL ROUTINE ADDRESS
        CNOP  2,4                     BOUNDARY ALIGNMENT
        LA    REG14,*+14              RETURN ADDRESS
        BALR  REG1,REG15              LINKAGE TO PROL ROUTINE
        DC    A(MODID)                MODULE ID ADDRESS
        DC    A(@SIZDATD)             AUTOMATIC STORAGE SIZE ADDRESS
        MEND
ICKRL01  CSECT ,                                                   0002
@MAINENT DS    0H                                                  0002
         USING *,@15                                               0002
         B     @PROLOG                                             0002
         DC    AL1(16)                                             0002
         DC    C'ICKRL01   78.192'                                 0002
         DROP  @15
@PROLOG  STM   @14,@12,12(@13)                                     0002
         BALR  @12,0                                               0002
@PSTART  DS    0H                                                  0002
         USING @PSTART,@12                                         0002
         L     @00,@SIZDATD                                        0002
         GETMAIN  R,LV=(0)
         LR    @11,@01                                             0002
         USING @DATD,@11                                           0002
         ST    @13,@SA00001+4                                      0002
         LM    @00,@01,20(@13)                                     0002
         ST    @11,8(,@13)                                         0002
         LR    @13,@11                                             0002
         XC    @ZTEMPS(@ZLEN),@ZTEMPS
         MVC   @PC00001(20),0(@01)                                 0002
*                                                                  0177
         EJECT
*                                                                  0178
*/*****  B E G I N    E X E C U T I O N  *****************************/
*                                                                  0178
*    IF GDTDBG = NULLPTR                                           0178
*      THEN;                                                       0178
         L     @10,@PC00001                                        0178
         L     @10,GDTDBG(,@10)                                    0178
         LTR   @10,@10                                             0178
         BZ    @RT00178                                            0178
*      ELSE                                                        0180
*        CALL ICKDB010(GDTTBL                                      0180
*         ,'RL00');                                                0180
*                                                                  0180
*                                                                  0180
         L     @10,@PC00001                                        0180
         ST    @10,@AL00001                                        0180
         LA    @15,@CC00482                                        0180
         ST    @15,@AL00001+4                                      0180
         MVI   @AL00001+4,X'80'                                    0180
         L     @15,GDTDBG(,@10)                                    0180
         LA    @01,@AL00001                                        0180
         BALR  @14,@15                                             0180
*    CONDCODE = SUCCESS;                                           0181
*                                                                  0181
@RT00178 L     @10,@PC00001+16                                     0181
         SLR   @15,@15                                             0181
         ST    @15,CONDCODE(,@10)                                  0181
*/*  READ CYLINDER 0, TRACK 0, RECORD 3 (UDEVOP)                     */
*    RECNUM = 3;                                                   0182
         MVC   RECNUM(4),@CF00136                                  0182
*    CALL ICKDVOP0(GDTTBL                                          0183
*          ,VOLIB                                                  0183
*          ,ACTRDN                                                 0183
*          ,TRKCCHH                                                0183
*          ,RECNUM                                                 0183
*          ,POOLID                                                 0183
*          ,DATAPTR                                                0183
*          ,DATALEN                                                0183
*          ,RETCODE);                                              0183
*                                                                  0183
         L     @10,@PC00001                                        0183
         ST    @10,@AL00001                                        0183
         L     @15,@PC00001+4                                      0183
         ST    @15,@AL00001+4                                      0183
         LA    @15,@CF00265                                        0183
         ST    @15,@AL00001+8                                      0183
         LA    @15,TRKCCHH                                         0183
         ST    @15,@AL00001+12                                     0183
         LA    @15,RECNUM                                          0183
         ST    @15,@AL00001+16                                     0183
         LA    @15,POOLID                                          0183
         ST    @15,@AL00001+20                                     0183
         LA    @15,DATAPTR                                         0183
         ST    @15,@AL00001+24                                     0183
         LA    @15,DATALEN                                         0183
         ST    @15,@AL00001+28                                     0183
         LA    @15,RETCODE                                         0183
         ST    @15,@AL00001+32                                     0183
         L     @15,GDTDOP(,@10)                                    0183
         LA    @01,@AL00001                                        0183
         BALR  @14,@15                                             0183
*/*  IF UNABLE TO READ VOLUME LABEL RECORD                           */
*    IF RETCODE ^= SUCCESS                                         0184
*                                                                  0184
*/*    THEN SET ERROR CODE (CONDCODE=1)                              */
*      THEN                                                        0184
         L     @10,RETCODE                                         0184
         LTR   @10,@10                                             0184
         BZ    @RF00184                                            0184
*        DO;                                                       0185
*                                                                  0185
*          CONDCODE = NREADLBL;                                    0186
         L     @10,@PC00001+16                                     0186
         MVC   CONDCODE(4,@10),@CF00165                            0186
*        END;                                                      0187
*                                                                  0187
*/*    ELSE                                                          */
*      ELSE DO;                                                    0188
*                                                                  0188
         B     @RC00184                                            0188
@RF00184 DS    0H                                                  0189
*        RESPECIFY (VOL1) BASED(DATAPTR);                          0189
*        VOL1P = VOL1;                                             0190
*                                                                  0190
         L     @10,@PC00001+8                                      0190
         L     @15,DATAPTR                                         0190
         MVC   VOL1P(80,@10),VOL1(@15)                             0190
*/*      IF NOT 'VOL1' RECORD                                        */
*        IF VOL1ID ^= 'VOL' × VOL1NUM ^= '1'                       0191
*                                                                  0191
*/*        THEN SET ERROR CODE (CONDCODE=1)                          */
*          THEN                                                    0191
         CLC   VOL1ID(3,@15),@CC00505                              0191
         BNE   @RT00191                                            0191
         CLI   VOL1NUM(@15),C'1'                                   0191
         BE    @RF00191                                            0191
@RT00191 DS    0H                                                  0192
*            DO;                                                   0192
*                                                                  0192
*              CONDCODE = NREADLBL;                                0193
         L     @10,@PC00001+16                                     0193
         MVC   CONDCODE(4,@10),@CF00165                            0193
*            END;                                                  0194
*                                                                  0194
*/*        ELSE                                                      */
*          ELSE DO;                                                0195
*                                                                  0195
*                                                                  0195
         B     @RC00191                                            0195
@RF00191 DS    0H                                                  0196
*/*          INITIALIZE USER LABEL COUNT TO 0                        */
*            LABELS = 0;                                           0196
*                                                                  0196
         L     @10,@PC00001+12                                     0196
         SLR   @15,@15                                             0196
         ST    @15,LABELS(,@10)                                    0196
*/*          READ FIRST USER VOLUME LABEL RECORD (UDEVOP)            */
*            RECNUM = 4;                                           0197
         MVC   RECNUM(4),@CF00044                                  0197
*            CALL ICKDVOP0(GDTTBL                                  0198
*                  ,VOLIB                                          0198
*                  ,ACTRDN                                         0198
*                  ,TRKCCHH                                        0198
*                  ,RECNUM                                         0198
*                  ,POOLID                                         0198
*                  ,DATAPTR                                        0198
*                  ,DATALEN                                        0198
*                  ,RETCODE);                                      0198
*                                                                  0198
         L     @10,@PC00001                                        0198
         ST    @10,@AL00001                                        0198
         L     @15,@PC00001+4                                      0198
         ST    @15,@AL00001+4                                      0198
         LA    @15,@CF00265                                        0198
         ST    @15,@AL00001+8                                      0198
         LA    @15,TRKCCHH                                         0198
         ST    @15,@AL00001+12                                     0198
         LA    @15,RECNUM                                          0198
         ST    @15,@AL00001+16                                     0198
         LA    @15,POOLID                                          0198
         ST    @15,@AL00001+20                                     0198
         LA    @15,DATAPTR                                         0198
         ST    @15,@AL00001+24                                     0198
         LA    @15,DATALEN                                         0198
         ST    @15,@AL00001+28                                     0198
         LA    @15,RETCODE                                         0198
         ST    @15,@AL00001+32                                     0198
         L     @15,GDTDOP(,@10)                                    0198
         LA    @01,@AL00001                                        0198
         BALR  @14,@15                                             0198
*/*          DO-WHILE USER VOLUME LABEL RECORD FOUND                 */
*            DO WHILE RETCODE = SUCCESS &                          0199
*                     (VOL1ID = 'UVL' × VOL1ID = 'VOL');           0199
*                                                                  0199
*                                                                  0199
         B     @DE00199                                            0199
@DL00199 DS    0H                                                  0200
*/*            INCREMENT USER VOLUME LABEL COUNT                     */
*              LABELS = LABELS + 1;                                0200
*                                                                  0200
         L     @10,@PC00001+12                                     0200
         LA    @15,1                                               0200
         L     @14,LABELS(,@10)                                    0200
         ALR   @14,@15                                             0200
         ST    @14,LABELS(,@10)                                    0200
*/*            READ NEXT USER LABEL RECORD (UDEVOP)                  */
*              RECNUM = RECNUM + 1;                                0201
         AL    @15,RECNUM                                          0201
         ST    @15,RECNUM                                          0201
*              CALL ICKDVOP0(GDTTBL                                0202
*                    ,VOLIB                                        0202
*                    ,ACTRDN                                       0202
*                    ,TRKCCHH                                      0202
*                    ,RECNUM                                       0202
*                    ,POOLID                                       0202
*                    ,DATAPTR                                      0202
*                    ,DATALEN                                      0202
*                    ,RETCODE);                                    0202
*                                                                  0202
*                                                                  0202
         L     @10,@PC00001                                        0202
         ST    @10,@AL00001                                        0202
         L     @15,@PC00001+4                                      0202
         ST    @15,@AL00001+4                                      0202
         LA    @15,@CF00265                                        0202
         ST    @15,@AL00001+8                                      0202
         LA    @15,TRKCCHH                                         0202
         ST    @15,@AL00001+12                                     0202
         LA    @15,RECNUM                                          0202
         ST    @15,@AL00001+16                                     0202
         LA    @15,POOLID                                          0202
         ST    @15,@AL00001+20                                     0202
         LA    @15,DATAPTR                                         0202
         ST    @15,@AL00001+24                                     0202
         LA    @15,DATALEN                                         0202
         ST    @15,@AL00001+28                                     0202
         LA    @15,RETCODE                                         0202
         ST    @15,@AL00001+32                                     0202
         L     @15,GDTDOP(,@10)                                    0202
         LA    @01,@AL00001                                        0202
         BALR  @14,@15                                             0202
*/*          END-WHILE                                               */
*            END;                                                  0203
*                                                                  0203
@DE00199 L     @10,RETCODE                                         0203
         LTR   @10,@10                                             0203
         BNZ   @DC00199                                            0203
         L     @10,DATAPTR                                         0203
         CLC   VOL1ID(3,@10),@CC00507                              0203
         BE    @DL00199                                            0203
         CLC   VOL1ID(3,@10),@CC00505                              0203
         BE    @DL00199                                            0203
@DC00199 DS    0H                                                  0204
*/*          END-ELSE                                                */
*            END;                                                  0204
*                                                                  0204
*/*      END-ELSE                                                    */
*        END;                                                      0205
*                                                                  0205
@RC00191 DS    0H                                                  0206
*/*  END-PROCEDURE READ_VOLUME_LABEL                                 */
*    IF GDTDBG = NULLPTR                                           0206
*      THEN;                                                       0206
@RC00184 L     @10,@PC00001                                        0206
         L     @10,GDTDBG(,@10)                                    0206
         LTR   @10,@10                                             0206
         BZ    @RT00206                                            0206
*      ELSE                                                        0208
*        CALL ICKDB010(GDTTBL                                      0208
*         ,'RL99');                                                0208
         L     @10,@PC00001                                        0208
         ST    @10,@AL00001                                        0208
         LA    @15,@CC00508                                        0208
         ST    @15,@AL00001+4                                      0208
         MVI   @AL00001+4,X'80'                                    0208
         L     @15,GDTDBG(,@10)                                    0208
         LA    @01,@AL00001                                        0208
         BALR  @14,@15                                             0208
*    CALL ICKSAFP0 (GDTTBL                                         0209
*           ,POOLID);                                              0209
@RT00206 L     @10,@PC00001                                        0209
         ST    @10,@AL00001                                        0209
         LA    @15,POOLID                                          0209
         ST    @15,@AL00001+4                                      0209
         MVI   @AL00001+4,X'80'                                    0209
         L     @15,GDTFPL(,@10)                                    0209
         LA    @01,@AL00001                                        0209
         BALR  @14,@15                                             0209
*    CALL ICKSAEP0(GDTTBL,MODID);                                  0210
*                                                                  0210
*                                                                  0210
         L     @10,@PC00001                                        0210
         ST    @10,@AL00001                                        0210
         LA    @15,MODID                                           0210
         ST    @15,@AL00001+4                                      0210
         MVI   @AL00001+4,X'80'                                    0210
         L     @15,GDTEPL(,@10)                                    0210
         LA    @01,@AL00001                                        0210
         BALR  @14,@15                                             0210
*    END ICKRL01                                                   0211
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.      *
*/*%INCLUDE SYSLIB  (DMSDF01 )                                        *
*/*%INCLUDE SYSLIB  (DMSDF00 )                                        *
*/*@INCLUDE SYSLIB  (DMSDF02 )                                        *
*/*%INCLUDE SYSLIB  (DMSDF08 )                                        *
*;                                                                 0211
@DATA    DS    0H
@DATD    DSECT
         DS    0F
@SA00001 DS    18F
@PC00001 DS    5F
@AL00001 DS    9A
@ZTEMPS  DS    C
@ZTEMPND EQU   *
@ZLEN    EQU   @ZTEMPND-@ZTEMPS
ICKRL01  CSECT
         DS    0F
@CF00165 DC    F'1'
@CF00136 DC    F'3'
@CF00044 DC    F'4'
@CF00265 DC    F'12'
@DATD    DSECT
         DS    0D
LISTSCAN DS    A
IOCSPTR  DS    A
OPNPTR   DS    A
DDSTRU   DS    A
FSADDR   DS    A
DMPINDEX DS    A
RECNUM   DS    F
DATAPTR  DS    A
DATALEN  DS    F
RETCODE  DS    F
LISTPTR  DS    A
SETRC    DS    H
TESTRC   DS    H
LISTLN   DS    FL1
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA
@ENDDATD EQU   *
ICKRL01  CSECT
         DS    0F
@SIZDATD DC    AL1(0)
         DC    AL3(@ENDDATD-@DATD)
         DS    0D
TRKCCHH  DC    A(0)
@CC00482 DC    C'RL00'
@CC00508 DC    C'RL99'
@CC00505 DC    C'VOL'
@CC00507 DC    C'UVL'
MODID    DC    CL4'RL01'
POOLID   DC    CL4'RL00'
PTCHRL01 DS    CL256
         ORG   PTCHRL01
@NM00018 DC    256X'00'
         ORG   PTCHRL01+256
@00      EQU   00                      EQUATES FOR REGISTERS 0-15
@01      EQU   01
@02      EQU   02
@03      EQU   03
@04      EQU   04
@05      EQU   05
@06      EQU   06
@07      EQU   07
@08      EQU   08
@09      EQU   09
@10      EQU   10
@11      EQU   11
@12      EQU   12
@13      EQU   13
@14      EQU   14
@15      EQU   15
REG12    EQU   @12
REG0     EQU   @00
REG1     EQU   @01
REG10    EQU   @10
REG11    EQU   @11
REG13    EQU   @13
REG14    EQU   @14
REG15    EQU   @15
REG2     EQU   @02
REG3     EQU   @03
REG4     EQU   @04
REG5     EQU   @05
REG6     EQU   @06
REG7     EQU   @07
REG8     EQU   @08
REG9     EQU   @09
RTNREG   EQU   @15
ICKSAEP0 EQU   0
ICKSAFP0 EQU   0
TRACE1   EQU   0
OLDERID1 EQU   TRACE1
TRACE2   EQU   0
STAEPARM EQU   0
STAEPFX  EQU   STAEPARM
IOCSTR   EQU   0
IOCDSO   EQU   IOCSTR+13
IOCRFM   EQU   IOCSTR+14
IOCMAC   EQU   IOCSTR+15
IOCMSG   EQU   IOCSTR+16
OPNAGL   EQU   0
OPNOPT   EQU   OPNAGL
OPNRFM   EQU   OPNAGL+1
OPNTYP   EQU   OPNAGL+2
OPNMOD   EQU   OPNAGL+3
UVOLLIST EQU   0
UVOLENT  EQU   UVOLLIST+2
ICKDVOP0 EQU   0
DARGLIST EQU   0
DARGSTID EQU   DARGLIST+8
DARGARY  EQU   DARGLIST+20
DARGINS  EQU   DARGARY
DARGINL  EQU   DARGARY+2
FMTLIST  EQU   0
FMTFLGS  EQU   FMTLIST
FMTSPF   EQU   FMTLIST+2
FMTRFNO  EQU   FMTSPF
FMTILEN  EQU   FMTRFNO
FMTIOFF  EQU   FMTLIST+4
FMTTRBC  EQU   FMTIOFF
FMTSTO   EQU   FMTTRBC
FMTOCOL  EQU   FMTLIST+6
FMTCNVF  EQU   FMTLIST+10
ICKDB010 EQU   0
DMPITM   EQU   0
DMPARY   EQU   0
VOL1     EQU   0
VOL1ID   EQU   VOL1
VOL1NUM  EQU   VOL1+3
VOL1OWNR EQU   VOL1+37
DMPTRM   EQU   0
ICKDVCL0 EQU   0
ICKDVIN0 EQU   0
ICKDVON0 EQU   0
ICKIOCL0 EQU   0
ICKIOGT0 EQU   0
ICKIOIT0 EQU   0
ICKIOOP0 EQU   0
ICKIOPT0 EQU   0
ICKIOTM0 EQU   0
ICKSACL0 EQU   0
ICKSADE0 EQU   0
ICKSAFS0 EQU   0
ICKSAGP0 EQU   0
ICKSAGS0 EQU   0
ICKSALD0 EQU   0
ICKSAPR0 EQU   0
ICKSASC0 EQU   0
ICKSASN0 EQU   0
ICKSAST0 EQU   0
ICKSATI0 EQU   0
ICKSAVC0 EQU   0
ICKSAWO0 EQU   0
ICKTPEA0 EQU   0
ICKTPES0 EQU   0
ICKTPPR0 EQU   0
ICKTPRE0 EQU   0
ICKTPRS0 EQU   0
LISTTEST EQU   0
NEWERID1 EQU   5
NEWERID2 EQU   5
GDTTBL   EQU   0
GDTTR1   EQU   GDTTBL+8
GDTTR2   EQU   GDTTBL+12
GDTDIN   EQU   GDTTBL+44
GDTDOP   EQU   GDTTBL+48
GDTDBG   EQU   GDTTBL+52
GDTDVO   EQU   GDTTBL+56
GDTPRT   EQU   GDTTBL+60
GDTESS   EQU   GDTTBL+64
GDTESA   EQU   GDTTBL+68
GDTRST   EQU   GDTTBL+72
GDTRES   EQU   GDTTBL+76
GDTCAL   EQU   GDTTBL+80
GDTGSP   EQU   GDTTBL+84
GDTFSP   EQU   GDTTBL+88
GDTGPL   EQU   GDTTBL+92
GDTFPL   EQU   GDTTBL+96
GDTLOD   EQU   GDTTBL+100
GDTDEL   EQU   GDTTBL+104
GDTPRL   EQU   GDTTBL+108
GDTEPL   EQU   GDTTBL+112
GDTTIM   EQU   GDTTBL+116
GDTIIO   EQU   GDTTBL+120
GDTTIO   EQU   GDTTBL+124
GDTOPN   EQU   GDTTBL+136
GDTCLS   EQU   GDTTBL+140
GDTGET   EQU   GDTTBL+144
GDTPUT   EQU   GDTTBL+148
GDTSNP   EQU   GDTTBL+160
GDTWTO   EQU   GDTTBL+168
GDTSCR   EQU   GDTTBL+172
GDTVCK   EQU   GDTTBL+176
GDTDVC   EQU   GDTTBL+180
GDTSTE   EQU   GDTTBL+188
VOLIB    EQU   0
VOL1P    EQU   0
LABELS   EQU   0
CONDCODE EQU   0
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS
GDTCVR   EQU   GDTTBL+184
GDTSPR   EQU   GDTTBL+164
GDTABH   EQU   GDTTBL+156
GDTABT   EQU   GDTTBL+152
GDTTOH   EQU   GDTTBL+132
GDTRIP   EQU   GDTTBL+128
GDTDVH   EQU   GDTTBL+40
GDTIOH   EQU   GDTTBL+36
GDTSAH   EQU   GDTTBL+32
GDTTPH   EQU   GDTTBL+28
GDTRIH   EQU   GDTTBL+24
GDTSTH   EQU   GDTTBL+20
GDTDBH   EQU   GDTTBL+16
GDTPRM   EQU   GDTTBL+4
GDTHDR   EQU   GDTTBL
VOL1STDV EQU   VOL1+79
@NM00020 EQU   VOL1+51
VOL1OLDO EQU   VOL1OWNR+4
VOL1OEXT EQU   VOL1OWNR
@NM00019 EQU   VOL1+16
VOL1VTOC EQU   VOL1+11
VOL1ACC  EQU   VOL1+10
VOL1SER  EQU   VOL1+4
@NM00017 EQU   DMPARY+15
DMPARYTP EQU   DMPARY+14
DMPARYEX EQU   DMPARY+12
DMPARYIC EQU   DMPARY+10
DMPARYSZ EQU   DMPARY+8
DMPARYNM EQU   DMPARY
@NM00016 EQU   DMPITM+15
DMPITMTP EQU   DMPITM+14
DMPITMLN EQU   DMPITM+12
DMPITMPT EQU   DMPITM+8
DMPITMNM EQU   DMPITM
@NM00015 EQU   FMTCNVF+1
FMTBS    EQU   FMTCNVF+1
FMTSS    EQU   FMTCNVF+1
FMTAL    EQU   FMTCNVF+1
FMTZS    EQU   FMTCNVF+1
@NM00014 EQU   FMTCNVF
FMTPU    EQU   FMTCNVF
FMTBD    EQU   FMTCNVF
FMTBHD   EQU   FMTCNVF
FMTBHA   EQU   FMTCNVF
FMTBH    EQU   FMTCNVF
FMTOLEN  EQU   FMTLIST+8
FMTRIO   EQU   FMTOCOL
FMTSPT   EQU   FMTSTO
FMTSTL   EQU   FMTILEN
@NM00013 EQU   FMTFLGS+1
FMTHDF   EQU   FMTFLGS
FMTDFF   EQU   FMTFLGS
FMTSTF   EQU   FMTFLGS
FMTREPF  EQU   FMTFLGS
FMTBDF   EQU   FMTFLGS
FMTIDF   EQU   FMTFLGS
FMTSCF   EQU   FMTFLGS
FMTEOLF  EQU   FMTFLGS
DARGDTM  EQU   DARGARY+4
DARGPCT  EQU   DARGINL
DARGREP  EQU   DARGINS
@NM00012 EQU   DARGLIST+19
DARGIND  EQU   DARGLIST+18
DARGRETL EQU   DARGLIST+16
DARGCNT  EQU   DARGLIST+14
DARGILP  EQU   DARGLIST+12
DARGSENT EQU   DARGSTID+3
DARGSMOD EQU   DARGSTID
DARGRETP EQU   DARGLIST+4
DARGDBP  EQU   DARGLIST
UVOLVOL  EQU   UVOLENT+4
UVOLDEV  EQU   UVOLENT
UVOLCNT  EQU   UVOLLIST
OPNRSVD  EQU   OPNAGL+28
OPNVOL   EQU   OPNAGL+24
OPNBLK   EQU   OPNAGL+20
OPNREC   EQU   OPNAGL+16
OPNDSN   EQU   OPNAGL+12
OPNDDN   EQU   OPNAGL+8
OPNIOC   EQU   OPNAGL+4
@NM00011 EQU   OPNMOD
OPNMODRC EQU   OPNMOD
OPNMODAC EQU   OPNMOD
@NM00010 EQU   OPNTYP
OPNTYPSO EQU   OPNTYP
OPNTYPSI EQU   OPNTYP
@NM00009 EQU   OPNRFM
OPNRFMBK EQU   OPNRFM
OPNRFMSF EQU   OPNRFM
OPNRFMUN EQU   OPNRFM
OPNRFMVR EQU   OPNRFM
OPNRFMFX EQU   OPNRFM
@NM00008 EQU   OPNOPT
OPNOPTJM EQU   OPNOPT
OPNOPTKS EQU   OPNOPT
OPNOPTBK EQU   OPNOPT
OPNOPTUP EQU   OPNOPT
OPNOPTOT EQU   OPNOPT
OPNOPTIN EQU   OPNOPT
IOCEXT   EQU   IOCSTR+36
IOCRRN   EQU   IOCSTR+32
@NM00007 EQU   IOCSTR+30
IOCPNM   EQU   IOCSTR+28
IOCCBP   EQU   IOCSTR+24
IOCDSN   EQU   IOCSTR+20
@NM00006 EQU   IOCSTR+17
@NM00005 EQU   IOCMSG
IOCMSGOP EQU   IOCMSG
IOCMACPA EQU   IOCMAC
@NM00004 EQU   IOCMAC
IOCMACBK EQU   IOCMAC
IOCMACUP EQU   IOCMAC
IOCMACOT EQU   IOCMAC
IOCMACIN EQU   IOCMAC
@NM00003 EQU   IOCRFM
IOCRFMBK EQU   IOCRFM
IOCRFMSF EQU   IOCRFM
IOCRFMUN EQU   IOCRFM
IOCRFMVR EQU   IOCRFM
IOCRFMFX EQU   IOCRFM
@NM00002 EQU   IOCDSO
IOCDSOPS EQU   IOCDSO
IOCKYL   EQU   IOCSTR+12
IOCTRN   EQU   IOCSTR+8
IOCDLN   EQU   IOCSTR+4
IOCDAD   EQU   IOCSTR
STAEWORK EQU   STAEPARM+32
STARPTR  EQU   STAEPFX+28
STASPTR  EQU   STAEPFX+24
STALEN   EQU   STAEPFX+20
STAID    EQU   STAEPFX+16
STAEPA   EQU   STAEPFX+12
STAGDT   EQU   STAEPFX+8
STABPTR  EQU   STAEPFX+4
STAFPTR  EQU   STAEPFX
NEWID2   EQU   TRACE2+95
OLDERID2 EQU   TRACE2
NEWID1   EQU   TRACE1+95
CALLID   EQU   OLDERID1+90
@NM00001 EQU   OLDERID1
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS
@ENDDATA EQU   *
         END   ICKRL01,(C'PLS1729',0701,78192)
