SVTM     TITLE '     SSCP -- ISTINCVA -- VARY ACTIVATE                 *
                        '
ISTINCVA CSECT ,                                                   0001
@MAINENT DS    0H                                                  0001
         USING *,@15                                               0001
         B     @PROLOG                                             0001
         DC    AL1(16)                                             0001
         DC    C'ISTINCVA  78.086'                                 0001
         DROP  @15
@PROLOG  STM   @14,@12,12(@13)                                     0001
         BALR  @10,0                                               0001
@PSTART  LA    @11,4095(,@10)                                      0001
         LA    @12,4095(,@11)                                      0001
         USING @PSTART,@10                                         0001
         USING @PSTART+4095,@11                                    0001
         USING @PSTART+8190,@12                                    0001
*                                                                  0748
*   /*****************************************************************/
*   /*                                                               */
*   /* MESSAGES                                                      */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0748
*CVAMSGS:                                                          0748
*   ;                                                              0748
*                                                                  0748
CVAMSGS  DS    0H                                                  0749
*/*  IST067I VARY FAILED- XXXXXXXX NODE ALREADY ACTIVE               */
*                                                                  0749
*   DCL                                                            0749
*     CVAMS067 BDY(WORD)CHAR(4)INIT('067I');                       0749
*                                                                  0749
*/*                                                                  */
*/*  IST069I VARY FAILED- UNABLE TO OPEN ID=XXXXXXXX                 */
*                                                                  0750
*   DCL                                                            0750
*     CVAMS069 BDY(WORD)CHAR(4)INIT('069I');                       0750
*                                                                  0750
*/*                                                                  */
*/*  IST073I VVVVVVVV FAILED FOR ID=XXXXXXXX BECAUSE IT IS BEING   0751
*              DEACTIVATED                                           */
*                                                                  0751
*   DCL                                                            0751
*     CVAMS073 BDY(WORD)CHAR(4)INIT('073I');                       0751
*                                                                  0751
*/*                                                                  */
*/*  IST074I VVVVVVVV FAILED FOR ID=XXXXXXXX- INSUFFICIENT STORAGE   */
*                                                                  0752
*   DCL                                                            0752
*     CVAMS074 BDY(WORD)CHAR(4)INIT('074I');                       0752
*                                                                  0752
*/*                                                                  */
*/*  IST090I VARY CANNOT ACTIVATE XXXXXXXX- OFFLINE OR ALREADY     0753
*    ALLOCATED                                                       */
*                                                                  0753
*   DCL                                                            0753
*     CVAMS090 BDY(WORD)CHAR(4)INIT('090I');                       0753
*                                                                  0753
*/*                                                          @D32CKDQ*/
*/*  IST091I VARY UNABLE TO ACTVATE XXXXXXXX - VARY          @D32CKDQ
*            COMMAND CONTINUES                               @D32CKDQ*/
*                                                                  0754
*   DCL                                                            0754
*     CVAMS091 BDY(WORD) CHAR(4)INIT('091I');              /*@D32CKDQ*/
*                                                                  0754
*/*                                                                  */
*/*  IST093I XXXXXXXX ACTIVE                                         */
*                                                                  0755
*   DCL                                                            0755
*     CVAMS093 BDY(WORD)CHAR(4)INIT('093I');                       0755
*                                                                  0755
*/*                                                                  */
*/*  IST094I VARY FAILED- ID=XXXXXXXX INVALID                        */
*                                                                  0756
*   DCL                                                            0756
*     CVAMS094 BDY(WORD)CHAR(4)INIT('094I');                       0756
*                                                                  0756
*/*                                                          @D32CKDQ*/
*/*  IST313I                                                 @D32CKDQ*/
*                                                                  0757
*   DCL                                                            0757
*     CVAMS313 BDY(WORD)CHAR(4)INIT('313I');               /*@D32CKDQ*/
*                                                                  0757
*/*                                                                  */
*/*  IST600I VARY FAILED FOR ID=XXXXXXXX - INVALID NODE              */
*                                                                  0758
*   DCL                                                            0758
*     CVAMS600 BDY(WORD)CHAR(4)INIT('600I');                       0758
*                                                                  0758
*/*                                                                  */
*/*  IST602I VVVVVVVV FAILED ID=XXXXXXXX - HIGHER NODE HAS BECOME  0759
*       INACTIVE                                                     */
*                                                                  0759
*   DCL                                                            0759
*     CVAMS602 BDY(WORD)CHAR(4)INIT('602I');                       0759
*                                                                  0759
*/*                                                                  */
*/*  IST603I UNABLE TO OPEN XXXXXXXX - COMMAND CONTINUES             */
*                                                                  0760
*   DCL                                                            0760
*     CVAMS603 BDY(WORD)CHAR(4)INIT('603I');                       0760
*                                                                  0760
*/*                                                                  */
*/*  IST606I VARY FAILED FOR ID=XXXXXXXX - I/O ERROR                 */
*                                                                  0761
*   DCL                                                            0761
*     CVAMS606 BDY(WORD)CHAR(4)INIT('606I');                       0761
*                                                                  0761
*/*                                                                  */
*/*  IST607I VARY FAILED FOR ID=XXXXXXXX - INVALID NODE TYPE         */
*                                                                  0762
*   DCL                                                            0762
*     CVAMS607 BDY(WORD)CHAR(4)INIT('607I');                       0762
*                                                                  0762
*/*                                                                  */
*/*  IST608I VARY FAILED FOR ID=XXXXXXXX - XXXXXXXX NOT ACTIVE       */
*                                                                  0763
*   DCL                                                            0763
*     CVAMS608 BDY(WORD)CHAR(4)INIT('608I');                       0763
*                                                                  0763
*/*                                                                  */
*/*  IST609I VARY FAILED FOR ID=XXXXXXXX - UNABLE TO PERFORM SYSTEM
*       ALLOCATION                                                   */
*                                                                  0764
*   DCL                                                            0764
*     CVAMS609 BDY(WORD)CHAR(4)INIT('609I');                       0764
*                                                                  0764
*/*                                                                  */
*/*  IST610I VARY FAILED FOR ID=XXXXXXXX - UNABLE TO SWITCH TO NCP   */
*                                                                  0765
*   DCL                                                            0765
*     CVAMS610 BDY(WORD)CHAR(4)INIT('610I');                       0765
*                                                                  0765
*/*                                                                  */
*/*  IST611I UNABLE TO ACTIVATE XXXXXXXX - CANNOT SWITCH TO NCP      */
*                                                                  0766
*   DCL                                                            0766
*     CVAMS611 BDY(WORD)CHAR(4)INIT('611I');                       0766
*                                                                  0766
*/*                                                                  */
*/*  IST612I VARY FAILED FOR ID=XXXXXXXX - ACTIVATE LINK REJECTED    */
*                                                                  0767
*   DCL                                                            0767
*     CVAMS612 BDY(WORD)CHAR(4)INIT('612I');                       0767
*                                                                  0767
*/*                                                                  */
*/*  IST613 UNABLE TO ACTIVATE XXXXXXXX - NODE INVALID               */
*                                                                  0768
*   DCL                                                            0768
*     CVAMS613 BDY(WORD)CHAR(4)INIT('613I');                       0768
*                                                                  0768
*/*                                                                  */
*/*  IST614I VARY FAILED FOR ID=XXXXXXXX - CLUSTER START ABORTED     */
*                                                                  0769
*   DCL                                                            0769
*     CVAMS614 BDY(WORD)CHAR(4)INIT('614I');                       0769
*                                                                  0769
*/*                                                                  */
*/*   IST615I VARY FAILED FOR ID=XXXXXXXX - HIGHER NODE INACTIVATE IN
*       PROGRESS                                                     */
*                                                                  0770
*   DCL                                                            0770
*     CVAMS615 BDY(WORD)CHAR(4)INIT('615I');                       0770
*                                                                  0770
*/*                                                                  */
*/*   IST616I UNABLE TO PERFORM LOGON FOR XXXXXXXX - COMMAND CONTINUES
*                                                                    */
*                                                                  0771
*   DCL                                                            0771
*     CVAMS616 BDY(WORD)CHAR(4)INIT('616I');                       0771
*                                                                  0771
*/*                                                                  */
*/*   IST629I UNABLE TO ACTIVATE NODE XXXXXXXX - VARY DEACTIVATE   0772
*       PENDING,COMMAND CONTINUES                                    */
*   DCL                                                            0772
*     CVAMS629 BDY(WORD)CHAR(4)INIT('629I');                /*D31LKDQ*/
*                                                                  0772
*/*                                                                  */
*/*   IST630I UNABLE TO ACTIVATE NODE XXXXXXXX - IO ERROR,COMMAND  0773
*       CONTINUES                                                    */
*   DCL                                                            0773
*     CVAMS630 BDY(WORD)CHAR(4)INIT('630I');                /*D31LKDQ*/
*                                                                  0773
*/*                                                                  */
*/*    IST631I UNABLE TO ACTIVATE LINK XXXXXXXX - IO ERROR           */
*   DCL                                                            0774
*     CVAMS631 BDY(WORD)CHAR(4)INIT('631I');                /*D31LKDQ*/
*                                                                  0774
*/*                                                          @D32CKDQ*/
*/*   IST673I VARY FAILED - NO CUA FOR ID XXXXXXXX           @D32CKDQ*/
*   DCL                                                            0775
*     CVAMS673 BDY(WORD)CHAR(4)INIT('673I');               /*@D32CKDQ*/
*/*                                                          @D32CKDQ*/
*/*   IST688I VARY FAILED FOR ID=XXXXXXXX - INSUFFICIENT STORAGE     */
*   DCL                                                            0776
*     CVAMS688 BDY(WORD)CHAR(4)INIT('688I');               /*@D32CKDQ*/
*                                                                  0776
*                                                                  0777
*   /*****************************************************************/
*   /*                                                               */
*   /* SAVE CALLER'S REGS IN THE WORKAREA, DECREMENT REG 13 BY 72 TO */
*   /* POINT TO THIS ROUTINE'S REGISTER SAVE AREA IN THE WORKAREA,   */
*   /* CHAIN THE SAVE AREAS, RESET LOCAL SWITCHES IN THE WORKAREA,   */
*   /* PROCEED WITH PROCESSING.                                      */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0777
*   RFY                                                            0777
*     CVAR7 RSTD;                                                  0777
*                                                                  0777
*    DO;                                                           0778
*/***  CRRMAINT  PROCNM(ISTINCVA)COMP(VY)FUNC(SUB)RPHADD((NCSPLRPH))  *
**/                                                                0779
*                                                                  0779
*/* ATBUILD (ISTRPH,ISTCRA,ISTPFCRR,ISTVYCRR)  */                  0779
*/* END OF ATBUILD */                                              0779
*    /*** SET ENTERED BIT FOR THIS PROCEDURE ***/                  0779
*NCSPLRPH->RPHCRR->CRACRR->NINCVA = '1'B;                          0779
         L     @15,NCSPLRPH(,CVAR1)                                0779
         L     @15,RPHCRR(,@15)                                    0779
         L     @15,CRACRR(,@15)                                    0779
         OI    NINCVA(@15),B'00000010'                             0779
*    /*** CLEAR AND SET CURRENT PROCEDURE BIT ***/                 0780
*NCSPLRPH->RPHCRR->CRACRR->VYCCRT = '0'B;                          0780
         XC    VYCCRT+1(11,@15),VYCCRT+1(@15)                      0780
         MVI   VYCCRT(@15),B'00000000'                             0780
*NCSPLRPH->RPHCRR->CRACRR->CINCVA = '1'B;                          0781
         OI    CINCVA(@15),B'00000010'                             0781
*    END;                                                          0782
*   GEN REFS(CVAWAPTR);                                            0783
      USING  @DATD,CVAWAPTR
*   CVAR7=CVAR13;                   /* SAVE CALLER'S SAVE AREA     0784
*                                      ADDRESS                       */
         LR    CVAR7,CVAR13                                        0784
*   CVAR13=CVAR13-(LENGTH(CVASVARA));/* DECREMENT R13 BY 72          */
         SL    CVAR13,@CF01519                                     0785
*   CVASVBKP=CVAR7;                 /* CHAIN CALLER'S SAVE AREA TO 0786
*                                      THIS ROUTINE'S                */
         ST    CVAR7,CVASVBKP(,CVAR13)                             0786
*   CVASVFWP=0;                     /* ZERO THIS RTNS SAVEAREA     0787
*                                      FORWARD PTR                   */
         SLR   @15,@15                                             0787
         ST    @15,CVASVFWP(,CVAR13)                               0787
*   CVAR7->CVASVFWP=CVAR13;         /* CHAIN THIS ROUTINES'S SAVE  0788
*                                      AREA TO CALLER'S              */
         ST    CVAR13,CVASVFWP(,CVAR7)                             0788
*   CVAWAPTR=CVAR1->NCSPLWKA->CVAWKA;/* GET WORKAREA ADDRESS         */
         L     @05,NCSPLWKA(,CVAR1)                                0789
         L     CVAWAPTR,CVAWKA(,@05)                               0789
*   CVAWKA=CVAWAPTR+@SIZDATD+(CVA8-(@SIZDATD//CVA8));    /* RESET NEXT
*                               AVAILABLE WORKAREA ADDRESS   @D32CKC8*/
         L     @04,@SIZDATD                                        0790
         LR    @00,CVAWAPTR                                        0790
         ALR   @00,@04                                             0790
         ST    @05,@TF00001                                        0790
         SRDA  @04,32                                              0790
         D     @04,@CF00094                                        0790
         LCR   @04,@04                                             0790
         AL    @04,@CF00094                                        0790
         ALR   @00,@04                                             0790
         L     @05,@TF00001                                        0790
         ST    @00,CVAWKA(,@05)                                    0790
*   NCSPLPTR=CVAR1;                 /* ESTABLISH NCSPL BASE ADR      */
         LR    NCSPLPTR,CVAR1                                      0791
*   CVASWTCH=0;                     /* INITIALIZE ALL SWITCHES       */
         STCM  @15,7,CVASWTCH                                      0792
*   CVAVARY='VARY    ';              /* INITIALIZE 'VARY' MESSAGE  0793
*                                       VARIABLE                     */
         MVC   CVAVARY(8),@CC05438                                 0793
*   CVANAME1=NCSPLRID;               /* INITIALIZE MESSAGE VARIABLE
*                                       TO THE COMMAND NODENAME      */
         MVC   CVANAME1(8),NCSPLRID(CVAR1)                         0794
*   RFY                                                            0795
*     CVAR7 UNRSTD;                                                0795
*   RFY                                                            0796
*     ISTNCSPL BASED(NCSPLPTR);     /* NEW BASE FOR NCSPL            */
*       RDTEPTR=NCSPLRPT;           /* GET PTR TO COMMAND RDTE       */
         L     @15,NCSPLRPT(,NCSPLPTR)                             0797
         ST    @15,RDTEPTR                                         0797
*       IF(NCSPL2IN='1'B&NCSPLEBN='1'B)×NCSPL2IN='0'B/* THIS THE   0798
*                                      SECOND ENTRY TO CVA AND ENTRY
*                                      FROM BOUNDRY NODE OR THIS THE
*                                      FIRST ENTRY TO CVA?           */
*         THEN                      /* YES -                         */
         TM    NCSPL2IN(NCSPLPTR),B'10100000'                      0798
         BO    @RT00798                                            0798
         TM    NCSPL2IN(NCSPLPTR),B'10000000'                      0798
         BNZ   @RF00798                                            0798
@RT00798 DS    0H                                                  0799
*            /*SEGMENT(CVASR20)REQUEST*/DO;GOTO CVASR20;CVASR20#:END;
         B     CVASR20                                             0800
*       ELSE                        /* THIS IS NOT THE SECOND ENTRY
*                                      OR ENTRY FROM BOUNDRY NODE    */
*         DO;                                                      0802
         B     @RC00798                                            0802
@RF00798 DS    0H                                                  0803
*           CVAGOSW='1'B;           /* SET GO SWITCH ON              */
*           CVANEWSG=CVAON;         /* SET NEW SEGMENT SWITCH ON     */
         OI    CVAGOSW,B'11000000'                                 0804
*            /* OPEN THE C/R DATA SET FOR THIS RDT SEGMENT   @X50BHC8*/
*                                                                  0805
*/*CRIO  FUNC(OPEN)RDT((RDTEPTR))PROCNM(ISTINCVA)*/                0805
*            DO;                                                   0805
*            RFY (GPR01P,GPR15P) RSTD;                             0806
*            NCSCRDTE = RDTEPTR;                                   0807
         L     @07,RDTEPTR                                         0807
         ST    @07,NCSCRDTE(,NCSPLPTR)                             0807
*            NCSCRCMD = NCSCROPN;                                  0808
         MVI   NCSCRCMD(NCSPLPTR),X'01'                            0808
*            GPR01P = ADDR(ISTNCSPL);                              0809
         LR    GPR01P,NCSPLPTR                                     0809
*            CALL ISTINCR5;                                        0810
*                                                                  0810
         L     @15,@CV05443                                        0810
         BALR  @14,@15                                             0810
*            DO;                                                   0811
*/***  CRRMAINT  RPHADD((NCSPLRPH))PROCNM(ISTINCVA)COMP(VY)FUNC(RET)  *
**/                                                                0812
*            /*** CLEAR AND SET CURRENT PROCEDURE BIT ***/         0812
*NCSPLRPH->RPHCRR->CRACRR->VYCCRT = '0'B;                          0812
         L     @07,NCSPLRPH(,NCSPLPTR)                             0812
         L     @07,RPHCRR(,@07)                                    0812
         L     @07,CRACRR(,@07)                                    0812
         XC    VYCCRT+1(11,@07),VYCCRT+1(@07)                      0812
         MVI   VYCCRT(@07),B'00000000'                             0812
*NCSPLRPH->RPHCRR->CRACRR->CINCVA = '1'B;                          0813
         OI    CINCVA(@07),B'00000010'                             0813
*            END;                                                  0814
*            RFY (GPR01P,GPR15P) UNRSTD;                           0815
*            END;                                                  0816
*            /* END OF CRIO EXPANSION */                           0817
*                                                          /*@X50BHC8*/
*           RFY CVAR15 RSTD;                               /*@X50BHC8*/
*           IF CVAR15=CVA0   /* WAS THE C/R DATA SET OPENED? @X50BHC8*/
*              THEN      /* C/R DATA SET WAS OPENED          @X50BHC8*/
         LTR   CVAR15,CVAR15                                       0818
         BNZ   @RF00818                                            0818
*                 IF RPRENTRY=RPRENTRN   /* CMD FOR AN RN?   @X50BHC8*/
*                    THEN      /* YES, SO PREPARE TO PROCESS THE CUA/
*                                    RNAME                   @X50BHC8*/
         L     @07,RDTEPTR                                         0819
         CLI   RPRENTRY(@07),X'01'                                 0819
         BNE   @RF00819                                            0819
*                       DO;                                /*@X50BHC8*/
*                         CVAR1=NCSPLPTR;  /* GET THE ADDRESS OF THE
*                                             NCSPL          @X50BHC8*/
         LR    CVAR1,NCSPLPTR                                      0821
*                         CALL ISTINCVN;                   /*@X50BHC8*/
*                                                                  0822
         L     @15,@CV05444                                        0822
         BALR  @14,@15                                             0822
*                          DO;                                     0823
*/***  CRRMAINT  PROCNM(ISTINCVA)COMP(VY)FUNC(RET)RPHADD((NCSPLRPH))  *
**/                                                                0824
*                          /*** CLEAR AND SET CURRENT PROCEDURE BIT ***
*NCSPLRPH->RPHCRR->CRACRR->VYCCRT = '0'B;                          0824
         L     @07,NCSPLRPH(,NCSPLPTR)                             0824
         L     @07,RPHCRR(,@07)                                    0824
         L     @07,CRACRR(,@07)                                    0824
         XC    VYCCRT+1(11,@07),VYCCRT+1(@07)                      0824
         MVI   VYCCRT(@07),B'00000000'                             0824
*NCSPLRPH->RPHCRR->CRACRR->CINCVA = '1'B;                          0825
         OI    CINCVA(@07),B'00000010'                             0825
*                          END;    /*@X50BHC8*/                    0826
*                         IF CVAR15=CVA0   /* WAS THE CUA/RNAME    0827
*                                              PROCESSED?    @X50BHC8*/
*                            THEN    /* YES, SO PREPARE TO UPDATE THE
*                                       PATH COUNT           @X50BHC8*/
         LTR   CVAR15,CVAR15                                       0827
         BNZ   @RF00827                                            0827
*                               DO;                        /*@X50BHC8*/
*                                 RFY CVAR15 UNRSTD;       /*@X50BHC8*/
*                 CVAWKRDT=RDTEPTR; /* INITIALIZE THE WORK REGISTER
*                                      FOR THE 370X PROCESSING     0830
*                                      SUBROUTINE                    */
         L     @15,RDTEPTR                                         0830
         LR    CVAWKRDT,@15                                        0830
*                 RPRPTHCT=RPRPTHCT+CVA1;/* INCREMENT THE PATH COUNT
*                                      OF THE RN                     */
         LA    @07,1                                               0831
         SLR   @00,@00                                             0831
         IC    @00,RPRPTHCT(,@15)                                  0831
         ALR   @07,@00                                             0831
         STC   @07,RPRPTHCT(,@15)                                  0831
*                 CALL CVASR080;    /* PROCESS 370X                  */
         BAL   @14,CVASR080                                        0832
*                 IF CVAGOSW=CVAON  /* GO SWITCH ON?                 */
*                   THEN             /*YES                   @D31LKDQ*/
         TM    CVAGOSW,B'10000000'                                 0833
         BNO   @RF00833                                            0833
*                     IF RRNRBREM=CVAOFF/*REMOTE?            @D31LKDQ*/
*                       THEN                                       0834
         L     @15,RDTEPTR                                         0834
         TM    RRNRBREM(@15),B'00000100'                           0834
         BNZ   @RF00834                                            0834
*                         CVASCV=CVAON; /* CVO DID SCV       @ZA13683*/
         OI    CVASCV,B'10000000'                                  0835
*                       ELSE;       /*REMOTE                 @D31LKDQ*/
@RF00834 DS    0H                                                  0837
*                 ELSE                                             0837
*                   DO;             /* GO SWITCH IS NOT ON -         */
         B     @RC00833                                            0837
@RF00833 DS    0H                                                  0838
*                     CALL CVATPMSG; /*OUTPUT CVOS MSG       @XA06943*/
         BAL   @14,CVATPMSG                                        0838
*                     NCSPLSOM=CVAON; /*SKIP LATER MSGOUTPUT @XA06943*/
         OI    NCSPLSOM(NCSPLPTR),B'01000000'                      0839
*                     CVAR1=NCSPLPTR;/* ADDR OF NCSPL IN REG1 FOR  0840
*                                      FREE SEGMENT                  */
         LR    CVAR1,NCSPLPTR                                      0840
*                     CALL ISTINCFS;/* GO FREE SEGMENT               */
*                                                                  0841
         L     @15,@CV05447                                        0841
         BALR  @14,@15                                             0841
*                      DO;                                         0842
*/***  CRRMAINT  PROCNM(ISTINCVA)COMP(VY)FUNC(RET)RPHADD((NCSPLRPH))  *
**/                                                                0843
*                      /*** CLEAR AND SET CURRENT PROCEDURE BIT ***/
*NCSPLRPH->RPHCRR->CRACRR->VYCCRT = '0'B;                          0843
         L     @15,NCSPLRPH(,NCSPLPTR)                             0843
         L     @15,RPHCRR(,@15)                                    0843
         L     @15,CRACRR(,@15)                                    0843
         XC    VYCCRT+1(11,@15),VYCCRT+1(@15)                      0843
         MVI   VYCCRT(@15),B'00000000'                             0843
*NCSPLRPH->RPHCRR->CRACRR->CINCVA = '1'B;                          0844
         OI    CINCVA(@15),B'00000010'                             0844
*                      END;                                        0845
*                   END;                                           0846
*               END;                                               0847
*                               ELSE   /* CUA/RNAME WAS NOT PROCESSED,
*                            SO RELEASE THE NEW RDT SEGMENT  @X50BHC8*/
*                                  DO;                     /*@X50BHC8*/
         B     @RC00827                                            0848
@RF00827 DS    0H                                                  0849
*                                    CALL ISTINCFS; /* FREE THE SEGMENT
*                                                            @X50BHC8*/
*                                                                  0849
         L     @15,@CV05447                                        0849
         BALR  @14,@15                                             0849
*                                     DO;                          0850
*/***  CRRMAINT  PROCNM(ISTINCVA)COMP(VY)FUNC(RET)RPHADD((NCSPLRPH))  *
**/                                                                0851
*                                     /*** CLEAR AND SET CURRENT PROCED
*RE BIT ***/                                                       0851
*NCSPLRPH->RPHCRR->CRACRR->VYCCRT = '0'B;                          0851
         L     @15,NCSPLRPH(,NCSPLPTR)                             0851
         L     @15,RPHCRR(,@15)                                    0851
         L     @15,CRACRR(,@15)                                    0851
         XC    VYCCRT+1(11,@15),VYCCRT+1(@15)                      0851
         MVI   VYCCRT(@15),B'00000000'                             0851
*NCSPLRPH->RPHCRR->CRACRR->CINCVA = '1'B;                          0852
         OI    CINCVA(@15),B'00000010'                             0852
*                                     END;  /*@X50BHC8*/           0853
*                                    CVAGOSW=CVAOFF; /* TURN OFF GO
*                                                    SWITCH  @X50BHC8*/
         NI    CVAGOSW,B'01111111'                                 0854
*                                    END;                  /*@X50BHC8*/
*                       END;  /* END ENTRY AN RN             @X50BHC8*/
*           ELSE                    /* NO -NOT A RN-CONTINUE         */
*             IF RPRENTRY=RPRENTLH  /* IS CMD RDTE A LOCAL SEGMENT?  */
*               × RPRENTRY=RPRENTSW /*OR SWITCHED SUBAREA    @D32CKDQ*/
*               THEN                /* YES- INCREMENT PATH COUNTS IN
*                                      THE LC OR PU ENTRIES  @D32CKDQ*/
         B     @RC00819                                            0857
@RF00819 L     @15,RDTEPTR                                         0857
         CLI   RPRENTRY(@15),X'03'                                 0857
         BE    @RT00857                                            0857
         CLI   RPRENTRY(@15),X'04'                                 0857
         BNE   @RF00857                                            0857
@RT00857 DS    0H                                                  0858
*               DO;                                                0858
*                 RFY                                              0859
*                   ISTRPRE BASED(CVAWKRDT);                       0859
*                 CVAWKRDT=RDTEPTR; /* INITIALIZE THE WORK REG       */
         L     CVAWKRDT,RDTEPTR                                    0860
*                 DO WHILE RPRENTED^=CVAON;/* PROCESS UNTIL THE LAST
*                                      ENTRY IS FOUND                */
         B     @DE00861                                            0861
@DL00861 DS    0H                                                  0862
*                   CVAWKRDT=CVAWKRDT+RPRELEN;/* INDEX TO THE NEXT 0862
*                                      ENTRY                 @D32CKDQ*/
         AH    CVAWKRDT,RPRELEN(,CVAWKRDT)                         0862
*                   IF RPRENTRY=RPRENTLC/* LOCAL ENTRY?              */
*                     × RPRENTRY=RPRENTCC /*OR PU ENTRY      @D32CKDQ*/
*                     THEN                                         0863
         CLI   RPRENTRY(CVAWKRDT),X'45'                            0863
         BE    @RT00863                                            0863
         CLI   RPRENTRY(CVAWKRDT),X'71'                            0863
         BNE   @RF00863                                            0863
@RT00863 DS    0H                                                  0864
*                     RPRPTHCT=RPRPTHCT+CVA1;/* YES-INCREMENT PATH 0864
*                                      COUNT                         */
         LA    @15,1                                               0864
         SLR   @07,@07                                             0864
         IC    @07,RPRPTHCT(,CVAWKRDT)                             0864
         ALR   @15,@07                                             0864
         STC   @15,RPRPTHCT(,CVAWKRDT)                             0864
*                   ELSE                                           0865
*                     ;                                            0865
@RF00863 DS    0H                                                  0866
*                 END;                                             0866
@DE00861 TM    RPRENTED(CVAWKRDT),B'00000100'                      0866
         BNO   @DL00861                                            0866
*                 RFY                                              0867
*                   ISTRPRE BASED(RDTEPTR);                        0867
*               END;                                               0868
*             ELSE;                 /* NOT A LOCAL SEGMENT -         */
@RF00857 DS    0H                                                  0870
*              ELSE    /* C/R DATA SET WAS NOT OPENED, SO PERPARE TO
*                         FREE THE NEW RDT SEGMENT           @X50BHC8*/
*                 DO;                                      /*@X50BHC8*/
         B     @RC00818                                            0870
@RF00818 DS    0H                                                  0871
*                   CVAR1=NCSPLPTR;  /* GET THE ADDRESS OF THE NCSPL */
         LR    CVAR1,NCSPLPTR                                      0871
*                   CALL ISTINCFS;   /* FREE THE SEGMENT     @X50BHC8*/
*                                                                  0872
         L     @15,@CV05447                                        0872
         BALR  @14,@15                                             0872
*                    DO;                                           0873
*/***  CRRMAINT  PROCNM(ISTINCVA)COMP(VY)FUNC(RET)RPHADD((NCSPLRPH))  *
**/                                                                0874
*                    /*** CLEAR AND SET CURRENT PROCEDURE BIT ***/ 0874
*NCSPLRPH->RPHCRR->CRACRR->VYCCRT = '0'B;                          0874
         L     @15,NCSPLRPH(,NCSPLPTR)                             0874
         L     @15,RPHCRR(,@15)                                    0874
         L     @15,CRACRR(,@15)                                    0874
         XC    VYCCRT+1(11,@15),VYCCRT+1(@15)                      0874
         MVI   VYCCRT(@15),B'00000000'                             0874
*NCSPLRPH->RPHCRR->CRACRR->CINCVA = '1'B;                          0875
         OI    CINCVA(@15),B'00000010'                             0875
*                    END;          /*@X50BHC8*/                    0876
*                   CVAGOSW=CVAOFF;  /* TURN THE GO SWITCH OFF */  0877
         NI    CVAGOSW,B'01111111'                                 0877
*                 END;                                     /*@X50BHC8*/
*         END;                                                     0879
@RC00818 DS    0H                                                  0880
*   IF CVAGOSW^=CVAON               /* GO SWITCH SET?                */
*     THEN                                                         0880
@RC00798 TM    CVAGOSW,B'10000000'                                 0880
         BO    @RF00880                                            0880
*     DO;                           /* NO-SET ERROR AND FIRST TIME 0881
*                                      SWITCH ON                     */
*       CVAERRSW='1'B;              /* SET ERROR SW ON               */
*       CVAFRSTM='1'B;              /* SET FIRST TIME SW ON          */
         OI    CVAERRSW,B'00001100'                                0883
*     END;                                                         0884
*   ELSE                            /* YES-CONTINUE PROCESS          */
*     DO;                                                          0885
         B     @RC00880                                            0885
@RF00880 DS    0H                                                  0886
*       IF RPRENTRY=RPRHDTYP       /* COMND RDTE HDR ENTRY?  @D32CKDQ*/
*         THEN                                                     0886
         L     @15,RDTEPTR                                         0886
         CLC   RPRENTRY(1,@15),RPRHDTYP(@15)                       0886
         BNE   @RF00886                                            0886
*          DO;                                             /*@X50BHC8*/
*           IF CVANEWSG=CVAON  /* IS THIS A NEW SEGMENT?     @X50BHC8*/
*              THEN    /* YES, SO UPDATE THE C/R DATA SET    @X50BHC8*/
         TM    CVANEWSG,B'01000000'                                0888
         BNO   @RF00888                                            0888
*                 DO;                                      /*@X50BHC8*/
*                   NCSACTV=CVAON;  /* MARK THE C/R FLAG TO INDICATE A
*                                     CHANGE HAS TAKEN PLACE @X50BHC8*/
         OI    NCSACTV(NCSPLPTR),B'10000000'                       0890
*                   NCSAIMOD=CVAON; /* MARK THE C/R FLAG TO INDICATE
*                             THAT AN ACTIVATION HAS OCCURED @X50BHC8*/
*                                                                  0891
         OI    NCSAIMOD(NCSPLPTR),B'10000000'                      0891
*/*CRIO  FUNC(UPDATE)RDT((RDTEPTR))PROCNM(ISTINCVA)*/              0892
*                    DO;                                           0892
*                    RFY (GPR01P,GPR15P) RSTD;                     0893
*                    GPR15P = 0;                                   0894
         SLR   GPR15P,GPR15P                                       0894
*                    IF RDTEPTR->RPRCRCPT = '1'B                   0895
*                    THEN DO;                                      0895
         L     @07,RDTEPTR                                         0895
         TM    RPRCRCPT(@07),B'01000000'                           0895
         BNO   @RF00895                                            0895
*                    NCSCRDTE = RDTEPTR;                           0897
         ST    @07,NCSCRDTE(,NCSPLPTR)                             0897
*                    NCSCRCMD = NCSCRWR;                           0898
         MVI   NCSCRCMD(NCSPLPTR),X'00'                            0898
*                    GPR01P = ADDR(ISTNCSPL);                      0899
         LR    GPR01P,NCSPLPTR                                     0899
*                    CALL ISTINCR5;                                0900
*                                                                  0900
         L     @15,@CV05443                                        0900
         BALR  @14,@15                                             0900
*                    DO;                                           0901
*/***  CRRMAINT  RPHADD((NCSPLRPH))PROCNM(ISTINCVA)COMP(VY)FUNC(RET)  *
**/                                                                0902
*                    /*** CLEAR AND SET CURRENT PROCEDURE BIT ***/ 0902
*NCSPLRPH->RPHCRR->CRACRR->VYCCRT = '0'B;                          0902
         L     @07,NCSPLRPH(,NCSPLPTR)                             0902
         L     @07,RPHCRR(,@07)                                    0902
         L     @07,CRACRR(,@07)                                    0902
         XC    VYCCRT+1(11,@07),VYCCRT+1(@07)                      0902
         MVI   VYCCRT(@07),B'00000000'                             0902
*NCSPLRPH->RPHCRR->CRACRR->CINCVA = '1'B;                          0903
         OI    CINCVA(@07),B'00000010'                             0903
*                    END;                                          0904
*                    RFY (GPR01P,GPR15P) UNRSTD;                   0905
*                    END;                                          0906
*                    END;                                          0907
@RF00895 DS    0H                                                  0908
*                    /* END OF CRIO EXPANSION */                   0908
*                 END;                                     /*@X50BHC8*/
*              ELSE;                                       /*@X50BHC8*/
@RF00888 DS    0H                                                  0910
*         IF RPRENTED=CVAON         /* LAST ENTRY IN RDT?            */
*           THEN                    /* YES-                          */
         L     @15,RDTEPTR                                         0910
         TM    RPRENTED(@15),B'00000100'                           0910
         BNO   @RF00910                                            0910
*           CVAGOSW=CVAOFF;         /* SET GO SWITCH OFF             */
         NI    CVAGOSW,B'01111111'                                 0911
*         ELSE                      /* NOT LAST-SKIP OVER ENTRY      */
*          DO;                                                     0912
         B     @RC00910                                            0912
@RF00910 DS    0H                                                  0913
*           CVAWKRDT=RDTEPTR+RPRELEN;                              0913
         L     @15,RDTEPTR                                         0913
         LH    CVAWKRDT,RPRELEN(,@15)                              0913
         ALR   CVAWKRDT,@15                                        0913
*           CVASGMNT='1'B;          /* INDICATE PROCESSING A SEGMENT */
         OI    CVASGMNT,B'00010000'                                0914
*          END;                                                    0915
*           END;                                           /*@X50BHC8*/
*       ELSE                        /* NOT AN RN OR LH ENTRY -       */
*         DO;                                                      0917
         B     @RC00886                                            0917
@RF00886 DS    0H                                                  0918
*           CVAWKRDT=RDTEPTR;       /* PUT RDTE ADDR IN WORK REG     */
         L     CVAWKRDT,RDTEPTR                                    0918
*           CVAFRSTM=CVAON;         /* SET FIRST TIME SWITCH         */
         OI    CVAFRSTM,B'00001000'                                0919
*         END;                                                     0920
*       IF CVAGOSW=CVAON            /* GO SWITCH SET?                */
*         THEN                      /* YES - CONTINUE                */
@RC00886 TM    CVAGOSW,B'10000000'                                 0921
         BNO   @RF00921                                            0921
*         DO;                                                      0922
*           RFY                                                    0923
*             ISTRPRE BASED(CVAWKRDT);                             0923
*           CVAGOSW=CVAOFF;         /* CLEAR GO SWITCH               */
         NI    CVAGOSW,B'01111111'                                 0924
*               /*****************************************************/
*               /*                                                   */
*               /*     CVASR004  -  RDT LOOP                         */
*               /*                                                   */
*               /*****************************************************/
*           IF RPRENTRY=RPRENTTR    /* ENTRY A TERMINAL?             */
*             THEN                  /* YES-CHECK FOR LOCAL           */
         CLI   RPRENTRY(CVAWKRDT),X'80'                            0925
         BNE   @RF00925                                            0925
*             IF RPRNSNEA->RPRENTRY=RPRENTLC&RPRONLIN='0'B /* IS IT
*                                      ATTACHED TO A LOCAL CONTROLLER
*                                      AND INACTIVE?         @DM96230*/
*               THEN                /* YES-MODIFY THE COMMAND        */
         L     @15,RPRNSNEA(,CVAWKRDT)                             0926
         CLI   RPRENTRY(@15),X'45'                                 0926
         BNE   @RF00926                                            0926
         TM    RPRONLIN(CVAWKRDT),B'00001000'                      0926
         BNZ   @RF00926                                            0926
*               DO;                                                0927
*                 RDTEPTR=RPRNSNEA; /* SET CMD RDTE POINTER TO THE LC
*                                      ENTRY                         */
         ST    @15,RDTEPTR                                         0928
*                 NCSPLRPT=RPRNSNEA;/* SET THE RDTE POINTER IN THE 0929
*                                      NCSPL TO THE LC ENTRY         */
         ST    @15,NCSPLRPT(,NCSPLPTR)                             0929
*                 CVAWKRDT=RPRNSNEA;/* RESET THE WORK RDTE POINTER TO
*                                      THE LC ENTRY                  */
         LR    CVAWKRDT,@15                                        0930
*               END;                                               0931
*             ELSE;                 /* NOT ATTACHED TO A LOCAL     0932
*                                      CONTROLLER OR INACTIVE -      */
@RF00926 DS    0H                                                  0933
*           ELSE;                   /* NOT A TERMINAL -              */
@RF00925 DS    0H                                                  0934
*           CALL CVASR030;          /* PROCESS THE FIRST ENTRY       */
         BAL   @14,CVASR030                                        0934
*           IF CVAFRSTM='1'B&CVAERRSW='1'B /* ERROR FOUND WHILE    0935
*                                      PROCESSING THE COMMAND ENTRY? */
*            THEN;                  /* YES - DO NOT LOOP TO NEXT ENT */
         TM    CVAFRSTM,B'00001100'                                0935
         BO    @RT00935                                            0935
*           ELSE                                                   0937
*             CVALOOP1=CVAON;       /* SET LOOP 1 CONTROL SW ON - ERROR
*                                      WAS NOT FOUND IN THE 1ST ENTRY*/
         OI    CVALOOP1,B'01000000'                                0937
*           DO WHILE NCSPLNON^='1'B&(RDTEPTR->RPRENTRY=            0938
*                 RDTEPTR->RPRHDTYP×RDTEPTR->RPRENTRY=RPRENTLC)    0938
*                 &RPRENTED^='1'B&CVALOOP1=CVAON;/* PROCESS  @D32CKDQ
*                                      THE NEXT ENTRY IF THE SEGMENT
*                                      HAS NOT BEEN FREED, THE     0938
*                                      COMMAND WAS FOR A HDR OR LC ENT
*                                      THE LAST ENTRY WAS NOT      0938
*                                      PROCESSED, AND THE LOOP SWITCH
*                                      IS STILL ON                   */
@RT00935 B     @DE00938                                            0938
@DL00938 DS    0H                                                  0939
*             CVAWKRDT=CVAWKRDT+RPRELEN;/* GET NEXT ENTRY            */
         AH    CVAWKRDT,RPRELEN(,CVAWKRDT)                         0939
*             IF RPRENTRY<=RDTEPTR->RPRENTRY×CVAQUIT=CVAON/* NEXT  0940
*                                      ENTRY OF EQUAL OR LOWER TYPE
*                                      CODE OR THE QUIT SWITCH SET?  */
*               THEN                /* YES- SET                      */
         L     @15,RDTEPTR                                         0940
         CLC   RPRENTRY(1,CVAWKRDT),RPRENTRY(@15)                  0940
         BNH   @RT00940                                            0940
         TM    CVAQUIT,B'00001000'                                 0940
         BNO   @RF00940                                            0940
@RT00940 DS    0H                                                  0941
*               CVALOOP1=CVAOFF;    /* LOOP 1 SWTCH OFF              */
         NI    CVALOOP1,B'10111111'                                0941
*             ELSE                  /* NO -                          */
*               DO;                                                0942
         B     @RC00940                                            0942
@RF00940 DS    0H                                                  0943
*                 CVAFRSTM=CVAOFF;  /* SET FRST TME SW OFF           */
*                 CVAERRSW=CVAOFF;  /* MAKE SURE ERROR SWITCH IS OFF
*                                      PRIOR TO PROCESSING THE NEXT
*                                      ENTRY                         */
         NI    CVAFRSTM,B'11110011'                                0944
*                 CALL CVASR030;    /* PROCESS THE NEXT ENTRY        */
         BAL   @14,CVASR030                                        0945
*               END;                                               0946
*           END;                    /* END OF LOOP 1                 */
@RC00940 DS    0H                                                  0947
@DE00938 TM    NCSPLNON(NCSPLPTR),B'00001000'                      0947
         BO    @DC00938                                            0947
         L     @15,RDTEPTR                                         0947
         CLC   RPRENTRY(1,@15),RPRHDTYP(@15)                       0947
         BE    @GL00007                                            0947
         CLI   RPRENTRY(@15),X'45'                                 0947
         BNE   @DC00938                                            0947
@GL00007 TM    RPRENTED(CVAWKRDT),B'00000100'                      0947
         BO    @DC00938                                            0947
         TM    CVALOOP1,B'01000000'                                0947
         BO    @DL00938                                            0947
@DC00938 DS    0H                                                  0948
*               /*****************************************************/
*               /*    CVASR004  -  END                               */
*               /*****************************************************/
*           IF NCSPLNON='1'B×RDTEPTR->RPRENTRY^=RPRENTRN /* IF THE 0948
*                                      SEGMENT HAS BEEN FREED OR THE
*                                      COMMAND WAS NOT FOR A RN, EXIT*/
*             THEN                                                 0948
         TM    NCSPLNON(NCSPLPTR),B'00001000'                      0948
         BO    @RT00948                                            0948
         L     @15,RDTEPTR                                         0948
         CLI   RPRENTRY(@15),X'01'                                 0948
         BNE   @RT00948                                            0948
*             ;                                                    0949
*           ELSE                                                   0950
*             DO;                                                  0950
*               RFY                                                0951
*                 CVAR0 RSTD;                                      0951
*                                                                  0951
*               /*****************************************************/
*               /*                                                   */
*               /* LOCK THE RDT WHILE SEARCHING THE RDT ENTRIES FOR  */
*               /* REMOTE RNS THAT NEED TO BE SCHEDULED.             */
*               /*                                                   */
*               /*****************************************************/
*                                                                  0952
*               CVAR0=CVA4;                                        0952
         LA    CVAR0,4                                             0952
*               CALL CVASRLOC;                                     0953
         BAL   @14,CVASRLOC                                        0953
*               RFY                                                0954
*                 CVAR0 UNRSTD;                                    0954
*               RDTEPTR->RRNLCSIP='0'B;/* TURN OFF LOCAL RDT START IN
*                                      PROGRESS FLAG                 */
         L     @15,RDTEPTR                                         0955
         NI    RRNLCSIP(@15),B'11011111'                           0955
*               CVAWKRDT=RDTEPTR;   /* GET LOCAL RN SEGMENT ADDRESS  */
         LR    CVAWKRDT,@15                                        0956
*               RFY                                                0957
*                 ISTRTR BASED(CVAWKRDT);                          0957
*               RFY                                                0958
*                 ISTRIN BASED(CVAWKRDT);                          0958
*               DO WHILE RPRENTED^='1'B;/* LOOP UNTIL THE LAST ENTRY
*                                      IS PROCESSED                  */
         B     @DE00959                                            0959
@DL00959 DS    0H                                                  0960
*                 CVAWKRDT=CVAWKRDT+RPRELEN;/* GET THE NEXT ENTRY    */
         AH    CVAWKRDT,RPRELEN(,CVAWKRDT)                         0960
*           IF RPRENTRY=RPRENTIN & RINREMOT^=CVA0 &                0961
*              RINREMOT->RRNRPLPT^=CVA0      /* IS THIS            0961
*                                 ENTRY FOR A REMOTE RN AND IS THERE AN
*                                 ADDRESS IN THE REMOTE'S VARY PAB 0961
*                                 POINTER?                   @X50BHC8*/
*                THEN    /* YES, SO PREPARE TO POST THE RPH  @X50BHC8*/
         CLI   RPRENTRY(CVAWKRDT),X'82'                            0961
         BNE   @RF00961                                            0961
         SLR   @15,@15                                             0961
         L     @07,RINREMOT(,CVAWKRDT)                             0961
         CR    @07,@15                                             0961
         BE    @RF00961                                            0961
         L     @05,RRNRPLPT(,@07)                                  0961
         CR    @05,@15                                             0961
         BE    @RF00961                                            0961
*                       DO;                                /*@X50BHC8*/
*                         RFY CVAR2 RSTD;                  /*@X50BHC8*/
*                         CVAR2=RINREMOT->RRNRPLPT;  /* GET THE ADDRESS
*                                                    TO POST @X50BHC8*/
         LR    CVAR2,@05                                           0964
*                         CVAR1=NCSPLRPH;  /*GET THE ADDRESS OF THE RPH
*                                                            @X50BHC8*/
         L     CVAR1,NCSPLRPH(,NCSPLPTR)                           0965
*                         RINREMOT->RRNRPLPT=CVA0; /* CLEAR THE ADDRESS
*                                                            @X50BHC8*/
*                                                                  0966
         ST    @15,RRNRPLPT(,@07)                                  0966
*/*TPPOST  (CVAR2)  */                                             0967
*                          DO;                                     0967
*                                       /*DECLARE AND RESTRICT REGS*/
*                            RESPECIFY (GPR00F,GPR01F,GPR04F,GPR05F,
*                                      GPR06F,GPR14F,GPR15F) RSTD; 0968
*                                       /*0,1,4,5,6,14, AND 15   */
*                                                                  0969
*/* ATBUILD (ISTPAB,ISTDYPAB,ISTRPH)  */                           0969
*/* END OF ATBUILD */        GEN REFS(GPR01P,GPR02F,GPR06F)SETS(RPHWORK
*;                                                                 0969
        STM GPR02F,GPR06F,RPHWORK(GPR01P)
*                            GPR04F=CVAR2;                         0970
         LR    GPR04F,CVAR2                                        0970
*                                       /*LOAD RPH PNTR INTO REG 4*/
*                            RFY GPR03F RSTD;                      0971
*                            GPR03F=0;                             0972
*                                                                  0972
         SLR   @07,@07                                             0972
         LR    GPR03F,@07                                          0972
*                          DO; /*MODESET  SAVEKEY(GPR06F) KEYADDR(GPR03
*) WORKREG(GPR05F)*/         RESPECIFY (GPR02F) RESTRICTED;        0973
*                            GPR05F = GPR02F; /*SAVE REGISTER 2*/  0975
         LR    GPR05F,GPR02F                                       0975
*                            IPK; /*SAVE CURRENT PSW KEY*/         0976
         IPK                                                       0976
*                            GPR06F = GPR02F;                      0977
         LR    GPR06F,GPR02F                                       0977
*                            GPR02F = GPR05F; /*RESTORE REGISTER 2*/
         LR    GPR02F,GPR05F                                       0978
*                            SPKA (GPR03F); /*SET PSW KEY*/        0979
         SPKA  0(GPR03F)                                           0979
*                            RESPECIFY (GPR02F) UNRESTRICTED;      0980
*                          END; /*MODESET  SAVEKEY(GPR06F) KEYADDR(GPR0
*F) WORKREG(GPR05F)*/        RFY GPR03F UNRSTD;                    0981
*                            GPR05P=GPR04P->RPHMAJCB+GPR04P->RPHPABOF;
         L     GPR05P,RPHMAJCB-1(,GPR04P)                          0983
         LA    GPR05P,0(,GPR05P)                                   0983
         SLR   @03,@03                                             0983
         IC    @03,RPHPABOF(,GPR04P)                               0983
         ALR   GPR05P,@03                                          0983
*                                       /*LOAD REG 5  WITH ADDR OF*/
*                                       /*MAJOR CONTROL BLOCK PLUS*/
*                                       /*OFFSET OF PAB IN BLOCK  */
*                            GPR14P=0;  /*LOAD 0 INTO REG 14      */
         LR    GPR14P,@07                                          0984
*                            GPR15P='FFFFFFFF'X;                   0985
         SLR   GPR15P,GPR15P                                       0985
         BCTR  GPR15P,0                                            0985
*                                       /*LOAD REG 15 WITH DUMMY  */
*                                       /*ADDRESS                 */
*                            CS (GPR14P,GPR15P,GPR04P->RPHRESMA);  0986
         CS    GPR14P,@15,RPHRESMA(GPR04P)                         0986
*                                       /*COMPARE RESUME ADDRESS  */
*                                       /*WITH 0 AND,IF EQUAL, PUT*/
*                                       /*DUMMY ADDRESS IN CONTROL*/
*                                       /*BLOCK RESUME ADDRESS    */
*                            BC (8,FMZT0025);                      0987
         BC    8,FMZT0025                                          0987
*                                       /*IF EQUAL, BYPASS REMAINDER*/
*                                       /*OF EXPANSION              */
*FMZL0025:                   IF GPR04P->RPHWT='1'B THEN            0988
FMZL0025 TM    RPHWT(GPR04P),B'00001000'                           0988
         BNO   @RF00988                                            0988
*                                       /*WT/EXT CONTENTION FLAG ON */
*                            DO;        /*IN RPH                    */
*                              GPR14P=GPR04P->RPHRESMA×RPHWT1;     0990
         L     GPR14P,RPHRESMA(,GPR04P)                            0990
         O     GPR14P,@CF01355                                     0990
*                                       /*LOAD REG 14 WITH FLAG FIELD*/
*                                       /*AND MAKE CERTAIN WT/EXT    */
*                                       /*CONTENTION FLAG STILL ON   */
*                              GPR15P=GPR14P×RPHPT1;               0991
         LR    GPR15P,GPR14P                                       0991
         O     GPR15P,@CF01359                                     0991
*                                       /*LOAD REG 15 WITH FLAG FIELD*/
*                                       /*AND TURN POST FLAG ON      */
*                              CS (GPR14P,GPR15P,GPR04P->RPHRESMA);
         CS    GPR14P,@15,RPHRESMA(GPR04P)                         0992
*                                       /*COMPARE REG 14 WITH FLAG */
*                                       /*FIELD--IF WT/EXT BIT ON, */
*                                       /*TURN ON POST FLAG        */
*                              BC (4,FMZL0025);                    0993
         BC    4,FMZL0025                                          0993
*                                       /*IF WT/EXT BIT WAS OFF, LOOP*/
*                                       /*TO TEST CONTENTION FLAG    */
*                              BC (8,FMZT0025);                    0994
         BC    8,FMZT0025                                          0994
*                                       /*IF WT/EXT BIT WAS OFF,     */
*                                       /*BRANCH TO BYPASS CODE GEN  */
*                            END;       /*IF POST FLAG IS ON, FALL*/
*                                       /*THRU BOTTOM OF LOOP     */
*                            ELSE;      /*WT/EXT CONTENTION FLAG OFF*/
@RF00988 DS    0H                                                  0997
*                            IF GPR04P->RPHTSKID=GPR01P->RPHTSKID  0997
*                            THEN DO;                              0997
         CLC   RPHTSKID(4,GPR04P),RPHTSKID(GPR01P)                 0997
         BNE   @RF00997                                            0997
*                              GPR05P->PABCHNGP=GPR01P->RPHPABQP;  0999
         MVC   PABCHNGP(3,GPR05P),RPHPABQP(GPR01P)                 0999
*                                       /*PUT PAB QUEUE ADDRESS*/  1000
*                                       /*IN SECOND WORD OF PAB     */
*                              GPR01P->RPHPABQP=GPR05P;            1000
         STCM  GPR05P,7,RPHPABQP(GPR01P)                           1000
*                                       /*PUT PAB ADDRESS (IN MAJOR */
*                                       /*CONTROL BLOCK) IN PAB */ 1001
*                                       /*QUEUE ADRESS IN RPH    */
*                              END;                                1001
*                            ELSE DO;                              1002
         B     @RC00997                                            1002
@RF00997 DS    0H                                                  1003
*                              GPR00F=0;/*SET REG 0 TO INDICATE ENA*/
*                                                                  1003
         SLR   GPR00F,GPR00F                                       1003
*                          DO; /* LISATCVT CVTBASE(PAGEABLE,(GPR15P)) *
*                            GPR15P = ATCLCPTR; /*SET UP ATCVT POINTER*
         L     GPR15P,ATCLCPTR                                     1005
*                          END; /*LISATCVT*/                       1006
*                                       /*PUT POINTER TO ATCVT IN */
*                                       /*  IN REG 15             */
*                              CALL GPR15P->ATCAP32;               1007
         L     @07,ATCAP32(,GPR15P)                                1007
         LR    @15,@07                                             1007
         BALR  @14,@15                                             1007
*                                       /* CALL ISTAPC32: TPSCHED */
*                              END;                                1008
*FMZT0025:                                                         1009
*                          DO; /*MODESET  KEYADDR(GPR06F) WORKREG(GPR05
*)*/                         GPR05F = GPR06F; /*GET KEY FORM SAVE LOCAT
*ON*/                        SPKA (GPR05F); /*SET PSW KEY*/        1009
@RC00997 DS    0H                                                  1009
FMZT0025 DS    0H                                                  1010
         LR    GPR05F,GPR06F                                       1010
         SPKA  0(GPR05F)                                           1011
*                          END; /*MODESET  KEYADDR(GPR06F) WORKREG(GPR0
*F)*/                        GEN REFS(GPR04P,                      1012
*                            RPHWORK)                              1013
*                                SETS(GPR02F,GPR03F,               1013
*                                      GPR04F,GPR05F,GPR06F);      1013
        LM GPR02F,GPR06F,RPHWORK(GPR01P)
*                            RESPECIFY (GPR00F,GPR01F,GPR04F,GPR05F,GPR
*6F,                         GPR14F,GPR15F) UNRSTD;                1014
*                                       /*UNRESTRICT REGS 0,1,    */
*                                       /*4,5,14, AND 15          */
*                          END;  /****END OF TPPOST GENERATION****/
*            /*@X50BHC8*/                                          1016
*                       END;                               /*@X50BHC8*/
*                    ELSE;                                 /*@X50BHC8*/
@RF00961 DS    0H                                                  1018
*               END;                                               1018
@DE00959 TM    RPRENTED(CVAWKRDT),B'00000100'                      1018
         BNO   @DL00959                                            1018
*               RFY                                                1019
*                 CVAR0 RSTD;                                      1019
*                                                                  1019
*               /*****************************************************/
*               /*                                                   */
*               /* RELEASE THE RDT SEGMENT LOCK:                     */
*               /*                                                   */
*               /*****************************************************/
*                                                                  1020
*               CVAR0=CVA14;                                       1020
         LA    CVAR0,14                                            1020
*               CALL CVASRLOC;                                     1021
         BAL   @14,CVASRLOC                                        1021
*               RFY                                                1022
*                 CVAR0 UNRSTD;                                    1022
*               RFY                                                1023
*                 ISTRTR BASED(RDTEPTR);                           1023
*               RFY                                                1024
*                 ISTRIN BASED(RDTEPTR);                           1024
*             END;                                                 1025
*         END;                                                     1026
*       ELSE                                                       1027
*         ;                         /* GO SWITCH NOT SET-EXIT        */
@RF00921 DS    0H                                                  1028
*     END;                                                         1028
@RC00921 DS    0H                                                  1029
*   IF CVAFRSTM=CVAON&CVAERRSW=CVAON/* ERROR FOUND IN FIRST ENTRY?   */
*     THEN                                                         1029
@RC00880 TM    CVAFRSTM,B'00001100'                                1029
         BNO   @RF01029                                            1029
*     IF NCSPLSOM=CVAON             /*SUPPRESS MSG           @XA06943*/
*       THEN;                       /*SKIP                   @XA06943*/
         TM    NCSPLSOM(NCSPLPTR),B'01000000'                      1030
         BO    @RT01030                                            1030
*       ELSE CALL CVATPMSG;         /*OUTPUT MSG             @XA06943*/
         BAL   @14,CVATPMSG                                        1032
*   ELSE                            /* ERROR NOT FOUND IN FIRST ENTRY*/
*     IF NCSPLSOM='1'B              /* NCSPL INDICATE SUPPRESS     1033
*                                      OPERATOR MESSAGES?            */
*       THEN                                                       1033
         B     @RC01029                                            1033
@RF01029 TM    NCSPLSOM(NCSPLPTR),B'01000000'                      1033
         BO    @RT01033                                            1033
*       ;                           /* YES - EXIT                    */
*     ELSE                                                         1035
*       DO;                                                        1035
*               /*****************************************************/
*               /*                                                   */
*               /*   CVASR005  -  NORMAL END                         */
*               /*                                                   */
*               /*****************************************************/
*         IF NCSPLNON='1'B          /* HAS THE SEGMENT BEEN FREED?   */
*           THEN                                                   1036
         TM    NCSPLNON(NCSPLPTR),B'00001000'                      1036
         BO    @RT01036                                            1036
*           ;                       /* YES - DO NOT PROCESS FOR    1037
*                                      SIMLOGONS                     */
*         ELSE                                                     1038
*           IF RDTEPTR->RPRENTRY=RDTEPTR->RPRHDTYP                 1038
*                                   /* WAS THE COMMAND FOR A HDR   1038
*                                      ENTRY                 @D32CKDQ*/
*             THEN                                                 1038
         L     @15,RDTEPTR                                         1038
         CLC   RPRENTRY(1,@15),RPRHDTYP(@15)                       1038
         BNE   @RF01038                                            1038
*             CALL CVASR041;        /* YES - PROCESS SIMLOGONS FOR THE
*                                      WHOLE SEGMENT                 */
         BAL   @14,CVASR041                                        1039
*           ELSE                                                   1040
*             ;                     /* NOT AN RN OR LH - DO NOT    1040
*                                      PROCESS SIMLOGON              */
@RF01038 DS    0H                                                  1041
*         IF CVAFRSTM=CVAON&CVALRDYA=CVAON/* FIRST TIME AND ALREADY
*                                      ACTIVE SWITCH ON?             */
*           THEN                    /* YES-OUTPUT 'ALREADY ACTIVE' 1041
*                                      MSG                           */
@RT01036 TM    CVAFRSTM,B'00101000'                                1041
         BNO   @RF01041                                            1041
*           CVAMSID@=ADDR(CVAMS067);                               1042
         LA    @15,CVAMS067                                        1042
         ST    @15,CVAMSID@                                        1042
*         ELSE                      /* NO-OUTPUT 'ACTIVE' MSG        */
*           CVAMSID@=ADDR(CVAMS093);/* GET 'ACTIVE' MSG ADDR         */
         B     @RC01041                                            1043
@RF01041 LA    @15,CVAMS093                                        1043
         ST    @15,CVAMSID@                                        1043
*         CVANAME1=NCSPLRID;        /* RESET MESSAGE VARIABLE TO   1044
*                                      COMMAND NODENAME JUST IN CASE
*                                      IT WAS OVERLAID               */
@RC01041 MVC   CVANAME1(8),NCSPLRID(NCSPLPTR)                      1044
*         CVAMSG=ADDR(CVANAME1);    /* ADDR NODENAME FOR MSG         */
         LA    @15,CVANAME1                                        1045
         ST    @15,CVAMSG                                          1045
*         CALL CVATPMSG;            /* GO OUTPUT MESSAGE             */
         BAL   @14,CVATPMSG                                        1046
*       END;                                                       1047
*               /*****************************************************/
*               /*    CVASR005  -  END                               */
*               /*****************************************************/
*   RFY                                                            1048
*     ISTRPRE BASED(RDTEPTR);                                      1048
@RT01033 DS    0H                                                  1048
@RC01029 DS    0H                                                  1049
*   IF CVALFDON='1'B×NCSPLLPT=0     /* IS THE LOGON DONE SWITCH ON OR
*                                      IS THE APPLICATION LOGON POINTER
*                                      ZERO?                         */
*     THEN;                         /* YES - EXIT                    */
         TM    CVALFDON,B'00000001'                                1049
         BO    @RT01049                                            1049
         L     @15,NCSPLLPT(,NCSPLPTR)                             1049
         LTR   @15,@15                                             1049
         BZ    @RT01049                                            1049
*     ELSE                                                         1051
*       DO;                                                        1051
*         RFY                                                      1052
*           CVAR0 RSTD;                                            1052
*                                                                  1052
*         /***********************************************************/
*         /*                                                         */
*         /* GET THE VOC LOCK                                        */
*         /*                                                         */
*         /***********************************************************/
*                                                                  1053
*         CVAR0=CVA0;                                              1053
         SLR   CVAR0,CVAR0                                         1053
*         CALL CVASRLOC;                                           1054
         BAL   @14,CVASRLOC                                        1054
*         CVAWKRDT=NCSPLLPT;        /* GET THE ADDRESS OF THE SIMLOGON
*                                      APPLICATION ENTRY             */
         L     CVAWKRDT,NCSPLLPT(,NCSPLPTR)                        1055
*         DO WHILE CVAWKRDT->RPRENTRY^=RPRENTAH;/* LOOK FOR THE    1056
*                                      APPLICATION HEADER ENTRY      */
         B     @DE01056                                            1056
@DL01056 DS    0H                                                  1057
*           CVAWKRDT=CVAWKRDT->RPRNSNEA;/* GET THE NEXT HIGHER NODE  */
         L     CVAWKRDT,RPRNSNEA(,CVAWKRDT)                        1057
*         END;                                                     1058
@DE01056 CLI   RPRENTRY(CVAWKRDT),X'02'                            1058
         BNE   @DL01056                                            1058
*         CVAWKRDT->RDTLGCT=CVAWKRDT->RDTLGCT-CVA1;/* DECREMENT THE
*                                      LOGON COUNT IN THE APPLICATION
*                                      HEADER                        */
*                                                                  1059
         SLR   @15,@15                                             1059
         IC    @15,RDTLGCT(,CVAWKRDT)                              1059
         BCTR  @15,0                                               1059
         STC   @15,RDTLGCT(,CVAWKRDT)                              1059
*         /***********************************************************/
*         /*                                                         */
*         /* RELEASE THE VOC LOCK                                    */
*         /*                                                         */
*         /***********************************************************/
*                                                                  1060
*         CVAR0=CVA10;                                             1060
         LA    CVAR0,10                                            1060
*         CALL CVASRLOC;                                           1061
         BAL   @14,CVASRLOC                                        1061
*         RFY                                                      1062
*           CVAR0 UNRSTD;                                          1062
*       END;                                                       1063
*   IF CVASCV=CVAON & NCSPLNON^=CVAON                              1064
*     THEN                          /*DID SET CONTRL VECTOR  @D31LKDQ*/
@RT01049 TM    CVASCV,B'10000000'                                  1064
         BNO   @RF01064                                            1064
         TM    NCSPLNON(NCSPLPTR),B'00001000'                      1064
         BO    @RF01064                                            1064
*     DO;                           /*RESET DELAY FACTORTO   @D31LKDQ
*                                      ORIGINAL              @D31LKDQ*/
*       CVAWKRDT=NCSPLRPT;          /*CMD RDTE LOCAL 370X    @D31LKDQ*/
         L     @15,NCSPLRPT(,NCSPLPTR)                             1066
         LR    CVAWKRDT,@15                                        1066
*       NCSPLRUO=ADDR(CVARUOUT);    /*OUTBOUND RU            @D31LKDQ*/
         LA    @07,CVARUOUT                                        1067
         ST    @07,NCSPLRUO(,NCSPLPTR)                             1067
*       NSSSVT5A=NCSPLRPT->RRNDELAY;/*ORIG VALUE             @D31LKDQ*/
         MVC   NSSSVT5A(2,@07),RRNDELAY(@15)                       1068
*       CALL CVASRSCV;              /*DO SET CONTROL VECTOR  @D31LKDQ*/
         BAL   @14,CVASRSCV                                        1069
*       END;                                               /*@D31LKDQ*/
*     ELSE;                                                /*@D31LKDQ*/
@RF01064 DS    0H                                                  1072
*   NCSVDEL=CVAON;                  /* INDICATE DELETE NCSPL         */
         OI    NCSVDEL(NCSPLPTR),B'01000000'                       1072
*   CVAWKA=CVAWAPTR;                /* RESET WORKAREA PTR            */
         L     @15,NCSPLWKA(,NCSPLPTR)                             1073
         ST    CVAWAPTR,CVAWKA(,@15)                               1073
*   CVAR13=CVASVBKP;                /* GET ADDR OF CALLER'S SAVEAREA
*                                      --                            */
         L     CVAR13,CVASVBKP(,CVAR13)                            1074
*   RETURN;                         /* RESTORE REGS AND EXIT         */
@EL00001 DS    0H                                                  1075
@EF00001 DS    0H                                                  1075
@ER00001 LM    @14,@12,12(@13)                                     1075
         BR    @14                                                 1075
*   GEN(  EJECT);                                                  1076
*                                                                  1076
           EJECT
*   /*****************************************************************/
*   /*                                                               */
*   /* COMMAND ENTRY SYNTAX CHECK SUBROUTINE                         */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1077
*    /*SEGMENT(CVASR20)START*/DO;GOTO CVASR20@;CVASR20:END;        1077
         B     CVASR20@                                            1078
CVASR20  DS    0H                                                  1080
*   IF RPRINV=CVAON                 /* ENTRY FLAGGED 'INVALID'       */
*     THEN                          /* YES-OUTPUT 'INVALID         1080
*                                      DEFINITION' MSG               */
         L     @15,RDTEPTR                                         1080
         TM    RPRINV(@15),B'01000000'                             1080
         BNO   @RF01080                                            1080
*     DO;                                                          1081
*       CVAMSID@=ADDR(CVAMS094);    /* GET ADDRESS OF 'INVALID     1082
*                                      DEFINITION' MSG ID            */
         LA    @15,CVAMS094                                        1082
         ST    @15,CVAMSID@                                        1082
*       CVAMSG=ADDR(CVANAME1);      /* ADDR NODENAME FOR MSG         */
         LA    @15,CVANAME1                                        1083
         ST    @15,CVAMSG                                          1083
*     END;                                                         1084
*   ELSE                            /* NOT INVALID -                 */
*     IF RPRVRYPD=CVAON             /* VARY PENDING?                 */
*       × (RPRENTRY=RPRENTRN & RRNLCDIP=CVAON) /*DEACT       @DA06008*/
*       THEN                        /* YES-OUTPUT 'DEACTIVATE'     1085
*                                      MESSAGE                       */
         B     @RC01080                                            1085
@RF01080 L     @15,RDTEPTR                                         1085
         TM    RPRVRYPD(@15),B'00000010'                           1085
         BO    @RT01085                                            1085
         CLI   RPRENTRY(@15),X'01'                                 1085
         BNE   @RF01085                                            1085
         TM    RRNLCDIP(@15),B'00001000'                           1085
         BNO   @RF01085                                            1085
@RT01085 DS    0H                                                  1086
*       DO;                                                        1086
*         CVAMSID@=ADDR(CVAMS073);  /* GET ADDRESS OF 'DEACTIVATE' MSG
*                                      ID                            */
         LA    @15,CVAMS073                                        1087
         ST    @15,CVAMSID@                                        1087
*         CVAMSG=ADDR(CVAVARY);     /* ADDR NODENAME FOR MSG         */
         LA    @15,CVAVARY                                         1088
         ST    @15,CVAMSG                                          1088
*       END;                                                       1089
*     ELSE                          /* VARY NOT PENDING -            */
*       IF RPRENTRY=RPRENTLN&RLNPORT=CVAON&NCSPLRID=RPTCTNM&RPTVRYPD=
*           CVAON                   /* IF THE COMMAND IS FOR THE   1090
*                                      CTERM PORTION OF A PORT AND 1090
*                                      THE PORT VARY PENDING BIT IS
*                                      ON, ISSUE AN ERROR MESSAGE    */
*         THEN                                                     1090
         B     @RC01085                                            1090
@RF01085 L     @15,RDTEPTR                                         1090
         CLI   RPRENTRY(@15),X'50'                                 1090
         BNE   @RF01090                                            1090
         TM    RLNPORT(@15),B'00010000'                            1090
         BNO   @RF01090                                            1090
         CLC   NCSPLRID(8,NCSPLPTR),RPTCTNM(@15)                   1090
         BNE   @RF01090                                            1090
         TM    RPTVRYPD(@15),B'01000000'                           1090
         BNO   @RF01090                                            1090
*         DO;                                                      1091
*           CVAMSID@=ADDR(CVAMS073);/* GET ADDRESS OF 'DEACTIVATE' MSG
*                                      ID                            */
         LA    @07,CVAMS073                                        1092
         ST    @07,CVAMSID@                                        1092
*           CVANAME1=RPTCTNM;       /* GET CTERM NAME FOR MSG        */
         MVC   CVANAME1(8),RPTCTNM(@15)                            1093
*           CVAMSG=ADDR(CVAVARY);   /* GET ADDRESS OF VARIABLES      */
         LA    @15,CVAVARY                                         1094
         ST    @15,CVAMSG                                          1094
*         END;                                                     1095
*       ELSE                        /* PORT VARY PENDING NOT SET -   */
*         IF RPRENTRY=RPRENTAH      /* APPLICATION HEADER BEING    1096
*                                      ACTIVATED AGAIN? ZTR5353      */
*           THEN                    /* YES - OUTPUT 'ALREADY ACTIVE'
*                                      MESSAGE                       */
         B     @RC01090                                            1096
@RF01090 L     @15,RDTEPTR                                         1096
         CLI   RPRENTRY(@15),X'02'                                 1096
         BNE   @RF01096                                            1096
*           DO;                                                    1097
*             CVAMSID@=ADDR(CVAMS067);/* GET ADDRESS OF 'ALREADY   1098
*                                      ACTIVE' MSG ID                */
         LA    @15,CVAMS067                                        1098
         ST    @15,CVAMSID@                                        1098
*             CVAMSG=ADDR(CVANAME1);                               1099
         LA    @15,CVANAME1                                        1099
         ST    @15,CVAMSG                                          1099
*           END;                                                   1100
*         ELSE                      /* NOT AN APPLICATION HEADER     */
*           IF RPRENTRY=RPRENTGP/* ENTRY A GROUP             @D32CKDQ*/
*             THEN                  /* YES-OUTPUT 'INVALID'MSG       */
         B     @RC01096                                            1101
@RF01096 L     @15,RDTEPTR                                         1101
         CLI   RPRENTRY(@15),X'30'                                 1101
         BNE   @RF01101                                            1101
*             DO;                                                  1102
*               CVAMSID@=ADDR(CVAMS600);/* GET ADDRESS OF 'INVALID' MSG
*                                       ID                           */
         LA    @15,CVAMS600                                        1103
         ST    @15,CVAMSID@                                        1103
*               CVAVARY6 = 'VARY  ';                       /*@ZA10946*/
         MVC   CVAVARY6(6),@CC05471                                1104
*               CVAMSG=ADDR(CVAVARY6); /*ADDR NODENAME       @ZA10946*/
         LA    @15,CVAVARY6                                        1105
         ST    @15,CVAMSG                                          1105
*             END;                                                 1106
*           ELSE                    /* NOT APPL OR GROUP             */
*         /***********************************************************/
*         /*                                                         */
*         /*    CVASR022   -  CHECK VARY PENDING                     */
*         /*                                                         */
*         /***********************************************************/
*             IF RPRENTRY=RPRHDTYP/* CMD ENTRY A HEADER      @D32CKDQ*/
*               THEN                                               1107
         B     @RC01101                                            1107
@RF01101 L     @15,RDTEPTR                                         1107
         CLC   RPRENTRY(1,@15),RPRHDTYP(@15)                       1107
         BNE   @RF01107                                            1107
*               CVAGOSW=CVAON;      /* YES - SET GO SWITCH ON        */
         OI    CVAGOSW,B'10000000'                                 1108
*             ELSE                                                 1109
*               DO;                                                1109
         B     @RC01107                                            1109
@RF01107 DS    0H                                                  1110
*                 CVAWKRDT=RDTEPTR; /* INITIALIZE WORK PTR TO THE CMD
*                                      ENTRY                         */
         L     CVAWKRDT,RDTEPTR                                    1110
*                 DO WHILE (CVAWKRDT->RPRENTRY^=                   1111
*                           CVAWKRDT->RPRHDTYP);/*LOOP UNTIL FIND  1111
*                                                  HEADER    @D32CKDQ*/
         B     @DE01111                                            1111
@DL01111 DS    0H                                                  1112
*                   CVAWKRDT=CVAWKRDT-CVAWKRDT->RPRPELEN;/*PREVIOUS
*                                                       NODE @D32CKDQ*/
         SH    CVAWKRDT,RPRPELEN(,CVAWKRDT)                        1112
*                   END;                                   /*@D32CKDQ*/
@DE01111 CLC   RPRENTRY(1,CVAWKRDT),RPRHDTYP(CVAWKRDT)             1113
         BNE   @DL01111                                            1113
*                 IF CVAWKRDT->RPRVRYPD=CVAON/* VARY PENDING SET IN
*                                      THE HIGHEST NODE?             */
*                   THEN            /* YES-OUTPUT DEACTIVATE IN    1114
*                                      PROGRESS MSG                  */
         TM    RPRVRYPD(CVAWKRDT),B'00000010'                      1114
         BNO   @RF01114                                            1114
*                   DO;                                            1115
*                     CVAMSID@=ADDR(CVAMS615);/* GET ADDRESS OF    1116
*                                      'VARY PENDING IN HIGHER NODE'
*                                      MSG ID                @DM14104*/
         LA    @15,CVAMS615                                        1116
         ST    @15,CVAMSID@                                        1116
*                     CVAMSG=ADDR(CVANAME1);                       1117
         LA    @15,CVANAME1                                        1117
         ST    @15,CVAMSG                                          1117
*                   END;                                           1118
*                 ELSE                                             1119
*                   CVAGOSW=CVAON;  /* HIGHEST ENTRY OK - SET GO   1119
*                                      SWITCH ON                     */
         B     @RC01114                                            1119
@RF01114 OI    CVAGOSW,B'10000000'                                 1119
*               END;                                               1120
@RC01114 DS    0H                                                  1121
*         /***********************************************************/
*         /*     CVASR022  -  END                                    */
*         /***********************************************************/
*    /*SEGMENT(CVASR20)FINISH*/DO;GOTO CVASR20#;CVASR20@:END;      1121
@RC01107 DS    0H                                                  1121
@RC01101 DS    0H                                                  1121
@RC01096 DS    0H                                                  1121
@RC01090 DS    0H                                                  1121
@RC01085 DS    0H                                                  1121
@RC01080 DS    0H                                                  1122
         B     CVASR20#                                            1122
CVASR20@ DS    0H                                                  1124
*   GEN(  EJECT);                                                  1124
           EJECT
*CVASR030:                                                         1125
*   PROC OPTIONS(NOSAVE NOSAVEAREA);                               1125
*                                                                  1125
         B     @PB00002                                            1125
CVASR030 DS    0H                                                  1126
*   /*****************************************************************/
*   /*                                                               */
*   /* PROCESS RDTE SUBROUTINE                                       */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1126
*   RFY                                                            1126
*     ISTRPRE BASED(CVAWKRDT);                                     1126
*   RFY                                                            1127
*     ISTRIN BASED(CVAWKRDT);                                      1127
*   RFY                                                            1128
*     ISTRTR BASED(CVAWKRDT);                                      1128
*   RFY                                                            1129
*     ISTRLC BASED(CVAWKRDT);                                      1129
*   RFY                                                            1130
*     ISTRPT BASED(CVAWKRDT);                                      1130
*   RFY                                                            1131
*     ISTRCL BASED(CVAWKRDT);                                      1131
*   RFY                                                            1132
*     ISTRLN BASED(CVAWKRDT);                                      1132
*   RFY                                                            1133
*     ISTRDS BASED(CVAWKRDT);                                      1133
*   CVARS030=CVAR14;                /* SAVE RETURN REG               */
         ST    CVAR14,CVARS030                                     1134
*   IF RPRVRYPD=CVAON               /* DEACTIVATE IN PROGRESS?       */
*     THEN                          /* YES-OUTPUT MSG                */
         TM    RPRVRYPD(CVAWKRDT),B'00000010'                      1135
         BNO   @RF01135                                            1135
*     DO;                                                          1136
*       CVAMSID@=ADDR(CVAMS629);    /* GET ADDRESS OF 'UNABLE TO   1137
*                                      ACTIVATE - VARY PENDING'    1137
*                                      MESSAGE ID           @D31LKDQ */
         LA    @15,CVAMS629                                        1137
         ST    @15,CVAMSID@                                        1137
*           CVANAME1=RPRNAME;       /* NODENAME FOR MSG              */
         MVC   CVANAME1(8),RPRNAME(CVAWKRDT)                       1138
*           CVAMSG=ADDR(CVANAME1);  /* GET ADDRESS OF VARIABLE       */
         LA    @15,CVANAME1                                        1139
         ST    @15,CVAMSG                                          1139
*           CALL CVATPMSG;          /* OUTPUT MSG                    */
         BAL   @14,CVATPMSG                                        1140
*     END;                                                         1141
*   ELSE                            /* DEACTIVATE NOT IN PROG        */
*    DO;                                                           1142
         B     @RC01135                                            1142
@RF01135 DS    0H                                                  1143
*     IF RPRONLIN=CVAON             /* ENTRY ALREADY ACTIVE?         */
*       THEN                        /* YES-CHECK FOR PORT ENTRY      */
         TM    RPRONLIN(CVAWKRDT),B'00001000'                      1143
         BNO   @RF01143                                            1143
*       IF RPRENTRY^=RPRENTLN×RLNPORT^='1'B×NCSPLRID=RPRNAME×      1144
*         RPTONLIN='1'B             /* IF THE ENTRY IS NOT A LINE, OR
*                                      IT IS NOT A PORT, OR THE COMMAND
*                                      IS FOR THE PORT'S LINE, OR THE
*                                      PORT ONLINE BIT IS ALREADY ON,
*                                      SET THE SKIP ENTRY SWITCH AND
*                                      ALREADY ACTIVE SWITCH ON      */
*           THEN                    /* YES-SET THE SKIPTERM SWITCH   */
         CLI   RPRENTRY(CVAWKRDT),X'50'                            1144
         BNE   @RT01144                                            1144
         TM    RLNPORT(CVAWKRDT),B'00010000'                       1144
         BNO   @RT01144                                            1144
         CLC   NCSPLRID(8,NCSPLPTR),RPRNAME(CVAWKRDT)              1144
         BE    @RT01144                                            1144
         TM    RPTONLIN(CVAWKRDT),B'00010000'                      1144
         BNO   @RF01144                                            1144
@RT01144 DS    0H                                                  1145
*           DO;                                                    1145
*             CVASKENT=CVAON;       /* SET SKIPTERM SWITCH ON        */
         OI    CVASKENT,B'10000000'                                1146
*             CVALRDYA=CVAON;       /* SET THE ALREADY ACTIVE SW     */
         OI    CVALRDYA,B'00100000'                                1147
*             IF RPRENTRY=RPRENTCC  /* THIS A CLUSTER CONTROLLER?    */
*               THEN                /* YES -                         */
         CLI   RPRENTRY(CVAWKRDT),X'71'                            1148
         BNE   @RF01148                                            1148
*                 CALL CVASRLGO;    /* GO SPIN OFF A SPECIAL LOGON   */
         BAL   @14,CVASRLGO                                        1149
*               ELSE;                                              1150
@RF01148 DS    0H                                                  1151
*           END;                                                   1151
*         ELSE;                                                    1152
@RF01144 DS    0H                                                  1153
*     ELSE                                                         1153
*       ;                           /* ENTRY NOT ALREADY ACTIVE      */
@RF01143 DS    0H                                                  1154
*   IF CVASKENT=CVAON               /* SKIP ENTRY SWITCH ON?         */
*     THEN                                                         1154
         TM    CVASKENT,B'10000000'                                1154
         BNO   @RF01154                                            1154
*       CVASKENT=CVAOFF;            /* YES-TURN OFF THE SKIP ENTRY 1155
*                                      SWITCH AND SKIP TESTS FOR ENTRY
*                                      TYPES                         */
         NI    CVASKENT,B'01111111'                                1155
*   ELSE                                                           1156
*    DO;                            /* START LOOKING FOR THE ENTRY 1156
*                                      TYPE                          */
         B     @RC01154                                            1156
@RF01154 DS    0H                                                  1157
*      RPRVIODN='0'B;               /* RESET VARY'S I/O DONE BIT OFF
*                                      JUST IN CASE IT IS ON         */
         NI    RPRVIODN(CVAWKRDT),B'11101111'                      1157
*                                                                  1158
*   /*****************************************************************/
*   /*                                                               */
*   /* GROUP?                                                        */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1158
*     IF RPRENTRY=RPRENTGP          /* IS WORK RDTE A GROUP?         */
*       THEN                        /* YES-ACTIVATE THE GROUP        */
         CLI   RPRENTRY(CVAWKRDT),X'30'                            1158
         BNE   @RF01158                                            1158
*       DO;                                                        1159
*         RPRONLIN=CVAON;           /* SET ONLINE BIT ON             */
         OI    RPRONLIN(CVAWKRDT),B'00001000'                      1160
*         RPRLIVE=CVAON;            /* SET LIVE BIT ON               */
         OI    RPRLIVE(CVAWKRDT),B'00000001'                       1161
*       END;                                                       1162
*     ELSE                                                         1163
*                                                                  1163
*   /*****************************************************************/
*   /*                                                               */
*   /* CLUSTER CONTROLLER?                                           */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1163
*     IF RPRENTRY=RPRENTCC          /* CLUSTER CONTROLLER?           */
*       THEN                                                       1163
         B     @RC01158                                            1163
@RF01158 CLI   RPRENTRY(CVAWKRDT),X'71'                            1163
         BNE   @RF01163                                            1163
*       DO;                         /* YES -                         */
*         CALL CVASRCLU;            /* GO PROCESS CLUSTER            */
         BAL   @14,CVASRCLU                                        1165
*       END;                                                       1166
*     ELSE                                                         1167
*                                                                  1167
*       /*************************************************************/
*       /*                                                           */
*       /* LOGICAL UNIT?                                             */
*       /*                                                           */
*       /*************************************************************/
*                                                                  1167
*       IF RPRENTRY=RPRENTLU        /* LU?                           */
*         THEN                                                     1167
         B     @RC01163                                            1167
@RF01163 CLI   RPRENTRY(CVAWKRDT),X'81'                            1167
         BNE   @RF01167                                            1167
*         DO;                       /* YES -                         */
*           CALL CVASRLU;           /* GO PROCESS LU                 */
         BAL   @14,CVASRLU                                         1169
*         END;                                                     1170
*       ELSE                                                       1171
*                                                                  1171
*   /*****************************************************************/
*   /*                                                               */
*   /* CLUSTER?                                                      */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1171
*     IF RPRENTRY=RPRENTCL          /* CLUSTER ENTRY?                */
*       THEN                        /* YES -                         */
         B     @RC01167                                            1171
@RF01167 CLI   RPRENTRY(CVAWKRDT),X'70'                            1171
         BNE   @RF01171                                            1171
*        DO;                                               /*@ZA17881*/
*          CALL CVASR100;           /* SYNTAX CHECK ENTRY    @ZA17881*/
         BAL   @14,CVASR100                                        1173
*          IF CVAR15=0              /* IF VALID ENTRY        @ZA17881*/
*            THEN                                          /*@ZA17881*/
         LTR   CVAR15,CVAR15                                       1174
         BNZ   @RF01174                                            1174
*       IF CVANEWSG=CVAOFF ×        /* IF NOT NEW SEGMENT OR @ZA26914*/
*          RCLRBISA=CVAON           /* NEW SEG & ISTATUS=ACT @ZA26914*/
*          THEN                     /* YES-                  @ZA26914*/
         TM    CVANEWSG,B'01000000'                                1175
         BZ    @RT01175                                            1175
         TM    RCLRBISA(CVAWKRDT),B'01000000'                      1175
         BNO   @RF01175                                            1175
@RT01175 DS    0H                                                  1176
*           IF RPRPTHCT^=CVA0       /* ACTIVE PATH TO CLUS ? @ZA26914*/
*             THEN                  /* YES -                         */
         CLI   RPRPTHCT(CVAWKRDT),0                                1176
         BE    @RF01176                                            1176
*             DO;                                                  1177
*               CALL CVASR080;      /* OPNDST THE CLUSTER            */
         BAL   @14,CVASR080                                        1178
*               IF CVAGOSW='1'B     /* GO SWITCH ON?                 */
*                 THEN             /* YES INCREMENT PATH CTS*/     1179
         TM    CVAGOSW,B'10000000'                                 1179
         BNO   @RF01179                                            1179
*                  DO;                                     /*@ZA31117*/
*                  CALL CVASR071;                                  1181
         BAL   @14,CVASR071                                        1181
*                  IF CVANEWSG=CVAOFF                      /*@ZA31117*/
*                    THEN                                  /*@ZA31117*/
         TM    CVANEWSG,B'01000000'                                1182
         BNZ   @RF01182                                            1182
*                      CALL CVASR040;                      /*@ZA31117*/
         BAL   @14,CVASR040                                        1183
*                  END;                                    /*@ZA31117*/
*               ELSE                                               1185
*                 DO;                                      /*@DM10682*/
         B     @RC01179                                            1185
@RF01179 DS    0H                                                  1186
*                  RPRONLIN=CVAOFF;  /*TURN OFF ONLINE BIT   @DM10682*/
         NI    RPRONLIN(CVAWKRDT),B'11110111'                      1186
*                  RPRLIVE=CVAOFF;  /*TURN LIVE BIT OFF      @DM10682*/
         NI    RPRLIVE(CVAWKRDT),B'11111110'                       1187
*                  END;                                    /*@DM10682*/
*             END;                  /* END-ACTIVE PATH       @ZA26914*/
*           ELSE                                                   1190
*             DO;                   /* NO-NO ACTIVE PATH     @ZA26914*/
         B     @RC01176                                            1190
@RF01176 DS    0H                                                  1191
*               CVAMSID@=ADDR(CVAMS608); /* V FAILED-HIGHER  @ZA26914*/
         LA    @15,CVAMS608                                        1191
         ST    @15,CVAMSID@                                        1191
*                                        /* NODE INACTIVE    @ZA26914*/
*               CVAMSG=ADDR(CVANAME1);                     /*@ZA26914*/
         LA    @15,CVANAME1                                        1192
         ST    @15,CVAMSG                                          1192
*               CVANAME1=RPRNAME;   /* 1ST NAME = CLUSTER    @ZA26914*/
         MVC   CVANAME1(8),RPRNAME(CVAWKRDT)                       1193
*               CVANAME2=RPRNSNEA->RPRNAME; /* LINK NAME     @ZA26914*/
         L     @15,RPRNSNEA(,CVAWKRDT)                             1194
         MVC   CVANAME2(8),RPRNAME(@15)                            1194
*               NCSACTV=CVAON;                             /*@ZA26914*/
         OI    NCSACTV(NCSPLPTR),B'10000000'                       1195
*               NCSAIMOD=CVAOFF;                           /*@ZA26914*/
         NI    NCSAIMOD(NCSPLPTR),B'01111111'                      1196
*               CVADOMSG=CVAON;     /* INDICATE MESSAGE      @ZA26914*/
         OI    CVADOMSG,B'00000010'                                1197
*             END;                  /* END-NO ACTIVE PATH    @ZA26914*/
*         END;                                                     1199
*     ELSE                                                         1200
*                                                                  1200
*   /*****************************************************************/
*   /*                                                               */
*   /* LINE?                                                         */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1200
*     IF RPRENTRY=RPRENTLN          /* IS WORK RDTE A LINE?          */
*       THEN                        /* YES -                         */
         B     @RC01171                                            1200
@RF01171 CLI   RPRENTRY(CVAWKRDT),X'50'                            1200
         BNE   @RF01200                                            1200
*       IF CVANEWSG=CVAOFF     /* IS THIS A NEW SEGMENT?     @X50BHC8*/
*          × RLNRBISA=CVAON    /* IS ISTATUS ON?             @X50BHC8*/
*          THEN                                                    1201
         TM    CVANEWSG,B'01000000'                                1201
         BZ    @RT01201                                            1201
         TM    RLNRBISA(CVAWKRDT),B'01000000'                      1201
         BNO   @RF01201                                            1201
@RT01201 DS    0H                                                  1202
*       IF RLNPORT=CVAON            /* IS THIS A PORT?               */
*         THEN                      /* YES - GO PROCESS FOR THE PORT */
         TM    RLNPORT(CVAWKRDT),B'00010000'                       1202
         BNO   @RF01202                                            1202
*         DO;                                                      1203
*            /*SEGMENT(CVASR31)REQUEST*/DO;GOTO CVASR31;CVASR31#:END;
         B     CVASR31                                             1205
CVASR31# DS    0H                                                  1207
*         END;                                                     1207
*       ELSE                                                       1208
*         DO;                       /* NOT A PORT -                  */
         B     @RC01202                                            1208
@RF01202 DS    0H                                                  1209
*               CALL CVASR060;      /* PROCESS THE LINE              */
         BAL   @14,CVASR060                                        1209
*               IF CVANEWSG=CVAON×CVAERRSW=CVAON/* IS THE          1210
*                                      NEW SEGMENT SWITCH          1210
*                                      OR THE ERROR SWITCH ON?       */
*                 THEN                                             1210
         TM    CVANEWSG,B'01000100'                                1210
         BNZ   @RT01210                                            1210
*                 ;                 /* YES - SKIP SIMLOGON PROCESSING*/
*               ELSE                                               1212
*                 IF RDTEPTR->RPRENTRY=RPRENTLN&RDTEPTR->RLNPORT='0'B&
*                     RDTEPTR->RLNRACAT='0'B&RDTEPTR->RLNRACAN='0'B/*
*                                      IF THE COMMAND ENTRY IS A LINE
*                                      AND IS NOT A PORT AND NOT DIAL
*                                      OUT OR IN ONLY, PROCESS FOR 1212
*                                      SIMLOGON                      */
*                   THEN                                           1212
         L     @15,RDTEPTR                                         1212
         CLI   RPRENTRY(@15),X'50'                                 1212
         BNE   @RF01212                                            1212
         TM    RLNPORT(@15),B'11010000'                            1212
         BNZ   @RF01212                                            1212
*                   CALL CVASR041;     /* PROCESS FOR SIMLOGONS      */
         BAL   @14,CVASR041                                        1213
*                 ELSE                                             1214
*                   ;                                              1214
@RF01212 DS    0H                                                  1215
*         END;                                                     1215
*          ELSE;                                           /*@X50BHC8*/
@RF01201 DS    0H                                                  1217
*     ELSE                                                         1217
*                                                                  1217
*   /*****************************************************************/
*   /*                                                               */
*   /* TERMINAL?                                                     */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1217
*       IF RPRENTRY=RPRENTTR        /* WRK RDTE A TERMINAL?          */
*         THEN                      /* YES -                         */
         B     @RC01200                                            1217
@RF01200 CLI   RPRENTRY(CVAWKRDT),X'80'                            1217
         BNE   @RF01217                                            1217
*           IF DEVSUBND=CVAON       /* IS IT A TERMINAL WITH A     1218
*                                      SUBNODE?                      */
*             THEN                  /* YES-OPEN DUMMY TERMINAL       */
         TM    DEVSUBND+44(CVAWKRDT),B'00010000'                   1218
         BNO   @RF01218                                            1218
*             DO;                                                  1219
*               CALL CVASR080;      /* GO OPNDST DUMMY TERMINAL      */
         BAL   @14,CVASR080                                        1220
*               IF CVAERRSW=CVAON   /* IS THE ERROR SWITCH ON?       */
*                 THEN                                             1221
         TM    CVAERRSW,B'00000100'                                1221
         BNO   @RF01221                                            1221
*                 DO;                                      /*@DM10682*/
*                  RPRONLIN=CVAOFF;  /*TURN OFF ONLINE BIT   @DM10682*/
         NI    RPRONLIN(CVAWKRDT),B'11110111'                      1223
*                  RPRLIVE=CVAOFF;  /*TURN LIVE BIT OFF      @DM10682*/
         NI    RPRLIVE(CVAWKRDT),B'11111110'                       1224
*                  END;                                    /*@DM10682*/
*               ELSE                                               1226
*                   CALL CVASR071;   /*INCREMENT PATH COUNTS*/     1226
         B     @RC01221                                            1226
@RF01221 BAL   @14,CVASR071                                        1226
*             END;                                                 1227
*           ELSE                                                   1228
*             IF CVANEWSG=CVAON     /* NEW SEGMENT SWITCH SET?       */
*               THEN                /* YES -                         */
         B     @RC01218                                            1228
@RF01218 TM    CVANEWSG,B'01000000'                                1228
         BNO   @RF01228                                            1228
*               IF RTRRBISA=CVAON   /* ISTATUS ACTIVE?               */
*                 THEN              /* YES- ACTIVATE DEVICE          */
         TM    RTRRBISA(CVAWKRDT),B'01000000'                      1229
         BNO   @RF01229                                            1229
*                 CALL CVASR040;    /* ACTIVATE DEVICE               */
         BAL   @14,CVASR040                                        1230
*               ELSE                                               1231
*                 ;                                                1231
@RF01229 DS    0H                                                  1232
*             ELSE                  /* NOT A NEW SEGMENT             */
*               CALL CVASR040;      /* ACTIVATE DEVICE               */
         B     @RC01228                                            1232
@RF01228 BAL   @14,CVASR040                                        1232
*       ELSE                                                       1233
*                                                                  1233
*         /***********************************************************/
*         /*                                                         */
*         /* COMPONENT?                                              */
*         /*                                                         */
*         /***********************************************************/
*                                                                  1233
*         IF RPRENTRY=RPRENTCM      /* WORK RDTE A COMPONENT?        */
*           THEN                    /* YES -                         */
         B     @RC01217                                            1233
@RF01217 CLI   RPRENTRY(CVAWKRDT),X'90'                            1233
         BNE   @RF01233                                            1233
*           IF CVANEWSG=CVAON       /* NEW SEGMENT SWITCH SET?       */
*             THEN                  /* YES -                         */
         TM    CVANEWSG,B'01000000'                                1234
         BNO   @RF01234                                            1234
*             IF RTRRBISA=CVAON     /* ISTATUS ACTIVE?               */
*               THEN                /* YES- ACTIVATE DEVICE          */
         TM    RTRRBISA(CVAWKRDT),B'01000000'                      1235
         BNO   @RF01235                                            1235
*               CALL CVASR040;      /* ACTIVATE DEVICE               */
         BAL   @14,CVASR040                                        1236
*             ELSE                                                 1237
*               ;                                                  1237
@RF01235 DS    0H                                                  1238
*           ELSE                    /* NOT A NEW SEGMENT             */
*             CALL CVASR040;        /* ACTIVATE DEVICE               */
         B     @RC01234                                            1238
@RF01234 BAL   @14,CVASR040                                        1238
*       ELSE                                                       1239
*                                                                  1239
*       /*************************************************************/
*       /*                                                           */
*       /* LOCAL ENTRY?                                              */
*       /*                                                           */
*       /*************************************************************/
*                                                                  1239
*       IF RPRENTRY=RPRENTLC        /* WORK RDTE A LOCAL TERM?       */
*         THEN                      /* YES -                         */
         B     @RC01233                                            1239
@RF01233 CLI   RPRENTRY(CVAWKRDT),X'45'                            1239
         BNE   @RF01239                                            1239
*         DO;                                                      1240
*           RFY                                                    1241
*            CVAR15 RSTD;                                          1241
*           CALL CVASR100;          /* SYNTAX THIS ENTRY             */
         BAL   @14,CVASR100                                        1242
*           IF CVAR15=0             /* ENTRY OK?                     */
*             THEN                  /* ENTRY IS OK -                 */
         LTR   CVAR15,CVAR15                                       1243
         BNZ   @RF01243                                            1243
*             DO;                                                  1244
*               RFY                                                1245
*                CVAR15 UNRSTD;                                    1245
*               IF CVANEWSG=CVAON   /* NEW SEGMENT SWITCH ON?        */
*                 THEN              /* THIS IS A NEW SEGMENT         */
         TM    CVANEWSG,B'01000000'                                1246
         BNO   @RF01246                                            1246
*                 IF RLCRBISA=CVAON /* ISTATUS SET ON?               */
*                   THEN            /* YES - ALLOC. IT               */
         TM    RLCRBISA(CVAWKRDT),B'01000000'                      1247
         BNO   @RF01247                                            1247
*                     DO;                                          1248
*                       CALL CVASR080;   /* OPEN DEVICE              */
         BAL   @14,CVASR080                                        1249
*                       NCSCRMSK=CVA0;  /* CLEAR C/R MASK    @X50BHC8*/
         SLR   @15,@15                                             1250
         STCM  @15,7,NCSCRMSK(NCSPLPTR)                            1250
*                     END;                                         1251
*                 ELSE                                             1252
*                   CVAGOSW=CVAOFF; /* DOESN'T HAVE ISTATUS - MAKE 1252
*                                      SURE GO SWITCH IS OFF         */
         B     @RC01247                                            1252
@RF01247 NI    CVAGOSW,B'01111111'                                 1252
*               ELSE                /* NOT A NEW SEGMENT -           */
*                DO;                                       /*@X50BHC8*/
         B     @RC01246                                            1253
@RF01246 DS    0H                                                  1254
*                 CALL CVASR080;    /* OPEN DEVICE                   */
         BAL   @14,CVASR080                                        1254
*                 NCSCRMSK=CVA0;    /* CLEAR THE C/R CHECKPOINT    1255
*                                      MASKS                 @X50BHC8*/
         SLR   @15,@15                                             1255
         STCM  @15,7,NCSCRMSK(NCSPLPTR)                            1255
*                END;                                      /*@X50BHC8*/
*               IF CVAGOSW=CVAON    /* GO SWITCH SET ON?             */
*                 THEN              /* YES - INCREMENT TERMINAL PATH
*                                      COUNTS                        */
@RC01246 TM    CVAGOSW,B'10000000'                                 1257
         BNO   @RF01257                                            1257
*                 DO;                                              1258
*                   CVAWKSAV=CVAWKRDT;/* SAVE RDTE ADDRESS           */
         ST    CVAWKRDT,CVAWKSAV                                   1259
*                   CVALOOP3=CVAON; /* SET LOOP CONTROL SWITCH ON    */
         OI    CVALOOP3,B'00010000'                                1260
*                   DO WHILE CVALOOP3=CVAON;                       1261
         B     @DE01261                                            1261
@DL01261 DS    0H                                                  1262
*                     IF RPRENTED=CVAON/* LAST ENTRY?                */
*                       THEN                                       1262
         TM    RPRENTED(CVAWKRDT),B'00000100'                      1262
         BNO   @RF01262                                            1262
*                       CVALOOP3=CVAOFF;/* YES - QUIT                */
         NI    CVALOOP3,B'11101111'                                1263
*                     ELSE          /* NOT THE LAST ENTRY            */
*                       DO;                                        1264
         B     @RC01262                                            1264
@RF01262 DS    0H                                                  1265
*                         CVAWKRDT=CVAWKRDT+RPRELEN;/* GET NEXT ENTRY*/
         AH    CVAWKRDT,RPRELEN(,CVAWKRDT)                         1265
*                         IF RPRENTRY=RPRENTLC/* LOCAL ENTRY?        */
*                           THEN                                   1266
         CLI   RPRENTRY(CVAWKRDT),X'45'                            1266
         BNE   @RF01266                                            1266
*                           CVALOOP3=CVAOFF;/* YES - QUIT            */
         NI    CVALOOP3,B'11101111'                                1267
*                         ELSE      /* NO-INCREMENT THE PATH COUNT   */
*                           RPRPTHCT=RPRPTHCT+CVA1;                1268
         B     @RC01266                                            1268
@RF01266 LA    @15,1                                               1268
         SLR   @07,@07                                             1268
         IC    @07,RPRPTHCT(,CVAWKRDT)                             1268
         ALR   @15,@07                                             1268
         STC   @15,RPRPTHCT(,CVAWKRDT)                             1268
*                       END;                                       1269
@RC01266 DS    0H                                                  1270
*                   END;            /* END OF LOOP 3                 */
@RC01262 DS    0H                                                  1270
@DE01261 TM    CVALOOP3,B'00010000'                                1270
         BO    @DL01261                                            1270
*                   CVAWKRDT=CVAWKSAV;/* RESTORE RDTE ADDRESS        */
         L     CVAWKRDT,CVAWKSAV                                   1271
*                 END;                                             1272
*               ELSE                                               1273
*                 ;                 /* GO SWITCH NOT ON -            */
@RF01257 DS    0H                                                  1274
*             END;                                                 1274
*           ELSE                                                   1275
*             ;                     /* LOCAL ENTRY BAD               */
@RF01243 DS    0H                                                  1276
*         END;                                                     1276
*       ELSE                                                       1277
*                                                                  1277
*       /*************************************************************/
*       /*                                                           */
*       /* UTERM ENTRY?                                              */
*       /*                                                           */
*       /*************************************************************/
*                                                                  1277
*       IF RPRENTRY=RPRENTUT        /* ENTRY A UTERM?                */
*         THEN                      /* YES -                         */
         B     @RC01239                                            1277
@RF01239 CLI   RPRENTRY(CVAWKRDT),X'75'                            1277
         BNE   @RF01277                                            1277
*            IF (CVANEWSG=CVAON &   /* NEW SEGMENT SWITCH ON?        */
*                RTRRBISA=CVAON) ×  /* ISTATUS ON?                   */
*               CVANEWSG=CVAOFF     /* OR IS NEW SEGMENT SWITCH OFF? */
*               THEN                                               1278
         TM    CVANEWSG,B'01000000'                                1278
         BNO   @GL00026                                            1278
         TM    RTRRBISA(CVAWKRDT),B'01000000'                      1278
         BO    @RT01278                                            1278
@GL00026 TM    CVANEWSG,B'01000000'                                1278
         BNZ   @RF01278                                            1278
@RT01278 DS    0H                                                  1279
*               DO;                                        /*@XM19356*/
*                  RPRONLIN=CVAON;  /* YES, SO MARK U-TERM ONLINE. THE
*                                      PORT SOLICITOR WILL         1280
*                                      MARK THE LIVE BIT     @X50BHC8*/
         OI    RPRONLIN(CVAWKRDT),B'00001000'                      1280
*                  NCSACTV=CVAON; /* MARK CHECKPOINT FLAG TO REFLECT
*                                    ACTIVE STATUS           @XM19356*/
         OI    NCSACTV(NCSPLPTR),B'10000000'                       1281
*                  NCSAIMOD=CVAON; /* MARK CHECKPOINT FLAG TO REFLECT
*                                     A CHANGE IN STATUS     @XM19356*/
         OI    NCSAIMOD(NCSPLPTR),B'10000000'                      1282
*               END;                                       /*@XM19356*/
*               ELSE;                                      /*@X50BHC8*/
@RF01278 DS    0H                                                  1285
*       ELSE                                                       1285
*                                                                  1285
*         /***********************************************************/
*         /*                                                         */
*         /* LCDO ENTRY?                                             */
*         /*                                                         */
*         /***********************************************************/
*                                                                  1285
*         IF RPRENTRY=RPRENTDS      /* WORK RDTE AN LCDO?            */
*           THEN                    /* YES -                         */
         B     @RC01277                                            1285
@RF01277 CLI   RPRENTRY(CVAWKRDT),X'20'                            1285
         BNE   @RF01285                                            1285
*           DO;                                                    1286
* /*************************************************************/  1287
* /*                                                           */  1287
* /*         CVASR034  BEGIN                                   */  1287
* /*                                                           */  1287
* /*************************************************************/  1287
*             CVACOUNT=0;           /* INITIALIZE COUNTER TO ZERO    */
         SLR   @15,@15                                             1287
         STH   @15,CVACOUNT                                        1287
*             RFY                                                  1288
*               CVAR15 RSTD;                                       1288
*             CVAR15=RDSADDOT;      /* GET DOT ADDRESS FROM LCDO     */
         L     CVAR15,RDSADDOT(,CVAWKRDT)                          1289
*             RFY                                                  1290
*               ISTDOT BASED(CVAR15);                              1290
*             DO WHILE CVACOUNT^=RDSCTTRM;                         1291
         B     @DE01291                                            1291
@DL01291 DS    0H                                                  1292
*               DOTADTRM->RPRPTHCT=DOTADTRM->RPRPTHCT+CVA1;/*      1292
*                                      INCREMENT PATH COUNT IN ENTRY
*                                      POINTED TO BY THE DOT ENTRY   */
         L     @07,DOTADTRM(,CVAR15)                               1292
         LA    @03,1                                               1292
         SLR   @00,@00                                             1292
         IC    @00,RPRPTHCT(,@07)                                  1292
         ALR   @00,@03                                             1292
         STC   @00,RPRPTHCT(,@07)                                  1292
*               DOTADTRM->RPRINIMM=CVAOFF; /* MAKE USUABLE   @ZA18901*/
         NI    RPRINIMM(@07),B'11111110'                           1293
*               CVAR15=CVAR15+(LENGTH(DOTADTRM));/* INDEX TO THE NEXT
*                                      DOT ENTRY                     */
         AL    CVAR15,@CF00088                                     1294
*               CVACOUNT=CVACOUNT+1;/* INCREMENT THE COUNTER         */
         LH    @07,CVACOUNT                                        1295
         N     @07,@CF05770                                        1295
         ALR   @03,@07                                             1295
         STH   @03,CVACOUNT                                        1295
*             END;                                                 1296
@DE01291 LH    @07,CVACOUNT                                        1296
         N     @07,@CF05770                                        1296
         CH    @07,RDSCTTRM(,CVAWKRDT)                             1296
         BNE   @DL01291                                            1296
*             RPRONLIN=CVAON;       /* TURN ON ONLINE BIT IN LCDO    */
         OI    RPRONLIN(CVAWKRDT),B'00001000'                      1297
*             RPRLIVE=CVAON;        /* TURN ON LIVE BIT IN LCDO      */
         OI    RPRLIVE(CVAWKRDT),B'00000001'                       1298
* /*****************************************************************/
* /*                                                               */
* /*          CVASR034 FINISH                                      */
* /*                                                               */
* /*****************************************************************/
*             IF CVANEWSG=CVAON×CVASGMNT='1'B×CVAERRSW=CVAON/* NEW 1299
*                                      SEGMENT SWITCH OR SEGMENT SWITCH
*                                      OR ERROR SWITCH ON?           */
*               THEN                                               1299
         TM    CVANEWSG,B'01010100'                                1299
         BNZ   @RT01299                                            1299
*               ;                   /* YES-DO NOT PROCESS SIMLOGONS  */
*             ELSE                                                 1301
*               CALL CVASR041;      /* GO PROCESS SIMLOGONS          */
         BAL   @14,CVASR041                                        1301
*             RFY                                                  1302
*               CVAR15 UNRSTD;                                     1302
@RT01299 DS    0H                                                  1303
*           END;                                                   1303
*         ELSE                                                     1304
*           ;                       /* ENTRY TYPE UNKNOWN -  SKIP IT */
@RF01285 DS    0H                                                  1305
*      END;                         /* END OF LOOK FOR ENTRY TYPE -  */
@RC01277 DS    0H                                                  1305
@RC01239 DS    0H                                                  1305
@RC01233 DS    0H                                                  1305
@RC01217 DS    0H                                                  1305
@RC01200 DS    0H                                                  1305
@RC01171 DS    0H                                                  1305
@RC01167 DS    0H                                                  1305
@RC01163 DS    0H                                                  1305
@RC01158 DS    0H                                                  1306
*    END;                           /* END OF NOT DEACTIVATE IN    1306
*                                      PROGRESS                      */
@RC01154 DS    0H                                                  1307
*  IF CVADOMSG=CVAON         /* IF MESSAGE NEEDED            @ZA26914*/
*    THEN                                                  /*@ZA26914*/
@RC01135 TM    CVADOMSG,B'00000010'                                1307
         BNO   @RF01307                                            1307
*      DO;                   /* YES-                         @ZA26914*/
*       IF CVAWKRDT=RDTEPTR  /* CMD ENTRY                    @ZA26914*/
*         THEN CVAERRSW=CVAON;  /* THEN MSG ISSUED LATER     @ZA26914*/
         C     CVAWKRDT,RDTEPTR                                    1309
         BNE   @RF01309                                            1309
         OI    CVAERRSW,B'00000100'                                1310
*         ELSE CALL CVATPMSG;   /* ELSE MSG NOW              @ZA26914*/
         B     @RC01309                                            1311
@RF01309 BAL   @14,CVATPMSG                                        1311
*       CVADOMSG=CVAOFF;                                   /*@ZA26914*/
@RC01309 NI    CVADOMSG,B'11111101'                                1312
*      END;                  /* END-MESSAGE NEEDED           @ZA26914*/
*    ELSE;                                                 /*@ZA26914*/
@RF01307 DS    0H                                                  1315
*   IF CVANEWSG=CVAON ×   /* IS THIS A NEW SEGMENT OR        @X50BHC8*/
*      (RPRENTRY=RPRENTCC &  /* IS THIS ENTRY A CLUSTER AND  @X50BHC8*/
*       NCSPL2IN=CVAON)      /* IS THIS THE FIRST TIME HERE? @X50BHC8*/
*      THEN                  /* YES, SO DOES CHECKPOINTING NEED TO TAKE
*                               PLACE?                       @X50BHC8*/
         TM    CVANEWSG,B'01000000'                                1315
         BO    @RT01315                                            1315
         CLI   RPRENTRY(CVAWKRDT),X'71'                            1315
         BNE   @RF01315                                            1315
         TM    NCSPL2IN(NCSPLPTR),B'10000000'                      1315
         BNO   @RF01315                                            1315
@RT01315 DS    0H                                                  1316
*         IF (NCSAIMOD=CVAOFF &                                    1316
*            NCSACTV=CVAON) ×                                      1316
*            (NCSPACTV=CVAON &                                     1316
*             NCSPTMOD=CVAOFF)  /* FOR A PORT?               @X50BHC8*/
*             THEN CVACKPT=CVAON;  /* MARK FOR CHECKPOINTING @X50BHC8*/
         TM    NCSAIMOD(NCSPLPTR),B'10000000'                      1316
         BNZ   @GL00030                                            1316
         TM    NCSACTV(NCSPLPTR),B'10000000'                       1316
         BO    @RT01316                                            1316
@GL00030 TM    NCSPACTV(NCSPLPTR),B'01000000'                      1316
         BNO   @RF01316                                            1316
         TM    NCSPTMOD(NCSPLPTR),B'01000000'                      1316
         BNZ   @RF01316                                            1316
@RT01316 DS    0H                                                  1317
         OI    CVACKPT,B'00100000'                                 1317
*             ELSE CVACKPT=CVAOFF; /* MARK FOR NO CHECKPOINTING */ 1318
         B     @RC01316                                            1318
@RF01316 NI    CVACKPT,B'11011111'                                 1318
*      ELSE                                                        1319
*         IF (NCSAIMOD=CVAON &                                     1319
*            NCSACTV=CVAON) ×                                      1319
*            (NCSPACTV=CVAON &                                     1319
*             NCSPTMOD=CVAON)                                      1319
*            THEN CVACKPT=CVAON;   /* MARK FOR CHECKPOINTING @X50BHC8*/
         B     @RC01315                                            1319
@RF01315 TM    NCSAIMOD(NCSPLPTR),B'10000000'                      1319
         BNO   @GL00033                                            1319
         TM    NCSACTV(NCSPLPTR),B'10000000'                       1319
         BO    @RT01319                                            1319
@GL00033 TM    NCSPACTV(NCSPLPTR),B'01000000'                      1319
         BNO   @RF01319                                            1319
         TM    NCSPTMOD(NCSPLPTR),B'01000000'                      1319
         BNO   @RF01319                                            1319
@RT01319 DS    0H                                                  1320
         OI    CVACKPT,B'00100000'                                 1320
*            ELSE CVACKPT=CVAOFF;  /* MARK FOR NO CHECKPOINTING */ 1321
         B     @RC01319                                            1321
@RF01319 NI    CVACKPT,B'11011111'                                 1321
*   IF CVACKPT=CVAON            /* NEED TO CHECKPOINT?       @X50BHC8*/
*      THEN                     /* YES, SO ISSUE CRIO MACRO  @X50BHC8*/
*                                                                  1322
@RC01319 DS    0H                                                  1322
@RC01315 TM    CVACKPT,B'00100000'                                 1322
         BNO   @RF01322                                            1322
*/*CRIO  FUNC(UPDATE)RDT((CVAWKRDT))PROCNM(ISTINCVA)*/             1323
*          DO;                                                     1323
*          RFY (GPR01P,GPR15P) RSTD;                               1324
*          GPR15P = 0;                                             1325
         SLR   GPR15P,GPR15P                                       1325
*          IF CVAWKRDT->RPRCRCPT = '1'B                            1326
*          THEN DO;                                                1326
         TM    RPRCRCPT(CVAWKRDT),B'01000000'                      1326
         BNO   @RF01326                                            1326
*          NCSCRDTE = CVAWKRDT;                                    1328
         ST    CVAWKRDT,NCSCRDTE(,NCSPLPTR)                        1328
*          NCSCRCMD = NCSCRWR;                                     1329
         MVI   NCSCRCMD(NCSPLPTR),X'00'                            1329
*          GPR01P = ADDR(ISTNCSPL);                                1330
         LR    GPR01P,NCSPLPTR                                     1330
*          CALL ISTINCR5;                                          1331
*                                                                  1331
         L     @15,@CV05443                                        1331
         BALR  @14,@15                                             1331
*          DO;                                                     1332
*/***  CRRMAINT  RPHADD((NCSPLRPH))PROCNM(ISTINCVA)COMP(VY)FUNC(RET)  *
**/                                                                1333
*          /*** CLEAR AND SET CURRENT PROCEDURE BIT ***/           1333
*NCSPLRPH->RPHCRR->CRACRR->VYCCRT = '0'B;                          1333
         L     @07,NCSPLRPH(,NCSPLPTR)                             1333
         L     @07,RPHCRR(,@07)                                    1333
         L     @07,CRACRR(,@07)                                    1333
         XC    VYCCRT+1(11,@07),VYCCRT+1(@07)                      1333
         MVI   VYCCRT(@07),B'00000000'                             1333
*NCSPLRPH->RPHCRR->CRACRR->CINCVA = '1'B;                          1334
         OI    CINCVA(@07),B'00000010'                             1334
*          END;                                                    1335
*          RFY (GPR01P,GPR15P) UNRSTD;                             1336
*          END;                                                    1337
*          END;                                                    1338
*          /* END OF CRIO EXPANSION */                             1339
*      ELSE;                                               /*@X50BHC8*/
@RF01322 DS    0H                                                  1340
*   NCSCRMSK=CVA0;              /* CLEAR THE C/R MASKS       @X50BHC8*/
@RC01322 SLR   @15,@15                                             1340
         STCM  @15,7,NCSCRMSK(NCSPLPTR)                            1340
*   CVAR14=CVARS030;                /* RESTORE RETURN REG            */
         L     CVAR14,CVARS030                                     1341
*   GEN(  EJECT);                                                  1342
*                                                                  1342
           EJECT
*   /*****************************************************************/
*   /*                                                               */
*   /* PORT PROCESSING                                               */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1343
*    /*SEGMENT(CVASR31)START*/DO;GOTO CVASR31@;CVASR31:END;        1343
         B     CVASR31@                                            1344
CVASR31  DS    0H                                                  1346
*   RFY                                                            1346
*     ISTRPRE BASED(CVAWKRDT);                                     1346
*   RFY                                                            1347
*     ISTRLN BASED(CVAWKRDT);                                      1347
*   RFY                                                            1348
*     ISTRPT BASED(CVAWKRDT);                                      1348
*   IF CVASGMNT=CVAON               /* IS SEGMENT SWITCH ON? @ZA17882*/
*     THEN                          /* YES -                         */
         TM    CVASGMNT,B'00010000'                                1349
         BNO   @RF01349                                            1349
*     DO;                                                          1350
*       CALL CVASR060;              /* ACTIVATE THE LINE     @X50BHC8*/
         BAL   @14,CVASR060                                        1351
*       IF CVANEWSG=CVAON &          /* PORT'S ISTATUS?      @X50BHC8*/
*          RPTISTAT=CVAOFF                                 /*@ZA17882*/
*       THEN;                                              /*@X50BHC8*/
         TM    CVANEWSG,B'01000000'                                1352
         BNO   @RF01352                                            1352
         TM    RPTISTAT(CVAWKRDT),B'00000001'                      1352
         BZ    @RT01352                                            1352
*          ELSE                                                    1354
*             IF CVAERRSW=CVAON      /* IS THE ERROR SWITCH ON? */ 1354
*                THEN               /* YES, SO MARK THE C/R BITS */
@RF01352 TM    CVAERRSW,B'00000100'                                1354
         BNO   @RF01354                                            1354
*                   DO;                                    /*@X50BHC8*/
*                     NCSPACTV=CVAON; /* REFLECTS A CHANGE IN STATUS
*                                                            @X50BHC8*/
         OI    NCSPACTV(NCSPLPTR),B'01000000'                      1356
*                     NCSPTMOD=CVAOFF;  /* PORT WAS NOT ACTIVATED  1357
*                                                            @X50BHC8*/
         NI    NCSPTMOD(NCSPLPTR),B'10111111'                      1357
*                   END;                                   /*@X50BHC8*/
*                ELSE                                              1359
*                   DO;                                    /*@X50BHC8*/
         B     @RC01354                                            1359
@RF01354 DS    0H                                                  1360
*             RPTONLIN=CVAON;       /* TURN ON CTERM ONLIN BIT       */
         OI    RPTONLIN(CVAWKRDT),B'00010000'                      1360
*             CALL CVASR080;        /* OPEN THE PORT                 */
         BAL   @14,CVASR080                                        1361
*             IF CVAGOSW=CVAON      /* GO SWITCH SET?                */
*               THEN                /* YES -                         */
         TM    CVAGOSW,B'10000000'                                 1362
         BNO   @RF01362                                            1362
*               DO;                                                1363
*                 CVAINCSW=CVAOFF;  /* INDICATE INCREMENT            */
         NI    CVAINCSW,B'11111011'                                1364
*                 CALL CVASR035;    /* GO INCREMENT PATH COUNTS      */
         BAL   @14,CVASR035                                        1365
*               END;                                               1366
*             ELSE                                                 1367
*               ;                                                  1367
@RF01362 DS    0H                                                  1368
*           END;                                                   1368
*     END;                                                         1369
*   ELSE                                                           1370
*     IF NCSPLRID=RPRNAME           /* ACTIVATING THE LINE?          */
*       THEN                        /* YES -                         */
         B     @RC01349                                            1370
@RF01349 CLC   NCSPLRID(8,NCSPLPTR),RPRNAME(CVAWKRDT)              1370
         BNE   @RF01370                                            1370
*       CALL CVASR060;              /* ACTIVATE THE LINE             */
         BAL   @14,CVASR060                                        1371
*     ELSE                          /* NO-PROCESS FOR CTERM          */
*       DO;                                                        1372
         B     @RC01370                                            1372
@RF01370 DS    0H                                                  1373
*          /*SEGMENT(CVASR32)REQUEST*/DO;GOTO CVASR32;CVASR32#:END;
         B     CVASR32                                             1374
CVASR32# DS    0H                                                  1376
*       END;                                                       1376
*    /*SEGMENT(CVASR31)FINISH*/DO;GOTO CVASR31#;CVASR31@:END;      1377
@RC01370 DS    0H                                                  1377
@RC01349 DS    0H                                                  1378
         B     CVASR31#                                            1378
CVASR31@ DS    0H                                                  1380
*   GEN(  EJECT);                                                  1380
*                                                                  1380
           EJECT
*   /*****************************************************************/
*   /*                                                               */
*   /* CTERM PROCESSING                                              */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1381
*    /*SEGMENT(CVASR32)START*/DO;GOTO CVASR32@;CVASR32:END;        1381
         B     CVASR32@                                            1382
CVASR32  DS    0H                                                  1384
*   RFY                                                            1384
*     ISTRPRE BASED(CVAWKRDT);                                     1384
*   RFY                                                            1385
*     ISTRPT BASED(CVAWKRDT);                                      1385
*   IF RPRONLIN=CVAON               /* IS THE LINE ONLINE BIT ON?    */
*     THEN                          /* YES -                         */
         TM    RPRONLIN(CVAWKRDT),B'00001000'                      1386
         BNO   @RF01386                                            1386
*     DO;                                                          1387
*       RPTVIODN='0'B;              /* RESET VARY'S PORT I/O DONE BIT
*                                      JUST IN CASE IT IS ON         */
         NI    RPTVIODN(CVAWKRDT),B'11110111'                      1388
*       CVAINCSW=CVAOFF;            /* INDICATE INCREMENT            */
         NI    CVAINCSW,B'11111011'                                1389
*       CALL CVASR035;              /* GO INCREMENT PATH COUNTS      */
         BAL   @14,CVASR035                                        1390
*       CALL CVASR040;              /* ACTIVATE THE DEVICE           */
         BAL   @14,CVASR040                                        1391
*       IF CVAERRSW=CVAON           /* ERROR SWITCH SET ON?          */
*         THEN                      /* YES-DECREMENT PATH COUNTS     */
         TM    CVAERRSW,B'00000100'                                1392
         BNO   @RF01392                                            1392
*         DO;                                                      1393
*           CVAINCSW=CVAON;         /* INDICATE DECREMENT            */
         OI    CVAINCSW,B'00000100'                                1394
*           CALL CVASR035;          /* GO DECREMENT PATH COUNTS      */
         BAL   @14,CVASR035                                        1395
*         END;                                                     1396
*       ELSE                                                       1397
*         DO;                       /* ERROR SWITCH NOT ON -         */
         B     @RC01392                                            1397
@RF01392 DS    0H                                                  1398
*           CALL CVASR080;          /* OPEN THE PORT                 */
         BAL   @14,CVASR080                                        1398
*           IF CVAGOSW=CVAON        /* GO SWITCH SET?                */
*             THEN                                                 1399
         TM    CVAGOSW,B'10000000'                                 1399
         BO    @RT01399                                            1399
*             ;                     /* YES- EXIT                     */
*           ELSE                    /* NO-DEACTIVATE THE DEVICE AND
*                                      DECREMENT PATH COUNTS         */
*             DO;                                                  1401
*               CVAINCSW=CVAON;     /* INDICATE DECREMENT            */
         OI    CVAINCSW,B'00000100'                                1402
*               CALL CVASR035;      /* GO DECREMENT PATH COUNTS      */
         BAL   @14,CVASR035                                        1403
*             END;                                                 1404
*         END;                                                     1405
*     END;                                                         1406
*   ELSE                            /* LINE WAS NOT ONLINE           */
*     DO;                                                          1407
         B     @RC01386                                            1407
@RF01386 DS    0H                                                  1408
*       CVAERRSW=CVAON;             /* SET ERROR SWITCH ON           */
         OI    CVAERRSW,B'00000100'                                1408
*       CVAMSID@=ADDR(CVAMS608);    /* GET ADDRESS OF 'HIGHER NODE 1409
*                                      INACTIVE' MESSAGE ID          */
         LA    @15,CVAMS608                                        1409
         ST    @15,CVAMSID@                                        1409
*       CVANAME1=RPTCTNM;           /* GET NODENAME OF CTERM         */
         MVC   CVANAME1(8),RPTCTNM(CVAWKRDT)                       1410
*       CVANAME2=RPRNAME;           /* GET NODENAME OF LINE          */
         MVC   CVANAME2(8),RPRNAME(CVAWKRDT)                       1411
*       CVAMSG=ADDR(CVANAME1);      /* GET ADDRESS OF VARIABLES      */
         LA    @15,CVANAME1                                        1412
         ST    @15,CVAMSG                                          1412
*       IF CVAFRSTM=CVAON           /* FIRST TIME SWITCH ON?         */
*         THEN                                                     1413
         TM    CVAFRSTM,B'00001000'                                1413
         BNO   @RF01413                                            1413
*         CVAQUIT=CVAON;            /* YES- SET QUIT SWITCH ON       */
         OI    CVAQUIT,B'00001000'                                 1414
*       ELSE                                                       1415
*         CALL CVATPMSG;            /* OUTPUT MSG                    */
         B     @RC01413                                            1415
@RF01413 BAL   @14,CVATPMSG                                        1415
*     END;                                                         1416
@RC01413 DS    0H                                                  1417
*    /*SEGMENT(CVASR32)FINISH*/DO;GOTO CVASR32#;CVASR32@:END;      1417
@RC01386 DS    0H                                                  1418
         B     CVASR32#                                            1418
*   END CVASR030;                   /* RETURN TO CALLER              */
@EL00002 DS    0H                                                  1420
@EF00002 DS    0H                                                  1420
@ER00002 BR    @14                                                 1420
@PB00002 DS    0H                                                  1421
*   GEN(  EJECT);                                                  1421
           EJECT
*CVASR035:                                                         1422
*   PROC OPTIONS(NOSAVE NOSAVEAREA);                               1422
*                                                                  1422
         B     @PB00003                                            1422
CVASR035 DS    0H                                                  1423
*   /*****************************************************************/
*   /*                                                               */
*   /* PORT DITT/DIVT PATH COUNT INCREMENT/DECREMENT SUBROUTINE      */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1423
*   RFY                                                            1423
*     CVAR15 RSTD;                                                 1423
*   RFY                                                            1424
*     ISTRPRE BASED(CVAWKRDT);                                     1424
*   RFY                                                            1425
*     ISTRPT BASED(CVAWKRDT);                                      1425
*   RFY                                                            1426
*     ISTRLN BASED(CVAWKRDT);                                      1426
*   RFY                                                            1427
*     ISTDIVTH BASED(CVAR15);                                      1427
*   RFY                                                            1428
*     ISTDVE BASED(CVAR15);                                        1428
*   RFY                                                            1429
*     ISTDTE BASED(CVAR15);                                        1429
*   CVARS035=CVAR14;                /* SAVE RETURN REGISTER          */
         ST    CVAR14,CVARS035                                     1430
*   IF RLNIDV=CVAON                 /* THIS AN ID VERIFIED PORT?     */
*     THEN                          /* YES -                         */
         TM    RLNIDV(CVAWKRDT),B'00001000'                        1431
         BNO   @RF01431                                            1431
*     DO;                                                          1432
*       CVAR15=RPTDIVT;             /* GET DIVT HDR ADDR FROM PORT 1433
*                                      ENTRY                         */
         L     CVAR15,RPTDIVT(,CVAWKRDT)                           1433
*       CVACOUNT=DIVNUME;           /* GET TERMINAL COUNT FROM HDR   */
         LH    @07,DIVNUME(,CVAR15)                                1434
         STH   @07,CVACOUNT                                        1434
*       CVAR14=DIVIDLEN;            /* GET BSCID MAX LENGTH FROM HDR */
         LH    CVAR14,DIVIDLEN(,CVAR15)                            1435
*       CVAR15=CVAR15+(LENGTH(ISTDIVTH));/* INDEX PAST HEADER        */
         AL    CVAR15,@CF00094                                     1436
*       DO WHILE CVACOUNT^=0;       /* PROCESS DIVT ENTRIES          */
         B     @DE01437                                            1437
@DL01437 DS    0H                                                  1438
*         IF CVAINCSW=CVAOFF        /* IS INCREMENT INDICATED?       */
*           THEN                    /* YES -                         */
         TM    CVAINCSW,B'00000100'                                1438
         BNZ   @RF01438                                            1438
*             DO;                                          /*@ZA18901*/
*           DVERDTEA->RPRPTHCT=DVERDTEA->RPRPTHCT+CVA1;/* INCREMENT
*                                      PATH COUNT OF TERMINAL ENTRY
*                                      POINTED TO BY DIVT            */
         L     @07,DVERDTEA(,CVAR15)                               1440
         LA    @03,1                                               1440
         SLR   @00,@00                                             1440
         IC    @00,RPRPTHCT(,@07)                                  1440
         ALR   @03,@00                                             1440
         STC   @03,RPRPTHCT(,@07)                                  1440
*           DVERDTEA->RPRINIMM=CVAOFF; /* MAKE USUABLE       @ZA18901*/
         NI    RPRINIMM(@07),B'11111110'                           1441
*             END;                                         /*@ZA18901*/
*         ELSE                      /* DECREMENT INDICATED -         */
*           DVERDTEA->RPRPTHCT=DVERDTEA->RPRPTHCT-CVA1;/* DECREMENT
*                                      PATH COUNT OF TERMINAL ENTRY
*                                      POINTED TO BY DIVT            */
         B     @RC01438                                            1443
@RF01438 L     @07,DVERDTEA(,CVAR15)                               1443
         SLR   @03,@03                                             1443
         IC    @03,RPRPTHCT(,@07)                                  1443
         BCTR  @03,0                                               1443
         STC   @03,RPRPTHCT(,@07)                                  1443
*         CVACOUNT=CVACOUNT-1;      /* DECREMENT TERMINAL COUNTER    */
@RC01438 LH    @07,CVACOUNT                                        1444
         N     @07,@CF05770                                        1444
         BCTR  @07,0                                               1444
         STH   @07,CVACOUNT                                        1444
*         CVAR15=CVAR15+((LENGTH(ISTDVE))+CVAR14);/* INDEX TO THE  1445
*                                      NEXT ENTRY                    */
         LA    @07,5                                               1445
         ALR   @07,CVAR14                                          1445
         ALR   CVAR15,@07                                          1445
*       END;                                                       1446
@DE01437 LH    @07,CVACOUNT                                        1446
         N     @07,@CF05770                                        1446
         LTR   @07,@07                                             1446
         BNZ   @DL01437                                            1446
*     END;                                                         1447
*   ELSE                                                           1448
*     IF RLNTTV=CVAON               /* THIS A TERM VERIFIED PORT?    */
*       THEN                        /* YES -                         */
         B     @RC01431                                            1448
@RF01431 TM    RLNTTV(CVAWKRDT),B'00001000'                        1448
         BNO   @RF01448                                            1448
*       DO;                                                        1449
*         CVAR15=RPTDITT;           /* GET DITT ADDR FROM PORT       */
         L     CVAR15,RPTDITT(,CVAWKRDT)                           1450
*         DO WHILE DTELCTI^=DITTEND;/* PROCESS DITT ENTRIES          */
         B     @DE01451                                            1451
@DL01451 DS    0H                                                  1452
*          IF DTERDTEA=CVA0         /*ZERO ENTRY?            @XM01215*/
*           THEN;                   /*YES - SKIP IT          @XM01215*/
         ICM   @07,15,DTERDTEA(CVAR15)                             1452
         BZ    @RT01452                                            1452
*           ELSE                    /*NO - PROCESS           @XM01215*/
*           IF CVAINCSW=CVAOFF      /* IS INCREMENT INDICATED?       */
*             THEN                  /* YES -                         */
         TM    CVAINCSW,B'00000100'                                1454
         BNZ   @RF01454                                            1454
*               DO;                                        /*@ZA18901*/
*             DTERDTEA->RPRPTHCT=DTERDTEA->RPRPTHCT+CVA1;/*        1456
*                                      INCREMENT PATH COUNT OF TERMINAL
*                                      ENTRY POINTED TO BY DITT      */
         ICM   @07,15,DTERDTEA(CVAR15)                             1456
         LA    @03,1                                               1456
         SLR   @00,@00                                             1456
         IC    @00,RPRPTHCT(,@07)                                  1456
         ALR   @03,@00                                             1456
         STC   @03,RPRPTHCT(,@07)                                  1456
*             DTERDTEA->RPRINIMM=CVAOFF; /* MAKE USUABLE     @ZA18901*/
         NI    RPRINIMM(@07),B'11111110'                           1457
*               END;                                       /*@ZA18901*/
*           ELSE                    /* DECREMENT INDICATED           */
*             DTERDTEA->RPRPTHCT=DTERDTEA->RPRPTHCT-CVA1;/*        1459
*                                      DECREMENT PATH COUNT OF TERMINAL
*                                      ENTRY POINTED TO BY DITT      */
         B     @RC01454                                            1459
@RF01454 ICM   @07,15,DTERDTEA(CVAR15)                             1459
         SLR   @03,@03                                             1459
         IC    @03,RPRPTHCT(,@07)                                  1459
         BCTR  @03,0                                               1459
         STC   @03,RPRPTHCT(,@07)                                  1459
*           CVAR15=CVAR15+(LENGTH(ISTDTE));/* INDEX TO THE NEXT ENTRY*/
@RC01454 DS    0H                                                  1460
@RT01452 AL    CVAR15,@CF00832                                     1460
*         END;                                                     1461
@DE01451 CLI   DTELCTI(CVAR15),X'FF'                               1461
         BNE   @DL01451                                            1461
*       END;                                                       1462
*     ELSE                                                         1463
*       ;                                                          1463
@RF01448 DS    0H                                                  1464
*   IF RPTUTERM=0                   /* UTERM ASSOCIATED WITH THIS  1464
*                                      PORT?                         */
*     THEN                                                         1464
@RC01431 L     @07,RPTUTERM(,CVAWKRDT)                             1464
         LTR   @07,@07                                             1464
         BZ    @RT01464                                            1464
*     ;                             /* NO - EXIT                     */
*   ELSE                                                           1466
*     RPTUTERM->RPRPTHCT=RPTUTERM->RPRPTHCT+CVA1;/* INCREMENT UTERM
*                                      PATH COUNT                    */
         L     @07,RPTUTERM(,CVAWKRDT)                             1466
         LA    @03,1                                               1466
         SLR   @00,@00                                             1466
         IC    @00,RPRPTHCT(,@07)                                  1466
         ALR   @03,@00                                             1466
         STC   @03,RPRPTHCT(,@07)                                  1466
*   CVAR14=CVARS035;                /* RESTORE RETURN REGISTER       */
@RT01464 L     CVAR14,CVARS035                                     1467
*   RFY                                                            1468
*     CVAR15 UNRSTD;                                               1468
*   END CVASR035;                                                  1469
@EL00003 DS    0H                                                  1469
@EF00003 DS    0H                                                  1469
@ER00003 BR    @14                                                 1469
@PB00003 DS    0H                                                  1470
*   GEN(  EJECT);                                                  1470
           EJECT
*CVASR040:                                                         1471
*   PROC OPTIONS(NOSAVE NOSAVEAREA);                               1471
*                                                                  1471
         B     @PB00004                                            1471
CVASR040 DS    0H                                                  1472
*   /*****************************************************************/
*   /*                                                               */
*   /* ACTIVATE DEVICE SUBROUTINE                                    */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1472
*   RFY                                                            1472
*     ISTRPRE BASED(CVAWKRDT);                                     1472
*   RFY                                                            1473
*     ISTRTR BASED(CVAWKRDT);                                      1473
*   RFY                                                            1474
*     ISTRPT BASED(CVAWKRDT);                                      1474
*   RFY                                                            1475
*     CVAR15 RSTD;                                                 1475
*   CVARS040=CVAR14;                /* SAVE RETURN REG               */
         ST    CVAR14,CVARS040                                     1476
*   IF RPRNSNEA->RPRENTRY=RPRENTLC  /*NSNEA AN LC            @XM01647*/
*     & RPRNSNEA->RPRONLIN=CVAOFF   /*AND ITS OFFLINE        @XM01647*/
*     THEN CVALPSW=CVAON;           /*SKIP IT                @X50BHC8*/
         L     @07,RPRNSNEA(,CVAWKRDT)                             1477
         CLI   RPRENTRY(@07),X'45'                                 1477
         BNE   @RF01477                                            1477
         TM    RPRONLIN(@07),B'00001000'                           1477
         BNZ   @RF01477                                            1477
         OI    CVALPSW,B'01000000'                                 1478
*     ELSE                                                         1479
*     DO;                           /*PROCESS                @XM01647*/
         B     @RC01477                                            1479
@RF01477 DS    0H                                                  1480
*   CALL CVASR100;                  /* SYNTAX THIS ENTRY             */
         BAL   @14,CVASR100                                        1480
*   IF CVAR15^=0                     /* ENTRY OK?            @X50BHC8*/
*     THEN CVALPSW=CVAON;    /* TURN ON CONTROL SWITCH       @X50BHC8*/
         LTR   CVAR15,CVAR15                                       1481
         BZ    @RF01481                                            1481
         OI    CVALPSW,B'01000000'                                 1482
*     ELSE                          /* YES -                 @X50BHC8*/
*     DO;                                                          1483
         B     @RC01481                                            1483
@RF01481 DS    0H                                                  1484
*       RFY                                                        1484
*         CVAR15 UNRSTD;                                           1484
*       IF RPRENTRY=RPRENTLN        /* IS THIS A LINE ENTRY?         */
*         THEN                      /* YES-MUST BE WORKING WITH A  1485
*                                      PORT                          */
         CLI   RPRENTRY(CVAWKRDT),X'50'                            1485
         BNE   @RF01485                                            1485
*         RPTONLIN=CVAON;           /* SET THE CTERM ONLINE BIT      */
         OI    RPTONLIN(CVAWKRDT),B'00010000'                      1486
*       ELSE                        /* NOT WORKING WITH A PORT       */
*        DO;                                               /*@X50BHC8*/
         B     @RC01485                                            1487
@RF01485 DS    0H                                                  1488
*         RPRONLIN=CVAON;           /* SET THE ONLINE BIT ON         */
         OI    RPRONLIN(CVAWKRDT),B'00001000'                      1488
*         NCSACTV=CVAON;      /* REFLECTS A CHANGE IN STATUS @X50BHC8*/
         OI    NCSACTV(NCSPLPTR),B'10000000'                       1489
*         NCSAIMOD=CVAON;     /* SHOWS ACTIVATION            @X50BHC8*/
         OI    NCSAIMOD(NCSPLPTR),B'10000000'                      1490
*        END;                                              /*@X50BHC8*/
*       IF RPRNSNEA->RPRENTRY=RPRENTLC/* NEXT HIGHER NODE A LOCAL  1492
*                                      CONTROLER?                    */
*         THEN                      /* YES -                         */
@RC01485 L     @15,RPRNSNEA(,CVAWKRDT)                             1492
         CLI   RPRENTRY(@15),X'45'                                 1492
         BNE   @RF01492                                            1492
*         RPRLIVE=CVAON;            /* SET LIVE BIT ON               */
         OI    RPRLIVE(CVAWKRDT),B'00000001'                       1493
*       ELSE                                                       1494
*         IF RTRVTERM=CVAON         /* MTA (VTERM) TERMINAL?         */
*           THEN                                                   1494
         B     @RC01492                                            1494
@RF01492 TM    RTRVTERM(CVAWKRDT),B'00000100'                      1494
         BO    @RT01494                                            1494
*           ;                       /* YES -                         */
*         ELSE                                                     1496
*           IF RPRNSNEA->RPRENTRY=RPRENTGP/* NEXT HIGHER NODE A    1496
*                                      GROUP?                        */
*             THEN                                                 1496
         L     @15,RPRNSNEA(,CVAWKRDT)                             1496
         CLI   RPRENTRY(@15),X'30'                                 1496
         BE    @RT01496                                            1496
*             ;                     /* YES-DO NOT TURN THE LIVE BIT
*                                      ON                            */
*           ELSE                                                   1498
*             RPRLIVE='1'B;         /* NO-TURN LIVE BIT              */
         OI    RPRLIVE(CVAWKRDT),B'00000001'                       1498
*       IF CVANEWSG=CVAON×CVASGMNT='1'B/* NEW SEGMENT SWITCH OR SEGMENT
*                                      SWITCH SET ON?                */
*         THEN                                                     1499
@RT01496 DS    0H                                                  1499
@RT01494 DS    0H                                                  1499
@RC01492 TM    CVANEWSG,B'01010000'                                1499
         BNZ   @RT01499                                            1499
*         ;                         /* YES-DO NOT PROCESS FOR      1500
*                                      SIMLOGONS                     */
*       ELSE                                                       1501
*         CALL CVASR041;            /* GO PROCESS FOR SIMLOGONS      */
         BAL   @14,CVASR041                                        1501
*     END;                                                         1502
@RT01499 DS    0H                                                  1503
*   END;                                                   /*@XM01647*/
@RC01481 DS    0H                                                  1504
*   IF CVALPSW=CVAON       /* IS CONTROL SWITCH ON?          @X50BHC8*/
*            THEN                                                  1504
@RC01477 TM    CVALPSW,B'01000000'                                 1504
         BNO   @RF01504                                            1504
*               IF RPRENTRY=RPRENTLN    /* IS THIS A LINE?   @X50BHC8*/
*                  THEN                                            1505
         CLI   RPRENTRY(CVAWKRDT),X'50'                            1505
         BNE   @RF01505                                            1505
*                     DO;                                  /*@X50BHC8*/
*                       NCSPACTV=CVAON; /* PORT CHANGE IN STATUS BIT */
         OI    NCSPACTV(NCSPLPTR),B'01000000'                      1507
*                       NCSPTMOD=CVAOFF;  /* PORT NOT ACTIVE @X50BHC8*/
         NI    NCSPTMOD(NCSPLPTR),B'10111111'                      1508
*                     END;                                 /*@X50BHC8*/
*                  ELSE                                            1510
*                     DO;                                  /*@X50BHC8*/
         B     @RC01505                                            1510
@RF01505 DS    0H                                                  1511
*                       NCSACTV=CVAON;  /* CHANGE IN STATUS BIT */ 1511
         OI    NCSACTV(NCSPLPTR),B'10000000'                       1511
*                       NCSAIMOD=CVAOFF;  /* NOT ACTIVE STATUS  */ 1512
         NI    NCSAIMOD(NCSPLPTR),B'01111111'                      1512
*                     END;                                 /*@X50BHC8*/
*      ELSE;                                               /*@X50BHC8*/
@RF01504 DS    0H                                                  1515
*   CVAR14=CVARS040;                /* RESTORE RETURN REG            */
@RC01504 L     CVAR14,CVARS040                                     1515
*   END CVASR040;                   /* RETURN TO CALLER              */
@EL00004 DS    0H                                                  1516
@EF00004 DS    0H                                                  1516
@ER00004 BR    @14                                                 1516
@PB00004 DS    0H                                                  1517
*   GEN(  EJECT);                                                  1517
           EJECT
*CVASR041:                                                         1518
*   PROC OPTIONS(NOSAVE NOSAVEAREA);                               1518
*                                                                  1518
         B     @PB00005                                            1518
CVASR041 DS    0H                                                  1519
*   /*****************************************************************/
*   /*                                                               */
*   /* SIMLOGON PROCESS SUBROUTINE                                   */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1519
*   RFY                                                            1519
*     ISTRPRE BASED(CVAWKRDT);                                     1519
*   RFY                                                            1520
*     ISTRTR BASED(CVAWKRDT);                                      1520
*   RFY                                                            1521
*     CVAR0 RSTD;                                                  1521
*   CVARS041=CVAR14;                /* SAVE RETURN REGISTER          */
*                                                                  1522
         ST    CVAR14,CVARS041                                     1522
*   /*****************************************************************/
*   /*                                                               */
*   /* GET VARY/OPEN/CLOSE (VOCLOCK) LOCK:                           */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1523
*   CVAR0=CVA0;                                                    1523
         SLR   CVAR0,CVAR0                                         1523
*   CALL CVASRLOC;                                                 1524
         BAL   @14,CVASRLOC                                        1524
*   CVAR1=NCSPLPTR;                 /* NCSPL ADDRESS IN REG 1        */
         LR    CVAR1,NCSPLPTR                                      1525
*   CALL ISTINCLF;                  /* GO TO LOGON                   */
*                                                                  1526
         L     @15,@CV05530                                        1526
         BALR  @14,@15                                             1526
*    DO;                                                           1527
*/***  CRRMAINT  PROCNM(ISTINCVA)COMP(VY)FUNC(RET)RPHADD((NCSPLRPH))  *
**/                                                                1528
*    /*** CLEAR AND SET CURRENT PROCEDURE BIT ***/                 1528
*NCSPLRPH->RPHCRR->CRACRR->VYCCRT = '0'B;                          1528
         L     @15,NCSPLRPH(,NCSPLPTR)                             1528
         L     @15,RPHCRR(,@15)                                    1528
         L     @15,CRACRR(,@15)                                    1528
         XC    VYCCRT+1(11,@15),VYCCRT+1(@15)                      1528
         MVI   VYCCRT(@15),B'00000000'                             1528
*NCSPLRPH->RPHCRR->CRACRR->CINCVA = '1'B;                          1529
         OI    CINCVA(@15),B'00000010'                             1529
*    END;                                                          1530
*                                                                  1530
*   /*****************************************************************/
*   /*                                                               */
*   /* RELEASE VOCLOCK LOCK:                                         */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1531
*   CVAR0=CVA10;                                                   1531
         LA    CVAR0,10                                            1531
*   CALL CVASRLOC;                                                 1532
         BAL   @14,CVASRLOC                                        1532
*   CVALFDON='1'B;                  /* SET LOGON DONE SWITCH ON      */
         OI    CVALFDON,B'00000001'                                1533
*   CVAR14=CVARS041;                /* RESTORE RETURN REGISTER       */
         L     CVAR14,CVARS041                                     1534
*   RFY                                                            1535
*     CVAR0 UNRSTD;                                                1535
*   END CVASR041;                   /* RETURN TO CALLER              */
@EL00005 DS    0H                                                  1536
@EF00005 DS    0H                                                  1536
@ER00005 BR    @14                                                 1536
@PB00005 DS    0H                                                  1537
*   GEN(  EJECT);                                                  1537
           EJECT
*CVASR050:                                                         1538
*   PROC OPTIONS(NOSAVE NOSAVEAREA);                               1538
*                                                                  1538
         B     @PB00006                                            1538
CVASR050 DS    0H                                                  1539
*   /*****************************************************************/
*   /*                                                               */
*   /* PEP LINE ALLOCATE/ACTIVATE SUBROUTINE                         */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1539
*   RFY                                                            1539
*     ISTRPRE BASED(CVAWKRDT);                                     1539
*   CVARS050=CVAR14;                /* SAVE RETURN REG               */
         ST    CVAR14,CVARS050                                     1540
*   NCSPLRAD=CVAWKRDT;              /* RDTE PTR FOR ALLOCATE         */
         ST    CVAWKRDT,NCSPLRAD(,NCSPLPTR)                        1541
*   CVAACT='1'B;                /* SET 'ACTIVATE PEP LINE' SWITCH  1542
*                                      ON                            */
         OI    CVAACT,B'00000001'                                  1542
*   CALL CVASR053;              /* GO SWITCH THE PEP LINE TO NCP IF
*                                      NECESSARY                     */
         BAL   @14,CVASR053                                        1543
*           RLNSWNCP='1'B;          /* SET THE 'SWITCHED TO NCP' FLAG
*                                      ON                            */
*           RLNSWEP='0'B;           /* SET THE 'SWITCHED TO EP' FLAG
*                                      OFF                           */
         OI    RLNSWNCP(CVAWKRDT),B'01000000'                      1545
         NI    RLNSWEP(CVAWKRDT),B'11111011'                       1545
*           CALL CVASR070;          /* ACTIVATE THE ENTRY            */
         BAL   @14,CVASR070                                        1546
*           RFY CVAR15 RSTD;                                       1547
*           IF CVAR15=0             /* ACTIVATE SUCCESSFUL?          */
*             THEN                                                 1548
         LTR   CVAR15,CVAR15                                       1548
         BZ    @RT01548                                            1548
*             ;                     /* YES -  EXIT                   */
*           ELSE                    /* NO - ACTIVATE FAILED          */
*             DO;                                                  1550
*             RFY CVAR15 UNRSTD;                                   1551
*             CVAACT='0'B;          /* SET 'ACTIVATE PEP LINE' SWITCH
*                                      OFF                           */
         NI    CVAACT,B'11111110'                                  1552
*             CALL CVASR053;        /* GO SWITCH PEP LINE BACK TO THE
*                                      ORIGINAL STATUS               */
         BAL   @14,CVASR053                                        1553
*             RLNSWNCP='0'B;        /* SET 'SWITCHED TO NCP' FLAG OFF*/
*             RLNSWEP='1'B;         /* SET 'SWITCHED TO EP' FLAG ON  */
         OI    RLNSWEP(CVAWKRDT),B'00000100'                       1555
         NI    RLNSWNCP(CVAWKRDT),B'10111111'                      1555
*             RPRONLIN=CVAOFF;      /* SET ONLINE OFF        @D32CKDQ*/
         NI    RPRONLIN(CVAWKRDT),B'11110111'                      1556
*             CVAERRSW=CVAON;       /*INDICATE ERROR         @D32CKDQ*/
         OI    CVAERRSW,B'00000100'                                1557
*             END;                                                 1558
*                     /*ACTIVATE PEP SW WAS TURNED OFF -DO NOT*/   1559
*                     /*ACTIVATE THIS TYPE=PEP USE =EP LINE  @DA04899*/
*   CVAR14=CVARS050;                /* RESTORE RETURN REG            */
@RT01548 L     CVAR14,CVARS050                                     1559
*   END CVASR050;                   /* RETURN TO CALLER              */
@EL00006 DS    0H                                                  1560
@EF00006 DS    0H                                                  1560
@ER00006 BR    @14                                                 1560
@PB00006 DS    0H                                                  1561
*   GEN(  EJECT);                                                  1561
           EJECT
*CVASR053:                                                         1562
*   PROC OPTIONS(NOSAVE NOSAVEAREA);                               1562
*                                                                  1562
         B     @PB00007                                            1562
CVASR053 DS    0H                                                  1563
*   /*****************************************************************/
*   /*                                                               */
*   /* SWITCH PEP LINE STATUS SUBROUTINE:  IF THE COMMAND IS AGAINST */
*   /* THE LINE OR THE PEP LINE IS GENNED USE =NCP THEN BUILD A     */
*   /* SWITCH TO NCP REQUEST UNIT. IF                                */
*   /* THE INTERNAL ACTIVATE SWITCH IS OFF AT ENTRY TO THIS          */
*   /* SUBROUTINE, BUILD A SWITCH TO EP REQUEST UNIT.                */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1563
*   CVARS053=CVAR14;                /* SAVE RETURN REGISTER          */
         ST    CVAR14,CVARS053                                     1563
*   IF CVAACT='1'B                  /* ACTIVATE PEP LINE SWITCH ON?  */
*     THEN                          /* YES -                         */
         TM    CVAACT,B'00000001'                                  1564
         BNO   @RF01564                                            1564
*       NCSPLCMD=NCSCSNC;           /* INDICATE 'SWITCH TO NCP'      */
         MVC   NCSPLCMD(2,NCSPLPTR),@CB01834                       1565
*     ELSE                          /* ACTIVATE SWITCH NOT ON -      */
*       NCSPLCMD=NCSCSEP;           /* INDICATE 'SWITCH TO EP'       */
         B     @RC01564                                            1566
@RF01564 MVC   NCSPLCMD(2,NCSPLPTR),@CB01832                       1566
*   CALL CVASR054;                  /* GO BUILD REQUEST UNIT  */   1567
@RC01564 BAL   @14,CVASR054                                        1567
*   CVAR14=CVARS053;                /* RESTORE THE RETURN REGISTER   */
         L     CVAR14,CVARS053                                     1568
*   END CVASR053;                   /* RETURN TO CALLER              */
@EL00007 DS    0H                                                  1569
@EF00007 DS    0H                                                  1569
@ER00007 BR    @14                                                 1569
@PB00007 DS    0H                                                  1570
*   GEN(  EJECT);                                                  1570
           EJECT
*CVASR054:                                                         1571
*   PROC OPTIONS(NOSAVE NOSAVEAREA);                               1571
*                                                                  1571
         B     @PB00008                                            1571
CVASR054 DS    0H                                                  1572
*   /*****************************************************************/
*   /*                                                               */
*   /* SWITCH PEP LINE REQUEST UNIT BUILD SUBROUTINE                 */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1572
*   CVARS054=CVAR14;                /* SAVE RETURN REGISTER          */
         ST    CVAR14,CVARS054                                     1572
*   IF CVAACT='1'B                  /* ACTIVATE PEP LINE SWITCH ON?  */
*     THEN                                                         1573
         TM    CVAACT,B'00000001'                                  1573
         BNO   @RF01573                                            1573
*       CVARUO1='51'X;              /* YES - INDICATE SWITCH TO NCP  */
         MVI   CVARUO1,X'51'                                       1574
*     ELSE                                                         1575
*       CVARUO1='52'X;              /* NO - INDICATE SWITCH TO EP    */
         B     @RC01573                                            1575
@RF01573 MVI   CVARUO1,X'52'                                       1575
*   IF RLNPORT=CVAON                /* IF LINE IS A PORT     @DM12066*/
*     THEN CVARUO23=RPTLNDAF;       /* GET DAF FROM PORT     @DM12066*/
@RC01573 TM    RLNPORT(CVAWKRDT),B'00010000'                       1576
         BNO   @RF01576                                            1576
         MVC   CVARUO23(2),RPTLNDAF(CVAWKRDT)                      1577
*     ELSE CVARUO23=RPRDAF;         /* PUT LINE'S DAF IN RU  @DM12066*/
         B     @RC01576                                            1578
@RF01576 MVC   CVARUO23(2),RPRDAF(CVAWKRDT)                        1578
*   NCSPLRUO=ADDR(CVARUOUT);        /* PUT ADDRESS OF OUTBOUND RU IN
*                                      NCSPL                         */
@RC01576 LA    @15,CVARUOUT                                        1579
         ST    @15,NCSPLRUO(,NCSPLPTR)                             1579
*   NCSPLOLN=CVA3;                  /* PUT LENGTH OF RU IN NCSPL     */
         MVC   NCSPLOLN(2,NCSPLPTR),@CH00323                       1580
*   NCSPLRUI=0;                     /* SET INBOUND RU ADDRESS IN THE
*                                      NCSPL TO ZERO                 */
         SLR   @15,@15                                             1581
         ST    @15,NCSPLRUI(,NCSPLPTR)                             1581
*   CALL CVASRCIO;                  /* CALL I/O INTERFACE ROUTINE    */
         BAL   @14,CVASRCIO                                        1582
*   CVAR14=CVARS054;                /* RESTORE RETURN REGISTER       */
         L     CVAR14,CVARS054                                     1583
*   END CVASR054;                   /* RETURN TO CALLER              */
@EL00008 DS    0H                                                  1584
@EF00008 DS    0H                                                  1584
@ER00008 BR    @14                                                 1584
@PB00008 DS    0H                                                  1585
*   GEN(  EJECT);                                                  1585
           EJECT
*CVASR060:                                                         1586
*   PROC OPTIONS(NOSAVE NOSAVEAREA);                               1586
*                                                                  1586
         B     @PB00009                                            1586
CVASR060 DS    0H                                                  1587
*   /*****************************************************************/
*   /*                                                               */
*   /* LINE PROCESSING SUBROUTINE                                    */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1587
*   RFY                                                            1587
*     ISTRPRE BASED(CVAWKRDT);                                     1587
*   RFY                                                            1588
*     ISTRLN BASED(CVAWKRDT);                                      1588
*   CVARS060=CVAR14;                /* SAVE RETURN REG               */
         ST    CVAR14,CVARS060                                     1589
*   IF RLNRAPEP=CVAON               /* PEP LINE?                     */
*     THEN                          /* YES -                         */
         TM    RLNRAPEP(CVAWKRDT),B'00000001'                      1590
         BNO   @RF01590                                            1590
*     IF CVANEWSG=CVAON ×    /* IS THIS A NEW RDT SEGMENT OR @X50BHC8*/
*        CVAWKRDT=RDTEPTR     /* CMD AGAINST THIS ENTRY?     @X50BHC8*/
*        THEN                                                      1591
         TM    CVANEWSG,B'01000000'                                1591
         BO    @RT01591                                            1591
         C     CVAWKRDT,RDTEPTR                                    1591
         BNE   @RF01591                                            1591
@RT01591 DS    0H                                                  1592
*           DO;                                            /*@X50BHC8*/
*       RPRONLIN=CVAON;             /* TURN ON ONLINE BIT            */
         OI    RPRONLIN(CVAWKRDT),B'00001000'                      1593
*       CALL CVASR050;              /* PROCESS PEP LINE              */
         BAL   @14,CVASR050                                        1594
*     END;                                                         1595
*    ELSE;                                                 /*@X50BHC8*/
@RF01591 DS    0H                                                  1597
*   ELSE                            /* NO PEP LINE FOUND -           */
*   DO;                                                    /*@D32CKDQ*/
         B     @RC01590                                            1597
@RF01590 DS    0H                                                  1598
*     RFY CVAR15 RSTD;                                     /*@D32CKDQ*/
*     CALL CVASR070;                /* ACTIVATE THE LINE             */
         BAL   @14,CVASR070                                        1599
*     IF CVAR15^=CVA0                                              1600
*       THEN;                       /*NOT SUCCESSFUL EXIT    @D32CKDQ*/
         LTR   CVAR15,CVAR15                                       1600
         BNZ   @RT01600                                            1600
*       ELSE                                                       1602
*       DO;                         /*SUCCESSFULE - CONT     @D32CKDQ*/
*         RFY CVAR15 UNRSTD;                               /*@D32CKDQ*/
*     IF RLNRATRN=CVAON &  RLNRACAT=CVAON                          1604
*       THEN                        /*DIAL IN OR IN/OUT      @D32CKDQ*/
         TM    RLNRATRN(CVAWKRDT),B'00000010'                      1604
         BNO   @RF01604                                            1604
         TM    RLNRACAT(CVAWKRDT),B'10000000'                      1604
         BNO   @RF01604                                            1604
*       DO;                        /*SDLC LINK               @D32CKDQ*/
*       IF (RDTEPTR=CVAWKRDT &    /* CMD FOR THIS ENTRY AND  @X50BHC8*/
*           NCSANS=CVAON &        /* ANS SPECIFIED AND       @X50BHC8*/
*           NCSPLANS=CVAON) ×     /* ENABLE ANDSWER REQUESTED */   1606
*          (RDTEPTR^=CVAWKRDT &   /* CMD NOT FOR THIS ENTRY AND */ 1606
*           RLNANSWR=CVAON) ×     /* ENABLE ANSWER MODE OR   @X50BHC8*/
*          (RDTEPTR=CVAWKRDT &    /* CMD FOR THIS ENTRY AND  @X50BHC8*/
*           NCSANS=CVAOFF &       /* ANS NOT SPECIFIED AND   @X50BHC8*/
*           RLNANSWR=CVAON)       /* ENABLE ANSWER MODE      @X50BHC8*/
*           THEN                                                   1606
         C     CVAWKRDT,RDTEPTR                                    1606
         BNE   @GL00041                                            1606
         TM    NCSANS(NCSPLPTR),B'00100100'                        1606
         BO    @RT01606                                            1606
@GL00041 C     CVAWKRDT,RDTEPTR                                    1606
         BE    @GL00040                                            1606
         TM    RLNANSWR(CVAWKRDT),B'01000000'                      1606
         BO    @RT01606                                            1606
@GL00040 C     CVAWKRDT,RDTEPTR                                    1606
         BNE   @RF01606                                            1606
         TM    NCSANS(NCSPLPTR),B'00000100'                        1606
         BNZ   @RF01606                                            1606
         TM    RLNANSWR(CVAWKRDT),B'01000000'                      1606
         BNO   @RF01606                                            1606
@RT01606 DS    0H                                                  1607
*              DO;                                         /*@X50BHC8*/
*             CVAR1=NCSPLPTR;       /*INPUT TO CV2           #D32CKDQ*/
         LR    CVAR1,NCSPLPTR                                      1608
*             NCSPLRAD=CVAWKRDT;    /*SDLC LINK              #D32CKDQ*/
         ST    CVAWKRDT,NCSPLRAD(,NCSPLPTR)                        1609
*             NCSPLANS=CVAON;        /*TELLS CV2 TO ENABLE   #D32CKDQ*/
         OI    NCSPLANS(NCSPLPTR),B'00100000'                      1610
*             CALL ISTINCV2;         /* ENABLE ANSWER MODE   #D32CKDQ*/
*                                                                  1611
         L     @15,@CV05551                                        1611
         BALR  @14,@15                                             1611
*              DO;                                                 1612
*/***  CRRMAINT  PROCNM(ISTINCVA)COMP(VY)FUNC(RET)RPHADD((NCSPLRPH))  *
**/                                                                1613
*              /*** CLEAR AND SET CURRENT PROCEDURE BIT ***/       1613
*NCSPLRPH->RPHCRR->CRACRR->VYCCRT = '0'B;                          1613
         L     @15,NCSPLRPH(,NCSPLPTR)                             1613
         L     @15,RPHCRR(,@15)                                    1613
         L     @15,CRACRR(,@15)                                    1613
         XC    VYCCRT+1(11,@15),VYCCRT+1(@15)                      1613
         MVI   VYCCRT(@15),B'00000000'                             1613
*NCSPLRPH->RPHCRR->CRACRR->CINCVA = '1'B;                          1614
         OI    CINCVA(@15),B'00000010'                             1614
*              END;      /*#D32CKDQ*/                              1615
*             END;                                         /*#D32CKDQ*/
*           ELSE                                           /*@X50BHC8*/
*              IF RDTEPTR=CVAWKRDT & /* CMD FOR THIS ENTRY AND */  1617
*                 NCSANS=CVAON &    /* ANS SPECIFIED AND     @X50BHC8*/
*                 NCSPLANS=CVAOFF   /* ENABLE ANSWER NOT SPECIFIED */
*                 THEN                                             1617
         B     @RC01606                                            1617
@RF01606 C     CVAWKRDT,RDTEPTR                                    1617
         BNE   @RF01617                                            1617
         TM    NCSANS(NCSPLPTR),B'00000100'                        1617
         BNO   @RF01617                                            1617
         TM    NCSPLANS(NCSPLPTR),B'00100000'                      1617
         BNZ   @RF01617                                            1617
*                    DO;                                   /*@X50BHC8*/
*                      NCSANSMD=CVAON;  /* CHECKPOINT ANSWER MODE BIT *
         OI    NCSANSMD(NCSPLPTR),B'10000000'                      1619
*                      RLNANSWR=CVAOFF; /* DISABLE ANSWER MODE IN THE
*                                            RDTE            @X50BHC8*/
         NI    RLNANSWR(CVAWKRDT),B'10111111'                      1620
*                    END;                                  /*@X50BHC8*/
*                 ELSE;                                    /*@X50BHC8*/
@RF01617 DS    0H                                                  1623
*         END;                                             /*#D32CKDQ*/
*       ELSE;                                              /*#D32CKDQ*/
@RF01604 DS    0H                                                  1625
*     END;                                                 /*#D32CKDQ*/
@RC01604 DS    0H                                                  1626
*    END;                                                  /*#D32CKDQ*/
@RT01600 DS    0H                                                  1627
*   IF CVAERRSW=CVAOFF            /*IF SUCCESS AND           #D32CKDQ*/
*     & RDTEPTR=CVAWKRDT         /*CMD FOR THIS LINE         #D32CKDQ*/
*     & RDTEPTR->RLNRACAT=CVAOFF   /*AND NON-DIAL LINE       #D32CKDQ*/
*     & RDTEPTR->RLNRACAN=CVAOFF                                   1627
*     THEN                                                         1627
@RC01590 TM    CVAERRSW,B'00000100'                                1627
         BNZ   @RF01627                                            1627
         L     @15,RDTEPTR                                         1627
         CR    @15,CVAWKRDT                                        1627
         BNE   @RF01627                                            1627
         TM    RLNRACAT(@15),B'11000000'                           1627
         BNZ   @RF01627                                            1627
*     DO;                          /*YES-LOOK FOR CLUSTERS   #XM09723
*                                   AND DUMMY TERMS          #XM09723*/
*       CVAWKSAV=CVAWKRDT;         /*SAVE WORK RDT           #XM09723*/
         ST    CVAWKRDT,CVAWKSAV                                   1629
*       CVALOOP2=CVAON;            /*INIT LOOP SW            #XM09723*/
         OI    CVALOOP2,B'00100000'                                1630
*       DO WHILE CVALOOP2=CVAON;                           /*#XM09723*/
         B     @DE01631                                            1631
@DL01631 DS    0H                                                  1632
*         IF RPRENTED=CVAON        /*LAST ENTRY?             #XM09723*/
*           THEN CVALOOP2=CVAOFF;  /*YES-DONE LOOP           #XM09723*/
         TM    RPRENTED(CVAWKRDT),B'00000100'                      1632
         BNO   @RF01632                                            1632
         NI    CVALOOP2,B'11011111'                                1633
*           ELSE                                                   1634
*           DO;                    /*LOOK FOR CLUSTERS AND   #XM09723
*                                   DUMMY TERMS              #XM09723*/
         B     @RC01632                                            1634
@RF01632 DS    0H                                                  1635
*             CVAWKRDT=CVAWKRDT+RPRELEN;/*NEXT ENTRY         #XM09723*/
         AH    CVAWKRDT,RPRELEN(,CVAWKRDT)                         1635
*             IF RPRENTRY>CVAWKSAV->RPRENTRY                       1636
*               THEN               /*WITHIN SCOPE OF NODE    #XM09723*/
         L     @15,CVAWKSAV                                        1636
         CLC   RPRENTRY(1,CVAWKRDT),RPRENTRY(@15)                  1636
         BNH   @RF01636                                            1636
*               IF (RPRENTRY=RPRENTCL  /*CLUSTER?            #XM09723*/
*                 ×(RPRENTRY=RPRENTTR                              1637
*                   &DEVSUBND=CVAON)) /*OR DUMMY TERM        #D32CKDQ*/
*                 & RPRONLIN=CVAON    /*AND ONLINE           #XM09723*/
*                 THEN                /*YES=SET DEVOF OFF IN #XM09723*/
         CLI   RPRENTRY(CVAWKRDT),X'70'                            1637
         BE    @GL00049                                            1637
         CLI   RPRENTRY(CVAWKRDT),X'80'                            1637
         BNE   @RF01637                                            1637
         TM    DEVSUBND+44(CVAWKRDT),B'00010000'                   1637
         BNO   @RF01637                                            1637
@GL00049 TM    RPRONLIN(CVAWKRDT),B'00001000'                      1637
         BNO   @RF01637                                            1637
*                                     /*VARYS FMCB           #XM09723*/
*                   DO;                                    /*@ZA15113*/
*                  RPRNCBA->NCBFMCBA->FMCDEVOF=CVAOFF;     /*#XM09723*/
         L     @15,RPRNCBA(,CVAWKRDT)                              1639
         L     @15,NCBFMCBA(,@15)                                  1639
         NI    FMCDEVOF(@15),B'11101111'                           1639
*                  IF RPRENTRY=RPRENTTR /* IF TERMINAL       @ZA15113*/
*                     THEN                                 /*@ZA15113*/
         CLI   RPRENTRY(CVAWKRDT),X'80'                            1640
         BNE   @RF01640                                            1640
*                       RPRINIMM=CVAOFF;  /* MAKE USUABLE    @ZA15113*/
         NI    RPRINIMM(CVAWKRDT),B'11111110'                      1641
*                   END;                                   /*@ZA15113*/
*                 ELSE;            /*LOOK AT NEXT            #XM09723*/
@RF01637 DS    0H                                                  1644
*               ELSE CVALOOP2=CVAOFF;/*OUT OF SCOPE OF NODE  #XM09723*/
         B     @RC01636                                            1644
@RF01636 NI    CVALOOP2,B'11011111'                                1644
*             END;                                         /*#XM09723*/
@RC01636 DS    0H                                                  1646
*       END;                       /*DO WHILE                #XM09723*/
@RC01632 DS    0H                                                  1646
@DE01631 TM    CVALOOP2,B'00100000'                                1646
         BO    @DL01631                                            1646
*       CVAWKRDT=CVAWKSAV;         /*RESTOR WORK RDT         #XM09723*/
         L     CVAWKRDT,CVAWKSAV                                   1647
*      END;                        /*ERROR AND NON DIAL      #XM09723*/
*      ELSE;                                                       1649
@RF01627 DS    0H                                                  1650
*   CVAR14=CVARS060;                /* RESTORE RETURN REG            */
         L     CVAR14,CVARS060                                     1650
*   END CVASR060;                   /* RETURN TO CALLER              */
@EL00009 DS    0H                                                  1651
@EF00009 DS    0H                                                  1651
@ER00009 BR    @14                                                 1651
@PB00009 DS    0H                                                  1652
*   GEN(  EJECT);                                                  1652
           EJECT
*CVASR070:                                                         1653
*   PROC OPTIONS(NOSAVE NOSAVEAREA);                               1653
*                                                                  1653
         B     @PB00010                                            1653
CVASR070 DS    0H                                                  1654
*   /*****************************************************************/
*   /*                                                               */
*   /* LINE ACTIVATE SUBROUTINE                                      */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1654
*   RFY                                                            1654
*     ISTRPRE BASED(CVAWKRDT);                                     1654
*   RFY                                                            1655
*     ISTRLN BASED(CVAWKRDT);                                      1655
*   RFY                                                            1656
*     ISTRPT BASED(CVAWKRDT);                                      1656
*   RFY                                                            1657
*     CVAR15 RSTD;                                                 1657
*   CVARS070=CVAR14;                /* SAVE RETURN REG               */
         ST    CVAR14,CVARS070                                     1658
*   CALL CVASR100;                  /* GO TO SUBENTRY SYNTAX CHECK   */
         BAL   @14,CVASR100                                        1659
*   IF CVAR15=0                     /* SYNTAX CHECK OK?              */
*     THEN DO;                      /* SYNTAX CHECK GOOD -           */
         LTR   CVAR15,CVAR15                                       1660
         BNZ   @RF01660                                            1660
*       NCSPLCMD=NCSCACTL;          /* INDICATE 'ACTIVATE LINK' CMD  */
         MVC   NCSPLCMD(2,NCSPLPTR),@CB01822                       1662
*       CVARUO1='01'X;              /* BUILD THE OUTBOUND RU -       */
         MVI   CVARUO1,X'01'                                       1663
*       CVARUO2='02'X;                                             1664
         MVI   CVARUO2,X'02'                                       1664
*       CVARUO3='0A'X;                                             1665
         MVI   CVARUO3,X'0A'                                       1665
*       IF RLNPORT='1'B             /* IS THIS ENTRY A PORT LINE?    */
*         THEN                                                     1666
         TM    RLNPORT(CVAWKRDT),B'00010000'                       1666
         BNO   @RF01666                                            1666
*         DO;                       /* YES - GET LINE'S DAF FROM PORT*/
*           CVACID=RPTLNCID;        /* GET CID FROM PORT             */
         L     @07,RPTLNCID(,CVAWKRDT)                             1668
         ST    @07,CVACID                                          1668
*           CVARUO45=CVADAF;        /* PUT PORT LINE'S DAF IN RU     */
         MVC   CVARUO45(2),CVADAF                                  1669
*         END;                                                     1670
*       ELSE                                                       1671
*         CVARUO45=RPRDAF;          /* PUT LINE'S DAF IN RU          */
         B     @RC01666                                            1671
@RF01666 MVC   CVARUO45(2),RPRDAF(CVAWKRDT)                        1671
*       NCSPLRUO=ADDR(CVARUOUT);    /* PUT ADDRESS OF OUTBOUND RU IN
*                                      NCSPL                         */
@RC01666 LA    @07,CVARUOUT                                        1672
         ST    @07,NCSPLRUO(,NCSPLPTR)                             1672
*       NCSPLOLN=CVA5;              /* PUT LENGTH OF RU IN NCSPL     */
         MVC   NCSPLOLN(2,NCSPLPTR),@CH00832                       1673
*       NCSPLRUI=ADDR(CVARUIN);    /* SET INBOUND RU ADDRESS IN THE
*                                      NCSPL TO ZERO                 */
         LA    @07,CVARUIN                                         1674
         ST    @07,NCSPLRUI(,NCSPLPTR)                             1674
*       CALL CVASRCIO;              /* GO ACTIVATE RDTE              */
         BAL   @14,CVASRCIO                                        1675
*       IF NCSIORC=NCSIOSUC ×       /* ACTIVATE OK?          @X50BHC8*/
*          (NCSPLDS=CVAON &   /* VALID SENSE AND             @X50BHC8*/
*           CVARUI1=SRURRE &  /* FIRST BYTE OF RU OK AND     @X50BHC8*/
*           CVARUI2=CVAH15)   /* SECOND BYTE OF RU OK        @X50BHC8*/
*         THEN                      /* YES - EXIT(R15 = 0)           */
         CLI   NCSIORC(NCSPLPTR),X'00'                             1676
         BE    @RT01676                                            1676
         TM    NCSPLDS(NCSPLPTR),B'00001000'                       1676
         BNO   @RF01676                                            1676
         CLI   CVARUI1,X'08'                                       1676
         BNE   @RF01676                                            1676
         CLI   CVARUI2,21                                          1676
         BNE   @RF01676                                            1676
@RT01676 DS    0H                                                  1677
*         DO;                                                      1677
*           RLNACTLN='1'B;          /* MARK THE RDTE TO SHOW THAT THE
*                                      ACTIVATE LINK WAS DONE        */
         OI    RLNACTLN(CVAWKRDT),B'10000000'                      1678
*           RPRONLIN=CVAON;         /* SET ONLINE BIT ON             */
         OI    RPRONLIN(CVAWKRDT),B'00001000'                      1679
*           RPRINIMM=CVAOFF;        /* MAKE USUABLE          @ZA18901*/
         NI    RPRINIMM(CVAWKRDT),B'11111110'                      1680
*           NCSACTV=CVAON;  /* REFLECTS A CHANGE IN STATUS   @X50BHC8*/
         OI    NCSACTV(NCSPLPTR),B'10000000'                       1681
*           NCSAIMOD=CVAON;  /* REFLECTS ACTIVATION          @X50BHC8*/
         OI    NCSAIMOD(NCSPLPTR),B'10000000'                      1682
*           IF RLNPORT=CVAON        /* PORT?                         */
*             THEN                                                 1683
         TM    RLNPORT(CVAWKRDT),B'00010000'                       1683
         BNO   @RF01683                                            1683
*               DO;                                        /*@ZA30665*/
*             RPTPTHCT=RPTPTHCT+CVA1;/* YES - INCREMENT JUST THE   1685
*                                      PORT'S PATH COUNT             */
         LA    @07,1                                               1685
         AH    @07,RPTPTHCT(,CVAWKRDT)                             1685
         STH   @07,RPTPTHCT(,CVAWKRDT)                             1685
*             IF RPTUTERM^=0                               /*@ZA30665*/
*                THEN RPTUTERM->RPRINIMM='0'B;             /*@ZA30665*/
         L     @07,RPTUTERM(,CVAWKRDT)                             1686
         LTR   @07,@07                                             1686
         BZ    @RF01686                                            1686
         NI    RPRINIMM(@07),B'11111110'                           1687
*               END;                                       /*@ZA30665*/
*           ELSE                                                   1689
*             CALL CVASR071;        /* GO INCREMENT PATH COUNTS      */
         B     @RC01683                                            1689
@RF01683 BAL   @14,CVASR071                                        1689
*           CVAR15=0;               /* SET REG15 TO ZERO             */
@RC01683 SLR   CVAR15,CVAR15                                       1690
*         END;                                                     1691
*       ELSE                        /* NO -                          */
*         DO;                                                      1692
         B     @RC01676                                            1692
@RF01676 DS    0H                                                  1693
*           CVAERRSW=CVAON;         /* SET THE ERROR SWITCH ON       */
         OI    CVAERRSW,B'00000100'                                1693
*           CVANAME1=RPRNAME;       /* RESOURCENAME FOR MSG          */
         MVC   CVANAME1(8),RPRNAME(CVAWKRDT)                       1694
*           CVAMSG=ADDR(CVANAME1);  /* GET ADDRESS OF VARIABLE       */
         LA    @07,CVANAME1                                        1695
         ST    @07,CVAMSG                                          1695
*           IF CVAWKRDT=RDTEPTR     /* COMMAND RDTE?                 */
*             THEN                  /* YES -                         */
         C     CVAWKRDT,RDTEPTR                                    1696
         BNE   @RF01696                                            1696
*              CVAMSID@=ADDR(CVAMS612);/* GET ADDRESS OF 'ACTIVATE LINK
*                                      FAILED' MESSAGE               */
         LA    @07,CVAMS612                                        1697
         ST    @07,CVAMSID@                                        1697
*           ELSE                                                   1698
*            DO;                    /* NOT COMMAND RDTE -            */
         B     @RC01696                                            1698
@RF01696 DS    0H                                                  1699
*             CVAMSID@=ADDR(CVAMS631);/* GET ADDRESS OF 'UNABLE    1699
*                                      TO ACTIVATE LINK' MSG @D32CKDQ*/
         LA    @07,CVAMS631                                        1699
         ST    @07,CVAMSID@                                        1699
*             CALL CVATPMSG;        /* OUTPUT MSG                    */
         BAL   @14,CVATPMSG                                        1700
*            END;                                                  1701
*           NCSACTV=CVAON;   /* REFLECTS A CHANGE IN STATUS  @X50BHC8*/
@RC01696 OI    NCSACTV(NCSPLPTR),B'10000000'                       1702
*           NCSAIMOD=CVAOFF;  /* REFLECTS NOT ACTIVE         @X50BHC8*/
         NI    NCSAIMOD(NCSPLPTR),B'01111111'                      1703
*           RPRONLIN=CVAOFF;        /* SET ONLINE BIT OFF            */
         NI    RPRONLIN(CVAWKRDT),B'11110111'                      1704
*           CVAR15=4;               /* SET REG15 = 4 (ERROR)         */
         LA    CVAR15,4                                            1705
*         END;                                                     1706
*     END;                                                         1707
*   ELSE                                                           1708
*     DO;                           /* SYNTAX CHECK BAD -            */
         B     @RC01660                                            1708
@RF01660 DS    0H                                                  1709
*       RPRONLIN=CVAOFF;            /* TURN ONLINE BIT ON            */
         NI    RPRONLIN(CVAWKRDT),B'11110111'                      1709
*       NCSACTV=CVAON;  /* REFLECTS A CHANGE IN STATUS       @X50BHC8*/
         OI    NCSACTV(NCSPLPTR),B'10000000'                       1710
*       NCSAIMOD=CVAOFF;  /* REFLECTS NOT ACTIVE             @X50BHC8*/
         NI    NCSAIMOD(NCSPLPTR),B'01111111'                      1711
*       CVAERRSW=CVAON;             /* SET THE ERROR SWITCH ON       */
         OI    CVAERRSW,B'00000100'                                1712
*     END;                                                         1713
*   CVAR14=CVARS070;                /* RESTORE RETURN REG            */
@RC01660 L     CVAR14,CVARS070                                     1714
*   RETURN CODE(CVAR15);            /* RETURN TO CALLER WITH A RETURN
*                                      CODE                          */
@EL00010 DS    0H                                                  1715
@EF00010 DS    0H                                                  1715
@ER00010 BR    @14                                                 1715
*   RFY                                                            1716
*     CVAR15 UNRSTD;                                               1716
*   END CVASR070;                   /* END OF CVASR070               */
@PB00010 DS    0H                                                  1718
*   GEN(  EJECT);                                                  1718
           EJECT
*CVASR071:                                                         1719
*   PROC OPTIONS(NOSAVE NOSAVEAREA);                               1719
*                                                                  1719
         B     @PB00011                                            1719
CVASR071 DS    0H                                                  1720
*   /*****************************************************************/
*   /*                                                               */
*   /* PATH COUNT INCREMENT SUBROUTINE                               */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1720
*   RFY                                                            1720
*     ISTRPRE BASED(CVAWKRDT);                                     1720
*   RFY                                                            1721
*     ISTRGP BASED(CVAWKRDT);                                      1721
*   RFY                                                            1722
*     ISTRLN BASED(CVAWKRDT);                                      1722
*   CVARS071=CVAR14;                /* SAVE RETURN REGISTER          */
         ST    CVAR14,CVARS071                                     1723
*   IF RPRNSNEA->RPRENTRY=RPRENTGP&RPRNSNEA->RGPADIL=CVAON/* THIS  1724
*                                      ENTRY A DIAL LINE?            */
*     THEN                                                         1724
         L     @15,RPRNSNEA(,CVAWKRDT)                             1724
         CLI   RPRENTRY(@15),X'30'                                 1724
         BNE   @RF01724                                            1724
         TM    RGPADIL(@15),B'10000000'                            1724
         BO    @RT01724                                            1724
*     ;                             /* YES - QUIT                    */
*   ELSE                                                           1726
*     IF RPRENTED=CVAON             /* LAST ENTRY?                   */
*       THEN                                                       1726
@RF01724 TM    RPRENTED(CVAWKRDT),B'00000100'                      1726
         BO    @RT01726                                            1726
*       ;                           /* YES - QUIT                    */
*     ELSE                                                         1728
*       DO;                                                        1728
*         CVAWKSAV=CVAWKRDT;        /* SAVE WORK RDTE POINTER        */
         ST    CVAWKRDT,CVAWKSAV                                   1729
*         CVAWKRDT=CVAWKRDT+RPRELEN;/* GET THE NEXT ENTRY            */
         AH    CVAWKRDT,RPRELEN(,CVAWKRDT)                         1730
*         CVALOOP2=CVAON;           /* SET LOOP CONTROL SW ON        */
         OI    CVALOOP2,B'00100000'                                1731
*         DO WHILE RPRENTRY>CVAWKSAV->RPRENTRY&CVALOOP2=CVAON;     1732
         B     @DE01732                                            1732
@DL01732 DS    0H                                                  1733
*           CVAWKSV2=RPRNSNEA;      /* GET THE NEXT HIGHER NODE      */
         L     @15,RPRNSNEA(,CVAWKRDT)                             1733
         ST    @15,CVAWKSV2                                        1733
*           CVALOOP3='1'B;          /* SET LOOP CONTROL SWITCH ON    */
         OI    CVALOOP3,B'00010000'                                1734
*           DO WHILE CVALOOP3='1'B; /* MAKE SURE THE PATH TO THIS NODE
*                                      IS ACTIVE             @DM10682*/
         B     @DE01735                                            1735
@DL01735 DS    0H                                                  1736
*             IF CVAWKSV2->RPRONLIN='1'B /* THIS HIGHER NODE ONLINE? */
*               THEN                                               1736
         L     @15,CVAWKSV2                                        1736
         TM    RPRONLIN(@15),B'00001000'                           1736
         BNO   @RF01736                                            1736
*                 IF CVAWKSV2->RPRENTRY=RPRENTRN /* YES - THIS THE RN
*                                      ENTRY?                @DM10682*/
*                  THEN DO;                                /*@DM10682*/
         CLI   RPRENTRY(@15),X'01'                                 1737
         BNE   @RF01737                                            1737
*                    CVALOOP3='0'B; /* YES - THE COMPLETE PATH IS  1739
*                                      ONLINE                @DM10682*/
         NI    CVALOOP3,B'11101111'                                1739
*                    RPRPTHCT=RPRPTHCT+CVA1;/* INCREMENT PATH COUNT  */
         LA    @15,1                                               1740
         SLR   @07,@07                                             1740
         IC    @07,RPRPTHCT(,CVAWKRDT)                             1740
         ALR   @15,@07                                             1740
         STC   @15,RPRPTHCT(,CVAWKRDT)                             1740
*           IF CVASGMNT=CVAOFF      /*IF CMD FOR LINE        @DA04861*/
*             & CVANEWSG=CVAOFF     /*AND NOT FOR 370X       @DA04861*/
*             & RPRENTRY=RPRENTTR   /*AND DUMMY TERMINAL     @DA04861*/
*             & DEVSUBND=CVAON                                     1741
*             & RPRONLIN=CVAOFF     /*IS OFFLINE             @DA04861*/
*             THEN                  /*THEN OPNDST IT         @DA04861*/
         TM    CVASGMNT,B'01010000'                                1741
         BNZ   @RF01741                                            1741
         CLI   RPRENTRY(CVAWKRDT),X'80'                            1741
         BNE   @RF01741                                            1741
         TM    DEVSUBND+44(CVAWKRDT),B'00010000'                   1741
         BNO   @RF01741                                            1741
         TM    RPRONLIN(CVAWKRDT),B'00001000'                      1741
         BNZ   @RF01741                                            1741
*             DO;                                          /*@DA04861*/
*               CALL CVASR080;                             /*@DA04861*/
         BAL   @14,CVASR080                                        1743
*               CVAGOSW=CVAON;      /* INSURE GOOD PATH      @DA04861*/
*               CVAERRSW=CVAOFF;                           /*@DA04861*/
         OI    CVAGOSW,B'10000000'                                 1745
         NI    CVAERRSW,B'11111011'                                1745
*              END;                                        /*@DA04861*/
*            ELSE;                                         /*@DA04861*/
@RF01741 DS    0H                                                  1748
*                   END;                                   /*#DM10682*/
*                  ELSE                                            1749
*                   CVAWKSV2=CVAWKSV2->RPRNSNEA;/* NO - GET THE NEXT
*                                      HIGHER NODE           @DM10682*/
         B     @RC01737                                            1749
@RF01737 L     @15,CVAWKSV2                                        1749
         L     @15,RPRNSNEA(,@15)                                  1749
         ST    @15,CVAWKSV2                                        1749
*               ELSE                                               1750
*                 CVALOOP3='0'B;    /* HIGHER NODE NOT ONLINE - STOP
*                                      LOOKING AND DON'T SET THE PATH
*                                      COUNT                 @DM10682*/
         B     @RC01736                                            1750
@RF01736 NI    CVALOOP3,B'11101111'                                1750
*          END;                     /* END OF LOOP 3         #DM10682*/
@RC01736 DS    0H                                                  1751
@DE01735 TM    CVALOOP3,B'00010000'                                1751
         BO    @DL01735                                            1751
*           IF RPRENTED=CVAON       /* LAST ENTRY?                   */
*             THEN                                                 1752
         TM    RPRENTED(CVAWKRDT),B'00000100'                      1752
         BNO   @RF01752                                            1752
*             CVALOOP2=CVAOFF;      /* YES - QUIT                    */
         NI    CVALOOP2,B'11011111'                                1753
*           ELSE                                                   1754
*             CVAWKRDT=CVAWKRDT+RPRELEN;/* GET NEXT ENTRY            */
         B     @RC01752                                            1754
@RF01752 AH    CVAWKRDT,RPRELEN(,CVAWKRDT)                         1754
*         END;                                                     1755
@RC01752 DS    0H                                                  1755
@DE01732 L     @15,CVAWKSAV                                        1755
         CLC   RPRENTRY(1,CVAWKRDT),RPRENTRY(@15)                  1755
         BNH   @DC01732                                            1755
         TM    CVALOOP2,B'00100000'                                1755
         BO    @DL01732                                            1755
@DC01732 DS    0H                                                  1756
*         CVAWKRDT=CVAWKSAV;        /* RESTORE WORK POINTER  @DM10682*/
         L     CVAWKRDT,CVAWKSAV                                   1756
*       END;                                                       1757
*   CVAR14=CVARS071;                /* RESTORE RETURN REGISTER       */
@RT01726 DS    0H                                                  1758
@RT01724 L     CVAR14,CVARS071                                     1758
*   END CVASR071;                   /* RETURN TO CALLER              */
@EL00011 DS    0H                                                  1759
@EF00011 DS    0H                                                  1759
@ER00011 BR    @14                                                 1759
@PB00011 DS    0H                                                  1760
*   GEN(  EJECT);                                                  1760
           EJECT
*CVASR080:                                                         1761
*   PROC OPTIONS(NOSAVE NOSAVEAREA);                               1761
*                                                                  1761
         B     @PB00012                                            1761
CVASR080 DS    0H                                                  1762
*   /*****************************************************************/
*   /*                                                               */
*   /* 370X, LOCAL, CLUSTER, PORT, CLUSTER CONTROLLER, AND LOGICAL   */
*   /* UNIT OPEN/ALLOCATE INTERFACE SUBROUTINE                       */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1762
*   CVARS080=CVAR14;                /* SAVE RETURN REGISTER          */
         ST    CVAR14,CVARS080                                     1762
*   CVARADSV=NCSPLRAD;              /* SAVE CURRENT VALUE OF NCSPLRAD*/
         L     @15,NCSPLRAD(,NCSPLPTR)                             1763
         ST    @15,CVARADSV                                        1763
*   NCSPLRAD=CVAWKRDT;              /* SET NCSPLRAD TO CURRENT     1764
*                                      WORK RDTE ADDRESS             */
         ST    CVAWKRDT,NCSPLRAD(,NCSPLPTR)                        1764
*   CVAR1=NCSPLPTR;                 /* PUT THE NCSPL ADDRESS IN REG 1*/
         LR    CVAR1,NCSPLPTR                                      1765
*   RFY                                                            1766
*     (CVAR0,CVAR15) RSTD;                                         1766
*   CALL ISTINCVO;                  /* GO DO SESSION INIT PROCESSING */
*                                                                  1767
         L     @15,@CV05567                                        1767
         BALR  @14,@15                                             1767
*    DO;                                                           1768
*/***  CRRMAINT  PROCNM(ISTINCVA)COMP(VY)FUNC(RET)RPHADD((NCSPLRPH))  *
**/                                                                1769
*    /*** CLEAR AND SET CURRENT PROCEDURE BIT ***/                 1769
*NCSPLRPH->RPHCRR->CRACRR->VYCCRT = '0'B;                          1769
         L     @07,NCSPLRPH(,NCSPLPTR)                             1769
         L     @07,RPHCRR(,@07)                                    1769
         L     @07,CRACRR(,@07)                                    1769
         XC    VYCCRT+1(11,@07),VYCCRT+1(@07)                      1769
         MVI   VYCCRT(@07),B'00000000'                             1769
*NCSPLRPH->RPHCRR->CRACRR->CINCVA = '1'B;                          1770
         OI    CINCVA(@07),B'00000010'                             1770
*    END;                                                          1771
*   NCSPLRAD=CVARADSV;              /* RESTORE ORIGINAL RAD VALUE    */
         L     @07,CVARADSV                                        1772
         ST    @07,NCSPLRAD(,NCSPLPTR)                             1772
*   IF NCSIORC=NCSIOSUC             /* SUCCESSFUL SESSION INITIATION?*/
*     THEN                                                         1773
         CLI   NCSIORC(NCSPLPTR),X'00'                             1773
         BNE   @RF01773                                            1773
*       DO;                         /* YES -                         */
*         CVAGOSW='1'B;             /* TURN ON THE GO SWITCH         */
*         CVAERRSW='0'B;            /* MAKE SURE THE ERROR SW IS OFF */
         OI    CVAGOSW,B'10000000'                                 1776
         NI    CVAERRSW,B'11111011'                                1776
*       END;                                                       1777
*     ELSE                                                         1778
*       DO;                         /* INITIATION NOT SUCCESSFUL -   */
         B     @RC01773                                            1778
@RF01773 DS    0H                                                  1779
*         CVACVOMG=CVAR0->CVAMSGID; /* GET MESSAGE ID PASSED FROM CVO
*                                                            @DM14912*/
         LR    @07,CVAR0                                           1779
         MVC   CVACVOMG(4),CVAMSGID(@07)                           1779
*         CVAMSID@=ADDR(CVACVOMG);  /* SET POINTER TO MSG ID @DM14912*/
         LA    @07,CVACVOMG                                        1780
         ST    @07,CVAMSID@                                        1780
*         CVACVOWA=CVAR15->CVACVOWK;/* COPY MESSAGE PARAMETERS PASSED
*                                      FROM ISTINCVO         @DM14912*/
         MVC   CVACVOWA(24),CVACVOWK(CVAR15)                       1781
*         CVAMSG=ADDR(CVACVOWA);    /* SET POINTER TO MESSAGE PARMS
*                                                            @DM14912*/
         LA    @07,CVACVOWA                                        1782
         ST    @07,CVAMSG                                          1782
*         CVAGOSW='0'B;             /* MAKE SURE THE GO SWITCH IS OFF*/
*         CVAERRSW='1'B;            /* TURN THE ERROR SWITCH ON      */
         OI    CVAERRSW,B'00000100'                                1784
         NI    CVAGOSW,B'01111111'                                 1784
*       END;                                                       1785
*   CVAR14=CVARS080;                /* RESTORE RETURN ADDRESS        */
@RC01773 L     CVAR14,CVARS080                                     1786
*   RFY                                                            1787
*     (CVAR0,CVAR15) UNRSTD;                                       1787
*   END CVASR080;                   /* RETURN TO CALLER              */
@EL00012 DS    0H                                                  1788
@EF00012 DS    0H                                                  1788
@ER00012 BR    @14                                                 1788
@PB00012 DS    0H                                                  1789
*   GEN(  EJECT);                                                  1789
           EJECT
*CVASRCLU:                                                         1790
*   PROC OPTIONS(NOSAVE NOSAVEAREA);                               1790
*                                                                  1790
         B     @PB00013                                            1790
CVASRCLU DS    0H                                                  1791
*   /*****************************************************************/
*   /*                                                               */
*   /* CLUSTER PROCESSING SUBROUTINE                                 */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1791
*   RFY                                                            1791
*     ISTRPRE BASED(CVAWKRDT);                                     1791
*   RFY                                                            1792
*     ISTRCC BASED(CVAWKRDT);                                      1792
*   RFY                                                            1793
*     ISTRLU BASED(CVAWKRDT);                                      1793
*   RFY                                                            1794
*     ISTRRN BASED(CVAWKRDT);                                      1794
*   RFY                                                            1795
*    (CVAR0,                                                       1795
*     CVAR15)RSTD;                                                 1795
*   CVARSCLU=CVAR14;                /* SAVE RETURN REGISTER          */
         ST    CVAR14,CVARSCLU                                     1796
*   CALL CVASR100;                  /*CHECK INVALID BIT      @D32CKDQ*/
         BAL   @14,CVASR100                                        1797
*   IF CVAR15^=CVA0                                                1798
*     THEN                          /*INVALID                @X50BHC8*/
         LTR   CVAR15,CVAR15                                       1798
         BZ    @RF01798                                            1798
*        DO;                                               /*@X50BHC8*/
*          NCSACTV=CVAON;  /* REFLECTS A CHANGE IN STATUS    @X50BHC8*/
         OI    NCSACTV(NCSPLPTR),B'10000000'                       1800
*          NCSAIMOD=CVAOFF;  /* REFLECTS NOT ACTIVE          @X50BHC8*/
         NI    NCSAIMOD(NCSPLPTR),B'01111111'                      1801
*        END;                                              /*@X50BHC8*/
*     ELSE                                                         1803
*     DO;                                                  /*@D32CKDQ*/
         B     @RC01798                                            1803
@RF01798 DS    0H                                                  1804
*       IF RPRHDTYP=RPRENTSW ×      /*SW OR LOCAL SUBAREA    @D32CKDQ*/
*          RPRHDTYP=RPRENTLS                                       1804
*         THEN                                                     1804
         CLI   RPRHDTYP(CVAWKRDT),X'04'                            1804
         BE    @RT01804                                            1804
         CLI   RPRHDTYP(CVAWKRDT),X'05'                            1804
         BNE   @RF01804                                            1804
@RT01804 DS    0H                                                  1805
*         DO;                                              /*@D32CKDQ*/
*           NCSPLRAD=CVAWKRDT;      /*SAVE PU RDTE           @D32CKDQ*/
         ST    CVAWKRDT,NCSPLRAD(,NCSPLPTR)                        1806
*           CVAR1=NCSPLPTR;         /*INPUT TO CV4 OR CL1    @D32CKDQ*/
         LR    CVAR1,NCSPLPTR                                      1807
*           IF RPRHDTYP=RPRENTSW                                   1808
*             THEN CALL ISTINCV4;   /*PROCESS PU IN SW SUB   @D32CKDQ*/
         CLI   RPRHDTYP(CVAWKRDT),X'04'                            1808
         BNE   @RF01808                                            1808
         L     @15,@CV05575                                        1809
         BALR  @14,@15                                             1809
*             ELSE CALL ISTINCL1;   /*PROCESS PU IN LOCAL SUB*/    1810
*                                                                  1810
         B     @RC01808                                            1810
@RF01808 L     @15,@CV05576                                        1810
         BALR  @14,@15                                             1810
*            DO;                                                   1811
@RC01808 DS    0H                                                  1812
*/***  CRRMAINT  PROCNM(ISTINCVA)FUNC(RET)COMP(VY)RPHADD((NCSPLRPH))  *
**/                                                                1812
*            /*** CLEAR AND SET CURRENT PROCEDURE BIT ***/         1812
*NCSPLRPH->RPHCRR->CRACRR->VYCCRT = '0'B;                          1812
         L     @07,NCSPLRPH(,NCSPLPTR)                             1812
         L     @07,RPHCRR(,@07)                                    1812
         L     @07,CRACRR(,@07)                                    1812
         XC    VYCCRT+1(11,@07),VYCCRT+1(@07)                      1812
         MVI   VYCCRT(@07),B'00000000'                             1812
*NCSPLRPH->RPHCRR->CRACRR->CINCVA = '1'B;                          1813
         OI    CINCVA(@07),B'00000010'                             1813
*            END;                  /*@D32CKDQ*/                    1814
*           IF CVAR15=CVA0          /*SUCCESSFUL             @D32CKDQ*/
*             THEN IF RDTEPTR=CVAWKRDT/*COMMAND ENTRY        @D32CKDQ*/
         LTR   CVAR15,CVAR15                                       1815
         BNZ   @RF01815                                            1815
*                    THEN CALL CVASR041; /*LOGON             @D32CKDQ*/
         C     CVAWKRDT,RDTEPTR                                    1816
         BNE   @RF01816                                            1816
         BAL   @14,CVASR041                                        1817
*                    ELSE;                                 /*@D32CKDQ*/
@RF01816 DS    0H                                                  1819
*             ELSE                  /*NON ZERO RC            @D32CKDQ*/
*             IF CVAR15=CVA4        /*NO ACTIVATION REQUIRED @D32CKDQ*/
*               THEN;                                      /*@D32CKDQ*/
         B     @RC01815                                            1819
@RF01815 C     CVAR15,@CF00088                                     1819
         BE    @RT01819                                            1819
*               ELSE                                               1821
*                  DO;                                    /*@X50BHC8*/
*                    NCSACTV=CVAON;  /* REFLECTS A CHANGE IN STATUS  */
         OI    NCSACTV(NCSPLPTR),B'10000000'                       1822
*                    NCSAIMOD=CVAOFF;  /* REFLECTS NOT ACTIVE  */  1823
         NI    NCSAIMOD(NCSPLPTR),B'01111111'                      1823
*               IF CVAR15=CVA8      /*OPEN FAILED            #D32CKDQ*/
*                 THEN                                             1824
         C     CVAR15,@CF00094                                     1824
         BNE   @RF01824                                            1824
*                 DO;                                      /*#D32CKDQ*/
*                   CVANAME1=RPRNAME; /*NODENAME             #D32CKDQ*/
         MVC   CVANAME1(8),RPRNAME(CVAWKRDT)                       1826
*                   CVAMSG=ADDR(CVANAME1); /*MSG VARIABLE    #D32CKDQ*/
         LA    @07,CVANAME1                                        1827
         ST    @07,CVAMSG                                          1827
*                   IF RDTEPTR=CVAWKRDT /*PU CMD ENTRY?      #D32CKDQ*/
*                     THEN                                         1828
         C     CVAWKRDT,RDTEPTR                                    1828
         BNE   @RF01828                                            1828
*                     DO;               /*YES                #D32CKDQ*/
*                       CVAMSID@=ADDR(CVAMS069);/*GET ADDR   #D32CKDQ
*                                   OF OPEN FAILED-CMD FAILED*/    1830
         LA    @07,CVAMS069                                        1830
         ST    @07,CVAMSID@                                        1830
*                       CVAERRSW=CVAON;        /*ERROR       #D32CKDQ*/
         OI    CVAERRSW,B'00000100'                                1831
*                       END;                               /*#D32CKDQ*/
*                     ELSE                                         1833
*                     DO;           /*OPEN FAILED-NOT CMD    #D32CKDQ
*                                      DNTRY                 #D32CKDQ*/
         B     @RC01828                                            1833
@RF01828 DS    0H                                                  1834
*                       CVAMSID@=ADDR(CVAMS603);/*GET ADDR OF      1834
*                                   UNABLE TO OPEN CMD CONT  #D32CKDQ*/
         LA    @07,CVAMS603                                        1834
         ST    @07,CVAMSID@                                        1834
*                       CVADOMSG=CVAON; /*OUTPUT MSG         @D32CKDQ*/
         OI    CVADOMSG,B'00000010'                                1835
*                       END;                               /*@D32CKDQ*/
*                   END;  /*END OPEN FAILED                  @D32CKDQ*/
*                 ELSE                                             1838
*                 IF CVAR15=CVA12                                  1838
*                   THEN            /*ALLOCATE FAILED        #D32CKDQ*/
         B     @RC01824                                            1838
@RF01824 C     CVAR15,@CF00034                                     1838
         BNE   @RF01838                                            1838
*                   DO;                                    /*#D32CKDQ*/
*                    CVANAME1=RPRNAME; /*NODENAME             D32CKDQ*/
         MVC   CVANAME1(8),RPRNAME(CVAWKRDT)                       1840
*                    CVAMSG=ADDR(CVANAME1); /*MSG VAR        #D32CKDQ*/
         LA    @07,CVANAME1                                        1841
         ST    @07,CVAMSG                                          1841
*                   IF RDTEPTR=CVAWKRDT                            1842
*                     THEN                                         1842
         C     CVAWKRDT,RDTEPTR                                    1842
         BNE   @RF01842                                            1842
*                     DO;           /*ALLOC FAILED CMD ENTRY #D32CKDQ*/
*                       CVAMSID@=ADDR(CVAMS609);/*ALLOC FAILED-D   1844
*                                                 CMD FAILED #D32CKDQ*/
         LA    @07,CVAMS609                                        1844
         ST    @07,CVAMSID@                                        1844
*                       CVAERRSW=CVAON; /*ERROR              #D32CKDQ*/
         OI    CVAERRSW,B'00000100'                                1845
*                       END;                               /*#D32CKDQ*/
*                     ELSE                                         1847
*                     DO;           /*ALLOC FAILED-          #D32CKDQ
*                                    NOT CMD ENTRY           #D32CKDQ*/
         B     @RC01842                                            1847
@RF01842 DS    0H                                                  1848
*                       CVAMSID@=ADDR(CVAMS090); /*ALLOC FAILED-   1848
*                                                 CMD CONTS  #D32CKDQ*/
         LA    @07,CVAMS090                                        1848
         ST    @07,CVAMSID@                                        1848
*                       CVADOMSG=CVAON; /*OUTPUT MSG         #D32CKDQ*/
         OI    CVADOMSG,B'00000010'                                1849
*                       END;                               /*#D32CKDQ*/
*                    END;                                  /*#D32CKDQ*/
*                   ELSE                                           1852
*                   IF CVAR15=CVA16                                1852
*                     THEN          /*NO CUA AVAIL           #D32CKDQ*/
         B     @RC01838                                            1852
@RF01838 C     CVAR15,@CF00835                                     1852
         BNE   @RF01852                                            1852
*                     DO;                                  /*#D32CKDQ*/
*                       CVANAME1=RPRNAME; /*NODENAME         #D32CKDQ*/
         MVC   CVANAME1(8),RPRNAME(CVAWKRDT)                       1854
*                       CVAMSG=ADDR(CVANAME1); /*MSG VAR     #D32CKDQ*/
         LA    @07,CVANAME1                                        1855
         ST    @07,CVAMSG                                          1855
*                     IF RDTEPTR=CVAWKRDT                          1856
*                       THEN                                       1856
         C     CVAWKRDT,RDTEPTR                                    1856
         BNE   @RF01856                                            1856
*                       DO;         /*NO CUA-CMD ENTRY       #D32CKDQ*/
*                         CVAMSID@=ADDR(CVAMS673);/*NO CUA-  #D32CKDQ
*                                                   CMD FAILED*/   1858
         LA    @07,CVAMS673                                        1858
         ST    @07,CVAMSID@                                        1858
*                         CVAERRSW=CVAON; /*ERROR       @D32CKDQ*/ 1859
         OI    CVAERRSW,B'00000100'                                1859
*                         END;                             /*#D32CKDQ*/
*                       ELSE                                       1861
*                       DO;         /*NO CUA-NOT CMD ENTRY   #D32CKDQ*/
         B     @RC01856                                            1861
@RF01856 DS    0H                                                  1862
*                         CVAMSID@=ADDR(CVAMS091);/*NO CUA-  #D32CKDQ
*                                                CMD CONTS   #D32CKDQ*/
         LA    @07,CVAMS091                                        1862
         ST    @07,CVAMSID@                                        1862
*                         CVADOMSG=CVAON; /*OUTPUT MSG       #D32CKDQ*/
         OI    CVADOMSG,B'00000010'                                1863
*                         END;                             /*#D32CKDQ*/
*                      END;                                /*#D32CKDQ*/
*                     ELSE                                /*@D32CKDQ*/
*                     IF CVAR15=CVA20 /*NO NEW NCSPL?        #D32CKDQ*/
*                       THEN          /*YES                  #D32CKDQ*/
         B     @RC01852                                            1866
@RF01852 C     CVAR15,@CF01158                                     1866
         BNE   @RF01866                                            1866
*                       DO;                                /*#D32CKDQ*/
*                        CVANAME1=RPRNAME; /*NODENAME        #D32CKDQ*/
         MVC   CVANAME1(8),RPRNAME(CVAWKRDT)                       1868
*                        IF RDTEPTR=CVAWKRDT                       1869
*                         THEN         /*COMMAND ENTRY       #D32CKDQ*/
         C     CVAWKRDT,RDTEPTR                                    1869
         BNE   @RF01869                                            1869
*                         DO;          /*SET UP MSG 74I      #D32CKDQ*/
*                           CVAMSG=ADDR(CVAVARY);          /*#D32CKDQ*/
         LA    @07,CVAVARY                                         1871
         ST    @07,CVAMSG                                          1871
*                           CVAMSID@=ADDR(CVAMS074);       /*#D32CKDQ*/
         LA    @07,CVAMS074                                        1872
         ST    @07,CVAMSID@                                        1872
*                           CVAERRSW=CVAON;  /*ERROR         #D32CKDQ*/
         OI    CVAERRSW,B'00000100'                                1873
*                           END;                           /*#D32CKDQ*/
*                         ELSE         /*NOT CMD ENTRY       #D32CKDQ*/
*                         DO;          /*SET UP MSG 688I     #D32CKDQ*/
         B     @RC01869                                            1875
@RF01869 DS    0H                                                  1876
*                           CVAMSG=ADDR(CVANAME1); /*NODENAME*/    1876
         LA    @07,CVANAME1                                        1876
         ST    @07,CVAMSG                                          1876
*                           CVAMSID@=ADDR(CVAMS688);       /*#D32CKDQ*/
         LA    @07,CVAMS688                                        1877
         ST    @07,CVAMSID@                                        1877
*                           CVADOMSG=CVAON; /*OUTPUT MSG AND CONT*/
         OI    CVADOMSG,B'00000010'                                1878
*                           END;                           /*#D32CKDQ*/
*                  END;                                    /*@X50BHC8*/
*                        ELSE;                             /*#D32CKDQ*/
@RF01866 DS    0H                                                  1882
*                         END;                             /*#D32CKDQ*/
@RC01866 DS    0H                                                  1882
@RC01852 DS    0H                                                  1882
@RC01838 DS    0H                                                  1882
@RC01824 DS    0H                                                  1883
*            IF CVADOMSG=CVAON      /*OUTPUT MSG NOW         #D32CKDQ*/
*              THEN                                                1883
@RT01819 DS    0H                                                  1883
@RC01815 TM    CVADOMSG,B'00000010'                                1883
         BNO   @RF01883                                            1883
*              DO;                  /*YES                    #D32CKDQ*/
*                CVADOMSG=CVAOFF;   /*RE INIT                #D32CKDQ*/
         NI    CVADOMSG,B'11111101'                                1885
*                CALL CVATPMSG;     /*OUTPUT MSG             #D32CKDQ*/
         BAL   @14,CVATPMSG                                        1886
*                END;                                      /*#D32CKDQ*/
*              ELSE;                                       /*#D32CKDQ*/
@RF01883 DS    0H                                                  1889
*        END;                       /*END LOCAL OR SW SUBAREA*/    1889
*        ELSE                                                      1890
*        DO;                        /*PROCESS PUS IN RNS     #D32CKDQ*/
*                                                                  1890
         B     @RC01804                                            1890
@RF01804 DS    0H                                                  1891
*   IF CVANEWSG='1'B                /* NEW SEGMENT SWITCH ON?        */
*     THEN                          /* YES -                         */
         TM    CVANEWSG,B'01000000'                                1891
         BNO   @RF01891                                            1891
*     IF RPRPTHCT=CVA0                /*PATH CT ZERO         #D32CKDQ*/
*       THEN                                                       1892
         CLI   RPRPTHCT(CVAWKRDT),0                                1892
         BNE   @RF01892                                            1892
*       DO;                         /*YES LINK NOT ACTIVE    #D32CKDQ*/
*         IF RCCRBISA='1'B  /* IS THE PU'S ISTATUS ON?       @XM19391*/
*            THEN                                                  1894
         TM    RCCRBISA(CVAWKRDT),B'10000000'                      1894
         BNO   @RF01894                                            1894
*            DO;                                           /*@XM19391*/
*         CVAMSID@=ADDR(CVAMS608);  /*HIGHER NODE INACTIVE   #D32CKDQ*/
         LA    @07,CVAMS608                                        1896
         ST    @07,CVAMSID@                                        1896
*         CVANAME1=RPRNAME;         /*PU NODENAME            #D32CKDQ*/
         MVC   CVANAME1(8),RPRNAME(CVAWKRDT)                       1897
*         CVANAME2=RPRNSNEA->RPRNAME; /*LINK NODENAME        #D32CKDQ*/
         L     @07,RPRNSNEA(,CVAWKRDT)                             1898
         MVC   CVANAME2(8),RPRNAME(@07)                            1898
*         CVAMSG=ADDR(CVANAME1);    /*MSG VAR                #D32CKDQ*/
         LA    @07,CVANAME1                                        1899
         ST    @07,CVAMSG                                          1899
*         NCSACTV=CVAON;   /* REFLECTS A CHANGE IN STATUS    @X50BHC8*/
         OI    NCSACTV(NCSPLPTR),B'10000000'                       1900
*         NCSAIMOD=CVAOFF;  /* REFLECTS NOT ACTIVE           @X50BHC8*/
         NI    NCSAIMOD(NCSPLPTR),B'01111111'                      1901
*         CALL CVATPMSG;            /*OUTPUT MSG             #D32CKDQ*/
         BAL   @14,CVATPMSG                                        1902
*            END;                                          /*@XM19391*/
*            ELSE;                                         /*@XM19391*/
@RF01894 DS    0H                                                  1905
*         END;                                             /*#D32CKDQ*/
*       ELSE                        /*LINK ACTIVE            #D32CKDQ*/
*     IF RCCRBISA='0'B              /* CLUSTER HAVE ISTATUS?         */
*       THEN                                                       1906
         B     @RC01892                                            1906
@RF01892 TM    RCCRBISA(CVAWKRDT),B'10000000'                      1906
         BZ    @RT01906                                            1906
*       ;                           /* NO - RETURN                   */
*     ELSE                                                         1908
*       DO;                         /* CLUSTER DOES NOT HAVE ISTATUS */
*                                                                  1908
*         /***********************************************************/
*         /*                                                         */
*         /* GET THE VOC LOCK:                                       */
*         /*                                                         */
*         /***********************************************************/
*                                                                  1909
*         CVAR0=CVA0;                                              1909
         SLR   CVAR0,CVAR0                                         1909
*         CALL CVASRLOC;                                           1910
         BAL   @14,CVASRLOC                                        1910
*         CALL CVACLU02;            /* GO PROCESS FOR NEW CLUSTER  1911
*                                      NCSPL                         */
         BAL   @14,CVACLU02                                        1911
*         IF CVAR15=0               /* CLUSTER NCSPL OK?             */
*           THEN                                                   1912
         LTR   CVAR15,CVAR15                                       1912
         BZ    @RT01912                                            1912
*           ;                       /* YES - RETURN                  */
*         ELSE                                                     1914
*           DO;                     /* NO -                          */
*             NCSPLSOM='0'B;        /* TURN SUPPRESS OPERATOR      1915
*                                      MESSAGES SWITCH OFF IN NCSPL  */
         NI    NCSPLSOM(NCSPLPTR),B'10111111'                      1915
*             NCSACTV=CVAON;   /* REFLECTS A CHANGE IN STATUS      1916
*                                                            @X50BHC8*/
         OI    NCSACTV(NCSPLPTR),B'10000000'                       1916
*             NCSAIMOD=CVAOFF;  /* REFLECTS NOT ACTIVE STATUS      1917
*                                                            @X50BHC8*/
         NI    NCSAIMOD(NCSPLPTR),B'01111111'                      1917
*             CVAMSID@=ADDR(CVAMS074);/* INDICATE ACTIVATE FAILED DUE
*                                      TO INSUFFICIENT STORAGE       */
         LA    @07,CVAMS074                                        1918
         ST    @07,CVAMSID@                                        1918
*             CVANAME1=RPRNAME;     /* GET NODENAME FOR MESSAGE      */
         MVC   CVANAME1(8),RPRNAME(CVAWKRDT)                       1919
*             CVAMSG=ADDR(CVAVARY); /* GET ADDRESS OF VARIABLES FOR
*                                      MESSAGE                       */
         LA    @07,CVAVARY                                         1920
         ST    @07,CVAMSG                                          1920
*             CALL CVATPMSG;        /* NEW SEGMENT SWITCH MUST BE ON -
*                                      OUTPUT MESSAGE                */
         BAL   @14,CVATPMSG                                        1921
*             CVAERRSW='1'B;        /* TURN ON ERROR SWITCH          */
*                                                                  1922
         OI    CVAERRSW,B'00000100'                                1922
*             /*******************************************************/
*             /*                                                     */
*             /* RELEASE THE VOC LOCK                                */
*             /*                                                     */
*             /*******************************************************/
*                                                                  1923
*             CVAR0=CVA10;                                         1923
         LA    CVAR0,10                                            1923
*             CALL CVASRLOC;                                       1924
         BAL   @14,CVASRLOC                                        1924
*           END;                                                   1925
*       END;                                                       1926
*   ELSE                            /* NEW SEGMENT SWITCH NOT ON -   */
*     IF NCSPLEBN='0'B              /* NCSPL ON THE CLUSTER'S PABSET?*/
*       THEN                                                       1927
         B     @RC01891                                            1927
@RF01891 TM    NCSPLEBN(NCSPLPTR),B'00100000'                      1927
         BNZ   @RF01927                                            1927
*       DO;                         /* NO -                          */
*                                                                  1928
*         /***********************************************************/
*         /*                                                         */
*         /* GET THE VOC LOCK:                                       */
*         /*                                                         */
*         /***********************************************************/
*                                                                  1929
*         CVAR0=CVA0;                                              1929
         SLR   CVAR0,CVAR0                                         1929
*         CALL CVASRLOC;                                           1930
         BAL   @14,CVASRLOC                                        1930
*         IF RCCVPAB=0              /* PABS EXIST?                   */
*           THEN                                                   1931
         L     @07,RCCVPAB(,CVAWKRDT)                              1931
         LTR   @07,@07                                             1931
         BNZ   @RF01931                                            1931
*           DO;                     /* NO - GO PROCESS FOR CLUSTER 1932
*                                      NCSPL                         */
*             IF RPRPTHCT=CVA0      /*PATH CT ZERO LINK INACTIVE*/ 1933
*               THEN                                               1933
         CLI   RPRPTHCT(CVAWKRDT),0                                1933
         BNE   @RF01933                                            1933
*               DO;                 /*YES                    @D32CKDQ*/
*                 CVAMSID@=ADDR(CVAMS608);/*HIGHER NODE      @D32CKDQ
*                                             INACTIVE       @D32CKDQ*/
         LA    @07,CVAMS608                                        1935
         ST    @07,CVAMSID@                                        1935
*                 CVANAME1=RPRNAME; /*PU NODENAME            @D32CKDQ*/
         MVC   CVANAME1(8),RPRNAME(CVAWKRDT)                       1936
*                 CVANAME2=RPRNSNEA->RPRNAME;/*LINK NAME     @D32CKDQ*/
         L     @07,RPRNSNEA(,CVAWKRDT)                             1937
         MVC   CVANAME2(8),RPRNAME(@07)                            1937
*                 CVAMSG=ADDR(CVANAME1); /*MSG VARIABLE      @D32CKDQ*/
         LA    @07,CVANAME1                                        1938
         ST    @07,CVAMSG                                          1938
*                 CVAR0=CVA10;   /*RELEASE VOC LOCK*/              1939
         LA    CVAR0,10                                            1939
*                 CALL CVASRLOC;                                   1940
         BAL   @14,CVASRLOC                                        1940
*                 IF CVASGMNT=CVAON  /*IF SEGMENT            @D32CKDQ*/
*                   THEN CALL CVATPMSG; /*PUT OUT MSG        @D32CKDQ*/
         TM    CVASGMNT,B'00010000'                                1941
         BNO   @RF01941                                            1941
         BAL   @14,CVATPMSG                                        1942
*                   ELSE CVAERRSW=CVAON; /*ERROR-MSG OUTPUT  @D32CKDQ
*                                          LATER             @D32CKDQ*/
         B     @RC01941                                            1943
@RF01941 OI    CVAERRSW,B'00000100'                                1943
*                 END;                                     /*@D32CKDQ*/
*               ELSE                                               1945
*               DO;                                        /*@D32CKDQ*/
         B     @RC01933                                            1945
@RF01933 DS    0H                                                  1946
*             CALL CVACLU02;        /* PROCESS FOR CLUSTER NCSPL     */
         BAL   @14,CVACLU02                                        1946
*             IF CVAR15=0           /* CLUSTER NCSPL OK?             */
*               THEN                                               1947
         LTR   CVAR15,CVAR15                                       1947
         BZ    @RT01947                                            1947
*               ;                   /* YES - RETURN                  */
*             ELSE                                                 1949
*               DO;                                                1949
*                 NCSPLSOM='0'B;    /* TURN SUPPRESS OPERATOR      1950
*                                      MESSAGES SWITCH OFF IN NCSPL  */
         NI    NCSPLSOM(NCSPLPTR),B'10111111'                      1950
*                 NCSACTV=CVAON;  /* REFLECTS A CHANGE IN STATUS   1951
*                                                            @X50BHC8*/
         OI    NCSACTV(NCSPLPTR),B'10000000'                       1951
*                 NCSAIMOD=CVAOFF;  /* REFLECTS NOT ACTIVE STATUS  1952
*                                                            @X50BHC8*/
         NI    NCSAIMOD(NCSPLPTR),B'01111111'                      1952
*                 CVAMSID@=ADDR(CVAMS074);/* INDICATE ACTIVATE FAILED
*                                      DUE TO INSUFFICIENT STORAGE   */
         LA    @07,CVAMS074                                        1953
         ST    @07,CVAMSID@                                        1953
*                 CVANAME1=RPRNAME; /* GET NODENAME FOR MESSAGE      */
         MVC   CVANAME1(8),RPRNAME(CVAWKRDT)                       1954
*                 CVAMSG=ADDR(CVAVARY);/* GET ADDRESS OF VARIABLES   */
         LA    @07,CVAVARY                                         1955
         ST    @07,CVAMSG                                          1955
*                 CVAERRSW='1'B;    /* NEW SEGMENT SWITCH MUST BE OFF -
*                                      JUST SET ERROR SWITCH ON      */
*                                                                  1956
         OI    CVAERRSW,B'00000100'                                1956
*                 /***************************************************/
*                 /*                                                 */
*                 /* RELEASE THE VOC LOCK                            */
*                 /*                                                 */
*                 /***************************************************/
*                                                                  1957
*                 CVAR0=CVA10;                                     1957
         LA    CVAR0,10                                            1957
*                 CALL CVASRLOC;                                   1958
         BAL   @14,CVASRLOC                                        1958
*               END;                                               1959
*            END;                                          /*@D32CKDQ*/
*           END;                                                   1961
*         ELSE                                                     1962
*           DO;                     /* PABS DO EXIST -               */
         B     @RC01931                                            1962
@RF01931 DS    0H                                                  1963
*             IF RPRONLIN=CVAON     /*IF ENTRY ONLINE        @D32CKDQ*/
*               THEN CVALRDYA=CVAON;/*SET ALREADY ACTIVE BIT @D32CKDQ*/
         TM    RPRONLIN(CVAWKRDT),B'00001000'                      1963
         BNO   @RF01963                                            1963
         OI    CVALRDYA,B'00100000'                                1964
*               ELSE                                               1965
*               DO;                                        /*@D32CKDQ*/
         B     @RC01963                                            1965
@RF01963 DS    0H                                                  1966
*                 CVAERRSW=CVAON;   /*ERROR                  @D32CKDQ*/
         OI    CVAERRSW,B'00000100'                                1966
*                 IF RCCCUDIE=CVAON  /*VARY DEACT IN PROG    @D32CKDQ*/
*                   THEN                                           1967
         TM    RCCCUDIE(CVAWKRDT),B'01000000'                      1967
         BNO   @RF01967                                            1967
*                   DO;             /*YES                    @D32CKDQ*/
*                     CVAMSID@=ADDR(CVAMS073);             /*@D32CKDQ*/
         LA    @07,CVAMS073                                        1969
         ST    @07,CVAMSID@                                        1969
*                                   /*DEACTIVATE MSG         @D32CKDQ*/
*                     CVANAME1=RPRNAME; /*NODENAME           @D32CKDQ*/
         MVC   CVANAME1(8),RPRNAME(CVAWKRDT)                       1970
*                     CVAMSG=ADDR(CVAVARY); /*MSG VARIABLE   @D32CKDQ*/
         LA    @07,CVAVARY                                         1971
         ST    @07,CVAMSG                                          1971
*                     END;                                 /*@D32CKDQ*/
*                   ELSE                                           1973
*                   DO;                                    /*@D32CKDQ*/
         B     @RC01967                                            1973
@RF01967 DS    0H                                                  1974
*                     CVAMSID@=ADDR(CVAMS313);/*ACTIVATE ALREADY   1974
*                                               IN PROGRESS  @D32CKDQ*/
         LA    @07,CVAMS313                                        1974
         ST    @07,CVAMSID@                                        1974
*                     CVANAME1=RPRNAME;  /*NODENAME          @D32CKDQ*/
         MVC   CVANAME1(8),RPRNAME(CVAWKRDT)                       1975
*                     CVAMSG=ADDR(CVANAME1); /*MSG VAR       @D32CKDQ*/
         LA    @07,CVANAME1                                        1976
         ST    @07,CVAMSG                                          1976
*                     END;                                 /*@D32CKDQ*/
*                 END;                                     /*@D32CKDQ*/
*                                                                  1978
@RC01967 DS    0H                                                  1979
*             /*******************************************************/
*             /*                                                     */
*             /* RELEASE THE VOC LOCK                                */
*             /*                                                     */
*             /*******************************************************/
*                                                                  1979
*             CVAR0=CVA10;                                         1979
@RC01963 LA    CVAR0,10                                            1979
*             CALL CVASRLOC;                                       1980
         BAL   @14,CVASRLOC                                        1980
*           END;                                                   1981
*       END;                                                       1982
*     ELSE                                                         1983
*       DO;                         /* NCSPL WAS ON CLUSTER'S PABSET-*/
         B     @RC01927                                            1983
@RF01927 DS    0H                                                  1984
*         CALL CVASR080;            /* GO PROCESS CLUSTER            */
         BAL   @14,CVASR080                                        1984
*         IF CVAGOSW='1'B           /* GO SWITCH ON?                 */
*           THEN                                                   1985
         TM    CVAGOSW,B'10000000'                                 1985
         BNO   @RF01985                                            1985
*           DO;                     /* YES -                         */
*             RPRNCBA->NCBCONF='0'B;/* TURN SICK FLAG OFF IN THE NCB */
         L     @07,RPRNCBA(,CVAWKRDT)                              1987
         NI    NCBCONF(@07),B'10111111'                            1987
*             RPRNCBA->CCNSTART='0'B;/* TURN START IN PROGRESS OFF IN
*                                      CCNCB                         */
         NI    CCNSTART(@07),B'10111111'                           1988
*             NCSPLRIO='0'B;        /* TURN OFF RESTART I/O FLAG IN
*                                      NCSPL                         */
         NI    NCSPLRIO(NCSPLPTR),B'11011111'                      1989
*             CVARIDSV=NCSPLRID;    /* SAVE THE NCSPL RID            */
         MVC   CVARIDSV(8),NCSPLRID(NCSPLPTR)                      1990
*             CVARPTSV=NCSPLRPT;    /* SAVE THE NCSPL RPT            */
         L     @07,NCSPLRPT(,NCSPLPTR)                             1991
         ST    @07,CVARPTSV                                        1991
*             CVACRMSK=NCSCRMSK;  /* SAVE THE C/R MASKS      @X50BHC8*/
         SLR   @07,@07                                             1992
         ICM   @07,7,NCSCRMSK(NCSPLPTR)                            1992
         ST    @07,CVACRMSK                                        1992
*             NCSCRMSK=CVA0;     /* CLEAR THE MASKS          @X50BHC8*/
         SLR   @07,@07                                             1993
         STCM  @07,7,NCSCRMSK(NCSPLPTR)                            1993
*             CVAWKSAV=CVAWKRDT;    /* SAVE CLUSTER RDTE ADDRESS     */
         ST    CVAWKRDT,CVAWKSAV                                   1994
*             IF RPRENTED='1'B      /* LAST ENTRY?                   */
*               THEN                                               1995
         TM    RPRENTED(CVAWKRDT),B'00000100'                      1995
         BO    @RT01995                                            1995
*               ;                   /* YES - RETURN                  */
*             ELSE                                                 1997
*               DO;                                                1997
*                 CVALOOP2='1'B;    /* TURN LOOP CONTROL SW ON       */
         OI    CVALOOP2,B'00100000'                                1998
*                 CVASAF=ATCVTMID; /* GET VARY'S SAF         @XA10138*/
         L     @07,NCSPLCVT(,NCSPLPTR)                             1999
         MVC   CVASAF(2),ATCVTMID(@07)                             1999
*                 CVADAF=CVAWKRDT->RPRDAF; /* GET PU'S DAF   @XA10138*/
         MVC   CVADAF(2),RPRDAF(CVAWKRDT)                          2000
*                 DO WHILE RPRENTED='0'B&CVALOOP2='1'B;/* LOOP     2001
*                                      LOOKING FOR LU ENTRIES FOR  2001
*                                      THIS CLUSTER                  */
         B     @DE02001                                            2001
@DL02001 DS    0H                                                  2002
*                   CVAWKRDT=CVAWKRDT+RPRELEN;/* GET THE NEXT ENTRY  */
         AH    CVAWKRDT,RPRELEN(,CVAWKRDT)                         2002
*                   IF RPRENTRY=RPRENTLU/* THIS ENTRY AN LU?         */
*                     THEN          /* YES -                         */
         CLI   RPRENTRY(CVAWKRDT),X'81'                            2003
         BNE   @RF02003                                            2003
*                     DO;                                          2004
*                     RPRPTHCT=CVA1;/* SET LU'S PATH COUNT TO ONE    */
         MVI   RPRPTHCT(CVAWKRDT),X'01'                            2005
*                     IF RLURBISA='1'B/* LU HAVE ISTATUS?            */
*                       THEN                                       2006
         TM    RLURBISA(CVAWKRDT),B'10000000'                      2006
         BNO   @RF02006                                            2006
*                       DO;         /* YES -                         */
*                         NCSPLRID=RPRNAME;/* SET NCSPL RID TO LU  2008
*                                      NAME                          */
         MVC   NCSPLRID(8,NCSPLPTR),RPRNAME(CVAWKRDT)              2008
*                         NCSPLRPT=CVAWKRDT;/* SET NCSPL RPT TO ADDR
*                                      OF LU                         */
         ST    CVAWKRDT,NCSPLRPT(,NCSPLPTR)                        2009
*                         CVANOCLF='1'B;/* SET THE NO LOGON SWITCH ON*/
         OI    CVANOCLF,B'00000010'                                2010
*                         RFY (CVAR1,CVAR2) RSTD; /*         @XA10138*/
*                         CVAR2=CVACID; /* GET THE PU'S CID  @XA10138*/
         L     CVAR2,CVACID                                        2012
*                         CVAR1=NCSPLRPH; /* GET THE RPH@    @XA10138*/
*                                                                  2013
         L     CVAR1,NCSPLRPH(,NCSPLPTR)                           2013
*                          DO; /* CIDCTL(FIND) LOCK(XCLUSIVE) */   2014
*                                                                  2014
*                          RFY (EMCR2,EMCR3) RSTD;                 2015
*                            GEN SETS(RPHWORK)                     2016
*        (STM EMCR0,EMCR15,RPHWORK(RPHPTR) SAVE REGS IN RPH);      2016
         STM EMCR0,EMCR15,RPHWORK(RPHPTR) SAVE REGS IN RPH
*                            EMCR3 = '00'X; /*CLEAR EXTRA BITS*/   2017
         SLR   EMCR3,EMCR3                                         2017
*                            EMCR3 = '02'X; /*INDICATE EXCLUSIVE LOCK*/
         LA    EMCR3,2                                             2018
*                            CALL ATCLCPTR->ATCCDFND->ISTSDCCF; /*PROCE
*S REQUEST*/                                                       2019
         L     @07,ATCLCPTR                                        2019
         L     @15,ATCCDFND(,@07)                                  2019
         BALR  @14,@15                                             2019
*                          RFY (EMCR2,EMCR3) UNRSTD;               2020
*                          END; /*CIDCTL*/ /* GET THE DAF          2021
*                                       LOCK   @XA10138*/          2021
*                         RFY CVAR15 RSTD; /*                @XA10138*/
*                         IF CVAR15^=CVA0  /* LOCK OBTAINED  @XA10138*/
*                            THEN   /* NO                    @XA10138*/
         LTR   CVAR15,CVAR15                                       2023
         BZ    @RF02023                                            2023
*                            CVALOOP2=CVAOFF; /* TURN ON SWITCH USED TO
*                                              EXIT LOOP     @XA10138*/
         NI    CVALOOP2,B'11011111'                                2024
*                            ELSE     /* LOCK OBTAINED       @XA10138*/
*                            IF CVAWKRDT->RPRNSNEA->RCCERPIP=CVAON /*IS
*                                      ERP IN PROCESS?       @XA10138*/
*                               THEN     /* YES              @XA10138*/
         B     @RC02023                                            2025
@RF02023 L     @07,RPRNSNEA(,CVAWKRDT)                             2025
         TM    RCCERPIP(@07),B'00100000'                           2025
         BNO   @RF02025                                            2025
*                               DO;     /*                   @XA10138*/
*                                 RFY CVAR15 UNRSTD; /*      @XA10138*/
*                                 CVAR2->FMCVWT=NCSPLRPH; /* STORE RPH@
*                                        IN THE FMCB         @XA10138*/
         L     @15,NCSPLRPH(,NCSPLPTR)                             2028
         ST    @15,FMCVWT(,CVAR2)                                  2028
*                                 CVARSWKA=CVAR2; /* SAVE THE ADDRESS
*                                        OF THE FMCB         @XA10138*/
         ST    CVAR2,CVARSWKA                                      2029
*                                 CVAR2=CVACID; /* GET CID   @XA10138*/
*                                                                  2030
         L     CVAR2,CVACID                                        2030
*                                  DO; /* CIDCTL(FINISH)  */       2031
*                                                                  2031
*                                  RFY (EMCR2,EMCR3) RSTD;         2032
*                                    GEN SETS(RPHWORK)             2033
*        (STM EMCR0,EMCR15,RPHWORK(RPHPTR) SAVE REGS IN RPH);      2033
         STM EMCR0,EMCR15,RPHWORK(RPHPTR) SAVE REGS IN RPH
*                                    EMCR3 = '00'X; /*CLEAR EXTRA BITS*
         SLR   EMCR3,EMCR3                                         2034
*                                    CALL ATCLCPTR->ATCCDFIN->ISTSDCCR;
         L     @07,ATCLCPTR                                        2035
         L     @15,ATCCDFIN(,@07)                                  2035
         BALR  @14,@15                                             2035
*/*PROCESS REQUEST*/                                               2036
*                                  RFY (EMCR2,EMCR3) UNRSTD;       2036
*                                  END; /*CIDCTL*/ /* RELEASE THE DAF
*                                                    LOCK   @XA10138*/
*                                                                  2037
*/*  TPWAIT   */                                                   2038
*                             DO; /* BEGIN TPWAIT GENERATION*/     2038
*                                  RFY (GPR01P,GPR14P,GPR15P) RSTD;
*                                  RFY (GPR00P) RSTD;              2040
*                             GEN (STM   GPR00P,GPR15P,RPHWORK(GPR01P))
*                             REFS(GPR00P,GPR01P,GPR15P) SETS(RPHWORK);
         STM   GPR00P,GPR15P,RPHWORK(GPR01P)
*                                  RFY (GPR00P) UNRSTD;            2042
*                             GPR15P=ADDR(LHAA0062);               2043
         LA    GPR15P,LHAA0062                                     2043
*                             GPR14P=0;                            2044
         SLR   GPR14P,GPR14P                                       2044
*                             GPR15P=GPR15P & '00FFFFFF'X;         2045
         N     GPR15P,@CF05583                                     2045
*                             GPR15P=GPR15P × RPHWT1;              2046
         O     GPR15P,@CF01355                                     2046
*                             CS (GPR14P,GPR15P,GPR01P->RPHRESMA); 2047
         CS    GPR14P,@15,RPHRESMA(GPR01P)                         2047
*                             BC (7,LHAB0062);                     2048
*                                                                  2048
         BC    7,LHAB0062                                          2048
*/* TPEXIT  NONE */                                                2049
*                                  DO;                             2049
*                                    RESPECIFY GPR15P RSTD;        2050
*                                                                  2050
*/* ATBUILD (ISTPAB,ISTDYPAB,ISTATCVT)  */                         2051
*/* END OF ATBUILD */                                              2051
*                                  DO; /* LISATCVT CVTBASE(PAGEABLE,(GP
*15P)) */                            GPR15P = ATCLCPTR; /*SET UP ATCVT
*OINTER*/                          END; /*LISATCVT*/               2051
         L     GPR15P,ATCLCPTR                                     2052
*                                    RESPECIFY GPR00F RSTD;        2054
*                                    GPR00F=0;     /*SET PARAMETER REGI
*TER TO 0*/                          GPR15P=GPR15P->ATCAP31;       2055
         SLR   GPR00F,GPR00F                                       2055
         L     GPR15P,ATCAP31(,GPR15P)                             2056
*                                    DCL FMZL0067 BASED(GPR15P) LABEL V
*LUERANGE(*);                        CALL FMZL0067;                2057
         BALR  @14,@15                                             2058
*                                    RESPECIFY (GPR00F,GPR15P) UNRSTD;
*                                  END; /***** END OF TPEXIT  *****/
*LHAB0062:;                   GPR01P->RPHRESMA = 0;                2061
LHAB0062 DS    0H                                                  2062
         SLR   @15,@15                                             2062
         ST    @15,RPHRESMA(,GPR01P)                               2062
*                                  RFY (GPR00P) RSTD;              2063
*LHAA0062:;                   GEN (LM    GPR00P,GPR15P,RPHWORK(GPR01P))
LHAA0062 DS    0H                                                  2065
*                             REFS(RPHWORK,GPR01P) SETS(GPR00P,GPR15P);
         LM    GPR00P,GPR15P,RPHWORK(GPR01P)
*                                  RFY (GPR00P,GPR01P,GPR14P,GPR15P) UN
*STD;                         END; /*****END OF TPWAIT *****/ /* WAIT F
*R ERP TO COMPLETE                                            ITS PROCE
*SING    @XA10138*/                                                2066
*                                 IF CVARSWKA->FMCDEVOF=CVAOFF /*DID
*                                   ERP PROCESS A HARD ERROR @XA10138*/
*                                    THEN; /* NO             @XA10138*/
         L     @15,CVARSWKA                                        2068
         TM    FMCDEVOF(@15),B'00010000'                           2068
         BZ    @RT02068                                            2068
*                                    ELSE CVALOOP2=CVAOFF; /* YES, SO
*                                                 EXIT LOOP  @XA10138*/
         NI    CVALOOP2,B'11011111'                                2070
*                               END; /*                      @XA10138*/
*                               ELSE /* ERP NOT IN PROCESS   @XA10138*/
*                               IF CVAR2->FMCDEVOF=CVAON /* WAS THE
*                                         ERROR HARD?        @XA10138*/
*                                  THEN /*                   @XA10138*/
         B     @RC02025                                            2072
@RF02025 TM    FMCDEVOF(CVAR2),B'00010000'                         2072
         BNO   @RF02072                                            2072
*                                  DO; /* ERROR WAS HARD     @XA10138*/
*                                    CVALOOP2=CVAOFF; /* SET SWITCH TO
*                                           EXIT LOOP        @XA10138*/
         NI    CVALOOP2,B'11011111'                                2074
*                                    CVAR2=CVACID; /*GET CID @XA10138*/
*                                                                  2075
         L     CVAR2,CVACID                                        2075
*                                     DO; /* CIDCTL(FINISH)  */    2076
*                                                                  2076
*                                     RFY (EMCR2,EMCR3) RSTD;      2077
*                                       GEN SETS(RPHWORK)          2078
*        (STM EMCR0,EMCR15,RPHWORK(RPHPTR) SAVE REGS IN RPH);      2078
         STM EMCR0,EMCR15,RPHWORK(RPHPTR) SAVE REGS IN RPH
*                                       EMCR3 = '00'X; /*CLEAR EXTRA BI
*S*/                                    CALL ATCLCPTR->ATCCDFIN->ISTSDC
*R; /*PROCESS REQUEST*/                                            2079
         SLR   EMCR3,EMCR3                                         2079
         L     @07,ATCLCPTR                                        2080
         L     @15,ATCCDFIN(,@07)                                  2080
         BALR  @14,@15                                             2080
*                                     RFY (EMCR2,EMCR3) UNRSTD;    2081
*                                     END; /*CIDCTL*/ /* RELEASE THE
*                                            DAF LOCK       @XA10138*/
*                                   END; /*                  @XA10138*/
*                                   ELSE /*                  @XA10138*/
*                                   DO; /*ERROR WAS NOT HARD @XA10138*/
         B     @RC02072                                            2084
@RF02072 DS    0H                                                  2085
*                                     CVAR2=CVACID; /* GET CID       */
*                                                                  2085
         L     CVAR2,CVACID                                        2085
*                                      DO; /* CIDCTL(FINISH)  */   2086
*                                                                  2086
*                                      RFY (EMCR2,EMCR3) RSTD;     2087
*                                        GEN SETS(RPHWORK)         2088
*        (STM EMCR0,EMCR15,RPHWORK(RPHPTR) SAVE REGS IN RPH);      2088
         STM EMCR0,EMCR15,RPHWORK(RPHPTR) SAVE REGS IN RPH
*                                        EMCR3 = '00'X; /*CLEAR EXTRA B
*TS*/                                    CALL ATCLCPTR->ATCCDFIN->ISTSD
*CR; /*PROCESS REQUEST*/                                           2089
         SLR   EMCR3,EMCR3                                         2089
         L     @07,ATCLCPTR                                        2090
         L     @15,ATCCDFIN(,@07)                                  2090
         BALR  @14,@15                                             2090
*                                      RFY (EMCR2,EMCR3) UNRSTD;   2091
*                                      END; /*CIDCTL*/ /* RELEASE THE
*                                            DAF LOCK       @XA10138*/
*                                   END; /*                  @XA10138*/
*                         IF CVALOOP2=CVAOFF /* ERROR DUE TO ERP OR AN
*                                            ERP CONSEQUENCE @XA10138*/
*                            THEN /*                         @XA10138*/
@RC02072 DS    0H                                                  2094
@RC02025 DS    0H                                                  2094
@RC02023 TM    CVALOOP2,B'00100000'                                2094
         BNZ   @RF02094                                            2094
*                            DO; /*PREPARE TO UPDATE THE PATH COUNTS
*                                     FOR THE REMAINING LU'S @XA10138*/
*                              DO WHILE (RPRENTED=CVAOFF &         2096
*                                        CVALOOP2=CVAOFF); /*LOOP UNTIL
*                                 THE SWITCH IS ON OR THE END OF THE
*                                 RDT SEGMENT IS OBTAINED    @XA10138*/
         B     @DE02096                                            2096
@DL02096 DS    0H                                                  2097
*                                 CVAWKRDT=CVAWKRDT+RPRELEN; /* GET THE
*                                         NEXT ENTRY         @XA10138*/
         AH    CVAWKRDT,RPRELEN(,CVAWKRDT)                         2097
*                                 IF RPRENTRY=RPRENTLU /* LU @XA10138*/
*                                    THEN RPRPTHCT=CVA1; /* SET THE LU
*                                         PATH COUNT TO 1    @XA10138*/
         CLI   RPRENTRY(CVAWKRDT),X'81'                            2098
         BNE   @RF02098                                            2098
         MVI   RPRPTHCT(CVAWKRDT),X'01'                            2099
*                                    ELSE CVALOOP2=CVAON; /* EXIT THE
*                                              DO WHILE LOOP @XA10138*/
         B     @RC02098                                            2100
@RF02098 OI    CVALOOP2,B'00100000'                                2100
*                                END;  /*                    @XA10138*/
@RC02098 DS    0H                                                  2101
@DE02096 TM    RPRENTED(CVAWKRDT),B'00000100'                      2101
         BNZ   @DC02096                                            2101
         TM    CVALOOP2,B'00100000'                                2101
         BZ    @DL02096                                            2101
@DC02096 DS    0H                                                  2102
*                                CVALOOP2=CVAOFF; /* SET THE OUTER LOOP
*                                         EXIT SWITCH        @XA10138*/
         NI    CVALOOP2,B'11011111'                                2102
*                              END;    /*                    @XA10138*/
*                            ELSE        /*                  @XA10138*/
*                            DO;  /*                         @XA10138*/
         B     @RC02094                                            2104
@RF02094 DS    0H                                                  2105
*                            RFY (CVAR2,CVAR1) UNRSTD;  /*   @XA10138*/
*                         CALL CVASRLU;/* GO PROCESS L  ENTRY        */
         BAL   @14,CVASRLU                                         2106
*                         IF CVAERRSW='1'B/* ERROR SWITCH SET?       */
*                           THEN                                   2107
         TM    CVAERRSW,B'00000100'                                2107
         BNO   @RF02107                                            2107
*                           DO;     /* YES -                         */
*                             IF CVAMSID@->CVAMSGID=CVAMS069 /* 'UNABLE
*                                      TO OPEN' MESSAGE?             */
*                               THEN                               2109
         L     @15,CVAMSID@                                        2109
         CLC   CVAMSGID(4,@15),CVAMS069                            2109
         BNE   @RF02109                                            2109
*                                 DO;/* YES -                        */
*                                   CVAMSID@=ADDR(CVAMS603);/* GET ADDR
*                                      OF 'UNABLE TO OPEN- COMMAND 2111
*                                      CONTINUES' MESSAGE            */
         LA    @15,CVAMS603                                        2111
         ST    @15,CVAMSID@                                        2111
*                                   CVANAME1=RPRNAME;/* GET LU NODENAME
*                                      FOR MESSAGE                   */
         MVC   CVANAME1(8),RPRNAME(CVAWKRDT)                       2112
*                                   CVAMSG=ADDR(CVANAME1);/* GET   2113
*                                      ADDRESS OF MESSAGE VARIABLE   */
         LA    @15,CVANAME1                                        2113
         ST    @15,CVAMSG                                          2113
*                                 END;                             2114
*                               ELSE                               2115
*                                 IF CVAMSID@->CVAMSGID=CVAMS606 /*
*                                      'ACTIVATE UNIT FAILED' MSG?   */
*                                   THEN                           2115
         B     @RC02109                                            2115
@RF02109 L     @15,CVAMSID@                                        2115
         CLC   CVAMSGID(4,@15),CVAMS606                            2115
         BNE   @RF02115                                            2115
*                                    DO;                           2116
*                                     CVAMSID@=ADDR(CVAMS630);/* YES -
*                                      GET ADDRESS OF 'UNABLE TO   2117
*                                      ACTIVATE NODE IO ERROR'     2117
*                                      MESSAGE               @D31LKDQ*/
         LA    @15,CVAMS630                                        2117
         ST    @15,CVAMSID@                                        2117
*                                     CVANAME1=RPRNAME;/* GET NODENAME
*                                                                    */
         MVC   CVANAME1(8),RPRNAME(CVAWKRDT)                       2118
*                                     CVAMSG=ADDR(CVANAME1);/* GET 2119
*                                      ADDRESS OF MESSAGE VARIABLES  */
         LA    @15,CVANAME1                                        2119
         ST    @15,CVAMSG                                          2119
*                                    END;                          2120
*                                   ELSE;                          2121
@RF02115 DS    0H                                                  2122
*                             CALL CVATPMSG;/* GO OUTPUT ERROR     2122
*                                      MESSAGE                       */
@RC02109 BAL   @14,CVATPMSG                                        2122
*                             CVAERRSW='0'B;/* TURN ERROR SWITCH OFF */
         NI    CVAERRSW,B'11111011'                                2123
*                             NCSACTV=CVAON;  /* REFLECTS A CHANGE IN
*                                                 STATUS     @X50BHC8*/
         OI    NCSACTV(NCSPLPTR),B'10000000'                       2124
*                             NCSAIMOD=CVAOFF;  /* REFLECTS NOT    2125
*                                                   ACTIVE   @X50BHC8*/
*                                                                  2125
         NI    NCSAIMOD(NCSPLPTR),B'01111111'                      2125
*/*CRIO  FUNC(UPDATE)RDT((CVAWKRDT))PROCNM(ISTINCVA)*/             2126
*                              DO;                                 2126
*                              RFY (GPR01P,GPR15P) RSTD;           2127
*                              GPR15P = 0;                         2128
         SLR   GPR15P,GPR15P                                       2128
*                              IF CVAWKRDT->RPRCRCPT = '1'B        2129
*                              THEN DO;                            2129
         TM    RPRCRCPT(CVAWKRDT),B'01000000'                      2129
         BNO   @RF02129                                            2129
*                              NCSCRDTE = CVAWKRDT;                2131
         ST    CVAWKRDT,NCSCRDTE(,NCSPLPTR)                        2131
*                              NCSCRCMD = NCSCRWR;                 2132
         MVI   NCSCRCMD(NCSPLPTR),X'00'                            2132
*                              GPR01P = ADDR(ISTNCSPL);            2133
         LR    GPR01P,NCSPLPTR                                     2133
*                              CALL ISTINCR5;                      2134
*                                                                  2134
         L     @15,@CV05443                                        2134
         BALR  @14,@15                                             2134
*                              DO;                                 2135
*/***  CRRMAINT  RPHADD((NCSPLRPH))PROCNM(ISTINCVA)COMP(VY)FUNC(RET)  *
**/                                                                2136
*                              /*** CLEAR AND SET CURRENT PROCEDURE BIT
****/                                                              2136
*NCSPLRPH->RPHCRR->CRACRR->VYCCRT = '0'B;                          2136
         L     @07,NCSPLRPH(,NCSPLPTR)                             2136
         L     @07,RPHCRR(,@07)                                    2136
         L     @07,CRACRR(,@07)                                    2136
         XC    VYCCRT+1(11,@07),VYCCRT+1(@07)                      2136
         MVI   VYCCRT(@07),B'00000000'                             2136
*NCSPLRPH->RPHCRR->CRACRR->CINCVA = '1'B;                          2137
         OI    CINCVA(@07),B'00000010'                             2137
*                              END;                                2138
*                              RFY (GPR01P,GPR15P) UNRSTD;         2139
*                              END;                                2140
*                              END;                                2141
@RF02129 DS    0H                                                  2142
*                              /* END OF CRIO EXPANSION */     /*@X50BH
*8*/                                                               2142
*                           END;                                   2142
*                         ELSE                                     2143
*                           ;       /* ERROR SWITCH NOT ON -         */
@RF02107 DS    0H                                                  2144
*                       END;                                       2144
*                      END;                                /*@XA10138*/
*                     ELSE                                         2146
*                       ;           /* LU DOES NOT HAVE ISTATUS -    */
@RF02006 DS    0H                                                  2147
*                    END;                                          2147
*                   ELSE                                           2148
*                     CVALOOP2='0'B;/* ENTRY NOT AN LU -- STOP     2148
*                                      LOOPING THROUGH RDT           */
         B     @RC02003                                            2148
@RF02003 NI    CVALOOP2,B'11011111'                                2148
*                 END;              /* END OF DO WHILE LOOP          */
@RC02003 DS    0H                                                  2149
@DE02001 TM    RPRENTED(CVAWKRDT),B'00000100'                      2149
         BNZ   @DC02001                                            2149
         TM    CVALOOP2,B'00100000'                                2149
         BO    @DL02001                                            2149
@DC02001 DS    0H                                                  2150
*                 NCSPLRID=CVARIDSV;/* RESTORE RID NAME IN NCSPL     */
         MVC   NCSPLRID(8,NCSPLPTR),CVARIDSV                       2150
*                 NCSPLRPT=CVARPTSV;/* RESTORE RPT IN NCSPL          */
         L     @15,CVARPTSV                                        2151
         ST    @15,NCSPLRPT(,NCSPLPTR)                             2151
*                 CVAWKRDT=CVAWKSAV;/* RESTORE WORK POINTER TO     2152
*                                      CLUSTER ENTRY                 */
         L     CVAWKRDT,CVAWKSAV                                   2152
*                 NCSCRMSK=CVACRMSK;  /* RESTORE C/R MASKS   @X50BHC8*/
         MVC   NCSCRMSK(3,NCSPLPTR),CVACRMSK+1                     2153
*                 CALL CVASR041;    /* GO PROCESS FOR SIMLOGON       */
         BAL   @14,CVASR041                                        2154
*               END;                                               2155
*           END;                                                   2156
*         ELSE                      /* GO SWITCH NOT ON -            */
*          DO;                                                     2157
*                                                                  2157
         B     @RC01985                                            2157
@RF01985 DS    0H                                                  2158
*           /*********************************************************/
*           /*                                                       */
*           /* GET THE VOC LOCK                                      */
*           /*                                                       */
*           /*********************************************************/
*                                                                  2158
*           CVAR0=CVA0;                                            2158
         SLR   CVAR0,CVAR0                                         2158
*           CALL CVASRLOC;                                         2159
*                                                                  2159
         BAL   @14,CVASRLOC                                        2159
*           /*********************************************************/
*           /*                                                       */
*           /* GET THE RDT LOCK                                      */
*           /*                                                       */
*           /*********************************************************/
*                                                                  2160
*           CVAR0=CVA4;                                            2160
         LA    CVAR0,4                                             2160
*           CALL CVASRLOC;                                         2161
         BAL   @14,CVASRLOC                                        2161
*           IF NCSPLP1=0            /* NCSPL HAVE A 0 VARY PAB ADR?  */
*             THEN                                                 2162
         SLR   @15,@15                                             2162
         C     @15,NCSPLP1(,NCSPLPTR)                              2162
         BNE   @RF02162                                            2162
*             DO;                   /* YES -                         */
*                RFY                                               2164
*                  CVAR0 UNRSTD;                                   2164
*                   NCSPLP1=RCCVPAB;/* MOVE VARY PAB ADDR TO NCSPL   */
         L     @07,RCCVPAB(,CVAWKRDT)                              2165
         ST    @07,NCSPLP1(,NCSPLPTR)                              2165
*                   NCSPLP2=RCCEPAB;/* MOVE ERP PAB ADDR TO NCSPL    */
         L     @07,RCCEPAB(,CVAWKRDT)                              2166
         ST    @07,NCSPLP2(,NCSPLPTR)                              2166
*                   NCSPLP3=RCCDPAB;/* MOVE D/L/R PAB ADDRESS        */
         L     @07,RCCDPAB(,CVAWKRDT)                              2167
         ST    @07,NCSPLP3(,NCSPLPTR)                              2167
*                   RCCVPAB=0;      /* ZERO CLUSTER VARY PAB ADDR    */
         ST    @15,RCCVPAB(,CVAWKRDT)                              2168
*                   RCCEPAB=0;      /* ZERO CLUSTER ERP PAB ADDR     */
         ST    @15,RCCEPAB(,CVAWKRDT)                              2169
*                   RCCDPAB=0;      /* ZERO CLUSTER D/L/R PAB ADDR   */
         ST    @15,RCCDPAB(,CVAWKRDT)                              2170
*                END;                                      /*@DM14950*/
*               IF RCCDSTCT='1'B    /* BOUNDRY NODE KNOW ABOUT THE 2172
*                                      DEACTIVATE REQUEST?           */
*                 THEN                                             2172
@RF02162 TM    RCCDSTCT(CVAWKRDT),B'10000000'                      2172
         BNO   @RF02172                                            2172
*                 DO;               /* YES -                         */
*                   RCCDSTCT='0'B;                         /*@DM14950*/
         NI    RCCDSTCT(CVAWKRDT),B'01111111'                      2174
*                   CVAWKSAV=CVAWKRDT;/* SAVE THE CLUSTER CONTROLLER
*                                      ENTRY ADDRESS                 */
         ST    CVAWKRDT,CVAWKSAV                                   2175
*                   DO WHILE RPRENTRY^=RPRENTRN;/* LOOK FOR THE RN 2176
*                                       ENTRY                        */
         B     @DE02176                                            2176
@DL02176 DS    0H                                                  2177
*                     CVAWKRDT=RPRNSNEA;/* GET THE NEXT HIGHER NODE  */
         L     CVAWKRDT,RPRNSNEA(,CVAWKRDT)                        2177
*                   END;                                           2178
@DE02176 CLI   RPRENTRY(CVAWKRDT),X'01'                            2178
         BNE   @DL02176                                            2178
*                   RFY ISTRDT BASED(CVAWKRDT);            /*@DM93854*/
*                   RDTSTCNT=RDTSTCNT-CVA1;/* DECREMENT THE ACTIVE 2180
*                                       SUBNODE COUNT                */
         SLR   @15,@15                                             2180
         IC    @15,RDTSTCNT(,CVAWKRDT)                             2180
         BCTR  @15,0                                               2180
         STC   @15,RDTSTCNT(,CVAWKRDT)                             2180
*                   IF RDTSTCNT=0&RDTVYRPH^=0 /* ACTIVE SUBNODE COUNT
*                                        NOW ZERO AND A NCSPL READY
*                                        TO BE TPQUED?               */
*                     THEN                                         2181
         CLI   RDTSTCNT(CVAWKRDT),0                                2181
         BNE   @RF02181                                            2181
         SLR   @15,@15                                             2181
         L     @07,RDTVYRPH(,CVAWKRDT)                             2181
         CR    @07,@15                                             2181
         BE    @RF02181                                            2181
*                      DO;            /* YES -                       */
*                        RFY                                       2183
*                          CVAR2 RSTD;                             2183
*                        CVAR2=RDTVYRPH;/* GET THE ADDRESS OF THE  2184
*                                        NCSPL                       */
         LR    CVAR2,@07                                           2184
*                        RDTVYRPH=0;  /* ZERO OUT THE NCSPL ADDRESS TO
*                                      INDICATE VARY IS NOT WAITING  */
         ST    @15,RDTVYRPH(,CVAWKRDT)                             2185
*                        RFY ISTRDT BASED(RDTEPTR);        /*@DM93854*/
*                                                                  2186
*                        /********************************************/
*                        /*                                          */
*                        /* TPQUE THE RETRIEVED NCSPL TO BNN VARY PAB*/
*                        /*                                          */
*                        /********************************************/
*                RFY ISTDYPAB BASED(CVAWKRDT->RDTVPAB);    /*@D31LKDQ*/
*                                                                  2187
*/*  TPQUE (CVAR2,DYPPAB) NORM */                                  2188
*                                                                  2188
*                 DO;                                              2188
*                 RFY (GPR00P,GPR01P,GPR04P,GPR05P,GPR15P) RSTD;   2189
*                 GEN REFS(GPR01P) SETS(RPHWORK)                   2190
*        (STM GPR02P,GPR08P,RPHWORK(GPR01P));                      2190
         STM GPR02P,GPR08P,RPHWORK(GPR01P)
*                 GPR00P=0;                                        2191
         SLR   GPR00P,GPR00P                                       2191
*                 GPR15P=ADDR(DYPPAB); /*HOLD PAB PTR*/            2192
         L     GPR15P,RDTVPAB(,CVAWKRDT)                           2192
         LA    GPR15P,DYPPAB(,GPR15P)                              2192
*                 GPR04P=CVAR2; /*WORK ELE PTR*/                   2193
         LR    GPR04P,CVAR2                                        2193
*                 GPR05P=GPR15P; /*PASS PAB PTR*/                  2194
         LR    GPR05P,GPR15P                                       2194
*                 CALL ATCLCPTR->ATCAP37->ISTAPC37;                2195
         L     @07,ATCLCPTR                                        2195
         L     @15,ATCAP37(,@07)                                   2195
         BALR  @14,@15                                             2195
*                 GEN(NOPR  0)NOSETS NOREFS;                       2196
         NOPR  0
*                 RFY (GPR00P,GPR01P,GPR04P,GPR05P,GPR15P) UNRSTD; 2197
*                 END; /**** END OF TPQUE GENERATION ****/         2198
* /*@D31LKDQ*/                                                     2199
*                        RFY                                       2199
*                          CVAR2 UNRSTD;                           2199
*                      END;                                        2200
*                     ELSE;         /* ACTIVE SUBNODES AND/OR NO VARY
*                                      RPH WAITING                   */
@RF02181 DS    0H                                                  2202
*                   CVAWKRDT=CVAWKSAV;/* RESTORE THE CLUSTER CONTROLLER
*                                      ENTRY ADDRESS                 */
         L     CVAWKRDT,CVAWKSAV                                   2202
*                 END;                                             2203
*               ELSE;                                              2204
@RF02172 DS    0H                                                  2205
*               RFY                                                2205
*                  CVAR0 RSTD;                                     2205
*                                                                  2205
*                   /*************************************************/
*                   /*                                               */
*                   /* RELEASE THE RDT LOCK:                         */
*                   /*                                               */
*                   /*************************************************/
*                                                                  2206
*                   CVAR0=CVA14;                                   2206
         LA    CVAR0,14                                            2206
*                   CALL CVASRLOC;                                 2207
*                                                                  2207
         BAL   @14,CVASRLOC                                        2207
*                   /*************************************************/
*                   /*                                               */
*                   /* RELEASE THE VOC LOCK:                         */
*                   /*                                               */
*                   /*************************************************/
*                                                                  2208
*                   CVAR0=CVA10;                                   2208
         LA    CVAR0,10                                            2208
*                   CALL CVASRLOC;                                 2209
         BAL   @14,CVASRLOC                                        2209
*                   IF NCSPLPOS='1'B/* BOUNDRY NODE POSTED?          */
*                     THEN                                         2210
         TM    NCSPLPOS(NCSPLPTR),B'00000001'                      2210
         BNO   @RF02210                                            2210
*                     CALL CVACLU05;/* YES - DEQUE NCSPL             */
         BAL   @14,CVACLU05                                        2211
*                   ELSE                                           2212
*                     DO;                                          2212
         B     @RC02210                                            2212
@RF02210 DS    0H                                                  2213
*                       RFY                                        2213
*                         CVAR2 RSTD;                              2213
*                       CVAR2=NCSPLWEL;/* GET ADDRESS OF RPH TO BE 2214
*                                      POSTED                        */
         L     CVAR2,NCSPLWEL(,NCSPLPTR)                           2214
*                       RFY                                        2215
*                         CVAR0 UNRSTD;                            2215
*                                                                  2215
*                       /*********************************************/
*                       /*                                           */
*                       /* POST THE RPH THAT IS WAITING:             */
*                       /*                                           */
*                       /*********************************************/
*                                                                  2216
*                                                                  2216
*/*TPPOST  (CVAR2)  */                                             2216
*                        DO;                                       2216
*                                       /*DECLARE AND RESTRICT REGS*/
*                          RESPECIFY (GPR00F,GPR01F,GPR04F,GPR05F, 2217
*                                    GPR06F,GPR14F,GPR15F) RSTD;   2217
*                                       /*0,1,4,5,6,14, AND 15   */
*                                                                  2218
*/* ATBUILD (ISTPAB,ISTDYPAB,ISTRPH)  */                           2218
*/* END OF ATBUILD */      GEN REFS(GPR01P,GPR02F,GPR06F)SETS(RPHWORK);
        STM GPR02F,GPR06F,RPHWORK(GPR01P)
*                          GPR04F=CVAR2;/*LOAD RPH PNTR INTO REG 4*/
         LR    GPR04F,CVAR2                                        2219
*                          RFY GPR03F RSTD;                        2220
*                          GPR03F=0;                               2221
*                                                                  2221
         SLR   @07,@07                                             2221
         LR    GPR03F,@07                                          2221
*                        DO; /*MODESET  SAVEKEY(GPR06F) KEYADDR(GPR03F)
*WORKREG(GPR05F)*/         RESPECIFY (GPR02F) RESTRICTED;          2222
*                          GPR05F = GPR02F; /*SAVE REGISTER 2*/    2224
         LR    GPR05F,GPR02F                                       2224
*                          IPK; /*SAVE CURRENT PSW KEY*/           2225
         IPK                                                       2225
*                          GPR06F = GPR02F;                        2226
         LR    GPR06F,GPR02F                                       2226
*                          GPR02F = GPR05F; /*RESTORE REGISTER 2*/ 2227
         LR    GPR02F,GPR05F                                       2227
*                          SPKA (GPR03F); /*SET PSW KEY*/          2228
         SPKA  0(GPR03F)                                           2228
*                          RESPECIFY (GPR02F) UNRESTRICTED;        2229
*                        END; /*MODESET  SAVEKEY(GPR06F) KEYADDR(GPR03F
* WORKREG(GPR05F)*/        RFY GPR03F UNRSTD;                      2230
*                          GPR05P=GPR04P->RPHMAJCB+GPR04P->RPHPABOF;
         L     GPR05P,RPHMAJCB-1(,GPR04P)                          2232
         LA    GPR05P,0(,GPR05P)                                   2232
         SLR   @03,@03                                             2232
         IC    @03,RPHPABOF(,GPR04P)                               2232
         ALR   GPR05P,@03                                          2232
*                                       /*LOAD REG 5  WITH ADDR OF*/
*                                       /*MAJOR CONTROL BLOCK PLUS*/
*                                       /*OFFSET OF PAB IN BLOCK  */
*                          GPR14P=0;    /*LOAD 0 INTO REG 14      */
         LR    GPR14P,@07                                          2233
*                          GPR15P='FFFFFFFF'X;                     2234
         SLR   GPR15P,GPR15P                                       2234
         BCTR  GPR15P,0                                            2234
*                                       /*LOAD REG 15 WITH DUMMY  */
*                                       /*ADDRESS                 */
*                          CS (GPR14P,GPR15P,GPR04P->RPHRESMA);    2235
         CS    GPR14P,@15,RPHRESMA(GPR04P)                         2235
*                                       /*COMPARE RESUME ADDRESS  */
*                                       /*WITH 0 AND,IF EQUAL, PUT*/
*                                       /*DUMMY ADDRESS IN CONTROL*/
*                                       /*BLOCK RESUME ADDRESS    */
*                          BC (8,FMZT0096);                        2236
         BC    8,FMZT0096                                          2236
*                                       /*IF EQUAL, BYPASS REMAINDER*/
*                                       /*OF EXPANSION              */
*FMZL0096:                 IF GPR04P->RPHWT='1'B THEN              2237
FMZL0096 TM    RPHWT(GPR04P),B'00001000'                           2237
         BNO   @RF02237                                            2237
*                                       /*WT/EXT CONTENTION FLAG ON */
*                          DO;          /*IN RPH                    */
*                            GPR14P=GPR04P->RPHRESMA×RPHWT1;       2239
         L     GPR14P,RPHRESMA(,GPR04P)                            2239
         O     GPR14P,@CF01355                                     2239
*                                       /*LOAD REG 14 WITH FLAG FIELD*/
*                                       /*AND MAKE CERTAIN WT/EXT    */
*                                       /*CONTENTION FLAG STILL ON   */
*                            GPR15P=GPR14P×RPHPT1;                 2240
         LR    GPR15P,GPR14P                                       2240
         O     GPR15P,@CF01359                                     2240
*                                       /*LOAD REG 15 WITH FLAG FIELD*/
*                                       /*AND TURN POST FLAG ON      */
*                            CS (GPR14P,GPR15P,GPR04P->RPHRESMA);  2241
         CS    GPR14P,@15,RPHRESMA(GPR04P)                         2241
*                                       /*COMPARE REG 14 WITH FLAG */
*                                       /*FIELD--IF WT/EXT BIT ON, */
*                                       /*TURN ON POST FLAG        */
*                            BC (4,FMZL0096);                      2242
         BC    4,FMZL0096                                          2242
*                                       /*IF WT/EXT BIT WAS OFF, LOOP*/
*                                       /*TO TEST CONTENTION FLAG    */
*                            BC (8,FMZT0096);                      2243
         BC    8,FMZT0096                                          2243
*                                       /*IF WT/EXT BIT WAS OFF,     */
*                                       /*BRANCH TO BYPASS CODE GEN  */
*                          END;         /*IF POST FLAG IS ON, FALL*/
*                                       /*THRU BOTTOM OF LOOP     */
*                          ELSE;        /*WT/EXT CONTENTION FLAG OFF*/
@RF02237 DS    0H                                                  2246
*                          IF GPR04P->RPHTSKID=GPR01P->RPHTSKID    2246
*                          THEN DO;                                2246
         CLC   RPHTSKID(4,GPR04P),RPHTSKID(GPR01P)                 2246
         BNE   @RF02246                                            2246
*                            GPR05P->PABCHNGP=GPR01P->RPHPABQP;    2248
         MVC   PABCHNGP(3,GPR05P),RPHPABQP(GPR01P)                 2248
*                                       /*PUT PAB QUEUE ADDRESS*/  2249
*                                       /*IN SECOND WORD OF PAB     */
*                            GPR01P->RPHPABQP=GPR05P;              2249
         STCM  GPR05P,7,RPHPABQP(GPR01P)                           2249
*                                       /*PUT PAB ADDRESS (IN MAJOR */
*                                       /*CONTROL BLOCK) IN PAB */ 2250
*                                       /*QUEUE ADRESS IN RPH    */
*                            END;                                  2250
*                          ELSE DO;                                2251
         B     @RC02246                                            2251
@RF02246 DS    0H                                                  2252
*                            GPR00F=0;  /*SET REG 0 TO INDICATE ENA*/
*                                                                  2252
         SLR   GPR00F,GPR00F                                       2252
*                        DO; /* LISATCVT CVTBASE(PAGEABLE,(GPR15P)) */
*                          GPR15P = ATCLCPTR; /*SET UP ATCVT POINTER*/
         L     GPR15P,ATCLCPTR                                     2254
*                        END; /*LISATCVT*/                         2255
*                                       /*PUT POINTER TO ATCVT IN */
*                                       /*  IN REG 15             */
*                            CALL GPR15P->ATCAP32;                 2256
         L     @07,ATCAP32(,GPR15P)                                2256
         LR    @15,@07                                             2256
         BALR  @14,@15                                             2256
*                                       /* CALL ISTAPC32: TPSCHED */
*                            END;                                  2257
*FMZT0096:                                                         2258
*                        DO; /*MODESET  KEYADDR(GPR06F) WORKREG(GPR05F)
*/                         GPR05F = GPR06F; /*GET KEY FORM SAVE LOCATIO
**/                        SPKA (GPR05F); /*SET PSW KEY*/          2258
@RC02246 DS    0H                                                  2258
FMZT0096 DS    0H                                                  2259
         LR    GPR05F,GPR06F                                       2259
         SPKA  0(GPR05F)                                           2260
*                        END; /*MODESET  KEYADDR(GPR06F) WORKREG(GPR05F
**/                        GEN REFS(GPR04P,                        2261
*                          RPHWORK)                                2262
*                              SETS(GPR02F,GPR03F,                 2262
*                                    GPR04F,GPR05F,GPR06F);        2262
        LM GPR02F,GPR06F,RPHWORK(GPR01P)
*                          RESPECIFY (GPR00F,GPR01F,GPR04F,GPR05F,GPR06
*,                         GPR14F,GPR15F) UNRSTD;                  2263
*                                       /*UNRESTRICT REGS 0,1,    */
*                                       /*4,5,14, AND 15          */
*                        END;  /****END OF TPPOST GENERATION****/  2264
*                       RFY                                        2265
*                         CVAR2 UNRSTD;                            2265
*                                                                  2265
*                       /*********************************************/
*                       /*                                           */
*                       /* RELEASE PABS POINTED TO BY NCSPLP1:       */
*                       /*                                           */
*                       /*********************************************/
*                                                                  2266
*                        /*FREESTOR AREA(NCSPLP1)SIZE(CVAPABS)TYPE(PAGE
*BLE)CLEAR(NO)SAVE(YES)*/                                          2266
*                         DO;                                      2266
*/* ATBUILD (ISTPAB,ISTDYPAB,ISTATCVT,ISTRPH)  */                  2267
*/* END OF ATBUILD */    RFY (GPR00P,GPR01P,GPR02P,GPR03P) RSTD;   2267
*                        RFY ISTRPH BASED(GPR01P);                 2268
*                        GEN REFS(GPR02P,GPR03P,GPR04P,GPR05P,     2269
*                                 GPR06P,GPR07P,GPR08P,GPR09P,     2269
*                                 GPR10P,GPR11P,GPR12P,GPR13P)     2269
*                            SETS(RPHWORK);                        2269
*                                                                  2269
         STM   GPR02P,GPR13P,RPHWORK(GPR01P)        SAVE REGISTERS
*                        GPR00F = CVAPABS;             /*SIZE IN REG0*/
         L     GPR00F,CVAPABS                                      2270
*                        DCL 1 CMZA0108 FIXED(31) STATIC LOCAL,    2271
*                              2 * FIXED(8) INIT(64),/* OPTION FLAGS */
*                              2 * FIXED(8) INIT(96), /* STORAGE KEY */
*                              2 * FIXED(8) INIT(231),             2271
*                                                  /* SUBPOOL NUMBER */
*                              2 * FIXED(8) INIT('01'X);           2271
*                                                    /* REQUEST TYPE */
*                        GPR03F = CMZA0108;                        2272
         L     GPR03F,CMZA0108                                     2272
*                        RFY (GPR04P) RSTD;                        2273
*                        GPR04P = NCSPLP1;/*PUT FREEMAIN ADDR IN REG4*/
*                                                                  2274
         L     GPR04P,NCSPLP1(,NCSPLPTR)                           2274
*                        DO; /* LISATCVT CVTBASE(PAGEABLE,(GPR02P)) */
*                          GPR02P = ATCLCPTR; /*SET UP ATCVT POINTER*/
         L     GPR02P,ATCLCPTR                                     2276
*                        END; /*LISATCVT*/                         2277
*                        CALL GPR02P -> ATCGTSTR;     /*CALL ISTORFSR*/
         L     @15,ATCGTSTR(,GPR02P)                               2278
         BALR  @14,@15                                             2278
*                        RFY (GPR00P,GPR01P,GPR02P,GPR03P,GPR04P) UNRST
*;                                                                 2279
*                        END ;                      /*END OF FREESTOR*/
*                       RPHPABOF=0; /* MAKE RPH LOOK AS THOUGH PABS
*                                      WERE DYNAMIC                  */
         MVI   RPHPABOF(GPR01P),X'00'                              2281
*                       RPHMAJCB=0;                                2282
         SLR   @15,@15                                             2282
         STCM  @15,7,RPHMAJCB(GPR01P)                              2282
*                       NCSPLNON='1'B;/* INDICATE THAT THE RDT     2283
*                                      SEGMENT CAN NO LONGER BE    2283
*                                      REFERENCED                    */
         OI    NCSPLNON(NCSPLPTR),B'00001000'                      2283
*         END;                                                     2284
*        END;                       /* END OF 'GO SWITCH NOT ON'   2285
*                                      PROCESSING                    */
@RC02210 DS    0H                                                  2286
*       END;                        /* END OF 'ENTRY FROM BNN'     2286
*                                      PROCESSING                    */
@RC01985 DS    0H                                                  2287
*     END;                        /*PU IN RN                 @D32CKDQ*/
@RC01927 DS    0H                                                  2287
@RC01891 DS    0H                                                  2288
*    END;                     /*PROCESS PUS -VALID RC FROM CVASR100*/
@RC01804 DS    0H                                                  2289
*   CVAR14=CVARSCLU;                /* RESTORE RETURN REGISTER       */
@RC01798 L     CVAR14,CVARSCLU                                     2289
*   RFY                                                            2290
*     CVAR15 UNRSTD;                                               2290
*   END CVASRCLU;                   /* RETURN TO CALLER              */
@EL00013 DS    0H                                                  2291
@EF00013 DS    0H                                                  2291
@ER00013 BR    @14                                                 2291
@PB00013 DS    0H                                                  2292
*   GEN(  EJECT);                                                  2292
           EJECT
*CVACLU02:                                                         2293
*   PROC OPTIONS(NOSAVE NOSAVEAREA);                               2293
*                                                                  2293
         B     @PB00014                                            2293
CVACLU02 DS    0H                                                  2294
*   /*****************************************************************/
*   /*                                                               */
*   /* PROCESS FOR NEW CLUSTER NCSPL: THE PURPOSE OF THIS SUBROUTINE */
*   /* IS TO GETSTOR A NEW NCSPL, CALL SUBROUTINE CVASRWKA TO OBTAIN */
*   /* A WORKAREA, INITIALIZE THE NCSPL TO INDICATE A VARY ACTIVATE, */
*   /* OBTAIN THREE NEW PABS AND INITIALIZE THEM, QUEUE THE NEW NCSPL*/
*   /* TO THE CLUSTER'S NEW VARY PAB, AND WAIT FOR THAT NCSPL TO BE  */
*   /* PROCESSED. IF ALL OF THE ABOVE HAS BEEN DONE, A RETURN CODE OF*/
*   /* ZERO IS RETURNED TO THE CALLER IN REG 15. OTHERWISE, A NON-   */
*   /* ZERO RETURN CODE IS RETURNED.                                 */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  2294
*   RFY                                                            2294
*     (CVAR0,CVAR15) RSTD;                                 /*@D32CKDQ*/
*   RFY                                                            2295
*     ISTRPRE BASED(CVAWKRDT);                                     2295
*   RFY                                                            2296
*     ISTRCC BASED(CVAWKRDT);                                      2296
*   RFY                                                            2297
*     ISTRDT BASED(CVAWKRDT);                                      2297
*   CVARSCL2=CVAR14;                /* SAVE RETURN REGISTER          */
*                                                                  2298
         ST    CVAR14,CVARSCL2                                     2298
*   /*****************************************************************/
*   /*                                                               */
*   /* GET CORE FOR A NEW CLUSTER NCSPL AND WKA              @D32CKDQ*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  2299
*   RFY ISTVYCRR BASED(NCSPLRPH->RPHCRR->CRACRR);          /*@D32CKDQ*/
*   RFY ISTGTNCS BASED(ADDR(VYCRRCW3));                    /*@D32CKDQ*/
*   CVAR1=NCSPLRPH;                 /*GET RPH ADDR           @D32CKDQ*/
         L     @07,NCSPLRPH(,NCSPLPTR)                             2301
         LR    CVAR1,@07                                           2301
*   CVAR0=ADDR(VYCRRCW3);        /*PARM PTR               @D32CKDQ*/
         L     @07,RPHCRR(,@07)                                    2302
         L     @07,CRACRR(,@07)                                    2302
         LA    CVAR0,VYCRRCW3(,@07)                                2302
*   VYCRRCW3=VYCRRCW3&&VYCRRCW3;    /*PARM LIST              @D32CKDQ*/
         XC    VYCRRCW3(8,@07),VYCRRCW3(@07)                       2303
*   CALL ISTINCW3;                  /*GET NCSPL +WKA         @D32CKDQ*/
         L     @07,NCSPLCVT(,NCSPLPTR)                             2304
         L     @15,ATCINCW3(,@07)                                  2304
         BALR  @14,@15                                             2304
*   IF CVAR15^=0                                                   2305
*     THEN;                         /*RETURN                 @D32CKDQ*/
         LTR   CVAR15,CVAR15                                       2305
         BNZ   @RT02305                                            2305
*     ELSE                                                         2307
*     DO;                           /*GOTTEN                 @D32CKDQ*/
*           CVANCSPL=GTNCSAD;       /*GET ADDR OF NEW NCSPL  @D32CKDQ*/
         L     @07,NCSPLRPH(,NCSPLPTR)                             2308
         L     @05,RPHCRR(,@07)                                    2308
         L     @05,CRACRR(,@05)                                    2308
         L     @05,GTNCSAD+118(,@05)                               2308
         ST    @05,CVANCSPL                                        2308
*           RFY                                                    2309
*             ISTNCSPL BASED(CVANCSPL);                            2309
*           NCSPLSID=NCSPLPTR->NCSPLSID;/* GET CONSOLE ID            */
         MVC   NCSPLSID(9,@05),NCSPLSID(NCSPLPTR)                  2310
*           NCSPLVCD=NCSPLVC1;      /* INDICATE 'VARY'               */
         MVI   NCSPLVCD(@05),X'01'                                 2311
*           NCSPLVBF=NCSPLPTR->NCSPLVBF;/* GET ORIGINAL COMMAND CODE */
         MVC   NCSPLVBF(2,@05),NCSPLVBF(NCSPLPTR)                  2312
*           NCSPLLID=NCSPLPTR->NCSPLLID;/* GET APPLICATION NAME FROM
*                                      THE ORIGINAL NCSPL            */
         MVC   NCSPLLID(8,@05),NCSPLLID(NCSPLPTR)                  2313
*           NCSPLLPT=NCSPLPTR->NCSPLLPT;/* GET APPLICATION RDTE ADDRESS
*                                      FROM THE ORIGINAL NCSPL       */
         L     @04,NCSPLLPT(,NCSPLPTR)                             2314
         ST    @04,NCSPLLPT(,@05)                                  2314
*           NCSPLRID=RPRNAME;       /* GET CLUSTER NODENAME          */
         MVC   NCSPLRID(8,@05),RPRNAME(CVAWKRDT)                   2315
*           NCSPLRPT=CVAWKRDT;      /* GET CLUSTER RDTE ADDRESS      */
         ST    CVAWKRDT,NCSPLRPT(,@05)                             2316
*           NCSPLEBN='1'B;          /* INDICATE ENTRY FROM BOUNDRY 2317
*                                      NODE -- NCSPL IS ON THE     2317
*                                      CLUSTER'S PABSET              */
         OI    NCSPLEBN(@05),B'00100000'                           2317
*           NCSPLWEL=NCSPLPTR->NCSPLRPH;/* GET CURRENT RPH ADDRESS   */
         ST    @07,NCSPLWEL(,@05)                                  2318
*           NCSPLMID=NCSPLPTR->NCSPLMID;  /* GET LOGMODE INFORMATION
*                                                            @DM93865*/
         MVC   NCSPLMID(8,@05),NCSPLMID(NCSPLPTR)                  2319
*           IF CVANEWSG='1'B×CVASGMNT='1'B /* NEW SEGMENT OR SEGMENT
*                                      SWITCH ON?                    */
*              THEN                                                2320
         TM    CVANEWSG,B'01010000'                                2320
         BZ    @RF02320                                            2320
*                 IF CVANEWSG=CVAON /* NEW SEGMENT SWITCH ON? @X50BHC8
*                                                            @XM19212*/
*             THEN                                                 2321
         TM    CVANEWSG,B'01000000'                                2321
         BNO   @RF02321                                            2321
*             NCSPL2IN=CVAON; /* YES - DO NOT SUPPRESS OPER        2322
*                                      MESSAGES              @X50BHC8*/
         OI    NCSPL2IN(@05),B'10000000'                           2322
*             ELSE;                                        /*@X50BHC8*/
@RF02321 DS    0H                                                  2324
*           ELSE                                                   2324
*             NCSPLPTR->NCSPLSOM='1'B;/* NO - NEW SEGMENT SWITCH NOT
*                                      ON - INDICATE SUPPRESS OPER 2324
*                                      MSGS IN ORIG NCSPL            */
         B     @RC02320                                            2324
@RF02320 OI    NCSPLSOM(NCSPLPTR),B'01000000'                      2324
*           RFY ISTNCSPL BASED(NCSPLPTR);                  /*@D32CKDQ*/
@RC02320 DS    0H                                                  2326
*           NCSPLRAD=CVAWKRDT;      /*INPUT TO CW7           @D32CKDQ*/
         ST    CVAWKRDT,NCSPLRAD(,NCSPLPTR)                        2326
*           CVAR1=NCSPLPTR;            /*NCSPL               @D32CKDQ*/
         LR    CVAR1,NCSPLPTR                                      2327
*           CALL ISTINCW7;          /*GET 3 PABS             @D32CKDQ*/
*                                                                  2328
         L     @15,@CV05618                                        2328
         BALR  @14,@15                                             2328
*            DO;                                                   2329
*/***  CRRMAINT  PROCNM(ISTINCVA)COMP(VY)FUNC(RET)RPHADD((NCSPLRPH))  *
**/                                                                2330
*            /*** CLEAR AND SET CURRENT PROCEDURE BIT ***/         2330
*NCSPLRPH->RPHCRR->CRACRR->VYCCRT = '0'B;                          2330
         L     @07,NCSPLRPH(,NCSPLPTR)                             2330
         L     @05,RPHCRR(,@07)                                    2330
         L     @05,CRACRR(,@05)                                    2330
         XC    VYCCRT+1(11,@05),VYCCRT+1(@05)                      2330
         MVI   VYCCRT(@05),B'00000000'                             2330
*NCSPLRPH->RPHCRR->CRACRR->CINCVA = '1'B;                          2331
         OI    CINCVA(@05),B'00000010'                             2331
*            END;            /*@D32CKDQ*/                          2332
*           IF CVAR15^=CVA0         /*NO STORAGE             @D32CKDQ*/
*             THEN                                                 2333
         LTR   CVAR15,CVAR15                                       2333
         BZ    @RF02333                                            2333
*             DO;                                          /*@D32CKDQ*/
*               CVAR0=ADDR(VYCRRCW3);/*PARM PTR              @D32CKDQ*/
         LA    CVAR0,VYCRRCW3(,@05)                                2335
*               CVAR1=NCSPLRPH;     /*INPUT TO CW3           @D32CKDQ*/
         LR    CVAR1,@07                                           2336
*               GTNCSAD=CVANCSPL;   /*NCSPL AND WKA TO FREE  @D32CKDQ*/
         L     @07,CVANCSPL                                        2337
         ST    @07,GTNCSAD+118(,@05)                               2337
*               CALL ISTINCW3;      /*FREE THEN              @D32CKDQ*/
         L     @07,NCSPLCVT(,NCSPLPTR)                             2338
         L     @15,ATCINCW3(,@07)                                  2338
         BALR  @14,@15                                             2338
*               CVAR15=CVA4;        /*NON ZERO RC            @D32CKDQ*/
         LA    CVAR15,4                                            2339
*               END;                                       /*@D32CKDQ*/
*             ELSE                                                 2341
*             DO;                                          /*@D32CKDQ*/
         B     @RC02333                                            2341
@RF02333 DS    0H                                                  2342
*               IF NCSPLLPT=0 /* APPLICATION RDTE ADDRESS IN @D32CKDQ
*                                      THE ORIGINAL NCSPL?           */
*                 THEN;             /* NO - DO NOT INCREMENT THE   2342
*                                      LOGON COUNT                   */
         L     @07,NCSPLLPT(,NCSPLPTR)                             2342
         LTR   @07,@07                                             2342
         BZ    @RT02342                                            2342
*                 ELSE                                             2344
*                   DO;                                            2344
*                     CVAWKSAV=NCSPLLPT;/* GET THE APPLICATION RDTE
*                                      ADDRESS                       */
         L     @07,NCSPLLPT(,NCSPLPTR)                             2345
         ST    @07,CVAWKSAV                                        2345
*                     DO WHILE CVAWKSAV->RPRENTRY^=RPRENTAH;/* LOOK FOR
*                                      THE APPLICATION HEADER ENTRY  */
         B     @DE02346                                            2346
@DL02346 DS    0H                                                  2347
*                       CVAWKSAV=CVAWKSAV->RPRNSNEA;/* GET THE NEXT
*                                      HIGHER NODE ADDRESS           */
         L     @07,CVAWKSAV                                        2347
         L     @07,RPRNSNEA(,@07)                                  2347
         ST    @07,CVAWKSAV                                        2347
*                     END;                                         2348
@DE02346 L     @07,CVAWKSAV                                        2348
         CLI   RPRENTRY(@07),X'02'                                 2348
         BNE   @DL02346                                            2348
*                     CVAWKSAV->RDTLGCT=CVAWKSAV->RDTLGCT+CVA1;/*  2349
*                                      INCREMENT THE LOGON COUNT IN
*                                      THE APPLICATION HEADER ENTRY  */
         LA    @05,1                                               2349
         SLR   @04,@04                                             2349
         IC    @04,RDTLGCT(,@07)                                   2349
         ALR   @05,@04                                             2349
         STC   @05,RDTLGCT(,@07)                                   2349
*                   END;                                           2350
*               CVAR1=NCSPLRPH;     /* GET CURRENT RPH ADDRESS       */
@RT02342 L     CVAR1,NCSPLRPH(,NCSPLPTR)                           2351
*               RFY                                                2352
*                 ISTDYPAB BASED(RCCVPAB);                         2352
*                                                                  2352
*               /*****************************************************/
*               /*                                                   */
*               /* QUEUE THE NEW CLUSTER NCSPL TO THE NEW CLUSTER    */
*               /* VARY PAB                                          */
*               /*                                                   */
*               /*****************************************************/
*                                                                  2353
*                                                                  2353
*/*  TPQUE (CVANCSPL,DYPPAB) NORM */                               2353
*                                                                  2353
*                DO;                                               2353
*                RFY (GPR00P,GPR01P,GPR04P,GPR05P,GPR15P) RSTD;    2354
*                GEN REFS(GPR01P) SETS(RPHWORK)                    2355
*        (STM GPR02P,GPR08P,RPHWORK(GPR01P));                      2355
         STM GPR02P,GPR08P,RPHWORK(GPR01P)
*                GPR00P=0;                                         2356
         SLR   GPR00P,GPR00P                                       2356
*                GPR15P=ADDR(DYPPAB); /*HOLD PAB PTR*/             2357
         L     GPR15P,RCCVPAB(,CVAWKRDT)                           2357
         LA    GPR15P,DYPPAB(,GPR15P)                              2357
*                GPR04P=CVANCSPL; /*WORK ELE PTR*/                 2358
         L     GPR04P,CVANCSPL                                     2358
*                GPR05P=GPR15P; /*PASS PAB PTR*/                   2359
         LR    GPR05P,GPR15P                                       2359
*                CALL ATCLCPTR->ATCAP37->ISTAPC37;                 2360
         L     @07,ATCLCPTR                                        2360
         L     @15,ATCAP37(,@07)                                   2360
         BALR  @14,@15                                             2360
*                GEN(NOPR  0)NOSETS NOREFS;                        2361
         NOPR  0
*                RFY (GPR00P,GPR01P,GPR04P,GPR05P,GPR15P) UNRSTD;  2362
*                END; /**** END OF TPQUE GENERATION ****/          2363
*               RFY                                                2364
*                 CVAR0 RSTD;                                      2364
*                                                                  2364
*               /*****************************************************/
*               /*                                                   */
*               /* RELEASE THE VOC LOCK                              */
*               /*                                                   */
*               /*****************************************************/
*                                                                  2365
*               CVAR0=CVA40;                                       2365
         LA    CVAR0,40                                            2365
*               CALL CVASRLOC;                                     2366
         BAL   @14,CVASRLOC                                        2366
*               RFY                                                2367
*                 CVAR0 UNRSTD;                                    2367
*                                                                  2367
*               /*****************************************************/
*               /*                                                   */
*               /* WAIT FOR THE NEW CLUSTER NCSPL TO BE PROCESSED:   */
*               /*                                                   */
*               /*****************************************************/
*                                                                  2368
*                                                                  2368
*/*  TPWAIT   */                                                   2368
*                DO; /* BEGIN TPWAIT GENERATION*/                  2368
*                RFY (GPR01P,GPR14P,GPR15P) RSTD;                  2369
*                RFY (GPR00P) RSTD;                                2370
*                GEN (STM   GPR00P,GPR15P,RPHWORK(GPR01P))         2371
*                REFS(GPR00P,GPR01P,GPR15P) SETS(RPHWORK);         2371
         STM   GPR00P,GPR15P,RPHWORK(GPR01P)
*                RFY (GPR00P) UNRSTD;                              2372
*                GPR15P=ADDR(LHAA0134);                            2373
         LA    GPR15P,LHAA0134                                     2373
*                GPR14P=0;                                         2374
         SLR   GPR14P,GPR14P                                       2374
*                GPR15P=GPR15P & '00FFFFFF'X;                      2375
         N     GPR15P,@CF05583                                     2375
*                GPR15P=GPR15P × RPHWT1;                           2376
         O     GPR15P,@CF01355                                     2376
*                CS (GPR14P,GPR15P,GPR01P->RPHRESMA);              2377
         CS    GPR14P,@15,RPHRESMA(GPR01P)                         2377
*                BC (7,LHAB0134);                                  2378
*                                                                  2378
         BC    7,LHAB0134                                          2378
*/* TPEXIT  NONE */                                                2379
*                DO;                                               2379
*                  RESPECIFY GPR15P RSTD;                          2380
*                                                                  2380
*/* ATBUILD (ISTPAB,ISTDYPAB,ISTATCVT)  */                         2381
*/* END OF ATBUILD */                                              2381
*                                                                  2381
*                DO; /* LISATCVT CVTBASE(PAGEABLE,(GPR15P)) */     2381
*                  GPR15P = ATCLCPTR; /*SET UP ATCVT POINTER*/     2382
         L     GPR15P,ATCLCPTR                                     2382
*                END; /*LISATCVT*/                                 2383
*                  RESPECIFY GPR00F RSTD;                          2384
*                  GPR00F=0;     /*SET PARAMETER REGISTER TO 0*/   2385
         SLR   GPR00F,GPR00F                                       2385
*                  GPR15P=GPR15P->ATCAP31;                         2386
         L     GPR15P,ATCAP31(,GPR15P)                             2386
*                  DCL FMZL0139 BASED(GPR15P) LABEL VALUERANGE(*); 2387
*                  CALL FMZL0139;                                  2388
         BALR  @14,@15                                             2388
*                  RESPECIFY (GPR00F,GPR15P) UNRSTD;               2389
*                END; /***** END OF TPEXIT  *****/                 2390
*LHAB0134:;      GPR01P->RPHRESMA = 0;                             2391
LHAB0134 DS    0H                                                  2392
         SLR   @07,@07                                             2392
         ST    @07,RPHRESMA(,GPR01P)                               2392
*                RFY (GPR00P) RSTD;                                2393
*LHAA0134:;      GEN (LM    GPR00P,GPR15P,RPHWORK(GPR01P))         2394
LHAA0134 DS    0H                                                  2395
*                REFS(RPHWORK,GPR01P) SETS(GPR00P,GPR15P);         2395
         LM    GPR00P,GPR15P,RPHWORK(GPR01P)
*                RFY (GPR00P,GPR01P,GPR14P,GPR15P) UNRSTD;         2396
*                END; /*****END OF TPWAIT *****/                   2397
*               CVAR15=0;           /* SET A GOOD RETURN CODE        */
         SLR   CVAR15,CVAR15                                       2398
*             END;                                                 2399
*     END;                                                         2400
@RC02333 DS    0H                                                  2401
*   CVAR14=CVARSCL2;                /* RESTORE RETURN REGISTER       */
@RT02305 L     CVAR14,CVARSCL2                                     2401
*   RETURN CODE(CVAR15);            /* EXIT WITH RETURN CODE         */
@EL00014 DS    0H                                                  2402
@EF00014 DS    0H                                                  2402
@ER00014 BR    @14                                                 2402
*   RFY                                                            2403
*     (CVAR0,CVAR15) UNRSTD;                               /*@D32CKDQ*/
*   END CVACLU02;                   /* RETURN TO CALLER              */
@PB00014 DS    0H                                                  2405
*   GEN(  EJECT);                                                  2405
           EJECT
*CVACLU05:                                                         2406
*   PROC OPTIONS(NOSAVE NOSAVEAREA);                               2406
*                                                                  2406
         B     @PB00015                                            2406
CVACLU05 DS    0H                                                  2407
*   /*****************************************************************/
*   /*                                                               */
*   /* DEQUEUE CLUSTER NCSPL(S)                                      */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  2407
*   RFY                                                            2407
*     ISTRPH BASED(NCSPLRPH);                                      2407
*   CVARSCL5=CVAR14;                /* SAVE RETURN REGISTER          */
         ST    CVAR14,CVARSCL5                                     2408
*   CVASIDSV=NCSPLSID;              /* SAVE CONSOLE ID OF THIS NCSPL */
         MVC   CVASIDSV(1),NCSPLSID(NCSPLPTR)                      2409
*   CVAMIDSV=CVAMSID@;              /* SAVE THE MESSAGE ID ADDRESS   */
         L     @15,CVAMSID@                                        2410
         ST    @15,CVAMIDSV                                        2410
*   CVAMSGSV=CVAMSG;                /* SAVE THE MESSAGE VARIABLE ADDR*/
         L     @15,CVAMSG                                          2411
         ST    @15,CVAMSGSV                                        2411
*   CVAR1=NCSPLRPH;                 /* GET RPH ADDRESS               */
         L     @15,NCSPLRPH(,NCSPLPTR)                             2412
         LR    CVAR1,@15                                           2412
*   RPHWEA=NCSPLPTR;                /* MAKE SURE RPH WORK ELEMENT  2413
*                                      ADDRESS IS NON-ZERO           */
         ST    NCSPLPTR,RPHWEA(,@15)                               2413
*   DO WHILE RPHWEA^=0;             /* LOOP UNTIL NO NCSPLS ARE    2414
*                                      DEQUEUED                      */
         B     @DE02414                                            2414
@DL02414 DS    0H                                                  2415
*     RFY                                                          2415
*       ISTDYPAB BASED(NCSPLP1);                                   2415
*                                                                  2415
*     /***************************************************************/
*     /*                                                             */
*     /* DEQUEUE NCSPL FROM PAB POINTED BY NCSPLP1:                  */
*     /*                                                             */
*     /***************************************************************/
*                                                                  2416
*                                                                  2416
*/* TPDEQ (,DYPPAB)  */                                            2416
*      DO; /* BEGIN TPDEQ CODE GENERATION */                       2416
*      DCL FMZCA149 BIT(32) CONSTANT('80000000'X);                 2417
*      DCL FMZCB149 BIT(32) CONSTANT('7FFFFFFF'X);                 2418
*      RFY (GPR00P,GPR01P,GPR14P,GPR15P) RSTD;                     2419
*                                                                  2419
*      RFY ISTWKE  ;                                               2420
*      GPR15P=ADDR(DYPPAB); /*ADDRESS QUEUE POINTER */             2421
         L     GPR15P,NCSPLP1(,NCSPLPTR)                           2421
         LA    GPR15P,DYPPAB(,GPR15P)                              2421
*      GPR14P=GPR15P->PABWEQA×FMZCA149;                            2422
         L     @07,@CF01396                                        2422
         L     GPR14P,PABWEQA(,GPR15P)                             2422
         OR    GPR14P,@07                                          2422
*      IF GPR14P=FMZCA149 THEN;                                    2423
         CLR   GPR14P,@07                                          2423
         BE    @RT02423                                            2423
*      ELSE DO;                                                    2425
*FMZL1149:;                                                        2426
FMZL1149 DS    0H                                                  2427
*        DO WHILE(GPR14P->WKECHAIN^=FMZCA149);                     2427
         B     @DE02427                                            2427
@DL02427 DS    0H                                                  2428
*          GPR15P=ADDR(GPR14P->WKECHAIN);                          2428
         LA    GPR15P,WKECHAIN(,GPR14P)                            2428
*          GPR14P=GPR15P->PABWEQA;                                 2429
         L     GPR14P,PABWEQA(,GPR15P)                             2429
*        END;                                                      2430
@DE02427 L     @07,@CF01396                                        2430
         CL    @07,WKECHAIN(,GPR14P)                               2430
         BNE   @DL02427                                            2430
*        GPR00P=FMZCA149;                                          2431
         LR    GPR00P,@07                                          2431
*        CS(GPR14P,GPR00P,GPR15P->PABWEQA);                        2432
         CS    GPR14P,@00,PABWEQA(GPR15P)                          2432
*        BC(7,FMZL1149);                                           2433
         BC    7,FMZL1149                                          2433
*        GPR14P->WKECHAIN=0;                                       2434
         SLR   @07,@07                                             2434
         ST    @07,WKECHAIN(,GPR14P)                               2434
*      END;                                                        2435
*ISTA0149:;                                                        2436
@RT02423 DS    0H                                                  2436
ISTA0149 DS    0H                                                  2437
*      GPR14P=GPR14P&FMZCB149;                                     2437
         N     GPR14P,@CF01394                                     2437
*      GPR01P->RPHWEA=GPR14P;                                      2438
         ST    GPR14P,RPHWEA(,GPR01P)                              2438
*      RFY (GPR00P,GPR01P,GPR14P,GPR15P) UNRSTD;                   2439
*      END; /* END TPDEQ GENERATION */                             2440
*     IF RPHWEA=0                   /* NCSPL DEQUEUED?               */
*       THEN                                                       2441
         L     @15,NCSPLRPH(,NCSPLPTR)                             2441
         L     @15,RPHWEA(,@15)                                    2441
         LTR   @15,@15                                             2441
         BZ    @RT02441                                            2441
*       ;                           /* NO - STOP LOOKING             */
*     ELSE                                                         2443
*       DO;                         /* NCSPL WAS DEQUEUED -          */
*         CVAMSID@=ADDR(CVAMS614);  /* GET ADDRESS OF 'CLUSTER START
*                                      ABORTED' MSG ID               */
         LA    @15,CVAMS614                                        2444
         ST    @15,CVAMSID@                                        2444
*         CVAMSG=ADDR(RPHWEA->NCSPLRID);/* GET ADDR OF NODENAME FROM
*                                      DEQUEUED NCSPL                */
         L     @15,NCSPLRPH(,NCSPLPTR)                             2445
         L     @15,RPHWEA(,@15)                                    2445
         LA    @07,NCSPLRID(,@15)                                  2445
         ST    @07,CVAMSG                                          2445
*         NCSPLSID=RPHWEA->NCSPLSID;/* GET CONSOLE ID FROM DEQUEUED
*                                      NCSPL                         */
         MVC   NCSPLSID(9,NCSPLPTR),NCSPLSID(@15)                  2446
*         CALL CVATPMSG;            /* GO OUTPUT MESSAGE             */
         BAL   @14,CVATPMSG                                        2447
*         CVAR1=NCSPLRPH;           /*RESTORE RPH ADDR       @DL31HBN*/
         L     CVAR1,NCSPLRPH(,NCSPLPTR)                           2448
*         IF NCSPLLPT^=CVA0       /* IS APPL LOGON PTR ZERO  @OZ06608*/
*           THEN                                                   2449
         SLR   @15,@15                                             2449
         C     @15,NCSPLLPT(,NCSPLPTR)                             2449
         BE    @RF02449                                            2449
*             DO;                                          /*@OZ06608*/
*               RFY CVAR0 RSTD;                            /*@OZ06608*/
*               CVAR0=CVA0;                                /*@OZ06608*/
         LR    CVAR0,@15                                           2452
*               CALL CVASRLOC;   /* GET VOC LOCK             @OZ06608*/
         BAL   @14,CVASRLOC                                        2453
*               CVAWKSAV=CVAWKRDT; /* SAVE RDT ADDRESS       @OZ06608*/
         ST    CVAWKRDT,CVAWKSAV                                   2454
*               CVAWKRDT=NCSPLLPT; /* GET APPL LOGON PTR     @OZ06608*/
         L     CVAWKRDT,NCSPLLPT(,NCSPLPTR)                        2455
*               DO WHILE CVAWKRDT->RPRENTRY^=RPRENTAH; /* LOCATE APPL
*                                     HEADER ENTRY           @OZ06608*/
         B     @DE02456                                            2456
@DL02456 DS    0H                                                  2457
*                  CVAWKRDT=CVAWKRDT->RPRNSNEA;            /*@OZ06608*/
         L     CVAWKRDT,RPRNSNEA(,CVAWKRDT)                        2457
*               END;                 /* END-DO WHILE          OZ06608*/
@DE02456 CLI   RPRENTRY(CVAWKRDT),X'02'                            2458
         BNE   @DL02456                                            2458
*               IF CVAWKRDT->RDTLGCT^=CVA0 /* IF LOGON COUNT IS NOT 0*/
*                 THEN               /* THEN DECREMENT LOGON COUNT   */
         CLI   RDTLGCT(CVAWKRDT),0                                 2459
         BE    @RF02459                                            2459
*                    CVAWKRDT->RDTLGCT=CVAWKRDT->RDTLGCT-CVA1;     2460
         SLR   @15,@15                                             2460
         IC    @15,RDTLGCT(,CVAWKRDT)                              2460
         BCTR  @15,0                                               2460
         STC   @15,RDTLGCT(,CVAWKRDT)                              2460
*               CVAWKRDT=CVAWKSAV;   /* RESTORE RDT ADDRESS   OZ06608*/
@RF02459 L     CVAWKRDT,CVAWKSAV                                   2461
*               CVAR0=CVA10;                                /*OZ06608*/
         LA    CVAR0,10                                            2462
*               CALL CVASRLOC;       /* RELEASE VOC LOCK      OZ06608*/
         BAL   @14,CVASRLOC                                        2463
*               RFY CVAR0 UNRSTD;                           /*OZ06608*/
*             END;               /* END-APPL HDR NON-ZERO     OZ06608*/
*         IF RPHWEA->NCSVSTAT='1'B  /* DEQUEUED NCSPL STATIC?        */
*           THEN                                                   2466
@RF02449 L     @15,NCSPLRPH(,NCSPLPTR)                             2466
         L     @15,RPHWEA(,@15)                                    2466
         TM    NCSVSTAT(@15),B'00100000'                           2466
         BO    @RT02466                                            2466
*           ;                       /* YES - DO NOT FREE CORE        */
*         ELSE                                                     2468
*           DO;                     /* DEQUEUED NCSPL WAS NOT STATIC */
*             RFY ISTVYCRR BASED(NCSPLRPH->RPHCRR->CRACRR);/*@D32CKDQ*/
*            RFY ISTGTNCS BASED(ADDR(VYCRRCW3));           /*@D32CKDQ*/
*             RFY CVAR0 RSTD;                              /*@D32CKDQ*/
*             CVAR1=NCSPLRPH;       /*RPH                    @D32CKDQ*/
         L     @15,NCSPLRPH(,NCSPLPTR)                             2472
         LR    CVAR1,@15                                           2472
*             CVAR0=ADDR(VYCRRCW3); /*PARMLIST               @D32CKDQ*/
         L     @07,RPHCRR(,@15)                                    2473
         L     @07,CRACRR(,@07)                                    2473
         LA    CVAR0,VYCRRCW3(,@07)                                2473
*             GTNCSAD=RPHWEA;       /*NCSPL AND WKA TO FREE  @D32CKDQ*/
         L     @15,RPHWEA(,@15)                                    2474
         ST    @15,GTNCSAD+118(,@07)                               2474
*             CALL ISTINCW3;        /*FREE THEM              @D32CKDQ*/
         L     @07,NCSPLCVT(,NCSPLPTR)                             2475
         L     @15,ATCINCW3(,@07)                                  2475
         BALR  @14,@15                                             2475
*             RFY CVAR0 UNRSTD;                            /*@D32CKDQ*/
*             END;                                         /*@D32CKDQ*/
*       END;                                                       2478
@RT02466 DS    0H                                                  2479
*   END;                            /* END OF NCSPL DEQUEUE LOOP     */
@RT02441 DS    0H                                                  2479
@DE02414 L     @15,NCSPLRPH(,NCSPLPTR)                             2479
         L     @15,RPHWEA(,@15)                                    2479
         LTR   @15,@15                                             2479
         BNZ   @DL02414                                            2479
*   IF NCSPL2IN=CVAON               /* THIS IS FIRST TIME ?  @ZA08952*/
*     THEN                          /* YES-PROCESSING BY ISTATUS     */
         TM    NCSPL2IN(NCSPLPTR),B'10000000'                      2480
         BNO   @RF02480                                            2480
*      IF (NCSAIMOD=CVAOFF &        /* SO CHECKPOINT ON FAILURE      */
*          NCSACTV=CVAON)                                  /*@ZA08952*/
*        THEN CVACKPT=CVAON;        /* MARK TO CHECKPOINT    @ZA08952*/
         TM    NCSAIMOD(NCSPLPTR),B'10000000'                      2481
         BNZ   @RF02481                                            2481
         TM    NCSACTV(NCSPLPTR),B'10000000'                       2481
         BNO   @RF02481                                            2481
         OI    CVACKPT,B'00100000'                                 2482
*        ELSE CVACKPT=CVAOFF;       /* MARK NOT TO CHCKPOINT @ZA08952*/
         B     @RC02481                                            2483
@RF02481 NI    CVACKPT,B'11011111'                                 2483
*     ELSE                          /* NOT PROCESSING BY ISTATUS     */
*      CVACKPT=CVAOFF;              /* MARK NOT TO CHCKPOINT @ZA08952*/
         B     @RC02480                                            2484
@RF02480 NI    CVACKPT,B'11011111'                                 2484
*    IF CVACKPT=CVAON                                      /*@ZA08952*/
*      THEN                                                /*@ZA08952*/
*                                                                  2485
@RC02480 TM    CVACKPT,B'00100000'                                 2485
         BNO   @RF02485                                            2485
*/*CRIO  FUNC(UPDATE)RDT((CVAWKRDT))PROCNM(ISTINCVA)*/             2486
*         DO;                                                      2486
*         RFY (GPR01P,GPR15P) RSTD;                                2487
*         GPR15P = 0;                                              2488
         SLR   GPR15P,GPR15P                                       2488
*         IF CVAWKRDT->RPRCRCPT = '1'B                             2489
*         THEN DO;                                                 2489
         TM    RPRCRCPT(CVAWKRDT),B'01000000'                      2489
         BNO   @RF02489                                            2489
*         NCSCRDTE = CVAWKRDT;                                     2491
         ST    CVAWKRDT,NCSCRDTE(,NCSPLPTR)                        2491
*         NCSCRCMD = NCSCRWR;                                      2492
         MVI   NCSCRCMD(NCSPLPTR),X'00'                            2492
*         GPR01P = ADDR(ISTNCSPL);                                 2493
         LR    GPR01P,NCSPLPTR                                     2493
*         CALL ISTINCR5;                                           2494
*                                                                  2494
         L     @15,@CV05443                                        2494
         BALR  @14,@15                                             2494
*         DO;                                                      2495
*/***  CRRMAINT  RPHADD((NCSPLRPH))PROCNM(ISTINCVA)COMP(VY)FUNC(RET)  *
**/                                                                2496
*         /*** CLEAR AND SET CURRENT PROCEDURE BIT ***/            2496
*NCSPLRPH->RPHCRR->CRACRR->VYCCRT = '0'B;                          2496
         L     @07,NCSPLRPH(,NCSPLPTR)                             2496
         L     @07,RPHCRR(,@07)                                    2496
         L     @07,CRACRR(,@07)                                    2496
         XC    VYCCRT+1(11,@07),VYCCRT+1(@07)                      2496
         MVI   VYCCRT(@07),B'00000000'                             2496
*NCSPLRPH->RPHCRR->CRACRR->CINCVA = '1'B;                          2497
         OI    CINCVA(@07),B'00000010'                             2497
*         END;                                                     2498
*         RFY (GPR01P,GPR15P) UNRSTD;                              2499
*         END;                                                     2500
*         END;                                                     2501
@RF02489 DS    0H                                                  2502
*         /* END OF CRIO EXPANSION */                              2502
*   CVAR1=NCSPLRPH;                 /* RESTORE RPH PTR       @ZA08952*/
@RF02485 L     CVAR1,NCSPLRPH(,NCSPLPTR)                           2502
*   NCSPLSID=CVASIDSV;              /* RESTORE THIS NCSPL'S CONSOLE
*                                      ID                            */
         MVI   NCSPLSID+1(NCSPLPTR),C' '                           2503
         MVC   NCSPLSID+2(7,NCSPLPTR),NCSPLSID+1(NCSPLPTR)         2503
         MVC   NCSPLSID(1,NCSPLPTR),CVASIDSV                       2503
*   CVAMSID@=CVAMIDSV;              /* RESTORE THE MESSAGE ID ADDRESS*/
         L     @15,CVAMIDSV                                        2504
         ST    @15,CVAMSID@                                        2504
*   CVAMSG=CVAMSGSV;                /* RESTORE THE MESSAGE VARIABLE
*                                      ADDRESS                       */
*                                                                  2505
         L     @15,CVAMSGSV                                        2505
         ST    @15,CVAMSG                                          2505
*   /*****************************************************************/
*   /*                                                               */
*   /* RELEASE PABS POINTED TO BY NCSPLP1:                           */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  2506
*    /*FREESTOR AREA(NCSPLP1)SIZE(CVAPABS)TYPE(PAGEABLE)CLEAR(NO)SAVE(Y
*S)*/                                                              2506
*     DO;                                                          2506
*/* ATBUILD (ISTPAB,ISTDYPAB,ISTATCVT,ISTRPH)  */                  2507
*/* END OF ATBUILD */                                              2507
*    RFY (GPR00P,GPR01P,GPR02P,GPR03P) RSTD;                       2507
*    RFY ISTRPH BASED(GPR01P);                                     2508
*    GEN REFS(GPR02P,GPR03P,GPR04P,GPR05P,                         2509
*             GPR06P,GPR07P,GPR08P,GPR09P,                         2509
*             GPR10P,GPR11P,GPR12P,GPR13P)                         2509
*        SETS(RPHWORK);                                            2509
*                                                                  2509
         STM   GPR02P,GPR13P,RPHWORK(GPR01P)        SAVE REGISTERS
*    GPR00F = CVAPABS;                                 /*SIZE IN REG0*/
         L     GPR00F,CVAPABS                                      2510
*    DCL 1 CMZA0158 FIXED(31) STATIC LOCAL,                        2511
*          2 * FIXED(8) INIT(64),                    /* OPTION FLAGS */
*          2 * FIXED(8) INIT(96),                     /* STORAGE KEY */
*          2 * FIXED(8) INIT(231),                 /* SUBPOOL NUMBER */
*          2 * FIXED(8) INIT('01'X);                 /* REQUEST TYPE */
*    GPR03F = CMZA0158;                                            2512
         L     GPR03F,CMZA0158                                     2512
*    RFY (GPR04P) RSTD;                                            2513
*    GPR04P = NCSPLP1;                    /*PUT FREEMAIN ADDR IN REG4*/
*                                                                  2514
         L     GPR04P,NCSPLP1(,NCSPLPTR)                           2514
*    DO; /* LISATCVT CVTBASE(PAGEABLE,(GPR02P)) */                 2515
*      GPR02P = ATCLCPTR; /*SET UP ATCVT POINTER*/                 2516
         L     GPR02P,ATCLCPTR                                     2516
*    END; /*LISATCVT*/                                             2517
*    CALL GPR02P -> ATCGTSTR;                         /*CALL ISTORFSR*/
         L     @15,ATCGTSTR(,GPR02P)                               2518
         BALR  @14,@15                                             2518
*    RFY (GPR00P,GPR01P,GPR02P,GPR03P,GPR04P) UNRSTD;              2519
*    END ;                                          /*END OF FREESTOR*/
*   IF CVANEWSG^=CVAON & CVASGMNT^=CVAON /* PROCESSING RN ?  @ZA08952*/
*     THEN                                                 /*@ZA08952*/
         TM    CVANEWSG,B'01010000'                                2521
         BNZ   @RF02521                                            2521
*       DO;                         /* NO-NOT PROCESSING RN  @ZA08952*/
*   RPHPABOF=0;                     /* MAKE RPH LOOK AS THOUGH PABS
*                                      WERE DYNAMIC                  */
         MVI   RPHPABOF(GPR01P),X'00'                              2523
*   RPHMAJCB=0;                                                    2524
         SLR   @15,@15                                             2524
         STCM  @15,7,RPHMAJCB(GPR01P)                              2524
*   NCSPLNON='1'B;                  /* INDICATE THAT THE RDT SEGMENT
*                                      CAN NO LONGER BE REFERENCED   */
         OI    NCSPLNON(NCSPLPTR),B'00001000'                      2525
*       END;                        /* END-NOT PROCESSING RN @ZA08952*/
*   CVAR14=CVARSCL5;                /* RESTORE RETURN REGISTER       */
@RF02521 L     CVAR14,CVARSCL5                                     2527
*   END CVACLU05;                   /* RETURN TO CALLER              */
@EL00015 DS    0H                                                  2528
@EF00015 DS    0H                                                  2528
@ER00015 BR    @14                                                 2528
@PB00015 DS    0H                                                  2529
*   GEN(  EJECT);                                                  2529
           EJECT
*CVASRLU:                                                          2530
*   PROC OPTIONS(NOSAVE NOSAVEAREA);                               2530
*                                                                  2530
         B     @PB00016                                            2530
CVASRLU  DS    0H                                                  2531
*   /*****************************************************************/
*   /*                                                               */
*   /* LOGICAL UNIT (LU) PROCESSING SUBROUTINE                       */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  2531
*   RFY                                                            2531
*     ISTRPRE BASED(CVAWKRDT);                                     2531
*   RFY                                                            2532
*     ISTRCC BASED(CVAWKRDT);                                      2532
*RFY CVAR15 RSTD;                                          /*@D32CKDQ*/
*CVARSLU=CVAR14;                    /*SAVE RETURN REG        @D32CKDQ*/
         ST    CVAR14,CVARSLU                                      2534
*CALL CVASR100;                     /*VALIDITY CHECK         @D32CKDQ*/
         BAL   @14,CVASR100                                        2535
*IF CVAR15^=0                        /*NOT OK?               @D32CKDQ*/
*  THEN                             /*EXIT                   @X50BHC8*/
         LTR   CVAR15,CVAR15                                       2536
         BZ    @RF02536                                            2536
*     DO;                                                  /*@X50BHC8*/
*       NCSACTV=CVAON;   /* REFLECTS A CHANGE IN STATUS      @X50BHC8*/
         OI    NCSACTV(NCSPLPTR),B'10000000'                       2538
*       NCSAIMOD=CVAOFF;  /* REFLECTS NOT ACTIVE             @X50BHC8*/
         NI    NCSAIMOD(NCSPLPTR),B'01111111'                      2539
*     END;                                                 /*@X50BHC8*/
*  ELSE                                                            2541
*     IF NCSPLRPT^=CVAWKRDT      /* NOT COMMAND ENTRY?       @X50BHC8*/
*        THEN;                                             /*@X50BHC8*/
         B     @RC02536                                            2541
@RF02536 C     CVAWKRDT,NCSPLRPT(,NCSPLPTR)                        2541
         BNE   @RT02541                                            2541
*  ELSE                             /*PROCESS                @D32CKDQ*/
*  DO;                                                     /*@D32CKDQ*/
*    IF RPRHDTYP^=RPRENTRN          /*LU NOT IN RN?          @D32CKDQ*/
*      THEN                                                        2544
         CLI   RPRHDTYP(CVAWKRDT),X'01'                            2544
         BE    @RF02544                                            2544
*      DO;                          /*LU IN LOCAL OR SWITCHED SUB*/
*        NCSPLRAD=CVAWKRDT;         /*LU RDTE                @D32CKDQ*/
         ST    CVAWKRDT,NCSPLRAD(,NCSPLPTR)                        2546
*        CVAR1=NCSPLPTR;            /*REG1 INPUT TO CV5      @D32CKDQ*/
         LR    CVAR1,NCSPLPTR                                      2547
*        CALL ISTINCV5;             /*PROCESS LU             @D32CKDQ*/
*                                                                  2548
         L     @15,@CV05653                                        2548
         BALR  @14,@15                                             2548
*         DO;                                                      2549
*/***  CRRMAINT  PROCNM(ISTINCVA)COMP(VY)FUNC(RET)RPHADD((NCSPLRPH))  *
**/                                                                2550
*         /*** CLEAR AND SET CURRENT PROCEDURE BIT ***/            2550
*NCSPLRPH->RPHCRR->CRACRR->VYCCRT = '0'B;                          2550
         L     @07,NCSPLRPH(,NCSPLPTR)                             2550
         L     @07,RPHCRR(,@07)                                    2550
         L     @07,CRACRR(,@07)                                    2550
         XC    VYCCRT+1(11,@07),VYCCRT+1(@07)                      2550
         MVI   VYCCRT(@07),B'00000000'                             2550
*NCSPLRPH->RPHCRR->CRACRR->CINCVA = '1'B;                          2551
         OI    CINCVA(@07),B'00000010'                             2551
*         END;           /*@D32CKDQ*/                              2552
*        IF CVAR15=CVA0             /*ACTIVATED              @D32CKDQ*/
*          THEN                                                    2553
         LTR   CVAR15,CVAR15                                       2553
         BNZ   @RF02553                                            2553
*          DO;                      /*YES - LOGON            @D32CKDQ*/
*            CALL CVASR041;         /*LOGON                  @D32CKDQ*/
         BAL   @14,CVASR041                                        2555
*            CVAR15=CVA0;           /*INSURE STILL ZERO      @D32CKDQ*/
         SLR   CVAR15,CVAR15                                       2556
*            END;                                          /*@D32CKDQ*/
*          ELSE                                                    2558
*          IF CVAR15=CVA4           /*YOU PROCESS?           @D32CKDQ*/
*            THEN;                  /*PROCESS AS IF IN RN    @D32CKDQ*/
         B     @RC02553                                            2558
@RF02553 C     CVAR15,@CF00088                                     2558
         BE    @RT02558                                            2558
*            ELSE                                                  2560
*            IF CVAR15=CVA8         /*HIGHER NODE INACTIVE?  @D32CKDQ*/
*              THEN                                                2560
         C     CVAR15,@CF00094                                     2560
         BNE   @RF02560                                            2560
*              DO;                  /*YES                    @D32CKDQ*/
*                CVAMSID@=ADDR(CVAMS608);/*VARY FAILED -HIGHER NODE
*                                          INACTIVE          @D32CKDQ*/
         LA    @07,CVAMS608                                        2562
         ST    @07,CVAMSID@                                        2562
*                CVANAME1=RPRNAME;     /*LU NODENAME         @D32CKDQ*/
         MVC   CVANAME1(8),RPRNAME(CVAWKRDT)                       2563
*                CVANAME2=RPRNSNEA->RPRNAME;/*PU NODENAME    @D32CKDQ*/
         L     @07,RPRNSNEA(,CVAWKRDT)                             2564
         MVC   CVANAME2(8),RPRNAME(@07)                            2564
*                CVAMSG=ADDR(CVANAME1); /*MSG VARIABLE       @D32CKDQ*/
         LA    @07,CVANAME1                                        2565
         ST    @07,CVAMSG                                          2565
*                CVAERRSW=CVAON;    /*ERROR                  @D32CKDQ*/
         OI    CVAERRSW,B'00000100'                                2566
*                END;                                      /*@D32CKDQ*/
*              ELSE                                                2568
*              IF CVAR15=CVA12      /*VP IN HIGHER NODE      @D32CKDQ*/
*                THEN                                              2568
         B     @RC02560                                            2568
@RF02560 C     CVAR15,@CF00034                                     2568
         BNE   @RF02568                                            2568
*                DO;                                       /*@D32CKDQ*/
*                  CVAMSID@=ADDR(CVAMS615);/*VARY FAILED     @D32CKDQ
*                                   HIGHER NODE INACTIVE     @D32CKDQ*/
         LA    @07,CVAMS615                                        2570
         ST    @07,CVAMSID@                                        2570
*                  CVANAME1=RPRNAME; /*LU NAME               @D32CKDQ*/
         MVC   CVANAME1(8),RPRNAME(CVAWKRDT)                       2571
*                  CVAMSG=ADDR(CVANAME1); /*MSG VAR          @D32CKDQ*/
         LA    @07,CVANAME1                                        2572
         ST    @07,CVAMSG                                          2572
*                  CVAERRSW=CVAON;                         /*@D32CKDQ*/
         OI    CVAERRSW,B'00000100'                                2573
*                  END;                                    /*@D32CKDQ*/
*               ELSE;                                      /*@D32CKDQ*/
@RF02568 DS    0H                                                  2576
*        END;                       /*END LU IN LOCAL OR SW  @D32CKDQ
*                                      SUBAREA               @D32CKDQ*/
*      ELSE;                                               /*@D32CKDQ*/
@RF02544 DS    0H                                                  2578
*    IF RPRHDTYP=RPRENTRN           /*LU IN RN OR TO BE      @D32CKDQ*/
*      × CVAR15=CVA4                /*TREATED AS IF IN RN    @D32CKDQ*/
*      THEN                                                        2578
@RC02544 CLI   RPRHDTYP(CVAWKRDT),X'01'                            2578
         BE    @RT02578                                            2578
         C     CVAR15,@CF00088                                     2578
         BNE   @RF02578                                            2578
@RT02578 DS    0H                                                  2579
*      DO;                          /*PROCESS LU IN RN       @D32CKDQ*/
*     IF NCSPLEBN='1'B              /* NCSPL ON THE CLUSTER'S PABSET?*/
*       THEN                                                       2580
         TM    NCSPLEBN(NCSPLPTR),B'00100000'                      2580
         BNO   @RF02580                                            2580
*         DO;                       /* YES -                         */
*           CALL CVASR080;          /* GO PROCESS LOGICAL UNIT       */
         BAL   @14,CVASR080                                        2582
*           IF CVAGOSW='1'B&CVANOCLF='0'B /* GO SWITCH ON AND NO LOGON
*                                      SWITCH OFF?                   */
*             THEN                                                 2583
         TM    CVAGOSW,B'10000000'                                 2583
         BNO   @RF02583                                            2583
         TM    CVANOCLF,B'00000010'                                2583
         BNZ   @RF02583                                            2583
*             CALL CVASR041;        /* YES - PROCESS FOR SIMLOGONS   */
         BAL   @14,CVASR041                                        2584
*           ELSE                                                   2585
*             ;                                                    2585
@RF02583 DS    0H                                                  2586
*         END;                                                     2586
*     ELSE                          /* NCSPL NOT ON THE PABSET -     */
*       DO;                         /* YES -                         */
         B     @RC02580                                            2587
@RF02580 DS    0H                                                  2588
*         CVAWKSAV=CVAWKRDT;        /* SAVE LU ENTRY ADDRESS         */
         ST    CVAWKRDT,CVAWKSAV                                   2588
*         CVAWKRDT=RPRNSNEA;        /* GET CLUSTER CONTROLLER ADDRESS*/
         L     CVAWKRDT,RPRNSNEA(,CVAWKRDT)                        2589
*         RFY                                                      2590
*           CVAR0 RSTD;                                            2590
*                                                                  2590
*         /***********************************************************/
*         /*                                                         */
*         /* OBTAIN THE VOC LOCK:                                    */
*         /*                                                         */
*         /***********************************************************/
*                                                                  2591
*         CVAR0=CVA0;                                              2591
         SLR   CVAR0,CVAR0                                         2591
*         CALL CVASRLOC;                                           2592
         BAL   @14,CVASRLOC                                        2592
*         IF RCCVPAB=0              /* PABS EXIST FOR CLUSTER?       */
*           THEN                                                   2593
         L     @07,RCCVPAB(,CVAWKRDT)                              2593
         LTR   @07,@07                                             2593
         BNZ   @RF02593                                            2593
*           DO;                     /* NO -                          */
*             CVAMSID@=ADDR(CVAMS608);/* GET ADDR OF 'HIGHER NODE  2595
*                                      INACTIVE' MESSAGE             */
         LA    @07,CVAMS608                                        2595
         ST    @07,CVAMSID@                                        2595
*             CVANAME1=NCSPLRID;    /* GET NODENAME OF COMMAND RDTE  */
         MVC   CVANAME1(8),NCSPLRID(NCSPLPTR)                      2596
*             CVANAME2=CVAWKRDT->RPRNAME;/* GET CLUSTER NODE NAME    */
         MVC   CVANAME2(8),RPRNAME(CVAWKRDT)                       2597
*             CVAMSG=ADDR(CVANAME1);/* GET ADDR OF VARIABLE          */
         LA    @07,CVANAME1                                        2598
         ST    @07,CVAMSG                                          2598
*             CVAERRSW='1'B;        /* TURN ON ERROR SWITCH          */
*                                                                  2599
         OI    CVAERRSW,B'00000100'                                2599
*             /*******************************************************/
*             /*                                                     */
*             /* RELEASE THE VOC LOCK:                               */
*             /*                                                     */
*             /*******************************************************/
*                                                                  2600
*             CVAR0=CVA10;                                         2600
         LA    CVAR0,10                                            2600
*             CALL CVASRLOC;                                       2601
         BAL   @14,CVASRLOC                                        2601
*           END;                                                   2602
*         ELSE                      /* PABS EXIST FOR CLUSTER        */
*           IF RCCCUDIE='1'B        /* CLUSTER BEING DEACTIVATED?    */
*             × RPRVRYPD=CVAON      /*OR IS VARY PENDING     @D32CKDQ*/
*             THEN                                                 2603
         B     @RC02593                                            2603
@RF02593 TM    RCCCUDIE(CVAWKRDT),B'01000000'                      2603
         BO    @RT02603                                            2603
         TM    RPRVRYPD(CVAWKRDT),B'00000010'                      2603
         BNO   @RF02603                                            2603
@RT02603 DS    0H                                                  2604
*             DO;                   /* YES -                         */
*               CVAMSID@=ADDR(CVAMS615);/* GET ADDR OF 'DEACTIVATE IN
*                                      PROGRESS' MESSAGE             */
         LA    @07,CVAMS615                                        2605
         ST    @07,CVAMSID@                                        2605
*               CVAMSG=ADDR(CVAWKSAV->RPRNAME);/* GET ADDR OF LU'S 2606
*                                      NODENAME                      */
         L     @07,CVAWKSAV                                        2606
         ST    @07,CVAMSG                                          2606
*               CVAERRSW='1'B;      /* SET ERROR SWITCH ON           */
*                                                                  2607
         OI    CVAERRSW,B'00000100'                                2607
*               /*****************************************************/
*               /*                                                   */
*               /* RELEASE THE VOC LOCK:                             */
*               /*                                                   */
*               /*****************************************************/
*                                                                  2608
*               CVAR0=CVA10;                                       2608
         LA    CVAR0,10                                            2608
*               CALL CVASRLOC;                                     2609
         BAL   @14,CVASRLOC                                        2609
*               RFY                                                2610
*                 CVAR0 UNRSTD;                                    2610
*             END;                                                 2611
*           ELSE                                                   2612
*             DO;                   /* DEACT NOT IN PROGRESS -       */
*                                                                  2612
         B     @RC02603                                            2612
@RF02603 DS    0H                                                  2613
*               /*****************************************************/
*               /*                                                   */
*               /* CONVERT THE NCSPL FOR AN LU ACTIVATE              */
*               /*                                                   */
*               /*****************************************************/
*                                                                  2613
*                       NCSPL2IN='1'B;/* INDICATE SECOND ENTRY TO VA */
*                       NCSPLEBN='1'B;/* INDICATE ENTRY FROM BOUNDRY
*                                      NODE -- NCSPL IS ON THE PROPER
*                                      PABSET                        */
         OI    NCSPL2IN(NCSPLPTR),B'10100000'                      2614
*                       CVAWKA=NCSPLWKA+CVA8;/* RESET NCSPL WORK AREA
*                                      TO 'ALL AVAILABLE'            */
         L     @07,NCSPLWKA(,NCSPLPTR)                             2615
         LA    @00,8                                               2615
         ALR   @00,@07                                             2615
         ST    @00,CVAWKA(,@07)                                    2615
*                       CVAR1=NCSPLRPH;/* GET AN RPH ADDRESS         */
         L     CVAR1,NCSPLRPH(,NCSPLPTR)                           2616
*                       RFY                                        2617
*                         ISTDYPAB BASED(RCCVPAB);                 2617
*                                                                  2617
*                       /*********************************************/
*                       /*                                           */
*                       /* QUEUE THE MODIFIED LU NCSPL TO CLUSTER'S  */
*                       /* VARY PAB                                  */
*                       /*                                           */
*                       /*********************************************/
*                                                                  2618
*                                                                  2618
*/*  TPQUE (NCSPLPTR,DYPPAB) NORM */                               2618
*                                                                  2618
*                        DO;                                       2618
*                        RFY (GPR00P,GPR01P,GPR04P,GPR05P,GPR15P) RSTD;
*                        GEN REFS(GPR01P) SETS(RPHWORK)            2620
*        (STM GPR02P,GPR08P,RPHWORK(GPR01P));                      2620
         STM GPR02P,GPR08P,RPHWORK(GPR01P)
*                        GPR00P=0;                                 2621
         SLR   GPR00P,GPR00P                                       2621
*                        GPR15P=ADDR(DYPPAB); /*HOLD PAB PTR*/     2622
         L     GPR15P,RCCVPAB(,CVAWKRDT)                           2622
         LA    GPR15P,DYPPAB(,GPR15P)                              2622
*                        GPR04P=NCSPLPTR; /*WORK ELE PTR*/         2623
         LR    GPR04P,NCSPLPTR                                     2623
*                        GPR05P=GPR15P; /*PASS PAB PTR*/           2624
         LR    GPR05P,GPR15P                                       2624
*                        CALL ATCLCPTR->ATCAP37->ISTAPC37;         2625
         L     @07,ATCLCPTR                                        2625
         L     @15,ATCAP37(,@07)                                   2625
         BALR  @14,@15                                             2625
*                        GEN(NOPR  0)NOSETS NOREFS;                2626
         NOPR  0
*                        RFY (GPR00P,GPR01P,GPR04P,GPR05P,GPR15P) UNRST
*;                       END; /**** END OF TPQUE GENERATION ****/  2627
*                       RFY                                        2629
*                         CVAR0 RSTD;                              2629
*                                                                  2629
*                       /*********************************************/
*                       /*                                           */
*                       /* RELEASE THE VOC LOCK:                     */
*                       /*                                           */
*                       /*********************************************/
*                                                                  2630
*                       CVAR0=CVA10;                               2630
         LA    CVAR0,10                                            2630
*                       CALL CVASRLOC;                             2631
         BAL   @14,CVASRLOC                                        2631
*                       RFY                                        2632
*                         CVAR0 UNRSTD;                            2632
*                                                                  2632
*                       /*********************************************/
*                       /*                                           */
*                       /* EXIT FROM VARY ACTIVATE TO ALLOW THE      */
*                       /* QUEUED NCSPL TO BE PROCESSED              */
*                       /*                                           */
*                       /*********************************************/
*                                                                  2633
*                                                                  2633
*/* TPEXIT  NORM */                                                2633
*                        DO;                                       2633
*                          RESPECIFY GPR15P RSTD;                  2634
*                                                                  2634
*/* ATBUILD (ISTPAB,ISTDYPAB,ISTATCVT)  */                         2635
*/* END OF ATBUILD */                                              2635
*                        DO; /* LISATCVT CVTBASE(PAGEABLE,(GPR15P)) */
*                          GPR15P = ATCLCPTR; /*SET UP ATCVT POINTER*/
         L     GPR15P,ATCLCPTR                                     2636
*                        END; /*LISATCVT*/                         2637
*                          RESPECIFY GPR00F RSTD;                  2638
*                          GPR00F=4;    /* SET PARAMETER REGISTER TO 4
*/                         GPR15P=GPR15P->ATCAP31;                 2639
         LA    GPR00F,4                                            2639
         L     GPR15P,ATCAP31(,GPR15P)                             2640
*                          DCL FMZL0184 BASED(GPR15P) LABEL VALUERANGE(
*);                        CALL FMZL0184;                          2641
         BALR  @14,@15                                             2642
*                          RESPECIFY (GPR00F,GPR15P) UNRSTD;       2643
*                        END; /***** END OF TPEXIT  *****/         2644
*             END;                                                 2645
*         CVAWKRDT=CVAWKSAV;        /* RESTORE LU RDT ENTRY ADDR     */
@RC02603 DS    0H                                                  2646
@RC02593 L     CVAWKRDT,CVAWKSAV                                   2646
*       END;                                                       2647
*       END;                        /*LU IN RN               @D32CKDQ*/
*     ELSE;                                                /*@D32CKDQ*/
@RF02578 DS    0H                                                  2650
*   END;                                                   /*@D32CKDQ*/
@RC02578 DS    0H                                                  2651
*   CVAR14=CVARSLU;                 /* RESTORE RETURN REGISTER       */
@RT02541 DS    0H                                                  2651
@RC02536 L     CVAR14,CVARSLU                                      2651
*   END CVASRLU;                    /* RETURN TO CALLER              */
@EL00016 DS    0H                                                  2652
@EF00016 DS    0H                                                  2652
@ER00016 BR    @14                                                 2652
@PB00016 DS    0H                                                  2653
*   GEN(  EJECT);                                                  2653
           EJECT
*CVASRCIO:                                                         2654
*   PROC OPTIONS(NOSAVE NOSAVEAREA);                               2654
*                                                                  2654
         B     @PB00017                                            2654
CVASRCIO DS    0H                                                  2655
*   /*****************************************************************/
*   /*                                                               */
*   /* I/O INTERFACE SUBROUTINE                                      */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  2655
*   RFY                                                            2655
*     ISTRPRE BASED(CVAWKRDT);                                     2655
*   CVARSCIO=CVAR14;                /* SAVE RETURN REGISTER          */
         ST    CVAR14,CVARSCIO                                     2656
*   CVAWKSAV=CVAWKRDT;              /* SAVE RDTE POINTER             */
         ST    CVAWKRDT,CVAWKSAV                                   2657
*   CVALOOP3=CVAON;                 /* SET LOOP CONTROL SWITCH ON    */
         OI    CVALOOP3,B'00010000'                                2658
*   DO WHILE CVALOOP3=CVAON;        /* LOOK FOR RN, LC, SNA CLUSTER,
*                                      OR LU ENTRY                   */
         B     @DE02659                                            2659
@DL02659 DS    0H                                                  2660
*     IF RPRENTRY=RPRENTRN×RPRENTRY=RPRENTLC                       2660
*                          /* WAS AN ENTRY FOUND?            @D32CKDQ*/
*       THEN                                                       2660
         CLI   RPRENTRY(CVAWKRDT),X'01'                            2660
         BE    @RT02660                                            2660
         CLI   RPRENTRY(CVAWKRDT),X'45'                            2660
         BNE   @RF02660                                            2660
@RT02660 DS    0H                                                  2661
*       CVALOOP3=CVAOFF;            /* YES - STOP LOOKING            */
         NI    CVALOOP3,B'11101111'                                2661
*     ELSE                                                         2662
*       CVAWKRDT=RPRNSNEA;          /* NO - GET NEXT HIGHER NODE     */
         B     @RC02660                                            2662
@RF02660 L     CVAWKRDT,RPRNSNEA(,CVAWKRDT)                        2662
*   END;                            /* END OF LOOP 3                 */
@RC02660 DS    0H                                                  2663
@DE02659 TM    CVALOOP3,B'00010000'                                2663
         BO    @DL02659                                            2663
*   NCSIOCID=CVA0×RPRDAF;           /* PUT 0 SAF AND RDTE'S DAF IN 2664
*                                      NCSPL                         */
         LH    @07,RPRDAF(,CVAWKRDT)                               2664
         N     @07,@CF05770                                        2664
         ST    @07,NCSIOCID(,NCSPLPTR)                             2664
*   RFY                                                            2665
*    (CVAR0,                                                       2665
*     CVAR2)RSTD;                                                  2665
*   CVAR2=NCSIOCID;                 /* PUT CID IN REG2 FOR CIDCTL    */
         LR    CVAR2,@07                                           2666
*   CVAWKRDT=CVAWKSAV;              /* RESTORE RDTE POINTER          */
         L     CVAWKRDT,CVAWKSAV                                   2667
*   CVAR1=NCSPLRPH;                 /* SUPPLY AN RPH ADDRESS TO CID
*                                      FIND                          */
*                                                                  2668
         L     CVAR1,NCSPLRPH(,NCSPLPTR)                           2668
*   /*****************************************************************/
*   /*                                                               */
*   /* GET THE NCB ADDRESS:                                          */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  2669
*                                                                  2669
*    DO; /* CIDCTL(FIND)  */                                       2669
*                                                                  2669
*    RFY (EMCR2,EMCR3) RSTD;                                       2670
*      GEN SETS(RPHWORK)                                           2671
*        (STM EMCR0,EMCR15,RPHWORK(RPHPTR) SAVE REGS IN RPH);      2671
         STM EMCR0,EMCR15,RPHWORK(RPHPTR) SAVE REGS IN RPH
*      EMCR3 = '00'X; /*CLEAR EXTRA BITS*/                         2672
         SLR   EMCR3,EMCR3                                         2672
*      EMCR3 = '01'X; /*INDICATE SHARED LOCK*/                     2673
         LA    EMCR3,1                                             2673
*      CALL ATCLCPTR->ATCCDFND->ISTSDCCF; /*PROCESS REQUEST*/      2674
*                                                                  2674
         L     @07,ATCLCPTR                                        2674
         L     @15,ATCCDFND(,@07)                                  2674
         BALR  @14,@15                                             2674
*    RFY (EMCR2,EMCR3) UNRSTD;                                     2675
*    END; /*CIDCTL*/                                               2676
*   CVAR2=CVAR0;                    /* NCB ADDRESS IN REG 2          */
         LR    CVAR2,CVAR0                                         2677
*   CVAR1=NCSPLPTR;                 /* NCSPL ADDRESS IN REG1         */
         LR    CVAR1,NCSPLPTR                                      2678
*   CALL ISTINCIO;                  /* CALL I/O ROUTINE              */
*                                                                  2679
         L     @15,@CV05660                                        2679
         BALR  @14,@15                                             2679
*    DO;                                                           2680
*/***  CRRMAINT  PROCNM(ISTINCVA)COMP(VY)FUNC(RET)RPHADD((NCSPLRPH))  *
**/                                                                2681
*    /*** CLEAR AND SET CURRENT PROCEDURE BIT ***/                 2681
*NCSPLRPH->RPHCRR->CRACRR->VYCCRT = '0'B;                          2681
         L     @07,NCSPLRPH(,NCSPLPTR)                             2681
         L     @07,RPHCRR(,@07)                                    2681
         L     @07,CRACRR(,@07)                                    2681
         XC    VYCCRT+1(11,@07),VYCCRT+1(@07)                      2681
         MVI   VYCCRT(@07),B'00000000'                             2681
*NCSPLRPH->RPHCRR->CRACRR->CINCVA = '1'B;                          2682
         OI    CINCVA(@07),B'00000010'                             2682
*    END;                                                          2683
*   RFY                                                            2684
*    (CVAR0,                                                       2684
*     CVAR2)UNRSTD;                                                2684
*   IF NCSPLCMD=NCSCSSV             /*CMD SET CONTROL VECTOR @D31LKDQ*/
*     THEN;                         /*ANY RESPONSE OK        @D31LKDQ*/
         CLC   NCSPLCMD(2,NCSPLPTR),@CB01826                       2685
         BE    @RT02685                                            2685
*     ELSE                                                         2687
*   IF NCSIORC=NCSIOPRG             /* I/O PURGED?                   */
*     THEN                                                         2687
         CLI   NCSIORC(NCSPLPTR),X'08'                             2687
         BNE   @RF02687                                            2687
*     CVAQUIT=CVAON;                /* YES-SET QUIT SWITCH ON        */
         OI    CVAQUIT,B'00001000'                                 2688
*   ELSE                                                           2689
*     RPRVIODN=CVAOFF;              /* I/O WAS NOT PURGED - MAKE SURE
*                                      THE VARY I/0 DONE BIT IS OFF  */
         B     @RC02687                                            2689
@RF02687 NI    RPRVIODN(CVAWKRDT),B'11101111'                      2689
*   CVAR14=CVARSCIO;                /* RESTORE RETURN REGISTER       */
@RC02687 DS    0H                                                  2690
@RT02685 L     CVAR14,CVARSCIO                                     2690
*   END CVASRCIO;                   /* RETURN TO CALLER              */
@EL00017 DS    0H                                                  2691
@EF00017 DS    0H                                                  2691
@ER00017 BR    @14                                                 2691
@PB00017 DS    0H                                                  2692
*   GEN(  EJECT);                                                  2692
           EJECT
*CVASRSCV:                                                         2693
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                       /*@D31LKDQ*/
         B     @PB00018                                            2693
CVASRSCV DS    0H                                                  2694
*   /*****************************************************************/
*   /*                                                       @D31LKDQ*/
*   /* SETS UP SET CONTROL VECTOR RU AND CALLS SUBROUTINE    @D31LKDQ*/
*   /*  CVASRCIO                                             @D31LKDQ*/
*   /*                                                       @D31LKDQ*/
*   /*****************************************************************/
*   RFY ISTRPRE BASED(CVAWKRDT);                                   2694
*   CVARSSCV=CVAR14;            /*SAVE RETURN REG            @D31LKDQ*/
         ST    CVAR14,CVARSSCV                                     2695
*   NCSPLCMD=NCSCSSV;           /*SET CONTROL VECTOR         @D31LKDQ*/
         MVC   NCSPLCMD(2,NCSPLPTR),@CB01826                       2696
*   NCSPLOLN=CVA8;              /*LENGTH OF RU               @D31LKDQ*/
         MVC   NCSPLOLN(2,NCSPLPTR),@CH00094                       2697
*   NCSPLRUI=CVA0;              /*NO FEEDBACK                @D31LKDQ*/
         SLR   @07,@07                                             2698
         ST    @07,NCSPLRUI(,NCSPLPTR)                             2698
*   NSRUID=NSRUNS;              /*NETWORK SERVICES RU        @D31LKDQ*/
         L     @07,NCSPLRUO(,NCSPLPTR)                             2699
         MVI   NSRUID(@07),X'01'                                   2699
*   NSRUSUB=NSRUPCS;            /*SPECIAL SERV               @D31LKDQ*/
         MVI   NSRUSUB(@07),X'02'                                  2700
*   NSRURCD=NSRUSSV;            /*SET STATE VECTOR           @D31LKDQ*/
         MVI   NSRURCD(@07),X'11'                                  2701
*   NSSSVDAF=RPRDAF;            /*DAF OF 370X                @D31LKDQ*/
         MVC   NSSSVDAF(2,@07),RPRDAF(CVAWKRDT)                    2702
*   NSSSVT=NSDELAY;             /*KEY FOR SSV                @D31LKDQ*/
         MVI   NSSSVT(@07),X'05'                                   2703
*   CALL CVASRCIO;              /*PERFORM IL                 @D31LKDQ*/
         BAL   @14,CVASRCIO                                        2704
*   CVAR14=CVARSSCV;            /*RESTORE R 14               @D31LKDQ*/
         L     CVAR14,CVARSSCV                                     2705
*   END CVASRSCV;                                                  2706
@EL00018 DS    0H                                                  2706
@EF00018 DS    0H                                                  2706
@ER00018 BR    @14                                                 2706
@PB00018 DS    0H                                                  2707
*   GEN(  EJECT);                                                  2707
           EJECT
*CVASR100:                                                         2708
*   PROC OPTIONS(NOSAVE NOSAVEAREA);                               2708
*                                                                  2708
         B     @PB00019                                            2708
CVASR100 DS    0H                                                  2709
*   /*****************************************************************/
*   /*                                                               */
*   /* SUBENTRY SYNTAX CHECK SUBROUTINE                              */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  2709
*   RFY                                                            2709
*     ISTRPRE BASED(CVAWKRDT);                                     2709
*   RFY                                                            2710
*     CVAR15 RSTD;                                                 2710
*   CVARS100=CVAR14;                /* SAVE RETURN REGISTER          */
         ST    CVAR14,CVARS100                                     2711
*   IF RPRINV=CVAON                 /* RDTE FLAGGED INVALID?         */
*     THEN                                                         2712
         TM    RPRINV(CVAWKRDT),B'01000000'                        2712
         BNO   @RF02712                                            2712
*     DO;                           /* YES - OUTPUT MESSAGE          */
*       CVAMSID@=ADDR(CVAMS613);    /* GET ADDR OF 'INVALID        2714
*                                      DEFINITION' MESSAGE           */
         LA    @07,CVAMS613                                        2714
         ST    @07,CVAMSID@                                        2714
*       CVAMSG=ADDR(CVANAME1);      /* GET ADDRESS OF VARIABLE       */
         LA    @07,CVANAME1                                        2715
         ST    @07,CVAMSG                                          2715
*       IF RPRENTRY=RPRENTLC        /* THIS ENTRY A LOCAL CONTROLLER?*/
*         THEN                                                     2716
         CLI   RPRENTRY(CVAWKRDT),X'45'                            2716
         BNE   @RF02716                                            2716
*           DO;                     /* YES - GET TERMINAL ENTRY NAME
*                                      AND OUTPUT THE MESSAGE        */
*             CVANAME1=(EVAL(CVAWKRDT+RPRELEN))->RPRNAME;          2718
         LR    @07,CVAWKRDT                                        2718
         AH    @07,RPRELEN(,CVAWKRDT)                              2718
         MVC   CVANAME1(8),RPRNAME(@07)                            2718
*             CALL CVATPMSG;                                       2719
         BAL   @14,CVATPMSG                                        2719
*           END;                                                   2720
*         ELSE                      /* NOT A LOCAL ENTRY -           */
*           IF RPRENTRY=RPRENTTR&RPRNSNEA->RPRENTRY=RPRENTLC /* THIS
*                                      ENTRY A LOCAL TERMINAL?       */
*             THEN;                 /* YES - DO NOT OUTPUT A MESSAGE
*                                      BECAUSE ONE WAS OUTPUTTED WHEN
*                                      THE LC ENTRY WAS PROCESSED    */
         B     @RC02716                                            2721
@RF02716 CLI   RPRENTRY(CVAWKRDT),X'80'                            2721
         BNE   @RF02721                                            2721
         L     @07,RPRNSNEA(,CVAWKRDT)                             2721
         CLI   RPRENTRY(@07),X'45'                                 2721
         BE    @RT02721                                            2721
*             ELSE                                                 2723
*               DO;                 /* ENTRY IS NOT A LOCAL TERMINAL-*/
@RF02721 DS    0H                                                  2724
*                 CVANAME1=RPRNAME; /* RESOURCE NAME FOR MSG         */
         MVC   CVANAME1(8),RPRNAME(CVAWKRDT)                       2724
*                 CALL CVATPMSG;    /* NO - OUTPUT MESSAGE           */
         BAL   @14,CVATPMSG                                        2725
*               END;                                               2726
*       CVAERRSW=CVAON;             /* SET ERROR SWITCH ON           */
@RT02721 DS    0H                                                  2727
@RC02716 OI    CVAERRSW,B'00000100'                                2727
*       CVAR15=CVA4;                /* SET ERROR RETURN CODE         */
         LA    CVAR15,4                                            2728
*     END;                                                         2729
*   ELSE                                                           2730
*     CVAR15=0;                     /* SET GOOD RETURN CODE          */
         B     @RC02712                                            2730
@RF02712 SLR   CVAR15,CVAR15                                       2730
*   CVAR14=CVARS100;                /* RESTORE RETURN REGISTER       */
@RC02712 L     CVAR14,CVARS100                                     2731
*   RETURN CODE(CVAR15);            /* EXIT WITH RETURN CODE         */
@EL00019 DS    0H                                                  2732
@EF00019 DS    0H                                                  2732
@ER00019 BR    @14                                                 2732
*   RFY                                                            2733
*     CVAR15 UNRSTD;                                               2733
*   END CVASR100;                   /* RETURN TO CALLER              */
@PB00019 DS    0H                                                  2735
*   GEN(  EJECT);                                                  2735
           EJECT
*CVASRLGO:                                                         2736
*   PROC OPTIONS(NOSAVE NOSAVEAREA);                               2736
*                                                                  2736
         B     @PB00020                                            2736
CVASRLGO DS    0H                                                  2737
*   /*****************************************************************/
*   /*                                                               */
*   /* THE PURPOSE OF THIS SUBROUTINE IS TO CREATE A VARY LOGON FOR  */
*   /* AN ACTIVE CLUSTER CONTROLLER WHEN THE MOTHER RN IS BEING      */
*   /* ACTIVATED A SECOND TIME AND LOGON HAS BEEN SPECIFIED          */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  2737
*   CVARSLGO=CVAR14;                /* SAVE THE RETURN REGISTER      */
         ST    CVAR14,CVARSLGO                                     2737
*   RFY                                                            2738
*     ISTRPRE BASED(CVAWKRDT);                                     2738
*   RFY                                                            2739
*     ISTRCC BASED(CVAWKRDT);                                      2739
*                                                                  2739
*   IF RDTEPTR->RPRENTRY^=RDTEPTR->RPRHDTYP                        2740
*     × NCSPLLPT=0                  /*IF CMD WAS NOT FOR HDR OR    2740
*                                     THERE IS NO LOGON PTR,EXIT*/ 2740
*     THEN;                                                        2740
         L     @15,RDTEPTR                                         2740
         CLC   RPRENTRY(1,@15),RPRHDTYP(@15)                       2740
         BNE   @RT02740                                            2740
         L     @15,NCSPLLPT(,NCSPLPTR)                             2740
         LTR   @15,@15                                             2740
         BZ    @RT02740                                            2740
*     ELSE                                                         2742
*       DO;                                                        2742
*         RFY                                                      2743
*           CVAR0 RSTD;                                            2743
*                                                                  2743
*         /***********************************************************/
*         /*                                                         */
*         /* GET THE VOC LOCK                                        */
*         /*                                                         */
*         /***********************************************************/
*                                                                  2744
*         CVAR0=CVA0;                                              2744
         SLR   CVAR0,CVAR0                                         2744
*         CALL CVASRLOC;                                           2745
         BAL   @14,CVASRLOC                                        2745
*         IF RCCVPAB=0              /* CLUSTER PABS EXITS?           */
*           THEN                                                   2746
         L     @15,RCCVPAB(,CVAWKRDT)                              2746
         LTR   @15,@15                                             2746
         BNZ   @RF02746                                            2746
*             DO;                   /* NO -                          */
*                                                                  2747
*               /*****************************************************/
*               /*                                                   */
*               /* RELEASE THE VOC LOCK                              */
*               /*                                                   */
*               /*****************************************************/
*                                                                  2748
*               CVAR0=CVA10;                                       2748
         LA    CVAR0,10                                            2748
*               CALL CVASRLOC;                                     2749
         BAL   @14,CVASRLOC                                        2749
*               RFY                                                2750
*                 CVAR0 UNRSTD;                                    2750
*             END;                                                 2751
*           ELSE                                                   2752
*             DO;                   /* PABS DO EXIST -               */
         B     @RC02746                                            2752
@RF02746 DS    0H                                                  2753
*               RFY                                                2753
*                 (CVAR0,CVAR15) RSTD;                     /*@D32CKDQ*/
*               RFY ISTVYCRR BASED(NCSPLRPH->                      2754
*                   RPHCRR->CRACRR);                       /*@D32CKDQ*/
*              RFY ISTGTNCS BASED(ADDR(VYCRRCW3));         /*@D32CKDQ*/
*               CVAR1=NCSPLRPH;     /*RPH ADDR               @D32CKDQ*/
         L     @07,NCSPLRPH(,NCSPLPTR)                             2756
         LR    CVAR1,@07                                           2756
*               CVAR0=ADDR(VYCRRCW3);/*PARM LIST             @D32CKDQ*/
         L     @07,RPHCRR(,@07)                                    2757
         L     @07,CRACRR(,@07)                                    2757
         LA    CVAR0,VYCRRCW3(,@07)                                2757
*               VYCRRCW3=VYCRRCW3&&VYCRRCW3; /*GET NCSPL AND WKA*/ 2758
         XC    VYCRRCW3(8,@07),VYCRRCW3(@07)                       2758
*               GTNCSREQ=CVAON;     /*REQSTORE PERMITTED     @D32CKDQ*/
         OI    GTNCSREQ+118(@07),B'10000000'                       2759
*               CALL ISTINCW3;      /*GET NCSPL AND WKA      @D32CKDQ*/
         L     @07,NCSPLCVT(,NCSPLPTR)                             2760
         L     @15,ATCINCW3(,@07)                                  2760
         BALR  @14,@15                                             2760
*               IF CVAR15^=CVA0     /*SUCCESSFUL             @D32CKDQ*/
*                 THEN                                             2761
         LTR   CVAR15,CVAR15                                       2761
         BZ    @RF02761                                            2761
*                 DO;               /*NO                     @D32CKDQ*/
*                   RFY CVAR15 UNRSTD;                     /*@D32CKDQ*/
*                   CVAMSID@=ADDR(CVAMS616);/* GET THE ADDRESS     2764
*                                      OF THE 'LOGON FOR CLUSTER   2764
*                                      INSUFFICIENT STORAGE' MSG ID  */
         LA    @15,CVAMS616                                        2764
         ST    @15,CVAMSID@                                        2764
*                   CVANAME1=RPRNAME;/* GET CLUSTER NODENAME @D32CKDQ*/
         MVC   CVANAME1(8),RPRNAME(CVAWKRDT)                       2765
*                   CVAMSG=ADDR(CVANAME1);/* GET ADDRESS OF  @D32CKDQ
*                                      CLUSTER NODENAME              */
         LA    @15,CVANAME1                                        2766
         ST    @15,CVAMSG                                          2766
*                   CALL CVATPMSG;/* GO OUTPUT MESSAGE       @D32CKDQ*/
*                                                                  2767
         BAL   @14,CVATPMSG                                        2767
*                           /*****************************************/
*                           /*                                       */
*                           /* RELEASE THE VOC LOCK                  */
*                           /*                                       */
*                           /*****************************************/
*                                                                  2768
*                   CVAR0=CVA10;                           /*@D32CKDQ*/
         LA    CVAR0,10                                            2768
*                   CALL CVASRLOC;                         /*@D32CKDQ*/
         BAL   @14,CVASRLOC                                        2769
*                   RFY CVAR0 UNRSTD;                      /*@D32CKDQ*/
*                 END;                                     /*@D32CKDQ*/
*                 ELSE                                             2772
*                   DO;             /* CORE OBTAINED VIA GETSTOR -   */
         B     @RC02761                                            2772
@RF02761 DS    0H                                                  2773
*                     CVANCSPL=GTNCSAD;/* GET ADDRESS OF     @D32CKDQ
*                                      THE NEW NCSPL                 */
         L     @15,NCSPLRPH(,NCSPLPTR)                             2773
         L     @15,RPHCRR(,@15)                                    2773
         L     @15,CRACRR(,@15)                                    2773
         L     @15,GTNCSAD+118(,@15)                               2773
         ST    @15,CVANCSPL                                        2773
*                     CALL CVASRLG1;/* COMPLETE NCSPL PROCESS        */
         BAL   @14,CVASRLG1                                        2774
*                   END;                                           2775
*             END;                  /* END OF 'PABS DO EXIST' -      */
@RC02761 DS    0H                                                  2777
*       END;                                                       2777
@RC02746 DS    0H                                                  2778
*   CVAR14=CVARSLGO;                /* RESTORE THE RETURN REGISTER   */
@RT02740 L     CVAR14,CVARSLGO                                     2778
*   END CVASRLGO;                   /* RETURN TO CALLER              */
@EL00020 DS    0H                                                  2779
@EF00020 DS    0H                                                  2779
@ER00020 BR    @14                                                 2779
@PB00020 DS    0H                                                  2780
*   GEN(  EJECT);                                                  2780
           EJECT
*CVASRLG1:                                                         2781
*   PROC OPTIONS(NOSAVE NOSAVEAREA);                               2781
*                                                                  2781
         B     @PB00021                                            2781
CVASRLG1 DS    0H                                                  2782
*   /*****************************************************************/
*   /*                                                               */
*   /* THE PURPOSE OF THIS SUBROUTINE IS TO COMPLETE THE LOGON NCSPL */
*   /* THAT CVASRLGO JUST BUILT.                                     */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  2782
*   RFY                                                            2782
*     ISTRPRE BASED(CVAWKRDT);                                     2782
*   CVARSLG1=CVAR14;                /* SAVE THE RETURN REGISTER      */
         ST    CVAR14,CVARSLG1                                     2783
*   CVAR1=NCSPLRPH;                 /* GET AN RPH ADDRESS            */
         L     CVAR1,NCSPLRPH(,NCSPLPTR)                           2784
*         RFY                                                      2785
*           ISTNCSPL BASED(CVANCSPL);                              2785
*         NCSPLVCD=NCSPLVC1;        /* INDICATE 'VARY'               */
         L     @15,CVANCSPL                                        2786
         MVI   NCSPLVCD(@15),X'01'                                 2786
*         NCSPLVBF=NCSVLON;         /* INDICATE 'LOGON'              */
         MVC   NCSPLVBF(2,@15),@CB01670                            2787
*         NCSPLLPT=NCSPLPTR->NCSPLLPT;/* GET APPL RDTE ADDRESS       */
         L     @07,NCSPLLPT(,NCSPLPTR)                             2788
         ST    @07,NCSPLLPT(,@15)                                  2788
*         NCSPLLID=NCSPLPTR->NCSPLLID;/* GET APPLICATION NODENAME    */
         MVC   NCSPLLID(8,@15),NCSPLLID(NCSPLPTR)                  2789
*         NCSPLSID=NCSPLPTR->NCSPLSID;/* GET CONSOLE ID              */
         MVC   NCSPLSID(9,@15),NCSPLSID(NCSPLPTR)                  2790
*         NCSPLMID=NCSPLPTR->NCSPLMID; /* COPY LOGMODE= PARAMETER FROM
*                                        THE ORIGIONAL NCSPL @DM14154*/
         MVC   NCSPLMID(8,@15),NCSPLMID(NCSPLPTR)                  2791
*         NCSPLRPT=CVAWKRDT;        /* GET CLUSTER RDTE ADDRESS      */
         ST    CVAWKRDT,NCSPLRPT(,@15)                             2792
*         NCSPLRID=RPRNAME;         /* GET CLUSTER'S NODENAME        */
         MVC   NCSPLRID(8,@15),RPRNAME(CVAWKRDT)                   2793
*         NCSPLEBN='1'B;            /* INDICATE ENTRY FROM BOUNDRY 2794
*                                      NODE -- NCSPL IS ON THE PROPER
*                                      PABSET                        */
         OI    NCSPLEBN(@15),B'00100000'                           2794
*         CVAWKSAV=NCSPLLPT;        /* GET APPLICATION RDTE ADDRESS  */
         ST    @07,CVAWKSAV                                        2795
*         DO WHILE CVAWKSAV->RPRENTRY^=RPRENTAH;/* LOOK FOR APPLICA-
*                                      TION HEADER ENTRY             */
         B     @DE02796                                            2796
@DL02796 DS    0H                                                  2797
*           CVAWKSAV=CVAWKSAV->RPRNSNEA;/* GET THE NEXT HIGHER NODE  */
         L     @15,CVAWKSAV                                        2797
         L     @15,RPRNSNEA(,@15)                                  2797
         ST    @15,CVAWKSAV                                        2797
*         END;                                                     2798
@DE02796 L     @15,CVAWKSAV                                        2798
         CLI   RPRENTRY(@15),X'02'                                 2798
         BNE   @DL02796                                            2798
*         CVAWKSAV->RDTLGCT=CVAWKSAV->RDTLGCT+CVA1;/* INCREMENT THE
*                                      LOGON COUNT IN THE          2799
*                                      APPLICATION SEGMENT HEADER    */
         LA    @07,1                                               2799
         SLR   @00,@00                                             2799
         IC    @00,RDTLGCT(,@15)                                   2799
         ALR   @07,@00                                             2799
         STC   @07,RDTLGCT(,@15)                                   2799
*         RFY                                                      2800
*           ISTDYPAB BASED(RCCVPAB);                               2800
*                                                                  2800
*         /***********************************************************/
*         /*                                                         */
*         /* QUEUE THE NEW LOGON NCSPL TO THE CLUSTER'S VARY PAB     */
*         /*                                                         */
*         /***********************************************************/
*                                                                  2801
*                                                                  2801
*/*  TPQUE (CVANCSPL,DYPPAB) NORM */                               2801
*                                                                  2801
*          DO;                                                     2801
*          RFY (GPR00P,GPR01P,GPR04P,GPR05P,GPR15P) RSTD;          2802
*          GEN REFS(GPR01P) SETS(RPHWORK)                          2803
*        (STM GPR02P,GPR08P,RPHWORK(GPR01P));                      2803
         STM GPR02P,GPR08P,RPHWORK(GPR01P)
*          GPR00P=0;                                               2804
         SLR   GPR00P,GPR00P                                       2804
*          GPR15P=ADDR(DYPPAB); /*HOLD PAB PTR*/                   2805
         L     GPR15P,RCCVPAB(,CVAWKRDT)                           2805
         LA    GPR15P,DYPPAB(,GPR15P)                              2805
*          GPR04P=CVANCSPL; /*WORK ELE PTR*/                       2806
         L     GPR04P,CVANCSPL                                     2806
*          GPR05P=GPR15P; /*PASS PAB PTR*/                         2807
         LR    GPR05P,GPR15P                                       2807
*          CALL ATCLCPTR->ATCAP37->ISTAPC37;                       2808
         L     @07,ATCLCPTR                                        2808
         L     @15,ATCAP37(,@07)                                   2808
         BALR  @14,@15                                             2808
*          GEN(NOPR  0)NOSETS NOREFS;                              2809
         NOPR  0
*          RFY (GPR00P,GPR01P,GPR04P,GPR05P,GPR15P) UNRSTD;        2810
*          END; /**** END OF TPQUE GENERATION ****/                2811
*         RFY                                                      2812
*           ISTNCSPL BASED(NCSPLPTR);                              2812
*   RFY                                                            2813
*     CVAR0 RSTD;                                                  2813
*                                                                  2813
*   /*****************************************************************/
*   /*                                                               */
*   /* RELEASE THE VOC LOCK       NOTE: THE VOC LOCK WAS ALREADY     */
*   /*                                  HELD AT ENTRY TO THIS        */
*   /*                                  SUBROUTINE.                  */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  2814
*   CVAR0=CVA10;                                                   2814
         LA    CVAR0,10                                            2814
*   CALL CVASRLOC;                                                 2815
         BAL   @14,CVASRLOC                                        2815
*   RFY                                                            2816
*     CVAR0 UNRSTD;                                                2816
*   CVAR14=CVARSLG1;                /* RESTORE THE RETURN REGISTER   */
         L     CVAR14,CVARSLG1                                     2817
*   END CVASRLG1;                   /* RETURN TO CALLER              */
@EL00021 DS    0H                                                  2818
@EF00021 DS    0H                                                  2818
@ER00021 BR    @14                                                 2818
@PB00021 DS    0H                                                  2819
*   GEN(  EJECT);                                                  2819
           EJECT
*CVASRLOC:                                                         2820
*   PROC OPTIONS(NOSAVE NOSAVEAREA);                               2820
*                                                                  2820
         B     @PB00022                                            2820
CVASRLOC DS    0H                                                  2821
*   /*****************************************************************/
*   /*                                                               */
*   /* LOCK/UNLOCK SUBROUTINE: THIS SUBROUTINE WILL ISSUE TPLOCKS AND*/
*   /* TPUNLOCKS FOR OTHER SUBROUTINES. INPUT TO THIS SUBROUTINE IS: */
*   /*     R1 = RPH ADDRESS IF R0 IS 30 OR GREATER - IF R0 IS LESS   */
*   /*          THAN 30, THE RPH MUST BE OBTAINED.                   */
*   /*     R0 =  0 OR 30   GET VOC LOCK                              */
*   /*           4 OR 34   GET RDT LOCK                              */
*   /*          10 OR 40   RELEASE VOC LOCK                          */
*   /*          14 OR 44   RELEASE RDT LOCK                          */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  2821
*   RFY                                                            2821
*     ISTRPRE BASED(CVAWKRDT);                                     2821
*   RFY                                                            2822
*     CVAR0 RSTD;                                                  2822
*   CVARSLOC=CVAR14;                /* SAVE RETURN REGISTER          */
         ST    CVAR14,CVARSLOC                                     2823
*   IF CVAR0<CVA30                  /* RPH ADDRESS SUPPLIED?         */
*     THEN                                                         2824
         C     CVAR0,@CF05264                                      2824
         BNL   @RF02824                                            2824
*     CVAR1=NCSPLRPH;               /* NO - GET RPH ADDRESS FROM   2825
*                                      NCSPL                         */
         L     CVAR1,NCSPLRPH(,NCSPLPTR)                           2825
*   ELSE                                                           2826
*     ;                                                            2826
@RF02824 DS    0H                                                  2827
*   IF CVAR0=CVA0×CVAR0=CVA30       /* GET THE VOC LOCK?             */
*     THEN                                                         2827
         LTR   CVAR0,CVAR0                                         2827
         BZ    @RT02827                                            2827
         C     CVAR0,@CF05264                                      2827
         BNE   @RF02827                                            2827
@RT02827 DS    0H                                                  2828
*     DO;                           /* YES -                         */
*       /*************************************************************/
*       /*                                                           */
*       /* GET THE VARY/OPEN/CLOSE (VOC) LOCK                        */
*       /*                                                           */
*       /*************************************************************/
*                                                                  2829
*                                                                  2829
*/*** START -TPLOCK (VOCLOCK)TYPE(XCLSIVE)- ***/                   2829
*        DO;                                                       2829
*        RFY (GPR00P,GPR01P,GPR02P,GPR03P,GPR04P,GPR15P) RSTD;     2830
*        GENERATE REFS(GPR00P,GPR01P,GPR15P,RPHWORK) SETS(RPHWORK);
         STM GPR00P,GPR14P,RPHWORK(GPR01P)
*        GPR15P = ATCAP36;              /*ADDRESS OF LOCK ROUTINE*/
         L     @07,NCSPLCVT(,NCSPLPTR)                             2832
         L     GPR15P,ATCAP36(,@07)                                2832
*        GPR02P = ADDR(ATCVOCLK);       /*SET PARAM - LOCKWORD PTR*/
         LA    GPR02P,ATCVOCLK(,@07)                               2833
*        GPR04P = GPR01P->RPHCRR;       /*SET PARAM - ISTCRA PTR*/ 2834
         L     GPR04P,RPHCRR(,GPR01P)                              2834
*        GPR00P = CRALMS02;             /*SET PARAM - LOCK LEVEL FLAG*/
         LA    GPR00P,2                                            2835
*        GPR03P = ADDR(GPR04P->CRAL2PTR);                          2836
         LA    GPR03P,CRAL2PTR(,GPR04P)                            2836
*                                       /*SET PARAM - LOCK LEVEL PTR*/
*        DCL FMZL0203 BASED(GPR15P) LABEL VALUERANGE(*);           2837
*        CALL FMZL0203;                                            2838
         BALR  @14,@15                                             2838
*        GENERATE REFS(GPR00P,GPR01P,GPR14P,RPHWORK) SETS(GPR00P,GPR01P
*GPR02P,GPR03P,GPR04P,GPR05P,GPR06P,GPR07P,GPR08P,GPR09P,GPR10P,GPR11P,
*PR12P,GPR13P,GPR14P,GPR15P);                                      2839
         LM GPR00P,GPR15P,RPHWORK(GPR01P)
*        RFY (GPR00P,GPR01P,GPR02P,GPR03P,GPR04P,GPR15P) UNRSTD;   2840
*        END;                                                      2841
*/*** END -TPLOCK (VOCLOCK)TYPE(XCLSIVE)- ***/                     2842
*     END;                                                         2842
*   ELSE                                                           2843
*     IF CVAR0=CVA4×CVAR0=CVA34     /* GET THE RDT LOCK?             */
*       THEN                                                       2843
         B     @RC02827                                            2843
@RF02827 C     CVAR0,@CF00088                                      2843
         BE    @RT02843                                            2843
         C     CVAR0,@CF05266                                      2843
         BNE   @RF02843                                            2843
@RT02843 DS    0H                                                  2844
*       DO;                         /* YES -                         */
*         /***********************************************************/
*         /*                                                         */
*         /* GET THE RDT LOCK                                        */
*         /*                                                         */
*         /***********************************************************/
*                                                                  2845
*                                                                  2845
*/*** START -TPLOCK (RDTLOCK)TYPE(XCLSIVE)- ***/                   2845
*          DO;                                                     2845
*          RFY (GPR00P,GPR01P,GPR02P,GPR03P,GPR04P,GPR15P) RSTD;   2846
*        GENERATE REFS(GPR00P,GPR01P,GPR15P,RPHWORK) SETS(RPHWORK);
         STM GPR00P,GPR14P,RPHWORK(GPR01P)
*        GPR15P = ATCAP36;              /*ADDRESS OF LOCK ROUTINE*/
         L     @07,NCSPLCVT(,NCSPLPTR)                             2848
         L     GPR15P,ATCAP36(,@07)                                2848
*        GPR02P = ADDR(ATCRDTLK);       /*SET PARAM - LOCKWORD PTR*/
         LA    GPR02P,ATCRDTLK(,@07)                               2849
*        GPR04P = GPR01P->RPHCRR;       /*SET PARAM - ISTCRA PTR*/ 2850
         L     GPR04P,RPHCRR(,GPR01P)                              2850
*        GPR00P = CRALMS03;             /*SET PARAM - LOCK LEVEL FLAG*/
         LA    GPR00P,4                                            2851
*        GPR03P = ADDR(GPR04P->CRAL3PTR);                          2852
         LA    GPR03P,CRAL3PTR(,GPR04P)                            2852
*                                       /*SET PARAM - LOCK LEVEL PTR*/
*        DCL FMZL0208 BASED(GPR15P) LABEL VALUERANGE(*);           2853
*        CALL FMZL0208;                                            2854
         BALR  @14,@15                                             2854
*        GENERATE REFS(GPR00P,GPR01P,GPR14P,RPHWORK) SETS(GPR00P,GPR01P
*GPR02P,GPR03P,GPR04P,GPR05P,GPR06P,GPR07P,GPR08P,GPR09P,GPR10P,GPR11P,
*PR12P,GPR13P,GPR14P,GPR15P);                                      2855
         LM GPR00P,GPR15P,RPHWORK(GPR01P)
*          RFY (GPR00P,GPR01P,GPR02P,GPR03P,GPR04P,GPR15P) UNRSTD; 2856
*        END;                                                      2857
*/*** END -TPLOCK (RDTLOCK)TYPE(XCLSIVE)- ***/                     2858
*       END;                                                       2858
*     ELSE                                                         2859
*         IF CVAR0=CVA10×CVAR0=CVA40/* RELEASE THE VOC LOCK?         */
*           THEN                                                   2859
         B     @RC02843                                            2859
@RF02843 C     CVAR0,@CF00032                                      2859
         BE    @RT02859                                            2859
         C     CVAR0,@CF03567                                      2859
         BNE   @RF02859                                            2859
@RT02859 DS    0H                                                  2860
*           DO;                     /* YES -                         */
*             /*******************************************************/
*             /*                                                     */
*             /* RELEASE THE VARY/OPEN/CLOSE (VOC) LOCK              */
*             /*                                                     */
*             /*******************************************************/
*                                                                  2861
*                                                                  2861
*/*** START -TPUNLOCK (VOCLOCK)- ***/                              2861
*              DO;                                                 2861
*                                                                  2861
*/* ATBUILD (ISTRPH,ISTLOK,ISTCRA)  */                             2862
*/* END OF ATBUILD */                                              2862
*              RFY (GPR00P,GPR01P,GPR02P,GPR03P,GPR04P,GPR15P) RSTD;
*        GENERATE REFS(GPR00P,GPR01P,GPR15P,RPHWORK) SETS(RPHWORK);
         STM GPR00P,GPR15P,RPHWORK(GPR01P)
*        GPR02P = ADDR(ATCVOCLK);       /*SET PARAM - LOCKWORD PTR*/
         L     GPR02P,NCSPLCVT(,NCSPLPTR)                          2864
         LA    GPR02P,ATCVOCLK(,GPR02P)                            2864
*        GPR04P = GPR01P->RPHCRR;       /*SET PARAM - ISTCRA PTR*/ 2865
         L     GPR04P,RPHCRR(,GPR01P)                              2865
*        GPR00P = CRALMS02;             /*SET PARAM - LOCK LEVEL FLAG*/
         LA    GPR00P,2                                            2866
*        GPR03P = ADDR(GPR04P->CRAL2PTR);                          2867
         LA    GPR03P,CRAL2PTR(,GPR04P)                            2867
*                                       /*SET PARAM - LOCK LEVEL PTR*/
*                                                                  2868
*              DO; /* LISATCVT CVTBASE(PAGEABLE,(GPR15P)) */       2868
*                GPR15P = ATCLCPTR; /*SET UP ATCVT POINTER*/       2869
         L     GPR15P,ATCLCPTR                                     2869
*              END; /*LISATCVT*/                                   2870
*        GPR15P=GPR15P->ATCAP33;                                   2871
         L     GPR15P,ATCAP33(,GPR15P)                             2871
*        DCL FMZL0213 BASED(GPR15P) LABEL VALUERANGE(*);           2872
*        CALL FMZL0213;                                            2873
         BALR  @14,@15                                             2873
*        GENERATE REFS(GPR00P,GPR01P,GPR15P,RPHWORK) SETS(GPR00P,GPR01P
*GPR02P,GPR03P,GPR04P,GPR05P,GPR06P,GPR07P,GPR08P,GPR09P,GPR10P,GPR11P,
*PR12P,GPR13P,GPR14P,GPR15P);                                      2874
         LM GPR00P,GPR15P,RPHWORK(GPR01P)
*              RFY (GPR00P,GPR01P,GPR02P,GPR03P,GPR04P,GPR15P) UNRSTD;
*        END;                                                      2876
*/*** END -TPUNLOCK (VOCLOCK)- ***/                                2877
*           END;                                                   2877
*         ELSE                                                     2878
*           IF CVAR0=CVA14×CVAR0=CVA44/* RELEASE THE RDT LOCK?       */
*             THEN                                                 2878
         B     @RC02859                                            2878
@RF02859 C     CVAR0,@CF03973                                      2878
         BE    @RT02878                                            2878
         C     CVAR0,@CF05271                                      2878
         BNE   @RF02878                                            2878
@RT02878 DS    0H                                                  2879
*             DO;                   /* YES -                         */
*               /*****************************************************/
*               /*                                                   */
*               /* RELEASE THE RDT LOCK                              */
*               /*                                                   */
*               /*****************************************************/
*                                                                  2880
*                                                                  2880
*/*** START -TPUNLOCK (RDTLOCK)- ***/                              2880
*                DO;                                               2880
*                                                                  2880
*/* ATBUILD (ISTRPH,ISTLOK,ISTCRA)  */                             2881
*/* END OF ATBUILD */                                              2881
*                RFY (GPR00P,GPR01P,GPR02P,GPR03P,GPR04P,GPR15P) RSTD;
*        GENERATE REFS(GPR00P,GPR01P,GPR15P,RPHWORK) SETS(RPHWORK);
         STM GPR00P,GPR15P,RPHWORK(GPR01P)
*        GPR02P = ADDR(ATCRDTLK);       /*SET PARAM - LOCKWORD PTR*/
         L     GPR02P,NCSPLCVT(,NCSPLPTR)                          2883
         LA    GPR02P,ATCRDTLK(,GPR02P)                            2883
*        GPR04P = GPR01P->RPHCRR;       /*SET PARAM - ISTCRA PTR*/ 2884
         L     GPR04P,RPHCRR(,GPR01P)                              2884
*        GPR00P = CRALMS03;             /*SET PARAM - LOCK LEVEL FLAG*/
         LA    GPR00P,4                                            2885
*        GPR03P = ADDR(GPR04P->CRAL3PTR);                          2886
         LA    GPR03P,CRAL3PTR(,GPR04P)                            2886
*                                       /*SET PARAM - LOCK LEVEL PTR*/
*                                                                  2887
*                DO; /* LISATCVT CVTBASE(PAGEABLE,(GPR15P)) */     2887
*                  GPR15P = ATCLCPTR; /*SET UP ATCVT POINTER*/     2888
         L     GPR15P,ATCLCPTR                                     2888
*                END; /*LISATCVT*/                                 2889
*        GPR15P=GPR15P->ATCAP33;                                   2890
         L     GPR15P,ATCAP33(,GPR15P)                             2890
*        DCL FMZL0223 BASED(GPR15P) LABEL VALUERANGE(*);           2891
*        CALL FMZL0223;                                            2892
         BALR  @14,@15                                             2892
*        GENERATE REFS(GPR00P,GPR01P,GPR15P,RPHWORK) SETS(GPR00P,GPR01P
*GPR02P,GPR03P,GPR04P,GPR05P,GPR06P,GPR07P,GPR08P,GPR09P,GPR10P,GPR11P,
*PR12P,GPR13P,GPR14P,GPR15P);                                      2893
         LM GPR00P,GPR15P,RPHWORK(GPR01P)
*                RFY (GPR00P,GPR01P,GPR02P,GPR03P,GPR04P,GPR15P) UNRSTD
*        END;                                                      2895
*/*** END -TPUNLOCK (RDTLOCK)- ***/                                2896
*             END;                                                 2896
*             ELSE                                                 2897
*               ;                   /* IF NONE OF THE ABOVE- OOPS    */
@RF02878 DS    0H                                                  2898
*   RFY                                                            2898
*     CVAR0 UNRSTD;                                                2898
@RC02859 DS    0H                                                  2898
@RC02843 DS    0H                                                  2898
@RC02827 DS    0H                                                  2899
*   CVAR14=CVARSLOC;                /* RESTORE RETURN REGISTER       */
         L     CVAR14,CVARSLOC                                     2899
*   END CVASRLOC;                   /* RETURN TO CALLER              */
@EL00022 DS    0H                                                  2900
@EF00022 DS    0H                                                  2900
@ER00022 BR    @14                                                 2900
@PB00022 DS    0H                                                  2901
*   GEN(  EJECT);                                                  2901
           EJECT
*CVATPMSG:                                                         2902
*   PROC OPTIONS(NOSAVE NOSAVEAREA);                               2902
*                                                                  2902
         B     @PB00023                                            2902
CVATPMSG DS    0H                                                  2903
*   /*****************************************************************/
*   /*                                                               */
*   /* MESSAGE SUBROUTINE                                            */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  2903
*   CVARSMSG=CVAR14;                /* SAVE RETURN REGISTER          */
         ST    CVAR14,CVARSMSG                                     2903
*   RFY                                                            2904
*    (CVAR2,                                                       2904
*     CVAR3)RSTD;                                                  2904
*   CVAR2=CVAMSID@;                 /* GET MSG ID FROM SAVEAREA      */
         L     CVAR2,CVAMSID@                                      2905
*   CVAR3=ADDR(NCSPLSID);           /* GET ADDRESS OF CONSOLE ID IN
*                                      THE NCSPL                     */
*                                                                  2906
         LA    CVAR3,NCSPLSID(,NCSPLPTR)                           2906
*   /*****************************************************************/
*   /*                                                               */
*   /* ********* OUTPUT MESSAGE *********                            */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  2907
*                                                                  2907
*/*TPMSG MSGID((CVAR2))MSG((CVAMSG))OPTIONS((CVAR3))PLAREA(CVAMSGPL)*/
*                                                                  2907
*    DO;                                                           2907
*      DCL REG1233  REG(1)  PTR;                                   2908
*      RFY (REG1233) RSTD;                                         2909
*                                                                  2909
*    RFY (EMCR13) RSTD;                                            2910
*      DCL 1 * BASED(REG1233),                                     2911
*          2 CMZID233 PTR(31),                                     2911
*          2 *,                                                    2911
*            3 CMZRL233 PTR(8),                                    2911
*            3 CMZRA233 PTR(24) BDY(BYTE),                         2911
*          2 CMZEA233 PTR(31),                                     2911
*          2 CMZVP233 PTR(31);                                     2911
*                                                                  2911
*/*XREGSET  PID('PLAREA')PPARM(CVAMSGPL)RREG(,REG1233)*/           2912
*    DO;                                                           2912
*      REG1233=ADDR(CVAMSGPL);           /*SET RREG SYMBOL TO ADDRESS*/
         LA    REG1233,CVAMSGPL                                    2913
*                                        /*OF PPARM OPERAND          */
*    END;  /* XREGSET */                                           2914
*      CMZID233 = 0;                                               2915
         SLR   @15,@15                                             2915
         ST    @15,CMZID233(,REG1233)                              2915
*      CMZRL233 = 0;                                               2916
         MVI   CMZRL233(REG1233),X'00'                             2916
*      CMZRA233 = 0;                                               2917
         STCM  @15,7,CMZRA233(REG1233)                             2917
*      CMZEA233 = 0;                                               2918
         ST    @15,CMZEA233(,REG1233)                              2918
*      CMZVP233 = 0;                                               2919
         ST    @15,CMZVP233(,REG1233)                              2919
*      CMZID233=CVAR2;                                             2920
         ST    CVAR2,CMZID233(,REG1233)                            2920
*      CMZVP233 = CVAMSG;                                          2921
         L     @15,CVAMSG                                          2921
         ST    @15,CMZVP233(,REG1233)                              2921
*      DCL CMZSA233 (18) PTR(31) BASED(EMCR13);                    2922
*      CMZSA233(5) = CVAR3;                                        2923
*                                                                  2923
         ST    CVAR3,CMZSA233+16(,EMCR13)                          2923
*      DCL REG15233 REG(15) PTR;                                   2924
*      RFY REG15233 RSTD;                                          2925
*                                                                  2925
*    DO; /* LISATCVT CVTBASE(PAGEABLE,(REG15233)) */               2926
*      REG15233 = ATCLCPTR; /*SET UP ATCVT POINTER*/               2927
         L     REG15233,ATCLCPTR                                   2927
*    END; /*LISATCVT*/                                             2928
*      DCL CMTA233 BASED(REG15233) ENTRY VALUERANGE(*);            2929
*      REG15233 = REG15233->ATCMSGP;                               2930
         L     REG15233,ATCMSGP(,REG15233)                         2930
*      CALL CMTA233;                                               2931
         BALR  @14,@15                                             2931
*      RESPECIFY (REG1233,REG15233)  UNRESTRICTED;                 2932
*                                                                  2932
*    RFY (EMCR13) UNRSTD;                                          2933
*    END;                                                          2934
*   RFY                                                            2935
*    (CVAR2,                                                       2935
*     CVAR3)UNRSTD;                                                2935
*   CVAR14=CVARSMSG;                /* RESTORE RETURN REGISTER       */
         L     CVAR14,CVARSMSG                                     2936
*   END CVATPMSG;                                                  2937
*                                                                  2937
@EL00023 DS    0H                                                  2937
@EF00023 DS    0H                                                  2937
@ER00023 BR    @14                                                 2937
@PB00023 DS    0H                                                  2938
*/* TPEPILOG   */                                                  2938
*    GEN (PRINT OFF);                                              2938
*                                                                  2938
         PRINT OFF
*/* TEMPLATE FOR CHAIN FIELD OF WORK ELEMENT */                    2939
*DCL  1  ISTWKE BDY(WORD) BASED(WKEPTR),                           2939
*        2  * CHAR(4),                 /* SPACE                       *
*        2  WKECHAIN PTR(31),          /* CHAIN POINTER               *
*           3 WKEFLAGS BIT(8),         /* FLAGS                       *
*             4 WKEGATE  BIT(1),       /* GATE BIT                    *
*             4 *        BIT(7),       /* RESERVED                    *
*           3 WKECHNGP PTR(24);        /* PTR ADDRESS                 *
*    DCL ISTINCR5 ENTRY NONLOCAL EXT;                              2940
*                                                                  2940
*    DECLARE                                                       2941
*      EMCR0 PTR REG(0),                                           2941
*      EMCR1 PTR REG(1),                                           2941
*      EMCR2 PTR REG(2),                                           2941
*      EMCR3 PTR REG(3),                                           2941
*      EMCR4 PTR REG(4),                                           2941
*      EMCR5 PTR REG(5),                                           2941
*      EMCR6 PTR REG(6),                                           2941
*      EMCR7 PTR REG(7),                                           2941
*      EMCR8 PTR REG(8),                                           2941
*      EMCR9 PTR REG(9),                                           2941
*      EMCR10 PTR REG(10),                                         2941
*      EMCR11 PTR REG(11),                                         2941
*      EMCR12 PTR REG(12),                                         2941
*      EMCR13 PTR REG(13),                                         2941
*      EMCR14 PTR REG(14),                                         2941
*      EMCR15 PTR REG(15);                                         2941
*                                                                  2941
*    DECLARE                                                       2942
*      ISTSDCCA ENTRY BASED(ATCCDADD) VALRG(*), /*CIDCTL ADD ROUTINE*/
*      ISTSDCCD ENTRY BASED(ATCCDDEL) VALRG(*), /*CIDCTL DELETE ROUTINE
*/     ISTSDCCF ENTRY BASED(ATCCDFND) VALRG(*), /*CIDCTL FIND ROUTINE*/
*      ISTSDCCN ENTRY BASED(ATCCDFDN) VALRG(*), /*CIDCTL FIND NCB ROUTI
*E*/   ISTSDCCR ENTRY BASED(ATCCDFIN) VALRG(*); /*CIDCTL FINISH ROUTINE
*/     DCL CMZCIDM FIXED(15) DEFINED(ATCCIDM); /*CIDMASK ALIAS*/   2942
*    DCL ISTAPC34 ENTRY BASED(ATCAP34) VALRG(*); /*RESET ROUTINE*/ 2944
*    DCL ISTAPC37 ENTRY BASED(ATCAP37) VALRG(*); /*TPQUE ROUTINE*/ 2945
*    GEN (PRINT ON);                                               2946
         PRINT ON
*/* END OF TPEPILOG */                                             2947
*   END ISTINCVA                                                   2947
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.      *
*/*%INCLUDE SYSLIB  (CVT     )                                        *
*/*%INCLUDE SYSLIB  (IEZIOB  )                                        *
*/*%INCLUDE SYSLIB  (IECDIOSB)                                        *
*/*%INCLUDE SYSLIB  (IHASRB  )                                        *
*;                                                                 2947
         B     @EL00001                                            2947
@DATA    DS    0H
@CH00323 DC    H'3'
@DATD    DSECT
         DS    0F
@TF00001 DS    F
ISTINCVA CSECT
         DS    0F
@CF00088 DC    F'4'
@CF00832 DC    F'5'
@CH00832 EQU   @CF00832+2
@CF00094 DC    F'8'
@CH00094 EQU   @CF00094+2
@CF00032 DC    F'10'
@CF00034 DC    F'12'
@CF03973 DC    F'14'
@CF00835 DC    F'16'
@CF01158 DC    F'20'
@CF05264 DC    F'30'
@CF05266 DC    F'34'
@CF03567 DC    F'40'
@CF05271 DC    F'44'
@CF01519 DC    F'72'
@CF01355 DC    XL4'08000000'
@CF01359 DC    XL4'04000000'
@CF01394 DC    XL4'7FFFFFFF'
@CF01396 DC    XL4'80000000'
@CF05583 DC    XL4'00FFFFFF'
@CF05770 DC    XL4'0000FFFF'
@DATD    DSECT
         DS    0D
CVAWKARA DS    CL260
         ORG   CVAWKARA
CVASWTCH DS    BL3
         ORG   CVASWTCH
CVASW1   DS    BL1
         ORG   CVASW1
CVAGOSW  DS    BL1
CVANEWSG EQU   CVASW1+0
CVALRDYA EQU   CVASW1+0
CVASGMNT EQU   CVASW1+0
CVAFRSTM EQU   CVASW1+0
CVAERRSW EQU   CVASW1+0
CVANOCLF EQU   CVASW1+0
CVALFDON EQU   CVASW1+0
         ORG   CVASWTCH+1
CVASW2   DS    BL1
         ORG   CVASW2
CVASKENT DS    BL1
CVALOOP1 EQU   CVASW2+0
CVALOOP2 EQU   CVASW2+0
CVALOOP3 EQU   CVASW2+0
CVAQUIT  EQU   CVASW2+0
CVAINCSW EQU   CVASW2+0
CVADOMSG EQU   CVASW2+0
CVAACT   EQU   CVASW2+0
         ORG   CVASWTCH+2
CVASW3   DS    BL1
         ORG   CVASW3
CVASCV   DS    BL1
CVALPSW  EQU   CVASW3+0
CVACKPT  EQU   CVASW3+0
@NM00080 EQU   CVASW3+0
         ORG   CVAWKARA+3
CVASIDSV DS    CL1
CVAMIDSV DS    AL4
CVAMSGSV DS    AL4
CVACMD   DS    FL2
CVACOUNT DS    FL2
CVAMSID@ DS    AL4
CVAMSG   DS    AL4
CVAMSGWA DS    CL24
         ORG   CVAMSGWA
CVAVARY  DS    CL8
         ORG   CVAVARY
CVAVARY2 DS    CL2
CVAVARY6 DS    CL6
         ORG   CVAMSGWA+8
CVANAME1 DS    CL8
CVANAME2 DS    CL8
         ORG   CVAWKARA+48
CVACVOMG DS    CL4
CVACVOWA DS    CL24
RDTEPTR  DS    AL4
CVARADSV DS    AL4
CVARIDSV DS    CL8
CVARPTSV DS    AL4
CVAWKSAV DS    AL4
CVAWKSV2 DS    AL4
CVANCSPL DS    AL4
CVAVPAB  DS    AL4
CVACRMSK DS    FL4
CVARS030 DS    AL4
CVARS035 DS    AL4
CVARS040 DS    AL4
CVARS041 DS    AL4
CVARS050 DS    AL4
CVARS051 DS    AL4
CVARS053 DS    AL4
CVARS054 DS    AL4
CVARS060 DS    AL4
CVARS070 DS    AL4
CVARS071 DS    AL4
CVARS080 DS    AL4
CVARS100 DS    AL4
CVARSLGO DS    AL4
CVARSLG1 DS    AL4
CVARSCIO DS    AL4
CVARSSCV DS    AL4
CVARSCLU DS    AL4
CVARSCL2 DS    AL4
CVARSCL5 DS    AL4
CVARSLU  DS    AL4
CVARSWKA DS    AL4
CVARSLOC DS    AL4
CVARSMSG DS    AL4
CVACID   DS    FL4
         ORG   CVACID
CVASAF   DS    BL2
CVADAF   DS    BL2
         ORG   CVAWKARA+216
CVARUS   DS    CL22
         ORG   CVARUS
CVARUOUT DS    CL8
         ORG   CVARUOUT
CVARUO1  DS    CL1
CVARUO23 DS    CL2
         ORG   CVARUO23
CVARUO2  DS    CL1
CVARUO3  DS    CL1
         ORG   CVARUOUT+3
CVARUO45 DS    CL2
CVARUO6  DS    CL1
CVARUO7  DS    CL2
         ORG   CVARUS+8
CVARUIN  DS    CL14
         ORG   CVARUIN
CVARUI1  DS    CL1
CVARUI2  DS    CL1
CVARUI39 DS    CL7
@NM00081 DS    CL5
         ORG   CVAWKARA+240
CVAMSGPL DS    CL16
         ORG   CVAMSGPL
@NM00082 DS    AL4
@NM00083 DS    CL4
         ORG   @NM00083
@NM00084 DS    AL1
@NM00085 DS    AL3
         ORG   CVAMSGPL+8
@NM00086 DS    AL4
@NM00087 DS    AL4
         ORG   CVAWKARA+256
@NM00088 DS    AL4
         ORG   CVAWKARA+260
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA
@ENDDATD EQU   *
ISTINCVA CSECT
         DS    0F
@SIZDATD DC    AL1(0)
         DC    AL3(@ENDDATD-@DATD)
@CV05443 DC    V(ISTINCR5)
@CV05444 DC    V(ISTINCVN)
@CV05447 DC    V(ISTINCFS)
@CV05530 DC    V(ISTINCLF)
@CV05551 DC    V(ISTINCV2)
@CV05567 DC    V(ISTINCVO)
@CV05575 DC    V(ISTINCV4)
@CV05576 DC    V(ISTINCL1)
@CV05618 DC    V(ISTINCW7)
@CV05653 DC    V(ISTINCV5)
@CV05660 DC    V(ISTINCIO)
         DS    0D
CVAPABS  DC    AL4(3*32)
CMZA0108 DS    FL4
         ORG   CMZA0108
@NM00091 DC    AL1(64)
@NM00092 DC    AL1(96)
@NM00093 DC    AL1(231)
@NM00094 DC    XL1'01'
         ORG   CMZA0108+4
CMZA0158 DS    FL4
         ORG   CMZA0158
@NM00095 DC    AL1(64)
@NM00096 DC    AL1(96)
@NM00097 DC    AL1(231)
@NM00098 DC    XL1'01'
         ORG   CMZA0158+4
@CC05438 DC    C'VARY    '
@CC05471 EQU   @CC05438
@CB01670 DC    X'0004'
@CB01822 DC    X'3010'
@CB01826 DC    X'3012'
@CB01832 DC    X'9014'
@CB01834 DC    X'9015'
         DS    CL2
CVAMS067 DC    CL4'067I'
CVAMS069 DC    CL4'069I'
CVAMS073 DC    CL4'073I'
CVAMS074 DC    CL4'074I'
CVAMS090 DC    CL4'090I'
CVAMS091 DC    CL4'091I'
CVAMS093 DC    CL4'093I'
CVAMS094 DC    CL4'094I'
CVAMS313 DC    CL4'313I'
CVAMS600 DC    CL4'600I'
CVAMS602 DC    CL4'602I'
CVAMS603 DC    CL4'603I'
CVAMS606 DC    CL4'606I'
CVAMS607 DC    CL4'607I'
CVAMS608 DC    CL4'608I'
CVAMS609 DC    CL4'609I'
CVAMS610 DC    CL4'610I'
CVAMS611 DC    CL4'611I'
CVAMS612 DC    CL4'612I'
CVAMS613 DC    CL4'613I'
CVAMS614 DC    CL4'614I'
CVAMS615 DC    CL4'615I'
CVAMS616 DC    CL4'616I'
CVAMS629 DC    CL4'629I'
CVAMS630 DC    CL4'630I'
CVAMS631 DC    CL4'631I'
CVAMS673 DC    CL4'673I'
CVAMS688 DC    CL4'688I'
@00      EQU   00                      EQUATES FOR REGISTERS 0-15
@01      EQU   01
@02      EQU   02
@03      EQU   03
@04      EQU   04
@05      EQU   05
@06      EQU   06
@07      EQU   07
@08      EQU   08
@09      EQU   09
@10      EQU   10
@11      EQU   11
@12      EQU   12
@13      EQU   13
@14      EQU   14
@15      EQU   15
GPR00F   EQU   @00
GPR00P   EQU   @00
GPR01F   EQU   @01
GPR01P   EQU   @01
GPR02F   EQU   @02
GPR02P   EQU   @02
GPR03F   EQU   @03
GPR03P   EQU   @03
GPR04F   EQU   @04
GPR04P   EQU   @04
GPR05F   EQU   @05
GPR05P   EQU   @05
GPR06F   EQU   @06
GPR06P   EQU   @06
GPR07P   EQU   @07
GPR08P   EQU   @08
GPR09P   EQU   @09
GPR10P   EQU   @10
GPR11P   EQU   @11
GPR12P   EQU   @12
GPR13P   EQU   @13
GPR14F   EQU   @14
GPR14P   EQU   @14
GPR15F   EQU   @15
GPR15P   EQU   @15
RPHPTR   EQU   @01
LDPRMPTR EQU   @01
CVAR1    EQU   @01
CVAR0    EQU   @00
CVAR2    EQU   @02
CVAR3    EQU   @03
CVAWAPTR EQU   @06
CVAR7    EQU   @07
CVAWKRDT EQU   @08
NCSPLPTR EQU   @09
CVAR13   EQU   @13
CVAR14   EQU   @14
CVAR15   EQU   @15
EMCR2    EQU   @02
EMCR3    EQU   @03
REG1233  EQU   @01
EMCR13   EQU   @13
REG15233 EQU   @15
CVAR10   EQU   @10
CVAR11   EQU   @11
CVAR12   EQU   @12
CVAR4    EQU   @04
CVAR5    EQU   @05
EMCR0    EQU   @00
EMCR1    EQU   @01
EMCR10   EQU   @10
EMCR11   EQU   @11
EMCR12   EQU   @12
EMCR14   EQU   @14
EMCR15   EQU   @15
EMCR4    EQU   @04
EMCR5    EQU   @05
EMCR6    EQU   @06
EMCR7    EQU   @07
EMCR8    EQU   @08
EMCR9    EQU   @09
GPR07F   EQU   @07
GPR08F   EQU   @08
GPR09F   EQU   @09
GPR10F   EQU   @10
GPR11F   EQU   @11
GPR12F   EQU   @12
GPR13F   EQU   @13
ATCLCPTR EQU   1032
CVTMAP   EQU   0
CVTDAR   EQU   CVTMAP+72
CVTFLGS1 EQU   CVTDAR
CVTDCB   EQU   CVTMAP+116
CVTIERLC EQU   CVTMAP+144
CVTOPTA  EQU   CVTMAP+182
CVTOPTB  EQU   CVTMAP+183
CVTGTF   EQU   CVTMAP+236
CVTGTFST EQU   CVTGTF
CVTGTFS  EQU   CVTGTFST
CVTSTATE EQU   CVTGTFST
CVTTMODE EQU   CVTGTFST
CVTFORM  EQU   CVTGTFST
CVTAQAVT EQU   CVTMAP+240
CVTTCMFG EQU   CVTAQAVT
CVTVOLM2 EQU   CVTMAP+244
CVTTATA  EQU   CVTVOLM2
CVTTSKS  EQU   CVTTATA
CVTVOLF2 EQU   CVTTSKS
CVTTAT   EQU   CVTTATA+1
CVTATER  EQU   CVTMAP+248
CVTEXT1  EQU   CVTMAP+252
CVTPURG  EQU   CVTMAP+260
CVTQMSG  EQU   CVTMAP+268
CVTDMSR  EQU   CVTMAP+272
CVTRSV37 EQU   CVTDMSR
CVTDMSRF EQU   CVTRSV37
CVTERPV  EQU   CVTMAP+316
CVTINTLA EQU   CVTMAP+320
CVTAPF   EQU   CVTMAP+324
CVTEXT2  EQU   CVTMAP+328
CVTHJES  EQU   CVTMAP+332
CVTPGSIA EQU   CVTMAP+348
CVTA1F1  EQU   CVTMAP+356
CVTSYSK  EQU   CVTMAP+357
CVTVOLM1 EQU   CVTMAP+380
CVTVOLF1 EQU   CVTVOLM1
CVTATMCT EQU   CVTMAP+388
CVTXTNT1 EQU   0
CVTXTNT2 EQU   0
CVTDSSV  EQU   CVTXTNT2
CVTFLGBT EQU   CVTXTNT2+5
CVTQID   EQU   CVTXTNT2+24
CVTSHS   EQU   CVTXTNT2+40
CVTRV400 EQU   CVTXTNT2+52
CVTRV409 EQU   CVTXTNT2+53
CVTATCVT EQU   CVTXTNT2+64
CVTRV429 EQU   CVTXTNT2+84
CVTRV438 EQU   CVTXTNT2+85
CVTRV457 EQU   CVTXTNT2+112
CVTRV466 EQU   CVTXTNT2+113
CVTFIX   EQU   0
CVTRELNO EQU   CVTFIX+252
IOBPREFX EQU   0
IOBCFLG1 EQU   IOBPREFX
IOBSTDRD EQU   0
IOBFLAG1 EQU   IOBSTDRD
IOBCYCCK EQU   IOBFLAG1
IOBRSTRT EQU   IOBFLAG1
IOBFLAG2 EQU   IOBSTDRD+1
IOBPURGE EQU   IOBFLAG2
IOBRDHA0 EQU   IOBFLAG2
IOBSENS0 EQU   IOBSTDRD+2
IOBS0B7  EQU   IOBSENS0
IOBSENS1 EQU   IOBSTDRD+3
IOBECBPT EQU   IOBSTDRD+4
IOBFLAG3 EQU   IOBSTDRD+8
IOBFL3   EQU   IOBFLAG3
IOBCNC   EQU   IOBFL3
IOBICL   EQU   IOBFL3
IOBCSW   EQU   IOBSTDRD+9
IOBIOCSW EQU   IOBCSW
IOBSTBYT EQU   IOBIOCSW+3
IOBUSTAT EQU   IOBSTBYT
IOBCSTAT EQU   IOBSTBYT+1
IOBSTART EQU   IOBSTDRD+16
IOBDCBPT EQU   IOBSTDRD+20
IOBFLAG4 EQU   IOBDCBPT
IOBRESTR EQU   IOBSTDRD+24
IOBINCAM EQU   IOBSTDRD+28
IOBBTAMF EQU   IOBINCAM
IOSB     EQU   0
IOSFLA   EQU   IOSB
IOSACHN  EQU   IOSFLA
IOSFLB   EQU   IOSB+1
IOSFLC   EQU   IOSB+2
IOSDVALT EQU   IOSFLC
IOSPKEY  EQU   IOSB+12
IOSOPT   EQU   IOSB+14
IOSOPT2  EQU   IOSB+15
@NM00004 EQU   IOSB+20
IOSCSW   EQU   @NM00004+1
IOSTATUS EQU   IOSCSW+3
IOSIPIB  EQU   IOSB+44
IOSPATH  EQU   IOSB+86
IOSCHN   EQU   IOSPATH
IOSCKEY  EQU   IOSB+89
IOSEEKA  EQU   IOSB+100
IOSCCHH  EQU   IOSEEKA+3
IOSSKHH  EQU   IOSCCHH+2
SRBSECT  EQU   0
SRBFLC   EQU   SRBSECT+12
ISTRPH   EQU   0
RPHCNTL  EQU   ISTRPH
RPHFLAGS EQU   RPHCNTL+2
RPHAPTYP EQU   RPHFLAGS
RPHFSTLC EQU   RPHFLAGS
RPHFLGB  EQU   RPHCNTL+3
RPHRPHA  EQU   ISTRPH+4
RPHTSKID EQU   ISTRPH+8
RPHRESMA EQU   ISTRPH+16
RPHWPFLG EQU   RPHRESMA
RPHWT    EQU   RPHWPFLG
RPHPABOF EQU   ISTRPH+20
RPHMAJCB EQU   ISTRPH+21
RPHWEA   EQU   ISTRPH+24
RPHCSPA  EQU   RPHWEA
RPHSRPRM EQU   ISTRPH+28
RPHCRR   EQU   ISTRPH+32
RPHPABQA EQU   ISTRPH+36
RPHPABQP EQU   RPHPABQA+1
RPHWORK  EQU   ISTRPH+40
RPHSAVE1 EQU   RPHWORK
RPHSBITS EQU   RPHSAVE1+1
ISTPAB   EQU   0
PABWQCHN EQU   ISTPAB
PABWEQA  EQU   PABWQCHN
PABCHAIN EQU   PABWQCHN+4
PABCHNGP EQU   PABCHAIN+1
PABRPHFG EQU   ISTPAB+12
PABFLAGS EQU   PABRPHFG
PABERLCK EQU   PABFLAGS
PABERRLK EQU   PABERLCK
ISTDYPAB EQU   0
DYPPAB   EQU   ISTDYPAB+16
ISTPOHD  EQU   0
POHSTAT  EQU   ISTPOHD+1
ISTPFX   EQU   0
PFXID    EQU   ISTPFX
ISTNCSPL EQU   0
@NM00015 EQU   ISTNCSPL
NCSPFX   EQU   @NM00015
NCSPLVCD EQU   ISTNCSPL+17
NCSPLVBF EQU   ISTNCSPL+18
NCSPLVFL EQU   ISTNCSPL+20
NCSVDEL  EQU   NCSPLVFL
NCSVSTAT EQU   NCSPLVFL
NCSPLVF1 EQU   ISTNCSPL+21
NCSIORC  EQU   ISTNCSPL+23
NCSPLRID EQU   ISTNCSPL+28
NCSPLLID EQU   ISTNCSPL+36
NCSCRCMD EQU   ISTNCSPL+50
NCSPLRPT EQU   ISTNCSPL+52
NCSPLLPT EQU   ISTNCSPL+56
NCSPLCMD EQU   ISTNCSPL+60
NCSCMDA  EQU   NCSPLCMD
NCSCRFLG EQU   ISTNCSPL+67
NCSPLRAD EQU   ISTNCSPL+144
NCSIOCID EQU   ISTNCSPL+148
NCSPLCID EQU   NCSIOCID
NCSPLWKA EQU   ISTNCSPL+152
NCSPLCVT EQU   ISTNCSPL+156
NCSPLRPH EQU   ISTNCSPL+160
NCSPLFSB EQU   ISTNCSPL+168
NCSPLFL1 EQU   ISTNCSPL+176
NCSPL2IN EQU   NCSPLFL1
NCSPLSOM EQU   NCSPLFL1
NCSPLEBN EQU   NCSPLFL1
NCSPLNON EQU   NCSPLFL1
NCSPLPOS EQU   NCSPLFL1
NCSPLFL2 EQU   ISTNCSPL+177
NCSPLRIO EQU   NCSPLFL2
NCSPLDS  EQU   NCSPLFL2
NCSPLFL3 EQU   ISTNCSPL+178
NCSPLANS EQU   NCSPLFL3
NCSANS   EQU   NCSPLFL3
NCSPLFL4 EQU   ISTNCSPL+179
NCSPLFL5 EQU   ISTNCSPL+181
NCSPLOLN EQU   ISTNCSPL+182
NCSPLP1  EQU   ISTNCSPL+184
NCSPLP2  EQU   ISTNCSPL+188
NCSPLP3  EQU   ISTNCSPL+192
NCSPLWEL EQU   ISTNCSPL+200
NCSPLRUO EQU   ISTNCSPL+208
NCSPLRUI EQU   ISTNCSPL+212
NCSPLAPP EQU   ISTNCSPL+216
NCSPLMID EQU   ISTNCSPL+232
NCSSENSE EQU   ISTNCSPL+244
NCSCRDTE EQU   ISTNCSPL+264
NCSCRMSK EQU   ISTNCSPL+268
NCSCHKPT EQU   NCSCRMSK
NCSACTV  EQU   NCSCHKPT
NCSPACTV EQU   NCSCHKPT
NCSANSMD EQU   NCSCHKPT+1
NCSCRMOD EQU   NCSCRMSK+2
NCSAIMOD EQU   NCSCRMOD
NCSPTMOD EQU   NCSCRMOD
NCSPLSID EQU   ISTNCSPL+271
NCSPLSTA EQU   NCSPLSID
NCSPLPHD EQU   NCSPLSID+1
NCSAPP   EQU   0
NCSAPBUE EQU   NCSAPP+88
NCSUSSRU EQU   0
ISTDEVCH EQU   0
DEVSHCH  EQU   ISTDEVCH
DEVCHAR  EQU   DEVSHCH
DEVSUBND EQU   DEVCHAR
DEVTCODE EQU   ISTDEVCH+1
DEVFLAGS EQU   ISTDEVCH+3
DEVFCCTL EQU   DEVFLAGS
DEVCHAR3 EQU   DEVFLAGS
ISTLOK   EQU   0
LOKCHN   EQU   ISTLOK+1
LOKCHNG  EQU   LOKCHN
@NM00021 EQU   LOKCHNG+2
ISTRPRE  EQU   0
RPRNAME  EQU   ISTRPRE
RPRCOMID EQU   ISTRPRE+8
RPRDAF   EQU   RPRCOMID+2
RPRELEN  EQU   ISTRPRE+16
RPRPELEN EQU   ISTRPRE+18
RPRENTRY EQU   ISTRPRE+20
RPRFLAGA EQU   ISTRPRE+21
RPRINV   EQU   RPRFLAGA
RPRENTED EQU   RPRFLAGA
RPRVRYPD EQU   RPRFLAGA
RPRLIVE  EQU   RPRFLAGA
RPRFLAGB EQU   ISTRPRE+22
RPRVIODN EQU   RPRFLAGB
RPRONLIN EQU   RPRFLAGB
RPRCAUSE EQU   ISTRPRE+23
RPRCRCPT EQU   RPRCAUSE
RPRHDTYP EQU   ISTRPRE+27
RPRNSNEA EQU   ISTRPRE+36
RPRNCBA  EQU   ISTRPRE+40
RPRDEVCH EQU   ISTRPRE+44
RPRPTHCT EQU   ISTRPRE+60
RPRFLAGD EQU   ISTRPRE+61
RPRINIMM EQU   RPRFLAGD
RPRFLAGC EQU   ISTRPRE+62
ISTRCPRE EQU   0
RCPPMODE EQU   ISTRCPRE+91
RCPLGNIN EQU   ISTRCPRE+92
ISTRDT   EQU   0
RDTPLEN  EQU   ISTRDT+72
RDTPRIOR EQU   RDTPLEN
RDTLGCT  EQU   ISTRDT+90
RDTFLAGB EQU   ISTRDT+91
RDTVPAB  EQU   ISTRDT+92
RDTVYRPH EQU   ISTRDT+108
RDTSTCNT EQU   ISTRDT+112
ISTRAP   EQU   0
RAPFLG   EQU   ISTRAP+108
RAPFLGB  EQU   ISTRAP+109
RAPFLGC  EQU   ISTRAP+110
ISTRLC   EQU   0
RLCADR   EQU   ISTRLC+72
RLCFLAG  EQU   RLCADR
RLCRBISA EQU   RLCFLAG
ISTRRN   EQU   0
RRNADR   EQU   ISTRRN+136
RRNFLAG  EQU   RRNADR
RRNLCSIP EQU   RRNFLAG
RRNLCDIP EQU   RRNFLAG
RRNUCBAD EQU   RRNADR+1
RRNRDF   EQU   ISTRRN+172
RRNRDFA  EQU   RRNRDF
RRNRBREM EQU   RRNRDFA
RRNRDFB  EQU   RRNRDF+1
RRNCMF   EQU   ISTRRN+176
RRNCMFA  EQU   RRNCMF
RRNCMFB  EQU   RRNCMF+1
RRNCMFC  EQU   RRNCMF+2
RRNCMFD  EQU   RRNCMF+3
RRNNMDPD EQU   ISTRRN+192
RRNDELAY EQU   ISTRRN+206
RRNHPRE  EQU   ISTRRN+216
RRNRPLPT EQU   ISTRRN+232
ISTRGP   EQU   0
RGPFLG   EQU   ISTRGP+72
RGPADIL  EQU   RGPFLG
ISTRLN   EQU   0
RLNADR   EQU   ISTRLN+72
RLNFLAG  EQU   RLNADR
RLNRBISA EQU   RLNFLAG
RLNUCBAD EQU   RLNADR+1
RLNSTAT1 EQU   ISTRLN+86
RLNSTAT2 EQU   ISTRLN+87
RLNRDF   EQU   ISTRLN+88
RLNRDFA  EQU   RLNRDF
RLNRACNT EQU   RLNRDFA
RLNRACAT EQU   RLNRACNT
RLNRACAN EQU   RLNRACNT
RLNPORT  EQU   RLNRDFA
RLNIDV   EQU   RLNRDFA
RLNRAPEP EQU   RLNRDFA
RLNRDFB  EQU   RLNRDF+1
RLNANSWR EQU   RLNRDFB
RLNTTV   EQU   RLNRDFB
RLNRATRN EQU   RLNRDFB
RLNCRFLG EQU   ISTRLN+102
RLNACTLN EQU   RLNCRFLG
RLNSWNCP EQU   RLNCRFLG
RLNLSCMD EQU   RLNCRFLG
RLNSWEP  EQU   RLNCRFLG
ISTRPT   EQU   0
RPTLNCID EQU   ISTRPT+116
RPTLNDAF EQU   RPTLNCID+2
RPTCTNM  EQU   ISTRPT+120
RPTDITT  EQU   ISTRPT+128
RPTDIVT  EQU   RPTDITT
RPTUTERM EQU   ISTRPT+136
RPTFLAG1 EQU   ISTRPT+140
RPTVRYPD EQU   RPTFLAG1
RPTONLIN EQU   RPTFLAG1
RPTVIODN EQU   RPTFLAG1
RPTISTAT EQU   RPTFLAG1
RPTPTHCT EQU   ISTRPT+146
ISTRCL   EQU   0
RCLADR   EQU   ISTRCL+72
RCLFLAG  EQU   RCLADR
RCLRBISA EQU   RCLFLAG
ISTRTR   EQU   0
RTRADR   EQU   ISTRTR+124
RTRFLAG  EQU   RTRADR
RTRRBISA EQU   RTRFLAG
RTRVTERM EQU   RTRFLAG
RTRRDFA  EQU   ISTRTR+136
RTRRAALL EQU   RTRRDFA
RTRRDFB  EQU   ISTRTR+137
RTRRDFC  EQU   ISTRTR+138
RTRRDFD  EQU   ISTRTR+139
RTRRDFE  EQU   ISTRTR+140
RTRRDFF  EQU   ISTRTR+141
RTRCRFLG EQU   ISTRTR+143
RTRLSCMD EQU   RTRCRFLG
RTRBSCID EQU   ISTRTR+188
ISTRIN   EQU   0
RINDFD   EQU   ISTRIN+124
RINREMPO EQU   RINDFD
RINNODEF EQU   RINDFD
RINLDISC EQU   RINDFD
RINNODID EQU   ISTRIN+125
RINRLDAF EQU   ISTRIN+126
RINREMOT EQU   ISTRIN+128
RINVPAB  EQU   ISTRIN+132
RINRPHCN EQU   ISTRIN+136
RINNCSPL EQU   ISTRIN+140
RINCNCNT EQU   ISTRIN+144
ISTRDS   EQU   0
RDSCTTRM EQU   ISTRDS+72
RDSADDOT EQU   ISTRDS+76
ISTDOT   EQU   0
DOTADTRM EQU   ISTDOT
ISTRCC   EQU   0
RCCFLAG  EQU   ISTRCC+73
RCCRBISA EQU   RCCFLAG
RCCCUDIE EQU   RCCFLAG
RCCERPIP EQU   RCCFLAG
RCCFLAGB EQU   ISTRCC+74
RCCDSTCT EQU   RCCFLAGB
RCCSTAID EQU   ISTRCC+78
RCCID48  EQU   RCCSTAID+2
RCCVPAB  EQU   ISTRCC+88
RCCDPAB  EQU   ISTRCC+92
RCCEPAB  EQU   ISTRCC+96
RCCCRFLG EQU   ISTRCC+108
ISTRLU   EQU   0
RLUFLAG  EQU   ISTRLU+125
RLURBISA EQU   RLUFLAG
RLUCRFLG EQU   ISTRLU+126
RLUPACE  EQU   ISTRLU+132
RLUNCPPC EQU   ISTRLU+134
RLUUSSTB EQU   ISTRLU+140
RLUMODET EQU   ISTRLU+152
ISTRPX   EQU   0
ISTRLX   EQU   0
RLXFLAGA EQU   ISTRLX+76
ISTRSW   EQU   0
ISTRDA   EQU   0
RDAADR   EQU   ISTRDA+72
RDAFLAG  EQU   RDAADR
RDAUCBAD EQU   RDAADR+1
ISTRLS   EQU   0
ISTDNT   EQU   0
ISTGNT   EQU   0
ISTPAT   EQU   0
PATFLAGA EQU   ISTPAT+7
ISTATCVT EQU   0
ATCCOM   EQU   ISTATCVT
ATCSTAT  EQU   ATCCOM
ATCSTAT1 EQU   ATCSTAT
ATCSTFLG EQU   ATCSTAT+1
ATCPOFLG EQU   ATCSTAT+2
ATCSTAT4 EQU   ATCSTAT+3
ATCCONFT EQU   ATCCOM+112
ATCIOTRC EQU   ATCCOM+140
ATCTHTRC EQU   ATCIOTRC
ATCGTSTR EQU   ATCCOM+164
ATCVTMID EQU   ATCCOM+240
ATCCIDM  EQU   ATCCOM+266
ATCCDADD EQU   ISTATCVT+276
ATCCDDEL EQU   ISTATCVT+280
ATCCDFND EQU   ISTATCVT+284
ATCCSMR  EQU   ISTATCVT+296
ATCSHRFG EQU   ISTATCVT+316
ATCMSGP  EQU   ISTATCVT+344
ATCHPGM  EQU   ISTATCVT+384
ATCAP33  EQU   ISTATCVT+444
ATCAP36  EQU   ISTATCVT+452
ATCCDFIN EQU   ISTATCVT+460
ATCCDFDN EQU   ISTATCVT+464
ATCVOCLK EQU   ISTATCVT+468
ATCRDTLK EQU   ISTATCVT+472
ATCVLCNT EQU   ISTATCVT+772
ATCRNO   EQU   ISTATCVT+788
ATCSOPD  EQU   ISTATCVT+792
ATCSIPD  EQU   ISTATCVT+800
ATCSECST EQU   ISTATCVT+812
ATCSTAT2 EQU   ISTATCVT+818
ATCINCW3 EQU   ISTATCVT+832
ATCVTBAM EQU   ISTATCVT+908
@NM00035 EQU   ATCVTBAM+3
ATCAOSM  EQU   ISTATCVT+912
ATCGSRBQ EQU   ATCAOSM+4
ATCGSRBG EQU   ATCGSRBQ
ATCAP31  EQU   ATCAOSM+24
ATCAP32  EQU   ATCAOSM+28
ATCAP34  EQU   ATCAOSM+32
ATCICAPP EQU   ATCAOSM+100
ATCLDAPP EQU   ATCAOSM+120
ATCDAPVT EQU   ATCAOSM+140
ATCAP37  EQU   ATCAOSM+264
ATCCRA   EQU   ATCAOSM+280
ATCCRACN EQU   ATCCRA+4
ATCSRB   EQU   ATCAOSM+288
ATCSRBCN EQU   ATCSRB+4
ATCCRPL  EQU   ATCAOSM+296
ATCRPLCN EQU   ATCCRPL+4
ATCSQAFR EQU   ATCAOSM+304
ATCORTBC EQU   ATCSQAFR+4
ATCORSRB EQU   ATCORTBC
@NM00037 EQU   ATCAOSM+332
ATCVTFLG EQU   ATCAOSM+392
ATCZFLAG EQU   ATCAOSM+588
ISTAVT   EQU   0
ISTAS49  EQU   ISTAVT+4
ISTLDPRM EQU   0
LDPFG    EQU   ISTLDPRM+20
LDPFB2   EQU   ISTLDPRM+21
ISTCONFT EQU   0
CONHALT  EQU   ISTCONFT+106
CONFLAGS EQU   ISTCONFT+110
CONDSFLG EQU   CONFLAGS
CONOPTFL EQU   CONFLAGS+1
CONSTAT  EQU   CONFLAGS+2
CONBUFF  EQU   CONFLAGS+3
CONFLG01 EQU   ISTCONFT+416
CONSCPID EQU   ISTCONFT+1356
CONSTAID EQU   CONSCPID+3
ISTDIVTH EQU   0
DIVNUME  EQU   ISTDIVTH
DIVIDLEN EQU   ISTDIVTH+4
ISTDTE   EQU   0
DTELCTI  EQU   ISTDTE
DTERDTEA EQU   ISTDTE+1
ISTDVE   EQU   0
DVERDTEA EQU   ISTDVE
DVEBSCID EQU   ISTDVE+4
ISTLCCW  EQU   0
LCCWOP   EQU   ISTLCCW
LCCWRWOP EQU   LCCWOP
LCCWCTL  EQU   LCCWRWOP
LCCWFLAG EQU   ISTLCCW+1
LCCWLSI  EQU   LCCWFLAG
ISTLCPB  EQU   0
LCPREQTG EQU   ISTLCPB+2
LCPFLAGS EQU   LCPREQTG
LCPZF001 EQU   LCPFLAGS
LCPZRT02 EQU   LCPZF001
LCPZF002 EQU   LCPFLAGS
LCPZRT03 EQU   LCPZF002
LCPZF003 EQU   LCPFLAGS
LCPZRT04 EQU   LCPZF003
LCPZF004 EQU   LCPFLAGS
LCPZRT05 EQU   LCPZF004
LCPZRT06 EQU   LCPFLAGS
LCPZRT07 EQU   LCPFLAGS
LCPMNRCD EQU   LCPREQTG+1
LCPZRT08 EQU   LCPMNRCD
LCPZRT09 EQU   LCPMNRCD
LCPCHAIN EQU   ISTLCPB+4
LCPCHAI1 EQU   LCPCHAIN
LCPRUCNT EQU   ISTLCPB+8
LCPFLAG2 EQU   ISTLCPB+9
LCPTLBPI EQU   LCPFLAG2
LCPFID0  EQU   LCPFLAG2
LCPSEQ   EQU   ISTLCPB+10
LCPCID   EQU   ISTLCPB+16
LCPFDBA  EQU   ISTLCPB+24
LCPFLG1  EQU   ISTLCPB+37
LCPFLCCW EQU   ISTLCPB+40
LCPLCCW  EQU   ISTLCPB+48
LCPPABA  EQU   LCPLCCW+4
LCPRPHA  EQU   LCPPABA
ISTZSAVE EQU   0
ZSAZSVBC EQU   ISTZSAVE
ZSAZSVMS EQU   ZSAZSVBC
ISTPFCRR EQU   0
PFCCRR   EQU   ISTPFCRR
PFCCRRID EQU   PFCCRR
PFCCRRLN EQU   PFCCRR+2
PFCHDR   EQU   ISTPFCRR+4
PFCCRRO  EQU   PFCHDR
PFCFRRO  EQU   PFCHDR+4
ISTCFCRR EQU   0
CFCAUDIT EQU   ISTCFCRR
CFCNTRD  EQU   CFCAUDIT
CFCCRT   EQU   CFCAUDIT+1
ISTZCRR  EQU   0
ZCRCRR   EQU   ISTZCRR
ZCRFLGS1 EQU   ISTZCRR+12
ZCRFLGS2 EQU   ISTZCRR+13
ZCRSWFLD EQU   ISTZCRR+14
ZCRENDSH EQU   ZCRSWFLD
ZCRNDLCP EQU   ZCRSWFLD
ZCRRESET EQU   ZCRSWFLD
ZCRFLGS3 EQU   ISTZCRR+15
ZCRGENSW EQU   ISTZCRR+16
ZCRPFLGS EQU   ISTZCRR+17
ZCRIBPR  EQU   ISTZCRR+18
ZCRSCPSW EQU   ISTZCRR+19
ZCRPARMS EQU   ISTZCRR+24
ZCRFBPTR EQU   ZCRPARMS
ZCRDFRDA EQU   ZCRPARMS+10
ZCRPCOD1 EQU   ZCRPARMS+12
ZCRPLSBF EQU   ZCRPCOD1
ZCRPCOD2 EQU   ZCRPARMS+13
ZCRSVRTN EQU   ISTZCRR+56
ZCRWKARA EQU   ISTZCRR+156
ZCRCIDSV EQU   ISTZCRR+192
ZCRAUDIT EQU   ISTZCRR+440
ZCRENTER EQU   ZCRAUDIT+5
ZCRLCPB  EQU   ISTZCRR+480
ZCRRHRU  EQU   ZCRLCPB
ISTASCRR EQU   0
ASCFLAGS EQU   ISTASCRR+16
ASCFLG1  EQU   ASCFLAGS
ASCFLG2  EQU   ASCFLAGS+2
ASCFLG3  EQU   ASCFLAGS+4
ASCUSRGS EQU   ISTASCRR+28
ISTAPCRR EQU   0
APCATFLG EQU   ISTAPCRR+16
APCRFLG  EQU   ISTAPCRR+18
APCSAVE  EQU   ISTAPCRR+44
APCCOMF  EQU   ISTAPCRR+116
APCCOMF1 EQU   APCCOMF
APC31FLG EQU   ISTAPCRR+132
APC52FLG EQU   ISTAPCRR+133
APC53FLG EQU   ISTAPCRR+134
APC54FLG EQU   ISTAPCRR+135
APC57FLG EQU   ISTAPCRR+136
ISTCRA   EQU   0
CRABASIC EQU   ISTCRA
CRAHDR   EQU   CRABASIC
CRACRR   EQU   CRAHDR
CRALKACT EQU   CRABASIC+8
CRAL2PTR EQU   CRABASIC+16
CRAL3PTR EQU   CRABASIC+20
CRASVC   EQU   ISTCRA+848
CRABUFA  EQU   CRASVC+68
ISTCNSTA EQU   0
CNSTFLDA EQU   ISTCNSTA+16
CNSTFLDB EQU   ISTCNSTA+19
ISTVYCRR EQU   0
VYCAUDIT EQU   ISTVYCRR+22
VYCNTRD  EQU   VYCAUDIT
NINCVA   EQU   VYCNTRD
VYCCRT   EQU   VYCAUDIT+12
CINCVA   EQU   VYCCRT
VYCRRCW3 EQU   ISTVYCRR+118
ISTGTNCS EQU   0
GTNCSAD  EQU   ISTGTNCS
GTNCSFLG EQU   ISTGTNCS+4
GTNCSREQ EQU   GTNCSFLG
ISTNCB   EQU   0
NCBFMCBA EQU   ISTNCB+16
NCBFLAGS EQU   ISTNCB+24
NCBFRAS  EQU   NCBFLAGS+1
NCBFTRIO EQU   NCBFRAS
NCBFLAG1 EQU   NCBFLAGS+2
NCBCONF  EQU   NCBFLAG1
ISTCCNCB EQU   0
CCNFLGA  EQU   ISTCCNCB+48
CCNSTART EQU   CCNFLGA
ISTPROCD EQU   0
PROPROC  EQU   ISTPROCD
PROPROC1 EQU   PROPROC
PROPROC2 EQU   PROPROC+1
PROPROC3 EQU   PROPROC+2
PROPROC4 EQU   PROPROC+3
PROPROCS EQU   0
PROSETMS EQU   PROPROCS+1
PROSETM2 EQU   PROSETMS
PROSETM3 EQU   PROSETMS+1
PROSETM4 EQU   PROSETMS+2
ISTFMCB  EQU   0
FMCSTAT  EQU   ISTFMCB+28
FMCDEVOF EQU   FMCSTAT
FMCSTAT1 EQU   ISTFMCB+29
FMCCMDFL EQU   ISTFMCB+31
FMCCMPS1 EQU   ISTFMCB+36
FMCVWT   EQU   ISTFMCB+44
FMCSIPA  EQU   ISTFMCB+148
FMCNXOSQ EQU   ISTFMCB+152
FMCNXCFM EQU   FMCNXOSQ
FMCNXOSC EQU   FMCNXOSQ+2
FMCSSTAT EQU   ISTFMCB+159
FMCPACE  EQU   ISTFMCB+160
FMCPACEN EQU   FMCPACE
FMCPACEM EQU   FMCPACE+1
FMCPACPC EQU   FMCPACE+2
FMCCVAL  EQU   FMCPACE+3
FMCOBCE  EQU   FMCCVAL
FMCCLEXT EQU   ISTFMCB+164
FMCRPLA  EQU   FMCCLEXT
FMCFBA   EQU   FMCCLEXT+4
FMCCMPS2 EQU   FMCCLEXT+16
FMCFLGA  EQU   FMCCMPS2
FMCFLGCL EQU   FMCCMPS2+1
FMCPSCMD EQU   FMCCMPS2+2
FMCPSTAT EQU   FMCCMPS2+3
FMCSTAT2 EQU   ISTFMCB+186
FMCMODEB EQU   ISTFMCB+189
FMCCLSEQ EQU   ISTFMCB+190
FMCRRESP EQU   ISTFMCB+195
FMCSSEGQ EQU   ISTFMCB+200
FMCFBAS  EQU   ISTFMCB+216
FMCZV002 EQU   FMCFBAS
FMCSNCTL EQU   ISTFMCB+224
FMCSCFLG EQU   FMCSNCTL
FMCVS1   EQU   ISTFMCB+232
FMCZFLAG EQU   FMCVS1
FMCZF006 EQU   FMCZFLAG
FMCLBXM  EQU   FMCVS1+12
FMCSHEAQ EQU   FMCLBXM
FMCLCPBQ EQU   FMCVS1+16
FMCLCPAQ EQU   FMCVS1+20
FMCSEQ1  EQU   FMCVS1+34
FMCZFLG2 EQU   FMCVS1+35
FMCCVFLG EQU   FMCVS1+44
FMCFLAG  EQU   0
FMCFLGB  EQU   FMCFLAG
ISTRH    EQU   0
RHFLAGS  EQU   ISTRH
RH1      EQU   RHFLAGS
RH2      EQU   RHFLAGS+1
RHRETRY  EQU   RH2
RHRSVD1  EQU   RH2
RH3      EQU   RHFLAGS+2
ISTRU    EQU   0
RUDATA   EQU   ISTRU
ISTRUB   EQU   0
NSRUNA5  EQU   0
ISTINCW3 EQU   0
CVAMSGID EQU   0
CVAWKA   EQU   0
CVASVARA EQU   0
CVASVBKP EQU   CVASVARA+4
CVASVFWP EQU   CVASVARA+8
CVACVOWK EQU   0
ISTSDCCF EQU   0
ISTSDCCR EQU   0
FMZL0067 EQU   0
ISTAPC37 EQU   0
FMZL0139 EQU   0
ISTWKE   EQU   0
WKECHAIN EQU   ISTWKE+4
WKEFLAGS EQU   WKECHAIN
FMZL0184 EQU   0
FMZL0203 EQU   0
FMZL0208 EQU   0
FMZL0213 EQU   0
FMZL0223 EQU   0
@NM00099 EQU   0
CMZID233 EQU   @NM00099
@NM00100 EQU   @NM00099+4
CMZRL233 EQU   @NM00100
CMZRA233 EQU   @NM00100+1
CMZEA233 EQU   @NM00099+8
CMZVP233 EQU   @NM00099+12
CMZSA233 EQU   0
CMTA233  EQU   0
ISTAPC34 EQU   0
ISTSDCCA EQU   0
ISTSDCCD EQU   0
ISTSDCCN EQU   0
CVTS01   EQU   CVTPGSIA
CVTLPDIA EQU   CVTS01+12
CVTDIRST EQU   CVTLPDIA
CVTSLIDA EQU   CVTS01+24
CVTCTLFG EQU   CVTS01+50
CVTRV210 EQU   CVTS01+424
CVTRV219 EQU   CVTS01+425
CVTRV228 EQU   CVTS01+426
CVTRV237 EQU   CVTS01+427
CVTMFRTR EQU   CVTS01+452
CVTRV262 EQU   CVTS01+468
CVTRV271 EQU   CVTS01+469
CVTRV280 EQU   CVTS01+470
CVTRV289 EQU   CVTS01+471
CVTGSDA  EQU   CVTS01+600
IOBORG01 EQU   IOBPREFX+8
IOBNIOBA EQU   IOBORG01
IOBNFLG1 EQU   IOBNIOBA
IOBPRTOV EQU   IOBNFLG1
IOBORG02 EQU   IOBPREFX+8
IOBDQADA EQU   IOBORG02
IOBDEQIN EQU   IOBDQADA
IOBORG03 EQU   IOBPREFX+12
IOBORG04 EQU   IOBINCAM
IOBORG12 EQU   IOBINCAM
IOBFL4   EQU   IOBORG12
IOBEXTEN EQU   IOBSTDRD+32
IOBSEEK  EQU   IOBEXTEN
IOBBB    EQU   IOBSEEK+1
IOBCC    EQU   IOBSEEK+3
IOBHH    EQU   IOBSEEK+5
IOBORG05 EQU   IOBEXTEN
IOBORG06 EQU   IOBEXTEN
IOBNXTPT EQU   IOBORG06+4
IOBSTATA EQU   IOBNXTPT
IOBORG07 EQU   IOBEXTEN+8
W1IEXTEN EQU   IOBORG07
IOBORG08 EQU   IOBEXTEN+8
IOBINDCT EQU   IOBORG08+4
IOBUNSQR EQU   IOBORG08+5
IOBFCHAD EQU   IOBORG08+8
IOBORG09 EQU   IOBEXTEN+8
IOBDPLAD EQU   IOBORG09+4
IOBDTYPE EQU   IOBORG09+8
IOBDTYP2 EQU   IOBORG09+9
IOBDSTAT EQU   IOBORG09+10
IOBSTAT1 EQU   IOBDSTAT
IOBORG10 EQU   IOBEXTEN+8
IOBSEEK2 EQU   IOBORG10
IOBORG11 EQU   IOBEXTEN
IOBERCT  EQU   IOBORG11
IOBUCBXV EQU   IOBERCT
IOBNAME  EQU   IOBORG11+4
IOBORG13 EQU   IOBEXTEN
IOBSKADR EQU   IOBORG13
IOSATTSC EQU   IOSIPIB
IOSWTOWA EQU   IOSIPIB
IOSPCISC EQU   IOSIPIB
LCPZTIE  EQU   LCPCID
LCPZSNAM EQU   LCPZTIE+8
ISTSENRU EQU   RUDATA
SRUSENSE EQU   ISTSENRU
SRUSENS1 EQU   SRUSENSE
SRUSENS2 EQU   SRUSENSE+2
ISTSRU   EQU   ISTRUB
SRUDATA  EQU   ISTSRU+1
SRUTYPE  EQU   SRUDATA
SRULDID  EQU   SRUDATA+1
SRUSPSN  EQU   SRULDID
ISTNSRU  EQU   ISTRUB
NSRUNETS EQU   ISTNSRU
NSRUID   EQU   NSRUNETS
NSRUSUB  EQU   NSRUNETS+1
NSRURCD  EQU   NSRUNETS+2
NSRUDATA EQU   ISTNSRU+3
NSRUHOOK EQU   NSRUDATA
NSSSVRU  EQU   NSRUDATA
NSSSVDAF EQU   NSSSVRU
NSSSVT   EQU   NSSSVRU+2
NSSSVNOD EQU   NSSSVRU+3
NSSSVT3  EQU   NSSSVNOD
NSSSVT3C EQU   NSSSVT3+2
NSSSVT3G EQU   NSSSVT3+5
NSSSVT4  EQU   NSSSVNOD
NSSSVT5  EQU   NSSSVNOD
NSSSVT5A EQU   NSSSVT5
NSRUDAT1 EQU   NSRUDATA
NSRUDAT2 EQU   NSRUDAT1+2
ISTTRRU  EQU   NSRUDAT2
TRRTYPE  EQU   ISTTRRU
ISTCTDRU EQU   NSRUDAT2
ISTINORU EQU   NSRUDAT2
SRUDAT1  EQU   SRUDATA
SRUDAT1L EQU   SRUDAT1+1
SRUDAT2  EQU   SRUDATA
ISTMRU   EQU   ISTRUB
SRUDATA3 EQU   SRUDATA
SRUDATA4 EQU   SRUDATA
NSRUDAT3 EQU   NSRUDAT2
NSRUDAT4 EQU   NSRUDAT2
NSRUDAT5 EQU   NSRUDAT2
NSRUDAT6 EQU   NSRUDAT2
NSRUDAT7 EQU   NSRUDAT2
NSRUDIL  EQU   NSRUDAT2
NSRUDILB EQU   NSRUDIL+1
NSRUNA   EQU   NSRUDAT2
NSRUNA2  EQU   NSRUNA+1
NSRUCLSP EQU   NSRUDAT2
NSRUOH1  EQU   NSRUDAT2
NSRUDAT8 EQU   NSRUDATA
ISTUNBRU EQU   SRUTYPE
CMZCIDM  EQU   ATCCIDM
RTRDNCBA EQU   ISTRTR+40
SRB      EQU   SRBSECT
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS
UNBTYPE  EQU   ISTUNBRU
NSRUDA8T EQU   NSRUDAT8
NSRUOHID EQU   NSRUOH1
NSRULSV  EQU   NSRUCLSP
NSRUNA4  EQU   NSRUNA+2
NSRUNA3  EQU   NSRUNA2
NSRUNA1  EQU   NSRUNA
NSRUDILF EQU   NSRUDIL+4
NSRUDILE EQU   NSRUDIL+3
NSRUDILD EQU   NSRUDIL+2
NSRUDILC EQU   NSRUDILB
@NM00079 EQU   NSRUDILB
NSRUDILA EQU   NSRUDIL
NSRUDA7T EQU   NSRUDAT7
NSRUDA6L EQU   NSRUDAT6+4
NSRUDA6S EQU   NSRUDAT6
NSRUDA5E EQU   NSRUDAT5
NSRUDA4T EQU   NSRUDAT4
NSRUDA3S EQU   NSRUDAT3
SRUDAT4D EQU   SRUDATA4
SRUDAT3I EQU   SRUDATA3
MRUDATA  EQU   ISTMRU+9
MRURESP  EQU   ISTMRU+7
MRUMODIF EQU   ISTMRU+6
MRUCMND  EQU   ISTMRU+5
MRUDAF   EQU   ISTMRU+3
MRUREQ   EQU   ISTMRU+2
MRUPREF  EQU   ISTMRU
SRUDAT2N EQU   SRUDAT2+1
SRUDAT2T EQU   SRUDAT2
SRUDAT1I EQU   SRUDAT1+2
SRUTSPRO EQU   SRUDAT1L
SRUFMPRO EQU   SRUDAT1L
SRUDAT1T EQU   SRUDAT1
INORUET  EQU   ISTINORU
CTDRUSTA EQU   ISTCTDRU
TRRDATA  EQU   ISTTRRU+4
TRRSTAT  EQU   ISTTRRU+3
TRRPEP   EQU   ISTTRRU+2
TRRTIME  EQU   ISTTRRU+1
@NM00078 EQU   TRRTYPE
TRRFMT2  EQU   TRRTYPE
@NM00077 EQU   TRRTYPE
NSRUDAF  EQU   NSRUDAT1
NSSSVT4D EQU   NSSSVT4+3
NSSSVT4C EQU   NSSSVT4+2
NSSSVT4B EQU   NSSSVT4+1
NSSSVT4A EQU   NSSSVT4
NSSSVT3K EQU   NSSSVT3+8
NSSSVT3J EQU   NSSSVT3+7
NSSSVT3I EQU   NSSSVT3+6
@NM00076 EQU   NSSSVT3G
NSSSVT3H EQU   NSSSVT3G
NSSSVT3F EQU   NSSSVT3+4
NSSSVT3E EQU   NSSSVT3+3
@NM00075 EQU   NSSSVT3C
NSSSVT3D EQU   NSSSVT3C
NSSSVT3B EQU   NSSSVT3+1
NSSSVT3A EQU   NSSSVT3
NSRUHKTY EQU   NSRUHOOK
SRURSV01 EQU   SRULDID+4
SRUPSSN  EQU   SRULDID+2
SRUDFCLV EQU   SRUSPSN
@NM00074 EQU   SRUTYPE
SRUPSAC  EQU   SRUTYPE
SRUSPAC  EQU   SRUTYPE
SRUQSREQ EQU   ISTSRU
SENRU    EQU   ISTSENRU+4
SRUSNS4  EQU   SRUSENS2+1
SRUSNS3  EQU   SRUSENS2
SRUSNST  EQU   SRUSENS1+1
SRUSNS1  EQU   SRUSENS1
LCPZTRV4 EQU   LCPZSNAM+4
LCPZTRV1 EQU   LCPZSNAM
LCPZSNA  EQU   LCPZTIE+4
LCPZFMCA EQU   LCPZTIE
IOSPCIWA EQU   IOSPCISC+44
IOSPCIRS EQU   IOSPCISC+8
@NM00009 EQU   IOSPCISC+4
@NM00008 EQU   IOSPCISC
IOSWRNDR EQU   IOSWTOWA+4
IOSWTOPT EQU   IOSWTOWA+3
IOSWTOCP EQU   IOSWTOWA+2
IOSWTOCH EQU   IOSWTOWA
IOSATTWA EQU   IOSATTSC+40
@NM00007 EQU   IOSATTSC+24
IOSATTSN EQU   IOSATTSC
IOBSKSS  EQU   IOBSKADR+3
IOBSK0   EQU   IOBSKADR+2
IOBSKTT  EQU   IOBSKADR+1
IOBSKRV  EQU   IOBSKADR
IOBCSWSV EQU   IOBORG11+17
IOBSENSV EQU   IOBORG11+16
IOBRCD   EQU   IOBORG11+12
IOBMDREC EQU   IOBORG11+8
IOBNAMEA EQU   IOBNAME+1
IOBNAMSZ EQU   IOBNAME
IOBERCTA EQU   IOBERCT+1
IOBRTYPE EQU   IOBUCBXV
IOBRDCHP EQU   IOBORG10+20
IOBNEXTA EQU   IOBORG10+16
IOBREADA EQU   IOBORG10+12
IOBBUFC  EQU   IOBORG10+8
IOBSK2R  EQU   IOBSEEK2+7
IOBSK2HH EQU   IOBSEEK2+5
IOBSK2CC EQU   IOBSEEK2+3
IOBSK2BB EQU   IOBSEEK2+1
IOBSK2M  EQU   IOBSEEK2
IOBCHNPR EQU   IOBORG09+40
IOBDNCRF EQU   IOBORG09+32
IOBRSV35 EQU   IOBORG09+24
IOBDQPTR EQU   IOBORG09+20
IOBRSV34 EQU   IOBORG09+18
IOBDBYTN EQU   IOBORG09+16
IOBDCPND EQU   IOBORG09+12
IOBSTAT2 EQU   IOBDSTAT+1
IOBSIORT EQU   IOBSTAT1
IOBADDVU EQU   IOBSTAT1
IOBBUFF  EQU   IOBSTAT1
IOBENQUE EQU   IOBSTAT1
IOBPASS2 EQU   IOBSTAT1
IOBSYNCH EQU   IOBSTAT1
IOBNEWVL EQU   IOBSTAT1
IOBABNRM EQU   IOBSTAT1
IOBRELEX EQU   IOBDTYP2
IOBADDTY EQU   IOBDTYP2
IOBTYPE  EQU   IOBDTYP2
IOBRQUST EQU   IOBDTYP2
IOBSUFFX EQU   IOBDTYP2
IOBSBLKL EQU   IOBDTYP2
IOBSKEY  EQU   IOBDTYP2
IOBRELBL EQU   IOBDTYPE
IOBRDEXC EQU   IOBDTYPE
IOBDYNBF EQU   IOBDTYPE
IOBACTAD EQU   IOBDTYPE
IOBFDBCK EQU   IOBDTYPE
IOBEXTSC EQU   IOBDTYPE
IOBOVFLO EQU   IOBDTYPE
IOBVERFY EQU   IOBDTYPE
IOBDPLB  EQU   IOBDPLAD+1
IOBDAYLI EQU   IOBDPLAD
IOBDIOBS EQU   IOBORG09+2
IOBDBYTR EQU   IOBORG09
IOBBCHAD EQU   IOBORG08+12
IOBFCHNB EQU   IOBFCHAD+1
IOBCOUNT EQU   IOBFCHAD
IOBASYN  EQU   IOBORG08+7
IOBAPP   EQU   IOBORG08+6
IOBRSV32 EQU   IOBUNSQR
IOBRSV31 EQU   IOBUNSQR
IOBRSV30 EQU   IOBUNSQR
IOBKNRWR EQU   IOBUNSQR
IOBKNWR  EQU   IOBUNSQR
IOBNTAV2 EQU   IOBUNSQR
IOBNTAV1 EQU   IOBUNSQR
IOBCPBSY EQU   IOBUNSQR
IOBCHNNL EQU   IOBINDCT
IOBRSV29 EQU   IOBINDCT
IOBRSV28 EQU   IOBINDCT
IOBRSV27 EQU   IOBINDCT
IOBKEYAD EQU   IOBINDCT
IOBOVPTR EQU   IOBINDCT
IOBUNSCH EQU   IOBINDCT
IOBDEQCP EQU   IOBINDCT
IOBCCWAD EQU   IOBORG08
W1OEXTEN EQU   W1IEXTEN
IOBCCW   EQU   IOBORG06+8
IOBNXTPB EQU   IOBNXTPT+1
IOBRSV26 EQU   IOBSTATA
IOBRSV25 EQU   IOBSTATA
IOBRSV24 EQU   IOBSTATA
IOBRSV23 EQU   IOBSTATA
IOBRSV22 EQU   IOBSTATA
IOBRSV21 EQU   IOBSTATA
IOBRSV20 EQU   IOBSTATA
IOBAVLFL EQU   IOBSTATA
IOBRSV37 EQU   IOBORG06+1
IOBUCBXG EQU   IOBORG06
IOBCPA   EQU   IOBORG05+32
IOBERINF EQU   IOBORG05+16
IOBERCCW EQU   IOBORG05+8
IOBSNDPT EQU   IOBORG05+7
IOBRCVPT EQU   IOBORG05+6
IOBWORK  EQU   IOBORG05+1
IOBUCBX  EQU   IOBORG05
IOBR     EQU   IOBSEEK+7
IOBHH2   EQU   IOBHH+1
IOBHH1   EQU   IOBHH
IOBCC2   EQU   IOBCC+1
IOBCC1   EQU   IOBCC
IOBBB2   EQU   IOBBB+1
IOBBB1   EQU   IOBBB
IOBM     EQU   IOBSEEK
IOBRSV46 EQU   IOBFL4
IOBRSV47 EQU   IOBFL4
IOBENT   EQU   IOBFL4
IOBEQP   EQU   IOBFL4
IOBBUS   EQU   IOBFL4
IOBDCK   EQU   IOBFL4
IOBREJ   EQU   IOBFL4
IOBOVR   EQU   IOBFL4
IOBCRILC EQU   IOBORG04+1
IOBCRDCC EQU   IOBORG04
IOBGQECB EQU   IOBORG03
IOBSWAP  EQU   IOBORG02+4
IOBDQADB EQU   IOBDQADA+1
IOBRSV13 EQU   IOBDEQIN
IOBRSV12 EQU   IOBDEQIN
IOBRSV11 EQU   IOBDEQIN
IOBRSV10 EQU   IOBDEQIN
IOBRSV09 EQU   IOBDEQIN
IOBRSV08 EQU   IOBDEQIN
IOBRSV07 EQU   IOBDEQIN
IOBDEQ   EQU   IOBDEQIN
IOBNECB  EQU   IOBORG01+4
IOBNIOBB EQU   IOBNIOBA+1
IOBFIRST EQU   IOBNFLG1
IOBUPERR EQU   IOBNFLG1
IOBSPAN  EQU   IOBNFLG1
IOBBKSPC EQU   IOBNFLG1
IOBUPDAT EQU   IOBNFLG1
IOBREAD  EQU   IOBNFLG1
IOBWRITE EQU   IOBNFLG1
IOBSEGMT EQU   IOBPRTOV
CVTRV628 EQU   CVTS01+728
CVTRV627 EQU   CVTS01+724
CVTRV626 EQU   CVTS01+720
CVTRV625 EQU   CVTS01+716
CVTRV624 EQU   CVTS01+712
CVTRV623 EQU   CVTS01+708
CVTRV622 EQU   CVTS01+704
CVTRV621 EQU   CVTS01+700
CVTRV620 EQU   CVTS01+696
CVTRV619 EQU   CVTS01+692
CVTRV618 EQU   CVTS01+688
CVTRV617 EQU   CVTS01+684
CVTRV616 EQU   CVTS01+680
CVTRV615 EQU   CVTS01+676
CVTRV614 EQU   CVTS01+672
CVTRV613 EQU   CVTS01+668
CVTTCASP EQU   CVTS01+664
CVT0PT03 EQU   CVTS01+660
CVT0PT0E EQU   CVTS01+656
CVTIRM   EQU   CVTS01+652
CVTCGK   EQU   CVTS01+648
CVTRV607 EQU   CVTS01+644
CVTRV606 EQU   CVTS01+640
CVTRV605 EQU   CVTS01+636
CVTRV604 EQU   CVTS01+632
CVTEFF02 EQU   CVTS01+628
CVTCBBR  EQU   CVTS01+624
CVTSSCR  EQU   CVTS01+620
CVTEVENT EQU   CVTS01+616
CVTCRCA  EQU   CVTS01+612
CVTTPIO  EQU   CVTS01+608
CVTADV   EQU   CVTS01+604
CVTGSDAB EQU   CVTGSDA
CVTQV3   EQU   CVTS01+596
CVTQV2   EQU   CVTS01+592
CVTQV1   EQU   CVTS01+588
CVTRPT   EQU   CVTS01+584
CVTSSRB  EQU   CVTS01+580
CVTCSDRL EQU   CVTS01+576
CVTEXP1  EQU   CVTS01+572
CVTRMPMT EQU   CVTS01+568
CVTRMPTT EQU   CVTS01+564
CVTVPSA  EQU   CVTS01+560
CVTVSTOP EQU   CVTS01+556
CVTGTFR8 EQU   CVTS01+552
CVTQUIT  EQU   CVTS01+548
CVTVACR  EQU   CVTS01+544
CVTWTCB  EQU   CVTS01+540
CVTSTPRS EQU   CVTS01+536
CVT0PT02 EQU   CVTS01+532
CVTDARCM EQU   CVTS01+528
CVTIRECM EQU   CVTS01+524
CVTJRECM EQU   CVTS01+520
CVTVEMS0 EQU   CVTS01+516
CVTSPFRR EQU   CVTS01+512
CVTRLSTG EQU   CVTS01+508
CVT0TC0A EQU   CVTS01+504
CVTGMBR  EQU   CVTS01+500
CVTLFRM  EQU   CVTS01+496
CVTRMBR  EQU   CVTS01+492
CVTVIOP  EQU   CVTS01+488
CVTRV307 EQU   CVTS01+486
CVTRV306 EQU   CVTS01+484
CVTRV305 EQU   CVTS01+482
CVTRV304 EQU   CVTS01+480
CVTRV303 EQU   CVTS01+478
CVTRV302 EQU   CVTS01+476
CVTTRCA  EQU   CVTS01+472
CVTRV297 EQU   CVTRV289
CVTRV296 EQU   CVTRV289
CVTRV295 EQU   CVTRV289
CVTRV294 EQU   CVTRV289
CVTRV293 EQU   CVTRV289
CVTRV292 EQU   CVTRV289
CVTRV291 EQU   CVTRV289
CVTRV290 EQU   CVTRV289
CVTRV288 EQU   CVTRV280
CVTRV287 EQU   CVTRV280
CVTRV286 EQU   CVTRV280
CVTRV285 EQU   CVTRV280
CVTRV284 EQU   CVTRV280
CVTRV283 EQU   CVTRV280
CVTRV282 EQU   CVTRV280
CVTRV281 EQU   CVTRV280
CVTRV279 EQU   CVTRV271
CVTRV278 EQU   CVTRV271
CVTRV277 EQU   CVTRV271
CVTRV276 EQU   CVTRV271
CVTRV275 EQU   CVTRV271
CVTRV274 EQU   CVTRV271
CVTRV273 EQU   CVTRV271
CVTRV272 EQU   CVTRV271
CVTRV270 EQU   CVTRV262
CVTRV269 EQU   CVTRV262
CVTRV268 EQU   CVTRV262
CVTRV267 EQU   CVTRV262
CVTRV266 EQU   CVTRV262
CVTRV265 EQU   CVTRV262
CVTRV264 EQU   CVTRV262
CVTRV263 EQU   CVTRV262
CVTVFP   EQU   CVTS01+464
CVTVSI   EQU   CVTS01+460
CVTVPSIB EQU   CVTS01+456
CVTMFACT EQU   CVTMFRTR
CVTMFCTL EQU   CVTS01+448
CVTPVBP  EQU   CVTS01+444
CVTPWI   EQU   CVTS01+440
CVTRV254 EQU   CVTS01+438
CVTRV253 EQU   CVTS01+436
CVTRV252 EQU   CVTS01+434
CVTRV251 EQU   CVTS01+433
CVTRV250 EQU   CVTS01+432
CVTRV249 EQU   CVTS01+431
CVTRV248 EQU   CVTS01+430
CVTRV247 EQU   CVTS01+429
CVTRV246 EQU   CVTS01+428
CVTRV245 EQU   CVTRV237
CVTRV244 EQU   CVTRV237
CVTRV243 EQU   CVTRV237
CVTRV242 EQU   CVTRV237
CVTRV241 EQU   CVTRV237
CVTRV240 EQU   CVTRV237
CVTRV239 EQU   CVTRV237
CVTRV238 EQU   CVTRV237
CVTRV236 EQU   CVTRV228
CVTRV235 EQU   CVTRV228
CVTRV234 EQU   CVTRV228
CVTRV233 EQU   CVTRV228
CVTRV232 EQU   CVTRV228
CVTRV231 EQU   CVTRV228
CVTRV230 EQU   CVTRV228
CVTRV229 EQU   CVTRV228
CVTRV227 EQU   CVTRV219
CVTRV226 EQU   CVTRV219
CVTRV225 EQU   CVTRV219
CVTRV224 EQU   CVTRV219
CVTRV223 EQU   CVTRV219
CVTRV222 EQU   CVTRV219
CVTRV221 EQU   CVTRV219
CVTRV220 EQU   CVTRV219
CVTRV218 EQU   CVTRV210
CVTRV217 EQU   CVTRV210
CVTRV216 EQU   CVTRV210
CVTRV215 EQU   CVTRV210
CVTRV214 EQU   CVTRV210
CVTRV213 EQU   CVTRV210
CVTRV212 EQU   CVTRV210
CVTRV211 EQU   CVTRV210
CVTLCCAT EQU   CVTS01+420
CVTPCCAT EQU   CVTS01+416
CVTIPCRP EQU   CVTS01+412
CVTIPCRI EQU   CVTS01+408
CVTIPCDS EQU   CVTS01+404
CVTAIDVT EQU   CVTS01+400
CVTSSAP  EQU   CVTS01+396
CVTEHCIR EQU   CVTS01+392
CVTEHDEF EQU   CVTS01+388
CVTDAIR  EQU   CVTS01+384
CVTPERFM EQU   CVTS01+380
CVT044R2 EQU   CVTS01+376
CVTFETCH EQU   CVTS01+372
CVTRSTWD EQU   CVTS01+368
CVTSPOST EQU   CVTS01+364
CVTIOBP  EQU   CVTS01+360
CVTASMVT EQU   CVTS01+356
CVTRECRQ EQU   CVTS01+352
CVTWSAC  EQU   CVTS01+348
CVTRV149 EQU   CVTS01+344
CVTWSAL  EQU   CVTS01+340
CVTSPSA  EQU   CVTS01+336
CVTGLMN  EQU   CVTS01+332
CVTVEAC0 EQU   CVTS01+328
CVT062R1 EQU   CVTS01+324
CVTRPOST EQU   CVTS01+320
CVTDQIQE EQU   CVTS01+316
CVTCSD   EQU   CVTS01+312
CVTLKRMA EQU   CVTS01+308
CVTRSPIE EQU   CVTS01+304
CVTRENQ  EQU   CVTS01+300
CVTLQCB  EQU   CVTS01+296
CVTFQCB  EQU   CVTS01+292
CVTQCS01 EQU   CVTS01+288
CVTAPFT  EQU   CVTS01+284
CVTPARRL EQU   CVTS01+280
CVTVWAIT EQU   CVTS01+276
CVTGSPL  EQU   CVTS01+272
CVTLSMQ  EQU   CVTS01+268
CVTGSMQ  EQU   CVTS01+264
CVTEXPRO EQU   CVTS01+260
CVTOPCTP EQU   CVTS01+256
CVTSIC   EQU   CVTS01+252
CVTTPIOS EQU   CVTS01+248
CVTRTMS  EQU   CVTS01+244
CVTSDBF  EQU   CVTS01+240
CVTSCBP  EQU   CVTS01+236
CVTSDMP  EQU   CVTS01+232
CVTSV60  EQU   CVTS01+228
CVTRTMCT EQU   CVTS01+224
CVTASCBL EQU   CVTS01+220
CVTASCBH EQU   CVTS01+216
CVTGDA   EQU   CVTS01+212
CVTASVT  EQU   CVTS01+208
CVTVVMDI EQU   CVTS01+204
CVTAQTOP EQU   CVTS01+200
CVTIOSCS EQU   CVTS01+196
CVTSDRM  EQU   CVTS01+192
CVTOPTE  EQU   CVTS01+188
CVTSTXU  EQU   CVTS01+184
CVTQUIS  EQU   CVTS01+180
CVTPARS  EQU   CVTS01+176
CVTS1EE  EQU   CVTS01+172
CVTFRAS  EQU   CVTS01+168
CVTQSAS  EQU   CVTS01+164
CVTCRAS  EQU   CVTS01+160
CVTCRMN  EQU   CVTS01+156
CVTDELCP EQU   CVTS01+152
CVTFRECL EQU   CVTS01+148
CVTGETCL EQU   CVTS01+144
CVTBLDCP EQU   CVTS01+140
CVTAUTHL EQU   CVTS01+136
CVTSCAN  EQU   CVTS01+132
CVTRV144 EQU   CVTS01+130
CVTMAXMP EQU   CVTS01+128
CVTSTCK  EQU   CVTS01+124
CVTRV139 EQU   CVTS01+123
CVTDSSAC EQU   CVTS01+122
CVTRV513 EQU   CVTS01+121
CVTIOSPL EQU   CVTS01+120
CVTPTGT  EQU   CVTS01+116
CVTCSPIE EQU   CVTS01+112
CVTSMFEX EQU   CVTS01+108
CVTOLT0A EQU   CVTS01+104
CVTSRBRT EQU   CVTS01+100
CVTPUTL  EQU   CVTS01+96
CVTASCRL EQU   CVTS01+92
CVTASCRF EQU   CVTS01+88
CVTRV326 EQU   CVTS01+84
CVTRV325 EQU   CVTS01+80
CVTRV324 EQU   CVTS01+76
CVT0VL01 EQU   CVTS01+72
CVTSHRVM EQU   CVTS01+68
CVTRV332 EQU   CVTS01+64
CVTTAS   EQU   CVTS01+60
CVTRSCN  EQU   CVTS01+56
CVTTRAC2 EQU   CVTS01+54
CVTTRACE EQU   CVTS01+52
CVTAPG   EQU   CVTS01+51
CVTSDTRC EQU   CVTCTLFG
CVTGTRCE EQU   CVTCTLFG
CVTNOMP  EQU   CVTCTLFG
CVTRSV79 EQU   CVTCTLFG
CVTDSTAT EQU   CVTCTLFG
CVTRSV78 EQU   CVTCTLFG
CVTRV333 EQU   CVTCTLFG
CVTRV323 EQU   CVTCTLFG
CVTSPVLK EQU   CVTS01+49
CVTRSV77 EQU   CVTS01+48
CVTRV331 EQU   CVTS01+44
CVTRV330 EQU   CVTS01+40
CVTRV329 EQU   CVTS01+36
CVTRV328 EQU   CVTS01+32
CVTRV322 EQU   CVTS01+28
CVTSLID  EQU   CVTSLIDA+1
CVTSYLK  EQU   CVTSLIDA
CVTRV321 EQU   CVTS01+20
CVTRV320 EQU   CVTS01+16
CVTLPDIR EQU   CVTLPDIA+1
CVTRSV69 EQU   CVTDIRST
CVTRSV68 EQU   CVTDIRST
CVTRSV67 EQU   CVTDIRST
CVTRSV66 EQU   CVTDIRST
CVTRSV65 EQU   CVTDIRST
CVTRSV64 EQU   CVTDIRST
CVTRSV63 EQU   CVTDIRST
CVTDICOM EQU   CVTDIRST
CVTPVTP  EQU   CVTS01+8
CVTLPDSR EQU   CVTS01+4
CVTGETL  EQU   CVTS01
WKECHNGP EQU   WKECHAIN+1
@NM00102 EQU   WKEFLAGS
WKEGATE  EQU   WKEFLAGS
@NM00101 EQU   ISTWKE
@NM00090 EQU   CVASVARA+12
@NM00089 EQU   CVASVARA
NSRUNA6  EQU   NSRUNA5
RUBDATA  EQU   ISTRUB
RHRSVD5  EQU   RH3
RHRSVD4  EQU   RH3
RHLOG    EQU   RH3
RHRSVD3  EQU   RH3
RHRCDIR  EQU   RH3
RHCDIR   EQU   RH3
RHEB     EQU   RH3
RHBB     EQU   RH3
RHPACE   EQU   RH2
RHRSVD2  EQU   RH2
RHINOP   EQU   RHRSVD1
RHBUSY   EQU   RHRETRY
RHEXCEPT EQU   RH2
RHRRN    EQU   RH2
RHPE     EQU   RH2
RHFME    EQU   RH2
RHCHAIN  EQU   RH1
RHSENSE  EQU   RH1
RHFORMAT EQU   RH1
RHDIRI   EQU   RH1
RHSCI    EQU   RH1
RHTYPE   EQU   RH1
RHQS     EQU   RH1
FMCFLRSV EQU   FMCFLGB
FMCFLGA8 EQU   FMCFLGB
FMCCLRPH EQU   FMCVS1+45
FMCRSV0X EQU   FMCCVFLG
FMCVYRPH EQU   FMCCVFLG
FMCZV004 EQU   FMCVS1+40
FMCLOCK2 EQU   FMCVS1+36
@NM00073 EQU   FMCZFLG2
FMCZF027 EQU   FMCZFLG2
FMCZF026 EQU   FMCZFLG2
FMCSEQ1B EQU   FMCSEQ1
FMCSEQ1T EQU   FMCSEQ1
FMCZX006 EQU   FMCVS1+33
FMCZX005 EQU   FMCVS1+32
FMCZX004 EQU   FMCVS1+31
FMCZX003 EQU   FMCVS1+30
FMCZX002 EQU   FMCVS1+29
FMCZX001 EQU   FMCVS1+28
FMCZV001 EQU   FMCVS1+24
FMCAWATQ EQU   FMCLCPAQ+1
@NM00072 EQU   FMCLCPAQ
FMCLCPB2 EQU   FMCLCPBQ+1
FMCLCPB1 EQU   FMCLCPBQ
FMCASCDQ EQU   FMCSHEAQ+1
@NM00071 EQU   FMCSHEAQ
FMCSHEDQ EQU   FMCVS1+8
FMCZFCSQ EQU   FMCVS1+6
FMCZH001 EQU   FMCVS1+4
FMCZF025 EQU   FMCZFLAG+3
FMCZF024 EQU   FMCZFLAG+3
FMCZF023 EQU   FMCZFLAG+3
FMCZF022 EQU   FMCZFLAG+3
FMCZF021 EQU   FMCZFLAG+3
FMCZF020 EQU   FMCZFLAG+3
FMCZF019 EQU   FMCZFLAG+3
FMCZF018 EQU   FMCZFLAG+3
FMCZF017 EQU   FMCZFLAG+2
FMCZF016 EQU   FMCZFLAG+2
FMCZF015 EQU   FMCZFLAG+2
FMCZF014 EQU   FMCZFLAG+2
FMCZF013 EQU   FMCZFLAG+2
FMCZF012 EQU   FMCZFLAG+2
FMCZF011 EQU   FMCZFLAG+2
FMCZF010 EQU   FMCZFLAG+2
FMCZF00F EQU   FMCZFLAG+1
FMCZF00E EQU   FMCZFLAG+1
FMCZF00D EQU   FMCZFLAG+1
FMCZF00C EQU   FMCZFLAG+1
FMCZF00B EQU   FMCZFLAG+1
FMCRSV10 EQU   FMCZFLAG+1
FMCZF009 EQU   FMCZFLAG+1
FMCZFD06 EQU   FMCZF006+1
FMCZFC06 EQU   FMCZF006
FMCZFB06 EQU   FMCZF006
FMCZFA06 EQU   FMCZF006
FMCZF005 EQU   FMCZFLAG
FMCZF004 EQU   FMCZFLAG
FMCZF003 EQU   FMCZFLAG
FMCZF002 EQU   FMCZFLAG
FMCZF001 EQU   FMCZFLAG
FMCFRESA EQU   ISTFMCB+228
FMCSCSQN EQU   FMCSNCTL+2
FMCSCCTL EQU   FMCSNCTL+1
FMCSTCTL EQU   FMCSCFLG
FMCSCCLO EQU   FMCSCFLG
FMCAPRO  EQU   FMCSCFLG
FMCLURO  EQU   FMCSCFLG
FMCOBSAC EQU   FMCSCFLG
FMCIBSAC EQU   FMCSCFLG
FMCFBRE  EQU   ISTFMCB+220
FMCFBXM  EQU   FMCZV002
FMCASEGQ EQU   ISTFMCB+212
FMCRDTPT EQU   ISTFMCB+208
FMCLOCK  EQU   ISTFMCB+204
FMCSEGD  EQU   FMCSSEGQ
FMCRSPLM EQU   ISTFMCB+198
FMCPSTRS EQU   ISTFMCB+196
@NM00070 EQU   FMCRRESP
FMCTSLHA EQU   FMCRRESP
FMCFRRN  EQU   FMCRRESP
FMCFME   EQU   FMCRRESP
FMCFEX   EQU   FMCRRESP
FMCFPE   EQU   FMCRRESP
FMCCTLB  EQU   ISTFMCB+194
FMCBSQNO EQU   FMCCLSEQ+2
FMCTSQNO EQU   FMCCLSEQ
FMCOBPRG EQU   FMCMODEB
FMCIBPRG EQU   FMCMODEB
FMCRESOT EQU   FMCMODEB
FMCRSTSR EQU   FMCMODEB
FMCLUQ   EQU   FMCMODEB
FMCAPQ   EQU   FMCMODEB
FMCCLEAR EQU   FMCMODEB
FMCHOLD  EQU   FMCMODEB
FMCIPSEQ EQU   ISTFMCB+188
FMCLUSTR EQU   ISTFMCB+187
FMCRSV87 EQU   FMCSTAT2
FMCSEQI  EQU   FMCSTAT2
FMCCPIP  EQU   FMCSTAT2
FMCALIPR EQU   FMCSTAT2
FMCIAIO  EQU   FMCSTAT2
FMCZF00A EQU   FMCSTAT2
FMCVPIP  EQU   FMCSTAT2
FMCBHSET EQU   ISTFMCB+185
FMCPRMRC EQU   FMCCLEXT+20
FMCRSV89 EQU   FMCPSTAT
FMCPCLSD EQU   FMCPSTAT
FMCDDOCD EQU   FMCPSTAT
FMCIDVFD EQU   FMCPSTAT
FMCELKST EQU   FMCPSTAT
FMCRSV88 EQU   FMCPSCMD
FMCRDBLK EQU   FMCPSCMD
FMCDSEOC EQU   FMCPSCMD
FMCPURGE EQU   FMCPSCMD
FMCRESTI EQU   FMCPSCMD
FMCCNTCT EQU   FMCPSCMD
FMCINVT  EQU   FMCPSCMD
FMCFLGB7 EQU   FMCFLGCL
FMCFLGB6 EQU   FMCFLGCL
FMCFLGB5 EQU   FMCFLGCL
FMCFLGB4 EQU   FMCFLGCL
FMCFLGB3 EQU   FMCFLGCL
FMCFLGB2 EQU   FMCFLGCL
FMCFLGB1 EQU   FMCFLGCL
FMCFLGB0 EQU   FMCFLGCL
FMCFLGA7 EQU   FMCFLGA
FMCFLGA6 EQU   FMCFLGA
FMCFLGA5 EQU   FMCFLGA
FMCFLGA4 EQU   FMCFLGA
FMCFLGA3 EQU   FMCFLGA
FMCFLGA2 EQU   FMCFLGA
FMCFLGA1 EQU   FMCFLGA
FMCFLGA0 EQU   FMCFLGA
FMCDCLOK EQU   FMCCLEXT+12
FMCRAFM  EQU   FMCCLEXT+8
FMCFBPTR EQU   FMCFBA+1
FMCFBRSV EQU   FMCFBA
FMCRPLPT EQU   FMCRPLA+1
FMCRPLRS EQU   FMCRPLA
FMCPRCLS EQU   FMCCVAL
FMCIBCE  EQU   FMCCVAL
FMCONLY  EQU   FMCOBCE
FMCLAST  EQU   FMCOBCE
FMCMIDLE EQU   FMCOBCE
FMCFIRST EQU   FMCOBCE
FMCCPCNT EQU   FMCPACPC
FMCMPCNT EQU   FMCPACEM
FMCNPCNT EQU   FMCPACEN
FMCCONF  EQU   FMCSSTAT
FMCPURCH EQU   FMCSSTAT
FMCNSALU EQU   FMCSSTAT
FMCBIP   EQU   FMCSSTAT
FMCSDTR  EQU   FMCSSTAT
FMCUIPI  EQU   FMCSSTAT
FMCCIPI  EQU   FMCSSTAT
FMCSNBI  EQU   FMCSSTAT
FMCRVD01 EQU   ISTFMCB+158
FMCISSN  EQU   ISTFMCB+156
FMCOASN  EQU   FMCNXOSC
FMCOSSN  EQU   FMCNXCFM
FMCSIP   EQU   FMCSIPA
FMCEXLST EQU   ISTFMCB+144
FMCPAB5  EQU   ISTFMCB+128
FMCPAB4  EQU   ISTFMCB+112
FMCPAB3  EQU   ISTFMCB+96
FMCPAB2  EQU   ISTFMCB+80
FMCPAB1  EQU   ISTFMCB+64
FMCFASYA EQU   ISTFMCB+60
FMCMODE  EQU   ISTFMCB+52
FMCPROCD EQU   ISTFMCB+48
FMCRPLH  EQU   ISTFMCB+40
FMCBUFNB EQU   FMCCMPS1+2
FMCBUFLM EQU   FMCCMPS1
FMCDEBA  EQU   ISTFMCB+32
@NM00069 EQU   FMCCMDFL
FMCSNA   EQU   FMCCMDFL
FMCVSNA  EQU   FMCCMDFL
FMCCMDR  EQU   FMCCMDFL
@NM00068 EQU   ISTFMCB+30
@NM00067 EQU   FMCSTAT1
FMCLTCLS EQU   FMCSTAT1
FMCHPURG EQU   FMCSTAT1
FMCVSP2  EQU   FMCSTAT1
FMCVSP1  EQU   FMCSTAT
FMCLTEAS EQU   FMCSTAT
FMCZF007 EQU   FMCSTAT
FMCDEDSC EQU   FMCSTAT
FMCDAPT  EQU   FMCSTAT
FMCPRMTE EQU   FMCSTAT
FMCPRMTR EQU   FMCSTAT
FMCUSFLD EQU   ISTFMCB+24
FMCFMCBA EQU   ISTFMCB+20
FMCDNCBA EQU   ISTFMCB+16
FMCDVTA  EQU   ISTFMCB+12
FMCTSKID EQU   ISTFMCB+8
FMCNXTCB EQU   ISTFMCB+4
FMCSAF   EQU   ISTFMCB+2
FMCLNGTH EQU   ISTFMCB+1
FMCTYPE  EQU   ISTFMCB
PROSRDEF EQU   PROSETM4
PRORSV47 EQU   PROSETM4
PROSCON  EQU   PROSETM4
PRORSV46 EQU   PROSETM3
PROSMONT EQU   PROSETM3
PRORSV45 EQU   PROSETM3
PROSNTO  EQU   PROSETM3
PRORSV44 EQU   PROSETM3
PRORSV43 EQU   PROSETM2
PROSNTFL EQU   PROSETM2
PRORSV42 EQU   PROSETM2
PRORSV41 EQU   PROPROCS
PROMODC  EQU   PROPROC4
PROMODT  EQU   PROPROC4
PROMODM  EQU   PROPROC4
PROMODB  EQU   PROPROC4
PRORSV14 EQU   PROPROC4
PRORSV13 EQU   PROPROC4
PRORSV12 EQU   PROPROC4
PROEIB   EQU   PROPROC4
PROMONT3 EQU   PROPROC3
PROMONT2 EQU   PROPROC3
PROMONIT EQU   PROPROC3
PROSUBLK EQU   PROPROC3
PRONTO   EQU   PROPROC3
PROLGIN  EQU   PROPROC3
PROERPI  EQU   PROPROC3
PRORSV07 EQU   PROPROC3
PROCFTX  EQU   PROPROC2
PROEMLC  EQU   PROPROC2
PRONTFL  EQU   PROPROC2
PRORSV05 EQU   PROPROC2
PRORSV04 EQU   PROPROC2
PROLGOT  EQU   PROPROC2
PROERPO  EQU   PROPROC2
PRORSV03 EQU   PROPROC2
PRORPLC  EQU   PROPROC1
PROCS    EQU   PROPROC1
PROCA    EQU   PROPROC1
PRORESPX EQU   PROPROC1
PRODFASY EQU   PROPROC1
PROXPOPT EQU   PROPROC1
PROTRUNC EQU   PROPROC1
PROASYIP EQU   PROPROC1
@NM00066 EQU   CCNFLGA
@NM00065 EQU   CCNFLGA
CCNCB    EQU   ISTCCNCB
NCBRSV01 EQU   ISTNCB+46
NCBSWDAF EQU   ISTNCB+44
NCBDEVCH EQU   ISTNCB+36
NCBFMCBP EQU   ISTNCB+32
NCBLTRC  EQU   ISTNCB+30
NCBRVPT1 EQU   ISTNCB+28
NCBNMLLN EQU   NCBFLAGS+3
@NM00064 EQU   NCBFLAG1
NCBFORCE EQU   NCBFLAG1
NCBTTF   EQU   NCBFLAG1
NCBRSYNC EQU   NCBFLAG1
NCBRSTRT EQU   NCBFLAG1
NCBSNAI  EQU   NCBFLAG1
NCBFLTIO EQU   NCBFTRIO
NCBCSTAT EQU   NCBFLAGS
NCBNCSL  EQU   ISTNCB+22
NCBNCBA  EQU   ISTNCB+20
NCBNSNA  EQU   ISTNCB+12
NCBTSKID EQU   ISTNCB+8
NCBRDTE  EQU   ISTNCB+4
NCBDAF   EQU   ISTNCB+2
NCBLNGTH EQU   ISTNCB+1
NCBTYPE  EQU   ISTNCB
@NM00063 EQU   GTNCSFLG
GTNCSAPP EQU   GTNCSFLG
GTNCSWKA EQU   GTNCSFLG
GTNCSRQU EQU   GTNCSFLG
VYCRSV02 EQU   ISTVYCRR+128
VYCRSV04 EQU   ISTVYCRR+126
VYCRRSAV EQU   ISTVYCRR+46
VYCRSV03 EQU   VYCCRT+11
CINCFE   EQU   VYCCRT+11
CINCE9   EQU   VYCCRT+11
CINCVO   EQU   VYCCRT+11
CINCR5   EQU   VYCCRT+11
CINCR3   EQU   VYCCRT+10
CINCE8   EQU   VYCCRT+10
CINCE7   EQU   VYCCRT+10
CINCE6   EQU   VYCCRT+10
CINCE5   EQU   VYCCRT+10
CINCE1   EQU   VYCCRT+10
CINCUQ   EQU   VYCCRT+10
CINCUB   EQU   VYCCRT+10
CINCUA   EQU   VYCCRT+9
CINCX9   EQU   VYCCRT+9
CINCX8   EQU   VYCCRT+9
CINCX7   EQU   VYCCRT+9
CINCX6   EQU   VYCCRT+9
CINCX3   EQU   VYCCRT+9
CINCX2   EQU   VYCCRT+9
CINCX1   EQU   VYCCRT+9
CINCX0   EQU   VYCCRT+8
CINCW9   EQU   VYCCRT+8
CINCW8   EQU   VYCCRT+8
CINCW7   EQU   VYCCRT+8
CINCW6   EQU   VYCCRT+8
CINCW5   EQU   VYCCRT+8
CINCW4   EQU   VYCCRT+8
CINCW2   EQU   VYCCRT+8
CINCW0   EQU   VYCCRT+7
CINCV9   EQU   VYCCRT+7
CINCV8   EQU   VYCCRT+7
CINCV7   EQU   VYCCRT+7
CINCV6   EQU   VYCCRT+7
CINCV5   EQU   VYCCRT+7
CINCV4   EQU   VYCCRT+7
CINCV3   EQU   VYCCRT+7
CINCV2   EQU   VYCCRT+6
CINCU8   EQU   VYCCRT+6
CINCU7   EQU   VYCCRT+6
CINCU6   EQU   VYCCRT+6
CINCU5   EQU   VYCCRT+6
CINCU4   EQU   VYCCRT+6
CINCU3   EQU   VYCCRT+6
CINCU2   EQU   VYCCRT+6
CINCU1   EQU   VYCCRT+5
CINCU0   EQU   VYCCRT+5
CINCUM   EQU   VYCCRT+5
CINCS1   EQU   VYCCRT+5
CINCL8   EQU   VYCCRT+5
CINCL7   EQU   VYCCRT+5
CINCL6   EQU   VYCCRT+5
CINCL5   EQU   VYCCRT+5
CINCL4   EQU   VYCCRT+4
CINCL3   EQU   VYCCRT+4
CINCL2   EQU   VYCCRT+4
CINCL1   EQU   VYCCRT+4
CINCL0   EQU   VYCCRT+4
CINCF4   EQU   VYCCRT+4
CINCF3   EQU   VYCCRT+4
CINCF1   EQU   VYCCRT+4
CINCFM   EQU   VYCCRT+3
CINCE4   EQU   VYCCRT+3
CINCE3   EQU   VYCCRT+3
CINCE2   EQU   VYCCRT+3
CINCE0   EQU   VYCCRT+3
CINCD9   EQU   VYCCRT+3
CINCD8   EQU   VYCCRT+3
CINCD7   EQU   VYCCRT+3
CINCD6   EQU   VYCCRT+2
CINCD5   EQU   VYCCRT+2
CINCD4   EQU   VYCCRT+2
CINCD3   EQU   VYCCRT+2
CINCD2   EQU   VYCCRT+2
CINCD1   EQU   VYCCRT+2
CINCIP   EQU   VYCCRT+2
CINCR2   EQU   VYCCRT+2
CINCMS   EQU   VYCCRT+1
CINCVN   EQU   VYCCRT+1
CINCVS   EQU   VYCCRT+1
CINCVP   EQU   VYCCRT+1
CINCVX   EQU   VYCCRT+1
CINCFS   EQU   VYCCRT+1
CINCSM   EQU   VYCCRT+1
CINCR1   EQU   VYCCRT+1
CINCLF   EQU   VYCCRT
CINCVI   EQU   VYCCRT
CINCMD   EQU   VYCCRT
CINCMY   EQU   VYCCRT
CINCDL   EQU   VYCCRT
CINCIO   EQU   VYCCRT
CINCCL   EQU   VYCCRT
VYCRSV01 EQU   VYCNTRD+11
NINCFE   EQU   VYCNTRD+11
NINCE9   EQU   VYCNTRD+11
NINCVO   EQU   VYCNTRD+11
NINCR5   EQU   VYCNTRD+11
NINCR3   EQU   VYCNTRD+10
NINCE8   EQU   VYCNTRD+10
NINCE7   EQU   VYCNTRD+10
NINCE6   EQU   VYCNTRD+10
NINCE5   EQU   VYCNTRD+10
NINCE1   EQU   VYCNTRD+10
NINCUQ   EQU   VYCNTRD+10
NINCUB   EQU   VYCNTRD+10
NINCUA   EQU   VYCNTRD+9
NINCX9   EQU   VYCNTRD+9
NINCX8   EQU   VYCNTRD+9
NINCX7   EQU   VYCNTRD+9
NINCX6   EQU   VYCNTRD+9
NINCX3   EQU   VYCNTRD+9
NINCX2   EQU   VYCNTRD+9
NINCX1   EQU   VYCNTRD+9
NINCX0   EQU   VYCNTRD+8
NINCW9   EQU   VYCNTRD+8
NINCW8   EQU   VYCNTRD+8
NINCW7   EQU   VYCNTRD+8
NINCW6   EQU   VYCNTRD+8
NINCW5   EQU   VYCNTRD+8
NINCW4   EQU   VYCNTRD+8
NINCW2   EQU   VYCNTRD+8
NINCW0   EQU   VYCNTRD+7
NINCV9   EQU   VYCNTRD+7
NINCV8   EQU   VYCNTRD+7
NINCV7   EQU   VYCNTRD+7
NINCV6   EQU   VYCNTRD+7
NINCV5   EQU   VYCNTRD+7
NINCV4   EQU   VYCNTRD+7
NINCV3   EQU   VYCNTRD+7
NINCV2   EQU   VYCNTRD+6
NINCU8   EQU   VYCNTRD+6
NINCU7   EQU   VYCNTRD+6
NINCU6   EQU   VYCNTRD+6
NINCU5   EQU   VYCNTRD+6
NINCU4   EQU   VYCNTRD+6
NINCU3   EQU   VYCNTRD+6
NINCU2   EQU   VYCNTRD+6
NINCU1   EQU   VYCNTRD+5
NINCU0   EQU   VYCNTRD+5
NINCUM   EQU   VYCNTRD+5
NINCS1   EQU   VYCNTRD+5
NINCL8   EQU   VYCNTRD+5
NINCL7   EQU   VYCNTRD+5
NINCL6   EQU   VYCNTRD+5
NINCL5   EQU   VYCNTRD+5
NINCL4   EQU   VYCNTRD+4
NINCL3   EQU   VYCNTRD+4
NINCL2   EQU   VYCNTRD+4
NINCL1   EQU   VYCNTRD+4
NINCL0   EQU   VYCNTRD+4
NINCF4   EQU   VYCNTRD+4
NINCF3   EQU   VYCNTRD+4
NINCF1   EQU   VYCNTRD+4
NINCFM   EQU   VYCNTRD+3
NINCE4   EQU   VYCNTRD+3
NINCE3   EQU   VYCNTRD+3
NINCE2   EQU   VYCNTRD+3
NINCE0   EQU   VYCNTRD+3
NINCD9   EQU   VYCNTRD+3
NINCD8   EQU   VYCNTRD+3
NINCD7   EQU   VYCNTRD+3
NINCD6   EQU   VYCNTRD+2
NINCD5   EQU   VYCNTRD+2
NINCD4   EQU   VYCNTRD+2
NINCD3   EQU   VYCNTRD+2
NINCD2   EQU   VYCNTRD+2
NINCD1   EQU   VYCNTRD+2
NINCIP   EQU   VYCNTRD+2
NINCR2   EQU   VYCNTRD+2
NINCMS   EQU   VYCNTRD+1
NINCVN   EQU   VYCNTRD+1
NINCVS   EQU   VYCNTRD+1
NINCVP   EQU   VYCNTRD+1
NINCVX   EQU   VYCNTRD+1
NINCFS   EQU   VYCNTRD+1
NINCSM   EQU   VYCNTRD+1
NINCR1   EQU   VYCNTRD+1
NINCLF   EQU   VYCNTRD
NINCVI   EQU   VYCNTRD
NINCMD   EQU   VYCNTRD
NINCMY   EQU   VYCNTRD
NINCDL   EQU   VYCNTRD
NINCIO   EQU   VYCNTRD
NINCCL   EQU   VYCNTRD
VYCCNS   EQU   ISTVYCRR
CNSRSV05 EQU   CNSTFLDB+2
CNSLOG0B EQU   CNSTFLDB+2
CNSACCTB EQU   CNSTFLDB+2
CNSFREEB EQU   CNSTFLDB+2
CNSGETSB EQU   CNSTFLDB+2
CNSSEARB EQU   CNSTFLDB+2
CNSQUEUB EQU   CNSTFLDB+2
CNSACONB EQU   CNSTFLDB+2
CNSTCONB EQU   CNSTFLDB+1
CNSCLAQB EQU   CNSTFLDB+1
CNSCLINB EQU   CNSTFLDB+1
CNSGBINB EQU   CNSTFLDB+1
CNSLGINB EQU   CNSTFLDB+1
CNSACINB EQU   CNSTFLDB+1
CNSPSINB EQU   CNSTFLDB+1
CNSRQRLB EQU   CNSTFLDB+1
CNSTRRLB EQU   CNSTFLDB
CNSDORLB EQU   CNSTFLDB
CNSRLINB EQU   CNSTFLDB
CNSQREQB EQU   CNSTFLDB
CNSXREQB EQU   CNSTFLDB
CNSAQINB EQU   CNSTFLDB
CNSAUTHB EQU   CNSTFLDB
CNSMRINB EQU   CNSTFLDB
CNSRSV01 EQU   CNSTFLDA+2
CNSLOG0A EQU   CNSTFLDA+2
CNSACCTA EQU   CNSTFLDA+2
CNSFREEA EQU   CNSTFLDA+2
CNSGETSA EQU   CNSTFLDA+2
CNSSEARA EQU   CNSTFLDA+2
CNSQUEUA EQU   CNSTFLDA+2
CNSACONA EQU   CNSTFLDA+2
CNSTCONA EQU   CNSTFLDA+1
CNSCLAQA EQU   CNSTFLDA+1
CNSCLINA EQU   CNSTFLDA+1
CNSGBINA EQU   CNSTFLDA+1
CNSLGINA EQU   CNSTFLDA+1
CNSACINA EQU   CNSTFLDA+1
CNSPSINA EQU   CNSTFLDA+1
CNSRQRLA EQU   CNSTFLDA+1
CNSTRRLA EQU   CNSTFLDA
CNSDORLA EQU   CNSTFLDA
CNSRLINA EQU   CNSTFLDA
CNSQREQA EQU   CNSTFLDA
CNSXREQA EQU   CNSTFLDA
CNSAQINA EQU   CNSTFLDA
CNSAUTHA EQU   CNSTFLDA
CNSMRINA EQU   CNSTFLDA
CNSTPFX  EQU   ISTCNSTA
CRACHAIN EQU   ISTCRA+928
CRARSV02 EQU   ISTCRA+924
CRARSV01 EQU   ISTCRA+920
CRABFTBA EQU   CRABUFA
CRAMASK  EQU   CRASVC+64
CRAHSIZ  EQU   CRASVC+60
CRAASCRR EQU   CRASVC
CRAPROCR EQU   ISTCRA+312
CRAPSS   EQU   ISTCRA+160
CRARPH   EQU   ISTCRA+52
CRALAPTR EQU   CRABASIC+48
CRAL9PTR EQU   CRABASIC+44
CRAL8PTR EQU   CRABASIC+40
CRAL7PTR EQU   CRABASIC+36
CRAL6PTR EQU   CRABASIC+32
CRAL5PTR EQU   CRABASIC+28
CRAL4PTR EQU   CRABASIC+24
CRAL1PTR EQU   CRABASIC+12
CRALEV01 EQU   CRALKACT+3
CRALEV02 EQU   CRALKACT+3
CRALEV03 EQU   CRALKACT+3
CRALEV04 EQU   CRALKACT+3
CRALEV05 EQU   CRALKACT+3
CRALEV06 EQU   CRALKACT+3
CRALEV07 EQU   CRALKACT+3
CRALEV08 EQU   CRALKACT+3
CRALEV09 EQU   CRALKACT+2
CRALEV10 EQU   CRALKACT+2
CRALEV11 EQU   CRALKACT+2
CRALEV12 EQU   CRALKACT+2
CRALEV13 EQU   CRALKACT+2
CRALEV14 EQU   CRALKACT+2
CRALEV15 EQU   CRALKACT+2
CRALEV16 EQU   CRALKACT+2
CRALEV17 EQU   CRALKACT+1
CRALEV18 EQU   CRALKACT+1
CRALEV19 EQU   CRALKACT+1
CRALEV20 EQU   CRALKACT+1
CRALEV21 EQU   CRALKACT+1
CRALEV22 EQU   CRALKACT+1
CRALEV23 EQU   CRALKACT+1
CRALEV24 EQU   CRALKACT+1
CRALEV25 EQU   CRALKACT
CRALEV26 EQU   CRALKACT
CRALEV27 EQU   CRALKACT
CRALEV28 EQU   CRALKACT
CRALEV29 EQU   CRALKACT
CRALEV30 EQU   CRALKACT
CRALEV31 EQU   CRALKACT
CRALEV32 EQU   CRALKACT
CRAFRR   EQU   CRAHDR+4
@NM00062 EQU   ISTAPCRR+137
@NM00061 EQU   APC57FLG
APCNREL  EQU   APC57FLG
APCRECRA EQU   APC57FLG
@NM00060 EQU   APC54FLG
APCRLST  EQU   APC54FLG
APCPR153 EQU   APC53FLG
@NM00059 EQU   APC52FLG
APCWKF   EQU   APC52FLG
APCNWF   EQU   APC52FLG
APCRDQ   EQU   APC52FLG
APCQENQ  EQU   APC52FLG
APCSMSR  EQU   APC52FLG
APCCKRQ  EQU   APC52FLG
@NM00058 EQU   APC31FLG
APCSORT  EQU   APC31FLG
APCRESCH EQU   APC31FLG
APCTPXIT EQU   APC31FLG
APCSWTWD EQU   ISTAPCRR+128
APCSAV2  EQU   ISTAPCRR+124
APCSAV1  EQU   ISTAPCRR+120
APCRETCD EQU   APCCOMF+2
@NM00057 EQU   APCCOMF1+1
APCZLBER EQU   APCCOMF1
APCEXIT  EQU   APCCOMF1
APCRELR  EQU   APCCOMF1
APCIRB2  EQU   APCCOMF1
APCIRB1  EQU   APCCOMF1
APCSMCR  EQU   APCCOMF1
APCUETSK EQU   APCCOMF1
APCSSTSK EQU   APCCOMF1
APCESTAL EQU   APCSAVE
APCFRRPM EQU   ISTAPCRR+40
APCQWFO  EQU   ISTAPCRR+36
APCPABSV EQU   ISTAPCRR+32
APCRTRN  EQU   ISTAPCRR+28
APCTCBA  EQU   ISTAPCRR+24
APCPSTA  EQU   ISTAPCRR+20
@NM00056 EQU   APCRFLG+1
APC31R   EQU   APCRFLG
APC58R   EQU   APCRFLG
APC57R   EQU   APCRFLG
APC56R   EQU   APCRFLG
APC54R   EQU   APCRFLG
APC53R   EQU   APCRFLG
APC52R   EQU   APCRFLG
APC51R   EQU   APCRFLG
@NM00055 EQU   APCATFLG+1
APC31E   EQU   APCATFLG
APC58E   EQU   APCATFLG
APC57E   EQU   APCATFLG
APC56E   EQU   APCATFLG
APC54E   EQU   APCATFLG
APC53E   EQU   APCATFLG
APC52E   EQU   APCATFLG
APC51E   EQU   APCATFLG
APCHDRSV EQU   ISTAPCRR
ASCPSREG EQU   ISTASCRR+44
ASCUSR01 EQU   ASCUSRGS+12
ASCUSR00 EQU   ASCUSRGS+8
ASCUSR15 EQU   ASCUSRGS+4
ASCUSR14 EQU   ASCUSRGS
ASCETRYA EQU   ISTASCRR+24
ASCKEY   EQU   ISTASCRR+23
ASCAUDIT EQU   ASCFLG3
ASCFBDUD EQU   ASCFLG3
ASCLLKF  EQU   ASCFLG3
ASCKEYF  EQU   ASCFLG3
ASCFBDAL EQU   ASCFLG3
ASCFSRGT EQU   ASCFLG3
ASCICR   EQU   ASCFLG2
ASCFSRIC EQU   ASCFLG2
ASCFBDIC EQU   ASCFLG2
ASCFBAIC EQU   ASCFLG2
ASCPASTR EQU   ASCFLG1
ASCFSR   EQU   ASCFLG1
ASCFBD   EQU   ASCFLG1
ASCFBA   EQU   ASCFLG1
ASCPFCRR EQU   ISTASCRR
ZCRRU    EQU   ZCRRHRU+3
ZCRRH    EQU   ZCRRHRU
ZCRWORDA EQU   ISTZCRR+477
ZCRCMNRC EQU   ISTZCRR+476
ZCRRSV97 EQU   ZCRENTER+18
ZCREIC2B EQU   ZCRENTER+18
ZCREAC2B EQU   ZCRENTER+18
ZCRELCAB EQU   ZCRENTER+18
ZCREDCMF EQU   ZCRENTER+18
ZCREBCIF EQU   ZCRENTER+18
ZCREICSG EQU   ZCRENTER+18
ZCREDCK0 EQU   ZCRENTER+18
ZCRECFY0 EQU   ZCRENTER+17
ZCREKCCB EQU   ZCRENTER+17
ZCREDCNB EQU   ZCRENTER+17
ZCREICOE EQU   ZCRENTER+17
ZCREBCNB EQU   ZCRENTER+17
ZCREBC0L EQU   ZCRENTER+17
ZCREBCAL EQU   ZCRENTER+17
ZCREDCQR EQU   ZCRENTER+17
ZCREDCPR EQU   ZCRENTER+16
ZCREBCSB EQU   ZCRENTER+16
ZCREAC1R EQU   ZCRENTER+16
ZCRECCCI EQU   ZCRENTER+16
ZCRECCAI EQU   ZCRENTER+16
ZCRECCBI EQU   ZCRENTER+16
ZCREBCAR EQU   ZCRENTER+16
ZCREBCDR EQU   ZCRENTER+16
ZCREBCBR EQU   ZCRENTER+15
ZCREDCXR EQU   ZCRENTER+15
ZCREDCWB EQU   ZCRENTER+15
ZCREDCWR EQU   ZCRENTER+15
ZCREKCCN EQU   ZCRENTER+15
ZCREKCBN EQU   ZCRENTER+15
ZCREKCBB EQU   ZCRENTER+15
ZCREJC0B EQU   ZCRENTER+15
ZCREJCDB EQU   ZCRENTER+14
ZCREJCCB EQU   ZCRENTER+14
ZCREJCBB EQU   ZCRENTER+14
ZCREJCAB EQU   ZCRENTER+14
ZCREIC1B EQU   ZCRENTER+14
ZCREIC0B EQU   ZCRENTER+14
ZCREICX0 EQU   ZCRENTER+14
ZCREICWB EQU   ZCRENTER+14
ZCREICVB EQU   ZCRENTER+13
ZCREICUB EQU   ZCRENTER+13
ZCREICTB EQU   ZCRENTER+13
ZCREICSC EQU   ZCRENTER+13
ZCREICSB EQU   ZCRENTER+13
ZCREICRB EQU   ZCRENTER+13
ZCREICQB EQU   ZCRENTER+13
ZCREICQA EQU   ZCRENTER+13
ZCREICOB EQU   ZCRENTER+12
ZCREICOA EQU   ZCRENTER+12
ZCREICNB EQU   ZCRENTER+12
ZCREICNA EQU   ZCRENTER+12
ZCREICMB EQU   ZCRENTER+12
ZCREICLB EQU   ZCRENTER+12
ZCREICKG EQU   ZCRENTER+12
ZCREICKE EQU   ZCRENTER+12
ZCREICKB EQU   ZCRENTER+11
ZCREICJB EQU   ZCRENTER+11
ZCREICID EQU   ZCRENTER+11
ZCREICIB EQU   ZCRENTER+11
ZCREICHB EQU   ZCRENTER+11
ZCREICGB EQU   ZCRENTER+11
ZCREICEB EQU   ZCRENTER+11
ZCREICDB EQU   ZCRENTER+11
ZCREICCI EQU   ZCRENTER+10
ZCREICCB EQU   ZCRENTER+10
ZCREICBI EQU   ZCRENTER+10
ZCREICBB EQU   ZCRENTER+10
ZCREICAB EQU   ZCRENTER+10
ZCREICAA EQU   ZCRENTER+10
ZCREHCAN EQU   ZCRENTER+10
ZCREGC0B EQU   ZCRENTER+10
ZCREGC0A EQU   ZCRENTER+9
ZCREGCLA EQU   ZCRENTER+9
ZCREGCEB EQU   ZCRENTER+9
ZCREGCDB EQU   ZCRENTER+9
@NM00054 EQU   ZCRENTER+9
ZCREGCBB EQU   ZCRENTER+9
ZCREGCAB EQU   ZCRENTER+9
ZCREFCEB EQU   ZCRENTER+9
ZCREFCEA EQU   ZCRENTER+8
ZCREECTA EQU   ZCRENTER+8
ZCREECEA EQU   ZCRENTER+8
ZCREECDA EQU   ZCRENTER+8
ZCREECCB EQU   ZCRENTER+8
ZCREECCA EQU   ZCRENTER+8
ZCREECBB EQU   ZCRENTER+8
ZCREECBA EQU   ZCRENTER+8
ZCREDCMB EQU   ZCRENTER+7
ZCREDCL0 EQU   ZCRENTER+7
ZCREDCKB EQU   ZCRENTER+7
ZCREDCKA EQU   ZCRENTER+7
ZCREDCJ0 EQU   ZCRENTER+7
ZCREDCI0 EQU   ZCRENTER+7
ZCREDCH0 EQU   ZCRENTER+7
ZCREDCF0 EQU   ZCRENTER+7
ZCREDCE0 EQU   ZCRENTER+6
ZCREDCD0 EQU   ZCRENTER+6
ZCREDCC0 EQU   ZCRENTER+6
ZCREDCB0 EQU   ZCRENTER+6
ZCREDCA0 EQU   ZCRENTER+6
ZCRECC2B EQU   ZCRENTER+6
ZCRECC1B EQU   ZCRENTER+6
ZCRECC1A EQU   ZCRENTER+6
ZCRECC0B EQU   ZCRENTER+5
ZCRECC0A EQU   ZCRENTER+5
ZCREBC0B EQU   ZCRENTER+5
ZCREBC0A EQU   ZCRENTER+5
ZCREBCZ0 EQU   ZCRENTER+5
ZCREBCY0 EQU   ZCRENTER+5
ZCREBCX0 EQU   ZCRENTER+5
ZCREBCXA EQU   ZCRENTER+5
ZCREBCSC EQU   ZCRENTER+4
ZCREBCRB EQU   ZCRENTER+4
ZCREBCRA EQU   ZCRENTER+4
ZCREBCQB EQU   ZCRENTER+4
ZCREBCPB EQU   ZCRENTER+4
ZCREBCOB EQU   ZCRENTER+4
ZCREBCNE EQU   ZCRENTER+4
ZCREBCND EQU   ZCRENTER+4
ZCREBCMB EQU   ZCRENTER+3
ZCREBCLB EQU   ZCRENTER+3
ZCREBCLA EQU   ZCRENTER+3
ZCREBCKB EQU   ZCRENTER+3
ZCREBCKA EQU   ZCRENTER+3
ZCREBCJB EQU   ZCRENTER+3
ZCREBCJA EQU   ZCRENTER+3
ZCREBCID EQU   ZCRENTER+3
ZCREBCIB EQU   ZCRENTER+2
ZCREBCIA EQU   ZCRENTER+2
ZCREBCHB EQU   ZCRENTER+2
ZCREBCHA EQU   ZCRENTER+2
ZCREBCGB EQU   ZCRENTER+2
ZCREBCGA EQU   ZCRENTER+2
ZCREBCFB EQU   ZCRENTER+2
ZCREBCFA EQU   ZCRENTER+2
ZCREBCEB EQU   ZCRENTER+1
ZCREBCDI EQU   ZCRENTER+1
ZCREBCCB EQU   ZCRENTER+1
ZCREBCBI EQU   ZCRENTER+1
ZCREBCBB EQU   ZCRENTER+1
ZCREBCBA EQU   ZCRENTER+1
ZCREBCAM EQU   ZCRENTER+1
ZCREBCAI EQU   ZCRENTER+1
ZCREBCAG EQU   ZCRENTER
ZCREBCAE EQU   ZCRENTER
ZCREBCAB EQU   ZCRENTER
ZCREBCAA EQU   ZCRENTER
ZCREAC1B EQU   ZCRENTER
ZCREAC0B EQU   ZCRENTER
ZCREAC0A EQU   ZCRENTER
ZCREAC1A EQU   ZCRENTER
ZCRTNAME EQU   ZCRAUDIT+1
ZCRTID   EQU   ZCRAUDIT
ZCRREMIC EQU   ISTZCRR+436
ZCRSAVEZ EQU   ISTZCRR+196
ZCRDAFSV EQU   ZCRCIDSV+2
ZCRSAFSV EQU   ZCRCIDSV
ZCRR13SV EQU   ISTZCRR+188
ZCRR2SV  EQU   ISTZCRR+184
ZCROPCDE EQU   ISTZCRR+183
ZCRPRMTC EQU   ISTZCRR+182
ZCRRCDSV EQU   ISTZCRR+181
ZCRAWQSW EQU   ISTZCRR+180
ZCRTOPQ  EQU   ISTZCRR+180
ZCRLSTFB EQU   ISTZCRR+180
ZCRXSCHD EQU   ISTZCRR+180
ZCRNXTEL EQU   ISTZCRR+180
ZCRSCANQ EQU   ISTZCRR+180
ZCRMOREL EQU   ISTZCRR+180
ZCRFBPRC EQU   ISTZCRR+180
ZCRFSBSV EQU   ISTZCRR+176
ZCRSVWK5 EQU   ZCRWKARA+16
ZCRSVWK4 EQU   ZCRWKARA+12
ZCRSVWK3 EQU   ZCRWKARA+8
ZCRSVWK2 EQU   ZCRWKARA+4
ZCRSVWK1 EQU   ZCRWKARA
ZCRSVF25 EQU   ZCRSVRTN+96
ZCRSVF24 EQU   ZCRSVRTN+92
ZCRSVF23 EQU   ZCRSVRTN+88
ZCRSVF22 EQU   ZCRSVRTN+84
ZCRSVF21 EQU   ZCRSVRTN+80
ZCRSVF20 EQU   ZCRSVRTN+76
ZCRSVF19 EQU   ZCRSVRTN+72
ZCRSVF18 EQU   ZCRSVRTN+68
ZCRSVF17 EQU   ZCRSVRTN+64
ZCRSVF16 EQU   ZCRSVRTN+60
ZCRSVF15 EQU   ZCRSVRTN+56
ZCRSVF14 EQU   ZCRSVRTN+52
ZCRSVF13 EQU   ZCRSVRTN+48
ZCRSVF12 EQU   ZCRSVRTN+44
ZCRSVF11 EQU   ZCRSVRTN+40
ZCRSVF10 EQU   ZCRSVRTN+36
ZCRSVF9  EQU   ZCRSVRTN+32
ZCRSVF8  EQU   ZCRSVRTN+28
ZCRSVF7  EQU   ZCRSVRTN+24
ZCRSVF6  EQU   ZCRSVRTN+20
ZCRSVF5  EQU   ZCRSVRTN+16
ZCRSVF4  EQU   ZCRSVRTN+12
ZCRSVF3  EQU   ZCRSVRTN+8
ZCRSVF2  EQU   ZCRSVRTN+4
ZCRSVF1  EQU   ZCRSVRTN
ZCRPVZB  EQU   ISTZCRR+52
ZCRZLB   EQU   ISTZCRR+48
ZCRBFPTR EQU   ISTZCRR+44
ZCRCCWA  EQU   ISTZCRR+40
ZCRPSW   EQU   ZCRPARMS+15
ZCRPCHAR EQU   ZCRPARMS+14
ZCRPRES2 EQU   ZCRPCOD2
ZCRPMFGF EQU   ZCRPCOD2
ZCRPFHDR EQU   ZCRPCOD2
ZCRPPG2  EQU   ZCRPCOD2
ZCRPRES  EQU   ZCRPCOD1
ZCRPCFTX EQU   ZCRPCOD1
ZCRPBUF  EQU   ZCRPCOD1
ZCRPLSCB EQU   ZCRPCOD1
ZCRPLSBQ EQU   ZCRPLSBF
ZCRPFSB  EQU   ZCRPCOD1
ZCRPLNG  EQU   ZCRPCOD1
ZCRPPG   EQU   ZCRPCOD1
ZCRDTODA EQU   ZCRDFRDA
ZCRMLNG  EQU   ZCRPARMS+8
ZCRTBPTR EQU   ZCRPARMS+4
ZCRCBPTR EQU   ZCRFBPTR
ZCRCRLCP EQU   ISTZCRR+20
@NM00053 EQU   ZCRSCPSW
ZCRSKIPT EQU   ZCRSCPSW
ZCRFSBWE EQU   ZCRSCPSW
ZCRPRCMP EQU   ZCRSCPSW
ZCRLREQ  EQU   ZCRSCPSW
ZCRRJLCP EQU   ZCRSCPSW
ZCRTPINV EQU   ZCRSCPSW
ZCRTPEX  EQU   ZCRSCPSW
@NM00052 EQU   ZCRIBPR
ZCR3270R EQU   ZCRIBPR
ZCR3270  EQU   ZCRIBPR
ZCRLCPFD EQU   ZCRIBPR
ZCRLCPFR EQU   ZCRIBPR
ZCRRELK  EQU   ZCRIBPR
ZCRERR   EQU   ZCRIBPR
ZCRNOBUF EQU   ZCRIBPR
@NM00051 EQU   ZCRPFLGS
ZCRQAHED EQU   ZCRPFLGS
ZCRF1RES EQU   ZCRGENSW
ZCRBRIS  EQU   ZCRGENSW
ZCRCLRBD EQU   ZCRGENSW
ZCREXRES EQU   ZCRGENSW
ZCRLCSYN EQU   ZCRGENSW
ZCRRT06  EQU   ZCRGENSW
ZCRTSW2  EQU   ZCRGENSW
ZCRTSW1  EQU   ZCRGENSW
ZCRINLCP EQU   ZCRFLGS3
ZCRWRPTR EQU   ZCRFLGS3
ZCRNOFRE EQU   ZCRFLGS3
ZCREDRIV EQU   ZCRFLGS3
ZCRDISC  EQU   ZCRFLGS3
ZCRTPDIS EQU   ZCRFLGS3
ZCRTPCON EQU   ZCRFLGS3
ZCRTIC   EQU   ZCRFLGS3
ZCRCNLXL EQU   ZCRRESET
ZCRENDAN EQU   ZCRSWFLD
ZCRENDXL EQU   ZCRSWFLD
ZCRENDX  EQU   ZCRSWFLD
ZCROB1   EQU   ZCRNDLCP
ZCRENDPR EQU   ZCRSWFLD
ZCREXTYP EQU   ZCRSWFLD
ZCRSLCP  EQU   ZCRENDSH
ZCRIF0E3 EQU   ZCRFLGS2
ZCRIF0E2 EQU   ZCRFLGS2
ZCRIF0E1 EQU   ZCRFLGS2
ZCROB    EQU   ZCRFLGS2
ZCRFMSED EQU   ZCRFLGS2
ZCRSHEDI EQU   ZCRFLGS2
ZCRLOCAL EQU   ZCRFLGS2
ZCRFEXIT EQU   ZCRFLGS1
ZCRUNSOL EQU   ZCRFLGS1
ZCRENDLP EQU   ZCRFLGS1
ZCRNRMEX EQU   ZCRFLGS1
ZCRWAIT  EQU   ZCRFLGS1
ZCRDEQSW EQU   ZCRFLGS1
ZCRQUESW EQU   ZCRFLGS1
ZCREXSW  EQU   ZCRFLGS1
ZCRFRRA  EQU   ISTZCRR+8
ZCRCHAIN EQU   ISTZCRR+4
ZCRFLAG  EQU   ZCRCRR+3
ZCRLEN   EQU   ZCRCRR+1
ZCRID    EQU   ZCRCRR
CCFRSVD1 EQU   CFCCRT
CCFCR2   EQU   CFCCRT
CCFCRP   EQU   CFCCRT
CCFCR1   EQU   CFCCRT
CCFCS2   EQU   CFCCRT
CCFCS1   EQU   CFCCRT
NCFRSVD  EQU   CFCNTRD
NCFCR2   EQU   CFCNTRD
NCFCRP   EQU   CFCNTRD
NCFCR1   EQU   CFCNTRD
NCFCS2   EQU   CFCNTRD
NCFCS1   EQU   CFCNTRD
PFCRSV01 EQU   ISTPFCRR+13
PFCFTA   EQU   ISTPFCRR+12
CRRFRR   EQU   PFCFRRO
CRRCHAIN EQU   PFCCRRO
CRRLEN   EQU   PFCCRRLN
PFCRSV10 EQU   PFCCRR+1
CRRID    EQU   PFCCRRID
ZSAZTRAC EQU   ISTZSAVE+36
ZSAZSVVR EQU   ISTZSAVE+12
ZSAZSVRR EQU   ISTZSAVE+8
ZSAZSVFC EQU   ISTZSAVE+4
ZSAZACTV EQU   ZSAZSVMS
LCPFTYPE EQU   LCPRPHA
LCPRSTQH EQU   LCPLCCW
LCPCLREP EQU   ISTLCPB+44
LCPUBFSB EQU   LCPFLCCW
LCPRSV77 EQU   ISTLCPB+39
LCPLCCWC EQU   ISTLCPB+38
LCPRSV78 EQU   LCPFLG1
LCPTRANS EQU   LCPFLG1
LCPSTLB  EQU   LCPFLG1
LCPREDRV EQU   LCPFLG1
LCPDIRPT EQU   LCPFLG1
LCPINTER EQU   LCPFLG1
LCPRESET EQU   LCPFLG1
LCPSTYPE EQU   ISTLCPB+36
LCPFSNCH EQU   ISTLCPB+34
LCPFOSN  EQU   ISTLCPB+32
LCPTLBAD EQU   ISTLCPB+28
LCPFDB2  EQU   LCPFDBA+1
LCPFDB1  EQU   LCPFDBA
LCPNXLCW EQU   ISTLCPB+20
LCPDAF   EQU   LCPCID+2
LCPSAF   EQU   LCPCID
LCPLCCW1 EQU   ISTLCPB+12
LCPRRCNT EQU   LCPSEQ+1
LCPRRCCT EQU   LCPSEQ
LCPATOP  EQU   LCPFLAG2
LCPFREE  EQU   LCPFLAG2
LCPDSTAT EQU   LCPFLAG2
LCPEXRES EQU   LCPFID0
LCPZRIMM EQU   LCPTLBPI
LCPRSTRT EQU   LCPFLAG2
LCPASYN  EQU   LCPFLAG2
LCPPRFLG EQU   LCPFLAG2
LCPZMIRC EQU   LCPRUCNT
LCPCHAI2 EQU   LCPCHAIN+1
LCPCHNG  EQU   LCPCHAI1
LCPZRT0B EQU   LCPMNRCD
LCPZRT0A EQU   LCPMNRCD
LCPZRTL9 EQU   LCPZRT09
LCPZRTL8 EQU   LCPZRT08
LCPZRTL7 EQU   LCPZRT07
LCPZRTL6 EQU   LCPZRT06
LCPZRTL5 EQU   LCPZRT05
LCPZRTL4 EQU   LCPZRT04
LCPZRTL3 EQU   LCPZRT03
LCPZRTL2 EQU   LCPZRT02
LCPZRT01 EQU   LCPFLAGS
LCPZRT00 EQU   LCPFLAGS
LCPLNGTH EQU   ISTLCPB+1
LCPTYPE  EQU   ISTLCPB
LCCWDATA EQU   ISTLCCW+4
LCCWCNT  EQU   ISTLCCW+2
LCCWACI  EQU   LCCWFLAG
LCCWRFI  EQU   LCCWFLAG
LCCWPER  EQU   LCCWLSI
LCCWIDAT EQU   LCCWFLAG
LCCWNTVC EQU   LCCWFLAG
LCCWCKPT EQU   LCCWFLAG
LCCWCC   EQU   LCCWFLAG
LCCWCD   EQU   LCCWFLAG
LCCWTYPE EQU   LCCWCTL
LCCWMODE EQU   LCCWCTL
LCCWSOP  EQU   LCCWRWOP
@NM00050 EQU   LCCWRWOP
LCCWSD   EQU   LCCWOP
LCCWSI   EQU   LCCWOP
DVEBSCAR EQU   DVEBSCID+1
DVEBSCLN EQU   DVEBSCID
DVEACIND EQU   DVERDTEA
DIVRSV01 EQU   ISTDIVTH+6
DIVNUMFE EQU   ISTDIVTH+2
CONUESBF EQU   ISTCONFT+1362
CONSTVAR EQU   CONSTAID+1
CONSTFIL EQU   CONSTAID
CONBLKNO EQU   CONSCPID+2
CONFILL  EQU   CONSCPID+1
CONFCNL  EQU   CONSCPID
CONF01SV EQU   ISTCONFT+1352
CONSDMLC EQU   ISTCONFT+1348
CONSDECB EQU   ISTCONFT+1344
CONUNITS EQU   ISTCONFT+1342
CONRVPT1 EQU   ISTCONFT+1341
CONGLBBH EQU   ISTCONFT+1340
CONRSV24 EQU   ISTCONFT+1312
CONFTTAT EQU   ISTCONFT+1284
CONFXXAT EQU   ISTCONFT+1256
CONFLDAT EQU   ISTCONFT+1228
CONFTRAT EQU   ISTCONFT+1200
CONFNSAT EQU   ISTCONFT+1172
CONCSCB  EQU   ISTCONFT+1168
CONRSV50 EQU   ISTCONFT+1166
CONLIST  EQU   ISTCONFT+1164
CONSTAFP EQU   ISTCONFT+1160
CONECDET EQU   ISTCONFT+1156
CONRECON EQU   ISTCONFT+1036
CONNTSOL EQU   ISTCONFT+916
CONTRACE EQU   ISTCONFT+796
CONTOLTP EQU   ISTCONFT+676
CONVVTAM EQU   ISTCONFT+556
CONVTHDR EQU   ISTCONFT+420
CONRSV01 EQU   ISTCONFT+417
CONNSNEC EQU   CONFLG01
CONFTPSA EQU   CONFLG01
CONFTTA  EQU   CONFLG01
CONFTNSA EQU   CONFLG01
CONFTNAC EQU   CONFLG01
CONFTEXS EQU   CONFLG01
CONFTTMR EQU   CONFLG01
CONFTSTM EQU   CONFLG01
CONCRPLD EQU   ISTCONFT+404
CONPPDBF EQU   ISTCONFT+392
CONNPDBF EQU   ISTCONFT+380
CONAPDBF EQU   ISTCONFT+368
CONWPDBF EQU   ISTCONFT+356
CONIODBF EQU   ISTCONFT+344
CONUEDBF EQU   ISTCONFT+332
CONVPDBF EQU   ISTCONFT+320
CONVFDBF EQU   ISTCONFT+308
CONLPDBF EQU   ISTCONFT+296
CONLFDBF EQU   ISTCONFT+284
CONSPDBF EQU   ISTCONFT+272
CONSFDBF EQU   ISTCONFT+260
CONCRPLS EQU   ISTCONFT+248
CONPPSBF EQU   ISTCONFT+236
CONNPSBF EQU   ISTCONFT+224
CONAPSBF EQU   ISTCONFT+212
CONWPSBF EQU   ISTCONFT+200
CONIOSBF EQU   ISTCONFT+188
CONVPSBF EQU   ISTCONFT+176
CONVFSBF EQU   ISTCONFT+164
CONLPSBF EQU   ISTCONFT+152
CONLFSBF EQU   ISTCONFT+140
CONSPSBF EQU   ISTCONFT+128
CONSFSBF EQU   ISTCONFT+116
CONRSV17 EQU   ISTCONFT+115
CONCRPL  EQU   CONBUFF+1
CONPPEX  EQU   CONBUFF+1
CONNPEX  EQU   CONBUFF+1
CONAPEX  EQU   CONBUFF+1
CONWPEX  EQU   CONBUFF+1
CONIOEX  EQU   CONBUFF
CONUECB  EQU   CONBUFF
CONVPEX  EQU   CONBUFF
CONVFEX  EQU   CONBUFF
CONLPEX  EQU   CONBUFF
CONLFEX  EQU   CONBUFF
CONSPEX  EQU   CONBUFF
CONSFEX  EQU   CONBUFF
CONACTV  EQU   CONSTAT
CONVRYIN EQU   CONSTAT
CONLODED EQU   CONSTAT
CONDSOPN EQU   CONSTAT
CONSTOR  EQU   CONSTAT
@NM00049 EQU   CONSTAT
@NM00048 EQU   CONSTAT
@NM00047 EQU   CONSTAT
CONIOTR  EQU   CONOPTFL
CONMODTR EQU   CONOPTFL
CONBTUTR EQU   CONOPTFL
CONBUFTR EQU   CONOPTFL
@NM00046 EQU   CONOPTFL
@NM00045 EQU   CONOPTFL
@NM00044 EQU   CONOPTFL
CONWRMST EQU   CONOPTFL
CONSYLST EQU   CONDSFLG
CONSYLIB EQU   CONDSFLG
CONSYOBJ EQU   CONDSFLG
@NM00043 EQU   CONDSFLG
@NM00042 EQU   CONDSFLG
@NM00041 EQU   CONDSFLG
CONMODFY EQU   ISTCONFT+109
CONDISPL EQU   ISTCONFT+108
CONVARY  EQU   ISTCONFT+107
CONHLTS  EQU   CONHALT
CONHLTQ  EQU   CONHALT
CONLAST  EQU   ISTCONFT+105
CONRES2  EQU   ISTCONFT+104
CONCID   EQU   ISTCONFT+102
CONBUFSZ EQU   ISTCONFT+100
CONRSV02 EQU   ISTCONFT+96
CONDCBBA EQU   ISTCONFT+92
CONDCBLA EQU   ISTCONFT+88
CONDCBOA EQU   ISTCONFT+84
CONLDPRM EQU   ISTCONFT+80
CONRDBUF EQU   ISTCONFT+76
CONSTCIB EQU   ISTCONFT+72
CONENDLA EQU   ISTCONFT+68
CONVARLA EQU   ISTCONFT+64
CONMODLA EQU   ISTCONFT+60
CONHLTLA EQU   ISTCONFT+56
CONNCSLA EQU   ISTCONFT+52
CONDISLA EQU   ISTCONFT+48
CONCIBAD EQU   ISTCONFT+44
CONACB   EQU   ISTCONFT+40
CONFBPNM EQU   ISTCONFT+32
CONDMNM  EQU   ISTCONFT+24
CONAPSNM EQU   ISTCONFT+16
CONAPINM EQU   ISTCONFT+8
CONCONFG EQU   ISTCONFT
LDPTCEP  EQU   ISTLDPRM+24
LDPRSV02 EQU   ISTLDPRM+22
LDPRSV01 EQU   LDPFB2
LDPACTIF EQU   LDPFB2
LDPATACH EQU   LDPFB2
LDPFLAST EQU   LDPFB2
LDPRSV03 EQU   LDPFG
LDPPB    EQU   LDPFG
LDPFX    EQU   LDPFG
LDPDCBA  EQU   ISTLDPRM+16
LDPPDS   EQU   ISTLDPRM+8
LDPMBR   EQU   ISTLDPRM
ISTPDAVP EQU   ISTAVT+40
ISTAVR01 EQU   ISTAVT+38
ISTVTTP  EQU   ISTAVT+36
ISTAGTWT EQU   ISTAVT+34
ISTATRT  EQU   ISTAVT+32
ISTARID  EQU   ISTAVT+30
ISTX1    EQU   ISTAVT+29
ISTPHNM  EQU   ISTAVT+24
ISTAPSEX EQU   ISTAVT+20
ISTVTTIK EQU   ISTAVT+18
AVTASID  EQU   ISTAVT+16
ISTAPSTA EQU   ISTAVT+12
ISTAS53  EQU   ISTAVT+8
ISTAHIP  EQU   ISTAS49
ISTACVT  EQU   ISTAVT
ATCAOS   EQU   ISTATCVT+1584
ATCPOPAB EQU   ATCAOSM+640
ATCVIOPM EQU   ATCAOSM+636
ATCTPMMI EQU   ATCAOSM+632
ATCTPMPB EQU   ATCAOSM+600
ATCRSV88 EQU   ATCAOSM+596
ATCRPLCT EQU   ATCAOSM+594
ATCCRACT EQU   ATCAOSM+592
ATCSRBCT EQU   ATCAOSM+590
ATCRSV75 EQU   ATCAOSM+589
ATCRSV66 EQU   ATCZFLAG
ATCZF001 EQU   ATCZFLAG
ATCTPCP1 EQU   ATCAOSM+584
ATCTPCP0 EQU   ATCAOSM+580
ATCAICTN EQU   ATCAOSM+576
ATCZR01  EQU   ATCAOSM+572
ATCMPLTA EQU   ATCAOSM+568
ATCASCB  EQU   ATCAOSM+564
ATCAP86  EQU   ATCAOSM+560
ATCAP85  EQU   ATCAOSM+556
ATCAP84  EQU   ATCAOSM+552
ATCAP83  EQU   ATCAOSM+548
ATCAP82  EQU   ATCAOSM+544
ATCAP69  EQU   ATCAOSM+540
ATCAP66  EQU   ATCAOSM+536
ATCAP62  EQU   ATCAOSM+532
ATCAPC59 EQU   ATCAOSM+528
ATCAP56  EQU   ATCAOSM+524
ATCAP55  EQU   ATCAOSM+520
ATCRCFY0 EQU   ATCAOSM+516
ATCAP41  EQU   ATCAOSM+512
ATCAPC25 EQU   ATCAOSM+508
ATCAP23  EQU   ATCAOSM+504
ATCTPSPB EQU   ATCAOSM+472
ATCTRMPB EQU   ATCAOSM+440
ATCAPBE  EQU   ATCAOSM+436
ATCPSTA  EQU   ATCAOSM+432
ATCSMABF EQU   ATCAOSM+428
ATCSMAPR EQU   ATCAOSM+424
ATCTPWQA EQU   ATCAOSM+420
ATCSMAID EQU   ATCAOSM+416
ATCSMARA EQU   ATCAOSM+412
ATCCACXA EQU   ATCAOSM+408
ATCZLAAB EQU   ATCAOSM+404
ATCATA10 EQU   ATCAOSM+400
ATCHLTCB EQU   ATCAOSM+396
@NM00040 EQU   ATCVTFLG
ATCVTACT EQU   ATCVTFLG
ATCRPT40 EQU   ATCAOSM+388
ATCRPT39 EQU   ATCAOSM+384
ATCRPT38 EQU   ATCAOSM+380
ATCRPT37 EQU   ATCAOSM+376
ATCRPT36 EQU   ATCAOSM+372
ATCRPT35 EQU   ATCAOSM+368
ATCRPT34 EQU   ATCAOSM+364
ATCRPT33 EQU   ATCAOSM+360
ATCRPT32 EQU   ATCAOSM+356
ATCRPT31 EQU   ATCAOSM+352
ATCRPT30 EQU   ATCAOSM+348
ATCRPT29 EQU   ATCAOSM+344
ATCRPT28 EQU   ATCAOSM+340
ATCRPT27 EQU   ATCAOSM+336
@NM00039 EQU   ATCAOSM+333
@NM00038 EQU   @NM00037
ATCSNUF  EQU   @NM00037
ATCOPKL  EQU   @NM00037
ATCABEN  EQU   @NM00037
ATCAIWT  EQU   ATCAOSM+328
ATCINFDD EQU   ATCAOSM+324
ATCORFMG EQU   ATCAOSM+320
ATCORFRL EQU   ATCAOSM+316
ATCOROBT EQU   ATCAOSM+312
ATCORQG  EQU   ATCORSRB
ATCORTBF EQU   ATCSQAFR
ATCRPLAC EQU   ATCRPLCN+2
ATCRPLRC EQU   ATCRPLCN
ATCCRPLQ EQU   ATCCRPL
ATCSRBAC EQU   ATCSRBCN+2
ATCSRBRC EQU   ATCSRBCN
ATCSRBQ  EQU   ATCSRB
ATCCRAAC EQU   ATCCRACN+2
ATCCRARC EQU   ATCCRACN
ATCCRAQ  EQU   ATCCRA
ATCRPT12 EQU   ATCAOSM+276
ATCDMAPP EQU   ATCAOSM+272
ATCAP38  EQU   ATCAOSM+268
ATCZDFJ0 EQU   ATCAOSM+260
ATCAP51  EQU   ATCAOSM+256
ATCZPAB2 EQU   ATCAOSM+224
ATCZPAB1 EQU   ATCAOSM+192
ATCZLFVT EQU   ATCAOSM+188
ATCZLPVT EQU   ATCAOSM+184
ATCZDVTX EQU   ATCAOSM+180
ATCZDVTA EQU   ATCAOSM+176
ATCZDVT9 EQU   ATCAOSM+172
ATCZDVT8 EQU   ATCAOSM+168
ATCZDVT7 EQU   ATCAOSM+164
ATCRSV56 EQU   ATCDAPVT+22
ATCDAPDG EQU   ATCDAPVT+20
ATCDXCEA EQU   ATCDAPVT+16
ATCDCEA  EQU   ATCDAPVT+12
ATCDPCIA EQU   ATCDAPVT+8
ATCDSIOA EQU   ATCDAPVT+4
ATCDEOEA EQU   ATCDAPVT
ATCZLAEA EQU   ATCLDAPP+16
ATCZLCEA EQU   ATCLDAPP+12
ATCRSV17 EQU   ATCLDAPP+8
ATCSMFRR EQU   ATCLDAPP+4
ATCCDTID EQU   ATCLDAPP
ATCZAEA  EQU   ATCICAPP+16
ATCZCEA  EQU   ATCICAPP+12
ATCCDTCB EQU   ATCICAPP+8
ATCZSIOA EQU   ATCICAPP+4
ATCCDRPH EQU   ATCICAPP
ATCAP65  EQU   ATCAOSM+96
ATCZDVT6 EQU   ATCAOSM+92
ATCZDVT4 EQU   ATCAOSM+88
ATCZDVT3 EQU   ATCAOSM+84
ATCZDVT1 EQU   ATCAOSM+80
ATCICNCB EQU   ATCAOSM+76
ATCZPSVT EQU   ATCAOSM+72
ATCZFSVT EQU   ATCAOSM+68
ATCAP64  EQU   ATCAOSM+64
ATCAP63  EQU   ATCAOSM+60
ATCAP61  EQU   ATCAOSM+56
ATCAP58  EQU   ATCAOSM+52
ATCAP57  EQU   ATCAOSM+48
ATCAP54  EQU   ATCAOSM+44
ATCAP53  EQU   ATCAOSM+40
ATCAP52  EQU   ATCAOSM+36
ATCAP12  EQU   ATCAOSM+20
ATCAP11  EQU   ATCAOSM+16
ATCCMTCB EQU   ATCAOSM+12
ATCPRPH  EQU   ATCAOSM+8
ATCGSRBF EQU   ATCGSRBG
ATCSRBRT EQU   ATCAOSM
@NM00036 EQU   @NM00035
ATCVTMAB EQU   @NM00035
@NM00034 EQU   ATCVTBAM
ATCVDLOK EQU   ISTATCVT+904
ATCVFPAB EQU   ISTATCVT+872
ATCVDPAB EQU   ISTATCVT+840
ATCIOECB EQU   ISTATCVT+836
ATCMODTB EQU   ISTATCVT+828
ATCUSSPT EQU   ISTATCVT+824
ATCSRTAB EQU   ISTATCVT+820
@NM00033 EQU   ISTATCVT+819
@NM00032 EQU   ATCSTAT2
ATCTRSMS EQU   ATCSTAT2
ATCTRLOK EQU   ATCSTAT2
ATCTRPSS EQU   ATCSTAT2
ATCTRESC EQU   ATCSTAT2
ATCTRAPI EQU   ATCSTAT2
ATCNMCTR EQU   ISTATCVT+816
ATCSEC51 EQU   ATCSECST
ATCSEC40 EQU   ATCSIPD+8
ATCSEC30 EQU   ATCSIPD+4
ATCSEC21 EQU   ATCSIPD
ATCSEC10 EQU   ATCSOPD+4
ATCSEC01 EQU   ATCSOPD
ATCPOIA  EQU   ATCRNO+1
@NM00031 EQU   ATCRNO
ATCPODVT EQU   ISTATCVT+784
ATCS49XL EQU   ISTATCVT+780
ATCS49XI EQU   ISTATCVT+776
ATCLCLCT EQU   ATCVLCNT+2
ATCRNCNT EQU   ATCVLCNT
ATCCFEAD EQU   ISTATCVT+768
ATCPTR00 EQU   ISTATCVT+736
ATCRSV10 EQU   ISTATCVT+704
ATCTACB  EQU   ISTATCVT+700
ATCVTINM EQU   ISTATCVT+696
ATCTCLIM EQU   ISTATCVT+692
ATCTCLOM EQU   ISTATCVT+688
ATCVTIPB EQU   ISTATCVT+656
ATCTCIPB EQU   ISTATCVT+624
ATCTIPAB EQU   ISTATCVT+592
ATCOCCCB EQU   ISTATCVT+588
ATCOCCOB EQU   ISTATCVT+584
ATCCDLAD EQU   ISTATCVT+580
ATCCCLAD EQU   ISTATCVT+576
ATCDLRPB EQU   ISTATCVT+544
ATCPGPAB EQU   ISTATCVT+512
ATCVPAB1 EQU   ISTATCVT+480
ATCRSV97 EQU   ISTATCVT+476
ATCDVTLK EQU   ISTATCVT+456
ATCAP35  EQU   ISTATCVT+448
ATCRSV99 EQU   ISTATCVT+440
ATCONFIG EQU   ISTATCVT+432
ATCNODDS EQU   ISTATCVT+428
ATCNODEL EQU   ISTATCVT+420
ATCRSV69 EQU   ISTATCVT+416
ATCAPCR5 EQU   ISTATCVT+412
ATCLDECB EQU   ISTATCVT+408
ATCLDNCS EQU   ISTATCVT+404
ATCCDPTR EQU   ISTATCVT+400
ATCADEL  EQU   ISTATCVT+396
ATCTODVT EQU   ISTATCVT+392
ATCDEBCH EQU   ISTATCVT+388
ATCHBSIZ EQU   ATCHPGM+2
ATCHBFNO EQU   ATCHPGM
ATCCRME  EQU   ISTATCVT+380
ATCRVCHS EQU   ISTATCVT+372
ATCECTLP EQU   ISTATCVT+368
ATCZDVTB EQU   ISTATCVT+364
ATCECPRT EQU   ISTATCVT+360
ATCVTLOD EQU   ISTATCVT+356
ATCTRPAB EQU   ISTATCVT+352
ATCMSGM  EQU   ISTATCVT+348
ATCEPT   EQU   ISTATCVT+340
ATCDVT   EQU   ISTATCVT+336
ATCTRCPT EQU   ISTATCVT+332
ATCDVLOD EQU   ISTATCVT+328
ATCALERT EQU   ISTATCVT+324
ATCEPA   EQU   ISTATCVT+320
ATCSAF   EQU   ISTATCVT+318
ATCXRANG EQU   ISTATCVT+317
ATCLAST  EQU   ATCSHRFG
ATCSHRTN EQU   ISTATCVT+308
ATCUEP   EQU   ISTATCVT+304
ATCOCRT  EQU   ISTATCVT+300
ATCCSMA  EQU   ATCCSMR
ATCESC02 EQU   ISTATCVT+292
ATCESC01 EQU   ISTATCVT+288
ATCMNT   EQU   ISTATCVT+272
ATCRSV16 EQU   ISTATCVT+270
ATCMAXID EQU   ISTATCVT+269
ATCMSGSP EQU   ATCCOM+268
ATCACTRM EQU   ATCCOM+264
ATCNERAP EQU   ATCCOM+260
ATCNESAL EQU   ATCCOM+256
ATCRCC65 EQU   ATCCOM+252
ATCRCC26 EQU   ATCCOM+248
ATCRCC63 EQU   ATCCOM+244
ATCRSV11 EQU   ATCCOM+242
ATCAPOST EQU   ATCCOM+236
ATCNERFN EQU   ATCCOM+232
ATCNERNE EQU   ATCCOM+228
ATCNERCV EQU   ATCCOM+224
ATCNERST EQU   ATCCOM+220
ATCDCC61 EQU   ATCCOM+216
ATCDCC60 EQU   ATCCOM+212
ATCSRTDF EQU   ATCCOM+208
ATCSRTAD EQU   ATCCOM+204
ATCFIRA  EQU   ATCCOM+200
ATCSMBQ  EQU   ATCCOM+196
ATCSMRC  EQU   ATCCOM+192
ATCSMRS  EQU   ATCCOM+188
ATCSMQU  EQU   ATCCOM+184
ATCSMRQ  EQU   ATCCOM+180
ATCACDA  EQU   ATCCOM+176
ATCSTMA  EQU   ATCCOM+172
ATCFRSTR EQU   ATCCOM+168
ATCREADA EQU   ATCCOM+160
ATCALOAD EQU   ATCCOM+156
ATCBLDLA EQU   ATCCOM+152
ATCFBRPH EQU   ATCCOM+148
ATCBFTRC EQU   ATCCOM+144
ATCTPBUF EQU   ATCTHTRC
ATCREMOV EQU   ATCCOM+136
ATCADD   EQU   ATCCOM+132
ATCBPDA  EQU   ATCCOM+128
ATCDVTPT EQU   ATCCOM+124
ATCFEPT  EQU   ATCCOM+120
ATCFDVT  EQU   ATCCOM+116
ATCPTCHA EQU   ATCCOM+108
ATCAUTHA EQU   ATCCOM+104
ATCACCTA EQU   ATCCOM+100
ATCRDTH  EQU   ATCCOM+96
ATCFRSCH EQU   ATCCOM+92
ATCFSB   EQU   ATCCOM+88
ATCHLTMS EQU   ATCCOM+84
ATCECPRM EQU   ATCCOM+80
ATCECNET EQU   ATCCOM+76
ATCECOPC EQU   ATCCOM+72
ATCVPARM EQU   ATCCOM+68
ATCECVRQ EQU   ATCCOM+64
ATCECSES EQU   ATCCOM+60
ATCOCHA  EQU   ATCCOM+56
ATCDSPLQ EQU   ATCCOM+52
ATCECDSP EQU   ATCCOM+48
ATCVARYQ EQU   ATCCOM+44
ATCECVRY EQU   ATCCOM+40
ATCHALTQ EQU   ATCCOM+36
ATCECHLT EQU   ATCCOM+32
ATCMODQ  EQU   ATCCOM+28
ATCECMOD EQU   ATCCOM+24
ATCASCHD EQU   ATCCOM+20
ATCSRT   EQU   ATCCOM+16
ATCRDT   EQU   ATCCOM+12
ATCDCFRR EQU   ATCCOM+8
ATCAPI   EQU   ATCCOM+4
ATCRSV04 EQU   ATCSTAT4
ATCVTTRC EQU   ATCSTAT4
ATCNCSD  EQU   ATCSTAT4
ATCMTST  EQU   ATCSTAT4
ATCTPRT  EQU   ATCSTAT4
ATCPRTAT EQU   ATCSTAT4
@NM00030 EQU   ATCPOFLG
ATCPOUNS EQU   ATCPOFLG
ATCHSDMF EQU   ATCSTFLG
@NM00029 EQU   ATCSTAT1
ATCMDHLT EQU   ATCSTAT1
ATCINHLT EQU   ATCSTAT1
ATCNETSL EQU   ATCSTAT1
ATCQKHLT EQU   ATCSTAT1
ATCSNHLT EQU   ATCSTAT1
ATCACTIV EQU   ATCSTAT1
ATCSTART EQU   ATCSTAT1
PATRSV01 EQU   PATFLAGA
PATUSEFG EQU   PATFLAGA
PATRDCNT EQU   ISTPAT+6
PATGRPID EQU   ISTPAT+5
PATPTHID EQU   ISTPAT+4
PATDINDX EQU   ISTPAT+2
PATGINDX EQU   ISTPAT
GNTGRPNM EQU   ISTGNT
DNTTELNO EQU   ISTDNT+1
DNTCTDIG EQU   ISTDNT
RLSRSV02 EQU   ISTRLS+140
RLSRSV01 EQU   ISTRLS+138
RLSCTELU EQU   ISTRLS+136
RLSPRE   EQU   ISTRLS
RDARSVPT EQU   ISTRDA+84
RDAPUBI  EQU   ISTRDA+83
RDADFCUA EQU   ISTRDA+80
RDACTPCC EQU   ISTRDA+79
RDADACUA EQU   ISTRDA+76
RDALUBA  EQU   RDAUCBAD+1
RDACHQI  EQU   RDAUCBAD
RDARSV01 EQU   RDAFLAG
RDARBISA EQU   RDAFLAG
RDAPRE   EQU   ISTRDA
RSWRSV01 EQU   ISTRSW+152
RSWRSV02 EQU   ISTRSW+150
RSWCTELU EQU   ISTRSW+148
RSWGRUPZ EQU   ISTRSW+146
RSWDIALZ EQU   ISTRSW+144
RSWGRUPT EQU   ISTRSW+140
RSWDIALT EQU   ISTRSW+136
RSWPRE   EQU   ISTRSW
RLXRSV03 EQU   ISTRLX+80
RLXRSV02 EQU   ISTRLX+77
RLXRSV01 EQU   RLXFLAGA
RLXINUSE EQU   RLXFLAGA
RLXNLUX  EQU   ISTRLX+72
RLXPRE   EQU   ISTRLX
RPXRSV01 EQU   ISTRPX+80
RPXRSV02 EQU   ISTRPX+77
RPXMAXLU EQU   ISTRPX+76
RPXFLUX  EQU   ISTRPX+72
RPXPRE   EQU   ISTRPX
RLURSV02 EQU   ISTRLU+172
RLULGMOD EQU   ISTRLU+164
RLUMODEP EQU   RLUMODET+8
RLUMODEN EQU   RLUMODET
RLUUSSPT EQU   RLUUSSTB+8
RLUUSSNM EQU   RLUUSSTB
RLURSV01 EQU   ISTRLU+137
RLULOCAD EQU   ISTRLU+136
RLUNCPPM EQU   RLUNCPPC+1
RLUNCPPN EQU   RLUNCPPC
RLUPACEM EQU   RLUPACE+1
RLUPACEN EQU   RLUPACE
RLUINTA  EQU   ISTRLU+128
RLUSSCFM EQU   ISTRLU+127
RLUCRRSV EQU   RLUCRFLG
RLUACTLU EQU   RLUCRFLG
RLURSV00 EQU   RLUFLAG
RLUNDSES EQU   RLUFLAG
RLUGSTAT EQU   RLUFLAG
RLUBATCH EQU   RLUFLAG
RLUTYPE  EQU   ISTRLU+124
RLUCRPR  EQU   ISTRLU
RCCRVPT2 EQU   ISTRCC+144
RCCXTOSW EQU   ISTRCC+140
RCCSWTOX EQU   ISTRCC+136
RCCRSPT2 EQU   ISTRCC+133
RCCADDR  EQU   ISTRCC+132
RCCPASSL EQU   ISTRCC+131
RCCMXOUT EQU   ISTRCC+130
RCCMXDAT EQU   ISTRCC+128
RCCINDEX EQU   ISTRCC+126
RCCPATHZ EQU   ISTRCC+124
RCCPATHT EQU   ISTRCC+120
RCCDPQ   EQU   ISTRCC+116
RCCTPAB  EQU   ISTRCC+112
RCCRSV02 EQU   ISTRCC+109
RCCCRRSV EQU   RCCCRFLG
RCCCTCFL EQU   RCCCRFLG
RCCACTPU EQU   RCCCRFLG
RCCNCSPL EQU   ISTRCC+104
RCCRPHCN EQU   ISTRCC+100
@NM00028 EQU   ISTRCC+87
RCCSESCT EQU   ISTRCC+86
RCCIDNUM EQU   RCCID48+3
RCCIDBLK EQU   RCCID48+2
RCCIDPA2 EQU   RCCID48+1
RCCIDPUT EQU   RCCID48
RCCIDPA1 EQU   RCCSTAID
RCCCTELU EQU   ISTRCC+76
RCCCNCNT EQU   ISTRCC+75
RCCRTGOH EQU   RCCFLAGB
RCCBRKCN EQU   RCCFLAGB
RCCRESET EQU   RCCFLAGB
RCCFINAL EQU   RCCFLAGB
RCCBNNSP EQU   RCCFLAGB
RCCIRETR EQU   RCCFLAGB
RCCDIALP EQU   RCCFLAGB
RCCCTPGD EQU   RCCFLAG
RCCPRGDN EQU   RCCFLAG
RCCOUERP EQU   RCCFLAG
RCCOHIMM EQU   RCCFLAG
RCCLDISC EQU   RCCFLAG
RCCTYPE  EQU   ISTRCC+72
RCCPRE   EQU   ISTRCC
RDSCTATR EQU   ISTRDS+74
RDSPRE   EQU   ISTRDS
RINRSV05 EQU   ISTRIN+156
RINRSV04 EQU   ISTRIN+152
RINLOCRN EQU   ISTRIN+148
RINRSV02 EQU   ISTRIN+145
RTRCNCNT EQU   RINCNCNT
RTRNCSPL EQU   RINNCSPL
RTRRPHCN EQU   RINRPHCN
RTRVPAB  EQU   RINVPAB
RTRREMOT EQU   RINREMOT
RTRRLDAF EQU   RINRLDAF
RTRNODID EQU   RINNODID
RINRSV01 EQU   RINDFD
RTRLDISC EQU   RINLDISC
RTRNODEF EQU   RINNODEF
RTRREMPO EQU   RINREMPO
RINCRPRE EQU   ISTRIN
RTRRSV04 EQU   ISTRTR+210
RTRLCTI  EQU   ISTRTR+209
RTRIDCAS EQU   RTRBSCID+1
RTRIDLEN EQU   RTRBSCID
RTRRSVDD EQU   ISTRTR+181
RTRRDFG  EQU   ISTRTR+180
RTRDIAA  EQU   ISTRTR+176
RTRPOLA  EQU   ISTRTR+172
RTRCADDR EQU   ISTRTR+164
RTRCTADR EQU   ISTRTR+162
RTRCTPOL EQU   ISTRTR+160
RTRCTDIA EQU   ISTRTR+158
RTRRSV03 EQU   ISTRTR+156
RTRRVPT1 EQU   ISTRTR+152
RTRBHSN1 EQU   ISTRTR+144
RTRCRSV2 EQU   RTRCRFLG
RTRDTRLM EQU   RTRLSCMD
RTRCRSV1 EQU   RTRCRFLG
RTRTRMAX EQU   ISTRTR+142
RTRRSV24 EQU   RTRRDFF
RTRRFDEK EQU   RTRRDFF
RTRRFANK EQU   RTRRDFF
RTRRFPFK EQU   RTRRDFF
RTRRFPEN EQU   RTRRDFF
RTRRFXCT EQU   RTRRDFF
RTRRESCT EQU   RTRRDFE
RTRRESUP EQU   RTRRDFE
RTRREATT EQU   RTRRDFE
RTRRECHK EQU   RTRRDFE
RTRREACR EQU   RTRRDFE
RTRRSV0A EQU   RTRRDFE
RTRREBRK EQU   RTRRDFE
RTRRSV11 EQU   RTRRDFD
RTRRSV10 EQU   RTRRDFD
RTRRDBHI EQU   RTRRDFD
RTRRDBHD EQU   RTRRDFD
RTRRDBHN EQU   RTRRDFD
RTRRSV23 EQU   RTRRDFC
RTRRCXMS EQU   RTRRDFC
RTRRCMSG EQU   RTRRDFC
RTRRCBLK EQU   RTRRDFC
RTRRCPT3 EQU   RTRRDFC
RTRRCIT2 EQU   RTRRDFC
RTRRCIT1 EQU   RTRRDFC
RTRRSV32 EQU   RTRRDFB
RTRRBEND EQU   RTRRDFB
RTRRBECT EQU   RTRRDFB
RTRRSV02 EQU   RTRRDFA
RTRRACTR EQU   RTRRDFA
RTRRSV60 EQU   RTRRDFA
RTRRACDT EQU   RTRRDFA
RTRRAPT3 EQU   RTRRAALL
RTRRAPT2 EQU   RTRRAALL
RTRRAPT1 EQU   RTRRAALL
RTRRAATN EQU   RTRRDFA
RTRRSV45 EQU   ISTRTR+132
RTRRSV01 EQU   ISTRTR+130
RTRCTECM EQU   ISTRTR+128
RTRADRPT EQU   RTRADR+1
RTRRSV22 EQU   RTRFLAG
RTRRSV51 EQU   RTRFLAG
RTRRSV21 EQU   RTRFLAG
RTRCRPR  EQU   ISTRTR
RCLRVPT2 EQU   ISTRCL+92
RCLRVPT1 EQU   ISTRCL+88
RCLGPOLA EQU   ISTRCL+84
RCLCTNGP EQU   ISTRCL+82
RCLRSV01 EQU   ISTRCL+80
RCLCTECM EQU   ISTRCL+78
RCLCTETR EQU   ISTRCL+76
RCLGPADR EQU   RCLADR+1
RCLRSV33 EQU   RCLFLAG
RCLBATCH EQU   RCLFLAG
RCLRSV22 EQU   RCLFLAG
RCLPRE   EQU   ISTRCL
RPTRSV03 EQU   ISTRPT+156
RPTRSV02 EQU   ISTRPT+152
RPTNSNSV EQU   ISTRPT+148
RPTPEPCT EQU   ISTRPT+144
RPTDAFSV EQU   ISTRPT+142
RPTRSV01 EQU   ISTRPT+141
RPTDYNAM EQU   RPTFLAG1
RPTVYIMM EQU   RPTFLAG1
RPTHLVPD EQU   RPTFLAG1
RPTASLEP EQU   RPTFLAG1
RPTATERM EQU   ISTRPT+132
RPTLNSAF EQU   RPTLNCID
RPTLN    EQU   ISTRPT
RLNRVPT2 EQU   ISTRLN+112
RLNNCSPL EQU   ISTRLN+108
RLNX2SW  EQU   ISTRLN+104
@NM00027 EQU   ISTRLN+103
RLNCRRSV EQU   RLNCRFLG
RLNSVSKP EQU   RLNLSCMD
RLNSESLM EQU   RLNLSCMD
RLNNPRLM EQU   RLNLSCMD
RLNPAUSE EQU   ISTRLN+101
RLNPOLMT EQU   ISTRLN+100
RLNACTSN EQU   ISTRLN+98
RLNRESV1 EQU   ISTRLN+97
RLNACTRM EQU   ISTRLN+96
RLNCTSES EQU   ISTRLN+95
RLNRDSLM EQU   ISTRLN+94
RLNAUTOA EQU   ISTRLN+92
RLNRDFD  EQU   RLNRDF+3
RLNRDFC  EQU   RLNRDF+2
RLNMULTP EQU   RLNRDFB
RLNRAPOL EQU   RLNRDFB
RLNRSV0B EQU   RLNRDFB
RLNAUTOD EQU   RLNRDFB
RLNRBUSE EQU   RLNRDFB
RLNRANCP EQU   RLNRDFA
RLNRAEP  EQU   RLNRDFA
RLNGANSW EQU   RLNRDFA
RLNRSV04 EQU   RLNSTAT2
RLNINUSE EQU   RLNSTAT2
RLNOHIN  EQU   RLNSTAT2
RLNRSV03 EQU   RLNSTAT1
RLNVD    EQU   RLNSTAT1
RLNINOPP EQU   RLNSTAT1
RLNINOPL EQU   RLNSTAT1
RLNLRST  EQU   RLNSTAT1
RLNTRAP  EQU   RLNSTAT1
RLNACTCT EQU   ISTRLN+84
RLNCTECM EQU   ISTRLN+82
RLNCTEIN EQU   ISTRLN+80
RLNCTETR EQU   ISTRLN+78
RLNCTECL EQU   ISTRLN+76
RLNCUA   EQU   RLNUCBAD
RLNRSV01 EQU   RLNFLAG
RLNEAM   EQU   RLNFLAG
RLNPRE   EQU   ISTRLN
RGPRVPT2 EQU   ISTRGP+88
RGPRVPT1 EQU   ISTRGP+84
RGPCTECM EQU   ISTRGP+82
RGPCTEIN EQU   ISTRGP+80
RGPCTETR EQU   ISTRGP+78
RGPCTECL EQU   ISTRGP+76
RGPCTELN EQU   ISTRGP+74
RGPRSV03 EQU   ISTRGP+73
RGPRSV02 EQU   RGPFLG
RGPASDLC EQU   RGPFLG
RGPABSC  EQU   RGPFLG
RGPASS   EQU   RGPFLG
RGPPRE   EQU   ISTRGP
RRNRINNM EQU   ISTRRN+248
@NM00026 EQU   ISTRRN+247
RRNRDCUA EQU   ISTRRN+244
RRNLASTE EQU   ISTRRN+240
RRNNCSPL EQU   ISTRRN+236
RRNMSIZE EQU   ISTRRN+228
RRNNCPNM EQU   ISTRRN+221
RRNCTPCC EQU   ISTRRN+220
RRNHBUFS EQU   ISTRRN+218
RRNHLENT EQU   RRNHPRE+1
RRNHLENH EQU   RRNHPRE
RRNNMNCP EQU   ISTRRN+208
RRNRSV04 EQU   ISTRRN+200
RRNRSV88 EQU   RRNNMDPD+7
RRNPUBI  EQU   RRNNMDPD+6
RRNDPLUB EQU   RRNNMDPD
RRNEPADR EQU   ISTRRN+190
RRNCPLUB EQU   ISTRRN+184
RRNFLUX  EQU   ISTRRN+180
RRNRSV05 EQU   RRNCMFD
RRNREMPO EQU   RRNCMFD
RRNCDREC EQU   RRNCMFD
RRNCDDSI EQU   RRNCMFD
RRNCDBCK EQU   RRNCMFD
RRNCDDTL EQU   RRNCMFD
RRNCDSTD EQU   RRNCMFD
RRNCDCSP EQU   RRNCMFD
RRNCCCSL EQU   RRNCMFC
RRNCCSIM EQU   RRNCMFC
RRNCCRCM EQU   RRNCMFC
RRNCCRIM EQU   RRNCMFC
RRNCCCRC EQU   RRNCMFC
RRNCCRST EQU   RRNCMFC
RRNCCRDQ EQU   RRNCMFC
RRNCCRCN EQU   RRNCMFC
RRNCBALT EQU   RRNCMFB
RRNCBMOD EQU   RRNCMFB
RRNCBNPL EQU   RRNCMFB
RRNCBRLS EQU   RRNCMFB
RRNCBRDS EQU   RRNCMFB
RRNCBDLR EQU   RRNCMFB
RRNCBDLH EQU   RRNCMFB
RRNCBDLO EQU   RRNCMFB
RRNCADGO EQU   RRNCMFA
RRNCADTD EQU   RRNCMFA
RRNCACDT EQU   RRNCMFA
RRNCAMBH EQU   RRNCMFA
RRNCAATI EQU   RRNCMFA
RRNCAATG EQU   RRNCMFA
RRNCAATD EQU   RRNCMFA
RRNCAALL EQU   RRNCMFA
RRNRSV55 EQU   RRNRDF+3
RRNPTASL EQU   RRNRDFB+1
RRNRSV01 EQU   RRNRDFB+1
RRNVYDON EQU   RRNRDFB+1
RRNRBBUP EQU   RRNRDFB+1
RRNRSV03 EQU   RRNRDFB
RRNRBCT2 EQU   RRNRDFB
RRNRBCT1 EQU   RRNRDFB
RRNRBSEC EQU   RRNRDFB
RRNRBCCT EQU   RRNRDFB
RRNRBCCL EQU   RRNRDFB
RRNRSV02 EQU   RRNRDFB
RRNRBMDL EQU   RRNRDFB
RRNRAPEP EQU   RRNRDFA
RRNRANCP EQU   RRNRDFA
RRNRAOLT EQU   RRNRDFA
RRNRASYN EQU   RRNRDFA
RRNRADMP EQU   RRNRDFA
RRNRAIPL EQU   RRNRDFA
RRNRASHT EQU   RRNRDFA
RRNCTENT EQU   ISTRRN+170
RRNCTECM EQU   ISTRRN+168
RRNCTEIN EQU   ISTRRN+166
RRNCTETR EQU   ISTRRN+164
RRNCTECL EQU   ISTRRN+162
RRNCTELI EQU   ISTRRN+160
RRNCTEGP EQU   ISTRRN+158
RRNCTBHS EQU   ISTRRN+156
RRNBHSET EQU   ISTRRN+152
RRNTRENT EQU   ISTRRN+148
RRNRLDIP EQU   ISTRRN+147
RRNRNCUA EQU   ISTRRN+144
RRNGRPA  EQU   ISTRRN+140
RRNLUBA  EQU   RRNUCBAD+1
RRNCHQI  EQU   RRNUCBAD
RRNRSV11 EQU   RRNFLAG
RRNDSTCT EQU   RRNFLAG
RRNERPIP EQU   RRNFLAG
RRNLCDIE EQU   RRNFLAG
RRNRBISA EQU   RRNFLAG
RRNRSV89 EQU   RRNFLAG
RRNPRE   EQU   ISTRRN
RLCRVPT2 EQU   ISTRLC+80
RLCRVPT1 EQU   ISTRLC+79
RLCLCCUA EQU   ISTRLC+76
RLCUCBAD EQU   RLCADR+1
RLCRSVDE EQU   RLCFLAG
RLCACNT  EQU   RLCFLAG
RLCRSV14 EQU   RLCFLAG
RLCRSV22 EQU   RLCFLAG
RLCPRE   EQU   ISTRLC
RAPRVPT2 EQU   ISTRAP+116
RAPRVPT1 EQU   ISTRAP+112
RAPBFACT EQU   ISTRAP+111
RAPRSV17 EQU   RAPFLGC
RAPRSV16 EQU   RAPFLGC
RAPRSV15 EQU   RAPFLGC
RAPRSV14 EQU   RAPFLGC
RAPRSV13 EQU   RAPFLGC
RAPRSV12 EQU   RAPFLGC
RAPRSV11 EQU   RAPFLGC
RAPRSV10 EQU   RAPFLGC
RAPANVPC EQU   RAPFLGB
RAPASPO  EQU   RAPFLGB
RAPAPPO  EQU   RAPFLGB
RAPAACQ  EQU   RAPFLGB
RAPAPRMT EQU   RAPFLGB
RAPAPASS EQU   RAPFLGB
RAPABLCK EQU   RAPFLGB
RAPALLF  EQU   RAPFLGB
RAPRSV06 EQU   RAPFLG
RAPRSV05 EQU   RAPFLG
RAPRSV04 EQU   RAPFLG
RAPRSV03 EQU   RAPFLG
RAPATLGN EQU   RAPFLG
RAPASLGI EQU   RAPFLG
RAPAQUI  EQU   RAPFLG
RAPABLGN EQU   RAPFLG
RAPACEQD EQU   ISTRAP+106
RAPTRPRE EQU   ISTRAP+104
RAPACEAP EQU   ISTRAP+100
RAPICEAQ EQU   ISTRAP+96
RAPICEAC EQU   ISTRAP+92
RAPICELG EQU   ISTRAP+88
RAPAPPWD EQU   ISTRAP+80
RAPACDEB EQU   ISTRAP+76
RAPACBA  EQU   ISTRAP+72
RAPPRE   EQU   ISTRAP
RDTVSRPL EQU   ISTRDT+132
RDTCRSPW EQU   ISTRDT+124
RDTCRSDS EQU   ISTRDT+116
@NM00025 EQU   ISTRDT+113
RRNSTCNT EQU   RDTSTCNT
RRNVYRPH EQU   RDTVYRPH
RDTTPAB  EQU   ISTRDT+104
RDTDPAB  EQU   ISTRDT+100
RDTEPAB  EQU   ISTRDT+96
RDTRSV01 EQU   RDTFLAGB
RDTBHSET EQU   RDTFLAGB
RDTCTCFL EQU   RDTFLAGB
RDTCTPGD EQU   RDTFLAGB
RDTPRGDN EQU   RDTFLAGB
RDTOUERP EQU   RDTFLAGB
RDTNODID EQU   ISTRDT+89
RDTMAXID EQU   ISTRDT+88
RDTCTSNT EQU   ISTRDT+86
RDTFLAGS EQU   ISTRDT+84
RDTBACK  EQU   ISTRDT+80
RDTFORW  EQU   ISTRDT+76
RDTLEN   EQU   RDTPLEN+1
RDTPRILS EQU   RDTPRIOR
RDTPRISW EQU   RDTPRIOR
RDTPRIRN EQU   RDTPRIOR
RDTPRILC EQU   RDTPRIOR
RDTPRIAP EQU   RDTPRIOR
@NM00024 EQU   RDTPRIOR
RDTPRE   EQU   ISTRDT
RCPRSV05 EQU   ISTRCPRE+120
RCPRSV04 EQU   ISTRCPRE+116
RCPRSV03 EQU   ISTRCPRE+112
RCPINTA  EQU   RCPLGNIN+16
RCPLGNCT EQU   RCPLGNIN+8
RCPLGNAP EQU   RCPLGNIN
@NM00023 EQU   RCPPMODE
RCPRRECD EQU   RCPPMODE
RCPRBASC EQU   RCPPMODE
RCPBFLIM EQU   ISTRCPRE+90
RCPBHSI2 EQU   ISTRCPRE+89
RCPBHSI1 EQU   ISTRCPRE+88
RCPACETR EQU   ISTRCPRE+84
RCPICEAQ EQU   ISTRCPRE+80
RCPLNAPA EQU   ISTRCPRE+76
RCPICELN EQU   ISTRCPRE+72
RCPPRE   EQU   ISTRCPRE
RPRCONID EQU   ISTRPRE+63
RPRCLVPD EQU   RPRFLAGC
RPRRSV05 EQU   RPRFLAGD
RPRCONP  EQU   RPRFLAGD
RPRACTP  EQU   RPRFLAGD
RPRRSON  EQU   RPRFLAGD
RPRCONCT EQU   RPRFLAGD
RPRLTASN EQU   RPRFLAGD
RPRSWDAF EQU   ISTRPRE+58
RPRSTPCT EQU   ISTRPRE+56
RPRRVPT1 EQU   ISTRPRE+52
RPRLGONB EQU   ISTRPRE+32
RPRLGONF EQU   ISTRPRE+28
RPRTIOCT EQU   ISTRPRE+26
RPRPEPCT EQU   ISTRPRE+24
RPRRSV03 EQU   RPRCAUSE
RPRRSYNC EQU   RPRCAUSE
RPRNOSRT EQU   RPRCAUSE
RPRINTST EQU   RPRFLAGB
RPRVYIMM EQU   RPRFLAGB
RPRHLVPD EQU   RPRFLAGB
RPRAOPN  EQU   RPRFLAGB
RPRENTVT EQU   RPRFLAGB
RPRENTVH EQU   RPRFLAGB
RPRENTIO EQU   RPRFLAGA
RPRENTBF EQU   RPRFLAGA
RPRTIED  EQU   RPRFLAGA
RPRACT   EQU   RPRFLAGA
RPRRLOCK EQU   ISTRPRE+12
RPRSAF   EQU   RPRCOMID
LOKXCL   EQU   @NM00021
LOKPRY   EQU   @NM00021
@NM00022 EQU   @NM00021
@NM00020 EQU   LOKCHNG
LOKCT    EQU   ISTLOK
DEVRSV03 EQU   ISTDEVCH+5
DEVPHYSA EQU   ISTDEVCH+4
DEVCSLPN EQU   DEVCHAR3
DEVCSTCL EQU   DEVCHAR3
DEVCCHEK EQU   DEVCHAR3
DEVCATTN EQU   DEVCHAR3
DEVCSWL  EQU   DEVFCCTL
DEVCRVB  EQU   DEVFCCTL
DEVCSSL  EQU   DEVFCCTL
DEVCBSC  EQU   DEVFCCTL
DEVMCODE EQU   ISTDEVCH+2
DEVCHAR2 EQU   DEVTCODE
DEVRSV01 EQU   DEVCHAR
DEVCCTL  EQU   DEVCHAR
DEVNNSPT EQU   DEVCHAR
DEVSPS   EQU   DEVCHAR
DEVCONVR EQU   DEVCHAR
DEVOTPUT EQU   DEVCHAR
DEVINPUT EQU   DEVCHAR
NCSRUITS EQU   NCSUSSRU+2
NCSRULEN EQU   NCSUSSRU
NCSAPPAB EQU   NCSAPP+608
NCSAPDAT EQU   NCSAPBUE+8
NCSAPRU  EQU   NCSAPBUE+3
NCSRSV04 EQU   NCSAPBUE
NCSAPEND EQU   NCSAPP+84
NCSAPTXT EQU   NCSAPP+76
NCSAPECB EQU   NCSAPP+72
NCSAPSA  EQU   NCSAPP
NCSPLPDB EQU   NCSPLSID+5
NCSPLNID EQU   NCSPLPHD
NCSPLPO  EQU   NCSPLSTA
NCSRSVD4 EQU   NCSPLSTA
NCSRSVD2 EQU   NCSCRMOD
NCSRSVD1 EQU   NCSCHKPT+1
NCSPTUSE EQU   NCSCHKPT+1
NCSRNME  EQU   NCSCHKPT+1
NCSCUA   EQU   NCSCHKPT+1
NCSLGMOD EQU   NCSCHKPT
NCSLGAPL EQU   NCSCHKPT
NCSDTRLM EQU   NCSCHKPT
NCSESLM  EQU   NCSCHKPT
NCSNRPL  EQU   NCSCHKPT
NCSPOLD  EQU   NCSCHKPT
NCSPLRTY EQU   ISTNCSPL+263
NCSPLRH  EQU   ISTNCSPL+260
NCSUFMCB EQU   ISTNCSPL+256
NCSMGLPT EQU   ISTNCSPL+252
NCSCPWPT EQU   ISTNCSPL+248
NCSSENS2 EQU   NCSSENSE+2
NCSSNS2  EQU   NCSSENSE+1
NCSSNS1  EQU   NCSSENSE
NCSPLNSN EQU   ISTNCSPL+240
NCSPLPID EQU   ISTNCSPL+231
NCSPLGID EQU   ISTNCSPL+230
NCSPLSQN EQU   ISTNCSPL+228
NCSRNAME EQU   ISTNCSPL+220
NCSPLRRP EQU   ISTNCSPL+204
NCSPLSPL EQU   ISTNCSPL+196
@NM00019 EQU   NCSPLFL5
NCSFORCE EQU   NCSPLFL5
NCSSDLK  EQU   NCSPLFL5
NCSSCPPS EQU   NCSPLFL5
NCSDLRSN EQU   ISTNCSPL+180
NCSPL2AP EQU   NCSPLFL4
NCSDSPN  EQU   NCSPLFL4
NCSDSPI  EQU   NCSPLFL4
NCSDSPA  EQU   NCSPLFL4
NCSDSPE  EQU   NCSPLFL4
NCSPLVID EQU   NCSPLFL4
NCSPLRSO EQU   NCSPLFL4
NCSDLNID EQU   NCSPLFL4
NCSEND   EQU   NCSPLFL3
NCSFINAL EQU   NCSPLFL3
NCSPID   EQU   NCSPLFL3
NCSGID   EQU   NCSPLFL3
NCSEPP   EQU   NCSPLFL3
NCSPLMOM EQU   NCSPLFL3
NCSPLVIT EQU   NCSPLFL2
NCSPLVIS EQU   NCSPLFL2
NCSREMPO EQU   NCSPLFL2
NCSOUFMC EQU   NCSPLFL2
NCSPLRSF EQU   NCSPLFL2
NCSPLVDP EQU   NCSPLFL2
NCSPL2CN EQU   NCSPLFL1
NCSPLAPU EQU   NCSPLFL1
NCSPLREQ EQU   NCSPLFL1
NCSPLRCR EQU   ISTNCSPL+172
NCSPLECB EQU   ISTNCSPL+164
NCSPLDAF EQU   NCSPLCID+2
NCSPLSAF EQU   NCSPLCID
NCSPLRCD EQU   NCSPLRAD+1
NCSLSCMD EQU   NCSPLRAD
NCSPLWRF EQU   ISTNCSPL+72
NCSPLWRE EQU   ISTNCSPL+68
NCSSTCMD EQU   NCSCRFLG
NCSUSRNF EQU   NCSCRFLG
NCSOPRQU EQU   NCSCRFLG
NCSCRDSE EQU   NCSCRFLG
NCSFMERP EQU   NCSCRFLG
NCSFMCLD EQU   NCSCRFLG
NCSPLCLD EQU   NCSCRFLG
NCSPLWRM EQU   NCSCRFLG
NCSPLUAD EQU   ISTNCSPL+64
NCSMSGSP EQU   ISTNCSPL+63
NCSNCPEP EQU   ISTNCSPL+62
NCSCMDB  EQU   NCSPLCMD+1
@NM00018 EQU   NCSCMDA
NCSPLUFM EQU   NCSCMDA
NCSPLFLO EQU   NCSCMDA
NCSPLSYN EQU   NCSCMDA
NCSPLCTL EQU   NCSCMDA
NCSPLSYS EQU   NCSCMDA
NCSCRPID EQU   ISTNCSPL+51
NCSDLID  EQU   ISTNCSPL+44
NCSRRNPT EQU   ISTNCSPL+24
NCSPRMRC EQU   ISTNCSPL+22
NCSOVFMC EQU   NCSPLVF1
NCSRSV02 EQU   NCSPLVFL
NCSDACLK EQU   NCSPLVFL
NCSABCON EQU   NCSPLVFL
NCSDCONT EQU   NCSPLVFL
NCSVNCSA EQU   NCSPLVFL
NCSVBF16 EQU   NCSPLVBF+1
NCSVBF15 EQU   NCSPLVBF+1
NCSVBF14 EQU   NCSPLVBF+1
NCSVBF13 EQU   NCSPLVBF+1
NCSVBF12 EQU   NCSPLVBF+1
NCSVBF11 EQU   NCSPLVBF+1
NCSVBF10 EQU   NCSPLVBF+1
NCSVBF09 EQU   NCSPLVBF+1
NCSVBF08 EQU   NCSPLVBF
NCSVBF07 EQU   NCSPLVBF
NCSVBF06 EQU   NCSPLVBF
NCSVBF05 EQU   NCSPLVBF
NCSVBF04 EQU   NCSPLVBF
NCSVBF03 EQU   NCSPLVBF
NCSVBF02 EQU   NCSPLVBF
NCSVBF01 EQU   NCSPLVBF
@NM00017 EQU   ISTNCSPL+16
NCSCRWKA EQU   NCSPFX+12
@NM00016 EQU   NCSPFX
PFXBCK   EQU   ISTPFX+12
PFXFWD   EQU   ISTPFX+8
PFXLNG   EQU   ISTPFX+5
PFXPRTY  EQU   ISTPFX+4
PFXCBID  EQU   PFXID
POHID    EQU   ISTPOHD+2
POHGEN   EQU   POHSTAT
POHRREQ  EQU   POHSTAT
POHRSVD2 EQU   POHSTAT
POHCNTRL EQU   POHSTAT
POHLBL   EQU   POHSTAT
POHDATA  EQU   POHSTAT
POHEND   EQU   POHSTAT
POHRSVD1 EQU   ISTPOHD
DYPRSV01 EQU   ISTDYPAB+12
DYPTSKID EQU   ISTDYPAB+8
DYPCHAIN EQU   ISTDYPAB+4
DYPFLGS  EQU   ISTDYPAB+2
DYPLNGTH EQU   ISTDYPAB+1
DYPTYPE  EQU   ISTDYPAB
PABRPHA  EQU   PABRPHFG+1
PABNODQ  EQU   PABFLAGS
PABINHBT EQU   PABFLAGS
PABERLOK EQU   PABERRLK
PABSSN   EQU   PABFLAGS
PABDYNAM EQU   PABFLAGS
PABNORPR EQU   PABFLAGS
PABPRIOR EQU   PABFLAGS
PABAPYP  EQU   PABFLAGS
PABDVTA  EQU   ISTPAB+9
PABOFFST EQU   ISTPAB+8
PABRSV02 EQU   PABCHAIN
PABDELAY EQU   PABCHAIN
PABRUNNG EQU   PABCHAIN
PABRESET EQU   PABCHAIN
PABUNCON EQU   PABCHAIN
PABCDP   EQU   PABCHAIN
PABRESCH EQU   PABCHAIN
PABCHNG  EQU   PABCHAIN
PABWEQP  EQU   PABWEQA+1
PABRSV01 EQU   PABWEQA
PABWEQG  EQU   PABWEQA
RPHNEXPO EQU   ISTRPH+104
RPHSAV16 EQU   RPHWORK+60
RPHSAV15 EQU   RPHWORK+56
RPHSAV14 EQU   RPHWORK+52
RPHSAV13 EQU   RPHWORK+48
RPHSAV12 EQU   RPHWORK+44
RPHSAV11 EQU   RPHWORK+40
RPHSAV10 EQU   RPHWORK+36
RPHSAVE9 EQU   RPHWORK+32
RPHSAVE8 EQU   RPHWORK+28
RPHSAVE7 EQU   RPHWORK+24
RPHSAVE6 EQU   RPHWORK+20
RPHSAVE5 EQU   RPHWORK+16
RPHSAVE4 EQU   RPHWORK+12
RPHSAVE3 EQU   RPHWORK+8
RPHSAVE2 EQU   RPHWORK+4
RPHSHALF EQU   RPHSAVE1+2
RPHSBIT8 EQU   RPHSBITS
RPHSBIT7 EQU   RPHSBITS
RPHSBIT6 EQU   RPHSBITS
RPHSBIT5 EQU   RPHSBITS
RPHSBIT4 EQU   RPHSBITS
RPHSBIT3 EQU   RPHSBITS
RPHSBIT2 EQU   RPHSBITS
RPHSBIT1 EQU   RPHSBITS
RPHSBYTE EQU   RPHSAVE1
RPHPABFG EQU   RPHPABQA
RPHSRP34 EQU   RPHSRPRM+2
RPHSRP12 EQU   RPHSRPRM
RPHWEGT  EQU   RPHCSPA
RPHRESUM EQU   RPHRESMA+1
RPHRSV01 EQU   RPHWPFLG
RPHPURGE EQU   RPHWPFLG
RPHPT    EQU   RPHWPFLG
RPHRSKEY EQU   RPHWPFLG
RPHDVTA  EQU   ISTRPH+12
RPHTIK   EQU   RPHTSKID+3
@NM00014 EQU   RPHTSKID
RPHRPHAP EQU   RPHRPHA+1
@NM00013 EQU   RPHRPHA
RPHGATE  EQU   RPHRPHA
@NM00012 EQU   RPHFLGB
RPHRLCRA EQU   RPHFLGB
RPHNRSAV EQU   RPHFLGB
RPHPGCMP EQU   RPHFLGB
RPHFBAPS EQU   RPHFLGB
RPHBSSP  EQU   RPHFLGB
RPHLOCK  EQU   RPHFLGB
RPHFNFLG EQU   RPHFSTLC
RPHMLTCP EQU   RPHFLAGS
RPHSMCLR EQU   RPHFLAGS
RPHSMTYP EQU   RPHFLAGS
RPHSMQ   EQU   RPHFLAGS
RPHAUTEX EQU   RPHAPTYP
RPHSPGIN EQU   RPHFLAGS
RPHOGIND EQU   RPHFLAGS
RPHLNGTH EQU   RPHCNTL+1
RPHTYPE  EQU   RPHCNTL
@NM00011 EQU   SRBSECT+40
@NM00010 EQU   SRBSECT+38
SRBPRIOR EQU   SRBSECT+37
SRBPKF   EQU   SRBSECT+36
SRBSAVE  EQU   SRBSECT+32
SRBPARM  EQU   SRBSECT+28
SRBRMTR  EQU   SRBSECT+24
SRBEP    EQU   SRBSECT+20
SRBPTCB  EQU   SRBFLC+4
SRBPASID EQU   SRBFLC+2
SRBCPAFF EQU   SRBFLC
SRBASCB  EQU   SRBSECT+8
SRBFLNK  EQU   SRBSECT+4
SRBID    EQU   SRBSECT
IOSEND   EQU   IOSB+108
IOSSKR   EQU   IOSEEKA+7
IOSSKH2  EQU   IOSSKHH+1
IOSSKH1  EQU   IOSSKHH
IOSSKCC  EQU   IOSCCHH
IOSSKBB  EQU   IOSEEKA+1
IOSSKM   EQU   IOSEEKA
IOSEEK   EQU   IOSB+92
IOSMDM   EQU   IOSB+91
IOSMDB   EQU   IOSB+90
IOSCKEY7 EQU   IOSCKEY
IOSCKEY6 EQU   IOSCKEY
IOSCKEY5 EQU   IOSCKEY
IOSCKEY4 EQU   IOSCKEY
@NM00006 EQU   IOSCKEY
IOSFMSK  EQU   IOSB+88
IOSCUDEV EQU   IOSPATH+1
@NM00005 EQU   IOSCHN
IOSPATH3 EQU   IOSCHN
IOSPATH2 EQU   IOSCHN
IOSEXP   EQU   IOSCHN
IOSGDP   EQU   IOSCHN
IOSAFF   EQU   IOSB+85
IOSRSS1B EQU   IOSB+84
IOSDSID  EQU   IOSB+80
IOSVST   EQU   IOSB+76
IOSRST   EQU   IOSB+72
IOSDIE   EQU   IOSB+68
IOSABN   EQU   IOSB+64
IOSNRM   EQU   IOSB+60
IOSPCI   EQU   IOSB+56
IOSERP   EQU   IOSB+52
IOSPCHN  EQU   IOSB+48
IOSSNS   EQU   IOSB+42
IOSAPMSK EQU   IOSB+40
IOSRES4A EQU   IOSB+36
IOSUSE   EQU   IOSB+32
IOSSRB   EQU   IOSB+28
IOSCSWRC EQU   IOSCSW+5
IOSTSB   EQU   IOSTATUS+1
IOSTSA   EQU   IOSTATUS
IOSCSWCA EQU   IOSCSW
IOSCC    EQU   @NM00004
IOSUCB   EQU   IOSB+16
IOSOPT2X EQU   IOSOPT2
IOSHTP   EQU   IOSOPT2
IOSRELSE EQU   IOSOPT
IOSAPR   EQU   IOSOPT
IOSTSLL  EQU   IOSOPT
IOSNERP  EQU   IOSOPT
IOSPSLL  EQU   IOSOPT
IOSQISCE EQU   IOSOPT
IOSDEP   EQU   IOSOPT
IOSBYP   EQU   IOSOPT
IOSCOD   EQU   IOSB+13
IOSPKY7  EQU   IOSPKEY
IOSPGDPX EQU   IOSPKEY
IOSIDR   EQU   IOSPKEY
IOSLCL   EQU   IOSPKEY
@NM00003 EQU   IOSPKEY
IOSPGAD  EQU   IOSB+8
IOSASID  EQU   IOSB+6
IOSPRLVL EQU   IOSB+5
IOSDVRID EQU   IOSB+4
IOSPROC  EQU   IOSB+3
IOSFLC7  EQU   IOSFLC
IOSFLC6  EQU   IOSFLC
IOSRWAIT EQU   IOSFLC
IOSTP    EQU   IOSFLC
IOSCC3WE EQU   IOSFLC
IOSVERIF EQU   IOSDVALT
IOSDVMNT EQU   IOSFLC
IOSLOG   EQU   IOSFLB
IOSBDCST EQU   IOSFLB
IOSMSG   EQU   IOSFLB
IOSFLB4  EQU   IOSFLB
IOSFLB3  EQU   IOSFLB
IOSFLB2  EQU   IOSFLB
IOSSDR   EQU   IOSFLB
IOSDIESE EQU   IOSFLB
IOSIOSB  EQU   IOSFLA
IOSDOM   EQU   IOSFLA
IOSEX    EQU   IOSFLA
IOSSMDB  EQU   IOSFLA
IOSSMDA  EQU   IOSFLA
IOSERR   EQU   IOSFLA
IOSCCHN  EQU   IOSACHN
IOSDCHN  EQU   IOSACHN
IOBERRCT EQU   IOBSTDRD+30
IOBRSV19 EQU   IOBINCAM+1
IOBOLTST EQU   IOBBTAMF
IOBRFTMG EQU   IOBBTAMF
IOBRSV17 EQU   IOBBTAMF
IOBRSV16 EQU   IOBBTAMF
IOBRSV15 EQU   IOBBTAMF
IOBRSV14 EQU   IOBBTAMF
IOBINUSE EQU   IOBBTAMF
IOBPRMER EQU   IOBBTAMF
IOBRSTRB EQU   IOBRESTR+1
IOBREPOS EQU   IOBRESTR
IOBDCBPB EQU   IOBDCBPT+1
IOBRSV44 EQU   IOBFLAG4
IOBJES3I EQU   IOBFLAG4
IOBRSV42 EQU   IOBFLAG4
IOBRSV41 EQU   IOBFLAG4
IOBRSV40 EQU   IOBFLAG4
IOBPMERR EQU   IOBFLAG4
IOBCC3WE EQU   IOBFLAG4
IOBGDPOL EQU   IOBFLAG4
IOBSTRTB EQU   IOBSTART+1
IOBSIOCC EQU   IOBSTART
IOBCSB7  EQU   IOBCSTAT
IOBCSB6  EQU   IOBCSTAT
IOBCSB5  EQU   IOBCSTAT
IOBCSB4  EQU   IOBCSTAT
IOBCSB3  EQU   IOBCSTAT
IOBCSB2  EQU   IOBCSTAT
IOBCSB1  EQU   IOBCSTAT
IOBCSB0  EQU   IOBCSTAT
IOBUSB7  EQU   IOBUSTAT
IOBUSB6  EQU   IOBUSTAT
IOBUSB5  EQU   IOBUSTAT
IOBUSB4  EQU   IOBUSTAT
IOBUSB3  EQU   IOBUSTAT
IOBUSB2  EQU   IOBUSTAT
IOBUSB1  EQU   IOBUSTAT
IOBUSB0  EQU   IOBUSTAT
IOBCMDA  EQU   IOBIOCSW
IOBLOG   EQU   IOBFL3
IOBJAM   EQU   IOBICL
IOBMSG   EQU   IOBFL3
IOBSDR   EQU   IOBCNC
IOBACU   EQU   IOBFL3
IOBCDC   EQU   IOBFL3
IOBICC   EQU   IOBFL3
IOBCCC   EQU   IOBFL3
IOBECBPB EQU   IOBECBPT+1
IOBECBCC EQU   IOBECBPT
IOBS1B7  EQU   IOBSENS1
IOBS1B6  EQU   IOBSENS1
IOBS1B5  EQU   IOBSENS1
IOBS1B4  EQU   IOBSENS1
IOBS1B3  EQU   IOBSENS1
IOBS1B2  EQU   IOBSENS1
IOBS1B1  EQU   IOBSENS1
IOBS1B0  EQU   IOBSENS1
IOBSNSC9 EQU   IOBS0B7
IOBS0B6  EQU   IOBSENS0
IOBS0B5  EQU   IOBSENS0
IOBS0B4  EQU   IOBSENS0
IOBS0B3  EQU   IOBSENS0
IOBS0B2  EQU   IOBSENS0
IOBS0B1  EQU   IOBSENS0
IOBS0B0  EQU   IOBSENS0
IOBPNCH  EQU   IOBFLAG2
IOBSTATO EQU   IOBFLAG2
IOBSKUPD EQU   IOBFLAG2
IOBALTTR EQU   IOBFLAG2
IOBRRT2  EQU   IOBRDHA0
IOBRRT3  EQU   IOBPURGE
IOBSENSE EQU   IOBFLAG2
IOBHALT  EQU   IOBFLAG2
IOBSPSVC EQU   IOBRSTRT
IOBUNREL EQU   IOBFLAG1
IOBIOERR EQU   IOBFLAG1
IOBFCREX EQU   IOBCYCCK
IOBRPSTN EQU   IOBFLAG1
IOBERRTN EQU   IOBFLAG1
IOBCMDCH EQU   IOBFLAG1
IOBDATCH EQU   IOBFLAG1
IOBCNOPA EQU   IOBPREFX+12
IOBCICB  EQU   IOBPREFX+8
IOBCECB  EQU   IOBPREFX+4
IOBCONOP EQU   IOBPREFX+3
IOBCINOP EQU   IOBPREFX+2
IOBRSV05 EQU   IOBPREFX+1
IOBPCI   EQU   IOBCFLG1
IOBRSTCH EQU   IOBCFLG1
IOBABAPP EQU   IOBCFLG1
IOBPTST  EQU   IOBCFLG1
IOBRSV04 EQU   IOBCFLG1
IOBRSV03 EQU   IOBCFLG1
IOBRSV02 EQU   IOBCFLG1
IOBRSV01 EQU   IOBCFLG1
CVTLEVL  EQU   CVTRELNO+2
CVTNUMB  EQU   CVTRELNO
CVTMDL   EQU   CVTFIX+250
@NM00002 EQU   CVTFIX+248
@NM00001 EQU   CVTFIX
CVTRV482 EQU   CVTXTNT2+128
CVTRV481 EQU   CVTXTNT2+124
CVTRV480 EQU   CVTXTNT2+120
CVTRV479 EQU   CVTXTNT2+118
CVTRV478 EQU   CVTXTNT2+117
CVTRV477 EQU   CVTXTNT2+116
CVTRV476 EQU   CVTXTNT2+115
CVTRV475 EQU   CVTXTNT2+114
CVTRV474 EQU   CVTRV466
CVTRV473 EQU   CVTRV466
CVTRV472 EQU   CVTRV466
CVTRV471 EQU   CVTRV466
CVTRV470 EQU   CVTRV466
CVTRV469 EQU   CVTRV466
CVTRV468 EQU   CVTRV466
CVTRV467 EQU   CVTRV466
CVTRV465 EQU   CVTRV457
CVTRV464 EQU   CVTRV457
CVTRV463 EQU   CVTRV457
CVTRV462 EQU   CVTRV457
CVTRV461 EQU   CVTRV457
CVTRV460 EQU   CVTRV457
CVTRV459 EQU   CVTRV457
CVTRV458 EQU   CVTRV457
CVTRV456 EQU   CVTXTNT2+108
CVTRV455 EQU   CVTXTNT2+104
CVTRV454 EQU   CVTXTNT2+100
CVTRV453 EQU   CVTXTNT2+96
CVTRV452 EQU   CVTXTNT2+94
CVTRV451 EQU   CVTXTNT2+92
CVTRV450 EQU   CVTXTNT2+90
CVTRV449 EQU   CVTXTNT2+88
CVTRV448 EQU   CVTXTNT2+87
CVTRV447 EQU   CVTXTNT2+86
CVTRV446 EQU   CVTRV438
CVTRV445 EQU   CVTRV438
CVTRV444 EQU   CVTRV438
CVTRV443 EQU   CVTRV438
CVTRV442 EQU   CVTRV438
CVTRV441 EQU   CVTRV438
CVTRV440 EQU   CVTRV438
CVTRV439 EQU   CVTRV438
CVTRV437 EQU   CVTRV429
CVTRV436 EQU   CVTRV429
CVTRV435 EQU   CVTRV429
CVTRV434 EQU   CVTRV429
CVTRV433 EQU   CVTRV429
CVTRV432 EQU   CVTRV429
CVTRV431 EQU   CVTRV429
CVTRV430 EQU   CVTRV429
CVTRV428 EQU   CVTXTNT2+80
CVTRV427 EQU   CVTXTNT2+76
CVTRV426 EQU   CVTXTNT2+72
CVTRV425 EQU   CVTXTNT2+68
CVTATACT EQU   CVTATCVT
CVTRV423 EQU   CVTXTNT2+62
CVTRV422 EQU   CVTXTNT2+60
CVTRV421 EQU   CVTXTNT2+58
CVTRV420 EQU   CVTXTNT2+56
CVTRV419 EQU   CVTXTNT2+55
CVTRV418 EQU   CVTXTNT2+54
CVTRV417 EQU   CVTRV409
CVTRV416 EQU   CVTRV409
CVTRV415 EQU   CVTRV409
CVTRV414 EQU   CVTRV409
CVTRV413 EQU   CVTRV409
CVTRV412 EQU   CVTRV409
CVTRV411 EQU   CVTRV409
CVTRV410 EQU   CVTRV409
CVTRV408 EQU   CVTRV400
CVTRV407 EQU   CVTRV400
CVTRV406 EQU   CVTRV400
CVTRV405 EQU   CVTRV400
CVTRV404 EQU   CVTRV400
CVTRV403 EQU   CVTRV400
CVTRV402 EQU   CVTRV400
CVTRV401 EQU   CVTRV400
CVTICB   EQU   CVTXTNT2+48
CVTSKTA  EQU   CVTXTNT2+44
CVTSHSB  EQU   CVTSHS
CVTRSV98 EQU   CVTXTNT2+36
CVTRSV97 EQU   CVTXTNT2+34
CVTRSV96 EQU   CVTXTNT2+32
CVTOLTEP EQU   CVTXTNT2+28
CVTQIDA  EQU   CVTQID+1
CVTRSV95 EQU   CVTQID
CVTRSV94 EQU   CVTXTNT2+20
CVTRSV93 EQU   CVTXTNT2+16
CVTRSV92 EQU   CVTXTNT2+12
CVTDEBVR EQU   CVTXTNT2+8
CVTRSV91 EQU   CVTXTNT2+6
CVTRSV9H EQU   CVTFLGBT
CVTRSV9G EQU   CVTFLGBT
CVTRSV9F EQU   CVTFLGBT
CVTRSV9E EQU   CVTFLGBT
CVTRSV9D EQU   CVTFLGBT
CVTRSV9C EQU   CVTFLGBT
CVTVME   EQU   CVTFLGBT
CVTNPE   EQU   CVTFLGBT
CVTNUCLS EQU   CVTXTNT2+4
CVTDSSVA EQU   CVTDSSV+1
CVTRSV89 EQU   CVTDSSV
CVTRSV88 EQU   CVTXTNT1+8
CVTRSV87 EQU   CVTXTNT1+4
CVTFACHN EQU   CVTXTNT1
CVTRV488 EQU   CVTMAP+412
CVTRV487 EQU   CVTMAP+408
CVTRV486 EQU   CVTMAP+404
CVTRV485 EQU   CVTMAP+400
CVTACTAP EQU   CVTMAP+396
CVTAUTH  EQU   CVTMAP+392
CVTATMCA EQU   CVTATMCT+1
CVTATMST EQU   CVTATMCT
CVTRSV61 EQU   CVTMAP+384
CVTVOLT1 EQU   CVTVOLM1+1
CVTVOLI1 EQU   CVTVOLF1
CVTSTOA  EQU   CVTMAP+376
CVTRSV58 EQU   CVTMAP+374
CVTRSV57 EQU   CVTMAP+372
CVTDDCE  EQU   CVTMAP+368
CVTPNWFR EQU   CVTMAP+364
CVTSMF   EQU   CVTMAP+360
CVTSULK  EQU   CVTMAP+358
CVTSLKO  EQU   CVTSYSK
CVTSLKP  EQU   CVTSYSK
CVTSLKQ  EQU   CVTSYSK
CVTSLKR  EQU   CVTSYSK
CVTRSV56 EQU   CVTSYSK
CVTRSV55 EQU   CVTSYSK
CVTRSV54 EQU   CVTSYSK
CVTRSV53 EQU   CVTSYSK
CVTRSV52 EQU   CVTA1F1
CVTRSV51 EQU   CVTA1F1
CVTRSV50 EQU   CVTA1F1
CVTRSV49 EQU   CVTA1F1
CVTRSV48 EQU   CVTA1F1
CVTRSV47 EQU   CVTA1F1
CVTSRSW  EQU   CVTA1F1
CVTPFSW  EQU   CVTA1F1
CVTPCVT  EQU   CVTMAP+352
CVTRSV46 EQU   CVTMAP+344
CVTRSV45 EQU   CVTMAP+340
CVTRSV44 EQU   CVTMAP+338
CVTRSV43 EQU   CVTMAP+336
CVTHJESA EQU   CVTHJES+1
CVTRSV42 EQU   CVTHJES
CVTEXT2A EQU   CVTEXT2+1
CVTRSV41 EQU   CVTEXT2
CVTAPFA  EQU   CVTAPF+1
CVTRSV40 EQU   CVTAPF
CVTRV518 EQU   CVTINTLA
CVTRV517 EQU   CVTERPV
CVTEORM  EQU   CVTMAP+312
CVTMCHPR EQU   CVTMAP+308
CVTTZ    EQU   CVTMAP+304
CVTJEPS  EQU   CVTMAP+300
CVTJESCT EQU   CVTMAP+296
CVTMODE  EQU   CVTMAP+292
CVTPTRV  EQU   CVTMAP+288
CVTREAL  EQU   CVTMAP+284
CVTRSV39 EQU   CVTMAP+280
CVTRSV38 EQU   CVTMAP+276
CVTDMSRA EQU   CVTDMSR+1
CVTRV634 EQU   CVTDMSRF
CVTRV633 EQU   CVTDMSRF
CVTRV632 EQU   CVTDMSRF
CVTRV631 EQU   CVTDMSRF
CVTRV630 EQU   CVTDMSRF
CVTRV629 EQU   CVTDMSRF
CVTUDUMP EQU   CVTDMSRF
CVTSDUMP EQU   CVTDMSRF
CVTQMSGA EQU   CVTQMSG+1
CVTRSV36 EQU   CVTQMSG
CVTAMFF  EQU   CVTMAP+264
CVTPURGA EQU   CVTPURG+1
CVTRSV35 EQU   CVTPURG
CVTCBSP  EQU   CVTMAP+256
CVTATERA EQU   CVTATER+1
CVTSYST  EQU   CVTATER
CVTVOLT2 EQU   CVTTAT
CVTVOLI2 EQU   CVTVOLF2
CVTAQAVB EQU   CVTAQAVT+1
CVTRSV34 EQU   CVTTCMFG
CVTRSV33 EQU   CVTTCMFG
CVTRSV32 EQU   CVTTCMFG
CVTRSV31 EQU   CVTTCMFG
CVTRSV30 EQU   CVTTCMFG
CVTRSV29 EQU   CVTTCMFG
CVTRSV28 EQU   CVTTCMFG
CVTTCRDY EQU   CVTTCMFG
CVTGTFA  EQU   CVTGTF+1
CVTRSV27 EQU   CVTGTFST
CVTRNIO  EQU   CVTGTFST
CVTUSR   EQU   CVTGTFST
CVTRV318 EQU   CVTFORM
CVTRV317 EQU   CVTTMODE
CVTRV316 EQU   CVTSTATE
CVTRV315 EQU   CVTGTFS
CVTGTFAV EQU   CVTGTFS
CVT0SCR1 EQU   CVTMAP+232
CVTRV515 EQU   CVTMAP+228
CVTRMS   EQU   CVTMAP+224
CVTPATCH EQU   CVTMAP+220
CVTTSCE  EQU   CVTMAP+216
CVTLNKSC EQU   CVTMAP+214
CVTQABST EQU   CVTMAP+212
CVTMDLDS EQU   CVTMAP+208
CVTUSER  EQU   CVTMAP+204
CVTABEND EQU   CVTMAP+200
CVTSMCA  EQU   CVTMAP+196
CVTRSV18 EQU   CVTMAP+192
CVTQLPAQ EQU   CVTMAP+188
CVTQCDSR EQU   CVTMAP+184
CVTRSV17 EQU   CVTOPTB
CVTRSV16 EQU   CVTOPTB
CVTFP    EQU   CVTOPTB
CVTAPTHR EQU   CVTOPTB
CVTNLOG  EQU   CVTOPTB
CVTTOD   EQU   CVTOPTB
CVTCTIMS EQU   CVTOPTB
CVTPROT  EQU   CVTOPTB
CVTXPFP  EQU   CVTOPTA
CVTASCII EQU   CVTOPTA
CVTRSV13 EQU   CVTOPTA
CVTRSV12 EQU   CVTOPTA
CVTNIP   EQU   CVTOPTA
CVTDDR   EQU   CVTOPTA
CVTAPR   EQU   CVTOPTA
CVTCCH   EQU   CVTOPTA
CVTSNCTR EQU   CVTMAP+180
CVTQMWR  EQU   CVTMAP+176
CVTQOCR  EQU   CVTMAP+172
CVT1EF00 EQU   CVTMAP+168
CVTMZ00  EQU   CVTMAP+164
CVTHEAD  EQU   CVTMAP+160
CVTRSV11 EQU   CVTMAP+156
CVT0PT01 EQU   CVTMAP+152
CVTMSER  EQU   CVTMAP+148
CVTRV516 EQU   CVTIERLC
CVTILCH  EQU   CVTMAP+140
CVT0DS   EQU   CVTMAP+136
CVTFBOSV EQU   CVTMAP+132
CVTNUCB  EQU   CVTMAP+128
CVTIXAVL EQU   CVTMAP+124
CVTIOQET EQU   CVTMAP+120
CVTDCBA  EQU   CVTMAP+117
CVTMVS2  EQU   CVTDCB
CVT6DAT  EQU   CVTDCB
CVT4MPS  EQU   CVTDCB
CVTRSV09 EQU   CVTDCB
CVT4MS1  EQU   CVTDCB
CVT2SPS  EQU   CVTDCB
CVT1SSS  EQU   CVTDCB
CVTRSV08 EQU   CVTDCB
CVTSTB   EQU   CVTMAP+112
CVTQTD00 EQU   CVTMAP+108
CVTQTE00 EQU   CVTMAP+104
CVTCUCB  EQU   CVTMAP+100
CVTSJQ   EQU   CVTMAP+96
CVTPBLDL EQU   CVTMAP+92
CVTTPC   EQU   CVTMAP+88
CVTSVDCB EQU   CVTMAP+84
CVTBRET  EQU   CVTMAP+82
CVTEXIT  EQU   CVTMAP+80
CVT0FN00 EQU   CVTMAP+76
CVTDARA  EQU   CVTDAR+1
CVTRSV07 EQU   CVTFLGS1
CVTRSV06 EQU   CVTFLGS1
CVTRSV05 EQU   CVTFLGS1
CVTRSV04 EQU   CVTFLGS1
CVTRSV03 EQU   CVTFLGS1
CVTRSV02 EQU   CVTFLGS1
CVTRSV01 EQU   CVTFLGS1
CVTDMPLK EQU   CVTFLGS1
CVTXITP  EQU   CVTMAP+68
CVTZDTAB EQU   CVTMAP+64
CVTMSLT  EQU   CVTMAP+60
CVTDATE  EQU   CVTMAP+56
CVTBTERM EQU   CVTMAP+52
CVTSYSAD EQU   CVTMAP+48
CVTXTLER EQU   CVTMAP+44
CVTILK2  EQU   CVTMAP+40
CVTILK1  EQU   CVTMAP+36
CVTPRLTV EQU   CVTMAP+32
CVTPCNVT EQU   CVTMAP+28
CVT0VL00 EQU   CVTMAP+24
CVTXAPG  EQU   CVTMAP+20
CVTBUF   EQU   CVTMAP+16
CVTJOB   EQU   CVTMAP+12
CVTLINK  EQU   CVTMAP+8
CVT0EF00 EQU   CVTMAP+4
CVTTCBP  EQU   CVTMAP
CVT      EQU   CVTMAP
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS
CVASR20# EQU   @RC00798
@RC00819 EQU   @RC00818
@RC00910 EQU   @RC00886
@RT00948 EQU   @RC00921
@RT01030 EQU   @RC01029
@RC01176 EQU   @RC01171
@RF01175 EQU   @RC01171
@RF01174 EQU   @RC01171
@RC01201 EQU   @RC01200
@RC01228 EQU   @RC01217
@RC01218 EQU   @RC01217
@RC01234 EQU   @RC01233
@RC01247 EQU   @RC01246
@RC01316 EQU   @RC01315
@RF01326 EQU   @RC01322
@RC01354 EQU   @RC01349
@RT01352 EQU   @RC01349
@RC01392 EQU   @RC01386
@RT01399 EQU   @RC01386
CVASR32@ EQU   @EL00002
@RC01505 EQU   @RC01504
@RC01606 EQU   @RC01604
@RC01637 EQU   @RC01636
@RF01686 EQU   @RC01683
@RC01676 EQU   @RC01660
@RC01737 EQU   @RC01736
@RC01828 EQU   @RC01824
@RC01842 EQU   @RC01838
@RC01856 EQU   @RC01852
@RC01869 EQU   @RC01866
@RT01906 EQU   @RC01891
@RC01892 EQU   @RC01891
@RT01912 EQU   @RC01891
@RC01931 EQU   @RC01927
@RT02068 EQU   @RC02025
@RC02006 EQU   @RC02003
@RT01995 EQU   @RC01985
@RC02481 EQU   @RC02480
@RC02560 EQU   @RC02544
@RT02558 EQU   @RC02544
@RC02553 EQU   @RC02544
@RC02580 EQU   @RC02578
@RC00827 EQU   @RC00819
@RC01179 EQU   @RC01176
@RC01202 EQU   @RC01201
@RT01210 EQU   @RC01201
@RC01221 EQU   @RC01218
@RF01640 EQU   @RC01637
@RC01933 EQU   @RC01931
@RT01947 EQU   @RC01931
@RC02094 EQU   @RC02006
@RC00833 EQU   @RC00827
@RF01182 EQU   @RC01179
@RC01941 EQU   @RC01933
@ENDDATA EQU   *
         END   ISTINCVA,(C'PLS2230',0603,78086)
