%EDITMAC  ------------------ CONLY     MACRO  ------------------------
%COMMAND ===>_ZCMD
+
+
%SYNTAX:+THIS EDIT MACRO USES MOST OF THE PARAMETERS OF THE ISPF EDIT CH
          COMMAND.

         %CONLY STRING-1 STRING-2 (RANGE-1 (RANGE-2)) (CHARS) (COL-1 (CO
                                                      (PREFIX)
                                                      (SUFFIX)
                                                      (WORD)

+
%USE:   +CONLY PERFORMS THE REQUESTED CHANGE AND THEN DISPLAYS ONLY THOS
          WHICH HAVE BEEN CHANGED.
+
%NOTE:  +FOR CASE SENSITIVE CHANGES, USE THE CHARACTER NOTATION%C'AABB'+
          STRING-1 PARAMETER.
+
        +THE CHANGE COMMAND KEYWORDS ALL, FIRST, LAST, NEXT, NX, PREV, A
          NOT SUPPORTED.
+
+
)INIT
)PROC
&KEY = .PFKEY
)END
