         TITLE 'ISDADCS0 - DATA CARTRIDGE STATISTICS ACCUMULATION      *
                        '
ISDADCS0 CSECT ,                                                01S0001
@MAINENT DS    0H                                               01S0001
         USING *,@15                                            01S0001
         B     @PROLOG                                          01S0001
         DC    AL1(8)                                           01S0001
         DC    C'ISDADCS0'                                      01S0001
         DROP  @15
@PROLOG  STM   @14,@12,12(@13)                                  01S0001
         BALR  @12,0                                            01S0001
@PSTART  DS    0H                                               01S0001
         USING @PSTART,@12                                      01S0001
         L     @00,@SIZDATD                                     01S0001
         ISDAGSPC R,LV=(0)
         LR    @11,@01                                          01S0001
         USING @DATD,@11                                        01S0001
         ST    @13,@SA00001+4                                   01S0001
         LM    @00,@01,20(@13)                                  01S0001
         ST    @11,8(,@13)                                      01S0001
         LR    @13,@11                                          01S0001
         MVC   @PC00001(4),0(@01)                               01S0001
*                                                            @Y30LB55*/
*                                                               01S0017
*/*  %GET0HDRL='LENGTH(ISDAGHDR)'                            @Y30LB55*/
*/* DCL DATA AREA AS STRUCTURE BASED(STARTPTR)               @Y30LB55*/
*   CVTPTR=WORKPTR;                 /*  SAVE POINTER TO CVT  @Y30LB56*/
         L     @06,@PC00001                                     01S0018
         L     CVTPTR,WORKPTR(,@06)                             01S0018
*   RETCODE=0;                      /* INITIALIZE RETURN CODE@Y30LB56*/
         SLR   @15,@15                                          01S0019
         LR    RETCODE,@15                                      01S0019
*                                                               02S0020
*   /*****************************************************************/
*   /*                                                               */
*   /* CHECK FOR VALID AND USEABLE SENSE DATA                        */
*   /*                                                               */
*   /*****************************************************************/
*                                                               02S0020
*   LOGPTR=DATAPTR;                 /* COPY DATA PTR FROM SDACVT
*                                                            @Y30LB56*/
         MVC   LOGPTR(4),DATAPTR(CVTPTR)                        02S0020
*   SENSEPTR=SDATAPTR;              /* COPY SENSE PTR FROM SDACVT
*                                                            @Y30LB56*/
         L     SENSEPTR,SDATAPTR(,CVTPTR)                       02S0021
*   LPARMPTR=PARMPTR;               /* COPY PARM PTR FROM SDACVT
*                                                            @Y30LB56*/
         L     LPARMPTR,PARMPTR(,CVTPTR)                        02S0022
*   GET0PTR=0;                                             /*@Y30LB56*/
         LR    GET0PTR,@15                                      02S0023
*   GET0INDX=0;                                            /*@Y30LB56*/
         LR    GET0INDX,@15                                     02S0024
*   RETCODE=8;                      /* SET RETURN CODE       @Y30LB56*/
         LA    RETCODE,8                                        02S0025
*   IF SASENSE(1:8)^=ZERO(1:8) THEN /* CTRS NOT ALL 0        @Y30LB56*/
         CLC   SASENSE(8,SENSEPTR),ZERO                         02S0026
         BE    @RF00026                                         02S0026
*     IF SASENSE(10:20)^=ZERO(1:11) THEN/* CSN NOT 0         @ZM30998*/
         CLC   SASENSE+9(11,SENSEPTR),ZERO                      02S0027
         BE    @RF00027                                         02S0027
*       DO;                                                /*@Y30LB56*/
*         RETCODE=0;                /* RESET RETURN CODE     @Y30LB56*/
*                                                               02S0029
         LR    RETCODE,@15                                      02S0029
*         /***********************************************************/
*         /*                                                         */
*         /* IF CSN= CONTROL STATEMENT WAS SPECIFIED, SEE IF CSN=    */
*         /* FACTOR MATCHES CSN IN SENSE DATA                        */
*         /*                                                         */
*         /***********************************************************/
*                                                               02S0030
*         WORKX1=10;                /* START CSN IN SENSE    @ZM30998*/
         LA    WORKX1,10                                        02S0030
*         DO I=1 TO 12;             /* LOOP THROUGH CSN      @ZM30998*/
         LA    @15,1                                            02S0031
         ST    @15,I                                            02S0031
@DL00031 DS    0H                                               02S0032
*           IF CSERIAL(I)^=SASENSE(WORKX1) THEN/* SER^=SENSE @ZM30998*/
         ALR   @15,LPARMPTR                                     02S0032
         LR    @14,SENSEPTR                                     02S0032
         ALR   @14,WORKX1                                       02S0032
         CLC   CSERIAL-1(1,@15),SASENSE-1(@14)                  02S0032
         BE    @RF00032                                         02S0032
*             IF CSERIAL(I)=' ' THEN/* END OF OPTION         @Y30LB56*/
         L     @15,I                                            02S0033
         ALR   @15,LPARMPTR                                     02S0033
         CLI   CSERIAL-1(@15),C' '                              02S0033
         BNE   @RF00033                                         02S0033
*               IF I=4 THEN         /* NOW AT CHAR 4         @ZM30998*/
         L     @15,I                                            02S0034
         CH    @15,@CH00051                                     02S0034
         BNE   @RF00034                                         02S0034
*                 WORKX1=WORKX1-1;  /* YES, NO BLANK IN SENSE@ZM30998*/
         BCTR  WORKX1,0                                         02S0035
*               ELSE                /* NOT CHAR 4            @ZM30998*/
*                 I=12;             /* GET OUT OF LOOP       @ZM30998*/
         B     @RC00034                                         02S0036
@RF00034 MVC   I(4),@CF00081                                    02S0036
*             ELSE                  /* FACTOR OUT RECORD FOR THIS CSN
*                                                            @Y30LB56*/
*               I=128;              /* FORCE LOOP EXIT       @Y30LB56*/
         B     @RC00033                                         02S0037
@RF00033 MVC   I(4),@CF00317                                    02S0037
*           ELSE                                                02S0038
*             ;                     /* CSN= MATCHES SENSE CSN@Y30LB56*/
@RF00032 DS    0H                                               02S0039
*           WORKX1=WORKX1+1;        /* ADD 1 TO WORKX1       @ZM30998*/
@RC00032 AH    WORKX1,@CH00047                                  02S0039
*         END;                                             /*@Y30LB56*/
         LA    @15,1                                            02S0040
         AL    @15,I                                            02S0040
         ST    @15,I                                            02S0040
         CH    @15,@CH00081                                     02S0040
         BNH   @DL00031                                         02S0040
*         IF I<128 THEN             /* EITHER CSN= MATCHED SENSE OR
*                                      CSN= WAS NOT SPECIFIED@Y30LB56*/
         L     @06,I                                            02S0041
         CH    @06,@CH00317                                     02S0041
         BNL   @RF00041                                         02S0041
*           DO;                                            /*@Y30LB56*/
*             IF DCS00PTR=0 THEN    /* FIRST TIME MODULE CALLED 02S0043
*                                                            @Y30LB56*/
         ICM   @06,15,DCS00PTR(CVTPTR)                          02S0043
         BNZ   @RF00043                                         02S0043
*                                                               03S0044
*   /*****************************************************************/
*   /*                                                               */
*   /* ALLOCATE THE FIRST WORKAREA FOR THIS REPORT AND COMPLETE ITS  */
*   /* HEADER.                                                       */
*   /*                                                               */
*   /*****************************************************************/
*                                                               03S0044
*   DO;                                                    /*@Y30LB56*/
*     SPNOLEN=GETWORK;              /* PUT SUBPOOL AND LENGTH IN CVT
*                                                            @Y30LB56*/
         MVC   SPNOLEN(4,CVTPTR),GETWORK                        03S0045
*     RFY                                                       03S0046
*       R1 RSTD;                                           /*@Y30LB56*/
*     R1=ADDR(WORKCALL);            /* PTR TO PTR TO PTR TO CVT 03S0047
*                                                            @Y30LB56*/
         LA    R1,WORKCALL(,CVTPTR)                             03S0047
*     CALL ISDAGET0;                /* GET A WORKAREA        @Y30LB56*/
         L     @15,@CV00236                                     03S0048
         BALR  @14,@15                                          03S0048
*     RFY                                                       03S0049
*       R1 UNRSTD;                                         /*@Y30LB56*/
*     RFY                                                       03S0050
*       R15 RSTD;                   /* PROTECT RETURN CODE REGISTER
*                                                            @Y30LB56*/
*     IF R15=0 THEN                 /* WORKAREA WAS ALLOCATED@Y30LB56*/
         SLR   @14,@14                                          03S0051
         CR    R15,@14                                          03S0051
         BNE   @RF00051                                         03S0051
*       DO;                                                /*@Y30LB56*/
*         GET0PTR=COREADDR;         /* SAVE LOCAL POINTER TO WORK
*                                      AREA                  @Y30LB56*/
         L     GET0PTR,COREADDR(,CVTPTR)                        03S0053
*         DCS00PTR=GET0PTR;                                /*@Y30LB56*/
*                                                               03S0054
         ST    GET0PTR,DCS00PTR(,CVTPTR)                        03S0054
*         /***********************************************************/
*         /*                                                         */
*         /* INITIALIZE WORK AREA HEADER                             */
*         /*                                                         */
*         /***********************************************************/
*                                                               03S0055
*         BLOCKID='DCS ';                                  /*@Y30LB56*/
         MVC   BLOCKID(4,GET0PTR),@CC00319                      03S0055
*         RATIO=CRATIO;             /* COPY RATIO            @Y30LB56*/
         L     @06,DCS00PTR(,CVTPTR)                            03S0056
         MVC   RATIO(2,@06),CRATIO(LPARMPTR)                    03S0056
*         SUM=CSUMMARY;             /* COPY SUMMARY=Y×N      @Y30LB56*/
         MVC   SUM(1,@06),CSUMMARY(LPARMPTR)                    03S0057
*         RETCDSV=0;                /* SET RETURN CODE TO 0  @Y30LB56*/
         STH   @14,RETCDSV(,@06)                                03S0058
*         SER=CSERIAL;              /* COPY CSN FACTOR       @Y30LB56*/
         MVC   SER(12,@06),CSERIAL(LPARMPTR)                    03S0059
*         GET0INDX=STARTPTR+LENGTH(GET0HDR1);/* SET WORK AREA INDEX
*                                                            @Y30LB56*/
         LA    GET0INDX,28                                      03S0060
         AL    GET0INDX,STARTPTR(,GET0PTR)                      03S0060
*         STARTPTR=GET0INDX;        /* SET POINTER TO OLDEST ENTRY
*                                                            @Y30LB56*/
         ST    GET0INDX,STARTPTR(,GET0PTR)                      03S0061
*       END;                                               /*@Y30LB56*/
*     ELSE                          /* NO WORKAREA COULD BE ALLOCATED
*                                                            @Y30LB56*/
*       DO;                                                /*@Y30LB56*/
         B     @RC00051                                         03S0063
@RF00051 DS    0H                                               03S0064
*         RETCODE=4;                /* INDICATE NO WORKAREA AVAILABLE
*                                                            @Y30LB56*/
         LA    RETCODE,4                                        03S0064
*         CDCS='00'X;               /* SUPRESS REPORT        @Y30LB56*/
         MVI   CDCS(LPARMPTR),X'00'                             03S0065
*       END;                                               /*@Y30LB56*/
*     RFY                                                       03S0067
*       R15 UNRSTD;                                        /*@Y30LB56*/
@RC00051 DS    0H                                               03S0068
*   END;                                                   /*@Y30LB56*/
*             ELSE                  /* MODULE HAS A WORKSPACE@Y30LB56*/
*               DO;                                        /*@Y30LB56*/
         B     @RC00043                                         02S0069
@RF00043 DS    0H                                               02S0070
*                 GET0PTR=GET0PSV;  /* GET CURRENT WORKAREA PTR FROM
*                                      SAVE AREA             @Y30LB56*/
         L     @06,DCS00PTR(,CVTPTR)                            02S0070
         L     GET0PTR,GET0PSV(,@06)                            02S0070
*                 GET0INDX=GET0XSV; /* GET CURRENT WORKAREA INDEX
*                                      FROM SAVE AREA        @Y30LB56*/
         L     GET0INDX,GET0XSV(,@06)                           02S0071
*               END;                                       /*@Y30LB56*/
*             IF RETCODE=0 THEN     /* A WORKAREA IS AVAILABLE  02S0073
*                                                            @Y30LB56*/
@RC00043 LTR   RETCODE,RETCODE                                  02S0073
         BNZ   @RF00073                                         02S0073
*               DO;                                        /*@Y30LB56*/
*                 IF GET0LEN<((GET0INDX+LENGTH(DCSENTRY))-GET0PTR) THEN
         LA    @06,44                                           02S0075
         ALR   @06,GET0INDX                                     02S0075
         SLR   @06,GET0PTR                                      02S0075
         SLR   @15,@15                                          02S0075
         ICM   @15,7,GET0LEN(GET0PTR)                           02S0075
         CR    @06,@15                                          02S0075
         BNH   @RF00075                                         02S0075
*                   DO;                                    /*@Y30LB56*/
*                                                               03S0077
*   /*****************************************************************/
*   /*                                                               */
*   /* GET ADDITIONAL WORKAREA. GETWORK IS A FULL WORD CONTAINING A  */
*   /* ONE BYTE SUBPOOL NUMBER, AND A THREE BYTE VALUE INDICATING THE*/
*   /* NUMBER OF BYTES TO ALLOCATE                                   */
*   /*                                                               */
*   /*****************************************************************/
*                                                               03S0077
*   DO;                                                    /*@Y30LB56*/
*     SPNOLEN=GETWORK;              /* SETUP SUBPOOL AND LENGTH IN
*                                      CVT                   @Y30LB56*/
         MVC   SPNOLEN(4,CVTPTR),GETWORK                        03S0078
*     RFY                                                       03S0079
*       R1 RSTD;                                           /*@Y30LB56*/
*     R1=ADDR(WORKCALL);            /* PTR TO PTR TO PTR TO CVT 03S0080
*                                                            @Y30LB56*/
         LA    R1,WORKCALL(,CVTPTR)                             03S0080
*     CALL ISDAGET0;                /* GET A WORK AREA       @Y30LB56*/
         L     @15,@CV00236                                     03S0081
         BALR  @14,@15                                          03S0081
*     RFY                                                       03S0082
*       R1 UNRSTD;                                         /*@Y30LB56*/
*     RFY                                                       03S0083
*       R15 RSTD;                   /* PROTECT RETURN CODE REG  03S0083
*                                                            @Y30LB56*/
*     IF R15=0 THEN                 /* WORKAREA WAS ALLOCATED@Y30LB56*/
         SLR   @14,@14                                          03S0084
         CR    R15,@14                                          03S0084
         BNE   @RF00084                                         03S0084
*       DO;                                                /*@Y30LB56*/
*         RETCODE=0;                /* SET RETURN CODE TO 0  @Y30LB56*/
         LR    RETCODE,@14                                      03S0086
*         NEXTPTR=COREADDR;         /* CHAIN OLD WORKAREA TO NEW
*                                                            @Y30LB56*/
         L     @14,COREADDR(,CVTPTR)                            03S0087
         ST    @14,NEXTPTR(,GET0PTR)                            03S0087
*         WORKVAR=BLOCKCNT;         /* GET PREVIOUS BLOCK COUNT 03S0088
*                                                            @Y30LB56*/
         LH    WORKVAR,BLOCKCNT(,GET0PTR)                       03S0088
*         WORKX1=GET0PTR;           /* SAVE POINTER TO LAST BLOCK
*                                                            @Y30LB56*/
         LR    WORKX1,GET0PTR                                   03S0089
*         GET0PTR=NEXTPTR;          /* GET POINTER TO NEW WORK AREA
*                                                            @Y30LB56*/
         LR    GET0PTR,@14                                      03S0090
*         LASTPTR=WORKX1;           /* SAVE POINTER TO LAST BLOCK
*                                                            @Y30LB56*/
         ST    WORKX1,LASTPTR(,GET0PTR)                         03S0091
*         BLOCKCNT=WORKVAR+1;       /* SAVE BLOCK COUNTER    @Y30LB56*/
         LA    @14,1                                            03S0092
         ALR   @14,WORKVAR                                      03S0092
         STH   @14,BLOCKCNT(,GET0PTR)                           03S0092
*         GET0INDX=STARTPTR;        /* POINT TO NEXT AVAIL ENTRY
*                                                            @Y30LB56*/
         L     GET0INDX,STARTPTR(,GET0PTR)                      03S0093
*       END;                                               /*@Y30LB56*/
*     ELSE                          /* WORKAREA COULD NOT BE @Y30LB56
*                                      ALLOCATED             @Y30LB56*/
*       DO;                                                /*@Y30LB56*/
         B     @RC00084                                         03S0095
@RF00084 DS    0H                                               03S0096
*         RETCODE=4;                /* SET RETURN CODE TO 4  @Y30LB56*/
         LA    RETCODE,4                                        03S0096
*         CDCS='00'X;               /* SUPRESS DCS REPORT    @Y30LB56*/
         MVI   CDCS(LPARMPTR),X'00'                             03S0097
*         /***********************************************************/
*         /*                                                         */
*         /*  FREE ALLOCATED WORKAREAS IF NO MORE AREAS AVAILABLE.   */
*         /*                                                         */
*         /***********************************************************/
*         GET0PTR=DCS00PTR;         /* POINT TO FIRST WORKA  @Y30LB56*/
         L     GET0PTR,DCS00PTR(,CVTPTR)                        03S0098
*         DCS00PTR=0;                                      /*@Y30LB56*/
         SLR   @14,@14                                          03S0099
         ST    @14,DCS00PTR(,CVTPTR)                            03S0099
*         SPNOLEN=GETWORK;          /* PUT SUBPOOL NO AND LEN IN CVT
*                                                            @Y30LB56*/
         MVC   SPNOLEN(4,CVTPTR),GETWORK                        03S0100
*         DO WHILE(GET0PTR^=0);                            /*@Y30LB56*/
         B     @DE00101                                         03S0101
@DL00101 DS    0H                                               03S0102
*           WORKX1=NEXTPTR;         /* SAVE PTR TO NEXT AREA @Y30LB56*/
         L     WORKX1,NEXTPTR(,GET0PTR)                         03S0102
*           COREADDR=GET0PTR;       /* PUT AREA PTR INTO CVT @Y30LB56*/
         ST    GET0PTR,COREADDR(,CVTPTR)                        03S0103
*           RFY                                                 03S0104
*             R1 RSTD;                                     /*@Y30LB56*/
*           R1=ADDR(WORKCALL);      /* PTR TO PTR TO CVT     @Y30LB56*/
         LA    R1,WORKCALL(,CVTPTR)                             03S0105
*           CALL ISDAFREE;          /* FREE WORKAREA         @Y30LB56*/
         L     @15,@CV00235                                     03S0106
         BALR  @14,@15                                          03S0106
*           RFY                                                 03S0107
*             R1 UNRSTD;                                   /*@Y30LB56*/
*           GET0PTR=WORKX1;         /* POINT TO NEXT AREA    @Y30LB56*/
         LR    GET0PTR,WORKX1                                   03S0108
*         END;                                             /*@Y30LB56*/
@DE00101 LTR   GET0PTR,GET0PTR                                  03S0109
         BNZ   @DL00101                                         03S0109
*       END;                                               /*@Y30LB56*/
*     RFY                                                       03S0111
*       R15 UNRSTD;                                        /*@Y30LB56*/
@RC00084 DS    0H                                               03S0112
*   END;                                                   /*@Y30LB56*/
*                     IF RETCODE=0 THEN/* MORE WORKAREA AVAILABLE
*                                                            @Y30LB56*/
         LTR   RETCODE,RETCODE                                  02S0113
         BNZ   @RF00113                                         02S0113
*                       BLOCKID='DCS ';/* SET WORKAREA ID    @Y30LB56*/
         MVC   BLOCKID(4,GET0PTR),@CC00319                      02S0114
*                     ELSE                                      02S0115
*                       ;           /* NO MORE WORKAREA AVAILABLE
*                                                            @Y30LB56*/
@RF00113 DS    0H                                               02S0116
*                   END;                                   /*@Y30LB56*/
*                 ELSE                                          02S0117
*                   ;               /* ANOTHER WORKAREA IS NOT YET
*                                      NEEDED                @Y30LB56*/
@RF00075 DS    0H                                               02S0118
*                 IF RETCODE=0 THEN /* WORKAREA IS AVAILABLE @Y30LB56*/
         SLR   @10,@10                                          02S0118
         CR    RETCODE,@10                                      02S0118
         BNE   @RF00118                                         02S0118
*                                                               03S0119
*                   DO;                                    /*@Y30LB56*/
*                                                               03S0119
*                     /***********************************************/
*                     /*                                             */
*                     /* COPY DATA FROM LOGREC RECORD INTO WORK AREA */
*                     /*                                             */
*                     /***********************************************/
*                                                               03S0120
*                     CHAINPTR=0;   /* SET ENTRY CHAIN POINTER TO 0
*                                                            @Y30LB56*/
         ST    @10,CHAINPTR(,GET0INDX)                          03S0120
*                     DATIME=DATETIME;/* SAVE LOGREC RCD DATE/TIME
*                                                            @Y30LB56*/
         L     @10,LOGPTR                                       03S0121
         MVC   DATIME(8,GET0INDX),DATETIME(@10)                 03S0121
*                     SNS1A2=SUBSYSID;/* SAVE DRD SUBSYSTEM ID  03S0122
*                                                            @Y30LB56*/
         MVC   SNS1A2(2,GET0INDX),SUBSYSID(SENSEPTR)            03S0122
*                     SNS9A10=SUBSENSE(6:7);/* SAVE MSC LOWER INTFC
*                                      ADDR                  @Y30LB56*/
         MVC   SNS9A10(2,GET0INDX),SUBSENSE+5(SENSEPTR)         03S0123
*                     SNS12T31(1:9)=SASENSE(1:9);/* STATS    @ZM30998*/
         MVC   SNS12T31(9,GET0INDX),SASENSE(SENSEPTR)           03S0124
*                     SNSCSN(1:3)=SASENSE(10:12);/* CSN 1-3  @ZM30998*/
         MVC   SNSCSN(3,GET0INDX),SASENSE+9(SENSEPTR)           03S0125
*                     SNSCSN(4)=' ';             /* BLANK 4  @ZM30998*/
         MVI   SNSCSN+3(GET0INDX),C' '                          03S0126
*                     SNSCSN(5:12)=SASENSE(13:20);/* CSN 5-12@ZM30998*/
*                                                               03S0127
         MVC   SNSCSN+4(8,GET0INDX),SASENSE+12(SENSEPTR)        03S0127
*                     /***********************************************/
*                     /*                                             */
*                     /* CALCULATE ERROR/USAGE=RATIOS FOR THIS DCS   */
*                     /* ENTRY                                       */
*                     /*                                             */
*                     /***********************************************/
*                                                               03S0128
*                     SNSBYT20=SNSBYT14; /* MOVE FLAG BITS   @ZM31073*/
         MVC   SNSBYT20(1,GET0INDX),SNSBYT14(GET0INDX)          03S0128
*                     SNSBYT20=SNSBYT20&'C0'X;/* BITS 0,1    @ZM31073*/
         NI    SNSBYT20(GET0INDX),X'C0'                         03S0129
*                     SNSRDCK=SNSRDCK&'3FFF'X;/* RESET UNUSED BITS
*                                                            @Y30LB56*/
         LH    @10,@CH00323                                     03S0130
         SLR   @06,@06                                          03S0130
         ICM   @06,3,SNSRDCK(GET0INDX)                          03S0130
         NR    @10,@06                                          03S0130
         STH   @10,SNSRDCK(,GET0INDX)                           03S0130
*                     IF SNSRDUC<SNSRDCK THEN/* RATIO > .99  @Y30LB56*/
         CLC   SNSRDUC(2,GET0INDX),SNSRDCK(GET0INDX)            03S0131
         BNL   @RF00131                                         03S0131
*                       SNSRDRAT='FF'X;                    /*@Y30LB56*/
         MVI   SNSRDRAT(GET0INDX),X'FF'                         03S0132
*                     ELSE                                      03S0133
*                       DO;                                /*@Y30LB56*/
         B     @RC00131                                         03S0133
@RF00131 DS    0H                                               03S0134
*                         IF SNSRDUC=0 THEN/* NO RATIO       @Y30LB56*/
         ICM   @10,3,SNSRDUC(GET0INDX)                          03S0134
         BNZ   @RF00134                                         03S0134
*                           SNSRDRAT=0;                    /*@Y30LB56*/
         MVI   SNSRDRAT(GET0INDX),X'00'                         03S0135
*                         ELSE      /* CALCULATE RATIO       @Y30LB56*/
*                           SNSRDRAT=(SNSRDCK*100)/SNSRDUC;/* READ
*                                      RATIO                 @Y30LB56*/
         B     @RC00134                                         03S0136
@RF00134 SLR   @10,@10                                          03S0136
         ICM   @10,3,SNSRDCK(GET0INDX)                          03S0136
         MH    @10,@CH00325                                     03S0136
         LR    @00,@10                                          03S0136
         SRDA  @00,32                                           03S0136
         SLR   @10,@10                                          03S0136
         ICM   @10,3,SNSRDUC(GET0INDX)                          03S0136
         DR    @00,@10                                          03S0136
         STC   @01,SNSRDRAT(,GET0INDX)                          03S0136
*                       END;                               /*@Y30LB56*/
@RC00134 DS    0H                                               03S0138
*                     SNSWRCK=SNSWRCK&'3FFF'X;/* RESET UNUSED BITS
*                                                            @Y30LB56*/
@RC00131 LH    @10,@CH00323                                     03S0138
         SLR   @06,@06                                          03S0138
         ICM   @06,3,SNSWRCK(GET0INDX)                          03S0138
         NR    @10,@06                                          03S0138
         STH   @10,SNSWRCK(,GET0INDX)                           03S0138
*                     IF SNSWRUC<SNSWRCK THEN/* RATIO > .99  @Y30LB56*/
         CLC   SNSWRUC(2,GET0INDX),SNSWRCK(GET0INDX)            03S0139
         BNL   @RF00139                                         03S0139
*                       SNSWRAT='FF'X;                     /*@Y30LB56*/
         MVI   SNSWRAT(GET0INDX),X'FF'                          03S0140
*                     ELSE                                      03S0141
*                       DO;                                /*@Y30LB56*/
         B     @RC00139                                         03S0141
@RF00139 DS    0H                                               03S0142
*                         IF SNSWRUC=0 THEN/* NO RATIO       @Y30LB56*/
         ICM   @10,3,SNSWRUC(GET0INDX)                          03S0142
         BNZ   @RF00142                                         03S0142
*                           SNSWRAT=0;                     /*@Y30LB56*/
         MVI   SNSWRAT(GET0INDX),X'00'                          03S0143
*                         ELSE      /* CALCULATE RATIO       @Y30LB56*/
*                           SNSWRAT=(SNSWRCK*100)/SNSWRUC;/* WRITE
*                                      RATIO                 @Y30LB56*/
         B     @RC00142                                         03S0144
@RF00142 SLR   @10,@10                                          03S0144
         ICM   @10,3,SNSWRCK(GET0INDX)                          03S0144
         MH    @10,@CH00325                                     03S0144
         LR    @00,@10                                          03S0144
         SRDA  @00,32                                           03S0144
         SLR   @10,@10                                          03S0144
         ICM   @10,3,SNSWRUC(GET0INDX)                          03S0144
         DR    @00,@10                                          03S0144
         STC   @01,SNSWRAT(,GET0INDX)                           03S0144
*                       END;                               /*@Y30LB56*/
*                                                               03S0145
@RC00142 DS    0H                                               03S0146
*                     /***********************************************/
*                     /*                                             */
*                     /* SORT CHAINPTR BYTE DATE/TIME                */
*                     /*                                             */
*                     /***********************************************/
*                                                               03S0146
*                     WORKX1=DCS00PTR;/* FIRST WORK AREA PTR @Y30LB56*/
@RC00139 L     WORKX1,DCS00PTR(,CVTPTR)                         03S0146
*                                                               04S0147
*/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * **/
*/*                                                                  */
*/*    SORT CHAINPTR IN ASCENDING CHRONOLOGICAL ORDER OF LOGREC      */
*/*    ENTRIES.                                                      */
*/*      WORKX1 - MUST POINT TO THE FIRST USER WORK AREA             */
*/*      WORKX2 - XXXXXXXX                                           */
*/*      STARTPTR - MUST POINT TO THE OLDEST ENTRY IN REPORTS WORK   */
*/*                 AREA(S).                                         */
*/*      GET0INDX - MUST POINT TO THE ENTRY JUST COPIED INTO THE     */
*/*                 WORK AREA.                                       */
*/*      WORKX1, WORKX2 AND STARTPTR MAY BE MODIFIED BY SORT.        */
*/*                                                                  */
*/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * **/
*   WORKX2=WORKX1->STARTPTR;        /* POINT TO OLDEST RECORD IN WORK
*                                      AREA(S)               @Y30LB56*/
         L     WORKX2,STARTPTR(,WORKX1)                         04S0147
*   IF WORKX2=GET0INDX THEN                                     04S0148
         CR    WORKX2,GET0INDX                                  04S0148
         BE    @RT00148                                         04S0148
*     ;                             /* THIS IS THE VERY FIRST RCD
*                                                            @Y30LB56*/
*   ELSE                            /* SORT THIS ENTRY INTO  @Y30LB56
*                                      CHRONOLOGICAL ORDER   @Y30LB56*/
*     DO;                                                  /*@Y30LB56*/
*       DO WHILE((WORKX2->CHAINPTR^=0)&(DATIME>WORKX2->DATIME));
         B     @DE00151                                         04S0151
@DL00151 DS    0H                                               04S0152
*         WORKX1=WORKX2;            /* SAVE THE POINTER TO THIS ENTRY
*                                                            @Y30LB56*/
         LR    WORKX1,WORKX2                                    04S0152
*         WORKX2=WORKX1->CHAINPTR;  /* POINT TO NEXT RCD IN CHAIN
*                                                            @Y30LB56*/
         L     WORKX2,CHAINPTR(,WORKX1)                         04S0153
*       END;                                               /*@Y30LB56*/
@DE00151 ICM   @10,15,CHAINPTR(WORKX2)                          04S0154
         BZ    @DC00151                                         04S0154
         CLC   DATIME(8,GET0INDX),DATIME(WORKX2)                04S0154
         BH    @DL00151                                         04S0154
@DC00151 DS    0H                                               04S0155
*       IF DATIME>WORKX2->DATIME THEN/* RCDS IN PHYSICAL ORDER  04S0155
*                                                            @Y30LB56*/
         CLC   DATIME(8,GET0INDX),DATIME(WORKX2)                04S0155
         BNH   @RF00155                                         04S0155
*         WORKX2->CHAINPTR=GET0INDX;/* CHAIN TO NEW RCD      @Y30LB56*/
         ST    GET0INDX,CHAINPTR(,WORKX2)                       04S0156
*       ELSE                        /* RCDS NOT IN PHYSICAL ORDER
*                                                            @Y30LB56*/
*         DO;                                              /*@Y30LB56*/
         B     @RC00155                                         04S0157
@RF00155 DS    0H                                               04S0158
*           CHAINPTR=WORKX2;        /* CHAIN NEW RCD TO OLDER ONE
*                                                            @Y30LB56*/
         ST    WORKX2,CHAINPTR(,GET0INDX)                       04S0158
*           WORKX1->CHAINPTR=GET0INDX;/* CHAIN TO NEW RCD    @Y30LB56*/
         ST    GET0INDX,CHAINPTR(,WORKX1)                       04S0159
*         END;                                             /*@Y30LB56*/
*     END;                                                 /*@Y30LB56*/
@RC00155 DS    0H                                               04S0162
*                     GET0INDX=GET0INDX+LENGTH(DCSENTRY);  /*@Y30LB56*/
@RT00148 AH    GET0INDX,@CH00326                                03S0162
*                   END;                                   /*@Y30LB56*/
*                 ELSE                                          02S0164
*                   ;               /* MORE WORKAREA NOT AVAILABLE
*                                                            @Y30LB56*/
@RF00118 DS    0H                                               02S0165
*               END;                                       /*@Y30LB56*/
*             ELSE                                              02S0166
*               ;                   /* NO WORKAREAS ARE AVAILABLE
*                                                            @Y30LB56*/
@RF00073 DS    0H                                               02S0167
*           END;                                           /*@Y30LB56*/
*         ELSE                                                  02S0168
*           ;                       /* SER DID NOT MATCH CSN IN SENSE
*                                                            @Y30LB56*/
@RF00041 DS    0H                                               02S0169
*       END;                                               /*@Y30LB56*/
*     ELSE                                                      02S0170
*       ;                           /* SENSE CARTRIDGE SERIAL NUMBER
*                                      = BINARY ZEROS        @Y30LB56*/
@RF00027 DS    0H                                               02S0171
*   ELSE                                                        02S0171
*     ;                             /* SENSE ERROR/USAGE COUNTERS =
*                                      BINARY ZEROS             02S0171
*                                                            @Y30LB56*/
@RF00026 DS    0H                                               02S0172
*   IF DCS00PTR=0 THEN                                          01S0172
         ICM   @10,15,DCS00PTR(CVTPTR)                          01S0172
         BZ    @RT00172                                         01S0172
*     ;                             /* NO WORKAREAS AVAILABLE@Y30LB56*/
*   ELSE                            /* WORKAREA IS AVAILABLE @Y30LB56*/
*     DO;                                                  /*@Y30LB56*/
*       RETCDSV=RETCODE;            /* SAVE RETURN CODE      @Y30LB56*/
         L     @10,DCS00PTR(,CVTPTR)                            01S0175
         STH   RETCODE,RETCDSV(,@10)                            01S0175
*       IF GET0PTR^=0 THEN          /* INPUT SAVED           @Y30LB56*/
         LTR   GET0PTR,GET0PTR                                  01S0176
         BZ    @RF00176                                         01S0176
*         DO;                                              /*@Y30LB56*/
*           GET0PSV=GET0PTR;        /* SAVE CURRENT WORKAREA PTR
*                                                            @Y30LB56*/
         ST    GET0PTR,GET0PSV(,@10)                            01S0178
*           GET0XSV=GET0INDX;       /* SAVE CURRENT WORKAREA INDEX
*                                                            @Y30LB56*/
         ST    GET0INDX,GET0XSV(,@10)                           01S0179
*         END;                                             /*@Y30LB56*/
*       ELSE                                                    01S0181
*         ;                         /* INPUT REJECTED        @Y30LB56*/
@RF00176 DS    0H                                               01S0182
*     END;                                                 /*@Y30LB56*/
*   RETURN CODE(RETCODE);           /* RETURN TO CALLER* * * * * * *
*                                                            @Y30LB56*/
@RT00172 L     @13,4(,@13)                                      01S0183
         L     @00,@SIZDATD                                     01S0183
         LR    @01,@11                                          01S0183
         ISDAFSPC R,LV=(0),A=(1)
         LR    @15,@07                                          01S0183
         L     @14,12(,@13)                                     01S0183
         LM    @00,@12,20(@13)                                  01S0183
         BR    @14                                              01S0183
*   END ISDADCS0                                           /*@Y30LB56*/
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.      *
*/*%INCLUDE SYSLIB  (ISDASOBR)                                        *
*/*%INCLUDE SYSLIB  (ISDAMSCS)                                        *
*/*%INCLUDE SYSLIB  (ISDAMSC4)                                        *
*/*%INCLUDE SYSLIB  (ISDACVT )                                        *
*/*%INCLUDE SYSLIB  (ISDAPRMS)                                        *
*/*%INCLUDE SYSLIB  (ISDADCS5)                                        *
*/*%INCLUDE SYSUT5  (DCS0DCLS)                                        *
*/*%INCLUDE SYSLIB  (ISDAGHDR)                                        *
*/*%INCLUDE SYSUT5  (DCSBUILD)                                        *
*/*%INCLUDE SYSUT5  (DCSGET1 )                                        *
*/*%INCLUDE SYSUT5  (GETMORE )                                        *
*/*%INCLUDE SYSUT5  (COPYSORT)                                        *
*/*%INCLUDE SYSUT5  (SORT    )                                        *
*;                                                              01S0184
@DATA    DS    0H
@CH00047 DC    H'1'
@CH00051 DC    H'4'
@CH00326 DC    H'44'
@CH00325 DC    H'100'
@CH00323 DC    XL2'3FFF'
@DATD    DSECT
         DS    0F
@SA00001 DS    18F
@PC00001 DS    1F
ISDADCS0 CSECT
         DS    0F
@CF00081 DC    F'12'
@CH00081 EQU   @CF00081+2
@CF00317 DC    F'128'
@CH00317 EQU   @CF00317+2
@DATD    DSECT
         DS    0D
LOGPTR   DS    A
I        DS    F
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA
@ENDDATD EQU   *
ISDADCS0 CSECT
         NOPR  ((@ENDDATD-@DATD)/161*16)
         DS    0F
@SIZDATD DC    AL1(0)
         DC    AL3(@ENDDATD-@DATD)
@CV00235 DC    V(ISDAFREE)
@CV00236 DC    V(ISDAGET0)
         DS    0D
GETWORK  DS    FL4
         ORG   GETWORK
@NM00015 DC    AL1(1)
@NM00016 DC    AL3(2048)
         ORG   GETWORK+4
@CC00319 DC    C'DCS '
PATCH    DS    CL50
         ORG   PATCH
@NM00008 DC    50X'00'
         ORG   PATCH+50
ZERO     DS    CL16
         ORG   ZERO
@NM00017 DC    16X'00'
         ORG   ZERO+16
@00      EQU   00                      EQUATES FOR REGISTERS 0-15
@01      EQU   01
@02      EQU   02
@03      EQU   03
@04      EQU   04
@05      EQU   05
@06      EQU   06
@07      EQU   07
@08      EQU   08
@09      EQU   09
@10      EQU   10
@11      EQU   11
@12      EQU   12
@13      EQU   13
@14      EQU   14
@15      EQU   15
WORKX2   EQU   @05
WORKX1   EQU   @06
WORKVAR  EQU   @02
RETCODE  EQU   @07
GET0INDX EQU   @02
GET0PTR  EQU   @04
LPARMPTR EQU   @10
CVTPTR   EQU   @03
SENSEPTR EQU   @05
R1       EQU   @01
R15      EQU   @15
OBRMDR   EQU   0
SCW      EQU   OBRMDR
SWITCHES EQU   OBRMDR+6
DATETIME EQU   OBRMDR+12
DATE     EQU   DATETIME
TIME     EQU   DATETIME+4
CPUSERID EQU   OBRMDR+21
ISDAMSCS EQU   0
SUBSYSID EQU   ISDAMSCS+1
SSID     EQU   SUBSYSID
SUBSENSE EQU   ISDAMSCS+4
SUBFMTMG EQU   SUBSENSE+7
ISDAMSC4 EQU   4
FMTMSG4  EQU   ISDAMSC4+7
SASENSE  EQU   ISDAMSC4+8
ISDACVT  EQU   0
CVTPTRS0 EQU   ISDACVT
DATAPTR  EQU   CVTPTRS0
SDATAPTR EQU   CVTPTRS0+4
PARMPTR  EQU   CVTPTRS0+8
DCS00PTR EQU   CVTPTRS0+40
WORKCALL EQU   CVTPTRS0+96
GET0CALL EQU   ISDACVT+100
SPNOLEN  EQU   GET0CALL
COREADDR EQU   GET0CALL+4
HEXPCALL EQU   ISDACVT+108
PRT0CALL EQU   ISDACVT+120
OUTLINE  EQU   PRT0CALL
SDADATD  EQU   ISDACVT+256
PRTDATD  EQU   ISDACVT+416
ISDAPRMS EQU   0
CINPUT   EQU   ISDAPRMS
CSTART   EQU   ISDAPRMS+2
CEND     EQU   ISDAPRMS+6
CSUMMARY EQU   ISDAPRMS+10
CFSCONLY EQU   ISDAPRMS+13
CSSIDF   EQU   ISDAPRMS+17
CRATIO   EQU   ISDAPRMS+19
CSERIAL  EQU   ISDAPRMS+21
CREPORTS EQU   ISDAPRMS+33
CDCS     EQU   CREPORTS
GET0HDR1 EQU   28
RATIO    EQU   GET0HDR1
SUM      EQU   GET0HDR1+2
SER      EQU   GET0HDR1+4
RETCDSV  EQU   GET0HDR1+16
GET0PSV  EQU   GET0HDR1+20
GET0XSV  EQU   GET0HDR1+24
DCSENTRY EQU   0
CHAINPTR EQU   DCSENTRY
DATIME   EQU   DCSENTRY+4
SNS4D    EQU   DCSENTRY+12
SNS1A2   EQU   SNS4D
SNS9A10  EQU   SNS4D+2
SNS12T31 EQU   SNS4D+4
SNSRDUC  EQU   SNS12T31
SNSRDCK  EQU   SNS12T31+2
SNSBYT14 EQU   SNSRDCK
SNSWRUC  EQU   SNS12T31+4
SNSWRCK  EQU   SNS12T31+6
SNSBYT20 EQU   SNS12T31+8
SNSCSN   EQU   SNS12T31+9
SNSRDRAT EQU   DCSENTRY+40
SNSWRAT  EQU   DCSENTRY+41
ISDAGHDR EQU   0
STARTPTR EQU   ISDAGHDR
GET0SPLN EQU   ISDAGHDR+8
GET0LEN  EQU   GET0SPLN+1
NEXTPTR  EQU   ISDAGHDR+12
LASTPTR  EQU   ISDAGHDR+16
BLOCKID  EQU   ISDAGHDR+20
BLOCKCNT EQU   ISDAGHDR+24
WORKPTR  EQU   0
*                                      START UNREFERENCED COMPONENTS
@NM00018 EQU   ISDAGHDR+26
GET0SPNO EQU   GET0SPLN
ENDPTR   EQU   ISDAGHDR+4
@NM00014 EQU   DCSENTRY+42
@NM00013 EQU   SNS4D+25
SNSAVAL4 EQU   SNSBYT20
SNSLDCHK EQU   SNSBYT20
SNSFORCE EQU   SNSBYT20
OFLOWRCK EQU   SNSWRCK
@NM00012 EQU   SNSWRCK
OFLOWRUC EQU   SNSWRUC
OFLORDCK EQU   SNSBYT14
@NM00011 EQU   SNSBYT14
OFLORDUC EQU   SNSRDUC
SNSADDR  EQU   SNS9A10
SNSBYT9  EQU   SNS9A10
SNSSID   EQU   SNS1A2
SNSBYT1  EQU   SNS1A2
ATIME    EQU   DATIME+4
ADATE    EQU   DATIME
@NM00010 EQU   GET0HDR1+18
@NM00009 EQU   GET0HDR1+3
CTRACE   EQU   ISDAPRMS+48
CGEN     EQU   ISDAPRMS+47
CDETAIL  EQU   ISDAPRMS+46
CPERIOD  EQU   ISDAPRMS+45
CPWR     EQU   CREPORTS+11
CAPRSUU  EQU   CREPORTS+10
CDRC     EQU   CREPORTS+9
CDAT     EQU   CREPORTS+8
CCSBCSF  EQU   CREPORTS+7
CDCKTLX  EQU   CREPORTS+6
CEQC     EQU   CREPORTS+5
CFSC     EQU   CREPORTS+4
CDHEDHU  EQU   CREPORTS+3
CSUM     EQU   CREPORTS+2
CPAD     EQU   CREPORTS+1
CSERNO   EQU   CSERIAL+4
@NM00007 EQU   CSERIAL+3
CIBM     EQU   CSERIAL
CSSID    EQU   CSSIDF
@NM00006 EQU   CSSIDF
CFSC34   EQU   CFSCONLY+2
CFSC12   EQU   CFSCONLY
CTYPE    EQU   ISDAPRMS+11
CENDDAY  EQU   CEND+2
CENDYEAR EQU   CEND
CSTDAY   EQU   CSTART+2
CSTYEAR  EQU   CSTART
CHISTIN  EQU   CINPUT+1
CLOGIN   EQU   CINPUT
PRTSA001 EQU   PRTDATD
SDATEMPS EQU   SDADATD+136
SDASA002 EQU   SDADATD+76
SDAPC001 EQU   SDADATD+72
SDASA001 EQU   SDADATD
SDARPTID EQU   PRT0CALL+133
LINE     EQU   OUTLINE+1
ANSI     EQU   OUTLINE
DUMPIDNO EQU   HEXPCALL+8
DUMPLEN  EQU   HEXPCALL+4
DUMPADDR EQU   HEXPCALL
CORELEN  EQU   SPNOLEN+1
SPNO     EQU   SPNOLEN
GEN00PTR EQU   CVTPTRS0+92
CNFG0PTR EQU   CVTPTRS0+88
PWR00PTR EQU   CVTPTRS0+84
APR00PTR EQU   CVTPTRS0+80
DRC00PTR EQU   CVTPTRS0+76
DAT00PTR EQU   CVTPTRS0+72
CSB00PTR EQU   CVTPTRS0+68
DCK00PTR EQU   CVTPTRS0+64
EQC00PTR EQU   CVTPTRS0+60
FSC00PTR EQU   CVTPTRS0+56
DHE00PTR EQU   CVTPTRS0+52
SUM00PTR EQU   CVTPTRS0+48
PAD00PTR EQU   CVTPTRS0+44
LOG00PTR EQU   CVTPTRS0+36
HIST0PTR EQU   CVTPTRS0+32
PRT00PTR EQU   CVTPTRS0+28
GET00PTR EQU   CVTPTRS0+24
TYPE0PTR EQU   CVTPTRS0+20
PARM0PTR EQU   CVTPTRS0+16
SDA00PTR EQU   CVTPTRS0+12
BYTE27F4 EQU   SASENSE+19
BYTE26F4 EQU   SASENSE+18
BYTE25F4 EQU   SASENSE+17
BYTE24F4 EQU   SASENSE+16
FSCFMT4  EQU   SASENSE+14
BYTE21F4 EQU   SASENSE+13
BYTE20F4 EQU   SASENSE+12
BYTE19F4 EQU   SASENSE+11
BYTE18F4 EQU   SASENSE+10
BYTE17F4 EQU   SASENSE+9
BYTE16F4 EQU   SASENSE+8
BYTE15F4 EQU   SASENSE+7
BYTE14F4 EQU   SASENSE+6
BYTE13F4 EQU   SASENSE+5
BYTE12F4 EQU   SASENSE+4
BYTE11F4 EQU   SASENSE+3
BYTE10F4 EQU   SASENSE+2
BYTE9F4  EQU   SASENSE+1
BYTE8F4  EQU   SASENSE
MSGCODE4 EQU   FMTMSG4
SUBFMTN4 EQU   FMTMSG4
LOWADDF4 EQU   ISDAMSC4+6
RETRYF4  EQU   ISDAMSC4+5
@NM00005 EQU   ISDAMSC4+4
CMDERRF4 EQU   ISDAMSC4+3
CHADDRF4 EQU   ISDAMSC4+2
STATUS24 EQU   ISDAMSC4+1
STATUS14 EQU   ISDAMSC4
SANOMSCD EQU   SUBSENSE+27
RCYLMSCD EQU   SUBSENSE+25
RUAMSCD  EQU   SUBSENSE+24
MSCFSC   EQU   SUBSENSE+22
@NM00004 EQU   SUBSENSE+21
RUADASD  EQU   SUBSENSE+20
DASDFSC  EQU   SUBSENSE+18
@NM00003 EQU   SUBSENSE+8
MSGCODEN EQU   SUBFMTMG
SUBFMTNO EQU   SUBFMTMG
SALOWAD2 EQU   SUBSENSE+6
SARETRY  EQU   SUBSENSE+5
@NM00002 EQU   SUBSENSE+4
DASDFMTN EQU   SUBSENSE+3
SALOWADD EQU   SUBSENSE+2
SUBSTAT5 EQU   SUBSENSE+1
SUBSTAT4 EQU   SUBSENSE
FORMATNO EQU   ISDAMSCS+3
SSIDDEVT EQU   SSID+1
SSIDLIBN EQU   SSID+1
SSIDTYPE EQU   SSID
SSIDFLAG EQU   SUBSYSID
STATUS   EQU   ISDAMSCS
CPUID    EQU   CPUSERID+3
CPUSER   EQU   CPUSERID
VERNO    EQU   OBRMDR+20
TENSHUND EQU   TIME+3
SECOND   EQU   TIME+2
MINUTE   EQU   TIME+1
HOUR     EQU   TIME
DAY      EQU   DATE+2
YEAR     EQU   DATE
RECENTRY EQU   OBRMDR+11
RCDCNT   EQU   OBRMDR+10
SWITCH3  EQU   SWITCHES+3
SWITCH2  EQU   SWITCHES+2
SWITCH1  EQU   SWITCHES+1
SWITCH0  EQU   SWITCHES
SYSREL   EQU   OBRMDR+5
CLASRC   EQU   OBRMDR+4
@NM00001 EQU   SCW+3
SCODE    EQU   SCW+2
SLENGTH  EQU   SCW
*                                      END UNREFERENCED COMPONENTS
@RC00033 EQU   @RC00032
@RC00034 EQU   @RC00033
@ENDDATA EQU   *
         END   ISDADCS0,(C'PLS0105',0603,75313)
