ACCDSECT DSECT
ACCBAT   DS    0BL100             BATCH CHARGE
ACCTERM  DS    0BL101             TSO TERMINAL CHARGE
ACCUNC   DS    0BL102             UNIT RECORD CHARGES
ACCDEV   DS    0BL103             DEVICE CHARGE
ACCNIT   DS    0BL104             NITE RATE CHARGE
ACCMVT   DS    0BL107             MVT CHARGE
ACCRECID DS    BL1                RECORD ID
*
*        ROUTE CODE FOR HASP JOB OR CPO FLAGS OR
*        DEVICE CODE FOR DEVICE CHARGE E.G. RJE CONNECT
ACCFLAG0 DS    BL1
*
*        HASP ROUTE CODE FOR PRINTING OF CPO FLAGS
ACCFLAG1 DS    BL1
*
*        HASP ROUTE CODE FOR PUNCHING
ACCFLAG2 DS    BL1
*
ACCTIMON DS    F                  TIME ON
ACCDATON DS    PL4                DATE ON MACHINE OR DEVICE
ACCUSER  DS    CL8                USERID
ACCPROJ  DS    CL8                PROJID
ACCCDRD  DS    0F                 FIELD ALSO USED FOR HASP CARDS READ
ACCCPU   DS    F                  CPU TIME
ACCLNPR  DS    0F                 FIELD ALSO USED FOR LINES PRINTED
ACCCORE1 DS    F                  CORE*CONNECT TIME
ACCCDPU  DS    0F                 FIELD ALSO USED FOR CARDS PUNCHED
ACCCODES DS    F                  OLD CYTOS CODES
ACCTIMOF DS    F                  TIME OFF
ACCIOCNT DS    F                  EXCP COUNT OF IO EVENTS
ACCCORE2 DS    F                  CORE*CPU TIME
ACCCHRG  DS    F                  CHARGES IN MONEY TO ACCNT
         DS    F
ACCEND   DS    0F
ACCLRECL EQU   ACCEND-ACCDSECT    RECORD LENGTH OF SYS1.ACCT
