         MACRO ,                   CONDITIONAL-TEST BLOCK.
&N       IF    &A,&REL,&C
         @IF   &A,&REL,&C,GOTO=ELSE&SYSNDX,NEGATE=1
         @PUSH IF,N=&N,A=&SYSNDX
         MEND
