PDDSPDSN DS    A              A(DSNAME)
PDDSLDSN DS    H              LENGTH(DSNAME)
PDSDSN   DS    0BL100         DSNAME PRESENT
PDSQUOT  DS    0BL101         DSNAME QUOTED
PDDSFLG1 DS    X              DSNAME FLAGS
         DS    X              RESERVED
PDDSPMNM DS    A              A(MEMBERNAME)
PDDSLMNM DS    H              LENGTH(MEMBERNAME)
PDSMNM   DS    0BL110         MEMBERNAME PRESENT
PDDSFLG2 DS    X              MEMBERNAME FLAGS
         DS    X              RESERVED
PDDSPPSW DS    A              A(PASSWORD)
PDDSLPSW DS    H              LENGTH(PASSWORD)
PDSPSWD  DS    0BL120         PASSWORD PRESENT
PDDSFLG3 DS    X              PASSWORD FLAGS
         DS    X              RESERVED
PDDSL    EQU   *-PDDSPDSN
