PPLUPT   DS    A              A(USER PROFILE TABLE)
PPLECT   DS    A              A(ENVIRONMENT CONTROL TABLE)
PPLECB   DS    A              A(EVENT CONTROL BLOCK)
PPLPCL   DS    A              A(PARAMETER CONTROL LIST)
PPLANS   DS    A              A(PARAMETER DESCRIPTOR LIST)
PPLCBUF  DS    A              A(COMMAND BUFFER)
PPLUWA   DS    A              A(WORKAREA)
PPLL     EQU   *-PPLUPT
