)ATTR DEFAULT(%+_)
    % TYPE(TEXT) INTENS(HIGH) COLOR(WHITE) SKIP(ON)
    Ö TYPE(TEXT) INTENS(HIGH) COLOR(YELLOW)
    + TYPE(TEXT) INTENS(LOW)  COLOR(TURQ) SKIP(ON)
    ^ TYPE(OUTPUT) INTENS(LOW)  COLOR(TURQ)
    _ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED)
    | TYPE(INPUT) INTENS(HIGH) CAPS(OFF)
    @ TYPE(OUTPUT) INTENS(HIGH) COLOR(WHITE)
    # TYPE(OUTPUT) INTENS(HIGH) COLOR(YELLOW)
)BODY EXPAND(\\)
+-\-\-ÖISPMODE Session Display#Z+-\-\-
%COMMAND ===>|ZCMD                                            %SCROLL ==
Enter an ISPF command, a PDS subcommand or a special control code:
  %LA+Lista     %1+Suspend ISPF    %9+Swap panels   %R+Recall
  %LV+Listv     %6+MEMLIST all     %F+Find          %X+Above/Below/All
  %ML+Memlist   %7+Output log      %O+Options       %*+Memlist *
%&PDSMSG  --------------------------------------------------------------
)MODEL
@Z
^Z
)INIT
   .HELP  = P85PN3@
   .ZVARS = '(LOGNO ZSCBR PDSLN1 PDSLN2)'
   &X = TRUNC(&PDSTNAME,7)
   &LOGNO = .TRAIL
)PROC
   &PPRE = TRUNC(&ZCMD,3)
   IF (&PPRE = 'c ''' OR           /* cHANGE ' command?     */
       &PPRE = 'C ''')             /* Change ' command?     */
     &PDSN = TRUNC(&ZCMD,2)
     &PDSN = .TRAIL
     &PFC = TRUNC(&PDSN,1)         /* If first character    */
     IF (&PFC = '''')              /*   of DSN is "'" check */
       &PREM = .TRAIL              /*   to see if last "'"  */
       &PREM2 = TRUNC(&PREM,'''')  /*   is missing.         */
       IF (&PREM2 = &PREM)         /* If last "'" missing   */
         &ZCMD = '&ZCMD&PFC'       /*   add it to the end.  */
)END
