)ATTR DEFAULT(%+_)
    % TYPE(TEXT) INTENS(HIGH) COLOR(WHITE) SKIP(ON)
    Ö TYPE(TEXT) INTENS(HIGH) COLOR(YELLOW)
    + TYPE(TEXT) INTENS(LOW)  COLOR(TURQ) SKIP(ON)
    _ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED)
    ^ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED) PAD(_)
    | TYPE(INPUT) INTENS(HIGH) CAPS(OFF)
)BODY EXPAND(\\)
%TUTORIAL  +-\-\-ÖPDS LISTC Outputs+-\-\-
%OPTION  ===>_ZCMD
+
   The first LISTC panel shows basic dataset information like:
   DSNAME, VOLUME, attributes.  Command error messages are provided
   under the DATA header as follows:
    %*INVALID -+This line command is not supported

   The second LISTC panel provides the full 44 character dataset name
   which leaves room for only a little attribute information.

   The third LISTC panel is a triple line panel with most of the dataset
   attribute and space information.

   The C and V fields are to indicate if the dataset is cataloged and/or
   on the volume:  Y for yes or N for no or "-" for unknown or not check

   Other catalog indicators from VTOC command:
     W -  Cataloged on another volume
     E -  Catalog processing error
)END
