*          DATA SET APEMAN3    AT LEVEL 002 AS OF 11/12/75
//TEC102 JOB 526TSO000S0003,TEC,CLASS=D,MSGCLASS=3,PRTY=6,NOTIFY=ARNIE
//ASMBLR       PROC OBJ=NODECK,K=256,CC=4,SO=D
//COM          EXEC PGM=IEV90,REGION=&K.K,COND=(&CC,LT),
//             PARM='LOAD,LINECNT=59,&OBJ'
//SYSLIB       DD   DISP=SHR,DSN=SYS1.MACLIB
//             DD   DISP=SHR,DSN=CBT.MACLIB
//SYSPRINT     DD   SYSOUT=&SO,
//             DCB=(RECFM=FBM,LRECL=121,BLKSIZE=12221)
//SYSPUNCH     DD   SYSOUT=B,DCB=(RECFM=FB,LRECL=80,BLKSIZE=12240)
//SYSUT1       DD   UNIT=SYSDA,SPACE=(CYL,(10,2))
//SYSLIN       DD   DSN=&LOADSET,UNIT=SYSDA,SPACE=(CYL,(5,1)),
//             DISP=(MOD,PASS),DCB=BLKSIZE=12240
//SYSIN        DD   DISP=(OLD,DELETE),DSN=&WORK
//SYSABEND  DD SYSOUT=&SO
// PEND
//TESTLINK     PROC OPT=,NAME=RUN,CC=4,SO=D,LIB='TEST.LOAD'
//LKED         EXEC PGM=IEWL,REGION=256K,COND=(&CC,LT),
//             PARM='XREF,LIST&OPT',DPRTY=(15,10)
//SYSPRINT     DD   SYSOUT=&SO
//SYSUT1       DD   DSN=&SYSUT1,UNIT=SYSDA,SPACE=(TRK,(10,5)),
//             DCB=OPTCD=C
//SYSLMOD      DD   DISP=SHR,DSN=&LIB.(&NAME)
//SYSABEND  DD  SYSOUT=C
//SYSLIN       DD   UNIT=SYSDA,DSN=&LOADSET,DISP=(OLD,DELETE)
//             DD   DDNAME=SYSIN
//SYSLIB       DD   DISP=SHR,DSN=PROD.UTIL
//             DD   DISP=SHR,DSN=SYS1.COBLIB
//             DD   DISP=SHR,DSN=SYS1.TELCMLIB
//             DD   DISP=SHR,DSN=SYS1.FORTLIB
//*            DD   DISP=SHR,DSN=SYS1.PL1LIB
//PRODLIB      DD   DISP=SHR,DSN=PROD.LOAD
//TESTLIB      DD   DISP=SHR,DSN=TEST.LOAD
// PEND
//STEP01 EXEC ASMBLR,SO=3
FILM CSECT
      SR        15,15
      BR        14
      END       FILM
//STEP02 EXEC ASMBLR,SO=3
GREND CSECT
      SR        15,15
      BR        14
      END       GREND
//STEP03 EXEC ASMBLR,SO=3
PSPACE CSECT
      SR        15,15
      BR        14
      END       PSPACE
//STEP04 EXEC ASMBLR,SO=3
CSPACE CSECT
      SR        15,15
      BR        14
      END       CSPACE
//STEP05 EXEC ASMBLR,SO=3
MAP CSECT
      SR        15,15
      BR        14
      END       MAP
//STEP06 EXEC ASMBLR,SO=3
POSITN CSECT
      SR        15,15
      BR        14
      END       POSITN
//STEP07 EXEC ASMBLR,SO=3
LINEFD CSECT
      SR        15,15
      BR        14
      END       LINEFD
//STEP08 EXEC ASMBLR,SO=3
SPACE CSECT
      SR        15,15
      BR        14
      END       SPACE
//STEP09 EXEC ASMBLR,SO=3
TYPECS CSECT
      SR        15,15
      BR        14
      END       TYPECS
//STEP10 EXEC ASMBLR,SO=3
TYPENI CSECT
      SR        15,15
      BR        14
      END       TYPENI
//STEP11 EXEC ASMBLR,SO=3
JOIN CSECT
      SR        15,15
      BR        14
      END       JOIN
//STEP12 EXEC ASMBLR,SO=3
PLOTNC CSECT
      SR        15,15
      BR        14
      END       PLOTNC
//STEP13 EXEC ASMBLR,SO=3
TYPHEX CSECT
      SR        15,15
      BR        14
      END       TYPHEX
//STEP14 EXEC ASMBLR,SO=3
CTRMAG CSECT
      SR        15,15
      BR        14
      END       CTRMAG
//STEP15 EXEC ASMBLR,SO=3
CTRORI CSECT
      SR        15,15
      BR        14
      END       CTRORI
//STEP16 EXEC ASMBLR,SO=3
TYPENC CSECT
      SR        15,15
      BR        14
      END       TYPENC
//STEP17 EXEC ASMBLR,SO=3
FRAME CSECT
      SR        15,15
      BR        14
      END       FRAME
//STEP18 EXEC ASMBLR,SO=3
HISTGM CSECT
      SR        15,15
      BR        14
      END       HISTGM
//STEP19 EXEC ASMBLR,SO=3
AXES CSECT
      SR        15,15
      BR        14
      END       AXES
//STEP20 EXEC ASMBLR,SO=3
HLINFD CSECT
      SR        15,15
      BR        14
      END       HLINFD
//STEP21 EXEC ASMBLR,SO=3
CRLNFD CSECT
      SR        15,15
      BR        14
      END       CRLNFD
//STEP22 EXEC ASMBLR,SO=3
TYPENF CSECT
      SR        15,15
      BR        14
      END       TYPENF
//STEP23 EXEC TESTLINK,SO=3,LIB='MVS.APEMAN',NAME=APEMAN3
