         TITLE 'AHLTFOR FGBR FOR VS2/R2                                *
                        '
AHLTFOR  CSECT ,                                                01S0001
@MAINENT DS    0H                                               01S0001
         USING *,@15                                            01S0001
         B     @PROLOG                                          01S0001
         DC    AL1(16)                                          01S0001
         DC    C'AHLTFOR   77.252'                              01S0001
         DROP  @15
@PROLOG  DS    0H                                               01S0002
*                                    /* (MDC364)             @G50EP9A*/
AHLTSRM  DS    0H                                               01S0058
         USING AHLTSRM,R15ENTRY   SETUP TEMP BASE
         L R12BASE,TFORBASE       GET BASE ADDRESS UPON ENTRY
         USING AHLTFOR,R12BASE    TELL ASSEMBLER ABOUT OUR BASE
         DROP R15ENTRY            TELL ASSEM TO QUIT USING R15
*   DO;                                                         02S0059
*                                                               02S0059
*     /***************************************************************/
*     /*                                                             */
*     /* THIS CODE GATHERS THE PERTINENT DATA ON A HOOK FROM THE     */
*     /* SYSTEMS RESOURCE MANAGER                                    */
*     /*                                                             */
*     /***************************************************************/
*                                                               02S0060
*     ;                                                         02S0060
*                                                               02S0060
*     /***************************************************************/
*     /*                                                             */
*     /* HOUSEKEEPING - SET THE SRM MCATRAIL BIT ON, DO A SETFRR TO  */
*     /* SET UP ERROR RECOVERY, SAVE REG 14 FOR THE RETURN ADDRESS   */
*     /* AND TEST FOR THE HOOK BEING ISSUED FROM SUPERVISOR STATE AND*/
*     /* KEY ZERO                                                    */
*     /*                                                             */
*     /***************************************************************/
*                                                               02S0061
*     RFY                                                       02S0061
*      (R8FRRAD,                                                02S0061
*       R10WORK,                                                02S0061
*       R14) RSTD;                                              02S0061
*     MCATRAIL=SRMON;               /* ZERO OUT TRAIL AND TURN ON BIT
*                                      TO INDICATE SRM GATHERING IN
*                                      CONTROL                       */
         MVC   MCATRAIL(8,AWSAPTR),@CB02541                     02S0062
*     R8FRRAD=ADDR(AHLTFORE);       /* GET ADDRESS OF THE RECOVERY
*                                      ROUTINE                       */
         LA    R8FRRAD,AHLTFORE                                 02S0063
*     GEN REFS(AHLTFORE) SETS(R9PARM,R10WORK) NOEXIT SEQFLOW NOFLOWS;
       SETFRR A,FRRAD=(R8FRRAD),PARMAD=(R9PARM),                       *
               WRKREGS=(R9PARM,R10WORK)
*     SVR14NRM=R14;                 /* SAVE RETURN ADDRESS           */
         ST    R14,SVR14NRM(,R9PARM)                            02S0065
*     RFY                                                       02S0066
*      (R8FRRAD,                                                02S0066
*       R14) UNRSTD;                                            02S0066
*                                                               02S0066
*     /***************************************************************/
*     /*                                                             */
*     /* BUILD THE SRM RECORD                                        */
*     /*                                                             */
*     /***************************************************************/
*                                                               02S0067
*     ;                                                         02S0067
*                                                               02S0067
*     /***************************************************************/
*     /*                                                             */
*     /* TEST FOR HOOK ACTUALLY FROM SRM AND THEN DETERMINE WHETHER  */
*     /* BRANCH ENTRY OR MONITOR CALL. GET THE REGISTERS FROM THE    */
*     /* LCCA IF BRANCH ENTRY PICK UP REGS 0,1 AND 11 IF MC HOOK PICK*/
*     /* UP REG 0,1 AND 15                                           */
*     /*                                                             */
*     /***************************************************************/
*                                                               02S0068
*     RFY                                                       02S0068
*       LCCAPTR RSTD;                                           02S0068
*     LCCAPTR=PSALCCAV;             /* GET ADDR OF LCCA              */
         L     LCCAPTR,PSALCCAV                                 02S0069
*     IF MCRBRENT=ON THEN           /* CHECK FOR THE BRANCH ENTRY
*                                      HOOK                          */
         L     @08,MCAMCR(,AWSAPTR)                             02S0070
         TM    MCRBRENT(@08),B'00010000'                        02S0070
         BNO   @RF00070                                         02S0070
*       DO;                                                     02S0071
*         SRMREG11=MCRREGB;         /* GET REG 11 AS IT WAS AT  02S0072
*                                      INTERRUPT                     */
         MVC   SRMREG11(4,AWSAPTR),MCRREGB(@08)                 02S0072
*         SRMR0R1=MCRR0R1;          /* DITTO REG 0 AND REG 1 AS WITH
*                                      REG 11                        */
         MVC   SRMR0R1(8,AWSAPTR),MCRR0R1(@08)                  02S0073
*       END;                                                    02S0074
*     ELSE                                                      02S0075
*       DO;                                                     02S0075
         B     @RC00070                                         02S0075
@RF00070 DS    0H                                               02S0076
*         GEN REFS(KEYCMWP) NOEXIT FLOWS(COMUEXIT) SEQFLOW;     02S0076
       TM KEYCMWP,X'F1'    TEST FOR SUPER STATE AND KEY ZERO
       BNZ COMUEXIT         IF NOT BRANCH OUT OF THIS ROUTINE
*         SRMREG15=REGFLCCA;        /* GET REG 15 AS IT WAS AT  02S0077
*                                      INTERRUPT                     */
         MVC   SRMREG15(4,AWSAPTR),REGFLCCA(LCCAPTR)            02S0077
*         SRMR0R1=R0R1LCCA;         /* DITTO REG 0 AND REG 1 AS WITH
*                                      REG 15                        */
         MVC   SRMR0R1(8,AWSAPTR),R0R1LCCA(LCCAPTR)             02S0078
*       END;                                                    02S0079
*                                                               02S0080
*     /***************************************************************/
*     /*                                                             */
*     /* GET THE ASID FROM REG 0 IN LCCA OR FROM MCRWSA IF A BRANCH  */
*     /* ENTRY AND USE IT TO GET THE ASCB ADDRESS                    */
*     /*                                                             */
*     /***************************************************************/
*                                                               02S0080
*     R10WORK=SRMREG0;              /* REG 0 IN RECORD WILL HAVE ASID
*                                      INDEPENDENT OF WHICH TYPE OF
*                                      ENTRY                         */
@RC00070 ICM   R10WORK,15,SRMREG0(AWSAPTR)                      02S0080
*     RFY                                                       02S0081
*       LCCAPTR UNRSTD;                                         02S0081
*     GEN SETS(R10WORK) NOEXIT SEQFLOW(SRL R10WORK,16);/* SHIFT R0 TO
*                                      GET ASID IN LOW ORDER         */
         SRL R10WORK,16
*     RFY                                                       02S0083
*       ASCBPTR RSTD;                                           02S0083
*     IF R10WORK=0 THEN                                         02S0084
         LTR   R10WORK,R10WORK                                  02S0084
         BNZ   @RF00084                                         02S0084
*       DO;                                                     02S0085
*         ASCBPTR=PSAAOLD;          /* ZERO INDICATES CURRENT ASCB   */
         L     ASCBPTR,PSAAOLD                                  02S0086
*         SRMREG0(1:2)=ASCBASID;    /* GET ASID FROM CURRENT ASCB
*                                                            @YM07403*/
         MVC   SRMREG0(2,AWSAPTR),ASCBASID(ASCBPTR)             02S0087
*       END;                                                    02S0088
*     ELSE                                                      02S0089
*       DO;                                                     02S0089
         B     @RC00084                                         02S0089
@RF00084 DS    0H                                               02S0090
*         MCATRL3=FRSA;             /* SET ERROR ROUTINE ADDR        */
         MVI   MCATRL3(AWSAPTR),X'08'                           02S0090
*         ASCBPTR=ASVTENTY(R10WORK);/* USE ASID TO ACCESS ASVT AND
*                                      GET ASCB                      */
         LR    @11,R10WORK                                      02S0091
         SLA   @11,2                                            02S0091
         L     @08,CVTPTR                                       02S0091
         L     @08,ASVTPTR(,@08)                                02S0091
         L     ASCBPTR,ASVTENTY-4(@11,@08)                      02S0091
*         RFY                                                   02S0092
*           R10WORK UNRSTD;                                     02S0092
*       END;                                                    02S0093
*                                                               02S0093
*     /***************************************************************/
*     /*                                                             */
*     /* CHECK TO SEE IF THIS HOOK IS RELATED TO GTF AND END IF IT IS*/
*     /*                                                             */
*     /***************************************************************/
*                                                               02S0094
*     IF ASCBPTR=GTFASCB THEN       /* CHECK TO SEE IF INTERRUPT FROM
*                                      GTF                           */
@RC00084 C     ASCBPTR,GTFASCB(,PCTPTR)                         02S0094
         BNE   @RF00094                                         02S0094
*       IF OPTTRC=OFF THEN          /* CHECK TO SEE IF TRACING GTF   */
         TM    OPTTRC(PCTPTR),B'00001000'                       02S0095
         BZ    @RT00095                                         02S0095
*         GO TO COMUEXIT;           /* NO, SO GO TO END              */
*     SRMASCB=ASCBPTR;              /* HOOK IS NOT RELATED TO GTF OR
*                                      WE ARE GATHERING GTF SO PUT IT
*                                      IN THE RECORD                 */
*                                                               02S0097
@RF00094 ST    ASCBPTR,SRMASCB(,AWSAPTR)                        02S0097
*     /***************************************************************/
*     /*                                                             */
*     /* PICK UP THE JOBNAME                                         */
*     /*                                                             */
*     /***************************************************************/
*                                                               02S0098
*     MCATRL3=FRSJ;                                             02S0098
         MVI   MCATRL3(AWSAPTR),X'04'                           02S0098
*     RFY                                                       02S0099
*       R10WORK RSTD;                                           02S0099
*     R10WORK=ASCBJBNI;             /* GET FIRST JOBNAME POINTER     */
         L     R10WORK,ASCBJBNI(,ASCBPTR)                       02S0100
*     IF R10WORK=0 THEN             /* CHECK FOR NO ADDRESS          */
         SLR   @11,@11                                          02S0101
         CR    R10WORK,@11                                      02S0101
         BNE   @RF00101                                         02S0101
*       DO;                                                     02S0102
*         R10WORK=ASCBJBNS;         /* GET SECOND POINTER            */
         L     R10WORK,ASCBJBNS(,ASCBPTR)                       02S0103
*         IF R10WORK=0 THEN         /* CHECK FOR GOOD ADDRESS        */
         CR    R10WORK,@11                                      02S0104
         BE    @RT00104                                         02S0104
*           GO TO SNOJBNM;          /* GO TO SET N/A                 */
*       END;                                                    02S0106
*     IF JBNMTEST^=0 THEN           /* CHECK FOR VALID JOBNAME       */
@RF00101 L     @11,JBNMTEST(,R10WORK)                           02S0107
         LTR   @11,@11                                          02S0107
         BZ    @RF00107                                         02S0107
*       SRMJBNM=JOBNAME;            /* GOOD, SO GET IT               */
         MVC   SRMJBNM(8,AWSAPTR),JOBNAME(R10WORK)              02S0108
*     ELSE                                                      02S0109
*SNOJBNM:                                                       02S0109
*       SRMJBNM=NOTAPP;             /* IT IS NO GOOD SO SET TO N/A   */
         B     @RC00107                                         02S0109
@RF00107 DS    0H                                               02S0109
SNOJBNM  MVC   SRMJBNM(8,AWSAPTR),@CC02504                      02S0109
*     RFY                                                       02S0110
*      (ASCBPTR,                                                02S0110
*       R10WORK) UNRSTD;                                        02S0110
@RC00107 DS    0H                                               02S0111
*                                                               02S0111
*     /***************************************************************/
*     /*                                                             */
*     /* SETUP TO GO TO EXIT ROUTINE TO STACK THE SRM RECORD         */
*     /*                                                             */
*     /***************************************************************/
*                                                               02S0111
*AHLSSTAK:                                                      02S0111
*     MCATRL3=UNRECOV;              /* SET TO CATASTROPHIC ERROR IND */
AHLSSTAK MVI   MCATRL3(AWSAPTR),X'00'                           02S0111
*     SRMCPUID=PSACPUSA;            /* GET CPUID FROM PSA    @YM03489*/
         LH    @08,PSACPUSA                                     02S0112
         STH   @08,SRMCPUID(,AWSAPTR)                           02S0112
*     RFY                                                       02S0113
*       R10WORK RSTD;                                           02S0113
*     R10WORK=LENGTH(SRMREC);       /* PUT THE LENGTH OF THE RECORD
*                                      IN REG 10                     */
         LA    R10WORK,26                                       02S0114
*     GO TO COMEXIT;                /* BRANCH TO THE COMMON EXIT
*                                      ROUTINE                       */
         B     COMEXIT                                          02S0115
*   END;                                                        02S0116
*AHLTFRR:                                                       01S0117
*   GEN SETS(R12BASE) NOEXIT NOFLOWS SEQFLOW;                   01S0117
AHLTFRR  DS    0H                                               01S0117
         USING AHLTFRR,R15ENTRY   SETUP TEMP BASE
         L R12BASE,TFORBASE       GET BASE ADDRESS UPON ENTRY
         USING AHLTFOR,R12BASE    TELL ASSEMBLER ABOUT OUR BASE
         DROP R15ENTRY            TELL ASSEM TO QUIT USING R15
*   DO;                                                         02S0118
*                                                               02S0118
*     /***************************************************************/
*     /*                                                             */
*     /* THIS SECTION GATHERS THE INFORMATION PERTINENT TO THE RETURN*/
*     /* FROM A FUNCTIONAL RECOVERY ROUTINE (FRR) TO RTM             */
*     /*                                                             */
*     /***************************************************************/
*                                                               02S0119
*     ;                                                         02S0119
*                                                               02S0119
*     /***************************************************************/
*     /*                                                             */
*     /* HOUSEKEEPING - SET THE FRR MCATRAIL BIT ON, DO A SETFRR TO  */
*     /* SET UP ERROR RECOVERY AND SAVE REG 14 FOR THE RETURN        */
*     /* ADDRESS. THE TEST FOR SUPERVISOR STATE AND KEY ZERO IS NOT  */
*     /* NECCESSARY BECAUSE THE FRR HOOK IS BRANCH ENTRY AND IS      */
*     /* CHECKED BY THE AHLMCIH MODULE                               */
*     /*                                                             */
*     /***************************************************************/
*                                                               02S0120
*     RFY                                                       02S0120
*      (R8FRRAD,                                                02S0120
*       R10WORK,                                                02S0120
*       R14) RSTD;                                              02S0120
*     MCATRAIL=FRRON;               /* ZERO OUT AUDIT TRAIL AND 02S0121
*                                      INDICATE FRR GATHERING IN
*                                      CONTROL                       */
         MVC   MCATRAIL(8,AWSAPTR),@CB02544                     02S0121
*     R8FRRAD=ADDR(AHLTFORE);       /* GET ADDRESS OF THE RECOVERY
*                                      ROUTINE                       */
         LA    R8FRRAD,AHLTFORE                                 02S0122
*     GEN REFS(AHLTFORE) SETS(R9PARM,R10WORK) NOEXIT SEQFLOW NOFLOWS;
     SETFRR A,FRRAD=(R8FRRAD),PARMAD=(R9PARM),WRKREGS=(R9PARM,R10WORK)
*     SVR14NRM=R14;                 /* SAVE RETURN ADDRESS           */
         ST    R14,SVR14NRM(,R9PARM)                            02S0124
*     RFY                                                       02S0125
*      (R8FRRAD,                                                02S0125
*       R14) UNRSTD;                                            02S0125
*     IF MCRBRENT=OFF THEN          /* CHECK TO SEE IF VALID FRR
*                                      BRANCH ENTRY                  */
         L     @11,MCAMCR(,AWSAPTR)                             02S0126
         TM    MCRBRENT(@11),B'00010000'                        02S0126
         BZ    @RT00126                                         02S0126
*       GO TO COMUEXIT;             /* IS NOT SO LEAVE WITHOUT  02S0127
*                                      GATHERING                     */
*                                                               02S0128
*     /***************************************************************/
*     /*                                                             */
*     /* BUILD THE FRR RECORD                                        */
*     /*                                                             */
*     /***************************************************************/
*                                                               02S0128
*     ;                                                         02S0128
*                                                               02S0128
*     /***************************************************************/
*     /*                                                             */
*     /* GET THE POINTER TO THE SDWA - GET THE ASID TO USE TO GET THE*/
*     /* ASCB ADDRESS                                                */
*     /*                                                             */
*     /***************************************************************/
*                                                               02S0129
*     FRRCPUID=PSACPUSA;            /* GET THE CPUID         @YM03489*/
         LH    @08,PSACPUSA                                     02S0129
         STH   @08,FRRCPUID(,AWSAPTR)                           02S0129
*     SDWAPTR=MCRREG1;              /* GET PTR TO RTCA               */
         L     SDWAPTR,MCRREG1(,@11)                            02S0130
*     MCATRL3=FRFA;                 /* SET AUDIT TRAIL IN CASE OF
*                                      ERROR                         */
         MVI   MCATRL3(AWSAPTR),X'02'                           02S0131
*     R10WORK=SDWAFMID;             /* GET ASID OF ERROR ASCB        */
         LH    R10WORK,SDWAFMID(,SDWAPTR)                       02S0132
         N     R10WORK,@CF02696                                 02S0132
*     RFY                                                       02S0133
*       ASCBPTR RSTD;                                           02S0133
*     IF R10WORK=0 THEN             /* CK TO SEE IF CURRENT ASCB     */
         LTR   R10WORK,R10WORK                                  02S0134
         BNZ   @RF00134                                         02S0134
*       DO;                                                     02S0135
*         MCATRL3=0;                /* RESET RECOV FLAG TO INDICATE
*                                      UNRECOV AREA                  */
         MVI   MCATRL3(AWSAPTR),X'00'                           02S0136
*         ASCBPTR=PSAAOLD;          /* YES SO GET CURRENT            */
         L     ASCBPTR,PSAAOLD                                  02S0137
*       END;                                                    02S0138
*     ELSE                                                      02S0139
*       ASCBPTR=ASVTENTY(R10WORK);  /* NO, SO GET FROM ASVT USING
*                                      ASID AS INDEX                 */
         B     @RC00134                                         02S0139
@RF00134 LR    @11,R10WORK                                      02S0139
         SLA   @11,2                                            02S0139
         L     @08,CVTPTR                                       02S0139
         L     @08,ASVTPTR(,@08)                                02S0139
         L     ASCBPTR,ASVTENTY-4(@11,@08)                      02S0139
*     RFY                                                       02S0140
*       R10WORK UNRSTD;                                         02S0140
@RC00134 DS    0H                                               02S0141
*     FRRASCB=ASCBPTR;              /* PUT ASCB ADDRESS INTO RECORD  */
*                                                               02S0141
         ST    ASCBPTR,FRRASCB(,AWSAPTR)                        02S0141
*     /***************************************************************/
*     /*                                                             */
*     /* PICK UP THE JOBNAME                                         */
*     /*                                                             */
*     /***************************************************************/
*                                                               02S0142
*     MCATRL5=FRFJ;                                             02S0142
         MVI   MCATRL5(AWSAPTR),X'02'                           02S0142
*     RFY                                                       02S0143
*       R10WORK RSTD;                                           02S0143
*     R10WORK=ASCBJBNI;             /* GET FIRST JOBNAME POINTER     */
         L     R10WORK,ASCBJBNI(,ASCBPTR)                       02S0144
*     IF R10WORK=0 THEN             /* CHECK FOR NO ADDRESS          */
         SLR   @11,@11                                          02S0145
         CR    R10WORK,@11                                      02S0145
         BNE   @RF00145                                         02S0145
*       DO;                                                     02S0146
*         R10WORK=ASCBJBNS;         /* GET SECOND POINTER            */
         L     R10WORK,ASCBJBNS(,ASCBPTR)                       02S0147
*         IF R10WORK=0 THEN         /* CHECK FOR GOOD ADDRESS        */
         CR    R10WORK,@11                                      02S0148
         BE    @RT00148                                         02S0148
*           GO TO FNOJBNM;          /* GO TO SET N/A                 */
*       END;                                                    02S0150
*     IF JBNMTEST^=0 THEN           /* CHECK FOR VALID JOBNAME       */
@RF00145 L     @11,JBNMTEST(,R10WORK)                           02S0151
         LTR   @11,@11                                          02S0151
         BZ    @RF00151                                         02S0151
*       FRRJBNM=JOBNAME;            /* GOOD, SO GET IT               */
         MVC   FRRJBNM(8,AWSAPTR),JOBNAME(R10WORK)              02S0152
*     ELSE                                                      02S0153
*FNOJBNM:                                                       02S0153
*       FRRJBNM=NOTAPP;             /* IT IS NO GOOD SO SET TO N/A   */
         B     @RC00151                                         02S0153
@RF00151 DS    0H                                               02S0153
FNOJBNM  MVC   FRRJBNM(8,AWSAPTR),@CC02504                      02S0153
*     RFY                                                       02S0154
*      (ASCBPTR,                                                02S0154
*       R10WORK) UNRSTD;                                        02S0154
@RC00151 DS    0H                                               02S0155
*                                                               02S0155
*     /***************************************************************/
*     /*                                                             */
*     /* PICK UP THE REST OF THE FIELDS FROM THE RTCA                */
*     /*                                                             */
*     /***************************************************************/
*                                                               02S0155
*AHLFNAME:                                                      02S0155
*     MCATRL3=FRFRT;                                            02S0155
AHLFNAME MVI   MCATRL3(AWSAPTR),X'01'                           02S0155
*     IF REXNTEST=0 THEN            /* CHECK WHETHER FRR NAME IS
*                                      VALID                         */
         L     @08,REXNTEST(,SDWAPTR)                           02S0156
         LTR   @08,@08                                          02S0156
         BNZ   @RF00156                                         02S0156
*       FRRNAME=UNAV;               /* NO, SO SET TO UNAVAIL         */
         MVC   FRRNAME(8,AWSAPTR),@CC02506                      02S0157
*     ELSE                                                      02S0158
*       FRRNAME=SDWAREXN;           /* YES, SO GET FROM RTCA         */
         B     @RC00156                                         02S0158
@RF00156 MVC   FRRNAME(8,AWSAPTR),SDWAREXN(SDWAPTR)             02S0158
*     FRRPSW=SDWAEC1;                                           02S0159
@RC00156 MVC   FRRPSW(8,AWSAPTR),SDWAEC1(SDWAPTR)               02S0159
*     FRRCC=SDWAABCC;               /* GET COMPLETION CODE           */
         MVC   FRRCC(4,AWSAPTR),SDWAABCC(SDWAPTR)               02S0160
*     FRREFLGS=SDWAFLGS;            /* GET ERROR TYPE FLAGS          */
         MVC   FRREFLGS(4,AWSAPTR),SDWAFLGS(SDWAPTR)            02S0161
*     FRRFMCHD=SDWAMCHD;            /* GET MACHINE CHECK FLAGS       */
         MVC   FRRFMCHD(1,AWSAPTR),SDWAMCHD(SDWAPTR)            02S0162
*     FRRFACF2=SDWAACF2;            /* GET ACTION REQUESTED FLAGS    */
         MVC   FRRFACF2(1,AWSAPTR),SDWAACF2(SDWAPTR)            02S0163
*     FRRFRCDE=SDWARCDE;            /* GET RETURN CODE FROM RTCA     */
         MVC   FRRFRCDE(1,AWSAPTR),SDWARCDE(SDWAPTR)            02S0164
*     IF SDWARCDE=RETRY THEN        /* CK FOR RETRY SO CAN GET RETRY
*                                      ADDR                          */
         CLI   SDWARCDE(SDWAPTR),4                              02S0165
         BNE   @RF00165                                         02S0165
*       FRRRTRY=SDWARTYA;           /* GET RETRY ADDR                */
         MVC   FRRRTRY(4,AWSAPTR),SDWARTYA(SDWAPTR)             02S0166
*     ELSE                                                      02S0167
*       FRRRTRY=NOTAPP;             /* NOT RETRY SO SET ADDR TO N/A  */
         B     @RC00165                                         02S0167
@RF00165 MVC   FRRRTRY(4,AWSAPTR),@CC02504                      02S0167
*                                                               02S0168
*     /***************************************************************/
*     /*                                                             */
*     /* SETUP TO BRANCH TO THE EXIT ROUTINE AND STACK THE FRR RECORD*/
*     /*                                                             */
*     /***************************************************************/
*                                                               02S0168
*AHLFSTAK:                                                      02S0168
*     MCATRL3=UNRECOV;              /* SET ERROR ROUTINE TO INDICATE
*                                      CAT ERR I* F OCCURS           */
@RC00165 DS    0H                                               02S0168
AHLFSTAK MVI   MCATRL3(AWSAPTR),X'00'                           02S0168
*     RFY                                                       02S0169
*       R10WORK RSTD;                                           02S0169
*     R10WORK=LENGTH(FRRREC);       /* PUT THE LENGTH OF THE RECORD
*                                      IN REG 10                     */
         LA    R10WORK,46                                       02S0170
*     GO TO COMEXIT;                /* BRANCH TO THE COMMON EXIT
*                                      ROUTINE                       */
         B     COMEXIT                                          02S0171
*   END;                                                        02S0172
*AHLTSTAE:                                                      01S0173
*   GEN SETS(R12BASE) NOEXIT NOFLOWS SEQFLOW;                   01S0173
AHLTSTAE DS    0H                                               01S0173
         USING AHLTSTAE,R15ENTRY  SETUP TEMP BASE
         L R12BASE,TFORBASE       GET BASE ADDRESS UPON ENTRY
         USING AHLTFOR,R12BASE    TELL ASSEMBLER ABOUT OUR BASE
         DROP R15ENTRY            TELL ASSEM TO QUIT USING R15
*   DO;                                                         02S0174
*                                                               02S0174
*     /***************************************************************/
*     /*                                                             */
*     /* THIS SECTION GATHERS THE INFORMATION PERTINENT TO THE RETURN*/
*     /* FROM AN ESTAE OR A STAE ERROR EXIT TO RTM                   */
*     /*                                                             */
*     /***************************************************************/
*                                                               02S0175
*     ;                                                         02S0175
*                                                               02S0175
*     /***************************************************************/
*     /*                                                             */
*     /* HOUSEKEEPING - SET STA MCATRAIL BIT ON, DO A SETFRR TO SET  */
*     /* UP ERROR RECOVERY, SAVE REG 14 FOR THE RETURN ADDRESS, AND  */
*     /* TEST FOR THE HOOK BEING ISSUED FROM SUPERVISOR STATE, KEY   */
*     /* ZERO                                                        */
*     /*                                                             */
*     /***************************************************************/
*                                                               02S0176
*     RFY                                                       02S0176
*      (R8FRRAD,                                                02S0176
*       R10WORK,                                                02S0176
*       R14) RSTD;                                              02S0176
*     MCATRAIL=STAON;               /* ZERO OUT TRAIL INDICATE STAE
*                                      GATHERING IN CONTROL          */
         MVC   MCATRAIL(8,AWSAPTR),@CB02550                     02S0177
*     R8FRRAD=ADDR(AHLTFORE);       /* GET ADDRESS OF THE RECOVERY
*                                      ROUTINE                       */
         LA    R8FRRAD,AHLTFORE                                 02S0178
*     GEN REFS(AHLTFORE) SETS(R9PARM,R10WORK) NOEXIT SEQFLOW NOFLOWS;
     SETFRR A,FRRAD=(R8FRRAD),PARMAD=(R9PARM),WRKREGS=(R9PARM,R10WORK)
*     SVR14NRM=R14;                 /* SAVE RETURN ADDRESS           */
         ST    R14,SVR14NRM(,R9PARM)                            02S0180
*     RFY                                                       02S0181
*      (R8FRRAD,                                                02S0181
*       R10WORK,                                                02S0181
*       R14) UNRSTD;                                            02S0181
*     GEN REFS(KEYCMWP) NOEXIT SEQFLOW FLOWS(COMUEXIT);         02S0182
     TM KEYCMWP,X'F1'
     BNZ COMUEXIT
*     RFY                                                       02S0183
*       LCCAPTR RSTD;                                           02S0183
*                                                               02S0184
*     /***************************************************************/
*     /*                                                             */
*     /* BUILD THE E/STAE RECORD GET THE ASCB ADDRESS AND CHECK TO   */
*     /* SEE IF IT IS GTF RELATED. IF SO ARE WE TRACING GTF RELATED  */
*     /* HOOKS?                                                      */
*     /*                                                             */
*     /***************************************************************/
*                                                               02S0184
*     LCCAPTR=PSALCCAV;                                         02S0184
         L     LCCAPTR,PSALCCAV                                 02S0184
*     RFY                                                       02S0185
*       ASCBPTR RSTD;                                           02S0185
*     ASCBPTR=PSAAOLD;                                          02S0186
         L     ASCBPTR,PSAAOLD                                  02S0186
*     STAASCB=ASCBPTR;              /* PUT ASCB ADDR IN RECORD       */
         ST    ASCBPTR,STAASCB(,AWSAPTR)                        02S0187
*     IF STAASCB=GTFASCB THEN       /* CHECK TO SEE IF INTERRUPT FROM
*                                      GTF                           */
         L     @10,STAASCB(,AWSAPTR)                            02S0188
         CL    @10,GTFASCB(,PCTPTR)                             02S0188
         BNE   @RF00188                                         02S0188
*       IF OPTTRC=OFF THEN          /* CHECK TO SEE IF TRACING GTF   */
         TM    OPTTRC(PCTPTR),B'00001000'                       02S0189
         BZ    @RT00189                                         02S0189
*         GO TO COMUEXIT;           /* NO SO END                     */
*                                                               02S0190
*     /***************************************************************/
*     /*                                                             */
*     /* PICK UP THE JOBNAME                                         */
*     /*                                                             */
*     /***************************************************************/
*                                                               02S0191
*     MCATRL5=FREJ;                                             02S0191
@RF00188 MVI   MCATRL5(AWSAPTR),X'01'                           02S0191
*     RFY                                                       02S0192
*       R10WORK RSTD;                                           02S0192
*     R10WORK=ASCBJBNI;             /* GET FIRST JOBNAME POINTER     */
         L     R10WORK,ASCBJBNI(,ASCBPTR)                       02S0193
*     IF R10WORK=0 THEN             /* CHECK FOR NO ADDRESS          */
         SLR   @08,@08                                          02S0194
         CR    R10WORK,@08                                      02S0194
         BNE   @RF00194                                         02S0194
*       DO;                                                     02S0195
*         R10WORK=ASCBJBNS;         /* GET SECOND POINTER            */
         L     R10WORK,ASCBJBNS(,ASCBPTR)                       02S0196
*         IF R10WORK=0 THEN         /* CHECK FOR GOOD ADDRESS        */
         CR    R10WORK,@08                                      02S0197
         BE    @RT00197                                         02S0197
*           GO TO ENOJBNM;          /* GO TO SET N/A                 */
*       END;                                                    02S0199
*     IF JBNMTEST^=0 THEN           /* CHECK FOR VALID JOBNAME       */
@RF00194 L     @08,JBNMTEST(,R10WORK)                           02S0200
         LTR   @08,@08                                          02S0200
         BZ    @RF00200                                         02S0200
*       STAJBNM=JOBNAME;            /* GOOD, SO GET IT               */
         MVC   STAJBNM(8,AWSAPTR),JOBNAME(R10WORK)              02S0201
*     ELSE                                                      02S0202
*ENOJBNM:                                                       02S0202
*       STAJBNM=NOTAPP;             /* IT IS NO GOOD SO SET TO N/A   */
         B     @RC00200                                         02S0202
@RF00200 DS    0H                                               02S0202
ENOJBNM  MVC   STAJBNM(8,AWSAPTR),@CC02504                      02S0202
*     RFY                                                       02S0203
*      (ASCBPTR,                                                02S0203
*       R10WORK) UNRSTD;                                        02S0203
@RC00200 DS    0H                                               02S0204
*     MCATRL5=0;                    /* RESET TRAIL TO CATASTROPHIC
*                                      ERROR INDICATOR               */
         MVI   MCATRL5(AWSAPTR),X'00'                           02S0204
*                                                               02S0205
*     /***************************************************************/
*     /*                                                             */
*     /* GATHER THE CPUID, REG 15 AND REG 1                          */
*     /*                                                             */
*     /***************************************************************/
*                                                               02S0205
*AHLECPID:                                                      02S0205
*     STACPUID=PSACPUSA;            /*                       @YM03489*/
AHLECPID LH    @10,PSACPUSA                                     02S0205
         STH   @10,STACPUID(,AWSAPTR)                           02S0205
*     STAR15=REGFLCCA;              /* GET REGISTERS FROM LCCA       */
         MVC   STAR15(4,AWSAPTR),REGFLCCA(LCCAPTR)              02S0206
*     SDWAPTR=REG1LCCA;             /* GET POINTER TO RTCA FROM REG
*                                      SAVE AREA                     */
         L     SDWAPTR,REG1LCCA(,LCCAPTR)                       02S0207
*     STARTCA=SDWAPTR;              /* PUT SDWA ADDRESS INTO RECORD  */
*                                                               02S0208
         STCM  SDWAPTR,15,STARTCA(AWSAPTR)                      02S0208
*     /***************************************************************/
*     /*                                                             */
*     /* CHECK THE SDWA POINTER TO SEE IF IT IS FOR STAE, ESTAE OR NO*/
*     /* RTCA                                                        */
*     /*                                                             */
*     /***************************************************************/
*                                                               02S0209
*     IF SDWATEST>0 THEN            /* CHECK FOR AN ESTAE EXIT  02S0209
*                                      ROUTINE                       */
         SLR   @10,@10                                          02S0209
         CR    SDWATEST,@10                                     02S0209
         BNH   @RF00209                                         02S0209
*       DO;                                                     03S0210
*                                                               03S0210
*         /***********************************************************/
*         /*                                                         */
*         /* GATHER THE REST OF THE RECORD FOR A NORMAL ESTAE        */
*         /*                                                         */
*         /***********************************************************/
*                                                               03S0211
*         MCATRL5=FRERT;            /* SET AUDIT TRAIL               */
         MVI   MCATRL5(AWSAPTR),X'40'                           03S0211
*         IF REXNTEST=0 THEN        /* CHECK FOR VALID FRRNAME       */
         C     @10,REXNTEST(,SDWAPTR)                           03S0212
         BNE   @RF00212                                         03S0212
*           STANAME=UNAV;           /* NO, SO INDICATE U/A           */
         MVC   STANAME(8,AWSAPTR),@CC02506                      03S0213
*         ELSE                      /* IS GOOD SO PICK IT UP         */
*           STANAME=SDWAREXN;                                   03S0214
         B     @RC00212                                         03S0214
@RF00212 MVC   STANAME(8,AWSAPTR),SDWAREXN(SDWAPTR)             03S0214
*         STAEFLGS=SDWAFLGS;        /* ERROR TYPE FLAGS              */
@RC00212 MVC   STAEFLGS(4,AWSAPTR),SDWAFLGS(SDWAPTR)            03S0215
*         STAFMCHD=SDWAMCHD;        /* MACHINE CHECK FLAGS           */
         MVC   STAFMCHD(1,AWSAPTR),SDWAMCHD(SDWAPTR)            03S0216
*         STAFACF2=SDWAACF2;        /* ACTION REQUESTED FLAGS        */
         MVC   STAFACF2(1,AWSAPTR),SDWAACF2(SDWAPTR)            03S0217
*         STAFRCDE=SDWARCDE;        /* RETURN CODE                   */
         MVC   STAFRCDE(1,AWSAPTR),SDWARCDE(SDWAPTR)            03S0218
*         IF STAFRCDE=RETRY THEN    /* CHECK FOR RETRY AS RETURN CODE*/
         CLI   STAFRCDE(AWSAPTR),4                              03S0219
         BNE   @RF00219                                         03S0219
*           STARTRY=SDWARTYA;       /* IS GOOD SO GET ADDRESS OF
*                                      RETRY ROUTINE                 */
         MVC   STARTRY(4,AWSAPTR),SDWARTYA(SDWAPTR)             03S0220
*         ELSE                      /* NO GOOD SO PUT IN N/A         */
*           STARTRY=NOTAPP;                                     03S0221
         B     @RC00219                                         03S0221
@RF00219 MVC   STARTRY(4,AWSAPTR),@CC02504                      03S0221
*         STAPSW=SDWAEC1;                                       03S0222
@RC00219 MVC   STAPSW(8,AWSAPTR),SDWAEC1(SDWAPTR)               03S0222
*         STACC=SDWAABCC;           /* GET COMPLETION CODE           */
         MVC   STACC(4,AWSAPTR),SDWAABCC(SDWAPTR)               03S0223
*AHLESTAK:                                                      03S0224
*         MCATRL5=UNRECOV;          /* INDICATE CATAS ERROR AREA     */
AHLESTAK MVI   MCATRL5(AWSAPTR),X'00'                           03S0224
*       END;                                                    03S0225
*     ELSE                          /* IT IS NOT ESTAE               */
*       IF SDWATEST<0 THEN          /* CHECK FOR STAE                */
         B     @RC00209                                         02S0226
@RF00209 LTR   SDWATEST,SDWATEST                                02S0226
         BNM   @RF00226                                         02S0226
*         DO;                                                   03S0227
*                                                               03S0227
*           /*********************************************************/
*           /*                                                       */
*           /* GATHER THE REST OF THE RECORD FOR A NORMAL STAE       */
*           /*                                                       */
*           /*********************************************************/
*                                                               03S0228
*           MCATRL5=FREPC;          /* INDICATE AUDIT TRAIL          */
         MVI   MCATRL5(AWSAPTR),X'80'                           03S0228
*           GEN(LPR SDWAPTR,SDWAPTR);/* COMPLEMENT RTCA ADDRESS TO
*                                      MAKE POSITIVE                 */
         LPR SDWAPTR,SDWAPTR
*           STAPSW=SDWAEC1;                                     03S0230
         MVC   STAPSW(8,AWSAPTR),SDWAEC1(SDWAPTR)               03S0230
*           STACC=SDWAABCC;         /* PICK UP COMPLETION CODE       */
         MVC   STACC(4,AWSAPTR),SDWAABCC(SDWAPTR)               03S0231
*AHLNSTAK:                                                      03S0232
*           MCATRL5=UNRECOV;        /* INDICATE CATAS ERROR AREA     */
AHLNSTAK MVI   MCATRL5(AWSAPTR),X'00'                           03S0232
*           IF STAFRCDE^=RETRY THEN /* CHECK FOR RETURN CODE =4      */
         CLI   STAFRCDE(AWSAPTR),4                              03S0233
         BE    @RF00233                                         03S0233
*             STARTRY=NOTAPP;       /* NOT FOUR SO SET TO N/A        */
         MVC   STARTRY(4,AWSAPTR),@CC02504                      03S0234
*           ELSE                                                03S0235
*             STARTRY=REG0LCCA;     /* IS FOUR SO GET RETRY ADDRESS
*                                      FROM LCCA                     */
         B     @RC00233                                         03S0235
@RF00233 MVC   STARTRY(4,AWSAPTR),REG0LCCA(LCCAPTR)             03S0235
*           STANAME=NOTAPP;                                     03S0236
@RC00233 MVC   STANAME(8,AWSAPTR),@CC02504                      03S0236
*           STAEFLGS=NOTAPP;                                    03S0237
         MVC   STAEFLGS(4,AWSAPTR),@CC02504                     03S0237
*           STAMFLGS(1:3)=NOTAPP;                               03S0238
         MVC   STAMFLGS(3,AWSAPTR),@CC02504                     03S0238
*         END;                                                  03S0239
*       ELSE                        /* NEITHER STAE NOR ESTAE SO INFO
*                                      IS IN REGS AND NO RTCA EXISTS */
*         DO;                                                   02S0240
*                                                               02S0240
         B     @RC00226                                         02S0240
@RF00226 DS    0H                                               02S0241
*           /*********************************************************/
*           /*                                                       */
*           /* SET ALL FIELDS EXCEPT REGS TO U/A DUE TO THE          */
*           /* UNAVAILIBILITY OF AN SDWA (RTCA) AND ALSO PICK UP     */
*           /* RETRY ADDRESS FROM LCCA                               */
*           /*                                                       */
*           /*********************************************************/
*                                                               02S0241
*           STARTRY=REG0LCCA;                                   02S0241
         MVC   STARTRY(4,AWSAPTR),REG0LCCA(LCCAPTR)             02S0241
*           STANAME=UNAV;                                       02S0242
         MVC   STANAME(8,AWSAPTR),@CC02506                      02S0242
*           STAPSW=UNAV;                                        02S0243
         MVC   STAPSW(8,AWSAPTR),@CC02506                       02S0243
*           STACC=UNAV;                                         02S0244
         MVC   STACC(4,AWSAPTR),@CC02506                        02S0244
*           STAEFLGS=UNAV;                                      02S0245
         MVC   STAEFLGS(4,AWSAPTR),@CC02506                     02S0245
*           STAMFLGS(1:3)=UNAV;                                 02S0246
         MVC   STAMFLGS(3,AWSAPTR),@CC02506                     02S0246
*           RFY                                                 02S0247
*             LCCAPTR UNRSTD;                                   02S0247
*         END;                                                  02S0248
*                                                               02S0249
*     /***************************************************************/
*     /*                                                             */
*     /* SETUP TO BRANCH TO EXIT ROUTINE AND STACK THE E/STAE RECORD */
*     /*                                                             */
*     /***************************************************************/
*                                                               02S0249
*     RFY                                                       02S0249
*       R10WORK RSTD;                                           02S0249
@RC00226 DS    0H                                               02S0249
@RC00209 DS    0H                                               02S0250
*     R10WORK=LENGTH(STAREC);       /* PUT LENGTH OF THE RECORD IN
*                                      REG 10                        */
         LA    R10WORK,50                                       02S0250
*     GO TO COMEXIT;                /* BRANCH TO THE COMMON EXIT
*                                      ROUTINE                       */
         B     COMEXIT                                          02S0251
*   END;                                                        02S0252
*AHLTRNIO:                                                      01S0253
*   GEN SETS(R12BASE) NOEXIT NOFLOWS SEQFLOW;                   01S0253
AHLTRNIO DS    0H                                               01S0253
         USING AHLTRNIO,R15ENTRY  SETUP TEMP BASE
         L R12BASE,TFORBASE       GET BASE ADDRESS UPON ENTRY
         USING AHLTFOR,R12BASE    TELL ASSEMBLER ABOUT OUR BASE
         DROP R15ENTRY            TELL ASSEM TO QUIT USING R15
*   DO;                                                         02S0254
*                                                               02S0254
*     /***************************************************************/
*     /*                                                             */
*     /* THIS SECTION GATHERS THE INFORMATION PERTINENT TO A REQUEST */
*     /* TO THE VIRTUAL TELECOMMUNICATIONS ACCESS METHOD (VTAM) FOR  */
*     /* INPUT OR OUTPUT TO A REMOTE DEVICE                          */
*     /*                                                             */
*     /***************************************************************/
*                                                               02S0255
*     ;                                                         02S0255
*                                                               02S0255
*     /***************************************************************/
*     /*                                                             */
*     /* HOUSEKEEPING - SET THE RNIO MCATRAIL BIT ON, DO A SETFRR TO */
*     /* SET UP ERROR RECOVERY AND SAVE REG 14 FOR THE RETURN        */
*     /* ADDRESS. THE TEST FOR SUPERVISOR STATE IS DONE BUT KEY ZERO */
*     /* IS NOT CHECKED SINCE THE VTAM MODULE DOES NOT REQUIRE KEY   */
*     /* ZERO                                                        */
*     /*                                                             */
*     /***************************************************************/
*                                                               02S0256
*     RFY                                                       02S0256
*      (R8FRRAD,                                                02S0256
*       R10WORK,                                                02S0256
*       R14) RSTD;                                              02S0256
*     MCATRAIL=RNIOON;              /* ZERO OUT TRAIL AND INDICATE
*                                      RNIO IN CONTROL               */
         MVC   MCATRAIL(8,AWSAPTR),@CB02547                     02S0257
*     R8FRRAD=ADDR(AHLTFORE);       /* GET ADDRESS OF THE RECOVERY
*                                      ROUTINE                       */
         LA    R8FRRAD,AHLTFORE                                 02S0258
*     GEN REFS(AHLTFORE) SETS(R9PARM,R10WORK) NOEXIT SEQFLOW NOFLOWS;
     SETFRR A,FRRAD=(R8FRRAD),PARMAD=(R9PARM),WRKREGS=(R9PARM,R10WORK)
*     SVR14NRM=R14;                 /* SAVE RETURN ADDRESS           */
         ST    R14,SVR14NRM(,R9PARM)                            02S0260
*     RFY                                                       02S0261
*      (R8FRRAD,                                                02S0261
*       R14) UNRSTD;                                            02S0261
*     GEN;                                                      02S0262
     TM KEYCMWP,X'01'    TEST FOR SUPER STATE
     BNZ COMUEXIT        IF NOT BRANCH OUT OF THIS ROUTINE
*                                                               02S0263
*     /***************************************************************/
*     /*                                                             */
*     /* BUILD THE RNIO RECORD                                       */
*     /*                                                             */
*     /***************************************************************/
*                                                               02S0263
*     RFY                                                       02S0263
*       LCCAPTR RSTD;                                           02S0263
*     LCCAPTR=PSALCCAV;                                         02S0264
         L     LCCAPTR,PSALCCAV                                 02S0264
*     R10WORK=RNIOASID;             /* GET ASID AND TEST FOR ERROR
*                                      ACCESSING LCCA                */
         L     @08,REG2LCCA(,LCCAPTR)                           02S0265
         LH    R10WORK,RNIOASID(,@08)                           02S0265
         N     R10WORK,@CF02696                                 02S0265
*     MCATRL5=FRRA;                 /* SET AUDIT TRAIL               */
         MVI   MCATRL5(AWSAPTR),X'20'                           02S0266
*     RFY                                                       02S0267
*       ASCBPTR RSTD;                                           02S0267
*                                                               02S0267
*     /***************************************************************/
*     /*                                                             */
*     /* PICK UP ASCB ADDRESS                                        */
*     /*                                                             */
*     /***************************************************************/
*                                                               02S0268
*     ASCBPTR=ASVTENTY(R10WORK);                                02S0268
         LR    @08,R10WORK                                      02S0268
         SLA   @08,2                                            02S0268
         L     @15,CVTPTR                                       02S0268
         L     @15,ASVTPTR(,@15)                                02S0268
         L     ASCBPTR,ASVTENTY-4(@08,@15)                      02S0268
*     RFY                                                       02S0269
*       R10WORK UNRSTD;                                         02S0269
*                                                               02S0269
*     /***************************************************************/
*     /*                                                             */
*     /* CK ASCB ADDR TO SEE IF IT IS GTFS AND IF IT IS CK TO SEE IF */
*     /* WE ARE TRACING GTF RELATED HOOKS                            */
*     /*                                                             */
*     /***************************************************************/
*                                                               02S0270
*     IF ASCBPTR=GTFASCB THEN       /* CHECK FOR GTF RELATED EVENT   */
         C     ASCBPTR,GTFASCB(,PCTPTR)                         02S0270
         BNE   @RF00270                                         02S0270
*       IF OPTTRC=OFF THEN          /* CHECK TO SEE IF TRACING GTF   */
         TM    OPTTRC(PCTPTR),B'00001000'                       02S0271
         BZ    @RT00271                                         02S0271
*         GO TO COMUEXIT;                                       02S0272
*     RNIOASCB=ASCBPTR;                                         02S0273
*                                                               02S0273
@RF00270 ST    ASCBPTR,RNIOASCB(,AWSAPTR)                       02S0273
*     /***************************************************************/
*     /*                                                             */
*     /* PICK UP THE JOBNAME                                         */
*     /*                                                             */
*     /***************************************************************/
*                                                               02S0274
*     MCATRL5=FRRJ;                 /* SET AUDIT TRAIL               */
         MVI   MCATRL5(AWSAPTR),X'10'                           02S0274
*     RFY                                                       02S0275
*       R10WORK RSTD;                                           02S0275
*     R10WORK=ASCBJBNI;                                         02S0276
         L     R10WORK,ASCBJBNI(,ASCBPTR)                       02S0276
*     IF R10WORK=0 THEN             /* CHECK FOR NO ADDRESS          */
         SLR   @08,@08                                          02S0277
         CR    R10WORK,@08                                      02S0277
         BNE   @RF00277                                         02S0277
*       DO;                                                     02S0278
*         R10WORK=ASCBJBNS;         /* GET SECOND POINTER            */
         L     R10WORK,ASCBJBNS(,ASCBPTR)                       02S0279
*         IF R10WORK=0 THEN         /* CHECK FOR GOOD ADDRESS        */
         CR    R10WORK,@08                                      02S0280
         BE    @RT00280                                         02S0280
*           GO TO RNOJBNM;          /* GO TO SET N/A                 */
*       END;                                                    02S0282
*     IF JBNMTEST^=0 THEN           /* CHECK FOR VALID JOBNAME       */
@RF00277 L     @08,JBNMTEST(,R10WORK)                           02S0283
         LTR   @08,@08                                          02S0283
         BZ    @RF00283                                         02S0283
*       RNIOJBNM=JOBNAME;           /* GOOD, SO GET IT               */
         MVC   RNIOJBNM(8,AWSAPTR),JOBNAME(R10WORK)             02S0284
*     ELSE                                                      02S0285
*RNOJBNM:                                                       02S0285
*       RNIOJBNM=NOTAPP;            /* IT IS NO GOOD SO SET TO N/A   */
         B     @RC00283                                         02S0285
@RF00283 DS    0H                                               02S0285
RNOJBNM  MVC   RNIOJBNM(8,AWSAPTR),@CC02504                     02S0285
*     RFY                                                       02S0286
*      (ASCBPTR,                                                02S0286
*       R10WORK) UNRSTD;                                        02S0286
@RC00283 DS    0H                                               02S0287
*AHLRBTU:                                                       02S0287
*     MCATRL5=FRRB;                                             02S0287
AHLRBTU  MVI   MCATRL5(AWSAPTR),X'08'                           02S0287
*     RNIOR0=REG0LCCA;              /* GATHER BTU LENGTH     @Z40KI3O*/
         L     @10,REG0LCCA(,LCCAPTR)                           02S0288
         STCM  @10,15,RNIOR0(AWSAPTR)                           02S0288
*     RNIOBTU=BTU;                  /* GET BTU               @Z40KI3O*/
         L     @08,REG1LCCA(,LCCAPTR)                           02S0289
         MVC   RNIOBTU(20,AWSAPTR),BTU(@08)                     02S0289
*     IF REG0LCCA>=20 THEN          /* CHECK LENGTH COUNT    @Z40KI3O*/
         CL    @10,@CF02497                                     02S0290
         BNL   @RT00290                                         02S0290
*       GO TO AHLHALT;              /* DCF GE TEN, THEN EXIT @Y30AI3O*/
*     ELSE                          /* LESS THAN TEN         @Y30AI3O*/
*       RFY                                                     02S0292
*        (R10WORK,                                              02S0292
*         R6WORK) RSTD;             /*                       @Y30AI3O*/
*     DO R10WORK=REG0LCCA TO 19 BY 1;/* LOOP THRU BTU FIELD  @Z40KI3O*/
         L     @08,REG0LCCA(,LCCAPTR)                           02S0293
         LR    R10WORK,@08                                      02S0293
         B     @DE00293                                         02S0293
@DL00293 DS    0H                                               02S0294
*       R6WORK=R10WORK+ADDR(RNIOBTU);/* PICK UP ADDR         @Z40KI3O*/
         LA    R6WORK,RNIOBTU(,AWSAPTR)                         02S0294
         ALR   R6WORK,R10WORK                                   02S0294
*       GEN;                                                    02S0295
*                                                          /*@Y30AI3O*/
             MVI   0(R6WORK),X'40'  /* BLANKOUT EXTRA BYTES  @Y30AI3O*/
*     END;                          /*                       @Y30AI3O*/
         AL    R10WORK,@CF00060                                 02S0296
@DE00293 C     R10WORK,@CF02603                                 02S0296
         BNH   @DL00293                                         02S0296
*     RFY                                                       02S0297
*      (R10WORK,                                                02S0297
*       R6WORK) UNRSTD;             /* RELEASE WORK REGS     @Y30AI3O*/
*AHLHALT:                                                       02S0298
*     RFY                                                       02S0298
*       LCCAPTR UNRSTD;             /*                       @Y30AI3O*/
AHLHALT  DS    0H                                               02S0299
*                                                               02S0299
*     /***************************************************************/
*     /*                                                             */
*     /* BRANCH TO THE EXIT ROUTINE AND STACK THE RNIO RECORD        */
*     /*                                                             */
*     /***************************************************************/
*                                                               02S0299
*AHLRSTAK:                                                      02S0299
*     MCATRL5=UNRECOV;              /* INDICATE CATAS ERROR AREA     */
AHLRSTAK MVI   MCATRL5(AWSAPTR),X'00'                           02S0299
*     RNIOCPID=PSACPUSA;            /* GET CPUID             @YMO3489*/
         LH    @08,PSACPUSA                                     02S0300
         STH   @08,RNIOCPID(,AWSAPTR)                           02S0300
*     RFY                                                       02S0301
*       R10WORK RSTD;                                           02S0301
*     R10WORK=LENGTH(RNIOREC);      /* PUT LENGTH OF REOCRD IN REG 10*/
         LA    R10WORK,38                                       02S0302
*     GO TO COMEXIT;                /* BRANCH TO COMMON EXIT ROUTINE */
         B     COMEXIT                                          02S0303
*   END;                                                        02S0304
*   DO;                                                         02S0305
*COMEXIT:                                                       02S0306
*     DO;                           /* AHLSTACK DLENGTH(R10WORK)AID(A
*                                      IDC)FID(FIDC)                 */
*                                                               02S0306
COMEXIT  DS    0H                                               02S0307
*       /*************************************************************/
*       /*                                                           */
*       /* THE FOLLOWING CODE IS GENERATED BY THE AHLSTACK MACRO.    */
*       /* THIS CODE BUILDS THE GTF RECORD PREFIX AND THEN CALLS     */
*       /* AHLSBLOK TO STACK THE RECORD.                             */
*       /*                                                           */
*       /*************************************************************/
*                                                               02S0307
*       DCL                                                     02S0307
*         1 AHLGREC INT BASED(AHLRECPR) BDY(WORD),/* MAPPING FOR
*                                      RECORD PREFIX                 */
*          2 AHLGLGTH PTR(16),      /* LENGTH OF RECORD PLUS PREFIX  */
*          2 AHLGRES PTR(16),       /* FOR COMPATIBILITY TO QSAM     */
*          2 AHLGAID PTR(8),        /* APPLICATION ID                */
*          2 AHLGFID PTR(8),        /* FORMAT APPENDAGE ID           */
*          2 AHLGTST CHAR(8),       /* TIMESTAMP IF SPECIFIED        */
*           3 AHLGEIDS PTR(16) BDY(BYTE),/* RECORD EVENT IDENTIFIER
*                                      IF NO TIMESTAMP               */
*          2 AHLGEIDL PTR(16);      /* RECORD EVENT IDENTIFIER WITH
*                                      TIMESTAMP                     */
*       DCL                                                     02S0308
*         AHLRECPR PTR(31) REG(1),  /* USED AS POINTER TO RECORD
*                                      PREFIX AREA                   */
*         AHLSBREG PTR(31) REG(14), /* USED TO HOLD A STABLE COPY OF
*                                      THE SBLOKRTN FIELD IN THE
*                                      GTFPCT                        */
*         AHLRETCD PTR(31) REG(15); /* USED TO PASS RETURN CODE TO
*                                      INVOKER                       */
*       DCL                                                     02S0309
*         AHLSBLOK ENTRY OPTIONS(NOEXIT,SEQFLOW,REFS(MCAWSA),SETS(
*             AHLRETCD),NOFLOWS) BASED(AHLSBREG) VALRG(0);/* ENTRY
*                                      FOR AHLSBLOK                  */
*       RFY                                                     02S0310
*        (AHLRECPR,                                             02S0310
*         AHLSBREG,                                             02S0310
*         AHLRETCD) RSTD;                                       02S0310
*       IF OPTTIME='1'B THEN        /* CHECK FOR TIMESTAMP REQUESTED */
         TM    OPTTIME(PCTPTR),B'00000001'                      02S0311
         BNO   @RF00311                                         02S0311
*         DO;                       /* YES, TIMESTAMP                */
*           AHLRECPR=ADDR(MCARECPR);/* SETUP ADDRESSIBILITY TO PREFIX
*                                      FOR PREFIX WITH TIMESTAMP     */
         LA    AHLRECPR,MCARECPR(,AWSAPTR)                      02S0313
*           AHLGLGTH=R10WORK+16;    /* SET LENGTH TO INCLUDE ***
*                                      DLENGTH *** PLUS TIMESTAMP
*                                      PREFIX                        */
         LA    @11,16                                           02S0314
         ALR   @11,R10WORK                                      02S0314
         STH   @11,AHLGLGTH(,AHLRECPR)                          02S0314
*           GEN                                                 02S0315
*(STCK AHLGTST(AHLRECPR) PUT TOD CLOCK VALUE INTO PREFIX )      02S0315
*           SETS(AHLGTST) NOEXIT SEQFLOW NOFLOWS;               02S0315
         STCK AHLGTST(AHLRECPR) PUT TOD CLOCK VALUE INTO PREFIX
*           AHLGEIDL=MCAMCR->MCREID;/* *** EID *** NOT SPECIFIED PUT
*                                      DEFAULT INTO PREFIX           */
         L     @11,MCAMCR(,AWSAPTR)                             02S0316
         LH    @11,MCREID(,@11)                                 02S0316
         N     @11,@CF02696                                     02S0316
         STH   @11,AHLGEIDL(,AHLRECPR)                          02S0316
*         END;                                                  02S0317
*       ELSE                        /* NO TIMESTAMP TO BE DONE, BUILD
*                                      SHORT PREFIX                  */
*         DO;                                                   02S0318
         B     @RC00311                                         02S0318
@RF00311 DS    0H                                               02S0319
*           AHLRECPR=ADDR(MCARECPR)+8;/* SETUP ADDRESSIBILITY TO FOR
*                                      SHORT PREFIX WITHOUT TIMESTAMP*/
         LA    @11,8                                            02S0319
         LA    AHLRECPR,MCARECPR(,AWSAPTR)                      02S0319
         ALR   AHLRECPR,@11                                     02S0319
*           AHLGLGTH=R10WORK+8;     /* PUT TOTAL RECORD LENGTH INTO
*                                      PREFIX *** DLENGTH *** PLUS
*                                      PREFIX LENGTH                 */
         ALR   @11,R10WORK                                      02S0320
         STH   @11,AHLGLGTH(,AHLRECPR)                          02S0320
*           AHLGEIDS=MCAMCR->MCREID;/* *** EID *** NOT SPECIFIED PUT
*                                      DEFAULT INTO PREFIX           */
         L     @11,MCAMCR(,AWSAPTR)                             02S0321
         LH    @11,MCREID(,@11)                                 02S0321
         N     @11,@CF02696                                     02S0321
         STH   @11,AHLGEIDS(,AHLRECPR)                          02S0321
*         END;                                                  02S0322
*       AHLGRES=0;                  /* ZERO OUT FOR QSAM        02S0323
*                                      COMPATIBILITY                 */
@RC00311 SLR   @11,@11                                          02S0323
         STH   @11,AHLGRES(,AHLRECPR)                           02S0323
*       AHLGAID=AIDC;               /* PUT *** AID *** INTO PREFIX   */
         MVI   AHLGAID(AHLRECPR),X'FF'                          02S0324
*       AHLGFID=FIDC;               /* PUT *** FID *** INTO PREFIX   */
         MVI   AHLGFID(AHLRECPR),X'04'                          02S0325
*       AHLRETCD=4;                 /* SET DEFAULT RETURN CODE       */
         LA    AHLRETCD,4                                       02S0326
*       AHLSBREG=SBLOKRTN;          /* GET A STABLE COPY OF AHLSBLOK
*                                      ADDR                          */
         L     AHLSBREG,SBLOKRTN(,PCTPTR)                       02S0327
*       IF AHLSBREG^=0 THEN         /* CHECK TO SEE IF AHLSBLOK IS
*                                      AVAILABLE                     */
         CR    AHLSBREG,@11                                     02S0328
         BE    @RF00328                                         02S0328
*         CALL AHLSBLOK;            /* YES, SO CALL AHLSBLOK TO BLOCK
*                                      RECORD                        */
         LR    @15,AHLSBREG                                     02S0329
         BALR  @14,@15                                          02S0329
*       RFY                                                     02S0330
*        (AHLRECPR,                                             02S0330
*         AHLSBREG,                                             02S0330
*         AHLRETCD) UNRSTD;                                     02S0330
@RF00328 DS    0H                                               02S0331
*     END;                                                      02S0331
*                                                               02S0332
*     /***************************************************************/
*     /*                                                             */
*     /* THE RECORD IS STACKED SO RESET MCATRAIL, RESTORE REG 14,    */
*     /* DELETE THE FRR AND RETURN                                   */
*     /*                                                             */
*     /***************************************************************/
*                                                               02S0332
*     RFY                                                       02S0332
*      (R10WORK,                                                02S0332
*       R14) RSTD;                                              02S0332
*COMUEXIT:                                                      02S0333
*     R14=SVR14NRM;                 /* RESTORE REG 14 TO ORIGINAL
*                                      RETURN ADDRESS                */
COMUEXIT L     R14,SVR14NRM(,R9PARM)                            02S0333
*     GEN SETS(R9PARM,R10WORK) NOEXIT SEQFLOW NOFLOWS;          02S0334
       SETFRR D,WRKREGS=(R9PARM,R10WORK)
*     GEN SETS(R14) EXIT(BR R14 RETURN TO CALLER);              02S0335
         BR R14 RETURN TO CALLER
*     RFY                                                       02S0336
*      (R10WORK,                                                02S0336
*       R14) UNRSTD;                                            02S0336
*   END;                                                        02S0337
*AHLTFORE:                                                      01S0338
*   GEN SETS(R12BASE) NOEXIT NOFLOWS SEQFLOW;                   01S0338
AHLTFORE DS    0H                                               01S0338
         USING AHLTFORE,R15ENTRY  SETUP TEMP BASE
         L R12BASE,TFORBASE       GET BASE ADDRESS UPON ENTRY
         USING AHLTFOR,R12BASE    TELL ASSEMBLER ABOUT OUR BASE
         DROP R15ENTRY            TELL ASSEM TO QUIT USING R15
*   DO;                                                         02S0339
*                                                               02S0339
*     /***************************************************************/
*     /*                                                             */
*     /* THIS IS THE FRR FOR AHLTFORE. IF AN ERROR OCCURRS DURING THE*/
*     /* EXECUTION OF THE MODULE THIS ROUTINE GAINS CONTROL CERTAIN  */
*     /* ERROR CONDITIONS ARE CHECKED AND APPRORIATE ACTION IS TAKEN */
*     /* DEPENDING ON THE ERROR                                      */
*     /*                                                             */
*     /***************************************************************/
*                                                               02S0340
*     ;                                                         02S0340
*                                                               02S0340
*     /***************************************************************/
*     /*                                                             */
*     /* GET THE FRR PARAMETER FIELD FROM THE SDWA, SAVE REG 14 FOR  */
*     /* RETURN TO RTM, RE-ESTABLISH ADDRESSIBILITY TO THE           */
*     /* MCAWSA,SAVE THE MCATRAIL BITS AT THE TIME OF ERROR, TURN ON */
*     /* THE ERROR BIT, AND RE-ESTABLISH ADDRESSIBILITY TO THE GTFPCT*/
*     /* AND THE MCQE                                                */
*     /*                                                             */
*     /***************************************************************/
*                                                               02S0341
*     RFY                                                       02S0341
*       MCRWSA BASED(WSACGTF);                                  02S0341
*     RFY                                                       02S0342
*      (LCCAPTR,                                                02S0342
*       R14) RSTD;                                              02S0342
*     R9PARM=SDWAPARM;              /* PICK UP ADDRESS OF FRR PARM
*                                      FIELD                         */
         L     R9PARM,SDWAPARM(,SDWAPTR)                        02S0343
*     SVR14FRR=R14;                 /* SAVE RETURN ADDRESS TO RTM    */
         ST    R14,SVR14FRR(,R9PARM)                            02S0344
*     LCCAPTR=PSALCCAV;             /* PICK UP POINTER TO THE LCCA
*                                      FROM THE PSA                  */
         L     LCCAPTR,PSALCCAV                                 02S0345
*     AWSAPTR=MCRMCA;               /* GET ADDRESS OF MCAWSA AT ERROR
*                                      FROM MCRWSA                   */
         L     @15,LCCACPUS(,LCCAPTR)                           02S0346
         L     @15,WSACGTF(,@15)                                02S0346
         L     AWSAPTR,MCRMCA(,@15)                             02S0346
*     RFY                                                       02S0347
*      (LCCAPTR,                                                02S0347
*       R14) UNRSTD;                                            02S0347
*     RFY                                                       02S0348
*       MCRWSA BASED(MCAMCR);                                   02S0348
*     TRAILSAV=MCATRAIL;            /* SAVE TRAIL BITS FOR C&S LOGIC
*                                      LATER                         */
         MVC   TRAILSAV(4,R9PARM),MCATRAIL(AWSAPTR)             02S0349
*     MCAERROR=ON;                  /* INDICATE ERROR ROUTINE IN
*                                      CONTROL                       */
         OI    MCAERROR(AWSAPTR),B'00000100'                    02S0350
*     R0=MCRREG0;                   /* GET ADDR OF MCQE AT TIME OF
*                                      ERROR FROM MCRWSA             */
         L     @08,MCAMCR(,AWSAPTR)                             02S0351
         L     R0,MCRREG0(,@08)                                 02S0351
*     PCTPTR=MCQEAT;                /* GET ADDR OF PCT AT TIME OF
*                                      ERROR FROM SDWA               */
         LR    @08,R0                                           02S0352
         L     PCTPTR,MCQEAT(,@08)                              02S0352
*                                                               02S0353
*     /***************************************************************/
*     /*                                                             */
*     /* DETERMINE WHAT THE ERROR WAS                                */
*     /*                                                             */
*     /***************************************************************/
*                                                               02S0353
*     ;                                                         02S0353
*                                                               02S0353
*     /***************************************************************/
*     /*                                                             */
*     /* THE FIRST CHECK IS FOR A MACHINE CHECK. IF THE ERROR IS A   */
*     /* MACHINE CHECK THEN WE NEED TO DETERMINE IF IT IS A          */
*     /* RECOVERABLE ERROR BY CHECKING FOR AN INSTRUCTION FAILURE AND*/
*     /* TO SEE IF THE REGISTERS AND PSW ARE VALID. IF THESE         */
*     /* CONDITIONS EXIST THEN WE WILL RETRY TO THE ADDRESS IN THE   */
*     /* PSW AT ERROR THAT IS CONTAINED AT SDWAEC1 IN THE RTCS.      */
*     /* OTHERWISE WE WILL DISABLE THE ROUTINE AND RETURN TO AHLMCIH */
*     /*                                                             */
*     /***************************************************************/
*                                                               02S0354
*     IF SDWAMCHK=ON THEN           /* CHECK FOR MACHINE CHECK ERROR */
         TM    SDWAMCHK(SDWAPTR),B'10000000'                    02S0354
         BNO   @RF00354                                         02S0354
*       DO;                                                     02S0355
*         IF SDWAINSF=ON&SDWAREGU=OFF&SDWAPSWU=OFF THEN/* CHECK FOR
*                                      RETRY CONDITIONS              */
         TM    SDWAINSF(SDWAPTR),B'00000100'                    02S0356
         BNO   @RF00356                                         02S0356
         TM    SDWAREGU(SDWAPTR),B'01100000'                    02S0356
         BNZ   @RF00356                                         02S0356
*           DO;                                                 02S0357
*             DO;                   /* SETRP                    02S0358
*                                      RETADDR(ACRADDR)RC(SDWARETY)  */
*               RESPECIFY                                       02S0359
*                (GPR00P,                                       02S0359
*                 GPR01P,                                       02S0359
*                 GPR14P,                                       02S0359
*                 GPR15P) RSTD;                                 02S0359
*               GPR01P->SDWARCDE=SDWARETY;/* STORE RC INTO SDWA      */
         MVI   SDWARCDE(GPR01P),X'04'                           02S0360
*               GPR01P->SDWARTYA=ADDR(ACRADDR);/* SAVE RETRY ADDRESS */
         L     @08,SDWANXT1(,SDWAPTR)                           02S0361
         ST    @08,SDWARTYA(,GPR01P)                            02S0361
*               RESPECIFY                                       02S0362
*                (GPR00P,                                       02S0362
*                 GPR01P,                                       02S0362
*                 GPR14P,                                       02S0362
*                 GPR15P) UNRSTD;                               02S0362
*             END;                                              02S0363
*             MCAERROR=OFF;         /* RESET ERROR ROUTINE IN CONTROL
*                                      INDICATOR                     */
         NI    MCAERROR(AWSAPTR),B'11111011'                    02S0364
*           END;                                                02S0365
*         ELSE                                                  02S0366
*           DO;                                                 02S0366
         B     @RC00356                                         02S0366
@RF00356 DS    0H                                               02S0367
*             DO;                   /* SETRP RC(SDWACWT)             */
*               RESPECIFY                                       02S0368
*                (GPR00P,                                       02S0368
*                 GPR01P,                                       02S0368
*                 GPR14P,                                       02S0368
*                 GPR15P) RSTD;                                 02S0368
*               GPR01P->SDWARCDE=SDWACWT;/* SAVE RC VALUE            */
         MVI   SDWARCDE(GPR01P),X'00'                           02S0369
*               RESPECIFY                                       02S0370
*                (GPR00P,                                       02S0370
*                 GPR01P,                                       02S0370
*                 GPR14P,                                       02S0370
*                 GPR15P) UNRSTD;                               02S0370
*             END;                                              02S0371
*           END;                                                02S0372
*       END;                                                    02S0373
*     ELSE                          /* IT IS NOT MACH CHECK ERROR SO
*                                      CHECK THE REST                */
*                                                               02S0374
*       /*************************************************************/
*       /*                                                           */
*       /* CHECK TO SEE IF THE ROUTINE WAS PERCOLATED TO             */
*       /*                                                           */
*       /*************************************************************/
*                                                               02S0374
*       IF SDWAPERC=ON THEN         /* CHECK TO SEE IF WE WERE  02S0374
*                                      PERCOLATED TO                 */
         B     @RC00354                                         02S0374
@RF00354 TM    SDWAPERC(SDWAPTR),B'00010000'                    02S0374
         BNO   @RF00374                                         02S0374
*         DO;                                                   02S0375
*           DO;                     /* SETRP RC(SDWACWT)             */
*             RESPECIFY                                         02S0377
*              (GPR00P,                                         02S0377
*               GPR01P,                                         02S0377
*               GPR14P,                                         02S0377
*               GPR15P) RSTD;                                   02S0377
*             GPR01P->SDWARCDE=SDWACWT;/* SAVE RC VALUE              */
         MVI   SDWARCDE(GPR01P),X'00'                           02S0378
*             RESPECIFY                                         02S0379
*              (GPR00P,                                         02S0379
*               GPR01P,                                         02S0379
*               GPR14P,                                         02S0379
*               GPR15P) UNRSTD;                                 02S0379
*           END;                                                02S0380
*           IF SDWAEAS=OFF THEN     /* CHECK TO SEE IF THE PREVIOUS
*                                      EXIT TOOK A DUMP      @YM01897*/
         TM    SDWAEAS(SDWAPTR),B'00001000'                     02S0381
         BNZ   @RF00381                                         02S0381
*             DO;                   /* NO SO TAKE ONE                */
*               R0=ADDR(DMPLIST);   /* LOAD PLIST FOR DUMP MODULE    */
         LA    R0,DMPLIST                                       02S0383
*               CALL AHLDMPMD;      /* CALL THE DUMPING ROUTINE      */
         L     @15,PCTDMPMD(,PCTPTR)                            02S0384
         BALR  @14,@15                                          02S0384
*             END;                                              02S0385
*         END;                                                  02S0386
*       ELSE                                                    02S0387
*                                                               02S0387
*         /***********************************************************/
*         /*                                                         */
*         /* CHECK FOR DEBUG MODE ON OR OFF AND TO SEE IF WE WERE    */
*         /* ENTERED ONLY FOR CLEANUP                                */
*         /*                                                         */
*         /***********************************************************/
*                                                               02S0387
*         IF GTFDEBUG=ON×SDWACLUP=ON THEN/* CHECK TO SEE IF USER WANT
*                                      TERMINATION AND DUMP OR IF WE
*                                      WERE ENTERED ONLY FOR CLEANUP */
         B     @RC00374                                         02S0387
@RF00374 TM    GTFDEBUG(PCTPTR),B'01000000'                     02S0387
         BO    @RT00387                                         02S0387
         TM    SDWACLUP(SDWAPTR),B'10000000'                    02S0387
         BNO   @RF00387                                         02S0387
@RT00387 DS    0H                                               02S0388
*           DO;                                                 02S0388
*             CALL DMPMOD;          /* CALL TO DO SDUMP              */
         BAL   @14,DMPMOD                                       02S0389
*             DO;                   /* SETRP RC(SDWACWT)             */
*               RESPECIFY                                       02S0391
*                (GPR00P,                                       02S0391
*                 GPR01P,                                       02S0391
*                 GPR14P,                                       02S0391
*                 GPR15P) RSTD;                                 02S0391
*               GPR01P->SDWARCDE=SDWACWT;/* SAVE RC VALUE            */
         MVI   SDWARCDE(GPR01P),X'00'                           02S0392
*               RESPECIFY                                       02S0393
*                (GPR00P,                                       02S0393
*                 GPR01P,                                       02S0393
*                 GPR14P,                                       02S0393
*                 GPR15P) UNRSTD;                               02S0393
*             END;                                              02S0394
*           END;                                                02S0395
*         ELSE                      /* NOT DEBUG MODE SO CHECK MORE  */
*                                                               02S0396
*           /*********************************************************/
*           /*                                                       */
*           /* CHECK FOR AN UNRECOVERABLE ERROR                      */
*           /*                                                       */
*           /*********************************************************/
*                                                               02S0396
*           IF MCATRL3=UNRECOV&MCATRL5=UNRECOV THEN             02S0396
         B     @RC00387                                         02S0396
@RF00387 CLI   MCATRL3(AWSAPTR),0                               02S0396
         BNE   @RF00396                                         02S0396
         CLI   MCATRL5(AWSAPTR),0                               02S0396
         BNE   @RF00396                                         02S0396
*UNRECERR:                          /* CHECK FOR UNRECOVERABLE ERROR */
*             CALL CATERR;          /* GET CATAS ERROR ROUTINE       */
UNRECERR BAL   @14,CATERR                                       02S0397
*           ELSE                    /* CHECK FOR RECURSION ERROR     */
*                                                               02S0398
*             /*******************************************************/
*             /*                                                     */
*             /* CHECK FOR TOO MANY ENTRIES INTO THE FRR             */
*             /*                                                     */
*             /*******************************************************/
*                                                               02S0398
*             DO;                                               02S0398
         B     @RC00396                                         02S0398
@RF00396 DS    0H                                               02S0399
*               RECURCTR=RECURCTR+1;/* UPDATE RECURSION COUNT        */
         LA    @08,1                                            02S0399
         LH    @04,RECURCTR(,R9PARM)                            02S0399
         N     @04,@CF02696                                     02S0399
         ALR   @08,@04                                          02S0399
         STH   @08,RECURCTR(,R9PARM)                            02S0399
*               IF RECURCTR>=RECURLMT THEN/* CHECK FOR TOO MANY 02S0400
*                                      RECURSIONS                    */
         C     @08,@CF01055                                     02S0400
         BL    @RF00400                                         02S0400
*                 CALL CATERR;      /* GET CATAS ERROR ROUTINE       */
         BAL   @14,CATERR                                       02S0401
*               ELSE                /* RECOVERABLE ERROR SO PROCESS
*                                      IT AS SUCH                    */
*                 DO;                                           03S0402
         B     @RC00400                                         03S0402
@RF00400 DS    0H                                               03S0403
*                   RFY                                         03S0403
*                     R14 RSTD;                                 03S0403
*                                                               03S0403
*                   /*************************************************/
*                   /*                                               */
*                   /* THE FOLLOWING ROUTINES GET CONTROL WHEN       */
*                   /* RECOVERABLE ERRORS OCCUR IN THE SECTIONS OF   */
*                   /* CODE TO WHICH THEY RELATE. THE ROUTINES PUT   */
*                   /* ASTERISKS INTO THE FIELDS WHICH WERE BEING    */
*                   /* GATHERED WHEN THE ERROR OCCURED. THE COMMENTS */
*                   /* CONTAIN THE FIELDS BEING GATHERED WHEN THE    */
*                   /* ERROR OCCURRED. AFTER THE FIELDS ARE FILLED   */
*                   /* THE RETRY ADDRESS IS SET TO THE SECTION OF    */
*                   /* CODE THAT GATHERS THE NEXT FIELD AND A RETURN */
*                   /* IS MADE                                       */
*                   /*                                               */
*                   /*************************************************/
*                                                               03S0404
*                   IF MCASRM=ON THEN/* CHECK FOR SRM GATHERING      */
         TM    MCASRM(AWSAPTR),B'01000000'                      03S0404
         BNO   @RF00404                                         03S0404
*                     DO;                                       03S0405
*                       IF MCATRL3=FRSA THEN/* CHECK FOR ASCB   03S0406
*                                      GATHERING                     */
         CLI   MCATRL3(AWSAPTR),8                               03S0406
         BNE   @RF00406                                         03S0406
*                         SRMASCB=ERRIND;/* SRM ASCB ADDRESS         */
         MVC   SRMASCB(4,AWSAPTR),@CC02508                      03S0407
*                       ELSE        /* NOT ASCB                      */
*                         IF MCATRL3^=FRSJ THEN/* IF NOT JOBNAME THEN
*                                      IS ERROR                      */
         B     @RC00406                                         03S0408
@RF00406 CLI   MCATRL3(AWSAPTR),4                               03S0408
         BNE   @RT00408                                         03S0408
*                           GO TO UNRECERR;                     03S0409
*                       SRMJBNM=ERRIND;/* SRM JOBNAME                */
@RC00406 MVC   SRMJBNM(8,AWSAPTR),@CC02508                      03S0410
*                       DO;         /* SETRP                    03S0411
*                                      RETADDR(AHLSSTAK)RC(SDWARETY) */
*                         RESPECIFY                             03S0412
*                          (GPR00P,                             03S0412
*                           GPR01P,                             03S0412
*                           GPR14P,                             03S0412
*                           GPR15P) RSTD;                       03S0412
*                         GPR01P->SDWARCDE=SDWARETY;/* STORE RC INTO
*                                      SDWA                          */
         MVI   SDWARCDE(GPR01P),X'04'                           03S0413
*                         GPR01P->SDWARTYA=ADDR(AHLSSTAK);/* SAVE
*                                      RETRY ADDRESS                 */
         LA    @08,AHLSSTAK                                     03S0414
         ST    @08,SDWARTYA(,GPR01P)                            03S0414
*                         RESPECIFY                             03S0415
*                          (GPR00P,                             03S0415
*                           GPR01P,                             03S0415
*                           GPR14P,                             03S0415
*                           GPR15P) UNRSTD;                     03S0415
*                       END;                                    03S0416
*                       MCAERROR=OFF;                           03S0417
         NI    MCAERROR(AWSAPTR),B'11111011'                    03S0417
*                       R14=SVR14FRR;/* RESTORE RTM RETURN ADDRESS   */
         L     R14,SVR14FRR(,R9PARM)                            03S0418
*                       GEN SETS(R14) EXIT(BR R14 RETURN TO CALLER);
         BR R14 RETURN TO CALLER
*                     END;                                      03S0420
*                   ELSE            /* NOT SRM SO CHECK FARTHER      */
*                     IF MCAFRR=ON THEN/* CHECK FOR FRR GATHERING    */
         B     @RC00404                                         03S0421
@RF00404 TM    MCAFRR(AWSAPTR),B'00100000'                      03S0421
         BNO   @RF00421                                         03S0421
*                       IF MCATRL3=FRFRT THEN/* CHECK FOR RTCA       */
         CLI   MCATRL3(AWSAPTR),1                               03S0422
         BNE   @RF00422                                         03S0422
*                         DO;                                   03S0423
*                           FRRSDWA=ERRIND;/* ANY OF THE FIELDS IN
*                                      SDWA ON FRR                   */
         MVC   FRRSDWA(32,AWSAPTR),@CC02508                     03S0424
*                           DO;     /* SETRP                    03S0425
*                                      RETADDR(AHLFSTAK)RC(SDWARETY) */
*                             RESPECIFY                         03S0426
*                              (GPR00P,                         03S0426
*                               GPR01P,                         03S0426
*                               GPR14P,                         03S0426
*                               GPR15P) RSTD;                   03S0426
*                             GPR01P->SDWARCDE=SDWARETY;/* STORE RC
*                                      INTO SDWA                     */
         MVI   SDWARCDE(GPR01P),X'04'                           03S0427
*                             GPR01P->SDWARTYA=ADDR(AHLFSTAK);/* SAVE
*                                      RETRY ADDRESS                 */
         LA    @08,AHLFSTAK                                     03S0428
         ST    @08,SDWARTYA(,GPR01P)                            03S0428
*                             RESPECIFY                         03S0429
*                              (GPR00P,                         03S0429
*                               GPR01P,                         03S0429
*                               GPR14P,                         03S0429
*                               GPR15P) UNRSTD;                 03S0429
*                           END;                                03S0430
*                           MCAERROR=OFF;                       03S0431
         NI    MCAERROR(AWSAPTR),B'11111011'                    03S0431
*                           R14=SVR14FRR;/* RESTORE RTM RETURN  03S0432
*                                      ADDRESS                       */
         L     R14,SVR14FRR(,R9PARM)                            03S0432
*                           GEN SETS(R14) EXIT(BR R14 RETURN TO CALLER)
*                               ;                               03S0433
         BR R14 RETURN TO CALLER
*                         END;                                  03S0434
*                       ELSE                                    03S0435
*                         DO;                                   03S0435
         B     @RC00422                                         03S0435
@RF00422 DS    0H                                               03S0436
*                           IF MCATRL3=FRFA THEN/* CHECK FOR ASCB    */
         CLI   MCATRL3(AWSAPTR),2                               03S0436
         BNE   @RF00436                                         03S0436
*                             FRRASCB=ERRIND;/* ASCB FIELD IN ERROR  */
         MVC   FRRASCB(4,AWSAPTR),@CC02508                      03S0437
*                           ELSE                                03S0438
*                             IF MCATRL3^=FRFJ THEN/* CK FOR JOBNAME
*                                      IN ERROR                      */
         B     @RC00436                                         03S0438
@RF00436 CLI   MCATRL3(AWSAPTR),2                               03S0438
         BNE   @RT00438                                         03S0438
*                               GO TO UNRECERR;                 03S0439
*                           FRRJBNM=ERRIND;/* FILL IN THE JOBNAME
*                                      WITH ASTERISKS                */
@RC00436 MVC   FRRJBNM(8,AWSAPTR),@CC02508                      03S0440
*                           DO;     /* SETRP                    03S0441
*                                      RETADDR(AHLFNAME)RC(SDWARETY) */
*                             RESPECIFY                         03S0442
*                              (GPR00P,                         03S0442
*                               GPR01P,                         03S0442
*                               GPR14P,                         03S0442
*                               GPR15P) RSTD;                   03S0442
*                             GPR01P->SDWARCDE=SDWARETY;/* STORE RC
*                                      INTO SDWA                     */
         MVI   SDWARCDE(GPR01P),X'04'                           03S0443
*                             GPR01P->SDWARTYA=ADDR(AHLFNAME);/* SAVE
*                                      RETRY ADDRESS                 */
         LA    @08,AHLFNAME                                     03S0444
         ST    @08,SDWARTYA(,GPR01P)                            03S0444
*                             RESPECIFY                         03S0445
*                              (GPR00P,                         03S0445
*                               GPR01P,                         03S0445
*                               GPR14P,                         03S0445
*                               GPR15P) UNRSTD;                 03S0445
*                           END;                                03S0446
*                           MCAERROR=OFF;                       03S0447
         NI    MCAERROR(AWSAPTR),B'11111011'                    03S0447
*                           R14=SVR14FRR;/* RESTORE RTM RETURN  03S0448
*                                      ADDRESS                       */
         L     R14,SVR14FRR(,R9PARM)                            03S0448
*                           GEN SETS(R14) EXIT(BR R14 RETURN TO CALLER)
*                               ;                               03S0449
         BR R14 RETURN TO CALLER
*                         END;                                  03S0450
*                     ELSE          /* NOT FRR SO CHECK STAE         */
*                       IF MCASTA=ON THEN/* CHECK FOR STAE           */
         B     @RC00421                                         03S0451
@RF00421 TM    MCASTA(AWSAPTR),B'00010000'                      03S0451
         BNO   @RF00451                                         03S0451
*                         IF MCATRL5=FREPC THEN/* CK FOR PSW AND CC  */
         CLI   MCATRL5(AWSAPTR),128                             03S0452
         BNE   @RF00452                                         03S0452
*                           DO;                                 03S0453
*                             STAPC=ERRIND;/* PSW OR COMPLETION CODE
*                                      ON STAE                       */
         MVC   STAPC(12,AWSAPTR),@CC02508                       03S0454
*                             DO;   /* SETRP                    03S0455
*                                      RETADDR(AHLNSTAK)RC(SDWARETY) */
*                               RESPECIFY                       03S0456
*                                (GPR00P,                       03S0456
*                                 GPR01P,                       03S0456
*                                 GPR14P,                       03S0456
*                                 GPR15P) RSTD;                 03S0456
*                               GPR01P->SDWARCDE=SDWARETY;/* STORE RC
*                                      INTO SDWA                     */
         MVI   SDWARCDE(GPR01P),X'04'                           03S0457
*                               GPR01P->SDWARTYA=ADDR(AHLNSTAK);/*
*                                      SAVE RETRY ADDRESS            */
         LA    @08,AHLNSTAK                                     03S0458
         ST    @08,SDWARTYA(,GPR01P)                            03S0458
*                               RESPECIFY                       03S0459
*                                (GPR00P,                       03S0459
*                                 GPR01P,                       03S0459
*                                 GPR14P,                       03S0459
*                                 GPR15P) UNRSTD;               03S0459
*                             END;                              03S0460
*                             MCAERROR=OFF;                     03S0461
         NI    MCAERROR(AWSAPTR),B'11111011'                    03S0461
*                             R14=SVR14FRR;/* RESTORE RTM RETURN
*                                      ADDRESS                       */
         L     R14,SVR14FRR(,R9PARM)                            03S0462
*                             GEN SETS(R14) EXIT                03S0463
*                                 (BR R14 RETURN TO CALLER);    03S0463
         BR R14 RETURN TO CALLER
*                           END;                                03S0464
*                         ELSE                                  03S0465
*                           IF MCATRL5=FRERT THEN/* CK FOR RTCA      */
         B     @RC00452                                         03S0465
@RF00452 CLI   MCATRL5(AWSAPTR),64                              03S0465
         BNE   @RF00465                                         03S0465
*                             DO;                               03S0466
*                               STASDWA(1:32)=ERRIND;/* ANY OF THE
*                                      FIELDS IN SDWA ON ESTAE       */
         MVC   STASDWA(32,AWSAPTR),@CC02508                     03S0467
*                               DO; /* SETRP                    03S0468
*                                      RETADDR(AHLESTAK)RC(SDWARETY) */
*                                 RESPECIFY                     03S0469
*                                  (GPR00P,                     03S0469
*                                   GPR01P,                     03S0469
*                                   GPR14P,                     03S0469
*                                   GPR15P) RSTD;               03S0469
*                                 GPR01P->SDWARCDE=SDWARETY;/* STORE
*                                      RC INTO SDWA                  */
         MVI   SDWARCDE(GPR01P),X'04'                           03S0470
*                                 GPR01P->SDWARTYA=ADDR(AHLESTAK);/*
*                                      SAVE RETRY ADDRESS            */
         LA    @08,AHLESTAK                                     03S0471
         ST    @08,SDWARTYA(,GPR01P)                            03S0471
*                                 RESPECIFY                     03S0472
*                                  (GPR00P,                     03S0472
*                                   GPR01P,                     03S0472
*                                   GPR14P,                     03S0472
*                                   GPR15P) UNRSTD;             03S0472
*                               END;                            03S0473
*                               MCAERROR=OFF;                   03S0474
         NI    MCAERROR(AWSAPTR),B'11111011'                    03S0474
*                               R14=SVR14FRR;/* RESTORE RTM RETURN
*                                      ADDRESS                       */
         L     R14,SVR14FRR(,R9PARM)                            03S0475
*                               GEN SETS(R14) EXIT              03S0476
*                                   (BR R14 RETURN TO CALLER);  03S0476
         BR R14 RETURN TO CALLER
*                             END;                              03S0477
*                           ELSE                                03S0478
*                             IF MCATRL5=FREJ THEN/* CK FOR ERROR IN
*                                      JOBNAME                       */
         B     @RC00465                                         03S0478
@RF00465 CLI   MCATRL5(AWSAPTR),1                               03S0478
         BNE   @RF00478                                         03S0478
*                               DO;                             03S0479
*                                 STAJBNM=ERRIND;/* PUT IN ERROR
*                                      INDICATOR                     */
         MVC   STAJBNM(8,AWSAPTR),@CC02508                      03S0480
*                                 DO;/* SETRP                   03S0481
*                                      RETADDR(AHLECPID)RC(SDWARETY) */
*                                   RESPECIFY                   03S0482
*                                    (GPR00P,                   03S0482
*                                     GPR01P,                   03S0482
*                                     GPR14P,                   03S0482
*                                     GPR15P) RSTD;             03S0482
*                                   GPR01P->SDWARCDE=SDWARETY;/*
*                                      STORE RC INTO SDWA            */
         MVI   SDWARCDE(GPR01P),X'04'                           03S0483
*                                   GPR01P->SDWARTYA=ADDR(AHLECPID);
         LA    @08,AHLECPID                                     03S0484
         ST    @08,SDWARTYA(,GPR01P)                            03S0484
*                                   /* SAVE RETRY ADDRESS            */
*                                   RESPECIFY                   03S0485
*                                    (GPR00P,                   03S0485
*                                     GPR01P,                   03S0485
*                                     GPR14P,                   03S0485
*                                     GPR15P) UNRSTD;           03S0485
*                                 END;                          03S0486
*                                 MCAERROR=OFF;                 03S0487
         NI    MCAERROR(AWSAPTR),B'11111011'                    03S0487
*                                 R14=SVR14FRR;/* RESTORE RTM RETURN
*                                      ADDRESS                       */
         L     R14,SVR14FRR(,R9PARM)                            03S0488
*                                 GEN SETS(R14) EXIT            03S0489
*                                     (BR R14 RETURN TO CALLER);
         BR R14 RETURN TO CALLER
*                               END;                            03S0490
*                             ELSE                              03S0491
*                               GO TO UNRECERR;                 03S0491
*                       ELSE        /* NOT STAE SO TRY RNIO          */
*                         IF MCARNIO=ON THEN                    03S0492
         B     @RC00451                                         03S0492
@RF00451 TM    MCARNIO(AWSAPTR),B'10000000'                     03S0492
         BNO   @RF00492                                         03S0492
*                           IF MCATRL5=FRRB THEN/* CK FOR BTU        */
         CLI   MCATRL5(AWSAPTR),8                               03S0493
         BNE   @RF00493                                         03S0493
*                             DO;                               03S0494
*                               RNIOBTU=ERRIND;/* RNIO BTU FIELD     */
         MVC   RNIOBTU(20,AWSAPTR),@CC02508                     03S0495
*                               DO; /* SETRP                    03S0496
*                                      RETADDR(AHLRSTAK)RC(SDWARETY) */
*                                 RESPECIFY                     03S0497
*                                  (GPR00P,                     03S0497
*                                   GPR01P,                     03S0497
*                                   GPR14P,                     03S0497
*                                   GPR15P) RSTD;               03S0497
*                                 GPR01P->SDWARCDE=SDWARETY;/* STORE
*                                      RC INTO SDWA                  */
         MVI   SDWARCDE(GPR01P),X'04'                           03S0498
*                                 GPR01P->SDWARTYA=ADDR(AHLRSTAK);/*
*                                      SAVE RETRY ADDRESS            */
         LA    @08,AHLRSTAK                                     03S0499
         ST    @08,SDWARTYA(,GPR01P)                            03S0499
*                                 RESPECIFY                     03S0500
*                                  (GPR00P,                     03S0500
*                                   GPR01P,                     03S0500
*                                   GPR14P,                     03S0500
*                                   GPR15P) UNRSTD;             03S0500
*                               END;                            03S0501
*                               MCAERROR=OFF;                   03S0502
         NI    MCAERROR(AWSAPTR),B'11111011'                    03S0502
*                               R14=SVR14FRR;/* RESTORE RTM RETURN
*                                      ADDRESS                       */
         L     R14,SVR14FRR(,R9PARM)                            03S0503
*                               GEN SETS(R14) EXIT              03S0504
*                                   (BR R14 RETURN TO CALLER);  03S0504
         BR R14 RETURN TO CALLER
*                             END;                              03S0505
*                           ELSE                                03S0506
*                             DO;                               03S0506
         B     @RC00493                                         03S0506
@RF00493 DS    0H                                               03S0507
*                               IF MCATRL5=FRRA THEN            03S0507
         CLI   MCATRL5(AWSAPTR),32                              03S0507
         BNE   @RF00507                                         03S0507
*                                 RNIOASCB=ERRIND;/* RNIO ASCB  03S0508
*                                      ADDRESS                       */
         MVC   RNIOASCB(4,AWSAPTR),@CC02508                     03S0508
*                               ELSE                            03S0509
*                                 IF MCATRL5^=FRRJ THEN         03S0509
         B     @RC00507                                         03S0509
@RF00507 CLI   MCATRL5(AWSAPTR),16                              03S0509
         BNE   @RT00509                                         03S0509
*                                   GO TO UNRECERR;             03S0510
*                               RNIOJBNM=ERRIND;/* RNIO JOBNAME      */
@RC00507 MVC   RNIOJBNM(8,AWSAPTR),@CC02508                     03S0511
*                               DO; /* SETRP                    03S0512
*                                      RETADDR(AHLRBTU)RC(SDWARETY)  */
*                                 RESPECIFY                     03S0513
*                                  (GPR00P,                     03S0513
*                                   GPR01P,                     03S0513
*                                   GPR14P,                     03S0513
*                                   GPR15P) RSTD;               03S0513
*                                 GPR01P->SDWARCDE=SDWARETY;/* STORE
*                                      RC INTO SDWA                  */
         MVI   SDWARCDE(GPR01P),X'04'                           03S0514
*                                 GPR01P->SDWARTYA=ADDR(AHLRBTU);/*
*                                      SAVE RETRY ADDRESS            */
         LA    @08,AHLRBTU                                      03S0515
         ST    @08,SDWARTYA(,GPR01P)                            03S0515
*                                 RESPECIFY                     03S0516
*                                  (GPR00P,                     03S0516
*                                   GPR01P,                     03S0516
*                                   GPR14P,                     03S0516
*                                   GPR15P) UNRSTD;             03S0516
*                               END;                            03S0517
*                               MCAERROR=OFF;                   03S0518
         NI    MCAERROR(AWSAPTR),B'11111011'                    03S0518
*                               R14=SVR14FRR;/* RESTORE RTM RETURN
*                                      ADDRESS                       */
         L     R14,SVR14FRR(,R9PARM)                            03S0519
*                               GEN SETS(R14) EXIT              03S0520
*                                   (BR R14 RETURN TO CALLER);  03S0520
         BR R14 RETURN TO CALLER
*                             END;                              03S0521
*                         ELSE                                  03S0522
*                           GO TO UNRECERR;                     03S0522
*                   RFY                                         03S0523
*                     R14 UNRSTD;                               03S0523
@RC00492 DS    0H                                               03S0523
@RC00451 DS    0H                                               03S0523
@RC00421 DS    0H                                               03S0523
@RC00404 DS    0H                                               03S0524
*                 END;                                          03S0524
*             END;                                              02S0525
@RC00400 DS    0H                                               02S0526
*     RFY                                                       02S0526
*       R14 RSTD;                                               02S0526
@RC00396 DS    0H                                               02S0526
@RC00387 DS    0H                                               02S0526
@RC00374 DS    0H                                               02S0526
@RC00354 DS    0H                                               02S0527
*     R14=SVR14FRR;                 /* RESTORE RTM RETURN ADDRESS    */
         L     R14,SVR14FRR(,R9PARM)                            02S0527
*     GEN SETS(R14) EXIT(BR R14 RETURN TO CALLER);              02S0528
         BR R14 RETURN TO CALLER
*     RFY                                                       02S0529
*       R14 UNRSTD;                                             02S0529
*   END;                                                        02S0530
*DMPMOD:                                                        02S0531
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                            02S0531
*                                                               02S0531
DMPMOD   DS    0H                                               02S0532
*   /*****************************************************************/
*   /*                                                               */
*   /* THIS ROUTINE IS CALLED WHEN THE AHLTFOR FRR ROUTINE IS GOING  */
*   /* TO TERMINATE TRACING ON THE ENTIRE MODULE OR ON ONE EVENT.    */
*   /* THIS ROUTINE ISSUES AND SDUMP TO DUMP THE SDWA, MCRWSA AND    */
*   /* MCAWSA PLUS THE MODULE ITSELF AND THEN ISSUES A TERMINATION   */
*   /* MESSAGE FOR THE EVENT BEING TERMINATED OR FOR THE EVENT       */
*   /* CAUSING THE ENTIRE MODULE TO BE TERMINATED (DEBUG = YES).     */
*   /*                                                               */
*   /*****************************************************************/
*                                                               02S0532
*   RETSAV2=R14;                    /* SAVE RETURN ADDRESS           */
         ST    R14,RETSAV2(,AWSAPTR)                            02S0532
*   MCQESAV=R0;                     /* SAVE MCQE POINTER SINCE SDUMP
*                                      WILL DESTROY IT               */
         ST    R0,MCQESAV(,AWSAPTR)                             02S0533
*   SDWASAV=SDWAPTR;                /* SAVE THE SDWA POINTER SINCE
*                                      REG 1 IS USED FOR THE WTO
*                                      PLIST                         */
         ST    SDWAPTR,SDWASAV(,AWSAPTR)                        02S0534
*   LSTADR=ADDR(@ENDDATA);          /* LOAD IN THE ENDING ADDRESS    */
         LA    @08,@ENDDATA                                     02S0535
         STCM  @08,7,LSTADR                                     02S0535
*   R0=ADDR(DMPLIST);               /* LOAD PLIST FOR DUMP MODULE    */
         LA    R0,DMPLIST                                       02S0536
*   CALL AHLDMPMD;                  /* CALL THE DUMPING ROUTINE      */
         L     @15,PCTDMPMD(,PCTPTR)                            02S0537
         BALR  @14,@15                                          02S0537
*   WTOPARM=WTOCONS;                /* MOVE THE CONSTANTS INTO THE
*                                      WTO PLIST                     */
         MVC   WTOPARM(16,AWSAPTR),@CC02430                     02S0538
*   WTODIND=R15RC;                  /* MOVE IN THE SDUMP INDICATOR
*                                      RETRUNDE BY AHLDMPMD          */
         STH   R15RC,WTODIND(,AWSAPTR)                          02S0539
*   IF MCREID=IRASRM THEN           /* DETERMINE WHICH HOOK SO WE CAN
*                                      MOVE IN THE APPROPRIATE  02S0540
*                                      ROUTINE NAME                  */
         L     @08,MCAMCR(,AWSAPTR)                             02S0540
         CLC   MCREID(2,@08),@CH02166                           02S0540
         BNE   @RF00540                                         02S0540
*     WTONAME=SRMNM;                                            02S0541
         MVC   WTONAME(4,AWSAPTR),@CC02437                      02S0541
*   ELSE                                                        02S0542
*     IF MCREID=ISPTPIO1×MCREID=ISPTPIO2 THEN/* CHECK FOR RNIO       */
         B     @RC00540                                         02S0542
@RF00540 L     @08,MCAMCR(,AWSAPTR)                             02S0542
         CLC   MCREID(2,@08),@CH02153                           02S0542
         BE    @RT00542                                         02S0542
         CLC   MCREID(2,@08),@CH02155                           02S0542
         BNE   @RF00542                                         02S0542
@RT00542 DS    0H                                               02S0543
*       WTONAME=RNIONM;                                         02S0543
         MVC   WTONAME(4,AWSAPTR),@CC02433                      02S0543
*     ELSE                                                      02S0544
*       WTONAME=FRRNM;              /* BY DEFAULT IT IS AN FRR HOOK  */
         B     @RC00542                                         02S0544
@RF00542 MVC   WTONAME(4,AWSAPTR),@CC02435                      02S0544
*   PARMPTR=ADDR(WTOPARM);          /* LOAD PLIST POINTER INTO  02S0545
*                                      REGISTER                      */
@RC00542 DS    0H                                               02S0545
@RC00540 LA    PARMPTR,WTOPARM(,AWSAPTR)                        02S0545
*   CALL AHLWTOMD;                                              02S0546
         L     @15,PCTWTOMD(,PCTPTR)                            02S0546
         BALR  @14,@15                                          02S0546
*   R0=MCQESAV;                     /* RESTORE MCQE ADDRESS          */
         L     R0,MCQESAV(,AWSAPTR)                             02S0547
*   SDWAPTR=SDWASAV;                /* RESTORE SDWA POINTER          */
         L     SDWAPTR,SDWASAV(,AWSAPTR)                        02S0548
*   R14=RETSAV2;                    /* RESTORE RETURN ADDRESS        */
         L     R14,RETSAV2(,AWSAPTR)                            02S0549
*   GEN EXIT(BR R14 RETURN TO CALLER);                          02S0550
         BR R14 RETURN TO CALLER
*   RFY                                                         02S0551
*     R14 UNRSTD;                                               02S0551
*   END DMPMOD;                                                 02S0552
@EL00002 DS    0H                                               02S0552
@EF00002 DS    0H                                               02S0552
@ER00002 BR    @14                                              02S0552
*CATERR:                                                        02S0553
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                            02S0553
CATERR   DS    0H                                               02S0554
*   RFY                                                         02S0554
*     R14 RSTD;                                                 02S0554
*                                                               02S0554
*   /*****************************************************************/
*   /*                                                               */
*   /* IF AN UNRECOVERABLE ERROR IS ENCOUNTERED AND DEBUG = NO THIS  */
*   /* ROUTINE WILL BE CALLED TO STACK THE ERROR RECORD, TURN OFF THE*/
*   /* ACTICE FUNCTION BIT FOR THE EVENT BEING TRACED, ISSUE THE     */
*   /* SETEVENT MACRO TO DISABLE TRACING ON THE EVENT(S) BEING TRACED*/
*   /* WHEN THE ERROR OCCURRED, CALL THE DUMPING ROUTINE AND THEN    */
*   /* ISSUE THE CODE THAT WILL RETURN TO MCIH WITHOUT TERMINATING   */
*   /* ALL OF GTF. IF FRR OR E/STAE WAS BEING TRACED, TRACING MUST BE*/
*   /* TERMINATED FOR BOTH OF THEM SINCE THEY ARE BOTH STARTED WITH  */
*   /* THE SAME TRACE OPTION KEYWORD.                                */
*   /*                                                               */
*   /*****************************************************************/
*                                                               02S0555
*   RETSAV1=R14;                    /* SAVE RETURN ADDRESS           */
         ST    R14,RETSAV1(,AWSAPTR)                            02S0555
*   RFY                                                         02S0556
*     R14 UNRSTD;                                               02S0556
*   ERRASCB=CATERIND;               /* INDICATE CATAS ERROR IN FIRST
*                                      OF RECORD                     */
         MVC   ERRASCB(2,AWSAPTR),@CB02512                      02S0557
*   SDWASAV=SDWAPTR;                /* SAVE SDWA POINTER SINCE STACK
*                                      AND SETEVENT DESTROY IT       */
         ST    SDWAPTR,SDWASAV(,AWSAPTR)                        02S0558
*   MCQESAV=R0;                     /* SAVE MCQE ADDR SINCE STACK MAY
*                                      DESTROY IT                    */
         ST    R0,MCQESAV(,AWSAPTR)                             02S0559
*   DO;                             /* AHLSTACK DLENGTH(DEFLGTH)AID(A
*                                      IDC)FID(FIDC)                 */
*                                                               02S0560
*     /***************************************************************/
*     /*                                                             */
*     /* THE FOLLOWING CODE IS GENERATED BY THE AHLSTACK MACRO. THIS */
*     /* CODE BUILDS THE GTF RECORD PREFIX AND THEN CALLS AHLSBLOK TO*/
*     /* STACK THE RECORD.                                           */
*     /*                                                             */
*     /***************************************************************/
*                                                               02S0561
*     RFY                                                       02S0561
*      (AHLRECPR,                                               02S0561
*       AHLSBREG,                                               02S0561
*       AHLRETCD) RSTD;                                         02S0561
*     IF OPTTIME='1'B THEN          /* CHECK FOR TIMESTAMP REQUESTED */
         TM    OPTTIME(PCTPTR),B'00000001'                      02S0562
         BNO   @RF00562                                         02S0562
*       DO;                         /* YES, TIMESTAMP                */
*         AHLRECPR=ADDR(MCARECPR);  /* SETUP ADDRESSIBILITY TO PREFIX
*                                      FOR PREFIX WITH TIMESTAMP     */
         LA    AHLRECPR,MCARECPR(,AWSAPTR)                      02S0564
*         AHLGLGTH=DEFLGTH+16;      /* SET LENGTH TO INCLUDE ***
*                                      DLENGTH *** PLUS TIMESTAMP
*                                      PREFIX                        */
         MVC   AHLGLGTH(2,AHLRECPR),@CH02693                    02S0565
*         GEN(STCK AHLGTST(AHLRECPR) PUT TOD CLOCK VALUE INTO PREFIX )
*         SETS(AHLGTST) NOEXIT SEQFLOW NOFLOWS;                 02S0566
         STCK AHLGTST(AHLRECPR) PUT TOD CLOCK VALUE INTO PREFIX
*         AHLGEIDL=MCAMCR->MCREID;  /* *** EID *** NOT SPECIFIED PUT
*                                      DEFAULT INTO PREFIX           */
         L     @08,MCAMCR(,AWSAPTR)                             02S0567
         LH    @08,MCREID(,@08)                                 02S0567
         N     @08,@CF02696                                     02S0567
         STH   @08,AHLGEIDL(,AHLRECPR)                          02S0567
*       END;                                                    02S0568
*     ELSE                          /* NO TIMESTAMP TO BE DONE, BUILD
*                                      SHORT PREFIX                  */
*       DO;                                                     02S0569
         B     @RC00562                                         02S0569
@RF00562 DS    0H                                               02S0570
*         AHLRECPR=ADDR(MCARECPR)+8;/* SETUP ADDRESSIBILITY TO FOR
*                                      SHORT PREFIX WITHOUT TIMESTAMP*/
         LA    AHLRECPR,MCARECPR(,AWSAPTR)                      02S0570
         AL    AHLRECPR,@CF00058                                02S0570
*         AHLGLGTH=DEFLGTH+8;       /* PUT TOTAL RECORD LENGTH INTO
*                                      PREFIX *** DLENGTH *** PLUS
*                                      PREFIX LENGTH                 */
         MVC   AHLGLGTH(2,AHLRECPR),@CH02691                    02S0571
*         AHLGEIDS=MCAMCR->MCREID;  /* *** EID *** NOT SPECIFIED PUT
*                                      DEFAULT INTO PREFIX           */
         L     @08,MCAMCR(,AWSAPTR)                             02S0572
         LH    @08,MCREID(,@08)                                 02S0572
         N     @08,@CF02696                                     02S0572
         STH   @08,AHLGEIDS(,AHLRECPR)                          02S0572
*       END;                                                    02S0573
*     AHLGRES=0;                    /* ZERO OUT FOR QSAM        02S0574
*                                      COMPATIBILITY                 */
@RC00562 SLR   @08,@08                                          02S0574
         STH   @08,AHLGRES(,AHLRECPR)                           02S0574
*     AHLGAID=AIDC;                 /* PUT *** AID *** INTO PREFIX   */
         MVI   AHLGAID(AHLRECPR),X'FF'                          02S0575
*     AHLGFID=FIDC;                 /* PUT *** FID *** INTO PREFIX   */
         MVI   AHLGFID(AHLRECPR),X'04'                          02S0576
*     AHLRETCD=4;                   /* SET DEFAULT RETURN CODE       */
         LA    AHLRETCD,4                                       02S0577
*     AHLSBREG=SBLOKRTN;            /* GET A STABLE COPY OF AHLSBLOK
*                                      ADDR                          */
         L     AHLSBREG,SBLOKRTN(,PCTPTR)                       02S0578
*     IF AHLSBREG^=0 THEN           /* CHECK TO SEE IF AHLSBLOK IS
*                                      AVAILABLE                     */
         CR    AHLSBREG,@08                                     02S0579
         BE    @RF00579                                         02S0579
*       CALL AHLSBLOK;              /* YES, SO CALL AHLSBLOK TO BLOCK
*                                      RECORD                        */
         LR    @15,AHLSBREG                                     02S0580
         BALR  @14,@15                                          02S0580
*     RFY                                                       02S0581
*      (AHLRECPR,                                               02S0581
*       AHLSBREG,                                               02S0581
*       AHLRETCD) UNRSTD;                                       02S0581
@RF00579 DS    0H                                               02S0582
*   END;                                                        02S0582
*   R0=MCQESAV;                     /* RESTORE MCQE ADDRESS          */
         L     R0,MCQESAV(,AWSAPTR)                             02S0583
*   SDWAPTR=SDWASAV;                /* REST PTR SINCE DMPMOD WILL
*                                      SAVE IT                       */
         L     SDWAPTR,SDWASAV(,AWSAPTR)                        02S0584
*   RFY                                                         02S0585
*    (R10WORK,                                                  02S0585
*     R8FRRWRK) RSTD;                                           02S0585
*                                                               02S0585
*   /*****************************************************************/
*   /*                                                               */
*   /* DETERMINE WHICH FUNCTION(S) IS ACTIVE AND TURN OFF ITS        */
*   /* CORRESPONDING BIT(S) IN THE GTFCATF FIELD                     */
*   /*                                                               */
*   /*****************************************************************/
*                                                               02S0586
*   IF MCREID=STAEID THEN           /* CHECK TO SEE IF STAE GATHER
*                                      ROUTINE                       */
         L     @11,MCAMCR(,AWSAPTR)                             02S0586
         CLC   MCREID(2,@11),STAEID                             02S0586
         BNE   @RF00586                                         02S0586
*     TRAILSAV=RROFFBIT;            /* SET TO SAME BIT AS FRR FOR C&S
*                                      LOGIC                         */
         MVC   TRAILSAV(4,R9PARM),@CB02522                      02S0587
*CKBIT:                                                         02S0588
*   R8FRRWRK=TRAILSAV;              /* GET TRAIL BIT THAT INDICATES
*                                      GATHER ROUTINE THAT IS IN
*                                      CONTROL                       */
@RF00586 DS    0H                                               02S0588
CKBIT    L     R8FRRWRK,TRAILSAV(,R9PARM)                       02S0588
*   R10WORK=PCTCATF;                /* GET BITS FOR CURRENT TRACT
*                                      FUNCTIONS                     */
         L     R10WORK,PCTCATF(,PCTPTR)                         02S0589
*   IF(R10WORK&R8FRRWRK)^=0 THEN    /* CHECK TO SEE IF GATHER   02S0590
*                                      FUNCTIONS CURRENT BIT IS STILL
*                                      ON                            */
         LR    @11,R10WORK                                      02S0590
         NR    @11,R8FRRWRK                                     02S0590
         LTR   @11,@11                                          02S0590
         BZ    @RF00590                                         02S0590
*     DO;                           /* YES                           */
*       R8FRRWRK=R8FRRWRK&&R10WORK; /* TURN OFF CURRENT TO PREPARE
*                                      FOR C&S                       */
         XR    R8FRRWRK,R10WORK                                 02S0592
*       CS(R10WORK,R8FRRWRK,PCTCATF);/* CHECK FOR SAME STATUS        */
         CS    R10WORK,@08,PCTCATF(PCTPTR)                      02S0593
*       BC(4,CKBIT);                /* IF CHANGED START ALL OVER
*                                      AGAIN                         */
         BC    4,CKBIT                                          02S0594
*       CALL DMPMOD;                /* CALL TO GET SDUMP             */
         BAL   @14,DMPMOD                                       02S0595
*       RFY                                                     02S0596
*        (R10WORK,                                              02S0596
*         R8FRRWRK) UNRSTD;                                     02S0596
*                                                               02S0596
*       /*************************************************************/
*       /*                                                           */
*       /* DISABLE THE EVENTS BEING TRACED WHEN THE ERROR OCCURRED   */
*       /*                                                           */
*       /*************************************************************/
*                                                               02S0597
*       IF(MCREID=STAEID)×(MCREID=FRREID) THEN/* CHECK EID           */
         L     @08,MCAMCR(,AWSAPTR)                             02S0597
         CLC   MCREID(2,@08),STAEID                             02S0597
         BE    @RT00597                                         02S0597
         CLC   MCREID(2,@08),FRREID                             02S0597
         BNE   @RF00597                                         02S0597
@RT00597 DS    0H                                               02S0598
*         DO;                                                   02S0598
*           DO;                     /* SETEVENT NAME('GTF')MCQE(MCQE)
*                                      ACTION(DISABLE)EIDAD(FRREIDS)E
*                                      IDNO(2)                       */
*                                                               02S0599
*             /*******************************************************/
*             /*                                                     */
*             /* THE FOLLOWING SECTION OF CODE IS GENERATED BY THE   */
*             /* SETEVENT MACRO. THIS CODE WILL BE EITHER AN         */
*             /* INITIALIZED PARAMETER LIST, OR IF IT IS THE RESULT  */
*             /* OF STANDARD OR EXECUTE FORM IT WILL FILL in the     */
*             /* list, GENERATE ALL LINKAGES AND CALL THE PROPER     */
*             /* sERVICE, EITHER AHLSETEV OR AHLSETD                 */
*             /*                                                     */
*             /*******************************************************/
*                                                               02S0600
*             DCL                                               02S0600
*               AHLPPTR REG(1) PTR(31) RSTD;/* PARAMETER LIST ADDRESS*/
*             DCL                                               02S0601
*               AHLSETEV ENTRY OPTIONS(EXIT,SEQFLOW) BASED(MCHSETE)
*                   VALRG(0);       /* ENTRY FOR ADD ACTIVAT,FREE    */
*             DCL                                               02S0602
*               AHLSETD ENTRY OPTIONS(EXIT,SEQFLOW) BASED(MCHSETD)
*                   VALRG(0);       /* ENTRY FOR DISABLE AND CHANGE  */
*             DCL                                               02S0603
*               1 SEPL BASED(AHLPPTR) BDY(WORD),/* DSECT PARAMETER
*                                      LIST                          */
*                2 SEFG PTR(8),     /* ACTION GLAGS                  */
*                2 * PTR(8),                                    02S0603
*                2 SEEN PTR(8),     /* EID COUNT                     */
*                2 SECN PTR(8),     /* CLASS COUNT                   */
*                2 SENM CHAR(8),    /* APPLICATION NMAE              */
*                2 SEEL PTR(31),    /* ADDRESS OF LIST OF EIDS       */
*                2 SECL PTR(31),    /* ADDRESS OF LIST OF CLASSES    */
*                2 SEMC PTR(31);    /* MCQE ADDRESS                  */
*             DCL                                               02S0604
*               1 SEPL0027 STATIC LOCAL BDY(WORD),/* ACTUAL PLIST FOR
*                                      STANDARD INVOCATION           */
*                2 SEFG0027 PTR(8),                             02S0604
*                2 * PTR(8),                                    02S0604
*                2 SEEN0027 PTR(8),                             02S0604
*                2 SECN0027 PTR(8),                             02S0604
*                2 SENM0027 CHAR(8),                            02S0604
*                2 SEEL0027 PTR(31),                            02S0604
*                2 SECL0027 PTR(31),                            02S0604
*                2 SEMC0027 PTR(31);                            02S0604
*             AHLPPTR=ADDR(SEPL0027);/* INIT PLIST PTR               */
         LA    AHLPPTR,SEPL0027                                 02S0605
*             SEPL=SEPL&&SEPL;      /* ZERO OUT PLIST                */
         XC    SEPL(24,AHLPPTR),SEPL(AHLPPTR)                   02S0606
*             SEMC=ADDR(MCQE);      /* INIT MCQE PTR                 */
         ST    R0,SEMC(,AHLPPTR)                                02S0607
*             SENM='GTF';           /* MOVE IN NAME                  */
         MVI   SENM+3(AHLPPTR),C' '                             02S0608
         MVC   SENM+4(4,AHLPPTR),SENM+3(AHLPPTR)                02S0608
         MVC   SENM(3,AHLPPTR),@CC02663                         02S0608
*             SEFG=32;              /* MOVE IN FLAGS                 */
         MVI   SEFG(AHLPPTR),X'20'                              02S0609
*             SEEL=ADDR(FRREIDS);   /* SET EID LIST ADDR             */
         LA    @08,FRREIDS                                      02S0610
         ST    @08,SEEL(,AHLPPTR)                               02S0610
*             SEEN=2;               /* SET TO VALUE SPECIFIED        */
         MVI   SEEN(AHLPPTR),X'02'                              02S0611
*             CALL AHLSETD;         /* CALL SERVICE                  */
         L     @08,CVTPTR                                       02S0612
         L     @08,CVTGTFA-1(,@08)                              02S0612
         L     @15,MCHSETD(,@08)                                02S0612
         BALR  @14,@15                                          02S0612
*           END;                                                02S0613
*         END;                                                  02S0614
*       ELSE                                                    02S0615
*         IF(MCREID=REID1)×(MCREID=REID2) THEN/* CHECK EID           */
         B     @RC00597                                         02S0615
@RF00597 L     @08,MCAMCR(,AWSAPTR)                             02S0615
         CLC   MCREID(2,@08),REID1                              02S0615
         BE    @RT00615                                         02S0615
         CLC   MCREID(2,@08),REID2                              02S0615
         BNE   @RF00615                                         02S0615
@RT00615 DS    0H                                               02S0616
*           DO;                                                 02S0616
*             DO;                   /* SETEVENT NAME('GTF')MCQE(MCQE)
*                                      ACTION(DISABLE)EIDAD(RNIOEIDS)
*                                      EIDNO(2)                      */
*                                                               02S0617
*               /*****************************************************/
*               /*                                                   */
*               /* THE FOLLOWING SECTION OF CODE IS GENERATED BY THE */
*               /* SETEVENT MACRO. THIS CODE WILL BE EITHER AN       */
*               /* INITIALIZED PARAMETER LIST, OR IF IT IS THE RESULT*/
*               /* OF STANDARD OR EXECUTE FORM IT WILL FILL in the   */
*               /* list, GENERATE ALL LINKAGES AND CALL THE PROPER   */
*               /* sERVICE, EITHER AHLSETEV OR AHLSETD               */
*               /*                                                   */
*               /*****************************************************/
*                                                               02S0618
*               DCL                                             02S0618
*                 1 SEPL0028 STATIC LOCAL BDY(WORD),/* ACTUAL PLIST
*                                      FOR STANDARD INVOCATION       */
*                  2 SEFG0028 PTR(8),                           02S0618
*                  2 * PTR(8),                                  02S0618
*                  2 SEEN0028 PTR(8),                           02S0618
*                  2 SECN0028 PTR(8),                           02S0618
*                  2 SENM0028 CHAR(8),                          02S0618
*                  2 SEEL0028 PTR(31),                          02S0618
*                  2 SECL0028 PTR(31),                          02S0618
*                  2 SEMC0028 PTR(31);                          02S0618
*               AHLPPTR=ADDR(SEPL0028);/* INIT PLIST PTR             */
         LA    AHLPPTR,SEPL0028                                 02S0619
*               SEPL=SEPL&&SEPL;    /* ZERO OUT PLIST                */
         XC    SEPL(24,AHLPPTR),SEPL(AHLPPTR)                   02S0620
*               SEMC=ADDR(MCQE);    /* INIT MCQE PTR                 */
         ST    R0,SEMC(,AHLPPTR)                                02S0621
*               SENM='GTF';         /* MOVE IN NAME                  */
         MVI   SENM+3(AHLPPTR),C' '                             02S0622
         MVC   SENM+4(4,AHLPPTR),SENM+3(AHLPPTR)                02S0622
         MVC   SENM(3,AHLPPTR),@CC02663                         02S0622
*               SEFG=32;            /* MOVE IN FLAGS                 */
         MVI   SEFG(AHLPPTR),X'20'                              02S0623
*               SEEL=ADDR(RNIOEIDS);/* SET EID LIST ADDR             */
         LA    @08,RNIOEIDS                                     02S0624
         ST    @08,SEEL(,AHLPPTR)                               02S0624
*               SEEN=2;             /* SET TO VALUE SPECIFIED        */
         MVI   SEEN(AHLPPTR),X'02'                              02S0625
*               CALL AHLSETD;       /* CALL SERVICE                  */
         L     @08,CVTPTR                                       02S0626
         L     @08,CVTGTFA-1(,@08)                              02S0626
         L     @15,MCHSETD(,@08)                                02S0626
         BALR  @14,@15                                          02S0626
*             END;                                              02S0627
*           END;                                                02S0628
*         ELSE                                                  02S0629
*           DO;                     /* SETEVENT NAME('GTF')MCQE(MCQE)
*                                      ACTION(DISABLE)EIDAD(MCREID)  */
*                                                               02S0629
         B     @RC00615                                         02S0629
@RF00615 DS    0H                                               02S0630
*             /*******************************************************/
*             /*                                                     */
*             /* THE FOLLOWING SECTION OF CODE IS GENERATED BY THE   */
*             /* SETEVENT MACRO. THIS CODE WILL BE EITHER AN         */
*             /* INITIALIZED PARAMETER LIST, OR IF IT IS THE RESULT  */
*             /* OF STANDARD OR EXECUTE FORM IT WILL FILL in the     */
*             /* list, GENERATE ALL LINKAGES AND CALL THE PROPER     */
*             /* sERVICE, EITHER AHLSETEV OR AHLSETD                 */
*             /*                                                     */
*             /*******************************************************/
*                                                               02S0630
*             DCL                                               02S0630
*               1 SEPL0029 STATIC LOCAL BDY(WORD),/* ACTUAL PLIST FOR
*                                      STANDARD INVOCATION           */
*                2 SEFG0029 PTR(8),                             02S0630
*                2 * PTR(8),                                    02S0630
*                2 SEEN0029 PTR(8),                             02S0630
*                2 SECN0029 PTR(8),                             02S0630
*                2 SENM0029 CHAR(8),                            02S0630
*                2 SEEL0029 PTR(31),                            02S0630
*                2 SECL0029 PTR(31),                            02S0630
*                2 SEMC0029 PTR(31);                            02S0630
*             AHLPPTR=ADDR(SEPL0029);/* INIT PLIST PTR               */
         LA    AHLPPTR,SEPL0029                                 02S0631
*             SEPL=SEPL&&SEPL;      /* ZERO OUT PLIST                */
         XC    SEPL(24,AHLPPTR),SEPL(AHLPPTR)                   02S0632
*             SEMC=ADDR(MCQE);      /* INIT MCQE PTR                 */
         ST    R0,SEMC(,AHLPPTR)                                02S0633
*             SENM='GTF';           /* MOVE IN NAME                  */
         MVI   SENM+3(AHLPPTR),C' '                             02S0634
         MVC   SENM+4(4,AHLPPTR),SENM+3(AHLPPTR)                02S0634
         MVC   SENM(3,AHLPPTR),@CC02663                         02S0634
*             SEFG=32;              /* MOVE IN FLAGS                 */
         MVI   SEFG(AHLPPTR),X'20'                              02S0635
*             SEEL=ADDR(MCREID);    /* SET EID LIST ADDR             */
         L     @08,MCAMCR(,AWSAPTR)                             02S0636
         LA    @08,MCREID(,@08)                                 02S0636
         ST    @08,SEEL(,AHLPPTR)                               02S0636
*             SEEN=1;               /* SET TO DEFAULT                */
         MVI   SEEN(AHLPPTR),X'01'                              02S0637
*             CALL AHLSETD;         /* CALL SERVICE                  */
         L     @08,CVTPTR                                       02S0638
         L     @08,CVTGTFA-1(,@08)                              02S0638
         L     @15,MCHSETD(,@08)                                02S0638
         BALR  @14,@15                                          02S0638
*           END;                                                02S0639
*     END;                                                      02S0640
@RC00615 DS    0H                                               02S0640
@RC00597 DS    0H                                               02S0641
*   SDWAPTR=SDWASAV;                /* RESTORE SDWA POINTER          */
*                                                               02S0641
@RF00590 L     SDWAPTR,SDWASAV(,AWSAPTR)                        02S0641
*   /*****************************************************************/
*   /*                                                               */
*   /* IF ALL FUNCTIONS ARE DISABLED TERMINATE GTF, OTHERWISE RETURN */
*   /* TO MCIH                                                       */
*   /*                                                               */
*   /*****************************************************************/
*                                                               02S0642
*   RFY                                                         02S0642
*     R14 RSTD;                                                 02S0642
*   IF PCTCATF=0 THEN               /* CHECK TO SEE IF ALL FUNCTIONS
*                                      DISABLED                      */
         L     @15,PCTCATF(,PCTPTR)                             02S0643
         LTR   @15,@15                                          02S0643
         BNZ   @RF00643                                         02S0643
*     DO;                                                       02S0644
*       DO;                         /* SETRP RC(SDWACWT)             */
*         RESPECIFY                                             02S0646
*          (GPR00P,                                             02S0646
*           GPR01P,                                             02S0646
*           GPR14P,                                             02S0646
*           GPR15P) RSTD;                                       02S0646
*         GPR01P->SDWARCDE=SDWACWT; /* SAVE RC VALUE                 */
         MVI   SDWARCDE(GPR01P),X'00'                           02S0647
*         RESPECIFY                                             02S0648
*          (GPR00P,                                             02S0648
*           GPR01P,                                             02S0648
*           GPR14P,                                             02S0648
*           GPR15P) UNRSTD;                                     02S0648
*       END;                                                    02S0649
*       R14=SVR14FRR;               /* RESTORE ADDRESS TO RETURN TO
*                                      RTM                           */
         L     R14,SVR14FRR(,R9PARM)                            02S0650
*     END;                                                      02S0651
*   ELSE                            /* STILL SOME FUNCTIONS RUNNING  */
*     DO;                                                       02S0652
         B     @RC00643                                         02S0652
@RF00643 DS    0H                                               02S0653
*       DO;                         /* SETRP                    02S0653
*                                      RETADDR(MCIHRET)RC(SDWARETY)  */
*         RESPECIFY                                             02S0654
*          (GPR00P,                                             02S0654
*           GPR01P,                                             02S0654
*           GPR14P,                                             02S0654
*           GPR15P) RSTD;                                       02S0654
*         GPR01P->SDWARCDE=SDWARETY;/* STORE RC INTO SDWA            */
         MVI   SDWARCDE(GPR01P),X'04'                           02S0655
*         GPR01P->SDWARTYA=ADDR(MCIHRET);/* SAVE RETRY ADDRESS       */
         L     @08,SVR14NRM(,R9PARM)                            02S0656
         ST    @08,SDWARTYA(,GPR01P)                            02S0656
*         RESPECIFY                                             02S0657
*          (GPR00P,                                             02S0657
*           GPR01P,                                             02S0657
*           GPR14P,                                             02S0657
*           GPR15P) UNRSTD;                                     02S0657
*       END;                                                    02S0658
*       RFY                                                     02S0659
*         R10WORK RSTD;                                         02S0659
*       R14=SVR14FRR;               /* RESTORE RET ADDR RO RETURN TO
*                                      RTM                           */
         L     R14,SVR14FRR(,R9PARM)                            02S0660
*       GEN SETS(R9PARM,R10WORK) NOEXIT SEQFLOW NOFLOWS;        02S0661
       SETFRR D,WRKREGS=(R9PARM,R10WORK)
*     END;                                                      02S0662
*   GEN SETS(R14) EXIT(BR R14 RETURN TO CALLER);                02S0663
@RC00643 DS    0H                                               02S0663
         BR R14 RETURN TO CALLER
*   RFY                                                         02S0664
*    (R10WORK,                                                  02S0664
*     R14) UNRSTD;                                              02S0664
*   END;                                                        02S0665
@EL00003 DS    0H                                               02S0665
@EF00003 DS    0H                                               02S0665
@ER00003 BR    @14                                              02S0665
@PB00003 DS    0H                                               02S0665
*   DECLARE                         /* GENERAL PURPOSE REGISTERS     */
*     GPR00P PTR(31) REG(0),                                    01S0666
*     GPR01P PTR(31) REG(1),                                    01S0666
*     GPR14P PTR(31) REG(14),                                   01S0666
*     GPR15P PTR(31) REG(15);                                   01S0666
*   DECLARE                         /* COMMON VARIABLES              */
*     I256C CHAR(256) BASED,                                    01S0667
*     I031F FIXED(31) BASED,                                    01S0667
*     I031P PTR(31) BASED,                                      01S0667
*     I015F FIXED(15) BASED,                                    01S0667
*     I015P PTR(15) BASED,                                      01S0667
*     I008P PTR(8) BASED,                                       01S0667
*     I001C CHAR(1) BASED;                                      01S0667
*AHLTFORN:                                                      01S0668
*   END AHLTFOR                                                 01S0668
*                                                               01S0668
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */
*/*%INCLUDE SYSUT5  (PROLOG  )                                       */
*/*@INCLUDE SYSUT5  (FL1     )                                       */
*/*%INCLUDE SYSUT5  (DECLS   )                                       */
*/*%INCLUDE SYSLIB  (CVT     )                                       */
*/*%INCLUDE SYSLIB  (GTFPCT  )                                       */
*/*%INCLUDE SYSLIB  (IHAASCB )                                       */
*/*%INCLUDE SYSLIB  (IHAASVT )                                       */
*/*%INCLUDE SYSLIB  (IHAFRRS )                                       */
*/*%INCLUDE SYSLIB  (IHALCCA )                                       */
*/*%INCLUDE SYSLIB  (IHAPSA  )                                       */
*/*%INCLUDE SYSLIB  (IHASDWA )                                       */
*/*%INCLUDE SYSLIB  (IHASRB  )                                       */
*/*%INCLUDE SYSLIB  (IHAWSAVT)                                       */
*/*%INCLUDE SYSLIB  (IMDMEDIT)                                       */
*/*%INCLUDE SYSLIB  (MCAWSA  )                                       */
*/*%INCLUDE SYSLIB  (MCHEAD  )                                       */
*/*%INCLUDE SYSLIB  (MCQE    )                                       */
*/*%INCLUDE SYSLIB  (MCRWSA  )                                       */
*/*%INCLUDE SYSUT5  (SRMMOD  )                                       */
*/*%INCLUDE SYSUT5  (FRRMOD  )                                       */
*/*%INCLUDE SYSUT5  (STAMOD  )                                       */
*/*%INCLUDE SYSUT5  (ESTANORM)                                       */
*/*%INCLUDE SYSUT5  (STANORM )                                       */
*/*%INCLUDE SYSUT5  (RNIOMOD )                                       */
*/*%INCLUDE SYSUT5  (EXITMOD )                                       */
*/*%INCLUDE SYSUT5  (FOREMOD )                                       */
*/*%INCLUDE SYSUT5  (RECOVER )                                       */
*/*%INCLUDE SYSUT5  (DMPMOD  )                                       */
*/*%INCLUDE SYSUT5  (CATERR  )                                       */
*                                                               01S0668
*       ;                                                       01S0668
@DATA    DS    0H
@CH02691 DC    H'46'
@CH02693 DC    H'54'
@CH02153 DC    XL2'8100'
@CH02155 DC    XL2'8200'
@CH02166 DC    XL2'4001'
@DATD    DSECT
         DS    0F
AHLTFOR  CSECT
         DS    0F
@CF00060 DC    F'1'
@CF01055 DC    F'6'
@CF00058 DC    F'8'
@CF02603 DC    F'19'
@CF02497 DC    F'20'
@CF02696 DC    XL4'0000FFFF'
@DATD    DSECT
         DS    0D
@ENDDATD EQU   *
AHLTFOR  CSECT
         NOPR  ((@ENDDATD-@DATD)*16)
         DS    0F
@SIZDATD DC    AL1(0)
         DC    AL3(@ENDDATD-@DATD)
         DS    0D
TFORBASE DC    AL4(AHLTFOR)
@CC02508 DC    C'************************************'
@CC02430 DC    C'FOR       TRAC  '
@CC02504 DC    C'N/A     '
@CC02506 DC    C'U/A     '
@CC02433 DC    C'RNIO'
@CC02435 DC    C'RR  '
@CC02437 DC    C'SRM '
@CC02663 DC    C'GTF'
@CB02541 DC    X'0040000000000000'
@CB02544 DC    X'0020000000000000'
@CB02547 DC    X'0080000000000000'
@CB02550 DC    X'0010000000000000'
@CB02522 EQU   @CB02544
@CB02512 DC    X'EEEE'
         DS    CL3
DMPLIST  DS    CL12
         ORG   DMPLIST
HDRAD    DC    AL4(SDMPHDR)
DUMPADDS DS    CL8
         ORG   DUMPADDS
BEGADDR  DC    AL4(AHLTFOR)
ENDADDR  DS    AL4
         ORG   ENDADDR
DLSTEOL  DC    XL1'80'
LSTADR   DC    AL3(@ENDDATA)
         ORG   DMPLIST+12
SDMPHDR  DS    CL27
         ORG   SDMPHDR
HDRLGH   DC    AL1(26)
HDR      DC    CL26'DUMP OF GTF MODULE AHLTSVC'
         ORG   SDMPHDR+27
         DS    CL1
FRREIDS  DS    CL12
         ORG   FRREIDS
FRREID   DC    XL2'4003'
@NM00112 DS    CL4
STAEID   DC    XL2'4002'
@NM00113 DS    CL4
         ORG   FRREIDS+12
RNIOEIDS DS    CL12
         ORG   RNIOEIDS
REID1    DC    XL2'8100'
@NM00114 DS    CL4
REID2    DC    XL2'8200'
@NM00115 DS    CL4
         ORG   RNIOEIDS+12
RECID    DC    CL24'AHLTFOR AHLTFOR AHLTFORE'
SEPL0027 DS    CL24
         ORG   SEPL0027
SEFG0027 DS    AL1
@NM00119 DS    AL1
SEEN0027 DS    AL1
SECN0027 DS    AL1
SENM0027 DS    CL8
SEEL0027 DS    AL4
SECL0027 DS    AL4
SEMC0027 DS    AL4
         ORG   SEPL0027+24
SEPL0028 DS    CL24
         ORG   SEPL0028
SEFG0028 DS    AL1
@NM00120 DS    AL1
SEEN0028 DS    AL1
SECN0028 DS    AL1
SENM0028 DS    CL8
SEEL0028 DS    AL4
SECL0028 DS    AL4
SEMC0028 DS    AL4
         ORG   SEPL0028+24
SEPL0029 DS    CL24
         ORG   SEPL0029
SEFG0029 DS    AL1
@NM00121 DS    AL1
SEEN0029 DS    AL1
SECN0029 DS    AL1
SENM0029 DS    CL8
SEEL0029 DS    AL4
SECL0029 DS    AL4
SEMC0029 DS    AL4
         ORG   SEPL0029+24
AHL4PTCH DC    250X'00'
@00      EQU   00                      EQUATES FOR REGISTERS 0-15
@01      EQU   01
@02      EQU   02
@03      EQU   03
@04      EQU   04
@05      EQU   05
@06      EQU   06
@07      EQU   07
@08      EQU   08
@09      EQU   09
@10      EQU   10
@11      EQU   11
@12      EQU   12
@13      EQU   13
@14      EQU   14
@15      EQU   15
PCTPTR   EQU   @02
ASCBPTR  EQU   @04
LCCAPTR  EQU   @11
SDWAPTR  EQU   @01
AWSAPTR  EQU   @03
R0       EQU   @00
PARMPTR  EQU   @01
SDWATEST EQU   @01
R5RECPTR EQU   @05
R5MOVE   EQU   @05
R6WORK   EQU   @06
R8FRRWRK EQU   @08
R8FRRAD  EQU   @08
R9PARM   EQU   @09
R10WORK  EQU   @10
R12BASE  EQU   @12
FRREADDR EQU   @13
R14      EQU   @14
R15RC    EQU   @15
AHLRECPR EQU   @01
AHLSBREG EQU   @14
AHLRETCD EQU   @15
GPR00P   EQU   @00
GPR01P   EQU   @01
GPR14P   EQU   @14
GPR15P   EQU   @15
AHLPPTR  EQU   @01
R10MOVE  EQU   @10
R11MOVE  EQU   @11
R15ENTRY EQU   @15
R4MOVE   EQU   @04
R7BTU    EQU   @07
R8RNASID EQU   @08
         ENTRY AHL4PTCH
         ENTRY AHLTSRM
         ENTRY AHLTFRR
         ENTRY AHLTSTAE
         ENTRY AHLTRNIO
         ENTRY AHLTFORE
CVTPTR   EQU   16
PSA      EQU   0
FLCRNPSW EQU   PSA
FLCROPSW EQU   PSA+8
FLCICCW2 EQU   PSA+16
FLCPOPSW EQU   PSA+40
PSAEEPSW EQU   PSA+132
PSAESPSW EQU   PSA+136
FLCSVILC EQU   PSAESPSW+1
PSAEPPSW EQU   PSA+140
FLCPIILC EQU   PSAEPPSW+1
FLCPICOD EQU   PSAEPPSW+2
PSAPICOD EQU   FLCPICOD+1
FLCTEA   EQU   PSAEPPSW+4
FLCPER   EQU   PSA+152
FLCMCLA  EQU   PSA+168
FLCCHNID EQU   FLCMCLA
FLCCHTM  EQU   FLCCHNID
FLCIOEL  EQU   FLCMCLA+4
FLCIOA   EQU   FLCMCLA+16
PSAMEDC  EQU   FLCMCLA+76
FLCFSA   EQU   FLCMCLA+80
PSALCCAV EQU   PSA+528
PSAAOLD  EQU   PSA+548
PSASUPER EQU   PSA+552
PSASUP1  EQU   PSASUPER
PSASUP2  EQU   PSASUPER+1
PSASUP3  EQU   PSASUPER+2
PSASUP4  EQU   PSASUPER+3
PSACLHT  EQU   PSA+640
PSAHLHI  EQU   PSA+760
PSACLHS  EQU   PSAHLHI
PSACLHS3 EQU   PSACLHS+2
PSACLHS4 EQU   PSACLHS+3
PSACPUSA EQU   PSA+794
PSADSSFL EQU   PSA+836
PSADSSF1 EQU   PSADSSFL
PSADSSF3 EQU   PSADSSFL+2
PSADSSF4 EQU   PSADSSFL+3
PSARSVT  EQU   PSA+896
PSATRACE EQU   PSA+1018
PSAMODEW EQU   PSA+1180
PSAMODE  EQU   PSAMODEW+3
PSALKSA  EQU   PSA+1280
PSACR0SV EQU   PSA+1420
PSAPCCR0 EQU   PSA+1424
PSARCR0  EQU   PSA+1428
PSAEPTAB EQU   PSA+2816
PSAWTENT EQU   PSA+2896
CVTMAP   EQU   0
CVTDAR   EQU   CVTMAP+72
CVTFLGS1 EQU   CVTDAR
CVTDCB   EQU   CVTMAP+116
CVTIOQET EQU   CVTMAP+120
CVTIERLC EQU   CVTMAP+144
CVTHEAD  EQU   CVTMAP+160
CVTSV76C EQU   CVTHEAD
CVTOPTA  EQU   CVTMAP+182
CVTOPTB  EQU   CVTMAP+183
CVTGTF   EQU   CVTMAP+236
CVTGTFST EQU   CVTGTF
CVTGTFS  EQU   CVTGTFST
CVTSTATE EQU   CVTGTFST
CVTTMODE EQU   CVTGTFST
CVTFORM  EQU   CVTGTFST
CVTGTFA  EQU   CVTGTF+1
CVTAQAVT EQU   CVTMAP+240
CVTTCMFG EQU   CVTAQAVT
CVTVOLM2 EQU   CVTMAP+244
CVTTATA  EQU   CVTVOLM2
CVTTSKS  EQU   CVTTATA
CVTVOLF2 EQU   CVTTSKS
CVTTAT   EQU   CVTTATA+1
CVTATER  EQU   CVTMAP+248
CVTEXT1  EQU   CVTMAP+252
CVTPURG  EQU   CVTMAP+260
CVTQMSG  EQU   CVTMAP+268
CVTDMSR  EQU   CVTMAP+272
CVTRSV37 EQU   CVTDMSR
CVTDMSRF EQU   CVTRSV37
CVTERPV  EQU   CVTMAP+316
CVTINTLA EQU   CVTMAP+320
CVTAPF   EQU   CVTMAP+324
CVTEXT2  EQU   CVTMAP+328
CVTHJES  EQU   CVTMAP+332
CVTPGSIA EQU   CVTMAP+348
CVTA1F1  EQU   CVTMAP+356
CVTSYSK  EQU   CVTMAP+357
CVTVOLM1 EQU   CVTMAP+380
CVTVOLF1 EQU   CVTVOLM1
CVTXTNT1 EQU   0
CVTXTNT2 EQU   0
CVTDSSV  EQU   CVTXTNT2
CVTFLGBT EQU   CVTXTNT2+5
CVTQID   EQU   CVTXTNT2+24
CVTRV400 EQU   CVTXTNT2+52
CVTRV409 EQU   CVTXTNT2+53
CVTATCVT EQU   CVTXTNT2+64
CVTRV429 EQU   CVTXTNT2+84
CVTRV438 EQU   CVTXTNT2+85
CVTRV457 EQU   CVTXTNT2+112
CVTRV466 EQU   CVTXTNT2+113
CVTFIX   EQU   0
CVTRELNO EQU   CVTFIX+252
GTFPCT   EQU   0
GTFSTAT  EQU   GTFPCT+8
GTFDEBUG EQU   GTFSTAT
GTFOPTS  EQU   GTFPCT+12
GTFOPTS1 EQU   GTFOPTS
OPTTRC   EQU   GTFOPTS1
GTFOPTS2 EQU   GTFOPTS+1
GTFOPTS3 EQU   GTFOPTS+2
GTFOPTS4 EQU   GTFOPTS+3
OPTTIME  EQU   GTFOPTS4
PCTCATF  EQU   GTFPCT+16
NEXTBLOK EQU   GTFPCT+180
SBLOKRTN EQU   GTFPCT+188
WRTRCOM  EQU   GTFPCT+204
TRMWRIT  EQU   GTFPCT+212
WRTRERR  EQU   GTFPCT+216
GTFSSRB  EQU   GTFPCT+220
QLOCKWRD EQU   GTFPCT+236
QLOCKECB EQU   GTFPCT+240
AUDITFLG EQU   GTFPCT+296
GTFASCB  EQU   GTFPCT+300
PCTDMPMD EQU   GTFPCT+308
PCTWTOMD EQU   GTFPCT+312
ASCB     EQU   0
ASCBSUPC EQU   ASCB+16
ASCBASID EQU   ASCB+36
ASCBRSM  EQU   ASCB+52
ASCBRSMF EQU   ASCBRSM
ASCBFW1  EQU   ASCB+100
ASCBRCTF EQU   ASCBFW1+2
ASCBFLG1 EQU   ASCBFW1+3
ASCBFW2  EQU   ASCB+112
ASCBDSP1 EQU   ASCBFW2+2
ASCBFLG2 EQU   ASCBFW2+3
ASCBSCNT EQU   ASCB+116
ASCBLKGP EQU   ASCB+128
ASCBJBNI EQU   ASCB+172
ASCBJBNS EQU   ASCB+176
ASCBSRQ  EQU   ASCB+180
ASCBSRQ1 EQU   ASCBSRQ
ASCBSRQ2 EQU   ASCBSRQ+1
ASCBSRQ3 EQU   ASCBSRQ+2
ASCBSRQ4 EQU   ASCBSRQ+3
ASCBLSRB EQU   ASCB+208
ASCBLSMQ EQU   ASCBLSRB
ASCBTCBG EQU   ASCB+216
ASCBSRDP EQU   ASCB+228
ASVT     EQU   0
ASVTFRST EQU   ASVT+524
ASVTENTY EQU   ASVT+528
FRRS     EQU   0
FRRSHEAD EQU   FRRS
FRRSPTR  EQU   0
FRRSENTR EQU   0
FRRSFLGS EQU   FRRSENTR+4
FRRSFLG1 EQU   FRRSFLGS
FRREPTR  EQU   0
LCCA     EQU   0
LCCAPGR2 EQU   LCCA+72
LCCASCR0 EQU   LCCA+512
LCCAMCR0 EQU   LCCA+516
LCCAIHRC EQU   LCCA+520
LCCAIHR1 EQU   LCCAIHRC
LCCAIHR2 EQU   LCCAIHRC+1
LCCAIHR3 EQU   LCCAIHRC+2
LCCAIHR4 EQU   LCCAIHRC+3
LCCASPIN EQU   LCCA+524
LCCASPN1 EQU   LCCASPIN
LCCASPN2 EQU   LCCASPIN+1
LCCASPN3 EQU   LCCASPIN+2
LCCASPN4 EQU   LCCASPIN+3
LCCACPUS EQU   LCCA+536
LCCADSF1 EQU   LCCA+540
LCCADSF2 EQU   LCCA+541
LCCASPSA EQU   LCCA+544
LCCACRFL EQU   LCCA+692
LCCACREX EQU   LCCA+693
LCCALKFG EQU   LCCA+694
LCCASRBF EQU   LCCA+720
SDWA     EQU   0
SDWAPARM EQU   SDWA
SDWAFIOB EQU   SDWA+4
SDWAABCC EQU   SDWAFIOB
SDWACMPF EQU   SDWAABCC
SDWACTL1 EQU   SDWA+8
SDWACMKA EQU   SDWACTL1
SDWAMWPA EQU   SDWACTL1+1
SDWAPMKA EQU   SDWACTL1+4
SDWACTL2 EQU   SDWA+16
SDWACMKP EQU   SDWACTL2
SDWAMWPP EQU   SDWACTL2+1
SDWAPMKP EQU   SDWACTL2+4
SDWAGRSV EQU   SDWA+24
SDWANAME EQU   SDWA+88
SDWAEC1  EQU   SDWA+104
SDWAEMK1 EQU   SDWAEC1
SDWAMWP1 EQU   SDWAEC1+1
SDWAINT1 EQU   SDWAEC1+2
SDWANXT1 EQU   SDWAEC1+4
SDWAAEC1 EQU   SDWA+112
SDWAILC1 EQU   SDWAAEC1+1
SDWAINC1 EQU   SDWAAEC1+2
SDWAICD1 EQU   SDWAINC1+1
SDWAEC2  EQU   SDWA+120
SDWAEMK2 EQU   SDWAEC2
SDWAMWP2 EQU   SDWAEC2+1
SDWAINT2 EQU   SDWAEC2+2
SDWANXT2 EQU   SDWAEC2+4
SDWAAEC2 EQU   SDWA+128
SDWAILC2 EQU   SDWAAEC2+1
SDWAINC2 EQU   SDWAAEC2+2
SDWAICD2 EQU   SDWAINC2+1
SDWASRSV EQU   SDWA+136
SDWAIDNT EQU   SDWA+200
SDWAMCH  EQU   SDWA+204
SDWASTCK EQU   SDWAMCH
SDWAMCHI EQU   SDWAMCH+8
SDWAMCHS EQU   SDWAMCHI
SDWAMCHD EQU   SDWAMCHI+1
SDWAREGU EQU   SDWAMCHD
SDWAPSWU EQU   SDWAMCHD
SDWAINSF EQU   SDWAMCHD
SDWARSR1 EQU   SDWAMCH+12
SDWARSR2 EQU   SDWAMCH+13
SDWAFLGS EQU   SDWA+232
SDWAERRA EQU   SDWAFLGS
SDWAMCHK EQU   SDWAERRA
SDWAERRB EQU   SDWAFLGS+1
SDWAERRC EQU   SDWAFLGS+2
SDWAPERC EQU   SDWAERRC
SDWAEAS  EQU   SDWAERRC
SDWAERRD EQU   SDWAFLGS+3
SDWACLUP EQU   SDWAERRD
SDWAFMID EQU   SDWA+236
SDWAIOFS EQU   SDWA+238
SDWARTYA EQU   SDWA+240
SDWACPUA EQU   SDWA+248
SDWAPARQ EQU   SDWA+252
SDWARCDE EQU   SDWAPARQ
SDWAACF2 EQU   SDWAPARQ+1
SDWAACF3 EQU   SDWAPARQ+2
SDWAACF4 EQU   SDWAPARQ+3
SDWALKWA EQU   SDWA+256
SDWALKWS EQU   SDWALKWA
SDWARECP EQU   SDWA+292
SDWAREXN EQU   SDWARECP+16
SDWASNPA EQU   SDWA+320
SDWADUMP EQU   SDWASNPA
SDWADPFS EQU   SDWADUMP+1
SDWADDAT EQU   SDWASNPA+4
SDWASDAT EQU   SDWADDAT
SDWAPDAT EQU   SDWADDAT+2
SDWADPSA EQU   SDWA+328
SDWADPSL EQU   SDWADPSA
SDWARA   EQU   SDWA+400
SDWADPVA EQU   SDWARA+2
SRBSECT  EQU   0
SRB      EQU   SRBSECT
SRBFLC   EQU   SRB+12
SRBPRIOR EQU   SRB+37
SRBFLGS  EQU   SRBPRIOR
SRBPTR   EQU   0
WSAC     EQU   0
WSACGTF  EQU   WSAC+4
MCAWSA   EQU   0
MCATRAIL EQU   MCAWSA+256
MCATRL1  EQU   MCATRAIL
MCATRL2  EQU   MCATRAIL+1
MCARNIO  EQU   MCATRL2
MCASRM   EQU   MCATRL2
MCAFRR   EQU   MCATRL2
MCASTA   EQU   MCATRL2
MCAERROR EQU   MCATRL2
MCATRL3  EQU   MCATRAIL+2
MCATRL4  EQU   MCATRAIL+3
MCATRL5  EQU   MCATRAIL+4
MCATRL6  EQU   MCATRAIL+5
MCATRL7  EQU   MCATRAIL+6
MCATRL8  EQU   MCATRAIL+7
MCAMCR   EQU   MCAWSA+264
MCARECPR EQU   MCAWSA+268
MCAREC   EQU   MCAWSA+284
MCAWORK  EQU   MCAWSA+584
MCHEAD   EQU   0
MCHFLGS  EQU   MCHEAD+24
MCHFLG1  EQU   MCHFLGS
MCHSETE  EQU   MCHEAD+28
MCHSETD  EQU   MCHEAD+32
MCQE     EQU   0
MCQEAT   EQU   MCQE+32
MCQEFLGS EQU   MCQE+41
MCRWSA   EQU   0
MCRMCIH  EQU   MCRWSA
MCROUTSA EQU   MCRWSA+64
MCRMCA   EQU   MCRWSA+128
MCRWSAF  EQU   MCRWSA+132
MCRBRENT EQU   MCRWSAF
MCREID   EQU   MCRWSA+134
FRRPARM  EQU   0
RECURCTR EQU   FRRPARM
TRAILSAV EQU   FRRPARM+4
SVR14NRM EQU   FRRPARM+8
SVR14FRR EQU   FRRPARM+12
JOBNAME  EQU   0
JBNMTEST EQU   JOBNAME
BTU      EQU   0
RNIOASID EQU   0
MCIHRET  EQU   0
ACRADDR  EQU   0
AHLWTOMD EQU   0
AHLDMPMD EQU   0
AHLGREC  EQU   0
AHLGLGTH EQU   AHLGREC
AHLGRES  EQU   AHLGREC+2
AHLGAID  EQU   AHLGREC+4
AHLGFID  EQU   AHLGREC+5
AHLGTST  EQU   AHLGREC+6
AHLGEIDS EQU   AHLGTST
AHLGEIDL EQU   AHLGREC+14
AHLSBLOK EQU   0
AHLSETD  EQU   0
SEPL     EQU   0
SEFG     EQU   SEPL
SEEN     EQU   SEPL+2
SENM     EQU   SEPL+4
SEEL     EQU   SEPL+12
SEMC     EQU   SEPL+20
AHLSETEV EQU   0
I001C    EQU   0
I008P    EQU   0
I015F    EQU   0
I015P    EQU   0
I031F    EQU   0
I031P    EQU   0
I256C    EQU   0
RECOVRTN EQU   0
CVTS01   EQU   CVTPGSIA
CVTLPDIA EQU   CVTS01+12
CVTDIRST EQU   CVTLPDIA
CVTSLIDA EQU   CVTS01+24
CVTCTLFG EQU   CVTS01+50
CVTASVT  EQU   CVTS01+208
CVTRV210 EQU   CVTS01+424
CVTRV219 EQU   CVTS01+425
CVTRV228 EQU   CVTS01+426
CVTRV237 EQU   CVTS01+427
CVTMFRTR EQU   CVTS01+452
CVTRV262 EQU   CVTS01+468
CVTRV271 EQU   CVTS01+469
CVTRV280 EQU   CVTS01+470
CVTRV289 EQU   CVTS01+471
CVTGSDA  EQU   CVTS01+600
CVTLSCH  EQU   CVTS01+632
ASVTPTR  EQU   CVTASVT
PSARSVTE EQU   PSARSVT
WORKAREA EQU   MCAWORK
RETSAV1  EQU   WORKAREA
RETSAV2  EQU   WORKAREA+4
MCQESAV  EQU   WORKAREA+8
SDWASAV  EQU   WORKAREA+12
WTOPARM  EQU   WORKAREA+16
WTONAME  EQU   WTOPARM+4
WTODIND  EQU   WTOPARM+14
POPSW    EQU   FLCPOPSW
KEYCMWP  EQU   POPSW+1
REGSLCCA EQU   LCCAPGR2
R0R1LCCA EQU   REGSLCCA
REG0LCCA EQU   R0R1LCCA
REG1LCCA EQU   R0R1LCCA+4
REG2LCCA EQU   REGSLCCA+8
REGFLCCA EQU   REGSLCCA+60
MCRREGS1 EQU   MCROUTSA
MCRREG0  EQU   MCRREGS1
MCRREGS2 EQU   MCRMCIH
MCRR0R1  EQU   MCRREGS2
MCRREG1  EQU   MCRR0R1+4
MCRREGB  EQU   MCRREGS2+44
SRMREC   EQU   MCAREC
SRMASCB  EQU   SRMREC
SRMCPUID EQU   SRMREC+4
SRMJBNM  EQU   SRMREC+6
SRMREGS  EQU   SRMREC+14
SRMREG15 EQU   SRMREGS
SRMREG11 EQU   SRMREG15
SRMR0R1  EQU   SRMREGS+4
SRMREG0  EQU   SRMR0R1
FRRREC   EQU   MCAREC
FRRASCB  EQU   FRRREC
FRRCPUID EQU   FRRREC+4
FRRJBNM  EQU   FRRREC+6
FRRSDWA  EQU   FRRREC+14
FRRNAME  EQU   FRRSDWA
FRRPSW   EQU   FRRSDWA+8
FRRCC    EQU   FRRSDWA+16
FRREFLGS EQU   FRRSDWA+20
FRRMFLGS EQU   FRRSDWA+24
FRRFMCHD EQU   FRRMFLGS+1
FRRFACF2 EQU   FRRMFLGS+2
FRRFRCDE EQU   FRRMFLGS+3
FRRRTRY  EQU   FRRSDWA+28
STAREC   EQU   MCAREC
STAASCB  EQU   STAREC
STACPUID EQU   STAREC+4
STAJBNM  EQU   STAREC+6
STASDWA  EQU   STAREC+14
STANAME  EQU   STASDWA
STAPC    EQU   STASDWA+8
STAPSW   EQU   STAPC
STACC    EQU   STAPC+8
STAEFLGS EQU   STASDWA+20
STAR15   EQU   STASDWA+24
STAMFLGS EQU   STAR15
STAFMCHD EQU   STAMFLGS+1
STAFACF2 EQU   STAMFLGS+2
STAFRCDE EQU   STAMFLGS+3
STAR0R1  EQU   STASDWA+28
STARTRY  EQU   STAR0R1
STARTCA  EQU   STAR0R1+4
RNIOREC  EQU   MCAREC
RNIOASCB EQU   RNIOREC
RNIOCPID EQU   RNIOREC+4
RNIOJBNM EQU   RNIOREC+6
RNIOBTU  EQU   RNIOREC+14
RNIOR0   EQU   RNIOREC+34
ERRASCB  EQU   MCAREC
REXNTEST EQU   SDWAREXN
FLC      EQU   PSA
*                                      START UNREFERENCED COMPONENTS
@NM00117 EQU   STAMFLGS
@NM00116 EQU   FRRMFLGS
SRMREG1  EQU   SRMR0R1+4
@NM00111 EQU   MCRREGS2+8
@NM00110 EQU   MCRR0R1
@NM00109 EQU   REGSLCCA+48
REGBLCCA EQU   REGSLCCA+44
@NM00108 EQU   REGSLCCA+12
PSWADDR  EQU   POPSW+4
@NM00107 EQU   POPSW+2
@NM00106 EQU   POPSW
@NM00105 EQU   WTOPARM+8
@NM00104 EQU   WTOPARM
PSARSAV  EQU   PSARSVTE+60
PSARSTK  EQU   PSARSVTE+56
PSAESAV3 EQU   PSARSVTE+52
PSAESTK3 EQU   PSARSVTE+48
PSAESAV2 EQU   PSARSVTE+44
PSAESTK2 EQU   PSARSVTE+40
PSAESAV1 EQU   PSARSVTE+36
PSAESTK1 EQU   PSARSVTE+32
PSAPSAV  EQU   PSARSVTE+28
PSAPSTK  EQU   PSARSVTE+24
PSAMSAV  EQU   PSARSVTE+20
PSAMSTK  EQU   PSARSVTE+16
PSASSAV  EQU   PSARSVTE+12
PSASSTK  EQU   PSARSVTE+8
PSANSTK  EQU   PSARSVTE+4
PSACSTK  EQU   PSARSVTE
CVTRV628 EQU   CVTS01+728
CVTRV627 EQU   CVTS01+724
CVTRV626 EQU   CVTS01+720
CVTRV625 EQU   CVTS01+716
CVTRV624 EQU   CVTS01+712
CVTRV623 EQU   CVTS01+708
CVTRV622 EQU   CVTS01+704
CVTRV621 EQU   CVTS01+700
CVTIHASU EQU   CVTS01+696
CVTSUSP  EQU   CVTS01+692
CVTT6SVC EQU   CVTS01+688
CVTCDAL  EQU   CVTS01+684
CVTTCTL  EQU   CVTS01+680
CVTRSUME EQU   CVTS01+676
CVTJTERM EQU   CVTS01+672
CVTASMRM EQU   CVTS01+668
CVTTCASP EQU   CVTS01+664
CVT0PT03 EQU   CVTS01+660
CVT0PT0E EQU   CVTS01+656
CVTSRM   EQU   CVTS01+652
CVTCGK   EQU   CVTS01+648
CVTRAC   EQU   CVTS01+644
CVTRV606 EQU   CVTS01+640
CVTCDEQ  EQU   CVTS01+636
CVTEFF02 EQU   CVTS01+628
CVTCBBR  EQU   CVTS01+624
CVTSSCR  EQU   CVTS01+620
CVTEVENT EQU   CVTS01+616
CVTCRCA  EQU   CVTS01+612
CVTTPIO  EQU   CVTS01+608
CVTADV   EQU   CVTS01+604
CVTGSDAB EQU   CVTGSDA
CVTQV3   EQU   CVTS01+596
CVTQV2   EQU   CVTS01+592
CVTQV1   EQU   CVTS01+588
CVTRPT   EQU   CVTS01+584
CVTSSRB  EQU   CVTS01+580
CVTCSDRL EQU   CVTS01+576
CVTEXP1  EQU   CVTS01+572
CVTRMPMT EQU   CVTS01+568
CVTRMPTT EQU   CVTS01+564
CVTVPSA  EQU   CVTS01+560
CVTVSTOP EQU   CVTS01+556
CVTGTFR8 EQU   CVTS01+552
CVTQUIT  EQU   CVTS01+548
CVTVACR  EQU   CVTS01+544
CVTWTCB  EQU   CVTS01+540
CVTSTPRS EQU   CVTS01+536
CVT0PT02 EQU   CVTS01+532
CVTDARCM EQU   CVTS01+528
CVTIRECM EQU   CVTS01+524
CVTJRECM EQU   CVTS01+520
CVTVEMS0 EQU   CVTS01+516
CVTSPFRR EQU   CVTS01+512
CVTRLSTG EQU   CVTS01+508
CVT0TC0A EQU   CVTS01+504
CVTGMBR  EQU   CVTS01+500
CVTLFRM  EQU   CVTS01+496
CVTRMBR  EQU   CVTS01+492
CVTVIOP  EQU   CVTS01+488
CVTRV307 EQU   CVTS01+486
CVTRV306 EQU   CVTS01+484
CVTRV305 EQU   CVTS01+482
CVTRV304 EQU   CVTS01+480
CVTRV303 EQU   CVTS01+478
CVTRV302 EQU   CVTS01+476
CVTTRCA  EQU   CVTS01+472
CVTRV297 EQU   CVTRV289
CVTRV296 EQU   CVTRV289
CVTRV295 EQU   CVTRV289
CVTRV294 EQU   CVTRV289
CVTRV293 EQU   CVTRV289
CVTRV292 EQU   CVTRV289
CVTRV291 EQU   CVTRV289
CVTRV290 EQU   CVTRV289
CVTRV288 EQU   CVTRV280
CVTRV287 EQU   CVTRV280
CVTRV286 EQU   CVTRV280
CVTRV285 EQU   CVTRV280
CVTRV284 EQU   CVTRV280
CVTRV283 EQU   CVTRV280
CVTRV282 EQU   CVTRV280
CVTRV281 EQU   CVTRV280
CVTRV279 EQU   CVTRV271
CVTRV278 EQU   CVTRV271
CVTRV277 EQU   CVTRV271
CVTRV276 EQU   CVTRV271
CVTRV275 EQU   CVTRV271
CVTRV274 EQU   CVTRV271
CVTRV273 EQU   CVTRV271
CVTRV272 EQU   CVTRV271
CVTRV270 EQU   CVTRV262
CVTRV269 EQU   CVTRV262
CVTRV268 EQU   CVTRV262
CVTRV267 EQU   CVTRV262
CVTRV266 EQU   CVTRV262
CVTRV265 EQU   CVTRV262
CVTRV264 EQU   CVTRV262
CVTRV263 EQU   CVTRV262
CVTVFP   EQU   CVTS01+464
CVTVSI   EQU   CVTS01+460
CVTVPSIB EQU   CVTS01+456
CVTMFACT EQU   CVTMFRTR
CVTMFCTL EQU   CVTS01+448
CVTPVBP  EQU   CVTS01+444
CVTPWI   EQU   CVTS01+440
CVTRV254 EQU   CVTS01+438
CVTRV253 EQU   CVTS01+436
CVTRV252 EQU   CVTS01+434
CVTRV251 EQU   CVTS01+433
CVTRV250 EQU   CVTS01+432
CVTRV249 EQU   CVTS01+431
CVTRV248 EQU   CVTS01+430
CVTRV247 EQU   CVTS01+429
CVTRV246 EQU   CVTS01+428
CVTRV245 EQU   CVTRV237
CVTRV244 EQU   CVTRV237
CVTRV243 EQU   CVTRV237
CVTRV242 EQU   CVTRV237
CVTRV241 EQU   CVTRV237
CVTRV240 EQU   CVTRV237
CVTRV239 EQU   CVTRV237
CVTRV238 EQU   CVTRV237
CVTRV236 EQU   CVTRV228
CVTRV235 EQU   CVTRV228
CVTRV234 EQU   CVTRV228
CVTRV233 EQU   CVTRV228
CVTRV232 EQU   CVTRV228
CVTRV231 EQU   CVTRV228
CVTRV230 EQU   CVTRV228
CVTRV229 EQU   CVTRV228
CVTRV227 EQU   CVTRV219
CVTRV226 EQU   CVTRV219
CVTRV225 EQU   CVTRV219
CVTRV224 EQU   CVTRV219
CVTRV223 EQU   CVTRV219
CVTRV222 EQU   CVTRV219
CVTRV221 EQU   CVTRV219
CVTRV220 EQU   CVTRV219
CVTRV218 EQU   CVTRV210
CVTRV217 EQU   CVTRV210
CVTRV216 EQU   CVTRV210
CVTRV215 EQU   CVTRV210
CVTRV214 EQU   CVTRV210
CVTRV213 EQU   CVTRV210
CVTRV212 EQU   CVTRV210
CVTRV211 EQU   CVTRV210
CVTLCCAT EQU   CVTS01+420
CVTPCCAT EQU   CVTS01+416
CVTIPCRP EQU   CVTS01+412
CVTIPCRI EQU   CVTS01+408
CVTIPCDS EQU   CVTS01+404
CVTAIDVT EQU   CVTS01+400
CVTSSAP  EQU   CVTS01+396
CVTEHCIR EQU   CVTS01+392
CVTEHDEF EQU   CVTS01+388
CVTDAIR  EQU   CVTS01+384
CVTPERFM EQU   CVTS01+380
CVT044R2 EQU   CVTS01+376
CVTFETCH EQU   CVTS01+372
CVTRSTWD EQU   CVTS01+368
CVTSPOST EQU   CVTS01+364
CVTIOBP  EQU   CVTS01+360
CVTASMVT EQU   CVTS01+356
CVTRECRQ EQU   CVTS01+352
CVTWSAC  EQU   CVTS01+348
CVTRV149 EQU   CVTS01+344
CVTWSAL  EQU   CVTS01+340
CVTSPSA  EQU   CVTS01+336
CVTGLMN  EQU   CVTS01+332
CVTVEAC0 EQU   CVTS01+328
CVT062R1 EQU   CVTS01+324
CVTRPOST EQU   CVTS01+320
CVTDQIQE EQU   CVTS01+316
CVTCSD   EQU   CVTS01+312
CVTLKRMA EQU   CVTS01+308
CVTRSPIE EQU   CVTS01+304
CVTRENQ  EQU   CVTS01+300
CVTLQCB  EQU   CVTS01+296
CVTFQCB  EQU   CVTS01+292
CVTQCS01 EQU   CVTS01+288
CVTAPFT  EQU   CVTS01+284
CVTPARRL EQU   CVTS01+280
CVTVWAIT EQU   CVTS01+276
CVTGSPL  EQU   CVTS01+272
CVTLSMQ  EQU   CVTS01+268
CVTGSMQ  EQU   CVTS01+264
CVTEXPRO EQU   CVTS01+260
CVTOPCTP EQU   CVTS01+256
CVTSIC   EQU   CVTS01+252
CVTTPIOS EQU   CVTS01+248
CVTRTMS  EQU   CVTS01+244
CVTSDBF  EQU   CVTS01+240
CVTSCBP  EQU   CVTS01+236
CVTSDMP  EQU   CVTS01+232
CVTSV60  EQU   CVTS01+228
CVTRTMCT EQU   CVTS01+224
CVTASCBL EQU   CVTS01+220
CVTASCBH EQU   CVTS01+216
CVTGDA   EQU   CVTS01+212
CVTVVMDI EQU   CVTS01+204
CVTAQTOP EQU   CVTS01+200
CVTIOSCS EQU   CVTS01+196
CVTSDRM  EQU   CVTS01+192
CVTOPTE  EQU   CVTS01+188
CVTSTXU  EQU   CVTS01+184
CVTQUIS  EQU   CVTS01+180
CVTPARS  EQU   CVTS01+176
CVTS1EE  EQU   CVTS01+172
CVTFRAS  EQU   CVTS01+168
CVTQSAS  EQU   CVTS01+164
CVTCRAS  EQU   CVTS01+160
CVTCRMN  EQU   CVTS01+156
CVTDELCP EQU   CVTS01+152
CVTFRECL EQU   CVTS01+148
CVTGETCL EQU   CVTS01+144
CVTBLDCP EQU   CVTS01+140
CVTAUTHL EQU   CVTS01+136
CVTSCAN  EQU   CVTS01+132
CVTRV144 EQU   CVTS01+130
CVTMAXMP EQU   CVTS01+128
CVTSTCK  EQU   CVTS01+124
CVTRV139 EQU   CVTS01+123
CVTDSSAC EQU   CVTS01+122
CVTRV513 EQU   CVTS01+121
CVTIOSPL EQU   CVTS01+120
CVTPTGT  EQU   CVTS01+116
CVTCSPIE EQU   CVTS01+112
CVTSMFEX EQU   CVTS01+108
CVTOLT0A EQU   CVTS01+104
CVTSRBRT EQU   CVTS01+100
CVTPUTL  EQU   CVTS01+96
CVTASCRL EQU   CVTS01+92
CVTASCRF EQU   CVTS01+88
CVTRV326 EQU   CVTS01+84
CVTRV325 EQU   CVTS01+80
CVTRV324 EQU   CVTS01+76
CVT0VL01 EQU   CVTS01+72
CVTSHRVM EQU   CVTS01+68
CVTRV332 EQU   CVTS01+64
CVTTAS   EQU   CVTS01+60
CVTRSCN  EQU   CVTS01+56
CVTTRAC2 EQU   CVTS01+54
CVTTRACE EQU   CVTS01+52
CVTAPG   EQU   CVTS01+51
CVTSDTRC EQU   CVTCTLFG
CVTGTRCE EQU   CVTCTLFG
CVTNOMP  EQU   CVTCTLFG
CVTRSV79 EQU   CVTCTLFG
CVTDSTAT EQU   CVTCTLFG
CVTRSV78 EQU   CVTCTLFG
CVTRV333 EQU   CVTCTLFG
CVTIOQ   EQU   CVTCTLFG
CVTSPVLK EQU   CVTS01+49
CVTRSV77 EQU   CVTS01+48
CVTRV331 EQU   CVTS01+44
CVTRV330 EQU   CVTS01+40
CVTRV329 EQU   CVTS01+36
CVTRV328 EQU   CVTS01+32
CVTRV322 EQU   CVTS01+28
CVTSLID  EQU   CVTSLIDA+1
CVTSYLK  EQU   CVTSLIDA
CVTRV321 EQU   CVTS01+20
CVTRV320 EQU   CVTS01+16
CVTLPDIR EQU   CVTLPDIA+1
CVTRSV69 EQU   CVTDIRST
CVTRSV68 EQU   CVTDIRST
CVTRSV67 EQU   CVTDIRST
CVTRSV66 EQU   CVTDIRST
CVTRSV65 EQU   CVTDIRST
CVTRSV64 EQU   CVTDIRST
CVTRSV63 EQU   CVTDIRST
CVTDICOM EQU   CVTDIRST
CVTPVTP  EQU   CVTS01+8
CVTLPDSR EQU   CVTS01+4
CVTGETL  EQU   CVTS01
SECL     EQU   SEPL+16
SECN     EQU   SEPL+3
@NM00118 EQU   SEPL+1
SVR14CAL EQU   FRRPARM+16
@NM00103 EQU   FRRPARM+2
MCRRESV  EQU   MCRWSAF
MCERROR  EQU   MCRWSAF
MCINFGBR EQU   MCRWSAF
MCINCTL  EQU   MCRWSAF
MCQESRB  EQU   MCQE+44
@NM00102 EQU   MCQE+42
@NM00101 EQU   MCQEFLGS
MCQEACT  EQU   MCQEFLGS
MCQESCHE EQU   MCQE+40
MCQETECB EQU   MCQE+36
MCQEMCCL EQU   MCQE+28
MCQEMCEE EQU   MCQE+24
MCQEMCQE EQU   MCQE+20
MCQEASCB EQU   MCQE+16
MCQENAME EQU   MCQE+8
MCQEIDEN EQU   MCQE
MCHEADTR EQU   MCHEAD+48
MCHEADRD EQU   MCHEAD+44
MCHFRRAD EQU   MCHEAD+40
MCHMCER  EQU   MCHEAD+36
@NM00100 EQU   MCHFLGS+1
@NM00099 EQU   MCHFLG1
MCHTERM  EQU   MCHFLG1
MCHACT   EQU   MCHFLG1
MCHDIS   EQU   MCHEAD+20
MCHCTL   EQU   MCHEAD+16
MCHCNT   EQU   MCHEAD+12
MCHCUR   EQU   MCHEAD+8
MCHIDEN  EQU   MCHEAD
MCASWORK EQU   MCAWSA+644
@NM00098 EQU   MCATRL8
@NM00097 EQU   MCATRL8
@NM00096 EQU   MCATRL8
@NM00095 EQU   MCATRL8
MCAFRECT EQU   MCATRL7
MCAFRECC EQU   MCATRL7
MCAFRESP EQU   MCATRL7
MCAFREXJ EQU   MCATRL7
MCAFRSBR EQU   MCATRL6
MCAFRDMJ EQU   MCATRL6
MCAFRDPC EQU   MCATRL6
MCAFRPIC EQU   MCATRL6
MCAFRPIJ EQU   MCATRL6
@NM00094 EQU   MCATRL5
MCADREGS EQU   MCATRL5
MCAFRRB  EQU   MCATRL5
MCAFRRJ  EQU   MCATRL5
MCAFRRA  EQU   MCATRL5
MCAFRERT EQU   MCATRL5
MCAFREPC EQU   MCATRL5
MCAMJOBN EQU   MCATRL4
MCAMSDWA EQU   MCATRL4
MCAMBTU  EQU   MCATRL4
MCAMIOSB EQU   MCATRL4
MCAMTCB  EQU   MCATRL4
MCAMASCB EQU   MCATRL4
MCAMUCB  EQU   MCATRL4
MCAMEXT  EQU   MCATRL4
MCAFRFRT EQU   MCATRL3
MCAFRFA  EQU   MCATRL3
MCAFRSJ  EQU   MCATRL3
MCAFRSA  EQU   MCATRL3
MCAPIF   EQU   MCATRL3
MCASIOF  EQU   MCATRL3
MCAIOF   EQU   MCATRL3
MCASVCF  EQU   MCATRL3
MCATDIR  EQU   MCATRL2
MCALSR   EQU   MCATRL2
MCAUIO   EQU   MCATRL2
MCAUSR   EQU   MCATRL1
MCAPI    EQU   MCATRL1
MCASRB   EQU   MCATRL1
MCADSP   EQU   MCATRL1
MCASIO   EQU   MCATRL1
MCAIO    EQU   MCATRL1
MCAEXT   EQU   MCATRL1
MCASVC   EQU   MCATRL1
MCAMSG   EQU   MCAWSA+192
MCASETEV EQU   MCAWSA+128
MCAFWORK EQU   MCAWSA+112
MCASFEOB EQU   MCAWSA+56
MCASBLOK EQU   MCAWSA
WSACRSM  EQU   WSAC+64
WSACASMS EQU   WSAC+60
WSACASMD EQU   WSAC+56
WSACCCH  EQU   WSAC+52
WSACRRSA EQU   WSAC+48
WSACREST EQU   WSAC+44
WSACRSTI EQU   WSAC+40
WSACABTM EQU   WSAC+36
WSACMF1  EQU   WSAC+32
WSACEDS0 EQU   WSAC+28
WSACIOS  EQU   WSAC+24
WSACRTMK EQU   WSAC+20
WSACACR  EQU   WSAC+16
WSACTIME EQU   WSAC+12
WSACOPTM EQU   WSAC+8
WSACCWSA EQU   WSAC
SRBFRRA  EQU   SRB+40
@NM00093 EQU   SRB+39
SRBHLHI  EQU   SRB+38
@NM00092 EQU   SRBFLGS
SRBPNONQ EQU   SRBFLGS
SRBSUSP  EQU   SRBFLGS
SRBFRRCL EQU   SRBFLGS
SRBFRREQ EQU   SRBFLGS
SRBLLHLD EQU   SRBFLGS
SRBLLREQ EQU   SRBFLGS
SRBPKF   EQU   SRB+36
SRBSAVE  EQU   SRB+32
SRBPARM  EQU   SRB+28
SRBRMTR  EQU   SRB+24
SRBEP    EQU   SRB+20
SRBPTCB  EQU   SRBFLC+4
SRBPASID EQU   SRBFLC+2
SRBCPAFF EQU   SRBFLC
SRBASCB  EQU   SRB+8
SRBFLNK  EQU   SRB+4
SRBID    EQU   SRB
@NM00091 EQU   SDWA+512
SDWAVRA  EQU   SDWARA+4
SDWAURAL EQU   SDWARA+3
@NM00090 EQU   SDWADPVA
SDWAEBC  EQU   SDWADPVA
SDWAHEX  EQU   SDWADPVA
SDWAVRAL EQU   SDWARA
SDWAERTM EQU   SDWA+396
SDWACOMP EQU   SDWA+392
SDWARCPL EQU   SDWA+364
@NM00089 EQU   SDWADPSA+32
SDWATO4  EQU   SDWADPSL+28
SDWAFRM4 EQU   SDWADPSL+24
SDWATO3  EQU   SDWADPSL+20
SDWAFRM3 EQU   SDWADPSL+16
SDWATO2  EQU   SDWADPSL+12
SDWAFRM2 EQU   SDWADPSL+8
SDWATO1  EQU   SDWADPSL+4
SDWAFRM1 EQU   SDWADPSL
@NM00088 EQU   SDWADDAT+3
@NM00087 EQU   SDWAPDAT
SDWAUSPL EQU   SDWAPDAT
SDWADPSW EQU   SDWAPDAT
SDWATJPA EQU   SDWAPDAT
SDWATLPA EQU   SDWAPDAT
SDWADREG EQU   SDWAPDAT
SDWADSAH EQU   SDWAPDAT
SDWADSAS EQU   SDWAPDAT
@NM00086 EQU   SDWADDAT+1
@NM00085 EQU   SDWASDAT
SDWAQQS  EQU   SDWASDAT
SDWACBS  EQU   SDWASDAT
SDWAGTF  EQU   SDWASDAT
SDWASWA  EQU   SDWASDAT
SDWALSQA EQU   SDWASDAT
SDWASQA  EQU   SDWASDAT
SDWANUC  EQU   SDWASDAT
@NM00084 EQU   SDWADUMP+2
@NM00083 EQU   SDWADPFS
SDWASLST EQU   SDWADPFS
@NM00082 EQU   SDWADPFS
SDWADLST EQU   SDWADPFS
SDWADPT  EQU   SDWADPFS
SDWADPID EQU   SDWADUMP
SDWADPLA EQU   SDWA+316
SDWACSCT EQU   SDWARECP+8
SDWAMODN EQU   SDWARECP
SDWASEQ# EQU   SDWA+290
SDWAASID EQU   SDWA+288
SDWATALW EQU   SDWALKWS+28
SDWATDLW EQU   SDWALKWS+24
SDWATNLW EQU   SDWALKWS+20
SDWAAPLW EQU   SDWALKWS+16
SDWAIPLW EQU   SDWALKWS+12
SDWAILLW EQU   SDWALKWS+8
SDWAIULW EQU   SDWALKWS+4
SDWAICLW EQU   SDWALKWS
SDWAFLLK EQU   SDWAACF4
SDWACMS  EQU   SDWAACF4
SDWAOPTM EQU   SDWAACF4
SDWATADB EQU   SDWAACF4
SDWATDNB EQU   SDWAACF4
SDWATNCB EQU   SDWAACF4
SDWAILCH EQU   SDWAACF4
SDWAIUCB EQU   SDWAACF4
SDWAICAT EQU   SDWAACF3
SDWAIPRG EQU   SDWAACF3
SDWASALL EQU   SDWAACF3
SDWAASMP EQU   SDWAACF3
SDWADISP EQU   SDWAACF3
@NM00081 EQU   SDWAACF3
@NM00080 EQU   SDWAACF2
SDWAFREE EQU   SDWAACF2
SDWAUPRG EQU   SDWAACF2
@NM00079 EQU   SDWAACF2
SDWASPIN EQU   SDWAACF2
@NM00078 EQU   SDWAACF2
SDWARCRD EQU   SDWAACF2
SDWALCPU EQU   SDWACPUA+2
@NM00077 EQU   SDWACPUA
SDWARECA EQU   SDWA+244
SDWACPUI EQU   SDWA+239
@NM00076 EQU   SDWAIOFS
SDWANIOP EQU   SDWAIOFS
SDWANOIO EQU   SDWAIOFS
SDWAIOHT EQU   SDWAIOFS
SDWAIOQR EQU   SDWAIOFS
SDWAERFL EQU   SDWAERRD
SDWAMCIV EQU   SDWAERRD
SDWARPIV EQU   SDWAERRD
SDWAMABD EQU   SDWAERRD
SDWACTS  EQU   SDWAERRD
SDWASTAE EQU   SDWAERRD
SDWANRBE EQU   SDWAERRD
@NM00075 EQU   SDWAERRC
SDWAIRB  EQU   SDWAERRC
SDWASTAI EQU   SDWAERRC
SDWASTAF EQU   SDWAERRC
SDWASRBM EQU   SDWAERRB
SDWALDIS EQU   SDWAERRB
SDWAENRB EQU   SDWAERRB
SDWATYP1 EQU   SDWAERRB
@NM00074 EQU   SDWAERRB
SDWAPGIO EQU   SDWAERRA
SDWATEXC EQU   SDWAERRA
SDWASVCE EQU   SDWAERRA
SDWAABTM EQU   SDWAERRA
SDWASVCD EQU   SDWAERRA
SDWARKEY EQU   SDWAERRA
SDWAPCHK EQU   SDWAERRA
SDWATIME EQU   SDWAMCH+20
SDWARFSA EQU   SDWAMCH+16
@NM00073 EQU   SDWAMCH+14
SDWAVEQR EQU   SDWARSR2
SDWAPGFX EQU   SDWARSR2
SDWAFLSQ EQU   SDWARSR2
SDWAFSQA EQU   SDWARSR2
SDWANUCL EQU   SDWARSR2
SDWASPER EQU   SDWARSR2
SDWAINTC EQU   SDWARSR2
SDWAOFLN EQU   SDWARSR2
SDWACHNG EQU   SDWARSR1
SDWAMSER EQU   SDWARSR1
@NM00072 EQU   SDWARSR1
SDWACPID EQU   SDWAMCH+10
SDWATERR EQU   SDWAMCHD
SDWAFPRX EQU   SDWAMCHD
SDWAACR  EQU   SDWAMCHD
SDWASCK  EQU   SDWAMCHD
SDWASKYF EQU   SDWAMCHD
@NM00071 EQU   SDWAMCHS
SDWARSRF EQU   SDWAMCHS
SDWARSRC EQU   SDWAMCHS
SDWAINVP EQU   SDWAMCHS
SDWATSVL EQU   SDWAMCHS
SDWARCDF EQU   SDWAMCHS
SDWASRVL EQU   SDWAMCHS
SDWASCKE EQU   SDWASTCK+4
SDWASCKB EQU   SDWASTCK
SDWALNTH EQU   SDWAIDNT+1
SDWASPID EQU   SDWAIDNT
SDWASR15 EQU   SDWASRSV+60
SDWASR14 EQU   SDWASRSV+56
SDWASR13 EQU   SDWASRSV+52
SDWASR12 EQU   SDWASRSV+48
SDWASR11 EQU   SDWASRSV+44
SDWASR10 EQU   SDWASRSV+40
SDWASR09 EQU   SDWASRSV+36
SDWASR08 EQU   SDWASRSV+32
SDWASR07 EQU   SDWASRSV+28
SDWASR06 EQU   SDWASRSV+24
SDWASR05 EQU   SDWASRSV+20
SDWASR04 EQU   SDWASRSV+16
SDWASR03 EQU   SDWASRSV+12
SDWASR02 EQU   SDWASRSV+8
SDWASR01 EQU   SDWASRSV+4
SDWASR00 EQU   SDWASRSV
SDWATRN2 EQU   SDWAAEC2+4
SDWAIPC2 EQU   SDWAICD2
SDWAIMC2 EQU   SDWAICD2
SDWAIPR2 EQU   SDWAICD2
@NM00070 EQU   SDWAINC2
@NM00069 EQU   SDWAILC2
SDWAIL2  EQU   SDWAILC2
@NM00068 EQU   SDWAILC2
@NM00067 EQU   SDWAAEC2
SDWAADD2 EQU   SDWANXT2+1
@NM00066 EQU   SDWANXT2
@NM00065 EQU   SDWAEC2+3
SDWASGN2 EQU   SDWAINT2
SDWAEXP2 EQU   SDWAINT2
SDWADEC2 EQU   SDWAINT2
SDWAFPO2 EQU   SDWAINT2
SDWACC2  EQU   SDWAINT2
@NM00064 EQU   SDWAINT2
SDWAPGM2 EQU   SDWAMWP2
SDWAWAT2 EQU   SDWAMWP2
SDWAMCK2 EQU   SDWAMWP2
SDWAECT2 EQU   SDWAMWP2
SDWAKEY2 EQU   SDWAMWP2
SDWAEXT2 EQU   SDWAEMK2
SDWAIO2  EQU   SDWAEMK2
SDWATRM2 EQU   SDWAEMK2
@NM00063 EQU   SDWAEMK2
SDWAPER2 EQU   SDWAEMK2
@NM00062 EQU   SDWAEMK2
SDWATRAN EQU   SDWAAEC1+4
SDWAIPC1 EQU   SDWAICD1
SDWAIMC1 EQU   SDWAICD1
SDWAIPR1 EQU   SDWAICD1
@NM00061 EQU   SDWAINC1
@NM00060 EQU   SDWAILC1
SDWAIL1  EQU   SDWAILC1
@NM00059 EQU   SDWAILC1
@NM00058 EQU   SDWAAEC1
SDWAADD1 EQU   SDWANXT1+1
@NM00057 EQU   SDWANXT1
@NM00056 EQU   SDWAEC1+3
SDWASGN1 EQU   SDWAINT1
SDWAEXP1 EQU   SDWAINT1
SDWADEC1 EQU   SDWAINT1
SDWAFPO1 EQU   SDWAINT1
SDWACC1  EQU   SDWAINT1
@NM00055 EQU   SDWAINT1
SDWAPGM1 EQU   SDWAMWP1
SDWAWAT1 EQU   SDWAMWP1
SDWAMCK1 EQU   SDWAMWP1
SDWAECT1 EQU   SDWAMWP1
SDWAKEY1 EQU   SDWAMWP1
SDWAEXT1 EQU   SDWAEMK1
SDWAIO1  EQU   SDWAEMK1
SDWATRM1 EQU   SDWAEMK1
@NM00054 EQU   SDWAEMK1
SDWAPER1 EQU   SDWAEMK1
@NM00053 EQU   SDWAEMK1
SDWAIOBR EQU   SDWA+100
SDWAEPA  EQU   SDWA+96
@NM00052 EQU   SDWANAME+4
SDWARBAD EQU   SDWANAME
SDWAGR15 EQU   SDWAGRSV+60
SDWAGR14 EQU   SDWAGRSV+56
SDWAGR13 EQU   SDWAGRSV+52
SDWAGR12 EQU   SDWAGRSV+48
SDWAGR11 EQU   SDWAGRSV+44
SDWAGR10 EQU   SDWAGRSV+40
SDWAGR09 EQU   SDWAGRSV+36
SDWAGR08 EQU   SDWAGRSV+32
SDWAGR07 EQU   SDWAGRSV+28
SDWAGR06 EQU   SDWAGRSV+24
SDWAGR05 EQU   SDWAGRSV+20
SDWAGR04 EQU   SDWAGRSV+16
SDWAGR03 EQU   SDWAGRSV+12
SDWAGR02 EQU   SDWAGRSV+8
SDWAGR01 EQU   SDWAGRSV+4
SDWAGR00 EQU   SDWAGRSV
SDWANXTP EQU   SDWACTL2+5
SDWASGP  EQU   SDWAPMKP
SDWAEUP  EQU   SDWAPMKP
SDWADOP  EQU   SDWAPMKP
SDWAFPP  EQU   SDWAPMKP
SDWACCP  EQU   SDWAPMKP
SDWAILP  EQU   SDWAPMKP
SDWAINTP EQU   SDWACTL2+2
SDWASPVP EQU   SDWAMWPP
SDWAWATP EQU   SDWAMWPP
SDWAMCKP EQU   SDWAMWPP
@NM00051 EQU   SDWAMWPP
SDWAKEYP EQU   SDWAMWPP
SDWAEXTP EQU   SDWACMKP
SDWAIOP  EQU   SDWACMKP
SDWANXTA EQU   SDWACTL1+5
SDWASGA  EQU   SDWAPMKA
SDWAEUA  EQU   SDWAPMKA
SDWADOA  EQU   SDWAPMKA
SDWAFPA  EQU   SDWAPMKA
SDWACCA  EQU   SDWAPMKA
SDWAILA  EQU   SDWAPMKA
SDWAINTA EQU   SDWACTL1+2
SDWASPVA EQU   SDWAMWPA
SDWAWATA EQU   SDWAMWPA
SDWAMCKA EQU   SDWAMWPA
@NM00050 EQU   SDWAMWPA
SDWAKEYA EQU   SDWAMWPA
SDWAEXTA EQU   SDWACMKA
SDWAIOA  EQU   SDWACMKA
SDWACMPC EQU   SDWAABCC+1
@NM00049 EQU   SDWACMPF
SDWASTCC EQU   SDWACMPF
@NM00048 EQU   SDWACMPF
SDWASTEP EQU   SDWACMPF
SDWAREQ  EQU   SDWACMPF
LCCAR125 EQU   LCCA+964
LCCAR124 EQU   LCCA+960
LCCASGPR EQU   LCCA+896
LCCADRT2 EQU   LCCA+888
LCCADRT1 EQU   LCCA+880
LCCAFSSJ EQU   LCCA+876
LCCAESS2 EQU   LCCA+872
LCCASPLJ EQU   LCCA+868
LCCASMQJ EQU   LCCA+864
LCCAIRT  EQU   LCCA+736
LCCAASID EQU   LCCA+732
LCCARV89 EQU   LCCA+728
LCCAPGTA EQU   LCCASRBF+2
LCCASAFN EQU   LCCASRBF
LCCAECSA EQU   LCCA+716
LCCAICR0 EQU   LCCA+712
LCCALWTM EQU   LCCA+704
LCCARV78 EQU   LCCA+700
LCCAPINV EQU   LCCA+696
LCCARV88 EQU   LCCA+695
LCCARV87 EQU   LCCALKFG
LCCARV86 EQU   LCCALKFG
LCCARV85 EQU   LCCALKFG
LCCARV84 EQU   LCCALKFG
LCCALKRD EQU   LCCALKFG
LCCALKAQ EQU   LCCALKFG
LCCALKSA EQU   LCCALKFG
LCCALKDP EQU   LCCALKFG
LCCACRST EQU   LCCACREX
LCCACRDP EQU   LCCACREX
LCCACRLM EQU   LCCACREX
LCCACRIN EQU   LCCACREX
LCCACRRT EQU   LCCACREX
LCCACRLE EQU   LCCACREX
LCCACRRM EQU   LCCACREX
LCCACREF EQU   LCCACREX
LCCAVARY EQU   LCCACRFL
LCCARV73 EQU   LCCACRFL
LCCARV72 EQU   LCCACRFL
LCCARV71 EQU   LCCACRFL
LCCARV70 EQU   LCCACRFL
LCCARV69 EQU   LCCACRFL
LCCACLMS EQU   LCCACRFL
LCCACRTM EQU   LCCACRFL
LCCALCR0 EQU   LCCA+688
LCCACRLC EQU   LCCA+684
LCCARCPU EQU   LCCA+680
LCCADCPU EQU   LCCA+676
LCCASRBJ EQU   LCCA+672
LCCADSSR EQU   LCCA+668
LCCADSSC EQU   LCCA+660
LCCADSS3 EQU   LCCA+648
LCCADSS2 EQU   LCCA+636
LCCADSS1 EQU   LCCA+624
LCCAWTIM EQU   LCCA+616
LCCAITOD EQU   LCCA+608
LCCADTOD EQU   LCCA+600
LCCASTOD EQU   LCCA+592
LCCARIR5 EQU   LCCASPSA+44
LCCARIR4 EQU   LCCASPSA+40
LCCARIR3 EQU   LCCASPSA+36
LCCARIR2 EQU   LCCASPSA+32
LCCARPR5 EQU   LCCASPSA+28
LCCARPR4 EQU   LCCASPSA+24
LCCARPR3 EQU   LCCASPSA+20
LCCARPR2 EQU   LCCASPSA+16
LCCADSR5 EQU   LCCASPSA+12
LCCADSR4 EQU   LCCASPSA+8
LCCADSR3 EQU   LCCASPSA+4
LCCADSR2 EQU   LCCASPSA
LCCARV68 EQU   LCCA+543
LCCAPSMK EQU   LCCA+542
LCCARV67 EQU   LCCADSF2
LCCARV66 EQU   LCCADSF2
LCCARV65 EQU   LCCADSF2
LCCARV64 EQU   LCCADSF2
LCCADSRW EQU   LCCADSF2
LCCADSPL EQU   LCCADSF2
LCCAGSRB EQU   LCCADSF2
LCCASRBM EQU   LCCADSF2
LCCARV61 EQU   LCCADSF1
LCCARV60 EQU   LCCADSF1
LCCARV59 EQU   LCCADSF1
LCCARV58 EQU   LCCADSF1
LCCATIMR EQU   LCCADSF1
LCCADSS  EQU   LCCADSF1
LCCAVCPU EQU   LCCADSF1
LCCAACR  EQU   LCCADSF1
LCCAASCP EQU   LCCA+532
LCCAESSA EQU   LCCA+528
LCCARV55 EQU   LCCASPN4
LCCARV54 EQU   LCCASPN4
LCCARV53 EQU   LCCASPN4
LCCARV52 EQU   LCCASPN4
LCCARV51 EQU   LCCASPN4
LCCARV50 EQU   LCCASPN4
LCCARV49 EQU   LCCASPN4
LCCARV48 EQU   LCCASPN4
LCCARV47 EQU   LCCASPN3
LCCARV46 EQU   LCCASPN3
LCCARV45 EQU   LCCASPN3
LCCARV44 EQU   LCCASPN3
LCCARV43 EQU   LCCASPN3
LCCARV42 EQU   LCCASPN3
LCCARV41 EQU   LCCASPN3
LCCARV40 EQU   LCCASPN3
LCCARV39 EQU   LCCASPN2
LCCARV38 EQU   LCCASPN2
LCCARV37 EQU   LCCASPN2
LCCARV36 EQU   LCCASPN2
LCCARV35 EQU   LCCASPN2
LCCARV34 EQU   LCCASPN2
LCCARV33 EQU   LCCASPN2
LCCARV32 EQU   LCCASPN2
LCCARV31 EQU   LCCASPN1
LCCAINT  EQU   LCCASPN1
LCCAMFIO EQU   LCCASPN1
LCCARSTR EQU   LCCASPN1
LCCATSPN EQU   LCCASPN1
LCCALOCK EQU   LCCASPN1
LCCASIGP EQU   LCCASPN1
LCCAPTLB EQU   LCCASPN1
LCCARV27 EQU   LCCAIHR4
LCCARV26 EQU   LCCAIHR4
LCCARV25 EQU   LCCAIHR4
LCCARV24 EQU   LCCAIHR4
LCCARV23 EQU   LCCAIHR4
LCCARV22 EQU   LCCAIHR4
LCCARV21 EQU   LCCAIHR4
LCCARV20 EQU   LCCAIHR4
LCCARV19 EQU   LCCAIHR3
LCCARV18 EQU   LCCAIHR3
LCCARV17 EQU   LCCAIHR3
LCCARV16 EQU   LCCAIHR3
LCCARV15 EQU   LCCAIHR3
LCCARV14 EQU   LCCAIHR3
LCCARV13 EQU   LCCAIHR3
LCCARV12 EQU   LCCAIHR3
LCCARV11 EQU   LCCAIHR2
LCCARV10 EQU   LCCAIHR2
LCCARV09 EQU   LCCAIHR2
LCCARV08 EQU   LCCAIHR2
LCCARV07 EQU   LCCAIHR2
LCCARV06 EQU   LCCAIHR2
LCCARV05 EQU   LCCAIHR2
LCCARV04 EQU   LCCAIHR2
LCCARV03 EQU   LCCAIHR1
LCCARV02 EQU   LCCAIHR1
LCCARV01 EQU   LCCAIHR1
LCCAPPIE EQU   LCCAIHR1
LCCAPSG1 EQU   LCCAIHR1
LCCAPDAT EQU   LCCAIHR1
LCCAXRC2 EQU   LCCAIHR1
LCCAXRC1 EQU   LCCAIHR1
LCCAMPEN EQU   LCCAMCR0
@NM00015 EQU   LCCAMCR0
LCCASPEN EQU   LCCASCR0
@NM00014 EQU   LCCASCR0
LCCAR165 EQU   LCCA+508
LCCAR164 EQU   LCCA+504
LCCAR163 EQU   LCCA+500
LCCAR162 EQU   LCCA+496
LCCAR161 EQU   LCCA+492
LCCAR160 EQU   LCCA+488
LCCAR159 EQU   LCCA+484
LCCAR158 EQU   LCCA+480
LCCAR157 EQU   LCCA+476
LCCAR156 EQU   LCCA+472
LCCAR155 EQU   LCCA+468
LCCAR154 EQU   LCCA+464
LCCAR153 EQU   LCCA+460
LCCAR152 EQU   LCCA+456
LCCAR151 EQU   LCCA+452
LCCAR150 EQU   LCCA+448
LCCAR133 EQU   LCCA+444
LCCAR132 EQU   LCCA+440
LCCAR131 EQU   LCCA+436
LCCAR130 EQU   LCCA+432
LCCAR129 EQU   LCCA+428
LCCAR128 EQU   LCCA+424
LCCAR127 EQU   LCCA+420
LCCAR126 EQU   LCCA+416
LCCARSGR EQU   LCCA+352
LCCAXGR3 EQU   LCCA+288
LCCAXGR2 EQU   LCCA+224
LCCAR149 EQU   LCCA+220
LCCAR148 EQU   LCCA+216
LCCAR147 EQU   LCCA+212
LCCAR146 EQU   LCCA+208
LCCAR145 EQU   LCCA+204
LCCAR144 EQU   LCCA+200
LCCAR143 EQU   LCCA+196
LCCAR142 EQU   LCCA+192
LCCAR141 EQU   LCCA+188
LCCAR140 EQU   LCCA+184
LCCAR139 EQU   LCCA+180
LCCAR138 EQU   LCCA+176
LCCAR137 EQU   LCCA+172
LCCAR136 EQU   LCCA+168
LCCAR135 EQU   LCCA+164
LCCAR134 EQU   LCCA+160
LCCACR0  EQU   LCCA+156
LCCAMCR1 EQU   LCCA+152
LCCAPVAD EQU   LCCA+148
LCCAPINT EQU   LCCA+144
LCCAPPSW EQU   LCCA+136
LCCAPGR1 EQU   LCCA+8
LCCARV77 EQU   LCCA+6
LCCACPUA EQU   LCCA+4
LCCALCCA EQU   LCCA
FRRSPARM EQU   FRRSENTR+8
@NM00013 EQU   FRRSFLGS+1
@NM00012 EQU   FRRSFLG1
FRRSNEST EQU   FRRSFLG1
FRRSRCUR EQU   FRRSFLG1
FRRSFRRA EQU   FRRSENTR
FRRSENTS EQU   FRRS+84
FRRSRTMW EQU   FRRS+16
FRRSCURR EQU   FRRSHEAD+12
FRRSELEN EQU   FRRSHEAD+8
FRRSLAST EQU   FRRSHEAD+4
FRRSEMP  EQU   FRRSHEAD
ASVTEND  EQU   ASVT+528
ASVTAVAL EQU   ASVTENTY
ASVTAVAI EQU   ASVTFRST
ASVTRS00 EQU   ASVT+520
ASVTMAXU EQU   ASVT+516
ASVTASVT EQU   ASVT+512
ASVTBEGN EQU   ASVT+512
@NM00011 EQU   ASVT
ASCBEND  EQU   ASCB+240
ASCBRV50 EQU   ASCB+236
ASCBRV49 EQU   ASCB+232
ASCBIODP EQU   ASCBSRDP+3
ASCBNTSG EQU   ASCBSRDP+2
ASCBTNDP EQU   ASCBSRDP+1
ASCBNDP  EQU   ASCBSRDP
ASCBWPRB EQU   ASCB+224
ASCBTCBL EQU   ASCBTCBG+4
ASCBTCBS EQU   ASCBTCBG
ASCBLSPL EQU   ASCBLSRB+4
ASCBURR  EQU   ASCBLSMQ
ASCBSRBT EQU   ASCB+200
ASCBSWTL EQU   ASCB+196
ASCBRS14 EQU   ASCB+195
ASCBSMCT EQU   ASCB+194
ASCBSSRB EQU   ASCB+192
ASCBPCTT EQU   ASCB+188
ASCBVGTT EQU   ASCB+184
ASCBPURD EQU   ASCBSRQ4
ASCBSTAT EQU   ASCBSRQ4
ASCBCHAP EQU   ASCBSRQ4
ASCBRTM1 EQU   ASCBSRQ4
ASCBRTM2 EQU   ASCBSRQ4
ASCBATTA EQU   ASCBSRQ4
ASCBDETA EQU   ASCBSRQ4
ASCBDSG1 EQU   ASCBSRQ4
ASCBCBVE EQU   ASCBSRQ3
ASCBMINI EQU   ASCBSRQ3
ASCBMTER EQU   ASCBSRQ3
ASCBEXEF EQU   ASCBSRQ3
ASCBACHA EQU   ASCBSRQ3
ASCBTCBV EQU   ASCBSRQ3
ASCBREST EQU   ASCBSRQ3
ASCBDSG2 EQU   ASCBSRQ3
ASCBQVER EQU   ASCBSRQ2
ASCBSRM1 EQU   ASCBSRQ2
ASCBRV25 EQU   ASCBSRQ2
ASCBRV24 EQU   ASCBSRQ2
ASCBRV23 EQU   ASCBSRQ2
ASCBRV22 EQU   ASCBSRQ2
ASCBRV21 EQU   ASCBSRQ2
ASCBDSG3 EQU   ASCBSRQ2
ASCBRV19 EQU   ASCBSRQ1
ASCBRV18 EQU   ASCBSRQ1
ASCBRV17 EQU   ASCBSRQ1
ASCBRV16 EQU   ASCBSRQ1
ASCBRV15 EQU   ASCBSRQ1
ASCBRV14 EQU   ASCBSRQ1
ASCBDFLT EQU   ASCBSRQ1
ASCBDSG4 EQU   ASCBSRQ1
ASCBMCC  EQU   ASCB+168
ASCBRTWA EQU   ASCB+164
ASCBIQEA EQU   ASCB+160
ASCBXMPQ EQU   ASCB+156
ASCBRS01 EQU   ASCB+154
ASCBFMCT EQU   ASCB+152
ASCBOUXB EQU   ASCB+148
ASCBOUCB EQU   ASCB+144
ASCBMECB EQU   ASCB+140
ASCBQECB EQU   ASCB+136
ASCBLSQH EQU   ASCBLKGP+4
ASCBLOCK EQU   ASCBLKGP
ASCBRCTP EQU   ASCB+124
ASCBNVSC EQU   ASCB+122
ASCBVSC  EQU   ASCB+120
ASCBSRBS EQU   ASCBSCNT+2
ASCBRV48 EQU   ASCBSCNT
ASCBRV06 EQU   ASCBFLG2
ASCBRV05 EQU   ASCBFLG2
ASCBRV04 EQU   ASCBFLG2
ASCBRV47 EQU   ASCBFLG2
ASCBS2S  EQU   ASCBFLG2
ASCBCEXT EQU   ASCBFLG2
ASCBPXMT EQU   ASCBFLG2
ASCBXMPT EQU   ASCBFLG2
ASCBRF07 EQU   ASCBDSP1
ASCBRF06 EQU   ASCBDSP1
ASCBRF05 EQU   ASCBDSP1
ASCBSTND EQU   ASCBDSP1
ASCBSSSS EQU   ASCBDSP1
ASCBSNQS EQU   ASCBDSP1
ASCBFAIL EQU   ASCBDSP1
ASCBSSND EQU   ASCBDSP1
ASCBSWCT EQU   ASCBFW2
ASCBASXB EQU   ASCB+108
ASCBTMCH EQU   ASCB+104
ASCBNSWP EQU   ASCBFLG1
ASCBTYP1 EQU   ASCBFLG1
ASCBRV46 EQU   ASCBFLG1
ASCBABNT EQU   ASCBFLG1
ASCBTERM EQU   ASCBFLG1
ASCBS3S  EQU   ASCBFLG1
ASCBRV45 EQU   ASCBFLG1
ASCBTOFF EQU   ASCBFLG1
ASCBRF01 EQU   ASCBRCTF
ASCBTMLW EQU   ASCBRCTF
ASCBOUT  EQU   ASCBRCTF
ASCBWAIT EQU   ASCBRCTF
ASCBRV08 EQU   ASCBRCTF
ASCBFQU  EQU   ASCBRCTF
ASCBFRS  EQU   ASCBRCTF
ASCBTMNO EQU   ASCBRCTF
ASCBAFFN EQU   ASCBFW1
ASCBDUMP EQU   ASCB+96
ASCBTLCH EQU   ASCB+92
ASCBUBET EQU   ASCB+88
ASCBECB  EQU   ASCB+84
ASCBJSTL EQU   ASCB+80
ASCBEWST EQU   ASCB+72
ASCBEJST EQU   ASCB+64
ASCBTSB  EQU   ASCB+60
ASCBCSCB EQU   ASCB+56
ASCBRSMA EQU   ASCBRSM+1
ASCBRV54 EQU   ASCBRSMF
ASCBRV53 EQU   ASCBRSMF
ASCBRV52 EQU   ASCBRSMF
ASCBRV51 EQU   ASCBRSMF
ASCBVEQR EQU   ASCBRSMF
ASCBN2LP EQU   ASCBRSMF
ASCB1LPU EQU   ASCBRSMF
ASCB2LPU EQU   ASCBRSMF
ASCBLDA  EQU   ASCB+48
ASCBSTOR EQU   ASCB+44
ASCBDP   EQU   ASCB+43
ASCBHLHI EQU   ASCB+42
ASCBIOSM EQU   ASCB+40
ASCBSEQN EQU   ASCB+38
ASCBCPUS EQU   ASCB+32
ASCBTNEW EQU   ASCB+28
ASCBIOSP EQU   ASCB+24
ASCBSYNC EQU   ASCBSUPC+4
ASCBSVRB EQU   ASCBSUPC
ASCBCMSF EQU   ASCB+12
ASCBBWDP EQU   ASCB+8
ASCBFWDP EQU   ASCB+4
ASCBASCB EQU   ASCB
ASCBEGIN EQU   ASCB
TRANSMAX EQU   GTFPCT+304
@NM00010 EQU   AUDITFLG+3
AFSLEBLD EQU   AUDITFLG+3
WSERFG06 EQU   AUDITFLG+3
WSERFG05 EQU   AUDITFLG+3
WSERFG04 EQU   AUDITFLG+3
WSERFG03 EQU   AUDITFLG+3
WSERFG02 EQU   AUDITFLG+2
WSERFLAG EQU   AUDITFLG+2
TERMFLAG EQU   AUDITFLG+2
AFXWRIT  EQU   AUDITFLG+2
AFQLWAIT EQU   AUDITFLG+2
AFSLEGET EQU   AUDITFLG+2
AFBUFGET EQU   AUDITFLG+2
AFFEOB   EQU   AUDITFLG+2
AFBLKFIX EQU   AUDITFLG+1
AFEQFIX  EQU   AUDITFLG+1
AFPGRLSE EQU   AUDITFLG+1
AFWRAP   EQU   AUDITFLG+1
AFBUFOFF EQU   AUDITFLG+1
AFLDFX   EQU   AUDITFLG+1
AFCLOSE  EQU   AUDITFLG+1
AFOPEN   EQU   AUDITFLG+1
AFGMBLOK EQU   AUDITFLG
AFGMSRB  EQU   AUDITFLG
AFWAIT   EQU   AUDITFLG
AFTERM   EQU   AUDITFLG
AFINIT   EQU   AUDITFLG
AFWWRIT  EQU   AUDITFLG
AFCWRIT  EQU   AUDITFLG
AFIWRIT  EQU   AUDITFLG
EQSHORT  EQU   GTFPCT+292
SLEMAX   EQU   GTFPCT+288
SLECNT   EQU   GTFPCT+284
RQPURGE  EQU   GTFPCT+280
RQTOTAL  EQU   GTFPCT+276
WRTDLST  EQU   GTFPCT+272
NUMOFBUF EQU   GTFPCT+268
SBUFDISA EQU   GTFPCT+264
SLESUSED EQU   GTFPCT+260
EQMIN    EQU   GTFPCT+256
EQLENGTH EQU   GTFPCT+252
WQMAX    EQU   GTFPCT+248
WQLENGTH EQU   GTFPCT+244
QLECBP   EQU   QLOCKECB
@NM00009 EQU   QLOCKECB
@NM00008 EQU   QLOCKWRD+3
SCHEDBUF EQU   QLOCKWRD+2
POSTWRIT EQU   QLOCKWRD+1
QLOCK    EQU   QLOCKWRD
WRITERDD EQU   GTFPCT+228
GTFLOSTR EQU   GTFPCT+224
SRBAVAIL EQU   GTFSSRB
WRTRERRP EQU   WRTRERR
@NM00007 EQU   WRTRERR
TRMWRITP EQU   TRMWRIT
@NM00006 EQU   TRMWRIT
GTFCMECB EQU   GTFPCT+208
WRTRCOMP EQU   WRTRCOM
@NM00005 EQU   WRTRCOM
TRANSCNT EQU   GTFPCT+200
AHLRDPLQ EQU   GTFPCT+196
SFEOBRTN EQU   GTFPCT+192
CURRBLOK EQU   GTFPCT+184
GBCDS    EQU   NEXTBLOK
WSMODEND EQU   GTFPCT+176
WSMODBEG EQU   GTFPCT+172
BCBPAGE  EQU   GTFPCT+156
SLEPAGE  EQU   GTFPCT+152
SAVECNT  EQU   GTFPCT+148
SLQHEAD  EQU   GTFPCT+144
HQLENGTH EQU   GTFPCT+140
QTAIL    EQU   GTFPCT+136
HQHEAD   EQU   GTFPCT+132
WQHEAD   EQU   GTFPCT+128
RQHEAD   EQU   GTFPCT+124
EQHEAD   EQU   GTFPCT+120
WPOSTSRB EQU   GTFPCT+116
WTSKTCBA EQU   GTFPCT+112
WRTRTCBA EQU   GTFPCT+108
TRMWTASK EQU   GTFPCT+104
WTSKATTH EQU   GTFPCT+100
WTSKINIT EQU   GTFPCT+96
WTASKECB EQU   GTFPCT+92
WMTABPTR EQU   GTFPCT+88
ATTCHECB EQU   GTFPCT+84
AHLECB   EQU   GTFPCT+80
STOPECBA EQU   GTFPCT+76
ECBADRLT EQU   GTFPCT+72
FIXLEN   EQU   GTFPCT+68
FIXPTR   EQU   GTFPCT+64
INITPTR  EQU   GTFPCT+60
MCQEPTR  EQU   GTFPCT+56
GTFEIDL  EQU   GTFPCT+52
GTFPIBL  EQU   GTFPCT+48
GTFPIFT  EQU   GTFPCT+44
GTFSVCBL EQU   GTFPCT+40
GTFSVCFT EQU   GTFPCT+36
GTFIOBL  EQU   GTFPCT+32
GTFIOFT  EQU   GTFPCT+28
GTFSIOBL EQU   GTFPCT+24
GTFSIOFT EQU   GTFPCT+20
@NM00004 EQU   PCTCATF+1
PCTPIF   EQU   PCTCATF+1
PCTSIOF  EQU   PCTCATF+1
PCTIOF   EQU   PCTCATF+1
PCTSVCF  EQU   PCTCATF+1
PCTRR    EQU   PCTCATF+1
PCTSRM   EQU   PCTCATF+1
PCTRNIO  EQU   PCTCATF+1
PCTUSR   EQU   PCTCATF
PCTPI    EQU   PCTCATF
@NM00003 EQU   PCTCATF
PCTDSP   EQU   PCTCATF
PCTSIO   EQU   PCTCATF
PCTIO    EQU   PCTCATF
PCTEXT   EQU   PCTCATF
PCTSVC   EQU   PCTCATF
OPTRES3  EQU   GTFOPTS4
OPTIOSIO EQU   GTFOPTS3
OPTRES2  EQU   GTFOPTS3
OPTRR    EQU   GTFOPTS3
OPTSRM   EQU   GTFOPTS3
OPTRNIO  EQU   GTFOPTS3
OPTEXT   EQU   GTFOPTS3
OPTIOP   EQU   GTFOPTS2
OPTIO    EQU   GTFOPTS2
OPTPIP   EQU   GTFOPTS2
OPTPI    EQU   GTFOPTS2
OPTSIOP  EQU   GTFOPTS2
OPTSIO   EQU   GTFOPTS2
OPTSVCP  EQU   GTFOPTS2
OPTSVC   EQU   GTFOPTS2
OPTPCI   EQU   GTFOPTS1
OPTRES1  EQU   GTFOPTS1
OPTDSP   EQU   GTFOPTS1
OPTUSR   EQU   GTFOPTS1
OPTSYS   EQU   GTFOPTS1
OPTSYSP  EQU   GTFOPTS1
OPTSYSM  EQU   GTFOPTS1
GTFRESV  EQU   GTFSTAT
GTFMODE  EQU   GTFSTAT
GTFPCTID EQU   GTFPCT
CVTLEVL  EQU   CVTRELNO+2
CVTNUMB  EQU   CVTRELNO
CVTMDL   EQU   CVTFIX+250
@NM00002 EQU   CVTFIX+248
@NM00001 EQU   CVTFIX
CVTRV482 EQU   CVTXTNT2+128
CVTRV481 EQU   CVTXTNT2+124
CVTRV480 EQU   CVTXTNT2+120
CVTRV479 EQU   CVTXTNT2+118
CVTRV478 EQU   CVTXTNT2+117
CVTRV477 EQU   CVTXTNT2+116
CVTRV476 EQU   CVTXTNT2+115
CVTRV475 EQU   CVTXTNT2+114
CVTRV474 EQU   CVTRV466
CVTRV473 EQU   CVTRV466
CVTRV472 EQU   CVTRV466
CVTRV471 EQU   CVTRV466
CVTRV470 EQU   CVTRV466
CVTRV469 EQU   CVTRV466
CVTRV468 EQU   CVTRV466
CVTRV467 EQU   CVTRV466
CVTRV465 EQU   CVTRV457
CVTRV464 EQU   CVTRV457
CVTRV463 EQU   CVTRV457
CVTRV462 EQU   CVTRV457
CVTRV461 EQU   CVTRV457
CVTRV460 EQU   CVTRV457
CVTRV459 EQU   CVTRV457
CVTRV458 EQU   CVTRV457
CVTRV456 EQU   CVTXTNT2+108
CVTRV455 EQU   CVTXTNT2+104
CVTRV454 EQU   CVTXTNT2+100
CVTRV453 EQU   CVTXTNT2+96
CVTRV452 EQU   CVTXTNT2+94
CVTRV451 EQU   CVTXTNT2+92
CVTRV450 EQU   CVTXTNT2+90
CVTRV449 EQU   CVTXTNT2+88
CVTRV448 EQU   CVTXTNT2+87
CVTRV447 EQU   CVTXTNT2+86
CVTRV446 EQU   CVTRV438
CVTRV445 EQU   CVTRV438
CVTRV444 EQU   CVTRV438
CVTRV443 EQU   CVTRV438
CVTRV442 EQU   CVTRV438
CVTRV441 EQU   CVTRV438
CVTRV440 EQU   CVTRV438
CVTRV439 EQU   CVTRV438
CVTRV437 EQU   CVTRV429
CVTRV436 EQU   CVTRV429
CVTRV435 EQU   CVTRV429
CVTRV434 EQU   CVTRV429
CVTRV433 EQU   CVTRV429
CVTRV432 EQU   CVTRV429
CVTRV431 EQU   CVTRV429
CVTRV430 EQU   CVTRV429
CVTRV428 EQU   CVTXTNT2+80
CVTRV427 EQU   CVTXTNT2+76
CVTRV426 EQU   CVTXTNT2+72
CVTRV425 EQU   CVTXTNT2+68
CVTATACT EQU   CVTATCVT
CVTRV423 EQU   CVTXTNT2+62
CVTRV422 EQU   CVTXTNT2+60
CVTRV421 EQU   CVTXTNT2+58
CVTRV420 EQU   CVTXTNT2+56
CVTRV419 EQU   CVTXTNT2+55
CVTRV418 EQU   CVTXTNT2+54
CVTRV417 EQU   CVTRV409
CVTRV416 EQU   CVTRV409
CVTRV415 EQU   CVTRV409
CVTRV414 EQU   CVTRV409
CVTRV413 EQU   CVTRV409
CVTRV412 EQU   CVTRV409
CVTRV411 EQU   CVTRV409
CVTRV410 EQU   CVTRV409
CVTRV408 EQU   CVTRV400
CVTRV407 EQU   CVTRV400
CVTRV406 EQU   CVTRV400
CVTRV405 EQU   CVTRV400
CVTRV404 EQU   CVTRV400
CVTRV403 EQU   CVTRV400
CVTRV402 EQU   CVTRV400
CVTRV401 EQU   CVTRV400
CVTICB   EQU   CVTXTNT2+48
CVTSKTA  EQU   CVTXTNT2+44
CVTCCVT  EQU   CVTXTNT2+40
CVTRSV98 EQU   CVTXTNT2+36
CVTRSV97 EQU   CVTXTNT2+34
CVTRSV96 EQU   CVTXTNT2+32
CVTOLTEP EQU   CVTXTNT2+28
CVTQIDA  EQU   CVTQID+1
CVTRSV95 EQU   CVTQID
CVTRSV94 EQU   CVTXTNT2+20
CVTRSV93 EQU   CVTXTNT2+16
CVTRSV92 EQU   CVTXTNT2+12
CVTDEBVR EQU   CVTXTNT2+8
CVTRSV91 EQU   CVTXTNT2+6
CVTRSV9H EQU   CVTFLGBT
CVTRSV9G EQU   CVTFLGBT
CVTRSV9F EQU   CVTFLGBT
CVTRSV9E EQU   CVTFLGBT
CVTRSV9D EQU   CVTFLGBT
CVTBAH   EQU   CVTFLGBT
CVTVME   EQU   CVTFLGBT
CVTNPE   EQU   CVTFLGBT
CVTNUCLS EQU   CVTXTNT2+4
CVTDSSVA EQU   CVTDSSV+1
CVTRSV89 EQU   CVTDSSV
CVTRSV88 EQU   CVTXTNT1+8
CVTRSV87 EQU   CVTXTNT1+4
CVTFACHN EQU   CVTXTNT1
CVTRV488 EQU   CVTMAP+412
CVTRV487 EQU   CVTMAP+408
CVTRV486 EQU   CVTMAP+404
CVTRV485 EQU   CVTMAP+400
CVTACTAP EQU   CVTMAP+396
CVTAUTH  EQU   CVTMAP+392
CVTRV490 EQU   CVTMAP+388
CVTSU    EQU   CVTMAP+384
CVTVOLT1 EQU   CVTVOLM1+1
CVTVOLI1 EQU   CVTVOLF1
CVTSTOA  EQU   CVTMAP+376
CVTRSV58 EQU   CVTMAP+374
CVTRSV57 EQU   CVTMAP+372
CVTDDCE  EQU   CVTMAP+368
CVTPNWFR EQU   CVTMAP+364
CVTSMF   EQU   CVTMAP+360
CVTSULK  EQU   CVTMAP+358
CVTSLKO  EQU   CVTSYSK
CVTSLKP  EQU   CVTSYSK
CVTSLKQ  EQU   CVTSYSK
CVTSLKR  EQU   CVTSYSK
CVTRSV56 EQU   CVTSYSK
CVTRSV55 EQU   CVTSYSK
CVTRSV54 EQU   CVTSYSK
CVTRSV53 EQU   CVTSYSK
CVTRSV52 EQU   CVTA1F1
CVTRSV51 EQU   CVTA1F1
CVTRSV50 EQU   CVTA1F1
CVTRSV49 EQU   CVTA1F1
CVTRSV48 EQU   CVTA1F1
CVTRSV47 EQU   CVTA1F1
CVTSRSW  EQU   CVTA1F1
CVTPFSW  EQU   CVTA1F1
CVTPCVT  EQU   CVTMAP+352
CVTRSV46 EQU   CVTMAP+344
CVTRSV45 EQU   CVTMAP+340
CVTRSV44 EQU   CVTMAP+338
CVTRSV43 EQU   CVTMAP+336
CVTHJESA EQU   CVTHJES+1
CVTRSV42 EQU   CVTHJES
CVTEXT2A EQU   CVTEXT2+1
CVTRSV41 EQU   CVTEXT2
CVTAPFA  EQU   CVTAPF+1
CVTRSV40 EQU   CVTAPF
CVTRV518 EQU   CVTINTLA
CVTRV517 EQU   CVTERPV
CVTEORM  EQU   CVTMAP+312
CVTMCHPR EQU   CVTMAP+308
CVTTZ    EQU   CVTMAP+304
CVTJEPS  EQU   CVTMAP+300
CVTJESCT EQU   CVTMAP+296
CVTMODE  EQU   CVTMAP+292
CVTPTRV  EQU   CVTMAP+288
CVTREAL  EQU   CVTMAP+284
CVTRSV39 EQU   CVTMAP+280
CVTRSV38 EQU   CVTMAP+276
CVTDMSRA EQU   CVTDMSR+1
CVTRV634 EQU   CVTDMSRF
CVTRV633 EQU   CVTDMSRF
CVTRV632 EQU   CVTDMSRF
CVTRV631 EQU   CVTDMSRF
CVTRV630 EQU   CVTDMSRF
CVTRV629 EQU   CVTDMSRF
CVTUDUMP EQU   CVTDMSRF
CVTSDUMP EQU   CVTDMSRF
CVTQMSGA EQU   CVTQMSG+1
CVTRSV36 EQU   CVTQMSG
CVTAMFF  EQU   CVTMAP+264
CVTPURGA EQU   CVTPURG+1
CVTRSV35 EQU   CVTPURG
CVTCBSP  EQU   CVTMAP+256
CVTATERA EQU   CVTATER+1
CVTSYST  EQU   CVTATER
CVTVOLT2 EQU   CVTTAT
CVTVOLI2 EQU   CVTVOLF2
CVTAQAVB EQU   CVTAQAVT+1
CVTRSV34 EQU   CVTTCMFG
CVTRSV33 EQU   CVTTCMFG
CVTRSV32 EQU   CVTTCMFG
CVTRSV31 EQU   CVTTCMFG
CVTRSV30 EQU   CVTTCMFG
CVTRSV29 EQU   CVTTCMFG
CVTLDEV  EQU   CVTTCMFG
CVTTCRDY EQU   CVTTCMFG
CVTRSV27 EQU   CVTGTFST
CVTRNIO  EQU   CVTGTFST
CVTUSR   EQU   CVTGTFST
CVTRV318 EQU   CVTFORM
CVTRV317 EQU   CVTTMODE
CVTRV316 EQU   CVTSTATE
CVTRV315 EQU   CVTGTFS
CVTGTFAV EQU   CVTGTFS
CVT0SCR1 EQU   CVTMAP+232
CVTRV515 EQU   CVTMAP+228
CVTRMS   EQU   CVTMAP+224
CVTPATCH EQU   CVTMAP+220
CVTTSCE  EQU   CVTMAP+216
CVTLNKSC EQU   CVTMAP+214
CVTQABST EQU   CVTMAP+212
CVTMDLDS EQU   CVTMAP+208
CVTUSER  EQU   CVTMAP+204
CVTABEND EQU   CVTMAP+200
CVTSMCA  EQU   CVTMAP+196
CVTRSV18 EQU   CVTMAP+192
CVTQLPAQ EQU   CVTMAP+188
CVTQCDSR EQU   CVTMAP+184
CVTVS1B  EQU   CVTOPTB
CVTVS1A  EQU   CVTOPTB
CVTFP    EQU   CVTOPTB
CVTAPTHR EQU   CVTOPTB
CVTNLOG  EQU   CVTOPTB
CVTTOD   EQU   CVTOPTB
CVTCTIMS EQU   CVTOPTB
CVTPROT  EQU   CVTOPTB
CVTXPFP  EQU   CVTOPTA
CVTASCII EQU   CVTOPTA
CVTRSV13 EQU   CVTOPTA
CVTPRON  EQU   CVTOPTA
CVTNIP   EQU   CVTOPTA
CVTDDR   EQU   CVTOPTA
CVTAPR   EQU   CVTOPTA
CVTCCH   EQU   CVTOPTA
CVTSNCTR EQU   CVTMAP+180
CVTQMWR  EQU   CVTMAP+176
CVTQOCR  EQU   CVTMAP+172
CVT1EF00 EQU   CVTMAP+168
CVTMZ00  EQU   CVTMAP+164
CVTSV76Q EQU   CVTSV76C
CVTRSV11 EQU   CVTMAP+156
CVT0PT01 EQU   CVTMAP+152
CVTMSER  EQU   CVTMAP+148
CVTRV516 EQU   CVTIERLC
CVTILCH  EQU   CVTMAP+140
CVT0DS   EQU   CVTMAP+136
CVTFBOSV EQU   CVTMAP+132
CVTNUCB  EQU   CVTMAP+128
CVTIXAVL EQU   CVTMAP+124
CVTSV76M EQU   CVTIOQET
CVTDCBA  EQU   CVTMAP+117
CVTMVS2  EQU   CVTDCB
CVT6DAT  EQU   CVTDCB
CVT4MPS  EQU   CVTDCB
CVTRSV09 EQU   CVTDCB
CVT4MS1  EQU   CVTDCB
CVT2SPS  EQU   CVTDCB
CVT1SSS  EQU   CVTDCB
CVTRSV08 EQU   CVTDCB
CVTSTB   EQU   CVTMAP+112
CVTQTD00 EQU   CVTMAP+108
CVTQTE00 EQU   CVTMAP+104
CVTCUCB  EQU   CVTMAP+100
CVTSJQ   EQU   CVTMAP+96
CVTPBLDL EQU   CVTMAP+92
CVTTPC   EQU   CVTMAP+88
CVTSVDCB EQU   CVTMAP+84
CVTBRET  EQU   CVTMAP+82
CVTEXIT  EQU   CVTMAP+80
CVT0FN00 EQU   CVTMAP+76
CVTDARA  EQU   CVTDAR+1
CVTRSV07 EQU   CVTFLGS1
CVTRSV06 EQU   CVTFLGS1
CVTRSV05 EQU   CVTFLGS1
CVTRSV04 EQU   CVTFLGS1
CVTRSV03 EQU   CVTFLGS1
CVTRSV02 EQU   CVTFLGS1
CVTRSV01 EQU   CVTFLGS1
CVTDMPLK EQU   CVTFLGS1
CVTXITP  EQU   CVTMAP+68
CVTZDTAB EQU   CVTMAP+64
CVTMSLT  EQU   CVTMAP+60
CVTDATE  EQU   CVTMAP+56
CVTBTERM EQU   CVTMAP+52
CVTSYSAD EQU   CVTMAP+48
CVTXTLER EQU   CVTMAP+44
CVTILK2  EQU   CVTMAP+40
CVTILK1  EQU   CVTMAP+36
CVTPRLTV EQU   CVTMAP+32
CVTPCNVT EQU   CVTMAP+28
CVT0VL00 EQU   CVTMAP+24
CVTXAPG  EQU   CVTMAP+20
CVTBUF   EQU   CVTMAP+16
CVTJOB   EQU   CVTMAP+12
CVTLINK  EQU   CVTMAP+8
CVT0EF00 EQU   CVTMAP+4
CVTTCBP  EQU   CVTMAP
CVT      EQU   CVTMAP
@NM00047 EQU   PSA+3668
PSASTAK  EQU   PSA+3072
@NM00046 EQU   PSA+2928
PSASTMP  EQU   PSAWTENT+28
PSAWTTCB EQU   PSAWTENT+24
PSATASID EQU   PSAWTENT+22
PSATWCPU EQU   PSAWTENT+20
PSAWTR1  EQU   PSAWTENT+16
PSAWTR0  EQU   PSAWTENT+12
PSAWTR15 EQU   PSAWTENT+8
PSAWTPSW EQU   PSAWTENT
PSASVT   EQU   PSA+2892
PSALSCH2 EQU   PSA+2888
PSALSCH1 EQU   PSA+2884
PSAIOSLH EQU   PSA+2880
PSAIOEPF EQU   PSAEPTAB+60
PSAIOEPE EQU   PSAEPTAB+56
PSAIOEPD EQU   PSAEPTAB+52
PSAIOEPC EQU   PSAEPTAB+48
PSAIOEPB EQU   PSAEPTAB+44
PSAIOEPA EQU   PSAEPTAB+40
PSAIOEP9 EQU   PSAEPTAB+36
PSAIOEP8 EQU   PSAEPTAB+32
PSAIOEP7 EQU   PSAEPTAB+28
PSAIOEP6 EQU   PSAEPTAB+24
PSAIOEP5 EQU   PSAEPTAB+20
PSAIOEP4 EQU   PSAEPTAB+16
PSAIOSRC EQU   PSAEPTAB+12
PSAIOEP3 EQU   PSAEPTAB+8
PSAIOEP2 EQU   PSAEPTAB+4
PSAIOEP1 EQU   PSAEPTAB
@NM00045 EQU   PSA+1432
PSAUSEND EQU   PSA+1432
PSARPEN  EQU   PSARCR0
@NM00044 EQU   PSARCR0
PSAPCPEN EQU   PSAPCCR0
@NM00043 EQU   PSAPCCR0
PSACR0EN EQU   PSACR0SV
@NM00042 EQU   PSACR0SV
PSARV090 EQU   PSA+1418
PSACR0CB EQU   PSA+1417
PSARV092 EQU   PSA+1416
PSARSMGR EQU   PSA+1352
PSARSMSW EQU   PSA+1344
PSALKR15 EQU   PSALKSA+60
PSALKR14 EQU   PSALKSA+56
PSALKR13 EQU   PSALKSA+52
PSALKR12 EQU   PSALKSA+48
PSALKR11 EQU   PSALKSA+44
PSALKR10 EQU   PSALKSA+40
PSALKR9  EQU   PSALKSA+36
PSALKR8  EQU   PSALKSA+32
PSALKR7  EQU   PSALKSA+28
PSALKR6  EQU   PSALKSA+24
PSALKR5  EQU   PSALKSA+20
PSALKR4  EQU   PSALKSA+16
PSALKR3  EQU   PSALKSA+12
PSALKR2  EQU   PSALKSA+8
PSALKR1  EQU   PSALKSA+4
PSALKR0  EQU   PSALKSA
PSASLSA  EQU   PSA+1208
PSALCR10 EQU   PSA+1204
PSALCR9  EQU   PSA+1200
PSALCR8  EQU   PSA+1196
PSALCR7  EQU   PSA+1192
PSALCR6  EQU   PSA+1188
PSASTNSM EQU   PSA+1187
PSAMODES EQU   PSA+1186
PSARV072 EQU   PSA+1184
@NM00041 EQU   PSAMODE
PSAPSRBM EQU   PSAMODE
@NM00040 EQU   PSAMODE
@NM00039 EQU   PSAMODEW
PSARV071 EQU   PSA+1176
PSASCRG2 EQU   PSA+1172
PSASCRG1 EQU   PSA+1168
PSAFPSVS EQU   PSA+1160
PSAFPSVE EQU   PSA+1152
PSAFPSAV EQU   PSA+1144
PSACPUT  EQU   PSA+1136
PSAPSWSV EQU   PSA+1128
PSAGSAV  EQU   PSA+1064
PSASMPSW EQU   PSA+1056
PSASCPSW EQU   PSA+1048
PSARV062 EQU   PSA+1044
PSACDAL  EQU   PSA+1040
PSAWTCOD EQU   PSA+1036
PSAATCVT EQU   PSA+1032
PSAPCPSW EQU   PSA+1024
PSAPIR2  EQU   PSA+1020
PSARV070 EQU   PSA+1019
PSATROFF EQU   PSATRACE
PSARV069 EQU   PSATRACE
PSARV068 EQU   PSATRACE
PSARV067 EQU   PSATRACE
PSARV066 EQU   PSATRACE
PSARV065 EQU   PSATRACE
PSARV064 EQU   PSATRACE
PSARV063 EQU   PSATRACE
PSASVC13 EQU   PSA+1016
PSALSFCC EQU   PSA+1012
PSASFACC EQU   PSA+1008
PSASTOP  EQU   PSA+992
PSASTART EQU   PSA+976
PSARSPSW EQU   PSA+968
PSASRPSW EQU   PSA+960
PSARV045 EQU   PSA+892
PSARV044 EQU   PSA+888
PSARV043 EQU   PSA+884
PSARV042 EQU   PSA+880
PSARV041 EQU   PSA+876
PSARV040 EQU   PSA+872
PSARV025 EQU   PSA+868
PSADSSED EQU   PSA+868
PSADSSPR EQU   PSA+864
PSADSSFW EQU   PSA+860
PSADSS14 EQU   PSA+856
PSADSSPP EQU   PSA+848
PSADSSRP EQU   PSA+840
PSADSS05 EQU   PSADSSF4
PSADSS10 EQU   PSADSSF4
PSADSSVE EQU   PSADSSF4
PSADSSDE EQU   PSADSSF4
PSADSSC0 EQU   PSADSSF4
PSADSSIE EQU   PSADSSF4
PSADSS12 EQU   PSADSSF4
PSADSSRC EQU   PSADSSF4
PSARV057 EQU   PSADSSF3
PSARV056 EQU   PSADSSF3
PSARV055 EQU   PSADSSF3
PSADSSMC EQU   PSADSSF3
PSADSSRW EQU   PSADSSF3
PSADSSNM EQU   PSADSSF3
PSADSSES EQU   PSADSSF3
PSADSSGP EQU   PSADSSF3
PSADSSF2 EQU   PSADSSFL+1
PSADSSPI EQU   PSADSSF1
PSADSSOI EQU   PSADSSF1
PSADSSSP EQU   PSADSSF1
PSADSSTP EQU   PSADSSF1
PSADSSDW EQU   PSADSSF1
PSADSSDD EQU   PSADSSF1
PSADSSDM EQU   PSADSSF1
PSADSSMV EQU   PSADSSF1
PSADSSTS EQU   PSA+816
PSADSSWK EQU   PSA+812
PSADSSR3 EQU   PSA+808
PSADSSR2 EQU   PSA+804
PSADSSRS EQU   PSA+800
PSASTOR  EQU   PSA+796
PSAVSTAP EQU   PSA+792
PSAWKVAP EQU   PSA+788
PSAWKRAP EQU   PSA+784
PSAMCHIC EQU   PSA+783
PSAACTCD EQU   PSA+782
PSASYMSK EQU   PSA+781
PSAMCHFL EQU   PSA+780
PSACR0   EQU   PSA+776
PSASVPSW EQU   PSA+768
PSALITA  EQU   PSA+764
PSALCLLI EQU   PSACLHS4
PSACMSLI EQU   PSACLHS4
PSASRMLI EQU   PSACLHS4
PSATPALI EQU   PSACLHS4
PSATPDLI EQU   PSACLHS4
PSATPNLI EQU   PSACLHS4
PSAIOLLI EQU   PSACLHS4
PSAIOULI EQU   PSACLHS4
PSAIOCLI EQU   PSACLHS3
PSAIOSLI EQU   PSACLHS3
PSASALLI EQU   PSACLHS3
PSAASMLI EQU   PSACLHS3
PSADSPLI EQU   PSACLHS3
PSARV075 EQU   PSACLHS3
PSARV074 EQU   PSACLHS3
PSARV073 EQU   PSACLHS3
PSACLHS2 EQU   PSACLHS+1
PSACLHS1 EQU   PSACLHS
PSALCPUA EQU   PSA+756
PSACMSLK EQU   PSA+752
PSARV089 EQU   PSA+748
PSARV088 EQU   PSA+744
PSARV087 EQU   PSA+740
PSARV086 EQU   PSA+736
PSARV085 EQU   PSA+732
PSARV084 EQU   PSA+728
PSARV083 EQU   PSA+724
PSARV082 EQU   PSA+720
PSARV081 EQU   PSA+716
PSARV080 EQU   PSA+712
PSARV079 EQU   PSA+708
PSARV078 EQU   PSA+704
PSARV077 EQU   PSA+700
PSARV076 EQU   PSA+696
PSARLOCK EQU   PSACLHT+52
PSALOCAL EQU   PSACLHT+48
PSACMSL  EQU   PSACLHT+44
PSAOPTL  EQU   PSACLHT+40
PSATPACL EQU   PSACLHT+36
PSATPDNL EQU   PSACLHT+32
PSATPNCL EQU   PSACLHT+28
PSAIOSLL EQU   PSACLHT+24
PSAIOSUL EQU   PSACLHT+20
PSAIOSCL EQU   PSACLHT+16
PSAIOSSL EQU   PSACLHT+12
PSASALCL EQU   PSACLHT+8
PSAASML  EQU   PSACLHT+4
PSADISPL EQU   PSACLHT
PSASRSA  EQU   PSA+636
PSARV050 EQU   PSA+634
PSADSSGO EQU   PSA+633
PSARECUR EQU   PSA+632
PSAHLHIS EQU   PSA+628
PSAIPCSA EQU   PSA+624
@NM00038 EQU   PSA+621
PSAIPCDM EQU   PSA+620
PSAIPCD  EQU   PSA+616
@NM00037 EQU   PSA+613
PSAIPCRM EQU   PSA+612
PSAIPCR  EQU   PSA+608
PSAMCHEX EQU   PSA+600
PSAMPSW  EQU   PSA+592
PSAEXPS2 EQU   PSA+584
PSAEXPS1 EQU   PSA+576
PSAPIREG EQU   PSA+572
PSARSREG EQU   PSA+568
PSAGPREG EQU   PSA+556
PSARV022 EQU   PSASUP4
PSARV021 EQU   PSASUP4
PSARV020 EQU   PSASUP4
PSARV019 EQU   PSASUP4
PSARV018 EQU   PSASUP4
PSARV017 EQU   PSASUP4
PSARV016 EQU   PSASUP4
PSARV015 EQU   PSASUP4
PSARV014 EQU   PSASUP3
PSARV013 EQU   PSASUP3
PSARSM   EQU   PSASUP3
PSAESTA  EQU   PSASUP3
PSASPR   EQU   PSASUP3
PSAPSREG EQU   PSASUP3
PSAPI2   EQU   PSASUP3
PSAIOSUP EQU   PSASUP3
PSALCR   EQU   PSASUP2
PSARTM   EQU   PSASUP2
PSAACR   EQU   PSASUP2
PSAIPCE2 EQU   PSASUP2
PSAIPCES EQU   PSASUP2
PSAIPCEC EQU   PSASUP2
PSAGTF   EQU   PSASUP2
PSAIPCRI EQU   PSASUP2
PSATYPE6 EQU   PSASUP1
PSATCTL  EQU   PSASUP1
PSADISP  EQU   PSASUP1
PSALOCK  EQU   PSASUP1
PSAPI    EQU   PSASUP1
PSAEXT   EQU   PSASUP1
PSASVC   EQU   PSASUP1
PSAIO    EQU   PSASUP1
PSAANEW  EQU   PSA+544
PSATOLD  EQU   PSA+540
PSATNEW  EQU   PSA+536
PSALCCAR EQU   PSA+532
PSAPCCAR EQU   PSA+524
PSAPCCAV EQU   PSA+520
PSACPULA EQU   PSA+518
PSACPUPA EQU   PSA+516
PSAPSA   EQU   PSA+512
FLCHDEND EQU   PSA+512
FLCCRSAV EQU   FLCMCLA+280
FLCGRSAV EQU   FLCMCLA+216
FLCFPSAV EQU   FLCMCLA+184
FLCFLA   EQU   FLCMCLA+88
FLCRGNCD EQU   FLCMCLA+84
FLCFSAA  EQU   FLCFSA+1
@NM00036 EQU   FLCFSA
@NM00035 EQU   FLCMCLA+77
PSAMDISC EQU   PSAMEDC
PSAMINTR EQU   PSAMEDC
PSAMINST EQU   PSAMEDC
PSAMCCF  EQU   PSAMEDC
PSAMCNOP EQU   PSAMEDC
PSAMEXSR EQU   PSAMEDC
PSAMCOPR EQU   PSAMEDC
@NM00034 EQU   PSAMEDC
@NM00033 EQU   FLCMCLA+72
FLCMCIC  EQU   FLCMCLA+64
@NM00032 EQU   FLCMCLA+20
FLCIOAA  EQU   FLCIOA+1
@NM00031 EQU   FLCIOA
@NM00030 EQU   FLCMCLA+15
@NM00029 EQU   FLCMCLA+14
@NM00028 EQU   FLCMCLA+12
FLCLCL   EQU   FLCMCLA+8
FLCIOELA EQU   FLCIOEL+1
@NM00027 EQU   FLCIOEL
FLCCHIL  EQU   FLCCHNID+2
FLCCHMOD EQU   FLCCHTM
FLCCHTYP EQU   FLCCHTM
PSAMPL   EQU   PSA+164
@NM00026 EQU   PSA+160
FLCMTRCD EQU   PSA+157
@NM00025 EQU   PSA+156
FLCPERA  EQU   FLCPER+1
@NM00024 EQU   FLCPER
@NM00023 EQU   PSA+151
FLCPERCD EQU   PSA+150
FLCMCNUM EQU   PSA+149
@NM00022 EQU   PSA+148
FLCTEAA  EQU   FLCTEA+1
@NM00021 EQU   FLCTEA
PSAPIPC  EQU   PSAPICOD
PSAPIMC  EQU   PSAPICOD
PSAPIPER EQU   PSAPICOD
PSARV049 EQU   FLCPICOD
FLCPILCB EQU   FLCPIILC
@NM00020 EQU   FLCPIILC
@NM00019 EQU   PSAEPPSW
FLCSVCN  EQU   PSAESPSW+2
FLCSILCB EQU   FLCSVILC
@NM00018 EQU   FLCSVILC
@NM00017 EQU   PSAESPSW
FLCEICOD EQU   PSAEEPSW+2
PSASPAD  EQU   PSAEEPSW
@NM00016 EQU   PSA+128
FLCINPSW EQU   PSA+120
FLCMNPSW EQU   PSA+112
FLCPNPSW EQU   PSA+104
FLCSNPSW EQU   PSA+96
FLCENPSW EQU   PSA+88
FLCTRACE EQU   PSA+84
FLCTIMER EQU   PSA+80
FLCCVT2  EQU   PSA+76
FLCCAW   EQU   PSA+72
FLCCSW   EQU   PSA+64
FLCIOPSW EQU   PSA+56
FLCMOPSW EQU   PSA+48
FLCSOPSW EQU   PSA+32
FLCEOPSW EQU   PSA+24
PSAPSAVA EQU   FLCICCW2+4
FLCCVT   EQU   FLCICCW2
FLCICCW1 EQU   FLCROPSW
FLCIPPSW EQU   FLCRNPSW
*                                      END UNREFERENCED COMPONENTS
@RT00095 EQU   COMUEXIT
@RT00104 EQU   SNOJBNM
@RT00126 EQU   COMUEXIT
@RT00148 EQU   FNOJBNM
@RT00189 EQU   COMUEXIT
@RT00197 EQU   ENOJBNM
@RT00271 EQU   COMUEXIT
@RT00280 EQU   RNOJBNM
@RT00290 EQU   AHLHALT
@RC00356 EQU   @RC00354
@RF00381 EQU   @RC00374
@RT00408 EQU   UNRECERR
@RT00438 EQU   UNRECERR
@RC00422 EQU   @RC00421
@RF00478 EQU   UNRECERR
@RC00465 EQU   @RC00451
@RC00452 EQU   @RC00451
@RT00509 EQU   UNRECERR
@RC00493 EQU   @RC00492
@RF00492 EQU   UNRECERR
@PB00002 EQU   @PB00003
@ENDDATA EQU   *
         END   AHLTFOR,(C'PLS2346',0701,77252)
