         TITLE 'TASK MONITOR MESSAGE CSECT                             *
                       '
AHLTMMSG CSECT ,                                                   0001
@PROLOG  STM   @14,@12,12(@13)                                     0001
         BALR  @12,0                                               0001
@PSTART  DS    0H                                                  0001
         USING @PSTART,@12                                         0001
*   END AHLTMMSG;                                                  0010
@EL00001 DS    0H                                                  0010
@EF00001 DS    0H                                                  0010
@ER00001 LM    @14,@12,12(@13)                                     0010
         BR    @14                                                 0010
@DATA    DS    0H
         DS    0F
         DS    0F
         DS    0D
AHL006   DS    CL45
         ORG   AHL006
AHL00601 DC    H'41'
AHL00602 DC    B'1000000000000000'
AHL00603 DC    CL37'AHL006I GTF ACKNOWLEDGES STOP COMMAND'
AHL00604 DC    B'0001000000000000'
AHL00605 DC    B'0100000000100000'
         ORG   AHL006+45
         DS    CL3
AHL007   DS    CL50
         ORG   AHL007
AHL00701 DC    H'46'
AHL00702 DC    B'1000000000000000'
AHL00703 DC    CL42'AHL007I GTF TERMINATING ON ERROR CONDITION'
AHL00704 DC    B'0001000000000000'
AHL00705 DC    B'0100000000100000'
         ORG   AHL007+50
         DS    CL2
AHL015   DS    CL42
         ORG   AHL015
AHL01501 DC    H'38'
AHL01502 DC    B'1000000000000000'
AHL01503 DC    CL34'AHL015I ESTAE REQUEST UNSUCCESSFUL'
AHL01504 DC    B'0001000000000000'
AHL01505 DC    B'0100000000100000'
         ORG   AHL015+42
         DS    CL2
AHL016   DS    CL47
         ORG   AHL016
AHL01601 DC    H'43'
AHL01602 DC    B'1000000000000000'
AHL01603 DC    CL39'AHL016I GTF INITIALIZATION UNSUCCESSFUL'
AHL01604 DC    B'0001000000000000'
AHL01605 DC    B'0100000000100000'
         ORG   AHL016+47
         DS    CL1
AHL018   DS    CL76
         ORG   AHL018
AHL01801 DC    AL1(0)
AHL01802 DC    AL3(0)
AHL01803 DC    A(0)
AHL01804 DC    H'64'
AHL01805 DC    B'1000000000000000'
AHL01806 DC    CL60'AHL018A GTF UNABLE TO INITIALIZE ON ALL CPUS, REPLYC
                U OR END'
AHL01807 DC    B'0100000000000000'
AHL01808 DC    B'0100000000100000'
         ORG   AHL018+76
AHL019   DS    CL57
         ORG   AHL019
AHL01901 DC    H'53'
AHL01902 DC    B'1000000000000000'
AHL01903 DC    CL49'AHL019I SETEVENT SERVICE FAILED. RETURN CODE =   '
AHL01904 DC    B'0001000000000000'
AHL01905 DC    B'0100000000100000'
         ORG   AHL019+57
         DS    CL3
AHL031   DS    CL43
         ORG   AHL031
AHL03101 DC    H'39'
AHL03102 DC    B'1000000000000000'
AHL03103 DC    CL35'AHL031I GTF INITIALIZATION COMPLETE'
AHL03104 DC    B'0001000000000000'
AHL03105 DC    B'0100000000100000'
         ORG   AHL031+43
         DS    CL1
AHL130   DS    CL61
         ORG   AHL130
AHL13001 DC    H'57'
AHL13002 DC    B'1000000000000000'
AHL13003 DC    CL53'AHL130I INSUFFICIENT STORAGE FOR TRACE INITIALIZATIC
               ON'
AHL13004 DC    B'0001000000000000'
AHL13005 DC    B'0100000000100000'
         ORG   AHL130+61
@00      EQU   00                      EQUATES FOR REGISTERS 0-15
@01      EQU   01
@02      EQU   02
@03      EQU   03
@04      EQU   04
@05      EQU   05
@06      EQU   06
@07      EQU   07
@08      EQU   08
@09      EQU   09
@10      EQU   10
@11      EQU   11
@12      EQU   12
@13      EQU   13
@14      EQU   14
@15      EQU   15
         ENTRY AHL130
         ENTRY AHL031
         ENTRY AHL019
         ENTRY AHL018
         ENTRY AHL016
         ENTRY AHL015
         ENTRY AHL007
         ENTRY AHL006
@ENDDATA EQU   *
         END   AHLTMMSG,(C'PL/S-II',0502,73240)
