)F       FUNCTION -
               LOCD DISPLAYS WHERE A DATA SET IS CATALOGED
                    AND LISTS ALL MOUNTED DIRECT ACCESS
                    VOLUMES ON WHICH THE DATA SET RESIDES.
)X       SYNTAX -
               LOCD 'DSNAME'
)O       OPERANDS:
               DSNAME - THE DATA SET NAME YOU WISH TO LOCATE
                        USING STANDARD TSO NAMING CONVENTIONS.

         EXAMPLES:
               LOCD MYPROG.ASM
               LOCD 'SYS1.HELP'
