)PANEL KEYLIST (ISRHLP2 ISR)
)ATTR
  Ö TYPE(TEXT)    INTENS(LOW)  COLOR(YELLOW)
  ! TYPE(TEXT)    INTENS(LOW)  COLOR(WHITE)
  + TYPE(TEXT)    INTENS(LOW)  COLOR(GREEN)
  @ TYPE(TEXT)    INTENS(LOW)  COLOR(TURQ)
  # AREA(SCRL) EXTEND(ON)
)BODY EXPAND(¼¼) DEFAULT($|_)
ÖMXI - HELP - CPU Command ----------------------------------------------
!Option ===>_ZCMD
#MXIHAREA
#
#
#
#
#
#
#
#
#
#
#
#
#
#
+
)AREA MXIHAREA
!Function
+  Displays information concerning the CPU configuration.
+
!Command Syntax
+ @CPU+
+
!Output Panel Fields
+  The display is split into three main sections
+
!Processor Information
+ @CPU Model        +- The model number of the processor
+ @CPU Type Code    +- The model type of the processor
+ @Physical CPUs    +- The number of physical CPUs on the processor incl
+                   +  those offline to this MVS image.
+
!Online Main Storage Information
+ @Real             +- The amount of real storage online (in Mb)
+ @Expanded         +- The amount of expanded storage online (in Mb)
+
!Logical Partition Information
+ @Configured LPARs +- The number of logical partitions defined
+ @Time Slice       +- The CPU time slice value from the LPAR definition

+ @LPAR Name        +- The name of the logical partition
+ @LPAR Number      +- The number of the logical partition
+ @Logical CPUs     +- The number of the logical CPUs available to this
+                   +  partition
+ @Relative Share   +- The relative share of CPU resources available to
+                   +  logical partition
+ @Capped           +- If the logical partition is capped (Yes/No)
+ @Wait to Complete +- If the wait completion has be turned on in the lo
+ @                 +  partition definition (Yes/No)
)INIT
.ATTRCHAR(Ö)  = 'COLOR(&M7CC) HILITE(&M7CH) INTENS(&M7CI)'
.ATTRCHAR(!)  = 'COLOR(&M08C) HILITE(&M08H) INTENS(&M08I)'
.ATTRCHAR(+)  = 'COLOR(&M06C) HILITE(&M06H) INTENS(&M06I)'
.ATTRCHAR(@)  = 'COLOR(&M09C) HILITE(&M09H) INTENS(&M09I)'
)PROC
 &ZUP   = MXIHTOC
 &ZCONT = MXIHCS0
)END
