)PANEL KEYLIST (ISRHLP2 ISR)
)ATTR
  Ö TYPE(TEXT)    INTENS(LOW)  COLOR(YELLOW)
  ! TYPE(TEXT)    INTENS(LOW)  COLOR(WHITE)
  + TYPE(TEXT)    INTENS(LOW)  COLOR(GREEN)
  @ TYPE(TEXT)    INTENS(LOW)  COLOR(TURQ)
  # AREA(SCRL) EXTEND(ON)
)BODY EXPAND(¼¼) DEFAULT($|_)
ÖMXI - HELP - LPD Command ----------------------------------------------
!Option ===>_ZCMD
#MXIHAREA
#
#
#
#
#
#
#
#
#
#
#
#
#
#
+
)AREA MXIHAREA
!Function
+  Displays the current Link Pack Directory entries (LPA Modules).
+
!Command Syntax
+ @LPD mod-mask+
+
!Keywords      +
  @mod-mask    +An optional masking pattern that can be used to filter t
               +displayed list on all or part of the module name.
               +The wildcard character of '*' and a placeholder characte
               +can be used. The default value of mod-mask is '*'.
+
!Example
+ @LPD IGC*  +  List all LPA Modules starting with 'IGC'.
+
!Output Panel Fields
  @Module Name    +- Name of the LPA module
  @Major Name     +- When non-blank, this entry is a minor LPDE and this
                  +  contains the name of the corresponding major LPDE
  @Entry Point    +- Entry point address of the module
  @Location       +- Storage location of the module
  @Length         +- Length of the module
  @AC             +- Authorisation code of the module (00/01)
  @APF            +- Was module loaded from an APF authorised dataset (A
  @Rent           +- Is module Re-entrant (Rent/No)
  @Rent           +- Is module Re-usable (Reus/No)
  @Active LPA     +- Is module on the active LPA queue -MLPA- (Yes/No)
+
)INIT
.ATTRCHAR(Ö)  = 'COLOR(&M7CC) HILITE(&M7CH) INTENS(&M7CI)'
.ATTRCHAR(!)  = 'COLOR(&M08C) HILITE(&M08H) INTENS(&M08I)'
.ATTRCHAR(+)  = 'COLOR(&M06C) HILITE(&M06H) INTENS(&M06I)'
.ATTRCHAR(@)  = 'COLOR(&M09C) HILITE(&M09H) INTENS(&M09I)'
)PROC
 &ZUP   = MXIHTOC
 &ZCONT = MXIHMCL0
)END
