)PANEL KEYLIST (ISRHLP2 ISR)
)ATTR
  Ö TYPE(TEXT)    INTENS(LOW)  COLOR(YELLOW)
  ! TYPE(TEXT)    INTENS(LOW)  COLOR(WHITE)
  + TYPE(TEXT)    INTENS(LOW)  COLOR(GREEN)
  @ TYPE(TEXT)    INTENS(LOW)  COLOR(TURQ)
  # AREA(SCRL) EXTEND(ON)
)BODY EXPAND(¼¼) DEFAULT($|_)
ÖMXI - HELP - LLSU Command ---------------------------------------------
!Option ===>_ZCMD
#MXIHAREA
#
#
#
#
#
#
#
#
#
#
#
#
#
#
+
)AREA MXIHAREA
!Function
+  Displays the Linklist set usage by address space
+
!Command Syntax
+ @LLSU job-mask LLS(name)
+
!Keywords      +
  @job-mask    +An optional masking pattern that can be used to filter t
               +displayed list on all or part of the address space name.
               +The wildcard character of '*' and a placeholder characte
               +can be used.
               +The default value for job-mask is '*'.
  @LLS(name)   +An optional keyword that limits the display to only incl
               +address spaces that are using Linklist set 'name'.
+
!Examples
+ @LLSU CIC*            + List the Linklist sets for all jobs starting '
+ @LLSU IMS* LLS(MYLLS) + List all jobs starting 'IMS' that use the 'MYL
                        + Linklist set.
+
!Considerations
  +The LLS keyword must specify the entire Linklist set name - wildcards
  +be specified.
+
!Output Panel Fields
  @Address Space    +- The name of the address space
  @JES JobID        +- JES assigned job identifier
  @ASID Dec         +- Decimal address space identifier
  @ASID Hex         +- Hexadecimal address space identifier
  @ASCB Address     +- Address of the ASCB control block for this addres
  @ASSB Address     +- Address of the ASSB control block for this addres
  @Linklist Set     +- Linklist set name used by this address space
  @DLCB Address     +- Address of the DLCB control block
+
)INIT
.ATTRCHAR(Ö)  = 'COLOR(&M7CC) HILITE(&M7CH) INTENS(&M7CI)'
.ATTRCHAR(!)  = 'COLOR(&M08C) HILITE(&M08H) INTENS(&M08I)'
.ATTRCHAR(+)  = 'COLOR(&M06C) HILITE(&M06H) INTENS(&M06I)'
.ATTRCHAR(@)  = 'COLOR(&M09C) HILITE(&M09H) INTENS(&M09I)'
)PROC
 &ZUP   = MXIHTOC
 &ZCONT = MXIHLPA0
)END
