)PANEL KEYLIST (ISRHLP2 ISR)
)ATTR
  Ö TYPE(TEXT)    INTENS(LOW)  COLOR(YELLOW)
  ! TYPE(TEXT)    INTENS(LOW)  COLOR(WHITE)
  + TYPE(TEXT)    INTENS(LOW)  COLOR(GREEN)
  @ TYPE(TEXT)    INTENS(LOW)  COLOR(TURQ)
  # AREA(SCRL) EXTEND(ON)
)BODY EXPAND(¼¼) DEFAULT($|_)
ÖMXI - HELP - RS Command -----------------------------------------------
!Option ===>_ZCMD
#MXIHAREA
#
#
#
#
#
#
#
#
#
#
#
#
#
#
+
)AREA MXIHAREA
!Function
+  Displays the current real storage usage by address space. This comman
+  also shows the auxiliary storage slot usage.
+
!Command Syntax
+ @RS mask+
+
!Keywords
+  The value of 'mask' can be used to limit the display based on all or
+  the job name
+  A wildcard character of '*' and a placeholder character of '%'+can be
+  The default value for mask is '*'+
+
!Example
+ @RS CIC*   +  - List real storage usage for all jobs starting 'CIC'
+
!Output Panel Fields
  @Address Space   +- The address space name
  @ASID Hex        +- The hexadecimal ASID
  @Real Frames     +- The number of real storage frames used
  @Expand Frames   +- The number of expanded storage frames used
  @Working Set(K)  +- The working set size in kilobytes
  @Fixed Frames    +- The number of fixed frames used
  @Non-VIO         +- The number of auxiliary storage slots (non-VIO) us
  @Data Space      +- The number of user key dataspace blocks (4K)
  @Hiper Space     +- The number of hiperspace pages in expanded storage
+
)INIT
.ATTRCHAR(Ö)  = 'COLOR(&M7CC) HILITE(&M7CH) INTENS(&M7CI)'
.ATTRCHAR(!)  = 'COLOR(&M08C) HILITE(&M08H) INTENS(&M08I)'
.ATTRCHAR(+)  = 'COLOR(&M06C) HILITE(&M06H) INTENS(&M06I)'
.ATTRCHAR(@)  = 'COLOR(&M09C) HILITE(&M09H) INTENS(&M09I)'
)PROC
 &ZUP   = MXIHTOC
 &ZCONT = MXIHSCL0
)END
