)ATTR
 01 TYPE(DATAOUT) INTENS(LOW)  CAPS(OFF) COLOR(WHITE)
 02 TYPE(DATAOUT) INTENS(LOW)  CAPS(OFF) COLOR(BLUE)
 03 TYPE(DATAOUT) INTENS(LOW)  CAPS(OFF) COLOR(RED)
 04 TYPE(DATAOUT) INTENS(LOW)  CAPS(OFF) COLOR(YELLOW)
 05 TYPE(DATAOUT) INTENS(LOW)  CAPS(OFF) COLOR(TURQ)
 06 TYPE(DATAOUT) INTENS(LOW)  CAPS(OFF) COLOR(GREEN)
 07 TYPE(DATAOUT) INTENS(LOW)  CAPS(OFF) COLOR(BLUE)
 08 TYPE(DATAOUT) INTENS(LOW)  CAPS(OFF) COLOR(WHITE)
 09 TYPE(DATAOUT) INTENS(LOW)  CAPS(OFF) COLOR(TURQ)
 10 TYPE(DATAOUT) INTENS(HIGH) CAPS(OFF) COLOR(YELLOW) PAS(ON)
 11 TYPE(DATAOUT) INTENS(HIGH) CAPS(OFF) COLOR(TURQ)   PAS(ON)
 12 TYPE(DATAOUT) INTENS(HIGH) CAPS(OFF) COLOR(YELLOW) PAS(ON)
 13 TYPE(DATAOUT) INTENS(HIGH) CAPS(OFF) COLOR(GREEN)  PAS(ON)
 14 TYPE(DATAOUT) INTENS(HIGH) CAPS(OFF) COLOR(YELLOW) PAS(ON)
 15 TYPE(DATAOUT) INTENS(HIGH) CAPS(OFF) COLOR(YELLOW) PAS(ON)
 16 TYPE(DATAOUT) INTENS(HIGH) CAPS(OFF) COLOR(YELLOW) PAS(ON)
 17 TYPE(DATAOUT) INTENS(HIGH) CAPS(OFF) COLOR(YELLOW) PAS(ON)
 18 TYPE(DATAOUT) INTENS(HIGH) CAPS(OFF) COLOR(YELLOW) PAS(ON)
 19 TYPE(DATAOUT) INTENS(HIGH) CAPS(OFF) COLOR(YELLOW) PAS(ON)
 1A TYPE(DATAOUT) INTENS(HIGH) CAPS(OFF) COLOR(YELLOW) PAS(ON)
 20 TYPE(CHAR)    INTENS(HIGH) CAPS(OFF) COLOR(WHITE)
 21 TYPE(DATAOUT) INTENS(HIGH) CAPS(OFF) COLOR(YELLOW) PAS(ON)
 22 TYPE(DATAOUT) INTENS(HIGH) CAPS(OFF) COLOR(YELLOW) PAS(ON)
 23 TYPE(DATAOUT) INTENS(HIGH) CAPS(OFF) COLOR(YELLOW) PAS(ON)
 24 TYPE(DATAOUT) INTENS(HIGH) CAPS(OFF) COLOR(YELLOW) PAS(ON)
 25 TYPE(DATAOUT) INTENS(HIGH) CAPS(OFF) COLOR(YELLOW) PAS(ON)
 26 TYPE(DATAOUT) INTENS(HIGH) CAPS(OFF) COLOR(TURQ)   PAS(ON)
 27 TYPE(DATAOUT) INTENS(HIGH) CAPS(OFF) COLOR(YELLOW) PAS(ON)
 28 TYPE(DATAOUT) INTENS(HIGH) CAPS(OFF) COLOR(YELLOW) PAS(ON)
 29 TYPE(DATAOUT) INTENS(HIGH) CAPS(OFF) COLOR(YELLOW) PAS(ON)
 30 TYPE(DATAOUT) INTENS(HIGH) CAPS(OFF) COLOR(YELLOW) PAS(ON)
  Ö TYPE(OUTPUT)  INTENS(LOW)  CAPS(OFF) COLOR(YELLOW)
  @ TYPE(OUTPUT)  INTENS(LOW)  CAPS(OFF) COLOR(WHITE)
  ! TYPE(OUTPUT)  INTENS(LOW)  CAPS(OFF) COLOR(BLUE)
  $ TYPE(TEXT)    INTENS(LOW)  CAPS(OFF) COLOR(WHITE)
  # AREA(DYNAMIC) EXTEND(ON) SCROLL(ON)
)BODY EXPAND({{)
ÖMXILNE
$Command ===>_MXICMD                                         +$Scroll ==
!MXILB1
#MXIBUF,MXISHDW ---------------{-{--------------------------------------
)INIT
VGET (M7CC M7CH M7CI) PROFILE
VGET (M08C M08H M08I) PROFILE
VGET (M05C M05H M05I) PROFILE
VGET (M07C M07H M07I) PROFILE
VGET (M06C M06H M06I) PROFILE
VGET (M04C M04H M04I) PROFILE
VGET (M03C M03H M03I) PROFILE
VGET (M09C M09H M09I) PROFILE
VGET (M11C M11H M11I) PROFILE
VGET (M12C M12H M12I) PROFILE
VGET (M13C M13H M13I) PROFILE
VGET (M20C M20H M20I) PROFILE
VGET (M000) PROFILE
IF (&M7CC = &Z) &M7CC = YELLOW
IF (&M08C = &Z) &M08C = WHITE
IF (&M05C = &Z) &M05C = TURQ
IF (&M07C = &Z) &M07C = BLUE
IF (&M06C = &Z) &M06C = GREEN
IF (&M04C = &Z) &M04C = YELLOW
IF (&M03C = &Z) &M03C = RED
IF (&M09C = &Z) &M09C = TURQ
IF (&M11C = &Z) &M11C = TURQ
IF (&M12C = &Z) &M12C = GREEN
IF (&M13C = &Z) &M13C = YELLOW
IF (&M20C = &Z) &M20C = WHITE
IF (&M7CI = &Z) &M7CI = LOW
IF (&M08I = &Z) &M08I = LOW
IF (&M05I = &Z) &M05I = LOW
IF (&M07I = &Z) &M07I = LOW
IF (&M06I = &Z) &M06I = LOW
IF (&M04I = &Z) &M04I = LOW
IF (&M03I = &Z) &M03I = LOW
IF (&M09I = &Z) &M09I = LOW
IF (&M11I = &Z) &M11I = HIGH
IF (&M12I = &Z) &M12I = HIGH
IF (&M13I = &Z) &M13I = HIGH
IF (&M20I = &Z) &M20I = LOW
IF (&M000 = &Z)
  &M11H = USCORE
  &M12H = USCORE
  &M13H = USCORE
  &M20H = REVERSE
  &M000 = DONE
.ATTRCHAR(Ö)  = 'COLOR(&M7CC) HILITE(&M7CH) INTENS(&M7CI)'
.ATTRCHAR(@)  = 'COLOR(&M08C) HILITE(&M08H) INTENS(&M08I)'
.ATTRCHAR(01) = 'COLOR(&M08C) INTENS(&M08I)'
.ATTRCHAR(03) = 'COLOR(&M03C) HILITE(&M03H) INTENS(&M03I)'
.ATTRCHAR(04) = 'COLOR(&M04C) HILITE(&M04H) INTENS(&M04I)'
.ATTRCHAR(05) = 'COLOR(&M05C) HILITE(&M05H) INTENS(&M05I)'
.ATTRCHAR(06) = 'COLOR(&M06C) HILITE(&M06H) INTENS(&M06I)'
.ATTRCHAR(07) = 'COLOR(&M07C) HILITE(&M07H) INTENS(&M07I)'
.ATTRCHAR(08) = 'COLOR(&M08C) HILITE(&M08H) INTENS(&M08I)'
.ATTRCHAR(09) = 'COLOR(&M09C) HILITE(&M09H) INTENS(&M09I)'
.ATTRCHAR(10) = 'COLOR(&M13C) HILITE(&M13H) INTENS(&M13I)'
.ATTRCHAR(11) = 'COLOR(&M11C) HILITE(&M11H) INTENS(&M11I)'
.ATTRCHAR(12) = 'COLOR(&M13C) HILITE(&M13H) INTENS(&M13I)'
.ATTRCHAR(13) = 'COLOR(&M12C) HILITE(&M12H) INTENS(&M12I)'
.ATTRCHAR(14) = 'COLOR(&M13C) HILITE(&M13H) INTENS(&M13I)'
.ATTRCHAR(15) = 'COLOR(&M13C) HILITE(&M13H) INTENS(&M13I)'
.ATTRCHAR(16) = 'COLOR(&M13C) HILITE(&M13H) INTENS(&M13I)'
.ATTRCHAR(17) = 'COLOR(&M13C) HILITE(&M13H) INTENS(&M13I)'
.ATTRCHAR(18) = 'COLOR(&M13C) HILITE(&M13H) INTENS(&M13I)'
.ATTRCHAR(19) = 'COLOR(&M13C) HILITE(&M13H) INTENS(&M13I)'
.ATTRCHAR(1A) = 'COLOR(&M13C) HILITE(&M13H) INTENS(&M13I)'
.ATTRCHAR(20) = 'COLOR(&M20C) HILITE(&M20H) INTENS(&M20I)'
.ATTRCHAR(21) = 'COLOR(&M13C) HILITE(&M13H) INTENS(&M13I)'
.ATTRCHAR(22) = 'COLOR(&M13C) HILITE(&M13H) INTENS(&M13I)'
.ATTRCHAR(23) = 'COLOR(&M13C) HILITE(&M13H) INTENS(&M13I)'
.ATTRCHAR(24) = 'COLOR(&M13C) HILITE(&M13H) INTENS(&M13I)'
.ATTRCHAR(25) = 'COLOR(&M13C) HILITE(&M13H) INTENS(&M13I)'
.ATTRCHAR(26) = 'COLOR(&M11C) HILITE(&M11H) INTENS(&M11I)'
.ATTRCHAR(27) = 'COLOR(&M13C) HILITE(&M13H) INTENS(&M13I)'
.ATTRCHAR(28) = 'COLOR(&M13C) HILITE(&M13H) INTENS(&M13I)'
.ATTRCHAR(29) = 'COLOR(&M13C) HILITE(&M13H) INTENS(&M13I)'
.ATTRCHAR(30) = 'COLOR(&M13C) HILITE(&M13H) INTENS(&M13I)'
VGET (MXIS) PROFILE
.HELP = &MXIHELP
)PROC
&MXILVL  = LVLINE(MXIBUF)
VPUT (MXIS,M000) PROFILE
VPUT (M7CC M7CH M7CI) PROFILE
VPUT (M08C M08H M08I) PROFILE
VPUT (M05C M05H M05I) PROFILE
VPUT (M07C M07H M07I) PROFILE
VPUT (M06C M06H M06I) PROFILE
VPUT (M04C M04H M04I) PROFILE
VPUT (M03C M03H M03I) PROFILE
VPUT (M09C M09H M09I) PROFILE
VPUT (M11C M11H M11I) PROFILE
VPUT (M12C M12H M12I) PROFILE
VPUT (M13C M13H M13I) PROFILE
VPUT (M20C M20H M20I) PROFILE
)END
