         TITLE 'IEFAB4E2 - VMV ESTAE EXIT                              *
                        '
IEFAB4E2 CSECT
@MAINENT DS 0H
         USING *,15
         B @PROLOG
         DC AL1(16)
         DC C'IEFAB4E2'
         DROP 15
@PROLOG  BALR 12,0
@PSTART  DS 0H
         USING @PSTART,12
         LA 11,12
         CR 0,11              SEE IF SDWA EXISTS
         BNE SETPTR
         LR 11,2              NO SDWA, GET DSECT PTR FROM R2
         B COMMON
SETPTR   L 11,0(1)            SDWA, GET DSECT PTR FROM SDWA
COMMON   EQU *
         USING @DATD,11
*REG13INP = REG13;                     /*SAVE INPUT R13      @Z40FPPG*/
         LR    REG13INP,REG13                                   01S0020
* REG14SVE = REG14;                    /*SAVE RETURN ADDR            */
         LR    REG14SVE,REG14                                   01S0021
*VMVEXITP = REG11;                     /*PTR TO USER PARMS           */
         ST    REG11,VMVEXITP                                   01S0022
*REG13 = REG11;                        /*PTR TO SAVE AREA            */
         LR    REG13,REG11                                      01S0023
*REG13SVE = REG13;                     /*SAVE PTR TO SAVE AREA       */
         LR    REG13SVE,REG13                                   01S0024
*SDWAPTR = ZERO;                       /*INIT SDWA PTR               */
         SLR   SDWAPTR,SDWAPTR                                  01S0025
*IF REG0 ^= TWELVE THEN                /*SDWA EXISTS                 */
         CH    REG0,@CH00033                                    01S0026
         BE    @RF00026                                         01S0026
*  DO;                                                          01S0027
*    SDWAPTR = REG1;                   /*SAVE PTR TO SDWA            */
         LR    SDWAPTR,REG1                                     01S0028
*    RFY SDWA BASED(SDWAPTR);                                   01S0029
*  END;                                                         01S0030
*RFY (REG0,REG1) UNRSTD;                                        01S0031
@RF00026 DS    0H                                               01S0032
*IF SDWAPTR ^= ZERO THEN               /*SDWA EXISTS                 */
         LTR   SDWAPTR,SDWAPTR                                  01S0032
         BZ    @RF00032                                         01S0032
*  DO;                                                          01S0033
*    IF VEXFRR = ON THEN               /*FRR RTN HAD CONTROL         */
         L     @10,VMVEXITP                                     01S0034
         TM    VEXFRR(@10),B'10000000'                          01S0034
         BNO   @RF00034                                         01S0034
*      IF VEXMVCAF = ON THEN           /*MVCA TO BE FREED            */
         TM    VEXMVCAF(@10),B'01000000'                        01S0035
         BNO   @RF00035                                         01S0035
*        DO;                           /*FREE MVCA CORE              */
*           DO; /*MODESET  EXTKEY(SCHED)*/                      01S0037
*             SPKA (16); /*SET PSW KEY*/                        01S0038
         LA    @08,16                                           01S0038
         SPKA  0(@08)                                           01S0038
*           END; /*MODESET  EXTKEY(SCHED)*/                     01S0039
*          RFY (REG0,REG1) RSTD;                                01S0040
*          REG0 = LENGTH(MVCA);        /*LENGTH OF CORE TO FREE      */
         LR    REG0,@08                                         01S0041
*          REG1 = VEXMVCAP;            /*PTR TO CORE TO FREE         */
         L     REG1,VEXMVCAP(,@10)                              01S0042
*          REG0 = REG0 × SUBPL241;     /*SUBPOOL OF CORE TO FREE     */
         O     REG0,@CF00082                                    01S0043
*          GEN (  FREEMAIN R,LV=(0),A=(1)  );                   01S0044
           FREEMAIN R,LV=(0),A=(1)
*          RFY (REG0,REG1) UNRSTD;                              01S0045
*           DO; /*MODESET  KEYADDR(ZERO)*/                      01S0046
*             SPKA (ZERO); /*SET PSW KEY*/                      01S0047
         SLR   @10,@10                                          01S0047
         SPKA  0(@10)                                           01S0047
*           END; /*MODESET  KEYADDR(ZERO)*/                     01S0048
*        END;                                                   01S0049
*      ELSE;                                                    01S0050
@RF00035 DS    0H                                               01S0051
*    ELSE                             /*FRR DID NOT HAVE CONTROL     */
*      DO;                                                      01S0051
         B     @RC00034                                         01S0051
@RF00034 DS    0H                                               01S0052
*        VMVFUNCS = CLRFLAG;           /*CLEAR IEFAB498 FLAGS        */
         SLR   @10,@10                                          01S0052
         STH   @10,VMVFUNCS                                     01S0052
*        FINDMVCA = ON;                /*INDICATE SEARCH FUNCTION    */
         OI    FINDMVCA,B'00100000'                             01S0053
*        MVCAP = ZERO;                 /*ZERO RETURN AREA            */
         ST    @10,MVCAP                                        01S0054
*        VMVASID = VEXASID;            /*SUPPLY ASID                 */
         L     @10,VMVEXITP                                     01S0055
         MVC   VMVASID(2),VEXASID(@10)                          01S0055
*        VMVPARMP = ADDR(VMVPARMS);    /*PTR TO 498 PARM LIST        */
         LA    @10,VMVPARMS                                     01S0056
         ST    @10,VMVPARMP                                     01S0056
*         DO; /*MODESET  EXTKEY(SCHED)*/                        01S0057
*           SPKA (16); /*SET PSW KEY*/                          01S0058
         LA    @10,16                                           01S0058
         SPKA  0(@10)                                           01S0058
*         END; /*MODESET  EXTKEY(SCHED)*/       /*SCHED KEY FOR CALL  @
*M32370*/                                                       01S0059
*        CALL IEFAB498(VMVPARMP,0);    /*FIND MVCA FOR THIS ASID     */
         LA    @10,VMVPARMP                                     01S0060
         ST    @10,@AL00001                                     01S0060
         LA    @10,@CF00075                                     01S0060
         ST    @10,@AL00001+4                                   01S0060
         L     @15,@CV00051                                     01S0060
         LA    @01,@AL00001                                     01S0060
         BALR  @14,@15                                          01S0060
*         DO; /*MODESET  KEYADDR(ZERO)*/                        01S0061
*           SPKA (ZERO); /*SET PSW KEY*/                        01S0062
         SLR   @10,@10                                          01S0062
         SPKA  0(@10)                                           01S0062
*         END; /*MODESET  KEYADDR(ZERO)*/       /*BACK TO KEY ZERO    @
*M32370*/                                                       01S0063
*        IF MVCAP ^= ZERO THEN         /*MVCA EXISTS                 */
         L     @15,MVCAP                                        01S0064
         CR    @15,@10                                          01S0064
         BE    @RF00064                                         01S0064
*          DO;                                                  01S0065
*            CLNUPARM = CLNUPARM && CLNUPARM; /*CLEAR IEFAB49A PARMS */
         XC    CLNUPARM(16),CLNUPARM                            01S0066
*            FREEMVCA = ON;            /*INDICATE TO DECHAIN & FREE  */
         OI    FREEMVCA,B'00100000'                             01S0067
*            MVCAPTR = MVCAP;          /*SUPPLY MVCA PTR             */
         ST    @15,MVCAPTR                                      01S0068
*            REG13 = REG13SVE;         /*PTR TO SAVE AREA            */
         LR    REG13,REG13SVE                                   01S0069
*             DO; /*MODESET  EXTKEY(SCHED)*/                    01S0070
*               SPKA (16); /*SET PSW KEY*/                      01S0071
         LA    @10,16                                           01S0071
         SPKA  0(@10)                                           01S0071
*             END; /*MODESET  EXTKEY(SCHED)*/   /*SCHED KEY FOR CALL  @
*M32370*/                                                       01S0072
*            CALL IEFAB49A(CLNUPARM,VMVEXITP); /*VMV CLEANUP RTN     */
         LA    @10,CLNUPARM                                     01S0073
         ST    @10,@AL00001                                     01S0073
         LA    @10,VMVEXITP                                     01S0073
         ST    @10,@AL00001+4                                   01S0073
         L     @15,@CV00052                                     01S0073
         LA    @01,@AL00001                                     01S0073
         BALR  @14,@15                                          01S0073
*             DO; /*MODESET  KEYADDR(ZERO)*/                    01S0074
*               SPKA (ZERO); /*SET PSW KEY*/                    01S0075
         SLR   @10,@10                                          01S0075
         SPKA  0(@10)                                           01S0075
*             END; /*MODESET  KEYADDR(ZERO)*/   /*BACK TO KEY ZERO    @
*M32370*/                                                       01S0076
*          END;                                                 01S0077
*      END;                                                     01S0078
@RF00064 DS    0H                                               01S0079
*  END;                                                         01S0079
@RC00034 DS    0H                                               01S0080
*REG13 = REG13INP;                     /*RESTORE R13         @Z40FPPG*/
@RF00032 LR    REG13,REG13INP                                   01S0080
*RFY (REG1) RSTD;                                               01S0081
*REG14 = REG14SVE;                     /*RESTORE RETURN ADDR         */
         LR    REG14,REG14SVE                                   01S0082
*REG1 = SDWAPTR;                       /*RESTORE SDWA PTR            */
         LR    REG1,SDWAPTR                                     01S0083
*GEN;                                                           01S0084
     SR 15,15
     BR 14
*END IEFAB4E2                                                   01S0085
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.      *
*/*%INCLUDE SYSLIB  (A4E2SPEC)                                        *
*/*%INCLUDE SYSLIB  (A4E2DATA)                                        *
*/*%INCLUDE SYSLIB  (IEFZB433)                                        *
*/*%INCLUDE SYSLIB  (IEFZB452)                                        *
*/*%INCLUDE SYSLIB  (IHASDWA )                                        *
*;                                                              01S0085
@DATA    DS    0H
@CH00033 DC    H'12'
@DATD    DSECT
         DS    0F
@SA00001 DS    18F
@AL00001 DS    2A
IEFAB4E2 CSECT
         DS    0F
@CF00075 DC    F'0'
@CF00082 DC    XL4'F1000000'
@DATD    DSECT
         DS    0D
VMVEXITP DS    A
VMVPARMP DS    A
MTENTPTR DS    A
CLNUPARM DS    CL16
         ORG   CLNUPARM
CLNBITS  DS    BL4
         ORG   CLNBITS
@NM00001 DS    BL1
FREEMVCA EQU   CLNBITS+0
@NM00002 EQU   CLNBITS+0
         ORG   CLNUPARM+4
MVCAPTR  DS    AL4
@NM00003 DS    CL8
         ORG   CLNUPARM+16
VMVPARMS DS    CL8
         ORG   VMVPARMS
VMVFUNCS DS    CL2
         ORG   VMVFUNCS
@NM00004 DS    BL1
FINDMVCA EQU   VMVFUNCS+0
@NM00005 EQU   VMVFUNCS+0
         ORG   VMVPARMS+2
VMVASID  DS    FL2
MVCAP    DS    AL4
         ORG   VMVPARMS+8
IEFAB4E2 CSECT
         NOPR  ((@ENDDATD-@DATD)/193*16)
         DS    0F
@SIZDATD DC    AL1(0)
         DC    AL3(@ENDDATD-@DATD)
@CV00051 DC    V(IEFAB498)
@CV00052 DC    V(IEFAB49A)
         DS    0D
IEFAB4E2 CSECT
         DS   0H
A4E2PTCH DC (52)X'00'
@DATD    DSECT
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA
@ENDDATD EQU   *
IEFAB4E2 CSECT
@00      EQU   00                      EQUATES FOR REGISTERS 0-15
@01      EQU   01
@02      EQU   02
@03      EQU   03
@04      EQU   04
@05      EQU   05
@06      EQU   06
@07      EQU   07
@08      EQU   08
@09      EQU   09
@10      EQU   10
@11      EQU   11
@12      EQU   12
@13      EQU   13
@14      EQU   14
@15      EQU   15
REG14SVE EQU   @09
REG13SVE EQU   @08
REG13INP EQU   @07
SDWAPTR  EQU   @06
REG0     EQU   @00
REG1     EQU   @01
REG11    EQU   @11
REG12    EQU   @12
REG13    EQU   @13
REG14    EQU   @14
REG15    EQU   @15
MVCA     EQU   0
MVCAXPTR EQU   MVCA+12
MVCAX    EQU   0
MVSWITCH EQU   MVCAX+4
MTENTRY  EQU   0
MTENBASE EQU   MTENTRY
MTDEVPTR EQU   MTENBASE+12
MTDOMPTR EQU   MTENBASE+16
MTDEVENT EQU   0
MTSTATUS EQU   MTDEVENT
VMVEPRMS EQU   0
VEXMVCAP EQU   VMVEPRMS+192
VEXFLAGS EQU   VMVEPRMS+196
VEXFRR   EQU   VEXFLAGS
VEXMVCAF EQU   VEXFLAGS
VEXASID  EQU   VMVEPRMS+198
SDWA     EQU   0
SDWAFIOB EQU   SDWA+4
SDWAABCC EQU   SDWAFIOB
SDWACMPF EQU   SDWAABCC
SDWACTL1 EQU   SDWA+8
SDWACMKA EQU   SDWACTL1
SDWAMWPA EQU   SDWACTL1+1
SDWAPMKA EQU   SDWACTL1+4
SDWACTL2 EQU   SDWA+16
SDWACMKP EQU   SDWACTL2
SDWAMWPP EQU   SDWACTL2+1
SDWAPMKP EQU   SDWACTL2+4
SDWAGRSV EQU   SDWA+24
SDWANAME EQU   SDWA+88
SDWAEC1  EQU   SDWA+104
SDWAEMK1 EQU   SDWAEC1
SDWAMWP1 EQU   SDWAEC1+1
SDWAINT1 EQU   SDWAEC1+2
SDWANXT1 EQU   SDWAEC1+4
SDWAAEC1 EQU   SDWA+112
SDWAILC1 EQU   SDWAAEC1+1
SDWAINC1 EQU   SDWAAEC1+2
SDWAICD1 EQU   SDWAINC1+1
SDWAEC2  EQU   SDWA+120
SDWAEMK2 EQU   SDWAEC2
SDWAMWP2 EQU   SDWAEC2+1
SDWAINT2 EQU   SDWAEC2+2
SDWANXT2 EQU   SDWAEC2+4
SDWAAEC2 EQU   SDWA+128
SDWAILC2 EQU   SDWAAEC2+1
SDWAINC2 EQU   SDWAAEC2+2
SDWAICD2 EQU   SDWAINC2+1
SDWASRSV EQU   SDWA+136
SDWAIDNT EQU   SDWA+200
SDWAMCH  EQU   SDWA+204
SDWASTCK EQU   SDWAMCH
SDWAMCHI EQU   SDWAMCH+8
SDWAMCHS EQU   SDWAMCHI
SDWAMCHD EQU   SDWAMCHI+1
SDWARSR1 EQU   SDWAMCH+12
SDWARSR2 EQU   SDWAMCH+13
SDWAFLGS EQU   SDWA+232
SDWAERRA EQU   SDWAFLGS
SDWAERRB EQU   SDWAFLGS+1
SDWAERRC EQU   SDWAFLGS+2
SDWAERRD EQU   SDWAFLGS+3
SDWAIOFS EQU   SDWA+238
SDWACPUA EQU   SDWA+248
SDWAPARQ EQU   SDWA+252
SDWAACF2 EQU   SDWAPARQ+1
SDWAACF3 EQU   SDWAPARQ+2
SDWAACF4 EQU   SDWAPARQ+3
SDWALKWA EQU   SDWA+256
SDWALKWS EQU   SDWALKWA
SDWARECP EQU   SDWA+292
SDWASNPA EQU   SDWA+320
SDWADUMP EQU   SDWASNPA
SDWADPFS EQU   SDWADUMP+1
SDWADDAT EQU   SDWASNPA+4
SDWASDAT EQU   SDWADDAT
SDWAPDAT EQU   SDWADDAT+2
SDWADPSA EQU   SDWA+328
SDWADPSL EQU   SDWADPSA
SDWARA   EQU   SDWA+400
SDWADPVA EQU   SDWARA+2
MTDOMIDS EQU   0
*                                      START UNREFERENCED COMPONENTS
@NM00056 EQU   SDWA+512
SDWAVRA  EQU   SDWARA+4
SDWAURAL EQU   SDWARA+3
@NM00055 EQU   SDWADPVA
SDWAEBC  EQU   SDWADPVA
SDWAHEX  EQU   SDWADPVA
SDWAVRAL EQU   SDWARA
@NM00054 EQU   SDWA+396
SDWACOMP EQU   SDWA+392
SDWARCPL EQU   SDWA+364
@NM00053 EQU   SDWADPSA+32
SDWATO4  EQU   SDWADPSL+28
SDWAFRM4 EQU   SDWADPSL+24
SDWATO3  EQU   SDWADPSL+20
SDWAFRM3 EQU   SDWADPSL+16
SDWATO2  EQU   SDWADPSL+12
SDWAFRM2 EQU   SDWADPSL+8
SDWATO1  EQU   SDWADPSL+4
SDWAFRM1 EQU   SDWADPSL
@NM00052 EQU   SDWADDAT+3
@NM00051 EQU   SDWAPDAT
SDWAUSPL EQU   SDWAPDAT
SDWADPSW EQU   SDWAPDAT
SDWATJPA EQU   SDWAPDAT
SDWATLPA EQU   SDWAPDAT
SDWADREG EQU   SDWAPDAT
SDWADSAH EQU   SDWAPDAT
SDWADSAS EQU   SDWAPDAT
@NM00050 EQU   SDWADDAT+1
@NM00049 EQU   SDWASDAT
SDWAQQS  EQU   SDWASDAT
SDWACBS  EQU   SDWASDAT
SDWAGTF  EQU   SDWASDAT
SDWASWA  EQU   SDWASDAT
SDWALSQA EQU   SDWASDAT
SDWASQA  EQU   SDWASDAT
SDWANUC  EQU   SDWASDAT
@NM00048 EQU   SDWADUMP+2
@NM00047 EQU   SDWADPFS
SDWASLST EQU   SDWADPFS
@NM00046 EQU   SDWADPFS
SDWADLST EQU   SDWADPFS
SDWADPT  EQU   SDWADPFS
SDWADPID EQU   SDWADUMP
SDWADPLA EQU   SDWA+316
SDWAREXN EQU   SDWARECP+16
SDWACSCT EQU   SDWARECP+8
SDWAMODN EQU   SDWARECP
@NM00045 EQU   SDWA+290
SDWAASID EQU   SDWA+288
SDWATALW EQU   SDWALKWS+28
SDWATDLW EQU   SDWALKWS+24
SDWATNLW EQU   SDWALKWS+20
SDWAAPLW EQU   SDWALKWS+16
SDWAIPLW EQU   SDWALKWS+12
SDWAILLW EQU   SDWALKWS+8
SDWAIULW EQU   SDWALKWS+4
SDWAICLW EQU   SDWALKWS
SDWAFLLK EQU   SDWAACF4
SDWACMS  EQU   SDWAACF4
SDWAOPTM EQU   SDWAACF4
SDWATADB EQU   SDWAACF4
SDWATDNB EQU   SDWAACF4
SDWATNCB EQU   SDWAACF4
SDWAILCH EQU   SDWAACF4
SDWAIUCB EQU   SDWAACF4
SDWAICAT EQU   SDWAACF3
SDWAIPRG EQU   SDWAACF3
SDWASALL EQU   SDWAACF3
SDWAASMP EQU   SDWAACF3
SDWADISP EQU   SDWAACF3
@NM00044 EQU   SDWAACF3
@NM00043 EQU   SDWAACF2
SDWAFREE EQU   SDWAACF2
SDWAUPRG EQU   SDWAACF2
@NM00042 EQU   SDWAACF2
SDWASPIN EQU   SDWAACF2
@NM00041 EQU   SDWAACF2
SDWARCRD EQU   SDWAACF2
SDWARCDE EQU   SDWAPARQ
SDWALCPU EQU   SDWACPUA+2
@NM00040 EQU   SDWACPUA
SDWARECA EQU   SDWA+244
SDWARTYA EQU   SDWA+240
@NM00039 EQU   SDWA+239
@NM00038 EQU   SDWAIOFS
SDWANIOP EQU   SDWAIOFS
SDWANOIO EQU   SDWAIOFS
SDWAIOHT EQU   SDWAIOFS
SDWAIOQR EQU   SDWAIOFS
SDWAFMID EQU   SDWA+236
@NM00037 EQU   SDWAERRD
SDWAMCIV EQU   SDWAERRD
SDWARPIV EQU   SDWAERRD
SDWAMABD EQU   SDWAERRD
SDWACTS  EQU   SDWAERRD
SDWASTAE EQU   SDWAERRD
SDWANRBE EQU   SDWAERRD
SDWACLUP EQU   SDWAERRD
@NM00036 EQU   SDWAERRC
SDWAEAS  EQU   SDWAERRC
SDWAPERC EQU   SDWAERRC
SDWAIRB  EQU   SDWAERRC
SDWASTAI EQU   SDWAERRC
SDWASTAF EQU   SDWAERRC
SDWASRBM EQU   SDWAERRB
SDWALDIS EQU   SDWAERRB
SDWAENRB EQU   SDWAERRB
SDWATYP1 EQU   SDWAERRB
@NM00035 EQU   SDWAERRB
SDWAPGIO EQU   SDWAERRA
SDWATEXC EQU   SDWAERRA
SDWASVCE EQU   SDWAERRA
SDWAABTM EQU   SDWAERRA
SDWASVCD EQU   SDWAERRA
SDWARKEY EQU   SDWAERRA
SDWAPCHK EQU   SDWAERRA
SDWAMCHK EQU   SDWAERRA
SDWATIME EQU   SDWAMCH+20
SDWARFSA EQU   SDWAMCH+16
@NM00034 EQU   SDWAMCH+14
SDWAVEQR EQU   SDWARSR2
SDWAPGFX EQU   SDWARSR2
SDWAFLSQ EQU   SDWARSR2
SDWAFSQA EQU   SDWARSR2
SDWANUCL EQU   SDWARSR2
SDWASPER EQU   SDWARSR2
SDWAINTC EQU   SDWARSR2
SDWAOFLN EQU   SDWARSR2
SDWACHNG EQU   SDWARSR1
SDWAMSER EQU   SDWARSR1
@NM00033 EQU   SDWARSR1
SDWACPID EQU   SDWAMCH+10
SDWATERR EQU   SDWAMCHD
SDWAFPRX EQU   SDWAMCHD
SDWAINSF EQU   SDWAMCHD
SDWAACR  EQU   SDWAMCHD
SDWASCK  EQU   SDWAMCHD
SDWAPSWU EQU   SDWAMCHD
SDWAREGU EQU   SDWAMCHD
SDWASKYF EQU   SDWAMCHD
@NM00032 EQU   SDWAMCHS
SDWARSRF EQU   SDWAMCHS
SDWARSRC EQU   SDWAMCHS
SDWAINVP EQU   SDWAMCHS
SDWATSVL EQU   SDWAMCHS
SDWARCDF EQU   SDWAMCHS
SDWASRVL EQU   SDWAMCHS
SDWASCKE EQU   SDWASTCK+4
SDWASCKB EQU   SDWASTCK
SDWALNTH EQU   SDWAIDNT+1
SDWASPID EQU   SDWAIDNT
SDWASR15 EQU   SDWASRSV+60
SDWASR14 EQU   SDWASRSV+56
SDWASR13 EQU   SDWASRSV+52
SDWASR12 EQU   SDWASRSV+48
SDWASR11 EQU   SDWASRSV+44
SDWASR10 EQU   SDWASRSV+40
SDWASR09 EQU   SDWASRSV+36
SDWASR08 EQU   SDWASRSV+32
SDWASR07 EQU   SDWASRSV+28
SDWASR06 EQU   SDWASRSV+24
SDWASR05 EQU   SDWASRSV+20
SDWASR04 EQU   SDWASRSV+16
SDWASR03 EQU   SDWASRSV+12
SDWASR02 EQU   SDWASRSV+8
SDWASR01 EQU   SDWASRSV+4
SDWASR00 EQU   SDWASRSV
SDWATRN2 EQU   SDWAAEC2+4
SDWAIPC2 EQU   SDWAICD2
SDWAIMC2 EQU   SDWAICD2
SDWAIPR2 EQU   SDWAICD2
@NM00031 EQU   SDWAINC2
@NM00030 EQU   SDWAILC2
SDWAIL2  EQU   SDWAILC2
@NM00029 EQU   SDWAILC2
@NM00028 EQU   SDWAAEC2
SDWAADD2 EQU   SDWANXT2+1
@NM00027 EQU   SDWANXT2
@NM00026 EQU   SDWAEC2+3
SDWASGN2 EQU   SDWAINT2
SDWAEXP2 EQU   SDWAINT2
SDWADEC2 EQU   SDWAINT2
SDWAFPO2 EQU   SDWAINT2
SDWACC2  EQU   SDWAINT2
@NM00025 EQU   SDWAINT2
SDWAPGM2 EQU   SDWAMWP2
SDWAWAT2 EQU   SDWAMWP2
SDWAMCK2 EQU   SDWAMWP2
SDWAECT2 EQU   SDWAMWP2
SDWAKEY2 EQU   SDWAMWP2
SDWAEXT2 EQU   SDWAEMK2
SDWAIO2  EQU   SDWAEMK2
SDWATRM2 EQU   SDWAEMK2
@NM00024 EQU   SDWAEMK2
SDWAPER2 EQU   SDWAEMK2
@NM00023 EQU   SDWAEMK2
SDWATRAN EQU   SDWAAEC1+4
SDWAIPC1 EQU   SDWAICD1
SDWAIMC1 EQU   SDWAICD1
SDWAIPR1 EQU   SDWAICD1
@NM00022 EQU   SDWAINC1
@NM00021 EQU   SDWAILC1
SDWAIL1  EQU   SDWAILC1
@NM00020 EQU   SDWAILC1
@NM00019 EQU   SDWAAEC1
SDWAADD1 EQU   SDWANXT1+1
@NM00018 EQU   SDWANXT1
@NM00017 EQU   SDWAEC1+3
SDWASGN1 EQU   SDWAINT1
SDWAEXP1 EQU   SDWAINT1
SDWADEC1 EQU   SDWAINT1
SDWAFPO1 EQU   SDWAINT1
SDWACC1  EQU   SDWAINT1
@NM00016 EQU   SDWAINT1
SDWAPGM1 EQU   SDWAMWP1
SDWAWAT1 EQU   SDWAMWP1
SDWAMCK1 EQU   SDWAMWP1
SDWAECT1 EQU   SDWAMWP1
SDWAKEY1 EQU   SDWAMWP1
SDWAEXT1 EQU   SDWAEMK1
SDWAIO1  EQU   SDWAEMK1
SDWATRM1 EQU   SDWAEMK1
@NM00015 EQU   SDWAEMK1
SDWAPER1 EQU   SDWAEMK1
@NM00014 EQU   SDWAEMK1
SDWAIOBR EQU   SDWA+100
SDWAEPA  EQU   SDWA+96
@NM00013 EQU   SDWANAME+4
SDWARBAD EQU   SDWANAME
SDWAGR15 EQU   SDWAGRSV+60
SDWAGR14 EQU   SDWAGRSV+56
SDWAGR13 EQU   SDWAGRSV+52
SDWAGR12 EQU   SDWAGRSV+48
SDWAGR11 EQU   SDWAGRSV+44
SDWAGR10 EQU   SDWAGRSV+40
SDWAGR09 EQU   SDWAGRSV+36
SDWAGR08 EQU   SDWAGRSV+32
SDWAGR07 EQU   SDWAGRSV+28
SDWAGR06 EQU   SDWAGRSV+24
SDWAGR05 EQU   SDWAGRSV+20
SDWAGR04 EQU   SDWAGRSV+16
SDWAGR03 EQU   SDWAGRSV+12
SDWAGR02 EQU   SDWAGRSV+8
SDWAGR01 EQU   SDWAGRSV+4
SDWAGR00 EQU   SDWAGRSV
SDWANXTP EQU   SDWACTL2+5
SDWASGP  EQU   SDWAPMKP
SDWAEUP  EQU   SDWAPMKP
SDWADOP  EQU   SDWAPMKP
SDWAFPP  EQU   SDWAPMKP
SDWACCP  EQU   SDWAPMKP
SDWAILP  EQU   SDWAPMKP
SDWAINTP EQU   SDWACTL2+2
SDWASPVP EQU   SDWAMWPP
SDWAWATP EQU   SDWAMWPP
SDWAMCKP EQU   SDWAMWPP
@NM00012 EQU   SDWAMWPP
SDWAKEYP EQU   SDWAMWPP
SDWAEXTP EQU   SDWACMKP
SDWAIOP  EQU   SDWACMKP
SDWANXTA EQU   SDWACTL1+5
SDWASGA  EQU   SDWAPMKA
SDWAEUA  EQU   SDWAPMKA
SDWADOA  EQU   SDWAPMKA
SDWAFPA  EQU   SDWAPMKA
SDWACCA  EQU   SDWAPMKA
SDWAILA  EQU   SDWAPMKA
SDWAINTA EQU   SDWACTL1+2
SDWASPVA EQU   SDWAMWPA
SDWAWATA EQU   SDWAMWPA
SDWAMCKA EQU   SDWAMWPA
@NM00011 EQU   SDWAMWPA
SDWAKEYA EQU   SDWAMWPA
SDWAEXTA EQU   SDWACMKA
SDWAIOA  EQU   SDWACMKA
SDWACMPC EQU   SDWAABCC+1
@NM00010 EQU   SDWACMPF
SDWASTCC EQU   SDWACMPF
@NM00009 EQU   SDWACMPF
SDWASTEP EQU   SDWACMPF
SDWAREQ  EQU   SDWACMPF
SDWAPARM EQU   SDWA
@NM00008 EQU   VEXFLAGS
VMVEAUTO EQU   VMVEPRMS
MTDVUPTR EQU   MTDEVENT+9
MTSAVNDX EQU   MTDEVENT+8
MTDSNMP  EQU   MTDEVENT+4
MTUCBPTR EQU   MTDEVENT+1
MTVRSVRD EQU   MTSTATUS
MTVRYVFY EQU   MTSTATUS
MTVRYLBL EQU   MTSTATUS
MTVRYPND EQU   MTSTATUS
MTNXTPTR EQU   MTENBASE+8
MTPRVPTR EQU   MTENBASE+4
@NM00007 EQU   MTENBASE+2
MTLENGTH EQU   MTENBASE
MVTPECB  EQU   MVCAX+20
MVDAECB  EQU   MVCAX+16
MVNODEVE EQU   MVCAX+14
MVWTORRA EQU   MVCAX+12
MVENTRYP EQU   MVCAX+8
MVNUMWTS EQU   MVCAX+6
MVWTORSW EQU   MVSWITCH
MVDISDSN EQU   MVSWITCH
MVDEVECB EQU   MVCAX
MVCANXTP EQU   MVCA+8
MVCAPRVP EQU   MVCA+4
MVCAASID EQU   MVCA+2
@NM00006 EQU   MVCA
*                                      END UNREFERENCED COMPONENTS
@ENDDATA EQU   *
         END   IEFAB4E2,(C'PLS2005',0701,78089)
