         TITLE 'IEFAB4EC - GROUP LOCK/UNLOCK INTERFACE ROUTINE         *
                        '
IEFAB4EC CSECT ,                                                01S0001
@MAINENT DS    0H                                               01S0001
         USING *,@15                                            01S0001
         B     @PROLOG                                          01S0001
         DC    AL1(16)                                          01S0001
         DC    C'IEFAB4EC  78.124'                              01S0001
         DROP  @15
@PROLOG  STM   @14,@12,12(@13)                                  01S0001
         BALR  @12,0                                            01S0001
@PSTART  DS    0H                                               01S0001
         USING @PSTART,@12                                      01S0001
         L     @00,@SIZDATD                                     01S0001
         MODESET EXTKEY=SCHED,SAVEKEY=(2)
         GSPACE   R,LV=(0)
         LR    @11,@01                                          01S0001
         USING @DATD,@11                                        01S0001
         ST    @13,@SA00001+4                                   01S0001
         STC   @02,@OLDKEY                                      01S0001
         MODESET KEYADDR=(2)
         LM    @00,@02,20(@13)                                  01S0001
         ST    @11,8(,@13)                                      01S0001
         LR    @13,@11                                          01S0001
         MODESET EXTKEY=ZERO
         MVC   @PC00001(20),0(@01)                              01S0001
         MODESET EXTKEY=SCHED
JSCBDISP EQU 188
JSCBAOS1 EQU  72
JSCBAOS2 EQU 192
*RETCODE=ZERO;                         /*INITIALIZE RETCODE          */
         SLR   RETCODE,RETCODE                                  01S0064
*GETFAIL=OFF;                          /*INIT GETSTORG FAIL SWITCH   */
         NI    GETFAIL,B'01111111'                              01S0065
*IF LOCKGRP=ON THEN                    /*IF FIRST CALL TO MODULE     */
         L     @10,@PC00001                                     01S0066
         TM    LOCKGRP(@10),B'10000000'                         01S0066
         BNO   @RF00066                                         01S0066
*  DO;                                 /*DO ESTAE,ENQ, AND Q-MGR INIT*/
*    TABLSIZE=LENGTH(ASWA)+            /*LENGTH OF GETMAIN AREA-ASWA */
*             LENGTH(AB4EDPMS)+        /*PLUS LENGTH OF 4ED AUTODATA */
*             LENGTH(LOCKESPA)+        /*PLUS LENGTH OF ESTAE PARMS  */
*             LENGTH(AQMPARAM)+        /*PLUS LENGTH OF QMGR BLOCK   */
*             LENGTH(WORKAREA)+        /*PLUS LENGTH OF WORK AREA    */
*             LENGTH(GROUPID)*UCBNOENT;/*PLUS LENGTH OF GROUP ID LIST*/
         L     @08,@PC00001+4                                   01S0068
         L     @08,LISTPTR(,@08)                                01S0068
         L     TABLSIZE,UCBNOENT(,@08)                          01S0068
         SLA   TABLSIZE,2                                       01S0068
         AH    TABLSIZE,@CH01879                                01S0068
*     /* ?GETSTORG (SP230,TABLSIZE,BLKPTR);*/                   01S0069
*       /* DEFINITIONS OF GETMAIN PARMS */                      01S0069
*       DCL                                                     01S0069
*         GTSTR0   FIXED(31) REG(0),/*GTMN PARM REG*/           01S0069
*         GTSTR1   FIXED(31) REG(1),/*GTMN PARM REG*/           01S0069
*         GTSTR2   PTR(31)   REG(2),/*GTMN PARM REG*/           01S0069
*         GTSTR15  FIXED(31) REG(15),/*GTMN RET COD*/           01S0069
*         GTSTRTCD FIXED(31); /* GETMAIN RTN CODE  */           01S0069
*       DCL                                                     01S0070
*         GTSTR3   FIXED(31) REG(3),/* CLEARING REG*/           01S0070
*         GTSTR4   FIXED(31) REG(4),/* CLEARING REG*/           01S0070
*         GTSTR5   FIXED(31) REG(5),/* CLEARING REG*/           01S0070
*         GTSTR6   FIXED(31) REG(6),/* CLEARING REG*/           01S0070
*         GTSTR7   FIXED(31) REG(7),/* CLEARING REG*/           01S0070
*         GTSTR8   FIXED(31) REG(8),/* CLEARING REG*/           01S0070
*         GTSTZERO FIXED(31) INIT(0),                           01S0070
*         GTST253  FIXED(31) CONSTANT(253);                     01S0070
*       RFY (GTSTR0,GTSTR1,GTSTR2) RSTD; /*SAVE RGS*/           01S0071
*       GTSTR0 = TABLSIZE; /* SET AMOUNT*/                      01S0072
         LR    GTSTR0,TABLSIZE                                  01S0072
*       GTSTR2 = SP230; /* SET SUBPOOL*/                        01S0073
         SLR   GTSTR2,GTSTR2                                    01S0073
         IC    GTSTR2,SP230                                     01S0073
*       GENERATE CODE;                                          01S0074
         GETMAIN RC,LV=(0),SP=(2)  DO GETMAIN
*       GTSTRTCD = GTSTR15; /* SAVE GETMAIN RET COD*/           01S0075
         ST    GTSTR15,GTSTRTCD                                 01S0075
*       BLKPTR = GTSTR1; /* ADDR OF GOTN STORG*/                01S0076
         LR    BLKPTR,GTSTR1                                    01S0076
*       RFY (GTSTR0,GTSTR1,GTSTR2) UNRSTD; /*RLSE */            01S0077
*       IF GTSTRTCD = 0 THEN /*GETMAIN SUCCESSFUL? */           01S0078
         L     @08,GTSTRTCD                                     01S0078
         LTR   @08,@08                                          01S0078
         BNZ   @RF00078                                         01S0078
*         DO;               /* YES, CLEAR STORAGE.*/            01S0079
*           RFY (GTSTR2,GTSTR4,GTSTR5,GTSTR6,                   01S0080
*                              GTSTR7,GTSTR8) RSTD;             01S0080
*           GTSTR4 = BLKPTR; /*STORG PTR*/                      01S0081
         LR    GTSTR4,BLKPTR                                    01S0081
*           GTSTR5 = TABLSIZE; /*STORG AMNT*/                   01S0082
         LR    GTSTR5,TABLSIZE                                  01S0082
*           GTSTR7 = '00000000'X; /*PAD CHAR & LNTH*/           01S0083
         SLR   GTSTR7,GTSTR7                                    01S0083
*           IF SP230 = GTST253 THEN                             01S0084
         CLI   SP230,253                                        01S0084
         BNE   @RF00084                                         01S0084
*          GEN                                                  01S0085
*       (MODESET KEYADDR=GTSTZERO,SAVEKEY=(2),WORKREG=8);       01S0085
         MODESET KEYADDR=GTSTZERO,SAVEKEY=(2),WORKREG=8
*           GEN REFS(GTSTR4,GTSTR6);                            01S0086
@RF00084 DS    0H                                               01S0086
              MVCL  GTSTR4,GTSTR6 CLEAR GOTTEN STORG
*           IF SP230 = GTST253 THEN                             01S0087
         CLI   SP230,253                                        01S0087
         BNE   @RF00087                                         01S0087
*             GEN (MODESET KEYADDR=(2));                        01S0088
         MODESET KEYADDR=(2)
*           RFY (GTSTR2,GTSTR4,GTSTR5,GTSTR6,                   01S0089
*                              GTSTR7,GTSTR8) UNRSTD;           01S0089
@RF00087 DS    0H                                               01S0090
*         END;       /* STORAGE CLEARING COMPLETED */           01S0090
*       ELSE                                                    01S0091
*       BLKPTR= 0;   /* CLEAR RETURN ADDR. */                   01S0091
         B     @RC00078                                         01S0091
@RF00078 SLR   BLKPTR,BLKPTR                                    01S0091
*       GTSTR15 = GTSTRTCD;    /* GTMN RETURN CODE */           01S0092
@RC00078 L     GTSTR15,GTSTRTCD                                 01S0092
*                                      /* RESTORE LIST PRINT STATUS  */
* /*GET CORE FOR THESE LISTS  */                                01S0093
*    RETCODE=REG15;                    /*SAVE RETURN CODE            */
         LR    RETCODE,REG15                                    01S0093
*    IF RETCODE=ZERO THEN              /*IF GETMAIN OK               */
         SLR   @08,@08                                          01S0094
         CR    RETCODE,@08                                      01S0094
         BNE   @RF00094                                         01S0094
*      DO;                             /*CONTINUE WITH FIRST CALL    */
*        ASWAPTR=BLKPTR;               /*SET UP PTR TO ASWA          */
         L     @05,@PC00001+16                                  01S0096
         ST    BLKPTR,ASWAPTR(,@05)                             01S0096
*        LOCKPAP=ADDR(ESTAPRMS);       /*SET UP PTR TO 4EC ESTAE PRMS*/
         L     @09,@PC00001+16                                  01S0097
         L     @09,ASWAPTR(,@09)                                01S0097
         LA    LOCKPAP,ESTAPRMS(,@09)                           01S0097
*        QMPARMP=ADDR(QMGRPRMS);       /*SET UP PTR TO QMGR PARMS    */
         LA    @05,QMGRPRMS(,@09)                               01S0098
         ST    @05,QMPARMP(,LOCKPAP)                            01S0098
*        WORKPTR=ADDR(WORKTABL);       /*SET UP PTR TO WORK AREA     */
         LA    WORKPTR,WORKTABL(,@09)                           01S0099
*        COREPTR=ASWAPTR;              /*PTR TO CORE INTO WORKAREA   */
         ST    @09,COREPTR(,WORKPTR)                            01S0100
*        GRPIDPTR=ADDR(GRPTABL);       /*SET UP PTR TO GROUP ID TABLE*/
         LA    @05,GRPTABL(,@09)                                01S0101
         ST    @05,GRPIDPTR                                     01S0101
*        GOTNCORE=TABLSIZE;            /*LENGTH OF CORE INTO WORKAREA*/
         ST    TABLSIZE,GOTNCORE(,WORKPTR)                      01S0102
*        FREECORE=ON;                  /*INDICATE CORE MUST BE FREED */
*        ISSUESTA=OFF;                 /*INIT ESTAE SWITCH           */
         OI    FREECORE(WORKPTR),B'10000000'                    01S0104
         NI    ISSUESTA(WORKPTR),B'10111111'                    01S0104
*/********************************************************************/
*/*                                                                  */
*/* SEGMENT NAME - ESTAPREP                                          */
*/*                                                                  */
*/* DESCRIPTIVE NAME - ESTAE ENVIRONMENT SET UP ROUTINE              */
*/*                                                                  */
*/* FUNCTION - CREATE ESTAE ENVIRONMENT FOR LOCK/UNLOCK PROCESSING   */
*/*   OPERATION -                                                    */
*/*     .IF AN ALLOCATION ESTAE IS THE ESTAE CURRENTLY IN EFFECT,THEN*/
*/*      A NEW ASWA IS BUILT AND CHAINED.                            */
*/*     .IF AN ALLOCATION ESTAE IS NOT THE ESTAE CURRENTLY IN EFFECT,*/
*/*      ISSUE AN ESTAE, AND THEN BUILD AND CHAIN NEW ASWA.          */
*/*                                                                  */
*/* ENTRY - IN-LINE SUBROUTINE                                       */
*/*   PURPOSE - ESTABLISH ESTAE ENVIRONMENT                          */
*/*   INPUT -                                                        */
*/*     JSCB - TO LOCATE CURRENT ASWA(JSCBASWA)                      */
*/*     TCB - TO LOCATE CURRENT SCB(TCBSTABB)                        */
*/*     ASWAPTR - POINTER TO CORE FOR NEW ASWA                       */
*/*                                                                  */
*/* EXIT - NORMAL                                                    */
*/*   CONDITION - ESTAE ENVIRONMENT SET UP                           */
*/*   OUTPUT - NEW ASWA                                              */
*/*            ESTAE ISSUED IF NECESSARY                             */
*/*                                                                  */
*/* EXIT - ERROR                                                     */
*/*   CONDITION - ESTAE FAILED                                       */
*/*   OUTPUT - NONE                                                  */
*/*   RETURN CODE - 4                                                */
*/*                                                                  */
*/********************************************************************/
*IF JSCBASWA^=ZERO &                   /*IF ALLOC ESTAE IS IN EFFECT */
*   JSCBASWA->ASWASCBP=TCBSTABB THEN   /*AND THE SCB IN ASWA IS THE
*                                        SAME AS SCB OF CURRENT ESTAE*/
         L     @10,@PC00001+12                                  02S0105
         L     @10,JSCBPTR(,@10)                                02S0105
         L     @05,JSCBASWA(,@10)                               02S0105
         CR    @05,@08                                          02S0105
         BE    @RF00105                                         02S0105
         L     @01,CVTPTR                                       02S0105
         L     @01,CVTTCBP(,@01)                                02S0105
         L     @01,TCBPTR(,@01)                                 02S0105
         SLR   @15,@15                                          02S0105
         ICM   @15,7,TCBSTABB(@01)                              02S0105
         C     @15,ASWASCBP(,@05)                               02S0105
         BNE   @RF00105                                         02S0105
*  DO;                                 /*THEN BUILD NEW ASWA & CHAIN */
*    ASWAID=ECASWAID;                  /*INSERT ID OF ASWA BLOCK     */
         MVC   ASWAID(4,@09),@CC00116                           02S0107
*    ASWACSCT=ECESTAEX;                /*CSECT NAME-LKUNLK ESTAE EXIT*/
         MVC   ASWACSCT(8,@09),@CC00118                         02S0108
*    ASWARTNP=ADDR(IEFAB4E7);          /*ADDRESS OF LKUNLK ESTAE EXIT*/
         L     @14,@CV00180                                     02S0109
         ST    @14,ASWARTNP(,@09)                               02S0109
*    ASWAPRMS=LOCKPAP;                 /*PTR TO INPUT PARMS FOR CSECT*/
         ST    LOCKPAP,ASWAPRMS(,@09)                           02S0110
*    ASWASCBP=TCBSTABB;                /*SCB PTR FOR ESTAE IN EFFECT */
         ST    @15,ASWASCBP(,@09)                               02S0111
*    ASWAOLDP=ZERO;                    /*NO PRIOR ALLOCATION ESTAE   */
         ST    @08,ASWAOLDP(,@09)                               02S0112
*    ASWAFLGS=ZERO;                    /*NO SPECIAL PROCESSING       */
         ST    @08,ASWAFLGS(,@09)                               02S0113
*    ASWAAUTO=ZERO;                    /*ZERO OUT. NOT FIRST ASWA    */
         ST    @08,ASWAAUTO(,@09)                               02S0114
*    ASWACHNP=JSCBASWA;                /*CHAIN NEW TO PRECEEDING ASWA*/
         ST    @05,ASWACHNP(,@09)                               02S0115
*     DO; /*MODESET  KEYADDR(ZERO)*/                            02S0116
*       SPKA (ZERO); /*SET PSW KEY*/                            02S0117
         SPKA  0(@08)                                           02S0117
*     END; /*MODESET  KEYADDR(ZERO)*/           /*KEY ZERO TO UPDATE JS
*B     */                                                       02S0118
*    JSCBASWA=ASWAPTR;                 /*POINT JSCB TO NEW LAST ASWA */
         ST    @09,JSCBASWA(,@10)                               02S0119
*     DO; /*MODESET  EXTKEY(SCHED)*/                            02S0120
*       SPKA (16); /*SET PSW KEY*/                              02S0121
         LA    @10,16                                           02S0121
         SPKA  0(@10)                                           02S0121
*     END; /*MODESET  EXTKEY(SCHED)*/           /*BACK TO SCHEDULER KEY
*      */                                                       02S0122
*  END;                                /*ASWA BUILT AND CHAINED      */
*ELSE                                  /*ELSE                        */
*  DO;                                 /*ISSUE ESTAE AND BUILD ASWA  */
         B     @RC00105                                         02S0124
@RF00105 DS    0H                                               02S0125
*    ASWAID=ECASWAID;                  /*BUILD ASWA: INSERT ID       */
         L     @10,@PC00001+16                                  02S0125
         L     @10,ASWAPTR(,@10)                                02S0125
         MVC   ASWAID(4,@10),@CC00116                           02S0125
*    ASWACSCT=ECESTAEX;                /*CSECT NAME-LKUNLK ESTAE EXIT*/
         MVC   ASWACSCT(8,@10),@CC00118                         02S0126
*    ASWARTNP=ADDR(IEFAB4E7);          /*ADDRESS OF LKUNLK ESTAE EXIT*/
         L     @05,@CV00180                                     02S0127
         ST    @05,ASWARTNP(,@10)                               02S0127
*    ASWAPRMS=LOCKPAP;                 /*PTR TO INPUT PARMS FOR CSECT*/
         ST    LOCKPAP,ASWAPRMS(,@10)                           02S0128
*    ASWAOLDP=JSCBASWA;                /*PTR TO PRIOR ALLOCATION ASWA*/
         L     @05,@PC00001+12                                  02S0129
         L     @05,JSCBPTR(,@05)                                02S0129
         MVC   ASWAOLDP(4,@10),JSCBASWA(@05)                    02S0129
*    ASWAFLGS=ZERO;                    /*NO SPECIAL PROCESSING       */
         SLR   @05,@05                                          02S0130
         ST    @05,ASWAFLGS(,@10)                               02S0130
*    ASWAAUTO=ASWAPTR+LENGTH(ASWA);    /*PTR TO AUTO DATA FOR COMMON
*                                        ESTAE EXIT. FIRST ASWA ONLY */
         LA    @15,40                                           02S0131
         ALR   @15,@10                                          02S0131
         ST    @15,ASWAAUTO(,@10)                               02S0131
*    ASWACHNP=ZERO;                    /*ONLY ASWA - NO BACKWARD PTR */
         ST    @05,ASWACHNP(,@10)                               02S0132
*    ESTAEPL(1:ESTAELEN)=ESTAELST(1:ESTAELEN);     /*INITIALIZE ESTAE
*                                        PROTOTYPE FROM STATIC LIST  */
         L     @05,ESTAELEN                                     02S0133
         BCTR  @05,0                                            02S0133
         EX    @05,@SM01882                                     02S0133
*    RFY (EXITADDR,PARMPTR) RSTD;                               02S0134
*    EXITADDR=ADDR(IEFAB4ED);          /*SET ESTAE EXIT RTN ADDR     */
         L     EXITADDR,@CV00179                                02S0135
*    PARMPTR=ASWAPTR;                  /*SET PTR TO ESTAE PARMS      */
         LR    PARMPTR,@10                                      02S0136
*    GEN REFS(EXITADDR,PARMPTR);                                02S0137
      ESTAE (EXITADDR),PARAM=(PARMPTR),TERM=YES,RECORD=YES,           **
               MF=(E,ESTAEPL)
*    RFY (EXITADDR,PARMPTR) UNRSTD;                             02S0138
*    IF REG15=ZERO THEN                /*IF ESTAE IS SUCCESSFUL THEN */
         SLR   @14,@14                                          02S0139
         CR    REG15,@14                                        02S0139
         BNE   @RF00139                                         02S0139
*      DO;                             /*COMPLETE AND CHAIN ASWA     */
*        ISSUESTA=ON;                  /*INDICATE ESTAE TO BE ISSUED */
         OI    ISSUESTA(WORKPTR),B'01000000'                    02S0141
*        ASWASCBP=TCBSTABB;            /*SCB PTR FOR ESTAE IN EFFECT */
         L     @10,@PC00001+16                                  02S0142
         L     @10,ASWAPTR(,@10)                                02S0142
         L     @05,CVTPTR                                       02S0142
         L     @05,CVTTCBP(,@05)                                02S0142
         L     @05,TCBPTR(,@05)                                 02S0142
         SLR   @15,@15                                          02S0142
         ICM   @15,7,TCBSTABB(@05)                              02S0142
         ST    @15,ASWASCBP(,@10)                               02S0142
*         DO; /*MODESET  KEYADDR(ZERO)*/                        02S0143
*           SPKA (ZERO); /*SET PSW KEY*/                        02S0144
         SPKA  0(@14)                                           02S0144
*         END; /*MODESET  KEYADDR(ZERO)*/       /*KEY ZERO TO UPDATE JS
*B     */                                                       02S0145
*        JSCBASWA=ASWAPTR;             /*POINT JSCB TO NEW ASWA      */
         L     @05,@PC00001+12                                  02S0146
         L     @05,JSCBPTR(,@05)                                02S0146
         ST    @10,JSCBASWA(,@05)                               02S0146
*         DO; /*MODESET  EXTKEY(SCHED)*/                        02S0147
*           SPKA (16); /*SET PSW KEY*/                          02S0148
         LA    @10,16                                           02S0148
         SPKA  0(@10)                                           02S0148
*         END; /*MODESET  EXTKEY(SCHED)*/       /*BACK TO SCHEDULER KEY
*      */                                                       02S0149
*      END;                            /*ASWA BUILT AND CHAINED      */
*    ELSE                              /*ESTAE NOT SUCCESSFUL        */
*      RETCODE=ESTAFAIL;               /*SHOW THAT ESTAE FAILED      */
         B     @RC00139                                         02S0151
@RF00139 LA    RETCODE,4                                        02S0151
*  END;                                /*END OF ESTAE SETUP          */
@RC00139 DS    0H                                               02S0153
*        IF RETCODE=ZERO THEN          /*IF ESTAE ENVIRONMENT SET UP */
@RC00105 LTR   RETCODE,RETCODE                                  01S0153
         BNZ   @RF00153                                         01S0153
*          DO;                         /*THEN DO ENQ'S AND INIT Q-MGR*/
*            ENQBEGIN(1:ENQLEN)=LOCKENQ(1:ENQLEN); /*MOVE ENQ LIST TO
*                                                    GOTTEN CORE     */
         L     @10,ENQLEN                                       01S0155
         BCTR  @10,0                                            01S0155
         EX    @10,@SM01885                                     01S0155
*            GEN REFS(ENQLIST);                                 01S0156
              ENQ (SYSQNAME,SYSALLOC,S,2,SYSTEM),MF=(E,ENQLIST)
*/********************************************************************/
*/*                                                                  */
*/* SEGMENT NAME - LOCKINIT                                          */
*/*                                                                  */
*/* DESCRIPTIVE NAME - QMGR INITIALIZATION/GROUP LOCK PROCESSOR      */
*/*                                                                  */
*/* FUNCTION - INTERFACE WITH ALLOCATION Q-MANAGER FOR INITIALIZATION*/
*/*            AND GROUP LOCKING                                     */
*/*   OPERATION -                                                    */
*/*     .THIS ROUTINE MUST FIRST INITIALIZE THE ALLOCATION Q-MGR.    */
*/*      IF THIS INITIALIZATION IS SUCCESSFUL, THEN THE INPUT LIST   */
*/*      OF UCB ADDRESSES IS PASSED TO THE UNIT VERIFICATION ROUTINE */
*/*      (IEFAB4UV) WHICH RETURNS, IN A GROUP ID TABLE, A GROUP ID   */
*/*      FOR EACH UCB ADDRESS. THE GROUPS IDS ARE THEN CONVERTED TO  */
*/*      A GROUP MASK WHICH IS PASSED TO THE ALLOCATION Q-MANAGER    */
*/*      (IEFAB4FA) FOR GROUP LOCKING.                               */
*/*                                                                  */
*/* ENTRY - IN-LINE SUBROUTINE                                       */
*/*   PURPOSE - DO QMGR INITIALIZATION AND GROUP LOCKING             */
*/*   INPUT -                                                        */
*/*     GMASKPTR - POINTER TO GROUP MASK                             */
*/*     LISTPTR - POINTER TO INPUT                                   */
*/*     GRPIDPTR - POINTER TO CORE FOR GROUP ID TABLE                */
*/*                                                                  */
*/* EXIT - NORMAL -                                                  */
*/*   CONDITION - QMGR INITIALIZED SUCCESSFULLY AND GROUPS LOCKED    */
*/*   OUTPUT - GROUPS LOCKED                                         */
*/*   RETURN CODE - 0                                                */
*/*                                                                  */
*/* EXIT - ERROR -                                                   */
*/*   CONDITION - QMGR INITIALIZATION FAILED                         */
*/*   OUTPUT - NONE                                                  */
*/*   RETURN CODE - 12                                               */
*/*                                                                  */
*/* EXIT - ERROR -                                                   */
*/*   CONDITION - GROUP MASK CORRESPONDING TO INPUT UCB LIST IS ZERO */
*/*   OUTPUT - NONE                                                  */
*/*   RETURN CODE - 8                                                */
*/*                                                                  */
*/********************************************************************/
*EDTPTR = ADDR(EDTTAB);                /*SET UP PTR TO EDT   @ZA06968*/
         L     EDTPTR,@CA00178                                  02S0157
*AQMECODE=INITQMGR;                    /*INDICATE QMGR INITIALIZATION*/
         L     @10,QMPARMP(,LOCKPAP)                            02S0158
         MVC   AQMECODE(2,@10),@CH00046                         02S0158
*AQMASID(3:4)=ASCBASID;                /*INSERT ASID FROM ASCB       */
         L     @05,PSAAOLD                                      02S0159
         MVC   AQMASID+2(2,@10),ASCBASID(@05)                   02S0159
*AQMLENGT=GMTENTLN;                    /*INSERT GROUP MASK LENGTH
*                                                            @ZA06968*/
         L     @05,EDTMSKTP(,EDTPTR)                            02S0160
         MVC   AQMLENGT(4,@10),GMTENTLN(@05)                    02S0160
*QMECB=QMECB&&QMECB;                   /*INITIALIZE ECB              */
         L     @05,QMECB                                        02S0161
         LR    @15,@05                                          02S0161
         XR    @15,@05                                          02S0161
         ST    @15,QMECB                                        02S0161
*AQMCANCP=ADDR(QMECB);                 /*INSERT ADDRESS OF ECB       */
         LA    @05,QMECB                                        02S0162
         ST    @05,AQMCANCP(,@10)                               02S0162
*CALL IEFAB4FA(QMPARMP,0);             /*INITIALIZE Q-MGR            */
         LA    @10,QMPARMP(,LOCKPAP)                            02S0163
         ST    @10,@AL00001                                     02S0163
         LA    @10,@CF00139                                     02S0163
         ST    @10,@AL00001+4                                   02S0163
         L     @15,@CV00181                                     02S0163
         LA    @01,@AL00001                                     02S0163
         BALR  @14,@15                                          02S0163
*IF REG15=ZERO THEN                    /*IF QMGR INITIALIZED OK      */
         LTR   REG15,REG15                                      02S0164
         BNZ   @RF00164                                         02S0164
*  DO;                                 /*SET UP TO LOCK GROUPS       */
*    QMGRINIT=ON;                      /*SET ESTAE FLAG FOR QMGR INIT*/
         OI    QMGRINIT(LOCKPAP),B'10000000'                    02S0166
*    FLAGS4UV=FLAGS4UV&&FLAGS4UV;      /*CLEAR INPUT FLAGS FOR 4UV   */
         XC    FLAGS4UV(2),FLAGS4UV                             02S0167
*    RETGRPID=ON;                      /*TELL 4UV TO RETURN GROUP IDS*/
         OI    RETGRPID,B'00001000'                             02S0168
*    UCBLPTR=LISTPTR;                  /*SET PTR TO UCBLIST FOR 4UV  */
         L     @10,@PC00001+4                                   02S0169
         MVC   UCBLPTR(4),LISTPTR(@10)                          02S0169
*    CALL IEFAB4UV(INPUT4UV,FLAGS4UV); /*CALL IEFAB4UV-GET GRPID LIST*/
         LA    @10,INPUT4UV                                     02S0170
         ST    @10,@AL00001                                     02S0170
         LA    @10,FLAGS4UV                                     02S0170
         ST    @10,@AL00001+4                                   02S0170
         L     @15,@CV00182                                     02S0170
         LA    @01,@AL00001                                     02S0170
         BALR  @14,@15                                          02S0170
*    DO LISTCTR=1 TO UCBNOENT;         /*PROCESS ID LIST-BUILD MASK  */
         LA    LISTCTR,1                                        02S0171
         B     @DE00171                                         02S0171
@DL00171 DS    0H                                               02S0172
*      IF GROUPID(LISTCTR)=ZERO THEN   /*IF UCB COULD NOT BE FOUND,  */
         SLR   @10,@10                                          02S0172
         LR    @05,LISTCTR                                      02S0172
         SLA   @05,2                                            02S0172
         L     @03,GRPIDPTR                                     02S0172
         AL    @03,@CF01889                                     02S0172
         C     @10,GROUPID(@05,@03)                             02S0172
         BNE   @RF00172                                         02S0172
*        UCBADDRS(LISTCTR)=ZERO;       /*ZERO UCB ADDR IN INPUT LIST */
         L     @03,@PC00001+4                                   02S0173
         L     @03,LISTPTR(,@03)                                02S0173
         ST    @10,UCBADDRS-4(@05,@03)                          02S0173
*      ELSE                            /*ELSE                        */
*        DO;                                                    02S0174
         B     @RC00172                                         02S0174
@RF00172 DS    0H                                               02S0175
*          GRMSKBYT=GROUPID(LISTCTR)/  /*GET POSITION OF BYTE IN MASK*/
*                   LENGTH(GROUPMSK);                           02S0175
         LA    @10,8                                            02S0175
         LR    @15,LISTCTR                                      02S0175
         SLA   @15,2                                            02S0175
         L     @01,GRPIDPTR                                     02S0175
         AL    @01,@CF01889                                     02S0175
         L     @15,GROUPID(@15,@01)                             02S0175
         LR    @00,@15                                          02S0175
         SRDA  @00,32                                           02S0175
         DR    @00,@10                                          02S0175
         LR    GRMSKBYT,@01                                     02S0175
*          GRMSKBIT=GROUPID(LISTCTR)// /*GET POSITION OF BIT IN BYTE */
*                   LENGTH(GROUPMSK);                           02S0176
         LR    @00,@15                                          02S0176
         SRDA  @00,32                                           02S0176
         D     @00,@CF00044                                     02S0176
         LR    GRMSKBIT,@00                                     02S0176
*          IF GRMSKBIT=ZERO THEN       /*BIT POSITION ZERO MEANS LAST*/
         CH    GRMSKBIT,@CH00139                                02S0177
         BNE   @RF00177                                         02S0177
*            GRMSKBIT=LENGTH(GROUPMSK);/*SET FOR LAST BIT POSITION   */
         LR    GRMSKBIT,@10                                     02S0178
*          ELSE                                                 02S0179
*            GRMSKBYT=GRMSKBYT + ONE;  /*ADJUST BYTE POSITION        */
         B     @RC00177                                         02S0179
@RF00177 LA    GRMSKBYT,1(,GRMSKBYT)                            02S0179
*          GROUPMSK(GRMSKBYT)=         /*LOCATE PROPER BYTE IN MASK  */
*            GROUPMSK(GRMSKBYT)×MASKTAB(GRMSKBIT); /*TURN ON PROP BIT*/
@RC00177 L     @10,@PC00001+8                                   02S0180
         L     @10,GMASKPTR(,@10)                               02S0180
         ALR   @10,GRMSKBYT                                     02S0180
         BCTR  @10,0                                            02S0180
         LA    @01,MASKTAB-1(GRMSKBIT)                          02S0180
         OC    GROUPMSK(1,@10),0(@01)                           02S0180
*        END;                                                   02S0181
*    END;                              /*MASK IS BUILT               */
@RC00172 AH    LISTCTR,@CH00046                                 02S0182
@DE00171 L     @10,@PC00001+4                                   02S0182
         L     @10,LISTPTR(,@10)                                02S0182
         C     LISTCTR,UCBNOENT(,@10)                           02S0182
         BNH   @DL00171                                         02S0182
*    IF GMASKMAP=ZMASK THEN            /*IF NO UCBS FOUND            */
         L     @10,@PC00001+8                                   02S0183
         L     @10,GMASKPTR(,@10)                               02S0183
         CLC   GMASKMAP(240,@10),ZMASK                          02S0183
         BNE   @RF00183                                         02S0183
*      RETCODE=NOGRPLCK;               /*INDICATE NO GRPS SERIALIZED */
         LA    RETCODE,8                                        02S0184
*    ELSE                              /*ELSE PREPARE FOR QMGR LOCK  */
*      DO;                             /*BY SETTING UP QMGR PARMS    */
         B     @RC00183                                         02S0185
@RF00183 DS    0H                                               02S0186
*        AQMECODE=LOCKQMGR;            /*INDICATE LOCK TO QMGR       */
         L     @10,QMPARMP(,LOCKPAP)                            02S0186
         MVC   AQMECODE(2,@10),@CH00122                         02S0186
*        AQMQCODE=OWNRSHIP;            /*INDICATE GROUP OWNERSHIP-AB */
         MVC   AQMQCODE(2,@10),@CC00131                         02S0187
*        AQMMASKP=GMASKPTR;            /*SET UP PTR TO GROUP MASK    */
         L     @05,@PC00001+8                                   02S0188
         MVC   AQMMASKP(4,@10),GMASKPTR(@05)                    02S0188
*        CALL IEFAB4FA(QMPARMP,0);     /*CALL QMGR TO LOCK           */
         LA    @10,QMPARMP(,LOCKPAP)                            02S0189
         ST    @10,@AL00001                                     02S0189
         LA    @10,@CF00139                                     02S0189
         ST    @10,@AL00001+4                                   02S0189
         L     @15,@CV00181                                     02S0189
         LA    @01,@AL00001                                     02S0189
         BALR  @14,@15                                          02S0189
*      END;                            /*QMGR LOCK DONE              */
*  END;                                /*END OF LOCKING SETUP        */
*ELSE                                  /*QMGR INITIALIZATION FAILED  */
*  RETCODE=COREFAIL;                   /*SET RETURN CODE FOR THIS    */
         B     @RC00164                                         02S0192
@RF00164 LA    RETCODE,12                                       02S0192
*            IF RETCODE = ZERO THEN    /* GROUPS LOCKED      @ZA08109*/
@RC00164 LTR   RETCODE,RETCODE                                  01S0193
         BNZ   @RF00193                                         01S0193
*               DO;                    /* ENQ RESOURCES      @ZA08109*/
*                 ENQSDONE = ON;       /* RESOURCES ENQ'D    @ZA08109*/
         OI    ENQSDONE(WORKPTR),B'00100000'                    01S0195
*                 ENQBEGIN(1:ENQLEN)=LOCKENQ(1:ENQLEN); /*   @ZA08109*/
         L     @10,ENQLEN                                       01S0196
         BCTR  @10,0                                            01S0196
         EX    @10,@SM01885                                     01S0196
*                 GEN REFS(ENQLIST);   /*                       01S0197
                   ENQ (SYSQNAME,SYSRNAME,S,8,SYSTEM),MF=(E,ENQLIST)
*                  IF DDRTPUR = ON THEN /*ANY TAPE×UR REQ'S  @ZA32215*/
         L     @10,@PC00001                                     01S0198
         TM    DDRTPUR(@10),B'00100000'                         01S0198
         BNO   @RF00198                                         01S0198
*                    DO;               /*YES, ENQ DDR TAPE×UR@ZA32215*/
*                      GEN REFS(ENQLIST); /*                 @ZA32215*/
                     ENQ (SYSQNAME,SYSRNME1,S,7,SYSTEM),MF=(E,ENQLIST)
*                    END;              /*END ENQ DDR TAPE×UR @ZA32215*/
*                  IF DDRDA = ON THEN  /*ANY DA REQUESTS     @ZA32215*/
@RF00198 L     @10,@PC00001                                     01S0202
         TM    DDRDA(@10),B'00010000'                           01S0202
         BNO   @RF00202                                         01S0202
*                    DO;               /*YES, ENQ DDR DA     @ZA32215*/
*                      GEN REFS(ENQLIST); /*                 @ZA32215*/
                     ENQ (SYSQNAME,SYSRNME2,S,5,SYSTEM),MF=(E,ENQLIST)
*                    END;              /*END ENQ DDR DA      @ZA32215*/
*               END;                   /*                    @ZA08109*/
*            ELSE                      /*                    @ZA08109*/
*              ENQSDONE = OFF;         /* ENQ NOT DONE       @ZA08109*/
         B     @RC00193                                         01S0207
@RF00193 NI    ENQSDONE(WORKPTR),B'11011111'                    01S0207
*          END;                                                 01S0208
*        ELSE;                         /*ESTAE SET UP NOT SUCCESSFUL */
@RF00153 DS    0H                                               01S0210
*      END;                                                     01S0210
*    ELSE                              /*ELSE GETSTORG FAILED        */
*      DO;                                                      01S0211
         B     @RC00094                                         01S0211
@RF00094 DS    0H                                               01S0212
*        GETFAIL=ON;                   /*INDICATE GETSTORG FAILED    */
         OI    GETFAIL,B'10000000'                              01S0212
*        RETCODE=COREFAIL;             /*SET RETURN CODE - 12        */
         LA    RETCODE,12                                       01S0213
*      END;                                                     01S0214
*  END;                                                         01S0215
*ELSE;                                                          01S0216
@RF00066 DS    0H                                               01S0217
*IF GETFAIL=OFF THEN                   /*GETSTORG DID NOT FAIL ON LCK*/
@RC00066 TM    GETFAIL,B'10000000'                              01S0217
         BNZ   @RF00217                                         01S0217
*  IF UNLKGRP=ON ×                     /*IF UNLOCK REQUESTED OR      */
*     RETCODE^=ZERO THEN               /*LOCKING FAILED AND MUST BE
*                                        CLEANED UP THEN             */
         L     @10,@PC00001                                     01S0218
         TM    UNLKGRP(@10),B'01000000'                         01S0218
         BO    @RT00218                                         01S0218
         LTR   RETCODE,RETCODE                                  01S0218
         BZ    @RF00218                                         01S0218
@RT00218 DS    0H                                               01S0219
*    DO;                                                        01S0219
*      WORKPTR=ADDR(WORKTABL);         /*SET UP PTR TO WORK AREA     */
         L     @10,@PC00001+16                                  01S0220
         L     @10,ASWAPTR(,@10)                                01S0220
         LA    WORKPTR,WORKTABL(,@10)                           01S0220
*      LOCKPAP=ADDR(ESTAPRMS);         /*SET UP PTR TO ESTAE PARMS   */
         LA    LOCKPAP,ESTAPRMS(,@10)                           01S0221
*      IF QMGRINIT=ON THEN             /*IF QMGR WAS INITIALIZED THEN*/
         TM    QMGRINIT(LOCKPAP),B'10000000'                    01S0222
         BNO   @RF00222                                         01S0222
*        DO;                           /*PREPARE TO TERMINATE IT     */
*          QMPARMP=ADDR(QMGRPRMS);     /*SET UP PTR TO QMGR PARMS    */
         LA    @10,QMGRPRMS(,@10)                               01S0224
         ST    @10,QMPARMP(,LOCKPAP)                            01S0224
*          AQMECODE=TERMQMGR;          /*INDICATE QMGR TERMINATION   */
         MVC   AQMECODE(2,@10),@CH00130                         01S0225
*          CALL IEFAB4FA(QMPARMP,0);   /*TERMINATE QMGR              */
         LA    @10,QMPARMP(,LOCKPAP)                            01S0226
         ST    @10,@AL00001                                     01S0226
         LA    @10,@CF00139                                     01S0226
         ST    @10,@AL00001+4                                   01S0226
         L     @15,@CV00181                                     01S0226
         LA    @01,@AL00001                                     01S0226
         BALR  @14,@15                                          01S0226
*          QMGRINIT=OFF;               /*SHOW THAT QMGR NOT INIT'LZED*/
         NI    QMGRINIT(LOCKPAP),B'01111111'                    01S0227
*        END;                                                   01S0228
*      ELSE;                                                    01S0229
@RF00222 DS    0H                                               01S0230
*      ENQBEGIN(1:ENQLEN)=LOCKENQ(1:ENQLEN); /*MOVE ENQ LIST TO 01S0230
*                                              GOTTON CORE           */
         L     @10,ENQLEN                                       01S0230
         BCTR  @10,0                                            01S0230
         EX    @10,@SM01885                                     01S0230
*      IF ENQSDONE = OFF THEN          /*ONLY Q4 ENQ'D       @ZA08109*/
         TM    ENQSDONE(WORKPTR),B'00100000'                    01S0231
         BNZ   @RF00231                                         01S0231
*        DO;                           /*DEQ Q4 ONLY         @ZA08109*/
*          GEN REFS(ENQLIST);          /*DEQ FROM Q4         @ZA08109*/
            DEQ (SYSQNAME,SYSALLOC,2,SYSTEM),MF=(E,ENQLIST)
*        END;                          /*                    @ZA08109*/
*      ELSE                            /*ALL RESOURCES ENQD  @ZA08109*/
*        DO;                           /*DEQ ALL RESOURCES   @ZA08109*/
         B     @RC00231                                         01S0235
@RF00231 DS    0H                                               01S0236
*          GEN REFS(ENQLIST);          /*PREPARE TO DEQ FROM 4 RSRCES*/
            DEQ (SYSQNAME,SYSRNAME,8,SYSTEM),MF=(E,ENQLIST)
            DEQ (SYSQNAME,SYSALLOC,2,SYSTEM),MF=(E,ENQLIST)
            DEQ (SYSQNAME,SYSRNME1,7,SYSTEM),RET=HAVE,MF=(E,ENQLIST)
            DEQ (SYSQNAME,SYSRNME2,5,SYSTEM),RET=HAVE,MF=(E,ENQLIST)
*        END;                          /*                    @ZA08109*/
*       DO; /*MODESET  KEYADDR(ZERO)*/                          01S0238
@RC00231 DS    0H                                               01S0239
*         SPKA (ZERO); /*SET PSW KEY*/                          01S0239
         SLR   @10,@10                                          01S0239
         SPKA  0(@10)                                           01S0239
*       END; /*MODESET  KEYADDR(ZERO)*/         /*KEY ZERO TO UPDATE JS
*B     */                                                       01S0240
*      IF ISSUESTA=ON THEN             /*IF AN ESTAE WAS ISSUED THEN */
         TM    ISSUESTA(WORKPTR),B'01000000'                    01S0241
         BNO   @RF00241                                         01S0241
*        JSCBASWA=ASWAOLDP;            /*SET PTR TO ZERO OR OLD LAST */
         L     @10,@PC00001+12                                  01S0242
         L     @10,JSCBPTR(,@10)                                01S0242
         L     @15,@PC00001+16                                  01S0242
         L     @01,ASWAPTR(,@15)                                01S0242
         MVC   JSCBASWA(4,@10),ASWAOLDP(@01)                    01S0242
*      ELSE                            /*ELSE IF NO ESTAE ISSUED,    */
*        JSCBASWA=ASWACHNP;            /*SET TO PRECEEDING ASWA      */
         B     @RC00241                                         01S0243
@RF00241 L     @10,@PC00001+12                                  01S0243
         L     @10,JSCBPTR(,@10)                                01S0243
         L     @15,@PC00001+16                                  01S0243
         L     @01,ASWAPTR(,@15)                                01S0243
         MVC   JSCBASWA(4,@10),ASWACHNP(@01)                    01S0243
*       DO; /*MODESET  EXTKEY(SCHED)*/                          01S0244
@RC00241 DS    0H                                               01S0245
*         SPKA (16); /*SET PSW KEY*/                            01S0245
         LA    @10,16                                           01S0245
         SPKA  0(@10)                                           01S0245
*       END; /*MODESET  EXTKEY(SCHED)*/         /*BACK TO SCHEDULE KEY
*      */                                                       01S0246
*      IF ISSUESTA=ON THEN             /*IF AN ESTAE WAS ISSUED, THEN*/
         TM    ISSUESTA(WORKPTR),B'01000000'                    01S0247
         BNO   @RF00247                                         01S0247
*        DO;                           /*CANCEL ESTAE                */
*          GEN REFS(ESTAEPL);                                   01S0249
            ESTAE 0,MF=(E,ESTAEPL)
*        END;                          /*CANCEL ESTAE DONE           */
*      ELSE;                           /*NO ESTAE ISSUED, DO NOTHING */
@RF00247 DS    0H                                               01S0252
*      RFY (REG0,REG1) RSTD;                                    01S0252
*      SUBPLNO=SP230;                  /*SUBPOOL OF CORE TO BE FREED */
         MVC   SUBPLNO(1),SP230                                 01S0253
*      CORELNTH=GOTNCORE;              /*LENGTH OF CORE TO BE FREED  */
         MVC   CORELNTH(3),GOTNCORE+1(WORKPTR)                  01S0254
*      REG0=FREEINFO;                  /*SUBPOOL AND LENGTH TO REG0  */
         L     REG0,FREEINFO                                    01S0255
*      REG1=ASWAPTR;                   /*PTR TO AREA TO BE FREED     */
         L     @10,@PC00001+16                                  01S0256
         L     REG1,ASWAPTR(,@10)                               01S0256
*      GEN (FREEMAIN R,LV=(0),A=(1));  /*FREE CORE                   */
         FREEMAIN R,LV=(0),A=(1)
*      RFY (REG0,REG1) UNRSTD;         /*                            */
*    END;                              /*LAST CALL PROCESSING DONE   */
*  ELSE;                                                        01S0260
@RF00218 DS    0H                                               01S0261
*ELSE;                                                          01S0261
@RF00217 DS    0H                                               01S0262
*RETURN CODE(RETCODE);                 /*RETURN TO CALLER            */
         IC    @02,@OLDKEY                                      01S0262
         L     @13,4(,@13)                                      01S0262
         L     @00,@SIZDATD                                     01S0262
         LR    @01,@11                                          01S0262
         FSPACE   R,LV=(0),A=(1)
         MODESET KEYADDR=(2)
         LR    @15,@07                                          01S0262
         L     @14,12(,@13)                                     01S0262
         LM    @00,@12,20(@13)                                  01S0262
         BR    @14                                              01S0262
*END IEFAB4EC                                                   01S0263
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.      *
*/*%INCLUDE SYSLIB  (A4ECSPEC)                                        *
*/*%INCLUDE SYSLIB  (A4ECDATA)                                        *
*/*%INCLUDE SYSLIB  (CVT     )                                        *
*/*%INCLUDE SYSLIB  (IEFZB421)                                        *
*/*%INCLUDE SYSLIB  (IEFZB427)                                        *
*/*%INCLUDE SYSLIB  (IEFZB453)                                        *
*/*%INCLUDE SYSLIB  (IEZJSCB )                                        *
*/*%INCLUDE SYSLIB  (IHAASCB )                                        *
*/*%INCLUDE SYSLIB  (IHAPSA  )                                        *
*/*%INCLUDE SYSLIB  (IKJTCB  )                                        *
*/*%INCLUDE SYSLIB  (ESTAPREP)                                        *
*/*%INCLUDE SYSLIB  (ESTASPEC)                                        *
*/*%INCLUDE SYSLIB  (LOCKINIT)                                        *
*/*%INCLUDE SYSLIB  (LOCKSPEC)                                        *
*;                                                              01S0263
@DATA    DS    0H
@CH00046 DC    H'1'
@CH00130 DC    H'2'
@CH00122 DC    H'3'
@CH01879 DC    H'782'
@SM01882 MVC   ESTAEPL(0),ESTAELST
@SM01885 MVC   ENQBEGIN(0),LOCKENQ
@DATD    DSECT
         DS    0F
@SA00001 DS    18F
@PC00001 DS    5F
@AL00001 DS    2A
IEFAB4EC CSECT
         DS    0F
@CF00139 DC    F'0'
@CH00139 EQU   @CF00139+2
@CF00044 DC    F'8'
@CF01889 DC    F'-4'
@DATD    DSECT
         DS    0D
QMECB    DS    F
LUVPTR   DS    A
GENPTR   DS    A
GRPTABP  DS    A
GRPPTR   DS    A
ASCBPTR  DS    A
GTSTRTCD DS    F
GETFAIL  DS    BL1
FLAGS4UV DS    BL2
         ORG   FLAGS4UV
@NM00003 DS    BL1
RETGRPID EQU   FLAGS4UV+0
@NM00004 EQU   FLAGS4UV+0
         ORG   FLAGS4UV+2
         DS    CL1
FREEINFO DS    CL4
         ORG   FREEINFO
SUBPLNO  DS    BL1
CORELNTH DS    AL3
         ORG   FREEINFO+4
INPUT4UV DS    CL8
         ORG   INPUT4UV
GRPIDPTR DS    AL4
UCBLPTR  DS    AL4
         ORG   INPUT4UV+8
@OLDKEY  DS    AL1
IEFAB4EC CSECT
         DS    0F
@SIZDATD DC    AL1(230)
         DC    AL3(@ENDDATD-@DATD)
@CA00178 DC    A(EDTTAB)
@CV00179 DC    V(IEFAB4ED)
@CV00180 DC    V(IEFAB4E7)
@CV00181 DC    V(IEFAB4FA)
@CV00182 DC    V(IEFAB4UV)
         DS    0D
GTSTZERO DC    F'0'
@CC00118 DC    C'IEFAB4E7'
@CC00116 DC    C'ASWA'
@CC00131 DC    C'AB'
SP230    DC    X'E6'
ZMASK    DS    CL240
         ORG   ZMASK
@NM00007 DC    B'00000000'
         DC    XL239'0'
         ORG   ZMASK+240
SYSALLOC DC    CL2'Q4'
SYSQNAME DC    CL8'SYSIEFSD'
SYSRNAME DC    CL8'CHNGDEVS'
SYSRNME1 DC    CL7'DDRTPUR'
SYSRNME2 DC    CL5'DDRDA'
MASKTAB  DC    X'80'
         DC    X'40'
         DC    X'20'
         DC    X'10'
         DC    X'08'
         DC    X'04'
         DC    X'02'
         DC    X'01'
IEFAB4EC CSECT
ESTAELST ESTAE TERM=YES,RECORD=YES,MF=L ESTAE MACRO PARM LIST
ESTAELEN DC A(*-ESTAELST)
@DATD    DSECT
ESTAEPL ESTAE TERM=YES,RECORD=YES,MF=L
@DATD    DSECT
ENQBEGIN  DS  0F
ENQLIST ENQ (,,S,,SYSTEM),MF=L,RET=HAVE
IEFAB4EC CSECT
LOCKENQ   DS  0F
         ENQ (,,S,,SYSTEM),MF=L,RET=HAVE
ENQLEN  DC    A(*-LOCKENQ)
IEFAB4EC CSECT
         DS   0H
PATCHLOC DC ((@DATA-@PSTART)/20)X'00'
@DATD    DSECT
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA
@ENDDATD EQU   *
IEFAB4EC CSECT
@00      EQU   00                      EQUATES FOR REGISTERS 0-15
@01      EQU   01
@02      EQU   02
@03      EQU   03
@04      EQU   04
@05      EQU   05
@06      EQU   06
@07      EQU   07
@08      EQU   08
@09      EQU   09
@10      EQU   10
@11      EQU   11
@12      EQU   12
@13      EQU   13
@14      EQU   14
@15      EQU   15
TABLSIZE EQU   @10
RETCODE  EQU   @07
LISTCTR  EQU   @02
GRMSKBYT EQU   @03
GRMSKBIT EQU   @05
WORKPTR  EQU   @06
LOCKPAP  EQU   @04
EDTPTR   EQU   @02
BLKPTR   EQU   @09
EXITADDR EQU   @02
PARMPTR  EQU   @03
REG0     EQU   @00
REG1     EQU   @01
REG15    EQU   @15
GTSTR0   EQU   @00
GTSTR1   EQU   @01
GTSTR2   EQU   @02
GTSTR15  EQU   @15
GTSTR4   EQU   @04
GTSTR5   EQU   @05
GTSTR6   EQU   @06
GTSTR7   EQU   @07
GTSTR8   EQU   @08
GTSTR3   EQU   @03
         EXTRN EDTTAB
CVTPTR   EQU   16
PSA      EQU   0
FLCRNPSW EQU   PSA
FLCROPSW EQU   PSA+8
FLCICCW2 EQU   PSA+16
PSAEEPSW EQU   PSA+132
PSAESPSW EQU   PSA+136
FLCSVILC EQU   PSAESPSW+1
PSAEPPSW EQU   PSA+140
FLCPIILC EQU   PSAEPPSW+1
FLCPICOD EQU   PSAEPPSW+2
PSAPICOD EQU   FLCPICOD+1
FLCTEA   EQU   PSAEPPSW+4
FLCPER   EQU   PSA+152
FLCMCLA  EQU   PSA+168
FLCIOEL  EQU   FLCMCLA+4
FLCIOA   EQU   FLCMCLA+16
FLCFSA   EQU   FLCMCLA+80
PSAAOLD  EQU   PSA+548
PSASUPER EQU   PSA+552
PSASUP1  EQU   PSASUPER
PSASUP2  EQU   PSASUPER+1
PSASUP3  EQU   PSASUPER+2
PSASUP4  EQU   PSASUPER+3
PSACLHT  EQU   PSA+640
PSALKSA  EQU   PSA+696
PSAHLHI  EQU   PSA+760
PSADSSFL EQU   PSA+836
PSADSSF1 EQU   PSADSSFL
PSADSSF3 EQU   PSADSSFL+2
PSADSSF4 EQU   PSADSSFL+3
PSARSVT  EQU   PSA+896
GROUPMSK EQU   0
UCBLIST  EQU   0
UCBNOENT EQU   UCBLIST
UCBADDRS EQU   UCBLIST+4
TCBPTRS  EQU   0
TCBPTR   EQU   TCBPTRS+4
GROUPID  EQU   0
LOCKESPA EQU   0
QMPARMP  EQU   LOCKESPA+200
LOCKFMAP EQU   LOCKESPA+204
QMGRINIT EQU   LOCKFMAP
WORKAREA EQU   0
COREPTR  EQU   WORKAREA
GOTNCORE EQU   WORKAREA+4
WORKFMAP EQU   WORKAREA+8
FREECORE EQU   WORKFMAP
ISSUESTA EQU   WORKFMAP
ENQSDONE EQU   WORKFMAP
CVTMAP   EQU   0
CVTTCBP  EQU   CVTMAP
CVTDAR   EQU   CVTMAP+72
CVTFLGS1 EQU   CVTDAR
CVTDCB   EQU   CVTMAP+116
CVTIOQET EQU   CVTMAP+120
CVTIERLC EQU   CVTMAP+144
CVTHEAD  EQU   CVTMAP+160
CVTSV76C EQU   CVTHEAD
CVTOPTA  EQU   CVTMAP+182
CVTOPTB  EQU   CVTMAP+183
CVTGTF   EQU   CVTMAP+236
CVTGTFST EQU   CVTGTF
CVTGTFS  EQU   CVTGTFST
CVTSTATE EQU   CVTGTFST
CVTTMODE EQU   CVTGTFST
CVTFORM  EQU   CVTGTFST
CVTAQAVT EQU   CVTMAP+240
CVTTCMFG EQU   CVTAQAVT
CVTVOLM2 EQU   CVTMAP+244
CVTTATA  EQU   CVTVOLM2
CVTTSKS  EQU   CVTTATA
CVTVOLF2 EQU   CVTTSKS
CVTTAT   EQU   CVTTATA+1
CVTATER  EQU   CVTMAP+248
CVTEXT1  EQU   CVTMAP+252
CVTPURG  EQU   CVTMAP+260
CVTQMSG  EQU   CVTMAP+268
CVTDMSR  EQU   CVTMAP+272
CVTRSV37 EQU   CVTDMSR
CVTDMSRF EQU   CVTRSV37
CVTERPV  EQU   CVTMAP+316
CVTINTLA EQU   CVTMAP+320
CVTAPF   EQU   CVTMAP+324
CVTEXT2  EQU   CVTMAP+328
CVTHJES  EQU   CVTMAP+332
CVTPGSIA EQU   CVTMAP+348
CVTA1F1  EQU   CVTMAP+356
CVTSYSK  EQU   CVTMAP+357
CVTVOLM1 EQU   CVTMAP+380
CVTVOLF1 EQU   CVTVOLM1
CVTATMCT EQU   CVTMAP+388
CVTXTNT1 EQU   0
CVTXTNT2 EQU   0
CVTDSSV  EQU   CVTXTNT2
CVTFLGBT EQU   CVTXTNT2+5
CVTQID   EQU   CVTXTNT2+24
CVTRV400 EQU   CVTXTNT2+52
CVTRV409 EQU   CVTXTNT2+53
CVTATCVT EQU   CVTXTNT2+64
CVTRV429 EQU   CVTXTNT2+84
CVTRV438 EQU   CVTXTNT2+85
CVTRV457 EQU   CVTXTNT2+112
CVTRV466 EQU   CVTXTNT2+113
CVTFIX   EQU   0
CVTRELNO EQU   CVTFIX+252
EDTHDR   EQU   0
EDTLUVSP EQU   EDTHDR
EDTGENSP EQU   EDTHDR+4
EDTGRPSP EQU   EDTHDR+8
EDTUCBSP EQU   EDTHDR+12
EDTMSKTP EQU   EDTHDR+16
LUVSECT  EQU   0
LUVHDR   EQU   LUVSECT
LUVENTRY EQU   0
LUVGMTP  EQU   LUVENTRY+12
LUVFLAGS EQU   LUVENTRY+24
GENSECT  EQU   0
GENHDR   EQU   GENSECT
GENENTRY EQU   0
GRPTRTAB EQU   0
GRPSECT  EQU   0
GRPHDR   EQU   GRPSECT
GRPENTRY EQU   0
GRPUCBP  EQU   GRPENTRY+8
EUCBSECT EQU   0
EUCBHDR  EQU   EUCBSECT
EUCBENTY EQU   0
GRMSKTAB EQU   0
GMTHDR   EQU   GRMSKTAB
GMTENTLN EQU   GMTHDR+4
GMTENTRY EQU   0
AQMPARAM EQU   0
AQMECODE EQU   AQMPARAM
AQMQCODE EQU   AQMPARAM+2
AQMMASKP EQU   AQMPARAM+4
AQMASID  EQU   AQMPARAM+8
AQMLENGT EQU   AQMPARAM+12
AQMCANCP EQU   AQMPARAM+16
AQMNORMP EQU   AQMPARAM+20
ASWA     EQU   0
ASWAID   EQU   ASWA
ASWACSCT EQU   ASWA+4
ASWARTNP EQU   ASWA+12
ASWAPRMS EQU   ASWA+16
ASWASCBP EQU   ASWA+20
ASWAOLDP EQU   ASWA+24
ASWAFLGS EQU   ASWA+28
ASWADSWS EQU   ASWAFLGS
ASWAAUTO EQU   ASWA+32
ASWACHNP EQU   ASWA+36
AB4EDPMS EQU   0
IEZJSCB  EQU   0
JSCBSEC1 EQU   IEZJSCB+188
JSCHPCE  EQU   JSCBSEC1+4
JSCBDCB  EQU   JSCBSEC1+36
JSCBOPTS EQU   JSCBSEC1+48
JSCBSWT1 EQU   JSCBSEC1+55
JSCBWTP  EQU   JSCBSEC1+64
JSCBWTFG EQU   JSCBWTP
JSCBEND1 EQU   IEZJSCB+260
ASCB     EQU   0
ASCBASID EQU   ASCB+36
ASCBFW1  EQU   ASCB+100
ASCBRCTF EQU   ASCBFW1+2
ASCBFLG1 EQU   ASCBFW1+3
ASCBDSP1 EQU   ASCB+114
ASCBFLG2 EQU   ASCB+115
TCBFIX   EQU   0
TCBFRS   EQU   TCBFIX
TCB      EQU   0
TCBPIE   EQU   TCB+4
TCBPMASK EQU   TCBPIE
TCBCMP   EQU   TCB+16
TCBCMPF  EQU   TCBCMP
TCBCPP   EQU   TCBCMPF
TCBSTCC  EQU   TCBCMPF
TCBCDBL  EQU   TCBCMPF
TCBCWTO  EQU   TCBCMPF
TCBCIND  EQU   TCBCMPF
TCBCMSG  EQU   TCBCMPF
TCBTRN   EQU   TCB+20
TCBABF   EQU   TCBTRN
TCBMSS   EQU   TCB+24
TCBPKF   EQU   TCB+28
TCBFLGS  EQU   TCB+29
TCBFLGS1 EQU   TCBFLGS
TCBFLGS2 EQU   TCBFLGS+1
TCBFLGS3 EQU   TCBFLGS+2
TCBFLGS4 EQU   TCBFLGS+3
TCBFLGS5 EQU   TCBFLGS+4
TCBABWF  EQU   TCBFLGS5
TCBJPQ   EQU   TCB+44
TCBPURGE EQU   TCBJPQ
TCBGRS   EQU   TCB+48
TCBFSA   EQU   TCB+112
TCBTME   EQU   TCB+120
TCBJSTCB EQU   TCB+124
TCBTSFLG EQU   TCB+148
TCBTSTSK EQU   TCBTSFLG
TCBSTAB  EQU   TCB+160
TCBNSTAE EQU   TCBSTAB
TCBSTABB EQU   TCBSTAB+1
TCBTCT   EQU   TCB+164
TCBTCTGF EQU   TCBTCT
TCBSCNDY EQU   TCB+172
TCBNDSP  EQU   TCBSCNDY
TCBNDSP1 EQU   TCBNDSP+1
TCBNDSP2 EQU   TCBNDSP+2
TCBNDSP3 EQU   TCBNDSP+3
TCBJSCB  EQU   TCB+180
TCBRECDE EQU   TCBJSCB
TCBEXT1  EQU   TCB+196
TCBBITS  EQU   TCB+200
TCBNDSP4 EQU   TCBBITS
TCBNDSP5 EQU   TCBBITS+1
TCBFLGS6 EQU   TCBBITS+2
TCBFLGS7 EQU   TCBBITS+3
TCBDAR   EQU   TCB+204
TCBDARC  EQU   TCBDAR
TCBEXT2  EQU   TCB+208
TCBFOE   EQU   TCB+244
TCBESTAE EQU   TCB+264
TCBESTRM EQU   TCBESTAE+1
TCBFBYT1 EQU   TCB+276
TCBFBYT2 EQU   TCB+277
TCBRV124 EQU   TCB+278
TCBRV133 EQU   TCB+279
TCBXTNT2 EQU   0
TCBGTF   EQU   TCBXTNT2
TCBTFLG  EQU   TCBGTF
TCBRV146 EQU   TCBXTNT2+28
TCBRV155 EQU   TCBXTNT2+29
TCBRV164 EQU   TCBXTNT2+30
TCBRV173 EQU   TCBXTNT2+31
TABLCORE EQU   0
ESTAPRMS EQU   TABLCORE+540
QMGRPRMS EQU   TABLCORE+745
WORKTABL EQU   TABLCORE+773
GRPTABL  EQU   TABLCORE+782
FUNCMAP  EQU   0
LOCKGRP  EQU   FUNCMAP
UNLKGRP  EQU   FUNCMAP
DDRTPUR  EQU   FUNCMAP
DDRDA    EQU   FUNCMAP
LISTPTR  EQU   0
GMASKPTR EQU   0
JSCBPTR  EQU   0
ASWAPTR  EQU   0
GMASKMAP EQU   GROUPMSK
CVTS01   EQU   CVTPGSIA
CVTLPDIA EQU   CVTS01+12
CVTDIRST EQU   CVTLPDIA
CVTSLIDA EQU   CVTS01+24
CVTCTLFG EQU   CVTS01+50
CVTRV210 EQU   CVTS01+424
CVTRV219 EQU   CVTS01+425
CVTRV228 EQU   CVTS01+426
CVTRV237 EQU   CVTS01+427
CVTMFRTR EQU   CVTS01+452
CVTRV262 EQU   CVTS01+468
CVTRV271 EQU   CVTS01+469
CVTRV280 EQU   CVTS01+470
CVTRV289 EQU   CVTS01+471
CVTGSDA  EQU   CVTS01+600
JSCBSEC2 EQU   JSCBEND1
JSCBSEC3 EQU   JSCBEND1
JSCBJCT  EQU   JSCBSEC3
JSCBJCTA EQU   JSCBJCT+1
JSCBASID EQU   JSCBSEC3+8
JSCBFBYT EQU   JSCBSEC3+10
JSCBJNL  EQU   JSCBSEC3+28
JSCBJJSB EQU   JSCBJNL
JSCBSUB  EQU   JSCBSEC3+40
JSCSCT   EQU   JSCBSEC3+68
JSCBASWA EQU   JSCBSEC3+96
JSCRSV45 EQU   JSCBSEC3+112
JSCRSV46 EQU   JSCRSV45
JSCRSV47 EQU   JSCRSV45+2
PSARSVTE EQU   PSARSVT
FLC      EQU   PSA
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS
PSARSAV  EQU   PSARSVTE+60
PSARSTK  EQU   PSARSVTE+56
PSAESAV3 EQU   PSARSVTE+52
PSAESTK3 EQU   PSARSVTE+48
PSAESAV2 EQU   PSARSVTE+44
PSAESTK2 EQU   PSARSVTE+40
PSAESAV1 EQU   PSARSVTE+36
PSAESTK1 EQU   PSARSVTE+32
PSAPSAV  EQU   PSARSVTE+28
PSAPSTK  EQU   PSARSVTE+24
PSAMSAV  EQU   PSARSVTE+20
PSAMSTK  EQU   PSARSVTE+16
PSASSAV  EQU   PSARSVTE+12
PSASSTK  EQU   PSARSVTE+8
PSANSTK  EQU   PSARSVTE+4
PSACSTK  EQU   PSARSVTE
JSCBEND3 EQU   JSCBSEC3+120
JSCRSV52 EQU   JSCBSEC3+116
JSCRSV51 EQU   JSCRSV47+1
JSCRSV50 EQU   JSCRSV47
JSCRSV49 EQU   JSCRSV46+1
JSCRSV48 EQU   JSCRSV46
JSCRSV44 EQU   JSCBSEC3+108
JSCRSV43 EQU   JSCBSEC3+104
JSCRSV42 EQU   JSCBSEC3+100
JSCBUFPT EQU   JSCBSEC3+92
JSCBACT  EQU   JSCBSEC3+88
JSCBSWSP EQU   JSCBSEC3+87
JSCRSV33 EQU   JSCBSEC3+86
JSCDDNUM EQU   JSCBSEC3+84
JSCRSV53 EQU   JSCBSEC3+82
JSCDDNNO EQU   JSCBSEC3+80
JSCBVATA EQU   JSCBSEC3+76
JSCTMCOR EQU   JSCBSEC3+72
JSCSCTP  EQU   JSCSCT+1
JSCRSV55 EQU   JSCSCT
JSCRSV54 EQU   JSCBSEC3+64
JSCDSABQ EQU   JSCBSEC3+60
JSCBSSIB EQU   JSCBSEC3+56
JSCBFRBA EQU   JSCBSEC3+48
JSCRSV28 EQU   JSCBSEC3+46
JSCBSONO EQU   JSCBSEC3+44
JSCBSUBA EQU   JSCBSUB+1
JSCRSV31 EQU   JSCBSUB
JSCBSMLR EQU   JSCBSEC3+36
JSCBJNLR EQU   JSCBSEC3+32
JSCBJNLA EQU   JSCBJNL+1
JSCBJSBT EQU   JSCBJJSB
JSCBJSBX EQU   JSCBJJSB
JSCBJSBA EQU   JSCBJJSB
JSCBJSBI EQU   JSCBJJSB
@NM00014 EQU   JSCBJJSB
JSCBJNLE EQU   JSCBJJSB
JSCBJNLF EQU   JSCBJJSB
JSCBJNLN EQU   JSCBJJSB
@NM00013 EQU   JSCBSEC3+24
JSCBJRBA EQU   JSCBSEC3+16
JSCBIECB EQU   JSCBSEC3+12
JSCBRV08 EQU   JSCBSEC3+11
JSCBRV07 EQU   JSCBFBYT
JSCBRV06 EQU   JSCBFBYT
JSCBRV05 EQU   JSCBFBYT
JSCBRV04 EQU   JSCBFBYT
JSCBRV03 EQU   JSCBFBYT
JSCBRV02 EQU   JSCBFBYT
JSCBADSP EQU   JSCBFBYT
JSCBRV01 EQU   JSCBFBYT
JSCBTJID EQU   JSCBASID
JSCBPSCB EQU   JSCBSEC3+4
JSCJCTP  EQU   JSCBJCTA
JSCRSV24 EQU   JSCBJCT
JSCBEND2 EQU   JSCBSEC2
CVTRV628 EQU   CVTS01+728
CVTRV627 EQU   CVTS01+724
CVTRV626 EQU   CVTS01+720
CVTRV625 EQU   CVTS01+716
CVTRV624 EQU   CVTS01+712
CVTRV623 EQU   CVTS01+708
CVTRV622 EQU   CVTS01+704
CVTRV621 EQU   CVTS01+700
CVTIHASU EQU   CVTS01+696
CVTRV619 EQU   CVTS01+692
CVTRV618 EQU   CVTS01+688
CVTRV617 EQU   CVTS01+684
CVTRV616 EQU   CVTS01+680
CVTRV615 EQU   CVTS01+676
CVTRV614 EQU   CVTS01+672
CVTRV613 EQU   CVTS01+668
CVTTCASP EQU   CVTS01+664
CVT0PT03 EQU   CVTS01+660
CVT0PT0E EQU   CVTS01+656
CVTRV609 EQU   CVTS01+652
CVTCGK   EQU   CVTS01+648
CVTRAC   EQU   CVTS01+644
CVTHSM   EQU   CVTS01+640
CVTRV605 EQU   CVTS01+636
CVTRV604 EQU   CVTS01+632
CVTEFF02 EQU   CVTS01+628
CVTCBBR  EQU   CVTS01+624
CVTSSCR  EQU   CVTS01+620
CVTEVENT EQU   CVTS01+616
CVTCRCA  EQU   CVTS01+612
CVTTPIO  EQU   CVTS01+608
CVTADV   EQU   CVTS01+604
CVTGSDAB EQU   CVTGSDA
CVTQV3   EQU   CVTS01+596
CVTQV2   EQU   CVTS01+592
CVTQV1   EQU   CVTS01+588
CVTRPT   EQU   CVTS01+584
CVTSSRB  EQU   CVTS01+580
CVTCSDRL EQU   CVTS01+576
CVTEXP1  EQU   CVTS01+572
CVTRMPMT EQU   CVTS01+568
CVTRMPTT EQU   CVTS01+564
CVTVPSA  EQU   CVTS01+560
CVTVSTOP EQU   CVTS01+556
CVTGTFR8 EQU   CVTS01+552
CVTQUIT  EQU   CVTS01+548
CVTVACR  EQU   CVTS01+544
CVTWTCB  EQU   CVTS01+540
CVTSTPRS EQU   CVTS01+536
CVT0PT02 EQU   CVTS01+532
CVTDARCM EQU   CVTS01+528
CVTIRECM EQU   CVTS01+524
CVTJRECM EQU   CVTS01+520
CVTVEMS0 EQU   CVTS01+516
CVTSPFRR EQU   CVTS01+512
CVTRLSTG EQU   CVTS01+508
CVT0TC0A EQU   CVTS01+504
CVTGMBR  EQU   CVTS01+500
CVTLFRM  EQU   CVTS01+496
CVTRMBR  EQU   CVTS01+492
CVTVIOP  EQU   CVTS01+488
CVTRV307 EQU   CVTS01+486
CVTRV306 EQU   CVTS01+484
CVTRV305 EQU   CVTS01+482
CVTRV304 EQU   CVTS01+480
CVTRV303 EQU   CVTS01+478
CVTRV302 EQU   CVTS01+476
CVTTRCA  EQU   CVTS01+472
CVTRV297 EQU   CVTRV289
CVTRV296 EQU   CVTRV289
CVTRV295 EQU   CVTRV289
CVTRV294 EQU   CVTRV289
CVTRV293 EQU   CVTRV289
CVTRV292 EQU   CVTRV289
CVTRV291 EQU   CVTRV289
CVTRV290 EQU   CVTRV289
CVTRV288 EQU   CVTRV280
CVTRV287 EQU   CVTRV280
CVTRV286 EQU   CVTRV280
CVTRV285 EQU   CVTRV280
CVTRV284 EQU   CVTRV280
CVTRV283 EQU   CVTRV280
CVTRV282 EQU   CVTRV280
CVTRV281 EQU   CVTRV280
CVTRV279 EQU   CVTRV271
CVTRV278 EQU   CVTRV271
CVTRV277 EQU   CVTRV271
CVTRV276 EQU   CVTRV271
CVTRV275 EQU   CVTRV271
CVTRV274 EQU   CVTRV271
CVTRV273 EQU   CVTRV271
CVTRV272 EQU   CVTRV271
CVTRV270 EQU   CVTRV262
CVTRV269 EQU   CVTRV262
CVTRV268 EQU   CVTRV262
CVTRV267 EQU   CVTRV262
CVTRV266 EQU   CVTRV262
CVTRV265 EQU   CVTRV262
CVTRV264 EQU   CVTRV262
CVTRV263 EQU   CVTRV262
CVTVFP   EQU   CVTS01+464
CVTVSI   EQU   CVTS01+460
CVTVPSIB EQU   CVTS01+456
CVTMFACT EQU   CVTMFRTR
CVTMFCTL EQU   CVTS01+448
CVTPVBP  EQU   CVTS01+444
CVTPWI   EQU   CVTS01+440
CVTRV254 EQU   CVTS01+438
CVTRV253 EQU   CVTS01+436
CVTRV252 EQU   CVTS01+434
CVTRV251 EQU   CVTS01+433
CVTRV250 EQU   CVTS01+432
CVTRV249 EQU   CVTS01+431
CVTRV248 EQU   CVTS01+430
CVTRV247 EQU   CVTS01+429
CVTRV246 EQU   CVTS01+428
CVTRV245 EQU   CVTRV237
CVTRV244 EQU   CVTRV237
CVTRV243 EQU   CVTRV237
CVTRV242 EQU   CVTRV237
CVTRV241 EQU   CVTRV237
CVTRV240 EQU   CVTRV237
CVTRV239 EQU   CVTRV237
CVTRV238 EQU   CVTRV237
CVTRV236 EQU   CVTRV228
CVTRV235 EQU   CVTRV228
CVTRV234 EQU   CVTRV228
CVTRV233 EQU   CVTRV228
CVTRV232 EQU   CVTRV228
CVTRV231 EQU   CVTRV228
CVTRV230 EQU   CVTRV228
CVTRV229 EQU   CVTRV228
CVTRV227 EQU   CVTRV219
CVTRV226 EQU   CVTRV219
CVTRV225 EQU   CVTRV219
CVTRV224 EQU   CVTRV219
CVTRV223 EQU   CVTRV219
CVTRV222 EQU   CVTRV219
CVTRV221 EQU   CVTRV219
CVTRV220 EQU   CVTRV219
CVTRV218 EQU   CVTRV210
CVTRV217 EQU   CVTRV210
CVTRV216 EQU   CVTRV210
CVTRV215 EQU   CVTRV210
CVTRV214 EQU   CVTRV210
CVTRV213 EQU   CVTRV210
CVTRV212 EQU   CVTRV210
CVTRV211 EQU   CVTRV210
CVTLCCAT EQU   CVTS01+420
CVTPCCAT EQU   CVTS01+416
CVTIPCRP EQU   CVTS01+412
CVTIPCRI EQU   CVTS01+408
CVTIPCDS EQU   CVTS01+404
CVTAIDVT EQU   CVTS01+400
CVTSSAP  EQU   CVTS01+396
CVTEHCIR EQU   CVTS01+392
CVTEHDEF EQU   CVTS01+388
CVTDAIR  EQU   CVTS01+384
CVTPERFM EQU   CVTS01+380
CVT044R2 EQU   CVTS01+376
CVTFETCH EQU   CVTS01+372
CVTRSTWD EQU   CVTS01+368
CVTSPOST EQU   CVTS01+364
CVTIOBP  EQU   CVTS01+360
CVTASMVT EQU   CVTS01+356
CVTRECRQ EQU   CVTS01+352
CVTWSAC  EQU   CVTS01+348
CVTRV149 EQU   CVTS01+344
CVTWSAL  EQU   CVTS01+340
CVTSPSA  EQU   CVTS01+336
CVTGLMN  EQU   CVTS01+332
CVTVEAC0 EQU   CVTS01+328
CVT062R1 EQU   CVTS01+324
CVTRPOST EQU   CVTS01+320
CVTDQIQE EQU   CVTS01+316
CVTCSD   EQU   CVTS01+312
CVTLKRMA EQU   CVTS01+308
CVTRSPIE EQU   CVTS01+304
CVTRENQ  EQU   CVTS01+300
CVTLQCB  EQU   CVTS01+296
CVTFQCB  EQU   CVTS01+292
CVTQCS01 EQU   CVTS01+288
CVTAPFT  EQU   CVTS01+284
CVTPARRL EQU   CVTS01+280
CVTVWAIT EQU   CVTS01+276
CVTGSPL  EQU   CVTS01+272
CVTLSMQ  EQU   CVTS01+268
CVTGSMQ  EQU   CVTS01+264
CVTEXPRO EQU   CVTS01+260
CVTOPCTP EQU   CVTS01+256
CVTSIC   EQU   CVTS01+252
CVTTPIOS EQU   CVTS01+248
CVTRTMS  EQU   CVTS01+244
CVTSDBF  EQU   CVTS01+240
CVTSCBP  EQU   CVTS01+236
CVTSDMP  EQU   CVTS01+232
CVTSV60  EQU   CVTS01+228
CVTRTMCT EQU   CVTS01+224
CVTASCBL EQU   CVTS01+220
CVTASCBH EQU   CVTS01+216
CVTGDA   EQU   CVTS01+212
CVTASVT  EQU   CVTS01+208
CVTVVMDI EQU   CVTS01+204
CVTAQTOP EQU   CVTS01+200
CVTIOSCS EQU   CVTS01+196
CVTSDRM  EQU   CVTS01+192
CVTOPTE  EQU   CVTS01+188
CVTSTXU  EQU   CVTS01+184
CVTQUIS  EQU   CVTS01+180
CVTPARS  EQU   CVTS01+176
CVTS1EE  EQU   CVTS01+172
CVTFRAS  EQU   CVTS01+168
CVTQSAS  EQU   CVTS01+164
CVTCRAS  EQU   CVTS01+160
CVTCRMN  EQU   CVTS01+156
CVTDELCP EQU   CVTS01+152
CVTFRECL EQU   CVTS01+148
CVTGETCL EQU   CVTS01+144
CVTBLDCP EQU   CVTS01+140
CVTAUTHL EQU   CVTS01+136
CVTSCAN  EQU   CVTS01+132
CVTRV144 EQU   CVTS01+130
CVTMAXMP EQU   CVTS01+128
CVTSTCK  EQU   CVTS01+124
CVTRV139 EQU   CVTS01+123
CVTDSSAC EQU   CVTS01+122
CVTRV513 EQU   CVTS01+121
CVTIOSPL EQU   CVTS01+120
CVTPTGT  EQU   CVTS01+116
CVTCSPIE EQU   CVTS01+112
CVTSMFEX EQU   CVTS01+108
CVTOLT0A EQU   CVTS01+104
CVTSRBRT EQU   CVTS01+100
CVTPUTL  EQU   CVTS01+96
CVTASCRL EQU   CVTS01+92
CVTASCRF EQU   CVTS01+88
CVTRV326 EQU   CVTS01+84
CVTRV325 EQU   CVTS01+80
CVTRV324 EQU   CVTS01+76
CVT0VL01 EQU   CVTS01+72
CVTSHRVM EQU   CVTS01+68
CVTRV332 EQU   CVTS01+64
CVTTAS   EQU   CVTS01+60
CVTRSCN  EQU   CVTS01+56
CVTTRAC2 EQU   CVTS01+54
CVTTRACE EQU   CVTS01+52
CVTAPG   EQU   CVTS01+51
CVTSDTRC EQU   CVTCTLFG
CVTGTRCE EQU   CVTCTLFG
CVTNOMP  EQU   CVTCTLFG
CVTRSV79 EQU   CVTCTLFG
CVTDSTAT EQU   CVTCTLFG
CVTRSV78 EQU   CVTCTLFG
CVTRV333 EQU   CVTCTLFG
CVTRV323 EQU   CVTCTLFG
CVTSPVLK EQU   CVTS01+49
CVTRSV77 EQU   CVTS01+48
CVTRV331 EQU   CVTS01+44
CVTRV330 EQU   CVTS01+40
CVTRV329 EQU   CVTS01+36
CVTRV328 EQU   CVTS01+32
CVTRV322 EQU   CVTS01+28
CVTSLID  EQU   CVTSLIDA+1
CVTSYLK  EQU   CVTSLIDA
CVTRV321 EQU   CVTS01+20
CVTRV320 EQU   CVTS01+16
CVTLPDIR EQU   CVTLPDIA+1
CVTRSV69 EQU   CVTDIRST
CVTRSV68 EQU   CVTDIRST
CVTRSV67 EQU   CVTDIRST
CVTRSV66 EQU   CVTDIRST
CVTRSV65 EQU   CVTDIRST
CVTRSV64 EQU   CVTDIRST
CVTRSV63 EQU   CVTDIRST
CVTDICOM EQU   CVTDIRST
CVTPVTP  EQU   CVTS01+8
CVTLPDSR EQU   CVTS01+4
CVTGETL  EQU   CVTS01
@NM00001 EQU   FUNCMAP
PARM4ED  EQU   TABLCORE+40
ASWACORE EQU   TABLCORE
@NM00042 EQU   TCBXTNT2+32
TCBRV181 EQU   TCBRV173
TCBRV180 EQU   TCBRV173
TCBRV179 EQU   TCBRV173
TCBRV178 EQU   TCBRV173
TCBRV177 EQU   TCBRV173
TCBRV176 EQU   TCBRV173
TCBRV175 EQU   TCBRV173
TCBRV174 EQU   TCBRV173
TCBRV172 EQU   TCBRV164
TCBRV171 EQU   TCBRV164
TCBRV170 EQU   TCBRV164
TCBRV169 EQU   TCBRV164
TCBRV168 EQU   TCBRV164
TCBRV167 EQU   TCBRV164
TCBRV166 EQU   TCBRV164
TCBRV165 EQU   TCBRV164
TCBRV163 EQU   TCBRV155
TCBRV162 EQU   TCBRV155
TCBRV161 EQU   TCBRV155
TCBRV160 EQU   TCBRV155
TCBRV159 EQU   TCBRV155
TCBRV158 EQU   TCBRV155
TCBRV157 EQU   TCBRV155
TCBRV156 EQU   TCBRV155
TCBRV154 EQU   TCBRV146
TCBRV153 EQU   TCBRV146
TCBRV152 EQU   TCBRV146
TCBRV151 EQU   TCBRV146
TCBRV150 EQU   TCBRV146
TCBRV149 EQU   TCBRV146
TCBRV148 EQU   TCBRV146
TCBRV147 EQU   TCBRV146
TCBRV145 EQU   TCBXTNT2+26
TCBRV144 EQU   TCBXTNT2+24
TCBCAUF  EQU   TCBXTNT2+20
TCBRV142 EQU   TCBXTNT2+16
TCBRSV49 EQU   TCBXTNT2+12
TCBEVENT EQU   TCBXTNT2+8
TCBRCMP  EQU   TCBXTNT2+5
TCBRSVAB EQU   TCBXTNT2+4
TCBGTFA  EQU   TCBGTF+1
TCBRSV47 EQU   TCBTFLG
TCBRSV46 EQU   TCBTFLG
TCBRSV45 EQU   TCBTFLG
TCBRSV44 EQU   TCBTFLG
TCBRSV43 EQU   TCBTFLG
TCBDSPIT EQU   TCBTFLG
TCBERRTN EQU   TCBTFLG
TCBASYNC EQU   TCBTFLG
@NM00041 EQU   TCB+296
TCBSVCA2 EQU   TCB+292
TCBSWASA EQU   TCB+288
TCBDBTB  EQU   TCB+284
TCBRPT   EQU   TCB+280
TCBRV141 EQU   TCBRV133
TCBRV140 EQU   TCBRV133
TCBRV139 EQU   TCBRV133
TCBRV138 EQU   TCBRV133
TCBRV137 EQU   TCBRV133
TCBRV136 EQU   TCBRV133
TCBRV135 EQU   TCBRV133
TCBRV134 EQU   TCBRV133
TCBRV132 EQU   TCBRV124
TCBRV131 EQU   TCBRV124
TCBRV130 EQU   TCBRV124
TCBRV129 EQU   TCBRV124
TCBRV128 EQU   TCBRV124
TCBRV127 EQU   TCBRV124
TCBRV126 EQU   TCBRV124
TCBRV125 EQU   TCBRV124
TCBRV123 EQU   TCBFBYT2
TCBRV122 EQU   TCBFBYT2
TCBECBNV EQU   TCBFBYT2
TCBSSSYN EQU   TCBFBYT2
TCBFPRAP EQU   TCBFBYT2
TCBFDW   EQU   TCBFBYT2
TCBFMW   EQU   TCBFBYT2
TCBCNCB  EQU   TCBFBYT2
TCBLLH   EQU   TCBFBYT1
TCBRV113 EQU   TCBFBYT1
TCBEOT   EQU   TCBFBYT1
TCBRTM2  EQU   TCBFBYT1
TCBPGNLY EQU   TCBFBYT1
TCBNDIOS EQU   TCBFBYT1
TCBACTIV EQU   TCBFBYT1
TCBEOTFM EQU   TCBFBYT1
TCBAFFN  EQU   TCB+274
TCBCCPVI EQU   TCB+272
TCBUKYSP EQU   TCB+268
TCBMODE  EQU   TCBESTAE+3
TCBERTYP EQU   TCBESTAE+2
TCBRV314 EQU   TCBESTRM
TCBRV313 EQU   TCBESTRM
TCBRV312 EQU   TCBESTRM
TCBRV311 EQU   TCBESTRM
TCBRV310 EQU   TCBESTRM
TCBRV309 EQU   TCBESTRM
TCBRV308 EQU   TCBESTRM
TCBETERM EQU   TCBESTRM
TCBSCBKY EQU   TCBESTAE
TCBRTM12 EQU   TCB+260
TCBTCBID EQU   TCB+256
TCBRSV96 EQU   TCB+252
TCBSWA   EQU   TCB+248
TCBFOEA  EQU   TCBFOE+1
TCBRSV42 EQU   TCBFOE
TCBRV306 EQU   TCB+240
TCBRSV41 EQU   TCB+239
TCBTID   EQU   TCB+238
TCBRSVAA EQU   TCB+237
TCBABCUR EQU   TCB+236
TCBTMSAV EQU   TCB+232
TCBIOTIM EQU   TCB+228
TCBRTWA  EQU   TCB+224
TCBBACK  EQU   TCB+220
TCBTIRB  EQU   TCB+216
TCBAECB  EQU   TCB+212
TCBEXT2A EQU   TCBEXT2+1
TCBRSV39 EQU   TCBEXT2
TCBSTMCT EQU   TCB+207
TCBSYSCT EQU   TCB+206
TCBRSV37 EQU   TCB+205
TCBEXSVC EQU   TCBDAR
TCBDARMS EQU   TCBDAR
TCBDARWT EQU   TCBDAR
TCBDARO  EQU   TCBDAR
TCBDARMC EQU   TCBDARC
TCBDARD  EQU   TCBDAR
TCBDARS  EQU   TCBDAR
TCBDARP  EQU   TCBDAR
TCBGTOFM EQU   TCBFLGS7
TCBADMP  EQU   TCBFLGS7
TCBRSTSK EQU   TCBFLGS7
TCBSVCS  EQU   TCBFLGS7
TCBSTACK EQU   TCBFLGS7
TCBRSV34 EQU   TCBFLGS7
TCBRSV33 EQU   TCBFLGS7
TCBGPECB EQU   TCBFLGS7
TCBNTJS  EQU   TCBFLGS6
TCBAPG   EQU   TCBFLGS6
TCBMIGR  EQU   TCBFLGS6
TCBRV303 EQU   TCBFLGS6
TCBSPVLK EQU   TCBFLGS6
TCBCPU   EQU   TCBFLGS6
TCBPIE17 EQU   TCBFLGS6
TCBRV    EQU   TCBFLGS6
TCBRSV79 EQU   TCBNDSP5
TCBRSV78 EQU   TCBNDSP5
TCBRSV77 EQU   TCBNDSP5
TCBRSV76 EQU   TCBNDSP5
TCBRSV75 EQU   TCBNDSP5
TCBRSV74 EQU   TCBNDSP5
TCBRSV95 EQU   TCBNDSP5
TCBRSV94 EQU   TCBNDSP5
TCBRSV93 EQU   TCBNDSP4
TCBRSV92 EQU   TCBNDSP4
TCBRSV91 EQU   TCBNDSP4
TCBRSV90 EQU   TCBNDSP4
TCBRSV89 EQU   TCBNDSP4
TCBRSV88 EQU   TCBNDSP4
TCBRSV87 EQU   TCBNDSP4
TCBRSV86 EQU   TCBNDSP4
TCBEXT1A EQU   TCBEXT1+1
TCBRSV32 EQU   TCBEXT1
TCBEXCPD EQU   TCB+192
TCBIOBRC EQU   TCB+188
TCBDDWTC EQU   TCB+186
TCBDDEXC EQU   TCB+184
TCBJSCBB EQU   TCBJSCB+1
@NM00040 EQU   TCBRECDE
TCBREC   EQU   TCBRECDE
TCBMDIDS EQU   TCB+176
TCBNDINT EQU   TCBNDSP3
TCBRSV27 EQU   TCBNDSP3
TCBRSV26 EQU   TCBNDSP3
TCBRSV25 EQU   TCBNDSP3
TCBRSV24 EQU   TCBNDSP3
TCBSRBND EQU   TCBNDSP3
TCBRV302 EQU   TCBNDSP3
TCBLJSND EQU   TCBNDSP3
TCBABE   EQU   TCBNDSP2
TCBDSS   EQU   TCBNDSP2
TCBOWAIT EQU   TCBNDSP2
TCBIWAIT EQU   TCBNDSP2
TCBNDTS  EQU   TCBNDSP2
TCBNDSVC EQU   TCBNDSP2
TCBSTPP  EQU   TCBNDSP2
TCBABD   EQU   TCBNDSP2
TCBRSV22 EQU   TCBNDSP1
TCBPIEND EQU   TCBNDSP1
TCBTPSP  EQU   TCBNDSP1
TCBDDRND EQU   TCBNDSP1
TCBRSPND EQU   TCBNDSP1
TCBRSTND EQU   TCBNDSP1
TCBDARPN EQU   TCBNDSP1
TCBDARTN EQU   TCBNDSP1
TCBNDSP0 EQU   TCBNDSP
TCBUSER  EQU   TCB+168
TCBTCTB  EQU   TCBTCT+1
TCBRSV9C EQU   TCBTCTGF
TCBRSV9B EQU   TCBTCTGF
TCBRSV9A EQU   TCBTCTGF
TCBRSV99 EQU   TCBTCTGF
TCBRSV98 EQU   TCBTCTGF
TCBRSV97 EQU   TCBTCTGF
TCBRSV20 EQU   TCBTCTGF
TCBSMFGF EQU   TCBTCTGF
TCBSTCUR EQU   TCBNSTAE
TCBRV301 EQU   TCBNSTAE
TCBSYNCH EQU   TCBNSTAE
TCBHALT  EQU   TCBNSTAE
TCBPPSUP EQU   TCBNSTAE
TCB33E   EQU   TCBNSTAE
TCBQUIES EQU   TCBNSTAE
TCBSTABE EQU   TCBNSTAE
TCBAQE   EQU   TCB+156
TCBPQE   EQU   TCB+152
TCBTSDP  EQU   TCB+151
TCBTSLP  EQU   TCB+150
TCBSTPCT EQU   TCB+149
TCBCPUBN EQU   TCBTSFLG
TCBDYDSP EQU   TCBTSFLG
TCBRSV18 EQU   TCBTSFLG
TCBRSV17 EQU   TCBTSFLG
TCBTIOTG EQU   TCBTSFLG
TCBATT   EQU   TCBTSFLG
TCBSTPPR EQU   TCBTSFLG
TCBRV300 EQU   TCBTSTSK
TCBECB   EQU   TCB+144
TCBIQE   EQU   TCB+140
TCBLTC   EQU   TCB+136
TCBOTC   EQU   TCB+132
TCBNTC   EQU   TCB+128
TCBJSTCA EQU   TCBJSTCB+1
TCBRSV16 EQU   TCBJSTCB
TCBTQET  EQU   TCBTME
TCBTCB   EQU   TCB+116
TCBFSAB  EQU   TCBFSA+1
TCBQEL   EQU   TCBFSA
TCBGRS15 EQU   TCBGRS+60
TCBGRS14 EQU   TCBGRS+56
TCBGRS13 EQU   TCBGRS+52
TCBGRS12 EQU   TCBGRS+48
TCBGRS11 EQU   TCBGRS+44
TCBGRS10 EQU   TCBGRS+40
TCBGRS9  EQU   TCBGRS+36
TCBGRS8  EQU   TCBGRS+32
TCBGRS7  EQU   TCBGRS+28
TCBGRS6  EQU   TCBGRS+24
TCBGRS5  EQU   TCBGRS+20
TCBGRS4  EQU   TCBGRS+16
TCBGRS3  EQU   TCBGRS+12
TCBGRS2  EQU   TCBGRS+8
TCBGRS1  EQU   TCBGRS+4
TCBGRS0  EQU   TCBGRS
TCBJPQB  EQU   TCBJPQ+1
TCBRSV15 EQU   TCBPURGE
TCBRSV14 EQU   TCBPURGE
TCBRSV13 EQU   TCBPURGE
TCBRSV12 EQU   TCBPURGE
TCBRSV11 EQU   TCBPURGE
TCBRSV10 EQU   TCBPURGE
TCBRSV09 EQU   TCBPURGE
TCBJPQF  EQU   TCBPURGE
TCBJLB   EQU   TCB+40
TCBLLS   EQU   TCB+36
TCBDSP   EQU   TCB+35
TCBLMP   EQU   TCB+34
TCBPNDSP EQU   TCBFLGS5
TCBFCD1  EQU   TCBFLGS5
TCBSTP   EQU   TCBFLGS5
TCBSYS   EQU   TCBFLGS5
TCBANDSP EQU   TCBFLGS5
TCBPAGE  EQU   TCBFLGS5
TCBUXNDF EQU   TCBABWF
TCBFC    EQU   TCBFLGS5
TCBONDSP EQU   TCBFLGS4
TCBMPCND EQU   TCBFLGS4
TCBMPCVQ EQU   TCBFLGS4
TCBUXNDV EQU   TCBFLGS4
TCBHNDSP EQU   TCBFLGS4
TCBRQENA EQU   TCBFLGS4
TCBSER   EQU   TCBFLGS4
TCBNDUMP EQU   TCBFLGS4
TCBDWSTA EQU   TCBFLGS3
TCBRSV08 EQU   TCBFLGS3
TCBRSV07 EQU   TCBFLGS3
TCBRSV06 EQU   TCBFLGS3
TCBABGM  EQU   TCBFLGS3
TCBABTRM EQU   TCBFLGS3
TCBADINP EQU   TCBFLGS3
TCBFSM   EQU   TCBFLGS3
TCBFTS   EQU   TCBFLGS2
TCBFETXR EQU   TCBFLGS2
TCBFDSOP EQU   TCBFLGS2
TCBFJMC  EQU   TCBFLGS2
TCBFSMC  EQU   TCBFLGS2
TCBFABOP EQU   TCBFLGS2
TCBFSTI  EQU   TCBFLGS2
TCBFOINP EQU   TCBFLGS2
TCBFX    EQU   TCBFLGS1
TCBFS    EQU   TCBFLGS1
TCBFT    EQU   TCBFLGS1
TCBPDUMP EQU   TCBFLGS1
TCBNONPR EQU   TCBFLGS1
TCBFERA  EQU   TCBFLGS1
TCBFE    EQU   TCBFLGS1
TCBFA    EQU   TCBFLGS1
TCBZERO  EQU   TCBPKF
TCBFLAG  EQU   TCBPKF
TCBMSSB  EQU   TCBMSS+1
TCBRSV03 EQU   TCBMSS
TCBTRNB  EQU   TCBTRN+1
TCBRSV02 EQU   TCBABF
TCBOLTEP EQU   TCBABF
TCBTCP   EQU   TCBABF
TCBTCPP  EQU   TCBABF
TCBRSV01 EQU   TCBABF
TCBGRPH  EQU   TCBABF
TCBNOCHK EQU   TCBABF
TCBMOD91 EQU   TCBABF
TCBCMPC  EQU   TCBCMP+1
TCBRV318 EQU   TCBCMSG
TCBRV317 EQU   TCBCIND
TCBRV316 EQU   TCBCWTO
TCBCASID EQU   TCBCDBL
TCBNOCC  EQU   TCBSTCC
TCBDMPO  EQU   TCBCPP
TCBCSTEP EQU   TCBCMPF
TCBCREQ  EQU   TCBCMPF
TCBTIO   EQU   TCB+12
TCBDEB   EQU   TCB+8
TCBPIEA  EQU   TCBPIE+1
TCBPM    EQU   TCBPMASK
@NM00039 EQU   TCBPMASK
TCBRBP   EQU   TCB
TCBFRS6  EQU   TCBFRS+24
TCBFRS4  EQU   TCBFRS+16
TCBFRS2  EQU   TCBFRS+8
TCBFRS0  EQU   TCBFRS
ASCBEND  EQU   ASCB+208
ASCBSRBT EQU   ASCB+200
ASCBSWTL EQU   ASCB+196
ASCBRS14 EQU   ASCB+195
ASCBSMCT EQU   ASCB+194
ASCBRS12 EQU   ASCB+192
ASCBPCTT EQU   ASCB+188
ASCBVGTT EQU   ASCB+184
ASCBLGCB EQU   ASCB+180
ASCBJBNS EQU   ASCB+176
ASCBJBNI EQU   ASCB+172
ASCBMCC  EQU   ASCB+168
ASCBRTWA EQU   ASCB+164
ASCBIQEA EQU   ASCB+160
ASCBXMPQ EQU   ASCB+156
ASCBRS01 EQU   ASCB+154
ASCBFMCT EQU   ASCB+152
ASCBOUXB EQU   ASCB+148
ASCBOUCB EQU   ASCB+144
ASCBMECB EQU   ASCB+140
ASCBQECB EQU   ASCB+136
ASCBCMSB EQU   ASCB+132
ASCBCMSF EQU   ASCB+128
ASCBTCBS EQU   ASCB+124
ASCBNVSC EQU   ASCB+122
ASCBVSC  EQU   ASCB+120
ASCBSRBS EQU   ASCB+118
ASCBSSRB EQU   ASCB+116
ASCBRV06 EQU   ASCBFLG2
ASCBRV05 EQU   ASCBFLG2
ASCBRV04 EQU   ASCBFLG2
ASCBSNQS EQU   ASCBFLG2
ASCBS2S  EQU   ASCBFLG2
ASCBCEXT EQU   ASCBFLG2
ASCBPXMT EQU   ASCBFLG2
ASCBXMPT EQU   ASCBFLG2
ASCBRF07 EQU   ASCBDSP1
ASCBRF06 EQU   ASCBDSP1
ASCBRF05 EQU   ASCBDSP1
ASCBRF04 EQU   ASCBDSP1
ASCBRF03 EQU   ASCBDSP1
ASCBRF02 EQU   ASCBDSP1
ASCBFAIL EQU   ASCBDSP1
ASCBNOQ  EQU   ASCBDSP1
ASCBSWCT EQU   ASCB+112
ASCBASXB EQU   ASCB+108
ASCBTMCH EQU   ASCB+104
ASCBNSWP EQU   ASCBFLG1
ASCBTYP1 EQU   ASCBFLG1
ASCBSTND EQU   ASCBFLG1
ASCBABNT EQU   ASCBFLG1
ASCBTERM EQU   ASCBFLG1
ASCBS3S  EQU   ASCBFLG1
ASCBCMSH EQU   ASCBFLG1
ASCBTOFF EQU   ASCBFLG1
ASCBRF01 EQU   ASCBRCTF
ASCBTMLW EQU   ASCBRCTF
ASCBOUT  EQU   ASCBRCTF
ASCBWAIT EQU   ASCBRCTF
ASCBRV08 EQU   ASCBRCTF
ASCBFQU  EQU   ASCBRCTF
ASCBFRS  EQU   ASCBRCTF
ASCBTMNO EQU   ASCBRCTF
ASCBAFFN EQU   ASCBFW1
ASCBDUMP EQU   ASCB+96
ASCBQSVC EQU   ASCB+92
ASCBUBET EQU   ASCB+88
ASCBECB  EQU   ASCB+84
ASCBJSTL EQU   ASCB+80
ASCBEWST EQU   ASCB+72
ASCBEJST EQU   ASCB+64
ASCBTSB  EQU   ASCB+60
ASCBCSCB EQU   ASCB+56
ASCBRSM  EQU   ASCB+52
ASCBLDA  EQU   ASCB+48
ASCBSTOR EQU   ASCB+44
ASCBDP   EQU   ASCB+43
ASCBRV07 EQU   ASCB+42
ASCBIOSM EQU   ASCB+40
ASCBSEQN EQU   ASCB+38
ASCBCPUS EQU   ASCB+32
ASCBSPL  EQU   ASCB+28
ASCBLSLQ EQU   ASCB+24
ASCBFSLQ EQU   ASCB+20
ASCBIOSP EQU   ASCB+16
ASCBLOCK EQU   ASCB+12
ASCBBWDP EQU   ASCB+8
ASCBFWDP EQU   ASCB+4
ASCBASCB EQU   ASCB
ASCBEGIN EQU   ASCB
JSCBCSCB EQU   JSCBSEC1+68
JSCBPMG  EQU   JSCBWTP+2
JSCBWTSP EQU   JSCBWTP+1
JSCRSV23 EQU   JSCBWTFG
JSCRSV22 EQU   JSCBWTFG
JSCRSV21 EQU   JSCBWTFG
JSCRSV20 EQU   JSCBWTFG
JSCRSV19 EQU   JSCBWTFG
JSCRSV18 EQU   JSCBWTFG
JSCBRET  EQU   JSCBWTFG
JSCBIOFG EQU   JSCBWTFG
@NM00012 EQU   JSCBSEC1+60
JSCBQMPI EQU   JSCBSEC1+56
JSCBPMSG EQU   JSCBSWT1
JSCRSV16 EQU   JSCBSWT1
JSCRSV15 EQU   JSCBSWT1
JSCRSV14 EQU   JSCBSWT1
JSCRSV13 EQU   JSCBSWT1
JSCRSV12 EQU   JSCBSWT1
JSCRSV11 EQU   JSCBSWT1
JSCBPASS EQU   JSCBSWT1
JSCBTTTR EQU   JSCBSEC1+52
JSCRSV10 EQU   JSCBSEC1+49
JSCBAUTH EQU   JSCBOPTS
JSCSIOTS EQU   JSCBOPTS
JSCRSV08 EQU   JSCBOPTS
JSCRSV07 EQU   JSCBOPTS
JSCRSV06 EQU   JSCBOPTS
JSCBLONG EQU   JSCBOPTS
JSCRSV05 EQU   JSCBOPTS
JSCRSV04 EQU   JSCBOPTS
JSCBSECB EQU   JSCBSEC1+44
JSCRSV03 EQU   JSCBSEC1+41
JSCBSTEP EQU   JSCBSEC1+40
JSCBDCBA EQU   JSCBDCB+1
JSCRSV02 EQU   JSCBDCB
JSCBID   EQU   JSCBSEC1+32
JSCBDBTB EQU   JSCBSEC1+28
JSCBIJSC EQU   JSCBSEC1+24
JSCBTCBP EQU   JSCBSEC1+20
JSCBPCC  EQU   JSCBSEC1+16
JSCBTCP  EQU   JSCBSEC1+12
JSCBSHR  EQU   JSCBSEC1+8
JSCHPCEA EQU   JSCHPCE+1
JSCRSV32 EQU   JSCHPCE
JSCRSV01 EQU   JSCBSEC1
@NM00011 EQU   IEZJSCB
ASWRSV02 EQU   ASWAFLGS+1
ASWRSV01 EQU   ASWADSWS
ASWANOCH EQU   ASWADSWS
ASWADYUE EQU   ASWADSWS
ASWAVMVF EQU   ASWADSWS
ASWACOMF EQU   ASWADSWS
ASWADYNF EQU   ASWADSWS
AQMQBPTR EQU   AQMPARAM+24
AQMPFLG  EQU   AQMNORMP
GRPMASK  EQU   GMTENTRY
GMTENTNO EQU   GMTHDR
EUCBTPOS EQU   EUCBENTY
EUCBENLN EQU   EUCBHDR+4
EUCBENNO EQU   EUCBHDR
GRPUCBNO EQU   GRPENTRY+4
GRPID    EQU   GRPENTRY
GRPENTLN EQU   GRPHDR+4
GRPENTNO EQU   GRPHDR
GRPTR    EQU   GRPTRTAB
GENGRPTR EQU   GENENTRY+8
GENGRPNO EQU   GENENTRY+4
GENDEVT  EQU   GENENTRY
GENENTLN EQU   GENHDR+4
GENENTNO EQU   GENHDR
LUVAGMTP EQU   LUVENTRY+28
@NM00010 EQU   LUVFLAGS
LUVMGENS EQU   LUVFLAGS
LUVAGMSK EQU   LUVFLAGS
LUVVAM   EQU   LUVFLAGS
LUVGENP  EQU   LUVENTRY+20
LUVGENNO EQU   LUVENTRY+16
LUVALUE  EQU   LUVENTRY+8
UNITNAME EQU   LUVENTRY
LUVENTLN EQU   LUVHDR+4
LUVENTNO EQU   LUVHDR
CVTLEVL  EQU   CVTRELNO+2
CVTNUMB  EQU   CVTRELNO
CVTMDL   EQU   CVTFIX+250
@NM00009 EQU   CVTFIX+248
@NM00008 EQU   CVTFIX
CVTRV482 EQU   CVTXTNT2+128
CVTRV481 EQU   CVTXTNT2+124
CVTRV480 EQU   CVTXTNT2+120
CVTRV479 EQU   CVTXTNT2+118
CVTRV478 EQU   CVTXTNT2+117
CVTRV477 EQU   CVTXTNT2+116
CVTRV476 EQU   CVTXTNT2+115
CVTRV475 EQU   CVTXTNT2+114
CVTRV474 EQU   CVTRV466
CVTRV473 EQU   CVTRV466
CVTRV472 EQU   CVTRV466
CVTRV471 EQU   CVTRV466
CVTRV470 EQU   CVTRV466
CVTRV469 EQU   CVTRV466
CVTRV468 EQU   CVTRV466
CVTRV467 EQU   CVTRV466
CVTRV465 EQU   CVTRV457
CVTRV464 EQU   CVTRV457
CVTRV463 EQU   CVTRV457
CVTRV462 EQU   CVTRV457
CVTRV461 EQU   CVTRV457
CVTRV460 EQU   CVTRV457
CVTRV459 EQU   CVTRV457
CVTRV458 EQU   CVTRV457
CVTRV456 EQU   CVTXTNT2+108
CVTRV455 EQU   CVTXTNT2+104
CVTRV454 EQU   CVTXTNT2+100
CVTRV453 EQU   CVTXTNT2+96
CVTRV452 EQU   CVTXTNT2+94
CVTRV451 EQU   CVTXTNT2+92
CVTRV450 EQU   CVTXTNT2+90
CVTRV449 EQU   CVTXTNT2+88
CVTRV448 EQU   CVTXTNT2+87
CVTRV447 EQU   CVTXTNT2+86
CVTRV446 EQU   CVTRV438
CVTRV445 EQU   CVTRV438
CVTRV444 EQU   CVTRV438
CVTRV443 EQU   CVTRV438
CVTRV442 EQU   CVTRV438
CVTRV441 EQU   CVTRV438
CVTRV440 EQU   CVTRV438
CVTRV439 EQU   CVTRV438
CVTRV437 EQU   CVTRV429
CVTRV436 EQU   CVTRV429
CVTRV435 EQU   CVTRV429
CVTRV434 EQU   CVTRV429
CVTRV433 EQU   CVTRV429
CVTRV432 EQU   CVTRV429
CVTRV431 EQU   CVTRV429
CVTRV430 EQU   CVTRV429
CVTRV428 EQU   CVTXTNT2+80
CVTRV427 EQU   CVTXTNT2+76
CVTRV426 EQU   CVTXTNT2+72
CVTRV425 EQU   CVTXTNT2+68
CVTATACT EQU   CVTATCVT
CVTRV423 EQU   CVTXTNT2+62
CVTRV422 EQU   CVTXTNT2+60
CVTRV421 EQU   CVTXTNT2+58
CVTRV420 EQU   CVTXTNT2+56
CVTRV419 EQU   CVTXTNT2+55
CVTRV418 EQU   CVTXTNT2+54
CVTRV417 EQU   CVTRV409
CVTRV416 EQU   CVTRV409
CVTRV415 EQU   CVTRV409
CVTRV414 EQU   CVTRV409
CVTRV413 EQU   CVTRV409
CVTRV412 EQU   CVTRV409
CVTRV411 EQU   CVTRV409
CVTRV410 EQU   CVTRV409
CVTRV408 EQU   CVTRV400
CVTRV407 EQU   CVTRV400
CVTRV406 EQU   CVTRV400
CVTRV405 EQU   CVTRV400
CVTRV404 EQU   CVTRV400
CVTRV403 EQU   CVTRV400
CVTRV402 EQU   CVTRV400
CVTRV401 EQU   CVTRV400
CVTICB   EQU   CVTXTNT2+48
CVTSKTA  EQU   CVTXTNT2+44
CVTCCVT  EQU   CVTXTNT2+40
CVTRSV98 EQU   CVTXTNT2+36
CVTRSV97 EQU   CVTXTNT2+34
CVTRSV96 EQU   CVTXTNT2+32
CVTOLTEP EQU   CVTXTNT2+28
CVTQIDA  EQU   CVTQID+1
CVTRSV95 EQU   CVTQID
CVTRSV94 EQU   CVTXTNT2+20
CVTRSV93 EQU   CVTXTNT2+16
CVTRSV92 EQU   CVTXTNT2+12
CVTDEBVR EQU   CVTXTNT2+8
CVTRSV91 EQU   CVTXTNT2+6
CVTRSV9H EQU   CVTFLGBT
CVTRSV9G EQU   CVTFLGBT
CVTRSV9F EQU   CVTFLGBT
CVTRSV9E EQU   CVTFLGBT
CVTRSV9D EQU   CVTFLGBT
CVTRSV9C EQU   CVTFLGBT
CVTVME   EQU   CVTFLGBT
CVTNPE   EQU   CVTFLGBT
CVTNUCLS EQU   CVTXTNT2+4
CVTDSSVA EQU   CVTDSSV+1
CVTRSV89 EQU   CVTDSSV
CVTRSV88 EQU   CVTXTNT1+8
CVTRSV87 EQU   CVTXTNT1+4
CVTFACHN EQU   CVTXTNT1
CVTRV488 EQU   CVTMAP+412
CVTRV487 EQU   CVTMAP+408
CVTRV486 EQU   CVTMAP+404
CVTRV485 EQU   CVTMAP+400
CVTACTAP EQU   CVTMAP+396
CVTAUTH  EQU   CVTMAP+392
CVTATMCA EQU   CVTATMCT+1
CVTATMST EQU   CVTATMCT
CVTRSV61 EQU   CVTMAP+384
CVTVOLT1 EQU   CVTVOLM1+1
CVTVOLI1 EQU   CVTVOLF1
CVTSTOA  EQU   CVTMAP+376
CVTRSV58 EQU   CVTMAP+374
CVTRSV57 EQU   CVTMAP+372
CVTDDCE  EQU   CVTMAP+368
CVTPNWFR EQU   CVTMAP+364
CVTSMF   EQU   CVTMAP+360
CVTSULK  EQU   CVTMAP+358
CVTSLKO  EQU   CVTSYSK
CVTSLKP  EQU   CVTSYSK
CVTSLKQ  EQU   CVTSYSK
CVTSLKR  EQU   CVTSYSK
CVTRSV56 EQU   CVTSYSK
CVTRSV55 EQU   CVTSYSK
CVTRSV54 EQU   CVTSYSK
CVTRSV53 EQU   CVTSYSK
CVTRSV52 EQU   CVTA1F1
CVTRSV51 EQU   CVTA1F1
CVTRSV50 EQU   CVTA1F1
CVTRSV49 EQU   CVTA1F1
CVTRSV48 EQU   CVTA1F1
CVTRSV47 EQU   CVTA1F1
CVTSRSW  EQU   CVTA1F1
CVTPFSW  EQU   CVTA1F1
CVTPCVT  EQU   CVTMAP+352
CVTRSV46 EQU   CVTMAP+344
CVTRSV45 EQU   CVTMAP+340
CVTRSV44 EQU   CVTMAP+338
CVTRSV43 EQU   CVTMAP+336
CVTHJESA EQU   CVTHJES+1
CVTRSV42 EQU   CVTHJES
CVTEXT2A EQU   CVTEXT2+1
CVTRSV41 EQU   CVTEXT2
CVTAPFA  EQU   CVTAPF+1
CVTRSV40 EQU   CVTAPF
CVTRV518 EQU   CVTINTLA
CVTRV517 EQU   CVTERPV
CVTEORM  EQU   CVTMAP+312
CVTMCHPR EQU   CVTMAP+308
CVTTZ    EQU   CVTMAP+304
CVTJEPS  EQU   CVTMAP+300
CVTJESCT EQU   CVTMAP+296
CVTMODE  EQU   CVTMAP+292
CVTPTRV  EQU   CVTMAP+288
CVTREAL  EQU   CVTMAP+284
CVTRSV39 EQU   CVTMAP+280
CVTRSV38 EQU   CVTMAP+276
CVTDMSRA EQU   CVTDMSR+1
CVTRV634 EQU   CVTDMSRF
CVTRV633 EQU   CVTDMSRF
CVTRV632 EQU   CVTDMSRF
CVTRV631 EQU   CVTDMSRF
CVTRV630 EQU   CVTDMSRF
CVTRV629 EQU   CVTDMSRF
CVTUDUMP EQU   CVTDMSRF
CVTSDUMP EQU   CVTDMSRF
CVTQMSGA EQU   CVTQMSG+1
CVTRSV36 EQU   CVTQMSG
CVTAMFF  EQU   CVTMAP+264
CVTPURGA EQU   CVTPURG+1
CVTRSV35 EQU   CVTPURG
CVTCBSP  EQU   CVTMAP+256
CVTATERA EQU   CVTATER+1
CVTSYST  EQU   CVTATER
CVTVOLT2 EQU   CVTTAT
CVTVOLI2 EQU   CVTVOLF2
CVTAQAVB EQU   CVTAQAVT+1
CVTRSV34 EQU   CVTTCMFG
CVTRSV33 EQU   CVTTCMFG
CVTRSV32 EQU   CVTTCMFG
CVTRSV31 EQU   CVTTCMFG
CVTRSV30 EQU   CVTTCMFG
CVTRSV29 EQU   CVTTCMFG
CVTRSV28 EQU   CVTTCMFG
CVTTCRDY EQU   CVTTCMFG
CVTGTFA  EQU   CVTGTF+1
CVTRSV27 EQU   CVTGTFST
CVTRNIO  EQU   CVTGTFST
CVTUSR   EQU   CVTGTFST
CVTRV318 EQU   CVTFORM
CVTRV317 EQU   CVTTMODE
CVTRV316 EQU   CVTSTATE
CVTRV315 EQU   CVTGTFS
CVTGTFAV EQU   CVTGTFS
CVT0SCR1 EQU   CVTMAP+232
CVTRV515 EQU   CVTMAP+228
CVTRMS   EQU   CVTMAP+224
CVTPATCH EQU   CVTMAP+220
CVTTSCE  EQU   CVTMAP+216
CVTLNKSC EQU   CVTMAP+214
CVTQABST EQU   CVTMAP+212
CVTMDLDS EQU   CVTMAP+208
CVTUSER  EQU   CVTMAP+204
CVTABEND EQU   CVTMAP+200
CVTSMCA  EQU   CVTMAP+196
CVTRSV18 EQU   CVTMAP+192
CVTQLPAQ EQU   CVTMAP+188
CVTQCDSR EQU   CVTMAP+184
CVTRSV17 EQU   CVTOPTB
CVTRSV16 EQU   CVTOPTB
CVTFP    EQU   CVTOPTB
CVTAPTHR EQU   CVTOPTB
CVTNLOG  EQU   CVTOPTB
CVTTOD   EQU   CVTOPTB
CVTCTIMS EQU   CVTOPTB
CVTPROT  EQU   CVTOPTB
CVTXPFP  EQU   CVTOPTA
CVTASCII EQU   CVTOPTA
CVTRSV13 EQU   CVTOPTA
CVTRSV12 EQU   CVTOPTA
CVTNIP   EQU   CVTOPTA
CVTDDR   EQU   CVTOPTA
CVTAPR   EQU   CVTOPTA
CVTCCH   EQU   CVTOPTA
CVTSNCTR EQU   CVTMAP+180
CVTQMWR  EQU   CVTMAP+176
CVTQOCR  EQU   CVTMAP+172
CVT1EF00 EQU   CVTMAP+168
CVTMZ00  EQU   CVTMAP+164
CVTSV76Q EQU   CVTSV76C
CVTRSV11 EQU   CVTMAP+156
CVT0PT01 EQU   CVTMAP+152
CVTMSER  EQU   CVTMAP+148
CVTRV516 EQU   CVTIERLC
CVTILCH  EQU   CVTMAP+140
CVT0DS   EQU   CVTMAP+136
CVTFBOSV EQU   CVTMAP+132
CVTNUCB  EQU   CVTMAP+128
CVTIXAVL EQU   CVTMAP+124
CVTSV76M EQU   CVTIOQET
CVTDCBA  EQU   CVTMAP+117
CVTMVS2  EQU   CVTDCB
CVT6DAT  EQU   CVTDCB
CVT4MPS  EQU   CVTDCB
CVTRSV09 EQU   CVTDCB
CVT4MS1  EQU   CVTDCB
CVT2SPS  EQU   CVTDCB
CVT1SSS  EQU   CVTDCB
CVTRSV08 EQU   CVTDCB
CVTSTB   EQU   CVTMAP+112
CVTQTD00 EQU   CVTMAP+108
CVTQTE00 EQU   CVTMAP+104
CVTCUCB  EQU   CVTMAP+100
CVTSJQ   EQU   CVTMAP+96
CVTPBLDL EQU   CVTMAP+92
CVTTPC   EQU   CVTMAP+88
CVTSVDCB EQU   CVTMAP+84
CVTBRET  EQU   CVTMAP+82
CVTEXIT  EQU   CVTMAP+80
CVT0FN00 EQU   CVTMAP+76
CVTDARA  EQU   CVTDAR+1
CVTRSV07 EQU   CVTFLGS1
CVTRSV06 EQU   CVTFLGS1
CVTRSV05 EQU   CVTFLGS1
CVTRSV04 EQU   CVTFLGS1
CVTRSV03 EQU   CVTFLGS1
CVTRSV02 EQU   CVTFLGS1
CVTRSV01 EQU   CVTFLGS1
CVTDMPLK EQU   CVTFLGS1
CVTXITP  EQU   CVTMAP+68
CVTZDTAB EQU   CVTMAP+64
CVTMSLT  EQU   CVTMAP+60
CVTDATE  EQU   CVTMAP+56
CVTBTERM EQU   CVTMAP+52
CVTSYSAD EQU   CVTMAP+48
CVTXTLER EQU   CVTMAP+44
CVTILK2  EQU   CVTMAP+40
CVTILK1  EQU   CVTMAP+36
CVTPRLTV EQU   CVTMAP+32
CVTPCNVT EQU   CVTMAP+28
CVT0VL00 EQU   CVTMAP+24
CVTXAPG  EQU   CVTMAP+20
CVTBUF   EQU   CVTMAP+16
CVTJOB   EQU   CVTMAP+12
CVTLINK  EQU   CVTMAP+8
CVT0EF00 EQU   CVTMAP+4
CVT      EQU   CVTMAP
@NM00006 EQU   WORKFMAP
@NM00005 EQU   LOCKFMAP
AUTODAT  EQU   LOCKESPA
@NM00002 EQU   TCBPTRS
@NM00038 EQU   PSA+3668
PSASTAK  EQU   PSA+3072
@NM00037 EQU   PSA+1048
PSAUSEND EQU   PSA+1048
PSARV062 EQU   PSA+1044
PSACDAL  EQU   PSA+1040
PSAWTCOD EQU   PSA+1036
PSAATCVT EQU   PSA+1032
PSAPCPSW EQU   PSA+1024
PSAPIR2  EQU   PSA+1020
PSARV059 EQU   PSA+1018
PSASVC13 EQU   PSA+1016
PSALSFCC EQU   PSA+1012
PSASFACC EQU   PSA+1008
PSASTOP  EQU   PSA+992
PSASTART EQU   PSA+976
PSARSPSW EQU   PSA+968
PSASRPSW EQU   PSA+960
PSARV045 EQU   PSA+892
PSARV044 EQU   PSA+888
PSARV043 EQU   PSA+884
PSARV042 EQU   PSA+880
PSARV041 EQU   PSA+876
PSARV040 EQU   PSA+872
PSARV025 EQU   PSA+868
PSADSSED EQU   PSA+868
PSADSSPR EQU   PSA+864
PSADSSFW EQU   PSA+860
PSADSS14 EQU   PSA+856
PSADSSPP EQU   PSA+848
PSADSSRP EQU   PSA+840
PSADSS05 EQU   PSADSSF4
PSADSS10 EQU   PSADSSF4
PSADSSVE EQU   PSADSSF4
PSADSSDE EQU   PSADSSF4
PSADSSC0 EQU   PSADSSF4
PSADSSIE EQU   PSADSSF4
PSADSS12 EQU   PSADSSF4
PSADSSRC EQU   PSADSSF4
PSARV057 EQU   PSADSSF3
PSARV056 EQU   PSADSSF3
PSARV055 EQU   PSADSSF3
PSADSSMC EQU   PSADSSF3
PSADSSRW EQU   PSADSSF3
PSADSSNM EQU   PSADSSF3
PSADSSES EQU   PSADSSF3
PSADSSGP EQU   PSADSSF3
PSADSSF2 EQU   PSADSSFL+1
PSADSSPI EQU   PSADSSF1
PSADSSOI EQU   PSADSSF1
PSADSSSP EQU   PSADSSF1
PSADSSTP EQU   PSADSSF1
PSADSSDW EQU   PSADSSF1
PSADSSDD EQU   PSADSSF1
PSADSSDM EQU   PSADSSF1
PSADSSMV EQU   PSADSSF1
PSADSSTS EQU   PSA+816
PSADSSWK EQU   PSA+812
PSADSSR3 EQU   PSA+808
PSADSSR2 EQU   PSA+804
PSADSSRS EQU   PSA+800
PSASTOR  EQU   PSA+796
PSACPUSA EQU   PSA+794
PSAVSTAP EQU   PSA+792
PSAWKVAP EQU   PSA+788
PSAWKRAP EQU   PSA+784
PSAMCHIC EQU   PSA+783
PSARV061 EQU   PSA+782
PSASYMSK EQU   PSA+781
PSAMCHFL EQU   PSA+780
PSACR0   EQU   PSA+776
PSAPSWSV EQU   PSA+768
PSALITA  EQU   PSA+764
PSACLHS  EQU   PSAHLHI
PSALKR15 EQU   PSALKSA+60
PSALKR14 EQU   PSALKSA+56
PSALKR13 EQU   PSALKSA+52
PSALKR12 EQU   PSALKSA+48
PSALKR11 EQU   PSALKSA+44
PSALKR10 EQU   PSALKSA+40
PSALKR9  EQU   PSALKSA+36
PSALKR8  EQU   PSALKSA+32
PSALKR7  EQU   PSALKSA+28
PSALKR6  EQU   PSALKSA+24
PSALKR5  EQU   PSALKSA+20
PSALKR4  EQU   PSALKSA+16
PSALKR3  EQU   PSALKSA+12
PSALKR2  EQU   PSALKSA+8
PSALKR1  EQU   PSALKSA+4
PSALKR0  EQU   PSALKSA
PSARV023 EQU   PSACLHT+52
PSALOCAL EQU   PSACLHT+48
PSACMSL  EQU   PSACLHT+44
PSAOPTL  EQU   PSACLHT+40
PSATPACL EQU   PSACLHT+36
PSATPDNL EQU   PSACLHT+32
PSATPNCL EQU   PSACLHT+28
PSAIOSLL EQU   PSACLHT+24
PSAIOSUL EQU   PSACLHT+20
PSAIOSCL EQU   PSACLHT+16
PSAIOSSL EQU   PSACLHT+12
PSASALCL EQU   PSACLHT+8
PSAASML  EQU   PSACLHT+4
PSADISPL EQU   PSACLHT
PSASRSA  EQU   PSA+636
PSARV050 EQU   PSA+634
PSADSSGO EQU   PSA+633
PSARECUR EQU   PSA+632
PSAHLHIS EQU   PSA+628
PSAIPCSA EQU   PSA+624
@NM00036 EQU   PSA+621
PSAIPCDM EQU   PSA+620
PSAIPCD  EQU   PSA+616
@NM00035 EQU   PSA+613
PSAIPCRM EQU   PSA+612
PSAIPCR  EQU   PSA+608
PSAMCHEX EQU   PSA+600
PSAMPSW  EQU   PSA+592
PSAEXPS2 EQU   PSA+584
PSAEXPS1 EQU   PSA+576
PSAPIREG EQU   PSA+572
PSARSREG EQU   PSA+568
PSAGPREG EQU   PSA+556
PSARV022 EQU   PSASUP4
PSARV021 EQU   PSASUP4
PSARV020 EQU   PSASUP4
PSARV019 EQU   PSASUP4
PSARV018 EQU   PSASUP4
PSARV017 EQU   PSASUP4
PSARV016 EQU   PSASUP4
PSARV015 EQU   PSASUP4
PSARV014 EQU   PSASUP3
PSAULCMS EQU   PSASUP3
PSARV012 EQU   PSASUP3
PSAESTA  EQU   PSASUP3
PSASPR   EQU   PSASUP3
PSAPSREG EQU   PSASUP3
PSAPI2   EQU   PSASUP3
PSAIOSUP EQU   PSASUP3
PSALCR   EQU   PSASUP2
PSARTM   EQU   PSASUP2
PSAACR   EQU   PSASUP2
PSAIPCE2 EQU   PSASUP2
PSAIPCES EQU   PSASUP2
PSAIPCEC EQU   PSASUP2
PSAGTF   EQU   PSASUP2
PSAIPCRI EQU   PSASUP2
PSATYPE6 EQU   PSASUP1
PSATCTL  EQU   PSASUP1
PSADISP  EQU   PSASUP1
PSALOCK  EQU   PSASUP1
PSAPI    EQU   PSASUP1
PSAEXT   EQU   PSASUP1
PSASVC   EQU   PSASUP1
PSAIO    EQU   PSASUP1
PSAANEW  EQU   PSA+544
PSATOLD  EQU   PSA+540
PSATNEW  EQU   PSA+536
PSALCCAR EQU   PSA+532
PSALCCAV EQU   PSA+528
PSAPCCAR EQU   PSA+524
PSAPCCAV EQU   PSA+520
PSACPULA EQU   PSA+518
PSACPUPA EQU   PSA+516
PSAPSA   EQU   PSA+512
FLCHDEND EQU   PSA+512
FLCCRSAV EQU   FLCMCLA+280
FLCGRSAV EQU   FLCMCLA+216
FLCFPSAV EQU   FLCMCLA+184
FLCFLA   EQU   FLCMCLA+88
FLCRGNCD EQU   FLCMCLA+84
FLCFSAA  EQU   FLCFSA+1
@NM00034 EQU   FLCFSA
@NM00033 EQU   FLCMCLA+72
FLCMCIC  EQU   FLCMCLA+64
@NM00032 EQU   FLCMCLA+20
FLCIOAA  EQU   FLCIOA+1
@NM00031 EQU   FLCIOA
@NM00030 EQU   FLCMCLA+15
@NM00029 EQU   FLCMCLA+14
@NM00028 EQU   FLCMCLA+12
FLCLCL   EQU   FLCMCLA+8
FLCIOELA EQU   FLCIOEL+1
@NM00027 EQU   FLCIOEL
FLCCHNID EQU   FLCMCLA
@NM00026 EQU   PSA+160
FLCMTRCD EQU   PSA+157
@NM00025 EQU   PSA+156
FLCPERA  EQU   FLCPER+1
@NM00024 EQU   FLCPER
@NM00023 EQU   PSA+151
FLCPERCD EQU   PSA+150
FLCMCNUM EQU   PSA+149
@NM00022 EQU   PSA+148
FLCTEAA  EQU   FLCTEA+1
@NM00021 EQU   FLCTEA
PSAPIPC  EQU   PSAPICOD
PSAPIMC  EQU   PSAPICOD
PSAPIPER EQU   PSAPICOD
PSARV049 EQU   FLCPICOD
FLCPILCB EQU   FLCPIILC
@NM00020 EQU   FLCPIILC
@NM00019 EQU   PSAEPPSW
FLCSVCN  EQU   PSAESPSW+2
FLCSILCB EQU   FLCSVILC
@NM00018 EQU   FLCSVILC
@NM00017 EQU   PSAESPSW
FLCEICOD EQU   PSAEEPSW+2
PSASPAD  EQU   PSAEEPSW
@NM00016 EQU   PSA+128
FLCINPSW EQU   PSA+120
FLCMNPSW EQU   PSA+112
FLCPNPSW EQU   PSA+104
FLCSNPSW EQU   PSA+96
FLCENPSW EQU   PSA+88
FLCTRACE EQU   PSA+84
FLCTIMER EQU   PSA+80
FLCCVT2  EQU   PSA+76
FLCCAW   EQU   PSA+72
FLCCSW   EQU   PSA+64
FLCIOPSW EQU   PSA+56
FLCMOPSW EQU   PSA+48
FLCPOPSW EQU   PSA+40
FLCSOPSW EQU   PSA+32
FLCEOPSW EQU   PSA+24
@NM00015 EQU   FLCICCW2+4
FLCCVT   EQU   FLCICCW2
FLCICCW1 EQU   FLCROPSW
FLCIPPSW EQU   FLCRNPSW
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS
@RC00183 EQU   @RC00164
@RC00094 EQU   @RC00066
@RC00153 EQU   @RC00094
@RC00193 EQU   @RC00153
@RF00202 EQU   @RC00193
@ENDDATA EQU   *
         END   IEFAB4EC,(C'PLS1203',0701,78124)
