         TITLE 'IEFAB4M9 - ALLOCATION RECOVERY OPERATOR MESSAGES       *
                       '
IEFAB4M9 CSECT
*END IEFAB4M9;                                                     0020
@DATA    DS    0H
         DS    0F
         DS    0F
         DS    0D
HDRMSG1  DS    CL71
         ORG   HDRMSG1
MSG1LNTH DC    AL2(68)
NOUNOFFS DC    AL1(UNALUNO-HDRLINE1)
HDRLINE1 DS    CL68
         ORG   HDRLINE1
@NM00001 DC    CL35'IEF244I JOBNAMEX STEPNAME PSTEPNME '
@NM00002 DC    CL21'- UNABLE TO ALLOCATE '
UNALUNO  DC    CL4'XXXX'
@NM00003 DC    CL8' UNIT(S)'
         ORG   HDRMSG1+71
         DS    CL1
HDR2OFFS DS    CL12
         ORG   HDR2OFFS
OFFSL2A  DS    CL4
         ORG   OFFSL2A
@NM00004 DC    AL2(HDRL2A-HDRMSG2)
@NM00005 DC    AL2(39)
         ORG   HDR2OFFS+4
OFFSL2B  DS    CL4
         ORG   OFFSL2B
@NM00006 DC    AL2(HDRL2B-HDRMSG2)
@NM00007 DC    AL2(37)
         ORG   HDR2OFFS+8
OFFSL2C  DS    CL4
         ORG   OFFSL2C
@NM00008 DC    AL2(HDRL2C-HDRMSG2)
@NM00009 DC    AL2(56)
         ORG   HDR2OFFS+12
HDRMSG2  DS    CL138
         ORG   HDRMSG2
HL2AENT  DS    CL41
         ORG   HL2AENT
HDRL2A   DS    CL39
         ORG   HDRL2A
@NM00010 DC    CL9'AT LEAST '
ALCUNNOA DC    CL4'XXXX'
@NM00011 DC    CL26' ALLOCATED UNIT(S) NEEDED.'
         ORG   HL2AENT+39
@NM00012 DC    AL1(ALCUNNOA-HDRL2A)
@NM00013 DC    AL1(0)
         ORG   HDRMSG2+41
HL2BENT  DS    CL39
         ORG   HL2BENT
HDRL2B   DS    CL37
         ORG   HDRL2B
@NM00014 DC    CL9'AT LEAST '
OFLUNNOB DC    CL4'XXXX'
@NM00015 DC    CL24' OFFLINE UNIT(S) NEEDED.'
         ORG   HL2BENT+37
@NM00016 DC    AL1(0)
@NM00017 DC    AL1(OFLUNNOB-HDRL2B)
         ORG   HDRMSG2+80
HL2CENT  DS    CL58
         ORG   HL2CENT
HDRL2C   DS    CL56
         ORG   HDRL2C
@NM00018 DC    CL9'AT LEAST '
ALCUNNOC DC    CL4'XXXX'
@NM00019 DC    CL15' ALLOCATED AND '
OFLUNNOC DC    CL4'XXXX'
@NM00020 DC    CL24' OFFLINE UNIT(S) NEEDED.'
         ORG   HL2CENT+56
@NM00021 DC    AL1(ALCUNNOC-HDRL2C)
@NM00022 DC    AL1(OFLUNNOC-HDRL2C)
         ORG   HDRMSG2+138
RPLYOFFS DS    CL12
         ORG   RPLYOFFS
OFFSR1   DS    CL4
         ORG   OFFSR1
@NM00023 DC    AL2(RPLY1-RPLYOPTS)
@NM00024 DC    AL2(19)
         ORG   RPLYOFFS+4
OFFSR2   DS    CL4
         ORG   OFFSR2
@NM00025 DC    AL2(RPLY2-RPLYOPTS)
@NM00026 DC    AL2(24)
         ORG   RPLYOFFS+8
OFFSR3   DS    CL4
         ORG   OFFSR3
@NM00027 DC    AL2(RPLY3-RPLYOPTS)
@NM00028 DC    AL2(31)
         ORG   RPLYOFFS+12
RPLYOPTS DS    CL74
         ORG   RPLYOPTS
RPLY1    DS    CL19
         ORG   RPLY1
@NM00031 DC    CL19'''WAIT'' OR ''CANCEL''.'
         ORG   RPLYOPTS+19
RPLY2    DS    CL24
         ORG   RPLY2
@NM00032 DC    CL24'DEVICE NAME OR ''CANCEL''.'
         ORG   RPLYOPTS+43
RPLY3    DS    CL31
         ORG   RPLY3
@NM00033 DC    CL31'DEVICE NAME,''WAIT'' OR ''CANCEL''.'
         ORG   RPLYOPTS+74
RMSGID   DS    CL27
         ORG   RMSGID
@NM00029 DC    AL2(25)
RPLYID   DS    CL25
         ORG   RPLYID
@NM00030 DC    CL25'IEF238D JOBNAMEX - REPLY '
         ORG   RMSGID+27
         DS    CL1
SWMSGOFS DS    CL8
         ORG   SWMSGOFS
SWOFFS1  DS    CL4
         ORG   SWOFFS1
@NM00034 DC    AL2(SWMSG1-SWMSGOPS)
@NM00035 DC    AL2(9)
         ORG   SWMSGOFS+4
SWOFFS2  DS    CL4
         ORG   SWOFFS2
@NM00036 DC    AL2(SWMSG2-SWMSGOPS)
@NM00037 DC    AL2(26)
         ORG   SWMSGOFS+8
SWMSGOPS DS    CL39
         ORG   SWMSGOPS
SWM1ENT  DS    CL11
         ORG   SWM1ENT
SWMSG1   DS    CL9
         ORG   SWMSG1
@NM00041 DC    CL6' UNIT '
WTUNTAD  DC    CL3'UXX'
         ORG   SWM1ENT+9
@NM00042 DC    AL1(0)
@NM00043 DC    AL1(WTUNTAD-SWMSG1)
         ORG   SWMSGOPS+11
SW2ENT   DS    CL28
         ORG   SW2ENT
SWMSG2   DS    CL26
         ORG   SWMSG2
@NM00044 DC    CL8' VOLUME '
WTVOL    DC    CL6'VOLSER'
@NM00045 DC    CL9' ON UNIT '
WTVOLUN  DC    CL3'UXX'
         ORG   SW2ENT+26
@NM00046 DC    AL1(WTVOL-SWMSG2)
@NM00047 DC    AL1(WTVOLUN-SWMSG2)
         ORG   SWMSGOPS+39
         DS    CL1
SWMSGID  DS    CL48
         ORG   SWMSGID
@NM00038 DC    AL2(46)
SWMSGBEG DS    CL46
         ORG   SWMSGBEG
@NM00039 DC    CL33'IEF488I JOBNAMEX - DDNAMEXX +NNN '
@NM00040 DC    CL13'MUST WAIT FOR'
         ORG   SWMSGID+48
OFLMOFS  DS    CL8
         ORG   OFLMOFS
OFLOFS1  DS    CL4
         ORG   OFLOFS1
@NM00048 DC    AL2(OFLOPT1-OFLMSGS)
@NM00049 DC    AL2(8)
         ORG   OFLMOFS+4
OFLOFS2  DS    CL4
         ORG   OFLOFS2
@NM00050 DC    AL2(OFLOPT2-OFLMSGS)
@NM00051 DC    AL2(15)
         ORG   OFLMOFS+8
OFLMSGS  DS    CL23
         ORG   OFLMSGS
OFLOPT1  DS    CL8
         ORG   OFLOPT1
@NM00059 DC    CL8' OFFLINE'
         ORG   OFLMSGS+8
OFLOPT2  DS    CL15
         ORG   OFLOPT2
@NM00060 DC    CL15' NOT ACCESSIBLE'
         ORG   OFLMSGS+23
         DS    CL1
OFLHDR   DS    CL60
         ORG   OFLHDR
@NM00052 DC    AL2(56)
@NM00053 DC    AL1(OFLUNNO-OFLMSG1)
@NM00054 DC    AL1(OFLDDN-OFLMSG1)
OFLENT   DS    CL56
         ORG   OFLENT
OFLMSG1  DS    CL56
         ORG   OFLMSG1
@NM00055 DC    CL19'IEF489I JOBNAMEX - '
OFLUNNO  DC    CL4'XXXX'
@NM00056 DC    CL20' UNIT(S) NEEDED FOR '
OFLDDN   DC    CL13'DDNAMEXX +NNN'
         ORG   OFLHDR+60
OFLMSGID DS    CL21
         ORG   OFLMSGID
@NM00057 DC    AL2(19)
OFLMSG2  DS    CL19
         ORG   OFLMSG2
@NM00058 DC    CL19'IEF247I JOBNAMEX - '
         ORG   OFLMSGID+21
         DS    CL1
INVRMSG  DS    CL35
         ORG   INVRMSG
@NM00061 DC    AL2(33)
INVLRMSG DS    CL33
         ORG   INVLRMSG
@NM00062 DC    CL33'IEF490I JOBNAMEX - INVALID REPLY.'
         ORG   INVRMSG+35
         DS    CL1
INVROPT  DS    CL28
         ORG   INVROPT
@NM00063 DC    AL2(26)
INVLROPT DS    CL26
         ORG   INVLROPT
@NM00064 DC    CL26' DEVICE IS NOT ACCESSIBLE.'
         ORG   INVROPT+28
RPLYWAIT DS    CL64
         ORG   RPLYWAIT
@NM00065 DC    AL2(62)
WAITRPLY DS    CL62
         ORG   WAITRPLY
@NM00066 DC    CL37'IEF433D JOBNAMEX - WAIT REQUESTED -- '
@NM00067 DC    CL25'REPLY ''HOLD'' OR ''NOHOLD''.'
         ORG   RPLYWAIT+64
INVWTMSG DS    CL60
         ORG   INVWTMSG
@NM00068 DC    AL2(58)
INVWTTXT DS    CL58
         ORG   INVWTTXT
@NM00069 DC    CL33'IEF434D JOBNAMEX - INVALID REPLY.'
@NM00070 DC    CL25'REPLY ''HOLD'' OR ''NOHOLD''.'
         ORG   INVWTMSG+60
@00      EQU   00                      EQUATES FOR REGISTERS 0-15
@01      EQU   01
@02      EQU   02
@03      EQU   03
@04      EQU   04
@05      EQU   05
@06      EQU   06
@07      EQU   07
@08      EQU   08
@09      EQU   09
@10      EQU   10
@11      EQU   11
@12      EQU   12
@13      EQU   13
@14      EQU   14
@15      EQU   15
         ENTRY INVWTMSG
         ENTRY RPLYWAIT
         ENTRY INVROPT
         ENTRY INVRMSG
         ENTRY OFLMSGID
         ENTRY OFLHDR
         ENTRY OFLMSGS
         ENTRY OFLMOFS
         ENTRY SWMSGID
         ENTRY SWMSGOPS
         ENTRY SWMSGOFS
         ENTRY RMSGID
         ENTRY RPLYOPTS
         ENTRY RPLYOFFS
         ENTRY HDRMSG2
         ENTRY HDR2OFFS
         ENTRY HDRMSG1
@ENDDATA EQU   *
         END   IEFAB4M9
