         TITLE 'IEFAB4E8-COMMON ALLOC ESTAE EXIT RTN                   *
                        '
IEFAB4E8 CSECT
@MAINENT DS 0H
         USING *,15
         B @PROLOG
         DC AL1(16)
         DC C'IEFAB4E8 775.151'
         DROP 15
@PROLOG  BALR 12,0
@PSTART  DS 0H
         USING @PSTART,12
         LA 11,12
         CR 0,11                 SEE IF SDWA EXISTS
         BNE SETPTR              SDWA EXISTS
         LR 11,2                 GET PARMPTR FROM REG 2
         B COMMON
SETPTR   L 11,0(1)               GET PARMPTR FROM SDWA
COMMON   EQU *
         USING @DATD,11
*REG13INP = REG13;                     /*SAVE INPUT R13      @Z40FPPG*/
         LR    REG13INP,REG13                                   01S0039
*REG14SVE = REG14;                     /*SAVE RETURN ADDR            */
         LR    REG14SVE,REG14                                   01S0040
*EXITPRMP = REG11;                     /*POINTER TO USER PARMS       */
         ST    REG11,EXITPRMP                                   01S0041
*REG13 = REG11;                        /*PTR TO SAVE AREA            */
         LR    REG13,REG11                                      01S0042
*REG13SVE = REG13;                     /*SAVE REGISTER 13            */
         LR    REG13SVE,REG13                                   01S0043
*SDWAPTR = ZERO;                       /*INITIALIZE SDWA PTR         */
         SLR   SDWAPTR,SDWAPTR                                  01S0044
*IF REG0 ^= TWELVE THEN                /*SDWA SUPPLIED               */
         CH    REG0,@CH00033                                    01S0045
         BE    @RF00045                                         01S0045
*  DO;                                                          01S0046
*    SDWAPTR = REG1;                   /*SET PTR TO SDWA             */
         LR    SDWAPTR,REG1                                     01S0047
*    RFY SDWA BASED(SDWAPTR);                                   01S0048
*  END;                                                         01S0049
*RFY (REG0,REG1) UNRSTD;                                        01S0050
@RF00045 DS    0H                                               01S0051
*IF SDWAPTR ^= ZERO THEN               /*SDWA EXISTS                 */
         LTR   SDWAPTR,SDWAPTR                                  01S0051
         BZ    @RF00051                                         01S0051
*  DO;                                 /*PERFORM CLEANUP             */
*    DEQLISTA(1:DEQENTLN)=DEQFMT(1:DEQENTLN); /*MOVE DEQ LIST@YM07697*/
         L     @10,DEQENTLN                                     01S0053
         BCTR  @10,0                                            01S0053
         EX    @10,@SM01580                                     01S0053
*GENERATE REFS(DEQLISTA,RESNAME);      /*DEQ UCBS            @YM07697*/
 DEQ (RESNAME,,,SYSTEM),MF=(E,DEQLISTA),RET=HAVE,GENERIC=YES @YM07697
*    IF ENQQ4 = ON THEN                /*STILL ENQUEUED ON Q4        */
         L     @10,EXITPRMP                                     01S0055
         TM    ENQQ4(@10),B'10000000'                           01S0055
         BNO   @RF00055                                         01S0055
*      DO;                             /*DEQ FROM Q4                 */
*        DEQCORE(ONE:DEQLENG) = DEQLIST(ONE:DEQLENG); /*LIST TO DSECT*/
         L     @10,DEQLENG                                      01S0057
         BCTR  @10,0                                            01S0057
         EX    @10,@SM01582                                     01S0057
*        GEN REFS(DEQCORE,SYSQNAME,SYSRNAME);                   01S0058
        DEQ (SYSQNAME,SYSRNAME,2,SYSTEM),RET=HAVE,MF=(E,DEQCORE)
*      END;                                                     01S0059
*    IF DDRQ = ON THEN                 /*ENQUEUED ON DDR QUEUES      */
@RF00055 L     @10,EXITPRMP                                     01S0060
         TM    DDRQ(@10),B'01000000'                            01S0060
         BNO   @RF00060                                         01S0060
*      DO;                                                      01S0061
*        DEQCORE(ONE:DEQLENG) = DEQLIST(ONE:DEQLENG);           01S0062
         L     @10,DEQLENG                                      01S0062
         BCTR  @10,0                                            01S0062
         EX    @10,@SM01582                                     01S0062
*        GEN REFS(DEQCORE,SYSQNAME,DDRDA,DDRTPUR);              01S0063
        DEQ (SYSQNAME,DDRDA,5,SYSTEM),RET=HAVE,MF=(E,DEQCORE)
        DEQ (SYSQNAME,DDRTPUR,7,SYSTEM),RET=HAVE,MF=(E,DEQCORE)
*      END;                                                     01S0064
*    IF CHNGQ = ON THEN                /*ENQUEUED ON CHANGE QUEUE    */
@RF00060 L     @10,EXITPRMP                                     01S0065
         TM    CHNGQ(@10),B'00100000'                           01S0065
         BNO   @RF00065                                         01S0065
*      DO;                                                      01S0066
*        DEQCORE(ONE:DEQLENG) = DEQLIST(ONE:DEQLENG); /*LIST TO DSECT*/
         L     @10,DEQLENG                                      01S0067
         BCTR  @10,0                                            01S0067
         EX    @10,@SM01582                                     01S0067
*        GEN REFS(DEQCORE,SYSQNAME,CHNGDEVS);                   01S0068
        DEQ (SYSQNAME,CHNGDEVS,8,SYSTEM),RET=HAVE,MF=(E,DEQCORE)
*      END;                                                     01S0069
*    IF TPQ = ON THEN                  /*ENQUEUED ON TP QUEUE        */
@RF00065 L     @10,EXITPRMP                                     01S0070
         TM    TPQ(@10),B'00000100'                             01S0070
         BNO   @RF00070                                         01S0070
*      DO;                                                      01S0071
*        DEQCORE(ONE:DEQLENG) = DEQLIST(ONE:DEQLENG); /*LIST TO DSECT*/
         L     @10,DEQLENG                                      01S0072
         BCTR  @10,0                                            01S0072
         EX    @10,@SM01582                                     01S0072
*        GEN REFS(DEQCORE,SYSQNAME,TPNAME);                     01S0073
        DEQ (SYSQNAME,TPNAME,7,SYSTEM),RET=HAVE,MF=(E,DEQCORE)
*      END;                                                     01S0074
*    IF DSSTAP = ON THEN               /*DSS TAPE COUNT TO BE DECR.  */
@RF00070 L     @10,EXITPRMP                                     01S0075
         TM    DSSTAP(@10),B'00010000'                          01S0075
         BNO   @RF00075                                         01S0075
*      DO;                                                      01S0076
*        SAVECNT = CSDTCNT;            /*SAVE DSS TAPE COUNT         */
         L     @10,CVTPTR                                       01S0077
         L     @10,CVTCSD(,@10)                                 01S0077
         L     SAVECNT,CSDTCNT(,@10)                            01S0077
*        TAPLOOP: MINUSCNT = SAVECNT - ONE; /*DECREMENT COUNT        */
TAPLOOP  LR    MINUSCNT,SAVECNT                                 01S0078
         BCTR  MINUSCNT,0                                       01S0078
*        CS(SAVECNT,MINUSCNT,CSDTCNT);                          01S0079
         L     @10,CVTPTR                                       01S0079
         L     @10,CVTCSD(,@10)                                 01S0079
         CS    SAVECNT,@03,CSDTCNT(@10)                         01S0079
*        BC(1,TAPLOOP);                                         01S0080
         BC    1,TAPLOOP                                        01S0080
*      END;                                                     01S0081
*    IF DSSUNREC = ON THEN             /*DSS UNIT RECORD COUNT DECR. */
@RF00075 L     @10,EXITPRMP                                     01S0082
         TM    DSSUNREC(@10),B'00001000'                        01S0082
         BNO   @RF00082                                         01S0082
*      DO;                                                      01S0083
*        SAVECNT = CSDUCNT;            /*SAVE DSS UNIT RECORD COUNT  */
         L     @10,CVTPTR                                       01S0084
         L     @10,CVTCSD(,@10)                                 01S0084
         L     SAVECNT,CSDUCNT(,@10)                            01S0084
*        UNRCLOOP: MINUSCNT = SAVECNT - ONE; /*DECREMENT COUNT       */
UNRCLOOP LR    MINUSCNT,SAVECNT                                 01S0085
         BCTR  MINUSCNT,0                                       01S0085
*        CS(SAVECNT,MINUSCNT,CSDUCNT);                          01S0086
         L     @10,CVTPTR                                       01S0086
         L     @10,CVTCSD(,@10)                                 01S0086
         CS    SAVECNT,@03,CSDUCNT(@10)                         01S0086
*        BC(1,UNRCLOOP);                                        01S0087
         BC    1,UNRCLOOP                                       01S0087
*      END;                                                     01S0088
*    IF MLWTO = ON THEN                /*MULTI LINE WTO BEGUN@ZA16402*/
@RF00082 L     @10,EXITPRMP                                     01S0089
         TM    MLWTO(@10),B'00000010'                           01S0089
         BNO   @RF00089                                         01S0089
*      DO;                             /*YES, DOM MLWTO      @ZA16402*/
*        REG0 = PRMWTOID;              /*GET DOM ID OF MLWTO @ZA16402*/
*                                                               01S0091
         L     @10,PRMWTOID(,@10)                               01S0091
         LR    REG0,@10                                         01S0091
*         DO; /* DOM MSG(PRMWTOID) REPLY(YES)*/                 01S0092
*           RFY (GPR00F,GPR01F) RSTD; /*RESTRICT REGISTERS*/    01S0093
*           GPR01F = PRMWTOID; /* MOVE IN MESSAGE ID */         01S0094
         LR    GPR01F,@10                                       01S0094
*           GPR00F = 4; /* SHOW MSG REPLY SPECIFIED*/           01S0095
         LA    GPR00F,4                                         01S0095
*           SVC (87); /* ISSUE DOM SVC */                       01S0096
         SVC   87                                               01S0096
*           RFY (GPR00F,GPR01F) UNRSTD; /* RELEASE REGISTERS */ 01S0097
*         END; /* DOM MSG(PRMWTOID) REPLY(YES)*/                01S0098
*      END;                            /*END MLWTO DOM       @ZA16402*/
*    IF GENCLNUP = ON THEN             /*CLEANUP QUEUE MANAGER       */
@RF00089 L     @10,EXITPRMP                                     01S0100
         TM    GENCLNUP(@10),B'10000000'                        01S0100
         BNO   @RF00100                                         01S0100
*      DO;                                                      01S0101
*        RFY AQMPARAM BASED(PRMQMGP);                           01S0102
*        AQMECODE = TERMCODE;          /*INDICATE CLEANUP FUNCTION   */
         L     @01,PRMQMGP(,@10)                                01S0103
         MVC   AQMECODE(2,@01),@CH00049                         01S0103
*        REG13 = REG13SVE;             /*RESTORE SAVE AREA PTR       */
         LR    REG13,REG13SVE                                   01S0104
*         DO; /*MODESET  EXTKEY(SCHED)*/                        01S0105
*           SPKA (16); /*SET PSW KEY*/                          01S0106
         LA    @01,16                                           01S0106
         SPKA  0(@01)                                           01S0106
*         END; /*MODESET  EXTKEY(SCHED)*/       /*SCHED KEY FOR CALL  @
*M32370*/                                                       01S0107
*        CALL IEFAB4FA(PRMQMGP,EXITPRMP); /*CLEAN UP QUEUE MANAGER   */
         LA    @10,PRMQMGP(,@10)                                01S0108
         ST    @10,@AL00001                                     01S0108
         LA    @10,EXITPRMP                                     01S0108
         ST    @10,@AL00001+4                                   01S0108
         L     @15,@CV00057                                     01S0108
         LA    @01,@AL00001                                     01S0108
         BALR  @14,@15                                          01S0108
*         DO; /*MODESET  KEYADDR(ZERO)*/                        01S0109
*           SPKA (ZERO); /*SET PSW KEY*/                        01S0110
         SLR   @10,@10                                          01S0110
         SPKA  0(@10)                                           01S0110
*         END; /*MODESET  KEYADDR(ZERO)*/       /*BACK TO KEY ZERO    @
*M32370*/                                                       01S0111
*      END;                                                     01S0112
*    IF FREECORE = ON THEN             /*FREE Q-MGR CORE NEEDED      */
@RF00100 L     @10,EXITPRMP                                     01S0113
         TM    FREECORE(@10),B'00000100'                        01S0113
         BNO   @RF00113                                         01S0113
*      DO;                                                      01S0114
*        RFY (REG0,REG1) RSTD;                                  01S0115
*        QMBL = PRMQMBLN;              /*LENGTH OF CORE TO FREE      */
         MVC   QMBL(3),PRMQMBLN+1(@10)                          01S0116
*        QMBSP = SP241;                /*SUBPOOL OF CORE             */
         MVC   QMBSP(1),SP241                                   01S0117
*        REG0 = QMBFREE;               /*SUBPOOL AND LENGTH TO REG 0 */
         L     REG0,QMBFREE                                     01S0118
*        REG1 = PRMQMBP;               /*PTR TO CORE TO FREE         */
         L     REG1,PRMQMBP(,@10)                               01S0119
*        GEN (  FREEMAIN R,LV=(0),A=(1)  );                     01S0120
           FREEMAIN R,LV=(0),A=(1)
*        RFY (REG0,REG1) UNRSTD;                                01S0121
*      END;                                                     01S0122
*    IF UPDSABCK = ON THEN             /*TIOT ENTRY NOT COMPLETED    */
@RF00113 L     @10,EXITPRMP                                     01S0123
         TM    UPDSABCK(@10),B'01000000'                        01S0123
         BNO   @RF00123                                         01S0123
*      PRMSIOTP->SIOTETIO = ZERO;      /*ZERO DSAB PTR IN SIOT       */
         L     @10,PRMSIOTP(,@10)                               01S0124
         SLR   @15,@15                                          01S0124
         ST    @15,SIOTETIO(,@10)                               01S0124
*    IF UPDSABCK = ON ×                /*TIOT ENTRY NOT COMPLETED    */
*       DSABCHN = ON THEN              /*DSAB NOT COMPLETELY CHAINED */
@RF00123 L     @10,EXITPRMP                                     01S0125
         TM    UPDSABCK(@10),B'01100000'                        01S0125
         BZ    @RF00125                                         01S0125
*      DO;                             /*REMOVE DSAB FROM CHAIN      */
*        QDBPTR = PRMQDBP;             /*SET PTR TO DSAB QDB         */
         L     QDBPTR,PRMQDBP(,@10)                             01S0127
*        DSQNELMS = PRMNELM;           /*RESET NO. OF QUEUE ELEMENTS */
         MVC   DSQNELMS(4,QDBPTR),PRMNELM(@10)                  01S0128
*        IF PRMDSQL ^= ZERO THEN       /*OTHER DSABS ON QUEUE        */
         SLR   @03,@03                                          01S0129
         L     @10,PRMDSQL(,@10)                                01S0129
         CR    @10,@03                                          01S0129
         BE    @RF00129                                         01S0129
*          DO;                                                  01S0130
*            DSABPTR = PRMDSQL;        /*SET PTR TO LAST DSAB        */
         LR    DSABPTR,@10                                      01S0131
*            DSABFCHN = ZERO;          /*ZERO FORWARD PTR IN LST DSAB*/
         SLR   @10,@10                                          01S0132
         ST    @10,DSABFCHN(,DSABPTR)                           01S0132
*          END;                                                 01S0133
*        DSQFRSTP = PRMDSQF;           /*RESTORE PTR TO 1SR DSAB     */
@RF00129 L     @10,EXITPRMP                                     01S0134
         MVC   DSQFRSTP(4,QDBPTR),PRMDSQF(@10)                  01S0134
*        DSQLASTP = PRMDSQL;           /*RESTORE PTR TO LAST DSAB    */
         MVC   DSQLASTP(4,QDBPTR),PRMDSQL(@10)                  01S0135
*      END;                                                     01S0136
*    IF TIOTBLT = ON THEN              /*TIOT BLT BUT UCB NOT UPDATED*/
@RF00125 L     @10,EXITPRMP                                     01S0137
         TM    TIOTBLT(@10),B'00010000'                         01S0137
         BNO   @RF00137                                         01S0137
*      DO;                             /*ZERO UCB ADDR IN TIOT ENTRY */
*        SIOTPTR = PRMSIOTP;           /*PTR TO SIOT BEING ALLOCATED */
         L     SIOTPTR,PRMSIOTP(,@10)                           01S0139
*        DSABPTR = SIOTETIO;           /*PTR TO ETIOT ENTRY          */
         L     DSABPTR,SIOTETIO(,SIOTPTR)                       01S0140
*        DO INDEX = ONE TO TIOEWTCT;   /*SEARCH DEVICE ENTRIES       */
         LA    INDEX,1                                          01S0141
         B     @DE00141                                         01S0141
@DL00141 DS    0H                                               01S0142
*          IF TIOUCBP(INDEX) = PRMUCBP THEN /*FIND UCB ADDR          */
         LR    @10,INDEX                                        01S0142
         SLA   @10,2                                            01S0142
         L     @15,DSABTIOT(,DSABPTR)                           01S0142
         L     @14,TIOUCBP-5(@10,@15)                           01S0142
         LA    @14,0(,@14)                                      01S0142
         L     @01,EXITPRMP                                     01S0142
         C     @14,PRMUCBP(,@01)                                01S0142
         BNE   @RF00142                                         01S0142
*            TIOUCBP(INDEX) = ZERO;    /*ZERO UCB ADDR               */
         ALR   @15,@10                                          01S0143
         SLR   @10,@10                                          01S0143
         STCM  @10,7,TIOUCBP-4(@15)                             01S0143
*        END;                                                   01S0144
@RF00142 AH    INDEX,@CH00051                                   01S0144
@DE00141 L     @10,DSABTIOT(,DSABPTR)                           01S0144
         SLR   @15,@15                                          01S0144
         IC    @15,TIOEWTCT(,@10)                               01S0144
         CR    INDEX,@15                                        01S0144
         BNH   @DL00141                                         01S0144
*      END;                                                     01S0145
*    IF VMVCALL = ON THEN              /*VM&V CLEANUP NEEDED         */
@RF00137 L     @10,EXITPRMP                                     01S0146
         TM    VMVCALL(@10),B'00000010'                         01S0146
         BNO   @RF00146                                         01S0146
*      DO;                                                      01S0147
*        VMVFUNCS = CLRFLAG;           /*CLEAR 498 FUNCTION FLAGS    */
         SLR   @15,@15                                          01S0148
         STH   @15,VMVFUNCS                                     01S0148
*        FINDMVCA = ON;                /*INDICATE TO FIND MVCA       */
         OI    FINDMVCA,B'00100000'                             01S0149
*        MVCAPTR = ZERO;               /*ZERO RETURN AREA            */
         ST    @15,MVCAPTR                                      01S0150
*        VMVASID = PRMASID;            /*SUPPLY ASID                 */
         MVC   VMVASID(2),PRMASID(@10)                          01S0151
*        VMVPARMP = ADDR(VMVPARMS);    /*PTR TO PARM LIST            */
         LA    @10,VMVPARMS                                     01S0152
         ST    @10,VMVPARMP                                     01S0152
*        REG13 = REG13SVE;             /*RESTORE SAVE AREA PTR       */
         LR    REG13,REG13SVE                                   01S0153
*         DO; /*MODESET  EXTKEY(SCHED)*/                        01S0154
*           SPKA (16); /*SET PSW KEY*/                          01S0155
         LA    @10,16                                           01S0155
         SPKA  0(@10)                                           01S0155
*         END; /*MODESET  EXTKEY(SCHED)*/       /*SCHED KEY FOR CALL  @
*M32370*/                                                       01S0156
*        CALL IEFAB498(VMVPARMP,0);    /*LOCATE MVCA                 */
         LA    @10,VMVPARMP                                     01S0157
         ST    @10,@AL00001                                     01S0157
         LA    @10,@CF00095                                     01S0157
         ST    @10,@AL00001+4                                   01S0157
         L     @15,@CV00059                                     01S0157
         LA    @01,@AL00001                                     01S0157
         BALR  @14,@15                                          01S0157
*         DO; /*MODESET  KEYADDR(ZERO)*/                        01S0158
*           SPKA (ZERO); /*SET PSW KEY*/                        01S0159
         SLR   @10,@10                                          01S0159
         SPKA  0(@10)                                           01S0159
*         END; /*MODESET  KEYADDR(ZERO)*/       /*BACK TO KEY ZERO    @
*M32370*/                                                       01S0160
*        IF MVCAPTR ^= ZERO THEN       /*MVCAPTR FOUND               */
         L     @15,MVCAPTR                                      01S0161
         CR    @15,@10                                          01S0161
         BE    @RF00161                                         01S0161
*          DO;                                                  01S0162
*            CLNUPFLG = ZERO;          /*CLEAR 49A FLAGS             */
         ST    @10,CLNUPFLG                                     01S0163
*            FREEMVCA = ON;            /*INDICATE TO FREE MVCA CORE  */
         OI    FREEMVCA,B'00100000'                             01S0164
*            MVCAP = MVCAPTR;          /*SUPPLY PTR TO MVCA          */
         ST    @15,MVCAP                                        01S0165
*            TAPDOM = ZERO;            /*ZERO TAPE DOM ID            */
         ST    @10,TAPDOM                                       01S0166
*            DADOM = ZERO;             /*ZERO DA POOL DOM ID         */
         ST    @10,DADOM                                        01S0167
*            REG13 = REG13SVE;         /*RESTORE SAVE AREA PTR       */
         LR    REG13,REG13SVE                                   01S0168
*             DO; /*MODESET  EXTKEY(SCHED)*/                    01S0169
*               SPKA (16); /*SET PSW KEY*/                      01S0170
         LA    @10,16                                           01S0170
         SPKA  0(@10)                                           01S0170
*             END; /*MODESET  EXTKEY(SCHED)*/   /*SCHED KEY FOR CALL  @
*M32370*/                                                       01S0171
*            CALL IEFAB49A(CLNUPPRM);  /*FREE MVCA CORE              */
         LA    @10,CLNUPPRM                                     01S0172
         ST    @10,@AL00001                                     01S0172
         L     @15,@CV00058                                     01S0172
         LA    @01,@AL00001                                     01S0172
         BALR  @14,@15                                          01S0172
*             DO; /*MODESET  KEYADDR(ZERO)*/                    01S0173
*               SPKA (ZERO); /*SET PSW KEY*/                    01S0174
         SLR   @10,@10                                          01S0174
         SPKA  0(@10)                                           01S0174
*             END; /*MODESET  KEYADDR(ZERO)*/   /*BACK TO KEY ZERO    @
*M32370*/                                                       01S0175
*          END;                                                 01S0176
*      END;                                                     01S0177
@RF00161 DS    0H                                               01S0178
*  END;                                                         01S0178
*                                                               01S0178
*                                                               01S0178
@RF00146 DS    0H                                               01S0179
* DECLARE /*GENERAL PURPOSE REGISTERS */                        01S0179
*   GPR00F FIXED(31) REG(0),                                    01S0179
*   GPR01F FIXED(31) REG(1);                                    01S0179
*                                                               01S0179
@RF00051 DS    0H                                               01S0180
* DECLARE /* COMMON VARIABLES */                                01S0180
*   I256C CHAR(256) BASED,                                      01S0180
*   I031F FIXED(31) BASED,                                      01S0180
*   I031P PTR(31)   BASED,                                      01S0180
*   I015F FIXED(15) BASED,                                      01S0180
*   I015P PTR(15)   BASED,                                      01S0180
*   I008P PTR(8)    BASED,                                      01S0180
*   I001C CHAR(1)   BASED;                                      01S0180
*RFY (REG1) RSTD;                                               01S0181
*REG1 = SDWAPTR;                       /*RESTORE PTR OF SDWA IN R1   */
         LR    REG1,SDWAPTR                                     01S0182
*REG13 = REG13INP;                     /*RESTORE REG13       @Z40FPPG*/
         LR    REG13,REG13INP                                   01S0183
*REG14 = REG14SVE;                     /*RESTORE REGISTER 14         */
         LR    REG14,REG14SVE                                   01S0184
*GEN;                                                           01S0185
         SR 15,15
         BR 14
*END IEFAB4E8                                                   01S0186
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.      *
*/*%INCLUDE SYSLIB  (A4E8SPEC)                                        *
*/*%INCLUDE SYSLIB  (A4E8DATA)                                        *
*/*%INCLUDE SYSLIB  (CVT     )                                        *
*/*%INCLUDE SYSLIB  (IHACSD  )                                        *
*/*%INCLUDE SYSLIB  (IEFASIOT)                                        *
*/*%INCLUDE SYSLIB  (IEFZB427)                                        *
*/*%INCLUDE SYSLIB  (IEFZB447)                                        *
*/*%INCLUDE SYSLIB  (IHADSAB )                                        *
*/*%INCLUDE SYSLIB  (IHASDWA )                                        *
*/*%INCLUDE SYSLIB  (IEFTIOT1)                                        *
*;                                                              01S0186
@DATA    DS    0H
@CH00051 DC    H'1'
@CH00049 DC    H'2'
@CH00033 DC    H'12'
@SM01580 MVC   DEQLISTA(0),DEQFMT
@SM01582 MVC   DEQCORE(0),DEQLIST
@DATD    DSECT
         DS    0F
@SA00001 DS    18F
@AL00001 DS    2A
IEFAB4E8 CSECT
         DS    0F
@CF00095 DC    F'0'
@DATD    DSECT
         DS    0D
EXITPRMP DS    A
VMVPARMP DS    A
TIOTPTR  DS    A
CLNUPPRM DS    CL16
         ORG   CLNUPPRM
CLNUPFLG DS    CL4
         ORG   CLNUPFLG
@NM00001 DS    BL1
FREEMVCA EQU   CLNUPFLG+0
@NM00002 EQU   CLNUPFLG+0
         ORG   CLNUPPRM+4
MVCAP    DS    AL4
TAPDOM   DS    FL4
DADOM    DS    FL4
         ORG   CLNUPPRM+16
QMBFREE  DS    CL4
         ORG   QMBFREE
QMBSP    DS    BL1
QMBL     DS    AL3
         ORG   QMBFREE+4
VMVPARMS DS    CL8
         ORG   VMVPARMS
VMVFUNCS DS    CL2
         ORG   VMVFUNCS
@NM00004 DS    BL1
FINDMVCA EQU   VMVFUNCS+0
@NM00005 EQU   VMVFUNCS+0
         ORG   VMVPARMS+2
VMVASID  DS    FL2
MVCAPTR  DS    AL4
         ORG   VMVPARMS+8
IEFAB4E8 CSECT
         NOPR  ((@ENDDATD-@DATD)/253*16)
         DS    0F
@SIZDATD DC    AL1(0)
         DC    AL3(@ENDDATD-@DATD)
@CV00057 DC    V(IEFAB4FA)
@CV00058 DC    V(IEFAB49A)
@CV00059 DC    V(IEFAB498)
         DS    0D
CHNGDEVS DC    CL8'CHNGDEVS'
DDRDA    DC    CL5'DDRDA'
DDRTPUR  DC    CL7'DDRTPUR'
RESNAME  DC    CL8'SYSZVMV'
SP241    DC    X'F1'
SYSQNAME DC    CL8'SYSIEFSD'
SYSRNAME DC    CL8'Q4'
TPNAME   DC    CL7'ALLOCTP'
IEFAB4E8 CSECT
         DS   0H
A4E8PTCH DC (52)X'00'
IEFAB4E8 CSECT
DEQFMT   DEQ (RESNAME,,,SYSTEM),MF=L,RET=HAVE,GENERIC=YES   @YM07697
DEQENTLN DC A(*-DEQFMT)                                     @YM07697
@DATD    DSECT
DEQLISTA DEQ (RESNAME,,,SYSTEM),MF=L,RET=HAVE,GENERIC=YES   @YM07697
IEFAB4E8 CSECT
DEQLIST DEQ (,,,SYSTEM),MF=L
DEQLENG DC A(*-DEQLIST)
@DATD    DSECT
DEQCORE DEQ (,,,SYSTEM),MF=L
@DATD    DSECT
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA
@ENDDATD EQU   *
IEFAB4E8 CSECT
@00      EQU   00                      EQUATES FOR REGISTERS 0-15
@01      EQU   01
@02      EQU   02
@03      EQU   03
@04      EQU   04
@05      EQU   05
@06      EQU   06
@07      EQU   07
@08      EQU   08
@09      EQU   09
@10      EQU   10
@11      EQU   11
@12      EQU   12
@13      EQU   13
@14      EQU   14
@15      EQU   15
SAVECNT  EQU   @02
REG14SVE EQU   @09
REG13INP EQU   @08
REG13SVE EQU   @07
MINUSCNT EQU   @03
INDEX    EQU   @02
SIOTPTR  EQU   @02
SDWAPTR  EQU   @06
QDBPTR   EQU   @02
DSABPTR  EQU   @03
REG0     EQU   @00
REG1     EQU   @01
REG11    EQU   @11
REG12    EQU   @12
REG13    EQU   @13
REG14    EQU   @14
GPR00F   EQU   @00
GPR01F   EQU   @01
REG2     EQU   @02
CVTPTR   EQU   16
IHAQDB   EQU   0
DSQNELMS EQU   IHAQDB+8
DSQFRSTP EQU   IHAQDB+12
DSQLASTP EQU   IHAQDB+16
CVTMAP   EQU   0
CVTDAR   EQU   CVTMAP+72
CVTFLGS1 EQU   CVTDAR
CVTDCB   EQU   CVTMAP+116
CVTIOQET EQU   CVTMAP+120
CVTIERLC EQU   CVTMAP+144
CVTHEAD  EQU   CVTMAP+160
CVTSV76C EQU   CVTHEAD
CVTOPTA  EQU   CVTMAP+182
CVTOPTB  EQU   CVTMAP+183
CVTGTF   EQU   CVTMAP+236
CVTGTFST EQU   CVTGTF
CVTGTFS  EQU   CVTGTFST
CVTSTATE EQU   CVTGTFST
CVTTMODE EQU   CVTGTFST
CVTFORM  EQU   CVTGTFST
CVTAQAVT EQU   CVTMAP+240
CVTTCMFG EQU   CVTAQAVT
CVTVOLM2 EQU   CVTMAP+244
CVTTATA  EQU   CVTVOLM2
CVTTSKS  EQU   CVTTATA
CVTVOLF2 EQU   CVTTSKS
CVTTAT   EQU   CVTTATA+1
CVTATER  EQU   CVTMAP+248
CVTEXT1  EQU   CVTMAP+252
CVTPURG  EQU   CVTMAP+260
CVTQMSG  EQU   CVTMAP+268
CVTDMSR  EQU   CVTMAP+272
CVTRSV37 EQU   CVTDMSR
CVTDMSRF EQU   CVTRSV37
CVTERPV  EQU   CVTMAP+316
CVTINTLA EQU   CVTMAP+320
CVTAPF   EQU   CVTMAP+324
CVTEXT2  EQU   CVTMAP+328
CVTHJES  EQU   CVTMAP+332
CVTPGSIA EQU   CVTMAP+348
CVTA1F1  EQU   CVTMAP+356
CVTSYSK  EQU   CVTMAP+357
CVTVOLM1 EQU   CVTMAP+380
CVTVOLF1 EQU   CVTVOLM1
CVTATMCT EQU   CVTMAP+388
CVTXTNT1 EQU   0
CVTXTNT2 EQU   0
CVTDSSV  EQU   CVTXTNT2
CVTFLGBT EQU   CVTXTNT2+5
CVTQID   EQU   CVTXTNT2+24
CVTRV400 EQU   CVTXTNT2+52
CVTRV409 EQU   CVTXTNT2+53
CVTATCVT EQU   CVTXTNT2+64
CVTRV429 EQU   CVTXTNT2+84
CVTRV438 EQU   CVTXTNT2+85
CVTRV457 EQU   CVTXTNT2+112
CVTRV466 EQU   CVTXTNT2+113
CVTFIX   EQU   0
CVTRELNO EQU   CVTFIX+252
CSD      EQU   0
CSDCPUAL EQU   CSD+8
CSDSCWRD EQU   CSD+12
CSDSCFL1 EQU   CSDSCWRD
CSDSCFL2 EQU   CSDSCWRD+1
CSDSCFL3 EQU   CSDSCWRD+2
CSDSCFL4 EQU   CSDSCWRD+3
CSDFLAGS EQU   CSD+23
CSDTCNT  EQU   CSD+120
CSDUCNT  EQU   CSD+124
INDMSIOT EQU   0
SCTUSADD EQU   INDMSIOT+20
SIOTBYT1 EQU   INDMSIOT+43
SIOTBYT3 EQU   INDMSIOT+46
SIOTTSTC EQU   INDMSIOT+47
SIOTBYT0 EQU   INDMSIOT+52
SCTSDISP EQU   INDMSIOT+55
SCTSBYT1 EQU   INDMSIOT+56
SCTSBYT2 EQU   INDMSIOT+57
SCTSBYT3 EQU   INDMSIOT+58
SCTSBYT4 EQU   INDMSIOT+59
SCTUTYPE EQU   INDMSIOT+60
SIOTDEVT EQU   SCTUTYPE
SIOUBYT3 EQU   SIOTDEVT+2
SIOTBYT4 EQU   INDMSIOT+81
SIOTALTD EQU   INDMSIOT+92
SIOTBYT2 EQU   INDMSIOT+103
SIOTETIO EQU   INDMSIOT+148
AQMPARAM EQU   0
AQMECODE EQU   AQMPARAM
AQMNORMP EQU   AQMPARAM+20
PRMESTAE EQU   0
PRMRESC  EQU   PRMESTAE+252
ENQQ4    EQU   PRMRESC
DDRQ     EQU   PRMRESC
CHNGQ    EQU   PRMRESC
DSSTAP   EQU   PRMRESC
DSSUNREC EQU   PRMRESC
TPQ      EQU   PRMRESC
MLWTO    EQU   PRMRESC
PRMFUNC  EQU   PRMESTAE+253
GENCLNUP EQU   PRMFUNC
UPDSABCK EQU   PRMFUNC
DSABCHN  EQU   PRMFUNC
TIOTBLT  EQU   PRMFUNC
FREECORE EQU   PRMFUNC
VMVCALL  EQU   PRMFUNC
PRMASID  EQU   PRMESTAE+254
PRMSIOTP EQU   PRMESTAE+256
PRMUCBP  EQU   PRMESTAE+260
PRMQMGP  EQU   PRMESTAE+264
PRMQMBLN EQU   PRMESTAE+268
PRMQMBP  EQU   PRMESTAE+272
PRMQDBP  EQU   PRMESTAE+276
PRMDSQL  EQU   PRMESTAE+280
PRMDSQF  EQU   PRMESTAE+284
PRMNELM  EQU   PRMESTAE+288
PRMWTOID EQU   PRMESTAE+292
DSAB     EQU   0
DSABFCHN EQU   DSAB+4
DSABTIOT EQU   DSAB+16
DSABGIDP EQU   DSAB+24
DSABANMP EQU   DSAB+28
DSABORG  EQU   DSAB+32
DSABORG1 EQU   DSABORG
DSABORG2 EQU   DSABORG+1
DSABFLG1 EQU   DSAB+34
DSABFLG2 EQU   DSAB+35
DSABFLG3 EQU   DSAB+36
DSABFLG4 EQU   DSAB+37
DSABANMI EQU   0
DSABGIDL EQU   0
SDWA     EQU   0
SDWAFIOB EQU   SDWA+4
SDWAABCC EQU   SDWAFIOB
SDWACMPF EQU   SDWAABCC
SDWACTL1 EQU   SDWA+8
SDWACMKA EQU   SDWACTL1
SDWAMWPA EQU   SDWACTL1+1
SDWAPMKA EQU   SDWACTL1+4
SDWACTL2 EQU   SDWA+16
SDWACMKP EQU   SDWACTL2
SDWAMWPP EQU   SDWACTL2+1
SDWAPMKP EQU   SDWACTL2+4
SDWAGRSV EQU   SDWA+24
SDWANAME EQU   SDWA+88
SDWAEC1  EQU   SDWA+104
SDWAEMK1 EQU   SDWAEC1
SDWAMWP1 EQU   SDWAEC1+1
SDWAINT1 EQU   SDWAEC1+2
SDWANXT1 EQU   SDWAEC1+4
SDWAAEC1 EQU   SDWA+112
SDWAILC1 EQU   SDWAAEC1+1
SDWAINC1 EQU   SDWAAEC1+2
SDWAICD1 EQU   SDWAINC1+1
SDWAEC2  EQU   SDWA+120
SDWAEMK2 EQU   SDWAEC2
SDWAMWP2 EQU   SDWAEC2+1
SDWAINT2 EQU   SDWAEC2+2
SDWANXT2 EQU   SDWAEC2+4
SDWAAEC2 EQU   SDWA+128
SDWAILC2 EQU   SDWAAEC2+1
SDWAINC2 EQU   SDWAAEC2+2
SDWAICD2 EQU   SDWAINC2+1
SDWASRSV EQU   SDWA+136
SDWAIDNT EQU   SDWA+200
SDWAMCH  EQU   SDWA+204
SDWASTCK EQU   SDWAMCH
SDWAMCHI EQU   SDWAMCH+8
SDWAMCHS EQU   SDWAMCHI
SDWAMCHD EQU   SDWAMCHI+1
SDWARSR1 EQU   SDWAMCH+12
SDWARSR2 EQU   SDWAMCH+13
SDWAFLGS EQU   SDWA+232
SDWAERRA EQU   SDWAFLGS
SDWAERRB EQU   SDWAFLGS+1
SDWAERRC EQU   SDWAFLGS+2
SDWAERRD EQU   SDWAFLGS+3
SDWAIOFS EQU   SDWA+238
SDWACPUA EQU   SDWA+248
SDWAPARQ EQU   SDWA+252
SDWAACF2 EQU   SDWAPARQ+1
SDWAACF3 EQU   SDWAPARQ+2
SDWAACF4 EQU   SDWAPARQ+3
SDWALKWA EQU   SDWA+256
SDWALKWS EQU   SDWALKWA
SDWARECP EQU   SDWA+292
SDWASNPA EQU   SDWA+320
SDWADUMP EQU   SDWASNPA
SDWADPFS EQU   SDWADUMP+1
SDWADDAT EQU   SDWASNPA+4
SDWASDAT EQU   SDWADDAT
SDWAPDAT EQU   SDWADDAT+2
SDWADPSA EQU   SDWA+328
SDWADPSL EQU   SDWADPSA
SDWARA   EQU   SDWA+400
SDWADPVA EQU   SDWARA+2
TIOT1    EQU   0
TIOENTRY EQU   0
TIOESTTA EQU   TIOENTRY+1
TIOERLOC EQU   TIOENTRY+2
TIOEWTCT EQU   TIOERLOC
TIOELINK EQU   TIOERLOC+1
TIOESYOT EQU   TIOELINK
TIOESTTC EQU   TIOENTRY+15
TIOESTTB EQU   TIOENTRY+16
POOLSTAR EQU   TIOENTRY+20
I001C    EQU   0
I008P    EQU   0
I015F    EQU   0
I015P    EQU   0
I031F    EQU   0
I031P    EQU   0
I256C    EQU   0
CVTS01   EQU   CVTPGSIA
CVTLPDIA EQU   CVTS01+12
CVTDIRST EQU   CVTLPDIA
CVTSLIDA EQU   CVTS01+24
CVTCTLFG EQU   CVTS01+50
CVTCSD   EQU   CVTS01+312
CVTRV210 EQU   CVTS01+424
CVTRV219 EQU   CVTS01+425
CVTRV228 EQU   CVTS01+426
CVTRV237 EQU   CVTS01+427
CVTMFRTR EQU   CVTS01+452
CVTRV262 EQU   CVTS01+468
CVTRV271 EQU   CVTS01+469
CVTRV280 EQU   CVTS01+470
CVTRV289 EQU   CVTS01+471
CVTGSDA  EQU   CVTS01+600
TIOEDEVE EQU   TIOESTTB
TIOSTTB  EQU   TIOEDEVE
TIOUCBP  EQU   TIOEDEVE+1
*                                      START UNREFERENCED COMPONENTS
TIOVERF  EQU   TIOSTTB
TIOUNLD  EQU   TIOSTTB
TIOMNTD  EQU   TIOSTTB
TIOSETU  EQU   TIOSTTB
TIOVLSR  EQU   TIOSTTB
TIOPVIO  EQU   TIOSTTB
TIOREQD  EQU   TIOSTTB
TIOUSED  EQU   TIOSTTB
CVTRV628 EQU   CVTS01+728
CVTRV627 EQU   CVTS01+724
CVTRV626 EQU   CVTS01+720
CVTRV625 EQU   CVTS01+716
CVTRV624 EQU   CVTS01+712
CVTRV623 EQU   CVTS01+708
CVTRV622 EQU   CVTS01+704
CVTRV621 EQU   CVTS01+700
CVTIHASU EQU   CVTS01+696
CVTRV619 EQU   CVTS01+692
CVTRV618 EQU   CVTS01+688
CVTRV617 EQU   CVTS01+684
CVTRV616 EQU   CVTS01+680
CVTRV615 EQU   CVTS01+676
CVTRV614 EQU   CVTS01+672
CVTRV613 EQU   CVTS01+668
CVTTCASP EQU   CVTS01+664
CVT0PT03 EQU   CVTS01+660
CVT0PT0E EQU   CVTS01+656
CVTRV609 EQU   CVTS01+652
CVTCGK   EQU   CVTS01+648
CVTRAC   EQU   CVTS01+644
CVTHSM   EQU   CVTS01+640
CVTRV605 EQU   CVTS01+636
CVTRV604 EQU   CVTS01+632
CVTEFF02 EQU   CVTS01+628
CVTCBBR  EQU   CVTS01+624
CVTSSCR  EQU   CVTS01+620
CVTEVENT EQU   CVTS01+616
CVTCRCA  EQU   CVTS01+612
CVTTPIO  EQU   CVTS01+608
CVTADV   EQU   CVTS01+604
CVTGSDAB EQU   CVTGSDA
CVTQV3   EQU   CVTS01+596
CVTQV2   EQU   CVTS01+592
CVTQV1   EQU   CVTS01+588
CVTRPT   EQU   CVTS01+584
CVTSSRB  EQU   CVTS01+580
CVTCSDRL EQU   CVTS01+576
CVTEXP1  EQU   CVTS01+572
CVTRMPMT EQU   CVTS01+568
CVTRMPTT EQU   CVTS01+564
CVTVPSA  EQU   CVTS01+560
CVTVSTOP EQU   CVTS01+556
CVTGTFR8 EQU   CVTS01+552
CVTQUIT  EQU   CVTS01+548
CVTVACR  EQU   CVTS01+544
CVTWTCB  EQU   CVTS01+540
CVTSTPRS EQU   CVTS01+536
CVT0PT02 EQU   CVTS01+532
CVTDARCM EQU   CVTS01+528
CVTIRECM EQU   CVTS01+524
CVTJRECM EQU   CVTS01+520
CVTVEMS0 EQU   CVTS01+516
CVTSPFRR EQU   CVTS01+512
CVTRLSTG EQU   CVTS01+508
CVT0TC0A EQU   CVTS01+504
CVTGMBR  EQU   CVTS01+500
CVTLFRM  EQU   CVTS01+496
CVTRMBR  EQU   CVTS01+492
CVTVIOP  EQU   CVTS01+488
CVTRV307 EQU   CVTS01+486
CVTRV306 EQU   CVTS01+484
CVTRV305 EQU   CVTS01+482
CVTRV304 EQU   CVTS01+480
CVTRV303 EQU   CVTS01+478
CVTRV302 EQU   CVTS01+476
CVTTRCA  EQU   CVTS01+472
CVTRV297 EQU   CVTRV289
CVTRV296 EQU   CVTRV289
CVTRV295 EQU   CVTRV289
CVTRV294 EQU   CVTRV289
CVTRV293 EQU   CVTRV289
CVTRV292 EQU   CVTRV289
CVTRV291 EQU   CVTRV289
CVTRV290 EQU   CVTRV289
CVTRV288 EQU   CVTRV280
CVTRV287 EQU   CVTRV280
CVTRV286 EQU   CVTRV280
CVTRV285 EQU   CVTRV280
CVTRV284 EQU   CVTRV280
CVTRV283 EQU   CVTRV280
CVTRV282 EQU   CVTRV280
CVTRV281 EQU   CVTRV280
CVTRV279 EQU   CVTRV271
CVTRV278 EQU   CVTRV271
CVTRV277 EQU   CVTRV271
CVTRV276 EQU   CVTRV271
CVTRV275 EQU   CVTRV271
CVTRV274 EQU   CVTRV271
CVTRV273 EQU   CVTRV271
CVTRV272 EQU   CVTRV271
CVTRV270 EQU   CVTRV262
CVTRV269 EQU   CVTRV262
CVTRV268 EQU   CVTRV262
CVTRV267 EQU   CVTRV262
CVTRV266 EQU   CVTRV262
CVTRV265 EQU   CVTRV262
CVTRV264 EQU   CVTRV262
CVTRV263 EQU   CVTRV262
CVTVFP   EQU   CVTS01+464
CVTVSI   EQU   CVTS01+460
CVTVPSIB EQU   CVTS01+456
CVTMFACT EQU   CVTMFRTR
CVTMFCTL EQU   CVTS01+448
CVTPVBP  EQU   CVTS01+444
CVTPWI   EQU   CVTS01+440
CVTRV254 EQU   CVTS01+438
CVTRV253 EQU   CVTS01+436
CVTRV252 EQU   CVTS01+434
CVTRV251 EQU   CVTS01+433
CVTRV250 EQU   CVTS01+432
CVTRV249 EQU   CVTS01+431
CVTRV248 EQU   CVTS01+430
CVTRV247 EQU   CVTS01+429
CVTRV246 EQU   CVTS01+428
CVTRV245 EQU   CVTRV237
CVTRV244 EQU   CVTRV237
CVTRV243 EQU   CVTRV237
CVTRV242 EQU   CVTRV237
CVTRV241 EQU   CVTRV237
CVTRV240 EQU   CVTRV237
CVTRV239 EQU   CVTRV237
CVTRV238 EQU   CVTRV237
CVTRV236 EQU   CVTRV228
CVTRV235 EQU   CVTRV228
CVTRV234 EQU   CVTRV228
CVTRV233 EQU   CVTRV228
CVTRV232 EQU   CVTRV228
CVTRV231 EQU   CVTRV228
CVTRV230 EQU   CVTRV228
CVTRV229 EQU   CVTRV228
CVTRV227 EQU   CVTRV219
CVTRV226 EQU   CVTRV219
CVTRV225 EQU   CVTRV219
CVTRV224 EQU   CVTRV219
CVTRV223 EQU   CVTRV219
CVTRV222 EQU   CVTRV219
CVTRV221 EQU   CVTRV219
CVTRV220 EQU   CVTRV219
CVTRV218 EQU   CVTRV210
CVTRV217 EQU   CVTRV210
CVTRV216 EQU   CVTRV210
CVTRV215 EQU   CVTRV210
CVTRV214 EQU   CVTRV210
CVTRV213 EQU   CVTRV210
CVTRV212 EQU   CVTRV210
CVTRV211 EQU   CVTRV210
CVTLCCAT EQU   CVTS01+420
CVTPCCAT EQU   CVTS01+416
CVTIPCRP EQU   CVTS01+412
CVTIPCRI EQU   CVTS01+408
CVTIPCDS EQU   CVTS01+404
CVTAIDVT EQU   CVTS01+400
CVTSSAP  EQU   CVTS01+396
CVTEHCIR EQU   CVTS01+392
CVTEHDEF EQU   CVTS01+388
CVTDAIR  EQU   CVTS01+384
CVTPERFM EQU   CVTS01+380
CVT044R2 EQU   CVTS01+376
CVTFETCH EQU   CVTS01+372
CVTRSTWD EQU   CVTS01+368
CVTSPOST EQU   CVTS01+364
CVTIOBP  EQU   CVTS01+360
CVTASMVT EQU   CVTS01+356
CVTRECRQ EQU   CVTS01+352
CVTWSAC  EQU   CVTS01+348
CVTRV149 EQU   CVTS01+344
CVTWSAL  EQU   CVTS01+340
CVTSPSA  EQU   CVTS01+336
CVTGLMN  EQU   CVTS01+332
CVTVEAC0 EQU   CVTS01+328
CVT062R1 EQU   CVTS01+324
CVTRPOST EQU   CVTS01+320
CVTDQIQE EQU   CVTS01+316
CVTLKRMA EQU   CVTS01+308
CVTRSPIE EQU   CVTS01+304
CVTRENQ  EQU   CVTS01+300
CVTLQCB  EQU   CVTS01+296
CVTFQCB  EQU   CVTS01+292
CVTQCS01 EQU   CVTS01+288
CVTAPFT  EQU   CVTS01+284
CVTPARRL EQU   CVTS01+280
CVTVWAIT EQU   CVTS01+276
CVTGSPL  EQU   CVTS01+272
CVTLSMQ  EQU   CVTS01+268
CVTGSMQ  EQU   CVTS01+264
CVTEXPRO EQU   CVTS01+260
CVTOPCTP EQU   CVTS01+256
CVTSIC   EQU   CVTS01+252
CVTTPIOS EQU   CVTS01+248
CVTRTMS  EQU   CVTS01+244
CVTSDBF  EQU   CVTS01+240
CVTSCBP  EQU   CVTS01+236
CVTSDMP  EQU   CVTS01+232
CVTSV60  EQU   CVTS01+228
CVTRTMCT EQU   CVTS01+224
CVTASCBL EQU   CVTS01+220
CVTASCBH EQU   CVTS01+216
CVTGDA   EQU   CVTS01+212
CVTASVT  EQU   CVTS01+208
CVTVVMDI EQU   CVTS01+204
CVTAQTOP EQU   CVTS01+200
CVTIOSCS EQU   CVTS01+196
CVTSDRM  EQU   CVTS01+192
CVTOPTE  EQU   CVTS01+188
CVTSTXU  EQU   CVTS01+184
CVTQUIS  EQU   CVTS01+180
CVTPARS  EQU   CVTS01+176
CVTS1EE  EQU   CVTS01+172
CVTFRAS  EQU   CVTS01+168
CVTQSAS  EQU   CVTS01+164
CVTCRAS  EQU   CVTS01+160
CVTCRMN  EQU   CVTS01+156
CVTDELCP EQU   CVTS01+152
CVTFRECL EQU   CVTS01+148
CVTGETCL EQU   CVTS01+144
CVTBLDCP EQU   CVTS01+140
CVTAUTHL EQU   CVTS01+136
CVTSCAN  EQU   CVTS01+132
CVTRV144 EQU   CVTS01+130
CVTMAXMP EQU   CVTS01+128
CVTSTCK  EQU   CVTS01+124
CVTRV139 EQU   CVTS01+123
CVTDSSAC EQU   CVTS01+122
CVTRV513 EQU   CVTS01+121
CVTIOSPL EQU   CVTS01+120
CVTPTGT  EQU   CVTS01+116
CVTCSPIE EQU   CVTS01+112
CVTSMFEX EQU   CVTS01+108
CVTOLT0A EQU   CVTS01+104
CVTSRBRT EQU   CVTS01+100
CVTPUTL  EQU   CVTS01+96
CVTASCRL EQU   CVTS01+92
CVTASCRF EQU   CVTS01+88
CVTRV326 EQU   CVTS01+84
CVTRV325 EQU   CVTS01+80
CVTRV324 EQU   CVTS01+76
CVT0VL01 EQU   CVTS01+72
CVTSHRVM EQU   CVTS01+68
CVTRV332 EQU   CVTS01+64
CVTTAS   EQU   CVTS01+60
CVTRSCN  EQU   CVTS01+56
CVTTRAC2 EQU   CVTS01+54
CVTTRACE EQU   CVTS01+52
CVTAPG   EQU   CVTS01+51
CVTSDTRC EQU   CVTCTLFG
CVTGTRCE EQU   CVTCTLFG
CVTNOMP  EQU   CVTCTLFG
CVTRSV79 EQU   CVTCTLFG
CVTDSTAT EQU   CVTCTLFG
CVTRSV78 EQU   CVTCTLFG
CVTRV333 EQU   CVTCTLFG
CVTRV323 EQU   CVTCTLFG
CVTSPVLK EQU   CVTS01+49
CVTRSV77 EQU   CVTS01+48
CVTRV331 EQU   CVTS01+44
CVTRV330 EQU   CVTS01+40
CVTRV329 EQU   CVTS01+36
CVTRV328 EQU   CVTS01+32
CVTRV322 EQU   CVTS01+28
CVTSLID  EQU   CVTSLIDA+1
CVTSYLK  EQU   CVTSLIDA
CVTRV321 EQU   CVTS01+20
CVTRV320 EQU   CVTS01+16
CVTLPDIR EQU   CVTLPDIA+1
CVTRSV69 EQU   CVTDIRST
CVTRSV68 EQU   CVTDIRST
CVTRSV67 EQU   CVTDIRST
CVTRSV66 EQU   CVTDIRST
CVTRSV65 EQU   CVTDIRST
CVTRSV64 EQU   CVTDIRST
CVTRSV63 EQU   CVTDIRST
CVTDICOM EQU   CVTDIRST
CVTPVTP  EQU   CVTS01+8
CVTLPDSR EQU   CVTS01+4
CVTGETL  EQU   CVTS01
TIOTFEND EQU   POOLSTAR+16
TIOPSLOT EQU   POOLSTAR+13
TIOPSTTB EQU   POOLSTAR+12
TIOPPOOL EQU   POOLSTAR+4
TIOPNSRT EQU   POOLSTAR+3
@NM00079 EQU   POOLSTAR+2
TIOPNSLT EQU   POOLSTAR+1
@NM00078 EQU   POOLSTAR
TIOEFSRT EQU   TIOENTRY+17
TIOSVERF EQU   TIOESTTB
TIOSUNLD EQU   TIOESTTB
TIOSMNTD EQU   TIOESTTB
TIOSSETU EQU   TIOESTTB
TIOSVLSR EQU   TIOESTTB
TIOSPVIO EQU   TIOESTTB
TIOSREQD EQU   TIOESTTB
TIOSUSED EQU   TIOESTTB
TIOSBALS EQU   TIOESTTC
TIOSBALP EQU   TIOESTTC
TIOSVOLS EQU   TIOESTTC
TIOSVOLP EQU   TIOESTTC
TIOSAFFS EQU   TIOESTTC
TIOSAFFP EQU   TIOESTTC
TIOSDEFR EQU   TIOESTTC
TIOSDKCR EQU   TIOESTTC
TIOEJFCB EQU   TIOENTRY+12
TIOEDDNM EQU   TIOENTRY+4
TIOTREM  EQU   TIOELINK
TIOESSDS EQU   TIOESYOT
TIOESYIN EQU   TIOELINK
TIOEQNAM EQU   TIOELINK
TIOEDYNM EQU   TIOELINK
TIOTTERM EQU   TIOELINK
TIOTRV01 EQU   TIOELINK
TIOSYOUT EQU   TIOELINK
TIOSDSP2 EQU   TIOESTTA
TIOSDSP1 EQU   TIOESTTA
TIOSLABL EQU   TIOESTTA
TIOSDADS EQU   TIOESTTA
TIOSJBLB EQU   TIOESTTA
TIOSPLTS EQU   TIOESTTA
TIOSPLTP EQU   TIOESTTA
TIOSLTYP EQU   TIOESTTA
TIOELNGH EQU   TIOENTRY
TIOCSTEP EQU   TIOT1+8
TIOCNJOB EQU   TIOT1
@NM00077 EQU   SDWA+512
SDWAVRA  EQU   SDWARA+4
SDWAURAL EQU   SDWARA+3
@NM00076 EQU   SDWADPVA
SDWAEBC  EQU   SDWADPVA
SDWAHEX  EQU   SDWADPVA
SDWAVRAL EQU   SDWARA
@NM00075 EQU   SDWA+396
SDWACOMP EQU   SDWA+392
SDWARCPL EQU   SDWA+364
@NM00074 EQU   SDWADPSA+32
SDWATO4  EQU   SDWADPSL+28
SDWAFRM4 EQU   SDWADPSL+24
SDWATO3  EQU   SDWADPSL+20
SDWAFRM3 EQU   SDWADPSL+16
SDWATO2  EQU   SDWADPSL+12
SDWAFRM2 EQU   SDWADPSL+8
SDWATO1  EQU   SDWADPSL+4
SDWAFRM1 EQU   SDWADPSL
@NM00073 EQU   SDWADDAT+3
@NM00072 EQU   SDWAPDAT
SDWAUSPL EQU   SDWAPDAT
SDWADPSW EQU   SDWAPDAT
SDWATJPA EQU   SDWAPDAT
SDWATLPA EQU   SDWAPDAT
SDWADREG EQU   SDWAPDAT
SDWADSAH EQU   SDWAPDAT
SDWADSAS EQU   SDWAPDAT
@NM00071 EQU   SDWADDAT+1
@NM00070 EQU   SDWASDAT
SDWAQQS  EQU   SDWASDAT
SDWACBS  EQU   SDWASDAT
SDWAGTF  EQU   SDWASDAT
SDWASWA  EQU   SDWASDAT
SDWALSQA EQU   SDWASDAT
SDWASQA  EQU   SDWASDAT
SDWANUC  EQU   SDWASDAT
@NM00069 EQU   SDWADUMP+2
@NM00068 EQU   SDWADPFS
SDWASLST EQU   SDWADPFS
@NM00067 EQU   SDWADPFS
SDWADLST EQU   SDWADPFS
SDWADPT  EQU   SDWADPFS
SDWADPID EQU   SDWADUMP
SDWADPLA EQU   SDWA+316
SDWAREXN EQU   SDWARECP+16
SDWACSCT EQU   SDWARECP+8
SDWAMODN EQU   SDWARECP
@NM00066 EQU   SDWA+290
SDWAASID EQU   SDWA+288
SDWATALW EQU   SDWALKWS+28
SDWATDLW EQU   SDWALKWS+24
SDWATNLW EQU   SDWALKWS+20
SDWAAPLW EQU   SDWALKWS+16
SDWAIPLW EQU   SDWALKWS+12
SDWAILLW EQU   SDWALKWS+8
SDWAIULW EQU   SDWALKWS+4
SDWAICLW EQU   SDWALKWS
SDWAFLLK EQU   SDWAACF4
SDWACMS  EQU   SDWAACF4
SDWAOPTM EQU   SDWAACF4
SDWATADB EQU   SDWAACF4
SDWATDNB EQU   SDWAACF4
SDWATNCB EQU   SDWAACF4
SDWAILCH EQU   SDWAACF4
SDWAIUCB EQU   SDWAACF4
SDWAICAT EQU   SDWAACF3
SDWAIPRG EQU   SDWAACF3
SDWASALL EQU   SDWAACF3
SDWAASMP EQU   SDWAACF3
SDWADISP EQU   SDWAACF3
@NM00065 EQU   SDWAACF3
@NM00064 EQU   SDWAACF2
SDWAFREE EQU   SDWAACF2
SDWAUPRG EQU   SDWAACF2
@NM00063 EQU   SDWAACF2
SDWASPIN EQU   SDWAACF2
@NM00062 EQU   SDWAACF2
SDWARCRD EQU   SDWAACF2
SDWARCDE EQU   SDWAPARQ
SDWALCPU EQU   SDWACPUA+2
@NM00061 EQU   SDWACPUA
SDWARECA EQU   SDWA+244
SDWARTYA EQU   SDWA+240
@NM00060 EQU   SDWA+239
@NM00059 EQU   SDWAIOFS
SDWANIOP EQU   SDWAIOFS
SDWANOIO EQU   SDWAIOFS
SDWAIOHT EQU   SDWAIOFS
SDWAIOQR EQU   SDWAIOFS
SDWAFMID EQU   SDWA+236
@NM00058 EQU   SDWAERRD
SDWAMCIV EQU   SDWAERRD
SDWARPIV EQU   SDWAERRD
SDWAMABD EQU   SDWAERRD
SDWACTS  EQU   SDWAERRD
SDWASTAE EQU   SDWAERRD
SDWANRBE EQU   SDWAERRD
SDWACLUP EQU   SDWAERRD
@NM00057 EQU   SDWAERRC
SDWAEAS  EQU   SDWAERRC
SDWAPERC EQU   SDWAERRC
SDWAIRB  EQU   SDWAERRC
SDWASTAI EQU   SDWAERRC
SDWASTAF EQU   SDWAERRC
SDWASRBM EQU   SDWAERRB
SDWALDIS EQU   SDWAERRB
SDWAENRB EQU   SDWAERRB
SDWATYP1 EQU   SDWAERRB
@NM00056 EQU   SDWAERRB
SDWAPGIO EQU   SDWAERRA
SDWATEXC EQU   SDWAERRA
SDWASVCE EQU   SDWAERRA
SDWAABTM EQU   SDWAERRA
SDWASVCD EQU   SDWAERRA
SDWARKEY EQU   SDWAERRA
SDWAPCHK EQU   SDWAERRA
SDWAMCHK EQU   SDWAERRA
SDWATIME EQU   SDWAMCH+20
SDWARFSA EQU   SDWAMCH+16
@NM00055 EQU   SDWAMCH+14
SDWAVEQR EQU   SDWARSR2
SDWAPGFX EQU   SDWARSR2
SDWAFLSQ EQU   SDWARSR2
SDWAFSQA EQU   SDWARSR2
SDWANUCL EQU   SDWARSR2
SDWASPER EQU   SDWARSR2
SDWAINTC EQU   SDWARSR2
SDWAOFLN EQU   SDWARSR2
SDWACHNG EQU   SDWARSR1
SDWAMSER EQU   SDWARSR1
@NM00054 EQU   SDWARSR1
SDWACPID EQU   SDWAMCH+10
SDWATERR EQU   SDWAMCHD
SDWAFPRX EQU   SDWAMCHD
SDWAINSF EQU   SDWAMCHD
SDWAACR  EQU   SDWAMCHD
SDWASCK  EQU   SDWAMCHD
SDWAPSWU EQU   SDWAMCHD
SDWAREGU EQU   SDWAMCHD
SDWASKYF EQU   SDWAMCHD
@NM00053 EQU   SDWAMCHS
SDWARSRF EQU   SDWAMCHS
SDWARSRC EQU   SDWAMCHS
SDWAINVP EQU   SDWAMCHS
SDWATSVL EQU   SDWAMCHS
SDWARCDF EQU   SDWAMCHS
SDWASRVL EQU   SDWAMCHS
SDWASCKE EQU   SDWASTCK+4
SDWASCKB EQU   SDWASTCK
SDWALNTH EQU   SDWAIDNT+1
SDWASPID EQU   SDWAIDNT
SDWASR15 EQU   SDWASRSV+60
SDWASR14 EQU   SDWASRSV+56
SDWASR13 EQU   SDWASRSV+52
SDWASR12 EQU   SDWASRSV+48
SDWASR11 EQU   SDWASRSV+44
SDWASR10 EQU   SDWASRSV+40
SDWASR09 EQU   SDWASRSV+36
SDWASR08 EQU   SDWASRSV+32
SDWASR07 EQU   SDWASRSV+28
SDWASR06 EQU   SDWASRSV+24
SDWASR05 EQU   SDWASRSV+20
SDWASR04 EQU   SDWASRSV+16
SDWASR03 EQU   SDWASRSV+12
SDWASR02 EQU   SDWASRSV+8
SDWASR01 EQU   SDWASRSV+4
SDWASR00 EQU   SDWASRSV
SDWATRN2 EQU   SDWAAEC2+4
SDWAIPC2 EQU   SDWAICD2
SDWAIMC2 EQU   SDWAICD2
SDWAIPR2 EQU   SDWAICD2
@NM00052 EQU   SDWAINC2
@NM00051 EQU   SDWAILC2
SDWAIL2  EQU   SDWAILC2
@NM00050 EQU   SDWAILC2
@NM00049 EQU   SDWAAEC2
SDWAADD2 EQU   SDWANXT2+1
@NM00048 EQU   SDWANXT2
@NM00047 EQU   SDWAEC2+3
SDWASGN2 EQU   SDWAINT2
SDWAEXP2 EQU   SDWAINT2
SDWADEC2 EQU   SDWAINT2
SDWAFPO2 EQU   SDWAINT2
SDWACC2  EQU   SDWAINT2
@NM00046 EQU   SDWAINT2
SDWAPGM2 EQU   SDWAMWP2
SDWAWAT2 EQU   SDWAMWP2
SDWAMCK2 EQU   SDWAMWP2
SDWAECT2 EQU   SDWAMWP2
SDWAKEY2 EQU   SDWAMWP2
SDWAEXT2 EQU   SDWAEMK2
SDWAIO2  EQU   SDWAEMK2
SDWATRM2 EQU   SDWAEMK2
@NM00045 EQU   SDWAEMK2
SDWAPER2 EQU   SDWAEMK2
@NM00044 EQU   SDWAEMK2
SDWATRAN EQU   SDWAAEC1+4
SDWAIPC1 EQU   SDWAICD1
SDWAIMC1 EQU   SDWAICD1
SDWAIPR1 EQU   SDWAICD1
@NM00043 EQU   SDWAINC1
@NM00042 EQU   SDWAILC1
SDWAIL1  EQU   SDWAILC1
@NM00041 EQU   SDWAILC1
@NM00040 EQU   SDWAAEC1
SDWAADD1 EQU   SDWANXT1+1
@NM00039 EQU   SDWANXT1
@NM00038 EQU   SDWAEC1+3
SDWASGN1 EQU   SDWAINT1
SDWAEXP1 EQU   SDWAINT1
SDWADEC1 EQU   SDWAINT1
SDWAFPO1 EQU   SDWAINT1
SDWACC1  EQU   SDWAINT1
@NM00037 EQU   SDWAINT1
SDWAPGM1 EQU   SDWAMWP1
SDWAWAT1 EQU   SDWAMWP1
SDWAMCK1 EQU   SDWAMWP1
SDWAECT1 EQU   SDWAMWP1
SDWAKEY1 EQU   SDWAMWP1
SDWAEXT1 EQU   SDWAEMK1
SDWAIO1  EQU   SDWAEMK1
SDWATRM1 EQU   SDWAEMK1
@NM00036 EQU   SDWAEMK1
SDWAPER1 EQU   SDWAEMK1
@NM00035 EQU   SDWAEMK1
SDWAIOBR EQU   SDWA+100
SDWAEPA  EQU   SDWA+96
@NM00034 EQU   SDWANAME+4
SDWARBAD EQU   SDWANAME
SDWAGR15 EQU   SDWAGRSV+60
SDWAGR14 EQU   SDWAGRSV+56
SDWAGR13 EQU   SDWAGRSV+52
SDWAGR12 EQU   SDWAGRSV+48
SDWAGR11 EQU   SDWAGRSV+44
SDWAGR10 EQU   SDWAGRSV+40
SDWAGR09 EQU   SDWAGRSV+36
SDWAGR08 EQU   SDWAGRSV+32
SDWAGR07 EQU   SDWAGRSV+28
SDWAGR06 EQU   SDWAGRSV+24
SDWAGR05 EQU   SDWAGRSV+20
SDWAGR04 EQU   SDWAGRSV+16
SDWAGR03 EQU   SDWAGRSV+12
SDWAGR02 EQU   SDWAGRSV+8
SDWAGR01 EQU   SDWAGRSV+4
SDWAGR00 EQU   SDWAGRSV
SDWANXTP EQU   SDWACTL2+5
SDWASGP  EQU   SDWAPMKP
SDWAEUP  EQU   SDWAPMKP
SDWADOP  EQU   SDWAPMKP
SDWAFPP  EQU   SDWAPMKP
SDWACCP  EQU   SDWAPMKP
SDWAILP  EQU   SDWAPMKP
SDWAINTP EQU   SDWACTL2+2
SDWASPVP EQU   SDWAMWPP
SDWAWATP EQU   SDWAMWPP
SDWAMCKP EQU   SDWAMWPP
@NM00033 EQU   SDWAMWPP
SDWAKEYP EQU   SDWAMWPP
SDWAEXTP EQU   SDWACMKP
SDWAIOP  EQU   SDWACMKP
SDWANXTA EQU   SDWACTL1+5
SDWASGA  EQU   SDWAPMKA
SDWAEUA  EQU   SDWAPMKA
SDWADOA  EQU   SDWAPMKA
SDWAFPA  EQU   SDWAPMKA
SDWACCA  EQU   SDWAPMKA
SDWAILA  EQU   SDWAPMKA
SDWAINTA EQU   SDWACTL1+2
SDWASPVA EQU   SDWAMWPA
SDWAWATA EQU   SDWAMWPA
SDWAMCKA EQU   SDWAMWPA
@NM00032 EQU   SDWAMWPA
SDWAKEYA EQU   SDWAMWPA
SDWAEXTA EQU   SDWACMKA
SDWAIOA  EQU   SDWACMKA
SDWACMPC EQU   SDWAABCC+1
@NM00031 EQU   SDWACMPF
SDWASTCC EQU   SDWACMPF
@NM00030 EQU   SDWACMPF
SDWASTEP EQU   SDWACMPF
SDWAREQ  EQU   SDWACMPF
SDWAPARM EQU   SDWA
DSABGRID EQU   DSABGIDL+4
DSABLLEN EQU   DSABGIDL
DSABANAM EQU   DSABANMI+1
DSABANML EQU   DSABANMI
DSABRS04 EQU   DSAB+68
DSABSIOT EQU   DSAB+64
DSABRS03 EQU   DSAB+62
DSABDCBM EQU   DSAB+56
DSABSSCM EQU   DSAB+52
DSABSSNM EQU   DSAB+48
DSABPTTR EQU   DSAB+44
DSABTCBP EQU   DSAB+40
DSABRS02 EQU   DSAB+38
@NM00029 EQU   DSABFLG4
DSABCKSI EQU   DSABFLG4
DSABCKVL EQU   DSABFLG4
DSABCKDS EQU   DSABFLG4
@NM00028 EQU   DSABFLG3
DSABJSCT EQU   DSABFLG3
DSABCATL EQU   DSABFLG3
DSABVMSC EQU   DSABFLG3
DSABVAM  EQU   DSABFLG3
DSABPASS EQU   DSABFLG3
DSABDEFR EQU   DSABFLG3
@NM00027 EQU   DSABFLG2
DSABUNAL EQU   DSABFLG2
DSABIRM  EQU   DSABFLG2
DSABOPEN EQU   DSABFLG2
DSABNUSE EQU   DSABFLG1
DSABCATM EQU   DSABFLG1
DSABPCAT EQU   DSABFLG1
DSABDCAT EQU   DSABFLG1
DSABCONV EQU   DSABFLG1
DSABDCNV EQU   DSABFLG1
DSABPALC EQU   DSABFLG1
DSABDALC EQU   DSABFLG1
@NM00026 EQU   DSABORG2
DSABTR   EQU   DSABORG2
DSABAM   EQU   DSABORG2
@NM00025 EQU   DSABORG2
DSABTQ   EQU   DSABORG2
DSABTX   EQU   DSABORG2
DSABGS   EQU   DSABORG2
DSABU    EQU   DSABORG1
DSABPO   EQU   DSABORG1
DSABMQ   EQU   DSABORG1
DSABCQ   EQU   DSABORG1
DSABCX   EQU   DSABORG1
DSABDA   EQU   DSABORG1
DSABPS   EQU   DSABORG1
DSABIS   EQU   DSABORG1
DSABSSVA EQU   DSAB+21
DSABRS01 EQU   DSAB+20
DSABOPCT EQU   DSAB+14
DSABLNTH EQU   DSAB+12
DSABBCHN EQU   DSAB+8
DSABID   EQU   DSAB
@NM00024 EQU   PRMFUNC
DUMPOK   EQU   PRMFUNC
@NM00023 EQU   PRMRESC
@NM00022 EQU   PRMESTAE
AQMQBPTR EQU   AQMPARAM+24
AQMPFLG  EQU   AQMNORMP
AQMCANCP EQU   AQMPARAM+16
AQMLENGT EQU   AQMPARAM+12
AQMASID  EQU   AQMPARAM+8
AQMMASKP EQU   AQMPARAM+4
AQMQCODE EQU   AQMPARAM+2
SIODDSNL EQU   INDMSIOT+173
SIOVDSNL EQU   INDMSIOT+172
SIOVDSNT EQU   INDMSIOT+170
SVOLUNNO EQU   INDMSIOT+168
SIOTVMVP EQU   INDMSIOT+164
SIOTJFX  EQU   INDMSIOT+160
SJFCBPTR EQU   INDMSIOT+156
SIOTNPTR EQU   INDMSIOT+152
SIOTATE  EQU   INDMSIOT+144
SVOLUNAD EQU   INDMSIOT+140
SIOTEDLP EQU   INDMSIOT+136
SIOTEDLS EQU   INDMSIOT+132
SIOTRSNC EQU   INDMSIOT+130
SCTANAME EQU   INDMSIOT+122
SIOTSSIC EQU   INDMSIOT+120
@NM00021 EQU   INDMSIOT+108
SIOTSSNM EQU   INDMSIOT+104
@NM00020 EQU   SIOTBYT2
SIOTCVOL EQU   SIOTBYT2
SIOTCNEW EQU   SIOTBYT2
SIOTCALC EQU   SIOTBYT2
SIOTGALL EQU   SIOTBYT2
SIOTDSPD EQU   SIOTBYT2
SIOTDMND EQU   SIOTBYT2
SIOTOPUC EQU   INDMSIOT+99
SIOTOUTR EQU   INDMSIOT+97
SIOTOUTC EQU   INDMSIOT+96
SIOTSSWA EQU   INDMSIOT+93
SIOTAUNC EQU   SIOTALTD
SIOTACAT EQU   SIOTALTD
SIOTADEL EQU   SIOTALTD
SIOTAKEP EQU   SIOTALTD
SIOTNPRV EQU   SIOTALTD
SIOJCATS EQU   SIOTALTD
@NM00019 EQU   SIOTALTD
@NM00018 EQU   SIOTALTD
@NM00017 EQU   INDMSIOT+91
SIOTNDSB EQU   INDMSIOT+88
@NM00016 EQU   INDMSIOT+84
SIOTDPCD EQU   INDMSIOT+82
@NM00015 EQU   SIOTBYT4
SIOTRACT EQU   SIOTBYT4
SIOTRACD EQU   SIOTBYT4
SIOTPROT EQU   SIOTBYT4
SCTOUTPN EQU   INDMSIOT+80
SCTOUTNO EQU   INDMSIOT+76
SCTOUTNM EQU   INDMSIOT+68
SIOUCBAD EQU   SCTUTYPE+5
SIOUCNVT EQU   SCTUTYPE+4
SIOUBYT4 EQU   SIOTDEVT+3
@NM00014 EQU   SIOUBYT3
SIO3UREC EQU   SIOUBYT3
SIO3DISP EQU   SIOUBYT3
SIO3DACC EQU   SIOUBYT3
SIO3COMM EQU   SIOUBYT3
SIO3TAPE EQU   SIOUBYT3
SIOUBYT2 EQU   SIOTDEVT+1
SIOUBYT1 EQU   SIOTDEVT
SIOTOMN  EQU   SCTSBYT4
SIOTIPDI EQU   SCTSBYT4
SIOTVAFF EQU   SCTSBYT4
SIOTSTEP EQU   SCTSBYT4
SIOTASCI EQU   SCTSBYT4
@NM00013 EQU   SCTSBYT4
SIOTGDGA EQU   SCTSBYT4
SCTSGDGS EQU   SCTSBYT4
SCTSOLD  EQU   SCTSBYT3
SCTSMOD  EQU   SCTSBYT3
SCTSNEW  EQU   SCTSBYT3
SCTSYSOU EQU   SCTSBYT3
SCTVREF  EQU   SCTSBYT3
SCTALCHK EQU   SCTSBYT3
SCTSYSNE EQU   SCTSBYT3
SCTDSNRF EQU   SCTSBYT3
SCTRECVD EQU   SCTSBYT2
SCTDEFER EQU   SCTSBYT2
SCTLABEL EQU   SCTSBYT2
SCTUNLBD EQU   SCTSBYT2
SCTJOBLB EQU   SCTSBYT2
SCTVOLAF EQU   SCTSBYT2
SIOTCATL EQU   SCTSBYT2
SIOCLUNL EQU   SCTSBYT2
SIOTJSCT EQU   SCTSBYT1
SCTUNAFF EQU   SCTSBYT1
SCTPARLM EQU   SCTSBYT1
SIOTQDSN EQU   SCTSBYT1
SIOTGDSN EQU   SCTSBYT1
SIOTCCAT EQU   SCTSBYT1
SCTSYSIN EQU   SCTSBYT1
SCTDUMMY EQU   SCTSBYT1
SIOTUNCT EQU   SCTSDISP
SIOTCTLG EQU   SCTSDISP
SIOTDLET EQU   SCTSDISP
SIOTKEEP EQU   SCTSDISP
SIOTPASS EQU   SCTSDISP
SIOTPRIV EQU   SCTSDISP
S3400DSP EQU   SCTSDISP
SIOTRETN EQU   SCTSDISP
SIOTVLCT EQU   INDMSIOT+54
SCTNMBUT EQU   INDMSIOT+53
SIOTRTRY EQU   SIOTBYT0
SIOTPUPV EQU   SIOTBYT0
SIOTNOPV EQU   SIOTBYT0
SIOTGIGN EQU   SIOTBYT0
SPVTAMSG EQU   SIOTBYT0
SIOTFUDA EQU   SIOTBYT0
SIOTDYAL EQU   SIOTBYT0
SIOTSSDS EQU   SIOTBYT0
SIOTGIID EQU   INDMSIOT+50
SCTVOLCT EQU   INDMSIOT+49
SCTSPOOL EQU   INDMSIOT+48
SIOTQNAM EQU   SIOTTSTC
SIOTDSNM EQU   SIOTTSTC
SIOTTRKM EQU   SIOTTSTC
SIOTSSMG EQU   SIOTTSTC
SIOTSSGP EQU   SIOTTSTC
@NM00012 EQU   SIOTTSTC
SIOTTERM EQU   SIOTTSTC
SIOTINFC EQU   SIOTTSTC
@NM00011 EQU   SIOTBYT3
SIOTDSID EQU   SIOTBYT3
S3400OFF EQU   SIOTBYT3
SIOTJES3 EQU   SIOTBYT3
SIOCDEVT EQU   SIOTBYT3
SIOALIAS EQU   SIOTBYT3
SCTDDINO EQU   INDMSIOT+44
SIOTDDNT EQU   SIOTBYT1
SIOTALCD EQU   SIOTBYT1
SIODADSM EQU   SIOTBYT1
SIOTDADR EQU   SIOTBYT1
SIODUNAL EQU   SIOTBYT1
SIOVAMDS EQU   SIOTBYT1
SIOTHOLD EQU   SIOTBYT1
SIOTOCKP EQU   SIOTBYT1
SIOPSCNT EQU   INDMSIOT+42
SIOTREFN EQU   INDMSIOT+40
SIOTOTUN EQU   INDMSIOT+39
SIOTVRSB EQU   INDMSIOT+36
@NM00010 EQU   INDMSIOT+35
SCTPJFCB EQU   INDMSIOT+32
@NM00009 EQU   INDMSIOT+31
SCTPSIOT EQU   INDMSIOT+28
SIOTAFID EQU   INDMSIOT+26
SIOTVLSP EQU   INDMSIOT+24
SIODSNTE EQU   INDMSIOT+22
SIOTUNAF EQU   SCTUSADD
SIOTDEST EQU   INDMSIOT+12
SCTDDNAM EQU   INDMSIOT+4
SIOTTYPE EQU   INDMSIOT+3
SIOTDSKA EQU   INDMSIOT
@NM00008 EQU   CSD+160
CSDMASK  EQU   CSD+128
CSDGDTOD EQU   CSD+116
CSDGDINT EQU   CSD+112
CSDGDCC  EQU   CSD+108
CSDDDRCT EQU   CSD+106
CSDRV044 EQU   CSD+104
CSDMAFF  EQU   CSD+24
CSDRV038 EQU   CSDFLAGS
CSDRV037 EQU   CSDFLAGS
CSDRV036 EQU   CSDFLAGS
CSDRV035 EQU   CSDFLAGS
CSDRV034 EQU   CSDFLAGS
CSDRV033 EQU   CSDFLAGS
CSDRV032 EQU   CSDFLAGS
CSDMP    EQU   CSDFLAGS
CSDACR   EQU   CSD+22
CSDMF1CP EQU   CSD+20
CSDRV043 EQU   CSD+16
CSDRV030 EQU   CSDSCFL4
CSDRV029 EQU   CSDSCFL4
CSDRV028 EQU   CSDSCFL4
CSDRV027 EQU   CSDSCFL4
CSDRV026 EQU   CSDSCFL4
CSDRV025 EQU   CSDSCFL4
CSDRV024 EQU   CSDSCFL4
CSDRV023 EQU   CSDSCFL4
CSDRV022 EQU   CSDSCFL3
CSDRV021 EQU   CSDSCFL3
CSDRV020 EQU   CSDSCFL3
CSDRV019 EQU   CSDSCFL3
CSDRV018 EQU   CSDSCFL3
CSDRV017 EQU   CSDSCFL3
CSDRV016 EQU   CSDSCFL3
CSDRV015 EQU   CSDSCFL3
CSDRV014 EQU   CSDSCFL2
CSDRV013 EQU   CSDSCFL2
CSDRV012 EQU   CSDSCFL2
CSDRV011 EQU   CSDSCFL2
CSDRV010 EQU   CSDSCFL2
CSDRV009 EQU   CSDSCFL2
CSDRV008 EQU   CSDSCFL2
CSDRV007 EQU   CSDSCFL2
CSDRV006 EQU   CSDSCFL1
CSDRV005 EQU   CSDSCFL1
CSDRV004 EQU   CSDSCFL1
CSDRV003 EQU   CSDSCFL1
CSDRV002 EQU   CSDSCFL1
CSDRV001 EQU   CSDSCFL1
CSDSYSND EQU   CSDSCFL1
CSDRV042 EQU   CSDSCFL1
CSDCPUOL EQU   CSD+10
CSDSAFF  EQU   CSDCPUAL
CSDCHAD  EQU   CSD+6
CSDCPUJS EQU   CSD+4
CSDCSD   EQU   CSD
CVTLEVL  EQU   CVTRELNO+2
CVTNUMB  EQU   CVTRELNO
CVTMDL   EQU   CVTFIX+250
@NM00007 EQU   CVTFIX+248
@NM00006 EQU   CVTFIX
CVTRV482 EQU   CVTXTNT2+128
CVTRV481 EQU   CVTXTNT2+124
CVTRV480 EQU   CVTXTNT2+120
CVTRV479 EQU   CVTXTNT2+118
CVTRV478 EQU   CVTXTNT2+117
CVTRV477 EQU   CVTXTNT2+116
CVTRV476 EQU   CVTXTNT2+115
CVTRV475 EQU   CVTXTNT2+114
CVTRV474 EQU   CVTRV466
CVTRV473 EQU   CVTRV466
CVTRV472 EQU   CVTRV466
CVTRV471 EQU   CVTRV466
CVTRV470 EQU   CVTRV466
CVTRV469 EQU   CVTRV466
CVTRV468 EQU   CVTRV466
CVTRV467 EQU   CVTRV466
CVTRV465 EQU   CVTRV457
CVTRV464 EQU   CVTRV457
CVTRV463 EQU   CVTRV457
CVTRV462 EQU   CVTRV457
CVTRV461 EQU   CVTRV457
CVTRV460 EQU   CVTRV457
CVTRV459 EQU   CVTRV457
CVTRV458 EQU   CVTRV457
CVTRV456 EQU   CVTXTNT2+108
CVTRV455 EQU   CVTXTNT2+104
CVTRV454 EQU   CVTXTNT2+100
CVTRV453 EQU   CVTXTNT2+96
CVTRV452 EQU   CVTXTNT2+94
CVTRV451 EQU   CVTXTNT2+92
CVTRV450 EQU   CVTXTNT2+90
CVTRV449 EQU   CVTXTNT2+88
CVTRV448 EQU   CVTXTNT2+87
CVTRV447 EQU   CVTXTNT2+86
CVTRV446 EQU   CVTRV438
CVTRV445 EQU   CVTRV438
CVTRV444 EQU   CVTRV438
CVTRV443 EQU   CVTRV438
CVTRV442 EQU   CVTRV438
CVTRV441 EQU   CVTRV438
CVTRV440 EQU   CVTRV438
CVTRV439 EQU   CVTRV438
CVTRV437 EQU   CVTRV429
CVTRV436 EQU   CVTRV429
CVTRV435 EQU   CVTRV429
CVTRV434 EQU   CVTRV429
CVTRV433 EQU   CVTRV429
CVTRV432 EQU   CVTRV429
CVTRV431 EQU   CVTRV429
CVTRV430 EQU   CVTRV429
CVTRV428 EQU   CVTXTNT2+80
CVTRV427 EQU   CVTXTNT2+76
CVTRV426 EQU   CVTXTNT2+72
CVTRV425 EQU   CVTXTNT2+68
CVTATACT EQU   CVTATCVT
CVTRV423 EQU   CVTXTNT2+62
CVTRV422 EQU   CVTXTNT2+60
CVTRV421 EQU   CVTXTNT2+58
CVTRV420 EQU   CVTXTNT2+56
CVTRV419 EQU   CVTXTNT2+55
CVTRV418 EQU   CVTXTNT2+54
CVTRV417 EQU   CVTRV409
CVTRV416 EQU   CVTRV409
CVTRV415 EQU   CVTRV409
CVTRV414 EQU   CVTRV409
CVTRV413 EQU   CVTRV409
CVTRV412 EQU   CVTRV409
CVTRV411 EQU   CVTRV409
CVTRV410 EQU   CVTRV409
CVTRV408 EQU   CVTRV400
CVTRV407 EQU   CVTRV400
CVTRV406 EQU   CVTRV400
CVTRV405 EQU   CVTRV400
CVTRV404 EQU   CVTRV400
CVTRV403 EQU   CVTRV400
CVTRV402 EQU   CVTRV400
CVTRV401 EQU   CVTRV400
CVTICB   EQU   CVTXTNT2+48
CVTSKTA  EQU   CVTXTNT2+44
CVTCCVT  EQU   CVTXTNT2+40
CVTRSV98 EQU   CVTXTNT2+36
CVTRSV97 EQU   CVTXTNT2+34
CVTRSV96 EQU   CVTXTNT2+32
CVTOLTEP EQU   CVTXTNT2+28
CVTQIDA  EQU   CVTQID+1
CVTRSV95 EQU   CVTQID
CVTRSV94 EQU   CVTXTNT2+20
CVTRSV93 EQU   CVTXTNT2+16
CVTRSV92 EQU   CVTXTNT2+12
CVTDEBVR EQU   CVTXTNT2+8
CVTRSV91 EQU   CVTXTNT2+6
CVTRSV9H EQU   CVTFLGBT
CVTRSV9G EQU   CVTFLGBT
CVTRSV9F EQU   CVTFLGBT
CVTRSV9E EQU   CVTFLGBT
CVTRSV9D EQU   CVTFLGBT
CVTRSV9C EQU   CVTFLGBT
CVTVME   EQU   CVTFLGBT
CVTNPE   EQU   CVTFLGBT
CVTNUCLS EQU   CVTXTNT2+4
CVTDSSVA EQU   CVTDSSV+1
CVTRSV89 EQU   CVTDSSV
CVTRSV88 EQU   CVTXTNT1+8
CVTRSV87 EQU   CVTXTNT1+4
CVTFACHN EQU   CVTXTNT1
CVTRV488 EQU   CVTMAP+412
CVTRV487 EQU   CVTMAP+408
CVTRV486 EQU   CVTMAP+404
CVTRV485 EQU   CVTMAP+400
CVTACTAP EQU   CVTMAP+396
CVTAUTH  EQU   CVTMAP+392
CVTATMCA EQU   CVTATMCT+1
CVTATMST EQU   CVTATMCT
CVTRSV61 EQU   CVTMAP+384
CVTVOLT1 EQU   CVTVOLM1+1
CVTVOLI1 EQU   CVTVOLF1
CVTSTOA  EQU   CVTMAP+376
CVTRSV58 EQU   CVTMAP+374
CVTRSV57 EQU   CVTMAP+372
CVTDDCE  EQU   CVTMAP+368
CVTPNWFR EQU   CVTMAP+364
CVTSMF   EQU   CVTMAP+360
CVTSULK  EQU   CVTMAP+358
CVTSLKO  EQU   CVTSYSK
CVTSLKP  EQU   CVTSYSK
CVTSLKQ  EQU   CVTSYSK
CVTSLKR  EQU   CVTSYSK
CVTRSV56 EQU   CVTSYSK
CVTRSV55 EQU   CVTSYSK
CVTRSV54 EQU   CVTSYSK
CVTRSV53 EQU   CVTSYSK
CVTRSV52 EQU   CVTA1F1
CVTRSV51 EQU   CVTA1F1
CVTRSV50 EQU   CVTA1F1
CVTRSV49 EQU   CVTA1F1
CVTRSV48 EQU   CVTA1F1
CVTRSV47 EQU   CVTA1F1
CVTSRSW  EQU   CVTA1F1
CVTPFSW  EQU   CVTA1F1
CVTPCVT  EQU   CVTMAP+352
CVTRSV46 EQU   CVTMAP+344
CVTRSV45 EQU   CVTMAP+340
CVTRSV44 EQU   CVTMAP+338
CVTRSV43 EQU   CVTMAP+336
CVTHJESA EQU   CVTHJES+1
CVTRSV42 EQU   CVTHJES
CVTEXT2A EQU   CVTEXT2+1
CVTRSV41 EQU   CVTEXT2
CVTAPFA  EQU   CVTAPF+1
CVTRSV40 EQU   CVTAPF
CVTRV518 EQU   CVTINTLA
CVTRV517 EQU   CVTERPV
CVTEORM  EQU   CVTMAP+312
CVTMCHPR EQU   CVTMAP+308
CVTTZ    EQU   CVTMAP+304
CVTJEPS  EQU   CVTMAP+300
CVTJESCT EQU   CVTMAP+296
CVTMODE  EQU   CVTMAP+292
CVTPTRV  EQU   CVTMAP+288
CVTREAL  EQU   CVTMAP+284
CVTRSV39 EQU   CVTMAP+280
CVTRSV38 EQU   CVTMAP+276
CVTDMSRA EQU   CVTDMSR+1
CVTRV634 EQU   CVTDMSRF
CVTRV633 EQU   CVTDMSRF
CVTRV632 EQU   CVTDMSRF
CVTRV631 EQU   CVTDMSRF
CVTRV630 EQU   CVTDMSRF
CVTRV629 EQU   CVTDMSRF
CVTUDUMP EQU   CVTDMSRF
CVTSDUMP EQU   CVTDMSRF
CVTQMSGA EQU   CVTQMSG+1
CVTRSV36 EQU   CVTQMSG
CVTAMFF  EQU   CVTMAP+264
CVTPURGA EQU   CVTPURG+1
CVTRSV35 EQU   CVTPURG
CVTCBSP  EQU   CVTMAP+256
CVTATERA EQU   CVTATER+1
CVTSYST  EQU   CVTATER
CVTVOLT2 EQU   CVTTAT
CVTVOLI2 EQU   CVTVOLF2
CVTAQAVB EQU   CVTAQAVT+1
CVTRSV34 EQU   CVTTCMFG
CVTRSV33 EQU   CVTTCMFG
CVTRSV32 EQU   CVTTCMFG
CVTRSV31 EQU   CVTTCMFG
CVTRSV30 EQU   CVTTCMFG
CVTRSV29 EQU   CVTTCMFG
CVTRSV28 EQU   CVTTCMFG
CVTTCRDY EQU   CVTTCMFG
CVTGTFA  EQU   CVTGTF+1
CVTRSV27 EQU   CVTGTFST
CVTRNIO  EQU   CVTGTFST
CVTUSR   EQU   CVTGTFST
CVTRV318 EQU   CVTFORM
CVTRV317 EQU   CVTTMODE
CVTRV316 EQU   CVTSTATE
CVTRV315 EQU   CVTGTFS
CVTGTFAV EQU   CVTGTFS
CVT0SCR1 EQU   CVTMAP+232
CVTRV515 EQU   CVTMAP+228
CVTRMS   EQU   CVTMAP+224
CVTPATCH EQU   CVTMAP+220
CVTTSCE  EQU   CVTMAP+216
CVTLNKSC EQU   CVTMAP+214
CVTQABST EQU   CVTMAP+212
CVTMDLDS EQU   CVTMAP+208
CVTUSER  EQU   CVTMAP+204
CVTABEND EQU   CVTMAP+200
CVTSMCA  EQU   CVTMAP+196
CVTRSV18 EQU   CVTMAP+192
CVTQLPAQ EQU   CVTMAP+188
CVTQCDSR EQU   CVTMAP+184
CVTRSV17 EQU   CVTOPTB
CVTRSV16 EQU   CVTOPTB
CVTFP    EQU   CVTOPTB
CVTAPTHR EQU   CVTOPTB
CVTNLOG  EQU   CVTOPTB
CVTTOD   EQU   CVTOPTB
CVTCTIMS EQU   CVTOPTB
CVTPROT  EQU   CVTOPTB
CVTXPFP  EQU   CVTOPTA
CVTASCII EQU   CVTOPTA
CVTRSV13 EQU   CVTOPTA
CVTRSV12 EQU   CVTOPTA
CVTNIP   EQU   CVTOPTA
CVTDDR   EQU   CVTOPTA
CVTAPR   EQU   CVTOPTA
CVTCCH   EQU   CVTOPTA
CVTSNCTR EQU   CVTMAP+180
CVTQMWR  EQU   CVTMAP+176
CVTQOCR  EQU   CVTMAP+172
CVT1EF00 EQU   CVTMAP+168
CVTMZ00  EQU   CVTMAP+164
CVTSV76Q EQU   CVTSV76C
CVTRSV11 EQU   CVTMAP+156
CVT0PT01 EQU   CVTMAP+152
CVTMSER  EQU   CVTMAP+148
CVTRV516 EQU   CVTIERLC
CVTILCH  EQU   CVTMAP+140
CVT0DS   EQU   CVTMAP+136
CVTFBOSV EQU   CVTMAP+132
CVTNUCB  EQU   CVTMAP+128
CVTIXAVL EQU   CVTMAP+124
CVTSV76M EQU   CVTIOQET
CVTDCBA  EQU   CVTMAP+117
CVTMVS2  EQU   CVTDCB
CVT6DAT  EQU   CVTDCB
CVT4MPS  EQU   CVTDCB
CVTRSV09 EQU   CVTDCB
CVT4MS1  EQU   CVTDCB
CVT2SPS  EQU   CVTDCB
CVT1SSS  EQU   CVTDCB
CVTRSV08 EQU   CVTDCB
CVTSTB   EQU   CVTMAP+112
CVTQTD00 EQU   CVTMAP+108
CVTQTE00 EQU   CVTMAP+104
CVTCUCB  EQU   CVTMAP+100
CVTSJQ   EQU   CVTMAP+96
CVTPBLDL EQU   CVTMAP+92
CVTTPC   EQU   CVTMAP+88
CVTSVDCB EQU   CVTMAP+84
CVTBRET  EQU   CVTMAP+82
CVTEXIT  EQU   CVTMAP+80
CVT0FN00 EQU   CVTMAP+76
CVTDARA  EQU   CVTDAR+1
CVTRSV07 EQU   CVTFLGS1
CVTRSV06 EQU   CVTFLGS1
CVTRSV05 EQU   CVTFLGS1
CVTRSV04 EQU   CVTFLGS1
CVTRSV03 EQU   CVTFLGS1
CVTRSV02 EQU   CVTFLGS1
CVTRSV01 EQU   CVTFLGS1
CVTDMPLK EQU   CVTFLGS1
CVTXITP  EQU   CVTMAP+68
CVTZDTAB EQU   CVTMAP+64
CVTMSLT  EQU   CVTMAP+60
CVTDATE  EQU   CVTMAP+56
CVTBTERM EQU   CVTMAP+52
CVTSYSAD EQU   CVTMAP+48
CVTXTLER EQU   CVTMAP+44
CVTILK2  EQU   CVTMAP+40
CVTILK1  EQU   CVTMAP+36
CVTPRLTV EQU   CVTMAP+32
CVTPCNVT EQU   CVTMAP+28
CVT0VL00 EQU   CVTMAP+24
CVTXAPG  EQU   CVTMAP+20
CVTBUF   EQU   CVTMAP+16
CVTJOB   EQU   CVTMAP+12
CVTLINK  EQU   CVTMAP+8
CVT0EF00 EQU   CVTMAP+4
CVTTCBP  EQU   CVTMAP
CVT      EQU   CVTMAP
@NM00003 EQU   IHAQDB
*                                      END UNREFERENCED COMPONENTS
@ENDDATA EQU   *
         END   IEFAB4E8,(C'PLS2059',0701,78089)
