++USERMOD(FN07008)  /* REQUIRED PTF TO ADD ACFMAIN TO THE PPT.
  IF A ZAP IS PERFORMED INSTEAD (IEFSD060 IEFSDPPT), THE DATA IS -
     00XX C1C3C6D4,C1C9D540,CA10FFFF,20000000
  THIS MACRO UPDATE IS COMPLETELY INSTALLED BY SMP APPLICATION AND
  AN IPL WITH CLPA.                       */ .
++VER(Z037) PRE(UZ23961) /* PUT 7911 */ SUP(TT70005) .
++VER(Z038) FMID(EBB1102) PRE(UZ23961 IPOBPT0) SUP(FN07004).
++UPDTE(SGIEF0PT) DISTLIB(AMODGEN) .
./ CHANGE NAME=SGIEF0PT
         SPACE 1                                                TT70015
         DC    CL8'ACFMAIN '       ACF2 MAIN PROCESSOR          TT70015
         DC    AL1(PPTNCNCL+PPTSKEY+PPTSYSTK+PPTNOPAS)          TT70015
         DC    AL1(PPTKEY1)        USE KEY 1 (LIKE JES)         TT70015
         DC    X'FFFF'                                          TT70015
         DC    AL1(PPTN2LP)                                     TT70015
         DC    XL3'00'                                          TT70015
