//LL51289P JOB (LLSPS-X0569-9,00910),'DONALD J LOURIE',MSGCLASS=A,
//         NOTIFY=LL51289
//         EXEC PGM=SPQESCAX,PARM=Y
//STEPLIB  DD  DISP=SHR,DSN=LLSPS.TLMS.X0556.XLIBLIB
//LIST     DD  SYSOUT=*
//SYSABEND DD  SYSOUT=*
//         EXEC PGM=SPQESCAX,COND=EVEN
//STEPLIB  DD  DISP=SHR,DSN=LLSPS.TLMS.X0556.XLIBLIB
//LIST     DD  SYSOUT=*
//SYSABEND DD  SYSOUT=*
