         MACRO
         SGIED500
.*A-000000-999999                                              @Y02X6G0
.*CHANGE ACTIVITY AS FOLLOWS:                                  @ZA02614
.*A804000                                                      @ZA02614
.*C180000,190000.236000,280000,284000,370000,400000,460000     @Z30X8GP
.*C463000,510000,530000,596000                                 @Z30X8GP
.*D232000,233000,234000,235000,239000,265000,238000            @Z30X8GP
.*A468000,504000,636000,678000,702000,774000,786000            @G36XRGG
.*D438000,474000,808000                                        @G36XRGG
.*C564000,570000,804000                                        @G36XRGG
.*C470000                                                      @OY19405
.*C499000                                                      @OZ24056
.*C471600                                                      @OZ37657
.*A582000                                                      @OX23742
.*C509000                                                      @OZ44794
.*A432000                                                      @OZ64735
.*
.*             VERSION  DATED 11/14/74                         @Z30X8GP
.*
         COPY  SGGBLPAK
.*
         AIF   (NOT &SGDMGTB(4)).TCAM
.*
.*             BTAM ONLINE TERMINAL TEST
.*
         PUNCH ' COPY OUTDD=LPALIB,INDD=AOS20'
         PUNCH ' SELECT MEMBER=(IGC0006F,IGC0106F,IGC0206F)'
         PUNCH ' SELECT MEMBER=(IGC0306F,IGC0406F,IGC0506F)'
         PUNCH ' SELECT MEMBER=(IGC0606F,IGC0706F,IGC0806F)'
         PUNCH ' SELECT MEMBER=(IGC0906F,IGC0A06F,IGC0B06F)'
         PUNCH ' SELECT MEMBER=(IGC0C06F,IGC0D06F,IGC0E06F)'
         PUNCH ' SELECT MEMBER=(IGC0F06F)'
         PUNCH ' SELECT MEMBER=(IGC1006F,IGC1106F,IGC1206F)'
         PUNCH ' SELECT MEMBER=(IGC1306F,IGC1406F)'
.*
.*             BTAM ERROR ROUTINES
.*
         PUNCH ' SELECT MEMBER=(IGE0004A)'
         PUNCH ' SELECT MEMBER=(IGE0104A,IGE0204A,IGE0304A)'
         PUNCH ' SELECT MEMBER=(IGE0404A,IGE0504A,IGE0604A)'
         PUNCH ' SELECT MEMBER=(IGE0704A,IGE0804A,IGE0904A)'
         PUNCH ' SELECT MEMBER=(IGE0004B,IGE0104B,IGE0204B)'
         PUNCH ' SELECT MEMBER=(IGE0304B,IGE0404B,IGE0504B)'
         PUNCH ' SELECT MEMBER=(IGE0604B,IGE0704B,IGE0804B)'
         PUNCH ' SELECT MEMBER=(IGE0004C,IGE0104C,IGE0204C)'
         PUNCH ' SELECT MEMBER=(IGE0304C,IGE0404C,IGE0504C)'
         PUNCH ' SELECT MEMBER=(IGE0604C,IGE0704C,IGE0804C)'
         PUNCH ' SELECT MEMBER=(IGE0904B,IGE0904C)'
.*
.*             BTAM READ/WRITE MODULES, APPENDAGES,
.*             AND REQUEST/RELEASE BUFFER MODULES
.*
         PUNCH ' SELECT MEMBER=(IGG019LP)'
         PUNCH ' SELECT MEMBER=(IGG019PA,IGG019PI,IGG019PK)'
.*
.*             BTAM DEVICE I/O MODULES
.*
         PUNCH ' SELECT MEMBER=(IGG019MD,IGG019ME,IGG019MF)'
         PUNCH ' SELECT MEMBER=(IGG019MI,IGG019MJ,IGG019MK)'
         PUNCH ' SELECT MEMBER=(IGG019ML,IGG019MN,IGG019MP)'
         PUNCH ' SELECT MEMBER=(IGG019MT,IGG019MU,IGG019MV)'
         PUNCH ' SELECT MEMBER=(IGG019MW,IGG019MX,IGG019MY)'
         PUNCH ' SELECT MEMBER=(IGG019MZ,IGG019M0,IGG019M1)'
         PUNCH ' SELECT MEMBER=(IGG019M2,IGG019M3,IGG019M4)'
         PUNCH ' SELECT MEMBER=(IGG019M5,IGG019M6)'
         PUNCH ' SELECT MEMBER=(IGG019PB,IGG019PC)'
         PUNCH ' SELECT MEMBER=(IGG019PE,IGG019PF,IGG019PG)'
         PUNCH ' SELECT MEMBER=(IGG019PH,IGG019PL,IGG019PM)'
         PUNCH ' SELECT MEMBER=(IGG019PN,IGG019PO,IGG019PP)'
         PUNCH ' SELECT MEMBER=(IGG019PQ,IGG019UP)'
.*
.*             BTAM OPEN/CLOSE EXECUTORS
.*
         PUNCH ' SELECT MEMBER=(IGG0193M,IGG0193Q,IGG0193S)'
         PUNCH ' SELECT MEMBER=(IGG0194N,IGG0194P,IGG0194Q)'
         PUNCH ' SELECT MEMBER=(IGG0203M)'
.*
.*
.TCAM    ANOP
         AIF   (NOT &SGDMGTB(5)).REMANAL
         PUNCH ' COPY OUTDD=LPALIB,INDD=AOS21'
         PUNCH ' SELECT MEMBER=(IGC0E05A,IGC0J05B)'            @OZ64735
         PUNCH ' SELECT MEMBER=((IEDQEB,IGC0010B))'
         PUNCH ' SELECT MEMBER=(IEDQOT01)'
.*
.*             TCAM OPERATOR CONTROL MODULES
.*
         PUNCH ' SELECT MEMBER=(IGCAA10D,IGCAB10D,IGCAC10D)'   @G36XRGG
         PUNCH ' SELECT MEMBER=(IGCAD10D,IGCAE10D,IGCAF10D)'   @G36XRGG
         PUNCH ' SELECT MEMBER=(IGCAG10D,IGCAL10D,IGCAT10D)'   @G36XRGG
         PUNCH ' SELECT MEMBER=(IGCA010D,IGCA110D,IGCA210D)'   @G36XRGG
         PUNCH ' SELECT MEMBER=(IGCA310D,IGCA410D,IGCA510D)'   @G36XRGG
         PUNCH ' SELECT MEMBER=(IGCA610D,IGCA710D,IGCA810D)'   @G36XRGG
         PUNCH ' SELECT MEMBER=(IGCA910D)'                     @G36XRGG
         PUNCH ' SELECT MEMBER=(IGCC010D,IGCC110D,IGCI210D)'   @G36XRGG
         PUNCH ' SELECT MEMBER=(IGCDB10D,IGCDL10D,IGCDM10D)'   @OZ24056
         PUNCH ' SELECT MEMBER=(IGCI310D,IGCMZ10D)'            @OY19405
         PUNCH ' SELECT MEMBER=(IGCMB10D,IGCMD10D,IGCME10D)'   @ZM46712
         PUNCH ' SELECT MEMBER=(IGCMF10D,IGCMG10D,IGCMH10D)'   @G36XRGG
         PUNCH ' SELECT MEMBER=(IGCMI10D,IGCMK10D,IGCML10D)'   @G36XRGG
         PUNCH ' SELECT MEMBER=(IGCMN10D,IGCMP10D)'            @G36XRGG
         PUNCH ' SELECT MEMBER=(IGCMV10D,IGCMY10D,IGCN010D)'   @G36XRGG
         PUNCH ' SELECT MEMBER=(IGCN410D,IGCN510D)'            @G36XRGG
         PUNCH ' SELECT MEMBER=(IGCSW10D)'                     @G36XRGG
         PUNCH ' SELECT MEMBER=(IGCVA10D,IGCVI10D)'            @G36XRGG
         PUNCH ' SELECT MEMBER=(IGC0G10D,IGC0H10D)'            @ZM46722
         PUNCH ' SELECT MEMBER=(IGC0I10D,IGC0J10D)'            @OZ37657
         PUNCH ' SELECT MEMBER=(IGC0K10D,IGC0L10D,IGC0N10D)'   @G36XRGG
         PUNCH ' SELECT MEMBER=(IGCDC10D,IGCDD10D)'            @G36XRGU
         PUNCH ' SELECT MEMBER=(IGCD010D,IGCD110D,IGCD210D)'
         PUNCH ' SELECT MEMBER=(IGCD310D,IGCD410D,IGCD510D)'
         PUNCH ' SELECT MEMBER=(IGCD610D,IGCD710D,IGCD810D)'
         PUNCH ' SELECT MEMBER=(IGCD910D)'
         PUNCH ' SELECT MEMBER=(IGCFA10D,IGCFB10D)'            @G36XRGG
         PUNCH ' SELECT MEMBER=(IGCFC10D,IGCFE10D,IGCFF10D)'   @G36XRGG
         PUNCH ' SELECT MEMBER=(IGCFG10D,IGCFH10D,IGCFI10D)'   @G36XRGG
         PUNCH ' SELECT MEMBER=(IGCFJ10D,IGCFK10D,IGCFL10D)'   @G36XRGG
         PUNCH ' SELECT MEMBER=(IGCFP10D,IGCFQ10D,IGCFR10D)'   @OZ44794
         PUNCH ' SELECT MEMBER=(IGCH010D,IGCI010D,IGCI110D)'
         PUNCH ' SELECT MEMBER=(IGCMA10D)'                     @Z30X8GP
         PUNCH ' SELECT MEMBER=(IGCMM10D)'                     @Z30X8GP
         PUNCH ' SELECT MEMBER=(IGCMR10D,IGCMS10D,IGCMT10D)'
         PUNCH ' SELECT MEMBER=(IGCMU10D)'                     @Z30X8GP
         PUNCH ' SELECT MEMBER=(IGCM010D,IGCM110D,IGCM210D)'
         PUNCH ' SELECT MEMBER=(IGCM310D)'
         PUNCH ' SELECT MEMBER=(IGCM410D,IGCM510D,IGCM610D)'
         PUNCH ' SELECT MEMBER=(IGCM710D,IGCM810D,IGCM910D)'
         PUNCH ' SELECT MEMBER=(IGCR010D,IGCT010D)'            @G36XRGG
         PUNCH ' SELECT MEMBER=(IGCT110D,IGCT210D)'            @G36XRGG
         PUNCH ' SELECT MEMBER=(IGCVE10D,IGCVF10D)'            @Z30X8GP
         PUNCH ' SELECT MEMBER=(IGCVG10D)'
         PUNCH ' SELECT MEMBER=(IGCVK10D)'                     @OX23742
         PUNCH ' SELECT MEMBER=(IGCV010D,IGCV110D,IGCV210D)'
         PUNCH ' SELECT MEMBER=(IGCV310D,IGCV410D,IGCV510D)'
         PUNCH ' SELECT MEMBER=(IGCV610D,IGCV710D)'
         PUNCH ' SELECT MEMBER=(IGCV810D,IGCV910D)'
         PUNCH ' SELECT MEMBER=(IGCZ010D,IGCZ110D)'
.*
         PUNCH ' SELECT MEMBER=(IGC0A10D,IGC0B10D,IGC0C10D)'
         PUNCH ' SELECT MEMBER=(IGC0D10D,IGC0E10D)'            @Z30X8GP
         PUNCH ' SELECT MEMBER=(IGC0010D,IGC0110D)'            @Z30X8GP
         PUNCH ' SELECT MEMBER=(IGC0210D)'                     @G36XRGG
         PUNCH ' SELECT MEMBER=(IGC0310D,IGC0410D,IGC0510D)'
         PUNCH ' SELECT MEMBER=(IGC0610D,IGC0710D,IGC0810D)'
         PUNCH ' SELECT MEMBER=(IGC0910D)'
.*
.*             TCAM ERROR RECOVERY MODULES
.*
         PUNCH ' SELECT MEMBER=(IGE0004G)'                     @Z30X8GP
         PUNCH ' SELECT MEMBER=(IGE0004I)'                     @G36XRGG
         PUNCH ' SELECT MEMBER=(IGE0104G)'                     @Z30X8GP
         PUNCH ' SELECT MEMBER=(IGE0204G)'
         PUNCH ' SELECT MEMBER=(IGE0304G,IGE0404G,IGE0504G)'
         PUNCH ' SELECT MEMBER=(IGE0604G,IGE0804G,IGE0904G)'
         PUNCH ' SELECT MEMBER=(IGE0904I)'                     @G36XRGG
         PUNCH ' SELECT MEMBER=(IGE0004H,IGE0104H,IGE0204H)'
         PUNCH ' SELECT MEMBER=(IGE0404H,IGE0504H,IGE0804H)'
         PUNCH ' SELECT MEMBER=(IGE0904H)'                     @Z30X8GP
.*
.*             TCAM OPEN/CLOSE MODULES
.*
         PUNCH ' SELECT MEMBER=(IGG01930,IGG01931)'            @Z30X8GP
         PUNCH ' SELECT MEMBER=(IGG01933,IGG01934,IGG01935)'
         PUNCH ' SELECT MEMBER=(IGG01936,IGG01937,IGG01938)'
         PUNCH ' SELECT MEMBER=(IGG01939,IGG01940,IGG01941)'
         PUNCH ' SELECT MEMBER=(IGG01942,IGG01943,IGG01944)'
         PUNCH ' SELECT MEMBER=(IGG01945,IGG01946)'
         PUNCH ' SELECT MEMBER=(IGG01948,IGG01949,IGG0194B)'
         PUNCH ' SELECT MEMBER=(IGG0198B)'                     @Z30X8GP
         PUNCH ' SELECT MEMBER=(IGG0198D,IGG0198E)'            @G36XRGG
         PUNCH ' SELECT MEMBER=(IGG0203B)'                     @Z30X8GP
         PUNCH ' SELECT MEMBER=(IGG02030,IGG02035,IGG02036)'
         PUNCH ' SELECT MEMBER=(IGG02041,IGG02046)'            @ZM46723
.*                                                             @ZA02614
.*             SECOND LOAD OF TCAM ABEND FORMAT MODULE         @ZA02614
.*                                                             @ZA02614
.*
.*
.*             REMOTE ANALYSIS SUPPORT
.*
.REMANAL ANOP
         AIF   (NOT &SGDCLSB(72)).END
         PUNCH ' COPY OUTDD=LPALIB,INDD=AOS06'
         PUNCH ' SELECT MEMBER=(IGE0019I,IGE0119I)'
.*
.END     MEND
