         MACRO
         SGIEA3IL
         COPY  SGGBLPAK
.*  TEST FOR 3270 AND BTAM
         AIF  (&SGDCLSB(80) AND &SGDMGTB(4)).INCLDIL
.*  ESR CODES FOR 3270 SUPPORT NOT VALID
         PUNCH '          CHANGE IECTRDIL(IGXERR1)'
         PUNCH '          CHANGE IECTATRL(IGXERR1)'
         PUNCH '          CHANGE IECTCHSL(IGXERR1)'
         PUNCH '          CHANGE IECTCHAL(IGXERR1)'
         PUNCH '          CHANGE IECTRSTL(IGXERR1)'
         AGO    .INCLES1        INCLUDE ESR
.INCLDIL PUNCH '         INCLUDE AOS20(IECTSVC)'
.INCLES1 PUNCH '         INCLUDE AOSC5(IGC116)'
         PUNCH '         INCLUDE AOSC5(IGC109)'
         PUNCH '         INCLUDE AOSC5(IGC122)'
         MEND
