         MACRO
         SGIED510
.*
.*   THIS SYSGEN MACRO, WHICH COPIES BTAM MODULES INTO
.*   LPALIB, HAS THE FOLLOWING DEPENDENCIES:
.*
.*      1. THE SYSTEM GENERATE MACRO MUST CALL SGIED510.
.*
.* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
.*                   *** CHANGE ACTIVITY ***
.*
.*       ZA43136   (11/09/79)           ZA42647   (04/18/80)
.*       ZA86615   (03/11/85)           ZA89880   (07/17/85)
.*
.* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
.*  APAR OZ86615: SGIED510 NOW COPIES ALL BTAM MODULES PREVIOUSLY
.*  COPIED BY TCAM SYSGEN MACRO SGIED500.
.* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
.*
.*                 VERSION DATED 07/01/79
.*
         COPY SGGBLPAK                                         @ZA86615
.*
         AIF  (NOT &SGDMGTB(4)).NOBTAM
         PUNCH ' COPY OUTDD=LPALIB,INDD=AOS20'
.*
.*             BTAM LOCAL ERROR RECOVERY                       @ZA86615
.*
         PUNCH ' SELECT MEMBER=(IGE0004D)'
.*
.*             BTAM ONLINE TERMINAL TEST                       @ZA86615
.*
         PUNCH ' SELECT MEMBER=(IGC0006F,IGC0106F,IGC0206F)'   @ZA86615
         PUNCH ' SELECT MEMBER=(IGC0306F,IGC0406F,IGC0506F)'   @ZA86615
         PUNCH ' SELECT MEMBER=(IGC0606F,IGC0706F,IGC0806F)'   @ZA86615
         PUNCH ' SELECT MEMBER=(IGC0906F,IGC0A06F,IGC0B06F)'   @ZA86615
         PUNCH ' SELECT MEMBER=(IGC0C06F,IGC0D06F,IGC0E06F)'   @ZA86615
         PUNCH ' SELECT MEMBER=(IGC0F06F)'                     @ZA86615
         PUNCH ' SELECT MEMBER=(IGC1006F,IGC1106F,IGC1206F)'   @ZA86615
         PUNCH ' SELECT MEMBER=(IGC1306F,IGC1406F)'            @ZA86615
.*
.*             BTAM ERROR ROUTINES                             @ZA86615
.*
         PUNCH ' SELECT MEMBER=(IGE0004A)'                     @ZA86615
         PUNCH ' SELECT MEMBER=(IGE0104A,IGE0204A,IGE0304A)'   @ZA86615
         PUNCH ' SELECT MEMBER=(IGE0404A,IGE0504A,IGE0604A)'   @ZA86615
         PUNCH ' SELECT MEMBER=(IGE0704A,IGE0804A,IGE0904A)'   @ZA86615
         PUNCH ' SELECT MEMBER=(IGE0004B,IGE0104B,IGE0204B)'   @ZA86615
         PUNCH ' SELECT MEMBER=(IGE0304B,IGE0404B,IGE0504B)'   @ZA86615
         PUNCH ' SELECT MEMBER=(IGE0604B,IGE0704B,IGE0804B)'   @ZA86615
         PUNCH ' SELECT MEMBER=(IGE0004C,IGE0104C,IGE0204C)'   @ZA86615
         PUNCH ' SELECT MEMBER=(IGE0304C,IGE0404C,IGE0504C)'   @ZA86615
         PUNCH ' SELECT MEMBER=(IGE0604C,IGE0704C,IGE0804C)'   @ZA86615
         PUNCH ' SELECT MEMBER=(IGE0904B,IGE0904C)'            @ZA86615
.*
.*             BTAM READ/WRITE MODULES, APPENDAGES,            @ZA86615
.*             AND REQUEST/RELEASE BUFFER MODULES              @ZA86615
.*
         PUNCH ' SELECT MEMBER=(IGG019LP)'                     @ZA86615
         PUNCH ' SELECT MEMBER=(IGG019PA,IGG019PI,IGG019PK)'   @ZA86615
.*
.*             BTAM DEVICE I/O MODULES                         @ZA86615
.*
         PUNCH ' SELECT MEMBER=(IGG019MD,IGG019ME,IGG019MF)'   @ZA86615
         PUNCH ' SELECT MEMBER=(IGG019MI,IGG019MJ,IGG019MK)'   @ZA86615
         PUNCH ' SELECT MEMBER=(IGG019ML,IGG019MN,IGG019MP)'   @ZA86615
         PUNCH ' SELECT MEMBER=(IGG019MT,IGG019MU,IGG019MV)'   @ZA86615
         PUNCH ' SELECT MEMBER=(IGG019MW,IGG019MX,IGG019MY)'   @ZA86615
         PUNCH ' SELECT MEMBER=(IGG019MZ,IGG019M0,IGG019M1)'   @ZA86615
         PUNCH ' SELECT MEMBER=(IGG019M2,IGG019M3,IGG019M4)'   @ZA86615
         PUNCH ' SELECT MEMBER=(IGG019M5,IGG019M6)'            @ZA86615
         PUNCH ' SELECT MEMBER=(IGG019PB,IGG019PC)'            @ZA86615
         PUNCH ' SELECT MEMBER=(IGG019PE,IGG019PF,IGG019PG)'   @ZA86615
         PUNCH ' SELECT MEMBER=(IGG019PH,IGG019PL,IGG019PM)'   @ZA86615
         PUNCH ' SELECT MEMBER=(IGG019PN,IGG019PO,IGG019PP)'   @ZA86615
         PUNCH ' SELECT MEMBER=(IGG019PQ,IGG019UP)'            @ZA86615
.*
.*             BTAM OPEN/CLOSE EXECUTORS                       @ZA86615
.*
         PUNCH ' SELECT MEMBER=(IGG0193M,IGG0193Q,IGG0193S)'   @ZA86615
         PUNCH ' SELECT MEMBER=(IGG0194N,IGG0194P,IGG0194Q)'   @ZA86615
         PUNCH ' SELECT MEMBER=(IGG0203M)'                     @ZA86615
.*
.NOBTAM  MEND
