*        %GOTO IOPLBSL  ; /*
         MACRO
         IKJIOPL
IOPL     DSECT
***********************************************************************
*    THE I/O SERVICE ROUTINE PARAMETER LIST (IOPL) IS A LIST OF       *
*    FULLWORD ADDRESSES PASSED BY THE INVOKER OF ANY I/O SERVICE      *
*    ROUTINE TO THE APPROPRIATE SERVICE ROUTINE VIA REGISTER ONE.     *
***********************************************************************
         SPACE
IOPLUPT  DS    A        PTR TO UPT
IOPLECT  DS    A        PTR TO ECT
IOPLECB  DS    A        PTR TO USER'S ECB
IOPLIOPB DS    A        PTR TO THE I/O SERVICE RTN PARM BLOCK
**/
         MEND
* %IOPLBSL :  ;
* %IF IOPLSTORAGE='' %THEN           /*                     @ZA29467 */
*   %IOPLSTORAGE='BASED(IOPLPTR)';   /*                     @ZA29467 */
* DECLARE
*   1 IOPL IOPLSTORAGE,              /*                     @ZA29467 */
* /* *************************************************************** */
* /* THE I/O SERVICE ROUTINE PARAMETER LIST (IOPL) IS A LIST OF      */
* /* FULLWORD ADDRESSES PASSED BY THE INVOKER OF ANY I/O SERVICE     */
* /* ROUTINE TO THE APPROPRIATE SERVICE ROUTINE VIA REGISTER ONE.    */
* /* *************************************************************** */
*
*
*
*
*
*
*
*
*
*
*    2 IOPLUPT  PTR(31),             /* PTR TO UPT                   */
*    2 IOPLECT  PTR(31),             /* PTR TO ECT                   */
*    2 IOPLECB  PTR(31),             /* PTR TO USER'S ECB            */
*    2 IOPLIOPB PTR(31);    /* PTR TO THE I/O SERVICE RTN PARM BLOCK */
*
