         TITLE 'IGG0CLC9, VSAM CATALOG, FIRST LOAD                     *
                        '
         MACRO
         RLDSBREG &NAME
         AIF (T'&NAME NE 'U').SKIP
         LA 10,4095(0,12)              RELOAD BASE REG 2
.SKIP    MEND
IGG0CLC9 CSECT ,                                                   0002
@MAINENT DS    0H                                                  0002
         USING *,@15                                               0002
         B     @PROLOG                                             0002
         DC    AL1(16)                                             0002
         DC    C'IGG0CLC9  78.171'                                 0002
         DROP  @15
@PROLOG  DS    0H                                                  0003
*   R2=R12;                         /* ADDR CONTROLLERS WA   @ZA29164*/
         LR    R2,R12                                              0202
*   R12=R15;                        /* COPY BASE VALUE       @ZA29164*/
         LR    R12,R15                                             0203
*   R3=R14;                         /* SAVE RETURN ADDRESS   @ZA29164*/
         LR    R3,R14                                              0204
*   RFY                                                            0205
*    (R14,                                                         0205
*     R15) UNRSTD;                  /*                       @ZA29164*/
*   RFY                                                            0206
*     IGC0002F BASED(R2);           /*                       @ZA29164*/
*   GEN(USING @MAINENT,R12);        /* ADDRESSABILITY        @ZA29164*/
         USING @MAINENT,R12
*   GEN(LA 10,4095(0,12));          /* SECOND BASE REGISTER  @ZA29164*/
         LA 10,4095(0,12)
*   GEN(USING @MAINENT+4095,10);    /* ADDRESSABILITY BASE 2 @ZA29164*/
         USING @MAINENT+4095,10
*   IF R1=ZERO                      /* IS THIS A RECURSIVE CALL      */
*     THEN                                                         0210
         LTR   R1,R1                                               0210
         BNZ   @RF00210                                            0210
*     DO;                           /* YES                           */
*       GEN(SPKA 0);                /* SET KEY TO ZERO               */
*                                                                  0212
         SPKA 0
*       /*************************************************************/
*       /*                                                           */
*       /* CALL TO MODULE IGG0CLBP                                   */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0213
*Z003RET1:                                                         0213
*       DO;                                                        0213
Z003RET1 DS    0H                                                  0214
*         CALL IGGPRET1;                                           0214
         L     @15,@CV03899                                        0214
         BALR  @14,@15                                             0214
*         GEN(RLDSBREG IGGPRET1);   /* RELOAD SECONDARY BASE REG     */
         RLDSBREG IGGPRET1
*       END;                        /* RETURN TO IGGPDEXT    @ZA29164*/
*     END;                                                         0217
*   ELSE                                                           0218
*     ;                             /* NO RECURSIVE CALL             */
@RF00210 DS    0H                                                  0219
*   RFY                                                            0219
*     R5 RSTD;                      /* CPL PTR               @ZA29164*/
*   R5=R1;                          /* SET CPL POINTER               */
         LR    R5,R1                                               0220
*   RFY                                                            0221
*    (R0,                                                          0221
*     R1,                                                          0221
*     R8,                                                          0221
*     R9) RSTD;                     /*                       @ZA29164*/
*   R11=ADDR(ACCA);                 /* CCA BASE REGISTER     @ZA29164*/
*                                                                  0222
         LA    R11,ACCA(,R2)                                       0222
*   /*****************************************************************/
*   /*                                                               */
*   /* CLEAR CCA IN CONTROLLERS WORK AREA                    @ZA29164*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0223
*   R0=R11;                         /* POINT TO CCA          @ZA29164*/
         LR    R0,R11                                              0223
*   R1=(((LENGTH(IGGCCA)+511)/512)*512);/* SIZE OF CCA       @ZA29164*/
         LA    R1,2048                                             0224
*   R9=ZERO;                        /* SET PADDING CHAR      @ZA29164*/
         SLR   R9,R9                                               0225
*   GEN(MVCL R0,R8);                /* CLEAR CCA             @ZA29164*/
         MVCL R0,R8
*   RFY                                                            0227
*    (R0,                                                          0227
*     R1,                                                          0227
*     R8,                                                          0227
*     R9) UNRSTD;                   /*                       @ZA29164*/
*   R13=ADDR(CCAREGS)-12;           /* SET REGISTER 13       @ZA29164*/
         LA    R13,CCAREGS(,R11)                                   0228
         SL    R13,@CF00075                                        0228
*Z004BCCA:                                                         0229
*   DO;                                                            0229
Z004BCCA DS    0H                                                  0230
*     CALL IGGPBCCA;                                               0230
         BAL   @14,IGGPBCCA                                        0230
*     GEN(RLDSBREG IGGPBCCA);       /* RELOAD SECONDARY BASE REG     */
         RLDSBREG IGGPBCCA
*   END;                            /* INITIALIZE THE CCA    @ZA29164*/
*   RFY                                                            0233
*     CTGPL BASED(CCACPL);                                         0233
*                                                                  0233
*   /*****************************************************************/
*   /*                                                               */
*   /* CALL TO MODULE IGG0CLAB                                       */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0234
*Z005ACDV:                                                         0234
*   DO;                                                            0234
Z005ACDV DS    0H                                                  0235
*     CALL IGGPACDV;                                               0235
         L     @15,@CV03719                                        0235
         BALR  @14,@15                                             0235
*     GEN(RLDSBREG IGGPACDV);       /* RELOAD SECONDARY BASE REG     */
         RLDSBREG IGGPACDV
*   END;                            /* CALL CAT MGMT DRIVER  @ZA29164*/
*Z006RCU:                                                          0238
*   DO;                                                            0238
Z006RCU  DS    0H                                                  0239
*     CALL IGGPRCU;                                                0239
         BAL   @14,IGGPRCU                                         0239
*     GEN(RLDSBREG IGGPRCU);        /* RELOAD SECONDARY BASE REG     */
         RLDSBREG IGGPRCU
*   END;                            /* REQUEST CLEANUP       @ZA29164*/
*   RFY                                                            0242
*     R5 UNRSTD;                                                   0242
*   GEN(USING @MAINENT,@15);        /* INDICATE AVAILABLE BASE REG   */
         USING @MAINENT,@15
*   GEN REFS(CCATEMPS)(USING @DATD-(CCATEMPS-IGGCCA),R11);         0244
         USING @DATD-(CCATEMPS-IGGCCA),R11
*   GEN(DS 0F);                     /* FULLWORD BOUNDARY ALIGNMENT   */
         DS 0F
*   GEN(DC CL8'IGGPBCCA');          /* NAME OF FOLLOWING PROCEDURE   */
         DC CL8'IGGPBCCA'
         EJECT
*                                                                  0247
*/********************************************************************/
*/*                                                                  */
*/*        IGGPBCCA  -  PROCEDURE  INTERNALLY  CALLED  NESTED        */
*/*                                                                  */
*/********************************************************************/
*                                                                  0247
*IGGPBCCA:                                                         0247
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);/* SPECIFY PROCEDURE OPTIONS     */
@EL00001 DS    0H                                                  0247
@EF00001 DS    0H                                                  0247
@ER00001 BR    @14                                                 0247
IGGPBCCA DS    0H                                                  0248
*   GEN(DROP @15);                  /* DROP AVAILABLE BASE REGISTER  */
         DROP @15
*Z007:                              /* LABEL FOR PROCEDURE TRACKING  */
*Z007BCCA:                          /* LABEL FOR PROCEDURE TRACKING  */
*   RFY                                                            0249
*    (R5,                                                          0249
*     R6,                                                          0249
*     R7,                                                          0249
*     R8,                                                          0249
*     R9) UNRSTD;                   /* PL/S COMPILER WORK REGISTERS  */
Z007     DS    0H                                                  0249
Z007BCCA DS    0H                                                  0250
*   RFY                                                            0250
*    (R2,                                                          0250
*     R3,                                                          0250
*     R4) RSTD;                     /* RESTRICT LOCAL WORK REGISTERS */
*   GEN(STM 12,14,12(13));          /* SAVE REGISTERS OF CALLER      */
         STM 12,14,12(13)
*   GEN(LA 13,12(13));              /* POINT TO NEXT SAVE AREA       */
         LA 13,12(13)
*/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
**                                                                    *
**   PROCEDURE NAME = IGGPBCCA                                @ZA29164*
**                                                                    *
**   DESCRIPTIVE NAME = BUILD CCA                                     *
**                                                                    *
**   FUNCTION =                                                       *
**      INITIALIZES THE CCA WHICH RESIDES IN THE CONTROLLERS          *
**      WORK AREA (IFC0002F) AT SYMBOLIC LOCATION ACCA. ISSUES        *
**      GETMAIN SUBPOOL 229 FOR SIX 512-BYTE RECORD AREAS AND @ZA29164*
**      A 5K-BYTE CATALOG INTEGRITY WORK AREA IF THE CALLER   @ZA29164*
**      IS EITHER IN SUPERVISOR STATE, SYSTEM KEY, TRANS-     @ZA29164*
**      LATED REQUEST, OR APF AUTHORIZED. IF THE CALLER IS    @ZA29164*
**      NON OF THESE, THE VSAM CATALOG INTERFACE (I.E., CPL,  @ZA29164*
**      FPL'S, FVT'S, USER WORKAREAS, ETC.) ARE VALIDITY      @ZA29164*
**      CHECKED AND MOVED INTO KEY 0, FETCH PROTECTED CORE.   @ZA29164*
**      THIS IS DONE BEFORE ANY ACTUAL VSAM CATALOG FUNCTION  @ZA29164*
**      IS PERFORMED. WHEN THE CATALOG REQUEST IS COMPLETE,   @ZA29164*
**      THE CATALOG INTERFACE BLOCKS ARE MOVED BACK TO USERS  @ZA29164*
**      STORAGE AND CONTROL IS RETURN TO THE CALLER.          @ZA29164*
**      CHECKS RESUME PSW IN CALLERS RB, IF CALLER IS AUTHORIZED      *
**      SETS SYSTEM CALLER BIT IN CCA.                                *
**                                                                    *
**      NOTES =                                               @ZA29164*
**                                                            @ZA29164*
**        REGISTER CONVENTIONS =                              @ZA29164*
**           R0-R1     WORK REGISTERS             VOLATILE    @ZA29164*
**           R2-R4     WORK REGISTERS             VOLATILE    @ZA29164*
**           R5-R9     COMPILER/WORK REGS         VOLATILE    @ZA29164*
**           R10       BASE REGISTER 2            VOLATILE    @ZA29164*
**           R11       CCA POINTER                SAVED       @ZA29164*
**           R12       BASE REGISTER 1         SAVED/RESTORED @ZA29164*
**           R13       SAVEAREA POINTER        SAVED/RESTORED @ZA29164*
**           R14       RETURN REGISTER         SAVED/RESTORED @ZA29164*
**           R15       ENTRY POINT                VOLATILE    @ZA29164*
**                                                            @ZA29164*
**      ENTRY POINT = IGGPBCCA                                @ZA29164*
**                                                            @ZA29164*
**        LINKAGE = CALL                                      @ZA29164*
**           CALLED BY IGG0CLC9 TO INITIALIZE THE CCA,        @ZA29164*
**           GETMAIN THE RECORD AREA AND IF NECESSARY THE     @ZA29164*
**           CATALOG INTEGRITY AREA.                          @ZA29164*
**                                                            @ZA29164*
**      INPUT =                                               @ZA29164*
**           R2 = CONTROLLERS WORK AREA ADDRESS               @ZA29164*
**           R3 = RETURN ADDRESS OF IGG0CLA1                  @ZA29164*
**           R5 = CPL ADDRESS                                 @ZA29164*
**           R10 = SECOND BASE REGISTER                       @ZA29164*
**           R11 = CCA ADDRESS                                @ZA29164*
**           R12 = FIRST BASE REGISTER                        @ZA29164*
**           R14 = RETURN ADDRESS                             @ZA29164*
**                                                            @ZA29164*
**      OUTPUT =                                              @ZA29164*
**           CCA/RECORD AREAS BUILT AND INITIALIZED           @ZA29164*
**           NON-AUTHORIZED USERS INTERFACE IN PROTECTED      @ZA29164*
**           STORAGE.                                         @ZA29164*
**                                                            @ZA29164*
**      MESSAGES =                                            @ZA29164*
**           IEC338I - IGG0CLC9, VALIDITY CHECK FAILED ON     @ZA29164*
**                     CATALOG PARAMETER LIST STORAGE         @ZA29164*
**           IEC339I - IGG0CLC9, INSUFFICIENT STORAGE FOR     @ZA29164*
**                     VSAM CATALOG WORK AREAS                @ZA29164*
**                                                            @ZA29164*
**      EXIT-NORMAL = TO CALLER                               @ZA29164*
**                                                            @ZA29164*
**      EXIT-ERROR = IGGPVCER ROUTINE                         @ZA29164*
**                                                            @ZA29164*
**      EXTERNAL REFERENCES =                                 @ZA29164*
**                                                            @ZA29164*
**        MODULES = NONE                                      @ZA29164*
**                                                            @ZA29164*
**        DATA AREAS =                                        @ZA29164*
**           CONTROLLER'S WORKAREA, CATALOG INTERFACE         @ZA29164*
**                                                            @ZA29164*
**        CONTROL BLOCKS =                                    @ZA29164*
**                    BUILD   REFERENCE   MODIFY   DELETE     @ZA29164*
**           CCA        X        X           X                @ZA29164*
**           CPL                 X           X                @ZA29164*
**           FVT                 X                            @ZA29164*
**           FPL                 X                            @ZA29164*
**           TCB                 X                            @ZA29164*
**           RB                  X           X                @ZA29164*
**           CICB       X        X           X        X       @ZA29164*
**           CISA       X        X           X        X       @ZA29164*
**                                                            @ZA29164*
**      TABLES = NONE                                         @ZA29164*
**                                                            @ZA29164*
**      MACROS = GETMAIN                                      @ZA29164*
**               ESTAE                                        @ZA29164*
**               TESTAUTH                                     @ZA29164*
**               SETLOCK                                      @ZA29164*
**                                                            @ZA29164*
** * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
*                                                                  0253
*   RFY                                                            0253
*    (R1,                                                          0253
*     R5) RSTD;                     /*                       @ZA26164*/
*                                                                  0253
*   /*****************************************************************/
*   /*                                                               */
*   /* INITAILIZE CCA IN CONTROLLERS WORK AREA               @ZA29164*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0254
*   R1=TCBRBP;                      /* CURRENT RB            @X04SVSM*/
         L     @15,CVTPTR                                          0254
         L     @15,CVTTCBP(,@15)                                   0254
         L     @15,TCBPTR(,@15)                                    0254
         L     R1,TCBRBP(,@15)                                     0254
*   CCATCB=ADDR(TCB);               /* TCB ADDRESS           @ZA26164*/
         ST    @15,CCATCB(,R11)                                    0255
*   CCARB=CCATCB->TCBRBP;           /* SET RB PTR                    */
         L     @00,TCBRBP(,@15)                                    0256
         ST    @00,CCARB(,R11)                                     0256
*   CTLWAPTR=R2;                    /* CONTROLLERS WA PTR    @Y30SSSM*/
         ST    R2,CTLWAPTR(,R1)                                    0257
*   CCACWAP=R2;                     /* CONTROLLERS WA PTR    @ZA26164*/
         ST    R2,CCACWAP(,R11)                                    0258
*   CLA1ADR=R3;                     /* SAVE EXT CALLER ADDR  @Y30SSSM*/
         ST    R3,CLA1ADR(,R1)                                     0259
*   CCAR14S=R3;                     /* SAVE RET ADDR IN CCA  @ZA26164*/
         ST    R3,CCAR14S(,R11)                                    0260
*   CPLSAV=R5;                      /* CALLERS CPL ADDR      @Y30SSSM*/
         ST    R5,CPLSAV(,R1)                                      0261
*   CCACPL=R5;                      /* ADDR OF CPL           @Y30SSSM*/
         ST    R5,CCACPL(,R11)                                     0262
*   RFY                                                            0263
*     R5 UNRSTD;                    /*                       @ZA29164*/
*   CCAOCPL=CCACPL;                 /* SAVE ORIGINAL CPL ADR @ZA29164*/
*                                                                  0264
         L     @05,CCACPL(,R11)                                    0264
         ST    @05,CCAOCPL(,R11)                                   0264
*   /*****************************************************************/
*   /*                                                               */
*   /*                                                         Y02020*/
*   /* ESTABLISH RECOVERY ENVIRONMENT                          Y02020*/
*   /*                                                         Y02020*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0265
*   RFY                                                            0265
*    (R9) RSTD;                     /*                         Y02020*/
*   R9=ADDR(RIPLSA);                /* PT TO LOCAL RSA         Y02020*/
         LA    R9,CCAREGS(,R11)                                    0266
         AL    R9,@CF00075                                         0266
*   GEN(STM 10,8,0(9));             /* SAVE LOCAL REGS         Y02020*/
         STM 10,8,0(9)
*   RIPEPA=RIPEPA&&RIPEPA;          /* CLEAR ESTAE PL AR       Y02020*/
         LA    @08,CCAREGS(,R11)                                   0268
         AL    @08,@CF00075                                        0268
         XC    RIPEPA(16,@08),RIPEPA(@08)                          0268
*   R1=ADDR(RIPEPA);                /* ESTAE MACRO P.L.        Y02020*/
         LA    R1,RIPEPA(,@08)                                     0269
*   R2=ADDR(RIPRSA);                /* ESTAE ROUT. RSA         Y02020*/
         LA    R2,RIPRSA(,@08)                                     0270
*   R3=RADCON;                      /* PTR TO RCVY ROUT        Y02020*/
         L     R3,RADCON                                           0271
*   R4=ADDR(RIPWA);                 /* RCVY ROUT WK AREA     @ZA29164*/
         LR    R4,@08                                              0272
*   GEN REFS(PSALITA,FLC,CVTMAP,CVTSV60,FLCCVT,PSA,RIPLSA12);      0273
*                                                           /* Y02020*/
           SETLOCK OBTAIN,TYPE=LOCAL,MODE=UNCOND,                      X
               RELATED=('AFTER ESTAE CALL') /*GET LCL LK       Y02020*/
           L R12,RIPLSA12(R9)           /*RESTORE BASE REG     Y02020*/
           ESTAE (3),CT,PARAM=(4),XCTL=YES,PURGE=QUIESCE,TERM=YES,     X
               BRANCH=YES,SVEAREA=(2),MF=(E,(1)) /*ACT RCVY    Y02020*/
           SETLOCK RELEASE,TYPE=LOCAL,                                 X
               RELATED=('BEFORE ESTAE CALL') /*FREE LCL LK     Y02020*/
           LM R10,R8,RIPLSA(R9)         /*RESTORE LOCAL REGS   Y02020*/
*   RFY                                                            0274
*    (R9) UNRSTD;                   /*                         Y02020*/
*   CCAID='ACCA'X;                  /* CCA ID                        */
         MVC   CCAID(2,R11),@CH03916                               0275
*   CCASZ=(((LENGTH(IGGCCA)+511)/512)*512);/* SET SIZE IN CCA      0276
*                                                            @ZA29164*/
         MVC   CCASZ(2,R11),@CH04147                               0276
*   RFY                                                            0277
*     CTGPL BASED(CCACPL);          /* BASE ON ADDR IN RB    @ZA29164*/
*   RFY                                                            0278
*     R0 RSTD;                      /*                       @ZA29164*/
*   R0=(6*512);                     /* SIZE OF RECORD AREAS  @ZA29164*/
         LA    R0,3072                                             0279
*   CCAGDGUY=ON;                    /* ASSUME AUTHORIZED     @ZA29164*/
         OI    CCAGDGUY(R11),B'00010000'                           0280
*   R1=R1->XRBLNK;                  /* GET CALLERS RB ADDR.  @ZA29164*/
         L     R1,XRBLNK(,R1)                                      0281
*   R3=RBPSWKEY;                    /* CALLERS PSW KEY       @ZA29164*/
         SLR   R3,R3                                               0282
         IC    R3,RBPSWKEY+16(,R1)                                 0282
*   SRL(R3,4);                      /* ISOLATE KEY           @ZA29164*/
         SRL   R3,4                                                0283
*   SLL(R3,4);                      /* READJUST KEY          @ZA29164*/
         SLL   R3,4                                                0284
*   GEN REFS(R3,R11) SETS(CCAUSKEY)(STC   R3,CCAUSKEY(,R11));/* SAVE
*                                      THE CALLERS PSW KEY   @ZA29164*/
         STC   R3,CCAUSKEY(,R11)
*   IF R3<PROBKEY×                  /* CALLER KEY LT 8 OR    @ZA29164*/
*       RBRPSWPS=OFF THEN           /* SUPERVISOR STATE      @ZA29164*/
         C     R3,@CF00043                                         0286
         BL    @RT00286                                            0286
         TM    RBRPSWPS+16(R1),B'00000001'                         0286
         BNZ   @RF00286                                            0286
@RT00286 DS    0H                                                  0287
*     CCASKYSS=ON;                  /* YES, SET INDICATOR    @ZA29164*/
         OI    CCASKYSS(R11),B'00100000'                           0287
*   ELSE                            /* NO                    @ZA29164*/
*     IF CALLTYPE^='00'X THEN       /* TRANSLATED REQUEST?   @ZA29164*/
         B     @RC00286                                            0288
@RF00286 CLI   CALLTYPE(R2),X'00'                                  0288
         BE    @RF00288                                            0288
*       DO;                         /* NO                    @ZA29164*/
*         GEN(STM R0,R3,12(R13));   /* SAVE REGS             @ZA29164*/
         STM R0,R3,12(R13)
*         RFY                                                      0291
*          (R14,                                                   0291
*           R15,                                                   0291
*           R0) RSTD;               /*                       @ZA29164*/
*         GEN REFS(CVT)(TESTAUTH FCTN=1,RBLEVEL=2,BRANCH=YES);/*   0292
*                                                            @ZA29164
*                                      IS CALLER AUTHORIZED  @ZA29164*/
         TESTAUTH FCTN=1,RBLEVEL=2,BRANCH=YES
*         GEN(LM R0,R3,12(R13));    /* RESTORE REGS          @ZA29164*/
         LM R0,R3,12(R13)
*         RFY                                                      0294
*           R14 UNRSTD;             /*                       @ZA29164*/
*         IF R15^=ZERO THEN         /* CALLER AUTHORIZED?    @ZA29164*/
         LTR   R15,R15                                             0295
         BZ    @RF00295                                            0295
*           DO;                     /* NO                    @ZA29164*/
*             R0=R0+(5*1024);       /* SIZE OF RECORD AREAS PLUS CICB
*                                      AND CISA.             @ZA29164*/
         AL    R0,@CF04149                                         0297
*             CCAGDGUY=OFF;         /* NON-AUTHERIZED CALLER @ZA29164*/
         NI    CCAGDGUY(R11),B'11101111'                           0298
*           END;                    /*                       @ZA29164*/
*         ELSE                                                     0300
*           ;                       /*                       @ZA29164*/
@RF00295 DS    0H                                                  0301
*       END;                        /*                       @ZA29164*/
*     ELSE                                                         0302
*       ;                           /*                       @ZA29164*/
*                                                                  0302
@RF00288 DS    0H                                                  0303
*   /*****************************************************************/
*   /*                                                               */
*   /* GET STORAGE FOR RECORD AREAS AND IF NEEDED            @ZA29164*/
*   /* THE CICB AND CISA.                                    @ZA29164*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0303
*   RFY                                                            0303
*     R15 RSTD;                     /*                       @ZA29164*/
@RC00286 DS    0H                                                  0304
*   GEN(GETMAIN RC,LV=(0),SP=229,BNDRY=PAGE  GET STORAGE);         0304
*                                                                  0304
         GETMAIN RC,LV=(0),SP=229,BNDRY=PAGE  GET STORAGE
*   /*****************************************************************/
*   /*                                                               */
*   /* CHECK RETURN CODE FROM CONDITIONAL GETMAIN            @Y30SSSM*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0305
*   IF R15=RCS THEN                 /* GETMAIN FAIL          @ZA29164*/
         LTR   R15,R15                                             0305
         BNZ   @RF00305                                            0305
*     DO;                           /* NO                    @ZA29164*/
*       RFY                                                        0307
*         R15 UNRSTD;               /*                       @ZA29164*/
*       CCAR0REC=R1;                /* RECORD AREA 0 ADDRESS @ZA29164*/
*                                                                  0308
         ST    R1,CCAR0REC(,R11)                                   0308
*       /*************************************************************/
*       /*                                                           */
*       /* CLEAR RECORD AREAS, CICB, AND CISA STORAGE        @ZA29164*/
*       /*                                                           */
*       /*************************************************************/
*                                                                  0309
*       R0=R1;                      /* POINT TO AREA         @ZA29164*/
         LR    R0,R1                                               0309
*       R1=(6*512);                 /* RECORD AREAS SIZE     @ZA29164*/
         LA    R1,3072                                             0310
*       IF CCAGDGUY=OFF THEN        /* NON-AUTHORIZED CALLER @ZA29164*/
         TM    CCAGDGUY(R11),B'00010000'                           0311
         BNZ   @RF00311                                            0311
*         R1=R1+(5*1024);           /* CICB AND CISA SIZE    @ZA29164*/
         AL    R1,@CF04149                                         0312
*       ELSE                                                       0313
*         ;                         /*                       @ZA29164*/
@RF00311 DS    0H                                                  0314
*       RFY                                                        0314
*        (R8,                                                      0314
*         R9) RSTD;                 /*                       @ZA29164*/
*       R9=ZERO;                    /* SET PADDING CHAR      @ZA29164*/
         SLR   R9,R9                                               0315
*       GEN(MVCL R0,R8);            /* CLEAR AREA            @ZA29164*/
         MVCL R0,R8
*       RFY                                                        0317
*        (R0,                                                      0317
*         R8,                                                      0317
*         R9) UNRSTD;               /*                       @ZA29164*/
*       CCAURAB=ADDR(CCARAB1);      /* POINT TO FIRST RAB    @ZA29164*/
         LA    @05,CCARAB1(,R11)                                   0318
         ST    @05,CCAURAB(,R11)                                   0318
*       CCAR1REC=CCAR0REC+512;      /* ADDR OF REC AREA 1    @ZA29164*/
         LA    @05,512                                             0319
         L     @00,CCAR0REC(,R11)                                  0319
         ALR   @00,@05                                             0319
         ST    @00,CCAR1REC(,R11)                                  0319
*       CCAR2REC=CCAR1REC+512;      /* ADDR OF REC AREA 2    @ZA29164*/
         ALR   @00,@05                                             0320
         ST    @00,CCAR2REC(,R11)                                  0320
*       CCAR3REC=CCAR2REC+512;      /* ADDR OF REC AREA 3    @ZA29164*/
         ALR   @00,@05                                             0321
         ST    @00,CCAR3REC(,R11)                                  0321
*       CCAR4REC=CCAR3REC+512;      /* ADDR OF REC AREA 4    @ZA29164*/
         ALR   @00,@05                                             0322
         ST    @00,CCAR4REC(,R11)                                  0322
*       CCAR5REC=CCAR4REC+512;      /* ADDR OF REC AREA 5    @ZA29164*/
         ALR   @00,@05                                             0323
         ST    @00,CCAR5REC(,R11)                                  0323
*       CCAMNPTR=ADDR(CCAMNADR);    /* GET/FREE MAIN LIST    @ZA29164*/
         LA    @05,CCAMNADR(,R11)                                  0324
         ST    @05,CCAMNPTR(,R11)                                  0324
*       CCAEDXFF='FF'X;             /* END OF ENQ LIST IND.  @ZA92164*/
         MVI   CCAEDXFF(R11),X'FF'                                 0325
*       CCAMNLLP=ADDR(CCAMNLL);     /* INIT LEN LST PTR      @ZA29164*/
         LA    @05,CCAMNLL(,R11)                                   0326
         ST    @05,CCAMNLLP(,R11)                                  0326
*       CCAMNLL='80'X;              /* IND SINGLE ENTRY LIST @ZA29164*/
         MVI   CCAMNLL(R11),X'80'                                  0327
*       RVCCAV=ON;                  /* MARK CCA VALID        @ZA29164*/
         OI    RVCCAV(R11),B'10000000'                             0328
*     END;                          /*                       @ZA29164*/
*   ELSE                            /* GETMAIN FAILED        @ZA29164*/
*     DO;                           /*                       @ZA29164*/
         B     @RC00305                                            0330
@RF00305 DS    0H                                                  0331
*       CCACD1=RCINSSWA;            /* SET RETURN CODE 164   @ZA29164*/
         MVI   CCACD1(R11),X'A4'                                   0331
*Z008VCER:                                                         0332
*       DO;                                                        0332
Z008VCER DS    0H                                                  0333
*         CALL IGGPVCER;                                           0333
         BAL   @14,IGGPVCER                                        0333
*         GEN(RLDSBREG IGGPVCER);   /* RELOAD SECONDARY BASE REG     */
         RLDSBREG IGGPVCER
*       END;                        /* ERROR EXIT ROUTINE    @ZA29164*/
*     END;                          /*                       @ZA29164*/
*   RFY                                                            0337
*     CTGPL BASED(CCACPL);          /*                       @Y30SSSM*/
@RC00305 DS    0H                                                  0338
*   R4=CCAR0REC+(6*512);            /* POINT TO CICB         @ZA29164*/
         LA    R4,3072                                             0338
         AL    R4,CCAR0REC(,R11)                                   0338
*   RFY                                                            0339
*     IGGCICB BASED(R4);            /*                       @ZA29164*/
*                                                                  0339
*   /*****************************************************************/
*   /*                                                               */
*   /* SYSTEM CALLERS NEED NOT HAVE CPL VALIDITY CHECKED             */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0340
*   IF CCAGDGUY=OFF THEN            /* NON-AUTHORIZED CALLER @ZA29164*/
         TM    CCAGDGUY(R11),B'00010000'                           0340
         BNZ   @RF00340                                            0340
*     DO;                           /* YES                   @ZA29164*/
*       CICBID='CICB';              /* SET CICB ID           @ZA29164*/
         MVC   CICBID(4,R4),@CC03927                               0342
*       CICNXTBK=ADDR(IGGCICB)+LENGTH(IGGCICB);/* NEXT AVAILABLE AREA
*                                                            @ZA29164*/
         LA    @05,128                                             0343
         ALR   @05,R4                                              0343
         ST    @05,CICNXTBK(,R4)                                   0343
*       CICCISAP=CICNXTBK;          /* ADDRESS OF CISA       @ZA29164*/
         ST    @05,CICCISAP(,R4)                                   0344
*       CICRMBYT=(5*1024)-LENGTH(IGGCICB);/* REMAINING BYTES IN CISA
*                                                            @ZA29164*/
         L     @05,@CF04150                                        0345
         ST    @05,CICRMBYT(,R4)                                   0345
*       CICCICAB=CICRMBYT;          /* SIZE OF PRIMARY CISA  @ZA29164*/
         ST    @05,CICCICAB(,R4)                                   0346
*       CCACICIN=ON;                /* VALIDITY CHECK GATE   @ZA29164*/
         OI    CCACICIN(R11),B'10000000'                           0347
*Z009CCPL:                                                         0348
*       DO;                                                        0348
Z009CCPL DS    0H                                                  0349
*         CALL IGGPCCPL;                                           0349
         BAL   @14,IGGPCCPL                                        0349
*         GEN(RLDSBREG IGGPCCPL);   /* RELOAD SECONDARY BASE REG     */
         RLDSBREG IGGPCCPL
*       END;                        /* PROTECT CAT INTERFACE @ZA29164*/
*       CCACICIN=OFF;               /* VALIDITY CHECK GATE   @ZA29164*/
*                                                                  0352
         NI    CCACICIN(R11),B'01111111'                           0352
*       /*************************************************************/
*       /*                                                           */
*       /* CHECK IF CATALOG INTERFACE WAS MOVED              @ZA29164*/
*       /* COMPLETELY. IF NOT A SECONDARY CISA MUST BE       @ZA29164*/
*       /* GOTTEN TO COMPLETELY MOVE THE INTERFACE.          @ZA29164*/
*       /*                                                           */
*       /*************************************************************/
*                                                                  0353
*       IF CICFPLOP=OFF THEN        /* NO TEST FPL LOOP      @ZA29164*/
         TM    CICFPLOP(R4),B'00100000'                            0353
         BNZ   @RF00353                                            0353
*         IF CICCOUNT=ON THEN       /* INTERFACE NOT MOVED   @ZA29164*/
         TM    CICCOUNT(R4),B'10000000'                            0354
         BNO   @RF00354                                            0354
*           DO;                     /* NO                    @ZA29164*/
*             CCAMNLEN=CICGMCNT;    /* SECONDARY CISA SIZE   @ZA29164*/
*                                                                  0356
         MVC   CCAMNLEN(3,R11),CICGMCNT+1(R4)                      0356
*             /*******************************************************/
*             /*                                                     */
*             /* CLEAR THE CICB AND THE PRIMARY CISA         @ZA29164*/
*             /*                                                     */
*             /*******************************************************/
*                                                                  0357
*             RFY                                                  0357
*              (R0,                                                0357
*               R8,                                                0357
*               R9) RSTD;           /*                       @ZA29164*/
*             R0=ADDR(IGGCICB);     /* POINT TO AREA         @ZA29164*/
         LR    R0,R4                                               0358
*             R1=(5*1024);          /* CICB,PRIMARY CISA SIZE      0359
*                                                            @ZA29164*/
         L     R1,@CF04149                                         0359
*             R9=ZERO;              /* SET PADDING CHAR      @ZA29164*/
         SLR   R9,R9                                               0360
*             GEN(MVCL R0,R8);      /* CLEAR AREA            @ZA29164*/
         MVCL R0,R8
*             RFY                                                  0362
*              (R0,                                                0362
*               R8,                                                0362
*               R9) UNRSTD;         /*                       @ZA29164*/
*             CICBID='CICB';        /* SET CICB ID           @ZA29164*/
         MVC   CICBID(4,R4),@CC03927                               0363
*             CICNXTBK=ADDR(IGGCICB)+LENGTH(IGGCICB);/* NEXT       0364
*                                      AVAILABLE AREA        @ZA29164*/
         LA    @05,128                                             0364
         ALR   @05,R4                                              0364
         ST    @05,CICNXTBK(,R4)                                   0364
*             CICCISAP=CICNXTBK;    /* ADDRESS OF CISA       @ZA29164*/
         ST    @05,CICCISAP(,R4)                                   0365
*             CICRMBYT=(5*1024)-LENGTH(IGGCICB);/* REMAINING BYTES IN
*                                      CISA                  @ZA29164*/
         L     @05,@CF04150                                        0366
         ST    @05,CICRMBYT(,R4)                                   0366
*             CICCICAB=CICRMBYT;    /* SIZE OF PRIMARY CISA  @ZA29164*/
         ST    @05,CICCICAB(,R4)                                   0367
*             CICSABYT=CCAMNLEN;    /* SECONDARY CISA SIZE   @ZA29164*/
         L     @05,CCAMNLEN-1(,R11)                                0368
         LA    @05,0(,@05)                                         0368
         ST    @05,CICSABYT(,R4)                                   0368
*             R1=ADDR(CCAMSSPL);    /* POINT TO STRG MGMT P.L.       */
         LA    R1,CCAMSSPL(,R11)                                   0369
*             CCAMNSPL=FSUBPOOL;    /* STORE SUBPOOL VALUE           */
*                                                                  0370
         MVI   CCAMNSPL(R11),X'E5'                                 0370
*             /*******************************************************/
*             /*                                                     */
*             /* ALLOCATE MAIN STORAGE FROM SYSTEM SUBPOOL 229       */
*             /*                                                     */
*             /*******************************************************/
*                                                                  0371
*             GEN(GETMAIN LC,MF=(E,(1)));/* GET MAIN STORAGE SPACE   */
         GETMAIN LC,MF=(E,(1))
*             GEN(LR R1,R15);       /* PICK UP RETURN CODE           */
         LR R1,R15
*             IF R1^=NOGETMSE THEN  /* CHECK FOR ERROR RETURN        */
*                                                                  0373
         LTR   R1,R1                                               0373
         BZ    @RF00373                                            0373
*               /*****************************************************/
*               /*                                                   */
*               /* SET CCAMODID='C9', CCAREASN=RSN2,                 */
*               /* CCARETRN=RCINSSWA                                 */
*               /*                                                   */
*               /*****************************************************/
*                                                                  0374
*               CCAPROB=IGGSEGID+(RSN2*K256)+RCINSSWA;/* INSUFFICIENT
*                                      CORE ERROR SECONDARY CISA   0374
*                                                            @ZA29164*/
         MVC   CCAPROB(4,R11),@CF04152                             0374
*             CICCISSP=CCAMNADR;    /* SECONDARY CISA ADDR.  @ZA29164*/
@RF00373 L     @05,CCAMNADR(,R11)                                  0375
         ST    @05,CICCISSP(,R4)                                   0375
*             CCACPL=CCAOCPL;       /* RESTORE CPL ADDRESS   @ZA29164*/
         L     @00,CCAOCPL(,R11)                                   0376
         ST    @00,CCACPL(,R11)                                    0376
*             RFY                                                  0377
*              (R0,                                                0377
*               R8,                                                0377
*               R9) RSTD;           /*                       @ZA29164*/
*             R0=CCAMNADR;          /* SECONDARY CISA ADDR.  @ZA29164*/
         LR    R0,@05                                              0378
*             R1=CICSABYT;          /* SECONDARY CISA SIZE   @ZA29164*/
         L     R1,CICSABYT(,R4)                                    0379
*             R9=ZERO;              /* SET PADDING CHAR      @ZA29164*/
         SLR   R9,R9                                               0380
*             GEN(MVCL R0,R8);      /* CLEAR SECONDARY CISA  @ZA29164*/
         MVCL R0,R8
*             RFY                                                  0382
*              (R0,                                                0382
*               R8,                                                0382
*               R9) UNRSTD;         /*                       @ZA29164*/
*             CCACICIN=ON;          /* VALIDITY CHECK GATE   @ZA29164*/
         OI    CCACICIN(R11),B'10000000'                           0383
*Z012CCPL:                                                         0384
*             DO;                                                  0384
Z012CCPL DS    0H                                                  0385
*               CALL IGGPCCPL;                                     0385
         BAL   @14,IGGPCCPL                                        0385
*               GEN(RLDSBREG IGGPCCPL);/* RELOAD SECONDARY BASE REG  */
         RLDSBREG IGGPCCPL
*             END;                  /* PROTECT CAT INTERFACE @ZA29164*/
*             CCACICIN=OFF;         /* VALIDITY CHECK GATE   @ZA29164*/
*                                                                  0388
         NI    CCACICIN(R11),B'01111111'                           0388
*             /*******************************************************/
*             /*                                                     */
*             /* CHECK IF CATALOG INTERFACE WAS MOVED        @ZA29164*/
*             /*                                                     */
*             /*******************************************************/
*                                                                  0389
*             IF CICCOUNT=ON THEN   /* INTERFACE MOVED?      @ZA29164*/
         TM    CICCOUNT(R4),B'10000000'                            0389
         BNO   @RF00389                                            0389
*               DO;                 /* NO, NOT MOVED         @ZA29164*/
*                 CCACD1=RCBLKVCK;  /* SET VALIDITY ERROR    @ZA29164*/
         MVI   CCACD1(R11),X'80'                                   0391
*Z013VCER:                                                         0392
*                 DO;                                              0392
Z013VCER DS    0H                                                  0393
*                   CALL IGGPVCER;                                 0393
         BAL   @14,IGGPVCER                                        0393
*                   GEN(RLDSBREG IGGPVCER);/* RELOAD SECONDARY BASE
*                                      REG                           */
         RLDSBREG IGGPVCER
*                 END;              /* VALIDITY ERROR RTN    @ZA29164*/
*               END;                /*                       @ZA29164*/
*             ELSE                                                 0397
*               ;                   /*                       @ZA29164*/
@RF00389 DS    0H                                                  0398
*           END;                    /*                       @ZA29164*/
*         ELSE                                                     0399
*           ;                       /*                       @ZA29164*/
@RF00354 DS    0H                                                  0400
*       ELSE                        /* TEST FPL LOOP ERROR   @ZA29164*/
*         DO;                       /*                       @ZA29164*/
         B     @RC00353                                            0400
@RF00353 DS    0H                                                  0401
*           CCACD1=RCBLKVCK;        /* SET VALIDITY ERROR    @ZA29164*/
         MVI   CCACD1(R11),X'80'                                   0401
*Z014VCER:                                                         0402
*           DO;                                                    0402
Z014VCER DS    0H                                                  0403
*             CALL IGGPVCER;                                       0403
         BAL   @14,IGGPVCER                                        0403
*             GEN(RLDSBREG IGGPVCER);/* RELOAD SECONDARY BASE REG    */
         RLDSBREG IGGPVCER
*           END;                    /* VALIDITY ERROR RTN    @ZA29164*/
*         END;                      /*                       @ZA29164*/
*     END;                          /*                       @ZA29164*/
*   ELSE                            /*                       @ZA29164*/
*     CCACPLOK=ON;                  /* INDICATE CPL VALID    @ZA29164*/
         B     @RC00340                                            0408
@RF00340 OI    CCACPLOK(R11),B'01000000'                           0408
*   IF CCASKYSS=ON×                 /* SYSTEM KEY OR SUPERVISOR    0409
*                                      STATE?                @ZA29164*/
*       CTGSUPLT=ON THEN            /* SUPERLOCATE REQ       @Y30SSSM*/
@RC00340 TM    CCASKYSS(R11),B'00100000'                           0409
         BO    @RT00409                                            0409
         L     @05,CCACPL(,R11)                                    0409
         TM    CTGSUPLT(@05),B'00010000'                           0409
         BNO   @RF00409                                            0409
@RT00409 DS    0H                                                  0410
*     CCAF2SYS=ON;                  /* BYPASS VAL CHKS       @Y30SSSM*/
         OI    CCAF2SYS(R11),B'10000000'                           0410
*   ELSE                                                           0411
*     ;                             /* MUST VALDTY CHK       @Y30SSSM*/
@RF00409 DS    0H                                                  0412
*   CALL EXIT;                      /* RETURN TO CALLER              */
         BAL   @14,EXIT                                            0412
*   GEN(DS 0F);                     /* FULLWORD BOUNDARY ALIGNMENT   */
         DS 0F
*   GEN(DC CL8'IGGPVCER');          /* NAME OF FOLLOWING PROCEDURE   */
         DC CL8'IGGPVCER'
*   END;                            /* END OF INNER PROCEDURE        */
@EL00002 DS    0H                                                  0415
@EF00002 DS    0H                                                  0415
@ER00002 BR    @14                                                 0415
         EJECT
*                                                                  0416
*/********************************************************************/
*/*                                                                  */
*/*        IGGPVCER  -  PROCEDURE  INTERNALLY  CALLED  UNNESTED      */
*/*                                                                  */
*/********************************************************************/
*                                                                  0416
*IGGPVCER:                                                         0416
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);/* SPECIFY PROCEDURE OPTIONS     */
IGGPVCER DS    0H                                                  0417
*Z015:                              /* LABEL FOR PROCEDURE TRACKING  */
*Z015VCER:                          /* LABEL FOR PROCEDURE TRACKING  */
*   RFY                                                            0417
*    (R5,                                                          0417
*     R6,                                                          0417
*     R7,                                                          0417
*     R8,                                                          0417
*     R9) UNRSTD;                   /* PL/S COMPILER WORK REGISTERS  */
Z015     DS    0H                                                  0417
Z015VCER DS    0H                                                  0418
*   RFY                                                            0418
*    (R2,                                                          0418
*     R3,                                                          0418
*     R4) RSTD;                     /* RESTRICT LOCAL WORK REGISTERS */
*                                                                  0418
*   /*****************************************************************/
*   /*                                                               */
*   /* THIS ROUTINE HANDLES CATALOG INTERFACE ERRORS         @ZA29164*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0419
*   R2=CCACD1;                      /* SAVE ERROR CODE       @ZA29164*/
         SLR   R2,R2                                               0419
         IC    R2,CCACD1(,R11)                                     0419
*   IF CCACD1=RCINSSWA THEN         /* INSUFFICIENT STORAGE  @ZA29164*/
         CLI   CCACD1(R11),164                                     0420
         BNE   @RF00420                                            0420
*     DO;                           /* YES                   @ZA29164*/
*       R1=ADDR(MSG1);              /* POINT TO IEC339I MSG  @ZA29164*/
         LA    R1,MSG1                                             0422
*       GEN(WTO   MF=(E,(1)));      /* ISSUE IEC339I MESSAGE @ZA29164*/
         WTO   MF=(E,(1))
*     END;                          /*                       @ZA29164*/
*   ELSE                                                           0425
*     ;                             /*                       @ZA29164*/
@RF00420 DS    0H                                                  0426
*   IF CCACD1=RCBLKVCK THEN         /* VALIDITY CHECK ERROR? @ZA29164*/
         CLI   CCACD1(R11),128                                     0426
         BNE   @RF00426                                            0426
*     DO;                           /* YES                   @ZA29164*/
*       R1=ADDR(MSG2);              /* POINT TO IEC338I MSG  @ZA29164*/
         LA    R1,MSG2                                             0428
*       GEN(WTO   MF=(E,(1)));      /* ISSUE IEC338I MESSAGE @ZA29164*/
         WTO   MF=(E,(1))
*     END;                          /*                       @ZA29164*/
*   ELSE                                                           0431
*     ;                             /*                       @ZA29164*/
@RF00426 DS    0H                                                  0432
*   IF CCACPLOK=ON THEN             /* IS CPL VALID?         @ZA29164*/
         TM    CCACPLOK(R11),B'01000000'                           0432
         BNO   @RF00432                                            0432
*     IF(CTGSUPLT=ON&CTGGENLD=OFF)  /* SUPERLOCATE REQUEST   @ZA29164*/
*         ×CTGAM0=OFF THEN          /* TRANSLATED REQUEST    @ZA29164*/
         L     @05,CCACPL(,R11)                                    0433
         TM    CTGSUPLT(@05),B'00010000'                           0433
         BNO   @GL00003                                            0433
         TM    CTGGENLD(@05),B'00000001'                           0433
         BZ    @RT00433                                            0433
@GL00003 L     @05,CCACPL(,R11)                                    0433
         TM    CTGAM0(@05),B'00000001'                             0433
         BNZ   @RF00433                                            0433
@RT00433 DS    0H                                                  0434
*       R2=RC8;                     /* RETURN CODE 8         @ZA29164*/
         LA    R2,8                                                0434
*     ELSE                          /* NOT SUPERLOCATE       @ZA29164*/
*       DO;                         /* YES                   @ZA29164*/
         B     @RC00433                                            0435
@RF00433 DS    0H                                                  0436
*         CTGMODID='C9';            /* MODULE ID IN ERROR    @ZA29164*/
         L     @05,CCACPL(,R11)                                    0436
         MVC   CTGMODID(2,@05),@CC03945                            0436
*         CTGREAS1=N;               /* CLEAR HIGH BYTE       @ZA29164*/
         MVI   CTGREAS1(@05),X'00'                                 0437
*         CTGREAS2=CCAREASN;        /* SET REASON CODE       @ZA29164*/
         MVC   CTGREAS2(1,@05),CCAREASN(R11)                       0438
*         RFY                                                      0439
*           CTGPL BASED(CCAOCPL);   /*                       @ZA29164*/
*         CICRAREA=ADDR(CTGPROB);   /* ORIGINAL CPL RETURN AREA    0440
*                                                            @ZA29164*/
         L     @15,CCAOCPL(,R11)                                   0440
         LA    @00,CTGPROB(,@15)                                   0440
         ST    @00,CICRAREA(,R4)                                   0440
*         RFY                                                      0441
*           CTGPL BASED(CCACPL);    /*                       @ZA29164*/
*         CICBKPTR=ADDR(CTGPROB);   /* WORK CPL RETURN AREA  @ZA29164*/
         LA    @05,CTGPROB(,@05)                                   0442
         ST    @05,CICBKPTR(,R4)                                   0442
*         CICBKLNG=LENGTH(CTGPROB); /* LENGTH OF RETURN AREA @ZA29164*/
         MVC   CICBKLNG(4,R4),@CF00059                             0443
*Z016MDTW:                                                         0444
*         DO;                                                      0444
Z016MDTW DS    0H                                                  0445
*           CALL IGGPMDTW;                                         0445
         BAL   @14,IGGPMDTW                                        0445
*           GEN(RLDSBREG IGGPMDTW); /* RELOAD SECONDARY BASE REG     */
         RLDSBREG IGGPMDTW
*         END;                      /* MOVE BACK RETURN CODE @ZA29164*/
*         R2=CCACD1;                /* SET RETURN CODE       @ZA29164*/
         SLR   R2,R2                                               0448
         IC    R2,CCACD1(,R11)                                     0448
*       END;                        /*                       @ZA29164*/
*   ELSE                                                           0450
*     ;                             /*                       @ZA29164*/
@RF00432 DS    0H                                                  0451
*   RVCCAV=OFF;                     /* CCA NO LONGER VALID   @ZA26164*/
*                                                                  0451
@RC00432 NI    RVCCAV(R11),B'01111111'                             0451
*   /*****************************************************************/
*   /*                                                               */
*   /* RELEASE ESTAE ENVIRONMENT                             @ZA29164*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0452
*   R1=TCBRBP;                      /* CURRENT RB POINTER    @ZA29164*/
         L     @05,CVTPTR                                          0452
         L     @05,CVTTCBP(,@05)                                   0452
         L     @05,TCBPTR(,@05)                                    0452
         L     R1,TCBRBP(,@05)                                     0452
*   RFY                                                            0453
*    (R9) RSTD;                     /*                       @ZA26164*/
*   R9=ADDR(RIPLSA);                /* PT TO LOCAL RSA       @ZA26164*/
         LA    R9,CCAREGS(,R11)                                    0454
         AL    R9,@CF00075                                         0454
*   GEN(STM 10,8,0(9));             /* SAVE LOCAL REGS       @ZA26164*/
         STM 10,8,0(9)
*   R1=ADDR(RIPEPA);                /* ESTAE MACRO PL        @ZA26164*/
         LA    R1,CCAREGS(,R11)                                    0456
         AL    R1,@CF00075                                         0456
         LA    @08,RIPEPA(,R1)                                     0456
         ST    R1,@TF00001                                         0456
         LR    R1,@08                                              0456
*   R2=ADDR(RIPRSA);                /* ESTAE ROUT RSA        @ZA26164*/
         L     R2,@TF00001                                         0457
         LA    R2,RIPRSA(,R2)                                      0457
*   GEN REFS(PSALITA,FLC,CVTMAP,CVTSV60,FLCCVT,PSA);               0458
*                                                   /*       @ZA26164*/
         SETLOCK OBTAIN,TYPE=LOCAL,MODE=UNCOND,                        X
               RELATED=('AFTER ESTAE CALL') /*GET LCL LK     @ZA26164*/
         ESTAE 0,BRANCH=YES,SVEAREA=(2),MF=(E,(1))                     X
                                        /*DEACTIVATE RCVY    @ZA26164*/
         SETLOCK RELEASE,TYPE=LOCAL,                                   X
               RELATED=('BEFORE ESTAE CALL') /*FREE LOCK     @ZA26164*/
         LM R10,R8,RIPLSA(R9)         /*RESTORE LOCAL REGS   @ZA26164*/
*   RFY                                                            0459
*    (R9) UNRSTD;                   /*                       @ZA26164*/
*                                                                  0459
*   /*****************************************************************/
*   /*                                                               */
*   /* FREE RECORD AREAS AND CICB/CISA IF THEY EXIST         @ZA29164*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0460
*   IF CCAR0REC^=N THEN             /* RECORD AREA EXIST?    @ZA29164*/
         SLR   @05,@05                                             0460
         C     @05,CCAR0REC(,R11)                                  0460
         BE    @RF00460                                            0460
*     DO;                           /* YES, MUST FREE IT     @ZA29164*/
*       R3=(6*512);                 /* SIZE OF RECORD AREAS  @ZA29164*/
         LA    R3,3072                                             0462
*       IF CCAGDGUY=OFF THEN        /* CICB/CISA EXIST?      @ZA29164*/
         TM    CCAGDGUY(R11),B'00010000'                           0463
         BNZ   @RF00463                                            0463
*         DO;                       /* YES                   @ZA29164*/
*           R3=R3+(5*1024);         /* ADJUST LENGTH         @ZA29164*/
         AL    R3,@CF04149                                         0465
*           IF CICCISSP^=N THEN     /* SECONDARY CISA EXIST? @ZA29164*/
         L     @15,CICCISSP(,R4)                                   0466
         CR    @15,@05                                             0466
         BE    @RF00466                                            0466
*             DO;                   /* YES                   @ZA29164*/
*               CCAMNADR=CICCISSP;  /* SECONDARY CISA ADDR   @ZA29164*/
         ST    @15,CCAMNADR(,R11)                                  0468
*               CCAMNLEN=CICSABYT;  /* SECONDARY CISA SIZE   @ZA29164*/
         L     @05,CICSABYT(,R4)                                   0469
         STCM  @05,7,CCAMNLEN(R11)                                 0469
*               RFY                                                0470
*                (R6,                                              0470
*                 R7,                                              0470
*                 R8,                                              0470
*                 R9) RSTD;         /* RESTRICT REGS         @ZA29164*/
*               R6=CCAMNADR;        /* GET ADDRESS           @ZA29164*/
         LR    R6,@15                                              0471
*               R7=CCAMNLEN;        /* GET LENGTH            @ZA29164*/
         LR    R7,@05                                              0472
*               R9=ZERO;            /* SET PADDING CHAR      @ZA29164*/
         SLR   R9,R9                                               0473
*               GEN(MVCL R6,R8);    /* CLEAR CISA            @ZA29164*/
         MVCL R6,R8
*               RFY                                                0475
*                (R6,                                              0475
*                 R7,                                              0475
*                 R8,                                              0475
*                 R9) UNRSTD;       /*                       @ZA29164*/
*               CICCISSP=N;         /* INDICATE NO SECONDARY STORAGE
*                                                            @ZA29164*/
         SLR   @05,@05                                             0476
         ST    @05,CICCISSP(,R4)                                   0476
*               R1=ADDR(CCAMSSPL);  /* POINT TO STRG MGMT P.L.       */
         LA    R1,CCAMSSPL(,R11)                                   0477
*               CCAMNSPL=FSUBPOOL;  /* STORE SUBPOOL VALUE           */
*                                                                  0478
         MVI   CCAMNSPL(R11),X'E5'                                 0478
*               /*****************************************************/
*               /*                                                   */
*               /* RELEASE MAIN STORAGE FROM SYSTEM SUBPOOL 229      */
*               /*                                                   */
*               /*****************************************************/
*                                                                  0479
*               GEN(FREEMAIN L,MF=(E,(1))) ;/* FREE SECONDARY CISA 0479
*                                                            @ZA29164*/
         FREEMAIN L,MF=(E,(1))
*             END;                  /*                       @ZA29164*/
*           ELSE                                                   0481
*             ;                     /*                       @ZA29164*/
@RF00466 DS    0H                                                  0482
*         END;                      /*                       @ZA29164*/
*       ELSE                                                       0483
*         ;                         /*                       @ZA29164*/
@RF00463 DS    0H                                                  0484
*       CCAMNADR=CCAR0REC;          /* ADDRESS OF CICB/CISA  @ZA29164*/
         L     @05,CCAR0REC(,R11)                                  0484
         ST    @05,CCAMNADR(,R11)                                  0484
*       CCAMNLEN=R3;                /* LENGTH OF CICB/CISA   @ZA29164*/
         STCM  R3,7,CCAMNLEN(R11)                                  0485
*       RFY                                                        0486
*        (R6,                                                      0486
*         R7,                                                      0486
*         R8,                                                      0486
*         R9) RSTD;                 /* RESTRICT REGS         @ZA29164*/
*       R6=CCAMNADR;                /* GET ADDRESS           @ZA29164*/
         LR    R6,@05                                              0487
*       R7=CCAMNLEN;                /* GET LENGTH            @ZA29164*/
         L     @05,CCAMNLEN-1(,R11)                                0488
         LA    @05,0(,@05)                                         0488
         LR    R7,@05                                              0488
*       R9=ZERO;                    /* SET PADDING CHAR      @ZA29164*/
         SLR   R9,R9                                               0489
*       GEN(MVCL R6,R8);            /* CLEAR CISA            @ZA29164*/
         MVCL R6,R8
*       RFY                                                        0491
*        (R6,                                                      0491
*         R7,                                                      0491
*         R8,                                                      0491
*         R9) UNRSTD;               /*                       @ZA29164*/
*       CCAR0REC=N;                 /* CLEAR ADDRESS         @ZA29164*/
         SLR   @05,@05                                             0492
         ST    @05,CCAR0REC(,R11)                                  0492
*       R1=ADDR(CCAMSSPL);          /* POINT TO STRG MGMT P.L.       */
         LA    R1,CCAMSSPL(,R11)                                   0493
*       CCAMNSPL=FSUBPOOL;          /* STORE SUBPOOL VALUE           */
*                                                                  0494
         MVI   CCAMNSPL(R11),X'E5'                                 0494
*       /*************************************************************/
*       /*                                                           */
*       /* RELEASE MAIN STORAGE FROM SYSTEM SUBPOOL 229              */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0495
*       GEN(FREEMAIN L,MF=(E,(1))) ;/* FREE CICB/CISA        @ZA29164*/
         FREEMAIN L,MF=(E,(1))
*     END;                          /*                       @ZA29164*/
*   ELSE                                                           0497
*     ;                             /*                       @ZA29164*/
@RF00460 DS    0H                                                  0498
*   R1=TCBRBP;                      /* CURRENT RB POINTER    @ZA29164*/
         L     @05,CVTPTR                                          0498
         L     @15,CVTTCBP(,@05)                                   0498
         L     @15,TCBPTR(,@15)                                    0498
         L     R1,TCBRBP(,@15)                                     0498
*   R12=CTLWAPTR;                   /* CONTROLLERS W. A.     @ZA29164*/
         L     R12,CTLWAPTR(,R1)                                   0499
*   R3=CVTPTR;                      /* CVT POINTER           @ZA29164*/
         LR    R3,@05                                              0500
*   R4=ADDR(TCB);                   /* CURRENT TCB           @ZA29164*/
         LR    R4,@15                                              0501
*   RFY                                                            0502
*    (R5,                                                          0502
*     R14) RSTD;                    /*                       @ZA29164*/
*   R5=R1;                          /* CURRENT RB            @ZA29164*/
         LR    R5,R1                                               0503
*   R14=CLA1ADR;                    /* EXT RETURN ADDR,CLA1  @ZA29164*/
         L     R14,CLA1ADR(,R1)                                    0504
*   R1=CPLSAV;                      /* CPL POINTER           @ZA29164*/
         L     R1,CPLSAV(,R1)                                      0505
*   GEN(LCR   R1,R1);               /* COMPLEMENT CPL ADDR   @ZA29164*/
         LCR   R1,R1
*   RETURN;                         /* RETURN TO IGG0CLA1    @ZA29164*/
@EL00003 DS    0H                                                  0507
@EF00003 DS    0H                                                  0507
@ER00003 BR    @14                                                 0507
*   CALL EXIT;                      /* RETURN TO CALLER              */
*   GEN(DS 0F);                     /* FULLWORD BOUNDARY ALIGNMENT   */
         DS 0F
*   GEN(DC CL8'IGGPRCU');           /* NAME OF FOLLOWING PROCEDURE   */
         DC CL8'IGGPRCU'
*   END;                            /* END OF INNER PROCEDURE        */
         B     @EL00003                                            0511
         EJECT
*                                                                  0512
*/********************************************************************/
*/*                                                                  */
*/*        IGGPRCU  -  PROCEDURE  INTERNALLY  CALLED  UNNESTED       */
*/*                                                                  */
*/********************************************************************/
*                                                                  0512
*IGGPRCU:                                                          0512
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);/* SPECIFY PROCEDURE OPTIONS     */
IGGPRCU  DS    0H                                                  0513
*Z019:                              /* LABEL FOR PROCEDURE TRACKING  */
*Z019RCU:                           /* LABEL FOR PROCEDURE TRACKING  */
*   RFY                                                            0513
*    (R5,                                                          0513
*     R6,                                                          0513
*     R7,                                                          0513
*     R8,                                                          0513
*     R9) UNRSTD;                   /* PL/S COMPILER WORK REGISTERS  */
Z019     DS    0H                                                  0513
Z019RCU  DS    0H                                                  0514
*   RFY                                                            0514
*    (R2,                                                          0514
*     R3,                                                          0514
*     R4) RSTD;                     /* RESTRICT LOCAL WORK REGISTERS */
*/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
**                                                                    *
**  PROCEDURE NAME = IGGPRCU                                          *
**                                                                    *
**  DESCRIPTIVE NAME = REQUEST CLEANUP                                *
**                                                                    *
**  FUNCTION =                                                        *
**     IGGPRCU - REQUEST CLEANUP                                      *
**        RECEIVES CONTROL WHEN CATALOG PROCESSING IS COMPLETE        *
**          IF CATALOG (MASTER OR USER) THEN                          *
**            IF CCA INDICATES AN EARLY EXIT THEN                     *
**              IF OPEN OF CATALOG                                    *
**              -FREES DRWA IF ONE EXISTS                             *
**              -BUILDS RPL'S BASED ON THE NUMBER OF DATA BUFFERS     *
**               LESS ONE. AND INITIALIZES RPL'S                      *
**              -IF NOT BUILD                                         *
**                 ISSUES VERIFY                                      *
**            IF CLOSE OF CATALOG                                     *
**              -FREES RPL'S                                          *
**              -FREES CAXWA IF NOT SYSTEM CALLER.                    *
**          IF NOT EARLY EXIT OR AFTER EARLY EXIT PROCESSING.         *
**          CHECKS FOR CHECK POINT CCR REQUIRED, IF SO CALLS IGGPCCCR *
**          (EXTERNAL).                                               *
**          CALLS RPL FREE UP - IGGPRPLF (EXTERNAL)                   *
**          FREES THE RECORD AREAS, CICB/CISA IF PRESENT      @ZA29164*
**          RESTORES REGISTERS FOR IGC0002F                           *
**          RETURNS (VIA REG 14) TO IGG0CLA1 WITH REG 1 NEGATIVE.     *
**                                                                    *
**      NOTES =                                               @ZA29164*
**        THE ENTRY REGISTERS TO THIS MODULE NEDDED FOR       @ZA29164*
**        RETURN ARE RESTORED FROM THE SVRB EXTENDED SAVE     @ZA29164*
**        AREA WHERE IGGPBCCA SAVED THEM.                     @ZA29164*
**                                                            @ZA29164*
**        REGISTER CONVENTIONS =                              @ZA29164*
**           R0-R1     WORK REGISTERS             VOLATILE    @ZA29164*
**           R2-R4     WORK REGISTERS             VOLATILE    @ZA29164*
**           R5-R9     COMPILER/WORK REGS         VOLATILE    @ZA29164*
**           R10       BASE REGISTER 2            VOLATILE    @ZA29164*
**           R11       CCA POINTER                SAVED       @ZA29164*
**           R12       BASE REGISTER 1         SAVED/RESTORED @ZA29164*
**           R13       SAVEAREA POINTER        SAVED/RESTORED @ZA29164*
**           R14       RETURN REGISTER         SAVED/RESTORED @ZA29164*
**           R15       ENTRY POINT                VOLATILE    @ZA29164*
**                                                            @ZA29164*
**      ENTRY POINT = IGGPRCU                                 @ZA29164*
**                                                            @ZA29164*
**        LINKAGE = CALL                                      @ZA29164*
**           CALLED BY IGG0CLC9 INTERNALLY.                   @ZA29164*
**                                                            @ZA29164*
**      INPUT =                                               @ZA29164*
**           R10 = SECOND BASE REGISTER                       @ZA29164*
**           R11 = CCA ADDRESS                                @ZA29164*
**           R12 = FIRST BASE REGISTER                        @ZA29164*
**           R14 = RETURN ADDRESS                             @ZA29164*
**                                                            @ZA29164*
**      OUTPUT =                                              @ZA29164*
**           R1 = CPL ADDRESS IN 2'S COMPLIMENT               @ZA29164*
**           R2 = RETURN ERROR CODE                           @ZA29164*
**           R12 = IGC0002F WORK AREA ADDRESS                 @ZA29164*
**           RPL'S IF OPEN REQUEST                            @ZA29164*
**                                                            @ZA29164*
**      MESSAGES = NONE                                       @ZA29164*
**                                                            @ZA29164*
**      EXIT-NORMAL = TO IGG0CLA1                             @ZA29164*
**                                                            @ZA29164*
**      EXIT-ERROR = TO IGG0CLA1                              @ZA29164*
**                                                            @ZA29164*
**      EXTERNAL REFERENCES =                                 @ZA29164*
**                                                            @ZA29164*
**        MODULES =                                           @ZA29164*
**           IGGPARFS - TRACKING TABLE FULL ROUTINE           @ZA29164*
**           IGGPRCCR - READ CATALOG CONTROL RECORD (CCR)     @ZA29164*
**           IGGPRARC - READ CRA CCR                          @ZA29164*
**           IGGPCCCR - CHECK POINT THE CCR                   @ZA29164*
**           IGGPRPLF - DEQ THE CATALOG - RPL FREE UP         @ZA29164*
**           IGGPEMSG - ISSUE ERROR MESSAGES                  @ZA29164*
**                                                            @ZA29164*
**        DATA AREAS =                                        @ZA29164*
**           CONTROLLER'S WORKAREA, CATALOG INTERFACE         @ZA29164*
**                                                            @ZA29164*
**        CONTROL BLOCKS =                                    @ZA29164*
**                    BUILD   REFERENCE   MODIFY   DELETE     @ZA29164*
**           ACB                 X                            @ZA29164*
**           CAXWA               X                    X       @ZA29164*
**           CCA                 X           X                @ZA29164*
**           CVT                 X                            @ZA29164*
**           RPL        X                    X                @ZA29164*
**           DRWA                                     X       @ZA29164*
**           TCB                 X                            @ZA29164*
**           RB                  X                            @ZA29164*
**           CICB                X           X        X       @ZA29164*
**           CISA                X           X        X       @ZA29164*
**                                                            @ZA29164*
**      TABLES = NONE                                         @ZA29164*
**                                                            @ZA29164*
**      MACROS = GETMAIN                                      @ZA29164*
**               ESTAE                                        @ZA29164*
**               FREEMAIN                                     @ZA29164*
**               SETLOCK                                      @ZA29164*
**               WAIT                                         @ZA29164*
**               VERIFY                                       @ZA29164*
**                                                            @ZA29164*
** * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
*                                                                  0515
*   IF CCACD1=RCEE&CCACD2=COCECOMP  /* EARLY EXIT & O/C/EOV          */
*     THEN                                                         0515
         CLI   CCACD1(R11),252                                     0515
         BNE   @RF00515                                            0515
         CLI   CCACD2(R11),4                                       0515
         BNE   @RF00515                                            0515
*     DO;                           /* YES                           */
*       CCAPROB=CCAPROB&&CCAPROB;   /* CLEAR ERR CD          @Y30SSSM*/
         L     @15,CCAPROB(,R11)                                   0517
         LR    @05,@15                                             0517
         XR    @05,@15                                             0517
         ST    @05,CCAPROB(,R11)                                   0517
*       CCAPROBX=CCAPROB;           /* CLEAR ERROR EXTEN     @Y30SSSM*/
         ST    @05,CCAPROBX(,R11)                                  0518
*       CCACD2=CCACD1;              /* CLEAR O/C/EOV COMP            */
         IC    @15,CCACD1(,R11)                                    0519
         STC   @15,CCACD2(,R11)                                    0519
*       IF CAXOPN=ON                /* IS THIS OPEN                  */
*         THEN                                                     0520
         L     @15,CCAACB(,R11)                                    0520
         L     @15,ACBUAPTR(,@15)                                  0520
         TM    CAXOPN(@15),B'01000000'                             0520
         BNO   @RF00520                                            0520
*         DO;                                                      0521
*           IF CAXDRWP^=ZERO        /* IS THERE A DRWA               */
*             THEN                                                 0522
         L     @15,CAXDRWP(,@15)                                   0522
         LTR   @15,@15                                             0522
         BZ    @RF00522                                            0522
*             DO;                   /* YES                           */
*                                                                  0523
*               /*****************************************************/
*               /*                                                   */
*               /* FREE DRWA                                         */
*               /*                                                   */
*               /*****************************************************/
*                                                                  0524
*               CCAMNLEN=LENGTH(IGGMDRWA);/* SIZE                    */
         MVC   CCAMNLEN(3,R11),@CF04153+1                          0524
*               CCAMNADR=CAXDRWP;   /* ADDR OF DRWA                  */
         ST    @15,CCAMNADR(,R11)                                  0525
*               R1=ADDR(CCAMSSPL);  /* POINT TO STRG MGMT P.L.       */
         LA    R1,CCAMSSPL(,R11)                                   0526
*               CCAMNSPL=USUBPOOL;  /* STORE SUBPOOL VALUE           */
*                                                                  0527
         MVI   CCAMNSPL(R11),X'FC'                                 0527
*               /*****************************************************/
*               /*                                                   */
*               /* RELEASE MAIN STORAGE FROM USER SUBPOOL 252        */
*               /*                                                   */
*               /*****************************************************/
*                                                                  0528
*               GEN(FREEMAIN L,MF=(E,(1))) ;/* FREEMAIN Y02020       */
         FREEMAIN L,MF=(E,(1))
*             END;                  /* END FREE DRWA                 */
*           ELSE                                                   0530
*             ;                     /* NO DRWA                       */
*                                                                  0530
@RF00522 DS    0H                                                  0531
*           /*********************************************************/
*           /*                                                       */
*           /* BUILD RPL'S                                           */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0531
*           IF ACBUCRA=ON THEN      /* USER CRA REQ          @Y30SSSB*/
         L     @15,CCAACB(,R11)                                    0531
         TM    ACBUCRA(@15),B'00000100'                            0531
         BNO   @RF00531                                            0531
*             DO;                   /*                       @Y30SSSB*/
*               IF ACBOPEN=ON THEN  /* NEED AN RPL           @ZA10883*/
         TM    ACBOPEN(@15),B'00010000'                            0533
         BNO   @RF00533                                            0533
*                 DO;               /* GET/INIT A RPL        @Y30SSSB*/
*                   CCAMNLEN=LENGTH(XTNDRPL);/* SIZE         @Y30SSSB*/
         MVC   CCAMNLEN(3,R11),@CF00143+1                          0535
*                   R1=ADDR(CCAMSSPL);/* POINT TO STRG MGMT P.L.     */
         LA    R1,CCAMSSPL(,R11)                                   0536
*                   CCAMNSPL=USUBPOOL;/* STORE SUBPOOL VALUE         */
*                                                                  0537
         MVI   CCAMNSPL(R11),X'FC'                                 0537
*                   /*************************************************/
*                   /*                                               */
*                   /* ALLOCATE MAIN STORAGE FROM USER SUBPOOL 252   */
*                   /*                                               */
*                   /*************************************************/
*                                                                  0538
*                   GEN(GETMAIN LC,MF=(E,(1)));/* GET MAIN STORAGE 0538
*                                      SPACE                         */
         GETMAIN LC,MF=(E,(1))
*                   GEN(LR R1,R15); /* PICK UP RETURN CODE           */
         LR R1,R15
*                   IF R1^=NOGETMSE THEN/* CHECK FOR ERROR RETURN    */
*                                                                  0540
         LTR   R1,R1                                               0540
         BZ    @RF00540                                            0540
*                     /***********************************************/
*                     /*                                             */
*                     /* SET CCAMODID='C9', CCAREASN=RSN2,           */
*                     /* CCARETRN=RCINSSWA                           */
*                     /*                                             */
*                     /***********************************************/
*                                                                  0541
*                     CCAPROB=IGGSEGID+(RSN2*K256)+RCINSSWA;/*     0541
*                                      INSUFFICIENT CORE ERROR       */
         MVC   CCAPROB(4,R11),@CF04152                             0541
*                   ELSE            /* GETMAIN SUCCESSFUL            */
*                     DO;                                          0542
         B     @RC00540                                            0542
@RF00540 DS    0H                                                  0543
*                       DO;                                        0543
*                         IF MNATFULL=ON THEN/* TRACKING TABLE FULL  */
*                                                                  0544
         TM    MNATFULL(R11),B'10000000'                           0544
         BNO   @RF00544                                            0544
*                           /*****************************************/
*                           /*                                       */
*                           /* CALL TO MODULE IGG0CLAT               */
*                           /*                                       */
*                           /*****************************************/
*                                                                  0545
*Z024ARFS:                                                         0545
*                           DO;                                    0545
Z024ARFS DS    0H                                                  0546
*                             CALL IGGPARFS;                       0546
         L     @15,@CV03720                                        0546
         BALR  @14,@15                                             0546
*                             GEN(RLDSBREG IGGPARFS);/* RELOAD     0547
*                                      SECONDARY BASE REG            */
         RLDSBREG IGGPARFS
*                           END;    /* YES,CALL SPILL ROUTINE        */
*                         GEN REFS(CCAMNAT)                        0549
*                             (MVC CCAMNAT(248,11),CCAMNAT+8(11));/*
*                                      PUSH AND TRACK                */
@RF00544 DS    0H                                                  0549
         MVC CCAMNAT(248,11),CCAMNAT+8(11)
*                       END;                                       0550
*                     END;          /*                       @Y30SSSB*/
*                   IF CCACD1=RCS THEN/* GET STG OK          @Y30SSSB*/
@RC00540 CLI   CCACD1(R11),0                                       0552
         BNE   @RF00552                                            0552
*                     DO;           /* INIT THE RPL          @Y30SSSB*/
*                       RFY                                        0554
*                         IFGRPL BASED(CAXRPL);/* REBASE RPL         */
*                       CAXRPL=CCAMNADR;/* RPL ADDR          @Y30SSSB*/
         L     @15,CCAACB(,R11)                                    0555
         L     @15,ACBUAPTR(,@15)                                  0555
         L     @05,CCAMNADR(,R11)                                  0555
         ST    @05,CAXRPL(,@15)                                    0555
*                       RPLCOMN=RPLCOMN&&RPLCOMN;/*          @Y30SSSB*/
         XC    RPLCOMN(76,@05),RPLCOMN(@05)                        0556
*                       RPLDACB=CAXACB;/* ACB ADDR           @Y30SSSB*/
         L     @00,CAXACB(,@15)                                    0557
         ST    @00,RPLDACB(,@05)                                   0557
*                       RPLBUFL=B512;/* BUFFER SIZE          @Y30SSSB*/
         MVC   RPLBUFL(4,@05),@CF01087                             0558
*                       CAXRPLCT=1; /* NO. OF RPLS           @Y30SSSB*/
         MVC   CAXRPLCT(2,@15),@CH00038                            0559
*                       CAXASID=PSAAOLD->ASCBASID;/* SET THE AS ID 0560
*                                      FIELD                 @Y30SSSB*/
         L     @05,PSAAOLD                                         0560
         LH    @05,ASCBASID(,@05)                                  0560
         N     @05,@CF04164                                        0560
         STH   @05,CAXASID(,@15)                                   0560
*                       IF CAXSCHWA^=0 THEN/* NEED TCB ADDR  @ZA10883*/
         L     @15,CAXSCHWA(,@15)                                  0561
         LTR   @15,@15                                             0561
         BZ    @RF00561                                            0561
*                         CBSCRTCB=CCATCB;/* SET TCB ADDR    @Y30SSSB*/
         L     @15,CVTPTR                                          0562
         L     @15,CVTCBSP(,@15)                                   0562
         L     @05,CCATCB(,R11)                                    0562
         ST    @05,CBSCRTCB(,@15)                                  0562
*                       RFY                                        0563
*                         IFGRPL BASED(CCARPL1);/* REBASE RPL        */
@RF00561 DS    0H                                                  0564
*                     END;          /*                       @Y30SSSB*/
*                   ELSE                                           0565
*                     ;             /* GET STG ERROR         @Y30SSSB*/
@RF00552 DS    0H                                                  0566
*                 END;              /*                       @Y30SSSB*/
*               ELSE                                               0567
*                 ;                 /*                       @Y30SSSB*/
@RF00533 DS    0H                                                  0568
*               GOTO CAXCLEAR;      /* NO NEED TO GET RPLS   @Y30SSSB*/
         B     CAXCLEAR                                            0568
*             END;                  /*                       @Y30SSSB*/
*           ELSE                                                   0570
*             ;                     /*                       @Y30SSSB*/
@RF00531 DS    0H                                                  0571
*           IF ACBOPEN=ON           /* IS ACB OPENED                 */
*             THEN                                                 0571
         L     @15,CCAACB(,R11)                                    0571
         TM    ACBOPEN(@15),B'00010000'                            0571
         BNO   @RF00571                                            0571
*             DO;                   /* YES                           */
*               IF ACBSCRA^=ON THEN /* NO RPLS FOR CRA REQ           */
         TM    ACBSCRA(@15),B'00001000'                            0573
         BO    @RF00573                                            0573
*                 DO;               /*                       @Y30SSSB*/
*                   IF CAXF2REC=ON THEN/* RECOVERABLE CATALOG        */
         L     @05,ACBUAPTR(,@15)                                  0575
         TM    CAXF2REC(@05),B'00000010'                           0575
         BNO   @RF00575                                            0575
*                     BUFDRNO=BUFDRNO+2;/* 2 CRA RPLS        @Y30SSSB*/
         L     @15,ACBAMBL(,@15)                                   0576
         L     @15,AMBLDTA(,@15)                                   0576
         L     @15,AMBBUFC(,@15)                                   0576
         LA    @05,2                                               0576
         SLR   @00,@00                                             0576
         IC    @00,BUFDRNO(,@15)                                   0576
         ALR   @05,@00                                             0576
         STC   @05,BUFDRNO(,@15)                                   0576
*                   ELSE                                           0577
*                     ;             /*                       @Y30SSSB*/
@RF00575 DS    0H                                                  0578
*                   CCAMNLEN=(BUFDRNO-1)*LENGTH(XTNDRPL);          0578
         L     @15,CCAACB(,R11)                                    0578
         L     @15,ACBAMBL(,@15)                                   0578
         L     @15,AMBLDTA(,@15)                                   0578
         L     @15,AMBBUFC(,@15)                                   0578
         SLR   @05,@05                                             0578
         IC    @05,BUFDRNO(,@15)                                   0578
         BCTR  @05,0                                               0578
         MH    @05,@CH00143                                        0578
         STCM  @05,7,CCAMNLEN(R11)                                 0578
*                   R1=ADDR(CCAMSSPL);/* POINT TO STRG MGMT P.L.     */
         LA    R1,CCAMSSPL(,R11)                                   0579
*                   CCAMNSPL=SSUBPOOL;/* STORE SUBPOOL VALUE         */
*                                                                  0580
         MVI   CCAMNSPL(R11),X'F1'                                 0580
*                   /*************************************************/
*                   /*                                               */
*                   /* ALLOCATE MAIN STORAGE FROM SYSTEM SUBPOOL 241 */
*                   /*                                               */
*                   /*************************************************/
*                                                                  0581
*                   GEN(GETMAIN LC,MF=(E,(1)));/* GET MAIN STORAGE 0581
*                                      SPACE                         */
         GETMAIN LC,MF=(E,(1))
*                   GEN(LR R1,R15); /* PICK UP RETURN CODE           */
         LR R1,R15
*                   IF R1^=NOGETMSE THEN/* CHECK FOR ERROR RETURN    */
*                                                                  0583
         LTR   R1,R1                                               0583
         BZ    @RF00583                                            0583
*                     /***********************************************/
*                     /*                                             */
*                     /* SET CCAMODID='C9', CCAREASN=RSN2,           */
*                     /* CCARETRN=RCINSSWA                           */
*                     /*                                             */
*                     /***********************************************/
*                                                                  0584
*                     CCAPROB=IGGSEGID+(RSN2*K256)+RCINSSWA;/*     0584
*                                      INSUFFICIENT CORE ERROR       */
         MVC   CCAPROB(4,R11),@CF04152                             0584
*                   ELSE            /* GETMAIN SUCCESSFUL            */
*                     DO;                                          0585
         B     @RC00583                                            0585
@RF00583 DS    0H                                                  0586
*                       DO;                                        0586
*                         IF MNATFULL=ON THEN/* TRACKING TABLE FULL  */
*                                                                  0587
         TM    MNATFULL(R11),B'10000000'                           0587
         BNO   @RF00587                                            0587
*                           /*****************************************/
*                           /*                                       */
*                           /* CALL TO MODULE IGG0CLAT               */
*                           /*                                       */
*                           /*****************************************/
*                                                                  0588
*Z028ARFS:                                                         0588
*                           DO;                                    0588
Z028ARFS DS    0H                                                  0589
*                             CALL IGGPARFS;                       0589
         L     @15,@CV03720                                        0589
         BALR  @14,@15                                             0589
*                             GEN(RLDSBREG IGGPARFS);/* RELOAD     0590
*                                      SECONDARY BASE REG            */
         RLDSBREG IGGPARFS
*                           END;    /* YES,CALL SPILL ROUTINE        */
*                         GEN REFS(CCAMNAT)                        0592
*                             (MVC CCAMNAT(248,11),CCAMNAT+8(11));/*
*                                      PUSH AND TRACK                */
@RF00587 DS    0H                                                  0592
         MVC CCAMNAT(248,11),CCAMNAT+8(11)
*                       END;                                       0593
*                       MNATSCLS=ON;/* INDICATE CLASS S CORE         */
         OI    MNATSCLS(R11),B'00000001'                           0594
*                     END;          /* GET CORE                      */
*                   IF CCACD1^=RCS THEN/* GETMAIN FAIL       @Y30SSSM*/
@RC00583 CLI   CCACD1(R11),0                                       0596
         BNE   @RT00596                                            0596
*                     GOTO CAXCLEAR;/* YES,SKIP RPL          @Y30SSSM
*                                      PROCESSING            @Y30SSSM*/
*                   CAXRPL=CCAMNADR;/* SAVE ADDR OF CORE             */
         L     @15,CCAACB(,R11)                                    0598
         L     @15,ACBUAPTR(,@15)                                  0598
         L     @05,CCAMNADR(,R11)                                  0598
         ST    @05,CAXRPL(,@15)                                    0598
*                   DO CAXRPLCT=1 TO(BUFDRNO-1);/* INIT RPLS         */
         LA    @15,1                                               0599
         B     @DE00599                                            0599
@DL00599 DS    0H                                                  0600
*                     RPLPOOL(CAXRPLCT,1:LENGTH(XTNDRPL))=RPLPOOL( 0600
*                         CAXRPLCT,1:LENGTH(XTNDRPL))&&RPLPOOL(CAXRPLCT
*                         ,1:LENGTH(XTNDRPL));                     0600
         L     @15,CCAACB(,R11)                                    0600
         L     @15,ACBUAPTR(,@15)                                  0600
         LH    @05,CAXRPLCT(,@15)                                  0600
         MH    @05,@CH00143                                        0600
         L     @09,CAXRPL(,@15)                                    0600
         ST    @05,@TF00001                                        0600
         ALR   @05,@09                                             0600
         AL    @05,@CF04165                                        0600
         XC    RPLPOOL(80,@05),RPLPOOL(@05)                        0600
*                     CCARPL1=ADDR(RPLPOOL(CAXRPLCT));             0601
         L     @05,@TF00001                                        0601
         AL    @09,@CF04165                                        0601
         LA    @05,RPLPOOL(@05,@09)                                0601
         ST    @05,CCARPL1(,R11)                                   0601
*                     RPLDACB=CAXACB;/* SET ACB ADDR IN RPL          */
         L     @15,CAXACB(,@15)                                    0602
         ST    @15,RPLDACB(,@05)                                   0602
*                     RPLBUFL=B512; /* INIT BUFFER SIZE              */
         MVC   RPLBUFL(4,@05),@CF01087                             0603
*                   END;            /* END OF RPL INIT.              */
         L     @05,CCAACB(,R11)                                    0604
         L     @05,ACBUAPTR(,@05)                                  0604
         LA    @15,1                                               0604
         AH    @15,CAXRPLCT(,@05)                                  0604
@DE00599 L     @05,CCAACB(,R11)                                    0604
         L     @05,ACBUAPTR(,@05)                                  0604
         STH   @15,CAXRPLCT(,@05)                                  0604
         L     @05,CCAACB(,R11)                                    0604
         L     @05,ACBAMBL(,@05)                                   0604
         L     @05,AMBLDTA(,@05)                                   0604
         L     @05,AMBBUFC(,@05)                                   0604
         SLR   @00,@00                                             0604
         IC    @00,BUFDRNO(,@05)                                   0604
         BCTR  @00,0                                               0604
         CR    @15,@00                                             0604
         BNH   @DL00599                                            0604
*                   IF CAXF2REC=ON THEN/* RECOVERABLE CATALOG        */
         L     @15,CCAACB(,R11)                                    0605
         L     @05,ACBUAPTR(,@15)                                  0605
         TM    CAXF2REC(@05),B'00000010'                           0605
         BNO   @RF00605                                            0605
*                     BUFDRNO=BUFDRNO-2;/* 2 CRA RPLS        @Y30SSSB*/
         L     @15,ACBAMBL(,@15)                                   0606
         L     @15,AMBLDTA(,@15)                                   0606
         L     @15,AMBBUFC(,@15)                                   0606
         SLR   @05,@05                                             0606
         IC    @05,BUFDRNO(,@15)                                   0606
         BCTR  @05,0                                               0606
         BCTR  @05,0                                               0606
         STC   @05,BUFDRNO(,@15)                                   0606
*                   ELSE                                           0607
*                     ;             /*                       @Y30SSSB*/
@RF00605 DS    0H                                                  0608
*                   CAXRPLCT=BUFDRNO-1;/* SET RPL CNT                */
         L     @15,CCAACB(,R11)                                    0608
         L     @05,ACBUAPTR(,@15)                                  0608
         L     @09,ACBAMBL(,@15)                                   0608
         L     @09,AMBLDTA(,@09)                                   0608
         L     @09,AMBBUFC(,@09)                                   0608
         SLR   @00,@00                                             0608
         IC    @00,BUFDRNO(,@09)                                   0608
         BCTR  @00,0                                               0608
         STH   @00,CAXRPLCT(,@05)                                  0608
*                   CCARPL1=CAXRPL; /* ADDR OF FIRST RPL             */
         L     @00,CAXRPL(,@05)                                    0609
         ST    @00,CCARPL1(,R11)                                   0609
*                   IF CAXBLD^=ON THEN/* NOT BUILD REQ               */
         TM    CAXBLD(@05),B'10000000'                             0610
         BO    @RF00610                                            0610
*                     DO;           /* MUST VERIFY CATLG             */
*                       CCAMLRET=R13+12;/* RETURN POINT        Y02020*/
         LA    @05,12                                              0612
         ALR   @05,R13                                             0612
         ST    @05,CCAMLRET(,R11)                                  0612
*                       RPLDACB=CCAACB;/* GET CALLER ACB       Y02020*/
*                                                                  0613
         LR    @05,@00                                             0613
         ST    @15,RPLDACB(,@05)                                   0613
*                       /*********************************************/
*                       /*                                           */
*                       /* CALL TO MODULE IGG0CLAG                   */
*                       /*                                           */
*                       /*********************************************/
*                                                                  0614
*Z029RCCR:                                                         0614
*                       DO;                                        0614
Z029RCCR DS    0H                                                  0615
*                         CALL IGGPRCCR;                           0615
         L     @15,@CV03724                                        0615
         BALR  @14,@15                                             0615
*                         GEN(RLDSBREG IGGPRCCR);/* RELOAD SECONDARY
*                                      BASE REG                      */
         RLDSBREG IGGPRCCR
*                       END;                                       0617
*                     END;          /*                       @Y30SSSB*/
*                   ELSE                                           0619
*                     ;             /*                       @Y30SSSB*/
@RF00610 DS    0H                                                  0620
*                 END;              /*                       @Y30SSSB*/
*               ELSE                /* INIT CRA RPL          @Y30SSSB*/
*                 IF CAXBLD=OFF THEN/* NOT CRA BUILD         @Y30SSSB*/
         B     @RC00573                                            0621
@RF00573 L     @15,CCAACB(,R11)                                    0621
         L     @15,ACBUAPTR(,@15)                                  0621
         TM    CAXBLD(@15),B'10000000'                             0621
         BNZ   @RF00621                                            0621
*                   DO;             /*                       @Y30SSSB*/
*                     R1=CAXACB;    /* GET CAT ACB ADDR      @Y30SSSB*/
         L     R1,CAXACB(,@15)                                     0623
*                     RFY                                          0624
*                       IFGACB BASED(R1);/*                  @Y30SSSB*/
*                     CCARPL1=ADDR(RPLPOOL(CAXRPLCT+1));           0625
         LA    @15,80                                              0625
         L     @05,ACBUAPTR(,R1)                                   0625
         LR    @09,@15                                             0625
         MH    @09,CAXRPLCT(,@05)                                  0625
         L     @05,CAXRPL(,@05)                                    0625
         LA    @05,RPLPOOL(@09,@05)                                0625
         ST    @05,CCARPL1(,R11)                                   0625
*                     RFY                                          0626
*                       IFGACB BASED(CCAACB);/*              @Y30SSSB*/
*                     IF RPLACTIV^=0 THEN/* RPL IN USE       @Y30SSSB*/
         CLI   RPLACTIV(@05),0                                     0627
         BE    @RF00627                                            0627
*                       CCARPL1=CCARPL1+LENGTH(XTNDRPL);           0628
         ALR   @05,@15                                             0628
         ST    @05,CCARPL1(,R11)                                   0628
*                     ELSE                                         0629
*                       ;           /* RPL IS FREE           @Y30SSSB*/
@RF00627 DS    0H                                                  0630
*                     RPLARG=ADDR(CCARARBA);/* ARG ADDR      @Y30SSSB*/
         L     @15,CCARPL1(,R11)                                   0630
         LA    @05,CCARARBA(,R11)                                  0630
         ST    @05,RPLARG(,@15)                                    0630
*                     RPLDACB=CCAACB;/*                      @Y30SSSB*/
         L     @05,CCAACB(,R11)                                    0631
         ST    @05,RPLDACB(,@15)                                   0631
*                     CCARAACB=CCAACB;/*                     @Y30SSSB*/
         ST    @05,CCARAACB(,R11)                                  0632
*                     CCARARPL=CCARPL1;/*                    @Y30SSSB*/
*                                                                  0633
         ST    @15,CCARARPL(,R11)                                  0633
*                     /***********************************************/
*                     /*                                             */
*                     /* CALL TO MODULE IGG0CLBO                     */
*                     /*                                             */
*                     /***********************************************/
*                                                                  0634
*Z030RARC:                                                         0634
*                     DO;                                          0634
Z030RARC DS    0H                                                  0635
*                       CALL IGGPRARC;                             0635
         L     @15,@CV03723                                        0635
         BALR  @14,@15                                             0635
*                       GEN(RLDSBREG IGGPRARC);/* RELOAD SECONDARY 0636
*                                      BASE REG                      */
         RLDSBREG IGGPRARC
*                     END;          /* READ CRA CCR          @ZA29164*/
*                   END;            /* NOT CRA BUILD         @Y30SSSB*/
*                 ELSE                                             0639
*                   ;               /* CRA BUILD             @Y30SSSB*/
@RF00621 DS    0H                                                  0640
*               IF CAXBLD^=ON THEN  /* NOT BUILD REQ         @Y30SSSB*/
@RC00573 L     @15,CCAACB(,R11)                                    0640
         L     @15,ACBUAPTR(,@15)                                  0640
         TM    CAXBLD(@15),B'10000000'                             0640
         BO    @RF00640                                            0640
*                 DO;               /* MUST VERIFY CATLG     @Y30SSSB*/
*                   IF CCACD1=RCS THEN/* CCR CKECK, OKAY             */
         CLI   CCACD1(R11),0                                       0642
         BNE   @RF00642                                            0642
*                     DO;                                          0643
*                       RPLSEQ=OFF; /* CLEAR SEQUEN PRO INDIC        */
         L     @15,CCARPL1(,R11)                                   0644
         NI    RPLSEQ(@15),B'11011111'                             0644
*                       RPLADR=OFF; /* CLEAR ADDRESSING INDIC        */
         NI    RPLADR(@15),B'10111111'                             0645
*                       RFY                                        0646
*                         R1 RSTD;                                 0646
*                       R1=CCARPL1; /* GET RPL ADDR          @Y30SSSB*/
         LR    R1,@15                                              0647
*                       RFY                                        0648
*                         IFGRPL BASED(R1);                        0648
*                       RPLDIR=ON;                                 0649
         OI    RPLDIR(R1),B'01000000'                              0649
*                       RPLCNV=ON;                                 0650
         OI    RPLCNV(R1),B'00100000'                              0650
*                       R13=R13+12; /* ADJ SAVEAREA PTR              */
         AL    R13,@CF00075                                        0651
*                       GEN(VERIFY RPL=(1));/* VERIFY CATLG          */
         VERIFY RPL=(1)
*                       R13=R13-12;                                0653
         SL    R13,@CF00075                                        0653
*                       IF RPLRTNCD^='00'X THEN                    0654
*                                                                  0654
         CLI   RPLRTNCD(R1),0                                      0654
         BE    @RF00654                                            0654
*                         /*******************************************/
*                         /*                                         */
*                         /* SET CCAMODID='C9', CCAREASN=RSN4,       */
*                         /* CCARETRN=RCIONL                         */
*                         /*                                         */
*                         /*******************************************/
*                                                                  0655
*                         CCAPROB=IGGSEGID+(RSN4*K256)+RCIONL;/* SET
*                                      VERIFY ERROR CODE     @Y30SSSM*/
         MVC   CCAPROB(4,R11),@CF04155                             0655
*                       ELSE                                       0656
*                         ;                                        0656
@RF00654 DS    0H                                                  0657
*                       RFY                                        0657
*                         R1 UNRSTD;                               0657
*                     END;          /* END OF VERIFY CODE            */
*                   ELSE                                           0659
*                     ;                                            0659
@RF00642 DS    0H                                                  0660
*                   RFY                                            0660
*                     IFGRPL BASED(CCARPL1);/*                 Y02020*/
*                   RPLDACB=CAXACB; /* RESTORE ACB             Y02020*/
         L     @15,CCARPL1(,R11)                                   0661
         L     @05,CCAACB(,R11)                                    0661
         L     @05,ACBUAPTR(,@05)                                  0661
         L     @05,CAXACB(,@05)                                    0661
         ST    @05,RPLDACB(,@15)                                   0661
*                 END;                                             0662
*               ELSE                                               0663
*                 ;                 /* IT IS A BUILD                 */
@RF00640 DS    0H                                                  0664
*             END;                                                 0664
*           ELSE                                                   0665
*             ;                     /* ACB NOT OPENED                */
@RF00571 DS    0H                                                  0666
*         END;                      /* END OF DO FOR OPEN            */
*       ELSE                                                       0667
*         ;                         /* NOT OPEN                      */
*                                                                  0667
@RF00520 DS    0H                                                  0668
*       /*************************************************************/
*       /*                                                           */
*       /* CHECK FOR CLOSE                                           */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0668
*CAXCLEAR:                                                         0668
*       IF CAXCLS=ON                /* IS THIS CLOSE                 */
*         THEN                                                     0668
CAXCLEAR L     @15,CCAACB(,R11)                                    0668
         L     @05,ACBUAPTR(,@15)                                  0668
         TM    CAXCLS(@05),B'00100000'                             0668
         BNO   @RF00668                                            0668
*         DO;                       /* YES                           */
*           IF(ACBUCRA^=ON&ACBSCRA^=ON)×(ACBUCRA=ON&CAXRPLCT^=0) THEN
         TM    ACBUCRA(@15),B'00001100'                            0670
         BZ    @RT00670                                            0670
         L     @15,CCAACB(,R11)                                    0670
         TM    ACBUCRA(@15),B'00000100'                            0670
         BNO   @RF00670                                            0670
         L     @15,ACBUAPTR(,@15)                                  0670
         LH    @15,CAXRPLCT(,@15)                                  0670
         LTR   @15,@15                                             0670
         BZ    @RF00670                                            0670
@RT00670 DS    0H                                                  0671
*                                   /* RPL TO FREE           @ZA10883*/
*             DO;                   /*                       @Y30SSSB*/
*                                                                  0671
*               /*****************************************************/
*               /*                                                   */
*               /* MUST FREE RPL'S                           @Y30SSSB*/
*               /*                                           @Y30SSSB*/
*               /*                                                   */
*               /*****************************************************/
*                                                                  0672
*               IF CAXF2REC=ON&     /* RECOVERABLE CAT       @Y30SSSB*/
*                   ACBUCRA=OFF THEN/* NOT CRA REQ           @Y30SSSB*/
         L     @15,CCAACB(,R11)                                    0672
         L     @05,ACBUAPTR(,@15)                                  0672
         TM    CAXF2REC(@05),B'00000010'                           0672
         BNO   @RF00672                                            0672
         TM    ACBUCRA(@15),B'00000100'                            0672
         BNZ   @RF00672                                            0672
*                 CAXRPLCT=CAXRPLCT+2;/* 2 CRA RPLS                  */
         LA    @15,2                                               0673
         AH    @15,CAXRPLCT(,@05)                                  0673
         STH   @15,CAXRPLCT(,@05)                                  0673
*               ELSE                                               0674
*                 ;                 /*                       @Y30SSSB*/
@RF00672 DS    0H                                                  0675
*               IF ACBUCRA=ON&      /* CRA REQUEST &         @ZA10883*/
*                   CBSCRACA=ACBUAPTR&/* CRA CAXWA CHAIN     @ZA10883*/
*                   CBSCRTCB=CCATCB THEN/* CRA TASK TCB      @ZA10883*/
         L     @15,CCAACB(,R11)                                    0675
         TM    ACBUCRA(@15),B'00000100'                            0675
         BNO   @RF00675                                            0675
         L     @05,CVTPTR                                          0675
         L     @05,CVTCBSP(,@05)                                   0675
         CLC   CBSCRACA(4,@05),ACBUAPTR(@15)                       0675
         BNE   @RF00675                                            0675
         CLC   CBSCRTCB(4,@05),CCATCB(R11)                         0675
         BNE   @RF00675                                            0675
*                 DO;               /* CLEAN UP CBS          @Y30SSSB*/
*                   CBSCRTCB=0;     /* CLEAR TCB ADDR        @Y30SSSB*/
         SLR   @15,@15                                             0677
         ST    @15,CBSCRTCB(,@05)                                  0677
*                   CBSCRACA=0;     /* CLEAR CAX CHN         @Y30SSSB*/
         ST    @15,CBSCRACA(,@05)                                  0678
*                 END;              /*                       @Y30SSSB*/
*               ELSE                                               0680
*                 ;                 /*                       @Y30SSSB*/
@RF00675 DS    0H                                                  0681
*               CCAMNLEN=CAXRPLCT*LENGTH(XTNDRPL);                 0681
         L     @15,CCAACB(,R11)                                    0681
         L     @05,ACBUAPTR(,@15)                                  0681
         LH    @09,CAXRPLCT(,@05)                                  0681
         MH    @09,@CH00143                                        0681
         STCM  @09,7,CCAMNLEN(R11)                                 0681
*               CCAMNADR=CAXRPL;    /* GET PTR TO CORE               */
         L     @05,CAXRPL(,@05)                                    0682
         ST    @05,CCAMNADR(,R11)                                  0682
*               RFY                                                0683
*                 R1 RSTD;                                         0683
*               IF ACBUCRA=OFF THEN /* NOT USER CRA          @Y30SSSM*/
         TM    ACBUCRA(@15),B'00000100'                            0684
         BNZ   @RF00684                                            0684
*                 DO;               /* YES                   @Y30SSSM*/
*                   R1=ADDR(CCAMSSPL);/* POINT TO STRG MGMT P.L.     */
         LA    R1,CCAMSSPL(,R11)                                   0686
*                   CCAMNSPL=SSUBPOOL;/* STORE SUBPOOL VALUE         */
*                                                                  0687
         MVI   CCAMNSPL(R11),X'F1'                                 0687
*                   /*************************************************/
*                   /*                                               */
*                   /* RELEASE MAIN STORAGE FROM SYSTEM SUBPOOL 241  */
*                   /*                                               */
*                   /*************************************************/
*                                                                  0688
*                   GEN(FREEMAIN L,MF=(E,(1))) ;/*           @Y30SSSM*/
         FREEMAIN L,MF=(E,(1))
*                 END;              /* END NOT USER CRA      @Y30SSSM*/
*               ELSE                                               0690
*                 DO;               /* USER CRA              @Y30SSSM*/
         B     @RC00684                                            0690
@RF00684 DS    0H                                                  0691
*                   R1=ADDR(CCAMSSPL);/* POINT TO STRG MGMT P.L.     */
         LA    R1,CCAMSSPL(,R11)                                   0691
*                   CCAMNSPL=USUBPOOL;/* STORE SUBPOOL VALUE         */
*                                                                  0692
         MVI   CCAMNSPL(R11),X'FC'                                 0692
*                   /*************************************************/
*                   /*                                               */
*                   /* RELEASE MAIN STORAGE FROM USER SUBPOOL 252    */
*                   /*                                               */
*                   /*************************************************/
*                                                                  0693
*                   GEN(FREEMAIN L,MF=(E,(1))) ;/*           @Y30SSSM*/
         FREEMAIN L,MF=(E,(1))
*                 END;              /* END USER CRA          @Y30SSSM*/
*               RFY                                                0695
*                 R1 UNRSTD;                                       0695
@RC00684 DS    0H                                                  0696
*               CAXRPLCT=ZERO;      /* ZERO RPL COUNT                */
         SLR   @15,@15                                             0696
         L     @05,CCAACB(,R11)                                    0696
         L     @05,ACBUAPTR(,@05)                                  0696
         STH   @15,CAXRPLCT(,@05)                                  0696
*               CAXRPL=ZERO;        /* ZERO RPL PTR IN CAXWA         */
         ST    @15,CAXRPL(,@05)                                    0697
*             END;                  /*                       @Y30SSSB*/
*           ELSE                                                   0699
*             ;                     /*                       @Y30SSSB*/
@RF00670 DS    0H                                                  0700
*           IF CAXSCR^=ON&          /* NOT SCHEDULER INVOKED         */
*               CAXCMR^=ON          /* OR NOT CATLG MGM'T INVOK      */
*             THEN                                                 0700
         L     @15,CCAACB(,R11)                                    0700
         L     @15,ACBUAPTR(,@15)                                  0700
         TM    CAXSCR(@15),B'00000011'                             0700
         BNZ   @RF00700                                            0700
*             DO;                   /* YES                           */
*                                                                  0701
*               /*****************************************************/
*               /*                                                   */
*               /* FREE IN-CORE RAC PROFILE, IF PRESENT      @Z40RSRC*/
*               /*                                                   */
*               /*****************************************************/
*                                                                  0702
*               IF CAXRAC=ON        /* IF CAT RAC DEF'D      @Z40RSRC*/
*                   &CAXRACP^=ZERO THEN/* & PROFILE PRESENT  @Z40RSRC*/
         TM    CAXRAC(@15),B'00010000'                             0702
         BNO   @RF00702                                            0702
         L     @15,CAXRACP(,@15)                                   0702
         LTR   @15,@15                                             0702
         BZ    @RF00702                                            0702
*                 DO;               /*                       @Z40RSRC*/
*                   CCAMNLEN=RRPLEN;/* LENGTH OF PROFILE     @Z40RSRC*/
         MVC   CCAMNLEN(3,R11),RRPLEN(@15)                         0704
*                   CCAMNADR=CAXRACP;/* ADDR OF PROFILE      @Z40RSRC*/
         ST    @15,CCAMNADR(,R11)                                  0705
*                   RFY                                            0706
*                     R1 RSTD;      /*                       @Z40RSRC*/
*                   R1=ADDR(CCAMSSPL);/* ADDR OF SUBPOOL     @Z40RSRC*/
         LA    R1,CCAMSSPL(,R11)                                   0707
*                   CCAMNSPL=RRPSP; /* SET SUBPOOL           @Z40RSRC*/
         IC    @05,RRPSP(,@15)                                     0708
         STC   @05,CCAMNSPL(,R11)                                  0708
*                   GEN(FREEMAIN L,MF=(E,(1)));/* FREE PROFILE     0709
*                                                            @Z40RSRC*/
         FREEMAIN L,MF=(E,(1))
*                   RFY                                            0710
*                     R1 UNRSTD;    /*                       @Z40RSRC*/
*                 END;              /*                       @Z40RSRC*/
*               ELSE                                               0712
*                 ;                 /* NO RAC PROFILE        @Z40RSRC*/
*                                                                  0712
@RF00702 DS    0H                                                  0713
*               /*****************************************************/
*               /*                                                   */
*               /* MUST FREE CAXWA                                   */
*               /*                                                   */
*               /*****************************************************/
*                                                                  0713
*               CCAMNLEN=LENGTH(IGGCAXWA);/* SIZE                    */
         MVC   CCAMNLEN(3,R11),@CF00181+1                          0713
*               CCAMNADR=ACBUAPTR;  /* ADDR OF CORE                  */
         L     @15,CCAACB(,R11)                                    0714
         L     @05,ACBUAPTR(,@15)                                  0714
         ST    @05,CCAMNADR(,R11)                                  0714
*               ACBUAPTR=COPACB;    /* RESTORE CRA ACCESS PARM LIST
*                                      PTR                   @ZA10883*/
         L     @05,COPACB-1(,@05)                                  0715
         LA    @05,0(,@05)                                         0715
         ST    @05,ACBUAPTR(,@15)                                  0715
*               RFY                                                0716
*                 R1 RSTD;                                         0716
*               R1=ADDR(CCAMSSPL);  /* POINT TO STRG MGMT P.L.       */
         LA    R1,CCAMSSPL(,R11)                                   0717
*               CCAMNSPL=SSUBPOOL;  /* STORE SUBPOOL VALUE           */
*                                                                  0718
         MVI   CCAMNSPL(R11),X'F1'                                 0718
*               /*****************************************************/
*               /*                                                   */
*               /* RELEASE MAIN STORAGE FROM SYSTEM SUBPOOL 241      */
*               /*                                                   */
*               /*****************************************************/
*                                                                  0719
*               GEN(FREEMAIN L,MF=(E,(1))) ;/* FREEMAIN Y02020       */
         FREEMAIN L,MF=(E,(1))
*               RFY                                                0720
*                 R1 UNRSTD;                                       0720
*             END;                  /* END OF DO FOR SCHED INVOK     */
*           ELSE                    /* NOT SCHEDULER INVOKED @ZA25763*/
*             CAXFLGS=CAXFLGS&MASK; /*                       @ZA25763
*                                      RESET O/C/EOV EARLY EXIT      */
         B     @RC00700                                            0722
@RF00700 L     @15,CCAACB(,R11)                                    0722
         L     @15,ACBUAPTR(,@15)                                  0722
         SLR   @05,@05                                             0722
         IC    @05,CAXFLGS(,@15)                                   0722
         N     @05,@CF00551                                        0722
         STC   @05,CAXFLGS(,@15)                                   0722
*         END;                      /* END OF DO FOR CLOSE           */
*       ELSE                        /* NOT CLOSE IN CONTROL  @ZA25763*/
*                                                                  0724
*         /***********************************************************/
*         /*                                                         */
*         /* CHECK FOR END OF VOLUME                                 */
*         /*                                                         */
*         /***********************************************************/
*                                                                  0724
*         CAXFLGS=CAXFLGS&MASK;     /* RESET O/C/EOV EARLY EXIT      */
         B     @RC00668                                            0724
@RF00668 L     @15,CCAACB(,R11)                                    0724
         L     @15,ACBUAPTR(,@15)                                  0724
         SLR   @05,@05                                             0724
         IC    @05,CAXFLGS(,@15)                                   0724
         N     @05,@CF00551                                        0724
         STC   @05,CAXFLGS(,@15)                                   0724
*     END;                          /* END OF DO FOR EARLY EXIT      */
*   ELSE                                                           0726
*     DO;                           /* NOT EARLY EXIT                */
         B     @RC00515                                            0726
@RF00515 DS    0H                                                  0727
*       CCAPROBX=CCAPROB;           /* SAVE CODE             @Y30SSSM*/
         L     @15,CCAPROB(,R11)                                   0727
         ST    @15,CCAPROBX(,R11)                                  0727
*       CCAPROB=CCAPROB&&CCAPROB;   /* CLEAR BYTE            @Y30SSSM*/
         LR    @05,@15                                             0728
         XR    @05,@15                                             0728
         ST    @05,CCAPROB(,R11)                                   0728
*     END;                                                         0729
*                                                                  0729
*   /*****************************************************************/
*   /*                                                               */
*   /* CHECK FOR CHK PT. CCR                                         */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0730
*   IF CCAF1CR=ON                   /* CKPT CCR REQUIRED             */
*     THEN                                                         0730
@RC00515 TM    CCAF1CR(R11),B'00000100'                            0730
         BNO   @RF00730                                            0730
*     DO;                           /* YES                           */
*       CCAMLRET=R13+SASIZ;         /* INSURE ERROR RETURN HERE    0732
*                                                            @YM05713*/
*                                                                  0732
         LA    @15,12                                              0732
         ALR   @15,R13                                             0732
         ST    @15,CCAMLRET(,R11)                                  0732
*       /*************************************************************/
*       /*                                                           */
*       /* CALL TO MODULE IGG0CLAG                                   */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0733
*Z035CCCR:                                                         0733
*       DO;                                                        0733
Z035CCCR DS    0H                                                  0734
*         CALL IGGPCCCR;                                           0734
         L     @15,@CV03721                                        0734
         BALR  @14,@15                                             0734
*         GEN(RLDSBREG IGGPCCCR);   /* RELOAD SECONDARY BASE REG     */
         RLDSBREG IGGPCCCR
*       END;                        /* CHECKPOINT TTHE CCR   @ZA29164*/
*     END;                                                         0737
*   ELSE                                                           0738
*     ;                                                            0738
*                                                                  0738
@RF00730 DS    0H                                                  0739
*   /*****************************************************************/
*   /*                                                               */
*   /* CALL TO MODULE IGG0CLA3                                       */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0739
*Z036RPLF:                                                         0739
*   DO;                                                            0739
Z036RPLF DS    0H                                                  0740
*     CALL IGGPRPLF;                                               0740
         L     @15,@CV03725                                        0740
         BALR  @14,@15                                             0740
*     GEN(RLDSBREG IGGPRPLF);       /* RELOAD SECONDARY BASE REG     */
         RLDSBREG IGGPRPLF
*   END;                            /* RELEASE CATALOG RPL   @ZA29164*/
*   RFY                                                            0743
*    (R1) RSTD;                     /*                         Y02020*/
*   IF CCACD1X^=RCS THEN            /* RESET ERROR IF ANY    @Y30SSSM*/
         CLI   CCACD1X(R11),0                                      0744
         BE    @RF00744                                            0744
*     CCAPROB=CCAPROBX;             /* ERROR - COPY IT       @Y30SSSM*/
         L     @15,CCAPROBX(,R11)                                  0745
         ST    @15,CCAPROB(,R11)                                   0745
*   ELSE                                                           0746
*     ;                             /* NO ERROR              @Y30SSSM*/
*                                                                  0746
@RF00744 DS    0H                                                  0747
*   /*****************************************************************/
*   /*                                                               */
*   /* THE FOLLOWING CODE IS A DEBUG AID.                    @Y30SSRG*/
*   /* TO USE THIS AID SET THE 2ND BYTE OF CVTAMFF AS        @Y30SSRG*/
*   /* FOLLOWS:                                              @Y30SSRG*/
*   /*                                                       @Y30SSRG*/
*   /* X'01' = TAKE ACTION FOR ALL CATLG RETURN CODES.       @Y30SSRG*/
*   /* X'02' = TAKE ACTION ONLY FOR NON-ZERO RET CODES.      @Y30SSRG*/
*   /* X'03' = TAKE ACTION ONLY FOR ABNORMAL RET CODES.      @Y30SSRG*/
*   /* X'04'-X'FF' = TAKE ACTION WHENEVER THE CATLG          @Y30SSRG*/
*   /* RETURN CODE EQUALS THE VALUE STORD                    @Y30SSRG*/
*   /*                                                       @Y30SSRG*/
*   /* SET THE 3RD & 4TH BYTES OF CVTAMFF TO X"07FE"         @Y30SSRG*/
*   /* (BR 14 INST).                                         @Y30SSRG*/
*   /* ACTIONS:                                              @Y30SSRG*/
*   /* - IF YOU WISH TO TRAP THE EVENT THEN SET A HDWE       @Y30SSRG*/
*   /* ADDRESS STOP OR A DSS "AT" OR A VM "ADSTOP" AT        @Y30SSRG*/
*   /* THE ADDRESS OF CVTAMFF BYTE 3.                        @Y30SSRG*/
*   /* - IF YOU WISH TO CAUSE A MESSAGE TO BE ISSUED         @Y30SSRG*/
*   /* WHENEVER THE EVENT IS DETECTED THEN SET BIT 5         @Y30SSRG*/
*   /* OF THE 1ST BYTE OF CVTAMFF TO A 1 (X'04' BIT).        @Y30SSRG*/
*   /*                                                       @Y30SSRG*/
*   /* NOTE: DO NOT CHANGE THE VALUES OF BITS 0-3            @Y30SSRG*/
*   /* WITHIN THIS BYTE.                                     @Y30SSRG*/
*   /*                                                       @Y30SSRG*/
*   /* TO DISCONTUE USE SET THE 2ND BYTE OF CVTAMFF          @Y30SSRG*/
*   /* TO X'00'.                                             @Y30SSRG*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0747
*   IF DBGARG^='00'X THEN           /* ANY ACTION IND        @Y30SSRG*/
         L     @15,CVTPTR                                          0747
         CLI   DBGARG(@15),0                                       0747
         BE    @RF00747                                            0747
*     DO;                           /* YES                   @Y30SSRG*/
*       IF DBGARG='01'X×            /* ACT ON ALL CODES      @Y30SSRG*/
*           (DBGARG='02'X&          /*                       @Y30SSRG*/
*           CCACD1^=N)×             /* OR NONZERO CODES      @Y30SSRG*/
*           (DBGARG='03'X&          /* OR ABNORM CODES       @Y30SSRG*/
*           CCACD1^=RCS&            /* & ^RC 0               @Y30SSRG*/
*           CCACD1^=RCENT&          /* & ^RC 8               @Y30SSRG*/
*           CCACD1^=RCDSNF&         /* & ^RC 36              @Y30SSRG*/
*           CCACD1^=RCVLSZ&         /* & ^RC 40              @Y30SSRG*/
*           CCACD1^=RCVLSM&         /* & ^RC 44              @Y30SSRG*/
*           CCACD1^=RCNUNIT&        /* & ^RC 76              @Y30SSRG*/
*           (CCACD1^=RCINCNPM×      /* & ^RC 140             @Y30SSRG*/
*           CCACDR^=RSN40)&         /* OR ^REASON CDE 40     @Y30SSRG*/
*           CCACD1^=RCCATUNA&       /* & ^RC 188             @Y30SSRG*/
*           CCACD1^=RCINDER)×       /* & ^RC 240             @Y30SSRG*/
*           DBGARG=CCACD1 THEN      /* OR SPECIFIC CODE      @Y30SSRG*/
         CLI   DBGARG(@15),1                                       0749
         BE    @RT00749                                            0749
         CLI   DBGARG(@15),2                                       0749
         BNE   @GL00013                                            0749
         CLI   CCACD1(R11),0                                       0749
         BNE   @RT00749                                            0749
@GL00013 L     @15,CVTPTR                                          0749
         CLI   DBGARG(@15),3                                       0749
         BNE   @GL00012                                            0749
         CLI   CCACD1(R11),0                                       0749
         BE    @GL00012                                            0749
         CLI   CCACD1(R11),8                                       0749
         BE    @GL00012                                            0749
         CLI   CCACD1(R11),36                                      0749
         BE    @GL00012                                            0749
         CLI   CCACD1(R11),40                                      0749
         BE    @GL00012                                            0749
         CLI   CCACD1(R11),44                                      0749
         BE    @GL00012                                            0749
         CLI   CCACD1(R11),76                                      0749
         BE    @GL00012                                            0749
         CLI   CCACD1(R11),140                                     0749
         BNE   @GL00017                                            0749
         CLI   CCACDR(R11),40                                      0749
         BE    @GL00012                                            0749
@GL00017 CLI   CCACD1(R11),188                                     0749
         BE    @GL00012                                            0749
         CLI   CCACD1(R11),240                                     0749
         BNE   @RT00749                                            0749
@GL00012 L     @15,CVTPTR                                          0749
         CLC   DBGARG(1,@15),CCACD1(R11)                           0749
         BNE   @RF00749                                            0749
@RT00749 DS    0H                                                  0750
*         DO;                       /* YES,TAKE ACTION       @Y30SSRG*/
*           IF DBGMSG=ON THEN       /* MSG REQUESTED         @Y30SSRG*/
         L     @15,CVTPTR                                          0751
         TM    DBGMSG(@15),B'00000100'                             0751
         BNO   @RF00751                                            0751
*             DO;                   /* YES                   @Y30SSRG*/
*               DBSAVAR=DBMSGAR;    /* SV PDL ACROSS MSG WTR CALL  0753
*                                                            @Y30SSRG*/
*                                                                  0753
         L     @15,CCAR0REC(,R11)                                  0753
         MVC   DBSAVAR(96,@15),DBMSGAR(R11)                        0753
*               /*****************************************************/
*               /*                                                   */
*               /* CALL TO MODULE IGG0CLAF                           */
*               /*                                                   */
*               /*****************************************************/
*                                                                  0754
*Z037EMSG:                                                         0754
*               DO;                                                0754
Z037EMSG DS    0H                                                  0755
*                 CALL IGGPEMSG;                                   0755
         L     @15,@CV03722                                        0755
         BALR  @14,@15                                             0755
*                 GEN(RLDSBREG IGGPEMSG);/* RELOAD SECONDARY BASE REG*/
         RLDSBREG IGGPEMSG
*               END;                /* ISSUE MSG             @Y30SSRG*/
*               DBMSGAR=DBSAVAR;    /* RESTORE PDL           @Y30SSRG*/
         L     @15,CCAR0REC(,R11)                                  0758
         MVC   DBMSGAR(96,R11),DBSAVAR(@15)                        0758
*             END;                  /*                       @Y30SSRG*/
*           RFY                                                    0760
*            (R0,                                                  0760
*             R1,                                                  0760
*             R14,                                                 0760
*             R15) RSTD;            /*                       @Y30SSRG*/
@RF00751 DS    0H                                                  0761
*           RFY                                                    0761
*             CTGPL BASED(CCACPL);  /*                       @Y30SSRG*/
*           R0=CPLFLAGS;            /* CPL BYTES 0-2         @Y30SSRG*/
         L     @05,CCACPL(,R11)                                    0762
         SLR   R0,R0                                               0762
         ICM   R0,7,CPLFLAGS(@05)                                  0762
*           GEN REFS(R0)(SLL R0,8); /*                       @Y30SSRG
*                                      MV TO HI BYTES        @Y30SSRG*/
         SLL R0,8
*           R0=R0×CPLCMSCD;         /* CPL BYTE 16           @Y30SSRG*/
         L     @05,CCACPL(,R11)                                    0764
         SLR   @09,@09                                             0764
         IC    @09,CPLCMSCD(,@05)                                  0764
         OR    R0,@09                                              0764
*           R1=CCAPROB;             /* MODID,ECD,RCD         @Y30SSRG*/
         L     R1,CCAPROB(,R11)                                    0765
*           RFY                                                    0766
*            (R2,                                                  0766
*             R3,                                                  0766
*             R5,                                                  0766
*             R6,                                                  0766
*             R7) RSTD;             /*                       @ZA29164*/
*           R2=CCACPL;              /* PT TO INPUT CPL       @Y30SSRG*/
         L     @09,CCACPL(,R11)                                    0767
         LR    R2,@09                                              0767
*           R3=R2->CTGENT;          /* PT TO ENTRY NAME      @Y30SSRG*/
         L     R3,CTGENT(,R2)                                      0768
*           R4=CCATCB;              /* PT TO TCB             @Y30SSRG*/
         L     R4,CCATCB(,R11)                                     0769
*           R5=CCARB;               /* PT TO CATLG RB        @Y30SSRG*/
         L     R5,CCARB(,R11)                                      0770
*           R6=R5->RBLINKB;         /* PT TO CALLERS RB      @Y30SSRG*/
         L     R6,RBLINKB-1(,R5)                                   0771
         LA    R6,0(,R6)                                           0771
*           R7=R6->RBOPSW(5:8);     /* PT TO SVC 26          @Y30SSRG*/
         ICM   R7,15,RBOPSW+4(R6)                                  0772
*           RFY                                                    0773
*            (R8,                                                  0773
*             R9) RSTD;             /*                       @ZA29164*/
*           R8=CCAACB;              /* PT TO CATLG ACB       @Y30SSRG*/
         L     R8,CCAACB(,R11)                                     0774
*           R9=CCARPL1;             /* PT TO CATLG RPL       @Y30SSRG*/
         L     R9,CCARPL1(,R11)                                    0775
*           R15=ADDR(DBGINST);      /* PT TO TRAP INST       #Y30SSRG*/
         L     R15,CVTPTR                                          0776
         LA    R15,DBGINST(,R15)                                   0776
*           GEN(BALR R14,R15);      /* GOTO TRAP             @Y30SSRG*/
         BALR R14,R15
*           RFY                                                    0778
*            (R0,                                                  0778
*             R1,                                                  0778
*             R5,                                                  0778
*             R6,                                                  0778
*             R7,                                                  0778
*             R8,                                                  0778
*             R9,                                                  0778
*             R14,                                                 0778
*             R15) UNRSTD;          /*                       @ZA29164*/
*         END;                      /*                       @Y30SSRG*/
*     END;                          /*                       @Y30SSRG*/
@RF00749 DS    0H                                                  0781
*   RFY                                                            0781
*     CTGPL BASED(CCACPL);          /* CALLER CPL ADDR       @Y30SSED*/
@RF00747 DS    0H                                                  0782
*   IF(CTGSUPLT=ON&CTGGENLD=OFF)    /* SUPERLOCATE OR        @ZA14588*/
*       ×CTGAM0=OFF THEN            /* TRANSLATE REQUEST     @ZA14588*/
         L     @05,CCACPL(,R11)                                    0782
         TM    CTGSUPLT(@05),B'00010000'                           0782
         BNO   @GL00026                                            0782
         TM    CTGGENLD(@05),B'00000001'                           0782
         BZ    @RT00782                                            0782
@GL00026 L     @05,CCACPL(,R11)                                    0782
         TM    CTGAM0(@05),B'00000001'                             0782
         BNZ   @RF00782                                            0782
@RT00782 DS    0H                                                  0783
*     DO;                           /* YES, TEST FOR ERR     @Y30SSED*/
*       IF(CCACD1^=RCS)&(CCAPDMW=OFF)/* IF ERROR AND MSG NOT WRITTEN
*                                      THEN WRITE MESSAGE    @Y30SSED*/
*           &CCACD1^=RCENT          /* SUPLOC & NO MCAT      @Y30SSSM*/
*           &CCACD1^=RCDSNF         /* SUPLOC & ENQ/DEQ      @Y30SSSM*/
*           &CVOLRNAM(1:1)=RCS      /* CVOL POINTER          @Y30SSSM*/
*           &CCACD1^=RCCATUNA THEN  /* CTLG NOT OPEN         @Y30SSSM*/
*                                                                  0784
         CLI   CCACD1(R11),0                                       0784
         BE    @RF00784                                            0784
         TM    CCAPDMW(R11),B'01000000'                            0784
         BNZ   @RF00784                                            0784
         CLI   CCACD1(R11),8                                       0784
         BE    @RF00784                                            0784
         CLI   CCACD1(R11),36                                      0784
         BE    @RF00784                                            0784
         L     @05,CCACWAP(,R11)                                   0784
         CLI   CVOLRNAM(@05),0                                     0784
         BNE   @RF00784                                            0784
         CLI   CCACD1(R11),188                                     0784
         BE    @RF00784                                            0784
*         /***********************************************************/
*         /*                                                         */
*         /* CALL TO MODULE IGG0CLAF                                 */
*         /*                                                         */
*         /***********************************************************/
*                                                                  0785
*Z038EMSG:                                                         0785
*         DO;                                                      0785
Z038EMSG DS    0H                                                  0786
*           CALL IGGPEMSG;                                         0786
         L     @15,@CV03722                                        0786
         BALR  @14,@15                                             0786
*           GEN(RLDSBREG IGGPEMSG); /* RELOAD SECONDARY BASE REG     */
         RLDSBREG IGGPEMSG
*         END;                      /* WRITE PROBLEM DETERMINATION 0788
*                                      MESSAGE               @ZA29164*/
*       ELSE                                                       0789
*         ;                         /* NO MSG TO WRITE       @Y30SSED*/
@RF00784 DS    0H                                                  0790
*       IF CTGGENLD=ON THEN         /* GENERIC LOCATE        @Y30SSSM*/
         L     @05,CCACPL(,R11)                                    0790
         TM    CTGGENLD(@05),B'00000001'                           0790
         BNO   @RF00790                                            0790
*         IF CCACD1=N               /* ERROR DETECTED        @Y30SSSM*/
*             ×CVOLRNAM(1:1)^=RCS THEN/* CVOL                @Y30SSSM*/
         CLI   CCACD1(R11),0                                       0791
         BE    @RT00791                                            0791
         L     @05,CCACWAP(,R11)                                   0791
         CLI   CVOLRNAM(@05),0                                     0791
         BE    @RF00791                                            0791
@RT00791 DS    0H                                                  0792
*           DO;                     /* NO ERROR              #Y30SSSM*/
*             CTGPROB=N;            /* CLEAR PROB DET FIELDS #Y30SSSM*/
         L     @05,CCACPL(,R11)                                    0793
         SLR   @15,@15                                             0793
         ST    @15,CTGPROB(,@05)                                   0793
*           END;                    /*                       #Y30SSSM*/
*         ELSE                      /* ERROR DETECTED        #Y30SSSM*/
*           DO;                     /*                       #Y30SSSM*/
         B     @RC00791                                            0795
@RF00791 DS    0H                                                  0796
*             CTGMODID=CCAMODID;    /* SET PROBLEM           #Y30SSSM*/
         L     @05,CCACPL(,R11)                                    0796
         MVC   CTGMODID(2,@05),CCAMODID(R11)                       0796
*             CTGREAS1=N;           /* DETERMINATION         #Y30SSSM*/
         MVI   CTGREAS1(@05),X'00'                                 0797
*             CTGREAS2=CCAREASN;    /* CODE IN CPL           #Y30SSSM*/
         MVC   CTGREAS2(1,@05),CCAREASN(R11)                       0798
*           END;                    /*                       #Y30SSSM*/
*       ELSE                                                       0800
*         ;                         /* NOT GENERIC LOCATE    #Y30SSSM*/
@RF00790 DS    0H                                                  0801
*     END;                          /*                       #Y30SSED*/
*   ELSE                            /* NO ERROR MESSAGE      #Y30SSED*/
*     IF CCACD1=N                   /* ERROR DETECTED        @Y30SSSM*/
*         ×CVOLRNAM(1:1)^=RCS THEN  /* CVOL                  @Y30SSSM*/
         B     @RC00782                                            0802
@RF00782 CLI   CCACD1(R11),0                                       0802
         BE    @RT00802                                            0802
         L     @05,CCACWAP(,R11)                                   0802
         CLI   CVOLRNAM(@05),0                                     0802
         BE    @RF00802                                            0802
@RT00802 DS    0H                                                  0803
*       DO;                         /* NO ERROR              #Y30SSED*/
*         CTGPROB=N;                /* CLEAR PROB DET FIELDS #Y30SSED*/
         L     @05,CCACPL(,R11)                                    0804
         SLR   @15,@15                                             0804
         ST    @15,CTGPROB(,@05)                                   0804
*       END;                        /*                       #Y30SSED*/
*     ELSE                          /* ERROR DETECTED        @Y30SSED*/
*       DO;                         /*                       @Y30SSED*/
         B     @RC00802                                            0806
@RF00802 DS    0H                                                  0807
*         CTGMODID=CCAMODID;        /* SET PROBLEM           @Y30SSED*/
         L     @05,CCACPL(,R11)                                    0807
         MVC   CTGMODID(2,@05),CCAMODID(R11)                       0807
*         CTGREAS1=N;               /* DETERMINATION         @Y30SSED*/
         MVI   CTGREAS1(@05),X'00'                                 0808
*         CTGREAS2=CCAREASN;        /* CODE IN CPL           @Y30SSED*/
         MVC   CTGREAS2(1,@05),CCAREASN(R11)                       0809
*       END;                        /*                       @Y30SSED*/
*                                                                  0810
*   /*****************************************************************/
*   /*                                                               */
*   /* MOVE PROTECTED INTERFACE BLOCKS TO USER AREA          @ZA29164*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0811
*   IF CCAGDGUY=OFF THEN            /* CICB/CISA EXIST?      @ZA29164*/
@RC00802 DS    0H                                                  0811
@RC00782 TM    CCAGDGUY(R11),B'00010000'                           0811
         BNZ   @RF00811                                            0811
*     DO;                           /* YES                   @ZA29164*/
*       R4=CCAR0REC+(6*512);        /* SET BASE FOR CICB     @ZA29164*/
         LA    R4,3072                                             0813
         AL    R4,CCAR0REC(,R11)                                   0813
*       CCACICIN=ON;                /* SET INTEGRITY CHECK   @ZA29164
*                                      INCOMPLETE            @ZA29164*/
         OI    CCACICIN(R11),B'10000000'                           0814
*Z039RTND:                                                         0815
*       DO;                                                        0815
Z039RTND DS    0H                                                  0816
*         CALL IGGPRTND;                                           0816
         BAL   @14,IGGPRTND                                        0816
*         GEN(RLDSBREG IGGPRTND);   /* RELOAD SECONDARY BASE REG     */
         RLDSBREG IGGPRTND
*       END;                        /* MOVE DATA TO USER     @ZA29164
*                                      AREA                  @ZA29164*/
*       CCACICIN=OFF;               /* SET INTEGRITY CHECK   @ZA29164
*                                      COMPLETE              @ZA29164*/
         NI    CCACICIN(R11),B'01111111'                           0819
*       R4=CCAR0REC+(6*512);        /* SET BASE FOR CICB     @ZA29164*/
         LA    R4,3072                                             0820
         AL    R4,CCAR0REC(,R11)                                   0820
*     END;                          /*                       @ZA29164*/
*   R3=(6*512);                     /* SIZE OF RECORD AREAS  @ZA29164*/
@RF00811 LA    R3,3072                                             0822
*   IF CCAGDGUY=OFF THEN            /* CICB/CISA EXIST?      @ZA29164*/
         TM    CCAGDGUY(R11),B'00010000'                           0823
         BNZ   @RF00823                                            0823
*     DO;                           /* YES                   @ZA29164*/
*       R3=R3+(5*1024);             /* ADJUST SIZE           @ZA29164*/
         AL    R3,@CF04149                                         0825
*       IF CICCISSP^=N THEN         /* SECONDARY CISA EXIST? @ZA29164*/
         L     @05,CICCISSP(,R4)                                   0826
         LTR   @05,@05                                             0826
         BZ    @RF00826                                            0826
*         DO;                       /* YES                   @ZA29164*/
*           CCAMNADR=CICCISSP;      /* SECONDARY CISA ADDR   @ZA29164*/
         ST    @05,CCAMNADR(,R11)                                  0828
*           CCAMNLEN=CICSABYT;      /* SECONDARY CISA SIZE   @ZA29164*/
         L     @15,CICSABYT(,R4)                                   0829
         STCM  @15,7,CCAMNLEN(R11)                                 0829
*           RFY                                                    0830
*            (R6,                                                  0830
*             R7,                                                  0830
*             R8,                                                  0830
*             R9) RSTD;             /*                       @ZA29164*/
*           R6=CCAMNADR;            /* GET ADDRESS           @ZA29164*/
         LR    R6,@05                                              0831
*           R7=CCAMNLEN;            /* GET LENGTH            @ZA29164*/
         LR    R7,@15                                              0832
*           R9=ZERO;                /* SET PADDING CHAR      @ZA29164*/
         SLR   R9,R9                                               0833
*           GEN(MVCL R6,R8);        /* CLEAR CISA            @ZA29164*/
         MVCL R6,R8
*           RFY                                                    0835
*            (R6,                                                  0835
*             R7,                                                  0835
*             R8,                                                  0835
*             R9) UNRSTD;           /*                       @ZA29164*/
*           RFY                                                    0836
*            (R0,                                                  0836
*             R1) RSTD;             /*                       @ZA29164*/
*           CICCISSP=N;             /* INDICATE NO SECONDARY STORAGE
*                                                            @ZA29164*/
         SLR   @05,@05                                             0837
         ST    @05,CICCISSP(,R4)                                   0837
*           R1=ADDR(CCAMSSPL);      /* POINT TO STRG MGMT P.L.       */
         LA    R1,CCAMSSPL(,R11)                                   0838
*           CCAMNSPL=FSUBPOOL;      /* STORE SUBPOOL VALUE           */
*                                                                  0839
         MVI   CCAMNSPL(R11),X'E5'                                 0839
*           /*********************************************************/
*           /*                                                       */
*           /* RELEASE MAIN STORAGE FROM SYSTEM SUBPOOL 229          */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0840
*           GEN(FREEMAIN L,MF=(E,(1))) ;/* FREE SECONDARY CISA     0840
*                                                            @ZA29164*/
         FREEMAIN L,MF=(E,(1))
*         END;                      /*                       @ZA29164*/
*       ELSE                                                       0842
*         ;                         /*                       @ZA29164*/
@RF00826 DS    0H                                                  0843
*     END;                          /*                       @ZA29164*/
*   ELSE                                                           0844
*     ;                             /*                       @ZA29164*/
@RF00823 DS    0H                                                  0845
*   RVCCAV=OFF;                     /* CCA NO LONGER VALID   @ZA29164*/
         NI    RVCCAV(R11),B'01111111'                             0845
*   R2=ARFSBSCH;                    /* POINT TO HEAD OF CHN  @ZA29164*/
         L     R2,ARFSBSCH(,R11)                                   0846
*   DO WHILE(R2^=0);                /* FREE SPILL BLOCKS     @ZA29164*/
         B     @DE00847                                            0847
@DL00847 DS    0H                                                  0848
*     CCAMNADR=R2;                  /* ADDRESS OF BLOCK      @ZA29164*/
         ST    R2,CCAMNADR(,R11)                                   0848
*     CCAMNLEN=LENGTH(ARFSB);       /* LENGTH OF BLOCK       @ZA29164*/
         MVC   CCAMNLEN(3,R11),@CF00061+1                          0849
*     R2=SBCHN;                     /* SAVE PTR TO NEXT BLOCK      0850
*                                                            @ZA29164*/
         ICM   R2,15,SBCHN(R2)                                     0850
*     R1=ADDR(CCAMSSPL);            /* POINT TO STRG MGMT P.L.       */
         LA    R1,CCAMSSPL(,R11)                                   0851
*     CCAMNSPL=USUBPOOL;            /* STORE SUBPOOL VALUE           */
*                                                                  0852
         MVI   CCAMNSPL(R11),X'FC'                                 0852
*     /***************************************************************/
*     /*                                                             */
*     /* RELEASE MAIN STORAGE FROM USER SUBPOOL 252                  */
*     /*                                                             */
*     /***************************************************************/
*                                                                  0853
*     GEN(FREEMAIN L,MF=(E,(1))) ;  /* FREE BLOCK            @ZA29164*/
         FREEMAIN L,MF=(E,(1))
*   END;                            /*                       @ZA29164*/
@DE00847 LTR   R2,R2                                               0854
         BNZ   @DL00847                                            0854
*   RFY                                                            0855
*     R14 RSTD;                     /*                       @ZA29164*/
*   R14=CCAR14S;                    /* RESTORE RET REG       @ZA29164*/
         L     R14,CCAR14S(,R11)                                   0856
*   RFY                                                            0857
*     R2 RSTD;                      /*                       @ZA29164*/
*   R2=CCACD1;                      /* SAVE RETURN CODE      @Y30SSSM*/
         SLR   R2,R2                                               0858
         IC    R2,CCACD1(,R11)                                     0858
*   R0=R3;                          /* PREPARE FOR FREEMAIN  @ZA29164*/
         LR    R0,R3                                               0859
*   GEN REFS(FPSUBPOL) SETS(R0)(ICM   R0,8,FPSUBPOL);/* ADD SUBPOOL
*                                      ID                    @ZA29164*/
         ICM   R0,8,FPSUBPOL
*   RFY                                                            0861
*     R7 RSTD;                      /*                       @ZA29164*/
*   R7=R3;                          /* SAVE R7               @ZA29164*/
         LR    R7,R3                                               0862
*   R4=CCATCB;                      /* RESTORE TCB PTR               */
         L     R4,CCATCB(,R11)                                     0863
*   RFY                                                            0864
*     R5 RSTD;                      /*                       @ZA29164*/
*   R5=CCARB;                       /* RESTORE RB PTR                */
         L     R5,CCARB(,R11)                                      0865
*   R3=ADDR(CVTMAP);                /* RESTORE CVT PTR               */
         L     R3,CVTPTR                                           0866
*   RFY                                                            0867
*    (R9) RSTD;                     /*                         Y02020*/
*   R9=ADDR(RIPLSA);                /* PT TO LOCAL RSA         Y02020*/
         LA    R9,CCAREGS(,R11)                                    0868
         AL    R9,@CF00075                                         0868
*   GEN(STM 10,8,0(9));             /* SAVE LOCAL REGS         Y02020*/
         STM 10,8,0(9)
*   R1=ADDR(RIPEPA);                /* ESTAE MACRO PL          Y02020*/
         LA    R1,CCAREGS(,R11)                                    0870
         AL    R1,@CF00075                                         0870
         LA    @15,RIPEPA(,R1)                                     0870
         ST    R1,@TF00001                                         0870
         LR    R1,@15                                              0870
*   RFY                                                            0871
*     R2 RSTD;                      /*                       @ZA29164*/
*   R2=ADDR(RIPRSA);                /* ESTAE ROUT RSA          Y02020*/
         L     R2,@TF00001                                         0872
         LA    R2,RIPRSA(,R2)                                      0872
*   GEN REFS(PSALITA,FLC,CVTMAP,CVTSV60,FLCCVT,PSA);               0873
*                                                         /*   Y02020*/
           SETLOCK OBTAIN,TYPE=LOCAL,MODE=UNCOND,                      X
               RELATED=('AFTER ESTAE CALL') /*GET LCL LK       Y02020*/
           ESTAE 0,BRANCH=YES,SVEAREA=(2),MF=(E,(1))                   X
                                        /*DEACTIVATE RCVY      Y02020*/
           SETLOCK RELEASE,TYPE=LOCAL,                                 X
               RELATED=('BEFORE ESTAE CALL') /*FREE LOCK       Y02020*/
           LM R10,R8,RIPLSA(R9)         /*RESTORE LOCAL REGS   Y02020*/
*   RFY                                                            0874
*    (R6,                                                          0874
*     R7,                                                          0874
*     R8) RSTD;                     /* RESTRICT REGS         @ZA29164*/
*   R6=CCAR0REC;                    /* GET ADDRESS           @ZA29164*/
         L     R6,CCAR0REC(,R11)                                   0875
*   R9=ZERO;                        /* SET PADDING CHAR      @ZA29164*/
         SLR   R9,R9                                               0876
*   GEN(MVCL R6,R8);                /* CLEAR CISA            @ZA29164*/
         MVCL R6,R8
*   RFY                                                            0878
*    (R6,                                                          0878
*     R7,                                                          0878
*     R8,                                                          0878
*     R9) UNRSTD;                   /*                       @ZA29164*/
*   R1=CCAR0REC;                    /* RECORD AREA ADDRESS   @ZA29164*/
         L     R1,CCAR0REC(,R11)                                   0879
*   GEN(FREEMAIN R,LV=(0),A=(1));   /* FREE RECORD AREA      @ZA92164*/
*                                                                  0880
         FREEMAIN R,LV=(0),A=(1)
*   /*****************************************************************/
*   /*                                                               */
*   /* RETURN TO IGG0CLA1                                            */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0881
*   R1=CCACPL;                      /* CPL PTR                       */
         L     R1,CCACPL(,R11)                                     0881
*   GEN(LCR R1,R1);                 /* 2'S COMPLEMENT                */
         LCR R1,R1
*   R12=CCACWAP;                    /* CONTROLLERS WORKAREA  @ZA29164*/
         L     R12,CCACWAP(,R11)                                   0883
*   R11=R12;                        /* SAVE BASE             @ZA29164*/
         LR    R11,R12                                             0884
*   GEN(BR 14);                     /* RETURN TO IGG0CLA1    @ZA29164*/
         BR 14
*   RFY                                                            0886
*    (R0,                                                          0886
*     R1,                                                          0886
*     R5,                                                          0886
*     R6,                                                          0886
*     R7,                                                          0886
*     R8,                                                          0886
*     R9,                                                          0886
*     R14,                                                         0886
*     R15) UNRSTD;                                                 0886
*   CALL EXIT;                      /* RETURN TO CALLER              */
         BAL   @14,EXIT                                            0887
*   GEN(DS 0F);                     /* FULLWORD BOUNDARY ALIGNMENT   */
         DS 0F
*   GEN(DC CL8'IGGPMDAT');          /* NAME OF FOLLOWING PROCEDURE   */
         DC CL8'IGGPMDAT'
*   END;                            /* END OF INNER PROCEDURE        */
@EL00004 DS    0H                                                  0890
@EF00004 DS    0H                                                  0890
@ER00004 BR    @14                                                 0890
         EJECT
*                                                                  0891
*/********************************************************************/
*/*                                                                  */
*/*        IGGPMDAT  -  PROCEDURE  EXTERNALLY  CALLED  NESTED        */
*/*                                                                  */
*/********************************************************************/
*                                                                  0891
*IGGPMDAT:                                                         0891
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);/* SPECIFY PROCEDURE OPTIONS     */
IGGPMDAT DS    0H                                                  0892
*   GEN(ENTRY IGGPMDAT );           /* IDENTIFY ENTRY-POINT SYMBOL   */
         ENTRY IGGPMDAT
*Z042:                              /* LABEL FOR PROCEDURE TRACKING  */
*Z042MDAT:                          /* LABEL FOR PROCEDURE TRACKING  */
*   RFY                                                            0893
*    (R5,                                                          0893
*     R6,                                                          0893
*     R7,                                                          0893
*     R8,                                                          0893
*     R9) UNRSTD;                   /* PL/S COMPILER WORK REGISTERS  */
Z042     DS    0H                                                  0893
Z042MDAT DS    0H                                                  0894
*   RFY                                                            0894
*    (R2,                                                          0894
*     R3,                                                          0894
*     R4) RSTD;                     /* RESTRICT LOCAL WORK REGISTERS */
*   GEN(STM 12,14,12(13));          /* SAVE REGISTERS OF CALLER      */
         STM 12,14,12(13)
*   GEN(LA 13,12(13));              /* POINT TO NEXT SAVE AREA       */
         LA 13,12(13)
*   GEN(BALR 12,0);                 /* ESTABLISH ADDRESSABILITY      */
         BALR 12,0
*   GEN(USING *,12);                /* INDICATE AVAILABLE BASE REG   */
         USING *,12
*   GEN(B *+6);                     /* BRANCH AROUND CONSTANT        */
         B *+6
*   GEN(DC AL2(*-@MAINENT-4));      /* OFFSET TO MODULE BASE 1       */
         DC AL2(*-@MAINENT-4)
*   GEN(SH 12,*-2);                 /* COMPUTE MODULE BASE 1         */
         SH 12,*-2
*   GEN(LA 10,4095(0,12));          /* LOAD BASE 2 REG WITH 4095     */
         LA 10,4095(0,12)
*   GEN(USING @MAINENT,12);         /* INDICATE AVAILABLE BASE REG1  */
         USING @MAINENT,12
*   GEN(USING @MAINENT+4095,10);    /* INDICATE AVAILABLE BASE REG2
*                                                            @ZA29164*/
         USING @MAINENT+4095,10
*/********************************************************** @ZA29164*/
*/*                                                          @ZA29164*/
*/*  PROCEDURE NAME = IGGPMDAT                               @ZA29164*/
*/*                                                          @ZA29164*/
*/*  DESCRIPTIVE NAME = MOVE DATA TO KEY 0 PROCEDURE         @ZA29164*/
*/*                                                          @ZA29164*/
*/*  FUNCTION =                                              @ZA29164*/
*/*     THIS PROCEDURE WILL MOVE THE USER DATA TO A KEY 0    @ZA29164*/
*/*     AREA. THE LENGTH OF THE AREA TO BE MOVED WILL BE     @ZA29164*/
*/*     COMPARED AGAINST THE LENGTH OF THE OUTPUT AREA TO    @ZA29164*/
*/*     VERIFY THAT THE MOVE CAN BE DONE. IF THE OUTPUT      @ZA29164*/
*/*     AREA IS INSUFFICIENT THEN THIS PROCEDURE WILL SET    @ZA29164*/
*/*     A FLAG BIT CICCOUNT AND INCREMENT THE MOVE LENGTH    @ZA29164*/
*/*     BUT NOT MOVE ANY DATA.                               @ZA29164*/
*/*                                                          @ZA29164*/
*/*  REGISTER CONVENTIONS =                                  @ZA29164*/
*/*     REGISTERS R0-R5 ARE SAVED UPON ENTERING              @ZA29164*/
*/*     R6-R9    WORK REGISTERS     VOLATILE                 @ZA29164*/
*/*     R15      WORK REGISTER      VOLATILE                 @ZA29164*/
*/*                                                          @ZA29164*/
*/*  INPUT =                                                 @ZA29164*/
*/*     INPUT TO THIS PROCEDURE IS A POINTER CICBKPTR TO     @ZA29164*/
*/*     THE POINTER OF THE BLOCK TO BE MOVED AND CICBKLNG,   @ZA29164*/
*/*     WHICH IS THE LENGTH OF THE BLOCK.                    @ZA29164*/
*/*                                                          @ZA29164*/
*/*  OUTPUT =                                                @ZA29164*/
*/*     NORMAL OUTPUT WILL CONSIST OF THE BLOCK MOVED TO     @ZA29164*/
*/*     KEY 0 STORAGE WITH THE POINTER UPDATED TO THE        @ZA29164*/
*/*     ADDRESS OF THE NEW LOCATION.                         @ZA29164*/
*/*                                                          @ZA29164*/
*/********************************************************** @ZA29164*/
*                                                                  0905
*   GEN(STM 2,5,12(13));            /* SAVE REGS 2 THROUGH 5 @ZA29164*/
         STM 2,5,12(13)
*   RFY                                                            0906
*    (R1,                                                          0906
*     R7,                                                          0906
*     R8,                                                          0906
*     R9,                                                          0906
*     R15) RSTD;                    /* RESTRICT WORK REGS    @ZA29164*/
*   R3=BLOCKPTR;                    /* GET POINTER TO BLOCK  @ZA29164*/
         L     @14,CICBKPTR(,R4)                                   0907
         L     R3,BLOCKPTR(,@14)                                   0907
*   R7=R3;                          /* SAVE POINTER          @ZA29164*/
         LR    R7,R3                                               0908
*   R9=CICNXTBK;                    /* PTR TO OUTPUT AREA    @ZA29164*/
         L     R9,CICNXTBK(,R4)                                    0909
*   R8=R3;                          /* SAVE POINTER          @ZA29164*/
         LR    R8,R3                                               0910
*   R8=R8&ROUNDUP;                  /* ROUND BACK TO WORD    @ZA29164
*                                      BOUNDRY               @ZA29164*/
         ICM   @14,15,ROUNDUP                                      0911
         NR    R8,@14                                              0911
*   R3=R3&ACWD;                     /* AND OUT ALL BUT LAST  @ZA29164
*                                      TWO BITS OF BLOCK PTR @ZA29164*/
         ICM   @14,15,ACWD                                         0912
         NR    R3,@14                                              0912
*   R15=CICBKLNG;                   /* GET BLOCK LENGTH      @ZA29164*/
         L     R15,CICBKLNG(,R4)                                   0913
*   R7=R15+R7;                      /* AND OUT ALL BUT LAST  @ZA29164*/
         ALR   R7,R15                                              0914
*   R7=R7&ACWD;                     /* TWO BITS OF END OF    @ZA29164
*                                      BLOCK PTR             @ZA29164*/
*                                                                  0915
         NR    R7,@14                                              0915
*   /*****************************************************************/
*   /*                                                               */
*   /* ROUND UP BLOCK LENGTH BY EXAMINING THE START AND END  @ZA29164*/
*   /* OF THE BLOCK BOUNDRY.                                 @ZA29164*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0916
*   IF R3^=ZERO THEN                /* IF DOES NOT START ON  @ZA29164*/
         LTR   R3,R3                                               0916
         BZ    @RF00916                                            0916
*     R15=R15+R3;                   /* WORD BOUNDRY ROUND UP @ZA29164*/
         ALR   R15,R3                                              0917
*   ELSE                                                           0918
*     ;                             /* STARTS ON BOUNDRY     @ZA29164*/
@RF00916 DS    0H                                                  0919
*   IF R7^=ZERO THEN                /* END ON WORD BOUNDRY   @ZA29164*/
         LTR   R7,R7                                               0919
         BZ    @RF00919                                            0919
*     DO;                           /* NO                    @ZA29164*/
*       R15=R15+FOUR;               /* ROUND UP TO WORD      @ZA29164*/
         AL    R15,@CF00059                                        0921
*       R15=R15-R7;                 /* BOUNDRY               @ZA29164*/
         SLR   R15,R7                                              0922
*     END;                          /*                       @ZA29164*/
*   ELSE                                                           0924
*     ;                             /* ENDS ON BOUNDRY       @ZA29164*/
*                                                                  0924
@RF00919 DS    0H                                                  0925
*   /*****************************************************************/
*   /*                                                               */
*   /* DETERMINE AMOUNT OF STORAGE NEEDED FOR THE BLOCK TO   @ZA29164*/
*   /* BE MOVED AND IF THERE IS ENOUGH ROOM TO MOVE IT.      @ZA29164*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0925
*   IF R15>CICRMBYT THEN            /* ENOUGH ROOM IN AREA   @ZA29164*/
         C     R15,CICRMBYT(,R4)                                   0925
         BNH   @RF00925                                            0925
*     IF CICCISSP^=ZERO THEN        /* SECONDARY AREA EXIST  @ZA29164*/
         L     @14,CICCISSP(,R4)                                   0926
         LTR   @14,@14                                             0926
         BZ    @RF00926                                            0926
*       IF CICPTRSW=ON THEN         /* WERE PTRS PREVIOUSLY  @ZA29164
*                                      SWITCHED              @ZA29164*/
         TM    CICPTRSW(R4),B'01000000'                            0927
         BNO   @RF00927                                            0927
*         DO;                       /* YES, AND NOW THERE IS @ZA29164
*                                      NO ROOM IN SECONDARY  @ZA29164
*                                      AREA                  @ZA29164*/
*           CICCOUNT=ON;            /* ALERT DRIVER          @ZA29164*/
         OI    CICCOUNT(R4),B'10000000'                            0929
*           CALL EXIT;              /* RETURN                @ZA29164*/
         BAL   @14,EXIT                                            0930
*         END;                      /*                       @ZA29164*/
*       ELSE                        /* PTRS WERE NOT         @ZA29164*/
*         DO;                       /* PREVIOSLY SWITCHED    @ZA29164*/
         B     @RC00927                                            0932
@RF00927 DS    0H                                                  0933
*           CICNXTBK=CICCISSP;      /* POINT TO SECOND AREA  @ZA29164*/
         L     @14,CICCISSP(,R4)                                   0933
         ST    @14,CICNXTBK(,R4)                                   0933
*           CICRMBYT=CICSABYT;      /* SET AVAILABLE BYTES   @ZA29164*/
         L     @06,CICSABYT(,R4)                                   0934
         ST    @06,CICRMBYT(,R4)                                   0934
*           R9=CICNXTBK;            /* UPDATE OUTPUT POINTER @ZA29164*/
         LR    R9,@14                                              0935
*           CICPTRSW=ON;            /* PTRS WERE SWITCHED    @ZA29164*/
         OI    CICPTRSW(R4),B'01000000'                            0936
*         END;                      /*                       @ZA29164*/
*     ELSE                          /* SECONDARY AREA DOES   @ZA29164*/
*       DO;                         /* NOT EXIST             @ZA29164*/
         B     @RC00926                                            0938
@RF00926 DS    0H                                                  0939
*         CICCOUNT=ON;              /* SET COUNT MODE        @ZA29164*/
         OI    CICCOUNT(R4),B'10000000'                            0939
*         CICGMCNT=CICGMCNT+R15;    /* ACCUMULATE LENGTH FOR @ZA29164
*                                      LATER GETMAIN         @ZA29164*/
         LR    @14,R15                                             0940
         AL    @14,CICGMCNT(,R4)                                   0940
         ST    @14,CICGMCNT(,R4)                                   0940
*         CALL EXIT;                /* RETURN TO DRIVER      @ZA29164*/
         BAL   @14,EXIT                                            0941
*       END;                        /*                       @ZA29164*/
*   ELSE                                                           0943
*     ;                             /* ENOUGH ROOM FOR MOVE  @ZA29164*/
@RF00925 DS    0H                                                  0944
*   BLOCKPTR=CICNXTBK+R3;           /* UPDATE INPUT POINTER  @ZA29164*/
@RC00925 L     @14,CICBKPTR(,R4)                                   0944
         L     @06,CICNXTBK(,R4)                                   0944
         LR    @05,R3                                              0944
         ALR   @05,@06                                             0944
         ST    @05,BLOCKPTR(,@14)                                  0944
*   CICNXTBK=CICNXTBK+R15;          /* UPDATE POINTER TO     @ZA29164
*                                      NEXT AVAILABLE AREA   @ZA29164*/
         ALR   @06,R15                                             0945
         ST    @06,CICNXTBK(,R4)                                   0945
*   CICRMBYT=CICRMBYT-R15;          /* DECREMENT AVAILABLE   @ZA29164
*                                      BYTES IN OUTPUT AREA  @ZA29164*/
*                                                                  0946
         L     @14,CICRMBYT(,R4)                                   0946
         SLR   @14,R15                                             0946
         ST    @14,CICRMBYT(,R4)                                   0946
*   /*****************************************************************/
*   /*                                                               */
*   /* LOOP TO MOVE DATA AS LONG AS THE DATA TO BE MOVED IS  @ZA29164*/
*   /* GREATER THAN 31 BYTES                                 @ZA29164*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0947
*   RFY                                                            0947
*    (R5,                                                          0947
*     R6) RSTD;                     /* RESTRICT REGS         @ZA29164*/
*   DO WHILE R15>THIRTY1;           /* THIRTY TWO BYTE LOOP  @ZA29164*/
         B     @DE00948                                            0948
@DL00948 DS    0H                                                  0949
*     SPKA(CCAUSKEY);               /* SWITCH TO USER KEY    @ZA29164*/
         SLR   @14,@14                                             0949
         IC    @14,CCAUSKEY(,R11)                                  0949
         SPKA  0(@14)                                              0949
*     LM(R0,R7,USERDATA);           /* LOAD 32 BYTES OF USER @ZA29164
*                                      DATA                  @ZA29164*/
         LM    R0,R7,USERDATA(R8)                                  0950
*     GEN(SPKA 0);                  /* SWITCH TO KEY 0       @ZA29164*/
         SPKA 0
*     STM(R0,R7,OUTAREA);           /* STORE 32 BYTES IN     @ZA29164
*                                      KEY 0 AREA            @ZA29164*/
         STM   R0,R7,OUTAREA(R9)                                   0952
*     R15=R15-THIRTY2;              /* DECREMENT LENGTH      @ZA29164*/
         LA    @14,32                                              0953
         SLR   R15,@14                                             0953
*     R8=R8+THIRTY2;                /* INCREMENT INPUT PTR   @ZA29164*/
         ALR   R8,@14                                              0954
*     R9=R9+THIRTY2;                /* INCREMENT OUTPUT PTR  @ZA29164*/
         ALR   R9,@14                                              0955
*   END;                            /*                       @ZA29164*/
*                                                                  0956
@DE00948 C     R15,@CF00033                                        0956
         BH    @DL00948                                            0956
*   /*****************************************************************/
*   /*                                                               */
*   /* MOVE DATA THAT IS LESS THAN 32 BYTES IN LENGTH. THE   @ZA29164*/
*   /* NUMBER OF BYTES MOVED WILL BE ROUNDED UP TO A         @ZA29164*/
*   /* FULL WORD.                                            @ZA29164*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0957
*   IF R15^=ZERO THEN               /* ANY DATA TO BE MOVED  @ZA29164*/
         LTR   R15,R15                                             0957
         BZ    @RF00957                                            0957
*     DO;                           /* YES                   @ZA29164*/
*       SRA(R15,TWO);               /* DIVIDE LENGTH BY FOUR @ZA29164
*                                      TO GET NO. OF REGS    @ZA29164
*                                      FOR MOVE              @ZA29164*/
         SRA   R15,2                                               0959
*       R15=R15-ONE;                /* ADJUST REG COUNT      @ZA29164*/
         BCTR  R15,0                                               0960
*       SPKA(CCAUSKEY);             /* SWITCH TO USER KEY    @ZA29164*/
         SLR   @14,@14                                             0961
         IC    @14,CCAUSKEY(,R11)                                  0961
         SPKA  0(@14)                                              0961
*       GEN REFS(LOADREGS) SETS(R0,R1,R2,R3,R4,R5,R6,R7);          0962
*                                                     /*     @ZA29164*/
        EX R15,LOADREGS             /* LOAD REGISTERS        @ZA29164*/
*       GEN(SPKA 0);                /* SWITCH TO KEY 0       @ZA29164*/
         SPKA 0
*       GEN REFS(STORREGS) SETS(R0,R1,R2,R3,R4,R5,R6,R7);          0964
*                                                     /*     @ZA29164*/
        EX R15,STORREGS             /* STORE REGISTERS       @ZA29164*/
*     END;                          /*                       @ZA29164*/
*   ELSE                                                           0966
*     ;                             /* NO DATA TO BE MOVED   @ZA29164*/
@RF00957 DS    0H                                                  0967
*   RFY                                                            0967
*     R15 RSTD;                     /*                       @ZA29164*/
*   GEN(LM 2,5,12(13));             /* RESTORE REGS 2 TO 5   @ZA29164*/
         LM 2,5,12(13)
*   CALL EXIT;                      /* RETURN TO CALLER              */
         BAL   @14,EXIT                                            0969
*   GEN(DS 0F);                     /* FULLWORD BOUNDARY ALIGNMENT   */
         DS 0F
*   GEN(DC CL8'IGGPCFPL');          /* NAME OF FOLLOWING PROCEDURE   */
         DC CL8'IGGPCFPL'
*   END;                            /* END OF INNER PROCEDURE        */
@EL00005 DS    0H                                                  0972
@EF00005 DS    0H                                                  0972
@ER00005 BR    @14                                                 0972
         EJECT
*                                                                  0973
*/********************************************************************/
*/*                                                                  */
*/*        IGGPCFPL  -  PROCEDURE  EXTERNALLY  CALLED  NESTED        */
*/*                                                                  */
*/********************************************************************/
*                                                                  0973
*IGGPCFPL:                                                         0973
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);/* SPECIFY PROCEDURE OPTIONS     */
IGGPCFPL DS    0H                                                  0974
*   GEN(ENTRY IGGPCFPL );           /* IDENTIFY ENTRY-POINT SYMBOL   */
         ENTRY IGGPCFPL
*Z043:                              /* LABEL FOR PROCEDURE TRACKING  */
*Z043CFPL:                          /* LABEL FOR PROCEDURE TRACKING  */
*   RFY                                                            0975
*    (R5,                                                          0975
*     R6,                                                          0975
*     R7,                                                          0975
*     R8,                                                          0975
*     R9) UNRSTD;                   /* PL/S COMPILER WORK REGISTERS  */
Z043     DS    0H                                                  0975
Z043CFPL DS    0H                                                  0976
*   RFY                                                            0976
*    (R2,                                                          0976
*     R3,                                                          0976
*     R4) RSTD;                     /* RESTRICT LOCAL WORK REGISTERS */
*   GEN(STM 12,14,12(13));          /* SAVE REGISTERS OF CALLER      */
         STM 12,14,12(13)
*   GEN(LA 13,12(13));              /* POINT TO NEXT SAVE AREA       */
         LA 13,12(13)
*   GEN(BALR 12,0);                 /* ESTABLISH ADDRESSABILITY      */
         BALR 12,0
*   GEN(USING *,12);                /* INDICATE AVAILABLE BASE REG   */
         USING *,12
*   GEN(B *+6);                     /* BRANCH AROUND CONSTANT        */
         B *+6
*   GEN(DC AL2(*-@MAINENT-4));      /* OFFSET TO MODULE BASE 1       */
         DC AL2(*-@MAINENT-4)
*   GEN(SH 12,*-2);                 /* COMPUTE MODULE BASE 1         */
         SH 12,*-2
*   GEN(LA 10,4095(0,12));          /* LOAD BASE 2 REG WITH 4095     */
         LA 10,4095(0,12)
*   GEN(USING @MAINENT,12);         /* INDICATE AVAILABLE BASE REG1  */
         USING @MAINENT,12
*   GEN(USING @MAINENT+4095,10);    /* INDICATE AVAILABLE BASE REG2
*                                                            @ZA29164*/
         USING @MAINENT+4095,10
*/********************************************************** @ZA29164*/
*/*                                                          @ZA29164*/
*/* PROCEDURE NAME = IGGPCFPL                                @ZA29164*/
*/*                                                          @ZA29164*/
*/* DESCRIPTIVE NAME = FPL DRIVER                            @ZA29164*/
*/*                                                          @ZA29164*/
*/* FUNCTION =                                               @ZA29164*/
*/* THE FPL DRIVER WILL MOVE THE USERS FPL'S AND ASSOCIATED  @ZA29164*/
*/* DATA AREAS FROM USERS CORE TO KEY 0 FETCH PROTECTED      @ZA29164*/
*/* CORE. EACH CALL TO THIS DRIVER WILL PROCESS ONE BASE FPL @ZA29164*/
*/* AND ANY ASSOCIATED TEST FPL'S.                           @ZA29164*/
*/*                                                          @ZA29164*/
*/* INPUT = ADDRESS OF FIELD CONTAINING POINTER TO BASE      @ZA29164*/
*/*         FPL LOADED INTO CICBKPTR.                        @ZA29164*/
*/*                                                          @ZA29164*/
*/* OUTPUT = ADDRESS OF BASE FPL MOVED TO KEY 0 CORE.        @ZA29164*/
*/*          POINTERS IN FPL(S) MOVED TO KEY 0 CORE WILL     @ZA29164*/
*/*          REFLECT DATA MOVED TO KEY 0 CORE.               @ZA29164*/
*/*                                                          @ZA29164*/
*/********************************************************** @ZA29164*/
*                                                                  0987
*   CICREGSV=R3;                    /* SAVE REGISTER 3       @ZA29164*/
         ST    R3,CICREGSV(,R4)                                    0987
*   RFY                                                            0988
*     CTGFL BASED(FPLPTR);          /* BASE FPL ON LOCAL PTR @ZA29164*/
*   FPLPTR=BLOCKPTR;                /* RESET FPL POINTER     @ZA29164*/
         L     @14,CICBKPTR(,R4)                                   0989
         L     FPLPTR,BLOCKPTR(,@14)                               0989
*   CICBKLNG=LENGTH(CTGFL)+CTGFLDNO*LENGTH(CTGFLDAT);/* SET  @ZA29164
*                                      LENGTH OF FPL         @ZA29164*/
         SLR   @14,@14                                             0990
         IC    @14,CTGFLDNO(,FPLPTR)                               0990
         SLA   @14,3                                               0990
         AL    @14,@CF00264                                        0990
         ST    @14,CICBKLNG(,R4)                                   0990
*Z044VCHK:                                                         0991
*   DO;                                                            0991
Z044VCHK DS    0H                                                  0992
*     CALL IGGPVCHK;                                               0992
         BAL   @14,IGGPVCHK                                        0992
*     GEN(RLDSBREG IGGPVCHK);       /* RELOAD SECONDARY BASE REG     */
         RLDSBREG IGGPVCHK
*   END;                            /* VERIFY AND MOVE THE   @ZA29164
*                                      FPL TO KEY 0 CORE     @ZA29164*/
*   FPLPTR=BLOCKPTR;                /* RESET FPL POINTER     @ZA29164*/
*                                                                  0995
         L     @14,CICBKPTR(,R4)                                   0995
         L     FPLPTR,BLOCKPTR(,@14)                               0995
*   /*****************************************************************/
*   /*                                                               */
*   /* CHECK FIELD NAME AND MOVE IF PRESENT                  @ZA29164*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0996
*   IF CTGFLDNM^=ZERO THEN          /* FIELDNAME EXIST       @ZA29164*/
         L     @14,CTGFLDNM(,FPLPTR)                               0996
         LTR   @14,@14                                             0996
         BZ    @RF00996                                            0996
*     DO;                           /* YES                   @ZA29164*/
*       CICBKPTR=ADDR(CTGFLDNM);    /* SET POINTER TO BLOCK  @ZA29164*/
         LA    @14,CTGFLDNM(,FPLPTR)                               0998
         ST    @14,CICBKPTR(,R4)                                   0998
*Z045M8BT:                                                         0999
*       DO;                                                        0999
Z045M8BT DS    0H                                                  1000
*         CALL IGGPM8BT;                                           1000
         BAL   @14,IGGPM8BT                                        1000
*         GEN(RLDSBREG IGGPM8BT);   /* RELOAD SECONDARY BASE REG     */
         RLDSBREG IGGPM8BT
*       END;                                                       1002
*                                                                  1002
*       /*************************************************************/
*       /*                                                           */
*       /* MOVE EIGHT                                        @ZA29164*/
*       /*                                                           */
*       /*************************************************************/
*                                                                  1003
*                                   /* BYTE NAME             @ZA29164*/
*     END;                          /*                       @ZA29164*/
*   ELSE                                                           1004
*     ;                             /* FIELDNAME IS ZERO     @ZA29164*/
*                                                                  1004
@RF00996 DS    0H                                                  1005
*   /*****************************************************************/
*   /*                                                               */
*   /* MOVE FIELD DATA IF IT EXISTS                          @ZA29164*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1005
*   IF CTGFLPT(1)^=ZERO THEN        /* FIELD DATA PTR EXIST  @ZA29164*/
         SLR   @14,@14                                             1005
         C     @14,CTGFLPT(,FPLPTR)                                1005
         BE    @RF01005                                            1005
*     DO;                           /* YES                   @ZA29164*/
*       IF CTGFLNG(1)^=ZERO THEN    /* FIELD LENGTH EXIST    @ZA29164*/
         L     @05,CTGFLNG(,FPLPTR)                                1007
         CR    @05,@14                                             1007
         BE    @RF01007                                            1007
*         DO;                       /* YES                   @ZA29164*/
*           CICBKLNG=CTGFLNG(1);    /* SET DATA LENGTH       @ZA29164*/
         ST    @05,CICBKLNG(,R4)                                   1009
*           CICBKPTR=ADDR(CTGFLPT(1));/* SET PTR TO DATA     @ZA29164*/
         LA    @14,CTGFLPT(,FPLPTR)                                1010
         ST    @14,CICBKPTR(,R4)                                   1010
*           IF CICPASWD=OFF THEN    /* NO PASSWORD MOVE ?    @ZA29164*/
         TM    CICPASWD(R4),B'00010000'                            1011
         BNZ   @RF01011                                            1011
*             IF CTGFLNG(1)<=FOUR096 THEN/* LENGTH LT 4K     @ZA29164*/
         C     @05,@CF03779                                        1012
         BH    @RF01012                                            1012
*Z046VCHK:                                                         1013
*               DO;                                                1013
Z046VCHK DS    0H                                                  1014
*                 CALL IGGPVCHK;                                   1014
         BAL   @14,IGGPVCHK                                        1014
*                 GEN(RLDSBREG IGGPVCHK);/* RELOAD SECONDARY BASE REG*/
         RLDSBREG IGGPVCHK
*               END;                /* CHECK AND MOVE DATA   @ZA29164*/
*             ELSE                  /* DATA LENGTH GT 4K     @ZA29164*/
*Z047VCGF:                                                         1017
*               DO;                                                1017
         B     @RC01012                                            1017
@RF01012 DS    0H                                                  1017
Z047VCGF DS    0H                                                  1018
*                 CALL IGGPVCGF;                                   1018
         BAL   @14,IGGPVCGF                                        1018
*                 GEN(RLDSBREG IGGPVCGF);/* RELOAD SECONDARY BASE REG*/
         RLDSBREG IGGPVCGF
*               END;                /* CHECK AND MOVE DATA   @ZA29164*/
*           ELSE                    /* PASSWORD TO BE MOVED  @ZA29164*/
*Z048MPAS:                                                         1021
*             DO;                                                  1021
         B     @RC01011                                            1021
@RF01011 DS    0H                                                  1021
Z048MPAS DS    0H                                                  1022
*               CALL IGGPMPAS;                                     1022
         BAL   @14,IGGPMPAS                                        1022
*               GEN(RLDSBREG IGGPMPAS);/* RELOAD SECONDARY BASE REG  */
         RLDSBREG IGGPMPAS
*             END;                  /* MOVE PASSWORD(S)      @ZA29164*/
*         END;                      /*                       @ZA29164*/
*       ELSE                                                       1026
*         ;                         /* FIELD LENGTH ZERO     @ZA29164*/
@RF01007 DS    0H                                                  1027
*     END;                          /*                       @ZA29164*/
*   ELSE                                                           1028
*     ;                             /* FIELD PTR ZERO        @ZA29164*/
*                                                                  1028
@RF01005 DS    0H                                                  1029
*   /*****************************************************************/
*   /*                                                               */
*   /* CHECK IF MORE THAN 1 GROUP OF DATA TO BE MOVED        @ZA29164*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1029
*   IF CTGFLDNO>=TWO THEN           /* MORE FIELDS TO MOVE ? @ZA29164*/
@RC01005 CLI   CTGFLDNO(FPLPTR),2                                  1029
         BL    @RF01029                                            1029
*     DO CICFPLDI=TWO TO CTGFLDNO;  /* LOOP TO MOVE FIELDS   @ZA29164*/
*                                                                  1030
         LA    @14,2                                               1030
         B     @DE01030                                            1030
@DL01030 DS    0H                                                  1031
*       /*************************************************************/
*       /*                                                           */
*       /* MOVE FIELD DATA IF IT EXISTS                      @ZA29164*/
*       /*                                                           */
*       /*************************************************************/
*                                                                  1031
*       IF CTGFLPT(CICFPLDI)^=ZERO THEN/* PTR TO DATA EXIST  @ZA29164*/
         SLR   @14,@14                                             1031
         L     @05,CICFPLDI(,R4)                                   1031
         SLA   @05,3                                               1031
         C     @14,CTGFLPT-8(@05,FPLPTR)                           1031
         BE    @RF01031                                            1031
*         DO;                       /* YES                   @ZA29164*/
*           IF CTGFLNG(CICFPLDI)^=ZERO THEN/* LENGTH EXIST   @ZA29164*/
         L     @09,CTGFLNG-8(@05,FPLPTR)                           1033
         CR    @09,@14                                             1033
         BE    @RF01033                                            1033
*             DO;                   /* YES                   @ZA29164*/
*               CICBKLNG=CTGFLNG(CICFPLDI);/* SET DATA LENGTH      1035
*                                                            @ZA29164*/
         ST    @09,CICBKLNG(,R4)                                   1035
*               CICBKPTR=ADDR(CTGFLPT(CICFPLDI));/* PT TO DATA     1036
*                                                            @ZA29164*/
         LA    @14,CTGFLPT-8(@05,FPLPTR)                           1036
         ST    @14,CICBKPTR(,R4)                                   1036
*               IF CTGFLNG(CICFPLDI)<=FOUR096 THEN/* BLK LT 4096   1037
*                                                            @ZA29164*/
         C     @09,@CF03779                                        1037
         BH    @RF01037                                            1037
*Z049VCHK:                                                         1038
*                 DO;                                              1038
Z049VCHK DS    0H                                                  1039
*                   CALL IGGPVCHK;                                 1039
         BAL   @14,IGGPVCHK                                        1039
*                   GEN(RLDSBREG IGGPVCHK);/* RELOAD SECONDARY BASE
*                                      REG                           */
         RLDSBREG IGGPVCHK
*                 END;              /* CHECK AND MOVE DATA   @ZA29164*/
*               ELSE                /* BLOCK IS GT4096       @ZA29164*/
*Z050VCGF:                                                         1042
*                 DO;                                              1042
         B     @RC01037                                            1042
@RF01037 DS    0H                                                  1042
Z050VCGF DS    0H                                                  1043
*                   CALL IGGPVCGF;                                 1043
         BAL   @14,IGGPVCGF                                        1043
*                   GEN(RLDSBREG IGGPVCGF);/* RELOAD SECONDARY BASE
*                                      REG                           */
         RLDSBREG IGGPVCGF
*                 END;              /* CHECK AND MOVE DATA   @ZA29164*/
*             END;                  /*                       @ZA29164*/
*           ELSE                                                   1047
*             ;                     /* LENGTH DOES NOT EXIST @ZA29164*/
@RF01033 DS    0H                                                  1048
*         END;                      /*                       @ZA29164*/
*       ELSE                                                       1049
*         ;                         /* PTR TO DATA IS ZERO   @ZA29164*/
@RF01031 DS    0H                                                  1050
*     END;                          /*                       @ZA29164*/
@RC01031 LA    @14,1                                               1050
         AL    @14,CICFPLDI(,R4)                                   1050
@DE01030 ST    @14,CICFPLDI(,R4)                                   1050
         SLR   @05,@05                                             1050
         IC    @05,CTGFLDNO(,FPLPTR)                               1050
         CR    @14,@05                                             1050
         BNH   @DL01030                                            1050
*   ELSE                                                           1051
*     ;                             /* NO MORE FIELDS        @ZA29164*/
*                                                                  1051
@RF01029 DS    0H                                                  1052
*   /*****************************************************************/
*   /*                                                               */
*   /* PROCESS TEST FPL'S IF THEY EXIST                      @ZA29164*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1052
*   CICSVADR=CTGFLCHN;              /* GET PTR TO TEST FPL   @ZA29164*/
         L     @14,CTGFLCHN(,FPLPTR)                               1052
         ST    @14,CICSVADR(,R4)                                   1052
*   CICPRFPL=FPLPTR;                /* SAVE OLD FPL PTR      @ZA29164*/
         ST    FPLPTR,CICPRFPL(,R4)                                1053
*   FPLPTR=CICSVADR;                /* GET TEST FPL ADDRESS  @ZA29164*/
         LR    FPLPTR,@14                                          1054
*   CICGEOPR=TWO;                   /* INITIALIZE            @ZA29164
*                                      PROGRESSION COUNTER   @ZA29164*/
         MVC   CICGEOPR(4,R4),@CF00056                             1055
*   CICINCRM=ZERO;                  /* ZERO INCREMENTAL      @ZA29164
*                                      COUNTER               @ZA29164*/
         SLR   @14,@14                                             1056
         ST    @14,CICINCRM(,R4)                                   1056
*   CICFPLLP=ZERO;                  /* ZERO FPL ADDRESS      @ZA29164*/
*                                                                  1057
         ST    @14,CICFPLLP(,R4)                                   1057
*   /*****************************************************************/
*   /*                                                               */
*   /* LOOP TO PROCESS TEST FPL'S                            @ZA29164*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1058
*   DO WHILE CICSVADR^=ZERO;        /* LOOP WHILE FPLS EXIST @ZA29164*/
         B     @DE01058                                            1058
@DL01058 DS    0H                                                  1059
*     CICINCRM=CICINCRM+ONE;        /* INCREMENT COUNTER     @ZA29164*/
         LA    @14,1                                               1059
         AL    @14,CICINCRM(,R4)                                   1059
         ST    @14,CICINCRM(,R4)                                   1059
*     IF CICINCRM=CICGEOPR THEN     /* COUNTERS EQUAL        @ZA29164*/
         L     @05,CICGEOPR(,R4)                                   1060
         CR    @14,@05                                             1060
         BNE   @RF01060                                            1060
*       DO;                         /* YES                   @ZA29164*/
*         CICGEOPR=CICGEOPR+CICGEOPR;/* DOUBLE GEOMETRIC     @ZA29164
*                                      PROGRESSION COUNTER   @ZA29164*/
         LR    @14,@05                                             1062
         ALR   @14,@05                                             1062
         ST    @14,CICGEOPR(,R4)                                   1062
*         CICINCRM=ZERO;            /* RESET INCR COUNTER    @ZA29164*/
         SLR   @14,@14                                             1063
         ST    @14,CICINCRM(,R4)                                   1063
*         CICFPLLP=CICSVADR;        /* SET TEST FPL POINTER  @ZA29164*/
         L     @14,CICSVADR(,R4)                                   1064
         ST    @14,CICFPLLP(,R4)                                   1064
*       END;                        /*                       @ZA29164*/
*     ELSE                          /* COUNTERS NOT EQUAL    @ZA29164*/
*       DO;                         /* YES                   @ZA29164*/
         B     @RC01060                                            1066
@RF01060 DS    0H                                                  1067
*         IF CICFPLLP=CICSVADR THEN /* FPL ADDRESSES EQUAL   @ZA29164*/
         CLC   CICFPLLP(4,R4),CICSVADR(R4)                         1067
         BNE   @RF01067                                            1067
*           DO;                     /* YES                   @ZA29164*/
*             CICFPLOP=ON;          /* TURN ON FPL LOOP ERR  @ZA29164*/
         OI    CICFPLOP(R4),B'00100000'                            1069
*             CALL EXIT;            /* RETURN TO DRIVER      @ZA29164*/
         BAL   @14,EXIT                                            1070
*           END;                    /*                       @ZA29164*/
*         ELSE                                                     1072
*           ;                       /* COUNTERS NOT EQUAL    @ZA29164*/
@RF01067 DS    0H                                                  1073
*       END;                        /*                       @ZA29164*/
*                                                                  1073
*     /***************************************************************/
*     /*                                                             */
*     /* MOVE THE TEST FPL                                   @ZA29164*/
*     /*                                                             */
*     /***************************************************************/
*                                                                  1074
*     CICBKLNG=LENGTH(CTGFL)+CTGFLDNO*LENGTH(CTGFLDAT);/*    @ZA29164*/
@RC01060 SLR   @14,@14                                             1074
         IC    @14,CTGFLDNO(,FPLPTR)                               1074
         SLA   @14,3                                               1074
         AL    @14,@CF00264                                        1074
         ST    @14,CICBKLNG(,R4)                                   1074
*     CICBKPTR=ADDR(CICPRFPL->CTGFLCHN);/* PTR TO BLOCK      @ZA29164*/
         L     @14,CICPRFPL(,R4)                                   1075
         LA    @14,CTGFLCHN(,@14)                                  1075
         ST    @14,CICBKPTR(,R4)                                   1075
*Z051VCHK:                                                         1076
*     DO;                                                          1076
Z051VCHK DS    0H                                                  1077
*       CALL IGGPVCHK;                                             1077
         BAL   @14,IGGPVCHK                                        1077
*       GEN(RLDSBREG IGGPVCHK);     /* RELOAD SECONDARY BASE REG     */
         RLDSBREG IGGPVCHK
*     END;                          /* VERIFY AND MOVE FPL   @ZA29164*/
*     FPLPTR=CICPRFPL->CTGFLCHN;    /* POINT TO NEW TEST FPL @ZA29164*/
*                                                                  1080
         L     @14,CICPRFPL(,R4)                                   1080
         L     FPLPTR,CTGFLCHN(,@14)                               1080
*     /***************************************************************/
*     /*                                                             */
*     /* MOVE NAME IF PRESENT                                @ZA29164*/
*     /*                                                             */
*     /***************************************************************/
*                                                                  1081
*     IF CTGFLDNM^=ZERO THEN        /* FIELDNAME EXIST       @ZA29164*/
         L     @14,CTGFLDNM(,FPLPTR)                               1081
         LTR   @14,@14                                             1081
         BZ    @RF01081                                            1081
*       DO;                         /* YES                   @ZA29164*/
*         CICBKPTR=ADDR(CTGFLDNM);  /* SET PTR TO BLOCK      @ZA29164*/
         LA    @14,CTGFLDNM(,FPLPTR)                               1083
         ST    @14,CICBKPTR(,R4)                                   1083
*Z052M8BT:                                                         1084
*         DO;                                                      1084
Z052M8BT DS    0H                                                  1085
*           CALL IGGPM8BT;                                         1085
         BAL   @14,IGGPM8BT                                        1085
*           GEN(RLDSBREG IGGPM8BT); /* RELOAD SECONDARY BASE REG     */
         RLDSBREG IGGPM8BT
*         END;                      /* MOVE NAME TO KEY 0    @ZA29164*/
*       END;                        /* AREA                  @ZA29164*/
*     ELSE                                                         1089
*       ;                           /* FIELDNAME IS ZERO     @ZA29164*/
*                                                                  1089
@RF01081 DS    0H                                                  1090
*     /***************************************************************/
*     /*                                                             */
*     /* MOVE FIELD DATA IF IT EXISTS                        @ZA29164*/
*     /*                                                             */
*     /***************************************************************/
*                                                                  1090
*     IF CTGFLPT(1)^=ZERO THEN      /* FIELD DATA PTR EXIST  @ZA29164*/
         SLR   @14,@14                                             1090
         C     @14,CTGFLPT(,FPLPTR)                                1090
         BE    @RF01090                                            1090
*       DO;                         /* YES                   @ZA29164*/
*         IF CTGFLNG(1)^=ZERO THEN  /* THEN LENGTH EXIST     @ZA29164*/
         L     @05,CTGFLNG(,FPLPTR)                                1092
         CR    @05,@14                                             1092
         BE    @RF01092                                            1092
*           DO;                     /* YES                   @ZA29164*/
*             CICBKLNG=CTGFLNG(1);  /* SET DATA LENGTH       @ZA29164*/
         ST    @05,CICBKLNG(,R4)                                   1094
*             CICBKPTR=ADDR(CTGFLPT(1));/* SET BLOCK PTR     @ZA29164*/
         LA    @14,CTGFLPT(,FPLPTR)                                1095
         ST    @14,CICBKPTR(,R4)                                   1095
*             IF CTGFLNG(1)<=FOUR096 THEN/* DATA LNGTH       @ZA29164
*                                      LESS THAN 4K          @ZA29164*/
         C     @05,@CF03779                                        1096
         BH    @RF01096                                            1096
*Z053VCHK:                                                         1097
*               DO;                                                1097
Z053VCHK DS    0H                                                  1098
*                 CALL IGGPVCHK;                                   1098
         BAL   @14,IGGPVCHK                                        1098
*                 GEN(RLDSBREG IGGPVCHK);/* RELOAD SECONDARY BASE REG*/
         RLDSBREG IGGPVCHK
*               END;                /* CHECK AND MOVE DATA   @ZA29164*/
*             ELSE                  /* DATA LENGTH GREATER   @ZA29164
*                                      THAN 4K               @ZA29164*/
*Z054VCGF:                                                         1101
*               DO;                                                1101
         B     @RC01096                                            1101
@RF01096 DS    0H                                                  1101
Z054VCGF DS    0H                                                  1102
*                 CALL IGGPVCGF;                                   1102
         BAL   @14,IGGPVCGF                                        1102
*                 GEN(RLDSBREG IGGPVCGF);/* RELOAD SECONDARY BASE REG*/
         RLDSBREG IGGPVCGF
*               END;                /* CHECK AND MOVE DATA   @ZA29164*/
*           END;                    /*                       @ZA29164*/
*         ELSE                                                     1106
*           ;                       /* FIELD LENGTH ZERO     @ZA29164*/
@RF01092 DS    0H                                                  1107
*       END;                        /*                       @ZA29164*/
*     ELSE                                                         1108
*       ;                           /* FIELD DATA PTR ZERO   @ZA29164*/
@RF01090 DS    0H                                                  1109
*     CICSVADR=CTGFLCHN;            /* GET POINTER TO NEXT   @ZA29164
*                                      TEST FPL. THIS VALUE  @ZA29164
*                                      MAY BE ZERO           @ZA29164*/
@RC01090 L     @14,CTGFLCHN(,FPLPTR)                               1109
         ST    @14,CICSVADR(,R4)                                   1109
*     CICPRFPL=FPLPTR;              /* SAVE OLD FPL PTR      @ZA29164*/
         ST    FPLPTR,CICPRFPL(,R4)                                1110
*     FPLPTR=CICSVADR;              /* GET TEST FPL ADDRESS  @ZA29164*/
         LR    FPLPTR,@14                                          1111
*   END;                            /* END OF TEST FPL LOOP  @ZA29164*/
@DE01058 L     @14,CICSVADR(,R4)                                   1112
         LTR   @14,@14                                             1112
         BNZ   @DL01058                                            1112
*   R3=CICREGSV;                    /* RESTORE REGISTER 3    @ZA29164*/
         L     R3,CICREGSV(,R4)                                    1113
*   CALL EXIT;                      /* RETURN TO CALLER              */
         BAL   @14,EXIT                                            1114
*   GEN(DS 0F);                     /* FULLWORD BOUNDARY ALIGNMENT   */
         DS 0F
*   GEN(DC CL8'IGGPM8BT');          /* NAME OF FOLLOWING PROCEDURE   */
         DC CL8'IGGPM8BT'
*   END;                            /* END OF INNER PROCEDURE        */
@EL00006 DS    0H                                                  1117
@EF00006 DS    0H                                                  1117
@ER00006 BR    @14                                                 1117
         EJECT
*                                                                  1118
*/********************************************************************/
*/*                                                                  */
*/*        IGGPM8BT  -  PROCEDURE  EXTERNALLY  CALLED  NESTED        */
*/*                                                                  */
*/********************************************************************/
*                                                                  1118
*IGGPM8BT:                                                         1118
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);/* SPECIFY PROCEDURE OPTIONS     */
IGGPM8BT DS    0H                                                  1119
*   GEN(ENTRY IGGPM8BT );           /* IDENTIFY ENTRY-POINT SYMBOL   */
         ENTRY IGGPM8BT
*Z055:                              /* LABEL FOR PROCEDURE TRACKING  */
*Z055M8BT:                          /* LABEL FOR PROCEDURE TRACKING  */
*   RFY                                                            1120
*    (R5,                                                          1120
*     R6,                                                          1120
*     R7,                                                          1120
*     R8,                                                          1120
*     R9) UNRSTD;                   /* PL/S COMPILER WORK REGISTERS  */
Z055     DS    0H                                                  1120
Z055M8BT DS    0H                                                  1121
*   RFY                                                            1121
*    (R2,                                                          1121
*     R3,                                                          1121
*     R4) RSTD;                     /* RESTRICT LOCAL WORK REGISTERS */
*   GEN(STM 12,14,12(13));          /* SAVE REGISTERS OF CALLER      */
         STM 12,14,12(13)
*   GEN(LA 13,12(13));              /* POINT TO NEXT SAVE AREA       */
         LA 13,12(13)
*   GEN(BALR 12,0);                 /* ESTABLISH ADDRESSABILITY      */
         BALR 12,0
*   GEN(USING *,12);                /* INDICATE AVAILABLE BASE REG   */
         USING *,12
*   GEN(B *+6);                     /* BRANCH AROUND CONSTANT        */
         B *+6
*   GEN(DC AL2(*-@MAINENT-4));      /* OFFSET TO MODULE BASE 1       */
         DC AL2(*-@MAINENT-4)
*   GEN(SH 12,*-2);                 /* COMPUTE MODULE BASE 1         */
         SH 12,*-2
*   GEN(LA 10,4095(0,12));          /* LOAD BASE 2 REG WITH 4095     */
         LA 10,4095(0,12)
*   GEN(USING @MAINENT,12);         /* INDICATE AVAILABLE BASE REG1  */
         USING @MAINENT,12
*   GEN(USING @MAINENT+4095,10);    /* INDICATE AVAILABLE BASE REG2
*                                                            @ZA29164*/
         USING @MAINENT+4095,10
*/***********************************************************@ZA29164*/
*/*                                                          @ZA29164*/
*/* PROCEDURE NAME = IGGPM8BT                                @ZA29164*/
*/*                                                          @ZA29164*/
*/* DESCRIPTIVE NAME = MOVE EIGHT BYTE NAME                  @ZA29164*/
*/*                                                          @ZA29164*/
*/* FUNCTION =                                               @ZA29164*/
*/* THE MOVE EIGHT BYTE ROUTINE WILL BE USED TO MOVE EIGHT   @ZA29164*/
*/* BYTE NAMES. THESE NAMES DO NOT REQUIRE VERIFICATION      @ZA29164*/
*/* BEFORE THEY ARE MOVED.                                   @ZA29164*/
*/*                                                          @ZA29164*/
*/* INPUT = ADDRESS OF EIGHT BYTE NAME IN CICBKPTR           @ZA29164*/
*/*                                                          @ZA29164*/
*/* OUTPUT = ADDRESS OF EIGHT BYTE NAME MOVED TO             @ZA29164*/
*/*          KEY 0 CORE. THIS ADDRESS WILL BE PLACED         @ZA29164*/
*/*          INTO THE POINTER THAT WAS REFERENCED BY         @ZA29164*/
*/*          CICBKPTR.                                       @ZA29164*/
*/*                                                          @ZA29164*/
*/***********************************************************@ZA29164*/
*                                                                  1132
*   IF EIGHT>CICRMBYT THEN          /* ENOUGH ROOM IN AREA   @ZA29164*/
         L     @14,CICRMBYT(,R4)                                   1132
         C     @14,@CF00043                                        1132
         BNL   @RF01132                                            1132
*     IF CICCISSP^=ZERO THEN        /* SECONDARY AREA EXIST  @ZA29164*/
         L     @14,CICCISSP(,R4)                                   1133
         LTR   @14,@14                                             1133
         BZ    @RF01133                                            1133
*       IF CICPTRSW=ON THEN         /* WERE POINTERS         @ZA29164
*                                      PREVIOUSLY SWITCHED   @ZA29164*/
         TM    CICPTRSW(R4),B'01000000'                            1134
         BNO   @RF01134                                            1134
*         DO;                       /* YES, AND NOW THERE IS @ZA29164
*                                      NO ROOM IN SECONDARY  @ZA29164
*                                      AREA                  @ZA29164*/
*           CICCOUNT=ON;            /* ALERT DRIVER          @ZA29164*/
         OI    CICCOUNT(R4),B'10000000'                            1136
*           CALL EXIT;              /* RETURN                @ZA29164*/
         BAL   @14,EXIT                                            1137
*         END;                      /*                       @ZA29164*/
*       ELSE                        /* PTRS WERE NOT         @ZA29164*/
*         DO;                       /* PREVIOUSLY SWITCHED   @ZA29164*/
         B     @RC01134                                            1139
@RF01134 DS    0H                                                  1140
*           CICNXTBK=CICCISSP;      /* POINT TO SECOND AREA  @ZA29164*/
         L     @14,CICCISSP(,R4)                                   1140
         ST    @14,CICNXTBK(,R4)                                   1140
*           CICRMBYT=CICSABYT;      /* SET AVAILABLE BYTES   @ZA29164*/
         L     @14,CICSABYT(,R4)                                   1141
         ST    @14,CICRMBYT(,R4)                                   1141
*           CICPTRSW=ON;            /* PTRS WERE SWITCHED    @ZA29164*/
         OI    CICPTRSW(R4),B'01000000'                            1142
*         END;                      /*                       @ZA29164*/
*     ELSE                          /* SECONDARY AREA DOES   @ZA29164*/
*       DO;                         /* NOT EXIST             @ZA29164*/
         B     @RC01133                                            1144
@RF01133 DS    0H                                                  1145
*         CICCOUNT=ON;              /* SET COUNT MODE        @ZA29164*/
         OI    CICCOUNT(R4),B'10000000'                            1145
*         CICGMCNT=CICGMCNT+R15;    /* ACCUMULATE LENGTH FOR @ZA29164
*                                      LATER GETMAIN         @ZA29164*/
         LR    @14,R15                                             1146
         AL    @14,CICGMCNT(,R4)                                   1146
         ST    @14,CICGMCNT(,R4)                                   1146
*         CICRMBYT=CICRMBYT-R15;    /* UPDATE REMAINING      @ZA29164
*                                      BYTES                 @ZA29164*/
         L     @14,CICRMBYT(,R4)                                   1147
         SLR   @14,R15                                             1147
         ST    @14,CICRMBYT(,R4)                                   1147
*         CALL EXIT;                /* RETURN TO DRIVER      @ZA29164*/
         BAL   @14,EXIT                                            1148
*       END;                        /*                       @ZA29164*/
*   ELSE                                                           1150
*     ;                             /* ENOUGH ROOM FOR MOVE  @ZA29164*/
*                                                                  1150
@RF01132 DS    0H                                                  1151
*   /*****************************************************************/
*   /*                                                               */
*   /* MOVE EIGHT BYTE AREA                                  @ZA29164*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1151
*   RFY                                                            1151
*    (R6,                                                          1151
*     R7) RSTD;                     /* RESTRICT LOAD REGS    @ZA29164*/
@RC01132 DS    0H                                                  1152
*   LM(R6,R7,FNAMINPT);             /* LOAD REGISTERS        @ZA29164*/
         L     @14,CICBKPTR(,R4)                                   1152
         L     @05,BLOCKPTR(,@14)                                  1152
         LM    R6,R7,FNAMINPT(@05)                                 1152
*   STM(R6,R7,FNAMOUTP);            /* STORE REGISTERS       @ZA29164*/
         L     @05,CICNXTBK(,R4)                                   1153
         STM   R6,R7,FNAMOUTP(@05)                                 1153
*   RFY                                                            1154
*    (R6,                                                          1154
*     R7) UNRSTD;                   /* RELEASE LOAD REGS     @ZA29164*/
*                                                                  1154
*   /*****************************************************************/
*   /*                                                               */
*   /* UPDATE INPUT POINTER,OUTPUT POINTER & REMAINING BYTES @ZA29164*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1155
*   BLOCKPTR=CICNXTBK;              /* UPDATE INPUT POINTER  @ZA29164*/
         ST    @05,BLOCKPTR(,@14)                                  1155
*   CICNXTBK=CICNXTBK+EIGHT;        /* UPDATE OUTPUT POINTER @ZA29164
*                                      TO NEXT AREA          @ZA29164*/
         LA    @14,8                                               1156
         ALR   @05,@14                                             1156
         ST    @05,CICNXTBK(,R4)                                   1156
*   CICRMBYT=CICRMBYT-EIGHT;        /* DECREMENT REMAINING   @ZA29164
*                                      BYTES                 @ZA29164*/
         LCR   @14,@14                                             1157
         AL    @14,CICRMBYT(,R4)                                   1157
         ST    @14,CICRMBYT(,R4)                                   1157
*   CALL EXIT;                      /* RETURN TO CALLER              */
         BAL   @14,EXIT                                            1158
*   GEN(DS 0F);                     /* FULLWORD BOUNDARY ALIGNMENT   */
         DS 0F
*   GEN(DC CL8'IGGPCCPL');          /* NAME OF FOLLOWING PROCEDURE   */
         DC CL8'IGGPCCPL'
*   END;                            /* END OF INNER PROCEDURE        */
@EL00007 DS    0H                                                  1161
@EF00007 DS    0H                                                  1161
@ER00007 BR    @14                                                 1161
         EJECT
*                                                                  1162
*/********************************************************************/
*/*                                                                  */
*/*        IGGPCCPL  -  PROCEDURE  INTERNALLY  CALLED  NESTED        */
*/*                                                                  */
*/********************************************************************/
*                                                                  1162
*IGGPCCPL:                                                         1162
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);/* SPECIFY PROCEDURE OPTIONS     */
IGGPCCPL DS    0H                                                  1163
*Z056:                              /* LABEL FOR PROCEDURE TRACKING  */
*Z056CCPL:                          /* LABEL FOR PROCEDURE TRACKING  */
*   RFY                                                            1163
*    (R5,                                                          1163
*     R6,                                                          1163
*     R7,                                                          1163
*     R8,                                                          1163
*     R9) UNRSTD;                   /* PL/S COMPILER WORK REGISTERS  */
Z056     DS    0H                                                  1163
Z056CCPL DS    0H                                                  1164
*   RFY                                                            1164
*    (R2,                                                          1164
*     R3,                                                          1164
*     R4) RSTD;                     /* RESTRICT LOCAL WORK REGISTERS */
*   GEN(STM 12,14,12(13));          /* SAVE REGISTERS OF CALLER      */
         STM 12,14,12(13)
*   GEN(LA 13,12(13));              /* POINT TO NEXT SAVE AREA     1166
*                                                            @ZA29164*/
         LA 13,12(13)
*/********************************************************** @ZA29164*/
*/*                                                          @ZA29164*/
*/* PROCEDURE NAME = IGGPCCPL                                @ZA29164*/
*/*                                                          @ZA29164*/
*/* DESCRIPTIVE NAME = CPL DRIVER                            @ZA29164*/
*/*                                                          @ZA29164*/
*/* FUNCTION =                                               @ZA29164*/
*/*   THE PURPOSE OF THIS ROUTINE IS TO CAUSE THE USERS CPL  @ZA29164*/
*/*   AND ASSOCIATED DATA AREAS TO BE MOVED FROM THE USERS   @ZA29164*/
*/*   CORE TO KEY 0 FETCH PROTECTED CORE,SUBPOOL 229. THE    @ZA29164*/
*/*   KEY 0 CORE WILL BE REFERRED TO AS CISA (VSAM           @ZA29164*/
*/*   INTEGRITY SAVE AREA). THE ROUTING WORKS IN             @ZA29164*/
*/*   CONJUNCTION WITH VALIDITY AND CHECK ROUTINES,          @ZA29164*/
*/*   IGGPMDAT,IGGPVCHK,IGGPM8BT,IGGPMPAS,AND IGGPVCGF.      @ZA29164*/
*/*   ONE OF THESE ROUTINES IS CALLED EACH TIME A BLOCK OF   @ZA29164*/
*/*   CORE IS TO BE MOVED. INPUT TO THE MOVING ROUTINE       @ZA29164*/
*/*   CONSISTS OF THE LENGTH OF DATA TO BE MOVED             @ZA29164*/
*/*   (CICBKLNG),AND A POINTER(CICBKPTR) TO A FIELD          @ZA29164*/
*/*   CONTAINING THE ADDRESS OF THE CORE TO BE MOVED.        @ZA29164*/
*/*                                                          @ZA29164*/
*/* INPUT =                                                  @ZA29164*/
*/*   ADDRESS OF CPL IN CCACPL                               @ZA29164*/
*/*                                                          @ZA29164*/
*/* OUTPUT =                                                 @ZA29164*/
*/*   CPL AND ASSOCIATED DATA AREAS MOVED TO KEY 0 CORE      @ZA29164*/
*/********************************************************** @ZA29164*/
*                                                                  1167
*   /*****************************************************************/
*   /*                                                               */
*   /* VALIDITY CHECK AND MOVE CPL                           @ZA29164*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1167
*   CICBKLNG=LENGTH(CTGPL)+CTGNOFLD*4;/* LENGTH OF CPL       @ZA29164*/
         L     @14,CCACPL(,R11)                                    1167
         SLR   @05,@05                                             1167
         IC    @05,CTGNOFLD(,@14)                                  1167
         SLA   @05,2                                               1167
         AL    @05,@CF00117                                        1167
         ST    @05,CICBKLNG(,R4)                                   1167
*   CICBKPTR=ADDR(CCACPL);          /* ADDR OF POINTER TO CPL      1168
*                                                            @ZA29164*/
         LA    @14,CCACPL(,R11)                                    1168
         ST    @14,CICBKPTR(,R4)                                   1168
*Z057VCHK:                                                         1169
*   DO;                                                            1169
Z057VCHK DS    0H                                                  1170
*     CALL IGGPVCHK;                                               1170
         BAL   @14,IGGPVCHK                                        1170
*     GEN(RLDSBREG IGGPVCHK);       /* RELOAD SECONDARY BASE REG     */
         RLDSBREG IGGPVCHK
*   END;                            /* VALIDITY CHECK AND    @ZA29164
*                                      MOVE CPL              @ZA29164*/
*   CCACPLOK=ON;                    /* CPL IS VALID          @ZA29164*/
*                                                                  1173
         OI    CCACPLOK(R11),B'01000000'                           1173
*   /*****************************************************************/
*   /*                                                               */
*   /* MOVE CATALOG NAME FIELD IF ONE EXISTS OTHER THAN      @ZA29164*/
*   /* AN ACB POINTER.                                       @ZA29164*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1174
*   IF CTGCAT=ZEROP THEN                                           1174
         L     @14,CCACPL(,R11)                                    1174
         L     @14,CTGCAT(,@14)                                    1174
         LTR   @14,@14                                             1174
         BZ    @RT01174                                            1174
*     ;                             /* NO CATALOG NAME       @ZA29164*/
*   ELSE                            /* CATALOG NAME          @ZA29164*/
*     DO;                           /* AVAILABLE             @ZA29164*/
*       CICBKPTR=ADDR(CTGCAT);      /* ADDR OF POINTER TO    @ZA29164*/
         L     @14,CCACPL(,R11)                                    1177
         LA    @05,CTGCAT(,@14)                                    1177
         ST    @05,CICBKPTR(,R4)                                   1177
*       IF CTGCNAME=OFF THEN        /* INDICATES CATALOG     @ZA29164
*                                      ACB PTR               @ZA29164*/
         TM    CTGCNAME(@14),B'00000010'                           1178
         BNZ   @RF01178                                            1178
*         CICBKLNG=FOUR;            /* LENGTH OF ACB PTR     @ZA29164*/
         MVC   CICBKLNG(4,R4),@CF00059                             1179
*       ELSE                        /* NOT CATALOG ACB PTR   @ZA29164
*                                      MOVE CATALOG NAME     @ZA29164
*                                      FIELD                 @ZA29164
*                                      CAT NAME              @ZA29164*/
*         CICBKLNG=NMELNG;          /* LENGTH OF CAT NAME    @ZA29164
*                                      FIELD                 @ZA29164*/
         B     @RC01178                                            1180
@RF01178 MVC   CICBKLNG(4,R4),@CF00125                             1180
*Z058MDAT:                                                         1181
*       DO;                                                        1181
@RC01178 DS    0H                                                  1181
Z058MDAT DS    0H                                                  1182
*         CALL IGGPMDAT;                                           1182
         BAL   @14,IGGPMDAT                                        1182
*         GEN(RLDSBREG IGGPMDAT);   /* RELOAD SECONDARY BASE REG     */
         RLDSBREG IGGPMDAT
*       END;                        /* MOVE CAT NAME FIELD   @ZA29164*/
*     END;                          /*                       @ZA29164*/
*                                                                  1185
*   /*****************************************************************/
*   /*                                                               */
*   /* MOVE PASSWORD                                         @ZA29164*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1186
*   IF CTGPSWD=ZEROP THEN                                          1186
@RT01174 L     @14,CCACPL(,R11)                                    1186
         L     @14,CTGPSWD(,@14)                                   1186
         LTR   @14,@14                                             1186
         BZ    @RT01186                                            1186
*     ;                             /* NO PASSWORD           @ZA29164*/
*   ELSE                            /* PASSWORD              @ZA29164*/
*     DO;                           /* MOVE PASSWORD         @ZA29164*/
*       CICBKLNG=EIGHT;             /* SET LENGTH            @ZA29164*/
         MVC   CICBKLNG(4,R4),@CF00043                             1189
*       CICBKPTR=ADDR(CTGPSWD);     /* ADDR OF POINTER TO    @ZA29164
*                                      PASSWORD              @ZA29164*/
         L     @14,CCACPL(,R11)                                    1190
         LA    @14,CTGPSWD(,@14)                                   1190
         ST    @14,CICBKPTR(,R4)                                   1190
*Z059MPAS:                                                         1191
*       DO;                                                        1191
Z059MPAS DS    0H                                                  1192
*         CALL IGGPMPAS;                                           1192
         BAL   @14,IGGPMPAS                                        1192
*         GEN(RLDSBREG IGGPMPAS);   /* RELOAD SECONDARY BASE REG     */
         RLDSBREG IGGPMPAS
*       END;                        /* MOVE PASSWORD         @ZA29164*/
*     END;                          /* END MOVE PASSWORD     @ZA29164*/
*                                                                  1195
*   /*****************************************************************/
*   /*                                                               */
*   /* MOVE JCL DD STATEMENT OR NEW DSNAME                   @ZA29164*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1196
*   IF CTGDDNM=ZEROP THEN                                          1196
@RT01186 L     @14,CCACPL(,R11)                                    1196
         L     @14,CTGDDNM(,@14)                                   1196
         LTR   @14,@14                                             1196
         BZ    @RT01196                                            1196
*     ;                             /* NO DATA FIELD TO MOVE @ZA29164*/
*   ELSE                            /* DATA FIELD TO MOVE    @ZA29164*/
*     DO;                           /*                       @ZA29164*/
*       CICBKPTR=ADDR(CTGDDNM);     /* ADDR OF POINTER TO    @ZA29164
*                                      DATA FIELD            @ZA29164*/
         L     @14,CCACPL(,R11)                                    1199
         LA    @05,CTGDDNM(,@14)                                   1199
         ST    @05,CICBKPTR(,R4)                                   1199
*       IF CTGOPTNS=CTGDELET THEN   /* DELETE OPTION         @ZA29164*/
         TM    CTGOPTNS(@14),B'00011000'                           1200
         BNO   @RF01200                                            1200
         TM    CTGOPTNS(@14),B'11100000'                           1200
         BNZ   @RF01200                                            1200
*Z060M8BT:                                                         1201
*         DO;                                                      1201
Z060M8BT DS    0H                                                  1202
*           CALL IGGPM8BT;                                         1202
         BAL   @14,IGGPM8BT                                        1202
*           GEN(RLDSBREG IGGPM8BT); /* RELOAD SECONDARY BASE REG     */
         RLDSBREG IGGPM8BT
*         END;                      /* MOVE JCL DD STATEMENT @ZA29164*/
*       ELSE                        /* MOVE DSNAME           @ZA29164*/
*         DO;                       /*                       @ZA29164*/
         B     @RC01200                                            1205
@RF01200 DS    0H                                                  1206
*           CICBKLNG=NMELNG;        /* LENGTH OF DSNAME      @ZA29164*/
         MVC   CICBKLNG(4,R4),@CF00125                             1206
*Z061MDAT:                                                         1207
*           DO;                                                    1207
Z061MDAT DS    0H                                                  1208
*             CALL IGGPMDAT;                                       1208
         BAL   @14,IGGPMDAT                                        1208
*             GEN(RLDSBREG IGGPMDAT);/* RELOAD SECONDARY BASE REG    */
         RLDSBREG IGGPMDAT
*           END;                    /* MOVE DSNAME           @ZA29164*/
*         END;                      /* END MOVE DSNAME       @ZA29164*/
*     END;                          /*                       @ZA29164*/
*                                                                  1212
@RC01200 DS    0H                                                  1213
*   /*****************************************************************/
*   /*                                                               */
*   /* CALL IGGPCFVT IF DEFINE OR ALTER, TO MOVE FVTS        @ZA29164*/
*   /* AND ASSOCIATED FPLS.                                  @ZA29164*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1213
*   IF CTGOPTNS=CTGDEFIN×           /*                       @ZA29164*/
*       CTGOPTNS=CTGALTER THEN      /* DEFINE OR ALTER       @ZA29164*/
@RT01196 L     @14,CCACPL(,R11)                                    1213
         TM    CTGOPTNS(@14),B'00001000'                           1213
         BNO   @GL00035                                            1213
         TM    CTGOPTNS(@14),B'11110000'                           1213
         BZ    @RT01213                                            1213
@GL00035 L     @14,CCACPL(,R11)                                    1213
         TM    CTGOPTNS(@14),B'00010000'                           1213
         BNO   @RF01213                                            1213
         TM    CTGOPTNS(@14),B'11101000'                           1213
         BNZ   @RF01213                                            1213
@RT01213 DS    0H                                                  1214
*     DO;                           /* YES                   @ZA29164*/
*       CICBKPTR=ADDR(CTGFVT);      /* ADDR OF PTR TO FVT    @ZA29164*/
         L     @14,CCACPL(,R11)                                    1215
         LA    @14,CTGFVT(,@14)                                    1215
         ST    @14,CICBKPTR(,R4)                                   1215
*Z062CFVT:                                                         1216
*       DO;                                                        1216
Z062CFVT DS    0H                                                  1217
*         CALL IGGPCFVT;                                           1217
         L     @15,@CV04060                                        1217
         BALR  @14,@15                                             1217
*         GEN(RLDSBREG IGGPCFVT);   /* RELOAD SECONDARY BASE REG     */
         RLDSBREG IGGPCFVT
*       END;                        /* CALL FVT MOVE ROUTINE @ZA29164*/
*     END;                          /*                       @ZA29164*/
*   ELSE                            /*                       @ZA29164*/
*                                                                  1221
*     /***************************************************************/
*     /*                                                             */
*     /* MOVE THE CATALOG IDENTIFIER RECORD                  @ZA29164*/
*     /*                                                             */
*     /***************************************************************/
*                                                                  1221
*     DO;                           /* SET UP NON FVT BLOCK  @ZA29164*/
         B     @RC01213                                            1221
@RF01213 DS    0H                                                  1222
*       IF CTGENT=ZEROP THEN                                       1222
         L     @14,CCACPL(,R11)                                    1222
         L     @14,CTGENT(,@14)                                    1222
         LTR   @14,@14                                             1222
         BZ    @RT01222                                            1222
*         ;                         /* NO CATALOG IDENTIFIER @ZA29164
*                                      RECORD                @ZA29164*/
*       ELSE                        /* CHECK LENGTH OF CAT   @ZA29164
*                                      IDENTIFIER            @ZA29164*/
*         DO;                       /* MOVE ENT IDENTIFIER   @ZA29164*/
*           IF CTGNAME=OFF THEN     /*                       @ZA29164*/
         L     @14,CCACPL(,R11)                                    1225
         TM    CTGNAME(@14),B'00000100'                            1225
         BNZ   @RF01225                                            1225
*             CICBKLNG=THREE;       /* LENGTH OF ENTRY       @ZA29164
*                                      IDENTIFIER            @ZA29164*/
         MVC   CICBKLNG(4,R4),@CF00421                             1226
*           ELSE                    /*                       @ZA29164*/
*             IF CTGGENLD=ON THEN   /* GENERIC LOCATE        @ZA29164*/
         B     @RC01225                                            1227
@RF01225 L     @14,CCACPL(,R11)                                    1227
         TM    CTGGENLD(@14),B'00000001'                           1227
         BNO   @RF01227                                            1227
*               CICBKLNG=CTGENT->TNAM(1:1)+1;/* LENGTH OF ENTRY    1228
*                                                            @ZA29164*/
         L     @14,CTGENT(,@14)                                    1228
         LA    @05,1                                               1228
         SLR   @00,@00                                             1228
         IC    @00,TNAM(,@14)                                      1228
         ALR   @05,@00                                             1228
         ST    @05,CICBKLNG(,R4)                                   1228
*             ELSE                  /* NOT GENERIC LOCATE    @ZA29164*/
*               CICBKLNG=NMELNG;    /* LENGTH OF ENTRY       @ZA29164
*                                      IDENTIFIER            @ZA29164*/
         B     @RC01227                                            1229
@RF01227 MVC   CICBKLNG(4,R4),@CF00125                             1229
*           CICBKPTR=ADDR(CTGENT);  /* ADDR OF POINTER TO    @ZA29164
*                                      ENT IDENT             @ZA29164*/
@RC01227 DS    0H                                                  1230
@RC01225 L     @14,CCACPL(,R11)                                    1230
         LA    @14,CTGENT(,@14)                                    1230
         ST    @14,CICBKPTR(,R4)                                   1230
*Z063MDAT:                                                         1231
*           DO;                                                    1231
Z063MDAT DS    0H                                                  1232
*             CALL IGGPMDAT;                                       1232
         BAL   @14,IGGPMDAT                                        1232
*             GEN(RLDSBREG IGGPMDAT);/* RELOAD SECONDARY BASE REG    */
         RLDSBREG IGGPMDAT
*           END;                    /* MOVE ENT IDENTIFIER   @ZA29164*/
*         END;                      /* END OF MOVE ENT       @ZA29164
*                                      IDENTIFIER            @ZA29164*/
*                                                                  1235
*       /*************************************************************/
*       /*                                                           */
*       /* MOVE FPLS ASSOCIATED WITH CPL                     @ZA29164*/
*       /*                                                           */
*       /*************************************************************/
*                                                                  1236
*       DO I=1 TO CTGNOFLD BY 1;    /* PROCESS FPLS POINTED  @ZA29164
*                                      TO BY CPL             @ZA29164*/
@RT01222 LA    I,1                                                 1236
         B     @DE01236                                            1236
@DL01236 DS    0H                                                  1237
*         CICBKPTR=ADDR(CTGFIELD(I));/* ADDR OF POINTER TO   @ZA29164
*                                      FPL                   @ZA29164*/
         LR    @14,I                                               1237
         SLA   @14,2                                               1237
         L     @05,CCACPL(,R11)                                    1237
         LA    @14,CTGFIELD-4(@14,@05)                             1237
         ST    @14,CICBKPTR(,R4)                                   1237
*Z064CFPL:                                                         1238
*         DO;                                                      1238
Z064CFPL DS    0H                                                  1239
*           CALL IGGPCFPL;                                         1239
         BAL   @14,IGGPCFPL                                        1239
*           GEN(RLDSBREG IGGPCFPL); /* RELOAD SECONDARY BASE REG     */
         RLDSBREG IGGPCFPL
*         END;                      /* MOVE FPL AND ASSOC    @ZA29164
*                                      TEST FPLS             @ZA29164*/
*       END;                        /* END OF MOVE FPL       @ZA29164*/
         AL    I,@CF00038                                          1242
@DE01236 L     @14,CCACPL(,R11)                                    1242
         SLR   @05,@05                                             1242
         IC    @05,CTGNOFLD(,@14)                                  1242
         CR    I,@05                                               1242
         BNH   @DL01236                                            1242
*     END;                          /*                       @ZA29164*/
*                                                                  1243
*   /*****************************************************************/
*   /*                                                               */
*   /* MOVE USERS WORK AREA                                  @ZA29164*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1244
*   IF CTGWKA=ZEROP THEN                                           1244
@RC01213 L     @14,CCACPL(,R11)                                    1244
         L     @14,CTGWKA(,@14)                                    1244
         LTR   @14,@14                                             1244
         BZ    @RT01244                                            1244
*     ;                             /* NO WORK AREA TO MOVE  @ZA29164*/
*   ELSE                            /* MOVE WORK AREA        @ZA29164*/
*     DO;                           /*                       @ZA29164*/
*       CICBKLNG=WKALEN1;           /* LENGTH OF             @ZA29164
*                                      WORK AREA             @ZA29164*/
         L     @14,CCACPL(,R11)                                    1247
         L     @05,CTGWKA(,@14)                                    1247
         LH    @05,WKALEN1(,@05)                                   1247
         ST    @05,CICBKLNG(,R4)                                   1247
*       CICBKPTR=ADDR(CTGWKA);      /* ADDR OF POINTER TO    @ZA29164
*                                      WORK AREA             @ZA29164*/
         LA    @14,CTGWKA(,@14)                                    1248
         ST    @14,CICBKPTR(,R4)                                   1248
*       IF CICBKLNG>FOUR096 THEN    /* USER WORK AREA > 4K   @ZA29164*/
         C     @05,@CF03779                                        1249
         BNH   @RF01249                                            1249
*Z065VCGF:                                                         1250
*         DO;                                                      1250
Z065VCGF DS    0H                                                  1251
*           CALL IGGPVCGF;                                         1251
         BAL   @14,IGGPVCGF                                        1251
*           GEN(RLDSBREG IGGPVCGF); /* RELOAD SECONDARY BASE REG     */
         RLDSBREG IGGPVCGF
*         END;                      /* YES MOVE > 4K WORK    @ZA29164
*                                      AREA                  @ZA29164*/
*       ELSE                        /* NO                    @ZA29164*/
*Z066VCHK:                                                         1254
*         DO;                                                      1254
         B     @RC01249                                            1254
@RF01249 DS    0H                                                  1254
Z066VCHK DS    0H                                                  1255
*           CALL IGGPVCHK;                                         1255
         BAL   @14,IGGPVCHK                                        1255
*           GEN(RLDSBREG IGGPVCHK); /* RELOAD SECONDARY BASE REG     */
         RLDSBREG IGGPVCHK
*         END;                      /* MOVE < 4K WORK AREA   @ZA29164*/
*     END;                          /* END MOVE USER WORK    @ZA29164
*                                      AREA                  @ZA29164*/
@RC01249 DS    0H                                                  1259
*   CALL EXIT;                      /* RETURN TO CALLER              */
@RT01244 BAL   @14,EXIT                                            1259
*   GEN(DS 0F);                     /* FULLWORD BOUNDARY ALIGNMENT   */
         DS 0F
*   GEN(DC CL8'IGGPMPAS');          /* NAME OF FOLLOWING PROCEDURE   */
         DC CL8'IGGPMPAS'
*   END;                            /* END OF INNER PROCEDURE        */
@EL00008 DS    0H                                                  1262
@EF00008 DS    0H                                                  1262
@ER00008 BR    @14                                                 1262
         EJECT
*                                                                  1263
*/********************************************************************/
*/*                                                                  */
*/*        IGGPMPAS  -  PROCEDURE  EXTERNALLY  CALLED  NESTED        */
*/*                                                                  */
*/********************************************************************/
*                                                                  1263
*IGGPMPAS:                                                         1263
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);/* SPECIFY PROCEDURE OPTIONS     */
IGGPMPAS DS    0H                                                  1264
*   GEN(ENTRY IGGPMPAS );           /* IDENTIFY ENTRY-POINT SYMBOL   */
         ENTRY IGGPMPAS
*Z067:                              /* LABEL FOR PROCEDURE TRACKING  */
*Z067MPAS:                          /* LABEL FOR PROCEDURE TRACKING  */
*   RFY                                                            1265
*    (R5,                                                          1265
*     R6,                                                          1265
*     R7,                                                          1265
*     R8,                                                          1265
*     R9) UNRSTD;                   /* PL/S COMPILER WORK REGISTERS  */
Z067     DS    0H                                                  1265
Z067MPAS DS    0H                                                  1266
*   RFY                                                            1266
*    (R2,                                                          1266
*     R3,                                                          1266
*     R4) RSTD;                     /* RESTRICT LOCAL WORK REGISTERS */
*   GEN(STM 12,14,12(13));          /* SAVE REGISTERS OF CALLER      */
         STM 12,14,12(13)
*   GEN(LA 13,12(13));              /* POINT TO NEXT SAVE AREA       */
         LA 13,12(13)
*   GEN(BALR 12,0);                 /* ESTABLISH ADDRESSABILITY      */
         BALR 12,0
*   GEN(USING *,12);                /* INDICATE AVAILABLE BASE REG   */
         USING *,12
*   GEN(B *+6);                     /* BRANCH AROUND CONSTANT        */
         B *+6
*   GEN(DC AL2(*-@MAINENT-4));      /* OFFSET TO MODULE BASE 1       */
         DC AL2(*-@MAINENT-4)
*   GEN(SH 12,*-2);                 /* COMPUTE MODULE BASE 1         */
         SH 12,*-2
*   GEN(LA 10,4095(0,12));          /* LOAD BASE 2 REG WITH 4095     */
         LA 10,4095(0,12)
*   GEN(USING @MAINENT,12);         /* INDICATE AVAILABLE BASE REG1  */
         USING @MAINENT,12
*   GEN(USING @MAINENT+4095,10);    /* INDICATE AVAILABLE BASE REG2
*                                                            @ZA29164*/
         USING @MAINENT+4095,10
*/********************************************************** @ZA29164*/
*/*                                                          @ZA29164*/
*/* PROCEDURE NAME = IGGPMPAS                                @ZA29164*/
*/*                                                          @ZA29164*/
*/* DESCRIPTIVE NAME = PASWORD MOVE PROCEDURE                @ZA29164*/
*/*                                                          @ZA29164*/
*/* FUNCTION =                                               @ZA29164*/
*/*           THIS PROCEDURE WILL MOVE THE PASSWORD FROM THE @ZA29164*/
*/*           USERS AREA TO THE KEY 0 AREA. THE LOCAL LOCK   @ZA29164*/
*/*           WILL BE OBTAINED BEFORE THE PASSWORD IS MOVED  @ZA29164*/
*/*           USING A MOVE CHARACTER INSTRUCTION. THIS WILL  @ZA29164*/
*/*           PREVENT THE PASSWORD FROM BEING LOADED INTO    @ZA29164*/
*/*           REGISTERS AND POSSIBLY BECOMING AN INTEGRITY   @ZA29164*/
*/*           EXPOSURE. THE LOCK WILL BE RELEASED AFTER THE  @ZA29164*/
*/*           POINTER TO THE PASSWORD IS UPDATED.            @ZA29164*/
*/*                                                          @ZA29164*/
*/* INPUT = INPUT TO THIS PROCEDURE IS A POINTER TO THE      @ZA29164*/
*/*         POINTER OF THE PASSWORD AND THE NUMBER OF BYTES  @ZA29164*/
*/*         TO BE MOVED.                                     @ZA29164*/
*/*                                                          @ZA29164*/
*/* OUTPUT = NORMAL OUTPUT WILL CONSIST OF THE PASSWORD      @ZA29164*/
*/*          MOVED TO KEY 0 CORE AND THE POINTER UPDATED     @ZA29164*/
*/*          TO THE ADDRESS OF THE NEW LOCATION.             @ZA29164*/
*/*                                                          @ZA29164*/
*/********************************************************** @ZA29164*/
*                                                                  1277
*   IF CICRMBYT<CICBKLNG THEN       /* ENOUGH ROOM IN AREA   @ZA29164*/
         L     @14,CICRMBYT(,R4)                                   1277
         C     @14,CICBKLNG(,R4)                                   1277
         BNL   @RF01277                                            1277
*     IF CICCISSP^=ZERO THEN        /* SECONDARY AREA EXIST  @ZA29164*/
         L     @14,CICCISSP(,R4)                                   1278
         LTR   @14,@14                                             1278
         BZ    @RF01278                                            1278
*       IF CICPTRSW=ON THEN         /* WERE PTRS PREVIOUSLY  @ZA29164
*                                      SWITCHED              @ZA29164*/
         TM    CICPTRSW(R4),B'01000000'                            1279
         BNO   @RF01279                                            1279
*         DO;                       /* YES, AND NOW THERE IS @ZA29164
*                                      NO ROOM ON SECONDARY  @ZA29164
*                                      AREA                  @ZA29164*/
*           CICCOUNT=ON;            /* ALERT DRIVER          @ZA29164*/
         OI    CICCOUNT(R4),B'10000000'                            1281
*           CALL EXIT;              /* RETURN                @ZA29164*/
         BAL   @14,EXIT                                            1282
*         END;                      /*                       @ZA29164*/
*       ELSE                        /* PTRS WERE NOT         @ZA29164*/
*         DO;                       /* PREVIOUSLY SWITCHED   @ZA29164*/
         B     @RC01279                                            1284
@RF01279 DS    0H                                                  1285
*           CICNXTBK=CICCISSP;      /* POINT TO SECOND AREA  @ZA29164*/
         L     @14,CICCISSP(,R4)                                   1285
         ST    @14,CICNXTBK(,R4)                                   1285
*           CICRMBYT=CICSABYT;      /* SET AVAILABLE BYTES   @ZA29164*/
         L     @14,CICSABYT(,R4)                                   1286
         ST    @14,CICRMBYT(,R4)                                   1286
*           CICPTRSW=ON;            /* PTRS WERE SWITCHED    @ZA29164*/
         OI    CICPTRSW(R4),B'01000000'                            1287
*         END;                      /*                       @ZA29164*/
*     ELSE                          /* SECONDARY AREA DOES   @ZA29164*/
*       DO;                         /* NOT EXIST             @ZA29164*/
         B     @RC01278                                            1289
@RF01278 DS    0H                                                  1290
*         CICCOUNT=ON;              /* SET COUNT MODE        @ZA29164*/
         OI    CICCOUNT(R4),B'10000000'                            1290
*         CICGMCNT=CICGMCNT+CICBKLNG;/* ACCUMULATE LENGTH    @ZA29164
*                                      FOR LATER GETMAIN     @ZA29164*/
         L     @14,CICGMCNT(,R4)                                   1291
         AL    @14,CICBKLNG(,R4)                                   1291
         ST    @14,CICGMCNT(,R4)                                   1291
*         CALL EXIT;                /* RETURN TO DRIVER      @ZA29164*/
         BAL   @14,EXIT                                            1292
*       END;                        /*                       @ZA29164*/
*   ELSE                                                           1294
*     ;                             /* ENOUGH ROOM FOR MOVE  @ZA29164*/
*                                                                  1294
@RF01277 DS    0H                                                  1295
*   /*****************************************************************/
*   /*                                                               */
*   /* INITIALIZE REGISTERS FOR MOVE                         @ZA29164*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1295
*   RFY                                                            1295
*    (R6,                                                          1295
*     R7,                                                          1295
*     R8,                                                          1295
*     R9) RSTD;                     /* RESTRICT MOVE REGS    @ZA29164*/
@RC01277 DS    0H                                                  1296
*   R8=BLOCKPTR;                    /* GET POINTER TO BLOCK  @ZA29164*/
         L     @14,CICBKPTR(,R4)                                   1296
         L     R8,BLOCKPTR(,@14)                                   1296
*   R9=CICBKLNG;                    /* GET BLOCK LENGTH      @ZA29164*/
         L     R9,CICBKLNG(,R4)                                    1297
*   R7=R9;                          /* GET BLOCK LENGTH      @ZA29164*/
         LR    R7,R9                                               1298
*   R6=CICNXTBK;                    /* POINT TO OUTPUT AREA  @ZA29164*/
         L     R6,CICNXTBK(,R4)                                    1299
*   R2=R13;                         /* SAVE R13              @ZA29164*/
*                                                                  1300
         LR    R2,R13                                              1300
*   /*****************************************************************/
*   /*                                                               */
*   /* GET LOCAL LOCK                                        @ZA29164*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1301
*   GEN(STM 11,14,12(13));          /* SAVE REGS 11 TO 14    @ZA29164*/
         STM 11,14,12(13)
*   GEN;                                                           1302
*                                   /*                       @ZA29164*/
         SETLOCK OBTAIN,TYPE=LOCAL,MODE=UNCOND,                        X
               RELATED=('GET LOCAL LOCK BEFORE MOVE')
*   MVCL(R6,R8);                    /* MOVE DATA             @ZA29164*/
*                                                                  1303
         MVCL  R6,R8                                               1303
*   /*****************************************************************/
*   /*                                                               */
*   /* RELEASE LOCAL LOCK                                    @ZA29164*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1304
*   GEN;                                                           1304
*                                   /*                       @ZA29164*/
         SETLOCK RELEASE,TYPE=LOCAL,                                   X
               RELATED=('RELEASE LOCK AFTER MOVE')
*   GEN(LM 11,14,12(2));            /* RESTORE REGS 11 TO 14 @ZA29164*/
*                                                                  1305
         LM 11,14,12(2)
*   /*****************************************************************/
*   /*                                                               */
*   /* CHECK IF MOVE LENGTH IS A WORD MULTIPLE               @ZA29164*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1306
*   R9=CICBKLNG;                    /* GET BLOCK LENGTH      @ZA29164*/
         L     R9,CICBKLNG(,R4)                                    1306
*   R7=R9;                          /* GET BLOCK LENGTH      @ZA29164*/
         LR    R7,R9                                               1307
*   R7=R7&ACWD;                     /* GET LAST TWO BITS     @ZA29164*/
         ICM   @14,15,ACWD                                         1308
         NR    R7,@14                                              1308
*   IF R7^=ZERO THEN                /* MOVE LENGTH EVEN      @ZA29164*/
         LTR   R7,R7                                               1309
         BZ    @RF01309                                            1309
*     DO;                           /* NO                    @ZA29164*/
*       R9=R9+FOUR;                 /* INCR LENGTH BY FOUR   @ZA29164*/
         AL    R9,@CF00059                                         1311
*       R9=R9-R7;                   /* REMOVE EXCESS BYTES   @ZA29164*/
         SLR   R9,R7                                               1312
*     END;                          /*                       @ZA29164*/
*   ELSE                                                           1314
*     ;                             /* MOVE LENGTH WAS EVEN  @ZA29164*/
*                                                                  1314
@RF01309 DS    0H                                                  1315
*   /*****************************************************************/
*   /*                                                               */
*   /* UPDATE POINTERS AND OUTPUT AREA LENGTH                @ZA29164*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1315
*   BLOCKPTR=CICNXTBK;              /* RESET BLOCK POINTER   @ZA29164*/
         L     @14,CICBKPTR(,R4)                                   1315
         L     @05,CICNXTBK(,R4)                                   1315
         ST    @05,BLOCKPTR(,@14)                                  1315
*   CICNXTBK=CICNXTBK+R9;           /* NEW OUTPUT AREA       @ZA29164*/
         ALR   @05,R9                                              1316
         ST    @05,CICNXTBK(,R4)                                   1316
*   CICRMBYT=CICRMBYT-R9;           /* DECR AVAILABLE BYTES  @ZA29164*/
         L     @14,CICRMBYT(,R4)                                   1317
         SLR   @14,R9                                              1317
         ST    @14,CICRMBYT(,R4)                                   1317
*   RFY                                                            1318
*    (R6,                                                          1318
*     R7,                                                          1318
*     R8,                                                          1318
*     R9) UNRSTD;                   /* RELEASE MOVE REGS     @ZA29164*/
*   CALL EXIT;                      /* RETURN TO CALLER              */
         BAL   @14,EXIT                                            1319
*   GEN(DS 0F);                     /* FULLWORD BOUNDARY ALIGNMENT   */
         DS 0F
*   GEN(DC CL8'IGGPRTND');          /* NAME OF FOLLOWING PROCEDURE   */
         DC CL8'IGGPRTND'
*   END;                            /* END OF INNER PROCEDURE        */
@EL00009 DS    0H                                                  1322
@EF00009 DS    0H                                                  1322
@ER00009 BR    @14                                                 1322
         EJECT
*                                                                  1323
*/********************************************************************/
*/*                                                                  */
*/*        IGGPRTND  -  PROCEDURE  INTERNALLY  CALLED  NESTED        */
*/*                                                                  */
*/********************************************************************/
*                                                                  1323
*IGGPRTND:                                                         1323
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);/* SPECIFY PROCEDURE OPTIONS     */
IGGPRTND DS    0H                                                  1324
*Z068:                              /* LABEL FOR PROCEDURE TRACKING  */
*Z068RTND:                          /* LABEL FOR PROCEDURE TRACKING  */
*   RFY                                                            1324
*    (R5,                                                          1324
*     R6,                                                          1324
*     R7,                                                          1324
*     R8,                                                          1324
*     R9) UNRSTD;                   /* PL/S COMPILER WORK REGISTERS  */
Z068     DS    0H                                                  1324
Z068RTND DS    0H                                                  1325
*   RFY                                                            1325
*    (R2,                                                          1325
*     R3,                                                          1325
*     R4) RSTD;                     /* RESTRICT LOCAL WORK REGISTERS */
*   GEN(STM 12,14,12(13));          /* SAVE REGISTERS OF CALLER      */
         STM 12,14,12(13)
*   GEN(LA 13,12(13));              /* POINT TO NEXT SAVE AREA     1327
*                                                            @ZA29164*/
*                                                                  1327
         LA 13,12(13)
*   /*****************************************************************/
*   /*                                                               */
*   /* ******************************************************        */
*   /*                                                       @ZA29164*/
*   /*                                                       @ZA29164*/
*   /* PROCEDURE NAME = IGGPRTND                             @ZA29164*/
*   /*                                                       @ZA29164*/
*   /* DESCRIPTIVE NAME = RETURN USER DATA DRIVER            @ZA29164*/
*   /*                                                       @ZA29164*/
*   /* FUNCTION =                                            @ZA29164*/
*   /* THIS PROCEDURE IS THE DRIVER THAT MOVES               @ZA29164*/
*   /* THE RETURN CODES AND UPDATED AREAS BACK               @ZA29164*/
*   /* TO THE USERS AREA.                                    @ZA29164*/
*   /*                                                       @ZA29164*/
*   /* INPUT = INPUT TO THIS PROCEDURE IS A POINTER TO THE   @ZA29164*/
*   /* USERS CPL AND THE USERS KEY.                          @ZA29164*/
*   /*                                                       @ZA29164*/
*   /* OUTPUT = OUTPUT IS AN UPDATED CONTROL BLOCK STRUCTURE @ZA29164*/
*   /* IN THE USERS AREA.                                    @ZA29164*/
*   /*                                                       @ZA29164*/
*   /* ******************************************************        */
*   /*                                                       @ZA29164*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1328
*   OLDCPL=CCAOCPL;                 /* GET USERS CPL POINTER @ZA29164*/
         L     OLDCPL,CCAOCPL(,R11)                                1328
*   IF OLDCPL->CTGWKA^=ZEROP THEN   /* CPL WORK AREA EXIST   @ZA29164*/
         L     @14,CTGWKA(,OLDCPL)                                 1329
         LTR   @14,@14                                             1329
         BZ    @RF01329                                            1329
*     DO;                           /* YES                   @ZA29164*/
*       CICRAREA=OLDCPL->CTGWKA;    /* SET OUTPUT POINTER TO @ZA29164
*                                      USER WORK AREA        @ZA29164*/
         ST    @14,CICRAREA(,R4)                                   1331
*       CICBKPTR=CTGWKA;            /* SET INPUT POINTER TO  @ZA29164
*                                      KEY 0 CPL WORK AREA   @ZA29164*/
         L     @14,CCACPL(,R11)                                    1332
         L     @14,CTGWKA(,@14)                                    1332
         ST    @14,CICBKPTR(,R4)                                   1332
*       CICBKLNG=CTGWKA->WKALEN1;   /* SET LENGTH            @ZA29164*/
         LH    @14,WKALEN1(,@14)                                   1333
         ST    @14,CICBKLNG(,R4)                                   1333
*Z069MDTW:                                                         1334
*       DO;                                                        1334
Z069MDTW DS    0H                                                  1335
*         CALL IGGPMDTW;                                           1335
         BAL   @14,IGGPMDTW                                        1335
*         GEN(RLDSBREG IGGPMDTW);   /* RELOAD SECONDARY BASE REG     */
         RLDSBREG IGGPMDTW
*       END;                        /* MOVE DATA             @ZA29164*/
*     END;                          /*                       @ZA29164*/
*   ELSE                                                           1339
*     ;                             /* NO CPL WORK AREA      @ZA29164*/
@RF01329 DS    0H                                                  1340
*   RFY                                                            1340
*    (R5,                                                          1340
*     R6) RSTD;                     /* RESTRICT PTR REGS     @ZA29164*/
*                                                                  1340
*   /*****************************************************************/
*   /*                                                               */
*   /* MOVE THE CPL RETURN CODE                              @ZA29164*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1341
*   CPLRETCD=CTGPROB;               /* GET KEY 0 RETURN CODE @ZA29164*/
         L     @14,CCACPL(,R11)                                    1341
         L     CPLRETCD,CTGPROB(,@14)                              1341
*   SPKA(CCAUSKEY);                 /* SWITCH TO USER KEY    @ZA29164*/
         SLR   @14,@14                                             1342
         IC    @14,CCAUSKEY(,R11)                                  1342
         SPKA  0(@14)                                              1342
*   OLDCPL->CTGPROB=CPLRETCD;       /* PUT RETURN CODE IN    @ZA29164
*                                      USERS CPL             @ZA29164*/
         ST    CPLRETCD,CTGPROB(,OLDCPL)                           1343
*   GEN(SPKA 0);                    /* SWITCH BACK TO KEY 0  @ZA29164*/
*                                                                  1344
         SPKA 0
*   /*****************************************************************/
*   /*                                                               */
*   /* MOVE CLUSTER FVT DATA IF THEY EXIST                   @ZA29164*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1345
*   IF CTGOPTNS=CTGDEFIN×CTGOPTNS=CTGALTER THEN/* DEFINE OR  @ZA29164
*                                      ALTER                 @ZA29164*/
         L     @14,CCACPL(,R11)                                    1345
         TM    CTGOPTNS(@14),B'00001000'                           1345
         BNO   @GL00036                                            1345
         TM    CTGOPTNS(@14),B'11110000'                           1345
         BZ    @RT01345                                            1345
@GL00036 L     @14,CCACPL(,R11)                                    1345
         TM    CTGOPTNS(@14),B'00010000'                           1345
         BNO   @RF01345                                            1345
         TM    CTGOPTNS(@14),B'11101000'                           1345
         BNZ   @RF01345                                            1345
@RT01345 DS    0H                                                  1346
*     DO;                           /* YES                   @ZA29164*/
*       NFVTPTR=CTGFVT;             /* GET BASE FVT POINTER  @ZA29164*/
         L     @14,CCACPL(,R11)                                    1347
         L     NFVTPTR,CTGFVT(,@14)                                1347
*       OFVTPTR=OLDCPL->CTGFVT;     /* GET USER BASE FVT PTR @ZA29164*/
         L     OFVTPTR,CTGFVT(,OLDCPL)                             1348
*       IF NFVTPTR->CTGFVWKA^=ZEROP THEN/* FVT WORK AREA     @ZA29164
*                                      EXIST                 @ZA29164*/
         L     @14,CTGFVWKA(,NFVTPTR)                              1349
         LTR   @14,@14                                             1349
         BZ    @RF01349                                            1349
*         DO;                       /* YES                   @ZA29164*/
*           CICRAREA=OFVTPTR->CTGFVWKA;/* POINT TO USER      @ZA29164
*                                      WORK AREA             @ZA29164*/
         L     @07,CTGFVWKA(,OFVTPTR)                              1351
         ST    @07,CICRAREA(,R4)                                   1351
*           CICBKLNG=OFVTPTR->CTGFVWKA->WKALEN1;/* GET LNGTH @ZA29164*/
         LH    @07,WKALEN1(,@07)                                   1352
         ST    @07,CICBKLNG(,R4)                                   1352
*           CICBKPTR=NFVTPTR->CTGFVWKA;/* POINT TO KEY 0     @ZA29164
*                                      FVT WORK AREA         @ZA29164*/
         ST    @14,CICBKPTR(,R4)                                   1353
*Z070MDTW:                                                         1354
*           DO;                                                    1354
Z070MDTW DS    0H                                                  1355
*             CALL IGGPMDTW;                                       1355
         BAL   @14,IGGPMDTW                                        1355
*             GEN(RLDSBREG IGGPMDTW);/* RELOAD SECONDARY BASE REG    */
         RLDSBREG IGGPMDTW
*           END;                    /* MOVE THE DATA         @ZA29164*/
*         END;                      /*                       @ZA29164*/
*       ELSE                                                       1359
*         ;                         /* NO BASE FVT WORK AREA @ZA29164*/
@RF01349 DS    0H                                                  1360
*       IF NFVTPTR->CTGFVVLT^=ZEROP THEN/* VOLUME LIST EXIST @ZA29164*/
         L     @14,CTGFVVLT(,NFVTPTR)                              1360
         LTR   @14,@14                                             1360
         BZ    @RF01360                                            1360
*         DO;                       /* YES                   @ZA29164*/
*           CICBKLNG=OFVTPTR->CTGFVVLT->LTLENGTH+LENGTH(LTLENGTH);/*
*                                      VOLUME LIST LENGTH    @ZA29164*/
         L     @07,CTGFVVLT(,OFVTPTR)                              1362
         LA    @00,2                                               1362
         AH    @00,LTLENGTH(,@07)                                  1362
         ST    @00,CICBKLNG(,R4)                                   1362
*           CICRAREA=OFVTPTR->CTGFVVLT;/* USER AREA          @ZA29164*/
         ST    @07,CICRAREA(,R4)                                   1363
*           CICBKPTR=NFVTPTR->CTGFVVLT;/* KEY 0 AREA         @ZA29164*/
         ST    @14,CICBKPTR(,R4)                                   1364
*Z071MDTW:                                                         1365
*           DO;                                                    1365
Z071MDTW DS    0H                                                  1366
*             CALL IGGPMDTW;                                       1366
         BAL   @14,IGGPMDTW                                        1366
*             GEN(RLDSBREG IGGPMDTW);/* RELOAD SECONDARY BASE REG    */
         RLDSBREG IGGPMDTW
*           END;                    /* MOVE DATA             @ZA29164*/
*         END;                      /*                       @ZA29164*/
*       ELSE                                                       1370
*         ;                         /*                       @ZA29164*/
*                                                                  1370
@RF01360 DS    0H                                                  1371
*       /*************************************************************/
*       /*                                                           */
*       /* MOVE DATA FVT DATA IF IT EXISTS                   @ZA29164*/
*       /*                                                           */
*       /*************************************************************/
*                                                                  1371
*       IF NFVTPTR->CTGFVDCH^=ZEROP THEN/* DATA FVT EXIST    @ZA29164*/
         SLR   @14,@14                                             1371
         L     @07,CTGFVDCH(,NFVTPTR)                              1371
         CR    @07,@14                                             1371
         BE    @RF01371                                            1371
*         DO;                       /* YES                   @ZA29164*/
*           IF NFVTPTR->CTGFVDCH->CTGFVVLT^=ZEROP THEN/* VOLUME LIST
*                                      EXIST                 @ZA29164*/
         L     @07,CTGFVVLT(,@07)                                  1373
         CR    @07,@14                                             1373
         BE    @RF01373                                            1373
*             DO;                   /* YES                   @ZA29164*/
*               CICBKLNG=OFVTPTR->CTGFVDCH->CTGFVVLT->/*     @ZA29164*/
*                   LTLENGTH+LENGTH(LTLENGTH);/* VOL LST LENGTH    1375
*                                                            @ZA29164*/
         L     @14,CTGFVDCH(,OFVTPTR)                              1375
         L     @14,CTGFVVLT(,@14)                                  1375
         LA    @00,2                                               1375
         AH    @00,LTLENGTH(,@14)                                  1375
         ST    @00,CICBKLNG(,R4)                                   1375
*               CICRAREA=OFVTPTR->CTGFVDCH->CTGFVVLT;/* USER AREA  1376
*                                                            @ZA29164*/
         ST    @14,CICRAREA(,R4)                                   1376
*               CICBKPTR=NFVTPTR->CTGFVDCH->CTGFVVLT;/* KEY 0 AREA 1377
*                                                            @ZA29164*/
         ST    @07,CICBKPTR(,R4)                                   1377
*Z072MDTW:                                                         1378
*               DO;                                                1378
Z072MDTW DS    0H                                                  1379
*                 CALL IGGPMDTW;                                   1379
         BAL   @14,IGGPMDTW                                        1379
*                 GEN(RLDSBREG IGGPMDTW);/* RELOAD SECONDARY BASE REG*/
         RLDSBREG IGGPMDTW
*               END;                /* MOVE DATA             @ZA29164*/
*             END;                  /*                       @ZA29164*/
*           ELSE                                                   1383
*             ;                     /*                       @ZA29164*/
@RF01373 DS    0H                                                  1384
*           IF NFVTPTR->CTGFVDCH->CTGFVWKA^=ZEROP THEN/* DATA FVT  1384
*                                      WORK AREA EXIST       @ZA29164*/
         L     @14,CTGFVDCH(,NFVTPTR)                              1384
         L     @14,CTGFVWKA(,@14)                                  1384
         LTR   @14,@14                                             1384
         BZ    @RF01384                                            1384
*             DO;                   /* YES                   @ZA29164*/
*               CICRAREA=OFVTPTR->CTGFVDCH->CTGFVWKA;/* POINT TO DATA
*                                      FVT WORK AREA         @ZA29164*/
         L     @07,CTGFVDCH(,OFVTPTR)                              1386
         L     @07,CTGFVWKA(,@07)                                  1386
         ST    @07,CICRAREA(,R4)                                   1386
*               CICBKLNG=OFVTPTR->CTGFVDCH->CTGFVWKA->/*     @ZA29164*/
*                   WKALEN1;        /* GET LENGTH            @ZA29164*/
         LH    @07,WKALEN1(,@07)                                   1387
         ST    @07,CICBKLNG(,R4)                                   1387
*               CICBKPTR=NFVTPTR->CTGFVDCH->CTGFVWKA;/* GET NEW WORK
*                                      AREA PTR              @ZA29164*/
         ST    @14,CICBKPTR(,R4)                                   1388
*Z073MDTW:                                                         1389
*               DO;                                                1389
Z073MDTW DS    0H                                                  1390
*                 CALL IGGPMDTW;                                   1390
         BAL   @14,IGGPMDTW                                        1390
*                 GEN(RLDSBREG IGGPMDTW);/* RELOAD SECONDARY BASE REG*/
         RLDSBREG IGGPMDTW
*               END;                /* MOVE DATA             @ZA29164*/
*             END;                  /*                       @ZA29164*/
*           ELSE                                                   1394
*             ;                     /* NO WORK AREA          @ZA29164*/
@RF01384 DS    0H                                                  1395
*         END;                      /*                       @ZA29164*/
*       ELSE                                                       1396
*         ;                         /*                       @ZA29164*/
*                                                                  1396
@RF01371 DS    0H                                                  1397
*       /*************************************************************/
*       /*                                                           */
*       /* MOVE INDEX FVT DATA IF IT EXISTS                  @ZA29164*/
*       /*                                                           */
*       /*************************************************************/
*                                                                  1397
*       IF NFVTPTR->CTGFVICH^=ZEROP THEN/* INDEX FVT EXIST   @ZA29164*/
         SLR   @14,@14                                             1397
         L     @07,CTGFVICH(,NFVTPTR)                              1397
         CR    @07,@14                                             1397
         BE    @RF01397                                            1397
*         DO;                       /* YES                   @ZA29164*/
*           IF NFVTPTR->CTGFVICH->CTGFVVLT^=ZEROP THEN/* VOLUME LIST
*                                      EXIST                 @ZA29164*/
         L     @07,CTGFVVLT(,@07)                                  1399
         CR    @07,@14                                             1399
         BE    @RF01399                                            1399
*             DO;                   /* YES                   @ZA29164*/
*               CICBKLNG=OFVTPTR->CTGFVICH->CTGFVVLT->/*     @ZA29164*/
*                   LTLENGTH+LENGTH(LTLENGTH);/* VOL LIST LENGTH   1401
*                                                            @ZA29164*/
         L     @14,CTGFVICH(,OFVTPTR)                              1401
         L     @14,CTGFVVLT(,@14)                                  1401
         LA    @00,2                                               1401
         AH    @00,LTLENGTH(,@14)                                  1401
         ST    @00,CICBKLNG(,R4)                                   1401
*               CICRAREA=OFVTPTR->CTGFVICH->CTGFVVLT;/* USER AREA  1402
*                                                            @ZA29164*/
         ST    @14,CICRAREA(,R4)                                   1402
*               CICBKPTR=NFVTPTR->CTGFVICH->CTGFVVLT;/* KEY 0 AREA 1403
*                                                            @ZA29164*/
         ST    @07,CICBKPTR(,R4)                                   1403
*Z074MDTW:                                                         1404
*               DO;                                                1404
Z074MDTW DS    0H                                                  1405
*                 CALL IGGPMDTW;                                   1405
         BAL   @14,IGGPMDTW                                        1405
*                 GEN(RLDSBREG IGGPMDTW);/* RELOAD SECONDARY BASE REG*/
         RLDSBREG IGGPMDTW
*               END;                /* MOVE DATA             @ZA29164*/
*             END;                  /*                       @ZA29164*/
*           ELSE                                                   1409
*             ;                     /*                       @ZA29164*/
@RF01399 DS    0H                                                  1410
*           IF NFVTPTR->CTGFVICH->CTGFVWKA^=ZEROP THEN/* INDEX WORK
*                                      AREA EXIST            @ZA29164*/
         L     @14,CTGFVICH(,NFVTPTR)                              1410
         L     @14,CTGFVWKA(,@14)                                  1410
         LTR   @14,@14                                             1410
         BZ    @RF01410                                            1410
*             DO;                   /* YES                   @ZA29164*/
*               CICRAREA=OFVTPTR->CTGFVICH->CTGFVWKA;/* POINT TO DATA
*                                      FVT WORK AREA         @ZA29164*/
         L     @07,CTGFVICH(,OFVTPTR)                              1412
         L     @07,CTGFVWKA(,@07)                                  1412
         ST    @07,CICRAREA(,R4)                                   1412
*               CICBKLNG=OFVTPTR->CTGFVICH->CTGFVWKA->/*     @ZA29164*/
*                   WKALEN1;        /* GET LENGTH            @ZA29164*/
         LH    @07,WKALEN1(,@07)                                   1413
         ST    @07,CICBKLNG(,R4)                                   1413
*               CICBKPTR=NFVTPTR->CTGFVICH->CTGFVWKA;/* POINT TO KEY
*                                      0 WORK AREA           @ZA29164*/
         ST    @14,CICBKPTR(,R4)                                   1414
*Z075MDTW:                                                         1415
*               DO;                                                1415
Z075MDTW DS    0H                                                  1416
*                 CALL IGGPMDTW;                                   1416
         BAL   @14,IGGPMDTW                                        1416
*                 GEN(RLDSBREG IGGPMDTW);/* RELOAD SECONDARY BASE REG*/
         RLDSBREG IGGPMDTW
*               END;                /* MOVE DATA             @ZA29164*/
*             END;                  /*                       @ZA29164*/
*           ELSE                                                   1420
*             ;                     /* NO WORK AREA          @ZA29164*/
@RF01410 DS    0H                                                  1421
*         END;                      /*                       @ZA29164*/
*       ELSE                                                       1422
*         ;                         /* NO INDEX FVT          @ZA29164*/
*                                                                  1422
@RF01397 DS    0H                                                  1423
*       /*************************************************************/
*       /*                                                           */
*       /* MOVE SPACE FVT WORK AREA IF IT EXISTS             @ZA29164*/
*       /*                                                           */
*       /*************************************************************/
*                                                                  1423
*       IF NFVTPTR->CTGFVVCH^=ZEROP THEN/* SPACE FVT EXIST   @ZA29164*/
         SLR   @14,@14                                             1423
         L     @07,CTGFVVCH(,NFVTPTR)                              1423
         CR    @07,@14                                             1423
         BE    @RF01423                                            1423
*         IF OFVTPTR->CTGFVVCH->CTGFVVLT^=ZEROP THEN/* VOLUME LIST 1424
*                                      EXIST                 @ZA29164*/
         L     @09,CTGFVVCH(,OFVTPTR)                              1424
         L     @09,CTGFVVLT(,@09)                                  1424
         CR    @09,@14                                             1424
         BE    @RF01424                                            1424
*           DO;                     /* YES                   @ZA29164*/
*             CICBKLNG=OFVTPTR->CTGFVVCH->CTGFVVLT->LTLENGTH+LENGTH(
*                 LTLENGTH);        /* VOL LIST LENGTH       @ZA29164*/
         LA    @14,2                                               1426
         AH    @14,LTLENGTH(,@09)                                  1426
         ST    @14,CICBKLNG(,R4)                                   1426
*             CICRAREA=OFVTPTR->CTGFVVCH->CTGFVVLT;/* USER AREA    1427
*                                                            @ZA29164*/
         ST    @09,CICRAREA(,R4)                                   1427
*             CICBKPTR=NFVTPTR->CTGFVVCH->CTGFVVLT;/* KEY 0 AREA   1428
*                                                            @ZA29164*/
         L     @14,CTGFVVLT(,@07)                                  1428
         ST    @14,CICBKPTR(,R4)                                   1428
*Z076MDTW:                                                         1429
*             DO;                                                  1429
Z076MDTW DS    0H                                                  1430
*               CALL IGGPMDTW;                                     1430
         BAL   @14,IGGPMDTW                                        1430
*               GEN(RLDSBREG IGGPMDTW);/* RELOAD SECONDARY BASE REG  */
         RLDSBREG IGGPMDTW
*             END;                  /* MOVE DATA             @ZA29164*/
*           END;                    /*                       @ZA29164*/
*         ELSE                                                     1434
*           ;                       /*                       @ZA29164*/
@RF01424 DS    0H                                                  1435
*       ELSE                                                       1435
*         ;                         /* NO SPACE FVT          @ZA29164*/
@RF01423 DS    0H                                                  1436
*     END;                          /*                       @ZA29164*/
*   ELSE                                                           1437
*     ;                             /* NO DEFINE OR ALTER    @ZA29164*/
@RF01345 DS    0H                                                  1438
*   RFY                                                            1438
*    (R5,                                                          1438
*     R6) UNRSTD;                   /* RELEASE POINTER REGS  @ZA29164*/
*                                                                  1438
*   /*****************************************************************/
*   /*                                                               */
*   /* IF LIST CATALOG GET NEXT THEN RETURN ENTRYNAME        @ZA29164*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1439
*   IF CTGFUNC=CTGCMS&CTGOPTNS=CTGLTCAT&CTGGTNXT=ON&/*       @ZA29164*/
*       CTGENT^=ZEROP THEN          /* CMS,LISTCAT,GET NEXT  @ZA29164
*                                      AND ENTRYNAME EXIST   @ZA29164*/
         L     @14,CCACPL(,R11)                                    1439
         TM    CTGFUNC(@14),B'10000000'                            1439
         BNO   @RF01439                                            1439
         TM    CTGFUNC(@14),B'01100000'                            1439
         BNZ   @RF01439                                            1439
         TM    CTGOPTNS(@14),B'00100000'                           1439
         BNO   @RF01439                                            1439
         TM    CTGOPTNS(@14),B'11011000'                           1439
         BNZ   @RF01439                                            1439
         TM    CTGGTNXT(@14),B'00010000'                           1439
         BNO   @RF01439                                            1439
         L     @14,CTGENT(,@14)                                    1439
         LTR   @14,@14                                             1439
         BZ    @RF01439                                            1439
*     DO;                           /* YES                   @ZA29164*/
*       CICRAREA=OLDCPL->CTGENT;    /* POINT TO USER ENTNAME @ZA29164*/
         L     @05,CTGENT(,OLDCPL)                                 1441
         ST    @05,CICRAREA(,R4)                                   1441
*       CICBKPTR=CTGENT;            /* POINT TO KEY 0 NAME   @ZA29164*/
         ST    @14,CICBKPTR(,R4)                                   1442
*Z077MB44:                                                         1443
*       DO;                                                        1443
Z077MB44 DS    0H                                                  1444
*         CALL IGGPMB44;                                           1444
         BAL   @14,IGGPMB44                                        1444
*         GEN(RLDSBREG IGGPMB44);   /* RELOAD SECONDARY BASE REG     */
         RLDSBREG IGGPMB44
*       END;                        /* MOVE DATA             @ZA29164*/
*     END;                          /*                       @ZA29164*/
*   ELSE                                                           1448
*     ;                             /* NO NAME               @ZA29164*/
*                                                                  1448
@RF01439 DS    0H                                                  1449
*   /*****************************************************************/
*   /*                                                               */
*   /* PROCESS FPL'S IF THEY EXIST                           @ZA29164*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1449
*   RFY                                                            1449
*    (R7,                                                          1449
*     R8,                                                          1449
*     R9) RSTD;                     /*                       @ZA29164*/
*   DO K=1 TO CTGNOFLD BY 1;        /* PROCESS FPLS LOOP     @ZA29164*/
*                                                                  1450
         LA    K,1                                                 1450
         B     @DE01450                                            1450
@DL01450 DS    0H                                                  1451
*     /***************************************************************/
*     /*                                                             */
*     /* PROCESS PAIRS OF DATA LENGTH/ADDRESSES              @ZA29164*/
*     /*                                                             */
*     /***************************************************************/
*                                                                  1451
*     DO J=1 TO CTGFIELD(K)->CTGFLDNO BY 1;/* LOOP TO PROCESS      1451
*                                                            @ZA29164*/
*                                                                  1451
         LA    J,1                                                 1451
         B     @DE01451                                            1451
@DL01451 DS    0H                                                  1452
*       /*************************************************************/
*       /*                                                           */
*       /* DETERMINE IF THE KEY 0 FPL DATA PTR IS POINTING   @ZA29164*/
*       /* INTO THE KEY 0 CPL WORK AREA. IF SO THEN UPDATE   @ZA29164*/
*       /* THE LENGTH AND ADDRESS IN THE USERS FPL TO POINT  @ZA29164*/
*       /* TO THE RETURNED DATA IN THE USERS CPL WORK AREA.  @ZA29164*/
*       /*                                                           */
*       /*************************************************************/
*                                                                  1452
*       IF(CTGWKA<CTGFIELD(K)->CTGFLPT(J))&(CTGWKA->WKALEN1+CTGWKA>
*           CTGFIELD(K)->CTGFLPT(J)) THEN/* PTRS WITHIN WORKAREA   1452
*                                                            @ZA29164*/
         L     @14,CCACPL(,R11)                                    1452
         L     @06,CTGWKA(,@14)                                    1452
         LR    @05,J                                               1452
         SLA   @05,3                                               1452
         LR    @00,K                                               1452
         SLA   @00,2                                               1452
         ST    @05,@TF00001                                        1452
         LR    @05,@00                                             1452
         L     @14,CTGFIELD-4(@05,@14)                             1452
         L     @05,@TF00001                                        1452
         L     @05,CTGFLPT-8(@05,@14)                              1452
         CR    @06,@05                                             1452
         BNL   @RF01452                                            1452
         ST    @14,@TF00002                                        1452
         LH    @14,WKALEN1(,@06)                                   1452
         ALR   @14,@06                                             1452
         CR    @14,@05                                             1452
         BNH   @RF01452                                            1452
*         DO;                       /* YES                   @ZA29164*/
*           DATALNG=CTGFIELD(K)->CTGFLNG(J);/* FPL DATA LENGTH     1454
*                                                            @ZA29164*/
         L     @14,@TF00002                                        1454
         L     @06,@TF00001                                        1454
         L     DATALNG,CTGFLNG-8(@06,@14)                          1454
*           SPKA(CCAUSKEY);         /* SWITCH TO USER KEY 0  @ZA29164*/
         SLR   @14,@14                                             1455
         IC    @14,CCAUSKEY(,R11)                                  1455
         SPKA  0(@14)                                              1455
*           OLDCPL->CTGFIELD(K)->CTGFLNG(J)=DATALNG;/* STORE LENGTH
*                                      IN                    @ZA29164
*                                      USER FPL              @ZA29164*/
         LR    @14,@00                                             1456
         L     @14,CTGFIELD-4(@14,OLDCPL)                          1456
         L     @06,@TF00001                                        1456
         ST    DATALNG,CTGFLNG-8(@06,@14)                          1456
*           GEN(SPKA 0);            /* SWITCH BACK TO KEY 0  @ZA29164*/
         SPKA 0
*           IF CTGFIELD(K)->CTGFLPT(J)^=ZEROP THEN/* DATA PTR EXIST
*                                                            @ZA29164*/
         LR    @14,J                                               1458
         SLA   @14,3                                               1458
         LR    @06,K                                               1458
         SLA   @06,2                                               1458
         L     @05,CCACPL(,R11)                                    1458
         L     @05,CTGFIELD-4(@06,@05)                             1458
         L     @05,CTGFLPT-8(@14,@05)                              1458
         LTR   @05,@05                                             1458
         BZ    @RF01458                                            1458
*             DO;                   /* YES                   @ZA29164*/
*               OFFSET=CTGFIELD(K)->CTGFLPT(J)-CTGWKA;/*     @ZA29164
*                                      GET FPL DATA POINTER  @ZA29164
*                                      OFFSET INTO THE CPL   @ZA29164
*                                      WORK AREA             @ZA29164*/
         L     @00,CCACPL(,R11)                                    1460
         ST    @14,@TF00001                                        1460
         LR    @14,@00                                             1460
         SL    @05,CTGWKA(,@14)                                    1460
         LR    OFFSET,@05                                          1460
*               SPKA(CCAUSKEY);     /* SWITCH TO USER KEY    @ZA29164*/
         SLR   @14,@14                                             1461
         IC    @14,CCAUSKEY(,R11)                                  1461
         SPKA  0(@14)                                              1461
*               OLDCPL->CTGFIELD(K)->CTGFLPT(J)=OLDCPL->CTGWKA+OFFSET;
         L     @14,CTGFIELD-4(@06,OLDCPL)                          1462
         LR    @06,OFFSET                                          1462
         AL    @06,CTGWKA(,OLDCPL)                                 1462
         L     @05,@TF00001                                        1462
         ST    @06,CTGFLPT-8(@05,@14)                              1462
*                                   /*                       @ZA29164
*                                      CALCULATE USER FPL    @ZA29164
*                                      DATA POINTER          @ZA29164*/
*               GEN(SPKA 0);        /* SWITCH BACK TO KEY 0  @ZA29164*/
         SPKA 0
*             END;                  /*                       @ZA29164*/
*           ELSE                                                   1465
*             ;                     /* NO FPL DATA POINTER   @ZA29164*/
@RF01458 DS    0H                                                  1466
*         END;                      /*                       @ZA29164*/
*       ELSE                                                       1467
*         ;                         /* DO NOT CHANGE PTR/LNG @ZA29164*/
@RF01452 DS    0H                                                  1468
*     END;                          /*                       @ZA29164*/
*                                                                  1468
         AL    J,@CF00038                                          1468
@DE01451 LR    @14,K                                               1468
         SLA   @14,2                                               1468
         L     @06,CCACPL(,R11)                                    1468
         L     @14,CTGFIELD-4(@14,@06)                             1468
         SLR   @06,@06                                             1468
         IC    @06,CTGFLDNO(,@14)                                  1468
         CR    J,@06                                               1468
         BNH   @DL01451                                            1468
*     /***************************************************************/
*     /*                                                             */
*     /* PROCESS TEST FPLS IF THEY EXIST                     @ZA29164*/
*     /*                                                             */
*     /***************************************************************/
*                                                                  1469
*     IF CTGFIELD(K)->CTGFLCHN^=ZEROP THEN/* TEST FPL EXIST  @ZA29164*/
         LR    @14,K                                               1469
         SLA   @14,2                                               1469
         L     @06,CCACPL(,R11)                                    1469
         L     @06,CTGFIELD-4(@14,@06)                             1469
         L     @06,CTGFLCHN(,@06)                                  1469
         LTR   @06,@06                                             1469
         BZ    @RF01469                                            1469
*       DO;                         /* YES                   @ZA29164*/
*         KTESTFPL=CTGFIELD(K)->CTGFLCHN;/* GET KEY 0 TEST   @ZA29164
*                                      FPL POINTER           @ZA29164*/
         LR    KTESTFPL,@06                                        1471
*         UTESTFPL=OLDCPL->CTGFIELD(K)->CTGFLCHN;/* GET USER TEST FPL
*                                                            @ZA29164
*                                      POINTER               @ZA29164*/
         L     @14,CTGFIELD-4(@14,OLDCPL)                          1472
         L     UTESTFPL,CTGFLCHN(,@14)                             1472
*         DO WHILE KTESTFPL^=ZEROP; /* DO WHILE A POINTER    @ZA29164
*                                      TO A KEY 0 TEST FPL   @ZA29164
*                                      EXISTS                @ZA29164*/
         B     @DE01473                                            1473
@DL01473 DS    0H                                                  1474
*           TESTRSLT=KTESTFPL->FPLRLTOV;/* GET TEST RESULT   @ZA29164*/
         L     TESTRSLT,FPLRLTOV(,KTESTFPL)                        1474
*           SPKA(CCAUSKEY);         /* SWITCH TO USER KEY    @ZA29164*/
         SLR   @14,@14                                             1475
         IC    @14,CCAUSKEY(,R11)                                  1475
         SPKA  0(@14)                                              1475
*           UTESTFPL->FPLRLTOV=TESTRSLT;/* STORE TEST        @ZA29164
*                                      RESULT IN USER FPL    @ZA29164*/
         ST    TESTRSLT,FPLRLTOV(,UTESTFPL)                        1476
*           GEN(SPKA 0);            /* SWITCH BACK TO KEY 0  @ZA29164*/
         SPKA 0
*           KTESTFPL=KTESTFPL->CTGFLCHN;/* GET PTR TO NEXT   @ZA29164
*                                      TEST FPL OR ZERO      @ZA29164*/
         L     KTESTFPL,CTGFLCHN(,KTESTFPL)                        1478
*           UTESTFPL=UTESTFPL->CTGFLCHN;/* GET PTR TO NEXT   @ZA29164*/
         L     UTESTFPL,CTGFLCHN(,UTESTFPL)                        1479
*         END;                      /* TEST FPL OR ZERO      @ZA29164*/
@DE01473 LTR   KTESTFPL,KTESTFPL                                   1480
         BNZ   @DL01473                                            1480
*       END;                        /*                       @ZA29164*/
*     ELSE                                                         1482
*       ;                           /* NO TEST FPL EXISTS    @ZA29164*/
@RF01469 DS    0H                                                  1483
*   END;                            /* END OF PROCESS FPL    @ZA29164
*                                      LOOP                  @ZA29164*/
         AL    K,@CF00038                                          1483
@DE01450 L     @14,CCACPL(,R11)                                    1483
         SLR   @06,@06                                             1483
         IC    @06,CTGNOFLD(,@14)                                  1483
         CR    K,@06                                               1483
         BNH   @DL01450                                            1483
*   RFY                                                            1484
*    (R7,                                                          1484
*     R8,                                                          1484
*     R9) UNRSTD;                   /*                       @ZA29164*/
*   CCACPL=CCAOCPL;                 /* SWITCH TO USERS CPL   @ZA29164*/
         L     @14,CCAOCPL(,R11)                                   1485
         ST    @14,CCACPL(,R11)                                    1485
*   CALL EXIT;                      /* RETURN TO CALLER              */
         BAL   @14,EXIT                                            1486
*   GEN(DS 0F);                     /* FULLWORD BOUNDARY ALIGNMENT   */
         DS 0F
*   GEN(DC CL8'IGGPMB44');          /* NAME OF FOLLOWING PROCEDURE   */
         DC CL8'IGGPMB44'
*   END;                            /* END OF INNER PROCEDURE        */
@EL00010 DS    0H                                                  1489
@EF00010 DS    0H                                                  1489
@ER00010 BR    @14                                                 1489
         EJECT
*                                                                  1490
*/********************************************************************/
*/*                                                                  */
*/*        IGGPMB44  -  PROCEDURE  INTERNALLY  CALLED  NESTED        */
*/*                                                                  */
*/********************************************************************/
*                                                                  1490
*IGGPMB44:                                                         1490
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);/* SPECIFY PROCEDURE OPTIONS     */
IGGPMB44 DS    0H                                                  1491
*Z078:                              /* LABEL FOR PROCEDURE TRACKING  */
*Z078MB44:                          /* LABEL FOR PROCEDURE TRACKING  */
*   RFY                                                            1491
*    (R5,                                                          1491
*     R6,                                                          1491
*     R7,                                                          1491
*     R8,                                                          1491
*     R9) UNRSTD;                   /* PL/S COMPILER WORK REGISTERS  */
Z078     DS    0H                                                  1491
Z078MB44 DS    0H                                                  1492
*   RFY                                                            1492
*    (R2,                                                          1492
*     R3,                                                          1492
*     R4) RSTD;                     /* RESTRICT LOCAL WORK REGISTERS */
*   GEN(STM 12,14,12(13));          /* SAVE REGISTERS OF CALLER      */
         STM 12,14,12(13)
*   GEN(LA 13,12(13));              /* POINT TO NEXT SAVE AREA     1494
*                                                            @ZA29164*/
         LA 13,12(13)
*/* ******************************************************** @ZA29164*/
*                                                                  1495
*   /*****************************************************************/
*   /*                                                               */
*   /*                                                       @ZA29164*/
*   /* PROCEDURE NAME = IGGPMB44                             @ZA29164*/
*   /*                                                       @ZA29164*/
*   /* DESCRIPTIVE NAME = MOVE BACK FORTY FOUR BYTE NAME     @ZA29164*/
*   /*                                                       @ZA29164*/
*   /* FUNCTION =                                            @ZA29164*/
*   /* THIS PROCEDURE MOVES THE FORTY FOUR BYTE NAME FROM    @ZA29164*/
*   /* THE KEY 0 AREA TO THE USER AREA.                      @ZA29164*/
*   /*                                                       @ZA29164*/
*   /* INPUT = INPUT TO THIS PROCEDURE IS A POINTER TO THE   @ZA29164*/
*   /* KEY 0 FORTY FOUR BYTE ENTRYNAME AND A POINTER         @ZA29164*/
*   /* TO THE USERS ENTRYNAME RETURN AREA.                   @ZA29164*/
*   /*                                                       @ZA29164*/
*   /* OUTPUT = OUTPUT IS THE ENTRYNAME MOVED TO THE USER    @ZA29164*/
*   /* AREA.                                                 @ZA29164*/
*   /*                                                       @ZA29164*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1495
*/* ******************************************************** @ZA29164*/
*                                                                  1495
*   RFY                                                            1495
*    (R0,                                                          1495
*     R1,                                                          1495
*     R5,                                                          1495
*     R7,                                                          1495
*     R8) RSTD;                     /* RESTRICT REGISTERS    @ZA29164*/
*   STM(R0,R9,CICMRGSV);            /* SAVE REGS 0 TO 9      @ZA29164*/
         STM   R0,R9,CICMRGSV(R4)                                  1496
*   R7=CICBKPTR;                    /* GET KEY 0 PTR TO NAME @ZA29164*/
         L     R7,CICBKPTR(,R4)                                    1497
*   R8=CICRAREA;                    /* GET USER PTR TO NAME  @ZA29164*/
         L     R8,CICRAREA(,R4)                                    1498
*   RFY                                                            1499
*     CHAR24 BASED(R7);             /* REBASE 24 BYTE OVLY   @ZA29164*/
*   LM(R0,R5,CHAR24);               /* GET 24 BYTES IN REGS  @ZA29164*/
         LM    R0,R5,CHAR24(R7)                                    1500
*   SPKA(CCAUSKEY);                 /* SWITCH TO USER KEY    @ZA29164*/
         SLR   @14,@14                                             1501
         IC    @14,CCAUSKEY(,R11)                                  1501
         SPKA  0(@14)                                              1501
*   RFY                                                            1502
*     CHAR24 BASED(R8);             /* REBASE 24 BYTE OVLY   @ZA29164*/
*   STM(R0,R5,CHAR24);              /* STORE 24 BYTES IN     @ZA29164
*                                      USER AREA             @ZA29164*/
         STM   R0,R5,CHAR24(R8)                                    1503
*   GEN(SPKA 0);                    /* SWITCH TO KEY 0       @ZA29164*/
         SPKA 0
*   R7=R7+TWENTY4;                  /* INCR KEY 0 PTR BY 24  @ZA29164*/
         LA    @14,24                                              1505
         ALR   R7,@14                                              1505
*   R8=R8+TWENTY4;                  /* INCR USER PTR BY 24   @ZA29164*/
         ALR   R8,@14                                              1506
*   RFY                                                            1507
*     CHAR20 BASED(R7);             /* REBASE 24 BYTE OVLY   @ZA29164*/
*   LM(R0,R4,CHAR20);               /* LOAD 20 BYTES         @ZA29164*/
         LM    R0,R4,CHAR20(R7)                                    1508
*   SPKA(CCAUSKEY);                 /* SWITCH TO USER KEY    @ZA29164*/
         SLR   @14,@14                                             1509
         IC    @14,CCAUSKEY(,R11)                                  1509
         SPKA  0(@14)                                              1509
*   RFY                                                            1510
*     CHAR20 BASED(R8);             /* REBASE 24 BYTE OVLY   @ZA29164*/
*   STM(R0,R4,CHAR20);              /* STORE LAST 20 BYTES   @ZA29164*/
         STM   R0,R4,CHAR20(R8)                                    1511
*   GEN(SPKA 0);                    /* SWITCH TO KEY 0       @ZA29164*/
         SPKA 0
*   R4=CCAR0REC+(6*512);            /* POINT TO CICB         @ZA29164*/
         LA    R4,3072                                             1513
         AL    R4,CCAR0REC(,R11)                                   1513
*   LM(R0,R9,CICMRGSV);             /* RESTORE REGS 0 TO 9   @ZA29164*/
         LM    R0,R9,CICMRGSV(R4)                                  1514
*   RFY                                                            1515
*    (R0,                                                          1515
*     R1) UNRSTD;                   /*                       @ZA29164*/
*   CALL EXIT;                      /* RETURN TO CALLER              */
         BAL   @14,EXIT                                            1516
*   GEN(DS 0F);                     /* FULLWORD BOUNDARY ALIGNMENT   */
         DS 0F
*   GEN(DC CL8'IGGPMDTW');          /* NAME OF FOLLOWING PROCEDURE   */
         DC CL8'IGGPMDTW'
*   END;                            /* END OF INNER PROCEDURE        */
@EL00011 DS    0H                                                  1519
@EF00011 DS    0H                                                  1519
@ER00011 BR    @14                                                 1519
         EJECT
*                                                                  1520
*/********************************************************************/
*/*                                                                  */
*/*        IGGPMDTW  -  PROCEDURE  INTERNALLY  CALLED  NESTED        */
*/*                                                                  */
*/********************************************************************/
*                                                                  1520
*IGGPMDTW:                                                         1520
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);/* SPECIFY PROCEDURE OPTIONS     */
IGGPMDTW DS    0H                                                  1521
*Z079:                              /* LABEL FOR PROCEDURE TRACKING  */
*Z079MDTW:                          /* LABEL FOR PROCEDURE TRACKING  */
*   RFY                                                            1521
*    (R5,                                                          1521
*     R6,                                                          1521
*     R7,                                                          1521
*     R8,                                                          1521
*     R9) UNRSTD;                   /* PL/S COMPILER WORK REGISTERS  */
Z079     DS    0H                                                  1521
Z079MDTW DS    0H                                                  1522
*   RFY                                                            1522
*    (R2,                                                          1522
*     R3,                                                          1522
*     R4) RSTD;                     /* RESTRICT LOCAL WORK REGISTERS */
*   GEN(STM 12,14,12(13));          /* SAVE REGISTERS OF CALLER      */
         STM 12,14,12(13)
*   GEN(LA 13,12(13));              /* POINT TO NEXT SAVE AREA     1524
*                                                            @ZA29164*/
         LA 13,12(13)
*/********************************************************** @ZA29164*/
*                                                                  1525
*   /*****************************************************************/
*   /*                                                               */
*   /*                                                       @ZA29164*/
*   /* PROCEDURE NAME = IGGPMDTW                             @ZA29164*/
*   /*                                                       @ZA29164*/
*   /* DESCRIPTIVE NAME = RETURN USER DATA PROCEDURE         @ZA29164*/
*   /*                                                       @ZA29164*/
*   /* FUNCTION =                                            @ZA29164*/
*   /* THIS PROCEDURE MOVES THE DATA FROM THE                @ZA29164*/
*   /* KEY 0 AREA TO THE USER AREA.                          @ZA29164*/
*   /*                                                       @ZA29164*/
*   /* INPUT = INPUT TO THIS PROCEDURE IS A POINTER TO THE   @ZA29164*/
*   /* KEY 0 AREA, A POINTER TO THE USER AREA AND            @ZA29164*/
*   /* THE LENGTH OF THE AREA TO BE MOVED.                   @ZA29164*/
*   /*                                                       @ZA29164*/
*   /* OUTPUT = OUTPUT IS THE DATA MOVED TO THE USER AREA.   @ZA29164*/
*   /*                                                       @ZA29164*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1525
*/********************************************************** @ZA29164*/
*                                                                  1525
*   STM(R0,R9,CICMRGSV);            /* SAVE REGS 0 TO 9      @ZA29164*/
         STM   R0,R9,CICMRGSV(R4)                                  1525
*   RFY                                                            1526
*    (R0,                                                          1526
*     R1,                                                          1526
*     R8,                                                          1526
*     R9,                                                          1526
*     R15) RSTD;                    /* RESTRICT REGS         @ZA29164*/
*   R15=CICBKLNG;                   /* GET LENGTH            @ZA29164*/
         L     R15,CICBKLNG(,R4)                                   1527
*   R3=CICRAREA;                    /* GET USER OUTPUT AREA  @ZA29164*/
         L     R3,CICRAREA(,R4)                                    1528
*   R0=CICBKPTR;                    /* GET INPUT AREA        @ZA29164*/
         L     R0,CICBKPTR(,R4)                                    1529
*   R2=R0;                          /* SAVE INPUT POINTER    @ZA29164*/
         LR    R2,R0                                               1530
*   R8=R2;                          /* SAVE INPUT POINTER    @ZA29164*/
         LR    R8,R2                                               1531
*   R9=R3;                          /* SAVE OUTPUT POINTER   @ZA29164*/
         LR    R9,R3                                               1532
*   R0=R0&ACWD;                     /* AND OUT ALL BUT LAST  @ZA29164
*                                      TWO BITS OF BLOCK PTR @ZA29164*/
         ICM   @14,15,ACWD                                         1533
         NR    R0,@14                                              1533
*   IF R0^=ZERO THEN                /* BLOCK NOT ON BOUNDARY @ZA29164*/
         LTR   R0,R0                                               1534
         BZ    @RF01534                                            1534
*     DO;                           /* YES                   @ZA29164*/
*       R4=MASKARAY(R0);            /* GET CORRECT MASK      @ZA29164*/
         LR    @14,R0                                              1536
         SLA   @14,2                                               1536
         LA    @07,MASKARAY-4(@14)                                 1536
         ICM   R4,15,0(@07)                                        1536
*       R2=R2-R0;                   /* ROUND INPUT PTR BACK  @ZA29164
*                                      TO WORD BOUNDARY      @ZA29164*/
         SLR   R2,R0                                               1537
*       R3=R3-R0;                   /* ROUND OUTPUT PTR BACK @ZA29164
*                                      TO WORD BOUNDARY      @ZA29164*/
         SLR   R3,R0                                               1538
*       GEN REFS(R2,R3,R4) SETS(R1)(ICM R1,R4,0(R2));/* LOAD @ZA29164
*                                      BYTES INTO REGISTER   @ZA29164*/
         ICM R1,R4,0(R2)
*       SPKA(CCAUSKEY);             /* SWITCH TO USER KEY    @ZA29164*/
         SLR   @14,@14                                             1540
         IC    @14,CCAUSKEY(,R11)                                  1540
         SPKA  0(@14)                                              1540
*       GEN REFS(R1,R3,R4)(STCM R1,R4,0(R3));/* STORE BYTES  @ZA29164
*                                      INTO USER AREA        @ZA29164*/
         STCM R1,R4,0(R3)
*       GEN(SPKA 0);                /* SWITCH BACK TO KEY 0  @ZA29164*/
         SPKA 0
*       R8=R2+FOUR;                 /* MOVE INPUT ADDRESS TO @ZA29164
*                                      WORD BOUNDARY         @ZA29164*/
         LA    @14,4                                               1543
         LR    R8,R2                                               1543
         ALR   R8,@14                                              1543
*       R9=R3+FOUR;                 /* MOVE OUTPUT ADDRESS   @ZA29164
*                                      TO WORD BOUNDARY      @ZA29164*/
         ALR   @14,R3                                              1544
         LR    R9,@14                                              1544
*       R15=R15-R0;                 /* DECREMENT LENGTH      @ZA29164*/
         SLR   R15,R0                                              1545
*     END;                          /*                       @ZA29164*/
*   ELSE                                                           1547
*     ;                             /* BLOCK IS ON BOUNDARY  @ZA29164*/
@RF01534 DS    0H                                                  1548
*   RFY                                                            1548
*    (R5,                                                          1548
*     R6,                                                          1548
*     R7) RSTD;                     /* RESTRICT REGS         @ZA29164*/
*   RFY                                                            1549
*     OUTAREA BASED(R8);            /* REBASE KEY 0 AREA     @ZA29164*/
*   RFY                                                            1550
*     USERDATA BASED(R9);           /* REBASE USER OUTPUT    @ZA29164
*                                      AREA                  @ZA29164*/
*                                                                  1550
*   /*****************************************************************/
*   /*                                                               */
*   /* LOOP TO MOVE DATA AS LONG AS THE DATA TO BE MOVED IS  @ZA29164*/
*   /* LONGER THAN 31 BYTES.                                 @ZA29164*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1551
*   DO WHILE R15>THIRTY1;           /* THIRTY TWO BYTE LOOP  @ZA29164*/
         B     @DE01551                                            1551
@DL01551 DS    0H                                                  1552
*     LM(R0,R7,OUTAREA);            /* LOAD 32 BYTES OF      @ZA29164
*                                      KEY 0 DATA            @ZA29164*/
         LM    R0,R7,OUTAREA(R8)                                   1552
*     SPKA(CCAUSKEY);               /* SWITCH TO USER KEY    @ZA29164*/
         SLR   @14,@14                                             1553
         IC    @14,CCAUSKEY(,R11)                                  1553
         SPKA  0(@14)                                              1553
*     STM(R0,R7,USERDATA);          /* STORE 32 BYTES IN     @ZA29164
*                                      USER AREA             @ZA29164*/
         STM   R0,R7,USERDATA(R9)                                  1554
*     GEN(SPKA 0);                  /* SWITCH TO KEY 0       @ZA29164*/
         SPKA 0
*     R15=R15-THIRTY2;              /* DECREMENT LENGTH      @ZA29164*/
         LA    @14,32                                              1556
         SLR   R15,@14                                             1556
*     R8=R8+THIRTY2;                /* INCREMENT INPUT PTR   @ZA29164*/
         ALR   R8,@14                                              1557
*     R9=R9+THIRTY2;                /* INCREMENT OUTPUT PTR  @ZA29164*/
         ALR   R9,@14                                              1558
*   END;                            /*                       @ZA29164*/
*                                                                  1559
@DE01551 C     R15,@CF00033                                        1559
         BH    @DL01551                                            1559
*   /*****************************************************************/
*   /*                                                               */
*   /* MOVE LESS THAN 32 BYTES IF THERE IS DATA REMAINING    @ZA29164*/
*   /* TO BE MOVED.                                          @ZA29164*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1560
*   IF R15^=ZERO THEN               /* ANY DATA LEFT         @ZA29164*/
         LTR   R15,R15                                             1560
         BZ    @RF01560                                            1560
*     DO;                           /* YES                   @ZA29164*/
*       R7=R8+R15;                  /* GET ADDR END OF AREA  @ZA29164*/
         LR    R7,R8                                               1562
         ALR   R7,R15                                              1562
*       R7=R7&ACWD;                 /* GET NUMBER OF BYTES   @ZA29164
*                                      IN EXCESS OF WORD     @ZA29164
*                                      BOUNDARY              @ZA29164*/
         ICM   @14,15,ACWD                                         1563
         NR    R7,@14                                              1563
*       IF R15>THREE THEN           /* LOAD REG MOVE         @ZA29164*/
         C     R15,@CF00421                                        1564
         BNH   @RF01564                                            1564
*         DO;                       /* YES                   @ZA29164*/
*           SRA(R15,TWO);           /* GET NUMBER OF REGS    @ZA29164
*                                      FOR MOVE              @ZA29164*/
         SRA   R15,2                                               1566
*           R15=R15-ONE;            /* ADJUST REG COUNT      @ZA29164*/
         BCTR  R15,0                                               1567
*           GEN REFS(LOADREGS) SETS(R0,R1,R2,R3,R4,R5,R6);         1568
*                                                         /* @ZA29164*/
           EX R15,LOADREGS          /* LOAD REGISTERS        @ZA29164*/
*           SPKA(CCAUSKEY);         /* SWITCH TO USER KEY    @ZA29164*/
         SLR   @14,@14                                             1569
         IC    @14,CCAUSKEY(,R11)                                  1569
         SPKA  0(@14)                                              1569
*           GEN REFS(STORREGS,R0,R1,R2,R3,R4,R5,R6);               1570
*                                                   /*       @ZA29164*/
           EX R15,STORREGS          /* STORE REGS            @ZA29164*/
*           GEN(SPKA 0);            /* SWITCH TO KEY 0       @ZA29164*/
         SPKA 0
*           R15=R15+ONE;            /* ADJUST REG COUNT      @ZA29164*/
         AL    R15,@CF00038                                        1572
*           SLA(R15,TWO);           /* MULTIPLY NUMBER OF    @ZA29164
*                                      REGS BY FOUR          @ZA29164*/
         SLA   R15,2                                               1573
*           R8=R8+R15;              /* INCREMENT KEY 0 ADDR  @ZA29164*/
         ALR   R8,R15                                              1574
*           R9=R9+R15;              /* INCREMENT USER ADDR   @ZA29164*/
         ALR   R9,R15                                              1575
*           RFY                                                    1576
*            (R5,                                                  1576
*             R6) UNRSTD;           /* RELEASE REGISTERS     @ZA29164*/
*         END;                      /*                       @ZA29164*/
*       ELSE                                                       1578
*         ;                         /*                       @ZA29164*/
@RF01564 DS    0H                                                  1579
*       IF R7^=ZERO THEN            /* EXCESS BYTES EXIST    @ZA29164*/
         LTR   R7,R7                                               1579
         BZ    @RF01579                                            1579
*         DO;                       /* YES                   @ZA29164*/
*           R4=MASKARBT(R7);        /* GET MASK              @ZA29164*/
         LR    @14,R7                                              1581
         SLA   @14,2                                               1581
         LA    @06,MASKARBT-4(@14)                                 1581
         ICM   R4,15,0(@06)                                        1581
*           GEN REFS(R4,R8) SETS(R0)(ICM R0,R4,0(R8));/*     @ZA29164*/
         ICM R0,R4,0(R8)
*           SPKA(CCAUSKEY);         /* SWITCH TO USER KEY    @ZA29164*/
         SLR   @14,@14                                             1583
         IC    @14,CCAUSKEY(,R11)                                  1583
         SPKA  0(@14)                                              1583
*           GEN REFS(R0,R4,R9)(STCM R0,R4,0(R9));/*          @ZA29164*/
         STCM R0,R4,0(R9)
*           GEN(SPKA 0);            /* SWITCH TO KEY 0       @ZA29164*/
         SPKA 0
*         END;                      /*                       @ZA29164*/
*       ELSE                                                       1587
*         ;                         /* NO EXCESS BYTES       @ZA29164*/
@RF01579 DS    0H                                                  1588
*     END;                          /*                       @ZA29164*/
*   ELSE                                                           1589
*     ;                             /* NO DATA LEFT          @ZA29164*/
@RF01560 DS    0H                                                  1590
*   R4=CCAR0REC+(6*512);            /* POINT TO CICB         @ZA29164*/
         LA    R4,3072                                             1590
         AL    R4,CCAR0REC(,R11)                                   1590
*   LM(R0,R9,CICMRGSV);             /* RESTORE REGS 0 TO 9   @ZA29164*/
         LM    R0,R9,CICMRGSV(R4)                                  1591
*   RFY                                                            1592
*     OUTAREA BASED(R9);            /* REBASE KEY 0 AREA     @ZA29164*/
*   RFY                                                            1593
*     USERDATA BASED(R8);           /* REBASE USER OUTPUT    @ZA29164*/
*   RFY                                                            1594
*    (R0,                                                          1594
*     R1,                                                          1594
*     R15) UNRSTD;                  /*                       @ZA29164*/
*   CALL EXIT;                      /* RETURN TO CALLER              */
         BAL   @14,EXIT                                            1595
*   GEN(DS 0F);                     /* FULLWORD BOUNDARY ALIGNMENT   */
         DS 0F
*   GEN(DC CL8'IGGPVCHK');          /* NAME OF FOLLOWING PROCEDURE   */
         DC CL8'IGGPVCHK'
*   END;                            /* END OF INNER PROCEDURE        */
@EL00012 DS    0H                                                  1598
@EF00012 DS    0H                                                  1598
@ER00012 BR    @14                                                 1598
         EJECT
*                                                                  1599
*/********************************************************************/
*/*                                                                  */
*/*        IGGPVCHK  -  PROCEDURE  EXTERNALLY  CALLED  NESTED        */
*/*                                                                  */
*/********************************************************************/
*                                                                  1599
*IGGPVCHK:                                                         1599
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);/* SPECIFY PROCEDURE OPTIONS     */
IGGPVCHK DS    0H                                                  1600
*   GEN(ENTRY IGGPVCHK );           /* IDENTIFY ENTRY-POINT SYMBOL   */
         ENTRY IGGPVCHK
*Z080:                              /* LABEL FOR PROCEDURE TRACKING  */
*Z080VCHK:                          /* LABEL FOR PROCEDURE TRACKING  */
*   RFY                                                            1601
*    (R5,                                                          1601
*     R6,                                                          1601
*     R7,                                                          1601
*     R8,                                                          1601
*     R9) UNRSTD;                   /* PL/S COMPILER WORK REGISTERS  */
Z080     DS    0H                                                  1601
Z080VCHK DS    0H                                                  1602
*   RFY                                                            1602
*    (R2,                                                          1602
*     R3,                                                          1602
*     R4) RSTD;                     /* RESTRICT LOCAL WORK REGISTERS */
*   GEN(STM 12,14,12(13));          /* SAVE REGISTERS OF CALLER      */
         STM 12,14,12(13)
*   GEN(LA 13,12(13));              /* POINT TO NEXT SAVE AREA       */
         LA 13,12(13)
*   GEN(BALR 12,0);                 /* ESTABLISH ADDRESSABILITY      */
         BALR 12,0
*   GEN(USING *,12);                /* INDICATE AVAILABLE BASE REG   */
         USING *,12
*   GEN(B *+6);                     /* BRANCH AROUND CONSTANT        */
         B *+6
*   GEN(DC AL2(*-@MAINENT-4));      /* OFFSET TO MODULE BASE 1       */
         DC AL2(*-@MAINENT-4)
*   GEN(SH 12,*-2);                 /* COMPUTE MODULE BASE 1         */
         SH 12,*-2
*   GEN(LA 10,4095(0,12));          /* LOAD BASE 2 REG WITH 4095     */
         LA 10,4095(0,12)
*   GEN(USING @MAINENT,12);         /* INDICATE AVAILABLE BASE REG1  */
         USING @MAINENT,12
*   GEN(USING @MAINENT+4095,10);    /* INDICATE AVAILABLE BASE REG2
*                                                            @ZA29164*/
         USING @MAINENT+4095,10
*/********************************************************** @ZA29164*/
*/*  PROCEDURE NAME = IGGPVCHK                               @ZA29164*/
*/*                                                          @ZA29164*/
*/*  DESCRIPTIVE NAME = VALIDITY CHECK AND MOVE USER DATA    @ZA29164*/
*/*                     THAT IS LESS THAN 4K IN LENGTH       @ZA29164*/
*/*                                                          @ZA29164*/
*/*  FUNCTION =                                              @ZA29164*/
*/*     THIS PROCEDURE WILL VALIDITY CHECK THE USER BLOCK    @ZA29164*/
*/*     IN THE USER AREA AND THEN MOVE IT TO A KEY 0         @ZA29164*/
*/*     AREA. THE LENGTH OF THE AREA TO BE MOVED WILL BE     @ZA29164*/
*/*     COMPARED AGAINST THE LENGTH OF THE OUTPUT AREA TO    @ZA29164*/
*/*     VERIFY THAT THE MOVE CAN BE DONE. IF THE OUTPUT      @ZA29164*/
*/*     AREA IS INSUFFICIENT THEN THIS PROCEDURE WILL SET    @ZA29164*/
*/*     A FLAG BIT CICCOUNT AND INCREMENT THE MOVE LENGTH    @ZA29164*/
*/*     BUT NOT MOVE ANY DATA.                               @ZA29164*/
*/*                                                          @ZA29164*/
*/*  REGISTER CONVENTIONS =                                  @ZA29164*/
*/*     REGISTERS R0-R5 ARE SAVED UPON ENTERING              @ZA29164*/
*/*     R6-R9    WORK REGISTERS     VOLATILE                 @ZA29164*/
*/*     R15      WORK REGISTER      VOLATILE                 @ZA29164*/
*/*                                                          @ZA29164*/
*/*  INPUT =                                                 @ZA29164*/
*/*     INPUT TO THIS PROCEDURE IS A POINTER CICBKPTR TO     @ZA29164*/
*/*     THE POINTER OF THE BLOCK TO BE MOVED AND CICBKLNG,   @ZA29164*/
*/*     WHICH IS THE LENGTH OF THE BLOCK.                    @ZA29164*/
*/*                                                          @ZA29164*/
*/*  OUTPUT =                                                @ZA29164*/
*/*     NORMAL OUTPUT WILL CONSIST OF THE BLOCK MOVED TO     @ZA29164*/
*/*     KEY 0 STORAGE WITH THE POINTER UPDATED TO THE        @ZA29164*/
*/*     ADDRESS OF THE NEW LOCATION.                         @ZA29164*/
*/*                                                          @ZA29164*/
*/********************************************************** @ZA29164*/
*                                                                  1613
*   GEN(STM R0,R4,12(13));          /* SAVE REGS 0 TO 4      @ZA29164*/
         STM R0,R4,12(13)
*   RFY                                                            1614
*    (R0,                                                          1614
*     R1,                                                          1614
*     R7,                                                          1614
*     R8,                                                          1614
*     R9,                                                          1614
*     R15) RSTD;                    /* RESTRICT WORK REGS    @ZA29164*/
*   R3=BLOCKPTR;                    /* GET POINTER TO BLOCK  @ZA29164*/
         L     @14,CICBKPTR(,R4)                                   1615
         L     R3,BLOCKPTR(,@14)                                   1615
*   R1=R3+CICBKLNG-ONE;             /* GET ADDR OF LAST BYTE @ZA29164
*                                      IN BLOCK              @ZA29164*/
         LR    R1,R3                                               1616
         AL    R1,CICBKLNG(,R4)                                    1616
         BCTR  R1,0                                                1616
*   GEN REFS(R3)(OI 0(R3),X'00');   /* CHECK FIRST BYTE IN   @ZA29164
*                                      BLOCK                 @ZA29164*/
         OI 0(R3),X'00'
*   GEN REFS(R1)(OI 0(R1),X'00');   /* CHECK LAST BYTE IN    @ZA29164
*                                      BLOCK                 @ZA29164*/
         OI 0(R1),X'00'
*   R7=R3;                          /* SAVE POINTER          @ZA29164*/
         LR    R7,R3                                               1619
*   R9=CICNXTBK;                    /* PTR TO OUTPUT AREA    @ZA29164*/
         L     R9,CICNXTBK(,R4)                                    1620
*   R8=R3;                          /* SAVE POINTER          @ZA29164*/
         LR    R8,R3                                               1621
*   R8=R8&ROUNDUP;                  /* ROUND BACK TO WORD    @ZA29164
*                                      BOUNDRY               @ZA29164*/
         ICM   @14,15,ROUNDUP                                      1622
         NR    R8,@14                                              1622
*   R3=R3&ACWD;                     /* AND OUT ALL BUT LAST  @ZA29164
*                                      TWO BITS OF BLOCK PTR @ZA29164*/
         ICM   @14,15,ACWD                                         1623
         NR    R3,@14                                              1623
*   R15=CICBKLNG;                   /* GET BLOCK LENGTH      @ZA29164*/
         L     R15,CICBKLNG(,R4)                                   1624
*   R7=R15+R7;                      /* AND OUT ALL BUT LAST  @ZA29164*/
         ALR   R7,R15                                              1625
*   R7=R7&ACWD;                     /* TWO BITS OF END OF    @ZA29164
*                                      BLOCK PTR             @ZA29164*/
*                                                                  1626
         NR    R7,@14                                              1626
*   /*****************************************************************/
*   /*                                                               */
*   /* ROUND UP BLOCK LENGTH BY EXAMINING THE START AND END  @ZA29164*/
*   /* OF THE BLOCK BOUNDRY.                                 @ZA29164*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1627
*   IF R3^=ZERO THEN                /* IF DOES NOT START ON  @ZA29164*/
         LTR   R3,R3                                               1627
         BZ    @RF01627                                            1627
*     R15=R15+R3;                   /* WORD BOUNDRY ROUND UP @ZA29164*/
         ALR   R15,R3                                              1628
*   ELSE                                                           1629
*     ;                             /* STARTS ON BOUNDRY     @ZA29164*/
@RF01627 DS    0H                                                  1630
*   IF R7^=ZERO THEN                /* END ON WORD BOUNDRY   @ZA29164*/
         LTR   R7,R7                                               1630
         BZ    @RF01630                                            1630
*     DO;                           /* NO                    @ZA29164*/
*       R15=R15+FOUR;               /* ROUND UP TO WORD      @ZA29164*/
         AL    R15,@CF00059                                        1632
*       R15=R15-R7;                 /* BOUNDRY               @ZA29164*/
         SLR   R15,R7                                              1633
*     END;                          /*                       @ZA29164*/
*   ELSE                                                           1635
*     ;                             /* ENDS ON BOUNDRY       @ZA29164*/
*                                                                  1635
@RF01630 DS    0H                                                  1636
*   /*****************************************************************/
*   /*                                                               */
*   /* DETERMINE AMOUNT OF STORAGE NEEDED FOR THE BLOCK TO   @ZA29164*/
*   /* BE MOVED AND IF THERE IS ENOUGH ROOM TO MOVE IT.      @ZA29164*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1636
*   IF R15>CICRMBYT THEN            /* ENOUGH ROOM IN AREA   @ZA29164*/
         C     R15,CICRMBYT(,R4)                                   1636
         BNH   @RF01636                                            1636
*     IF CICCISSP^=ZERO THEN        /* SECONDARY AREA EXIST  @ZA29164*/
         L     @14,CICCISSP(,R4)                                   1637
         LTR   @14,@14                                             1637
         BZ    @RF01637                                            1637
*       IF CICPTRSW=ON THEN         /* WERE PTRS PREVIOUSLY  @ZA29164
*                                      SWITCHED              @ZA29164*/
         TM    CICPTRSW(R4),B'01000000'                            1638
         BNO   @RF01638                                            1638
*         DO;                       /* YES, AND NOW THERE IS @ZA29164
*                                      NO ROOM IN SECONDARY  @ZA29164
*                                      AREA                  @ZA29164*/
*           CICCOUNT=ON;            /* ALERT DRIVER          @ZA29164*/
         OI    CICCOUNT(R4),B'10000000'                            1640
*           CALL EXIT;              /* RETURN                @ZA29164*/
         BAL   @14,EXIT                                            1641
*         END;                      /*                       @ZA29164*/
*       ELSE                        /* PTRS WERE NOT         @ZA29164*/
*         DO;                       /* PREVIOSLY SWITCHED    @ZA29164*/
         B     @RC01638                                            1643
@RF01638 DS    0H                                                  1644
*           CICNXTBK=CICCISSP;      /* POINT TO SECOND AREA  @ZA29164*/
         L     @14,CICCISSP(,R4)                                   1644
         ST    @14,CICNXTBK(,R4)                                   1644
*           CICRMBYT=CICSABYT;      /* SET AVAILABLE BYTES   @ZA29164*/
         L     @06,CICSABYT(,R4)                                   1645
         ST    @06,CICRMBYT(,R4)                                   1645
*           R9=CICNXTBK;            /* UPDATE OUTPUT PTR     @ZA29164*/
         LR    R9,@14                                              1646
*           CICPTRSW=ON;            /* PTRS WERE SWITCHED    @ZA29164*/
         OI    CICPTRSW(R4),B'01000000'                            1647
*         END;                      /*                       @ZA29164*/
*     ELSE                          /* SECONDARY AREA DOES   @ZA29164*/
*       DO;                         /* NOT EXIST             @ZA29164*/
         B     @RC01637                                            1649
@RF01637 DS    0H                                                  1650
*         CICCOUNT=ON;              /* SET COUNT MODE        @ZA29164*/
         OI    CICCOUNT(R4),B'10000000'                            1650
*         CICGMCNT=CICGMCNT+R15;    /* ACCUMULATE LENGTH FOR @ZA29164
*                                      LATER GETMAIN         @ZA29164*/
         LR    @14,R15                                             1651
         AL    @14,CICGMCNT(,R4)                                   1651
         ST    @14,CICGMCNT(,R4)                                   1651
*         CALL EXIT;                /* RETURN TO DRIVER      @ZA29164*/
         BAL   @14,EXIT                                            1652
*       END;                        /*                       @ZA29164*/
*   ELSE                                                           1654
*     ;                             /* ENOUGH ROOM FOR MOVE  @ZA29164*/
@RF01636 DS    0H                                                  1655
*   BLOCKPTR=CICNXTBK+R3;           /* UPDATE INPUT POINTER  @ZA29164*/
@RC01636 L     @14,CICBKPTR(,R4)                                   1655
         L     @06,CICNXTBK(,R4)                                   1655
         LR    @05,R3                                              1655
         ALR   @05,@06                                             1655
         ST    @05,BLOCKPTR(,@14)                                  1655
*   CICNXTBK=CICNXTBK+R15;          /* UPDATE POINTER TO     @ZA29164
*                                      NEXT AVAILABLE AREA   @ZA29164*/
         ALR   @06,R15                                             1656
         ST    @06,CICNXTBK(,R4)                                   1656
*   CICRMBYT=CICRMBYT-R15;          /* DECREMENT AVAILABLE   @ZA29164
*                                      BYTES IN OUTPUT AREA  @ZA29164*/
*                                                                  1657
         L     @14,CICRMBYT(,R4)                                   1657
         SLR   @14,R15                                             1657
         ST    @14,CICRMBYT(,R4)                                   1657
*   /*****************************************************************/
*   /*                                                               */
*   /* LOOP TO MOVE DATA AS LONG AS THE DATA TO BE MOVED IS  @ZA29164*/
*   /* GREATER THAN 31 BYTES.                                @ZA29164*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1658
*   RFY                                                            1658
*    (R5,                                                          1658
*     R6) RSTD;                     /* RESTRICT REGS         @ZA29164*/
*   DO WHILE R15>THIRTY1;           /* THIRTY TWO BYTE LOOP  @ZA29164*/
         B     @DE01659                                            1659
@DL01659 DS    0H                                                  1660
*     SPKA(CCAUSKEY);               /* SWITCH TO USER KEY    @ZA29164*/
         SLR   @14,@14                                             1660
         IC    @14,CCAUSKEY(,R11)                                  1660
         SPKA  0(@14)                                              1660
*     LM(R0,R7,USERDATA);           /* LOAD 32 BYTES OF USER @ZA29164
*                                      DATA                  @ZA29164*/
         LM    R0,R7,USERDATA(R8)                                  1661
*     GEN(SPKA 0);                  /* SWITCH TO KEY 0       @ZA29164*/
         SPKA 0
*     STM(R0,R7,OUTAREA);           /* STORE 32 BYTES IN     @ZA29164
*                                      KEY 0 AREA            @ZA29164*/
         STM   R0,R7,OUTAREA(R9)                                   1663
*     R15=R15-THIRTY2;              /* DECREMENT LENGTH      @ZA29164*/
         LA    @14,32                                              1664
         SLR   R15,@14                                             1664
*     R8=R8+THIRTY2;                /* INCREMENT INPUT PTR   @ZA29164*/
         ALR   R8,@14                                              1665
*     R9=R9+THIRTY2;                /* INCREMENT OUTPUT PTR  @ZA29164*/
         ALR   R9,@14                                              1666
*   END;                            /*                       @ZA29164*/
*                                                                  1667
@DE01659 C     R15,@CF00033                                        1667
         BH    @DL01659                                            1667
*   /*****************************************************************/
*   /*                                                               */
*   /* MOVE DATA THAT IS LESS THAN 32 BYTES IN LENGTH. THE   @ZA29164*/
*   /* NUMBER OF BYTES MOVED WILL BE ROUNDED UP TO A         @ZA29164*/
*   /* FULL WORD.                                            @ZA29164*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1668
*   IF R15^=ZERO THEN               /* ANY DATA TO BE MOVED  @ZA29164*/
         LTR   R15,R15                                             1668
         BZ    @RF01668                                            1668
*     DO;                           /* YES                   @ZA29164*/
*       SRA(R15,TWO);               /* DIVIDE LENGTH BY FOUR @ZA29164
*                                      TO GET NO. OF REGS    @ZA29164
*                                      FOR MOVE              @ZA29164*/
         SRA   R15,2                                               1670
*       R15=R15-ONE;                /* ADJUST REG COUNT      @ZA29164*/
         BCTR  R15,0                                               1671
*       SPKA(CCAUSKEY);             /* SWITCH TO USER KEY    @ZA29164*/
         SLR   @14,@14                                             1672
         IC    @14,CCAUSKEY(,R11)                                  1672
         SPKA  0(@14)                                              1672
*       GEN REFS(LOADREGS) SETS(R0,R1,R2,R3,R4,R5,R6,R7);          1673
*                                                     /*     @ZA29164*/
        EX R15,LOADREGS             /* LOAD REGISTERS        @ZA29164*/
*       GEN(SPKA 0);                /* SWITCH TO KEY 0       @ZA29164*/
         SPKA 0
*       GEN REFS(STORREGS) SETS(R0,R1,R2,R3,R4,R5,R6,R7);          1675
*                                                     /*     @ZA29164*/
        EX R15,STORREGS             /* STORE REGISTERS       @ZA29164*/
*     END;                          /*                       @ZA29164*/
*   ELSE                                                           1677
*     ;                             /* NO DATA TO BE MOVED   @ZA29164*/
@RF01668 DS    0H                                                  1678
*   GEN(LM R0,R4,12(13));           /* RESTORE REGS 0 TO 4   @ZA29164*/
         LM R0,R4,12(13)
*   RFY                                                            1679
*    (R0,                                                          1679
*     R1,                                                          1679
*     R15) UNRSTD;                  /*                       @ZA29164*/
*   CALL EXIT;                      /* RETURN TO CALLER              */
         BAL   @14,EXIT                                            1680
*   GEN(DS 0F);                     /* FULLWORD BOUNDARY ALIGNMENT   */
         DS 0F
*   GEN(DC CL8'IGGPVCGF');          /* NAME OF FOLLOWING PROCEDURE   */
         DC CL8'IGGPVCGF'
*   END;                            /* END OF INNER PROCEDURE        */
@EL00013 DS    0H                                                  1683
@EF00013 DS    0H                                                  1683
@ER00013 BR    @14                                                 1683
         EJECT
*                                                                  1684
*/********************************************************************/
*/*                                                                  */
*/*        IGGPVCGF  -  PROCEDURE  INTERNALLY  CALLED  NESTED        */
*/*                                                                  */
*/********************************************************************/
*                                                                  1684
*IGGPVCGF:                                                         1684
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);/* SPECIFY PROCEDURE OPTIONS     */
IGGPVCGF DS    0H                                                  1685
*Z081:                              /* LABEL FOR PROCEDURE TRACKING  */
*Z081VCGF:                          /* LABEL FOR PROCEDURE TRACKING  */
*   RFY                                                            1685
*    (R5,                                                          1685
*     R6,                                                          1685
*     R7,                                                          1685
*     R8,                                                          1685
*     R9) UNRSTD;                   /* PL/S COMPILER WORK REGISTERS  */
Z081     DS    0H                                                  1685
Z081VCGF DS    0H                                                  1686
*   RFY                                                            1686
*    (R2,                                                          1686
*     R3,                                                          1686
*     R4) RSTD;                     /* RESTRICT LOCAL WORK REGISTERS */
*   GEN(STM 12,14,12(13));          /* SAVE REGISTERS OF CALLER      */
         STM 12,14,12(13)
*   GEN(LA 13,12(13));              /* POINT TO NEXT SAVE AREA     1688
*                                                            @ZA29164*/
         LA 13,12(13)
*/********************************************************** @ZA29164*/
*/*  PROCEDURE NAME = IGGPVCGF                               @ZA29164*/
*/*                                                          @ZA29164*/
*/*  DESCRIPTIVE NAME = VALIDITY CHECK AND MOVE USER DATA    @ZA29164*/
*/*                     THAT IS GREATER THAN 4K IN LENGTH    @ZA29164*/
*/*                                                          @ZA29164*/
*/*  FUNCTION =                                              @ZA29164*/
*/*     THIS PROCEDURE WILL VALIDITY CHECK THE USER BLOCK    @ZA29164*/
*/*     IN THE USER AREA AND THEN MOVE IT TO A KEY 0         @ZA29164*/
*/*     AREA. THE LENGTH OF THE AREA TO BE MOVED WILL BE     @ZA29164*/
*/*     COMPARED AGAINST THE LENGTH OF THE OUTPUT AREA TO    @ZA29164*/
*/*     VERIFY THAT THE MOVE CAN BE DONE. IF THE OUTPUT      @ZA29164*/
*/*     AREA IS INSUFFICIENT THEN THIS PROCEDURE WILL SET    @ZA29164*/
*/*     A FLAG BIT CICCOUNT AND INCREMENT THE MOVE LENGTH    @ZA29164*/
*/*     BUT NOT MOVE ANY DATA.                               @ZA29164*/
*/*                                                          @ZA29164*/
*/*  REGISTER CONVENTIONS =                                  @ZA29164*/
*/*     REGISTERS R0-R5 ARE SAVED UPON ENTERING              @ZA29164*/
*/*     R6-R9    WORK REGISTERS     VOLATILE                 @ZA29164*/
*/*     R15      WORK REGISTER      VOLATILE                 @ZA29164*/
*/*                                                          @ZA29164*/
*/*  INPUT =                                                 @ZA29164*/
*/*     INPUT TO THIS PROCEDURE IS A POINTER CICBKPTR TO     @ZA29164*/
*/*     THE POINTER OF THE BLOCK TO BE MOVED AND CICBKLNG,   @ZA29164*/
*/*     WHICH IS THE LENGTH OF THE BLOCK.                    @ZA29164*/
*/*                                                          @ZA29164*/
*/*  OUTPUT =                                                @ZA29164*/
*/*     NORMAL OUTPUT WILL CONSIST OF THE BLOCK MOVED TO     @ZA29164*/
*/*     KEY 0 STORAGE WITH THE POINTER UPDATED TO THE        @ZA29164*/
*/*     ADDRESS OF THE NEW LOCATION.                         @ZA29164*/
*/*                                                          @ZA29164*/
*/********************************************************** @ZA29164*/
*                                                                  1689
*   GEN(STM R0,R4,12(13));          /* SAVE REGS 0 TO 4      @ZA29164*/
         STM R0,R4,12(13)
*   RFY                                                            1690
*    (R0,                                                          1690
*     R1,                                                          1690
*     R7,                                                          1690
*     R8,                                                          1690
*     R9,                                                          1690
*     R15) RSTD;                    /* RESTRICT WORK REGS    @ZA29164*/
*   R3=BLOCKPTR;                    /* GET POINTER TO BLOCK  @ZA29164*/
         L     @14,CICBKPTR(,R4)                                   1691
         L     R3,BLOCKPTR(,@14)                                   1691
*   R1=R3+CICBKLNG-ONE;             /* GET ADDR OF LAST BYTE @ZA29164
*                                      IN BLOCK              @ZA29164*/
         L     @14,CICBKLNG(,R4)                                   1692
         LR    R1,R3                                               1692
         ALR   R1,@14                                              1692
         BCTR  R1,0                                                1692
*   R2=CICBKLNG-FOUR096;            /* DECREMENT LNG TOTAL   @ZA29164*/
         SL    @14,@CF03779                                        1693
         LR    R2,@14                                              1693
*   GEN REFS(R3)(OI 0(R3),X'00');   /* CHECK FIRST BYTE IN   @ZA29164
*                                      BLOCK                 @ZA29164*/
         OI 0(R3),X'00'
*   GEN REFS(R1)(OI 0(R1),X'00');   /* CHECK LAST BYTE IN    @ZA29164
*                                      BLOCK                 @ZA29164*/
         OI 0(R1),X'00'
*   R7=R3;                          /* SAVE POINTER          @ZA29164*/
         LR    R7,R3                                               1696
*   DO UNTIL R2=ZERO;               /* ADDR CHECK LOOP       @ZA29164*/
@DL01697 DS    0H                                                  1698
*     IF R2>FOUR096 THEN            /* FULL BLOCK            @ZA29164*/
         L     @14,@CF03779                                        1698
         CR    R2,@14                                              1698
         BNH   @RF01698                                            1698
*       DO;                         /* YES                   @ZA29164*/
*         R3=R3+FOUR096;            /* INCR FIRST POINTER    @ZA29164*/
         ALR   R3,@14                                              1700
*         R2=R2-FOUR096;            /* DECREMENT LNG TOTAL   @ZA29164*/
         SLR   R2,@14                                              1701
*       END;                        /*                       @ZA29164*/
*     ELSE                          /* LESS THAN FULL BLOCK  @ZA29164*/
*       DO;                         /* YES                   @ZA29164*/
         B     @RC01698                                            1703
@RF01698 DS    0H                                                  1704
*         R3=R3+FOUR096;            /* INCR FIRST POINTER    @ZA29164*/
         AL    R3,@CF03779                                         1704
*         R2=0;                     /* ZERO LENGTH TOTAL     @ZA29164*/
         SLR   R2,R2                                               1705
*       END;                        /*                       @ZA29164*/
*     GEN REFS(R3)(OI 0(R3),X'00'); /* CHECK FIRST BYTE      @ZA29164
*                                      IN BLOCK              @ZA29164*/
@RC01698 DS    0H                                                  1707
         OI 0(R3),X'00'
*   END;                            /*                       @ZA29164*/
@DE01697 SLR   @14,@14                                             1708
         CR    R2,@14                                              1708
         BNE   @DL01697                                            1708
*   R9=CICNXTBK;                    /* PTR TO OUTPUT AREA    @ZA29164*/
         L     R9,CICNXTBK(,R4)                                    1709
*   R8=R7;                          /* SAVE POINTER          @ZA29164*/
         LR    R8,R7                                               1710
*   R8=R8&ROUNDUP;                  /* ROUND BACK TO WORD    @ZA29164
*                                      BOUNDRY               @ZA29164*/
         ICM   @06,15,ROUNDUP                                      1711
         NR    R8,@06                                              1711
*   R3=R7&ACWD;                     /* AND OUT ALL BUT LAST  @ZA29164
*                                      TWO BITS OF BLOCK PTR @ZA29164*/
         ICM   @06,15,ACWD                                         1712
         LR    R3,R7                                               1712
         NR    R3,@06                                              1712
*   R15=CICBKLNG;                   /* GET BLOCK LENGTH      @ZA29164*/
         L     R15,CICBKLNG(,R4)                                   1713
*   R7=R15+R7;                      /* AND OUT ALL BUT LAST  @ZA29164*/
         ALR   R7,R15                                              1714
*   R7=R7&ACWD;                     /* TWO BITS OF END OF    @ZA29164
*                                      BLOCK PTR             @ZA29164*/
*                                                                  1715
         NR    R7,@06                                              1715
*   /*****************************************************************/
*   /*                                                               */
*   /* ROUND UP BLOCK LENGTH BY EXAMINING THE START AND END  @ZA29164*/
*   /* OF THE BLOCK BOUNDRY.                                 @ZA29164*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1716
*   IF R3^=ZERO THEN                /* IF DOES NOT START ON  @ZA29164*/
         CR    R3,@14                                              1716
         BE    @RF01716                                            1716
*     R15=R15+R3;                   /* WORD BOUNDRY ROUND UP @ZA29164*/
         ALR   R15,R3                                              1717
*   ELSE                                                           1718
*     ;                             /* STARTS ON BOUNDRY     @ZA29164*/
@RF01716 DS    0H                                                  1719
*   IF R7^=ZERO THEN                /* END ON WORD BOUNDRY   @ZA29164*/
         LTR   R7,R7                                               1719
         BZ    @RF01719                                            1719
*     DO;                           /* NO                    @ZA29164*/
*       R15=R15+FOUR;               /* ROUND UP TO WORD      @ZA29164*/
         AL    R15,@CF00059                                        1721
*       R15=R15-R7;                 /* BOUNDRY               @ZA29164*/
         SLR   R15,R7                                              1722
*     END;                          /*                       @ZA29164*/
*   ELSE                                                           1724
*     ;                             /* ENDS ON BOUNDRY       @ZA29164*/
*                                                                  1724
@RF01719 DS    0H                                                  1725
*   /*****************************************************************/
*   /*                                                               */
*   /* DETERMINE AMOUNT OF STORAGE NEEDED FOR THE BLOCK TO   @ZA29164*/
*   /* BE MOVED AND IF THERE IS ENOUGH ROOM TO MOVE IT.      @ZA29164*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1725
*   IF R15>CICRMBYT THEN            /* ENOUGH ROOM IN AREA   @ZA29164*/
         C     R15,CICRMBYT(,R4)                                   1725
         BNH   @RF01725                                            1725
*     IF CICCISSP^=ZERO THEN        /* SECONDARY AREA EXIST  @ZA29164*/
         L     @14,CICCISSP(,R4)                                   1726
         LTR   @14,@14                                             1726
         BZ    @RF01726                                            1726
*       IF CICPTRSW=ON THEN         /* WERE PTRS PREVIOUSLY  @ZA29164
*                                      SWITCHED              @ZA29164*/
         TM    CICPTRSW(R4),B'01000000'                            1727
         BNO   @RF01727                                            1727
*         DO;                       /* YES, AND NOW THERE IS @ZA29164
*                                      NO ROOM IN SECONDARY  @ZA29164
*                                      AREA                  @ZA29164*/
*           CICCOUNT=ON;            /* ALERT DRIVER          @ZA29164*/
         OI    CICCOUNT(R4),B'10000000'                            1729
*           CALL EXIT;              /* RETURN                @ZA29164*/
         BAL   @14,EXIT                                            1730
*         END;                      /*                       @ZA29164*/
*       ELSE                        /* PTRS WERE NOT         @ZA29164*/
*         DO;                       /* PREVIOSLY SWITCHED    @ZA29164*/
         B     @RC01727                                            1732
@RF01727 DS    0H                                                  1733
*           CICNXTBK=CICCISSP;      /* POINT TO SECOND AREA  @ZA29164*/
         L     @14,CICCISSP(,R4)                                   1733
         ST    @14,CICNXTBK(,R4)                                   1733
*           CICRMBYT=CICSABYT;      /* SET AVAILABLE BYTES   @ZA29164*/
         L     @06,CICSABYT(,R4)                                   1734
         ST    @06,CICRMBYT(,R4)                                   1734
*           R9=CICNXTBK;            /* UPDATE OUTPUT PTR     @ZA29164*/
         LR    R9,@14                                              1735
*           CICPTRSW=ON;            /*                       @ZA29164*/
         OI    CICPTRSW(R4),B'01000000'                            1736
*         END;                      /*                       @ZA29164*/
*     ELSE                          /* SECONDARY AREA DOES   @ZA29164*/
*       DO;                         /* NOT EXIST             @ZA29164*/
         B     @RC01726                                            1738
@RF01726 DS    0H                                                  1739
*         CICCOUNT=ON;              /* SET COUNT MODE        @ZA29164*/
         OI    CICCOUNT(R4),B'10000000'                            1739
*         CICGMCNT=CICGMCNT+R15;    /* ACCUMULATE LENGTH FOR @ZA29164
*                                      LATER GETMAIN         @ZA29164*/
         LR    @14,R15                                             1740
         AL    @14,CICGMCNT(,R4)                                   1740
         ST    @14,CICGMCNT(,R4)                                   1740
*         CALL EXIT;                /* RETURN TO DRIVER      @ZA29164*/
         BAL   @14,EXIT                                            1741
*       END;                        /*                       @ZA29164*/
*   ELSE                                                           1743
*     ;                             /* ENOUGH ROOM FOR MOVE  @ZA29164*/
@RF01725 DS    0H                                                  1744
*   BLOCKPTR=CICNXTBK+R3;           /* UPDATE INPUT POINTER  @ZA29164*/
@RC01725 L     @14,CICBKPTR(,R4)                                   1744
         L     @06,CICNXTBK(,R4)                                   1744
         LR    @05,R3                                              1744
         ALR   @05,@06                                             1744
         ST    @05,BLOCKPTR(,@14)                                  1744
*   CICNXTBK=CICNXTBK+R15;          /* UPDATE POINTER TO     @ZA29164
*                                      NEXT AVAILABLE AREA   @ZA29164*/
         ALR   @06,R15                                             1745
         ST    @06,CICNXTBK(,R4)                                   1745
*   CICRMBYT=CICRMBYT-R15;          /* DECREMENT AVAILABLE   @ZA29164
*                                      BYTES IN OUTPUT AREA  @ZA29164*/
*                                                                  1746
         L     @14,CICRMBYT(,R4)                                   1746
         SLR   @14,R15                                             1746
         ST    @14,CICRMBYT(,R4)                                   1746
*   /*****************************************************************/
*   /*                                                               */
*   /* LOOP TO MOVE DATA AS LONG AS THE DATA TO BE MOVED IS  @ZA29164*/
*   /* GREATER THAN 31 BYTES                                 @ZA29164*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1747
*   RFY                                                            1747
*    (R5,                                                          1747
*     R6) RSTD;                     /* RESTRICT REGS         @ZA29164*/
*   DO WHILE R15>THIRTY1;           /* THIRTY TWO BYTE LOOP  @ZA29164*/
         B     @DE01748                                            1748
@DL01748 DS    0H                                                  1749
*     SPKA(CCAUSKEY);               /* SWITCH TO USER KEY    @ZA29164*/
         SLR   @14,@14                                             1749
         IC    @14,CCAUSKEY(,R11)                                  1749
         SPKA  0(@14)                                              1749
*     LM(R0,R7,USERDATA);           /* LOAD 32 BYTES OF USER @ZA29164
*                                      DATA                  @ZA29164*/
         LM    R0,R7,USERDATA(R8)                                  1750
*     GEN(SPKA 0);                  /* SWITCH TO KEY 0       @ZA29164*/
         SPKA 0
*     STM(R0,R7,OUTAREA);           /* STORE 32 BYTES IN     @ZA29164
*                                      KEY 0 AREA            @ZA29164*/
         STM   R0,R7,OUTAREA(R9)                                   1752
*     R15=R15-THIRTY2;              /* DECREMENT LENGTH      @ZA29164*/
         LA    @14,32                                              1753
         SLR   R15,@14                                             1753
*     R8=R8+THIRTY2;                /* INCREMENT INPUT PTR   @ZA29164*/
         ALR   R8,@14                                              1754
*     R9=R9+THIRTY2;                /* INCREMENT OUTPUT PTR  @ZA29164*/
         ALR   R9,@14                                              1755
*   END;                            /*                       @ZA29164*/
*                                                                  1756
@DE01748 C     R15,@CF00033                                        1756
         BH    @DL01748                                            1756
*   /*****************************************************************/
*   /*                                                               */
*   /* MOVE DATA THAT IS LESS THAN 32 BYTES IN LENGTH. THE   @ZA29164*/
*   /* NUMBER OF BYTES MOVED WILL BE ROUNDED UP TO A         @ZA29164*/
*   /* FULL WORD.                                            @ZA29164*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1757
*   IF R15^=ZERO THEN               /* ANY DATA TO BE MOVED  @ZA29164*/
         LTR   R15,R15                                             1757
         BZ    @RF01757                                            1757
*     DO;                           /* YES                   @ZA29164*/
*       SRA(R15,TWO);               /* DIVIDE LENGTH BY FOUR @ZA29164
*                                      TO GET NO. OF REGS    @ZA29164
*                                      FOR MOVE              @ZA29164*/
         SRA   R15,2                                               1759
*       R15=R15-ONE;                /* ADJUST REG COUNT      @ZA29164*/
         BCTR  R15,0                                               1760
*       SPKA(CCAUSKEY);             /* SWITCH TO USER KEY    @ZA29164*/
         SLR   @14,@14                                             1761
         IC    @14,CCAUSKEY(,R11)                                  1761
         SPKA  0(@14)                                              1761
*       GEN REFS(LOADREGS) SETS(R0,R1,R2,R3,R4,R5,R6,R7);          1762
*                                                     /*     @ZA29164*/
        EX R15,LOADREGS             /* LOAD REGISTERS        @ZA29164*/
*       GEN(SPKA 0);                /* SWITCH TO KEY 0       @ZA29164*/
         SPKA 0
*       GEN REFS(STORREGS) SETS(R0,R1,R2,R3,R4,R5,R6,R7);          1764
*                                                     /*     @ZA29164*/
        EX R15,STORREGS             /* STORE REGISTERS       @ZA29164*/
*     END;                          /*                       @ZA29164*/
*   ELSE                                                           1766
*     ;                             /* NO DATA TO BE MOVED   @ZA29164*/
@RF01757 DS    0H                                                  1767
*   GEN(LM R0,R4,12(13));           /* RESTORE REGS 0 TO 4   @ZA29164*/
         LM R0,R4,12(13)
*   CALL EXIT;                      /* RETURN TO CALLER              */
         BAL   @14,EXIT                                            1768
*   END;                            /* END OF INNER PROCEDURE        */
@EL00014 DS    0H                                                  1769
@EF00014 DS    0H                                                  1769
@ER00014 BR    @14                                                 1769
         EJECT
*                                                                  1770
*/********************************************************************/
*/*                                                                  */
*/*         RETURN-TO-CALLER  PROCEDURE-EXITING  SUBFUNCTION         */
*/*                                                                  */
*/********************************************************************/
*                                                                  1770
*EXIT:                                                             1770
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);/* SPECIFY PROCEDURE OPTIONS     */
EXIT     DS    0H                                                  1771
*   GEN(LM 12,14,0(13));            /* RESTORE REGISTERS OF CALLER   */
         LM 12,14,0(13)
*   GEN(MVI 12(13),255);            /* MARK END OF PDL               */
         MVI 12(13),255
*   GEN(BR 14);                     /* RETURN TO CALLER              */
         BR 14
*PATCH:                                                            1774
*   GEN(DC (12+((*+139-@MAINENT)/140))A(0));/* PATCH AREA            */
PATCH    DC (12+((*+139-@MAINENT)/140))A(0)
*   END;                            /* END OF EXIT PROCEDURE         */
@EL00015 DS    0H                                                  1775
@EF00015 DS    0H                                                  1775
@ER00015 BR    @14                                                 1775
*   END                             /*                       @ZA29164*/
*                                                                  1776
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */
*/*%INCLUDE SYSLIB  (IGGMCDCL)                                       */
*/*%INCLUDE SYSLIB  (IGGMCTRC)                                       */
*/*%INCLUDE SYSLIB  (IGGCCA  )                                       */
*/*%INCLUDE SYSLIB  (IEZCTGPL)                                       */
*/*%INCLUDE SYSLIB  (IEZCTGFL)                                       */
*/*%INCLUDE SYSLIB  (CVT     )                                       */
*/*%INCLUDE SYSLIB  (IKJTCB  )                                       */
*/*%INCLUDE SYSLIB  (IHAPSA  )                                       */
*/*%INCLUDE SYSLIB  (IFGACB  )                                       */
*/*%INCLUDE SYSLIB  (AMCBS   )                                       */
*/*%INCLUDE SYSLIB  (IGGCAXWA)                                       */
*/*%INCLUDE SYSLIB  (IEZCTGFV)                                       */
*/*%INCLUDE SYSLIB  (IEZCTGWA)                                       */
*/*%INCLUDE SYSLIB  (IEZCTGVL)                                       */
*/*%INCLUDE SYSLIB  (IEZCTGCV)                                       */
*/*%INCLUDE SYSLIB  (ICHACHKL)                                       */
*/*%INCLUDE SYSLIB  (ICHRDDFL)                                       */
*/*%INCLUDE SYSLIB  (IGGCICB )                                       */
*/*%INCLUDE SYSLIB  (IFGRPL  )                                       */
*/*%INCLUDE SYSLIB  (IDAAMBL )                                       */
*/*%INCLUDE SYSLIB  (IDAAMB  )                                       */
*/*%INCLUDE SYSLIB  (IDABUFC )                                       */
*/*%INCLUDE SYSLIB  (IGGMDRWA)                                       */
*/*%INCLUDE SYSLIB  (IHAASCB )                                       */
*/*%INCLUDE SYSLIB  (IGGMCMDM)                                       */
*/*%INCLUDE SYSLIB  (IHARB   )                                       */
*/*%INCLUDE SYSLIB  (IEZXRB  )                                       */
*/*%INCLUDE SYSLIB  (ICHRRPF )                                       */
*                                                                  1776
*       ;                                                          1776
@DATA    DS    0H
@CH04147 DC    H'2048'
@CH03916 DC    XL2'ACCA'
@DATD    DSECT
         DS    0F
@TF00001 DS    F
@TF00002 DS    F
IGG0CLC9 CSECT
         DS    0F
@CF00038 DC    F'1'
@CH00038 EQU   @CF00038+2
@CF00056 DC    F'2'
@CF00421 DC    F'3'
@CF00059 DC    F'4'
@CF00551 DC    F'7'
@CF00043 DC    F'8'
@CF00075 DC    F'12'
@CF00264 DC    F'16'
@CF00117 DC    F'28'
@CF00033 DC    F'31'
@CF00125 DC    F'44'
@CF00143 DC    F'80'
@CH00143 EQU   @CF00143+2
@CF00181 DC    F'132'
@CF00061 DC    F'256'
@CF01087 DC    F'512'
@CF04153 DC    F'716'
@CF03779 DC    F'4096'
@CF04150 DC    F'4992'
@CF04149 DC    F'5120'
@CF04152 DC    F'-1007091036'
@CF04155 DC    F'-1007090660'
@CF04165 DC    F'-80'
@CF04164 DC    XL4'0000FFFF'
@DATD    DSECT
         DS    0D
CDBPTR   DS    A
IGG0CLC9 CSECT
         DS    0F
@SIZDATD DC    AL1(0)
         DC    AL3(@ENDDATD-@DATD)
@CV03719 DC    V(IGGPACDV)
@CV03720 DC    V(IGGPARFS)
@CV03721 DC    V(IGGPCCCR)
@CV03722 DC    V(IGGPEMSG)
@CV03723 DC    V(IGGPRARC)
@CV03724 DC    V(IGGPRCCR)
@CV03725 DC    V(IGGPRPLF)
@CV03899 DC    V(IGGPRET1)
@CV04060 DC    V(IGGPCFVT)
         DS    0D
@CC03927 DC    C'CICB'
@CC03945 DC    C'C9'
ACWD     DC    X'00000003'
ROUNDUP  DC    X'FFFFFFFC'
MASKARAY DC    X'00000007'
         DC    X'00000003'
         DC    X'00000001'
MASKARBT DC    X'00000008'
         DC    X'0000000C'
         DC    X'0000000E'
IGG0CLC9 CSECT
*                                                          /*@Y30SSSM*/
MSG1     WTO   'IEC339I - IGG0CLC9,INSUFFICIENT STORAGE FOR VSAM CATALOX
               G WORK AREA',ROUTCDE=(11),MF=L                  @ZA29164
MSG2     WTO   'IEC338I - IGG0CLC9, VALIDITY CHECK FAILED ON CATALOG PAX
               RAMETER LIST STORAGE',ROUTCDE=(11),MF=L
IGG0CLC9 CSECT
*                                         /*INSTRUCTIONS     @ZA29164*/
         SPACE
LOADREGS LM 0,0,0(R8)               LOAD MULT REGS FROM        @ZA29164
*                                   KEY 0 AREA                 @ZA29164
STORREGS STM 0,0,0(R9)              STORE MULT REGS IN         @ZA29164
*                                   USER AREA                  @ZA29164
IGG0CLC9 CSECT
*                                   /* GENERATE ASSEMBLER CONSTANTS
*                                                            @ZA29164*/
FPSUBPOL DC    AL1(229)             /* FETCH PROTECTED SP ID @ZA29164*/
RADCON   DC    V(IGGPCMRR)              /*ADDR OF RCVY ROUT. @ZA26164*/
@DATD    DSECT
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA
@ENDDATD EQU   *
IGG0CLC9 CSECT
@00      EQU   00                      EQUATES FOR REGISTERS 0-15
@01      EQU   01
@02      EQU   02
@03      EQU   03
@04      EQU   04
@05      EQU   05
@06      EQU   06
@07      EQU   07
@08      EQU   08
@09      EQU   09
@10      EQU   10
@11      EQU   11
@12      EQU   12
@13      EQU   13
@14      EQU   14
@15      EQU   15
IGGSEGBR EQU   @12
IGGSEGB2 EQU   @10
RWA      EQU   @02
R0       EQU   @00
R1       EQU   @01
R2       EQU   @02
R3       EQU   @03
R4       EQU   @04
R5       EQU   @05
R6       EQU   @06
R7       EQU   @07
R8       EQU   @08
R9       EQU   @09
R11      EQU   @11
R12      EQU   @12
R13      EQU   @13
R14      EQU   @14
R15      EQU   @15
ASCBPTR  EQU   @02
I        EQU   @02
K        EQU   @03
J        EQU   @09
FPLPTR   EQU   @03
OLDCPL   EQU   @02
NFVTPTR  EQU   @05
OFVTPTR  EQU   @06
DATALNG  EQU   @08
KTESTFPL EQU   @08
UTESTFPL EQU   @09
OFFSET   EQU   @08
TESTRSLT EQU   @01
CPLRETCD EQU   @05
RET      EQU   @14
RFLD     EQU   @04
RGO      EQU   @15
RNDX     EQU   @03
RP0      EQU   @00
RP1      EQU   @01
RRPFPTR1 EQU   @02
RSAVE    EQU   @13
RWK1     EQU   @06
RWK2     EQU   @07
RWK3     EQU   @08
RWK4     EQU   @09
RZERO    EQU   @00
R10      EQU   @10
WKR2     EQU   @02
WKR3     EQU   @03
WKR4     EQU   @04
CVTPTR   EQU   16
PSA      EQU   0
FLCRNPSW EQU   PSA
FLCROPSW EQU   PSA+8
FLCICCW2 EQU   PSA+16
FLCCVT   EQU   FLCICCW2
PSAEEPSW EQU   PSA+132
PSAESPSW EQU   PSA+136
FLCSVILC EQU   PSAESPSW+1
PSAEPPSW EQU   PSA+140
FLCPIILC EQU   PSAEPPSW+1
FLCPICOD EQU   PSAEPPSW+2
PSAPICOD EQU   FLCPICOD+1
FLCTEA   EQU   PSAEPPSW+4
FLCPER   EQU   PSA+152
FLCMCLA  EQU   PSA+168
FLCIOEL  EQU   FLCMCLA+4
FLCIOA   EQU   FLCMCLA+16
FLCFSA   EQU   FLCMCLA+80
PSAAOLD  EQU   PSA+548
PSASUPER EQU   PSA+552
PSASUP1  EQU   PSASUPER
PSASUP2  EQU   PSASUPER+1
PSASUP3  EQU   PSASUPER+2
PSASUP4  EQU   PSASUPER+3
PSACLHT  EQU   PSA+640
PSALKSA  EQU   PSA+696
PSAHLHI  EQU   PSA+760
PSALITA  EQU   PSA+764
PSADSSFL EQU   PSA+836
PSADSSF1 EQU   PSADSSFL
PSADSSF3 EQU   PSADSSFL+2
PSADSSF4 EQU   PSADSSFL+3
PSARSVT  EQU   PSA+896
IGGCCA   EQU   0
CCAID    EQU   IGGCCA
CCASZ    EQU   IGGCCA+2
CCAPROB  EQU   IGGCCA+4
CCAMODID EQU   CCAPROB
CCAERRCD EQU   CCAPROB+2
CCAREASN EQU   CCAERRCD
CCACDR   EQU   CCAREASN
CCARETRN EQU   CCAERRCD+1
CCACD1   EQU   CCARETRN
CCACD2   EQU   IGGCCA+13
CCAFLG1  EQU   IGGCCA+14
CCAF1CR  EQU   CCAFLG1
CCAFLG2  EQU   IGGCCA+15
CCAF2SYS EQU   CCAFLG2
CCAF2COB EQU   CCAFLG2
CCAFLG3  EQU   IGGCCA+16
CCAFLG4  EQU   IGGCCA+17
CCAFLG5  EQU   IGGCCA+18
CCAFLG6  EQU   IGGCCA+19
CCATCB   EQU   IGGCCA+20
CCARB    EQU   IGGCCA+24
CCACPL   EQU   IGGCCA+28
CCAACB   EQU   IGGCCA+32
CCAURAB  EQU   IGGCCA+40
CCASRCH  EQU   IGGCCA+44
CCASRID  EQU   CCASRCH
CCARAB0  EQU   IGGCCA+88
CCAR0FLG EQU   CCARAB0
CCAR0REC EQU   CCARAB0+4
CCAR0SEG EQU   CCARAB0+8
CCARAB1  EQU   IGGCCA+108
CCAR1FLG EQU   CCARAB1
CCAR1REC EQU   CCARAB1+4
CCAR1SEG EQU   CCARAB1+8
CCARAB2  EQU   IGGCCA+128
CCAR2FLG EQU   CCARAB2
CCAR2REC EQU   CCARAB2+4
CCAR2SEG EQU   CCARAB2+8
CCARAB3  EQU   IGGCCA+148
CCAR3FLG EQU   CCARAB3
CCAR3REC EQU   CCARAB3+4
CCAR3SEG EQU   CCARAB3+8
CCARAB4  EQU   IGGCCA+168
CCAR4FLG EQU   CCARAB4
CCAR4REC EQU   CCARAB4+4
CCAR4SEG EQU   CCARAB4+8
CCARAB5  EQU   IGGCCA+188
CCAR5FLG EQU   CCARAB5
CCAR5REC EQU   CCARAB5+4
CCAR5SEG EQU   CCARAB5+8
CCATIQRN EQU   IGGCCA+212
CCARPL1  EQU   IGGCCA+220
CCADESA  EQU   IGGCCA+224
CCAEXTDE EQU   CCADESA+4
CCAEXTAD EQU   CCAEXTDE+2
CCAEQDQ  EQU   IGGCCA+280
CCAEDXFF EQU   CCAEQDQ
CCAEDOPT EQU   CCAEQDQ+2
CCAMLRET EQU   IGGCCA+296
CCAMSSPL EQU   IGGCCA+300
CCAMNLLP EQU   CCAMSSPL
CCAMNPTR EQU   CCAMSSPL+4
CCAMNSPL EQU   CCAMSSPL+9
CCACMS   EQU   IGGCCA+316
CCACPE5  EQU   IGGCCA+324
CCACPE6  EQU   IGGCCA+340
CCACPE61 EQU   IGGCCA+344
CCACPE7  EQU   IGGCCA+348
CCAFLPT  EQU   IGGCCA+364
CCADICT  EQU   IGGCCA+372
CCAXCPL  EQU   IGGCCA+376
CCALREL  EQU   IGGCCA+396
CCASN    EQU   IGGCCA+398
CCAUSKEY EQU   IGGCCA+400
CCAMSFLG EQU   IGGCCA+401
CCACICIN EQU   CCAMSFLG
CCACPLOK EQU   CCAMSFLG
CCASKYSS EQU   CCAMSFLG
CCAGDGUY EQU   CCAMSFLG
CCARBA   EQU   IGGCCA+448
CCACRAVL EQU   CCARBA
CCACRADT EQU   CCARBA+6
CCATLNG  EQU   IGGCCA+468
CCAIDPT3 EQU   IGGCCA+480
CCAGRGC  EQU   IGGCCA+493
CCAGRHI  EQU   IGGCCA+494
CCASSEQ  EQU   CCAGRHI
CCACWAP  EQU   IGGCCA+524
CCAFLG7  EQU   IGGCCA+552
CCAFLG8  EQU   IGGCCA+553
CCAFLG9  EQU   IGGCCA+554
CCASMFLG EQU   IGGCCA+562
CCASMFG1 EQU   CCASMFLG
CCASMFUC EQU   CCASMFG1
CCASMFSR EQU   CCASMFG1
CCAR14S  EQU   IGGCCA+680
CCABMINP EQU   IGGCCA+684
CCABMFLG EQU   CCABMINP+6
CCABMOUT EQU   IGGCCA+692
CCABMOFG EQU   CCABMOUT+4
CCATEMPS EQU   IGGCCA+744
CCAMNCAT EQU   IGGCCA+784
CCAMNAT  EQU   CCAMNCAT
MNATTOP  EQU   CCAMNAT
MNATFULL EQU   MNATTOP
MNATFLGS EQU   CCAMNAT+240
MNATSCLS EQU   MNATFLGS
CCAMNLL  EQU   CCAMNCAT+248
CCAMNLEN EQU   CCAMNCAT+249
CCAMNADR EQU   CCAMNCAT+252
CCAARFWA EQU   IGGCCA+1040
ARFGMLEN EQU   CCAARFWA
ARFSBSCH EQU   CCAARFWA+8
CCARVFG1 EQU   IGGCCA+1056
RVCCAV   EQU   CCARVFG1
CCAFLG11 EQU   IGGCCA+1059
CCAREGS  EQU   IGGCCA+1060
CCABZSAV EQU   IGGCCA+1408
CCARAACB EQU   IGGCCA+1424
CCARARPL EQU   IGGCCA+1428
CCARARBA EQU   IGGCCA+1432
CCARALSA EQU   IGGCCA+1440
CCAFLG10 EQU   IGGCCA+1444
CCAPDMW  EQU   CCAFLG10
CCASMFP  EQU   IGGCCA+1480
CCAPROBX EQU   IGGCCA+1484
CCAERCDX EQU   CCAPROBX+2
CCADGDGA EQU   IGGCCA+1488
CCAREQDQ EQU   IGGCCA+1492
CCAREDOP EQU   CCAREQDQ+2
CCAOCPL  EQU   IGGCCA+1504
CCAEND   EQU   IGGCCA+1548
CTGPL    EQU   0
CTGOPTN1 EQU   CTGPL
CTGNAME  EQU   CTGOPTN1
CTGCNAME EQU   CTGOPTN1
CTGGENLD EQU   CTGOPTN1
CTGOPTN2 EQU   CTGPL+1
CTGEXT   EQU   CTGOPTN2
CTGERASE EQU   CTGOPTN2
CTGSMF   EQU   CTGERASE
CTGREL   EQU   CTGSMF
CTGPURG  EQU   CTGOPTN2
CTGVMNT  EQU   CTGPURG
CTGRCATN EQU   CTGVMNT
CTGGTNXT EQU   CTGOPTN2
CTGOPTN3 EQU   CTGPL+2
CTGFUNC  EQU   CTGOPTN3
CTGSUPLT EQU   CTGOPTN3
CTGAM0   EQU   CTGOPTN3
CTGOPTN4 EQU   CTGPL+3
CTGENT   EQU   CTGPL+4
CTGFVT   EQU   CTGENT
CTGCAT   EQU   CTGPL+8
CTGCVOL  EQU   CTGCAT
CTGWKA   EQU   CTGPL+12
CTGDSORG EQU   CTGPL+16
CTGOPTNS EQU   CTGDSORG
CTGNOFLD EQU   CTGPL+19
CTGDDNM  EQU   CTGPL+20
CTGNEWNM EQU   CTGDDNM
CTGFBFLG EQU   CTGNEWNM+2
CTGJSCB  EQU   CTGPL+24
CTGPSWD  EQU   CTGJSCB
CTGFIELD EQU   CTGPL+28
CTGFL    EQU   0
CTGFLDNO EQU   CTGFL
CTGFLDGC EQU   CTGFL+2
CTGFLDRE EQU   CTGFL+3
CTGFLDWA EQU   CTGFL+4
CTGFLDNM EQU   CTGFL+8
CTGFLCHN EQU   CTGFL+12
CTGFLDAT EQU   CTGFL+16
CTGFLNG  EQU   CTGFLDAT
CTGFLPT  EQU   CTGFLDAT+4
USERWKA  EQU   0
WKALEN1  EQU   USERWKA
WKA      EQU   USERWKA+4
ENTNAMES EQU   WKA
DICTENT  EQU   0
DICTFLGS EQU   DICTENT
DIC2ENT  EQU   0
DIC2FLGS EQU   DIC2ENT
CCARAB   EQU   0
CCARABFL EQU   CCARAB
CCACPE1  EQU   CCARAB+4
CCACPE2  EQU   CCARAB+8
CATGOPT  EQU   0
CATGOCI  EQU   CATGOPT
CATGOFLG EQU   CATGOCI
CATGOGC1 EQU   CATGOPT+3
CATGOSEQ EQU   CATGOPT+4
CATRCD   EQU   0
RCDSECF  EQU   CATRCD+26
NREPLF   EQU   CATRCD+48
REPCNTRL EQU   0
EXTRCDPT EQU   REPCNTRL
VARFIELD EQU   0
CNTRLINF EQU   0
LENFIX   EQU   CNTRLINF+1
CVTMAP   EQU   0
CVT      EQU   CVTMAP
CVTTCBP  EQU   CVTMAP
CVTDAR   EQU   CVTMAP+72
CVTFLGS1 EQU   CVTDAR
CVTDCB   EQU   CVTMAP+116
CVTIOQET EQU   CVTMAP+120
CVTIERLC EQU   CVTMAP+144
CVTHEAD  EQU   CVTMAP+160
CVTSV76C EQU   CVTHEAD
CVTOPTA  EQU   CVTMAP+182
CVTOPTB  EQU   CVTMAP+183
CVTGTF   EQU   CVTMAP+236
CVTGTFST EQU   CVTGTF
CVTGTFS  EQU   CVTGTFST
CVTSTATE EQU   CVTGTFST
CVTTMODE EQU   CVTGTFST
CVTFORM  EQU   CVTGTFST
CVTAQAVT EQU   CVTMAP+240
CVTTCMFG EQU   CVTAQAVT
CVTVOLM2 EQU   CVTMAP+244
CVTTATA  EQU   CVTVOLM2
CVTTSKS  EQU   CVTTATA
CVTVOLF2 EQU   CVTTSKS
CVTTAT   EQU   CVTTATA+1
CVTATER  EQU   CVTMAP+248
CVTEXT1  EQU   CVTMAP+252
CVTCBSP  EQU   CVTMAP+256
CVTPURG  EQU   CVTMAP+260
CVTAMFF  EQU   CVTMAP+264
CVTQMSG  EQU   CVTMAP+268
CVTDMSR  EQU   CVTMAP+272
CVTRSV37 EQU   CVTDMSR
CVTDMSRF EQU   CVTRSV37
CVTERPV  EQU   CVTMAP+316
CVTINTLA EQU   CVTMAP+320
CVTAPF   EQU   CVTMAP+324
CVTEXT2  EQU   CVTMAP+328
CVTHJES  EQU   CVTMAP+332
CVTPGSIA EQU   CVTMAP+348
CVTA1F1  EQU   CVTMAP+356
CVTSYSK  EQU   CVTMAP+357
CVTVOLM1 EQU   CVTMAP+380
CVTVOLF1 EQU   CVTVOLM1
CVTATMCT EQU   CVTMAP+388
CVTXTNT1 EQU   0
CVTXTNT2 EQU   0
CVTDSSV  EQU   CVTXTNT2
CVTFLGBT EQU   CVTXTNT2+5
CVTQID   EQU   CVTXTNT2+24
CVTRV400 EQU   CVTXTNT2+52
CVTRV409 EQU   CVTXTNT2+53
CVTATCVT EQU   CVTXTNT2+64
CVTRV429 EQU   CVTXTNT2+84
CVTRV438 EQU   CVTXTNT2+85
CVTRV457 EQU   CVTXTNT2+112
CVTRV466 EQU   CVTXTNT2+113
CVTFIX   EQU   0
CVTRELNO EQU   CVTFIX+252
TCBWORDS EQU   0
TCBPTR   EQU   TCBWORDS+4
TCBFIX   EQU   0
TCBFRS   EQU   TCBFIX
TCB      EQU   0
TCBRBP   EQU   TCB
TCBPIE   EQU   TCB+4
TCBPMASK EQU   TCBPIE
TCBCMP   EQU   TCB+16
TCBCMPF  EQU   TCBCMP
TCBCPP   EQU   TCBCMPF
TCBSTCC  EQU   TCBCMPF
TCBCDBL  EQU   TCBCMPF
TCBCWTO  EQU   TCBCMPF
TCBCIND  EQU   TCBCMPF
TCBCMSG  EQU   TCBCMPF
TCBTRN   EQU   TCB+20
TCBABF   EQU   TCBTRN
TCBMSS   EQU   TCB+24
TCBPKF   EQU   TCB+28
TCBFLGS  EQU   TCB+29
TCBFLGS1 EQU   TCBFLGS
TCBFLGS2 EQU   TCBFLGS+1
TCBFLGS3 EQU   TCBFLGS+2
TCBFLGS4 EQU   TCBFLGS+3
TCBFLGS5 EQU   TCBFLGS+4
TCBABWF  EQU   TCBFLGS5
TCBJPQ   EQU   TCB+44
TCBPURGE EQU   TCBJPQ
TCBGRS   EQU   TCB+48
TCBFSA   EQU   TCB+112
TCBTME   EQU   TCB+120
TCBJSTCB EQU   TCB+124
TCBTSFLG EQU   TCB+148
TCBTSTSK EQU   TCBTSFLG
TCBSTAB  EQU   TCB+160
TCBNSTAE EQU   TCBSTAB
TCBTCT   EQU   TCB+164
TCBTCTGF EQU   TCBTCT
TCBSCNDY EQU   TCB+172
TCBNDSP  EQU   TCBSCNDY
TCBNDSP1 EQU   TCBNDSP+1
TCBNDSP2 EQU   TCBNDSP+2
TCBNDSP3 EQU   TCBNDSP+3
TCBJSCB  EQU   TCB+180
TCBRECDE EQU   TCBJSCB
TCBEXT1  EQU   TCB+196
TCBBITS  EQU   TCB+200
TCBNDSP4 EQU   TCBBITS
TCBNDSP5 EQU   TCBBITS+1
TCBFLGS6 EQU   TCBBITS+2
TCBFLGS7 EQU   TCBBITS+3
TCBDAR   EQU   TCB+204
TCBDARC  EQU   TCBDAR
TCBEXT2  EQU   TCB+208
TCBXSCT  EQU   TCB+240
TCBXSCT1 EQU   TCBXSCT
TCBFOE   EQU   TCB+244
TCBSTAWA EQU   TCB+252
TCBESTAE EQU   TCB+264
TCBESTRM EQU   TCBESTAE+1
TCBFBYT1 EQU   TCB+276
TCBFBYT2 EQU   TCB+277
TCBRV124 EQU   TCB+278
TCBRV133 EQU   TCB+279
TCBXTNT2 EQU   0
TCBGTF   EQU   TCBXTNT2
TCBTFLG  EQU   TCBGTF
TCBRV146 EQU   TCBXTNT2+28
TCBRV155 EQU   TCBXTNT2+29
TCBRV164 EQU   TCBXTNT2+30
TCBRV173 EQU   TCBXTNT2+31
IFGACB   EQU   0
ACBCOMN  EQU   IFGACB
ACBLENG  EQU   ACBCOMN+2
ACBLENG2 EQU   ACBLENG
ACBAMBL  EQU   ACBCOMN+4
ACBJWA   EQU   ACBAMBL
ACBMACRF EQU   ACBCOMN+12
ACBMACR1 EQU   ACBMACRF
ACBADR   EQU   ACBMACR1
ACBCNV   EQU   ACBMACR1
ACBMACR2 EQU   ACBMACRF+1
ACBBUFPL EQU   ACBCOMN+20
ACBMACR3 EQU   ACBBUFPL
ACBRECFM EQU   ACBCOMN+24
ACBCCTYP EQU   ACBCOMN+25
ACBOPT   EQU   ACBCOMN+26
ACBDSORG EQU   ACBOPT
ACBCROPS EQU   ACBDSORG
ACBDVIND EQU   ACBDSORG
ACBEXLST EQU   ACBCOMN+36
ACBDDNM  EQU   ACBCOMN+40
ACBAMETH EQU   ACBDDNM+3
ACBOFLGS EQU   ACBCOMN+48
ACBOPEN  EQU   ACBOFLGS
ACBEXFG  EQU   ACBOFLGS
ACBIOSFG EQU   ACBOFLGS
ACBINFLG EQU   ACBCOMN+50
ACBINFL1 EQU   ACBINFLG
ACBSCRA  EQU   ACBINFL1
ACBUCRA  EQU   ACBINFL1
ACBVVIC  EQU   ACBINFL1
ACBINFL2 EQU   ACBINFLG+1
ACBUJFCB EQU   ACBCOMN+52
ACBBLKSZ EQU   ACBCOMN+60
ACBUAPTR EQU   ACBCOMN+64
AMCBS    EQU   0
CBSCMP   EQU   AMCBS+16
CBSCRACA EQU   AMCBS+24
CBSCRTCB EQU   AMCBS+28
CBSVSRT  EQU   AMCBS+32
TNAM     EQU   0
NOBASE   EQU   0
IGGCAXWA EQU   0
CAXFLGS  EQU   IGGCAXWA+8
CAXBLD   EQU   CAXFLGS
CAXOPN   EQU   CAXFLGS
CAXCLS   EQU   CAXFLGS
CAXCMR   EQU   CAXFLGS
CAXSCR   EQU   CAXFLGS
CAXFLG2  EQU   IGGCAXWA+9
CAXF2REC EQU   CAXFLG2
CAXFLG3  EQU   IGGCAXWA+10
CAXRAC   EQU   CAXFLG3
CAXSCHWA EQU   IGGCAXWA+16
CAXDRWP  EQU   IGGCAXWA+20
CAXACB   EQU   IGGCAXWA+24
CAXCCR   EQU   IGGCAXWA+32
CAXASID  EQU   IGGCAXWA+44
CAXRPLCT EQU   IGGCAXWA+46
CAXRPL   EQU   IGGCAXWA+48
CAXCNAM  EQU   IGGCAXWA+52
CAXOPLST EQU   IGGCAXWA+96
COPTS    EQU   CAXOPLST
COPACB   EQU   CAXOPLST+1
CAXCCA   EQU   IGGCAXWA+104
CAXRACP  EQU   IGGCAXWA+116
CAXECB   EQU   IGGCAXWA+120
CAXECBHB EQU   CAXECB
CAXHRPLW EQU   IGGCAXWA+128
CTGFV    EQU   0
CTGFVPRO EQU   CTGFV+1
CTGFVDCH EQU   CTGFV+4
CTGFVICH EQU   CTGFV+8
CTGFVVCH EQU   CTGFV+12
CTGFVVLT EQU   CTGFV+40
CTGFVSPC EQU   CTGFV+52
CTGFVAMD EQU   CTGFV+56
CTGFVLMT EQU   CTGFV+72
CTGFVGAT EQU   CTGFV+76
CTGFVPWD EQU   CTGFV+84
CTGFVWKA EQU   CTGFV+88
CTGWA    EQU   0
CTGWAVL  EQU   CTGWA
CTGVL    EQU   0
CTGVLX   EQU   0
CTGCV    EQU   0
CTGCVDSN EQU   CTGCV+6
ACHKLIST EQU   0
ACHKINSW EQU   ACHKLIST
ACHKENTW EQU   ACHKLIST+4
ACHKFLG1 EQU   ACHKENTW
ACHKENT  EQU   ACHKENTW+1
ACHKCLNW EQU   ACHKLIST+8
ACHKFLG2 EQU   ACHKCLNW
ACHKVOLW EQU   ACHKLIST+12
ACHKFLG3 EQU   ACHKVOLW
RDDFLIST EQU   0
RDDFINSW EQU   RDDFLIST
RDDFENTW EQU   RDDFLIST+4
RDDFFLGS EQU   RDDFENTW
RDDFOVOL EQU   RDDFLIST+8
MWA      EQU   0
VLST     EQU   MWA+2
CVOLIND  EQU   MWA+252
IGGCICB  EQU   0
CICBID   EQU   IGGCICB
CICFLAGS EQU   IGGCICB+4
CICCOUNT EQU   CICFLAGS
CICPTRSW EQU   CICFLAGS
CICFPLOP EQU   CICFLAGS
CICPASWD EQU   CICFLAGS
CICGEOPR EQU   IGGCICB+8
CICINCRM EQU   IGGCICB+12
CICSVADR EQU   IGGCICB+24
CICFPLDI EQU   IGGCICB+28
CICFPLLP EQU   IGGCICB+32
CICBKPTR EQU   IGGCICB+40
CICBKLNG EQU   IGGCICB+44
CICNXTBK EQU   IGGCICB+48
CICRMBYT EQU   IGGCICB+52
CICGMCNT EQU   IGGCICB+56
CICRAREA EQU   IGGCICB+60
CICCISAP EQU   IGGCICB+64
CICCISSP EQU   IGGCICB+68
CICSABYT EQU   IGGCICB+72
CICCICAB EQU   IGGCICB+76
CICPRFPL EQU   IGGCICB+80
CICREGSV EQU   IGGCICB+84
CICMRGSV EQU   IGGCICB+88
IFGRPL   EQU   0
RPLCOMN  EQU   IFGRPL
RPLIDWD  EQU   RPLCOMN
RPLLEN   EQU   RPLIDWD+3
RPLECB   EQU   RPLCOMN+8
RPLFDBWD EQU   RPLCOMN+12
RPLFDBK  EQU   RPLFDBWD+1
RPLRTNCD EQU   RPLFDBK
RPLCNDCD EQU   RPLFDBK+1
RPLCMPON EQU   RPLCNDCD
RPLFDB2  EQU   RPLCMPON
RPLERRCD EQU   RPLCNDCD+1
RPLFDB3  EQU   RPLERRCD
RPLKEYLE EQU   RPLCOMN+16
RPLDACB  EQU   RPLCOMN+24
RPLARG   EQU   RPLCOMN+36
RPLOPTCD EQU   RPLCOMN+40
RPLOPT1  EQU   RPLOPTCD
RPLDIR   EQU   RPLOPT1
RPLSEQ   EQU   RPLOPT1
RPLECBSW EQU   RPLOPT1
RPLOPT2  EQU   RPLOPTCD+1
RPLADR   EQU   RPLOPT2
RPLCNV   EQU   RPLOPT2
RPLOPT3  EQU   RPLOPTCD+2
RPLOPT4  EQU   RPLOPTCD+3
RPLNXTRP EQU   RPLCOMN+44
RPLBUFL  EQU   RPLCOMN+52
RPLOPTC2 EQU   RPLCOMN+56
RPLOPT5  EQU   RPLOPTC2
RPLWRTYP EQU   RPLOPT5
RPLOPT6  EQU   RPLOPTC2+1
RPLUNTYP EQU   RPLOPT6
RPLOPT7  EQU   RPLOPTC2+2
RPLCNOPT EQU   RPLOPT7
RPLOPT8  EQU   RPLOPTC2+3
RPLRBAR  EQU   RPLCOMN+60
RPLAIXID EQU   RPLRBAR+2
RPLEXTDS EQU   RPLCOMN+68
RPLEXTD1 EQU   RPLEXTDS
RPLACTIV EQU   RPLCOMN+69
XTNDRPL  EQU   0
RXTN     EQU   XTNDRPL+76
RPLPOOL  EQU   0
IDAAMBL  EQU   0
AMBLEOV  EQU   IDAAMBL+12
AMBLEFLG EQU   AMBLEOV
AMBLDDNM EQU   IDAAMBL+16
AMBLIDF  EQU   AMBLDDNM
AMBLQ    EQU   AMBLIDF+7
AMBLVC   EQU   IDAAMBL+28
AMBLTYPE EQU   IDAAMBL+30
AMBLQ2   EQU   IDAAMBL+31
AMBLSHAR EQU   IDAAMBL+33
AMBLFLG1 EQU   IDAAMBL+35
AMBLVVIC EQU   AMBLFLG1
AMBLFLG2 EQU   IDAAMBL+36
AMBLDTA  EQU   IDAAMBL+52
IDAAMB   EQU   0
AMBBUFC  EQU   IDAAMB+8
AMBEOVR  EQU   IDAAMB+24
AMBFLG0  EQU   AMBEOVR
AMBFLG1  EQU   IDAAMB+25
AMBDSORG EQU   IDAAMB+26
AMBIOBAD EQU   IDAAMB+28
AMBINFL  EQU   IDAAMB+42
AMBDEBPT EQU   IDAAMB+44
AMBOFLGS EQU   IDAAMB+48
AMBFLG2  EQU   IDAAMB+49
AMBEOVPT EQU   IDAAMB+56
AMBCSWD1 EQU   IDAAMB+84
AMBAFLG  EQU   AMBCSWD1
IDABUFDR EQU   0
BUFDRNO  EQU   IDABUFDR+1
BUFDRCIX EQU   IDABUFDR+9
BUFDRFLG EQU   IDABUFDR+11
IDABUFC  EQU   0
BUFCAVL  EQU   IDABUFC
BUFCFLG1 EQU   IDABUFC+1
BUFCIOFL EQU   IDABUFC+2
BUFCFLG2 EQU   IDABUFC+3
BUFCPLH  EQU   IDABUFC+4
BUFCINV  EQU   IDABUFC+28
IGGMDRWA EQU   0
DRWDEB   EQU   IGGMDRWA
DRWECB   EQU   IGGMDRWA+52
DRWIOB   EQU   IGGMDRWA+56
DRWSEEK  EQU   IGGMDRWA+88
DRWCCW   EQU   IGGMDRWA+96
DRWRIA   EQU   IGGMDRWA+204
ASCB     EQU   0
ASCBSUPC EQU   ASCB+16
ASCBASID EQU   ASCB+36
ASCBRSM  EQU   ASCB+52
ASCBRSMF EQU   ASCBRSM
ASCBFW1  EQU   ASCB+100
ASCBRCTF EQU   ASCBFW1+2
ASCBFLG1 EQU   ASCBFW1+3
ASCBDSP1 EQU   ASCB+114
ASCBFLG2 EQU   ASCB+115
ASCBLKGP EQU   ASCB+128
ASCBSRQ  EQU   ASCB+180
ASCBSRQ1 EQU   ASCBSRQ
ASCBSRQ2 EQU   ASCBSRQ+1
ASCBSRQ3 EQU   ASCBSRQ+2
ASCBSRQ4 EQU   ASCBSRQ+3
ASGO     EQU   1
PASSGO   EQU   1
PASSWORD EQU   PASSGO
USERAREC EQU   PASSGO+50
USERLIST EQU   0
LTLENGTH EQU   USERLIST
LTENTRY  EQU   USERLIST+2
LTRETCOD EQU   LTENTRY
SPACEPRM EQU   0
SPCOPTNS EQU   SPACEPRM+6
CTGDSATR EQU   0
CTGATR1  EQU   CTGDSATR
CTGATR2  EQU   CTGDSATR+1
RGATTRFL EQU   0
RGATTR1  EQU   RGATTRFL
RGATTSG1 EQU   RGATTRFL+1
DEVCHARS EQU   0
RTDEVUCB EQU   DEVCHARS
RTBOKAB  EQU   DEVCHARS+14
RTDVFLGS EQU   DEVCHARS+17
RBPRFX   EQU   0
RBBASIC  EQU   0
RBEXRTNM EQU   RBBASIC
RBTMFLD  EQU   RBEXRTNM
RBSTAB   EQU   RBBASIC+10
XSTAB    EQU   RBSTAB
RBSTAB1  EQU   XSTAB
XSTAB1   EQU   RBSTAB1
RBFTCKPT EQU   XSTAB1
RBSTAB2  EQU   XSTAB+1
XSTAB2   EQU   RBSTAB2
RBTCBNXT EQU   XSTAB2
RBFACTV  EQU   XSTAB2
RBFDYN   EQU   XSTAB2
RBECBWT  EQU   XSTAB2
RBOPSW   EQU   RBBASIC+16
XRBPSW   EQU   RBOPSW
RBOPSWB2 EQU   XRBPSW+1
RBLINK   EQU   RBBASIC+28
XRBLNK   EQU   RBLINK
RBWCF    EQU   XRBLNK
RBLINKB  EQU   XRBLNK+1
RBGRSAVE EQU   RBBASIC+32
XRBREG   EQU   RBGRSAVE
RBGRS0   EQU   XRBREG
RBGRS1   EQU   XRBREG+4
RBGRS2   EQU   XRBREG+8
RBGRS3   EQU   XRBREG+12
RBGRS4   EQU   XRBREG+16
RBGRS5   EQU   XRBREG+20
RBGRS6   EQU   XRBREG+24
RBGRS7   EQU   XRBREG+28
RBGRS8   EQU   XRBREG+32
RBGRS9   EQU   XRBREG+36
RBGRS10  EQU   XRBREG+40
RBGRS11  EQU   XRBREG+44
RBGRS12  EQU   XRBREG+48
RBGRS13  EQU   XRBREG+52
RBGRS14  EQU   XRBREG+56
RBGRS15  EQU   XRBREG+60
XRBESA   EQU   RBBASIC+96
XRBPRFX  EQU   0
XRBPRFX1 EQU   0
XRB      EQU   0
@NM00178 EQU   XRB+10
@NM00179 EQU   @NM00178
XRBLRBFX EQU   @NM00179
@NM00181 EQU   @NM00178+1
@NM00182 EQU   @NM00181
@NM00183 EQU   @NM00181
XRBWTL   EQU   XRB+12
XRBEP    EQU   XRBWTL
@NM00186 EQU   XRB+16
XRTLPRB  EQU   @NM00186+4
XRBLOCK  EQU   XRTLPRB
XRBFLAG1 EQU   XRBLOCK
@NM00189 EQU   XRB+28
CDB      EQU   0
CDBMDAD  EQU   CDB
CDBMDSZ  EQU   CDB+4
RRPF     EQU   0
RRPSP    EQU   RRPF
RRPLEN   EQU   RRPF+1
RBRPSW   EQU   0
RBPSWKEY EQU   RBRPSW+1
RBRPSWPS EQU   RBPSWKEY
FNAMOUTP EQU   0
CHAR24   EQU   0
CHAR20   EQU   0
BLOCKPTR EQU   0
FNAMINPT EQU   0
USERDATA EQU   0
OUTAREA  EQU   0
RA0      EQU   0
RIPWA    EQU   0
RIPLSA   EQU   RIPWA
RIPLSA12 EQU   RIPLSA+8
RIPRSA   EQU   RIPWA+60
RIPEPA   EQU   RIPWA+132
ARFSB    EQU   0
SBCHN    EQU   ARFSB
IGC0002F EQU   0
OPTBITS  EQU   IGC0002F+640
XCTLLIST EQU   IGC0002F+644
CALLTYPE EQU   IGC0002F+668
ESTALIST EQU   IGC0002F+672
PARMLIST EQU   IGC0002F+684
ACCA     EQU   IGC0002F+752
CVOLWA   EQU   0
CVOLRNAM EQU   CVOLWA+500
BUFSIZE  EQU   0
CATRECRD EQU   0
CATSN    EQU   0
CI       EQU   0
CTGVLDSP EQU   0
DATEFLD  EQU   0
ENTRYNAM EQU   0
EXCPNAME EQU   0
FIELDNM  EQU   0
FVTWKOVY EQU   0
LRECL    EQU   0
OWNIDFLD EQU   0
@NM00038 EQU   CTGDDNM
CTGPROB  EQU   @NM00038
CTGMODID EQU   CTGPROB
CTGREASN EQU   CTGPROB+2
CTGREAS1 EQU   CTGREASN
CTGREAS2 EQU   CTGREASN+1
CVTS01   EQU   CVTPGSIA
CVTLPDIA EQU   CVTS01+12
CVTDIRST EQU   CVTLPDIA
CVTSLIDA EQU   CVTS01+24
CVTCTLFG EQU   CVTS01+50
CVTSV60  EQU   CVTS01+228
CVTRV210 EQU   CVTS01+424
CVTRV219 EQU   CVTS01+425
CVTRV228 EQU   CVTS01+426
CVTRV237 EQU   CVTS01+427
CVTMFRTR EQU   CVTS01+452
CVTRV262 EQU   CVTS01+468
CVTRV271 EQU   CVTS01+469
CVTRV280 EQU   CVTS01+470
CVTRV289 EQU   CVTS01+471
CVTGSDA  EQU   CVTS01+600
FLC      EQU   PSA
PSARSVTE EQU   PSARSVT
MCATDSTR EQU   CVTAMFF
CVTAMF1  EQU   MCATDSTR
CTGRBASE EQU   NREPLF+1
CATTR    EQU   CTGRBASE+58
CATTR1   EQU   CATTR
CATTR2   EQU   CATTR+1
COPEN    EQU   CTGRBASE+60
CSPACPRM EQU   CTGRBASE+65
@NM00155 EQU   CATTR1
CCATTR   EQU   @NM00155
@NM00156 EQU   CCATTR
@NM00158 EQU   CATTR1
CRGATTR  EQU   @NM00158
CUPG     EQU   CRGATTR
@NM00196 EQU   CVTAMFF
DBGFL    EQU   @NM00196
DBGMSG   EQU   DBGFL
DBGARG   EQU   @NM00196+1
DBGINST  EQU   @NM00196+2
CPLFLAGS EQU   CTGPL
CPLCMSCD EQU   CTGDSORG
CCACD1X  EQU   CCAPROBX+3
FPLRLTOV EQU   CTGFL
DBMSGAR  EQU   CCAREGS+12
DBSAVAR  EQU   RA0+416
@NM00199 EQU   XRBESA
CLA1ADR  EQU   @NM00199
CPLSAV   EQU   @NM00199+4
CTLWAPTR EQU   @NM00199+12
SCHWA    EQU   CCAEND
ACHKPROF EQU   ACHKENT
BUFCRSC1 EQU   BUFCAVL
DRWDCB   EQU   DRWDEB+4
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS
SCHCNSAV EQU   SCHWA+468
SCHNQPL  EQU   SCHWA+456
SCHXTBL  EQU   SCHWA+200
SCHLKPL  EQU   SCHWA+184
@NM00202 EQU   SCHWA+182
SCHACPL  EQU   SCHWA+136
CHHQN    EQU   SCHWA+92
SCHEN    EQU   SCHWA+48
@NM00201 EQU   SCHWA+47
SCHTNE   EQU   SCHWA
PARMAREA EQU   @NM00199+20
GMADDR   EQU   @NM00199+16
MAINRTN  EQU   @NM00199+8
DBGERECA EQU   DBGFL
@NM00198 EQU   DBGFL
DBGVOCE  EQU   DBGFL
@NM00197 EQU   DBGFL
@NM00159 EQU   CRGATTR
CUPD     EQU   CUPG
CPGSP    EQU   @NM00156
CSWAPSPC EQU   @NM00156
@NM00157 EQU   @NM00156
CEXT     EQU   CTGRBASE+86
CDOSUINF EQU   CTGRBASE+84
CLRECL   EQU   CTGRBASE+80
CHIA     EQU   CTGRBASE+76
CHIU     EQU   CTGRBASE+72
CSORT    EQU   CSPACPRM+6
CSEC     EQU   CSPACPRM+3
CPRIM    EQU   CSPACPRM
CBUF     EQU   CTGRBASE+61
@NM00154 EQU   COPEN
COPENDS  EQU   COPEN
CNUS     EQU   CATTR2
CATTISDS EQU   CATTR2
@NM00153 EQU   CATTR2
CATTRSSH EQU   CATTR2
CATTRISH EQU   CATTR2
CTRKOV   EQU   CATTR1
CTEMP    EQU   CATTR1
CINHIB   EQU   CATTR1
CRECOV   EQU   CATTR1
CERASE   EQU   CATTR1
CREUSE   EQU   CATTR1
CUNIQ    EQU   CATTR1
CSP      EQU   CATTR1
CEXP     EQU   CTGRBASE+55
CCRE     EQU   CTGRBASE+52
COWNID   EQU   CTGRBASE+44
CNAME    EQU   CTGRBASE
@NM00091 EQU   MCATDSTR+1
@NM00090 EQU   CVTAMF1
AMF1NONX EQU   CVTAMF1
AMF1OPEN EQU   CVTAMF1
PSARSAV  EQU   PSARSVTE+60
PSARSTK  EQU   PSARSVTE+56
PSAESAV3 EQU   PSARSVTE+52
PSAESTK3 EQU   PSARSVTE+48
PSAESAV2 EQU   PSARSVTE+44
PSAESTK2 EQU   PSARSVTE+40
PSAESAV1 EQU   PSARSVTE+36
PSAESTK1 EQU   PSARSVTE+32
PSAPSAV  EQU   PSARSVTE+28
PSAPSTK  EQU   PSARSVTE+24
PSAMSAV  EQU   PSARSVTE+20
PSAMSTK  EQU   PSARSVTE+16
PSASSAV  EQU   PSARSVTE+12
PSASSTK  EQU   PSARSVTE+8
PSANSTK  EQU   PSARSVTE+4
PSACSTK  EQU   PSARSVTE
CVTRV628 EQU   CVTS01+728
CVTRV627 EQU   CVTS01+724
CVTRV626 EQU   CVTS01+720
CVTRV625 EQU   CVTS01+716
CVTRV624 EQU   CVTS01+712
CVTRV623 EQU   CVTS01+708
CVTRV622 EQU   CVTS01+704
CVTRV621 EQU   CVTS01+700
CVTIHASU EQU   CVTS01+696
CVTSUSP  EQU   CVTS01+692
CVTT6SVC EQU   CVTS01+688
CVTCDAL  EQU   CVTS01+684
CVTTCTL  EQU   CVTS01+680
CVTRSUME EQU   CVTS01+676
CVTJTERM EQU   CVTS01+672
CVTASMRM EQU   CVTS01+668
CVTTCASP EQU   CVTS01+664
CVT0PT03 EQU   CVTS01+660
CVT0PT0E EQU   CVTS01+656
CVTRV609 EQU   CVTS01+652
CVTCGK   EQU   CVTS01+648
CVTRAC   EQU   CVTS01+644
CVTHSM   EQU   CVTS01+640
CVTRV605 EQU   CVTS01+636
CVTRV604 EQU   CVTS01+632
CVTEFF02 EQU   CVTS01+628
CVTCBBR  EQU   CVTS01+624
CVTSSCR  EQU   CVTS01+620
CVTEVENT EQU   CVTS01+616
CVTCRCA  EQU   CVTS01+612
CVTTPIO  EQU   CVTS01+608
CVTADV   EQU   CVTS01+604
CVTGSDAB EQU   CVTGSDA
CVTQV3   EQU   CVTS01+596
CVTQV2   EQU   CVTS01+592
CVTQV1   EQU   CVTS01+588
CVTRPT   EQU   CVTS01+584
CVTSSRB  EQU   CVTS01+580
CVTCSDRL EQU   CVTS01+576
CVTEXP1  EQU   CVTS01+572
CVTRMPMT EQU   CVTS01+568
CVTRMPTT EQU   CVTS01+564
CVTVPSA  EQU   CVTS01+560
CVTVSTOP EQU   CVTS01+556
CVTGTFR8 EQU   CVTS01+552
CVTQUIT  EQU   CVTS01+548
CVTVACR  EQU   CVTS01+544
CVTWTCB  EQU   CVTS01+540
CVTSTPRS EQU   CVTS01+536
CVT0PT02 EQU   CVTS01+532
CVTDARCM EQU   CVTS01+528
CVTIRECM EQU   CVTS01+524
CVTJRECM EQU   CVTS01+520
CVTVEMS0 EQU   CVTS01+516
CVTSPFRR EQU   CVTS01+512
CVTRLSTG EQU   CVTS01+508
CVT0TC0A EQU   CVTS01+504
CVTGMBR  EQU   CVTS01+500
CVTLFRM  EQU   CVTS01+496
CVTRMBR  EQU   CVTS01+492
CVTVIOP  EQU   CVTS01+488
CVTRV307 EQU   CVTS01+486
CVTRV306 EQU   CVTS01+484
CVTRV305 EQU   CVTS01+482
CVTRV304 EQU   CVTS01+480
CVTRV303 EQU   CVTS01+478
CVTRV302 EQU   CVTS01+476
CVTTRCA  EQU   CVTS01+472
CVTRV297 EQU   CVTRV289
CVTRV296 EQU   CVTRV289
CVTRV295 EQU   CVTRV289
CVTRV294 EQU   CVTRV289
CVTRV293 EQU   CVTRV289
CVTRV292 EQU   CVTRV289
CVTRV291 EQU   CVTRV289
CVTRV290 EQU   CVTRV289
CVTRV288 EQU   CVTRV280
CVTRV287 EQU   CVTRV280
CVTRV286 EQU   CVTRV280
CVTRV285 EQU   CVTRV280
CVTRV284 EQU   CVTRV280
CVTRV283 EQU   CVTRV280
CVTRV282 EQU   CVTRV280
CVTRV281 EQU   CVTRV280
CVTRV279 EQU   CVTRV271
CVTRV278 EQU   CVTRV271
CVTRV277 EQU   CVTRV271
CVTRV276 EQU   CVTRV271
CVTRV275 EQU   CVTRV271
CVTRV274 EQU   CVTRV271
CVTRV273 EQU   CVTRV271
CVTRV272 EQU   CVTRV271
CVTRV270 EQU   CVTRV262
CVTRV269 EQU   CVTRV262
CVTRV268 EQU   CVTRV262
CVTRV267 EQU   CVTRV262
CVTRV266 EQU   CVTRV262
CVTRV265 EQU   CVTRV262
CVTRV264 EQU   CVTRV262
CVTRV263 EQU   CVTRV262
CVTVFP   EQU   CVTS01+464
CVTVSI   EQU   CVTS01+460
CVTVPSIB EQU   CVTS01+456
CVTMFACT EQU   CVTMFRTR
CVTMFCTL EQU   CVTS01+448
CVTPVBP  EQU   CVTS01+444
CVTPWI   EQU   CVTS01+440
CVTRV254 EQU   CVTS01+438
CVTRV253 EQU   CVTS01+436
CVTRV252 EQU   CVTS01+434
CVTRV251 EQU   CVTS01+433
CVTRV250 EQU   CVTS01+432
CVTRV249 EQU   CVTS01+431
CVTRV248 EQU   CVTS01+430
CVTRV247 EQU   CVTS01+429
CVTRV246 EQU   CVTS01+428
CVTRV245 EQU   CVTRV237
CVTRV244 EQU   CVTRV237
CVTRV243 EQU   CVTRV237
CVTRV242 EQU   CVTRV237
CVTRV241 EQU   CVTRV237
CVTRV240 EQU   CVTRV237
CVTRV239 EQU   CVTRV237
CVTRV238 EQU   CVTRV237
CVTRV236 EQU   CVTRV228
CVTRV235 EQU   CVTRV228
CVTRV234 EQU   CVTRV228
CVTRV233 EQU   CVTRV228
CVTRV232 EQU   CVTRV228
CVTRV231 EQU   CVTRV228
CVTRV230 EQU   CVTRV228
CVTRV229 EQU   CVTRV228
CVTRV227 EQU   CVTRV219
CVTRV226 EQU   CVTRV219
CVTRV225 EQU   CVTRV219
CVTRV224 EQU   CVTRV219
CVTRV223 EQU   CVTRV219
CVTRV222 EQU   CVTRV219
CVTRV221 EQU   CVTRV219
CVTRV220 EQU   CVTRV219
CVTRV218 EQU   CVTRV210
CVTRV217 EQU   CVTRV210
CVTRV216 EQU   CVTRV210
CVTRV215 EQU   CVTRV210
CVTRV214 EQU   CVTRV210
CVTRV213 EQU   CVTRV210
CVTRV212 EQU   CVTRV210
CVTRV211 EQU   CVTRV210
CVTLCCAT EQU   CVTS01+420
CVTPCCAT EQU   CVTS01+416
CVTIPCRP EQU   CVTS01+412
CVTIPCRI EQU   CVTS01+408
CVTIPCDS EQU   CVTS01+404
CVTAIDVT EQU   CVTS01+400
CVTSSAP  EQU   CVTS01+396
CVTEHCIR EQU   CVTS01+392
CVTEHDEF EQU   CVTS01+388
CVTDAIR  EQU   CVTS01+384
CVTPERFM EQU   CVTS01+380
CVT044R2 EQU   CVTS01+376
CVTFETCH EQU   CVTS01+372
CVTRSTWD EQU   CVTS01+368
CVTSPOST EQU   CVTS01+364
CVTIOBP  EQU   CVTS01+360
CVTASMVT EQU   CVTS01+356
CVTRECRQ EQU   CVTS01+352
CVTWSAC  EQU   CVTS01+348
CVTRV149 EQU   CVTS01+344
CVTWSAL  EQU   CVTS01+340
CVTSPSA  EQU   CVTS01+336
CVTGLMN  EQU   CVTS01+332
CVTVEAC0 EQU   CVTS01+328
CVT062R1 EQU   CVTS01+324
CVTRPOST EQU   CVTS01+320
CVTDQIQE EQU   CVTS01+316
CVTCSD   EQU   CVTS01+312
CVTLKRMA EQU   CVTS01+308
CVTRSPIE EQU   CVTS01+304
CVTRENQ  EQU   CVTS01+300
CVTLQCB  EQU   CVTS01+296
CVTFQCB  EQU   CVTS01+292
CVTQCS01 EQU   CVTS01+288
CVTAPFT  EQU   CVTS01+284
CVTPARRL EQU   CVTS01+280
CVTVWAIT EQU   CVTS01+276
CVTGSPL  EQU   CVTS01+272
CVTLSMQ  EQU   CVTS01+268
CVTGSMQ  EQU   CVTS01+264
CVTEXPRO EQU   CVTS01+260
CVTOPCTP EQU   CVTS01+256
CVTSIC   EQU   CVTS01+252
CVTTPIOS EQU   CVTS01+248
CVTRTMS  EQU   CVTS01+244
CVTSDBF  EQU   CVTS01+240
CVTSCBP  EQU   CVTS01+236
CVTSDMP  EQU   CVTS01+232
CVTRTMCT EQU   CVTS01+224
CVTASCBL EQU   CVTS01+220
CVTASCBH EQU   CVTS01+216
CVTGDA   EQU   CVTS01+212
CVTASVT  EQU   CVTS01+208
CVTVVMDI EQU   CVTS01+204
CVTAQTOP EQU   CVTS01+200
CVTIOSCS EQU   CVTS01+196
CVTSDRM  EQU   CVTS01+192
CVTOPTE  EQU   CVTS01+188
CVTSTXU  EQU   CVTS01+184
CVTQUIS  EQU   CVTS01+180
CVTPARS  EQU   CVTS01+176
CVTS1EE  EQU   CVTS01+172
CVTFRAS  EQU   CVTS01+168
CVTQSAS  EQU   CVTS01+164
CVTCRAS  EQU   CVTS01+160
CVTCRMN  EQU   CVTS01+156
CVTDELCP EQU   CVTS01+152
CVTFRECL EQU   CVTS01+148
CVTGETCL EQU   CVTS01+144
CVTBLDCP EQU   CVTS01+140
CVTAUTHL EQU   CVTS01+136
CVTSCAN  EQU   CVTS01+132
CVTRV144 EQU   CVTS01+130
CVTMAXMP EQU   CVTS01+128
CVTSTCK  EQU   CVTS01+124
CVTRV139 EQU   CVTS01+123
CVTDSSAC EQU   CVTS01+122
CVTRV513 EQU   CVTS01+121
CVTIOSPL EQU   CVTS01+120
CVTPTGT  EQU   CVTS01+116
CVTCSPIE EQU   CVTS01+112
CVTSMFEX EQU   CVTS01+108
CVTOLT0A EQU   CVTS01+104
CVTSRBRT EQU   CVTS01+100
CVTPUTL  EQU   CVTS01+96
CVTASCRL EQU   CVTS01+92
CVTASCRF EQU   CVTS01+88
CVTRV326 EQU   CVTS01+84
CVTRV325 EQU   CVTS01+80
CVTRV324 EQU   CVTS01+76
CVT0VL01 EQU   CVTS01+72
CVTSHRVM EQU   CVTS01+68
CVTRV332 EQU   CVTS01+64
CVTTAS   EQU   CVTS01+60
CVTRSCN  EQU   CVTS01+56
CVTTRAC2 EQU   CVTS01+54
CVTTRACE EQU   CVTS01+52
CVTAPG   EQU   CVTS01+51
CVTSDTRC EQU   CVTCTLFG
CVTGTRCE EQU   CVTCTLFG
CVTNOMP  EQU   CVTCTLFG
CVTRSV79 EQU   CVTCTLFG
CVTDSTAT EQU   CVTCTLFG
CVTRSV78 EQU   CVTCTLFG
CVTRV333 EQU   CVTCTLFG
CVTRV323 EQU   CVTCTLFG
CVTSPVLK EQU   CVTS01+49
CVTRSV77 EQU   CVTS01+48
CVTRV331 EQU   CVTS01+44
CVTRV330 EQU   CVTS01+40
CVTRV329 EQU   CVTS01+36
CVTRV328 EQU   CVTS01+32
CVTRV322 EQU   CVTS01+28
CVTSLID  EQU   CVTSLIDA+1
CVTSYLK  EQU   CVTSLIDA
CVTRV321 EQU   CVTS01+20
CVTRV320 EQU   CVTS01+16
CVTLPDIR EQU   CVTLPDIA+1
CVTRSV69 EQU   CVTDIRST
CVTRSV68 EQU   CVTDIRST
CVTRSV67 EQU   CVTDIRST
CVTRSV66 EQU   CVTDIRST
CVTRSV65 EQU   CVTDIRST
CVTRSV64 EQU   CVTDIRST
CVTRSV63 EQU   CVTDIRST
CVTDICOM EQU   CVTDIRST
CVTPVTP  EQU   CVTS01+8
CVTLPDSR EQU   CVTS01+4
CVTGETL  EQU   CVTS01
CVOLANAM EQU   CVOLWA+544
@NM00211 EQU   CVOLWA
ASCHWA   EQU   IGC0002F+2800
@NM00210 EQU   IGC0002F+744
WORKNAME EQU   IGC0002F+700
@NM00209 EQU   PARMLIST
@NM00208 EQU   ESTALIST+11
STSW     EQU   ESTALIST+10
WASW     EQU   ESTALIST+9
SASW     EQU   ESTALIST+8
WAPTR    EQU   ESTALIST+4
BASEPTR  EQU   ESTALIST
@NM00207 EQU   IGC0002F+671
OLDKEY   EQU   IGC0002F+670
ROUTE    EQU   IGC0002F+669
VOLUMECT EQU   IGC0002F+664
VOLSTPTR EQU   IGC0002F+660
XCTLNAME EQU   XCTLLIST+8
XCTLNUL  EQU   XCTLLIST+4
XCTLPARM EQU   XCTLLIST
@NM00206 EQU   OPTBITS+2
OPBIT2   EQU   OPTBITS+1
OPBIT1   EQU   OPTBITS
PRMLSTSZ EQU   IGC0002F+636
CAMPLPTR EQU   IGC0002F+632
VSMFLPTR EQU   IGC0002F+628
VSMPLPTR EQU   IGC0002F+624
EXITSAV  EQU   IGC0002F+620
SAVER0   EQU   IGC0002F+616
SAVER1   EQU   IGC0002F+612
SAVERC   EQU   IGC0002F+608
SVRBSAV  EQU   IGC0002F+604
TCBSAV   EQU   IGC0002F+600
CVTSAV   EQU   IGC0002F+596
@NM00205 EQU   IGC0002F+594
WKCVOLVS EQU   IGC0002F+588
WKCATANM EQU   IGC0002F+544
WKCATNM  EQU   IGC0002F+500
@NM00204 EQU   IGC0002F+496
@NM00203 EQU   IGC0002F
@NM00200 EQU   RIPLSA
@NM00195 EQU   RBPSWKEY
RBRPSWPK EQU   RBPSWKEY
@NM00194 EQU   RBRPSW
RRPVDATA EQU   RRPF+4
CDBMDSZA EQU   CDBMDSZ+1
CDBSUBPL EQU   CDBMDSZ
CDBMDADA EQU   CDBMDAD+1
CDBNLSZ  EQU   CDBMDAD
XSVRBEND EQU   XRB+152
@NM00193 EQU   XRB+96
XSIRBEND EQU   XRB+96
XIRBEND  EQU   XRB+96
@NM00192 EQU   XRB+32
XLPRBEND EQU   XRB+32
XPRBEND  EQU   XRB+32
@NM00191 EQU   @NM00189+1
@NM00190 EQU   @NM00189
XRBQ     EQU   XRB+24
XFRBEND  EQU   XRB+24
@NM00188 EQU   XRTLPRB+1
XRBWTIS  EQU   XRBFLAG1
@NM00187 EQU   XRBFLAG1
XRBSRSW  EQU   XRBFLAG1
XRBPFSW  EQU   XRBFLAG1
XRREQ    EQU   @NM00186
XLRBEND  EQU   XRB+16
XRBEPA   EQU   XRBEP+1
XRBUSE   EQU   XRBEP
@NM00185 EQU   @NM00181
@NM00184 EQU   @NM00181
XRBIRBBT EQU   @NM00181
XRBREUS  EQU   @NM00181
XRBRSREG EQU   @NM00181
XRBGTMAN EQU   @NM00183
XRBNRENT EQU   @NM00182
XRBREFR  EQU   @NM00179
XRBETXR  EQU   XRBLRBFX
@NM00180 EQU   @NM00179
XRBSVRES EQU   @NM00179
XRBTYPF  EQU   @NM00179
XRBSZY   EQU   XRB+9
XRBCDBPY EQU   XRB+8
XRBNM    EQU   XRB
XRBPFXND EQU   XRBPRFX1+8
XRBPRE   EQU   XRBPRFX1+4
XRBSUC   EQU   XRBPRFX1
XRBQMAJ  EQU   XRBPRFX+4
@NM00177 EQU   XRBPRFX
RBEXSAVE EQU   XRBESA
XRBREG15 EQU   RBGRS15
XRBREG14 EQU   RBGRS14
XRBREG13 EQU   RBGRS13
XRBREG12 EQU   RBGRS12
XRBREG11 EQU   RBGRS11
XRBREG10 EQU   RBGRS10
XRBREG9  EQU   RBGRS9
XRBREG8  EQU   RBGRS8
XRBREG7  EQU   RBGRS7
XRBREG6  EQU   RBGRS6
XRBREG5  EQU   RBGRS5
XRBREG4  EQU   RBGRS4
XRBREG3  EQU   RBGRS3
XRBREG2  EQU   RBGRS2
XRBREG1  EQU   RBGRS1
XRBREG0  EQU   RBGRS0
XRBLNKA  EQU   RBLINKB
XRBWT    EQU   RBWCF
@NM00176 EQU   RBBASIC+24
RBOPSWPS EQU   RBOPSWB2
@NM00175 EQU   RBOPSWB2
@NM00174 EQU   XRBPSW
@NM00173 EQU   RBBASIC+12
XRBWAIT  EQU   RBECBWT
XRBFRRB  EQU   RBFDYN
@NM00172 EQU   XSTAB2
XRBACTV  EQU   RBFACTV
XRBTCBP  EQU   RBTCBNXT
@NM00171 EQU   XSTAB1
XRBCKPT  EQU   RBFTCKPT
@NM00170 EQU   XSTAB1
@NM00169 EQU   RBBASIC+8
@NM00168 EQU   RBEXRTNM+1
RBTMIND3 EQU   RBTMFLD
RBTMIND2 EQU   RBTMFLD
RBTMCMP  EQU   RBTMFLD
RBWLIM   EQU   RBTMFLD
RBRSV005 EQU   RBTMFLD
RBTMTOD  EQU   RBTMFLD
RBTMQUE  EQU   RBTMFLD
@NM00167 EQU   RBPRFX
RTTOLFCT EQU   DEVCHARS+18
RTTOLFLG EQU   RTDVFLGS
@NM00166 EQU   RTDVFLGS
RTKABFLG EQU   RTDVFLGS
@NM00165 EQU   RTDVFLGS
RTBONK   EQU   DEVCHARS+16
RTBOKLB  EQU   RTBOKAB+1
RTBOKNLB EQU   RTBOKAB
RTTRKSIZ EQU   DEVCHARS+12
RTNOTRKS EQU   DEVCHARS+10
RTNOCYLS EQU   DEVCHARS+8
RTMXDBLK EQU   DEVCHARS+4
RTCLSTYP EQU   RTDEVUCB+2
@NM00164 EQU   RTDEVUCB
@NM00163 EQU   RGATTSG1
RGATSUP1 EQU   RGATTSG1
@NM00162 EQU   RGATTR1
RGATTUPG EQU   RGATTR1
CTGDSNUS EQU   CTGATR2
@NM00161 EQU   CTGATR2
CTGDSSSH EQU   CTGATR2
CTGDSISH EQU   CTGATR2
CTGTRKOV EQU   CTGATR1
CTGDSTPX EQU   CTGATR1
CTGDSINH EQU   CTGATR1
CTGDSREC EQU   CTGATR1
CTGDSERA EQU   CTGATR1
CTGDSREU EQU   CTGATR1
CTGDSUNQ EQU   CTGATR1
CTGDSSPD EQU   CTGATR1
SPCROUND EQU   SPCOPTNS
SPCALXRQ EQU   SPCOPTNS
SPCMXIGR EQU   SPCOPTNS
SPCCNTIG EQU   SPCOPTNS
@NM00160 EQU   SPCOPTNS
SPCRQTYP EQU   SPCOPTNS
SPCSECDQ EQU   SPACEPRM+3
SPCPRIMQ EQU   SPACEPRM
LTVOLSER EQU   LTENTRY+2
LTRETCD2 EQU   LTRETCOD+1
LTRETCD1 EQU   LTRETCOD
USERAREV EQU   USERAREC+2
USERAREL EQU   USERAREC
USVRMDUL EQU   PASSGO+42
PASSATMP EQU   PASSGO+40
PASSPRMT EQU   PASSGO+32
READPW   EQU   PASSWORD+24
UPDATEPW EQU   PASSWORD+16
CIPW     EQU   PASSWORD+8
MASTERPW EQU   PASSWORD
ASCI     EQU   ASGO+1
ASTYPE   EQU   ASGO
ASCBEND  EQU   ASCB+208
ASCBSRBT EQU   ASCB+200
ASCBSWTL EQU   ASCB+196
ASCBRS14 EQU   ASCB+195
ASCBSMCT EQU   ASCB+194
ASCBRS12 EQU   ASCB+192
ASCBPCTT EQU   ASCB+188
ASCBVGTT EQU   ASCB+184
ASCBRV43 EQU   ASCBSRQ4
ASCBRV42 EQU   ASCBSRQ4
ASCBRV41 EQU   ASCBSRQ4
ASCBRV40 EQU   ASCBSRQ4
ASCBRV39 EQU   ASCBSRQ4
ASCBRV38 EQU   ASCBSRQ4
ASCBRV37 EQU   ASCBSRQ4
ASCBRV36 EQU   ASCBSRQ4
ASCBRV35 EQU   ASCBSRQ3
ASCBRV34 EQU   ASCBSRQ3
ASCBRV33 EQU   ASCBSRQ3
ASCBRV32 EQU   ASCBSRQ3
ASCBRV31 EQU   ASCBSRQ3
ASCBRV30 EQU   ASCBSRQ3
ASCBRV29 EQU   ASCBSRQ3
ASCBRV28 EQU   ASCBSRQ3
ASCBRV27 EQU   ASCBSRQ2
ASCBRV26 EQU   ASCBSRQ2
ASCBRV25 EQU   ASCBSRQ2
ASCBRV24 EQU   ASCBSRQ2
ASCBRV23 EQU   ASCBSRQ2
ASCBRV22 EQU   ASCBSRQ2
ASCBRV21 EQU   ASCBSRQ2
ASCBRV20 EQU   ASCBSRQ2
ASCBRV19 EQU   ASCBSRQ1
ASCBRV18 EQU   ASCBSRQ1
ASCBRV17 EQU   ASCBSRQ1
ASCBRV16 EQU   ASCBSRQ1
ASCBRV15 EQU   ASCBSRQ1
ASCBRV14 EQU   ASCBSRQ1
ASCBRV13 EQU   ASCBSRQ1
ASCBSTA  EQU   ASCBSRQ1
ASCBJBNS EQU   ASCB+176
ASCBJBNI EQU   ASCB+172
ASCBMCC  EQU   ASCB+168
ASCBRTWA EQU   ASCB+164
ASCBIQEA EQU   ASCB+160
ASCBXMPQ EQU   ASCB+156
ASCBRS01 EQU   ASCB+154
ASCBFMCT EQU   ASCB+152
ASCBOUXB EQU   ASCB+148
ASCBOUCB EQU   ASCB+144
ASCBMECB EQU   ASCB+140
ASCBQECB EQU   ASCB+136
ASCBLSQH EQU   ASCBLKGP+4
ASCBLOCK EQU   ASCBLKGP
ASCBTCBS EQU   ASCB+124
ASCBNVSC EQU   ASCB+122
ASCBVSC  EQU   ASCB+120
ASCBSRBS EQU   ASCB+118
ASCBSSRB EQU   ASCB+116
ASCBRV06 EQU   ASCBFLG2
ASCBRV05 EQU   ASCBFLG2
ASCBRV04 EQU   ASCBFLG2
ASCBSNQS EQU   ASCBFLG2
ASCBS2S  EQU   ASCBFLG2
ASCBCEXT EQU   ASCBFLG2
ASCBPXMT EQU   ASCBFLG2
ASCBXMPT EQU   ASCBFLG2
ASCBRF07 EQU   ASCBDSP1
ASCBRF06 EQU   ASCBDSP1
ASCBRF05 EQU   ASCBDSP1
ASCBRF04 EQU   ASCBDSP1
ASCBRF03 EQU   ASCBDSP1
ASCBRF02 EQU   ASCBDSP1
ASCBFAIL EQU   ASCBDSP1
ASCBNOQ  EQU   ASCBDSP1
ASCBSWCT EQU   ASCB+112
ASCBASXB EQU   ASCB+108
ASCBTMCH EQU   ASCB+104
ASCBNSWP EQU   ASCBFLG1
ASCBTYP1 EQU   ASCBFLG1
ASCBSTND EQU   ASCBFLG1
ASCBABNT EQU   ASCBFLG1
ASCBTERM EQU   ASCBFLG1
ASCBS3S  EQU   ASCBFLG1
ASCBCMSH EQU   ASCBFLG1
ASCBTOFF EQU   ASCBFLG1
ASCBRF01 EQU   ASCBRCTF
ASCBTMLW EQU   ASCBRCTF
ASCBOUT  EQU   ASCBRCTF
ASCBWAIT EQU   ASCBRCTF
ASCBRV08 EQU   ASCBRCTF
ASCBFQU  EQU   ASCBRCTF
ASCBFRS  EQU   ASCBRCTF
ASCBTMNO EQU   ASCBRCTF
ASCBAFFN EQU   ASCBFW1
ASCBDUMP EQU   ASCB+96
ASCBRV44 EQU   ASCB+92
ASCBUBET EQU   ASCB+88
ASCBECB  EQU   ASCB+84
ASCBJSTL EQU   ASCB+80
ASCBEWST EQU   ASCB+72
ASCBEJST EQU   ASCB+64
ASCBTSB  EQU   ASCB+60
ASCBCSCB EQU   ASCB+56
ASCBRSMA EQU   ASCBRSM+1
ASCBRV54 EQU   ASCBRSMF
ASCBRV53 EQU   ASCBRSMF
ASCBRV52 EQU   ASCBRSMF
ASCBRV51 EQU   ASCBRSMF
ASCBVEQR EQU   ASCBRSMF
ASCBN2LP EQU   ASCBRSMF
ASCB1LPU EQU   ASCBRSMF
ASCB2LPU EQU   ASCBRSMF
ASCBLDA  EQU   ASCB+48
ASCBSTOR EQU   ASCB+44
ASCBDP   EQU   ASCB+43
ASCBRV07 EQU   ASCB+42
ASCBIOSM EQU   ASCB+40
ASCBSEQN EQU   ASCB+38
ASCBCPUS EQU   ASCB+32
ASCBSPL  EQU   ASCB+28
ASCBIOSP EQU   ASCB+24
ASCBSYNC EQU   ASCBSUPC+4
ASCBSVRB EQU   ASCBSUPC
ASCBCMSF EQU   ASCB+12
ASCBBWDP EQU   ASCB+8
ASCBFWDP EQU   ASCB+4
ASCBASCB EQU   ASCB
ASCBEGIN EQU   ASCB
DRWHPCHR EQU   DRWRIA+189
DRWCNT   EQU   DRWRIA+184
DRWDSCB  EQU   DRWRIA+44
DRWSKEY  EQU   DRWRIA
DRWF4TC  EQU   IGGMDRWA+202
@NM00152 EQU   IGGMDRWA+201
DRWTHETA EQU   IGGMDRWA+200
DRWCCW12 EQU   DRWCCW+96
DRWCCW11 EQU   DRWCCW+88
DRWCCW10 EQU   DRWCCW+80
DRWCCW9  EQU   DRWCCW+72
DRWCCW8  EQU   DRWCCW+64
DRWCCW7  EQU   DRWCCW+56
DRWCCW6  EQU   DRWCCW+48
DRWCCW5  EQU   DRWCCW+40
DRWCCW4  EQU   DRWCCW+32
DRWCCW3  EQU   DRWCCW+24
DRWCCW2  EQU   DRWCCW+16
DRWCCW1  EQU   DRWCCW+8
DRWCCW0  EQU   DRWCCW
DRWSER   EQU   DRWSEEK+7
DRWSEHH  EQU   DRWSEEK+5
DRWSECC  EQU   DRWSEEK+3
@NM00151 EQU   DRWSEEK
@NM00150 EQU   DRWIOB+24
DRWIDCB  EQU   DRWIOB+20
DRWSCP   EQU   DRWIOB+16
@NM00149 EQU   DRWIOB+8
DRWIECB  EQU   DRWIOB+4
DRWISN1  EQU   DRWIOB+3
DRWISN0  EQU   DRWIOB+2
@NM00148 EQU   DRWIOB
@NM00147 EQU   DRWECB+1
DRWECMP  EQU   DRWECB
DRWDEBP  EQU   IGGMDRWA+48
DRWNTK   EQU   DRWDEB+46
DRWECC   EQU   DRWDEB+42
DRWSCC   EQU   DRWDEB+38
DRWDBB   EQU   DRWDEB+36
DRWDUCB  EQU   DRWDEB+33
DRWDMOD  EQU   DRWDEB+32
DRWDAPP  EQU   DRWDEB+29
DRWDEXS  EQU   DRWDEB+28
DRWDDCB  EQU   DRWDEB+25
DRWDID   EQU   DRWDEB+24
@NM00146 EQU   DRWDEB+17
DRWDEXT  EQU   DRWDEB+16
@NM00145 EQU   DRWDEB
BUFCEND  EQU   IDABUFC+64
BUFCUCDN EQU   IDABUFC+60
BUFCUCUP EQU   IDABUFC+56
BUFCMDBT EQU   IDABUFC+52
BUFCHAIN EQU   IDABUFC+48
BUFXORBA EQU   IDABUFC+44
BUFXIRBA EQU   IDABUFC+40
BUFCNXT2 EQU   IDABUFC+37
BUFCIDXL EQU   IDABUFC+36
BUFCDSPC EQU   IDABUFC+32
BUFCWLEN EQU   BUFCINV
BUFCNXT1 EQU   IDABUFC+24
BUFCBAD  EQU   IDABUFC+20
BUFCCPA  EQU   IDABUFC+16
BUFCORBA EQU   IDABUFC+12
BUFCDDDD EQU   IDABUFC+8
BUFCAMB  EQU   BUFCPLH
@NM00144 EQU   BUFCFLG2
BUFCEOD  EQU   BUFCFLG2
BUFCBSYW EQU   BUFCFLG2
BUFCBSYR EQU   BUFCFLG2
BUFCNLAS EQU   BUFCFLG2
BUFCXDDR EQU   BUFCFLG2
BUFCFIX  EQU   BUFCIOFL
BUFCPFCP EQU   BUFCIOFL
BUFCXEDB EQU   BUFCIOFL
BUFCWC   EQU   BUFCIOFL
BUFCREAL EQU   BUFCIOFL
BUFCRRD  EQU   BUFCIOFL
BUFCFMT  EQU   BUFCIOFL
BUFCMW   EQU   BUFCIOFL
BUFCEPT  EQU   BUFCFLG1
BUFCEXC  EQU   BUFCFLG1
BUFCVAL  EQU   BUFCFLG1
BUFCER2  EQU   BUFCFLG1
BUFCER1  EQU   BUFCFLG1
BUFCINS  EQU   BUFCFLG1
BUFCSEG  EQU   BUFCFLG1
BUFCUPG  EQU   BUFCFLG1
BUFCUCNT EQU   BUFCAVL
@NM00143 EQU   IDABUFDR+16
BUFDBUFC EQU   IDABUFDR+12
@NM00142 EQU   BUFDRFLG
BUFDRAVL EQU   BUFDRFLG
BUFDRREL EQU   BUFDRFLG
BUFDRTSB EQU   IDABUFDR+10
BUFDRMAX EQU   BUFDRCIX
BUFDRPFN EQU   IDABUFDR+8
BUFDRPFB EQU   IDABUFDR+4
BUFDRLEN EQU   IDABUFDR+2
BUFDRID  EQU   IDABUFDR
AMBTRACE EQU   IDAAMB+120
AMBVIOT  EQU   IDAAMB+116
AMBSZCP  EQU   IDAAMB+114
AMBSZFW  EQU   IDAAMB+112
AMBSZWR  EQU   IDAAMB+110
AMBSZRD  EQU   IDAAMB+108
AMBEXEX  EQU   IDAAMB+100
AMBWSHD  EQU   IDAAMB+96
AMBCPA   EQU   IDAAMB+92
AMBBM2SH EQU   IDAAMB+88
AMBRDCNT EQU   AMBCSWD1+2
@NM00141 EQU   AMBCSWD1+1
@NM00140 EQU   AMBAFLG
AMBCFX   EQU   AMBAFLG
AMBSIS   EQU   AMBAFLG
AMBDFR   EQU   AMBAFLG
AMBICI   EQU   AMBAFLG
AMBGSR   EQU   AMBAFLG
AMBLSR   EQU   AMBAFLG
@NM00139 EQU   AMBAFLG
AMBUPLH  EQU   IDAAMB+80
AMBPAMBL EQU   IDAAMB+76
AMBPIXP  EQU   IDAAMB+72
@NM00138 EQU   IDAAMB+68
AMBIWA   EQU   IDAAMB+64
AMBWKA   EQU   IDAAMB+60
AMBAMBXN EQU   AMBEOVPT
AMBEDB   EQU   IDAAMB+52
AMBRPT   EQU   IDAAMB+50
AMBPUG   EQU   AMBFLG2
AMBBUSY  EQU   AMBOFLGS
AMBEXFG  EQU   AMBOFLGS
@NM00137 EQU   AMBOFLGS
AMBOPEN  EQU   AMBOFLGS
@NM00136 EQU   AMBOFLGS
AMBDEBAD EQU   AMBDEBPT+1
AMBIFLGS EQU   AMBDEBPT
AMBAMETH EQU   IDAAMB+43
AMBSDS   EQU   AMBINFL
AMBUPX   EQU   AMBINFL
AMBUCRA  EQU   AMBINFL
AMBSCRA  EQU   AMBINFL
AMBCAT   EQU   AMBINFL
@NM00135 EQU   AMBINFL
@NM00134 EQU   AMBINFL
AMBTIOT  EQU   IDAAMB+40
@NM00133 EQU   IDAAMB+38
AMBDDSN  EQU   IDAAMB+35
AMBCDSN  EQU   IDAAMB+32
AMBIOMB  EQU   AMBIOBAD
@NM00132 EQU   AMBDSORG+1
AMBDORGA EQU   AMBDSORG+1
@NM00131 EQU   AMBDSORG
AMBINBUF EQU   AMBFLG1
AMBJRN   EQU   AMBFLG1
AMBUBF   EQU   AMBFLG1
AMBSPEED EQU   AMBFLG1
AMBPCAT  EQU   AMBFLG1
AMBMCAT  EQU   AMBFLG1
AMBTYPE  EQU   AMBFLG1
AMBCREAT EQU   AMBFLG1
@NM00130 EQU   AMBFLG0
AMBSWSP  EQU   AMBFLG0
AMBPSDS  EQU   AMBFLG0
AMBDSB   EQU   IDAAMB+20
AMBCACB  EQU   IDAAMB+16
AMBPH    EQU   IDAAMB+12
AMBLINK  EQU   IDAAMB+4
AMBLEN   EQU   IDAAMB+2
AMBRSC   EQU   IDAAMB+1
AMBID    EQU   IDAAMB
AMBLCMB  EQU   IDAAMBL+64
AMBLBIB  EQU   IDAAMBL+60
AMBLIX   EQU   IDAAMBL+56
AMBLMIDS EQU   IDAAMBL+42
AMBLNIDS EQU   IDAAMBL+41
@NM00129 EQU   IDAAMBL+40
AMBLNUM  EQU   IDAAMBL+38
AMBLNST  EQU   IDAAMBL+37
@NM00128 EQU   AMBLFLG2
AMBLSTAG EQU   AMBLFLG2
@NM00127 EQU   AMBLFLG2
AMBLDUMY EQU   AMBLFLG1
AMBLCAT  EQU   AMBLFLG1
AMBLUCRA EQU   AMBLFLG1
AMBLSCRA EQU   AMBLFLG1
AMBLSDS  EQU   AMBLVVIC
AMBLUPD  EQU   AMBLFLG1
AMBLCINV EQU   AMBLFLG1
AMBLFULL EQU   AMBLFLG1
AMBLLEN  EQU   IDAAMBL+34
@NM00126 EQU   AMBLSHAR
AMBLWRIT EQU   AMBLSHAR
AMBLCATO EQU   AMBLSHAR
AMBLPRIM EQU   AMBLSHAR
AMBLID   EQU   IDAAMBL+32
@NM00125 EQU   AMBLQ2
AMBLCBIC EQU   AMBLQ2
@NM00124 EQU   AMBLTYPE
AMBLFIX  EQU   AMBLTYPE
AMBLBASE EQU   AMBLTYPE
AMBLAIX  EQU   AMBLTYPE
AMBLUPGR EQU   AMBLTYPE
AMBLPATH EQU   AMBLTYPE
AMBLENO  EQU   AMBLVC+1
AMBLVRT  EQU   AMBLVC
AMBLXPT  EQU   IDAAMBL+24
AMBLDFR  EQU   AMBLQ
AMBLESDS EQU   AMBLQ
AMBLKSDS EQU   AMBLQ
AMBLUBF  EQU   AMBLQ
AMBLFSTP EQU   AMBLQ
AMBLLSR  EQU   AMBLQ
AMBLGSR  EQU   AMBLQ
AMBLDDC  EQU   AMBLQ
AMBLDCI  EQU   AMBLIDF+4
AMBLCACB EQU   AMBLIDF
@NM00123 EQU   AMBLEOV+2
AMBLCOMP EQU   AMBLEOV+1
AMBLESET EQU   AMBLEFLG
AMBLWAIT EQU   AMBLEFLG
AMBLACB  EQU   IDAAMBL+8
AMBLSCHN EQU   IDAAMBL+4
AMBLPCHN EQU   IDAAMBL
@NM00122 EQU   RXTN+1
RXTNAV   EQU   RXTN
@NM00121 EQU   XTNDRPL
RPLERMSA EQU   RPLCOMN+72
RPLEMLEN EQU   RPLCOMN+70
RPLBRANC EQU   RPLEXTD1
RPLNIB   EQU   RPLEXTD1
@NM00120 EQU   RPLEXTD1
RPLEXIT  EQU   RPLEXTD1
RPLNEXIT EQU   RPLEXTD1
RPLEXSCH EQU   RPLEXTD1
RPLDDDD  EQU   RPLRBAR+4
@NM00119 EQU   RPLRBAR+3
@NM00118 EQU   RPLAIXID
RPLAXPKP EQU   RPLAIXID
RPLAIXPC EQU   RPLRBAR
RPLRSV88 EQU   RPLOPT8
RPLUNCON EQU   RPLOPT8
RPLACTV  EQU   RPLOPT8
RPLSESS  EQU   RPLOPT8
RPLPEND  EQU   RPLOPT8
RPLODPRM EQU   RPLOPT8
RPLODACP EQU   RPLOPT8
RPLODACQ EQU   RPLOPT8
RPLRSV78 EQU   RPLOPT7
RPLTCRNO EQU   RPLOPT7
RPLRLSOP EQU   RPLOPT7
RPLTPOST EQU   RPLOPT7
RPLQOPT  EQU   RPLOPT7
RPLCNIMM EQU   RPLCNOPT
RPLCNANY EQU   RPLCNOPT
RPLCNALL EQU   RPLCNOPT
RPLRSV68 EQU   RPLOPT6
RPLRSV67 EQU   RPLOPT6
RPLLOCK  EQU   RPLOPT6
RPLNCOND EQU   RPLOPT6
RPLCOND  EQU   RPLOPT6
RPLEOT   EQU   RPLUNTYP
RPLEOM   EQU   RPLUNTYP
RPLEOB   EQU   RPLUNTYP
RPLWROPT EQU   RPLOPT5
RPLNODE  EQU   RPLOPT5
RPLERACE EQU   RPLWRTYP
RPLEAU   EQU   RPLWRTYP
RPLNERAS EQU   RPLWRTYP
RPLPSOPT EQU   RPLOPT5
@NM00117 EQU   RPLOPT5
RPLDLGIN EQU   RPLOPT5
RPLRLEN  EQU   RPLCOMN+48
RPLCHAIN EQU   RPLNXTRP
@NM00116 EQU   RPLOPT4
RPLMKFRM EQU   RPLOPT4
RPLENDTR EQU   RPLOPT4
RPLALIGN EQU   RPLOPT3
RPLFMT   EQU   RPLOPT3
RPLFLD   EQU   RPLOPT3
RPLVFY   EQU   RPLOPT3
RPLBLK   EQU   RPLOPT3
RPLSFORM EQU   RPLOPT3
RPLEODS  EQU   RPLOPT3
RPLNSP   EQU   RPLOPT2
RPLUPD   EQU   RPLOPT2
RPLWAITX EQU   RPLOPT2
RPLLRD   EQU   RPLOPT2
RPLBWD   EQU   RPLOPT2
RPLADD   EQU   RPLADR
RPLKEY   EQU   RPLOPT2
RPLECBIN EQU   RPLECBSW
RPLGEN   EQU   RPLOPT1
RPLKGE   EQU   RPLOPT1
RPLASY   EQU   RPLOPT1
RPLSKP   EQU   RPLOPT1
RPLLOC   EQU   RPLOPT1
RPLDAF   EQU   RPLARG+2
RPLSAF   EQU   RPLARG
RPLAREA  EQU   RPLCOMN+32
RPLTCBPT EQU   RPLCOMN+28
RPLCCHAR EQU   RPLCOMN+20
RPLSTRID EQU   RPLCOMN+18
RPLKEYL  EQU   RPLKEYLE
RPLRDSOH EQU   RPLFDB3
RPLRLG   EQU   RPLFDB3
RPLLGFRC EQU   RPLFDB3
RPLREOT  EQU   RPLFDB3
RPLREOM  EQU   RPLFDB3
RPLREOB  EQU   RPLFDB3
RPLSV32  EQU   RPLFDB3
RPLUINPT EQU   RPLFDB3
RPLSTSAV EQU   RPLFDB2
RPLCUERR EQU   RPLFDB2
RPLDLGFL EQU   RPLFDB2
RPLIOERR EQU   RPLFDB2
RPLDVUNS EQU   RPLFDB2
RPLATND  EQU   RPLFDB2
RPLRVID  EQU   RPLFDB2
RPLERLK  EQU   RPLFDB2
RPLERREG EQU   RPLRTNCD
RPLSTAT  EQU   RPLFDBWD
RPLPOST  EQU   RPLECB
RPLWAIT  EQU   RPLECB
RPLPLHPT EQU   RPLCOMN+4
RPLLEN2  EQU   RPLLEN
RPLREQ   EQU   RPLIDWD+2
RPLSTYP  EQU   RPLIDWD+1
RPLID    EQU   RPLIDWD
CICFVTPR EQU   IGGCICB+36
CICFVTDX EQU   IGGCICB+20
CICFVTCN EQU   IGGCICB+16
@NM00115 EQU   IGGCICB+6
CICUSKEY EQU   IGGCICB+5
@NM00114 EQU   CICFLAGS
CVLSER   EQU   MWA+259
TTR2     EQU   MWA+256
BIN0     EQU   CVOLIND+3
TTR1     EQU   CVOLIND
@NM00113 EQU   MWA+242
FSN      EQU   VLST+10
VOLSER   EQU   VLST+4
DEVTYP   EQU   VLST
VOLENTCT EQU   MWA
RDDFVSER EQU   RDDFLIST+12
RDDFNNAM EQU   RDDFOVOL
RDDFENT  EQU   RDDFENTW+1
@NM00112 EQU   RDDFFLGS
RDDFDSTV EQU   RDDFFLGS
@NM00111 EQU   RDDFFLGS
RDDFNEWN EQU   RDDFFLGS
RDDFOLDV EQU   RDDFFLGS
RDDFTADV EQU   RDDFFLGS
RDDFTDEL EQU   RDDFFLGS
RDDFINST EQU   RDDFINSW+1
RDDFLENG EQU   RDDFINSW
ACHKVOLS EQU   ACHKVOLW+1
@NM00110 EQU   ACHKFLG3
ACHKVOL  EQU   ACHKFLG3
@NM00109 EQU   ACHKFLG3
ACHKPRF  EQU   ACHKFLG3
@NM00108 EQU   ACHKFLG3
ACHKCLN  EQU   ACHKCLNW+1
@NM00107 EQU   ACHKFLG2
ACHKTRD  EQU   ACHKFLG2
ACHKTUPD EQU   ACHKFLG2
ACHKTCTL EQU   ACHKFLG2
@NM00106 EQU   ACHKFLG2
ACHKTALT EQU   ACHKFLG2
ACHKCSA  EQU   ACHKFLG1
ACHKLOGN EQU   ACHKFLG1
ACHKLOGF EQU   ACHKFLG1
@NM00105 EQU   ACHKFLG1
ACHKDSTV EQU   ACHKFLG1
@NM00104 EQU   ACHKFLG1
@NM00103 EQU   ACHKFLG1
@NM00102 EQU   ACHKFLG1
ACHKINST EQU   ACHKINSW+1
ACHKLENG EQU   ACHKINSW
CTGCVCC  EQU   CTGCV+50
CTGCVDEV EQU   CTGCVDSN
CTGCVVOL EQU   CTGCV
CTGVLTTR EQU   CTGVLX+12
@NM00101 EQU   CTGVLX
CTGVLSEQ EQU   CTGVL+10
CTGVLDEV EQU   CTGVL+6
CTGVLVOL EQU   CTGVL
CTGWAGB  EQU   CTGWA+12
CTGWAGCT EQU   CTGWA+10
CTGWAUCT EQU   CTGWA+8
CTGWAVCT EQU   CTGWA+6
CTGWALV  EQU   CTGWA+4
CTGFVCPP EQU   CTGFVPWD
CTGFVNAM EQU   CTGFV+80
CTGFVUPG EQU   CTGFVGAT
CTGFVEXT EQU   CTGFVLMT
CTGFVLRS EQU   CTGFV+68
CTGFVBUF EQU   CTGFV+64
CTGFVATR EQU   CTGFV+60
CTGFVFSN EQU   CTGFVAMD
CTGFVTTR EQU   CTGFVSPC
CTGFVDVT EQU   CTGFV+48
CTGFVRNG EQU   CTGFV+44
CTGFVCRE EQU   CTGFV+36
CTGFVEXP EQU   CTGFV+32
CTGFVOWN EQU   CTGFV+28
CTGFVSTY EQU   CTGFV+24
CTGFVENT EQU   CTGFV+20
CTGFVIND EQU   CTGFV+16
@NM00100 EQU   CTGFV+3
CTGFVELM EQU   CTGFV+2
@NM00099 EQU   CTGFVPRO
CTGFVROF EQU   CTGFVPRO
CTGFVRON EQU   CTGFVPRO
CTGFVDRC EQU   CTGFVPRO
CTGFVNDC EQU   CTGFVPRO
CTGFVRVL EQU   CTGFVPRO
CTGFVAVL EQU   CTGFVPRO
CTGFVTYP EQU   CTGFV
CAXWNQID EQU   CAXHRPLW+2
CAXHRPLC EQU   CAXHRPLW
CAXASCBP EQU   IGGCAXWA+124
@NM00098 EQU   CAXECB+1
@NM00097 EQU   CAXECBHB
CAXECBPB EQU   CAXECBHB
CAXECBWB EQU   CAXECBHB
CAXCRACB EQU   IGGCAXWA+112
CAXJDE   EQU   IGGCAXWA+108
CAXPLOCK EQU   CAXCCA
CAXOPEWA EQU   IGGCAXWA+100
@NM00096 EQU   COPTS
CENLST   EQU   COPTS
@NM00095 EQU   CAXCNAM+22
CAXRADDN EQU   CAXCNAM+14
CAXRATEP EQU   CAXCNAM+10
CAXRACTS EQU   CAXCNAM+6
CAXVOLID EQU   CAXCNAM
CAXFDCI  EQU   CAXCCR+9
CAXCDCI  EQU   CAXCCR+6
CAXNFCI  EQU   CAXCCR+3
CAXHACI  EQU   CAXCCR
CAXUCB   EQU   IGGCAXWA+28
CAXATIOT EQU   IGGCAXWA+12
CAXACT   EQU   IGGCAXWA+11
@NM00094 EQU   CAXFLG3
CAXF3B6  EQU   CAXFLG3
CAXF3B5  EQU   CAXFLG3
@NM00093 EQU   CAXFLG3
CAXF3ANE EQU   CAXFLG3
CAXF3AT  EQU   CAXFLG3
CAXF2VTU EQU   CAXFLG2
CAXF2CA  EQU   CAXFLG2
CAXF2CLR EQU   CAXFLG2
CAXF2IOE EQU   CAXFLG2
CAXF2NCR EQU   CAXFLG2
CAXF2NDD EQU   CAXFLG2
CAXF2DT  EQU   CAXFLG2
CAXMCT   EQU   CAXFLGS
CAXCMP   EQU   CAXFLGS
CAXEOV   EQU   CAXFLGS
CAXCHN   EQU   IGGCAXWA+4
@NM00092 EQU   IGGCAXWA+1
CAXID    EQU   IGGCAXWA
CBSVPTR  EQU   CBSVSRT+4
CBSVUSE  EQU   CBSVSRT
CBSCAXCN EQU   AMCBS+20
CBSMCUCB EQU   CBSCMP
CBSCBP   EQU   AMCBS+12
CBSACB   EQU   AMCBS+8
CBSMCSTA EQU   AMCBS+4
CBSSIZ   EQU   AMCBS+2
CBSID    EQU   AMCBS
ACBAPID  EQU   ACBCOMN+72
ACBCBMWA EQU   ACBCOMN+68
ACBLRECL EQU   ACBCOMN+62
ACBMSGLN EQU   ACBBLKSZ
ACBBUFSP EQU   ACBCOMN+56
@NM00089 EQU   ACBUJFCB+1
ACBOPTN  EQU   ACBUJFCB
@NM00088 EQU   ACBINFL2
ACBCBIC  EQU   ACBINFL2
@NM00087 EQU   ACBINFL2
ACBBYPSS EQU   ACBINFL1
ACBSDS   EQU   ACBVVIC
ACBCAT   EQU   ACBINFL1
ACBIJRQE EQU   ACBINFL1
ACBJEPS  EQU   ACBINFL1
@NM00086 EQU   ACBINFL1
ACBERFLG EQU   ACBCOMN+49
ACBBUSY  EQU   ACBIOSFG
ACBLOCK  EQU   ACBEXFG
@NM00085 EQU   ACBOFLGS
ACBDSERR EQU   ACBOFLGS
ACBEOV   EQU   ACBOFLGS
@NM00084 EQU   ACBOFLGS
ACBDEB   EQU   ACBDDNM+5
ACBERFL  EQU   ACBDDNM+4
ACBAM    EQU   ACBAMETH
ACBINFL  EQU   ACBDDNM+2
ACBTIOT  EQU   ACBDDNM
ACBUEL   EQU   ACBEXLST
ACBPASSW EQU   ACBCOMN+32
ACBMSGAR EQU   ACBCOMN+28
@NM00083 EQU   ACBDSORG+1
ACBDORGA EQU   ACBDSORG+1
@NM00082 EQU   ACBDSORG
ACBOPTJ  EQU   ACBDVIND
ACBCRNRE EQU   ACBCROPS
ACBCRNCK EQU   ACBCROPS
ACBASA   EQU   ACBCCTYP
@NM00081 EQU   ACBCCTYP
ACBTRCID EQU   ACBCCTYP
@NM00080 EQU   ACBRECFM
ACBRECAF EQU   ACBRECFM
ACBJBUF  EQU   ACBBUFPL+2
ACBMACR4 EQU   ACBBUFPL+1
@NM00079 EQU   ACBMACR3
ACBNCFX  EQU   ACBMACR3
ACBSIS   EQU   ACBMACR3
ACBDFR   EQU   ACBMACR3
ACBICI   EQU   ACBMACR3
ACBGSR   EQU   ACBMACR3
ACBLSR   EQU   ACBMACR3
@NM00078 EQU   ACBMACR3
ACBBUFNI EQU   ACBCOMN+18
ACBBUFND EQU   ACBCOMN+16
ACBSTRNO EQU   ACBCOMN+15
ACBBSTNO EQU   ACBCOMN+14
ACBAIX   EQU   ACBMACR2
ACBDSN   EQU   ACBMACR2
ACBRST   EQU   ACBMACR2
ACBLOGON EQU   ACBMACR2
ACBSKP   EQU   ACBMACR2
@NM00077 EQU   ACBMACR2
ACBUBF   EQU   ACBMACR1
ACBOUT   EQU   ACBMACR1
ACBIN    EQU   ACBMACR1
ACBDIR   EQU   ACBMACR1
ACBSEQ   EQU   ACBMACR1
ACBBLK   EQU   ACBCNV
ACBADD   EQU   ACBADR
ACBKEY   EQU   ACBMACR1
ACBINRTN EQU   ACBCOMN+8
ACBIBCT  EQU   ACBJWA
ACBLEN2  EQU   ACBLENG2
ACBSTYP  EQU   ACBCOMN+1
ACBID    EQU   ACBCOMN
@NM00052 EQU   TCBXTNT2+32
TCBRV181 EQU   TCBRV173
TCBRV180 EQU   TCBRV173
TCBRV179 EQU   TCBRV173
TCBRV178 EQU   TCBRV173
TCBRV177 EQU   TCBRV173
TCBRV176 EQU   TCBRV173
TCBRV175 EQU   TCBRV173
TCBRV174 EQU   TCBRV173
TCBRV172 EQU   TCBRV164
TCBRV171 EQU   TCBRV164
TCBRV170 EQU   TCBRV164
TCBRV169 EQU   TCBRV164
TCBRV168 EQU   TCBRV164
TCBRV167 EQU   TCBRV164
TCBRV166 EQU   TCBRV164
TCBRV165 EQU   TCBRV164
TCBRV163 EQU   TCBRV155
TCBRV162 EQU   TCBRV155
TCBRV161 EQU   TCBRV155
TCBRV160 EQU   TCBRV155
TCBRV159 EQU   TCBRV155
TCBRV158 EQU   TCBRV155
TCBRV157 EQU   TCBRV155
TCBRV156 EQU   TCBRV155
TCBRV154 EQU   TCBRV146
TCBRV153 EQU   TCBRV146
TCBRV152 EQU   TCBRV146
TCBRV151 EQU   TCBRV146
TCBRV150 EQU   TCBRV146
TCBRV149 EQU   TCBRV146
TCBRV148 EQU   TCBRV146
TCBRV147 EQU   TCBRV146
TCBRV145 EQU   TCBXTNT2+26
TCBRV144 EQU   TCBXTNT2+24
TCBCAUF  EQU   TCBXTNT2+20
TCBRV142 EQU   TCBXTNT2+16
TCBRSV49 EQU   TCBXTNT2+12
TCBEVENT EQU   TCBXTNT2+8
TCBRCMP  EQU   TCBXTNT2+5
TCBRSVAB EQU   TCBXTNT2+4
TCBGTFA  EQU   TCBGTF+1
TCBRSV47 EQU   TCBTFLG
TCBRSV46 EQU   TCBTFLG
TCBRSV45 EQU   TCBTFLG
TCBRSV44 EQU   TCBTFLG
TCBRSV43 EQU   TCBTFLG
TCBDSPIT EQU   TCBTFLG
TCBERRTN EQU   TCBTFLG
TCBASYNC EQU   TCBTFLG
@NM00051 EQU   TCB+296
TCBSVCA2 EQU   TCB+292
TCBSWASA EQU   TCB+288
TCBDBTB  EQU   TCB+284
TCBRPT   EQU   TCB+280
TCBRV141 EQU   TCBRV133
TCBRV140 EQU   TCBRV133
TCBRV139 EQU   TCBRV133
TCBRV138 EQU   TCBRV133
TCBRV137 EQU   TCBRV133
TCBRV136 EQU   TCBRV133
TCBRV135 EQU   TCBRV133
TCBRV134 EQU   TCBRV133
TCBRV132 EQU   TCBRV124
TCBRV131 EQU   TCBRV124
TCBRV130 EQU   TCBRV124
TCBRV129 EQU   TCBRV124
TCBRV128 EQU   TCBRV124
TCBRV127 EQU   TCBRV124
TCBRV126 EQU   TCBRV124
TCBRV125 EQU   TCBRV124
TCBRV123 EQU   TCBFBYT2
TCBRV122 EQU   TCBFBYT2
TCBECBNV EQU   TCBFBYT2
TCBSSSYN EQU   TCBFBYT2
TCBFPRAP EQU   TCBFBYT2
TCBFDW   EQU   TCBFBYT2
TCBFMW   EQU   TCBFBYT2
TCBCNCB  EQU   TCBFBYT2
TCBLLH   EQU   TCBFBYT1
TCBRV113 EQU   TCBFBYT1
TCBEOT   EQU   TCBFBYT1
TCBRTM2  EQU   TCBFBYT1
TCBPGNLY EQU   TCBFBYT1
TCBNDIOS EQU   TCBFBYT1
TCBRV327 EQU   TCBFBYT1
TCBEOTFM EQU   TCBFBYT1
TCBAFFN  EQU   TCB+274
TCBRV326 EQU   TCB+272
TCBUKYSP EQU   TCB+268
TCBMODE  EQU   TCBESTAE+3
TCBERTYP EQU   TCBESTAE+2
TCBRV314 EQU   TCBESTRM
TCBRV313 EQU   TCBESTRM
TCBRV312 EQU   TCBESTRM
TCBRV311 EQU   TCBESTRM
TCBRV310 EQU   TCBESTRM
TCBRV309 EQU   TCBESTRM
TCBRV308 EQU   TCBESTRM
TCBETERM EQU   TCBESTRM
TCBSCBKY EQU   TCBESTAE
TCBRTM12 EQU   TCB+260
TCBTCBID EQU   TCB+256
TCBSTAFX EQU   TCBSTAWA
TCBSWA   EQU   TCB+248
TCBFOEA  EQU   TCBFOE+1
TCBRSV42 EQU   TCBFOE
TCBCCPVI EQU   TCBXSCT+2
TCBRV325 EQU   TCBXSCT+1
TCBRV324 EQU   TCBXSCT1
TCBRV323 EQU   TCBXSCT1
TCBRV322 EQU   TCBXSCT1
TCBRV321 EQU   TCBXSCT1
TCBRV320 EQU   TCBXSCT1
TCBRV319 EQU   TCBXSCT1
TCBS3A   EQU   TCBXSCT1
TCBACTIV EQU   TCBXSCT1
TCBRSV41 EQU   TCB+239
TCBTID   EQU   TCB+238
TCBRSVAA EQU   TCB+237
TCBABCUR EQU   TCB+236
TCBTMSAV EQU   TCB+232
TCBIOTIM EQU   TCB+228
TCBRTWA  EQU   TCB+224
TCBBACK  EQU   TCB+220
TCBTIRB  EQU   TCB+216
TCBAECB  EQU   TCB+212
TCBEXT2A EQU   TCBEXT2+1
TCBRSV39 EQU   TCBEXT2
TCBSTMCT EQU   TCB+207
TCBSYSCT EQU   TCB+206
TCBRSV37 EQU   TCB+205
TCBEXSVC EQU   TCBDAR
TCBDARMS EQU   TCBDAR
TCBDARWT EQU   TCBDAR
TCBDARO  EQU   TCBDAR
TCBDARMC EQU   TCBDARC
TCBDARD  EQU   TCBDAR
TCBDARS  EQU   TCBDAR
TCBDARP  EQU   TCBDAR
TCBGTOFM EQU   TCBFLGS7
TCBADMP  EQU   TCBFLGS7
TCBRSTSK EQU   TCBFLGS7
TCBSVCS  EQU   TCBFLGS7
TCBSTACK EQU   TCBFLGS7
TCBRSV34 EQU   TCBFLGS7
TCBRSV33 EQU   TCBFLGS7
TCBGPECB EQU   TCBFLGS7
TCBNTJS  EQU   TCBFLGS6
TCBAPG   EQU   TCBFLGS6
TCBMIGR  EQU   TCBFLGS6
TCBRV303 EQU   TCBFLGS6
TCBSPVLK EQU   TCBFLGS6
TCBCPU   EQU   TCBFLGS6
TCBPIE17 EQU   TCBFLGS6
TCBRV    EQU   TCBFLGS6
TCBRSV79 EQU   TCBNDSP5
TCBRSV78 EQU   TCBNDSP5
TCBRSV77 EQU   TCBNDSP5
TCBRSV76 EQU   TCBNDSP5
TCBRSV75 EQU   TCBNDSP5
TCBRSV74 EQU   TCBNDSP5
TCBRSV95 EQU   TCBNDSP5
TCBRSV94 EQU   TCBNDSP5
TCBRSV93 EQU   TCBNDSP4
TCBRSV92 EQU   TCBNDSP4
TCBRSV91 EQU   TCBNDSP4
TCBRSV90 EQU   TCBNDSP4
TCBRSV89 EQU   TCBNDSP4
TCBRSV88 EQU   TCBNDSP4
TCBRSV87 EQU   TCBNDSP4
TCBRSV86 EQU   TCBNDSP4
TCBEXT1A EQU   TCBEXT1+1
TCBRSV32 EQU   TCBEXT1
TCBEXCPD EQU   TCB+192
TCBIOBRC EQU   TCB+188
TCBDDWTC EQU   TCB+186
TCBDDEXC EQU   TCB+184
TCBJSCBB EQU   TCBJSCB+1
@NM00050 EQU   TCBRECDE
TCBREC   EQU   TCBRECDE
TCBMDIDS EQU   TCB+176
TCBNDINT EQU   TCBNDSP3
TCBRSV27 EQU   TCBNDSP3
TCBRSV26 EQU   TCBNDSP3
TCBRSV25 EQU   TCBNDSP3
TCBRSV24 EQU   TCBNDSP3
TCBSRBND EQU   TCBNDSP3
TCBRV302 EQU   TCBNDSP3
TCBLJSND EQU   TCBNDSP3
TCBABE   EQU   TCBNDSP2
TCBDSS   EQU   TCBNDSP2
TCBOWAIT EQU   TCBNDSP2
TCBIWAIT EQU   TCBNDSP2
TCBNDTS  EQU   TCBNDSP2
TCBNDSVC EQU   TCBNDSP2
TCBSTPP  EQU   TCBNDSP2
TCBABD   EQU   TCBNDSP2
TCBRSV22 EQU   TCBNDSP1
TCBPIEND EQU   TCBNDSP1
TCBTPSP  EQU   TCBNDSP1
TCBDDRND EQU   TCBNDSP1
TCBRSPND EQU   TCBNDSP1
TCBRSTND EQU   TCBNDSP1
TCBDARPN EQU   TCBNDSP1
TCBDARTN EQU   TCBNDSP1
TCBNDSP0 EQU   TCBNDSP
TCBUSER  EQU   TCB+168
TCBTCTB  EQU   TCBTCT+1
TCBRSV9C EQU   TCBTCTGF
TCBRSV9B EQU   TCBTCTGF
TCBRSV9A EQU   TCBTCTGF
TCBRSV99 EQU   TCBTCTGF
TCBRSV98 EQU   TCBTCTGF
TCBRSV97 EQU   TCBTCTGF
TCBRSV20 EQU   TCBTCTGF
TCBSMFGF EQU   TCBTCTGF
TCBSTABB EQU   TCBSTAB+1
TCBSTCUR EQU   TCBNSTAE
TCBRV301 EQU   TCBNSTAE
TCBSYNCH EQU   TCBNSTAE
TCBHALT  EQU   TCBNSTAE
TCBPPSUP EQU   TCBNSTAE
TCB33E   EQU   TCBNSTAE
TCBQUIES EQU   TCBNSTAE
TCBSTABE EQU   TCBNSTAE
TCBAQE   EQU   TCB+156
TCBPQE   EQU   TCB+152
TCBTSDP  EQU   TCB+151
TCBTSLP  EQU   TCB+150
TCBSTPCT EQU   TCB+149
TCBCPUBN EQU   TCBTSFLG
TCBDYDSP EQU   TCBTSFLG
TCBRSV18 EQU   TCBTSFLG
TCBRSV17 EQU   TCBTSFLG
TCBTIOTG EQU   TCBTSFLG
TCBATT   EQU   TCBTSFLG
TCBSTPPR EQU   TCBTSFLG
TCBRV300 EQU   TCBTSTSK
TCBECB   EQU   TCB+144
TCBIQE   EQU   TCB+140
TCBLTC   EQU   TCB+136
TCBOTC   EQU   TCB+132
TCBNTC   EQU   TCB+128
TCBJSTCA EQU   TCBJSTCB+1
TCBRSV16 EQU   TCBJSTCB
TCBTQET  EQU   TCBTME
TCBTCB   EQU   TCB+116
TCBFSAB  EQU   TCBFSA+1
TCBQEL   EQU   TCBFSA
TCBGRS15 EQU   TCBGRS+60
TCBGRS14 EQU   TCBGRS+56
TCBGRS13 EQU   TCBGRS+52
TCBGRS12 EQU   TCBGRS+48
TCBGRS11 EQU   TCBGRS+44
TCBGRS10 EQU   TCBGRS+40
TCBGRS9  EQU   TCBGRS+36
TCBGRS8  EQU   TCBGRS+32
TCBGRS7  EQU   TCBGRS+28
TCBGRS6  EQU   TCBGRS+24
TCBGRS5  EQU   TCBGRS+20
TCBGRS4  EQU   TCBGRS+16
TCBGRS3  EQU   TCBGRS+12
TCBGRS2  EQU   TCBGRS+8
TCBGRS1  EQU   TCBGRS+4
TCBGRS0  EQU   TCBGRS
TCBJPQB  EQU   TCBJPQ+1
TCBRSV15 EQU   TCBPURGE
TCBRSV14 EQU   TCBPURGE
TCBRSV13 EQU   TCBPURGE
TCBRSV12 EQU   TCBPURGE
TCBRSV11 EQU   TCBPURGE
TCBRSV10 EQU   TCBPURGE
TCBRSV09 EQU   TCBPURGE
TCBJPQF  EQU   TCBPURGE
TCBJLB   EQU   TCB+40
TCBLLS   EQU   TCB+36
TCBDSP   EQU   TCB+35
TCBLMP   EQU   TCB+34
TCBPNDSP EQU   TCBFLGS5
TCBFCD1  EQU   TCBFLGS5
TCBSTP   EQU   TCBFLGS5
TCBSYS   EQU   TCBFLGS5
TCBANDSP EQU   TCBFLGS5
TCBPAGE  EQU   TCBFLGS5
TCBUXNDF EQU   TCBABWF
TCBFC    EQU   TCBFLGS5
TCBONDSP EQU   TCBFLGS4
TCBMPCND EQU   TCBFLGS4
TCBMPCVQ EQU   TCBFLGS4
TCBUXNDV EQU   TCBFLGS4
TCBHNDSP EQU   TCBFLGS4
TCBRQENA EQU   TCBFLGS4
TCBSER   EQU   TCBFLGS4
TCBNDUMP EQU   TCBFLGS4
TCBDWSTA EQU   TCBFLGS3
TCBRSV08 EQU   TCBFLGS3
TCBRSV07 EQU   TCBFLGS3
TCBRSV06 EQU   TCBFLGS3
TCBABGM  EQU   TCBFLGS3
TCBABTRM EQU   TCBFLGS3
TCBADINP EQU   TCBFLGS3
TCBFSM   EQU   TCBFLGS3
TCBFTS   EQU   TCBFLGS2
TCBFETXR EQU   TCBFLGS2
TCBFDSOP EQU   TCBFLGS2
TCBFJMC  EQU   TCBFLGS2
TCBFSMC  EQU   TCBFLGS2
TCBFABOP EQU   TCBFLGS2
TCBFSTI  EQU   TCBFLGS2
TCBFOINP EQU   TCBFLGS2
TCBFX    EQU   TCBFLGS1
TCBFS    EQU   TCBFLGS1
TCBFT    EQU   TCBFLGS1
TCBPDUMP EQU   TCBFLGS1
TCBNONPR EQU   TCBFLGS1
TCBFERA  EQU   TCBFLGS1
TCBFE    EQU   TCBFLGS1
TCBFA    EQU   TCBFLGS1
TCBZERO  EQU   TCBPKF
TCBFLAG  EQU   TCBPKF
TCBMSSB  EQU   TCBMSS+1
TCBRSV03 EQU   TCBMSS
TCBTRNB  EQU   TCBTRN+1
TCBRSV02 EQU   TCBABF
TCBOLTEP EQU   TCBABF
TCBTCP   EQU   TCBABF
TCBTCPP  EQU   TCBABF
TCBRSV01 EQU   TCBABF
TCBGRPH  EQU   TCBABF
TCBNOCHK EQU   TCBABF
TCBMOD91 EQU   TCBABF
TCBCMPC  EQU   TCBCMP+1
TCBRV318 EQU   TCBCMSG
TCBRV317 EQU   TCBCIND
TCBRV316 EQU   TCBCWTO
TCBCASID EQU   TCBCDBL
TCBNOCC  EQU   TCBSTCC
TCBDMPO  EQU   TCBCPP
TCBCSTEP EQU   TCBCMPF
TCBCREQ  EQU   TCBCMPF
TCBTIO   EQU   TCB+12
TCBDEB   EQU   TCB+8
TCBPIEA  EQU   TCBPIE+1
TCBPM    EQU   TCBPMASK
@NM00049 EQU   TCBPMASK
TCBFRS6  EQU   TCBFRS+24
TCBFRS4  EQU   TCBFRS+16
TCBFRS2  EQU   TCBFRS+8
TCBFRS0  EQU   TCBFRS
NEXTTCB  EQU   TCBWORDS
CVTLEVL  EQU   CVTRELNO+2
CVTNUMB  EQU   CVTRELNO
CVTMDL   EQU   CVTFIX+250
@NM00048 EQU   CVTFIX+248
@NM00047 EQU   CVTFIX
CVTRV482 EQU   CVTXTNT2+128
CVTRV481 EQU   CVTXTNT2+124
CVTRV480 EQU   CVTXTNT2+120
CVTRV479 EQU   CVTXTNT2+118
CVTRV478 EQU   CVTXTNT2+117
CVTRV477 EQU   CVTXTNT2+116
CVTRV476 EQU   CVTXTNT2+115
CVTRV475 EQU   CVTXTNT2+114
CVTRV474 EQU   CVTRV466
CVTRV473 EQU   CVTRV466
CVTRV472 EQU   CVTRV466
CVTRV471 EQU   CVTRV466
CVTRV470 EQU   CVTRV466
CVTRV469 EQU   CVTRV466
CVTRV468 EQU   CVTRV466
CVTRV467 EQU   CVTRV466
CVTRV465 EQU   CVTRV457
CVTRV464 EQU   CVTRV457
CVTRV463 EQU   CVTRV457
CVTRV462 EQU   CVTRV457
CVTRV461 EQU   CVTRV457
CVTRV460 EQU   CVTRV457
CVTRV459 EQU   CVTRV457
CVTRV458 EQU   CVTRV457
CVTRV456 EQU   CVTXTNT2+108
CVTRV455 EQU   CVTXTNT2+104
CVTRV454 EQU   CVTXTNT2+100
CVTRV453 EQU   CVTXTNT2+96
CVTRV452 EQU   CVTXTNT2+94
CVTRV451 EQU   CVTXTNT2+92
CVTRV450 EQU   CVTXTNT2+90
CVTRV449 EQU   CVTXTNT2+88
CVTRV448 EQU   CVTXTNT2+87
CVTRV447 EQU   CVTXTNT2+86
CVTRV446 EQU   CVTRV438
CVTRV445 EQU   CVTRV438
CVTRV444 EQU   CVTRV438
CVTRV443 EQU   CVTRV438
CVTRV442 EQU   CVTRV438
CVTRV441 EQU   CVTRV438
CVTRV440 EQU   CVTRV438
CVTRV439 EQU   CVTRV438
CVTRV437 EQU   CVTRV429
CVTRV436 EQU   CVTRV429
CVTRV435 EQU   CVTRV429
CVTRV434 EQU   CVTRV429
CVTRV433 EQU   CVTRV429
CVTRV432 EQU   CVTRV429
CVTRV431 EQU   CVTRV429
CVTRV430 EQU   CVTRV429
CVTRV428 EQU   CVTXTNT2+80
CVTRV427 EQU   CVTXTNT2+76
CVTRV426 EQU   CVTXTNT2+72
CVTRV425 EQU   CVTXTNT2+68
CVTATACT EQU   CVTATCVT
CVTRV423 EQU   CVTXTNT2+62
CVTRV422 EQU   CVTXTNT2+60
CVTRV421 EQU   CVTXTNT2+58
CVTRV420 EQU   CVTXTNT2+56
CVTRV419 EQU   CVTXTNT2+55
CVTRV418 EQU   CVTXTNT2+54
CVTRV417 EQU   CVTRV409
CVTRV416 EQU   CVTRV409
CVTRV415 EQU   CVTRV409
CVTRV414 EQU   CVTRV409
CVTRV413 EQU   CVTRV409
CVTRV412 EQU   CVTRV409
CVTRV411 EQU   CVTRV409
CVTRV410 EQU   CVTRV409
CVTRV408 EQU   CVTRV400
CVTRV407 EQU   CVTRV400
CVTRV406 EQU   CVTRV400
CVTRV405 EQU   CVTRV400
CVTRV404 EQU   CVTRV400
CVTRV403 EQU   CVTRV400
CVTRV402 EQU   CVTRV400
CVTRV401 EQU   CVTRV400
CVTICB   EQU   CVTXTNT2+48
CVTSKTA  EQU   CVTXTNT2+44
CVTCCVT  EQU   CVTXTNT2+40
CVTRSV98 EQU   CVTXTNT2+36
CVTRSV97 EQU   CVTXTNT2+34
CVTRSV96 EQU   CVTXTNT2+32
CVTOLTEP EQU   CVTXTNT2+28
CVTQIDA  EQU   CVTQID+1
CVTRSV95 EQU   CVTQID
CVTRSV94 EQU   CVTXTNT2+20
CVTRSV93 EQU   CVTXTNT2+16
CVTRSV92 EQU   CVTXTNT2+12
CVTDEBVR EQU   CVTXTNT2+8
CVTRSV91 EQU   CVTXTNT2+6
CVTRSV9H EQU   CVTFLGBT
CVTRSV9G EQU   CVTFLGBT
CVTRSV9F EQU   CVTFLGBT
CVTRSV9E EQU   CVTFLGBT
CVTRSV9D EQU   CVTFLGBT
CVTRSV9C EQU   CVTFLGBT
CVTVME   EQU   CVTFLGBT
CVTNPE   EQU   CVTFLGBT
CVTNUCLS EQU   CVTXTNT2+4
CVTDSSVA EQU   CVTDSSV+1
CVTRSV89 EQU   CVTDSSV
CVTRSV88 EQU   CVTXTNT1+8
CVTRSV87 EQU   CVTXTNT1+4
CVTFACHN EQU   CVTXTNT1
CVTRV488 EQU   CVTMAP+412
CVTRV487 EQU   CVTMAP+408
CVTRV486 EQU   CVTMAP+404
CVTRV485 EQU   CVTMAP+400
CVTACTAP EQU   CVTMAP+396
CVTAUTH  EQU   CVTMAP+392
CVTATMCA EQU   CVTATMCT+1
CVTATMST EQU   CVTATMCT
CVTRSV61 EQU   CVTMAP+384
CVTVOLT1 EQU   CVTVOLM1+1
CVTVOLI1 EQU   CVTVOLF1
CVTSTOA  EQU   CVTMAP+376
CVTRSV58 EQU   CVTMAP+374
CVTRSV57 EQU   CVTMAP+372
CVTDDCE  EQU   CVTMAP+368
CVTPNWFR EQU   CVTMAP+364
CVTSMF   EQU   CVTMAP+360
CVTSULK  EQU   CVTMAP+358
CVTSLKO  EQU   CVTSYSK
CVTSLKP  EQU   CVTSYSK
CVTSLKQ  EQU   CVTSYSK
CVTSLKR  EQU   CVTSYSK
CVTRSV56 EQU   CVTSYSK
CVTRSV55 EQU   CVTSYSK
CVTRSV54 EQU   CVTSYSK
CVTRSV53 EQU   CVTSYSK
CVTRSV52 EQU   CVTA1F1
CVTRSV51 EQU   CVTA1F1
CVTRSV50 EQU   CVTA1F1
CVTRSV49 EQU   CVTA1F1
CVTRSV48 EQU   CVTA1F1
CVTRSV47 EQU   CVTA1F1
CVTSRSW  EQU   CVTA1F1
CVTPFSW  EQU   CVTA1F1
CVTPCVT  EQU   CVTMAP+352
CVTRSV46 EQU   CVTMAP+344
CVTRSV45 EQU   CVTMAP+340
CVTRSV44 EQU   CVTMAP+338
CVTRSV43 EQU   CVTMAP+336
CVTHJESA EQU   CVTHJES+1
CVTRSV42 EQU   CVTHJES
CVTEXT2A EQU   CVTEXT2+1
CVTRSV41 EQU   CVTEXT2
CVTAPFA  EQU   CVTAPF+1
CVTRSV40 EQU   CVTAPF
CVTRV518 EQU   CVTINTLA
CVTRV517 EQU   CVTERPV
CVTEORM  EQU   CVTMAP+312
CVTMCHPR EQU   CVTMAP+308
CVTTZ    EQU   CVTMAP+304
CVTJEPS  EQU   CVTMAP+300
CVTJESCT EQU   CVTMAP+296
CVTMODE  EQU   CVTMAP+292
CVTPTRV  EQU   CVTMAP+288
CVTREAL  EQU   CVTMAP+284
CVTRSV39 EQU   CVTMAP+280
CVTRSV38 EQU   CVTMAP+276
CVTDMSRA EQU   CVTDMSR+1
CVTRV634 EQU   CVTDMSRF
CVTRV633 EQU   CVTDMSRF
CVTRV632 EQU   CVTDMSRF
CVTRV631 EQU   CVTDMSRF
CVTRV630 EQU   CVTDMSRF
CVTRV629 EQU   CVTDMSRF
CVTUDUMP EQU   CVTDMSRF
CVTSDUMP EQU   CVTDMSRF
CVTQMSGA EQU   CVTQMSG+1
CVTRSV36 EQU   CVTQMSG
CVTPURGA EQU   CVTPURG+1
CVTRSV35 EQU   CVTPURG
CVTATERA EQU   CVTATER+1
CVTSYST  EQU   CVTATER
CVTVOLT2 EQU   CVTTAT
CVTVOLI2 EQU   CVTVOLF2
CVTAQAVB EQU   CVTAQAVT+1
CVTRSV34 EQU   CVTTCMFG
CVTRSV33 EQU   CVTTCMFG
CVTRSV32 EQU   CVTTCMFG
CVTRSV31 EQU   CVTTCMFG
CVTRSV30 EQU   CVTTCMFG
CVTRSV29 EQU   CVTTCMFG
CVTLDEV  EQU   CVTTCMFG
CVTTCRDY EQU   CVTTCMFG
CVTGTFA  EQU   CVTGTF+1
CVTRSV27 EQU   CVTGTFST
CVTRNIO  EQU   CVTGTFST
CVTUSR   EQU   CVTGTFST
CVTRV318 EQU   CVTFORM
CVTRV317 EQU   CVTTMODE
CVTRV316 EQU   CVTSTATE
CVTRV315 EQU   CVTGTFS
CVTGTFAV EQU   CVTGTFS
CVT0SCR1 EQU   CVTMAP+232
CVTRV515 EQU   CVTMAP+228
CVTRMS   EQU   CVTMAP+224
CVTPATCH EQU   CVTMAP+220
CVTTSCE  EQU   CVTMAP+216
CVTLNKSC EQU   CVTMAP+214
CVTQABST EQU   CVTMAP+212
CVTMDLDS EQU   CVTMAP+208
CVTUSER  EQU   CVTMAP+204
CVTABEND EQU   CVTMAP+200
CVTSMCA  EQU   CVTMAP+196
CVTRSV18 EQU   CVTMAP+192
CVTQLPAQ EQU   CVTMAP+188
CVTQCDSR EQU   CVTMAP+184
CVTRSV17 EQU   CVTOPTB
CVTRSV16 EQU   CVTOPTB
CVTFP    EQU   CVTOPTB
CVTAPTHR EQU   CVTOPTB
CVTNLOG  EQU   CVTOPTB
CVTTOD   EQU   CVTOPTB
CVTCTIMS EQU   CVTOPTB
CVTPROT  EQU   CVTOPTB
CVTXPFP  EQU   CVTOPTA
CVTASCII EQU   CVTOPTA
CVTRSV13 EQU   CVTOPTA
CVTRSV12 EQU   CVTOPTA
CVTNIP   EQU   CVTOPTA
CVTDDR   EQU   CVTOPTA
CVTAPR   EQU   CVTOPTA
CVTCCH   EQU   CVTOPTA
CVTSNCTR EQU   CVTMAP+180
CVTQMWR  EQU   CVTMAP+176
CVTQOCR  EQU   CVTMAP+172
CVT1EF00 EQU   CVTMAP+168
CVTMZ00  EQU   CVTMAP+164
CVTSV76Q EQU   CVTSV76C
CVTRSV11 EQU   CVTMAP+156
CVT0PT01 EQU   CVTMAP+152
CVTMSER  EQU   CVTMAP+148
CVTRV516 EQU   CVTIERLC
CVTILCH  EQU   CVTMAP+140
CVT0DS   EQU   CVTMAP+136
CVTFBOSV EQU   CVTMAP+132
CVTNUCB  EQU   CVTMAP+128
CVTIXAVL EQU   CVTMAP+124
CVTSV76M EQU   CVTIOQET
CVTDCBA  EQU   CVTMAP+117
CVTMVS2  EQU   CVTDCB
CVT6DAT  EQU   CVTDCB
CVT4MPS  EQU   CVTDCB
CVTRSV09 EQU   CVTDCB
CVT4MS1  EQU   CVTDCB
CVT2SPS  EQU   CVTDCB
CVT1SSS  EQU   CVTDCB
CVTRSV08 EQU   CVTDCB
CVTSTB   EQU   CVTMAP+112
CVTQTD00 EQU   CVTMAP+108
CVTQTE00 EQU   CVTMAP+104
CVTCUCB  EQU   CVTMAP+100
CVTSJQ   EQU   CVTMAP+96
CVTPBLDL EQU   CVTMAP+92
CVTTPC   EQU   CVTMAP+88
CVTSVDCB EQU   CVTMAP+84
CVTBRET  EQU   CVTMAP+82
CVTEXIT  EQU   CVTMAP+80
CVT0FN00 EQU   CVTMAP+76
CVTDARA  EQU   CVTDAR+1
CVTRSV07 EQU   CVTFLGS1
CVTRSV06 EQU   CVTFLGS1
CVTRSV05 EQU   CVTFLGS1
CVTRSV04 EQU   CVTFLGS1
CVTRSV03 EQU   CVTFLGS1
CVTRSV02 EQU   CVTFLGS1
CVTRSV01 EQU   CVTFLGS1
CVTDMPLK EQU   CVTFLGS1
CVTXITP  EQU   CVTMAP+68
CVTZDTAB EQU   CVTMAP+64
CVTMSLT  EQU   CVTMAP+60
CVTDATE  EQU   CVTMAP+56
CVTBTERM EQU   CVTMAP+52
CVTSYSAD EQU   CVTMAP+48
CVTXTLER EQU   CVTMAP+44
CVTILK2  EQU   CVTMAP+40
CVTILK1  EQU   CVTMAP+36
CVTPRLTV EQU   CVTMAP+32
CVTPCNVT EQU   CVTMAP+28
CVT0VL00 EQU   CVTMAP+24
CVTXAPG  EQU   CVTMAP+20
CVTBUF   EQU   CVTMAP+16
CVTJOB   EQU   CVTMAP+12
CVTLINK  EQU   CVTMAP+8
CVT0EF00 EQU   CVTMAP+4
CNTVAR   EQU   CNTRLINF
VARINFO  EQU   VARFIELD+2
VARLEN   EQU   VARFIELD
REPGOPT  EQU   REPCNTRL+6
REPCNT   EQU   REPCNTRL+5
@NM00046 EQU   EXTRCDPT+3
EXTGOCI  EQU   EXTRCDPT
NREPCV   EQU   CATRCD+47
RCDSIZ   EQU   CATRCD+45
RCDID    EQU   CATRCD+44
@NM00045 EQU   CATRCD+27
RCDEXSEC EQU   RCDSECF
RCDDICTS EQU   CATRCD+22
RCDRACTS EQU   CATRCD+18
RCDCRADT EQU   CATRCD+14
RCDCRACI EQU   CATRCD+11
RCDCRAVL EQU   CATRCD+5
RCDRELID EQU   CATRCD+4
RCDCINO  EQU   CATRCD+1
RCDKEYTY EQU   CATRCD
CATGOGC  EQU   CATGOGC1
CATGODEL EQU   CATGOGC1
CATGOEXT EQU   CATGOGC1
CATGODSP EQU   CATGOCI+1
@NM00044 EQU   CATGOFLG
CCACPE4  EQU   CCARAB+16
CCACPE3  EQU   CCARAB+12
@NM00043 EQU   CCARAB+2
CCARABRI EQU   CCARAB+1
CCARBUPD EQU   CCARABFL
@NM00042 EQU   CCARABFL
CCARBPA  EQU   CCARABFL
CCARBWR  EQU   CCARABFL
CCARBU2  EQU   CCARABFL
CCARBU1  EQU   CCARABFL
CCARBUR  EQU   CCARABFL
DIC2GC   EQU   DIC2ENT+3
DIC2LC   EQU   DIC2ENT+2
DIC2ST   EQU   DIC2ENT+1
@NM00041 EQU   DIC2FLGS
DIC2UPGD EQU   DIC2FLGS
DIC2SCRA EQU   DIC2FLGS
DIC2MV   EQU   DIC2FLGS
DIC2FLG  EQU   DIC2FLGS
DIC2COMB EQU   DIC2FLGS
DIC2REP  EQU   DIC2FLGS
DIC2VAR  EQU   DIC2FLGS
DICTGC   EQU   DICTENT+3
DICTLC   EQU   DICTENT+2
DICTST   EQU   DICTENT+1
@NM00040 EQU   DICTFLGS
DICTUPGD EQU   DICTFLGS
DICTSCRA EQU   DICTFLGS
DICTMV   EQU   DICTFLGS
DICTFLG  EQU   DICTFLGS
DICTCOMB EQU   DICTFLGS
DICTREP  EQU   DICTFLGS
DICTVAR  EQU   DICTFLGS
ENTNAMEV EQU   ENTNAMES+1
ENTNAMET EQU   ENTNAMES
WKALEN2  EQU   USERWKA+2
CTGFLDTS EQU   CTGFLDRE
@NM00039 EQU   CTGFLDRE
CTGFLDCD EQU   CTGFL+1
@NM00037 EQU   CTGFBFLG
CTGNGDSN EQU   CTGFBFLG
CTGGDGB  EQU   CTGFBFLG
CTGKEEP  EQU   CTGFBFLG
CTGPAR   EQU   CTGFBFLG
CTGFDBK  EQU   CTGNEWNM
CTGTYPE  EQU   CTGPL+18
@NM00036 EQU   CTGDSORG
@NM00035 EQU   CTGOPTN4
CTGTIOT  EQU   CTGOPTN4
CTGBYPMT EQU   CTGOPTN4
CTGCOIN  EQU   CTGOPTN4
CTGNPROF EQU   CTGOPTN4
CTGDOCAT EQU   CTGOPTN4
CTGLBASE EQU   CTGOPTN4
CTGNUM   EQU   CTGOPTN3
CTGSRH   EQU   CTGOPTN3
CTGGDGL  EQU   CTGOPTN3
@NM00034 EQU   CTGOPTN2
CTGSCR   EQU   CTGOPTN2
CTGOVRID EQU   CTGOPTN2
CTGDISC  EQU   CTGOPTN2
CTGSWAP  EQU   CTGRCATN
CTGGTALL EQU   CTGREL
CTGNSVS  EQU   CTGEXT
CTGREAD  EQU   CTGOPTN1
CTGUPD   EQU   CTGOPTN1
CTGCI    EQU   CTGOPTN1
CTGMAST  EQU   CTGOPTN1
CTGBYPSS EQU   CTGOPTN1
@NM00033 EQU   IGGCCA+1508
CCARMINN EQU   CCAREQDQ+8
CCARMAJN EQU   CCAREQDQ+4
CCAREDRC EQU   CCAREQDQ+3
@NM00032 EQU   CCAREDOP
CCAREDSH EQU   CCAREDOP
CCAREDLN EQU   CCAREQDQ+1
CCAREDFF EQU   CCAREQDQ
CCASAVMN EQU   CCADGDGA
CCARETRX EQU   CCAERCDX+1
CCARESNX EQU   CCAERCDX
CCAMODDX EQU   CCAPROBX
CCASMFCD EQU   CCASMFP+3
CCASMFRC EQU   CCASMFP+2
CCASMFMD EQU   CCASMFP
CCAREWKA EQU   IGGCCA+1476
CCAVTS   EQU   IGGCCA+1468
CCARAVCA EQU   IGGCCA+1460
CCARANCA EQU   IGGCCA+1452
CCADICTS EQU   IGGCCA+1448
CCASUMTT EQU   IGGCCA+1445
ENQPCCB  EQU   CCAFLG10
CCADEFUN EQU   CCAFLG10
CCAPRANX EQU   CCAFLG10
CCARARTC EQU   CCAFLG10
CCARAFEV EQU   CCAFLG10
CCACATAC EQU   CCAFLG10
CCAINCPL EQU   CCAFLG10
@NM00031 EQU   CCARALSA+2
CCACRABT EQU   CCARALSA
CCARAREC EQU   IGGCCA+1436
CCACRACI EQU   IGGCCA+1420
CCASBASE EQU   IGGCCA+1417
CCATNQCT EQU   IGGCCA+1416
CCACUMPL EQU   IGGCCA+1412
CCADSPWA EQU   CCABZSAV
CCAMODNM EQU   CCAREGS+4
@NM00030 EQU   CCAREGS
@NM00029 EQU   CCAFLG11
CCAF11B6 EQU   CCAFLG11
CCAF11B5 EQU   CCAFLG11
@NM00028 EQU   CCAFLG11
@NM00027 EQU   IGGCCA+1057
@NM00026 EQU   CCARVFG1
RVWG     EQU   CCARVFG1
RVRPLMFG EQU   CCARVFG1
RVESBOR  EQU   CCARVFG1
RVESBO   EQU   CCARVFG1
RVCMSFG  EQU   CCARVFG1
RVARFI   EQU   CCARVFG1
ARFSBECH EQU   CCAARFWA+12
ARFGMADR EQU   CCAARFWA+4
ARFLEN   EQU   ARFGMLEN+1
ARFGMLP  EQU   ARFGMLEN
MNATARG2 EQU   CCAMNAT+244
MNATARG1 EQU   CCAMNAT+241
@NM00025 EQU   MNATFLGS
MNATFCLS EQU   MNATFLGS
@NM00024 EQU   MNATFLGS
MNATVAL  EQU   MNATFLGS
@NM00023 EQU   CCAMNAT+1
@NM00022 EQU   MNATTOP
CCABMRB2 EQU   IGGCCA+740
CCABMRB1 EQU   IGGCCA+736
CCABMWK4 EQU   IGGCCA+732
CCABMWK3 EQU   IGGCCA+728
CCABMWK2 EQU   IGGCCA+724
CCABMWK1 EQU   IGGCCA+720
CCABMSTR EQU   IGGCCA+718
CCABMBYT EQU   IGGCCA+716
CCABMBTL EQU   IGGCCA+714
CCABMBT1 EQU   IGGCCA+712
CCABMEND EQU   IGGCCA+708
CCABMPTR EQU   IGGCCA+704
CCABMGOP EQU   IGGCCA+700
CCABMPAD EQU   IGGCCA+699
@NM00021 EQU   IGGCCA+697
CCABMOST EQU   CCABMOFG
CCABMOTR EQU   CCABMOUT+2
CCABMONN EQU   CCABMOUT
@NM00020 EQU   CCABMINP+7
CCABMLST EQU   CCABMFLG
CCABMCCK EQU   CCABMFLG
CCABMSET EQU   CCABMFLG
CCABMCHK EQU   CCABMFLG
CCABMST  EQU   CCABMFLG
CCABMMIN EQU   CCABMINP+4
CCABMLIM EQU   CCABMINP+2
CCABMTRK EQU   CCABMINP
CCAXLATE EQU   IGGCCA+640
CCADEL2  EQU   IGGCCA+637
CCADEL1  EQU   IGGCCA+634
CCAVAR1  EQU   IGGCCA+614
CCAVAR   EQU   IGGCCA+594
CCADELN  EQU   IGGCCA+592
CCAVARPT EQU   IGGCCA+588
CCARBASE EQU   IGGCCA+584
CCARRAB  EQU   IGGCCA+580
CCAVARLN EQU   IGGCCA+578
CCACI3   EQU   IGGCCA+575
CCACI2   EQU   IGGCCA+572
CCACI1   EQU   IGGCCA+569
CCACHAIN EQU   IGGCCA+566
CCASMFLN EQU   IGGCCA+564
CCASMFG2 EQU   CCASMFLG+1
@NM00019 EQU   CCASMFG1
CCASMFAL EQU   CCASMFSR
CCASMFDF EQU   CCASMFUC
CCASMFCT EQU   IGGCCA+560
CCASMFRD EQU   IGGCCA+556
CCANORBA EQU   IGGCCA+555
CCARESUM EQU   CCAFLG9
CCARAICI EQU   CCAFLG9
CCARAACT EQU   CCAFLG9
CCAUCRA  EQU   CCAFLG9
CCARACR  EQU   CCAFLG9
CCARALRD EQU   CCAFLG9
CCARAEOV EQU   CCAFLG9
CCARABYC EQU   CCAFLG9
CCAAUCAT EQU   CCAFLG8
CCALEOD  EQU   CCAFLG8
CCAVRIND EQU   CCAFLG8
CCALPIND EQU   CCAFLG8
CCASCICK EQU   CCAFLG8
CCASCRA  EQU   CCAFLG8
CCAVBUFI EQU   CCAFLG8
CCADSRCL EQU   CCAFLG8
CCACRABU EQU   CCAFLG7
CCAFEOV  EQU   CCAFLG7
CCAROREQ EQU   CCAFLG7
CCAONCE  EQU   CCAFLG7
CCASMFBR EQU   CCAFLG7
CCASMFA  EQU   CCAFLG7
CCASMFEX EQU   CCAFLG7
CCALSP   EQU   CCAFLG7
CCALCPL  EQU   IGGCCA+548
CCASMFPT EQU   IGGCCA+544
CCAALPTR EQU   IGGCCA+540
CCAILNG2 EQU   IGGCCA+536
CCAILNG3 EQU   IGGCCA+532
CCASDWAP EQU   IGGCCA+528
CCACDTCT EQU   IGGCCA+522
CCADTCT  EQU   IGGCCA+520
CCACDTA  EQU   IGGCCA+516
CCADTA   EQU   IGGCCA+512
CCASVCI1 EQU   IGGCCA+509
CCASVCI  EQU   IGGCCA+506
CCADISP  EQU   IGGCCA+504
CCAREPCT EQU   IGGCCA+502
CCADIFF  EQU   IGGCCA+500
CCADLEN  EQU   IGGCCA+498
CCAIXTPL EQU   IGGCCA+496
CCAGRHI1 EQU   CCASSEQ
CCARCDID EQU   CCAGRGC
CCASAVID EQU   IGGCCA+492
CCANEFV  EQU   IGGCCA+491
CCAGVEXT EQU   IGGCCA+488
CCANEVV  EQU   IGGCCA+486
CCAGVCT  EQU   IGGCCA+484
CCARABSM EQU   CCAIDPT3
CCAIDPT2 EQU   IGGCCA+476
CCASMFIX EQU   IGGCCA+474
CCACNIX  EQU   IGGCCA+472
CCARBAL  EQU   IGGCCA+470
CCATLEN  EQU   CCATLNG
CCARBA2  EQU   CCARBA+16
CCARBA1  EQU   CCARBA+12
CCATT    EQU   CCARBA+10
CCACCHH2 EQU   CCACRADT
CCACCHH1 EQU   CCACRAVL+2
CCASS    EQU   CCACRAVL
CCATEST  EQU   IGGCCA+444
CCATNO   EQU   IGGCCA+442
CCATREL  EQU   IGGCCA+410
CCATNUM  EQU   IGGCCA+408
CCATNREL EQU   IGGCCA+406
CCAIXREL EQU   IGGCCA+404
CCAIXFPL EQU   IGGCCA+402
@NM00018 EQU   CCAMSFLG
CCASN1   EQU   CCASN
CCALREL1 EQU   CCALREL
CCAGC    EQU   IGGCCA+395
CCACBASE EQU   IGGCCA+392
CCARABL  EQU   IGGCCA+388
CCARABF  EQU   IGGCCA+384
CCARABB  EQU   IGGCCA+380
CCAMCPL  EQU   CCAXCPL
CCARABPT EQU   IGGCCA+368
CCATFLPT EQU   CCAFLPT
CCAILNG  EQU   IGGCCA+360
CCASL    EQU   IGGCCA+358
CCAGOPLN EQU   IGGCCA+356
CCACPE71 EQU   IGGCCA+352
CCAIDPT  EQU   CCACPE7
CCARABSE EQU   CCACPE61
CCACPE53 EQU   IGGCCA+336
CCACPE52 EQU   IGGCCA+332
CCACPE51 EQU   IGGCCA+328
CCALUME  EQU   IGGCCA+324
CCAEXCMS EQU   CCACMS+4
CCACMSWA EQU   CCACMS
CCARPRM  EQU   IGGCCA+312
@NM00017 EQU   CCAMSSPL+10
@NM00016 EQU   CCAMSSPL+8
CCAEDUCB EQU   CCAEQDQ+12
CCAEDRNM EQU   CCAEQDQ+8
CCAEDQNM EQU   CCAEQDQ+4
CCAEDRCD EQU   CCAEQDQ+3
@NM00015 EQU   CCAEDOPT
CCAEDSHR EQU   CCAEDOPT
CCAEDRLN EQU   CCAEQDQ+1
CCAASCI  EQU   IGGCCA+271
CCAASCIX EQU   IGGCCA+270
CCACRRP  EQU   IGGCCA+269
CCAASCIK EQU   IGGCCA+268
CCAEXTTH EQU   CCAEXTDE+6
CCAEXTHH EQU   CCAEXTAD+2
CCAEXTCC EQU   CCAEXTAD
CCAEXTSS EQU   CCAEXTDE
CCASSVOL EQU   CCADESA+2
CCAIXEXT EQU   CCADESA+1
CCANDEXT EQU   CCADESA
CCAQLEN  EQU   IGGCCA+219
CCASC    EQU   IGGCCA+218
CCATQDB  EQU   CCATIQRN+2
CCATASID EQU   CCATIQRN
CCARPLT  EQU   IGGCCA+211
CCARPLX  EQU   IGGCCA+210
CCARPLF  EQU   IGGCCA+209
CCARPLK  EQU   IGGCCA+208
CCACPE45 EQU   CCAR5SEG+8
CCACPE35 EQU   CCAR5SEG+4
CCACPE25 EQU   CCAR5SEG
@NM00014 EQU   CCARAB5+2
CCAR5RPL EQU   CCARAB5+1
CCAR5UPD EQU   CCAR5FLG
@NM00013 EQU   CCAR5FLG
CCAR5PA  EQU   CCAR5FLG
CCAR5WR  EQU   CCAR5FLG
CCAR5U2  EQU   CCAR5FLG
CCAR5U1  EQU   CCAR5FLG
CCAR5UR  EQU   CCAR5FLG
CCACPE44 EQU   CCAR4SEG+8
CCACPE34 EQU   CCAR4SEG+4
CCACPE24 EQU   CCAR4SEG
@NM00012 EQU   CCARAB4+2
CCAR4RPL EQU   CCARAB4+1
CCAR4UPD EQU   CCAR4FLG
@NM00011 EQU   CCAR4FLG
CCAR4PA  EQU   CCAR4FLG
CCAR4WR  EQU   CCAR4FLG
CCAR4U2  EQU   CCAR4FLG
CCAR4U1  EQU   CCAR4FLG
CCAR4UR  EQU   CCAR4FLG
CCACPE43 EQU   CCAR3SEG+8
CCACPE33 EQU   CCAR3SEG+4
CCACPE23 EQU   CCAR3SEG
@NM00010 EQU   CCARAB3+2
CCAR3RPL EQU   CCARAB3+1
CCAR3UPD EQU   CCAR3FLG
@NM00009 EQU   CCAR3FLG
CCAR3PA  EQU   CCAR3FLG
CCAR3WR  EQU   CCAR3FLG
CCAR3U2  EQU   CCAR3FLG
CCAR3U1  EQU   CCAR3FLG
CCAR3UR  EQU   CCAR3FLG
CCACPE42 EQU   CCAR2SEG+8
CCACPE32 EQU   CCAR2SEG+4
CCACPE22 EQU   CCAR2SEG
@NM00008 EQU   CCARAB2+2
CCAR2RPL EQU   CCARAB2+1
CCAR2UPD EQU   CCAR2FLG
@NM00007 EQU   CCAR2FLG
CCAR2PA  EQU   CCAR2FLG
CCAR2WR  EQU   CCAR2FLG
CCAR2U2  EQU   CCAR2FLG
CCAR2U1  EQU   CCAR2FLG
CCAR2UR  EQU   CCAR2FLG
CCACPE41 EQU   CCAR1SEG+8
CCACPE31 EQU   CCAR1SEG+4
CCACPE21 EQU   CCAR1SEG
@NM00006 EQU   CCARAB1+2
CCAR1RPL EQU   CCARAB1+1
CCAR1UPD EQU   CCAR1FLG
@NM00005 EQU   CCAR1FLG
CCAR1PA  EQU   CCAR1FLG
CCAR1WR  EQU   CCAR1FLG
CCAR1U2  EQU   CCAR1FLG
CCAR1U1  EQU   CCAR1FLG
CCAR1UR  EQU   CCAR1FLG
CCACPE40 EQU   CCAR0SEG+8
CCACPE30 EQU   CCAR0SEG+4
CCACPE20 EQU   CCAR0SEG
@NM00004 EQU   CCARAB0+2
CCAR0RPL EQU   CCARAB0+1
CCAR0UPD EQU   CCAR0FLG
@NM00003 EQU   CCAR0FLG
CCAR0PA  EQU   CCAR0FLG
CCAR0WR  EQU   CCAR0FLG
CCAR0U2  EQU   CCAR0FLG
CCAR0U1  EQU   CCAR0FLG
CCAR0UR  EQU   CCAR0FLG
@NM00002 EQU   CCASRCH+3
CCASRCIN EQU   CCASRID
CCANPCCB EQU   IGGCCA+36
CCADPL   EQU   CCARB
CCALBCYL EQU   CCATCB
CCAMOD   EQU   CCAFLG6
CCAEXT   EQU   CCAFLG6
CCAREUSE EQU   CCAFLG6
CCASUPFD EQU   CCAFLG6
CCAINIT  EQU   CCAFLG6
CCAMNOSP EQU   CCAFLG6
CCADELP  EQU   CCAFLG6
CCAMCODR EQU   CCAFLG6
CCATEX2  EQU   CCAFLG5
CCATEX1  EQU   CCAFLG5
CCATEX   EQU   CCAFLG5
CCATHIT  EQU   CCAFLG5
CCAMODPA EQU   CCAFLG5
CCAMEX1  EQU   CCAFLG5
CCAMEX   EQU   CCAFLG5
CCAMEX2  EQU   CCAFLG5
CCATCOMP EQU   CCAFLG4
CCAGVNE  EQU   CCAFLG4
CCAGVEX  EQU   CCAFLG4
CCAGVNBS EQU   CCAFLG4
CCAGVNF  EQU   CCAFLG4
CCAGVNC  EQU   CCAFLG4
CCAF4BYS EQU   CCAFLG4
CCAF4DRQ EQU   CCAFLG4
CCAEGREC EQU   CCAFLG3
CCALFT   EQU   CCAFLG3
CCAELC2  EQU   CCAFLG3
CCANF    EQU   CCAFLG3
CCAEXGR2 EQU   CCAFLG3
CCAGDSP  EQU   CCAFLG3
CCAGC4   EQU   CCAFLG3
CCAEXGR1 EQU   CCAFLG3
CCAF2SMO EQU   CCAFLG2
CCAF2CB  EQU   CCAF2COB
CCAF2CO  EQU   CCAF2COB
CCAF2RHS EQU   CCAFLG2
CCAF2XEQ EQU   CCAFLG2
CCAF2CCT EQU   CCAFLG2
CCAF2NVC EQU   CCAFLG2
CCAF1DK  EQU   CCAFLG1
CCAF1UP  EQU   CCAFLG1
CCAF1KGE EQU   CCAFLG1
CCAF1KEY EQU   CCAFLG1
CCAF1LRD EQU   CCAFLG1
CCAF1CNS EQU   CCAFLG1
CCAF1LPS EQU   CCAFLG1
@NM00001 EQU   IGGCCA+12
CCARACP  EQU   IGGCCA+8
@NM00076 EQU   PSA+3668
PSASTAK  EQU   PSA+3072
@NM00075 EQU   PSA+1048
PSAUSEND EQU   PSA+1048
PSARV062 EQU   PSA+1044
PSACDAL  EQU   PSA+1040
PSAWTCOD EQU   PSA+1036
PSAATCVT EQU   PSA+1032
PSAPCPSW EQU   PSA+1024
PSAPIR2  EQU   PSA+1020
PSARV059 EQU   PSA+1018
PSASVC13 EQU   PSA+1016
PSALSFCC EQU   PSA+1012
PSASFACC EQU   PSA+1008
PSASTOP  EQU   PSA+992
PSASTART EQU   PSA+976
PSARSPSW EQU   PSA+968
PSASRPSW EQU   PSA+960
PSARV045 EQU   PSA+892
PSARV044 EQU   PSA+888
PSARV043 EQU   PSA+884
PSARV042 EQU   PSA+880
PSARV041 EQU   PSA+876
PSARV040 EQU   PSA+872
PSARV025 EQU   PSA+868
PSADSSED EQU   PSA+868
PSADSSPR EQU   PSA+864
PSADSSFW EQU   PSA+860
PSADSS14 EQU   PSA+856
PSADSSPP EQU   PSA+848
PSADSSRP EQU   PSA+840
PSADSS05 EQU   PSADSSF4
PSADSS10 EQU   PSADSSF4
PSADSSVE EQU   PSADSSF4
PSADSSDE EQU   PSADSSF4
PSADSSC0 EQU   PSADSSF4
PSADSSIE EQU   PSADSSF4
PSADSS12 EQU   PSADSSF4
PSADSSRC EQU   PSADSSF4
PSARV057 EQU   PSADSSF3
PSARV056 EQU   PSADSSF3
PSARV055 EQU   PSADSSF3
PSADSSMC EQU   PSADSSF3
PSADSSRW EQU   PSADSSF3
PSADSSNM EQU   PSADSSF3
PSADSSES EQU   PSADSSF3
PSADSSGP EQU   PSADSSF3
PSADSSF2 EQU   PSADSSFL+1
PSADSSPI EQU   PSADSSF1
PSADSSOI EQU   PSADSSF1
PSADSSSP EQU   PSADSSF1
PSADSSTP EQU   PSADSSF1
PSADSSDW EQU   PSADSSF1
PSADSSDD EQU   PSADSSF1
PSADSSDM EQU   PSADSSF1
PSADSSMV EQU   PSADSSF1
PSADSSTS EQU   PSA+816
PSADSSWK EQU   PSA+812
PSADSSR3 EQU   PSA+808
PSADSSR2 EQU   PSA+804
PSADSSRS EQU   PSA+800
PSASTOR  EQU   PSA+796
PSACPUSA EQU   PSA+794
PSAVSTAP EQU   PSA+792
PSAWKVAP EQU   PSA+788
PSAWKRAP EQU   PSA+784
PSAMCHIC EQU   PSA+783
PSARV061 EQU   PSA+782
PSASYMSK EQU   PSA+781
PSAMCHFL EQU   PSA+780
PSACR0   EQU   PSA+776
PSAPSWSV EQU   PSA+768
PSACLHS  EQU   PSAHLHI
PSALKR15 EQU   PSALKSA+60
PSALKR14 EQU   PSALKSA+56
PSALKR13 EQU   PSALKSA+52
PSALKR12 EQU   PSALKSA+48
PSALKR11 EQU   PSALKSA+44
PSALKR10 EQU   PSALKSA+40
PSALKR9  EQU   PSALKSA+36
PSALKR8  EQU   PSALKSA+32
PSALKR7  EQU   PSALKSA+28
PSALKR6  EQU   PSALKSA+24
PSALKR5  EQU   PSALKSA+20
PSALKR4  EQU   PSALKSA+16
PSALKR3  EQU   PSALKSA+12
PSALKR2  EQU   PSALKSA+8
PSALKR1  EQU   PSALKSA+4
PSALKR0  EQU   PSALKSA
PSARV023 EQU   PSACLHT+52
PSALOCAL EQU   PSACLHT+48
PSACMSL  EQU   PSACLHT+44
PSAOPTL  EQU   PSACLHT+40
PSATPACL EQU   PSACLHT+36
PSATPDNL EQU   PSACLHT+32
PSATPNCL EQU   PSACLHT+28
PSAIOSLL EQU   PSACLHT+24
PSAIOSUL EQU   PSACLHT+20
PSAIOSCL EQU   PSACLHT+16
PSAIOSSL EQU   PSACLHT+12
PSASALCL EQU   PSACLHT+8
PSAASML  EQU   PSACLHT+4
PSADISPL EQU   PSACLHT
PSASRSA  EQU   PSA+636
PSARV050 EQU   PSA+634
PSADSSGO EQU   PSA+633
PSARECUR EQU   PSA+632
PSAHLHIS EQU   PSA+628
PSAIPCSA EQU   PSA+624
@NM00074 EQU   PSA+621
PSAIPCDM EQU   PSA+620
PSAIPCD  EQU   PSA+616
@NM00073 EQU   PSA+613
PSAIPCRM EQU   PSA+612
PSAIPCR  EQU   PSA+608
PSAMCHEX EQU   PSA+600
PSAMPSW  EQU   PSA+592
PSAEXPS2 EQU   PSA+584
PSAEXPS1 EQU   PSA+576
PSAPIREG EQU   PSA+572
PSARSREG EQU   PSA+568
PSAGPREG EQU   PSA+556
PSARV022 EQU   PSASUP4
PSARV021 EQU   PSASUP4
PSARV020 EQU   PSASUP4
PSARV019 EQU   PSASUP4
PSARV018 EQU   PSASUP4
PSARV017 EQU   PSASUP4
PSARV016 EQU   PSASUP4
PSARV015 EQU   PSASUP4
PSARV014 EQU   PSASUP3
PSARV013 EQU   PSASUP3
PSARV012 EQU   PSASUP3
PSAESTA  EQU   PSASUP3
PSASPR   EQU   PSASUP3
PSAPSREG EQU   PSASUP3
PSAPI2   EQU   PSASUP3
PSAIOSUP EQU   PSASUP3
PSALCR   EQU   PSASUP2
PSARTM   EQU   PSASUP2
PSAACR   EQU   PSASUP2
PSAIPCE2 EQU   PSASUP2
PSAIPCES EQU   PSASUP2
PSAIPCEC EQU   PSASUP2
PSAGTF   EQU   PSASUP2
PSAIPCRI EQU   PSASUP2
PSATYPE6 EQU   PSASUP1
PSATCTL  EQU   PSASUP1
PSADISP  EQU   PSASUP1
PSALOCK  EQU   PSASUP1
PSAPI    EQU   PSASUP1
PSAEXT   EQU   PSASUP1
PSASVC   EQU   PSASUP1
PSAIO    EQU   PSASUP1
PSAANEW  EQU   PSA+544
PSATOLD  EQU   PSA+540
PSATNEW  EQU   PSA+536
PSALCCAR EQU   PSA+532
PSALCCAV EQU   PSA+528
PSAPCCAR EQU   PSA+524
PSAPCCAV EQU   PSA+520
PSACPULA EQU   PSA+518
PSACPUPA EQU   PSA+516
PSAPSA   EQU   PSA+512
FLCHDEND EQU   PSA+512
FLCCRSAV EQU   FLCMCLA+280
FLCGRSAV EQU   FLCMCLA+216
FLCFPSAV EQU   FLCMCLA+184
FLCFLA   EQU   FLCMCLA+88
FLCRGNCD EQU   FLCMCLA+84
FLCFSAA  EQU   FLCFSA+1
@NM00072 EQU   FLCFSA
@NM00071 EQU   FLCMCLA+72
FLCMCIC  EQU   FLCMCLA+64
@NM00070 EQU   FLCMCLA+20
FLCIOAA  EQU   FLCIOA+1
@NM00069 EQU   FLCIOA
@NM00068 EQU   FLCMCLA+15
@NM00067 EQU   FLCMCLA+14
@NM00066 EQU   FLCMCLA+12
FLCLCL   EQU   FLCMCLA+8
FLCIOELA EQU   FLCIOEL+1
@NM00065 EQU   FLCIOEL
FLCCHNID EQU   FLCMCLA
@NM00064 EQU   PSA+160
FLCMTRCD EQU   PSA+157
@NM00063 EQU   PSA+156
FLCPERA  EQU   FLCPER+1
@NM00062 EQU   FLCPER
@NM00061 EQU   PSA+151
FLCPERCD EQU   PSA+150
FLCMCNUM EQU   PSA+149
@NM00060 EQU   PSA+148
FLCTEAA  EQU   FLCTEA+1
@NM00059 EQU   FLCTEA
PSAPIPC  EQU   PSAPICOD
PSAPIMC  EQU   PSAPICOD
PSAPIPER EQU   PSAPICOD
PSARV049 EQU   FLCPICOD
FLCPILCB EQU   FLCPIILC
@NM00058 EQU   FLCPIILC
@NM00057 EQU   PSAEPPSW
FLCSVCN  EQU   PSAESPSW+2
FLCSILCB EQU   FLCSVILC
@NM00056 EQU   FLCSVILC
@NM00055 EQU   PSAESPSW
FLCEICOD EQU   PSAEEPSW+2
PSASPAD  EQU   PSAEEPSW
@NM00054 EQU   PSA+128
FLCINPSW EQU   PSA+120
FLCMNPSW EQU   PSA+112
FLCPNPSW EQU   PSA+104
FLCSNPSW EQU   PSA+96
FLCENPSW EQU   PSA+88
FLCTRACE EQU   PSA+84
FLCTIMER EQU   PSA+80
FLCCVT2  EQU   PSA+76
FLCCAW   EQU   PSA+72
FLCCSW   EQU   PSA+64
FLCIOPSW EQU   PSA+56
FLCMOPSW EQU   PSA+48
FLCPOPSW EQU   PSA+40
FLCSOPSW EQU   PSA+32
FLCEOPSW EQU   PSA+24
@NM00053 EQU   FLCICCW2+4
FLCICCW1 EQU   FLCROPSW
FLCIPPSW EQU   FLCRNPSW
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS
@RC00353 EQU   @RC00340
@RC00433 EQU   @RC00432
@RT00596 EQU   CAXCLEAR
@RC00668 EQU   @RC00515
@RC00790 EQU   @RC00782
@RC00926 EQU   @RC00925
@RC01007 EQU   @RC01005
@RC01033 EQU   @RC01031
@RC01092 EQU   @RC01090
@RC01133 EQU   @RC01132
@RC01278 EQU   @RC01277
@RC01637 EQU   @RC01636
@RC01726 EQU   @RC01725
@PB00015 EQU   @EL00001
@RC00700 EQU   @RC00668
@RC00791 EQU   @RC00790
@RC00927 EQU   @RC00926
@RC01011 EQU   @RC01007
@RC01037 EQU   @RC01033
@RC01096 EQU   @RC01092
@RC01134 EQU   @RC01133
@RC01279 EQU   @RC01278
@RC01638 EQU   @RC01637
@RC01727 EQU   @RC01726
@PB00014 EQU   @PB00015
@RC01012 EQU   @RC01011
@PB00013 EQU   @PB00014
@PB00012 EQU   @PB00013
@PB00011 EQU   @PB00012
@PB00010 EQU   @PB00011
@PB00009 EQU   @PB00010
@PB00008 EQU   @PB00009
@PB00007 EQU   @PB00008
@PB00006 EQU   @PB00007
@PB00005 EQU   @PB00006
@PB00004 EQU   @PB00005
@PB00003 EQU   @PB00004
@PB00002 EQU   @PB00003
@ENDDATA EQU   *
         END   IGG0CLC9,(C'PLS1852',0701,78171)
