//PCROSS JOB (0904,0012,TIME,200,,1938),GERHARDP,CLASS=E,MSGCLASS=C
//*FETCH
//*RERUN
//*NOSETUP
//       EXEC  PAXCL,MEMBER=PCROSS
//SYSIN  DD    DISP=SHR,DSN=HERC01.PASUTIL(PCROSS)
//LKED.SYSLMOD DD DISP=SHR,DSN=HERC01.PASLIB(PCROSS),SPACE=
