TJI3     TITLE ' IGTJI3 -- CHARACTER STRING PROCESSOR                  *
                        '
IGTJI3   CSECT ,                                                01S0001
@PROLOG  STM   @14,@12,12(@13)                                  01S0001
         BALR  @07,0                                            01S0001
@PSTART  DS    0H                                               01S0001
         USING @PSTART,@07                                      01S0001
         L     @00,@SIZDATD                                     01S0001
         IGTYGSV  R,LV=(0)
         LR    @06,@01                                          01S0001
         USING @DATD,@06                                        01S0001
         ST    @13,@SA00001+4                                   01S0001
         LM    @00,@01,20(@13)                                  01S0001
         ST    @06,8(,@13)                                      01S0001
         LR    @13,@06                                          01S0001
         MVC   @PC00001(20),0(@01)                              01S0001
*   BITSWTCH='C000'X;               /* JCLOK AND KWDEXP = YES        */
         MVC   BITSWTCH(2),@CB00689                             01S0020
*   KWDLEN=0;                                                   01S0021
         SLR   @10,@10                                          01S0021
         STH   @10,KWDLEN                                       01S0021
*   KEYWORD='        ';                                         01S0022
         MVC   KEYWORD(8),@CC00690                              01S0022
*   VALLEN=0;                       /* INITIALIZE KEYWORD TABLE      */
         STH   @10,VALLEN                                       01S0023
*   VALUE='        ';               /* INITIALIZE VALUE              */
         MVC   VALUE(8),@CC00690                                01S0024
*   LPRCNT=0;                       /* INITIALIZE LEFT PAREN COUNT   */
         SLR   LPRCNT,LPRCNT                                    01S0025
*   STRPTR=INTTXT;                  /* SET STRPTR TO JCL TEXT        */
         L     @10,@PC00001+8                                   01S0026
         L     STRPTR,INTTXT(,@10)                              01S0026
*   ALC=STRPTR+STRLEN-1;            /* ALC = ADDR(LAST CHAR)         */
*                                                               01S0027
         L     @10,@PC00001                                     01S0027
         LR    ALC,STRPTR                                       01S0027
         SLR   @04,@04                                          01S0027
         IC    @04,STRLEN(,@10)                                 01S0027
         ALR   ALC,@04                                          01S0027
         BCTR  ALC,0                                            01S0027
*   /*****************************************************************/
*   /*                                                               */
*   /* PARSE JCL                                                     */
*   /*                                                               */
*   /*****************************************************************/
*                                                               01S0028
*   RESPECIFY                                                   01S0028
*     R9F RESTRICTED;                                           01S0028
*   ANSC=STRPTR;                    /* ANSC = ADDR(NEXT SCAN CHAR    */
         LR    ANSC,STRPTR                                      01S0029
*   DO UNTIL(FINISH=YES);           /* PROCESS ENTIRE STRING         */
@DL00030 DS    0H                                               01S0031
*     TRTLEN=ALC+1-STRPTR;          /* SET STRING LENGTH             */
         LA    TRTLEN,1                                         01S0031
         ALR   TRTLEN,ALC                                       01S0031
         SLR   TRTLEN,STRPTR                                    01S0031
*     RESPECIFY                                                 01S0032
*       R1F RESTRICTED;                                         01S0032
*     R1F=0;                                                    01S0033
         SLR   R1F,R1F                                          01S0033
*     RESPECIFY                                                 01S0034
*       R2F RESTRICTED;                                         01S0034
*     R2F=0;                                                    01S0035
         SLR   R2F,R2F                                          01S0035
*     TRT(STRING(1:TRTLEN),DELIM);  /* FIND 1ST = , ( OR )           */
         LR    @04,TRTLEN                                       01S0036
         BCTR  @04,0                                            01S0036
         EX    @04,@SB00849                                     01S0036
*     BC(7,DLPROC(R2F));            /* IF DELIM FOUND GO TO PROCESS
*                                      ROUTINE                       */
         BC    8,@BC00037                                       01S0037
         LR    @10,R2F                                          01S0037
         SLA   @10,2                                            01S0037
         L     @10,DLPROC-4(@10)                                01S0037
         BR    @10                                              01S0037
@BC00037 DS    0H                                               01S0038
*     RESPECIFY                                                 01S0038
*       R2F UNRESTRICTED;                                       01S0038
*     R1F=ALC+1;                    /* ADDR OF NEXT CHAR BEYOND STR  */
*                                                               01S0039
         LA    R1F,1                                            01S0039
         ALR   R1F,ALC                                          01S0039
*     /***************************************************************/
*     /*                                                             */
*     /* PROCESS COMMA                                               */
*     /*                                                             */
*     /***************************************************************/
*                                                               01S0040
*PRCOM:                                                         01S0040
*     RESPECIFY                                                 01S0040
*       R1F RESTRICTED;                                         01S0040
PRCOM    DS    0H                                               01S0041
*     ANSC=R1F;                                                 01S0041
         LR    ANSC,R1F                                         01S0041
*     RESPECIFY                                                 01S0042
*       R1F UNRESTRICTED;                                       01S0042
*     IF VALEXP=YES THEN            /* IF VALUE EXPECTED             */
         TM    VALEXP,B'00010000'                               01S0043
         BNO   @RF00043                                         01S0043
*       IF COMEXP=YES THEN          /* IF COMMA EXPECTED             */
         TM    COMEXP,B'00100000'                               01S0044
         BNO   @RF00044                                         01S0044
*         DO;                       /* VALUE DELIMITED BY PARENS AND
*                                      ALREADY STORED                */
*           COMEXP=NO;              /* COMMA NOT EXPECTED            */
         NI    COMEXP,B'11011111'                               01S0046
*           CALL TXTPRC;            /* ANALYZE VALUES                */
         BAL   @14,TXTPRC                                       01S0047
*           VALEXP=NO;              /* VALUE NO LONGER EXPECTED      */
*           KWDEXP=YES;             /* KEYWORD SHOULD BE NEXT        */
         OI    KWDEXP,B'01000000'                               01S0049
         NI    VALEXP,B'11101111'                               01S0049
*         END;                                                  01S0050
*       ELSE                        /* COMMA IS NOT EXPECTED         */
*         DO;                       /* VALUE FOUND                   */
         B     @RC00044                                         01S0051
@RF00044 DS    0H                                               01S0052
*           VALLEN=ANSC-STRPTR;     /* SAVE LENGTH OF VALUE          */
         LR    @10,ANSC                                         01S0052
         SLR   @10,STRPTR                                       01S0052
         STH   @10,VALLEN                                       01S0052
*           IF VALLEN<9 THEN        /* IF VALUE PROVIDED             */
         C     @10,@CF00698                                     01S0053
         BNL   @RF00053                                         01S0053
*             DO;                                               01S0054
*               KWDEXP=YES;         /* KEYWORD EXPECTED NEXT         */
*               VALEXP=NO;          /* VALUE NOT EXPECTED            */
         OI    KWDEXP,B'01000000'                               01S0056
         NI    VALEXP,B'11101111'                               01S0056
*               IF VALLEN>0 THEN    /* IF VALUE PROVIDED             */
         SLR   @04,@04                                          01S0057
         CR    @10,@04                                          01S0057
         BNH   @RF00057                                         01S0057
*                 DO;                                           01S0058
*                   VALUE=STRING(1:VALLEN);/* STORE VALUE FOUND      */
         MVI   VALUE+1,C' '                                     01S0059
         MVC   VALUE+2(6),VALUE+1                               01S0059
         BCTR  @10,0                                            01S0059
         EX    @10,@SM00852                                     01S0059
*                   IF LPRCNT=0 THEN/* IF LEFT PAREN COUNT = 0       */
         CR    LPRCNT,@04                                       01S0060
         BNE   @RF00060                                         01S0060
*                     CALL TXTPRC;  /* GO TO THE TEXT PROCESSOR      */
         BAL   @14,TXTPRC                                       01S0061
*                   ELSE                                        01S0062
*                     CALL MSG453;  /* SET UNBALANCED PARENS MSG     */
         B     @RC00060                                         01S0062
@RF00060 BAL   @14,MSG453                                       01S0062
*                 END;                                          01S0063
*             END;                                              01S0064
*           ELSE                                                01S0065
*             CALL MSG455;          /* SET EXCESSIVE VALUE LEN MSG   */
         B     @RC00053                                         01S0065
@RF00053 BAL   @14,MSG455                                       01S0065
*         END;                                                  01S0066
*     ELSE                          /* KEYWORD EXPECTED IT WILL BE
*                                      ASSUMED FOR THE TIME BEING
*                                      THAT THIS IS VALID WAY OF
*                                      SPECIFYING THAT A DEFAULT
*                                      VALUE IS TO BE SUPPLIED IF
*                                      ....,REGION,OWN,.... WOULD NOT
*                                      BE FLAGGED AS AN ERROR        */
*       DO;                                                     01S0067
         B     @RC00043                                         01S0067
@RF00043 DS    0H                                               01S0068
*         KWDLEN=ANSC-STRPTR;       /* SAVE KEYWORD LENGTH           */
         LR    @10,ANSC                                         01S0068
         SLR   @10,STRPTR                                       01S0068
         STH   @10,KWDLEN                                       01S0068
*         IF KWDLEN>0&KWDLEN<9 THEN                             01S0069
         LTR   @10,@10                                          01S0069
         BNP   @RF00069                                         01S0069
         C     @10,@CF00698                                     01S0069
         BNL   @RF00069                                         01S0069
*           DO;                                                 01S0070
*             KEYWORD=STRING(1:KWDLEN);/* SAVE KEYWORD               */
         MVI   KEYWORD+1,C' '                                   01S0071
         MVC   KEYWORD+2(6),KEYWORD+1                           01S0071
         BCTR  @10,0                                            01S0071
         EX    @10,@SM00854                                     01S0071
*             CALL TXTPRC;                                      01S0072
         BAL   @14,TXTPRC                                       01S0072
*           END;                                                01S0073
*         ELSE                      /* NUMBER OF ACCEPTED CHARACTERS
*                                      = 0 OR > 8                    */
*           IF KWDLEN=0 THEN        /* ....VALUE,,......             */
         B     @RC00069                                         01S0074
@RF00069 LH    @10,KWDLEN                                       01S0074
         LTR   @10,@10                                          01S0074
         BNZ   @RF00074                                         01S0074
*             CALL MSG450;          /* SET INVALID USE OF COMMA MSG  */
         BAL   @14,MSG450                                       01S0075
*           ELSE                    /* ....,KEYWORDDDDDDD.......     */
*             CALL MSG454;          /* SET EXCESSIVE KWD LENGTH MSG  */
         B     @RC00074                                         01S0076
@RF00074 BAL   @14,MSG454                                       01S0076
*       END;                                                    01S0077
*     GOTO SEARCH;                                              01S0078
*                                                               01S0078
         B     SEARCH                                           01S0078
*     /***************************************************************/
*     /*                                                             */
*     /* PROCESS EQUAL SIGN                                          */
*     /*                                                             */
*     /***************************************************************/
*                                                               01S0079
*PREQ:                                                          01S0079
*     RESPECIFY                                                 01S0079
*       R1F RESTRICTED;                                         01S0079
PREQ     DS    0H                                               01S0080
*     ANSC=R1F;                                                 01S0080
         LR    ANSC,R1F                                         01S0080
*     RESPECIFY                                                 01S0081
*       R1F UNRESTRICTED;                                       01S0081
*     IF KWDEXP=YES THEN            /* IF KEYWORD EXPECTED           */
         TM    KWDEXP,B'01000000'                               01S0082
         BNO   @RF00082                                         01S0082
*       DO;                                                     01S0083
*         KWDLEN=ANSC-STRPTR;       /* SAVE LENGTH OF KEYWORD        */
         LR    @10,ANSC                                         01S0084
         SLR   @10,STRPTR                                       01S0084
         STH   @10,KWDLEN                                       01S0084
*         IF KWDLEN>0&KWDLEN<9 THEN /* IF KEYWORD IS THERE           */
         LTR   @10,@10                                          01S0085
         BNP   @RF00085                                         01S0085
         C     @10,@CF00698                                     01S0085
         BNL   @RF00085                                         01S0085
*           DO;                                                 01S0086
*             KEYWORD=STRING(1:KWDLEN);/* SAVE KEYWORD               */
         MVI   KEYWORD+1,C' '                                   01S0087
         MVC   KEYWORD+2(6),KEYWORD+1                           01S0087
         BCTR  @10,0                                            01S0087
         EX    @10,@SM00854                                     01S0087
*             KWDEXP=NO;                                        01S0088
*             VALEXP=YES;           /* A VALUE SHOULD BE NEXT        */
         OI    VALEXP,B'00010000'                               01S0089
         NI    KWDEXP,B'10111111'                               01S0089
*           END;                                                01S0090
*         ELSE                                                  01S0091
*           IF KWDLEN=0 THEN        /* ...,=...                      */
         B     @RC00085                                         01S0091
@RF00085 LH    @10,KWDLEN                                       01S0091
         LTR   @10,@10                                          01S0091
         BNZ   @RF00091                                         01S0091
*             CALL MSG451;          /* INCORRECT USE OF EQUAL SIGN   */
         BAL   @14,MSG451                                       01S0092
*           ELSE                    /* ...,KEYWORDDDDD=......        */
*             CALL MSG454;          /* EXCESSIVE KEYWORD LENGTH      */
         B     @RC00091                                         01S0093
@RF00091 BAL   @14,MSG454                                       01S0093
*       END;                                                    01S0094
*     ELSE                          /* KEYWORD NOT FOUND WHERE EXP   */
*       CALL MSG451;                /* INCORRECT USE OF = - ..KWD==  */
         B     @RC00082                                         01S0095
@RF00082 BAL   @14,MSG451                                       01S0095
*     GOTO SEARCH;                                              01S0096
*                                                               01S0096
         B     SEARCH                                           01S0096
*     /***************************************************************/
*     /*                                                             */
*     /* PROCESS LEFT PARENS                                         */
*     /*                                                             */
*     /***************************************************************/
*                                                               01S0097
*PRLPAR:                                                        01S0097
*     RESPECIFY                                                 01S0097
*       R1F RESTRICTED;                                         01S0097
PRLPAR   DS    0H                                               01S0098
*     ANSC=R1F;                                                 01S0098
         LR    ANSC,R1F                                         01S0098
*     RESPECIFY                                                 01S0099
*       R1F UNRESTRICTED;                                       01S0099
*     IF KWDEXP=YES THEN            /* IF KEYWORD EXPECTED ..KWD(..  */
         TM    KWDEXP,B'01000000'                               01S0100
         BNO   @RF00100                                         01S0100
*       DO;                                                     01S0101
*         KWDLEN=ANSC-STRPTR;       /* STORE LENGTH(KEYWORD)         */
         LR    @10,ANSC                                         01S0102
         SLR   @10,STRPTR                                       01S0102
         STH   @10,KWDLEN                                       01S0102
*         IF KWDLEN>0&KWDLEN<9 THEN /* IF VALID LENGTH               */
         LTR   @10,@10                                          01S0103
         BNP   @RF00103                                         01S0103
         C     @10,@CF00698                                     01S0103
         BNL   @RF00103                                         01S0103
*           DO;                                                 01S0104
*             KEYWORD=STRING(1:KWDLEN);/* STORE KEYWORD              */
         MVI   KEYWORD+1,C' '                                   01S0105
         MVC   KEYWORD+2(6),KEYWORD+1                           01S0105
         BCTR  @10,0                                            01S0105
         EX    @10,@SM00854                                     01S0105
*             KWDEXP=NO;            /* KEYWORD NO LONGER EXPECTED    */
*             VALEXP=YES;           /* VALUE SHOULD BE NEXT          */
         OI    VALEXP,B'00010000'                               01S0107
         NI    KWDEXP,B'10111111'                               01S0107
*             LPRCNT=LPRCNT+1;      /* INCREMENT LEFT PAREN COUNTER  */
         AL    LPRCNT,@CF00144                                  01S0108
*           END;                                                01S0109
*         ELSE                                                  01S0110
*           CALL MSG452;            /* MISPLACED PARENS MSG          */
         B     @RC00103                                         01S0110
@RF00103 BAL   @14,MSG452                                       01S0110
*       END;                                                    01S0111
*     ELSE                                                      01S0112
*       IF ANSC=STRPTR THEN         /* 'KEYWORD=(' SPECIFIED         */
         B     @RC00100                                         01S0112
@RF00100 CR    ANSC,STRPTR                                      01S0112
         BNE   @RF00112                                         01S0112
*         LPRCNT=LPRCNT+1;          /* INCR UNMATCHED PAREN COUNT    */
         AL    LPRCNT,@CF00144                                  01S0113
*       ELSE                        /* ...KEYWORD=(...(              */
*         CALL MSG452;              /* PROVIDE MISPLACED PAREN MSG   */
         B     @RC00112                                         01S0114
@RF00112 BAL   @14,MSG452                                       01S0114
*     GO TO SEARCH;                                             01S0115
*                                                               01S0115
         B     SEARCH                                           01S0115
*     /***************************************************************/
*     /*                                                             */
*     /* PROCESS RIGHT PAREN                                         */
*     /*                                                             */
*     /***************************************************************/
*                                                               01S0116
*PRRPAR:                                                        01S0116
*     RESPECIFY                                                 01S0116
*       R1F RESTRICTED;                                         01S0116
PRRPAR   DS    0H                                               01S0117
*     ANSC=R1F;                                                 01S0117
         LR    ANSC,R1F                                         01S0117
*     RESPECIFY                                                 01S0118
*       R1F UNRESTRICTED;                                       01S0118
*     IF KWDEXP=YES THEN            /* IF KEYWORD EXPECTED           */
         TM    KWDEXP,B'01000000'                               01S0119
         BNO   @RF00119                                         01S0119
*       CALL MSG452;                /* ....,) MISPLACED PAREN MSG    */
         BAL   @14,MSG452                                       01S0120
*     ELSE                          /* VALUE EXPECTED                */
*       IF COMEXP=NO THEN           /* IF COMMA NOT EXPECTED         */
         B     @RC00119                                         01S0121
@RF00119 TM    COMEXP,B'00100000'                               01S0121
         BNZ   @RF00121                                         01S0121
*         IF PAREXP=NO THEN         /* IF PARENTHESIS NOT EXPECTED   */
         TM    PAREXP,B'00001000'                               01S0122
         BNZ   @RF00122                                         01S0122
*           DO;                                                 01S0123
*             VALLEN=ANSC-STRPTR;   /* SAVE LENGTH OF VALUE          */
         LR    @10,ANSC                                         01S0124
         SLR   @10,STRPTR                                       01S0124
         STH   @10,VALLEN                                       01S0124
*             IF VALLEN>0&VALLEN<9 THEN/* IF LENTH VALID THEN        */
         LTR   @10,@10                                          01S0125
         BNP   @RF00125                                         01S0125
         C     @10,@CF00698                                     01S0125
         BNL   @RF00125                                         01S0125
*               VALUE=STRING(1:VALLEN);/* STORE VALUE                */
         MVI   VALUE+1,C' '                                     01S0126
         MVC   VALUE+2(6),VALUE+1                               01S0126
         BCTR  @10,0                                            01S0126
         EX    @10,@SM00852                                     01S0126
*             LPRCNT=LPRCNT-1;      /* DECR UNMATCHED PAREN COUNT    */
@RF00125 BCTR  LPRCNT,0                                         01S0127
*             IF LPRCNT>0 THEN      /* ANY UNMATCHED PARENS ?        */
         LTR   LPRCNT,LPRCNT                                    01S0128
         BNP   @RF00128                                         01S0128
*               PAREXP=YES;         /* YES, EXPECTING MORE PARENS    */
         OI    PAREXP,B'00001000'                               01S0129
*             ELSE                                              01S0130
*               COMEXP=YES;         /* NO, COMMA SHOULD BE NEXT      */
         B     @RC00128                                         01S0130
@RF00128 OI    COMEXP,B'00100000'                               01S0130
*           END;                                                01S0131
*         ELSE                      /* RIGHT PARENTHESIS             */
*           IF ANSC=STRPTR THEN     /* IF VALUE IS PRESENT           */
         B     @RC00122                                         01S0132
@RF00122 CR    ANSC,STRPTR                                      01S0132
         BNE   @RF00132                                         01S0132
*             DO;                                               01S0133
*               LPRCNT=LPRCNT-1;    /* DECR UNMATCHED PAREN COUNT    */
         BCTR  LPRCNT,0                                         01S0134
*               IF LPRCNT=0 THEN    /* ANY MORE UNMATCHED PARENS ?   */
         LTR   LPRCNT,LPRCNT                                    01S0135
         BNZ   @RF00135                                         01S0135
*                 DO;                                           01S0136
*                   PAREXP=NO;      /* NO,                           */
*                   COMEXP=YES;     /* COMMA SHOULD BE NEXT          */
         OI    COMEXP,B'00100000'                               01S0138
         NI    PAREXP,B'11110111'                               01S0138
*                 END;                                          01S0139
*             END;                                              01S0140
*           ELSE                    /* SOME CHARACTERS HAVE BEEN
*                                      ACCUMULATED BETWEEN TWO RIGHT
*                                      PARENTHESIS ...)XXX)          */
*             CALL MSG452;          /* SET MISPLACED PAREN MSG       */
         B     @RC00132                                         01S0141
@RF00132 BAL   @14,MSG452                                       01S0141
*       ELSE                        /* COMMA EXPECTED, PAREN FOUND   */
*         CALL MSG453;              /* EXTRA PARENTHESIS             */
         B     @RC00121                                         01S0142
@RF00121 BAL   @14,MSG453                                       01S0142
*     GOTO SEARCH;                                              01S0143
         B     SEARCH                                           01S0143
*SEARCH:                                                        01S0144
*                                                               01S0144
*     /***************************************************************/
*     /*                                                             */
*     /* RESET POINTERS TO RESUME SCAN                               */
*     /*                                                             */
*     /***************************************************************/
*                                                               01S0144
*     IF ANSC>ALC THEN              /* JCL DID NOT END WITH A DELIM  */
SEARCH   CR    ANSC,ALC                                         01S0144
         BNH   @RF00144                                         01S0144
*       FINISH=YES;                 /* PARAMETERS ALREADY PROCESSED  */
         OI    FINISH,B'00000100'                               01S0145
*     ELSE                                                      01S0146
*       DO;                                                     01S0146
         B     @RC00144                                         01S0146
@RF00144 DS    0H                                               01S0147
*         ANSC=ANSC+1;              /* SET SCAN TO NEXT KWD OR VAL   */
         LA    ANSC,1(,ANSC)                                    01S0147
*         IF ANSC>ALC&JCLOK=YES THEN/* LAST CHAR WAS DELIM           */
         CR    ANSC,ALC                                         01S0148
         BNH   @RF00148                                         01S0148
         TM    JCLOK,B'10000000'                                01S0148
         BNO   @RF00148                                         01S0148
*           DO;                                                 01S0149
*             FINISH=YES;           /* SET LOOP CONTROL TO TERMINATE */
         OI    FINISH,B'00000100'                               01S0150
*             IF LPRCNT=0 THEN      /* IF LEFT PAREN COUNT = 0       */
         LTR   LPRCNT,LPRCNT                                    01S0151
         BNZ   @RF00151                                         01S0151
*               CALL TXTPRC;        /* ANALYZE THE LAST KWD/VALUE    */
         BAL   @14,TXTPRC                                       01S0152
*             ELSE                                              01S0153
*               CALL MSG453;        /* SET UP UNBALANCED PAREN MSG   */
         B     @RC00151                                         01S0153
@RF00151 BAL   @14,MSG453                                       01S0153
*           END;                                                01S0154
*         ELSE                                                  01S0155
*           STRPTR=ANSC;                                        01S0155
         B     @RC00148                                         01S0155
@RF00148 LR    STRPTR,ANSC                                      01S0155
*       END;                                                    01S0156
@RC00148 DS    0H                                               01S0157
*     IF JCLOK=NO THEN                                          01S0157
@RC00144 TM    JCLOK,B'10000000'                                01S0157
         BNZ   @RF00157                                         01S0157
*       FINISH=YES;                                             01S0158
         OI    FINISH,B'00000100'                               01S0158
*   END;                                                        01S0159
*                                                               01S0159
@RF00157 DS    0H                                               01S0159
@DE00030 TM    FINISH,B'00000100'                               01S0159
         BNO   @DL00030                                         01S0159
*   /*****************************************************************/
*   /*                                                               */
*   /* TEXT PROCESSING SUBROUTINE                                    */
*   /*                                                               */
*   /*****************************************************************/
*                                                               01S0160
*TXTPRC:                                                        01S0160
*   PROC;                                                       01S0160
         B     @PB00002                                         01S0160
TXTPRC   STM   @14,@12,@SA00002                                 01S0160
*   RESPECIFY                                                   01S0161
*     KWDPTR RESTRICTED;                                        01S0161
*   KWDPTR=ADDR(KWDS)-ENTRYLN;                                  01S0162
         L     @08,ENTRYLN                                      01S0162
         LA    KWDPTR,KWDS                                      01S0162
         SLR   KWDPTR,@08                                       01S0162
*   KWDFND=NO;                      /* INITIALIZE LOOP CONTROL       */
         NI    KWDFND,B'11111110'                               01S0163
*   ENDTBL=KWDPTR+(ENTRIES*ENTRYLN)-1;/* KWDSRTB SUBSCRIPT IN        */
         LR    @01,@08                                          01S0164
         M     @00,ENTRIES                                      01S0164
         ALR   @01,KWDPTR                                       01S0164
         BCTR  @01,0                                            01S0164
         LR    ENDTBL,@01                                       01S0164
*   RESPECIFY                                                   01S0165
*     N RESTRICTED;                                             01S0165
*   N=0;                            /* INIT KWDSRTB SUBSCRIPT        */
         SLR   N,N                                              01S0166
*   FINSRCH=NO;                     /* INIT LOOP CONTROL             */
         NI    FINSRCH,B'11111101'                              01S0167
*   DO UNTIL(FINSRCH=YES);          /* DO FOR ENTIRE TABLE OR UNTIL
*                                      KEYWORD IS FOUND              */
@DL00168 DS    0H                                               01S0169
*     N=N+1;                                                    01S0169
         AL    N,@CF00144                                       01S0169
*     KWDPTR=KWDPTR+ENTRYLN;        /* INCREMENT POINTERS            */
         AL    KWDPTR,ENTRYLN                                   01S0170
*     IF KWDLEN>=MINL THEN          /* IS THE KEYWORD IN THE SIZE    */
         LH    @15,KWDLEN                                       01S0171
         CH    @15,MINL(,KWDPTR)                                01S0171
         BL    @RF00171                                         01S0171
*       IF KWDLEN<=MAXL THEN        /* RANGE FOR KEYWORD             */
         CH    @15,MAXL(,KWDPTR)                                01S0172
         BH    @RF00172                                         01S0172
*         IF KEYWORD(1:KWDLEN)=KWD(1:KWDLEN) THEN/* ARE KWD EQUAL    */
         BCTR  @15,0                                            01S0173
         EX    @15,@SC00861                                     01S0173
         BNE   @RF00173                                         01S0173
*           KWDFND=YES;             /* SET END TO LOOP               */
         OI    KWDFND,B'00000001'                               01S0174
*     IF KWDPTR>=ENDTBL THEN        /* ENTIRE TABLE SEARCHED         */
@RF00173 DS    0H                                               01S0175
@RF00172 DS    0H                                               01S0175
@RF00171 CR    KWDPTR,ENDTBL                                    01S0175
         BL    @RF00175                                         01S0175
*       FINSRCH=YES;                /* TERMINATE SEARCH              */
         OI    FINSRCH,B'00000010'                              01S0176
*     IF KWDFND=YES THEN            /* IF KEYWORD FOUND THEN         */
@RF00175 TM    KWDFND,B'00000001'                               01S0177
         BNO   @RF00177                                         01S0177
*       FINSRCH=YES;                /* TERMINATE SEARCH              */
         OI    FINSRCH,B'00000010'                              01S0178
*   END;                                                        01S0179
@RF00177 DS    0H                                               01S0179
@DE00168 TM    FINSRCH,B'00000010'                              01S0179
         BNO   @DL00168                                         01S0179
*   IF KWDFND=YES THEN              /* IF VALID KEYWORD FOUND        */
         TM    KWDFND,B'00000001'                               01S0180
         BNO   @RF00180                                         01S0180
*     DO;                                                       01S0181
*       IF KWDUPL(N)='00'X THEN     /* IF KEYWORD NOT DUPLICATE      */
         L     @02,@PC00001+16                                  01S0182
         LR    @01,@02                                          01S0182
         ALR   @01,N                                            01S0182
         BCTR  @01,0                                            01S0182
         CLI   KWDUPL(@01),X'00'                                01S0182
         BNE   @RF00182                                         01S0182
*         DO;                                                   01S0183
*           KWDUPL(N)='Y';          /* INDICATE KEYWORD PRESENT      */
         ALR   @02,N                                            01S0184
         BCTR  @02,0                                            01S0184
         MVI   KWDUPL(@02),C'Y'                                 01S0184
*           IF JCLOK=YES THEN                                   01S0185
         TM    JCLOK,B'10000000'                                01S0185
         BNO   @RF00185                                         01S0185
*             IF VALLEN>0 THEN                                  01S0186
         LH    @02,VALLEN                                       01S0186
         LTR   @02,@02                                          01S0186
         BNP   @RF00186                                         01S0186
*               GO TO RTN;                                      01S0187
         L     @02,RTN(,KWDPTR)                                 01S0187
         BR    @02                                              01S0187
*             ELSE                                              01S0188
*               GO TO ENDPRM;                                   01S0188
*           ELSE                                                01S0189
*             GO TO BADPRM;                                     01S0189
*                                                               01S0189
*           /*********************************************************/
*           /*                                                       */
*           /* PROCESS REGION PARAMETER                              */
*           /*                                                       */
*           /*********************************************************/
*                                                               01S0190
*PRREG:                                                         01S0190
*           IF VALUE(VALLEN)='K'&VALLEN>1&VALLEN<9 THEN         01S0190
PRREG    LH    @02,VALLEN                                       01S0190
         LA    @01,VALUE-1(@02)                                 01S0190
         CLI   0(@01),C'K'                                      01S0190
         BNE   @RF00190                                         01S0190
         LA    @15,1                                            01S0190
         CR    @02,@15                                          01S0190
         BNH   @RF00190                                         01S0190
         C     @02,@CF00698                                     01S0190
         BNL   @RF00190                                         01S0190
*             DO;                                               01S0191
*               DO N=1 TO(VALLEN-1);/* LOOK AT NUMERIC PART          */
         LR    N,@15                                            01S0192
         B     @DE00192                                         01S0192
@DL00192 DS    0H                                               01S0193
*                 IF VALUE(N)<'0'×VALUE(N)>'9' THEN             01S0193
         LA    @02,VALUE-1(N)                                   01S0193
         CLI   0(@02),C'0'                                      01S0193
         BL    @RT00193                                         01S0193
         LA    @02,VALUE-1(N)                                   01S0193
         CLI   0(@02),C'9'                                      01S0193
         BNH   @RF00193                                         01S0193
@RT00193 DS    0H                                               01S0194
*                   CALL MSG470;    /* SET INVALID VALUE MESSAGE     */
         BAL   @14,MSG470                                       01S0194
*               END;                                            01S0195
@RF00193 AL    N,@CF00144                                       01S0195
@DE00192 LH    @02,VALLEN                                       01S0195
         BCTR  @02,0                                            01S0195
         CR    N,@02                                            01S0195
         BNH   @DL00192                                         01S0195
*               IF JCLOK=YES THEN   /* IF STILL NO ERRORS            */
         TM    JCLOK,B'10000000'                                01S0196
         BNO   @RF00196                                         01S0196
*                 DO;                                           01S0197
*                   I007C='      '; /* INIT 7 CHAR FIELD             */
         MVI   I007C+6,C' '                                     01S0198
         MVC   I007C(6),@CC00721                                01S0198
*                   I007C(9-VALLEN:7)=VALUE(1:VALLEN-1);/* SAVE THE
*                                      NUMERIC PORTION               */
         LA    @02,9                                            01S0199
         SH    @02,VALLEN                                       01S0199
         LA    @01,I007C-1(@02)                                 01S0199
         LCR   @02,@02                                          01S0199
         AL    @02,@CF00529                                     01S0199
         EX    @02,@SM00865                                     01S0199
*                   PACK(I004C,I007C);/* PREPARE TO CHECK RANGE      */
         PACK  I004C(4),I007C(7)                                01S0200
*                   CVB(N,I004C);   /* CONVERT RANGE TO BINARY       */
         XC    @TS00001(8),@TS00001                             01S0201
         MVC   @TS00001+4(4),I004C                              01S0201
         CVB   N,@TS00001                                       01S0201
*                   N=N+3;          /* ROUND UP TO CLOSEST MULTIPLE  */
         AL    N,@CF00420                                       01S0202
*                   N=N&'FFFFFFFC'X;/* OF 4                          */
         N     N,@CF00724                                       01S0203
*                   IF N>APCTRGMX THEN                          01S0204
         C     N,APCTRGMX(,APCTPTR)                             01S0204
         BNH   @RF00204                                         01S0204
*                     CALL MSG470;  /* INVALID VALUE -RANGE > 1094   */
         BAL   @14,MSG470                                       01S0205
*                   ELSE                                        01S0206
*                     APDSREG=N;    /* SAVE THE REGION SIZE          */
         B     @RC00204                                         01S0206
@RF00204 ST    N,APDSREG(,APDSPTR)                              01S0206
*                 END;                                          01S0207
*             END;                                              01S0208
*           ELSE                    /* INVALID FORMAT ..REG=102,..   */
*             IF VALLEN>9 THEN                                  01S0209
         B     @RC00190                                         01S0209
@RF00190 LH    @02,VALLEN                                       01S0209
         C     @02,@CF00698                                     01S0209
         BNH   @RF00209                                         01S0209
*               CALL MSG454;        /* EXCESSIVE KEYWORD LENGTH      */
         BAL   @14,MSG454                                       01S0210
*             ELSE                                              01S0211
*               IF VALLEN>0 THEN    /* ...REG=K                      */
         B     @RC00209                                         01S0211
@RF00209 LH    @02,VALLEN                                       01S0211
         LTR   @02,@02                                          01S0211
         BNP   @RF00211                                         01S0211
*                 CALL MSG470;      /* SET MESSAGE FOR INVALID VALUE */
         BAL   @14,MSG470                                       01S0212
*           GO TO ENDPRM;                                       01S0213
*                                                               01S0213
         B     ENDPRM                                           01S0213
*           /*********************************************************/
*           /*                                                       */
*           /* PROCESS OWN PARAMETER                                 */
*           /*                                                       */
*           /*********************************************************/
*                                                               01S0214
*PROWN:                                                         01S0214
*           IF VALLEN<4 THEN        /* LENGTH OF VALUE < 4           */
PROWN    LH    @02,VALLEN                                       01S0214
         C     @02,@CF00081                                     01S0214
         BNL   @RF00214                                         01S0214
*             IF VALUE(1:VALLEN)=EXC(1:VALLEN) THEN/* VALUE = EXC    */
         BCTR  @02,0                                            01S0215
         EX    @02,@SC00867                                     01S0215
         BNE   @RF00215                                         01S0215
*               APDSOWN=YES;        /* SET BIT TO INDICATE EXCLUSIVE */
         OI    APDSOWN(APDSPTR),B'10000000'                     01S0216
*             ELSE                                              01S0217
*               IF VALUE(1:VALLEN)^=SHR(1:VALLEN) THEN/* VALUE^= SHR */
         B     @RC00215                                         01S0217
@RF00215 LH    @02,VALLEN                                       01S0217
         BCTR  @02,0                                            01S0217
         EX    @02,@SC00870                                     01S0217
         BE    @RF00217                                         01S0217
*                 CALL MSG470;      /* INVALID VALUE FOR OWN PARM    */
         BAL   @14,MSG470                                       01S0218
*               ELSE                                            01S0219
*                 ;                                             01S0219
@RF00217 DS    0H                                               01S0220
*           ELSE                                                01S0220
*             CALL MSG455;          /* EXCESSIVE VALUE LEN FOR OWN   */
         B     @RC00214                                         01S0220
@RF00214 BAL   @14,MSG455                                       01S0220
*           GO TO ENDPRM;                                       01S0221
*                                                               01S0221
         B     ENDPRM                                           01S0221
*           /*********************************************************/
*           /*                                                       */
*           /* INSERT USER WRITTEN PARAMETER PROCESSOR HERE          */
*           /*                                                       */
*           /*********************************************************/
*                                                               01S0222
*BADPRM:                                                        01S0222
*           CALL MSG460;            /* INVALID KEYWORD FOUND         */
BADPRM   BAL   @14,MSG460                                       01S0222
*ENDPRM:                                                        01S0223
*           KWDLEN=0;               /* REINIT KWDLEN = 0             */
ENDPRM   SLR   @02,@02                                          01S0223
         STH   @02,KWDLEN                                       01S0223
*           KEYWORD='        ';     /* REINIT KEYWORD = ' '          */
         MVC   KEYWORD(8),@CC00690                              01S0224
*           VALLEN=0;               /* REINIT VALUE LENGTH           */
         STH   @02,VALLEN                                       01S0225
*           VALUE='        ';       /* REINIT VALUE = ' '            */
         MVC   VALUE(8),@CC00690                                01S0226
*           RESPECIFY                                           01S0227
*             KWDPTR UNRESTRICTED;                              01S0227
*           RESPECIFY                                           01S0228
*             N UNRESTRICTED;                                   01S0228
*         END;                                                  01S0229
*       ELSE                                                    01S0230
*         CALL MSG469;              /* DUPLICATE KEYWORDS            */
         B     @RC00182                                         01S0230
@RF00182 BAL   @14,MSG469                                       01S0230
*     END;                                                      01S0231
*   ELSE                                                        01S0232
*     CALL MSG460;                  /* INVALID KEYWORD FOUND         */
         B     @RC00180                                         01S0232
@RF00180 BAL   @14,MSG460                                       01S0232
*   END TXTPRC;                                                 01S0233
@EL00002 DS    0H                                               01S0233
@EF00002 DS    0H                                               01S0233
@ER00002 LM    @14,@12,@SA00002                                 01S0233
         BR    @14                                              01S0233
@PB00002 DS    0H                                               01S0234
*   RESPECIFY                                                   01S0234
*     R9F UNRESTRICTED;                                         01S0234
*   IF JCLOK=YES THEN                                           01S0235
         TM    JCLOK,B'10000000'                                01S0235
         BNO   @RF00235                                         01S0235
*     INFCODE=0;                                                01S0236
         L     @10,@PC00001+12                                  01S0236
         SLR   @02,@02                                          01S0236
         STH   @02,INFCODE(,@10)                                01S0236
*MSG450:                                                        01S0237
*   PROC;                                                       01S0237
         B     @PB00003                                         01S0237
MSG450   STM   @14,@12,12(@13)                                  01S0237
*   APMSGTXT=IGT450I;               /* INCORRECT USE OF COMMA        */
         L     @10,@PC00001+4                                   01S0238
         MVI   APMSGTXT+35(@10),C' '                            01S0238
         MVC   APMSGTXT+36(74,@10),APMSGTXT+35(@10)             01S0238
         MVC   APMSGTXT(35,@10),IGT450I                         01S0238
*   APMSGTXT(9:12)=APCTSSID;        /* INSERT SUBSYS NAME            */
         MVC   APMSGTXT+8(4,@10),APCTSSID(APCTPTR)              01S0239
*   APBUFLEN=LENGTH(IGT450I)+8;     /* LN(BUF) + 2 + NX MSG PTR (4)  */
         MVC   APBUFLEN(2,@10),@CH00841                         01S0240
*   INFCODE=4;                      /* SET INFORMATION CODE FOR VS2  */
         L     @10,@PC00001+12                                  01S0241
         MVC   INFCODE(2,@10),@CH00081                          01S0241
*   JCLOK=NO;                       /* SET INDICATOR FOR JCL ERROR   */
         NI    JCLOK,B'01111111'                                01S0242
*   END MSG450;                                                 01S0243
@EL00003 DS    0H                                               01S0243
@EF00003 DS    0H                                               01S0243
@ER00003 LM    @14,@12,12(@13)                                  01S0243
         BR    @14                                              01S0243
*MSG451:                                                        01S0244
*   PROC;                                                       01S0244
MSG451   STM   @14,@12,12(@13)                                  01S0244
*   APMSGTXT=IGT451I;               /* INCORRECT USE OF EQUAL SIGN   */
         L     @10,@PC00001+4                                   01S0245
         MVI   APMSGTXT+40(@10),C' '                            01S0245
         MVC   APMSGTXT+41(69,@10),APMSGTXT+40(@10)             01S0245
         MVC   APMSGTXT(40,@10),IGT451I                         01S0245
*   APMSGTXT(9:12)=APCTSSID;        /* INSERT SUBSYS NAME            */
         MVC   APMSGTXT+8(4,@10),APCTSSID(APCTPTR)              01S0246
*   APBUFLEN=LENGTH(IGT451I)+8;     /* LN(BUF) + 2 + NX MSG PTR(4)   */
         MVC   APBUFLEN(2,@10),@CH00628                         01S0247
*   INFCODE=8;                      /* SET INFORMATION CODE FOR VS2  */
         L     @10,@PC00001+12                                  01S0248
         MVC   INFCODE(2,@10),@CH00090                          01S0248
*   JCLOK=NO;                       /* SET INDICATOR FOR JCL ERROR   */
         NI    JCLOK,B'01111111'                                01S0249
*   END MSG451;                                                 01S0250
@EL00004 DS    0H                                               01S0250
@EF00004 DS    0H                                               01S0250
@ER00004 LM    @14,@12,12(@13)                                  01S0250
         BR    @14                                              01S0250
*MSG452:                                                        01S0251
*   PROC;                                                       01S0251
MSG452   STM   @14,@12,12(@13)                                  01S0251
*   APMSGTXT=IGT452I;               /* MISPLACED PARENS              */
         L     @10,@PC00001+4                                   01S0252
         MVI   APMSGTXT+34(@10),C' '                            01S0252
         MVC   APMSGTXT+35(75,@10),APMSGTXT+34(@10)             01S0252
         MVC   APMSGTXT(34,@10),IGT452I                         01S0252
*   APMSGTXT(9:12)=APCTSSID;        /* INSERT SUBSYS NAME            */
         MVC   APMSGTXT+8(4,@10),APCTSSID(APCTPTR)              01S0253
*   APBUFLEN=LENGTH(IGT452I)+8;     /* SET BUFFER LENGTH FOR GETMAIN */
         MVC   APBUFLEN(2,@10),@CH00842                         01S0254
*   INFCODE=12;                     /* SET INFORMATION CODE FOR VS2  */
         L     @10,@PC00001+12                                  01S0255
         MVC   INFCODE(2,@10),@CH00733                          01S0255
*   JCLOK=NO;                       /* SET INDICATOR FOR JCL ERROR   */
         NI    JCLOK,B'01111111'                                01S0256
*   END MSG452;                                                 01S0257
@EL00005 DS    0H                                               01S0257
@EF00005 DS    0H                                               01S0257
@ER00005 LM    @14,@12,12(@13)                                  01S0257
         BR    @14                                              01S0257
*MSG453:                                                        01S0258
*   PROC;                                                       01S0258
MSG453   STM   @14,@12,12(@13)                                  01S0258
*   APMSGTXT=IGT453I;               /* UNBALANCED PARENS             */
         L     @10,@PC00001+4                                   01S0259
         MVI   APMSGTXT+35(@10),C' '                            01S0259
         MVC   APMSGTXT+36(74,@10),APMSGTXT+35(@10)             01S0259
         MVC   APMSGTXT(35,@10),IGT453I                         01S0259
*   APMSGTXT(9:12)=APCTSSID;        /* INSERT SUBSYS NAME            */
         MVC   APMSGTXT+8(4,@10),APCTSSID(APCTPTR)              01S0260
*   APBUFLEN=LENGTH(IGT453I)+8;     /* SET BUFFER LENGTH FOR GETMAIN */
         MVC   APBUFLEN(2,@10),@CH00841                         01S0261
*   INFCODE=16;                     /* SET INFORMATION CODE FOR VS2  */
         L     @10,@PC00001+12                                  01S0262
         MVC   INFCODE(2,@10),@CH00203                          01S0262
*   JCLOK=NO;                       /* SET INDICATOR FOR JCL ERROR   */
         NI    JCLOK,B'01111111'                                01S0263
*   END MSG453;                                                 01S0264
@EL00006 DS    0H                                               01S0264
@EF00006 DS    0H                                               01S0264
@ER00006 LM    @14,@12,12(@13)                                  01S0264
         BR    @14                                              01S0264
*MSG454:                                                        01S0265
*   PROC;                                                       01S0265
MSG454   STM   @14,@12,12(@13)                                  01S0265
*   APMSGTXT=IGT454I;               /* KEYWORD TOO LONG              */
         L     @10,@PC00001+4                                   01S0266
         MVI   APMSGTXT+58(@10),C' '                            01S0266
         MVC   APMSGTXT+59(51,@10),APMSGTXT+58(@10)             01S0266
         MVC   APMSGTXT(58,@10),IGT454I                         01S0266
*   APMSGTXT(9:12)=APCTSSID;        /* INSERT SUBSYS NAME            */
         MVC   APMSGTXT+8(4,@10),APCTSSID(APCTPTR)              01S0267
*   MSGLEN=LENGTH(IGT454I);         /* SET STARTING PT FOR KEYWORD   */
         LA    MSGLEN,58                                        01S0268
*   APMSGTXT(MSGLEN+1:MSGLEN+KWDLEN)=KEYWORD(1:KWDLEN);/* DSPL KWD   */
         LR    @01,@10                                          01S0269
         ALR   @01,MSGLEN                                       01S0269
         LH    @15,KWDLEN                                       01S0269
         LR    @14,@15                                          01S0269
         BCTR  @14,0                                            01S0269
         EX    @14,@SM00873                                     01S0269
*   APBUFLEN=LENGTH(IGT454I)+KWDLEN+8;/* SET BUF LEN / GETMAIN       */
         AL    @15,@CF00843                                     01S0270
         STH   @15,APBUFLEN(,@10)                               01S0270
*   INFCODE=20;                     /* SET INFORMATION CODE FOR VS2  */
         L     @10,@PC00001+12                                  01S0271
         MVC   INFCODE(2,@10),@CH00747                          01S0271
*   JCLOK=NO;                       /* SET INDICATOR FOR JCL ERROR   */
         NI    JCLOK,B'01111111'                                01S0272
*   END MSG454;                                                 01S0273
@EL00007 DS    0H                                               01S0273
@EF00007 DS    0H                                               01S0273
@ER00007 LM    @14,@12,12(@13)                                  01S0273
         BR    @14                                              01S0273
*MSG455:                                                        01S0274
*   PROC;                                                       01S0274
MSG455   STM   @14,@12,12(@13)                                  01S0274
*   APMSGTXT=IGT455I;               /* VALUE TOO LONG FOR KW SHOWN IN
*                                      MESSAGE                       */
         L     @10,@PC00001+4                                   01S0275
         MVI   APMSGTXT+48(@10),C' '                            01S0275
         MVC   APMSGTXT+49(61,@10),APMSGTXT+48(@10)             01S0275
         MVC   APMSGTXT(48,@10),IGT455I                         01S0275
*   APMSGTXT(9:12)=APCTSSID;        /* INSERT SUBSYS NAME            */
         MVC   APMSGTXT+8(4,@10),APCTSSID(APCTPTR)              01S0276
*   MSGLEN=LENGTH(IGT455I);         /* SET STARTING POINT FOR KWD    */
         LA    MSGLEN,48                                        01S0277
*   APMSGTXT(MSGLEN+1:MSGLEN+KWDLEN)=KEYWORD(1:KWDLEN);/* DSPL KWD   */
         LR    @01,@10                                          01S0278
         ALR   @01,MSGLEN                                       01S0278
         LH    @15,KWDLEN                                       01S0278
         LR    @14,@15                                          01S0278
         BCTR  @14,0                                            01S0278
         EX    @14,@SM00873                                     01S0278
*   APBUFLEN=LENGTH(IGT455I)+KWDLEN+8;/* SET BUF LEN / GETMAIN       */
         AL    @15,@CF00844                                     01S0279
         STH   @15,APBUFLEN(,@10)                               01S0279
*   INFCODE=24;                     /* SET INFORMATION CODE FOR VS2  */
         L     @10,@PC00001+12                                  01S0280
         MVC   INFCODE(2,@10),@CH00652                          01S0280
*   JCLOK=NO;                       /* SET INDICATOR FOR JCL ERROR   */
         NI    JCLOK,B'01111111'                                01S0281
*   END MSG455;                                                 01S0282
@EL00008 DS    0H                                               01S0282
@EF00008 DS    0H                                               01S0282
@ER00008 LM    @14,@12,12(@13)                                  01S0282
         BR    @14                                              01S0282
*MSG460:                                                        01S0283
*   PROC;                                                       01S0283
MSG460   STM   @14,@12,12(@13)                                  01S0283
*   APMSGTXT=IGT460I;               /* INVALID KEYWORD               */
         L     @10,@PC00001+4                                   01S0284
         MVI   APMSGTXT+29(@10),C' '                            01S0284
         MVC   APMSGTXT+30(80,@10),APMSGTXT+29(@10)             01S0284
         MVC   APMSGTXT(29,@10),IGT460I                         01S0284
*   APMSGTXT(9:12)=APCTSSID;        /* INSERT SUBSYS NAME            */
         MVC   APMSGTXT+8(4,@10),APCTSSID(APCTPTR)              01S0285
*   MSGLEN=LENGTH(IGT460I);         /* SET STARTING POINT FOR KWD    */
         LA    MSGLEN,29                                        01S0286
*   APMSGTXT(MSGLEN+1:MSGLEN+KWDLEN)=KEYWORD(1:KWDLEN);/* DSPL KWD   */
         LR    @01,@10                                          01S0287
         ALR   @01,MSGLEN                                       01S0287
         LH    @15,KWDLEN                                       01S0287
         LR    @14,@15                                          01S0287
         BCTR  @14,0                                            01S0287
         EX    @14,@SM00873                                     01S0287
*   APBUFLEN=LENGTH(IGT460I)+KWDLEN+8;/* SET BUF LEN / GETMAIN       */
         AL    @15,@CF00845                                     01S0288
         STH   @15,APBUFLEN(,@10)                               01S0288
*   INFCODE=32;                     /* SET INFORMATION CODE FOR VS2  */
         L     @10,@PC00001+12                                  01S0289
         MVC   INFCODE(2,@10),@CH00201                          01S0289
*   JCLOK=NO;                       /* SET INDICATOR FOR JCL ERROR   */
         NI    JCLOK,B'01111111'                                01S0290
*   END MSG460;                                                 01S0291
@EL00009 DS    0H                                               01S0291
@EF00009 DS    0H                                               01S0291
@ER00009 LM    @14,@12,12(@13)                                  01S0291
         BR    @14                                              01S0291
*MSG469:                                                        01S0292
*   PROC;                                                       01S0292
MSG469   STM   @14,@12,12(@13)                                  01S0292
*   APMSGTXT=IGT469I;               /* DUPLICATE KEYWORDS            */
         L     @10,@PC00001+4                                   01S0293
         MVI   APMSGTXT+40(@10),C' '                            01S0293
         MVC   APMSGTXT+41(69,@10),APMSGTXT+40(@10)             01S0293
         MVC   APMSGTXT(40,@10),IGT469I                         01S0293
*   APMSGTXT(9:12)=APCTSSID;        /* INSERT SUBSYS NAME            */
         MVC   APMSGTXT+8(4,@10),APCTSSID(APCTPTR)              01S0294
*   MSGLEN=LENGTH(IGT469I);         /* SET STARTING POINT FOR KWD    */
         LA    MSGLEN,40                                        01S0295
*   APMSGTXT(MSGLEN+1:MSGLEN+KWDLEN)=KEYWORD(1:KWDLEN);/* DSPL KWD   */
         LR    @01,@10                                          01S0296
         ALR   @01,MSGLEN                                       01S0296
         LH    @15,KWDLEN                                       01S0296
         LR    @14,@15                                          01S0296
         BCTR  @14,0                                            01S0296
         EX    @14,@SM00873                                     01S0296
*   APBUFLEN=LENGTH(IGT469I)+KWDLEN+8;/* SET BUF LEN / GETMAIN       */
         AL    @15,@CF00628                                     01S0297
         STH   @15,APBUFLEN(,@10)                               01S0297
*   INFCODE=36;                     /* SET INFORMATION CODE FOR VS2  */
         L     @10,@PC00001+12                                  01S0298
         MVC   INFCODE(2,@10),@CH00757                          01S0298
*   JCLOK=NO;                       /* SET INDICATOR FOR JCL ERROR   */
         NI    JCLOK,B'01111111'                                01S0299
*   END MSG469;                                                 01S0300
@EL00010 DS    0H                                               01S0300
@EF00010 DS    0H                                               01S0300
@ER00010 LM    @14,@12,12(@13)                                  01S0300
         BR    @14                                              01S0300
*MSG470:                                                        01S0301
*   PROC;                                                       01S0301
MSG470   STM   @14,@12,12(@13)                                  01S0301
*   APMSGTXT=IGT470I;               /* VALUE ERROR FOR KEYWORD X     */
         L     @10,@PC00001+4                                   01S0302
         MVI   APMSGTXT+27(@10),C' '                            01S0302
         MVC   APMSGTXT+28(82,@10),APMSGTXT+27(@10)             01S0302
         MVC   APMSGTXT(27,@10),IGT470I                         01S0302
*   APMSGTXT(9:12)=APCTSSID;        /* INSERT SUBSYS NAME            */
         MVC   APMSGTXT+8(4,@10),APCTSSID(APCTPTR)              01S0303
*   MSGLEN=LENGTH(IGT470I);         /* SET STARTING POINT FOR VALUE  */
         LA    MSGLEN,27                                        01S0304
*   APMSGTXT(MSGLEN+1:MSGLEN+VALLEN)=VALUE(1:VALLEN);/* DSPL VALUE   */
         LR    @01,@10                                          01S0305
         ALR   @01,MSGLEN                                       01S0305
         LH    @15,VALLEN                                       01S0305
         LR    @14,@15                                          01S0305
         BCTR  @14,0                                            01S0305
         EX    @14,@SM00875                                     01S0305
*   MSGLEN=MSGLEN+VALLEN;           /* SET STARTING POINT FOR NX MS  */
         ALR   MSGLEN,@15                                       01S0306
*   APMSGTXT(MSGLEN+1:MSGLEN+LENGTH(IGT470I2))=IGT470I2;/* 'FOR KWD' */
         LR    @01,@10                                          01S0307
         ALR   @01,MSGLEN                                       01S0307
         MVC   APMSGTXT(14,@01),IGT470I2                        01S0307
*   MSGLEN=MSGLEN+LENGTH(IGT470I2); /* SET STARTING POINT FOR KWD    */
         AL    MSGLEN,@CF00648                                  01S0308
*   APMSGTXT(MSGLEN+1:MSGLEN+KWDLEN)=KEYWORD(1:KWDLEN);/* DSPL KWD   */
         LR    @01,@10                                          01S0309
         ALR   @01,MSGLEN                                       01S0309
         LH    @15,KWDLEN                                       01S0309
         LR    @14,@15                                          01S0309
         BCTR  @14,0                                            01S0309
         EX    @14,@SM00873                                     01S0309
*   APBUFLEN=MSGLEN+KWDLEN+8;       /* SET BUF LEN FOR GETMAIN       */
         ALR   @15,MSGLEN                                       01S0310
         AL    @15,@CF00090                                     01S0310
         STH   @15,APBUFLEN(,@10)                               01S0310
*   INFCODE=48;                     /* SET INFORMATION CODE FOR VS2  */
         L     @10,@PC00001+12                                  01S0311
         MVC   INFCODE(2,@10),@CH00628                          01S0311
*   JCLOK=NO;                       /* SET INDICATOR FOR JCL ERROR   */
         NI    JCLOK,B'01111111'                                01S0312
*   END MSG470;                     /* IGTXEPLG                      */
@EL00011 DS    0H                                               01S0313
@EF00011 DS    0H                                               01S0313
@ER00011 LM    @14,@12,12(@13)                                  01S0313
         BR    @14                                              01S0313
@PB00011 DS    0H                                               01S0314
*                                                               01S0314
*   /*****************************************************************/
*   /*                                                               */
*   /* SYSTEM DECLARES                                               */
*   /*                                                               */
*   /*****************************************************************/
*                                                               01S0314
*   DECLARE                         /* COMMON VARIABLES              */
*     I256C CHAR(256) BASED,                                    01S0314
*     I031F FIXED(31) BASED,                                    01S0314
*     I031P PTR(31) BASED,                                      01S0314
*     I015F FIXED(15) BASED,                                    01S0314
*     I015P PTR(15) BASED,                                      01S0314
*     I008P PTR(8) BASED,                                       01S0314
*     I001C CHAR(1) BASED;                                      01S0314
*                                                               01S0315
*   /*****************************************************************/
*   /*                                                               */
*   /* MODULE PATCH AREA                                             */
*   /*                                                               */
*   /*****************************************************************/
*                                                               01S0315
*   DCL                                                         01S0315
*     APPATCH CHAR(*) INT STATIC LOCAL GEND;                    01S0315
*   GENERATE DATA DEFS(APPATCH);                                01S0316
*                                                               01S0317
*   /*****************************************************************/
*   /*                                                               */
*   /* GENERAL REGISTER DECLARES                                     */
*   /*                                                               */
*   /*****************************************************************/
*                                                               01S0317
*   DCL                                                         01S0317
*     R0F FIXED(31) REG(0),                                     01S0317
*     R0P PTR(24) REG(0),                                       01S0317
*     R0RSTD PTR(31) REG(0),                                    01S0317
*     R1F FIXED(31) REG(1),                                     01S0317
*     R1P PTR(24) REG(1),                                       01S0317
*     R1RSTD PTR(31) REG(1),                                    01S0317
*     R2F FIXED(31) REG(2),                                     01S0317
*     R2P PTR(24) REG(2),                                       01S0317
*     R2RSTD PTR(31) REG(2),                                    01S0317
*     R3F FIXED(31) REG(3),                                     01S0317
*     R3P PTR(24) REG(3),                                       01S0317
*     R3RSTD PTR(31) REG(3),                                    01S0317
*     R4F FIXED(31) REG(4),                                     01S0317
*     R4P PTR(24) REG(4),                                       01S0317
*     R4RSTD PTR(31) REG(4),                                    01S0317
*     R5F FIXED(31) REG(5),                                     01S0317
*     R5P PTR(24) REG(5),                                       01S0317
*     R5RSTD PTR(31) REG(5),                                    01S0317
*     R6F FIXED(31) REG(6),                                     01S0317
*     R6P PTR(24) REG(6),                                       01S0317
*     R6RSTD PTR(31) REG(6),                                    01S0317
*     R7F FIXED(31) REG(7),                                     01S0317
*     R7P PTR(24) REG(7),                                       01S0317
*     R7RSTD PTR(31) REG(7),                                    01S0317
*     R8F FIXED(31) REG(8),                                     01S0317
*     R8P PTR(24) REG(8),                                       01S0317
*     R8RSTD PTR(31) REG(8),                                    01S0317
*     R9F FIXED(31) REG(9),                                     01S0317
*     R9P PTR(24) REG(9),                                       01S0317
*     R9RSTD PTR(31) REG(9),                                    01S0317
*     R10F FIXED(31) REG(10),                                   01S0317
*     R10P PTR(24) REG(10),                                     01S0317
*     R10RSTD PTR(31) REG(10),                                  01S0317
*     R11F FIXED(31) REG(11),                                   01S0317
*     R11P PTR(24) REG(11),                                     01S0317
*     R11RSTD PTR(31) REG(11),                                  01S0317
*     R12F FIXED(31) REG(12),                                   01S0317
*     R12P PTR(24) REG(12),                                     01S0317
*     R12RSTD PTR(31) REG(12),                                  01S0317
*     R13F FIXED(31) REG(13),                                   01S0317
*     R13P PTR(24) REG(13),                                     01S0317
*     R13RSTD PTR(31) REG(13),                                  01S0317
*     R14F FIXED(31) REG(14),                                   01S0317
*     R14P PTR(24) REG(14),                                     01S0317
*     R14RSTD PTR(31) REG(14),                                  01S0317
*     R15F FIXED(31) REG(15),                                   01S0317
*     R15P PTR(24) REG(15),                                     01S0317
*     R15RSTD PTR(31) REG(15),                                  01S0317
*                                                               01S0317
*     /***************************************************************/
*     /*                                                             */
*     /* VPSS CONTROL BLOCK POINTER DECLARES                         */
*     /*                                                             */
*     /***************************************************************/
*                                                               01S0317
*     APSMPTR PTR(24) REG(01),      /* STORAGE MANAGEMENT BLOCK 01S0317
*                                      (SUGGESTED POINTER)           */
*     APSCPTR PTR(24) REG(01),      /* STORAGE MANAGEMENT CONTROL
*                                      WORD (SUGGESTED POINTER)      */
*     APINPTR PTR(24) REG(01),      /* USER'S INPUT PARAMETER LIST
*                                      (SUGGESTED POINTER)           */
*/*                                                                  */
*                                                               01S0317
*     APDATA PTR(24) REG(06),       /* ADDRESS OF DYNAMIC DATA  01S0317
*                                      WORKAREA (DATAREG)            */
*     APCODE PTR(24) REG(07),       /* PROGRAM CODE BASE REGISTER
*                                      (CODEREG)                     */
*     APDEBPTR PTR(24) REG(08),     /* VPSS DEB (SUGGESTED POINTER)  */
*     APNPPTR PTR(24) REG(08),      /* SUBSYSTEM INITIALIZATION 01S0317
*                                      WORKAREA BLOCK (ONLY USED BY
*                                      SUBSYSTEM INITIALIZATION)     */
*     APRLPTR PTR(24) REG(08),      /* VPSS ACB REQUEST LIST    01S0317
*                                      (SUGGESTED POINTER)           */
*     APCIPTR PTR(24) REG(08),      /* 3838 CONTROL TABLE (SUGGESTED
*                                      POINTER)                      */
*     APCWPTR PTR(24) REG(08),      /* CALL INTERFACE WORKAREA  01S0317
*                                      (SUGGESTED POINTER)           */
*     APERPTR PTR(24) REG(08),      /* ERP/IO APPENDAGE WORKAREA
*                                      (SUGGESTED POINTER)           */
*     APACBPTR PTR(24) REG(09),     /* VPSS ACB (SUGGESTED POINTER)  */
*     APCQPTR PTR(24) REG(09),      /* COMMAND QUEUE ELEMENT    01S0317
*                                      (SUGGESTED POINTER)           */
*     APOTPTR PTR(24) REG(09),      /* OPTION TABLE (SUGGESTED  01S0317
*                                      POINTER)                      */
*     APIOPTR PTR(24) REG(10),      /* I/O ELEMENT (SUGGESTED   01S0317
*                                      POINTER)                      */
*     APEXLPTR PTR(24) REG(10),     /* VPSS EXLST (SUGGESTED POINTER)*/
*     APUBPTR PTR(24) REG(10),      /* UNIT BLOCK (SUGGESTED POINTER)*/
*     APAXPTR PTR(24) REG(10),      /* VPSS ACB EXTENSION (SUGGESTED
*                                      POINTER)                      */
*     APCPPTR PTR(24) REG(10),      /* VPSS CALL PROCESSING     01S0317
*                                      INDICATORS (SUGGESTED POINTER)*/
*     APOCPTR PTR(24) REG(10),      /* VPSS OPEN/CLOSE SUBSYSTEM
*                                      WORKAREA (REQUIRED POINTER)   */
*     APATPTR PTR(24) REG(11),      /* VPSS ACB TABLE (SUGGESTED
*                                      POINTER)                      */
*     APLBPTR PTR(24) REG(11),      /* LABEL RESOLUTION TABLE   01S0317
*                                      (SUGGESTED POINTER)           */
*     APUTPTR PTR(24) REG(11),      /* USER TABLE (SUGGESTED POINTER)*/
*     APDSPTR PTR(24) REG(11),      /* VPSS DATASET ENTRY (SUGGESTED
*                                      POINTER)                      */
*     APXLPTR PTR(24) REG(11),      /* TRANSLATION TABLE (SUGGESTED
*                                      POINTER)                      */
*     APDXPTR PTR(24) REG(11),      /* VPSS DEB EXTENSION (SUGGESTED
*                                      POINTER)                      */
*     APCTPTR PTR(24) REG(12) RSTD, /* CONTROL TABLE (REQUIRED  01S0317
*                                      POINTER)                      */
*     APSVPTR PTR(24) REG(13) RSTD, /* OS/VPSS SAVEAREA/WORKAREA
*                                      (REQUIRED POINTER)            */
*     APRETURN PTR(24) REG(14),     /* RETURN ADDRESS FOR SUBROUTINE
*                                      LINKAGE                       */
*     APENTRY PTR(24) REG(15),      /* SUBROUTINE ENTRY POINT LINKAGE*/
*     APRCODE PTR(24) REG(15);      /* CONTAINS SUBROUTINE RETURN
*                                      CODE                          */
*                                                               01S0318
*   /*****************************************************************/
*   /*                                                               */
*   /* USER REGISTER DECLARES                                        */
*   /*                                                               */
*   /*****************************************************************/
*                                                               01S0318
*   END IGTJI3                                                  01S0318
*                                                               01S0318
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */
*/*%INCLUDE SYSLIB  (IGTXAPSV)                                       */
*/*%INCLUDE SYSLIB  (IGTXSYSI)                                       */
*/*%INCLUDE SYSLIB  (IGTXSYSI)                                       */
*/*%INCLUDE SYSLIB  (IGTXSYSI)                                       */
*/*%INCLUDE SYSLIB  (IGTXSYSI)                                       */
*/*%INCLUDE SYSLIB  (IGTXAPCT)                                       */
*/*%INCLUDE SYSLIB  (IGTXAPCV)                                       */
*/*%INCLUDE SYSLIB  (IGTXAPDS)                                       */
*                                                               01S0318
*       ;                                                       01S0318
@EL00001 L     @13,4(,@13)                                      01S0318
@EF00001 L     @00,@SIZDATD                                     01S0318
         LR    @01,@06                                          01S0318
         IGTYFSV  R,LV=(0),A=(1)
@ER00001 LM    @14,@12,12(@13)                                  01S0318
         BR    @14                                              01S0318
@DATA    DS    0H
@CH00733 DC    H'12'
@CH00203 DC    H'16'
@CH00747 DC    H'20'
@CH00652 DC    H'24'
@CH00201 DC    H'32'
@CH00757 DC    H'36'
@CH00842 DC    H'42'
@CH00841 DC    H'43'
@SB00849 TRT   STRING(0,STRPTR),DELIM
@SM00852 MVC   VALUE(0),STRING(STRPTR)
@SM00854 MVC   KEYWORD(0),STRING(STRPTR)
@SC00861 CLC   KEYWORD(0),KWD(KWDPTR)
@SM00865 MVC   0(0,@01),VALUE
@SC00867 CLC   VALUE(0),EXC
@SC00870 CLC   VALUE(0),SHR
@SM00873 MVC   APMSGTXT(0,@01),KEYWORD
@SM00875 MVC   APMSGTXT(0,@01),VALUE
@DATD    DSECT
         DS    0F
@SA00001 DS    20F
@PC00001 DS    5F
@SA00002 DS    15F
IGTJI3   CSECT
         DS    0F
@CF00144 DC    F'1'
@CF00420 DC    F'3'
@CF00081 DC    F'4'
@CH00081 EQU   @CF00081+2
@CF00529 DC    F'7'
@CF00090 DC    F'8'
@CH00090 EQU   @CF00090+2
@CF00698 DC    F'9'
@CF00648 DC    F'14'
@CF00845 DC    F'37'
@CF00628 DC    F'48'
@CH00628 EQU   @CF00628+2
@CF00844 DC    F'56'
@CF00843 DC    F'66'
@CF00724 DC    XL4'FFFFFFFC'
@DATD    DSECT
         DS    0D
         DS    0D
@TS00001 DS    CL8
INTEXT   DS    CL20
         ORG   INTEXT
KWDLEN   DS    FL2
KEYWORD  DS    CL8
VALLEN   DS    FL2
VALUE    DS    CL8
         ORG   INTEXT+20
BITSWTCH DS    BL2
         ORG   BITSWTCH
JCLOK    DS    BL1
KWDEXP   EQU   BITSWTCH+0
COMEXP   EQU   BITSWTCH+0
VALEXP   EQU   BITSWTCH+0
PAREXP   EQU   BITSWTCH+0
FINISH   EQU   BITSWTCH+0
FINSRCH  EQU   BITSWTCH+0
KWDFND   EQU   BITSWTCH+0
         ORG   BITSWTCH+2
I007C    DS    CL7
I004C    DS    CL4
IGTJI3   CSECT
         DS    0F
@SIZDATD DC    AL1(0)
         DC    AL3(@ENDDATD-@DATD)
         DS    0D
@CC00690 DC    C'        '
@CC00721 EQU   @CC00690
@CB00689 DC    X'C000'
         DS    CL2
KWDSRTB  DS    CL40
         ORG   KWDSRTB
ENTRIES  DC    F'2'
ENTRYLN  DC    F'16'
KWDS     DS    CL32
         ORG   KWDS
@NM00052 DC    CL8'OWN'
@NM00053 DC    H'1'
@NM00054 DC    H'3'
@NM00055 DC    AL4(PROWN)
@NM00056 DC    CL8'REGION'
@NM00057 DC    H'1'
@NM00058 DC    H'6'
@NM00059 DC    AL4(PRREG)
         ORG   KWDSRTB+40
INTMSGTX DS    CL360
         ORG   INTMSGTX
IGT450I  DC    CL35'IGT450I      INCORRECT USE OF COMMA'
IGT451I  DC    CL40'IGT451I      INCORRECT USE OF EQUAL SIGN'
IGT452I  DC    CL34'IGT452I      MISPLACED PARENTHESIS'
IGT453I  DC    CL35'IGT453I      UNBALANCED PARENTHESIS'
IGT454I  DC    CL58'IGT454I      EXCESSIVE KEYWORD LENGTH - KEYWORD BEGC
               INNING '
IGT455I  DC    CL48'IGT455I      EXCESSIVE VALUE LENGTH FOR KEYWORD '
IGT460I  DC    CL29'IGT460I      INVALID KEYWORD '
IGT469I  DC    CL40'IGT469I      DUPLICATE KEYWORDS FOUND - '
IGT470I  DC    CL27'IGT470I      INVALID VALUE '
IGT470I2 DC    CL14' FOR KEYWORD '
         ORG   INTMSGTX+360
SHR      DC    CL3'SHR'
EXC      DC    CL3'EXC'
DLMARR   DC    77X'00'
         DC    X'03'
         DC    15X'00'
         DC    X'04'
         DC    13X'00'
         DC    X'01'
         DC    18X'00'
         DC    X'02'
         DC    129X'00'
         DS    CL2
DLPROC   DC    AL4(PRCOM)
         DC    AL4(PREQ)
         DC    AL4(PRLPAR)
         DC    AL4(PRRPAR)
IGTJI3   CSECT
*                                    /* GENERATE PATCH
         IGTXZAP ,                 GENERATE PATCH AREA
@DATD    DSECT
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA
@ENDDATD EQU   *
IGTJI3   CSECT
@00      EQU   00                      EQUATES FOR REGISTERS 0-15
@01      EQU   01
@02      EQU   02
@03      EQU   03
@04      EQU   04
@05      EQU   05
@06      EQU   06
@07      EQU   07
@08      EQU   08
@09      EQU   09
@10      EQU   10
@11      EQU   11
@12      EQU   12
@13      EQU   13
@14      EQU   14
@15      EQU   15
MSGLEN   EQU   @02
ENDTBL   EQU   @02
LPRCNT   EQU   @05
TRTLEN   EQU   @10
ALC      EQU   @08
APDATA   EQU   @06
APCODE   EQU   @07
APSVPTR  EQU   @13
APCTPTR  EQU   @12
KWDPTR   EQU   @10
ANSC     EQU   @09
STRPTR   EQU   @03
N        EQU   @08
APDSPTR  EQU   @11
R9F      EQU   @09
R1F      EQU   @01
R2F      EQU   @02
APACBPTR EQU   @09
APATPTR  EQU   @11
APAXPTR  EQU   @10
APCIPTR  EQU   @08
APCPPTR  EQU   @10
APCQPTR  EQU   @09
APCWPTR  EQU   @08
APDEBPTR EQU   @08
APDXPTR  EQU   @11
APENTRY  EQU   @15
APERPTR  EQU   @08
APEXLPTR EQU   @10
APINPTR  EQU   @01
APIOPTR  EQU   @10
APLBPTR  EQU   @11
APNPPTR  EQU   @08
APOCPTR  EQU   @10
APOTPTR  EQU   @09
APRCODE  EQU   @15
APRETURN EQU   @14
APRLPTR  EQU   @08
APSCPTR  EQU   @01
APSMPTR  EQU   @01
APUBPTR  EQU   @10
APUTPTR  EQU   @11
APXLPTR  EQU   @11
R0F      EQU   @00
R0P      EQU   @00
R0RSTD   EQU   @00
R1P      EQU   @01
R1RSTD   EQU   @01
R10F     EQU   @10
R10P     EQU   @10
R10RSTD  EQU   @10
R11F     EQU   @11
R11P     EQU   @11
R11RSTD  EQU   @11
R12F     EQU   @12
R12P     EQU   @12
R12RSTD  EQU   @12
R13F     EQU   @13
R13P     EQU   @13
R13RSTD  EQU   @13
R14F     EQU   @14
R14P     EQU   @14
R14RSTD  EQU   @14
R15F     EQU   @15
R15P     EQU   @15
R15RSTD  EQU   @15
R2P      EQU   @02
R2RSTD   EQU   @02
R3F      EQU   @03
R3P      EQU   @03
R3RSTD   EQU   @03
R4F      EQU   @04
R4P      EQU   @04
R4RSTD   EQU   @04
R5F      EQU   @05
R5P      EQU   @05
R5RSTD   EQU   @05
R6F      EQU   @06
R6P      EQU   @06
R6RSTD   EQU   @06
R7F      EQU   @07
R7P      EQU   @07
R7RSTD   EQU   @07
R8F      EQU   @08
R8P      EQU   @08
R8RSTD   EQU   @08
R9P      EQU   @09
R9RSTD   EQU   @09
APSV     EQU   0
APSVREGS EQU   APSV+12
APCT     EQU   0
APCTENQM EQU   APCT+12
APCTSSID EQU   APCTENQM+4
APCTSMIN EQU   APCT+32
APCTSMAD EQU   APCT+36
APCTZ@@@ EQU   APCT+40
APCTU@@@ EQU   APCT+440
APCTBR14 EQU   APCT+840
APCTERRS EQU   APCT+876
@NM00014 EQU   APCT+936
APCTSTAT EQU   @NM00014
APCTPRSW EQU   @NM00014+1
APCTAPCQ EQU   APCT+944
APCTCQAQ EQU   APCT+952
APCTRGMX EQU   APCT+1048
APCTZ@@1 EQU   APCT+1120
APDS     EQU   0
APDSTD   EQU   APDS+16
APDSREG  EQU   APDS+56
APDSFLGS EQU   APDS+64
APDSFLG0 EQU   APDSFLGS
APDSOWN  EQU   APDSFLG0
APDSFLG1 EQU   APDSFLGS+1
KEYWDS   EQU   0
KWD      EQU   KEYWDS
MINL     EQU   KEYWDS+8
MAXL     EQU   KEYWDS+10
RTN      EQU   KEYWDS+12
STRING   EQU   0
APCVZDAL EQU   0
APCVZDAP EQU   0
APCVZDBK EQU   0
APCVZDDA EQU   0
APCVZDDQ EQU   0
APCVZDEQ EQU   0
APCVZDID EQU   0
APCVZDIO EQU   0
APCVZDIP EQU   0
APCVZDMD EQU   0
APCVZDMM EQU   0
APCVZDQR EQU   0
APCVZDRI EQU   0
APCVZDUA EQU   0
APCVZDUL EQU   0
APCVZDWI EQU   0
APCVZDWT EQU   0
APCVZDX1 EQU   0
APCVZDX2 EQU   0
APCVZDX3 EQU   0
APCVZDX4 EQU   0
APCVZD10 EQU   0
APCVZD20 EQU   0
APCVZD4E EQU   0
APCVZD40 EQU   0
APCVZD41 EQU   0
APCVZD42 EQU   0
APCVZD43 EQU   0
APCVZD44 EQU   0
APCVZD45 EQU   0
APCVZD46 EQU   0
APCVZD47 EQU   0
APCVZD48 EQU   0
APCVZD49 EQU   0
APCVZD60 EQU   0
APCVZD80 EQU   0
APCVZD81 EQU   0
APCVZD82 EQU   0
APCVZD83 EQU   0
APCVZJAA EQU   0
APCVZJAD EQU   0
APCVZJAG EQU   0
APCVZJAJ EQU   0
APCVZJAM EQU   0
APCVZJAP EQU   0
APCVZJAX EQU   0
APCVZJAY EQU   0
APCVZJBA EQU   0
APCVZJBD EQU   0
APCVZJBG EQU   0
APCVZJBJ EQU   0
APCVZJBM EQU   0
APCVZJDA EQU   0
APCVZJDD EQU   0
APCVZJDG EQU   0
APCVZJDJ EQU   0
APCVZJDM EQU   0
APCVZJHC EQU   0
APCVZJHE EQU   0
APCVZJHF EQU   0
APCVZJHO EQU   0
APCVZJHQ EQU   0
APCVZJHR EQU   0
APCVZJHT EQU   0
APCVZJHW EQU   0
APCVZJH0 EQU   0
APCVZJH6 EQU   0
APCVZJI0 EQU   0
APCVZJI3 EQU   0
APCVZJJ0 EQU   0
APCVZKAA EQU   0
APCVZKBA EQU   0
APCVZKBB EQU   0
APCVZKBC EQU   0
APCVZKBD EQU   0
APCVZKBE EQU   0
APCVZKBF EQU   0
APCVZKCA EQU   0
APCVZKDA EQU   0
APCVZKGA EQU   0
APCVZKGB EQU   0
APCVZKGC EQU   0
APCVZKGD EQU   0
APCVZLCA EQU   0
APCVZLCB EQU   0
APCVZMBA EQU   0
APCVZMBD EQU   0
APCVZMBG EQU   0
APCVZMBH EQU   0
APCVZMBK EQU   0
APCVZMBM EQU   0
APCVZMIB EQU   0
APCVZMIC EQU   0
APCVZMIF EQU   0
APCVZMJB EQU   0
APCVZMJC EQU   0
APCVZMJH EQU   0
APCVZMJI EQU   0
APCVZMMA EQU   0
APCVZUAA EQU   0
APCVZUAB EQU   0
APCVZUAC EQU   0
APCVZUAD EQU   0
APCVZUAE EQU   0
APCVZUAF EQU   0
APCVZUAG EQU   0
APCVZUBB EQU   0
APCVZUFA EQU   0
APCVZUHA EQU   0
APCVZUHB EQU   0
APCVZUJA EQU   0
APCVZUKA EQU   0
APCV1CMD EQU   0
APCV1JAA EQU   0
APCV1JBJ EQU   0
APCV1JHC EQU   0
APCV1JHL EQU   0
APCV1JHT EQU   0
APCV1MAB EQU   0
APCV1MBD EQU   0
APCV2JHC EQU   0
APCV2JHL EQU   0
APCV2MBD EQU   0
I001C    EQU   0
I008P    EQU   0
I015F    EQU   0
I015P    EQU   0
I031F    EQU   0
I031P    EQU   0
I256C    EQU   0
STRCHR   EQU   0
STRLEN   EQU   0
APMSGBUF EQU   0
APBUFLEN EQU   APMSGBUF
APMSGTXT EQU   APMSGBUF+8
INTTXT   EQU   0
INFCODE  EQU   0
KWDUPL   EQU   0
APCTZ    EQU   APCTZ@@@
APCTZUAA EQU   APCTZ
APCTZUAB EQU   APCTZ+4
APCTZUAC EQU   APCTZ+8
APCTZUAD EQU   APCTZ+12
APCTZUAE EQU   APCTZ+16
APCTZUBB EQU   APCTZ+24
APCTZD10 EQU   APCTZ+28
APCTZD20 EQU   APCTZ+32
APCTZD40 EQU   APCTZ+36
APCTZD41 EQU   APCTZ+40
APCTZD42 EQU   APCTZ+44
APCTZD43 EQU   APCTZ+48
APCTZD44 EQU   APCTZ+52
APCTZD45 EQU   APCTZ+56
APCTZD46 EQU   APCTZ+60
APCTZD47 EQU   APCTZ+64
APCTZD48 EQU   APCTZ+68
APCTZD49 EQU   APCTZ+72
APCTZD60 EQU   APCTZ+76
APCTZD80 EQU   APCTZ+80
APCTZD4E EQU   APCTZ+84
APCTZMBA EQU   APCTZ+88
APCTZMBD EQU   APCTZ+92
APCTZMBG EQU   APCTZ+96
APCTZDX1 EQU   APCTZ+104
APCTZDX2 EQU   APCTZ+108
APCTZDX3 EQU   APCTZ+112
APCTZDX4 EQU   APCTZ+116
APCTZMBH EQU   APCTZ+120
APCTZMBK EQU   APCTZ+124
APCTZMBM EQU   APCTZ+128
APCTZMJB EQU   APCTZ+132
APCTZMJC EQU   APCTZ+136
APCTZMJH EQU   APCTZ+140
APCTZMMA EQU   APCTZ+144
APCTZDMD EQU   APCTZ+148
APCTZD81 EQU   APCTZ+152
APCTZDID EQU   APCTZ+156
APCTZDRI EQU   APCTZ+160
APCTZMJI EQU   APCTZ+164
APCTZDWT EQU   APCTZ+168
APCTZDMM EQU   APCTZ+172
APCTZDAL EQU   APCTZ+176
APCTZDBK EQU   APCTZ+180
APCTZDIP EQU   APCTZ+184
APCTZDDA EQU   APCTZ+188
APCTZDUL EQU   APCTZ+192
APCTZDEQ EQU   APCTZ+196
APCTZDDQ EQU   APCTZ+200
APCTZDUA EQU   APCTZ+204
APCTZUAF EQU   APCTZ+208
APCTZUAG EQU   APCTZ+212
APCTZDIO EQU   APCTZ+216
APCTZUHA EQU   APCTZ+220
APCTZUHB EQU   APCTZ+224
APCTZJAA EQU   APCTZ+232
APCTZJAD EQU   APCTZ+236
APCTZJAG EQU   APCTZ+240
APCTZJAJ EQU   APCTZ+244
APCTZJAM EQU   APCTZ+248
APCTZJAP EQU   APCTZ+252
APCTZJAY EQU   APCTZ+256
APCTZUFA EQU   APCTZ+260
APCTZUJA EQU   APCTZ+264
APCTZDAP EQU   APCTZ+268
APCTZKAA EQU   APCTZ+272
APCTZD82 EQU   APCTZ+276
APCTZMIB EQU   APCTZ+280
APCTZMIC EQU   APCTZ+284
APCTZD83 EQU   APCTZ+288
APCTZMIF EQU   APCTZ+296
APCTZJH0 EQU   APCTZ+300
APCTZJI0 EQU   APCTZ+304
APCTZJI3 EQU   APCTZ+308
APCTZJJ0 EQU   APCTZ+312
APCTZJBA EQU   APCTZ+316
APCTZJBD EQU   APCTZ+320
APCTZJBG EQU   APCTZ+324
APCTZJBJ EQU   APCTZ+328
APCTZJBM EQU   APCTZ+332
APCTZKCA EQU   APCTZ+340
APCTZKDA EQU   APCTZ+344
APCTZJDA EQU   APCTZ+356
APCTZJDJ EQU   APCTZ+360
APCTZJH6 EQU   APCTZ+364
APCTZJHO EQU   APCTZ+368
APCTZJHF EQU   APCTZ+372
APCTZJHE EQU   APCTZ+376
APCTZDQR EQU   APCTZ+380
APCTZJHR EQU   APCTZ+384
APCTZJHT EQU   APCTZ+388
APCTZJHW EQU   APCTZ+392
APCTZ1   EQU   APCTZ@@1
APCTZKBA EQU   APCTZ1
APCTZKBC EQU   APCTZ1+4
APCTZKBB EQU   APCTZ1+8
APCTZJHC EQU   APCTZ1+20
APCTZJHQ EQU   APCTZ1+24
APCTZKBD EQU   APCTZ1+28
APCTZKBE EQU   APCTZ1+40
APCTZUKA EQU   APCTZ1+56
APCTZKBF EQU   APCTZ1+60
APCTZJDD EQU   APCTZ1+64
APCTZJDG EQU   APCTZ1+68
APCTZJDM EQU   APCTZ1+72
APCTZLCA EQU   APCTZ1+76
APCTZLCB EQU   APCTZ1+80
APCTZDWI EQU   APCTZ1+84
APCTZJAX EQU   APCTZ1+88
APCTZKGA EQU   APCTZ1+92
APCTZKGB EQU   APCTZ1+96
APCTZKGC EQU   APCTZ1+100
APCTZKGD EQU   APCTZ1+104
APCTU    EQU   APCTU@@@
APCT1MAB EQU   APCTU
APCT1MBD EQU   APCTU+4
APCT2MBD EQU   APCTU+8
APCT1CMD EQU   APCTU+12
APCT1JAA EQU   APCTU+20
APCT1JHC EQU   APCTU+24
APCT2JHC EQU   APCTU+28
APCT1JHT EQU   APCTU+32
APCT1JHL EQU   APCTU+36
APCT2JHL EQU   APCTU+40
APCT1JBJ EQU   APCTU+44
DELIM    EQU   DLMARR
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS
@NM00046 EQU   APCTU+48
APCT1MBM EQU   APCTU+16
@NM00045 EQU   APCTZ1+108
@NM00044 EQU   APCTZ1+52
@NM00043 EQU   APCTZ1+48
@NM00042 EQU   APCTZ1+44
@NM00041 EQU   APCTZ1+36
@NM00040 EQU   APCTZ1+32
@NM00039 EQU   APCTZ1+16
@NM00038 EQU   APCTZ1+12
@NM00037 EQU   APCTZ+396
@NM00036 EQU   APCTZ+352
@NM00035 EQU   APCTZ+348
@NM00034 EQU   APCTZ+336
@NM00033 EQU   APCTZ+292
APCTZJFA EQU   APCTZ+228
APCTZMBR EQU   APCTZ+100
@NM00032 EQU   APCTZ+20
APMNMSG  EQU   APMSGBUF+4
APMBRSV1 EQU   APMSGBUF+2
@NM00051 EQU   APDS+144
@NM00050 EQU   APDS+100
APDSAPEP EQU   APDS+96
@NM00049 EQU   APDS+94
APDSSIZE EQU   APDS+92
APDSJBNM EQU   APDS+84
APDSITCB EQU   APDS+80
APDSMSK  EQU   APDS+72
@NM00048 EQU   APDS+69
APDSIOFS EQU   APDS+68
APDSDUMP EQU   APDS+67
APDSPGFX EQU   APDS+66
@NM00047 EQU   APDSFLG1
APDSFRST EQU   APDSFLG1
APDSSLPS EQU   APDSFLG0
APDSLSR  EQU   APDSFLG0
APDSIER  EQU   APDSFLG0
APDSARS  EQU   APDSFLG0
APDSVPER EQU   APDSFLG0
APDSVLER EQU   APDSFLG0
APDSTPGM EQU   APDSFLG0
APDSDSAP EQU   APDS+60
APDSASCB EQU   APDS+52
APDSAPUB EQU   APDS+48
APDSPERR EQU   APDS+40
APDSLERR EQU   APDS+32
APDSDDNM EQU   APDS+24
APDSDEB  EQU   APDSTD+4
APDSTCB  EQU   APDSTD
APDSAPCT EQU   APDS+12
APDSUSER EQU   APDS+8
APDSAPDS EQU   APDS+4
APDSID   EQU   APDS
@NM00031 EQU   APCT+1556
APCTSVCT EQU   APCT+1552
APCTDAVT EQU   APCT+1548
APCTLOGL EQU   APCT+1544
@NM00030 EQU   APCT+1540
APCTDMPU EQU   APCT+1536
APCTDMPM EQU   APCT+1532
APCTNDMP EQU   APCT+1530
APCTASID EQU   APCT+1528
APCTLGPG EQU   APCT+1526
APCTLGLN EQU   APCT+1524
APCTAPVU EQU   APCT+1520
APCTABR  EQU   APCT+1116
APCTACTR EQU   APCT+1112
APCTLOGD EQU   APCT+1108
APCTDCLD EQU   APCT+1104
APCTIOAP EQU   APCT+1100
@NM00029 EQU   APCT+1080
@NM00028 EQU   APCT+1078
APCTKCAX EQU   APCT+1076
APCTABND EQU   APCT+1072
@NM00027 EQU   APCT+1068
APCTAPIO EQU   APCT+1064
APCTCSCT EQU   APCT+1060
APCTSTDF EQU   APCT+1056
APCTSTMX EQU   APCT+1052
APCTSIZE EQU   APCT+1046
APCTCTUB EQU   APCT+1045
APCTMFID EQU   APCT+1044
APCTMFSZ EQU   APCT+1040
APCTCRTN EQU   APCT+1036
APCTAPCP EQU   APCT+1032
APCTAMNA EQU   APCT+1028
APCTEMNA EQU   APCT+1024
APCTAALP EQU   APCT+1020
APCTEALP EQU   APCT+1016
@NM00026 EQU   APCT+1012
@NM00025 EQU   APCT+1008
@NM00024 EQU   APCT+1004
APCTEIPL EQU   APCT+1000
@NM00023 EQU   APCT+996
@NM00022 EQU   APCT+992
@NM00021 EQU   APCT+988
@NM00020 EQU   APCT+984
@NM00019 EQU   APCT+980
APCTECPW EQU   APCT+976
APCTEULD EQU   APCT+972
APCTECPT EQU   APCT+968
APCTEALC EQU   APCT+964
APCTECBL EQU   APCT+960
APCTECIT EQU   APCT+956
APCTCQAF EQU   APCTCQAQ
APCTCQL  EQU   APCTAPCQ+4
APCTCQF  EQU   APCTAPCQ
APCTCQLK EQU   APCT+940
@NM00018 EQU   @NM00014+2
@NM00017 EQU   APCTPRSW
APCTAPST EQU   APCTPRSW
@NM00016 EQU   APCTPRSW
@NM00015 EQU   APCTSTAT
APCTWARM EQU   APCTSTAT
APCTTERM EQU   APCTSTAT
APCTHALT EQU   APCTSTAT
APCTQSCE EQU   APCTSTAT
APCTSTRT EQU   APCTSTAT
APCTACT  EQU   APCTSTAT
@NM00013 EQU   APCT+935
APCTSOUT EQU   APCT+934
APCTDAID EQU   APCT+933
APCTSV34 EQU   APCT+932
APCTMJOB EQU   APCT+928
APCTTCB  EQU   APCT+924
APCTASCB EQU   APCT+920
APCTDCNW EQU   APCT+918
APCTDCNR EQU   APCT+916
@NM00012 EQU   APCT+912
@NM00011 EQU   APCT+908
@NM00010 EQU   APCT+904
@NM00009 EQU   APCT+900
@NM00008 EQU   APCTERRS+22
APCTERTJ EQU   APCTERRS+20
APCTERTD EQU   APCTERRS+18
APCTERTC EQU   APCTERRS+16
APCTERTB EQU   APCTERRS+14
APCTERTA EQU   APCTERRS+12
APCTERT9 EQU   APCTERRS+10
APCTERT3 EQU   APCTERRS+8
APCTERT2 EQU   APCTERRS+6
APCTERT1 EQU   APCTERRS+4
APCTERT0 EQU   APCTERRS+2
APCTERTT EQU   APCTERRS
APCTDSAP EQU   APCT+872
APCTISUB EQU   APCT+868
APCTUBAP EQU   APCT+864
APCTAPDS EQU   APCT+860
APCTUBIC EQU   APCT+856
APCTUBIS EQU   APCT+852
APCTAPUB EQU   APCT+848
APCTUBLK EQU   APCT+844
APCTBR1A EQU   APCTBR14+2
@NM00007 EQU   APCTBR14
APCTSMSZ EQU   APCTSMAD+2
@NM00006 EQU   APCTSMAD+1
@NM00005 EQU   APCTSMAD
APCTSMIS EQU   APCTSMIN+2
@NM00004 EQU   APCTSMIN+1
APCTSMSP EQU   APCTSMIN
@NM00003 EQU   APCT+30
APCTLINE EQU   APCT+28
APCTLBSZ EQU   APCT+24
APCTREG  EQU   APCT+20
@NM00002 EQU   APCTENQM
APCTSSVT EQU   APCT+8
APCTUSER EQU   APCT+4
APCTID   EQU   APCT
APSVWORK EQU   APSV+80
@NM00001 EQU   APSV+80
APSVFREE EQU   APSV+76
APSVAPSM EQU   APSV+72
APSVRG12 EQU   APSVREGS+56
APSVRG11 EQU   APSVREGS+52
APSVRG10 EQU   APSVREGS+48
APSVRG9  EQU   APSVREGS+44
APSVRG8  EQU   APSVREGS+40
APSVRG7  EQU   APSVREGS+36
APSVRG6  EQU   APSVREGS+32
APSVRG5  EQU   APSVREGS+28
APSVRG4  EQU   APSVREGS+24
APSVRG3  EQU   APSVREGS+20
APSVRG2  EQU   APSVREGS+16
APSVRG1  EQU   APSVREGS+12
APSVRG0  EQU   APSVREGS+8
APSVRG15 EQU   APSVREGS+4
APSVRG14 EQU   APSVREGS
APSVNEXT EQU   APSV+8
APSVPREV EQU   APSV+4
APSVAPSC EQU   APSV
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS
@RC00043 EQU   SEARCH
@RC00074 EQU   SEARCH
@RC00069 EQU   SEARCH
@RC00082 EQU   SEARCH
@RC00112 EQU   SEARCH
@RC00100 EQU   SEARCH
@RC00121 EQU   SEARCH
@RC00119 EQU   SEARCH
@RC00151 EQU   @RC00148
@RF00186 EQU   ENDPRM
@RF00185 EQU   BADPRM
@RF00211 EQU   ENDPRM
@RC00209 EQU   ENDPRM
@RC00190 EQU   ENDPRM
@RC00214 EQU   ENDPRM
@RC00180 EQU   @EL00002
@PB00010 EQU   @PB00011
@RC00044 EQU   @RC00043
@RC00053 EQU   @RC00043
@RC00091 EQU   @RC00082
@RC00085 EQU   @RC00082
@RC00103 EQU   @RC00100
@RC00132 EQU   @RC00121
@RC00122 EQU   @RC00121
@RF00196 EQU   @RC00190
@RC00204 EQU   @RC00190
@RC00215 EQU   @RC00214
@RC00182 EQU   @RC00180
@PB00009 EQU   @PB00010
@RF00057 EQU   @RC00053
@RC00060 EQU   @RC00053
@RC00128 EQU   @RC00122
@RF00135 EQU   @RC00132
@PB00008 EQU   @PB00009
@PB00007 EQU   @PB00008
@PB00006 EQU   @PB00007
@PB00005 EQU   @PB00006
@PB00004 EQU   @PB00005
@PB00003 EQU   @PB00004
@RF00235 EQU   @PB00003
@ENDDATA EQU   *
         END   IGTJI3,(C'PLS2313',0701,77092)
