TJHC     TITLE 'IGTJHC - SUBSYSTEM ALLOCATION ALLOCATION SUBRTN.       *
                        '
IGTJHC   CSECT ,                                                01S0001
@MAINENT DS    0H                                               01S0001
         USING *,@15                                            01S0001
         B     @PROLOG                                          01S0001
         DC    AL1(16)                                          01S0001
         DC    C'IGTJHC    77.230'                              01S0001
         DROP  @15
@PROLOG  STM   @14,@12,12(@13)                                  01S0001
         BALR  @07,0                                            01S0001
@PSTART  DS    0H                                               01S0001
         USING @PSTART,@07                                      01S0001
         L     @00,@SIZDATD                                     01S0001
         IGTYGSV  R,LV=(0)
         LR    @06,@01                                          01S0001
         USING @DATD,@06                                        01S0001
         ST    @13,@SA00001+4                                   01S0001
         LM    @00,@01,20(@13)                                  01S0001
         ST    @06,8(,@13)                                      01S0001
         LR    @13,@06                                          01S0001
*                                           STACK SAVED BY RESTART
*                                           FLIH               MDC078*/
         EJECT
*   /* IGTJHC - ALLOCATE 3838 SUBSYSTEM RESOURCES */            01S0101
*NUMUNSAT = NUMALREQ;               /* NUMBER OF UNSATISFIED REQUESTS*/
         L     NUMUNSAT,NUMALREQ(,ALLCWAPT)                     01S0101
*                                   /* = NUMBER OF REQUESTS          */
*RFY (APDSPTR,APUBPTR) RSTD;        /* REGS USED IN SEGMENT          */
*RFY SSAGARBK BASED (SSDDRPTR);     /* PROVIDE BASING EXPRESSION     */
*RFY APDS BASED(APDSPTR);           /* PROVIDE BASING EXPRESSION     */
*RFY APUB BASED (APUBPTR);          /* PROVIDE BASING EXPRESSION     */
*DO WHILE ALLFAIL = BOFF & NUMUNSAT > 0; /* ATTEMPT ALLOCATION UNTIL */
         B     @DE00106                                         01S0106
@DL00106 DS    0H                                               01S0107
*                                   /* CANCELED OR SUCCESSFUL        */
*  SSDDRPTR = FIRSTARB;             /* POINT TO FIRST REQUEST        */
         L     SSDDRPTR,FIRSTARB(,ALLCWAPT)                     01S0107
*  DO UNTIL SSDDRPTR = 0;           /* DO ONCE FOR EACH REQUEST      */
@DL00108 DS    0H                                               01S0109
*    APDSPTR = SSAGSSCM;            /* POINT TO APDS                 */
         L     APDSPTR,SSAGSSCM(,SSDDRPTR)                      01S0109
*    IF APDSOWN = SHR THEN          /*   AND IS A SHARED PORT REQUEST*/
         TM    APDSOWN(APDSPTR),B'10000000'                     01S0110
         BNZ   @RF00110                                         01S0110
*   /* PROCESS SHARED PORT ALLOCATION REQUESTS */               02S0111
*SHRPRTDO:                                                      02S0111
*DO;                                                            02S0111
SHRPRTDO DS    0H                                               02S0112
*SEARCH = YES;                      /* SEARCH UNTIL SUCCESSFUL       */
         OI    SEARCH,B'10000000'                               02S0112
*APUBPTR = APCTUBIS;                /* ADDRESS FIRST APUB ON SHARED Q*/
         L     APUBPTR,APCTUBIS(,APCTPTR)                       02S0113
*DO WHILE APUBPTR ^= 0 & SEARCH = YES;/* DO UNTIL SHARED QUEUE       */
         B     @DE00114                                         02S0114
@DL00114 DS    0H                                               02S0115
*                                   /* EXHAUSTED OR SUCCESSFUL       */
*  IF APUBALF0 = 0 & APUBALF1 = 0 & APDSREG <= APUBRGN THEN     02S0115
         CLI   APUBALF0(APUBPTR),0                              02S0115
         BNE   @RF00115                                         02S0115
         CLI   APUBALF1(APUBPTR),0                              02S0115
         BNE   @RF00115                                         02S0115
         L     @09,APDSREG(,APDSPTR)                            02S0115
         CH    @09,APUBRGN(,APUBPTR)                            02S0115
         BH    @RF00115                                         02S0115
*                                   /* IF THE APUB IS AVAILABLE AND  */
*                                   /* THE PARTITION IS LARGE ENOUGH */
*    DO;                            /* THEN IT COULD BE ALLOCATED    */
*      RFY R15F RSTD;               /* RESTRICT REG FOR RETURN CODE  */
*      ALLINST = BON;               /* INDICATE INST EXIT IN CONTROL */
         OI    ALLINST(ALLCWAPT),B'00100000'                    02S0118
*      CALL APCT1JHC;               /* INVOKE INST EXIT TO CONCUR/NON*/
         L     @15,APCT1JHC(,APCTPTR)                           02S0119
         BALR  @14,@15                                          02S0119
*                                   /* CONCUR                        */
*      ALLINST = BOFF;              /* INDICATE ALLOCATION IN CONTROL*/
         NI    ALLINST(ALLCWAPT),B'11011111'                    02S0120
*      IF R15F = 0 THEN             /* INSTALLATION OK'D ALLOCATION  */
         LTR   R15F,R15F                                        02S0121
         BNZ   @RF00121                                         02S0121
*        DO;                        /* DO THE ALLOCATION             */
*          ALLRES = BON;            /* INDICATE SUBSYSTEM RESOURCES  */
         OI    ALLRES(ALLCWAPT),B'00001000'                     02S0123
*                                   /* HAVE BEEN ALLOCATED TO THE JOB*/
*          APDSARS = BON;           /* INDICATE SATISFIED REQUEST    */
         OI    APDSARS(APDSPTR),B'00001000'                     02S0124
*          NUMUNSAT = NUMUNSAT - 1; /* 1 LESS REQUEST UNSATISFIED    */
         BCTR  NUMUNSAT,0                                       02S0125
*          SEARCH = NO;             /* TERMINATE SEARCH              */
         NI    SEARCH,B'01111111'                               02S0126
*          APDSIER = BOFF;          /* IF'S NOW ALLOCATE SO FORGET   */
         NI    APDSIER(APDSPTR),B'11111011'                     02S0127
*        END;                                                   02S0128
*      ELSE                         /* RC ^= 0: INSTALLATION EXIT    */
*        DO;                        /* REJECTED REQUEST      @ZA25364*/
         B     @RC00121                                         02S0129
@RF00121 DS    0H                                               02S0130
*          APUBBIER = BON;          /* INDICATE IN APUB      @ZA25364*/
         L     @14,APUBBIER-2(,APUBPTR)                         02S0130
@GL00003 LR    @09,@14                                          02S0130
         O     @09,@CF02410                                     02S0130
         CS    @14,@09,APUBBIER-2(APUBPTR)                      02S0130
         BNE   @GL00003                                         02S0130
*          APDSIER = BON;           /* AND IN APDS           @ZA25364*/
         OI    APDSIER(APDSPTR),B'00000100'                     02S0131
*        END;                       /* DO IF R15F = 0        @ZA25364*/
*      RFY R15F UNRSTD;             /* UNRESTRICT REG FOR RETURN CODE*/
@RC00121 DS    0H                                               02S0134
*    END;                                                       02S0134
*  APUBPTR = APUBNXIO;              /* ADVANCE TO NEXT APUB OR 0     */
@RF00115 L     APUBPTR,APUBNXIO(,APUBPTR)                       02S0135
*END;                               /* END OF DOWHILE APUBPTR...     */
@DE00114 LTR   APUBPTR,APUBPTR                                  02S0136
         BZ    @DC00114                                         02S0136
         TM    SEARCH,B'10000000'                               02S0136
         BO    @DL00114                                         02S0136
@DC00114 DS    0H                                               02S0137
*END SHRPRTDO;                      /* END OF SHARED PORT ALLOCATION */
*    ELSE                           /*   OTHERWISE                   */
*   /* PROCESS EXCLUSIVE PORT ALLOCATION REQUESTS */            02S0138
*EXCPRTDO:                                                      02S0138
*DO;                                                            02S0138
         B     @RC00110                                         02S0138
@RF00110 DS    0H                                               02S0138
EXCPRTDO DS    0H                                               02S0139
*  SSBCHNLS = 0;                    /* NO SUITABLE SUBCHANNELS YET   */
         SLR   SSBCHNLS,SSBCHNLS                                02S0139
*  APUBPTR = APCTUBIS;              /* START WITH FIRST SHARED SUBCHN*/
         L     APUBPTR,APCTUBIS(,APCTPTR)                       02S0140
*  DO WHILE APUBPTR ^= 0;           /* DO FOR EACH APUB ON SHR'D QUE */
         B     @DE00141                                         02S0141
@DL00141 DS    0H                                               02S0142
*    APUBALF2 = 0;                  /* SET TEMPORARY INDICATORS ZERO */
         MVI   APUBALF2(APUBPTR),X'00'                          02S0142
*    APUBALF3 = 0;                  /* AND AGAIN             @ZA25364*/
         MVI   APUBALF3(APUBPTR),X'00'                          02S0143
*    IF APUBALF0 = 0 & APUBALF1 = 0 THEN/* IF APUB IS "AVAILABLE" AND*/
         CLI   APUBALF0(APUBPTR),0                              02S0144
         BNE   @RF00144                                         02S0144
         CLI   APUBALF1(APUBPTR),0                              02S0144
         BNE   @RF00144                                         02S0144
*      IF APDSREG <= APUBRGN THEN   /* PARTITION IS LARGE ENOUGH     */
         L     @09,APDSREG(,APDSPTR)                            02S0145
         CH    @09,APUBRGN(,APUBPTR)                            02S0145
         BH    @RF00145                                         02S0145
*        SSBCHNLS = SSBCHNLS + 1;   /* 1 MORE SUITABLE FOR ALLOCATION*/
         AL    SSBCHNLS,@CF00042                                02S0146
*      ELSE                         /* - PARTITION TOO SMALL. SUBCHAN*/
*        APUBBREQ = BON;            /* FAIL MANDATORY TEST           */
         B     @RC00145                                         02S0147
@RF00145 L     @09,APUBBREQ-2(,APUBPTR)                         02S0147
@GL00006 LR    @02,@09                                          02S0147
         O     @02,@CF02414                                     02S0147
         CS    @09,@02,APUBBREQ-2(APUBPTR)                      02S0147
         BNE   @GL00006                                         02S0147
*    ELSE                           /* - APUB IS NOT SELECTABLE . SO */
*      APUBBYT1 = BON;              /* INDICATE FOR TESTS TO FOLLOW. */
         B     @RC00144                                         02S0148
@RF00144 L     @09,APUBBYT1-2(,APUBPTR)                         02S0148
@GL00007 LR    @02,@09                                          02S0148
         O     @02,@CF02417                                     02S0148
         CS    @09,@02,APUBBYT1-2(APUBPTR)                      02S0148
         BNE   @GL00007                                         02S0148
*    APUBPTR = APUBNXIO;            /* POINT TO NEXT APUB OR ZERO    */
@RC00144 L     APUBPTR,APUBNXIO(,APUBPTR)                       02S0149
*  END;                                                         02S0150
@DE00141 SLR   @09,@09                                          02S0150
         CR    APUBPTR,@09                                      02S0150
         BNE   @DL00141                                         02S0150
*  IF SSBCHNLS > 0 THEN             /* IF AT LEAST ONE "AVAILABLE"   */
         CR    SSBCHNLS,@09                                     02S0151
         BNH   @RF00151                                         02S0151
*    DO;                            /* SUBCHANNEL IS LARGE ENOUGH    */
*   /* ALLOCATION - SUBCHANNEL ELIMINATION.  THIS MODULE ELIMINATES
*      APUBS FROM CONSIDERATION BY  ALLOCATION WHEN THEY ARE REQUIRED
*      TO HONOR EXISTING SHARED PORT ALLOCATIONS. */            03S0153
*JHIDO:                                                         03S0153
*DO;                                                            03S0153
JHIDO    DS    0H                                               03S0154
*   /* DETERMINE SIZE OF LARGEST SHARED PARTITION REQUEST PREVIOUSLY
*      SATISFIED. */                                            03S0154
*PTRSAVE = APDSPTR;                 /* SAVE PRESENT VALUE OF APDSPTR */
         ST    APDSPTR,PTRSAVE                                  03S0154
*APDSPTR = APCTAPDS;                /* POINT TO FIRST APDS           */
         L     APDSPTR,APCTAPDS(,APCTPTR)                       03S0155
*LRGSTREG = 0;                      /* INIT LARGEST                  */
         SLR   @09,@09                                          03S0156
         STH   @09,LRGSTREG                                     03S0156
*DO WHILE APDSPTR ^= 0;             /* DO EACH APDS ONCE             */
         B     @DE00157                                         03S0157
@DL00157 DS    0H                                               03S0158
*  IF APDSOWN = SHR & APDSARS = BON & APDSREG > LRGSTREG THEN   03S0158
         TM    APDSARS(APDSPTR),B'00001000'                     03S0158
         BNO   @RF00158                                         03S0158
         TM    APDSOWN(APDSPTR),B'10000000'                     03S0158
         BNZ   @RF00158                                         03S0158
         L     @09,APDSREG(,APDSPTR)                            03S0158
         CH    @09,LRGSTREG                                     03S0158
         BNH   @RF00158                                         03S0158
*                                   /* IF REQUEST IS SHARED,SATISFIED*/
*                                   /* AND LARGER THAN KNOWN LARGEST */
*    LRGSTREG = APDSREG;            /* SHARED REQUEST, SAVE REGN SIZE*/
         STH   @09,LRGSTREG                                     03S0159
*  APDSPTR = APDSAPDS;              /* ADVANCE TO NEXT APDS ON QUEUE */
@RF00158 L     APDSPTR,APDSAPDS(,APDSPTR)                       03S0160
*END;                               /* DO WHILE APDSPTR ^= 0         */
@DE00157 LTR   APDSPTR,APDSPTR                                  03S0161
         BNZ   @DL00157                                         03S0161
*APUBADDR =APCTUBIS;                /* POINT TO FIRST APUB ON SHR'D Q*/
         L     APUBADDR,APCTUBIS(,APCTPTR)                      03S0162
*DO WHILE APUBADDR ^= 0;            /* DO ONCE FOR AN APUB ON SHR'D Q*/
         B     @DE00163                                         03S0163
@DL00163 DS    0H                                               03S0164
*  APUBPTR = APUBADDR;              /* POINT TO POSSIBLE CANDIDATE   */
         LR    APUBPTR,APUBADDR                                 03S0164
*  IF APUBALF2 = 0 THEN             /* IF APUB IS CANDIDATE THEN     */
         CLI   APUBALF2(APUBPTR),0                              03S0165
         BNE   @RF00165                                         03S0165
*    DO;                                                        03S0166
*      THEAPUB = APUBPTR;           /* SAVE ITS ADDRESS              */
         ST    APUBPTR,THEAPUB                                  03S0167
*      APUBBYT1 = BON;              /* INDICATE IT'S NOT AVAILABLE   */
         L     @09,APUBBYT1-2(,APUBPTR)                         03S0168
@GL00009 LR    @02,@09                                          03S0168
         O     @02,@CF02417                                     03S0168
         CS    @09,@02,APUBBYT1-2(APUBPTR)                      03S0168
         BNE   @GL00009                                         03S0168
*      LREGAPUB = 0;                /* INIT LARGEST AVAILABLE REGION */
         SLR   @09,@09                                          03S0169
         STH   @09,LREGAPUB                                     03S0169
*      APUBPTR = APCTUBIS;          /* START AT THE BEGINNING AND    */
         L     APUBPTR,APCTUBIS(,APCTPTR)                       03S0170
*      DO WHILE APUBPTR ^= 0;       /* DO FOR EACH APUB ON SHR'D QUE */
         B     @DE00171                                         03S0171
@DL00171 DS    0H                                               03S0172
*        IF APUBBYT1=BOFF& APUBRGN > LREGAPUB THEN /* IF AVAILABLE &  *
         TM    APUBBYT1(APUBPTR),B'10000000'                    03S0172
         BNZ   @RF00172                                         03S0172
         LH    @09,APUBRGN(,APUBPTR)                            03S0172
         CH    @09,LREGAPUB                                     03S0172
         BNH   @RF00172                                         03S0172
*          LREGAPUB = APUBRGN;      /* LARGER THAN KNOWN LARGEST,    */
         STH   @09,LREGAPUB                                     03S0173
*        APUBPTR = APUBNXIO;        /* SAVE VALUE & ADVANCE TO NEXT  */
@RF00172 L     APUBPTR,APUBNXIO(,APUBPTR)                       03S0174
*      END;                                                     03S0175
@DE00171 LTR   APUBPTR,APUBPTR                                  03S0175
         BNZ   @DL00171                                         03S0175
*      APUBPTR =  THEAPUB;          /* RESTORE ADDRESS OF CANDIDATE  */
         L     APUBPTR,THEAPUB                                  03S0176
*      IF APUBRGN <= LREGAPUB THEN  /* IF LARGEST AVAILABLE > SELECT-*/
         LH    @09,APUBRGN(,APUBPTR)                            03S0177
         CH    @09,LREGAPUB                                     03S0177
         BH    @RF00177                                         03S0177
*        APUBBYT1 = BOFF;           /* INDICATE IT'S AVAILABLE       */
         L     @09,APUBBYT1-2(,APUBPTR)                         03S0178
@GL00011 LR    @02,@09                                          03S0178
         N     @02,@CF02420                                     03S0178
         CS    @09,@02,APUBBYT1-2(APUBPTR)                      03S0178
         BNE   @GL00011                                         03S0178
*      ELSE                         /* ELSE                          */
*        IF LREGAPUB >= LRGSTREG THEN /* IF LARGEST AVAIL >= LARGEST */
         B     @RC00177                                         03S0179
@RF00177 LH    @09,LREGAPUB                                     03S0179
         CH    @09,LRGSTREG                                     03S0179
         BL    @RF00179                                         03S0179
*          APUBBYT1 = BOFF;         /* REQUEST THAN, INDICATE OK.    */
         L     @09,APUBBYT1-2(,APUBPTR)                         03S0180
@GL00012 LR    @02,@09                                          03S0180
         N     @02,@CF02420                                     03S0180
         CS    @09,@02,APUBBYT1-2(APUBPTR)                      03S0180
         BNE   @GL00012                                         03S0180
*        ELSE                       /* APUB IS REQUIRED FOR EXISTING */
*          DO;                      /* SHARED PORT USERS. REMOVE FROM*/
         B     @RC00179                                         03S0181
@RF00179 DS    0H                                               03S0182
*            APUBBYT1 = BOFF;       /* CONSIDERATION.                */
*            APUBBREQ = BON;        /* DOES NOT MEET MANDATORY TEST  */
         L     @09,APUBBREQ-2(,APUBPTR)                         03S0183
@GL00013 LR    @02,@09                                          03S0183
         N     @02,@CB02423                                     03S0183
         O     @02,@CB02423+4                                   03S0183
         CS    @09,@02,APUBBREQ-2(APUBPTR)                      03S0183
         BNE   @GL00013                                         03S0183
*            SSBCHNLS = SSBCHNLS -1;/* ONE LESS CANDIDATE FOR ALLO-  */
         BCTR  SSBCHNLS,0                                       03S0184
*          END;                     /* CATION.                       */
*    END;                                                       03S0186
@RC00179 DS    0H                                               03S0186
@RC00177 DS    0H                                               03S0187
*  APUBADDR = APUBNXIO;             /* ADVANCE TO NEXT APUB.         */
@RF00165 L     APUBADDR,APUBNXIO(,APUBPTR)                      03S0187
*END;                                                           03S0188
@DE00163 LTR   APUBADDR,APUBADDR                                03S0188
         BNZ   @DL00163                                         03S0188
*APDSPTR = PTRSAVE;                 /* RESTORE APDS POINTER TO VALUE */
         L     APDSPTR,PTRSAVE                                  03S0189
*                                   /* ON ENTRY                      */
*END JHIDO;                                                     03S0190
*      IF SSBCHNLS >= 1 THEN        /* IF AT LEAST ONE SUBCHANNEL    */
         C     SSBCHNLS,@CF00042                                02S0191
         BL    @RF00191                                         02S0191
*        DO;                        /* COULD BE ALLOCATED THEN       */
*          TSBCHNLS = SSBCHNLS;     /* WORKING VARIABLE FOR 2JHC
*                                                            @ZA25364*/
         STH   SSBCHNLS,TSBCHNLS                                02S0193
*          ALLINST = BON;           /* INDICATE INST EXIT IN CONTROL */
         OI    ALLINST(ALLCWAPT),B'00100000'                    02S0194
*          CALL APCT2JHC(TSBCHNLS); /* CALL INST EXIT TO     @ZA25364*/
         LA    @09,TSBCHNLS                                     02S0195
         ST    @09,@AL00001                                     02S0195
         L     @15,APCT2JHC(,APCTPTR)                           02S0195
         LA    @01,@AL00001                                     02S0195
         BALR  @14,@15                                          02S0195
*                                   /* CONCUR/NONCONCUR              */
*          ALLINST = BOFF;          /* INDICATE ALLOCATION IN CONTROL*/
         NI    ALLINST(ALLCWAPT),B'11011111'                    02S0196
*          IF SSBCHNLS ^= TSBCHNLS THEN /* IF 2JHC ELIMINATED SOME
*                                                            @ZA25364*/
         LH    @09,TSBCHNLS                                     02S0197
         CR    SSBCHNLS,@09                                     02S0197
         BE    @RF00197                                         02S0197
*DO;                                /* INSURE ENTIRE SEGMENT INCLUDED
*                                                            @ZA25364*/
*  SSBCHNLS = 0;                    /* RESET NUMBER OF SUITABLE SUBS
*                                                            @ZA25364*/
         SLR   SSBCHNLS,SSBCHNLS                                03S0199
*  IF TSBCHNLS ^= 0 THEN            /* IF INST EXIT DID NOT ELIMINATE
*                                                            @ZA25364*/
         LTR   @09,@09                                          03S0200
         BZ    @RF00200                                         03S0200
*    DO;                            /* ALL THEN INDICATE THOSE WHICH
*                                                            @ZA25364*/
*      APUBPTR = APCTUBIS;          /* WERE REJECTED. START AT TOP.
*                                                            @ZA25364*/
         L     APUBPTR,APCTUBIS(,APCTPTR)                       03S0202
*      DO UNTIL APUBPTR = 0;        /* INDICATE INST EXIT ACTION
*                                                            @ZA25364*/
@DL00203 DS    0H                                               03S0204
*        IF APUBALF2 = 0 THEN       /* WAS/IS CANDIDATE FOR ALLOCATIN
*                                                            @ZA25364*/
         CLI   APUBALF2(APUBPTR),0                              03S0204
         BNE   @RF00204                                         03S0204
*          IF APUBBIST = BON THEN   /* WAS IS RIGHT          @ZA25364*/
         TM    APUBBIST(APUBPTR),B'01000000'                    03S0205
         BNO   @RF00205                                         03S0205
*            APUBBIER = BON;        /* REFLECT IT IN APUBALF2@ZA25364*/
         L     @09,APUBBIER-2(,APUBPTR)                         03S0206
@GL00014 LR    @02,@09                                          03S0206
         O     @02,@CF02410                                     03S0206
         CS    @09,@02,APUBBIER-2(APUBPTR)                      03S0206
         BNE   @GL00014                                         03S0206
*          ELSE                     /* STILL IS CANDIDATE    @ZA25364*/
*            SSBCHNLS = SSBCHNLS + 1; /* RE-COUNT THE CANDIDATES
*                                                            @ZA25364*/
         B     @RC00205                                         03S0207
@RF00205 AL    SSBCHNLS,@CF00042                                03S0207
*        APUBPTR = APUBNXIO;        /* ADVANCE TO NEXT/DONE  @ZA25364*/
@RC00205 DS    0H                                               03S0208
@RF00204 L     APUBPTR,APUBNXIO(,APUBPTR)                       03S0208
*      END;                         /* DO UNTIL APUBPTR = 0  @ZA25364*/
@DE00203 LTR   APUBPTR,APUBPTR                                  03S0209
         BNZ   @DL00203                                         03S0209
*    END;                           /* DO IF TSBCHNLS ^= 0   @ZA25364*/
*END;                               /* DO FOR SEGMENT PROC2JHC  03S0211
*                                                            @ZA25364*/
@RF00200 DS    0H                                               03S0212
*          IF SSBCHNLS > 0 THEN     /* IF INST EXIT APPROVED 1 OR    */
@RF00197 LTR   SSBCHNLS,SSBCHNLS                                02S0212
         BNP   @RF00212                                         02S0212
*            DO;                    /* MORE THEN REQUEST IS SATISFIED*/
*              ALLRES = BON;        /* INDICATE SUBSYSTEM RESOURCES  */
         OI    ALLRES(ALLCWAPT),B'00001000'                     02S0214
*                                   /* HAVE BEEN ALLOCATED TO THE JOB*/
*              APDSARS = BON;       /* INDICATE IT IN THE APDS       */
         OI    APDSARS(APDSPTR),B'00001000'                     02S0215
*              NUMUNSAT = NUMUNSAT -1; /* 1 LESS UNSATISFIED REQUEST */
         BCTR  NUMUNSAT,0                                       02S0216
*              APDSIER = BOFF;      /* IT'S NOW ALLOCATED SO FORGET  */
         NI    APDSIER(APDSPTR),B'11111011'                     02S0217
*              IF SSBCHNLS > 1 THEN                             02S0218
         C     SSBCHNLS,@CF00042                                02S0218
         BNH   @RF00218                                         02S0218
*   /* NOTE: OPTIONAL TEST ROUTINES MUST LEAVE APUBPTR CONTAINING
*      THE ADDRESS OF THE SELECTED APUB IF SSBCHNLS = 1 WHEN CONTROL
*      IS RETURNED TO THE OPTIONAL TEST PROCESSOR.  */          03S0219
*   /* OPTIONAL TEST PROCESSOR */                               03S0219
*DO I = NOPTESTS TO 1 BY -1 WHILE SSBCHNLS > 1; /* PERFORM OPTIONAL  */
         LA    I,3                                              03S0219
@DL00219 C     SSBCHNLS,@CF00042                                03S0219
         BNH   @DC00219                                         03S0219
*                                   /* TESTS UNTIL 1 APUB IS SELECTED*/
*  GOTO OPTTEST;                    /* EXECUTE THE SELECTED TEST     */
         LR    @02,I                                            03S0220
         SLA   @02,2                                            03S0220
         L     @02,OPTTESTS-4(@02)                              03S0220
         BR    @02                                              03S0220
*TSTMPAFN: ;                       /* RTN TO ELIMINATE 3838S NOT ON  */
TSTMPAFN DS    0H                                               03S0222
*                                   /* THE CPU ON WHICH THE JOB RUNS */
*DO;                                /* GET ENTIRE SEGMENT            */
*  JBSTPAFN = FIRSTARB -> SSAGSSCM -> APDSASCB -> ASCBAFFN; /* OBTAIN*/
         L     @02,FIRSTARB(,ALLCWAPT)                          04S0223
         L     @02,SSAGSSCM(,@02)                               04S0223
         L     @02,APDSASCB(,@02)                               04S0223
         MVC   JBSTPAFN(2),ASCBAFFN(@02)                        04S0223
*                                   /* JOB STEP AFFINITY FROM ASCB   */
*  IF CVTNOMP = BOFF THEN           /* IF MVS GEND FOR UNIPROCESSOR  */
         L     @02,CVTPTR                                       04S0224
         TM    CVTNOMP(@02),B'00000100'                         04S0224
         BNZ   @RF00224                                         04S0224
*    IF JBSTPAFN ^= NOAFFIN THEN    /* & IF JOB STEP HAS AFFINITY    */
         CLC   JBSTPAFN(2),NOAFFIN                              04S0225
         BE    @RF00225                                         04S0225
*      DO;                          /* THEN PERFORM THIS OPTL TEST   */
*        APUBPTR = APCTUBIS;        /* SCAN I/O QUEUE FROM TOP       */
         L     APUBPTR,APCTUBIS(,APCTPTR)                       04S0227
*        DO UNTIL APUBPTR = 0;      /* DO ONCE FOR EACH APUB ON I/0 Q*/
@DL00228 DS    0H                                               04S0229
*          IF APUBALF2 = 0 THEN     /* IF APUB IS CANDIDATE THEN     */
         CLI   APUBALF2(APUBPTR),0                              04S0229
         BNE   @RF00229                                         04S0229
*            DO;                    /* SET ALLOCATION INDICATORS     */
*              APUBMSTR -> APUBBTST = BOFF; /* SHOW MSTR NOT ELIMNATD*/
         L     @14,APUBMSTR(,APUBPTR)                           04S0231
         L     @02,APUBBTST-3(,@14)                             04S0231
@GL00015 LR    @15,@02                                          04S0231
         N     @15,@CF02428                                     04S0231
         CS    @02,@15,APUBBTST-3(@14)                          04S0231
         BNE   @GL00015                                         04S0231
*              APUBALF3 = 0;        /* CLEAR FLAGS PERTINENT TO      */
         MVI   APUBALF3(APUBPTR),X'00'                          04S0232
*                                   /* CURRENT OPTIONAL TEST         */
*            END;                   /* DO IF ALF2 = 0                */
*          APUBPTR = APUBNXIO;      /* GO ON TO NEXT APUB OR DONE    */
@RF00229 L     APUBPTR,APUBNXIO(,APUBPTR)                       04S0234
*        END;                       /* DO UNTIL APUBPTR = 0          */
@DE00228 LTR   APUBPTR,APUBPTR                                  04S0235
         BNZ   @DL00228                                         04S0235
*        TSBCHNLS = SSBCHNLS;       /* WORKING # OF SUITABLE SUBCHANS*/
         STH   SSBCHNLS,TSBCHNLS                                04S0236
*        APUBPTR = APCTUBIS;        /* SCAN I/O QUEUE FROM TOP       */
         L     APUBPTR,APCTUBIS(,APCTPTR)                       04S0237
*        DO UNTIL APUBPTR = 0 × TSBCHNLS = 0;/* ONCE FOR EACH APUB ON*/
@DL00238 DS    0H                                               04S0239
*                                   /* I/O QUEUE OR UNTIL NO CANDI-  */
*                                   /* DATES REMAIN                  */
*          IF APUBALF2 = 0 THEN     /* IF APUB IS CANDIDATE THEN     */
         CLI   APUBALF2(APUBPTR),0                              04S0239
         BNE   @RF00239                                         04S0239
*            IF APUBMSTR -> APUBBTST = BOFF THEN /*IF MSTR ^ ELIMNATD*/
         L     @02,APUBMSTR(,APUBPTR)                           04S0240
         TM    APUBBTST(@02),B'10000000'                        04S0240
         BNZ   @RF00240                                         04S0240
*              DO;                  /* ATTEMPT TO ELIMINATE          */
*                RFY R0F RSTD;      /* REG USED FOR MASK REP CPUS W/ */
*                RFY UCBOB BASED(APUBUCB); /* PATHS.  APUB -> UCB    */
*                R0F = '';          /* NO CPUS HAVE PATH NOW         */
         SLR   R0F,R0F                                          04S0244
*                IF UCBPPA = BON ×  /* IF PRIMARY PATH FROM CPU 0 OR */
*                   UCBSPA = BON THEN /* SECONDARY PATH FROM CPU 0   */
         L     @01,APUBUCB(,APUBPTR)                            04S0245
         TM    UCBPPA(@01),B'11000000'                          04S0245
         BZ    @RF00245                                         04S0245
*                  R0F = R0F × CPU0PATH; /* INDICATE CPU0 ID IN MASK */
         O     R0F,@CF00077                                     04S0246
*                IF UCBPPB = BON ×  /* IF PRIMARY PATH FROM CPU 1 OR */
*                   UCBSPB = BON THEN /* SECONDARY PATH FROM CPU 1   */
@RF00245 L     @01,APUBUCB(,APUBPTR)                            04S0247
         TM    UCBPPB(@01),B'00110000'                          04S0247
         BZ    @RF00247                                         04S0247
*                  R0F = R0F × CPU1PATH; /* INDICATE CPU1 ID IN MASK */
         O     R0F,@CF00079                                     04S0248
*                IF (R0F & JBSTPAFN) = 0 THEN /* IF NO PATH FROM CPU */
@RF00247 LH    @02,JBSTPAFN                                     04S0249
         N     @02,@CF02431                                     04S0249
         NR    @02,R0F                                          04S0249
         LTR   @02,@02                                          04S0249
         BNZ   @RF00249                                         04S0249
*                                   /* (S) ON WHICH JOB WILL RUN THEN*/
*                  DO;              /* ELIMINATE THIS 3838           */
*                    APUBBTST = BON;/* CANDIDATE FAILS CURRENT TEST  */
         L     @02,APUBBTST-3(,APUBPTR)                         04S0251
@GL00016 LR    @01,@02                                          04S0251
         O     @01,@CF02432                                     04S0251
         CS    @02,@01,APUBBTST-3(APUBPTR)                      04S0251
         BNE   @GL00016                                         04S0251
*                    APUBMSTR -> APUBBTST = BON; /* 3838 IS ELIMINATD*/
         L     @15,APUBMSTR(,APUBPTR)                           04S0252
         L     @02,APUBBTST-3(,@15)                             04S0252
@GL00017 LR    @01,@02                                          04S0252
         O     @01,@CF02432                                     04S0252
         CS    @02,@01,APUBBTST-3(@15)                          04S0252
         BNE   @GL00017                                         04S0252
*                    TSBCHNLS = TSBCHNLS -1; /* ONE LESS CANDIDATE   */
         LH    @02,TSBCHNLS                                     04S0253
         BCTR  @02,0                                            04S0253
         STH   @02,TSBCHNLS                                     04S0253
*                  END;             /* DO IF NO PATH FROM JOB'S CPUS */
*                RFY R0F UNRSTD;    /* REG USED FOR BIT MASK         */
@RF00249 DS    0H                                               04S0256
*              END;                 /* DO IF MSTR NOT PREV ELIMINATED*/
*            ELSE                   /* MSTR PREVIOUSLY ELIMINATED    */
*              DO;                  /* INDICATE APUB NOT A CANDIDATE */
         B     @RC00240                                         04S0257
@RF00240 DS    0H                                               04S0258
*                APUBBTST = BON;    /* INDICATE APUB NOT A CANDIDATE */
         L     @02,APUBBTST-3(,APUBPTR)                         04S0258
@GL00018 LR    @15,@02                                          04S0258
         O     @15,@CF02432                                     04S0258
         CS    @02,@15,APUBBTST-3(APUBPTR)                      04S0258
         BNE   @GL00018                                         04S0258
*                TSBCHNLS = TSBCHNLS -1; /* ONE LESS SUBCHANNEL      */
         LH    @02,TSBCHNLS                                     04S0259
         BCTR  @02,0                                            04S0259
         STH   @02,TSBCHNLS                                     04S0259
*              END;                 /* ELSE MSTR PREV ELIMINATED     */
*          APUBPTR = APUBNXIO;      /* ADVANCE TO NEXT OR DONE       */
@RC00240 DS    0H                                               04S0261
@RF00239 L     APUBPTR,APUBNXIO(,APUBPTR)                       04S0261
*        END;                       /* DO UNTIL APUBPTR = 0 ETC      */
@DE00238 SLR   @02,@02                                          04S0262
         CR    APUBPTR,@02                                      04S0262
         BE    @DC00238                                         04S0262
         CH    @02,TSBCHNLS                                     04S0262
         BNE   @DL00238                                         04S0262
@DC00238 DS    0H                                               04S0263
*        IF TSBCHNLS = 0 THEN       /* IF OPT TEST ELIMINATED ALL    */
         LH    @02,TSBCHNLS                                     04S0263
         LTR   @02,@02                                          04S0263
         BZ    @RT00263                                         04S0263
*          ;                        /* REMAINING CANDIDATES THEN     */
*                                   /* NO ACTION REQUIRED            */
*        ELSE                       /* TSBCHNLS > 0                  */
*          DO;                      /* INVOKE THE INSTALLATION EXIT  */
*            ALLINST = BON;         /* INDICATE INST EXIT IN CONTROL */
         OI    ALLINST(ALLCWAPT),B'00100000'                    04S0266
*            CALL APCT1JHL(TSBCHNLS); /*EXIT MAY ELIMINATE MORE CANDS*/
         LA    @02,TSBCHNLS                                     04S0267
         ST    @02,@AL00001                                     04S0267
         L     @15,APCT1JHL(,APCTPTR)                           04S0267
         LA    @01,@AL00001                                     04S0267
         BALR  @14,@15                                          04S0267
*            ALLINST = BOFF;        /* INDICATE ALLOCATION IN CONTROL*/
         NI    ALLINST(ALLCWAPT),B'11011111'                    04S0268
*            IF TSBCHNLS >= 1 THEN  /* IF ONE OR MORE CANDIDATES RE- */
         LH    @02,TSBCHNLS                                     04S0269
         C     @02,@CF00042                                     04S0269
         BL    @RF00269                                         04S0269
*              DO;                  /* MAIN THEN MERGE EFFECTS OF THE*/
*                                   /* CURRENT OPTIONAL TEST INTO    */
*                SSBCHNLS = TSBCHNLS; /* SSBCHNLS AND APUBALF2       */
         LR    SSBCHNLS,@02                                     04S0271
*                APUBPTR = APCTUBIS; /* SCAN THE I/0 QUEUE FROM TOP  */
         L     APUBPTR,APCTUBIS(,APCTPTR)                       04S0272
*                DO UNTIL APUBPTR = 0; /* DO ONCE FOR EACH APUB ON Q */
@DL00273 DS    0H                                               04S0274
*                  IF APUBALF2 = 0 THEN /* IF APUB IS CANDIDATE AND  */
         CLI   APUBALF2(APUBPTR),0                              04S0274
         BNE   @RF00274                                         04S0274
*                    IF APUBBTST = BON × /* THIS OPTL TEST ELIMINATED*/
*                       APUBBIST = BON THEN /* OR INST EXIT ELIMNATD */
         TM    APUBBTST(APUBPTR),B'11000000'                    04S0275
         BZ    @RF00275                                         04S0275
*                      APUBBOPT = BON; /* INDICATE OPTL TEST FAILED  */
         L     @02,APUBBOPT-2(,APUBPTR)                         04S0276
@GL00020 LR    @15,@02                                          04S0276
         O     @15,@CF02435                                     04S0276
         CS    @02,@15,APUBBOPT-2(APUBPTR)                      04S0276
         BNE   @GL00020                                         04S0276
*                    ELSE           /* APUB SURVIVED ELIMINATION     */
*                      GOODAPUB = APUBPTR;/* SAVE ADDRESS OF SURVIVOR*/
         B     @RC00275                                         04S0277
@RF00275 ST    APUBPTR,GOODAPUB                                 04S0277
*                  ELSE;            /* EFFECTS OF OPT TEST NEED NOT  */
@RF00274 DS    0H                                               04S0279
*                                   /* BE MERGED WITH SSBCHNLS/BOPT  */
*                  APUBPTR = APUBNXIO; /* ADVANCE TO NXT ON I/O QUEUE*/
@RC00274 L     APUBPTR,APUBNXIO(,APUBPTR)                       04S0279
*                END;               /* DO UNTIL APUBPTR = 0          */
@DE00273 LTR   APUBPTR,APUBPTR                                  04S0280
         BNZ   @DL00273                                         04S0280
*                APUBPTR = GOODAPUB;/* POINT TO SURVIVOR IN CASE     */
         L     APUBPTR,GOODAPUB                                 04S0281
*                                   /* THERE IS JUST ONE SURVIVOR    */
*              END;                 /* DO IF TSBCHNLS >= 1           */
*          END;                     /* DO IF TSBCHNLS > 0            */
*      END;                         /* DO IF AFFININY SPECIFIED      */
*END;                               /* END OF SEGMENT                */
*  GOTO ENDTEST;                    /* RETURN TO OPT TEST PROCESSOR  */
         B     ENDTEST                                          03S0286
*TSTSAM38: ;                        /* RTN TO ELIMINATE 3838S ON     */
TSTSAM38 DS    0H                                               03S0288
*                                   /* WHICH PORTS HAVE ALREADY BEEN */
*                                   /* EXCLUSIVELY ALLOCATED TO THIS */
*                                   /* JOB.                          */
*DO;                                /* GET ENTIRE SEGMENT            */
*  APUBPTR = APCTUBIS;              /* SCAN I/O QUEUE FROM TOP       */
         L     APUBPTR,APCTUBIS(,APCTPTR)                       04S0289
*  DO UNTIL APUBPTR = 0;            /* DO ONCE FOR EACH APUB ON I/0 Q*/
@DL00290 DS    0H                                               04S0291
*    IF APUBALF2 = 0 THEN           /* IF APUB IS CANDIDATE THEN     */
         CLI   APUBALF2(APUBPTR),0                              04S0291
         BNE   @RF00291                                         04S0291
*      DO;                          /* INDICATE MASTER NOT ELIMINATED*/
*        APUBMSTR -> APUBBTST = BOFF;/* AND ALSO THE USER SUBCHAN TOO*/
         L     @14,APUBMSTR(,APUBPTR)                           04S0293
         L     @02,APUBBTST-3(,@14)                             04S0293
@GL00021 LR    @15,@02                                          04S0293
         N     @15,@CF02428                                     04S0293
         CS    @02,@15,APUBBTST-3(@14)                          04S0293
         BNE   @GL00021                                         04S0293
*        APUBALF3 = 0;              /* FOR TESTS TO FOLLOW           */
         MVI   APUBALF3(APUBPTR),X'00'                          04S0294
*      END;                         /* DO IF APUB IS CANDIDATE       */
*    APUBPTR = APUBNXIO;            /* ON TO NEXT OR DONE            */
@RF00291 L     APUBPTR,APUBNXIO(,APUBPTR)                       04S0296
*  END;                             /* DO UNTIL APUBPTR = 0          */
@DE00290 LTR   APUBPTR,APUBPTR                                  04S0297
         BNZ   @DL00290                                         04S0297
*  TSBCHNLS = SSBCHNLS;             /* WORKING # OF SUITABLE SUBCHANS*/
         STH   SSBCHNLS,TSBCHNLS                                04S0298
*  APUBPTR = APCTUBIS;              /* SCAN I/O QUEUE FROM TOP       */
         L     APUBPTR,APCTUBIS(,APCTPTR)                       04S0299
*  DO UNTIL APUBPTR = 0 × TSBCHNLS = 0;/* DO ONCE FOR EACH APUB ON   */
@DL00300 DS    0H                                               04S0301
*                                   /* I/O QUEUE OR UNTIL NO CANDI-  */
*                                   /* DATES REMAIN                  */
*    IF APUBALF2 = 0 THEN           /* IF APUB IS CANDIDATE THEN     */
         CLI   APUBALF2(APUBPTR),0                              04S0301
         BNE   @RF00301                                         04S0301
*      IF APUBMSTR -> APUBBTST = BOFF THEN /* IF MSTR NOT ELIMINATED */
         L     @02,APUBMSTR(,APUBPTR)                           04S0302
         TM    APUBBTST(@02),B'10000000'                        04S0302
         BNZ   @RF00302                                         04S0302
*        DO;                        /* ATTEMPT TO ELIMINATE          */
*          CANDAPUB = APUBPTR;      /* SAVE ADDR OF CANDIDATE        */
         ST    APUBPTR,CANDAPUB                                 04S0304
*          APUBPTR = APUBMSTR -> APUBAPUB; /* FIRST AVAILABLE SUBCHAN*/
         L     @02,APUBAPUB(,@02)                               04S0305
         LR    APUBPTR,@02                                      04S0305
*          DO UNTIL APUBPTR = 0 × CANDAPUB -> APUBBTST = BON;   04S0306
@DL00306 DS    0H                                               04S0307
*                                   /* DO FOR EACH NON CONTROL SUB OR*/
*                                   /* UNTIL THE 3838 IS ELIMINATED  */
*            IF APUBOWN = EXC &     /* IF APUB EXCLUSIVELY OWNED     */
*               APUBAPDS -> APDSASCB = APDSASCB & /*BY THIS ADDR SPAC*/
*               APUBPTR ^= CANDAPUB THEN /* & THIS IS NOT THE CANDATE*/
         TM    APUBOWN(APUBPTR),B'01000000'                     04S0307
         BNO   @RF00307                                         04S0307
         L     @02,APUBAPDS(,APUBPTR)                           04S0307
         CLC   APDSASCB(4,@02),APDSASCB(APDSPTR)                04S0307
         BNE   @RF00307                                         04S0307
         L     @02,CANDAPUB                                     04S0307
         CR    APUBPTR,@02                                      04S0307
         BE    @RF00307                                         04S0307
*              DO;                    /* ELIMINATE THE CANDIDATE     */
*                CANDAPUB -> APUBBTST = BON; /* DOES NOT PASS CURRENT*/
         L     @15,APUBBTST-3(,@02)                             04S0309
@GL00024 LR    @14,@15                                          04S0309
         O     @14,@CF02432                                     04S0309
         CS    @15,@14,APUBBTST-3(@02)                          04S0309
         BNE   @GL00024                                         04S0309
*                TSBCHNLS = TSBCHNLS - 1; /* ONE LESS CANDIDATE      */
         LH    @02,TSBCHNLS                                     04S0310
         BCTR  @02,0                                            04S0310
         STH   @02,TSBCHNLS                                     04S0310
*                APUBMSTR -> APUBBTST = BON;/* ENTIRE 3838 ELIMINATED*/
         L     @14,APUBMSTR(,APUBPTR)                           04S0311
         L     @02,APUBBTST-3(,@14)                             04S0311
@GL00025 LR    @15,@02                                          04S0311
         O     @15,@CF02432                                     04S0311
         CS    @02,@15,APUBBTST-3(@14)                          04S0311
         BNE   @GL00025                                         04S0311
*              END;                   /* DO IF...ELIMINATED          */
*            APUBPTR = APUBAPUB;      /* ADDRESS NEXT APUB OR DONE   */
@RF00307 L     APUBPTR,APUBAPUB(,APUBPTR)                       04S0313
*          END;                       /* DO UNTIL APUBPTR = 0 ETC    */
@DE00306 LTR   APUBPTR,APUBPTR                                  04S0314
         BZ    @DC00306                                         04S0314
         L     @02,CANDAPUB                                     04S0314
         TM    APUBBTST(@02),B'10000000'                        04S0314
         BNO   @DL00306                                         04S0314
@DC00306 DS    0H                                               04S0315
*          APUBPTR = CANDAPUB -> APUBNXIO;/* NXT ON I/O QUEUE OR DONE*/
         L     @02,CANDAPUB                                     04S0315
         L     APUBPTR,APUBNXIO(,@02)                           04S0315
*        END;                         /* DO IF ALF2 = 0              */
*      ELSE                         /* MSTR PREVIOUSLY ELIMINATED    */
*        DO;                        /* INDICATE SUBCHANNEL NOT CAND  */
         B     @RC00302                                         04S0317
@RF00302 DS    0H                                               04S0318
*          APUBBTST = BON;          /* FAILED CURRENT OPTIONAL TEST  */
         L     @02,APUBBTST-3(,APUBPTR)                         04S0318
@GL00027 LR    @15,@02                                          04S0318
         O     @15,@CF02432                                     04S0318
         CS    @02,@15,APUBBTST-3(APUBPTR)                      04S0318
         BNE   @GL00027                                         04S0318
*          TSBCHNLS = TSBCHNLS - 1; /* ONE LESS CANDIDATE            */
         LH    @02,TSBCHNLS                                     04S0319
         BCTR  @02,0                                            04S0319
         STH   @02,TSBCHNLS                                     04S0319
*          APUBPTR = APUBNXIO;      /* ADVANCE TO NXT ON I/O Q OR DON*/
         L     APUBPTR,APUBNXIO(,APUBPTR)                       04S0320
*        END;                       /* ELSE MSTR PREV ELIMINATED     */
*    ELSE                           /* APUBALF2 ^= 0 (NOT CANDIDATE) */
*      APUBPTR = APUBNXIO;          /* ADVANCE TO NXT ON I/O Q OR DON*/
         B     @RC00301                                         04S0322
@RF00301 L     APUBPTR,APUBNXIO(,APUBPTR)                       04S0322
*  END;                             /* DO UNTIL APUBPTR = 0 × NO CAND*/
@RC00301 DS    0H                                               04S0323
@DE00300 SLR   @02,@02                                          04S0323
         CR    APUBPTR,@02                                      04S0323
         BE    @DC00300                                         04S0323
         CH    @02,TSBCHNLS                                     04S0323
         BNE   @DL00300                                         04S0323
@DC00300 DS    0H                                               04S0324
*  IF TSBCHNLS = 0 THEN             /* IF OPT TEST ELIMINATED ALL    */
         LH    @02,TSBCHNLS                                     04S0324
         LTR   @02,@02                                          04S0324
         BZ    @RT00324                                         04S0324
*    ;                              /* REMAINING CANDIDATES THEN     */
*                                   /* NO ACTION REQUIRED            */
*  ELSE                             /* TSBCHNLS > 0                  */
*    DO;                            /* INVOKE THE INSTALLATION EXIT  */
*      ALLINST = BON;               /* INDICATE INST EXIT IN CONTROL */
         OI    ALLINST(ALLCWAPT),B'00100000'                    04S0327
*      CALL APCT2JHL(TSBCHNLS);     /* EXIT MAY ELIMINATE MORE CANDS */
         LA    @02,TSBCHNLS                                     04S0328
         ST    @02,@AL00001                                     04S0328
         L     @15,APCT2JHL(,APCTPTR)                           04S0328
         LA    @01,@AL00001                                     04S0328
         BALR  @14,@15                                          04S0328
*      ALLINST = BOFF;              /* INDICATE ALLOCATION IN CONTROL*/
         NI    ALLINST(ALLCWAPT),B'11011111'                    04S0329
*      IF TSBCHNLS >= 1 THEN        /* IF ONE OR MORE CANDIDATES RE- */
         LH    @02,TSBCHNLS                                     04S0330
         C     @02,@CF00042                                     04S0330
         BL    @RF00330                                         04S0330
*        DO;                        /* MAIN THEN MERGE EFFECTS OF THE*/
*                                   /* CURRENT OPTIONAL TEST INTO    */
*          SSBCHNLS = TSBCHNLS;     /* SSBCHNLS AND APUBALF2         */
         LR    SSBCHNLS,@02                                     04S0332
*          APUBPTR = APCTUBIS;      /* SCAN THE I/0 QUEUE FROM TOP   */
         L     APUBPTR,APCTUBIS(,APCTPTR)                       04S0333
*          DO UNTIL APUBPTR = 0;    /* DO ONCE FOR EACH APUB ON QUEUE*/
@DL00334 DS    0H                                               04S0335
*            IF APUBALF2 = 0 THEN   /* IF APUB IS CANDIDATE AND      */
         CLI   APUBALF2(APUBPTR),0                              04S0335
         BNE   @RF00335                                         04S0335
*              IF APUBBTST = BON ×  /* THIS OPTIONAL TEST ELIMINATED */
*                 APUBBIST = BON THEN /* OR INST EXIT ELIMINATED IT, */
         TM    APUBBTST(APUBPTR),B'11000000'                    04S0336
         BZ    @RF00336                                         04S0336
*                APUBBOPT = BON;    /* INDICATE OPTIONAL TEST FAILED */
         L     @02,APUBBOPT-2(,APUBPTR)                         04S0337
@GL00029 LR    @15,@02                                          04S0337
         O     @15,@CF02435                                     04S0337
         CS    @02,@15,APUBBOPT-2(APUBPTR)                      04S0337
         BNE   @GL00029                                         04S0337
*              ELSE                 /* APUB SURVIVED ELIMINATION     */
*                GOODAPUB = APUBPTR;/* SAVE ADDRESS OF SURVIVOR      */
         B     @RC00336                                         04S0338
@RF00336 ST    APUBPTR,GOODAPUB                                 04S0338
*            ELSE;                  /* EFFECTS OF OPT TEST NEED NOT  */
@RF00335 DS    0H                                               04S0340
*                                   /* BE MERGED WITH SSBCHNLS/BOPT  */
*            APUBPTR = APUBNXIO;    /* ADVANCE TO NXT ON I/O QUEUE   */
@RC00335 L     APUBPTR,APUBNXIO(,APUBPTR)                       04S0340
*          END;                     /* DO UNTIL APUBPTR = 0          */
@DE00334 LTR   APUBPTR,APUBPTR                                  04S0341
         BNZ   @DL00334                                         04S0341
*          APUBPTR = GOODAPUB;      /* POINT TO SURVIVOR IN CASE     */
         L     APUBPTR,GOODAPUB                                 04S0342
*                                   /* THERE IS JUST ONE SURVIVOR    */
*        END;                       /* DO IF TSBCHNLS >= 1           */
*    END;                           /* DO IF TSBCHNLS > 0            */
*END;                               /* END OF SEGMENT                */
*  GOTO ENDTEST;                    /* RETURN TO OPT TEST PROCESSOR  */
         B     ENDTEST                                          03S0346
*TSTSMLST: ;                        /* RTN TO FIND SMALLEST REMAINING*/
TSTSMLST DS    0H                                               03S0348
*                                   /* CANDIDATE APUB                */
*   /*OPTIONAL TEST ROUTINE. THE MODULE                         04S0348
*     DETERMINES THE SMALLEST SUBCHANNEL WHICH WILL SATISFY THE USER
*     REQUEST AND RETURNS THE POINTER TO THE APPROPRIATE APUB IN
*     APUBPTR. */                                               04S0348
*JHLDO:                                                         04S0348
*DO;                                /* INSURE ENTIRE SEGMENT INCLUDED*/
JHLDO    DS    0H                                               04S0349
*  APUBPTR = APCTUBIS;              /* POINT TO FIRST APUB SHARED    */
         L     APUBPTR,APCTUBIS(,APCTPTR)                       04S0349
*  SMLREGN = '7FFFFFFF'X;           /* INIT SMALLEST SUITABLE REGION */
         MVC   SMLREGN(4),@CF02318                              04S0350
*  DO WHILE APUBPTR ^= 0;           /* DO ONCE FOR EACH APUB         */
         B     @DE00351                                         04S0351
@DL00351 DS    0H                                               04S0352
*    IF APUBALF2  = 0 &             /* IF APUB IS CANDIDATE (STILL)  */
*       APUBRGN < SMLREGN THEN      /* AND REGION IS SMALLEST YET,   */
         CLI   APUBALF2(APUBPTR),0                              04S0352
         BNE   @RF00352                                         04S0352
         LH    @02,APUBRGN(,APUBPTR)                            04S0352
         C     @02,SMLREGN                                      04S0352
         BNL   @RF00352                                         04S0352
*        DO;                        /* SAVE                          */
*          SMLREGN = APUBRGN;       /* REGION SIZE AND               */
         ST    @02,SMLREGN                                      04S0354
*          SMLAPUB = APUBPTR;       /* POINTER TO APUB               */
         ST    APUBPTR,SMLAPUB                                  04S0355
*        END;                                                   04S0356
*    APUBPTR = APUBNXIO;            /* MOVE ON TO NEXT APUB OR DONE  */
@RF00352 L     APUBPTR,APUBNXIO(,APUBPTR)                       04S0357
*  END;                                                         04S0358
@DE00351 LTR   APUBPTR,APUBPTR                                  04S0358
         BNZ   @DL00351                                         04S0358
*  APUBPTR = SMLAPUB;               /* PROVIDE POINTER TO THE ONE    */
         L     APUBPTR,SMLAPUB                                  04S0359
*END JHLDO;                         /* END OF SEGMENT                */
*  GOTO ENDTEST;                    /* RETURN TO OPT TEST PROCESSOR  */
         B     ENDTEST                                          03S0361
*ENDTEST:                           /* ALL OPT TEST RTNS RETURN HERE */
*END;                               /* DO I = NOPTESTS ETC.          */
ENDTEST  BCTR  I,0                                              03S0362
         LTR   I,I                                              03S0362
         BP    @DL00219                                         03S0362
@DC00219 DS    0H                                               03S0363
*              ELSE                 /* THERE IS ONLY ONE SUITABLE SC */
*                DO;                /* FIND THE APUB WITH ALF2 = 0   */
         B     @RC00218                                         02S0363
@RF00218 DS    0H                                               02S0364
*                  APUBPTR = APCTUBIS;/* SEARCH THE SHARED APUB QUEUE*/
         L     APUBPTR,APCTUBIS(,APCTPTR)                       02S0364
*                  DO WHILE APUBPTR ^= 0 & APUBALF2 ^= 0; /* DO UNTIL*/
         B     @DE00365                                         02S0365
@DL00365 DS    0H                                               02S0366
*                    APUBPTR = APUBNXIO; /* OUT OF APUBS OR SUCCESS  */
         L     APUBPTR,APUBNXIO(,APUBPTR)                       02S0366
*                  END;             /* DO WHILE APUBPTR ^= 0 ETC.    */
@DE00365 LTR   APUBPTR,APUBPTR                                  02S0367
         BZ    @DC00365                                         02S0367
         CLI   APUBALF2(APUBPTR),0                              02S0367
         BNE   @DL00365                                         02S0367
@DC00365 DS    0H                                               02S0368
*                END;               /* ELSE CLAUSE                   */
*              APDSAPUB = APUBPTR;  /* ASSOCIATE APUB WITH APDS AND  */
@RC00218 ST    APUBPTR,APDSAPUB(,APDSPTR)                       02S0369
*              APUBAPDS = APDSPTR;  /* VICE VERSA                    */
         ST    APDSPTR,APUBAPDS(,APUBPTR)                       02S0370
*              APUBOWN = EXC;       /* INDICATE SUBCHAN EXC ALLOCATED*/
         L     @09,APUBOWN(,APUBPTR)                            02S0371
@GL00032 LR    @15,@09                                          02S0371
         O     @15,@CF02438                                     02S0371
         CS    @09,@15,APUBOWN(APUBPTR)                         02S0371
         BNE   @GL00032                                         02S0371
*            END;                                               02S0372
*          ELSE                     /* SSBCHNLS NOW ZERO             */
*            APDSIER = BON;         /* INST. EXIT REJECTED REQUEST   */
         B     @RC00212                                         02S0373
@RF00212 OI    APDSIER(APDSPTR),B'00000100'                     02S0373
*        END;                                                   02S0374
@RC00212 DS    0H                                               02S0375
*    END;                                                       02S0375
@RF00191 DS    0H                                               02S0376
*END EXCPRTDO;                                                  02S0376
@RF00151 DS    0H                                               02S0377
*    IF APDSARS = BON THEN          /* IF REQUEST WAS SATISFIED DURING*
@RC00110 TM    APDSARS(APDSPTR),B'00001000'                     01S0377
         BNO   @RF00377                                         01S0377
*      APDSSLPS = ALLC;             /* THIS PASS INDICATE IT FOR     */
         NI    APDSSLPS(APDSPTR),B'11111110'                    01S0378
*    ELSE                           /* RECOVERY AND ERROR PROCESSING */
*      APDSSLPS = UNAL;             /* OTHERWISE INDICATE NO SUCCESS */
         B     @RC00377                                         01S0379
@RF00377 OI    APDSSLPS(APDSPTR),B'00000001'                    01S0379
*    SSDDRPTR = SSAGNRBP;           /* ADVANCE TO NEXT REQUEST       */
@RC00377 L     SSDDRPTR,SSAGNRBP(,SSDDRPTR)                     01S0380
*  END;                                                         01S0381
@DE00108 SLR   @09,@09                                          01S0381
         CR    SSDDRPTR,@09                                     01S0381
         BNE   @DL00108                                         01S0381
*  IF NUMUNSAT > 0 THEN             /* IF THERE ARE UNSATISFIED      */
         CLR   NUMUNSAT,@09                                     01S0382
         BNH   @RF00382                                         01S0382
*    DO;                            /* REQUESTS, ENTER RECOVERY.     */
*    CALL APCVZJHF;                 /* JHF IS THE MAIN RECOVERY MODUL*/
         L     @15,APCTZJHF(,APCTPTR)                           01S0384
         BALR  @14,@15                                          01S0384
*  /* WHETHER OR NOT THE JOB IS FAILING ALLOCATION OR IS ABOUT TO
*     TRY AGAIN, THE RESOURCES PRESENTLY ALLOCATED TO IT ARE UN-
*     ALLOCATED TO ALLOW THE SATISFACTION OF THE JOB'S RESOURCE 01S0385
*     REQUESTS WITH THE RESOURCES MOST SUITABLE.                     */
*    CALL APCVZJHO;                 /* UNALLOCATE RESOURCES TEMP/PERM*/
         L     @15,APCTZJHO(,APCTPTR)                           01S0385
         BALR  @14,@15                                          01S0385
*    NUMUNSAT = NUMALREQ;           /* NO SATISFIED REQUESTS         */
         L     NUMUNSAT,NUMALREQ(,ALLCWAPT)                     01S0386
*    END;                           /* DO IF NUMUNSAT > 0            */
*  ELSE                             /* NO UNSATISFIED REQUESTS       */
*    SSOBRETN = SSAGRTOK;           /* INDICATE ALLOCATION SUCCESSFUL*/
         B     @RC00382                                         01S0388
@RF00382 L     @01,SSOBPTR(,ALLCWAPT)                           01S0388
         SLR   @00,@00                                          01S0388
         ST    @00,SSOBRETN(,@01)                               01S0388
*END;                               /* DOWHILE ALLFAIL=0 & NUMUNSAT>0*/
@RC00382 DS    0H                                               01S0389
@DE00106 TM    ALLFAIL(ALLCWAPT),B'10000000'                    01S0389
         BNZ   @DC00106                                         01S0389
         CL    NUMUNSAT,@CF00160                                01S0389
         BH    @DL00106                                         01S0389
@DC00106 DS    0H                                               01S0390
*RFY (APDSPTR,APUBPTR) UNRSTD;      /* REGS NOW AVAILABLE            */
*   /* THE FOLLOWING GEN-ENDGEN IS TO AVOID A PLS BUG WHICH CAUSES
*      SOME OF THE VARIABLES MENTIONED HERE TO BE ASSIGNED TO THE
*      SAME REGISTER AT THE SAME TIME. */                       01S0391
*GEN REFS(GOODAPUB,SMLAPUB,LREGAPUB,SMLREGN,CANDAPUB,           01S0391
*         LRGSTREG,PTRSAVE,THEAPUB); /*                         01S0391
         SPACE 1
*RETURN;                                                        01S0392
@EL00001 L     @13,4(,@13)                                      01S0392
@EF00001 L     @00,@SIZDATD                                     01S0392
         LR    @01,@06                                          01S0392
         IGTYFSV  R,LV=(0),A=(1)
@ER00001 LM    @14,@12,12(@13)                                  01S0392
         BR    @14                                              01S0392
*                                   /*IGTXEPLG*/                01S0393
*    /* SYSTEM DECLARES */                                      01S0393
*                                                               01S0393
*                                                               01S0393
*  DECLARE /* COMMON VARIABLES */                               01S0393
*    I256C CHAR(256) BASED,                                     01S0393
*    I031F FIXED(31) BASED,                                     01S0393
*    I031P PTR(31)   BASED,                                     01S0393
*    I015F FIXED(15) BASED,                                     01S0393
*    I015P PTR(15)   BASED,                                     01S0393
*    I008P PTR(8)    BASED,                                     01S0393
*    I001C CHAR(1)   BASED;                                     01S0393
*                                                               01S0394
*                                                               01S0394
*  /* MODULE PATCH AREA */                                      01S0394
*  DCL APPATCH CHAR(*) INT STATIC LOCAL GEND;                   01S0394
*  GENERATE DATA DEFS(APPATCH);  /* GENERATE PATCH              01S0395
*    /* GENERAL REGISTER DECLARES */                            01S0396
*  DCL                                                          01S0396
*    R0F FIXED(31) REG(0),                                      01S0396
*    R0P   PTR(24) REG(0),                                      01S0396
*    R0RSTD PTR(31) REG(0),                                     01S0396
*    R1F FIXED(31) REG(1),                                      01S0396
*    R1P   PTR(24) REG(1),                                      01S0396
*    R1RSTD PTR(31) REG(1),                                     01S0396
*    R2F FIXED(31) REG(2),                                      01S0396
*    R2P   PTR(24) REG(2),                                      01S0396
*    R2RSTD PTR(31) REG(2),                                     01S0396
*    R3F FIXED(31) REG(3),                                      01S0396
*    R3P   PTR(24) REG(3),                                      01S0396
*    R3RSTD PTR(31) REG(3),                                     01S0396
*    R4F FIXED(31) REG(4),                                      01S0396
*    R4P   PTR(24) REG(4),                                      01S0396
*    R4RSTD PTR(31) REG(4),                                     01S0396
*    R5F FIXED(31) REG(5),                                      01S0396
*    R5P   PTR(24) REG(5),                                      01S0396
*    R5RSTD PTR(31) REG(5),                                     01S0396
*    R6F FIXED(31) REG(6),                                      01S0396
*    R6P   PTR(24) REG(6),                                      01S0396
*    R6RSTD PTR(31) REG(6),                                     01S0396
*    R7F FIXED(31) REG(7),                                      01S0396
*    R7P   PTR(24) REG(7),                                      01S0396
*    R7RSTD PTR(31) REG(7),                                     01S0396
*    R8F FIXED(31) REG(8),                                      01S0396
*    R8P   PTR(24) REG(8),                                      01S0396
*    R8RSTD PTR(31) REG(8),                                     01S0396
*    R9F FIXED(31) REG(9),                                      01S0396
*    R9P   PTR(24) REG(9),                                      01S0396
*    R9RSTD PTR(31) REG(9),                                     01S0396
*    R10F FIXED(31) REG(10),                                    01S0396
*    R10P   PTR(24) REG(10),                                    01S0396
*    R10RSTD PTR(31) REG(10),                                   01S0396
*    R11F FIXED(31) REG(11),                                    01S0396
*    R11P   PTR(24) REG(11),                                    01S0396
*    R11RSTD PTR(31) REG(11),                                   01S0396
*    R12F FIXED(31) REG(12),                                    01S0396
*    R12P   PTR(24) REG(12),                                    01S0396
*    R12RSTD PTR(31) REG(12),                                   01S0396
*    R13F FIXED(31) REG(13),                                    01S0396
*    R13P   PTR(24) REG(13),                                    01S0396
*    R13RSTD PTR(31) REG(13),                                   01S0396
*    R14F FIXED(31) REG(14),                                    01S0396
*    R14P   PTR(24) REG(14),                                    01S0396
*    R14RSTD PTR(31) REG(14),                                   01S0396
*    R15F FIXED(31) REG(15),                                    01S0396
*    R15P   PTR(24) REG(15),                                    01S0396
*    R15RSTD PTR(31) REG(15),                                   01S0396
*    /* VPSS CONTROL BLOCK POINTER DECLARES */                  01S0396
*    APSMPTR PTR(24) REG(01), /* STORAGE MANAGEMENT BLOCK (SUGGESTED PO
*NTER) */                                                       01S0396
*    APSCPTR PTR(24) REG(01), /* STORAGE MANAGEMENT CONTROL WORD (SUGGE
*TED POINTER) */                                                01S0396
*    APINPTR PTR(24) REG(01), /* USER'S INPUT PARAMETER LIST (SUGGESTED
*POINTER) */                                                    01S0396
*/*                       */                                    01S0396
*    APDATA  PTR(24) REG(06), /* ADDRESS OF DYNAMIC DATA WORKAREA (DATA
*EG) */                                                         01S0396
*    APCODE  PTR(24) REG(07), /* PROGRAM CODE BASE REGISTER (CODEREG) *
*    APDEBPTR PTR(24) REG(08), /* VPSS DEB (SUGGESTED POINTER) */
*    APNPPTR PTR(24) REG(08), /* SUBSYSTEM INITIALIZATION WORKAREA BLOC
* (ONLY USED BY SUBSYSTEM INITIALIZATION) */                    01S0396
*    APRLPTR PTR(24) REG(08), /* VPSS ACB REQUEST LIST (SUGGESTED POINT
*R) */                                                          01S0396
*    APCIPTR PTR(24) REG(08), /* 3838 CONTROL TABLE (SUGGESTED POINTER)
**/  APCWPTR PTR(24) REG(08), /* CALL INTERFACE WORKAREA (SUGGESTED POI
*TER) */                                                        01S0396
*    APERPTR PTR(24) REG(08), /* ERP/IO APPENDAGE WORKAREA (SUGGESTED P
*INTER) */                                                      01S0396
*    APACBPTR PTR(24) REG(09), /* VPSS ACB (SUGGESTED POINTER) */
*    APCQPTR PTR(24) REG(09), /* COMMAND QUEUE ELEMENT (SUGGESTED POINT
*R) */                                                          01S0396
*    APOTPTR PTR(24) REG(09), /* OPTION TABLE (SUGGESTED POINTER) */
*    APIOPTR PTR(24) REG(10), /* I/O ELEMENT (SUGGESTED POINTER) */
*    APEXLPTR PTR(24) REG(10), /* VPSS EXLST (SUGGESTED POINTER) */
*    APUBPTR PTR(24) REG(10), /* UNIT BLOCK (SUGGESTED POINTER) */
*    APAXPTR PTR(24) REG(10), /* VPSS ACB EXTENSION (SUGGESTED POINTER)
**/  APCPPTR PTR(24) REG(10), /* VPSS CALL PROCESSING INDICATORS (SUGGE
*TED POINTER) */                                                01S0396
*    APOCPTR PTR(24) REG(10), /* VPSS OPEN/CLOSE SUBSYSTEM WORKAREA (RE
*UIRED POINTER) */                                              01S0396
*    APATPTR PTR(24) REG(11), /* VPSS ACB TABLE (SUGGESTED POINTER) */
*    APLBPTR PTR(24) REG(11), /* LABEL RESOLUTION TABLE (SUGGESTED POIN
*ER) */                                                         01S0396
*    APUTPTR PTR(24) REG(11), /* USER TABLE (SUGGESTED POINTER) */
*    APDSPTR PTR(24) REG(11), /* VPSS DATASET ENTRY (SUGGESTED POINTER)
**/  APXLPTR PTR(24) REG(11), /* TRANSLATION TABLE (SUGGESTED POINTER)
*/   APDXPTR PTR(24) REG(11), /* VPSS DEB EXTENSION (SUGGESTED POINTER)
**/  APCTPTR PTR(24) REG(12) RSTD, /* CONTROL TABLE (REQUIRED POINTER)
*/   APSVPTR PTR(24) REG(13) RSTD, /* OS/VPSS SAVEAREA/WORKAREA (REQUIR
*D POINTER) */                                                  01S0396
*    APRETURN PTR(24) REG(14), /* RETURN ADDRESS FOR SUBROUTINE LINKAGE
**/  APENTRY PTR(24) REG(15), /* SUBROUTINE ENTRY POINT LINKAGE */
*    APRCODE PTR(24) REG(15); /* CONTAINS SUBROUTINE RETURN CODE */
*    /* USER REGISTER DECLARES */                               01S0397
*        DCL   ALLCWAPT PTR(24)                                 01S0397
*                  REG(04) RSTD;  /* POINTR TO SS ALLOCATION WORKAREA*/
*END IGTJHC                                                     01S0398
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.      *
*/*%INCLUDE SYSLIB  (IGTXAPAW)                                        *
*/*%INCLUDE SYSLIB  (IGTXSYSI)                                        *
*/*%INCLUDE SYSLIB  (IGTXSYSI)                                        *
*/*%INCLUDE SYSLIB  (IGTXSYSI)                                        *
*/*%INCLUDE SYSLIB  (IGTXSYSI)                                        *
*/*%INCLUDE SYSLIB  (IGTXSYSI)                                        *
*/*%INCLUDE SYSLIB  (IGTXSYSI)                                        *
*/*%INCLUDE SYSLIB  (IGTJHM  )                                        *
*/*%INCLUDE SYSLIB  (IGTXAPCT)                                        *
*/*%INCLUDE SYSLIB  (IGTXAPDS)                                        *
*/*%INCLUDE SYSLIB  (IGTXAPUB)                                        *
*/*%INCLUDE SYSLIB  (IGTXAPSV)                                        *
*/*%INCLUDE SYSLIB  (IGTXAPCV)                                        *
*/*%INCLUDE SYSLIB  (CVT     )                                        *
*/*%INCLUDE SYSLIB  (IEFJSSOB)                                        *
*/*%INCLUDE SYSLIB  (IEFSSARB)                                        *
*/*%INCLUDE SYSLIB  (IEFUCBOB)                                        *
*/*%INCLUDE SYSLIB  (IHAASCB )                                        *
*/*%INCLUDE SYSLIB  (IHAPSA  )                                        *
*/*%INCLUDE SYSUT5  (SHRPORT )                                        *
*/*%INCLUDE SYSUT5  (EXCPORT )                                        *
*/*%INCLUDE SYSUT5  (IGTJHI  )                                        *
*/*%INCLUDE SYSUT5  (PROC2JHC)                                        *
*/*%INCLUDE SYSUT5  (IGTJHL  )                                        *
*/*%INCLUDE SYSUT5  (TSTMPAFN)                                        *
*/*%INCLUDE SYSUT5  (TSTSAM38)                                        *
*/*%INCLUDE SYSUT5  (TSTSMLST)                                        *
*;                                                              01S0398
         B     @EL00001                                         01S0398
@DATA    DS    0H
@DATD    DSECT
         DS    0F
@SA00001 DS    20F
@AL00001 DS    1A
IGTJHC   CSECT
         DS    0F
@CF00160 DC    F'0'
@CF00042 DC    F'1'
@CF02318 DC    XL4'7FFFFFFF'
@CF02431 DC    XL4'0000FFFF'
@CF00077 DC    XL4'8000'
@CF00079 DC    XL4'4000'
@CF02410 DC    BL4'00000000000000000001000000000000'
@CF02414 DC    BL4'00000000000000000100000000000000'
@CF02417 DC    BL4'00000000000000001000000000000000'
@CF02420 DC    BL4'11111111111111110111111111111111'
@CF02428 DC    BL4'11111111111111111111111101111111'
@CF02432 DC    BL4'00000000000000000000000010000000'
@CF02435 DC    BL4'00000000000000000010000000000000'
@CF02438 DC    BL4'01000000000000000000000000000000'
@DATD    DSECT
         DS    0D
PTRSAVE  DS    A
THEAPUB  DS    A
SMLAPUB  DS    A
SMLREGN  DS    F
GOODAPUB DS    A
CANDAPUB DS    A
LRGSTREG DS    H
LREGAPUB DS    H
TSBCHNLS DS    H
SEARCH   DS    BL1
         DS    CL1
JBSTPAFN DS    BL2
IGTJHC   CSECT
         DS    0F
@SIZDATD DC    AL1(0)
         DC    AL3(@ENDDATD-@DATD)
         DS    0D
@CB02423 DC    B'111111111111111101111111111111110000000000000000010000C
               0000000000'
NOAFFIN  DC    X'FFFF'
         DS    CL2
OPTTESTS DC    AL4(TSTSMLST)
         DC    AL4(TSTSAM38)
         DC    AL4(TSTMPAFN)
IGTJHC   CSECT
         IGTXZAP ,                 GENERATE PATCH AREA
@DATD    DSECT
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA
@ENDDATD EQU   *
IGTJHC   CSECT
@00      EQU   00                      EQUATES FOR REGISTERS 0-15
@01      EQU   01
@02      EQU   02
@03      EQU   03
@04      EQU   04
@05      EQU   05
@06      EQU   06
@07      EQU   07
@08      EQU   08
@09      EQU   09
@10      EQU   10
@11      EQU   11
@12      EQU   12
@13      EQU   13
@14      EQU   14
@15      EQU   15
I        EQU   @09
APUBADDR EQU   @02
SSBCHNLS EQU   @03
NUMUNSAT EQU   @05
SSDDRPTR EQU   @08
APDATA   EQU   @06
APCODE   EQU   @07
ALLCWAPT EQU   @04
APCTPTR  EQU   @12
APSVPTR  EQU   @13
APDSPTR  EQU   @11
APUBPTR  EQU   @10
R15F     EQU   @15
R0F      EQU   @00
APACBPTR EQU   @09
APATPTR  EQU   @11
APAXPTR  EQU   @10
APCIPTR  EQU   @08
APCPPTR  EQU   @10
APCQPTR  EQU   @09
APCWPTR  EQU   @08
APDEBPTR EQU   @08
APDXPTR  EQU   @11
APENTRY  EQU   @15
APERPTR  EQU   @08
APEXLPTR EQU   @10
APINPTR  EQU   @01
APIOPTR  EQU   @10
APLBPTR  EQU   @11
APNPPTR  EQU   @08
APOCPTR  EQU   @10
APOTPTR  EQU   @09
APRCODE  EQU   @15
APRETURN EQU   @14
APRLPTR  EQU   @08
APSCPTR  EQU   @01
APSMPTR  EQU   @01
APUTPTR  EQU   @11
APXLPTR  EQU   @11
R0P      EQU   @00
R0RSTD   EQU   @00
R1F      EQU   @01
R1P      EQU   @01
R1RSTD   EQU   @01
R10F     EQU   @10
R10P     EQU   @10
R10RSTD  EQU   @10
R11F     EQU   @11
R11P     EQU   @11
R11RSTD  EQU   @11
R12F     EQU   @12
R12P     EQU   @12
R12RSTD  EQU   @12
R13F     EQU   @13
R13P     EQU   @13
R13RSTD  EQU   @13
R14F     EQU   @14
R14P     EQU   @14
R14RSTD  EQU   @14
R15P     EQU   @15
R15RSTD  EQU   @15
R2F      EQU   @02
R2P      EQU   @02
R2RSTD   EQU   @02
R3F      EQU   @03
R3P      EQU   @03
R3RSTD   EQU   @03
R4F      EQU   @04
R4P      EQU   @04
R4RSTD   EQU   @04
R5F      EQU   @05
R5P      EQU   @05
R5RSTD   EQU   @05
R6F      EQU   @06
R6P      EQU   @06
R6RSTD   EQU   @06
R7F      EQU   @07
R7P      EQU   @07
R7RSTD   EQU   @07
R8F      EQU   @08
R8P      EQU   @08
R8RSTD   EQU   @08
R9F      EQU   @09
R9P      EQU   @09
R9RSTD   EQU   @09
PSA      EQU   0
FLCRNPSW EQU   PSA
FLCROPSW EQU   PSA+8
FLCICCW2 EQU   PSA+16
FLCCVT   EQU   FLCICCW2
PSAEEPSW EQU   PSA+132
PSAESPSW EQU   PSA+136
FLCSVILC EQU   PSAESPSW+1
PSAEPPSW EQU   PSA+140
FLCPIILC EQU   PSAEPPSW+1
FLCPICOD EQU   PSAEPPSW+2
PSAPICOD EQU   FLCPICOD+1
FLCTEA   EQU   PSAEPPSW+4
FLCPER   EQU   PSA+152
FLCMCLA  EQU   PSA+168
FLCIOEL  EQU   FLCMCLA+4
FLCIOA   EQU   FLCMCLA+16
FLCFSA   EQU   FLCMCLA+80
PSASUPER EQU   PSA+552
PSASUP1  EQU   PSASUPER
PSASUP2  EQU   PSASUPER+1
PSASUP3  EQU   PSASUPER+2
PSASUP4  EQU   PSASUPER+3
PSACLHT  EQU   PSA+640
PSALKSA  EQU   PSA+696
PSAHLHI  EQU   PSA+760
PSADSSFL EQU   PSA+836
PSADSSF1 EQU   PSADSSFL
PSADSSF3 EQU   PSADSSFL+2
PSADSSF4 EQU   PSADSSFL+3
PSARSVT  EQU   PSA+896
SSARBPTR EQU   0
ASCBPTR  EQU   0
OPTTEST  EQU   0
UCBPTR   EQU   0
APAW     EQU   0
SSOBPTR  EQU   APAW
FIRSTARB EQU   APAW+4
ALLSTAT  EQU   APAW+8
ALLSTAT0 EQU   ALLSTAT
ALLFAIL  EQU   ALLSTAT0
ALLSTAT1 EQU   ALLSTAT+1
ALLINST  EQU   ALLSTAT1
ALLSTAT2 EQU   ALLSTAT+2
ALLRES   EQU   ALLSTAT2
ALLSTAT3 EQU   ALLSTAT+3
ALLRSRCE EQU   APAW+12
NUMALREQ EQU   APAW+32
EXITINFO EQU   APAW+48
EXITINF0 EQU   EXITINFO
EXITINF1 EQU   EXITINFO+1
APCT     EQU   0
APCTENQM EQU   APCT+12
APCTSMIN EQU   APCT+32
APCTSMAD EQU   APCT+36
APCTZ@@@ EQU   APCT+40
APCTU@@@ EQU   APCT+440
APCTBR14 EQU   APCT+840
APCTUBIS EQU   APCT+852
APCTAPDS EQU   APCT+860
APCTERRS EQU   APCT+876
@NM00019 EQU   APCT+936
APCTSTAT EQU   @NM00019
APCTPRSW EQU   @NM00019+1
APCTAPCQ EQU   APCT+944
APCTCQAQ EQU   APCT+952
APCTZ@@1 EQU   APCT+1120
APDS     EQU   0
APDSAPDS EQU   APDS+4
APDSTD   EQU   APDS+16
APDSAPUB EQU   APDS+48
APDSASCB EQU   APDS+52
APDSREG  EQU   APDS+56
APDSFLGS EQU   APDS+64
APDSFLG0 EQU   APDSFLGS
APDSOWN  EQU   APDSFLG0
APDSARS  EQU   APDSFLG0
APDSIER  EQU   APDSFLG0
APDSSLPS EQU   APDSFLG0
APDSFLG1 EQU   APDSFLGS+1
APUB     EQU   0
APUBAPUB EQU   APUB+4
APUBMSTR EQU   APUB+8
APUBNXIO EQU   APUB+12
APUBUCB  EQU   APUB+28
APUBAPDS EQU   APUB+32
APUBRGN  EQU   APUB+48
APUBERRS EQU   APUB+52
APUBALFG EQU   APUB+80
APUBALF0 EQU   APUBALFG
APUBOWN  EQU   APUBALF0
APUBALF1 EQU   APUBALFG+1
APUBALF2 EQU   APUBALFG+2
APUBBYT1 EQU   APUBALF2
APUBBREQ EQU   APUBALF2
APUBBOPT EQU   APUBALF2
APUBBIER EQU   APUBALF2
APUBALF3 EQU   APUBALFG+3
APUBBTST EQU   APUBALF3
APUBBIST EQU   APUBALF3
APUBSTAT EQU   APUB+84
APUBIOFG EQU   APUB+88
APUBIOF0 EQU   APUBIOFG
APUBIOF1 EQU   APUBIOFG+1
APUBIOF2 EQU   APUBIOFG+2
APUBIOF3 EQU   APUBIOFG+3
APUBDCB  EQU   APUB+96
APSV     EQU   0
APSVREGS EQU   APSV+12
APCVZJHO EQU   0
APCVZJHF EQU   0
CVTMAP   EQU   0
CVTDAR   EQU   CVTMAP+72
CVTFLGS1 EQU   CVTDAR
CVTDCB   EQU   CVTMAP+116
CVTIOQET EQU   CVTMAP+120
CVTIERLC EQU   CVTMAP+144
CVTHEAD  EQU   CVTMAP+160
CVTSV76C EQU   CVTHEAD
CVTOPTA  EQU   CVTMAP+182
CVTOPTB  EQU   CVTMAP+183
CVTGTF   EQU   CVTMAP+236
CVTGTFST EQU   CVTGTF
CVTGTFS  EQU   CVTGTFST
CVTSTATE EQU   CVTGTFST
CVTTMODE EQU   CVTGTFST
CVTFORM  EQU   CVTGTFST
CVTAQAVT EQU   CVTMAP+240
CVTTCMFG EQU   CVTAQAVT
CVTVOLM2 EQU   CVTMAP+244
CVTTATA  EQU   CVTVOLM2
CVTTSKS  EQU   CVTTATA
CVTVOLF2 EQU   CVTTSKS
CVTTAT   EQU   CVTTATA+1
CVTATER  EQU   CVTMAP+248
CVTEXT1  EQU   CVTMAP+252
CVTPURG  EQU   CVTMAP+260
CVTQMSG  EQU   CVTMAP+268
CVTDMSR  EQU   CVTMAP+272
CVTRSV37 EQU   CVTDMSR
CVTDMSRF EQU   CVTRSV37
CVTERPV  EQU   CVTMAP+316
CVTINTLA EQU   CVTMAP+320
CVTAPF   EQU   CVTMAP+324
CVTEXT2  EQU   CVTMAP+328
CVTHJES  EQU   CVTMAP+332
CVTPGSIA EQU   CVTMAP+348
CVTA1F1  EQU   CVTMAP+356
CVTSYSK  EQU   CVTMAP+357
CVTVOLM1 EQU   CVTMAP+380
CVTVOLF1 EQU   CVTVOLM1
CVTATMCT EQU   CVTMAP+388
CVTXTNT1 EQU   0
CVTXTNT2 EQU   0
CVTDSSV  EQU   CVTXTNT2
CVTFLGBT EQU   CVTXTNT2+5
CVTQID   EQU   CVTXTNT2+24
CVTRV400 EQU   CVTXTNT2+52
CVTRV409 EQU   CVTXTNT2+53
CVTATCVT EQU   CVTXTNT2+64
CVTRV429 EQU   CVTXTNT2+84
CVTRV438 EQU   CVTXTNT2+85
CVTRV457 EQU   CVTXTNT2+112
CVTRV466 EQU   CVTXTNT2+113
CVTFIX   EQU   0
CVTRELNO EQU   CVTFIX+252
SSOB     EQU   0
SSOBRETN EQU   SSOB+12
SSOBINDV EQU   SSOB+16
SSAG     EQU   0
SSAGEHDR EQU   SSAG
SSAGFLGS EQU   SSAGEHDR+2
SSAGGMGP EQU   SSAGEHDR+24
SSAGARBK EQU   0
SSAGNRBP EQU   SSAGARBK+12
SSAGSSCM EQU   SSAGARBK+52
SSAGDMGP EQU   SSAGARBK+56
SSAGDMBK EQU   0
SSAGGMBK EQU   0
UCB      EQU   0
UCBOB    EQU   0
UCBJBNR  EQU   UCBOB
UCBFL5   EQU   UCBOB+1
UCBAF    EQU   UCBFL5
UCBSTAT  EQU   UCBOB+3
UCBCHAN  EQU   UCBOB+4
UCBSFLS  EQU   UCBOB+6
UCBFLA   EQU   UCBSFLS
UCBFL1   EQU   UCBFLA
UCBBSY   EQU   UCBFL1
UCBNRY   EQU   UCBFL1
UCBPST   EQU   UCBFL1
UCBCUB   EQU   UCBFL1
UCBFLB   EQU   UCBSFLS+1
UCBCHM   EQU   UCBOB+8
UCBCHM1  EQU   UCBCHM
UCBPTH0  EQU   UCBCHM1
UCBPPA   EQU   UCBPTH0
UCBSPA   EQU   UCBPTH0
UCBPTH1  EQU   UCBCHM1
UCBPPB   EQU   UCBPTH1
UCBSPB   EQU   UCBPTH1
UCBWGT   EQU   UCBOB+12
UCBTYP   EQU   UCBOB+16
UCBTBYT1 EQU   UCBTYP
UCB1FEA5 EQU   UCBTBYT1
UCB1FEA6 EQU   UCBTBYT1
UCBTBYT2 EQU   UCBTYP+1
UCB2OPT2 EQU   UCBTBYT2
UCBDUDN1 EQU   UCB2OPT2
UCB2OPT3 EQU   UCBTBYT2
UCBDUDN2 EQU   UCB2OPT3
UCB2OPT4 EQU   UCBTBYT2
UCBRWTAU EQU   UCB2OPT4
UCB2OPT6 EQU   UCBTBYT2
UCB2OPT7 EQU   UCBTBYT2
UCBTBYT3 EQU   UCBTYP+2
UCBDVCLS EQU   UCBTBYT3
UCBTBYT4 EQU   UCBTYP+3
UCBEXTPT EQU   UCBOB+20
UCBFLC   EQU   UCBEXTPT
UCBDEV   EQU   UCBOB+24
UCBCMEXT EQU   0
UCBATI   EQU   UCBCMEXT+3
@NM00080 EQU   UCBATI
UCBFLP1  EQU   UCBCMEXT+5
UCBMT    EQU   0
UCBOCR   EQU   0
UCB3540X EQU   0
UCBDKBYT EQU   UCB3540X+6
UCB3800X EQU   0
UCBOPTNS EQU   UCB3800X
UCBACTIV EQU   UCB3800X+3
UCBMDRBF EQU   UCB3800X+36
UCBUCS   EQU   0
UCBUCSOP EQU   UCBUCS+4
UCBFCBOP EQU   UCBUCS+5
ASCB     EQU   0
ASCBSUPC EQU   ASCB+16
ASCBFW1  EQU   ASCB+100
ASCBAFFN EQU   ASCBFW1
ASCBRCTF EQU   ASCBFW1+2
ASCBFLG1 EQU   ASCBFW1+3
ASCBDSP1 EQU   ASCB+114
ASCBFLG2 EQU   ASCB+115
ASCBLKGP EQU   ASCB+128
ASCBSRQ  EQU   ASCB+180
ASCBSRQ1 EQU   ASCBSRQ
ASCBSRQ2 EQU   ASCBSRQ+1
ASCBSRQ3 EQU   ASCBSRQ+2
ASCBSRQ4 EQU   ASCBSRQ+3
APCVZDAL EQU   0
APCVZDAP EQU   0
APCVZDBK EQU   0
APCVZDDA EQU   0
APCVZDDQ EQU   0
APCVZDEQ EQU   0
APCVZDID EQU   0
APCVZDIO EQU   0
APCVZDIP EQU   0
APCVZDMD EQU   0
APCVZDMM EQU   0
APCVZDQR EQU   0
APCVZDRI EQU   0
APCVZDUA EQU   0
APCVZDUL EQU   0
APCVZDWI EQU   0
APCVZDWT EQU   0
APCVZDX1 EQU   0
APCVZDX2 EQU   0
APCVZDX3 EQU   0
APCVZDX4 EQU   0
APCVZD10 EQU   0
APCVZD20 EQU   0
APCVZD4E EQU   0
APCVZD40 EQU   0
APCVZD41 EQU   0
APCVZD42 EQU   0
APCVZD43 EQU   0
APCVZD44 EQU   0
APCVZD45 EQU   0
APCVZD46 EQU   0
APCVZD47 EQU   0
APCVZD48 EQU   0
APCVZD49 EQU   0
APCVZD60 EQU   0
APCVZD80 EQU   0
APCVZD81 EQU   0
APCVZD82 EQU   0
APCVZD83 EQU   0
APCVZJAA EQU   0
APCVZJAD EQU   0
APCVZJAG EQU   0
APCVZJAJ EQU   0
APCVZJAM EQU   0
APCVZJAP EQU   0
APCVZJAX EQU   0
APCVZJAY EQU   0
APCVZJBA EQU   0
APCVZJBD EQU   0
APCVZJBG EQU   0
APCVZJBJ EQU   0
APCVZJBM EQU   0
APCVZJDA EQU   0
APCVZJDD EQU   0
APCVZJDG EQU   0
APCVZJDJ EQU   0
APCVZJDM EQU   0
APCVZJHC EQU   0
APCVZJHE EQU   0
APCVZJHQ EQU   0
APCVZJHR EQU   0
APCVZJHT EQU   0
APCVZJHW EQU   0
APCVZJH0 EQU   0
APCVZJH6 EQU   0
APCVZJI0 EQU   0
APCVZJI3 EQU   0
APCVZJJ0 EQU   0
APCVZKAA EQU   0
APCVZKBA EQU   0
APCVZKBB EQU   0
APCVZKBC EQU   0
APCVZKBD EQU   0
APCVZKBE EQU   0
APCVZKBF EQU   0
APCVZKCA EQU   0
APCVZKDA EQU   0
APCVZKGA EQU   0
APCVZKGB EQU   0
APCVZKGC EQU   0
APCVZKGD EQU   0
APCVZLCA EQU   0
APCVZLCB EQU   0
APCVZMBA EQU   0
APCVZMBD EQU   0
APCVZMBG EQU   0
APCVZMBH EQU   0
APCVZMBK EQU   0
APCVZMBM EQU   0
APCVZMIB EQU   0
APCVZMIC EQU   0
APCVZMIF EQU   0
APCVZMJB EQU   0
APCVZMJC EQU   0
APCVZMJH EQU   0
APCVZMJI EQU   0
APCVZMMA EQU   0
APCVZUAA EQU   0
APCVZUAB EQU   0
APCVZUAC EQU   0
APCVZUAD EQU   0
APCVZUAE EQU   0
APCVZUAF EQU   0
APCVZUAG EQU   0
APCVZUBB EQU   0
APCVZUFA EQU   0
APCVZUHA EQU   0
APCVZUHB EQU   0
APCVZUJA EQU   0
APCVZUKA EQU   0
APCV1CMD EQU   0
APCV1JAA EQU   0
APCV1JBJ EQU   0
APCV1JHC EQU   0
APCV1JHL EQU   0
APCV1JHT EQU   0
APCV1MAB EQU   0
APCV1MBD EQU   0
APCV2JHC EQU   0
APCV2JHL EQU   0
APCV2MBD EQU   0
I001C    EQU   0
I008P    EQU   0
I015F    EQU   0
I015P    EQU   0
I031F    EQU   0
I031P    EQU   0
I256C    EQU   0
UCBBGN   EQU   0
CVTPTR   EQU   FLCCVT
APCTZ    EQU   APCTZ@@@
APCTZUAA EQU   APCTZ
APCTZUAB EQU   APCTZ+4
APCTZUAC EQU   APCTZ+8
APCTZUAD EQU   APCTZ+12
APCTZUAE EQU   APCTZ+16
APCTZUBB EQU   APCTZ+24
APCTZD10 EQU   APCTZ+28
APCTZD20 EQU   APCTZ+32
APCTZD40 EQU   APCTZ+36
APCTZD41 EQU   APCTZ+40
APCTZD42 EQU   APCTZ+44
APCTZD43 EQU   APCTZ+48
APCTZD44 EQU   APCTZ+52
APCTZD45 EQU   APCTZ+56
APCTZD46 EQU   APCTZ+60
APCTZD47 EQU   APCTZ+64
APCTZD48 EQU   APCTZ+68
APCTZD49 EQU   APCTZ+72
APCTZD60 EQU   APCTZ+76
APCTZD80 EQU   APCTZ+80
APCTZD4E EQU   APCTZ+84
APCTZMBA EQU   APCTZ+88
APCTZMBD EQU   APCTZ+92
APCTZMBG EQU   APCTZ+96
APCTZDX1 EQU   APCTZ+104
APCTZDX2 EQU   APCTZ+108
APCTZDX3 EQU   APCTZ+112
APCTZDX4 EQU   APCTZ+116
APCTZMBH EQU   APCTZ+120
APCTZMBK EQU   APCTZ+124
APCTZMBM EQU   APCTZ+128
APCTZMJB EQU   APCTZ+132
APCTZMJC EQU   APCTZ+136
APCTZMJH EQU   APCTZ+140
APCTZMMA EQU   APCTZ+144
APCTZDMD EQU   APCTZ+148
APCTZD81 EQU   APCTZ+152
APCTZDID EQU   APCTZ+156
APCTZDRI EQU   APCTZ+160
APCTZMJI EQU   APCTZ+164
APCTZDWT EQU   APCTZ+168
APCTZDMM EQU   APCTZ+172
APCTZDAL EQU   APCTZ+176
APCTZDBK EQU   APCTZ+180
APCTZDIP EQU   APCTZ+184
APCTZDDA EQU   APCTZ+188
APCTZDUL EQU   APCTZ+192
APCTZDEQ EQU   APCTZ+196
APCTZDDQ EQU   APCTZ+200
APCTZDUA EQU   APCTZ+204
APCTZUAF EQU   APCTZ+208
APCTZUAG EQU   APCTZ+212
APCTZDIO EQU   APCTZ+216
APCTZUHA EQU   APCTZ+220
APCTZUHB EQU   APCTZ+224
APCTZJAA EQU   APCTZ+232
APCTZJAD EQU   APCTZ+236
APCTZJAG EQU   APCTZ+240
APCTZJAJ EQU   APCTZ+244
APCTZJAM EQU   APCTZ+248
APCTZJAP EQU   APCTZ+252
APCTZJAY EQU   APCTZ+256
APCTZUFA EQU   APCTZ+260
APCTZUJA EQU   APCTZ+264
APCTZDAP EQU   APCTZ+268
APCTZKAA EQU   APCTZ+272
APCTZD82 EQU   APCTZ+276
APCTZMIB EQU   APCTZ+280
APCTZMIC EQU   APCTZ+284
APCTZD83 EQU   APCTZ+288
APCTZMIF EQU   APCTZ+296
APCTZJH0 EQU   APCTZ+300
APCTZJI0 EQU   APCTZ+304
APCTZJI3 EQU   APCTZ+308
APCTZJJ0 EQU   APCTZ+312
APCTZJBA EQU   APCTZ+316
APCTZJBD EQU   APCTZ+320
APCTZJBG EQU   APCTZ+324
APCTZJBJ EQU   APCTZ+328
APCTZJBM EQU   APCTZ+332
APCTZKCA EQU   APCTZ+340
APCTZKDA EQU   APCTZ+344
APCTZJDA EQU   APCTZ+356
APCTZJDJ EQU   APCTZ+360
APCTZJH6 EQU   APCTZ+364
APCTZJHO EQU   APCTZ+368
APCTZJHF EQU   APCTZ+372
APCTZJHE EQU   APCTZ+376
APCTZDQR EQU   APCTZ+380
APCTZJHR EQU   APCTZ+384
APCTZJHT EQU   APCTZ+388
APCTZJHW EQU   APCTZ+392
APCTZ1   EQU   APCTZ@@1
APCTZKBA EQU   APCTZ1
APCTZKBC EQU   APCTZ1+4
APCTZKBB EQU   APCTZ1+8
APCTZJHC EQU   APCTZ1+20
APCTZJHQ EQU   APCTZ1+24
APCTZKBD EQU   APCTZ1+28
APCTZKBE EQU   APCTZ1+40
APCTZUKA EQU   APCTZ1+56
APCTZKBF EQU   APCTZ1+60
APCTZJDD EQU   APCTZ1+64
APCTZJDG EQU   APCTZ1+68
APCTZJDM EQU   APCTZ1+72
APCTZLCA EQU   APCTZ1+76
APCTZLCB EQU   APCTZ1+80
APCTZDWI EQU   APCTZ1+84
APCTZJAX EQU   APCTZ1+88
APCTZKGA EQU   APCTZ1+92
APCTZKGB EQU   APCTZ1+96
APCTZKGC EQU   APCTZ1+100
APCTZKGD EQU   APCTZ1+104
APCTU    EQU   APCTU@@@
APCT1MAB EQU   APCTU
APCT1MBD EQU   APCTU+4
APCT2MBD EQU   APCTU+8
APCT1CMD EQU   APCTU+12
APCT1JAA EQU   APCTU+20
APCT1JHC EQU   APCTU+24
APCT2JHC EQU   APCTU+28
APCT1JHT EQU   APCTU+32
APCT1JHL EQU   APCTU+36
APCT2JHL EQU   APCTU+40
APCT1JBJ EQU   APCTU+44
CVTS01   EQU   CVTPGSIA
CVTLPDIA EQU   CVTS01+12
CVTDIRST EQU   CVTLPDIA
CVTSLIDA EQU   CVTS01+24
CVTCTLFG EQU   CVTS01+50
CVTNOMP  EQU   CVTCTLFG
CVTRV210 EQU   CVTS01+424
CVTRV219 EQU   CVTS01+425
CVTRV228 EQU   CVTS01+426
CVTRV237 EQU   CVTS01+427
CVTMFRTR EQU   CVTS01+452
CVTRV262 EQU   CVTS01+468
CVTRV271 EQU   CVTS01+469
CVTRV280 EQU   CVTS01+470
CVTRV289 EQU   CVTS01+471
CVTGSDA  EQU   CVTS01+600
UCBOBS01 EQU   UCBDEV
UCBSTAB  EQU   UCBOBS01+10
UCBBSVL  EQU   UCBSTAB
UCBPRSRS EQU   UCBSTAB
UCBDMCT  EQU   UCBOBS01+11
UCBFL4   EQU   UCBOBS01+13
UCBOBS02 EQU   UCBDEV
UCBTFL1  EQU   UCBOBS02+19
UCBXTN   EQU   UCBOBS02+20
UCBVOPT  EQU   UCBXTN
UCBOBS03 EQU   UCBDEV
UCBXTADR EQU   UCBOBS03
UCBOBS04 EQU   UCBDEV
UCBBTA   EQU   UCBOBS04+12
UCBOBS06 EQU   UCBDEV
UCBAOF   EQU   UCBOBS06
UCBAOF1  EQU   UCBAOF
UCBAOF2  EQU   UCBAOF+1
@NM00079 EQU   UCBOBS06+3
UCBIRB   EQU   UCBOBS06+4
UCBGRAF  EQU   UCBIRB
UCBLDNCA EQU   UCBOBS06+8
UCBRDYQ  EQU   UCBLDNCA
UCBIRLN  EQU   UCBRDYQ
UCBLDNCB EQU   UCBRDYQ+1
UCBCTLNK EQU   UCBOBS06+12
UCBOBS07 EQU   UCBDEV
UCBOBS08 EQU   UCBDEV
UCBCTCAD EQU   UCBOBS08
UCBCTCF1 EQU   UCBOBS08+4
UCBOBS09 EQU   UCBDEV
PSARSVTE EQU   PSARSVT
ALLCWA   EQU   APAW
FLC      EQU   PSA
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS
PSARSAV  EQU   PSARSVTE+60
PSARSTK  EQU   PSARSVTE+56
PSAESAV3 EQU   PSARSVTE+52
PSAESTK3 EQU   PSARSVTE+48
PSAESAV2 EQU   PSARSVTE+44
PSAESTK2 EQU   PSARSVTE+40
PSAESAV1 EQU   PSARSVTE+36
PSAESTK1 EQU   PSARSVTE+32
PSAPSAV  EQU   PSARSVTE+28
PSAPSTK  EQU   PSARSVTE+24
PSAMSAV  EQU   PSARSVTE+20
PSAMSTK  EQU   PSARSVTE+16
PSASSAV  EQU   PSARSVTE+12
PSASSTK  EQU   PSARSVTE+8
PSANSTK  EQU   PSARSVTE+4
PSACSTK  EQU   PSARSVTE
UCBRV066 EQU   UCBOBS09+4
UCBIOSBA EQU   UCBOBS09
UCBRV042 EQU   UCBOBS08+5
UCBRV082 EQU   UCBCTCF1
UCBRV081 EQU   UCBCTCF1
UCBRV080 EQU   UCBCTCF1
UCBRV079 EQU   UCBCTCF1
UCBRV078 EQU   UCBCTCF1
UCBRV077 EQU   UCBCTCF1
UCBRV076 EQU   UCBCTCF1
UCBCTC80 EQU   UCBCTCF1
UCBCTCAL EQU   UCBCTCAD
UCBICNCB EQU   UCBOBS07+4
UCBRV040 EQU   UCBOBS07
UCBCTLNA EQU   UCBCTLNK+1
UCBRLN   EQU   UCBCTLNK
UCBRDYQA EQU   UCBLDNCB
UCBINRLN EQU   UCBIRLN
UCBIRBA  EQU   UCBIRB+1
UCBRV039 EQU   UCBGRAF
UCBDWNR  EQU   UCBGRAF
UCBRPND  EQU   UCBGRAF
UCBUPM   EQU   UCBGRAF
UCBBTAM  EQU   UCBGRAF
UCBDRNO  EQU   UCBGRAF
UCBDRO   EQU   UCBGRAF
UCBOIP   EQU   UCBGRAF
UCBATRCD EQU   @NM00079
UCBSKPFG EQU   @NM00079
UCBRIPND EQU   @NM00079
UCBRTIAC EQU   @NM00079
UCBRSV79 EQU   @NM00079
UCBRSV78 EQU   @NM00079
UCBRSV77 EQU   @NM00079
UCBOLTEP EQU   @NM00079
UCBATNCT EQU   UCBOBS06+2
UCBRSV76 EQU   UCBAOF2
UCBRSV75 EQU   UCBAOF2
UCBRSV74 EQU   UCBAOF2
UCBRSV73 EQU   UCBAOF2
UCBRSV72 EQU   UCBAOF2
UCBRSV71 EQU   UCBAOF2
UCBRSV70 EQU   UCBAOF2
UCBRSV69 EQU   UCBAOF2
UCBRSV68 EQU   UCBAOF1
UCBRSV67 EQU   UCBAOF1
UCBRSV66 EQU   UCBAOF1
UCBRSV65 EQU   UCBAOF1
UCBRSV64 EQU   UCBAOF1
UCBOFNL  EQU   UCBAOF1
UCBOFSP  EQU   UCBAOF1
UCBOFMCR EQU   UCBAOF1
UCBBTB   EQU   UCBBTA+1
UCBDI    EQU   UCBBTA
UCBSNS   EQU   UCBOBS04+8
UCBTEB   EQU   UCBOBS04+4
UCBGCB   EQU   UCBOBS04+3
UCBOPEN  EQU   UCBOBS04+2
UCBSTART EQU   UCBOBS04
UCBXTNB  EQU   UCBXTN+1
UCBRSV22 EQU   UCBVOPT
UCBRSV21 EQU   UCBVOPT
UCBRSV20 EQU   UCBVOPT
UCBESVE  EQU   UCBVOPT
UCBERPC  EQU   UCBVOPT
UCBESVC  EQU   UCBVOPT
UCBEVA   EQU   UCBVOPT
UCBESV   EQU   UCBVOPT
UCBRV009 EQU   UCBTFL1
UCBRV008 EQU   UCBTFL1
UCBRV007 EQU   UCBTFL1
UCBRV006 EQU   UCBTFL1
UCBRV005 EQU   UCBTFL1
UCBDQDSP EQU   UCBTFL1
UCBNSLTP EQU   UCBTFL1
UCBNLTP  EQU   UCBTFL1
UCBRES1B EQU   UCBOBS02+18
UCBFSER  EQU   UCBOBS02+12
@NM00078 EQU   UCBOBS02+4
UCBFSEQ  EQU   UCBOBS02+2
UCBFSCT  EQU   UCBOBS02
UCBNEXP  EQU   UCBOBS01+20
UCBBASE  EQU   UCBOBS01+16
UCBRES1A EQU   UCBOBS01+15
UCBUSER  EQU   UCBOBS01+14
UCBFL47  EQU   UCBFL4
UCBMAT   EQU   UCBFL4
UCBHOLD  EQU   UCBFL4
UCBATTN  EQU   UCBFL4
UCBDSS   EQU   UCBFL4
UCBRESVP EQU   UCBFL4
UCBWDAV  EQU   UCBFL4
UCBDAVV  EQU   UCBFL4
UCBSQC   EQU   UCBOBS01+12
UCBDATP  EQU   UCBOBS01+12
UCBDMC   EQU   UCBDMCT
UCBMOUNT EQU   UCBDMCT
UCBBNUL  EQU   UCBSTAB
UCBSHAR  EQU   UCBSTAB
UCBBSTR  EQU   UCBSTAB
UCBBPUB  EQU   UCBSTAB
UCBBPRV  EQU   UCBSTAB
UCBBALB  EQU   UCBPRSRS
UCBPGFL  EQU   UCBSTAB
UCBDVSHR EQU   UCBBSVL
UCBVOLI  EQU   UCBOBS01+4
UCBVTOC  EQU   UCBOBS01
CVTRV628 EQU   CVTS01+728
CVTRV627 EQU   CVTS01+724
CVTRV626 EQU   CVTS01+720
CVTRV625 EQU   CVTS01+716
CVTRV624 EQU   CVTS01+712
CVTRV623 EQU   CVTS01+708
CVTRV622 EQU   CVTS01+704
CVTRV621 EQU   CVTS01+700
CVTIHASU EQU   CVTS01+696
CVTSUSP  EQU   CVTS01+692
CVTT6SVC EQU   CVTS01+688
CVTCDAL  EQU   CVTS01+684
CVTTCTL  EQU   CVTS01+680
CVTRSUME EQU   CVTS01+676
CVTJTERM EQU   CVTS01+672
CVTASMRM EQU   CVTS01+668
CVTTCASP EQU   CVTS01+664
CVT0PT03 EQU   CVTS01+660
CVT0PT0E EQU   CVTS01+656
CVTRV609 EQU   CVTS01+652
CVTCGK   EQU   CVTS01+648
CVTRAC   EQU   CVTS01+644
CVTRV606 EQU   CVTS01+640
CVTRV605 EQU   CVTS01+636
CVTRV604 EQU   CVTS01+632
CVTEFF02 EQU   CVTS01+628
CVTCBBR  EQU   CVTS01+624
CVTSSCR  EQU   CVTS01+620
CVTEVENT EQU   CVTS01+616
CVTCRCA  EQU   CVTS01+612
CVTTPIO  EQU   CVTS01+608
CVTADV   EQU   CVTS01+604
CVTGSDAB EQU   CVTGSDA
CVTQV3   EQU   CVTS01+596
CVTQV2   EQU   CVTS01+592
CVTQV1   EQU   CVTS01+588
CVTRPT   EQU   CVTS01+584
CVTSSRB  EQU   CVTS01+580
CVTCSDRL EQU   CVTS01+576
CVTEXP1  EQU   CVTS01+572
CVTRMPMT EQU   CVTS01+568
CVTRMPTT EQU   CVTS01+564
CVTVPSA  EQU   CVTS01+560
CVTVSTOP EQU   CVTS01+556
CVTGTFR8 EQU   CVTS01+552
CVTQUIT  EQU   CVTS01+548
CVTVACR  EQU   CVTS01+544
CVTWTCB  EQU   CVTS01+540
CVTSTPRS EQU   CVTS01+536
CVT0PT02 EQU   CVTS01+532
CVTDARCM EQU   CVTS01+528
CVTIRECM EQU   CVTS01+524
CVTJRECM EQU   CVTS01+520
CVTVEMS0 EQU   CVTS01+516
CVTSPFRR EQU   CVTS01+512
CVTRLSTG EQU   CVTS01+508
CVT0TC0A EQU   CVTS01+504
CVTGMBR  EQU   CVTS01+500
CVTLFRM  EQU   CVTS01+496
CVTRMBR  EQU   CVTS01+492
CVTVIOP  EQU   CVTS01+488
CVTRV307 EQU   CVTS01+486
CVTRV306 EQU   CVTS01+484
CVTRV305 EQU   CVTS01+482
CVTRV304 EQU   CVTS01+480
CVTRV303 EQU   CVTS01+478
CVTRV302 EQU   CVTS01+476
CVTTRCA  EQU   CVTS01+472
CVTRV297 EQU   CVTRV289
CVTRV296 EQU   CVTRV289
CVTRV295 EQU   CVTRV289
CVTRV294 EQU   CVTRV289
CVTRV293 EQU   CVTRV289
CVTRV292 EQU   CVTRV289
CVTRV291 EQU   CVTRV289
CVTRV290 EQU   CVTRV289
CVTRV288 EQU   CVTRV280
CVTRV287 EQU   CVTRV280
CVTRV286 EQU   CVTRV280
CVTRV285 EQU   CVTRV280
CVTRV284 EQU   CVTRV280
CVTRV283 EQU   CVTRV280
CVTRV282 EQU   CVTRV280
CVTRV281 EQU   CVTRV280
CVTRV279 EQU   CVTRV271
CVTRV278 EQU   CVTRV271
CVTRV277 EQU   CVTRV271
CVTRV276 EQU   CVTRV271
CVTRV275 EQU   CVTRV271
CVTRV274 EQU   CVTRV271
CVTRV273 EQU   CVTRV271
CVTRV272 EQU   CVTRV271
CVTRV270 EQU   CVTRV262
CVTRV269 EQU   CVTRV262
CVTRV268 EQU   CVTRV262
CVTRV267 EQU   CVTRV262
CVTRV266 EQU   CVTRV262
CVTRV265 EQU   CVTRV262
CVTRV264 EQU   CVTRV262
CVTRV263 EQU   CVTRV262
CVTVFP   EQU   CVTS01+464
CVTVSI   EQU   CVTS01+460
CVTVPSIB EQU   CVTS01+456
CVTMFACT EQU   CVTMFRTR
CVTMFCTL EQU   CVTS01+448
CVTPVBP  EQU   CVTS01+444
CVTPWI   EQU   CVTS01+440
CVTRV254 EQU   CVTS01+438
CVTRV253 EQU   CVTS01+436
CVTRV252 EQU   CVTS01+434
CVTRV251 EQU   CVTS01+433
CVTRV250 EQU   CVTS01+432
CVTRV249 EQU   CVTS01+431
CVTRV248 EQU   CVTS01+430
CVTRV247 EQU   CVTS01+429
CVTRV246 EQU   CVTS01+428
CVTRV245 EQU   CVTRV237
CVTRV244 EQU   CVTRV237
CVTRV243 EQU   CVTRV237
CVTRV242 EQU   CVTRV237
CVTRV241 EQU   CVTRV237
CVTRV240 EQU   CVTRV237
CVTRV239 EQU   CVTRV237
CVTRV238 EQU   CVTRV237
CVTRV236 EQU   CVTRV228
CVTRV235 EQU   CVTRV228
CVTRV234 EQU   CVTRV228
CVTRV233 EQU   CVTRV228
CVTRV232 EQU   CVTRV228
CVTRV231 EQU   CVTRV228
CVTRV230 EQU   CVTRV228
CVTRV229 EQU   CVTRV228
CVTRV227 EQU   CVTRV219
CVTRV226 EQU   CVTRV219
CVTRV225 EQU   CVTRV219
CVTRV224 EQU   CVTRV219
CVTRV223 EQU   CVTRV219
CVTRV222 EQU   CVTRV219
CVTRV221 EQU   CVTRV219
CVTRV220 EQU   CVTRV219
CVTRV218 EQU   CVTRV210
CVTRV217 EQU   CVTRV210
CVTRV216 EQU   CVTRV210
CVTRV215 EQU   CVTRV210
CVTRV214 EQU   CVTRV210
CVTRV213 EQU   CVTRV210
CVTRV212 EQU   CVTRV210
CVTRV211 EQU   CVTRV210
CVTLCCAT EQU   CVTS01+420
CVTPCCAT EQU   CVTS01+416
CVTIPCRP EQU   CVTS01+412
CVTIPCRI EQU   CVTS01+408
CVTIPCDS EQU   CVTS01+404
CVTAIDVT EQU   CVTS01+400
CVTSSAP  EQU   CVTS01+396
CVTEHCIR EQU   CVTS01+392
CVTEHDEF EQU   CVTS01+388
CVTDAIR  EQU   CVTS01+384
CVTPERFM EQU   CVTS01+380
CVT044R2 EQU   CVTS01+376
CVTFETCH EQU   CVTS01+372
CVTRSTWD EQU   CVTS01+368
CVTSPOST EQU   CVTS01+364
CVTIOBP  EQU   CVTS01+360
CVTASMVT EQU   CVTS01+356
CVTRECRQ EQU   CVTS01+352
CVTWSAC  EQU   CVTS01+348
CVTRV149 EQU   CVTS01+344
CVTWSAL  EQU   CVTS01+340
CVTSPSA  EQU   CVTS01+336
CVTGLMN  EQU   CVTS01+332
CVTVEAC0 EQU   CVTS01+328
CVT062R1 EQU   CVTS01+324
CVTRPOST EQU   CVTS01+320
CVTDQIQE EQU   CVTS01+316
CVTCSD   EQU   CVTS01+312
CVTLKRMA EQU   CVTS01+308
CVTRSPIE EQU   CVTS01+304
CVTRENQ  EQU   CVTS01+300
CVTLQCB  EQU   CVTS01+296
CVTFQCB  EQU   CVTS01+292
CVTQCS01 EQU   CVTS01+288
CVTAPFT  EQU   CVTS01+284
CVTPARRL EQU   CVTS01+280
CVTVWAIT EQU   CVTS01+276
CVTGSPL  EQU   CVTS01+272
CVTLSMQ  EQU   CVTS01+268
CVTGSMQ  EQU   CVTS01+264
CVTEXPRO EQU   CVTS01+260
CVTOPCTP EQU   CVTS01+256
CVTSIC   EQU   CVTS01+252
CVTTPIOS EQU   CVTS01+248
CVTRTMS  EQU   CVTS01+244
CVTSDBF  EQU   CVTS01+240
CVTSCBP  EQU   CVTS01+236
CVTSDMP  EQU   CVTS01+232
CVTSV60  EQU   CVTS01+228
CVTRTMCT EQU   CVTS01+224
CVTASCBL EQU   CVTS01+220
CVTASCBH EQU   CVTS01+216
CVTGDA   EQU   CVTS01+212
CVTASVT  EQU   CVTS01+208
CVTVVMDI EQU   CVTS01+204
CVTAQTOP EQU   CVTS01+200
CVTIOSCS EQU   CVTS01+196
CVTSDRM  EQU   CVTS01+192
CVTOPTE  EQU   CVTS01+188
CVTSTXU  EQU   CVTS01+184
CVTQUIS  EQU   CVTS01+180
CVTPARS  EQU   CVTS01+176
CVTS1EE  EQU   CVTS01+172
CVTFRAS  EQU   CVTS01+168
CVTQSAS  EQU   CVTS01+164
CVTCRAS  EQU   CVTS01+160
CVTCRMN  EQU   CVTS01+156
CVTDELCP EQU   CVTS01+152
CVTFRECL EQU   CVTS01+148
CVTGETCL EQU   CVTS01+144
CVTBLDCP EQU   CVTS01+140
CVTAUTHL EQU   CVTS01+136
CVTSCAN  EQU   CVTS01+132
CVTRV144 EQU   CVTS01+130
CVTMAXMP EQU   CVTS01+128
CVTSTCK  EQU   CVTS01+124
CVTRV139 EQU   CVTS01+123
CVTDSSAC EQU   CVTS01+122
CVTRV513 EQU   CVTS01+121
CVTIOSPL EQU   CVTS01+120
CVTPTGT  EQU   CVTS01+116
CVTCSPIE EQU   CVTS01+112
CVTSMFEX EQU   CVTS01+108
CVTOLT0A EQU   CVTS01+104
CVTSRBRT EQU   CVTS01+100
CVTPUTL  EQU   CVTS01+96
CVTASCRL EQU   CVTS01+92
CVTASCRF EQU   CVTS01+88
CVTRV326 EQU   CVTS01+84
CVTRV325 EQU   CVTS01+80
CVTRV324 EQU   CVTS01+76
CVT0VL01 EQU   CVTS01+72
CVTSHRVM EQU   CVTS01+68
CVTRV332 EQU   CVTS01+64
CVTTAS   EQU   CVTS01+60
CVTRSCN  EQU   CVTS01+56
CVTTRAC2 EQU   CVTS01+54
CVTTRACE EQU   CVTS01+52
CVTAPG   EQU   CVTS01+51
CVTSDTRC EQU   CVTCTLFG
CVTGTRCE EQU   CVTCTLFG
CVTRSV79 EQU   CVTCTLFG
CVTDSTAT EQU   CVTCTLFG
CVTRSV78 EQU   CVTCTLFG
CVTRV333 EQU   CVTCTLFG
CVTRV323 EQU   CVTCTLFG
CVTSPVLK EQU   CVTS01+49
CVTRSV77 EQU   CVTS01+48
CVTRV331 EQU   CVTS01+44
CVTRV330 EQU   CVTS01+40
CVTRV329 EQU   CVTS01+36
CVTRV328 EQU   CVTS01+32
CVTRV322 EQU   CVTS01+28
CVTSLID  EQU   CVTSLIDA+1
CVTSYLK  EQU   CVTSLIDA
CVTRV321 EQU   CVTS01+20
CVTRV320 EQU   CVTS01+16
CVTLPDIR EQU   CVTLPDIA+1
CVTRSV69 EQU   CVTDIRST
CVTRSV68 EQU   CVTDIRST
CVTRSV67 EQU   CVTDIRST
CVTRSV66 EQU   CVTDIRST
CVTRSV65 EQU   CVTDIRST
CVTRSV64 EQU   CVTDIRST
CVTRSV63 EQU   CVTDIRST
CVTDICOM EQU   CVTDIRST
CVTPVTP  EQU   CVTS01+8
CVTLPDSR EQU   CVTS01+4
CVTGETL  EQU   CVTS01
@NM00051 EQU   APCTU+48
APCT1MBM EQU   APCTU+16
@NM00050 EQU   APCTZ1+108
@NM00049 EQU   APCTZ1+52
@NM00048 EQU   APCTZ1+48
@NM00047 EQU   APCTZ1+44
@NM00046 EQU   APCTZ1+36
@NM00045 EQU   APCTZ1+32
@NM00044 EQU   APCTZ1+16
@NM00043 EQU   APCTZ1+12
@NM00042 EQU   APCTZ+396
@NM00041 EQU   APCTZ+352
@NM00040 EQU   APCTZ+348
@NM00039 EQU   APCTZ+336
@NM00038 EQU   APCTZ+292
APCTZJFA EQU   APCTZ+228
APCTZMBR EQU   APCTZ+100
@NM00037 EQU   APCTZ+20
ASCBEND  EQU   ASCB+208
ASCBSRBT EQU   ASCB+200
ASCBSWTL EQU   ASCB+196
ASCBRS14 EQU   ASCB+195
ASCBSMCT EQU   ASCB+194
ASCBRS12 EQU   ASCB+192
ASCBPCTT EQU   ASCB+188
ASCBVGTT EQU   ASCB+184
ASCBRV43 EQU   ASCBSRQ4
ASCBRV42 EQU   ASCBSRQ4
ASCBRV41 EQU   ASCBSRQ4
ASCBRV40 EQU   ASCBSRQ4
ASCBRV39 EQU   ASCBSRQ4
ASCBRV38 EQU   ASCBSRQ4
ASCBRV37 EQU   ASCBSRQ4
ASCBRV36 EQU   ASCBSRQ4
ASCBRV35 EQU   ASCBSRQ3
ASCBRV34 EQU   ASCBSRQ3
ASCBRV33 EQU   ASCBSRQ3
ASCBRV32 EQU   ASCBSRQ3
ASCBRV31 EQU   ASCBSRQ3
ASCBRV30 EQU   ASCBSRQ3
ASCBRV29 EQU   ASCBSRQ3
ASCBRV28 EQU   ASCBSRQ3
ASCBRV27 EQU   ASCBSRQ2
ASCBRV26 EQU   ASCBSRQ2
ASCBRV25 EQU   ASCBSRQ2
ASCBRV24 EQU   ASCBSRQ2
ASCBRV23 EQU   ASCBSRQ2
ASCBRV22 EQU   ASCBSRQ2
ASCBRV21 EQU   ASCBSRQ2
ASCBRV20 EQU   ASCBSRQ2
ASCBRV19 EQU   ASCBSRQ1
ASCBRV18 EQU   ASCBSRQ1
ASCBRV17 EQU   ASCBSRQ1
ASCBRV16 EQU   ASCBSRQ1
ASCBRV15 EQU   ASCBSRQ1
ASCBRV14 EQU   ASCBSRQ1
ASCBRV13 EQU   ASCBSRQ1
ASCBSTA  EQU   ASCBSRQ1
ASCBJBNS EQU   ASCB+176
ASCBJBNI EQU   ASCB+172
ASCBMCC  EQU   ASCB+168
ASCBRTWA EQU   ASCB+164
ASCBIQEA EQU   ASCB+160
ASCBXMPQ EQU   ASCB+156
ASCBRS01 EQU   ASCB+154
ASCBFMCT EQU   ASCB+152
ASCBOUXB EQU   ASCB+148
ASCBOUCB EQU   ASCB+144
ASCBMECB EQU   ASCB+140
ASCBQECB EQU   ASCB+136
ASCBLSQH EQU   ASCBLKGP+4
ASCBLOCK EQU   ASCBLKGP
ASCBTCBS EQU   ASCB+124
ASCBNVSC EQU   ASCB+122
ASCBVSC  EQU   ASCB+120
ASCBSRBS EQU   ASCB+118
ASCBSSRB EQU   ASCB+116
ASCBRV06 EQU   ASCBFLG2
ASCBRV05 EQU   ASCBFLG2
ASCBRV04 EQU   ASCBFLG2
ASCBSNQS EQU   ASCBFLG2
ASCBS2S  EQU   ASCBFLG2
ASCBCEXT EQU   ASCBFLG2
ASCBPXMT EQU   ASCBFLG2
ASCBXMPT EQU   ASCBFLG2
ASCBRF07 EQU   ASCBDSP1
ASCBRF06 EQU   ASCBDSP1
ASCBRF05 EQU   ASCBDSP1
ASCBRF04 EQU   ASCBDSP1
ASCBRF03 EQU   ASCBDSP1
ASCBRF02 EQU   ASCBDSP1
ASCBFAIL EQU   ASCBDSP1
ASCBNOQ  EQU   ASCBDSP1
ASCBSWCT EQU   ASCB+112
ASCBASXB EQU   ASCB+108
ASCBTMCH EQU   ASCB+104
ASCBNSWP EQU   ASCBFLG1
ASCBTYP1 EQU   ASCBFLG1
ASCBSTND EQU   ASCBFLG1
ASCBABNT EQU   ASCBFLG1
ASCBTERM EQU   ASCBFLG1
ASCBS3S  EQU   ASCBFLG1
ASCBCMSH EQU   ASCBFLG1
ASCBTOFF EQU   ASCBFLG1
ASCBRF01 EQU   ASCBRCTF
ASCBTMLW EQU   ASCBRCTF
ASCBOUT  EQU   ASCBRCTF
ASCBWAIT EQU   ASCBRCTF
ASCBRV08 EQU   ASCBRCTF
ASCBFQU  EQU   ASCBRCTF
ASCBFRS  EQU   ASCBRCTF
ASCBTMNO EQU   ASCBRCTF
ASCBDUMP EQU   ASCB+96
ASCBRV44 EQU   ASCB+92
ASCBUBET EQU   ASCB+88
ASCBECB  EQU   ASCB+84
ASCBJSTL EQU   ASCB+80
ASCBEWST EQU   ASCB+72
ASCBEJST EQU   ASCB+64
ASCBTSB  EQU   ASCB+60
ASCBCSCB EQU   ASCB+56
ASCBRSM  EQU   ASCB+52
ASCBLDA  EQU   ASCB+48
ASCBSTOR EQU   ASCB+44
ASCBDP   EQU   ASCB+43
ASCBRV07 EQU   ASCB+42
ASCBIOSM EQU   ASCB+40
ASCBSEQN EQU   ASCB+38
ASCBASID EQU   ASCB+36
ASCBCPUS EQU   ASCB+32
ASCBSPL  EQU   ASCB+28
ASCBIOSP EQU   ASCB+24
ASCBSYNC EQU   ASCBSUPC+4
ASCBSVRB EQU   ASCBSUPC
ASCBCMSF EQU   ASCB+12
ASCBBWDP EQU   ASCB+8
ASCBFWDP EQU   ASCB+4
ASCBASCB EQU   ASCB
ASCBEGIN EQU   ASCB
UCBERADR EQU   UCBUCS+12
UCBFCBID EQU   UCBUCS+8
UCBERCNT EQU   UCBUCS+7
UCBRSV51 EQU   UCBUCS+6
UCBRSV50 EQU   UCBFCBOP
UCBRSV49 EQU   UCBFCBOP
UCBRSV48 EQU   UCBFCBOP
UCBRSV47 EQU   UCBFCBOP
UCBRSV46 EQU   UCBFCBOP
UCBRSV45 EQU   UCBFCBOP
UCBRSV44 EQU   UCBFCBOP
UCBFCBO1 EQU   UCBFCBOP
UCBUCSPE EQU   UCBUCSOP
UCBRSV43 EQU   UCBUCSOP
UCBRSV42 EQU   UCBUCSOP
UCBRSV41 EQU   UCBUCSOP
UCBRSV40 EQU   UCBUCSOP
UCBRSV39 EQU   UCBUCSOP
UCBUCSO2 EQU   UCBUCSOP
UCBUCSO1 EQU   UCBUCSOP
UCBUCSID EQU   UCBUCS
UCBMDRBA EQU   UCBMDRBF+1
UCBRV075 EQU   UCBMDRBF
UCBRV074 EQU   UCB3800X+32
UCBIMAGE EQU   UCB3800X+28
UCBFCBNM EQU   UCB3800X+24
UCBCHAR4 EQU   UCB3800X+20
UCBCHAR3 EQU   UCB3800X+16
UCBCHAR2 EQU   UCB3800X+12
UCBCHAR1 EQU   UCB3800X+8
UCBCGMID EQU   UCB3800X+4
UCBBRSTA EQU   UCBACTIV
UCBRV063 EQU   UCBACTIV
UCBRV062 EQU   UCBACTIV
UCBRV061 EQU   UCBACTIV
UCBRV060 EQU   UCBACTIV
UCBRV059 EQU   UCBACTIV
UCBRV058 EQU   UCBACTIV
UCBRV057 EQU   UCBACTIV
UCBRV050 EQU   UCB3800X+2
UCBCGMNO EQU   UCB3800X+1
UCBRV083 EQU   UCBOPTNS
UCBBRSTR EQU   UCBOPTNS
UCBRV056 EQU   UCBOPTNS
UCBRV055 EQU   UCBOPTNS
UCBRV054 EQU   UCBOPTNS
UCBRV053 EQU   UCBOPTNS
UCBRV052 EQU   UCBOPTNS
UCBRV051 EQU   UCBOPTNS
UCBRV073 EQU   UCB3540X+7
UCBRV072 EQU   UCBDKBYT
UCBRV071 EQU   UCBDKBYT
UCBRV070 EQU   UCBDKBYT
UCBRV069 EQU   UCBDKBYT
UCBRV068 EQU   UCBDKBYT
UCBRV067 EQU   UCBDKBYT
UCBVLVER EQU   UCBDKBYT
UCBDKAMX EQU   UCBDKBYT
UCBVLSER EQU   UCB3540X
UCBRDATA EQU   UCBOCR+4
UCBFRID  EQU   UCBOCR
UCBCLN   EQU   UCBMT+14
UCBERG   EQU   UCBMT+12
UCBMS    EQU   UCBMT+11
UCBNB    EQU   UCBMT+10
UCBPW    EQU   UCBMT+9
UCBPR    EQU   UCBMT+8
UCBSIO   EQU   UCBMT+6
UCBTW    EQU   UCBMT+5
UCBTR    EQU   UCBMT+4
UCBTWT   EQU   UCBMT+3
UCBTRT   EQU   UCBMT+2
UCBCTD   EQU   UCBMT
UCBWTOID EQU   UCBCMEXT+17
UCBMIHTI EQU   UCBCMEXT+16
UCBASID  EQU   UCBCMEXT+14
UCBMFCNT EQU   UCBCMEXT+12
UCBPMSK  EQU   UCBCMEXT+10
UCBCCWOF EQU   UCBCMEXT+8
UCBRV041 EQU   UCBCMEXT+6
UCBRV036 EQU   UCBFLP1
UCBRV035 EQU   UCBFLP1
UCBERLOG EQU   UCBFLP1
UCBRV033 EQU   UCBFLP1
UCBINHIO EQU   UCBFLP1
UCBNSWAP EQU   UCBFLP1
UCBSHRUP EQU   UCBFLP1
UCBNSRCH EQU   UCBFLP1
UCBSNSCT EQU   UCBCMEXT+4
UCBHPDV  EQU   @NM00080
UCBHALI  EQU   @NM00080
UCBRSV09 EQU   @NM00080
UCBRSV08 EQU   @NM00080
UCBRSV07 EQU   @NM00080
UCBRSV06 EQU   @NM00080
UCBRSV05 EQU   @NM00080
UCBRSV04 EQU   @NM00080
UCBDTI   EQU   UCBCMEXT+2
UCBSTI   EQU   UCBCMEXT+1
UCBETI   EQU   UCBCMEXT
UCBEXTP  EQU   UCBEXTPT+1
UCBDDRSW EQU   UCBFLC
UCBTICBT EQU   UCBFLC
UCBIVRR  EQU   UCBFLC
UCBIVRS  EQU   UCBFLC
UCBITF   EQU   UCBFLC
UCBUDE   EQU   UCBFLC
UCBWAA   EQU   UCBFLC
UCBATTP  EQU   UCBFLC
UCBUNTYP EQU   UCBTBYT4
UCBRSV11 EQU   UCBDVCLS
UCBRSV10 EQU   UCBDVCLS
UCB3CHAR EQU   UCBDVCLS
UCB3UREC EQU   UCBDVCLS
UCB3DISP EQU   UCBDVCLS
UCB3DACC EQU   UCBDVCLS
UCB3COMM EQU   UCBDVCLS
UCB3TAPE EQU   UCBDVCLS
UCBDVPWR EQU   UCB2OPT7
UCBVLPWR EQU   UCB2OPT6
UCB2OPT5 EQU   UCBTBYT2
UCBRVDEV EQU   UCBRWTAU
UCBRPS   EQU   UCBDUDN2
UCBRR    EQU   UCBDUDN1
UCB2OPT1 EQU   UCBTBYT2
UCB2OPT0 EQU   UCBTBYT2
UCB1FEA7 EQU   UCBTBYT1
UCBD6250 EQU   UCB1FEA6
UCBD1600 EQU   UCB1FEA5
UCB1FEA4 EQU   UCBTBYT1
UCB1FEA3 EQU   UCBTBYT1
UCB1FEA2 EQU   UCBTBYT1
UCB1FEA1 EQU   UCBTBYT1
UCB1FEA0 EQU   UCBTBYT1
UCBNAME  EQU   UCBOB+13
UCBRV029 EQU   UCBWGT
UCBVHRSN EQU   UCBWGT
UCBVORSN EQU   UCBWGT
UCBMTPXP EQU   UCBWGT
UCBREW   EQU   UCBWGT
UCBPUB   EQU   UCBWGT
UCBOUT   EQU   UCBWGT
UCBIN    EQU   UCBWGT
UCBCPU   EQU   UCBOB+11
UCBLCI   EQU   UCBOB+10
UCBCNT   EQU   UCBOB+9
UCBRV017 EQU   UCBCHM1
UCBRV016 EQU   UCBCHM1
UCBRV015 EQU   UCBCHM1
UCBRV014 EQU   UCBCHM1
UCBSIGP  EQU   UCBFLB
UCBVALPH EQU   UCBFLB
UCBCRHSN EQU   UCBFLB
UCBCRHRV EQU   UCBFLB
UCBRESVH EQU   UCBFLB
UCBSPST  EQU   UCBFLB
UCBASNS  EQU   UCBFLB
UCBIORST EQU   UCBFLB
UCBQISCE EQU   UCBFL1
UCBACTV  EQU   UCBFL1
UCBSAP   EQU   UCBFL1
UCBNOTRC EQU   UCBCUB
UCBPSNS  EQU   UCBFL1
UCBUSING EQU   UCBPST
UCBNOTRD EQU   UCBNRY
UCBBUSYD EQU   UCBBSY
UCBUA    EQU   UCBCHAN+1
UCBCHA   EQU   UCBCHAN
UCBDADI  EQU   UCBSTAT
UCBSYSR  EQU   UCBSTAT
UCBPRES  EQU   UCBSTAT
UCBALOC  EQU   UCBSTAT
UCBUNLD  EQU   UCBSTAT
UCBRESV  EQU   UCBSTAT
UCBCHGS  EQU   UCBSTAT
UCBONLI  EQU   UCBSTAT
UCBID    EQU   UCBOB+2
UCBALTPH EQU   UCBFL5
UCBALTCU EQU   UCBFL5
UCBNALOC EQU   UCBFL5
UCBENVRD EQU   UCBFL5
UCBVSDR  EQU   UCBFL5
UCBSASK  EQU   UCBFL5
UCBAMV   EQU   UCBAF
UCBDCC   EQU   UCBFL5
UCBMONT  EQU   UCBJBNR
UCBRV011 EQU   UCBJBNR
UCBMMSGP EQU   UCBJBNR
UCBOLDSM EQU   UCBJBNR
UCBRV003 EQU   UCBJBNR
UCBDUC   EQU   UCBJBNR
UCBJES3  EQU   UCBJBNR
UCBVRDEV EQU   UCBJBNR
UCBCMSEG EQU   UCBOB
UCBPFXND EQU   UCB+512
UCBIOQ   EQU   UCB+508
UCBLOCK  EQU   UCB+504
UCBPXST  EQU   UCB+504
@NM00077 EQU   UCB
SSAGGMSG EQU   SSAGGMBK+2
SSAGGMGL EQU   SSAGGMBK
SSAGDMSG EQU   SSAGDMBK+2
SSAGDMGL EQU   SSAGDMBK
SSAGSSWA EQU   SSAGARBK+48
SSAGJFCB EQU   SSAGARBK+44
SSAGSSNM EQU   SSAGARBK+40
SSAGADSP EQU   SSAGARBK+36
SSAGUNIT EQU   SSAGARBK+32
SSAGSOUT EQU   SSAGARBK+28
SSAGDUMY EQU   SSAGARBK+24
SSAGDISP EQU   SSAGARBK+20
SSAGDDNM EQU   SSAGARBK+16
@NM00076 EQU   SSAGARBK+10
SSAGDMLN EQU   SSAGARBK+8
SSAGRBIC EQU   SSAGARBK+6
SSAGRBEC EQU   SSAGARBK+4
SSAGRBFL EQU   SSAGARBK+2
SSAGRBLN EQU   SSAGARBK
SSAGGMLN EQU   SSAGEHDR+20
SSAGJBNM EQU   SSAGEHDR+16
SSAGCNCL EQU   SSAGEHDR+12
SSAGARBP EQU   SSAGEHDR+8
SSAGGPIC EQU   SSAGEHDR+6
SSAGGPEC EQU   SSAGEHDR+4
@NM00075 EQU   SSAGFLGS
SSAGSMSG EQU   SSAGFLGS
SSAGWAIT EQU   SSAGFLGS
SSAGLEN  EQU   SSAGEHDR
SSOBSSIB EQU   SSOB+8
SSOBFUNC EQU   SSOB+6
SSOBLEN  EQU   SSOB+4
SSOBID   EQU   SSOB
CVTLEVL  EQU   CVTRELNO+2
CVTNUMB  EQU   CVTRELNO
CVTMDL   EQU   CVTFIX+250
@NM00074 EQU   CVTFIX+248
@NM00073 EQU   CVTFIX
CVTRV482 EQU   CVTXTNT2+128
CVTRV481 EQU   CVTXTNT2+124
CVTRV480 EQU   CVTXTNT2+120
CVTRV479 EQU   CVTXTNT2+118
CVTRV478 EQU   CVTXTNT2+117
CVTRV477 EQU   CVTXTNT2+116
CVTRV476 EQU   CVTXTNT2+115
CVTRV475 EQU   CVTXTNT2+114
CVTRV474 EQU   CVTRV466
CVTRV473 EQU   CVTRV466
CVTRV472 EQU   CVTRV466
CVTRV471 EQU   CVTRV466
CVTRV470 EQU   CVTRV466
CVTRV469 EQU   CVTRV466
CVTRV468 EQU   CVTRV466
CVTRV467 EQU   CVTRV466
CVTRV465 EQU   CVTRV457
CVTRV464 EQU   CVTRV457
CVTRV463 EQU   CVTRV457
CVTRV462 EQU   CVTRV457
CVTRV461 EQU   CVTRV457
CVTRV460 EQU   CVTRV457
CVTRV459 EQU   CVTRV457
CVTRV458 EQU   CVTRV457
CVTRV456 EQU   CVTXTNT2+108
CVTRV455 EQU   CVTXTNT2+104
CVTRV454 EQU   CVTXTNT2+100
CVTRV453 EQU   CVTXTNT2+96
CVTRV452 EQU   CVTXTNT2+94
CVTRV451 EQU   CVTXTNT2+92
CVTRV450 EQU   CVTXTNT2+90
CVTRV449 EQU   CVTXTNT2+88
CVTRV448 EQU   CVTXTNT2+87
CVTRV447 EQU   CVTXTNT2+86
CVTRV446 EQU   CVTRV438
CVTRV445 EQU   CVTRV438
CVTRV444 EQU   CVTRV438
CVTRV443 EQU   CVTRV438
CVTRV442 EQU   CVTRV438
CVTRV441 EQU   CVTRV438
CVTRV440 EQU   CVTRV438
CVTRV439 EQU   CVTRV438
CVTRV437 EQU   CVTRV429
CVTRV436 EQU   CVTRV429
CVTRV435 EQU   CVTRV429
CVTRV434 EQU   CVTRV429
CVTRV433 EQU   CVTRV429
CVTRV432 EQU   CVTRV429
CVTRV431 EQU   CVTRV429
CVTRV430 EQU   CVTRV429
CVTRV428 EQU   CVTXTNT2+80
CVTRV427 EQU   CVTXTNT2+76
CVTRV426 EQU   CVTXTNT2+72
CVTRV425 EQU   CVTXTNT2+68
CVTATACT EQU   CVTATCVT
CVTRV423 EQU   CVTXTNT2+62
CVTRV422 EQU   CVTXTNT2+60
CVTRV421 EQU   CVTXTNT2+58
CVTRV420 EQU   CVTXTNT2+56
CVTRV419 EQU   CVTXTNT2+55
CVTRV418 EQU   CVTXTNT2+54
CVTRV417 EQU   CVTRV409
CVTRV416 EQU   CVTRV409
CVTRV415 EQU   CVTRV409
CVTRV414 EQU   CVTRV409
CVTRV413 EQU   CVTRV409
CVTRV412 EQU   CVTRV409
CVTRV411 EQU   CVTRV409
CVTRV410 EQU   CVTRV409
CVTRV408 EQU   CVTRV400
CVTRV407 EQU   CVTRV400
CVTRV406 EQU   CVTRV400
CVTRV405 EQU   CVTRV400
CVTRV404 EQU   CVTRV400
CVTRV403 EQU   CVTRV400
CVTRV402 EQU   CVTRV400
CVTRV401 EQU   CVTRV400
CVTICB   EQU   CVTXTNT2+48
CVTSKTA  EQU   CVTXTNT2+44
CVTRSV99 EQU   CVTXTNT2+40
CVTRSV98 EQU   CVTXTNT2+36
CVTRSV97 EQU   CVTXTNT2+34
CVTRSV96 EQU   CVTXTNT2+32
CVTOLTEP EQU   CVTXTNT2+28
CVTQIDA  EQU   CVTQID+1
CVTRSV95 EQU   CVTQID
CVTRSV94 EQU   CVTXTNT2+20
CVTRSV93 EQU   CVTXTNT2+16
CVTRSV92 EQU   CVTXTNT2+12
CVTDEBVR EQU   CVTXTNT2+8
CVTRSV91 EQU   CVTXTNT2+6
CVTRSV9H EQU   CVTFLGBT
CVTRSV9G EQU   CVTFLGBT
CVTRSV9F EQU   CVTFLGBT
CVTRSV9E EQU   CVTFLGBT
CVTRSV9D EQU   CVTFLGBT
CVTRSV9C EQU   CVTFLGBT
CVTVME   EQU   CVTFLGBT
CVTNPE   EQU   CVTFLGBT
CVTNUCLS EQU   CVTXTNT2+4
CVTDSSVA EQU   CVTDSSV+1
CVTRSV89 EQU   CVTDSSV
CVTRSV88 EQU   CVTXTNT1+8
CVTRSV87 EQU   CVTXTNT1+4
CVTFACHN EQU   CVTXTNT1
CVTRV488 EQU   CVTMAP+412
CVTRV487 EQU   CVTMAP+408
CVTRV486 EQU   CVTMAP+404
CVTRV485 EQU   CVTMAP+400
CVTACTAP EQU   CVTMAP+396
CVTAUTH  EQU   CVTMAP+392
CVTATMCA EQU   CVTATMCT+1
CVTATMST EQU   CVTATMCT
CVTRSV61 EQU   CVTMAP+384
CVTVOLT1 EQU   CVTVOLM1+1
CVTVOLI1 EQU   CVTVOLF1
CVTSTOA  EQU   CVTMAP+376
CVTRSV58 EQU   CVTMAP+374
CVTRSV57 EQU   CVTMAP+372
CVTDDCE  EQU   CVTMAP+368
CVTPNWFR EQU   CVTMAP+364
CVTSMF   EQU   CVTMAP+360
CVTSULK  EQU   CVTMAP+358
CVTSLKO  EQU   CVTSYSK
CVTSLKP  EQU   CVTSYSK
CVTSLKQ  EQU   CVTSYSK
CVTSLKR  EQU   CVTSYSK
CVTRSV56 EQU   CVTSYSK
CVTRSV55 EQU   CVTSYSK
CVTRSV54 EQU   CVTSYSK
CVTRSV53 EQU   CVTSYSK
CVTRSV52 EQU   CVTA1F1
CVTRSV51 EQU   CVTA1F1
CVTRSV50 EQU   CVTA1F1
CVTRSV49 EQU   CVTA1F1
CVTRSV48 EQU   CVTA1F1
CVTRSV47 EQU   CVTA1F1
CVTSRSW  EQU   CVTA1F1
CVTPFSW  EQU   CVTA1F1
CVTPCVT  EQU   CVTMAP+352
CVTRSV46 EQU   CVTMAP+344
CVTRSV45 EQU   CVTMAP+340
CVTRSV44 EQU   CVTMAP+338
CVTRSV43 EQU   CVTMAP+336
CVTHJESA EQU   CVTHJES+1
CVTRSV42 EQU   CVTHJES
CVTEXT2A EQU   CVTEXT2+1
CVTRSV41 EQU   CVTEXT2
CVTAPFA  EQU   CVTAPF+1
CVTRSV40 EQU   CVTAPF
CVTRV518 EQU   CVTINTLA
CVTRV517 EQU   CVTERPV
CVTEORM  EQU   CVTMAP+312
CVTMCHPR EQU   CVTMAP+308
CVTTZ    EQU   CVTMAP+304
CVTJEPS  EQU   CVTMAP+300
CVTJESCT EQU   CVTMAP+296
CVTMODE  EQU   CVTMAP+292
CVTPTRV  EQU   CVTMAP+288
CVTREAL  EQU   CVTMAP+284
CVTRSV39 EQU   CVTMAP+280
CVTRSV38 EQU   CVTMAP+276
CVTDMSRA EQU   CVTDMSR+1
CVTRV634 EQU   CVTDMSRF
CVTRV633 EQU   CVTDMSRF
CVTRV632 EQU   CVTDMSRF
CVTRV631 EQU   CVTDMSRF
CVTRV630 EQU   CVTDMSRF
CVTRV629 EQU   CVTDMSRF
CVTUDUMP EQU   CVTDMSRF
CVTSDUMP EQU   CVTDMSRF
CVTQMSGA EQU   CVTQMSG+1
CVTRSV36 EQU   CVTQMSG
CVTAMFF  EQU   CVTMAP+264
CVTPURGA EQU   CVTPURG+1
CVTRSV35 EQU   CVTPURG
CVTCBSP  EQU   CVTMAP+256
CVTATERA EQU   CVTATER+1
CVTSYST  EQU   CVTATER
CVTVOLT2 EQU   CVTTAT
CVTVOLI2 EQU   CVTVOLF2
CVTAQAVB EQU   CVTAQAVT+1
CVTRSV34 EQU   CVTTCMFG
CVTRSV33 EQU   CVTTCMFG
CVTRSV32 EQU   CVTTCMFG
CVTRSV31 EQU   CVTTCMFG
CVTRSV30 EQU   CVTTCMFG
CVTRSV29 EQU   CVTTCMFG
CVTLDEV  EQU   CVTTCMFG
CVTTCRDY EQU   CVTTCMFG
CVTGTFA  EQU   CVTGTF+1
CVTRSV27 EQU   CVTGTFST
CVTRNIO  EQU   CVTGTFST
CVTUSR   EQU   CVTGTFST
CVTRV318 EQU   CVTFORM
CVTRV317 EQU   CVTTMODE
CVTRV316 EQU   CVTSTATE
CVTRV315 EQU   CVTGTFS
CVTGTFAV EQU   CVTGTFS
CVT0SCR1 EQU   CVTMAP+232
CVTRV515 EQU   CVTMAP+228
CVTRMS   EQU   CVTMAP+224
CVTPATCH EQU   CVTMAP+220
CVTTSCE  EQU   CVTMAP+216
CVTLNKSC EQU   CVTMAP+214
CVTQABST EQU   CVTMAP+212
CVTMDLDS EQU   CVTMAP+208
CVTUSER  EQU   CVTMAP+204
CVTABEND EQU   CVTMAP+200
CVTSMCA  EQU   CVTMAP+196
CVTRSV18 EQU   CVTMAP+192
CVTQLPAQ EQU   CVTMAP+188
CVTQCDSR EQU   CVTMAP+184
CVTRSV17 EQU   CVTOPTB
CVTRSV16 EQU   CVTOPTB
CVTFP    EQU   CVTOPTB
CVTAPTHR EQU   CVTOPTB
CVTNLOG  EQU   CVTOPTB
CVTTOD   EQU   CVTOPTB
CVTCTIMS EQU   CVTOPTB
CVTPROT  EQU   CVTOPTB
CVTXPFP  EQU   CVTOPTA
CVTASCII EQU   CVTOPTA
CVTRSV13 EQU   CVTOPTA
CVTRSV12 EQU   CVTOPTA
CVTNIP   EQU   CVTOPTA
CVTDDR   EQU   CVTOPTA
CVTAPR   EQU   CVTOPTA
CVTCCH   EQU   CVTOPTA
CVTSNCTR EQU   CVTMAP+180
CVTQMWR  EQU   CVTMAP+176
CVTQOCR  EQU   CVTMAP+172
CVT1EF00 EQU   CVTMAP+168
CVTMZ00  EQU   CVTMAP+164
CVTSV76Q EQU   CVTSV76C
CVTRSV11 EQU   CVTMAP+156
CVT0PT01 EQU   CVTMAP+152
CVTMSER  EQU   CVTMAP+148
CVTRV516 EQU   CVTIERLC
CVTILCH  EQU   CVTMAP+140
CVT0DS   EQU   CVTMAP+136
CVTFBOSV EQU   CVTMAP+132
CVTNUCB  EQU   CVTMAP+128
CVTIXAVL EQU   CVTMAP+124
CVTSV76M EQU   CVTIOQET
CVTDCBA  EQU   CVTMAP+117
CVTMVS2  EQU   CVTDCB
CVT6DAT  EQU   CVTDCB
CVT4MPS  EQU   CVTDCB
CVTRSV09 EQU   CVTDCB
CVT4MS1  EQU   CVTDCB
CVT2SPS  EQU   CVTDCB
CVT1SSS  EQU   CVTDCB
CVTRSV08 EQU   CVTDCB
CVTSTB   EQU   CVTMAP+112
CVTQTD00 EQU   CVTMAP+108
CVTQTE00 EQU   CVTMAP+104
CVTCUCB  EQU   CVTMAP+100
CVTSJQ   EQU   CVTMAP+96
CVTPBLDL EQU   CVTMAP+92
CVTTPC   EQU   CVTMAP+88
CVTSVDCB EQU   CVTMAP+84
CVTBRET  EQU   CVTMAP+82
CVTEXIT  EQU   CVTMAP+80
CVT0FN00 EQU   CVTMAP+76
CVTDARA  EQU   CVTDAR+1
CVTRSV07 EQU   CVTFLGS1
CVTRSV06 EQU   CVTFLGS1
CVTRSV05 EQU   CVTFLGS1
CVTRSV04 EQU   CVTFLGS1
CVTRSV03 EQU   CVTFLGS1
CVTRSV02 EQU   CVTFLGS1
CVTRSV01 EQU   CVTFLGS1
CVTDMPLK EQU   CVTFLGS1
CVTXITP  EQU   CVTMAP+68
CVTZDTAB EQU   CVTMAP+64
CVTMSLT  EQU   CVTMAP+60
CVTDATE  EQU   CVTMAP+56
CVTBTERM EQU   CVTMAP+52
CVTSYSAD EQU   CVTMAP+48
CVTXTLER EQU   CVTMAP+44
CVTILK2  EQU   CVTMAP+40
CVTILK1  EQU   CVTMAP+36
CVTPRLTV EQU   CVTMAP+32
CVTPCNVT EQU   CVTMAP+28
CVT0VL00 EQU   CVTMAP+24
CVTXAPG  EQU   CVTMAP+20
CVTBUF   EQU   CVTMAP+16
CVTJOB   EQU   CVTMAP+12
CVTLINK  EQU   CVTMAP+8
CVT0EF00 EQU   CVTMAP+4
CVTTCBP  EQU   CVTMAP
CVT      EQU   CVTMAP
APSVWORK EQU   APSV+80
@NM00072 EQU   APSV+80
APSVFREE EQU   APSV+76
APSVAPSM EQU   APSV+72
APSVRG12 EQU   APSVREGS+56
APSVRG11 EQU   APSVREGS+52
APSVRG10 EQU   APSVREGS+48
APSVRG9  EQU   APSVREGS+44
APSVRG8  EQU   APSVREGS+40
APSVRG7  EQU   APSVREGS+36
APSVRG6  EQU   APSVREGS+32
APSVRG5  EQU   APSVREGS+28
APSVRG4  EQU   APSVREGS+24
APSVRG3  EQU   APSVREGS+20
APSVRG2  EQU   APSVREGS+16
APSVRG1  EQU   APSVREGS+12
APSVRG0  EQU   APSVREGS+8
APSVRG15 EQU   APSVREGS+4
APSVRG14 EQU   APSVREGS
APSVNEXT EQU   APSV+8
APSVPREV EQU   APSV+4
APSVAPSC EQU   APSV
@NM00071 EQU   APUB+120
@NM00070 EQU   APUB+112
APUBJBNM EQU   APUB+104
APUBSIZE EQU   APUB+102
APUBRSVD EQU   APUB+100
APUBASCB EQU   APUBDCB
@NM00069 EQU   APUBIOFG+4
@NM00068 EQU   APUBIOF3
APUBISHR EQU   APUBIOF3
APUBIRIP EQU   APUBIOF3
@NM00067 EQU   APUBIOF2
APUBIEXC EQU   APUBIOF2
@NM00066 EQU   APUBIOF1
APUBIIPL EQU   APUBIOF1
APUBIERR EQU   APUBIOF1
@NM00065 EQU   APUBIOF0
APUBICNL EQU   APUBIOF0
APUBINRG EQU   APUBIOF0
APUBIDAB EQU   APUBIOF0
APUBIDWN EQU   APUBIOF0
@NM00064 EQU   APUB+85
@NM00063 EQU   APUBSTAT
APUBQISC EQU   APUBSTAT
APUBPDMP EQU   APUBSTAT
APUBFDMP EQU   APUBSTAT
APUBRIPL EQU   APUBSTAT
@NM00062 EQU   APUBALF3
APUBSCAL EQU   APUBALF3
APUBSCAV EQU   APUBALF3
@NM00061 EQU   APUBALF2
@NM00060 EQU   APUBALF1
APUBUNLP EQU   APUBALF1
APUBDSBP EQU   APUBALF1
APUBBERR EQU   APUBALF1
APUBUNLD EQU   APUBALF1
APUBDSBL EQU   APUBALF1
APUBZRGN EQU   APUBALF1
@NM00059 EQU   APUBALF0
APUBSBCH EQU   APUBALF0
APUBCPU  EQU   APUB+78
APUBINIT EQU   APUB+76
APUBIPL  EQU   APUB+74
APUBERRJ EQU   APUBERRS+20
APUBERRD EQU   APUBERRS+18
APUBERRC EQU   APUBERRS+16
APUBERRB EQU   APUBERRS+14
APUBERRA EQU   APUBERRS+12
APUBERR9 EQU   APUBERRS+10
APUBERR3 EQU   APUBERRS+8
APUBERR2 EQU   APUBERRS+6
APUBERR1 EQU   APUBERRS+4
APUBERR0 EQU   APUBERRS+2
@NM00058 EQU   APUBERRS
@NM00057 EQU   APUB+50
APUBERRT EQU   APUB+44
APUBMSTP EQU   APUB+40
APUBUBAP EQU   APUB+36
APUBIOCT EQU   APUB+24
APUBAPCT EQU   APUB+20
APUBUSER EQU   APUB+16
APUBID   EQU   APUB
@NM00056 EQU   APDS+144
@NM00055 EQU   APDS+100
APDSAPEP EQU   APDS+96
@NM00054 EQU   APDS+94
APDSSIZE EQU   APDS+92
APDSJBNM EQU   APDS+84
APDSITCB EQU   APDS+80
APDSMSK  EQU   APDS+72
@NM00053 EQU   APDS+69
APDSIOFS EQU   APDS+68
APDSDUMP EQU   APDS+67
APDSPGFX EQU   APDS+66
@NM00052 EQU   APDSFLG1
APDSFRST EQU   APDSFLG1
APDSLSR  EQU   APDSFLG0
APDSVPER EQU   APDSFLG0
APDSVLER EQU   APDSFLG0
APDSTPGM EQU   APDSFLG0
APDSDSAP EQU   APDS+60
APDSPERR EQU   APDS+40
APDSLERR EQU   APDS+32
APDSDDNM EQU   APDS+24
APDSDEB  EQU   APDSTD+4
APDSTCB  EQU   APDSTD
APDSAPCT EQU   APDS+12
APDSUSER EQU   APDS+8
APDSID   EQU   APDS
@NM00036 EQU   APCT+1556
APCTSVCT EQU   APCT+1552
APCTDAVT EQU   APCT+1548
APCTLOGL EQU   APCT+1544
@NM00035 EQU   APCT+1540
APCTDMPU EQU   APCT+1536
APCTDMPM EQU   APCT+1532
APCTNDMP EQU   APCT+1530
APCTASID EQU   APCT+1528
APCTLGPG EQU   APCT+1526
APCTLGLN EQU   APCT+1524
APCTAPVU EQU   APCT+1520
APCTABR  EQU   APCT+1116
APCTACTR EQU   APCT+1112
APCTLOGD EQU   APCT+1108
APCTDCLD EQU   APCT+1104
APCTIOAP EQU   APCT+1100
@NM00034 EQU   APCT+1080
@NM00033 EQU   APCT+1078
APCTKCAX EQU   APCT+1076
APCTABND EQU   APCT+1072
@NM00032 EQU   APCT+1068
APCTAPIO EQU   APCT+1064
APCTCSCT EQU   APCT+1060
APCTSTDF EQU   APCT+1056
APCTSTMX EQU   APCT+1052
APCTRGMX EQU   APCT+1048
APCTSIZE EQU   APCT+1046
APCTCTUB EQU   APCT+1045
APCTMFID EQU   APCT+1044
APCTMFSZ EQU   APCT+1040
APCTCRTN EQU   APCT+1036
APCTAPCP EQU   APCT+1032
APCTAMNA EQU   APCT+1028
APCTEMNA EQU   APCT+1024
APCTAALP EQU   APCT+1020
APCTEALP EQU   APCT+1016
@NM00031 EQU   APCT+1012
@NM00030 EQU   APCT+1008
@NM00029 EQU   APCT+1004
APCTEIPL EQU   APCT+1000
@NM00028 EQU   APCT+996
@NM00027 EQU   APCT+992
@NM00026 EQU   APCT+988
@NM00025 EQU   APCT+984
@NM00024 EQU   APCT+980
APCTECPW EQU   APCT+976
APCTEULD EQU   APCT+972
APCTECPT EQU   APCT+968
APCTEALC EQU   APCT+964
APCTECBL EQU   APCT+960
APCTECIT EQU   APCT+956
APCTCQAF EQU   APCTCQAQ
APCTCQL  EQU   APCTAPCQ+4
APCTCQF  EQU   APCTAPCQ
APCTCQLK EQU   APCT+940
@NM00023 EQU   @NM00019+2
@NM00022 EQU   APCTPRSW
APCTAPST EQU   APCTPRSW
@NM00021 EQU   APCTPRSW
@NM00020 EQU   APCTSTAT
APCTWARM EQU   APCTSTAT
APCTTERM EQU   APCTSTAT
APCTHALT EQU   APCTSTAT
APCTQSCE EQU   APCTSTAT
APCTSTRT EQU   APCTSTAT
APCTACT  EQU   APCTSTAT
APCTVUNX EQU   APCT+935
APCTSOUT EQU   APCT+934
APCTDAID EQU   APCT+933
APCTSV34 EQU   APCT+932
APCTMJOB EQU   APCT+928
APCTTCB  EQU   APCT+924
APCTASCB EQU   APCT+920
APCTDCNW EQU   APCT+918
APCTDCNR EQU   APCT+916
@NM00018 EQU   APCT+912
@NM00017 EQU   APCT+908
@NM00016 EQU   APCT+904
@NM00015 EQU   APCT+900
@NM00014 EQU   APCTERRS+22
APCTERTJ EQU   APCTERRS+20
APCTERTD EQU   APCTERRS+18
APCTERTC EQU   APCTERRS+16
APCTERTB EQU   APCTERRS+14
APCTERTA EQU   APCTERRS+12
APCTERT9 EQU   APCTERRS+10
APCTERT3 EQU   APCTERRS+8
APCTERT2 EQU   APCTERRS+6
APCTERT1 EQU   APCTERRS+4
APCTERT0 EQU   APCTERRS+2
APCTERTT EQU   APCTERRS
APCTDSAP EQU   APCT+872
APCTISUB EQU   APCT+868
APCTUBAP EQU   APCT+864
APCTUBIC EQU   APCT+856
APCTAPUB EQU   APCT+848
APCTUBLK EQU   APCT+844
APCTBR1A EQU   APCTBR14+2
@NM00013 EQU   APCTBR14
APCTSMSZ EQU   APCTSMAD+2
@NM00012 EQU   APCTSMAD+1
@NM00011 EQU   APCTSMAD
APCTSMIS EQU   APCTSMIN+2
@NM00010 EQU   APCTSMIN+1
APCTSMSP EQU   APCTSMIN
@NM00009 EQU   APCT+30
APCTLINE EQU   APCT+28
APCTLBSZ EQU   APCT+24
APCTREG  EQU   APCT+20
APCTSSID EQU   APCTENQM+4
@NM00008 EQU   APCTENQM
APCTSSVT EQU   APCT+8
APCTUSER EQU   APCT+4
APCTID   EQU   APCT
@NM00007 EQU   APAW+68
LASTARB  EQU   APAW+64
ALLMSGID EQU   APAW+60
BSRTOT   EQU   APAW+56
NUMIER   EQU   APAW+54
NPNTOT   EQU   APAW+52
EXITINF3 EQU   EXITINFO+3
EXITINF2 EQU   EXITINFO+2
@NM00006 EQU   EXITINF1
EXITHOLD EQU   EXITINF1
EXITCANC EQU   EXITINF1
EXITCOMM EQU   EXITINF1
EXITREJ  EQU   EXITINF1
@NM00005 EQU   EXITINF0
EXITRCON EQU   EXITINF0
EXITENRQ EQU   EXITINF0
EXITALOK EQU   EXITINF0
EXITIMPS EQU   EXITINF0
EXITIMPP EQU   EXITINF0
@NM00004 EQU   APAW+46
BSAVAIL  EQU   APAW+44
BSUNLD   EQU   APAW+42
USCAVAIL EQU   APAW+40
USCUNLD  EQU   APAW+38
NUMNTSAT EQU   APAW+36
ACNCLECB EQU   APAW+28
ALLOCNTR EQU   APAW+24
@NM00003 EQU   APAW+21
ALLENQRC EQU   APAW+20
INITTCB  EQU   APAW+16
ALLCWAIT EQU   ALLRSRCE
ALLSTART EQU   ALLRSRCE
ALLAPUB  EQU   ALLRSRCE
ALLALL   EQU   ALLRSRCE
ALLSER   EQU   ALLRSRCE
@NM00002 EQU   ALLSTAT3
ALLQUE2  EQU   ALLSTAT2
ALLERRN2 EQU   ALLSTAT2
ALLMLWTO EQU   ALLSTAT2
ALLQRMV  EQU   ALLSTAT2
ALLQADD  EQU   ALLSTAT2
ALLQUE   EQU   ALLSTAT2
ALLDYN   EQU   ALLSTAT2
@NM00001 EQU   ALLSTAT1
ALLMARK  EQU   ALLSTAT1
ALLHOLD  EQU   ALLSTAT1
ALLNLAA  EQU   ALLSTAT1
ALLAPDS  EQU   ALLSTAT0
ALLERREN EQU   ALLSTAT0
ALLRQVAL EQU   ALLSTAT0
ALLMONWT EQU   ALLSTAT0
ALLJCLOK EQU   ALLSTAT0
ALLMONUP EQU   ALLSTAT0
ALLWAIT  EQU   ALLSTAT0
@NM00104 EQU   PSA+3668
PSASTAK  EQU   PSA+3072
@NM00103 EQU   PSA+1048
PSAUSEND EQU   PSA+1048
PSARV062 EQU   PSA+1044
PSACDAL  EQU   PSA+1040
PSAWTCOD EQU   PSA+1036
PSAATCVT EQU   PSA+1032
PSAPCPSW EQU   PSA+1024
PSAPIR2  EQU   PSA+1020
PSARV059 EQU   PSA+1018
PSASVC13 EQU   PSA+1016
PSALSFCC EQU   PSA+1012
PSASFACC EQU   PSA+1008
PSASTOP  EQU   PSA+992
PSASTART EQU   PSA+976
PSARSPSW EQU   PSA+968
PSASRPSW EQU   PSA+960
PSARV045 EQU   PSA+892
PSARV044 EQU   PSA+888
PSARV043 EQU   PSA+884
PSARV042 EQU   PSA+880
PSARV041 EQU   PSA+876
PSARV040 EQU   PSA+872
PSARV025 EQU   PSA+868
PSADSSED EQU   PSA+868
PSADSSPR EQU   PSA+864
PSADSSFW EQU   PSA+860
PSADSS14 EQU   PSA+856
PSADSSPP EQU   PSA+848
PSADSSRP EQU   PSA+840
PSADSS05 EQU   PSADSSF4
PSADSS10 EQU   PSADSSF4
PSADSSVE EQU   PSADSSF4
PSADSSDE EQU   PSADSSF4
PSADSSC0 EQU   PSADSSF4
PSADSSIE EQU   PSADSSF4
PSADSS12 EQU   PSADSSF4
PSADSSRC EQU   PSADSSF4
PSARV057 EQU   PSADSSF3
PSARV056 EQU   PSADSSF3
PSARV055 EQU   PSADSSF3
PSADSSMC EQU   PSADSSF3
PSADSSRW EQU   PSADSSF3
PSADSSNM EQU   PSADSSF3
PSADSSES EQU   PSADSSF3
PSADSSGP EQU   PSADSSF3
PSADSSF2 EQU   PSADSSFL+1
PSADSSPI EQU   PSADSSF1
PSADSSOI EQU   PSADSSF1
PSADSSSP EQU   PSADSSF1
PSADSSTP EQU   PSADSSF1
PSADSSDW EQU   PSADSSF1
PSADSSDD EQU   PSADSSF1
PSADSSDM EQU   PSADSSF1
PSADSSMV EQU   PSADSSF1
PSADSSTS EQU   PSA+816
PSADSSWK EQU   PSA+812
PSADSSR3 EQU   PSA+808
PSADSSR2 EQU   PSA+804
PSADSSRS EQU   PSA+800
PSASTOR  EQU   PSA+796
PSACPUSA EQU   PSA+794
PSAVSTAP EQU   PSA+792
PSAWKVAP EQU   PSA+788
PSAWKRAP EQU   PSA+784
PSAMCHIC EQU   PSA+783
PSARV061 EQU   PSA+782
PSASYMSK EQU   PSA+781
PSAMCHFL EQU   PSA+780
PSACR0   EQU   PSA+776
PSAPSWSV EQU   PSA+768
PSALITA  EQU   PSA+764
PSACLHS  EQU   PSAHLHI
PSALKR15 EQU   PSALKSA+60
PSALKR14 EQU   PSALKSA+56
PSALKR13 EQU   PSALKSA+52
PSALKR12 EQU   PSALKSA+48
PSALKR11 EQU   PSALKSA+44
PSALKR10 EQU   PSALKSA+40
PSALKR9  EQU   PSALKSA+36
PSALKR8  EQU   PSALKSA+32
PSALKR7  EQU   PSALKSA+28
PSALKR6  EQU   PSALKSA+24
PSALKR5  EQU   PSALKSA+20
PSALKR4  EQU   PSALKSA+16
PSALKR3  EQU   PSALKSA+12
PSALKR2  EQU   PSALKSA+8
PSALKR1  EQU   PSALKSA+4
PSALKR0  EQU   PSALKSA
PSARV023 EQU   PSACLHT+52
PSALOCAL EQU   PSACLHT+48
PSACMSL  EQU   PSACLHT+44
PSAOPTL  EQU   PSACLHT+40
PSATPACL EQU   PSACLHT+36
PSATPDNL EQU   PSACLHT+32
PSATPNCL EQU   PSACLHT+28
PSAIOSLL EQU   PSACLHT+24
PSAIOSUL EQU   PSACLHT+20
PSAIOSCL EQU   PSACLHT+16
PSAIOSSL EQU   PSACLHT+12
PSASALCL EQU   PSACLHT+8
PSAASML  EQU   PSACLHT+4
PSADISPL EQU   PSACLHT
PSASRSA  EQU   PSA+636
PSARV050 EQU   PSA+634
PSADSSGO EQU   PSA+633
PSARECUR EQU   PSA+632
PSAHLHIS EQU   PSA+628
PSAIPCSA EQU   PSA+624
@NM00102 EQU   PSA+621
PSAIPCDM EQU   PSA+620
PSAIPCD  EQU   PSA+616
@NM00101 EQU   PSA+613
PSAIPCRM EQU   PSA+612
PSAIPCR  EQU   PSA+608
PSAMCHEX EQU   PSA+600
PSAMPSW  EQU   PSA+592
PSAEXPS2 EQU   PSA+584
PSAEXPS1 EQU   PSA+576
PSAPIREG EQU   PSA+572
PSARSREG EQU   PSA+568
PSAGPREG EQU   PSA+556
PSARV022 EQU   PSASUP4
PSARV021 EQU   PSASUP4
PSARV020 EQU   PSASUP4
PSARV019 EQU   PSASUP4
PSARV018 EQU   PSASUP4
PSARV017 EQU   PSASUP4
PSARV016 EQU   PSASUP4
PSARV015 EQU   PSASUP4
PSARV014 EQU   PSASUP3
PSARV013 EQU   PSASUP3
PSARV012 EQU   PSASUP3
PSAESTA  EQU   PSASUP3
PSASPR   EQU   PSASUP3
PSAPSREG EQU   PSASUP3
PSAPI2   EQU   PSASUP3
PSAIOSUP EQU   PSASUP3
PSALCR   EQU   PSASUP2
PSARTM   EQU   PSASUP2
PSAACR   EQU   PSASUP2
PSAIPCE2 EQU   PSASUP2
PSAIPCES EQU   PSASUP2
PSAIPCEC EQU   PSASUP2
PSAGTF   EQU   PSASUP2
PSAIPCRI EQU   PSASUP2
PSATYPE6 EQU   PSASUP1
PSATCTL  EQU   PSASUP1
PSADISP  EQU   PSASUP1
PSALOCK  EQU   PSASUP1
PSAPI    EQU   PSASUP1
PSAEXT   EQU   PSASUP1
PSASVC   EQU   PSASUP1
PSAIO    EQU   PSASUP1
PSAAOLD  EQU   PSA+548
PSAANEW  EQU   PSA+544
PSATOLD  EQU   PSA+540
PSATNEW  EQU   PSA+536
PSALCCAR EQU   PSA+532
PSALCCAV EQU   PSA+528
PSAPCCAR EQU   PSA+524
PSAPCCAV EQU   PSA+520
PSACPULA EQU   PSA+518
PSACPUPA EQU   PSA+516
PSAPSA   EQU   PSA+512
FLCHDEND EQU   PSA+512
FLCCRSAV EQU   FLCMCLA+280
FLCGRSAV EQU   FLCMCLA+216
FLCFPSAV EQU   FLCMCLA+184
FLCFLA   EQU   FLCMCLA+88
FLCRGNCD EQU   FLCMCLA+84
FLCFSAA  EQU   FLCFSA+1
@NM00100 EQU   FLCFSA
@NM00099 EQU   FLCMCLA+72
FLCMCIC  EQU   FLCMCLA+64
@NM00098 EQU   FLCMCLA+20
FLCIOAA  EQU   FLCIOA+1
@NM00097 EQU   FLCIOA
@NM00096 EQU   FLCMCLA+15
@NM00095 EQU   FLCMCLA+14
@NM00094 EQU   FLCMCLA+12
FLCLCL   EQU   FLCMCLA+8
FLCIOELA EQU   FLCIOEL+1
@NM00093 EQU   FLCIOEL
FLCCHNID EQU   FLCMCLA
@NM00092 EQU   PSA+160
FLCMTRCD EQU   PSA+157
@NM00091 EQU   PSA+156
FLCPERA  EQU   FLCPER+1
@NM00090 EQU   FLCPER
@NM00089 EQU   PSA+151
FLCPERCD EQU   PSA+150
FLCMCNUM EQU   PSA+149
@NM00088 EQU   PSA+148
FLCTEAA  EQU   FLCTEA+1
@NM00087 EQU   FLCTEA
PSAPIPC  EQU   PSAPICOD
PSAPIMC  EQU   PSAPICOD
PSAPIPER EQU   PSAPICOD
PSARV049 EQU   FLCPICOD
FLCPILCB EQU   FLCPIILC
@NM00086 EQU   FLCPIILC
@NM00085 EQU   PSAEPPSW
FLCSVCN  EQU   PSAESPSW+2
FLCSILCB EQU   FLCSVILC
@NM00084 EQU   FLCSVILC
@NM00083 EQU   PSAESPSW
FLCEICOD EQU   PSAEEPSW+2
PSASPAD  EQU   PSAEEPSW
@NM00082 EQU   PSA+128
FLCINPSW EQU   PSA+120
FLCMNPSW EQU   PSA+112
FLCPNPSW EQU   PSA+104
FLCSNPSW EQU   PSA+96
FLCENPSW EQU   PSA+88
FLCTRACE EQU   PSA+84
FLCTIMER EQU   PSA+80
FLCCVT2  EQU   PSA+76
FLCCAW   EQU   PSA+72
FLCCSW   EQU   PSA+64
FLCIOPSW EQU   PSA+56
FLCMOPSW EQU   PSA+48
FLCPOPSW EQU   PSA+40
FLCSOPSW EQU   PSA+32
FLCEOPSW EQU   PSA+24
@NM00081 EQU   FLCICCW2+4
FLCICCW1 EQU   FLCROPSW
FLCIPPSW EQU   FLCRNPSW
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS
@RC00145 EQU   @RC00144
@RC00275 EQU   @RC00274
@RF00225 EQU   ENDTEST
@RF00224 EQU   ENDTEST
@RT00263 EQU   ENDTEST
@RF00269 EQU   ENDTEST
@RC00302 EQU   @RC00301
@RC00336 EQU   @RC00335
@RT00324 EQU   ENDTEST
@RF00330 EQU   ENDTEST
@ENDDATA EQU   *
         END   IGTJHC,(C'PLS2351',0701,77230)
