IEFVGM5  CSECT
*             THIS MODULE CONTAINS THE MESSAGES FOR THE INTERPRETER
*             NUMBERED  20  THRU  27
*             IDENTIFICATION NUMBERS    IEF632I  THRU  IEF639I
************BY IEFVJA,IEFVEA
M50      EQU   *
         DC    X'20'
         DC    AL1(M51-M50-2)
         DC    C'IEF632I '
         DC    C'FORMAT ERROR'
************BY IEFVJA
M51      EQU   *
         DC    X'21'
         DC    AL1(M52-M51-2)
         DC    C'IEF633I '
         DC    C'PROGRAMMER NAME MISSING'
************BY IEFVJA
M52      EQU   *
         DC    X'22'
         DC    AL1(M53-M52-2)
         DC    C'IEF634I '
         DC    C'ACCOUNT NUMBER MISSING'
************BY IEFVJA
M53      EQU   *
         DC    X'23'
         DC    AL1(M54-M53-2)
         DC    C'IEF635I '
         DC    C'JOBNAME MISSING'
************BY IEFVDA
M54      EQU   *
         DC    X'24'
         DC    AL1(M55-M54-2)
         DC    C'IEF636I '
         DC    C'MISPLACED JOBLIB '
         DC    C'STATEMENT'
************BY IEFVJA,IEFVEA
M55      EQU   *
         DC    X'25'
         DC    AL1(M56-M55-2)
         DC    C'IEF637I '
         DC    C'EXCESSIVE ACCOUNT '
         DC    C'FIELD LENGTH'
************BY IEFVGT,IEFVEA
M56      EQU   *
         DC    X'26'
         DC    AL1(M57-M56-2)
         DC    C'IEF638I '
         DC    C'SPECIFIED NUMERIC EXCEEDS '                       0725
         DC    C'MAXIMUM ALLOWED'
************BY IEFVGT
M57      EQU   *
         DC    X'27'
         DC    AL1(MEE-M57-2)
         DC    C'IEF639I '
         DC    C'INVALID CLASS DESIGNATION'
MEE      DC    X'FF'               END OF MSG MODULE INDICATOR
         MODID BR=NO                                             Y01886
         END
