IEFVGM14 CSECT
*             THIS MODULE CONTAINS MESSAGES ASSOCIATED WITH THE
*             INTERPRETER KEYS                                    19874
*              ROLL OVERRIDE                                      19874
*              ROLL                                               19874
*              REGION OVERRIDE                                    19874
*              REGION                                             19874
*              PGM                                                19874
*              PROC                                               19874
*              ACCT OVERRIDE                                      19874
*              COND OVERRIDE                                      19874
         IEFVKEYS                                                 19874
M148     EQU   *
         DC    AL1(ROLLPEK)                                       19874
         DC    AL1(M149-M148-2)
         DC    C'IN THE ROLL OVERRIDE FIELD'
M149     EQU   *
         DC    AL1(ROLLEEK)                                       19874
         DC    AL1(M14A-M149-2)
         DC    C'IN THE ROLL FIELD'
M14A     EQU   *
         DC    AL1(REGINPEK)                                      19874
         DC    AL1(M14B-M14A-2)
         DC    C'IN THE REGION OVERRIDE FIELD '
M14B     EQU   *
         DC    AL1(REGINEEK)                                      19874
         DC    AL1(M14C-M14B-2)
         DC    C'IN THE REGION FIELD '
M14C     EQU   *
         DC    AL1(PGMEK)                                         19874
         DC    AL1(M14D-M14C-2)
         DC    C'IN THE PGM FIELD '
M14D     EQU   *
         DC    AL1(PROCEK)                                        19874
         DC    AL1(M14E-M14D-2)
         DC    C'IN THE PROC FIELD '
M14E     EQU   *
         DC    AL1(ACCTPEK)                                       19874
         DC    AL1(M14F-M14E-2)
         DC    C'IN THE ACCT OVERRIDE FIELD '
M14F     EQU   *
         DC    AL1(CONDPEK)                                       19874
         DC    AL1(MEE-M14F-2)
         DC    C'IN THE COND OVERRIDE FIELD '
MEE      DC    X'FF'
         MODID BR=NO                                             Y01886
         END
