IEFVGM12 CSECT
*             THIS MODULE CONTAINS MESSAGES ASSOCIATED WITH THE
*             INTERPRETER KEYS                                    19874
*              EROPT OF THE DCB FIELD                             19874
*              INTVL OF THE DCB FIELD                             19874
*              KEYLEN OF THE DCB FIELD                            19874
*              LIMCT OF THE DCB FIELD                             19874
*              LRECL OF THE DCB FIELD                             19874
*              MODE OF THE DCB FIELD                              19874
*              NCP OF THE DCB FIELD                               19874
*              NTM OF THE DCB FIELD                               19874
         IEFVKEYS                                                 19874
M120     EQU   *
         DC    AL1(EROPTMK)                                       19874
         DC    AL1(M121-M120-2)
         DC    C'IN THE EROPT SUBPARAMETER '
         DC    C'OF THE DCB FIELD '
M121     EQU   *
         DC    AL1(INTVLMK)                                       19874
         DC    AL1(M122-M121-2)
         DC    C'IN THE INTVL SUBPARAMETER '
         DC    C'OF THE DCB FIELD '
M122     EQU   *
         DC    AL1(KEYLENMK)                                      19874
         DC    AL1(M123-M122-2)
         DC    C'IN THE KEYLEN SUBPARAMETER '
         DC    C'OF THE DCB FIELD '
M123     EQU   *
         DC    AL1(LIMCTMK)                                       19874
         DC    AL1(M124-M123-2)
         DC    C'IN THE LIMCT SUBPARAMETER '
         DC    C'OF THE DCB FIELD '
M124     EQU   *
         DC    AL1(LRECLMK)                                       19874
         DC    AL1(M125-M124-2)
         DC    C'IN THE LRECL SUBPARAMETER '
         DC    C'OF THE DCB FIELD '
M125     EQU   *
         DC    AL1(MODEMK)                                        19874
         DC    AL1(M126-M125-2)
         DC    C'IN THE MODE SUBPARAMETER '
         DC    C'OF THE DCB FIELD '
M126     EQU   *
         DC    AL1(NCPMK)                                         19874
         DC    AL1(M127-M126-2)
         DC    C'IN THE NCP SUBPARAMETER '
         DC    C'OF THE DCB FIELD '
M127     EQU   *
         DC    AL1(NTMMK)                                         19874
         DC    AL1(MEE-M127-2)
         DC    C'IN THE NTM SUBPARAMETER '
         DC    C'OF THE DCB FIELD '
MEE      DC    X'FF'
         MODID BR=NO                                             Y01886
         END
