//WCMDWPD  JOB (UMTS,T109,1,9),TNA.WC.MDW,CLASS=E
/*JOBPARM P=PROC03
// EXEC CSDACL,M=UVPD,RENT=',RENT'
//LKED.SYSIN DD *
 ALIAS PDS
 NAME UVPD(R)
/*
