//CBTPLIL  PROC MBR=,
//         NODE=CBT,
//         OPTION=NULL,
//         TASK=BASE,
//         APARM=,
//         LPARM=,
//         ALIB1='N9999.NULL.MACLIB',
//         ALIB2='N9999.NULL.MACLIB',
//         LLIB1='N9999.NULL.LOAD',
//         LLIB2='N9999.NULL.LOAD'
//*
//* PROC   - CBTPLIL
//* REF    - SYS3.PROCLIB
//* USE    - COMPILE PLI PROGRAMS
//*
//A        EXEC PGM=IEL0AA,
//         PARM='OBJECT,NODECK,LINECOUNT(60),&APARM'
//STEPLIB  DD  DSN=PLI.R4M0.LINKLIB,DISP=SHR
//SYSPRINT DD  SYSOUT=*
//SYSIN    DD  DSN=N9999.&NODE..ASM(&OPTION),DISP=SHR OPTION MEMBER
//         DD  DSN=N9999.&NODE..ASM(&MBR),DISP=SHR    SOURCE LIBRARY
//SYSLIB   DD  DSN=&ALIB1,DISP=SHR
//         DD  DSN=&ALIB2,DISP=SHR
//         DD  DSN=N9999.&NODE..MACLIB,DISP=SHR
//SYSUT1   DD  DSN=&&SYSUT1,UNIT=SYSDA,
//         SPACE=(1024,(200,50),,CONTIG,ROUND),DCB=BLKSIZE=1024
//SYSLIN   DD  DSN=N9999.&NODE..OBJ(&MBR),DISP=OLD
//*
//L        EXEC PGM=IEWL,
//         PARM='XREF,LET,LIST,MAP,&LPARM',
//         COND=(9,LT,A)
//SYSLIB   DD  DSN=&LLIB1,DISP=SHR
//         DD  DSN=&LLIB2,DISP=SHR
//         DD  DSN=PLI.R4M0.PLI&TASK,DISP=SHR
//         DD  DSN=SYS1.PLIBASE,DISP=SHR
//         DD  DSN=N9999.&NODE..LOAD,DISP=SHR
//SYSLMOD  DD  DSN=N9999.&NODE..LOAD(&MBR),DISP=SHR
//SYSUT1   DD  DSN=&&SYSUT1,UNIT=SYSDA,
//             SPACE=(1024,(200,50),,CONTIG,ROUND),DCB=BLKSIZE=1024
//SYSPRINT DD  SYSOUT=*
//SYSLIN   DD  DSN=N9999.&NODE..OBJ(&MBR),DISP=SHR
//         DD  DDNAME=SYSIN
//*
