//N9999SPY  JOB  (TS0N9999),'RICHARD RODGERS',
//          MSGCLASS=P,NOTIFY=N9999,CLASS=P
/*JOBPARM   ROOM=TECH
//*
//SPY       EXEC CBTASML,MBR=SPY,
//          NODE=SP3,
//          ALIB1='N9999.JBB1326.APVTMACS',
//          APARM='TEST',
//          LPARM='TEST',
//          PRINT=GEN
//*
//* JBB1326.APVTMACS IS PART OF THE OPTIONAL MATERIAL
//* FOR MVS SP 1.3.0 AND MUST BE OBTAINED FROM IBM.
//*
