//N9999ENQ  JOB  (TS0N9999),'RICHARD RODGERS',
//          MSGCLASS=P,NOTIFY=N9999,CLASS=P
/*JOBPARM   ROOM=TECH
//*
//TSOENQ    EXEC CBTASML,MBR=TSOENQ,
//          NODE=SP3,
//          APARM='TEST',
//          LPARM='TEST',
//          PRINT=GEN
/*
//*
