//EAMJ     JOB (6000A,604,,9999),MOLNAR,MSGCLASS=X,CLASS=S,NOTIFY=EAM
//LKED    EXEC PGM=HEWL,REGION=512K,
//             PARM='XREF,LIST,MAP,LET,NCAL,RENT,REUS'
//SYSLIN   DD  DSN=C6000A.EAM.OBJ(IGC250),DISP=SHR
//SYSLMOD  DD  DSN=C6000A.EAM.LOAD(IGC250),DISP=SHR,
//             UNIT=3350,VOL=SER=USECAT
//SYSUT1   DD  UNIT=SYSDA,SPACE=(TRK,(10,10))
//SYSPRINT DD  SYSOUT=*
