         TITLE 'IEEVDEV DEVICE SUBROUTINE MAINLINE                     *
                        '
IEEVDEV  CSECT
@MAINENT DS    0H
         USING  *,15
IEEVDEV  MODID  BR=YES
@PROLOG  STM    @14,@12,12(@13)
         BALR   @12,0
@PSTART  DS     0H
         USING  @PSTART,@12
         L      @00,@SIZDATD
         GETMAIN R,LV=(0)
         LR     @11,@01
         USING  @DATD,@11
         IPK                           SAVE USERS KEY          YM07661
         SPKA   0(@00)                 CHANGE TO KEY 0         YM07661
         ST     @13,@SA00001+4
         LM     @00,@01,20(@13)
         ST     @11,8(@13)
         LR     @13,@11
         MVC    @PC00001(4),0(@01)
*   UCBPTR=UCBADD;                  /* INITILIZE UCB POINTER         */
         L     @15,@PC00001                                        0037
         L     UCBPTR,UCBADD(,@15)                                 0037
*   ABIND=0;                        /* RESET ABEND INDICATOR         */
*                                                                  0038
         MVI   ABIND,X'00'                                         0038
*   /*****************************************************************/
*   /*                                                               */
*   /* VERIFY THAT UCB ADDRESS POINTS TO UCB COMMON SEGEMENT BY      */
*   /* CHECKING FOR UCB IDENTIFIER                                   */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0039
*   IF UCBID^='FF'X THEN            /* CHECK FOR UCB IDENTIFIER      */
*                                                                  0039
         CLI   UCBID(UCBPTR),X'FF'                                 0039
         BE    @RF00039                                            0039
*     /***************************************************************/
*     /*                                                             */
*     /* UCB ADDRESS PASSED DID NOT POINT TO UCB COMMON SEGEMENT SET */
*     /* REASON CODE OF 4 AND ISSUE ABEND                            */
*     /*                                                             */
*     /***************************************************************/
*                                                                  0040
*     DO;                                                          0040
*       RCODE=4;                    /* SET REASON CODE TO 4          */
         MVI   RCODE,X'04'                                         0041
*       ABIND=1;                    /* SET ABEND ERROR FLAG          */
         MVI   ABIND,X'01'                                         0042
*       GOTO ABEND1;                /* GO ISSUE ABEND INVALID ADDR   */
         B     ABEND1                                              0043
*     END;                                                         0044
*                                                                  0044
*   /*****************************************************************/
*   /*                                                               */
*   /* SET UP REGISTERS FOR IOSGEN MAP FUNCTION                      */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0045
*   R4=UCBPTR;                      /* ADDRESS OF UCB FROM PARM      */
@RF00039 LR    R4,UCBPTR                                           0045
*   REGSAVE=SAVEPTR;                /* SAVE ADDR OF OUR SAVE AREA    */
         ST    SAVEPTR,REGSAVE                                     0046
*   SAVEPTR=ADDR(REGSAVEA);         /* PTR TO SAVE AREA FOR IOSGEN   */
         LA    SAVEPTR,REGSAVEA                                    0047
*   R5=ADDR(PATHMAP);               /* ADDRESS TO BUILD PATHMAP      */
         LA    R5,PATHMAP                                          0048
*   R14=ADDR(ENDMAP);               /* ADDRESS FOR END OF BUILD      */
         LA    R14,ENDMAP                                          0049
*   GEN REFS(UCBCHA,UCBCHM,UCBFL5,UCBLCI,UCBUA,CVTILCH,CVTCSD,CVTPCCAT,
*       PCCACPUA,PCCACAFM,PCCACAT,CSDCPUAL,CATFLG,LCHTCH,CVTPTR,UCBBGN,
*       UCBBASE,UCBWGT,CVTCRCA)(IOSGEN MAP,VAR=1);                 0050
         IOSGEN MAP,VAR=1
*ENDMAP:                                                           0051
*   SAVEPTR=REGSAVE;                /* RELOAD SAVEAREA POINTER       */
ENDMAP   L     SAVEPTR,REGSAVE                                     0051
*   RFY                                                            0052
*    (R4,                                                          0052
*     R5,                                                          0052
*     R14,                                                         0052
*     SAVEPTR) UNRSTD;              /* RELEASE REGISTERS FOR USE     */
*                                                                  0052
*   /*****************************************************************/
*   /*                                                               */
*   /* CHECK FUCNTION CODE PASSED AS A PARAMETER FOR FUNCTION CODE 00*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0053
*   IF FCODE=0 THEN                 /* CHECK FUNCTION CODE ZERO      */
         L     @10,@PC00001                                        0053
         CLI   FCODE(@10),0                                        0053
         BNE   @RF00053                                            0053
*     DO;                                                          0054
*                                                                  0054
*       /*************************************************************/
*       /*                                                           */
*       /* IS FUNCTION CODE 00... CHECK IF DEVICE IS IN USE IN A     */
*       /* OFFLINE CONDITION                                         */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0055
*       IF UCBNALOC='1'B THEN       /* IF OLTEP HAS DEVICE           */
         TM    UCBNALOC(UCBPTR),B'00000100'                        0055
         BNO   @RF00055                                            0055
*         RCODE=16;                 /* SET OLTEP RETURN CODE         */
*                                                                  0056
         MVI   RCODE,X'10'                                         0056
*       /*************************************************************/
*       /*                                                           */
*       /* DEVICE NOT IN USE WHILE OFFLINE CHECK FURTHER             */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0057
*       ELSE                        /* OTHERWISE CONTINUE            */
*                                                                  0057
*         /***********************************************************/
*         /*                                                         */
*         /* DETERMINE IF DEVICE IS OFFLINE.. IF NOT THEN SET RETURN */
*         /* CODE TWENTY AND RETURN TO CALLER                        */
*         /*                                                         */
*         /***********************************************************/
*                                                                  0057
*         IF UCBONLI='1'B THEN      /* IF UCB IS NOT OFFLINE         */
         B     @RC00055                                            0057
@RF00055 TM    UCBONLI(UCBPTR),B'10000000'                         0057
         BNO   @RF00057                                            0057
*           RCODE=20;               /* SET RETURN CODE OF TWENTY     */
*                                                                  0058
         MVI   RCODE,X'14'                                         0058
*       /*************************************************************/
*       /*                                                           */
*       /* DEVICE IS NOT ONLINE OR IN USE.. CONTINUE                 */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0059
*         ELSE                      /* OTHERWISE CONTINUE            */
*                                                                  0059
*           /*********************************************************/
*           /*                                                       */
*           /* CHECK PATHMAP TO DETERMINE IF A AVAILABLE PATH TO THE */
*           /* DEVICE EXISTS.. IF SO THEN DO A PATH TEST TO CHECK    */
*           /* OPERATIONAL STATUS OF PATHS                           */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0059
*           IF PTH00='01'X×PTH01='01'X×/* CHECK FOR ANY AVAILABLE    */
*               PTH10='01'X×PTH11='01'X THEN/* PATH ANYWHERE         */
         B     @RC00057                                            0059
@RF00057 CLI   PTH00,X'01'                                         0059
         BE    @RT00059                                            0059
         CLI   PTH01,X'01'                                         0059
         BE    @RT00059                                            0059
         CLI   PTH10,X'01'                                         0059
         BE    @RT00059                                            0059
         CLI   PTH11,X'01'                                         0059
         BNE   @RF00059                                            0059
@RT00059 DS    0H                                                  0060
*             DO;                   /* INSERT                        */
*                                                                  0060
*               /*****************************************************/
*               /*                                                   */
*               /* PATHS DO EXIST TO DEVICE. SET UP PARMS TO LINK TO */
*               /* IOS PATHS TEST ROUTINE                            */
*               /*                                                   */
*               /*****************************************************/
*                                                                  0061
*               FUNCPTR=UCBPTR;     /* UCB ADDRESS FOR PATH TEST     */
         ST    UCBPTR,FUNCPTR                                      0061
*               FUNCTION=0;         /* FUNCTION CODE FOR PATH TEST   */
*                                                                  0062
         MVI   FUNCTION,X'00'                                      0062
*               /*****************************************************/
*               /*                                                   */
*               /* REGISTER ONE MUST POINT DIRECTLY TO ONE WORD      */
*               /* PARAMETER                                         */
*               /*                                                   */
*               /*****************************************************/
*                                                                  0063
*               RFY                                                0063
*                (R1) RSTD;         /* RESTRICT REGISTER ONE         */
*               R1=ADDR(FUNCPTR);   /* PASS PARMS TO IOS             */
         LA    R1,FUNCPTR                                          0064
*               GEN(LINK EP=IECVIOPM);/* LINK TO IOS PATH TEST       */
         LINK EP=IECVIOPM
*               RFY                                                0066
*                (R1) UNRSTD;       /* RELEASE REGISTER ONE          */
*                                                                  0066
*               /*****************************************************/
*               /*                                                   */
*               /* UPON RETURN REGISTER 15 WILL HAVE RETURN CODE     */
*               /* INDICATING STATUS OF PATHS. CONVERT RETURN CODE TO*/
*               /* VALUE EXPECTED BY MY CALLER AND RETURN            */
*               /*                                                   */
*               /*****************************************************/
*                                                                  0067
*               RFY                                                0067
*                (R15) RSTD;        /* RESTRICT REG 15 FOR TESTS     */
*                                                                  0067
*               /*****************************************************/
*               /*                                                   */
*               /* CHECK FOR ANY OPERATIONAL PATH. RET CODE 0 MEANS  */
*               /* AT LEAST ONE PATH EXISTS TO DEVICE. RET CODE      */
*               /* TWENTY MEANS DEVICE IS RESERVED BUT PATH EXISTS.  */
*               /*                                                   */
*               /*****************************************************/
*                                                                  0068
*               IF R15=0×R15=20 THEN/* CHECK FOR OPERATIONAL PATH    */
         LTR   R15,R15                                             0068
         BZ    @RT00068                                            0068
         C     R15,@CF01784                                        0068
         BNE   @RF00068                                            0068
@RT00068 DS    0H                                                  0069
*                 DO;                                              0069
*                   UCBVHRSN='0'B;  /* RESET HIER REASON INDICATOR   */
         NI    UCBVHRSN(UCBPTR),B'11111101'                        0070
*                   RCODE=0;        /* INDICATE OPERATIONAL PATHS    */
         MVI   RCODE,X'00'                                         0071
*                 END;                                             0072
*                                                                  0072
*               /*****************************************************/
*               /*                                                   */
*               /* OPERATIONAL PATH DOESN'T EXIST CHECK FURTHER      */
*               /*                                                   */
*               /*****************************************************/
*                                                                  0073
*               ELSE                                               0073
*                                                                  0073
*                 /***************************************************/
*                 /*                                                 */
*                 /* CHECK IF NO OPERATIONAL PATHS EXIST TO THE      */
*                 /* DEVICE RET CODE 4 MEANS NO PATHS EXIST I/O WAS  */
*                 /* ISSUED, 8 MEANS NO PATHS EXIST I/O WAS NOT      */
*                 /* ISSUED                                          */
*                 /*                                                 */
*                 /***************************************************/
*                                                                  0073
*                 IF R15=4×R15=8 THEN/* CHECK FOR NO OPERATIONAL PATH*/
         B     @RC00068                                            0073
@RF00068 C     R15,@CF00086                                        0073
         BE    @RT00073                                            0073
         C     R15,@CF00039                                        0073
         BNE   @RF00073                                            0073
@RT00073 DS    0H                                                  0074
*                   DO;                                            0074
*                     UCBVORSN='1'B;/* SET OPERATOR REASON INDICATOR */
         OI    UCBVORSN(UCBPTR),B'00000100'                        0075
*                     RCODE=12;     /* SET NO OPERATIONAL PATH RCODE */
         MVI   RCODE,X'0C'                                         0076
*                   END;                                           0077
*                                                                  0077
*               /*****************************************************/
*               /*                                                   */
*               /* PATH IS NEITHER OPERATIONAL NOR INOPERATIONAL     */
*               /* CHECK FOR ERROR OF SOME KIND                      */
*               /*                                                   */
*               /*****************************************************/
*                                                                  0078
*                 ELSE                                             0078
*                                                                  0078
*                   /*************************************************/
*                   /*                                               */
*                   /* RETURN CODE 12 INDICATES NO STORAGE WAS       */
*                   /* AVAILABLE FOR PROCESSING                      */
*                   /*                                               */
*                   /*************************************************/
*                                                                  0078
*                   IF R15=12 THEN  /* CHECK FOR NO CORE             */
         B     @RC00073                                            0078
@RF00073 C     R15,@CF00033                                        0078
         BNE   @RF00078                                            0078
*                     RCODE=8;      /* INDICATE NOCORE               */
         MVI   RCODE,X'08'                                         0079
*                   ELSE            /* INVALID RETURN CODE           */
*                                                                  0080
*                     /***********************************************/
*                     /*                                             */
*                     /* INVALID RETURN CODE RECEIVED FROM IOS SET   */
*                     /* REASON CODE AND ABEND INDICATOR             */
*                     /*                                             */
*                     /***********************************************/
*                                                                  0080
*                     DO;                                          0080
         B     @RC00078                                            0080
@RF00078 DS    0H                                                  0081
*                       RCODE=20;   /* SET REASON CODE               */
         MVI   RCODE,X'14'                                         0081
*                       ABIND=1;    /* SET ABEND INDICATOR           */
         MVI   ABIND,X'01'                                         0082
*                       RFY                                        0083
*                        (R15) UNRSTD;                             0083
*                     END;                                         0084
*             END;                  /* END OF IECVIOPM PROCESSING    */
*                                                                  0085
*       /*************************************************************/
*       /*                                                           */
*       /* NO AVAILABLE PATHS TO THE DEVICE EXIST.. INDICATE TO      */
*       /* CALLER BY SETTING RETURN CODE 4 ALSO SET HIERACRY REASON  */
*       /* INDICATOR IN UCB                                          */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0086
*           ELSE                    /* THERE WERE NO PATHS           */
*             DO;                   /* SO SET HIERARCHY REASON       */
         B     @RC00059                                            0086
@RF00059 DS    0H                                                  0087
*               RCODE=4;            /* BIT IN UCB AND SET RETURN     */
         MVI   RCODE,X'04'                                         0087
*               UCBVHRSN='1'B;      /* CODE INDICATING NO PATHS      */
         OI    UCBVHRSN(UCBPTR),B'00000010'                        0088
*             END;                  /* ARE AVAILABLE                 */
*     END;                          /* END OF FUNCTION CODE 00     0090
*                                      PROCESSING                    */
*                                                                  0090
*   /*****************************************************************/
*   /*                                                               */
*   /* FUNCTION CODE WAS NOT 00.. CHECK FOR FUNCTION CODE 01 AND IF  */
*   /* SO CALL CPULEVEL ROUTINE                                      */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0091
*   ELSE                            /* FUNCTION CODE OTHER THAN 00   */
*     IF FCODE=1 THEN               /* IF FUNCTION CODE IS 01        */
         B     @RC00053                                            0091
@RF00053 L     @10,@PC00001                                        0091
         CLI   FCODE(@10),1                                        0091
         BNE   @RF00091                                            0091
*       CALL CPULEVEL;              /* THEN GO TO CPU ROUTINE        */
*                                                                  0092
         BAL   @14,CPULEVEL                                        0092
*   /*****************************************************************/
*   /*                                                               */
*   /* FUNCTION CODE WAS NOT 01.. CHECK FOR FUNCTION CODE 02 AND IF  */
*   /* SO CALL CHANNEL LEVEL ROUTINE.. OTHERWISE SET ABEND           */
*   /* INDICATOR... INVALID PARAMETERS                               */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0093
*     ELSE                          /* FUNCTION CODE NOT 00 OR 01    */
*       IF FCODE=2 THEN             /* IF FUNCTION CODE IS 02        */
         B     @RC00091                                            0093
@RF00091 L     @10,@PC00001                                        0093
         CLI   FCODE(@10),2                                        0093
         BNE   @RF00093                                            0093
*         CALL CHNLEVEL;            /* THEN GO TO CHANNEL ROUTINE    */
*                                                                  0094
         BAL   @14,CHNLEVEL                                        0094
*   /*****************************************************************/
*   /*                                                               */
*   /* WAS NOT FUNCTION CODE 0, 1, OR 2, CHECK FOR 3 OR 4            */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0095
*       ELSE                        /* OTHERWISE IT IS AN            */
*                                                                  0095
*         /***********************************************************/
*         /*                                                         */
*         /* CHECK FOR 3 OR 4                                        */
*         /*                                                         */
*         /***********************************************************/
*                                                                  0095
*         IF FCODE=3 THEN           /* FUNCTION CODE 3?              */
         B     @RC00093                                            0095
@RF00093 L     @10,@PC00001                                        0095
         CLI   FCODE(@10),3                                        0095
         BNE   @RF00095                                            0095
*           CALL CPUTEST;           /* CHECK CPU STATUS              */
         BAL   @14,CPUTEST                                         0096
*         ELSE                                                     0097
*           IF FCODE=4 THEN         /* FUNCTION CODE 4?              */
         B     @RC00095                                            0097
@RF00095 L     @10,@PC00001                                        0097
         CLI   FCODE(@10),4                                        0097
         BNE   @RF00097                                            0097
*             CALL CHNTEST;         /* CALL CHANNEL TEST             */
*                                                                  0098
         BAL   @14,CHNTEST                                         0098
*   /*****************************************************************/
*   /*                                                               */
*   /* FUNCTION CODE WAS NOT 0, 1, 2, 3, OR 4. SET ERROR FLAG        */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0099
*           ELSE                                                   0099
*             DO;                                                  0099
         B     @RC00097                                            0099
@RF00097 DS    0H                                                  0100
*               RCODE=12;           /* REASON CODE FOR ABEND         */
         MVI   RCODE,X'0C'                                         0100
*               ABIND=1;            /* INVALID FUNCTION CODE         */
         MVI   ABIND,X'01'                                         0101
*             END;                                                 0102
*                                                                  0102
*   /*****************************************************************/
*   /*                                                               */
*   /* CHECK IF INVALID PARAMETERS WERE DETECTED ANYWHERE AND IF SO  */
*   /* ISSUE ABEND                                                   */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0103
*   IF ABIND=1 THEN                 /* IF INDICATOR IS ON THEN       */
@RC00097 DS    0H                                                  0103
@RC00095 DS    0H                                                  0103
@RC00093 DS    0H                                                  0103
@RC00091 DS    0H                                                  0103
@RC00053 CLI   ABIND,1                                             0103
         BNE   @RF00103                                            0103
*ABEND1:                                                           0104
*     DO;                                                          0104
ABEND1   DS    0H                                                  0105
*       REASON=RCODE;               /* RESTORE REASON CODE TO      0105
*                                      REGISTER 15                   */
         SLR   REASON,REASON                                       0105
         IC    REASON,RCODE                                        0105
*       GEN(SPKA  0(@02));          /* RESTORE TO KEY OF CALLER    0106
*                                                            @YM07661*/
         SPKA  0(@02)
*       DO;                         /* ABEND(126) SYSTEM             */
*         RESPECIFY                                                0108
*          (GPR01F) RESTRICTED;                                    0108
*         GPR01F=((126)&'00000FFF'X)*4096;/* COMP CODE IN BITS 8-19  */
         L     GPR01F,@CF01817                                     0109
*         SVC(13);                  /* ISSUE ABEND SVC               */
         SVC   13                                                  0110
*         RESPECIFY                                                0111
*          (GPR01F) UNRESTRICTED;                                  0111
*       END;                        /* ABEND(126) SYSTEM ISSUE SYSTEM
*                                      ABEND 07E                     */
*       RFY                                                        0113
*        (REASON) UNRSTD;           /* UNRESTRICT REGISTER 15        */
*     END;                                                         0114
*                                                                  0114
*   /*****************************************************************/
*   /*                                                               */
*   /* LOAD RETURN CODE AND PASS TO CALLER                           */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0115
*   ELSE                            /* OTHERWISE PASS RETURN         */
*     DO;                                                          0115
*                                                                  0115
         B     @RC00103                                            0115
@RF00103 DS    0H                                                  0116
*       /*************************************************************/
*       /*                                                           */
*       /* PICK UP ALL INFORMATION OUT OF WORK AREA, CHANGE BACK TO  */
*       /* CALLERS KEY, AND ISSUE FREEMAIN                           */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0116
*       GENERATE;                                                  0116
     SLR    @10,@10
     IC     @10,RCODE
     L      @13,4(,@13)
     L      @00,@SIZDATD
     LR     @01,@11
     SPKA   0(@02)                                       YM08605
     FREEMAIN R,LV=(0),A=(1)
     LR     @15,@10
     L      @14,12(,@13)
     LM     @00,@12,20(@13)
     BR     @14
*     END;                                                         0117
*CHNLEVEL:                                                         0118
*   PROC OPTIONS(NOSAVEAREA);       /* CHANNEL LEVEL PROCEDURE       */
@EL00001 L     @13,4(,@13)                                         0118
@EF00001 L     @00,@SIZDATD                                        0118
         LR    @01,@11                                             0118
         FREEMAIN R,LV=(0),A=(1)
@ER00001 LM    @14,@12,12(@13)                                     0118
         BR    @14                                                 0118
CHNLEVEL STM   @14,@12,12(@13)                                     0118
*/***************************************************************    */
*/*  CHANNEL LEVEL ROUTINE WILL DETERMINE IF A PATH EXISTS           */
*/*  TO THE REFERENCED DEVICE USING A CHANNEL OTHER THAN THE         */
*/*  ONE THE CALLER HAS SPECIFIED IN THE INPUT PARAMETERS            */
*/*                                                                  */
*/*  A RETURN CODE OF 00 INDICATES THAT ANOTHER PATH DOES EXIST      */
*/*  A RETURN CODE OF 04 INDICATES THAT ANOTHER PATH DOESNOT EXIST   */
*/***************************************************************    */
*                                                                  0119
*   /*****************************************************************/
*   /*                                                               */
*   /* CHECK IF A AVAILABLE PATH EXISTS ANYWHERE FOR THIS DEVICE BY  */
*   /* INTEROGATING THE PATHMAP                                      */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0119
*   IF PTH00='01'X×PTH01='01'X×     /* CHECK FOR AN AVAILABLE        */
*       PTH10='01'X×PTH11='01'X THEN/* PATH ON ANY CHANNEL           */
*                                                                  0119
         CLI   PTH00,X'01'                                         0119
         BE    @RT00119                                            0119
         CLI   PTH01,X'01'                                         0119
         BE    @RT00119                                            0119
         CLI   PTH10,X'01'                                         0119
         BE    @RT00119                                            0119
         CLI   PTH11,X'01'                                         0119
         BNE   @RF00119                                            0119
@RT00119 DS    0H                                                  0120
*     /***************************************************************/
*     /*                                                             */
*     /* CHECK IF THE CHANNEL IN QUESTION IS REPRESENTED IN THE PATH */
*     /* MAP FOR THIS DEVICE                                         */
*     /*                                                             */
*     /***************************************************************/
*                                                                  0120
*     IF CHNID=CHN00×CHNID=CHN10 THEN/* CHANNEL ID MATCH MAP ?       */
*                                                                  0120
         L     @10,@PC00001                                        0120
         CLC   CHNID(1,@10),CHN00                                  0120
         BE    @RT00120                                            0120
         CLC   CHNID(1,@10),CHN10                                  0120
         BNE   @RF00120                                            0120
@RT00120 DS    0H                                                  0121
*       /*************************************************************/
*       /*                                                           */
*       /* A PATH DOES EXIST.. VERIFY THAT THE CPU ADDRESS PASSED IS */
*       /* VALID AND IF NOT SET ABEND INDICATOR                      */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0121
*       IF CPUID=>2 THEN            /* CPU ID VALID?                 */
         L     @10,@PC00001                                        0121
         CLI   CPUID(@10),2                                        0121
         BL    @RF00121                                            0121
*         DO;                                                      0122
*           RCODE=16;               /* SET REASON CODE               */
         MVI   RCODE,X'10'                                         0123
*           ABIND=1;                /* SET ABEND INDICATOR           */
         MVI   ABIND,X'01'                                         0124
*         END;                                                     0125
*                                                                  0125
*   /*****************************************************************/
*   /*                                                               */
*   /* CPU ADDRESS IS VALID                                          */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0126
*       ELSE                        /* OTHERWISE                     */
*                                                                  0126
*         /***********************************************************/
*         /*                                                         */
*         /* DETERMINE WHICH CPU CONTAINS THE CHANNEL IN QUESTION    */
*         /*                                                         */
*         /***********************************************************/
*                                                                  0126
*         IF CPUID=0 THEN           /* IS THIS CPU ZERO              */
*                                                                  0126
         B     @RC00121                                            0126
@RF00121 L     @10,@PC00001                                        0126
         CLI   CPUID(@10),0                                        0126
         BNE   @RF00126                                            0126
*           /*********************************************************/
*           /*                                                       */
*           /* CHANNEL IS ON FIRST CPU.. CHECK IF CHANNEL IS FIRST   */
*           /* CHANNEL REPRESENTED IN PATHMAP                        */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0127
*           IF CHNID=CHN00 THEN     /* FIRST CHANNEL BEING REMOVED   */
*                                                                  0127
         CLC   CHNID(1,@10),CHN00                                  0127
         BNE   @RF00127                                            0127
*             /*******************************************************/
*             /*                                                     */
*             /* FIRST CHANNEL ON FIRST CPU BEING REMOVED... CHECK IF*/
*             /* PATH EXISTS ON ANY OTHER CHANNEL IF SO SET RCODE 0  */
*             /*                                                     */
*             /*******************************************************/
*                                                                  0128
*             IF PTH01='01'X×PTH10='01'X/* IS A PATH AVAILABLE ON ANY*/
*                 ×PTH11='01'X THEN /* OTHER CHANNEL                 */
         CLI   PTH01,X'01'                                         0128
         BE    @RT00128                                            0128
         CLI   PTH10,X'01'                                         0128
         BE    @RT00128                                            0128
         CLI   PTH11,X'01'                                         0128
         BNE   @RF00128                                            0128
@RT00128 DS    0H                                                  0129
*               RCODE=0;            /* SET ZERO RETURN CODE          */
*                                                                  0129
         MVI   RCODE,X'00'                                         0129
*   /*****************************************************************/
*   /*                                                               */
*   /* NO OTHER PATH EXISTS.. SET RCODE 4                            */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0130
*             ELSE                  /* PATH NOT AVAILABLE            */
*               RCODE=4;            /* SO SET RETURN CODE 4          */
*                                                                  0130
         B     @RC00128                                            0130
@RF00128 MVI   RCODE,X'04'                                         0130
*   /*****************************************************************/
*   /*                                                               */
*   /* SECOND CHANNEL ON FIRST CPU BEING REMOVED... CHECK IF PATH    */
*   /* EXISTS ON ANY OTHER CHANNEL.. IF SO SET RCODE = 0             */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0131
*           ELSE                    /*                               */
*             IF PTH00='01'X×PTH01='01'X×/* CHECK FOR AVAILABLE PATH */
*                 PTH11='01'X THEN  /* ON ANY OTHER CHANNEL          */
         B     @RC00127                                            0131
@RF00127 CLI   PTH00,X'01'                                         0131
         BE    @RT00131                                            0131
         CLI   PTH01,X'01'                                         0131
         BE    @RT00131                                            0131
         CLI   PTH11,X'01'                                         0131
         BNE   @RF00131                                            0131
@RT00131 DS    0H                                                  0132
*               RCODE=0;            /* IS.. NOT DEPENDENT ON CHAN    */
*                                                                  0132
         MVI   RCODE,X'00'                                         0132
*   /*****************************************************************/
*   /*                                                               */
*   /* NO OTHER PATH EXISTS.. SET RCODE 4                            */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0133
*             ELSE                  /* ONLY PATH IS ON THIS CHAN     */
*               RCODE=4;            /* AVAILABLE RETURN CODE         */
*                                                                  0133
         B     @RC00131                                            0133
@RF00131 MVI   RCODE,X'04'                                         0133
*   /*****************************************************************/
*   /*                                                               */
*   /* CHANNEL BEING REMOVED WAS NOT ON CPU1.. MUST BE CPU1 THEN..   */
*   /* CHECK IF CHANNEL IS FIRST CHANNEL IN MAP OR SECOND            */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0134
*         ELSE                      /* CHANNEL MUST BE ON CPU 1      */
*           IF CHNID=CHN00 THEN     /* FIRST CHANNEL ON THIS CPU     */
*                                                                  0134
         B     @RC00126                                            0134
@RF00126 L     @10,@PC00001                                        0134
         CLC   CHNID(1,@10),CHN00                                  0134
         BNE   @RF00134                                            0134
*             /*******************************************************/
*             /*                                                     */
*             /* FIRST CHANNEL IN MAP.. CHECK IF PATH EXISTS ON ANY  */
*             /* OF THE OTHER THREE POSSABILITIES IF SO SET RCODE = 0*/
*             /*                                                     */
*             /*******************************************************/
*                                                                  0135
*             IF PTH00='01'X×PTH10='01'X/* CHECK IF PATH IS AVAILABLE*/
*                 ×PTH11='01'X THEN /* ON ANY OTHER CHANNEL          */
         CLI   PTH00,X'01'                                         0135
         BE    @RT00135                                            0135
         CLI   PTH10,X'01'                                         0135
         BE    @RT00135                                            0135
         CLI   PTH11,X'01'                                         0135
         BNE   @RF00135                                            0135
@RT00135 DS    0H                                                  0136
*               RCODE=0;            /* PATH DOES NOT NEED THIS CHN   */
*                                                                  0136
         MVI   RCODE,X'00'                                         0136
*   /*****************************************************************/
*   /*                                                               */
*   /* NO OTHER PATHS EXIST SET RCODE = 4                            */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0137
*             ELSE                  /* PATH DOES NEED THIS CHANNEL   */
*               RCODE=4;            /* THIS CHANNEL RCODE 4          */
*                                                                  0137
         B     @RC00135                                            0137
@RF00135 MVI   RCODE,X'04'                                         0137
*   /*****************************************************************/
*   /*                                                               */
*   /* WAS NOT FIRST CHANNEL IN MAP.. MUST BE SECOND                 */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0138
*           ELSE                    /* THIS IS CHN 2 CPU 1           */
*                                                                  0138
*             /*******************************************************/
*             /*                                                     */
*             /* CHECK IF PATH EXISTS TO DEVICE ON ANY OF THE OTHER  */
*             /* THREE POSSABILITIES IF SO SET RCODE = 0             */
*             /*                                                     */
*             /*******************************************************/
*                                                                  0138
*             IF PTH00='01'X×PTH01='01'X/* CHECK IF PATH IS AVAILABLE*/
*                 ×PTH10='01'X THEN /* ON ANY OTHER CHANNEL          */
         B     @RC00134                                            0138
@RF00134 CLI   PTH00,X'01'                                         0138
         BE    @RT00138                                            0138
         CLI   PTH01,X'01'                                         0138
         BE    @RT00138                                            0138
         CLI   PTH10,X'01'                                         0138
         BNE   @RF00138                                            0138
@RT00138 DS    0H                                                  0139
*               RCODE=0;            /* PATH DOES NOT NEED THIS CHN   */
*                                                                  0139
         MVI   RCODE,X'00'                                         0139
*   /*****************************************************************/
*   /*                                                               */
*   /* NO OTHER PATHS EXIST.. SET RCODE = 4                          */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0140
*             ELSE                  /* THIS CHANNEL IS LAST PATH     */
*               RCODE=4;            /* RETURN CODE                   */
*                                                                  0140
         B     @RC00138                                            0140
@RF00138 MVI   RCODE,X'04'                                         0140
*   /*****************************************************************/
*   /*                                                               */
*   /* CHANNEL BEING REMOVED DOES NOT MATCH EITHER CHANNEL ENTRY IN  */
*   /* MAP.. DEVICE NOT DEPENDENT ON THIS CHANNEL SET RCODE = 0      */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0141
*     ELSE                          /* CHANNEL ID DID NOT MATCH      */
*       RCODE=0;                    /* PATH NOT ON THESE CHANNELS    */
*                                                                  0141
         B     @RC00120                                            0141
@RF00120 MVI   RCODE,X'00'                                         0141
*   /*****************************************************************/
*   /*                                                               */
*   /* NO AVAILABLE PATHS EXIST TO THE DEVICE ANYWHERE.. DEVICE NOT  */
*   /* DEPENDENT ON THIS CHANNEL SET RCODE = 0                       */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0142
*   ELSE                            /* NO AVAILABLE PATHS            */
*     RCODE=0;                      /* NOT DEPENDENT ON CHANNELS     */
         B     @RC00119                                            0142
@RF00119 MVI   RCODE,X'00'                                         0142
*   END;                            /* END OF CHANNEL LEVEL CHECK    */
@EL00002 DS    0H                                                  0143
@EF00002 DS    0H                                                  0143
@ER00002 LM    @14,@12,12(@13)                                     0143
         BR    @14                                                 0143
*CPULEVEL:                                                         0144
*   PROC;                                                          0144
*                                                                  0144
CPULEVEL STM   @14,@12,12(@13)                                     0144
*/* *************************************************************    */
*/*  CPU LEVEL CHECK WILL CHECK IF A PATH EXISTS TO THE DEVICE ON    */
*/*  A CPU OTHER THAN THE ONE THE CALLER HAS SPECIFIED IN THE        */
*/*  INPUT PARAMETERS A RCODE OF 0 INDICATES THAT A PATH DOES        */
*/*  EXIST ON ANOTHER CPU A RCODE OF 4 INDICATES THAT A PATH DOES NOT*/
*/*  EXIST ON ANOTHER CPU                                            */
*/* *************************************************************    */
*                                                                  0145
*   /*****************************************************************/
*   /*                                                               */
*   /* CHECK FOR A AVAILABLE PATH ANYWHERE                           */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0145
*   IF PTH00='01'X×PTH01='01'X×     /* CHECK FOR ANY AVAL PATHS      */
*       PTH10='01'X×PTH11='01'X THEN/* ANYWHERE                      */
*                                                                  0145
         CLI   PTH00,X'01'                                         0145
         BE    @RT00145                                            0145
         CLI   PTH01,X'01'                                         0145
         BE    @RT00145                                            0145
         CLI   PTH10,X'01'                                         0145
         BE    @RT00145                                            0145
         CLI   PTH11,X'01'                                         0145
         BNE   @RF00145                                            0145
@RT00145 DS    0H                                                  0146
*     /***************************************************************/
*     /*                                                             */
*     /* A AVAILABLE PATH DOES EXIST.. VERIFY INPUT PARAMETERS IF CPU*/
*     /* ADDRESS IS GREATER THAN 1 SET ABEND INDICATOR               */
*     /*                                                             */
*     /***************************************************************/
*                                                                  0146
*     IF CPUID=>2 THEN              /* CHECK FOR VALID CPUID         */
         L     @10,@PC00001                                        0146
         CLI   CPUID(@10),2                                        0146
         BL    @RF00146                                            0146
*       DO;                                                        0147
*         RCODE=16;                 /* SET REASON CODE               */
         MVI   RCODE,X'10'                                         0148
*         ABIND=1;                  /* INVALID.. SET ABEND IND.      */
         MVI   ABIND,X'01'                                         0149
*       END;                                                       0150
*                                                                  0150
*   /*****************************************************************/
*   /*                                                               */
*   /* INPUT PARAMETERS ARE VALID.. CONTINUE                         */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0151
*     ELSE                          /* VALID CONTINUE                */
*                                                                  0151
*       /*************************************************************/
*       /*                                                           */
*       /* DETERMINE WHICH CPU IS BEING REMOVED..                    */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0151
*       IF CPUID=0 THEN             /* CPU 0 BEING REMOVED?          */
*                                                                  0151
         B     @RC00146                                            0151
@RF00146 L     @10,@PC00001                                        0151
         CLI   CPUID(@10),0                                        0151
         BNE   @RF00151                                            0151
*         /***********************************************************/
*         /*                                                         */
*         /* CPU 0 BEING REMOVED.. DOES AVAILABLE PATH EXIST ON CPU 1*/
*         /* ? IF SO SET RCODE 0                                     */
*         /*                                                         */
*         /***********************************************************/
*                                                                  0152
*         IF PTH01='01'X×PTH11='01'X THEN/* IS PATH ON OTHER CPU     */
         CLI   PTH01,X'01'                                         0152
         BE    @RT00152                                            0152
         CLI   PTH11,X'01'                                         0152
         BNE   @RF00152                                            0152
@RT00152 DS    0H                                                  0153
*           RCODE=0;                /* PATH DOES NOT NEED CPU        */
*                                                                  0153
         MVI   RCODE,X'00'                                         0153
*   /*****************************************************************/
*   /*                                                               */
*   /* PATH DOES NOT EXIST SET RCODE 4                               */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0154
*         ELSE                      /* PATH DOES NEED THIS CPU       */
*           RCODE=4;                /* SET DEPENDENT RETURN CODE     */
*                                                                  0154
         B     @RC00152                                            0154
@RF00152 MVI   RCODE,X'04'                                         0154
*   /*****************************************************************/
*   /*                                                               */
*   /* WAS NOT CPU0 BEING REMOVED.. MUST BE CPU1 THEN                */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0155
*       ELSE                        /* CPU 1 BEING REMOVED THEN      */
*                                                                  0155
*         /***********************************************************/
*         /*                                                         */
*         /* CHECK IF PATH EXISTS ON CPU 0 IF SO SET RCODE = 0       */
*         /*                                                         */
*         /***********************************************************/
*                                                                  0155
*         IF PTH00='01'X×PTH10='01'X THEN/* PATH ON OTHER CPU?       */
         B     @RC00151                                            0155
@RF00151 CLI   PTH00,X'01'                                         0155
         BE    @RT00155                                            0155
         CLI   PTH10,X'01'                                         0155
         BNE   @RF00155                                            0155
@RT00155 DS    0H                                                  0156
*           RCODE=0;                /* YES.. SET OK RETURN CODE      */
*                                                                  0156
         MVI   RCODE,X'00'                                         0156
*   /*****************************************************************/
*   /*                                                               */
*   /* OTHER PATH DOES NOT EXIST.. SET RCODE = 4                     */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0157
*         ELSE                      /* PATH DEPENDENT ON THIS        */
*           RCODE=4;                /* DEPENDENT RETURN CODE         */
*                                                                  0157
         B     @RC00155                                            0157
@RF00155 MVI   RCODE,X'04'                                         0157
*   /*****************************************************************/
*   /*                                                               */
*   /* NO AVAILABLE PATHS EXIST TO THE DEVICE.. SET RCODE 0 DEVICE   */
*   /* NOT DEPENDENT UPON SPECIFIED CPU                              */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0158
*   ELSE                            /* NO AVALIABLE PATHS            */
*     RCODE=0;                      /* PATH NOT DEPENDENT ON CPU     */
         B     @RC00145                                            0158
@RF00145 MVI   RCODE,X'00'                                         0158
*   END;                            /* END OF CPU LEVEL CHECK        */
@EL00003 DS    0H                                                  0159
@EF00003 DS    0H                                                  0159
@ER00003 LM    @14,@12,12(@13)                                     0159
         BR    @14                                                 0159
*CHNTEST:                                                          0160
*   PROC;                                                          0160
*                                                                  0160
CHNTEST  STM   @14,@12,12(@13)                                     0160
*/****************************************************************** */
*/* CHNTEST ROUTINE WILL DETERMINE IF A CPU/CHANNEL COMBINATION IS   */
*/* INVOLVED IN A PATH TO A SPECIFIC DEVICE. RETURN CODE ZERO        */
*/* INDICATES THAT THE CHANNEL IS INVOLVED IN THE PATH, RETURN CODE  */
*/* FOUR INDICATES THAT THE CHANNEL IS NOT INVOLVED IN THE PATH.     */
*/****************************************************************** */
*                                                                  0161
*   /*****************************************************************/
*   /*                                                               */
*   /* CHECK FOR VALID CPU ADDRESS. ACCEPT ONLY 0 OR 1               */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0161
*   IF CPUID>1 THEN                 /* VALID?                        */
         L     @10,@PC00001                                        0161
         CLI   CPUID(@10),1                                        0161
         BNH   @RF00161                                            0161
*     DO;                                                          0162
*       RCODE=16;                   /* REASON CODE                   */
         MVI   RCODE,X'10'                                         0163
*       ABIND=1;                    /* SET ABEND FLAG                */
         MVI   ABIND,X'01'                                         0164
*     END;                                                         0165
*                                                                  0165
*   /*****************************************************************/
*   /*                                                               */
*   /* VALID CPU ADDRESS. CONTINUE                                   */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0166
*   ELSE                                                           0166
*                                                                  0166
*     /***************************************************************/
*     /*                                                             */
*     /* CHECK WHICH CPU IS TO BE TESTED                             */
*     /*                                                             */
*     /***************************************************************/
*                                                                  0166
*     IF CPUID=0 THEN               /* CPU ZERO?                     */
*                                                                  0166
         B     @RC00161                                            0166
@RF00161 L     @10,@PC00001                                        0166
         CLI   CPUID(@10),0                                        0166
         BNE   @RF00166                                            0166
*       /*************************************************************/
*       /*                                                           */
*       /* DETERMINE IF A PATH EXISTS USING THE SPECIFIED CHANNEL    */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0167
*       IF CHNID=CHN00&PTH00='01'X  /* PATH AVAILABLE ON FIRST?      */
*           ×CHNID=CHN10&PTH10='01'X THEN/* PATH EXIST?              */
         CLC   CHNID(1,@10),CHN00                                  0167
         BNE   @GL00023                                            0167
         CLI   PTH00,X'01'                                         0167
         BE    @RT00167                                            0167
@GL00023 L     @10,@PC00001                                        0167
         CLC   CHNID(1,@10),CHN10                                  0167
         BNE   @RF00167                                            0167
         CLI   PTH10,X'01'                                         0167
         BNE   @RF00167                                            0167
@RT00167 DS    0H                                                  0168
*         RCODE=0;                  /* YES, SET RETURN CODE 0        */
*                                                                  0168
         MVI   RCODE,X'00'                                         0168
*   /*****************************************************************/
*   /*                                                               */
*   /* NO PATHS EXIST. SET RETURN CODE                               */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0169
*       ELSE                                                       0169
*         RCODE=4;                  /* SET RETURN CODE 4             */
*                                                                  0169
         B     @RC00167                                            0169
@RF00167 MVI   RCODE,X'04'                                         0169
*   /*****************************************************************/
*   /*                                                               */
*   /* CPUID WAS NOT ZERO, MUST THEN BE 1                            */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0170
*     ELSE                                                         0170
*                                                                  0170
*       /*************************************************************/
*       /*                                                           */
*       /* CHECK IF A PATH EXISTS USING SAME CHANNEL, OTHER CPU      */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0170
*       IF CHNID=CHN00&PTH01='01'X×CHNID=CHN10&PTH11='01'X THEN/*  0170
*                                      PATH?                         */
         B     @RC00166                                            0170
@RF00166 L     @10,@PC00001                                        0170
         CLC   CHNID(1,@10),CHN00                                  0170
         BNE   @GL00026                                            0170
         CLI   PTH01,X'01'                                         0170
         BE    @RT00170                                            0170
@GL00026 L     @10,@PC00001                                        0170
         CLC   CHNID(1,@10),CHN10                                  0170
         BNE   @RF00170                                            0170
         CLI   PTH11,X'01'                                         0170
         BNE   @RF00170                                            0170
@RT00170 DS    0H                                                  0171
*         RCODE=0;                  /* SET RETURN CODE ZERO          */
         MVI   RCODE,X'00'                                         0171
*       ELSE                                                       0172
*         RCODE=4;                  /* SET RETURN CODE FOUR          */
         B     @RC00170                                            0172
@RF00170 MVI   RCODE,X'04'                                         0172
*   END;                            /* END OF CHANNEL TEST ROUTINE   */
@EL00004 DS    0H                                                  0173
@EF00004 DS    0H                                                  0173
@ER00004 LM    @14,@12,12(@13)                                     0173
         BR    @14                                                 0173
*CPUTEST:                                                          0174
*   PROC;                                                          0174
*                                                                  0174
CPUTEST  STM   @14,@12,12(@13)                                     0174
*/****************************************************************** */
*/* CPU TEST WILL DETERMINE IF THE SPECIFIED CPU IS PART OF ANY PATH */
*/* TO THE SPECIFIED DEVICE, AND INFORM THE CALLER OF SUCH.          */
*/****************************************************************** */
*                                                                  0175
*   /*****************************************************************/
*   /*                                                               */
*   /* CHECK FOR VALID CPU ADDRESS.                                  */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0175
*   IF CPUID>1 THEN                 /* VALID?                        */
         L     @10,@PC00001                                        0175
         CLI   CPUID(@10),1                                        0175
         BNH   @RF00175                                            0175
*     DO;                                                          0176
*       RCODE=16;                   /* REASON CODE                   */
         MVI   RCODE,X'10'                                         0177
*       ABIND=1;                    /* SET ABEND FLAG                */
         MVI   ABIND,X'01'                                         0178
*     END;                                                         0179
*                                                                  0179
*   /*****************************************************************/
*   /*                                                               */
*   /* VALID CPU ADDRESS, CONTINUE                                   */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0180
*   ELSE                                                           0180
*                                                                  0180
*     /***************************************************************/
*     /*                                                             */
*     /* CHECK WHICH CPU TO TEST.                                    */
*     /*                                                             */
*     /***************************************************************/
*                                                                  0180
*     IF CPUID=0 THEN               /* CPU ZERO?                     */
*                                                                  0180
         B     @RC00175                                            0180
@RF00175 L     @10,@PC00001                                        0180
         CLI   CPUID(@10),0                                        0180
         BNE   @RF00180                                            0180
*       /*************************************************************/
*       /*                                                           */
*       /* CHECK FOR ANY PATH FROM CPU 0                             */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0181
*       IF PTH00='01'X×PTH10='01'X THEN/* ANY PATHS?                 */
         CLI   PTH00,X'01'                                         0181
         BE    @RT00181                                            0181
         CLI   PTH10,X'01'                                         0181
         BNE   @RF00181                                            0181
@RT00181 DS    0H                                                  0182
*         RCODE=0;                  /* SET RETURN CODE ZERO          */
*                                                                  0182
         MVI   RCODE,X'00'                                         0182
*   /*****************************************************************/
*   /*                                                               */
*   /* NO PATHS EXIST. SET RETURN CODE                               */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0183
*       ELSE                                                       0183
*         RCODE=4;                  /* SET RETURN CODE FOUR          */
*                                                                  0183
         B     @RC00181                                            0183
@RF00181 MVI   RCODE,X'04'                                         0183
*   /*****************************************************************/
*   /*                                                               */
*   /* CPUID WAS NOT ZERO, MUST THEN BE ONE                          */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0184
*     ELSE                                                         0184
*                                                                  0184
*       /*************************************************************/
*       /*                                                           */
*       /* CHECK IF ANY AVAILABLE PATHS EXIST ON CPU 1               */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0184
*       IF PTH01='01'X×PTH11='01'X THEN/* ANY PATHS?                 */
         B     @RC00180                                            0184
@RF00180 CLI   PTH01,X'01'                                         0184
         BE    @RT00184                                            0184
         CLI   PTH11,X'01'                                         0184
         BNE   @RF00184                                            0184
@RT00184 DS    0H                                                  0185
*         RCODE=0;                  /* SET RETURN CODE ZERO          */
*                                                                  0185
         MVI   RCODE,X'00'                                         0185
*   /*****************************************************************/
*   /*                                                               */
*   /* NO PATHS EXIST. SET RETURN CODE                               */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0186
*       ELSE                                                       0186
*         RCODE=4;                  /* SET RETURN CODE FOUR          */
         B     @RC00184                                            0186
@RF00184 MVI   RCODE,X'04'                                         0186
*   END;                            /* END OF CPU TEST               */
@EL00005 DS    0H                                                  0187
@EF00005 DS    0H                                                  0187
@ER00005 LM    @14,@12,12(@13)                                     0187
         BR    @14                                                 0187
*   DECLARE                         /* GENERAL PURPOSE REGISTERS     */
*     GPR01F FIXED(31) REG(1);                                     0188
*   DECLARE                         /* COMMON VARIABLES              */
*     I256C CHAR(256) BASED,                                       0189
*     I031F FIXED(31) BASED,                                       0189
*     I031P PTR(31) BASED,                                         0189
*     I015F FIXED(15) BASED,                                       0189
*     I015P PTR(15) BASED,                                         0189
*     I008P PTR(8) BASED,                                          0189
*     I001C CHAR(1) BASED;                                         0189
*   END                             /* *************** END OF IEEVDEV*/
*                                                                  0190
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */
*/*%INCLUDE SYSLIB  (IHASDWA )                                       */
*/*%INCLUDE SYSLIB  (IEFUCBOB)                                       */
*/*%INCLUDE SYSLIB  (IECDLCH )                                       */
*/*%INCLUDE SYSLIB  (IECDCAT )                                       */
*/*%INCLUDE SYSLIB  (CVT     )                                       */
*/*%INCLUDE SYSLIB  (IHAPCCA )                                       */
*/*%INCLUDE SYSLIB  (IHACSD  )                                       */
*                                                                  0190
*       ;                                                          0190
@DATA    DS    0H
@DATD    DSECT
         DS    0F
@SA00001 DS    18F
@PC00001 DS    1F
IEEVDEV  CSECT
         DS    0F
@CF00086 DC    F'4'
@CF00039 DC    F'8'
@CF00033 DC    F'12'
@CF01784 DC    F'20'
@CF01817 DC    F'516096'
@DATD    DSECT
         DS    0D
PATHMAP  DS    CL8
         ORG   PATHMAP
PATH1    DS    BL2
         ORG   PATH1
CHN00    DS    BL1
         ORG   PATHMAP+2
PTH00    DS    BL1
PTH01    DS    BL1
PATH2    DS    BL2
         ORG   PATH2
CHN10    DS    BL1
         ORG   PATHMAP+6
PTH10    DS    BL1
PTH11    DS    BL1
         ORG   PATHMAP+8
RCODE    DS    BL1
ABIND    DS    BL1
         DS    CL2
@NM00002 DS    CL84
         ORG   @NM00002
REGSAVE  DS    FL4
REGSAVEA DS    18F
FUNCPTR  DS    FL4
         ORG   FUNCPTR
FUNCTION DS    BL1
UCBPOINT DS    AL3
         ORG   @NM00002+80
PRMPTR   DS    FL4
         ORG   @NM00002+84
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA
@ENDDATD EQU   *
IEEVDEV  CSECT
         DS    0F
@SIZDATD DC    AL1(0)
         DC    AL3(@ENDDATD-@DATD)
         DS    0D
@00      EQU   00                      EQUATES FOR REGISTERS 0-15
@01      EQU   01
@02      EQU   02
@03      EQU   03
@04      EQU   04
@05      EQU   05
@06      EQU   06
@07      EQU   07
@08      EQU   08
@09      EQU   09
@10      EQU   10
@11      EQU   11
@12      EQU   12
@13      EQU   13
@14      EQU   14
@15      EQU   15
UCBPTR   EQU   @03
R2       EQU   @02
SAVEPTR  EQU   @13
R4       EQU   @04
R5       EQU   @05
R14      EQU   @14
REASON   EQU   @15
R15      EQU   @15
R1       EQU   @01
SDWAPTR  EQU   @01
GPR01F   EQU   @01
R10      EQU   @10
R11      EQU   @11
R12      EQU   @12
CVTPTR   EQU   16
PCCAPTR  EQU   16
LCHPTR   EQU   16
CATPTR   EQU   16
SDWA     EQU   0
SDWAFIOB EQU   SDWA+4
SDWAABCC EQU   SDWAFIOB
SDWACMPF EQU   SDWAABCC
SDWACTL1 EQU   SDWA+8
SDWACMKA EQU   SDWACTL1
SDWAMWPA EQU   SDWACTL1+1
SDWAPMKA EQU   SDWACTL1+4
SDWACTL2 EQU   SDWA+16
SDWACMKP EQU   SDWACTL2
SDWAMWPP EQU   SDWACTL2+1
SDWAPMKP EQU   SDWACTL2+4
SDWAGRSV EQU   SDWA+24
SDWANAME EQU   SDWA+88
SDWAEC1  EQU   SDWA+104
SDWAEMK1 EQU   SDWAEC1
SDWAMWP1 EQU   SDWAEC1+1
SDWAINT1 EQU   SDWAEC1+2
SDWANXT1 EQU   SDWAEC1+4
SDWAAEC1 EQU   SDWA+112
SDWAILC1 EQU   SDWAAEC1+1
SDWAINC1 EQU   SDWAAEC1+2
SDWAICD1 EQU   SDWAINC1+1
SDWAEC2  EQU   SDWA+120
SDWAEMK2 EQU   SDWAEC2
SDWAMWP2 EQU   SDWAEC2+1
SDWAINT2 EQU   SDWAEC2+2
SDWANXT2 EQU   SDWAEC2+4
SDWAAEC2 EQU   SDWA+128
SDWAILC2 EQU   SDWAAEC2+1
SDWAINC2 EQU   SDWAAEC2+2
SDWAICD2 EQU   SDWAINC2+1
SDWASRSV EQU   SDWA+136
SDWAIDNT EQU   SDWA+200
SDWAMCH  EQU   SDWA+204
SDWASTCK EQU   SDWAMCH
SDWAMCHI EQU   SDWAMCH+8
SDWAMCHS EQU   SDWAMCHI
SDWAMCHD EQU   SDWAMCHI+1
SDWARSR1 EQU   SDWAMCH+12
SDWARSR2 EQU   SDWAMCH+13
SDWAFLGS EQU   SDWA+232
SDWAERRA EQU   SDWAFLGS
SDWAERRB EQU   SDWAFLGS+1
SDWAERRC EQU   SDWAFLGS+2
SDWAERRD EQU   SDWAFLGS+3
SDWAIOFS EQU   SDWA+238
SDWACPUA EQU   SDWA+248
SDWAPARQ EQU   SDWA+252
SDWAACF2 EQU   SDWAPARQ+1
SDWAACF3 EQU   SDWAPARQ+2
SDWAACF4 EQU   SDWAPARQ+3
SDWALKWA EQU   SDWA+256
SDWALKWS EQU   SDWALKWA
SDWARECP EQU   SDWA+292
SDWASNPA EQU   SDWA+320
SDWADUMP EQU   SDWASNPA
SDWADPFS EQU   SDWADUMP+1
SDWADDAT EQU   SDWASNPA+4
SDWASDAT EQU   SDWADDAT
SDWAPDAT EQU   SDWADDAT+2
SDWADPSA EQU   SDWA+328
SDWADPSL EQU   SDWADPSA
SDWARA   EQU   SDWA+400
SDWADPVA EQU   SDWARA+2
UCB      EQU   0
UCBOB    EQU   0
UCBJBNR  EQU   UCBOB
UCBFL5   EQU   UCBOB+1
UCBAF    EQU   UCBFL5
UCBNALOC EQU   UCBFL5
UCBID    EQU   UCBOB+2
UCBSTAT  EQU   UCBOB+3
UCBONLI  EQU   UCBSTAT
UCBCHAN  EQU   UCBOB+4
UCBCHA   EQU   UCBCHAN
UCBUA    EQU   UCBCHAN+1
UCBSFLS  EQU   UCBOB+6
UCBFLA   EQU   UCBSFLS
UCBFL1   EQU   UCBFLA
UCBBSY   EQU   UCBFL1
UCBNRY   EQU   UCBFL1
UCBPST   EQU   UCBFL1
UCBCUB   EQU   UCBFL1
UCBFLB   EQU   UCBSFLS+1
UCBCHM   EQU   UCBOB+8
UCBCHM1  EQU   UCBCHM
UCBPTH0  EQU   UCBCHM1
UCBPTH1  EQU   UCBCHM1
UCBLCI   EQU   UCBOB+10
UCBWGT   EQU   UCBOB+12
UCBVORSN EQU   UCBWGT
UCBVHRSN EQU   UCBWGT
UCBTYP   EQU   UCBOB+16
UCBTBYT1 EQU   UCBTYP
UCB1FEA5 EQU   UCBTBYT1
UCB1FEA6 EQU   UCBTBYT1
UCBTBYT2 EQU   UCBTYP+1
UCB2OPT2 EQU   UCBTBYT2
UCBDUDN1 EQU   UCB2OPT2
UCB2OPT3 EQU   UCBTBYT2
UCBDUDN2 EQU   UCB2OPT3
UCB2OPT4 EQU   UCBTBYT2
UCBRWTAU EQU   UCB2OPT4
UCB2OPT6 EQU   UCBTBYT2
UCB2OPT7 EQU   UCBTBYT2
UCBTBYT3 EQU   UCBTYP+2
UCBDVCLS EQU   UCBTBYT3
UCBTBYT4 EQU   UCBTYP+3
UCBEXTPT EQU   UCBOB+20
UCBFLC   EQU   UCBEXTPT
UCBDEV   EQU   UCBOB+24
UCBCMEXT EQU   0
UCBATI   EQU   UCBCMEXT+3
@NM00054 EQU   UCBATI
UCBFLP1  EQU   UCBCMEXT+5
UCBMT    EQU   0
UCBOCR   EQU   0
UCB3540X EQU   0
UCBDKBYT EQU   UCB3540X+6
UCBUCS   EQU   0
UCBUCSOP EQU   UCBUCS+4
UCBFCBOP EQU   UCBUCS+5
UCBBGN   EQU   0
LCH      EQU   0
LCHENTRY EQU   LCH
LCHTCH   EQU   LCH+16
LCHFLA   EQU   LCH+21
CAT      EQU   0
CATENTRY EQU   CAT
CATFLG   EQU   CATENTRY
CATFLA   EQU   CAT+1
CVTMAP   EQU   0
CVTDAR   EQU   CVTMAP+72
CVTFLGS1 EQU   CVTDAR
CVTDCB   EQU   CVTMAP+116
CVTILCH  EQU   CVTMAP+140
CVTIERLC EQU   CVTMAP+144
CVTOPTA  EQU   CVTMAP+182
CVTOPTB  EQU   CVTMAP+183
CVTGTF   EQU   CVTMAP+236
CVTGTFST EQU   CVTGTF
CVTGTFS  EQU   CVTGTFST
CVTSTATE EQU   CVTGTFST
CVTTMODE EQU   CVTGTFST
CVTFORM  EQU   CVTGTFST
CVTAQAVT EQU   CVTMAP+240
CVTTCMFG EQU   CVTAQAVT
CVTVOLM2 EQU   CVTMAP+244
CVTTATA  EQU   CVTVOLM2
CVTTSKS  EQU   CVTTATA
CVTVOLF2 EQU   CVTTSKS
CVTTAT   EQU   CVTTATA+1
CVTATER  EQU   CVTMAP+248
CVTEXT1  EQU   CVTMAP+252
CVTPURG  EQU   CVTMAP+260
CVTQMSG  EQU   CVTMAP+268
CVTDMSR  EQU   CVTMAP+272
CVTERPV  EQU   CVTMAP+316
CVTINTLA EQU   CVTMAP+320
CVTAPF   EQU   CVTMAP+324
CVTEXT2  EQU   CVTMAP+328
CVTHJES  EQU   CVTMAP+332
CVTPGSIA EQU   CVTMAP+348
CVTA1F1  EQU   CVTMAP+356
CVTSYSK  EQU   CVTMAP+357
CVTVOLM1 EQU   CVTMAP+380
CVTVOLF1 EQU   CVTVOLM1
CVTATMCT EQU   CVTMAP+388
CVTXTNT1 EQU   0
CVTXTNT2 EQU   0
CVTDSSV  EQU   CVTXTNT2
CVTFLGBT EQU   CVTXTNT2+5
CVTQID   EQU   CVTXTNT2+24
CVTRV400 EQU   CVTXTNT2+52
CVTRV409 EQU   CVTXTNT2+53
CVTATCVT EQU   CVTXTNT2+64
CVTRV429 EQU   CVTXTNT2+84
CVTRV438 EQU   CVTXTNT2+85
CVTRV457 EQU   CVTXTNT2+112
CVTRV466 EQU   CVTXTNT2+113
CVTFIX   EQU   0
CVTRELNO EQU   CVTFIX+252
PCCA     EQU   0
PCCACPUA EQU   PCCA+16
PCCACAFM EQU   PCCA+18
PCCATMST EQU   PCCA+128
PCCATMFL EQU   PCCATMST
PCCATODE EQU   PCCATMST+1
PCCACCE  EQU   PCCATMST+2
PCCAINTE EQU   PCCATMST+3
PCCAEMSB EQU   PCCA+136
PCCAEMSI EQU   PCCAEMSB
PCCARISP EQU   PCCAEMSI
PCCAEMS2 EQU   PCCAEMSI+1
PCCAEMS3 EQU   PCCAEMSI+2
PCCARMSB EQU   PCCAEMSI+3
PCCAWERP EQU   PCCA+280
PCCACHPF EQU   PCCAWERP+4
PCCACHBL EQU   PCCAWERP+5
PCCACHVA EQU   PCCAWERP+6
PCCACHTS EQU   PCCAWERP+7
PCCACHS1 EQU   PCCA+288
PCCACHS2 EQU   PCCA+289
PCCACHRB EQU   PCCA+290
PCCACHF1 EQU   PCCA+308
PCCACHF2 EQU   PCCA+309
PCCACHF3 EQU   PCCA+310
PCCACHF4 EQU   PCCA+311
PCCACAT  EQU   PCCA+384
CSD      EQU   0
CSDCPUAL EQU   CSD+8
CSDSCWRD EQU   CSD+12
CSDSCFL1 EQU   CSDSCWRD
CSDSCFL2 EQU   CSDSCWRD+1
CSDSCFL3 EQU   CSDSCWRD+2
CSDSCFL4 EQU   CSDSCWRD+3
CSDFLAGS EQU   CSD+23
I001C    EQU   0
I008P    EQU   0
I015F    EQU   0
I015P    EQU   0
I031F    EQU   0
I031P    EQU   0
I256C    EQU   0
PARM     EQU   0
UCBADD   EQU   PARM
FCODE    EQU   PARM+4
CPUID    EQU   PARM+5
CHNID    EQU   PARM+6
UCBOBS01 EQU   UCBDEV
UCBSTAB  EQU   UCBOBS01+10
UCBBSVL  EQU   UCBSTAB
UCBPRSRS EQU   UCBSTAB
UCBDMCT  EQU   UCBOBS01+11
UCBFL4   EQU   UCBOBS01+13
UCBBASE  EQU   UCBOBS01+16
UCBOBS02 EQU   UCBDEV
UCBTFL1  EQU   UCBOBS02+19
UCBXTN   EQU   UCBOBS02+20
UCBVOPT  EQU   UCBXTN
UCBOBS03 EQU   UCBDEV
UCBXTADR EQU   UCBOBS03
UCBOBS04 EQU   UCBDEV
UCBBTA   EQU   UCBOBS04+12
UCBOBS06 EQU   UCBDEV
UCBAOF   EQU   UCBOBS06
UCBAOF1  EQU   UCBAOF
UCBAOF2  EQU   UCBAOF+1
@NM00053 EQU   UCBOBS06+3
UCBIRB   EQU   UCBOBS06+4
UCBGRAF  EQU   UCBIRB
UCBLDNCA EQU   UCBOBS06+8
UCBRDYQ  EQU   UCBLDNCA
UCBIRLN  EQU   UCBRDYQ
UCBLDNCB EQU   UCBRDYQ+1
UCBCTLNK EQU   UCBOBS06+12
UCBOBS07 EQU   UCBDEV
UCBOBS08 EQU   UCBDEV
UCBOBS09 EQU   UCBDEV
CVTS01   EQU   CVTPGSIA
CVTLPDIA EQU   CVTS01+12
CVTDIRST EQU   CVTLPDIA
CVTSLIDA EQU   CVTS01+24
CVTCTLFG EQU   CVTS01+50
CVTCSD   EQU   CVTS01+312
CVTPCCAT EQU   CVTS01+416
CVTRV210 EQU   CVTS01+424
CVTRV219 EQU   CVTS01+425
CVTRV228 EQU   CVTS01+426
CVTRV237 EQU   CVTS01+427
CVTMFRTR EQU   CVTS01+452
CVTRV262 EQU   CVTS01+468
CVTRV271 EQU   CVTS01+469
CVTRV280 EQU   CVTS01+470
CVTRV289 EQU   CVTS01+471
CVTGSDA  EQU   CVTS01+600
CVTCRCA  EQU   CVTS01+612
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS
CVTRV628 EQU   CVTS01+728
CVTRV627 EQU   CVTS01+724
CVTRV626 EQU   CVTS01+720
CVTRV625 EQU   CVTS01+716
CVTRV624 EQU   CVTS01+712
CVTRV623 EQU   CVTS01+708
CVTRV622 EQU   CVTS01+704
CVTRV621 EQU   CVTS01+700
CVTRV620 EQU   CVTS01+696
CVTRV619 EQU   CVTS01+692
CVTRV618 EQU   CVTS01+688
CVTRV617 EQU   CVTS01+684
CVTRV616 EQU   CVTS01+680
CVTRV615 EQU   CVTS01+676
CVTRV614 EQU   CVTS01+672
CVTRV613 EQU   CVTS01+668
CVTRV612 EQU   CVTS01+664
CVTRV611 EQU   CVTS01+660
CVTRV610 EQU   CVTS01+656
CVTRV609 EQU   CVTS01+652
CVTRV608 EQU   CVTS01+648
CVTRV607 EQU   CVTS01+644
CVTRV606 EQU   CVTS01+640
CVTRV605 EQU   CVTS01+636
CVTRV604 EQU   CVTS01+632
CVTRV603 EQU   CVTS01+628
CVTRV602 EQU   CVTS01+624
CVTSSCR  EQU   CVTS01+620
CVTEVENT EQU   CVTS01+616
CVTTPIO  EQU   CVTS01+608
CVTADV   EQU   CVTS01+604
CVTGSDAB EQU   CVTGSDA
CVTQV3   EQU   CVTS01+596
CVTQV2   EQU   CVTS01+592
CVTQV1   EQU   CVTS01+588
CVTRPT   EQU   CVTS01+584
CVTSSRB  EQU   CVTS01+580
CVTCSDRL EQU   CVTS01+576
CVTEXP1  EQU   CVTS01+572
CVTRMPMT EQU   CVTS01+568
CVTRMPTT EQU   CVTS01+564
CVTVPSA  EQU   CVTS01+560
CVTVSTOP EQU   CVTS01+556
CVTGTFR8 EQU   CVTS01+552
CVTQUIT  EQU   CVTS01+548
CVTVACR  EQU   CVTS01+544
CVTWTCB  EQU   CVTS01+540
CVTSTPRS EQU   CVTS01+536
CVT0PT02 EQU   CVTS01+532
CVTDARCM EQU   CVTS01+528
CVTIRECM EQU   CVTS01+524
CVTJRECM EQU   CVTS01+520
CVTVEMS0 EQU   CVTS01+516
CVTSPFRR EQU   CVTS01+512
CVTRLSTG EQU   CVTS01+508
CVT0TC0A EQU   CVTS01+504
CVTGMBR  EQU   CVTS01+500
CVTLFRM  EQU   CVTS01+496
CVTRMBR  EQU   CVTS01+492
CVTVIOP  EQU   CVTS01+488
CVTRV307 EQU   CVTS01+486
CVTRV306 EQU   CVTS01+484
CVTRV305 EQU   CVTS01+482
CVTRV304 EQU   CVTS01+480
CVTRV303 EQU   CVTS01+478
CVTRV302 EQU   CVTS01+476
CVTRV301 EQU   CVTS01+475
CVTRV300 EQU   CVTS01+474
CVTRV299 EQU   CVTS01+473
CVTRV298 EQU   CVTS01+472
CVTRV297 EQU   CVTRV289
CVTRV296 EQU   CVTRV289
CVTRV295 EQU   CVTRV289
CVTRV294 EQU   CVTRV289
CVTRV293 EQU   CVTRV289
CVTRV292 EQU   CVTRV289
CVTRV291 EQU   CVTRV289
CVTRV290 EQU   CVTRV289
CVTRV288 EQU   CVTRV280
CVTRV287 EQU   CVTRV280
CVTRV286 EQU   CVTRV280
CVTRV285 EQU   CVTRV280
CVTRV284 EQU   CVTRV280
CVTRV283 EQU   CVTRV280
CVTRV282 EQU   CVTRV280
CVTRV281 EQU   CVTRV280
CVTRV279 EQU   CVTRV271
CVTRV278 EQU   CVTRV271
CVTRV277 EQU   CVTRV271
CVTRV276 EQU   CVTRV271
CVTRV275 EQU   CVTRV271
CVTRV274 EQU   CVTRV271
CVTRV273 EQU   CVTRV271
CVTRV272 EQU   CVTRV271
CVTRV270 EQU   CVTRV262
CVTRV269 EQU   CVTRV262
CVTRV268 EQU   CVTRV262
CVTRV267 EQU   CVTRV262
CVTRV266 EQU   CVTRV262
CVTRV265 EQU   CVTRV262
CVTRV264 EQU   CVTRV262
CVTRV263 EQU   CVTRV262
CVTVFP   EQU   CVTS01+464
CVTVSI   EQU   CVTS01+460
CVTVPSIB EQU   CVTS01+456
CVTMFACT EQU   CVTMFRTR
CVTMFCTL EQU   CVTS01+448
CVTPVBP  EQU   CVTS01+444
CVTPWI   EQU   CVTS01+440
CVTRV254 EQU   CVTS01+438
CVTRV253 EQU   CVTS01+436
CVTRV252 EQU   CVTS01+434
CVTRV251 EQU   CVTS01+433
CVTRV250 EQU   CVTS01+432
CVTRV249 EQU   CVTS01+431
CVTRV248 EQU   CVTS01+430
CVTRV247 EQU   CVTS01+429
CVTRV246 EQU   CVTS01+428
CVTRV245 EQU   CVTRV237
CVTRV244 EQU   CVTRV237
CVTRV243 EQU   CVTRV237
CVTRV242 EQU   CVTRV237
CVTRV241 EQU   CVTRV237
CVTRV240 EQU   CVTRV237
CVTRV239 EQU   CVTRV237
CVTRV238 EQU   CVTRV237
CVTRV236 EQU   CVTRV228
CVTRV235 EQU   CVTRV228
CVTRV234 EQU   CVTRV228
CVTRV233 EQU   CVTRV228
CVTRV232 EQU   CVTRV228
CVTRV231 EQU   CVTRV228
CVTRV230 EQU   CVTRV228
CVTRV229 EQU   CVTRV228
CVTRV227 EQU   CVTRV219
CVTRV226 EQU   CVTRV219
CVTRV225 EQU   CVTRV219
CVTRV224 EQU   CVTRV219
CVTRV223 EQU   CVTRV219
CVTRV222 EQU   CVTRV219
CVTRV221 EQU   CVTRV219
CVTRV220 EQU   CVTRV219
CVTRV218 EQU   CVTRV210
CVTRV217 EQU   CVTRV210
CVTRV216 EQU   CVTRV210
CVTRV215 EQU   CVTRV210
CVTRV214 EQU   CVTRV210
CVTRV213 EQU   CVTRV210
CVTRV212 EQU   CVTRV210
CVTRV211 EQU   CVTRV210
CVTLCCAT EQU   CVTS01+420
CVTIPCRP EQU   CVTS01+412
CVTIPCRI EQU   CVTS01+408
CVTIPCDS EQU   CVTS01+404
CVTAIDVT EQU   CVTS01+400
CVTSSAP  EQU   CVTS01+396
CVTEHCIR EQU   CVTS01+392
CVTEHDEF EQU   CVTS01+388
CVTDAIR  EQU   CVTS01+384
CVTPERFM EQU   CVTS01+380
CVT044R2 EQU   CVTS01+376
CVTFETCH EQU   CVTS01+372
CVTRSTWD EQU   CVTS01+368
CVTSPOST EQU   CVTS01+364
CVTIOBP  EQU   CVTS01+360
CVTASMVT EQU   CVTS01+356
CVTRECRQ EQU   CVTS01+352
CVTWSAC  EQU   CVTS01+348
CVTRV149 EQU   CVTS01+344
CVTWSAL  EQU   CVTS01+340
CVTSPSA  EQU   CVTS01+336
CVTGLMN  EQU   CVTS01+332
CVTVEAC0 EQU   CVTS01+328
CVT062R1 EQU   CVTS01+324
CVTRPOST EQU   CVTS01+320
CVTDQIQE EQU   CVTS01+316
CVTLKRMA EQU   CVTS01+308
CVTRSPIE EQU   CVTS01+304
CVTRENQ  EQU   CVTS01+300
CVTLQCB  EQU   CVTS01+296
CVTFQCB  EQU   CVTS01+292
CVTQCS01 EQU   CVTS01+288
CVTAPFT  EQU   CVTS01+284
CVTPARRL EQU   CVTS01+280
CVTVWAIT EQU   CVTS01+276
CVTGSPL  EQU   CVTS01+272
CVTLSMQ  EQU   CVTS01+268
CVTGSMQ  EQU   CVTS01+264
CVTEXPRO EQU   CVTS01+260
CVTOPCTP EQU   CVTS01+256
CVTSIC   EQU   CVTS01+252
CVTTPIOS EQU   CVTS01+248
CVTRTMS  EQU   CVTS01+244
CVTSDBF  EQU   CVTS01+240
CVTSCBP  EQU   CVTS01+236
CVTSDMP  EQU   CVTS01+232
CVTSV60  EQU   CVTS01+228
CVTRTMCT EQU   CVTS01+224
CVTASCBL EQU   CVTS01+220
CVTASCBH EQU   CVTS01+216
CVTGDA   EQU   CVTS01+212
CVTASVT  EQU   CVTS01+208
CVTVVMDI EQU   CVTS01+204
CVTAQTOP EQU   CVTS01+200
CVTIOSCS EQU   CVTS01+196
CVTSDRM  EQU   CVTS01+192
CVTOPTE  EQU   CVTS01+188
CVTSTXU  EQU   CVTS01+184
CVTQUIS  EQU   CVTS01+180
CVTPARS  EQU   CVTS01+176
CVTS1EE  EQU   CVTS01+172
CVTFRAS  EQU   CVTS01+168
CVTQSAS  EQU   CVTS01+164
CVTCRAS  EQU   CVTS01+160
CVTCRMN  EQU   CVTS01+156
CVTDELCP EQU   CVTS01+152
CVTFRECL EQU   CVTS01+148
CVTGETCL EQU   CVTS01+144
CVTBLDCP EQU   CVTS01+140
CVTAUTHL EQU   CVTS01+136
CVTSCAN  EQU   CVTS01+132
CVTRV144 EQU   CVTS01+130
CVTMAXMP EQU   CVTS01+128
CVTSTCK  EQU   CVTS01+124
CVTRV139 EQU   CVTS01+123
CVTDSSAC EQU   CVTS01+122
CVTRV513 EQU   CVTS01+121
CVTIOSPL EQU   CVTS01+120
CVTPTGT  EQU   CVTS01+116
CVTCSPIE EQU   CVTS01+112
CVTSMFEX EQU   CVTS01+108
CVTOLT0A EQU   CVTS01+104
CVTSRBRT EQU   CVTS01+100
CVTPUTL  EQU   CVTS01+96
CVTRV519 EQU   CVTS01+92
CVTRV327 EQU   CVTS01+88
CVTRV326 EQU   CVTS01+84
CVTRV325 EQU   CVTS01+80
CVTRV324 EQU   CVTS01+76
CVT0VL01 EQU   CVTS01+72
CVTSHRVM EQU   CVTS01+68
CVTRV332 EQU   CVTS01+64
CVTTAS   EQU   CVTS01+60
CVTRSCN  EQU   CVTS01+56
CVTTRAC2 EQU   CVTS01+54
CVTTRACE EQU   CVTS01+52
CVTAPG   EQU   CVTS01+51
CVTSDTRC EQU   CVTCTLFG
CVTGTRCE EQU   CVTCTLFG
CVTNOMP  EQU   CVTCTLFG
CVTRSV79 EQU   CVTCTLFG
CVTDSTAT EQU   CVTCTLFG
CVTRSV78 EQU   CVTCTLFG
CVTRV333 EQU   CVTCTLFG
CVTRV323 EQU   CVTCTLFG
CVTSPVLK EQU   CVTS01+49
CVTRSV77 EQU   CVTS01+48
CVTRV331 EQU   CVTS01+44
CVTRV330 EQU   CVTS01+40
CVTRV329 EQU   CVTS01+36
CVTRV328 EQU   CVTS01+32
CVTRV322 EQU   CVTS01+28
CVTSLID  EQU   CVTSLIDA+1
CVTSYLK  EQU   CVTSLIDA
CVTRV321 EQU   CVTS01+20
CVTRV320 EQU   CVTS01+16
CVTLPDIR EQU   CVTLPDIA+1
CVTRSV69 EQU   CVTDIRST
CVTRSV68 EQU   CVTDIRST
CVTRSV67 EQU   CVTDIRST
CVTRSV66 EQU   CVTDIRST
CVTRSV65 EQU   CVTDIRST
CVTRSV64 EQU   CVTDIRST
CVTRSV63 EQU   CVTDIRST
CVTDICOM EQU   CVTDIRST
CVTPVTP  EQU   CVTS01+8
CVTLPDSR EQU   CVTS01+4
CVTGETL  EQU   CVTS01
UCBRV066 EQU   UCBOBS09+4
UCBIOSBA EQU   UCBOBS09
UCBRV042 EQU   UCBOBS08+5
UCBCTCF1 EQU   UCBOBS08+4
UCBCTCAD EQU   UCBOBS08
UCBICNCB EQU   UCBOBS07+4
UCBRV040 EQU   UCBOBS07
UCBCTLNA EQU   UCBCTLNK+1
UCBRLN   EQU   UCBCTLNK
UCBRDYQA EQU   UCBLDNCB
UCBINRLN EQU   UCBIRLN
UCBIRBA  EQU   UCBIRB+1
UCBRV039 EQU   UCBGRAF
UCBDWNR  EQU   UCBGRAF
UCBRPND  EQU   UCBGRAF
UCBUPM   EQU   UCBGRAF
UCBBTAM  EQU   UCBGRAF
UCBDRNO  EQU   UCBGRAF
UCBDRO   EQU   UCBGRAF
UCBOIP   EQU   UCBGRAF
UCBATRCD EQU   @NM00053
UCBSKPFG EQU   @NM00053
UCBRIPND EQU   @NM00053
UCBRTIAC EQU   @NM00053
UCBRSV79 EQU   @NM00053
UCBRSV78 EQU   @NM00053
UCBRSV77 EQU   @NM00053
UCBOLTEP EQU   @NM00053
UCBATNCT EQU   UCBOBS06+2
UCBRSV76 EQU   UCBAOF2
UCBRSV75 EQU   UCBAOF2
UCBRSV74 EQU   UCBAOF2
UCBRSV73 EQU   UCBAOF2
UCBRSV72 EQU   UCBAOF2
UCBRSV71 EQU   UCBAOF2
UCBRSV70 EQU   UCBAOF2
UCBRSV69 EQU   UCBAOF2
UCBRSV68 EQU   UCBAOF1
UCBRSV67 EQU   UCBAOF1
UCBRSV66 EQU   UCBAOF1
UCBRSV65 EQU   UCBAOF1
UCBRSV64 EQU   UCBAOF1
UCBOFNL  EQU   UCBAOF1
UCBOFSP  EQU   UCBAOF1
UCBOFMCR EQU   UCBAOF1
UCBBTB   EQU   UCBBTA+1
UCBDI    EQU   UCBBTA
UCBSNS   EQU   UCBOBS04+8
UCBTEB   EQU   UCBOBS04+4
UCBGCB   EQU   UCBOBS04+3
UCBOPEN  EQU   UCBOBS04+2
UCBSTART EQU   UCBOBS04
UCBXTNB  EQU   UCBXTN+1
UCBRSV22 EQU   UCBVOPT
UCBRSV21 EQU   UCBVOPT
UCBRSV20 EQU   UCBVOPT
UCBESVE  EQU   UCBVOPT
UCBERPC  EQU   UCBVOPT
UCBESVC  EQU   UCBVOPT
UCBEVA   EQU   UCBVOPT
UCBESV   EQU   UCBVOPT
UCBRV009 EQU   UCBTFL1
UCBRV008 EQU   UCBTFL1
UCBRV007 EQU   UCBTFL1
UCBRV006 EQU   UCBTFL1
UCBRV005 EQU   UCBTFL1
UCBRV038 EQU   UCBTFL1
UCBNSLTP EQU   UCBTFL1
UCBNLTP  EQU   UCBTFL1
UCBRES1B EQU   UCBOBS02+18
UCBFSER  EQU   UCBOBS02+12
@NM00052 EQU   UCBOBS02+4
UCBFSEQ  EQU   UCBOBS02+2
UCBFSCT  EQU   UCBOBS02
UCBNEXP  EQU   UCBOBS01+20
UCBRES1A EQU   UCBOBS01+15
UCBUSER  EQU   UCBOBS01+14
UCBFL47  EQU   UCBFL4
UCBFL46  EQU   UCBFL4
UCBFL45  EQU   UCBFL4
UCBRV065 EQU   UCBFL4
UCBDSS   EQU   UCBFL4
UCBRV028 EQU   UCBFL4
UCBWDAV  EQU   UCBFL4
UCBDAVV  EQU   UCBFL4
UCBSQC   EQU   UCBOBS01+12
UCBDATP  EQU   UCBOBS01+12
UCBDMC   EQU   UCBDMCT
UCBMOUNT EQU   UCBDMCT
UCBBNUL  EQU   UCBSTAB
UCBSHAR  EQU   UCBSTAB
UCBBSTR  EQU   UCBSTAB
UCBBPUB  EQU   UCBSTAB
UCBBPRV  EQU   UCBSTAB
UCBBALB  EQU   UCBPRSRS
UCBPGFL  EQU   UCBSTAB
UCBDVSHR EQU   UCBBSVL
UCBVOLI  EQU   UCBOBS01+4
UCBVTOC  EQU   UCBOBS01
@NM00001 EQU   PARM+7
@NM00059 EQU   CSD+160
CSDMASK  EQU   CSD+128
CSDUCNT  EQU   CSD+124
CSDTCNT  EQU   CSD+120
CSDGDTOD EQU   CSD+116
CSDGDINT EQU   CSD+112
CSDGDCC  EQU   CSD+108
CSDDDRCT EQU   CSD+106
CSDRV044 EQU   CSD+104
CSDMAFF  EQU   CSD+24
CSDRV038 EQU   CSDFLAGS
CSDRV037 EQU   CSDFLAGS
CSDRV036 EQU   CSDFLAGS
CSDRV035 EQU   CSDFLAGS
CSDRV034 EQU   CSDFLAGS
CSDRV033 EQU   CSDFLAGS
CSDRV032 EQU   CSDFLAGS
CSDMP    EQU   CSDFLAGS
CSDACR   EQU   CSD+22
CSDMF1CP EQU   CSD+20
CSDRV043 EQU   CSD+16
CSDRV030 EQU   CSDSCFL4
CSDRV029 EQU   CSDSCFL4
CSDRV028 EQU   CSDSCFL4
CSDRV027 EQU   CSDSCFL4
CSDRV026 EQU   CSDSCFL4
CSDRV025 EQU   CSDSCFL4
CSDRV024 EQU   CSDSCFL4
CSDRV023 EQU   CSDSCFL4
CSDRV022 EQU   CSDSCFL3
CSDRV021 EQU   CSDSCFL3
CSDRV020 EQU   CSDSCFL3
CSDRV019 EQU   CSDSCFL3
CSDRV018 EQU   CSDSCFL3
CSDRV017 EQU   CSDSCFL3
CSDRV016 EQU   CSDSCFL3
CSDRV015 EQU   CSDSCFL3
CSDRV014 EQU   CSDSCFL2
CSDRV013 EQU   CSDSCFL2
CSDRV012 EQU   CSDSCFL2
CSDRV011 EQU   CSDSCFL2
CSDRV010 EQU   CSDSCFL2
CSDRV009 EQU   CSDSCFL2
CSDRV008 EQU   CSDSCFL2
CSDRV007 EQU   CSDSCFL2
CSDRV006 EQU   CSDSCFL1
CSDRV005 EQU   CSDSCFL1
CSDRV004 EQU   CSDSCFL1
CSDRV003 EQU   CSDSCFL1
CSDRV002 EQU   CSDSCFL1
CSDRV001 EQU   CSDSCFL1
CSDSYSND EQU   CSDSCFL1
CSDRV042 EQU   CSDSCFL1
CSDCPUOL EQU   CSD+10
CSDSAFF  EQU   CSDCPUAL
CSDCHAD  EQU   CSD+6
CSDCPUJS EQU   CSD+4
CSDCSD   EQU   CSD
@NM00058 EQU   PCCA+512
PCCARV36 EQU   PCCA+380
PCCARV35 EQU   PCCA+378
PCCARV01 EQU   PCCA+377
PCCACPUM EQU   PCCA+376
PCCARV63 EQU   PCCA+372
PCCARV62 EQU   PCCA+368
PCCARV61 EQU   PCCA+364
PCCARV60 EQU   PCCA+360
PCCARV59 EQU   PCCA+356
PCCARV58 EQU   PCCA+352
PCCARV57 EQU   PCCA+348
PCCARV56 EQU   PCCA+344
PCCARV55 EQU   PCCA+340
PCCARV54 EQU   PCCA+336
PCCALOGA EQU   PCCA+332
PCCACHID EQU   PCCA+324
PCCACHSV EQU   PCCA+312
PCCARV79 EQU   PCCACHF4
PCCARV78 EQU   PCCACHF4
PCCARV77 EQU   PCCACHF4
PCCARV76 EQU   PCCACHF4
PCCARV75 EQU   PCCACHF4
PCCARV74 EQU   PCCACHF4
PCCARV73 EQU   PCCACHF4
PCCARV72 EQU   PCCACHF4
PCCARV71 EQU   PCCACHF3
PCCARV70 EQU   PCCACHF3
PCCARV69 EQU   PCCACHF3
PCCARV68 EQU   PCCACHF3
PCCARV67 EQU   PCCACHF3
PCCARV66 EQU   PCCACHF3
PCCARV65 EQU   PCCACHF3
PCCARV64 EQU   PCCACHF3
PCCACF28 EQU   PCCACHF2
PCCACF27 EQU   PCCACHF2
PCCACF26 EQU   PCCACHF2
PCCACF25 EQU   PCCACHF2
PCCACF24 EQU   PCCACHF2
PCCACF23 EQU   PCCACHF2
PCCACF22 EQU   PCCACHF2
PCCACF21 EQU   PCCACHF2
PCCACF18 EQU   PCCACHF1
PCCACF17 EQU   PCCACHF1
PCCACF16 EQU   PCCACHF1
PCCACF15 EQU   PCCACHF1
PCCACF14 EQU   PCCACHF1
PCCACF13 EQU   PCCACHF1
PCCACF12 EQU   PCCACHF1
PCCACF11 EQU   PCCACHF1
PCCARV05 EQU   PCCA+306
PCCACHPB EQU   PCCA+305
PCCALGP2 EQU   PCCA+304
PCCALGP1 EQU   PCCA+303
PCCALOGL EQU   PCCA+302
PCCARV80 EQU   PCCA+300
PCCACHW2 EQU   PCCA+296
PCCACHW1 EQU   PCCA+292
PCCAIOSI EQU   PCCA+291
PCCACNRB EQU   PCCACHRB
PCCACCVB EQU   PCCACHRB
PCCACSNB EQU   PCCACHRB
PCCARV52 EQU   PCCACHRB
PCCACHIB EQU   PCCACHRB
PCCACTIB EQU   PCCACHRB
PCCACINB EQU   PCCACHRB
PCCACSIB EQU   PCCACHRB
PCCARV51 EQU   PCCACHS2
PCCARV50 EQU   PCCACHS2
PCCACCRA EQU   PCCACHS2
PCCACURC EQU   PCCACHS2
PCCACNLG EQU   PCCACHS2
PCCACMOD EQU   PCCACHS2
PCCACALT EQU   PCCACHS2
PCCACIOR EQU   PCCACHS2
PCCARV47 EQU   PCCACHS1
PCCACUCB EQU   PCCACHS1
PCCACIBC EQU   PCCACHS1
PCCACAND EQU   PCCACHS1
PCCACNLS EQU   PCCACHS1
PCCACFRR EQU   PCCACHS1
PCCACNRE EQU   PCCACHS1
PCCACCMP EQU   PCCACHS1
PCCACSEQ EQU   PCCACHTS
PCCACDIN EQU   PCCACHTS
PCCARV44 EQU   PCCACHTS
PCCARV43 EQU   PCCACHTS
PCCACTEC EQU   PCCACHTS
PCCACDAV EQU   PCCACHVA
PCCACCHV EQU   PCCACHVA
PCCACCMD EQU   PCCACHVA
PCCACUNS EQU   PCCACHVA
PCCACSQV EQU   PCCACHVA
PCCARV42 EQU   PCCACHVA
PCCARV41 EQU   PCCACHVA
PCCACITF EQU   PCCACHVA
PCCARV40 EQU   PCCACHBL
PCCARV39 EQU   PCCACHBL
PCCARV38 EQU   PCCACHBL
PCCACCUE EQU   PCCACHBL
PCCACSTG EQU   PCCACHBL
PCCACSCU EQU   PCCACHBL
PCCACCHA EQU   PCCACHBL
PCCACCPU EQU   PCCACHBL
PCCACNOR EQU   PCCACHPF
PCCACCNT EQU   PCCACHPF
PCCACSNS EQU   PCCACHPF
PCCARV37 EQU   PCCACHPF
PCCACHIO EQU   PCCACHPF
PCCACTIO EQU   PCCACHPF
PCCACINT EQU   PCCACHPF
PCCACSIO EQU   PCCACHPF
PCCACHUB EQU   PCCAWERP
PCCACHEL EQU   PCCA+168
PCCALRBR EQU   PCCA+164
PCCALRBV EQU   PCCA+160
PCCAPWAR EQU   PCCA+156
PCCAPWAV EQU   PCCA+152
PCCAEMSA EQU   PCCAEMSB+12
PCCAEMSE EQU   PCCAEMSB+8
PCCAEMSP EQU   PCCAEMSB+4
PCCARMS  EQU   PCCARMSB
PCCARV34 EQU   PCCARMSB
PCCARV33 EQU   PCCARMSB
PCCARV32 EQU   PCCARMSB
PCCARV31 EQU   PCCARMSB
PCCARV30 EQU   PCCARMSB
PCCARV29 EQU   PCCARMSB
PCCARV28 EQU   PCCARMSB
PCCARV27 EQU   PCCAEMS3
PCCARV26 EQU   PCCAEMS3
PCCARV25 EQU   PCCAEMS3
PCCARV24 EQU   PCCAEMS3
PCCARV23 EQU   PCCAEMS3
PCCARV22 EQU   PCCAEMS3
PCCARV21 EQU   PCCAEMS3
PCCARV20 EQU   PCCAEMS3
PCCARV19 EQU   PCCAEMS2
PCCARV18 EQU   PCCAEMS2
PCCARV17 EQU   PCCAEMS2
PCCARV16 EQU   PCCAEMS2
PCCARV15 EQU   PCCAEMS2
PCCARV14 EQU   PCCAEMS2
PCCARV13 EQU   PCCAEMS2
PCCARV12 EQU   PCCAEMS2
PCCARV11 EQU   PCCARISP
PCCARV10 EQU   PCCARISP
PCCARV09 EQU   PCCARISP
PCCARV08 EQU   PCCARISP
PCCARV07 EQU   PCCARISP
PCCARV06 EQU   PCCARISP
PCCASERL EQU   PCCARISP
PCCAPARL EQU   PCCARISP
PCCARPB  EQU   PCCA+132
PCCACTIN EQU   PCCAINTE
PCCANFIN EQU   PCCAINTE
PCCANUIN EQU   PCCAINTE
PCCACTCC EQU   PCCACCE
PCCANFCC EQU   PCCACCE
PCCANUCC EQU   PCCACCE
PCCACTTD EQU   PCCATODE
PCCANFTD EQU   PCCATODE
PCCANUTD EQU   PCCATODE
PCCARV04 EQU   PCCATMFL
PCCARV03 EQU   PCCATMFL
PCCARV02 EQU   PCCATMFL
PCCAMINT EQU   PCCATMFL
PCCAMCC  EQU   PCCATMFL
PCCAVKIL EQU   PCCATMFL
PCCASYNC EQU   PCCATMFL
PCCAINIT EQU   PCCATMFL
PCCARV9E EQU   PCCA+124
PCCARV9D EQU   PCCA+120
PCCARV9C EQU   PCCA+116
PCCARV9B EQU   PCCA+112
PCCARV9A EQU   PCCA+108
PCCARV99 EQU   PCCA+104
PCCARV98 EQU   PCCA+100
PCCARV97 EQU   PCCA+96
PCCARV96 EQU   PCCA+92
PCCARV95 EQU   PCCA+88
PCCARV94 EQU   PCCA+84
PCCARV93 EQU   PCCA+80
PCCARV92 EQU   PCCA+76
PCCARV91 EQU   PCCA+72
PCCARV90 EQU   PCCA+68
PCCARV89 EQU   PCCA+64
PCCARV88 EQU   PCCA+60
PCCARV87 EQU   PCCA+56
PCCARV86 EQU   PCCA+52
PCCARV85 EQU   PCCA+48
PCCARV84 EQU   PCCA+44
PCCARV83 EQU   PCCA+40
PCCARV82 EQU   PCCA+36
PCCARV81 EQU   PCCA+32
PCCAPSAR EQU   PCCA+28
PCCAPSAV EQU   PCCA+24
PCCATQEP EQU   PCCA+20
PCCACPID EQU   PCCA+4
PCCAPCCA EQU   PCCA
CVTLEVL  EQU   CVTRELNO+2
CVTNUMB  EQU   CVTRELNO
CVTMDL   EQU   CVTFIX+250
@NM00057 EQU   CVTFIX+248
@NM00056 EQU   CVTFIX
CVTRV482 EQU   CVTXTNT2+128
CVTRV481 EQU   CVTXTNT2+124
CVTRV480 EQU   CVTXTNT2+120
CVTRV479 EQU   CVTXTNT2+118
CVTRV478 EQU   CVTXTNT2+117
CVTRV477 EQU   CVTXTNT2+116
CVTRV476 EQU   CVTXTNT2+115
CVTRV475 EQU   CVTXTNT2+114
CVTRV474 EQU   CVTRV466
CVTRV473 EQU   CVTRV466
CVTRV472 EQU   CVTRV466
CVTRV471 EQU   CVTRV466
CVTRV470 EQU   CVTRV466
CVTRV469 EQU   CVTRV466
CVTRV468 EQU   CVTRV466
CVTRV467 EQU   CVTRV466
CVTRV465 EQU   CVTRV457
CVTRV464 EQU   CVTRV457
CVTRV463 EQU   CVTRV457
CVTRV462 EQU   CVTRV457
CVTRV461 EQU   CVTRV457
CVTRV460 EQU   CVTRV457
CVTRV459 EQU   CVTRV457
CVTRV458 EQU   CVTRV457
CVTRV456 EQU   CVTXTNT2+108
CVTRV455 EQU   CVTXTNT2+104
CVTRV454 EQU   CVTXTNT2+100
CVTRV453 EQU   CVTXTNT2+96
CVTRV452 EQU   CVTXTNT2+94
CVTRV451 EQU   CVTXTNT2+92
CVTRV450 EQU   CVTXTNT2+90
CVTRV449 EQU   CVTXTNT2+88
CVTRV448 EQU   CVTXTNT2+87
CVTRV447 EQU   CVTXTNT2+86
CVTRV446 EQU   CVTRV438
CVTRV445 EQU   CVTRV438
CVTRV444 EQU   CVTRV438
CVTRV443 EQU   CVTRV438
CVTRV442 EQU   CVTRV438
CVTRV441 EQU   CVTRV438
CVTRV440 EQU   CVTRV438
CVTRV439 EQU   CVTRV438
CVTRV437 EQU   CVTRV429
CVTRV436 EQU   CVTRV429
CVTRV435 EQU   CVTRV429
CVTRV434 EQU   CVTRV429
CVTRV433 EQU   CVTRV429
CVTRV432 EQU   CVTRV429
CVTRV431 EQU   CVTRV429
CVTRV430 EQU   CVTRV429
CVTRV428 EQU   CVTXTNT2+80
CVTRV427 EQU   CVTXTNT2+76
CVTRV426 EQU   CVTXTNT2+72
CVTRV425 EQU   CVTXTNT2+68
CVTATACT EQU   CVTATCVT
CVTRV423 EQU   CVTXTNT2+62
CVTRV422 EQU   CVTXTNT2+60
CVTRV421 EQU   CVTXTNT2+58
CVTRV420 EQU   CVTXTNT2+56
CVTRV419 EQU   CVTXTNT2+55
CVTRV418 EQU   CVTXTNT2+54
CVTRV417 EQU   CVTRV409
CVTRV416 EQU   CVTRV409
CVTRV415 EQU   CVTRV409
CVTRV414 EQU   CVTRV409
CVTRV413 EQU   CVTRV409
CVTRV412 EQU   CVTRV409
CVTRV411 EQU   CVTRV409
CVTRV410 EQU   CVTRV409
CVTRV408 EQU   CVTRV400
CVTRV407 EQU   CVTRV400
CVTRV406 EQU   CVTRV400
CVTRV405 EQU   CVTRV400
CVTRV404 EQU   CVTRV400
CVTRV403 EQU   CVTRV400
CVTRV402 EQU   CVTRV400
CVTRV401 EQU   CVTRV400
CVTICB   EQU   CVTXTNT2+48
CVTSKTA  EQU   CVTXTNT2+44
CVTRSV99 EQU   CVTXTNT2+40
CVTRSV98 EQU   CVTXTNT2+36
CVTRSV97 EQU   CVTXTNT2+34
CVTRSV96 EQU   CVTXTNT2+32
CVTOLTEP EQU   CVTXTNT2+28
CVTQIDA  EQU   CVTQID+1
CVTRSV95 EQU   CVTQID
CVTRSV94 EQU   CVTXTNT2+20
CVTRSV93 EQU   CVTXTNT2+16
CVTRSV92 EQU   CVTXTNT2+12
CVTDEBVR EQU   CVTXTNT2+8
CVTRSV91 EQU   CVTXTNT2+6
CVTRSV9H EQU   CVTFLGBT
CVTRSV9G EQU   CVTFLGBT
CVTRSV9F EQU   CVTFLGBT
CVTRSV9E EQU   CVTFLGBT
CVTRSV9D EQU   CVTFLGBT
CVTRSV9C EQU   CVTFLGBT
CVTVME   EQU   CVTFLGBT
CVTNPE   EQU   CVTFLGBT
CVTNUCLS EQU   CVTXTNT2+4
CVTDSSVA EQU   CVTDSSV+1
CVTRSV89 EQU   CVTDSSV
CVTRSV88 EQU   CVTXTNT1+8
CVTRSV87 EQU   CVTXTNT1+4
CVTFACHN EQU   CVTXTNT1
CVTRV488 EQU   CVTMAP+412
CVTRV487 EQU   CVTMAP+408
CVTRV486 EQU   CVTMAP+404
CVTRV485 EQU   CVTMAP+400
CVTACTAP EQU   CVTMAP+396
CVTAUTH  EQU   CVTMAP+392
CVTATMCA EQU   CVTATMCT+1
CVTATMST EQU   CVTATMCT
CVTRSV61 EQU   CVTMAP+384
CVTVOLT1 EQU   CVTVOLM1+1
CVTVOLI1 EQU   CVTVOLF1
CVTSTOA  EQU   CVTMAP+376
CVTRSV58 EQU   CVTMAP+374
CVTRSV57 EQU   CVTMAP+372
CVTDDCE  EQU   CVTMAP+368
CVTPNWFR EQU   CVTMAP+364
CVTSMF   EQU   CVTMAP+360
CVTSULK  EQU   CVTMAP+358
CVTSLKO  EQU   CVTSYSK
CVTSLKP  EQU   CVTSYSK
CVTSLKQ  EQU   CVTSYSK
CVTSLKR  EQU   CVTSYSK
CVTRSV56 EQU   CVTSYSK
CVTRSV55 EQU   CVTSYSK
CVTRSV54 EQU   CVTSYSK
CVTRSV53 EQU   CVTSYSK
CVTRSV52 EQU   CVTA1F1
CVTRSV51 EQU   CVTA1F1
CVTRSV50 EQU   CVTA1F1
CVTRSV49 EQU   CVTA1F1
CVTRSV48 EQU   CVTA1F1
CVTRSV47 EQU   CVTA1F1
CVTSRSW  EQU   CVTA1F1
CVTPFSW  EQU   CVTA1F1
CVTPCVT  EQU   CVTMAP+352
CVTRSV46 EQU   CVTMAP+344
CVTRSV45 EQU   CVTMAP+340
CVTRSV44 EQU   CVTMAP+338
CVTRSV43 EQU   CVTMAP+336
CVTHJESA EQU   CVTHJES+1
CVTRSV42 EQU   CVTHJES
CVTEXT2A EQU   CVTEXT2+1
CVTRSV41 EQU   CVTEXT2
CVTAPFA  EQU   CVTAPF+1
CVTRSV40 EQU   CVTAPF
CVTRV518 EQU   CVTINTLA
CVTRV517 EQU   CVTERPV
CVTEORM  EQU   CVTMAP+312
CVTMCHPR EQU   CVTMAP+308
CVTTZ    EQU   CVTMAP+304
CVTJEPS  EQU   CVTMAP+300
CVTJESCT EQU   CVTMAP+296
CVTMODE  EQU   CVTMAP+292
CVTPTRV  EQU   CVTMAP+288
CVTREAL  EQU   CVTMAP+284
CVTRSV39 EQU   CVTMAP+280
CVTRSV38 EQU   CVTMAP+276
CVTDMSRA EQU   CVTDMSR+1
CVTRSV37 EQU   CVTDMSR
CVTQMSGA EQU   CVTQMSG+1
CVTRSV36 EQU   CVTQMSG
CVTAMFF  EQU   CVTMAP+264
CVTPURGA EQU   CVTPURG+1
CVTRSV35 EQU   CVTPURG
CVTCBSP  EQU   CVTMAP+256
CVTATERA EQU   CVTATER+1
CVTSYST  EQU   CVTATER
CVTVOLT2 EQU   CVTTAT
CVTVOLI2 EQU   CVTVOLF2
CVTAQAVB EQU   CVTAQAVT+1
CVTRSV34 EQU   CVTTCMFG
CVTRSV33 EQU   CVTTCMFG
CVTRSV32 EQU   CVTTCMFG
CVTRSV31 EQU   CVTTCMFG
CVTRSV30 EQU   CVTTCMFG
CVTRSV29 EQU   CVTTCMFG
CVTRSV28 EQU   CVTTCMFG
CVTTCRDY EQU   CVTTCMFG
CVTGTFA  EQU   CVTGTF+1
CVTRSV27 EQU   CVTGTFST
CVTRNIO  EQU   CVTGTFST
CVTUSR   EQU   CVTGTFST
CVTRV318 EQU   CVTFORM
CVTRV317 EQU   CVTTMODE
CVTRV316 EQU   CVTSTATE
CVTRV315 EQU   CVTGTFS
CVTGTFAV EQU   CVTGTFS
CVT0SCR1 EQU   CVTMAP+232
CVTRV515 EQU   CVTMAP+228
CVTRMS   EQU   CVTMAP+224
CVTPATCH EQU   CVTMAP+220
CVTTSCE  EQU   CVTMAP+216
CVTLNKSC EQU   CVTMAP+214
CVTQABST EQU   CVTMAP+212
CVTMDLDS EQU   CVTMAP+208
CVTUSER  EQU   CVTMAP+204
CVTABEND EQU   CVTMAP+200
CVTSMCA  EQU   CVTMAP+196
CVTRSV18 EQU   CVTMAP+192
CVTQLPAQ EQU   CVTMAP+188
CVTQCDSR EQU   CVTMAP+184
CVTRSV17 EQU   CVTOPTB
CVTRSV16 EQU   CVTOPTB
CVTFP    EQU   CVTOPTB
CVTAPTHR EQU   CVTOPTB
CVTNLOG  EQU   CVTOPTB
CVTTOD   EQU   CVTOPTB
CVTCTIMS EQU   CVTOPTB
CVTPROT  EQU   CVTOPTB
CVTXPFP  EQU   CVTOPTA
CVTASCII EQU   CVTOPTA
CVTRSV13 EQU   CVTOPTA
CVTRSV12 EQU   CVTOPTA
CVTNIP   EQU   CVTOPTA
CVTDDR   EQU   CVTOPTA
CVTAPR   EQU   CVTOPTA
CVTCCH   EQU   CVTOPTA
CVTSNCTR EQU   CVTMAP+180
CVTQMWR  EQU   CVTMAP+176
CVTQOCR  EQU   CVTMAP+172
CVT1EF00 EQU   CVTMAP+168
CVTMZ00  EQU   CVTMAP+164
CVTHEAD  EQU   CVTMAP+160
CVTRSV11 EQU   CVTMAP+156
CVT0PT01 EQU   CVTMAP+152
CVTMSER  EQU   CVTMAP+148
CVTRV516 EQU   CVTIERLC
CVT0DS   EQU   CVTMAP+136
CVTFBOSV EQU   CVTMAP+132
CVTNUCB  EQU   CVTMAP+128
CVTIXAVL EQU   CVTMAP+124
CVTIOQET EQU   CVTMAP+120
CVTDCBA  EQU   CVTMAP+117
CVTMVS2  EQU   CVTDCB
CVT6DAT  EQU   CVTDCB
CVT4MPS  EQU   CVTDCB
CVTRSV09 EQU   CVTDCB
CVT4MS1  EQU   CVTDCB
CVT2SPS  EQU   CVTDCB
CVT1SSS  EQU   CVTDCB
CVTRSV08 EQU   CVTDCB
CVTSTB   EQU   CVTMAP+112
CVTQTD00 EQU   CVTMAP+108
CVTQTE00 EQU   CVTMAP+104
CVTCUCB  EQU   CVTMAP+100
CVTSJQ   EQU   CVTMAP+96
CVTPBLDL EQU   CVTMAP+92
CVTTPC   EQU   CVTMAP+88
CVTSVDCB EQU   CVTMAP+84
CVTBRET  EQU   CVTMAP+82
CVTEXIT  EQU   CVTMAP+80
CVT0FN00 EQU   CVTMAP+76
CVTDARA  EQU   CVTDAR+1
CVTRSV07 EQU   CVTFLGS1
CVTRSV06 EQU   CVTFLGS1
CVTRSV05 EQU   CVTFLGS1
CVTRSV04 EQU   CVTFLGS1
CVTRSV03 EQU   CVTFLGS1
CVTRSV02 EQU   CVTFLGS1
CVTRSV01 EQU   CVTFLGS1
CVTDMPLK EQU   CVTFLGS1
CVTXITP  EQU   CVTMAP+68
CVTZDTAB EQU   CVTMAP+64
CVTMSLT  EQU   CVTMAP+60
CVTDATE  EQU   CVTMAP+56
CVTBTERM EQU   CVTMAP+52
CVTSYSAD EQU   CVTMAP+48
CVTXTLER EQU   CVTMAP+44
CVTILK2  EQU   CVTMAP+40
CVTILK1  EQU   CVTMAP+36
CVTPRLTV EQU   CVTMAP+32
CVTPCNVT EQU   CVTMAP+28
CVT0VL00 EQU   CVTMAP+24
CVTXAPG  EQU   CVTMAP+20
CVTBUF   EQU   CVTMAP+16
CVTJOB   EQU   CVTMAP+12
CVTLINK  EQU   CVTMAP+8
CVT0EF00 EQU   CVTMAP+4
CVTTCBP  EQU   CVTMAP
CVT      EQU   CVTMAP
CATEND   EQU   CAT+8
CATCHID  EQU   CAT+4
CATSIOCT EQU   CAT+2
CASFLARS EQU   CATFLA
CATBSY   EQU   CATFLA
CATFLG7  EQU   CATFLG
CATFLG6  EQU   CATFLG
CATFLG5  EQU   CATFLG
CATNID   EQU   CATFLG
CATNCPU  EQU   CATFLG
CATNGEN  EQU   CATFLG
CATNOP   EQU   CATFLG
CATRES1  EQU   CATFLG
LCHEND   EQU   LCH+32
LCHPYBSY EQU   LCH+30
LCHLGBSY EQU   LCH+28
LCHRSV03 EQU   LCH+26
LCHTOTAL EQU   LCH+24
LCHRSV02 EQU   LCH+22
@NM00055 EQU   LCHFLA
LCHLKHLD EQU   LCHFLA
LCHCHCNT EQU   LCH+20
LCHRSV01 EQU   LCH+12
LCHLOCK  EQU   LCH+8
LCHLST   EQU   LCH+4
LCHFST   EQU   LCHENTRY
UCBERADR EQU   UCBUCS+12
UCBFCBID EQU   UCBUCS+8
UCBERCNT EQU   UCBUCS+7
UCBRSV51 EQU   UCBUCS+6
UCBRSV50 EQU   UCBFCBOP
UCBRSV49 EQU   UCBFCBOP
UCBRSV48 EQU   UCBFCBOP
UCBRSV47 EQU   UCBFCBOP
UCBRSV46 EQU   UCBFCBOP
UCBRSV45 EQU   UCBFCBOP
UCBRSV44 EQU   UCBFCBOP
UCBFCBO1 EQU   UCBFCBOP
UCBUCSPE EQU   UCBUCSOP
UCBRSV43 EQU   UCBUCSOP
UCBRSV42 EQU   UCBUCSOP
UCBRSV41 EQU   UCBUCSOP
UCBRSV40 EQU   UCBUCSOP
UCBRSV39 EQU   UCBUCSOP
UCBUCSO2 EQU   UCBUCSOP
UCBUCSO1 EQU   UCBUCSOP
UCBUCSID EQU   UCBUCS
UCBRV073 EQU   UCB3540X+7
UCBRV072 EQU   UCBDKBYT
UCBRV071 EQU   UCBDKBYT
UCBRV070 EQU   UCBDKBYT
UCBRV069 EQU   UCBDKBYT
UCBRV068 EQU   UCBDKBYT
UCBRV067 EQU   UCBDKBYT
UCBVLVER EQU   UCBDKBYT
UCBDKAMX EQU   UCBDKBYT
UCBVLSER EQU   UCB3540X
UCBRDATA EQU   UCBOCR+4
UCBFRID  EQU   UCBOCR
UCBCLN   EQU   UCBMT+14
UCBERG   EQU   UCBMT+12
UCBMS    EQU   UCBMT+11
UCBNB    EQU   UCBMT+10
UCBPW    EQU   UCBMT+9
UCBPR    EQU   UCBMT+8
UCBSIO   EQU   UCBMT+6
UCBTW    EQU   UCBMT+5
UCBTR    EQU   UCBMT+4
UCBTWT   EQU   UCBMT+3
UCBTRT   EQU   UCBMT+2
UCBCTD   EQU   UCBMT
UCBWTOID EQU   UCBCMEXT+17
UCBRV043 EQU   UCBCMEXT+16
UCBASID  EQU   UCBCMEXT+14
UCBMFCNT EQU   UCBCMEXT+12
UCBPMSK  EQU   UCBCMEXT+10
UCBCCWOF EQU   UCBCMEXT+8
UCBRV041 EQU   UCBCMEXT+6
UCBRV036 EQU   UCBFLP1
UCBRV035 EQU   UCBFLP1
UCBRV034 EQU   UCBFLP1
UCBRV033 EQU   UCBFLP1
UCBRV032 EQU   UCBFLP1
UCBRV031 EQU   UCBFLP1
UCBSHRUP EQU   UCBFLP1
UCBNSRCH EQU   UCBFLP1
UCBSNSCT EQU   UCBCMEXT+4
UCBHPDV  EQU   @NM00054
UCBHALI  EQU   @NM00054
UCBRSV09 EQU   @NM00054
UCBRSV08 EQU   @NM00054
UCBRSV07 EQU   @NM00054
UCBRSV06 EQU   @NM00054
UCBRSV05 EQU   @NM00054
UCBRSV04 EQU   @NM00054
UCBDTI   EQU   UCBCMEXT+2
UCBSTI   EQU   UCBCMEXT+1
UCBETI   EQU   UCBCMEXT
UCBEXTP  EQU   UCBEXTPT+1
UCBDDRSW EQU   UCBFLC
UCBTICBT EQU   UCBFLC
UCBIVRR  EQU   UCBFLC
UCBIVRS  EQU   UCBFLC
UCBITF   EQU   UCBFLC
UCBUDE   EQU   UCBFLC
UCBWAA   EQU   UCBFLC
UCBATTP  EQU   UCBFLC
UCBUNTYP EQU   UCBTBYT4
UCBRSV11 EQU   UCBDVCLS
UCBRSV10 EQU   UCBDVCLS
UCB3CHAR EQU   UCBDVCLS
UCB3UREC EQU   UCBDVCLS
UCB3DISP EQU   UCBDVCLS
UCB3DACC EQU   UCBDVCLS
UCB3COMM EQU   UCBDVCLS
UCB3TAPE EQU   UCBDVCLS
UCBDVPWR EQU   UCB2OPT7
UCBVLPWR EQU   UCB2OPT6
UCB2OPT5 EQU   UCBTBYT2
UCBRVDEV EQU   UCBRWTAU
UCBRPS   EQU   UCBDUDN2
UCBRR    EQU   UCBDUDN1
UCB2OPT1 EQU   UCBTBYT2
UCB2OPT0 EQU   UCBTBYT2
UCB1FEA7 EQU   UCBTBYT1
UCBD6250 EQU   UCB1FEA6
UCBD1600 EQU   UCB1FEA5
UCB1FEA4 EQU   UCBTBYT1
UCB1FEA3 EQU   UCBTBYT1
UCB1FEA2 EQU   UCBTBYT1
UCB1FEA1 EQU   UCBTBYT1
UCB1FEA0 EQU   UCBTBYT1
UCBNAME  EQU   UCBOB+13
UCBRV029 EQU   UCBWGT
UCBMTPXP EQU   UCBWGT
UCBREW   EQU   UCBWGT
UCBPUB   EQU   UCBWGT
UCBOUT   EQU   UCBWGT
UCBIN    EQU   UCBWGT
UCBCPU   EQU   UCBOB+11
UCBCNT   EQU   UCBOB+9
UCBRV017 EQU   UCBCHM1
UCBRV016 EQU   UCBCHM1
UCBRV015 EQU   UCBCHM1
UCBRV014 EQU   UCBCHM1
UCBSPB   EQU   UCBPTH1
UCBPPB   EQU   UCBPTH1
UCBSPA   EQU   UCBPTH0
UCBPPA   EQU   UCBPTH0
UCBFLB7  EQU   UCBFLB
UCBFLB6  EQU   UCBFLB
UCBCRHSN EQU   UCBFLB
UCBCRHRV EQU   UCBFLB
UCBRESVH EQU   UCBFLB
UCBSPST  EQU   UCBFLB
UCBASNS  EQU   UCBFLB
UCBIORST EQU   UCBFLB
UCBQISCE EQU   UCBFL1
UCBACTV  EQU   UCBFL1
UCBSAP   EQU   UCBFL1
UCBNOTRC EQU   UCBCUB
UCBPSNS  EQU   UCBFL1
UCBUSING EQU   UCBPST
UCBNOTRD EQU   UCBNRY
UCBBUSYD EQU   UCBBSY
UCBDADI  EQU   UCBSTAT
UCBSYSR  EQU   UCBSTAT
UCBPRES  EQU   UCBSTAT
UCBALOC  EQU   UCBSTAT
UCBUNLD  EQU   UCBSTAT
UCBRESV  EQU   UCBSTAT
UCBCHGS  EQU   UCBSTAT
UCBALTPH EQU   UCBFL5
UCBALTCU EQU   UCBFL5
UCBENVRD EQU   UCBFL5
UCBVSDR  EQU   UCBFL5
UCBSASK  EQU   UCBFL5
UCBAMV   EQU   UCBAF
UCBDCC   EQU   UCBFL5
UCBMONT  EQU   UCBJBNR
UCBRV011 EQU   UCBJBNR
UCBRSV02 EQU   UCBJBNR
UCBOLDSM EQU   UCBJBNR
UCBRV003 EQU   UCBJBNR
UCBRV002 EQU   UCBJBNR
UCBJES3  EQU   UCBJBNR
UCBVRDEV EQU   UCBJBNR
UCBCMSEG EQU   UCBOB
UCBPFXND EQU   UCB+512
UCBIOQ   EQU   UCB+508
UCBLOCK  EQU   UCB+504
UCBPXST  EQU   UCB+504
@NM00051 EQU   UCB
@NM00050 EQU   SDWA+512
SDWAVRA  EQU   SDWARA+4
SDWAURAL EQU   SDWARA+3
@NM00049 EQU   SDWADPVA
SDWAEBC  EQU   SDWADPVA
SDWAHEX  EQU   SDWADPVA
SDWAVRAL EQU   SDWARA
@NM00048 EQU   SDWA+396
SDWACOMP EQU   SDWA+392
SDWARCPL EQU   SDWA+364
@NM00047 EQU   SDWADPSA+32
SDWATO4  EQU   SDWADPSL+28
SDWAFRM4 EQU   SDWADPSL+24
SDWATO3  EQU   SDWADPSL+20
SDWAFRM3 EQU   SDWADPSL+16
SDWATO2  EQU   SDWADPSL+12
SDWAFRM2 EQU   SDWADPSL+8
SDWATO1  EQU   SDWADPSL+4
SDWAFRM1 EQU   SDWADPSL
@NM00046 EQU   SDWADDAT+3
@NM00045 EQU   SDWAPDAT
SDWAUSPL EQU   SDWAPDAT
SDWADPSW EQU   SDWAPDAT
SDWATJPA EQU   SDWAPDAT
SDWATLPA EQU   SDWAPDAT
SDWADREG EQU   SDWAPDAT
SDWADSAH EQU   SDWAPDAT
SDWADSAS EQU   SDWAPDAT
@NM00044 EQU   SDWADDAT+1
@NM00043 EQU   SDWASDAT
SDWAQQS  EQU   SDWASDAT
SDWACBS  EQU   SDWASDAT
SDWAGTF  EQU   SDWASDAT
SDWASWA  EQU   SDWASDAT
SDWALSQA EQU   SDWASDAT
SDWASQA  EQU   SDWASDAT
SDWANUC  EQU   SDWASDAT
@NM00042 EQU   SDWADUMP+2
@NM00041 EQU   SDWADPFS
SDWASLST EQU   SDWADPFS
@NM00040 EQU   SDWADPFS
SDWADLST EQU   SDWADPFS
SDWADPT  EQU   SDWADPFS
SDWADPID EQU   SDWADUMP
SDWADPLA EQU   SDWA+316
SDWAREXN EQU   SDWARECP+16
SDWACSCT EQU   SDWARECP+8
SDWAMODN EQU   SDWARECP
@NM00039 EQU   SDWALKWA+32
SDWATALW EQU   SDWALKWS+28
SDWATDLW EQU   SDWALKWS+24
SDWATNLW EQU   SDWALKWS+20
SDWAAPLW EQU   SDWALKWS+16
SDWAIPLW EQU   SDWALKWS+12
SDWAILLW EQU   SDWALKWS+8
SDWAIULW EQU   SDWALKWS+4
SDWAICLW EQU   SDWALKWS
SDWAFLLK EQU   SDWAACF4
SDWACMS  EQU   SDWAACF4
SDWAOPTM EQU   SDWAACF4
SDWATADB EQU   SDWAACF4
SDWATDNB EQU   SDWAACF4
SDWATNCB EQU   SDWAACF4
SDWAILCH EQU   SDWAACF4
SDWAIUCB EQU   SDWAACF4
SDWAICAT EQU   SDWAACF3
SDWAIPRG EQU   SDWAACF3
SDWASALL EQU   SDWAACF3
SDWAASMP EQU   SDWAACF3
SDWADISP EQU   SDWAACF3
@NM00038 EQU   SDWAACF3
@NM00037 EQU   SDWAACF2
SDWAFREE EQU   SDWAACF2
SDWAUPRG EQU   SDWAACF2
@NM00036 EQU   SDWAACF2
SDWASPIN EQU   SDWAACF2
@NM00035 EQU   SDWAACF2
SDWARCRD EQU   SDWAACF2
SDWARCDE EQU   SDWAPARQ
SDWALCPU EQU   SDWACPUA+2
@NM00034 EQU   SDWACPUA
SDWARECA EQU   SDWA+244
SDWARTYA EQU   SDWA+240
@NM00033 EQU   SDWA+239
@NM00032 EQU   SDWAIOFS
SDWANIOP EQU   SDWAIOFS
SDWANOIO EQU   SDWAIOFS
SDWAIOHT EQU   SDWAIOFS
SDWAIOQR EQU   SDWAIOFS
SDWAFMID EQU   SDWA+236
@NM00031 EQU   SDWAERRD
SDWAMCIV EQU   SDWAERRD
SDWARPIV EQU   SDWAERRD
SDWAMABD EQU   SDWAERRD
SDWACTS  EQU   SDWAERRD
SDWASTAE EQU   SDWAERRD
SDWANRBE EQU   SDWAERRD
SDWACLUP EQU   SDWAERRD
@NM00030 EQU   SDWAERRC
SDWAEAS  EQU   SDWAERRC
SDWAPERC EQU   SDWAERRC
SDWAIRB  EQU   SDWAERRC
SDWASTAI EQU   SDWAERRC
SDWASTAF EQU   SDWAERRC
SDWASRBM EQU   SDWAERRB
SDWALDIS EQU   SDWAERRB
SDWAENRB EQU   SDWAERRB
SDWATYP1 EQU   SDWAERRB
@NM00029 EQU   SDWAERRB
SDWAPGIO EQU   SDWAERRA
SDWATEXC EQU   SDWAERRA
SDWASVCE EQU   SDWAERRA
SDWAABTM EQU   SDWAERRA
SDWASVCD EQU   SDWAERRA
SDWARKEY EQU   SDWAERRA
SDWAPCHK EQU   SDWAERRA
SDWAMCHK EQU   SDWAERRA
SDWATIME EQU   SDWAMCH+20
SDWARFSA EQU   SDWAMCH+16
@NM00028 EQU   SDWAMCH+14
SDWAVEQR EQU   SDWARSR2
SDWAPGFX EQU   SDWARSR2
SDWAFLSQ EQU   SDWARSR2
SDWAFSQA EQU   SDWARSR2
SDWANUCL EQU   SDWARSR2
SDWASPER EQU   SDWARSR2
SDWAINTC EQU   SDWARSR2
SDWAOFLN EQU   SDWARSR2
SDWACHNG EQU   SDWARSR1
SDWAMSER EQU   SDWARSR1
@NM00027 EQU   SDWARSR1
SDWACPID EQU   SDWAMCH+10
SDWATERR EQU   SDWAMCHD
SDWAFPRX EQU   SDWAMCHD
SDWAINSF EQU   SDWAMCHD
SDWAACR  EQU   SDWAMCHD
SDWASCK  EQU   SDWAMCHD
SDWAPSWU EQU   SDWAMCHD
SDWAREGU EQU   SDWAMCHD
SDWASKYF EQU   SDWAMCHD
@NM00026 EQU   SDWAMCHS
SDWARSRF EQU   SDWAMCHS
SDWARSRC EQU   SDWAMCHS
SDWAINVP EQU   SDWAMCHS
SDWATSVL EQU   SDWAMCHS
SDWARCDF EQU   SDWAMCHS
SDWASRVL EQU   SDWAMCHS
SDWASCKE EQU   SDWASTCK+4
SDWASCKB EQU   SDWASTCK
SDWALNTH EQU   SDWAIDNT+1
SDWASPID EQU   SDWAIDNT
SDWASR15 EQU   SDWASRSV+60
SDWASR14 EQU   SDWASRSV+56
SDWASR13 EQU   SDWASRSV+52
SDWASR12 EQU   SDWASRSV+48
SDWASR11 EQU   SDWASRSV+44
SDWASR10 EQU   SDWASRSV+40
SDWASR09 EQU   SDWASRSV+36
SDWASR08 EQU   SDWASRSV+32
SDWASR07 EQU   SDWASRSV+28
SDWASR06 EQU   SDWASRSV+24
SDWASR05 EQU   SDWASRSV+20
SDWASR04 EQU   SDWASRSV+16
SDWASR03 EQU   SDWASRSV+12
SDWASR02 EQU   SDWASRSV+8
SDWASR01 EQU   SDWASRSV+4
SDWASR00 EQU   SDWASRSV
SDWATRN2 EQU   SDWAAEC2+4
SDWAIPC2 EQU   SDWAICD2
SDWAIMC2 EQU   SDWAICD2
SDWAIPR2 EQU   SDWAICD2
@NM00025 EQU   SDWAINC2
@NM00024 EQU   SDWAILC2
SDWAIL2  EQU   SDWAILC2
@NM00023 EQU   SDWAILC2
@NM00022 EQU   SDWAAEC2
SDWAADD2 EQU   SDWANXT2+1
@NM00021 EQU   SDWANXT2
@NM00020 EQU   SDWAEC2+3
SDWASGN2 EQU   SDWAINT2
SDWAEXP2 EQU   SDWAINT2
SDWADEC2 EQU   SDWAINT2
SDWAFPO2 EQU   SDWAINT2
SDWACC2  EQU   SDWAINT2
@NM00019 EQU   SDWAINT2
SDWAPGM2 EQU   SDWAMWP2
SDWAWAT2 EQU   SDWAMWP2
SDWAMCK2 EQU   SDWAMWP2
SDWAECT2 EQU   SDWAMWP2
SDWAKEY2 EQU   SDWAMWP2
SDWAEXT2 EQU   SDWAEMK2
SDWAIO2  EQU   SDWAEMK2
SDWATRM2 EQU   SDWAEMK2
@NM00018 EQU   SDWAEMK2
SDWAPER2 EQU   SDWAEMK2
@NM00017 EQU   SDWAEMK2
SDWATRAN EQU   SDWAAEC1+4
SDWAIPC1 EQU   SDWAICD1
SDWAIMC1 EQU   SDWAICD1
SDWAIPR1 EQU   SDWAICD1
@NM00016 EQU   SDWAINC1
@NM00015 EQU   SDWAILC1
SDWAIL1  EQU   SDWAILC1
@NM00014 EQU   SDWAILC1
@NM00013 EQU   SDWAAEC1
SDWAADD1 EQU   SDWANXT1+1
@NM00012 EQU   SDWANXT1
@NM00011 EQU   SDWAEC1+3
SDWASGN1 EQU   SDWAINT1
SDWAEXP1 EQU   SDWAINT1
SDWADEC1 EQU   SDWAINT1
SDWAFPO1 EQU   SDWAINT1
SDWACC1  EQU   SDWAINT1
@NM00010 EQU   SDWAINT1
SDWAPGM1 EQU   SDWAMWP1
SDWAWAT1 EQU   SDWAMWP1
SDWAMCK1 EQU   SDWAMWP1
SDWAECT1 EQU   SDWAMWP1
SDWAKEY1 EQU   SDWAMWP1
SDWAEXT1 EQU   SDWAEMK1
SDWAIO1  EQU   SDWAEMK1
SDWATRM1 EQU   SDWAEMK1
@NM00009 EQU   SDWAEMK1
SDWAPER1 EQU   SDWAEMK1
@NM00008 EQU   SDWAEMK1
SDWAIOBR EQU   SDWA+100
SDWAEPA  EQU   SDWA+96
@NM00007 EQU   SDWANAME+4
SDWARBAD EQU   SDWANAME
SDWAGR15 EQU   SDWAGRSV+60
SDWAGR14 EQU   SDWAGRSV+56
SDWAGR13 EQU   SDWAGRSV+52
SDWAGR12 EQU   SDWAGRSV+48
SDWAGR11 EQU   SDWAGRSV+44
SDWAGR10 EQU   SDWAGRSV+40
SDWAGR09 EQU   SDWAGRSV+36
SDWAGR08 EQU   SDWAGRSV+32
SDWAGR07 EQU   SDWAGRSV+28
SDWAGR06 EQU   SDWAGRSV+24
SDWAGR05 EQU   SDWAGRSV+20
SDWAGR04 EQU   SDWAGRSV+16
SDWAGR03 EQU   SDWAGRSV+12
SDWAGR02 EQU   SDWAGRSV+8
SDWAGR01 EQU   SDWAGRSV+4
SDWAGR00 EQU   SDWAGRSV
SDWANXTP EQU   SDWACTL2+5
SDWASGP  EQU   SDWAPMKP
SDWAEUP  EQU   SDWAPMKP
SDWADOP  EQU   SDWAPMKP
SDWAFPP  EQU   SDWAPMKP
SDWACCP  EQU   SDWAPMKP
SDWAILP  EQU   SDWAPMKP
SDWAINTP EQU   SDWACTL2+2
SDWASPVP EQU   SDWAMWPP
SDWAWATP EQU   SDWAMWPP
SDWAMCKP EQU   SDWAMWPP
@NM00006 EQU   SDWAMWPP
SDWAKEYP EQU   SDWAMWPP
SDWAEXTP EQU   SDWACMKP
SDWAIOP  EQU   SDWACMKP
SDWANXTA EQU   SDWACTL1+5
SDWASGA  EQU   SDWAPMKA
SDWAEUA  EQU   SDWAPMKA
SDWADOA  EQU   SDWAPMKA
SDWAFPA  EQU   SDWAPMKA
SDWACCA  EQU   SDWAPMKA
SDWAILA  EQU   SDWAPMKA
SDWAINTA EQU   SDWACTL1+2
SDWASPVA EQU   SDWAMWPA
SDWAWATA EQU   SDWAMWPA
SDWAMCKA EQU   SDWAMWPA
@NM00005 EQU   SDWAMWPA
SDWAKEYA EQU   SDWAMWPA
SDWAEXTA EQU   SDWACMKA
SDWAIOA  EQU   SDWACMKA
SDWACMPC EQU   SDWAABCC+1
@NM00004 EQU   SDWACMPF
SDWASTCC EQU   SDWACMPF
@NM00003 EQU   SDWACMPF
SDWASTEP EQU   SDWACMPF
SDWAREQ  EQU   SDWACMPF
SDWAPARM EQU   SDWA
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS
@RC00059 EQU   @RC00053
@RC00057 EQU   @RC00053
@RC00055 EQU   @RC00053
@RC00119 EQU   @EL00002
@RC00145 EQU   @EL00003
@RC00170 EQU   @EL00004
@RC00166 EQU   @EL00004
@RC00161 EQU   @EL00004
@RC00184 EQU   @EL00005
@RC00180 EQU   @EL00005
@RC00175 EQU   @EL00005
@PB00005 EQU   @EL00001
@RC00078 EQU   @RC00059
@RC00073 EQU   @RC00059
@RC00068 EQU   @RC00059
@RC00120 EQU   @RC00119
@RC00155 EQU   @RC00145
@RC00151 EQU   @RC00145
@RC00146 EQU   @RC00145
@RC00167 EQU   @RC00166
@PB00004 EQU   @PB00005
@RC00181 EQU   @RC00180
@RC00138 EQU   @RC00120
@RC00134 EQU   @RC00120
@RC00126 EQU   @RC00120
@RC00121 EQU   @RC00120
@RC00152 EQU   @RC00151
@PB00003 EQU   @PB00004
@RC00131 EQU   @RC00126
@RC00127 EQU   @RC00126
@RC00135 EQU   @RC00134
@PB00002 EQU   @PB00003
@RC00103 EQU   @PB00002
@RC00128 EQU   @RC00127
@ENDDATA EQU   *
         END   IEEVDEV,(C'PLS0002',0603,74193)
