 /* SVC99 INTERFACE - WRITTEN 10/25/80 BY PAUL DIXON */;
 %DCL (@9CPRI_S,@9CPRI_E,@9CPRI_R) CHAR;
 %@9CPRI_S = '''00000001''B';
 %@9CPRI_E = '''00000010''B';
 %@9CPRI_R = '''00000100''B';
 %@9CPRI: PROC(CPRI) RETURNS(CHAR) STATEMENT;
 DCL (CPRI,R1) CHAR;
 IF SUBSTR(CPRI,1,1) = ''''
    THEN
       DO;
          R1 = @9CPRI_E;
          IF      CPRI  = '''S''' THEN R1 = @9CPRI_S;
          ELSE IF CPRI  = '''R''' THEN R1 = @9CPRI_R;
          ELSE IF CPRI ^= '''E''' THEN
                  NOTE('INVALID CPRI ' ×× CPRI,8);
          RETURN ('DO; @9_CPRI.@9P  = ' ×× R1 ××
             '; @9I = @9I + 1; @9TUPL(@9I) = ADDR(@9_CPRI); END;');
       END;
    ELSE
       RETURN('DO; @9_CPRI.@9P  = ' ×× CPRI ×× '; @9I = @9I + 1; @9TUPL(
 @9I) = ADDR(@9_CPRI); END;');
 %END @9CPRI;
 %ACTIVATE @9CPRI;
 DCL 01 @9_CPRI UNALIGNED, 05 @9K FIXED BIN(15) INIT(58), 05 @9# FIXED
     BIN(15) INIT(1), 05 @9L FIXED BIN(15) INIT(1), 05 @9P  BIT(8);
