 /* SVC99 INTERFACE - WRITTEN 10/25/80 BY PAUL DIXON */;
 %@9DCBDDN: PROC(DCBDDN) RETURNS(CHAR) STATEMENT;
 DCL DCBDDN CHAR;
 RETURN('DO; @9_DCBDDN.@9P  = ' ×× DCBDDN ××
        '; @9I = @9I + 1; @9TUPL(@9I) = ADDR(@9_DCBDDN); END;');
 %END @9DCBDDN;
 %ACTIVATE @9DCBDDN;
 DCL 01 @9_DCBDDN UNALIGNED, 05 @9K FIXED BIN(15) INIT(45), 05 @9# FIXED
     BIN(15) INIT(1), 05 @9L FIXED BIN(15) INIT(8), 05 @9P CHAR(8);
