 /* SVC99 INTERFACE - WRITTEN 10/25/80 BY PAUL DIXON */;
 %DCL (@9DSORET_UNDET,@9DSORET_TR,@9DSORET_VSAM,@9DSORET_TQ,
       @9DSORET_TX,@9DSORET_GS,@9DSORET_PO,@9DSORET_POU,
       @9DSORET_MQ,@9DSORET_CQ,@9DSORET_CX,@9DSORET_DA,@9DSORET_DAU,
       @9DSORET_PS,@9DSORET_PSU,@9DSORET_IS,@9DSORET_ISU) CHAR;
 %@9DSORET_UNDET = '''0000000000000000''B';
 %@9DSORET_TR    = '''0000000000000100''B';
 %@9DSORET_VSAM  = '''0000000000001000''B';
 %@9DSORET_TQ    = '''0000000000100000''B';
 %@9DSORET_TX    = '''0000000001000000''B';
 %@9DSORET_GS    = '''0000000010000000''B';
 %@9DSORET_PO    = '''0000001000000000''B';
 %@9DSORET_POU   = '''0000001100000000''B';
 %@9DSORET_MQ    = '''0000010000000000''B';
 %@9DSORET_CQ    = '''0000100000000000''B';
 %@9DSORET_CX    = '''0001000000000000''B';
 %@9DSORET_DA    = '''0010000000000000''B';
 %@9DSORET_DAU   = '''0010000100000000''B';
 %@9DSORET_PS    = '''0100000000000000''B';
 %@9DSORET_PSU   = '''0100000100000000''B';
 %@9DSORET_IS    = '''1000000000000000''B';
 %@9DSORET_ISU   = '''1000000100000000''B';
 %@9DSORET: PROC(DSORET) RETURNS(CHAR) STATEMENT;
 DCL DSORET CHAR;
 @9@_DSORET = DSORET ×× ' = @9_DSORET.@9P ;';
 RETURN('DO; @9I = @9I + 1; @9TUPL(@9I) = ADDR(@9_DSORET); END;');
 %END @9DSORET;
 %ACTIVATE @9DSORET;
 DCL 01 @9_DSORET UNALIGNED, 05 @9K FIXED BIN(15) INIT(87), 05 @9# FIXED
     BIN(15) INIT(1), 05 @9L FIXED BIN(15) INIT(2), 05 @9P  BIT(16)
     INIT('');
