 /* SVC99 INTERFACE - WRITTEN 10/25/80 BY PAUL DIXON */;
 %@9LIMCT: PROC(LIMCT) RETURNS(CHAR) STATEMENT;
 DCL LIMCT CHAR;
 RETURN('DO; @9FB31 = ' ×× LIMCT ×× '; @9_LIMCT.@9P  = SUBSTR(UNSPEC(@9F
 B31),9); @9I = @9I + 1; @9TUPL(@9I) = ADDR(@9_LIMCT); END;');
 %END @9LIMCT;
 %ACTIVATE @9LIMCT;
 DCL 01 @9_LIMCT UNALIGNED, 05 @9K FIXED BIN(15) INIT(65), 05 @9# FIXED
     BIN(15) INIT(1), 05 @9L FIXED BIN(15) INIT(3), 05 @9P  BIT(24);
