 /* SVC99 INTERFACE - WRITTEN 10/25/80 BY PAUL DIXON */;
 %@9RETDSN: PROC(RETDSN) RETURNS(CHAR) STATEMENT;
 DCL RETDSN CHAR;
 @9@_RETDSN = RETDSN ×× ' = @9_RETDSN.@9P ;';
 RETURN('DO; @9I = @9I + 1; @9TUPL(@9I) = ADDR(@9_RETDSN);
         @9_RETDSN.@9L = 44; @9_RETDSN.@9P = ''''; END;');
 %END @9RETDSN;
 %ACTIVATE @9RETDSN;
 DCL 01 @9_RETDSN UNALIGNED, 05 @9K FIXED BIN(15) INIT(5), 05 @9# FIXED
     BIN(15) INIT(1), 05 @9L FIXED BIN(15) INIT(44), 05 @9P CHAR(44)
     INIT('');
