 /* SVC99 INTERFACE - WRITTEN 10/25/80 BY PAUL DIXON */;
 %DCL (@9RETSTA_OLD,@9RETSTA_MOD,@9RETSTA_NEW,@9RETSTA_SHR) CHAR;
 %@9RETSTA_OLD = '''00000001''B';
 %@9RETSTA_MOD = '''00000010''B';
 %@9RETSTA_NEW = '''00000100''B';
 %@9RETSTA_SHR = '''00001000''B';
 %@9RETSTA: PROC(RETSTA) RETURNS(CHAR) STATEMENT;
 DCL RETSTA CHAR;
 @9@_RETSTA = RETSTA ×× ' = @9_RETSTA.@9P ;';
 RETURN('DO; @9I = @9I + 1; @9TUPL(@9I) = ADDR(@9_RETSTA); END;');
 %END @9RETSTA;
 %ACTIVATE @9RETSTA;
 DCL 01 @9_RETSTA UNALIGNED, 05 @9K FIXED BIN(15) INIT(7), 05 @9# FIXED
     BIN(15) INIT(1), 05 @9L FIXED BIN(15) INIT(1), 05 @9P BIT(8)
     INIT('');
