 /* SVC99 INTERFACE - WRITTEN 10/25/80 BY PAUL DIXON */;
 %@9RETPD: PROC(RETPD) RETURNS(CHAR) STATEMENT;
 DCL RETPD CHAR;
 RETURN('DO; @9_RETPD.@9P  = ' ×× RETPD ××
        '; @9I = @9I + 1; @9TUPL(@9I) = ADDR(@9_RETPD); END;');
 %END @9RETPD;
 %ACTIVATE @9RETPD;
 DCL 01 @9_RETPD UNALIGNED, 05 @9K FIXED BIN(15) INIT(35), 05 @9# FIXED
     BIN(15) INIT(1), 05 @9L FIXED BIN(15) INIT(2), 05 @9P  FIXED
     BIN(15);
