 /* SVC99 INTERFACE - WRITTEN 10/25/80 BY PAUL DIXON */;
 %DCL (@9RETDSO_UNDET,@9RETDSO_TR,@9RETDSO_VSAM,@9RETDSO_TQ,
       @9RETDSO_TX,@9RETDSO_GS,@9RETDSO_PO,@9RETDSO_POU,
       @9RETDSO_MQ,@9RETDSO_CQ,@9RETDSO_CX,@9RETDSO_DA,@9RETDSO_DAU,
       @9RETDSO_PS,@9RETDSO_PSU,@9RETDSO_IS,@9RETDSO_ISU) CHAR;
 %@9RETDSO_UNDET = '''0000000000000000''B';
 %@9RETDSO_TR    = '''0000000000000100''B';
 %@9RETDSO_VSAM  = '''0000000000001000''B';
 %@9RETDSO_TQ    = '''0000000000100000''B';
 %@9RETDSO_TX    = '''0000000001000000''B';
 %@9RETDSO_GS    = '''0000000010000000''B';
 %@9RETDSO_PO    = '''0000001000000000''B';
 %@9RETDSO_POU   = '''0000001100000000''B';
 %@9RETDSO_MQ    = '''0000010000000000''B';
 %@9RETDSO_CQ    = '''0000100000000000''B';
 %@9RETDSO_CX    = '''0001000000000000''B';
 %@9RETDSO_DA    = '''0010000000000000''B';
 %@9RETDSO_DAU   = '''0010000100000000''B';
 %@9RETDSO_PS    = '''0100000000000000''B';
 %@9RETDSO_PSU   = '''0100000100000000''B';
 %@9RETDSO_IS    = '''1000000000000000''B';
 %@9RETDSO_ISU   = '''1000000100000000''B';
 %@9RETDSO: PROC(RETDSO) RETURNS(CHAR) STATEMENT;
 DCL RETDSO CHAR;
 @9@_RETDSO = RETDSO ×× ' = @9_RETDSO.@9P ;';
 RETURN('DO; @9I = @9I + 1; @9TUPL(@9I) = ADDR(@9_RETDSO); END;');
 %END @9RETDSO;
 %ACTIVATE @9RETDSO;
 DCL 01 @9_RETDSO UNALIGNED, 05 @9K FIXED BIN(15) INIT(10), 05 @9# FIXED
     BIN(15) INIT(1), 05 @9L FIXED BIN(15) INIT(2), 05 @9P BIT(16)
     INIT('');
