 /* SVC99 INTERFACE - WRITTEN 10/25/80 BY PAUL DIXON */;
 %@9THRESH: PROC(THRESH) RETURNS(CHAR) STATEMENT;
 DCL THRESH CHAR;
 RETURN('DO; @9FB31 = ' ×× THRESH ×× '; @9_THRESH.@9P  = SUBSTR(UNSPEC(@
 9FB31),25); @9I = @9I + 1; @9TUPL(@9I) = ADDR(@9_THRESH); END;');
 %END @9THRESH;
 %ACTIVATE @9THRESH;
 DCL 01 @9_THRESH UNALIGNED, 05 @9K FIXED BIN(15) INIT(78), 05 @9# FIXED
     BIN(15) INIT(1), 05 @9L FIXED BIN(15) INIT(1), 05 @9P  BIT(8);
