 /* SVC99 INTERFACE - WRITTEN 10/25/80 BY PAUL DIXON */;
 %@9VCOUNT: PROC(VCOUNT) RETURNS(CHAR) STATEMENT;
 DCL VCOUNT CHAR;
 RETURN('DO; @9FB31 = ' ×× VCOUNT ×× '; @9_VCOUNT.@9P  = SUBSTR(UNSPEC(@
 9FB31),25); @9I = @9I + 1; @9TUPL(@9I) = ADDR(@9_VCOUNT); END;');
 %END @9VCOUNT;
 %ACTIVATE @9VCOUNT;
 DCL 01 @9_VCOUNT UNALIGNED, 05 @9K FIXED BIN(15) INIT(19), 05 @9# FIXED
     BIN(15) INIT(1), 05 @9L FIXED BIN(15) INIT(1), 05 @9P  BIT(8);
