 /* COPYRIGHT 1983 BY THOMAS GLEN SMITH */
   DCL 1 LSPBUFSTR BASED(LRN_STRUCTURE.LRN_BUFP),
     2 LSPLN FIXED BIN(15,0),
     2 LSPBUF CHAR(L REFER(LSPLN)) VAR;
   DCL 1 POSITIONALS_DEFINED BASED(ADDR(LRN_STRUCTURE.POSITIONALS(1))),
     2 RH_L1    FIXED BIN(31,0),
     2 RH_L2    FIXED BIN(31,0),
     2 RH_INCR  FIXED BIN(31,0),
     2 RH_OFF   FIXED BIN(31,0),
     2 RH_LEN   FIXED BIN(31,0),
     2 RH_NCOLS FIXED BIN(31,0);
