 /**********************************************************************
 *                                                                     *
 *                           IKJPDEDA                                  *
 *                                                                     *
 *            PARAMETER DESCRIPTOR ENTRY FOR DATA-NAME QUALIFIER PARAMET
 *                                                                     *
 *****************************************************************/
         DCL 1 PDEDA BASED(PDEPTR),
              2 PDEDAP1 PTR,
                   /* POINTER TO THE DATA-NAME QUALIFIER. */
              2 PDEDAL BIT(8),
                   /* LENGTH OF THE DATA-NAME QUALIFIER. */
              2 PDEDAR1 CHAR(1),
                   /* RESERVED. */
              2 PDEDAF BIT(8),
                   /* FLAGS - RESERVED */
              2 PDEDAR2 CHAR(1),
                   /* RESERVED. */
              2 PDEDANP PTR;
                   /* POINTER TO THE PDE FOR THE NEXT
                   QUALIFIER. */
 /**********************************************************************
 *                                                                     *
 *                           END IKJPDEDA                              *
 *                                                                     *
 ******************************************************************/
