 /* OCTAL
0*$.HE GENERALIZED SUBROUTINES - OCTAL
0*$.HE OCTAL - CONVERT TO OCTAL
0*$.PL 55
0*$.PN 0
0*$.PA
0*$.SS
0*$.NF
0*$07/16/81
0*$AUTHOR:  T. SMITH
0*$SOURCE MODULE NAME:  OCTAL
0*$DOCUMENTATION ID:  0*$
0*$.FI L
0*$.SP 5
0*$THIS SUBROUTINE IS INVOKED TO CONVERT THE CONTENTS OF A HALFWORD
0*$CONTAINING A NUMBER IN FIXED BINARY TO A CHARACTER STRING
0*$CONTAINING THE EQUIVALENT IN OCTAL.  CALL FORMAT IS AS FOLLOWS.
0*$.SP 1
0*$.NF
0*$DCL OCTAL ENTRY(FIXED BIN(15,0))
0*$  RETURNS(CHAR(6));
0*$DCL I FIXED BIN(15,0) INIT(1607);
0*$DCL STR CHAR(6);
0*$STR=OCTAL(I);
0*$** STR NOW CONTAINS '003107'
 */
 OCTAL:  PROC(P) RETURNS(CHAR(6));
   DCL P FIXED BIN(15,0),
       PD BIT(16) DEF P;
   DCL C(0:7) CHAR(1) STATIC INIT('0','1','2','3','4','5','6','7');
   RETURN(
     C(SUBSTR(PD,01,1))××
     C(SUBSTR(PD,02,3))××
     C(SUBSTR(PD,05,3))××
     C(SUBSTR(PD,08,3))××
     C(SUBSTR(PD,11,3))××
     C(SUBSTR(PD,14,3)));
   END;
