  /*TGSUNL*/
 UNLOAD: PROC OPTIONS (MAIN);
         ON ENDFILE (BDAMFLE) GO TO EOJ;
         DCL BDAMFLE FILE ENV(F RECSIZE(110) REGIONAL(1));
         DCL 1 BDAMREC CHAR (110);
         OPEN FILE (BDAMFLE) INPUT SEQUENTIAL;
 NEXT:
         READ FILE (BDAMFLE) INTO (BDAMREC);
         WRITE FILE (BACKUP) FROM (BDAMREC);
         GO TO NEXT;
 EOJ:
         END UNLOAD;
