*        %GOTO BSLXSA;                                               /*
         MACRO
         IEEXSA
* S/D Y02651, Y02669 Y02668, Z30LPSV, Z40LPTA         Z300012 12/01/76
.* A 684000,687500-690000,693500-694000                        @YM01530
.* C-374970                                                    @ZA02576
.* THIS APAR WRITTEN TO SUPPORT MSS 'D 3850'  S/C Z40LPTA      @ZA07152
.* A 338450                                                    @ZA12404
.* C 338450                                                    @ZA16375
.* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * **
.*                                                                    *
.*                       EXTENDED SAVE AREA MACRO                     *
.*                                                                    *
.*       THIS MACRO PROVIDES FOR A MAPPING OF THE EXTENDED SAVE       *
.*       AREA AS REQUESTED BY MASTER IN THE EVENT OF AN SVC 34        *
.*       OR SVC 35. THIS AREA HAS TWO SEPARATE USES              Y02669
.*       DEPENDING ON THE FUNCTION REQUIRED. THE FIRST SUPPLIES       *
.*       AN INTERFACE FOR TRANSITION BETWEEN MODULES, THE SEC-        *
.*       OND SUPPLIES INFORMATION CONCERNING MASTER MESSAGES.         *
.*                                                                    *
.*       THE AREA ACTUALLY USED AS AN XSA BY THE SVC 34          Y02669
.*       PROCESSING MODULES IS IN STORAGE GOTTEN IN SUBPOOL 229  Y02669
.*       BY THE FIRST MODULE OF SVC 34 (IEE0003D), THE ADDRESS   Y02669
.*       OF WHICH IS PASSED TO THE PROCESSORS. BY CONVENTION,    Y02669
.*       THE ADDRESS OF THIS XSA IS PASSED IN REGISTER TWO       Y02669
.*       THROUGHOUT SVC 34. THIS AREA IS ALSO                    Y02669
.*       FREED BY IEE0003D, SINCE ALL PROCESSORS RETURN TO IT.   Y02669
.*       THE REAL EXTENDED SAVE AREA OF THE SVRB IS ONLY 48      Y02669
.*       BYTES IN SIZE, AND IS USED ONLY BY THE SVC 34 RECOVERY  Y02669
.*       ROUTINES.                                               Y02669
.*                                                               Y02669
.*       THE MODULE TRANSITION PARAMETER LIST INCLUDES A PTR TO       *
.*       THE NAME OF THE MODULE WHICH IS BEING XCTL'D TO, THE         *
.*       NAME OF THAT MODULE, THE DCB POINTER, A POINTER TO A         *
.*       PARAMETER LIST, AND A POINTER TO THE FIRST CHARACTER AFTER   *
.*       VERB IN THAT LIST.THERE IS ALSO ENTRY FOR THE VERB,          *
.*       AN 8 BYTE TEMPORARY SAVE AREA, A 2 BYTE ASID/UCM       Y02669*
.*       INDICATOR AND A 4 BYTE RESERVED AREA.                  Y02669*
.*                                                                    *
.*                     MODULE TRANSITION PARAMETER LIST               *
.*                                                                    *
.*                  *  4 BYTES     *   4 BYTES    *                   *
.*                  * * * * * * * **** * * * * * **                   *
.*                  *              *              *                   *
.*                  * PTR XCTL NME * DCB POINTER  *                   *
.*                  *              *              *                   *
.*                  * * * * * * * **** * * * * * **                   *
.*                  *                             *                   *
.*                  *    X C T L   N A M E        *                   *
.*                  *                             *                   *
.*                  * * * * * * * *** * * * * * * *                   *
.*                  *1BT* PTR TO   *VRB* PTR TO   *                   *
.*                  *ERR* PARAMETER*CDE*  LIST    *                   *
.*                  *CDE* LIST     *   * POSITION *                   *
.*                  * * * * * * * *** * * * * * * *                   *
.*                  *                             *                   *
.*                  *      V  E  R  B             *                   *
.*                  *                             *                   *
.*                  * * * * * * * * * * * * * * * *                   *
.*                  *                             *                   *
.*                  *   TEMPORARY SAVE AREA       *                   *
.*                  *                             *                   *
.*                  * * * * * * * * * * * * * * * *                   *
.*                  *  UCM  *  RE-  *     ASID     *             Y02669
.*                  *  IND  * SERVED*   INDICATOR  *              20030
.*                  * * * * * * * * * * * * * * * *                   *
.*                  *  INTERNAL COMMUNICATION      *           @Z30LPSV
.*                  *  WORD                        *           @Z30LPSV
.*                  * * * * * * * * * * * * * * * *            @Z30LPSV
.*                  *  SETLOCK                    *              Y02651
.*                  *  SAVE AREA                  *              Y02651
.*                  * * * * * * * * * * * * * * * *                   *
.*                  *  STANDARD                   *              Y02669
.*                  *  SAVE AREA                  *              Y02669
.*                  * * * * * * * * * * * * * * * *
.*                  *  SVC 34 COMMAND      1 WORD *            @ZA16375
.*                  *  FLAG BYTES                 *            @ZA16375
.*                  * * * * * * * * * * * * * * * *            @ZA16375
.*                  *  RESERVED         3 WORDS   *            @ZA16375
.*                  *       AREA                  *            @ZA12404
.*                  * * * * * * * * * * * * * * * *            @ZA12404
.*                  *  WORK POINTER     8 WORDS   *            @ZA12404
.*                  *       AREA                  *            @ZA12404
.*                  * * * * * * * * * * * * * * * *            @ZA12404
.*                                                                    *
.*                                                                    *
.*       THE MESSAGE AREA CONTAINS ENTRYS, FOLLOWING THE              *
.*       RECORD HEADER, FOR THE MESSAGE ID AND THE VARIABLE           *
.*       TEXT OR 'FILL'. FOLLOWING THE EIGHT BYTE FILL IS A           *
.*       TWENTY EIGHT BYTE AREA FOR THE PRE-FORMATTED MESSAGE         *
.*       TEXT,DESCRIPTOR CODE ( 2 BYTE ),ROUTING CODE (2 BYTE ).      *
.*                                                                    *
.*                                                                    *
.*                       MESSAGE AREA TABLE                           *
.*                  0              4                                  *
.*                  * * * * * * * *** * * * * * * *                   *
.*                  *              *              *                   *
.*                  * RECORD HEADER* MESSAGE ID   *                   *
.*                  *              *              *                   *
.*                  * * * * * * * *** * * * * * * *                   *
.*                  *              *              *                   *
.*                  * MESSAGE  ID  *    FILL    *                     *
.*                  *              *              *                   *
.*                  * * * * * * * *** * * * * * * *                   *
.*                  *              *              *                   *
.*                  *    FILL      *              *                   *
.*                  *              *   P R E -    *                   *
.*                  * * * * * * * **              *                   *
.*                  *                             *                   *
.*                  *      F O R M A T E D        *                   *
.*                  *                             *                   *
.*                  *         T E X T,            *                   *
.*                  *                             *                   *
.*                  *D E S C R I P T O R  C O D E *                   *
.*                  *        ( 2 B Y T E )        *                   *
.*                  *                             *                   *
.*                  * R O U T I N G   C O D E     *                   *
.*                  *        ( 2 B Y T E )        *                   *
.*                  *                             *                   *
.*                  * * * * * * * * * * * * * * * *                   *
.*                                                                    *
.* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * **
.*
*                           EXTENDED SAVE AREA MACRO
*
*             ADDRESSABILITY TO THE XSA IN THE SVRB              Y02669
*             MAY ALWAYS BE HAD WITH THESE INSTRUCTIONS          Y02669
*
*        L R,16 / L R,0(R) / L R,4(R) / L R,0(R) / LA R,96(R)
*
*             ADDRESSABILITY TO THE GOTTEN XSA MAY               Y02669
*             ALWAYS BE HAD WITH THESE INSTRUCTIONS              Y02669
*             (THIS IS THE XSA WHICH MUST BE USED BY             Y02669
*             ALL SVC 34 ROUTINES OTHER THAN THE                 Y02669
*             RECOVERY MODULES.)                                 Y02669
*
*        L R,16 / L R,0(R) / L R,4(R) / L R,0(R) / LA R,96(R)    Y02669
*        L R,24(R)                                               Y02669
*
         SPACE 2
XSA      DS    0D                            BEGINNING OF SAVE AREA
         SPACE
*                      MODULE TRANSITION PARAMETER LIST
         SPACE
XAP      DS    F                             POINTER TO XCTL NAME
XAD      DS    F                             DCB PTR. (0)
XAX      DS    D                             XCTL NAME
XAE      DS    0C                            ERROR CODE
XAR      DS    F                             PTR TO PARM LIST (REG1)
XAN      DS    0C                            VERB INDEX
XAL      DS    F                             PTR TO LIST POSITION
XAV      DS    D                             VERB
XAS      DS    D                             TEMORARY SAVE AREA
XAU      DS    C                   UCM ENTRY INDICATOR            20030
         DS    C                   RESERVED                       20030
XAA      DS    H                   ASID ENTRY INDICATOR          Y02669
XAK      DS    F                   KEPT FOR COMMUNICATIONS     @Z30LPSV
*                                  WITHIN A SINGLE COMMAND     @Z30LPSV
XASVRB   EQU   *-XSA               LENGTH OF XSA IN SVRB         Y02669
         SPACE 2
**************************************************************** Y02669
*        THE FOLLOWING FIELDS EXIST ONLY IN THE                  Y02669
*        SUBPOOL 229 XSA IN VS2:                                 Y02669
*           XASAVLOC  XASAVSTD  XACMFLGS  XAWORK               @ZA16375
**************************************************************** Y02669
         SPACE 2
*        SAVE AREA FOR SETLOCK INVOCATION                        Y02651
*        THIS CONSISTS OF FOUR FULL WORDS USED TO SAVE REGISTERS Y02651
*        11, 12, 13, AND 14.                                     Y02651
         SPACE
XASAVLOC DS    0CL16               SETLOCK SAVE AREA             Y02651
XASAVLC1 DS    F                                               @Z40LPTA
XASAVLC2 DS    F                                               @Z40LPTA
XASAVLC3 DS    F                                               @Z40LPTA
XASAVLC4 DS    F                                               @Z40LPTA
         SPACE 2
*        STANDARD SAVE AREA                                      Y02669
*        THE ADDRESS OF THIS 18 FULL WORD AREA IS PASSED TO      Y02669
*        THOSE ROUTINES INVOKED BY SVC 34 WHICH REQUIRE A SAVE   Y02669
*        AREA.                                                   Y02669
         SPACE
XASAVSTD DS    0CL72               STANDARD SAVE AREA          @Z40LPTA
XASAVSDA DS    F                                               @Z40LPTA
XASAVSDB DS    F                                               @Z40LPTA
XASAVSDC DS    F                                               @Z40LPTA
XASAVSDD DS    F                                               @Z40LPTA
XASAVSDE DS    F                                               @Z40LPTA
XASAVSDF DS    F                                               @Z40LPTA
XASAVSDG DS    F                                               @Z40LPTA
XASAVSDH DS    F                                               @Z40LPTA
XASAVSDI DS    F                                               @Z40LPTA
XASAVSDJ DS    F                                               @Z40LPTA
XASAVSDK DS    F                                               @Z40LPTA
XASAVSDL DS    F                                               @Z40LPTA
XASAVSDM DS    F                                               @Z40LPTA
XASAVSDN DS    F                                               @Z40LPTA
XASAVSDO DS    F                                               @Z40LPTA
XASAVSDP DS    F                                               @Z40LPTA
XASAVSDQ DS    F                                               @Z40LPTA
XASAVSDR DS    F                                               @Z40LPTA
         SPACE 2
*        SVC 34 COMMAND FLAGS                                  @ZA16375
*        THE FIRST HALF WORD CONTAINS A COPY OF THE 3RD AND    @ZA16375
*        4TH BYTES OF THE SVC 34 PARAMETER LIST PROVIDED THE   @ZA16375
*        HIGH ORDER BIT IN THE 1ST BYTE OF THE PARAMETER LIST  @ZA16375
*        IS ON.                                                @ZA16375
         SPACE
XACMFLGS DS    0F                 COMMAND FLAGS                @ZA16375
XACMFLGA DS    0H                 PART 1 OF COMMAND FLAGS      @ZA16375
XACMFLG1 DS    CL1                1ST FLAG BYTE                @ZA16375
XACMF11  EQU   X'80'              RESERVED                     @ZA16375
XACMF12  EQU   X'40'              COMMAND ISSUED BY SUBSYSTEM  @ZA16375
XACMF13  EQU   X'20'              RESERVED                     @ZA16375
XACMF14  EQU   X'10'              RESERVED                     @ZA16375
XACMF15  EQU   X'08'              RESERVED                     @ZA16375
XACMF16  EQU   X'04'              RESERVED                     @ZA16375
XACMF17  EQU   X'02'              RESERVED                     @ZA16375
XACMF18  EQU   X'01'              RESERVED                     @ZA16375
XACMFLG2 DS    CL1                2ND FLAG BYTE                @ZA16375
XACMF21  EQU   X'80'              RESERVED                     @ZA16375
XACMF22  EQU   X'40'              RESERVED                     @ZA16375
XACMF23  EQU   X'20'              RESERVED                     @ZA16375
XACMF24  EQU   X'10'              RESERVED                     @ZA16375
XACMF25  EQU   X'08'              RESERVED                     @ZA16375
XACMF26  EQU   X'04'              RESERVED                     @ZA16375
XACMF27  EQU   X'02'              RESERVED                     @ZA16375
XACMF28  EQU   X'01'              RESERVED                     @ZA16375
XACMFLGB DS    0H                 PART 2 OF COMMAND FLAGS      @ZA16375
XACMFLG3 DS    CL1                3RD FLAG BYTE - RESERVED     @ZA16375
XACMFLG4 DS    CL1                4TH FLAG BYTE - RESERVED     @ZA16375
XARESRX  DS    F                  RESERVED WORD 1              @ZA16375
XARESRY  DS    F                  RESERVED WORD 2              @ZA16375
XARESRZ  DS    F                  RESERVED WORD 3              @ZA16375
         SPACE 2                                               @ZA12404
*        WORK POINTER SAVE AREA                                @ZA12404
*        TO BE USED WITHIN A SINGLE COMMAND PROCESSOR.         @ZA12404
         SPACE 1                                               @ZA12404
XAWORK   DS    0CL32               WORK POINTER AREA           @ZA12404
XAWORKA  DS    F                   WORK POINTER 1              @ZA12404
XAWORKB  DS    F                   WORK POINTER 2              @ZA12404
XAWORKC  DS    F                   WORK POINTER 3              @ZA12404
XAWORKD  DS    F                   WORK POINTER 4              @ZA12404
XAWORKE  DS    F                   WORK POINTER 5              @ZA12404
XAWORKF  DS    F                   WORK POINTER 6              @ZA12404
XAWORKG  DS    F                   WORK POINTER 7              @ZA12404
XAWORKH  DS    F                   WORK POINTER 8              @ZA12404
XASIZE   EQU   *-XSA               LENGTH OF SUBPOOL 229 XSA   @Z30LPSV
         SPACE
*                           MESSAGE AREA TABLE
         SPACE
         ORG   XSA
XAH      DS    F                             RECORD HEADER
XAI      DS    2F                            MESSAGE ID
XAF      DS    2F                            FILL (VARIABLE TEXT)
XAT      DS    6F                  PRE-FORMATTED TEXT,
*                                  DESCRIPTOR CODE,
*                                  ROUTING CODE
         DS    F                             RESERVED
         SPACE
*        TO SUPPORT THE VARY COMMAND, THE XAD FIELD IS MAPPED  @Z30LPSV
*        AS FOLLOWS
         SPACE
         ORG   XAD                                             @Z30LPSV
XADUSWIT DS    AL1                 UNIT FIELD SCAN SWITCHES    @Z30LPSV
XAXPAREN EQU   X'80'               EXTERIOR PARENTHESES        @Z30LPSV
XAIPAREN EQU   X'40'               INTERIOR PARENTHESES        @Z30LPSV
XARES2   EQU   X'20'               RESERVED                    @Z30LPSV
XAUDVC   EQU   X'10'               NON-CONSOLE DEVICE          @Z30LPSV
XARES3   EQU   X'08'               RESERVED                    @Z30LPSV
XAIOCOMP EQU   X'04'               COMPOSITE CONSOLE           @Z30LPSV
XAOUNIT  EQU   X'02'               O-UNIT DEVICE               @Z30LPSV
XAUBLANK EQU   X'01'               MESSAGE ISSUANCE INDICATOR  @Z30LPSV
*
XADRES1  DS    AL1                 RESERVED BYTE               @Z30LPSV
XACAHOLD DS    AL2                 ISSUER COMMAND AUTHORITY    @Z30LPSV
         SPACE
*        TO SUPPORT SDS, THE XAS FIELD IS MAPPED AS FOLLOWS      Y02669
         SPACE
         ORG   XAS                                               Y02669
XASCID   DS    X                   CONSOLE ID                    Y02669
XASDID   DS    C                   DISPLAY AREA ID               Y02669
XASSDS   DS    X                   SDS SWITCHES                  Y02669
XASSDS1  EQU   X'80'               THIS COMMAND IS A STATUS      Y02669
*                                       DISPLAY                  Y02669
XASSDS2  EQU   X'40'               L OPERAND IS SPECIFIED ON     Y02669
*                                       COMMAND                  Y02669
XASSDS3  EQU   X'20'               COMMAND ISSUER IS NOT       @Y02668P
*                                  COMMTASK                    @Y02668P
XASSDS4  EQU   X'10'               L OPERAND SPECIFIED IN RCT  @ZA02576
XASSDS5  EQU   X'08'               LOCAL AND CMS LOCKS HELD      Y02669
XASSDS6  EQU   X'04'               MSGRT CONTINUATION FLAG     @Z40LPTA
XASSDS7  EQU   X'02'               RESERVED                    @Z30LPSV
XASSDS8  EQU   X'01'               RESERVED                    @Z30LPSV
XASPLS3  DS    X                   RESERVED - THESE BITS ARE   @Z30LPSV
*                                  USED SOLELY WITHIN EACH     @Z30LPSV
*                                  MODULE - THEY ARE NEVER     @Z30LPSV
*                                  USED FOR INTERFACE          @Z30LPSV
XASTSAVE DS    X                   ERROR CODE -- MINOR           Y02669
XASOPTR  DS    XL3                 POINTER TO INVALID OPERAND    Y02669
         SPACE
*        TO SUPPORT THE VARY COMMAND, THE XAS FIELD IS MAPPED  @Z30LPSV
*        AS FOLLOWS                                            @Z30LPSV
         SPACE
         ORG   XAS                                             @Z30LPSV
XASOPCOD DS    AL1                 OPERAND CODES               @Z30LPSV
XACON    EQU   X'80'               CONSOLE                     @Z30LPSV
XARESA   EQU   X'40'               RESERVED                    @Z30LPSV
XAON     EQU   X'20'               ONLINE                      @Z30LPSV
XAOFF    EQU   X'10'               OFFLINE                     @Z30LPSV
XARESB   EQU   X'08'               RESERVED                    @Z30LPSV
XALTCOM  EQU   X'04'               ALTERNATE CONSOLE IS O-UNIT @Z30LPSV
XACMD    EQU   X'02'               COMD AUTH IS TO BE CHANGED  @Z30LPSV
XALTCON  EQU   X'01'               ALTERNATE CONSOLE IS        @Z30LPSV
*                                  COMPOSITE                   @Z30LPSV
*                                                              @Z30LPSV
XASWITCH DS    AL1                 SYNTAX INDICATORS AND       @Z30LPSV
*                                  SWITCHES                    @Z30LPSV
XAROUT   EQU   X'80'               ROUT CODE IS TO BE CHANGED  @Z30LPSV
XAHRDCMD EQU   X'40'               HARD COPY OF COMMANDS WANTED@Z30LPSV
XALTCHG  EQU   X'20'               ALTERNATE CONSOLE IS TO BE  @Z30LPSV
*                                  CHANGED                     @Z30LPSV
XAINHDCP EQU   XALTCHG             INCMDS                      @Z30LPSV
XACOMPMS EQU   X'10'               COMPOSITE MASTER CONSOLE    @Z30LPSV
XASTHDCP EQU   XACOMPMS            STCMDS                      @Z30LPSV
XAHRDREQ EQU   X'08'               HARDCOPY REQUIRED           @Z30LPSV
XASMF42  EQU   X'04'               SMF ROUTER SWITCH - IEE4203D@Z30LPSV
XASMF44  EQU   X'02'               SMF ROUTER SWITCH - IEE4403D@Z30LPSV
XARES1   EQU   X'01'               RESERVED                    @Z30LPSV
*                                                              @Z30LPSV
XARESV   DS    AL1                 EXITS TO AND FROM IEE4803D  @Z30LPSV
*                                  AND IEE7303D                @Z30LPSV
XACENDCK EQU   X'80'               BRANCH TO CENDCHK ROUTINE   @Z30LPSV
XACRT2   EQU   X'40'               BRANCH TO CRT2 ROUTINE      @Z30LPSV
*                                                              @Z30LPSV
XALTPTR  DS    AL1                 ALTERNATE CONSOLE UCMID     @Z30LPSV
XACMDATH DS    AL2                 COMMAND AUTH IN COMMAND     @Z30LPSV
XARTCODE DS    AL2                 ROUTING CODES IN COMMAND    @Z30LPSV
         SPACE
*        TO SUPPORT THE VARY COMMAND, THE XAR FIELD IS USED TO @Z30LPSV
*        PASS A BIT STRING INDICATING WHICH UNITS ON THE       @Z30LPSV
*        COMMAND MUST OR MUST NOT BE PROCESSED.  EACH BIT      @Z30LPSV
*        STANDS FOR A UNIT IN THE COMMAND.                     @Z30LPSV
*
*        TO THE I/O PROCESSORS SUCH AS IEE3103D, HOWEVER, THE  @Z30LPSV
*        XAR FIELD CONTAINS THE LOGICAL END OF BUFFER POINTER  @Z30LPSV
         SPACE
*        TO SUPPORT THE TRACK/STOPTR COMMANDS, THE XAX FIELD     Y02669
*        IS MAPPED AS FOLLOWS                                    Y02669
         SPACE
         ORG   XAX
XAXMASK  DS    C                   TRACK REQUEST INDICATORS      Y02669
XAXJOBS  EQU   X'80'               JOBS                          Y02669
XAXJOBSL EQU   X'40'               JOBS,LIST                     Y02669
XAXTS    EQU   X'08'               TS                            Y02669
XAXTSL   EQU   X'04'               TS,LIST                       Y02669
XAXA     EQU   X'88'               ACTIVE                        Y02669
XAXAL    EQU   X'44'               ACTIVE,LIST                   Y02669
XAXFREE  DS    C                   RESERVED                      Y02669
XAXUTME  DS    H                   UTME=NNN VALUE                Y02669
XAXSACB  DS    F                   FOR TRACK: ADDRESS OF TRACK   Y02669
*                                  CANCEL ECB POINTER IN SACB    Y02669
*                                  FOR STOPTR: ADDRESS OF SACB   Y02669
         SPACE
*        TO SUPPORT VARY RANGE, THE XAA FIELD IS MAPPED AS     @Z30LPSV
*        FOLLOWS.  THE FIELD MUST BE RESET TO ZERO BEFORE      @Z30LPSV
*        ENTRY TO IEE0503D.                                    @Z30LPSV
         SPACE
         ORG   XAA                                             @Z30LPSV
XAAVRANG DS    CL1                  RANGE FLAGS  1             @Z30LPSV
XAARNG1  EQU   X'80'                VARY RANGE BEING PROCESSED @Z30LPSV
XAARNG2  EQU   X'40'                VARY ENQ RESOURCE HELD     @Z30LPSV
XAARNG3  EQU   X'20'                VARY RANGE TERMINATION     @Z30LPSV
*                                   EXIT TO BE TAKEN           @Z30LPSV
XAARNG4  EQU   X'10'                REQUEST TYPE: ON - ONLINE  @Z30LPSV
*                                                OFF - OFFLINE @Z30LPSV
XAARNG5  EQU   X'08'                ALTERNATE PATH FOUND FOR   @Z30LPSV
*                                   AT LEAST ONE UNIT OR ZERO  @Z30LPSV
*                                   UCBTYPE FIELD. D U COUNT   @Z30LPSV
*                                   NOT INCREMENTED            @Z30LPSV
XAARNG6  EQU   X'04'                RESERVED                   @Z30LPSV
XAARNG7  EQU   X'02'                RESERVED                   @Z30LPSV
XAARNG8  EQU   X'01'                RESERVED                   @Z30LPSV
XAAVRNG1 DS    CL1                  RANGE FLAGS 2              @Z30LPSV
XAARNG9  EQU   X'80'                RESERVED                   @Z30LPSV
XAARNG10 EQU   X'40'                RESERVED                   @Z30LPSV
XAARNG11 EQU   X'20'                RESERVED                   @Z30LPSV
XAARNG12 EQU   X'10'                RESERVED                   @Z30LPSV
XAARNG13 EQU   X'08'                RESERVED                   @Z30LPSV
XAARNG14 EQU   X'04'                RESERVED                   @Z30LPSV
XAARNG15 EQU   X'02'                RESERVED                   @Z30LPSV
XAARNG16 EQU   X'01'                RESERVED                   @Z30LPSV
         MEND  , */
*   %BSLXSA  :  ;
*/* S/D Y02651, Y02669 Y02668, Z30LPSV, Z40LPTA     Z300012  12/01/76*/
*   %/* A 684000,687500-690000,693500-694000                @YM01530*/;
*   %/* C-753260                                            @ZA02576*/;
*   %/* APAR TO SUPPORT MSS 'D 3850' CMD. S/C Z40LPTA       @ZA07152*/;
*   %/* A 719850                                            @ZA12404*/;
*   %/* C 719850                                            @ZA16375*/;
*   %/*  * * * * * * * * * * * * * * * * * * * * * * * * * * * * *  */;
*   %/*                                                             */;
*   %/*                  EXTENDED SAVE AREA MACRO                   */;
*   %/*                                                             */;
*   %/*  THIS MACRO PROVIDES FOR A MAPPING OF THE EXTENDED SAVE     */;
*   %/*  AREA AS REQUESTED BY MASTER IN THE EVENT OF AN SVC 34      */;
*   %/*  OR SVC 35. THIS 48 BYTE AREA HAS TWO SEPARATE USES         */;
*   %/*  DEPENDING ON THE FUNCTION REQUIRED. THE FIRST SUPPLIES     */;
*   %/*  AN INTERFACE FOR TRANSITION BETWEEN MODULES, THE SEC-      */;
*   %/*  OND SUPPLIES INFORMATION CONCERNING MASTER MESSAGES.       */;
*   %/*                                                             */;
*   %/*  THE AREA ACTUALLY USED AS AN XSA BY THE SVC 34       Y02669*/;
*   %/*  PROCESSING MODULES IS IN STORAGE GOTTEN IN SUBPOOL   Y02669*/;
*   %/*  229 BY THE FIRST MODULE OF SVC 34 (IEE0003D), THE    Y02669*/;
*   %/*  ADDRESS OF WHICH IS PASSED TO THE PROCESSORS.        Y02669*/;
*   %/*  BY CONVENTION, THIS ADDRESS IS PASSED IN REGISTER    Y02669*/;
*   %/*  TWO THROUGHOUT SVC 34 BY ALL PROCESSORS. THE         Y02669*/;
*   %/*  AREA IS ALSO FREED BY IEE0003D, SINCE ALL PROCESSORS Y02669*/;
*   %/*  RETURN TO IT. THE REAL EXTENDED SAVE AREA OF THE     Y02669*/;
*   %/*  SVRB IS ONLY 48 BYTES IN SIZE, AND IS USED ONLY BY   Y02669*/;
*   %/*  THE SVC 34 RECOVERY ROUTINES.                        Y02669*/;
*   %/*                                                             */;
*   %/*  THE MODULE TRANSITION PARAMETER LIST INCLUDES A PTR TO     */;
*   %/*  THE NAME OF THE MODULE WHICH IS BEING XCTL'D TO, THE       */;
*   %/*  NAME OF THAT MODULE, THE DCB POINTER, A POINTER TO A       */;
*   %/*  PARAMETER LIST, AND A POINTER TO THE FIRST CHARACTER AFTER */;
*   %/*  VERB IN THAT LIST.THERE IS ALSO ENTRY FOR THE VERB,        */;
*   %/*  AN 8 BYTE TEMPORARY SAVE AREA, A 2 BYTE ASID/UCM     Y02669*/;
*   %/*  INDICATOR AND A 4 BYTE RESERVED AREA.                Y02669*/;
*   %/*                                                             */;
*   %/*                MODULE TRANSITION PARAMETER LIST             */;
*   %/*                                                             */;
*   %/*             *  4 BYTES     *   4 BYTES    *                 */;
*   %/*             * * * * * * * **** * * * * * **                 */;
*   %/*             *              *              *                 */;
*   %/*             * PTR XCTL NME * DCB POINTER  *                 */;
*   %/*             *              *              *                 */;
*   %/*             * * * * * * * **** * * * * * **                 */;
*   %/*             *                             *                 */;
*   %/*             *    X C T L   N A M E        *                 */;
*   %/*             *                             *                 */;
*   %/*             * * * * * * * *** * * * * * * *                 */;
*   %/*             *1BT* PTR TO   *VRB* PTR TO   *                 */;
*   %/*             *ERR* PARAMETER*CDE*  LIST    *                 */;
*   %/*             *CDE* LIST     *   * POSITION *                 */;
*   %/*             * * * * * * * *** * * * * * * *                 */;
*   %/*             *                             *                 */;
*   %/*             *      V  E  R  B             *                 */;
*   %/*             *                             *                 */;
*   %/*             * * * * * * * * * * * * * * * *                 */;
*   %/*             *                             *                 */;
*   %/*             *   TEMPORARY SAVE AREA       *                 */;
*   %/*             *                             *                 */;
*   %/*             * * * * * * * * * * * * * * * *                 */;
*   %/*             *  UCM  *  RE-  *     ASID    *           Y02669*/;
*   %/*             *  IND  * SERVED*   INDICATOR *               2 */;
*   %/*             * * * * * * * * * * * * * * * *                 */;
*   %/*             *  INTERNAL COMMUNICATION      *        @Z30LPSV*/;
*   %/*             *  WORD                        *        @Z30LPSV*/;
*   %/*             * * * * * * * * * * * * * * * *         @Z30LPSV*/;
*   %/*             *  SETLOCK                    *           Y02651*/;
*   %/*             *  SAVE AREA                  *           Y02651*/;
*   %/*             * * * * * * * * * * * * * * * *                 */;
*   %/*             *  STANDARD                   *           Y02669*/;
*   %/*             *  SAVE AREA                  *           Y02669*/;
*   %/*             * * * * * * * * * * * * * * * *                 */;
*   %/*             *  SVC 34 COMMAND      1 WORD *         @ZA16375*/;
*   %/*             *  FLAG BYTES                 *         @ZA16375*/;
*   %/*             * * * * * * * * * * * * * * * *         @ZA16375*/;
*   %/*             *  RESERVED         3 WORDS   *         @ZA16375*/;
*   %/*             *       AREA                  *         @ZA12404*/;
*   %/*             * * * * * * * * * * * * * * * *         @ZA12404*/;
*   %/*             *  WORK POINTER     8 WORDS   *         @ZA12404*/;
*   %/*             *       AREA                  *         @ZA12404*/;
*   %/*             * * * * * * * * * * * * * * * *         @ZA12404*/;
*   %/*                                                             */;
*   %/*                                                             */;
*   %/*  THE MESSAGE AREA CONTAINS ENTRYS, FOLLOWING THE            */;
*   %/*  RECORD HEADER, FOR THE MESSAGE ID AND THE VARIABLE         */;
*   %/*  TEXT OR 'FILL'. FOLLOWING THE EIGHT BYTE FILL IS A         */;
*   %/*  TWENTY EIGHT BYTE AREA FOR THE PRE-FORMATTED MESSAGE       */;
*   %/*  TEXT,DESCRIPTOR CODE ( 2 BYTE), AND ROUTING CODE ( 2 BYTE )*/;
*   %/*                                                             */;
*   %/*                                                             */;
*   %/*                  MESSAGE AREA TABLE                         */;
*   %/*             0              4                                */;
*   %/*             * * * * * * * *** * * * * * * *                 */;
*   %/*             *              *              *                 */;
*   %/*             * RECORD HEADER* MESSAGE ID   *                 */;
*   %/*             *              *              *                 */;
*   %/*             * * * * * * * *** * * * * * * *                 */;
*   %/*             *              *              *                 */;
*   %/*             * MESSAGE  ID  *    FILL    *                   */;
*   %/*             *              *              *                 */;
*   %/*             * * * * * * * *** * * * * * * *                 */;
*   %/*             *              *              *                 */;
*   %/*             *    FILL      *              *                 */;
*   %/*             *              *   P R E -    *                 */;
*   %/*             * * * * * * * **              *                 */;
*   %/*             *                             *                 */;
*   %/*             *      F O R M A T E D        *                 */;
*   %/*             *                             *                 */;
*   %/*             *         T E X T,            *                 */;
*   %/*             *                             *                 */;
*   %/*             *D E S C R I P T O R  C O D E *                 */;
*   %/*             *        ( 2 B Y T E )        *                 */;
*   %/*             *                             *                 */;
*   %/*             * R O U T I N G   C O D E     *                 */;
*   %/*             *        ( 2 B Y T E )        *                 */;
*   %/*             *                             *                 */;
*   %/*             * * * * * * * * * * * * * * * *                 */;
*   %/*                                                             */;
*   %/*  * * * * * * * * * * * * * * * * * * * * * * * * * * * * *  */;
*   %/*                                                             */;
*   /*                      EXTENDED SAVE AREA MACRO                 */
*   /*                                                               */
*   /*        ADDRESSABILITY TO THE XSA IN THE SVRB            Y02669*/
*   /*        MAY ALWAYS BE HAD WITH THESE INSTRUCTIONS        Y02669*/
*   /*                                                               */
*   /*   L R,16 / L R,0(R) / L R,4(R) / L R,0(R) / LA R,96(R)        */
*   /*                                                               */
*   /*        ADDRESSABILITY TO THE GOTTEN XSA MAY             Y02669*/
*   /*        ALWAYS BE HAD WITH THESE INSTRUCTIONS            Y02669*/
*   /*        (THIS IS THE XSA WHICH MUST BE USED BY           Y02669*/
*   /*        ALL SVC 34 ROUTINES OTHER THAN THE               Y02669*/
*   /*        RECOVERY MODULES.)                               Y02669*/
*   /*                                                               */
*   /*   L R,16 / L R,0(R) / L R,4(R) / L R,0(R) / LA R,96(R)  Y02669*/
*   /*   L R,24(R)                                             Y02669*/
*
*    DECLARE
*      1 XSAMAP   BASED(XSAPTR),
*
*      2 XASVRB,                                             /*Y02669*/
*   /*                 'LENGTH (XASVRB)' YIELDS LENGTH OF XSA  Y02669*/
*   /*                 IN THE SVRB                             Y02669*/

*       3 XSA         CHAR(8) BDY(WORD),  /* BEGINNING OF SAVE AREA
*                                                              Y02669*/
*
*   /*                 MODULE TRANSITION PARAMETER LIST              */
*
*        4 XAP         PTR(31),           /* POINTER TO XCTL NAME
*                                                              Y02669*/
*        4 XAD         PTR(31),           /* DCB PTR. (0)      Y02669*/
*       3 XAX         CHAR(8) BDY(WORD),  /* XCTL NAME         Y02669*/
*       3 *           FIXED(31),                           /*@YM01530*/
*        4 XAE         CHAR(1),           /* ERROR CODE        Y02669*/
*        4 XAR         PTR(24),           /* PTR TO PARM LIST (REG1)
*                                                            @YM01530*/
*       3 *           FIXED(31),                           /*@YM01530*/
*        4 XAN         CHAR(1),           /* VERB INDEX        Y02669*/
*        4 XAL         PTR(24),           /* PTR TO LIST POSITION
*                                                            @YM01530*/
*       3 XAV         CHAR(8) BDY(WORD),  /* VERB              Y02669*/
*       3 XAS         CHAR(8) BDY(WORD),  /* TEMORARY SAVE AREA
*                                                              Y02669*/
*       3 XAU         CHAR(1),            /* UCM ENTRY INDICATOR
*                                                              Y02669*/
*       3 *           CHAR(1),            /* RESERVED          Y02669*/
*       3 XAA         FIXED(15),          /* ASID ENTRY INDICATOR
*                                                              Y02669*/
*       3 XAK         FIXED(31),          /* KEPT FOR COMMUNICATIONS
*                                            WITHIN A SINGLE COMMAND
*                                                            @Z30LPSV*/


*  /*********************************************************  Y02669*/
*  /*  THE FOLLOWING FIELDS EXIST ONLY IN THE SUBPOOL          Y02669*/
*  /*  229 XSA IN VS2:                                         Y02669*/
*  /*     XASAVLOC  XASAVSTD  XACMFLGS  XAWORK               @ZA16375*/
*  /*********************************************************  Y02669*/
*      @SPACE(2);
*  /*  SAVE AREA FOR SETLOCK INVOCATION                        Y02651*/
*  /*  THIS CONSISTS OF FOUR FULL WORDS USED TO SAVE           Y02651*/
*  /*  REGISTERS 11, 12, 13, AND 14.                           Y02651*/
*      @SPACE;
*     2 XASAVLOC(4) FIXED(31) BDY(WORD), /*SETLOCK SAVAREA   @VS41100*/
*      3 XASAVLOX CHAR(16) BDY(WORD),  /*SETLOCK SAVE AREA   @VS41100*/
*      5 XASAVLC1 FIXED(31),                              /* @VS41100*/
*      5 XASAVLC2 FIXED(31),                              /* @VS41100*/
*      5 XASAVLC3 FIXED(31),                              /* @VS41100*/
*      5 XASAVLC4 FIXED(31),                              /* @VS41100*/
*      @SPACE(2);
* /*   STANDARD SAVE AREA                                      Y02669*/
* /*   THE ADDRESS OF THIS 18 FULL WORD AREA IS PASSED TO      Y02669*/
* /*   THOSE ROUTINES INVOKED BY SVC 34 WHICH REQUIRE A SAVE   Y02669*/
* /*   AREA.                                                   Y02669*/
*      @SPACE;
*     2 XASAVSTD(18) FIXED(31) BDY(WORD), /* STD SAVEAREA    @VS41100*/
*      3 XASAVSTR CHAR(72) BDY(WORD), /* STANDARD SAVE AREA  @VS41100*/
*      5 XASAVSDA FIXED(31),                              /* @VS41100*/
*      5 XASAVSDB FIXED(31),                              /* @VS41100*/
*      5 XASAVSDC FIXED(31),                              /* @VS41100*/
*      5 XASAVSDD FIXED(31),                              /* @VS41100*/
*      5 XASAVSDE FIXED(31),                              /* @VS41100*/
*      5 XASAVSDF FIXED(31),                              /* @VS41100*/
*      5 XASAVSDG FIXED(31),                              /* @VS41100*/
*      5 XASAVSDH FIXED(31),                              /* @VS41100*/
*      5 XASAVSDI FIXED(31),                              /* @VS41100*/
*      5 XASAVSDJ FIXED(31),                              /* @VS41100*/
*      5 XASAVSDK FIXED(31),                              /* @VS41100*/
*      5 XASAVSDL FIXED(31),                              /* @VS41100*/
*      5 XASAVSDM FIXED(31),                              /* @VS41100*/
*      5 XASAVSDN FIXED(31),                              /* @VS41100*/
*      5 XASAVSDO FIXED(31),                              /* @VS41100*/
*      5 XASAVSDP FIXED(31),                              /* @VS41100*/
*      5 XASAVSDQ FIXED(31),                              /* @VS41100*/
*      5 XASAVSDR FIXED(31),                              /* @VS41100*/
*      2 * BDY(WORD),                                     /* @ZA12404*/
*      @SPACE(2);
* /*   SVC 34 COMMAND FLAGS                                  @ZA16375*/
* /*   THE FIRST HALF WORD CONTAINS A COPY OF THE 3RD AND    @ZA16375*/
* /*   4TH BYTES OF THE SVC 34 PARAMETER LIST PROVIDED THE   @ZA16375*/
* /*   HIGH ORDER BIT IN THE FIRST BYTE OF THE PARAMETER     @ZA16375*/
* /*   LIST IS ON.                                           @ZA16375*/
*      @SPACE;
*      3 XACMFLGS   FIXED(32),    /* COMMAND FLAGS           @ZA16375*/
*        5 XACMFLGA FIXED(16),    /* PART 1 OF COMMAND FLAGS @ZA16375*/
*          7 XACMFLG1  BIT(8),    /* 1ST FLAG BYTE           @ZA16375*/
*            9 XACMF11 BIT(1),    /* RESERVED                @ZA16375*/
*            9 XACMF12 BIT(1),    /* COMMAND ISSUED BY SUBSYSTEM
*                                                            @ZA16375*/
*            9 XACMF13 BIT(1),    /* RESERVED                @ZA16375*/
*            9 XACMF14 BIT(1),    /* RESERVED                @ZA16375*/
*            9 XACMF15 BIT(1),    /* RESERVED                @ZA16375*/
*            9 XACMF16 BIT(1),    /* RESERVED                @ZA16375*/
*            9 XACMF17 BIT(1),    /* RESERVED                @ZA16375*/
*            9 XACMF18 BIT(1),    /* RESERVED                @ZA16375*/
*          7 XACMFLG2  BIT(8),    /* 2ND FLAG BYTE           @ZA16375*/
*            9 XACMF21 BIT(1),    /* RESERVED                @ZA16375*/
*            9 XACMF22 BIT(1),    /* RESERVED                @ZA16375*/
*            9 XACMF23 BIT(1),    /* RESERVED                @ZA16375*/
*            9 XACMF24 BIT(1),    /* RESERVED                @ZA16375*/
*            9 XACMF25 BIT(1),    /* RESERVED                @ZA16375*/
*            9 XACMF26 BIT(1),    /* RESERVED                @ZA16375*/
*            9 XACMF27 BIT(1),    /* RESERVED                @ZA16375*/
*            9 XACMF28 BIT(1),    /* RESERVED                @ZA16375*/
*        5 XACMFLGB FIXED(16),    /* PART 2 OF COMMAND FLAGS @ZA16375*/
*          7 XACMFLG3  BIT(8),    /* 3RD FLAG BYTE RESERVED  @ZA16375*/
*          7 XACMFLG4  BIT(8),    /* 4TH FLAG BYTE RESERVED  @ZA16375*/
*      3 XARESRX FIXED(31),            /* RESERVED WORD 1    @ZA16375*/
*      3 XARESRY FIXED(31),            /* RESERVED WORD 2    @ZA16375*/
*      3 XARESRZ FIXED(31),            /* RESERVED WORD 3    @ZA16375*/
*      @SPACE(2);
* /*   WORK POINTER SAVE AREA                                @ZA12404*/
* /*   TO BE USED WITHIN A SINGLE COMMAND PROCESSOR          @ZA12404*/
*      @SPACE;
*     2 XAWORK CHAR(32) BDY(WORD), /* WORK POINTER AREA      @ZA12404*/
*      5 XAWORKA FIXED(31),        /* WORK POINTER 1         @ZA12404*/
*      5 XAWORKB FIXED(31),        /* WORK POINTER 2         @ZA12404*/
*      5 XAWORKC FIXED(31),        /* WORK POINTER 3         @ZA12404*/
*      5 XAWORKD FIXED(31),        /* WORK POINTER 4         @ZA12404*/
*      5 XAWORKE FIXED(31),        /* WORK POINTER 5         @ZA12404*/
*      5 XAWORKF FIXED(31),        /* WORK POINTER 6         @ZA12404*/
*      5 XAWORKG FIXED(31),        /* WORK POINTER 7         @ZA12404*/
*      5 XAWORKH FIXED(31);        /* WORK POINTER 8         @ZA12404*/
*
*   /*                      MESSAGE AREA TABLE                       */
*
*   DECLARE 1 EEXSAS01
*         BASED(ADDR(XSA)),
*      2 XAH         CHAR(4),            /* RECORD HEADER            */
*      2 XAI         CHAR(8),            /* MESSAGE ID               */
*      2 XAF         CHAR(8),            /* FILL (VARIABLE TEXT)     */
*      2 XAT         CHAR(24),           /* PRE-FORMATTED TEXT,
*                                           DESCRIPTOR CODE,
*                                           ROUTING CODE             */
*      2 *           FIXED(31);          /* RESERVED                 */

*  /*  TO SUPPORT THE VARY COMMAND, THE XAD FIELD IS MAPPED  @Z30LPSV*/
*  /*  AS FOLLOWS                                            @Z30LPSV*/

*   DECLARE 1 EEXSAS02                   /*                  @Z30LPSV*/
*        BASED(ADDR(XAD)),               /*                  @Z30LPSV*/
*     2 XADUSWIT    CHAR(1),             /* UNIT FIELD SCAN
*                                           SWITCHES         @Z30LPSV*/
*       3 XAXPAREN    BIT(1),            /* EXTERIOR PARENS  @Z30LPSV*/
*       3 XAIPAREN    BIT(1),            /* INTERIOR PARENS  @Z30LPSV*/
*       3 XARES2      BIT(1),            /* RESERVED         @Z30LPSV*/
*       3 XAUDVC      BIT(1),            /* NON-CONSOLE DEV  @Z30LPSV*/
*       3 XARES3      BIT(1),            /* RESERVED         @Z30LPSV*/
*       3 XAIOCOMP    BIT(1),            /* COMPOSITE CONS   @Z30LPSV*/
*       3 XAOUNIT     BIT(1),            /* O-UNIT DEVICE    @Z30LPSV*/
*       3 XAUBLANK    BIT(1),            /* MESSAGE ISSUANCE
*                                           INDICATOR        @Z30LPSV*/
*      2 XADRES1     CHAR(1),            /* RESERVED         @Z30LPSV*/
*      2 XACAHOLD    CHAR(2);            /* ISSUER CMD AUTH  @Z30LPSV*/

*  /*  TO SUPPORT SDS THE XAS FIELD IS MAPPED AS FOLLOWS       Y02669*/

*   DECLARE 1 EEXSAS03                   /*                    Y02669*/
*         BASED(ADDR(XAS)),              /*                    Y02669*/
*      2 XASCID      PTR(8),             /* CONSOLE ID         Y02669*/
*      2 XASDID      CHAR(1),            /* DISPLAY AREA ID    Y02669*/
*      2 XASDS       CHAR(1),            /* SDS SWITCHES       Y02669*/
*       3 XASSDS1     BIT(1),            /* THIS COMMAND IS A
*                                           STATUS DISPLAY     Y02669*/
*       3 XASSDS2     BIT(1),            /* L OPERAND IS SPECIFIED
*                                           ON COMMAND         Y02669*/
*       3 XASSDS3     BIT(1),            /* COMMAND ISSUER IS NOT
*                                           COMMTASK         @Y02668P*/
*       3 XASSDS4     BIT(1),            /* L OPERAND IS SPECIFIED IN
*                                           RCT              @ZA02576*/
*       3 XASSDS5     BIT(1),            /* LOCAL AND CMS LOCKS
*                                           HELD               Y02651*/
*       3 XASSDS6     BIT(1),            /* MSGRT CONTINUATION
*                                           FLAG             @Z40LPTA*/
*       3 XASSDS7     BIT(1),            /* RESERVED         @Z30LPSV*/
*       3 XASSDS8     BIT(1),            /* RESERVED         @Z30LPSV*/
*      2 XASPLS3     PTR(8),             /* RESERVED           Y02669*/
*      2 *           FIXED(31),          /* MESSAGE INFO       Y02669*/
*       3 XASTSAVE    PTR(8),            /* ERROR CODE - MINOR Y02669*/
*       3 XASOPTR     PTR(24);           /* POINTER TO INVALID
*                                           OPERAND            Y02669*/

*  /*  TO SUPPORT THE TRACK/STOPTR COMMANDS, THE XAX FIELD IS  Y02669*/
*  /*  MAPPED AS FOLLOWS                                       Y02669*/

*   DECLARE 1 EEXSAS04                   /*                    Y02669*/
*         BASED(ADDR(XAX)),              /*                    Y02669*/
*      2 XAXMASK     CHAR(1),            /* TRACK REQUEST
*                                           INDICATORS         Y02669*/
*       3 XAXJOBS     BIT(1),            /* JOBS               Y02669*/
*       3 XAXJOBSL    BIT(1),            /* JOBS,LIST          Y02669*/
*       3 *           BIT(2),            /* RESERVED           Y02669*/
*       3 XAXTS       BIT(1),            /* TS                 Y02669*/
*       3 XAXTSL      BIT(1),            /* TS,LIST            Y02669*/
*       3 *           BIT(2),            /* RESERVED           Y02669*/
*      2 XAXFREE     CHAR(1),            /* RESERVED           Y02669*/
*      2 XAXUTME     FIXED(15),          /* UTME=NNN VALUE     Y02669*/
*      2 XAXSACB     PTR(31);            /* FOR TRACK:
*                                           ADDR OF TRACK CANCEL ECB
*                                           POINTER IN SACB
*                                           FOR STOPTR:
*                                           ADDRESS OF SACB    Y02669*/

*  /*  TO SUPPORT THE VARY COMMAND, THE XAS FIELD IS MAPPED  @Z30LPSV*/
*  /*  AS FOLLOWS                                            @Z30LPSV*/

*   DECLARE 1 EEXSAS05                   /*                  @Z30LPSV*/
*         BASED(ADDR(XAS)),              /*                  @Z30LPSV*/
*      2 XASOPCOD    CHAR(1),            /* OPERAND CODES    @Z30LPSV*/
*       3 XACON       BIT(1),            /* CONSOLE          @Z30LPSV*/
*       3 XARESA      BIT(1),            /* RESERVED         @Z30LPSV*/
*       3 XAON        BIT(1),            /* ONLINE           @Z30LPSV*/
*       3 XAOFF       BIT(1),            /* OFFLINE          @Z30LPSV*/
*       3 XARESB      BIT(1),            /* RESERVED         @Z30LPSV*/
*       3 XALTCOM     BIT(1),            /* ALTERNATE CONSOLE
*                                           IS O-UNIT        @Z30LPSV*/
*       3 XACMD       BIT(1),            /* COMD AUTH IS TO
*                                           BE CHANGED       @Z30LPSV*/
*       3 XALTCON     BIT(1),            /* ALTERNATE CONSOLE
*                                           IS COMPOSITE     @Z30LPSV*/
*      2 XASWITCH    CHAR(1),            /* SYNTAX INDICATORS
*                                           AND SWITCHES     @Z30LPSV*/
*       3 XAROUT      BIT(1),            /* ROUTE CODE IS TO
*                                           BE CHANGED       @Z30LPSV*/
*       3 XAHRDCMD    BIT(1),            /* HARDCOPY OF COMMANDS
*                                           WANTED           @Z30LPSV*/
*       3 XALTCHG     BIT(1),            /* ALTERNATE CONSOLE
*                                           IS CHANGED       @Z30LPSV*/
*        4 XAINHDCP    BIT(1),           /* INCMDS           @Z30LPSV*/
*       3 XACOMPMS    BIT(1),            /* COMPOSITE MASTER
*                                           CONSOLE          @Z30LPSV*/
*        4 XASTHDCP    BIT(1),           /* STCMDS           @Z30LPSV*/
*       3 XAHRDREQ    BIT(1),            /* HARDCOPY REQUIRED@Z30LPSV*/
*       3 XASMF42     BIT(1),            /* SMF ROUTER SWITCH
*                                           IEE4203D         @Z30LPSV*/
*       3 XASMF44     BIT(1),            /* SMF ROUTER SWITCH
*                                           IEE4403D         @Z30LPSV*/
*       3 XARES1      BIT(1),            /* RESERVED         @Z30LPSV*/
*      2 XARESV      CHAR(1),            /* EXITS TO AND FROM IEE4803D
*                                           AND IEE7303D     @Z30LPSV*/
*       3 XACENDCK    BIT(1),            /* BRNCH TO DENDCHK @Z30LPSV*/
*       3 XACRT2      BIT(1),            /* BRNCH TO CRT2    @Z30LPSV*/
*      2 XALTPTR     CHAR(1),            /* ALTERNATE CONSOLE
*                                           UCMID            @Z30LPSV*/
*      2 XACMDATH    CHAR(2),            /* COMMAND AUTH IN
*                                           COMMAND          @Z30LPSV*/
*      2 XARTCODE    CHAR(2);            /* ROUTING CODES IN
*                                           COMMAND          @Z30LPSV*/
*  /*  TO SUPPORT THE VARY COMMAND, THE XAR FIELD IS USED TO @Z30LPSV*/
*  /*  PASS A BIT STRING INDICATING WHICH UNITS ON THE       @Z30LPSV*/
*  /*  COMMAND MUST OR MUST NOT BE PROCESSED.  EACH BIT      @Z30LPSV*/
*  /*  STANDS FOR A UNIT IN THE COMMAND.                     @Z30LPSV*/
*  /*                                                                */
*  /*  TO THE I/O PROCESSORS SUCH AS IEE3103D, HOWEVER, THE  @Z30LPSV*/
*  /*  XAR FIELD CONTAINS THE LOGICAL END OF BUFFER POINTER  @Z30LPSV*/
*  /*                                                                */
*  /*  TO SUPPORT VARY RANGE, THE XAA FIELD IS MAPPED AS     @Z30LPSV*/
*  /*  FOLLOWS. THE FIELD MUST BE RESET TO ZERO BEFORE       @Z30LPSV*/
*  /*  ENTRY TO IEE0503D.                                    @Z30LPSV*/

*   DECLARE 1 EEXSAS06                   /*                  @Z30LPSV*/
*         BASED(ADDR(XAA)),              /*                  @Z30LPSV*/
*      2 XAAVRANG     CHAR(1),           /* RANGE FLAGS 1    @Z30LPSV*/
*       3 XAARNG1      BIT(1),           /* VARY RANGE IN
*                                           PROCESS          @Z30LPSV*/
*       3 XAARNG2      BIT(1),           /* VARY ENQ RESOURCE
*                                           HELD             @Z30LPSV*/
*       3 XAARNG3      BIT(1),           /* VARY RANGE TERMINATION
*                                           EXIT TO BE TAKEN @Z30LPSV*/
*       3 XAARNG4      BIT(1),           /* REQUEST TYPE:
*                                           ON - ONLINE
*                                           OFF - OFFLINE    @Z30LPSV*/
*       3 XAARNG5      BIT(1),           /* ALTERNATE PATH FOUND FOR AT
*                                           LEAST ONE UNIT OR ZERO
*                                           UCBTYPE FIELD. D U COUNT
*                                           NOT INCREMENTED. @Z30LPSV*/
*       3 XAARNG6      BIT(1),           /* RESERVED         @Z30LPSV*/
*       3 XAARNG7      BIT(1),           /* RESERVED         @Z30LPSV*/
*       3 XAARNG8      BIT(1),           /* RESERVED         @Z30LPSV*/
*      2 XAAVRNG2    CHAR(1),            /* RANGE FLAGS   2  @Z30LPSV*/
*       3 XAARNG9      BIT(1),           /* RESERVED         @Z30LPSV*/
*       3 XAARNG10     BIT(1),           /* RESERVED         @Z30LPSV*/
*       3 XAARNG11     BIT(1),           /* RESERVED         @Z30LPSV*/
*       3 XAARNG12     BIT(1),           /* RESERVED         @Z30LPSV*/
*       3 XAARNG13     BIT(1),           /* RESERVED         @Z30LPSV*/
*       3 XAARNG14     BIT(1),           /* RESERVED         @Z30LPSV*/
*       3 XAARNG15     BIT(1),           /* RESERVED         @Z30LPSV*/
*       3 XAARNG16     BIT(1);           /* RESERVED         @Z30LPSV*/
