         MACRO
         IRAPMP
         GBLB  &IRAPMPS
.*A000000-999999                                                 Y02014
.* DETERMINE IF MAP ALREADY EXPANDED
         AIF   (&IRAPMPS).XPNDED
.* EXPAND THE MAPPING MACRO
.EXPAND  ANOP
&IRAPMPS SETB  1
*
* SYMBOLIC EID TABLE FOR THE HOOK MACRO
*
IRASRM   EQU   X'040001'
.XPNDED  MEND
