         MACRO
         ISPPMP
         GBLB  &ISPPMPS
.*A000000-999999                                                 Y02014
.* DETERMINE IF MAP ALREADY EXPANDED
         AIF   (&ISPPMPS).XPNDED
.* EXPAND THE MAPPING MACRO
.EXPAND  ANOP
&ISPPMPS SETB  1
*
* SYMBOLIC EID TABLE FOR THE HOOK MACRO
*
ISPTPIO1 EQU   X'080100'
ISPTPIO2 EQU   X'080200'
.XPNDED  MEND
