//ASSEMBLE  EXEC  ASMFC,
//   PARM.ASM='OBJ,NODECK,TERM,STMT,NUM'
//ASM.SYSLIB DD
//           DD DSN=HMD.MVSUG.MACLIB,DISP=SHR
//           DD DSN=SYS1.AMODGEN,DISP=SHR
//ASM.SYSGO  DD DSN=HMD.MVSUG.OBJ($SMFBRWS),DISP=SHR,
//  DCB=(RECFM=FB,LRECL=80,BLKSIZE=3200)
//ASM.SYSIN  DD DSN=HMD.MVSUG.SOURCE($SMFBRWS),DISP=SHR
//ASM.SYSTERM    DD   SYSOUT=A
//*
//LINK      EXEC  LKED
//LKED.SYSLMOD DD DSN=HMD.MVSUG.LOAD,DISP=SHR
//LKED.OBJLIB  DD DSN=HMD.MVSUG.OBJ,DISP=SHR
//LKED.SYSIN   DD *
  INCLUDE OBJLIB($SMFBRWS)
  ENTRY $SMFBRWS
  NAME $SMFBRWS(R)
/*
