//COMP  EXEC  ASMFC
//ASM.SYSLIB DD
//           DD DSN=HMD.MVSUG.MACLIB,DISP=SHR
//           DD DSN=SYS1.AMODGEN,DISP=SHR
//ASM.SYSGO DD DSN=HMD.MVSUG.OBJ(ASMG),DISP=SHR,DCB=BLKSIZE=3200
//ASM.SYSIN DD DSN=HMD.MVSUG.SOURCE(ASMG),DISP=SHR
//ASM.SYSTERM    DD   SYSOUT=A
//LINK EXEC LKED
//LKED.SYSLMOD DD DSN=HMD.MVSUG.LOAD(ASMG),DISP=SHR
//LKED.OBJLIB DD DSN=HMD.MVSUG.OBJ,DISP=SHR
//LKED.SYSIN DD *
  INCLUDE OBJLIB(ASMG)
  NAME ASMG(R)
/*
