//CMP   EXEC ASMFC,
//    PARM.ASM='OBJ,NODECK,TERM,STMT,NUM,RENT,BUF(MAX)'
//*
//* GTE DATA SERVICES COMPRESS COMMAND
//* CALL IT COMPRESS IF YOU WISH
//* OR USE THE OTHER COMPRESS COMMAND IN THIS DATA SET
//* THIS PROGRAM LINKS TO 'SPFCOPY' CHANGE SOURCE IF
//* 'SPFCOPY' DOES NOT EXIT.
//*
//ASM.SYSLIB DD DSN=SYS1.MACLIB,DISP=SHR
//           DD DSN=HMD.MVSUG.MACLIB,DISP=SHR
//           DD DSN=SYS1.AMODGEN,DISP=SHR
//ASM.SYSGO DD DSN=HMD.MVSUG.OBJ(CMP),DISP=SHR,
//  DCB=(RECFM=FB,LRECL=80,BLKSIZE=3200)
//ASM.SYSIN DD DSN=HMD.MVSUG.SOURCE(CMP),DISP=SHR
//ASM.SYSTERM    DD   SYSOUT=A
//*
//LINK EXEC LKED,
//  PARM.LKED='MAP,LIST,XREF,NCAL,LET,RENT,AC=1'
//LKED.SYSLMOD DD DSN=HMD.MVSUG.LOAD,DISP=SHR
//LKED.OBJLIB  DD DSN=HMD.MVSUG.OBJ,DISP=SHR
//LKED.SYSIN   DD *
  INCLUDE OBJLIB(CMP)
  ENTRY GSFTSOCM
  SETCODE AC(1) ** NOT NEEDED IF YOU USE SPFCOPY **
  NAME  CMP(R)
