//COMP  EXEC  ASMFC
//ASM.SYSLIB DD DSN=SYS1.AMODGEN,DISP=SHR
//           DD DSN=HMD.MVSUG.MACLIB,DISP=SHR
//           DD DSN=SYS1.MACLIB,DISP=SHR
//ASM.SYSGO DD DSN=HMD.MVSUG.OBJ(CSAMAP),DISP=SHR,DCB=BLKSIZE=3200
//ASM.SYSIN DD DSN=HMD.MVSUG.SOURCE(CSAMAP),DISP=SHR
//ASM.SYSTERM    DD   SYSOUT=A
//LINK EXEC LKED
//LKED.SYSLMOD DD DSN=HMD.MVSUG.LOAD(CSAMAP),DISP=SHR
//LKED.OBJLIB DD DSN=HMD.MVSUG.OBJ,DISP=SHR
//LKED.SYSIN DD *
  INCLUDE OBJLIB(CSAMAP)
  ENTRY CSAMAP
  NAME CSAMAP(R)
/*
