//IEFPROC  PROC RDR=00C,PUN=00D
//STEP1    EXEC PGM=OSDITTO,REGION=2048K
//SYSIN    DD UNIT=&RDR,
//            DCB=(BLKSIZE=80,RECFM=F,BUFNO=6,OPTCD=C)
//SYSPUNCH DD UNIT=&PUN,
//            DCB=(BLKSIZE=81,RECFM=FA,FUNC=I)
//SYSPRINT DD SYSOUT=9
//SYSUDUMP DD SYSOUT=9
