//IEFPROC  PROC IN=TAPE,OUT=TAPE,PRT=00E,CLS=
//STEP1    EXEC PGM=OSDITTO,REGION=2048K
//TAPEIN   DD DSN=TRL.DUMIN,UNIT=&IN,VOL=SER=TRL-IN,DISP=(OLD,KEEP),
//            LABEL=(,BLP)
//TAPEOUT  DD DSN=TRL.DUMOUT,UNIT=&OUT,VOL=SER=TRL-OT,DISP=(NEW,KEEP),
//            LABEL=(,BLP)
//SYSPRINT DD UNIT=&PRT,SYSOUT=&CLS,
//            DCB=(LRECL=133,RECFM=FM,BUFNO=6,OPTCD=C)
//SYSUDUMP DD SYSOUT=9
