//IEFPROC  PROC IN=TAPE,PUN=00D
//STEP1    EXEC PGM=OSDITTO,REGION=2048K
//TAPEIN   DD DSN=TCI.DUMIN,UNIT=&IN,VOL=SER=TCI-IN,DISP=(OLD,KEEP),
//            LABEL=(,BLP)
//SYSPUNCH DD UNIT=&PUN,
//            DCB=(BLKSIZE=81,RECFM=FA,FUNC=I)
//SYSPRINT DD SYSOUT=9
//SYSUDUMP DD SYSOUT=9
