//*
//* DOC:   FIXES TO IEHMAP TO:
//*        1) SUPPORT 3350'S CORRECTLY IN NATIVE MODE
//*           (CBT MODS TAPE FILE 117)
//*        2) DATASETS/CATALOGS ACROSS MULTIPLE VOLUMES
//*           (CBT MODS TAPE FILE 176)
//*
//* NOTE:  TO RUN IN OTHER THAN TSO MODE IEHMAP MUST BE MOVED TO
//*        AN AUTHORIZED LIBRARY.
//*
//LINK EXEC LKED
//LKED.SYSLMOD DD DSN=HMD.MVSUG.LOAD,DISP=SHR
//LKED.SYSLIN DD DSN=HMD.MVSUG.OBJ(IEHMAP),DISP=SHR
//FIX      EXEC PGM=AMASPZAP
//SYSPRINT DD  SYSOUT=A
//SYSLIB   DD  DSNAME=HMD.MVSUG.LOAD,DISP=SHR
//SYSIN    DD  *
  NAME  IEHMAP MAPDEV    /* 3350 NATIVE MODE */
  VER   0128  000C,000C,0001,0001,000C,20A0
  REP   0128  001E,001E,0001,0001,001E,410A
  NAME  IEHMAP MAPINIT   /* SPACE FOR MULTIPLE VOLUMES */
  VER   08D0  47F0,C198,0700,0700
  REP   08D0  4400,C9B4,47F0,C198
  NAME  IEHMAP MAPCAT3   /* CAT DSN - MULT VOLS 1 MORE THAN CAT */
  VER   0398  5820,9098,1222
  REP   0398  58E0,9098,12EE
  VER   03A2  1892
  REP   03A2  189E
/*
//LIST EXEC PGM=IEHMAP,PARM='TSO'
//STEPLIB DD DSN=HMD.MVSUG.LOAD,DISP=SHR
//SYSPRINT DD SYSOUT=A
//VOL1 DD UNIT=3350,DISP=SHR,VOL=SER=VLIB61
//SYSIN DD *
  MAP VOL=VLIB61
/*
