//COMP  EXEC  ASMFC
//ASM.SYSLIB DD
//           DD DSN=SYS1.AMODGEN,DISP=SHR
//ASM.SYSGO DD DSN=HMD.MVSUG.OBJ(PDS2),DISP=SHR,DCB=BLKSIZE=3200
//ASM.SYSTERM   DD  SYSOUT=A
//ASM.SYSIN DD DSN=HMD.MVSUG.SOURCE(PDS2),DISP=SHR
//LINK EXEC LKED
//LKED.SYSLMOD DD DSN=HMD.MVSUG.LOAD(PDS2),DISP=SHR
//LKED.OBJLIB DD DSN=HMD.MVSUG.OBJ,DISP=SHR
//LKED.SYSIN DD *
  INCLUDE OBJLIB(PDS2)
  INCLUDE OBJLIB(CLEAR)
  ENTRY PDS
  NAME PDS2(R)
/*
