//COMP  EXEC  ASMFC
//ASM.SYSLIB DD
//           DD DSN=HMD.MVSUG.MACLIB,DISP=SHR
//           DD DSN=SYS1.AMODGEN,DISP=SHR
//ASM.SYSGO DD DSN=HMD.MVSUG.OBJ(SMFDS),DISP=SHR,DCB=BLKSIZE=3200
//ASM.SYSTERM   DD  SYSOUT=A
//ASM.SYSIN DD DSN=HMD.MVSUG.SOURCE(SMFDS),DISP=SHR
//LINK EXEC LKED
//LKED.SYSLMOD DD DSN=HMD.MVSUG.LOAD(SMFDS),DISP=SHR
//LKED.OBJLIB DD DSN=HMD.MVSUG.OBJ,DISP=SHR
//LKED.SYSIN DD *
  INCLUDE OBJLIB(SMFDS)
  NAME SMFDS(R)
/*
