         MACRO
&NAME    XROUTE    &NUM
         USING     ZW1,R3                                          V1L4
&NAME    CLC       XUNDEF(&NUM),ZW1                                V1L4
         $FREE     R3                                              V1L5
         BNER      R14
         B         XERRUV1
         MEND
