         TITLE 'ILRSRBC - SRB CONTROLLER                               *
                        '
ILRSRBC  CSECT ,                                                   0001
@MAINENT DS    0H                                                  0001
         USING *,@15                                               0001
         B     @PROLOG                                             0001
         DC    AL2(@EP00001-@MAINENT)
         DC    AL1(16)                                             0001
         DC    C'ILRSRBC   76.114'                                 0001
ILRSRBRM DS    0H                                                  0001
         USING *,@15                                               0001
         B     @PROLOG                                             0001
         DC    AL2(@EP00241-ILRSRBRM)
         ENTRY ILRSRBRM
         DROP  @15
@PROLOG  BALR  @06,0                                               0001
@PSTART  DS    0H                                                  0001
         USING @PSTART,@06                                         0001
         AH    @15,4(,@15)                                         0001
         BR    @15                                                 0001
@EP00001 DS    0H                                                  0002
*   SRBPTR=R0;                      /* OBTAIN ADDRESSIBILITY TO SRB  */
         LR    SRBPTR,R0                                           0050
*   RFY                                                            0051
*     R0 UNRSTD;                                                   0051
*   R1=ADDR(ILRSRB01);              /* OBTAIN FUNCTIONAL RECOVERY  0052
*                                      ROUTINE ADDR                  */
         L     R1,@CV01751                                         0052
*   GEN REFS(R1) SETS(ATAPTR,R11,R12);                             0053
     SETFRR  A,FRRAD=(R1),PARMAD=(ATAPTR),WRKREGS=(R11,R12),          **
               RELATED=(SETFRR,ILRSRBC)  ADD RECOVERY
*   RSMHDPTR=SRBASCB->ASCBRSM;      /* OBTAIN ADDRESS RSM HEADER     */
         L     @12,SRBASCB(,SRBPTR)                                0054
         L     RSMHDPTR,ASCBRSM(,@12)                              0054
*   ASMVTPTR=CVTASMVT;              /* OBTAIN ADDRESS ASMVT          */
*                                                                  0055
         L     @12,CVTPTR                                          0055
         L     ASMVTPTR,CVTASMVT(,@12)                             0055
*   /*****************************************************************/
*   /*                                                               */
*   /* BEGIN ILRGMA MACRO EXPANSION                                  */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0056
*   DO;                             /* ILRGMA GET                  0056
*                                      CELL(BWK)WORKREGS(R11,R12)    */
*     DECLARE                       /* ASMVT VECTOR TO ILRPEX        */
*       ILRPEX ENTRY BASED(ASMPEX) VALRG(0);                       0057
*     DECLARE                       /* MAP FOR CELL CONTROL WORDS    */
*       1 GMACELL BASED BDY(WORD),                                 0058
*        2 GMANEXT PTR(31);         /* PTR NEXT FREE CELL            */
*     RESPECIFY                                                    0059
*      (R0,                                                        0059
*       R1,                                                        0059
*       R11,                                                       0059
*       R12,                                                       0059
*       R14,                                                       0059
*       R15) RESTRICTED;                                           0059
*     RESPECIFY                                                    0060
*       ASMPOOLS BASED(R11);                                       0060
*     RESPECIFY                                                    0061
*       GMACELL BASED(R14);                                        0061
*     R11=ADDR(ASMBWKPC);                                          0062
         LA    R11,ASMBWKPC(,ASMVTPTR)                             0062
*     LM(R14,R15,ASMCPAVQ);         /* GET ADDR OF 1ST CELL          */
         LM    R14,R15,ASMCPAVQ(R11)                               0063
*GMA00010:                                                         0064
*     IF R14^=0 THEN                /* TEST CELL POOL                */
GMA00010 LTR   R14,R14                                             0064
         BZ    @RF00064                                            0064
*       DO;                         /* CELL AVAILABLE, REMOVE CELL   */
*         R0=GMANEXT;                                              0066
         L     R0,GMANEXT(,R14)                                    0066
*         R1=R15-1;                                                0067
         LR    R1,R15                                              0067
         BCTR  R1,0                                                0067
*         CDS(R14,R0,ASMCPAVQ);                                    0068
         CDS   R14,R0,ASMCPAVQ(R11)                                0068
*         BC(7,GMA00010);                                          0069
         BC    7,GMA00010                                          0069
*         R1=R14;                                                  0070
         LR    R1,R14                                              0070
*       END;                                                       0071
*     ELSE                                                         0072
*       DO;                         /* CELL POOL EMPTY               */
         B     @RC00064                                            0072
@RF00064 DS    0H                                                  0073
*         R1=R11;                   /* PREPARE TO CALL PEX           */
         LR    R1,R11                                              0073
*         CALL ILRPEX;              /* EXTEND THE POOL               */
         L     @15,ASMPEX(,ASMVTPTR)                               0074
         BALR  @14,@15                                             0074
*       END;                                                       0075
*     RESPECIFY                                                    0076
*      (R0,                                                        0076
*       R1,                                                        0076
*       R11,                                                       0076
*       R12,                                                       0076
*       R14,                                                       0076
*       R15) UNRESTRICTED;                                         0076
@RC00064 DS    0H                                                  0077
*   END;                            /* ILRGMA GET                  0077
*                                      CELL(BWK)WORKREGS(R11,R12)    */
*                                                                  0077
*   /*****************************************************************/
*   /*                                                               */
*   /* END ILRGMA MACRO EXPANSION                                    */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0078
*   RFY                                                            0078
*     R1 RSTD;                                                     0078
*   IF R1=ZERO THEN                                                0079
         LTR   R1,R1                                               0079
         BNZ   @RF00079                                            0079
*     DO;                           /* GMA UNSUCCESSFUL, NOT ENOUGH
*                                      STORAGE                       */
*       GEN REFS(SRBPTR);                                          0081
*                 /* RESCHEDULE SRB CONTROLLER */
     SCHEDULE SRB=(SRBPTR),SCOPE=LOCAL  REDRIVE SRB CONTROLLER
*     END;                          /* END GMA UNSUCCESSFUL          */
*                                                                  0083
*   /*****************************************************************/
*   /*                                                               */
*   /* ILRGMA SUCCESSFUL, INITIALIZE EPATH AND ATA, AND GET THE ASM  */
*   /* CLASS LOCK                                                    */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0083
*   ELSE                                                           0083
*     DO;                           /* GMA SUCCESSFUL, WORK AREA   0083
*                                      OBTAINED                      */
         B     @RC00079                                            0083
@RF00079 DS    0H                                                  0084
*       WKSAV@=R1;                  /* OBTAIN ADDRESSIBILITY TO WORK
*                                      AREA                          */
         LR    WKSAV@,R1                                           0084
*       GEN(USING      @DATD,WKSAV@);/* INDICATE MEANS TO ADDRESS  0085
*                                      WORK AREA                     */
         USING      @DATD,WKSAV@
*       EPATH=''B;                  /* CLEAR THE EPATH               */
         XC    EPATH(52),EPATH                                     0086
*       ATAEPATH=ADDR(EPATH);       /* RRR-SET EPATH ADDR IN ATA-RRR */
         LA    @12,EPATH                                           0087
         ST    @12,ATAEPATH(,ATAPTR)                               0087
*       EPASWKA=WKSAV@;             /* RRR-CHECKPOINT WORK AREA IN 0088
*                                      EPATH-RRR                     */
         ST    WKSAV@,EPASWKA                                      0088
*       RFY                                                        0089
*         R1 UNRSTD;                                               0089
*       RFY                                                        0090
*         R11 RSTD;                                                0090
*       R11=ADDR(ASHLOCK);          /* OBTAIN ADDR ASM LOCK WORD     */
         LA    R11,ASHLOCK(,RSMHDPTR)                              0091
*       GEN REFS(R11);                                             0092
GETASM  SETLOCK  OBTAIN,TYPE=ASM,ADDR=(11),MODE=UNCOND,               **
               RELATED=(VIO,ILRSRBC(FREASM))
*       RFY                                                        0093
*         R11 UNRSTD;                                              0093
*       ATAMODID=ATAMSRBC;          /* RRR-SET MOD ID IN ATA-RRR     */
         MVI   ATAMODID(ATAPTR),X'08'                              0094
*       ASHSCHED=OFF;               /* RRR-RESET SRB SCHEDULED     0095
*                                      FLAG-RRR                      */
         NI    ASHSCHED(RSMHDPTR),B'01111111'                      0095
*                                                                  0096
*       /*************************************************************/
*       /*                                                           */
*       /* LOOP THRU ALL LGES SEARCHING FOR WORK PENDING WHICH CAN BE*/
*       /* STARTED                                                   */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0096
*       LGEPTR=ASHLGEQ;             /* OBTAIN ADDR FIRST LGE ON ASMHD
*                                      LGE QUEUE                     */
         L     LGEPTR,ASHLGEQ(,RSMHDPTR)                           0096
*       DO WHILE LGEPTR^=ZERO;      /* LOOP THRU ALL LGES            */
         B     @DE00097                                            0097
@DL00097 DS    0H                                                  0098
*         IF LGEWRKPD=ON&LGEGRINP=OFF THEN                         0098
         TM    LGEWRKPD(LGEPTR),B'10000000'                        0098
         BNO   @RF00098                                            0098
         TM    LGEGRINP(LGEPTR),B'01000000'                        0098
         BNZ   @RF00098                                            0098
*           DO;                     /* WORK PENDING AND NO GROUP   0099
*                                      OPERATION IN PROCESS          */
*             LGEWRKPD=OFF;         /* RESET WORK PENDING FLAG       */
*                                                                  0100
         NI    LGEWRKPD(LGEPTR),B'01111111'                        0100
*             /*******************************************************/
*             /*                                                     */
*             /* LOOP THRU ALL ELEMENTS ON THE LGE PROCESS QUEUE,    */
*             /* UNTIL A GROUP-OP ACE IS FOUND OR ALL ELEMENTS HAVE  */
*             /* BEEN PROCESSED. AIAS ARE QUEUED TO THE ATAAIAQ AND  */
*             /* ILRTRANS IS CALLED FOR TRANSFER PAGE ACES. AIA AND  */
*             /* ACE ARE BASED ON THE SAME REGISTER (R7).            */
*             /*                                                     */
*             /*******************************************************/
*                                                                  0101
*             AIAPTR=LGEPROCF;      /* OBTAIN ADDR FIRST AIA OR ACE
*                                      ON PROCESS Q                  */
         L     AIAPTR,LGEPROCF(,LGEPTR)                            0101
*             DO WHILE AIAPTR^=ZERO&ACEGRPRQ=OFF;/* LOOP THRU PROCESS
*                                      QUEUE UNTIL A GROUP-OP ACE IS
*                                      FOUND OR NO ELEMENTS ARE LEFT */
*                                                                  0102
         B     @DE00102                                            0102
@DL00102 DS    0H                                                  0103
*               /*****************************************************/
*               /*                                                   */
*               /* PROCESSING INSIDE THIS LOOP IS FOR AIAS OR        */
*               /* TRANSFER PAGE ACES ONLY                           */
*               /*                                                   */
*               /*****************************************************/
*                                                                  0103
*               NXTAIACE=AIAFQPA;   /* OBTAIN ADDR NEXT ELEMENT ON Q */
         L     NXTAIACE,AIAFQPA(,AIAPTR)                           0103
*               IF AIAPRINO=OFF THEN                               0104
         TM    AIAPRINO(AIAPTR),B'01000000'                        0104
         BNZ   @RF00104                                            0104
*                 DO;               /* PROCESS NOT IN OPERATION FOR Q
*                                      ELEMENT                       */
*                   AIAPRINO=ON;    /* SET PROCESS IN OPERATION FLAG */
         OI    AIAPRINO(AIAPTR),B'01000000'                        0106
*                   IF AIALPMEC=ON THEN/* LPID CONVERTED TO LPME ADDR*/
         TM    AIALPMEC(AIAPTR),B'00001000'                        0107
         BNO   @RF00107                                            0107
*                     IF AIALPMEP->ASPLOPIN=ON THEN/* PROCESS IN   0108
*                                      OPERATION FOR LPME            */
         L     @12,AIALPMEP(,AIAPTR)                               0108
         TM    ASPLOPIN(@12),B'00100000'                           0108
         BNO   @RF00108                                            0108
*                       IF ACEOP=ACETRPAG&ACEOVRID=ON THEN         0109
         CLI   ACEOP(ACEPTR),4                                     0109
         BNE   @RF00109                                            0109
         TM    ACEOVRID(ACEPTR),B'00100000'                        0109
         BNO   @RF00109                                            0109
*                         DO;       /* TRANSFER PAGE ACE AND TRANSFER
*                                      PAGE OVERIDE FLAG IS ON       */
*                           RFY                                    0111
*                            (R13,                                 0111
*                             R0,                                  0111
*                             R1) RSTD;                            0111
*                           R13=ADDR(SAVAREA);/* SET SAVE AREA     0112
*                                      ADDRESS                       */
         LA    R13,SAVAREA                                         0112
*                           R0=ADDR(SAVAREA1);/* SAVE AREA FOR FREE
*                                      SLOT PASSED TO ILRTRANS       */
         LA    R0,SAVAREA1                                         0113
*                           R1=ACEPTR;/* SET ADDR TRANSFER PAGE ACE
*                                      TO BE PROCESSED               */
         LR    R1,ACEPTR                                           0114
*                           CALL ILRTRANS;/* PERFORMS THE TRANSFER 0115
*                                      PAGE OPERATION                */
         L     @15,@CV01752                                        0115
         BALR  @14,@15                                             0115
*                           RFY                                    0116
*                            (R13,                                 0116
*                             R0,                                  0116
*                             R1) UNRSTD;                          0116
*                           CALL ACEDEQFR;/* DEQUEUES AND FREES THE
*                                      ACE                           */
         BAL   @14,ACEDEQFR                                        0117
*                         END;      /* TRANSFER PAGE ACE, OVERRIDE ON*/
*                       ELSE                                       0119
*                         DO;                                      0119
         B     @RC00109                                            0119
@RF00109 DS    0H                                                  0120
*                           AIAPRINO=OFF;/* RESET PROCESS IN       0120
*                                      OPERATION FOR AIA FLAG        */
         NI    AIAPRINO(AIAPTR),B'10111111'                        0120
*                           LGEWRKPD=ON;/* SET WORK PENDING FLAG FOR
*                                      LGE                           */
         OI    LGEWRKPD(LGEPTR),B'10000000'                        0121
*                         END;                                     0122
*                                                                  0123
*                   /*************************************************/
*                   /*                                               */
*                   /* PROCESS NOT IN OPERATION FOR LPME, CALL       */
*                   /* ILRTRANS ON TRANSFER PAGE REQUESTS, QUEUE AIAS*/
*                   /* FOR ILRESTRT ON PAGING REQUESTS               */
*                   /*                                               */
*                   /*************************************************/
*                                                                  0123
*                     ELSE          /* PROCESS NOT IN OPERATION FOR
*                                      LPME                          */
*                       IF ACEOP=ACETRPAG THEN/* TRANSFER PAGE ACE   */
         B     @RC00108                                            0123
@RF00108 CLI   ACEOP(ACEPTR),4                                     0123
         BNE   @RF00123                                            0123
*                         IF ACETRPWT=ON THEN                      0124
         TM    ACETRPWT(ACEPTR),B'01000000'                        0124
         BNO   @RF00124                                            0124
*                           DO;     /* TRANSFER PAGE REQUEST WAITING
*                                      FOR I/O TO COMPLETE           */
*                             ACETLPME->ASPLOPIN=ON;/* SET PROCESS IN
*                                      OPERATION FLAG                */
         L     @12,ACETLPME(,ACEPTR)                               0126
         OI    ASPLOPIN(@12),B'00100000'                           0126
*                             ACEPRINO=OFF;/* RESET PROCESS IN     0127
*                                      OPERATION FOR ACE FLAG        */
         NI    ACEPRINO(ACEPTR),B'10111111'                        0127
*                             LGEWRKPD=ON;/* SET WORK PENDING FLAG 0128
*                                      FOR LGE                       */
         OI    LGEWRKPD(LGEPTR),B'10000000'                        0128
*                           END;    /* TRANSFER PAGE WAITING         */
*                         ELSE                                     0130
*                           DO;     /* TRANSFER PAGE NOT WAITING,  0130
*                                      CALL ILRTRANS                 */
         B     @RC00124                                            0130
@RF00124 DS    0H                                                  0131
*                             RFY                                  0131
*                              (R1,                                0131
*                               R0,                                0131
*                               R13) RSTD;                         0131
*                             R13=ADDR(SAVAREA);/* SET SAVE AREA   0132
*                                      ADDRESS                       */
         LA    R13,SAVAREA                                         0132
*                             R0=ADDR(SAVAREA1);/* SAVE AREA FOR FREE
*                                      SLOT PASSED TO ILRTRANS       */
         LA    R0,SAVAREA1                                         0133
*                             R1=ACEPTR;/* SET ADDR TRANSFER PAGE ACE
*                                      TO BE PROCESSED               */
         LR    R1,ACEPTR                                           0134
*                             CALL ILRTRANS;/* PERFORMS THE TRANSFER
*                                      PAGE REQUEST                  */
         L     @15,@CV01752                                        0135
         BALR  @14,@15                                             0135
*                             RFY                                  0136
*                              (R1,                                0136
*                               R0,                                0136
*                               R13) UNRSTD;                       0136
*                             CALL ACEDEQFR;/* DEQUEUES AND FREES THE
*                                      ACE                           */
         BAL   @14,ACEDEQFR                                        0137
*                           END;    /* TRANSFER PAGE NOT WAITING     */
*                       ELSE                                       0139
*                         DO;       /* PAGING AIA, QUEUE AIA FOR   0139
*                                      ILRESTRT ROUTINE              */
         B     @RC00123                                            0139
@RF00123 DS    0H                                                  0140
*                           AIALPMEP->ASPLOPIN=ON;/* SET PROCESS IN
*                                      OPERATION FLAG                */
         L     @12,AIALPMEP(,AIAPTR)                               0140
         OI    ASPLOPIN(@12),B'00100000'                           0140
*                           AIANXAIA=ATAAIAQ;/* Q ATAAIAQ TO AIA,  0141
*                                      LIFO Q                        */
         L     @12,ATAAIAQ(,ATAPTR)                                0141
         ST    @12,AIANXAIA(,AIAPTR)                               0141
*                           ATAAIAQ=AIAPTR;/* RRR-MAKE THE AIA THE 0142
*                                      FIRST ELEMENT ON THE Q-RRR    */
         ST    AIAPTR,ATAAIAQ(,ATAPTR)                             0142
*                         END;      /* PAGING AIA                    */
*                                                                  0144
*                   /*************************************************/
*                   /*                                               */
*                   /* AN IMPOSSIBLE SITUATION EXISTS, THE LPID      */
*                   /* CONVERTED FLAG (AIALPMEC) IS OFF, RECORD THE  */
*                   /* ERROR, FREE THE ACE, OR Q THE AIA TO THE PART */
*                   /* AIA ERROR QUEUE.                              */
*                   /*                                               */
*                   /*************************************************/
*                                                                  0144
*                   ELSE                                           0144
*                     DO;           /* LPID NOT CONVERTED            */
         B     @RC00107                                            0144
@RF00107 DS    0H                                                  0145
*                       ATARCODE=REACOD20;/* SET REASON CODE FOR C0D
*                                      ABEND                         */
         MVI   ATARCODE(ATAPTR),X'14'                              0145
*                       GEN(ABEND      X'C0D',,,SYSTEM);/* ISSUE C0D
*                                      RECORD ONLY ABEND             */
         ABEND      X'C0D',,,SYSTEM
*                       IF ACEOP=ACETRPAG THEN                     0147
         CLI   ACEOP(ACEPTR),4                                     0147
         BNE   @RF00147                                            0147
*                         CALL ACEDEQFR;/* DEQUEUE AND FREE THE ACE
*                                      ON A TRANSFER PAGE REQUEST    */
         BAL   @14,ACEDEQFR                                        0148
*                       ELSE                                       0149
*                         DO;       /* PAGING AIA REQUEST, Q THE AIA
*                                      TO THE PART ERROR QUEUE       */
         B     @RC00147                                            0149
@RF00147 DS    0H                                                  0150
*                           AIAERROR=ON;/* SET LOGICAL ERROR FLAG    */
         OI    AIAERROR(AIAPTR),B'00000010'                        0150
*                           ASHIOCNT=ASHIOCNT+ONE;/* INCREMENT I/O 0151
*                                      REQUEST STARTED COUNT         */
         LA    @12,1                                               0151
         AL    @12,ASHIOCNT(,RSMHDPTR)                             0151
         ST    @12,ASHIOCNT(,RSMHDPTR)                             0151
*                           RFY                                    0152
*                            (PARTPTR,                             0152
*                             R0) RSTD;                            0152
*                           PARTPTR=ASMPART;/* OBTAIN ADDRESSIBILITY
*                                      TO PART                       */
         L     PARTPTR,ASMPART(,ASMVTPTR)                          0153
*                           R0=PARTAIAE;/* OBTAIN PART AIA ERROR Q,
*                                      LIFO Q                        */
         L     R0,PARTAIAE(,PARTPTR)                               0154
*TRYAGAIN:                                                         0155
*                           AIANXAIA=R0;/* CHAIN ERROR Q TO AIA      */
TRYAGAIN ST    R0,AIANXAIA(,AIAPTR)                                0155
*                           CS(R0,AIAPTR,PARTAIAE);/* MAKE AIA FIRST
*                                      ELEMENT ON Q                  */
         CS    R0,@07,PARTAIAE(PARTPTR)                            0156
*                           BC(NE,TRYAGAIN);/* NOT SUCCESSFUL, TRY 0157
*                                      AGAIN                         */
         BC    7,TRYAGAIN                                          0157
*                           RFY                                    0158
*                            (PARTPTR,                             0158
*                             R0) UNRSTD;                          0158
*                         END;      /* PAGING AIA ERROR              */
*                     END;          /* END LPID NOT CONVERTED        */
@RC00147 DS    0H                                                  0161
*                 END;              /* PROCESS NOT IN OPERATION FOR Q
*                                      ELEMENT                       */
@RC00107 DS    0H                                                  0162
*               AIAPTR=NXTAIACE;    /* OBTAIN ADDR NEXT AIA OR ACE   */
@RF00104 LR    AIAPTR,NXTAIACE                                     0162
*             END;                  /* LOOP THRU PROCESS Q ELEMENTS  */
@DE00102 LTR   AIAPTR,AIAPTR                                       0163
         BZ    @DC00102                                            0163
         TM    ACEGRPRQ(ACEPTR),B'10000000'                        0163
         BZ    @DL00102                                            0163
@DC00102 DS    0H                                                  0164
*                                                                  0164
*             /*******************************************************/
*             /*                                                     */
*             /* IF GROUP-OP ACE WAS FOUND TO BE FIRST ON THE LGE    */
*             /* PROCESS QUEUE THEN QUEUE IT TO ATAACEQ. WHETHER     */
*             /* FOUND OR NOT CONTINUE TO LOOP THRU THE LGES.        */
*             /*                                                     */
*             /*******************************************************/
*                                                                  0164
*             IF ACEPTR^=ZERO THEN  /* GROUP-OP ACE                  */
         SLR   @12,@12                                             0164
         CR    ACEPTR,@12                                          0164
         BE    @RF00164                                            0164
*               IF ACEPTR=LGEPROCF THEN/* GROUP-OP ACE IS FIRST ON 0165
*                                      PROCESS Q                     */
         C     ACEPTR,LGEPROCF(,LGEPTR)                            0165
         BNE   @RF00165                                            0165
*                 DO;               /* QUEUE THE GROUP-OP ACE, LIFO
*                                      QUEUE                         */
*                   LGEGRINP=ON;    /* SET GROUP-OP IN PROCESS FLAG  */
         OI    LGEGRINP(LGEPTR),B'01000000'                        0167
*                   ACESRBWK=ATAACEQ;/* QUEUE ATAACEQ TO ACE         */
         L     @15,ATAACEQ(,ATAPTR)                                0168
         ST    @15,ACESRBWK(,ACEPTR)                               0168
*                   ATAACEQ=ACEPTR; /* RRR-MAKE ACE FIRST ELEMENT ON
*                                      QUEUE-RRR                     */
         ST    ACEPTR,ATAACEQ(,ATAPTR)                             0169
*                   IF ACEFQPA^=ZERO THEN                          0170
         C     @12,ACEFQPA(,ACEPTR)                                0170
         BE    @RF00170                                            0170
*                     LGEWRKPD=ON;  /* MORE ELEMENTS ARE ON THE LGE
*                                      PROCESS QUEUE, SET THE WORK 0171
*                                      PENDING FLAG                  */
         OI    LGEWRKPD(LGEPTR),B'10000000'                        0171
*                 END;              /* QUEUE GROUP-OP ACE            */
*               ELSE                                               0173
*                 LGEWRKPD=ON;      /* SET WORK PENDING FLAG IN LGE  */
         B     @RC00165                                            0173
@RF00165 OI    LGEWRKPD(LGEPTR),B'10000000'                        0173
*           END;                    /* WORK PENDING AND NO GROUP-OP
*                                      IN PROCESS                    */
@RC00165 DS    0H                                                  0174
@RF00164 DS    0H                                                  0175
*         LGEPTR=LGENEXT;           /* OBTAIN ADDR NEXT LGE          */
@RF00098 L     LGEPTR,LGENEXT(,LGEPTR)                             0175
*       END;                        /* END LOOP THRU ALL LGES        */
@DE00097 LTR   LGEPTR,LGEPTR                                       0176
         BNZ   @DL00097                                            0176
*                                                                  0177
*       /*************************************************************/
*       /*                                                           */
*       /* RELEASE THE ASM LOCK, CALL ILRESTRT IF NECESSARY AND PASS */
*       /* THE QUEUE OF PAGING AIAS, CALL ILRRLG FOR RELEASE AND     */
*       /* DEACTIVATE ACES AND POST THE ACE ECB FOR OTHER GROUP-OP   */
*       /* ACES IF THERE ARE ANY ON THE ACE QUEUE.                   */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0177
*       RFY                                                        0177
*         R11 RSTD;                                                0177
*       R11=ADDR(ASHLOCK);          /* OBTAIN ADDR ASM LOCK WORD     */
         LA    R11,ASHLOCK(,RSMHDPTR)                              0178
*       GEN REFS(R11);                                             0179
FREASM  SETLOCK  RELEASE,TYPE=ASM,ADDR=(11),                          **
               RELATED=(VIO,ILRSRBC(GETASM))
*       RFY                                                        0180
*         R11 UNRSTD;                                              0180
*       IF ATAAIAQ^=ZERO THEN                                      0181
         L     @12,ATAAIAQ(,ATAPTR)                                0181
         LTR   @12,@12                                             0181
         BZ    @RF00181                                            0181
*         DO;                       /* PAGING AIAS FOUND             */
*           RFY                                                    0183
*            (R1,                                                  0183
*             R13) RSTD;                                           0183
*           R13=ADDR(SAVAREA);      /* OBTAIN SAVE AREA FOR RESTART  */
         LA    R13,SAVAREA                                         0184
*           R1=ATAAIAQ;             /* OBTAIN ADDR AIA QUEUE FOR   0185
*                                      RESTART                       */
         LR    R1,@12                                              0185
*           CALL ILRESTRT;          /* ROUTINE RESTARTS PROCESSING 0186
*                                      FOR THE QUEUE OF STARTABLE  0186
*                                      AIAS PASSED                   */
         L     @15,@CV01753                                        0186
         BALR  @14,@15                                             0186
*           RFY                                                    0187
*            (R1,                                                  0187
*             R13) UNRSTD;                                         0187
*         END;                      /* END PAGING AIAS FOUND         */
*       IF ATAACEQ^=ZERO THEN                                      0189
@RF00181 L     @12,ATAACEQ(,ATAPTR)                                0189
         LTR   @12,@12                                             0189
         BZ    @RF00189                                            0189
*         DO;                       /* GROUP-OP ACES FOUND           */
*           GEN;                                                   0191
GETLOC  SETLOCK  OBTAIN,TYPE=LOCAL,MODE=UNCOND,                       **
               RELATED=(VIO,ILRSRBC(FRELOC))
*           ACEPTR=ATAACEQ;         /* OBTAIN ADDR FIRST ACE ON QUEUE*/
         L     ACEPTR,ATAACEQ(,ATAPTR)                             0192
*           DO UNTIL ACEPTR=ZERO;   /* LOOP THRU ALL ACES OF ATAACEQ */
@DL00193 DS    0H                                                  0194
*                                                                  0194
*             /*******************************************************/
*             /*                                                     */
*             /* PROCESS RELEASE AND DEACTIVATE REQUESTS BY CALLING  */
*             /* RELEASE GROUP OPERATOR                              */
*             /*                                                     */
*             /*******************************************************/
*                                                                  0194
*             IF ACEOP=ACERELLG×ACEOP=ACEDEACT THEN                0194
         CLI   ACEOP(ACEPTR),12                                    0194
         BE    @RT00194                                            0194
         CLI   ACEOP(ACEPTR),28                                    0194
         BNE   @RF00194                                            0194
@RT00194 DS    0H                                                  0195
*               DO;                 /* FOR DEACTIVATE OR RELEASE   0195
*                                      REQUESTS CALL THE RELEASE   0195
*                                      GROUP OPERATOR                */
*                 ATAACEQ=ACESRBWK; /* DEQUEUE ACE AND UPDATE ANCHOR
*                                      TO NEXT ELEMENT               */
         L     @12,ACESRBWK(,ACEPTR)                               0196
         ST    @12,ATAACEQ(,ATAPTR)                                0196
*                 RFY                                              0197
*                  (R13,                                           0197
*                   R1,                                            0197
*                   R15) RSTD;                                     0197
*                 R13=ADDR(SAVAREA);/* OBTAIN ADDR SAVE AREA FOR   0198
*                                      RELEASE GROUP-OP              */
         LA    R13,SAVAREA                                         0198
*                 R1=ACEPTR;        /* ADDR ACE PASSED TO RELEASE  0199
*                                      GROUP-OP                      */
         LR    R1,ACEPTR                                           0199
*                 R4SAVE=ATAPTR;    /* STORE ATA ADDR                */
         LR    R4SAVE,ATAPTR                                       0200
*                 R4=ADDR(EPATH);   /* RELEASE GROUP-OP NEEDS EPATH
*                                      ADDR IN R4                    */
         LA    R4,EPATH                                            0201
*                 CALL ILRRLG;      /* CALL THE RELEASE GROUP      0202
*                                      OPERATOR TO PROCESS THE     0202
*                                      REQUEST IN THE ACE            */
         L     @15,ASMPRLG(,ASMVTPTR)                              0202
         BALR  @14,@15                                             0202
*                 ATAPTR=R4SAVE;    /* RESTORE ATA ADDR              */
         LR    ATAPTR,R4SAVE                                       0203
*                 IF R15=CODE28 THEN                               0204
         C     R15,@CF00463                                        0204
         BNE   @RF00204                                            0204
*                   DO;             /* ON A CODE 28 RETURN THE     0205
*                                      RELEASE OPERATOR COULD NOT  0205
*                                      OBTAIN STORAGE, SO THE WORK 0205
*                                      PENDING FLAG IS SET AND THE 0205
*                                      GROUP-OP FLAG RESET           */
*                     RFY                                          0206
*                      (R1,                                        0206
*                       R13,                                       0206
*                       R15) UNRSTD;                               0206
*                                                                  0206
*                     /***********************************************/
*                     /*                                             */
*                     /* THE ASM CLASS LOCK IS NOT NEEDED BECAUSE THE*/
*                     /* GROUP-OP IN PROCESS FLAG IS ON AND THE      */
*                     /* RELEASE ACE IS FIRST ON THE QUEUE, THUS     */
*                     /* BLOCKING OTHERS FROM THE LGE.               */
*                     /*                                             */
*                     /***********************************************/
*                                                                  0207
*                     LGEPTR=ACELGE;/* OBTAIN ADDR LGE ACE BELONGS TO*/
         L     LGEPTR,ACELGE(,ACEPTR)                              0207
*                     LGEWRKPD=ON;  /* SET LGE WORK PENDING FLAG     */
*                     LGEGRINP=OFF; /* RESET GROUP-OP IN PROCESS FLAG*/
         OI    LGEWRKPD(LGEPTR),B'10000000'                        0209
         NI    LGEGRINP(LGEPTR),B'10111111'                        0209
*                   END;            /* END A CODE28 RETURN           */
*               END;                /* END DEACTIVATE OR RELEASE REQ */
*                                                                  0212
*             /*******************************************************/
*             /*                                                     */
*             /* PROCESS OTHER GROUP-OP REQUESTS BY POSTING THE ECB  */
*             /* WAITED ON BY ILRGOS                                 */
*             /*                                                     */
*             /*******************************************************/
*                                                                  0212
*             ELSE                                                 0212
*               DO;                 /* NOT A RELEASE OR DEACTIVATE 0212
*                                      REQUEST                       */
         B     @RC00194                                            0212
@RF00194 DS    0H                                                  0213
*                 RFY                                              0213
*                  (R11,                                           0213
*                   R10) RSTD;                                     0213
*                 R11=ADDR(ACEECB); /* OBTAIN ADDR ECB TO BE POSTED  */
         LA    R11,ACEECB(,ACEPTR)                                 0214
*                 R10=ZERO;         /* CLEAR COMPLETION CODE FOR POST*/
         SLR   R10,R10                                             0215
*                 CALL BRENPOST;    /* INVOKE INTRA-MEMORY BRANCH  0216
*                                      ENTRY POST                    */
         L     @12,CVTPTR                                          0216
         L     @15,CVT0PT02(,@12)                                  0216
         BALR  @14,@15                                             0216
*                 RFY                                              0217
*                  (R11,                                           0217
*                   R10) UNRSTD;                                   0217
*                 ATAACEQ=ACESRBWK; /* DEQUEUE ACE AND UPDATE ANCHOR
*                                      TO NEXT ELEMENT               */
         L     @12,ACESRBWK(,ACEPTR)                               0218
         ST    @12,ATAACEQ(,ATAPTR)                                0218
*               END;                /* NOT RELEASE, DEACTIVATE     0219
*                                      REQUEST                       */
*             ACEPTR=ATAACEQ;       /* OBTAIN ADDR NEXT ACE ON THE Q */
@RC00194 L     ACEPTR,ATAACEQ(,ATAPTR)                             0220
*           END;                    /* END LOOP THRU ACES            */
@DE00193 LTR   ACEPTR,ACEPTR                                       0221
         BNZ   @DL00193                                            0221
*           GEN;                                                   0222
FRELOC  SETLOCK  RELEASE,TYPE=LOCAL,RELATED=(VIO,ILRSRBC(GETLOC))
*         END;                      /* GROUP-OP ACES FOUND           */
*                                                                  0224
*       /*************************************************************/
*       /*                                                           */
*       /* FREE THE WORK-SAVE AREA, DELETE RECOVERY, AND RETURN TO   */
*       /* THE DISPATCHER                                            */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0224
*       RFY                                                        0224
*         R1 RSTD;                                                 0224
@RF00189 DS    0H                                                  0225
*       R1=WKSAV@;                  /* OBTAIN ADDR WORK AREA TO BE 0225
*                                      FREED                         */
*                                                                  0225
         LR    R1,WKSAV@                                           0225
*       /*************************************************************/
*       /*                                                           */
*       /* BEGIN ILRGMA MACRO EXPANSION                              */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0226
*       DO;                         /* ILRGMA FREE                 0226
*                                      CELL(BWK)WORKREGS(R11,R12)    */
*         RESPECIFY                                                0227
*          (R0,                                                    0227
*           R1,                                                    0227
*           R11,                                                   0227
*           R12,                                                   0227
*           R14,                                                   0227
*           R15) RESTRICTED;                                       0227
*         RESPECIFY                                                0228
*           ASMPOOLS BASED(R11);                                   0228
*         RESPECIFY                                                0229
*           GMACELL BASED(R1);                                     0229
*         R11=ADDR(ASMBWKPC);                                      0230
         LA    R11,ASMBWKPC(,ASMVTPTR)                             0230
*         R14=ASMCPAVL;                                            0231
         L     R14,ASMCPAVL(,R11)                                  0231
*GMA00022:                                                         0232
*         GMANEXT=R14;              /* PUT ADDR CURRENT FIRST IN   0232
*                                      INPUT CELL                    */
GMA00022 ST    R14,GMANEXT(,R1)                                    0232
*         CS(R14,R1,ASMCPAVL);      /* ADD INPUT CELL TO POOL        */
         CS    R14,@01,ASMCPAVL(R11)                               0233
*         BC(7,GMA00022);                                          0234
         BC    7,GMA00022                                          0234
*         RESPECIFY                                                0235
*          (R0,                                                    0235
*           R1,                                                    0235
*           R11,                                                   0235
*           R12,                                                   0235
*           R14,                                                   0235
*           R15) UNRESTRICTED;                                     0235
*       END;                        /* ILRGMA FREE                 0236
*                                      CELL(BWK)WORKREGS(R11,R12)    */
*                                                                  0236
*       /*************************************************************/
*       /*                                                           */
*       /* END ILRGMA MACRO EXPANSION                                */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0237
*     END;                          /* END GMA SUCCESSFUL            */
*   RFY                                                            0238
*     R14 RSTD;                                                    0238
@RC00079 DS    0H                                                  0239
*   R14=CVTSRBRT;                   /* OBTAIN RETURN ADDR FROM CVT   */
         L     @12,CVTPTR                                          0239
         L     R14,CVTSRBRT(,@12)                                  0239
*   GEN REFS(R14);                                                 0240
*              /* DELETE RECOVERY AND RETURN TO DISPATCHER */
        SETFRR  D,WRKREGS=(R11,R12),RELATED=(SETFRR,ILRSRBC)
        BR      R14   RETURN TO DISPATCHER
*ILRSRBRM:                                                         0241
*   ENTRY;                                                         0241
*                                                                  0241
@EP00241 DS    0H                                                  0242
*/********************************************************************/
*/*                                                                  */
*/* ILRSRBRM IS A RESOURCE MANAGER TERMINATION ROUTINE INVOKED BY    */
*/* PURGE DEQUEUE. IF THE RSM HEADER EXISTS THE ASM HEADER SRB       */
*/* SCHEDULED FLAG IS RESET, OTHERWISE, THE SRB IS FREED.            */
*/*                                                                  */
*/* INPUT: R1 CONTAINS THE SRB ADDRESS                               */
*/*        R14 CONTAINS THE RETURN ADDRESS                           */
*/*                                                                  */
*/* OUTPUT: ASHSCHED RESET OR SRB FREED                              */
*/*                                                                  */
*/********************************************************************/
*/********************************************************************/
*/*SRBRM:   CHART (AREF)                                             */
*/*         HEADER                                                 0242
*/*         ILRSRBC                                                0242
*/* ILRSRBRM - SRBC RESOURCE MANAGER                                 */
*/*ILRSRBRM: E ENTRY                                                 */
*/*         P SAVE RETURN ADDR                                       */
*/*         P MAINTAIN SRBPTR (SRBPTR=R1)                            */
*/*         P OBTAIN ASCBPTR, ASCBPTR = SRBASCB                      */
*/*         P OBTAIN ADDRESSIBILITY TO ASMH BY RSMHDPTR = ASCBRSM    */
*/*         D (Y,,N,%SRBC26) RSMHDPTR = 0, NO RSMHD                  */
*/*         L (,%SRBC27) FREEMAIN: FREE SQA SPACE CONTAINING THE SRB */
*/*%SRBC26: P RESET SRB SCHEDULED FLAG (ASHSCHED)                    */
*/*%SRBC27: P RESTORE RETURN ADDR                                    */
*/*         R RETURN                                                 */
*/*SRBRM:   END                                                      */
*/********************************************************************/
*                                                                  0242
*   RFY                                                            0242
*    (R1,                                                          0242
*     R10,                                                         0242
*     R11,                                                         0242
*     R14,                                                         0242
*     R15) RSTD;                                                   0242
*   R10=R14;                        /* MAINTAIN RETURN ADDR          */
         LR    R10,R14                                             0243
*   SRBPTR=R1;                      /* OBTAIN ADDRESSIBILITY TO THE
*                                      SRB                           */
         LR    SRBPTR,R1                                           0244
*   IF SRBASCB->ASCBRSM=ZERO THEN                                  0245
         L     @12,SRBASCB(,SRBPTR)                                0245
         L     @12,ASCBRSM(,@12)                                   0245
         LTR   @12,@12                                             0245
         BNZ   @RF00245                                            0245
*     DO;                           /* RSM HEADER DOES NOT EXIST,  0246
*                                      FREE THE SRB                  */
*       R11=LENGTH(SRB);            /* OBTAIN LENGTH OF THE SRB      */
         LA    R11,44                                              0247
*       GEN REFS(R11,SRBPTR);                                      0248
*                     /* FREE THE SQA SPACE CONTAINING THE SRB */
         FREEMAIN  RC,SP=245,A=(SRBPTR),LV=(R11)
*     END;                          /* RSM HEADER DOES NOT EXIST     */
*   ELSE                                                           0250
*     SRBASCB->ASCBRSM->ASHSCHED=OFF;/* RESET SRB SCHEDULED FLAG     */
         B     @RC00245                                            0250
@RF00245 L     @12,SRBASCB(,SRBPTR)                                0250
         L     @12,ASCBRSM(,@12)                                   0250
         NI    ASHSCHED(@12),B'01111111'                           0250
*   R15=ZERO;                       /* ZERO RETURN CODE              */
@RC00245 SLR   R15,R15                                             0251
*   R14=R10;                        /* RESTORE RETURN ADDR           */
         LR    R14,R10                                             0252
*   RFY                                                            0253
*    (R1,                                                          0253
*     R10,                                                         0253
*     R11,                                                         0253
*     R15) UNRSTD;                                                 0253
*SRBRMEND:                                                         0254
*   GEN(BR     R14      RETURN TO CALLER);/* RETURN                  */
SRBRMEND BR     R14      RETURN TO CALLER
*ACEDEQFR:                                                         0255
*   PROCEDURE OPTIONS(NOSAVE,NOSAVEAREA);                          0255
*                                                                  0255
ACEDEQFR DS    0H                                                  0256
*/********************************************************************/
*/*                                                                  */
*/* ACEDEQFR WILL DEQUEUE AN ACE FROM THE LGE PROCESS QUEUE AND THEN */
*/* FREE THE ACE VIA THE ILRGMA MACRO. THE LGE PROCESS QUEUE IS A    */
*/* DOUBLE HEADED, DOUBLE THREADED QUEUE.                            */
*/*                                                                  */
*/* INPUT:  ACE ADDR IN ACEPTR                                       */
*/*         LGE ADDR IN LGEPTR                                       */
*/*         R2 THRU R4 STANDARD AS IN MAPPING MACRO POINTERS         */
*/*                                                                  */
*/* OUTPUT:  LGEPROCF, LGEPROCL, ACEFQPA, AND/OR ACEBQPA UPDATED.    */
*/*                                                                  */
*/********************************************************************/
*/********************************************************************/
*/*ACEDEQFR: CHART (AREF)                                            */
*/*         HEADER                                                 0256
*/*         ILRSRBC                                                0256
*/* ACEDEQFR - SUBROUTINE TO DEQUEUE AND FREE AN ACE                 */
*/*         E ENTRY                                                  */
*/*         P SAVE RETURN ADDRESS                                    */
*/*         D (Y,,N,%SRBC11) ACE IS FIRST AND LAST ON Q              */
*/*         P (,%SRBC14) FIRST AND LAST PTRS = 0                     */
*/*%SRBC11: D (Y,,N,%SRBC12) ACE IS FIRST ON Q (LGEPROCF)            */
*/*         P FIRST AIA/ACE PTR = ACE FORWARD PTR                    */
*/*         P (,%SRBC14) BACK PTR OF ACE FORWARD PTR = 0             */
*/*%SRBC12: D (Y,,N,%SRBC13) ACE IS LAST ON Q (LGEPROCL)             */
*/*         P LAST AIA/ACE PTR = ACE BACK PTR                        */
*/*         P (,%SRBC14) FORWARD PTR OF ACE BACK PTR = 0             */
*/*%SRBC13: P BACK PTR OF ACE FORWARD PTR = BACK PTR OF ACE          */
*/*         P FORWARD PTR OF ACE BACK PTR = FORWARD PTR OF ACE       */
*/*%SRBC14: P INITIALIZE CELL@ FOR GMA MACRO                         */
*/*         L ILRGMA: RETURN THE ACE TO THE POOL                     */
*/*         R RETURN                                                 */
*/*ACEDEQFR: END                                                     */
*/********************************************************************/
*                                                                  0256
*                                                                  0256
*   /*****************************************************************/
*   /*                                                               */
*   /* DEQUEUES ACE FROM LGE PROCESS QUEUE AND THEN FREES ACE VIA THE*/
*   /* ILRGMA MACRO                                                  */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0256
*   RFY                                                            0256
*    (R10,                                                         0256
*     R14) RSTD;                                                   0256
*   R10=R14;                        /* MAINTAIN THE RETURN ADDR      */
         LR    R10,R14                                             0257
*   RFY                                                            0258
*     R14 UNRSTD;                                                  0258
*   IF ACEPTR=LGEPROCF&ACEPTR=LGEPROCL THEN                        0259
         C     ACEPTR,LGEPROCF(,LGEPTR)                            0259
         BNE   @RF00259                                            0259
         C     ACEPTR,LGEPROCL(,LGEPTR)                            0259
         BNE   @RF00259                                            0259
*     DO;                           /* ACE IS BOTH THE FIRST AND THE
*                                      LAST ELEMENTS ON THE QUEUE    */
*       LGEPROCF=ZERO;              /* CLEAR BOTH THE FIRST AND      */
         SLR   @12,@12                                             0261
         ST    @12,LGEPROCF(,LGEPTR)                               0261
*       LGEPROCL=ZERO;              /* LAST QUEUE ELEMENT POINTERS   */
         ST    @12,LGEPROCL(,LGEPTR)                               0262
*     END;                                                         0263
*   ELSE                                                           0264
*     IF ACEPTR=LGEPROCF THEN                                      0264
         B     @RC00259                                            0264
@RF00259 C     ACEPTR,LGEPROCF(,LGEPTR)                            0264
         BNE   @RF00264                                            0264
*       DO;                         /* ACE IS FIRST BUT NOT LAST   0265
*                                      ELEMENT ON THE QUEUE          */
*         LGEPROCF=ACEFQPA;         /* FIRST ELEMENT SET TO NEXT ACE */
         L     @12,ACEFQPA(,ACEPTR)                                0266
         ST    @12,LGEPROCF(,LGEPTR)                               0266
*         ACEFQPA->ACEBQPA=ZERO;    /* CLEAR BACK POINTER OF NEXT ACE*/
         SLR   @11,@11                                             0267
         ST    @11,ACEBQPA(,@12)                                   0267
*       END;                                                       0268
*     ELSE                                                         0269
*       IF ACEPTR=LGEPROCL THEN                                    0269
         B     @RC00264                                            0269
@RF00264 C     ACEPTR,LGEPROCL(,LGEPTR)                            0269
         BNE   @RF00269                                            0269
*         DO;                       /* ACE IS LAST BUT NOT FIRST   0270
*                                      ELEMENT ON THE QUEUE          */
*           LGEPROCL=ACEBQPA;       /* LAST ELEMENT SET TO PREVIOUS
*                                      ACE                           */
         L     @12,ACEBQPA(,ACEPTR)                                0271
         ST    @12,LGEPROCL(,LGEPTR)                               0271
*           ACEBQPA->ACEFQPA=ZERO;  /* CLEAR FORWARD POINTER OF    0272
*                                      PREVIOUS ACE                  */
         SLR   @11,@11                                             0272
         ST    @11,ACEFQPA(,@12)                                   0272
*         END;                                                     0273
*       ELSE                                                       0274
*         DO;                       /* ACE ON MIDDLE OF QUEUE, NOT 0274
*                                      FIRST OR LAST                 */
         B     @RC00269                                            0274
@RF00269 DS    0H                                                  0275
*           ACEFQPA->ACEBQPA=ACEBQPA;/* BACK PTR OF NEXT ACE SET TO
*                                      BACK PTR OF ACE DEQ'ING       */
         L     @12,ACEFQPA(,ACEPTR)                                0275
         L     @11,ACEBQPA(,ACEPTR)                                0275
         ST    @11,ACEBQPA(,@12)                                   0275
*           ACEBQPA->ACEFQPA=ACEFQPA;/* FORWARD PTR OF PREVIOUS ACE
*                                      SET TO FORWARD PTR OF ACE   0276
*                                      DEQ'ING                       */
         ST    @12,ACEFQPA(,@11)                                   0276
*         END;                                                     0277
*   RFY                                                            0278
*     R1 RSTD;                                                     0278
@RC00269 DS    0H                                                  0278
@RC00264 DS    0H                                                  0278
@RC00259 DS    0H                                                  0279
*   R1=ACEPTR;                      /* OBTAIN ADDR OF ACE TO FREE    */
*                                                                  0279
         LR    R1,ACEPTR                                           0279
*   /*****************************************************************/
*   /*                                                               */
*   /* BEGIN ILRGMA MACRO EXPANSION                                  */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0280
*   DO;                             /* ILRGMA FREE                 0280
*                                      CELL(ACE)WORKREGS(R11,R12)    */
*     RESPECIFY                                                    0281
*      (R0,                                                        0281
*       R1,                                                        0281
*       R11,                                                       0281
*       R12,                                                       0281
*       R14,                                                       0281
*       R15) RESTRICTED;                                           0281
*     RESPECIFY                                                    0282
*       ASMPOOLS BASED(R11);                                       0282
*     RESPECIFY                                                    0283
*       GMACELL BASED(R1);                                         0283
*     R11=ADDR(ASMACEPC);                                          0284
         LA    R11,ASMACEPC(,ASMVTPTR)                             0284
*     LM(R14,R15,ASMCPRSQ);         /* GET CONTENTS OF Q             */
         LM    R14,R15,ASMCPRSQ(R11)                               0285
*GMA00031:                                                         0286
*     IF R14^=0 THEN                /* TEST RESERVE Q                */
GMA00031 LTR   R14,R14                                             0286
         BZ    @RF00286                                            0286
*       DO;                         /* REPLENISH ACE RESERVE Q       */
*         R0=R14-1;                 /* SET UP FOR COMPARE AND SWAP   */
         LR    R0,R14                                              0288
         BCTR  R0,0                                                0288
*         GMANEXT=R15;              /* CELL TO FREE IN R1            */
         ST    R15,GMANEXT(,R1)                                    0289
*         CDS(R14,R0,ASMCPRSQ);     /* ADD CELL TO RESERVE Q         */
         CDS   R14,R0,ASMCPRSQ(R11)                                0290
*         BC(7,GMA00031);                                          0291
         BC    7,GMA00031                                          0291
*       END;                                                       0292
*     ELSE                                                         0293
*       DO;                         /* RETURN ACE TO NORMAL Q        */
         B     @RC00286                                            0293
@RF00286 DS    0H                                                  0294
*         R14=ASMCPAVL;                                            0294
         L     R14,ASMCPAVL(,R11)                                  0294
*GMA00032:                                                         0295
*         GMANEXT=R14;              /* PUT ADDR CURRENT FIRST IN   0295
*                                      INPUT CELL                    */
GMA00032 ST    R14,GMANEXT(,R1)                                    0295
*         CS(R14,R1,ASMCPAVL);      /* ADD INPUT CELL TO POOL        */
         CS    R14,@01,ASMCPAVL(R11)                               0296
*         BC(7,GMA00032);                                          0297
         BC    7,GMA00032                                          0297
*       END;                        /* ACE RETURNED TO NORMAL Q      */
*     RESPECIFY                                                    0299
*      (R0,                                                        0299
*       R1,                                                        0299
*       R11,                                                       0299
*       R12,                                                       0299
*       R14,                                                       0299
*       R15) UNRESTRICTED;                                         0299
@RC00286 DS    0H                                                  0300
*   END;                            /* ILRGMA FREE                 0300
*                                      CELL(ACE)WORKREGS(R11,R12)    */
*                                                                  0300
*   /*****************************************************************/
*   /*                                                               */
*   /* END ILRGMA MACRO EXPANSION                                    */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0301
*   RFY                                                            0301
*     R14 RSTD;                                                    0301
*   R14=R10;                        /* RESTORE RETURN ADDR           */
         LR    R14,R10                                             0302
*   END ACEDEQFR;                                                  0303
@EL00002 DS    0H                                                  0303
@EF00002 DS    0H                                                  0303
@ER00002 BR    @14                                                 0303
*   END ILRSRBC                                                    0304
*                                                                  0304
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */
*/*%INCLUDE SYSLIB  (ILRACE  )                                       */
*/*%INCLUDE SYSLIB  (ILRAIA  )                                       */
*/*%INCLUDE SYSLIB  (IHAASCB )                                       */
*/*%INCLUDE SYSLIB  (IHARSMHD)                                       */
*/*%INCLUDE SYSLIB  (ILRASMHD)                                       */
*/*%INCLUDE SYSLIB  (ILRASMVT)                                       */
*/*%INCLUDE SYSLIB  (ILRASPCT)                                       */
*/*%INCLUDE SYSLIB  (ILRATA  )                                       */
*/*%INCLUDE SYSLIB  (CVT     )                                       */
*/*%INCLUDE SYSLIB  (ILREPATH)                                       */
*/*%INCLUDE SYSLIB  (IHAFRRS )                                       */
*/*%INCLUDE SYSLIB  (ILRLGE  )                                       */
*/*%INCLUDE SYSLIB  (ILRPART )                                       */
*/*%INCLUDE SYSLIB  (IHAPSA  )                                       */
*/*%INCLUDE SYSLIB  (IHASRB  )                                       */
*                                                                  0304
*       ;                                                          0304
@DATA    DS    0H
@DATD    DSECT
         DS    0F
ILRSRBC  CSECT
         DS    0F
@CF00463 DC    F'28'
@DATD    DSECT
         DS    0D
EPATH    DS    CL52
         ORG   EPATH
EPAVSAM  DS    CL52
         ORG   EPAVSAM
EPAOWKA  DS    AL4
EPAVWKA  DS    AL4
         ORG   EPAVWKA
EPATMWKA DS    AL4
         ORG   EPATMWKA
EPASWKA  DS    AL4
         ORG   EPAVSAM+8
EPAAASP  DS    AL4
         ORG   EPAAASP
EPADSLST DS    AL4
         ORG   EPAVSAM+12
EPABASP  DS    AL4
         ORG   EPABASP
EPATMIBA DS    AL4
         ORG   EPAVSAM+16
EPARASP  DS    AL4
         ORG   EPARASP
EPATMACB DS    AL4
         ORG   EPAVSAM+20
EPARTYRG DS    AL4
         ORG   EPARTYRG
EPABKSLT DS    FL4
         ORG   EPABKSLT
EPATMISV DS    AL4
         ORG   EPAVSAM+24
EPAFLAG1 DS    BL1
         ORG   EPAFLAG1
EPAVSAMI DS    BL1
EPAGRPOP EQU   EPAFLAG1+0
         ORG   EPAGRPOP
EPARLG   EQU   EPAGRPOP+0
EPASAVE  EQU   EPAGRPOP+0
EPAACT   EQU   EPAGRPOP+0
         ORG   EPAFLAG1+0
EPAACASR EQU   EPAFLAG1+0
EPAASGN  EQU   EPAFLAG1+0
EPAUNSAV EQU   EPAFLAG1+0
EPARPLB  EQU   EPAFLAG1+0
         ORG   EPAVSAM+25
EPAFLAG2 DS    BL1
         ORG   EPAFLAG2
EPATMXIT DS    BL1
EPAWARM  EQU   EPAFLAG2+0
EPACOLD  EQU   EPAFLAG2+0
EPABUILD EQU   EPAFLAG2+0
EPAMAST  EQU   EPAFLAG2+0
EPATMI   EQU   EPAFLAG2+0
EPARECUR EQU   EPAFLAG2+0
@NM00021 EQU   EPAFLAG2+0
         ORG   EPAVSAM+26
EPALSIZE DS    FL2
EPALGVTP DS    AL4
EPALGEP  DS    AL4
EPASRB   DS    AL4
EPAACE   DS    AL4
EPARBASP DS    AL4
EPARSIZE DS    FL2
@NM00022 DS    FL2
         ORG   EPATH+52
SAVAREA  DS    CL72
SAVAREA1 DS    CL72
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA
@ENDDATD EQU   *
ILRSRBC  CSECT
         NOPR  ((@ENDDATD-@DATD)/257*16)
         DS    0F
@SIZDATD DC    AL1(0)
         DC    AL3(@ENDDATD-@DATD)
@CV01751 DC    V(ILRSRB01)
@CV01752 DC    V(ILRTRANS)
@CV01753 DC    V(ILRESTRT)
         DS    0D
@00      EQU   00                      EQUATES FOR REGISTERS 0-15
@01      EQU   01
@02      EQU   02
@03      EQU   03
@04      EQU   04
@05      EQU   05
@06      EQU   06
@07      EQU   07
@08      EQU   08
@09      EQU   09
@10      EQU   10
@11      EQU   11
@12      EQU   12
@13      EQU   13
@14      EQU   14
@15      EQU   15
R4SAVE   EQU   @10
ACEPTR   EQU   @07
AIAPTR   EQU   @07
RSMHDPTR EQU   @02
ASMVTPTR EQU   @03
ATAPTR   EQU   @04
LGEPTR   EQU   @05
PARTPTR  EQU   @10
SRBPTR   EQU   @08
R6BASE   EQU   @06
WKSAV@   EQU   @09
NXTAIACE EQU   @08
R0       EQU   @00
R1       EQU   @01
R4       EQU   @04
R10      EQU   @10
R11      EQU   @11
R12      EQU   @12
R13      EQU   @13
R14      EQU   @14
R15      EQU   @15
R2       EQU   @02
R3       EQU   @03
R5       EQU   @05
R6       EQU   @06
R7       EQU   @07
R8       EQU   @08
R9       EQU   @09
PSA      EQU   0
FLCRNPSW EQU   PSA
FLCROPSW EQU   PSA+8
FLCICCW2 EQU   PSA+16
FLCCVT   EQU   FLCICCW2
PSAEEPSW EQU   PSA+132
PSAESPSW EQU   PSA+136
FLCSVILC EQU   PSAESPSW+1
PSAEPPSW EQU   PSA+140
FLCPIILC EQU   PSAEPPSW+1
FLCPICOD EQU   PSAEPPSW+2
PSAPICOD EQU   FLCPICOD+1
FLCTEA   EQU   PSAEPPSW+4
FLCPER   EQU   PSA+152
FLCMCLA  EQU   PSA+168
FLCIOEL  EQU   FLCMCLA+4
FLCIOA   EQU   FLCMCLA+16
FLCFSA   EQU   FLCMCLA+80
PSASUPER EQU   PSA+552
PSASUP1  EQU   PSASUPER
PSASUP2  EQU   PSASUPER+1
PSASUP3  EQU   PSASUPER+2
PSASUP4  EQU   PSASUPER+3
PSACLHT  EQU   PSA+640
PSALKSA  EQU   PSA+696
PSAHLHI  EQU   PSA+760
PSADSSFL EQU   PSA+836
PSADSSF1 EQU   PSADSSFL
PSADSSF3 EQU   PSADSSFL+2
PSADSSF4 EQU   PSADSSFL+3
PSARSVT  EQU   PSA+896
ACE      EQU   0
ACEFQPA  EQU   ACE
ACEBQPA  EQU   ACE+4
ACEOP    EQU   ACE+8
ACEFLG1  EQU   ACE+9
ACETRPWT EQU   ACEFLG1
ACEOVRID EQU   ACEFLG1
ACEFLG3  EQU   ACE+11
ACEGRPRQ EQU   ACEFLG3
ACEPRINO EQU   ACEFLG3
ACELGE   EQU   ACE+12
ACELGN   EQU   ACE+16
ACERPN   EQU   ACELGN+4
ACETLPME EQU   ACERPN
ACESYM   EQU   ACE+24
ACESRCID EQU   ACESYM
ACEECB   EQU   ACE+32
ACESRBWK EQU   ACE+36
AIA      EQU   0
AIAFQPA  EQU   AIA
AIAFLG1  EQU   AIA+9
AIAFLG2  EQU   AIA+10
AIAERROR EQU   AIAFLG2
AIAFLG3  EQU   AIA+11
AIAPRINO EQU   AIAFLG3
AIALPMEC EQU   AIAFLG3
AIANXAIA EQU   AIA+12
AIAID    EQU   AIA+16
AIALPID  EQU   AIAID
AIALGID  EQU   AIALPID
AIALSID  EQU   AIALGID
AIASSID  EQU   AIALSID+1
AIARPN   EQU   AIALPID+4
AIALSID2 EQU   AIARPN
AIALPMEP EQU   AIALSID2
AIAGRPSZ EQU   AIA+24
AIALGE   EQU   AIAGRPSZ
ASCB     EQU   0
ASCBSUPC EQU   ASCB+16
ASCBRSM  EQU   ASCB+52
ASCBFW1  EQU   ASCB+100
ASCBRCTF EQU   ASCBFW1+2
ASCBFLG1 EQU   ASCBFW1+3
ASCBDSP1 EQU   ASCB+114
ASCBFLG2 EQU   ASCB+115
ASCBLKGP EQU   ASCB+128
ASCBSRQ  EQU   ASCB+180
ASCBSRQ1 EQU   ASCBSRQ
ASCBSRQ2 EQU   ASCBSRQ+1
ASCBSRQ3 EQU   ASCBSRQ+2
ASCBSRQ4 EQU   ASCBSRQ+3
ASCBPTR  EQU   0
RSMHD    EQU   0
RSMFLG1  EQU   RSMHD+12
RSMQS    EQU   RSMHD+20
RSMLFQ   EQU   RSMQS
RSMLSQA  EQU   RSMQS+4
RSMLIOQ  EQU   RSMQS+8
RSMASMHD EQU   RSMHD+40
ASMVT    EQU   0
ASMFLAG1 EQU   ASMVT
ASMFLAG2 EQU   ASMVT+1
ASMPART  EQU   ASMVT+8
ASMSTAGQ EQU   ASMVT+32
ASMPCCWQ EQU   ASMVT+64
ASMLSAI  EQU   ASMVT+144
ASMGOSQS EQU   ASMVT+152
ASMPEX   EQU   ASMVT+224
ASMPRLG  EQU   ASMVT+252
ASMBWKPC EQU   ASMVT+312
ASMACEPC EQU   ASMVT+344
ASMWKSA1 EQU   ASMVT+368
ASMWKSA2 EQU   ASMVT+448
ASMWKSA3 EQU   ASMVT+528
ASMWKSA4 EQU   ASMVT+608
ASMWKSA5 EQU   ASMVT+688
ASMPOOLS EQU   0
ASMCPAVQ EQU   ASMPOOLS+8
ASMCPAVL EQU   ASMCPAVQ
ASMCPRSQ EQU   ASMPOOLS+16
ASPCT    EQU   0
ASPHDR   EQU   ASPCT
ASPBKEY  EQU   ASPHDR+8
ASPFLAG  EQU   ASPHDR+28
ASPCTPTR EQU   0
ASPEXTSN EQU   0
ASPEHDR  EQU   ASPEXTSN
ASPEXKEY EQU   ASPEHDR+8
ASPSECTA EQU   ASPEXTSN+64
ASPEXPTR EQU   0
ASPLPME  EQU   0
ASPLPFLG EQU   ASPLPME
ASPLOPIN EQU   ASPLPFLG
ASPVLSID EQU   ASPLPME+1
LPMEPTR  EQU   0
ATA      EQU   0
ATAMODID EQU   ATA
ATASFLGS EQU   ATA+1
ATARFLGS EQU   ATA+4
ATARCRSN EQU   ATA+6
ATARCODE EQU   ATA+7
ATACLEAR EQU   ATA+8
ATAAIAQ  EQU   ATACLEAR+4
ATAACEQ  EQU   ATACLEAR+8
ATAEPATH EQU   ATACLEAR+12
CVTMAP   EQU   0
CVTDAR   EQU   CVTMAP+72
CVTFLGS1 EQU   CVTDAR
CVTDCB   EQU   CVTMAP+116
CVTIERLC EQU   CVTMAP+144
CVTOPTA  EQU   CVTMAP+182
CVTOPTB  EQU   CVTMAP+183
CVTGTF   EQU   CVTMAP+236
CVTGTFST EQU   CVTGTF
CVTGTFS  EQU   CVTGTFST
CVTSTATE EQU   CVTGTFST
CVTTMODE EQU   CVTGTFST
CVTFORM  EQU   CVTGTFST
CVTAQAVT EQU   CVTMAP+240
CVTTCMFG EQU   CVTAQAVT
CVTVOLM2 EQU   CVTMAP+244
CVTTATA  EQU   CVTVOLM2
CVTTSKS  EQU   CVTTATA
CVTVOLF2 EQU   CVTTSKS
CVTTAT   EQU   CVTTATA+1
CVTATER  EQU   CVTMAP+248
CVTEXT1  EQU   CVTMAP+252
CVTPURG  EQU   CVTMAP+260
CVTQMSG  EQU   CVTMAP+268
CVTDMSR  EQU   CVTMAP+272
CVTRSV37 EQU   CVTDMSR
CVTDMSRF EQU   CVTRSV37
CVTERPV  EQU   CVTMAP+316
CVTINTLA EQU   CVTMAP+320
CVTAPF   EQU   CVTMAP+324
CVTEXT2  EQU   CVTMAP+328
CVTHJES  EQU   CVTMAP+332
CVTPGSIA EQU   CVTMAP+348
CVTA1F1  EQU   CVTMAP+356
CVTSYSK  EQU   CVTMAP+357
CVTVOLM1 EQU   CVTMAP+380
CVTVOLF1 EQU   CVTVOLM1
CVTATMCT EQU   CVTMAP+388
CVTXTNT1 EQU   0
CVTXTNT2 EQU   0
CVTDSSV  EQU   CVTXTNT2
CVTFLGBT EQU   CVTXTNT2+5
CVTQID   EQU   CVTXTNT2+24
CVTRV400 EQU   CVTXTNT2+52
CVTRV409 EQU   CVTXTNT2+53
CVTATCVT EQU   CVTXTNT2+64
CVTRV429 EQU   CVTXTNT2+84
CVTRV438 EQU   CVTXTNT2+85
CVTRV457 EQU   CVTXTNT2+112
CVTRV466 EQU   CVTXTNT2+113
CVTFIX   EQU   0
CVTRELNO EQU   CVTFIX+252
FRRS     EQU   0
FRRSHEAD EQU   FRRS
FRRSPTR  EQU   0
FRRSENTR EQU   0
FRRSFLGS EQU   FRRSENTR+4
FRRSFLG1 EQU   FRRSFLGS
FRREPTR  EQU   0
LGE      EQU   0
LGEPROCQ EQU   LGE
LGEPROCF EQU   LGEPROCQ
LGEPROCL EQU   LGEPROCQ+4
LGEFLAG1 EQU   LGE+8
LGEWRKPD EQU   LGEFLAG1
LGEGRINP EQU   LGEFLAG1
LGENEXT  EQU   LGE+16
PART     EQU   0
PARTHDR  EQU   PART
PARTAIAE EQU   PARTHDR+12
PARTTPAR EQU   PARTHDR+24
PARTCOMQ EQU   PARTHDR+48
PARTSPLQ EQU   PARTHDR+56
PARTDUPQ EQU   PARTHDR+64
PARTLOCQ EQU   PARTHDR+72
PARTENT  EQU   0
PARELKUP EQU   PARTENT+4
PARELKFL EQU   PARELKUP
PARETYPE EQU   PARTENT+8
PAREFLG1 EQU   PARTENT+9
PAREPTR  EQU   0
SRBSECT  EQU   0
SRB      EQU   SRBSECT
SRBASCB  EQU   SRB+8
SRBFLC   EQU   SRB+12
ILRRLG   EQU   0
BRENPOST EQU   0
ILRPEX   EQU   0
GMACELL  EQU   0
GMANEXT  EQU   GMACELL
WKAREA   EQU   0
DUMMY    EQU   RSMASMHD
ASMHD    EQU   DUMMY
ASHFLAG1 EQU   ASMHD
ASHFLAG2 EQU   ASMHD+1
ASHSCHED EQU   ASHFLAG2
ASHIOCNT EQU   ASMHD+8
ASHLOCK  EQU   ASMHD+20
ASHLGEQ  EQU   ASMHD+28
ASM1WKSV EQU   ASMWKSA1
ASM1RGSV EQU   ASM1WKSV
ASM1WRKA EQU   ASM1WKSV+60
ASM2WKSV EQU   ASMWKSA2
ASM2WRKA EQU   ASM2WKSV+52
ASM2FLGS EQU   ASM2WRKA+12
ASM3WKSV EQU   ASMWKSA3
ASM4WKSV EQU   ASMWKSA4
ASM4RGSV EQU   ASM4WKSV
ASM5WKSV EQU   ASMWKSA5
ASM5RGSV EQU   ASM5WKSV
ASPASST  EQU   ASPSECTA
CVTPTR   EQU   FLCCVT
CVTS01   EQU   CVTPGSIA
CVTLPDIA EQU   CVTS01+12
CVTDIRST EQU   CVTLPDIA
CVTSLIDA EQU   CVTS01+24
CVTCTLFG EQU   CVTS01+50
CVTSRBRT EQU   CVTS01+100
CVTASMVT EQU   CVTS01+356
CVTRV210 EQU   CVTS01+424
CVTRV219 EQU   CVTS01+425
CVTRV228 EQU   CVTS01+426
CVTRV237 EQU   CVTS01+427
CVTMFRTR EQU   CVTS01+452
CVTRV262 EQU   CVTS01+468
CVTRV271 EQU   CVTS01+469
CVTRV280 EQU   CVTS01+470
CVTRV289 EQU   CVTS01+471
CVT0PT02 EQU   CVTS01+532
CVTGSDA  EQU   CVTS01+600
PSARSVTE EQU   PSARSVT
ASPLPMEE EQU   ASPSECTA
FLC      EQU   PSA
*                                      START UNREFERENCED COMPONENTS
PSARSAV  EQU   PSARSVTE+60
PSARSTK  EQU   PSARSVTE+56
PSAESAV3 EQU   PSARSVTE+52
PSAESTK3 EQU   PSARSVTE+48
PSAESAV2 EQU   PSARSVTE+44
PSAESTK2 EQU   PSARSVTE+40
PSAESAV1 EQU   PSARSVTE+36
PSAESTK1 EQU   PSARSVTE+32
PSAPSAV  EQU   PSARSVTE+28
PSAPSTK  EQU   PSARSVTE+24
PSAMSAV  EQU   PSARSVTE+20
PSAMSTK  EQU   PSARSVTE+16
PSASSAV  EQU   PSARSVTE+12
PSASSTK  EQU   PSARSVTE+8
PSANSTK  EQU   PSARSVTE+4
PSACSTK  EQU   PSARSVTE
CVTRV628 EQU   CVTS01+728
CVTRV627 EQU   CVTS01+724
CVTRV626 EQU   CVTS01+720
CVTRV625 EQU   CVTS01+716
CVTRV624 EQU   CVTS01+712
CVTRV623 EQU   CVTS01+708
CVTRV622 EQU   CVTS01+704
CVTRV621 EQU   CVTS01+700
CVTIHASU EQU   CVTS01+696
CVTSUSP  EQU   CVTS01+692
CVTT6SVC EQU   CVTS01+688
CVTCDAL  EQU   CVTS01+684
CVTTCTL  EQU   CVTS01+680
CVTRSUME EQU   CVTS01+676
CVTJTERM EQU   CVTS01+672
CVTASMRM EQU   CVTS01+668
CVTTCASP EQU   CVTS01+664
CVT0PT03 EQU   CVTS01+660
CVT0PT0E EQU   CVTS01+656
CVTRV609 EQU   CVTS01+652
CVTCGK   EQU   CVTS01+648
CVTRAC   EQU   CVTS01+644
CVTRV606 EQU   CVTS01+640
CVTRV605 EQU   CVTS01+636
CVTRV604 EQU   CVTS01+632
CVTEFF02 EQU   CVTS01+628
CVTCBBR  EQU   CVTS01+624
CVTSSCR  EQU   CVTS01+620
CVTEVENT EQU   CVTS01+616
CVTCRCA  EQU   CVTS01+612
CVTTPIO  EQU   CVTS01+608
CVTADV   EQU   CVTS01+604
CVTGSDAB EQU   CVTGSDA
CVTQV3   EQU   CVTS01+596
CVTQV2   EQU   CVTS01+592
CVTQV1   EQU   CVTS01+588
CVTRPT   EQU   CVTS01+584
CVTSSRB  EQU   CVTS01+580
CVTCSDRL EQU   CVTS01+576
CVTEXP1  EQU   CVTS01+572
CVTRMPMT EQU   CVTS01+568
CVTRMPTT EQU   CVTS01+564
CVTVPSA  EQU   CVTS01+560
CVTVSTOP EQU   CVTS01+556
CVTGTFR8 EQU   CVTS01+552
CVTQUIT  EQU   CVTS01+548
CVTVACR  EQU   CVTS01+544
CVTWTCB  EQU   CVTS01+540
CVTSTPRS EQU   CVTS01+536
CVTDARCM EQU   CVTS01+528
CVTIRECM EQU   CVTS01+524
CVTJRECM EQU   CVTS01+520
CVTVEMS0 EQU   CVTS01+516
CVTSPFRR EQU   CVTS01+512
CVTRLSTG EQU   CVTS01+508
CVT0TC0A EQU   CVTS01+504
CVTGMBR  EQU   CVTS01+500
CVTLFRM  EQU   CVTS01+496
CVTRMBR  EQU   CVTS01+492
CVTVIOP  EQU   CVTS01+488
CVTRV307 EQU   CVTS01+486
CVTRV306 EQU   CVTS01+484
CVTRV305 EQU   CVTS01+482
CVTRV304 EQU   CVTS01+480
CVTRV303 EQU   CVTS01+478
CVTRV302 EQU   CVTS01+476
CVTTRCA  EQU   CVTS01+472
CVTRV297 EQU   CVTRV289
CVTRV296 EQU   CVTRV289
CVTRV295 EQU   CVTRV289
CVTRV294 EQU   CVTRV289
CVTRV293 EQU   CVTRV289
CVTRV292 EQU   CVTRV289
CVTRV291 EQU   CVTRV289
CVTRV290 EQU   CVTRV289
CVTRV288 EQU   CVTRV280
CVTRV287 EQU   CVTRV280
CVTRV286 EQU   CVTRV280
CVTRV285 EQU   CVTRV280
CVTRV284 EQU   CVTRV280
CVTRV283 EQU   CVTRV280
CVTRV282 EQU   CVTRV280
CVTRV281 EQU   CVTRV280
CVTRV279 EQU   CVTRV271
CVTRV278 EQU   CVTRV271
CVTRV277 EQU   CVTRV271
CVTRV276 EQU   CVTRV271
CVTRV275 EQU   CVTRV271
CVTRV274 EQU   CVTRV271
CVTRV273 EQU   CVTRV271
CVTRV272 EQU   CVTRV271
CVTRV270 EQU   CVTRV262
CVTRV269 EQU   CVTRV262
CVTRV268 EQU   CVTRV262
CVTRV267 EQU   CVTRV262
CVTRV266 EQU   CVTRV262
CVTRV265 EQU   CVTRV262
CVTRV264 EQU   CVTRV262
CVTRV263 EQU   CVTRV262
CVTVFP   EQU   CVTS01+464
CVTVSI   EQU   CVTS01+460
CVTVPSIB EQU   CVTS01+456
CVTMFACT EQU   CVTMFRTR
CVTMFCTL EQU   CVTS01+448
CVTPVBP  EQU   CVTS01+444
CVTPWI   EQU   CVTS01+440
CVTRV254 EQU   CVTS01+438
CVTRV253 EQU   CVTS01+436
CVTRV252 EQU   CVTS01+434
CVTRV251 EQU   CVTS01+433
CVTRV250 EQU   CVTS01+432
CVTRV249 EQU   CVTS01+431
CVTRV248 EQU   CVTS01+430
CVTRV247 EQU   CVTS01+429
CVTRV246 EQU   CVTS01+428
CVTRV245 EQU   CVTRV237
CVTRV244 EQU   CVTRV237
CVTRV243 EQU   CVTRV237
CVTRV242 EQU   CVTRV237
CVTRV241 EQU   CVTRV237
CVTRV240 EQU   CVTRV237
CVTRV239 EQU   CVTRV237
CVTRV238 EQU   CVTRV237
CVTRV236 EQU   CVTRV228
CVTRV235 EQU   CVTRV228
CVTRV234 EQU   CVTRV228
CVTRV233 EQU   CVTRV228
CVTRV232 EQU   CVTRV228
CVTRV231 EQU   CVTRV228
CVTRV230 EQU   CVTRV228
CVTRV229 EQU   CVTRV228
CVTRV227 EQU   CVTRV219
CVTRV226 EQU   CVTRV219
CVTRV225 EQU   CVTRV219
CVTRV224 EQU   CVTRV219
CVTRV223 EQU   CVTRV219
CVTRV222 EQU   CVTRV219
CVTRV221 EQU   CVTRV219
CVTRV220 EQU   CVTRV219
CVTRV218 EQU   CVTRV210
CVTRV217 EQU   CVTRV210
CVTRV216 EQU   CVTRV210
CVTRV215 EQU   CVTRV210
CVTRV214 EQU   CVTRV210
CVTRV213 EQU   CVTRV210
CVTRV212 EQU   CVTRV210
CVTRV211 EQU   CVTRV210
CVTLCCAT EQU   CVTS01+420
CVTPCCAT EQU   CVTS01+416
CVTIPCRP EQU   CVTS01+412
CVTIPCRI EQU   CVTS01+408
CVTIPCDS EQU   CVTS01+404
CVTAIDVT EQU   CVTS01+400
CVTSSAP  EQU   CVTS01+396
CVTEHCIR EQU   CVTS01+392
CVTEHDEF EQU   CVTS01+388
CVTDAIR  EQU   CVTS01+384
CVTPERFM EQU   CVTS01+380
CVT044R2 EQU   CVTS01+376
CVTFETCH EQU   CVTS01+372
CVTRSTWD EQU   CVTS01+368
CVTSPOST EQU   CVTS01+364
CVTIOBP  EQU   CVTS01+360
CVTRECRQ EQU   CVTS01+352
CVTWSAC  EQU   CVTS01+348
CVTRV149 EQU   CVTS01+344
CVTWSAL  EQU   CVTS01+340
CVTSPSA  EQU   CVTS01+336
CVTGLMN  EQU   CVTS01+332
CVTVEAC0 EQU   CVTS01+328
CVT062R1 EQU   CVTS01+324
CVTRPOST EQU   CVTS01+320
CVTDQIQE EQU   CVTS01+316
CVTCSD   EQU   CVTS01+312
CVTLKRMA EQU   CVTS01+308
CVTRSPIE EQU   CVTS01+304
CVTRENQ  EQU   CVTS01+300
CVTLQCB  EQU   CVTS01+296
CVTFQCB  EQU   CVTS01+292
CVTQCS01 EQU   CVTS01+288
CVTAPFT  EQU   CVTS01+284
CVTPARRL EQU   CVTS01+280
CVTVWAIT EQU   CVTS01+276
CVTGSPL  EQU   CVTS01+272
CVTLSMQ  EQU   CVTS01+268
CVTGSMQ  EQU   CVTS01+264
CVTEXPRO EQU   CVTS01+260
CVTOPCTP EQU   CVTS01+256
CVTSIC   EQU   CVTS01+252
CVTTPIOS EQU   CVTS01+248
CVTRTMS  EQU   CVTS01+244
CVTSDBF  EQU   CVTS01+240
CVTSCBP  EQU   CVTS01+236
CVTSDMP  EQU   CVTS01+232
CVTSV60  EQU   CVTS01+228
CVTRTMCT EQU   CVTS01+224
CVTASCBL EQU   CVTS01+220
CVTASCBH EQU   CVTS01+216
CVTGDA   EQU   CVTS01+212
CVTASVT  EQU   CVTS01+208
CVTVVMDI EQU   CVTS01+204
CVTAQTOP EQU   CVTS01+200
CVTIOSCS EQU   CVTS01+196
CVTSDRM  EQU   CVTS01+192
CVTOPTE  EQU   CVTS01+188
CVTSTXU  EQU   CVTS01+184
CVTQUIS  EQU   CVTS01+180
CVTPARS  EQU   CVTS01+176
CVTS1EE  EQU   CVTS01+172
CVTFRAS  EQU   CVTS01+168
CVTQSAS  EQU   CVTS01+164
CVTCRAS  EQU   CVTS01+160
CVTCRMN  EQU   CVTS01+156
CVTDELCP EQU   CVTS01+152
CVTFRECL EQU   CVTS01+148
CVTGETCL EQU   CVTS01+144
CVTBLDCP EQU   CVTS01+140
CVTAUTHL EQU   CVTS01+136
CVTSCAN  EQU   CVTS01+132
CVTRV144 EQU   CVTS01+130
CVTMAXMP EQU   CVTS01+128
CVTSTCK  EQU   CVTS01+124
CVTRV139 EQU   CVTS01+123
CVTDSSAC EQU   CVTS01+122
CVTRV513 EQU   CVTS01+121
CVTIOSPL EQU   CVTS01+120
CVTPTGT  EQU   CVTS01+116
CVTCSPIE EQU   CVTS01+112
CVTSMFEX EQU   CVTS01+108
CVTOLT0A EQU   CVTS01+104
CVTPUTL  EQU   CVTS01+96
CVTASCRL EQU   CVTS01+92
CVTASCRF EQU   CVTS01+88
CVTRV326 EQU   CVTS01+84
CVTRV325 EQU   CVTS01+80
CVTRV324 EQU   CVTS01+76
CVT0VL01 EQU   CVTS01+72
CVTSHRVM EQU   CVTS01+68
CVTRV332 EQU   CVTS01+64
CVTTAS   EQU   CVTS01+60
CVTRSCN  EQU   CVTS01+56
CVTTRAC2 EQU   CVTS01+54
CVTTRACE EQU   CVTS01+52
CVTAPG   EQU   CVTS01+51
CVTSDTRC EQU   CVTCTLFG
CVTGTRCE EQU   CVTCTLFG
CVTNOMP  EQU   CVTCTLFG
CVTRSV79 EQU   CVTCTLFG
CVTDSTAT EQU   CVTCTLFG
CVTRSV78 EQU   CVTCTLFG
CVTRV333 EQU   CVTCTLFG
CVTRV323 EQU   CVTCTLFG
CVTSPVLK EQU   CVTS01+49
CVTRSV77 EQU   CVTS01+48
CVTRV331 EQU   CVTS01+44
CVTRV330 EQU   CVTS01+40
CVTRV329 EQU   CVTS01+36
CVTRV328 EQU   CVTS01+32
CVTRV322 EQU   CVTS01+28
CVTSLID  EQU   CVTSLIDA+1
CVTSYLK  EQU   CVTSLIDA
CVTRV321 EQU   CVTS01+20
CVTRV320 EQU   CVTS01+16
CVTLPDIR EQU   CVTLPDIA+1
CVTRSV69 EQU   CVTDIRST
CVTRSV68 EQU   CVTDIRST
CVTRSV67 EQU   CVTDIRST
CVTRSV66 EQU   CVTDIRST
CVTRSV65 EQU   CVTDIRST
CVTRSV64 EQU   CVTDIRST
CVTRSV63 EQU   CVTDIRST
CVTDICOM EQU   CVTDIRST
CVTPVTP  EQU   CVTS01+8
CVTLPDSR EQU   CVTS01+4
CVTGETL  EQU   CVTS01
ASPASSTE EQU   ASPASST
ASM5FLGS EQU   ASM5WKSV+64
ASM5AIA  EQU   ASM5WKSV+60
ASM5GCTR EQU   ASM5WKSV+56
ASM5SR14 EQU   ASM5WKSV+52
@NM00009 EQU   ASM5RGSV+4
ASM5RG2  EQU   ASM5RGSV
@NM00008 EQU   ASM4RGSV+4
ASM4RG2  EQU   ASM4RGSV
ASM3SR13 EQU   ASM3WKSV+28
ASM3R14B EQU   ASM3WKSV+24
ASM3R14A EQU   ASM3WKSV+20
ASM3GRPA EQU   ASM3WKSV+16
ASM3TMPA EQU   ASM3WKSV+12
ASM3PIOP EQU   ASM3WKSV+8
ASM3GENQ EQU   ASM3WKSV+4
ASM3SWPQ EQU   ASM3WKSV
ASM2SR14 EQU   ASM2WRKA+16
@NM00007 EQU   ASM2WRKA+13
ASM2WFLG EQU   ASM2FLGS
ASM2RFLG EQU   ASM2FLGS
ASM2DUPQ EQU   ASM2WRKA+8
ASM2CAQ  EQU   ASM2WRKA+4
ASM2PAQ  EQU   ASM2WRKA
ASM2RGSV EQU   ASM2WKSV
ASM1NXTA EQU   ASM1WRKA+4
ASM1ASCB EQU   ASM1WRKA
ASM1RG15 EQU   ASM1RGSV+56
@NM00006 EQU   ASM1RGSV+4
ASM1RG1  EQU   ASM1RGSV
ASHVSRBP EQU   ASMHD+24
ASHCAPQ  EQU   ASMHD+16
ASHSWAPQ EQU   ASMHD+12
ASHBKSLT EQU   ASMHD+4
ASHSWPCT EQU   ASMHD+2
ASHRSV12 EQU   ASHFLAG2
ASHRSV11 EQU   ASHFLAG2
ASHRSV10 EQU   ASHFLAG2
ASHRSV9  EQU   ASHFLAG2
ASHRSV8  EQU   ASHFLAG2
ASHRSV7  EQU   ASHFLAG2
ASHRSV13 EQU   ASHFLAG2
ASHRSV6  EQU   ASHFLAG1
ASHRSV5  EQU   ASHFLAG1
ASHRSV4  EQU   ASHFLAG1
ASHRSV3  EQU   ASHFLAG1
ASHRSV2  EQU   ASHFLAG1
ASHPERME EQU   ASHFLAG1
ASHCAPER EQU   ASHFLAG1
ASHSWPOT EQU   ASHFLAG1
@NM00057 EQU   SRB+40
@NM00056 EQU   SRB+38
SRBPRIOR EQU   SRB+37
SRBPKF   EQU   SRB+36
SRBSAVE  EQU   SRB+32
SRBPARM  EQU   SRB+28
SRBRMTR  EQU   SRB+24
SRBEP    EQU   SRB+20
SRBPTCB  EQU   SRBFLC+4
SRBPASID EQU   SRBFLC+2
SRBCPAFF EQU   SRBFLC
SRBFLNK  EQU   SRB+4
SRBID    EQU   SRB
@NM00031 EQU   PARTENT+62
PARELCYL EQU   PARTENT+60
PARERQTM EQU   PARTENT+56
PAREWTQE EQU   PARTENT+52
PARENODE EQU   PARTENT+48
PAREUCBP EQU   PARTENT+44
PAREEDBP EQU   PARTENT+40
PAREPCTP EQU   PARTENT+36
PAREPATP EQU   PARTENT+32
PAREIORB EQU   PARTENT+28
PARERRCT EQU   PARTENT+24
PARESLTA EQU   PARTENT+20
PARESZSL EQU   PARTENT+16
PAREIOEQ EQU   PARTENT+12
PARENN   EQU   PARTENT+10
@NM00030 EQU   PAREFLG1
PAREINCP EQU   PAREFLG1
PAREDSBD EQU   PAREFLG1
PARENUSE EQU   PAREFLG1
@NM00029 EQU   PARETYPE
PARELOCL EQU   PARETYPE
PAREDPLX EQU   PARETYPE
PARECOMM EQU   PARETYPE
PAREPLPA EQU   PARETYPE
PARECPCT EQU   PARELKUP+2
PAREIORN EQU   PARELKUP+1
@NM00028 EQU   PARELKFL
PAREFSIP EQU   PARELKFL
PAREPARE EQU   PARTENT
PARTENTS EQU   PART+80
PARTLOCL EQU   PARTLOCQ+4
PARTLOCF EQU   PARTLOCQ
PARTDUPL EQU   PARTDUPQ+4
PARTDUPF EQU   PARTDUPQ
PARTSPLL EQU   PARTSPLQ+4
PARTSPLF EQU   PARTSPLQ
PARTCOML EQU   PARTCOMQ+4
PARTCOMF EQU   PARTCOMQ
PARTLOCK EQU   PARTHDR+44
PARTLKUP EQU   PARTHDR+40
@NM00027 EQU   PARTHDR+34
PARTLCNT EQU   PARTHDR+32
PARTPCTQ EQU   PARTHDR+28
PARTDSNL EQU   PARTTPAR
PARTCIR2 EQU   PARTHDR+20
PARTCIR1 EQU   PARTHDR+16
PARTEUSE EQU   PARTHDR+8
PARTSIZE EQU   PARTHDR+4
PARTIDEN EQU   PARTHDR
@NM00026 EQU   LGE+24
LGELGID  EQU   LGE+20
LGEASPCT EQU   LGE+12
LGESLTCT EQU   LGE+10
@NM00025 EQU   LGE+9
LGERSV5  EQU   LGEFLAG1
LGERSV4  EQU   LGEFLAG1
LGERSV3  EQU   LGEFLAG1
LGERSV2  EQU   LGEFLAG1
LGESAVRQ EQU   LGEFLAG1
LGERELLG EQU   LGEFLAG1
FRRSPARM EQU   FRRSENTR+8
@NM00024 EQU   FRRSFLGS+1
@NM00023 EQU   FRRSFLG1
FRRSNEST EQU   FRRSFLG1
FRRSRCUR EQU   FRRSFLG1
FRRSFRRA EQU   FRRSENTR
FRRSENTS EQU   FRRS+84
FRRSRTMW EQU   FRRS+16
FRRSCURR EQU   FRRSHEAD+12
FRRSELEN EQU   FRRSHEAD+8
FRRSLAST EQU   FRRSHEAD+4
FRRSEMP  EQU   FRRSHEAD
CVTLEVL  EQU   CVTRELNO+2
CVTNUMB  EQU   CVTRELNO
CVTMDL   EQU   CVTFIX+250
@NM00020 EQU   CVTFIX+248
@NM00019 EQU   CVTFIX
CVTRV482 EQU   CVTXTNT2+128
CVTRV481 EQU   CVTXTNT2+124
CVTRV480 EQU   CVTXTNT2+120
CVTRV479 EQU   CVTXTNT2+118
CVTRV478 EQU   CVTXTNT2+117
CVTRV477 EQU   CVTXTNT2+116
CVTRV476 EQU   CVTXTNT2+115
CVTRV475 EQU   CVTXTNT2+114
CVTRV474 EQU   CVTRV466
CVTRV473 EQU   CVTRV466
CVTRV472 EQU   CVTRV466
CVTRV471 EQU   CVTRV466
CVTRV470 EQU   CVTRV466
CVTRV469 EQU   CVTRV466
CVTRV468 EQU   CVTRV466
CVTRV467 EQU   CVTRV466
CVTRV465 EQU   CVTRV457
CVTRV464 EQU   CVTRV457
CVTRV463 EQU   CVTRV457
CVTRV462 EQU   CVTRV457
CVTRV461 EQU   CVTRV457
CVTRV460 EQU   CVTRV457
CVTRV459 EQU   CVTRV457
CVTRV458 EQU   CVTRV457
CVTRV456 EQU   CVTXTNT2+108
CVTRV455 EQU   CVTXTNT2+104
CVTRV454 EQU   CVTXTNT2+100
CVTRV453 EQU   CVTXTNT2+96
CVTRV452 EQU   CVTXTNT2+94
CVTRV451 EQU   CVTXTNT2+92
CVTRV450 EQU   CVTXTNT2+90
CVTRV449 EQU   CVTXTNT2+88
CVTRV448 EQU   CVTXTNT2+87
CVTRV447 EQU   CVTXTNT2+86
CVTRV446 EQU   CVTRV438
CVTRV445 EQU   CVTRV438
CVTRV444 EQU   CVTRV438
CVTRV443 EQU   CVTRV438
CVTRV442 EQU   CVTRV438
CVTRV441 EQU   CVTRV438
CVTRV440 EQU   CVTRV438
CVTRV439 EQU   CVTRV438
CVTRV437 EQU   CVTRV429
CVTRV436 EQU   CVTRV429
CVTRV435 EQU   CVTRV429
CVTRV434 EQU   CVTRV429
CVTRV433 EQU   CVTRV429
CVTRV432 EQU   CVTRV429
CVTRV431 EQU   CVTRV429
CVTRV430 EQU   CVTRV429
CVTRV428 EQU   CVTXTNT2+80
CVTRV427 EQU   CVTXTNT2+76
CVTRV426 EQU   CVTXTNT2+72
CVTRV425 EQU   CVTXTNT2+68
CVTATACT EQU   CVTATCVT
CVTRV423 EQU   CVTXTNT2+62
CVTRV422 EQU   CVTXTNT2+60
CVTRV421 EQU   CVTXTNT2+58
CVTRV420 EQU   CVTXTNT2+56
CVTRV419 EQU   CVTXTNT2+55
CVTRV418 EQU   CVTXTNT2+54
CVTRV417 EQU   CVTRV409
CVTRV416 EQU   CVTRV409
CVTRV415 EQU   CVTRV409
CVTRV414 EQU   CVTRV409
CVTRV413 EQU   CVTRV409
CVTRV412 EQU   CVTRV409
CVTRV411 EQU   CVTRV409
CVTRV410 EQU   CVTRV409
CVTRV408 EQU   CVTRV400
CVTRV407 EQU   CVTRV400
CVTRV406 EQU   CVTRV400
CVTRV405 EQU   CVTRV400
CVTRV404 EQU   CVTRV400
CVTRV403 EQU   CVTRV400
CVTRV402 EQU   CVTRV400
CVTRV401 EQU   CVTRV400
CVTICB   EQU   CVTXTNT2+48
CVTSKTA  EQU   CVTXTNT2+44
CVTRSV99 EQU   CVTXTNT2+40
CVTRSV98 EQU   CVTXTNT2+36
CVTRSV97 EQU   CVTXTNT2+34
CVTRSV96 EQU   CVTXTNT2+32
CVTOLTEP EQU   CVTXTNT2+28
CVTQIDA  EQU   CVTQID+1
CVTRSV95 EQU   CVTQID
CVTRSV94 EQU   CVTXTNT2+20
CVTRSV93 EQU   CVTXTNT2+16
CVTRSV92 EQU   CVTXTNT2+12
CVTDEBVR EQU   CVTXTNT2+8
CVTRSV91 EQU   CVTXTNT2+6
CVTRSV9H EQU   CVTFLGBT
CVTRSV9G EQU   CVTFLGBT
CVTRSV9F EQU   CVTFLGBT
CVTRSV9E EQU   CVTFLGBT
CVTRSV9D EQU   CVTFLGBT
CVTRSV9C EQU   CVTFLGBT
CVTVME   EQU   CVTFLGBT
CVTNPE   EQU   CVTFLGBT
CVTNUCLS EQU   CVTXTNT2+4
CVTDSSVA EQU   CVTDSSV+1
CVTRSV89 EQU   CVTDSSV
CVTRSV88 EQU   CVTXTNT1+8
CVTRSV87 EQU   CVTXTNT1+4
CVTFACHN EQU   CVTXTNT1
CVTRV488 EQU   CVTMAP+412
CVTRV487 EQU   CVTMAP+408
CVTRV486 EQU   CVTMAP+404
CVTRV485 EQU   CVTMAP+400
CVTACTAP EQU   CVTMAP+396
CVTAUTH  EQU   CVTMAP+392
CVTATMCA EQU   CVTATMCT+1
CVTATMST EQU   CVTATMCT
CVTRSV61 EQU   CVTMAP+384
CVTVOLT1 EQU   CVTVOLM1+1
CVTVOLI1 EQU   CVTVOLF1
CVTSTOA  EQU   CVTMAP+376
CVTRSV58 EQU   CVTMAP+374
CVTRSV57 EQU   CVTMAP+372
CVTDDCE  EQU   CVTMAP+368
CVTPNWFR EQU   CVTMAP+364
CVTSMF   EQU   CVTMAP+360
CVTSULK  EQU   CVTMAP+358
CVTSLKO  EQU   CVTSYSK
CVTSLKP  EQU   CVTSYSK
CVTSLKQ  EQU   CVTSYSK
CVTSLKR  EQU   CVTSYSK
CVTRSV56 EQU   CVTSYSK
CVTRSV55 EQU   CVTSYSK
CVTRSV54 EQU   CVTSYSK
CVTRSV53 EQU   CVTSYSK
CVTRSV52 EQU   CVTA1F1
CVTRSV51 EQU   CVTA1F1
CVTRSV50 EQU   CVTA1F1
CVTRSV49 EQU   CVTA1F1
CVTRSV48 EQU   CVTA1F1
CVTRSV47 EQU   CVTA1F1
CVTSRSW  EQU   CVTA1F1
CVTPFSW  EQU   CVTA1F1
CVTPCVT  EQU   CVTMAP+352
CVTRSV46 EQU   CVTMAP+344
CVTRSV45 EQU   CVTMAP+340
CVTRSV44 EQU   CVTMAP+338
CVTRSV43 EQU   CVTMAP+336
CVTHJESA EQU   CVTHJES+1
CVTRSV42 EQU   CVTHJES
CVTEXT2A EQU   CVTEXT2+1
CVTRSV41 EQU   CVTEXT2
CVTAPFA  EQU   CVTAPF+1
CVTRSV40 EQU   CVTAPF
CVTRV518 EQU   CVTINTLA
CVTRV517 EQU   CVTERPV
CVTEORM  EQU   CVTMAP+312
CVTMCHPR EQU   CVTMAP+308
CVTTZ    EQU   CVTMAP+304
CVTJEPS  EQU   CVTMAP+300
CVTJESCT EQU   CVTMAP+296
CVTMODE  EQU   CVTMAP+292
CVTPTRV  EQU   CVTMAP+288
CVTREAL  EQU   CVTMAP+284
CVTRSV39 EQU   CVTMAP+280
CVTRSV38 EQU   CVTMAP+276
CVTDMSRA EQU   CVTDMSR+1
CVTRV634 EQU   CVTDMSRF
CVTRV633 EQU   CVTDMSRF
CVTRV632 EQU   CVTDMSRF
CVTRV631 EQU   CVTDMSRF
CVTRV630 EQU   CVTDMSRF
CVTRV629 EQU   CVTDMSRF
CVTUDUMP EQU   CVTDMSRF
CVTSDUMP EQU   CVTDMSRF
CVTQMSGA EQU   CVTQMSG+1
CVTRSV36 EQU   CVTQMSG
CVTAMFF  EQU   CVTMAP+264
CVTPURGA EQU   CVTPURG+1
CVTRSV35 EQU   CVTPURG
CVTCBSP  EQU   CVTMAP+256
CVTATERA EQU   CVTATER+1
CVTSYST  EQU   CVTATER
CVTVOLT2 EQU   CVTTAT
CVTVOLI2 EQU   CVTVOLF2
CVTAQAVB EQU   CVTAQAVT+1
CVTRSV34 EQU   CVTTCMFG
CVTRSV33 EQU   CVTTCMFG
CVTRSV32 EQU   CVTTCMFG
CVTRSV31 EQU   CVTTCMFG
CVTRSV30 EQU   CVTTCMFG
CVTRSV29 EQU   CVTTCMFG
CVTLDEV  EQU   CVTTCMFG
CVTTCRDY EQU   CVTTCMFG
CVTGTFA  EQU   CVTGTF+1
CVTRSV27 EQU   CVTGTFST
CVTRNIO  EQU   CVTGTFST
CVTUSR   EQU   CVTGTFST
CVTRV318 EQU   CVTFORM
CVTRV317 EQU   CVTTMODE
CVTRV316 EQU   CVTSTATE
CVTRV315 EQU   CVTGTFS
CVTGTFAV EQU   CVTGTFS
CVT0SCR1 EQU   CVTMAP+232
CVTRV515 EQU   CVTMAP+228
CVTRMS   EQU   CVTMAP+224
CVTPATCH EQU   CVTMAP+220
CVTTSCE  EQU   CVTMAP+216
CVTLNKSC EQU   CVTMAP+214
CVTQABST EQU   CVTMAP+212
CVTMDLDS EQU   CVTMAP+208
CVTUSER  EQU   CVTMAP+204
CVTABEND EQU   CVTMAP+200
CVTSMCA  EQU   CVTMAP+196
CVTRSV18 EQU   CVTMAP+192
CVTQLPAQ EQU   CVTMAP+188
CVTQCDSR EQU   CVTMAP+184
CVTRSV17 EQU   CVTOPTB
CVTRSV16 EQU   CVTOPTB
CVTFP    EQU   CVTOPTB
CVTAPTHR EQU   CVTOPTB
CVTNLOG  EQU   CVTOPTB
CVTTOD   EQU   CVTOPTB
CVTCTIMS EQU   CVTOPTB
CVTPROT  EQU   CVTOPTB
CVTXPFP  EQU   CVTOPTA
CVTASCII EQU   CVTOPTA
CVTRSV13 EQU   CVTOPTA
CVTRSV12 EQU   CVTOPTA
CVTNIP   EQU   CVTOPTA
CVTDDR   EQU   CVTOPTA
CVTAPR   EQU   CVTOPTA
CVTCCH   EQU   CVTOPTA
CVTSNCTR EQU   CVTMAP+180
CVTQMWR  EQU   CVTMAP+176
CVTQOCR  EQU   CVTMAP+172
CVT1EF00 EQU   CVTMAP+168
CVTMZ00  EQU   CVTMAP+164
CVTHEAD  EQU   CVTMAP+160
CVTRSV11 EQU   CVTMAP+156
CVT0PT01 EQU   CVTMAP+152
CVTMSER  EQU   CVTMAP+148
CVTRV516 EQU   CVTIERLC
CVTILCH  EQU   CVTMAP+140
CVT0DS   EQU   CVTMAP+136
CVTFBOSV EQU   CVTMAP+132
CVTNUCB  EQU   CVTMAP+128
CVTIXAVL EQU   CVTMAP+124
CVTIOQET EQU   CVTMAP+120
CVTDCBA  EQU   CVTMAP+117
CVTMVS2  EQU   CVTDCB
CVT6DAT  EQU   CVTDCB
CVT4MPS  EQU   CVTDCB
CVTRSV09 EQU   CVTDCB
CVT4MS1  EQU   CVTDCB
CVT2SPS  EQU   CVTDCB
CVT1SSS  EQU   CVTDCB
CVTRSV08 EQU   CVTDCB
CVTSTB   EQU   CVTMAP+112
CVTQTD00 EQU   CVTMAP+108
CVTQTE00 EQU   CVTMAP+104
CVTCUCB  EQU   CVTMAP+100
CVTSJQ   EQU   CVTMAP+96
CVTPBLDL EQU   CVTMAP+92
CVTTPC   EQU   CVTMAP+88
CVTSVDCB EQU   CVTMAP+84
CVTBRET  EQU   CVTMAP+82
CVTEXIT  EQU   CVTMAP+80
CVT0FN00 EQU   CVTMAP+76
CVTDARA  EQU   CVTDAR+1
CVTRSV07 EQU   CVTFLGS1
CVTRSV06 EQU   CVTFLGS1
CVTRSV05 EQU   CVTFLGS1
CVTRSV04 EQU   CVTFLGS1
CVTRSV03 EQU   CVTFLGS1
CVTRSV02 EQU   CVTFLGS1
CVTRSV01 EQU   CVTFLGS1
CVTDMPLK EQU   CVTFLGS1
CVTXITP  EQU   CVTMAP+68
CVTZDTAB EQU   CVTMAP+64
CVTMSLT  EQU   CVTMAP+60
CVTDATE  EQU   CVTMAP+56
CVTBTERM EQU   CVTMAP+52
CVTSYSAD EQU   CVTMAP+48
CVTXTLER EQU   CVTMAP+44
CVTILK2  EQU   CVTMAP+40
CVTILK1  EQU   CVTMAP+36
CVTPRLTV EQU   CVTMAP+32
CVTPCNVT EQU   CVTMAP+28
CVT0VL00 EQU   CVTMAP+24
CVTXAPG  EQU   CVTMAP+20
CVTBUF   EQU   CVTMAP+16
CVTJOB   EQU   CVTMAP+12
CVTLINK  EQU   CVTMAP+8
CVT0EF00 EQU   CVTMAP+4
CVTTCBP  EQU   CVTMAP
CVT      EQU   CVTMAP
ATAAIACE EQU   ATACLEAR
ATARCRF8 EQU   ATARCRSN
ATARCRF7 EQU   ATARCRSN
ATARCRF6 EQU   ATARCRSN
ATARCRF5 EQU   ATARCRSN
ATARCRF4 EQU   ATARCRSN
ATARCRF3 EQU   ATARCRSN
ATARCRF2 EQU   ATARCRSN
ATARCRF1 EQU   ATARCRSN
ATARSV2  EQU   ATARFLGS
ATABADPK EQU   ATARFLGS
ATASCCWP EQU   ATARFLGS
ATASGNST EQU   ATARFLGS
ATARSV1  EQU   ATASFLGS+1
ATASRT   EQU   ATASFLGS+1
ATASWPDR EQU   ATASFLGS+1
ATATRPAG EQU   ATASFLGS+1
ATASWAP  EQU   ATASFLGS+1
ATAPAGCM EQU   ATASFLGS
ATAPAGIO EQU   ATASFLGS
ATAPOS   EQU   ATASFLGS
ATAPCOMP EQU   ATASFLGS
ATAVIOCM EQU   ATASFLGS
ATASCOMP EQU   ATASFLGS
ATASLSQA EQU   ATASFLGS
ATAQIOE  EQU   ATASFLGS
ASPSLOT  EQU   ASPVLSID+1
ASPPRTNN EQU   ASPVLSID
@NM00018 EQU   ASPLPFLG
ASPLSVRP EQU   ASPLPFLG
ASPLIOER EQU   ASPLPFLG
ASPLSAVE EQU   ASPLPFLG
ASPLVALD EQU   ASPLPFLG
@NM00017 EQU   ASPEXTSN+1088
@NM00016 EQU   ASPEHDR+24
ASPASSTI EQU   ASPEHDR+22
@NM00015 EQU   ASPEHDR+21
ASPASSTN EQU   ASPEHDR+20
ASPEXTNM EQU   ASPEXKEY+8
ASPESSYM EQU   ASPEXKEY
@NM00014 EQU   ASPEHDR+4
ASPEIDNT EQU   ASPEHDR
@NM00013 EQU   ASPCT+1088
ASPLPMES EQU   ASPCT+64
ASPASSTP EQU   ASPCT+48
ASPAEXCT EQU   ASPHDR+46
ASPLEXCT EQU   ASPHDR+44
ASPSAVCT EQU   ASPHDR+40
ASPBKSLT EQU   ASPHDR+36
ASPMAXPN EQU   ASPHDR+32
@NM00012 EQU   ASPHDR+29
@NM00011 EQU   ASPFLAG
ASPSAVRP EQU   ASPFLAG
ASPSAVED EQU   ASPFLAG
ASPLGE   EQU   ASPHDR+24
ASPASCB  EQU   ASPHDR+20
@NM00010 EQU   ASPBKEY+8
ASPSSYM  EQU   ASPBKEY
ASPLGID  EQU   ASPHDR+4
ASPIDENT EQU   ASPHDR
ASMCPRES EQU   ASMCPRSQ+4
ASMCPTAK EQU   ASMCPRSQ
ASMCPCNT EQU   ASMCPAVQ+4
ASMCPEXT EQU   ASMPOOLS+6
ASMCPSIZ EQU   ASMPOOLS+4
ASMCPID  EQU   ASMPOOLS
ASMRSV12 EQU   ASMVT+1000
ASMSAVE  EQU   ASMVT+928
ASMWKSA7 EQU   ASMVT+848
ASMWKSA6 EQU   ASMVT+768
ASMSWKPC EQU   ASMVT+328
ASMIOEPC EQU   ASMVT+296
ASMRSV10 EQU   ASMVT+280
ASMPVACE EQU   ASMVT+276
ASMPIOFR EQU   ASMVT+272
ASMPVACQ EQU   ASMVT+268
ASMPMSGS EQU   ASMVT+264
ASMPMSG0 EQU   ASMVT+260
ASMPFRLG EQU   ASMVT+256
ASMPACT  EQU   ASMVT+248
ASMPSAV  EQU   ASMVT+244
ASMPCMP  EQU   ASMVT+240
ASMPCMPA EQU   ASMVT+236
ASMPCMPN EQU   ASMVT+232
ASMPCMPD EQU   ASMVT+228
ASMVRMTR EQU   ASMVT+220
ASMPSRBC EQU   ASMVT+216
ASMPSRMT EQU   ASMVT+212
ASMPSWPD EQU   ASMVT+208
ASMPTM   EQU   ASMVT+204
ASMPFRSW EQU   ASMVT+200
ASMPFRSL EQU   ASMVT+196
ASMPQIOE EQU   ASMVT+192
ASMRSV8  EQU   ASMVT+184
ASMTASCB EQU   ASMVT+180
ASMRLGWQ EQU   ASMVT+176
ASMRLGRQ EQU   ASMVT+172
ASMTMECB EQU   ASMVT+168
ASMTCBPT EQU   ASMVT+164
ASMREQCT EQU   ASMVT+160
ASMGOSWK EQU   ASMGOSQS+4
ASMGOSWT EQU   ASMGOSQS
ASMLSAIH EQU   ASMLSAI+4
ASMLSAIL EQU   ASMLSAI
ASMCINV  EQU   ASMVT+140
ASMSTGXA EQU   ASMVT+136
ASMLGVT  EQU   ASMVT+132
ASMSLOTV EQU   ASMVT+128
ASMERRS  EQU   ASMVT+124
ASMNVSC  EQU   ASMVT+120
ASMVSC   EQU   ASMVT+116
ASMSLOTS EQU   ASMVT+112
ASMBKSLT EQU   ASMVT+108
ASMRSV7  EQU   ASMVT+92
ASMPSRB  EQU   ASMVT+88
ASMSRBCT EQU   ASMVT+84
ASMIOCNT EQU   ASMVT+80
ASMBURST EQU   ASMVT+76
ASMPCCWN EQU   ASMVT+72
ASMPCCWC EQU   ASMPCCWQ+4
ASMPCCWA EQU   ASMPCCWQ
ASMRSV6  EQU   ASMVT+48
ASMIORQC EQU   ASMVT+44
ASMIORQR EQU   ASMVT+40
ASMSTAGL EQU   ASMSTAGQ+4
ASMSTAGF EQU   ASMSTAGQ
ASMRSV5  EQU   ASMVT+28
ASMMSGBF EQU   ASMVT+24
ASMEREC  EQU   ASMVT+20
ASMTRPAG EQU   ASMVT+16
ASMGOS   EQU   ASMVT+12
ASMSART  EQU   ASMVT+4
ASMRSV4  EQU   ASMVT+2
ASMWARM  EQU   ASMFLAG2
ASMQUICK EQU   ASMFLAG2
ASMNOTPT EQU   ASMFLAG2
ASMNOTMR EQU   ASMFLAG2
ASMNOSAV EQU   ASMFLAG2
ASMCALLQ EQU   ASMFLAG2
ASMPLPAS EQU   ASMFLAG1
ASMCOMMF EQU   ASMFLAG1
ASMPLPAF EQU   ASMFLAG1
ASMNODPX EQU   ASMFLAG1
ASMRSV1  EQU   ASMFLAG1
ASMNOLCL EQU   ASMFLAG1
ASMNOCWQ EQU   ASMFLAG1
ASMDUPLX EQU   ASMFLAG1
RSMFOEQ  EQU   RSMHD+36
RSMLIOQL EQU   RSMLIOQ+4
RSMLIOQF EQU   RSMLIOQ
RSMLSQAL EQU   RSMLSQA+2
RSMLSQAF EQU   RSMLSQA
RSMLFQL  EQU   RSMLFQ+2
RSMLFQF  EQU   RSMLFQ
RSMRSV2  EQU   RSMHD+16
RSMCNTFX EQU   RSMHD+14
RSMRSV1  EQU   RSMHD+13
@NM00005 EQU   RSMFLG1
RSMFAIL  EQU   RSMFLG1
RSMGFADD EQU   RSMFLG1
RSMCPNC  EQU   RSMFLG1
RSMCPNU  EQU   RSMFLG1
RSMGFAD  EQU   RSMFLG1
RSMIOCPC EQU   RSMFLG1
RSMIOCPU EQU   RSMFLG1
RSMASCB  EQU   RSMHD+8
RSMSPCT  EQU   RSMHD+4
RSMVSTO  EQU   RSMHD
ASCBEND  EQU   ASCB+208
ASCBSRBT EQU   ASCB+200
ASCBSWTL EQU   ASCB+196
ASCBRS14 EQU   ASCB+195
ASCBSMCT EQU   ASCB+194
ASCBRS12 EQU   ASCB+192
ASCBPCTT EQU   ASCB+188
ASCBVGTT EQU   ASCB+184
ASCBRV43 EQU   ASCBSRQ4
ASCBRV42 EQU   ASCBSRQ4
ASCBRV41 EQU   ASCBSRQ4
ASCBRV40 EQU   ASCBSRQ4
ASCBRV39 EQU   ASCBSRQ4
ASCBRV38 EQU   ASCBSRQ4
ASCBRV37 EQU   ASCBSRQ4
ASCBRV36 EQU   ASCBSRQ4
ASCBRV35 EQU   ASCBSRQ3
ASCBRV34 EQU   ASCBSRQ3
ASCBRV33 EQU   ASCBSRQ3
ASCBRV32 EQU   ASCBSRQ3
ASCBRV31 EQU   ASCBSRQ3
ASCBRV30 EQU   ASCBSRQ3
ASCBRV29 EQU   ASCBSRQ3
ASCBRV28 EQU   ASCBSRQ3
ASCBRV27 EQU   ASCBSRQ2
ASCBRV26 EQU   ASCBSRQ2
ASCBRV25 EQU   ASCBSRQ2
ASCBRV24 EQU   ASCBSRQ2
ASCBRV23 EQU   ASCBSRQ2
ASCBRV22 EQU   ASCBSRQ2
ASCBRV21 EQU   ASCBSRQ2
ASCBRV20 EQU   ASCBSRQ2
ASCBRV19 EQU   ASCBSRQ1
ASCBRV18 EQU   ASCBSRQ1
ASCBRV17 EQU   ASCBSRQ1
ASCBRV16 EQU   ASCBSRQ1
ASCBRV15 EQU   ASCBSRQ1
ASCBRV14 EQU   ASCBSRQ1
ASCBRV13 EQU   ASCBSRQ1
ASCBSTA  EQU   ASCBSRQ1
ASCBJBNS EQU   ASCB+176
ASCBJBNI EQU   ASCB+172
ASCBMCC  EQU   ASCB+168
ASCBRTWA EQU   ASCB+164
ASCBIQEA EQU   ASCB+160
ASCBXMPQ EQU   ASCB+156
ASCBRS01 EQU   ASCB+154
ASCBFMCT EQU   ASCB+152
ASCBOUXB EQU   ASCB+148
ASCBOUCB EQU   ASCB+144
ASCBMECB EQU   ASCB+140
ASCBQECB EQU   ASCB+136
ASCBLSQH EQU   ASCBLKGP+4
ASCBLOCK EQU   ASCBLKGP
ASCBTCBS EQU   ASCB+124
ASCBNVSC EQU   ASCB+122
ASCBVSC  EQU   ASCB+120
ASCBSRBS EQU   ASCB+118
ASCBSSRB EQU   ASCB+116
ASCBRV06 EQU   ASCBFLG2
ASCBRV05 EQU   ASCBFLG2
ASCBRV04 EQU   ASCBFLG2
ASCBSNQS EQU   ASCBFLG2
ASCBS2S  EQU   ASCBFLG2
ASCBCEXT EQU   ASCBFLG2
ASCBPXMT EQU   ASCBFLG2
ASCBXMPT EQU   ASCBFLG2
ASCBRF07 EQU   ASCBDSP1
ASCBRF06 EQU   ASCBDSP1
ASCBRF05 EQU   ASCBDSP1
ASCBRF04 EQU   ASCBDSP1
ASCBRF03 EQU   ASCBDSP1
ASCBRF02 EQU   ASCBDSP1
ASCBFAIL EQU   ASCBDSP1
ASCBNOQ  EQU   ASCBDSP1
ASCBSWCT EQU   ASCB+112
ASCBASXB EQU   ASCB+108
ASCBTMCH EQU   ASCB+104
ASCBNSWP EQU   ASCBFLG1
ASCBTYP1 EQU   ASCBFLG1
ASCBSTND EQU   ASCBFLG1
ASCBABNT EQU   ASCBFLG1
ASCBTERM EQU   ASCBFLG1
ASCBS3S  EQU   ASCBFLG1
ASCBCMSH EQU   ASCBFLG1
ASCBTOFF EQU   ASCBFLG1
ASCBRF01 EQU   ASCBRCTF
ASCBTMLW EQU   ASCBRCTF
ASCBOUT  EQU   ASCBRCTF
ASCBWAIT EQU   ASCBRCTF
ASCBRV08 EQU   ASCBRCTF
ASCBFQU  EQU   ASCBRCTF
ASCBFRS  EQU   ASCBRCTF
ASCBTMNO EQU   ASCBRCTF
ASCBAFFN EQU   ASCBFW1
ASCBDUMP EQU   ASCB+96
ASCBRV44 EQU   ASCB+92
ASCBUBET EQU   ASCB+88
ASCBECB  EQU   ASCB+84
ASCBJSTL EQU   ASCB+80
ASCBEWST EQU   ASCB+72
ASCBEJST EQU   ASCB+64
ASCBTSB  EQU   ASCB+60
ASCBCSCB EQU   ASCB+56
ASCBLDA  EQU   ASCB+48
ASCBSTOR EQU   ASCB+44
ASCBDP   EQU   ASCB+43
ASCBRV07 EQU   ASCB+42
ASCBIOSM EQU   ASCB+40
ASCBSEQN EQU   ASCB+38
ASCBASID EQU   ASCB+36
ASCBCPUS EQU   ASCB+32
ASCBSPL  EQU   ASCB+28
ASCBIOSP EQU   ASCB+24
ASCBSYNC EQU   ASCBSUPC+4
ASCBSVRB EQU   ASCBSUPC
ASCBCMSF EQU   ASCB+12
ASCBBWDP EQU   ASCB+8
ASCBFWDP EQU   ASCB+4
ASCBASCB EQU   ASCB
ASCBEGIN EQU   ASCB
AIADPXCT EQU   AIALGE
AIACEPTR EQU   AIALPMEP
AIASLOT  EQU   AIASSID+1
@NM00004 EQU   AIASSID
@NM00003 EQU   AIALSID
AIARCSN  EQU   AIANXAIA+2
AIACYL   EQU   AIANXAIA
AIARSV9  EQU   AIAFLG3
AIARSV8  EQU   AIAFLG3
AIARSV7  EQU   AIAFLG3
AIARSV6  EQU   AIAFLG3
AIATRPSP EQU   AIAFLG3
AIARSV5  EQU   AIAFLG3
AIABADID EQU   AIAFLG2
AIASECER EQU   AIAFLG2
AIAPRIER EQU   AIAFLG2
AIARSV4  EQU   AIAFLG2
AIAIORTY EQU   AIAFLG2
AIATERMR EQU   AIAFLG2
AIAFRAUX EQU   AIAFLG2
AIARSV1  EQU   AIAFLG1
AIASWPFX EQU   AIAFLG1
AIAPAGDS EQU   AIAFLG1
AIALSQA  EQU   AIAFLG1
AIADUPLX EQU   AIAFLG1
AIAVIO   EQU   AIAFLG1
AIAPRIV  EQU   AIAFLG1
AIAWRITE EQU   AIAFLG1
AIAOP    EQU   AIA+8
AIABQPA  EQU   AIA+4
@NM00002 EQU   ACE+40
ACEAIAPT EQU   ACESYM+4
ACEVLSID EQU   ACESRCID+1
@NM00001 EQU   ACESRCID
ACELGID  EQU   ACELGN
ACERSV10 EQU   ACEFLG3
ACERSV9  EQU   ACEFLG3
ACERSV8  EQU   ACEFLG3
ACELPMEC EQU   ACEFLG3
ACERSV7  EQU   ACEFLG3
ACERSV6  EQU   ACEFLG3
ACEFLG2  EQU   ACE+10
ACERSV5  EQU   ACEFLG1
ACERSV4  EQU   ACEFLG1
ACERSV3  EQU   ACEFLG1
ACERSV2  EQU   ACEFLG1
ACENOACT EQU   ACEFLG1
ACEUSYM  EQU   ACEFLG1
@NM00055 EQU   PSA+3668
PSASTAK  EQU   PSA+3072
@NM00054 EQU   PSA+1048
PSAUSEND EQU   PSA+1048
PSARV062 EQU   PSA+1044
PSACDAL  EQU   PSA+1040
PSAWTCOD EQU   PSA+1036
PSAATCVT EQU   PSA+1032
PSAPCPSW EQU   PSA+1024
PSAPIR2  EQU   PSA+1020
PSARV059 EQU   PSA+1018
PSASVC13 EQU   PSA+1016
PSALSFCC EQU   PSA+1012
PSASFACC EQU   PSA+1008
PSASTOP  EQU   PSA+992
PSASTART EQU   PSA+976
PSARSPSW EQU   PSA+968
PSASRPSW EQU   PSA+960
PSARV045 EQU   PSA+892
PSARV044 EQU   PSA+888
PSARV043 EQU   PSA+884
PSARV042 EQU   PSA+880
PSARV041 EQU   PSA+876
PSARV040 EQU   PSA+872
PSARV025 EQU   PSA+868
PSADSSED EQU   PSA+868
PSADSSPR EQU   PSA+864
PSADSSFW EQU   PSA+860
PSADSS14 EQU   PSA+856
PSADSSPP EQU   PSA+848
PSADSSRP EQU   PSA+840
PSADSS05 EQU   PSADSSF4
PSADSS10 EQU   PSADSSF4
PSADSSVE EQU   PSADSSF4
PSADSSDE EQU   PSADSSF4
PSADSSC0 EQU   PSADSSF4
PSADSSIE EQU   PSADSSF4
PSADSS12 EQU   PSADSSF4
PSADSSRC EQU   PSADSSF4
PSARV057 EQU   PSADSSF3
PSARV056 EQU   PSADSSF3
PSARV055 EQU   PSADSSF3
PSADSSMC EQU   PSADSSF3
PSADSSRW EQU   PSADSSF3
PSADSSNM EQU   PSADSSF3
PSADSSES EQU   PSADSSF3
PSADSSGP EQU   PSADSSF3
PSADSSF2 EQU   PSADSSFL+1
PSADSSPI EQU   PSADSSF1
PSADSSOI EQU   PSADSSF1
PSADSSSP EQU   PSADSSF1
PSADSSTP EQU   PSADSSF1
PSADSSDW EQU   PSADSSF1
PSADSSDD EQU   PSADSSF1
PSADSSDM EQU   PSADSSF1
PSADSSMV EQU   PSADSSF1
PSADSSTS EQU   PSA+816
PSADSSWK EQU   PSA+812
PSADSSR3 EQU   PSA+808
PSADSSR2 EQU   PSA+804
PSADSSRS EQU   PSA+800
PSASTOR  EQU   PSA+796
PSACPUSA EQU   PSA+794
PSAVSTAP EQU   PSA+792
PSAWKVAP EQU   PSA+788
PSAWKRAP EQU   PSA+784
PSAMCHIC EQU   PSA+783
PSARV061 EQU   PSA+782
PSASYMSK EQU   PSA+781
PSAMCHFL EQU   PSA+780
PSACR0   EQU   PSA+776
PSAPSWSV EQU   PSA+768
PSALITA  EQU   PSA+764
PSACLHS  EQU   PSAHLHI
PSALKR15 EQU   PSALKSA+60
PSALKR14 EQU   PSALKSA+56
PSALKR13 EQU   PSALKSA+52
PSALKR12 EQU   PSALKSA+48
PSALKR11 EQU   PSALKSA+44
PSALKR10 EQU   PSALKSA+40
PSALKR9  EQU   PSALKSA+36
PSALKR8  EQU   PSALKSA+32
PSALKR7  EQU   PSALKSA+28
PSALKR6  EQU   PSALKSA+24
PSALKR5  EQU   PSALKSA+20
PSALKR4  EQU   PSALKSA+16
PSALKR3  EQU   PSALKSA+12
PSALKR2  EQU   PSALKSA+8
PSALKR1  EQU   PSALKSA+4
PSALKR0  EQU   PSALKSA
PSARV023 EQU   PSACLHT+52
PSALOCAL EQU   PSACLHT+48
PSACMSL  EQU   PSACLHT+44
PSAOPTL  EQU   PSACLHT+40
PSATPACL EQU   PSACLHT+36
PSATPDNL EQU   PSACLHT+32
PSATPNCL EQU   PSACLHT+28
PSAIOSLL EQU   PSACLHT+24
PSAIOSUL EQU   PSACLHT+20
PSAIOSCL EQU   PSACLHT+16
PSAIOSSL EQU   PSACLHT+12
PSASALCL EQU   PSACLHT+8
PSAASML  EQU   PSACLHT+4
PSADISPL EQU   PSACLHT
PSASRSA  EQU   PSA+636
PSARV050 EQU   PSA+634
PSADSSGO EQU   PSA+633
PSARECUR EQU   PSA+632
PSAHLHIS EQU   PSA+628
PSAIPCSA EQU   PSA+624
@NM00053 EQU   PSA+621
PSAIPCDM EQU   PSA+620
PSAIPCD  EQU   PSA+616
@NM00052 EQU   PSA+613
PSAIPCRM EQU   PSA+612
PSAIPCR  EQU   PSA+608
PSAMCHEX EQU   PSA+600
PSAMPSW  EQU   PSA+592
PSAEXPS2 EQU   PSA+584
PSAEXPS1 EQU   PSA+576
PSAPIREG EQU   PSA+572
PSARSREG EQU   PSA+568
PSAGPREG EQU   PSA+556
PSARV022 EQU   PSASUP4
PSARV021 EQU   PSASUP4
PSARV020 EQU   PSASUP4
PSARV019 EQU   PSASUP4
PSARV018 EQU   PSASUP4
PSARV017 EQU   PSASUP4
PSARV016 EQU   PSASUP4
PSARV015 EQU   PSASUP4
PSARV014 EQU   PSASUP3
PSARV013 EQU   PSASUP3
PSARV012 EQU   PSASUP3
PSAESTA  EQU   PSASUP3
PSASPR   EQU   PSASUP3
PSAPSREG EQU   PSASUP3
PSAPI2   EQU   PSASUP3
PSAIOSUP EQU   PSASUP3
PSALCR   EQU   PSASUP2
PSARTM   EQU   PSASUP2
PSAACR   EQU   PSASUP2
PSAIPCE2 EQU   PSASUP2
PSAIPCES EQU   PSASUP2
PSAIPCEC EQU   PSASUP2
PSAGTF   EQU   PSASUP2
PSAIPCRI EQU   PSASUP2
PSATYPE6 EQU   PSASUP1
PSATCTL  EQU   PSASUP1
PSADISP  EQU   PSASUP1
PSALOCK  EQU   PSASUP1
PSAPI    EQU   PSASUP1
PSAEXT   EQU   PSASUP1
PSASVC   EQU   PSASUP1
PSAIO    EQU   PSASUP1
PSAAOLD  EQU   PSA+548
PSAANEW  EQU   PSA+544
PSATOLD  EQU   PSA+540
PSATNEW  EQU   PSA+536
PSALCCAR EQU   PSA+532
PSALCCAV EQU   PSA+528
PSAPCCAR EQU   PSA+524
PSAPCCAV EQU   PSA+520
PSACPULA EQU   PSA+518
PSACPUPA EQU   PSA+516
PSAPSA   EQU   PSA+512
FLCHDEND EQU   PSA+512
FLCCRSAV EQU   FLCMCLA+280
FLCGRSAV EQU   FLCMCLA+216
FLCFPSAV EQU   FLCMCLA+184
FLCFLA   EQU   FLCMCLA+88
FLCRGNCD EQU   FLCMCLA+84
FLCFSAA  EQU   FLCFSA+1
@NM00051 EQU   FLCFSA
@NM00050 EQU   FLCMCLA+72
FLCMCIC  EQU   FLCMCLA+64
@NM00049 EQU   FLCMCLA+20
FLCIOAA  EQU   FLCIOA+1
@NM00048 EQU   FLCIOA
@NM00047 EQU   FLCMCLA+15
@NM00046 EQU   FLCMCLA+14
@NM00045 EQU   FLCMCLA+12
FLCLCL   EQU   FLCMCLA+8
FLCIOELA EQU   FLCIOEL+1
@NM00044 EQU   FLCIOEL
FLCCHNID EQU   FLCMCLA
@NM00043 EQU   PSA+160
FLCMTRCD EQU   PSA+157
@NM00042 EQU   PSA+156
FLCPERA  EQU   FLCPER+1
@NM00041 EQU   FLCPER
@NM00040 EQU   PSA+151
FLCPERCD EQU   PSA+150
FLCMCNUM EQU   PSA+149
@NM00039 EQU   PSA+148
FLCTEAA  EQU   FLCTEA+1
@NM00038 EQU   FLCTEA
PSAPIPC  EQU   PSAPICOD
PSAPIMC  EQU   PSAPICOD
PSAPIPER EQU   PSAPICOD
PSARV049 EQU   FLCPICOD
FLCPILCB EQU   FLCPIILC
@NM00037 EQU   FLCPIILC
@NM00036 EQU   PSAEPPSW
FLCSVCN  EQU   PSAESPSW+2
FLCSILCB EQU   FLCSVILC
@NM00035 EQU   FLCSVILC
@NM00034 EQU   PSAESPSW
FLCEICOD EQU   PSAEEPSW+2
PSASPAD  EQU   PSAEEPSW
@NM00033 EQU   PSA+128
FLCINPSW EQU   PSA+120
FLCMNPSW EQU   PSA+112
FLCPNPSW EQU   PSA+104
FLCSNPSW EQU   PSA+96
FLCENPSW EQU   PSA+88
FLCTRACE EQU   PSA+84
FLCTIMER EQU   PSA+80
FLCCVT2  EQU   PSA+76
FLCCAW   EQU   PSA+72
FLCCSW   EQU   PSA+64
FLCIOPSW EQU   PSA+56
FLCMOPSW EQU   PSA+48
FLCPOPSW EQU   PSA+40
FLCSOPSW EQU   PSA+32
FLCEOPSW EQU   PSA+24
@NM00032 EQU   FLCICCW2+4
FLCICCW1 EQU   FLCROPSW
FLCIPPSW EQU   FLCRNPSW
*                                      END UNREFERENCED COMPONENTS
@RC00123 EQU   @RC00107
@RC00108 EQU   @RC00107
@RF00170 EQU   @RC00165
@RF00204 EQU   @RC00194
@RC00109 EQU   @RC00108
@RC00124 EQU   @RC00123
@ENDDATA EQU   *
         END   ILRSRBC,(C'PLS2057',0701,76114)
