         TITLE 'IGFDW0, DDR UCB SWAP                                   *
                        '
IGFDW0   CSECT ,                                                   0001
@MAINENT DS    0H                                                  0001
         USING *,@15                                               0001
         B     @PROLOG                                             0001
         DC    AL1(16)                                             0001
         DC    C'IGFDW0    76.274'                                 0001
         DROP  @15
@PROLOG  STM   @14,@12,12(@13)                                     0001
         BALR  @08,0                                               0001
@PSTART  DS    0H                                                  0001
         USING @PSTART,@08                                         0001
         L     @00,@SIZDATD                                        0001
         GETMAIN  R,LV=(0)
         LR    @09,@01                                             0001
         USING @DATD,@09                                           0001
         ST    @13,@SA00001+4                                      0001
         LM    @00,@01,20(@13)                                     0001
         ST    @09,8(,@13)                                         0001
         LR    @13,@09                                             0001
*                                      VERSION                       */
*   PAGEFLAG='0'B;                  /* NOT IN FIXED MEMORY           */
         NI    PAGEFLAG,B'01111111'                                0145
*   DO;                             /* ?IGFDERR INIT                 */
*                                                                  0146
*     /***************************************************************/
*     /*                                                             */
*     /* IGFDERR - INITIALIZE RECOVERY ENVIRONMENT                   */
*     /*                                                             */
*     /***************************************************************/
*                                                                  0147
*     DERPLIST=DERPLIST&&DERPLIST;  /* CLEAR PARAMETER LIST          */
         XC    DERPLIST(48),DERPLIST                               0147
*     DERFUNK=DERINIT;              /* INDICATE INIT FUNCTION        */
         MVI   DERFUNK,X'01'                                       0148
*     DERREC=ADDR(DERRECPM);        /* POINT TO REC PARMS            */
         LA    @14,DERRECPM                                        0149
         ST    @14,DERREC                                          0149
*     DERSPEC=ADDR(IGFDW0S);        /* POINT TO SPECIAL EXIT         */
         LA    @14,IGFDW0S                                         0150
         ST    @14,DERSPEC                                         0150
*     DERRETRY=ADDR(IGFDW0R);       /* POINT TO RETRY ROUTINE        */
         LA    @14,IGFDW0R                                         0151
         ST    @14,DERRETRY                                        0151
*     GEN SETS(DERDATD)(MVC DERDATD,@SIZDATD);/* SET UP SPN, SIZE    */
         MVC DERDATD,@SIZDATD
*     DERPFX=DERRMASK;              /* SET UP RUB MASK               */
         MVC   DERPFX(2),@CB01730                                  0153
*     DERRCODE=CODEBASE;            /* SAVE CODEREG                  */
         ST    CODEBASE,DERRCODE                                   0154
*     DERRDATA=DATABASE;            /* SAVE DATAREG                  */
         ST    DATABASE,DERRDATA                                   0155
*     DERRDDR=DDRPTR;               /* SAVE DDRCOM POINTER           */
         ST    DDRPTR,DERRDDR                                      0156
*     DERRSAVE=SAVEPTR;             /* SAVE REGISTER 13              */
         ST    SAVEPTR,DERRSAVE                                    0157
*     CALL IGFDE0(DERPLIST);        /* ISSUE ESTAE                   */
         LA    @14,DERPLIST                                        0158
         ST    @14,@AL00001                                        0158
         L     @15,@CV01670                                        0158
         LA    @01,@AL00001                                        0158
         BALR  @14,@15                                             0158
*   END;                            /* ?IGFDERR INIT ESTAE         0159
*                                      ESTABLISHED                   */
*   UCBPTR=DDRTOUCB;                /* INITIALIZE UCB PTR    @YM02553*/
         L     UCBPTR,DDRTOUCB(,DDRPTR)                            0160
*   DW0ECB=0;                       /* CLEAR ECB                     */
         SLR   @14,@14                                             0161
         ST    @14,DW0ECB                                          0161
*   ECBPTR=ADDR(DW0ECB);            /* INITIALIZE ECB REG            */
*                                                                  0162
         LA    ECBPTR,DW0ECB                                       0162
*   /*****************************************************************/
*   /*                                                               */
*   /* FIX THE BOUNDARIES OF THIS MODULE                             */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0163
*   DO;                             /* PGFIX (R) A(IGFDW0) ECB(ECB)
*                                      LONG(N) RELEASE(N)            */
*     RESPECIFY                                                    0164
*      (GPR00P,                                                    0164
*       GPR01P) RESTRICTED;                                        0164
*     GPR00P=ADDR(ECB);             /* ECB ADDR                      */
         LR    GPR00P,ECBPTR                                       0165
*     GPR01P=ADDR(IGFDW0);          /* PAGE ADDR                     */
         L     GPR01P,@CA00028                                     0166
*     RESPECIFY                                                    0167
*       GPR15P RESTRICTED;                                         0167
*     GPR15P=ADDR(IGFDW0)+1;        /* VSL ADDR OMITTED              */
         L     GPR15P,@CA00028                                     0168
         AL    GPR15P,@CF00063                                     0168
*     GPR01P=GPR01P×'50000000'X;    /* R, PGFIX, RELEASE & LONG FLAGS*/
         O     GPR01P,@CF01738                                     0169
*     SVC(113);                     /* ISSUE PGFIX SVC               */
         SVC   113                                                 0170
*     RESPECIFY                                                    0171
*      (GPR00P,                                                    0171
*       GPR01P) UNRESTRICTED;                                      0171
*     RESPECIFY                                                    0172
*       GPR15P UNRESTRICTED;                                       0172
*   END;                            /* PGFIX (R) A(IGFDW0) ECB(ECB)
*                                      LONG(N) RELEASE(N) WHERE    0173
*                                      PGFREE OCCURS                 */
*   DO;                             /* WAIT ECB(ECB)                 */
*     RESPECIFY                                                    0175
*      (GPR00P,                                                    0175
*       GPR01P) RESTRICTED;                                        0175
*     GPR00P=1;                     /* LOAD WAIT COUNT               */
         LA    GPR00P,1                                            0176
*     GPR01P=ADDR(ECB);             /* ADDRESS OF ECB                */
         LR    GPR01P,ECBPTR                                       0177
*     SVC(1);                       /* WAIT SVC                      */
         SVC   1                                                   0178
*     RESPECIFY                                                    0179
*      (GPR00P,                                                    0179
*       GPR01P) UNRESTRICTED;                                      0179
*   END;                            /* WAIT ECB(ECB) WAIT FOR PAGE-IN
*                                      COMPLETION                    */
*   IF ECBCC^='40'X THEN            /* PAGE SUCCESSFULLY FIXED?      */
         CLI   ECBCC(ECBPTR),X'40'                                 0181
         BE    @RF00181                                            0181
*     DO;                           /* NO - PAGE IS NOT FIXED        */
*       DDRTER1=DDRTCE;             /* CATASTROPHIC ERROR            */
         MVI   DDRTER1(DDRPTR),X'07'                               0183
*       DERLRC=12;                  /* SET LOCAL RETURN CODE         */
         MVI   DERLRC,X'0C'                                        0184
*     END;                                                         0185
*   ELSE                                                           0186
*     DO;                           /* YES - PAGE IS FIXED           */
         B     @RC00181                                            0186
@RF00181 DS    0H                                                  0187
*       PAGEFLAG='1'B;              /* INDICATE PAGE FIXED           */
*                                                                  0187
         OI    PAGEFLAG,B'10000000'                                0187
*       /*************************************************************/
*       /*                                                           */
*       /* INFORM JES3 THAT UCBS ARE ABOUT TO BE SWAPPED     @Y02BKCI*/
*       /*                                                           */
*       /*************************************************************/
*                                                                  0188
*       SSOBFUNC=SSOBDDR3;          /* SET FUNCTION CODE FOR UCB SWAP
*                                                            @Y02BKCI*/
         L     @14,DDRSSOB(,DDRPTR)                                0188
         MVC   SSOBFUNC(2,@14),@CH01654                            0188
*       SSDRSFRU=DDRFMUCB;          /* SET PTR TO 'FROM' UCB @Y02BKCI*/
         L     @12,SSOBINDV(,@14)                                  0189
         L     @11,DDRFMUCB(,DDRPTR)                               0189
         ST    @11,SSDRSFRU(,@12)                                  0189
*       SSDRSTOU=DDRTOUCB;          /* SET PTR TO 'TO' UCB   @Y02BKCI*/
         L     @11,DDRTOUCB(,DDRPTR)                               0190
         ST    @11,SSDRSTOU(,@12)                                  0190
*/*  ? IEFSSREQ  (SSOB);                                             */
*/*                                                                  */
*/*  PASS CONTROL TO JOB ENTRY SUBSYSTEM TO                          */
*/*  PROCESS REQUEST -                                               */
*/*                                                                  */
*/*    INPUT - REGISTER 1 POINTS TO A ONE-                           */
*/*            WORD PARAMETER LIST WHICH                             */
*/*            POINTS TO THE SSOB                                    */
*/*                                                                  */
*                                                                  0191
*       CALL SSREQ(SSOB);           /* ATTEMPT TO COMMUNICATE WITH 0191
*                                      JES3                  @Y02BKCI*/
         ST    @14,@AL00001                                        0191
         MVI   @AL00001,X'80'                                      0191
         L     @12,CVTPTR                                          0191
         L     @12,CVTJESCT(,@12)                                  0191
         L     @15,JESSSREQ(,@12)                                  0191
         LA    @01,@AL00001                                        0191
         BALR  @14,@15                                             0191
*       IF^(RTNCODE=SSRTOK×RTNCODE=SSRTNSUP×RTNCODE=SSRTNTUP) THEN/*
*                                      Q. RETURN CODE ACCEPTABLE   0192
*                                                            @Y02BKCI*/
         LTR   RTNCODE,RTNCODE                                     0192
         BZ    @RF00192                                            0192
         C     RTNCODE,@CF00055                                    0192
         BE    @RF00192                                            0192
         C     RTNCODE,@CF00061                                    0192
         BE    @RF00192                                            0192
*         DO;                       /* NO, RETURN CODE IS EITHER   0193
*                                      INVALID OR INDICATES LOGIC  0193
*                                      ERROR                 @Y02BKCI*/
*           GEN(ABEND X'C0D',DUMP,,SYSTEM);/* FORCE ENTRY TO ESTAE 0194
*                                      HANDLER (IGFDE1)      @Y02BKCI*/
         ABEND X'C0D',DUMP,,SYSTEM
*         END;                                                     0195
*                                                                  0195
*       /*************************************************************/
*       /*                                                           */
*       /* WRITE THE DDR RECORD                                      */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0196
*       DDRREC1=DDRRECON;           /* WRITE DDR RECORD              */
@RF00192 MVI   DDRREC1(DDRPTR),X'01'                               0196
*       CALL IGFDR0;                /* DDR RECORDER                  */
         L     @15,@CV01672                                        0197
         BALR  @14,@15                                             0197
*       DDRTER1=0;                  /* IGNORE ALL RECORDING ERRORS   */
         MVI   DDRTER1(DDRPTR),X'00'                               0198
*/*   OBTAIN LOCAL LOCK                                              */
*                                                                  0199
*       GEN REFS(PSALITA,FLC) SETS(R11,R12,R14,SAVER13);           0199
*                                                                  0199
        LR SAVER13,SAVEPTR      SAVE REG 13 OVER SETLOCK
GETLOC SETLOCK OBTAIN,TYPE=LOCAL,MODE=UNCOND,                         XX
               RELATED=(LOCAL,IGFDW0(FREELOC)) GET LOCAL LOCK
        LR SAVEPTR,SAVER13      RESTORE REG 13
*/* OBTAIN CMS LOCK                                                  */
*                                                                  0200
*       GEN REFS(PSALITA,FLC) SETS(R11,R12,R14,SAVER13);           0200
*                                                                  0200
        LR SAVER13,SAVEPTR      SAVE REG 13 OVER SETLOCK
GETCMS SETLOCK OBTAIN,TYPE=CMS,MODE=UNCOND,                           XX
               RELATED=(CMS,IGFDW0(FREECMS)) GET CMS LOCK
        LR SAVEPTR,SAVER13      RESTORE REG 13
*/*  THESE LOCKS ARE USED BY DDR TO SERIALIZE THE UCBS USE         0201
*    BY ALLOCATION AND THE IOS LOOKUP TABLE DURING THE TIME THAT DDR
*    IS CHANGING IT.                                                 */
*/*   THE TWO PHYSICAL UCB POSITIONS ARE SWAPPED BY THE IOSGEN MACRO.
*     ALSO THE STATISTICS TABLE POSITONS ARE ADJUSTED AND THE      0201
*      THE REQUESTS WAITING FOR THE DEVICE ARE REQUEUED.             */
*                                                                  0201
*       RFY                                                        0201
*        (TOUCBPRE,                                                0201
*         FMUCBPRE) RSTD;                                          0201
*       TOUCBPRE=DDRTOUCB;          /* TO UCB FOR IOSGEN     @YM02567*/
         L     TOUCBPRE,DDRTOUCB(,DDRPTR)                          0202
*       FMUCBPRE=DDRFMUCB;          /* FROM UCB FOR IOSGEN   @YM02567*/
         L     FMUCBPRE,DDRFMUCB(,DDRPTR)                          0203
*       RFY                                                        0204
*        (TOUCBPRE,                                                0204
*         FMUCBPRE) UNRSTD;                                        0204
*       GEN REFS(UCBCNT,UCBFLA,UCBLCI,UCBFLC,UCBSNSCT,UCBASID,UCBOB,
*           UCBCHAN,UCBSTI,UCBETI,UCBNAME,UCBFLB,UCBTBYT3,UCBTYP,CVTMAP
*           ,CVTPTR,CVTIXAVL,CVTILK2,CVTSTB,UCBSTAB,UCBJBNR,UCBCHM,
*           UCBEXTPT,UCBCCWOF,UCBDMCT,UCBCMEXT,UCBDTI,UCBCPU,UCBPMSK,
*           UCBMFCNT,IOCOM,IOCGENA,SWAPWKA,TOUCBPRE,FMUCBPRE,UCBTBYT4,
*           UCBIOQ);                                               0205
*                                                                  0205
 IOSGEN SWAP,VAR=SWAPWKA,UCB=(TOUCBPRE),REG=(FMUCBPRE)        @YM02567
*       /*************************************************************/
*       /*                                                           */
*       /* SWITCH THE UCB ADDRESSES IN THE DDRCOM                    */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0206
*       RFY                                                        0206
*        (SAVER13) RSTD;                                           0206
*       SAVER13=DDRTOUCB;           /* SAVE TO UCB                   */
         L     SAVER13,DDRTOUCB(,DDRPTR)                           0207
*       DDRTOUCB=DDRFMUCB;          /* PLACE FROM UCB INTO TO        */
         L     @14,DDRFMUCB(,DDRPTR)                               0208
         ST    @14,DDRTOUCB(,DDRPTR)                               0208
*       DDRFMUCB=SAVER13;           /* PLACE TO UCB INTO FROM        */
         ST    SAVER13,DDRFMUCB(,DDRPTR)                           0209
*       RFY                                                        0210
*        (SAVER13) UNRSTD;                                         0210
*       CSDDDRCT=CSDDDRCT+1;        /* UPDATE COUNT FOR DEVICE ALLOC */
         L     @14,CVTPTR                                          0211
         L     @14,CVTCSD(,@14)                                    0211
         LA    @12,1                                               0211
         AH    @12,CSDDDRCT(,@14)                                  0211
         STH   @12,CSDDDRCT(,@14)                                  0211
*/*  RELEASE CMS LOCK                                                */
*                                                                  0212
*       GEN REFS(PSALITA,FLC) SETS(R11,R12,R14,SAVER13);           0212
*                                                                  0212
        LR SAVER13,SAVEPTR      SAVE REG 13 OVER SETLOCK
RELCMS SETLOCK RELEASE,TYPE=CMS,                                      XX
               RELATED=(CMS,IGFDW0(GETCMS)) FREE CMS LOCK
        LR SAVEPTR,SAVER13      RESTORE REG 13
*/*  RELEASE LOCAL LOCK                                              */
*                                                                  0213
*       GEN REFS(PSALITA,FLC) SETS(R11,R12,R14,SAVER13);           0213
*                                                                  0213
        LR SAVER13,SAVEPTR      SAVE REG 13 OVER SETLOCK
RELLOC SETLOCK RELEASE,TYPE=LOCAL,                                    XX
               RELATED=(LOCAL,IGFDW0(GETLOC)) RELEASE LOCAL LOCK
        LR SAVEPTR,SAVER13      RESTORE REG 13
*/*  RELEASE THE MODULE PAGE                                         */
*                                                                  0214
*       DO;                         /* PGFREE(R) A(IGFDW0) RELEASE(N)*/
*         RESPECIFY                                                0215
*          (GPR00P,                                                0215
*           GPR01P) RESTRICTED;                                    0215
*         GPR00P=0;                 /* INDICATE NO PAGE ECB          */
         SLR   GPR00P,GPR00P                                       0216
*         GPR01P=ADDR(IGFDW0);      /* PAGE ADDR                     */
         L     GPR01P,@CA00028                                     0217
*         RESPECIFY                                                0218
*           GPR15P RESTRICTED;                                     0218
*         GPR15P=ADDR(IGFDW0)+1;    /* VSL ADDR OMITTED              */
         L     GPR15P,@CA00028                                     0219
         AL    GPR15P,@CF00063                                     0219
*         GPR01P=GPR01P×'20000000'X;/* R, PGFREE & RELEASE FLAG      */
         O     GPR01P,@CF01743                                     0220
*         SVC(113);                 /* ISSUE PGFREE SVC              */
         SVC   113                                                 0221
*         RESPECIFY                                                0222
*          (GPR00P,                                                0222
*           GPR01P,                                                0222
*           GPR15P) UNRESTRICTED;                                  0222
*       END;                        /* PGFREE(R) A(IGFDW0) RELEASE(N)*/
*       PAGEFLAG='0'B;              /* NOT IN FIXED MEMORY           */
         NI    PAGEFLAG,B'01111111'                                0224
*       IF DDRFMUCB^=DDRTOUCB THEN  /* IS FROM NOT EQUAL TO ?        */
         L     @14,DDRFMUCB(,DDRPTR)                               0225
         C     @14,DDRTOUCB(,DDRPTR)                               0225
         BE    @RF00225                                            0225
*         DO;                       /* YES - DIFFERENT UCBS          */
*           IF DDRMT='1'B&DDRFMUCB->UCBRESV='0'B THEN/* IS DEVICE AN
*                                      UNRESERVED TAPE?              */
         TM    DDRMT(DDRPTR),B'00100000'                           0227
         BNO   @RF00227                                            0227
         TM    UCBRESV(@14),B'00100000'                            0227
         BNZ   @RF00227                                            0227
*             DO;                   /* YES - CLEAR ALL TRACES OF THE
*                                      PRE-MOUNTED VOLUME FROM THE 0228
*                                      FROM UCB                      */
*               UCBVOLI=UCBVOLI&&UCBVOLI;/* VOL SERIAL NO            */
         XC    UCBVOLI(6,UCBPTR),UCBVOLI(UCBPTR)                   0229
*               UCBDMCT=UCBDMCT&&UCBDMCT;/* MOUNT IND AND DATA     0230
*                                      MANAGEMENT COUNT              */
         XC    UCBDMCT(1,UCBPTR),UCBDMCT(UCBPTR)                   0230
*               UCBFSEQ=UCBFSEQ&&UCBFSEQ;/* DS SEQ NO                */
         LH    @14,UCBFSEQ(,UCBPTR)                                0231
         LR    @12,@14                                             0231
         XR    @12,@14                                             0231
         STH   @12,UCBFSEQ(,UCBPTR)                                0231
*               UCBFSCT=UCBFSCT&&UCBFSCT;/* DS SEQ COUNT             */
         LH    @14,UCBFSCT(,UCBPTR)                                0232
         LR    @12,@14                                             0232
         XR    @12,@14                                             0232
         STH   @12,UCBFSCT(,UCBPTR)                                0232
*               UCBFSER=UCBFSER&&UCBFSER;/* MESSAGE ID               */
         XC    UCBFSER(6,UCBPTR),UCBFSER(UCBPTR)                   0233
*               UCBMONT='0'B;       /* PASSED DS INDICATOR           */
         NI    UCBMONT(UCBPTR),B'11111110'                         0234
*               UCBBPRV='0'B;       /* VOLUME IS PRIVATE             */
         NI    UCBBPRV(UCBPTR),B'11101111'                         0235
*               UCBUNLD='0'B;       /* VOLUME TO BE UNLOADED         */
         L     @14,UCBUNLD-3(,UCBPTR)                              0236
@GL00004 LR    @12,@14                                             0236
         N     @12,@CF01761                                        0236
         CS    @14,@12,UCBUNLD-3(UCBPTR)                           0236
         BNE   @GL00004                                            0236
*               UCBBPUB='0'B;       /* VOLUME IS PUBLIC              */
*               UCBBNUL='0'B;       /* UCBFSER=MESSAGE NUMBER        */
         NI    UCBBPUB(UCBPTR),B'11110110'                         0238
*               UCBDADI='0'B;       /* SL VOLUME                     */
         NI    UCBDADI(UCBPTR),B'11111110'                         0239
*               UCBBSTR='0'B;       /* AL VOLUME                     */
         NI    UCBBSTR(UCBPTR),B'11111011'                         0240
*               UCBNSLTP='0'B;      /* NSL VOLUME                    */
*               UCBNLTP='0'B;       /* NL VOLUME                     */
         NI    UCBNSLTP(UCBPTR),B'00111111'                        0242
*               UCBNSRCH='0'B;      /* SPECIFIC VOLUME REQUEST       */
         L     @14,UCBEXTPT(,UCBPTR)                               0243
         NI    UCBNSRCH(@14),B'01111111'                           0243
*             END;                                                 0244
*           ELSE                                                   0245
*             ;                     /* NOT AN UNRESERVED TAPE        */
@RF00227 DS    0H                                                  0246
*           DDRIOF1=DDRNOP;         /* NO OP INDICATOR               */
         MVI   DDRIOF1(DDRPTR),X'03'                               0246
*           DDRIOF2=0;              /* CLEAR BYTE                    */
         MVI   DDRIOF2(DDRPTR),X'00'                               0247
*           DDRWHICH='1'B;          /* I/O TO BE PERFORMED           */
         OI    DDRWHICH(DDRPTR),B'10000000'                        0248
*           CALL IGFDM1;            /* RELEASE THE FROM DEVICE       */
         L     @15,@CV01673                                        0249
         BALR  @14,@15                                             0249
*           DDRTER1=0;              /* IGNORE ALL ERRORS             */
         MVI   DDRTER1(DDRPTR),X'00'                               0250
*           DDRFMUCB=DDRTOUCB;      /* THIS ALLOWS IGFDT1 TO FIND THE
*                                      ORIGINAL UCB ADDRESS INVOLVED
*                                      IN THE SWAP                   */
         L     @14,DDRTOUCB(,DDRPTR)                               0251
         ST    @14,DDRFMUCB(,DDRPTR)                               0251
*         END;                                                     0252
*       ELSE                                                       0253
*         ;                         /* NO - SAME UCBS                */
@RF00225 DS    0H                                                  0254
*     END;                                                         0254
*                                                                  0254
*   /*****************************************************************/
*   /*                                                               */
*   /* THIS IS THE COMMON EXIT ROUTINE FOR THIS MODULE               */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0255
*IGFDW0R:                                                          0255
*   ;                                                              0255
@RC00181 DS    0H                                                  0255
IGFDW0R  DS    0H                                                  0256
*   DO;                             /* ?IGFDERR CANCEL               */
*                                                                  0256
*     /***************************************************************/
*     /*                                                             */
*     /* IGFDERR - CANCEL RECOVERY ENVIRONMENT                       */
*     /*                                                             */
*     /***************************************************************/
*                                                                  0257
*     DERFUNK=DERCANC;              /* INDICATE CANCEL               */
         MVI   DERFUNK,X'02'                                       0257
*     CALL IGFDE0(DERPLIST);        /* CANCEL ESTAE                  */
         LA    @14,DERPLIST                                        0258
         ST    @14,@AL00001                                        0258
         L     @15,@CV01670                                        0258
         LA    @01,@AL00001                                        0258
         BALR  @14,@15                                             0258
*   END;                            /* ?IGFDERR CANCEL ESTAE CANCEL  */
*   RETURN CODE(DERLRC);            /* BACK TO CALLER                */
         SLR   @12,@12                                             0260
         IC    @12,DERLRC                                          0260
         L     @13,4(,@13)                                         0260
         L     @00,@SIZDATD                                        0260
         LR    @01,@09                                             0260
         FREEMAIN R,LV=(0),A=(1)
         LR    @15,@12                                             0260
         L     @14,12(,@13)                                        0260
         LM    @00,@12,20(@13)                                     0260
         BR    @14                                                 0260
*                                                                  0261
*   /*****************************************************************/
*   /*                                                               */
*   /* ESOTERIC ESTAE SUBROUTINE                                     */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0261
*IGFDW0S:                                                          0261
*   PROC;                           /* THIS SUBROUTINE IS ENTERED  0261
*                                      FROM IGFDE0 DURING ESTAE    0261
*                                      PROCESSING                    */
IGFDW0S  STM   @14,@12,12(@13)                                     0261
*   IF PAGEFLAG='1'B THEN           /* IS PAGE FIXED?                */
         TM    PAGEFLAG,B'10000000'                                0262
         BNO   @RF00262                                            0262
*     DO;                           /* YES - PAGE IS FIXED           */
*/*   RELEASE FIXED PAGE                                             */
*                                                                  0264
*       DO;                         /* PGFREE(R) A(IGFDW0) RELEASE(N)*/
*         RESPECIFY                                                0265
*          (GPR00P,                                                0265
*           GPR01P) RESTRICTED;                                    0265
*         GPR00P=0;                 /* INDICATE NO PAGE ECB          */
         SLR   GPR00P,GPR00P                                       0266
*         GPR01P=ADDR(IGFDW0);      /* PAGE ADDR                     */
         L     GPR01P,@CA00028                                     0267
*         RESPECIFY                                                0268
*           GPR15P RESTRICTED;                                     0268
*         GPR15P=ADDR(IGFDW0)+1;    /* VSL ADDR OMITTED              */
         L     GPR15P,@CA00028                                     0269
         AL    GPR15P,@CF00063                                     0269
*         GPR01P=GPR01P×'20000000'X;/* R, PGFREE & RELEASE FLAG      */
         O     GPR01P,@CF01743                                     0270
*         SVC(113);                 /* ISSUE PGFREE SVC              */
         SVC   113                                                 0271
*         RESPECIFY                                                0272
*          (GPR00P,                                                0272
*           GPR01P,                                                0272
*           GPR15P) UNRESTRICTED;                                  0272
*       END;                        /* PGFREE(R) A(IGFDW0) RELEASE(N)*/
*       PAGEFLAG='0'B;              /* PAGE NOT FIXED                */
         NI    PAGEFLAG,B'01111111'                                0274
*     END;                                                         0275
*   ELSE                                                           0276
*     ;                             /* NO - PAGE IS NOT FIXED        */
@RF00262 DS    0H                                                  0277
*   RETURN;                                                        0277
@EL00002 DS    0H                                                  0277
@EF00002 DS    0H                                                  0277
@ER00002 LM    @14,@12,12(@13)                                     0277
         BR    @14                                                 0277
*   END IGFDW0S;                                                   0278
*   DECLARE                         /* GENERAL PURPOSE REGISTERS     */
*     GPR00P PTR(31) REG(0),                                       0279
*     GPR01P PTR(31) REG(1),                                       0279
*     GPR15P PTR(31) REG(15);                                      0279
*   DECLARE                         /* COMMON VARIABLES              */
*     I256C CHAR(256) BASED,                                       0280
*     I031F FIXED(31) BASED,                                       0280
*     I031P PTR(31) BASED,                                         0280
*     I015F FIXED(15) BASED,                                       0280
*     I015P PTR(15) BASED,                                         0280
*     I008P PTR(8) BASED,                                          0280
*     I001C CHAR(1) BASED;                                         0280
*   END IGFDW0                                                     0281
*                                                                  0281
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */
*/*%INCLUDE SYSLIB  (CVT     )                                       */
*/*%INCLUDE SYSLIB  (IECDIOCM)                                       */
*/*%INCLUDE SYSLIB  (IHADDR  )                                       */
*/*%INCLUDE SYSLIB  (IHACSD  )                                       */
*/*%INCLUDE SYSLIB  (IHAPSA  )                                       */
*/*%INCLUDE SYSLIB  (IHAECB  )                                       */
*/*%INCLUDE SYSLIB  (IEFUCBOB)                                       */
*/*%INCLUDE SYSLIB  (IEFJESCT)                                       */
*/*%INCLUDE SYSLIB  (IEFJSSOB)                                       */
*                                                                  0281
*       ;                                                          0281
@DATA    DS    0H
@CH01654 DC    H'30'
@DATD    DSECT
         DS    0F
@SA00001 DS    18F
@AL00001 DS    1A
IGFDW0   CSECT
         DS    0F
@CF00063 DC    F'1'
@CF00055 DC    F'4'
@CF00061 DC    F'8'
@CF01738 DC    XL4'50000000'
@CF01743 DC    XL4'20000000'
@CF01761 DC    BL4'11111111111111111111111111101111'
@DATD    DSECT
         DS    0D
DW0ECB   DS    F
PAGEFLAG DS    BL1
         DS    CL3
SWAPWKA  DS    CL72
DERPLIST DS    CL48
         ORG   DERPLIST
DERFUNK  DS    AL1
DERSWCHS DS    BL1
         ORG   DERSWCHS
DERCRASH DS    BL1
DERPERK  EQU   DERSWCHS+0
DERECALL EQU   DERSWCHS+0
DERESTAE EQU   DERSWCHS+0
@NM00045 EQU   DERSWCHS+0
         ORG   DERPLIST+2
@NM00046 DS    CL2
DERREC   DS    AL4
DERSPEC  DS    AL4
DERRETRY DS    AL4
DERDATD  DS    CL4
         ORG   DERDATD
DERDASPN DS    FL1
DERDALNG DS    FL3
         ORG   DERPLIST+20
DERRSRC  DS    BL1
         ORG   DERRSRC
DERTAPE  DS    BL1
DERUREC  EQU   DERRSRC+0
DERDISK  EQU   DERRSRC+0
@NM00047 EQU   DERRSRC+0
         ORG   DERPLIST+21
DERLRC   DS    AL1
DERRUB   DS    CL18
         ORG   DERRUB
DERPFX   DS    BL2
DERRCODE DS    AL4
DERRDATA DS    AL4
DERRDDR  DS    AL4
DERRSAVE DS    AL4
         ORG   DERPLIST+40
DERGMSPL DS    CL4
         ORG   DERGMSPL
DERGMSPN DS    FL1
DERGMLNG DS    FL3
         ORG   DERPLIST+44
DERGMADR DS    AL4
         ORG   DERPLIST+48
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA
@ENDDATD EQU   *
IGFDW0   CSECT
         DS    0F
@SIZDATD DC    AL1(245)
         DC    AL3(@ENDDATD-@DATD)
@CA00028 DC    A(IGFDW0)
@CV01670 DC    V(IGFDE0)
@CV01672 DC    V(IGFDR0)
@CV01673 DC    V(IGFDM1)
         DS    0D
@CB01730 DC    B'0000000011100100'
DERRECPM DS    CL24
         ORG   DERRECPM
@NM00048 DC    CL8'IGFDI0'
@NM00049 DC    CL8'IGFDW0'
@NM00050 DC    CL8'76274'
         ORG   DERRECPM+24
         DS    CL2
IGFDW0P  DC    13F'0'
@00      EQU   00                      EQUATES FOR REGISTERS 0-15
@01      EQU   01
@02      EQU   02
@03      EQU   03
@04      EQU   04
@05      EQU   05
@06      EQU   06
@07      EQU   07
@08      EQU   08
@09      EQU   09
@10      EQU   10
@11      EQU   11
@12      EQU   12
@13      EQU   13
@14      EQU   14
@15      EQU   15
CODEBASE EQU   @08
DATABASE EQU   @09
DDRPTR   EQU   @10
ECBPTR   EQU   @06
UCBPTR   EQU   @03
TOUCBPRE EQU   @04
FMUCBPRE EQU   @05
SAVER13  EQU   @07
R11      EQU   @11
R12      EQU   @12
R14      EQU   @14
SAVEPTR  EQU   @13
RTNCODE  EQU   @15
GPR00P   EQU   @00
GPR01P   EQU   @01
GPR15P   EQU   @15
PSA      EQU   0
FLCRNPSW EQU   PSA
FLCROPSW EQU   PSA+8
FLCICCW2 EQU   PSA+16
FLCCVT   EQU   FLCICCW2
PSAEEPSW EQU   PSA+132
PSAESPSW EQU   PSA+136
FLCSVILC EQU   PSAESPSW+1
PSAEPPSW EQU   PSA+140
FLCPIILC EQU   PSAEPPSW+1
FLCPICOD EQU   PSAEPPSW+2
PSAPICOD EQU   FLCPICOD+1
FLCTEA   EQU   PSAEPPSW+4
FLCPER   EQU   PSA+152
FLCMCLA  EQU   PSA+168
FLCIOEL  EQU   FLCMCLA+4
FLCIOA   EQU   FLCMCLA+16
FLCFSA   EQU   FLCMCLA+80
PSASUPER EQU   PSA+552
PSASUP1  EQU   PSASUPER
PSASUP2  EQU   PSASUPER+1
PSASUP3  EQU   PSASUPER+2
PSASUP4  EQU   PSASUPER+3
PSACLHT  EQU   PSA+640
PSALKSA  EQU   PSA+696
PSAHLHI  EQU   PSA+760
PSALITA  EQU   PSA+764
PSADSSFL EQU   PSA+836
PSADSSF1 EQU   PSADSSFL
PSADSSF3 EQU   PSADSSFL+2
PSADSSF4 EQU   PSADSSFL+3
PSARSVT  EQU   PSA+896
CVTMAP   EQU   0
CVTILK2  EQU   CVTMAP+40
CVTDAR   EQU   CVTMAP+72
CVTFLGS1 EQU   CVTDAR
CVTSTB   EQU   CVTMAP+112
CVTDCB   EQU   CVTMAP+116
CVTIXAVL EQU   CVTMAP+124
CVTIERLC EQU   CVTMAP+144
CVTOPTA  EQU   CVTMAP+182
CVTOPTB  EQU   CVTMAP+183
CVTGTF   EQU   CVTMAP+236
CVTGTFST EQU   CVTGTF
CVTGTFS  EQU   CVTGTFST
CVTSTATE EQU   CVTGTFST
CVTTMODE EQU   CVTGTFST
CVTFORM  EQU   CVTGTFST
CVTAQAVT EQU   CVTMAP+240
CVTTCMFG EQU   CVTAQAVT
CVTVOLM2 EQU   CVTMAP+244
CVTTATA  EQU   CVTVOLM2
CVTTSKS  EQU   CVTTATA
CVTVOLF2 EQU   CVTTSKS
CVTTAT   EQU   CVTTATA+1
CVTATER  EQU   CVTMAP+248
CVTEXT1  EQU   CVTMAP+252
CVTPURG  EQU   CVTMAP+260
CVTQMSG  EQU   CVTMAP+268
CVTDMSR  EQU   CVTMAP+272
CVTJESCT EQU   CVTMAP+296
CVTERPV  EQU   CVTMAP+316
CVTINTLA EQU   CVTMAP+320
CVTAPF   EQU   CVTMAP+324
CVTEXT2  EQU   CVTMAP+328
CVTHJES  EQU   CVTMAP+332
CVTPGSIA EQU   CVTMAP+348
CVTA1F1  EQU   CVTMAP+356
CVTSYSK  EQU   CVTMAP+357
CVTVOLM1 EQU   CVTMAP+380
CVTVOLF1 EQU   CVTVOLM1
CVTATMCT EQU   CVTMAP+388
CVTXTNT1 EQU   0
CVTXTNT2 EQU   0
CVTDSSV  EQU   CVTXTNT2
CVTFLGBT EQU   CVTXTNT2+5
CVTQID   EQU   CVTXTNT2+24
CVTRV400 EQU   CVTXTNT2+52
CVTRV409 EQU   CVTXTNT2+53
CVTATCVT EQU   CVTXTNT2+64
CVTRV429 EQU   CVTXTNT2+84
CVTRV438 EQU   CVTXTNT2+85
CVTRV457 EQU   CVTXTNT2+112
CVTRV466 EQU   CVTXTNT2+113
CVTFIX   EQU   0
CVTRELNO EQU   CVTFIX+252
IOCOM    EQU   0
IOCGENA  EQU   IOCOM+84
DDRCOM   EQU   0
DDRSHORT EQU   DDRCOM
DDRCNTRL EQU   DDRSHORT+8
DDRSRC   EQU   DDRCNTRL
DDRSTAT  EQU   DDRCNTRL+1
DDRDCHAR EQU   DDRCNTRL+2
DDRDSTAT EQU   DDRDCHAR+1
DDRMT    EQU   DDRDSTAT
DDRLONG  EQU   DDRCOM+24
DDRTOUCB EQU   DDRLONG
DDRFMUCB EQU   DDRLONG+4
DDRROWN  EQU   DDRLONG+8
DDRMIHT  EQU   DDRLONG+12
DDRTER   EQU   DDRLONG+36
DDRTER1  EQU   DDRTER
DDRINV   EQU   DDRLONG+38
DDRAPP   EQU   DDRLONG+40
DDRIOF   EQU   DDRLONG+52
DDRIOF1  EQU   DDRIOF
DDRIOF2  EQU   DDRIOF+1
DDRWHICH EQU   DDRIOF2
DDRMSG   EQU   DDRLONG+54
DDRMSGP  EQU   DDRLONG+56
DDRLABEL EQU   DDRLONG+64
DDRREC   EQU   DDRLONG+66
DDRREC1  EQU   DDRREC
DDRREC2  EQU   DDRREC+1
DDRUSER  EQU   DDRLONG+68
DDRSSOB  EQU   DDRLONG+76
CSD      EQU   0
CSDCPUAL EQU   CSD+8
CSDSCWRD EQU   CSD+12
CSDSCFL1 EQU   CSDSCWRD
CSDSCFL2 EQU   CSDSCWRD+1
CSDSCFL3 EQU   CSDSCWRD+2
CSDSCFL4 EQU   CSDSCWRD+3
CSDFLAGS EQU   CSD+23
CSDDDRCT EQU   CSD+106
ECB      EQU   0
ECBRB    EQU   ECB
ECBEVTB  EQU   ECBRB
ECBCC    EQU   ECBEVTB
ECBEVNT  EQU   ECBCC
ECBCCCNT EQU   ECBEVTB+1
ECBRBA   EQU   ECBCCCNT
UCB      EQU   0
UCBIOQ   EQU   UCB+508
UCBOB    EQU   0
UCBJBNR  EQU   UCBOB
UCBMONT  EQU   UCBJBNR
UCBFL5   EQU   UCBOB+1
UCBAF    EQU   UCBFL5
UCBSTAT  EQU   UCBOB+3
UCBRESV  EQU   UCBSTAT
UCBUNLD  EQU   UCBSTAT
UCBDADI  EQU   UCBSTAT
UCBCHAN  EQU   UCBOB+4
UCBSFLS  EQU   UCBOB+6
UCBFLA   EQU   UCBSFLS
UCBFL1   EQU   UCBFLA
UCBBSY   EQU   UCBFL1
UCBNRY   EQU   UCBFL1
UCBPST   EQU   UCBFL1
UCBCUB   EQU   UCBFL1
UCBFLB   EQU   UCBSFLS+1
UCBCHM   EQU   UCBOB+8
UCBCHM1  EQU   UCBCHM
UCBPTH0  EQU   UCBCHM1
UCBPTH1  EQU   UCBCHM1
UCBCNT   EQU   UCBOB+9
UCBLCI   EQU   UCBOB+10
UCBCPU   EQU   UCBOB+11
UCBWGT   EQU   UCBOB+12
UCBNAME  EQU   UCBOB+13
UCBTYP   EQU   UCBOB+16
UCBTBYT1 EQU   UCBTYP
UCB1FEA5 EQU   UCBTBYT1
UCB1FEA6 EQU   UCBTBYT1
UCBTBYT2 EQU   UCBTYP+1
UCB2OPT2 EQU   UCBTBYT2
UCBDUDN1 EQU   UCB2OPT2
UCB2OPT3 EQU   UCBTBYT2
UCBDUDN2 EQU   UCB2OPT3
UCB2OPT4 EQU   UCBTBYT2
UCBRWTAU EQU   UCB2OPT4
UCB2OPT6 EQU   UCBTBYT2
UCB2OPT7 EQU   UCBTBYT2
UCBTBYT3 EQU   UCBTYP+2
UCBDVCLS EQU   UCBTBYT3
UCBTBYT4 EQU   UCBTYP+3
UCBEXTPT EQU   UCBOB+20
UCBFLC   EQU   UCBEXTPT
UCBDEV   EQU   UCBOB+24
UCBCMEXT EQU   0
UCBETI   EQU   UCBCMEXT
UCBSTI   EQU   UCBCMEXT+1
UCBDTI   EQU   UCBCMEXT+2
UCBATI   EQU   UCBCMEXT+3
@NM00042 EQU   UCBATI
UCBSNSCT EQU   UCBCMEXT+4
UCBFLP1  EQU   UCBCMEXT+5
UCBNSRCH EQU   UCBFLP1
UCBCCWOF EQU   UCBCMEXT+8
UCBPMSK  EQU   UCBCMEXT+10
UCBMFCNT EQU   UCBCMEXT+12
UCBASID  EQU   UCBCMEXT+14
UCBMT    EQU   0
UCBOCR   EQU   0
UCB3540X EQU   0
UCBDKBYT EQU   UCB3540X+6
UCBUCS   EQU   0
UCBUCSOP EQU   UCBUCS+4
UCBFCBOP EQU   UCBUCS+5
JESCT    EQU   0
JESWAA   EQU   JESCT+8
JESSSREQ EQU   JESCT+20
SSREQ    EQU   0
SSOB     EQU   0
SSOBFUNC EQU   SSOB+6
SSOBINDV EQU   SSOB+16
SSDR     EQU   0
SSDRFLG2 EQU   SSDR+3
SSDRSFRU EQU   SSDR+4
SSDRSTOU EQU   SSDR+8
I001C    EQU   0
I008P    EQU   0
I015F    EQU   0
I015P    EQU   0
I031F    EQU   0
I031P    EQU   0
I256C    EQU   0
SWAMGR   EQU   0
UCBBGN   EQU   0
CVTPTR   EQU   FLCCVT
CVTS01   EQU   CVTPGSIA
CVTLPDIA EQU   CVTS01+12
CVTDIRST EQU   CVTLPDIA
CVTSLIDA EQU   CVTS01+24
CVTCTLFG EQU   CVTS01+50
CVTCSD   EQU   CVTS01+312
CVTRV210 EQU   CVTS01+424
CVTRV219 EQU   CVTS01+425
CVTRV228 EQU   CVTS01+426
CVTRV237 EQU   CVTS01+427
CVTMFRTR EQU   CVTS01+452
CVTRV262 EQU   CVTS01+468
CVTRV271 EQU   CVTS01+469
CVTRV280 EQU   CVTS01+470
CVTRV289 EQU   CVTS01+471
CVTGSDA  EQU   CVTS01+600
IOCOMPTR EQU   CVTIXAVL
FLC      EQU   PSA
PSARSVTE EQU   PSARSVT
UCBOBS01 EQU   UCBDEV
UCBVOLI  EQU   UCBOBS01+4
UCBSTAB  EQU   UCBOBS01+10
UCBBSVL  EQU   UCBSTAB
UCBPRSRS EQU   UCBSTAB
UCBBPRV  EQU   UCBSTAB
UCBBPUB  EQU   UCBSTAB
UCBBSTR  EQU   UCBSTAB
UCBBNUL  EQU   UCBSTAB
UCBDMCT  EQU   UCBOBS01+11
UCBFL4   EQU   UCBOBS01+13
UCBOBS02 EQU   UCBDEV
UCBFSCT  EQU   UCBOBS02
UCBFSEQ  EQU   UCBOBS02+2
UCBFSER  EQU   UCBOBS02+12
UCBTFL1  EQU   UCBOBS02+19
UCBNLTP  EQU   UCBTFL1
UCBNSLTP EQU   UCBTFL1
UCBXTN   EQU   UCBOBS02+20
UCBVOPT  EQU   UCBXTN
UCBOBS03 EQU   UCBDEV
UCBXTADR EQU   UCBOBS03
UCBOBS04 EQU   UCBDEV
UCBBTA   EQU   UCBOBS04+12
UCBOBS06 EQU   UCBDEV
UCBAOF   EQU   UCBOBS06
UCBAOF1  EQU   UCBAOF
UCBAOF2  EQU   UCBAOF+1
@NM00041 EQU   UCBOBS06+3
UCBIRB   EQU   UCBOBS06+4
UCBGRAF  EQU   UCBIRB
UCBLDNCA EQU   UCBOBS06+8
UCBRDYQ  EQU   UCBLDNCA
UCBIRLN  EQU   UCBRDYQ
UCBLDNCB EQU   UCBRDYQ+1
UCBCTLNK EQU   UCBOBS06+12
UCBOBS07 EQU   UCBDEV
UCBOBS08 EQU   UCBDEV
UCBOBS09 EQU   UCBDEV
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS
UCBRV066 EQU   UCBOBS09+4
UCBIOSBA EQU   UCBOBS09
UCBRV042 EQU   UCBOBS08+5
UCBCTCF1 EQU   UCBOBS08+4
UCBCTCAD EQU   UCBOBS08
UCBICNCB EQU   UCBOBS07+4
UCBRV040 EQU   UCBOBS07
UCBCTLNA EQU   UCBCTLNK+1
UCBRLN   EQU   UCBCTLNK
UCBRDYQA EQU   UCBLDNCB
UCBINRLN EQU   UCBIRLN
UCBIRBA  EQU   UCBIRB+1
UCBRV039 EQU   UCBGRAF
UCBDWNR  EQU   UCBGRAF
UCBRPND  EQU   UCBGRAF
UCBUPM   EQU   UCBGRAF
UCBBTAM  EQU   UCBGRAF
UCBDRNO  EQU   UCBGRAF
UCBDRO   EQU   UCBGRAF
UCBOIP   EQU   UCBGRAF
UCBATRCD EQU   @NM00041
UCBSKPFG EQU   @NM00041
UCBRIPND EQU   @NM00041
UCBRTIAC EQU   @NM00041
UCBRSV79 EQU   @NM00041
UCBRSV78 EQU   @NM00041
UCBRSV77 EQU   @NM00041
UCBOLTEP EQU   @NM00041
UCBATNCT EQU   UCBOBS06+2
UCBRSV76 EQU   UCBAOF2
UCBRSV75 EQU   UCBAOF2
UCBRSV74 EQU   UCBAOF2
UCBRSV73 EQU   UCBAOF2
UCBRSV72 EQU   UCBAOF2
UCBRSV71 EQU   UCBAOF2
UCBRSV70 EQU   UCBAOF2
UCBRSV69 EQU   UCBAOF2
UCBRSV68 EQU   UCBAOF1
UCBRSV67 EQU   UCBAOF1
UCBRSV66 EQU   UCBAOF1
UCBRSV65 EQU   UCBAOF1
UCBRSV64 EQU   UCBAOF1
UCBOFNL  EQU   UCBAOF1
UCBOFSP  EQU   UCBAOF1
UCBOFMCR EQU   UCBAOF1
UCBBTB   EQU   UCBBTA+1
UCBDI    EQU   UCBBTA
UCBSNS   EQU   UCBOBS04+8
UCBTEB   EQU   UCBOBS04+4
UCBGCB   EQU   UCBOBS04+3
UCBOPEN  EQU   UCBOBS04+2
UCBSTART EQU   UCBOBS04
UCBXTNB  EQU   UCBXTN+1
UCBRSV22 EQU   UCBVOPT
UCBRSV21 EQU   UCBVOPT
UCBRSV20 EQU   UCBVOPT
UCBESVE  EQU   UCBVOPT
UCBERPC  EQU   UCBVOPT
UCBESVC  EQU   UCBVOPT
UCBEVA   EQU   UCBVOPT
UCBESV   EQU   UCBVOPT
UCBRV009 EQU   UCBTFL1
UCBRV008 EQU   UCBTFL1
UCBRV007 EQU   UCBTFL1
UCBRV006 EQU   UCBTFL1
UCBRV005 EQU   UCBTFL1
UCBRV038 EQU   UCBTFL1
UCBRES1B EQU   UCBOBS02+18
@NM00040 EQU   UCBOBS02+4
UCBNEXP  EQU   UCBOBS01+20
UCBBASE  EQU   UCBOBS01+16
UCBRES1A EQU   UCBOBS01+15
UCBUSER  EQU   UCBOBS01+14
UCBFL47  EQU   UCBFL4
UCBFL46  EQU   UCBFL4
UCBFL45  EQU   UCBFL4
UCBRV065 EQU   UCBFL4
UCBDSS   EQU   UCBFL4
UCBRV028 EQU   UCBFL4
UCBWDAV  EQU   UCBFL4
UCBDAVV  EQU   UCBFL4
UCBSQC   EQU   UCBOBS01+12
UCBDATP  EQU   UCBOBS01+12
UCBDMC   EQU   UCBDMCT
UCBMOUNT EQU   UCBDMCT
UCBSHAR  EQU   UCBSTAB
UCBBALB  EQU   UCBPRSRS
UCBPGFL  EQU   UCBSTAB
UCBDVSHR EQU   UCBBSVL
UCBVTOC  EQU   UCBOBS01
PSARSAV  EQU   PSARSVTE+60
PSARSTK  EQU   PSARSVTE+56
PSAESAV3 EQU   PSARSVTE+52
PSAESTK3 EQU   PSARSVTE+48
PSAESAV2 EQU   PSARSVTE+44
PSAESTK2 EQU   PSARSVTE+40
PSAESAV1 EQU   PSARSVTE+36
PSAESTK1 EQU   PSARSVTE+32
PSAPSAV  EQU   PSARSVTE+28
PSAPSTK  EQU   PSARSVTE+24
PSAMSAV  EQU   PSARSVTE+20
PSAMSTK  EQU   PSARSVTE+16
PSASSAV  EQU   PSARSVTE+12
PSASSTK  EQU   PSARSVTE+8
PSANSTK  EQU   PSARSVTE+4
PSACSTK  EQU   PSARSVTE
CVTRV628 EQU   CVTS01+728
CVTRV627 EQU   CVTS01+724
CVTRV626 EQU   CVTS01+720
CVTRV625 EQU   CVTS01+716
CVTRV624 EQU   CVTS01+712
CVTRV623 EQU   CVTS01+708
CVTRV622 EQU   CVTS01+704
CVTRV621 EQU   CVTS01+700
CVTRV620 EQU   CVTS01+696
CVTRV619 EQU   CVTS01+692
CVTRV618 EQU   CVTS01+688
CVTRV617 EQU   CVTS01+684
CVTRV616 EQU   CVTS01+680
CVTRV615 EQU   CVTS01+676
CVTRV614 EQU   CVTS01+672
CVTRV613 EQU   CVTS01+668
CVTRV612 EQU   CVTS01+664
CVTRV611 EQU   CVTS01+660
CVTRV610 EQU   CVTS01+656
CVTRV609 EQU   CVTS01+652
CVTRV608 EQU   CVTS01+648
CVTRV607 EQU   CVTS01+644
CVTRV606 EQU   CVTS01+640
CVTRV605 EQU   CVTS01+636
CVTRV604 EQU   CVTS01+632
CVTEFF02 EQU   CVTS01+628
CVTCBBR  EQU   CVTS01+624
CVTSSCR  EQU   CVTS01+620
CVTEVENT EQU   CVTS01+616
CVTCRCA  EQU   CVTS01+612
CVTTPIO  EQU   CVTS01+608
CVTADV   EQU   CVTS01+604
CVTGSDAB EQU   CVTGSDA
CVTQV3   EQU   CVTS01+596
CVTQV2   EQU   CVTS01+592
CVTQV1   EQU   CVTS01+588
CVTRPT   EQU   CVTS01+584
CVTSSRB  EQU   CVTS01+580
CVTCSDRL EQU   CVTS01+576
CVTEXP1  EQU   CVTS01+572
CVTRMPMT EQU   CVTS01+568
CVTRMPTT EQU   CVTS01+564
CVTVPSA  EQU   CVTS01+560
CVTVSTOP EQU   CVTS01+556
CVTGTFR8 EQU   CVTS01+552
CVTQUIT  EQU   CVTS01+548
CVTVACR  EQU   CVTS01+544
CVTWTCB  EQU   CVTS01+540
CVTSTPRS EQU   CVTS01+536
CVT0PT02 EQU   CVTS01+532
CVTDARCM EQU   CVTS01+528
CVTIRECM EQU   CVTS01+524
CVTJRECM EQU   CVTS01+520
CVTVEMS0 EQU   CVTS01+516
CVTSPFRR EQU   CVTS01+512
CVTRLSTG EQU   CVTS01+508
CVT0TC0A EQU   CVTS01+504
CVTGMBR  EQU   CVTS01+500
CVTLFRM  EQU   CVTS01+496
CVTRMBR  EQU   CVTS01+492
CVTVIOP  EQU   CVTS01+488
CVTRV307 EQU   CVTS01+486
CVTRV306 EQU   CVTS01+484
CVTRV305 EQU   CVTS01+482
CVTRV304 EQU   CVTS01+480
CVTRV303 EQU   CVTS01+478
CVTRV302 EQU   CVTS01+476
CVTTRCA  EQU   CVTS01+472
CVTRV297 EQU   CVTRV289
CVTRV296 EQU   CVTRV289
CVTRV295 EQU   CVTRV289
CVTRV294 EQU   CVTRV289
CVTRV293 EQU   CVTRV289
CVTRV292 EQU   CVTRV289
CVTRV291 EQU   CVTRV289
CVTRV290 EQU   CVTRV289
CVTRV288 EQU   CVTRV280
CVTRV287 EQU   CVTRV280
CVTRV286 EQU   CVTRV280
CVTRV285 EQU   CVTRV280
CVTRV284 EQU   CVTRV280
CVTRV283 EQU   CVTRV280
CVTRV282 EQU   CVTRV280
CVTRV281 EQU   CVTRV280
CVTRV279 EQU   CVTRV271
CVTRV278 EQU   CVTRV271
CVTRV277 EQU   CVTRV271
CVTRV276 EQU   CVTRV271
CVTRV275 EQU   CVTRV271
CVTRV274 EQU   CVTRV271
CVTRV273 EQU   CVTRV271
CVTRV272 EQU   CVTRV271
CVTRV270 EQU   CVTRV262
CVTRV269 EQU   CVTRV262
CVTRV268 EQU   CVTRV262
CVTRV267 EQU   CVTRV262
CVTRV266 EQU   CVTRV262
CVTRV265 EQU   CVTRV262
CVTRV264 EQU   CVTRV262
CVTRV263 EQU   CVTRV262
CVTVFP   EQU   CVTS01+464
CVTVSI   EQU   CVTS01+460
CVTVPSIB EQU   CVTS01+456
CVTMFACT EQU   CVTMFRTR
CVTMFCTL EQU   CVTS01+448
CVTPVBP  EQU   CVTS01+444
CVTPWI   EQU   CVTS01+440
CVTRV254 EQU   CVTS01+438
CVTRV253 EQU   CVTS01+436
CVTRV252 EQU   CVTS01+434
CVTRV251 EQU   CVTS01+433
CVTRV250 EQU   CVTS01+432
CVTRV249 EQU   CVTS01+431
CVTRV248 EQU   CVTS01+430
CVTRV247 EQU   CVTS01+429
CVTRV246 EQU   CVTS01+428
CVTRV245 EQU   CVTRV237
CVTRV244 EQU   CVTRV237
CVTRV243 EQU   CVTRV237
CVTRV242 EQU   CVTRV237
CVTRV241 EQU   CVTRV237
CVTRV240 EQU   CVTRV237
CVTRV239 EQU   CVTRV237
CVTRV238 EQU   CVTRV237
CVTRV236 EQU   CVTRV228
CVTRV235 EQU   CVTRV228
CVTRV234 EQU   CVTRV228
CVTRV233 EQU   CVTRV228
CVTRV232 EQU   CVTRV228
CVTRV231 EQU   CVTRV228
CVTRV230 EQU   CVTRV228
CVTRV229 EQU   CVTRV228
CVTRV227 EQU   CVTRV219
CVTRV226 EQU   CVTRV219
CVTRV225 EQU   CVTRV219
CVTRV224 EQU   CVTRV219
CVTRV223 EQU   CVTRV219
CVTRV222 EQU   CVTRV219
CVTRV221 EQU   CVTRV219
CVTRV220 EQU   CVTRV219
CVTRV218 EQU   CVTRV210
CVTRV217 EQU   CVTRV210
CVTRV216 EQU   CVTRV210
CVTRV215 EQU   CVTRV210
CVTRV214 EQU   CVTRV210
CVTRV213 EQU   CVTRV210
CVTRV212 EQU   CVTRV210
CVTRV211 EQU   CVTRV210
CVTLCCAT EQU   CVTS01+420
CVTPCCAT EQU   CVTS01+416
CVTIPCRP EQU   CVTS01+412
CVTIPCRI EQU   CVTS01+408
CVTIPCDS EQU   CVTS01+404
CVTAIDVT EQU   CVTS01+400
CVTSSAP  EQU   CVTS01+396
CVTEHCIR EQU   CVTS01+392
CVTEHDEF EQU   CVTS01+388
CVTDAIR  EQU   CVTS01+384
CVTPERFM EQU   CVTS01+380
CVT044R2 EQU   CVTS01+376
CVTFETCH EQU   CVTS01+372
CVTRSTWD EQU   CVTS01+368
CVTSPOST EQU   CVTS01+364
CVTIOBP  EQU   CVTS01+360
CVTASMVT EQU   CVTS01+356
CVTRECRQ EQU   CVTS01+352
CVTWSAC  EQU   CVTS01+348
CVTRV149 EQU   CVTS01+344
CVTWSAL  EQU   CVTS01+340
CVTSPSA  EQU   CVTS01+336
CVTGLMN  EQU   CVTS01+332
CVTVEAC0 EQU   CVTS01+328
CVT062R1 EQU   CVTS01+324
CVTRPOST EQU   CVTS01+320
CVTDQIQE EQU   CVTS01+316
CVTLKRMA EQU   CVTS01+308
CVTRSPIE EQU   CVTS01+304
CVTRENQ  EQU   CVTS01+300
CVTLQCB  EQU   CVTS01+296
CVTFQCB  EQU   CVTS01+292
CVTQCS01 EQU   CVTS01+288
CVTAPFT  EQU   CVTS01+284
CVTPARRL EQU   CVTS01+280
CVTVWAIT EQU   CVTS01+276
CVTGSPL  EQU   CVTS01+272
CVTLSMQ  EQU   CVTS01+268
CVTGSMQ  EQU   CVTS01+264
CVTEXPRO EQU   CVTS01+260
CVTOPCTP EQU   CVTS01+256
CVTSIC   EQU   CVTS01+252
CVTTPIOS EQU   CVTS01+248
CVTRTMS  EQU   CVTS01+244
CVTSDBF  EQU   CVTS01+240
CVTSCBP  EQU   CVTS01+236
CVTSDMP  EQU   CVTS01+232
CVTSV60  EQU   CVTS01+228
CVTRTMCT EQU   CVTS01+224
CVTASCBL EQU   CVTS01+220
CVTASCBH EQU   CVTS01+216
CVTGDA   EQU   CVTS01+212
CVTASVT  EQU   CVTS01+208
CVTVVMDI EQU   CVTS01+204
CVTAQTOP EQU   CVTS01+200
CVTIOSCS EQU   CVTS01+196
CVTSDRM  EQU   CVTS01+192
CVTOPTE  EQU   CVTS01+188
CVTSTXU  EQU   CVTS01+184
CVTQUIS  EQU   CVTS01+180
CVTPARS  EQU   CVTS01+176
CVTS1EE  EQU   CVTS01+172
CVTFRAS  EQU   CVTS01+168
CVTQSAS  EQU   CVTS01+164
CVTCRAS  EQU   CVTS01+160
CVTCRMN  EQU   CVTS01+156
CVTDELCP EQU   CVTS01+152
CVTFRECL EQU   CVTS01+148
CVTGETCL EQU   CVTS01+144
CVTBLDCP EQU   CVTS01+140
CVTAUTHL EQU   CVTS01+136
CVTSCAN  EQU   CVTS01+132
CVTRV144 EQU   CVTS01+130
CVTMAXMP EQU   CVTS01+128
CVTSTCK  EQU   CVTS01+124
CVTRV139 EQU   CVTS01+123
CVTDSSAC EQU   CVTS01+122
CVTRV513 EQU   CVTS01+121
CVTIOSPL EQU   CVTS01+120
CVTPTGT  EQU   CVTS01+116
CVTCSPIE EQU   CVTS01+112
CVTSMFEX EQU   CVTS01+108
CVTOLT0A EQU   CVTS01+104
CVTSRBRT EQU   CVTS01+100
CVTPUTL  EQU   CVTS01+96
CVTRV519 EQU   CVTS01+92
CVTRV327 EQU   CVTS01+88
CVTRV326 EQU   CVTS01+84
CVTRV325 EQU   CVTS01+80
CVTRV324 EQU   CVTS01+76
CVT0VL01 EQU   CVTS01+72
CVTSHRVM EQU   CVTS01+68
CVTRV332 EQU   CVTS01+64
CVTTAS   EQU   CVTS01+60
CVTRSCN  EQU   CVTS01+56
CVTTRAC2 EQU   CVTS01+54
CVTTRACE EQU   CVTS01+52
CVTAPG   EQU   CVTS01+51
CVTSDTRC EQU   CVTCTLFG
CVTGTRCE EQU   CVTCTLFG
CVTNOMP  EQU   CVTCTLFG
CVTRSV79 EQU   CVTCTLFG
CVTDSTAT EQU   CVTCTLFG
CVTRSV78 EQU   CVTCTLFG
CVTRV333 EQU   CVTCTLFG
CVTRV323 EQU   CVTCTLFG
CVTSPVLK EQU   CVTS01+49
CVTRSV77 EQU   CVTS01+48
CVTRV331 EQU   CVTS01+44
CVTRV330 EQU   CVTS01+40
CVTRV329 EQU   CVTS01+36
CVTRV328 EQU   CVTS01+32
CVTRV322 EQU   CVTS01+28
CVTSLID  EQU   CVTSLIDA+1
CVTSYLK  EQU   CVTSLIDA
CVTRV321 EQU   CVTS01+20
CVTRV320 EQU   CVTS01+16
CVTLPDIR EQU   CVTLPDIA+1
CVTRSV69 EQU   CVTDIRST
CVTRSV68 EQU   CVTDIRST
CVTRSV67 EQU   CVTDIRST
CVTRSV66 EQU   CVTDIRST
CVTRSV65 EQU   CVTDIRST
CVTRSV64 EQU   CVTDIRST
CVTRSV63 EQU   CVTDIRST
CVTDICOM EQU   CVTDIRST
CVTPVTP  EQU   CVTS01+8
CVTLPDSR EQU   CVTS01+4
CVTGETL  EQU   CVTS01
SSDRUCBL EQU   SSDR+12
SSDR4SWP EQU   SSDRFLG2
@NM00044 EQU   SSDRFLG2
SSDRFLG1 EQU   SSDR+2
SSDRLEN  EQU   SSDR
SSOBRETN EQU   SSOB+12
SSOBSSIB EQU   SSOB+8
SSOBLEN  EQU   SSOB+4
SSOBID   EQU   SSOB
JESPJESN EQU   JESCT+28
JESSSCT  EQU   JESCT+24
JESRESQM EQU   JESCT+16
JESQMGR  EQU   JESCT+12
JESUNITS EQU   JESCT+4
@NM00043 EQU   JESCT
UCBERADR EQU   UCBUCS+12
UCBFCBID EQU   UCBUCS+8
UCBERCNT EQU   UCBUCS+7
UCBRSV51 EQU   UCBUCS+6
UCBRSV50 EQU   UCBFCBOP
UCBRSV49 EQU   UCBFCBOP
UCBRSV48 EQU   UCBFCBOP
UCBRSV47 EQU   UCBFCBOP
UCBRSV46 EQU   UCBFCBOP
UCBRSV45 EQU   UCBFCBOP
UCBRSV44 EQU   UCBFCBOP
UCBFCBO1 EQU   UCBFCBOP
UCBUCSPE EQU   UCBUCSOP
UCBRSV43 EQU   UCBUCSOP
UCBRSV42 EQU   UCBUCSOP
UCBRSV41 EQU   UCBUCSOP
UCBRSV40 EQU   UCBUCSOP
UCBRSV39 EQU   UCBUCSOP
UCBUCSO2 EQU   UCBUCSOP
UCBUCSO1 EQU   UCBUCSOP
UCBUCSID EQU   UCBUCS
UCBRV073 EQU   UCB3540X+7
UCBRV072 EQU   UCBDKBYT
UCBRV071 EQU   UCBDKBYT
UCBRV070 EQU   UCBDKBYT
UCBRV069 EQU   UCBDKBYT
UCBRV068 EQU   UCBDKBYT
UCBRV067 EQU   UCBDKBYT
UCBVLVER EQU   UCBDKBYT
UCBDKAMX EQU   UCBDKBYT
UCBVLSER EQU   UCB3540X
UCBRDATA EQU   UCBOCR+4
UCBFRID  EQU   UCBOCR
UCBCLN   EQU   UCBMT+14
UCBERG   EQU   UCBMT+12
UCBMS    EQU   UCBMT+11
UCBNB    EQU   UCBMT+10
UCBPW    EQU   UCBMT+9
UCBPR    EQU   UCBMT+8
UCBSIO   EQU   UCBMT+6
UCBTW    EQU   UCBMT+5
UCBTR    EQU   UCBMT+4
UCBTWT   EQU   UCBMT+3
UCBTRT   EQU   UCBMT+2
UCBCTD   EQU   UCBMT
UCBWTOID EQU   UCBCMEXT+17
UCBRV043 EQU   UCBCMEXT+16
UCBRV041 EQU   UCBCMEXT+6
UCBRV036 EQU   UCBFLP1
UCBRV035 EQU   UCBFLP1
UCBRV034 EQU   UCBFLP1
UCBRV033 EQU   UCBFLP1
UCBRV032 EQU   UCBFLP1
UCBRV031 EQU   UCBFLP1
UCBSHRUP EQU   UCBFLP1
UCBHPDV  EQU   @NM00042
UCBHALI  EQU   @NM00042
UCBRSV09 EQU   @NM00042
UCBRSV08 EQU   @NM00042
UCBRSV07 EQU   @NM00042
UCBRSV06 EQU   @NM00042
UCBRSV05 EQU   @NM00042
UCBRSV04 EQU   @NM00042
UCBEXTP  EQU   UCBEXTPT+1
UCBDDRSW EQU   UCBFLC
UCBTICBT EQU   UCBFLC
UCBIVRR  EQU   UCBFLC
UCBIVRS  EQU   UCBFLC
UCBITF   EQU   UCBFLC
UCBUDE   EQU   UCBFLC
UCBWAA   EQU   UCBFLC
UCBATTP  EQU   UCBFLC
UCBUNTYP EQU   UCBTBYT4
UCBRSV11 EQU   UCBDVCLS
UCBRSV10 EQU   UCBDVCLS
UCB3CHAR EQU   UCBDVCLS
UCB3UREC EQU   UCBDVCLS
UCB3DISP EQU   UCBDVCLS
UCB3DACC EQU   UCBDVCLS
UCB3COMM EQU   UCBDVCLS
UCB3TAPE EQU   UCBDVCLS
UCBDVPWR EQU   UCB2OPT7
UCBVLPWR EQU   UCB2OPT6
UCB2OPT5 EQU   UCBTBYT2
UCBRVDEV EQU   UCBRWTAU
UCBRPS   EQU   UCBDUDN2
UCBRR    EQU   UCBDUDN1
UCB2OPT1 EQU   UCBTBYT2
UCB2OPT0 EQU   UCBTBYT2
UCB1FEA7 EQU   UCBTBYT1
UCBD6250 EQU   UCB1FEA6
UCBD1600 EQU   UCB1FEA5
UCB1FEA4 EQU   UCBTBYT1
UCB1FEA3 EQU   UCBTBYT1
UCB1FEA2 EQU   UCBTBYT1
UCB1FEA1 EQU   UCBTBYT1
UCB1FEA0 EQU   UCBTBYT1
UCBRV029 EQU   UCBWGT
UCBVHRSN EQU   UCBWGT
UCBVORSN EQU   UCBWGT
UCBMTPXP EQU   UCBWGT
UCBREW   EQU   UCBWGT
UCBPUB   EQU   UCBWGT
UCBOUT   EQU   UCBWGT
UCBIN    EQU   UCBWGT
UCBRV017 EQU   UCBCHM1
UCBRV016 EQU   UCBCHM1
UCBRV015 EQU   UCBCHM1
UCBRV014 EQU   UCBCHM1
UCBSPB   EQU   UCBPTH1
UCBPPB   EQU   UCBPTH1
UCBSPA   EQU   UCBPTH0
UCBPPA   EQU   UCBPTH0
UCBFLB7  EQU   UCBFLB
UCBVALPH EQU   UCBFLB
UCBCRHSN EQU   UCBFLB
UCBCRHRV EQU   UCBFLB
UCBRESVH EQU   UCBFLB
UCBSPST  EQU   UCBFLB
UCBASNS  EQU   UCBFLB
UCBIORST EQU   UCBFLB
UCBQISCE EQU   UCBFL1
UCBACTV  EQU   UCBFL1
UCBSAP   EQU   UCBFL1
UCBNOTRC EQU   UCBCUB
UCBPSNS  EQU   UCBFL1
UCBUSING EQU   UCBPST
UCBNOTRD EQU   UCBNRY
UCBBUSYD EQU   UCBBSY
UCBUA    EQU   UCBCHAN+1
UCBCHA   EQU   UCBCHAN
UCBSYSR  EQU   UCBSTAT
UCBPRES  EQU   UCBSTAT
UCBALOC  EQU   UCBSTAT
UCBCHGS  EQU   UCBSTAT
UCBONLI  EQU   UCBSTAT
UCBID    EQU   UCBOB+2
UCBALTPH EQU   UCBFL5
UCBALTCU EQU   UCBFL5
UCBNALOC EQU   UCBFL5
UCBENVRD EQU   UCBFL5
UCBVSDR  EQU   UCBFL5
UCBSASK  EQU   UCBFL5
UCBAMV   EQU   UCBAF
UCBDCC   EQU   UCBFL5
UCBRV011 EQU   UCBJBNR
UCBRSV02 EQU   UCBJBNR
UCBOLDSM EQU   UCBJBNR
UCBRV003 EQU   UCBJBNR
UCBRV002 EQU   UCBJBNR
UCBJES3  EQU   UCBJBNR
UCBVRDEV EQU   UCBJBNR
UCBCMSEG EQU   UCBOB
UCBPFXND EQU   UCB+512
UCBLOCK  EQU   UCB+504
UCBPXST  EQU   UCB+504
@NM00039 EQU   UCB
ECBEVTBA EQU   ECBRBA
@NM00038 EQU   ECBCC
ECBPOSTB EQU   ECBEVNT
ECBWAITB EQU   ECBEVNT
@NM00013 EQU   CSD+160
CSDMASK  EQU   CSD+128
CSDUCNT  EQU   CSD+124
CSDTCNT  EQU   CSD+120
CSDGDTOD EQU   CSD+116
CSDGDINT EQU   CSD+112
CSDGDCC  EQU   CSD+108
CSDRV044 EQU   CSD+104
CSDMAFF  EQU   CSD+24
CSDRV038 EQU   CSDFLAGS
CSDRV037 EQU   CSDFLAGS
CSDRV036 EQU   CSDFLAGS
CSDRV035 EQU   CSDFLAGS
CSDRV034 EQU   CSDFLAGS
CSDRV033 EQU   CSDFLAGS
CSDRV032 EQU   CSDFLAGS
CSDMP    EQU   CSDFLAGS
CSDACR   EQU   CSD+22
CSDMF1CP EQU   CSD+20
CSDRV043 EQU   CSD+16
CSDRV030 EQU   CSDSCFL4
CSDRV029 EQU   CSDSCFL4
CSDRV028 EQU   CSDSCFL4
CSDRV027 EQU   CSDSCFL4
CSDRV026 EQU   CSDSCFL4
CSDRV025 EQU   CSDSCFL4
CSDRV024 EQU   CSDSCFL4
CSDRV023 EQU   CSDSCFL4
CSDRV022 EQU   CSDSCFL3
CSDRV021 EQU   CSDSCFL3
CSDRV020 EQU   CSDSCFL3
CSDRV019 EQU   CSDSCFL3
CSDRV018 EQU   CSDSCFL3
CSDRV017 EQU   CSDSCFL3
CSDRV016 EQU   CSDSCFL3
CSDRV015 EQU   CSDSCFL3
CSDRV014 EQU   CSDSCFL2
CSDRV013 EQU   CSDSCFL2
CSDRV012 EQU   CSDSCFL2
CSDRV011 EQU   CSDSCFL2
CSDRV010 EQU   CSDSCFL2
CSDRV009 EQU   CSDSCFL2
CSDRV008 EQU   CSDSCFL2
CSDRV007 EQU   CSDSCFL2
CSDRV006 EQU   CSDSCFL1
CSDRV005 EQU   CSDSCFL1
CSDRV004 EQU   CSDSCFL1
CSDRV003 EQU   CSDSCFL1
CSDRV002 EQU   CSDSCFL1
CSDRV001 EQU   CSDSCFL1
CSDSYSND EQU   CSDSCFL1
CSDRV042 EQU   CSDSCFL1
CSDCPUOL EQU   CSD+10
CSDSAFF  EQU   CSDCPUAL
CSDCHAD  EQU   CSD+6
CSDCPUJS EQU   CSD+4
CSDCSD   EQU   CSD
DDRUBCNT EQU   DDRLONG+72
@NM00012 EQU   DDRUSER+1
DDRUMODE EQU   DDRUSER
@NM00011 EQU   DDRREC2
DDRRFMTO EQU   DDRREC2
DDRRETRY EQU   DDRLONG+65
DDRLNOP  EQU   DDRLABEL
@NM00010 EQU   DDRLABEL
DDRLSD   EQU   DDRLABEL
DDRLNSL  EQU   DDRLABEL
DDRLNL   EQU   DDRLABEL
DDRLBLP  EQU   DDRLABEL
DDRLAL   EQU   DDRLABEL
DDRMSGPC EQU   DDRMSGP+1
DDRMSGPN EQU   DDRMSGP
DDRMSGCD EQU   DDRMSG+1
DDRMSGOP EQU   DDRMSG
@NM00009 EQU   DDRIOF2
DDRICNT  EQU   DDRIOF2
DDRIMNT  EQU   DDRIOF2
DDRILAB  EQU   DDRIOF2
DDRITAKE EQU   DDRIOF2
DDRCOUNT EQU   DDRLONG+48
DDRIBUF  EQU   DDRLONG+44
DDRIBUFL EQU   DDRLONG+42
DDRAPP2  EQU   DDRAPP+1
DDRAPP1  EQU   DDRAPP
DDRINV2  EQU   DDRINV+1
DDRINV1  EQU   DDRINV
DDRTER2  EQU   DDRTER+1
DDRTEST  EQU   DDRLONG+32
DDRUASCB EQU   DDRLONG+28
DDRUTCB  EQU   DDRLONG+24
DDRUIOB  EQU   DDRLONG+20
DDRUDEB  EQU   DDRMIHT+4
DDRUDCB  EQU   DDRMIHT
DDRASID  EQU   DDRLONG+10
DDRMIH   EQU   DDRLONG+9
DDRFIRST EQU   DDRROWN
DDRJES3L EQU   DDRROWN
@NM00008 EQU   DDRROWN
DDRRDENQ EQU   DDRROWN
DDRRUENQ EQU   DDRROWN
DDRRTENQ EQU   DDRROWN
DDRTOCUA EQU   DDRSHORT+21
DDRFMCUA EQU   DDRSHORT+18
DDRUASID EQU   DDRSHORT+16
DDRUIOSB EQU   DDRSHORT+12
@NM00007 EQU   DDRDSTAT
DDRUR    EQU   DDRDSTAT
DDRDA    EQU   DDRDSTAT
DDRBUFL  EQU   DDRDSTAT
DDRMDR   EQU   DDRDCHAR
@NM00006 EQU   DDRSTAT
DDRSIRB  EQU   DDRSTAT
DDRPRG   EQU   DDRSTAT
DDRRMV   EQU   DDRSTAT
DDRHAMA  EQU   DDRSTAT
DDRQUE   EQU   DDRSTAT
DDRACTV  EQU   DDRSTAT
@NM00005 EQU   DDRSRC
DDRPAGE  EQU   DDRSRC
DDRSYS   EQU   DDRSRC
DDROPER  EQU   DDRSRC
DDRNXT   EQU   DDRSHORT+4
DDRID    EQU   DDRSHORT
IOCOEND  EQU   IOCOM+128
IOCPATCH EQU   IOCOM+124
IOCUCBBM EQU   IOCOM+120
IOCQCNT  EQU   IOCOM+116
IOCIOSDQ EQU   IOCOM+112
IOCIOSEQ EQU   IOCOM+108
IOCSVCF  EQU   IOCOM+104
IOCTCCW  EQU   IOCOM+100
IOCRSVTB EQU   IOCOM+96
IOCMFCNT EQU   IOCOM+92
IOCMFHK  EQU   IOCOM+88
IOCCCH   EQU   IOCOM+80
IOCASYNQ EQU   IOCOM+76
IOCLCHTB EQU   IOCOM+72
IOCATTBL EQU   IOCOM+68
IOCOMEX  EQU   IOCOM+64
IOCSYNCH EQU   IOCOM+56
IOCCATLK EQU   IOCOM+48
IOCPRGID EQU   IOCOM+44
IOCIOSCP EQU   IOCOM+40
IOCORMGT EQU   IOCOM+36
IOCVOID  EQU   IOCOM+32
IOCSTIO  EQU   IOCOM+28
@NM00004 EQU   IOCOM+24
@NM00003 EQU   IOCOM+20
IOCINT   EQU   IOCOM+16
IOCCTBL  EQU   IOCOM+12
IOCHIO   EQU   IOCOM+8
IOCPST   EQU   IOCOM+4
IOCPGCT  EQU   IOCOM+2
IOCVOICT EQU   IOCOM
CVTLEVL  EQU   CVTRELNO+2
CVTNUMB  EQU   CVTRELNO
CVTMDL   EQU   CVTFIX+250
@NM00002 EQU   CVTFIX+248
@NM00001 EQU   CVTFIX
CVTRV482 EQU   CVTXTNT2+128
CVTRV481 EQU   CVTXTNT2+124
CVTRV480 EQU   CVTXTNT2+120
CVTRV479 EQU   CVTXTNT2+118
CVTRV478 EQU   CVTXTNT2+117
CVTRV477 EQU   CVTXTNT2+116
CVTRV476 EQU   CVTXTNT2+115
CVTRV475 EQU   CVTXTNT2+114
CVTRV474 EQU   CVTRV466
CVTRV473 EQU   CVTRV466
CVTRV472 EQU   CVTRV466
CVTRV471 EQU   CVTRV466
CVTRV470 EQU   CVTRV466
CVTRV469 EQU   CVTRV466
CVTRV468 EQU   CVTRV466
CVTRV467 EQU   CVTRV466
CVTRV465 EQU   CVTRV457
CVTRV464 EQU   CVTRV457
CVTRV463 EQU   CVTRV457
CVTRV462 EQU   CVTRV457
CVTRV461 EQU   CVTRV457
CVTRV460 EQU   CVTRV457
CVTRV459 EQU   CVTRV457
CVTRV458 EQU   CVTRV457
CVTRV456 EQU   CVTXTNT2+108
CVTRV455 EQU   CVTXTNT2+104
CVTRV454 EQU   CVTXTNT2+100
CVTRV453 EQU   CVTXTNT2+96
CVTRV452 EQU   CVTXTNT2+94
CVTRV451 EQU   CVTXTNT2+92
CVTRV450 EQU   CVTXTNT2+90
CVTRV449 EQU   CVTXTNT2+88
CVTRV448 EQU   CVTXTNT2+87
CVTRV447 EQU   CVTXTNT2+86
CVTRV446 EQU   CVTRV438
CVTRV445 EQU   CVTRV438
CVTRV444 EQU   CVTRV438
CVTRV443 EQU   CVTRV438
CVTRV442 EQU   CVTRV438
CVTRV441 EQU   CVTRV438
CVTRV440 EQU   CVTRV438
CVTRV439 EQU   CVTRV438
CVTRV437 EQU   CVTRV429
CVTRV436 EQU   CVTRV429
CVTRV435 EQU   CVTRV429
CVTRV434 EQU   CVTRV429
CVTRV433 EQU   CVTRV429
CVTRV432 EQU   CVTRV429
CVTRV431 EQU   CVTRV429
CVTRV430 EQU   CVTRV429
CVTRV428 EQU   CVTXTNT2+80
CVTRV427 EQU   CVTXTNT2+76
CVTRV426 EQU   CVTXTNT2+72
CVTRV425 EQU   CVTXTNT2+68
CVTATACT EQU   CVTATCVT
CVTRV423 EQU   CVTXTNT2+62
CVTRV422 EQU   CVTXTNT2+60
CVTRV421 EQU   CVTXTNT2+58
CVTRV420 EQU   CVTXTNT2+56
CVTRV419 EQU   CVTXTNT2+55
CVTRV418 EQU   CVTXTNT2+54
CVTRV417 EQU   CVTRV409
CVTRV416 EQU   CVTRV409
CVTRV415 EQU   CVTRV409
CVTRV414 EQU   CVTRV409
CVTRV413 EQU   CVTRV409
CVTRV412 EQU   CVTRV409
CVTRV411 EQU   CVTRV409
CVTRV410 EQU   CVTRV409
CVTRV408 EQU   CVTRV400
CVTRV407 EQU   CVTRV400
CVTRV406 EQU   CVTRV400
CVTRV405 EQU   CVTRV400
CVTRV404 EQU   CVTRV400
CVTRV403 EQU   CVTRV400
CVTRV402 EQU   CVTRV400
CVTRV401 EQU   CVTRV400
CVTICB   EQU   CVTXTNT2+48
CVTSKTA  EQU   CVTXTNT2+44
CVTRSV99 EQU   CVTXTNT2+40
CVTRSV98 EQU   CVTXTNT2+36
CVTRSV97 EQU   CVTXTNT2+34
CVTRSV96 EQU   CVTXTNT2+32
CVTOLTEP EQU   CVTXTNT2+28
CVTQIDA  EQU   CVTQID+1
CVTRSV95 EQU   CVTQID
CVTRSV94 EQU   CVTXTNT2+20
CVTRSV93 EQU   CVTXTNT2+16
CVTRSV92 EQU   CVTXTNT2+12
CVTDEBVR EQU   CVTXTNT2+8
CVTRSV91 EQU   CVTXTNT2+6
CVTRSV9H EQU   CVTFLGBT
CVTRSV9G EQU   CVTFLGBT
CVTRSV9F EQU   CVTFLGBT
CVTRSV9E EQU   CVTFLGBT
CVTRSV9D EQU   CVTFLGBT
CVTRSV9C EQU   CVTFLGBT
CVTVME   EQU   CVTFLGBT
CVTNPE   EQU   CVTFLGBT
CVTNUCLS EQU   CVTXTNT2+4
CVTDSSVA EQU   CVTDSSV+1
CVTRSV89 EQU   CVTDSSV
CVTRSV88 EQU   CVTXTNT1+8
CVTRSV87 EQU   CVTXTNT1+4
CVTFACHN EQU   CVTXTNT1
CVTRV488 EQU   CVTMAP+412
CVTRV487 EQU   CVTMAP+408
CVTRV486 EQU   CVTMAP+404
CVTRV485 EQU   CVTMAP+400
CVTACTAP EQU   CVTMAP+396
CVTAUTH  EQU   CVTMAP+392
CVTATMCA EQU   CVTATMCT+1
CVTATMST EQU   CVTATMCT
CVTRSV61 EQU   CVTMAP+384
CVTVOLT1 EQU   CVTVOLM1+1
CVTVOLI1 EQU   CVTVOLF1
CVTSTOA  EQU   CVTMAP+376
CVTRSV58 EQU   CVTMAP+374
CVTRSV57 EQU   CVTMAP+372
CVTDDCE  EQU   CVTMAP+368
CVTPNWFR EQU   CVTMAP+364
CVTSMF   EQU   CVTMAP+360
CVTSULK  EQU   CVTMAP+358
CVTSLKO  EQU   CVTSYSK
CVTSLKP  EQU   CVTSYSK
CVTSLKQ  EQU   CVTSYSK
CVTSLKR  EQU   CVTSYSK
CVTRSV56 EQU   CVTSYSK
CVTRSV55 EQU   CVTSYSK
CVTRSV54 EQU   CVTSYSK
CVTRSV53 EQU   CVTSYSK
CVTRSV52 EQU   CVTA1F1
CVTRSV51 EQU   CVTA1F1
CVTRSV50 EQU   CVTA1F1
CVTRSV49 EQU   CVTA1F1
CVTRSV48 EQU   CVTA1F1
CVTRSV47 EQU   CVTA1F1
CVTSRSW  EQU   CVTA1F1
CVTPFSW  EQU   CVTA1F1
CVTPCVT  EQU   CVTMAP+352
CVTRSV46 EQU   CVTMAP+344
CVTRSV45 EQU   CVTMAP+340
CVTRSV44 EQU   CVTMAP+338
CVTRSV43 EQU   CVTMAP+336
CVTHJESA EQU   CVTHJES+1
CVTRSV42 EQU   CVTHJES
CVTEXT2A EQU   CVTEXT2+1
CVTRSV41 EQU   CVTEXT2
CVTAPFA  EQU   CVTAPF+1
CVTRSV40 EQU   CVTAPF
CVTRV518 EQU   CVTINTLA
CVTRV517 EQU   CVTERPV
CVTEORM  EQU   CVTMAP+312
CVTMCHPR EQU   CVTMAP+308
CVTTZ    EQU   CVTMAP+304
CVTJEPS  EQU   CVTMAP+300
CVTMODE  EQU   CVTMAP+292
CVTPTRV  EQU   CVTMAP+288
CVTREAL  EQU   CVTMAP+284
CVTRSV39 EQU   CVTMAP+280
CVTRSV38 EQU   CVTMAP+276
CVTDMSRA EQU   CVTDMSR+1
CVTRSV37 EQU   CVTDMSR
CVTQMSGA EQU   CVTQMSG+1
CVTRSV36 EQU   CVTQMSG
CVTAMFF  EQU   CVTMAP+264
CVTPURGA EQU   CVTPURG+1
CVTRSV35 EQU   CVTPURG
CVTCBSP  EQU   CVTMAP+256
CVTATERA EQU   CVTATER+1
CVTSYST  EQU   CVTATER
CVTVOLT2 EQU   CVTTAT
CVTVOLI2 EQU   CVTVOLF2
CVTAQAVB EQU   CVTAQAVT+1
CVTRSV34 EQU   CVTTCMFG
CVTRSV33 EQU   CVTTCMFG
CVTRSV32 EQU   CVTTCMFG
CVTRSV31 EQU   CVTTCMFG
CVTRSV30 EQU   CVTTCMFG
CVTRSV29 EQU   CVTTCMFG
CVTRSV28 EQU   CVTTCMFG
CVTTCRDY EQU   CVTTCMFG
CVTGTFA  EQU   CVTGTF+1
CVTRSV27 EQU   CVTGTFST
CVTRNIO  EQU   CVTGTFST
CVTUSR   EQU   CVTGTFST
CVTRV318 EQU   CVTFORM
CVTRV317 EQU   CVTTMODE
CVTRV316 EQU   CVTSTATE
CVTRV315 EQU   CVTGTFS
CVTGTFAV EQU   CVTGTFS
CVT0SCR1 EQU   CVTMAP+232
CVTRV515 EQU   CVTMAP+228
CVTRMS   EQU   CVTMAP+224
CVTPATCH EQU   CVTMAP+220
CVTTSCE  EQU   CVTMAP+216
CVTLNKSC EQU   CVTMAP+214
CVTQABST EQU   CVTMAP+212
CVTMDLDS EQU   CVTMAP+208
CVTUSER  EQU   CVTMAP+204
CVTABEND EQU   CVTMAP+200
CVTSMCA  EQU   CVTMAP+196
CVTRSV18 EQU   CVTMAP+192
CVTQLPAQ EQU   CVTMAP+188
CVTQCDSR EQU   CVTMAP+184
CVTRSV17 EQU   CVTOPTB
CVTRSV16 EQU   CVTOPTB
CVTFP    EQU   CVTOPTB
CVTAPTHR EQU   CVTOPTB
CVTNLOG  EQU   CVTOPTB
CVTTOD   EQU   CVTOPTB
CVTCTIMS EQU   CVTOPTB
CVTPROT  EQU   CVTOPTB
CVTXPFP  EQU   CVTOPTA
CVTASCII EQU   CVTOPTA
CVTRSV13 EQU   CVTOPTA
CVTRSV12 EQU   CVTOPTA
CVTNIP   EQU   CVTOPTA
CVTDDR   EQU   CVTOPTA
CVTAPR   EQU   CVTOPTA
CVTCCH   EQU   CVTOPTA
CVTSNCTR EQU   CVTMAP+180
CVTQMWR  EQU   CVTMAP+176
CVTQOCR  EQU   CVTMAP+172
CVT1EF00 EQU   CVTMAP+168
CVTMZ00  EQU   CVTMAP+164
CVTHEAD  EQU   CVTMAP+160
CVTRSV11 EQU   CVTMAP+156
CVT0PT01 EQU   CVTMAP+152
CVTMSER  EQU   CVTMAP+148
CVTRV516 EQU   CVTIERLC
CVTILCH  EQU   CVTMAP+140
CVT0DS   EQU   CVTMAP+136
CVTFBOSV EQU   CVTMAP+132
CVTNUCB  EQU   CVTMAP+128
CVTIOQET EQU   CVTMAP+120
CVTDCBA  EQU   CVTMAP+117
CVTMVS2  EQU   CVTDCB
CVT6DAT  EQU   CVTDCB
CVT4MPS  EQU   CVTDCB
CVTRSV09 EQU   CVTDCB
CVT4MS1  EQU   CVTDCB
CVT2SPS  EQU   CVTDCB
CVT1SSS  EQU   CVTDCB
CVTRSV08 EQU   CVTDCB
CVTQTD00 EQU   CVTMAP+108
CVTQTE00 EQU   CVTMAP+104
CVTCUCB  EQU   CVTMAP+100
CVTSJQ   EQU   CVTMAP+96
CVTPBLDL EQU   CVTMAP+92
CVTTPC   EQU   CVTMAP+88
CVTSVDCB EQU   CVTMAP+84
CVTBRET  EQU   CVTMAP+82
CVTEXIT  EQU   CVTMAP+80
CVT0FN00 EQU   CVTMAP+76
CVTDARA  EQU   CVTDAR+1
CVTRSV07 EQU   CVTFLGS1
CVTRSV06 EQU   CVTFLGS1
CVTRSV05 EQU   CVTFLGS1
CVTRSV04 EQU   CVTFLGS1
CVTRSV03 EQU   CVTFLGS1
CVTRSV02 EQU   CVTFLGS1
CVTRSV01 EQU   CVTFLGS1
CVTDMPLK EQU   CVTFLGS1
CVTXITP  EQU   CVTMAP+68
CVTZDTAB EQU   CVTMAP+64
CVTMSLT  EQU   CVTMAP+60
CVTDATE  EQU   CVTMAP+56
CVTBTERM EQU   CVTMAP+52
CVTSYSAD EQU   CVTMAP+48
CVTXTLER EQU   CVTMAP+44
CVTILK1  EQU   CVTMAP+36
CVTPRLTV EQU   CVTMAP+32
CVTPCNVT EQU   CVTMAP+28
CVT0VL00 EQU   CVTMAP+24
CVTXAPG  EQU   CVTMAP+20
CVTBUF   EQU   CVTMAP+16
CVTJOB   EQU   CVTMAP+12
CVTLINK  EQU   CVTMAP+8
CVT0EF00 EQU   CVTMAP+4
CVTTCBP  EQU   CVTMAP
CVT      EQU   CVTMAP
@NM00037 EQU   PSA+3668
PSASTAK  EQU   PSA+3072
@NM00036 EQU   PSA+1040
PSAUSEND EQU   PSA+1040
PSARV062 EQU   PSA+1036
PSAATCVT EQU   PSA+1032
PSAPCPSW EQU   PSA+1024
PSAPIR2  EQU   PSA+1020
PSARV059 EQU   PSA+1018
PSASVC13 EQU   PSA+1016
PSALSFCC EQU   PSA+1012
PSASFACC EQU   PSA+1008
PSASTOP  EQU   PSA+992
PSASTART EQU   PSA+976
PSARSPSW EQU   PSA+968
PSASRPSW EQU   PSA+960
PSARV045 EQU   PSA+892
PSARV044 EQU   PSA+888
PSARV043 EQU   PSA+884
PSARV042 EQU   PSA+880
PSARV041 EQU   PSA+876
PSARV040 EQU   PSA+872
PSARV025 EQU   PSA+868
PSADSSED EQU   PSA+868
PSADSSPR EQU   PSA+864
PSADSSFW EQU   PSA+860
PSADSS14 EQU   PSA+856
PSADSSPP EQU   PSA+848
PSADSSRP EQU   PSA+840
PSADSS05 EQU   PSADSSF4
PSADSS10 EQU   PSADSSF4
PSADSSVE EQU   PSADSSF4
PSADSSDE EQU   PSADSSF4
PSADSSC0 EQU   PSADSSF4
PSADSSIE EQU   PSADSSF4
PSADSS12 EQU   PSADSSF4
PSADSSRC EQU   PSADSSF4
PSARV057 EQU   PSADSSF3
PSARV056 EQU   PSADSSF3
PSARV055 EQU   PSADSSF3
PSADSSMC EQU   PSADSSF3
PSADSSRW EQU   PSADSSF3
PSADSSNM EQU   PSADSSF3
PSADSSES EQU   PSADSSF3
PSADSSGP EQU   PSADSSF3
PSADSSF2 EQU   PSADSSFL+1
PSADSSPI EQU   PSADSSF1
PSADSSOI EQU   PSADSSF1
PSADSSSP EQU   PSADSSF1
PSADSSTP EQU   PSADSSF1
PSADSSDW EQU   PSADSSF1
PSADSSDD EQU   PSADSSF1
PSADSSDM EQU   PSADSSF1
PSADSSMV EQU   PSADSSF1
PSADSSTS EQU   PSA+816
PSADSSWK EQU   PSA+812
PSADSSR3 EQU   PSA+808
PSADSSR2 EQU   PSA+804
PSADSSRS EQU   PSA+800
PSASTOR  EQU   PSA+796
PSACPUSA EQU   PSA+794
PSAVSTAP EQU   PSA+792
PSAWKVAP EQU   PSA+788
PSAWKRAP EQU   PSA+784
PSAMCHIC EQU   PSA+783
PSARV061 EQU   PSA+782
PSASYMSK EQU   PSA+781
PSAMCHFL EQU   PSA+780
PSACR0   EQU   PSA+776
PSAPSWSV EQU   PSA+768
PSACLHS  EQU   PSAHLHI
PSALKR15 EQU   PSALKSA+60
PSALKR14 EQU   PSALKSA+56
PSALKR13 EQU   PSALKSA+52
PSALKR12 EQU   PSALKSA+48
PSALKR11 EQU   PSALKSA+44
PSALKR10 EQU   PSALKSA+40
PSALKR9  EQU   PSALKSA+36
PSALKR8  EQU   PSALKSA+32
PSALKR7  EQU   PSALKSA+28
PSALKR6  EQU   PSALKSA+24
PSALKR5  EQU   PSALKSA+20
PSALKR4  EQU   PSALKSA+16
PSALKR3  EQU   PSALKSA+12
PSALKR2  EQU   PSALKSA+8
PSALKR1  EQU   PSALKSA+4
PSALKR0  EQU   PSALKSA
PSARV023 EQU   PSACLHT+52
PSALOCAL EQU   PSACLHT+48
PSACMSL  EQU   PSACLHT+44
PSAOPTL  EQU   PSACLHT+40
PSATPACL EQU   PSACLHT+36
PSATPDNL EQU   PSACLHT+32
PSATPNCL EQU   PSACLHT+28
PSAIOSLL EQU   PSACLHT+24
PSAIOSUL EQU   PSACLHT+20
PSAIOSCL EQU   PSACLHT+16
PSAIOSSL EQU   PSACLHT+12
PSASALCL EQU   PSACLHT+8
PSAASML  EQU   PSACLHT+4
PSADISPL EQU   PSACLHT
PSASRSA  EQU   PSA+636
PSARV050 EQU   PSA+634
PSADSSGO EQU   PSA+633
PSARECUR EQU   PSA+632
PSAHLHIS EQU   PSA+628
PSAIPCSA EQU   PSA+624
@NM00035 EQU   PSA+621
PSAIPCDM EQU   PSA+620
PSAIPCD  EQU   PSA+616
@NM00034 EQU   PSA+613
PSAIPCRM EQU   PSA+612
PSAIPCR  EQU   PSA+608
PSAMCHEX EQU   PSA+600
PSAMPSW  EQU   PSA+592
PSAEXPS2 EQU   PSA+584
PSAEXPS1 EQU   PSA+576
PSAPIREG EQU   PSA+572
PSARSREG EQU   PSA+568
PSAGPREG EQU   PSA+556
PSARV022 EQU   PSASUP4
PSARV021 EQU   PSASUP4
PSARV020 EQU   PSASUP4
PSARV019 EQU   PSASUP4
PSARV018 EQU   PSASUP4
PSARV017 EQU   PSASUP4
PSARV016 EQU   PSASUP4
PSARV015 EQU   PSASUP4
PSARV014 EQU   PSASUP3
PSARV013 EQU   PSASUP3
PSARV012 EQU   PSASUP3
PSARV011 EQU   PSASUP3
PSARV010 EQU   PSASUP3
PSAPSREG EQU   PSASUP3
PSAPI2   EQU   PSASUP3
PSAIOSUP EQU   PSASUP3
PSALCR   EQU   PSASUP2
PSARTM   EQU   PSASUP2
PSAACR   EQU   PSASUP2
PSAIPCE2 EQU   PSASUP2
PSAIPCES EQU   PSASUP2
PSAIPCEC EQU   PSASUP2
PSAGTF   EQU   PSASUP2
PSAIPCRI EQU   PSASUP2
PSAIPCRP EQU   PSASUP1
PSAIPCDR EQU   PSASUP1
PSADISP  EQU   PSASUP1
PSALOCK  EQU   PSASUP1
PSAPI    EQU   PSASUP1
PSAEXT   EQU   PSASUP1
PSASVC   EQU   PSASUP1
PSAIO    EQU   PSASUP1
PSAAOLD  EQU   PSA+548
PSAANEW  EQU   PSA+544
PSATOLD  EQU   PSA+540
PSATNEW  EQU   PSA+536
PSALCCAR EQU   PSA+532
PSALCCAV EQU   PSA+528
PSAPCCAR EQU   PSA+524
PSAPCCAV EQU   PSA+520
PSACPULA EQU   PSA+518
PSACPUPA EQU   PSA+516
PSAPSA   EQU   PSA+512
FLCHDEND EQU   PSA+512
FLCCRSAV EQU   FLCMCLA+280
FLCGRSAV EQU   FLCMCLA+216
FLCFPSAV EQU   FLCMCLA+184
FLCFLA   EQU   FLCMCLA+88
FLCRGNCD EQU   FLCMCLA+84
FLCFSAA  EQU   FLCFSA+1
@NM00033 EQU   FLCFSA
@NM00032 EQU   FLCMCLA+72
FLCMCIC  EQU   FLCMCLA+64
@NM00031 EQU   FLCMCLA+20
FLCIOAA  EQU   FLCIOA+1
@NM00030 EQU   FLCIOA
@NM00029 EQU   FLCMCLA+15
@NM00028 EQU   FLCMCLA+14
@NM00027 EQU   FLCMCLA+12
FLCLCL   EQU   FLCMCLA+8
FLCIOELA EQU   FLCIOEL+1
@NM00026 EQU   FLCIOEL
FLCCHNID EQU   FLCMCLA
@NM00025 EQU   PSA+160
FLCMTRCD EQU   PSA+157
@NM00024 EQU   PSA+156
FLCPERA  EQU   FLCPER+1
@NM00023 EQU   FLCPER
@NM00022 EQU   PSA+151
FLCPERCD EQU   PSA+150
FLCMCNUM EQU   PSA+149
@NM00021 EQU   PSA+148
FLCTEAA  EQU   FLCTEA+1
@NM00020 EQU   FLCTEA
PSAPIPC  EQU   PSAPICOD
PSAPIMC  EQU   PSAPICOD
PSAPIPER EQU   PSAPICOD
PSARV049 EQU   FLCPICOD
FLCPILCB EQU   FLCPIILC
@NM00019 EQU   FLCPIILC
@NM00018 EQU   PSAEPPSW
FLCSVCN  EQU   PSAESPSW+2
FLCSILCB EQU   FLCSVILC
@NM00017 EQU   FLCSVILC
@NM00016 EQU   PSAESPSW
FLCEICOD EQU   PSAEEPSW+2
PSASPAD  EQU   PSAEEPSW
@NM00015 EQU   PSA+128
FLCINPSW EQU   PSA+120
FLCMNPSW EQU   PSA+112
FLCPNPSW EQU   PSA+104
FLCSNPSW EQU   PSA+96
FLCENPSW EQU   PSA+88
FLCTRACE EQU   PSA+84
FLCTIMER EQU   PSA+80
FLCCVT2  EQU   PSA+76
FLCCAW   EQU   PSA+72
FLCCSW   EQU   PSA+64
FLCIOPSW EQU   PSA+56
FLCMOPSW EQU   PSA+48
FLCPOPSW EQU   PSA+40
FLCSOPSW EQU   PSA+32
FLCEOPSW EQU   PSA+24
@NM00014 EQU   FLCICCW2+4
FLCICCW1 EQU   FLCROPSW
FLCIPPSW EQU   FLCRNPSW
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS
@ENDDATA EQU   *
         END   IGFDW0,(C'PLS1732',0701,76274)
