         TITLE 'IGFDM1, DDR I/O MODULE                                 *
                        '
IGFDM1   CSECT ,                                                   0001
@MAINENT DS    0H                                                  0001
         USING *,@15                                               0001
         B     @PROLOG                                             0001
         DC    AL1(16)                                             0001
         DC    C'IGFDM1    77.018'                                 0001
         DROP  @15
@PROLOG  STM   @14,@12,12(@13)                                     0001
         BALR  @08,0                                               0001
@PSTART  DS    0H                                                  0001
         USING @PSTART,@08                                         0001
         L     @00,@SIZDATD                                        0001
         GETMAIN  R,LV=(0)
         LR    @09,@01                                             0001
         USING @DATD,@09                                           0001
         ST    @13,@SA00001+4                                      0001
         LM    @00,@01,20(@13)                                     0001
         ST    @09,8(,@13)                                         0001
         LR    @13,@09                                             0001
*                                      VERSION                       */
*   DO;                             /* ?IGFDERR INIT                 */
*                                                                  0192
*     /***************************************************************/
*     /*                                                             */
*     /* IGFDERR - INITIALIZE RECOVERY ENVIRONMENT                   */
*     /*                                                             */
*     /***************************************************************/
*                                                                  0193
*     DERPLIST=DERPLIST&&DERPLIST;  /* CLEAR PARAMETER LIST          */
         XC    DERPLIST(48),DERPLIST                               0193
*     DERFUNK=DERINIT;              /* INDICATE INIT FUNCTION        */
         MVI   DERFUNK,X'01'                                       0194
*     DERREC=ADDR(DERRECPM);        /* POINT TO REC PARMS            */
         LA    @12,DERRECPM                                        0195
         ST    @12,DERREC                                          0195
*     DERRETRY=ADDR(IGFDM1R);       /* POINT TO RETRY ROUTINE        */
         LA    @12,IGFDM1R                                         0196
         ST    @12,DERRETRY                                        0196
*     GEN SETS(DERDATD)(MVC DERDATD,@SIZDATD);/* SET UP SPN, SIZE    */
         MVC DERDATD,@SIZDATD
*     DERPFX=DERRMASK;              /* SET UP RUB MASK               */
         MVC   DERPFX(2),@CB02029                                  0198
*     DERRCODE=CODEBASE;            /* SAVE CODEREG                  */
         ST    CODEBASE,DERRCODE                                   0199
*     DERRDATA=DATABASE;            /* SAVE DATAREG                  */
         ST    DATABASE,DERRDATA                                   0200
*     DERRDDR=DDRPTR;               /* SAVE DDRCOM POINTER           */
         ST    DDRPTR,DERRDDR                                      0201
*     DERRSAVE=SAVEPTR;             /* SAVE REGISTER 13              */
         ST    SAVEPTR,DERRSAVE                                    0202
*     CALL IGFDE0(DERPLIST);        /* ISSUE ESTAE                   */
         LA    @12,DERPLIST                                        0203
         ST    @12,@AL00001                                        0203
         L     @15,@CV01939                                        0203
         LA    @01,@AL00001                                        0203
         BALR  @14,@15                                             0203
*   END;                            /* ?IGFDERR INIT ESTAE         0204
*                                      ESTABLISHED                   */
*   DERLRC=0;                       /* CLEAR LOCAL RETURN CODE       */
         MVI   DERLRC,X'00'                                        0205
*   SAVER13=SAVEPTR;                /* SAVE REG 13                   */
         LR    SAVER13,SAVEPTR                                     0206
*   IOSBPTR=ADDR(CBAREA);           /* INITIALIZE CONTROL BLOCKS BASE*/
         LA    IOSBPTR,CBAREA                                      0207
*   IF DDRWHICH='1'B THEN           /* IS UCB INDICATOR SET ?        */
         TM    DDRWHICH(DDRPTR),B'10000000'                        0208
         BNO   @RF00208                                            0208
*     UCBPTR=DDRFMUCB;              /* YES - USE FROM UCB            */
         L     @12,DDRFMUCB(,DDRPTR)                               0209
         ST    @12,UCBPTR                                          0209
*   ELSE                            /* NO - INDICATOR NOT SET        */
*     UCBPTR=DDRTOUCB;              /* USE TO UCB                    */
         B     @RC00208                                            0210
@RF00208 L     @12,DDRTOUCB(,DDRPTR)                               0210
         ST    @12,UCBPTR                                          0210
*   COMPFLAG='0'B;                  /* CLEAR I/O COMPLETE FLAG       */
@RC00208 NI    COMPFLAG,B'01111111'                                0211
*   CALL DM1BITS;                   /* SET NECESSARY UCB BITS        */
         BAL   @14,DM1BITS                                         0212
*   IF^(UCBNRY='1'B&DDRIMNT='0'B) THEN/* IS PHYSICAL I/O NEEDED?     */
         L     @12,UCBPTR                                          0213
         TM    UCBNRY(@12),B'01000000'                             0213
         BNO   @RT00213                                            0213
         TM    DDRIMNT(DDRPTR),B'00010000'                         0213
         BZ    @RF00213                                            0213
@RT00213 DS    0H                                                  0214
*     DO;                           /* YES - I/O IS NEEDED           */
*       CALL DM1CB;                 /* CREATE CONTROL BLOCKS         */
         BAL   @14,DM1CB                                           0215
*       PARMREG1=ADDR(CBSRB);       /* REG 1 = SRB ADDRESS   @YM02554*/
*                                                                  0216
         LA    PARMREG1,CBSRB(,IOSBPTR)                            0216
*       /*************************************************************/
*       /*                                                           */
*       /* ALL DDR I/O IS SCHEDULED VIA STARTIO MACRO        @YM02554*/
*       /*                                                           */
*       /*************************************************************/
*                                                                  0217
*       GEN REFS(SAVEPTR,PARMREG1,R14,R12,IOCSTIO,IOCOM,CVTPTR,CVTIXAVL
*           ,CVTMAP);                                              0217
*                                                                  0217
*                                                         /*@YM02554*/
              STM R14,R12,12(SAVEPTR)        SAVE REGS EXCEPT R13     **
                                                              @YM02554
     STARTIO   SRB=(PARMREG1),TCB=SRB                         @YM02554
     LM  R14,R12,12(SAVEPTR)        RESTORE REGS              @YM02554
*/*  WAIT ON I/O ECB COMPLETION                                      */
*                                                                  0218
*       DO;                         /* WAIT ECB(CBECB)               */
*         RESPECIFY                                                0219
*          (GPR00P,                                                0219
*           GPR01P) RESTRICTED;                                    0219
*         GPR00P=1;                 /* LOAD WAIT COUNT               */
         LA    GPR00P,1                                            0220
*         GPR01P=ADDR(CBECB);       /* ADDRESS OF ECB                */
         LA    GPR01P,CBECB(,IOSBPTR)                              0221
*         SVC(1);                   /* WAIT SVC                      */
         SVC   1                                                   0222
*         RESPECIFY                                                0223
*          (GPR00P,                                                0223
*           GPR01P) UNRESTRICTED;                                  0223
*       END;                        /* WAIT ECB(CBECB) WAIT FOR I/O
*                                      COMPLETION                    */
*       COMPFLAG='1'B;              /* I/O IS COMPLETE               */
         OI    COMPFLAG,B'10000000'                                0225
*       CALL DM1BITS;               /* UCB ENDING STATUS             */
         BAL   @14,DM1BITS                                         0226
*       IF IOSCOD^=SUCCODE THEN     /* IS IOS CODE 7F ?              */
         CLI   IOSCOD(IOSBPTR),127                                 0227
         BE    @RF00227                                            0227
*         DERLRC=4;                 /* NO - SET LOCAL RETURN CODE    */
         MVI   DERLRC,X'04'                                        0228
*       ELSE                                                       0229
*         ;                         /* YES - SUCCESSFUL I/O          */
@RF00227 DS    0H                                                  0230
*     END;                                                         0230
*   ELSE                                                           0231
*     ;                             /* I/O NOT NECESSARY(NOT READY IS
*                                      SET AND MOUNT IS OFF)         */
@RF00213 DS    0H                                                  0232
*/* THIS IS THE COMMON EXIT ROUTINE FOR THIS MODULE                  */
*                                                                  0232
*IGFDM1R:                                                          0232
*   ;                                                              0232
IGFDM1R  DS    0H                                                  0233
*   DO;                             /* ?IGFDERR CANCEL               */
*                                                                  0233
*     /***************************************************************/
*     /*                                                             */
*     /* IGFDERR - CANCEL RECOVERY ENVIRONMENT                       */
*     /*                                                             */
*     /***************************************************************/
*                                                                  0234
*     DERFUNK=DERCANC;              /* INDICATE CANCEL               */
         MVI   DERFUNK,X'02'                                       0234
*     CALL IGFDE0(DERPLIST);        /* CANCEL ESTAE                  */
         LA    @12,DERPLIST                                        0235
         ST    @12,@AL00001                                        0235
         L     @15,@CV01939                                        0235
         LA    @01,@AL00001                                        0235
         BALR  @14,@15                                             0235
*   END;                            /* ?IGFDERR CANCEL ESTAE CANCEL  */
*   RETURN CODE(DERLRC);            /* RETURN TO CALLER              */
         SLR   @12,@12                                             0237
         IC    @12,DERLRC                                          0237
         L     @13,4(,@13)                                         0237
         L     @00,@SIZDATD                                        0237
         LR    @01,@09                                             0237
         FREEMAIN R,LV=(0),A=(1)
         LR    @15,@12                                             0237
         L     @14,12(,@13)                                        0237
         LM    @00,@12,20(@13)                                     0237
         BR    @14                                                 0237
*                                                                  0238
*   /*****************************************************************/
*   /*                                                               */
*   /* THIS SUBROUTINE ADJUSTS THE UCB TO THE DESIRED STATUS BEFORE  */
*   /* AND AFTER ISSUING THE I/O REQUEST.                            */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0238
*DM1BITS:                                                          0238
*   PROC;                                                          0238
DM1BITS  STM   @14,@12,@SA00002                                    0238
*   SAVEPTR=ADDR(IOSGWA);           /* IOSGEN WORK AREA ADDRESS IN 0239
*                                      R13                           */
         LA    SAVEPTR,IOSGWA                                      0239
*   PREPTR=UCBPTR;                  /* SETUP UCB FOR IOSGEN  @YM02567*/
         L     PREPTR,UCBPTR                                       0240
*   IF COMPFLAG='1'B THEN           /* IS I/O COMPLETE ?             */
         TM    COMPFLAG,B'10000000'                                0241
         BNO   @RF00241                                            0241
*     DO;                           /* YES - UCB POST PROCESSING IS
*                                      REQUIRED                      */
*       IF DDRIOF1=DDRRUN THEN      /* IS I/O AN UNLOAD AND REWIND 0243
*                                      OP?                           */
         CLI   DDRIOF1(DDRPTR),X'0F'                               0243
         BNE   @RF00243                                            0243
*         DO;                       /* YES - SET NOT READY FLAG      */
*           GEN REFS(UCBFLA,UCBFLB,UCBFLC,CVTPTR,PREPTR,UCBNRY,CVTIXAVL
*               ,IOCGENA,UCBBGN,UCBCCWOF,UCB3TAPE);                0245
   IOSGEN UCBFLG,UCB=(PREPTR),VAR=ON,TABLE=UCBNRY,REG=UNCOND
*         END;                                                     0246
*       ELSE                        /* NOT AN UNLOAD AND REWIND    0247
*                                      OPERATION                     */
*         IF DDRIMNT='1'B THEN      /* IS I/O A MOUNT ?              */
         B     @RC00243                                            0247
@RF00243 TM    DDRIMNT(DDRPTR),B'00010000'                         0247
         BNO   @RF00247                                            0247
*           UCBMOUNT='0'B;          /* YES - RESET MOUNT PENDING IN
*                                      UCB                           */
         L     @12,UCBPTR                                          0248
         NI    UCBMOUNT(@12),B'01111111'                           0248
*         ELSE                                                     0249
*           ;                       /* NOT A MOUNT OPERATION         */
@RF00247 DS    0H                                                  0250
*     END;                                                         0250
*   ELSE                            /* COMPLETE FLAG NOT SET         */
*     DO;                                                          0251
         B     @RC00241                                            0251
@RF00241 DS    0H                                                  0252
*       IF DDRIMNT='1'B THEN        /* IS I/O A MOUNT ?              */
         TM    DDRIMNT(DDRPTR),B'00010000'                         0252
         BNO   @RF00252                                            0252
*         DO;                       /* YES - SET UCB NOT READY       */
*           GEN REFS(UCBFLA,UCBFLB,UCBFLC,CVTPTR,PREPTR,UCBNRY,CVTIXAVL
*               ,IOCGENA,UCBBGN,UCBCCWOF,UCB3TAPE);                0254
    IOSGEN UCBFLG,UCB=(PREPTR),VAR=ON,TABLE=UCBNRY,REG=UNCOND
*           UCBATI=0;               /* CLEAR ATTENTION TABLE INDEX   */
         L     @12,UCBPTR                                          0255
         L     @03,UCBEXTPT(,@12)                                  0255
         MVI   UCBATI(@03),X'00'                                   0255
*           UCBMOUNT='1'B;          /* SET UCB MOUNT PENDING         */
         OI    UCBMOUNT(@12),B'10000000'                           0256
*         END;                                                     0257
*       ELSE                                                       0258
*         ;                         /* NOT A MOUNT OPERATION         */
@RF00252 DS    0H                                                  0259
*       IF DDRITAKE='1'B&UCBQISCE='0'B THEN/* IS CONTROL REQUIRED ?  */
         TM    DDRITAKE(DDRPTR),B'01000000'                        0259
         BNO   @RF00259                                            0259
         L     @12,UCBPTR                                          0259
         TM    UCBQISCE(@12),B'00000001'                           0259
         BNZ   @RF00259                                            0259
*         DO;                       /* YES - UCB CONTROL IS REQUIRED */
*           GEN REFS(UCBFLA,UCBFLB,UCBFLC,CVTPTR,PREPTR,UCBQISCE,  0261
*               CVTIXAVL,IOCGENA,UCBBGN,UCBCCWOF,UCB3TAPE,UCBDDRSW);
   IOSGEN UCBFLG,UCB=(PREPTR),VAR=ON,TABLE=UCBQISCE
   IOSGEN UCBFLG,UCB=(PREPTR),VAR=ON,TABLE=UCBDDRSW
*         END;                                                     0262
*       ELSE                        /* NO CONTROL IS REQUIRED        */
*         IF DDRITAKE='0'B&UCBQISCE='1'B THEN/* IS RELEASED REQUIRED
*                                      ?                             */
         B     @RC00259                                            0263
@RF00259 TM    DDRITAKE(DDRPTR),B'01000000'                        0263
         BNZ   @RF00263                                            0263
         L     @12,UCBPTR                                          0263
         TM    UCBQISCE(@12),B'00000001'                           0263
         BNO   @RF00263                                            0263
*           DO;                     /* YES - UCB RELEASED IS REQUIRED*/
*             GEN REFS(UCBFLA,UCBFLB,UCBFLC,CVTPTR,PREPTR,UCBQISCE,
*                 CVTIXAVL,IOCGENA,UCBBGN,UCBCCWOF,UCB3TAPE,UCBDDRSW);
   IOSGEN UCBFLG,UCB=(PREPTR),VAR=OFF,TABLE=UCBQISCE
   IOSGEN UCBFLG,UCB=(PREPTR),VAR=OFF,TABLE=UCBDDRSW
*           END;                                                   0266
*         ELSE                                                     0267
*           ;                       /* NO UCB RELEASE IS REQUIRED    */
@RF00263 DS    0H                                                  0268
*     END;                                                         0268
@RC00259 DS    0H                                                  0269
*   SAVEPTR=SAVER13;                /* RESTORE REG 13        @YM02554*/
@RC00241 LR    SAVEPTR,SAVER13                                     0269
*   RETURN;                                                        0270
@EL00002 DS    0H                                                  0270
@EF00002 DS    0H                                                  0270
@ER00002 LM    @14,@12,@SA00002                                    0270
         BR    @14                                                 0270
*   END DM1BITS;                                                   0271
*                                                                  0272
*   /*****************************************************************/
*   /*                                                               */
*   /* THIS SUBROUTINE INITIALIZES THE SRB,IOSB,AND BUILDS THE CCW'S */
*   /* NECESSARY TO ISSUE THE I/O.                                   */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0272
*DM1CB:                                                            0272
*   PROC;                                                          0272
DM1CB    STM   @14,@12,@SA00003                                    0272
*   CONTROLB=CONTROLB&&CONTROLB;    /* CLEAR CONTROL BLOCKS          */
         XC    CONTROLB(172,IOSBPTR),CONTROLB(IOSBPTR)             0273
*   IF DDRICNT='1'B THEN            /* IS REPEAT COUNT ON ?          */
         TM    DDRICNT(DDRPTR),B'00001000'                         0274
         BNO   @RF00274                                            0274
*     CBCOUNT=MAX(ABS(DDRCOUNT),1); /* YES - SET COUNT       @OZ16563*/
         L     @12,DDRCOUNT(,DDRPTR)                               0275
         LPR   @12,@12                                             0275
         LA    @00,1                                               0275
         CR    @12,@00                                             0275
         BNL   *+6
         LR    @12,@00                                             0275
         ST    @12,CBCOUNT(,IOSBPTR)                               0275
*   ELSE                            /* NO - REPEAT COUNT IS ZERO     */
*     CBCOUNT=1;                    /* SET COUNT OF ONE              */
         B     @RC00274                                            0276
@RF00274 MVC   CBCOUNT(4,IOSBPTR),@CF00069                         0276
*   CBDDRCOM=DDRPTR;                /* SAVE DDRCOM BASE REG          */
@RC00274 ST    DDRPTR,CBDDRCOM(,IOSBPTR)                           0277
*   IOSBPTR=ADDR(CBIOSB);           /* INITIALIZE IOSB BASE REG      */
*   IOSDVRID=IOSMISID;              /* MISCELLANEOUS DRIVER          */
         MVI   IOSDVRID(IOSBPTR),X'01'                             0279
*   IOSASID=DDRASID;                /* ASID                          */
         LH    @12,DDRASID(,DDRPTR)                                0280
         STH   @12,IOSASID(,IOSBPTR)                               0280
*   IOSPGAD=ADDR(DM1SRB);           /* ADDRESS OF SRB ROUTINE        */
         LA    @12,DM1SRB                                          0281
         ST    @12,IOSPGAD(,IOSBPTR)                               0281
*   IOSLCL='1'B;                    /* LOCAL LOCK FOR APPENDAGES     */
         OI    IOSLCL(IOSBPTR),B'00001000'                         0282
*   IOSUCB=UCBPTR;                  /* UCB PTR VARIABLE              */
         L     @12,UCBPTR                                          0283
         ST    @12,IOSUCB(,IOSBPTR)                                0283
*   IOSSRB=ADDR(CBSRB);             /* WORKAREA SRB                  */
         LA    @12,CBSRB(,IOSBPTR)                                 0284
         ST    @12,IOSSRB(,IOSBPTR)                                0284
*   IOSNRM=ADDR(DM1NRM);            /* NORMAL APPENDAGE              */
         LA    @12,DM1NRM                                          0285
         ST    @12,IOSNRM(,IOSBPTR)                                0285
*   IOSABN=ADDR(DM1ABN);            /* ABNORMAL APPENDAGE            */
         LA    @12,DM1ABN                                          0286
         ST    @12,IOSABN(,IOSBPTR)                                0286
*   IOSVST=ADDR(CBCCW);             /* CCW ADDRESS                   */
         LA    @12,CBCCW(,IOSBPTR)                                 0287
         ST    @12,IOSVST(,IOSBPTR)                                0287
*   IOSQISCE='1'B;                  /* I/O TO A LOCKED DEVICE        */
         OI    IOSQISCE(IOSBPTR),B'00100000'                       0288
*/* LOAD REAL CCW ADDRESS INTO IOSB                                  */
*                                                                  0289
*   GEN REFS(CBCCW,IOSBPTR) SETS(LRAREG);                          0289
     LRA   LRAREG,CBCCW(,IOSBPTR)  LOAD REAL ADDRESS IN REG 1
*   IOSRST=LRAREG;                                                 0290
         ST    LRAREG,IOSRST(,IOSBPTR)                             0290
*   IF DDRMT='1'B THEN              /* IS DEVICE A TAPE ?            */
         TM    DDRMT(DDRPTR),B'00100000'                           0291
         BNO   @RF00291                                            0291
*     DO;                           /* YES -DEVICE IS A TAPE         */
*       MODESETA=DDRUMODE;          /* OBTAIN USER'S MODESET @YM04069*/
         MVC   MODESETA(1),DDRUMODE(DDRPTR)                        0293
*       IF UCBPTR->UCB2OPT0='1'B&DDRLSD='1'B&DDRIMNT='1'B THEN/* IS
*                                      THIS A 7-TRACK STANDARD LABEL
*                                      TAPE WITH MOUNT SET ?         */
*                                                                  0294
         L     @12,UCBPTR                                          0294
         TM    UCB2OPT0(@12),B'10000000'                           0294
         BNO   @RF00294                                            0294
         TM    DDRLSD(DDRPTR),B'00001000'                          0294
         BNO   @RF00294                                            0294
         TM    DDRIMNT(DDRPTR),B'00010000'                         0294
         BNO   @RF00294                                            0294
*         /***********************************************************/
*         /*                                                         */
*         /* YES - A 7-TRACK SD LABEL                                */
*         /*                                                         */
*         /***********************************************************/
*                                                                  0295
*         MODEMASK=MODESETM;        /* INITIALIZE MODESET AREA MASK  */
         NI    MODEMASK,B'11101011'                                0295
         OI    MODEMASK,B'00101011'                                0295
*       ELSE                                                       0296
*         ;                         /* NOT A 7-TRACK STANDARD LABEL
*                                      PROCESSING                    */
@RF00294 DS    0H                                                  0297
*       IOSFMSK=MODESETA;           /* USER OR ADJUSTED MODESET      */
         MVC   IOSFMSK(1,IOSBPTR),MODESETA                         0297
*     END;                                                         0298
*   ELSE                                                           0299
*     ;                             /* NOT A TAPE                    */
@RF00291 DS    0H                                                  0300
*/*  SRB INITIALIZATION                                              */
*                                                                  0300
*   SRBPTR=ADDR(CBSRB);             /* INITIALIZE PTR                */
         LA    SRBPTR,CBSRB(,IOSBPTR)                              0300
*   SRBID='SRB ';                   /* LABEL                         */
         MVC   SRBID(4,SRBPTR),@CC02052                            0301
*   SRBASCB=ASVTENTY(DDRASID);      /* ASCB ADDRESS                  */
         LH    @03,DDRASID(,DDRPTR)                                0302
         LR    @02,@03                                             0302
         SLA   @02,2                                               0302
         L     @00,CVTPTR                                          0302
         LR    @03,@00                                             0302
         L     @03,ASVTPTR(,@03)                                   0302
         L     @03,ASVTENTY-4(@02,@03)                             0302
         ST    @03,SRBASCB(,SRBPTR)                                0302
*   SRBPARM=ADDR(CBIOSB);                                          0303
         ST    IOSBPTR,SRBPARM(,SRBPTR)                            0303
*   SRBEP=ADDR(DM1SRB);             /* SRB ROUTINE ADDRESS           */
         LA    @03,DM1SRB                                          0304
         ST    @03,SRBEP(,SRBPTR)                                  0304
*   SRBPTCB=OLDTCB;                 /* OLD TCB ADDRESS               */
         LR    @03,@00                                             0305
         L     @03,CVTTCBP(,@03)                                   0305
         L     @00,OLDTCB(,@03)                                    0305
         ST    @00,SRBPTCB(,SRBPTR)                                0305
*   SRBPASID=DDRASID;                                              0306
*                                                                  0306
         LH    @03,DDRASID(,DDRPTR)                                0306
         STH   @03,SRBPASID(,SRBPTR)                               0306
*/*  CCW INITIALIZATION                                              */
*                                                                  0307
*   LRAREG=DDRIBUF;                 /* GET BUFFER ADDRESS            */
         L     LRAREG,DDRIBUF(,DDRPTR)                             0307
*   GEN NOREFS SETS(LRAREG);                                       0308
       LRA LRAREG,0(,LRAREG)    LOAD REAL ADDRESS
*   IF DDRIOF1='0C'X THEN           /* IS OPERATION A READ BACKWARDS
*                                                            @OZ16562*/
         CLI   DDRIOF1(DDRPTR),X'0C'                               0309
         BNE   @RF00309                                            0309
*     LRAREG=LRAREG+'B'X;           /* MOVE PTR TO BUFFEREND @OZ16562*/
         AL    LRAREG,@CF02053                                     0310
*   CBCCW1=LRAREG;                  /* LOAD REAL ADDRESS OF CCW      */
@RF00309 STCM  LRAREG,7,CBCCW1(IOSBPTR)                            0311
*   CBCCW0=DDRIOF1;                 /* COMMAND CODE                  */
         MVC   CBCCW0(1,IOSBPTR),DDRIOF1(DDRPTR)                   0312
*   CBCCW4='20'X;                   /* SET SLI BIT                   */
         MVI   CBCCW4(IOSBPTR),X'20'                               0313
*   CBCCW6=MAX(DDRIBUFL,1);         /* SET BYTE COUNT                */
         LH    @12,DDRIBUFL(,DDRPTR)                               0314
         LA    @00,1                                               0314
         CR    @12,@00                                             0314
         BNL   *+6
         LR    @12,@00                                             0314
         STH   @12,CBCCW6(,IOSBPTR)                                0314
*   RETURN;                                                        0315
@EL00003 DS    0H                                                  0315
@EF00003 DS    0H                                                  0315
@ER00003 LM    @14,@12,@SA00003                                    0315
         BR    @14                                                 0315
*   END DM1CB;                                                     0316
*                                                                  0317
*   /*****************************************************************/
*   /*                                                               */
*   /* N O R M A L E N D A P P E N D A G E THIS SUBROUTINE IS ENTERED*/
*   /* WHENEVER THE I/O OPERATION IS COMPLETED SUCCESSFULLY OR IF THE*/
*   /* ONLY ERROR FOUND WAS A UNIT EXCEPTION (TAPE MARK).            */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0317
*DM1NRM:                                                           0317
*   PROC OPTIONS(NOSAVEAREA,NOSAVE(R14));/* IOS PROVIDES THE       0317
*                                      LOCALMEMORY LOCK WHICH PASSES
*                                      A SAVE AREA ADDRESS IN REG 13 */
DM1NRM   STM   @15,@12,16(@13)                                     0317
*   GEN NOREFS SETS(CODEBASE);                                     0318
    BALR  CODEBASE,0        WITH INPUT REG 8
    USING *,CODEBASE       ESTABLISH BASE
*   IOSBPTR=PARMREG1;               /* WORKAREA IOSB ADDRESS         */
         LR    IOSBPTR,PARMREG1                                    0319
*   CBCOUNT=CBCOUNT-1;              /* DECREMENT REPEAT COUNT        */
         L     @12,CBCOUNT(,IOSBPTR)                               0320
         BCTR  @12,0                                               0320
         ST    @12,CBCOUNT(,IOSBPTR)                               0320
*   IOSEX='0'B;                     /* ZERO EXCEPTION CONDITION      */
         NI    IOSEX(IOSBPTR),B'11111011'                          0321
*   IF CBCOUNT>0 THEN               /* IS COUNT GREATER THAN ZERO?   */
         LTR   @12,@12                                             0322
         BNP   @RF00322                                            0322
*     R14=R14+8;                    /* CHANNEL PROGRAM WILL BE     0323
*                                      RE-EXECUTED(EXCP)             */
         AL    R14,@CF00038                                        0323
*   ELSE                                                           0324
*     ;                             /* COUNT IS ZERO OR LESS         */
@RF00322 DS    0H                                                  0325
*   RETURN;                                                        0325
@EL00004 DS    0H                                                  0325
@EF00004 DS    0H                                                  0325
@ER00004 LM    @15,@12,16(@13)                                     0325
         BR    @14                                                 0325
*   END DM1NRM;                                                    0326
*                                                                  0327
*   /*****************************************************************/
*   /*                                                               */
*   /* A B N O R M A L E N D A P P E N D A G E THIS SUBROUTINE       */
*   /* RECEIVES CONTROL ON UNIT OR CHANNEL CHECKS AND DETERMINES IF  */
*   /* THE ERROR IS IGNORABLE,PERMAMENT, OR RETRYABLE.               */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0327
*DM1ABN:                                                           0327
*   PROC OPTIONS(NOSAVEAREA,NOSAVE(R14));/* REG 13 CONTAINS SAVE AREA
*                                      ADDRESS                       */
DM1ABN   STM   @15,@12,16(@13)                                     0327
*   GEN NOREFS SETS(CODEBASE);                                     0328
    BALR  CODEBASE,0        WITH INPUT REG 8
    USING *,CODEBASE       ESTABLISH BASE
*   IOSBPTR=PARMREG1;               /* WORKAREA IOSB ADDRESS         */
         LR    IOSBPTR,PARMREG1                                    0329
*   DDRPTR=CBDDRCOM;                /* ESTABLISH DDRCOM PTR          */
         L     DDRPTR,CBDDRCOM(,IOSBPTR)                           0330
*   IF IOSCOD^=IOSERRC&IOSCOD^=IOSMIHCA&IOSCOD^=IOSINTC&IOSCOD^=   0331
*       IOSTAPEC THEN               /* SECOND ENTRY INTO THIS ROUTINE
*                                      ?                             */
         CLI   IOSCOD(IOSBPTR),X'41'                               0331
         BE    @RF00331                                            0331
         CLI   IOSCOD(IOSBPTR),X'51'                               0331
         BE    @RF00331                                            0331
         CLI   IOSCOD(IOSBPTR),X'44'                               0331
         BE    @RF00331                                            0331
         CLI   IOSCOD(IOSBPTR),X'4B'                               0331
         BE    @RF00331                                            0331
*/*  NOT A SECOND ENTRY                                              */
*                                                                  0332
*     IF DDRILAB='0'B&DDRIMNT='0'B THEN/* ERROR DURING LABEL       0332
*                                      PROCESSING? OR ERROR DURING 0332
*                                      MOUNT?                        */
         TM    DDRILAB(DDRPTR),B'00110000'                         0332
         BNZ   @RF00332                                            0332
*       DO;                         /* NOT DURING LABEL PROCESSING   */
*         IF IOSCC='30'X×(VIOSBUCK='1'B&DDRMT='1'B&VIOSSN1B='0'B&  0334
*             VIOSSN2B='0'B) THEN   /* IS DEVICE OPERATIONAL? CHECK
*                                      FOR SIO CONDITION CODE OR THE
*                                      ERROR IS A UNIT CHECK ON TAPE
*                                      AND THE TAPE IS NOT ACTIVE .  */
         CLI   IOSCC(IOSBPTR),X'30'                                0334
         BE    @RT00334                                            0334
         TM    VIOSBUCK(IOSBPTR),B'00000010'                       0334
         BNO   @RF00334                                            0334
         TM    DDRMT(DDRPTR),B'00100000'                           0334
         BNO   @RF00334                                            0334
         TM    VIOSSN1B(IOSBPTR),B'01100000'                       0334
         BNZ   @RF00334                                            0334
@RT00334 DS    0H                                                  0335
*           IOSNERP='1'B;           /* DEVICE IS NOT OPERATIONAL AND
*                                      SET NO ERP PROCESSING         */
         OI    IOSNERP(IOSBPTR),B'00001000'                        0335
*         ELSE                      /* DEVICE IS OPERATIONAL         */
*           IF DDRIOF1=DDRRUN×(DDRIOF1=DDRNOP&DDRDA='1'B) THEN/* IS
*                                      I/O COMMAND A REWIND AND    0336
*                                      UNLOAD OR A DISK NOP ?      0336
*                                                            @YM05699*/
         B     @RC00334                                            0336
@RF00334 CLI   DDRIOF1(DDRPTR),X'0F'                               0336
         BE    @RT00336                                            0336
         CLI   DDRIOF1(DDRPTR),X'03'                               0336
         BNE   @RF00336                                            0336
         TM    DDRDA(DDRPTR),B'01000000'                           0336
         BNO   @RF00336                                            0336
@RT00336 DS    0H                                                  0337
*             DO;                   /* YES- A REWIND AND UNLOAD OR A
*                                      DISK NOP                      */
*               IF VIOSBUCK='1'B&VIOSINTR='0'B THEN/* TEST FOR UNIT
*                                      CHECK AND INTERVENTION      0338
*                                      REQUIRED              @YM07704*/
         TM    VIOSBUCK(IOSBPTR),B'00000010'                       0338
         BNO   @RF00338                                            0338
         TM    VIOSINTR(IOSBPTR),B'01000000'                       0338
         BNZ   @RF00338                                            0338
*                 IOSEX='0'B;       /* NO INTERVENTION REQUIRED -  0339
*                                      IGNORE ERROR          @YM05699*/
         NI    IOSEX(IOSBPTR),B'11111011'                          0339
*               ELSE                /* YES- AN INTERVENTION REQUIRED
*                                      SITUATION                     */
*                 IF DDRWHICH='1'B THEN/* A FROM DEVICE?             */
         B     @RC00338                                            0340
@RF00338 TM    DDRWHICH(DDRPTR),B'10000000'                        0340
         BNO   @RF00340                                            0340
*                   IOSEX='0'B;     /* YES- IGNORE ERROR     @YM05699*/
         NI    IOSEX(IOSBPTR),B'11111011'                          0341
*                 ELSE                                             0342
*                   ;               /* CAUSE INTR MSG ON TO DEVICE OR
*                                      WAIT UNTIL INTERVENTION     0342
*                                      REQUIRED IS SATISFIED @YM05699*/
@RF00340 DS    0H                                                  0343
*             END;                  /*                       @YM05699*/
*           ELSE                    /* I/O COMMAND IS NOT A        0344
*                                      REWIND&UNLOAD OR A DISK NOP 0344
*                                                            @YM05699*/
*             IF((DDRIOF1=DDRREAD×DDRIOF1=DDRRDBK)&(VIOSBUCK='1'B&(
*                 VIOSBDCK='1'B×VIOSBOVR='1'B)&DDRMT='1'B)) THEN/* 0344
*                                      ERROR CAN BE IGNORED IF I/O 0344
*                                      COMMAND WAS A NOP OR REWIND 0344
*                                      AND UNLOAD- OR IF I/O WAS A 0344
*                                      READ OR READ BACKWARDS AND THE
*                                      ERROR IS A DATA CHECK OR    0344
*                                      OVERRUN ON A TAPE.            */
         B     @RC00336                                            0344
@RF00336 CLI   DDRIOF1(DDRPTR),X'02'                               0344
         BE    @GL00015                                            0344
         CLI   DDRIOF1(DDRPTR),X'0C'                               0344
         BNE   @RF00344                                            0344
@GL00015 TM    VIOSBUCK(IOSBPTR),B'00000010'                       0344
         BNO   @RF00344                                            0344
         TM    VIOSBDCK(IOSBPTR),B'00001100'                       0344
         BZ    @RF00344                                            0344
         TM    DDRMT(DDRPTR),B'00100000'                           0344
         BNO   @RF00344                                            0344
*               DO;                 /* IGNORABLE ERROR               */
*                 IOSEX='0'B;       /* CLEAR EXCEPTION CONDITION     */
         NI    IOSEX(IOSBPTR),B'11111011'                          0346
*                 IF DDRMT='1'B&((VIOSBDCK='1'B&IOSCSWRC=0)×VIOSBOVR=
*                     '1'B) THEN    /* TAPE MOVEMENT ? IF THE TAPE 0347
*                                      ERROR IS A DATA CHECK AND CSW
*                                      RESIDUAL COUNT IS ZERO - OR IF
*                                      THE ERROR IS A TAPE OVERRUN ,
*                                      THE REPEAT COUNT WILL BE    0347
*                                      DECREMENTED.                  */
         TM    DDRMT(DDRPTR),B'00100000'                           0347
         BNO   @RF00347                                            0347
         TM    VIOSBDCK(IOSBPTR),B'00001000'                       0347
         BNO   @GL00020                                            0347
         LH    @12,IOSCSWRC(,IOSBPTR)                              0347
         N     @12,@CF02080                                        0347
         LTR   @12,@12                                             0347
         BZ    @RT00347                                            0347
@GL00020 TM    VIOSBOVR(IOSBPTR),B'00000100'                       0347
         BNO   @RF00347                                            0347
@RT00347 DS    0H                                                  0348
*                   CBCOUNT=CBCOUNT-1;/* DECREMENT COUNT             */
         L     @12,CBCOUNT(,IOSBPTR)                               0348
         BCTR  @12,0                                               0348
         ST    @12,CBCOUNT(,IOSBPTR)                               0348
*                 ELSE                                             0349
*                   ;               /* NOT TAPE MOVEMENT             */
@RF00347 DS    0H                                                  0350
*                 IF CBCOUNT^=0 THEN/* IS COUNT NON-ZERO ?           */
         L     @12,CBCOUNT(,IOSBPTR)                               0350
         LTR   @12,@12                                             0350
         BZ    @RF00350                                            0350
*                   R14=R14+8;      /* YES- I/O TO BE RE-EXECUTED    */
         AL    R14,@CF00038                                        0351
*                 ELSE                                             0352
*                   ;               /* COUNT IS ZERO                 */
@RF00350 DS    0H                                                  0353
*               END;                                               0353
*             ELSE                                                 0354
*               ;                   /* ERROR CNA NOT BE IGNORED      */
@RF00344 DS    0H                                                  0355
*       END;                                                       0355
*     ELSE                                                         0356
*       ;                           /* ERROR DURING LABEL PROCESSING */
@RF00332 DS    0H                                                  0357
*   ELSE                                                           0357
*     ;                             /* SECOND ENTRY PERMAMENT ERROR  */
@RF00331 DS    0H                                                  0358
*   RETURN;                                                        0358
@EL00005 DS    0H                                                  0358
@EF00005 DS    0H                                                  0358
@ER00005 LM    @15,@12,16(@13)                                     0358
         BR    @14                                                 0358
*   END DM1ABN;                                                    0359
         B     @EL00005                                            0359
*                                                                  0360
*   /*****************************************************************/
*   /*                                                               */
*   /* THIS SUBROUTINE IS SCHEDULED BY IOS UNDER A SRB WHEN THE I/O  */
*   /* IS COMPLETE. IT'S FUNCTION IS TO POST THE DDR TASK COMPLETE   */
*   /* FOR THE I/O.                                                  */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0360
*DM1SRB:                                                           0360
*   PROC OPTIONS(NOSAVE);                                          0360
*                                                                  0360
DM1SRB   DS    0H                                                  0361
*/*   NO BASE REG NEEDED                                             */
*                                                                  0361
*   IOSBPTR=PARMREG1;               /* WORKAREA IOSB ADDRESS         */
         LR    IOSBPTR,PARMREG1                                    0361
*   SAVERET=R14;                    /* SAVE RETURN ADDRESS           */
         LR    SAVERET,R14                                         0362
*/* OBTAIN LOCAL LOCK                                                */
*                                                                  0363
*   GEN REFS(PSALITA,FLC) SETS(R11,R12,R14);                       0363
*                                                                  0363
GETLOC SETLOCK OBTAIN,TYPE=LOCAL,MODE=UNCOND,                         XX
               RELATED=(LOCAL,IGFDM1(FREELOC))
*/*  BRANCH ENTRY TO POST (IEA0PT01)                                 */
*                                                                  0364
*   DDRPTR=0;                       /* CLEAR REG 10 FOR COMPLETE CODE*/
         SLR   DDRPTR,DDRPTR                                       0364
*   R11=ADDR(CBECB);                /* ECB ADDRESS                   */
         LA    R11,CBECB(,IOSBPTR)                                 0365
*   CALL IEA0PT01;                  /* POST BRANCH ENTRY             */
         L     @12,CVTPTR                                          0366
         L     @15,CVT0PT01(,@12)                                  0366
         BALR  @14,@15                                             0366
*/* RELEASE LOCAL LOCK                                               */
*                                                                  0367
*   GEN REFS(PSALITA,FLC) SETS(R11,R12,R14);                       0367
FREELOC SETLOCK RELEASE,TYPE=LOCAL,                                   XX
               RELATED=(LOCAL,IGFDM1(FREELOC))
*   R14=SAVERET;                    /* RESTORE RETURN ADDRESS        */
         LR    R14,SAVERET                                         0368
*   RETURN;                         /* RETURN TO CALLER              */
@EL00006 DS    0H                                                  0369
@EF00006 DS    0H                                                  0369
@ER00006 BR    @14                                                 0369
*   END DM1SRB;                                                    0370
*   DECLARE                         /* GENERAL PURPOSE REGISTERS     */
*     GPR00P PTR(31) REG(0),                                       0371
*     GPR01P PTR(31) REG(1);                                       0371
*   DECLARE                         /* COMMON VARIABLES              */
*     I256C CHAR(256) BASED,                                       0372
*     I031F FIXED(31) BASED,                                       0372
*     I031P PTR(31) BASED,                                         0372
*     I015F FIXED(15) BASED,                                       0372
*     I015P PTR(15) BASED,                                         0372
*     I008P PTR(8) BASED,                                          0372
*     I001C CHAR(1) BASED;                                         0372
*   END IGFDM1                                                     0373
*                                                                  0373
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */
*/*%INCLUDE SYSLIB  (IHAPSA  )                                       */
*/*%INCLUDE SYSLIB  (IHAASCB )                                       */
*/*%INCLUDE SYSLIB  (CVT     )                                       */
*/*%INCLUDE SYSLIB  (IHAASVT )                                       */
*/*%INCLUDE SYSLIB  (IECDIOSB)                                       */
*/*%INCLUDE SYSLIB  (IECDIOCM)                                       */
*/*%INCLUDE SYSLIB  (IEFUCBOB)                                       */
*/*%INCLUDE SYSLIB  (IHASRB  )                                       */
*/*%INCLUDE SYSLIB  (IHADDR  )                                       */
*                                                                  0373
*       ;                                                          0373
@DATA    DS    0H
@DATD    DSECT
         DS    0F
@SA00001 DS    18F
@SA00002 DS    15F
@SA00003 DS    15F
@AL00001 DS    1A
IGFDM1   CSECT
         DS    0F
@CF00069 DC    F'1'
@CF00038 DC    F'8'
@CF02080 DC    XL4'0000FFFF'
@CF02053 DC    XL4'B'
@DATD    DSECT
         DS    0D
ASCBPTR  DS    A
UCBPTR   DS    A
COMPFLAG DS    BL1
         DS    CL7
CBAREA   DS    CL172
IOSGWA   DS    CL64
MODESETA DS    CL1
         ORG   MODESETA
MODEDEN  DS    BL1
MODEMASK EQU   MODESETA+0
         ORG   MODESETA+1
         DS    CL3
DERPLIST DS    CL48
         ORG   DERPLIST
DERFUNK  DS    AL1
DERSWCHS DS    BL1
         ORG   DERSWCHS
DERCRASH DS    BL1
DERPERK  EQU   DERSWCHS+0
DERECALL EQU   DERSWCHS+0
DERESTAE EQU   DERSWCHS+0
@NM00060 EQU   DERSWCHS+0
         ORG   DERPLIST+2
@NM00061 DS    CL2
DERREC   DS    AL4
DERSPEC  DS    AL4
DERRETRY DS    AL4
DERDATD  DS    CL4
         ORG   DERDATD
DERDASPN DS    FL1
DERDALNG DS    FL3
         ORG   DERPLIST+20
DERRSRC  DS    BL1
         ORG   DERRSRC
DERTAPE  DS    BL1
DERUREC  EQU   DERRSRC+0
DERDISK  EQU   DERRSRC+0
@NM00062 EQU   DERRSRC+0
         ORG   DERPLIST+21
DERLRC   DS    AL1
DERRUB   DS    CL18
         ORG   DERRUB
DERPFX   DS    BL2
DERRCODE DS    AL4
DERRDATA DS    AL4
DERRDDR  DS    AL4
DERRSAVE DS    AL4
         ORG   DERPLIST+40
DERGMSPL DS    CL4
         ORG   DERGMSPL
DERGMSPN DS    FL1
DERGMLNG DS    FL3
         ORG   DERPLIST+44
DERGMADR DS    AL4
         ORG   DERPLIST+48
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA
@ENDDATD EQU   *
IGFDM1   CSECT
         DS    0F
@SIZDATD DC    AL1(245)
         DC    AL3(@ENDDATD-@DATD)
@CV01939 DC    V(IGFDE0)
         DS    0D
@CC02052 DC    C'SRB '
@CB02029 DC    B'0000000011100100'
DERRECPM DS    CL24
         ORG   DERRECPM
@NM00063 DC    CL8'IGFDI0'
@NM00064 DC    CL8'IGFDM1'
@NM00065 DC    CL8'77018'
         ORG   DERRECPM+24
         DS    CL2
IGFDM1P  DC    13F'0'
@00      EQU   00                      EQUATES FOR REGISTERS 0-15
@01      EQU   01
@02      EQU   02
@03      EQU   03
@04      EQU   04
@05      EQU   05
@06      EQU   06
@07      EQU   07
@08      EQU   08
@09      EQU   09
@10      EQU   10
@11      EQU   11
@12      EQU   12
@13      EQU   13
@14      EQU   14
@15      EQU   15
SRBPTR   EQU   @12
CODEBASE EQU   @08
DATABASE EQU   @09
IOSBPTR  EQU   @06
DDRPTR   EQU   @10
PARMREG1 EQU   @01
R11      EQU   @11
R12      EQU   @12
R14      EQU   @14
SAVER13  EQU   @04
PREPTR   EQU   @05
LRAREG   EQU   @07
SAVERET  EQU   @07
SAVEPTR  EQU   @13
RTNCODE  EQU   @15
GPR00P   EQU   @00
GPR01P   EQU   @01
PSA      EQU   0
FLCRNPSW EQU   PSA
FLCROPSW EQU   PSA+8
FLCICCW2 EQU   PSA+16
FLCCVT   EQU   FLCICCW2
PSAEEPSW EQU   PSA+132
PSAESPSW EQU   PSA+136
FLCSVILC EQU   PSAESPSW+1
PSAEPPSW EQU   PSA+140
FLCPIILC EQU   PSAEPPSW+1
FLCPICOD EQU   PSAEPPSW+2
PSAPICOD EQU   FLCPICOD+1
FLCTEA   EQU   PSAEPPSW+4
FLCPER   EQU   PSA+152
FLCMCLA  EQU   PSA+168
FLCIOEL  EQU   FLCMCLA+4
FLCIOA   EQU   FLCMCLA+16
FLCFSA   EQU   FLCMCLA+80
PSASUPER EQU   PSA+552
PSASUP1  EQU   PSASUPER
PSASUP2  EQU   PSASUPER+1
PSASUP3  EQU   PSASUPER+2
PSASUP4  EQU   PSASUPER+3
PSACLHT  EQU   PSA+640
PSALKSA  EQU   PSA+696
PSAHLHI  EQU   PSA+760
PSALITA  EQU   PSA+764
PSADSSFL EQU   PSA+836
PSADSSF1 EQU   PSADSSFL
PSADSSF3 EQU   PSADSSFL+2
PSADSSF4 EQU   PSADSSFL+3
PSARSVT  EQU   PSA+896
ASCB     EQU   0
ASCBFW1  EQU   ASCB+100
ASCBRCTF EQU   ASCBFW1+2
ASCBFLG1 EQU   ASCBFW1+3
ASCBASXB EQU   ASCB+108
ASCBDSP1 EQU   ASCB+114
ASCBFLG2 EQU   ASCB+115
CVTMAP   EQU   0
CVTTCBP  EQU   CVTMAP
CVTDAR   EQU   CVTMAP+72
CVTFLGS1 EQU   CVTDAR
CVTDCB   EQU   CVTMAP+116
CVTIXAVL EQU   CVTMAP+124
CVTIERLC EQU   CVTMAP+144
CVT0PT01 EQU   CVTMAP+152
CVTOPTA  EQU   CVTMAP+182
CVTOPTB  EQU   CVTMAP+183
CVTGTF   EQU   CVTMAP+236
CVTGTFST EQU   CVTGTF
CVTGTFS  EQU   CVTGTFST
CVTSTATE EQU   CVTGTFST
CVTTMODE EQU   CVTGTFST
CVTFORM  EQU   CVTGTFST
CVTAQAVT EQU   CVTMAP+240
CVTTCMFG EQU   CVTAQAVT
CVTVOLM2 EQU   CVTMAP+244
CVTTATA  EQU   CVTVOLM2
CVTTSKS  EQU   CVTTATA
CVTVOLF2 EQU   CVTTSKS
CVTTAT   EQU   CVTTATA+1
CVTATER  EQU   CVTMAP+248
CVTEXT1  EQU   CVTMAP+252
CVTPURG  EQU   CVTMAP+260
CVTQMSG  EQU   CVTMAP+268
CVTDMSR  EQU   CVTMAP+272
CVTRSV37 EQU   CVTDMSR
CVTDMSRF EQU   CVTRSV37
CVTERPV  EQU   CVTMAP+316
CVTINTLA EQU   CVTMAP+320
CVTAPF   EQU   CVTMAP+324
CVTEXT2  EQU   CVTMAP+328
CVTHJES  EQU   CVTMAP+332
CVTPGSIA EQU   CVTMAP+348
CVTA1F1  EQU   CVTMAP+356
CVTSYSK  EQU   CVTMAP+357
CVTVOLM1 EQU   CVTMAP+380
CVTVOLF1 EQU   CVTVOLM1
CVTATMCT EQU   CVTMAP+388
CVTXTNT1 EQU   0
CVTXTNT2 EQU   0
CVTDSSV  EQU   CVTXTNT2
CVTFLGBT EQU   CVTXTNT2+5
CVTQID   EQU   CVTXTNT2+24
CVTRV400 EQU   CVTXTNT2+52
CVTRV409 EQU   CVTXTNT2+53
CVTATCVT EQU   CVTXTNT2+64
CVTRV429 EQU   CVTXTNT2+84
CVTRV438 EQU   CVTXTNT2+85
CVTRV457 EQU   CVTXTNT2+112
CVTRV466 EQU   CVTXTNT2+113
CVTFIX   EQU   0
CVTRELNO EQU   CVTFIX+252
ASVT     EQU   0
ASVTFRST EQU   ASVT+524
ASVTENTY EQU   ASVT+528
IOSB     EQU   0
IOSFLA   EQU   IOSB
IOSACHN  EQU   IOSFLA
IOSEX    EQU   IOSFLA
IOSFLB   EQU   IOSB+1
IOSFLC   EQU   IOSB+2
IOSDVALT EQU   IOSFLC
IOSDVRID EQU   IOSB+4
IOSASID  EQU   IOSB+6
IOSPGAD  EQU   IOSB+8
IOSPKEY  EQU   IOSB+12
IOSLCL   EQU   IOSPKEY
IOSCOD   EQU   IOSB+13
IOSOPT   EQU   IOSB+14
IOSQISCE EQU   IOSOPT
IOSNERP  EQU   IOSOPT
IOSOPT2  EQU   IOSB+15
IOSUCB   EQU   IOSB+16
@NM00029 EQU   IOSB+20
IOSCC    EQU   @NM00029
IOSCSW   EQU   @NM00029+1
IOSTATUS EQU   IOSCSW+3
IOSTSA   EQU   IOSTATUS
IOSCSWRC EQU   IOSCSW+5
IOSSRB   EQU   IOSB+28
IOSSNS   EQU   IOSB+42
IOSIPIB  EQU   IOSB+44
IOSNRM   EQU   IOSB+60
IOSABN   EQU   IOSB+64
IOSDIE   EQU   IOSB+68
IOSDIEFG EQU   IOSDIE
IOSRST   EQU   IOSB+72
IOSVST   EQU   IOSB+76
IOSPATH  EQU   IOSB+86
IOSCHN   EQU   IOSPATH
IOSFMSK  EQU   IOSB+88
IOSCKEY  EQU   IOSB+89
IOSEEKA  EQU   IOSB+100
IOSCCHH  EQU   IOSEEKA+3
IOSSKHH  EQU   IOSCCHH+2
IOCOM    EQU   0
IOCSTIO  EQU   IOCOM+28
IOCGENA  EQU   IOCOM+84
UCB      EQU   0
UCBOB    EQU   0
UCBJBNR  EQU   UCBOB
UCBFL5   EQU   UCBOB+1
UCBAF    EQU   UCBFL5
UCBSTAT  EQU   UCBOB+3
UCBCHAN  EQU   UCBOB+4
UCBSFLS  EQU   UCBOB+6
UCBFLA   EQU   UCBSFLS
UCBFL1   EQU   UCBFLA
UCBBSY   EQU   UCBFL1
UCBNRY   EQU   UCBFL1
UCBPST   EQU   UCBFL1
UCBCUB   EQU   UCBFL1
UCBQISCE EQU   UCBFL1
UCBFLB   EQU   UCBSFLS+1
UCBCHM   EQU   UCBOB+8
UCBCHM1  EQU   UCBCHM
UCBPTH0  EQU   UCBCHM1
UCBPTH1  EQU   UCBCHM1
UCBWGT   EQU   UCBOB+12
UCBTYP   EQU   UCBOB+16
UCBTBYT1 EQU   UCBTYP
UCB1FEA5 EQU   UCBTBYT1
UCB1FEA6 EQU   UCBTBYT1
UCBTBYT2 EQU   UCBTYP+1
UCB2OPT0 EQU   UCBTBYT2
UCB2OPT2 EQU   UCBTBYT2
UCBDUDN1 EQU   UCB2OPT2
UCB2OPT3 EQU   UCBTBYT2
UCBDUDN2 EQU   UCB2OPT3
UCB2OPT4 EQU   UCBTBYT2
UCBRWTAU EQU   UCB2OPT4
UCB2OPT6 EQU   UCBTBYT2
UCB2OPT7 EQU   UCBTBYT2
UCBTBYT3 EQU   UCBTYP+2
UCBDVCLS EQU   UCBTBYT3
UCB3TAPE EQU   UCBDVCLS
UCBTBYT4 EQU   UCBTYP+3
UCBEXTPT EQU   UCBOB+20
UCBFLC   EQU   UCBEXTPT
UCBDDRSW EQU   UCBFLC
UCBDEV   EQU   UCBOB+24
UCBCMEXT EQU   0
UCBATI   EQU   UCBCMEXT+3
@NM00040 EQU   UCBATI
UCBFLP1  EQU   UCBCMEXT+5
UCBCCWOF EQU   UCBCMEXT+8
UCBMT    EQU   0
UCBOCR   EQU   0
UCB3540X EQU   0
UCBDKBYT EQU   UCB3540X+6
UCB3800X EQU   0
UCBOPTNS EQU   UCB3800X
UCBACTIV EQU   UCB3800X+3
UCBMDRBF EQU   UCB3800X+36
UCBUCS   EQU   0
UCBUCSOP EQU   UCBUCS+4
UCBFCBOP EQU   UCBUCS+5
UCBBGN   EQU   0
SRBSECT  EQU   0
SRB      EQU   SRBSECT
SRBID    EQU   SRB
SRBASCB  EQU   SRB+8
SRBFLC   EQU   SRB+12
SRBPASID EQU   SRBFLC+2
SRBPTCB  EQU   SRBFLC+4
SRBEP    EQU   SRB+20
SRBPARM  EQU   SRB+28
DDRCOM   EQU   0
DDRSHORT EQU   DDRCOM
DDRCNTRL EQU   DDRSHORT+8
DDRSRC   EQU   DDRCNTRL
DDRSTAT  EQU   DDRCNTRL+1
DDRDCHAR EQU   DDRCNTRL+2
DDRDSTAT EQU   DDRDCHAR+1
DDRDA    EQU   DDRDSTAT
DDRMT    EQU   DDRDSTAT
DDRLONG  EQU   DDRCOM+24
DDRTOUCB EQU   DDRLONG
DDRFMUCB EQU   DDRLONG+4
DDRROWN  EQU   DDRLONG+8
DDRASID  EQU   DDRLONG+10
DDRMIHT  EQU   DDRLONG+12
DDRTER   EQU   DDRLONG+36
DDRINV   EQU   DDRLONG+38
DDRAPP   EQU   DDRLONG+40
DDRIBUFL EQU   DDRLONG+42
DDRIBUF  EQU   DDRLONG+44
DDRCOUNT EQU   DDRLONG+48
DDRIOF   EQU   DDRLONG+52
DDRIOF1  EQU   DDRIOF
DDRIOF2  EQU   DDRIOF+1
DDRWHICH EQU   DDRIOF2
DDRITAKE EQU   DDRIOF2
DDRILAB  EQU   DDRIOF2
DDRIMNT  EQU   DDRIOF2
DDRICNT  EQU   DDRIOF2
DDRMSG   EQU   DDRLONG+54
DDRMSGP  EQU   DDRLONG+56
DDRLABEL EQU   DDRLONG+64
DDRLSD   EQU   DDRLABEL
DDRREC   EQU   DDRLONG+66
DDRREC2  EQU   DDRREC+1
DDRUSER  EQU   DDRLONG+68
DDRUMODE EQU   DDRUSER
IEA0PT01 EQU   0
CONTROLB EQU   0
CBIOSB   EQU   CONTROLB
CBSRB    EQU   CONTROLB+108
CBECB    EQU   CONTROLB+152
CBCOUNT  EQU   CONTROLB+156
CBCCW    EQU   CONTROLB+160
CBCCW0   EQU   CBCCW
CBCCW1   EQU   CBCCW+1
CBCCW4   EQU   CBCCW+4
CBCCW6   EQU   CBCCW+6
CBDDRCOM EQU   CONTROLB+168
NEWOLD   EQU   0
OLDTCB   EQU   NEWOLD+4
I001C    EQU   0
I008P    EQU   0
I015F    EQU   0
I015P    EQU   0
I031F    EQU   0
I031P    EQU   0
I256C    EQU   0
FLC      EQU   PSA
PSARSVTE EQU   PSARSVT
CVTPTR   EQU   FLCCVT
CVTS01   EQU   CVTPGSIA
CVTLPDIA EQU   CVTS01+12
CVTDIRST EQU   CVTLPDIA
CVTSLIDA EQU   CVTS01+24
CVTCTLFG EQU   CVTS01+50
CVTASVT  EQU   CVTS01+208
CVTRV210 EQU   CVTS01+424
CVTRV219 EQU   CVTS01+425
CVTRV228 EQU   CVTS01+426
CVTRV237 EQU   CVTS01+427
CVTMFRTR EQU   CVTS01+452
CVTRV262 EQU   CVTS01+468
CVTRV271 EQU   CVTS01+469
CVTRV280 EQU   CVTS01+470
CVTRV289 EQU   CVTS01+471
CVTGSDA  EQU   CVTS01+600
ASVTPTR  EQU   CVTASVT
IOSATTSC EQU   IOSIPIB
IOSWTOWA EQU   IOSIPIB
IOSPCISC EQU   IOSIPIB
IOCOMPTR EQU   CVTIXAVL
UCBOBS01 EQU   UCBDEV
UCBSTAB  EQU   UCBOBS01+10
UCBBSVL  EQU   UCBSTAB
UCBPRSRS EQU   UCBSTAB
UCBDMCT  EQU   UCBOBS01+11
UCBMOUNT EQU   UCBDMCT
UCBFL4   EQU   UCBOBS01+13
UCBOBS02 EQU   UCBDEV
UCBTFL1  EQU   UCBOBS02+19
UCBXTN   EQU   UCBOBS02+20
UCBVOPT  EQU   UCBXTN
UCBOBS03 EQU   UCBDEV
UCBXTADR EQU   UCBOBS03
UCBOBS04 EQU   UCBDEV
UCBBTA   EQU   UCBOBS04+12
UCBOBS06 EQU   UCBDEV
UCBAOF   EQU   UCBOBS06
UCBAOF1  EQU   UCBAOF
UCBAOF2  EQU   UCBAOF+1
@NM00039 EQU   UCBOBS06+3
UCBIRB   EQU   UCBOBS06+4
UCBGRAF  EQU   UCBIRB
UCBLDNCA EQU   UCBOBS06+8
UCBRDYQ  EQU   UCBLDNCA
UCBIRLN  EQU   UCBRDYQ
UCBLDNCB EQU   UCBRDYQ+1
UCBCTLNK EQU   UCBOBS06+12
UCBOBS07 EQU   UCBDEV
UCBOBS08 EQU   UCBDEV
UCBCTCAD EQU   UCBOBS08
UCBCTCF1 EQU   UCBOBS08+4
UCBOBS09 EQU   UCBDEV
VIOSBDEV EQU   IOSTSA
VIOSBUCK EQU   VIOSBDEV
VIOSSNS  EQU   IOSSNS
VIOSSNS0 EQU   VIOSSNS
VIOSINTR EQU   VIOSSNS0
VIOSBDCK EQU   VIOSSNS0
VIOSBOVR EQU   VIOSSNS0
VIOSSNS1 EQU   VIOSSNS+1
VIOSSN1B EQU   VIOSSNS1
VIOSSN2B EQU   VIOSSNS1
ASXBPTR  EQU   ASCBASXB
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS
@NM00056 EQU   VIOSSNS1
@NM00055 EQU   VIOSSNS0
@NM00054 EQU   VIOSSNS0
@NM00053 EQU   VIOSSNS0
@NM00052 EQU   VIOSBDEV
@NM00051 EQU   VIOSBDEV
UCBRV066 EQU   UCBOBS09+4
UCBIOSBA EQU   UCBOBS09
UCBRV042 EQU   UCBOBS08+5
UCBRV082 EQU   UCBCTCF1
UCBRV081 EQU   UCBCTCF1
UCBRV080 EQU   UCBCTCF1
UCBRV079 EQU   UCBCTCF1
UCBRV078 EQU   UCBCTCF1
UCBRV077 EQU   UCBCTCF1
UCBRV076 EQU   UCBCTCF1
UCBCTC80 EQU   UCBCTCF1
UCBCTCAL EQU   UCBCTCAD
UCBICNCB EQU   UCBOBS07+4
UCBRV040 EQU   UCBOBS07
UCBCTLNA EQU   UCBCTLNK+1
UCBRLN   EQU   UCBCTLNK
UCBRDYQA EQU   UCBLDNCB
UCBINRLN EQU   UCBIRLN
UCBIRBA  EQU   UCBIRB+1
UCBRV039 EQU   UCBGRAF
UCBDWNR  EQU   UCBGRAF
UCBRPND  EQU   UCBGRAF
UCBUPM   EQU   UCBGRAF
UCBBTAM  EQU   UCBGRAF
UCBDRNO  EQU   UCBGRAF
UCBDRO   EQU   UCBGRAF
UCBOIP   EQU   UCBGRAF
UCBATRCD EQU   @NM00039
UCBSKPFG EQU   @NM00039
UCBRIPND EQU   @NM00039
UCBRTIAC EQU   @NM00039
UCBRSV79 EQU   @NM00039
UCBRSV78 EQU   @NM00039
UCBRSV77 EQU   @NM00039
UCBOLTEP EQU   @NM00039
UCBATNCT EQU   UCBOBS06+2
UCBRSV76 EQU   UCBAOF2
UCBRSV75 EQU   UCBAOF2
UCBRSV74 EQU   UCBAOF2
UCBRSV73 EQU   UCBAOF2
UCBRSV72 EQU   UCBAOF2
UCBRSV71 EQU   UCBAOF2
UCBRSV70 EQU   UCBAOF2
UCBRSV69 EQU   UCBAOF2
UCBRSV68 EQU   UCBAOF1
UCBRSV67 EQU   UCBAOF1
UCBRSV66 EQU   UCBAOF1
UCBRSV65 EQU   UCBAOF1
UCBRSV64 EQU   UCBAOF1
UCBOFNL  EQU   UCBAOF1
UCBOFSP  EQU   UCBAOF1
UCBOFMCR EQU   UCBAOF1
UCBBTB   EQU   UCBBTA+1
UCBDI    EQU   UCBBTA
UCBSNS   EQU   UCBOBS04+8
UCBTEB   EQU   UCBOBS04+4
UCBGCB   EQU   UCBOBS04+3
UCBOPEN  EQU   UCBOBS04+2
UCBSTART EQU   UCBOBS04
UCBXTNB  EQU   UCBXTN+1
UCBRSV22 EQU   UCBVOPT
UCBRSV21 EQU   UCBVOPT
UCBRSV20 EQU   UCBVOPT
UCBESVE  EQU   UCBVOPT
UCBERPC  EQU   UCBVOPT
UCBESVC  EQU   UCBVOPT
UCBEVA   EQU   UCBVOPT
UCBESV   EQU   UCBVOPT
UCBRV009 EQU   UCBTFL1
UCBRV008 EQU   UCBTFL1
UCBRV007 EQU   UCBTFL1
UCBRV006 EQU   UCBTFL1
UCBRV005 EQU   UCBTFL1
UCBRV038 EQU   UCBTFL1
UCBNSLTP EQU   UCBTFL1
UCBNLTP  EQU   UCBTFL1
UCBRES1B EQU   UCBOBS02+18
UCBFSER  EQU   UCBOBS02+12
@NM00038 EQU   UCBOBS02+4
UCBFSEQ  EQU   UCBOBS02+2
UCBFSCT  EQU   UCBOBS02
UCBNEXP  EQU   UCBOBS01+20
UCBBASE  EQU   UCBOBS01+16
UCBRES1A EQU   UCBOBS01+15
UCBUSER  EQU   UCBOBS01+14
UCBFL47  EQU   UCBFL4
UCBFL46  EQU   UCBFL4
UCBFL45  EQU   UCBFL4
UCBRV065 EQU   UCBFL4
UCBDSS   EQU   UCBFL4
UCBRESVP EQU   UCBFL4
UCBWDAV  EQU   UCBFL4
UCBDAVV  EQU   UCBFL4
UCBSQC   EQU   UCBOBS01+12
UCBDATP  EQU   UCBOBS01+12
UCBDMC   EQU   UCBDMCT
UCBBNUL  EQU   UCBSTAB
UCBSHAR  EQU   UCBSTAB
UCBBSTR  EQU   UCBSTAB
UCBBPUB  EQU   UCBSTAB
UCBBPRV  EQU   UCBSTAB
UCBBALB  EQU   UCBPRSRS
UCBPGFL  EQU   UCBSTAB
UCBDVSHR EQU   UCBBSVL
UCBVOLI  EQU   UCBOBS01+4
UCBVTOC  EQU   UCBOBS01
IOSPCIWA EQU   IOSPCISC+44
IOSPCIRS EQU   IOSPCISC+8
@NM00034 EQU   IOSPCISC+4
@NM00033 EQU   IOSPCISC
IOSWRNDR EQU   IOSWTOWA+4
IOSWTOPT EQU   IOSWTOWA+3
IOSWTOCP EQU   IOSWTOWA+2
IOSWTOCH EQU   IOSWTOWA
IOSATTWA EQU   IOSATTSC+40
@NM00032 EQU   IOSATTSC+24
IOSATTSN EQU   IOSATTSC
CVTRV628 EQU   CVTS01+728
CVTRV627 EQU   CVTS01+724
CVTRV626 EQU   CVTS01+720
CVTRV625 EQU   CVTS01+716
CVTRV624 EQU   CVTS01+712
CVTRV623 EQU   CVTS01+708
CVTRV622 EQU   CVTS01+704
CVTRV621 EQU   CVTS01+700
CVTIHASU EQU   CVTS01+696
CVTRV619 EQU   CVTS01+692
CVTRV618 EQU   CVTS01+688
CVTRV617 EQU   CVTS01+684
CVTRV616 EQU   CVTS01+680
CVTRV615 EQU   CVTS01+676
CVTRV614 EQU   CVTS01+672
CVTRV613 EQU   CVTS01+668
CVTTCASP EQU   CVTS01+664
CVT0PT03 EQU   CVTS01+660
CVT0PT0E EQU   CVTS01+656
CVTRV609 EQU   CVTS01+652
CVTCGK   EQU   CVTS01+648
CVTRAC   EQU   CVTS01+644
CVTRV606 EQU   CVTS01+640
CVTRV605 EQU   CVTS01+636
CVTRV604 EQU   CVTS01+632
CVTEFF02 EQU   CVTS01+628
CVTCBBR  EQU   CVTS01+624
CVTSSCR  EQU   CVTS01+620
CVTEVENT EQU   CVTS01+616
CVTCRCA  EQU   CVTS01+612
CVTTPIO  EQU   CVTS01+608
CVTADV   EQU   CVTS01+604
CVTGSDAB EQU   CVTGSDA
CVTQV3   EQU   CVTS01+596
CVTQV2   EQU   CVTS01+592
CVTQV1   EQU   CVTS01+588
CVTRPT   EQU   CVTS01+584
CVTSSRB  EQU   CVTS01+580
CVTCSDRL EQU   CVTS01+576
CVTEXP1  EQU   CVTS01+572
CVTRMPMT EQU   CVTS01+568
CVTRMPTT EQU   CVTS01+564
CVTVPSA  EQU   CVTS01+560
CVTVSTOP EQU   CVTS01+556
CVTGTFR8 EQU   CVTS01+552
CVTQUIT  EQU   CVTS01+548
CVTVACR  EQU   CVTS01+544
CVTWTCB  EQU   CVTS01+540
CVTSTPRS EQU   CVTS01+536
CVT0PT02 EQU   CVTS01+532
CVTDARCM EQU   CVTS01+528
CVTIRECM EQU   CVTS01+524
CVTJRECM EQU   CVTS01+520
CVTVEMS0 EQU   CVTS01+516
CVTSPFRR EQU   CVTS01+512
CVTRLSTG EQU   CVTS01+508
CVT0TC0A EQU   CVTS01+504
CVTGMBR  EQU   CVTS01+500
CVTLFRM  EQU   CVTS01+496
CVTRMBR  EQU   CVTS01+492
CVTVIOP  EQU   CVTS01+488
CVTRV307 EQU   CVTS01+486
CVTRV306 EQU   CVTS01+484
CVTRV305 EQU   CVTS01+482
CVTRV304 EQU   CVTS01+480
CVTRV303 EQU   CVTS01+478
CVTRV302 EQU   CVTS01+476
CVTTRCA  EQU   CVTS01+472
CVTRV297 EQU   CVTRV289
CVTRV296 EQU   CVTRV289
CVTRV295 EQU   CVTRV289
CVTRV294 EQU   CVTRV289
CVTRV293 EQU   CVTRV289
CVTRV292 EQU   CVTRV289
CVTRV291 EQU   CVTRV289
CVTRV290 EQU   CVTRV289
CVTRV288 EQU   CVTRV280
CVTRV287 EQU   CVTRV280
CVTRV286 EQU   CVTRV280
CVTRV285 EQU   CVTRV280
CVTRV284 EQU   CVTRV280
CVTRV283 EQU   CVTRV280
CVTRV282 EQU   CVTRV280
CVTRV281 EQU   CVTRV280
CVTRV279 EQU   CVTRV271
CVTRV278 EQU   CVTRV271
CVTRV277 EQU   CVTRV271
CVTRV276 EQU   CVTRV271
CVTRV275 EQU   CVTRV271
CVTRV274 EQU   CVTRV271
CVTRV273 EQU   CVTRV271
CVTRV272 EQU   CVTRV271
CVTRV270 EQU   CVTRV262
CVTRV269 EQU   CVTRV262
CVTRV268 EQU   CVTRV262
CVTRV267 EQU   CVTRV262
CVTRV266 EQU   CVTRV262
CVTRV265 EQU   CVTRV262
CVTRV264 EQU   CVTRV262
CVTRV263 EQU   CVTRV262
CVTVFP   EQU   CVTS01+464
CVTVSI   EQU   CVTS01+460
CVTVPSIB EQU   CVTS01+456
CVTMFACT EQU   CVTMFRTR
CVTMFCTL EQU   CVTS01+448
CVTPVBP  EQU   CVTS01+444
CVTPWI   EQU   CVTS01+440
CVTRV254 EQU   CVTS01+438
CVTRV253 EQU   CVTS01+436
CVTRV252 EQU   CVTS01+434
CVTRV251 EQU   CVTS01+433
CVTRV250 EQU   CVTS01+432
CVTRV249 EQU   CVTS01+431
CVTRV248 EQU   CVTS01+430
CVTRV247 EQU   CVTS01+429
CVTRV246 EQU   CVTS01+428
CVTRV245 EQU   CVTRV237
CVTRV244 EQU   CVTRV237
CVTRV243 EQU   CVTRV237
CVTRV242 EQU   CVTRV237
CVTRV241 EQU   CVTRV237
CVTRV240 EQU   CVTRV237
CVTRV239 EQU   CVTRV237
CVTRV238 EQU   CVTRV237
CVTRV236 EQU   CVTRV228
CVTRV235 EQU   CVTRV228
CVTRV234 EQU   CVTRV228
CVTRV233 EQU   CVTRV228
CVTRV232 EQU   CVTRV228
CVTRV231 EQU   CVTRV228
CVTRV230 EQU   CVTRV228
CVTRV229 EQU   CVTRV228
CVTRV227 EQU   CVTRV219
CVTRV226 EQU   CVTRV219
CVTRV225 EQU   CVTRV219
CVTRV224 EQU   CVTRV219
CVTRV223 EQU   CVTRV219
CVTRV222 EQU   CVTRV219
CVTRV221 EQU   CVTRV219
CVTRV220 EQU   CVTRV219
CVTRV218 EQU   CVTRV210
CVTRV217 EQU   CVTRV210
CVTRV216 EQU   CVTRV210
CVTRV215 EQU   CVTRV210
CVTRV214 EQU   CVTRV210
CVTRV213 EQU   CVTRV210
CVTRV212 EQU   CVTRV210
CVTRV211 EQU   CVTRV210
CVTLCCAT EQU   CVTS01+420
CVTPCCAT EQU   CVTS01+416
CVTIPCRP EQU   CVTS01+412
CVTIPCRI EQU   CVTS01+408
CVTIPCDS EQU   CVTS01+404
CVTAIDVT EQU   CVTS01+400
CVTSSAP  EQU   CVTS01+396
CVTEHCIR EQU   CVTS01+392
CVTEHDEF EQU   CVTS01+388
CVTDAIR  EQU   CVTS01+384
CVTPERFM EQU   CVTS01+380
CVT044R2 EQU   CVTS01+376
CVTFETCH EQU   CVTS01+372
CVTRSTWD EQU   CVTS01+368
CVTSPOST EQU   CVTS01+364
CVTIOBP  EQU   CVTS01+360
CVTASMVT EQU   CVTS01+356
CVTRECRQ EQU   CVTS01+352
CVTWSAC  EQU   CVTS01+348
CVTRV149 EQU   CVTS01+344
CVTWSAL  EQU   CVTS01+340
CVTSPSA  EQU   CVTS01+336
CVTGLMN  EQU   CVTS01+332
CVTVEAC0 EQU   CVTS01+328
CVT062R1 EQU   CVTS01+324
CVTRPOST EQU   CVTS01+320
CVTDQIQE EQU   CVTS01+316
CVTCSD   EQU   CVTS01+312
CVTLKRMA EQU   CVTS01+308
CVTRSPIE EQU   CVTS01+304
CVTRENQ  EQU   CVTS01+300
CVTLQCB  EQU   CVTS01+296
CVTFQCB  EQU   CVTS01+292
CVTQCS01 EQU   CVTS01+288
CVTAPFT  EQU   CVTS01+284
CVTPARRL EQU   CVTS01+280
CVTVWAIT EQU   CVTS01+276
CVTGSPL  EQU   CVTS01+272
CVTLSMQ  EQU   CVTS01+268
CVTGSMQ  EQU   CVTS01+264
CVTEXPRO EQU   CVTS01+260
CVTOPCTP EQU   CVTS01+256
CVTSIC   EQU   CVTS01+252
CVTTPIOS EQU   CVTS01+248
CVTRTMS  EQU   CVTS01+244
CVTSDBF  EQU   CVTS01+240
CVTSCBP  EQU   CVTS01+236
CVTSDMP  EQU   CVTS01+232
CVTSV60  EQU   CVTS01+228
CVTRTMCT EQU   CVTS01+224
CVTASCBL EQU   CVTS01+220
CVTASCBH EQU   CVTS01+216
CVTGDA   EQU   CVTS01+212
CVTVVMDI EQU   CVTS01+204
CVTAQTOP EQU   CVTS01+200
CVTIOSCS EQU   CVTS01+196
CVTSDRM  EQU   CVTS01+192
CVTOPTE  EQU   CVTS01+188
CVTSTXU  EQU   CVTS01+184
CVTQUIS  EQU   CVTS01+180
CVTPARS  EQU   CVTS01+176
CVTS1EE  EQU   CVTS01+172
CVTFRAS  EQU   CVTS01+168
CVTQSAS  EQU   CVTS01+164
CVTCRAS  EQU   CVTS01+160
CVTCRMN  EQU   CVTS01+156
CVTDELCP EQU   CVTS01+152
CVTFRECL EQU   CVTS01+148
CVTGETCL EQU   CVTS01+144
CVTBLDCP EQU   CVTS01+140
CVTAUTHL EQU   CVTS01+136
CVTSCAN  EQU   CVTS01+132
CVTRV144 EQU   CVTS01+130
CVTMAXMP EQU   CVTS01+128
CVTSTCK  EQU   CVTS01+124
CVTRV139 EQU   CVTS01+123
CVTDSSAC EQU   CVTS01+122
CVTRV513 EQU   CVTS01+121
CVTIOSPL EQU   CVTS01+120
CVTPTGT  EQU   CVTS01+116
CVTCSPIE EQU   CVTS01+112
CVTSMFEX EQU   CVTS01+108
CVTOLT0A EQU   CVTS01+104
CVTSRBRT EQU   CVTS01+100
CVTPUTL  EQU   CVTS01+96
CVTASCRL EQU   CVTS01+92
CVTASCRF EQU   CVTS01+88
CVTRV326 EQU   CVTS01+84
CVTRV325 EQU   CVTS01+80
CVTRV324 EQU   CVTS01+76
CVT0VL01 EQU   CVTS01+72
CVTSHRVM EQU   CVTS01+68
CVTRV332 EQU   CVTS01+64
CVTTAS   EQU   CVTS01+60
CVTRSCN  EQU   CVTS01+56
CVTTRAC2 EQU   CVTS01+54
CVTTRACE EQU   CVTS01+52
CVTAPG   EQU   CVTS01+51
CVTSDTRC EQU   CVTCTLFG
CVTGTRCE EQU   CVTCTLFG
CVTNOMP  EQU   CVTCTLFG
CVTRSV79 EQU   CVTCTLFG
CVTDSTAT EQU   CVTCTLFG
CVTRSV78 EQU   CVTCTLFG
CVTRV333 EQU   CVTCTLFG
CVTRV323 EQU   CVTCTLFG
CVTSPVLK EQU   CVTS01+49
CVTRSV77 EQU   CVTS01+48
CVTRV331 EQU   CVTS01+44
CVTRV330 EQU   CVTS01+40
CVTRV329 EQU   CVTS01+36
CVTRV328 EQU   CVTS01+32
CVTRV322 EQU   CVTS01+28
CVTSLID  EQU   CVTSLIDA+1
CVTSYLK  EQU   CVTSLIDA
CVTRV321 EQU   CVTS01+20
CVTRV320 EQU   CVTS01+16
CVTLPDIR EQU   CVTLPDIA+1
CVTRSV69 EQU   CVTDIRST
CVTRSV68 EQU   CVTDIRST
CVTRSV67 EQU   CVTDIRST
CVTRSV66 EQU   CVTDIRST
CVTRSV65 EQU   CVTDIRST
CVTRSV64 EQU   CVTDIRST
CVTRSV63 EQU   CVTDIRST
CVTDICOM EQU   CVTDIRST
CVTPVTP  EQU   CVTS01+8
CVTLPDSR EQU   CVTS01+4
CVTGETL  EQU   CVTS01
PSARSAV  EQU   PSARSVTE+60
PSARSTK  EQU   PSARSVTE+56
PSAESAV3 EQU   PSARSVTE+52
PSAESTK3 EQU   PSARSVTE+48
PSAESAV2 EQU   PSARSVTE+44
PSAESTK2 EQU   PSARSVTE+40
PSAESAV1 EQU   PSARSVTE+36
PSAESTK1 EQU   PSARSVTE+32
PSAPSAV  EQU   PSARSVTE+28
PSAPSTK  EQU   PSARSVTE+24
PSAMSAV  EQU   PSARSVTE+20
PSAMSTK  EQU   PSARSVTE+16
PSASSAV  EQU   PSARSVTE+12
PSASSTK  EQU   PSARSVTE+8
PSANSTK  EQU   PSARSVTE+4
PSACSTK  EQU   PSARSVTE
@NM00059 EQU   NEWOLD+12
@NM00058 EQU   NEWOLD+8
@NM00057 EQU   NEWOLD
CBCCW5   EQU   CBCCW+5
DDRSSOB  EQU   DDRLONG+76
DDRUBCNT EQU   DDRLONG+72
@NM00050 EQU   DDRUSER+1
@NM00049 EQU   DDRREC2
DDRRFMTO EQU   DDRREC2
DDRREC1  EQU   DDRREC
DDRRETRY EQU   DDRLONG+65
DDRLNOP  EQU   DDRLABEL
@NM00048 EQU   DDRLABEL
DDRLNSL  EQU   DDRLABEL
DDRLNL   EQU   DDRLABEL
DDRLBLP  EQU   DDRLABEL
DDRLAL   EQU   DDRLABEL
DDRMSGPC EQU   DDRMSGP+1
DDRMSGPN EQU   DDRMSGP
DDRMSGCD EQU   DDRMSG+1
DDRMSGOP EQU   DDRMSG
@NM00047 EQU   DDRIOF2
DDRAPP2  EQU   DDRAPP+1
DDRAPP1  EQU   DDRAPP
DDRINV2  EQU   DDRINV+1
DDRINV1  EQU   DDRINV
DDRTER2  EQU   DDRTER+1
DDRTER1  EQU   DDRTER
DDRTEST  EQU   DDRLONG+32
DDRUASCB EQU   DDRLONG+28
DDRUTCB  EQU   DDRLONG+24
DDRUIOB  EQU   DDRLONG+20
DDRUDEB  EQU   DDRMIHT+4
DDRUDCB  EQU   DDRMIHT
DDRMIH   EQU   DDRLONG+9
DDRFIRST EQU   DDRROWN
DDRJES3L EQU   DDRROWN
@NM00046 EQU   DDRROWN
DDRRDENQ EQU   DDRROWN
DDRRUENQ EQU   DDRROWN
DDRRTENQ EQU   DDRROWN
DDRTOCUA EQU   DDRSHORT+21
DDRFMCUA EQU   DDRSHORT+18
DDRUASID EQU   DDRSHORT+16
DDRUIOSB EQU   DDRSHORT+12
@NM00045 EQU   DDRDSTAT
DDRUR    EQU   DDRDSTAT
DDRBUFL  EQU   DDRDSTAT
DDRMDR   EQU   DDRDCHAR
@NM00044 EQU   DDRSTAT
DDRSIRB  EQU   DDRSTAT
DDRPRG   EQU   DDRSTAT
DDRRMV   EQU   DDRSTAT
DDRHAMA  EQU   DDRSTAT
DDRQUE   EQU   DDRSTAT
DDRACTV  EQU   DDRSTAT
@NM00043 EQU   DDRSRC
DDRPAGE  EQU   DDRSRC
DDRSYS   EQU   DDRSRC
DDROPER  EQU   DDRSRC
DDRNXT   EQU   DDRSHORT+4
DDRID    EQU   DDRSHORT
@NM00042 EQU   SRB+40
@NM00041 EQU   SRB+38
SRBPRIOR EQU   SRB+37
SRBPKF   EQU   SRB+36
SRBSAVE  EQU   SRB+32
SRBRMTR  EQU   SRB+24
SRBCPAFF EQU   SRBFLC
SRBFLNK  EQU   SRB+4
UCBERADR EQU   UCBUCS+12
UCBFCBID EQU   UCBUCS+8
UCBERCNT EQU   UCBUCS+7
UCBRSV51 EQU   UCBUCS+6
UCBRSV50 EQU   UCBFCBOP
UCBRSV49 EQU   UCBFCBOP
UCBRSV48 EQU   UCBFCBOP
UCBRSV47 EQU   UCBFCBOP
UCBRSV46 EQU   UCBFCBOP
UCBRSV45 EQU   UCBFCBOP
UCBRSV44 EQU   UCBFCBOP
UCBFCBO1 EQU   UCBFCBOP
UCBUCSPE EQU   UCBUCSOP
UCBRSV43 EQU   UCBUCSOP
UCBRSV42 EQU   UCBUCSOP
UCBRSV41 EQU   UCBUCSOP
UCBRSV40 EQU   UCBUCSOP
UCBRSV39 EQU   UCBUCSOP
UCBUCSO2 EQU   UCBUCSOP
UCBUCSO1 EQU   UCBUCSOP
UCBUCSID EQU   UCBUCS
UCBMDRBA EQU   UCBMDRBF+1
UCBRV075 EQU   UCBMDRBF
UCBRV074 EQU   UCB3800X+32
UCBIMAGE EQU   UCB3800X+28
UCBFCBNM EQU   UCB3800X+24
UCBCHAR4 EQU   UCB3800X+20
UCBCHAR3 EQU   UCB3800X+16
UCBCHAR2 EQU   UCB3800X+12
UCBCHAR1 EQU   UCB3800X+8
UCBCGMID EQU   UCB3800X+4
UCBBRSTA EQU   UCBACTIV
UCBRV063 EQU   UCBACTIV
UCBRV062 EQU   UCBACTIV
UCBRV061 EQU   UCBACTIV
UCBRV060 EQU   UCBACTIV
UCBRV059 EQU   UCBACTIV
UCBRV058 EQU   UCBACTIV
UCBRV057 EQU   UCBACTIV
UCBRV050 EQU   UCB3800X+2
UCBCGMNO EQU   UCB3800X+1
UCBRV083 EQU   UCBOPTNS
UCBBRSTR EQU   UCBOPTNS
UCBRV056 EQU   UCBOPTNS
UCBRV055 EQU   UCBOPTNS
UCBRV054 EQU   UCBOPTNS
UCBRV053 EQU   UCBOPTNS
UCBRV052 EQU   UCBOPTNS
UCBRV051 EQU   UCBOPTNS
UCBRV073 EQU   UCB3540X+7
UCBRV072 EQU   UCBDKBYT
UCBRV071 EQU   UCBDKBYT
UCBRV070 EQU   UCBDKBYT
UCBRV069 EQU   UCBDKBYT
UCBRV068 EQU   UCBDKBYT
UCBRV067 EQU   UCBDKBYT
UCBVLVER EQU   UCBDKBYT
UCBDKAMX EQU   UCBDKBYT
UCBVLSER EQU   UCB3540X
UCBRDATA EQU   UCBOCR+4
UCBFRID  EQU   UCBOCR
UCBCLN   EQU   UCBMT+14
UCBERG   EQU   UCBMT+12
UCBMS    EQU   UCBMT+11
UCBNB    EQU   UCBMT+10
UCBPW    EQU   UCBMT+9
UCBPR    EQU   UCBMT+8
UCBSIO   EQU   UCBMT+6
UCBTW    EQU   UCBMT+5
UCBTR    EQU   UCBMT+4
UCBTWT   EQU   UCBMT+3
UCBTRT   EQU   UCBMT+2
UCBCTD   EQU   UCBMT
UCBWTOID EQU   UCBCMEXT+17
UCBRV043 EQU   UCBCMEXT+16
UCBASID  EQU   UCBCMEXT+14
UCBMFCNT EQU   UCBCMEXT+12
UCBPMSK  EQU   UCBCMEXT+10
UCBRV041 EQU   UCBCMEXT+6
UCBRV036 EQU   UCBFLP1
UCBRV035 EQU   UCBFLP1
UCBERLOG EQU   UCBFLP1
UCBRV033 EQU   UCBFLP1
UCBRV032 EQU   UCBFLP1
UCBRV031 EQU   UCBFLP1
UCBSHRUP EQU   UCBFLP1
UCBNSRCH EQU   UCBFLP1
UCBSNSCT EQU   UCBCMEXT+4
UCBHPDV  EQU   @NM00040
UCBHALI  EQU   @NM00040
UCBRSV09 EQU   @NM00040
UCBRSV08 EQU   @NM00040
UCBRSV07 EQU   @NM00040
UCBRSV06 EQU   @NM00040
UCBRSV05 EQU   @NM00040
UCBRSV04 EQU   @NM00040
UCBDTI   EQU   UCBCMEXT+2
UCBSTI   EQU   UCBCMEXT+1
UCBETI   EQU   UCBCMEXT
UCBEXTP  EQU   UCBEXTPT+1
UCBTICBT EQU   UCBFLC
UCBIVRR  EQU   UCBFLC
UCBIVRS  EQU   UCBFLC
UCBITF   EQU   UCBFLC
UCBUDE   EQU   UCBFLC
UCBWAA   EQU   UCBFLC
UCBATTP  EQU   UCBFLC
UCBUNTYP EQU   UCBTBYT4
UCBRSV11 EQU   UCBDVCLS
UCBRSV10 EQU   UCBDVCLS
UCB3CHAR EQU   UCBDVCLS
UCB3UREC EQU   UCBDVCLS
UCB3DISP EQU   UCBDVCLS
UCB3DACC EQU   UCBDVCLS
UCB3COMM EQU   UCBDVCLS
UCBDVPWR EQU   UCB2OPT7
UCBVLPWR EQU   UCB2OPT6
UCB2OPT5 EQU   UCBTBYT2
UCBRVDEV EQU   UCBRWTAU
UCBRPS   EQU   UCBDUDN2
UCBRR    EQU   UCBDUDN1
UCB2OPT1 EQU   UCBTBYT2
UCB1FEA7 EQU   UCBTBYT1
UCBD6250 EQU   UCB1FEA6
UCBD1600 EQU   UCB1FEA5
UCB1FEA4 EQU   UCBTBYT1
UCB1FEA3 EQU   UCBTBYT1
UCB1FEA2 EQU   UCBTBYT1
UCB1FEA1 EQU   UCBTBYT1
UCB1FEA0 EQU   UCBTBYT1
UCBNAME  EQU   UCBOB+13
UCBRV029 EQU   UCBWGT
UCBVHRSN EQU   UCBWGT
UCBVORSN EQU   UCBWGT
UCBMTPXP EQU   UCBWGT
UCBREW   EQU   UCBWGT
UCBPUB   EQU   UCBWGT
UCBOUT   EQU   UCBWGT
UCBIN    EQU   UCBWGT
UCBCPU   EQU   UCBOB+11
UCBLCI   EQU   UCBOB+10
UCBCNT   EQU   UCBOB+9
UCBRV017 EQU   UCBCHM1
UCBRV016 EQU   UCBCHM1
UCBRV015 EQU   UCBCHM1
UCBRV014 EQU   UCBCHM1
UCBSPB   EQU   UCBPTH1
UCBPPB   EQU   UCBPTH1
UCBSPA   EQU   UCBPTH0
UCBPPA   EQU   UCBPTH0
UCBSIGP  EQU   UCBFLB
UCBVALPH EQU   UCBFLB
UCBCRHSN EQU   UCBFLB
UCBCRHRV EQU   UCBFLB
UCBRESVH EQU   UCBFLB
UCBSPST  EQU   UCBFLB
UCBASNS  EQU   UCBFLB
UCBIORST EQU   UCBFLB
UCBACTV  EQU   UCBFL1
UCBSAP   EQU   UCBFL1
UCBNOTRC EQU   UCBCUB
UCBPSNS  EQU   UCBFL1
UCBUSING EQU   UCBPST
UCBNOTRD EQU   UCBNRY
UCBBUSYD EQU   UCBBSY
UCBUA    EQU   UCBCHAN+1
UCBCHA   EQU   UCBCHAN
UCBDADI  EQU   UCBSTAT
UCBSYSR  EQU   UCBSTAT
UCBPRES  EQU   UCBSTAT
UCBALOC  EQU   UCBSTAT
UCBUNLD  EQU   UCBSTAT
UCBRESV  EQU   UCBSTAT
UCBCHGS  EQU   UCBSTAT
UCBONLI  EQU   UCBSTAT
UCBID    EQU   UCBOB+2
UCBALTPH EQU   UCBFL5
UCBALTCU EQU   UCBFL5
UCBNALOC EQU   UCBFL5
UCBENVRD EQU   UCBFL5
UCBVSDR  EQU   UCBFL5
UCBSASK  EQU   UCBFL5
UCBAMV   EQU   UCBAF
UCBDCC   EQU   UCBFL5
UCBMONT  EQU   UCBJBNR
UCBRV011 EQU   UCBJBNR
UCBMMSGP EQU   UCBJBNR
UCBOLDSM EQU   UCBJBNR
UCBRV003 EQU   UCBJBNR
UCBDUC   EQU   UCBJBNR
UCBJES3  EQU   UCBJBNR
UCBVRDEV EQU   UCBJBNR
UCBCMSEG EQU   UCBOB
UCBPFXND EQU   UCB+512
UCBIOQ   EQU   UCB+508
UCBLOCK  EQU   UCB+504
UCBPXST  EQU   UCB+504
@NM00037 EQU   UCB
IOCOEND  EQU   IOCOM+128
IOCPATCH EQU   IOCOM+124
IOCUCBBM EQU   IOCOM+120
IOCQCNT  EQU   IOCOM+116
IOCIOSDQ EQU   IOCOM+112
IOCIOSEQ EQU   IOCOM+108
IOCSVCF  EQU   IOCOM+104
IOCTCCW  EQU   IOCOM+100
IOCRSVTB EQU   IOCOM+96
IOCMFCNT EQU   IOCOM+92
IOCMFHK  EQU   IOCOM+88
IOCCCH   EQU   IOCOM+80
IOCASYNQ EQU   IOCOM+76
IOCLCHTB EQU   IOCOM+72
IOCATTBL EQU   IOCOM+68
IOCOMEX  EQU   IOCOM+64
IOCSYNCH EQU   IOCOM+56
IOCCATLK EQU   IOCOM+48
IOCPRGID EQU   IOCOM+44
IOCIOSCP EQU   IOCOM+40
IOCORMGT EQU   IOCOM+36
IOCVOID  EQU   IOCOM+32
@NM00036 EQU   IOCOM+24
@NM00035 EQU   IOCOM+20
IOCINT   EQU   IOCOM+16
IOCCTBL  EQU   IOCOM+12
IOCHIO   EQU   IOCOM+8
IOCPST   EQU   IOCOM+4
IOCPGCT  EQU   IOCOM+2
IOCVOICT EQU   IOCOM
IOSEND   EQU   IOSB+108
IOSSKR   EQU   IOSEEKA+7
IOSSKH2  EQU   IOSSKHH+1
IOSSKH1  EQU   IOSSKHH
IOSSKCC  EQU   IOSCCHH
IOSSKBB  EQU   IOSEEKA+1
IOSSKM   EQU   IOSEEKA
IOSEEK   EQU   IOSB+92
IOSMDM   EQU   IOSB+91
IOSMDB   EQU   IOSB+90
IOSCKEY7 EQU   IOSCKEY
IOSCKEY6 EQU   IOSCKEY
IOSCKEY5 EQU   IOSCKEY
IOSCKEY4 EQU   IOSCKEY
@NM00031 EQU   IOSCKEY
IOSCUDEV EQU   IOSPATH+1
@NM00030 EQU   IOSCHN
IOSPATH3 EQU   IOSCHN
IOSPATH2 EQU   IOSCHN
IOSEXP   EQU   IOSCHN
IOSGDP   EQU   IOSCHN
IOSAFF   EQU   IOSB+85
IOSRSS1B EQU   IOSB+84
IOSDSID  EQU   IOSB+80
IOSNOTRS EQU   IOSDIEFG
IOSPCI   EQU   IOSB+56
IOSERP   EQU   IOSB+52
IOSPCHN  EQU   IOSB+48
IOSAPMSK EQU   IOSB+40
IOSRES4A EQU   IOSB+36
IOSUSE   EQU   IOSB+32
IOSTSB   EQU   IOSTATUS+1
IOSCSWCA EQU   IOSCSW
IOSOPT2X EQU   IOSOPT2
IOSHTP   EQU   IOSOPT2
IOSRELSE EQU   IOSOPT
IOSAPR   EQU   IOSOPT
IOSTSLL  EQU   IOSOPT
IOSPSLL  EQU   IOSOPT
IOSDEP   EQU   IOSOPT
IOSBYP   EQU   IOSOPT
IOSPKY7  EQU   IOSPKEY
IOSPGDPX EQU   IOSPKEY
IOSIDR   EQU   IOSPKEY
@NM00028 EQU   IOSPKEY
IOSPRLVL EQU   IOSB+5
IOSPROC  EQU   IOSB+3
IOSFLC7  EQU   IOSFLC
IOSFLC6  EQU   IOSFLC
IOSRWAIT EQU   IOSFLC
IOSTP    EQU   IOSFLC
IOSCC3WE EQU   IOSFLC
IOSVERIF EQU   IOSDVALT
IOSDVMNT EQU   IOSFLC
IOSLOG   EQU   IOSFLB
IOSBDCST EQU   IOSFLB
IOSMSG   EQU   IOSFLB
IOSFLB4  EQU   IOSFLB
IOSFLB3  EQU   IOSFLB
IOSFLB2  EQU   IOSFLB
IOSSDR   EQU   IOSFLB
IOSDIESE EQU   IOSFLB
IOSIOSB  EQU   IOSFLA
IOSDOM   EQU   IOSFLA
IOSSMDB  EQU   IOSFLA
IOSSMDA  EQU   IOSFLA
IOSERR   EQU   IOSFLA
IOSCCHN  EQU   IOSACHN
IOSDCHN  EQU   IOSACHN
ASVTEND  EQU   ASVT+528
ASVTAVAL EQU   ASVTENTY
ASVTAVAI EQU   ASVTFRST
ASVTRS00 EQU   ASVT+520
ASVTMAXU EQU   ASVT+516
ASVTASVT EQU   ASVT+512
ASVTBEGN EQU   ASVT+512
@NM00027 EQU   ASVT
CVTLEVL  EQU   CVTRELNO+2
CVTNUMB  EQU   CVTRELNO
CVTMDL   EQU   CVTFIX+250
@NM00026 EQU   CVTFIX+248
@NM00025 EQU   CVTFIX
CVTRV482 EQU   CVTXTNT2+128
CVTRV481 EQU   CVTXTNT2+124
CVTRV480 EQU   CVTXTNT2+120
CVTRV479 EQU   CVTXTNT2+118
CVTRV478 EQU   CVTXTNT2+117
CVTRV477 EQU   CVTXTNT2+116
CVTRV476 EQU   CVTXTNT2+115
CVTRV475 EQU   CVTXTNT2+114
CVTRV474 EQU   CVTRV466
CVTRV473 EQU   CVTRV466
CVTRV472 EQU   CVTRV466
CVTRV471 EQU   CVTRV466
CVTRV470 EQU   CVTRV466
CVTRV469 EQU   CVTRV466
CVTRV468 EQU   CVTRV466
CVTRV467 EQU   CVTRV466
CVTRV465 EQU   CVTRV457
CVTRV464 EQU   CVTRV457
CVTRV463 EQU   CVTRV457
CVTRV462 EQU   CVTRV457
CVTRV461 EQU   CVTRV457
CVTRV460 EQU   CVTRV457
CVTRV459 EQU   CVTRV457
CVTRV458 EQU   CVTRV457
CVTRV456 EQU   CVTXTNT2+108
CVTRV455 EQU   CVTXTNT2+104
CVTRV454 EQU   CVTXTNT2+100
CVTRV453 EQU   CVTXTNT2+96
CVTRV452 EQU   CVTXTNT2+94
CVTRV451 EQU   CVTXTNT2+92
CVTRV450 EQU   CVTXTNT2+90
CVTRV449 EQU   CVTXTNT2+88
CVTRV448 EQU   CVTXTNT2+87
CVTRV447 EQU   CVTXTNT2+86
CVTRV446 EQU   CVTRV438
CVTRV445 EQU   CVTRV438
CVTRV444 EQU   CVTRV438
CVTRV443 EQU   CVTRV438
CVTRV442 EQU   CVTRV438
CVTRV441 EQU   CVTRV438
CVTRV440 EQU   CVTRV438
CVTRV439 EQU   CVTRV438
CVTRV437 EQU   CVTRV429
CVTRV436 EQU   CVTRV429
CVTRV435 EQU   CVTRV429
CVTRV434 EQU   CVTRV429
CVTRV433 EQU   CVTRV429
CVTRV432 EQU   CVTRV429
CVTRV431 EQU   CVTRV429
CVTRV430 EQU   CVTRV429
CVTRV428 EQU   CVTXTNT2+80
CVTRV427 EQU   CVTXTNT2+76
CVTRV426 EQU   CVTXTNT2+72
CVTRV425 EQU   CVTXTNT2+68
CVTATACT EQU   CVTATCVT
CVTRV423 EQU   CVTXTNT2+62
CVTRV422 EQU   CVTXTNT2+60
CVTRV421 EQU   CVTXTNT2+58
CVTRV420 EQU   CVTXTNT2+56
CVTRV419 EQU   CVTXTNT2+55
CVTRV418 EQU   CVTXTNT2+54
CVTRV417 EQU   CVTRV409
CVTRV416 EQU   CVTRV409
CVTRV415 EQU   CVTRV409
CVTRV414 EQU   CVTRV409
CVTRV413 EQU   CVTRV409
CVTRV412 EQU   CVTRV409
CVTRV411 EQU   CVTRV409
CVTRV410 EQU   CVTRV409
CVTRV408 EQU   CVTRV400
CVTRV407 EQU   CVTRV400
CVTRV406 EQU   CVTRV400
CVTRV405 EQU   CVTRV400
CVTRV404 EQU   CVTRV400
CVTRV403 EQU   CVTRV400
CVTRV402 EQU   CVTRV400
CVTRV401 EQU   CVTRV400
CVTICB   EQU   CVTXTNT2+48
CVTSKTA  EQU   CVTXTNT2+44
CVTRSV99 EQU   CVTXTNT2+40
CVTRSV98 EQU   CVTXTNT2+36
CVTRSV97 EQU   CVTXTNT2+34
CVTRSV96 EQU   CVTXTNT2+32
CVTOLTEP EQU   CVTXTNT2+28
CVTQIDA  EQU   CVTQID+1
CVTRSV95 EQU   CVTQID
CVTRSV94 EQU   CVTXTNT2+20
CVTRSV93 EQU   CVTXTNT2+16
CVTRSV92 EQU   CVTXTNT2+12
CVTDEBVR EQU   CVTXTNT2+8
CVTRSV91 EQU   CVTXTNT2+6
CVTRSV9H EQU   CVTFLGBT
CVTRSV9G EQU   CVTFLGBT
CVTRSV9F EQU   CVTFLGBT
CVTRSV9E EQU   CVTFLGBT
CVTRSV9D EQU   CVTFLGBT
CVTRSV9C EQU   CVTFLGBT
CVTVME   EQU   CVTFLGBT
CVTNPE   EQU   CVTFLGBT
CVTNUCLS EQU   CVTXTNT2+4
CVTDSSVA EQU   CVTDSSV+1
CVTRSV89 EQU   CVTDSSV
CVTRSV88 EQU   CVTXTNT1+8
CVTRSV87 EQU   CVTXTNT1+4
CVTFACHN EQU   CVTXTNT1
CVTRV488 EQU   CVTMAP+412
CVTRV487 EQU   CVTMAP+408
CVTRV486 EQU   CVTMAP+404
CVTRV485 EQU   CVTMAP+400
CVTACTAP EQU   CVTMAP+396
CVTAUTH  EQU   CVTMAP+392
CVTATMCA EQU   CVTATMCT+1
CVTATMST EQU   CVTATMCT
CVTRSV61 EQU   CVTMAP+384
CVTVOLT1 EQU   CVTVOLM1+1
CVTVOLI1 EQU   CVTVOLF1
CVTSTOA  EQU   CVTMAP+376
CVTRSV58 EQU   CVTMAP+374
CVTRSV57 EQU   CVTMAP+372
CVTDDCE  EQU   CVTMAP+368
CVTPNWFR EQU   CVTMAP+364
CVTSMF   EQU   CVTMAP+360
CVTSULK  EQU   CVTMAP+358
CVTSLKO  EQU   CVTSYSK
CVTSLKP  EQU   CVTSYSK
CVTSLKQ  EQU   CVTSYSK
CVTSLKR  EQU   CVTSYSK
CVTRSV56 EQU   CVTSYSK
CVTRSV55 EQU   CVTSYSK
CVTRSV54 EQU   CVTSYSK
CVTRSV53 EQU   CVTSYSK
CVTRSV52 EQU   CVTA1F1
CVTRSV51 EQU   CVTA1F1
CVTRSV50 EQU   CVTA1F1
CVTRSV49 EQU   CVTA1F1
CVTRSV48 EQU   CVTA1F1
CVTRSV47 EQU   CVTA1F1
CVTSRSW  EQU   CVTA1F1
CVTPFSW  EQU   CVTA1F1
CVTPCVT  EQU   CVTMAP+352
CVTRSV46 EQU   CVTMAP+344
CVTRSV45 EQU   CVTMAP+340
CVTRSV44 EQU   CVTMAP+338
CVTRSV43 EQU   CVTMAP+336
CVTHJESA EQU   CVTHJES+1
CVTRSV42 EQU   CVTHJES
CVTEXT2A EQU   CVTEXT2+1
CVTRSV41 EQU   CVTEXT2
CVTAPFA  EQU   CVTAPF+1
CVTRSV40 EQU   CVTAPF
CVTRV518 EQU   CVTINTLA
CVTRV517 EQU   CVTERPV
CVTEORM  EQU   CVTMAP+312
CVTMCHPR EQU   CVTMAP+308
CVTTZ    EQU   CVTMAP+304
CVTJEPS  EQU   CVTMAP+300
CVTJESCT EQU   CVTMAP+296
CVTMODE  EQU   CVTMAP+292
CVTPTRV  EQU   CVTMAP+288
CVTREAL  EQU   CVTMAP+284
CVTRSV39 EQU   CVTMAP+280
CVTRSV38 EQU   CVTMAP+276
CVTDMSRA EQU   CVTDMSR+1
CVTRV634 EQU   CVTDMSRF
CVTRV633 EQU   CVTDMSRF
CVTRV632 EQU   CVTDMSRF
CVTRV631 EQU   CVTDMSRF
CVTRV630 EQU   CVTDMSRF
CVTRV629 EQU   CVTDMSRF
CVTUDUMP EQU   CVTDMSRF
CVTSDUMP EQU   CVTDMSRF
CVTQMSGA EQU   CVTQMSG+1
CVTRSV36 EQU   CVTQMSG
CVTAMFF  EQU   CVTMAP+264
CVTPURGA EQU   CVTPURG+1
CVTRSV35 EQU   CVTPURG
CVTCBSP  EQU   CVTMAP+256
CVTATERA EQU   CVTATER+1
CVTSYST  EQU   CVTATER
CVTVOLT2 EQU   CVTTAT
CVTVOLI2 EQU   CVTVOLF2
CVTAQAVB EQU   CVTAQAVT+1
CVTRSV34 EQU   CVTTCMFG
CVTRSV33 EQU   CVTTCMFG
CVTRSV32 EQU   CVTTCMFG
CVTRSV31 EQU   CVTTCMFG
CVTRSV30 EQU   CVTTCMFG
CVTRSV29 EQU   CVTTCMFG
CVTRSV28 EQU   CVTTCMFG
CVTTCRDY EQU   CVTTCMFG
CVTGTFA  EQU   CVTGTF+1
CVTRSV27 EQU   CVTGTFST
CVTRNIO  EQU   CVTGTFST
CVTUSR   EQU   CVTGTFST
CVTRV318 EQU   CVTFORM
CVTRV317 EQU   CVTTMODE
CVTRV316 EQU   CVTSTATE
CVTRV315 EQU   CVTGTFS
CVTGTFAV EQU   CVTGTFS
CVT0SCR1 EQU   CVTMAP+232
CVTRV515 EQU   CVTMAP+228
CVTRMS   EQU   CVTMAP+224
CVTPATCH EQU   CVTMAP+220
CVTTSCE  EQU   CVTMAP+216
CVTLNKSC EQU   CVTMAP+214
CVTQABST EQU   CVTMAP+212
CVTMDLDS EQU   CVTMAP+208
CVTUSER  EQU   CVTMAP+204
CVTABEND EQU   CVTMAP+200
CVTSMCA  EQU   CVTMAP+196
CVTRSV18 EQU   CVTMAP+192
CVTQLPAQ EQU   CVTMAP+188
CVTQCDSR EQU   CVTMAP+184
CVTRSV17 EQU   CVTOPTB
CVTRSV16 EQU   CVTOPTB
CVTFP    EQU   CVTOPTB
CVTAPTHR EQU   CVTOPTB
CVTNLOG  EQU   CVTOPTB
CVTTOD   EQU   CVTOPTB
CVTCTIMS EQU   CVTOPTB
CVTPROT  EQU   CVTOPTB
CVTXPFP  EQU   CVTOPTA
CVTASCII EQU   CVTOPTA
CVTRSV13 EQU   CVTOPTA
CVTRSV12 EQU   CVTOPTA
CVTNIP   EQU   CVTOPTA
CVTDDR   EQU   CVTOPTA
CVTAPR   EQU   CVTOPTA
CVTCCH   EQU   CVTOPTA
CVTSNCTR EQU   CVTMAP+180
CVTQMWR  EQU   CVTMAP+176
CVTQOCR  EQU   CVTMAP+172
CVT1EF00 EQU   CVTMAP+168
CVTMZ00  EQU   CVTMAP+164
CVTHEAD  EQU   CVTMAP+160
CVTRSV11 EQU   CVTMAP+156
CVTMSER  EQU   CVTMAP+148
CVTRV516 EQU   CVTIERLC
CVTILCH  EQU   CVTMAP+140
CVT0DS   EQU   CVTMAP+136
CVTFBOSV EQU   CVTMAP+132
CVTNUCB  EQU   CVTMAP+128
CVTIOQET EQU   CVTMAP+120
CVTDCBA  EQU   CVTMAP+117
CVTMVS2  EQU   CVTDCB
CVT6DAT  EQU   CVTDCB
CVT4MPS  EQU   CVTDCB
CVTRSV09 EQU   CVTDCB
CVT4MS1  EQU   CVTDCB
CVT2SPS  EQU   CVTDCB
CVT1SSS  EQU   CVTDCB
CVTRSV08 EQU   CVTDCB
CVTSTB   EQU   CVTMAP+112
CVTQTD00 EQU   CVTMAP+108
CVTQTE00 EQU   CVTMAP+104
CVTCUCB  EQU   CVTMAP+100
CVTSJQ   EQU   CVTMAP+96
CVTPBLDL EQU   CVTMAP+92
CVTTPC   EQU   CVTMAP+88
CVTSVDCB EQU   CVTMAP+84
CVTBRET  EQU   CVTMAP+82
CVTEXIT  EQU   CVTMAP+80
CVT0FN00 EQU   CVTMAP+76
CVTDARA  EQU   CVTDAR+1
CVTRSV07 EQU   CVTFLGS1
CVTRSV06 EQU   CVTFLGS1
CVTRSV05 EQU   CVTFLGS1
CVTRSV04 EQU   CVTFLGS1
CVTRSV03 EQU   CVTFLGS1
CVTRSV02 EQU   CVTFLGS1
CVTRSV01 EQU   CVTFLGS1
CVTDMPLK EQU   CVTFLGS1
CVTXITP  EQU   CVTMAP+68
CVTZDTAB EQU   CVTMAP+64
CVTMSLT  EQU   CVTMAP+60
CVTDATE  EQU   CVTMAP+56
CVTBTERM EQU   CVTMAP+52
CVTSYSAD EQU   CVTMAP+48
CVTXTLER EQU   CVTMAP+44
CVTILK2  EQU   CVTMAP+40
CVTILK1  EQU   CVTMAP+36
CVTPRLTV EQU   CVTMAP+32
CVTPCNVT EQU   CVTMAP+28
CVT0VL00 EQU   CVTMAP+24
CVTXAPG  EQU   CVTMAP+20
CVTBUF   EQU   CVTMAP+16
CVTJOB   EQU   CVTMAP+12
CVTLINK  EQU   CVTMAP+8
CVT0EF00 EQU   CVTMAP+4
CVT      EQU   CVTMAP
ASCBEND  EQU   ASCB+208
ASCBSRBT EQU   ASCB+200
ASCBSWTL EQU   ASCB+196
ASCBRS14 EQU   ASCB+195
ASCBSMCT EQU   ASCB+194
ASCBRS12 EQU   ASCB+192
ASCBPCTT EQU   ASCB+188
ASCBVGTT EQU   ASCB+184
ASCBLGCB EQU   ASCB+180
ASCBJBNS EQU   ASCB+176
ASCBJBNI EQU   ASCB+172
ASCBMCC  EQU   ASCB+168
ASCBRTWA EQU   ASCB+164
ASCBIQEA EQU   ASCB+160
ASCBXMPQ EQU   ASCB+156
ASCBRS01 EQU   ASCB+154
ASCBFMCT EQU   ASCB+152
ASCBOUXB EQU   ASCB+148
ASCBOUCB EQU   ASCB+144
ASCBMECB EQU   ASCB+140
ASCBQECB EQU   ASCB+136
ASCBCMSB EQU   ASCB+132
ASCBCMSF EQU   ASCB+128
ASCBTCBS EQU   ASCB+124
ASCBNVSC EQU   ASCB+122
ASCBVSC  EQU   ASCB+120
ASCBSRBS EQU   ASCB+118
ASCBSSRB EQU   ASCB+116
ASCBRV06 EQU   ASCBFLG2
ASCBRV05 EQU   ASCBFLG2
ASCBRV04 EQU   ASCBFLG2
ASCBSNQS EQU   ASCBFLG2
ASCBS2S  EQU   ASCBFLG2
ASCBCEXT EQU   ASCBFLG2
ASCBPXMT EQU   ASCBFLG2
ASCBXMPT EQU   ASCBFLG2
ASCBRF07 EQU   ASCBDSP1
ASCBRF06 EQU   ASCBDSP1
ASCBRF05 EQU   ASCBDSP1
ASCBRF04 EQU   ASCBDSP1
ASCBRF03 EQU   ASCBDSP1
ASCBRF02 EQU   ASCBDSP1
ASCBFAIL EQU   ASCBDSP1
ASCBNOQ  EQU   ASCBDSP1
ASCBSWCT EQU   ASCB+112
ASCBTMCH EQU   ASCB+104
ASCBNSWP EQU   ASCBFLG1
ASCBTYP1 EQU   ASCBFLG1
ASCBSTND EQU   ASCBFLG1
ASCBABNT EQU   ASCBFLG1
ASCBTERM EQU   ASCBFLG1
ASCBS3S  EQU   ASCBFLG1
ASCBCMSH EQU   ASCBFLG1
ASCBTOFF EQU   ASCBFLG1
ASCBRF01 EQU   ASCBRCTF
ASCBTMLW EQU   ASCBRCTF
ASCBOUT  EQU   ASCBRCTF
ASCBWAIT EQU   ASCBRCTF
ASCBRV08 EQU   ASCBRCTF
ASCBFQU  EQU   ASCBRCTF
ASCBFRS  EQU   ASCBRCTF
ASCBTMNO EQU   ASCBRCTF
ASCBAFFN EQU   ASCBFW1
ASCBDUMP EQU   ASCB+96
ASCBQSVC EQU   ASCB+92
ASCBUBET EQU   ASCB+88
ASCBECB  EQU   ASCB+84
ASCBJSTL EQU   ASCB+80
ASCBEWST EQU   ASCB+72
ASCBEJST EQU   ASCB+64
ASCBTSB  EQU   ASCB+60
ASCBCSCB EQU   ASCB+56
ASCBRSM  EQU   ASCB+52
ASCBLDA  EQU   ASCB+48
ASCBSTOR EQU   ASCB+44
ASCBDP   EQU   ASCB+43
ASCBRV07 EQU   ASCB+42
ASCBIOSM EQU   ASCB+40
ASCBSEQN EQU   ASCB+38
ASCBASID EQU   ASCB+36
ASCBCPUS EQU   ASCB+32
ASCBSPL  EQU   ASCB+28
ASCBLSLQ EQU   ASCB+24
ASCBFSLQ EQU   ASCB+20
ASCBIOSP EQU   ASCB+16
ASCBLOCK EQU   ASCB+12
ASCBBWDP EQU   ASCB+8
ASCBFWDP EQU   ASCB+4
ASCBASCB EQU   ASCB
ASCBEGIN EQU   ASCB
@NM00024 EQU   PSA+3668
PSASTAK  EQU   PSA+3072
@NM00023 EQU   PSA+1048
PSAUSEND EQU   PSA+1048
PSARV062 EQU   PSA+1044
PSACDAL  EQU   PSA+1040
PSAWTCOD EQU   PSA+1036
PSAATCVT EQU   PSA+1032
PSAPCPSW EQU   PSA+1024
PSAPIR2  EQU   PSA+1020
PSARV059 EQU   PSA+1018
PSASVC13 EQU   PSA+1016
PSALSFCC EQU   PSA+1012
PSASFACC EQU   PSA+1008
PSASTOP  EQU   PSA+992
PSASTART EQU   PSA+976
PSARSPSW EQU   PSA+968
PSASRPSW EQU   PSA+960
PSARV045 EQU   PSA+892
PSARV044 EQU   PSA+888
PSARV043 EQU   PSA+884
PSARV042 EQU   PSA+880
PSARV041 EQU   PSA+876
PSARV040 EQU   PSA+872
PSARV025 EQU   PSA+868
PSADSSED EQU   PSA+868
PSADSSPR EQU   PSA+864
PSADSSFW EQU   PSA+860
PSADSS14 EQU   PSA+856
PSADSSPP EQU   PSA+848
PSADSSRP EQU   PSA+840
PSADSS05 EQU   PSADSSF4
PSADSS10 EQU   PSADSSF4
PSADSSVE EQU   PSADSSF4
PSADSSDE EQU   PSADSSF4
PSADSSC0 EQU   PSADSSF4
PSADSSIE EQU   PSADSSF4
PSADSS12 EQU   PSADSSF4
PSADSSRC EQU   PSADSSF4
PSARV057 EQU   PSADSSF3
PSARV056 EQU   PSADSSF3
PSARV055 EQU   PSADSSF3
PSADSSMC EQU   PSADSSF3
PSADSSRW EQU   PSADSSF3
PSADSSNM EQU   PSADSSF3
PSADSSES EQU   PSADSSF3
PSADSSGP EQU   PSADSSF3
PSADSSF2 EQU   PSADSSFL+1
PSADSSPI EQU   PSADSSF1
PSADSSOI EQU   PSADSSF1
PSADSSSP EQU   PSADSSF1
PSADSSTP EQU   PSADSSF1
PSADSSDW EQU   PSADSSF1
PSADSSDD EQU   PSADSSF1
PSADSSDM EQU   PSADSSF1
PSADSSMV EQU   PSADSSF1
PSADSSTS EQU   PSA+816
PSADSSWK EQU   PSA+812
PSADSSR3 EQU   PSA+808
PSADSSR2 EQU   PSA+804
PSADSSRS EQU   PSA+800
PSASTOR  EQU   PSA+796
PSACPUSA EQU   PSA+794
PSAVSTAP EQU   PSA+792
PSAWKVAP EQU   PSA+788
PSAWKRAP EQU   PSA+784
PSAMCHIC EQU   PSA+783
PSARV061 EQU   PSA+782
PSASYMSK EQU   PSA+781
PSAMCHFL EQU   PSA+780
PSACR0   EQU   PSA+776
PSAPSWSV EQU   PSA+768
PSACLHS  EQU   PSAHLHI
PSALKR15 EQU   PSALKSA+60
PSALKR14 EQU   PSALKSA+56
PSALKR13 EQU   PSALKSA+52
PSALKR12 EQU   PSALKSA+48
PSALKR11 EQU   PSALKSA+44
PSALKR10 EQU   PSALKSA+40
PSALKR9  EQU   PSALKSA+36
PSALKR8  EQU   PSALKSA+32
PSALKR7  EQU   PSALKSA+28
PSALKR6  EQU   PSALKSA+24
PSALKR5  EQU   PSALKSA+20
PSALKR4  EQU   PSALKSA+16
PSALKR3  EQU   PSALKSA+12
PSALKR2  EQU   PSALKSA+8
PSALKR1  EQU   PSALKSA+4
PSALKR0  EQU   PSALKSA
PSARV023 EQU   PSACLHT+52
PSALOCAL EQU   PSACLHT+48
PSACMSL  EQU   PSACLHT+44
PSAOPTL  EQU   PSACLHT+40
PSATPACL EQU   PSACLHT+36
PSATPDNL EQU   PSACLHT+32
PSATPNCL EQU   PSACLHT+28
PSAIOSLL EQU   PSACLHT+24
PSAIOSUL EQU   PSACLHT+20
PSAIOSCL EQU   PSACLHT+16
PSAIOSSL EQU   PSACLHT+12
PSASALCL EQU   PSACLHT+8
PSAASML  EQU   PSACLHT+4
PSADISPL EQU   PSACLHT
PSASRSA  EQU   PSA+636
PSARV050 EQU   PSA+634
PSADSSGO EQU   PSA+633
PSARECUR EQU   PSA+632
PSAHLHIS EQU   PSA+628
PSAIPCSA EQU   PSA+624
@NM00022 EQU   PSA+621
PSAIPCDM EQU   PSA+620
PSAIPCD  EQU   PSA+616
@NM00021 EQU   PSA+613
PSAIPCRM EQU   PSA+612
PSAIPCR  EQU   PSA+608
PSAMCHEX EQU   PSA+600
PSAMPSW  EQU   PSA+592
PSAEXPS2 EQU   PSA+584
PSAEXPS1 EQU   PSA+576
PSAPIREG EQU   PSA+572
PSARSREG EQU   PSA+568
PSAGPREG EQU   PSA+556
PSARV022 EQU   PSASUP4
PSARV021 EQU   PSASUP4
PSARV020 EQU   PSASUP4
PSARV019 EQU   PSASUP4
PSARV018 EQU   PSASUP4
PSARV017 EQU   PSASUP4
PSARV016 EQU   PSASUP4
PSARV015 EQU   PSASUP4
PSARV014 EQU   PSASUP3
PSARV013 EQU   PSASUP3
PSARV012 EQU   PSASUP3
PSAESTA  EQU   PSASUP3
PSASPR   EQU   PSASUP3
PSAPSREG EQU   PSASUP3
PSAPI2   EQU   PSASUP3
PSAIOSUP EQU   PSASUP3
PSALCR   EQU   PSASUP2
PSARTM   EQU   PSASUP2
PSAACR   EQU   PSASUP2
PSAIPCE2 EQU   PSASUP2
PSAIPCES EQU   PSASUP2
PSAIPCEC EQU   PSASUP2
PSAGTF   EQU   PSASUP2
PSAIPCRI EQU   PSASUP2
PSATYPE6 EQU   PSASUP1
PSATCTL  EQU   PSASUP1
PSADISP  EQU   PSASUP1
PSALOCK  EQU   PSASUP1
PSAPI    EQU   PSASUP1
PSAEXT   EQU   PSASUP1
PSASVC   EQU   PSASUP1
PSAIO    EQU   PSASUP1
PSAAOLD  EQU   PSA+548
PSAANEW  EQU   PSA+544
PSATOLD  EQU   PSA+540
PSATNEW  EQU   PSA+536
PSALCCAR EQU   PSA+532
PSALCCAV EQU   PSA+528
PSAPCCAR EQU   PSA+524
PSAPCCAV EQU   PSA+520
PSACPULA EQU   PSA+518
PSACPUPA EQU   PSA+516
PSAPSA   EQU   PSA+512
FLCHDEND EQU   PSA+512
FLCCRSAV EQU   FLCMCLA+280
FLCGRSAV EQU   FLCMCLA+216
FLCFPSAV EQU   FLCMCLA+184
FLCFLA   EQU   FLCMCLA+88
FLCRGNCD EQU   FLCMCLA+84
FLCFSAA  EQU   FLCFSA+1
@NM00020 EQU   FLCFSA
@NM00019 EQU   FLCMCLA+72
FLCMCIC  EQU   FLCMCLA+64
@NM00018 EQU   FLCMCLA+20
FLCIOAA  EQU   FLCIOA+1
@NM00017 EQU   FLCIOA
@NM00016 EQU   FLCMCLA+15
@NM00015 EQU   FLCMCLA+14
@NM00014 EQU   FLCMCLA+12
FLCLCL   EQU   FLCMCLA+8
FLCIOELA EQU   FLCIOEL+1
@NM00013 EQU   FLCIOEL
FLCCHNID EQU   FLCMCLA
@NM00012 EQU   PSA+160
FLCMTRCD EQU   PSA+157
@NM00011 EQU   PSA+156
FLCPERA  EQU   FLCPER+1
@NM00010 EQU   FLCPER
@NM00009 EQU   PSA+151
FLCPERCD EQU   PSA+150
FLCMCNUM EQU   PSA+149
@NM00008 EQU   PSA+148
FLCTEAA  EQU   FLCTEA+1
@NM00007 EQU   FLCTEA
PSAPIPC  EQU   PSAPICOD
PSAPIMC  EQU   PSAPICOD
PSAPIPER EQU   PSAPICOD
PSARV049 EQU   FLCPICOD
FLCPILCB EQU   FLCPIILC
@NM00006 EQU   FLCPIILC
@NM00005 EQU   PSAEPPSW
FLCSVCN  EQU   PSAESPSW+2
FLCSILCB EQU   FLCSVILC
@NM00004 EQU   FLCSVILC
@NM00003 EQU   PSAESPSW
FLCEICOD EQU   PSAEEPSW+2
PSASPAD  EQU   PSAEEPSW
@NM00002 EQU   PSA+128
FLCINPSW EQU   PSA+120
FLCMNPSW EQU   PSA+112
FLCPNPSW EQU   PSA+104
FLCSNPSW EQU   PSA+96
FLCENPSW EQU   PSA+88
FLCTRACE EQU   PSA+84
FLCTIMER EQU   PSA+80
FLCCVT2  EQU   PSA+76
FLCCAW   EQU   PSA+72
FLCCSW   EQU   PSA+64
FLCIOPSW EQU   PSA+56
FLCMOPSW EQU   PSA+48
FLCPOPSW EQU   PSA+40
FLCSOPSW EQU   PSA+32
FLCEOPSW EQU   PSA+24
@NM00001 EQU   FLCICCW2+4
FLCICCW1 EQU   FLCROPSW
FLCIPPSW EQU   FLCRNPSW
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS
@RC00243 EQU   @RC00241
@RC00331 EQU   @EL00005
@RC00332 EQU   @RC00331
@RC00336 EQU   @RC00332
@RC00334 EQU   @RC00332
@RC00338 EQU   @RC00336
@ENDDATA EQU   *
         END   IGFDM1,(C'PLS1254',0701,77018)
