         TITLE 'IGFDS0, DDR SRB ROUTINE                                *
                        '
IGFDS0   CSECT ,                                                   0001
@MAINENT DS    0H                                                  0001
         USING *,@15                                               0001
         B     @PROLOG                                             0001
         DC    AL2(@EP00001-@MAINENT)
         DC    AL1(16)                                             0001
         DC    C'IGFDS0    76.161'                                 0001
DS0FRR   DS    0H                                                  0001
         USING *,@15                                               0001
         B     @PROLOG                                             0001
         DC    AL2(@EP00284-DS0FRR)
         ENTRY DS0FRR
         DROP  @15
@PROLOG  BALR  @08,0                                               0001
@PSTART  DS    0H                                                  0001
         USING @PSTART,@08                                         0001
         AH    @15,4(,@15)                                         0001
         BR    @15                                                 0001
@EP00001 DS    0H                                                  0002
RBPRFXLN EQU 64
RBPRFLNA EQU 32
PRBLEN   EQU 136
SIRBLEN  EQU 200
TIRBLEN  EQU 136
IRBLEN   EQU 128
SVRBLEN  EQU 200
*   EXITADDR=RTNADDR;               /* SAVE RETURN ADDRESS (IN NON-
*                                      VOLATILE REGISTER)            */
         LR    EXITADDR,RTNADDR                                    0200
*   SRBPTR=R0;                      /* SAVE ADDRESS OF SRB           */
         LR    SRBPTR,R0                                           0201
*   DDRPTR=R1;                      /* SAVE ADDRESS OF DDRCOM        */
         LR    DDRPTR,R1                                           0202
*   RFY                                                            0203
*    (R0,                                                          0203
*     R1,                                                          0203
*     RTNADDR) UNRSTD;                                             0203
*                                                                  0203
*   /*****************************************************************/
*   /*                                                               */
*   /* OBTAIN THE LOCK(S) REQUIRED TO SERIALIZE THE DDR WAIT QUEUE   */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0204
*   RFY                                                            0204
*    (R11,                                                         0204
*     R12,                                                         0204
*     R13,                                                         0204
*     R14) RSTD;                                                   0204
*   GENERATE REFS(PSALITA,FLC) SETS(R11,R12,R13,R14);              0205
GETLOCL SETLOCK OBTAIN,TYPE=LOCAL,MODE=UNCOND,                        **
               RELATED=(LOCAL,IGFDS0(RELLOCL))
*   IF SRBASCB->ASCBASID=MASTER THEN/* IF MASTER MEMORY, ALSO GET CMS
*                                      LOCK                          */
         L     @15,SRBASCB(,SRBPTR)                                0206
         CLC   ASCBASID(2,@15),@CH00034                            0206
         BNE   @RF00206                                            0206
*     GENERATE REFS(PSALITA,FLC) SETS(R11,R12,R13,R14);            0207
*                                                                  0207
GETCMS SETLOCK OBTAIN,TYPE=CMS,MODE=UNCOND,                           **
               RELATED=(CMS,IGFDS0(RELCMS))
*     /***************************************************************/
*     /*                                                             */
*     /* FREE THE SRB AREA -- NOTE - SALLOC LOCK IS REQUIRED FOR     */
*     /* GLOBAL BRANCH ENTRY TO FREEMAIN                             */
*     /*                                                             */
*     /***************************************************************/
*                                                                  0208
*     GENERATE REFS(PSALITA,FLC) SETS(R11,R12,R13,R14);            0208
@RF00206 DS    0H                                                  0208
GETSALC1 SETLOCK OBTAIN,TYPE=SALLOC,MODE=UNCOND,                      **
               RELATED=(SALLOC,IGFDS0(RELSALC1))
*     DO;                           /* FREEMAIN(RU)                0209
*                                      LV(LENGTH(SRBSECT))A(SRBSECT)
*                                      SP(SRBSPN) BRANCH(GLOBAL)     */
*       RESPECIFY                                                  0210
*        (GPR01F,                                                  0210
*         GPR03F,                                                  0210
*         GPR00F,                                                  0210
*         GPR04P) RESTRICTED;                                      0210
*       GPR01F=0;                   /* REG 1 MUST BE ZERO            */
         SLR   GPR01F,GPR01F                                       0211
*       GPR03F=3;                   /* SET TYPE                      */
         LA    GPR03F,3                                            0212
*       GPR00F=LENGTH(SRBSECT);     /* LENGTH REQUESTED              */
         LA    GPR00F,44                                           0213
*       GPR01F=ADDR(SRBSECT);       /* SET REGISTER ONE              */
         LR    GPR01F,SRBPTR                                       0214
*       GPR03F=GPR03F+((SRBSPN)*256);/* SUBPOOL VALUE                */
         AL    GPR03F,@CF02230                                     0215
*       GPR04P=WSAGGMFM;            /* POINT TO SAVE AREA            */
         L     @15,CVTPTR                                          0216
         L     @07,CVTSPSA(,@15)                                   0216
         L     GPR04P,WSAGGMFM(,@07)                               0216
*       CALL CVTGLMN;               /* BRANCH ENTRY POINT            */
         L     @15,CVTGLMN(,@15)                                   0217
         BALR  @14,@15                                             0217
*       RESPECIFY                                                  0218
*        (GPR01F,                                                  0218
*         GPR03F,                                                  0218
*         GPR00F,                                                  0218
*         GPR04P) UNRESTRICTED;                                    0218
*     END;                          /* FREEMAIN(RU)                0219
*                                      LV(LENGTH(SRBSECT))A(SRBSECT)
*                                      SP(SRBSPN) BRANCH(GLOBAL)     */
*   GENERATE REFS(PSALITA,FLC) SETS(R11,R12,R13,R14);              0220
RELSALC1 SETLOCK RELEASE,TYPE=SALLOC,RELATED=(SALLOC,IGFDS0(GETSALC1))
*   RFY                                                            0221
*    (R11,                                                         0221
*     R12,                                                         0221
*     R13,                                                         0221
*     R14,                                                         0221
*     SRBPTR) UNRSTD;                                              0221
*                                                                  0221
*   /*****************************************************************/
*   /*                                                               */
*   /* INITIALIZE THE RECOVERY ENVIRONMENT (FRR)                     */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0222
*   REGADDR=ADDR(DS0FRR);           /* POINT TO FRR EXIT ROUTINE     */
         L     REGADDR,@CA02198                                    0222
*   GENERATE REFS(PSACSTK,PSALSFCC,PSA,FRRSCURR,FRRS,FRRSEMP,FRRSELEN,
*       FRRSLAST,FRRSFRRA,FRRSENTR,FRRSPARM,REGADDR) SETS(PARMPTR, 0223
*       RWORK1,RWORK2);                                            0223
*                                   /* SET UP FRR EXIT              */
SETFRR SETFRR A,FRRAD=(REGADDR),PARMAD=(PARMPTR),                     **
               WRKREGS=(RWORK1,RWORK2),                               **
               RELATED=(FRR,IGFDS0(CLRFRR))
*   DS0PDDR=DDRPTR;                 /* SAVE DDRCOM ADDRESS           */
         ST    DDRPTR,DS0PDDR(,PARMPTR)                            0224
*   DS0PRUB=RUBMASK;                /* SET UP RUB HEADER             */
         MVC   DS0PRUB(2,PARMPTR),@CB00037                         0225
*   DS0PR14=EXITADDR;               /* SAVE RETURN ADDRESS           */
         ST    EXITADDR,DS0PR14(,PARMPTR)                          0226
*   DS0PBASE=CODEBASE;              /* SAVE MODULE BASE ADDRESS      */
         ST    CODEBASE,DS0PBASE(,PARMPTR)                         0227
*   DS0PASCB=CURRASCB;              /* PICK UP CURRENT ASCB ADDRESS  */
         L     @12,CVTPTR                                          0228
         L     @12,CVTTCBP(,@12)                                   0228
         L     @12,CURRASCB(,@12)                                  0228
         ST    @12,DS0PASCB(,PARMPTR)                              0228
*   RFY                                                            0229
*    (DDRPTR,                                                      0229
*     EXITADDR,                                                    0229
*     REGADDR) UNRSTD;                                             0229
*   IF ASXBDDR=0 THEN               /* IS DDR ACTIVE                 */
         L     @12,ASCBPTR(,PARMPTR)                               0230
         L     @12,ASXBPTR(,@12)                                   0230
         L     @12,ASXBDDR(,@12)                                   0230
         LTR   @12,@12                                             0230
         BNZ   @RF00230                                            0230
*     CALL DS0CIRB;                 /* NO, ACTIVATE DDR TASK         */
         BAL   @14,DS0CIRB                                         0231
*   CALL DS0ADDEL;                  /* ADD DDRCOM TO WAIT QUEUE      */
@RF00230 BAL   @14,DS0ADDEL                                        0232
*   RFY                                                            0233
*     EXITADDR RSTD;                                               0233
*   EXITADDR=DS0PR14;               /* PICK UP RETURN ADDRESS        */
         L     EXITADDR,DS0PR14(,PARMPTR)                          0234
*IGFDS0R:                           /* FRR RETRY ENTRY POINT -- NOTE
*                                      - ONLY REGISTERS 5 (EXITADDR)
*                                      AND 8 (CODEBASE) MAY BE VALID
*                                      IF THE FRR EXIT WAS TAKEN     */
*                                                                  0235
*   /*****************************************************************/
*   /*                                                               */
*   /* CANCEL THE RECOVERY ENVIRONMENT                               */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0235
*   GENERATE REFS(PSACSTK,PSALSFCC,PSA,FRRSCURR,FRRS,FRRSEMP,FRRSELEN,
*       FRRSLAST,FRRSFRRA,FRRSENTR,FRRSPARM) SETS(RWORK1,RWORK2);  0235
*                                                                  0235
IGFDS0R  DS    0H                                                  0235
CLRFRR SETFRR D,WRKREGS=(RWORK1,RWORK2),RELATED=(FRR,IGFDS0(SETFRR))
*   /*****************************************************************/
*   /*                                                               */
*   /* RELEASE THE LOCK(S) HELD TO SERIALIZE THE DDR WAIT QUEUE      */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0236
*   RFY                                                            0236
*    (R11,                                                         0236
*     R12,                                                         0236
*     R13,                                                         0236
*     R14) RSTD;                                                   0236
*   IF CURRASCB->ASCBASID=MASTER THEN/* RELEASE CMS LOCK IF HELD     */
         L     @15,CVTPTR                                          0237
         L     @15,CVTTCBP(,@15)                                   0237
         L     @15,CURRASCB(,@15)                                  0237
         CLC   ASCBASID(2,@15),@CH00034                            0237
         BNE   @RF00237                                            0237
*     GENERATE REFS(PSALITA,FLC) SETS(R11,R12,R13,R14);            0238
RELCMS SETLOCK RELEASE,TYPE=CMS,RELATED=(CMS,IGFDS0(GETCMS))
*     GENERATE REFS(PSALITA,FLC) SETS(R11,R12,R13,R14);            0239
@RF00237 DS    0H                                                  0239
RELLOCAL SETLOCK RELEASE,TYPE=LOCAL,RELATED=(LOCAL,IGFDS0(GETLOCAL))
*     RFY                                                          0240
*      (R11,                                                       0240
*       R12,                                                       0240
*       R13,                                                       0240
*       R14) UNRSTD;                                               0240
*   RFY                                                            0241
*     RTNADDR RSTD;                                                0241
*   RTNADDR=EXITADDR;               /* RESTORE RETURN ADDRESS        */
         LR    RTNADDR,EXITADDR                                    0242
*   RETURN;                         /* RETURN TO CALLER (SRB       0243
*                                      TERMINATION)                  */
@EL00001 DS    0H                                                  0243
@EF00001 DS    0H                                                  0243
@ER00001 BR    @14                                                 0243
*   RFY                                                            0244
*    (RTNADDR,                                                     0244
*     EXITADDR) UNRSTD;                                            0244
*   GENERATE NOREFS NOSETS(EJECT);                                 0245
*                                                                  0245
         EJECT
*   /*****************************************************************/
*   /*                                                               */
*   /* SUBROUTINE DS0CIRB - CREATES THE DDR TASK                     */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0246
*DS0CIRB:                           /* SUBROUTINE ENTRY POINT        */
*   PROCEDURE OPTIONS(NOSAVE,NOSAVEAREA);                          0246
         B     @PB00002                                            0246
DS0CIRB  DS    0H                                                  0247
*   RFY                                                            0247
*    (RTCB,                                                        0247
*     RBSECPTR,                                                    0247
*     IQEPTR,                                                      0247
*     RTNADDR,                                                     0247
*     R1,                                                          0247
*     EXITADDR) RSTD;                                              0247
*   EXITADDR=RTNADDR;               /* SAVE RETURN ADDRESS           */
         LR    EXITADDR,RTNADDR                                    0248
*   RTCB=ASXBFTCB;                  /* POINT TO THE TCB FOR THE    0249
*                                      REGION CONTROL TASK           */
*                                                                  0249
         L     @15,ASCBPTR(,PARMPTR)                               0249
         L     @15,ASXBPTR(,@15)                                   0249
         L     RTCB,ASXBFTCB(,@15)                                 0249
*   /*****************************************************************/
*   /*                                                               */
*   /* CREATE THE IRB FOR THE DDR TASK TO RUN UNDER                  */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0250
*   DO;                             /* CIRB EP(IGFDS1) TYPE(IRB)   0250
*                                      KEY(SUPR) MODE(SUPR)        0250
*                                      SVAREA(YES)                 0250
*                                      WKAREA(LENGTH(IQESECT)/8)   0250
*                                      STAB(DYN) RETIQE(NO) BRANCH   */
*     RFY                                                          0251
*      (GPR00P,                                                    0251
*       GPR01F) RSTD;               /* RESTRICT REGISTERS            */
*     GPR00P=ADDR(IGFDS1);          /* EP ADDRESS                    */
         L     GPR00P,@CV00079                                     0252
         LR    @15,GPR00P                                          0252
         LR    GPR00P,@15                                          0252
*     GPR01F=LENGTH(IQESECT)/8;     /* WORK AREA SIZE                */
         LA    GPR01F,3                                            0253
*     GPR01F=GPR01F×'410A0000'X;    /* SET FLAG BYTES                */
         O     GPR01F,@CF02207                                     0254
*     CALL CVTS1EE;                 /* BRANCH ENTRY POINT            */
         L     @12,CVTPTR                                          0255
         L     @15,CVTS1EE(,@12)                                   0255
         BALR  @14,@15                                             0255
*     RFY                                                          0256
*      (GPR00P,                                                    0256
*       GPR01F) UNRSTD;             /* RELEASE REGISTERS             */
*   END;                            /* CIRB EP(IGFDS1) TYPE(IRB)   0257
*                                      KEY(SUPR) MODE(SUPR)        0257
*                                      SVAREA(YES)                 0257
*                                      WKAREA(LENGTH(IQESECT)/8)   0257
*                                      STAB(DYN) RETIQE(NO) BRANCH   */
*                                                                  0257
*   /*****************************************************************/
*   /*                                                               */
*   /* BUILD THE IQE WITHIN THE IRB                                  */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0258
*   IQEPTR=ADDR(RBIQEWRK);          /* POINT TO THE IQE WORK AREA    */
         LA    IQEPTR,RBIQEWRK(,RBSECPTR)                          0258
*   IQEFLAGS=IQEFLAGS&&IQEFLAGS;    /* CLEAR IQEFLAGS FIELD  @OZ08764*/
         XC    IQEFLAGS(1,IQEPTR),IQEFLAGS(IQEPTR)                 0259
*   IQEIRBA=RBSECPTR;               /* SET UP THE RB POINTER         */
         STCM  RBSECPTR,7,IQEIRBA(IQEPTR)                          0260
*   IQETCBA=ASXBFTCB;               /* SET UP THE TCB POINTER        */
         L     @15,ASCBPTR(,PARMPTR)                               0261
         L     @15,ASXBPTR(,@15)                                   0261
         MVC   IQETCBA(3,IQEPTR),ASXBFTCB+1(@15)                   0261
*   IQEPARAM=DS0PASCB;              /* SET UP THE TASK PARAMETER     */
*                                                                  0262
         L     @15,DS0PASCB(,PARMPTR)                              0262
         ST    @15,IQEPARAM(,IQEPTR)                               0262
*   /*****************************************************************/
*   /*                                                               */
*   /* SCHEDULE THE IRB BY CALLING THE STAGE II EXIT EFFECTOR        */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0263
*   R1=-IQEPTR;                     /* SET UP PARAMETER REGISTER     */
         LCR   R1,IQEPTR                                           0263
*   CALL IEA0EF00;                  /* CALL STAGE II EXIT EFFECTOR   */
         L     @12,CVTPTR                                          0264
         L     @15,CVT0EF00(,@12)                                  0264
         BALR  @14,@15                                             0264
*   RTNADDR=EXITADDR;               /* RESTORE RETURN ADDRESS        */
         LR    RTNADDR,EXITADDR                                    0265
*   RETURN;                         /* RETURN TO CALLER              */
@EL00002 DS    0H                                                  0266
@EF00002 DS    0H                                                  0266
@ER00002 BR    @14                                                 0266
*   RFY                                                            0267
*    (RTCB,                                                        0267
*     RBSECPTR,                                                    0267
*     IQEPTR,                                                      0267
*     RTNADDR,                                                     0267
*     R1,                                                          0267
*     EXITADDR) UNRSTD;                                            0267
*   END DS0CIRB;                                                   0268
@PB00002 DS    0H                                                  0269
*   GENERATE NOREFS NOSETS(EJECT);                                 0269
*                                                                  0269
         EJECT
*   /*****************************************************************/
*   /*                                                               */
*   /* SUBROUTINE DS0ADDEL - ADD A DDRCOM TO THE DDR WAIT QUEUE      */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0270
*DS0ADDEL:                          /* SUBROUTINE ENTRY POINT        */
*   PROCEDURE OPTIONS(NOSAVE,NOSAVEAREA);                          0270
         B     @PB00003                                            0270
DS0ADDEL DS    0H                                                  0271
*   RFY                                                            0271
*    (RTNADDR,                                                     0271
*     DDRPTR) RSTD;                                                0271
*   DDRPTR=0;                       /* SET UP DUMMY DDRCOM POINTER   */
         SLR   DDRPTR,DDRPTR                                       0272
*   DDRPTR=ADDR(ASXBDDR)-(ADDR(DDRNXT)-ADDR(DDRSHORT));/* POINT TO 0273
*                                      VIRTUAL DDRCOM OVERLAYING THE
*                                      ASXB SO THAT ASXBDDR        0273
*                                      CORRESPONDS TO DDRNXT         */
*                                                                  0273
         L     @15,ASCBPTR(,PARMPTR)                               0273
         L     @15,ASXBPTR(,@15)                                   0273
         LA    @15,ASXBDDR(,@15)                                   0273
         SL    @15,@CF00109                                        0273
         LR    DDRPTR,@15                                          0273
*   /*****************************************************************/
*   /*                                                               */
*   /* FIND THE PROPER PLACE ON THE WAIT QUEUE FOR THIS DDRCOM       */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0274
*   DO WHILE(DDRNXT^=0&(DDRNXT->DDRSYS='1'B×DS0PDDR->DDROPER='1'B));
         B     @DE00274                                            0274
@DL00274 DS    0H                                                  0275
*     DDRPTR=DDRNXT;                /* POINT TO NEXT DDRCOM ON QUEUE */
         L     DDRPTR,DDRNXT(,DDRPTR)                              0275
*   END;                            /* LOOP UNTIL PROPER PLACE IS  0276
*                                      FOUND (FOR SYSTEM SWAPS, END
*                                      OF SYSTEM DDRCOMS, FOR      0276
*                                      OPERATOR SWAPS, END OF QUEUE) */
*                                                                  0276
@DE00274 L     @15,DDRNXT(,DDRPTR)                                 0276
         LTR   @15,@15                                             0276
         BZ    @DC00274                                            0276
         TM    DDRSYS(@15),B'01000000'                             0276
         BO    @DL00274                                            0276
         L     @15,DS0PDDR(,PARMPTR)                               0276
         TM    DDROPER(@15),B'10000000'                            0276
         BO    @DL00274                                            0276
@DC00274 DS    0H                                                  0277
*   /*****************************************************************/
*   /*                                                               */
*   /* ADD THE DDRCOM TO THE DDR WAIT QUEUE                          */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0277
*   DS0PDDR->DDRNXT=DDRNXT;         /* SET UP NEXT POINTER IN NEW  0277
*                                      DDRCOM                        */
         L     @15,DS0PDDR(,PARMPTR)                               0277
         L     @12,DDRNXT(,DDRPTR)                                 0277
         ST    @12,DDRNXT(,@15)                                    0277
*   DDRNXT=DS0PDDR;                 /* SET UP NEXT POINTER IN      0278
*                                      PREVIOUS DDRCOM ON QUEUE      */
         ST    @15,DDRNXT(,DDRPTR)                                 0278
*   DS0PSQ='1'B;                    /* INDICATE DDRCOM ON QUEUE      */
         OI    DS0PSQ(PARMPTR),B'10000000'                         0279
*   RETURN;                         /* RETURN TO CALLER              */
@EL00003 DS    0H                                                  0280
@EF00003 DS    0H                                                  0280
@ER00003 BR    @14                                                 0280
*   RFY                                                            0281
*    (RTNADDR,                                                     0281
*     DDRPTR) UNRSTD;                                              0281
*   END DS0ADDEL;                                                  0282
@PB00003 DS    0H                                                  0283
*   GENERATE NOREFS NOSETS(EJECT);                                 0283
*                                                                  0283
         EJECT
*   /*****************************************************************/
*   /*                                                               */
*   /* SUBROUTINE DS0FRR - FRR EXIT - ENTERED FROM RTM               */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0284
*DS0FRR:                            /* FRR EXIT ENTRY POINT          */
*   ENTRY;                                                         0284
@EP00284 DS    0H                                                  0285
*   RFY                                                            0285
*    (R0,                                                          0285
*     R1,                                                          0285
*     FRRSVR1,                                                     0285
*     FRRSV14,                                                     0285
*     RTNADDR,                                                     0285
*     SDWAPTR,                                                     0285
*     DDRPTR,                                                      0285
*     SAVEPTR) RSTD;                                               0285
*                                                                  0285
*/*   REG 0 CONTAINS A 200 BYTE WORKAREA                     @YM02578*/
*                                                                  0286
*   FRRSVR1=SDWAPTR;                /* SAVE ADDRESS OF SDWA          */
         LR    FRRSVR1,SDWAPTR                                     0286
*   FRRSV14=RTNADDR;                /* SAVE RETURN ADDRESS           */
         LR    FRRSV14,RTNADDR                                     0287
*   PARMPTR=SDWAPARM;               /* PICK UP ADDRESS OF LOCAL WORK
*                                      AREA                          */
         L     PARMPTR,SDWAPARM(,SDWAPTR)                          0288
*   IF DS0PDDR^=0 THEN              /* HAS THE DDRCOM POINTER BEEN 0289
*                                      SAVED YET                     */
         L     @15,DS0PDDR(,PARMPTR)                               0289
         LTR   @15,@15                                             0289
         BZ    @RF00289                                            0289
*     DO;                           /* YES, MAY HAVE TO POST IT    0290
*                                      AND/OR GET RID OF IT          */
*       DDRPTR=DS0PDDR;             /* PICK UP ADDRESS OF DDRCOM     */
         LR    DDRPTR,@15                                          0291
*       DDRHAMA='1'B;               /* INDICATE 'DEAD' DDRCOM        */
         OI    DDRHAMA(DDRPTR),B'00100000'                         0292
*       IF DDRSYS='1'B THEN         /* IS THIS A SYSTEM REQUEST      */
         TM    DDRSYS(DDRPTR),B'01000000'                          0293
         BNO   @RF00293                                            0293
*         DO;                       /* YES, POST AN I/O ERROR        */
*           IOSEX='1'B;             /* SET UP TO POST PERMANENT I/O
*                                      ERROR                         */
*           IOSERR='0'B;                                           0296
         L     @15,IOSBPTR(,DDRPTR)                                0296
         OI    IOSEX(@15),B'00000100'                              0296
         NI    IOSERR(@15),B'11011111'                             0296
*           SAVEPTR=R0;             /* POINT TO SAVE AREA    @YM02578*/
         LR    SAVEPTR,R0                                          0297
*           RFY                                                    0298
*            (R0) UNRSTD;           /*                       @YM02578*/
*                                                                  0298
*           /*********************************************************/
*           /*                                                       */
*           /* POST THE USER WITH A PERMANENT I/O ERROR              */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0299
*           GEN(STM   14,12,12(SAVEPTR));/* SAVE REGISTERS           */
         STM   14,12,12(SAVEPTR)
*           R1=DDRUIOSB;            /* SET UP SVC 15 PARAMETER       */
         L     R1,DDRUIOSB(,DDRPTR)                                0300
*           CALL IGC015;            /* BRANCH ENTER ERROR EXCP       */
         L     @12,CVTPTR                                          0301
         L     @12,IOCOMPTR(,@12)                                  0301
         L     @15,IOCSVCF(,@12)                                   0301
         BALR  @14,@15                                             0301
*           GEN(LM    14,12,12(SAVEPTR));/* RESTORE REGISTERS        */
         LM    14,12,12(SAVEPTR)
*           DDRPRG='1'B;            /* INDICATE PURGED REQUEST       */
         OI    DDRPRG(DDRPTR),B'00001000'                          0303
*           DDRUIOSB=0;             /* CLEAR IOSB POINTER            */
         SLR   @15,@15                                             0304
         ST    @15,DDRUIOSB(,DDRPTR)                               0304
*         END;                                                     0305
*       IF DS0PSQ='0'B THEN         /* IS DDRCOM ON WAIT QUEUE       */
*                                                                  0306
@RF00293 TM    DS0PSQ(PARMPTR),B'10000000'                         0306
         BNZ   @RF00306                                            0306
*         /***********************************************************/
*         /*                                                         */
*         /* DDRCOM IS NOT QUEUED YET - FREEMAIN THE DDRCOM          */
*         /*                                                         */
*         /***********************************************************/
*                                                                  0307
*         DO;                                                      0307
*           RFY                                                    0308
*            (R11,                                                 0308
*             R12,                                                 0308
*             R13,                                                 0308
*             R14) RSTD;                                           0308
*           GENERATE REFS(PSALITA,FLC) SETS(R11,R12,R13,R14);      0309
GETSALC4 SETLOCK OBTAIN,TYPE=SALLOC,MODE=UNCOND,                      **
               RELATED=(SALLOC,IGFDS0(RELSALC4))
*           DO;                     /* FREEMAIN(RU) LV(LENGTH(DDRSHOR
*                                      T))A(DDRSHORT) SP(DDRSPN)   0310
*                                      BRANCH(GLOBAL)                */
*             RESPECIFY                                            0311
*              (GPR01F,                                            0311
*               GPR03F,                                            0311
*               GPR00F,                                            0311
*               GPR04P) RESTRICTED;                                0311
*             GPR01F=0;             /* REG 1 MUST BE ZERO            */
         SLR   GPR01F,GPR01F                                       0312
*             GPR03F=3;             /* SET TYPE                      */
         LA    GPR03F,3                                            0313
*             GPR00F=LENGTH(DDRSHORT);/* LENGTH REQUESTED            */
         LA    GPR00F,24                                           0314
*             GPR01F=ADDR(DDRSHORT);/* SET REGISTER ONE              */
         LR    GPR01F,DDRPTR                                       0315
*             GPR03F=GPR03F+((DDRSPN)*256);/* SUBPOOL VALUE          */
         AL    GPR03F,@CF02230                                     0316
*             GPR04P=WSAGGMFM;      /* POINT TO SAVE AREA            */
         L     @15,CVTPTR                                          0317
         L     @07,CVTSPSA(,@15)                                   0317
         L     GPR04P,WSAGGMFM(,@07)                               0317
*             CALL CVTGLMN;         /* BRANCH ENTRY POINT            */
         L     @15,CVTGLMN(,@15)                                   0318
         BALR  @14,@15                                             0318
*             RESPECIFY                                            0319
*              (GPR01F,                                            0319
*               GPR03F,                                            0319
*               GPR00F,                                            0319
*               GPR04P) UNRESTRICTED;                              0319
*           END;                    /* FREEMAIN(RU) LV(LENGTH(DDRSHOR
*                                      T))A(DDRSHORT) SP(DDRSPN)   0320
*                                      BRANCH(GLOBAL)                */
*           GENERATE REFS(PSALITA,FLC) SETS(R11,R12,R13,R14);      0321
RELSALC4 SETLOCK RELEASE,TYPE=SALLOC,RELATED=(SALLOC,IGFDS0(GETSALC4))
*           RFY                                                    0322
*            (R11,                                                 0322
*             R12,                                                 0322
*             R13,                                                 0322
*             R14) UNRSTD;                                         0322
*         END;                                                     0323
*     END;                                                         0324
*                                                                  0324
@RF00306 DS    0H                                                  0325
*   /*****************************************************************/
*   /*                                                               */
*   /* SET UP FOR RETURN TO RTM                                      */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0325
*   SDWAPTR=FRRSVR1;                /* RESTORE SDWA ADDRESS          */
@RF00289 LR    SDWAPTR,FRRSVR1                                     0325
*   DO;                             /* SETRP RETADDR(IGFDS0R)RUB(DS0P
*                                      RUB)RECORD(YES)RECPARM(DERRECP
*                                      M)RC(4)RETREGS(YES)           */
*     RESPECIFY                                                    0327
*      (GPR00P,                                                    0327
*       GPR01P,                                                    0327
*       GPR14P,                                                    0327
*       GPR15P) RSTD;                                              0327
*     GPR01P->SDWARCDE=4;           /* STORE RC INTO SDWA            */
         MVI   SDWARCDE(GPR01P),X'04'                              0328
*     GPR01P->SDWARTYA=ADDR(IGFDS0R);/* SAVE RETRY ADDRESS           */
         LA    @12,IGFDS0R                                         0329
         ST    @12,SDWARTYA(,GPR01P)                               0329
*     GPR01P->SDWARCRD='1'B;        /* TURN ON RECORD INDICATOR      */
         OI    SDWARCRD(GPR01P),B'10000000'                        0330
*     GPR15P=ADDR(DERRECPM);        /* ACCESS RECORD PARAMETER LIST  */
         LA    GPR15P,DERRECPM                                     0331
*     GPR01P->SDWARECP=GPR15P->I256C(1:24);/* COPY RECORD PARAMETERS */
         MVC   SDWARECP(24,GPR01P),I256C(GPR15P)                   0332
*     GPR01P->SDWAUPRG='1'B;        /* TURN ON RETREGS INDICATOR     */
         OI    SDWAUPRG(GPR01P),B'00001000'                        0333
*     GPR15P=ADDR(DS0PRUB);         /* GET PTR TO REG UPDATE BLOCK   */
         LA    GPR15P,DS0PRUB(,PARMPTR)                            0334
*     GPR00P=GPR15P->I015F;         /* ACCESS REGISTER BIT PATTERN   */
         LH    GPR00P,I015F(,GPR15P)                               0335
*     GPR15P=GPR15P+2;              /* CREATE PTR TO USER REG VALUES */
         AL    GPR15P,@CF00281                                     0336
*     GPR14P=ADDR(GPR01P->SDWASRSV);/* CREATE PTR TO SDWA SAVE AREA  */
         LA    GPR14P,SDWASRSV(,GPR01P)                            0337
*     GEN(SLL   0,16);              /* SHIFT BIT PATTERN TO HIGH   0338
*                                      ORDER                         */
         SLL   0,16
*R0009:                                                            0339
*     GEN FLOWS(I0009);                                            0339
R0009    DS    0H                                                  0339
        ALR   0,0                    SHIFT BIT TO SIGN POSITION
        BC    12,I0009               BRANCH IF BIT NOT ON
        MVC   0(4,14),0(15)          MODIFY REGISTER IN SDWA
        LA    15,4(15)               UPDATE POINTER
*I0009:                                                            0340
*     GENERATE FLOWS(R0009);                                       0340
I0009    DS    0H                                                  0340
        LA    14,4(14)               UPDATE PTR IN SDWA
        BC    5,R0009                TEST ALR CONDITION CODE TO TEST
*                                    IF ALL BITS EXHAUSTED
*     RESPECIFY                                                    0341
*      (GPR00P,                                                    0341
*       GPR01P,                                                    0341
*       GPR14P,                                                    0341
*       GPR15P) UNRSTD;                                            0341
*   END;                                                           0342
*   RTNADDR=FRRSV14;                /* RESTORE RETURN ADDRESS        */
         LR    RTNADDR,FRRSV14                                     0343
*   RETURN;                         /* RETURN TO CALLER (RTM)        */
         B     @EL00001                                            0344
*   RFY                                                            0345
*    (R1,                                                          0345
*     FRRSVR1,                                                     0345
*     FRRSV14,                                                     0345
*     RTNADDR,                                                     0345
*     SDWAPTR,                                                     0345
*     DDRPTR,                                                      0345
*     SAVEPTR) UNRSTD;                                             0345
*                                                                  0346
*   /*****************************************************************/
*   /*                                                               */
*   /* ?EPILOG - GENERATE DECLARES FOR SYSTEM MACROS                 */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0346
*   DECLARE                         /* GENERAL PURPOSE REGISTERS     */
*     GPR00F FIXED(31) REG(0),                                     0346
*     GPR01F FIXED(31) REG(1),                                     0346
*     GPR03F FIXED(31) REG(3),                                     0346
*     GPR00P PTR(31) REG(0),                                       0346
*     GPR01P PTR(31) REG(1),                                       0346
*     GPR04P PTR(31) REG(4),                                       0346
*     GPR14P PTR(31) REG(14),                                      0346
*     GPR15P PTR(31) REG(15);                                      0346
*   DECLARE                         /* COMMON VARIABLES              */
*     I256C CHAR(256) BASED,                                       0347
*     I031F FIXED(31) BASED,                                       0347
*     I031P PTR(31) BASED,                                         0347
*     I015F FIXED(15) BASED,                                       0347
*     I015P PTR(15) BASED,                                         0347
*     I008P PTR(8) BASED,                                          0347
*     I001C CHAR(1) BASED;                                         0347
*   END IGFDS0                      /* END OF MODULE                 */
*                                                                  0348
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */
*/*%INCLUDE SYSLIB  (IHAASCB )                                       */
*/*%INCLUDE SYSLIB  (IHAASXB )                                       */
*/*%INCLUDE SYSLIB  (CVT     )                                       */
*/*%INCLUDE SYSLIB  (IHADDR  )                                       */
*/*%INCLUDE SYSLIB  (IHAFRRS )                                       */
*/*%INCLUDE SYSLIB  (IECDIOCM)                                       */
*/*%INCLUDE SYSLIB  (IECDIOSB)                                       */
*/*%INCLUDE SYSLIB  (IHAIQE  )                                       */
*/*%INCLUDE SYSLIB  (IHAPSA  )                                       */
*/*%INCLUDE SYSLIB  (IKJRB   )                                       */
*/*%INCLUDE SYSLIB  (IHASDWA )                                       */
*/*%INCLUDE SYSLIB  (IHASRB  )                                       */
*/*%INCLUDE SYSLIB  (IHAWSAVT)                                       */
*                                                                  0348
*       ;                                                          0348
@DATA    DS    0H
@CH00034 DC    H'1'
@DATD    DSECT
         DS    0F
IGFDS0   CSECT
         DS    0F
@CF00281 DC    F'2'
@CF00109 DC    F'4'
@CF02230 DC    F'62720'
@CF02207 DC    XL4'410A0000'
@DATD    DSECT
         DS    0D
@ENDDATD EQU   *
IGFDS0   CSECT
         NOPR  ((@ENDDATD-@DATD)*16)
         DS    0F
@SIZDATD DC    AL1(0)
         DC    AL3(@ENDDATD-@DATD)
@CA02198 DC    A(DS0FRR)
@CV00079 DC    V(IGFDS1)
         DS    0D
@CB00037 DC    X'0480'
DERRECPM DS    CL24
         ORG   DERRECPM
@NM00126 DC    CL8'IGFDI0'
@NM00127 DC    CL8'IGFDS0'
@NM00128 DC    CL8'76161'
         ORG   DERRECPM+24
         DS    CL2
IGFDS0P  DC    13F'0'
@00      EQU   00                      EQUATES FOR REGISTERS 0-15
@01      EQU   01
@02      EQU   02
@03      EQU   03
@04      EQU   04
@05      EQU   05
@06      EQU   06
@07      EQU   07
@08      EQU   08
@09      EQU   09
@10      EQU   10
@11      EQU   11
@12      EQU   12
@13      EQU   13
@14      EQU   14
@15      EQU   15
CODEBASE EQU   @08
R0       EQU   @00
R1       EQU   @01
SDWAPTR  EQU   @01
RBSECPTR EQU   @01
SRBPTR   EQU   @02
RTCB     EQU   @04
EXITADDR EQU   @05
FRRSV14  EQU   @05
FRRSVR1  EQU   @06
PARMPTR  EQU   @09
REGADDR  EQU   @09
DDRPTR   EQU   @10
R11      EQU   @11
RWORK1   EQU   @11
R12      EQU   @12
RWORK2   EQU   @12
R13      EQU   @13
IQEPTR   EQU   @13
SAVEPTR  EQU   @13
R14      EQU   @14
RTNADDR  EQU   @14
GPR01F   EQU   @01
GPR03F   EQU   @03
GPR00F   EQU   @00
GPR04P   EQU   @04
GPR00P   EQU   @00
GPR01P   EQU   @01
GPR14P   EQU   @14
GPR15P   EQU   @15
PSA      EQU   0
FLCRNPSW EQU   PSA
FLCROPSW EQU   PSA+8
FLCICCW2 EQU   PSA+16
FLCCVT   EQU   FLCICCW2
PSAEEPSW EQU   PSA+132
PSAESPSW EQU   PSA+136
FLCSVILC EQU   PSAESPSW+1
PSAEPPSW EQU   PSA+140
FLCPIILC EQU   PSAEPPSW+1
FLCPICOD EQU   PSAEPPSW+2
PSAPICOD EQU   FLCPICOD+1
FLCTEA   EQU   PSAEPPSW+4
FLCPER   EQU   PSA+152
FLCMCLA  EQU   PSA+168
FLCIOEL  EQU   FLCMCLA+4
FLCIOA   EQU   FLCMCLA+16
FLCFSA   EQU   FLCMCLA+80
PSASUPER EQU   PSA+552
PSASUP1  EQU   PSASUPER
PSASUP2  EQU   PSASUPER+1
PSASUP3  EQU   PSASUPER+2
PSASUP4  EQU   PSASUPER+3
PSACLHT  EQU   PSA+640
PSALKSA  EQU   PSA+696
PSAHLHI  EQU   PSA+760
PSALITA  EQU   PSA+764
PSADSSFL EQU   PSA+836
PSADSSF1 EQU   PSADSSFL
PSADSSF3 EQU   PSADSSFL+2
PSADSSF4 EQU   PSADSSFL+3
PSARSVT  EQU   PSA+896
PSALSFCC EQU   PSA+1012
IEA0EF00 EQU   0
IGC015   EQU   0
DS0PLIST EQU   0
DS0STAT  EQU   DS0PLIST
DS0STAT1 EQU   DS0STAT
DS0PSQ   EQU   DS0STAT1
DS0PRUB  EQU   DS0PLIST+2
DS0PR14  EQU   DS0PLIST+4
DS0PBASE EQU   DS0PLIST+8
DS0PDDR  EQU   DS0PLIST+12
DS0PASCB EQU   DS0PLIST+16
@NM00003 EQU   0
CURRASCB EQU   @NM00003+12
ASCB     EQU   0
ASCBASID EQU   ASCB+36
ASCBFW1  EQU   ASCB+100
ASCBRCTF EQU   ASCBFW1+2
ASCBFLG1 EQU   ASCBFW1+3
ASCBASXB EQU   ASCB+108
ASCBDSP1 EQU   ASCB+114
ASCBFLG2 EQU   ASCB+115
ASXB     EQU   0
ASXBFTCB EQU   ASXB+4
ASXBDDR  EQU   ASXB+124
ASXBAEQ  EQU   ASXB+168
CVTMAP   EQU   0
CVTTCBP  EQU   CVTMAP
CVT0EF00 EQU   CVTMAP+4
CVTDAR   EQU   CVTMAP+72
CVTFLGS1 EQU   CVTDAR
CVTDCB   EQU   CVTMAP+116
CVTIXAVL EQU   CVTMAP+124
CVTIERLC EQU   CVTMAP+144
CVTOPTA  EQU   CVTMAP+182
CVTOPTB  EQU   CVTMAP+183
CVTGTF   EQU   CVTMAP+236
CVTGTFST EQU   CVTGTF
CVTGTFS  EQU   CVTGTFST
CVTSTATE EQU   CVTGTFST
CVTTMODE EQU   CVTGTFST
CVTFORM  EQU   CVTGTFST
CVTAQAVT EQU   CVTMAP+240
CVTTCMFG EQU   CVTAQAVT
CVTVOLM2 EQU   CVTMAP+244
CVTTATA  EQU   CVTVOLM2
CVTTSKS  EQU   CVTTATA
CVTVOLF2 EQU   CVTTSKS
CVTTAT   EQU   CVTTATA+1
CVTATER  EQU   CVTMAP+248
CVTEXT1  EQU   CVTMAP+252
CVTPURG  EQU   CVTMAP+260
CVTQMSG  EQU   CVTMAP+268
CVTDMSR  EQU   CVTMAP+272
CVTERPV  EQU   CVTMAP+316
CVTINTLA EQU   CVTMAP+320
CVTAPF   EQU   CVTMAP+324
CVTEXT2  EQU   CVTMAP+328
CVTHJES  EQU   CVTMAP+332
CVTPGSIA EQU   CVTMAP+348
CVTA1F1  EQU   CVTMAP+356
CVTSYSK  EQU   CVTMAP+357
CVTVOLM1 EQU   CVTMAP+380
CVTVOLF1 EQU   CVTVOLM1
CVTATMCT EQU   CVTMAP+388
CVTXTNT1 EQU   0
CVTXTNT2 EQU   0
CVTDSSV  EQU   CVTXTNT2
CVTFLGBT EQU   CVTXTNT2+5
CVTQID   EQU   CVTXTNT2+24
CVTRV400 EQU   CVTXTNT2+52
CVTRV409 EQU   CVTXTNT2+53
CVTATCVT EQU   CVTXTNT2+64
CVTRV429 EQU   CVTXTNT2+84
CVTRV438 EQU   CVTXTNT2+85
CVTRV457 EQU   CVTXTNT2+112
CVTRV466 EQU   CVTXTNT2+113
CVTFIX   EQU   0
CVTRELNO EQU   CVTFIX+252
DDRCOM   EQU   0
DDRSHORT EQU   DDRCOM
DDRNXT   EQU   DDRSHORT+4
DDRCNTRL EQU   DDRSHORT+8
DDRSRC   EQU   DDRCNTRL
DDROPER  EQU   DDRSRC
DDRSYS   EQU   DDRSRC
DDRSTAT  EQU   DDRCNTRL+1
DDRHAMA  EQU   DDRSTAT
DDRPRG   EQU   DDRSTAT
DDRDCHAR EQU   DDRCNTRL+2
DDRDSTAT EQU   DDRDCHAR+1
DDRUIOSB EQU   DDRSHORT+12
DDRLONG  EQU   DDRCOM+24
DDRROWN  EQU   DDRLONG+8
DDRMIHT  EQU   DDRLONG+12
DDRTER   EQU   DDRLONG+36
DDRINV   EQU   DDRLONG+38
DDRAPP   EQU   DDRLONG+40
DDRIOF   EQU   DDRLONG+52
DDRIOF2  EQU   DDRIOF+1
DDRMSG   EQU   DDRLONG+54
DDRMSGP  EQU   DDRLONG+56
DDRLABEL EQU   DDRLONG+64
DDRREC   EQU   DDRLONG+66
DDRREC2  EQU   DDRREC+1
DDRUSER  EQU   DDRLONG+68
FRRS     EQU   0
FRRSHEAD EQU   FRRS
FRRSEMP  EQU   FRRSHEAD
FRRSLAST EQU   FRRSHEAD+4
FRRSELEN EQU   FRRSHEAD+8
FRRSCURR EQU   FRRSHEAD+12
FRRSENTR EQU   0
FRRSFRRA EQU   FRRSENTR
FRRSFLGS EQU   FRRSENTR+4
FRRSFLG1 EQU   FRRSFLGS
FRRSPARM EQU   FRRSENTR+8
IOCOM    EQU   0
IOCSVCF  EQU   IOCOM+104
IOSB     EQU   0
IOSFLA   EQU   IOSB
IOSACHN  EQU   IOSFLA
IOSERR   EQU   IOSFLA
IOSEX    EQU   IOSFLA
IOSFLB   EQU   IOSB+1
IOSFLC   EQU   IOSB+2
IOSDVALT EQU   IOSFLC
IOSPKEY  EQU   IOSB+12
IOSOPT   EQU   IOSB+14
IOSOPT2  EQU   IOSB+15
@NM00022 EQU   IOSB+20
IOSCSW   EQU   @NM00022+1
IOSTATUS EQU   IOSCSW+3
IOSIPIB  EQU   IOSB+44
IOSPATH  EQU   IOSB+86
IOSCHN   EQU   IOSPATH
IOSCKEY  EQU   IOSB+89
IOSEEKA  EQU   IOSB+100
IOSCCHH  EQU   IOSEEKA+3
IOSSKHH  EQU   IOSCCHH+2
IQESECT  EQU   0
IQELNK   EQU   IQESECT
IQEPARAM EQU   IQESECT+4
IQEIRB   EQU   IQESECT+8
IQEFLAGS EQU   IQEIRB
IQEIRBA  EQU   IQEIRB+1
IQETCB   EQU   IQESECT+12
IQETCBA  EQU   IQETCB+1
RBPREFIX EQU   0
RBRSV019 EQU   RBPREFIX+14
RBRSV028 EQU   RBPREFIX+15
RBRSV041 EQU   RBPREFIX+27
RBRSV054 EQU   RBPREFIX+39
RBRTOPSW EQU   RBPREFIX+40
RBRTPSW2 EQU   RBRTOPSW+8
RBRTICIL EQU   RBRTPSW2
RBFLAGS1 EQU   RBPREFIX+56
RBINTCDA EQU   RBPREFIX+61
RBSECT   EQU   0
RBPPSAV  EQU   RBSECT
@NM00060 EQU   RBSECT+10
@NM00061 EQU   @NM00060
RBTRSVRB EQU   @NM00061
@NM00063 EQU   @NM00060+1
RBETXR   EQU   @NM00063
RBEP     EQU   RBSECT+12
RBPGMQ   EQU   RBSECT+24
@NM00070 EQU   RBSECT+28
IRBEND   EQU   RBSECT+96
@NM00074 EQU   RBSECT+96
RBRSV138 EQU   @NM00074+7
RBRSV150 EQU   RBSECT+167
SDWA     EQU   0
SDWAPARM EQU   SDWA
SDWAFIOB EQU   SDWA+4
SDWAABCC EQU   SDWAFIOB
SDWACMPF EQU   SDWAABCC
SDWACTL1 EQU   SDWA+8
SDWACMKA EQU   SDWACTL1
SDWAMWPA EQU   SDWACTL1+1
SDWAPMKA EQU   SDWACTL1+4
SDWACTL2 EQU   SDWA+16
SDWACMKP EQU   SDWACTL2
SDWAMWPP EQU   SDWACTL2+1
SDWAPMKP EQU   SDWACTL2+4
SDWAGRSV EQU   SDWA+24
SDWANAME EQU   SDWA+88
SDWAEC1  EQU   SDWA+104
SDWAEMK1 EQU   SDWAEC1
SDWAMWP1 EQU   SDWAEC1+1
SDWAINT1 EQU   SDWAEC1+2
SDWANXT1 EQU   SDWAEC1+4
SDWAAEC1 EQU   SDWA+112
SDWAILC1 EQU   SDWAAEC1+1
SDWAINC1 EQU   SDWAAEC1+2
SDWAICD1 EQU   SDWAINC1+1
SDWAEC2  EQU   SDWA+120
SDWAEMK2 EQU   SDWAEC2
SDWAMWP2 EQU   SDWAEC2+1
SDWAINT2 EQU   SDWAEC2+2
SDWANXT2 EQU   SDWAEC2+4
SDWAAEC2 EQU   SDWA+128
SDWAILC2 EQU   SDWAAEC2+1
SDWAINC2 EQU   SDWAAEC2+2
SDWAICD2 EQU   SDWAINC2+1
SDWASRSV EQU   SDWA+136
SDWAIDNT EQU   SDWA+200
SDWAMCH  EQU   SDWA+204
SDWASTCK EQU   SDWAMCH
SDWAMCHI EQU   SDWAMCH+8
SDWAMCHS EQU   SDWAMCHI
SDWAMCHD EQU   SDWAMCHI+1
SDWARSR1 EQU   SDWAMCH+12
SDWARSR2 EQU   SDWAMCH+13
SDWAFLGS EQU   SDWA+232
SDWAERRA EQU   SDWAFLGS
SDWAERRB EQU   SDWAFLGS+1
SDWAERRC EQU   SDWAFLGS+2
SDWAERRD EQU   SDWAFLGS+3
SDWAIOFS EQU   SDWA+238
SDWARTYA EQU   SDWA+240
SDWACPUA EQU   SDWA+248
SDWAPARQ EQU   SDWA+252
SDWARCDE EQU   SDWAPARQ
SDWAACF2 EQU   SDWAPARQ+1
SDWARCRD EQU   SDWAACF2
SDWAUPRG EQU   SDWAACF2
SDWAACF3 EQU   SDWAPARQ+2
SDWAACF4 EQU   SDWAPARQ+3
SDWALKWA EQU   SDWA+256
SDWALKWS EQU   SDWALKWA
SDWARECP EQU   SDWA+292
SDWASNPA EQU   SDWA+320
SDWADUMP EQU   SDWASNPA
SDWADPFS EQU   SDWADUMP+1
SDWADDAT EQU   SDWASNPA+4
SDWASDAT EQU   SDWADDAT
SDWAPDAT EQU   SDWADDAT+2
SDWADPSA EQU   SDWA+328
SDWADPSL EQU   SDWADPSA
SDWARA   EQU   SDWA+400
SDWADPVA EQU   SDWARA+2
SRBSECT  EQU   0
SRBASCB  EQU   SRBSECT+8
SRBFLC   EQU   SRBSECT+12
WSAG     EQU   0
WSAGGMFM EQU   WSAG+4
I256C    EQU   0
I015F    EQU   0
IQEEND   EQU   0
I001C    EQU   0
I008P    EQU   0
I015P    EQU   0
I031F    EQU   0
I031P    EQU   0
LOCLSAVE EQU   0
ASCBPTR  EQU   DS0PASCB
ASXBPTR  EQU   ASCBASXB
CVTPTR   EQU   FLCCVT
IOCOMPTR EQU   CVTIXAVL
IOSBPTR  EQU   DDRUIOSB
CVTS01   EQU   CVTPGSIA
CVTLPDIA EQU   CVTS01+12
CVTDIRST EQU   CVTLPDIA
CVTSLIDA EQU   CVTS01+24
CVTCTLFG EQU   CVTS01+50
CVTS1EE  EQU   CVTS01+172
CVTGLMN  EQU   CVTS01+332
CVTSPSA  EQU   CVTS01+336
CVTRV210 EQU   CVTS01+424
CVTRV219 EQU   CVTS01+425
CVTRV228 EQU   CVTS01+426
CVTRV237 EQU   CVTS01+427
CVTMFRTR EQU   CVTS01+452
CVTRV262 EQU   CVTS01+468
CVTRV271 EQU   CVTS01+469
CVTRV280 EQU   CVTS01+470
CVTRV289 EQU   CVTS01+471
CVTGSDA  EQU   CVTS01+600
IOSATTSC EQU   IOSIPIB
IOSWTOWA EQU   IOSIPIB
IOSPCISC EQU   IOSIPIB
FLC      EQU   PSA
PSARSVTE EQU   PSARSVT
PSACSTK  EQU   PSARSVTE
RBSECS03 EQU   RBEP
RBCDE    EQU   RBSECS03
RBCDFLGS EQU   RBCDE
RBSECS05 EQU   RBPGMQ
RBSQE    EQU   RBSECS05
RBSECS06 EQU   RBPGMQ
RBIQE    EQU   RBSECS06
RBSECS07 EQU   RBPGMQ
RBIQE2   EQU   RBSECS07
RBSECS08 EQU   IRBEND
RBIQEWRK EQU   RBSECS08+4
RBSECS09 EQU   IRBEND
SRB      EQU   SRBSECT
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS
RBRSV161 EQU   RBSECS09+64
RBSIRBWA EQU   RBSECS09
RBNEXAV  EQU   RBSECS08
RBIQEA   EQU   RBIQE2
RBIQE1   EQU   RBIQE+1
RBUSE    EQU   RBIQE
RBSQEA   EQU   RBSQE+1
@NM00075 EQU   RBSQE
RBCDE1   EQU   RBCDE+1
RBCDLOAD EQU   RBCDFLGS
RBCDXCTL EQU   RBCDFLGS
RBCDSYNC EQU   RBCDFLGS
RBCDNODE EQU   RBCDFLGS
RBRSV010 EQU   RBCDFLGS
RBCDATCH EQU   RBCDFLGS
RBRSV009 EQU   RBCDFLGS
RBNOCELL EQU   RBCDFLGS
PSARSAV  EQU   PSARSVTE+60
PSARSTK  EQU   PSARSVTE+56
PSAESAV3 EQU   PSARSVTE+52
PSAESTK3 EQU   PSARSVTE+48
PSAESAV2 EQU   PSARSVTE+44
PSAESTK2 EQU   PSARSVTE+40
PSAESAV1 EQU   PSARSVTE+36
PSAESTK1 EQU   PSARSVTE+32
PSAPSAV  EQU   PSARSVTE+28
PSAPSTK  EQU   PSARSVTE+24
PSAMSAV  EQU   PSARSVTE+20
PSAMSTK  EQU   PSARSVTE+16
PSASSAV  EQU   PSARSVTE+12
PSASSTK  EQU   PSARSVTE+8
PSANSTK  EQU   PSARSVTE+4
IOSPCIWA EQU   IOSPCISC+44
IOSPCIRS EQU   IOSPCISC+8
@NM00027 EQU   IOSPCISC+4
@NM00026 EQU   IOSPCISC
IOSWRNDR EQU   IOSWTOWA+4
IOSWTOPT EQU   IOSWTOWA+3
IOSWTOCP EQU   IOSWTOWA+2
IOSWTOCH EQU   IOSWTOWA
IOSATTWA EQU   IOSATTSC+40
@NM00025 EQU   IOSATTSC+24
IOSATTSN EQU   IOSATTSC
CVTRV628 EQU   CVTS01+728
CVTRV627 EQU   CVTS01+724
CVTRV626 EQU   CVTS01+720
CVTRV625 EQU   CVTS01+716
CVTRV624 EQU   CVTS01+712
CVTRV623 EQU   CVTS01+708
CVTRV622 EQU   CVTS01+704
CVTRV621 EQU   CVTS01+700
CVTRV620 EQU   CVTS01+696
CVTRV619 EQU   CVTS01+692
CVTRV618 EQU   CVTS01+688
CVTRV617 EQU   CVTS01+684
CVTRV616 EQU   CVTS01+680
CVTRV615 EQU   CVTS01+676
CVTRV614 EQU   CVTS01+672
CVTRV613 EQU   CVTS01+668
CVTRV612 EQU   CVTS01+664
CVTRV611 EQU   CVTS01+660
CVTRV610 EQU   CVTS01+656
CVTRV609 EQU   CVTS01+652
CVTRV608 EQU   CVTS01+648
CVTRV607 EQU   CVTS01+644
CVTRV606 EQU   CVTS01+640
CVTRV605 EQU   CVTS01+636
CVTRV604 EQU   CVTS01+632
CVTEFF02 EQU   CVTS01+628
CVTCBBR  EQU   CVTS01+624
CVTSSCR  EQU   CVTS01+620
CVTEVENT EQU   CVTS01+616
CVTCRCA  EQU   CVTS01+612
CVTTPIO  EQU   CVTS01+608
CVTADV   EQU   CVTS01+604
CVTGSDAB EQU   CVTGSDA
CVTQV3   EQU   CVTS01+596
CVTQV2   EQU   CVTS01+592
CVTQV1   EQU   CVTS01+588
CVTRPT   EQU   CVTS01+584
CVTSSRB  EQU   CVTS01+580
CVTCSDRL EQU   CVTS01+576
CVTEXP1  EQU   CVTS01+572
CVTRMPMT EQU   CVTS01+568
CVTRMPTT EQU   CVTS01+564
CVTVPSA  EQU   CVTS01+560
CVTVSTOP EQU   CVTS01+556
CVTGTFR8 EQU   CVTS01+552
CVTQUIT  EQU   CVTS01+548
CVTVACR  EQU   CVTS01+544
CVTWTCB  EQU   CVTS01+540
CVTSTPRS EQU   CVTS01+536
CVT0PT02 EQU   CVTS01+532
CVTDARCM EQU   CVTS01+528
CVTIRECM EQU   CVTS01+524
CVTJRECM EQU   CVTS01+520
CVTVEMS0 EQU   CVTS01+516
CVTSPFRR EQU   CVTS01+512
CVTRLSTG EQU   CVTS01+508
CVT0TC0A EQU   CVTS01+504
CVTGMBR  EQU   CVTS01+500
CVTLFRM  EQU   CVTS01+496
CVTRMBR  EQU   CVTS01+492
CVTVIOP  EQU   CVTS01+488
CVTRV307 EQU   CVTS01+486
CVTRV306 EQU   CVTS01+484
CVTRV305 EQU   CVTS01+482
CVTRV304 EQU   CVTS01+480
CVTRV303 EQU   CVTS01+478
CVTRV302 EQU   CVTS01+476
CVTTRCA  EQU   CVTS01+472
CVTRV297 EQU   CVTRV289
CVTRV296 EQU   CVTRV289
CVTRV295 EQU   CVTRV289
CVTRV294 EQU   CVTRV289
CVTRV293 EQU   CVTRV289
CVTRV292 EQU   CVTRV289
CVTRV291 EQU   CVTRV289
CVTRV290 EQU   CVTRV289
CVTRV288 EQU   CVTRV280
CVTRV287 EQU   CVTRV280
CVTRV286 EQU   CVTRV280
CVTRV285 EQU   CVTRV280
CVTRV284 EQU   CVTRV280
CVTRV283 EQU   CVTRV280
CVTRV282 EQU   CVTRV280
CVTRV281 EQU   CVTRV280
CVTRV279 EQU   CVTRV271
CVTRV278 EQU   CVTRV271
CVTRV277 EQU   CVTRV271
CVTRV276 EQU   CVTRV271
CVTRV275 EQU   CVTRV271
CVTRV274 EQU   CVTRV271
CVTRV273 EQU   CVTRV271
CVTRV272 EQU   CVTRV271
CVTRV270 EQU   CVTRV262
CVTRV269 EQU   CVTRV262
CVTRV268 EQU   CVTRV262
CVTRV267 EQU   CVTRV262
CVTRV266 EQU   CVTRV262
CVTRV265 EQU   CVTRV262
CVTRV264 EQU   CVTRV262
CVTRV263 EQU   CVTRV262
CVTVFP   EQU   CVTS01+464
CVTVSI   EQU   CVTS01+460
CVTVPSIB EQU   CVTS01+456
CVTMFACT EQU   CVTMFRTR
CVTMFCTL EQU   CVTS01+448
CVTPVBP  EQU   CVTS01+444
CVTPWI   EQU   CVTS01+440
CVTRV254 EQU   CVTS01+438
CVTRV253 EQU   CVTS01+436
CVTRV252 EQU   CVTS01+434
CVTRV251 EQU   CVTS01+433
CVTRV250 EQU   CVTS01+432
CVTRV249 EQU   CVTS01+431
CVTRV248 EQU   CVTS01+430
CVTRV247 EQU   CVTS01+429
CVTRV246 EQU   CVTS01+428
CVTRV245 EQU   CVTRV237
CVTRV244 EQU   CVTRV237
CVTRV243 EQU   CVTRV237
CVTRV242 EQU   CVTRV237
CVTRV241 EQU   CVTRV237
CVTRV240 EQU   CVTRV237
CVTRV239 EQU   CVTRV237
CVTRV238 EQU   CVTRV237
CVTRV236 EQU   CVTRV228
CVTRV235 EQU   CVTRV228
CVTRV234 EQU   CVTRV228
CVTRV233 EQU   CVTRV228
CVTRV232 EQU   CVTRV228
CVTRV231 EQU   CVTRV228
CVTRV230 EQU   CVTRV228
CVTRV229 EQU   CVTRV228
CVTRV227 EQU   CVTRV219
CVTRV226 EQU   CVTRV219
CVTRV225 EQU   CVTRV219
CVTRV224 EQU   CVTRV219
CVTRV223 EQU   CVTRV219
CVTRV222 EQU   CVTRV219
CVTRV221 EQU   CVTRV219
CVTRV220 EQU   CVTRV219
CVTRV218 EQU   CVTRV210
CVTRV217 EQU   CVTRV210
CVTRV216 EQU   CVTRV210
CVTRV215 EQU   CVTRV210
CVTRV214 EQU   CVTRV210
CVTRV213 EQU   CVTRV210
CVTRV212 EQU   CVTRV210
CVTRV211 EQU   CVTRV210
CVTLCCAT EQU   CVTS01+420
CVTPCCAT EQU   CVTS01+416
CVTIPCRP EQU   CVTS01+412
CVTIPCRI EQU   CVTS01+408
CVTIPCDS EQU   CVTS01+404
CVTAIDVT EQU   CVTS01+400
CVTSSAP  EQU   CVTS01+396
CVTEHCIR EQU   CVTS01+392
CVTEHDEF EQU   CVTS01+388
CVTDAIR  EQU   CVTS01+384
CVTPERFM EQU   CVTS01+380
CVT044R2 EQU   CVTS01+376
CVTFETCH EQU   CVTS01+372
CVTRSTWD EQU   CVTS01+368
CVTSPOST EQU   CVTS01+364
CVTIOBP  EQU   CVTS01+360
CVTASMVT EQU   CVTS01+356
CVTRECRQ EQU   CVTS01+352
CVTWSAC  EQU   CVTS01+348
CVTRV149 EQU   CVTS01+344
CVTWSAL  EQU   CVTS01+340
CVTVEAC0 EQU   CVTS01+328
CVT062R1 EQU   CVTS01+324
CVTRPOST EQU   CVTS01+320
CVTDQIQE EQU   CVTS01+316
CVTCSD   EQU   CVTS01+312
CVTLKRMA EQU   CVTS01+308
CVTRSPIE EQU   CVTS01+304
CVTRENQ  EQU   CVTS01+300
CVTLQCB  EQU   CVTS01+296
CVTFQCB  EQU   CVTS01+292
CVTQCS01 EQU   CVTS01+288
CVTAPFT  EQU   CVTS01+284
CVTPARRL EQU   CVTS01+280
CVTVWAIT EQU   CVTS01+276
CVTGSPL  EQU   CVTS01+272
CVTLSMQ  EQU   CVTS01+268
CVTGSMQ  EQU   CVTS01+264
CVTEXPRO EQU   CVTS01+260
CVTOPCTP EQU   CVTS01+256
CVTSIC   EQU   CVTS01+252
CVTTPIOS EQU   CVTS01+248
CVTRTMS  EQU   CVTS01+244
CVTSDBF  EQU   CVTS01+240
CVTSCBP  EQU   CVTS01+236
CVTSDMP  EQU   CVTS01+232
CVTSV60  EQU   CVTS01+228
CVTRTMCT EQU   CVTS01+224
CVTASCBL EQU   CVTS01+220
CVTASCBH EQU   CVTS01+216
CVTGDA   EQU   CVTS01+212
CVTASVT  EQU   CVTS01+208
CVTVVMDI EQU   CVTS01+204
CVTAQTOP EQU   CVTS01+200
CVTIOSCS EQU   CVTS01+196
CVTSDRM  EQU   CVTS01+192
CVTOPTE  EQU   CVTS01+188
CVTSTXU  EQU   CVTS01+184
CVTQUIS  EQU   CVTS01+180
CVTPARS  EQU   CVTS01+176
CVTFRAS  EQU   CVTS01+168
CVTQSAS  EQU   CVTS01+164
CVTCRAS  EQU   CVTS01+160
CVTCRMN  EQU   CVTS01+156
CVTDELCP EQU   CVTS01+152
CVTFRECL EQU   CVTS01+148
CVTGETCL EQU   CVTS01+144
CVTBLDCP EQU   CVTS01+140
CVTAUTHL EQU   CVTS01+136
CVTSCAN  EQU   CVTS01+132
CVTRV144 EQU   CVTS01+130
CVTMAXMP EQU   CVTS01+128
CVTSTCK  EQU   CVTS01+124
CVTRV139 EQU   CVTS01+123
CVTDSSAC EQU   CVTS01+122
CVTRV513 EQU   CVTS01+121
CVTIOSPL EQU   CVTS01+120
CVTPTGT  EQU   CVTS01+116
CVTCSPIE EQU   CVTS01+112
CVTSMFEX EQU   CVTS01+108
CVTOLT0A EQU   CVTS01+104
CVTSRBRT EQU   CVTS01+100
CVTPUTL  EQU   CVTS01+96
CVTRV519 EQU   CVTS01+92
CVTRV327 EQU   CVTS01+88
CVTRV326 EQU   CVTS01+84
CVTRV325 EQU   CVTS01+80
CVTRV324 EQU   CVTS01+76
CVT0VL01 EQU   CVTS01+72
CVTSHRVM EQU   CVTS01+68
CVTRV332 EQU   CVTS01+64
CVTTAS   EQU   CVTS01+60
CVTRSCN  EQU   CVTS01+56
CVTTRAC2 EQU   CVTS01+54
CVTTRACE EQU   CVTS01+52
CVTAPG   EQU   CVTS01+51
CVTSDTRC EQU   CVTCTLFG
CVTGTRCE EQU   CVTCTLFG
CVTNOMP  EQU   CVTCTLFG
CVTRSV79 EQU   CVTCTLFG
CVTDSTAT EQU   CVTCTLFG
CVTRSV78 EQU   CVTCTLFG
CVTRV333 EQU   CVTCTLFG
CVTRV323 EQU   CVTCTLFG
CVTSPVLK EQU   CVTS01+49
CVTRSV77 EQU   CVTS01+48
CVTRV331 EQU   CVTS01+44
CVTRV330 EQU   CVTS01+40
CVTRV329 EQU   CVTS01+36
CVTRV328 EQU   CVTS01+32
CVTRV322 EQU   CVTS01+28
CVTSLID  EQU   CVTSLIDA+1
CVTSYLK  EQU   CVTSLIDA
CVTRV321 EQU   CVTS01+20
CVTRV320 EQU   CVTS01+16
CVTLPDIR EQU   CVTLPDIA+1
CVTRSV69 EQU   CVTDIRST
CVTRSV68 EQU   CVTDIRST
CVTRSV67 EQU   CVTDIRST
CVTRSV66 EQU   CVTDIRST
CVTRSV65 EQU   CVTDIRST
CVTRSV64 EQU   CVTDIRST
CVTRSV63 EQU   CVTDIRST
CVTDICOM EQU   CVTDIRST
CVTPVTP  EQU   CVTS01+8
CVTLPDSR EQU   CVTS01+4
CVTGETL  EQU   CVTS01
WSAGSCHE EQU   WSAG+40
WSAGREST EQU   WSAG+36
WSAGNQDQ EQU   WSAG+32
WSAGMEMT EQU   WSAG+28
WSAGOPTM EQU   WSAG+24
WSAGSTAT EQU   WSAG+20
WSAGEMS0 EQU   WSAG+16
WSAGSSRS EQU   WSAG+12
WSAGRSM  EQU   WSAG+8
WSAGPGIO EQU   WSAG
@NM00125 EQU   SRBSECT+40
@NM00124 EQU   SRBSECT+38
SRBPRIOR EQU   SRBSECT+37
SRBPKF   EQU   SRBSECT+36
SRBSAVE  EQU   SRBSECT+32
SRBPARM  EQU   SRBSECT+28
SRBRMTR  EQU   SRBSECT+24
SRBEP    EQU   SRBSECT+20
SRBPTCB  EQU   SRBFLC+4
SRBPASID EQU   SRBFLC+2
SRBCPAFF EQU   SRBFLC
SRBFLNK  EQU   SRBSECT+4
SRBID    EQU   SRBSECT
@NM00123 EQU   SDWA+512
SDWAVRA  EQU   SDWARA+4
SDWAURAL EQU   SDWARA+3
@NM00122 EQU   SDWADPVA
SDWAEBC  EQU   SDWADPVA
SDWAHEX  EQU   SDWADPVA
SDWAVRAL EQU   SDWARA
@NM00121 EQU   SDWA+396
SDWACOMP EQU   SDWA+392
SDWARCPL EQU   SDWA+364
@NM00120 EQU   SDWADPSA+32
SDWATO4  EQU   SDWADPSL+28
SDWAFRM4 EQU   SDWADPSL+24
SDWATO3  EQU   SDWADPSL+20
SDWAFRM3 EQU   SDWADPSL+16
SDWATO2  EQU   SDWADPSL+12
SDWAFRM2 EQU   SDWADPSL+8
SDWATO1  EQU   SDWADPSL+4
SDWAFRM1 EQU   SDWADPSL
@NM00119 EQU   SDWADDAT+3
@NM00118 EQU   SDWAPDAT
SDWAUSPL EQU   SDWAPDAT
SDWADPSW EQU   SDWAPDAT
SDWATJPA EQU   SDWAPDAT
SDWATLPA EQU   SDWAPDAT
SDWADREG EQU   SDWAPDAT
SDWADSAH EQU   SDWAPDAT
SDWADSAS EQU   SDWAPDAT
@NM00117 EQU   SDWADDAT+1
@NM00116 EQU   SDWASDAT
SDWAQQS  EQU   SDWASDAT
SDWACBS  EQU   SDWASDAT
SDWAGTF  EQU   SDWASDAT
SDWASWA  EQU   SDWASDAT
SDWALSQA EQU   SDWASDAT
SDWASQA  EQU   SDWASDAT
SDWANUC  EQU   SDWASDAT
@NM00115 EQU   SDWADUMP+2
@NM00114 EQU   SDWADPFS
SDWASLST EQU   SDWADPFS
@NM00113 EQU   SDWADPFS
SDWADLST EQU   SDWADPFS
SDWADPT  EQU   SDWADPFS
SDWADPID EQU   SDWADUMP
SDWADPLA EQU   SDWA+316
SDWAREXN EQU   SDWARECP+16
SDWACSCT EQU   SDWARECP+8
SDWAMODN EQU   SDWARECP
@NM00112 EQU   SDWALKWA+32
SDWATALW EQU   SDWALKWS+28
SDWATDLW EQU   SDWALKWS+24
SDWATNLW EQU   SDWALKWS+20
SDWAAPLW EQU   SDWALKWS+16
SDWAIPLW EQU   SDWALKWS+12
SDWAILLW EQU   SDWALKWS+8
SDWAIULW EQU   SDWALKWS+4
SDWAICLW EQU   SDWALKWS
SDWAFLLK EQU   SDWAACF4
SDWACMS  EQU   SDWAACF4
SDWAOPTM EQU   SDWAACF4
SDWATADB EQU   SDWAACF4
SDWATDNB EQU   SDWAACF4
SDWATNCB EQU   SDWAACF4
SDWAILCH EQU   SDWAACF4
SDWAIUCB EQU   SDWAACF4
SDWAICAT EQU   SDWAACF3
SDWAIPRG EQU   SDWAACF3
SDWASALL EQU   SDWAACF3
SDWAASMP EQU   SDWAACF3
SDWADISP EQU   SDWAACF3
@NM00111 EQU   SDWAACF3
@NM00110 EQU   SDWAACF2
SDWAFREE EQU   SDWAACF2
@NM00109 EQU   SDWAACF2
SDWASPIN EQU   SDWAACF2
@NM00108 EQU   SDWAACF2
SDWALCPU EQU   SDWACPUA+2
@NM00107 EQU   SDWACPUA
SDWARECA EQU   SDWA+244
@NM00106 EQU   SDWA+239
@NM00105 EQU   SDWAIOFS
SDWANIOP EQU   SDWAIOFS
SDWANOIO EQU   SDWAIOFS
SDWAIOHT EQU   SDWAIOFS
SDWAIOQR EQU   SDWAIOFS
SDWAFMID EQU   SDWA+236
@NM00104 EQU   SDWAERRD
SDWAMCIV EQU   SDWAERRD
SDWARPIV EQU   SDWAERRD
SDWAMABD EQU   SDWAERRD
SDWACTS  EQU   SDWAERRD
SDWASTAE EQU   SDWAERRD
SDWANRBE EQU   SDWAERRD
SDWACLUP EQU   SDWAERRD
@NM00103 EQU   SDWAERRC
SDWAEAS  EQU   SDWAERRC
SDWAPERC EQU   SDWAERRC
SDWAIRB  EQU   SDWAERRC
SDWASTAI EQU   SDWAERRC
SDWASTAF EQU   SDWAERRC
SDWASRBM EQU   SDWAERRB
SDWALDIS EQU   SDWAERRB
SDWAENRB EQU   SDWAERRB
SDWATYP1 EQU   SDWAERRB
@NM00102 EQU   SDWAERRB
SDWAPGIO EQU   SDWAERRA
SDWATEXC EQU   SDWAERRA
SDWASVCE EQU   SDWAERRA
SDWAABTM EQU   SDWAERRA
SDWASVCD EQU   SDWAERRA
SDWARKEY EQU   SDWAERRA
SDWAPCHK EQU   SDWAERRA
SDWAMCHK EQU   SDWAERRA
SDWATIME EQU   SDWAMCH+20
SDWARFSA EQU   SDWAMCH+16
@NM00101 EQU   SDWAMCH+14
SDWAVEQR EQU   SDWARSR2
SDWAPGFX EQU   SDWARSR2
SDWAFLSQ EQU   SDWARSR2
SDWAFSQA EQU   SDWARSR2
SDWANUCL EQU   SDWARSR2
SDWASPER EQU   SDWARSR2
SDWAINTC EQU   SDWARSR2
SDWAOFLN EQU   SDWARSR2
SDWACHNG EQU   SDWARSR1
SDWAMSER EQU   SDWARSR1
@NM00100 EQU   SDWARSR1
SDWACPID EQU   SDWAMCH+10
SDWATERR EQU   SDWAMCHD
SDWAFPRX EQU   SDWAMCHD
SDWAINSF EQU   SDWAMCHD
SDWAACR  EQU   SDWAMCHD
SDWASCK  EQU   SDWAMCHD
SDWAPSWU EQU   SDWAMCHD
SDWAREGU EQU   SDWAMCHD
SDWASKYF EQU   SDWAMCHD
@NM00099 EQU   SDWAMCHS
SDWARSRF EQU   SDWAMCHS
SDWARSRC EQU   SDWAMCHS
SDWAINVP EQU   SDWAMCHS
SDWATSVL EQU   SDWAMCHS
SDWARCDF EQU   SDWAMCHS
SDWASRVL EQU   SDWAMCHS
SDWASCKE EQU   SDWASTCK+4
SDWASCKB EQU   SDWASTCK
SDWALNTH EQU   SDWAIDNT+1
SDWASPID EQU   SDWAIDNT
SDWASR15 EQU   SDWASRSV+60
SDWASR14 EQU   SDWASRSV+56
SDWASR13 EQU   SDWASRSV+52
SDWASR12 EQU   SDWASRSV+48
SDWASR11 EQU   SDWASRSV+44
SDWASR10 EQU   SDWASRSV+40
SDWASR09 EQU   SDWASRSV+36
SDWASR08 EQU   SDWASRSV+32
SDWASR07 EQU   SDWASRSV+28
SDWASR06 EQU   SDWASRSV+24
SDWASR05 EQU   SDWASRSV+20
SDWASR04 EQU   SDWASRSV+16
SDWASR03 EQU   SDWASRSV+12
SDWASR02 EQU   SDWASRSV+8
SDWASR01 EQU   SDWASRSV+4
SDWASR00 EQU   SDWASRSV
SDWATRN2 EQU   SDWAAEC2+4
SDWAIPC2 EQU   SDWAICD2
SDWAIMC2 EQU   SDWAICD2
SDWAIPR2 EQU   SDWAICD2
@NM00098 EQU   SDWAINC2
@NM00097 EQU   SDWAILC2
SDWAIL2  EQU   SDWAILC2
@NM00096 EQU   SDWAILC2
@NM00095 EQU   SDWAAEC2
SDWAADD2 EQU   SDWANXT2+1
@NM00094 EQU   SDWANXT2
@NM00093 EQU   SDWAEC2+3
SDWASGN2 EQU   SDWAINT2
SDWAEXP2 EQU   SDWAINT2
SDWADEC2 EQU   SDWAINT2
SDWAFPO2 EQU   SDWAINT2
SDWACC2  EQU   SDWAINT2
@NM00092 EQU   SDWAINT2
SDWAPGM2 EQU   SDWAMWP2
SDWAWAT2 EQU   SDWAMWP2
SDWAMCK2 EQU   SDWAMWP2
SDWAECT2 EQU   SDWAMWP2
SDWAKEY2 EQU   SDWAMWP2
SDWAEXT2 EQU   SDWAEMK2
SDWAIO2  EQU   SDWAEMK2
SDWATRM2 EQU   SDWAEMK2
@NM00091 EQU   SDWAEMK2
SDWAPER2 EQU   SDWAEMK2
@NM00090 EQU   SDWAEMK2
SDWATRAN EQU   SDWAAEC1+4
SDWAIPC1 EQU   SDWAICD1
SDWAIMC1 EQU   SDWAICD1
SDWAIPR1 EQU   SDWAICD1
@NM00089 EQU   SDWAINC1
@NM00088 EQU   SDWAILC1
SDWAIL1  EQU   SDWAILC1
@NM00087 EQU   SDWAILC1
@NM00086 EQU   SDWAAEC1
SDWAADD1 EQU   SDWANXT1+1
@NM00085 EQU   SDWANXT1
@NM00084 EQU   SDWAEC1+3
SDWASGN1 EQU   SDWAINT1
SDWAEXP1 EQU   SDWAINT1
SDWADEC1 EQU   SDWAINT1
SDWAFPO1 EQU   SDWAINT1
SDWACC1  EQU   SDWAINT1
@NM00083 EQU   SDWAINT1
SDWAPGM1 EQU   SDWAMWP1
SDWAWAT1 EQU   SDWAMWP1
SDWAMCK1 EQU   SDWAMWP1
SDWAECT1 EQU   SDWAMWP1
SDWAKEY1 EQU   SDWAMWP1
SDWAEXT1 EQU   SDWAEMK1
SDWAIO1  EQU   SDWAEMK1
SDWATRM1 EQU   SDWAEMK1
@NM00082 EQU   SDWAEMK1
SDWAPER1 EQU   SDWAEMK1
@NM00081 EQU   SDWAEMK1
SDWAIOBR EQU   SDWA+100
SDWAEPA  EQU   SDWA+96
@NM00080 EQU   SDWANAME+4
SDWARBAD EQU   SDWANAME
SDWAGR15 EQU   SDWAGRSV+60
SDWAGR14 EQU   SDWAGRSV+56
SDWAGR13 EQU   SDWAGRSV+52
SDWAGR12 EQU   SDWAGRSV+48
SDWAGR11 EQU   SDWAGRSV+44
SDWAGR10 EQU   SDWAGRSV+40
SDWAGR09 EQU   SDWAGRSV+36
SDWAGR08 EQU   SDWAGRSV+32
SDWAGR07 EQU   SDWAGRSV+28
SDWAGR06 EQU   SDWAGRSV+24
SDWAGR05 EQU   SDWAGRSV+20
SDWAGR04 EQU   SDWAGRSV+16
SDWAGR03 EQU   SDWAGRSV+12
SDWAGR02 EQU   SDWAGRSV+8
SDWAGR01 EQU   SDWAGRSV+4
SDWAGR00 EQU   SDWAGRSV
SDWANXTP EQU   SDWACTL2+5
SDWASGP  EQU   SDWAPMKP
SDWAEUP  EQU   SDWAPMKP
SDWADOP  EQU   SDWAPMKP
SDWAFPP  EQU   SDWAPMKP
SDWACCP  EQU   SDWAPMKP
SDWAILP  EQU   SDWAPMKP
SDWAINTP EQU   SDWACTL2+2
SDWASPVP EQU   SDWAMWPP
SDWAWATP EQU   SDWAMWPP
SDWAMCKP EQU   SDWAMWPP
@NM00079 EQU   SDWAMWPP
SDWAKEYP EQU   SDWAMWPP
SDWAEXTP EQU   SDWACMKP
SDWAIOP  EQU   SDWACMKP
SDWANXTA EQU   SDWACTL1+5
SDWASGA  EQU   SDWAPMKA
SDWAEUA  EQU   SDWAPMKA
SDWADOA  EQU   SDWAPMKA
SDWAFPA  EQU   SDWAPMKA
SDWACCA  EQU   SDWAPMKA
SDWAILA  EQU   SDWAPMKA
SDWAINTA EQU   SDWACTL1+2
SDWASPVA EQU   SDWAMWPA
SDWAWATA EQU   SDWAMWPA
SDWAMCKA EQU   SDWAMWPA
@NM00078 EQU   SDWAMWPA
SDWAKEYA EQU   SDWAMWPA
SDWAEXTA EQU   SDWACMKA
SDWAIOA  EQU   SDWACMKA
SDWACMPC EQU   SDWAABCC+1
@NM00077 EQU   SDWACMPF
SDWASTCC EQU   SDWACMPF
@NM00076 EQU   SDWACMPF
SDWASTEP EQU   SDWACMPF
SDWAREQ  EQU   SDWACMPF
SIRBEND  EQU   RBSECT+168
SVRBEND  EQU   RBSECT+168
RBRSV158 EQU   RBRSV150
RBRSV157 EQU   RBRSV150
RBRSV156 EQU   RBRSV150
RBRSV155 EQU   RBRSV150
RBRSV154 EQU   RBRSV150
RBRSV153 EQU   RBRSV150
RBRSV152 EQU   RBRSV150
RBRSV151 EQU   RBRSV150
RBRSV149 EQU   RBSECT+166
RBRSV148 EQU   RBSECT+164
RBSCBB   EQU   RBSECT+144
TIRBEND  EQU   @NM00074+8
PRBEND   EQU   @NM00074+8
RBRSV146 EQU   RBRSV138
RBRSV145 EQU   RBRSV138
RBRSV144 EQU   RBRSV138
RBRSV143 EQU   RBRSV138
RBRSV142 EQU   RBRSV138
RBRSV141 EQU   RBRSV138
RBRSV140 EQU   RBRSV138
RBRSV139 EQU   RBRSV138
RBRSV137 EQU   @NM00074+6
RBRSV136 EQU   @NM00074+4
RBRSV135 EQU   @NM00074
@NM00073 EQU   RBSECT+32
@NM00072 EQU   @NM00070+1
@NM00071 EQU   @NM00070
RBPGMQ1  EQU   RBPGMQ+1
@NM00069 EQU   RBPGMQ
@NM00068 EQU   RBSECT+16
@NM00067 EQU   @NM00063
@NM00066 EQU   @NM00063
RBIQETP  EQU   @NM00063
RBUSIQE  EQU   RBETXR
RBATTN   EQU   @NM00063
@NM00065 EQU   @NM00063
@NM00064 EQU   @NM00063
RBPMSVRB EQU   @NM00061
RBATNXIT EQU   @NM00061
@NM00062 EQU   @NM00061
RBWAITP  EQU   @NM00061
RBFNSVRB EQU   RBTRSVRB
RBFTP    EQU   @NM00061
RBSIZE   EQU   RBSECT+8
RBABOPSW EQU   RBSECT+4
RBPPSAV1 EQU   RBPPSAV+1
@NM00059 EQU   RBPPSAV
RBPRFXND EQU   RBPREFIX+64
RBINTCOD EQU   RBINTCDA+1
RBINLNTH EQU   RBINTCDA
RBWCSA   EQU   RBPREFIX+60
RBRSV004 EQU   RBPREFIX+57
RBSSSYN  EQU   RBFLAGS1
RBSCB    EQU   RBFLAGS1
RBLONGWT EQU   RBFLAGS1
RBASIR   EQU   RBFLAGS1
RBRSV159 EQU   RBFLAGS1
RBABEND  EQU   RBFLAGS1
RBXWAIT  EQU   RBFLAGS1
RBSLOCK  EQU   RBFLAGS1
RBRTRAN  EQU   RBRTPSW2+4
RBRTINCD EQU   RBRTICIL+2
RBRTILC  EQU   RBRTICIL+1
RBRSV160 EQU   RBRTICIL
RBRTPSW1 EQU   RBRTOPSW
RBRSV062 EQU   RBRSV054
RBRSV061 EQU   RBRSV054
RBRSV060 EQU   RBRSV054
RBRSV059 EQU   RBRSV054
RBRSV058 EQU   RBRSV054
RBRSV057 EQU   RBRSV054
RBRSV056 EQU   RBRSV054
RBRSV055 EQU   RBRSV054
RBRSV053 EQU   RBPREFIX+38
RBRSV052 EQU   RBPREFIX+36
RBRSV051 EQU   RBPREFIX+32
RBPRFXST EQU   RBPREFIX+32
RBRSV050 EQU   RBPREFIX+28
RBRSV049 EQU   RBRSV041
RBRSV048 EQU   RBRSV041
RBRSV047 EQU   RBRSV041
RBRSV046 EQU   RBRSV041
RBRSV045 EQU   RBRSV041
RBRSV044 EQU   RBRSV041
RBRSV043 EQU   RBRSV041
RBRSV042 EQU   RBRSV041
RBRSV040 EQU   RBPREFIX+26
RBRSV039 EQU   RBPREFIX+24
RBRSV038 EQU   RBPREFIX+20
RBRSV037 EQU   RBPREFIX+16
RBRSV036 EQU   RBRSV028
RBRSV035 EQU   RBRSV028
RBRSV034 EQU   RBRSV028
RBRSV033 EQU   RBRSV028
RBRSV032 EQU   RBRSV028
RBRSV031 EQU   RBRSV028
RBRSV030 EQU   RBRSV028
RBRSV029 EQU   RBRSV028
RBRSV027 EQU   RBRSV019
RBRSV026 EQU   RBRSV019
RBRSV025 EQU   RBRSV019
RBRSV024 EQU   RBRSV019
RBRSV023 EQU   RBRSV019
RBRSV022 EQU   RBRSV019
RBRSV021 EQU   RBRSV019
RBRSV020 EQU   RBRSV019
RBRSV018 EQU   RBPREFIX+13
RBRSV017 EQU   RBPREFIX+12
RBSRV016 EQU   RBPREFIX+11
RBRSV015 EQU   RBPREFIX+10
RBRSV014 EQU   RBPREFIX+8
RBRSV013 EQU   RBPREFIX+4
RBRSV012 EQU   RBPREFIX
IQEOUTLM EQU   IQESECT+20
IQEDCB   EQU   IQESECT+16
IQESTAT2 EQU   IQETCB
@NM00034 EQU   IQEFLAGS
@NM00033 EQU   IQEFLAGS
@NM00032 EQU   IQEFLAGS
@NM00031 EQU   IQEFLAGS
@NM00030 EQU   IQEFLAGS
@NM00029 EQU   IQEFLAGS
@NM00028 EQU   IQEFLAGS
IQEPURGE EQU   IQEFLAGS
IQELNKA  EQU   IQELNK+1
IQESTAT1 EQU   IQELNK
IOSEND   EQU   IOSB+108
IOSSKR   EQU   IOSEEKA+7
IOSSKH2  EQU   IOSSKHH+1
IOSSKH1  EQU   IOSSKHH
IOSSKCC  EQU   IOSCCHH
IOSSKBB  EQU   IOSEEKA+1
IOSSKM   EQU   IOSEEKA
IOSEEK   EQU   IOSB+92
IOSMDM   EQU   IOSB+91
IOSMDB   EQU   IOSB+90
IOSCKEY7 EQU   IOSCKEY
IOSCKEY6 EQU   IOSCKEY
IOSCKEY5 EQU   IOSCKEY
IOSCKEY4 EQU   IOSCKEY
@NM00024 EQU   IOSCKEY
IOSFMSK  EQU   IOSB+88
IOSCUDEV EQU   IOSPATH+1
@NM00023 EQU   IOSCHN
IOSPATH3 EQU   IOSCHN
IOSPATH2 EQU   IOSCHN
IOSEXP   EQU   IOSCHN
IOSGDP   EQU   IOSCHN
IOSAFF   EQU   IOSB+85
IOSRSS1B EQU   IOSB+84
IOSDSID  EQU   IOSB+80
IOSVST   EQU   IOSB+76
IOSRST   EQU   IOSB+72
IOSDIE   EQU   IOSB+68
IOSABN   EQU   IOSB+64
IOSNRM   EQU   IOSB+60
IOSPCI   EQU   IOSB+56
IOSERP   EQU   IOSB+52
IOSPCHN  EQU   IOSB+48
IOSSNS   EQU   IOSB+42
IOSAPMSK EQU   IOSB+40
IOSRES4A EQU   IOSB+36
IOSUSE   EQU   IOSB+32
IOSSRB   EQU   IOSB+28
IOSCSWRC EQU   IOSCSW+5
IOSTSB   EQU   IOSTATUS+1
IOSTSA   EQU   IOSTATUS
IOSCSWCA EQU   IOSCSW
IOSCC    EQU   @NM00022
IOSUCB   EQU   IOSB+16
IOSOPT2X EQU   IOSOPT2
IOSHTP   EQU   IOSOPT2
IOSRELSE EQU   IOSOPT
IOSAPR   EQU   IOSOPT
IOSTSLL  EQU   IOSOPT
IOSNERP  EQU   IOSOPT
IOSPSLL  EQU   IOSOPT
IOSQISCE EQU   IOSOPT
IOSDEP   EQU   IOSOPT
IOSBYP   EQU   IOSOPT
IOSCOD   EQU   IOSB+13
IOSPKY7  EQU   IOSPKEY
IOSPGDPX EQU   IOSPKEY
IOSIDR   EQU   IOSPKEY
IOSLCL   EQU   IOSPKEY
@NM00021 EQU   IOSPKEY
IOSPGAD  EQU   IOSB+8
IOSASID  EQU   IOSB+6
IOSPRLVL EQU   IOSB+5
IOSDVRID EQU   IOSB+4
IOSPROC  EQU   IOSB+3
IOSFLC7  EQU   IOSFLC
IOSFLC6  EQU   IOSFLC
IOSGLC5  EQU   IOSFLC
IOSFLC4  EQU   IOSFLC
IOSTP    EQU   IOSFLC
IOSCC3WE EQU   IOSFLC
IOSVERIF EQU   IOSDVALT
IOSDVMNT EQU   IOSFLC
IOSLOG   EQU   IOSFLB
IOSBDCST EQU   IOSFLB
IOSMSG   EQU   IOSFLB
IOSFLB4  EQU   IOSFLB
IOSFLB3  EQU   IOSFLB
IOSFLB2  EQU   IOSFLB
IOSFLB1  EQU   IOSFLB
IOSDIESE EQU   IOSFLB
IOSIOSB  EQU   IOSFLA
IOSDOM   EQU   IOSFLA
IOSSMDB  EQU   IOSFLA
IOSSMDA  EQU   IOSFLA
IOSCCHN  EQU   IOSACHN
IOSDCHN  EQU   IOSACHN
IOCOEND  EQU   IOCOM+128
IOCPATCH EQU   IOCOM+124
IOCUCBBM EQU   IOCOM+120
IOCQCNT  EQU   IOCOM+116
IOCIOSDQ EQU   IOCOM+112
IOCIOSEQ EQU   IOCOM+108
IOCTCCW  EQU   IOCOM+100
IOCRSVTB EQU   IOCOM+96
IOCMFCNT EQU   IOCOM+92
IOCMFHK  EQU   IOCOM+88
IOCGENA  EQU   IOCOM+84
IOCCCH   EQU   IOCOM+80
IOCASYNQ EQU   IOCOM+76
IOCLCHTB EQU   IOCOM+72
IOCATTBL EQU   IOCOM+68
IOCOMEX  EQU   IOCOM+64
IOCSYNCH EQU   IOCOM+56
IOCCATLK EQU   IOCOM+48
IOCPRGID EQU   IOCOM+44
IOCIOSCP EQU   IOCOM+40
IOCORMGT EQU   IOCOM+36
IOCVOID  EQU   IOCOM+32
IOCSTIO  EQU   IOCOM+28
@NM00020 EQU   IOCOM+24
@NM00019 EQU   IOCOM+20
IOCINT   EQU   IOCOM+16
IOCCTBL  EQU   IOCOM+12
IOCHIO   EQU   IOCOM+8
IOCPST   EQU   IOCOM+4
IOCPGCT  EQU   IOCOM+2
IOCVOICT EQU   IOCOM
@NM00018 EQU   FRRSFLGS+1
@NM00017 EQU   FRRSFLG1
FRRSRCUR EQU   FRRSFLG1
FRRSENTS EQU   FRRS+84
FRRSRTMW EQU   FRRS+16
DDRSSOB  EQU   DDRLONG+76
DDRUBCNT EQU   DDRLONG+72
@NM00016 EQU   DDRUSER+1
DDRUMODE EQU   DDRUSER
@NM00015 EQU   DDRREC2
DDRRFMTO EQU   DDRREC2
DDRREC1  EQU   DDRREC
DDRRETRY EQU   DDRLONG+65
DDRLNOP  EQU   DDRLABEL
@NM00014 EQU   DDRLABEL
DDRLSD   EQU   DDRLABEL
DDRLNSL  EQU   DDRLABEL
DDRLNL   EQU   DDRLABEL
DDRLBLP  EQU   DDRLABEL
DDRLAL   EQU   DDRLABEL
DDRMSGPC EQU   DDRMSGP+1
DDRMSGPN EQU   DDRMSGP
DDRMSGCD EQU   DDRMSG+1
DDRMSGOP EQU   DDRMSG
@NM00013 EQU   DDRIOF2
DDRICNT  EQU   DDRIOF2
DDRIMNT  EQU   DDRIOF2
DDRILAB  EQU   DDRIOF2
DDRITAKE EQU   DDRIOF2
DDRWHICH EQU   DDRIOF2
DDRIOF1  EQU   DDRIOF
DDRCOUNT EQU   DDRLONG+48
DDRIBUF  EQU   DDRLONG+44
DDRIBUFL EQU   DDRLONG+42
DDRAPP2  EQU   DDRAPP+1
DDRAPP1  EQU   DDRAPP
DDRINV2  EQU   DDRINV+1
DDRINV1  EQU   DDRINV
DDRTER2  EQU   DDRTER+1
DDRTER1  EQU   DDRTER
DDRTEST  EQU   DDRLONG+32
DDRUASCB EQU   DDRLONG+28
DDRUTCB  EQU   DDRLONG+24
DDRUIOB  EQU   DDRLONG+20
DDRUDEB  EQU   DDRMIHT+4
DDRUDCB  EQU   DDRMIHT
DDRASID  EQU   DDRLONG+10
DDRMIH   EQU   DDRLONG+9
DDRFIRST EQU   DDRROWN
DDRJES3L EQU   DDRROWN
@NM00012 EQU   DDRROWN
DDRRDENQ EQU   DDRROWN
DDRRUENQ EQU   DDRROWN
DDRRTENQ EQU   DDRROWN
DDRFMUCB EQU   DDRLONG+4
DDRTOUCB EQU   DDRLONG
DDRTOCUA EQU   DDRSHORT+21
DDRFMCUA EQU   DDRSHORT+18
DDRUASID EQU   DDRSHORT+16
@NM00011 EQU   DDRDSTAT
DDRUR    EQU   DDRDSTAT
DDRMT    EQU   DDRDSTAT
DDRDA    EQU   DDRDSTAT
DDRBUFL  EQU   DDRDSTAT
DDRMDR   EQU   DDRDCHAR
@NM00010 EQU   DDRSTAT
DDRSIRB  EQU   DDRSTAT
DDRRMV   EQU   DDRSTAT
DDRQUE   EQU   DDRSTAT
DDRACTV  EQU   DDRSTAT
@NM00009 EQU   DDRSRC
DDRPAGE  EQU   DDRSRC
DDRID    EQU   DDRSHORT
CVTLEVL  EQU   CVTRELNO+2
CVTNUMB  EQU   CVTRELNO
CVTMDL   EQU   CVTFIX+250
@NM00008 EQU   CVTFIX+248
@NM00007 EQU   CVTFIX
CVTRV482 EQU   CVTXTNT2+128
CVTRV481 EQU   CVTXTNT2+124
CVTRV480 EQU   CVTXTNT2+120
CVTRV479 EQU   CVTXTNT2+118
CVTRV478 EQU   CVTXTNT2+117
CVTRV477 EQU   CVTXTNT2+116
CVTRV476 EQU   CVTXTNT2+115
CVTRV475 EQU   CVTXTNT2+114
CVTRV474 EQU   CVTRV466
CVTRV473 EQU   CVTRV466
CVTRV472 EQU   CVTRV466
CVTRV471 EQU   CVTRV466
CVTRV470 EQU   CVTRV466
CVTRV469 EQU   CVTRV466
CVTRV468 EQU   CVTRV466
CVTRV467 EQU   CVTRV466
CVTRV465 EQU   CVTRV457
CVTRV464 EQU   CVTRV457
CVTRV463 EQU   CVTRV457
CVTRV462 EQU   CVTRV457
CVTRV461 EQU   CVTRV457
CVTRV460 EQU   CVTRV457
CVTRV459 EQU   CVTRV457
CVTRV458 EQU   CVTRV457
CVTRV456 EQU   CVTXTNT2+108
CVTRV455 EQU   CVTXTNT2+104
CVTRV454 EQU   CVTXTNT2+100
CVTRV453 EQU   CVTXTNT2+96
CVTRV452 EQU   CVTXTNT2+94
CVTRV451 EQU   CVTXTNT2+92
CVTRV450 EQU   CVTXTNT2+90
CVTRV449 EQU   CVTXTNT2+88
CVTRV448 EQU   CVTXTNT2+87
CVTRV447 EQU   CVTXTNT2+86
CVTRV446 EQU   CVTRV438
CVTRV445 EQU   CVTRV438
CVTRV444 EQU   CVTRV438
CVTRV443 EQU   CVTRV438
CVTRV442 EQU   CVTRV438
CVTRV441 EQU   CVTRV438
CVTRV440 EQU   CVTRV438
CVTRV439 EQU   CVTRV438
CVTRV437 EQU   CVTRV429
CVTRV436 EQU   CVTRV429
CVTRV435 EQU   CVTRV429
CVTRV434 EQU   CVTRV429
CVTRV433 EQU   CVTRV429
CVTRV432 EQU   CVTRV429
CVTRV431 EQU   CVTRV429
CVTRV430 EQU   CVTRV429
CVTRV428 EQU   CVTXTNT2+80
CVTRV427 EQU   CVTXTNT2+76
CVTRV426 EQU   CVTXTNT2+72
CVTRV425 EQU   CVTXTNT2+68
CVTATACT EQU   CVTATCVT
CVTRV423 EQU   CVTXTNT2+62
CVTRV422 EQU   CVTXTNT2+60
CVTRV421 EQU   CVTXTNT2+58
CVTRV420 EQU   CVTXTNT2+56
CVTRV419 EQU   CVTXTNT2+55
CVTRV418 EQU   CVTXTNT2+54
CVTRV417 EQU   CVTRV409
CVTRV416 EQU   CVTRV409
CVTRV415 EQU   CVTRV409
CVTRV414 EQU   CVTRV409
CVTRV413 EQU   CVTRV409
CVTRV412 EQU   CVTRV409
CVTRV411 EQU   CVTRV409
CVTRV410 EQU   CVTRV409
CVTRV408 EQU   CVTRV400
CVTRV407 EQU   CVTRV400
CVTRV406 EQU   CVTRV400
CVTRV405 EQU   CVTRV400
CVTRV404 EQU   CVTRV400
CVTRV403 EQU   CVTRV400
CVTRV402 EQU   CVTRV400
CVTRV401 EQU   CVTRV400
CVTICB   EQU   CVTXTNT2+48
CVTSKTA  EQU   CVTXTNT2+44
CVTRSV99 EQU   CVTXTNT2+40
CVTRSV98 EQU   CVTXTNT2+36
CVTRSV97 EQU   CVTXTNT2+34
CVTRSV96 EQU   CVTXTNT2+32
CVTOLTEP EQU   CVTXTNT2+28
CVTQIDA  EQU   CVTQID+1
CVTRSV95 EQU   CVTQID
CVTRSV94 EQU   CVTXTNT2+20
CVTRSV93 EQU   CVTXTNT2+16
CVTRSV92 EQU   CVTXTNT2+12
CVTDEBVR EQU   CVTXTNT2+8
CVTRSV91 EQU   CVTXTNT2+6
CVTRSV9H EQU   CVTFLGBT
CVTRSV9G EQU   CVTFLGBT
CVTRSV9F EQU   CVTFLGBT
CVTRSV9E EQU   CVTFLGBT
CVTRSV9D EQU   CVTFLGBT
CVTRSV9C EQU   CVTFLGBT
CVTVME   EQU   CVTFLGBT
CVTNPE   EQU   CVTFLGBT
CVTNUCLS EQU   CVTXTNT2+4
CVTDSSVA EQU   CVTDSSV+1
CVTRSV89 EQU   CVTDSSV
CVTRSV88 EQU   CVTXTNT1+8
CVTRSV87 EQU   CVTXTNT1+4
CVTFACHN EQU   CVTXTNT1
CVTRV488 EQU   CVTMAP+412
CVTRV487 EQU   CVTMAP+408
CVTRV486 EQU   CVTMAP+404
CVTRV485 EQU   CVTMAP+400
CVTACTAP EQU   CVTMAP+396
CVTAUTH  EQU   CVTMAP+392
CVTATMCA EQU   CVTATMCT+1
CVTATMST EQU   CVTATMCT
CVTRSV61 EQU   CVTMAP+384
CVTVOLT1 EQU   CVTVOLM1+1
CVTVOLI1 EQU   CVTVOLF1
CVTSTOA  EQU   CVTMAP+376
CVTRSV58 EQU   CVTMAP+374
CVTRSV57 EQU   CVTMAP+372
CVTDDCE  EQU   CVTMAP+368
CVTPNWFR EQU   CVTMAP+364
CVTSMF   EQU   CVTMAP+360
CVTSULK  EQU   CVTMAP+358
CVTSLKO  EQU   CVTSYSK
CVTSLKP  EQU   CVTSYSK
CVTSLKQ  EQU   CVTSYSK
CVTSLKR  EQU   CVTSYSK
CVTRSV56 EQU   CVTSYSK
CVTRSV55 EQU   CVTSYSK
CVTRSV54 EQU   CVTSYSK
CVTRSV53 EQU   CVTSYSK
CVTRSV52 EQU   CVTA1F1
CVTRSV51 EQU   CVTA1F1
CVTRSV50 EQU   CVTA1F1
CVTRSV49 EQU   CVTA1F1
CVTRSV48 EQU   CVTA1F1
CVTRSV47 EQU   CVTA1F1
CVTSRSW  EQU   CVTA1F1
CVTPFSW  EQU   CVTA1F1
CVTPCVT  EQU   CVTMAP+352
CVTRSV46 EQU   CVTMAP+344
CVTRSV45 EQU   CVTMAP+340
CVTRSV44 EQU   CVTMAP+338
CVTRSV43 EQU   CVTMAP+336
CVTHJESA EQU   CVTHJES+1
CVTRSV42 EQU   CVTHJES
CVTEXT2A EQU   CVTEXT2+1
CVTRSV41 EQU   CVTEXT2
CVTAPFA  EQU   CVTAPF+1
CVTRSV40 EQU   CVTAPF
CVTRV518 EQU   CVTINTLA
CVTRV517 EQU   CVTERPV
CVTEORM  EQU   CVTMAP+312
CVTMCHPR EQU   CVTMAP+308
CVTTZ    EQU   CVTMAP+304
CVTJEPS  EQU   CVTMAP+300
CVTJESCT EQU   CVTMAP+296
CVTMODE  EQU   CVTMAP+292
CVTPTRV  EQU   CVTMAP+288
CVTREAL  EQU   CVTMAP+284
CVTRSV39 EQU   CVTMAP+280
CVTRSV38 EQU   CVTMAP+276
CVTDMSRA EQU   CVTDMSR+1
CVTRSV37 EQU   CVTDMSR
CVTQMSGA EQU   CVTQMSG+1
CVTRSV36 EQU   CVTQMSG
CVTAMFF  EQU   CVTMAP+264
CVTPURGA EQU   CVTPURG+1
CVTRSV35 EQU   CVTPURG
CVTCBSP  EQU   CVTMAP+256
CVTATERA EQU   CVTATER+1
CVTSYST  EQU   CVTATER
CVTVOLT2 EQU   CVTTAT
CVTVOLI2 EQU   CVTVOLF2
CVTAQAVB EQU   CVTAQAVT+1
CVTRSV34 EQU   CVTTCMFG
CVTRSV33 EQU   CVTTCMFG
CVTRSV32 EQU   CVTTCMFG
CVTRSV31 EQU   CVTTCMFG
CVTRSV30 EQU   CVTTCMFG
CVTRSV29 EQU   CVTTCMFG
CVTRSV28 EQU   CVTTCMFG
CVTTCRDY EQU   CVTTCMFG
CVTGTFA  EQU   CVTGTF+1
CVTRSV27 EQU   CVTGTFST
CVTRNIO  EQU   CVTGTFST
CVTUSR   EQU   CVTGTFST
CVTRV318 EQU   CVTFORM
CVTRV317 EQU   CVTTMODE
CVTRV316 EQU   CVTSTATE
CVTRV315 EQU   CVTGTFS
CVTGTFAV EQU   CVTGTFS
CVT0SCR1 EQU   CVTMAP+232
CVTRV515 EQU   CVTMAP+228
CVTRMS   EQU   CVTMAP+224
CVTPATCH EQU   CVTMAP+220
CVTTSCE  EQU   CVTMAP+216
CVTLNKSC EQU   CVTMAP+214
CVTQABST EQU   CVTMAP+212
CVTMDLDS EQU   CVTMAP+208
CVTUSER  EQU   CVTMAP+204
CVTABEND EQU   CVTMAP+200
CVTSMCA  EQU   CVTMAP+196
CVTRSV18 EQU   CVTMAP+192
CVTQLPAQ EQU   CVTMAP+188
CVTQCDSR EQU   CVTMAP+184
CVTRSV17 EQU   CVTOPTB
CVTRSV16 EQU   CVTOPTB
CVTFP    EQU   CVTOPTB
CVTAPTHR EQU   CVTOPTB
CVTNLOG  EQU   CVTOPTB
CVTTOD   EQU   CVTOPTB
CVTCTIMS EQU   CVTOPTB
CVTPROT  EQU   CVTOPTB
CVTXPFP  EQU   CVTOPTA
CVTASCII EQU   CVTOPTA
CVTRSV13 EQU   CVTOPTA
CVTRSV12 EQU   CVTOPTA
CVTNIP   EQU   CVTOPTA
CVTDDR   EQU   CVTOPTA
CVTAPR   EQU   CVTOPTA
CVTCCH   EQU   CVTOPTA
CVTSNCTR EQU   CVTMAP+180
CVTQMWR  EQU   CVTMAP+176
CVTQOCR  EQU   CVTMAP+172
CVT1EF00 EQU   CVTMAP+168
CVTMZ00  EQU   CVTMAP+164
CVTHEAD  EQU   CVTMAP+160
CVTRSV11 EQU   CVTMAP+156
CVT0PT01 EQU   CVTMAP+152
CVTMSER  EQU   CVTMAP+148
CVTRV516 EQU   CVTIERLC
CVTILCH  EQU   CVTMAP+140
CVT0DS   EQU   CVTMAP+136
CVTFBOSV EQU   CVTMAP+132
CVTNUCB  EQU   CVTMAP+128
CVTIOQET EQU   CVTMAP+120
CVTDCBA  EQU   CVTMAP+117
CVTMVS2  EQU   CVTDCB
CVT6DAT  EQU   CVTDCB
CVT4MPS  EQU   CVTDCB
CVTRSV09 EQU   CVTDCB
CVT4MS1  EQU   CVTDCB
CVT2SPS  EQU   CVTDCB
CVT1SSS  EQU   CVTDCB
CVTRSV08 EQU   CVTDCB
CVTSTB   EQU   CVTMAP+112
CVTQTD00 EQU   CVTMAP+108
CVTQTE00 EQU   CVTMAP+104
CVTCUCB  EQU   CVTMAP+100
CVTSJQ   EQU   CVTMAP+96
CVTPBLDL EQU   CVTMAP+92
CVTTPC   EQU   CVTMAP+88
CVTSVDCB EQU   CVTMAP+84
CVTBRET  EQU   CVTMAP+82
CVTEXIT  EQU   CVTMAP+80
CVT0FN00 EQU   CVTMAP+76
CVTDARA  EQU   CVTDAR+1
CVTRSV07 EQU   CVTFLGS1
CVTRSV06 EQU   CVTFLGS1
CVTRSV05 EQU   CVTFLGS1
CVTRSV04 EQU   CVTFLGS1
CVTRSV03 EQU   CVTFLGS1
CVTRSV02 EQU   CVTFLGS1
CVTRSV01 EQU   CVTFLGS1
CVTDMPLK EQU   CVTFLGS1
CVTXITP  EQU   CVTMAP+68
CVTZDTAB EQU   CVTMAP+64
CVTMSLT  EQU   CVTMAP+60
CVTDATE  EQU   CVTMAP+56
CVTBTERM EQU   CVTMAP+52
CVTSYSAD EQU   CVTMAP+48
CVTXTLER EQU   CVTMAP+44
CVTILK2  EQU   CVTMAP+40
CVTILK1  EQU   CVTMAP+36
CVTPRLTV EQU   CVTMAP+32
CVTPCNVT EQU   CVTMAP+28
CVT0VL00 EQU   CVTMAP+24
CVTXAPG  EQU   CVTMAP+20
CVTBUF   EQU   CVTMAP+16
CVTJOB   EQU   CVTMAP+12
CVTLINK  EQU   CVTMAP+8
CVT      EQU   CVTMAP
ASXBEND  EQU   ASXB+232
ASXBRV25 EQU   ASXB+228
ASXBRV24 EQU   ASXB+224
ASXBRV23 EQU   ASXB+220
ASXBRV22 EQU   ASXB+216
ASXBRV21 EQU   ASXB+212
ASXBRV20 EQU   ASXB+208
ASXBRV19 EQU   ASXB+204
ASXBRV18 EQU   ASXB+200
ASXBRV17 EQU   ASXB+196
ASXBRV16 EQU   ASXB+192
ASXBLSRB EQU   ASXBAEQ+20
ASXBFSRB EQU   ASXBAEQ+16
ASXBLRQE EQU   ASXBAEQ+12
ASXBFRQE EQU   ASXBAEQ+8
ASXBLIQE EQU   ASXBAEQ+4
ASXBFIQE EQU   ASXBAEQ
ASXBETSK EQU   ASXB+164
ASXBSIRB EQU   ASXB+160
ASXBPSWD EQU   ASXB+152
ASXBPRG  EQU   ASXB+136
ASXBRV26 EQU   ASXB+132
ASXBOUSB EQU   ASXB+128
ASXBRCTD EQU   ASXB+120
ASXBRSMD EQU   ASXB+116
ASXBSPSA EQU   ASXB+112
ASXBFRWA EQU   ASXB+108
ASXBFLSA EQU   ASXB+36
ASXBIHSA EQU   ASXB+32
ASXBRV15 EQU   ASXB+28
ASXBRV14 EQU   ASXB+24
ASXBLWA  EQU   ASXB+20
ASXBMPST EQU   ASXB+16
ASXBRS00 EQU   ASXB+14
ASXBTCBS EQU   ASXB+12
ASXBLTCB EQU   ASXB+8
ASXBASXB EQU   ASXB
ASXBEGIN EQU   ASXB
ASCBEND  EQU   ASCB+208
ASCBSRBT EQU   ASCB+200
ASCBSWTL EQU   ASCB+196
ASCBRS14 EQU   ASCB+195
ASCBSMCT EQU   ASCB+194
ASCBRS12 EQU   ASCB+192
ASCBPCTT EQU   ASCB+188
ASCBVGTT EQU   ASCB+184
ASCBLGCB EQU   ASCB+180
ASCBJBNS EQU   ASCB+176
ASCBJBNI EQU   ASCB+172
ASCBMCC  EQU   ASCB+168
ASCBRTWA EQU   ASCB+164
ASCBIQEA EQU   ASCB+160
ASCBXMPQ EQU   ASCB+156
ASCBRS01 EQU   ASCB+154
ASCBFMCT EQU   ASCB+152
ASCBOUXB EQU   ASCB+148
ASCBOUCB EQU   ASCB+144
ASCBMECB EQU   ASCB+140
ASCBQECB EQU   ASCB+136
ASCBCMSB EQU   ASCB+132
ASCBCMSF EQU   ASCB+128
ASCBTCBS EQU   ASCB+124
ASCBNVSC EQU   ASCB+122
ASCBVSC  EQU   ASCB+120
ASCBSRBS EQU   ASCB+118
ASCBSSRB EQU   ASCB+116
ASCBRV06 EQU   ASCBFLG2
ASCBRV05 EQU   ASCBFLG2
ASCBRV04 EQU   ASCBFLG2
ASCBSNQS EQU   ASCBFLG2
ASCBS2S  EQU   ASCBFLG2
ASCBCEXT EQU   ASCBFLG2
ASCBPXMT EQU   ASCBFLG2
ASCBXMPT EQU   ASCBFLG2
ASCBRF07 EQU   ASCBDSP1
ASCBRF06 EQU   ASCBDSP1
ASCBRF05 EQU   ASCBDSP1
ASCBRF04 EQU   ASCBDSP1
ASCBRF03 EQU   ASCBDSP1
ASCBRF02 EQU   ASCBDSP1
ASCBFAIL EQU   ASCBDSP1
ASCBNOQ  EQU   ASCBDSP1
ASCBSWCT EQU   ASCB+112
ASCBTMCH EQU   ASCB+104
ASCBNSWP EQU   ASCBFLG1
ASCBTYP1 EQU   ASCBFLG1
ASCBSTND EQU   ASCBFLG1
ASCBABNT EQU   ASCBFLG1
ASCBTERM EQU   ASCBFLG1
ASCBS3S  EQU   ASCBFLG1
ASCBCMSH EQU   ASCBFLG1
ASCBTOFF EQU   ASCBFLG1
ASCBRF01 EQU   ASCBRCTF
ASCBTMLW EQU   ASCBRCTF
ASCBOUT  EQU   ASCBRCTF
ASCBWAIT EQU   ASCBRCTF
ASCBRV08 EQU   ASCBRCTF
ASCBFQU  EQU   ASCBRCTF
ASCBFRS  EQU   ASCBRCTF
ASCBTMNO EQU   ASCBRCTF
ASCBAFFN EQU   ASCBFW1
ASCBDUMP EQU   ASCB+96
ASCBQSVC EQU   ASCB+92
ASCBUBET EQU   ASCB+88
ASCBECB  EQU   ASCB+84
ASCBJSTL EQU   ASCB+80
ASCBEWST EQU   ASCB+72
ASCBEJST EQU   ASCB+64
ASCBTSB  EQU   ASCB+60
ASCBCSCB EQU   ASCB+56
ASCBRSM  EQU   ASCB+52
ASCBLDA  EQU   ASCB+48
ASCBSTOR EQU   ASCB+44
ASCBDP   EQU   ASCB+43
ASCBRV07 EQU   ASCB+42
ASCBIOSM EQU   ASCB+40
ASCBSEQN EQU   ASCB+38
ASCBCPUS EQU   ASCB+32
ASCBSPL  EQU   ASCB+28
ASCBLSLQ EQU   ASCB+24
ASCBFSLQ EQU   ASCB+20
ASCBIOSP EQU   ASCB+16
ASCBLOCK EQU   ASCB+12
ASCBBWDP EQU   ASCB+8
ASCBFWDP EQU   ASCB+4
ASCBASCB EQU   ASCB
ASCBEGIN EQU   ASCB
@NM00006 EQU   @NM00003+8
@NM00005 EQU   @NM00003+4
@NM00004 EQU   @NM00003
@NM00002 EQU   DS0STAT+1
@NM00001 EQU   DS0STAT1
@NM00058 EQU   PSA+3668
PSASTAK  EQU   PSA+3072
@NM00057 EQU   PSA+1040
PSAUSEND EQU   PSA+1040
PSARV062 EQU   PSA+1036
PSAATCVT EQU   PSA+1032
PSAPCPSW EQU   PSA+1024
PSAPIR2  EQU   PSA+1020
PSARV059 EQU   PSA+1018
PSASVC13 EQU   PSA+1016
PSASFACC EQU   PSA+1008
PSASTOP  EQU   PSA+992
PSASTART EQU   PSA+976
PSARSPSW EQU   PSA+968
PSASRPSW EQU   PSA+960
PSARV045 EQU   PSA+892
PSARV044 EQU   PSA+888
PSARV043 EQU   PSA+884
PSARV042 EQU   PSA+880
PSARV041 EQU   PSA+876
PSARV040 EQU   PSA+872
PSARV025 EQU   PSA+868
PSADSSED EQU   PSA+868
PSADSSPR EQU   PSA+864
PSADSSFW EQU   PSA+860
PSADSS14 EQU   PSA+856
PSADSSPP EQU   PSA+848
PSADSSRP EQU   PSA+840
PSADSS05 EQU   PSADSSF4
PSADSS10 EQU   PSADSSF4
PSADSSVE EQU   PSADSSF4
PSADSSDE EQU   PSADSSF4
PSADSSC0 EQU   PSADSSF4
PSADSSIE EQU   PSADSSF4
PSADSS12 EQU   PSADSSF4
PSADSSRC EQU   PSADSSF4
PSARV057 EQU   PSADSSF3
PSARV056 EQU   PSADSSF3
PSARV055 EQU   PSADSSF3
PSADSSMC EQU   PSADSSF3
PSADSSRW EQU   PSADSSF3
PSADSSNM EQU   PSADSSF3
PSADSSES EQU   PSADSSF3
PSADSSGP EQU   PSADSSF3
PSADSSF2 EQU   PSADSSFL+1
PSADSSPI EQU   PSADSSF1
PSADSSOI EQU   PSADSSF1
PSADSSSP EQU   PSADSSF1
PSADSSTP EQU   PSADSSF1
PSADSSDW EQU   PSADSSF1
PSADSSDD EQU   PSADSSF1
PSADSSDM EQU   PSADSSF1
PSADSSMV EQU   PSADSSF1
PSADSSTS EQU   PSA+816
PSADSSWK EQU   PSA+812
PSADSSR3 EQU   PSA+808
PSADSSR2 EQU   PSA+804
PSADSSRS EQU   PSA+800
PSASTOR  EQU   PSA+796
PSACPUSA EQU   PSA+794
PSAVSTAP EQU   PSA+792
PSAWKVAP EQU   PSA+788
PSAWKRAP EQU   PSA+784
PSAMCHIC EQU   PSA+783
PSARV061 EQU   PSA+782
PSASYMSK EQU   PSA+781
PSAMCHFL EQU   PSA+780
PSACR0   EQU   PSA+776
PSAPSWSV EQU   PSA+768
PSACLHS  EQU   PSAHLHI
PSALKR15 EQU   PSALKSA+60
PSALKR14 EQU   PSALKSA+56
PSALKR13 EQU   PSALKSA+52
PSALKR12 EQU   PSALKSA+48
PSALKR11 EQU   PSALKSA+44
PSALKR10 EQU   PSALKSA+40
PSALKR9  EQU   PSALKSA+36
PSALKR8  EQU   PSALKSA+32
PSALKR7  EQU   PSALKSA+28
PSALKR6  EQU   PSALKSA+24
PSALKR5  EQU   PSALKSA+20
PSALKR4  EQU   PSALKSA+16
PSALKR3  EQU   PSALKSA+12
PSALKR2  EQU   PSALKSA+8
PSALKR1  EQU   PSALKSA+4
PSALKR0  EQU   PSALKSA
PSARV023 EQU   PSACLHT+52
PSALOCAL EQU   PSACLHT+48
PSACMSL  EQU   PSACLHT+44
PSAOPTL  EQU   PSACLHT+40
PSATPACL EQU   PSACLHT+36
PSATPDNL EQU   PSACLHT+32
PSATPNCL EQU   PSACLHT+28
PSAIOSLL EQU   PSACLHT+24
PSAIOSUL EQU   PSACLHT+20
PSAIOSCL EQU   PSACLHT+16
PSAIOSSL EQU   PSACLHT+12
PSASALCL EQU   PSACLHT+8
PSAASML  EQU   PSACLHT+4
PSADISPL EQU   PSACLHT
PSASRSA  EQU   PSA+636
PSARV050 EQU   PSA+634
PSADSSGO EQU   PSA+633
PSARECUR EQU   PSA+632
PSAHLHIS EQU   PSA+628
PSAIPCSA EQU   PSA+624
@NM00056 EQU   PSA+621
PSAIPCDM EQU   PSA+620
PSAIPCD  EQU   PSA+616
@NM00055 EQU   PSA+613
PSAIPCRM EQU   PSA+612
PSAIPCR  EQU   PSA+608
PSAMCHEX EQU   PSA+600
PSAMPSW  EQU   PSA+592
PSAEXPS2 EQU   PSA+584
PSAEXPS1 EQU   PSA+576
PSAPIREG EQU   PSA+572
PSARSREG EQU   PSA+568
PSAGPREG EQU   PSA+556
PSARV022 EQU   PSASUP4
PSARV021 EQU   PSASUP4
PSARV020 EQU   PSASUP4
PSARV019 EQU   PSASUP4
PSARV018 EQU   PSASUP4
PSARV017 EQU   PSASUP4
PSARV016 EQU   PSASUP4
PSARV015 EQU   PSASUP4
PSARV014 EQU   PSASUP3
PSARV013 EQU   PSASUP3
PSARV012 EQU   PSASUP3
PSARV011 EQU   PSASUP3
PSARV010 EQU   PSASUP3
PSAPSREG EQU   PSASUP3
PSAPI2   EQU   PSASUP3
PSAIOSUP EQU   PSASUP3
PSALCR   EQU   PSASUP2
PSARTM   EQU   PSASUP2
PSAACR   EQU   PSASUP2
PSAIPCE2 EQU   PSASUP2
PSAIPCES EQU   PSASUP2
PSAIPCEC EQU   PSASUP2
PSAGTF   EQU   PSASUP2
PSAIPCRI EQU   PSASUP2
PSAIPCRP EQU   PSASUP1
PSAIPCDR EQU   PSASUP1
PSADISP  EQU   PSASUP1
PSALOCK  EQU   PSASUP1
PSAPI    EQU   PSASUP1
PSAEXT   EQU   PSASUP1
PSASVC   EQU   PSASUP1
PSAIO    EQU   PSASUP1
PSAAOLD  EQU   PSA+548
PSAANEW  EQU   PSA+544
PSATOLD  EQU   PSA+540
PSATNEW  EQU   PSA+536
PSALCCAR EQU   PSA+532
PSALCCAV EQU   PSA+528
PSAPCCAR EQU   PSA+524
PSAPCCAV EQU   PSA+520
PSACPULA EQU   PSA+518
PSACPUPA EQU   PSA+516
PSAPSA   EQU   PSA+512
FLCHDEND EQU   PSA+512
FLCCRSAV EQU   FLCMCLA+280
FLCGRSAV EQU   FLCMCLA+216
FLCFPSAV EQU   FLCMCLA+184
FLCFLA   EQU   FLCMCLA+88
FLCRGNCD EQU   FLCMCLA+84
FLCFSAA  EQU   FLCFSA+1
@NM00054 EQU   FLCFSA
@NM00053 EQU   FLCMCLA+72
FLCMCIC  EQU   FLCMCLA+64
@NM00052 EQU   FLCMCLA+20
FLCIOAA  EQU   FLCIOA+1
@NM00051 EQU   FLCIOA
@NM00050 EQU   FLCMCLA+15
@NM00049 EQU   FLCMCLA+14
@NM00048 EQU   FLCMCLA+12
FLCLCL   EQU   FLCMCLA+8
FLCIOELA EQU   FLCIOEL+1
@NM00047 EQU   FLCIOEL
FLCCHNID EQU   FLCMCLA
@NM00046 EQU   PSA+160
FLCMTRCD EQU   PSA+157
@NM00045 EQU   PSA+156
FLCPERA  EQU   FLCPER+1
@NM00044 EQU   FLCPER
@NM00043 EQU   PSA+151
FLCPERCD EQU   PSA+150
FLCMCNUM EQU   PSA+149
@NM00042 EQU   PSA+148
FLCTEAA  EQU   FLCTEA+1
@NM00041 EQU   FLCTEA
PSAPIPC  EQU   PSAPICOD
PSAPIMC  EQU   PSAPICOD
PSAPIPER EQU   PSAPICOD
PSARV049 EQU   FLCPICOD
FLCPILCB EQU   FLCPIILC
@NM00040 EQU   FLCPIILC
@NM00039 EQU   PSAEPPSW
FLCSVCN  EQU   PSAESPSW+2
FLCSILCB EQU   FLCSVILC
@NM00038 EQU   FLCSVILC
@NM00037 EQU   PSAESPSW
FLCEICOD EQU   PSAEEPSW+2
PSASPAD  EQU   PSAEEPSW
@NM00036 EQU   PSA+128
FLCINPSW EQU   PSA+120
FLCMNPSW EQU   PSA+112
FLCPNPSW EQU   PSA+104
FLCSNPSW EQU   PSA+96
FLCENPSW EQU   PSA+88
FLCTRACE EQU   PSA+84
FLCTIMER EQU   PSA+80
FLCCVT2  EQU   PSA+76
FLCCAW   EQU   PSA+72
FLCCSW   EQU   PSA+64
FLCIOPSW EQU   PSA+56
FLCMOPSW EQU   PSA+48
FLCPOPSW EQU   PSA+40
FLCSOPSW EQU   PSA+32
FLCEOPSW EQU   PSA+24
@NM00035 EQU   FLCICCW2+4
FLCICCW1 EQU   FLCROPSW
FLCIPPSW EQU   FLCRNPSW
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS
@ENDDATA EQU   *
         END   IGFDS0,(C'PLS0336',0701,76161)
