         MACRO
&NAME    JCALL &ROUTINE,&BASE=YES
.*
.*        GENERATES A BRANCH AND LINK TO A SUBROUTINE.
.*
         AIF   ('&BASE' EQ 'YES').BASEYES
         AIF   ('&BASE' EQ 'NO').BASENO
         MNOTE 8,'INVALID PARAMETER'
         MEXIT
.BASEYES ANOP
&NAME    L     R12,=A(&ROUTINE)
         BALR  R9,R12
         MEXIT
.BASENO  ANOP
&NAME    BAL   R9,&ROUTINE
         MEND
