         MACRO
&NAME    JINPUT
.*       GENERATES A CALL TO THE INPUT I/O MODULE TO GET THE NEXT
.*       RECORD FROM THE INPUT FILE.
&NAME    L     R12,JINMLC               LOAD BASE
         BAL   R9,JINPUT(,R12)          GO TO JINPUT
         MEND
