         TITLE 'ISTZIFOB/AOB-VS1/MOB-VS2 - CONTACT/DISCONNECT PROCESSOR*
               R        '
ISTZIFOB CSECT ,                                                   0001
@MAINENT DS    0H                                                  0001
         USING *,@15                                               0001
         B     @PROLOG                                             0001
         DC    AL1(16)                                             0001
         DC    C'ISTZIFOB  77.349'                                 0001
         DROP  @15
@PROLOG  DS    0H                                                  0002
*                                                                  0413
*/* TPZSAVE (7,12,14) AC(ICOB)BASE                                   */
*                                                                  0413
*   DO;                                                            0413
*     RFY                                                          0414
*      (GPR01P,                                                    0414
*       GPR12P,                                                    0414
*       GPR13P,                                                    0414
*       GPR14P) RSTD;                                              0414
*     GEN(PRINT OFF);                                              0415
*                                                                  0415
         PRINT OFF
*/* ATBUILD (ISTZSAVE)                                               */
*/* END OF ATBUILD                                                   */
*                                                                  0416
*     GEN(PRINT ON);                                               0416
         PRINT ON
*     RFY                                                          0417
*       ISTZSAVE BASED(GPR13P);                                    0417
*     GEN SETS(ZSAZSVVR)(STM   7,12,ZSAZSVVR+0(13));               0418
         STM   7,12,ZSAZSVVR+0(13)
*     GEN SETS(GPR12P);                                            0419
         BALR  GPR12P,0
@TSTART  DS    0H
         USING @TSTART,GPR12P
*     GEN(PRINT OFF);                                              0420
*                                                                  0420
         PRINT OFF
*/* ATBUILD (ISTZCRR,ISTRPH,ISTCRA) EJECT(NO)                        */
*/* END OF ATBUILD                                                   */
*                                                                  0421
*     GEN(PRINT ON);                                               0421
         PRINT ON
*     GPR01P->RPHCRR->CRACRR->ZCREICOB='1'B;                       0422
         L     @11,RPHCRR(,GPR01P)                                 0422
         L     @11,CRACRR(,@11)                                    0422
         OI    ZCREICOB(@11),B'00000001'                           0422
*     ZSAZACTV='1'B;                                               0423
         OI    ZSAZACTV(GPR13P),B'10000000'                        0423
*     ZSAZTRAC='ICOB';                                             0424
         MVC   ZSAZTRAC(4,GPR13P),@CC03704                         0424
*     ZSAZSVRR=GPR14P;                                             0425
         ST    GPR14P,ZSAZSVRR(,GPR13P)                            0425
*     GPR13P=ZSAZSVFC;                                             0426
         L     GPR13P,ZSAZSVFC(,GPR13P)                            0426
*     RFY                                                          0427
*      (GPR01P) UNRSTD;                                            0427
*     RFY                                                          0428
*      (GPR14P) UNRSTD;                                            0428
*   END;                                                           0429
*                                                                  0429
*/* END TPZSAVE                                                      */
*                                                                  0430
*   IF ELEMREG=0 THEN               /* IF NO LSCB/LCPB ON WAIT Q     */
         LTR   ELEMREG,ELEMREG                                     0430
         BNZ   @RF00430                                            0430
*     DO;                                                          0431
*       CALL ISTZIFIB;              /* CALL LOGIC ERR ROUTINE        */
         SLR   @14,@14                                             0432
         ICM   @14,7,PABDVTA+112(FMCBREG)                          0432
         L     @15,ZRCZIFIB(,@14)                                  0432
         BALR  @14,@15                                             0432
*       RCDREG=ZCRSRCHQ;            /* RETURN CODE=PROCESSING IS   0433
*                                      COMPLETE FOR THIS LSCB/LCPB   */
         LA    RCDREG,16                                           0433
*     END;                                                         0434
*   ELSE                            /* LSCB/LCPB ON WAIT Q           */
*     DO;                                                          0435
         B     @RC00430                                            0435
@RF00430 DS    0H                                                  0436
*       FSBPTR=ADDR(ZIBFSB);        /* GET ZIB FSB PTR IN FSBREG     */
         LA    FSBPTR,ZIBFSB(,BFRREG)                              0436
*       CALL NCPSTS;                /* GO ANALYZE NETWORK STATUS     */
         BAL   @14,NCPSTS                                          0437
*       IF RCDREG=0 THEN            /* IF POSTING IS NECESSARY       */
         LTR   RCDREG,RCDREG                                       0438
         BNZ   @RF00438                                            0438
*         DO;                                                      0439
*           CALL TPOST;             /* GO Q FSB TO CONTROL LAYER   0440
*                                      FEEDBACK PAB                  */
         BAL   @14,TPOST                                           0440
*           CALL HOUSKP;            /* GO CLEAN UP                   */
         BAL   @14,HOUSKP                                          0441
*           CALL XITCODE;           /* SET FINAL RETCODE     @XL03HEK*/
         BAL   @14,XITCODE                                         0442
*         END;                                                     0443
*       ELSE                        /* NO POSTING NECESS     @XL03HEK*/
*         IF RCDREG=8 THEN          /* HOUSKPG NEEDED?       @XL03HEK*/
         B     @RC00438                                            0444
@RF00438 CH    RCDREG,@CH00058                                     0444
         BNE   @RF00444                                            0444
*           DO;                     /* YES,                  @XL03HEK*/
*             CALL HOUSKP;          /* DO CLEAN UP           @XL03HEK*/
         BAL   @14,HOUSKP                                          0446
*             CALL XITCODE;         /* SET FINAL RETCODE     @XL03HEK*/
         BAL   @14,XITCODE                                         0447
*           END;                    /*                       @XL03HEK*/
*         ELSE                      /* NO HOUSKPG NEEDED     @XL03HEK*/
*           IF RCDREG=4 THEN        /* RETURN CODE SET YE@XL03HEK    */
         B     @RC00444                                            0449
@RF00444 CH    RCDREG,@CH00052                                     0449
         BNE   @RF00449                                            0449
*             CALL XITCODE;         /* NO, SET RETCODE       @XL03HEK*/
         BAL   @14,XITCODE                                         0450
*           ELSE                                                   0451
*             ;                     /* YES, (NULL)           @XL03HEK*/
@RF00449 DS    0H                                                  0452
*     END;                          /* END LSCB/LCPB ON WAIT Q       */
@RC00444 DS    0H                                                  0452
@RC00438 DS    0H                                                  0453
*/* TPZRETN                                                          */
*                                                                  0453
*   DO;                                                            0453
@RC00430 DS    0H                                                  0454
*     RFY                                                          0454
*      (GPR07P,                                                    0454
*       GPR14P,                                                    0454
*       GPR15P) RSTD;                                              0454
*     GPR13P=ZSAZSVBC;                                             0455
         L     GPR13P,ZSAZSVBC(,GPR13P)                            0455
*     IF GPR13P=0 THEN                                             0456
         LTR   GPR13P,GPR13P                                       0456
         BZ    @RT00456                                            0456
*       ;                           /* TPDVTS ISTZFARR               */
*     ELSE                                                         0458
*       GPR14P=ZSAZSVRR;                                           0458
         L     GPR14P,ZSAZSVRR(,GPR13P)                            0458
*     GEN REFS(ZSAZSVVR)(LM    7,12,ZSAZSVVR+0(13));               0459
@RT00456 DS    0H                                                  0459
         LM    7,12,ZSAZSVVR+0(13)
*     GEN REFS(GPR14P) EXIT NOSEQFLOW(BR    GPR14P);               0460
         BR    GPR14P
*     RFY                                                          0461
*      (GPR07P,                                                    0461
*       GPR14P,                                                    0461
*       GPR15P) UNRSTD;                                            0461
*   END;                                                           0462
*                                                                  0462
*/* END TPZRETN                                                      */
*                                                                  0463
*                                                                  0463
*/*    NCPSTS IS CALLED BY THE MAINLINE TO ANALYZE THE STATUS OF     */
*/* FEEDBACK. THE NCP IS CONSIDERED COMPLETE IF A PHASE 3 RESPONSE   */
*/* HAS BEEN RECEIVED OR IF AN ERROR OCCURED. ON A NORMAL COMPLETION */
*/* THE SUBROUTINE RETURNS TO THE MAINLINE WITH REGISTER 15 SET TO   */
*/* ZERO. OTHERWISE EITHER THE LOGIC ERROR PROCESSOR,THE OUTPUT      */
*/* ERROR ANALYSIS MODULE OR THE INPUTERR SUBROUTINE IS CALLED TO    */
*/* PROCESS THE ERROR. REGISTER 15 IS SET TO FOUR.                   */
*/*                                                                  */
*/*                                                                  */
*                                                                  0463
*NCPSTS:                                                           0463
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0463
NCPSTS   DS    0H                                                  0464
*   RFY                                                            0464
*     LNKREG RSTD;                  /* RESTRICT REGISTER      @X03HDP*/
*   ZCRSVF7=LNKREG;                 /* SAVE RETURN REG               */
         L     @11,RPHCRR(,RPHPTR)                                 0465
         L     @11,CRACRR(,@11)                                    0465
         ST    LNKREG,ZCRSVF7(,@11)                                0465
*   RFY                                                            0466
*     LNKREG UNRSTD;                /* RELEASE REGISTER       @X03HDP*/
*/********************************************************************/
*/*                                                                  */
*/*   THE FOLLOWING BLOCK OF CODE TESTS FOR A DISCONNECT COMMAND     */
*/*  COMPLETING WITH A SYNTAX ERROR RESPONSE. THIS OCCURS WHEN A     */
*/*  DISCONNECT IS ISSUED AS A RESULT OF CLSDST AND THE DISCONNECT   */
*/*  GOES OUT TO THE DEVICE WHEN IT IS NOT IN SESSION. SINCE THE     */
*/*  INTENT OF THE DISCONNENT WAS TO GO OUT OF SESSION ANYWAY, THERE */
*/*  IS NO REASON TO TREAT THIS AS AN ERROR CONDITION. THEREFORE,    */
*/*  IT WILL BE HANDLED BY CALLING ISTZBFOB TO ISSUE A RESET ERROR   */
*/*  LOCK FOR THE DEVICE AND CHANGING THE SYSTEM AND EXTENDED        */
*/*  RESPONSE AS WELL AS THE FSB RETURN CODES TO MAKE IT APPEAR TO   */
*/*  BE A NORMAL PHASE 3 DISCONNECT COMPLETION.                      */
*/*                                                          @ZA09952*/
*/********************************************************************/
*                                                                  0467
*   IF BDUCOMND=BCMDD&              /* IF DISCONNECT AND     @ZA09952*/
*/*  FSBSYSRS='88'X THEN ---CODE REPLACED BY APAR OZ16543--- @ZA16543*/
*                                                                  0467
*       FSBSERR='1'B THEN           /* NCP RESPONSE IS DISCONNECT OUT
*                                      OF SESSION OR ANY OTHER ERROR
*                                      RESPONSE              @ZA16543*/
         CLI   BDUCOMND+62(BFRREG),X'07'                           0467
         BNE   @RF00467                                            0467
         TM    FSBSERR(FSBPTR),B'10000000'                         0467
         BNO   @RF00467                                            0467
*/*  FSBEXTRS='80'X   CODE REMOVED BY APAR OZ17006           @ZA17006*/
*/*  FMCCPIP='1'B-----CODE REMOVED BY APAR-------------------@ZA16219*/
*                                                                  0468
*     DO;                           /*                       @ZA09952*/
*       FSBMJRCD=FRNORM;            /* MAJOR RET CD=NORM     @ZA09952*/
         MVI   FSBMJRCD(FSBPTR),X'00'                              0469
*       FSBMNRCD=FRNORM;            /* MINOR RET CD=NORM     @ZA09952*/
         MVI   FSBMNRCD(FSBPTR),X'00'                              0470
*       FSBSYSRS='60'X;             /* SYS RESP=PHSE3 OK     @ZA09952*/
         MVI   FSBSYSRS(FSBPTR),X'60'                              0471
*       FSBEXTRS='00'X;             /* EXT RESP=NORMAL       @ZA09952*/
         MVI   FSBEXTRS(FSBPTR),X'00'                              0472
*       ZCRRELK='1'B;               /* TURN ON RESET ERROR LOCK    0473
*                                      INDICATOR             @ZA09952*/
         OI    ZCRRELK(@11),B'00100000'                            0473
*       ZCRDAFSV=FSBSAF;            /* SET DAF FOR RESET     @ZA09952*/
         MVC   ZCRDAFSV(2,@11),FSBSAF(FSBPTR)                      0474
*       ZCRSAFSV=FSBDAF;            /* SET SAF FOR RESET     @ZA09952*/
         MVC   ZCRSAFSV(2,@11),FSBDAF(FSBPTR)                      0475
*       RFY                                                        0476
*        (GPR00F,                                                  0476
*         CMP1) RSTD;               /* RESTRICT TMP REGS     @ZA09952*/
*       GPR00F=ZCRCIDSV;            /* SET PARM FOR BFOB     @ZA09952*/
         L     GPR00F,ZCRCIDSV(,@11)                               0477
*       CMP1=BFRREG;                /* SAVE BUFFER PTR       @ZA09952*/
         LR    CMP1,BFRREG                                         0478
*       BFRREG=0;                   /* CLEAR BUFFER PTR FOR BFOB   0479
*                                                            @ZA09952*/
         SLR   BFRREG,BFRREG                                       0479
*       CALL ISTZBFOB;              /* GO DO RESET           @ZA09952*/
         L     @11,ATCZPSVT(,VTCVTREG)                             0480
         L     @15,ZPSZBFOB(,@11)                                  0480
         BALR  @14,@15                                             0480
*       BFRREG=CMP1;                /* RESTORE BUFF PTR      @ZA09952*/
         LR    BFRREG,CMP1                                         0481
*       RFY                                                        0482
*        (GPR00F,                                                  0482
*         CMP1) UNRSTD;             /* RELEASE TMP REGS      @ZA09952*/
*     END;                          /* DISC OUT-OF-SESS      @ZA09952*/
*   ELSE                                                           0484
*     ;                             /* IF NOT OUT OF SESSION DISC DO
*                                      NOTHING               @ZA09952*/
@RF00467 DS    0H                                                  0485
*   IF FSBMJRCD=FRNORM THEN         /* IF FSB MAJOR RC IS NORMAL     */
         CLI   FSBMJRCD(FSBPTR),X'00'                              0485
         BNE   @RF00485                                            0485
*     IF LSCEXRES='1'B×             /* EXCEPTIONAL RESPONSE MODE ? 0486
*                                                            @XM03HDP*/
*         LSCZRT09='1'B THEN        /* OR DIALOG SCHED DISABLED?   0486
*                                                            @XM03HDP*/
         TM    LSCEXRES(ELEMREG),B'00001000'                       0486
         BO    @RT00486                                            0486
         TM    LSCZRT09(ELEMREG),B'01000000'                       0486
         BNO   @RF00486                                            0486
@RT00486 DS    0H                                                  0487
*       DO;                         /* IF IT IS...           @XL03HDP*/
*/*  IF DIALOG SCHED DISABLED IS INDICATED IN THE REQUEST TAG,     0488
*    IT MEANS THIS DISCONNECT WAS INTERNALLY GENERATED BY TPIOS    0488
*    OUTBOUND AS A RESULT OF A READ CONTINUOUS REQUEST WHILE IN    0488
*    SESSION.  THE INVITE PENDING FLAG IS SET ON SINCE AN INVITE WITH
*    AUTO RESTART COMMAND FOLLOWS THE DISCONNECT TO EFFECT THE READ
*    CONTINUOUS. THE FSB WILL BE DISCARDED AND THE APPLICATION WILL
*    SEE ONLY THE FEEDBACK FROM THE INVITE W/AUTO RESTART WHICH    0488
*    FOLLOWS.                                                        */
*                                                                  0488
*         IF LSCZRT09='1'B THEN     /* TPIOS DISC ?          @XM03HDP*/
         TM    LSCZRT09(ELEMREG),B'01000000'                       0488
         BNO   @RF00488                                            0488
*           DO;                     /* YES                   @XM03HDP*/
*/* CODE DELETED FOR REMOVAL OF DIALOG QUEUE SUPPORT         @XC36516*/
*                                                                  0490
*             FMCZFB06='1'B;        /* INVITE UP             @XM03HDP*/
         OI    FMCZFB06(FMCBREG),B'00000010'                       0490
*             DNCINVIT='1'B;        /* IN DUPLICATE          @XM03HDP*/
         OI    DNCINVIT(DNCBPTR),B'00100000'                       0491
*             CALL ISTZIFHB;        /* CONTACT/DISCONNECT ANALYSIS 0492
*                                                            @XM03HDP*/
         SLR   @14,@14                                             0492
         ICM   @14,7,PABDVTA+112(FMCBREG)                          0492
         L     @15,ZRCZIFHB(,@14)                                  0492
         BALR  @14,@15                                             0492
*           END;                    /*                       @XM03HDP*/
*         ELSE                                                     0494
*           ;                       /* NOT TPIOS DISC        @XM03HDP*/
@RF00488 DS    0H                                                  0495
*         CALL FSBDEQ;              /* DEQ BUFFER FROM WAITQ ELEM  0495
*                                                            @XM03HDP*/
         BAL   @14,FSBDEQ                                          0495
*         ZCRPCOD1=ZCPBUF;          /* ..THEN WERE GOING TO FREE   0496
*                                      BUFFER                @XL03HDP*/
         L     @14,RPHCRR(,RPHPTR)                                 0496
         L     @14,CRACRR(,@14)                                    0496
         MVI   ZCRPCOD1(@14),X'04'                                 0496
*         RFY                                                      0497
*           CMP1 RSTD;              /* RESTRICT WORK REG     @XL03HDP*/
*         CMP1=ELEMREG;             /* SAVE WAITQ ELEM @     @XL03HDP*/
         LR    CMP1,ELEMREG                                        0498
*         ELEMREG=BFRREG;           /* LOAD ADDRESS BUFFER TO RELEASE
*                                                            @XL03HDP*/
         LR    ELEMREG,BFRREG                                      0499
*         CALL ISTZDFB0;            /* BFR DEALLOCATION      @XL03HDP*/
         L     @11,ATCZPSVT(,VTCVTREG)                             0500
         L     @15,ZPSZDFB0(,@11)                                  0500
         BALR  @14,@15                                             0500
*         ELEMREG=CMP1;             /* RESTORE WAITQ ELEMENT ADDRESS
*                                                            @XL03HDP*/
         LR    ELEMREG,CMP1                                        0501
*         RFY                                                      0502
*           CMP1 UNRSTD;            /* FREE UP WORK REG      @XL03HDP*/
*         RCDREG=NOPOST;            /* SET INTERNAL R.C.     @XL03HDP*/
         LA    RCDREG,8                                            0503
*         FSBPTR=FSBPTR×REQCOMP;    /* NCP COMPLETED FLG     @XM03HDP*/
         O     FSBPTR,@CF01971                                     0504
*         DNCZRSCH='1'B;            /* DEVICE RESCHED        @XM03HDP*/
         OI    DNCZRSCH(DNCBPTR),B'00000100'                       0505
*       END;                        /* END THIS LEG          @XL03HDP*/
*     ELSE                          /* NOT EXCEP RESPONSE@XL03HDP    */
*       DO;                         /*                       @XL03HEK*/
         B     @RC00486                                            0507
@RF00486 DS    0H                                                  0508
*         IF FSBSCODE=NCPBSTAT THEN /* IF NCP RESPONSE= BSC STATUS 0508
*                                      MESSAGE                       */
*                                                                  0508
         TM    FSBSCODE(FSBPTR),B'00000101'                        0508
         BNO   @RF00508                                            0508
         TM    FSBSCODE(FSBPTR),B'00011010'                        0508
         BNZ   @RF00508                                            0508
*           /*********************************************************/
*           /*                                                       */
*           /* SEGMENT(MVESETS)REQUEST                               */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0509
*           DO;                                                    0509
*             GOTO MVESETS;                                        0510
         B     MVESETS                                             0510
*MVESETS#:                                                         0511
*           END;                    /* BUILD MORE FSB        @XL03HDP*/
*         ELSE                                                     0512
*           ;                       /* PHASE 0 OR NOT BSC STATUS   0512
*                                                            @XL03HEK*/
@RF00508 DS    0H                                                  0513
*         CALL ISTZIFHB;            /* CALL CONTACT COMPLETION     0513
*                                      ANALYSIS                      */
@RC00508 SLR   @14,@14                                             0513
         ICM   @14,7,PABDVTA+112(FMCBREG)                          0513
         L     @15,ZRCZIFHB(,@14)                                  0513
         BALR  @14,@15                                             0513
*/*                      CHECK FOR MANUAL DIAL CONNECTION    @XL03HEK*/
*                                                                  0514
*         IF BDUCOMND=BCMDD THEN    /* DISCONNECT COMMAND     @X03HDP*/
         CLI   BDUCOMND+62(BFRREG),X'07'                           0514
         BNE   @RF00514                                            0514
*           RCDREG=0;               /* ZERO RETN CODE         @X03HDP*/
         SLR   RCDREG,RCDREG                                       0515
*         ELSE                                                     0516
*                                                                  0516
*           /*********************************************************/
*           /*                                                       */
*           /* SEGMENT(MANDIAL)REQUEST                               */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0516
*           DO;                                                    0516
         B     @RC00514                                            0516
@RF00514 DS    0H                                                  0517
*             GOTO MANDIAL;                                        0517
         B     MANDIAL                                             0517
*MANDIAL#:                                                         0518
*           END;                                                   0518
*                                                                  0518
*         /***********************************************************/
*         /*                                                         */
*         /*                                                 @XL03HEK*/
*         /*                                                         */
*         /***********************************************************/
*                                                                  0519
*       END;                        /* END NOT EXCEP RESPONSE        */
*   ELSE                            /* FSB MAJOR RC NOT NORMAL       */
*     DO;                                                          0520
         B     @RC00485                                            0520
@RF00485 DS    0H                                                  0521
*       FSBPTR=FSBPTR×REQCOMP;      /* SET NCP COMPLETED FLAG ON     */
         O     FSBPTR,@CF01971                                     0521
*       IF FSBMJRCD=FRLOGICE THEN   /* IF FSB MAJOR RC= LOGIC ERR    */
         CLI   FSBMJRCD(FSBPTR),X'08'                              0522
         BNE   @RF00522                                            0522
*         DO;                                                      0523
*           CALL ISTZIFIB;          /* LOGICAL ERR RECOV     @XL03HEK*/
         SLR   @14,@14                                             0524
         ICM   @14,7,PABDVTA+112(FMCBREG)                          0524
         L     @15,ZRCZIFIB(,@14)                                  0524
         BALR  @14,@15                                             0524
*           RCDREG=0;               /* RC =TPOST REQUIRED            */
         SLR   RCDREG,RCDREG                                       0525
*         END;                                                     0526
*       ELSE                        /* FSB MAJOR RC NOT NORMAL       */
*         DO;                       /* AND NOT A LOGIC ERROR         */
         B     @RC00522                                            0527
@RF00522 DS    0H                                                  0528
*           FMCZF011=ON;            /* RESET ERR LOCK INHIBITED    0528
*                                                            @XA06938*/
         OI    FMCZF011(FMCBREG),B'01000000'                       0528
*           CALL ISTZIFGB;          /* CONTACT ERROR ANALYSIS        */
         SLR   @14,@14                                             0529
         ICM   @14,7,PABDVTA+112(FMCBREG)                          0529
         L     @15,ZRCZIFGB(,@14)                                  0529
         BALR  @14,@15                                             0529
*           IF FSBSCODE=NCPDEBF THEN/* IF NCP RESPONSE WAS BSC STATUS
*                                      PENDING                       */
         TM    FSBSCODE(FSBPTR),B'00000101'                        0530
         BNO   @RF00530                                            0530
         TM    FSBSCODE(FSBPTR),B'00011010'                        0530
         BNZ   @RF00530                                            0530
*             DO;                   /*                       @XM03HDP*/
*               BFRREG=0;           /* ZERO ZIBUF PTR        @XM03HDP*/
         SLR   BFRREG,BFRREG                                       0532
*               RCDREG=ERR4;        /* RTNCD = CALL TPOST            */
         LA    RCDREG,4                                            0533
*             END;                  /*                       @XM03HDP*/
*           ELSE                    /* NO BSC STATUS PEND    @XA06938*/
*             RCDREG=0;             /* CONTINUE PROCESSING   @XM00275*/
         B     @RC00530                                            0535
@RF00530 SLR   RCDREG,RCDREG                                       0535
*         END;                      /* END NOT LOGIC ERROR   @XM00275*/
@RC00530 DS    0H                                                  0537
*       IF RCDREG=0 THEN            /* CONTINUE ?            @XM00275*/
@RC00522 LTR   RCDREG,RCDREG                                       0537
         BNZ   @RF00537                                            0537
*         DO;                       /*                       @XA06938*/
*           IF FMCZF020=ON THEN     /* TPIOS CONTACT?        @XA06938*/
         TM    FMCZF020(FMCBREG),B'00100000'                       0539
         BNO   @RF00539                                            0539
*             DO;                   /* DIAL OUT FAILED       @XA06938*/
*/* TPDEQ (,FMCSHEDQ)                                                */
*                                                                  0541
*               DO;                 /* BEGIN TPDEQ CODE GENERATION   */
*                 DCL                                              0542
*                   FMZCA020 BIT(32) CONSTANT('80000000'X);        0542
*                 DCL                                              0543
*                   FMZCB020 BIT(32) CONSTANT('7FFFFFFF'X);        0543
*                 RFY                                              0544
*                  (GPR00P,                                        0544
*                   GPR01P,                                        0544
*                   GPR14P,                                        0544
*                   GPR15P) RSTD;                                  0544
*                 GPR15P=ADDR(FMCSHEDQ);/* ADDRESS QUEUE POINTER     */
         LA    GPR15P,FMCSHEDQ(,FMCBREG)                           0545
*                 GPR14P=GPR15P->PABWEQA×FMZCA020;                 0546
         L     @11,@CF01971                                        0546
         L     GPR14P,PABWEQA(,GPR15P)                             0546
         OR    GPR14P,@11                                          0546
*                 IF GPR14P=FMZCA020 THEN                          0547
         CLR   GPR14P,@11                                          0547
         BE    @RT00547                                            0547
*                   ;                                              0548
*                 ELSE                                             0549
*                   DO;                                            0549
*FMZL1020:                                                         0550
*                     ;                                            0550
FMZL1020 DS    0H                                                  0551
*                     DO WHILE(GPR14P->WKECHAIN^=FMZCA020);        0551
         B     @DE00551                                            0551
@DL00551 DS    0H                                                  0552
*                       GPR15P=ADDR(GPR14P->WKECHAIN);             0552
         LA    GPR15P,WKECHAIN(,GPR14P)                            0552
*                       GPR14P=GPR15P->PABWEQA;                    0553
         L     GPR14P,PABWEQA(,GPR15P)                             0553
*                     END;                                         0554
@DE00551 L     @11,@CF01971                                        0554
         CL    @11,WKECHAIN(,GPR14P)                               0554
         BNE   @DL00551                                            0554
*                     GPR00P=FMZCA020;                             0555
         LR    GPR00P,@11                                          0555
*                     CS(GPR14P,GPR00P,GPR15P->PABWEQA);           0556
         CS    GPR14P,@00,PABWEQA(GPR15P)                          0556
*                     BC(7,FMZL1020);                              0557
         BC    7,FMZL1020                                          0557
*                     GPR14P->WKECHAIN=0;                          0558
         SLR   @11,@11                                             0558
         ST    @11,WKECHAIN(,GPR14P)                               0558
*                   END;                                           0559
*ISTA0020:                                                         0560
*                 ;                                                0560
@RT00547 DS    0H                                                  0560
ISTA0020 DS    0H                                                  0561
*                 GPR14P=GPR14P&FMZCB020;                          0561
         N     GPR14P,@CF01969                                     0561
*                 GPR01P->RPHWEA=GPR14P;                           0562
         ST    GPR14P,RPHWEA(,GPR01P)                              0562
*                 RFY                                              0563
*                  (GPR00P,                                        0563
*                   GPR01P,                                        0563
*                   GPR14P,                                        0563
*                   GPR15P) UNRSTD;                                0563
*               END;                /* END TPDEQ GENERATION DEQ    0564
*                                      OLDEST SCHEDQ ELEMENT, WHICH
*                                      WAS THE 1ST USER READ REQ,  0564
*                                      WHICH PROMPTED TPIOS CONTACT
*                                                            @XA06938*/
*               FMCZX003=FMCZX003-1;/* DECR SCHEDQ CNT       @XA06938*/
         SLR   @14,@14                                             0565
         IC    @14,FMCZX003(,FMCBREG)                              0565
         BCTR  @14,0                                               0565
         STC   @14,FMCZX003(,FMCBREG)                              0565
*               RFY                                                0566
*                 CMP1 RSTD;        /*                       @XA06938*/
*               CMP1=ELEMREG;       /* SAVE WAITQ ELEM @     @XA06938*/
         LR    CMP1,ELEMREG                                        0567
*               IF RPHWEA->LSCTYPE=LSTYPE THEN/* DEQD AN LSCB      0568
*                                                            @XA06938*/
         L     @14,RPHWEA(,RPHPTR)                                 0568
         CLI   LSCTYPE(@14),X'DF'                                  0568
         BNE   @RF00568                                            0568
*                 DO;               /*                       @XA06938*/
*                   ZCRPCOD1=ZCPLSCB;/* PREPARE TO FREE IT   @XA06938*/
         L     @11,RPHCRR(,RPHPTR)                                 0570
         L     @11,CRACRR(,@11)                                    0570
         MVI   ZCRPCOD1(@11),X'08'                                 0570
*                   ELEMREG=RPHWEA; /* ADDR TO FREE          @XA06938*/
         LR    ELEMREG,@14                                         0571
*                 END;              /*                       @XA06938*/
*               ELSE                /* DEQUED AN LCP         @XA06938*/
*                 DO;               /*                       @XA06938*/
         B     @RC00568                                            0573
@RF00568 DS    0H                                                  0574
*                   ZCRPCOD1=ZCPBUF;/* WILL FREE ZOBUF       @XA06938*/
         L     @14,RPHCRR(,RPHPTR)                                 0574
         L     @14,CRACRR(,@14)                                    0574
         MVI   ZCRPCOD1(@14),X'04'                                 0574
*                   ELEMREG=RPHWEA->LCPFDBA;/* ADDR TO FREE  @XA06938*/
         L     @14,RPHWEA(,RPHPTR)                                 0575
         L     ELEMREG,LCPFDBA(,@14)                               0575
*                   RPHWEA->LCPFDBA=0;/* ZERO BFR ADDR       @XA06938*/
         SLR   @11,@11                                             0576
         ST    @11,LCPFDBA(,@14)                                   0576
*                 END;              /*                       @XA06938*/
*               CALL ISTZDFB0;      /* LSCB/BUFFER DEALL     @XA06938*/
@RC00568 L     @11,ATCZPSVT(,VTCVTREG)                             0578
         L     @15,ZPSZDFB0(,@11)                                  0578
         BALR  @14,@15                                             0578
*               ELEMREG=CMP1;       /* RESTORE WAITQ ELEM    @XA06938*/
         LR    ELEMREG,CMP1                                        0579
*               RFY                                                0580
*                 CMP1 UNRSTD;      /*                       @XA06938*/
*               IF FMCZF010=OFF THEN/* NO RESET IN PROG      @XA06938*/
         TM    FMCZF010(FMCBREG),B'10000000'                       0581
         BNZ   @RF00581                                            0581
*                 FMCZF017=OFF;     /* ZERO SCHEDQ LOCK      @XA06938*/
         NI    FMCZF017(FMCBREG),B'11111110'                       0582
*               ELSE                                               0583
*                 ;                 /* RESET IS IN PROG      @XA06938*/
@RF00581 DS    0H                                                  0584
*               FMCZF020=OFF;       /* ZERO TPIOS CONTACT    @XA06938*/
         NI    FMCZF020(FMCBREG),B'11011111'                       0584
*             END;                  /*                       @XA06938*/
*           ELSE                                                   0586
*             ;                     /* NOT TPIOS CONTACT     @XA06938*/
@RF00539 DS    0H                                                  0587
*           RCDREG=0;               /* INTERNAL RC           @XA06938*/
         SLR   RCDREG,RCDREG                                       0587
*         END;                      /*                       @XA06938*/
*       ELSE                                                       0589
*         ;                         /* RC=4 - DONT CONTINUE  @XM00275*/
@RF00537 DS    0H                                                  0590
*     END;                          /* END FSB MAJOR RC NOTNORMAL    */
*   RFY                                                            0591
*     LNKREG RSTD;                  /* RESTRICT REGISTER      @X03HDP*/
@RC00485 DS    0H                                                  0592
*   LNKREG=ZCRSVF7;                 /* RESTORE RETURN REG            */
         L     @11,RPHCRR(,RPHPTR)                                 0592
         L     @11,CRACRR(,@11)                                    0592
         L     LNKREG,ZCRSVF7(,@11)                                0592
*   RFY                                                            0593
*     LNKREG UNRSTD;                /* RELEASE REGISTER       @X03HDP*/
*                                                                  0594
*/********************************************************************/
*/*                                                                  */
*/* MANDIAL: THIS ROUTINE CHECKS FOR A MANUAL DIAL CONNECTION.       */
*/*                                                                  */
*/*                                                                  */
*/*                                                                  */
*/*          THE S/D CODE FOR MANDIAL IS SHOWN AT RIGHT:     @XL03HEK*/
*/*                                                                  */
*/********************************************************************/
*                                                                  0594
*   /*****************************************************************/
*   /*                                                               */
*   /* SEGMENT(MANDIAL)START                                         */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0594
*   DO;                                                            0594
*     GOTO MANDIAL@;                                               0595
         B     MANDIAL@                                            0595
*MANDIAL:                                                          0596
*   END;                                                           0596
MANDIAL  DS    0H                                                  0597
*   CALL ISTZKFCB;                  /* MANUAL DIAL PROCESSOR         */
         SLR   @14,@14                                             0597
         ICM   @14,7,PABDVTA+112(FMCBREG)                          0597
         L     @15,ZRCZKFCB(,@14)                                  0597
         BALR  @14,@15                                             0597
*   IF RCDREG=PRCEEDRC THEN         /* RETURN CODE = PROCEED?        */
         LTR   RCDREG,RCDREG                                       0598
         BNZ   @RF00598                                            0598
*     IF FMCZF020=ON THEN           /* YES, TPIOS CONTACT ON?        */
         TM    FMCZF020(FMCBREG),B'00100000'                       0599
         BNO   @RF00599                                            0599
*       DO;                         /* YES                           */
*         FMCZF020=OFF;             /* SET OFF CONTACT FLAG          */
         NI    FMCZF020(FMCBREG),B'11011111'                       0601
*         IF FMCZF010=OFF THEN      /* IF NO RESET IS IN PROGRESS  0602
*                                                            @XA06938*/
         TM    FMCZF010(FMCBREG),B'10000000'                       0602
         BNZ   @RF00602                                            0602
*           FMCZF017=OFF;           /* ZERO SCHEDQ LOCK      @XA06938*/
         NI    FMCZF017(FMCBREG),B'11111110'                       0603
*         ELSE                                                     0604
*           ;                       /* RESET IN PROGRESS     @XA06938*/
@RF00602 DS    0H                                                  0605
*         DNCZF006=ON;              /* SET ON DNCB CONNECTION      0605
*                                      ESTABLISHED FLAG              */
         OI    DNCZF006(DNCBPTR),B'00100000'                       0605
*         CALL FSBDEQ;              /* REMOVE OLDEST FSB FROM WAITQ
*                                      ELEMENT                       */
         BAL   @14,FSBDEQ                                          0606
*         ZCRPCOD1='00'X;           /* SET UP FOR BUFFER             */
         L     @14,RPHCRR(,RPHPTR)                                 0607
         L     @14,CRACRR(,@14)                                    0607
         MVI   ZCRPCOD1(@14),X'00'                                 0607
*         ZCRPBUF=ON;               /* DEALLOCATION                  */
         OI    ZCRPBUF(@14),B'00000100'                            0608
*         LCCWREG=ELEMREG;          /* SAVE WAITQ ELEMENT PTR        */
         LR    LCCWREG,ELEMREG                                     0609
*         ELEMREG=BFRREG;           /* GET BFR ADDR FOR DEALLOC      */
         LR    ELEMREG,BFRREG                                      0610
*         CALL ISTZDFB0;            /* BUFFER DEALLOCATION           */
         L     @14,ATCZPSVT(,VTCVTREG)                             0611
         L     @15,ZPSZDFB0(,@14)                                  0611
         BALR  @14,@15                                             0611
*         ELEMREG=LCCWREG;          /* RESTORE WAITQ ELEM PTR        */
         LR    ELEMREG,LCCWREG                                     0612
*         FSBPTR=FSBPTR×REQCOMP;    /* INDICATED NCP COMPLETED       */
         O     FSBPTR,@CF01971                                     0613
*         DNCZRSCH=ON;              /* INDICATE DNCB NORMAL FINISH   */
         OI    DNCZRSCH(DNCBPTR),B'00000100'                       0614
*         RCDREG=8;                 /* SET RC FOR HOUSKPG REQD       */
         LA    RCDREG,8                                            0615
*       END;                                                       0616
*     ELSE                                                         0617
*       ;                           /* NOT TPIOS CONTACT             */
@RF00599 DS    0H                                                  0618
*   ELSE                            /* DO NOT PROCEED ON LINE        */
*     RCDREG=ZCRNRSCH;              /* SET RC:EXIT,SCHED NORM        */
*                                                                  0618
         B     @RC00598                                            0618
@RF00598 LA    RCDREG,36                                           0618
*   /*****************************************************************/
*   /*                                                               */
*   /* SEGMENT(MANDIAL)FINISH                                        */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0619
*   DO;                                                            0619
@RC00598 DS    0H                                                  0620
*     GOTO MANDIAL#;                                               0620
         B     MANDIAL#                                            0620
*MANDIAL@:                                                         0621
*   END;                                                           0621
MANDIAL@ DS    0H                                                  0622
*                                                                  0622
*/********************************************************************/
*/*      MOVESETS - INITIALIZES THE FSBDMGRS FIELD FROM THE          */
*/*                 APPROPRIATE FIELDS IN BTUTEXT AS DETERMINED      */
*/*                 BY THE DEVICE TYPE.  IN ADDITION, THE SENSE      */
*/*                 TRANSLATOR MODULE ISTZDFXR IS CALLED IF THE      */
*/*                 DEVICE IS A 3270 - TYPE IN RECORD MODE.          */
*/*                                                                  */
*/*      THE SD CODE FOR THIS ROUTINE IS -->                 @XL03HDP*/
*/********************************************************************/
*                                                                  0622
*   /*****************************************************************/
*   /*                                                               */
*   /* SEGMENT(MVESETS)START                                         */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0622
*   DO;                                                            0622
*     GOTO MVESETS@;                                               0623
         B     MVESETS@                                            0623
*MVESETS:                                                          0624
*   END;                                                           0624
MVESETS  DS    0H                                                  0625
*   IF(DEVTCODE=DEV3275             /* IS THIS ONE                   */
*       ×DEVTCODE=DEV3277           /* OF THOSE                      */
*       ×DEVTCODE=DEV3284           /* 3270 - TYPE                   */
*       ×DEVTCODE=DEV3286) THEN     /* DEVICES ?                     */
         LA    @14,36                                              0625
         ALR   @14,DNCBPTR                                         0625
         CLI   DEVTCODE(@14),X'1C'                                 0625
         BE    @RT00625                                            0625
         CLI   DEVTCODE(@14),X'19'                                 0625
         BE    @RT00625                                            0625
         CLI   DEVTCODE(@14),X'1A'                                 0625
         BE    @RT00625                                            0625
         CLI   DEVTCODE(@14),X'1B'                                 0625
         BNE   @RF00625                                            0625
@RT00625 DS    0H                                                  0626
*     DO;                           /* IF IT IS..                    */
*       FSBDMGRS=BTUTEXT(6:7);      /* COPY DEV MGT RESP             */
         MVC   FSBDMGRS(2,FSBPTR),BTUTEXT+53(BFRREG)               0627
*       IF FMCMODE=FMCRCD THEN      /* IN RECORD MODE ?              */
         CLC   FMCMODE(8,FMCBREG),@CC02455                         0628
         BNE   @RF00628                                            0628
*         CALL ISTZDFXR;            /* CALL SENSE XLATOR             */
         L     @14,ATCZPSVT(,VTCVTREG)                             0629
         L     @15,ZPSZDFXR(,@14)                                  0629
         BALR  @14,@15                                             0629
*       ELSE                                                       0630
*         ;                         /* NOT IN RECORD MODE            */
@RF00628 DS    0H                                                  0631
*     END;                          /* DONE WITH 3270                */
*   ELSE                            /* NOT 3270 DEVICE               */
*     FSBDMGRS=BTUTEXT(4:5);        /* DEVICE MGMT RESPONSE          */
         B     @RC00625                                            0632
@RF00625 MVC   FSBDMGRS(2,FSBPTR),BTUTEXT+51(BFRREG)               0632
*   FDBDATCT=0;                     /* NO DATA                       */
@RC00625 SLR   @14,@14                                             0633
         STH   @14,FDBDATCT(,BFRREG)                               0633
*   FDBDATAA=0;                     /* NO DATA ADDRESS               */
         ST    @14,FDBDATAA(,BFRREG)                               0634
*   CALL ISTZDFNB;                  /* CALL MSG FORMATTER            */
*                                                                  0635
         L     @14,ATCZPSVT(,VTCVTREG)                             0635
         L     @15,ZPSZDFNB(,@14)                                  0635
         BALR  @14,@15                                             0635
*   /*****************************************************************/
*   /*                                                               */
*   /* SEGMENT(MVESETS)FINISH                                        */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0636
*   DO;                                                            0636
*     GOTO MVESETS#;                                               0637
         B     MVESETS#                                            0637
*MVESETS@:                                                         0638
*   END;                                                           0638
*   END NCPSTS;                                                    0639
@EL00002 DS    0H                                                  0639
@EF00002 DS    0H                                                  0639
@ER00002 BR    @14                                                 0639
*                                                                  0640
*/*    TPOST IS CALLED TO INITIALIZE THE FSB, REMOVE THE FSB FROM    */
*/* THE WAIT QUEUE ELEMENT AND QUEUE THE FSB TO THE CLIP.            */
*/* THE TPIOS FDB IS MOVED TO THE SYSTEM FDB LOCATION AND THE        */
*/* FDBOFSET IS RECALCULATED.                                        */
*/*                                                                  */
*                                                                  0640
*TPOST:                                                            0640
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0640
TPOST    DS    0H                                                  0641
*   RFY                                                            0641
*     LNKREG RSTD;                  /* RESTRICT REGISTER      @X03HDP*/
*   ZCRSVF7=LNKREG;                 /* SAVE RETURN REG               */
         L     @11,RPHCRR(,RPHPTR)                                 0642
         L     @11,CRACRR(,@11)                                    0642
         ST    LNKREG,ZCRSVF7(,@11)                                0642
*   RFY                                                            0643
*     LNKREG UNRSTD;                /* RELEASE REGISTER       @X03HDP*/
*   IF LSCTYPE=LSTYPE&LSCLCCWA=0 THEN/* DISCONNECT AFTER WRT         */
         CLI   LSCTYPE(ELEMREG),X'DF'                              0644
         BNE   @RF00644                                            0644
         ICM   @14,15,LSCLCCWA(ELEMREG)                            0644
         BNZ   @RF00644                                            0644
*     DO;                           /* PRINTER               @XA07962*/
*       CALL FSBDEQ;                /* DEQ BUFFER FROM WAITQ ELEMENT
*                                                            @XA07962*/
         BAL   @14,FSBDEQ                                          0646
*       ZCRPCOD1=ZCPBUF;            /* SET TO FREE BUFF      @XA07962*/
         L     @14,RPHCRR(,RPHPTR)                                 0647
         L     @14,CRACRR(,@14)                                    0647
         MVI   ZCRPCOD1(@14),X'04'                                 0647
*       RFY                                                        0648
*         CMP1 RSTD;                /*                       @XA07962*/
*       CMP1=ELEMREG;               /* SAVE ELEM ADDR        @XA07962*/
         LR    CMP1,ELEMREG                                        0649
*       ELEMREG=BFRREG;             /* LOAD ADDR BUFF TO RELEASE   0650
*                                                            @XA07962*/
         LR    ELEMREG,BFRREG                                      0650
*       CALL ISTZDFB0;              /* BFR DEALLOCATION      @XA07962*/
         L     @11,ATCZPSVT(,VTCVTREG)                             0651
         L     @15,ZPSZDFB0(,@11)                                  0651
         BALR  @14,@15                                             0651
*       ELEMREG=CMP1;               /* RESTORE WAITQ ELEMENT ADDR  0652
*                                                            @XA07962*/
         LR    ELEMREG,CMP1                                        0652
*       RFY                                                        0653
*         CMP1 UNRSTD;              /*                       @XA07962*/
*       DNCZRSCH=ON;                /* SET RESCHEDULEABLE FLAG     0654
*                                                            @XA07962*/
         OI    DNCZRSCH(DNCBPTR),B'00000100'                       0654
*       FSBPTR=FSBPTR×REQCOMP;      /* SET NCP COMPLETE      @XA07962*/
         O     FSBPTR,@CF01971                                     0655
*     END;                          /*                       @XA07962*/
*   ELSE                                                           0657
*     DO;                           /*                       @XA07962*/
         B     @RC00644                                            0657
@RF00644 DS    0H                                                  0658
*       IF LSCTYPE^=LSTYPE          /* WAIT ELEMENT LCPB             */
*         THEN                                                     0658
         CLI   LSCTYPE(ELEMREG),X'DF'                              0658
         BE    @RF00658                                            0658
*         FSBLCPB=ELEMREG;          /* SET FSB LCPB ADDRESS          */
         ST    ELEMREG,FSBLCPB(,FSBPTR)                            0659
*       ELSE                                                       0660
*         FSBLCPB=LSCLCPBA;         /* SET LCPB ADDR IN FSB          */
         B     @RC00658                                            0660
@RF00658 MVC   FSBLCPB(4,FSBPTR),LSCLCPBA(ELEMREG)                 0660
*       FSBLCCWA=LCPNXLCW;          /* SET LCCW IN FSB               */
@RC00658 MVC   FSBLCCWA(4,FSBPTR),LCPNXLCW(ELEMREG)                0661
*       FSBSAF=BTUSORCE;            /* SET SOURCE ID         @XM03HDP*/
         LA    @14,48                                              0662
         ALR   @14,BFRREG                                          0662
         MVC   FSBSAF(2,FSBPTR),BTUSORCE(@14)                      0662
*       FSBDAF=BTUDEST;             /* DESTINATION ID        @XM03HDP*/
         MVC   FSBDAF(2,FSBPTR),BTUDEST(@14)                       0663
*       CALL FSBDEQ;                /* REMOVE FSB FROM LCPB CHAIN  0664
*                                                            @XM03HDP*/
         BAL   @14,FSBDEQ                                          0664
*       IF FSBMJRCD=FRNORM THEN     /* NORMAL RTN CODE       @XM03HDP*/
         CLI   FSBMJRCD(FSBPTR),X'00'                              0665
         BNE   @RF00665                                            0665
*         IF FSBSPHSE=NCPPHSE3 THEN /* PHASE 3 RESPONSE      @XM03HDP*/
         TM    FSBSPHSE(FSBPTR),B'01100000'                        0666
         BNO   @RF00666                                            0666
*           DO;                     /*                       @XM03HDP*/
*             DNCZRSCH=ON;          /* SET RESCHEDULABLE FLAG      0668
*                                                            @XM03HDP*/
         OI    DNCZRSCH(DNCBPTR),B'00000100'                       0668
*             FSBPTR=FSBPTR×REQCOMP;/* SET NCP COMPLETE FLAG @XM03HDP*/
         O     FSBPTR,@CF01971                                     0669
*           END;                    /*                       @XM03HDP*/
*         ELSE                                                     0671
*           ;                       /* NOT PHASE 3           @XM03HDP*/
@RF00666 DS    0H                                                  0672
*       ELSE                                                       0672
*         ;                         /* RC NOT NORMAL         @XM03HDP*/
@RF00665 DS    0H                                                  0673
*       IF ZCR3270R='1'B THEN       /* IS THIS WHAT YOU CALL YOUR  0673
*                                      3270 - TYPE DEVICE IN RECORD
*                                      MODE ?                @XL03HDP*/
         L     @14,RPHCRR(,RPHPTR)                                 0673
         L     @14,CRACRR(,@14)                                    0673
         TM    ZCR3270R(@14),B'00000010'                           0673
         BNO   @RF00673                                            0673
*         DO;                       /* IF SO.........        @XL03HDP*/
*           CALL ISTZDFQR;          /* ...INVOKE THE FID1 RESPONSE 0675
*                                      FSB FORMATTER         @XL03HDP*/
         L     @14,ATCZPSVT(,VTCVTREG)                             0675
         L     @15,ZPSZDFQR(,@14)                                  0675
         BALR  @14,@15                                             0675
*           IF BDUCOMND=BCMDD&      /* DISCONNECT SHIPPED    @XL03HDP*/
*               LCPATOP='1'B THEN   /* FOR PURGE             @ZA28604*/
         CLI   BDUCOMND+62(BFRREG),X'07'                           0676
         BNE   @RF00676                                            0676
         TM    LCPATOP(ELEMREG),B'00000001'                        0676
         BNO   @RF00676                                            0676
*             DO;                   /* IF SO....             @XL03HDP*/
*               FSBMJRCD=FRCLRRSP;  /* DUMMY UP RETURN       @XL03HDP*/
         MVI   FSBMJRCD(FSBPTR),X'31'                              0678
*               FSBATOP='1'B;       /* BIT CHECKED BY ISTZAC1R     0679
*                                                            @ZA25404*/
         OI    FSBATOP(FSBPTR),B'00000001'                         0679
*               FSBMNRCD=LCPZMIRC;  /* CODES FOR CLEAR COMPLETION  0680
*                                                            @XM17959*/
         MVC   FSBMNRCD(1,FSBPTR),LCPZMIRC(ELEMREG)                0680
*             END;                  /* SO MUCH FOR DISCONNECT        */
*           ELSE                                                   0682
*             ;                     /* NOT A DISCONNECT      @XL03HDP*/
@RF00676 DS    0H                                                  0683
*         END;                      /* DONE WITH 3270 REC@XL03HDP    */
*       ELSE                                                       0684
*         ;                         /* WASNT 3270 RECORD     @XL03HDP*/
@RF00673 DS    0H                                                  0685
*       ZIBFDBS=ZIBFDBZ;            /* MOVE TPIOS FDB TO SYSTEM FDB  */
         MVC   ZIBFDBS(12,BFRREG),ZIBFDBZ(BFRREG)                  0685
*       RFY                                                        0686
*         ISTFDB BASED(ADDR(ZIBFDBS));                             0686
*       FDBOFSET=ADDR(ZIBFDBS)-ADDR(ZIBFDBZ);/* RECOMPUTE OFFSET     */
         LA    @14,ZIBFDBS(,BFRREG)                                0687
         SLR   @14,BFRREG                                          0687
         STH   @14,FDBOFSET+48(,BFRREG)                            0687
*/*  TPQUE (ADDR(ZIBFSB),FMCPAB2) NORM                               */
*                                                                  0688
*       DO;                                                        0688
*         RFY                                                      0689
*          (GPR00P,                                                0689
*           GPR01P,                                                0689
*           GPR04P,                                                0689
*           GPR05P,                                                0689
*           GPR15P) RSTD;                                          0689
*         GEN REFS(GPR01P) SETS(RPHWORK)                           0690
*             (STM GPR02P,GPR08P,RPHWORK(GPR01P));                 0690
         STM GPR02P,GPR08P,RPHWORK(GPR01P)
*         GPR00P=0;                                                0691
         SLR   GPR00P,GPR00P                                       0691
*         GPR15P=ADDR(FMCPAB2);     /* HOLD PAB PTR                  */
         LA    GPR15P,FMCPAB2(,FMCBREG)                            0692
*         GPR04P=ADDR(ZIBFSB);      /* WORK ELE PTR                  */
         LA    GPR04P,ZIBFSB(,BFRREG)                              0693
*         GPR05P=GPR15P;            /* PASS PAB PTR                  */
         LR    GPR05P,GPR15P                                       0694
*         CALL ATCLCPTR->ATCAP37->ISTAPC37;                        0695
         L     @14,ATCLCPTR                                        0695
         L     @15,ATCAP37(,@14)                                   0695
         BALR  @14,@15                                             0695
*         GEN(NOPR  0)                                             0696
*         NOSETS NOREFS;                                           0696
         NOPR  0
*         RFY                                                      0697
*          (GPR00P,                                                0697
*           GPR01P,                                                0697
*           GPR04P,                                                0697
*           GPR05P,                                                0697
*           GPR15P) UNRSTD;                                        0697
*       END;                        /* *** END OF TPQUE GENERATION 0698
*                                      QUEUE FSB TO CLIP             */
*     END;                          /*                       @XA07962*/
*   RFY                                                            0700
*     LNKREG RSTD;                  /* RESTRICT REGISTER      @X03HDP*/
@RC00644 DS    0H                                                  0701
*   LNKREG=ZCRSVF7;                 /* RESTORE RETURN REG            */
         L     @11,RPHCRR(,RPHPTR)                                 0701
         L     @11,CRACRR(,@11)                                    0701
         L     LNKREG,ZCRSVF7(,@11)                                0701
*   RFY                                                            0702
*     LNKREG UNRSTD;                /* RELEASE REGISTER       @X03HDP*/
*   END TPOST;                                                     0703
@EL00003 DS    0H                                                  0703
@EF00003 DS    0H                                                  0703
@ER00003 BR    @14                                                 0703
*                                                                  0704
*/*    THE HOUSKEEP SUBROUTINE IS CALLED TO DETERMINE IF PROCESSING  */
*/* IS COMPLETE. IF THE NCP IS COMPLETE, THE REQUEST COUNT IS        */
*/* DECREMENTED, THE WAIT ELEMENT DEQUEUED FROM THE FMCB AND         */
*/* DEALLOCATED IF IT WAS AN LSCB.                                   */
*/*    IF THE REQUEST IS NOT COMPLETE,A TPFEL IS ISSUED TO GET THE   */
*/* ADDRESS OF THE OLDEST FSB NOW ON THE QUEUE AND THE ADDRESS       */
*/* ADJUSTED TO POINT TO ZIBUF.                                      */
*/*                                                                  */
*                                                                  0704
*HOUSKP:                                                           0704
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0704
HOUSKP   DS    0H                                                  0705
*   RFY                                                            0705
*     LNKREG RSTD;                  /* RESTRICT REGISTER      @X03HDP*/
*   ZCRSVF7=LNKREG;                 /* RESTORE RETURN REG            */
         L     @11,RPHCRR(,RPHPTR)                                 0706
         L     @11,CRACRR(,@11)                                    0706
         ST    LNKREG,ZCRSVF7(,@11)                                0706
*   RFY                                                            0707
*     LNKREG UNRSTD;                /* RELEASE REGISTER       @X03HDP*/
*   IF(FSBPTR&REQCOMP)^=0 THEN      /* NCP IS COMPLETE               */
         L     @14,@CF01971                                        0708
         LR    @00,FSBPTR                                          0708
         NR    @00,@14                                             0708
         LTR   @00,@00                                             0708
         BZ    @RF00708                                            0708
*     DO;                                                          0709
*       DNCACIP=DNCACIP-1;          /* DECREMENT REQUEST COUNT       */
         SLR   @00,@00                                             0710
         IC    @00,DNCACIP(,DNCBPTR)                               0710
         BCTR  @00,0                                               0710
         STC   @00,DNCACIP(,DNCBPTR)                               0710
*/* TPDEQ (ELEMREG,FMCLCPBQ)                                         */
*                                                                  0711
*       DO;                         /* BEGIN TPDEQ CODE GENERATION   */
*         RFY                                                      0712
*          (GPR00P,                                                0712
*           GPR01P,                                                0712
*           GPR14P,                                                0712
*           GPR15P) RSTD;                                          0712
*         GPR15P=ADDR(FMCLCPBQ);    /* ADDRESS QUEUE POINTER         */
         LA    GPR15P,FMCLCPBQ(,FMCBREG)                           0713
*         RFY                                                      0714
*          (GPR02P,                                                0714
*           GPR03P) RSTD;                                          0714
*         STM(GPR02P,GPR03P,GPR01P->RPHWORK(5:12));                0715
         STM   GPR02P,GPR03P,RPHWORK+4(GPR01P)                     0715
*         GPR03P=ELEMREG×FMZCA020;                                 0716
         L     @11,@CF01971                                        0716
         LR    GPR03P,ELEMREG                                      0716
         OR    GPR03P,@11                                          0716
*         GPR14P=FMZCA020;                                         0717
         LR    GPR14P,@11                                          0717
*         GPR15P=ADDR(GPR15P->PABWEQA);                            0718
*         GPR02P=GPR15P->PABWEQA×FMZCA020;                         0719
         O     @11,PABWEQA(,GPR15P)                                0719
         LR    GPR02P,@11                                          0719
*         DO WHILE(GPR02P^=GPR14P);                                0720
         B     @DE00720                                            0720
@DL00720 DS    0H                                                  0721
*FMZL2034:                                                         0721
*           ;                                                      0721
FMZL2034 DS    0H                                                  0722
*           IF GPR02P=GPR03P THEN                                  0722
         CR    GPR02P,GPR03P                                       0722
         BNE   @RF00722                                            0722
*             DO;                                                  0723
*               GPR00P=GPR02P->WKECHAIN;                           0724
         L     GPR00P,WKECHAIN(,GPR02P)                            0724
*               CS(GPR02P,GPR00P,GPR15P->PABWEQA);                 0725
         CS    GPR02P,@00,PABWEQA(GPR15P)                          0725
*               BC(7,FMZL3034);                                    0726
         BC    7,FMZL3034                                          0726
*               GPR14P=GPR02P;                                     0727
         LR    GPR14P,GPR02P                                       0727
*               GPR14P->WKECHAIN=0;                                0728
         SLR   @11,@11                                             0728
         ST    @11,WKECHAIN(,GPR14P)                               0728
*             END;                                                 0729
*           ELSE                                                   0730
*             DO;                                                  0730
         B     @RC00722                                            0730
@RF00722 DS    0H                                                  0731
*               IF(GPR02P->WKECHAIN)=GPR14P THEN                   0731
         L     @11,WKECHAIN(,GPR02P)                               0731
         CR    @11,GPR14P                                          0731
         BE    @RT00731                                            0731
*                 GOTO ISTA0034;                                   0732
*               ELSE                                               0733
*                 DO;                                              0733
*                   GPR15P=ADDR(GPR02P->WKECHAIN);                 0734
         LA    GPR15P,WKECHAIN(,GPR02P)                            0734
*                   GPR02P=GPR02P->WKECHAIN;                       0735
         LR    GPR02P,@11                                          0735
*                   GOTO FMZL2034;                                 0736
         B     FMZL2034                                            0736
*                 END;                                             0737
*             END;                                                 0738
*FMZL3034:                                                         0739
*           ;                                                      0739
@RC00722 DS    0H                                                  0739
FMZL3034 DS    0H                                                  0740
*         END;                                                     0740
@DE00720 CR    GPR02P,GPR14P                                       0740
         BNE   @DL00720                                            0740
*ISTA0034:                                                         0741
*         ;                                                        0741
ISTA0034 DS    0H                                                  0742
*         LM(GPR02P,GPR03P,GPR01P->RPHWORK(5:12));                 0742
         LM    GPR02P,GPR03P,RPHWORK+4(GPR01P)                     0742
*         RFY                                                      0743
*          (GPR02P,                                                0743
*           GPR03P) UNRSTD;                                        0743
*         GPR14P=GPR14P&FMZCB020;                                  0744
         N     GPR14P,@CF01969                                     0744
*         GPR01P->RPHWEA=GPR14P;                                   0745
         ST    GPR14P,RPHWEA(,GPR01P)                              0745
*         RFY                                                      0746
*          (GPR00P,                                                0746
*           GPR01P,                                                0746
*           GPR14P,                                                0746
*           GPR15P) UNRSTD;                                        0746
*       END;                        /* END TPDEQ GENERATION          */
*                                                                  0747
*       /*************************************************************/
*       /*                                                           */
*       /* DEQ ELEMENT FROM FMCB                                     */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0748
*       IF LSCTYPE^=LSTYPE THEN                                    0748
         CLI   LSCTYPE(ELEMREG),X'DF'                              0748
         BNE   @RT00748                                            0748
*         ;                         /* ELEMENT AN LCPB               */
*       ELSE                                                       0750
*         DO;                                                      0750
*           ZCRPCOD1=0;             /* CLEAR DEALLOCATION FLAGS      */
         L     @14,RPHCRR(,RPHPTR)                                 0751
         L     @14,CRACRR(,@14)                                    0751
         MVI   ZCRPCOD1(@14),X'00'                                 0751
*           ZCRPLSCB=ON;            /* LSCB RELEASE                  */
         OI    ZCRPLSCB(@14),B'00001000'                           0752
*           CALL ISTZDFB0;          /* LSCB DEALLOCATION ROUTINE     */
         L     @14,ATCZPSVT(,VTCVTREG)                             0753
         L     @15,ZPSZDFB0(,@14)                                  0753
         BALR  @14,@15                                             0753
*         END;                                                     0754
*     END;                                                         0755
*   ELSE                            /* MORE FSBS                     */
*     DO;                                                          0756
*                                                                  0756
         B     @RC00708                                            0756
@RF00708 DS    0H                                                  0757
*/* TPFEL (,LSCFDBA) RETPTR(BFRREG)                                  */
*                                                                  0757
*       DO;                         /* BEGIN TPFEL CODE GENERATION   */
*         RFY                                                      0758
*          (GPR00P,                                                0758
*           GPR01P,                                                0758
*           GPR14P,                                                0758
*           GPR15P) RSTD;                                          0758
*         GPR15P=ADDR(LSCFDBA);     /* ADDRESS QUEUE POINTER         */
         LA    GPR15P,LSCFDBA(,ELEMREG)                            0759
*         GPR14P=GPR15P->PABWEQA×FMZCA020;                         0760
         L     @11,@CF01971                                        0760
         L     GPR14P,PABWEQA(,GPR15P)                             0760
         OR    GPR14P,@11                                          0760
*         IF GPR14P=FMZCA020 THEN                                  0761
         CLR   GPR14P,@11                                          0761
         BE    @RT00761                                            0761
*           ;                                                      0762
*         ELSE                                                     0763
*           DO;                                                    0763
*             GPR00P=FMZCA020;      /* INITIALIZE QUIT FLAG          */
         L     GPR00P,@CF01971                                     0764
*             DO WHILE(GPR00P^=GPR14P->WKECHAIN);                  0765
         B     @DE00765                                            0765
@DL00765 DS    0H                                                  0766
*               GPR14P=GPR14P->WKECHAIN;/* SEARCH FOR END OF CHAIN   */
         L     GPR14P,WKECHAIN(,GPR14P)                            0766
*             END;                                                 0767
@DE00765 C     GPR00P,WKECHAIN(,GPR14P)                            0767
         BNE   @DL00765                                            0767
*           END;                                                   0768
*         GPR14P=GPR14P&FMZCB020;                                  0769
@RT00761 N     GPR14P,@CF01969                                     0769
*         BFRREG=GPR14P;                                           0770
         LR    BFRREG,GPR14P                                       0770
*         RFY                                                      0771
*          (GPR00P,                                                0771
*           GPR01P,                                                0771
*           GPR14P,                                                0771
*           GPR15P) UNRSTD;                                        0771
*       END;                        /* END TPFEL GENERATION          */
*       IF BFRREG=0 THEN                                           0773
         LTR   BFRREG,BFRREG                                       0773
         BZ    @RT00773                                            0773
*         ;                         /* NOIMORE FSBS                  */
*       ELSE                                                       0775
*         BFRREG=BFRREG-LENGTH(ZIBAIOCM);                          0775
*                                                                  0775
         SH    BFRREG,@CH00806                                     0775
*       /*************************************************************/
*       /*                                                           */
*       /* POINT TO ZIBUF                                            */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0776
*     END;                                                         0776
@RT00773 DS    0H                                                  0777
*   RFY                                                            0777
*     LNKREG RSTD;                  /* RESTRICT REGISTER      @X03HDP*/
@RC00708 DS    0H                                                  0778
*   LNKREG=ZCRSVF7;                 /* RESTORE RETURN REG            */
         L     @11,RPHCRR(,RPHPTR)                                 0778
         L     @11,CRACRR(,@11)                                    0778
         L     LNKREG,ZCRSVF7(,@11)                                0778
*   RFY                                                            0779
*     LNKREG UNRSTD;                /* RELEASE REGISTER       @X03HDP*/
*   END HOUSKP;                                                    0780
@EL00004 DS    0H                                                  0780
@EF00004 DS    0H                                                  0780
@ER00004 BR    @14                                                 0780
*                                                                  0781
*/*    XITCODE SETS THE RETURN CODE TO BE PASSED BACK TO REQUEST     */
*/* COMPLETION. IF THE REQUEST IS COMPLETE, THE RETURN CODE IS SET   */
*/* TO 16, IF THERE IS ANOTHER FSB TO PROCESS. A CODE OF 12 IS SET,  */
*/* OTHERWISE,THE CODE IS SET TO 20.                                 */
*/*                                                                  */
*                                                                  0781
*XITCODE:                                                          0781
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0781
XITCODE  DS    0H                                                  0782
*   RFY                                                            0782
*     LNKREG RSTD;                  /* RESTRICT REGISTER      @X03HDP*/
*   ZCRSVF7=LNKREG;                 /* SAVE RETURN REG               */
         L     @11,RPHCRR(,RPHPTR)                                 0783
         L     @11,CRACRR(,@11)                                    0783
         ST    LNKREG,ZCRSVF7(,@11)                                0783
*   RFY                                                            0784
*     LNKREG UNRSTD;                /* RELEASE REGISTER       @X03HDP*/
*   RCDREG=ZCRSRCHQ;                /* SET R.C. TO SEARCH FOR WORK   */
         LA    RCDREG,16                                           0785
*   IF(FSBPTR&REQCOMP)^=0 THEN                                     0786
         LR    @14,FSBPTR                                          0786
         N     @14,@CF01971                                        0786
         LTR   @14,@14                                             0786
         BNZ   @RT00786                                            0786
*     ;                             /* NCP COMPLETED                 */
*   ELSE                                                           0788
*     DO;                                                          0788
*       RCDREG=ZCREXIT;             /* SET R.C. TO EXIT REQ COMPL    */
         LA    RCDREG,20                                           0789
*       IF BFRREG=0 THEN                                           0790
         LTR   BFRREG,BFRREG                                       0790
         BZ    @RT00790                                            0790
*         ;                         /* NO MORE FSBS                  */
*       ELSE                                                       0792
*         RCDREG=ZCRMRFSB;          /* MORE FSBS TO PROCESS          */
         LA    RCDREG,12                                           0792
*     END;                                                         0793
@RT00790 DS    0H                                                  0794
*   RFY                                                            0794
*     LNKREG RSTD;                  /* RESTRICT REGISTER      @X03HDP*/
@RT00786 DS    0H                                                  0795
*   LNKREG=ZCRSVF7;                 /* RESTORE RETURN REG            */
         L     @11,RPHCRR(,RPHPTR)                                 0795
         L     @11,CRACRR(,@11)                                    0795
         L     LNKREG,ZCRSVF7(,@11)                                0795
*   RFY                                                            0796
*     LNKREG UNRSTD;                /* RELEASE REGISTER       @X03HDP*/
*   END XITCODE;                                                   0797
@EL00005 DS    0H                                                  0797
@EF00005 DS    0H                                                  0797
@ER00005 BR    @14                                                 0797
*                                                                  0798
*/********************************************************************/
*/*                                                                  */
*/* FSBDEQ: THIS ROUTINE REMOVES THE OLDEST FSB FROM THE WAITQ       */
*/*         ELEMENT.                                                 */
*/*                                                                  */
*/*         THE S/D CODE FOR FSBDEQ IS SHOWN AT RIGHT:       @XL03HEK*/
*/*                                                                  */
*/********************************************************************/
*                                                                  0798
*FSBDEQ:                                                           0798
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0798
FSBDEQ   DS    0H                                                  0799
*   RFY                                                            0799
*     LNKREG RSTD;                                                 0799
*   ZCRSVF8=LNKREG;                 /* SAVE RETURN ADDRESS           */
         L     @11,RPHCRR(,RPHPTR)                                 0800
         L     @11,CRACRR(,@11)                                    0800
         ST    LNKREG,ZCRSVF8(,@11)                                0800
*   RFY                                                            0801
*     LNKREG UNRSTD;                                               0801
*                                                                  0801
*/* REMOVE OLDEST FSB FROM WAITQ ELEMENT (NO RETURN POINTER NEEDED)  */
*/* TPDEQ (,LSCFDBA)                                                 */
*                                                                  0802
*   DO;                             /* BEGIN TPDEQ CODE GENERATION   */
*     RFY                                                          0803
*      (GPR00P,                                                    0803
*       GPR01P,                                                    0803
*       GPR14P,                                                    0803
*       GPR15P) RSTD;                                              0803
*     GPR15P=ADDR(LSCFDBA);         /* ADDRESS QUEUE POINTER         */
         LA    GPR15P,LSCFDBA(,ELEMREG)                            0804
*     GPR14P=GPR15P->PABWEQA×FMZCA020;                             0805
         L     @11,@CF01971                                        0805
         L     GPR14P,PABWEQA(,GPR15P)                             0805
         OR    GPR14P,@11                                          0805
*     IF GPR14P=FMZCA020 THEN                                      0806
         CLR   GPR14P,@11                                          0806
         BE    @RT00806                                            0806
*       ;                                                          0807
*     ELSE                                                         0808
*       DO;                                                        0808
*FMZL1044:                                                         0809
*         ;                                                        0809
FMZL1044 DS    0H                                                  0810
*         DO WHILE(GPR14P->WKECHAIN^=FMZCA020);                    0810
         B     @DE00810                                            0810
@DL00810 DS    0H                                                  0811
*           GPR15P=ADDR(GPR14P->WKECHAIN);                         0811
         LA    GPR15P,WKECHAIN(,GPR14P)                            0811
*           GPR14P=GPR15P->PABWEQA;                                0812
         L     GPR14P,PABWEQA(,GPR15P)                             0812
*         END;                                                     0813
@DE00810 L     @11,@CF01971                                        0813
         CL    @11,WKECHAIN(,GPR14P)                               0813
         BNE   @DL00810                                            0813
*         GPR00P=FMZCA020;                                         0814
         LR    GPR00P,@11                                          0814
*         CS(GPR14P,GPR00P,GPR15P->PABWEQA);                       0815
         CS    GPR14P,@00,PABWEQA(GPR15P)                          0815
*         BC(7,FMZL1044);                                          0816
         BC    7,FMZL1044                                          0816
*         GPR14P->WKECHAIN=0;                                      0817
         SLR   @11,@11                                             0817
         ST    @11,WKECHAIN(,GPR14P)                               0817
*       END;                                                       0818
*ISTA0044:                                                         0819
*     ;                                                            0819
@RT00806 DS    0H                                                  0819
ISTA0044 DS    0H                                                  0820
*     GPR14P=GPR14P&FMZCB020;                                      0820
         N     GPR14P,@CF01969                                     0820
*     GPR01P->RPHWEA=GPR14P;                                       0821
         ST    GPR14P,RPHWEA(,GPR01P)                              0821
*     RFY                                                          0822
*      (GPR00P,                                                    0822
*       GPR01P,                                                    0822
*       GPR14P,                                                    0822
*       GPR15P) UNRSTD;                                            0822
*   END;                            /* END TPDEQ GENERATION          */
*   RFY                                                            0824
*     LNKREG RSTD;                                                 0824
*   LNKREG=ZCRSVF8;                 /* RESTORE RETURN ADDRESS        */
         L     @11,RPHCRR(,RPHPTR)                                 0825
         L     @11,CRACRR(,@11)                                    0825
         L     LNKREG,ZCRSVF8(,@11)                                0825
*   RFY                                                            0826
*     LNKREG UNRSTD;                                               0826
*   END FSBDEQ;                                                    0827
*                                                                  0827
@EL00006 DS    0H                                                  0827
@EF00006 DS    0H                                                  0827
@ER00006 BR    @14                                                 0827
*/* TPEPILOG                                                         */
*                                                                  0828
*   GEN(PRINT OFF);                                                0828
         PRINT OFF
*   DCL                                                            0829
*     ISTAPC34 ENTRY BASED(ATCAP34) VALRG(*);/* RESET ROUTINE        */
*   DCL                                                            0830
*     ISTAPC37 ENTRY BASED(ATCAP37) VALRG(*);/* TPQUE ROUTINE        */
*   GEN(PRINT ON);                                                 0831
*                                                                  0831
         PRINT ON
*/* END OF TPEPILOG                                                  */
*                                                                  0832
*   END ISTZIFOB                                                   0832
*                                                                  0832
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */
*/*%INCLUDE SYSLIB  (CVT     )                                       */
*                                                                  0832
*       ;                                                          0832
@EL00001 DS    0H                                                  0832
@EF00001 DS    0H                                                  0832
@ER00001 BR    @14                                                 0832
@DATA    DS    0H
@CH00052 DC    H'4'
@CH00058 DC    H'8'
@CH00806 DC    H'16'
@DATD    DSECT
         DS    0F
ISTZIFOB CSECT
         DS    0F
@CF01969 DC    XL4'7FFFFFFF'
@CF01971 DC    XL4'80000000'
@DATD    DSECT
         DS    0D
CVTPTR   DS    A
LCPBPTR  DS    A
BDUPTR   DS    A
BTUPTR   DS    A
FMCBPTR  DS    A
WKEPTR   DS    A
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA
@ENDDATD EQU   *
ISTZIFOB CSECT
         DS    0F
@SIZDATD DC    AL1(0)
         DC    AL3(@ENDDATD-@DATD)
         DS    0D
@CC02455 DC    C'RECORD  '
@CC03704 DC    C'ICOB'
@00      EQU   00                      EQUATES FOR REGISTERS 0-15
@01      EQU   01
@02      EQU   02
@03      EQU   03
@04      EQU   04
@05      EQU   05
@06      EQU   06
@07      EQU   07
@08      EQU   08
@09      EQU   09
@10      EQU   10
@11      EQU   11
@12      EQU   12
@13      EQU   13
@14      EQU   14
@15      EQU   15
RPHPTR   EQU   @01
FSBPTR   EQU   @08
DNCBPTR  EQU   @04
VTCVTREG EQU   @02
ICNCBREG EQU   @03
FMCBREG  EQU   @05
BFRREG   EQU   @06
ELEMREG  EQU   @07
LCCWREG  EQU   @09
CMP1     EQU   @10
CDREG    EQU   @12
SAVREG   EQU   @13
LNKREG   EQU   @14
RCDREG   EQU   @15
GPR00F   EQU   @00
GPR00P   EQU   @00
GPR01P   EQU   @01
GPR02P   EQU   @02
GPR03P   EQU   @03
GPR04P   EQU   @04
GPR05P   EQU   @05
GPR07P   EQU   @07
GPR12P   EQU   @12
GPR13P   EQU   @13
GPR14P   EQU   @14
GPR15P   EQU   @15
CMP2     EQU   @11
GPR01F   EQU   @01
GPR02F   EQU   @02
GPR03F   EQU   @03
GPR04F   EQU   @04
GPR05F   EQU   @05
GPR06F   EQU   @06
GPR06P   EQU   @06
GPR07F   EQU   @07
GPR08F   EQU   @08
GPR08P   EQU   @08
GPR09F   EQU   @09
GPR09P   EQU   @09
GPR10F   EQU   @10
GPR10P   EQU   @10
GPR11F   EQU   @11
GPR11P   EQU   @11
GPR12F   EQU   @12
GPR13F   EQU   @13
GPR14F   EQU   @14
GPR15F   EQU   @15
ATCLCPTR EQU   1032
CVTMAP   EQU   0
CVTDAR   EQU   CVTMAP+72
CVTFLGS1 EQU   CVTDAR
CVTDCB   EQU   CVTMAP+116
CVTIERLC EQU   CVTMAP+144
CVTOPTA  EQU   CVTMAP+182
CVTOPTB  EQU   CVTMAP+183
CVTGTF   EQU   CVTMAP+236
CVTGTFST EQU   CVTGTF
CVTGTFS  EQU   CVTGTFST
CVTSTATE EQU   CVTGTFST
CVTTMODE EQU   CVTGTFST
CVTFORM  EQU   CVTGTFST
CVTAQAVT EQU   CVTMAP+240
CVTTCMFG EQU   CVTAQAVT
CVTVOLM2 EQU   CVTMAP+244
CVTTATA  EQU   CVTVOLM2
CVTTSKS  EQU   CVTTATA
CVTVOLF2 EQU   CVTTSKS
CVTTAT   EQU   CVTTATA+1
CVTATER  EQU   CVTMAP+248
CVTEXT1  EQU   CVTMAP+252
CVTPURG  EQU   CVTMAP+260
CVTQMSG  EQU   CVTMAP+268
CVTDMSR  EQU   CVTMAP+272
CVTRSV37 EQU   CVTDMSR
CVTDMSRF EQU   CVTRSV37
CVTERPV  EQU   CVTMAP+316
CVTINTLA EQU   CVTMAP+320
CVTAPF   EQU   CVTMAP+324
CVTEXT2  EQU   CVTMAP+328
CVTHJES  EQU   CVTMAP+332
CVTPGSIA EQU   CVTMAP+348
CVTA1F1  EQU   CVTMAP+356
CVTSYSK  EQU   CVTMAP+357
CVTVOLM1 EQU   CVTMAP+380
CVTVOLF1 EQU   CVTVOLM1
CVTATMCT EQU   CVTMAP+388
CVTXTNT1 EQU   0
CVTXTNT2 EQU   0
CVTDSSV  EQU   CVTXTNT2
CVTFLGBT EQU   CVTXTNT2+5
CVTQID   EQU   CVTXTNT2+24
CVTSHS   EQU   CVTXTNT2+40
CVTRV400 EQU   CVTXTNT2+52
CVTRV409 EQU   CVTXTNT2+53
CVTATCVT EQU   CVTXTNT2+64
CVTRV429 EQU   CVTXTNT2+84
CVTRV438 EQU   CVTXTNT2+85
CVTRV457 EQU   CVTXTNT2+112
CVTRV466 EQU   CVTXTNT2+113
CVTFIX   EQU   0
CVTRELNO EQU   CVTFIX+252
ISTRPH   EQU   0
RPHCNTL  EQU   ISTRPH
RPHFLAGS EQU   RPHCNTL+2
RPHAPTYP EQU   RPHFLAGS
RPHFSTLC EQU   RPHFLAGS
RPHFLGB  EQU   RPHCNTL+3
RPHRPHA  EQU   ISTRPH+4
RPHTSKID EQU   ISTRPH+8
RPHRESMA EQU   ISTRPH+16
RPHWPFLG EQU   RPHRESMA
RPHWEA   EQU   ISTRPH+24
RPHCSPA  EQU   RPHWEA
RPHSRPRM EQU   ISTRPH+28
RPHCRR   EQU   ISTRPH+32
RPHPABQA EQU   ISTRPH+36
RPHWORK  EQU   ISTRPH+40
RPHSAVE1 EQU   RPHWORK
RPHSBITS EQU   RPHSAVE1+1
ISTLCCW  EQU   0
LCCWOP   EQU   ISTLCCW
LCCWRWOP EQU   LCCWOP
LCCWCTL  EQU   LCCWRWOP
LCCWFLAG EQU   ISTLCCW+1
LCCWLSI  EQU   LCCWFLAG
ISTLCPB  EQU   0
LCPREQTG EQU   ISTLCPB+2
LCPFLAGS EQU   LCPREQTG
LCPZF001 EQU   LCPFLAGS
LCPZRT02 EQU   LCPZF001
LCPZF002 EQU   LCPFLAGS
LCPZRT03 EQU   LCPZF002
LCPZF003 EQU   LCPFLAGS
LCPZRT04 EQU   LCPZF003
LCPZF004 EQU   LCPFLAGS
LCPZRT05 EQU   LCPZF004
LCPZRT06 EQU   LCPFLAGS
LCPZRT07 EQU   LCPFLAGS
LCPMNRCD EQU   LCPREQTG+1
LCPZRT08 EQU   LCPMNRCD
LCPZRT09 EQU   LCPMNRCD
LCPCHAIN EQU   ISTLCPB+4
LCPCHAI1 EQU   LCPCHAIN
LCPRUCNT EQU   ISTLCPB+8
LCPZMIRC EQU   LCPRUCNT
LCPFLAG2 EQU   ISTLCPB+9
LCPTLBPI EQU   LCPFLAG2
LCPFID0  EQU   LCPFLAG2
LCPATOP  EQU   LCPFLAG2
LCPSEQ   EQU   ISTLCPB+10
LCPCID   EQU   ISTLCPB+16
LCPNXLCW EQU   ISTLCPB+20
LCPFDBA  EQU   ISTLCPB+24
LCPFLG1  EQU   ISTLCPB+37
LCPFLCCW EQU   ISTLCPB+40
LCPLCCW  EQU   ISTLCPB+48
LCPPABA  EQU   LCPLCCW+4
LCPRPHA  EQU   LCPPABA
ISTLSCB  EQU   0
LSC1WORD EQU   ISTLSCB
LSCTYPE  EQU   LSC1WORD
LSCREQTG EQU   LSC1WORD+2
LSCZRT02 EQU   LSCREQTG
LSCZRT03 EQU   LSCREQTG
LSCZRT04 EQU   LSCREQTG
LSCZRT05 EQU   LSCREQTG
LSCZRT06 EQU   LSCREQTG
LSCZRT07 EQU   LSCREQTG
LSCZMNRC EQU   LSCREQTG+1
LSCZRT08 EQU   LSCZMNRC
LSCZRT09 EQU   LSCZMNRC
LSCCHAIN EQU   ISTLSCB+4
LSCCHAI1 EQU   LSCCHAIN
LSCRUCNT EQU   ISTLSCB+8
LSCFLGS  EQU   ISTLSCB+9
LSCEXRES EQU   LSCFLGS
LSCSEQ   EQU   ISTLSCB+10
LSCLCPBA EQU   ISTLSCB+16
LSCLCCWA EQU   ISTLSCB+20
LSCFDBA  EQU   ISTLSCB+24
ISTBDU   EQU   0
BDUCOMND EQU   ISTBDU
BDUMODIF EQU   ISTBDU+1
BDUMOD1  EQU   BDUMODIF
BDUDAF   EQU   ISTBDU+2
BDUFUNC  EQU   BDUDAF
BDUCHECK EQU   BDUFUNC
BDUFLAGS EQU   BDUDAF+1
ISTBTU   EQU   0
BTUBTH   EQU   ISTBTU
BTUFID   EQU   BTUBTH
BTUDEST  EQU   BTUBTH+2
BTUSORCE EQU   BTUBTH+4
BTUREQ   EQU   BTUBTH+6
BTURQFLG EQU   BTUREQ
BTURH    EQU   BTUBTH+10
BTUBDU   EQU   ISTBTU+14
BTUSYSTR EQU   ISTBTU+18
BTUTEXT  EQU   ISTBTU+20
ISTFDB   EQU   0
FDBDATAA EQU   ISTFDB+4
FDBDATCT EQU   ISTFDB+8
FDBOFSET EQU   ISTFDB+10
ISTFSB   EQU   0
FSBFSB   EQU   ISTFSB
FSBMNRCD EQU   FSBFSB+2
FSBSFLGS EQU   FSBFSB+3
FSBFSBA  EQU   FSBFSB+4
FSBBTH   EQU   FSBFSB+8
FSBCID   EQU   FSBBTH
FSBSAF   EQU   FSBCID
FSBDAF   EQU   FSBCID+2
FSBRQTAG EQU   FSBBTH+4
FSBSEQID EQU   FSBRQTAG
FSBFLAGS EQU   FSBSEQID
FSBSEQ   EQU   FSBSEQID+1
FSBCSWST EQU   FSBBTH+6
FSBTHFLD EQU   FSBCSWST
FSBTH1   EQU   FSBTHFLD
FSBSYSRS EQU   FSBTH1
FSBSERR  EQU   FSBSYSRS
FSBSPHSE EQU   FSBSYSRS
FSBSCODE EQU   FSBSYSRS
FSBTH2   EQU   FSBTHFLD+1
FSBEXTRS EQU   FSBTH2
FSBXFSTS EQU   FSBEXTRS
FSBXCODE EQU   FSBEXTRS
FSBNETRS EQU   FSBFSB+16
FSBSRCAT EQU   FSBNETRS
FSBMJRCD EQU   FSBSRCAT
FSBERC   EQU   FSBNETRS+1
FSBFBMI  EQU   FSBERC
FSBDMGRS EQU   FSBFSB+18
FSBSS1   EQU   FSBDMGRS
FSBSS2   EQU   FSBDMGRS+1
FSBLCPB  EQU   FSBFSB+20
FSBMSGID EQU   FSBLCPB
FSBLCCWA EQU   FSBFSB+24
FSBRLSTS EQU   FSBLCCWA
ISTLH    EQU   0
ISTTH    EQU   0
THFLAG1  EQU   ISTTH
THFLGA   EQU   THFLAG1
THMPF    EQU   THFLGA
THFLGB   EQU   THFLAG1+1
ISTTH2   EQU   0
TH2FLAG1 EQU   ISTTH2
TH2MPF   EQU   TH2FLAG1
ISTZIBUF EQU   0
ZIBFSM   EQU   ISTZIBUF+4
ISTPAB   EQU   0
PABWQCHN EQU   ISTPAB
PABWEQA  EQU   PABWQCHN
PABCHAIN EQU   PABWQCHN+4
PABDVTA  EQU   ISTPAB+9
PABRPHFG EQU   ISTPAB+12
PABFLAGS EQU   PABRPHFG
PABERLCK EQU   PABFLAGS
PABERRLK EQU   PABERLCK
ISTDEVCH EQU   0
DEVSHCH  EQU   ISTDEVCH
DEVCHAR  EQU   DEVSHCH
DEVTCODE EQU   ISTDEVCH+1
DEVFLAGS EQU   ISTDEVCH+3
DEVFCCTL EQU   DEVFLAGS
DEVCHAR3 EQU   DEVFLAGS
ISTPROCD EQU   0
PROPROC  EQU   ISTPROCD
PROPROC1 EQU   PROPROC
PROPROC2 EQU   PROPROC+1
PROPROC3 EQU   PROPROC+2
PROPROC4 EQU   PROPROC+3
PROPROCS EQU   0
PROSETMS EQU   PROPROCS+1
PROSETM2 EQU   PROSETMS
PROSETM3 EQU   PROSETMS+1
PROSETM4 EQU   PROSETMS+2
ISTLOK   EQU   0
LOKCHN   EQU   ISTLOK+1
LOKCHNG  EQU   LOKCHN
@NM00018 EQU   LOKCHNG+2
ISTFMCB  EQU   0
FMCSTAT  EQU   ISTFMCB+28
FMCSTAT1 EQU   ISTFMCB+29
FMCCMDFL EQU   ISTFMCB+31
FMCCMPS1 EQU   ISTFMCB+36
FMCMODE  EQU   ISTFMCB+52
FMCPAB2  EQU   ISTFMCB+80
FMCPAB4  EQU   ISTFMCB+112
FMCSIPA  EQU   ISTFMCB+148
FMCNXOSQ EQU   ISTFMCB+152
FMCNXCFM EQU   FMCNXOSQ
FMCNXOSC EQU   FMCNXOSQ+2
FMCSSTAT EQU   ISTFMCB+159
FMCPACE  EQU   ISTFMCB+160
FMCPACEN EQU   FMCPACE
FMCPACEM EQU   FMCPACE+1
FMCPACPC EQU   FMCPACE+2
FMCCVAL  EQU   FMCPACE+3
FMCOBCE  EQU   FMCCVAL
FMCCLEXT EQU   ISTFMCB+164
FMCRPLA  EQU   FMCCLEXT
FMCFBA   EQU   FMCCLEXT+4
FMCCMPS2 EQU   FMCCLEXT+16
FMCFLGA  EQU   FMCCMPS2
FMCFLGCL EQU   FMCCMPS2+1
FMCPSCMD EQU   FMCCMPS2+2
FMCPSTAT EQU   FMCCMPS2+3
FMCSTAT2 EQU   ISTFMCB+186
FMCMODEB EQU   ISTFMCB+189
FMCCLSEQ EQU   ISTFMCB+190
FMCRRESP EQU   ISTFMCB+195
FMCSSEGQ EQU   ISTFMCB+200
FMCFBAS  EQU   ISTFMCB+216
FMCZV002 EQU   FMCFBAS
FMCSNCTL EQU   ISTFMCB+224
FMCSCFLG EQU   FMCSNCTL
FMCVS1   EQU   ISTFMCB+232
FMCZFLAG EQU   FMCVS1
FMCZF006 EQU   FMCZFLAG
FMCZFB06 EQU   FMCZF006
FMCZF010 EQU   FMCZFLAG+2
FMCZF011 EQU   FMCZFLAG+2
FMCZF017 EQU   FMCZFLAG+2
FMCZF020 EQU   FMCZFLAG+3
FMCSHEDQ EQU   FMCVS1+8
FMCLBXM  EQU   FMCVS1+12
FMCSHEAQ EQU   FMCLBXM
FMCLCPBQ EQU   FMCVS1+16
FMCLCPAQ EQU   FMCVS1+20
FMCZX003 EQU   FMCVS1+30
FMCSEQ1  EQU   FMCVS1+34
FMCZFLG2 EQU   FMCVS1+35
FMCCVFLG EQU   FMCVS1+44
FMCFLAG  EQU   0
FMCFLGB  EQU   FMCFLAG
ISTNCB   EQU   0
NCBFLAGS EQU   ISTNCB+24
NCBFRAS  EQU   NCBFLAGS+1
NCBFTRIO EQU   NCBFRAS
NCBFLAG1 EQU   NCBFLAGS+2
NCBDEVCH EQU   ISTNCB+36
ISTDNCB  EQU   0
DNCNCB   EQU   ISTDNCB
DNCOS    EQU   ISTDNCB+56
DNCZFLGS EQU   DNCOS
DNCINVIT EQU   DNCZFLGS
DNCZRSCH EQU   DNCZFLGS
DNCZF006 EQU   DNCZFLGS+1
DNCBSCED EQU   DNCOS+2
DNCACIP  EQU   DNCBSCED+1
ISTZRCVT EQU   0
ZRCZIFHB EQU   ISTZRCVT+80
ZRCZIFGB EQU   ISTZRCVT+84
ZRCZIFIB EQU   ISTZRCVT+92
ZRCZKFCB EQU   ISTZRCVT+112
ISTDYPAB EQU   0
ISTATCVT EQU   0
ATCCOM   EQU   ISTATCVT
ATCSTAT  EQU   ATCCOM
ATCSTAT1 EQU   ATCSTAT
ATCSTFLG EQU   ATCSTAT+1
ATCPOFLG EQU   ATCSTAT+2
ATCSTAT4 EQU   ATCSTAT+3
ATCIOTRC EQU   ATCCOM+140
ATCTHTRC EQU   ATCIOTRC
ATCCSMR  EQU   ISTATCVT+296
ATCSHRFG EQU   ISTATCVT+316
ATCHPGM  EQU   ISTATCVT+384
ATCVLCNT EQU   ISTATCVT+772
ATCRNO   EQU   ISTATCVT+788
ATCSOPD  EQU   ISTATCVT+792
ATCSIPD  EQU   ISTATCVT+800
ATCSECST EQU   ISTATCVT+812
ATCSTAT2 EQU   ISTATCVT+818
ATCVTBAM EQU   ISTATCVT+908
@NM00039 EQU   ATCVTBAM+3
ATCAOSM  EQU   ISTATCVT+912
ATCGSRBQ EQU   ATCAOSM+4
ATCGSRBG EQU   ATCGSRBQ
ATCAP34  EQU   ATCAOSM+32
ATCZPSVT EQU   ATCAOSM+72
ATCICAPP EQU   ATCAOSM+100
ATCLDAPP EQU   ATCAOSM+120
ATCDAPVT EQU   ATCAOSM+140
ATCAP37  EQU   ATCAOSM+264
ATCCRA   EQU   ATCAOSM+280
ATCCRACN EQU   ATCCRA+4
ATCSRB   EQU   ATCAOSM+288
ATCSRBCN EQU   ATCSRB+4
ATCCRPL  EQU   ATCAOSM+296
ATCRPLCN EQU   ATCCRPL+4
ATCSQAFR EQU   ATCAOSM+304
ATCORTBC EQU   ATCSQAFR+4
ATCORSRB EQU   ATCORTBC
@NM00041 EQU   ATCAOSM+332
ATCVTFLG EQU   ATCAOSM+392
ATCZFLAG EQU   ATCAOSM+588
ISTZSAVE EQU   0
ZSAZSVBC EQU   ISTZSAVE
ZSAZSVMS EQU   ZSAZSVBC
ZSAZACTV EQU   ZSAZSVMS
ZSAZSVFC EQU   ISTZSAVE+4
ZSAZSVRR EQU   ISTZSAVE+8
ZSAZSVVR EQU   ISTZSAVE+12
ZSAZTRAC EQU   ISTZSAVE+36
ISTZCRR  EQU   0
ZCRCRR   EQU   ISTZCRR
ZCRFLGS1 EQU   ISTZCRR+12
ZCRFLGS2 EQU   ISTZCRR+13
ZCRSWFLD EQU   ISTZCRR+14
ZCRENDSH EQU   ZCRSWFLD
ZCRNDLCP EQU   ZCRSWFLD
ZCRRESET EQU   ZCRSWFLD
ZCRFLGS3 EQU   ISTZCRR+15
ZCRGENSW EQU   ISTZCRR+16
ZCRPFLGS EQU   ISTZCRR+17
ZCRIBPR  EQU   ISTZCRR+18
ZCRRELK  EQU   ZCRIBPR
ZCR3270R EQU   ZCRIBPR
ZCRSCPSW EQU   ISTZCRR+19
ZCRPARMS EQU   ISTZCRR+24
ZCRFBPTR EQU   ZCRPARMS
ZCRDFRDA EQU   ZCRPARMS+10
ZCRPCOD1 EQU   ZCRPARMS+12
ZCRPLSBF EQU   ZCRPCOD1
ZCRPLSCB EQU   ZCRPCOD1
ZCRPBUF  EQU   ZCRPCOD1
ZCRPCOD2 EQU   ZCRPARMS+13
ZCRSVRTN EQU   ISTZCRR+56
ZCRSVF7  EQU   ZCRSVRTN+24
ZCRSVF8  EQU   ZCRSVRTN+28
ZCRWKARA EQU   ISTZCRR+156
ZCRCIDSV EQU   ISTZCRR+192
ZCRSAFSV EQU   ZCRCIDSV
ZCRDAFSV EQU   ZCRCIDSV+2
ZCRAUDIT EQU   ISTZCRR+440
ZCRENTER EQU   ZCRAUDIT+5
ZCREICOB EQU   ZCRENTER+12
ZCRLCPB  EQU   ISTZCRR+480
ZCRRHRU  EQU   ZCRLCPB
ISTZPSVT EQU   0
ZPSZDFB0 EQU   ISTZPSVT+16
ZPSZBFOB EQU   ISTZPSVT+36
ZPSZDFNB EQU   ISTZPSVT+52
ZPSZDFXR EQU   ISTZPSVT+72
ZPSZDFQR EQU   ISTZPSVT+80
ISTPFCRR EQU   0
PFCCRR   EQU   ISTPFCRR
PFCCRRID EQU   PFCCRR
PFCCRRLN EQU   PFCCRR+2
PFCHDR   EQU   ISTPFCRR+4
PFCCRRO  EQU   PFCHDR
PFCFRRO  EQU   PFCHDR+4
ISTCFCRR EQU   0
CFCAUDIT EQU   ISTCFCRR
CFCNTRD  EQU   CFCAUDIT
CFCCRT   EQU   CFCAUDIT+1
ISTASCRR EQU   0
ASCFLAGS EQU   ISTASCRR+16
ASCFLG1  EQU   ASCFLAGS
ASCFLG2  EQU   ASCFLAGS+2
ASCFLG3  EQU   ASCFLAGS+4
ASCUSRGS EQU   ISTASCRR+28
ISTAPCRR EQU   0
APCATFLG EQU   ISTAPCRR+16
APCRFLG  EQU   ISTAPCRR+18
APCSAVE  EQU   ISTAPCRR+44
APCCOMF  EQU   ISTAPCRR+116
APCCOMF1 EQU   APCCOMF
APC31FLG EQU   ISTAPCRR+132
APC52FLG EQU   ISTAPCRR+133
APC53FLG EQU   ISTAPCRR+134
APC54FLG EQU   ISTAPCRR+135
APC57FLG EQU   ISTAPCRR+136
ISTCRA   EQU   0
CRABASIC EQU   ISTCRA
CRAHDR   EQU   CRABASIC
CRACRR   EQU   CRAHDR
CRALKACT EQU   CRABASIC+8
CRASVC   EQU   ISTCRA+848
CRABUFA  EQU   CRASVC+68
ISTWKE   EQU   0
WKECHAIN EQU   ISTWKE+4
WKEFLAGS EQU   WKECHAIN
ISTZIFIB EQU   0
ISTZIFHB EQU   0
ISTZIFGB EQU   0
ISTZKFCB EQU   0
ISTZDFB0 EQU   0
ISTZDFQR EQU   0
ISTZDFNB EQU   0
ISTZDFXR EQU   0
ISTZBFOB EQU   0
ISTAPC37 EQU   0
ISTAPC34 EQU   0
ZIBSRB   EQU   0
CVTS01   EQU   CVTPGSIA
CVTLPDIA EQU   CVTS01+12
CVTDIRST EQU   CVTLPDIA
CVTSLIDA EQU   CVTS01+24
CVTCTLFG EQU   CVTS01+50
CVTRV210 EQU   CVTS01+424
CVTRV219 EQU   CVTS01+425
CVTRV228 EQU   CVTS01+426
CVTRV237 EQU   CVTS01+427
CVTMFRTR EQU   CVTS01+452
CVTRV262 EQU   CVTS01+468
CVTRV271 EQU   CVTS01+469
CVTRV280 EQU   CVTS01+470
CVTRV289 EQU   CVTS01+471
CVTGSDA  EQU   CVTS01+600
LCPZTIE  EQU   LCPCID
LCPZSNAM EQU   LCPZTIE+8
FSBCOMBN EQU   FSBNETRS
FSBRHFLD EQU   FSBCOMBN+1
FSBRH3   EQU   FSBRHFLD+2
FSBLDFLG EQU   FSBRH3
@NM00010 EQU   FSBRQTAG
ZIBDIO   EQU   ZIBFSM
ZIBCCW2  EQU   ZIBDIO+8
ZIBCPTCC EQU   ZIBCCW2
ZIBAIO   EQU   ISTZIBUF
ZIBAIOCM EQU   ZIBAIO
ZIBFDBZ  EQU   ZIBAIOCM
ZIBFIB   EQU   ZIBAIO+16
ZIBFSB   EQU   ZIBFIB
ZIBMDREC EQU   ZIBFSB+4
ZIBMDRIN EQU   ZIBFSB+28
ZIBBTU   EQU   ZIBFIB+32
ZIBFDBS  EQU   ZIBBTU
@NM00014 EQU   ZIBBTU+12
ZIBFID1  EQU   @NM00014+1
ZIBFITXT EQU   ZIBFID1
ZIBSIB   EQU   ZIBFIB
ZIBREC   EQU   ZIBMDRIN
ZIBRECPL EQU   ZIBREC
ZIBRECHD EQU   ZIBRECPL
ZIBRECRS EQU   ZIBREC+8
ZIBRECDT EQU   ZIBREC+10
ZIBMDRRC EQU   ZIBMDREC
ZIBRCPL  EQU   ZIBMDRRC
ZIBRCDT  EQU   ZIBMDRRC+24
@NM00016 EQU   ZIBBTU
TEMPFLG  EQU   FSBSFLGS
FSBATOP  EQU   TEMPFLG
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS
@NM00060 EQU   TEMPFLG
ZIBTH2   EQU   @NM00016+4
ZIBLH    EQU   @NM00016
ZIBRCTXT EQU   ZIBMDRRC+36
ZIBRCRID EQU   ZIBRCDT+10
ZIBRCNAM EQU   ZIBRCDT+2
ZIBRCUA  EQU   ZIBRCDT
ZIBRCPUI EQU   ZIBRCPL+20
ZIBRCPUN EQU   ZIBRCPL+16
ZIBRCTIM EQU   ZIBRCPL+12
ZIBRCDAT EQU   ZIBRCPL+8
ZIBRCRS1 EQU   ZIBRCPL+6
ZIBRCSID EQU   ZIBRCPL+5
ZIBRCID  EQU   ZIBRCPL+4
ZIBRCSW  EQU   ZIBRCPL+2
ZIBRCSYR EQU   ZIBRCPL+1
ZIBRCL   EQU   ZIBRCPL
ZIBRECTX EQU   ZIBREC+22
ZIBRECID EQU   ZIBRECDT+10
ZIBRECNA EQU   ZIBRECDT+2
ZIBRECUA EQU   ZIBRECDT
ZIBRECSV EQU   ZIBRECRS
ZIBRECDA EQU   ZIBRECPL+4
ZIBRECSI EQU   ZIBRECHD+3
ZIBRECDV EQU   ZIBRECHD+2
ZIBRECFL EQU   ZIBRECHD+1
ZIBRECTY EQU   ZIBRECHD
ZIBTEXT  EQU   ZIBSIB+4
ZIBRSV04 EQU   ZIBSIB
ZIBTEXT2 EQU   ZIBFITXT
ZIBTEXT1 EQU   ZIBFIB+52
@NM00015 EQU   @NM00014
@NM00013 EQU   ZIBMDREC
@NM00012 EQU   ZIBFSB
ZIBLNG2  EQU   ZIBAIOCM+14
ZIBRSV03 EQU   ZIBAIOCM+13
ZIBWKBYT EQU   ZIBAIOCM+12
ZIBCPNPK EQU   ZIBCCW2+6
ZIBRSV02 EQU   ZIBCCW2+5
ZIBCPTPF EQU   ZIBCCW2+4
ZIBCPTCA EQU   ZIBCCW2+1
ZIBCPNPC EQU   ZIBCPTCC
ZIBCPRDK EQU   ZIBDIO+6
ZIBRSV01 EQU   ZIBDIO+5
ZIBCPRDF EQU   ZIBDIO+4
ZIBCPTXA EQU   ZIBDIO+1
ZIBCPRDC EQU   ZIBDIO
FSBRT0B  EQU   @NM00010+1
FSBRT0A  EQU   @NM00010+1
FSBRT09  EQU   @NM00010+1
FSBRT08  EQU   @NM00010+1
FSBRT07  EQU   @NM00010
FSBRT06  EQU   @NM00010
FSBRT05  EQU   @NM00010
FSBRT04  EQU   @NM00010
FSBRT03  EQU   @NM00010
FSBRT02  EQU   @NM00010
FSBRT01  EQU   @NM00010
FSBRT00  EQU   @NM00010
FSBLDCUF EQU   FSBLDFLG
FSBLDSIF EQU   FSBLDFLG
FSBLDSOF EQU   FSBLDFLG
FSBLDEBF EQU   FSBLDFLG
FSBLDBBF EQU   FSBLDFLG
FSBLDFME EQU   FSBLDFLG
FSBLDSCF EQU   FSBLDFLG
FSBLDRMF EQU   FSBLDFLG
FSBRH2   EQU   FSBRHFLD+1
FSBRH1   EQU   FSBRHFLD
FSBALIGN EQU   FSBCOMBN
LCPZTRV4 EQU   LCPZSNAM+4
LCPZTRV1 EQU   LCPZSNAM
LCPZSNA  EQU   LCPZTIE+4
LCPZFMCA EQU   LCPZTIE
CVTRV628 EQU   CVTS01+728
CVTRV627 EQU   CVTS01+724
CVTRV626 EQU   CVTS01+720
CVTRV625 EQU   CVTS01+716
CVTRV624 EQU   CVTS01+712
CVTRV623 EQU   CVTS01+708
CVTRV622 EQU   CVTS01+704
CVTRV621 EQU   CVTS01+700
CVTRV620 EQU   CVTS01+696
CVTRV619 EQU   CVTS01+692
CVTRV618 EQU   CVTS01+688
CVTRV617 EQU   CVTS01+684
CVTRV616 EQU   CVTS01+680
CVTRV615 EQU   CVTS01+676
CVTRV614 EQU   CVTS01+672
CVTRV613 EQU   CVTS01+668
CVTTCASP EQU   CVTS01+664
CVT0PT03 EQU   CVTS01+660
CVT0PT0E EQU   CVTS01+656
CVTIRM   EQU   CVTS01+652
CVTCGK   EQU   CVTS01+648
CVTRV607 EQU   CVTS01+644
CVTRV606 EQU   CVTS01+640
CVTRV605 EQU   CVTS01+636
CVTRV604 EQU   CVTS01+632
CVTEFF02 EQU   CVTS01+628
CVTCBBR  EQU   CVTS01+624
CVTSSCR  EQU   CVTS01+620
CVTEVENT EQU   CVTS01+616
CVTCRCA  EQU   CVTS01+612
CVTTPIO  EQU   CVTS01+608
CVTADV   EQU   CVTS01+604
CVTGSDAB EQU   CVTGSDA
CVTQV3   EQU   CVTS01+596
CVTQV2   EQU   CVTS01+592
CVTQV1   EQU   CVTS01+588
CVTRPT   EQU   CVTS01+584
CVTSSRB  EQU   CVTS01+580
CVTCSDRL EQU   CVTS01+576
CVTEXP1  EQU   CVTS01+572
CVTRMPMT EQU   CVTS01+568
CVTRMPTT EQU   CVTS01+564
CVTVPSA  EQU   CVTS01+560
CVTVSTOP EQU   CVTS01+556
CVTGTFR8 EQU   CVTS01+552
CVTQUIT  EQU   CVTS01+548
CVTVACR  EQU   CVTS01+544
CVTWTCB  EQU   CVTS01+540
CVTSTPRS EQU   CVTS01+536
CVT0PT02 EQU   CVTS01+532
CVTDARCM EQU   CVTS01+528
CVTIRECM EQU   CVTS01+524
CVTJRECM EQU   CVTS01+520
CVTVEMS0 EQU   CVTS01+516
CVTSPFRR EQU   CVTS01+512
CVTRLSTG EQU   CVTS01+508
CVT0TC0A EQU   CVTS01+504
CVTGMBR  EQU   CVTS01+500
CVTLFRM  EQU   CVTS01+496
CVTRMBR  EQU   CVTS01+492
CVTVIOP  EQU   CVTS01+488
CVTRV307 EQU   CVTS01+486
CVTRV306 EQU   CVTS01+484
CVTRV305 EQU   CVTS01+482
CVTRV304 EQU   CVTS01+480
CVTRV303 EQU   CVTS01+478
CVTRV302 EQU   CVTS01+476
CVTTRCA  EQU   CVTS01+472
CVTRV297 EQU   CVTRV289
CVTRV296 EQU   CVTRV289
CVTRV295 EQU   CVTRV289
CVTRV294 EQU   CVTRV289
CVTRV293 EQU   CVTRV289
CVTRV292 EQU   CVTRV289
CVTRV291 EQU   CVTRV289
CVTRV290 EQU   CVTRV289
CVTRV288 EQU   CVTRV280
CVTRV287 EQU   CVTRV280
CVTRV286 EQU   CVTRV280
CVTRV285 EQU   CVTRV280
CVTRV284 EQU   CVTRV280
CVTRV283 EQU   CVTRV280
CVTRV282 EQU   CVTRV280
CVTRV281 EQU   CVTRV280
CVTRV279 EQU   CVTRV271
CVTRV278 EQU   CVTRV271
CVTRV277 EQU   CVTRV271
CVTRV276 EQU   CVTRV271
CVTRV275 EQU   CVTRV271
CVTRV274 EQU   CVTRV271
CVTRV273 EQU   CVTRV271
CVTRV272 EQU   CVTRV271
CVTRV270 EQU   CVTRV262
CVTRV269 EQU   CVTRV262
CVTRV268 EQU   CVTRV262
CVTRV267 EQU   CVTRV262
CVTRV266 EQU   CVTRV262
CVTRV265 EQU   CVTRV262
CVTRV264 EQU   CVTRV262
CVTRV263 EQU   CVTRV262
CVTVFP   EQU   CVTS01+464
CVTVSI   EQU   CVTS01+460
CVTVPSIB EQU   CVTS01+456
CVTMFACT EQU   CVTMFRTR
CVTMFCTL EQU   CVTS01+448
CVTPVBP  EQU   CVTS01+444
CVTPWI   EQU   CVTS01+440
CVTRV254 EQU   CVTS01+438
CVTRV253 EQU   CVTS01+436
CVTRV252 EQU   CVTS01+434
CVTRV251 EQU   CVTS01+433
CVTRV250 EQU   CVTS01+432
CVTRV249 EQU   CVTS01+431
CVTRV248 EQU   CVTS01+430
CVTRV247 EQU   CVTS01+429
CVTRV246 EQU   CVTS01+428
CVTRV245 EQU   CVTRV237
CVTRV244 EQU   CVTRV237
CVTRV243 EQU   CVTRV237
CVTRV242 EQU   CVTRV237
CVTRV241 EQU   CVTRV237
CVTRV240 EQU   CVTRV237
CVTRV239 EQU   CVTRV237
CVTRV238 EQU   CVTRV237
CVTRV236 EQU   CVTRV228
CVTRV235 EQU   CVTRV228
CVTRV234 EQU   CVTRV228
CVTRV233 EQU   CVTRV228
CVTRV232 EQU   CVTRV228
CVTRV231 EQU   CVTRV228
CVTRV230 EQU   CVTRV228
CVTRV229 EQU   CVTRV228
CVTRV227 EQU   CVTRV219
CVTRV226 EQU   CVTRV219
CVTRV225 EQU   CVTRV219
CVTRV224 EQU   CVTRV219
CVTRV223 EQU   CVTRV219
CVTRV222 EQU   CVTRV219
CVTRV221 EQU   CVTRV219
CVTRV220 EQU   CVTRV219
CVTRV218 EQU   CVTRV210
CVTRV217 EQU   CVTRV210
CVTRV216 EQU   CVTRV210
CVTRV215 EQU   CVTRV210
CVTRV214 EQU   CVTRV210
CVTRV213 EQU   CVTRV210
CVTRV212 EQU   CVTRV210
CVTRV211 EQU   CVTRV210
CVTLCCAT EQU   CVTS01+420
CVTPCCAT EQU   CVTS01+416
CVTIPCRP EQU   CVTS01+412
CVTIPCRI EQU   CVTS01+408
CVTIPCDS EQU   CVTS01+404
CVTAIDVT EQU   CVTS01+400
CVTSSAP  EQU   CVTS01+396
CVTEHCIR EQU   CVTS01+392
CVTEHDEF EQU   CVTS01+388
CVTDAIR  EQU   CVTS01+384
CVTPERFM EQU   CVTS01+380
CVT044R2 EQU   CVTS01+376
CVTFETCH EQU   CVTS01+372
CVTRSTWD EQU   CVTS01+368
CVTSPOST EQU   CVTS01+364
CVTIOBP  EQU   CVTS01+360
CVTASMVT EQU   CVTS01+356
CVTRECRQ EQU   CVTS01+352
CVTWSAC  EQU   CVTS01+348
CVTRV149 EQU   CVTS01+344
CVTWSAL  EQU   CVTS01+340
CVTSPSA  EQU   CVTS01+336
CVTGLMN  EQU   CVTS01+332
CVTVEAC0 EQU   CVTS01+328
CVT062R1 EQU   CVTS01+324
CVTRPOST EQU   CVTS01+320
CVTDQIQE EQU   CVTS01+316
CVTCSD   EQU   CVTS01+312
CVTLKRMA EQU   CVTS01+308
CVTRSPIE EQU   CVTS01+304
CVTRENQ  EQU   CVTS01+300
CVTLQCB  EQU   CVTS01+296
CVTFQCB  EQU   CVTS01+292
CVTQCS01 EQU   CVTS01+288
CVTAPFT  EQU   CVTS01+284
CVTPARRL EQU   CVTS01+280
CVTVWAIT EQU   CVTS01+276
CVTGSPL  EQU   CVTS01+272
CVTLSMQ  EQU   CVTS01+268
CVTGSMQ  EQU   CVTS01+264
CVTEXPRO EQU   CVTS01+260
CVTOPCTP EQU   CVTS01+256
CVTSIC   EQU   CVTS01+252
CVTTPIOS EQU   CVTS01+248
CVTRTMS  EQU   CVTS01+244
CVTSDBF  EQU   CVTS01+240
CVTSCBP  EQU   CVTS01+236
CVTSDMP  EQU   CVTS01+232
CVTSV60  EQU   CVTS01+228
CVTRTMCT EQU   CVTS01+224
CVTASCBL EQU   CVTS01+220
CVTASCBH EQU   CVTS01+216
CVTGDA   EQU   CVTS01+212
CVTASVT  EQU   CVTS01+208
CVTVVMDI EQU   CVTS01+204
CVTAQTOP EQU   CVTS01+200
CVTIOSCS EQU   CVTS01+196
CVTSDRM  EQU   CVTS01+192
CVTOPTE  EQU   CVTS01+188
CVTSTXU  EQU   CVTS01+184
CVTQUIS  EQU   CVTS01+180
CVTPARS  EQU   CVTS01+176
CVTS1EE  EQU   CVTS01+172
CVTFRAS  EQU   CVTS01+168
CVTQSAS  EQU   CVTS01+164
CVTCRAS  EQU   CVTS01+160
CVTCRMN  EQU   CVTS01+156
CVTDELCP EQU   CVTS01+152
CVTFRECL EQU   CVTS01+148
CVTGETCL EQU   CVTS01+144
CVTBLDCP EQU   CVTS01+140
CVTAUTHL EQU   CVTS01+136
CVTSCAN  EQU   CVTS01+132
CVTRV144 EQU   CVTS01+130
CVTMAXMP EQU   CVTS01+128
CVTSTCK  EQU   CVTS01+124
CVTRV139 EQU   CVTS01+123
CVTDSSAC EQU   CVTS01+122
CVTRV513 EQU   CVTS01+121
CVTIOSPL EQU   CVTS01+120
CVTPTGT  EQU   CVTS01+116
CVTCSPIE EQU   CVTS01+112
CVTSMFEX EQU   CVTS01+108
CVTOLT0A EQU   CVTS01+104
CVTSRBRT EQU   CVTS01+100
CVTPUTL  EQU   CVTS01+96
CVTASCRL EQU   CVTS01+92
CVTASCRF EQU   CVTS01+88
CVTRV326 EQU   CVTS01+84
CVTRV325 EQU   CVTS01+80
CVTRV324 EQU   CVTS01+76
CVT0VL01 EQU   CVTS01+72
CVTSHRVM EQU   CVTS01+68
CVTRV332 EQU   CVTS01+64
CVTTAS   EQU   CVTS01+60
CVTRSCN  EQU   CVTS01+56
CVTTRAC2 EQU   CVTS01+54
CVTTRACE EQU   CVTS01+52
CVTAPG   EQU   CVTS01+51
CVTSDTRC EQU   CVTCTLFG
CVTGTRCE EQU   CVTCTLFG
CVTNOMP  EQU   CVTCTLFG
CVTRSV79 EQU   CVTCTLFG
CVTDSTAT EQU   CVTCTLFG
CVTRSV78 EQU   CVTCTLFG
CVTRV333 EQU   CVTCTLFG
CVTRV323 EQU   CVTCTLFG
CVTSPVLK EQU   CVTS01+49
CVTRSV77 EQU   CVTS01+48
CVTRV331 EQU   CVTS01+44
CVTRV330 EQU   CVTS01+40
CVTRV329 EQU   CVTS01+36
CVTRV328 EQU   CVTS01+32
CVTRV322 EQU   CVTS01+28
CVTSLID  EQU   CVTSLIDA+1
CVTSYLK  EQU   CVTSLIDA
CVTRV321 EQU   CVTS01+20
CVTRV320 EQU   CVTS01+16
CVTLPDIR EQU   CVTLPDIA+1
CVTRSV69 EQU   CVTDIRST
CVTRSV68 EQU   CVTDIRST
CVTRSV67 EQU   CVTDIRST
CVTRSV66 EQU   CVTDIRST
CVTRSV65 EQU   CVTDIRST
CVTRSV64 EQU   CVTDIRST
CVTRSV63 EQU   CVTDIRST
CVTDICOM EQU   CVTDIRST
CVTPVTP  EQU   CVTS01+8
CVTLPDSR EQU   CVTS01+4
CVTGETL  EQU   CVTS01
WKECHNGP EQU   WKECHAIN+1
@NM00059 EQU   WKEFLAGS
WKEGATE  EQU   WKEFLAGS
@NM00058 EQU   ISTWKE
CRACHAIN EQU   ISTCRA+928
CRARSV02 EQU   ISTCRA+924
CRARSV01 EQU   ISTCRA+920
CRABFTBA EQU   CRABUFA
CRAMASK  EQU   CRASVC+64
CRAHSIZ  EQU   CRASVC+60
CRAASCRR EQU   CRASVC
CRAPROCR EQU   ISTCRA+312
CRAPSS   EQU   ISTCRA+160
CRARPH   EQU   ISTCRA+52
CRALAPTR EQU   CRABASIC+48
CRAL9PTR EQU   CRABASIC+44
CRAL8PTR EQU   CRABASIC+40
CRAL7PTR EQU   CRABASIC+36
CRAL6PTR EQU   CRABASIC+32
CRAL5PTR EQU   CRABASIC+28
CRAL4PTR EQU   CRABASIC+24
CRAL3PTR EQU   CRABASIC+20
CRAL2PTR EQU   CRABASIC+16
CRAL1PTR EQU   CRABASIC+12
CRALEV01 EQU   CRALKACT+3
CRALEV02 EQU   CRALKACT+3
CRALEV03 EQU   CRALKACT+3
CRALEV04 EQU   CRALKACT+3
CRALEV05 EQU   CRALKACT+3
CRALEV06 EQU   CRALKACT+3
CRALEV07 EQU   CRALKACT+3
CRALEV08 EQU   CRALKACT+3
CRALEV09 EQU   CRALKACT+2
CRALEV10 EQU   CRALKACT+2
CRALEV11 EQU   CRALKACT+2
CRALEV12 EQU   CRALKACT+2
CRALEV13 EQU   CRALKACT+2
CRALEV14 EQU   CRALKACT+2
CRALEV15 EQU   CRALKACT+2
CRALEV16 EQU   CRALKACT+2
CRALEV17 EQU   CRALKACT+1
CRALEV18 EQU   CRALKACT+1
CRALEV19 EQU   CRALKACT+1
CRALEV20 EQU   CRALKACT+1
CRALEV21 EQU   CRALKACT+1
CRALEV22 EQU   CRALKACT+1
CRALEV23 EQU   CRALKACT+1
CRALEV24 EQU   CRALKACT+1
CRALEV25 EQU   CRALKACT
CRALEV26 EQU   CRALKACT
CRALEV27 EQU   CRALKACT
CRALEV28 EQU   CRALKACT
CRALEV29 EQU   CRALKACT
CRALEV30 EQU   CRALKACT
CRALEV31 EQU   CRALKACT
CRALEV32 EQU   CRALKACT
CRAFRR   EQU   CRAHDR+4
@NM00057 EQU   ISTAPCRR+137
@NM00056 EQU   APC57FLG
APCNREL  EQU   APC57FLG
APCRECRA EQU   APC57FLG
@NM00055 EQU   APC54FLG
APCRLST  EQU   APC54FLG
APCPR153 EQU   APC53FLG
@NM00054 EQU   APC52FLG
APCWKF   EQU   APC52FLG
APCNWF   EQU   APC52FLG
APCRDQ   EQU   APC52FLG
APCQENQ  EQU   APC52FLG
APCSMSR  EQU   APC52FLG
APCCKRQ  EQU   APC52FLG
@NM00053 EQU   APC31FLG
APCSORT  EQU   APC31FLG
APCRESCH EQU   APC31FLG
APCTPXIT EQU   APC31FLG
APCSWTWD EQU   ISTAPCRR+128
APCSAV2  EQU   ISTAPCRR+124
APCSAV1  EQU   ISTAPCRR+120
APCRETCD EQU   APCCOMF+2
@NM00052 EQU   APCCOMF1+1
APCZLBER EQU   APCCOMF1
APCEXIT  EQU   APCCOMF1
APCRELR  EQU   APCCOMF1
APCIRB2  EQU   APCCOMF1
APCIRB1  EQU   APCCOMF1
APCSMCR  EQU   APCCOMF1
APCUETSK EQU   APCCOMF1
APCSSTSK EQU   APCCOMF1
APCESTAL EQU   APCSAVE
APCFRRPM EQU   ISTAPCRR+40
APCQWFO  EQU   ISTAPCRR+36
APCPABSV EQU   ISTAPCRR+32
APCRTRN  EQU   ISTAPCRR+28
APCTCBA  EQU   ISTAPCRR+24
APCPSTA  EQU   ISTAPCRR+20
@NM00051 EQU   APCRFLG+1
APC31R   EQU   APCRFLG
APC58R   EQU   APCRFLG
APC57R   EQU   APCRFLG
APC56R   EQU   APCRFLG
APC54R   EQU   APCRFLG
APC53R   EQU   APCRFLG
APC52R   EQU   APCRFLG
APC51R   EQU   APCRFLG
@NM00050 EQU   APCATFLG+1
APC31E   EQU   APCATFLG
APC58E   EQU   APCATFLG
APC57E   EQU   APCATFLG
APC56E   EQU   APCATFLG
APC54E   EQU   APCATFLG
APC53E   EQU   APCATFLG
APC52E   EQU   APCATFLG
APC51E   EQU   APCATFLG
APCHDRSV EQU   ISTAPCRR
ASCPSREG EQU   ISTASCRR+44
ASCUSR01 EQU   ASCUSRGS+12
ASCUSR00 EQU   ASCUSRGS+8
ASCUSR15 EQU   ASCUSRGS+4
ASCUSR14 EQU   ASCUSRGS
ASCETRYA EQU   ISTASCRR+24
ASCKEY   EQU   ISTASCRR+23
ASCAUDIT EQU   ASCFLG3
ASCFBDUD EQU   ASCFLG3
ASCLLKF  EQU   ASCFLG3
ASCKEYF  EQU   ASCFLG3
ASCFBDAL EQU   ASCFLG3
ASCFSRGT EQU   ASCFLG3
ASCICR   EQU   ASCFLG2
ASCFSRIC EQU   ASCFLG2
ASCFBDIC EQU   ASCFLG2
ASCFBAIC EQU   ASCFLG2
ASCPASTR EQU   ASCFLG1
ASCFSR   EQU   ASCFLG1
ASCFBD   EQU   ASCFLG1
ASCFBA   EQU   ASCFLG1
ASCPFCRR EQU   ISTASCRR
CCFRSVD1 EQU   CFCCRT
CCFCR2   EQU   CFCCRT
CCFCRP   EQU   CFCCRT
CCFCR1   EQU   CFCCRT
CCFCS2   EQU   CFCCRT
CCFCS1   EQU   CFCCRT
NCFRSVD  EQU   CFCNTRD
NCFCR2   EQU   CFCNTRD
NCFCRP   EQU   CFCNTRD
NCFCR1   EQU   CFCNTRD
NCFCS2   EQU   CFCNTRD
NCFCS1   EQU   CFCNTRD
PFCRSV01 EQU   ISTPFCRR+13
PFCFTA   EQU   ISTPFCRR+12
CRRFRR   EQU   PFCFRRO
CRRCHAIN EQU   PFCCRRO
CRRLEN   EQU   PFCCRRLN
PFCRSV10 EQU   PFCCRR+1
CRRID    EQU   PFCCRRID
ZPSZDFPR EQU   ISTZPSVT+76
ZPSZWRD5 EQU   ISTZPSVT+68
ZPSZWRD4 EQU   ISTZPSVT+64
ZPSZDFMB EQU   ISTZPSVT+60
ZPSZDFMF EQU   ISTZPSVT+56
@NM00049 EQU   ISTZPSVT+48
ZPSZDFF0 EQU   ISTZPSVT+44
ZPSZTRTT EQU   ISTZPSVT+40
ZPSZBFMB EQU   ISTZPSVT+32
ZPSZBFZ0 EQU   ISTZPSVT+28
ZPSZBFY0 EQU   ISTZPSVT+24
ZPSZDFI0 EQU   ISTZPSVT+20
ZPSZDFH0 EQU   ISTZPSVT+12
ZPSZDFD0 EQU   ISTZPSVT+8
ZPSZDFC0 EQU   ISTZPSVT+4
ZPSZDFA0 EQU   ISTZPSVT
ZCRRU    EQU   ZCRRHRU+3
ZCRRH    EQU   ZCRRHRU
ZCRWORDA EQU   ISTZCRR+477
ZCRCMNRC EQU   ISTZCRR+476
ZCRRSV97 EQU   ZCRENTER+18
ZCREIC2B EQU   ZCRENTER+18
ZCREAC2B EQU   ZCRENTER+18
ZCRELCAB EQU   ZCRENTER+18
ZCREDCMF EQU   ZCRENTER+18
ZCREBCIF EQU   ZCRENTER+18
ZCREICSG EQU   ZCRENTER+18
ZCREDCK0 EQU   ZCRENTER+18
ZCRECFY0 EQU   ZCRENTER+17
ZCREKCCB EQU   ZCRENTER+17
ZCREDCNB EQU   ZCRENTER+17
ZCREICOE EQU   ZCRENTER+17
ZCREBCNB EQU   ZCRENTER+17
ZCREBC0L EQU   ZCRENTER+17
ZCREBCAL EQU   ZCRENTER+17
ZCREDCQR EQU   ZCRENTER+17
ZCREDCPR EQU   ZCRENTER+16
ZCREBCSB EQU   ZCRENTER+16
ZCREAC1R EQU   ZCRENTER+16
ZCRECCCI EQU   ZCRENTER+16
ZCRECCAI EQU   ZCRENTER+16
ZCRECCBI EQU   ZCRENTER+16
ZCREBCAR EQU   ZCRENTER+16
ZCREBCDR EQU   ZCRENTER+16
ZCREBCBR EQU   ZCRENTER+15
ZCREDCXR EQU   ZCRENTER+15
ZCREDCWB EQU   ZCRENTER+15
ZCREDCWR EQU   ZCRENTER+15
ZCREKCCN EQU   ZCRENTER+15
ZCREKCBN EQU   ZCRENTER+15
ZCREKCBB EQU   ZCRENTER+15
ZCREJC0B EQU   ZCRENTER+15
ZCREJCDB EQU   ZCRENTER+14
ZCREJCCB EQU   ZCRENTER+14
ZCREJCBB EQU   ZCRENTER+14
ZCREJCAB EQU   ZCRENTER+14
ZCREIC1B EQU   ZCRENTER+14
ZCREIC0B EQU   ZCRENTER+14
ZCREICX0 EQU   ZCRENTER+14
ZCREICWB EQU   ZCRENTER+14
ZCREICVB EQU   ZCRENTER+13
ZCREICUB EQU   ZCRENTER+13
ZCREICTB EQU   ZCRENTER+13
ZCREICSC EQU   ZCRENTER+13
ZCREICSB EQU   ZCRENTER+13
ZCREICRB EQU   ZCRENTER+13
ZCREICQB EQU   ZCRENTER+13
ZCREICQA EQU   ZCRENTER+13
ZCREICOA EQU   ZCRENTER+12
ZCREICNB EQU   ZCRENTER+12
ZCREICNA EQU   ZCRENTER+12
ZCREICMB EQU   ZCRENTER+12
ZCREICLB EQU   ZCRENTER+12
ZCREICKG EQU   ZCRENTER+12
ZCREICKE EQU   ZCRENTER+12
ZCREICKB EQU   ZCRENTER+11
ZCREICJB EQU   ZCRENTER+11
ZCREICID EQU   ZCRENTER+11
ZCREICIB EQU   ZCRENTER+11
ZCREICHB EQU   ZCRENTER+11
ZCREICGB EQU   ZCRENTER+11
ZCREICEB EQU   ZCRENTER+11
ZCREICDB EQU   ZCRENTER+11
ZCREICCI EQU   ZCRENTER+10
ZCREICCB EQU   ZCRENTER+10
ZCREICBI EQU   ZCRENTER+10
ZCREICBB EQU   ZCRENTER+10
ZCREICAB EQU   ZCRENTER+10
ZCREICAA EQU   ZCRENTER+10
ZCREHCAN EQU   ZCRENTER+10
ZCREGC0B EQU   ZCRENTER+10
ZCREGC0A EQU   ZCRENTER+9
ZCREGCLA EQU   ZCRENTER+9
ZCREGCEB EQU   ZCRENTER+9
ZCREGCDB EQU   ZCRENTER+9
@NM00048 EQU   ZCRENTER+9
ZCREGCBB EQU   ZCRENTER+9
ZCREGCAB EQU   ZCRENTER+9
ZCREFCEB EQU   ZCRENTER+9
ZCREFCEA EQU   ZCRENTER+8
ZCREECTA EQU   ZCRENTER+8
ZCREECEA EQU   ZCRENTER+8
ZCREECDA EQU   ZCRENTER+8
ZCREECCB EQU   ZCRENTER+8
ZCREECCA EQU   ZCRENTER+8
ZCREECBB EQU   ZCRENTER+8
ZCREECBA EQU   ZCRENTER+8
ZCREDCMB EQU   ZCRENTER+7
ZCREDCL0 EQU   ZCRENTER+7
ZCREDCKB EQU   ZCRENTER+7
ZCREDCKA EQU   ZCRENTER+7
ZCREDCJ0 EQU   ZCRENTER+7
ZCREDCI0 EQU   ZCRENTER+7
ZCREDCH0 EQU   ZCRENTER+7
ZCREDCF0 EQU   ZCRENTER+7
ZCREDCE0 EQU   ZCRENTER+6
ZCREDCD0 EQU   ZCRENTER+6
ZCREDCC0 EQU   ZCRENTER+6
ZCREDCB0 EQU   ZCRENTER+6
ZCREDCA0 EQU   ZCRENTER+6
ZCRECC2B EQU   ZCRENTER+6
ZCRECC1B EQU   ZCRENTER+6
ZCRECC1A EQU   ZCRENTER+6
ZCRECC0B EQU   ZCRENTER+5
ZCRECC0A EQU   ZCRENTER+5
ZCREBC0B EQU   ZCRENTER+5
ZCREBC0A EQU   ZCRENTER+5
ZCREBCZ0 EQU   ZCRENTER+5
ZCREBCY0 EQU   ZCRENTER+5
ZCREBCX0 EQU   ZCRENTER+5
ZCREBCXA EQU   ZCRENTER+5
ZCREBCSC EQU   ZCRENTER+4
ZCREBCRB EQU   ZCRENTER+4
ZCREBCRA EQU   ZCRENTER+4
ZCREBCQB EQU   ZCRENTER+4
ZCREBCPB EQU   ZCRENTER+4
ZCREBCOB EQU   ZCRENTER+4
ZCREBCNE EQU   ZCRENTER+4
ZCREBCND EQU   ZCRENTER+4
ZCREBCMB EQU   ZCRENTER+3
ZCREBCLB EQU   ZCRENTER+3
ZCREBCLA EQU   ZCRENTER+3
ZCREBCKB EQU   ZCRENTER+3
ZCREBCKA EQU   ZCRENTER+3
ZCREBCJB EQU   ZCRENTER+3
ZCREBCJA EQU   ZCRENTER+3
ZCREBCID EQU   ZCRENTER+3
ZCREBCIB EQU   ZCRENTER+2
ZCREBCIA EQU   ZCRENTER+2
ZCREBCHB EQU   ZCRENTER+2
ZCREBCHA EQU   ZCRENTER+2
ZCREBCGB EQU   ZCRENTER+2
ZCREBCGA EQU   ZCRENTER+2
ZCREBCFB EQU   ZCRENTER+2
ZCREBCFA EQU   ZCRENTER+2
ZCREBCEB EQU   ZCRENTER+1
ZCREBCDI EQU   ZCRENTER+1
ZCREBCCB EQU   ZCRENTER+1
ZCREBCBI EQU   ZCRENTER+1
ZCREBCBB EQU   ZCRENTER+1
ZCREBCBA EQU   ZCRENTER+1
ZCREBCAM EQU   ZCRENTER+1
ZCREBCAI EQU   ZCRENTER+1
ZCREBCAG EQU   ZCRENTER
ZCREBCAE EQU   ZCRENTER
ZCREBCAB EQU   ZCRENTER
ZCREBCAA EQU   ZCRENTER
ZCREAC1B EQU   ZCRENTER
ZCREAC0B EQU   ZCRENTER
ZCREAC0A EQU   ZCRENTER
ZCREAC1A EQU   ZCRENTER
ZCRTNAME EQU   ZCRAUDIT+1
ZCRTID   EQU   ZCRAUDIT
ZCRREMIC EQU   ISTZCRR+436
ZCRSAVEZ EQU   ISTZCRR+196
ZCRR13SV EQU   ISTZCRR+188
ZCRR2SV  EQU   ISTZCRR+184
ZCROPCDE EQU   ISTZCRR+183
ZCRPRMTC EQU   ISTZCRR+182
ZCRRCDSV EQU   ISTZCRR+181
ZCRAWQSW EQU   ISTZCRR+180
ZCRTOPQ  EQU   ISTZCRR+180
ZCRLSTFB EQU   ISTZCRR+180
ZCRXSCHD EQU   ISTZCRR+180
ZCRNXTEL EQU   ISTZCRR+180
ZCRSCANQ EQU   ISTZCRR+180
ZCRMOREL EQU   ISTZCRR+180
ZCRFBPRC EQU   ISTZCRR+180
ZCRFSBSV EQU   ISTZCRR+176
ZCRSVWK5 EQU   ZCRWKARA+16
ZCRSVWK4 EQU   ZCRWKARA+12
ZCRSVWK3 EQU   ZCRWKARA+8
ZCRSVWK2 EQU   ZCRWKARA+4
ZCRSVWK1 EQU   ZCRWKARA
ZCRSVF25 EQU   ZCRSVRTN+96
ZCRSVF24 EQU   ZCRSVRTN+92
ZCRSVF23 EQU   ZCRSVRTN+88
ZCRSVF22 EQU   ZCRSVRTN+84
ZCRSVF21 EQU   ZCRSVRTN+80
ZCRSVF20 EQU   ZCRSVRTN+76
ZCRSVF19 EQU   ZCRSVRTN+72
ZCRSVF18 EQU   ZCRSVRTN+68
ZCRSVF17 EQU   ZCRSVRTN+64
ZCRSVF16 EQU   ZCRSVRTN+60
ZCRSVF15 EQU   ZCRSVRTN+56
ZCRSVF14 EQU   ZCRSVRTN+52
ZCRSVF13 EQU   ZCRSVRTN+48
ZCRSVF12 EQU   ZCRSVRTN+44
ZCRSVF11 EQU   ZCRSVRTN+40
ZCRSVF10 EQU   ZCRSVRTN+36
ZCRSVF9  EQU   ZCRSVRTN+32
ZCRSVF6  EQU   ZCRSVRTN+20
ZCRSVF5  EQU   ZCRSVRTN+16
ZCRSVF4  EQU   ZCRSVRTN+12
ZCRSVF3  EQU   ZCRSVRTN+8
ZCRSVF2  EQU   ZCRSVRTN+4
ZCRSVF1  EQU   ZCRSVRTN
ZCRPVZB  EQU   ISTZCRR+52
ZCRZLB   EQU   ISTZCRR+48
ZCRBFPTR EQU   ISTZCRR+44
ZCRCCWA  EQU   ISTZCRR+40
ZCRPSW   EQU   ZCRPARMS+15
ZCRPCHAR EQU   ZCRPARMS+14
ZCRPRES2 EQU   ZCRPCOD2
ZCRPMFGF EQU   ZCRPCOD2
ZCRPFHDR EQU   ZCRPCOD2
ZCRPPG2  EQU   ZCRPCOD2
ZCRPRES  EQU   ZCRPCOD1
ZCRPCFTX EQU   ZCRPCOD1
ZCRPLSBQ EQU   ZCRPLSBF
ZCRPFSB  EQU   ZCRPCOD1
ZCRPLNG  EQU   ZCRPCOD1
ZCRPPG   EQU   ZCRPCOD1
ZCRDTODA EQU   ZCRDFRDA
ZCRMLNG  EQU   ZCRPARMS+8
ZCRTBPTR EQU   ZCRPARMS+4
ZCRCBPTR EQU   ZCRFBPTR
ZCRCRLCP EQU   ISTZCRR+20
@NM00047 EQU   ZCRSCPSW
ZCRSKIPT EQU   ZCRSCPSW
ZCRFSBWE EQU   ZCRSCPSW
ZCRPRCMP EQU   ZCRSCPSW
ZCRLREQ  EQU   ZCRSCPSW
ZCRRJLCP EQU   ZCRSCPSW
ZCRTPINV EQU   ZCRSCPSW
ZCRTPEX  EQU   ZCRSCPSW
@NM00046 EQU   ZCRIBPR
ZCR3270  EQU   ZCRIBPR
ZCRLCPFD EQU   ZCRIBPR
ZCRLCPFR EQU   ZCRIBPR
ZCRERR   EQU   ZCRIBPR
ZCRNOBUF EQU   ZCRIBPR
@NM00045 EQU   ZCRPFLGS
ZCRQAHED EQU   ZCRPFLGS
ZCRF1RES EQU   ZCRGENSW
ZCRBRIS  EQU   ZCRGENSW
ZCRCLRBD EQU   ZCRGENSW
ZCREXRES EQU   ZCRGENSW
ZCRLCSYN EQU   ZCRGENSW
ZCRRT06  EQU   ZCRGENSW
ZCRTSW2  EQU   ZCRGENSW
ZCRTSW1  EQU   ZCRGENSW
ZCRINLCP EQU   ZCRFLGS3
ZCRWRPTR EQU   ZCRFLGS3
ZCRNOFRE EQU   ZCRFLGS3
ZCREDRIV EQU   ZCRFLGS3
ZCRDISC  EQU   ZCRFLGS3
ZCRTPDIS EQU   ZCRFLGS3
ZCRTPCON EQU   ZCRFLGS3
ZCRTIC   EQU   ZCRFLGS3
ZCRCNLXL EQU   ZCRRESET
ZCRENDAN EQU   ZCRSWFLD
ZCRENDXL EQU   ZCRSWFLD
ZCRENDX  EQU   ZCRSWFLD
ZCROB1   EQU   ZCRNDLCP
ZCRENDPR EQU   ZCRSWFLD
ZCREXTYP EQU   ZCRSWFLD
ZCRSLCP  EQU   ZCRENDSH
ZCRIF0E3 EQU   ZCRFLGS2
ZCRIF0E2 EQU   ZCRFLGS2
ZCRIF0E1 EQU   ZCRFLGS2
ZCROB    EQU   ZCRFLGS2
ZCRFMSED EQU   ZCRFLGS2
ZCRSHEDI EQU   ZCRFLGS2
ZCRLOCAL EQU   ZCRFLGS2
ZCRFEXIT EQU   ZCRFLGS1
ZCRUNSOL EQU   ZCRFLGS1
ZCRENDLP EQU   ZCRFLGS1
ZCRNRMEX EQU   ZCRFLGS1
ZCRWAIT  EQU   ZCRFLGS1
ZCRDEQSW EQU   ZCRFLGS1
ZCRQUESW EQU   ZCRFLGS1
ZCREXSW  EQU   ZCRFLGS1
ZCRFRRA  EQU   ISTZCRR+8
ZCRCHAIN EQU   ISTZCRR+4
ZCRFLAG  EQU   ZCRCRR+3
ZCRLEN   EQU   ZCRCRR+1
ZCRID    EQU   ZCRCRR
ATCAOS   EQU   ISTATCVT+1584
ATCPOPAB EQU   ATCAOSM+640
ATCVIOPM EQU   ATCAOSM+636
ATCTPMMI EQU   ATCAOSM+632
ATCTPMPB EQU   ATCAOSM+600
ATCRSV88 EQU   ATCAOSM+596
ATCRPLCT EQU   ATCAOSM+594
ATCCRACT EQU   ATCAOSM+592
ATCSRBCT EQU   ATCAOSM+590
ATCRSV75 EQU   ATCAOSM+589
ATCRSV66 EQU   ATCZFLAG
ATCZF001 EQU   ATCZFLAG
ATCTPCP1 EQU   ATCAOSM+584
ATCTPCP0 EQU   ATCAOSM+580
ATCAICTN EQU   ATCAOSM+576
ATCZR01  EQU   ATCAOSM+572
ATCMPLTA EQU   ATCAOSM+568
ATCASCB  EQU   ATCAOSM+564
ATCAP86  EQU   ATCAOSM+560
ATCAP85  EQU   ATCAOSM+556
ATCAP84  EQU   ATCAOSM+552
ATCAP83  EQU   ATCAOSM+548
ATCAP82  EQU   ATCAOSM+544
ATCAP69  EQU   ATCAOSM+540
ATCAP66  EQU   ATCAOSM+536
ATCAP62  EQU   ATCAOSM+532
ATCAPC59 EQU   ATCAOSM+528
ATCAP56  EQU   ATCAOSM+524
ATCAP55  EQU   ATCAOSM+520
ATCRCFY0 EQU   ATCAOSM+516
ATCAP41  EQU   ATCAOSM+512
ATCAPC25 EQU   ATCAOSM+508
ATCAP23  EQU   ATCAOSM+504
ATCTPSPB EQU   ATCAOSM+472
ATCTRMPB EQU   ATCAOSM+440
ATCAPBE  EQU   ATCAOSM+436
ATCPSTA  EQU   ATCAOSM+432
ATCSMABF EQU   ATCAOSM+428
ATCSMAPR EQU   ATCAOSM+424
ATCTPWQA EQU   ATCAOSM+420
ATCSMAID EQU   ATCAOSM+416
ATCSMARA EQU   ATCAOSM+412
ATCCACXA EQU   ATCAOSM+408
ATCZLAAB EQU   ATCAOSM+404
ATCATA10 EQU   ATCAOSM+400
ATCHLTCB EQU   ATCAOSM+396
@NM00044 EQU   ATCVTFLG
ATCVTACT EQU   ATCVTFLG
ATCRPT40 EQU   ATCAOSM+388
ATCRPT39 EQU   ATCAOSM+384
ATCRPT38 EQU   ATCAOSM+380
ATCRPT37 EQU   ATCAOSM+376
ATCRPT36 EQU   ATCAOSM+372
ATCRPT35 EQU   ATCAOSM+368
ATCRPT34 EQU   ATCAOSM+364
ATCRPT33 EQU   ATCAOSM+360
ATCRPT32 EQU   ATCAOSM+356
ATCRPT31 EQU   ATCAOSM+352
ATCRPT30 EQU   ATCAOSM+348
ATCRPT29 EQU   ATCAOSM+344
ATCRPT28 EQU   ATCAOSM+340
ATCRPT27 EQU   ATCAOSM+336
@NM00043 EQU   ATCAOSM+333
@NM00042 EQU   @NM00041
ATCSNUF  EQU   @NM00041
ATCOPKL  EQU   @NM00041
ATCABEN  EQU   @NM00041
ATCAIWT  EQU   ATCAOSM+328
ATCINFDD EQU   ATCAOSM+324
ATCORFMG EQU   ATCAOSM+320
ATCORFRL EQU   ATCAOSM+316
ATCOROBT EQU   ATCAOSM+312
ATCORQG  EQU   ATCORSRB
ATCORTBF EQU   ATCSQAFR
ATCRPLAC EQU   ATCRPLCN+2
ATCRPLRC EQU   ATCRPLCN
ATCCRPLQ EQU   ATCCRPL
ATCSRBAC EQU   ATCSRBCN+2
ATCSRBRC EQU   ATCSRBCN
ATCSRBQ  EQU   ATCSRB
ATCCRAAC EQU   ATCCRACN+2
ATCCRARC EQU   ATCCRACN
ATCCRAQ  EQU   ATCCRA
ATCRPT12 EQU   ATCAOSM+276
ATCDMAPP EQU   ATCAOSM+272
ATCAP38  EQU   ATCAOSM+268
ATCZDFJ0 EQU   ATCAOSM+260
ATCAP51  EQU   ATCAOSM+256
ATCZPAB2 EQU   ATCAOSM+224
ATCZPAB1 EQU   ATCAOSM+192
ATCZLFVT EQU   ATCAOSM+188
ATCZLPVT EQU   ATCAOSM+184
ATCZDVTX EQU   ATCAOSM+180
ATCZDVTA EQU   ATCAOSM+176
ATCZDVT9 EQU   ATCAOSM+172
ATCZDVT8 EQU   ATCAOSM+168
ATCZDVT7 EQU   ATCAOSM+164
ATCRSV56 EQU   ATCDAPVT+22
ATCDAPDG EQU   ATCDAPVT+20
ATCDXCEA EQU   ATCDAPVT+16
ATCDCEA  EQU   ATCDAPVT+12
ATCDPCIA EQU   ATCDAPVT+8
ATCDSIOA EQU   ATCDAPVT+4
ATCDEOEA EQU   ATCDAPVT
ATCZLAEA EQU   ATCLDAPP+16
ATCZLCEA EQU   ATCLDAPP+12
ATCRSV17 EQU   ATCLDAPP+8
ATCSMFRR EQU   ATCLDAPP+4
ATCCDTID EQU   ATCLDAPP
ATCZAEA  EQU   ATCICAPP+16
ATCZCEA  EQU   ATCICAPP+12
ATCCDTCB EQU   ATCICAPP+8
ATCZSIOA EQU   ATCICAPP+4
ATCCDRPH EQU   ATCICAPP
ATCAP65  EQU   ATCAOSM+96
ATCZDVT6 EQU   ATCAOSM+92
ATCZDVT4 EQU   ATCAOSM+88
ATCZDVT3 EQU   ATCAOSM+84
ATCZDVT1 EQU   ATCAOSM+80
ATCICNCB EQU   ATCAOSM+76
ATCZFSVT EQU   ATCAOSM+68
ATCAP64  EQU   ATCAOSM+64
ATCAP63  EQU   ATCAOSM+60
ATCAP61  EQU   ATCAOSM+56
ATCAP58  EQU   ATCAOSM+52
ATCAP57  EQU   ATCAOSM+48
ATCAP54  EQU   ATCAOSM+44
ATCAP53  EQU   ATCAOSM+40
ATCAP52  EQU   ATCAOSM+36
ATCAP32  EQU   ATCAOSM+28
ATCAP31  EQU   ATCAOSM+24
ATCAP12  EQU   ATCAOSM+20
ATCAP11  EQU   ATCAOSM+16
ATCCMTCB EQU   ATCAOSM+12
ATCPRPH  EQU   ATCAOSM+8
ATCGSRBF EQU   ATCGSRBG
ATCSRBRT EQU   ATCAOSM
@NM00040 EQU   @NM00039
ATCVTMAB EQU   @NM00039
@NM00038 EQU   ATCVTBAM
ATCVDLOK EQU   ISTATCVT+904
ATCVFPAB EQU   ISTATCVT+872
ATCVDPAB EQU   ISTATCVT+840
ATCIOECB EQU   ISTATCVT+836
ATCINCW3 EQU   ISTATCVT+832
ATCMODTB EQU   ISTATCVT+828
ATCUSSPT EQU   ISTATCVT+824
ATCSRTAB EQU   ISTATCVT+820
@NM00037 EQU   ISTATCVT+819
@NM00036 EQU   ATCSTAT2
ATCTRSMS EQU   ATCSTAT2
ATCTRLOK EQU   ATCSTAT2
ATCTRPSS EQU   ATCSTAT2
ATCTRESC EQU   ATCSTAT2
ATCTRAPI EQU   ATCSTAT2
ATCNMCTR EQU   ISTATCVT+816
ATCSEC51 EQU   ATCSECST
ATCSEC40 EQU   ATCSIPD+8
ATCSEC30 EQU   ATCSIPD+4
ATCSEC21 EQU   ATCSIPD
ATCSEC10 EQU   ATCSOPD+4
ATCSEC01 EQU   ATCSOPD
ATCPOIA  EQU   ATCRNO+1
@NM00035 EQU   ATCRNO
ATCPODVT EQU   ISTATCVT+784
ATCS49XL EQU   ISTATCVT+780
ATCS49XI EQU   ISTATCVT+776
ATCLCLCT EQU   ATCVLCNT+2
ATCRNCNT EQU   ATCVLCNT
ATCCFEAD EQU   ISTATCVT+768
ATCPTR00 EQU   ISTATCVT+736
ATCRSV10 EQU   ISTATCVT+704
ATCTACB  EQU   ISTATCVT+700
ATCVTINM EQU   ISTATCVT+696
ATCTCLIM EQU   ISTATCVT+692
ATCTCLOM EQU   ISTATCVT+688
ATCVTIPB EQU   ISTATCVT+656
ATCTCIPB EQU   ISTATCVT+624
ATCTIPAB EQU   ISTATCVT+592
ATCOCCCB EQU   ISTATCVT+588
ATCOCCOB EQU   ISTATCVT+584
ATCCDLAD EQU   ISTATCVT+580
ATCCCLAD EQU   ISTATCVT+576
ATCDLRPB EQU   ISTATCVT+544
ATCPGPAB EQU   ISTATCVT+512
ATCVPAB1 EQU   ISTATCVT+480
ATCRSV97 EQU   ISTATCVT+476
ATCRDTLK EQU   ISTATCVT+472
ATCVOCLK EQU   ISTATCVT+468
ATCCDFDN EQU   ISTATCVT+464
ATCCDFIN EQU   ISTATCVT+460
ATCDVTLK EQU   ISTATCVT+456
ATCAP36  EQU   ISTATCVT+452
ATCAP35  EQU   ISTATCVT+448
ATCAP33  EQU   ISTATCVT+444
ATCRSV99 EQU   ISTATCVT+440
ATCONFIG EQU   ISTATCVT+432
ATCNODDS EQU   ISTATCVT+428
ATCNODEL EQU   ISTATCVT+420
ATCRSV69 EQU   ISTATCVT+416
ATCAPCR5 EQU   ISTATCVT+412
ATCLDECB EQU   ISTATCVT+408
ATCLDNCS EQU   ISTATCVT+404
ATCCDPTR EQU   ISTATCVT+400
ATCADEL  EQU   ISTATCVT+396
ATCTODVT EQU   ISTATCVT+392
ATCDEBCH EQU   ISTATCVT+388
ATCHBSIZ EQU   ATCHPGM+2
ATCHBFNO EQU   ATCHPGM
ATCCRME  EQU   ISTATCVT+380
ATCRVCHS EQU   ISTATCVT+372
ATCECTLP EQU   ISTATCVT+368
ATCZDVTB EQU   ISTATCVT+364
ATCECPRT EQU   ISTATCVT+360
ATCVTLOD EQU   ISTATCVT+356
ATCTRPAB EQU   ISTATCVT+352
ATCMSGM  EQU   ISTATCVT+348
ATCMSGP  EQU   ISTATCVT+344
ATCEPT   EQU   ISTATCVT+340
ATCDVT   EQU   ISTATCVT+336
ATCTRCPT EQU   ISTATCVT+332
ATCDVLOD EQU   ISTATCVT+328
ATCALERT EQU   ISTATCVT+324
ATCEPA   EQU   ISTATCVT+320
ATCSAF   EQU   ISTATCVT+318
ATCXRANG EQU   ISTATCVT+317
ATCLAST  EQU   ATCSHRFG
ATCSHRTN EQU   ISTATCVT+308
ATCUEP   EQU   ISTATCVT+304
ATCOCRT  EQU   ISTATCVT+300
ATCCSMA  EQU   ATCCSMR
ATCESC02 EQU   ISTATCVT+292
ATCESC01 EQU   ISTATCVT+288
ATCCDFND EQU   ISTATCVT+284
ATCCDDEL EQU   ISTATCVT+280
ATCCDADD EQU   ISTATCVT+276
ATCMNT   EQU   ISTATCVT+272
ATCRSV16 EQU   ISTATCVT+270
ATCMAXID EQU   ISTATCVT+269
ATCMSGSP EQU   ATCCOM+268
ATCCIDM  EQU   ATCCOM+266
ATCACTRM EQU   ATCCOM+264
ATCNERAP EQU   ATCCOM+260
ATCNESAL EQU   ATCCOM+256
ATCRCC65 EQU   ATCCOM+252
ATCRCC26 EQU   ATCCOM+248
ATCRCC63 EQU   ATCCOM+244
ATCRSV11 EQU   ATCCOM+242
ATCVTMID EQU   ATCCOM+240
ATCAPOST EQU   ATCCOM+236
ATCNERFN EQU   ATCCOM+232
ATCNERNE EQU   ATCCOM+228
ATCNERCV EQU   ATCCOM+224
ATCNERST EQU   ATCCOM+220
ATCDCC61 EQU   ATCCOM+216
ATCDCC60 EQU   ATCCOM+212
ATCSRTDF EQU   ATCCOM+208
ATCSRTAD EQU   ATCCOM+204
ATCFIRA  EQU   ATCCOM+200
ATCSMBQ  EQU   ATCCOM+196
ATCSMRC  EQU   ATCCOM+192
ATCSMRS  EQU   ATCCOM+188
ATCSMQU  EQU   ATCCOM+184
ATCSMRQ  EQU   ATCCOM+180
ATCACDA  EQU   ATCCOM+176
ATCSTMA  EQU   ATCCOM+172
ATCFRSTR EQU   ATCCOM+168
ATCGTSTR EQU   ATCCOM+164
ATCREADA EQU   ATCCOM+160
ATCALOAD EQU   ATCCOM+156
ATCBLDLA EQU   ATCCOM+152
ATCFBRPH EQU   ATCCOM+148
ATCBFTRC EQU   ATCCOM+144
ATCTPBUF EQU   ATCTHTRC
ATCREMOV EQU   ATCCOM+136
ATCADD   EQU   ATCCOM+132
ATCBPDA  EQU   ATCCOM+128
ATCDVTPT EQU   ATCCOM+124
ATCFEPT  EQU   ATCCOM+120
ATCFDVT  EQU   ATCCOM+116
ATCCONFT EQU   ATCCOM+112
ATCPTCHA EQU   ATCCOM+108
ATCAUTHA EQU   ATCCOM+104
ATCACCTA EQU   ATCCOM+100
ATCRDTH  EQU   ATCCOM+96
ATCFRSCH EQU   ATCCOM+92
ATCFSB   EQU   ATCCOM+88
ATCHLTMS EQU   ATCCOM+84
ATCECPRM EQU   ATCCOM+80
ATCECNET EQU   ATCCOM+76
ATCECOPC EQU   ATCCOM+72
ATCVPARM EQU   ATCCOM+68
ATCECVRQ EQU   ATCCOM+64
ATCECSES EQU   ATCCOM+60
ATCOCHA  EQU   ATCCOM+56
ATCDSPLQ EQU   ATCCOM+52
ATCECDSP EQU   ATCCOM+48
ATCVARYQ EQU   ATCCOM+44
ATCECVRY EQU   ATCCOM+40
ATCHALTQ EQU   ATCCOM+36
ATCECHLT EQU   ATCCOM+32
ATCMODQ  EQU   ATCCOM+28
ATCECMOD EQU   ATCCOM+24
ATCASCHD EQU   ATCCOM+20
ATCSRT   EQU   ATCCOM+16
ATCRDT   EQU   ATCCOM+12
ATCDCFRR EQU   ATCCOM+8
ATCAPI   EQU   ATCCOM+4
ATCRSV04 EQU   ATCSTAT4
ATCVTTRC EQU   ATCSTAT4
ATCNCSD  EQU   ATCSTAT4
ATCMTST  EQU   ATCSTAT4
ATCTPRT  EQU   ATCSTAT4
ATCPRTAT EQU   ATCSTAT4
@NM00034 EQU   ATCPOFLG
ATCPOUNS EQU   ATCPOFLG
ATCHSDMF EQU   ATCSTFLG
@NM00033 EQU   ATCSTAT1
ATCMDHLT EQU   ATCSTAT1
ATCINHLT EQU   ATCSTAT1
ATCNETSL EQU   ATCSTAT1
ATCQKHLT EQU   ATCSTAT1
ATCSNHLT EQU   ATCSTAT1
ATCACTIV EQU   ATCSTAT1
ATCSTART EQU   ATCSTAT1
DYPPAB   EQU   ISTDYPAB+16
DYPRSV01 EQU   ISTDYPAB+12
DYPTSKID EQU   ISTDYPAB+8
DYPCHAIN EQU   ISTDYPAB+4
DYPFLGS  EQU   ISTDYPAB+2
DYPLNGTH EQU   ISTDYPAB+1
DYPTYPE  EQU   ISTDYPAB
ZRCZDFWB EQU   ISTZRCVT+120
ZRCZIFJB EQU   ISTZRCVT+116
ZRCZKFBB EQU   ISTZRCVT+108
ZRCZIFTB EQU   ISTZRCVT+104
ZRCZIFSB EQU   ISTZRCVT+100
ZRCZIFX0 EQU   ISTZRCVT+96
ZRCZIFAB EQU   ISTZRCVT+88
ZRCZIFBB EQU   ISTZRCVT+76
ZRCZIFCB EQU   ISTZRCVT+72
ZRCZIFDB EQU   ISTZRCVT+68
ZRCZIFEB EQU   ISTZRCVT+64
ZRCRSV01 EQU   ISTZRCVT+60
ZRCZGFBB EQU   ISTZRCVT+56
ZRCZIFQB EQU   ISTZRCVT+52
ZRCZIFNB EQU   ISTZRCVT+48
ZRCZIFOB EQU   ISTZRCVT+44
ZRCZIFMB EQU   ISTZRCVT+40
ZRCZIFKB EQU   ISTZRCVT+36
ZRCZIFLB EQU   ISTZRCVT+32
@NM00032 EQU   ISTZRCVT+28
@NM00031 EQU   ISTZRCVT+24
@NM00030 EQU   ISTZRCVT+20
@NM00029 EQU   ISTZRCVT+16
@NM00028 EQU   ISTZRCVT+12
ZRCZJF0B EQU   ISTZRCVT+8
ZRCZCFCI EQU   ISTZRCVT+4
ZRCZIF0B EQU   ISTZRCVT
DNCZC001 EQU   DNCOS+40
DNCLOCK  EQU   DNCOS+36
DNCZV005 EQU   DNCOS+32
DNCZV004 EQU   DNCOS+28
DNCZV003 EQU   DNCOS+24
DNCZV002 EQU   DNCOS+21
DNCZX001 EQU   DNCOS+20
DNCZV001 EQU   DNCOS+17
DNCZX003 EQU   DNCOS+16
DNCZV000 EQU   DNCOS+12
DNCSESCQ EQU   DNCOS+8
DNCSESIQ EQU   DNCOS+4
DNCLICP  EQU   DNCBSCED
DNCZF008 EQU   DNCZFLGS+1
DNCZPSRD EQU   DNCZFLGS+1
DNCPSOL  EQU   DNCZFLGS+1
DNCZF007 EQU   DNCZFLGS+1
DNCZF005 EQU   DNCZFLGS+1
DNCZF004 EQU   DNCZFLGS+1
DNCZF003 EQU   DNCZFLGS
DNCZF002 EQU   DNCZFLGS
DNCDISC  EQU   DNCZFLGS
DNCCONT  EQU   DNCZFLGS
DNCSESS  EQU   DNCZFLGS
DNCZF001 EQU   DNCZFLGS
DNCMODE  EQU   ISTDNCB+49
DNCBHSET EQU   ISTDNCB+48
NCBRSV01 EQU   ISTNCB+46
NCBSWDAF EQU   ISTNCB+44
NCBFMCBP EQU   ISTNCB+32
NCBLTRC  EQU   ISTNCB+30
NCBRVPT1 EQU   ISTNCB+28
NCBNMLLN EQU   NCBFLAGS+3
@NM00027 EQU   NCBFLAG1
NCBFORCE EQU   NCBFLAG1
NCBTTF   EQU   NCBFLAG1
NCBRSYNC EQU   NCBFLAG1
NCBRSTRT EQU   NCBFLAG1
NCBCONF  EQU   NCBFLAG1
NCBSNAI  EQU   NCBFLAG1
NCBFLTIO EQU   NCBFTRIO
NCBCSTAT EQU   NCBFLAGS
NCBNCSL  EQU   ISTNCB+22
NCBNCBA  EQU   ISTNCB+20
NCBFMCBA EQU   ISTNCB+16
NCBNSNA  EQU   ISTNCB+12
NCBTSKID EQU   ISTNCB+8
NCBRDTE  EQU   ISTNCB+4
NCBDAF   EQU   ISTNCB+2
NCBLNGTH EQU   ISTNCB+1
NCBTYPE  EQU   ISTNCB
FMCFLRSV EQU   FMCFLGB
FMCFLGA8 EQU   FMCFLGB
FMCCLRPH EQU   FMCVS1+45
FMCRSV0X EQU   FMCCVFLG
FMCVYRPH EQU   FMCCVFLG
FMCZV004 EQU   FMCVS1+40
FMCLOCK2 EQU   FMCVS1+36
@NM00026 EQU   FMCZFLG2
FMCZF027 EQU   FMCZFLG2
FMCZF026 EQU   FMCZFLG2
FMCSEQ1B EQU   FMCSEQ1
FMCSEQ1T EQU   FMCSEQ1
FMCZX006 EQU   FMCVS1+33
FMCZX005 EQU   FMCVS1+32
FMCZX004 EQU   FMCVS1+31
FMCZX002 EQU   FMCVS1+29
FMCZX001 EQU   FMCVS1+28
FMCZV001 EQU   FMCVS1+24
FMCAWATQ EQU   FMCLCPAQ+1
@NM00025 EQU   FMCLCPAQ
FMCLCPB2 EQU   FMCLCPBQ+1
FMCLCPB1 EQU   FMCLCPBQ
FMCASCDQ EQU   FMCSHEAQ+1
@NM00024 EQU   FMCSHEAQ
FMCZFCSQ EQU   FMCVS1+6
FMCZH001 EQU   FMCVS1+4
FMCZF025 EQU   FMCZFLAG+3
FMCZF024 EQU   FMCZFLAG+3
FMCZF023 EQU   FMCZFLAG+3
FMCZF022 EQU   FMCZFLAG+3
FMCZF021 EQU   FMCZFLAG+3
FMCZF019 EQU   FMCZFLAG+3
FMCZF018 EQU   FMCZFLAG+3
FMCZF016 EQU   FMCZFLAG+2
FMCZF015 EQU   FMCZFLAG+2
FMCZF014 EQU   FMCZFLAG+2
FMCZF013 EQU   FMCZFLAG+2
FMCZF012 EQU   FMCZFLAG+2
FMCZF00F EQU   FMCZFLAG+1
FMCZF00E EQU   FMCZFLAG+1
FMCZF00D EQU   FMCZFLAG+1
FMCZF00C EQU   FMCZFLAG+1
FMCZF00B EQU   FMCZFLAG+1
FMCRSV10 EQU   FMCZFLAG+1
FMCZF009 EQU   FMCZFLAG+1
FMCZFD06 EQU   FMCZF006+1
FMCZFC06 EQU   FMCZF006
FMCZFA06 EQU   FMCZF006
FMCZF005 EQU   FMCZFLAG
FMCZF004 EQU   FMCZFLAG
FMCZF003 EQU   FMCZFLAG
FMCZF002 EQU   FMCZFLAG
FMCZF001 EQU   FMCZFLAG
FMCFRESA EQU   ISTFMCB+228
FMCSCSQN EQU   FMCSNCTL+2
FMCSCCTL EQU   FMCSNCTL+1
FMCSTCTL EQU   FMCSCFLG
FMCSCCLO EQU   FMCSCFLG
FMCAPRO  EQU   FMCSCFLG
FMCLURO  EQU   FMCSCFLG
FMCOBSAC EQU   FMCSCFLG
FMCIBSAC EQU   FMCSCFLG
FMCFBRE  EQU   ISTFMCB+220
FMCFBXM  EQU   FMCZV002
FMCASEGQ EQU   ISTFMCB+212
FMCRDTPT EQU   ISTFMCB+208
FMCLOCK  EQU   ISTFMCB+204
FMCSEGD  EQU   FMCSSEGQ
FMCRSPLM EQU   ISTFMCB+198
FMCPSTRS EQU   ISTFMCB+196
@NM00023 EQU   FMCRRESP
FMCTSLHA EQU   FMCRRESP
FMCFRRN  EQU   FMCRRESP
FMCFME   EQU   FMCRRESP
FMCFEX   EQU   FMCRRESP
FMCFPE   EQU   FMCRRESP
FMCCTLB  EQU   ISTFMCB+194
FMCBSQNO EQU   FMCCLSEQ+2
FMCTSQNO EQU   FMCCLSEQ
FMCOBPRG EQU   FMCMODEB
FMCIBPRG EQU   FMCMODEB
FMCRESOT EQU   FMCMODEB
FMCRSTSR EQU   FMCMODEB
FMCLUQ   EQU   FMCMODEB
FMCAPQ   EQU   FMCMODEB
FMCCLEAR EQU   FMCMODEB
FMCHOLD  EQU   FMCMODEB
FMCIPSEQ EQU   ISTFMCB+188
FMCLUSTR EQU   ISTFMCB+187
FMCRSV87 EQU   FMCSTAT2
FMCSEQI  EQU   FMCSTAT2
FMCCPIP  EQU   FMCSTAT2
FMCALIPR EQU   FMCSTAT2
FMCIAIO  EQU   FMCSTAT2
FMCZF00A EQU   FMCSTAT2
FMCVPIP  EQU   FMCSTAT2
FMCBHSET EQU   ISTFMCB+185
FMCPRMRC EQU   FMCCLEXT+20
FMCRSV89 EQU   FMCPSTAT
FMCPCLSD EQU   FMCPSTAT
FMCDDOCD EQU   FMCPSTAT
FMCIDVFD EQU   FMCPSTAT
FMCELKST EQU   FMCPSTAT
FMCRSV88 EQU   FMCPSCMD
FMCRDBLK EQU   FMCPSCMD
FMCDSEOC EQU   FMCPSCMD
FMCPURGE EQU   FMCPSCMD
FMCRESTI EQU   FMCPSCMD
FMCCNTCT EQU   FMCPSCMD
FMCINVT  EQU   FMCPSCMD
FMCFLGB7 EQU   FMCFLGCL
FMCFLGB6 EQU   FMCFLGCL
FMCFLGB5 EQU   FMCFLGCL
FMCFLGB4 EQU   FMCFLGCL
FMCFLGB3 EQU   FMCFLGCL
FMCFLGB2 EQU   FMCFLGCL
FMCFLGB1 EQU   FMCFLGCL
FMCFLGB0 EQU   FMCFLGCL
FMCFLGA7 EQU   FMCFLGA
FMCFLGA6 EQU   FMCFLGA
FMCFLGA5 EQU   FMCFLGA
FMCFLGA4 EQU   FMCFLGA
FMCFLGA3 EQU   FMCFLGA
FMCFLGA2 EQU   FMCFLGA
FMCFLGA1 EQU   FMCFLGA
FMCFLGA0 EQU   FMCFLGA
FMCDCLOK EQU   FMCCLEXT+12
FMCRAFM  EQU   FMCCLEXT+8
FMCFBPTR EQU   FMCFBA+1
FMCFBRSV EQU   FMCFBA
FMCRPLPT EQU   FMCRPLA+1
FMCRPLRS EQU   FMCRPLA
FMCPRCLS EQU   FMCCVAL
FMCIBCE  EQU   FMCCVAL
FMCONLY  EQU   FMCOBCE
FMCLAST  EQU   FMCOBCE
FMCMIDLE EQU   FMCOBCE
FMCFIRST EQU   FMCOBCE
FMCCPCNT EQU   FMCPACPC
FMCMPCNT EQU   FMCPACEM
FMCNPCNT EQU   FMCPACEN
FMCCONF  EQU   FMCSSTAT
FMCPURCH EQU   FMCSSTAT
FMCNSALU EQU   FMCSSTAT
FMCBIP   EQU   FMCSSTAT
FMCSDTR  EQU   FMCSSTAT
FMCUIPI  EQU   FMCSSTAT
FMCCIPI  EQU   FMCSSTAT
FMCSNBI  EQU   FMCSSTAT
FMCRVD01 EQU   ISTFMCB+158
FMCISSN  EQU   ISTFMCB+156
FMCOASN  EQU   FMCNXOSC
FMCOSSN  EQU   FMCNXCFM
FMCSIP   EQU   FMCSIPA
FMCEXLST EQU   ISTFMCB+144
FMCPAB5  EQU   ISTFMCB+128
FMCPAB3  EQU   ISTFMCB+96
FMCPAB1  EQU   ISTFMCB+64
FMCFASYA EQU   ISTFMCB+60
FMCPROCD EQU   ISTFMCB+48
FMCVWT   EQU   ISTFMCB+44
FMCRPLH  EQU   ISTFMCB+40
FMCBUFNB EQU   FMCCMPS1+2
FMCBUFLM EQU   FMCCMPS1
FMCDEBA  EQU   ISTFMCB+32
@NM00022 EQU   FMCCMDFL
FMCSNA   EQU   FMCCMDFL
FMCVSNA  EQU   FMCCMDFL
FMCCMDR  EQU   FMCCMDFL
@NM00021 EQU   ISTFMCB+30
@NM00020 EQU   FMCSTAT1
FMCLTCLS EQU   FMCSTAT1
FMCHPURG EQU   FMCSTAT1
FMCVSP2  EQU   FMCSTAT1
FMCVSP1  EQU   FMCSTAT
FMCLTEAS EQU   FMCSTAT
FMCZF007 EQU   FMCSTAT
FMCDEDSC EQU   FMCSTAT
FMCDEVOF EQU   FMCSTAT
FMCDAPT  EQU   FMCSTAT
FMCPRMTE EQU   FMCSTAT
FMCPRMTR EQU   FMCSTAT
FMCUSFLD EQU   ISTFMCB+24
FMCFMCBA EQU   ISTFMCB+20
FMCDNCBA EQU   ISTFMCB+16
FMCDVTA  EQU   ISTFMCB+12
FMCTSKID EQU   ISTFMCB+8
FMCNXTCB EQU   ISTFMCB+4
FMCSAF   EQU   ISTFMCB+2
FMCLNGTH EQU   ISTFMCB+1
FMCTYPE  EQU   ISTFMCB
LOKXCL   EQU   @NM00018
LOKPRY   EQU   @NM00018
@NM00019 EQU   @NM00018
@NM00017 EQU   LOKCHNG
LOKCT    EQU   ISTLOK
PROSRDEF EQU   PROSETM4
PRORSV47 EQU   PROSETM4
PROSCON  EQU   PROSETM4
PRORSV46 EQU   PROSETM3
PROSMONT EQU   PROSETM3
PRORSV45 EQU   PROSETM3
PROSNTO  EQU   PROSETM3
PRORSV44 EQU   PROSETM3
PRORSV43 EQU   PROSETM2
PROSNTFL EQU   PROSETM2
PRORSV42 EQU   PROSETM2
PRORSV41 EQU   PROPROCS
PROMODC  EQU   PROPROC4
PROMODT  EQU   PROPROC4
PROMODM  EQU   PROPROC4
PROMODB  EQU   PROPROC4
PRORSV14 EQU   PROPROC4
PRORSV13 EQU   PROPROC4
PRORSV12 EQU   PROPROC4
PROEIB   EQU   PROPROC4
PROMONT3 EQU   PROPROC3
PROMONT2 EQU   PROPROC3
PROMONIT EQU   PROPROC3
PROSUBLK EQU   PROPROC3
PRONTO   EQU   PROPROC3
PROLGIN  EQU   PROPROC3
PROERPI  EQU   PROPROC3
PRORSV07 EQU   PROPROC3
PROCFTX  EQU   PROPROC2
PROEMLC  EQU   PROPROC2
PRONTFL  EQU   PROPROC2
PRORSV05 EQU   PROPROC2
PRORSV04 EQU   PROPROC2
PROLGOT  EQU   PROPROC2
PROERPO  EQU   PROPROC2
PRORSV03 EQU   PROPROC2
PRORPLC  EQU   PROPROC1
PROCS    EQU   PROPROC1
PROCA    EQU   PROPROC1
PRORESPX EQU   PROPROC1
PRODFASY EQU   PROPROC1
PROXPOPT EQU   PROPROC1
PROTRUNC EQU   PROPROC1
PROASYIP EQU   PROPROC1
DEVRSV03 EQU   ISTDEVCH+5
DEVPHYSA EQU   ISTDEVCH+4
DEVCSLPN EQU   DEVCHAR3
DEVCSTCL EQU   DEVCHAR3
DEVCCHEK EQU   DEVCHAR3
DEVCATTN EQU   DEVCHAR3
DEVCSWL  EQU   DEVFCCTL
DEVCRVB  EQU   DEVFCCTL
DEVCSSL  EQU   DEVFCCTL
DEVCBSC  EQU   DEVFCCTL
DEVMCODE EQU   ISTDEVCH+2
DEVCHAR2 EQU   DEVTCODE
DEVRSV01 EQU   DEVCHAR
DEVCCTL  EQU   DEVCHAR
DEVNNSPT EQU   DEVCHAR
DEVSPS   EQU   DEVCHAR
DEVSUBND EQU   DEVCHAR
DEVCONVR EQU   DEVCHAR
DEVOTPUT EQU   DEVCHAR
DEVINPUT EQU   DEVCHAR
PABRPHA  EQU   PABRPHFG+1
PABNODQ  EQU   PABFLAGS
PABINHBT EQU   PABFLAGS
PABERLOK EQU   PABERRLK
PABSSN   EQU   PABFLAGS
PABDYNAM EQU   PABFLAGS
PABNORPR EQU   PABFLAGS
PABPRIOR EQU   PABFLAGS
PABAPYP  EQU   PABFLAGS
PABOFFST EQU   ISTPAB+8
PABCHNGP EQU   PABCHAIN+1
PABRSV02 EQU   PABCHAIN
PABDELAY EQU   PABCHAIN
PABRUNNG EQU   PABCHAIN
PABRESET EQU   PABCHAIN
PABUNCON EQU   PABCHAIN
PABCDP   EQU   PABCHAIN
PABRESCH EQU   PABCHAIN
PABCHNG  EQU   PABCHAIN
PABWEQP  EQU   PABWEQA+1
PABRSV01 EQU   PABWEQA
PABWEQG  EQU   PABWEQA
ZIBLNG1  EQU   ZIBFSM
ZIBCHAIN EQU   ISTZIBUF
TH2SNF   EQU   ISTTH2+4
TH2OAF   EQU   ISTTH2+3
TH2DAF   EQU   ISTTH2+2
TH2CDF   EQU   TH2FLAG1+1
TH2SEF   EQU   TH2FLAG1+1
TH2PYF   EQU   TH2FLAG1+1
TH2AFI   EQU   TH2FLAG1
TH2PSI   EQU   TH2FLAG1
TH2CMPLI EQU   TH2MPF
TH2RHI   EQU   TH2MPF
TH2FID   EQU   TH2FLAG1
THDCF    EQU   ISTTH+8
THSNF    EQU   ISTTH+6
THOAF    EQU   ISTTH+4
THDAF    EQU   ISTTH+2
THCDF    EQU   THFLGB
THSEF    EQU   THFLGB
THPYF    EQU   THFLGB
THAFI    EQU   THFLGA
THPSI    EQU   THFLGA
THCMPLI  EQU   THMPF
THRHI    EQU   THMPF
THFID    EQU   THFLAG1
LHVDATA  EQU   ISTLH+4
LHFUNCT  EQU   ISTLH+3
@NM00011 EQU   ISTLH+2
LHLEN    EQU   ISTLH
FSBFDB   EQU   ISTFSB+32
FSBRSV01 EQU   FSBFSB+30
FSBTHCNT EQU   FSBFSB+28
FSBRLRSV EQU   FSBRLSTS
FSBCFTX  EQU   FSBRLSTS
FSBICNCB EQU   FSBMSGID
FSBSSOC  EQU   FSBSS2
FSBSSCC  EQU   FSBSS2
FSBSSDC  EQU   FSBSS2
FSBSSEC  EQU   FSBSS2
FSBSSIR  EQU   FSBSS2
FSBSSCR  EQU   FSBSS2
@NM00009 EQU   FSBSS2
@NM00008 EQU   FSBSS1
FSBSSDE  EQU   FSBSS1
FSBSSUS  EQU   FSBSS1
@NM00007 EQU   FSBSS1
FSBSOHI  EQU   FSBERC
FSBLGI   EQU   FSBERC
FSBLMRI  EQU   FSBFBMI
FSBETI   EQU   FSBERC
FSBEMI   EQU   FSBERC
FSBEBI   EQU   FSBERC
FSBECI   EQU   FSBERC
FSBELI   EQU   FSBERC
FSBXLCI  EQU   FSBXCODE
FSBXFINS EQU   FSBXCODE
FSBXNORM EQU   FSBXFSTS
FSBCMD   EQU   FSBSEQ
FSBDTRCE EQU   FSBFLAGS
FSBASBTU EQU   FSBFLAGS
FSBINPET EQU   FSBFLAGS
FSBNONCB EQU   FSBFLAGS
FSBLBIND EQU   FSBFLAGS
FSBFFIND EQU   FSBFLAGS
FSBACIND EQU   FSBFLAGS
FSBRFIND EQU   FSBFLAGS
FSBGATE  EQU   FSBFSBA
FSBLATOP EQU   FSBSFLGS
FSBRSV02 EQU   FSBSFLGS
FSBPGBUF EQU   FSBSFLGS
FSBMNSDA EQU   FSBMNRCD
FSBMNOA  EQU   FSBMNRCD
FSBMNDIF EQU   FSBMNRCD
FSBMNEOP EQU   FSBMNRCD
FSBMNDNU EQU   FSBMNRCD
FSBMNATN EQU   FSBMNRCD
FSBMNRVI EQU   FSBMNRCD
FSBMNELI EQU   FSBMNRCD
FSBLNGTH EQU   FSBFSB+1
FSBTYPE  EQU   FSBFSB
FDBFDBA  EQU   ISTFDB
BTUEXTR  EQU   ISTBTU+19
BTURSV02 EQU   BTUSYSTR
BTUPHASE EQU   BTUSYSTR
BTURSV01 EQU   BTUSYSTR
BTUPAD   EQU   BTURH+3
BTURH3   EQU   BTURH+2
BTURH2   EQU   BTURH+1
BTURH1   EQU   BTURH
BTUDCF   EQU   BTUBTH+8
BTUZRTSC EQU   BTURQFLG+1
BTUZRT0B EQU   BTURQFLG+1
BTUZRT0A EQU   BTURQFLG+1
BTUZRT09 EQU   BTURQFLG+1
BTUZRT08 EQU   BTURQFLG+1
BTUZRT07 EQU   BTURQFLG
BTUZRT06 EQU   BTURQFLG
BTUZRT05 EQU   BTURQFLG
BTUZRT04 EQU   BTURQFLG
BTUZRT03 EQU   BTURQFLG
BTUZRT02 EQU   BTURQFLG
BTUZRT01 EQU   BTURQFLG
BTUZRT00 EQU   BTURQFLG
BTUCDF   EQU   BTUFID+1
BTUSCF   EQU   BTUFID+1
BTUPRY   EQU   BTUFID+1
BTUASFL  EQU   BTUFID
BTUPSFL  EQU   BTUFID
BTUMPF   EQU   BTUFID
BTUFIDNO EQU   BTUFID
BDURSV04 EQU   BDUFLAGS
BDURTOE  EQU   BDUFLAGS
BDUSTPR  EQU   BDUFLAGS
BDURSV03 EQU   BDUFLAGS
BDUALT   EQU   BDUFUNC
BDUNACK  EQU   BDUFUNC
BDUACK   EQU   BDUFUNC
BDUTRPM  EQU   BDUFUNC
BDUFBMI  EQU   BDUFUNC
BDULDGPH EQU   BDUFUNC
BDUHEADP EQU   BDUFUNC
BDUSOH   EQU   BDUCHECK
BDURSV01 EQU   BDUMODIF
BDUMOD0  EQU   BDUMOD1
LSCTLBAD EQU   ISTLSCB+28
LSCFDB2  EQU   LSCFDBA+1
LSCFDB1  EQU   LSCFDBA
LSCLCCW1 EQU   ISTLSCB+12
LSCRRCNT EQU   LSCSEQ+1
LSCRRCCT EQU   LSCSEQ
LSCATOP  EQU   LSCFLGS
LSCFREE  EQU   LSCFLGS
LSCDSTAT EQU   LSCFLGS
LSCZRIMM EQU   LSCFLGS
LSCRSV01 EQU   LSCFLGS
LSCSMODE EQU   LSCFLGS
LSCZMIRC EQU   LSCRUCNT
LSCCHAI2 EQU   LSCCHAIN+1
LSCCHNG  EQU   LSCCHAI1
LSCZRTSC EQU   LSCZMNRC
LSCZRT0B EQU   LSCZMNRC
LSCZRT0A EQU   LSCZMNRC
LSCZRTL9 EQU   LSCZRT09
LSCZRTL8 EQU   LSCZRT08
LSCZRTL7 EQU   LSCZRT07
LSCZRTL6 EQU   LSCZRT06
LSCZRTL5 EQU   LSCZRT05
LSCZRTL4 EQU   LSCZRT04
LSCZRTL3 EQU   LSCZRT03
LSCZRTL2 EQU   LSCZRT02
LSCZRT01 EQU   LSCREQTG
LSCZRT00 EQU   LSCREQTG
LSCLNGTH EQU   LSC1WORD+1
LCPFTYPE EQU   LCPRPHA
LCPRSTQH EQU   LCPLCCW
LCPCLREP EQU   ISTLCPB+44
LCPUBFSB EQU   LCPFLCCW
LCPRSV77 EQU   ISTLCPB+39
LCPLCCWC EQU   ISTLCPB+38
LCPRSV78 EQU   LCPFLG1
LCPTRANS EQU   LCPFLG1
LCPSTLB  EQU   LCPFLG1
LCPREDRV EQU   LCPFLG1
LCPDIRPT EQU   LCPFLG1
LCPINTER EQU   LCPFLG1
LCPRESET EQU   LCPFLG1
LCPSTYPE EQU   ISTLCPB+36
LCPFSNCH EQU   ISTLCPB+34
LCPFOSN  EQU   ISTLCPB+32
LCPTLBAD EQU   ISTLCPB+28
LCPFDB2  EQU   LCPFDBA+1
LCPFDB1  EQU   LCPFDBA
LCPDAF   EQU   LCPCID+2
LCPSAF   EQU   LCPCID
LCPLCCW1 EQU   ISTLCPB+12
LCPRRCNT EQU   LCPSEQ+1
LCPRRCCT EQU   LCPSEQ
LCPFREE  EQU   LCPFLAG2
LCPDSTAT EQU   LCPFLAG2
LCPEXRES EQU   LCPFID0
LCPZRIMM EQU   LCPTLBPI
LCPRSTRT EQU   LCPFLAG2
LCPASYN  EQU   LCPFLAG2
LCPPRFLG EQU   LCPFLAG2
LCPCHAI2 EQU   LCPCHAIN+1
LCPCHNG  EQU   LCPCHAI1
LCPZRT0B EQU   LCPMNRCD
LCPZRT0A EQU   LCPMNRCD
LCPZRTL9 EQU   LCPZRT09
LCPZRTL8 EQU   LCPZRT08
LCPZRTL7 EQU   LCPZRT07
LCPZRTL6 EQU   LCPZRT06
LCPZRTL5 EQU   LCPZRT05
LCPZRTL4 EQU   LCPZRT04
LCPZRTL3 EQU   LCPZRT03
LCPZRTL2 EQU   LCPZRT02
LCPZRT01 EQU   LCPFLAGS
LCPZRT00 EQU   LCPFLAGS
LCPLNGTH EQU   ISTLCPB+1
LCPTYPE  EQU   ISTLCPB
LCCWDATA EQU   ISTLCCW+4
LCCWCNT  EQU   ISTLCCW+2
LCCWACI  EQU   LCCWFLAG
LCCWRFI  EQU   LCCWFLAG
LCCWPER  EQU   LCCWLSI
LCCWIDAT EQU   LCCWFLAG
LCCWNTVC EQU   LCCWFLAG
LCCWCKPT EQU   LCCWFLAG
LCCWCC   EQU   LCCWFLAG
LCCWCD   EQU   LCCWFLAG
LCCWTYPE EQU   LCCWCTL
LCCWMODE EQU   LCCWCTL
LCCWSOP  EQU   LCCWRWOP
@NM00006 EQU   LCCWRWOP
LCCWSD   EQU   LCCWOP
LCCWSI   EQU   LCCWOP
RPHNEXPO EQU   ISTRPH+104
RPHSAV16 EQU   RPHWORK+60
RPHSAV15 EQU   RPHWORK+56
RPHSAV14 EQU   RPHWORK+52
RPHSAV13 EQU   RPHWORK+48
RPHSAV12 EQU   RPHWORK+44
RPHSAV11 EQU   RPHWORK+40
RPHSAV10 EQU   RPHWORK+36
RPHSAVE9 EQU   RPHWORK+32
RPHSAVE8 EQU   RPHWORK+28
RPHSAVE7 EQU   RPHWORK+24
RPHSAVE6 EQU   RPHWORK+20
RPHSAVE5 EQU   RPHWORK+16
RPHSAVE4 EQU   RPHWORK+12
RPHSAVE3 EQU   RPHWORK+8
RPHSAVE2 EQU   RPHWORK+4
RPHSHALF EQU   RPHSAVE1+2
RPHSBIT8 EQU   RPHSBITS
RPHSBIT7 EQU   RPHSBITS
RPHSBIT6 EQU   RPHSBITS
RPHSBIT5 EQU   RPHSBITS
RPHSBIT4 EQU   RPHSBITS
RPHSBIT3 EQU   RPHSBITS
RPHSBIT2 EQU   RPHSBITS
RPHSBIT1 EQU   RPHSBITS
RPHSBYTE EQU   RPHSAVE1
RPHPABQP EQU   RPHPABQA+1
RPHPABFG EQU   RPHPABQA
RPHSRP34 EQU   RPHSRPRM+2
RPHSRP12 EQU   RPHSRPRM
RPHWEGT  EQU   RPHCSPA
RPHMAJCB EQU   ISTRPH+21
RPHPABOF EQU   ISTRPH+20
RPHRESUM EQU   RPHRESMA+1
RPHRSV01 EQU   RPHWPFLG
RPHPURGE EQU   RPHWPFLG
RPHPT    EQU   RPHWPFLG
RPHWT    EQU   RPHWPFLG
RPHRSKEY EQU   RPHWPFLG
RPHDVTA  EQU   ISTRPH+12
RPHTIK   EQU   RPHTSKID+3
@NM00005 EQU   RPHTSKID
RPHRPHAP EQU   RPHRPHA+1
@NM00004 EQU   RPHRPHA
RPHGATE  EQU   RPHRPHA
@NM00003 EQU   RPHFLGB
RPHRLCRA EQU   RPHFLGB
RPHNRSAV EQU   RPHFLGB
RPHPGCMP EQU   RPHFLGB
RPHFBAPS EQU   RPHFLGB
RPHBSSP  EQU   RPHFLGB
RPHLOCK  EQU   RPHFLGB
RPHFNFLG EQU   RPHFSTLC
RPHMLTCP EQU   RPHFLAGS
RPHSMCLR EQU   RPHFLAGS
RPHSMTYP EQU   RPHFLAGS
RPHSMQ   EQU   RPHFLAGS
RPHAUTEX EQU   RPHAPTYP
RPHSPGIN EQU   RPHFLAGS
RPHOGIND EQU   RPHFLAGS
RPHLNGTH EQU   RPHCNTL+1
RPHTYPE  EQU   RPHCNTL
CVTLEVL  EQU   CVTRELNO+2
CVTNUMB  EQU   CVTRELNO
CVTMDL   EQU   CVTFIX+250
@NM00002 EQU   CVTFIX+248
@NM00001 EQU   CVTFIX
CVTRV482 EQU   CVTXTNT2+128
CVTRV481 EQU   CVTXTNT2+124
CVTRV480 EQU   CVTXTNT2+120
CVTRV479 EQU   CVTXTNT2+118
CVTRV478 EQU   CVTXTNT2+117
CVTRV477 EQU   CVTXTNT2+116
CVTRV476 EQU   CVTXTNT2+115
CVTRV475 EQU   CVTXTNT2+114
CVTRV474 EQU   CVTRV466
CVTRV473 EQU   CVTRV466
CVTRV472 EQU   CVTRV466
CVTRV471 EQU   CVTRV466
CVTRV470 EQU   CVTRV466
CVTRV469 EQU   CVTRV466
CVTRV468 EQU   CVTRV466
CVTRV467 EQU   CVTRV466
CVTRV465 EQU   CVTRV457
CVTRV464 EQU   CVTRV457
CVTRV463 EQU   CVTRV457
CVTRV462 EQU   CVTRV457
CVTRV461 EQU   CVTRV457
CVTRV460 EQU   CVTRV457
CVTRV459 EQU   CVTRV457
CVTRV458 EQU   CVTRV457
CVTRV456 EQU   CVTXTNT2+108
CVTRV455 EQU   CVTXTNT2+104
CVTRV454 EQU   CVTXTNT2+100
CVTRV453 EQU   CVTXTNT2+96
CVTRV452 EQU   CVTXTNT2+94
CVTRV451 EQU   CVTXTNT2+92
CVTRV450 EQU   CVTXTNT2+90
CVTRV449 EQU   CVTXTNT2+88
CVTRV448 EQU   CVTXTNT2+87
CVTRV447 EQU   CVTXTNT2+86
CVTRV446 EQU   CVTRV438
CVTRV445 EQU   CVTRV438
CVTRV444 EQU   CVTRV438
CVTRV443 EQU   CVTRV438
CVTRV442 EQU   CVTRV438
CVTRV441 EQU   CVTRV438
CVTRV440 EQU   CVTRV438
CVTRV439 EQU   CVTRV438
CVTRV437 EQU   CVTRV429
CVTRV436 EQU   CVTRV429
CVTRV435 EQU   CVTRV429
CVTRV434 EQU   CVTRV429
CVTRV433 EQU   CVTRV429
CVTRV432 EQU   CVTRV429
CVTRV431 EQU   CVTRV429
CVTRV430 EQU   CVTRV429
CVTRV428 EQU   CVTXTNT2+80
CVTRV427 EQU   CVTXTNT2+76
CVTRV426 EQU   CVTXTNT2+72
CVTRV425 EQU   CVTXTNT2+68
CVTATACT EQU   CVTATCVT
CVTRV423 EQU   CVTXTNT2+62
CVTRV422 EQU   CVTXTNT2+60
CVTRV421 EQU   CVTXTNT2+58
CVTRV420 EQU   CVTXTNT2+56
CVTRV419 EQU   CVTXTNT2+55
CVTRV418 EQU   CVTXTNT2+54
CVTRV417 EQU   CVTRV409
CVTRV416 EQU   CVTRV409
CVTRV415 EQU   CVTRV409
CVTRV414 EQU   CVTRV409
CVTRV413 EQU   CVTRV409
CVTRV412 EQU   CVTRV409
CVTRV411 EQU   CVTRV409
CVTRV410 EQU   CVTRV409
CVTRV408 EQU   CVTRV400
CVTRV407 EQU   CVTRV400
CVTRV406 EQU   CVTRV400
CVTRV405 EQU   CVTRV400
CVTRV404 EQU   CVTRV400
CVTRV403 EQU   CVTRV400
CVTRV402 EQU   CVTRV400
CVTRV401 EQU   CVTRV400
CVTICB   EQU   CVTXTNT2+48
CVTSKTA  EQU   CVTXTNT2+44
CVTSHSB  EQU   CVTSHS
CVTRSV98 EQU   CVTXTNT2+36
CVTRSV97 EQU   CVTXTNT2+34
CVTRSV96 EQU   CVTXTNT2+32
CVTOLTEP EQU   CVTXTNT2+28
CVTQIDA  EQU   CVTQID+1
CVTRSV95 EQU   CVTQID
CVTRSV94 EQU   CVTXTNT2+20
CVTRSV93 EQU   CVTXTNT2+16
CVTRSV92 EQU   CVTXTNT2+12
CVTDEBVR EQU   CVTXTNT2+8
CVTRSV91 EQU   CVTXTNT2+6
CVTRSV9H EQU   CVTFLGBT
CVTRSV9G EQU   CVTFLGBT
CVTRSV9F EQU   CVTFLGBT
CVTRSV9E EQU   CVTFLGBT
CVTRSV9D EQU   CVTFLGBT
CVTRSV9C EQU   CVTFLGBT
CVTVME   EQU   CVTFLGBT
CVTNPE   EQU   CVTFLGBT
CVTNUCLS EQU   CVTXTNT2+4
CVTDSSVA EQU   CVTDSSV+1
CVTRSV89 EQU   CVTDSSV
CVTRSV88 EQU   CVTXTNT1+8
CVTRSV87 EQU   CVTXTNT1+4
CVTFACHN EQU   CVTXTNT1
CVTRV488 EQU   CVTMAP+412
CVTRV487 EQU   CVTMAP+408
CVTRV486 EQU   CVTMAP+404
CVTRV485 EQU   CVTMAP+400
CVTACTAP EQU   CVTMAP+396
CVTAUTH  EQU   CVTMAP+392
CVTATMCA EQU   CVTATMCT+1
CVTATMST EQU   CVTATMCT
CVTRSV61 EQU   CVTMAP+384
CVTVOLT1 EQU   CVTVOLM1+1
CVTVOLI1 EQU   CVTVOLF1
CVTSTOA  EQU   CVTMAP+376
CVTRSV58 EQU   CVTMAP+374
CVTRSV57 EQU   CVTMAP+372
CVTDDCE  EQU   CVTMAP+368
CVTPNWFR EQU   CVTMAP+364
CVTSMF   EQU   CVTMAP+360
CVTSULK  EQU   CVTMAP+358
CVTSLKO  EQU   CVTSYSK
CVTSLKP  EQU   CVTSYSK
CVTSLKQ  EQU   CVTSYSK
CVTSLKR  EQU   CVTSYSK
CVTRSV56 EQU   CVTSYSK
CVTRSV55 EQU   CVTSYSK
CVTRSV54 EQU   CVTSYSK
CVTRSV53 EQU   CVTSYSK
CVTRSV52 EQU   CVTA1F1
CVTRSV51 EQU   CVTA1F1
CVTRSV50 EQU   CVTA1F1
CVTRSV49 EQU   CVTA1F1
CVTRSV48 EQU   CVTA1F1
CVTRSV47 EQU   CVTA1F1
CVTSRSW  EQU   CVTA1F1
CVTPFSW  EQU   CVTA1F1
CVTPCVT  EQU   CVTMAP+352
CVTRSV46 EQU   CVTMAP+344
CVTRSV45 EQU   CVTMAP+340
CVTRSV44 EQU   CVTMAP+338
CVTRSV43 EQU   CVTMAP+336
CVTHJESA EQU   CVTHJES+1
CVTRSV42 EQU   CVTHJES
CVTEXT2A EQU   CVTEXT2+1
CVTRSV41 EQU   CVTEXT2
CVTAPFA  EQU   CVTAPF+1
CVTRSV40 EQU   CVTAPF
CVTRV518 EQU   CVTINTLA
CVTRV517 EQU   CVTERPV
CVTEORM  EQU   CVTMAP+312
CVTMCHPR EQU   CVTMAP+308
CVTTZ    EQU   CVTMAP+304
CVTJEPS  EQU   CVTMAP+300
CVTJESCT EQU   CVTMAP+296
CVTMODE  EQU   CVTMAP+292
CVTPTRV  EQU   CVTMAP+288
CVTREAL  EQU   CVTMAP+284
CVTRSV39 EQU   CVTMAP+280
CVTRSV38 EQU   CVTMAP+276
CVTDMSRA EQU   CVTDMSR+1
CVTRV634 EQU   CVTDMSRF
CVTRV633 EQU   CVTDMSRF
CVTRV632 EQU   CVTDMSRF
CVTRV631 EQU   CVTDMSRF
CVTRV630 EQU   CVTDMSRF
CVTRV629 EQU   CVTDMSRF
CVTUDUMP EQU   CVTDMSRF
CVTSDUMP EQU   CVTDMSRF
CVTQMSGA EQU   CVTQMSG+1
CVTRSV36 EQU   CVTQMSG
CVTAMFF  EQU   CVTMAP+264
CVTPURGA EQU   CVTPURG+1
CVTRSV35 EQU   CVTPURG
CVTCBSP  EQU   CVTMAP+256
CVTATERA EQU   CVTATER+1
CVTSYST  EQU   CVTATER
CVTVOLT2 EQU   CVTTAT
CVTVOLI2 EQU   CVTVOLF2
CVTAQAVB EQU   CVTAQAVT+1
CVTRSV34 EQU   CVTTCMFG
CVTRSV33 EQU   CVTTCMFG
CVTRSV32 EQU   CVTTCMFG
CVTRSV31 EQU   CVTTCMFG
CVTRSV30 EQU   CVTTCMFG
CVTRSV29 EQU   CVTTCMFG
CVTRSV28 EQU   CVTTCMFG
CVTTCRDY EQU   CVTTCMFG
CVTGTFA  EQU   CVTGTF+1
CVTRSV27 EQU   CVTGTFST
CVTRNIO  EQU   CVTGTFST
CVTUSR   EQU   CVTGTFST
CVTRV318 EQU   CVTFORM
CVTRV317 EQU   CVTTMODE
CVTRV316 EQU   CVTSTATE
CVTRV315 EQU   CVTGTFS
CVTGTFAV EQU   CVTGTFS
CVT0SCR1 EQU   CVTMAP+232
CVTRV515 EQU   CVTMAP+228
CVTRMS   EQU   CVTMAP+224
CVTPATCH EQU   CVTMAP+220
CVTTSCE  EQU   CVTMAP+216
CVTLNKSC EQU   CVTMAP+214
CVTQABST EQU   CVTMAP+212
CVTMDLDS EQU   CVTMAP+208
CVTUSER  EQU   CVTMAP+204
CVTABEND EQU   CVTMAP+200
CVTSMCA  EQU   CVTMAP+196
CVTRSV18 EQU   CVTMAP+192
CVTQLPAQ EQU   CVTMAP+188
CVTQCDSR EQU   CVTMAP+184
CVTRSV17 EQU   CVTOPTB
CVTRSV16 EQU   CVTOPTB
CVTFP    EQU   CVTOPTB
CVTAPTHR EQU   CVTOPTB
CVTNLOG  EQU   CVTOPTB
CVTTOD   EQU   CVTOPTB
CVTCTIMS EQU   CVTOPTB
CVTPROT  EQU   CVTOPTB
CVTXPFP  EQU   CVTOPTA
CVTASCII EQU   CVTOPTA
CVTRSV13 EQU   CVTOPTA
CVTRSV12 EQU   CVTOPTA
CVTNIP   EQU   CVTOPTA
CVTDDR   EQU   CVTOPTA
CVTAPR   EQU   CVTOPTA
CVTCCH   EQU   CVTOPTA
CVTSNCTR EQU   CVTMAP+180
CVTQMWR  EQU   CVTMAP+176
CVTQOCR  EQU   CVTMAP+172
CVT1EF00 EQU   CVTMAP+168
CVTMZ00  EQU   CVTMAP+164
CVTHEAD  EQU   CVTMAP+160
CVTRSV11 EQU   CVTMAP+156
CVT0PT01 EQU   CVTMAP+152
CVTMSER  EQU   CVTMAP+148
CVTRV516 EQU   CVTIERLC
CVTILCH  EQU   CVTMAP+140
CVT0DS   EQU   CVTMAP+136
CVTFBOSV EQU   CVTMAP+132
CVTNUCB  EQU   CVTMAP+128
CVTIXAVL EQU   CVTMAP+124
CVTIOQET EQU   CVTMAP+120
CVTDCBA  EQU   CVTMAP+117
CVTMVS2  EQU   CVTDCB
CVT6DAT  EQU   CVTDCB
CVT4MPS  EQU   CVTDCB
CVTRSV09 EQU   CVTDCB
CVT4MS1  EQU   CVTDCB
CVT2SPS  EQU   CVTDCB
CVT1SSS  EQU   CVTDCB
CVTRSV08 EQU   CVTDCB
CVTSTB   EQU   CVTMAP+112
CVTQTD00 EQU   CVTMAP+108
CVTQTE00 EQU   CVTMAP+104
CVTCUCB  EQU   CVTMAP+100
CVTSJQ   EQU   CVTMAP+96
CVTPBLDL EQU   CVTMAP+92
CVTTPC   EQU   CVTMAP+88
CVTSVDCB EQU   CVTMAP+84
CVTBRET  EQU   CVTMAP+82
CVTEXIT  EQU   CVTMAP+80
CVT0FN00 EQU   CVTMAP+76
CVTDARA  EQU   CVTDAR+1
CVTRSV07 EQU   CVTFLGS1
CVTRSV06 EQU   CVTFLGS1
CVTRSV05 EQU   CVTFLGS1
CVTRSV04 EQU   CVTFLGS1
CVTRSV03 EQU   CVTFLGS1
CVTRSV02 EQU   CVTFLGS1
CVTRSV01 EQU   CVTFLGS1
CVTDMPLK EQU   CVTFLGS1
CVTXITP  EQU   CVTMAP+68
CVTZDTAB EQU   CVTMAP+64
CVTMSLT  EQU   CVTMAP+60
CVTDATE  EQU   CVTMAP+56
CVTBTERM EQU   CVTMAP+52
CVTSYSAD EQU   CVTMAP+48
CVTXTLER EQU   CVTMAP+44
CVTILK2  EQU   CVTMAP+40
CVTILK1  EQU   CVTMAP+36
CVTPRLTV EQU   CVTMAP+32
CVTPCNVT EQU   CVTMAP+28
CVT0VL00 EQU   CVTMAP+24
CVTXAPG  EQU   CVTMAP+20
CVTBUF   EQU   CVTMAP+16
CVTJOB   EQU   CVTMAP+12
CVTLINK  EQU   CVTMAP+8
CVT0EF00 EQU   CVTMAP+4
CVTTCBP  EQU   CVTMAP
CVT      EQU   CVTMAP
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS
MVESETS# EQU   @RC00508
@RC00486 EQU   @RC00485
@RC00514 EQU   @RC00485
MANDIAL# EQU   @RC00485
MVESETS@ EQU   @EL00002
@RT00731 EQU   ISTA0034
@RT00748 EQU   @RC00708
@ENDDATA EQU   *
         END   ISTZIFOB,(C'PLS1941',0603,77349)
