         TITLE 'IKJEFLGN, LOGON MESSAGE CSECT FOR IKJELFGM             *
                        '
IKJEFLGN CSECT ,                                                   0001
@PROLOG  DS    0H                                                  0002
MSG18    DS    0F
         SPACE
         WTO   'IKJ600I TSOLOGON  ERROR,DDNAME ,USER ,PROC ',MF=L,     *
               DESC=4,ROUTCDE=(2,10)
MSG20    DS    0F
         SPACE
         WTO   'IKJ608I TSOLOGON TERMINATED.  ERROR ,USER ,PROC ',MF=L,*
               DESC=4,ROUTCDE=(2,10)
MSG21    DS    0F
         SPACE
         WTO   'IKJ603I TSOLOGON . INSTALLATION EXIT  ',MF=L,          *
               DESC=4,ROUTCDE=(2,10)
MSG23    DS    0F
         SPACE
         WTO   'IKJ605I TSOLOGON TERMINATED. TOO MANY ATTEMPTS. USER ',X
               MF=L,DESC=6,ROUTCDE=(2,9)
MSG24    DS    0F
         SPACE
         WTO   'IKJ606I TSOLOGON REJECTED. USERID, ,IN USE',MF=L,      *
               DESC=6,ROUTCDE=(2,9)
MSG33    DS    0F
         SPACE
         WTO   'IKJ602I INCONSISTENT AUTHORIZATION DATA FOR ',MF=L,    *
               DESC=4,ROUTCDE=(2,10)
MSG48    DS 0F
         DS    0F
         SPACE
 WTO 'IKJ601I TSOLOGON  ABEND  ,USER  ,PROC ',                         *
               MF=L,DESC=4,ROUTCDE=(2,10)
*END IKJEFLGN;                                                     0112
@EL00001 DS    0H                                                  0112
@EF00001 DS    0H                                                  0112
@ER00001 BR    @14                                                 0112
@DATA    DS    0H
         DS    0F
         DS    0F
         DS    0D
IKJEFLGZ DS    CL142
         ORG   IKJEFLGZ
MD01     DC    AL2(MD1-IKJEFLGZ)
MD02     DC    AL2(MD2-IKJEFLGZ)
MD03     DC    AL2(MD3-IKJEFLGZ)
MD04     DC    AL2(MD4-IKJEFLGZ)
MD05     DC    AL2(MD5-IKJEFLGZ)
MD06     DC    AL2(MD6-IKJEFLGZ)
MD07     DC    AL2(MD7-IKJEFLGZ)
MD08     DC    AL2(MD8-IKJEFLGZ)
MD09     DC    AL2(MD9-IKJEFLGZ)
MD010    DC    AL2(MD10-IKJEFLGZ)
MD011    DC    AL2(MD11-IKJEFLGZ)
MD012    DC    AL2(MD12-IKJEFLGZ)
MD013    DC    AL2(MD13-IKJEFLGZ)
MD014    DC    AL2(MD14-IKJEFLGZ)
MD015    DC    AL2(MD15-IKJEFLGZ)
MD016    DC    AL2(MD16-IKJEFLGZ)
MD017    DC    AL2(MD17-IKJEFLGZ)
MD018    DC    AL2(MD18-IKJEFLGZ)
MD019    DC    AL2(MD19-IKJEFLGZ)
MD020    DC    AL2(MD20-IKJEFLGZ)
MD021    DC    AL2(MD21-IKJEFLGZ)
MD022    DC    AL2(MD22-IKJEFLGZ)
MD023    DC    AL2(MD23-IKJEFLGZ)
MD024    DC    AL2(MD24-IKJEFLGZ)
MD025    DC    AL2(MD25-IKJEFLGZ)
MD026    DC    AL2(MD26-IKJEFLGZ)
MD027    DC    AL2(MD27-IKJEFLGZ)
MD028    DC    AL2(MD28-IKJEFLGZ)
MD029    DC    AL2(MD29-IKJEFLGZ)
MD030    DC    AL2(MD30-IKJEFLGZ)
MD031    DC    AL2(MD31-IKJEFLGZ)
MD032    DC    AL2(MDBAD-IKJEFLGZ)
MD033    DC    AL2(MD33-IKJEFLGZ)
MD034    DC    AL2(MD34-IKJEFLGZ)
MD035    DC    AL2(MD35-IKJEFLGZ)
MD036    DC    AL2(MD36-IKJEFLGZ)
MD037    DC    AL2(MD37-IKJEFLGZ)
MD038    DC    AL2(MD38-IKJEFLGZ)
MD039    DC    AL2(MD39-IKJEFLGZ)
MD040    DC    AL2(MD40-IKJEFLGZ)
MD041    DC    AL2(MD41-IKJEFLGZ)
MD042    DC    AL2(MD42-IKJEFLGZ)
MD043    DC    AL2(MD43-IKJEFLGZ)
MD044    DC    AL2(MD44-IKJEFLGZ)
MD045    DC    AL2(MD45-IKJEFLGZ)
MD046    DC    AL2(MD46-IKJEFLGZ)
MD047    DC    AL2(MD47-IKJEFLGZ)
MD048    DC    AL2(MD48-IKJEFLGZ)
MD049    DC    AL2(MD49-IKJEFLGZ)
MD050    DC    AL2(MD50-IKJEFLGZ)
MD051    DC    AL2(MD51-IKJEFLGZ)
MD052    DC    AL2(MD52-IKJEFLGZ)
MD053    DC    AL2(MD53-IKJEFLGZ)
MD054    DC    AL2(MD54-IKJEFLGZ)
MD055    DC    AL2(MD55-IKJEFLGZ)
MD056    DC    AL2(MD56-IKJEFLGZ)
MD057    DC    AL2(MD57-IKJEFLGZ)
MD058    DC    AL2(MD58-IKJEFLGZ)
MD059    DC    AL2(MD59-IKJEFLGZ)
MD060    DC    AL2(MD60-IKJEFLGZ)
MD061    DC    AL2(MD61-IKJEFLGZ)
MD062    DC    AL2(MD62-IKJEFLGZ)
MD063    DC    AL2(MD63-IKJEFLGZ)
MD064    DC    AL2(MD64-IKJEFLGZ)
MD065    DC    AL2(MD65-IKJEFLGZ)
MD066    DC    AL2(MD66-IKJEFLGZ)
MD067    DC    AL2(MD67-IKJEFLGZ)
MD068    DC    AL2(MD68-IKJEFLGZ)
MD069    DC    AL2(MD69-IKJEFLGZ)
MD070    DC    AL2(MD70-IKJEFLGZ)
MD071    DC    AL2(MD71-IKJEFLGZ)
         ORG   IKJEFLGZ+142
MD1      DS    CL6
         ORG   MD1
MD1OF    DC    AL2(MSG1-IKJEFLGZ)
MD1CODE  DC    AL2(0)
MD1TYPE  DC    AL2(256)
         ORG   MD1+6
MD2      DS    CL9
         ORG   MD2
MD2OF    DC    AL2(MSG2-IKJEFLGZ)
MD2CODE  DC    AL2(0)
MD2TYPE  DC    AL2(68)
MD2TXIN  DC    AL1(2)
MD2OFF1  DC    AL1(40)
MD2OFF2  DC    AL1(41)
         ORG   MD2+9
         DS    CL1
MD3      DS    CL6
         ORG   MD3
MD3OF    DC    AL2(MSG3-IKJEFLGZ)
MD3CODE  DC    AL2(1)
MD3TYPE  DC    AL2(64)
         ORG   MD3+6
MD4      DS    CL8
         ORG   MD4
MD4OF    DC    AL2(MSG4-IKJEFLGZ)
MD4CODE  DC    AL2(1)
MD4TYPE  DC    AL2(68)
MD4TXIN  DC    AL1(1)
MD4OFF1  DC    AL1(10)
         ORG   MD4+8
MD5      DS    CL9
         ORG   MD5
MD5OF    DC    AL2(MSG5-IKJEFLGZ)
MD5CODE  DC    AL2(0)
MD5TYPE  DC    AL2(68)
MD5TXIN  DC    AL1(2)
MD5OFF1  DC    AL1(28)
MD5OFF2  DC    AL1(35)
         ORG   MD5+9
         DS    CL1
MD6      DS    CL6
         ORG   MD6
MD6OF    DC    AL2(MSG6-IKJEFLGZ)
MD6CODE  DC    AL2(0)
MD6TYPE  DC    AL2(32)
         ORG   MD6+6
MD7      DS    CL8
         ORG   MD7
MD7OF    DC    AL2(MSG7-IKJEFLGZ)
MD7CODE  DC    AL2(6)
MD7TYPE  DC    AL2(68)
MD7TXIN  DC    AL1(1)
MD7OFF1  DC    AL1(17)
         ORG   MD7+8
MD8      DS    CL6
         ORG   MD8
MD8OF    DC    AL2(MSG8-IKJEFLGZ)
MD8CODE  DC    AL2(35)
MD8TYPE  DC    AL2(64)
         ORG   MD8+6
MD9      DS    CL8
         ORG   MD9
MD9OF    DC    AL2(MSG9-IKJEFLGZ)
MD9CODE  DC    AL2(6)
MD9TYPE  DC    AL2(68)
MD9TXIN  DC    AL1(1)
MD9OFF1  DC    AL1(25)
         ORG   MD9+8
MD10     DS    CL8
         ORG   MD10
MD10OF   DC    AL2(MSG10-IKJEFLGZ)
MD10CODE DC    AL2(6)
MD10TYPE DC    AL2(68)
MD10TXIN DC    AL1(1)
MD10OFF1 DC    AL1(25)
         ORG   MD10+8
MD11     DS    CL9
         ORG   MD11
MD11OF   DC    AL2(MSG11-IKJEFLGZ)
MD11CODE DC    AL2(6)
MD11TYPE DC    AL2(68)
MD11TXIN DC    AL1(2)
MD11OFF1 DC    AL1(22)
MD11OFF2 DC    AL1(42)
         ORG   MD11+9
         DS    CL1
MD12     DS    CL8
         ORG   MD12
MD12OF   DC    AL2(MSG12-IKJEFLGZ)
MD12CODE DC    AL2(0)
MD12TYPE DC    AL2(68)
MD12TXIN DC    AL1(1)
MD12OFF1 DC    AL1(33)
         ORG   MD12+8
MD13     DS    CL6
         ORG   MD13
MD13OF   DC    AL2(MSG13-IKJEFLGZ)
MD13CODE DC    AL2(35)
MD13TYPE DC    AL2(64)
         ORG   MD13+6
MD14     DS    CL6
         ORG   MD14
MD14OF   DC    AL2(MSG14-IKJEFLGZ)
MD14CODE DC    AL2(0)
MD14TYPE DC    AL2(64)
         ORG   MD14+6
MD15     DS    CL6
         ORG   MD15
MD15OF   DC    AL2(MSG15-IKJEFLGZ)
MD15CODE DC    AL2(25)
MD15TYPE DC    AL2(64)
         ORG   MD15+6
MD16     DS    CL10
         ORG   MD16
MD16OF   DC    AL2(MSG16-IKJEFLGZ)
MD16CODE DC    AL2(0)
MD16TYPE DC    AL2(70)
MD16TXIN DC    AL1(3)
MD16OFF1 DC    AL1(16)
MD16OFF2 DC    AL1(36)
MD16OFF3 DC    AL1(37)
         ORG   MD16+10
MD17     DS    CL8
         ORG   MD17
MD17OF   DC    AL2(MSG17-IKJEFLGZ)
MD17CODE DC    AL2(0)
MD17TYPE DC    AL2(68)
MD17TXIN DC    AL1(1)
MD17OFF1 DC    AL1(30)
         ORG   MD17+8
MD18     DS    CL11
         ORG   MD18
MD18OF   DC    AL2(MSG18-IKJEFLGZ)
MD18CODE DC    AL2(17)
MD18TYPE DC    AL2(22)
MD18TXIN DC    AL1(4)
MD18OFF1 DC    AL1(17)
MD18OFF2 DC    AL1(31)
MD18OFF3 DC    AL1(37)
MD18OFF4 DC    AL1(43)
         ORG   MD18+11
         DS    CL1
MD19     DS    CL6
         ORG   MD19
MD19OF   DC    AL2(MSG19-IKJEFLGZ)
MD19CODE DC    AL2(22)
MD19TYPE DC    AL2(64)
         ORG   MD19+6
MD20     DS    CL11
         ORG   MD20
MD20OF   DC    AL2(MSG20-IKJEFLGZ)
MD20CODE DC    AL2(5)
MD20TYPE DC    AL2(22)
MD20TXIN DC    AL1(4)
MD20OFF1 DC    AL1(29)
MD20OFF2 DC    AL1(36)
MD20OFF3 DC    AL1(42)
MD20OFF4 DC    AL1(48)
         ORG   MD20+11
         DS    CL1
MD21     DS    CL10
         ORG   MD21
MD21OF   DC    AL2(MSG21-IKJEFLGZ)
MD21CODE DC    AL2(16)
MD21TYPE DC    AL2(22)
MD21TXIN DC    AL1(3)
MD21OFF1 DC    AL1(17)
MD21OFF2 DC    AL1(37)
MD21OFF3 DC    AL1(38)
         ORG   MD21+10
MD22     DS    CL10
         ORG   MD22
MD22OF   DC    AL2(MSG28-IKJEFLGZ)
MD22CODE DC    AL2(26)
MD22TYPE DC    AL2(76)
MD22TXIN DC    AL1(3)
MD22OFF1 DC    AL1(10)
MD22OFF2 DC    AL1(29)
MD22OFF3 DC    AL1(33)
         ORG   MD22+10
MD23     DS    CL8
         ORG   MD23
MD23OF   DC    AL2(MSG23-IKJEFLGZ)
MD23CODE DC    AL2(14)
MD23TYPE DC    AL2(20)
MD23TXIN DC    AL1(1)
MD23OFF1 DC    AL1(53)
         ORG   MD23+8
MD24     DS    CL8
         ORG   MD24
MD24OF   DC    AL2(MSG24-IKJEFLGZ)
MD24CODE DC    AL2(12)
MD24TYPE DC    AL2(20)
MD24TXIN DC    AL1(1)
MD24OFF1 DC    AL1(35)
         ORG   MD24+8
MD25     DS    CL6
         ORG   MD25
MD25OF   DC    AL2(MSG25-IKJEFLGZ)
MD25CODE DC    AL2(0)
MD25TYPE DC    AL2(64)
         ORG   MD25+6
MD26     DS    CL8
         ORG   MD26
MD26OF   DC    AL2(MSG26-IKJEFLGZ)
MD26CODE DC    AL2(0)
MD26TYPE DC    AL2(68)
MD26TXIN DC    AL1(1)
MD26OFF1 DC    AL1(10)
         ORG   MD26+8
MD27     DS    CL10
         ORG   MD27
MD27OF   DC    AL2(MSG27-IKJEFLGZ)
MD27CODE DC    AL2(0)
MD27TYPE DC    AL2(68)
MD27TXIN DC    AL1(3)
MD27OFF1 DC    AL1(10)
MD27OFF2 DC    AL1(32)
MD27OFF3 DC    AL1(36)
         ORG   MD27+10
MD28     DS    CL10
         ORG   MD28
MD28OF   DC    AL2(MSG28-IKJEFLGZ)
MD28CODE DC    AL2(2)
MD28TYPE DC    AL2(76)
MD28TXIN DC    AL1(3)
MD28OFF1 DC    AL1(10)
MD28OFF2 DC    AL1(29)
MD28OFF3 DC    AL1(33)
         ORG   MD28+10
MD29     DS    CL6
         ORG   MD29
MD29OF   DC    AL2(MSG29-IKJEFLGZ)
MD29CODE DC    AL2(0)
MD29TYPE DC    AL2(64)
         ORG   MD29+6
MD30     DS    CL6
         ORG   MD30
MD30OF   DC    AL2(MSG30-IKJEFLGZ)
MD30CODE DC    AL2(36)
MD30TYPE DC    AL2(72)
         ORG   MD30+6
MD31     DS    CL6
         ORG   MD31
MD31OF   DC    AL2(0)
MD31CODE DC    AL2(0)
MD31TYPE DC    AL2(128)
         ORG   MD31+6
MDBAD    DS    CL6
         ORG   MDBAD
MDBADOF  DC    AL2(0)
MDBADCD  DC    AL2(0)
MDBADTYP DC    AL2(0)
         ORG   MDBAD+6
MD33     DS    CL8
         ORG   MD33
MD33OF   DC    AL2(MSG33-IKJEFLGZ)
MD33CODE DC    AL2(34)
MD33TYPE DC    AL2(20)
MD33TXIN DC    AL1(1)
MD33OFF1 DC    AL1(44)
         ORG   MD33+8
MD34     DS    CL8
         ORG   MD34
MD34OF   DC    AL2(MSG34-IKJEFLGZ)
MD34CODE DC    AL2(0)
MD34TYPE DC    AL2(68)
MD34TXIN DC    AL1(1)
MD34OFF1 DC    AL1(46)
         ORG   MD34+8
MD35     DS    CL6
         ORG   MD35
MD35OF   DC    AL2(MSG6-IKJEFLGZ)
MD35CODE DC    AL2(0)
MD35TYPE DC    AL2(512)
         ORG   MD35+6
MD36     DS    CL6
         ORG   MD36
MD36OF   DC    AL2(MSG36-IKJEFLGZ)
MD36CODE DC    AL2(28)
MD36TYPE DC    AL2(64)
         ORG   MD36+6
MD37     DS    CL6
         ORG   MD37
MD37OF   DC    AL2(MSG37-IKJEFLGZ)
MD37CODE DC    AL2(0)
MD37TYPE DC    AL2(64)
         ORG   MD37+6
MD38     DS    CL6
         ORG   MD38
MD38OF   DC    AL2(MSG38-IKJEFLGZ)
MD38CODE DC    AL2(0)
MD38TYPE DC    AL2(64)
         ORG   MD38+6
MD39     DS    CL8
         ORG   MD39
MD39OF   DC    AL2(MSG39-IKJEFLGZ)
MD39CODE DC    AL2(41)
MD39TYPE DC    AL2(64)
MD39TXIN DC    AL1(1)
MD39OFF1 DC    AL1(38)
         ORG   MD39+8
MD40     DS    CL6
         ORG   MD40
MD40OF   DC    AL2(MSG40-IKJEFLGZ)
MD40CODE DC    AL2(0)
MD40TYPE DC    AL2(64)
         ORG   MD40+6
MD41     DS    CL6
         ORG   MD41
MD41OF   DC    AL2(MSG41-IKJEFLGZ)
MD41CODE DC    AL2(0)
MD41TYPE DC    AL2(512)
         ORG   MD41+6
MD42     DS    CL8
         ORG   MD42
MD42OF   DC    AL2(MSG42-IKJEFLGZ)
MD42CODE DC    AL2(0)
MD42TYPE DC    AL2(68)
MD42TXIN DC    AL1(1)
MD42OFF1 DC    AL1(47)
         ORG   MD42+8
MD43     DS    CL8
         ORG   MD43
MD43OF   DC    AL2(MSG43-IKJEFLGZ)
MD43CODE DC    AL2(0)
MD43TYPE DC    AL2(68)
MD43TXIN DC    AL1(1)
MD43OFF1 DC    AL1(47)
         ORG   MD43+8
MD44     DS    CL8
         ORG   MD44
MD44OF   DC    AL2(MSG44-IKJEFLGZ)
MD44CODE DC    AL2(0)
MD44TYPE DC    AL2(68)
MD44TXIN DC    AL1(1)
MD44OFF1 DC    AL1(62)
         ORG   MD44+8
MD45     DS    CL9
         ORG   MD45
MD45OF   DC    AL2(MSG45-IKJEFLGZ)
MD45CODE DC    AL2(6)
MD45TYPE DC    AL2(68)
MD45TXIN DC    AL1(2)
MD45OFF1 DC    AL1(28)
MD45OFF2 DC    AL1(55)
         ORG   MD45+9
         DS    CL1
MD46     DS    CL8
         ORG   MD46
MD46OF   DC    AL2(MSG46-IKJEFLGZ)
MD46CODE DC    AL2(6)
MD46TYPE DC    AL2(68)
MD46TXIN DC    AL1(1)
MD46OFF1 DC    AL1(28)
         ORG   MD46+8
MD47     DS    CL6
         ORG   MD47
MD47OF   DC    AL2(MSG47-IKJEFLGZ)
MD47CODE DC    AL2(0)
MD47TYPE DC    AL2(64)
         ORG   MD47+6
MD48     DS    CL11
         ORG   MD48
MD48OF   DC    AL2(MSG48-IKJEFLGZ)
MD48CODE DC    AL2(17)
MD48TYPE DC    AL2(22)
MD48TXIN DC    AL1(4)
MD48OFF1 DC    AL1(17)
MD48OFF2 DC    AL1(24)
MD48OFF3 DC    AL1(31)
MD48OFF4 DC    AL1(38)
@NM00011 DS    0C
         ORG   MD48+11
         DS    CL1
MD49     DS    CL8
         ORG   MD49
MD49OF   DC    AL2(MSG49-IKJEFLGZ)
MD49CODE DC    AL2(0)
MD49TYPE DC    AL2(68)
MD49TXIN DC    AL1(1)
MD49OFF1 DC    AL1(15)
         ORG   MD49+8
MD50     DS    CL6
         ORG   MD50
MD50OF   DC    AL2(MSG50-IKJEFLGZ)
MD50CODE DC    AL2(0)
MD50TYPE DC    AL2(64)
         ORG   MD50+6
MD51     DS    CL6
         ORG   MD51
MD51OF   DC    AL2(MSG51-IKJEFLGZ)
MD51CODE DC    AL2(25)
MD51TYPE DC    AL2(64)
         ORG   MD51+6
MD52     DS    CL6
         ORG   MD52
MD52OF   DC    AL2(MSG52-IKJEFLGZ)
MD52CODE DC    AL2(35)
MD52TYPE DC    AL2(64)
         ORG   MD52+6
MD53     DS    CL10
         ORG   MD53
MD53OF   DC    AL2(MSG53-IKJEFLGZ)
MD53CODE DC    AL2(25)
MD53TYPE DC    AL2(68)
MD53TXIN DC    AL1(3)
MD53OFF1 DC    AL1(15)
MD53OFF2 DC    AL1(26)
MD53OFF3 DC    AL1(28)
         ORG   MD53+10
MD54     DS    CL8
         ORG   MD54
MD54OF   DC    AL2(MSG54-IKJEFLGZ)
MD54CODE DC    AL2(6)
MD54TYPE DC    AL2(68)
MD54TXIN DC    AL1(1)
MD54OFF1 DC    AL1(16)
         ORG   MD54+8
MD55     DS    CL8
         ORG   MD55
MD55OF   DC    AL2(MSG55-IKJEFLGZ)
MD55CODE DC    AL2(25)
MD55TYPE DC    AL2(68)
MD55TXIN DC    AL1(1)
MD55OFF1 DC    AL1(10)
         ORG   MD55+8
MD56     DS    CL8
         ORG   MD56
MD56OF   DC    AL2(MSG56-IKJEFLGZ)
MD56CODE DC    AL2(25)
MD56TYPE DC    AL2(68)
MD56TXIN DC    AL1(1)
MD56OFF1 DC    AL1(10)
         ORG   MD56+8
MD57     DS    CL6
         ORG   MD57
MD57OF   DC    AL2(MSG57-IKJEFLGZ)
MD57CODE DC    AL2(0)
MD57TYPE DC    AL2(64)
         ORG   MD57+6
MD58     DS    CL6
         ORG   MD58
MD58OF   DC    AL2(MSG58-IKJEFLGZ)
MD58CODE DC    AL2(0)
MD58TYPE DC    AL2(64)
         ORG   MD58+6
MD59     DS    CL6
         ORG   MD59
MD59OF   DC    AL2(MSG59-IKJEFLGZ)
MD59CODE DC    AL2(71)
MD59TYPE DC    AL2(64)
         ORG   MD59+6
MD60     DS    CL6
         ORG   MD60
MD60OF   DC    AL2(MSG60-IKJEFLGZ)
MD60CODE DC    AL2(63)
MD60TYPE DC    AL2(64)
         ORG   MD60+6
MD61     DS    CL6
         ORG   MD61
MD61OF   DC    AL2(MSG61-IKJEFLGZ)
MD61CODE DC    AL2(71)
MD61TYPE DC    AL2(64)
         ORG   MD61+6
MD62     DS    CL6
         ORG   MD62
MD62OF   DC    AL2(MSG62-IKJEFLGZ)
MD62CODE DC    AL2(0)
MD62TYPE DC    AL2(64)
         ORG   MD62+6
MD63     DS    CL6
         ORG   MD63
MD63OF   DC    AL2(MSG63-IKJEFLGZ)
MD63CODE DC    AL2(0)
MD63TYPE DC    AL2(1024)
         ORG   MD63+6
MD64     DS    CL6
         ORG   MD64
MD64OF   DC    AL2(MSG64-IKJEFLGZ)
MD64CODE DC    AL2(65)
MD64TYPE DC    AL2(64)
         ORG   MD64+6
MD65     DS    CL6
         ORG   MD65
MD65OF   DC    AL2(MSG65-IKJEFLGZ)
MD65CODE DC    AL2(0)
MD65TYPE DC    AL2(32)
         ORG   MD65+6
MD66     DS    CL6
         ORG   MD66
MD66OF   DC    AL2(MSG66-IKJEFLGZ)
MD66CODE DC    AL2(0)
MD66TYPE DC    AL2(64)
         ORG   MD66+6
MD67     DS    CL6
         ORG   MD67
MD67OF   DC    AL2(MSG67-IKJEFLGZ)
MD67CODE DC    AL2(0)
MD67TYPE DC    AL2(64)
         ORG   MD67+6
MD68     DS    CL6
         ORG   MD68
MD68OF   DC    AL2(MSG68-IKJEFLGZ)
MD68CODE DC    AL2(0)
MD68TYPE DC    AL2(64)
         ORG   MD68+6
MD69     DS    CL6
         ORG   MD69
MD69OF   DC    AL2(MSG69-IKJEFLGZ)
MD69CODE DC    AL2(0)
MD69TYPE DC    AL2(64)
         ORG   MD69+6
MD70     DS    CL6
         ORG   MD70
MD70OF   DC    AL2(MSG70-IKJEFLGZ)
MD70CODE DC    AL2(0)
MD70TYPE DC    AL2(64)
         ORG   MD70+6
MD71     DS    CL6
         ORG   MD71
MD71OF   DC    AL2(MSG71-IKJEFLGZ)
MD71CODE DC    AL2(0)
MD71TYPE DC    AL2(1024)
         ORG   MD71+6
MSG1     DS    CL36
         ORG   MSG1
MSG1LL   DC    AL2(36)
MSG1OF   DC    H'0'
MSG1TXT  DC    CL32'IKJ56400A ENTER LOGON OR LOGOFF-'
         ORG   MSG1+36
MSG2     DS    CL45
         ORG   MSG2
MSG2LL   DC    AL2(45)
MSG2OF   DC    H'0'
MSG2TXT  DC    CL41'IKJ56470I LAST STEP COMPLETION CODE WAS  '
         ORG   MSG2+45
         DS    CL1
MSG3     DS    CL36
         ORG   MSG3
MSG3LL   DC    AL2(36)
MSG3OF   DC    H'0'
MSG3TXT  DC    CL32'IKJ56401I INVALID COMMAND SYNTAX'
         ORG   MSG3+36
MSG4     DS    CL48
         ORG   MSG4
MSG4LL   DC    AL2(48)
MSG4OF   DC    H'0'
MSG4TXT  DC    CL44'IKJ56410I  COMMAND NOT ACCEPTED DURING LOGON'
         ORG   MSG4+48
MSG5     DS    CL39
         ORG   MSG5
MSG5LL   DC    AL2(39)
MSG5OF   DC    H'0'
MSG5TXT  DC    CL35'IKJ56454I LOGON TERMINATED,  ERROR '
         ORG   MSG5+39
         DS    CL1
MSG6     DS    CL23
         ORG   MSG6
MSG6LL   DC    AL2(23)
MSG6OF   DC    H'0'
MSG6TXT  DC    CL19'IKJ56429A REENTER -'
         ORG   MSG6+23
         DS    CL1
MSG7     DS    CL47
         ORG   MSG7
MSG7LL   DC    AL2(47)
MSG7OF   DC    H'0'
MSG7TXT  DC    CL43'IKJ56420I USERID  NOT AUTHORIZED TO USE TSO'
         ORG   MSG7+47
         DS    CL1
MSG8     DS    CL48
         ORG   MSG8
MSG8LL   DC    AL2(48)
MSG8OF   DC    H'0'
MSG8TXT  DC    CL44'IKJ56421I PASSWORD NOT AUTHORIZED FOR USERID'
         ORG   MSG8+48
MSG9     DS    CL44
         ORG   MSG9
MSG9LL   DC    AL2(44)
MSG9OF   DC    H'0'
MSG9TXT  DC    CL40'IKJ56422I ACCOUNT NUMBER  NOT AUTHORIZED'
         ORG   MSG9+44
MSG10    DS    CL44
         ORG   MSG10
MSG10LL  DC    AL2(44)
MSG10OF  DC    H'0'
MSG10TXT DC    CL40'IKJ56424I PROCEDURE NAME  NOT AUTHORIZED'
         ORG   MSG10+44
MSG11    DS    CL46
         ORG   MSG11
MSG11LL  DC    AL2(46)
MSG11OF  DC    H'0'
MSG11TXT DC    CL42'IKJ56423I REGION SIZE  EXCEEDS LIMIT SIZE '
         ORG   MSG11+46
MSG12    DS    CL44
         ORG   MSG12
MSG12LL  DC    AL2(44)
MSG12OF  DC    H'0'
MSG12TXT DC    CL40'IKJ56425I LOGON REJECTED, USERID  IN USE'
         ORG   MSG12+44
MSG14    DS    CL47
         ORG   MSG14
MSG14LL  DC    AL2(47)
MSG14OF  DC    H'0'
MSG14TXT DC    CL43'IKJ56428I LOGON REJECTED, TOO MANY ATTEMPTS'
         ORG   MSG14+47
         DS    CL1
MSG16    DS    CL41
         ORG   MSG16
MSG16LL  DC    AL2(41)
MSG16OF  DC    H'0'
MSG16TXT DC    CL37'IKJ56451I LOGON , INSTALLATION EXIT  '
         ORG   MSG16+41
         DS    CL1
MSG17    DS    CL34
         ORG   MSG17
MSG17LL  DC    AL2(34)
MSG17OF  DC    H'0'
MSG17TXT DC    CL30'IKJ56452I SYSTEM ERROR. LOGON '
         ORG   MSG17+34
MSG19    DS    CL26
         ORG   MSG19
MSG19LL  DC    AL2(26)
MSG19OF  DC    H'0'
MSG19TXT DC    CL22'IKJ56457I LOGON FAILED'
         ORG   MSG19+26
MSG28    DS    CL38
         ORG   MSG28
MSG28LL  DC    AL2(38)
MSG28OF  DC    H'0'
MSG28TXT DC    CL34'IKJ56470I  LOGGED OFF TSO AT  ON  '
         ORG   MSG28+38
MSG26    DS    CL14
         ORG   MSG26
MSG26LL  DC    AL2(14)
MSG26OF  DC    H'0'
MSG26TXT DC    CL10'IKJ56470I '
         ORG   MSG26+14
MSG27    DS    CL40
         ORG   MSG27
MSG27LL  DC    AL2(40)
MSG27OF  DC    H'0'
MSG27TXT DC    CL36'IKJ56455I  LOGON IN PROGRESS AT  ON '
         ORG   MSG27+40
MSG29    DS    CL31
         ORG   MSG29
MSG29LL  DC    AL2(31)
MSG29OF  DC    H'0'
MSG29TXT DC    CL27'IKJ56453I SESSION CANCELLED'
         ORG   MSG29+31
         DS    CL1
MSG30    DS    CL5
         ORG   MSG30
MSG30LL  DC    H'5'
MSG30OF  DC    H'0'
MSG30TXT DC    CL1' '
         ORG   MSG30+5
         DS    CL1
MSG34    DS    CL50
         ORG   MSG34
MSG34LL  DC    AL2(50)
MSG34OF  DC    H'0'
MSG34TXT DC    CL46'IKJ56456I INCONSISTENT AUTHORIZATION DATA FOR '
         ORG   MSG34+50
MSG36    DS    CL45
         ORG   MSG36
MSG36LL  DC    AL2(45)
MSG36OF  DC    H'0'
MSG36TXT DC    CL41'IKJ56472I LOGON INFORMATION NOT AVAILABLE'
         ORG   MSG36+45
         DS    CL1
MSG37    DS    CL56
         ORG   MSG37
MSG37LL  DC    AL2(56)
MSG37OF  DC    H'0'
MSG37TXT DC    CL52'IKJ56460I TSOLOGON REJECTED,  ALL REGIONS BEING HELC
               D'
         ORG   MSG37+56
MSG38    DS    CL60
         ORG   MSG38
MSG38LL  DC    H'60'
MSG38OF  DC    H'0'
MSG38TXT DC    CL56'IKJ56402I RECONNECT SPECIFIED - OTHER OPERANDS IGNOC
               RED'
@NM00001 DS    0C
         ORG   MSG38+60
MSG39    DS    CL44
         ORG   MSG39
MSG39LL  DC    H'44'
MSG39OF  DC    H'0'
MSG39TXT DC    CL40'IKJ56407I PASSWORD INVALID FOR USERID '
@NM00002 DS    0C
         ORG   MSG39+44
MSG40    DS    CL53
         ORG   MSG40
MSG40LL  DC    H'53'
MSG40OF  DC    H'0'
MSG40TXT DC    CL49'IKJ56408I PASSWORD REQUIRED FOR LOGON RECONNECT'
@NM00003 DS    0C
         ORG   MSG40+53
         DS    CL1
MSG41    DS    CL25
         ORG   MSG41
MSG41LL  DC    H'25'
MSG41OF  DC    H'0'
MSG41TXT DC    CL21'IKJ56429A REENTER -'
@NM00004 DS    0C
         ORG   MSG41+25
         DS    CL1
MSG42    DS    CL63
         ORG   MSG42
MSG42LL  DC    H'63'
MSG42OF  DC    H'0'
MSG42TXT DC    CL59'IKJ56409I TSOLOGON RECONNECT REJECTED - USERID  NOTC
                FOUND'
@NM00005 DS    0C
         ORG   MSG42+63
         DS    CL1
MSG43    DS    CL61
         ORG   MSG43
MSG43LL  DC    H'61'
MSG43OF  DC    H'0'
MSG43TXT DC    CL57'IKJ56411I TSOLOGON RECONNECT REJECTED - USERID  IN C
                USE'
@NM00006 DS    0C
         ORG   MSG43+61
         DS    CL1
MSG44    DS    CL68
         ORG   MSG44
MSG44LL  DC    H'68'
MSG44OF  DC    H'0'
MSG44TXT DC    CL64'IKJ56403I PERFORMANCE GROUPS NOT AUTHORIZED FOR USEC
                BY USERID '
@NM00007 DS    0C
         ORG   MSG44+68
MSG45    DS    CL61
         ORG   MSG45
MSG45LL  DC    H'61'
MSG45OF  DC    H'0'
MSG45TXT DC    CL57'IKJ56404I PERFORMANCE GROUP  NOT AUTHORIZED FOR USEC
               RID '
@NM00008 DS    0C
         ORG   MSG45+61
         DS    CL1
MSG46    DS    CL56
         ORG   MSG46
MSG46LL  DC    H'56'
MSG46OF  DC    H'0'
MSG46TXT DC    CL52'IKJ56405I PERFORMANCE GROUP  NOT DEFINED TO SYSTEM'
@NM00009 DS    0C
         ORG   MSG46+56
MSG47    DS    CL76
         ORG   MSG47
MSG47LL  DC    H'76'
MSG47OF  DC    H'0'
MSG47TXT DC    CL72'IKJ56406I ABEND WHILE PROCESSING BROADCAST MESSAGESC
               , LOGON PROCEEDING.'
@NM00010 DS    0C
         ORG   MSG47+76
MSG49    DS    CL71
         ORG   MSG49
MSG49LL  DC    H'71'
MSG49OF  DC    H'0'
MSG49TXT DC    CL67'IKJ56412I DEST  NOT DEFINED TO SUBSYSTEM, DEFAULT DC
               EST TO BE USED'
@NM00012 DS    0C
         ORG   MSG49+71
         DS    CL1
MSG50    DS    CL48
         ORG   MSG50
MSG50LL  DC    H'48'
MSG50OF  DC    H'0'
MSG50TXT DC    CL44'IKJ56454I LOGON TERMINATED, TERMINAL ERROR'
@NM00013 DS    0C
         ORG   MSG50+48
MSG51    DS    CL69
         ORG   MSG51
MSG51LL  DC    H'69'
MSG51OF  DC    H'0'
MSG51TXT DC    CL65'IKJ56425I LOGON REJECTED, RACF TEMPORARILY REVOKINGC
                USER ACCESS'
@NM00014 DS    0C
         ORG   MSG51+69
         DS    CL1
MSG52    DS    CL72
         ORG   MSG52
MSG52LL  DC    H'72'
MSG52OF  DC    H'0'
MSG52TXT DC    CL68'IKJ56415I CURRENT PASSWORD HAS EXPIRED AND NO NEW PC
               ASSWORD ENTERED'
@NM00015 DS    0C
         ORG   MSG52+72
MSG53    DS    CL46
         ORG   MSG53
MSG53LL  DC    H'46'
MSG53OF  DC    H'0'
MSG53TXT DC    CL42'IKJ56416I RACF  ERROR CODE ,  TERMINATED'
@NM00016 DS    0C
         ORG   MSG53+46
MSG13    DS    CL48
         ORG   MSG13
MSG13LL  DC    H'48'
MSG13OF  DC    H'0'
MSG13TXT DC    CL44'IKJ56414I NEW-PASSWORD IS INVALID FOR RACF'
@NM00017 DS    0C
         ORG   MSG13+48
MSG25    DS    CL46
         ORG   MSG25
MSG25LL  DC    H'46'
MSG25OF  DC    H'0'
MSG25TXT DC    CL42'IKJ56418I CONTACT YOUR TSO ADMINISTRATOR'
@NM00018 DS    0C
         ORG   MSG25+46
MSG15    DS    CL56
         ORG   MSG15
MSG15LL  DC    H'56'
MSG15OF  DC    H'0'
MSG15TXT DC    CL52'IKJ56413I LOGON REJECTED BY RACF INSTALLATION EXIT'
@NM00019 DS    0C
         ORG   MSG15+56
MSG54    DS    CL37
         ORG   MSG54
MSG54LL  DC    H'37'
MSG54OF  DC    H'0'
MSG54TXT DC    CL33'IKJ56417I GROUP  NOT AUTHORIZED'
@NM00020 DS    0C
         ORG   MSG54+37
         DS    CL1
MSG55    DS    CL42
         ORG   MSG55
MSG55LL  DC    H'42'
MSG55OF  DC    H'0'
MSG55TXT DC    CL38'IKJ56419I  IGNORED FOR NON RACF USER'
@NM00021 DS    0C
         ORG   MSG55+42
MSG56    DS    CL51
         ORG   MSG56
MSG56LL  DC    H'51'
MSG56OF  DC    H'0'
MSG56TXT DC    CL47'IKJ56426I  IGNORED, RACF IS NOT IN THE SYSTEM'
@NM00022 DS    0C
         ORG   MSG56+51
         DS    CL1
MSG57    DS    CL65
         ORG   MSG57
MSG57LL  DC    H'65'
MSG57OF  DC    H'0'
MSG57TXT DC    CL61'IKJ56431I LOGON TERMINATED. NOT AUTHORIZED TO THIS C
               TERMINAL'
@NM00023 DS    0C
         ORG   MSG57+65
         DS    CL1
MSG58    DS    CL77
         ORG   MSG58
MSG58LL  DC    H'77'
MSG58OF  DC    H'0'
MSG58TXT DC    CL73'IKJ56432I TSOLOGON RECONNECT REJECTED - NOT AUTHORIC
               ZED TO THIS TERMINAL'
@NM00024 DS    0C
         ORG   MSG58+77
         DS    CL1
MSG59    DS    CL50
         ORG   MSG59
MSG59LL  DC    H'50'
MSG59OF  DC    H'0'
MSG59TXT DC    CL46'IKJ56433I OPERATOR ID CARD IS NOT AUTHORIZED'
@NM00025 DS    0C
         ORG   MSG59+50
MSG60    DS    CL44
         ORG   MSG60
MSG60LL  DC    H'44'
MSG60OF  DC    H'0'
MSG60TXT DC    CL40'IKJ56434I OPERATOR ID CARD IS REQUIRED'
@NM00026 DS    0C
         ORG   MSG60+44
MSG61    DS    CL44
         ORG   MSG61
MSG61LL  DC    H'44'
MSG61OF  DC    H'0'
MSG61TXT DC    CL40'IKJ56435I NOT A VALID OPERATOR ID CARD'
@NM00027 DS    0C
         ORG   MSG61+44
MSG62    DS    CL87
         ORG   MSG62
MSG62LL  DC    H'87'
MSG62OF  DC    H'0'
MSG62TXT DC    CL83'IKJ56436I LOGON TERMINATED. OPERATOR ID CARD NOT SUC
               PPORTED FOR THIS TERMINAL TYPE'
@NM00028 DS    0C
         ORG   MSG62+87
         DS    CL1
MSG63    DS    CL40
         ORG   MSG63
MSG63LL  DC    H'40'
MSG63OF  DC    H'0'
MSG63TXT DC    CL36'IKJ56437A ENTER OPERATOR ID CARD -'
@NM00029 DS    0C
         ORG   MSG63+40
MSG64    DS    CL45
         ORG   MSG64
MSG64LL  DC    H'45'
MSG64OF  DC    H'0'
MSG64TXT DC    CL41'IKJ56438I USE OF GROUP HAS BEEN REVOKED'
@NM00030 DS    0C
         ORG   MSG64+45
         DS    CL1
MSG65    DS    CL38
         ORG   MSG65
MSG65LL  DC    H'38'
MSG65OF  DC    H'0'
MSG65TXT DC    CL34'IKJ56439A REENTER NEW GROUP NAME'
@NM00031 DS    0C
         ORG   MSG65+38
MSG66    DS    CL71
         ORG   MSG66
MSG66LL  DC    H'71'
MSG66OF  DC    H'0'
MSG66TXT DC    CL67'IKJ56440I TSOLOGON RECONNECT REJECTED - PASSWORD INC
               VALID FOR RACF'
@NM00032 DS    0C
         ORG   MSG66+71
         DS    CL1
MSG67    DS    CL71
         ORG   MSG67
MSG67LL  DC    H'71'
MSG67OF  DC    H'0'
MSG67TXT DC    CL67'IKJ56441I TSOLOGON RECONNECT REJECTED - USER NOT DEC
               FINED TO GROUP'
@NM00033 DS    0C
         ORG   MSG67+71
         DS    CL1
MSG68    DS    CL69
         ORG   MSG68
MSG68LL  DC    H'69'
MSG68OF  DC    H'0'
MSG68TXT DC    CL65'IKJ56442I TSOLOGON RECONNECT REJECTED BY RACF INSTAC
               LLATION EXIT'
@NM00034 DS    0C
         ORG   MSG68+69
         DS    CL1
MSG69    DS    CL73
         ORG   MSG69
MSG69LL  DC    H'73'
MSG69OF  DC    H'0'
MSG69TXT DC    CL69'IKJ56443I TSOLOGON RECONNECT REJECTED - USER ACCESSC
                REVOKED BY RACF'
@NM00035 DS    0C
         ORG   MSG69+73
         DS    CL1
MSG70    DS    CL75
         ORG   MSG70
MSG70LL  DC    H'75'
MSG70OF  DC    H'0'
MSG70TXT DC    CL71'IKJ56444I TSOLOGON RECONNECT REJECTED - USE OF GROUC
               P HAS BEEN REVOKED'
@NM00036 DS    0C
         ORG   MSG70+75
         DS    CL1
MSG71    DS    CL42
         ORG   MSG71
MSG71LL  DC    H'42'
MSG71OF  DC    H'0'
MSG71TXT DC    CL38'IKJ56437A REENTER OPERATOR ID CARD -'
@NM00037 DS    0C
         ORG   MSG71+42
@00      EQU   00                      EQUATES FOR REGISTERS 0-15
@01      EQU   01
@02      EQU   02
@03      EQU   03
@04      EQU   04
@05      EQU   05
@06      EQU   06
@07      EQU   07
@08      EQU   08
@09      EQU   09
@10      EQU   10
@11      EQU   11
@12      EQU   12
@13      EQU   13
@14      EQU   14
@15      EQU   15
         ENTRY IKJEFLGZ
@ENDDATA EQU   *
         END   IKJEFLGN,(C'PLS1543',0701,78173)
