         TITLE 'IKJEFF53 - IBM-SUPPLIED FIB INSTALLATION EXIT          *
                        '
IKJEFF53 CSECT ,                                                   0001
@MAINENT DS    0H                                                  0001
         USING *,@15                                               0001
         B     @PROLOG                                             0001
         DC    AL1(16)                                             0001
         DC    C'IKJEFF53  77.272'                                 0001
         DROP  @15
@PROLOG  STM   @14,@12,12(@13)                                     0001
         BALR  @12,0                                               0001
@PSTART  DS    0H                                                  0001
         USING @PSTART,@12                                         0001
         L     @00,@SIZDATD                                        0001
         GETMAIN  R,LV=(0)
         LR    @11,@01                                             0001
         USING @DATD,@11                                           0001
         ST    @13,@SA00001+4                                      0001
         LM    @00,@01,20(@13)                                     0001
         ST    @11,8(,@13)                                         0001
         LR    @13,@11                                             0001
         MVC   @PC00001(4),0(@01)                                  0001
DUMYLBL1 DS    0H                                                  0003
DUMYLBL2 DS    0H                                                  0032
*   IEPTR=R1;                       /* USE LOCAL POINTER TO INPUT  0032
*                                      PARAMETER LIST                */
         LR    IEPTR,R1                                            0032
*   RFY                                                            0033
*     R1 UNRSTD;                                                   0033
*   RETCODE=IECONTIN;               /* INITIALIZE RETURN CODE TO BE
*                                      FOR NORMAL CASE - JOBNAME IS
*                                      O.K. AND COMMAND SHOULD     0034
*                                      CONTINUE PROCESSING           */
*                                                                  0034
         SLR   RETCODE,RETCODE                                     0034
*   /*****************************************************************/
*   /*                                                               */
*   /* ONLY DO PROCESSING IF CALLER IS CANCEL OR OUTPUT COMMAND      */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0035
*   IF CMNDCODE=IECANCEL×CMNDCODE=IEOUTPUT THEN/* SPECIAL LOGIC IF 0035
*                                      CALLER NOT STATUS (OR       0035
*                                      UNDEFINED) COMMAND            */
         L     @10,CODEP(,IEPTR)                                   0035
         CLI   CMNDCODE(@10),4                                     0035
         BE    @RT00035                                            0035
         CLI   CMNDCODE(@10),8                                     0035
         BNE   @RF00035                                            0035
@RT00035 DS    0H                                                  0036
*     DO;                           /* DOCHECK DO/END GROUP          */
*                                                                  0036
*       /*************************************************************/
*       /*                                                           */
*       /* FIRST TIME ENTRY FOR A JOBNAME                            */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0037
*       IF MESSAGEP=0 THEN          /* IF NO MESSAGE ISSUED FOR LAST
*                                      ENTRY                         */
         L     @10,MESSAGEP(,IEPTR)                                0037
         LTR   @10,@10                                             0037
         BNZ   @RF00037                                            0037
*         DO;                       /* ENTRY1 DO/END GROUP           */
*                                                                  0038
*           /*********************************************************/
*           /*                                                       */
*           /* CHECK WHETHER JOBNAME IS VALID                        */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0039
*           IF(CMNDCODE=IECANCEL&^(JOBNAMEL>IDLENGTH&USERID(1:IDLENGTH)
*               =IEJOBNM(1:IDLENGTH)))×(CMNDCODE=IEOUTPUT&^(JOBNAMEL>=
*               IDLENGTH&USERID(1:IDLENGTH)=IEJOBNM(1:IDLENGTH))) THEN
         L     @10,CODEP(,IEPTR)                                   0039
         CLI   CMNDCODE(@10),4                                     0039
         BNE   @GL00002                                            0039
         L     @10,NAMELENP(,IEPTR)                                0039
         L     @01,IDLENPTR(,IEPTR)                                0039
         SLR   @15,@15                                             0039
         IC    @15,IDLENGTH(,@01)                                  0039
         CH    @15,JOBNAMEL(,@10)                                  0039
         BNL   @RT00039                                            0039
         L     @10,USERIDP(,IEPTR)                                 0039
         L     @01,JOBNAMEP(,IEPTR)                                0039
         BCTR  @15,0                                               0039
         EX    @15,@SC00140                                        0039
         BNE   @RT00039                                            0039
@GL00002 L     @10,CODEP(,IEPTR)                                   0039
         CLI   CMNDCODE(@10),8                                     0039
         BNE   @RF00039                                            0039
         L     @10,NAMELENP(,IEPTR)                                0039
         L     @01,IDLENPTR(,IEPTR)                                0039
         SLR   @15,@15                                             0039
         IC    @15,IDLENGTH(,@01)                                  0039
         CH    @15,JOBNAMEL(,@10)                                  0039
         BH    @RT00039                                            0039
         L     @10,USERIDP(,IEPTR)                                 0039
         L     @01,JOBNAMEP(,IEPTR)                                0039
         BCTR  @15,0                                               0039
         EX    @15,@SC00140                                        0039
         BE    @RF00039                                            0039
@RT00039 DS    0H                                                  0040
*                                   /* ANY STATUS JOBNAME O.K.,    0040
*                                      CANCEL NEEDS JOBNAME=USERID 0040
*                                      PLUS AT LEAST ONE CHARACTER,
*                                      AND OUTPUT NEEDS            0040
*                                      JOBNAME=USERID OR USERID PLUS
*                                      AT LEAST ONE CHARACTER @Y02668
*                                                            @AZ25772*/
*             DO;                   /* BAD JOBN DO/END GROUP         */
*                                                                  0040
*               /*****************************************************/
*               /*                                                   */
*               /* IF INVALID, BUILD MESSAGE - SAY REJECTING THIS    */
*               /* JOBNAME                                           */
*               /*                                                   */
*               /*****************************************************/
*                                                                  0041
*               RFY                                                0041
*                (R0,                                              0041
*                 R1) RSTD;                                        0041
*               R0=GETMINFO;        /* SUBPOOL AND LENGTH OF MESSAGE
*                                      AREA (MUST GET REENTRANT CORE
*                                      THAT WON'T BE FREED WHEN    0042
*                                      RETURN)                       */
         L     R0,GETMINFO                                         0042
*               GENERATE;                                          0043
         GETMAIN R,LV=(0)               GET MESSAGE BUFFER
*               MESSAGEP=R1;        /* MOVE POINTER TO MESSAGE BUFFER
*                                      INTO PARAMETER LIST           */
         ST    R1,MESSAGEP(,IEPTR)                                 0044
*               RFY                                                0045
*                (R0,                                              0045
*                 R1) UNRSTD;                                      0045
*               REJMSG=' ';         /* INITIALIZE BUFFER WITH BLANKS */
         L     @10,MESSAGEP(,IEPTR)                                0046
         MVI   REJMSG+1(@10),C' '                                  0046
         MVC   REJMSG+2(82,@10),REJMSG+1(@10)                      0046
         MVI   REJMSG(@10),C' '                                    0046
*               REJMLEN=LENGTH(REJMSG);/* PUT IN MAXIMUM LENGTH      */
         MVC   REJMLEN(2,@10),@CH00137                             0047
*               REJJOB='JOB';                                      0048
         MVI   REJJOB+3(@10),C' '                                  0048
         MVC   REJJOB(3,@10),@CC00135                              0048
*               REJSLOT(1:JOBNAMEL)=IEJOBNM(1:JOBNAMEL);/* INSERT THE
*                                      BAD JOBNAME                   */
         L     @01,NAMELENP(,IEPTR)                                0049
         LH    @15,JOBNAMEL(,@01)                                  0049
         LR    @14,@15                                             0049
         BCTR  @14,0                                               0049
         L     @01,JOBNAMEP(,IEPTR)                                0049
         EX    @14,@SM00142                                        0049
*               TEMPOFST=JOBNAMEL+2;/* INDEX PAST BLANK AFTER JOBNAME*/
*                                                                  0050
         AL    @15,@CF00136                                        0050
         LR    TEMPOFST,@15                                        0050
*               /*****************************************************/
*               /*                                                   */
*               /* DIFFERENT MESSAGE TEXTS FOR CANCEL AND OUTPUT     */
*               /*                                                   */
*               /*****************************************************/
*                                                                  0051
*               IF CMNDCODE=IECANCEL THEN/* IF COMMAND IS CANCEL     */
         L     @01,CODEP(,IEPTR)                                   0051
         CLI   CMNDCODE(@01),4                                     0051
         BNE   @RF00051                                            0051
*                 REJSLOT(TEMPOFST:TEMPOFST+LENGTH(REJTEXT1)-1)=   0052
*                     REJTEXT1;     /* INSERT REASON FOR REJECTION 0052
*                                      REJECTION              @Y02668*/
         ALR   @10,TEMPOFST                                        0052
         MVC   REJSLOT-1(66,@10),REJTEXT1                          0052
*               ELSE                /* ELSE INSERT TEXT FOR OUTPUT   */
*                 REJSLOT(TEMPOFST:TEMPOFST+LENGTH(REJTEXT2)-1)=   0053
*                     REJTEXT2;     /* REASON FOR REJECTION   @Y02668*/
         B     @RC00051                                            0053
@RF00051 L     @10,MESSAGEP(,IEPTR)                                0053
         ALR   @10,TEMPOFST                                        0053
         MVC   REJSLOT-1(69,@10),REJTEXT2                          0053
*               RETCODE=IEMSG;      /* SET RETURN CODE TO PUT OUT MSG*/
@RC00051 LA    RETCODE,8                                           0054
*             END;                  /* END BADJOBN DO/END GROUP      */
*         END;                      /* END ENTRY1 DO/END GROUP       */
*                                                                  0057
*       /*************************************************************/
*       /*                                                           */
*       /* SECOND TIME ENTRY (FREE MESSAGE BUFFER AND REJECT JOBNAME)*/
*       /*                                                           */
*       /*************************************************************/
*                                                                  0057
*       ELSE                                                       0057
*         DO;                       /* ENTRY2 DO/END GROUP           */
         B     @RC00037                                            0057
@RF00037 DS    0H                                                  0058
*           RETCODE=IEREJECT;       /* SET RETURN CODE TO DELETE   0058
*                                      ENTRY (ALREADY HAD ERROR    0058
*                                      MESSAGE ISSUED AFTER FIRST  0058
*                                      ENTRY)                        */
         LA    RETCODE,12                                          0058
*           RFY                                                    0059
*            (R0,                                                  0059
*             R1) RSTD;                                            0059
*           R1=MESSAGEP;                                           0060
         L     R1,MESSAGEP(,IEPTR)                                 0060
*           R0=GETMINFO;            /* SUBPOOL AND LENGTH OF MSG AREA*/
         L     R0,GETMINFO                                         0061
*           GENERATE;                                              0062
         FREEMAIN  R,LV=(0),A=(1)      FREE MESSAGE BUFFER
*           RFY                                                    0063
*            (R0,                                                  0063
*             R1) UNRSTD;                                          0063
*           MESSAGEP=0;             /* REINITIALIZE ENTRY IN PARMLIST*/
         SLR   @10,@10                                             0064
         ST    @10,MESSAGEP(,IEPTR)                                0064
*         END;                      /* END ENTRY2 DO/END GROUP       */
*     END;                          /* END DOCHECK DO/END GROUP      */
*                                                                  0066
@RC00037 DS    0H                                                  0067
*   /*****************************************************************/
*   /*                                                               */
*   /* RETURN TO CALLER (STATUS, CANCEL, OR OUTPUT COMMAND)          */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0067
*   RETURN CODE(RETCODE);           /* NOTE THAT RETCODE IS        0067
*                                      INITIALIZED TO ZERO           */
@RF00035 L     @13,4(,@13)                                         0067
         L     @00,@SIZDATD                                        0067
         LR    @01,@11                                             0067
         FREEMAIN R,LV=(0),A=(1)
         LR    @15,@05                                             0067
         L     @14,12(,@13)                                        0067
         LM    @00,@12,20(@13)                                     0067
         BR    @14                                                 0067
*   END IKJEFF53                                                   0068
*                                                                  0068
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */
*/*%INCLUDE SYSLIB  (IKJEFFIE)                                       */
*                                                                  0068
*       ;                                                          0068
@DATA    DS    0H
@CH00137 DC    H'84'
@SC00140 CLC   USERID(0,@10),IEJOBNM(@01)
@SM00142 MVC   REJSLOT(0,@10),IEJOBNM(@01)
@DATD    DSECT
         DS    0F
@SA00001 DS    18F
@PC00001 DS    1F
IKJEFF53 CSECT
         DS    0F
@CF00136 DC    F'2'
@DATD    DSECT
         DS    0D
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA
@ENDDATD EQU   *
IKJEFF53 CSECT
         DS    0F
@SIZDATD DC    AL1(0)
         DC    AL3(@ENDDATD-@DATD)
         DS    0D
@CC00135 DC    C'JOB'
REJTEXT1 DC    CL66'REJECTED - JOBNAME MUST BE YOUR USERID PLUS AT LEASC
               T ONE CHARACTER'
REJTEXT2 DC    CL69'REJECTED - JOBNAME MUST BE YOUR USERID OR MUST STARC
               T WITH YOUR USERID'
         DS    CL2
GETMINFO DS    CL4
         ORG   GETMINFO
GETMSP   DC    AL1(0)
GETMLEN  DC    AL3(84)
         ORG   GETMINFO+4
PATCH    DS    CL21
         ORG   PATCH
PTCHINIT DC    7CL3'ZAP'
         ORG   PATCH+21
@00      EQU   00                      EQUATES FOR REGISTERS 0-15
@01      EQU   01
@02      EQU   02
@03      EQU   03
@04      EQU   04
@05      EQU   05
@06      EQU   06
@07      EQU   07
@08      EQU   08
@09      EQU   09
@10      EQU   10
@11      EQU   11
@12      EQU   12
@13      EQU   13
@14      EQU   14
@15      EQU   15
TEMPOFST EQU   @05
RETCODE  EQU   @05
IEPTR    EQU   @04
R0       EQU   @00
R1       EQU   @01
REJMSG   EQU   0
REJMLEN  EQU   REJMSG
REJJOB   EQU   REJMSG+2
REJSLOT  EQU   REJMSG+6
PARMLIST EQU   0
JOBNAMEP EQU   PARMLIST
NAMELENP EQU   PARMLIST+4
USERIDP  EQU   PARMLIST+8
IDLENPTR EQU   PARMLIST+12
MESSAGEP EQU   PARMLIST+16
REPLYP   EQU   PARMLIST+20
CODEP    EQU   PARMLIST+24
JOBIDP   EQU   PARMLIST+28
JIDLENP  EQU   PARMLIST+32
IEOUTPLP EQU   PARMLIST+36
IEJOBNM  EQU   0
JOBNAMEL EQU   0
USERID   EQU   0
IDLENGTH EQU   0
CMNDCODE EQU   0
MESSAGE  EQU   0
IEREPLY  EQU   0
IEOUTPL  EQU   0
@NM00001 EQU   IEOUTPL+16
IESYNTAX EQU   @NM00001
IEJOBID  EQU   0
JIDLEN   EQU   0
PARM     EQU   0
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS
@NM00002 EQU   IESYNTAX+1
IEDEST   EQU   IESYNTAX+1
IEKEEP   EQU   IESYNTAX+1
IENCLASS EQU   IESYNTAX
IEPRINT  EQU   IESYNTAX
IEDELETE EQU   IESYNTAX
IENEXT   EQU   IESYNTAX
IEBEGIN  EQU   IESYNTAX
IEHERE   EQU   IESYNTAX
IEHOLD   EQU   IESYNTAX
IEPAUSE  EQU   IESYNTAX
DESTPDE  EQU   IEOUTPL+12
NEWCPDE  EQU   IEOUTPL+8
PRDSPDE  EQU   IEOUTPL+4
CLASPDE1 EQU   IEOUTPL
IERTEXT  EQU   IEREPLY+2
IEREPLYL EQU   IEREPLY
MSGTEXT  EQU   MESSAGE+2
MSGLENGT EQU   MESSAGE
IEHIGH   EQU   IEOUTPLP
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS
@RF00039 EQU   @RC00037
@ENDDATA EQU   *
         END   IKJEFF53,(C'PLS1544',0701,77272)
