         TITLE 'ISTZFM3B - VS/2 CHANNEL END DISABLED INTERRUPT EXIT    *
                        '
ISTZFM3B CSECT ,                                                   0001
@MAINENT DS    0H                                                  0001
         USING *,@15                                               0001
         B     @PROLOG                                             0001
         DC    AL1(16)                                             0001
         DC    C'ISTZFM3B  78.005'                                 0001
         DROP  @15
@PROLOG  DS    0H                                                  0002
* * * * * * * * * * * * * * * * *
* GENERATED CODE TO ENSURE THAT *
* THE COMMON ENTRY POINT IS     *
* IDENTIFIED                    *
ISTZFM3B CSECT                  *
         ENTRY ISTZFC3B         *
ISTZFC3B EQU   ISTZFM3B         *
* * * * * * * * * * * * * * * * *
 STM R00,RTNREG,0(SAVREG)           SAVE IOS REGISTERS
 BALR BASEREG,0                     SET UP MODULE
 USING *,BASEREG                   ADDRESSABILITY
*   DO;                             /* LISATCVT                    0450
*                                      CVTBASE(PAGEABLE,(PTRATC))    */
*     PTRATC=ATCLCPTR;              /* SET UP ATCVT POINTER          */
         L     PTRATC,ATCLCPTR                                     0451
*   END;                            /* LISATCVT ADDRESS ATCVT        */
*   PTRICN=UCBICNCB;                /* ADDRESS ICNCB                 */
         L     PTRICN,UCBICNCB+512(,UCBPTR)                        0453
*   RFY                                                            0454
*     UCBPTR UNRSTD;                                               0454
*   PTRRPH=ADDR(ICNRPH);            /* ADDRESS RPH                   */
         LA    PTRRPH,ICNRPH(,PTRICN)                              0455
*   ICNDIEW1=SAVREG;                /* SAVE PTR TO IOS SAVE AREA     */
         ST    SAVREG,ICNDIEW1(,PTRICN)                            0456
*   SAVREG=PSACPUPA;                /* GET CPU ADDRESS       @ZM31978*/
         LH    SAVREG,PSACPUPA                                     0457
*   SLL(SAVREG,2);                  /* ADJUST FOR ADDRESSING @ZM31978*/
         SLL   SAVREG,2                                            0458
*   GEN(L SAVREG,ATCTPCP0(SAVREG,PTRATC))                          0459
*   REFS(PTRATC,SAVREG,ATCTPCP0);   /* GET FIXED SAVEAREA ADDR THIS
*                                      CPU                   @ZM31978*/
         L SAVREG,ATCTPCP0(SAVREG,PTRATC)
*   SAVREG=SAVREG+D3BFSAV;          /* INCREMENT TO 3BS FIXED      0460
*                                      SAVEAREA              @ZM31978*/
         AL    SAVREG,@CF03957                                     0460
*   ICNDIEW2=IOSDIE;                /* SAVE DIE PTR                  */
         L     @00,IOSDIE+520(,PTRICN)                             0461
         ST    @00,ICNDIEW2(,PTRICN)                               0461
*   RFY                                                            0462
*     WORKA RSTD;                                                  0462
*   WORKA=ADDR(ICNIOSB);            /* ADDR OF IOSB FOR TM   @ZM32700*/
         LA    WORKA,ICNIOSB(,PTRICN)                              0463
*   GEN REFS(IOSCC,WORKA)(TM IOSCC(WORKA),X'30');/* NON CONDITION  0464
*                                      CODE 0??              @ZM32700*/
         TM IOSCC(WORKA),X'30'
*   BC(7,CONPSTAT);                 /* GET OUT OF FM3B       @ZM32700*/
         BC    7,CONPSTAT                                          0465
*   WORKA=CSWSTAT&CSTATMSK;         /* GET APPROP. CSW FLAGS         */
         L     WORKA,@CF03951                                      0466
         LH    @00,CSWSTAT+540(,PTRICN)                            0466
         N     @00,@CF03945                                        0466
         NR    WORKA,@00                                           0466
*   IF WORKA^=NOERR THEN            /* ANY CSW ERRORS?               */
         LTR   WORKA,WORKA                                         0467
         BZ    @RF00467                                            0467
*     DO;                                                          0468
*       GOTO CONPSTAT;              /* YES - CONTINUE TO POST STATUS */
         B     CONPSTAT                                            0469
*       RFY                                                        0470
*         WORKA UNRSTD;                                            0470
*     END;                                                         0471
*   ELSE                                                           0472
*     DO;                           /* NO ERRORS - HANDLE CHANNEL END
*                                      IN DIE                        */
@RF00467 DS    0H                                                  0473
*CSWXLATE:                                                         0473
*       DO;                                                        0473
*                                                                  0473
CSWXLATE DS    0H                                                  0474
*         /***********************************************************/
*         /*                                                         */
*         /* CSWXLATE                                                */
*         /*                                                         */
*         /***********************************************************/
*                                                                  0474
*         RFY                                                      0474
*          (CCWPTR,                                                0474
*           WORKA) RSTD;                                           0474
*         WORKA=PTRRPH;             /* SAVE RPH PTR ACROSS TRANSLATE */
         LR    WORKA,PTRRPH                                        0475
*         R01=CSWCCWA-ZIBCCWSZ;     /* GET REAL CCW ADDR IN R1       */
         L     R01,CSWCCWA+539(,PTRICN)                            0476
         LA    R01,0(,R01)                                         0476
         SL    R01,@CF00071                                        0476
*         CALL IEAVTRV;             /* TRANSLATE TO VIRTUAL          */
         L     @11,CVTPTR                                          0477
         L     @15,CVTPTRV(,@11)                                   0477
         BALR  @14,@15                                             0477
*         CCWPTR=R01;               /* SAVE IT                       */
         LR    CCWPTR,R01                                          0478
*         PTRRPH=WORKA;             /* RESTORE RPH PTR               */
         LR    PTRRPH,WORKA                                        0479
*         RFY                                                      0480
*           WORKA UNRSTD;                                          0480
*       END CSWXLATE;                                              0481
*       IF CCWPTR=ADDR(ICNZD005) THEN                              0482
         LA    @04,ICNZD005(,PTRICN)                               0482
         CR    CCWPTR,@04                                          0482
         BE    @RT00482                                            0482
*         ;                         /* END ON WRITE NOP?             */
*       ELSE                                                       0484
*         DO;                       /* DIDN'T END ON WRITE NOP       */
*           IF CCWCODE=READ THEN    /* END ON A READ?                */
         CLI   CCWCODE(CCWPTR),X'02'                               0485
         BNE   @RF00485                                            0485
*             DO;                   /* YES                           */
*DEBLOK:                                                           0487
*               DO;                                                0487
*                                                                  0487
DEBLOK   DS    0H                                                  0488
*                 /***************************************************/
*                 /*                                                 */
*                 /* DEBLOK                                          */
*                 /*                                                 */
*                 /***************************************************/
*                                                                  0488
*                 ICNZV006=CCWPTR;  /* SAVE PTR TO LAST CCW  @Z40GKD9*/
         ST    CCWPTR,ICNZV006(,PTRICN)                            0488
*                 IF ICNLCLUS=ON THEN/* IF 3791 THEN         @Z40GKD9*/
         TM    ICNLCLUS(PTRICN),B'00100000'                        0489
         BNO   @RF00489                                            0489
*                   CALL ICNLCVTA->ZFAZFF4B;/* FID2 DEBLOCKING     0490
*                                      ROUTINE               @Z40GKD9*/
         L     @04,ICNLCVTA(,PTRICN)                               0490
         L     @15,ZFAZFF4B(,@04)                                  0490
         BALR  @14,@15                                             0490
*                 ELSE              /* OTHERWISE             @Z40GKD9*/
*                   DO;             /* PROCESS FID0 & FID1 PIU     0491
*                                                            @Z40GKD9*/
         B     @RC00489                                            0491
@RF00489 DS    0H                                                  0492
*                     ICNRDCOD=ICNRDCOD&&READFLIP;/* FLIP READ START
*                                      SEQUENCE                      */
         XI    ICNRDCOD(PTRICN),X'60'                              0492
*                     SMNOPCC=OFF;  /* SET NO READS ON SM NOP        */
         NI    SMNOPCC(PTRICN),B'10111111'                         0493
*                     RFY                                          0494
*                      (WORKX,                                     0494
*                       PTRZIB) RSTD;                              0494
*                     WORKX=(CCWPTR-ZIBCPOFS)->ZIBCHAIN;/* ESTABLISH
*                                      LOOP                   STOPPER*/
         LR    @04,CCWPTR                                          0495
         AL    @04,@CF04106                                        0495
         L     WORKX,ZIBCHAIN(,@04)                                0495
*                     DO UNTIL WORKX=ICNZV001;/* PROCESS PIUS UNTIL
*                                      HIT BUFFER AFTER LAST DATA  0496
*                                      TRANSFER BUFFER               */
@DL00496 DS    0H                                                  0497
*                       PTRZIB=ICNZV001;/* GET ADDR OF 1ST(NEXT) PIU
*                                      BUFFER                        */
         L     PTRZIB,ICNZV001(,PTRICN)                            0497
*                       FSBFSB=FSBFSB&&FSBFSB;/* ZERO NCP SYSGEN PAD
*                                                            @ZM33566*/
         LA    @04,16                                              0498
         ALR   @04,PTRZIB                                          0498
         XC    FSBFSB(32,@04),FSBFSB(@04)                          0498
*                       FSBTYPE=FSTYPE;/* SET FSB TYPE               */
         MVI   FSBTYPE(@04),X'02'                                  0499
*                       FSBLNGTH=LENGTH(ISTFSB);/* AND LENGTH        */
         MVI   FSBLNGTH(@04),X'2C'                                 0500
*                       FSBRQTAG=BTUREQ;/* MOVE REQUEST TAG TO FSB   */
         LA    @15,48                                              0501
         ALR   @15,PTRZIB                                          0501
         MVC   FSBRQTAG(2,@04),BTUREQ(@15)                         0501
*                       ZIBLNG2=ICNZCON2;/* SET RELSTORE BUF LEN   0502
*                                                            @ZA28915*/
         LH    @04,ICNZCON2(,PTRICN)                               0502
         N     @04,@CF03945                                        0502
         STH   @04,ZIBLNG2(,PTRZIB)                                0502
*                       RFY                                        0503
*                        (WORKY,                                   0503
*                         PTRNCB,                                  0503
*                         R00,                                     0503
*                         RCDREG) RSTD;                            0503
*                       WORKY=PTRATC;/* SAVE REG 2 ACROSS CIDCTL     */
         LR    WORKY,PTRATC                                        0504
*                       R02=BTUSORCE;/* PUT DAF IN REG 2             */
         LA    @14,48                                              0505
         ALR   @14,PTRZIB                                          0505
         LH    R02,BTUSORCE(,@14)                                  0505
         N     R02,@CF03945                                        0505
*                       DO;         /* CIDCTL(FINDNCB) CID(2)        */
*                         RFY                                      0507
*                          (EMCR2,                                 0507
*                           EMCR3) RSTD;                           0507
*                         GEN SETS(RPHWORK)                        0508
*(STM EMCR0,EMCR15,RPHWORK(RPHPTR) SAVE REGS IN RPH);              0508
         STM EMCR0,EMCR15,RPHWORK(RPHPTR) SAVE REGS IN RPH
*                         EMCR3='00'X;/* CLEAR EXTRA BITS            */
         SLR   EMCR3,EMCR3                                         0509
*                         CALL ATCLCPTR->ATCCDFDN->ISTSDCCN;/*     0510
*                                      PROCESS REQUEST               */
         L     @09,ATCLCPTR                                        0510
         L     @15,ATCCDFDN(,@09)                                  0510
         BALR  @14,@15                                             0510
*                         RFY                                      0511
*                          (EMCR2,                                 0511
*                           EMCR3) UNRSTD;                         0511
*                       END;        /* CIDCTL FIND ASSOC NCB         */
*                       PTRATC=WORKY;/* RESTORE ATCVT PTR            */
         LR    PTRATC,WORKY                                        0513
*                       IF RCDREG=0 THEN/* NCB FOUND OK?             */
         LTR   RCDREG,RCDREG                                       0514
         BNZ   @RF00514                                            0514
*                         PTRNCB=R00;/* YES - SAVE ADDR TO IT        */
         LR    PTRNCB,R00                                          0515
*                       ELSE        /* NO                            */
*                         PTRNCB=0; /* INDICATE NO NCB FOUND         */
         B     @RC00514                                            0516
@RF00514 SLR   PTRNCB,PTRNCB                                       0516
*                       RFY                                        0517
*                        (WORKY,                                   0517
*                         R00,                                     0517
*                         RCDREG) UNRSTD;                          0517
@RC00514 DS    0H                                                  0518
*                       IF THFID=THFID1 THEN/* BASIC OR RECORD?      */
         TM    THFID+48(PTRZIB),B'00010000'                        0518
         BNO   @RF00518                                            0518
         TM    THFID+48(PTRZIB),B'11100000'                        0518
         BNZ   @RF00518                                            0518
*FID1PROC:                                                         0519
*                         DO;                                      0519
*                                                                  0519
FID1PROC DS    0H                                                  0520
*                           /*****************************************/
*                           /*                                       */
*                           /* FID1PROC                              */
*                           /*                                       */
*                           /*****************************************/
*                                                                  0520
*                           FSBSAF=THDAF;/* COPY TH CID      @Z30PPGW*/
         LA    @15,16                                              0520
         ALR   @15,PTRZIB                                          0520
         LA    @14,48                                              0520
         ALR   @14,PTRZIB                                          0520
         MVC   FSBSAF(2,@15),THDAF(@14)                            0520
*                           FSBDAF=THOAF;/* TO FSB           @Z30PPGW*/
         MVC   FSBDAF(2,@15),THOAF(@14)                            0521
*                           FSBMJRCD=FRNORM;/* SET MAJOR AND @Z30PPGW*/
         MVI   FSBMJRCD(@15),X'00'                                 0522
*                           FSBMNRCD=FRMOK;/* AND MINOR RETURN CODES
*                                                            @Z30PPGW*/
         MVI   FSBMNRCD(@15),X'00'                                 0523
*                           IF THRHI=ON THEN/* RH PRESENT    @Z40GKD9*/
         TM    THRHI(@14),B'00001000'                              0524
         BNO   @RF00524                                            0524
*                             FDBDATAA=ADDR(ZIBFID1);/* SET FDB DATA
*                                      PTR                   @Z30PPGW*/
         LA    @00,ZIBFID1(,PTRZIB)                                0525
         ST    @00,FDBDATAA(,PTRZIB)                               0525
*                           ELSE    /* NO RH PRESENT         @Z40GKD9*/
*                             FDBDATAA=ADDR(BTURH);/* SET FDB DATA 0526
*                                      PTR                   @Z40GKD9*/
         B     @RC00524                                            0526
@RF00524 LA    @00,BTURH+48(,PTRZIB)                               0526
         ST    @00,FDBDATAA(,PTRZIB)                               0526
*                           FDBOFSET=0;/* SET OFFSET         @Z30PPGW*/
@RC00524 SLR   @00,@00                                             0527
         STH   @00,FDBOFSET(,PTRZIB)                               0527
*                           FSBTHCNT=THDCF;/* SET FSB TH COUNT FIELD
*                                                            @Z30PPGW*/
         LA    @15,48                                              0528
         ALR   @15,PTRZIB                                          0528
         LH    @14,THDCF(,@15)                                     0528
         N     @14,@CF03945                                        0528
         STH   @14,FSBTHCNT+16(,PTRZIB)                            0528
*                           ICNBUFF=ICNBUFF+1;/* INCREMENT # OF    0529
*                                      BUFFERS NEEDED        @Z40GKD9*/
         LA    @00,1                                               0529
         SLR   @11,@11                                             0529
         IC    @11,ICNBUFF(,PTRICN)                                0529
         ALR   @00,@11                                             0529
         STC   @00,ICNBUFF(,PTRICN)                                0529
*                           IF THDCF<=ICNZCON5 THEN/* FIT IN ONE   0530
*                                      BUFFER?               @Z30PPGW*/
         LH    @00,ICNZCON5(,PTRICN)                               0530
         N     @00,@CF03945                                        0530
         CR    @14,@00                                             0530
         BH    @RF00530                                            0530
*                             DO;   /* YES                   @Z30PPGW*/
*                               IF THRHI=ON THEN/* RH PRESENT      0532
*                                                            @Z40GKD9*/
         TM    THRHI(@15),B'00001000'                              0532
         BNO   @RF00532                                            0532
*                                 FDBDATCT=THDCF-LENGTH(ISTRH);/* SET
*                                      DATA COUNT            @Z30PPGW*/
         SL    @14,@CF00312                                        0533
         STH   @14,FDBDATCT(,PTRZIB)                               0533
*                               ELSE/* NO RH PRESENT         @Z40GKD9*/
*                                 FDBDATCT=THDCF;/* SET DATA COUNT 0534
*                                                            @Z40GKD9*/
         B     @RC00532                                            0534
@RF00532 LH    @00,THDCF+48(,PTRZIB)                               0534
         N     @00,@CF03945                                        0534
         STH   @00,FDBDATCT(,PTRZIB)                               0534
*                               ICNZV001=ZIBCHAIN;/* REMOVE THIS   0535
*                                      BUFFER                @Z30PPGW*/
@RC00532 L     @00,ZIBCHAIN(,PTRZIB)                               0535
         ST    @00,ICNZV001(,PTRICN)                               0535
*                               ZIBCHAIN=0;/* FROM READ CHAIN      0536
*                                                            @Z30PPGW*/
         SLR   @00,@00                                             0536
         ST    @00,ZIBCHAIN(,PTRZIB)                               0536
*                             END;                                 0537
*                           ELSE                                   0538
*                             DO;   /* NEEDS MORE THAN 1 BUFFER    0538
*                                                            @Z30PPGW*/
         B     @RC00530                                            0538
@RF00530 DS    0H                                                  0539
*                               RFY                                0539
*                                (WORKA,                           0539
*                                 WORKB,                           0539
*                                 WORKC) RSTD;                     0539
*                               WORKA=0;/* SET UP FOR DIVIDE @Z30PPGW*/
         SLR   WORKA,WORKA                                         0540
*                               WORKB=THDCF+ZIBZCON1;/* DIVIDEND   0541
*                                                            @Z30PPGW*/
         LA    WORKB,37                                            0541
         LH    @08,THDCF+48(,PTRZIB)                               0541
         N     @08,@CF03945                                        0541
         ALR   WORKB,@08                                           0541
*                               WORKC=ICNZCON3;/* DIVISOR    @Z30PPGW*/
         LH    WORKC,ICNZCON3(,PTRICN)                             0542
         N     WORKC,@CF03945                                      0542
*                               GEN REFS(WORKA,WORKC) SETS(WORKA,WORKB)
*                                   (DR WORKA,WORKC);/*      @Z30PPGW*/
         DR WORKA,WORKC
*                               WORKA=WORKA+1;/* ADD 1 BACK IN- TAKEN
*                                      OUT OF DIVIDEND       @Z30PPGW*/
         AL    WORKA,@CF00035                                      0544
*                               IF THRHI=ON THEN/* RH PRESENT      0545
*                                                            @Z40GKD9*/
         TM    THRHI+48(PTRZIB),B'00001000'                        0545
         BNO   @RF00545                                            0545
*                                 FDBDATCT=ICNZCON5-LENGTH(ISTRH);/*
*                                      SET DATA CT 1ST BUF   @ZM31600*/
         LH    @08,ICNZCON5(,PTRICN)                               0546
         N     @08,@CF03945                                        0546
         SL    @08,@CF00312                                        0546
         STH   @08,FDBDATCT(,PTRZIB)                               0546
*                               ELSE/* NO RH PRESENT         @Z40GKD9*/
*                                 FDBDATCT=ICNZCON5;/* SET DATA CT 0547
*                                      1ST BUF               @Z40GKD9*/
         B     @RC00545                                            0547
@RF00545 LH    @08,ICNZCON5(,PTRICN)                               0547
         N     @08,@CF03945                                        0547
         STH   @08,FDBDATCT(,PTRZIB)                               0547
*                               WORKC=PTRZIB;/* SET UP TO PROCESS  0548
*                                      REMAINING             @Z30PPGW*/
@RC00545 LR    WORKC,PTRZIB                                        0548
*                               CALL FDBPROC;/* BUFFERS      @Z30PPGW*/
         BAL   @14,FDBPROC                                         0549
*                               RFY                                0550
*                                (WORKA,                           0550
*                                 WORKB,                           0550
*                                 WORKC) UNRSTD;                   0550
*                             END;                                 0551
*                           CALL ATCZFSVT->ZFSZFFCB;/* FEEDBACK QUEUE
*                                                            @Z40GKD9*/
@RC00530 L     @14,ATCZFSVT(,PTRATC)                               0552
         L     @15,ZFSZFFCB(,@14)                                  0552
         BALR  @14,@15                                             0552
*                         END FID1PROC;                            0553
*                       ELSE                                       0554
*FID0PROC:                                                         0554
*                         DO;                                      0554
*                                                                  0554
         B     @RC00518                                            0554
@RF00518 DS    0H                                                  0554
FID0PROC DS    0H                                                  0555
*                           /*****************************************/
*                           /*                                       */
*                           /* FID0PROC                              */
*                           /*                                       */
*                           /*****************************************/
*                                                                  0555
*                           FSBSAF=BTUDEST;/* SET CID IN FSB IN    0555
*                                      REVERSE               @ZM31983*/
         LA    @15,16                                              0555
         ALR   @15,PTRZIB                                          0555
         LA    @14,48                                              0555
         ALR   @14,PTRZIB                                          0555
         MVC   FSBSAF(2,@15),BTUDEST(@14)                          0555
*                           FSBDAF=BTUSORCE;/* OF TH CID     @ZM31983*/
         MVC   FSBDAF(2,@15),BTUSORCE(@14)                         0556
*                           BTUDEST=FSBDAF;/* COPY CID BACK  @ZM31983*/
         MVC   BTUDEST(2,@14),FSBDAF(@15)                          0557
*                           BTUSORCE=FSBSAF;/* TO TH         @ZM31983*/
         MVC   BTUSORCE(2,@14),FSBSAF(@15)                         0558
*                           FSBSYSRS=BTUSYSTR;/* SYS RESPONSE TO FSB */
         MVC   FSBSYSRS(1,@15),BTUSYSTR(@14)                       0559
*                           FSBEXTRS=BTUEXTR;/* EXTENDED RESPONSE TO
*                                      FSB                           */
         MVC   FSBEXTRS(1,@15),BTUEXTR(@14)                        0560
*                           TR(BTUSYSTR,ISTZTRTB(1));/* XLATE SYS  0561
*                                      RESP BYTE TO INDEX            */
         TR    BTUSYSTR(1,@14),ISTZTRTB                            0561
*                           FSBMJRCD=ISTZRCTB(BTUSYSTR+1);/* GET   0562
*                                      MAJOR AND                     */
         SLR   @11,@11                                             0562
         IC    @11,BTUSYSTR(,@14)                                  0562
         SLR   @00,@00                                             0562
         IC    @00,ISTZRCTB(@11)                                   0562
         STC   @00,FSBMJRCD(,@15)                                  0562
*                           FSBMNRCD=ISTZRCTB(BTUSYSTR+2);/* MINOR 0563
*                                      RETURN CODES                  */
         SLR   @00,@00                                             0563
         IC    @00,ISTZRCTB+1(@11)                                 0563
         STC   @00,FSBMNRCD(,@15)                                  0563
*                           BTUSYSTR=FSBSYSRS;/* RESET FOR BUFFER  0564
*                                      TRACE                 @ZM33562*/
         MVC   BTUSYSTR(1,@14),FSBSYSRS(@15)                       0564
*                           IF FSBSPHSE^=NCPPHSE0&/* PHASE 1,2, OR 3
*                                      RESP?                 @ZM33587*/
*                               FSBXFSTS=NCPXSPEC&/* IF RESPONSE IS
*                                                            @ZM33587*/
*                               FSBXFINS=NCPXTIMT THEN/* TIMEOUT   0565
*                                                            @ZM31902*/
         TM    FSBSPHSE(@15),B'01100000'                           0565
         BZ    @RF00565                                            0565
         TM    FSBXFSTS(@15),B'10000000'                           0565
         BNO   @RF00565                                            0565
         TM    FSBXFSTS(@15),B'01100000'                           0565
         BNZ   @RF00565                                            0565
         TM    FSBXFINS(@15),B'00011110'                           0565
         BNZ   @RF00565                                            0565
*                             FSBMNDNU=ON;/* SET DEVICE NOT USABLE 0566
*                                                            @ZM31902*/
         OI    FSBMNDNU(@15),B'00010000'                           0566
*                           ELSE                                   0567
*                             ;                                    0567
@RF00565 DS    0H                                                  0568
*                           FDBDATAA=ADDR(ZIBTEXT1);/* SET FDB DATA
*                                      PTR                           */
         LA    @00,ZIBTEXT1(,PTRZIB)                               0568
         ST    @00,FDBDATAA(,PTRZIB)                               0568
*                           FDBOFSET=0;/* SET FDB OFFSET             */
         SLR   @15,@15                                             0569
         STH   @15,FDBOFSET(,PTRZIB)                               0569
*                           ICNBUFF=ICNBUFF+1;/* INCREMENT # OF    0570
*                                      BUFFERS NEEDED        @Z40GKD9*/
         LA    @00,1                                               0570
         SLR   @14,@14                                             0570
         IC    @14,ICNBUFF(,PTRICN)                                0570
         ALR   @00,@14                                             0570
         STC   @00,ICNBUFF(,PTRICN)                                0570
*                           IF BTUDCF<=ICNZCON4 THEN/* BTU CONTAINED
*                                      IN ONE BUFFER?                */
         LA    @14,48                                              0571
         ALR   @14,PTRZIB                                          0571
         CLC   BTUDCF(2,@14),ICNZCON4(PTRICN)                      0571
         BH    @RF00571                                            0571
*                             DO;   /* YES                           */
*                               FDBDATCT=BTUDCF-ZIBZCON2;/* SET DATA
*                                      COUNT FIELD                   */
         LH    @00,BTUDCF(,@14)                                    0573
         N     @00,@CF03945                                        0573
         SL    @00,@CF02212                                        0573
         STH   @00,FDBDATCT(,PTRZIB)                               0573
*                               BTUDCF=FDBDATCT;/* DECREMENT BTU DATA
*                                      CT BY LEN OF RH               */
         STH   @00,BTUDCF(,@14)                                    0574
*                               ICNZV001=ZIBCHAIN;/* UPDATE READ   0575
*                                      BUFFER PTR TO NEXT BTU        */
         L     @00,ZIBCHAIN(,PTRZIB)                               0575
         ST    @00,ICNZV001(,PTRICN)                               0575
*                               ZIBCHAIN=0;/* ZERO PIU'S CHAIN FIELD */
         ST    @15,ZIBCHAIN(,PTRZIB)                               0576
*                             END;                                 0577
*                           ELSE    /* BTU TAKES MORE THAN 1 BUFFER  */
*                             DO;                                  0578
         B     @RC00571                                            0578
@RF00571 DS    0H                                                  0579
*                               RFY                                0579
*                                (WORKA,                           0579
*                                 WORKB,                           0579
*                                 WORKC) RSTD;                     0579
*                               WORKA=0;/* SET UP FOR DIVIDE         */
         SLR   WORKA,WORKA                                         0580
*                               WORKB=BTUDCF+ZIBZCON1;/* DIVIDEND    */
         LA    WORKB,37                                            0581
         LH    @08,BTUDCF+48(,PTRZIB)                              0581
         N     @08,@CF03945                                        0581
         ALR   WORKB,@08                                           0581
*                               WORKC=ICNZCON3;/* DIVISOR            */
         LH    WORKC,ICNZCON3(,PTRICN)                             0582
         N     WORKC,@CF03945                                      0582
*                               GEN REFS(WORKA,WORKC) SETS(WORKA,WORKB)
*                                   (DR WORKA,WORKC);              0583
         DR WORKA,WORKC
*                               WORKA=WORKA+1;/* ADD 1 BACK IN- TAKEN
*                                      OUT OF DIVIDEND               */
         AL    WORKA,@CF00035                                      0584
*                               FDBDATCT=ICNZCON4-ZIBZCON2;/* SET  0585
*                                      DATA COUNT 1ST BUF    @ZM31600*/
         LA    @08,10                                              0585
         LH    @00,ICNZCON4(,PTRICN)                               0585
         N     @00,@CF03945                                        0585
         SLR   @00,@08                                             0585
         STH   @00,FDBDATCT(,PTRZIB)                               0585
*                               BTUDCF=BTUDCF-ZIBZCON2;/* DEC BTU  0586
*                                      DATA CT BY LEN OF RH  @ZM31564*/
         LA    @15,48                                              0586
         ALR   @15,PTRZIB                                          0586
         LCR   @08,@08                                             0586
         LH    @00,BTUDCF(,@15)                                    0586
         N     @00,@CF03945                                        0586
         ALR   @08,@00                                             0586
         STH   @08,BTUDCF(,@15)                                    0586
*                               WORKC=PTRZIB;/* SET UP TO PROCESS  0587
*                                      REMAINING BUFFERS             */
         LR    WORKC,PTRZIB                                        0587
*                               CALL FDBPROC;/* PROCESS REST         */
         BAL   @14,FDBPROC                                         0588
*                               RFY                                0589
*                                (WORKA,                           0589
*                                 WORKB,                           0589
*                                 WORKC) UNRSTD;                   0589
*                             END;                                 0590
*                           IF PTRNCB=0/* IF NO NCB FOUND            */
*                               &BTUZRT05=OFF THEN/* & NOT CONTROL 0591
*                                      COMMAND                       */
@RC00571 LTR   PTRNCB,PTRNCB                                       0591
         BNZ   @RF00591                                            0591
         TM    BTUZRT05+48(PTRZIB),B'00000100'                     0591
         BNZ   @RF00591                                            0591
*                             IF FSBRQTAG='0000'X/* REQUEST TAG ZERO?*/
*                               THEN/* YES                           */
         LA    @15,16                                              0592
         ALR   @15,PTRZIB                                          0592
         CLC   FSBRQTAG(2,@15),@CB03949                            0592
         BNE   @RF00592                                            0592
*                               DO;                                0593
*                                 FSBMSGID=ZMSG10;/* SET UNSOLICITED
*                                      DATA MSG                      */
         MVC   FSBMSGID(4,@15),@CF01652                            0594
*                                 FSBNONCB=ON;/* SET INHIBIT MSG FLAG
*                                                            @ZM31472
*                                                            @ZM31995*/
         OI    FSBNONCB(@15),B'00001000'                           0595
*/*  TPQUE (ADDR(ZIBFSB),ADDR(ATCZPAB2)->DYPPAB) NORM DIS            */
*/*                          CMZVER = OS/VS2                         */
*                                                                  0596
*                                 DO;                              0596
*                                   DCL                            0597
*                                     GPR00F FIXED(31) REG(00);    0597
*                                   DCL                            0598
*                                     GPR00P PTR(31) REG(00);      0598
*                                   DCL                            0599
*                                     GPR01F FIXED(31) REG(01);    0599
*                                   DCL                            0600
*                                     GPR01P PTR(31) REG(01);      0600
*                                   DCL                            0601
*                                     GPR04F FIXED(31) REG(04);    0601
*                                   DCL                            0602
*                                     GPR04P PTR(31) REG(04);      0602
*                                   DCL                            0603
*                                     GPR05F FIXED(31) REG(05);    0603
*                                   DCL                            0604
*                                     GPR05P PTR(31) REG(05);      0604
*                                   DCL                            0605
*                                     GPR15F FIXED(31) REG(15);    0605
*                                   DCL                            0606
*                                     GPR15P PTR(31) REG(15);      0606
*                                   RFY                            0607
*                                    (GPR00P,                      0607
*                                     GPR01P,                      0607
*                                     GPR04P,                      0607
*                                     GPR05P,                      0607
*                                     GPR15P) RSTD;                0607
*                                   DCL                            0608
*                                     GPR02F FIXED(31) REG(02);    0608
*                                   DCL                            0609
*                                     GPR02P PTR(31) REG(02);      0609
*                                   DCL                            0610
*                                     GPR08F FIXED(31) REG(08);    0610
*                                   DCL                            0611
*                                     GPR08P PTR(31) REG(08);      0611
*                                   GEN REFS(GPR01P) SETS(RPHWORK) 0612
*(STM GPR02P,GPR08P,RPHWORK(GPR01P));                              0612
         STM GPR02P,GPR08P,RPHWORK(GPR01P)
*                                   GPR00P=0;                      0613
         SLR   GPR00P,GPR00P                                       0613
*                                   GPR15P=ADDR(ADDR(ATCZPAB2)->DYPPAB)
*                                       ;/* HOLD PAB PTR             */
         LA    GPR15P,DYPPAB+1136(,PTRATC)                         0614
*                                   GPR04P=ADDR(ZIBFSB);/* WORK ELE
*                                      PTR                           */
         LA    GPR04P,ZIBFSB(,PTRZIB)                              0615
*                                   GPR05P=GPR15P;/* PASS PAB PTR    */
         LR    GPR05P,GPR15P                                       0616
*                                   CALL ATCLCPTR->ATCAP37->ISTAPC37;
         L     @14,ATCLCPTR                                        0617
         L     @15,ATCAP37(,@14)                                   0617
         BALR  @14,@15                                             0617
*                                   GEN(NOPR  2)                   0618
*                                   NOSETS NOREFS;                 0618
         NOPR  2
*                                   RFY                            0619
*                                    (GPR00P,                      0619
*                                     GPR01P,                      0619
*                                     GPR04P,                      0619
*                                     GPR05P,                      0619
*                                     GPR15P) UNRSTD;              0619
*                                 END;/* *** END OF TPQUE GENERATION */
*                               END;                               0621
*                             ELSE                                 0622
*                                                                  0622
*                               /*************************************/
*                               /*                                   */
*                               /* RELSTORE BUFADDR(PTRZIB)DISABLE(YE*/
*                               /* S)CLEAR(YES)                      */
*                               /*                                   */
*                               /*************************************/
*                                                                  0622
*RELBUF:                                                           0622
*                               DO;                                0622
*                                                                  0622
         B     @RC00592                                            0622
@RF00592 DS    0H                                                  0622
RELBUF   DS    0H                                                  0623
*/* ATBUILD (ISTATCVT,ISTRPH)                                        */
*/* END OF ATBUILD                                                   */
*                                                                  0623
*                                 DCL                              0623
*                                   GPR03F FIXED(31) REG(03);      0623
*                                 DCL                              0624
*                                   GPR03P PTR(31) REG(03);        0624
*                                 DCL                              0625
*                                   GPR06F FIXED(31) REG(06);      0625
*                                 DCL                              0626
*                                   GPR06P PTR(31) REG(06);        0626
*                                 DCL                              0627
*                                   GPR07F FIXED(31) REG(07);      0627
*                                 DCL                              0628
*                                   GPR07P PTR(31) REG(07);        0628
*                                 DCL                              0629
*                                   GPR09F FIXED(31) REG(09);      0629
*                                 DCL                              0630
*                                   GPR09P PTR(31) REG(09);        0630
*                                 DCL                              0631
*                                   GPR10F FIXED(31) REG(10);      0631
*                                 DCL                              0632
*                                   GPR10P PTR(31) REG(10);        0632
*                                 DCL                              0633
*                                   GPR11F FIXED(31) REG(11);      0633
*                                 DCL                              0634
*                                   GPR11P PTR(31) REG(11);        0634
*                                 DCL                              0635
*                                   GPR12F FIXED(31) REG(12);      0635
*                                 DCL                              0636
*                                   GPR12P PTR(31) REG(12);        0636
*                                 DCL                              0637
*                                   GPR13F FIXED(31) REG(13);      0637
*                                 DCL                              0638
*                                   GPR13P PTR(31) REG(13);        0638
*                                 DCL                              0639
*                                   GPR14F FIXED(31) REG(14);      0639
*                                 DCL                              0640
*                                   GPR14P PTR(31) REG(14);        0640
*                                 RFY                              0641
*                                  (GPR02P,                        0641
*                                   GPR03P,                        0641
*                                   GPR04P,                        0641
*                                   GPR15P) RSTD;                  0641
*                                 RFY                              0642
*                                  (GPR01P,                        0642
*                                   GPR13P) RSTD;                  0642
*                                 GENERATE REFS(GPR01P,GPR02P,GPR13P)
*                                     SETS(RPHWORK);               0643
          STM GPR02P,GPR13P,RPHWORK(GPR01P)
*                                 RFY                              0644
*                                   GPR13P UNRSTD;                 0644
*                                 GPR04P=PTRZIB×'80000000'X;       0645
         LR    GPR04P,PTRZIB                                       0645
         O     GPR04P,@CF01711                                     0645
*                                 DCL                              0646
*                                   1 FMZA0029 FIXED(31) STATIC LOCAL,
*                                    2 * FIXED(8) INIT(192),       0646
*                                    2 * PTR(24) INIT(0);          0646
*                                 GPR03F=FMZA0029;                 0647
         L     GPR03F,FMZA0029                                     0647
*                                 DO;/* LISATCVT                   0648
*                                      CVTBASE(PAGEABLE,(GPR15P))    */
*                                   GPR15P=ATCLCPTR;/* SET UP ATCVT
*                                      POINTER                       */
         L     GPR15P,ATCLCPTR                                     0649
*                                 END;/* LISATCVT                    */
*                                 GPR02P=GPR15P->ATCBPDA;          0651
         L     GPR02P,ATCBPDA(,GPR15P)                             0651
*                                 GPR15P=GPR15P->ATCSMRS;          0652
         L     GPR15P,ATCSMRS(,GPR15P)                             0652
*                                 DCL                              0653
*                                   FMZL0029 BASED(GPR15P) LABEL   0653
*                                       VALUERANGE(*);             0653
*                                 CALL FMZL0029;                   0654
         BALR  @14,@15                                             0654
*                                 RFY                              0655
*                                   GPR13P RSTD;                   0655
*                                 GENERATE REFS(GPR01P,RPHWORK) SETS(
*                                     GPR02P,GPR13P);              0656
          LM GPR02P,GPR13P,RPHWORK(GPR01P)
*                                 RFY                              0657
*                                  (GPR01P,                        0657
*                                   GPR13P) UNRSTD;                0657
*                                 RFY                              0658
*                                  (GPR02P,                        0658
*                                   GPR03P,                        0658
*                                   GPR04P,                        0658
*                                   GPR15P) UNRSTD;                0658
*                               END RELBUF;/* *********END OF      0659
*                                      RELSTORE EXPANSION*********   */
*                           ELSE                                   0660
*                             CALL ATCZFSVT->ZFSZFFCB;/* QUEUE BTU TO
*                                      INBOUND               @Z40GKD9*/
         B     @RC00591                                            0660
@RF00591 L     @14,ATCZFSVT(,PTRATC)                               0660
         L     @15,ZFSZFFCB(,@14)                                  0660
         BALR  @14,@15                                             0660
*                         END FID0PROC;                            0661
@RC00591 DS    0H                                                  0662
*                       RFY                                        0662
*                         PTRNCB UNRSTD;                           0662
@RC00518 DS    0H                                                  0663
*                     END;                                         0663
@DE00496 C     WORKX,ICNZV001(,PTRICN)                             0663
         BNE   @DL00496                                            0663
*                     RFY                                          0664
*                      (WORKX,                                     0664
*                       PTRZIB) UNRSTD;                            0664
*                   END;            /* END FID0 AND FID1 DEBLOCKING
*                                                            @Z40GKD9*/
*               END DEBLOK;                                        0666
@RC00489 DS    0H                                                  0667
*               IF CSWATTN=ON THEN  /* ATTN ON IN CSW?               */
         TM    CSWATTN+540(PTRICN),B'10000000'                     0667
         BNO   @RF00667                                            0667
*                 ICNZF013=ON;      /* SET ATTN READ REQUIRED FLAG IN
*                                      ICNCB                         */
         L     @04,ICNZF013-1(,PTRICN)                             0668
@GL00004 LR    @00,@04                                             0668
         O     @00,@CF04109                                        0668
         CS    @04,@00,ICNZF013-1(PTRICN)                          0668
         BNE   @GL00004                                            0668
*               ELSE                                               0669
*                 ;                                                0669
@RF00667 DS    0H                                                  0670
*             END;                                                 0670
*           ELSE                                                   0671
*             DO;                   /* DIDN'T END ON A READ          */
         B     @RC00485                                            0671
@RF00485 DS    0H                                                  0672
*               IF CCWPTR=ADDR(ICNZD006) THEN/* END ON STATUS      0672
*                                      MODIFIER NOP?                 */
         LA    @04,ICNZD006(,PTRICN)                               0672
         CR    CCWPTR,@04                                          0672
         BNE   @RF00672                                            0672
*                 ICNZF013=ON;      /* YES - ATTN READ REQD          */
         L     @04,ICNZF013-1(,PTRICN)                             0673
@GL00005 LR    @00,@04                                             0673
         O     @00,@CF04109                                        0673
         CS    @04,@00,ICNZF013-1(PTRICN)                          0673
         BNE   @GL00005                                            0673
*               ELSE                                               0674
*                 DO;               /* DIDN'T END ON SM NOP          */
         B     @RC00672                                            0674
@RF00672 DS    0H                                                  0675
*                   IF CCWPTR=ICNLSTIT THEN/* END ON LAST WRITE    0675
*                                      BREAK?                        */
         C     CCWPTR,ICNLSTIT(,PTRICN)                            0675
         BNE   @RF00675                                            0675
*                     IF CSWUE=OFF THEN/* AND UNIT EXCEPT OFF?       */
         TM    CSWUE+540(PTRICN),B'00000001'                       0676
         BNZ   @RF00676                                            0676
*                       ICNZF013=ON;/* YES - ATTN READ REQD          */
         L     @04,ICNZF013-1(,PTRICN)                             0677
@GL00006 LR    @00,@04                                             0677
         O     @00,@CF04109                                        0677
         CS    @04,@00,ICNZF013-1(PTRICN)                          0677
         BNE   @GL00006                                            0677
*                     ELSE                                         0678
*                       GOTO CONPSTAT;/* CONTINUE TO POST STATUS     */
*                   ELSE                                           0679
*CONPSTAT:                                                         0679
*                     DO;                                          0679
         B     @RC00675                                            0679
@RF00675 DS    0H                                                  0679
CONPSTAT DS    0H                                                  0680
*                       RFY                                        0680
*                         RCDREG RSTD;                             0680
*                       RCDREG=0;   /* INDICATE CONTINUE TO POST   0681
*                                      STATUS                        */
         SLR   RCDREG,RCDREG                                       0681
*                       RFY                                        0682
*                         RCDREG UNRSTD;                           0682
*                       GOTO EXIT;  /* GET OUT                       */
         B     EXIT                                                0683
*                     END CONPSTAT;                                0684
*                 END;                                             0685
@RC00675 DS    0H                                                  0686
*             END;                                                 0686
@RC00672 DS    0H                                                  0687
*         END;                                                     0687
@RC00485 DS    0H                                                  0688
*       RFY                                                        0688
*         CCWPTR UNRSTD;                                           0688
@RT00482 DS    0H                                                  0689
*ENDDIE:                                                           0689
*       DO;                                                        0689
*                                                                  0689
ENDDIE   DS    0H                                                  0690
*         /***********************************************************/
*         /*                                                         */
*         /* ENDDIE                                                  */
*         /*                                                         */
*         /***********************************************************/
*                                                                  0690
*         RFY                                                      0690
*           WORKA RSTD;                                            0690
*         WORKA=ICNCPQ-ZIBCPOFS;    /* FIRST CHANNEL PGM BUFFER      */
         L     WORKA,ICNCPQ(,PTRICN)                               0691
         SL    WORKA,@CF00073                                      0691
*         ICNCPQ=0;                 /* CLEAR CP POINTER              */
         SLR   @11,@11                                             0692
         ST    @11,ICNCPQ(,PTRICN)                                 0692
*         IF ICNLSTIF^=0 THEN       /* ANY WRITES?                   */
         C     @11,ICNLSTIF(,PTRICN)                               0693
         BE    @RF00693                                            0693
*           DO;                     /* YES                           */
*             ICNLSTIT=0;           /* CLEAR LAST PIU/BTU AND        */
         ST    @11,ICNLSTIT(,PTRICN)                               0695
*             ICNLSTIF=0;           /* BUFFER ON IOSB PTRS           */
         ST    @11,ICNLSTIF(,PTRICN)                               0696
*/* INT TEXT SUPPORT DELETED                                 @ZM32670*/
*                                                                  0697
*             /*******************************************************/
*             /*                                                     */
*             /* RELSTORE BUFADDR(WORKA)DISABLE(YES)                 */
*             /*                                                     */
*             /*******************************************************/
*                                                                  0697
*             DO;                                                  0697
*                                                                  0697
*/* ATBUILD (ISTATCVT,ISTRPH)                                        */
*/* END OF ATBUILD                                                   */
*                                                                  0698
*               RFY                                                0698
*                (GPR02P,                                          0698
*                 GPR03P,                                          0698
*                 GPR04P,                                          0698
*                 GPR15P) RSTD;                                    0698
*               RFY                                                0699
*                (GPR01P,                                          0699
*                 GPR13P) RSTD;                                    0699
*               GENERATE REFS(GPR01P,GPR02P,GPR13P) SETS(RPHWORK); 0700
          STM GPR02P,GPR13P,RPHWORK(GPR01P)
*               RFY                                                0701
*                 GPR13P UNRSTD;                                   0701
*               GPR04P=WORKA;                                      0702
         LR    GPR04P,WORKA                                        0702
*               DCL                                                0703
*                 1 FMZA0045 FIXED(31) STATIC LOCAL,               0703
*                  2 * FIXED(8) INIT(192),                         0703
*                  2 * PTR(24) INIT(0);                            0703
*               GPR03F=FMZA0045;                                   0704
         L     GPR03F,FMZA0045                                     0704
*               DO;                 /* LISATCVT                    0705
*                                      CVTBASE(PAGEABLE,(GPR15P))    */
*                 GPR15P=ATCLCPTR;  /* SET UP ATCVT POINTER          */
         L     GPR15P,ATCLCPTR                                     0706
*               END;                /* LISATCVT                      */
*               GPR02P=GPR15P->ATCBPDA;                            0708
         L     GPR02P,ATCBPDA(,GPR15P)                             0708
*               GPR15P=GPR15P->ATCSMRS;                            0709
         L     GPR15P,ATCSMRS(,GPR15P)                             0709
*               DCL                                                0710
*                 FMZL0045 BASED(GPR15P) LABEL VALUERANGE(*);      0710
*               CALL FMZL0045;                                     0711
         BALR  @14,@15                                             0711
*               RFY                                                0712
*                 GPR13P RSTD;                                     0712
*               GENERATE REFS(GPR01P,RPHWORK) SETS(GPR02P,GPR13P); 0713
          LM GPR02P,GPR13P,RPHWORK(GPR01P)
*               RFY                                                0714
*                (GPR01P,                                          0714
*                 GPR13P) UNRSTD;                                  0714
*               RFY                                                0715
*                (GPR02P,                                          0715
*                 GPR03P,                                          0715
*                 GPR04P,                                          0715
*                 GPR15P) UNRSTD;                                  0715
*             END;                  /* *********END OF RELSTORE    0716
*                                      EXPANSION********* FREE IT    */
*           END;                                                   0717
*         ELSE                                                     0718
*           ;                                                      0718
@RF00693 DS    0H                                                  0719
*         IF ICNZV001=0 THEN        /* NO UNUSED READ BUFFERS      0719
*                                                            @Z40GKD9*/
         SLR   @11,@11                                             0719
         C     @11,ICNZV001(,PTRICN)                               0719
         BNE   @RF00719                                            0719
*           ICNZV00A=0;             /* ZERO LAST READ BUFFER POINTER
*                                                            @Z40GKD9*/
         STCM  @11,7,ICNZV00A(PTRICN)                              0720
*         ELSE                                                     0721
*           ;                       /*                       @Z40GKD9*/
@RF00719 DS    0H                                                  0722
*         RFY                                                      0722
*           WORKA UNRSTD;                                          0722
*         ICNZH001=ICNZH001+1;      /* INCREMENT SIO COUNTER         */
         LA    @00,1                                               0723
         LH    @15,ICNZH001(,PTRICN)                               0723
         N     @15,@CF03945                                        0723
         ALR   @00,@15                                             0723
         STH   @00,ICNZH001(,PTRICN)                               0723
*         IF ICNZH001=ICNZNXCT THEN /* SIO CTR TO BE MAX?            */
         C     @00,@CF03955                                        0724
         BNE   @RF00724                                            0724
*           ICNDIEW2=0;             /* YES - GO TO CEA NEXT TIME     */
         SLR   @00,@00                                             0725
         ST    @00,ICNDIEW2(,PTRICN)                               0725
*         ELSE                                                     0726
*           ;                                                      0726
@RF00724 DS    0H                                                  0727
*         IF(ICNSIOQ^=0×ICNZV524^=0 /* IF LOCAL OR REMOTE ICNCB SIO  */
*             ×ICNZF013='1'B) THEN  /* QUEUE NOT EMPTY OR ATTN RECD  */
         L     @00,ICNSIOQ(,PTRICN)                                0727
         LTR   @00,@00                                             0727
         BNZ   @RT00727                                            0727
         L     @00,ICNZV524-1(,PTRICN)                             0727
         ICM   @00,8,@CB00182                                      0727
         LTR   @00,@00                                             0727
         BNZ   @RT00727                                            0727
         TM    ICNZF013(PTRICN),B'00001000'                        0727
         BNO   @RF00727                                            0727
@RT00727 DS    0H                                                  0728
*           CALL ATCZFSVT->ZFSZEMAB;/* CALL I/O INIT & SCHED @Z40GKD7*/
         L     @14,ATCZFSVT(,PTRATC)                               0728
         L     @15,ZFSZEMAB(,@14)                                  0728
         BALR  @14,@15                                             0728
*         ELSE                                                     0729
*           DO;                     /*                       @Z40GKD7*/
         B     @RC00727                                            0729
@RF00727 DS    0H                                                  0730
*             RFY                                                  0730
*               RCDREG RSTD;        /*                       @Z40GKD7*/
*             RCDREG=4;             /* NO I/O TO START       @Z40GKD7*/
         LA    RCDREG,4                                            0731
*           END;                    /*                       @Z40GKD7*/
*         IF RCDREG=0 THEN          /* I/O TO START?                 */
@RC00727 LTR   RCDREG,RCDREG                                       0733
         BNZ   @RF00733                                            0733
*           DO;                                                    0734
*             ICNDIEW3=REDRIVE;     /* INDICATE REDRIVE              */
         MVC   ICNDIEW3(4,PTRICN),@CF00073                         0735
*             RFY                                                  0736
*               RCDREG UNRSTD;                                     0736
*           END;                                                   0737
*         ELSE                                                     0738
*           DO;                     /* OTHERWISE                     */
         B     @RC00733                                            0738
@RF00733 DS    0H                                                  0739
*             ICNZF00D=OFF;         /* SET CONTROL UNIT BUSY OFF     */
         L     @00,ICNZF00D-1(,PTRICN)                             0739
@GL00009 LR    @15,@00                                             0739
         N     @15,@CF04112                                        0739
         CS    @00,@15,ICNZF00D-1(PTRICN)                          0739
         BNE   @GL00009                                            0739
*             ICNDIEW3=0;           /* INDICATE SECOND EXIT IGNORE   */
         SLR   @00,@00                                             0740
         ST    @00,ICNDIEW3(,PTRICN)                               0740
*           END;                                                   0741
*         RFY                                                      0742
*           RCDREG RSTD;                                           0742
@RC00733 DS    0H                                                  0743
*         RCDREG=IGNORE;            /* 1ST EXIT IGNORE               */
         LA    RCDREG,8                                            0743
*         RFY                                                      0744
*           RCDREG UNRSTD;                                         0744
*         IOSDIE=ADDR(REDRIVEP);    /* SET DIE PTR TO 2ND ENTRY      */
         LA    @00,REDRIVEP                                        0745
         ST    @00,IOSDIE+520(,PTRICN)                             0745
*       END ENDDIE;                                                0746
*     END;                                                         0747
*EXIT:                                                             0748
*   SAVREG=ICNDIEW1;                /* RESTORE SAVE AREA             */
EXIT     L     SAVREG,ICNDIEW1(,PTRICN)                            0748
*   RFY                                                            0749
*    (R00,                                                         0749
*     RTNREG,                                                      0749
*     RCDREG) RSTD;                                                0749
*   GEN REFS(R00,SAVREG,RTNREG,RCDREG) FLOWS(REDRIVEP);            0750
 LM R00,RTNREG,0(SAVREG)         RESTORE REGS
 B  0(RCDREG,RTNREG)             RETURN TO IOS
*   RFY                                                            0751
*    (R00,                                                         0751
*     RTNREG,                                                      0751
*     RCDREG) UNRSTD;                                              0751
*   GEN(EJECT);                                                    0752
         EJECT
*FDBPROC:                                                          0753
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0753
*                                                                  0753
         B     @PB00002                                            0753
FDBPROC  DS    0H                                                  0754
*   /*****************************************************************/
*   /*                                                               */
*   /* FDBPROC                                                       */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0754
*   RFY                                                            0754
*    (WORKA,                                                       0754
*     WORKB,                                                       0754
*     WORKC,                                                       0754
*     PTRNCB,                                                      0754
*     CCWPTR,                                                      0754
*     WORKX,                                                       0754
*     PTRZIB) RSTD;                 /*                       @ZM31492*/
*   RFY                                                            0755
*     ISTZIBUF BASED(WORKC);                                       0755
*   DO WHILE WORKB^=0;              /* PROCESS REMAINING BUFS OF   0756
*                                      PIU/BTU                       */
         B     @DE00756                                            0756
@DL00756 DS    0H                                                  0757
*     IF ZIBCHAIN=0 THEN            /* IF BUFF NOT CHAINED   @ZM42119*/
         L     @08,ZIBCHAIN(,WORKC)                                0757
         LTR   @08,@08                                             0757
         BNZ   @RF00757                                            0757
*       DO;                                                        0758
*         ICNZF001=ON;              /* SET SHOULD NOT OCCUR  @ZM42119*/
         L     @08,ICNZF001(,PTRICN)                               0759
@GL00010 LR    @00,@08                                             0759
         O     @00,@CF04115                                        0759
         CS    @08,@00,ICNZF001(PTRICN)                            0759
         BNE   @GL00010                                            0759
*         ICNDIEW2=0;               /* GOTO CEA NEXT TIME    @ZM42119*/
         SLR   @08,@08                                             0760
         ST    @08,ICNDIEW2(,PTRICN)                               0760
*         GOTO CONPSTAT;            /* BRANCH TO END         @ZM42119*/
         B     CONPSTAT                                            0761
*       END;                        /*                       @ZM42119*/
*     ELSE                                                         0763
*       DO;                         /* IF BUFF CHAINED       @ZM42119*/
@RF00757 DS    0H                                                  0764
*         WORKC=ZIBCHAIN;           /* GET NEXT FDB BUFFER           */
         L     WORKC,ZIBCHAIN(,WORKC)                              0764
*         ZIBLNG2=ICNZCON2;         /* SET BUFFER LENGTH     @ZA28915*/
         LH    @08,ICNZCON2(,PTRICN)                               0765
         N     @08,@CF03945                                        0765
         STH   @08,ZIBLNG2(,WORKC)                                 0765
*         FDBOFSET=0;               /* SET FDB OFFSET                */
         SLR   @08,@08                                             0766
         STH   @08,FDBOFSET(,WORKC)                                0766
*         FDBDATAA=ADDR(ZIBTEXT);   /* SET FDB DATA ADDR             */
         LA    @08,ZIBTEXT(,WORKC)                                 0767
         ST    @08,FDBDATAA(,WORKC)                                0767
*         WORKB=WORKB-1;            /* DECREMENT BUFFER COUNT        */
         BCTR  WORKB,0                                             0768
*         FDBDATCT=ICNZCON3;        /* SET FDB DATA COUNT            */
         LH    @08,ICNZCON3(,PTRICN)                               0769
         N     @08,@CF03945                                        0769
         STH   @08,FDBDATCT(,WORKC)                                0769
*         ICNBUFF=ICNBUFF+1;        /* INCREMENT # OF BUFFERS NEEDED
*                                                            @Z40GKD9*/
         LA    @08,1                                               0770
         SLR   @00,@00                                             0770
         IC    @00,ICNBUFF(,PTRICN)                                0770
         ALR   @08,@00                                             0770
         STC   @08,ICNBUFF(,PTRICN)                                0770
*       END;                        /* END BUFF CHAINED      @ZM42119*/
*   END;                                                           0772
@DE00756 SLR   @08,@08                                             0772
         CR    WORKB,@08                                           0772
         BNE   @DL00756                                            0772
*   FDBDATCT=WORKA;                 /* SET FDB DATA COUNT FOR LAST 0773
*                                      BUF                           */
         STH   WORKA,FDBDATCT(,WORKC)                              0773
*   ICNZV001=ZIBCHAIN;              /* REMOVE THIS                   */
         L     @00,ZIBCHAIN(,WORKC)                                0774
         ST    @00,ICNZV001(,PTRICN)                               0774
*   ZIBCHAIN=0;                     /* PIU/BTU FROM READ CHAIN       */
         ST    @08,ZIBCHAIN(,WORKC)                                0775
*   RFY                                                            0776
*     ISTZIBUF BASED(PTRZIB);                                      0776
*   RFY                                                            0777
*    (WORKA,                                                       0777
*     WORKB,                                                       0777
*     WORKC,                                                       0777
*     PTRNCB,                                                      0777
*     CCWPTR,                                                      0777
*     WORKX,                                                       0777
*     PTRZIB) UNRSTD;               /*                       @ZM31492*/
*   END FDBPROC;                                                   0778
@EL00002 DS    0H                                                  0778
@EF00002 DS    0H                                                  0778
@ER00002 BR    @14                                                 0778
@PB00002 DS    0H                                                  0779
*   GEN(EJECT);                                                    0779
         EJECT
*REDRIVEP:                                                         0780
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0780
*                                                                  0780
         B     @PB00003                                            0780
REDRIVEP DS    0H                                                  0781
*   /*****************************************************************/
*   /*                                                               */
*   /* REDRIVE                                                       */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0781
*   RFY                                                            0781
*    (R00,                                                         0781
*     R4,                                                          0781
*     R5,                                                          0781
*     R6,                                                          0781
*     UCBPTR,                                                      0781
*     R8,                                                          0781
*     R9,                                                          0781
*     R10,                                                         0781
*     R11,                                                         0781
*     R12,                                                         0781
*     RTNREG,                                                      0781
*     R15) RSTD;                                                   0781
*   R2=UCBICNCB;                    /* ADDRESS ICNCB                 */
         L     R2,UCBICNCB+512(,UCBPTR)                            0782
*   RFY                                                            0783
*     ISTICNCB BASED(R2);                                          0783
*   R01=ICNDIEW2;                   /* SET                           */
         L     R01,ICNDIEW2(,R2)                                   0784
*   IOSDIE=R01;                     /* DIE PTR                       */
         ST    R01,IOSDIE+520(,R2)                                 0785
*   R01=ADDR(ICNSRB);               /* POINT TO SRB                  */
         LA    R01,ICNSRB(,R2)                                     0786
*   R2=ICNDIEW3;                    /* PREPARE FOR RETURN TO IOS     */
         L     R2,ICNDIEW3(,R2)                                    0787
*   GEN REFS(RTNREG,R2)(B 0(R2,RTNREG));/* RETURN                    */
         B 0(R2,RTNREG)
*   RFY                                                            0789
*     ISTICNCB BASED(PTRICN);                                      0789
*   RFY                                                            0790
*    (R00,                                                         0790
*     R4,                                                          0790
*     R5,                                                          0790
*     R6,                                                          0790
*     UCBPTR,                                                      0790
*     R8,                                                          0790
*     R9,                                                          0790
*     R10,                                                         0790
*     R11,                                                         0790
*     R12,                                                         0790
*     RTNREG,                                                      0790
*     R15) UNRSTD;                                                 0790
*   END REDRIVEP;                                                  0791
@EL00003 DS    0H                                                  0791
@EF00003 DS    0H                                                  0791
@ER00003 BR    @14                                                 0791
@PB00003 DS    0H                                                  0792
*   GEN(EJECT);                                                    0792
*                                                                  0792
         EJECT
*/*                                                                  */
*/*      RESPONSE CODE TRANSLATE TABLE                               */
*/*                                                                  */
*                                                                  0793
*   DCL                                                            0793
*     ISTZTRTB(256) BIT(8) STATIC LOCAL INIT                       0793
*                                                                  0793
*/*   X0 X1 X2 X3 X4 X5 X6 X7 X8 X9 XA XB XC XD XE XF                */
*                                                                  0793
*         (00,00,00,54,04,48,48,50,50,48,46,00,00,00,00,00,/* 00-0F  */
*         00,00,00,00,00,00,00,00,00,00,00,50,50,50,48,00,/* 10-1F   */
*         02,20,02,42,52,22,08,02,00,00,00,00,00,00,00,00,/* 20-2F   */
*         00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,/* 30-3F   */
*         02,20,02,42,52,22,08,02,00,00,00,00,00,00,00,00,/* 40-4F   */
*         00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,/* 50-5F   */
*         02,56,02,42,52,22,08,02,00,00,00,00,00,00,00,00,/* 60-6F   */
*         00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,/* 70-7F   */
*         00,08,06,06,10,06,06,12,06,18,14,34,14,08,08,06,/* 80-8F   */
*         00,14,06,32,14,12,16,00,06,14,28,06,06,28,40,08,/* 90-9F   */
*         24,24,24,24,38,44,24,20,24,30,26,28,00,00,00,00,/* A0-AF   */
*         00,00,00,32,00,00,00,00,36,08,00,00,00,00,40,00,/* B0-BF   */
*         24,24,24,24,38,44,24,20,24,30,26,28,24,00,00,00,/* C0-CF 0793
*                                                            @ZA18478*/
*         00,00,00,32,00,00,00,00,36,08,00,00,00,00,40,00,/* D0-DF   */
*         24,24,24,24,38,44,58,20,24,30,26,28,24,60,60,62,/* E0-EF 0793
*                                                            @ZM34558*/
*         00,00,00,32,00,00,00,00,36,08,00,00,00,00,40,00);/* F0-FF  */
*                                                                  0794
*/*                                                                  */
*/*      RETURN CODE TABLE                                           */
*/*                                                                  */
*                                                                  0794
*   DCL                                                            0794
*     ISTZRCTB(64) FIXED(8) STATIC LOCAL INIT('08'X,'AD'X,/* 00      */
*         '00'X,'00'X,              /* 02                            */
*         '80'X,'00'X,              /* 04                            */
*         '08'X,'A0'X,              /* 06                            */
*         '08'X,'A1'X,              /* 08                            */
*         '08'X,'A2'X,              /* 10                            */
*         '08'X,'A3'X,              /* 12                            */
*         '08'X,'A4'X,              /* 14                            */
*         '08'X,'A5'X,              /* 16                            */
*         '08'X,'A7'X,              /* 18                            */
*         '0C'X,'00'X,              /* 20                            */
*         '80'X,'08'X,              /* 22                            */
*         '0C'X,'80'X,              /* 24                            */
*         '0C'X,'81'X,              /* 26                            */
*         '0C'X,'82'X,              /* 28                            */
*         '0C'X,'84'X,              /* 30                            */
*         '0C'X,'A0'X,              /* 32                            */
*         '10'X,'00'X,              /* 34                            */
*         '10'X,'04'X,              /* 36                            */
*         '10'X,'80'X,              /* 38                            */
*         '18'X,'00'X,              /* 40                            */
*         '80'X,'04'X,              /* 42                            */
*         '80'X,'84'X,              /* 44                            */
*         '88'X,'00'X,              /* 46                            */
*         '88'X,'04'X,              /* 48                            */
*         '88'X,'08'X,              /* 50                            */
*         '8C'X,'00'X,              /* 52                            */
*         '80'X,'18'X,              /* 54                            */
*         '80'X,'1E'X,              /* 56                            */
*         '80'X,'90'X,              /* 58                            */
*         '88'X,'0C'X,              /* 60                            */
*         '88'X,'10'X);             /* 62                            */
*/* TPEPILOG                                                         */
*                                                                  0795
*   GEN(PRINT OFF);                                                0795
         PRINT OFF
*   DECLARE                                                        0796
*     EMCR0 PTR REG(0),                                            0796
*     EMCR1 PTR REG(1),                                            0796
*     EMCR2 PTR REG(2),                                            0796
*     EMCR3 PTR REG(3),                                            0796
*     EMCR4 PTR REG(4),                                            0796
*     EMCR5 PTR REG(5),                                            0796
*     EMCR6 PTR REG(6),                                            0796
*     EMCR7 PTR REG(7),                                            0796
*     EMCR8 PTR REG(8),                                            0796
*     EMCR9 PTR REG(9),                                            0796
*     EMCR10 PTR REG(10),                                          0796
*     EMCR11 PTR REG(11),                                          0796
*     EMCR12 PTR REG(12),                                          0796
*     EMCR13 PTR REG(13),                                          0796
*     EMCR14 PTR REG(14),                                          0796
*     EMCR15 PTR REG(15);                                          0796
*   DECLARE                                                        0797
*     ISTSDCCA ENTRY BASED(ATCCDADD) VALRG(*),/* CIDCTL ADD ROUTINE  */
*     ISTSDCCD ENTRY BASED(ATCCDDEL) VALRG(*),/* CIDCTL DELETE     0797
*                                      ROUTINE                       */
*     ISTSDCCF ENTRY BASED(ATCCDFND) VALRG(*),/* CIDCTL FIND ROUTINE */
*     ISTSDCCN ENTRY BASED(ATCCDFDN) VALRG(*),/* CIDCTL FIND NCB   0797
*                                      ROUTINE                       */
*     ISTSDCCR ENTRY BASED(ATCCDFIN) VALRG(*);/* CIDCTL FINISH     0797
*                                      ROUTINE                       */
*   DCL                                                            0798
*     CMZCIDM FIXED(15) DEFINED(ATCCIDM);/* CIDMASK ALIAS            */
*   DCL                                                            0799
*     ISTAPC34 ENTRY BASED(ATCAP34) VALRG(*);/* RESET ROUTINE        */
*   DCL                                                            0800
*     ISTAPC37 ENTRY BASED(ATCAP37) VALRG(*);/* TPQUE ROUTINE        */
*   GEN(PRINT ON);                                                 0801
*                                                                  0801
         PRINT ON
*/* END OF TPEPILOG                                                  */
*                                                                  0802
*   END ISTZFM3B                                                   0802
*                                                                  0802
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */
*/*%INCLUDE SYSLIB  (IECDIOSB)                                       */
*/*%INCLUDE SYSLIB  (IHASRB  )                                       */
*/*%INCLUDE SYSLIB  (IHAPSA  )                                       */
*/*%INCLUDE SYSLIB  (IEFUCBOB)                                       */
*/*%INCLUDE SYSLIB  (CVT     )                                       */
*/*%INCLUDE SYSUT5  (CSWXLATE)                                       */
*/*%INCLUDE SYSUT5  (DEBLOK  )                                       */
*/*%INCLUDE SYSUT5  (FID1PROC)                                       */
*/*%INCLUDE SYSUT5  (FID0PROC)                                       */
*/*%INCLUDE SYSUT5  (ENDDIE  )                                       */
*                                                                  0802
*       ;                                                          0802
@EL00001 DS    0H                                                  0802
@EF00001 DS    0H                                                  0802
@ER00001 BR    @14                                                 0802
@DATA    DS    0H
@DATD    DSECT
         DS    0F
ISTZFM3B CSECT
         DS    0F
@CF00035 DC    F'1'
@CF00312 DC    F'3'
@CF00073 DC    F'4'
@CF00071 DC    F'8'
@CF02212 DC    F'10'
@CF03957 DC    F'132'
@CF04106 DC    F'-4'
@CF01711 DC    XL4'80000000'
@CF03945 DC    XL4'0000FFFF'
@CF03951 DC    XL4'427F'
@CF03955 DC    XL4'FFFE'
@CF04109 DC    BL4'00000000000010000000000000000000'
@CF04112 DC    BL4'11111111101111111111111111111111'
@CF04115 DC    BL4'10000000000000000000000000000000'
@CF01652 DC    C'210I'
@DATD    DSECT
         DS    0D
IOSBPTR  DS    A
SRBPTR   DS    A
BDUPTR   DS    A
BTUPTR   DS    A
FSBPTR   DS    A
ISTZMSG  DS    F
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA
@ENDDATD EQU   *
ISTZFM3B CSECT
         DS    0F
@SIZDATD DC    AL1(0)
         DC    AL3(@ENDDATD-@DATD)
         DS    0D
FMZA0029 DS    FL4
         ORG   FMZA0029
@NM00090 DC    AL1(192)
@NM00091 DC    AL3(0)
         ORG   FMZA0029+4
FMZA0045 DS    FL4
         ORG   FMZA0045
@NM00092 DC    AL1(192)
@NM00093 DC    AL3(0)
         ORG   FMZA0045+4
@CB03949 DC    X'0000'
@CB00182 EQU   @CB03949
ISTZTRTB DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(54)
         DC    AL1(4)
         DC    AL1(48)
         DC    AL1(48)
         DC    AL1(50)
         DC    AL1(50)
         DC    AL1(48)
         DC    AL1(46)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(50)
         DC    AL1(50)
         DC    AL1(50)
         DC    AL1(48)
         DC    AL1(0)
         DC    AL1(2)
         DC    AL1(20)
         DC    AL1(2)
         DC    AL1(42)
         DC    AL1(52)
         DC    AL1(22)
         DC    AL1(8)
         DC    AL1(2)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(2)
         DC    AL1(20)
         DC    AL1(2)
         DC    AL1(42)
         DC    AL1(52)
         DC    AL1(22)
         DC    AL1(8)
         DC    AL1(2)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(2)
         DC    AL1(56)
         DC    AL1(2)
         DC    AL1(42)
         DC    AL1(52)
         DC    AL1(22)
         DC    AL1(8)
         DC    AL1(2)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(8)
         DC    AL1(6)
         DC    AL1(6)
         DC    AL1(10)
         DC    AL1(6)
         DC    AL1(6)
         DC    AL1(12)
         DC    AL1(6)
         DC    AL1(18)
         DC    AL1(14)
         DC    AL1(34)
         DC    AL1(14)
         DC    AL1(8)
         DC    AL1(8)
         DC    AL1(6)
         DC    AL1(0)
         DC    AL1(14)
         DC    AL1(6)
         DC    AL1(32)
         DC    AL1(14)
         DC    AL1(12)
         DC    AL1(16)
         DC    AL1(0)
         DC    AL1(6)
         DC    AL1(14)
         DC    AL1(28)
         DC    AL1(6)
         DC    AL1(6)
         DC    AL1(28)
         DC    AL1(40)
         DC    AL1(8)
         DC    AL1(24)
         DC    AL1(24)
         DC    AL1(24)
         DC    AL1(24)
         DC    AL1(38)
         DC    AL1(44)
         DC    AL1(24)
         DC    AL1(20)
         DC    AL1(24)
         DC    AL1(30)
         DC    AL1(26)
         DC    AL1(28)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(32)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(36)
         DC    AL1(8)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(40)
         DC    AL1(0)
         DC    AL1(24)
         DC    AL1(24)
         DC    AL1(24)
         DC    AL1(24)
         DC    AL1(38)
         DC    AL1(44)
         DC    AL1(24)
         DC    AL1(20)
         DC    AL1(24)
         DC    AL1(30)
         DC    AL1(26)
         DC    AL1(28)
         DC    AL1(24)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(32)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(36)
         DC    AL1(8)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(40)
         DC    AL1(0)
         DC    AL1(24)
         DC    AL1(24)
         DC    AL1(24)
         DC    AL1(24)
         DC    AL1(38)
         DC    AL1(44)
         DC    AL1(58)
         DC    AL1(20)
         DC    AL1(24)
         DC    AL1(30)
         DC    AL1(26)
         DC    AL1(28)
         DC    AL1(24)
         DC    AL1(60)
         DC    AL1(60)
         DC    AL1(62)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(32)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(36)
         DC    AL1(8)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(0)
         DC    AL1(40)
         DC    AL1(0)
ISTZRCTB DC    XL1'08'
         DC    XL1'AD'
         DC    XL1'00'
         DC    XL1'00'
         DC    XL1'80'
         DC    XL1'00'
         DC    XL1'08'
         DC    XL1'A0'
         DC    XL1'08'
         DC    XL1'A1'
         DC    XL1'08'
         DC    XL1'A2'
         DC    XL1'08'
         DC    XL1'A3'
         DC    XL1'08'
         DC    XL1'A4'
         DC    XL1'08'
         DC    XL1'A5'
         DC    XL1'08'
         DC    XL1'A7'
         DC    XL1'0C'
         DC    XL1'00'
         DC    XL1'80'
         DC    XL1'08'
         DC    XL1'0C'
         DC    XL1'80'
         DC    XL1'0C'
         DC    XL1'81'
         DC    XL1'0C'
         DC    XL1'82'
         DC    XL1'0C'
         DC    XL1'84'
         DC    XL1'0C'
         DC    XL1'A0'
         DC    XL1'10'
         DC    XL1'00'
         DC    XL1'10'
         DC    XL1'04'
         DC    XL1'10'
         DC    XL1'80'
         DC    XL1'18'
         DC    XL1'00'
         DC    XL1'80'
         DC    XL1'04'
         DC    XL1'80'
         DC    XL1'84'
         DC    XL1'88'
         DC    XL1'00'
         DC    XL1'88'
         DC    XL1'04'
         DC    XL1'88'
         DC    XL1'08'
         DC    XL1'8C'
         DC    XL1'00'
         DC    XL1'80'
         DC    XL1'18'
         DC    XL1'80'
         DC    XL1'1E'
         DC    XL1'80'
         DC    XL1'90'
         DC    XL1'88'
         DC    XL1'0C'
         DC    XL1'88'
         DC    XL1'10'
@00      EQU   00                      EQUATES FOR REGISTERS 0-15
@01      EQU   01
@02      EQU   02
@03      EQU   03
@04      EQU   04
@05      EQU   05
@06      EQU   06
@07      EQU   07
@08      EQU   08
@09      EQU   09
@10      EQU   10
@11      EQU   11
@12      EQU   12
@13      EQU   13
@14      EQU   14
@15      EQU   15
UCBPTR   EQU   @07
RPHPTR   EQU   @01
R00      EQU   @00
PTRRPH   EQU   @01
R01      EQU   @01
PTRATC   EQU   @02
R02      EQU   @02
R2       EQU   @02
PTRICN   EQU   @03
PTRNCB   EQU   @04
R4       EQU   @04
CCWPTR   EQU   @05
R5       EQU   @05
PTRZIB   EQU   @06
R6       EQU   @06
WORKX    EQU   @07
WORKY    EQU   @08
R8       EQU   @08
WORKC    EQU   @09
R9       EQU   @09
WORKA    EQU   @10
R10      EQU   @10
WORKB    EQU   @11
R11      EQU   @11
BASEREG  EQU   @12
R12      EQU   @12
SAVREG   EQU   @13
RTNREG   EQU   @14
RCDREG   EQU   @15
R15      EQU   @15
EMCR2    EQU   @02
EMCR3    EQU   @03
GPR00P   EQU   @00
GPR01P   EQU   @01
GPR04P   EQU   @04
GPR05P   EQU   @05
GPR15P   EQU   @15
GPR02P   EQU   @02
GPR03F   EQU   @03
GPR03P   EQU   @03
GPR13P   EQU   @13
EMCR0    EQU   @00
EMCR1    EQU   @01
EMCR10   EQU   @10
EMCR11   EQU   @11
EMCR12   EQU   @12
EMCR13   EQU   @13
EMCR14   EQU   @14
EMCR15   EQU   @15
EMCR4    EQU   @04
EMCR5    EQU   @05
EMCR6    EQU   @06
EMCR7    EQU   @07
EMCR8    EQU   @08
EMCR9    EQU   @09
GPR00F   EQU   @00
GPR01F   EQU   @01
GPR02F   EQU   @02
GPR04F   EQU   @04
GPR05F   EQU   @05
GPR06F   EQU   @06
GPR06P   EQU   @06
GPR07F   EQU   @07
GPR07P   EQU   @07
GPR08F   EQU   @08
GPR08P   EQU   @08
GPR09F   EQU   @09
GPR09P   EQU   @09
GPR10F   EQU   @10
GPR10P   EQU   @10
GPR11F   EQU   @11
GPR11P   EQU   @11
GPR12F   EQU   @12
GPR12P   EQU   @12
GPR13F   EQU   @13
GPR14F   EQU   @14
GPR14P   EQU   @14
GPR15F   EQU   @15
PSA      EQU   0
FLCRNPSW EQU   PSA
FLCROPSW EQU   PSA+8
FLCICCW2 EQU   PSA+16
PSAEEPSW EQU   PSA+132
PSAESPSW EQU   PSA+136
FLCSVILC EQU   PSAESPSW+1
PSAEPPSW EQU   PSA+140
FLCPIILC EQU   PSAEPPSW+1
FLCPICOD EQU   PSAEPPSW+2
PSAPICOD EQU   FLCPICOD+1
FLCTEA   EQU   PSAEPPSW+4
FLCPER   EQU   PSA+152
FLCMCLA  EQU   PSA+168
FLCIOEL  EQU   FLCMCLA+4
FLCIOA   EQU   FLCMCLA+16
FLCFSA   EQU   FLCMCLA+80
PSACPUPA EQU   PSA+516
PSASUPER EQU   PSA+552
PSASUP1  EQU   PSASUPER
PSASUP2  EQU   PSASUPER+1
PSASUP3  EQU   PSASUPER+2
PSASUP4  EQU   PSASUPER+3
PSACLHT  EQU   PSA+640
PSALKSA  EQU   PSA+696
PSAHLHI  EQU   PSA+760
PSADSSFL EQU   PSA+836
PSADSSF1 EQU   PSADSSFL
PSADSSF3 EQU   PSADSSFL+2
PSADSSF4 EQU   PSADSSFL+3
PSARSVT  EQU   PSA+896
CVTPTR   EQU   16
ATCLCPTR EQU   1032
IOSB     EQU   0
IOSFLA   EQU   IOSB
IOSACHN  EQU   IOSFLA
IOSFLB   EQU   IOSB+1
IOSFLC   EQU   IOSB+2
IOSDVALT EQU   IOSFLC
IOSPKEY  EQU   IOSB+12
IOSOPT   EQU   IOSB+14
IOSOPT2  EQU   IOSB+15
@NM00002 EQU   IOSB+20
IOSCC    EQU   @NM00002
IOSCSW   EQU   @NM00002+1
IOSTATUS EQU   IOSCSW+3
IOSIPIB  EQU   IOSB+44
IOSDIE   EQU   IOSB+68
IOSPATH  EQU   IOSB+86
IOSCHN   EQU   IOSPATH
IOSCKEY  EQU   IOSB+89
IOSEEKA  EQU   IOSB+100
IOSCCHH  EQU   IOSEEKA+3
IOSSKHH  EQU   IOSCCHH+2
SRBSECT  EQU   0
SRBFLC   EQU   SRBSECT+12
UCB      EQU   0
UCBOB    EQU   0
UCBJBNR  EQU   UCBOB
UCBFL5   EQU   UCBOB+1
UCBAF    EQU   UCBFL5
UCBSTAT  EQU   UCBOB+3
UCBCHAN  EQU   UCBOB+4
UCBSFLS  EQU   UCBOB+6
UCBFLA   EQU   UCBSFLS
UCBFL1   EQU   UCBFLA
UCBBSY   EQU   UCBFL1
UCBNRY   EQU   UCBFL1
UCBPST   EQU   UCBFL1
UCBCUB   EQU   UCBFL1
UCBFLB   EQU   UCBSFLS+1
UCBCHM   EQU   UCBOB+8
UCBCHM1  EQU   UCBCHM
UCBPTH0  EQU   UCBCHM1
UCBPTH1  EQU   UCBCHM1
UCBWGT   EQU   UCBOB+12
UCBTYP   EQU   UCBOB+16
UCBTBYT1 EQU   UCBTYP
UCB1FEA5 EQU   UCBTBYT1
UCB1FEA6 EQU   UCBTBYT1
UCBTBYT2 EQU   UCBTYP+1
UCB2OPT2 EQU   UCBTBYT2
UCBDUDN1 EQU   UCB2OPT2
UCB2OPT3 EQU   UCBTBYT2
UCBDUDN2 EQU   UCB2OPT3
UCB2OPT4 EQU   UCBTBYT2
UCBRWTAU EQU   UCB2OPT4
UCB2OPT6 EQU   UCBTBYT2
UCB2OPT7 EQU   UCBTBYT2
UCBTBYT3 EQU   UCBTYP+2
UCBDVCLS EQU   UCBTBYT3
UCBTBYT4 EQU   UCBTYP+3
UCBEXTPT EQU   UCBOB+20
UCBFLC   EQU   UCBEXTPT
UCBDEV   EQU   UCBOB+24
UCBCMEXT EQU   0
UCBATI   EQU   UCBCMEXT+3
@NM00037 EQU   UCBATI
UCBFLP1  EQU   UCBCMEXT+5
UCBMT    EQU   0
UCBOCR   EQU   0
UCB3540X EQU   0
UCBDKBYT EQU   UCB3540X+6
UCB3800X EQU   0
UCBOPTNS EQU   UCB3800X
UCBACTIV EQU   UCB3800X+3
UCBMDRBF EQU   UCB3800X+36
UCBUCS   EQU   0
UCBUCSOP EQU   UCBUCS+4
UCBFCBOP EQU   UCBUCS+5
CVTMAP   EQU   0
CVTDAR   EQU   CVTMAP+72
CVTFLGS1 EQU   CVTDAR
CVTDCB   EQU   CVTMAP+116
CVTIERLC EQU   CVTMAP+144
CVTOPTA  EQU   CVTMAP+182
CVTOPTB  EQU   CVTMAP+183
CVTGTF   EQU   CVTMAP+236
CVTGTFST EQU   CVTGTF
CVTGTFS  EQU   CVTGTFST
CVTSTATE EQU   CVTGTFST
CVTTMODE EQU   CVTGTFST
CVTFORM  EQU   CVTGTFST
CVTAQAVT EQU   CVTMAP+240
CVTTCMFG EQU   CVTAQAVT
CVTVOLM2 EQU   CVTMAP+244
CVTTATA  EQU   CVTVOLM2
CVTTSKS  EQU   CVTTATA
CVTVOLF2 EQU   CVTTSKS
CVTTAT   EQU   CVTTATA+1
CVTATER  EQU   CVTMAP+248
CVTEXT1  EQU   CVTMAP+252
CVTPURG  EQU   CVTMAP+260
CVTQMSG  EQU   CVTMAP+268
CVTDMSR  EQU   CVTMAP+272
CVTRSV37 EQU   CVTDMSR
CVTDMSRF EQU   CVTRSV37
CVTPTRV  EQU   CVTMAP+288
CVTERPV  EQU   CVTMAP+316
CVTINTLA EQU   CVTMAP+320
CVTAPF   EQU   CVTMAP+324
CVTEXT2  EQU   CVTMAP+328
CVTHJES  EQU   CVTMAP+332
CVTPGSIA EQU   CVTMAP+348
CVTA1F1  EQU   CVTMAP+356
CVTSYSK  EQU   CVTMAP+357
CVTVOLM1 EQU   CVTMAP+380
CVTVOLF1 EQU   CVTVOLM1
CVTATMCT EQU   CVTMAP+388
CVTXTNT1 EQU   0
CVTXTNT2 EQU   0
CVTDSSV  EQU   CVTXTNT2
CVTFLGBT EQU   CVTXTNT2+5
CVTQID   EQU   CVTXTNT2+24
CVTSHS   EQU   CVTXTNT2+40
CVTRV400 EQU   CVTXTNT2+52
CVTRV409 EQU   CVTXTNT2+53
CVTATCVT EQU   CVTXTNT2+64
CVTRV429 EQU   CVTXTNT2+84
CVTRV438 EQU   CVTXTNT2+85
CVTRV457 EQU   CVTXTNT2+112
CVTRV466 EQU   CVTXTNT2+113
CVTFIX   EQU   0
CVTRELNO EQU   CVTFIX+252
ISTAVT   EQU   0
ISTAS49  EQU   ISTAVT+4
ISTPAB   EQU   0
PABWQCHN EQU   ISTPAB
PABWEQA  EQU   PABWQCHN
PABCHAIN EQU   PABWQCHN+4
PABRPHFG EQU   ISTPAB+12
PABFLAGS EQU   PABRPHFG
PABERLCK EQU   PABFLAGS
PABERRLK EQU   PABERLCK
ISTDYPAB EQU   0
DYPPAB   EQU   ISTDYPAB+16
ISTRPH   EQU   0
RPHCNTL  EQU   ISTRPH
RPHFLAGS EQU   RPHCNTL+2
RPHAPTYP EQU   RPHFLAGS
RPHFSTLC EQU   RPHFLAGS
RPHFLGB  EQU   RPHCNTL+3
RPHRPHA  EQU   ISTRPH+4
RPHTSKID EQU   ISTRPH+8
RPHRESMA EQU   ISTRPH+16
RPHWPFLG EQU   RPHRESMA
RPHWEA   EQU   ISTRPH+24
RPHCSPA  EQU   RPHWEA
RPHSRPRM EQU   ISTRPH+28
RPHPABQA EQU   ISTRPH+36
RPHWORK  EQU   ISTRPH+40
RPHSAVE1 EQU   RPHWORK
RPHSBITS EQU   RPHSAVE1+1
ISTPST   EQU   0
PSTRQFGA EQU   ISTPST+8
PSTRQUE  EQU   PSTRQFGA
PSTFLGA  EQU   PSTRQFGA+4
PSTABINP EQU   PSTFLGA
PSTDMPS  EQU   ISTPST+132
ISTMPST  EQU   0
MPSRSV07 EQU   ISTMPST+4
MPSRQUE  EQU   ISTMPST+8
MPSFLGA  EQU   ISTMPST+12
MPSCRA   EQU   ISTMPST+24
MPSCRACT EQU   MPSCRA+4
MPSSRB   EQU   ISTMPST+32
MPSSRBCT EQU   MPSSRB+4
MPSCRPL  EQU   ISTMPST+40
MPSRPLCT EQU   MPSCRPL+4
ISTDEVCH EQU   0
DEVSHCH  EQU   ISTDEVCH
DEVCHAR  EQU   DEVSHCH
DEVTCODE EQU   ISTDEVCH+1
DEVFLAGS EQU   ISTDEVCH+3
DEVFCCTL EQU   DEVFLAGS
DEVCHAR3 EQU   DEVFLAGS
ISTNCB   EQU   0
NCBFLAGS EQU   ISTNCB+24
NCBFRAS  EQU   NCBFLAGS+1
NCBFTRIO EQU   NCBFRAS
NCBFLAG1 EQU   NCBFLAGS+2
ISTLOK   EQU   0
LOKCHN   EQU   ISTLOK+1
LOKCHNG  EQU   LOKCHN
@NM00047 EQU   LOKCHNG+2
ISTICNCB EQU   0
@NM00049 EQU   ISTICNCB+53
ICNLCLUS EQU   @NM00049
ICNCKFLD EQU   ISTICNCB+96
ICNFLAG  EQU   ISTICNCB+100
ICNZF006 EQU   ICNFLAG
ICNFFLAG EQU   ISTICNCB+101
ICNZSWS  EQU   ISTICNCB+102
ICNSIOQ  EQU   ISTICNCB+104
ICNRPH   EQU   ISTICNCB+120
ICNFLAG2 EQU   ISTICNCB+236
ICNZF001 EQU   ICNFLAG2
ICNZF00D EQU   ICNFLAG2+1
ICNZF013 EQU   ICNFLAG2+1
ICNCPQ   EQU   ISTICNCB+244
ICNBUFF  EQU   ISTICNCB+248
ICNZV00A EQU   ISTICNCB+249
ICNZV001 EQU   ISTICNCB+252
ICNLSTIF EQU   ISTICNCB+260
ICNLSTIT EQU   ISTICNCB+264
ICNZV005 EQU   ISTICNCB+272
ICNZV006 EQU   ISTICNCB+276
ICNZD001 EQU   ISTICNCB+288
ICNWSCCW EQU   ICNZD001
ICNZD002 EQU   ISTICNCB+296
ICNZD005 EQU   ISTICNCB+304
ICNZD006 EQU   ISTICNCB+312
ICNZD003 EQU   ISTICNCB+320
ICNRSCCW EQU   ICNZD003
ICNRDCOD EQU   ICNRSCCW
ICNZD004 EQU   ISTICNCB+328
ICNZS1VR EQU   ISTICNCB+348
ICNSRV02 EQU   ICNZS1VR
ICNDIEWA EQU   ICNSRV02
ICNDIEW1 EQU   ICNDIEWA
ICNDIEW2 EQU   ICNDIEWA+4
ICNDIEW3 EQU   ICNDIEWA+8
ICNZH001 EQU   ISTICNCB+472
ICNDCDEB EQU   ISTICNCB+480
ICNDIDEB EQU   ICNDCDEB+12
ICNLCVTA EQU   ISTICNCB+496
ICNZFLAG EQU   ISTICNCB+508
ICNZH002 EQU   ISTICNCB+509
ICNZS002 EQU   ICNZH002
ICNZS003 EQU   ICNZH002
ICNZS004 EQU   ICNZH002
ICNZS006 EQU   ICNZH002
ICNZS007 EQU   ICNZH002
ICNZS008 EQU   ICNZH002
ICNZS009 EQU   ICNZH002+1
ICNZS00A EQU   ICNZH002+1
ICNIOSB  EQU   ISTICNCB+520
ICNSRB   EQU   ISTICNCB+628
ICNZCONS EQU   ISTICNCB+680
ICNZCON2 EQU   ICNZCONS+2
ICNZCON3 EQU   ICNZCONS+4
ICNZCON4 EQU   ICNZCONS+6
ICNZCON5 EQU   ICNZCONS+8
ISTLUNCB EQU   0
LUNZOS   EQU   ISTLUNCB+48
ISTATCVT EQU   0
ATCCOM   EQU   ISTATCVT
ATCSTAT  EQU   ATCCOM
ATCSTAT1 EQU   ATCSTAT
ATCSTFLG EQU   ATCSTAT+1
ATCPOFLG EQU   ATCSTAT+2
ATCSTAT4 EQU   ATCSTAT+3
ATCBPDA  EQU   ATCCOM+128
ATCIOTRC EQU   ATCCOM+140
ATCTHTRC EQU   ATCIOTRC
ATCSMRS  EQU   ATCCOM+188
ATCCIDM  EQU   ATCCOM+266
ATCCDADD EQU   ISTATCVT+276
ATCCDDEL EQU   ISTATCVT+280
ATCCDFND EQU   ISTATCVT+284
ATCCSMR  EQU   ISTATCVT+296
ATCSHRFG EQU   ISTATCVT+316
ATCHPGM  EQU   ISTATCVT+384
ATCCDFIN EQU   ISTATCVT+460
ATCCDFDN EQU   ISTATCVT+464
ATCVLCNT EQU   ISTATCVT+772
ATCRNO   EQU   ISTATCVT+788
ATCSOPD  EQU   ISTATCVT+792
ATCSIPD  EQU   ISTATCVT+800
ATCSECST EQU   ISTATCVT+812
ATCSTAT2 EQU   ISTATCVT+818
ATCVTBAM EQU   ISTATCVT+908
@NM00063 EQU   ATCVTBAM+3
ATCAOSM  EQU   ISTATCVT+912
ATCGSRBQ EQU   ATCAOSM+4
ATCGSRBG EQU   ATCGSRBQ
ATCAP34  EQU   ATCAOSM+32
ATCZFSVT EQU   ATCAOSM+68
ATCICAPP EQU   ATCAOSM+100
ATCLDAPP EQU   ATCAOSM+120
ATCDAPVT EQU   ATCAOSM+140
ATCZPAB2 EQU   ATCAOSM+224
ATCAP37  EQU   ATCAOSM+264
ATCCRA   EQU   ATCAOSM+280
ATCCRACN EQU   ATCCRA+4
ATCSRB   EQU   ATCAOSM+288
ATCSRBCN EQU   ATCSRB+4
ATCCRPL  EQU   ATCAOSM+296
ATCRPLCN EQU   ATCCRPL+4
ATCSQAFR EQU   ATCAOSM+304
ATCORTBC EQU   ATCSQAFR+4
ATCORSRB EQU   ATCORTBC
@NM00065 EQU   ATCAOSM+332
ATCVTFLG EQU   ATCAOSM+392
ATCTPCP0 EQU   ATCAOSM+580
ATCZFLAG EQU   ATCAOSM+588
ISTBDU   EQU   0
BDUMODIF EQU   ISTBDU+1
BDUMOD1  EQU   BDUMODIF
BDUDAF   EQU   ISTBDU+2
BDUFUNC  EQU   BDUDAF
BDUCHECK EQU   BDUFUNC
BDUFLAGS EQU   BDUDAF+1
ISTBTU   EQU   0
BTUBTH   EQU   ISTBTU
BTUFID   EQU   BTUBTH
BTUDEST  EQU   BTUBTH+2
BTUSORCE EQU   BTUBTH+4
BTUREQ   EQU   BTUBTH+6
BTURQFLG EQU   BTUREQ
BTUZRT05 EQU   BTURQFLG
BTUDCF   EQU   BTUBTH+8
BTURH    EQU   BTUBTH+10
BTUBDU   EQU   ISTBTU+14
BTUSYSTR EQU   ISTBTU+18
BTUEXTR  EQU   ISTBTU+19
ISTFDB   EQU   0
FDBDATAA EQU   ISTFDB+4
FDBDATCT EQU   ISTFDB+8
FDBOFSET EQU   ISTFDB+10
ISTFSB   EQU   0
FSBFSB   EQU   ISTFSB
FSBTYPE  EQU   FSBFSB
FSBLNGTH EQU   FSBFSB+1
FSBMNRCD EQU   FSBFSB+2
FSBMNDNU EQU   FSBMNRCD
FSBSFLGS EQU   FSBFSB+3
FSBFSBA  EQU   FSBFSB+4
FSBBTH   EQU   FSBFSB+8
FSBCID   EQU   FSBBTH
FSBSAF   EQU   FSBCID
FSBDAF   EQU   FSBCID+2
FSBRQTAG EQU   FSBBTH+4
FSBSEQID EQU   FSBRQTAG
FSBFLAGS EQU   FSBSEQID
FSBNONCB EQU   FSBFLAGS
FSBSEQ   EQU   FSBSEQID+1
FSBCSWST EQU   FSBBTH+6
FSBTHFLD EQU   FSBCSWST
FSBTH1   EQU   FSBTHFLD
FSBSYSRS EQU   FSBTH1
FSBSPHSE EQU   FSBSYSRS
FSBTH2   EQU   FSBTHFLD+1
FSBEXTRS EQU   FSBTH2
FSBXFSTS EQU   FSBEXTRS
FSBXCODE EQU   FSBEXTRS
FSBXFINS EQU   FSBXCODE
FSBNETRS EQU   FSBFSB+16
FSBSRCAT EQU   FSBNETRS
FSBMJRCD EQU   FSBSRCAT
FSBERC   EQU   FSBNETRS+1
FSBFBMI  EQU   FSBERC
FSBDMGRS EQU   FSBFSB+18
FSBSS1   EQU   FSBDMGRS
FSBSS2   EQU   FSBDMGRS+1
FSBLCPB  EQU   FSBFSB+20
FSBMSGID EQU   FSBLCPB
FSBLCCWA EQU   FSBFSB+24
FSBRLSTS EQU   FSBLCCWA
FSBTHCNT EQU   FSBFSB+28
ISTLH    EQU   0
ISTTH    EQU   0
THFLAG1  EQU   ISTTH
THFID    EQU   THFLAG1
THFLGA   EQU   THFLAG1
THMPF    EQU   THFLGA
THRHI    EQU   THMPF
THFLGB   EQU   THFLAG1+1
THDAF    EQU   ISTTH+2
THOAF    EQU   ISTTH+4
THDCF    EQU   ISTTH+8
ISTTH2   EQU   0
TH2FLAG1 EQU   ISTTH2
TH2MPF   EQU   TH2FLAG1
ISTZIBUF EQU   0
ZIBCHAIN EQU   ISTZIBUF
ZIBFSM   EQU   ISTZIBUF+4
ISTZOBUF EQU   0
ZOBFSM   EQU   ISTZOBUF+4
ISTCCW   EQU   0
CCWVADDR EQU   ISTCCW
CCWCODE  EQU   CCWVADDR
CCWFLAGS EQU   ISTCCW+4
CCWSPARE EQU   ISTCCW+5
ISTCSW   EQU   0
CSWCCWA  EQU   ISTCSW+1
CSWSTAT  EQU   ISTCSW+4
CSWUSTAT EQU   CSWSTAT
CSWATTN  EQU   CSWUSTAT
CSWUE    EQU   CSWUSTAT
CSWCSTAT EQU   CSWSTAT+1
ISTZFSVT EQU   0
ZFSZEFBB EQU   ISTZFSVT
ZFSZEABB EQU   ZFSZEFBB
ZFSZEFAB EQU   ISTZFSVT+4
ZFSZEAAB EQU   ZFSZEFAB
ZFSZEMAB EQU   ZFSZEAAB
ZFSZFFCB EQU   ISTZFSVT+8
ISTRH    EQU   0
RHFLAGS  EQU   ISTRH
RH1      EQU   RHFLAGS
RH2      EQU   RHFLAGS+1
RHRETRY  EQU   RH2
RHRSVD1  EQU   RH2
RH3      EQU   RHFLAGS+2
ISTNIR   EQU   0
NIRRH    EQU   ISTNIR
NIRRU    EQU   ISTNIR+3
ISTPIU   EQU   0
PIUTH    EQU   ISTPIU
PIUNIR   EQU   ISTPIU+10
ISTSRU   EQU   0
SRUTYPE  EQU   ISTSRU+1
SRULDID  EQU   ISTSRU+2
SRUSPSN  EQU   SRULDID
ISTZFSAV EQU   0
ISTZ19SV EQU   0
ZSAF19FG EQU   ISTZ19SV
ISTZFAVT EQU   0
ZFAZFF4B EQU   ISTZFAVT+4
IEAVTRV  EQU   0
ISTSDCCN EQU   0
ISTAPC37 EQU   0
FMZL0029 EQU   0
FMZL0045 EQU   0
ISTAPC34 EQU   0
ISTSDCCA EQU   0
ISTSDCCD EQU   0
ISTSDCCF EQU   0
ISTSDCCR EQU   0
UCBBGN   EQU   0
ZIBSRB   EQU   0
IOSATTSC EQU   IOSIPIB
IOSWTOWA EQU   IOSIPIB
IOSPCISC EQU   IOSIPIB
PSARSVTE EQU   PSARSVT
UCBOBS01 EQU   UCBDEV
UCBSTAB  EQU   UCBOBS01+10
UCBBSVL  EQU   UCBSTAB
UCBPRSRS EQU   UCBSTAB
UCBDMCT  EQU   UCBOBS01+11
UCBFL4   EQU   UCBOBS01+13
UCBOBS02 EQU   UCBDEV
UCBTFL1  EQU   UCBOBS02+19
UCBXTN   EQU   UCBOBS02+20
UCBVOPT  EQU   UCBXTN
UCBOBS03 EQU   UCBDEV
UCBXTADR EQU   UCBOBS03
UCBOBS04 EQU   UCBDEV
UCBBTA   EQU   UCBOBS04+12
UCBOBS06 EQU   UCBDEV
UCBAOF   EQU   UCBOBS06
UCBAOF1  EQU   UCBAOF
UCBAOF2  EQU   UCBAOF+1
@NM00036 EQU   UCBOBS06+3
UCBIRB   EQU   UCBOBS06+4
UCBGRAF  EQU   UCBIRB
UCBLDNCA EQU   UCBOBS06+8
UCBRDYQ  EQU   UCBLDNCA
UCBIRLN  EQU   UCBRDYQ
UCBLDNCB EQU   UCBRDYQ+1
UCBCTLNK EQU   UCBOBS06+12
UCBOBS07 EQU   UCBDEV
UCBICNCB EQU   UCBOBS07+4
UCBOBS08 EQU   UCBDEV
UCBCTCAD EQU   UCBOBS08
UCBCTCF1 EQU   UCBOBS08+4
UCBOBS09 EQU   UCBDEV
CVTS01   EQU   CVTPGSIA
CVTLPDIA EQU   CVTS01+12
CVTDIRST EQU   CVTLPDIA
CVTSLIDA EQU   CVTS01+24
CVTCTLFG EQU   CVTS01+50
CVTRV210 EQU   CVTS01+424
CVTRV219 EQU   CVTS01+425
CVTRV228 EQU   CVTS01+426
CVTRV237 EQU   CVTS01+427
CVTMFRTR EQU   CVTS01+452
CVTRV262 EQU   CVTS01+468
CVTRV271 EQU   CVTS01+469
CVTRV280 EQU   CVTS01+470
CVTRV289 EQU   CVTS01+471
CVTGSDA  EQU   CVTS01+600
FSBCOMBN EQU   FSBNETRS
FSBRHFLD EQU   FSBCOMBN+1
FSBRH3   EQU   FSBRHFLD+2
FSBLDFLG EQU   FSBRH3
@NM00072 EQU   FSBRQTAG
ZIBDIO   EQU   ZIBFSM
ZIBCCW2  EQU   ZIBDIO+8
ZIBCPTCC EQU   ZIBCCW2
ZIBAIO   EQU   ISTZIBUF
ZIBAIOCM EQU   ZIBAIO
ZIBFDBZ  EQU   ZIBAIOCM
ZIBLNG2  EQU   ZIBAIOCM+14
ZIBFIB   EQU   ZIBAIO+16
ZIBFSB   EQU   ZIBFIB
ZIBMDREC EQU   ZIBFSB+4
ZIBMDRIN EQU   ZIBFSB+28
ZIBBTU   EQU   ZIBFIB+32
@NM00076 EQU   ZIBBTU+12
ZIBFID1  EQU   @NM00076+1
ZIBTEXT1 EQU   ZIBFIB+52
ZIBFITXT EQU   ZIBFID1
ZIBSIB   EQU   ZIBFIB
ZIBTEXT  EQU   ZIBSIB+4
ZIBREC   EQU   ZIBMDRIN
ZIBRECPL EQU   ZIBREC
ZIBRECHD EQU   ZIBRECPL
ZIBRECRS EQU   ZIBREC+8
ZIBRECDT EQU   ZIBREC+10
ZIBMDRRC EQU   ZIBMDREC
ZIBRCPL  EQU   ZIBMDRRC
ZIBRCDT  EQU   ZIBMDRRC+24
@NM00078 EQU   ZIBBTU
ZOBDLBT  EQU   ISTZOBUF
ZOBDLBCM EQU   ZOBDLBT
@NM00079 EQU   ZOBDLBCM+25
ZOBBTU   EQU   ZOBDLBT+28
ZOBWCC   EQU   ZOBDLBT+48
ZOBECCC  EQU   ZOBDLBT+50
ZOBDIO   EQU   ZOBFSM
ZOBCCW2  EQU   ZOBDIO+8
ZOBCPTCC EQU   ZOBCCW2
ZOBFLAGS EQU   ZOBCCW2+5
ZOBCCW3  EQU   ZOBDIO+16
ZOBCPTRC EQU   ZOBCCW3
ZOBCPN2C EQU   ZOBCPTRC
ZOBCPTRA EQU   ZOBCCW3+1
@NM00083 EQU   ZOBBTU
SRUSENSE EQU   ISTSRU
SRURMS   EQU   ISTSRU
SRUZIB   EQU   ISTSRU
SRUNETS  EQU   SRUZIB
ISTUNBRU EQU   SRUTYPE
SMNOPFF  EQU   ICNZD006+4
SMNOPCC  EQU   SMNOPFF
@NM00088 EQU   ICNZV005
ICNZV524 EQU   @NM00088+1
CMZCIDM  EQU   ATCCIDM
FLC      EQU   PSA
SRB      EQU   SRBSECT
ZOBTEXT  EQU   ZOBBTU
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS
@NM00089 EQU   @NM00088
@NM00087 EQU   SMNOPFF
@NM00086 EQU   SMNOPFF
UNBTYPE  EQU   ISTUNBRU
SRUNAF   EQU   SRUZIB+3
SRUNSREQ EQU   SRUNETS+2
SRUNSUBC EQU   SRUNETS+1
SRUNSCAT EQU   SRUNETS
SRUREQRE EQU   SRURMS+2
SRUPFX2  EQU   SRURMS+1
SRUPFX1  EQU   SRURMS
SRUSENS2 EQU   SRUSENSE+2
SRUSNS2  EQU   SRUSENSE+1
SRUSNS1  EQU   SRUSENSE
ZOBTH2   EQU   @NM00083+4
ZOBLH    EQU   @NM00083
ZOBCPN2K EQU   ZOBCCW3+6
ZOBRSV99 EQU   ZOBCCW3+5
ZOBCPN2F EQU   ZOBCCW3+4
ZOBCPTC2 EQU   ZOBCPTRA
ZOBCPTC1 EQU   ZOBCPN2C
ZOBCPNPK EQU   ZOBCCW2+6
ZOBRSV03 EQU   ZOBFLAGS
ZOBRT08  EQU   ZOBFLAGS
ZOBRT06  EQU   ZOBFLAGS
ZOBCPNPF EQU   ZOBCCW2+4
ZOBCPTCA EQU   ZOBCCW2+1
ZOBCPNPC EQU   ZOBCPTCC
ZOBCPWTK EQU   ZOBDIO+6
ZOBRSV02 EQU   ZOBDIO+5
ZOBCPWTF EQU   ZOBDIO+4
ZOBCPTXA EQU   ZOBDIO+1
ZOBCPWTC EQU   ZOBDIO
ZOBRSV09 EQU   ZOBECCC
ZOBECSP  EQU   ZOBECCC
ZOBRSV08 EQU   ZOBECCC
ZOBRSV07 EQU   ZOBDLBT+49
ZOBRSV06 EQU   ZOBWCC
ZOBWCSP  EQU   ZOBWCC
ZOBRSV05 EQU   ZOBWCC
ZOBRSV10 EQU   ZOBDLBCM+26
@NM00082 EQU   @NM00079
@NM00081 EQU   @NM00079
@NM00080 EQU   @NM00079
ZOBRSV04 EQU   ZOBDLBCM+16
ZOBLNG2  EQU   ZOBDLBCM+14
ZOBRSV01 EQU   ZOBDLBCM+12
ZOBFDB   EQU   ZOBDLBCM
ZIBTH2   EQU   @NM00078+4
ZIBLH    EQU   @NM00078
ZIBRCTXT EQU   ZIBMDRRC+36
ZIBRCRID EQU   ZIBRCDT+10
ZIBRCNAM EQU   ZIBRCDT+2
ZIBRCUA  EQU   ZIBRCDT
ZIBRCPUI EQU   ZIBRCPL+20
ZIBRCPUN EQU   ZIBRCPL+16
ZIBRCTIM EQU   ZIBRCPL+12
ZIBRCDAT EQU   ZIBRCPL+8
ZIBRCRS1 EQU   ZIBRCPL+6
ZIBRCSID EQU   ZIBRCPL+5
ZIBRCID  EQU   ZIBRCPL+4
ZIBRCSW  EQU   ZIBRCPL+2
ZIBRCSYR EQU   ZIBRCPL+1
ZIBRCL   EQU   ZIBRCPL
ZIBRECTX EQU   ZIBREC+22
ZIBRECID EQU   ZIBRECDT+10
ZIBRECNA EQU   ZIBRECDT+2
ZIBRECUA EQU   ZIBRECDT
ZIBRECSV EQU   ZIBRECRS
ZIBRECDA EQU   ZIBRECPL+4
ZIBRECSI EQU   ZIBRECHD+3
ZIBRECDV EQU   ZIBRECHD+2
ZIBRECFL EQU   ZIBRECHD+1
ZIBRECTY EQU   ZIBRECHD
ZIBRSV04 EQU   ZIBSIB
ZIBTEXT2 EQU   ZIBFITXT
@NM00077 EQU   @NM00076
ZIBFDBS  EQU   ZIBBTU
@NM00075 EQU   ZIBMDREC
@NM00074 EQU   ZIBFSB
ZIBRSV03 EQU   ZIBAIOCM+13
ZIBWKBYT EQU   ZIBAIOCM+12
ZIBCPNPK EQU   ZIBCCW2+6
ZIBRSV02 EQU   ZIBCCW2+5
ZIBCPTPF EQU   ZIBCCW2+4
ZIBCPTCA EQU   ZIBCCW2+1
ZIBCPNPC EQU   ZIBCPTCC
ZIBCPRDK EQU   ZIBDIO+6
ZIBRSV01 EQU   ZIBDIO+5
ZIBCPRDF EQU   ZIBDIO+4
ZIBCPTXA EQU   ZIBDIO+1
ZIBCPRDC EQU   ZIBDIO
FSBRT0B  EQU   @NM00072+1
FSBRT0A  EQU   @NM00072+1
FSBRT09  EQU   @NM00072+1
FSBRT08  EQU   @NM00072+1
FSBRT07  EQU   @NM00072
FSBRT06  EQU   @NM00072
FSBRT05  EQU   @NM00072
FSBRT04  EQU   @NM00072
FSBRT03  EQU   @NM00072
FSBRT02  EQU   @NM00072
FSBRT01  EQU   @NM00072
FSBRT00  EQU   @NM00072
FSBLDCUF EQU   FSBLDFLG
FSBLDSIF EQU   FSBLDFLG
FSBLDSOF EQU   FSBLDFLG
FSBLDEBF EQU   FSBLDFLG
FSBLDBBF EQU   FSBLDFLG
FSBLDFME EQU   FSBLDFLG
FSBLDSCF EQU   FSBLDFLG
FSBLDRMF EQU   FSBLDFLG
FSBRH2   EQU   FSBRHFLD+1
FSBRH1   EQU   FSBRHFLD
FSBALIGN EQU   FSBCOMBN
CVTRV628 EQU   CVTS01+728
CVTRV627 EQU   CVTS01+724
CVTRV626 EQU   CVTS01+720
CVTRV625 EQU   CVTS01+716
CVTRV624 EQU   CVTS01+712
CVTRV623 EQU   CVTS01+708
CVTRV622 EQU   CVTS01+704
CVTRV621 EQU   CVTS01+700
CVTRV620 EQU   CVTS01+696
CVTRV619 EQU   CVTS01+692
CVTRV618 EQU   CVTS01+688
CVTRV617 EQU   CVTS01+684
CVTRV616 EQU   CVTS01+680
CVTRV615 EQU   CVTS01+676
CVTRV614 EQU   CVTS01+672
CVTRV613 EQU   CVTS01+668
CVTTCASP EQU   CVTS01+664
CVT0PT03 EQU   CVTS01+660
CVT0PT0E EQU   CVTS01+656
CVTIRM   EQU   CVTS01+652
CVTCGK   EQU   CVTS01+648
CVTRV607 EQU   CVTS01+644
CVTRV606 EQU   CVTS01+640
CVTRV605 EQU   CVTS01+636
CVTRV604 EQU   CVTS01+632
CVTEFF02 EQU   CVTS01+628
CVTCBBR  EQU   CVTS01+624
CVTSSCR  EQU   CVTS01+620
CVTEVENT EQU   CVTS01+616
CVTCRCA  EQU   CVTS01+612
CVTTPIO  EQU   CVTS01+608
CVTADV   EQU   CVTS01+604
CVTGSDAB EQU   CVTGSDA
CVTQV3   EQU   CVTS01+596
CVTQV2   EQU   CVTS01+592
CVTQV1   EQU   CVTS01+588
CVTRPT   EQU   CVTS01+584
CVTSSRB  EQU   CVTS01+580
CVTCSDRL EQU   CVTS01+576
CVTEXP1  EQU   CVTS01+572
CVTRMPMT EQU   CVTS01+568
CVTRMPTT EQU   CVTS01+564
CVTVPSA  EQU   CVTS01+560
CVTVSTOP EQU   CVTS01+556
CVTGTFR8 EQU   CVTS01+552
CVTQUIT  EQU   CVTS01+548
CVTVACR  EQU   CVTS01+544
CVTWTCB  EQU   CVTS01+540
CVTSTPRS EQU   CVTS01+536
CVT0PT02 EQU   CVTS01+532
CVTDARCM EQU   CVTS01+528
CVTIRECM EQU   CVTS01+524
CVTJRECM EQU   CVTS01+520
CVTVEMS0 EQU   CVTS01+516
CVTSPFRR EQU   CVTS01+512
CVTRLSTG EQU   CVTS01+508
CVT0TC0A EQU   CVTS01+504
CVTGMBR  EQU   CVTS01+500
CVTLFRM  EQU   CVTS01+496
CVTRMBR  EQU   CVTS01+492
CVTVIOP  EQU   CVTS01+488
CVTRV307 EQU   CVTS01+486
CVTRV306 EQU   CVTS01+484
CVTRV305 EQU   CVTS01+482
CVTRV304 EQU   CVTS01+480
CVTRV303 EQU   CVTS01+478
CVTRV302 EQU   CVTS01+476
CVTTRCA  EQU   CVTS01+472
CVTRV297 EQU   CVTRV289
CVTRV296 EQU   CVTRV289
CVTRV295 EQU   CVTRV289
CVTRV294 EQU   CVTRV289
CVTRV293 EQU   CVTRV289
CVTRV292 EQU   CVTRV289
CVTRV291 EQU   CVTRV289
CVTRV290 EQU   CVTRV289
CVTRV288 EQU   CVTRV280
CVTRV287 EQU   CVTRV280
CVTRV286 EQU   CVTRV280
CVTRV285 EQU   CVTRV280
CVTRV284 EQU   CVTRV280
CVTRV283 EQU   CVTRV280
CVTRV282 EQU   CVTRV280
CVTRV281 EQU   CVTRV280
CVTRV279 EQU   CVTRV271
CVTRV278 EQU   CVTRV271
CVTRV277 EQU   CVTRV271
CVTRV276 EQU   CVTRV271
CVTRV275 EQU   CVTRV271
CVTRV274 EQU   CVTRV271
CVTRV273 EQU   CVTRV271
CVTRV272 EQU   CVTRV271
CVTRV270 EQU   CVTRV262
CVTRV269 EQU   CVTRV262
CVTRV268 EQU   CVTRV262
CVTRV267 EQU   CVTRV262
CVTRV266 EQU   CVTRV262
CVTRV265 EQU   CVTRV262
CVTRV264 EQU   CVTRV262
CVTRV263 EQU   CVTRV262
CVTVFP   EQU   CVTS01+464
CVTVSI   EQU   CVTS01+460
CVTVPSIB EQU   CVTS01+456
CVTMFACT EQU   CVTMFRTR
CVTMFCTL EQU   CVTS01+448
CVTPVBP  EQU   CVTS01+444
CVTPWI   EQU   CVTS01+440
CVTRV254 EQU   CVTS01+438
CVTRV253 EQU   CVTS01+436
CVTRV252 EQU   CVTS01+434
CVTRV251 EQU   CVTS01+433
CVTRV250 EQU   CVTS01+432
CVTRV249 EQU   CVTS01+431
CVTRV248 EQU   CVTS01+430
CVTRV247 EQU   CVTS01+429
CVTRV246 EQU   CVTS01+428
CVTRV245 EQU   CVTRV237
CVTRV244 EQU   CVTRV237
CVTRV243 EQU   CVTRV237
CVTRV242 EQU   CVTRV237
CVTRV241 EQU   CVTRV237
CVTRV240 EQU   CVTRV237
CVTRV239 EQU   CVTRV237
CVTRV238 EQU   CVTRV237
CVTRV236 EQU   CVTRV228
CVTRV235 EQU   CVTRV228
CVTRV234 EQU   CVTRV228
CVTRV233 EQU   CVTRV228
CVTRV232 EQU   CVTRV228
CVTRV231 EQU   CVTRV228
CVTRV230 EQU   CVTRV228
CVTRV229 EQU   CVTRV228
CVTRV227 EQU   CVTRV219
CVTRV226 EQU   CVTRV219
CVTRV225 EQU   CVTRV219
CVTRV224 EQU   CVTRV219
CVTRV223 EQU   CVTRV219
CVTRV222 EQU   CVTRV219
CVTRV221 EQU   CVTRV219
CVTRV220 EQU   CVTRV219
CVTRV218 EQU   CVTRV210
CVTRV217 EQU   CVTRV210
CVTRV216 EQU   CVTRV210
CVTRV215 EQU   CVTRV210
CVTRV214 EQU   CVTRV210
CVTRV213 EQU   CVTRV210
CVTRV212 EQU   CVTRV210
CVTRV211 EQU   CVTRV210
CVTLCCAT EQU   CVTS01+420
CVTPCCAT EQU   CVTS01+416
CVTIPCRP EQU   CVTS01+412
CVTIPCRI EQU   CVTS01+408
CVTIPCDS EQU   CVTS01+404
CVTAIDVT EQU   CVTS01+400
CVTSSAP  EQU   CVTS01+396
CVTEHCIR EQU   CVTS01+392
CVTEHDEF EQU   CVTS01+388
CVTDAIR  EQU   CVTS01+384
CVTPERFM EQU   CVTS01+380
CVT044R2 EQU   CVTS01+376
CVTFETCH EQU   CVTS01+372
CVTRSTWD EQU   CVTS01+368
CVTSPOST EQU   CVTS01+364
CVTIOBP  EQU   CVTS01+360
CVTASMVT EQU   CVTS01+356
CVTRECRQ EQU   CVTS01+352
CVTWSAC  EQU   CVTS01+348
CVTRV149 EQU   CVTS01+344
CVTWSAL  EQU   CVTS01+340
CVTSPSA  EQU   CVTS01+336
CVTGLMN  EQU   CVTS01+332
CVTVEAC0 EQU   CVTS01+328
CVT062R1 EQU   CVTS01+324
CVTRPOST EQU   CVTS01+320
CVTDQIQE EQU   CVTS01+316
CVTCSD   EQU   CVTS01+312
CVTLKRMA EQU   CVTS01+308
CVTRSPIE EQU   CVTS01+304
CVTRENQ  EQU   CVTS01+300
CVTLQCB  EQU   CVTS01+296
CVTFQCB  EQU   CVTS01+292
CVTQCS01 EQU   CVTS01+288
CVTAPFT  EQU   CVTS01+284
CVTPARRL EQU   CVTS01+280
CVTVWAIT EQU   CVTS01+276
CVTGSPL  EQU   CVTS01+272
CVTLSMQ  EQU   CVTS01+268
CVTGSMQ  EQU   CVTS01+264
CVTEXPRO EQU   CVTS01+260
CVTOPCTP EQU   CVTS01+256
CVTSIC   EQU   CVTS01+252
CVTTPIOS EQU   CVTS01+248
CVTRTMS  EQU   CVTS01+244
CVTSDBF  EQU   CVTS01+240
CVTSCBP  EQU   CVTS01+236
CVTSDMP  EQU   CVTS01+232
CVTSV60  EQU   CVTS01+228
CVTRTMCT EQU   CVTS01+224
CVTASCBL EQU   CVTS01+220
CVTASCBH EQU   CVTS01+216
CVTGDA   EQU   CVTS01+212
CVTASVT  EQU   CVTS01+208
CVTVVMDI EQU   CVTS01+204
CVTAQTOP EQU   CVTS01+200
CVTIOSCS EQU   CVTS01+196
CVTSDRM  EQU   CVTS01+192
CVTOPTE  EQU   CVTS01+188
CVTSTXU  EQU   CVTS01+184
CVTQUIS  EQU   CVTS01+180
CVTPARS  EQU   CVTS01+176
CVTS1EE  EQU   CVTS01+172
CVTFRAS  EQU   CVTS01+168
CVTQSAS  EQU   CVTS01+164
CVTCRAS  EQU   CVTS01+160
CVTCRMN  EQU   CVTS01+156
CVTDELCP EQU   CVTS01+152
CVTFRECL EQU   CVTS01+148
CVTGETCL EQU   CVTS01+144
CVTBLDCP EQU   CVTS01+140
CVTAUTHL EQU   CVTS01+136
CVTSCAN  EQU   CVTS01+132
CVTRV144 EQU   CVTS01+130
CVTMAXMP EQU   CVTS01+128
CVTSTCK  EQU   CVTS01+124
CVTRV139 EQU   CVTS01+123
CVTDSSAC EQU   CVTS01+122
CVTRV513 EQU   CVTS01+121
CVTIOSPL EQU   CVTS01+120
CVTPTGT  EQU   CVTS01+116
CVTCSPIE EQU   CVTS01+112
CVTSMFEX EQU   CVTS01+108
CVTOLT0A EQU   CVTS01+104
CVTSRBRT EQU   CVTS01+100
CVTPUTL  EQU   CVTS01+96
CVTASCRL EQU   CVTS01+92
CVTASCRF EQU   CVTS01+88
CVTRV326 EQU   CVTS01+84
CVTRV325 EQU   CVTS01+80
CVTRV324 EQU   CVTS01+76
CVT0VL01 EQU   CVTS01+72
CVTSHRVM EQU   CVTS01+68
CVTRV332 EQU   CVTS01+64
CVTTAS   EQU   CVTS01+60
CVTRSCN  EQU   CVTS01+56
CVTTRAC2 EQU   CVTS01+54
CVTTRACE EQU   CVTS01+52
CVTAPG   EQU   CVTS01+51
CVTSDTRC EQU   CVTCTLFG
CVTGTRCE EQU   CVTCTLFG
CVTNOMP  EQU   CVTCTLFG
CVTRSV79 EQU   CVTCTLFG
CVTDSTAT EQU   CVTCTLFG
CVTRSV78 EQU   CVTCTLFG
CVTRV333 EQU   CVTCTLFG
CVTRV323 EQU   CVTCTLFG
CVTSPVLK EQU   CVTS01+49
CVTRSV77 EQU   CVTS01+48
CVTRV331 EQU   CVTS01+44
CVTRV330 EQU   CVTS01+40
CVTRV329 EQU   CVTS01+36
CVTRV328 EQU   CVTS01+32
CVTRV322 EQU   CVTS01+28
CVTSLID  EQU   CVTSLIDA+1
CVTSYLK  EQU   CVTSLIDA
CVTRV321 EQU   CVTS01+20
CVTRV320 EQU   CVTS01+16
CVTLPDIR EQU   CVTLPDIA+1
CVTRSV69 EQU   CVTDIRST
CVTRSV68 EQU   CVTDIRST
CVTRSV67 EQU   CVTDIRST
CVTRSV66 EQU   CVTDIRST
CVTRSV65 EQU   CVTDIRST
CVTRSV64 EQU   CVTDIRST
CVTRSV63 EQU   CVTDIRST
CVTDICOM EQU   CVTDIRST
CVTPVTP  EQU   CVTS01+8
CVTLPDSR EQU   CVTS01+4
CVTGETL  EQU   CVTS01
UCBRV066 EQU   UCBOBS09+4
UCBIOSBA EQU   UCBOBS09
UCBRV042 EQU   UCBOBS08+5
UCBRV082 EQU   UCBCTCF1
UCBRV081 EQU   UCBCTCF1
UCBRV080 EQU   UCBCTCF1
UCBRV079 EQU   UCBCTCF1
UCBRV078 EQU   UCBCTCF1
UCBRV077 EQU   UCBCTCF1
UCBRV076 EQU   UCBCTCF1
UCBCTC80 EQU   UCBCTCF1
UCBCTCAL EQU   UCBCTCAD
UCBRV040 EQU   UCBOBS07
UCBCTLNA EQU   UCBCTLNK+1
UCBRLN   EQU   UCBCTLNK
UCBRDYQA EQU   UCBLDNCB
UCBINRLN EQU   UCBIRLN
UCBIRBA  EQU   UCBIRB+1
UCBRV039 EQU   UCBGRAF
UCBDWNR  EQU   UCBGRAF
UCBRPND  EQU   UCBGRAF
UCBUPM   EQU   UCBGRAF
UCBBTAM  EQU   UCBGRAF
UCBDRNO  EQU   UCBGRAF
UCBDRO   EQU   UCBGRAF
UCBOIP   EQU   UCBGRAF
UCBATRCD EQU   @NM00036
UCBSKPFG EQU   @NM00036
UCBRIPND EQU   @NM00036
UCBRTIAC EQU   @NM00036
UCBRSV79 EQU   @NM00036
UCBRSV78 EQU   @NM00036
UCBRSV77 EQU   @NM00036
UCBOLTEP EQU   @NM00036
UCBATNCT EQU   UCBOBS06+2
UCBRSV76 EQU   UCBAOF2
UCBRSV75 EQU   UCBAOF2
UCBRSV74 EQU   UCBAOF2
UCBRSV73 EQU   UCBAOF2
UCBRSV72 EQU   UCBAOF2
UCBRSV71 EQU   UCBAOF2
UCBRSV70 EQU   UCBAOF2
UCBRSV69 EQU   UCBAOF2
UCBRSV68 EQU   UCBAOF1
UCBRSV67 EQU   UCBAOF1
UCBRSV66 EQU   UCBAOF1
UCBRSV65 EQU   UCBAOF1
UCBRSV64 EQU   UCBAOF1
UCBOFNL  EQU   UCBAOF1
UCBOFSP  EQU   UCBAOF1
UCBOFMCR EQU   UCBAOF1
UCBBTB   EQU   UCBBTA+1
UCBDI    EQU   UCBBTA
UCBSNS   EQU   UCBOBS04+8
UCBTEB   EQU   UCBOBS04+4
UCBGCB   EQU   UCBOBS04+3
UCBOPEN  EQU   UCBOBS04+2
UCBSTART EQU   UCBOBS04
UCBXTNB  EQU   UCBXTN+1
UCBRSV22 EQU   UCBVOPT
UCBRSV21 EQU   UCBVOPT
UCBRSV20 EQU   UCBVOPT
UCBESVE  EQU   UCBVOPT
UCBERPC  EQU   UCBVOPT
UCBESVC  EQU   UCBVOPT
UCBEVA   EQU   UCBVOPT
UCBESV   EQU   UCBVOPT
UCBRV009 EQU   UCBTFL1
UCBRV008 EQU   UCBTFL1
UCBRV007 EQU   UCBTFL1
UCBRV006 EQU   UCBTFL1
UCBRV005 EQU   UCBTFL1
UCBRV038 EQU   UCBTFL1
UCBNSLTP EQU   UCBTFL1
UCBNLTP  EQU   UCBTFL1
UCBRES1B EQU   UCBOBS02+18
UCBFSER  EQU   UCBOBS02+12
@NM00035 EQU   UCBOBS02+4
UCBFSEQ  EQU   UCBOBS02+2
UCBFSCT  EQU   UCBOBS02
UCBNEXP  EQU   UCBOBS01+20
UCBBASE  EQU   UCBOBS01+16
UCBRES1A EQU   UCBOBS01+15
UCBUSER  EQU   UCBOBS01+14
UCBFL47  EQU   UCBFL4
UCBFL46  EQU   UCBFL4
UCBFL45  EQU   UCBFL4
UCBRV065 EQU   UCBFL4
UCBDSS   EQU   UCBFL4
UCBRV028 EQU   UCBFL4
UCBWDAV  EQU   UCBFL4
UCBDAVV  EQU   UCBFL4
UCBSQC   EQU   UCBOBS01+12
UCBDATP  EQU   UCBOBS01+12
UCBDMC   EQU   UCBDMCT
UCBMOUNT EQU   UCBDMCT
UCBBNUL  EQU   UCBSTAB
UCBSHAR  EQU   UCBSTAB
UCBBSTR  EQU   UCBSTAB
UCBBPUB  EQU   UCBSTAB
UCBBPRV  EQU   UCBSTAB
UCBBALB  EQU   UCBPRSRS
UCBPGFL  EQU   UCBSTAB
UCBDVSHR EQU   UCBBSVL
UCBVOLI  EQU   UCBOBS01+4
UCBVTOC  EQU   UCBOBS01
PSARSAV  EQU   PSARSVTE+60
PSARSTK  EQU   PSARSVTE+56
PSAESAV3 EQU   PSARSVTE+52
PSAESTK3 EQU   PSARSVTE+48
PSAESAV2 EQU   PSARSVTE+44
PSAESTK2 EQU   PSARSVTE+40
PSAESAV1 EQU   PSARSVTE+36
PSAESTK1 EQU   PSARSVTE+32
PSAPSAV  EQU   PSARSVTE+28
PSAPSTK  EQU   PSARSVTE+24
PSAMSAV  EQU   PSARSVTE+20
PSAMSTK  EQU   PSARSVTE+16
PSASSAV  EQU   PSARSVTE+12
PSASSTK  EQU   PSARSVTE+8
PSANSTK  EQU   PSARSVTE+4
PSACSTK  EQU   PSARSVTE
IOSPCIWA EQU   IOSPCISC+44
IOSPCIRS EQU   IOSPCISC+8
@NM00007 EQU   IOSPCISC+4
@NM00006 EQU   IOSPCISC
IOSWRNDR EQU   IOSWTOWA+4
IOSWTOPT EQU   IOSWTOWA+3
IOSWTOCP EQU   IOSWTOWA+2
IOSWTOCH EQU   IOSWTOWA
IOSATTWA EQU   IOSATTSC+40
@NM00005 EQU   IOSATTSC+24
IOSATTSN EQU   IOSATTSC
ZFAZFFAB EQU   ISTZFAVT+8
ZFAZFFDB EQU   ISTZFAVT
ZSAF19IO EQU   ISTZ19SV+12
ZSAF19RD EQU   ISTZ19SV+8
ZSAF19R1 EQU   ISTZ19SV+4
ZSAF19RV EQU   ISTZ19SV+1
ZSAFRSVS EQU   ZSAF19FG
ZSAFLOCK EQU   ZSAF19FG
ZSAFSV19 EQU   ISTZFSAV+40
ZSAFSVR2 EQU   ISTZFSAV+36
ZSAFSVVR EQU   ISTZFSAV+12
ZSAFSVRR EQU   ISTZFSAV+8
ZSAFSVFC EQU   ISTZFSAV+4
ZSAFSVBC EQU   ISTZFSAV
SRURSV01 EQU   SRULDID+4
SRUPSSN  EQU   SRULDID+2
SRUDFCLV EQU   SRUSPSN
@NM00085 EQU   SRUTYPE
SRUPSAC  EQU   SRUTYPE
SRUSPAC  EQU   SRUTYPE
SRUQSREQ EQU   ISTSRU
RHRSVD5  EQU   RH3
RHRSVD4  EQU   RH3
RHLOG    EQU   RH3
RHRSVD3  EQU   RH3
RHRCDIR  EQU   RH3
RHCDIR   EQU   RH3
RHEB     EQU   RH3
RHBB     EQU   RH3
RHPACE   EQU   RH2
RHRSVD2  EQU   RH2
RHINOP   EQU   RHRSVD1
RHBUSY   EQU   RHRETRY
RHEXCEPT EQU   RH2
RHRRN    EQU   RH2
RHPE     EQU   RH2
RHFME    EQU   RH2
RHCHAIN  EQU   RH1
RHSENSE  EQU   RH1
RHFORMAT EQU   RH1
RHDIRI   EQU   RH1
RHSCI    EQU   RH1
RHTYPE   EQU   RH1
RHQS     EQU   RH1
ZFSZWRD4 EQU   ISTZFSVT+36
ZFSZWRD3 EQU   ISTZFSVT+32
ZFSZEFCB EQU   ISTZFSVT+28
ZFSZFFEB EQU   ISTZFSVT+24
ZFSZDFJ0 EQU   ISTZFSVT+20
ZFSZFFFB EQU   ISTZFSVT+16
ZFSZFFDB EQU   ISTZFSVT+12
ZFSZEMBB EQU   ZFSZEABB
CSWRCNT  EQU   ISTCSW+6
CSWCC    EQU   CSWCSTAT
CSWICC   EQU   CSWCSTAT
CSWCCC   EQU   CSWCSTAT
CSWCDC   EQU   CSWCSTAT
CSWPTNC  EQU   CSWCSTAT
CSWPGMC  EQU   CSWCSTAT
CSWIL    EQU   CSWCSTAT
CSWPCI   EQU   CSWCSTAT
CSWUC    EQU   CSWUSTAT
CSWDE    EQU   CSWUSTAT
CSWCE    EQU   CSWUSTAT
CSWBUSY  EQU   CSWUSTAT
CSWCUE   EQU   CSWUSTAT
CSWSM    EQU   CSWUSTAT
@NM00084 EQU   ISTCSW
CSWKEY   EQU   ISTCSW
CCWCOUNT EQU   ISTCCW+6
CCWSPRSV EQU   CCWSPARE
CCWCFTX  EQU   CCWSPARE
CCWTRCE  EQU   CCWSPARE
CCWNULL  EQU   CCWFLAGS
CCWPCI   EQU   CCWFLAGS
CCWSKIP  EQU   CCWFLAGS
CCWSLI   EQU   CCWFLAGS
CCWCC    EQU   CCWFLAGS
CCWCD    EQU   CCWFLAGS
CCWADDR  EQU   CCWVADDR+1
ZOBLNG1  EQU   ZOBFSM
ZOBCHAIN EQU   ISTZOBUF
ZIBLNG1  EQU   ZIBFSM
TH2SNF   EQU   ISTTH2+4
TH2OAF   EQU   ISTTH2+3
TH2DAF   EQU   ISTTH2+2
TH2CDF   EQU   TH2FLAG1+1
TH2SEF   EQU   TH2FLAG1+1
TH2PYF   EQU   TH2FLAG1+1
TH2AFI   EQU   TH2FLAG1
TH2PSI   EQU   TH2FLAG1
TH2CMPLI EQU   TH2MPF
TH2RHI   EQU   TH2MPF
TH2FID   EQU   TH2FLAG1
THSNF    EQU   ISTTH+6
THCDF    EQU   THFLGB
THSEF    EQU   THFLGB
THPYF    EQU   THFLGB
THAFI    EQU   THFLGA
THPSI    EQU   THFLGA
THCMPLI  EQU   THMPF
LHVDATA  EQU   ISTLH+4
LHFUNCT  EQU   ISTLH+3
@NM00073 EQU   ISTLH+2
LHLEN    EQU   ISTLH
FSBFDB   EQU   ISTFSB+32
FSBRSV01 EQU   FSBFSB+30
FSBRLRSV EQU   FSBRLSTS
FSBCFTX  EQU   FSBRLSTS
FSBICNCB EQU   FSBMSGID
FSBSSOC  EQU   FSBSS2
FSBSSCC  EQU   FSBSS2
FSBSSDC  EQU   FSBSS2
FSBSSEC  EQU   FSBSS2
FSBSSIR  EQU   FSBSS2
FSBSSCR  EQU   FSBSS2
@NM00071 EQU   FSBSS2
@NM00070 EQU   FSBSS1
FSBSSDE  EQU   FSBSS1
FSBSSUS  EQU   FSBSS1
@NM00069 EQU   FSBSS1
FSBSOHI  EQU   FSBERC
FSBLGI   EQU   FSBERC
FSBLMRI  EQU   FSBFBMI
FSBETI   EQU   FSBERC
FSBEMI   EQU   FSBERC
FSBEBI   EQU   FSBERC
FSBECI   EQU   FSBERC
FSBELI   EQU   FSBERC
FSBXLCI  EQU   FSBXCODE
FSBXNORM EQU   FSBXFSTS
FSBSCODE EQU   FSBSYSRS
FSBSERR  EQU   FSBSYSRS
FSBCMD   EQU   FSBSEQ
FSBDTRCE EQU   FSBFLAGS
FSBASBTU EQU   FSBFLAGS
FSBINPET EQU   FSBFLAGS
FSBLBIND EQU   FSBFLAGS
FSBFFIND EQU   FSBFLAGS
FSBACIND EQU   FSBFLAGS
FSBRFIND EQU   FSBFLAGS
FSBGATE  EQU   FSBFSBA
FSBLATOP EQU   FSBSFLGS
FSBRSV02 EQU   FSBSFLGS
FSBPGBUF EQU   FSBSFLGS
FSBMNSDA EQU   FSBMNRCD
FSBMNOA  EQU   FSBMNRCD
FSBMNDIF EQU   FSBMNRCD
FSBMNEOP EQU   FSBMNRCD
FSBMNATN EQU   FSBMNRCD
FSBMNRVI EQU   FSBMNRCD
FSBMNELI EQU   FSBMNRCD
FDBFDBA  EQU   ISTFDB
BTUTEXT  EQU   ISTBTU+20
BTURSV02 EQU   BTUSYSTR
BTUPHASE EQU   BTUSYSTR
BTURSV01 EQU   BTUSYSTR
BTUPAD   EQU   BTURH+3
BTURH3   EQU   BTURH+2
BTURH2   EQU   BTURH+1
BTURH1   EQU   BTURH
BTUZRTSC EQU   BTURQFLG+1
BTUZRT0B EQU   BTURQFLG+1
BTUZRT0A EQU   BTURQFLG+1
BTUZRT09 EQU   BTURQFLG+1
BTUZRT08 EQU   BTURQFLG+1
BTUZRT07 EQU   BTURQFLG
BTUZRT06 EQU   BTURQFLG
BTUZRT04 EQU   BTURQFLG
BTUZRT03 EQU   BTURQFLG
BTUZRT02 EQU   BTURQFLG
BTUZRT01 EQU   BTURQFLG
BTUZRT00 EQU   BTURQFLG
BTUCDF   EQU   BTUFID+1
BTUSCF   EQU   BTUFID+1
BTUPRY   EQU   BTUFID+1
BTUASFL  EQU   BTUFID
BTUPSFL  EQU   BTUFID
BTUMPF   EQU   BTUFID
BTUFIDNO EQU   BTUFID
BDURSV04 EQU   BDUFLAGS
BDURTOE  EQU   BDUFLAGS
BDUSTPR  EQU   BDUFLAGS
BDURSV03 EQU   BDUFLAGS
BDUALT   EQU   BDUFUNC
BDUNACK  EQU   BDUFUNC
BDUACK   EQU   BDUFUNC
BDUTRPM  EQU   BDUFUNC
BDUFBMI  EQU   BDUFUNC
BDULDGPH EQU   BDUFUNC
BDUHEADP EQU   BDUFUNC
BDUSOH   EQU   BDUCHECK
BDURSV01 EQU   BDUMODIF
BDUMOD0  EQU   BDUMOD1
BDUCOMND EQU   ISTBDU
ATCAOS   EQU   ISTATCVT+1584
ATCPOPAB EQU   ATCAOSM+640
ATCVIOPM EQU   ATCAOSM+636
ATCTPMMI EQU   ATCAOSM+632
ATCTPMPB EQU   ATCAOSM+600
ATCRSV88 EQU   ATCAOSM+596
ATCRPLCT EQU   ATCAOSM+594
ATCCRACT EQU   ATCAOSM+592
ATCSRBCT EQU   ATCAOSM+590
ATCRSV75 EQU   ATCAOSM+589
ATCRSV66 EQU   ATCZFLAG
ATCZF001 EQU   ATCZFLAG
ATCTPCP1 EQU   ATCAOSM+584
ATCAICTN EQU   ATCAOSM+576
ATCZR01  EQU   ATCAOSM+572
ATCMPLTA EQU   ATCAOSM+568
ATCASCB  EQU   ATCAOSM+564
ATCAP86  EQU   ATCAOSM+560
ATCAP85  EQU   ATCAOSM+556
ATCAP84  EQU   ATCAOSM+552
ATCAP83  EQU   ATCAOSM+548
ATCAP82  EQU   ATCAOSM+544
ATCAP69  EQU   ATCAOSM+540
ATCAP66  EQU   ATCAOSM+536
ATCAP62  EQU   ATCAOSM+532
ATCAPC59 EQU   ATCAOSM+528
ATCAP56  EQU   ATCAOSM+524
ATCAP55  EQU   ATCAOSM+520
ATCRCFY0 EQU   ATCAOSM+516
ATCAP41  EQU   ATCAOSM+512
ATCAPC25 EQU   ATCAOSM+508
ATCAP23  EQU   ATCAOSM+504
ATCTPSPB EQU   ATCAOSM+472
ATCTRMPB EQU   ATCAOSM+440
ATCAPBE  EQU   ATCAOSM+436
ATCPSTA  EQU   ATCAOSM+432
ATCSMABF EQU   ATCAOSM+428
ATCSMAPR EQU   ATCAOSM+424
ATCTPWQA EQU   ATCAOSM+420
ATCSMAID EQU   ATCAOSM+416
ATCSMARA EQU   ATCAOSM+412
ATCCACXA EQU   ATCAOSM+408
ATCZLAAB EQU   ATCAOSM+404
ATCATA10 EQU   ATCAOSM+400
ATCHLTCB EQU   ATCAOSM+396
@NM00068 EQU   ATCVTFLG
ATCVTACT EQU   ATCVTFLG
ATCRPT40 EQU   ATCAOSM+388
ATCRPT39 EQU   ATCAOSM+384
ATCRPT38 EQU   ATCAOSM+380
ATCRPT37 EQU   ATCAOSM+376
ATCRPT36 EQU   ATCAOSM+372
ATCRPT35 EQU   ATCAOSM+368
ATCRPT34 EQU   ATCAOSM+364
ATCRPT33 EQU   ATCAOSM+360
ATCRPT32 EQU   ATCAOSM+356
ATCRPT31 EQU   ATCAOSM+352
ATCRPT30 EQU   ATCAOSM+348
ATCRPT29 EQU   ATCAOSM+344
ATCRPT28 EQU   ATCAOSM+340
ATCRPT27 EQU   ATCAOSM+336
@NM00067 EQU   ATCAOSM+333
@NM00066 EQU   @NM00065
ATCSNUF  EQU   @NM00065
ATCOPKL  EQU   @NM00065
ATCABEN  EQU   @NM00065
ATCAIWT  EQU   ATCAOSM+328
ATCINFDD EQU   ATCAOSM+324
ATCORFMG EQU   ATCAOSM+320
ATCORFRL EQU   ATCAOSM+316
ATCOROBT EQU   ATCAOSM+312
ATCORQG  EQU   ATCORSRB
ATCORTBF EQU   ATCSQAFR
ATCRPLAC EQU   ATCRPLCN+2
ATCRPLRC EQU   ATCRPLCN
ATCCRPLQ EQU   ATCCRPL
ATCSRBAC EQU   ATCSRBCN+2
ATCSRBRC EQU   ATCSRBCN
ATCSRBQ  EQU   ATCSRB
ATCCRAAC EQU   ATCCRACN+2
ATCCRARC EQU   ATCCRACN
ATCCRAQ  EQU   ATCCRA
ATCRPT12 EQU   ATCAOSM+276
ATCDMAPP EQU   ATCAOSM+272
ATCAP38  EQU   ATCAOSM+268
ATCZDFJ0 EQU   ATCAOSM+260
ATCAP51  EQU   ATCAOSM+256
ATCZPAB1 EQU   ATCAOSM+192
ATCZLFVT EQU   ATCAOSM+188
ATCZLPVT EQU   ATCAOSM+184
ATCZDVTX EQU   ATCAOSM+180
ATCZDVTA EQU   ATCAOSM+176
ATCZDVT9 EQU   ATCAOSM+172
ATCZDVT8 EQU   ATCAOSM+168
ATCZDVT7 EQU   ATCAOSM+164
ATCRSV56 EQU   ATCDAPVT+22
ATCDAPDG EQU   ATCDAPVT+20
ATCDXCEA EQU   ATCDAPVT+16
ATCDCEA  EQU   ATCDAPVT+12
ATCDPCIA EQU   ATCDAPVT+8
ATCDSIOA EQU   ATCDAPVT+4
ATCDEOEA EQU   ATCDAPVT
ATCZLAEA EQU   ATCLDAPP+16
ATCZLCEA EQU   ATCLDAPP+12
ATCRSV17 EQU   ATCLDAPP+8
ATCSMFRR EQU   ATCLDAPP+4
ATCCDTID EQU   ATCLDAPP
ATCZAEA  EQU   ATCICAPP+16
ATCZCEA  EQU   ATCICAPP+12
ATCCDTCB EQU   ATCICAPP+8
ATCZSIOA EQU   ATCICAPP+4
ATCCDRPH EQU   ATCICAPP
ATCAP65  EQU   ATCAOSM+96
ATCZDVT6 EQU   ATCAOSM+92
ATCZDVT4 EQU   ATCAOSM+88
ATCZDVT3 EQU   ATCAOSM+84
ATCZDVT1 EQU   ATCAOSM+80
ATCICNCB EQU   ATCAOSM+76
ATCZPSVT EQU   ATCAOSM+72
ATCAP64  EQU   ATCAOSM+64
ATCAP63  EQU   ATCAOSM+60
ATCAP61  EQU   ATCAOSM+56
ATCAP58  EQU   ATCAOSM+52
ATCAP57  EQU   ATCAOSM+48
ATCAP54  EQU   ATCAOSM+44
ATCAP53  EQU   ATCAOSM+40
ATCAP52  EQU   ATCAOSM+36
ATCAP32  EQU   ATCAOSM+28
ATCAP31  EQU   ATCAOSM+24
ATCAP12  EQU   ATCAOSM+20
ATCAP11  EQU   ATCAOSM+16
ATCCMTCB EQU   ATCAOSM+12
ATCPRPH  EQU   ATCAOSM+8
ATCGSRBF EQU   ATCGSRBG
ATCSRBRT EQU   ATCAOSM
@NM00064 EQU   @NM00063
ATCVTMAB EQU   @NM00063
@NM00062 EQU   ATCVTBAM
ATCVDLOK EQU   ISTATCVT+904
ATCVFPAB EQU   ISTATCVT+872
ATCVDPAB EQU   ISTATCVT+840
ATCIOECB EQU   ISTATCVT+836
ATCINCW3 EQU   ISTATCVT+832
ATCMODTB EQU   ISTATCVT+828
ATCUSSPT EQU   ISTATCVT+824
ATCSRTAB EQU   ISTATCVT+820
@NM00061 EQU   ISTATCVT+819
@NM00060 EQU   ATCSTAT2
ATCTRSMS EQU   ATCSTAT2
ATCTRLOK EQU   ATCSTAT2
ATCTRPSS EQU   ATCSTAT2
ATCTRESC EQU   ATCSTAT2
ATCTRAPI EQU   ATCSTAT2
ATCNMCTR EQU   ISTATCVT+816
ATCSEC51 EQU   ATCSECST
ATCSEC40 EQU   ATCSIPD+8
ATCSEC30 EQU   ATCSIPD+4
ATCSEC21 EQU   ATCSIPD
ATCSEC10 EQU   ATCSOPD+4
ATCSEC01 EQU   ATCSOPD
ATCPOIA  EQU   ATCRNO+1
@NM00059 EQU   ATCRNO
ATCPODVT EQU   ISTATCVT+784
ATCS49XL EQU   ISTATCVT+780
ATCS49XI EQU   ISTATCVT+776
ATCLCLCT EQU   ATCVLCNT+2
ATCRNCNT EQU   ATCVLCNT
ATCCFEAD EQU   ISTATCVT+768
ATCPTR00 EQU   ISTATCVT+736
ATCRSV10 EQU   ISTATCVT+704
ATCTACB  EQU   ISTATCVT+700
ATCVTINM EQU   ISTATCVT+696
ATCTCLIM EQU   ISTATCVT+692
ATCTCLOM EQU   ISTATCVT+688
ATCVTIPB EQU   ISTATCVT+656
ATCTCIPB EQU   ISTATCVT+624
ATCTIPAB EQU   ISTATCVT+592
ATCOCCCB EQU   ISTATCVT+588
ATCOCCOB EQU   ISTATCVT+584
ATCCDLAD EQU   ISTATCVT+580
ATCCCLAD EQU   ISTATCVT+576
ATCDLRPB EQU   ISTATCVT+544
ATCPGPAB EQU   ISTATCVT+512
ATCVPAB1 EQU   ISTATCVT+480
ATCRSV97 EQU   ISTATCVT+476
ATCRDTLK EQU   ISTATCVT+472
ATCVOCLK EQU   ISTATCVT+468
ATCDVTLK EQU   ISTATCVT+456
ATCAP36  EQU   ISTATCVT+452
ATCAP35  EQU   ISTATCVT+448
ATCAP33  EQU   ISTATCVT+444
ATCRSV99 EQU   ISTATCVT+440
ATCONFIG EQU   ISTATCVT+432
ATCNODDS EQU   ISTATCVT+428
ATCNODEL EQU   ISTATCVT+420
ATCRSV69 EQU   ISTATCVT+416
ATCAPCR5 EQU   ISTATCVT+412
ATCLDECB EQU   ISTATCVT+408
ATCLDNCS EQU   ISTATCVT+404
ATCCDPTR EQU   ISTATCVT+400
ATCADEL  EQU   ISTATCVT+396
ATCTODVT EQU   ISTATCVT+392
ATCDEBCH EQU   ISTATCVT+388
ATCHBSIZ EQU   ATCHPGM+2
ATCHBFNO EQU   ATCHPGM
ATCCRME  EQU   ISTATCVT+380
ATCRVCHS EQU   ISTATCVT+372
ATCECTLP EQU   ISTATCVT+368
ATCZDVTB EQU   ISTATCVT+364
ATCECPRT EQU   ISTATCVT+360
ATCVTLOD EQU   ISTATCVT+356
ATCTRPAB EQU   ISTATCVT+352
ATCMSGM  EQU   ISTATCVT+348
ATCMSGP  EQU   ISTATCVT+344
ATCEPT   EQU   ISTATCVT+340
ATCDVT   EQU   ISTATCVT+336
ATCTRCPT EQU   ISTATCVT+332
ATCDVLOD EQU   ISTATCVT+328
ATCALERT EQU   ISTATCVT+324
ATCEPA   EQU   ISTATCVT+320
ATCSAF   EQU   ISTATCVT+318
ATCXRANG EQU   ISTATCVT+317
ATCLAST  EQU   ATCSHRFG
ATCSHRTN EQU   ISTATCVT+308
ATCUEP   EQU   ISTATCVT+304
ATCOCRT  EQU   ISTATCVT+300
ATCCSMA  EQU   ATCCSMR
ATCESC02 EQU   ISTATCVT+292
ATCESC01 EQU   ISTATCVT+288
ATCMNT   EQU   ISTATCVT+272
ATCRSV16 EQU   ISTATCVT+270
ATCMAXID EQU   ISTATCVT+269
ATCMSGSP EQU   ATCCOM+268
ATCACTRM EQU   ATCCOM+264
ATCNERAP EQU   ATCCOM+260
ATCNESAL EQU   ATCCOM+256
ATCRCC65 EQU   ATCCOM+252
ATCRCC26 EQU   ATCCOM+248
ATCRCC63 EQU   ATCCOM+244
ATCRSV11 EQU   ATCCOM+242
ATCVTMID EQU   ATCCOM+240
ATCAPOST EQU   ATCCOM+236
ATCNERFN EQU   ATCCOM+232
ATCNERNE EQU   ATCCOM+228
ATCNERCV EQU   ATCCOM+224
ATCNERST EQU   ATCCOM+220
ATCDCC61 EQU   ATCCOM+216
ATCDCC60 EQU   ATCCOM+212
ATCSRTDF EQU   ATCCOM+208
ATCSRTAD EQU   ATCCOM+204
ATCFIRA  EQU   ATCCOM+200
ATCSMBQ  EQU   ATCCOM+196
ATCSMRC  EQU   ATCCOM+192
ATCSMQU  EQU   ATCCOM+184
ATCSMRQ  EQU   ATCCOM+180
ATCACDA  EQU   ATCCOM+176
ATCSTMA  EQU   ATCCOM+172
ATCFRSTR EQU   ATCCOM+168
ATCGTSTR EQU   ATCCOM+164
ATCREADA EQU   ATCCOM+160
ATCALOAD EQU   ATCCOM+156
ATCBLDLA EQU   ATCCOM+152
ATCFBRPH EQU   ATCCOM+148
ATCBFTRC EQU   ATCCOM+144
ATCTPBUF EQU   ATCTHTRC
ATCREMOV EQU   ATCCOM+136
ATCADD   EQU   ATCCOM+132
ATCDVTPT EQU   ATCCOM+124
ATCFEPT  EQU   ATCCOM+120
ATCFDVT  EQU   ATCCOM+116
ATCCONFT EQU   ATCCOM+112
ATCPTCHA EQU   ATCCOM+108
ATCAUTHA EQU   ATCCOM+104
ATCACCTA EQU   ATCCOM+100
ATCRDTH  EQU   ATCCOM+96
ATCFRSCH EQU   ATCCOM+92
ATCFSB   EQU   ATCCOM+88
ATCHLTMS EQU   ATCCOM+84
ATCECPRM EQU   ATCCOM+80
ATCECNET EQU   ATCCOM+76
ATCECOPC EQU   ATCCOM+72
ATCVPARM EQU   ATCCOM+68
ATCECVRQ EQU   ATCCOM+64
ATCECSES EQU   ATCCOM+60
ATCOCHA  EQU   ATCCOM+56
ATCDSPLQ EQU   ATCCOM+52
ATCECDSP EQU   ATCCOM+48
ATCVARYQ EQU   ATCCOM+44
ATCECVRY EQU   ATCCOM+40
ATCHALTQ EQU   ATCCOM+36
ATCECHLT EQU   ATCCOM+32
ATCMODQ  EQU   ATCCOM+28
ATCECMOD EQU   ATCCOM+24
ATCASCHD EQU   ATCCOM+20
ATCSRT   EQU   ATCCOM+16
ATCRDT   EQU   ATCCOM+12
ATCDCFRR EQU   ATCCOM+8
ATCAPI   EQU   ATCCOM+4
ATCRSV04 EQU   ATCSTAT4
ATCVTTRC EQU   ATCSTAT4
ATCNCSD  EQU   ATCSTAT4
ATCMTST  EQU   ATCSTAT4
ATCTPRT  EQU   ATCSTAT4
ATCPRTAT EQU   ATCSTAT4
@NM00058 EQU   ATCPOFLG
ATCPOUNS EQU   ATCPOFLG
ATCHSDMF EQU   ATCSTFLG
@NM00057 EQU   ATCSTAT1
ATCMDHLT EQU   ATCSTAT1
ATCINHLT EQU   ATCSTAT1
ATCNETSL EQU   ATCSTAT1
ATCQKHLT EQU   ATCSTAT1
ATCSNHLT EQU   ATCSTAT1
ATCACTIV EQU   ATCSTAT1
ATCSTART EQU   ATCSTAT1
LUNZC001 EQU   LUNZOS+8
LUNLOCK  EQU   LUNZOS
LUNCB    EQU   ISTLUNCB
ICNZCON6 EQU   ICNZCONS+10
ICNZCON1 EQU   ICNZCONS
ICNZATSA EQU   ISTICNCB+676
ICNZX012 EQU   ISTICNCB+675
ICNZX011 EQU   ISTICNCB+674
ICNZX010 EQU   ISTICNCB+672
ICNZC001 EQU   ISTICNCB+512
ICNZX013 EQU   ISTICNCB+511
ICNZS010 EQU   ICNZH002+1
ICNZS00F EQU   ICNZH002+1
ICNZS00E EQU   ICNZH002+1
ICNZS00D EQU   ICNZH002+1
ICNZS00C EQU   ICNZH002+1
ICNZS00B EQU   ICNZH002+1
ICNZS01A EQU   ICNZS00A
ICNZS019 EQU   ICNZS009
ICNZS018 EQU   ICNZS008
ICNZS017 EQU   ICNZS007
ICNZS016 EQU   ICNZS006
ICNZS005 EQU   ICNZH002
ICNZS014 EQU   ICNZS004
ICNZS013 EQU   ICNZS003
ICNZS012 EQU   ICNZS002
ICNZS001 EQU   ICNZH002
ICNZF028 EQU   ICNZFLAG
ICNZF027 EQU   ICNZFLAG
ICNZF026 EQU   ICNZFLAG
ICNZF025 EQU   ICNZFLAG
ICNZF024 EQU   ICNZFLAG
ICNZF023 EQU   ICNZFLAG
ICNZF022 EQU   ICNZFLAG
ICNZF021 EQU   ICNZFLAG
ICNWORD5 EQU   ISTICNCB+504
ICNMSIZE EQU   ISTICNCB+500
ICNDEBAD EQU   ICNDIDEB+1
ICNDCBIF EQU   ICNDIDEB
ICNUCBAD EQU   ICNDCDEB+8
ICNAPPAD EQU   ICNDCDEB+5
ICNEXSCL EQU   ICNDCDEB+4
ICNDCBAD EQU   ICNDCDEB+1
ICNDEBID EQU   ICNDCDEB
@NM00056 EQU   ISTICNCB+477
ICNERCNT EQU   ISTICNCB+476
ICNZX002 EQU   ISTICNCB+475
ICNZX001 EQU   ISTICNCB+474
ICNZSW3R EQU   ISTICNCB+468
ICNZSW2R EQU   ISTICNCB+464
ICNZSW1R EQU   ISTICNCB+460
ICNZS4VR EQU   ISTICNCB+436
ICNZS4RR EQU   ISTICNCB+432
ICNZS4FC EQU   ISTICNCB+428
ICNZS4BC EQU   ISTICNCB+424
ICNZS3VR EQU   ISTICNCB+400
ICNZS3RR EQU   ISTICNCB+396
ICNZS3FC EQU   ISTICNCB+392
ICNZS3BC EQU   ISTICNCB+388
ICNZS1RC EQU   ICNZS1VR+36
ICNZS1RR EQU   ISTICNCB+344
ICNZS1FC EQU   ISTICNCB+340
ICNZS1BC EQU   ISTICNCB+336
ICNRSTIC EQU   ICNZD004
ICNWSTIC EQU   ICNZD002
ICNWRCOD EQU   ICNWSCCW
ICNZV008 EQU   ISTICNCB+284
ICNZV007 EQU   ISTICNCB+280
ICNZV004 EQU   ISTICNCB+268
ICNZV002 EQU   ISTICNCB+256
ICNNICNA EQU   ISTICNCB+240
@NM00055 EQU   ICNFLAG2+2
ICNZF019 EQU   ICNFLAG2+2
ICNZF018 EQU   ICNFLAG2+2
ICNZF017 EQU   ICNFLAG2+2
ICNZF016 EQU   ICNFLAG2+2
ICNZF015 EQU   ICNFLAG2+2
ICNMSG   EQU   ICNFLAG2+1
ICNCLOSE EQU   ICNFLAG2+1
ICNZF014 EQU   ICNFLAG2+1
ICNZF012 EQU   ICNFLAG2+1
ICNZF011 EQU   ICNFLAG2+1
ICNZF00B EQU   ICNFLAG2+1
ICNZF00A EQU   ICNFLAG2
ICNZF008 EQU   ICNFLAG2
ICNZF007 EQU   ICNFLAG2
ICNZF005 EQU   ICNFLAG2
ICNZF004 EQU   ICNFLAG2
ICNZF003 EQU   ICNFLAG2
ICNZF002 EQU   ICNFLAG2
ICNLOCK  EQU   ISTICNCB+232
ICNLICNA EQU   ISTICNCB+228
ICNZV003 EQU   ISTICNCB+116
ICNLAST  EQU   ISTICNCB+112
ICNLSTBT EQU   ISTICNCB+108
ICNFLAG1 EQU   ISTICNCB+103
ICNZSW08 EQU   ICNZSWS
ICNZSW07 EQU   ICNZSWS
ICNZSW06 EQU   ICNZSWS
ICNZSW05 EQU   ICNZSWS
ICNZSW04 EQU   ICNZSWS
ICNZSW03 EQU   ICNZSWS
ICNZSW02 EQU   ICNZSWS
ICNZSW01 EQU   ICNZSWS
ICNZFF69 EQU   ICNFFLAG
@NM00054 EQU   ICNFFLAG
ICNZFF05 EQU   ICNFFLAG
ICNZFF04 EQU   ICNFFLAG
ICNZFF03 EQU   ICNFFLAG
ICNZFF02 EQU   ICNFFLAG
ICNZFF01 EQU   ICNFFLAG
ICNZFF00 EQU   ICNFFLAG
@NM00053 EQU   ICNFLAG
ICNZCRIT EQU   ICNFLAG
ICNSTART EQU   ICNFLAG
ICNSLOW  EQU   ICNFLAG
ICNZF010 EQU   ICNFLAG
ICNZF00F EQU   ICNFLAG
ICNZF00E EQU   ICNFLAG
ICNCONF  EQU   ICNZF006
ICNCKPAB EQU   ICNCKFLD+1
ICNRSV07 EQU   ICNCKFLD
ICNCKBIT EQU   ICNCKFLD
ICNZPAB4 EQU   ISTICNCB+80
ICNZPAB1 EQU   ISTICNCB+64
ICNRSV01 EQU   ISTICNCB+60
@NM00052 EQU   ISTICNCB+56
@NM00051 EQU   ISTICNCB+54
@NM00050 EQU   @NM00049
ICNRRY   EQU   @NM00049
ICNROLN  EQU   @NM00049
ICNRNRY  EQU   @NM00049
ICNLNKMD EQU   ISTICNCB+52
ICNCUUA  EQU   ISTICNCB+48
ICNCB    EQU   ISTICNCB
LOKXCL   EQU   @NM00047
LOKPRY   EQU   @NM00047
@NM00048 EQU   @NM00047
@NM00046 EQU   LOKCHNG
LOKCT    EQU   ISTLOK
NCBRSV01 EQU   ISTNCB+46
NCBSWDAF EQU   ISTNCB+44
NCBDEVCH EQU   ISTNCB+36
NCBFMCBP EQU   ISTNCB+32
NCBLTRC  EQU   ISTNCB+30
NCBRVPT1 EQU   ISTNCB+28
NCBNMLLN EQU   NCBFLAGS+3
@NM00045 EQU   NCBFLAG1
NCBFORCE EQU   NCBFLAG1
NCBTTF   EQU   NCBFLAG1
NCBRSYNC EQU   NCBFLAG1
NCBRSTRT EQU   NCBFLAG1
NCBCONF  EQU   NCBFLAG1
NCBSNAI  EQU   NCBFLAG1
NCBFLTIO EQU   NCBFTRIO
NCBCSTAT EQU   NCBFLAGS
NCBNCSL  EQU   ISTNCB+22
NCBNCBA  EQU   ISTNCB+20
NCBFMCBA EQU   ISTNCB+16
NCBNSNA  EQU   ISTNCB+12
NCBTSKID EQU   ISTNCB+8
NCBRDTE  EQU   ISTNCB+4
NCBDAF   EQU   ISTNCB+2
NCBLNGTH EQU   ISTNCB+1
NCBTYPE  EQU   ISTNCB
DEVRSV03 EQU   ISTDEVCH+5
DEVPHYSA EQU   ISTDEVCH+4
DEVCSLPN EQU   DEVCHAR3
DEVCSTCL EQU   DEVCHAR3
DEVCCHEK EQU   DEVCHAR3
DEVCATTN EQU   DEVCHAR3
DEVCSWL  EQU   DEVFCCTL
DEVCRVB  EQU   DEVFCCTL
DEVCSSL  EQU   DEVFCCTL
DEVCBSC  EQU   DEVFCCTL
DEVMCODE EQU   ISTDEVCH+2
DEVCHAR2 EQU   DEVTCODE
DEVRSV01 EQU   DEVCHAR
DEVCCTL  EQU   DEVCHAR
DEVNNSPT EQU   DEVCHAR
DEVSPS   EQU   DEVCHAR
DEVSUBND EQU   DEVCHAR
DEVCONVR EQU   DEVCHAR
DEVOTPUT EQU   DEVCHAR
DEVINPUT EQU   DEVCHAR
MPSSRB1  EQU   ISTMPST+172
MPSSAVE  EQU   ISTMPST+140
MPSMQLBP EQU   ISTMPST+136
MPSSYSRT EQU   ISTMPST+132
MPSQEL   EQU   ISTMPST+128
MPSDBTBL EQU   ISTMPST+124
MPSASCB  EQU   ISTMPST+120
MPSTPPAB EQU   ISTMPST+88
MPSSMPAB EQU   ISTMPST+56
MPSSMRPH EQU   ISTMPST+52
MPSSRB55 EQU   ISTMPST+48
MPSRPLAC EQU   MPSRPLCT+2
MPSRPLRC EQU   MPSRPLCT
MPSCRPLQ EQU   MPSCRPL
MPSSRBAC EQU   MPSSRBCT+2
MPSSRBRC EQU   MPSSRBCT
MPSSRBQ  EQU   MPSSRB
MPSCRAAC EQU   MPSCRACT+2
MPSCRARC EQU   MPSCRACT
MPSCRAQ  EQU   MPSCRA
MPSMPSTP EQU   ISTMPST+20
MPSPSTCT EQU   ISTMPST+16
MPSASID  EQU   MPSFLGA+2
MPSRSV02 EQU   MPSFLGA+1
MPSPSTAB EQU   MPSFLGA
MPSRSV01 EQU   MPSFLGA
MPSTPBU  EQU   MPSFLGA
MPMEMTRM EQU   MPSFLGA
MPSAUTH  EQU   MPSFLGA
MPSCRAO  EQU   MPSFLGA
MPSSRBO  EQU   MPSFLGA
MPSRQUEG EQU   MPSRQUE
MPSTSOIR EQU   MPSRSV07
MPSTSOIW EQU   MPSRSV07
MPSID    EQU   ISTMPST
PSTDRDYQ EQU   PSTDMPS+1
@NM00044 EQU   PSTDMPS
PSTDGATE EQU   PSTDMPS
PSTDEBP  EQU   ISTPST+128
PSTSAVE  EQU   ISTPST+96
PSTSMDYP EQU   ISTPST+64
PSTCRRS  EQU   ISTPST+60
PSTCRR1  EQU   ISTPST+56
PSTIQE22 EQU   ISTPST+52
PSTIQE21 EQU   ISTPST+48
PSTIQE12 EQU   ISTPST+44
PSTIQE11 EQU   ISTPST+40
PSTUEQ   EQU   ISTPST+36
PSTNSSQ  EQU   ISTPST+32
PSTPSSQ  EQU   ISTPST+28
PSTACBCT EQU   ISTPST+24
PSTMPSTP EQU   ISTPST+20
PSTTCBA  EQU   ISTPST+16
PSTRSV08 EQU   PSTFLGA+1
PSTDMPC  EQU   PSTFLGA+1
PSTABEND EQU   PSTABINP
PSTAUTH  EQU   PSTFLGA
PSTSMCU  EQU   PSTFLGA
PSTSMQR  EQU   PSTFLGA
PSTIRBU2 EQU   PSTFLGA
PSTIRBU1 EQU   PSTFLGA
PSTUERN  EQU   PSTFLGA
PSTSSRN  EQU   PSTFLGA
PSTRQUEA EQU   PSTRQUE+1
PSTRSV07 EQU   PSTRQUE
PSTRSV06 EQU   PSTRQUE
PSTRSV05 EQU   PSTRQUE
PSTRSV04 EQU   PSTRQUE
PSTRSV03 EQU   PSTRQUE
PSTRSV02 EQU   PSTRQUE
PSTRSV01 EQU   PSTRQUE
PSTRQFLG EQU   PSTRQUE
PSTCHAIN EQU   ISTPST+4
@NM00043 EQU   ISTPST+2
PSTLNGTH EQU   ISTPST+1
PSTTYPE  EQU   ISTPST
RPHNEXPO EQU   ISTRPH+104
RPHSAV16 EQU   RPHWORK+60
RPHSAV15 EQU   RPHWORK+56
RPHSAV14 EQU   RPHWORK+52
RPHSAV13 EQU   RPHWORK+48
RPHSAV12 EQU   RPHWORK+44
RPHSAV11 EQU   RPHWORK+40
RPHSAV10 EQU   RPHWORK+36
RPHSAVE9 EQU   RPHWORK+32
RPHSAVE8 EQU   RPHWORK+28
RPHSAVE7 EQU   RPHWORK+24
RPHSAVE6 EQU   RPHWORK+20
RPHSAVE5 EQU   RPHWORK+16
RPHSAVE4 EQU   RPHWORK+12
RPHSAVE3 EQU   RPHWORK+8
RPHSAVE2 EQU   RPHWORK+4
RPHSHALF EQU   RPHSAVE1+2
RPHSBIT8 EQU   RPHSBITS
RPHSBIT7 EQU   RPHSBITS
RPHSBIT6 EQU   RPHSBITS
RPHSBIT5 EQU   RPHSBITS
RPHSBIT4 EQU   RPHSBITS
RPHSBIT3 EQU   RPHSBITS
RPHSBIT2 EQU   RPHSBITS
RPHSBIT1 EQU   RPHSBITS
RPHSBYTE EQU   RPHSAVE1
RPHPABQP EQU   RPHPABQA+1
RPHPABFG EQU   RPHPABQA
RPHCRR   EQU   ISTRPH+32
RPHSRP34 EQU   RPHSRPRM+2
RPHSRP12 EQU   RPHSRPRM
RPHWEGT  EQU   RPHCSPA
RPHMAJCB EQU   ISTRPH+21
RPHPABOF EQU   ISTRPH+20
RPHRESUM EQU   RPHRESMA+1
RPHRSV01 EQU   RPHWPFLG
RPHPURGE EQU   RPHWPFLG
RPHPT    EQU   RPHWPFLG
RPHWT    EQU   RPHWPFLG
RPHRSKEY EQU   RPHWPFLG
RPHDVTA  EQU   ISTRPH+12
RPHTIK   EQU   RPHTSKID+3
@NM00042 EQU   RPHTSKID
RPHRPHAP EQU   RPHRPHA+1
@NM00041 EQU   RPHRPHA
RPHGATE  EQU   RPHRPHA
@NM00040 EQU   RPHFLGB
RPHRLCRA EQU   RPHFLGB
RPHNRSAV EQU   RPHFLGB
RPHPGCMP EQU   RPHFLGB
RPHFBAPS EQU   RPHFLGB
RPHBSSP  EQU   RPHFLGB
RPHLOCK  EQU   RPHFLGB
RPHFNFLG EQU   RPHFSTLC
RPHMLTCP EQU   RPHFLAGS
RPHSMCLR EQU   RPHFLAGS
RPHSMTYP EQU   RPHFLAGS
RPHSMQ   EQU   RPHFLAGS
RPHAUTEX EQU   RPHAPTYP
RPHSPGIN EQU   RPHFLAGS
RPHOGIND EQU   RPHFLAGS
RPHLNGTH EQU   RPHCNTL+1
RPHTYPE  EQU   RPHCNTL
DYPRSV01 EQU   ISTDYPAB+12
DYPTSKID EQU   ISTDYPAB+8
DYPCHAIN EQU   ISTDYPAB+4
DYPFLGS  EQU   ISTDYPAB+2
DYPLNGTH EQU   ISTDYPAB+1
DYPTYPE  EQU   ISTDYPAB
PABRPHA  EQU   PABRPHFG+1
PABNODQ  EQU   PABFLAGS
PABINHBT EQU   PABFLAGS
PABERLOK EQU   PABERRLK
PABSSN   EQU   PABFLAGS
PABDYNAM EQU   PABFLAGS
PABNORPR EQU   PABFLAGS
PABPRIOR EQU   PABFLAGS
PABAPYP  EQU   PABFLAGS
PABDVTA  EQU   ISTPAB+9
PABOFFST EQU   ISTPAB+8
PABCHNGP EQU   PABCHAIN+1
PABRSV02 EQU   PABCHAIN
PABDELAY EQU   PABCHAIN
PABRUNNG EQU   PABCHAIN
PABRESET EQU   PABCHAIN
PABUNCON EQU   PABCHAIN
PABCDP   EQU   PABCHAIN
PABRESCH EQU   PABCHAIN
PABCHNG  EQU   PABCHAIN
PABWEQP  EQU   PABWEQA+1
PABRSV01 EQU   PABWEQA
PABWEQG  EQU   PABWEQA
ISTPDAVP EQU   ISTAVT+40
ISTAVR01 EQU   ISTAVT+38
ISTVTTP  EQU   ISTAVT+36
ISTAGTWT EQU   ISTAVT+34
ISTATRT  EQU   ISTAVT+32
ISTARID  EQU   ISTAVT+30
ISTX1    EQU   ISTAVT+29
ISTPHNM  EQU   ISTAVT+24
ISTAPSEX EQU   ISTAVT+20
ISTVTTIK EQU   ISTAVT+18
AVTASID  EQU   ISTAVT+16
ISTAPSTA EQU   ISTAVT+12
ISTAS53  EQU   ISTAVT+8
ISTAHIP  EQU   ISTAS49
ISTACVT  EQU   ISTAVT
CVTLEVL  EQU   CVTRELNO+2
CVTNUMB  EQU   CVTRELNO
CVTMDL   EQU   CVTFIX+250
@NM00039 EQU   CVTFIX+248
@NM00038 EQU   CVTFIX
CVTRV482 EQU   CVTXTNT2+128
CVTRV481 EQU   CVTXTNT2+124
CVTRV480 EQU   CVTXTNT2+120
CVTRV479 EQU   CVTXTNT2+118
CVTRV478 EQU   CVTXTNT2+117
CVTRV477 EQU   CVTXTNT2+116
CVTRV476 EQU   CVTXTNT2+115
CVTRV475 EQU   CVTXTNT2+114
CVTRV474 EQU   CVTRV466
CVTRV473 EQU   CVTRV466
CVTRV472 EQU   CVTRV466
CVTRV471 EQU   CVTRV466
CVTRV470 EQU   CVTRV466
CVTRV469 EQU   CVTRV466
CVTRV468 EQU   CVTRV466
CVTRV467 EQU   CVTRV466
CVTRV465 EQU   CVTRV457
CVTRV464 EQU   CVTRV457
CVTRV463 EQU   CVTRV457
CVTRV462 EQU   CVTRV457
CVTRV461 EQU   CVTRV457
CVTRV460 EQU   CVTRV457
CVTRV459 EQU   CVTRV457
CVTRV458 EQU   CVTRV457
CVTRV456 EQU   CVTXTNT2+108
CVTRV455 EQU   CVTXTNT2+104
CVTRV454 EQU   CVTXTNT2+100
CVTRV453 EQU   CVTXTNT2+96
CVTRV452 EQU   CVTXTNT2+94
CVTRV451 EQU   CVTXTNT2+92
CVTRV450 EQU   CVTXTNT2+90
CVTRV449 EQU   CVTXTNT2+88
CVTRV448 EQU   CVTXTNT2+87
CVTRV447 EQU   CVTXTNT2+86
CVTRV446 EQU   CVTRV438
CVTRV445 EQU   CVTRV438
CVTRV444 EQU   CVTRV438
CVTRV443 EQU   CVTRV438
CVTRV442 EQU   CVTRV438
CVTRV441 EQU   CVTRV438
CVTRV440 EQU   CVTRV438
CVTRV439 EQU   CVTRV438
CVTRV437 EQU   CVTRV429
CVTRV436 EQU   CVTRV429
CVTRV435 EQU   CVTRV429
CVTRV434 EQU   CVTRV429
CVTRV433 EQU   CVTRV429
CVTRV432 EQU   CVTRV429
CVTRV431 EQU   CVTRV429
CVTRV430 EQU   CVTRV429
CVTRV428 EQU   CVTXTNT2+80
CVTRV427 EQU   CVTXTNT2+76
CVTRV426 EQU   CVTXTNT2+72
CVTRV425 EQU   CVTXTNT2+68
CVTATACT EQU   CVTATCVT
CVTRV423 EQU   CVTXTNT2+62
CVTRV422 EQU   CVTXTNT2+60
CVTRV421 EQU   CVTXTNT2+58
CVTRV420 EQU   CVTXTNT2+56
CVTRV419 EQU   CVTXTNT2+55
CVTRV418 EQU   CVTXTNT2+54
CVTRV417 EQU   CVTRV409
CVTRV416 EQU   CVTRV409
CVTRV415 EQU   CVTRV409
CVTRV414 EQU   CVTRV409
CVTRV413 EQU   CVTRV409
CVTRV412 EQU   CVTRV409
CVTRV411 EQU   CVTRV409
CVTRV410 EQU   CVTRV409
CVTRV408 EQU   CVTRV400
CVTRV407 EQU   CVTRV400
CVTRV406 EQU   CVTRV400
CVTRV405 EQU   CVTRV400
CVTRV404 EQU   CVTRV400
CVTRV403 EQU   CVTRV400
CVTRV402 EQU   CVTRV400
CVTRV401 EQU   CVTRV400
CVTICB   EQU   CVTXTNT2+48
CVTSKTA  EQU   CVTXTNT2+44
CVTSHSB  EQU   CVTSHS
CVTRSV98 EQU   CVTXTNT2+36
CVTRSV97 EQU   CVTXTNT2+34
CVTRSV96 EQU   CVTXTNT2+32
CVTOLTEP EQU   CVTXTNT2+28
CVTQIDA  EQU   CVTQID+1
CVTRSV95 EQU   CVTQID
CVTRSV94 EQU   CVTXTNT2+20
CVTRSV93 EQU   CVTXTNT2+16
CVTRSV92 EQU   CVTXTNT2+12
CVTDEBVR EQU   CVTXTNT2+8
CVTRSV91 EQU   CVTXTNT2+6
CVTRSV9H EQU   CVTFLGBT
CVTRSV9G EQU   CVTFLGBT
CVTRSV9F EQU   CVTFLGBT
CVTRSV9E EQU   CVTFLGBT
CVTRSV9D EQU   CVTFLGBT
CVTRSV9C EQU   CVTFLGBT
CVTVME   EQU   CVTFLGBT
CVTNPE   EQU   CVTFLGBT
CVTNUCLS EQU   CVTXTNT2+4
CVTDSSVA EQU   CVTDSSV+1
CVTRSV89 EQU   CVTDSSV
CVTRSV88 EQU   CVTXTNT1+8
CVTRSV87 EQU   CVTXTNT1+4
CVTFACHN EQU   CVTXTNT1
CVTRV488 EQU   CVTMAP+412
CVTRV487 EQU   CVTMAP+408
CVTRV486 EQU   CVTMAP+404
CVTRV485 EQU   CVTMAP+400
CVTACTAP EQU   CVTMAP+396
CVTAUTH  EQU   CVTMAP+392
CVTATMCA EQU   CVTATMCT+1
CVTATMST EQU   CVTATMCT
CVTRSV61 EQU   CVTMAP+384
CVTVOLT1 EQU   CVTVOLM1+1
CVTVOLI1 EQU   CVTVOLF1
CVTSTOA  EQU   CVTMAP+376
CVTRSV58 EQU   CVTMAP+374
CVTRSV57 EQU   CVTMAP+372
CVTDDCE  EQU   CVTMAP+368
CVTPNWFR EQU   CVTMAP+364
CVTSMF   EQU   CVTMAP+360
CVTSULK  EQU   CVTMAP+358
CVTSLKO  EQU   CVTSYSK
CVTSLKP  EQU   CVTSYSK
CVTSLKQ  EQU   CVTSYSK
CVTSLKR  EQU   CVTSYSK
CVTRSV56 EQU   CVTSYSK
CVTRSV55 EQU   CVTSYSK
CVTRSV54 EQU   CVTSYSK
CVTRSV53 EQU   CVTSYSK
CVTRSV52 EQU   CVTA1F1
CVTRSV51 EQU   CVTA1F1
CVTRSV50 EQU   CVTA1F1
CVTRSV49 EQU   CVTA1F1
CVTRSV48 EQU   CVTA1F1
CVTRSV47 EQU   CVTA1F1
CVTSRSW  EQU   CVTA1F1
CVTPFSW  EQU   CVTA1F1
CVTPCVT  EQU   CVTMAP+352
CVTRSV46 EQU   CVTMAP+344
CVTRSV45 EQU   CVTMAP+340
CVTRSV44 EQU   CVTMAP+338
CVTRSV43 EQU   CVTMAP+336
CVTHJESA EQU   CVTHJES+1
CVTRSV42 EQU   CVTHJES
CVTEXT2A EQU   CVTEXT2+1
CVTRSV41 EQU   CVTEXT2
CVTAPFA  EQU   CVTAPF+1
CVTRSV40 EQU   CVTAPF
CVTRV518 EQU   CVTINTLA
CVTRV517 EQU   CVTERPV
CVTEORM  EQU   CVTMAP+312
CVTMCHPR EQU   CVTMAP+308
CVTTZ    EQU   CVTMAP+304
CVTJEPS  EQU   CVTMAP+300
CVTJESCT EQU   CVTMAP+296
CVTMODE  EQU   CVTMAP+292
CVTREAL  EQU   CVTMAP+284
CVTRSV39 EQU   CVTMAP+280
CVTRSV38 EQU   CVTMAP+276
CVTDMSRA EQU   CVTDMSR+1
CVTRV634 EQU   CVTDMSRF
CVTRV633 EQU   CVTDMSRF
CVTRV632 EQU   CVTDMSRF
CVTRV631 EQU   CVTDMSRF
CVTRV630 EQU   CVTDMSRF
CVTRV629 EQU   CVTDMSRF
CVTUDUMP EQU   CVTDMSRF
CVTSDUMP EQU   CVTDMSRF
CVTQMSGA EQU   CVTQMSG+1
CVTRSV36 EQU   CVTQMSG
CVTAMFF  EQU   CVTMAP+264
CVTPURGA EQU   CVTPURG+1
CVTRSV35 EQU   CVTPURG
CVTCBSP  EQU   CVTMAP+256
CVTATERA EQU   CVTATER+1
CVTSYST  EQU   CVTATER
CVTVOLT2 EQU   CVTTAT
CVTVOLI2 EQU   CVTVOLF2
CVTAQAVB EQU   CVTAQAVT+1
CVTRSV34 EQU   CVTTCMFG
CVTRSV33 EQU   CVTTCMFG
CVTRSV32 EQU   CVTTCMFG
CVTRSV31 EQU   CVTTCMFG
CVTRSV30 EQU   CVTTCMFG
CVTRSV29 EQU   CVTTCMFG
CVTRSV28 EQU   CVTTCMFG
CVTTCRDY EQU   CVTTCMFG
CVTGTFA  EQU   CVTGTF+1
CVTRSV27 EQU   CVTGTFST
CVTRNIO  EQU   CVTGTFST
CVTUSR   EQU   CVTGTFST
CVTRV318 EQU   CVTFORM
CVTRV317 EQU   CVTTMODE
CVTRV316 EQU   CVTSTATE
CVTRV315 EQU   CVTGTFS
CVTGTFAV EQU   CVTGTFS
CVT0SCR1 EQU   CVTMAP+232
CVTRV515 EQU   CVTMAP+228
CVTRMS   EQU   CVTMAP+224
CVTPATCH EQU   CVTMAP+220
CVTTSCE  EQU   CVTMAP+216
CVTLNKSC EQU   CVTMAP+214
CVTQABST EQU   CVTMAP+212
CVTMDLDS EQU   CVTMAP+208
CVTUSER  EQU   CVTMAP+204
CVTABEND EQU   CVTMAP+200
CVTSMCA  EQU   CVTMAP+196
CVTRSV18 EQU   CVTMAP+192
CVTQLPAQ EQU   CVTMAP+188
CVTQCDSR EQU   CVTMAP+184
CVTRSV17 EQU   CVTOPTB
CVTRSV16 EQU   CVTOPTB
CVTFP    EQU   CVTOPTB
CVTAPTHR EQU   CVTOPTB
CVTNLOG  EQU   CVTOPTB
CVTTOD   EQU   CVTOPTB
CVTCTIMS EQU   CVTOPTB
CVTPROT  EQU   CVTOPTB
CVTXPFP  EQU   CVTOPTA
CVTASCII EQU   CVTOPTA
CVTRSV13 EQU   CVTOPTA
CVTRSV12 EQU   CVTOPTA
CVTNIP   EQU   CVTOPTA
CVTDDR   EQU   CVTOPTA
CVTAPR   EQU   CVTOPTA
CVTCCH   EQU   CVTOPTA
CVTSNCTR EQU   CVTMAP+180
CVTQMWR  EQU   CVTMAP+176
CVTQOCR  EQU   CVTMAP+172
CVT1EF00 EQU   CVTMAP+168
CVTMZ00  EQU   CVTMAP+164
CVTHEAD  EQU   CVTMAP+160
CVTRSV11 EQU   CVTMAP+156
CVT0PT01 EQU   CVTMAP+152
CVTMSER  EQU   CVTMAP+148
CVTRV516 EQU   CVTIERLC
CVTILCH  EQU   CVTMAP+140
CVT0DS   EQU   CVTMAP+136
CVTFBOSV EQU   CVTMAP+132
CVTNUCB  EQU   CVTMAP+128
CVTIXAVL EQU   CVTMAP+124
CVTIOQET EQU   CVTMAP+120
CVTDCBA  EQU   CVTMAP+117
CVTMVS2  EQU   CVTDCB
CVT6DAT  EQU   CVTDCB
CVT4MPS  EQU   CVTDCB
CVTRSV09 EQU   CVTDCB
CVT4MS1  EQU   CVTDCB
CVT2SPS  EQU   CVTDCB
CVT1SSS  EQU   CVTDCB
CVTRSV08 EQU   CVTDCB
CVTSTB   EQU   CVTMAP+112
CVTQTD00 EQU   CVTMAP+108
CVTQTE00 EQU   CVTMAP+104
CVTCUCB  EQU   CVTMAP+100
CVTSJQ   EQU   CVTMAP+96
CVTPBLDL EQU   CVTMAP+92
CVTTPC   EQU   CVTMAP+88
CVTSVDCB EQU   CVTMAP+84
CVTBRET  EQU   CVTMAP+82
CVTEXIT  EQU   CVTMAP+80
CVT0FN00 EQU   CVTMAP+76
CVTDARA  EQU   CVTDAR+1
CVTRSV07 EQU   CVTFLGS1
CVTRSV06 EQU   CVTFLGS1
CVTRSV05 EQU   CVTFLGS1
CVTRSV04 EQU   CVTFLGS1
CVTRSV03 EQU   CVTFLGS1
CVTRSV02 EQU   CVTFLGS1
CVTRSV01 EQU   CVTFLGS1
CVTDMPLK EQU   CVTFLGS1
CVTXITP  EQU   CVTMAP+68
CVTZDTAB EQU   CVTMAP+64
CVTMSLT  EQU   CVTMAP+60
CVTDATE  EQU   CVTMAP+56
CVTBTERM EQU   CVTMAP+52
CVTSYSAD EQU   CVTMAP+48
CVTXTLER EQU   CVTMAP+44
CVTILK2  EQU   CVTMAP+40
CVTILK1  EQU   CVTMAP+36
CVTPRLTV EQU   CVTMAP+32
CVTPCNVT EQU   CVTMAP+28
CVT0VL00 EQU   CVTMAP+24
CVTXAPG  EQU   CVTMAP+20
CVTBUF   EQU   CVTMAP+16
CVTJOB   EQU   CVTMAP+12
CVTLINK  EQU   CVTMAP+8
CVT0EF00 EQU   CVTMAP+4
CVTTCBP  EQU   CVTMAP
CVT      EQU   CVTMAP
UCBERADR EQU   UCBUCS+12
UCBFCBID EQU   UCBUCS+8
UCBERCNT EQU   UCBUCS+7
UCBRSV51 EQU   UCBUCS+6
UCBRSV50 EQU   UCBFCBOP
UCBRSV49 EQU   UCBFCBOP
UCBRSV48 EQU   UCBFCBOP
UCBRSV47 EQU   UCBFCBOP
UCBRSV46 EQU   UCBFCBOP
UCBRSV45 EQU   UCBFCBOP
UCBRSV44 EQU   UCBFCBOP
UCBFCBO1 EQU   UCBFCBOP
UCBUCSPE EQU   UCBUCSOP
UCBRSV43 EQU   UCBUCSOP
UCBRSV42 EQU   UCBUCSOP
UCBRSV41 EQU   UCBUCSOP
UCBRSV40 EQU   UCBUCSOP
UCBRSV39 EQU   UCBUCSOP
UCBUCSO2 EQU   UCBUCSOP
UCBUCSO1 EQU   UCBUCSOP
UCBUCSID EQU   UCBUCS
UCBMDRBA EQU   UCBMDRBF+1
UCBRV075 EQU   UCBMDRBF
UCBRV074 EQU   UCB3800X+32
UCBIMAGE EQU   UCB3800X+28
UCBFCBNM EQU   UCB3800X+24
UCBCHAR4 EQU   UCB3800X+20
UCBCHAR3 EQU   UCB3800X+16
UCBCHAR2 EQU   UCB3800X+12
UCBCHAR1 EQU   UCB3800X+8
UCBCGMID EQU   UCB3800X+4
UCBBRSTA EQU   UCBACTIV
UCBRV063 EQU   UCBACTIV
UCBRV062 EQU   UCBACTIV
UCBRV061 EQU   UCBACTIV
UCBRV060 EQU   UCBACTIV
UCBRV059 EQU   UCBACTIV
UCBRV058 EQU   UCBACTIV
UCBRV057 EQU   UCBACTIV
UCBRV050 EQU   UCB3800X+2
UCBCGMNO EQU   UCB3800X+1
UCBRV083 EQU   UCBOPTNS
UCBBRSTR EQU   UCBOPTNS
UCBRV056 EQU   UCBOPTNS
UCBRV055 EQU   UCBOPTNS
UCBRV054 EQU   UCBOPTNS
UCBRV053 EQU   UCBOPTNS
UCBRV052 EQU   UCBOPTNS
UCBRV051 EQU   UCBOPTNS
UCBRV073 EQU   UCB3540X+7
UCBRV072 EQU   UCBDKBYT
UCBRV071 EQU   UCBDKBYT
UCBRV070 EQU   UCBDKBYT
UCBRV069 EQU   UCBDKBYT
UCBRV068 EQU   UCBDKBYT
UCBRV067 EQU   UCBDKBYT
UCBVLVER EQU   UCBDKBYT
UCBDKAMX EQU   UCBDKBYT
UCBVLSER EQU   UCB3540X
UCBRDATA EQU   UCBOCR+4
UCBFRID  EQU   UCBOCR
UCBCLN   EQU   UCBMT+14
UCBERG   EQU   UCBMT+12
UCBMS    EQU   UCBMT+11
UCBNB    EQU   UCBMT+10
UCBPW    EQU   UCBMT+9
UCBPR    EQU   UCBMT+8
UCBSIO   EQU   UCBMT+6
UCBTW    EQU   UCBMT+5
UCBTR    EQU   UCBMT+4
UCBTWT   EQU   UCBMT+3
UCBTRT   EQU   UCBMT+2
UCBCTD   EQU   UCBMT
UCBWTOID EQU   UCBCMEXT+17
UCBRV043 EQU   UCBCMEXT+16
UCBASID  EQU   UCBCMEXT+14
UCBMFCNT EQU   UCBCMEXT+12
UCBPMSK  EQU   UCBCMEXT+10
UCBCCWOF EQU   UCBCMEXT+8
UCBRV041 EQU   UCBCMEXT+6
UCBRV036 EQU   UCBFLP1
UCBRV035 EQU   UCBFLP1
UCBERLOG EQU   UCBFLP1
UCBRV033 EQU   UCBFLP1
UCBRV032 EQU   UCBFLP1
UCBRV031 EQU   UCBFLP1
UCBSHRUP EQU   UCBFLP1
UCBNSRCH EQU   UCBFLP1
UCBSNSCT EQU   UCBCMEXT+4
UCBHPDV  EQU   @NM00037
UCBHALI  EQU   @NM00037
UCBRSV09 EQU   @NM00037
UCBRSV08 EQU   @NM00037
UCBRSV07 EQU   @NM00037
UCBRSV06 EQU   @NM00037
UCBRSV05 EQU   @NM00037
UCBRSV04 EQU   @NM00037
UCBDTI   EQU   UCBCMEXT+2
UCBSTI   EQU   UCBCMEXT+1
UCBETI   EQU   UCBCMEXT
UCBEXTP  EQU   UCBEXTPT+1
UCBDDRSW EQU   UCBFLC
UCBTICBT EQU   UCBFLC
UCBIVRR  EQU   UCBFLC
UCBIVRS  EQU   UCBFLC
UCBITF   EQU   UCBFLC
UCBUDE   EQU   UCBFLC
UCBWAA   EQU   UCBFLC
UCBATTP  EQU   UCBFLC
UCBUNTYP EQU   UCBTBYT4
UCBRSV11 EQU   UCBDVCLS
UCBRSV10 EQU   UCBDVCLS
UCB3CHAR EQU   UCBDVCLS
UCB3UREC EQU   UCBDVCLS
UCB3DISP EQU   UCBDVCLS
UCB3DACC EQU   UCBDVCLS
UCB3COMM EQU   UCBDVCLS
UCB3TAPE EQU   UCBDVCLS
UCBDVPWR EQU   UCB2OPT7
UCBVLPWR EQU   UCB2OPT6
UCB2OPT5 EQU   UCBTBYT2
UCBRVDEV EQU   UCBRWTAU
UCBRPS   EQU   UCBDUDN2
UCBRR    EQU   UCBDUDN1
UCB2OPT1 EQU   UCBTBYT2
UCB2OPT0 EQU   UCBTBYT2
UCB1FEA7 EQU   UCBTBYT1
UCBD6250 EQU   UCB1FEA6
UCBD1600 EQU   UCB1FEA5
UCB1FEA4 EQU   UCBTBYT1
UCB1FEA3 EQU   UCBTBYT1
UCB1FEA2 EQU   UCBTBYT1
UCB1FEA1 EQU   UCBTBYT1
UCB1FEA0 EQU   UCBTBYT1
UCBNAME  EQU   UCBOB+13
UCBRV029 EQU   UCBWGT
UCBVHRSN EQU   UCBWGT
UCBVORSN EQU   UCBWGT
UCBMTPXP EQU   UCBWGT
UCBREW   EQU   UCBWGT
UCBPUB   EQU   UCBWGT
UCBOUT   EQU   UCBWGT
UCBIN    EQU   UCBWGT
UCBCPU   EQU   UCBOB+11
UCBLCI   EQU   UCBOB+10
UCBCNT   EQU   UCBOB+9
UCBRV017 EQU   UCBCHM1
UCBRV016 EQU   UCBCHM1
UCBRV015 EQU   UCBCHM1
UCBRV014 EQU   UCBCHM1
UCBSPB   EQU   UCBPTH1
UCBPPB   EQU   UCBPTH1
UCBSPA   EQU   UCBPTH0
UCBPPA   EQU   UCBPTH0
UCBSIGP  EQU   UCBFLB
UCBVALPH EQU   UCBFLB
UCBCRHSN EQU   UCBFLB
UCBCRHRV EQU   UCBFLB
UCBRESVH EQU   UCBFLB
UCBSPST  EQU   UCBFLB
UCBASNS  EQU   UCBFLB
UCBIORST EQU   UCBFLB
UCBQISCE EQU   UCBFL1
UCBACTV  EQU   UCBFL1
UCBSAP   EQU   UCBFL1
UCBNOTRC EQU   UCBCUB
UCBPSNS  EQU   UCBFL1
UCBUSING EQU   UCBPST
UCBNOTRD EQU   UCBNRY
UCBBUSYD EQU   UCBBSY
UCBUA    EQU   UCBCHAN+1
UCBCHA   EQU   UCBCHAN
UCBDADI  EQU   UCBSTAT
UCBSYSR  EQU   UCBSTAT
UCBPRES  EQU   UCBSTAT
UCBALOC  EQU   UCBSTAT
UCBUNLD  EQU   UCBSTAT
UCBRESV  EQU   UCBSTAT
UCBCHGS  EQU   UCBSTAT
UCBONLI  EQU   UCBSTAT
UCBID    EQU   UCBOB+2
UCBALTPH EQU   UCBFL5
UCBALTCU EQU   UCBFL5
UCBNALOC EQU   UCBFL5
UCBENVRD EQU   UCBFL5
UCBVSDR  EQU   UCBFL5
UCBSASK  EQU   UCBFL5
UCBAMV   EQU   UCBAF
UCBDCC   EQU   UCBFL5
UCBMONT  EQU   UCBJBNR
UCBRV011 EQU   UCBJBNR
UCBRSV02 EQU   UCBJBNR
UCBOLDSM EQU   UCBJBNR
UCBRV003 EQU   UCBJBNR
UCBDUC   EQU   UCBJBNR
UCBJES3  EQU   UCBJBNR
UCBVRDEV EQU   UCBJBNR
UCBCMSEG EQU   UCBOB
UCBPFXND EQU   UCB+512
UCBIOQ   EQU   UCB+508
UCBLOCK  EQU   UCB+504
UCBPXST  EQU   UCB+504
@NM00034 EQU   UCB
@NM00009 EQU   SRBSECT+40
@NM00008 EQU   SRBSECT+38
SRBPRIOR EQU   SRBSECT+37
SRBPKF   EQU   SRBSECT+36
SRBSAVE  EQU   SRBSECT+32
SRBPARM  EQU   SRBSECT+28
SRBRMTR  EQU   SRBSECT+24
SRBEP    EQU   SRBSECT+20
SRBPTCB  EQU   SRBFLC+4
SRBPASID EQU   SRBFLC+2
SRBCPAFF EQU   SRBFLC
SRBASCB  EQU   SRBSECT+8
SRBFLNK  EQU   SRBSECT+4
SRBID    EQU   SRBSECT
IOSEND   EQU   IOSB+108
IOSSKR   EQU   IOSEEKA+7
IOSSKH2  EQU   IOSSKHH+1
IOSSKH1  EQU   IOSSKHH
IOSSKCC  EQU   IOSCCHH
IOSSKBB  EQU   IOSEEKA+1
IOSSKM   EQU   IOSEEKA
IOSEEK   EQU   IOSB+92
IOSMDM   EQU   IOSB+91
IOSMDB   EQU   IOSB+90
IOSCKEY7 EQU   IOSCKEY
IOSCKEY6 EQU   IOSCKEY
IOSCKEY5 EQU   IOSCKEY
IOSCKEY4 EQU   IOSCKEY
@NM00004 EQU   IOSCKEY
IOSFMSK  EQU   IOSB+88
IOSCUDEV EQU   IOSPATH+1
@NM00003 EQU   IOSCHN
IOSPATH3 EQU   IOSCHN
IOSPATH2 EQU   IOSCHN
IOSEXP   EQU   IOSCHN
IOSGDP   EQU   IOSCHN
IOSAFF   EQU   IOSB+85
IOSRSS1B EQU   IOSB+84
IOSDSID  EQU   IOSB+80
IOSVST   EQU   IOSB+76
IOSRST   EQU   IOSB+72
IOSABN   EQU   IOSB+64
IOSNRM   EQU   IOSB+60
IOSPCI   EQU   IOSB+56
IOSERP   EQU   IOSB+52
IOSPCHN  EQU   IOSB+48
IOSSNS   EQU   IOSB+42
IOSAPMSK EQU   IOSB+40
IOSRES4A EQU   IOSB+36
IOSUSE   EQU   IOSB+32
IOSSRB   EQU   IOSB+28
IOSCSWRC EQU   IOSCSW+5
IOSTSB   EQU   IOSTATUS+1
IOSTSA   EQU   IOSTATUS
IOSCSWCA EQU   IOSCSW
IOSUCB   EQU   IOSB+16
IOSOPT2X EQU   IOSOPT2
IOSHTP   EQU   IOSOPT2
IOSRELSE EQU   IOSOPT
IOSAPR   EQU   IOSOPT
IOSTSLL  EQU   IOSOPT
IOSNERP  EQU   IOSOPT
IOSPSLL  EQU   IOSOPT
IOSQISCE EQU   IOSOPT
IOSDEP   EQU   IOSOPT
IOSBYP   EQU   IOSOPT
IOSCOD   EQU   IOSB+13
IOSPKY7  EQU   IOSPKEY
IOSPGDPX EQU   IOSPKEY
IOSIDR   EQU   IOSPKEY
IOSLCL   EQU   IOSPKEY
@NM00001 EQU   IOSPKEY
IOSPGAD  EQU   IOSB+8
IOSASID  EQU   IOSB+6
IOSPRLVL EQU   IOSB+5
IOSDVRID EQU   IOSB+4
IOSPROC  EQU   IOSB+3
IOSFLC7  EQU   IOSFLC
IOSFLC6  EQU   IOSFLC
IOSRWAIT EQU   IOSFLC
IOSTP    EQU   IOSFLC
IOSCC3WE EQU   IOSFLC
IOSVERIF EQU   IOSDVALT
IOSDVMNT EQU   IOSFLC
IOSLOG   EQU   IOSFLB
IOSBDCST EQU   IOSFLB
IOSMSG   EQU   IOSFLB
IOSFLB4  EQU   IOSFLB
IOSFLB3  EQU   IOSFLB
IOSFLB2  EQU   IOSFLB
IOSSDR   EQU   IOSFLB
IOSDIESE EQU   IOSFLB
IOSIOSB  EQU   IOSFLA
IOSDOM   EQU   IOSFLA
IOSEX    EQU   IOSFLA
IOSSMDB  EQU   IOSFLA
IOSSMDA  EQU   IOSFLA
IOSERR   EQU   IOSFLA
IOSCCHN  EQU   IOSACHN
IOSDCHN  EQU   IOSACHN
@NM00033 EQU   PSA+3668
PSASTAK  EQU   PSA+3072
@NM00032 EQU   PSA+1048
PSAUSEND EQU   PSA+1048
PSARV062 EQU   PSA+1044
PSACDAL  EQU   PSA+1040
PSAWTCOD EQU   PSA+1036
PSAATCVT EQU   PSA+1032
PSAPCPSW EQU   PSA+1024
PSAPIR2  EQU   PSA+1020
PSARV059 EQU   PSA+1018
PSASVC13 EQU   PSA+1016
PSALSFCC EQU   PSA+1012
PSASFACC EQU   PSA+1008
PSASTOP  EQU   PSA+992
PSASTART EQU   PSA+976
PSARSPSW EQU   PSA+968
PSASRPSW EQU   PSA+960
PSARV045 EQU   PSA+892
PSARV044 EQU   PSA+888
PSARV043 EQU   PSA+884
PSARV042 EQU   PSA+880
PSARV041 EQU   PSA+876
PSARV040 EQU   PSA+872
PSARV025 EQU   PSA+868
PSADSSED EQU   PSA+868
PSADSSPR EQU   PSA+864
PSADSSFW EQU   PSA+860
PSADSS14 EQU   PSA+856
PSADSSPP EQU   PSA+848
PSADSSRP EQU   PSA+840
PSADSS05 EQU   PSADSSF4
PSADSS10 EQU   PSADSSF4
PSADSSVE EQU   PSADSSF4
PSADSSDE EQU   PSADSSF4
PSADSSC0 EQU   PSADSSF4
PSADSSIE EQU   PSADSSF4
PSADSS12 EQU   PSADSSF4
PSADSSRC EQU   PSADSSF4
PSARV057 EQU   PSADSSF3
PSARV056 EQU   PSADSSF3
PSARV055 EQU   PSADSSF3
PSADSSMC EQU   PSADSSF3
PSADSSRW EQU   PSADSSF3
PSADSSNM EQU   PSADSSF3
PSADSSES EQU   PSADSSF3
PSADSSGP EQU   PSADSSF3
PSADSSF2 EQU   PSADSSFL+1
PSADSSPI EQU   PSADSSF1
PSADSSOI EQU   PSADSSF1
PSADSSSP EQU   PSADSSF1
PSADSSTP EQU   PSADSSF1
PSADSSDW EQU   PSADSSF1
PSADSSDD EQU   PSADSSF1
PSADSSDM EQU   PSADSSF1
PSADSSMV EQU   PSADSSF1
PSADSSTS EQU   PSA+816
PSADSSWK EQU   PSA+812
PSADSSR3 EQU   PSA+808
PSADSSR2 EQU   PSA+804
PSADSSRS EQU   PSA+800
PSASTOR  EQU   PSA+796
PSACPUSA EQU   PSA+794
PSAVSTAP EQU   PSA+792
PSAWKVAP EQU   PSA+788
PSAWKRAP EQU   PSA+784
PSAMCHIC EQU   PSA+783
PSARV061 EQU   PSA+782
PSASYMSK EQU   PSA+781
PSAMCHFL EQU   PSA+780
PSACR0   EQU   PSA+776
PSAPSWSV EQU   PSA+768
PSALITA  EQU   PSA+764
PSACLHS  EQU   PSAHLHI
PSALKR15 EQU   PSALKSA+60
PSALKR14 EQU   PSALKSA+56
PSALKR13 EQU   PSALKSA+52
PSALKR12 EQU   PSALKSA+48
PSALKR11 EQU   PSALKSA+44
PSALKR10 EQU   PSALKSA+40
PSALKR9  EQU   PSALKSA+36
PSALKR8  EQU   PSALKSA+32
PSALKR7  EQU   PSALKSA+28
PSALKR6  EQU   PSALKSA+24
PSALKR5  EQU   PSALKSA+20
PSALKR4  EQU   PSALKSA+16
PSALKR3  EQU   PSALKSA+12
PSALKR2  EQU   PSALKSA+8
PSALKR1  EQU   PSALKSA+4
PSALKR0  EQU   PSALKSA
PSARV023 EQU   PSACLHT+52
PSALOCAL EQU   PSACLHT+48
PSACMSL  EQU   PSACLHT+44
PSAOPTL  EQU   PSACLHT+40
PSATPACL EQU   PSACLHT+36
PSATPDNL EQU   PSACLHT+32
PSATPNCL EQU   PSACLHT+28
PSAIOSLL EQU   PSACLHT+24
PSAIOSUL EQU   PSACLHT+20
PSAIOSCL EQU   PSACLHT+16
PSAIOSSL EQU   PSACLHT+12
PSASALCL EQU   PSACLHT+8
PSAASML  EQU   PSACLHT+4
PSADISPL EQU   PSACLHT
PSASRSA  EQU   PSA+636
PSARV050 EQU   PSA+634
PSADSSGO EQU   PSA+633
PSARECUR EQU   PSA+632
PSAHLHIS EQU   PSA+628
PSAIPCSA EQU   PSA+624
@NM00031 EQU   PSA+621
PSAIPCDM EQU   PSA+620
PSAIPCD  EQU   PSA+616
@NM00030 EQU   PSA+613
PSAIPCRM EQU   PSA+612
PSAIPCR  EQU   PSA+608
PSAMCHEX EQU   PSA+600
PSAMPSW  EQU   PSA+592
PSAEXPS2 EQU   PSA+584
PSAEXPS1 EQU   PSA+576
PSAPIREG EQU   PSA+572
PSARSREG EQU   PSA+568
PSAGPREG EQU   PSA+556
PSARV022 EQU   PSASUP4
PSARV021 EQU   PSASUP4
PSARV020 EQU   PSASUP4
PSARV019 EQU   PSASUP4
PSARV018 EQU   PSASUP4
PSARV017 EQU   PSASUP4
PSARV016 EQU   PSASUP4
PSARV015 EQU   PSASUP4
PSARV014 EQU   PSASUP3
PSARV013 EQU   PSASUP3
PSARV012 EQU   PSASUP3
PSARV011 EQU   PSASUP3
PSASPR   EQU   PSASUP3
PSAPSREG EQU   PSASUP3
PSAPI2   EQU   PSASUP3
PSAIOSUP EQU   PSASUP3
PSALCR   EQU   PSASUP2
PSARTM   EQU   PSASUP2
PSAACR   EQU   PSASUP2
PSAIPCE2 EQU   PSASUP2
PSAIPCES EQU   PSASUP2
PSAIPCEC EQU   PSASUP2
PSAGTF   EQU   PSASUP2
PSAIPCRI EQU   PSASUP2
PSARV063 EQU   PSASUP1
PSATCTL  EQU   PSASUP1
PSADISP  EQU   PSASUP1
PSALOCK  EQU   PSASUP1
PSAPI    EQU   PSASUP1
PSAEXT   EQU   PSASUP1
PSASVC   EQU   PSASUP1
PSAIO    EQU   PSASUP1
PSAAOLD  EQU   PSA+548
PSAANEW  EQU   PSA+544
PSATOLD  EQU   PSA+540
PSATNEW  EQU   PSA+536
PSALCCAR EQU   PSA+532
PSALCCAV EQU   PSA+528
PSAPCCAR EQU   PSA+524
PSAPCCAV EQU   PSA+520
PSACPULA EQU   PSA+518
PSAPSA   EQU   PSA+512
FLCHDEND EQU   PSA+512
FLCCRSAV EQU   FLCMCLA+280
FLCGRSAV EQU   FLCMCLA+216
FLCFPSAV EQU   FLCMCLA+184
FLCFLA   EQU   FLCMCLA+88
FLCRGNCD EQU   FLCMCLA+84
FLCFSAA  EQU   FLCFSA+1
@NM00029 EQU   FLCFSA
@NM00028 EQU   FLCMCLA+72
FLCMCIC  EQU   FLCMCLA+64
@NM00027 EQU   FLCMCLA+20
FLCIOAA  EQU   FLCIOA+1
@NM00026 EQU   FLCIOA
@NM00025 EQU   FLCMCLA+15
@NM00024 EQU   FLCMCLA+14
@NM00023 EQU   FLCMCLA+12
FLCLCL   EQU   FLCMCLA+8
FLCIOELA EQU   FLCIOEL+1
@NM00022 EQU   FLCIOEL
FLCCHNID EQU   FLCMCLA
@NM00021 EQU   PSA+160
FLCMTRCD EQU   PSA+157
@NM00020 EQU   PSA+156
FLCPERA  EQU   FLCPER+1
@NM00019 EQU   FLCPER
@NM00018 EQU   PSA+151
FLCPERCD EQU   PSA+150
FLCMCNUM EQU   PSA+149
@NM00017 EQU   PSA+148
FLCTEAA  EQU   FLCTEA+1
@NM00016 EQU   FLCTEA
PSAPIPC  EQU   PSAPICOD
PSAPIMC  EQU   PSAPICOD
PSAPIPER EQU   PSAPICOD
PSARV049 EQU   FLCPICOD
FLCPILCB EQU   FLCPIILC
@NM00015 EQU   FLCPIILC
@NM00014 EQU   PSAEPPSW
FLCSVCN  EQU   PSAESPSW+2
FLCSILCB EQU   FLCSVILC
@NM00013 EQU   FLCSVILC
@NM00012 EQU   PSAESPSW
FLCEICOD EQU   PSAEEPSW+2
PSASPAD  EQU   PSAEEPSW
@NM00011 EQU   PSA+128
FLCINPSW EQU   PSA+120
FLCMNPSW EQU   PSA+112
FLCPNPSW EQU   PSA+104
FLCSNPSW EQU   PSA+96
FLCENPSW EQU   PSA+88
FLCTRACE EQU   PSA+84
FLCTIMER EQU   PSA+80
FLCCVT2  EQU   PSA+76
FLCCAW   EQU   PSA+72
FLCCSW   EQU   PSA+64
FLCIOPSW EQU   PSA+56
FLCMOPSW EQU   PSA+48
FLCPOPSW EQU   PSA+40
FLCSOPSW EQU   PSA+32
FLCEOPSW EQU   PSA+24
@NM00010 EQU   FLCICCW2+4
FLCCVT   EQU   FLCICCW2
FLCICCW1 EQU   FLCROPSW
FLCIPPSW EQU   FLCRNPSW
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS
@RC00592 EQU   @RC00591
@RF00676 EQU   CONPSTAT
@ENDDATA EQU   *
         END   ISTZFM3B,(C'PLS1858',0603,78005)
