<NODE=&NODE×>
<SOC=&SOC×>
<FROM=&FROM×>
<TO=&TO×>
<PRT=&PRT×>
)SEL &RPRT = Y
REPORT=PRT
)ENDSEL
)SEL &RSOC = Y
REPORT=SOC
)ENDSEL
)SEL &RJOB = Y
REPORT=JOB
)ENDSEL
)SEL &RNJE = Y
REPORT=NJE
)ENDSEL
END
