FCB2F900 CSECT
*
*     SPECIAL PRINTER SPACING ARRAY,  10/20/82, R. VIERREGGER
*     FOR THE FOLLOWING SPECIAL FORMS:
*
*       CALGARY TIME CARDS
*
         DC    X'00'     IT'S A SPECIAL SPACING ARRAY
         DC    AL1(22)   22 LINES PER PAGE
         DC    X'01000000000000000000' CHNL 1 (TOP OF FORM) AT LINE 1
         DC    X'00000000000000000000'
         DC    X'0010'
         END
