./       ADD   NAME=LA00018B
//SSUD018B JOB (M,AJNJ,S610C021),04542HMD,CLASS=A,NOTIFY=SSUD,
//   MSGCLASS=O ,TYPRUN=HOLD
//*ACCT        HOWARD DEAN,SSU
/*ROUTE  PRINT U90
/*JOBPARM L=999,S=*
//***
//***    SYS PROG: H. M. DEAN
//***    DATE:     04/15/83
//***    LOCATION: SYST.LOCLMODS.CNTL(LA00018B)
//***    DESC:     DYNAMIC BLDL SVC HOOK LOCAL MOD
//***
//***              DUMMY ZAP FOR DYNAMIC BLDL TO
//***              LET SMP KNOW THAT IGC018 (BLDL SVC)
//***              WAS HIT BY SYSTEM MAINTAINCE. THIS
//***              IS BECAUSE WHENEVER IGC018 IS HIT,
//***              DYNAMIC BLDL WILL HAVE TO BE REFITTED AND
//***              INSTALLED AGAIN.
//***
//***              THIS MODIFICATION IS FOR FMID JDM1134 ONLY
//***
//***
//SMP      EXEC PUTSMP,OPT=200,REGION=3700K
//SMPCNTL  DD *
   APPLY   S(LA00018) DIS(WRITE).
//SMPPTFIN DD DATA,DLM=$$
++ USERMOD (LA00018) /* DYNAMIC BLDL MODIFICATION
     *****************************************************************
     *                                                               *
     *       GTEDS: MARINA DEL REY, CALIFORNIA                       *
     *                                                               *
     *       DATE:  04/15/83  BY: H.M. DEAN                          *
     *                                                               *
     *       RELEASE         - OS/MVS 3.8                            *
     *       ENVIRONMENT     - 16MB IBM 3033, 16MB AMDAHL V8         *
     *                         24MB IBM 3081                         *
     *                                                               *
     *       PTF LEVEL       - 8301 (FMID JDM1134)                   *
     *                                                               *
     *       USERMOD         - LA00018                               *
     *       JOBNAME         - SSUD018B                              *
     *       TYPE            - MOD/ZAP                               *
     *                                                               *
     *       PRODUCT         - DF/DS (JDM1134)                       *
     *       LMOD            - IGC018XX                              *
     *       MOD (CSECT)     - IGC018XX                              *
     *       ZAP (CSECT)     - IGC018                                *
     *                                                               *
     *       PROBLEM         - TOO MUCH I/O TO SYSTEM LIBRARY PACKS  *
     *                         TO READ LINKLIST DIRECTORIES.         *
     *                                                               *
     *       PURPOSE/        - DYNAMIC BLDL IS A MEANS OF KEEPING    *
     *       ENHANCEMENT       AN INCORE LIST OF THE DIRECTORIES OF  *
     *                         LINKLIST LIBRARIES. THIS LIST IS      *
     *                         UPDATED AS MODULES ARE ACCESSED.      *
     *                         THUS, THE AMOUND OF I/O TO SYSTEM     *
     *                         LINKLIST LIBRARIES IS REDUCED BY      *
     *                         SOMETIMES MORE THAN 90 PERCENT.       *
     *                                                               *
     *                         IGC018XX - THE DYNNAMIC BLDL SVC HOOK *
     *                         IS INSTALLED INTO SYS1.LINKLIB AND    *
     *                         DYNAMICALLY INITIALIZED AT IPL TIME.  *
     *                                                               *
     *                         A DUMMY ZAP IS MADE TO IGC018 (BLDL)  *
     *                         SO THAT SMP WILL PUT OUT REGRESSION   *
     *                         MESSAGES WHEN MAINTAINCE HITS BLDL.   *
     *****************************************************************
     */.
++ VER (Z038) FMID(JDM1134) PRE(UZ57894) /* TAPE 8208 */.
++ JCLIN.
//SYSGEN1 JOB 1,'SYSTEM GENERATION',MSGLEVEL=1
//SG98    EXEC PGM=IEWL,
//  PARM='NCAL,LIST,XREF,LET,MAP'
//SYSPRINT DD SYSOUT=*
//SYSLMOD  DD DSN=SYS1.LINKLIB,DISP=SHR,UNIT=DISK,VOL=SER=ITST1A
//AOSD0    DD DSN=SYS1.AOSD0,DISP=SHR,UNIT=DISK,VOL=SER=DLIB01
//SYSLIN   DD *
 INCLUDE AOSD0(IGC018XX)     LA00018 - DYNAMIC BLDL
 ENTRY   IGC018XX            LA00018 - DYNAMIC BLDL
 NAME    IGC018XX(R)         LA00018 - DYNAMIC BLDL
++ MOD (IGC018XX) DISTLIB(AOSD0) LKLIB(LOCLLOAD).
++ ZAP (IGC018)   DISTLIB(AOSD0)            /* BLDL SVC */.
NAME IGC018
********************************************************
*** NOTE THAT THIS IS A DUMMY ZAP                     **
*** TO LET SMP KNOW THAT BLDL WAS                     **
*** HIT. REFIT BY REPLACING THE 1ST                   **
*** 1 1/2 INSTRUCTIONS WITH THEMSELVES.               **
***                                                   **
*** THE PURPOSE OF THIS IS SO THAT MODIFICATIONS      **
*** TO IGC018 CAN BE FLAGGED FOR REFITTING DYNAMIC    **
*** BLDL LOCAL MOD LA00018                            **
***                                                   **
*** INSTALLED 05/04/81 - HOWARD M. DEAN               **
*** UPDATED   01/24/82 - HOWARD M. DEAN               **
*** UPDATED   06/24/82 - HOWARD M. DEAN               **
*** UPDATED   12/09/82 - HOWARD M. DEAN               **
*** UPDATED   04/15/83 - HOWARD M. DEAN               **
********************************************************
VER  0000 05C0,47F0       VERIFY BALR AND BRANCH AROUND ID
REP  0000 05C0,47F0       REPLACE WITH THE SAME
IDRDATA LA00018           IDENTIFY ZAP
$$
//
./       ADD   NAME=LA00052B
//SSUH052B JOB (M,AJNJ,S610C021),04542HMD,CLASS=A,NOTIFY=SSUH,
//   MSGCLASS=O TYPRUN=HOLD
//*ACCT        HOWARD DEAN,SSU
/*ROUTE  PRINT U98
/*JOBPARM L=999,S=*
//***
//***    SYS PROG: HOWARD DEAN
//***    DATE:     11/11/82
//***    LOCATION: SYST.LOCLMODS.CNTL(LA00052B)
//***    DESC:     VTAM NPDA TABLE ISTMGC00
//***
//SMP      EXEC PUTSMP,OPT=200
//SMPCNTL  DD *
   RESTORE S(LA00052) DIS(WRITE).
   RECEIVE S(LA00052).
   APPLY   S(LA00052) DIS(WRITE).
//SMPPTFIN DD DATA,DLM=$$
++ USERMOD (LA00052)  /* VTAM NPDA TABLE
     *****************************************************************
     *                                                               *
     *       GTEDS: MARINA DEL REY, CALIFORNIA                       *
     *                                                               *
     *       DATE:  11/13/82 BY: H. M. DEAN                          *
     *                                                               *
     *       RELEASE         - OS/MVS 3.8                            *
     *       ENVIRONMENT     - 16MB IBM 3033, 16MB AMDAHL V8         *
     *                       - 24MB IBM 3081                         *
     *                                                               *
     *       PTF LEVEL       - 8207 (FMID JVT1212)                   *
     *                                                               *
     *       USERMOD         - LA00052                               *
     *       JOBNAME         - SSUH052B                              *
     *       TYPE            - MOD                                   *
     *                                                               *
     *       PRODUCT         - NETWORK PROB DETERMINATION AID (NPDA) *
     *                                                               *
     *       LMOD            - ISTMGC00                              *
     *       MOD (CSECT)     - ISTMGC00                              *
     *                                                               *
     *       PURPOSE         - PROVIDE NEEDED TABLE FOR NPDA         *
     *                         OPERATION UNDER ACF VTAM              *
     *                                                               *
     *                                                               *
     *****************************************************************
     */.
++ VER (Z038) FMID(HVT2102)   /* ACF VTAM VER 2.1 */.
++ JCLIN.
//S1    EXEC PGM=IEWL,PARM=MAP,LIST,LET,XREF,REUS'
//SYSPRINT DD SYSOUT=*
//SYSUT1   DD UNIT=SYSDA,SPACE=(CYL,1)
//SYSLMOD  DD DSN=SYS1.VTAMLIB,DISP=SHR
//AOS26    DD DSN=SYS1.AOS26,DISP=SHR
//SYSLIN   DD *
 INCLUDE AOS26(ISTMGC00)
 ENTRY ISTMGC00
 NAME  ISTMGC00(R)
++MOD(ISTMGC00) DISTLIB(AOS26) TXLIB(LOCLOBJ).
$$
//
./       ADD   NAME=LA00053B
//SSUD053B JOB (M,AJNJ,S610C021),04542HMD,CLASS=K,NOTIFY=SSUD,
//   MSGCLASS=A ,TYPRUN=HOLD
//*ACCT        HOWARD DEAN,SSU
/*ROUTE  PRINT U90
/*JOBPARM L=999,S=*
//***
//***    SYS PROG: HOWARD DEAN
//***    DATE:     11/09/82
//***    LOCATION: SYST.LOCLMODS.CNTL(LA00053B)
//***    DESC:     INSTALL NCCF PF KEY EXIT DSIEX01
//***
//SMP      EXEC PUTSMP,OPT=200
//SMPCNTL  DD *
   RESTORE S(LA00053) DIS(WRITE).
   RECEIVE S(LA00053).
   APPLY   S(LA00053) DIS(WRITE).
//SMPPTFIN DD DATA,DLM=$$
++ USERMOD (LA00053)   /*  NCCF PF KEY EXIT
     *****************************************************************
     *                                                               *
     *       GTEDS: MARINA DEL REY, CALIFORNIA                       *
     *                                                               *
     *       DATE:  11/11/82  BY: H.M. DEAN                          *
     *                                                               *
     *                                                               *
     *                                                               *
     *       RELEASE         - OS/MVS 3.8                            *
     *       ENVIRONMENT     - 16MB IBM 3033, 16MB AMDAHL V8         *
     *                       - 24MB IBM 3081                         *
     *                                                               *
     *       PTF LEVEL       - 8207 (FMID HCS1502)                   *
     *                                                               *
     *       USERMOD         - LA00053                               *
     *       JOBNAME         - SSUD053B                              *
     *       TYPE            - MOD                                   *
     *                                                               *
     *       PRODUCT         - NCCF REL 2.0 (HCS1502)                *
     *                                                               *
     *       LMOD            - DSIEX01                               *
     *       MOD (CSECT)     - DSIEX01                               *
     *                                                               *
     *       PROBLEM         - NCCF DOES NOT SUPPORT PF KEYS         *
     *                         PROPERLY.                             *
     *                                                               *
     *       ENHANCEMENT     - PROVIDE A USER EXIT TO PROPERLY       *
     *                         HANDLE USE PF KEY ASSIGNMENTS.        *
     *                                                               *
     *****************************************************************
     */.
++ VER (Z038) FMID(HCS1502)   /* NETWORK COMM CONTROL FACILITY */.
++ JCLIN.
//SYSGEN01   JOB 1,'SYSTEM GENERATION',MSGLEVEL=1
//SG1        EXEC PGM=IEWL,PARM='MAP,LIST,XREF,LET'
//SYSPRINT   DD   SYSOUT=*
//SYSUT1     DD   UNIT=SYSDA,SPACE=(CYL,1)
//AOS27      DD   DSN=SYS1.AOS27,DISP=SHR
//SYSLMOD    DD   DSN=SYS1.LINKLIB,DISP=SHR
//SYSLIN     DD   *
  INCLUDE AOS27(DSIEX01)
  ENTRY   DSIEX01
  NAME    DSIEX01(R)
++MOD (DSIEX01) DISTLIB(AOS27) TXLIB(LOCLOBJ).
$$
./       ADD   NAME=LA00054A
//SSUB054A JOB (M,AJNJ,S610C021),04542HMD,CLASS=A,NOTIFY=SSUB,
//   MSGCLASS=O
//*ACCT        HOWARD DEAN,SSU
/*ROUTE  PRINT U90
/*JOBPARM L=300,S=ANY
//***
//***    PRINTER 9 IS DATAGRAPHIC AUTOCOM FOR MICROFICHE
//***
//***    SYS PROG: H.M. DEAN
//***    DATE:     06/24/82
//***    LOCATION: SYST.LOCLMODS.CNTL(LA00054A)
//***    DESC:     UPDATE PROGRAM PROPERTIES TABLE (PPT)
//***
//*******************************************************************
//***  WARNING  WARNING WARNING WARNING WARNING WARNING WARNING
//***    ×        ×       ×        ×       ×       ×      ×
//***    ×        ×       ×        ×       ×       ×      ×
//***    V        V       V        V       V       V      V
//***    D O    N O T    R E N U M B E R    T H I S    M O D
//***    I T    C O N T A I N S  A  M A C R O    U P D A T E
//***  USE NONUM TO EDIT OR SPF ---- DO NOT RENUMBER ---------------
//********************************************************************
//SMP      EXEC PUTSMP,OPT=200
//SMPCNTL  DD *
   RESTORE S(LA00054) DIS(WRITE).
   RECEIVE S(LA00054).
   APPLY   S(LA00054) DIS(WRITE).
//SMPPTFIN DD DATA,DLM=$$
++USERMOD(LA00054) /*  PROGRAM PROPERTIES TABLE
     *****************************************************************
     *                                                               *
     *       GTEDS: MARINA DEL REY, CALIFORNIA                       *
     *                                                               *
     *       DATE:  06/24/82  BY: H.M. DEAN                          *
     *                                                               *
     *       RELEASE         - OS/MVS 3.8                            *
     *       ENVIRONMENT     - 12MB IBM 3033, 12MB AMDAHL V8         *
     *                       - 8MB IBM 3033N                         *
     *                                                               *
     *       PTF LEVEL       - 8204                                  *
     *                                                               *
     *       USERMOD         - LA00054                               *
     *       JOBNAME         - SSUD054A                              *
     *       TYPE            - MACUPD                                *
     *                                                               *
     *       PRODUCT         - PPT OR PROGRAM PROPERTIES TABLE       *
     *       MACUPD          - SGIEF0PT                              *
     *       CSECT           - IEFSDPPT                              *
     *                                                               *
     *       PROBLEM         - CERTAIN PRIVILEGED PROGRAMS REQUIRE   *
     *                         SPECIAL PROPERTIES TO PROPERLY        *
     *                         EXECUTE. ALSO, IBM DEFAULT PROPERTIES *
     *                         MAY NOT BE ADEQUATE.                  *
     *                                                               *
     *       PURPOSE/        - UPDATE SYSGEN MACRO TO CREATE         *
     *       ENHANCEMENT       SPECIAL PROGRAM PROPERTIES OR UPDATE  *
     *                         DEFAULT IBM PROPERTIES.               *
     *                                                               *
     *****************************************************************
     */.
++VER(Z038) FMID(JBB1326) /* MVS SP 1.3 VERSION OF PPT MACRO */.
++ MACUPD (SGIEF0PT)      /* PROGRAM PROPERTIES TABLE        */.
./ CHANGE NAME=SGIEF0PT
         DC    AL1(PPTSKEY+PPTNSWP+PPTNOPAS+PPTSYSTK)           LA00054
*              MAKE VTAM CANCELLABLE                            LA00054
         DC    CL8'GTFCCW'                                      LA00054
*              CHANGE HHLGTF TO GTFCCW                          LA00054
         DC    AL1(PPTNCNCL+PPTSKEY+PPTNOPAS)                   LA00054
*              EXTERNAL WRITER SPECIAL PROPERTIES               LA00054
         DC    AL1(PPTSKEY+PPTNSWP)                             LA00054
*              REMOVE SYSTEM TASK CRITERIA FROM IMS             LA00054
         EJECT                                                  LA00054
*************************************************************** LA00054
**           G T E    D A T A    S E R V I C E S             ** LA00054
**    P R O G R A M    P R O P E R T I E S    T A B L E      ** LA00054
**                   A D D I T I O N S                       ** LA00054
*************************************************************** LA00054
         DC    CL8'HASPJESA'       ALTERNATE JES2               LA00054
         DC    AL1(PPTNCNCL+PPTSKEY+PPTNSWP+PPTSYSTK+PPTNOPAS+PPTNDSI)
         DC    AL1(PPTKEY1)                                     LA00054
         DC    X'FFFF'                                          LA00054
         DC    AL1(PPT2LPU+PPT1LPU)                             LA00054
         DC    XL3'0'                                           LA00054
         SPACE 1                                                LA00054
         DC    CL8'HASJES2T'       ALTERNATE JES2               LA00054
         DC    AL1(PPTNCNCL+PPTSKEY+PPTNSWP+PPTSYSTK+PPTNOPAS+PPTNDSI)
*                                                               LA00054
         DC    AL1(PPTKEY1)                                     LA00054
         DC    X'FFFF'                                          LA00054
         DC    AL1(PPT2LPU+PPT1LPU)                             LA00054
         DC    XL3'0'                                           LA00054
         SPACE 1                                                LA00054
         DC    CL8'TCAM06'                                      LA00054
         DC    AL1(PPTSKEY+PPTNSWP+PPTNOPAS)                    LA00054
         DC    AL1(PPTKEY6)                                     LA00054
         DC    X'FFFF'                                          LA00054
         DC    AL1(PPT2LPU+PPT1LPU)                             LA00054
         DC    XL3'0'                                           LA00054
         SPACE 1                                                LA00054
         DC    CL8'TCAM07'                                      LA00054
         DC    AL1(PPTSKEY+PPTNSWP+PPTNOPAS)                    LA00054
         DC    AL1(PPTKEY6)                                     LA00054
         DC    X'FFFF'                                          LA00054
         DC    AL1(PPT2LPU+PPT1LPU)                             LA00054
         DC    XL3'0'                                           LA00054
         SPACE 1                                                LA00054
         DC    CL8'TCAM08'     REPLACES 'SPACE' IN ORIGINAL PPT LA00054
         DC    AL1(PPTSKEY+PPTNSWP+PPTNOPAS)                    LA00054
         DC    AL1(PPTKEY6)                                     LA00054
         DC    X'FFFF'                                          LA00054
         DC    AL1(PPT2LPU+PPT1LPU)                             LA00054
         DC    XL3'0'                                           LA00054
         SPACE 1                                                LA00054
         DC    CL8'TCAM09'                                      LA00054
         DC    AL1(PPTSKEY+PPTNSWP+PPTNOPAS)                    LA00054
         DC    AL1(PPTKEY6)                                     LA00054
         DC    X'FFFF'                                          LA00054
         DC    AL1(PPT2LPU+PPT1LPU)                             LA00054
         DC    XL3'0'                                           LA00054
         SPACE 1                                                LA00054
         DC    CL8'TCAM10'                                      LA00054
         DC    AL1(PPTSKEY+PPTNSWP+PPTNOPAS)                    LA00054
         DC    AL1(PPTKEY6)                                     LA00054
         DC    X'FFFF'                                          LA00054
         DC    AL1(PPT2LPU+PPT1LPU)                             LA00054
         DC    XL3'0'                                           LA00054
         SPACE 1                                                LA00054
C018201  DC    CL8'ASOSINTF'     ASOS INTERFACE - 01/82 - HMD   LA00054
         DC    AL1(PPTNSWP)      MAKE IT NON-SWAPPABLE          LA00054
         DC    AL1(0)                                           LA00054
         DC    X'FFFF'                                          LA00054
         DC    AL1(PPT2LPU+PPT1LPU)                             LA00054
         DC    XL3'0'                                           LA00054
         SPACE 1                                                LA00054
C018203  DC    CL8'DUMPEM'       IEHDASDR - TO ALLOW VOL DUMP   LA00054
         DC    AL1(PPTNOPAS)     BYPASS SECURITY CHECKING       LA00054
         DC    AL1(0)                                           LA00054
         DC    X'FFFF'                                          LA00054
         DC    AL1(PPT2LPU+PPT1LPU)                             LA00054
         DC    XL3'0'                                           LA00054
         SPACE 1                                                LA00054
C062482  DC    CL8'DSSDUMP'      ADRDSSU - TO ALLOW VOL DUMP    LA00054
         DC    AL1(PPTNOPAS)     BYPASS SECURITY CHECKING       LA00054
         DC    AL1(0)                                           LA00054
         DC    X'FFFF'                                          LA00054
         DC    AL1(PPT2LPU+PPT1LPU)                             LA00054
         DC    XL3'0'                                           LA00054
         SPACE 1                                                LA00054
         DC    CL8'IEWL'                                        LA00054
         DC    AL1(PPTNSWP)                                     LA00054
         DC    AL1(0)                                           LA00054
         DC    X'FFFF'                                          LA00054
         DC    AL1(PPT2LPU+PPT1LPU)                             LA00054
         DC    XL3'0'                                           LA00054
         SPACE 1                                                LA00054
         DC    CL8'HEWLF064'                                    LA00054
         DC    AL1(PPTNSWP)                                     LA00054
         DC    AL1(0)                                           LA00054
         DC    X'FFFF'                                          LA00054
         DC    AL1(PPT2LPU+PPT1LPU)                             LA00054
         DC    XL3'0'                                           LA00054
         SPACE 1                                                LA00054
         DC    CL8'AUB00300'                                    LA00054
         DC    AL1(PPTSKEY+PPTPRIV+PPTSYSTK+PPTNDSI+PPTNOPAS)   LA00054
         DC    AL1(PPTKEY0)                                     LA00054
         DC    X'FFFF'                                          LA00054
         DC    AL1(PPT2LPU+PPT1LPU)                             LA00054
         DC    XL3'0'                                           LA00054
         SPACE 1                                                LA00054
         DC    CL8'BATRN030'                                    LA00054
         DC    AL1(PPTNSWP)                                     LA00054
         DC    AL1(0)                                           LA00054
         DC    X'FFFF'                                          LA00054
         DC    AL1(PPT2LPU+PPT1LPU)  REPL COMMENT IN ORIG PPT   LA00054
         DC    XL3'0'                                           LA00054
         SPACE 1                                                LA00054
         DC    CL8'BATRM030'                                    LA00054
         DC    AL1(PPTNSWP)                                     LA00054
         DC    AL1(0)                                           LA00054
         DC    X'FFFF'                                          LA00054
         DC    AL1(PPT2LPU+PPT1LPU)                             LA00054
         DC    XL3'0'                                           LA00054
         SPACE 1                                                LA00054
         DC    CL8'BATRJ030'                                    LA00054
         DC    AL1(PPTNSWP)                                     LA00054
         DC    AL1(0)                                           LA00054
         DC    X'FFFF'                                          LA00054
         DC    AL1(PPT2LPU+PPT1LPU)                             LA00054
         DC    XL3'0'                                           LA00054
         SPACE 1                                                LA00054
         DC    CL8'BATRK030'                                    LA00054
         DC    AL1(PPTNSWP)                                     LA00054
         DC    AL1(0)                                           LA00054
         DC    X'FFFF'                                          LA00054
         DC    AL1(PPT2LPU+PPT1LPU)                             LA00054
         DC    XL3'0'                                           LA00054
         SPACE 1                                                LA00054
         DC    CL8'BATRL030'                                    LA00054
         DC    AL1(PPTNSWP)                                     LA00054
         DC    AL1(0)                                           LA00054
         DC    X'FFFF'                                          LA00054
         DC    AL1(PPT2LPU+PPT1LPU)                             LA00054
         DC    XL3'0'                                           LA00054
         SPACE 1                                                LA00054
A018202  DC    CL8'INASIRMI'   DATA LINK SOFTWARE (DLS) - HMD   LA00054
         DC    AL1(PPTNSWP)    MAKE NON-SWAPPABLE               LA00054
         DC    AL1(0)                                           LA00054
         DC    X'FFFF'                                          LA00054
         DC    AL1(PPT2LPU+PPT1LPU)                             LA00054
         DC    XL3'0'                                           LA00054
         SPACE 1                                                LA00054
         DC    CL8'IFLOADRN'                                    LA00054
         DC    AL1(PPTNSWP)                                     LA00054
         DC    AL1(0)                                           LA00054
         DC    X'FFFF'                                          LA00054
         DC    AL1(PPT2LPU+PPT1LPU)                             LA00054
         DC    XL3'0'                                           LA00054
         SPACE 1                                                LA00054
         DC    CL8'ERBMFMFC'                  RMF               LA00054
         DC    AL1(PPTPRIV+PPTSYSTK)                            LA00054
         DC    AL1(0)                                           LA00054
         DC    X'FFFF'                                          LA00054
         DC    AL1(PPT2LPU+PPT1LPU)                             LA00054
         DC    XL3'0'                                           LA00054
         SPACE 1                                                LA00054
C018202  DC    CL8'CICS'               ALTERNATE NAME FOR CICS  LA00054
         DC    AL1(PPTSKEY+PPTNSWP)    RUN IN KEY 6 AND NO SWAP LA00054
         DC    AL1(PPTKEY6)                                     LA00054
         DC    X'FFFF'                                          LA00054
         DC    AL1(PPT2LPU+PPT1LPU)                             LA00054
         DC    XL3'0'                                           LA00054
         SPACE 1                                                LA00054
A018201  DC    CL8'DFHSIP'             REAL NAME FOR CICS 1.5   LA00054
         DC    AL1(PPTSKEY+PPTNSWP)    RUN IN KEY 6 AND NO SWAP LA00054
         DC    AL1(PPTKEY6)                                     LA00054
         DC    X'FFFF'                                          LA00054
         DC    AL1(PPT2LPU+PPT1LPU)                             LA00054
         DC    XL3'0'                                           LA00054
         SPACE 1                                                LA00054
         DC    CL8'ITPENTER'                                    LA00054
         DC    AL1(PPTNSWP)                                     LA00054
         DC    AL1(0)                                           LA00054
         DC    X'FFFF'                                          LA00054
         DC    AL1(PPT2LPU+PPT1LPU)                             LA00054
         DC    XL3'0'                                           LA00054
         SPACE 1                                                LA00054
         DC    CL8'ACFMAIN'       ACF SECURITY SYSTEM           LA00054
         DC    AL1(PPTNCNCL+PPTSKEY+PPTSYSTK+PPTNOPAS)          LA00054
         DC    AL1(PPTKEY1)       RUN IN SAME KEY AS JES2       LA00054
         DC    X'FFFF'                                          LA00054
         DC    AL1(PPTN2LP)                                     LA00054
         DC    XL3'0'                                           LA00054
         SPACE 1                                                LA00054
         DC    CL8'$MIGRATE'      ASM2 PROGRAM                  LA00054
         DC    AL1(PPTNOPAS)      BYPASS PASSWORD PROTECTION    LA00054
         DC    AL1(0)                                           LA00054
         DC    X'FFFF'                                          LA00054
         DC    AL1(PPT2LPU+PPT1LPU)                             LA00054
         DC    XL3'0'                                           LA00054
         SPACE 1                                                LA00054
         DC    CL8'$MCLMVR'       ASM2 PROGRAM                  LA00054
         DC    AL1(PPTNOPAS)      BYPASS PASSWORD PROTECTION    LA00054
         DC    AL1(0)                                           LA00054
         DC    X'FFFF'                                          LA00054
         DC    AL1(PPT2LPU+PPT1LPU)                             LA00054
         DC    XL3'0'                                           LA00054
         SPACE 1                                                LA00054
         DC    CL8'$ARCHIVE'      ASM2 PROGRAM                  LA00054
         DC    AL1(PPTNOPAS)      BYPASS PASSWORD PROTECTION    LA00054
         DC    AL1(0)                                           LA00054
         DC    X'FFFF'                                          LA00054
         DC    AL1(PPT2LPU+PPT1LPU)                             LA00054
         DC    XL3'0'                                           LA00054
         SPACE 1                                                LA00054
         DC    CL8'$DASDMNT'      ASM2 PROGRAM                  LA00054
         DC    AL1(PPTNOPAS)      BYPASS PASSWORD PROTECTION    LA00054
         DC    AL1(0)                                           LA00054
         DC    X'FFFF'                                          LA00054
         DC    AL1(PPT2LPU+PPT1LPU)                             LA00054
         DC    XL3'0'                                           LA00054
         SPACE 1                                                LA00054
         DC    CL8'$ASMBMON'      ASM2 PROGRAM                  LA00054
         DC    AL1(PPTNOPAS)      BYPASS PASSWORD PROTECTION    LA00054
         DC    AL1(0)                                           LA00054
         DC    X'FFFF'                                          LA00054
         DC    AL1(PPT2LPU+PPT1LPU)                             LA00054
         DC    XL3'0'                                           LA00054
         SPACE 1                                                LA00054
         DC    CL8'$BACKUP'       ASM2 PROGRAM                  LA00054
         DC    AL1(PPTNOPAS)      BYPASS PASSWORD PROTECTION    LA00054
         DC    AL1(0)                                           LA00054
         DC    X'FFFF'                                          LA00054
         DC    AL1(PPT2LPU+PPT1LPU)                             LA00054
         DC    XL3'0'                                           LA00054
         SPACE 1                                                LA00054
         DC    CL8'$COPYTP'       ASM2 PROGRAM                  LA00054
         DC    AL1(PPTNOPAS)      BYPASS PASSWORD PROTECTION    LA00054
         DC    AL1(0)                                           LA00054
         DC    X'FFFF'                                          LA00054
         DC    AL1(PPT2LPU+PPT1LPU)                             LA00054
         DC    XL3'0'                                           LA00054
         EJECT                                                  LA00054
* THE NEXT FIVE ENTRIES CAN BE USED FOR ADDTL PROGRAM NAMES     LA00054
./  ENDUP
./       ADD   NAME=LA00075A
//SSUD075A  JOB (M,AJNJ,S610C021),04542HMD,CLASS=B,
//   MSGCLASS=G,NOTIFY=SSUD
//*ACCT        HOWARD DEAN,SSU
/*ROUTE  PRINT LOCAL
/*JOBPARM LINES=999,SYSAFF=ANY
//***
//***    SYS PROG:   H.M. DEAN
//***    DATE:       10/02/81
//***    LOCATION:   SYST.LOCLMODS.CNTL(LA00075A)
//***    DESC:       SZAP LPALIB (IGG01921,IGG0192A)
//***                IGG0192A -- DON'T ABEND WHEN LOAD MODE DISP=SHR
//***                IGG01921 -- CIRCUMVENT ISAM DISP=SHR S03B
//***
//SMP       EXEC PUTSMP,TIME=300
//SMPCNTL   DD  *
   RESTORE S(LA00075) .
   RECEIVE S(LA00075) .
   APPLY   S(LA00075) .
//SMPPTFIN  DD  DATA,DLM=$$
++ USERMOD (LA00075)  /*
     *****************************************************************
     *                                                               *
     *       GTEDS: MARINA DEL REY, CALIFORNIA                       *
     *                                                               *
     *       DATE: 10/02/81  BY: H.M. DEAN                           *
     *                                                               *
     *                                                               *
     *       RELEASE         - OS/MVS 3.8                            *
     *       ENVIRONMENT     - 12MB IBM 3033, 12MB AMDAHL V8         *
     *                          8MB IBM 3033N                        *
     *                                                               *
     *       PTF LEVEL       - 8106                                  *
     *                                                               *
     *       USERMOD         - LA00075A                              *
     *       JOBNAME         - SSUD075A                              *
     *       TYPE            - ZAP                                   *
     *                                                               *
     *       PRODUCT         - INDEXED SEQUENTIAL ACCESS METHOD      *
     *       MOD             - IGG0192A,IGG01921                     *
     *       LMOD            - IGG0192A,IGG01921                     *
     *                                                               *
     *                                                               *
     *       PURPOSE/        - IGG0192A DON'T ABEND IF LOAD MODE     *
     *       ENHANCEMENT                DISP=SHR                     *
     *                         IGG01921 CIRCUMVENT ISAM DISP=SHR     *
     *                                  S03B                         *
     *                                                               *
     *****************************************************************
     */ .
++ VER (Z038) FMID(EDM1102) PRE(UZ90073,UZ34839).
++ ZAP (IGG0192A)                     /*  AOSD8 R3.8 MOD=IGG0192A
*****
**** DONT ABEND WHEN LOAD MODE DISP=SHR
****
****                                         */.
NAME IGG0192A
VER 0150 4710,319A
REP 0150 4700,319A
IDRDATA LA00075
++ ZAP (IGG01921)      /*   AOSD8 UZ90073 LEVEL 8001 LMOD=IGG01921
*****
***** CIRCUMVENT 03B IN ISAM WHEN LOADING WITHOUT DISP=OLD
****
****                                        */.
NAME IGG01921
VER 0176 9140,40BB,4710,31AE
REP 0176 9140,40BB,4770,31AE
IDRDATA LA000075
$$
//
./       ADD   NAME=LA00086B
//SSUD086B JOB (M,AJNJ,S610C021),04542HMD,CLASS=K,NOTIFY=SSUD,
//   MSGCLASS=O
//*ACCT        HOWARD DEAN,SSU
/*ROUTE  PRINT U90
/*JOBPARM L=999,S=ANY
//*********************************************************************
//***  D O    N O T    R E N U M B E R    T H I S    U S E R M O D   **
//*********************************************************************
//***
//***    SYS PROG: HOWARD M. DEAN
//***    DATE:     11/13/82
//***    LOCATION: SYST.LOCLMODS.CNTL(LA00086B)
//***    DESC:     GTEDS LOCAL MODIFICATIONS TO
//***              THE SYSTEM PRODUCTIVITY FACILITY (SPF)
//***
//***              (1) ADD MOD SPFCOPY - IEBCOPY INTERFACE
//***              (2) UPDATE MOD ISPTCM - TSO COMMAND TABLE
//***              (3) ADD HELP TEXT FOR SPF COMMAND PROCESSOR
//***
//***  WARNING!!! - DO NOT RENUMBER THIS USERMOD...
//***               IT CONTAINS A MACRO UPDATE WHICH WILL BE RUINED
//***               IF RENUMBERING OCCURS
//***
//SMP      EXEC PUTSMP,OPT=200
//SMPCNTL  DD *
   RESTORE S(LA00086) DIS(WRITE).
   RECEIVE S(LA00086).
   APPLY   S(LA00086) DIS(WRITE).
//SMPPTFIN DD DATA,DLM=$$
++ USERMOD (LA00086)  /* SPF II (HPF1102) LOCAL MOD
     *****************************************************************
     *                                                               *
     *       GTEDS: MARINA DEL REY, CALIFORNIA                       *
     *                                                               *
     *       DATE:  11/13/82  BY: H.M. DEAN                          *
     *                                                               *
     *                                                               *
     *                                                               *
     *       RELEASE         - OS/MVS 3.8                            *
     *       ENVIRONMENT     - 16MB IBM 3033, 16MB AMDAHL V8         *
     *                       - 24MB IBM 3081                         *
     *                                                               *
     *       PTF LEVEL       - 8207                                  *
     *                                                               *
     *       USERMOD         - LA00086                               *
     *       JOBNAME         - SSUD086B                              *
     *       TYPE            - MOD,MAC                               *
     *                                                               *
     *       PRODUCT         - SYSTEM PRODUCTIVITY FACILITY          *
     *       LMOD            - SPFCOPY, ISPTCM                       *
     *       MOD(CSECT)      - SPFCOPY, ISPTCM
     *       MAC             - SPF (HELP TEXT FOR SPF)               *
     *                                                               *
     *       PROBLEM         - PROVIDE A WAY FOR SPF TO INTERFACE    *
     *                         TO IEBCOPY (IBMCOPY) SO THAT          *
     *                         THE COMPRESS OPTION OF PANEL 3.1      *
     *                         WORKS.                                *
     *                                                               *
     *                         ADD LOCAL COMMANDS TO THE TSO COMMAND *
     *                         TABLE SO THAT IF THEY ARE MOVED       *
     *                         TO LPALIB, SPF WILL BE ABLE TO FIND   *
     *                         THE LOAD MODULES.                     *
     *                                                               *
     *                         ADD HELP TEXT FOR 'SPF' (ALIAS OF     *
     *                         ISPF) TO SYS1.HELP                    *
     *                                                               *
     *       ENHANCEMENT     - (1) ADD MODULE SPFCOPY                *
     *                                                               *
     *                         (2) UPDATE MODULE ISPTCM              *
     *                                                               *
     *                         (3) ADD SPF HELP TEXT                 *
     *                                                               *
     *                          REFER TO SC34-2037-0 FOR             *
     *                          FURTHER INFORMATION.                 *
     *****************************************************************
     */.
++ VER (Z038) FMID(HPF1102) PRE(UZ35668).
++ JCLIN.
//SYSGEN01 JOB  MSGLEVEL=1
//SG24     EXEC PGM=IEWL,PARM='MAP,LIST,NCAL,LET,RENT,REUS'
//SYSUT1   DD   UNIT=SYSDA,SPACE=(CYL,10)
//SYSLMOD  DD   DSN=SYS1.LPALIB,DISP=SHR
//AOS31    DD   DSN=SYS1.AOS31,DISP=SHR
//SYSLIN   DD   *
 INCLUDE AOS31(SPFCOPY)
 ENTRY   SPFCOPY
 NAME    SPFCOPY(R)
++ MOD (SPFCOPY) DISTLIB(AOS31) TXLIB(LOCLOBJ) LEPARM(RENT,REUS).
++ MOD (ISPTCM)  DISTLIB(AOS31) TXLIB(LOCLOBJ) LEPARM(RENT,REUS).
++ MAC (SPF)     DISTLIB(AHELP) SYSLIB(HELP).
)F FUNCTION -
  THE SPF COMMAND IS USED TO ENTER THE "SYSTEM PRODUCTIVITY FACILITY".
  SPF IS DESIGNED TO OPERATE ON AN IBM 3270 DISPLAY TERMINAL (MODELS
  2, 3, 4, OR 5) WITH 12 OR 24 PROGRAM FUNCTION KEYS.  FOR MORE
  INFORMATION ABOUT THIS FACILITY, ENTER THE "SPF" COMMAND, THEN
  SELECT THE "TUTORIAL" OPTION AS DIRECTED ON THE DISPLAY.
)X SYNTAX -
         SPF
           OR
         SPF OPT

  ALIAS - NONE
  NOTE  - OPT IS ANY OPTION THAT CAN BE ENTERED ON THE PRIMARY OPTION
          MENU.  IT ALLOWS THE PRIMARY OPTION MENU TO BE BYPASSED ON
          INITIAL ENTRY.
)O OPERANDS - NONE
     REQUIRED - NONE
     DEFAULTS - NONE
$$
//
./       ADD   NAME=LA00101A
//SSUD101A JOB (M,AJNJ,S610C021),04542HMD,CLASS=K,NOTIFY=SSUD,
//   MSGCLASS=O
/*ROUTE  PRINT U90
//*ACCT        HOWARD DEAN,SSU
/*JOBPARM L=300,S=*
//***
//***    SYS PROG: H. M. DEAN
//***    DATE:     11/30/82
//***    LOCATION: SYST.LOCLMODS.CNTL(LA00101A)
//***    DESC:     THIS MODFICATION SETS THE PROCESSOR SUPPORT 2
//***              HOT-IO VALUES IN THE NUCLEUS.  BASICALLY, THE
//***              CSECT CONTAINS A NUMBER OF COUNTERS THAT CAUSE
//***              HOT-IO WHEN THEIR VALUES ARE EXCEEDED.
//***
//SMP    EXEC PUTSMP,OPT=200
//SMPCNTL DD *
   REJECT  S(LA00101) .
   RECEIVE S(LA00101) .
   APPLY   S(LA00101) DIS(WRITE).
//SMPPTFIN DD DATA,DLM=$$
++USERMOD (LA00101)       /* HOT-IO THRESHOLD VALUE MODFICATION
     *****************************************************************
     *                                                               *
     *       GTEDS: MARINA DEL REY, CALIFORNIA                       *
     *                                                               *
     *       DATE:  11/30/80  BY: H. M. DEAN                         *
     *                                                               *
     *                                                               *
     *       RELEASE         - OS/MVS 3.8                            *
     *       ENVIRONMENT     - 16MB IBM 3033, 16MB AMDAHL V8         *
     *                       - 24MB IBM 3081                         *
     *                                                               *
     *       PTF LEVEL       - 8207 (FMID JBB1326)                   *
     *                                                               *
     *       USERMOD         - LA00101                               *
     *       JOBNAME         - SSUD101A                              *
     *       TYPE            - ZAP                                   *
     *                                                               *
     *       PRODUCT         - PROCESSOR SUPPPORT #2                 *
     *                         MVS SYSTEM PRODUCT RELEASE 1.0        *
     *                         MVS SYSTEM PRODUCT RELEASE 3.0        *
     *                                                               *
     *       MOD             - IECVHIDT (HOT IO TIMEOUT THRESHOLDS)  *
     *       LMOD            - IEANUC01                              *
     *                                                               *
     *       PROBLEM/        - HOT IO THRESHOLD VALUES SUPPLIED BY   *
     *                         IBM ARE TOO LOW, THUS CAUSING FALSE   *
     *                         HOT IO RECOVERY PROCESSING            *
     *                                                               *
     *       PURPOSE/        - INCREASE HOT-IO THRESHOLD VALUES.     *
     *       ENHANCEMENT                                             *
     *                                                               *
     *****************************************************************
     */.
++VER (Z038) FMID(JBB1326)       /* THIS MOD FOR MVS SP/1.3 */.
++ZAP (IECVHIDT)                 /* TABLE OF HOT IO THRESHOLDS */.
 NAME IEANUC01 IECVHIDT
  VER    0000  0064              *** HOT CHANNEL DETECT ***
  VER    0002  0064              *** HOT DEVICE DETECT  ***
  VER    0004  000C              *** TIMEOUT THRESHOLD  ***
  VER    0006  0004              *** TIMEOUT INTERVAL   ***
  VER    0008  0800              *** UNIT EXCP THRESHOLD***
***********************************************************
  REP    0000  0200              *** HOT CHANNEL DETECT ***
  REP    0002  0200              *** HOT DEVICE DETECT  ***
  REP    0004  000F              *** TIMEOUT THRESHOLD  ***
  REP    0006  0005              *** TIMEOUT INTERVAL   ***
  REP    0008  0000              *** UNIT EXCP THRESHOLD***
 IDRDATA LA00101
$$
./       ADD   NAME=LA00102A
//SSUD102A  JOB (M,AJNJ,S610C021),04542HMD,CLASS=K,NOTIFY=SSUD,
//   MSGCLASS=O
//*ACCT        HOWARD DEAN,SSU
/*ROUTE  PRINT U90
/*JOBPARM L=300,S=*
//*******************************************************************
//***    THIS IS THE GENERAL NUCLEUS ZAP MOD FOR ANY MODULE THAT   **
//***    RESIDES IN THE NUCLEUS WITH FMID OF EBB1102 (MVS 3.8 BASE)**
//*******************************************************************
//***
//***    SYS PROG:   H. M. DEAN
//***    DATE:       11/30/82
//***    LOCATION:   SYST.LOCLMODS.CNTL(LA00102A)
//***    DESC:       SZAP LMOD -- IEANUC01, CSECT ILRSLOTC
//***                CHANGE DEFAULT PAGE SLOT GUARANTEE VALUES FROM
//***                1/8 TO 1/32.
//***                PTF 7905 MVS 3.8
//***                PTF 8204 MVS SYSTEM PRODUCT 1.3.0
//***
//SMP       EXEC PUTSMP,OPT=200
//SMPCNTL   DD *
   APPLY   S(LA00102) DIS(WRITE).
//SMPPTFIN  DD DATA,DLM=$$
++ USERMOD(LA00102) /*
     *****************************************************************
     *                                                               *
     *       GTEDS: MARINA DEL REY, CALIFORNIA                       *
     *                                                               *
     *       DATE: 11/30/82  BY: HOWARD M. DEAN                      *
     *                                                               *
     *                                                               *
     *       RELEASE         - OS/MVS 3.8                            *
     *       ENVIRONMENT     - 16MB IBM 3033, 16MB AMDAHL V8         *
     *                         24MB IBM 3081                         *
     *                                                               *
     *       PTF LEVEL       - 8207 (FMID EBB1102)                   *
     *                                                               *
     *       USERMOD         - LA00102                               *
     *       JOBNAME         - SSUD102A                              *
     *       TYPE            - ZAP                                   *
     *                                                               *
     *       PRODUCT         - MVS BASE PRODUCT (EBB1102)            *
     *       LMOD            - IEANUC01                              *
     *       MOD (CSECT)     - ILRSLOTC                              *
     *                                                               *
     *       PROBLEM         - PROVIDE A LOCAL MODIFICATION TO ALLOW *
     *                         CHANGES TO CERTAIN TUNING VALUES IN   *
     *                         THE NUCLEUS. THIS IS SO THAT VARIOUS  *
     *                         PERFORMANCE SUGGESTIONS CAN BE        *
     *                         IMPLEMENTED.                          *
     *                                                               *
     *       PURPOSE/          THE ZAPS INCLUDED IN THIS MOD HIT     *
     *       ENHANCEMENT       THE MODULES MENTIONED BELOW:          *
     *                                                               *
     *                       - ILRSLOTC CHANGE DEFAULT PAGE SLOT     *
     *                                  GUARANTEE VALUES             *
     *                                                               *
     *                                                               *
     *****************************************************************
     */.
++ VER (Z038) FMID(EBB1102) SUP(IPOBSL0) /* STILL THE BASE PRODUCT */.
++ ZAP (ILRSLOTC)    /* LMOD=IEANUC01 */.
***
***  CHANGE DEFAULT PAGE SLOT GUARANTEE VALUES FROM 1/8 TO 1/32.
***  PTF LEVEL 7905   MVS  3.8
***  PTF LEVEL 8204   MVS  3.8 SYSTEM PRODUCT VERSION 1 REL 3 MOD 0
***
 NAME ILRSLOTC
 VER 0002 0010
 REP 0002 0020
 IDRDATA LA00102
$$
//
./       ADD   NAME=LA00105A
//SSUD105A JOB (T,AJNJ,S610C021),04542HMD,CLASS=K,NOTIFY=SSUD,
//    MSGCLASS=O ,TYPRUN=HOLD
//*ACCT        HOWARD DEAN,SSU
/*ROUTE  PRINT U90
/*JOBPARM L=999,S=*
//***
//***    SYS PROG: HOWARD M. DEAN
//***    DATE:     11/07/82
//***    LOCATION: SYST.LOCLMODS.CNTL(LA00105A)
//***    DESC:      (1)  MAKE CONSOLES COME UP IN ROLL MODE
//***                    UPON IPL OR VARY ONLINE.
//***
//***               (2)  IDENTIFY CONSOLE FROM WHICH OPERATOR
//***                    COMMANDS WERE ISSUED BY SUPPLYING A
//***                    3 BYTE UNIT ADDRESS APPENDED TO THE
//***                    COMMAND MESSAGE.
//***
//***               (3)  ZAP IEECVETK TO CORRECT STIMER PROBLEM
//***                    CAUSED BY UZ56930 (ABEND22F AT IPL TIME).
//***                    APAR IS OZ60980 - MONITOR FOR FIX.
//***
//********************************************************************
//***             WARNING! WARNING! WARNING! WARNING!                *
//***                       DO NOT RENUMBER                          *
//***  THIS MODIFICATION CONTAINS A MACRO UPDATE AND WILL BE RUINED  *
//***  IF THIS DATA SET IS RENUMBERED. PLEASE BE CAREFUL WHEN USING  *
//***  SPF TO EDIT THIS DATA SET. USE 'NUMBER OFF' AND 'AUTONUM OFF' *
//***  MODE (ISSUE THE 'PROFILE' COMMAND TO DISPLAY YOUR MODE).      *
//***                                                                *
//********************************************************************
//***
//SMP      EXEC PUTSMP,OPT=200
//SMPCNTL  DD *
   RESTORE S(LA00105) DIS(WRITE).
   RECEIVE S(LA00105) .
   APPLY   S(LA00105) DIS(WRITE).
//SMPPTFIN DD DATA,DLM=$$
++ USERMOD (LA00105) /*  THIS IS THE 'CONSOLE SUPPORT' LOCAL MOD
     *****************************************************************
     *                                                               *
     *       GTEDS: MARINA DEL REY, CALIFORNIA                       *
     *                                                               *
     *       DATE:  11/07/82  BY: H.M. DEAN                          *
     *                                                               *
     *                                                               *
     *                                                               *
     *       RELEASE         - OS/MVS 3.8                            *
     *                                                               *
     *       ENVIRONMENT     - 16MB IBM 3033, 16MB AMDAHL V8         *
     *                         24MB IBM 3081                         *
     *                                                               *
     *       PTF LEVEL       - 8207 (MVS/SP 1.3)                     *
     *                                                               *
     *       USERMOD         - LA00105                               *
     *       JOBNAME         - SSUD105A                              *
     *       TYPE            - MACUPD,SZAP                           *
     *                                                               *
     *       PRODUCT         - MVS SYSTEM PRODUCT RELEASE 1.3.0      *
     *       LMOD            - IGC0007B (DIDOCS)                     *
     *       SZAP            - IEECVETC,IEECVET4,IEECVETK            *
     *       MACUPD          - IEECDCM                               *
     *                                                               *
     *       PROBLEM     (1) - THE MCS DEFAULTS PROVIDED BY IBM FOR  *
     *                         MVS CONSOLE SUPPORT LEAVES THE        *
     *                         CONSOLES IN WHAT COULD BE CALLED A    *
     *                         "NO MODE" CONDITION AFTER AN IPL.     *
     *                         THIS MODIFICATION, PATTERNED AFTER    *
     *                         THAT DEVELOPED BY IBM WORLD TRADE     *
     *                         CENTER, WILL PLACE ALL FULL           *
     *                         CAPABILITY CONSOLES IN 'ROLL' MODE    *
     *                         AFTER AN IPL.                         *
     *                                                               *
     *                   (2) - SOMETIMES OPERATORS, WITH SUPPOSEDLY  *
     *                         GOOD INTENTIONS, ENTER COMMANDS THAT  *
     *                         CAUSE HORRENDOUS SYSTEM PROBLEMS, SUCH*
     *                         AS '$HA' OR 'FORCE' IN SYSTEM MUST    *
     *                         COMPLETE STATUS. ONE OF THE THINGS    *
     *                         UPPER MANAGEMENT LIKES TO DO IS TO    *
     *                         POINT FINGERS AND YELL AND SCREEM AT  *
     *                         THE GUILTY PARTY. ALAS, THE GUILTY    *
     *                         ONE CAN NEVER BE FOUND BECAUSE THE    *
     *                         LOGGING OF ENTERED OPERATOR COMMANDS  *
     *                         DOES NOT INDICATE WHICH CONSOLE (WORK *
     *                         STATION) THE ERRANT COMMAND CAME FROM.*
     *                         SINCE NOBODY CAN BE ACCUSED OF MAKING *
     *                         A MISTAKE, MANAGEMENT THINKS IT HAS   *
     *                         LOST CONTROL. THUS A USERMOD IS       *
     *                         NECESSARY TO ALLEVIATE THAT SITUATION.*
     *                                                               *
     *       ENHANCEMENT (1) - THIS CHANGE WILL SUPPORT DEVICES      *
     *                         WITH IEECDCM MACRO ENTRIES OF:        *
     *                                                               *
     *                         DEVICE=A   3066 CONSOLE               *
     *                         DEVICE=D - 3277-2 AND 3036            *
     *                         DEVICE=F - 3278 MODEL 2,              *
     *                                    3279 MODEL 2A,             *
     *                                    AND 3279 MODEL 2B          *
     *                         DEVICE=G - 3278 MODEL 3, 3279 MODEL   *
     *                                    3A, AND 3279 MODEL 3B      *
     *                         DEVICE=H - 3278 MODEL 4               *
     *                         DEVICE=I - 3278 MODEL 2A, AND         *
     *                                    3279 MODEL 2C              *
     *                                                               *
     *                         THE CONSOLE SPECIFICATIONS AFTER      *
     *                         IPL WILL NOW BECOME:                  *
     *                                                               *
     *                         1.   FOR 'DEVICE=A' (3066) -          *
     *                         DEL=R,SEG=30,CON=N,RNUM=30,RTME=001   *
     *                                                               *
     *                         2.   FOR 'DEVICE=D' (3277-2 AND 3036) *
     *                         DEL=R,SEG=19,CON=N,RNUM=19,RTME=001   *
     *                                                               *
     *                         3.   FOR 'DEVICE=F' (3278-2 AND       *
     *                              3279-2A/2B) -                    *
     *                         DEL=R,SEG=20,CON=N,RNUM=20,RTME=001   *
     *                                                               *
     *                         4.   FOR 'DEVICE=G' (3278-3 AND       *
     *                              3279-3A/3B) -                    *
     *                         DEL=R,SEG=28,CON=N,RNUM=28,RTME=001   *
     *                                                               *
     *                         5.   FOR 'DEVICE=H' (3278-4) -        *
     *                         DEL=R,SEG=39,CON=N,RNUM=39,RTME=001   *
     *                                                               *
     *                         6.   FOR 'DEVICE=I' (3278-2A, AND     *
     *                              3279-2C)                         *
     *                         DEL=R,SEG=16,CON=N,RNUM=16,RTME=001   *
     *                                                               *
     *                    (2) -THIS USERMOD ADDS THE CHANNEL UNIT    *
     *                         ADDRESS OF THE CONSOLE FROM WHICH AN  *
     *                         OPERATOR COMMAND HAS BEEN ENTERED     *
     *                         PRIOR TO WRITING THE OPERATOR COMMAND *
     *                         BACK TO THE CONSOLE.  AS SUCH, IT     *
     *                         WILL BE POSSIBLE TO DETERMINE WHICH   *
     *                         CONSOLE HAS ENTERED A PARTICULAR      *
     *                         COMMAND.                              *
     *                                                               *
     *                         THIS USERMOD INTERFACES INTO THE      *
     *                         SVC35 ROUTINE OF IEECVET4.  THE BASE  *
     *                         REGISTER FOR IEECVETC IS REGISTER 12  *
     *                         AND IS INITIALIZED WITH THE           *
     *                         UN-RELOCATED VALUE OF X'02'.          *
     *                         REGISTER 8 POINTS TO THE UCM ENTRY    *
     *                         FOR THE CONSOLE IN THE UCM.  THIS     *
     *                         ENTRY ALSO CONTAINS THE ADDRESS OF    *
     *                         THE ASSOCIATED UCB, FROM WHICH THE    *
     *                         EBCDIC CUA ADDRESS IS OBTAINED.       *
     *                         REGISTER 11 POINTS TO THE TDCM, WHICH *
     *                         CONTAINS A WTO PARAMETER LIST.  THE   *
     *                         VALUE OF THE PARAMETER LIST LENGTH IS *
     *                         INCREASED BY FOUR AND COMPARED WITH A *
     *                         MAXIMUM ALLOWABLE LENGTH OF X'80' OR  *
     *                         128.  IF ADDING FOUR CHARACTERS WILL  *
     *                         EXCEED THIS MAXIMUM LENGTH, THE       *
     *                         COMMAND IS WRITTEN BACK WITHOUT THE   *
     *                         CHANNEL- UNIT ADDRESS.  IF THE FOUR   *
     *                         CHARACTERS CAN BE ADDED, THE          *
     *                         PARAMETER LIST LENGTH (DCMINLGN) IS   *
     *                         INCREMENTED BY FOUR, AND A BLANK AND  *
     *                         THE CHANNEL UNIT ADDRESS ARE APPENDED *
     *                         TO THE COMMAND.  THE MCS FLAGS AT THE *
     *                         END ARE ALSO OR'ED TO FORCE THE       *
     *                         APPENDED MESSAGE TO HARDCOPY.         *
     *                                                               *
     *                    (3) -PTF UZ56930 FIXES A ROLL MODE PROBLEM *
     *                         WITH IEECVETK. THIS FIX CAUSES AN     *
     *                         ABEND22F AT IPL TIME WHEN THE CONSOLE *
     *                         ROLL MODE LOCAL MOD IS APPLIED. APAR  *
     *                         OZ60980 DESCRIBES THE PROBLEM, BUT    *
     *                         IBM BLAMES IT ON THIS LOCAL MOD.      *
     *                         WHO KNOWS?, BUT THE APAR SHOULD BE    *
     *                         MONITORED FOR A FIX.                  *
     *****************************************************************
        */.
++ VER (Z038) FMID(JBB1326) PRE(UZ90170,UZ55950,UZ56930).
++ MACUPD(IEECDCM) DISTLIB(AMODGEN).
./      CHANGE NAME=IEECDCM                                  01 LA01105
&L    SETC '1'         DCMRTME INITIAL VALUE                 01 LA01105
&P    SETC '1'         DCMRTMED INITIAL VALUE                01 LA01105
&H    SETC '19'        DCMSEG  INITIAL VALUE                 01 LA01105
&M    SETC '19'        DCMSEGDF INITIAL VALUE                01 LA01105
&H    SETC '20'        INITIAL SEGMENT VALUE                 01 LA01105
&L    SETC '1'         INITIAL ROLL TIME VALUE               01 LA01105
&M    SETC '20'        DEFAULT SEGMENT VALUE                 01 LA01105
&P    SETC '1'         DEFAULT ROLL TIME VALUE               01 LA01105
&H    SETC '16'        INITIAL SEGMENT VALUE                 01 LA01105
&L    SETC '1'         INITIAL ROLL TIME VALUE               01 LA01105
&M    SETC '16'        DEFAULT SEGMENT VALUE                 01 LA01105
&P    SETC '1'         DEFAULT ROLL TIME VALUE               01 LA01105
&H    SETC '28'        INITIAL SEGMENT VALUE                 01 LA01105
&L    SETC '1'         INITIAL ROLL TIME VALUE               01 LA01105
&M    SETC '28'        DEFAULT SEGMENT VALUE                 01 LA01105
&P    SETC '1'         DEFAULT ROLL TIME VALUE               01 LA01105
&H    SETC '39'        INITIAL SEGMENT VALUE                 01 LA01105
&L    SETC '1'         INITIAL ROLL TIME VALUE               01 LA01105
&M    SETC '39'        DEFAULT SEGMENT VALUE                 01 LA01105
&P    SETC '1'         DEFAULT ROLL TIME VALUE               01 LA01105
&H    SETC '30'        DCMSEG  INITIAL VALUE                 01 LA01105
&L    SETC '1'         DCMRTME INITIAL VALUE                 01 LA01105
&M    SETC '30'        DCMSEGDF INITIAL VALUE                01 LA01105
&P    SETC '1'         DCMRTMED INITIAL VALUE                01 LA01105
./ ENDUP                                                     01 LA01105
++ ZAP (IEECVETC) DISTLIB (AOSC5) .
  NAME IEECVETC
  VER 00F6 92E8                    DEL1 = Y                  01 LA01105
  VER 00FA 9240                    DEL2 = BLANK              01 LA01105
  VER 0104 92E8                    CON  = Y                  01 LA01105
  VER 0108 92E0                    DCMOPTST                  01 LA01105
  VER 0180 9610                    DCMIOCM2                  01 LA01105
  VER 0184 5810,4024,1211,4780                               01 LA01105
  VER 01A6 96E0,9122               DCMCMSG3                  01 LA01105
  VER 01AA 58F0,9134               EXIT ADDRESS              01 LA01105
  REP 00F6 92D9                    DEL1 = R                  01 LA01105
  REP 00FA 9240                    DEL2 = BLANK              01 LA01105
  REP 0104 92D5                    CON  = N                  01 LA01105
  REP 0108 9230                    DCMOPTST                  01 LA01105
  REP 0180 96F0                    DCMIOCM2                  01 LA01105
  REP 0184 9650,9018,0700,47F0                               01 LA01105
  REP 01A6 9680,912D               DCMCMSG3                  01 LA01105
  REP 01AA 58F0,918C               EXIT ADDRESS              01 LA01105
  IDRDATA LA01105                                            01 LA01105
++ ZAP (IEECVET4) DISTLIB (AOSC5) .
  NAME IEECVET4
* LA02105 - CONSOLE IDENTIFCATION LOCAL MODIFICATION
  VER 0358 9204,B06F               *****************************
  VER 035C 4110,B06C               * THIS PART OF THE CODE AT  *
  VER 0360 1B00                    * LABEL SVC35 IN THE DIDOCS *
  VER 0362 4300,801A               * ROUTINE IEECVET4.         *
  VER 0366 0A23                    *****************************
  VER 06B0 5C5C,40C9               VERIFY BEGINNING OF PATCH AREA
* LA02105 - CONSOLE IDENTIFCATION LOCAL MODIFICATION
  REP 0358 9200,B06F         MVI - MCS FLAGS, FORCE TO HARDCOPY
  REP 035C 47F0,C6AE         BR  - BRANCH TO PATCH AREA
  REP 06B0 4810,B06C         LH  - LOAD PARMLIST LENGTH (DCMINLGN)
  REP 06B4 4110,1004         LA  - INCREMENT PARMLIST LENGTH BY 4
  REP 06B8 1801              LR  - PUT NEW LENGTH IN REGISTER 0
  REP 06BA 4110,0080         LA  - LOAD MAXIMUM PARMLIST LENGTH (X'80')
  REP 06BE 1901              CR  - COMPARE REGISTERS 0 AND 1
  REP 06C0 4720,C6F0         BC  - BRANCH IF LENGTH GREATER THAN MAX
  REP 06C4 4110,B06C         LA  - ADDRESS OF WTO PARMLIST IN TDCM
  REP 06C8 4A10,B06C         AH  - ADD LENGTH OF WTO PARMLIST
  REP 06CC 9240,1000         MVI - ADD BLANK TO END OF MESSAGE
  REP 06D0 4000,B06C         STH - STORE NEW MESSAGE LENGTH
  REP 06D4 1802              LR  - SAVE REGISTER 2
  REP 06D6 5820,800C         L   - LOAD UCMUCB ADDRESS
  REP 06DA D202,1001,200D    MVC - MOVE UCBNAME TO MESSAGE
  REP 06E0 4110,B06C         LA  - ADDRESS OF WTO PARMLIST IN TDCM
  REP 06E4 1820              LR  - RESTORE REGISTER 2
  REP 06E6 1B00              SR  - CLEAR REGISTER 0
  REP 06E8 4300,801A         IC  - INSERT UCMID
  REP 06EC 0A23              SVC - WTO (SVC 35)
  REP 06EE 47F0,C366         BC  - BRANCH TO SVC34
  REP 06F2 4110,B06C         LA  - ADDRESS OF WTO PARMLIST IN TDCM
  REP 06F6 47F0,C35E         BC  - BRANCH TO SVC35, MESSAGE TOO LONG
  REP 06FA 0000,0000,0000          * ZERO OUT REMAINDER
  REP 0700 0000,0000,0000,0000
  REP 0708 0000,0000,0000,0000
  REP 0710 0000,0000               * OF PATCH AREA
  IDRDATA LA02105
++ ZAP (IEECVETK) DISTLIB (AOSC5) .
* FIXES UZ56930 STIMER ERROR CAUSING ABEND22F AT IPL TIME
  NAME IEECVETK
  VER 00EC 1823
  VER 00EE 9610,D00D
  VER 00F2 9180,B018
  REP 00EE 0700,0700               REPLACE WITH NO-OP
  IDRDATA LA03105
$$
/*
./       ADD   NAME=LA00121A
//SSUD121A JOB (M,AJNJ,S610C021),04542HMD,CLASS=B,
//   MSGCLASS=G,NOTIFY=SSUD,PERFORM=12
//*ACCT        HOWARD DEAN,SSU
/*ROUTE  PRINT LOCAL
/*JOBPARM L=300,S=*
//***
//***    SYS PROG:   H. M. DEAN
//***    DATE:       09/03/80  (MODIFIED BY H.G. NG)
//***    LOCATION:   SYST.LOCLMODS.CNTL(LA00121)
//***    DESC:       CHANGE DASD ALLOC DEFAULT FROM OLD TO SHR
//***
//SMP      EXEC PUTSMP
//SMPCNTL  DD *
   RESTORE S(LA12100) DIS(WRITE).
   RECEIVE S(LA00121).
   APPLY   S(LA00121) DIS(WRITE).
//SMPPTFIN DD DATA,DLM=$$
++ USERMOD (LA00121) /*
     *****************************************************************
     *                                                               *
     *       GTEDS: MARINA DEL REY, CALIFORNIA                       *
     *                                                               *
     *       DATE: 09/03/80  BY: NONE AVAILABLE                      *
     *                                                               *
     *                                                               *
     *       RELEASE         - OS/MVS 3.8                            *
     *       ENVIRONMENT     - 8MB IBM 3033, 12MB AMDAHL V8          *
     *                         8MB IBM 3033N                         *
     *                                                               *
     *       PTF LEVEL       - 8007                                  *
     *                                                               *
     *       USERMOD         - LA00121                               *
     *       JOBNAME         - SSUD121A                              *
     *       TYPE            - ZAP                                   *
     *                                                               *
     *       PRODUCT         - TSO                                   *
     *       LMOD            - ALLOCATE                              *
     *       MOD (CSECT)     - IKJEFD30                              *
     *                                                               *
     *       PROBLEM         - TSO ALLOCATE COMMAND DEFAULT DISP IS  *
     *                         OLD. THIS CAUSES DATASET CONFLICTS    *
     *                         IF DATASET IS ALLOCATED AND NOT FREED.*
     *                                                               *
     *                                                               *
     *       PURPOSE/        - CHANGE ALLOCATE COMMAND DEFAULT DISP  *
     *       ENHANCEMENT       FROM OLD TO SHR.                      *
     *                                                               *
     *                                                               *
     *****************************************************************
     */.
++ VER (Z038) FMID(EBB1102).
++ ZAP (IKJEFD30)            /*AOST4  LMOD=ALLOCATE */.
   NAME IKJEFD30
***
***   LA12100  CHANGE ALLOCATE DEFAULT DISP FROM OLD TO SHR
***
   VER 021A D201,A00C,C41E
   REP 021A D201,A00C,C420
   IDRDATA LA00121
$$
//
./       ADD   NAME=LA00124A
//SSUD124A JOB (T,AJNJ,S610C021),04542HMD,CLASS=K,NOTIFY=SSUD,
//    MSGCLASS=O
//*ACCT        HOWARD DEAN,SSU
/*ROUTE  PRINT U90
/*JOBPARM L=300,S=ANY
//***
//***    SYS PROG: HOWARD M. DEAN
//***    DATE:     06/30/82
//***    LOCATION: SYST.LOCLMODS.CNTL(LA00124A)
//***    DESC:     FIX TCAM SUPPORT FOR ASCII TERMINALS
//***              ALLOW TCAM TO SUPPORT LOW-SPEED UPPER AND
//***              LOWER CASE TEXT AND CONTROL CHARS.
//***              USED FOR DIAL-TSO SUPPORT ACTIVITIES.
//***
//SMP      EXEC PUTSMP,OPT=200
//SMPCNTL  DD *
   RECEIVE S(LA00124) .
   APPLY   S(LA00124) DIS(WRITE).
//SMPPTFIN DD DATA,DLM=$$
++ USERMOD (LA00124) /*
       THIS IS AN OMNIBUS TCAM USERMOD FIXING MANY PROBLEMS IN
       IBM SUPPORT OF TELETYPE DEVICES. THESE PROBLEMS ARE NOT
       ERRORS. THEY ARE CLEARLY INTENTIONAL ATTEMPTS ON IBM'S
       PART TO DISCOURAGE USERS FROM GETTING ASCII EQUIPMENT.
       SOME OF THE STRONGEST LANGUAGE IS IN THE COMMENT CARDS
       OF THE ORIGINAL SOURCE, WHERE YOU LEARN IN NO UNCERTAIN
       TERMS WHAT IBM WANTS YOU TO DO WITH YOUR TELETYPE
   *                                                               *
   *                                                               *
   *****************************************************************
   *****************************************************************
   *                                                               *
   *       GTEDS: MARINA DEL REY, CALIFORNIA                       *
   *                                                               *
   *       DATE: 01/25/82  BY: H.M. DEAN                           *
   *                                                               *
   *       RELEASE         - OS/MVS 3.8                            *
   *       ENVIRONMENT     - 12MB IBM 3033, 12MB AMDAHL V8         *
   *                          8MB IBM 3033N                        *
   *                                                               *
   *       PTF LEVEL       - 8204                                  *
   *                                                               *
   *       USERMOD         - LA00124                               *
   *       JOBNAME         - SSUD124A                              *
   *       TYPE            - ZAP/MOD                               *
   *                                                               *
   *       PRODUCT         - ETC0108 (TCAM)                        *
   *       LMOD            - IEDAYZ,IEDAYW,IEDAYM,IEDQA3,IGC0010A  *
   *                         IEDQ21                                *
   *                                                               *
   *       MOD (CSECT)     - IEDAYZ,IEDAYW,IEDAYM,IEDQA3,IEDAYLL   *
   *                         IEDQ21                                *
   *                                                               *
   *       PROBLEM         - PROVIDE UPPER/LOWER CASE ASCII        *
   *                         SUPPORT FOR 'TWX' TERMINALS. ALLOW    *
   *                         VARIOUS CONTROL CHARACTERS TO         *
   *                         BE PASSED TO 'TWX' TERMINALS.         *
   *                                                               *
   *       PURPOSE/        - ENHANCE TCAM TO SUPPORT THE ABOVE     *
   *       ENHANCEMENT                                             *
   *                                                               *
   *                                                               *
   *****************************************************************
  */.
++ VER (Z038) FMID(ETC0108)
               PRE(UZ26407,UZ27387,UZ30771,UZ31033,UZ32954,
                   UZ37962,UZ52584) /* LATEST TAPE = 8204 */.
++ JCLIN.
//SYSGEN2 JOB 1,'SYSTEM GENERATION',MSGLEVEL=1
//SG25    EXEC PGM=IEWL,
//  PARM='MAP,LET,LIST,NCAL,XREF'
//SYSPRINT     DD  SYSOUT=*
//SYSUT1       DD  UNIT=SYSDA,SPACE=(CYL,1)
//AOS21        DD  DSN=SYS1.AOS21,DISP=SHR
//SYSLMOD      DD  DSN=SYS1.TELCMLIB,DISP=SHR
//SYSLIN       DD  *
 INCLUDE AOS21(IEDQ21)
 NAME    IEDQ21(R)
++ MOD (IEDQ21) TXLIB(LOCLOBJ) DISTLIB(AOS21).
++ ZAP (IEDAYZ) /*
     VARIOUS ZAPS TO SUPPORT TELETYPES (NOT JUST 33/35 DEVICES) */.
NAME IEDAYZ
*
* CHANGE PSEUDO KEYBOARD LOCK MESSAGE FOR TELETYPES FROM DC4,DC1,DC4,DC1
* TO NUL,DEL,NUL,DEL WHICH SHOULD NOT CAUSE TROUBLE AS DID OLD CHARS
*
VER 0028 C988,C988
REP 0028 00FF,00FF
*
* CHANGE MESSAGE FOR SIMULATED ATTENTION BY LINE COUNT (SET BY 'LINES'
* PARM OF THE 'TERMINAL' CMD) FROM MISC CONTROL CHARS WHICH 'JIGGLE
* THE ELEMENT' (AND CAUSE TROUBLE FOR SOME TERMINALS) TO THE STRING
* '/MORE/' (IN LOWER CASE).
*
*
* NON-TELETYPE(TWX)
*
VER 044E 0717,0636,0636,0617
REP 044E 0717,6194,9699,8561
*
* TELETYPE(TWX)
*
VER 0456 083C,113C,113C,113C,11
REP 0456 0800,0061,9496,9965,61
IDRDATA LA00124
++ ZAP (IEDAYW) /*
       OMNIBUS OUTPUT MESSAGE EDIT CORRECTION
       DESIGNED TO REDUCE THE INFLEXABILITY OF IEDAYW
       AND ALLOW FULL TPUT CONTROL ON OUTPUT,
       AND ELIMINATE SOME DISTINCTIONS BETWEEN EDIT AND ASIS */.
NAME IEDAYW
* THIS FIRST GROUP OF MODS CONCERNS THE IDLE, LF, AND NL CHARS.
* FIRST WE ZAP OUT THE TEST FOR ASIS MODE, SO THE CHARACTERS
* WILL BE EQUALLY VALID IN TPUT EDIT AND TPUT ASIS.
* THEN WE ALLOW 'IDLE' AND 'LINEFEED' TO BE SENT TO ANY
* KIND OF TERMINAL. THE 'NL' WILL BE CONVERTED BY SOMEONE
* ELSE TO TERMINAL DEPENDENT CHARACTERS IF IT IS AT THE END
* OF A MESSAGE, AND WILL BE TRANSLATED TO THE GARBAGE CHARACTER
* IF IT IS IMBEDDED IN THE MESSAGE
******
VER 0E10 9120,B018,4780                                      @ZU32954
REP 0E10 9120,B018,4700                                      @ZU32954
VER 0E1C 4780,309C                                           @ZU32954
VER 0E24 4780,309C                                           @ZU32954
REP 0E1C 4780,3102                                           @ZU32954
REP 0E24 4780,3102                                           @ZU32954
*****
* NOW TO LET THE LOWLY BACKSPACE SNEAK OUT
*****
VER 0E9C 4710,30EE                                           @ZU32954
REP 0E9C 4700                                                @ZU32954
VER 0EBE 9217,9000                                           @ZU32954
REP 0EBE 47F0,3102                                           @ZU32954
*****
* LET A FEW THINGS GO IN EDIT MODE NORMALLY RESTRICTED TO ASIS
*****
VER 0EDE 4780,3132                                           @ZU32954
REP 0EDE 4700                                                @ZU32954
*****
* THIS THE THE FAMOUS 'TECHTRONIX' MOD TO MAKE TPUT CONTROL
* INTO TRANSPARENT TRANSMISSION FOR MOST DEVICES.
* IT NOOPS A TRT LOOKING FOR 'BAD' CHARACTERS.
*****
VER 0F74 4410,31D8,18F8,957A                                 @ZU32954
REP 0F74 4080,B032,47F0,30E4                                 @ZU32954
IDRDATA LA00124
++ ZAP (IEDQA3) /*
        DONT TRANSLATE "LOGON" TO UPPER CASE. THIS IS TO ALLOW
        AUTOMATIC SELECTION OF "APL" TRANSLATE TABLES  */.
NAME IEDQA3
VER 0214 4040,4040,4040,4040,4040    CONSTANT USED TO "OR" UPPERCASE
REP 0214 0000,0000,0000,0000,0000    REPLACE WITH ZEROS
IDRDATA LA00124
++ ZAP (IEDAYM) /*
         THIS ZAP CAUSES A CARRIAGE RETURN TO ACCOMPANY THE NL
         IN MESSAGE IKJ53020, THE MESSAGE WHICH TCAM SENDS WHEN IT
         DOESN'T RECOGNIZE A VALID LOGON STRING IN A USER'S FIRST
         LOGON ATTEMPT.
         THIS IS GOOD FOR TWX DEVICES, ACCEPTABLE FOR 2741  */.
NAME IEDAYM
VER 12FE 1517    NL,IDLE                                   @UZ52584
REP 12FE 150D    NL,CR                                     @UZ52584
IDRDATA LA00124
++ZAP (IEDAYLL)  /* CHANGES DEFAULT CHARACTERISTICS FOR TWX TERMS */.
NAME  IEDAYLL
*
*    THIS ZAP CHANGES THE DEFAULT TERMINAL LINESIZE FOR 'TWX' TERMINALS
*    FROM 72 TO 80
*    ALSO, IT CAUSES:
*    BS-ATTN TO BE THE DEFAULT CHAR AND LINE DELETE CHARACTERS FOR
*    TWX TERMINALS
*                              IGC0010A IEDAYLL (QTIP SVC)
VER 01A0 41A0,0048             LA  R10,72
VER 01AC 4780,C1B2             BZ  CHKREST
REP 01A0 41A0,0050             LA  R10,80
REP 01AC 4770,C1C6             BNZ SETBOTH
IDRDATA LA00124
$$
./       ADD   NAME=LA00134A
//SSUD134A JOB (T,AJNJ,S610C021),04542HMD,CLASS=B,NOTIFY=SSUD,
//   MSGCLASS=O
//*ACCT        HOWARD DEAN,SSU
/*ROUTE  PRINT U90
/*JOBPARM L=300,S=ANY
//***
//***    SYS PROG: HOWARD DEAN
//***    DATE:     07/03/82
//***    LOCATION: SYST.LOCLMODS.CNTL(LA00134A)
//***    DESC:     ALLOW CHECKPOINT DATASET TO RESIDE ON SHARED DASD
//***              SZAP IHJACP00
//***
//SMP      EXEC PUTSMP
//SMPCNTL  DD *
   RECEIVE S(LA00134).
   APPLY   S(LA00134) DIS(WRITE).
//SMPPTFIN DD DATA,DLM=$$
++ USERMOD (LA00134) /*
     *****************************************************************
     *                                                               *
     *       GTEDS: MARINA DEL REY, CALIFORNIA                       *
     *                                                               *
     *       DATE:  07/03/82  BY: HOWARD DEAN                        *
     *                                                               *
     *                                                               *
     *       RELEASE         - OS/MVS 3.8                            *
     *       ENVIRONMENT     - 12MB IBM 3033, 12MB AMDAHL V8         *
     *                         8MB IBM 3033N                         *
     *                                                               *
     *       PTF LEVEL       - 8204                                  *
     *                                                               *
     *       USERMOD         - LA00134                               *
     *       JOBNAME         - SSUD134A                              *
     *       TYPE            - ZAP                                   *
     *                                                               *
     *       PRODUCT         - CHECKPOINT/RESTART                    *
     *       LMOD            - IGC0006C                              *
     *       MOD (CSECT)     - IHJACP00                              *
     *                                                               *
     *       PROBLEM         - CHECKPOINT/RESTART DOES NOT ALLOW     *
     *                         THE CHECKPOINT DATASET TO RESIDE      *
     *                         ON SHARED DASD. THIS IS INCONVIENIENT *
     *                         SINCE MOST OF OUR DASD IS MARKED      *
     *                         SHARED.                               *
     *                                                               *
     *       PURPOSE/        - ALLOW THE CHECKPOINT DATASET TO       *
     *       ENHANCEMENT       RESIDE ON SHARED DASD.                *
     *                                                               *
     *                                                               *
     *****************************************************************
     */.
++ VER (Z038) FMID(EDM1102)  PRE(UZ23306,UZ38165).
++ ZAP (IHJACP00)            /*AOSC6  LPALIB   LMOD=IGC0006C */.
  NAME IGC0006C
***
***  CORRECTED FOR PTF UZ38165 ON TAPE 8202 - HOWARD M. DEAN
***
  VER  05C6  4710,B802  BO CHKDS60       @UZ38165
  REP  05C6  0700,0700  NOPR;NOPR        @UZ38165
  IDRDATA LA00134
$$
//
./       ADD   NAME=LA00149A
//SSUD149A JOB (M,AJNJ,S610C021),04542HMD,CLASS=K,NOTIFY=SSUD,
//   MSGCLASS=O
//*ACCT        HOWARD DEAN,SSU
/*ROUTE  PRINT U90
/*JOBPARM L=300,S=*
//****************************************************************
//**   THIS IS THE LOCAL MODIFICATION FOR INSTALLING TYPE 1,2,6 **
//**   SVC ROUTINES AND OTHER NUCLEUS RESIDENT ROUTINES         **
//****************************************************************
//***
//***    SYS PROG:   H. M. DEAN
//***    DATE:       04/21/83
//***    LOCATION:   SYST.LOCLMODS.CNTL(LA00149A)
//***    DESC:       TYPE 1,2,6 SVCS AND OTHER NUCLEUS
//***                RESIDENT MODULES.
//***
//***
//SMP      EXEC PUTSMP
//SMPCNTL  DD *
   REJECT  S(LA00149).
   RECEIVE S(LA00149).
   APPLY   S(LA00149) DIS(WRITE).
//SMPPTFIN DD DATA,DLM=$$
++ USERMOD (LA00149)  /*
     *****************************************************************
     *                                                               *
     *       GTEDS: MARINA DEL REY, CALIFORNIA                       *
     *                                                               *
     *       DATE: 04/21/83  BY: H.M. DEAN                           *
     *                                                               *
     *                                                               *
     *       RELEASE         - OS/MVS 3.8  SYSTEM PRODUCT R 1.0      *
     *       ENVIRONMENT     - 16MB IBM 3033, 16MB AMDAHL V8         *
     *                         24MB IBM 3081                         *
     *                                                               *
     *       PTF LEVEL       - 8301 FMID(EBB1102)                    *
     *                                                               *
     *       USERMOD         - LA00149                               *
     *       JOBNAME         - SSUD149A                              *
     *       TYPE            - MOD                                   *
     *                                                               *
     *       PRODUCT         - MVS 3.8 BASE (EBB1102)                *
     *       LMOD            - IEANUC01                              *
     *       MOD (CSECT)     - VARIOUS TYPE 1,2,6 SVC ROUTINES       *
     *                                                               *
     *       PROBLEM         - PROVIDE A MEANS TO INSTALL TYPE 1,2,6 *
     *                         SVC ROUTINES NEEDED BY VARIOUS        *
     *                         PRODUCTS SUCH AS IMS, CICS, ETC.      *
     *                                                               *
     *                                                               *
     *       PURPOSE/        - THIS LOCAL MOD IS THE COMMON          *
     *       ENHANCEMENT       TYPE 1,2,6 SVC AND RESIDENT NUCLEUS   *
     *                         ROUTINE LOCAL MODS. USE IT TO ADD     *
     *                         NUCLEUS RESIDENT SVC AND SUPERVISOR   *
     *                         ROUTINES TO THE MVS 3.8 NUCLEUS.      *
     *                                                               *
     *                                                               *
     *****************************************************************
     */.
++VER (Z038) FMID(EBB1102).
++JCLIN.
//SYSGEN01 JOB MSGLEVEL=1
//NUC36 EXEC LINKS,COND=(4,LT),REGION=350K,
// PARM='LIST,XREF,NCAL,SCTR,LET,SIZE=(300K,64K)',
// UNIT='3350',SER=ITSTC2,N=SYSTC2,NAME=NUCLEUS,P1='(',
// MOD=IEANUC01,P2=')',OBJ=OBJPDS03,CLASS=G
//AOSC5  DD  DSN=SYS1.AOSC5,DISP=SHR
//SYSLIN DD  *
 INCLUDE AOSC5(IGC202)        CICS HPO PERFORMANCE SVC
 INCLUDE AOSC5(IGC217)        CICS 1.5 BOOTSTRAP SVC
 INCLUDE AOSC5(IGC233)        IMS 1.2.0 MULITPURPOSE SVC
   INSERT  IEAVNIP0
   INSERT  IEAVFX00
 INSERT IGFPMCIH,IGFRWAC
 INSERT IGFPMPFX,IGFPMSCA,IGFPMHCA
 INSERT IGFPMRTM,IGFPMTHA,IGFPMFRS
 INSERT IGFPMMSG,IGFPMKTA,IGFPKREF
 INSERT IGFPTERM,IGFPTSIG
 INSERT IGFCCHED
 INSERT IGFPNRFH
 INSERT IGFPXMFA,IGFPTAIM
 INSERT IGFPBUCR,IGFPEXIT
 INSERT IGFPSAD0
 INSERT IGFPTCON,IGFPTREC
 INCLUDE NUCLEUS(IEANUC01)
 NAME    IEANUC01(R)
++MOD (IGC202) LEPARM(RENT,REUS) LKLIB(LOCLLOAD) DISTLIB(AOSC5).
++MOD (IGC217) LEPARM(RENT,REUS) LKLIB(LOCLLOAD) DISTLIB(AOSC5).
++MOD (IGC233) LEPARM(RENT,REUS) LKLIB(LOCLLOAD) DISTLIB(AOSC5).
$$
//
./       ADD   NAME=LA00150B
//SSUH150B  JOB (M,AJNJ,S610C021),06033BCT,CLASS=0,NOTIFY=SSUH,
//  MSGCLASS=O,PERFORM=12
//*ACCT        BARRY TAVLIN,SSU
/*ROUTE  PRINT U98
/*JOBPARM L=999,S=ANY
//********************************************************************
//***    SYS PROG: H.M. DEAN                                       ***
//***    DATE:     01/30/83                                        ***
//***    LOCATION: SYST.LOCLMODS.CNTL(LA00150B)                    ***
//***    DESC:     SMP APPLY OF LOCAL SVCS AND APPENDAGES          ***
//***              THIS JOBSTREAM APPLIES OUR LOCAL:               ***
//***              SVCS,I/O APPENDAGES,ETC TO LPALIB ON            ***
//***              THE TARGET SYSTEM. THE JCLIN AND                ***
//***              ++MOD STATEMENTS SHOULD BE KEPT IN-SYNC.        ***
//***              THE LPALIB DDNAME IN THE SMP PROC SHOULD        ***
//***              ALWAYS POINT TO THE TARGET SYSTEM.              ***
//********************************************************************
//SMP          EXEC PUTSMP,OPT=200,REGION=3800K
//SYSIN        DD   *
 RESTORE S(LA00150) DIS(WRITE) /* RESTORE PREVIOUS MOD VERSION   */.
 RECEIVE S(LA00150)            /* RECEIVE NEW VERSION OF USERMOD */.
 APPLY   S(LA00150) DIS(WRITE) /* APPLY   NEW VERSION OF USERMOD */.
//SMPPTFIN     DD   DATA,DLM=$$
++ USERMOD(LA00150)   /* LOCAL SVCS AND APPENDAGES
**********************************************************************
****                                                              ****
****         GTEDS: MARINA DEL REY, CALIFORNIA                    ****
****                                                              ****
****         DATE: 01/30/83  BY: H.M. DEAN                        ****
****                                                              ****
****                                                              ****
****         RELEASE         - OS/MVS 3.8                         ****
****                                                              ****
****         ENVIRONMENT     - 16MB IBM 3033, 16MB AMDAHL V8      ****
****                           24MB IBM 3081                      ****
****                                                              ****
****         PTF LEVEL       - 8207                               ****
****                                                              ****
****         USERMOD         - LA00150                            ****
****         JOBNAME         - SSUH150B                           ****
****         TYPE            - MOD (COPY AND LINK)                ****
****                                                              ****
****         PRODUCT         - USER SVC'S,APPENDAGES,ETC.         ****
****         LMOD            - SEE JCLIN                          ****
****         MOD (CSECT)     - SEE ++MOD STATEMENTS               ****
****                                                              ****
****         PROBLEM         - PROVIDE USER WITH SUPERVISOR       ****
****                           SERVICES NOT SUPPORTED BY IBM      ****
****                           STANDARD ROUTINES.                 ****
****                                                              ****
****                                                              ****
****         PURPOSE/        - THIS LOCAL MOD PROVIDES THE GTEDS  ****
****         ENHANCEMENT       LA USER WITH SUPERVISOR AND I/O    ****
****                           APPENDAGE SERVICES FOR VARIOUS     ****
****                           PROGRAM PRODUCTS AND SYSTEMS.      ****
****                           THIS MOD ALSO SUPPORTS PROGRAM     ****
****                           PRODUCTS BY IBM AND OTHER VENDORS  ****
****                           WHO SUPPLY MODULES FOR LPALIB.     ****
**********************************************************************
     */.
++ VER(Z038) FMID(EBB1102).
++ JCLIN.
//SYSGEN01    JOB 'SYSTEM GENERATION',MSGLEVEL=1
//SG17        EXEC PGM=IEBCOPY
//SYSPRINT    DD SYSOUT=A
//SYSUT3      DD UNIT=SYSDA,SPACE=(CYL,(10,10))
//SYSUT4      DD UNIT=SYSDA,SPACE=(CYL,(10,10))
//LOCLLOAD    DD DSN=SYST.LOCLMODS.LOAD,DISP=SHR
//LPALIB      DD DSN=SYS1.LPALIB,DISP=SHR
//SYSIN       DD *
 COPY INDD=LOCLLOAD,OUTDD=LPALIB
 S M=((IGC0021A,,R))  HMD 03/03/80 - CONVERTER INTERFACE SVC
 S M=((IGC0021C,,R))  HMD 09/11/81 - UCC11 V 1.1 (RMS) SVC
 S M=((IGC0022G,,R))  HMD 12/03/79 - WTO SVC (APOLLO VCI)
 S M=((IGC0024B,,R))  DTY 12/03/79 - 'WIDE-BAND' SVC
 S M=((IGC0025D,,R))  HMD 12/05/79 - TSOPER SVC
 S M=((IGG019WB,,R))  HMD 07/19/79 - SQUISHVOL EOE APPENDAGE
 S M=((IGG019WC,,R))  HMD 11/27/79 - ASM2 $DEFRAG EOE APPENDAGE
 S M=((IGG019WD,,R))  HMD 01/31/82 - AIR FORCE TAPE ERP
 S M=((IGG019WE,,R))  HMD 01/31/82 - AIR FORCE TAPE ERP
 S M=((IGG019WT,,R))  ??? VERY OLD - LAMA EAX ABEND APPENDAGE
 S M=((IGG019WZ,,R))  ??? VERY OLD - BIS TOLL PAPER TAPE APPENDAGE
 S M=((IGG019XQ,,R))  HMD 06/24/82 - ASM2 DATAMOVER EOE APPENDAGE
 S M=((IGG019X3,,R))  ??? AUDIO RESPONSE CHANNEL END APPENDAGE
 S M=((IGG019YC,,R))  HMD 02/21/80 - STCPOST EOE APPENDAGE
 S M=((IGG019YD,,R))  HMD 02/21/80 - STCPOST SIO APPENDAGE
 S M=((IGG019YE,,R))  HMD 02/21/80 - STCPOST ABND APPENDAGE
 S M=((IGG019YI,,R))  ??? UNKNOWN APENDAGE ??????
 S M=((IGG019YZ,,R))  HMD 09/15/81 - FDR VERSION 4.5 EOE APPENDAGE
 S M=((IGG0198X,,R))  SME 04/01/82 - TPNS SIO APPENDAGE
 S M=((IGG0198Z,,R))  SME 04/01/82 - TPNS CHANNEL END APPENDAGE
 S M=((IGX00010,,R))  JCW 06/08/82 - TEST SYNCSORT ESR SVC
 S M=((IGX00019,,R))  CAL 06/08/82 - PROD SYNCSORT ESR SVC
 S M=((IGX00032,,R))  RFL 12/03/76 - MAINT ESR SVC
 S M=((NSLCTRLO,,R))  ASB 11/26/79 - NSL ROUTINES
 S M=((NSLEHDRI,,R))  ASB 11/26/79 - NSL ROUTINES
 S M=((NSLEHDRO,,R))  ASB 11/26/79 - NSL ROUTINES
 S M=((NSLETRLI,,R))  ASB 11/26/79 - NSL ROUTINES
 S M=((NSLETRLO,,R))  ASB 11/26/79 - NSL ROUTINES
 S M=((NSLOHDRI,,R))  ASB 11/26/79 - NSL ROUTINES
 S M=((NSLOHDRO,,R))  ASB 11/26/79 - NSL ROUTINES
 S M=((NSLRHDRI,,R))  ASB 11/26/79 - NSL ROUTINES
 S M=((NSLTYPEC,,R))  ASB 11/26/79 - NSL ROUTINES
 S M=((NSLTYPEP,,R))  ASB 11/26/79 - NSL ROUTINES
 S M=((NSLTYPEW,,R))  ASB 11/26/79 - NSL ROUTINES
 S M=((NSLREPOS,,R))  ASB 11/26/79 - NSL ROUTINES
 S M=((UCC11RES,,R))  HMD 10/09/81 - UCC11 RESIDENT TABLES
//SG24      EXEC  LINKS,NAME=LPALIB,MOD=JSTATUS,OBJ=OBJPDS01,
//  PARM='MAP,LIST,XREF,RENT,LET'
//SYSLIN    DD   *
 INCLUDE    LOCLLOAD(JSTATUS)
 ORDER      STATUS(P)           HMD 10/17/80 - STATUS REPLACEMENT
 ORDER      STATJES2            HMD 10/17/80 - JES2 STATUS ROUTINE
 ORDER      IGC0020H            HMD 10/17/80 - JES2 INTERFACE SVC
 ORDER      FINDASCB            HMD 10/17/80 - LOCATE ASCB
 ORDER      RECEVSRB            HMD 10/17/80 - RECEIVE SRB
 ALIAS      IGC0020H            HMD 01/16/81 - ALIAS IS SVC NAME
 ALIAS      FINDASCB            HMD 01/16/81 - USEFUL ENTRY POINT
 ALIAS      JS                  HMD 01/16/81 - AVOID EXTRA TYPING
 NAME       JSTATUS(R)
//LOCLLOAD  DD   DSN=SYST.LOCLMODS.LOAD,DISP=SHR
//SG25      EXEC  LINKS,NAME=LPALIB,MOD=IGC00XXX,OBJ=OBJPDS01,
//  PARM='MAP,LIST,XREF,RENT,REFR,LET'
//SYSLIN    DD   *
 INCLUDE  LOCLLOAD(IGC00XXX)    FOR FIRST 16 ALIASES UNUSED SVCS
 ALIAS    IGC0024A   1ST ALIAS  HMD 05/02/81 - UNUSED SVC 241
 ALIAS    IGC0024{              HMD 09/05/81 - UNUSED SVC 240
 ALIAS    IGC0023I              HMD 09/05/81 - UNUSED SVC 239
 ALIAS    IGC0023F              HMD 01/13/82 - UNUSED SVC 236
 ALIAS    IGC0023E              HMD 05/02/81 - UNUSED SVC 235
 ALIAS    IGC0023B              HMD 01/13/82 - UNUSED SVC 232
 ALIAS    IGC0022H              HMD 07/05/82 - UNUSED SVC 228
 ALIAS    IGC0022F              HMD 05/02/81 - UNUSED SVC 226
 ALIAS    IGC0022E              HMD 05/02/81 - UNUSED SVC 225
 ALIAS    IGC0022D              HMD 09/05/81 - UNUSED SVC 224
 ALIAS    IGC0022C              HMD 09/05/81 - UNUSED SVC 223
 ALIAS    IGC0022{              HMD 09/05/81 - UNUSED SVC 220
 ALIAS    IGC0021I              HMD 09/05/81 - UNUSED SVC 219
 ALIAS    IGC0021F              HMD 06/08/82 - UNUSED SVC 216
 ALIAS    IGC0021B              HMD 05/02/81 - UNUSED SVC 212
 ALIAS    IGC0021{  16TH ALIAS  HMD 09/05/81 - UNUSED SVC 210
 NAME     IGC00XXX(R)           UNUSED-SVC DUMMY INTERFACE ROUTINE
//LOCLLOAD  DD   DSN=SYST.LOCLMODS.LOAD,DISP=SHR
//SG26      EXEC  LINKS,NAME=LPALIB,MOD=IGC00YYY,OBJ=OBJPDS01,
//  PARM='MAP,LIST,XREF,RENT,REFR,LET'
//SYSLIN    DD   *
 INCLUDE  LOCLLOAD(IGC00YYY)    FOR SECOND 16 ALIASES UNUSED SVCS
 ALIAS    IGC0020G   1ST ALIAS  HMD 06/08/82 - UNUSED SVC 207
 ALIAS    IGC0020F              HMD 06/08/82 - UNUSED SVC 206
 ALIAS    IGC0020E              HMD 01/13/82 - UNUSED SVC 205
 ALIAS    IGC0020D              HMD 01/13/82 - UNUSED SVC 204
 NAME     IGC00YYY(R)           UNUSED-SVC DUMMY INTERFACE ROUTINE
//LOCLLOAD  DD   DSN=SYST.LOCLMODS.LOAD,DISP=SHR
++MOD (IGC00XXX) LKLIB(LOCLLOAD)  DISTLIB(LOCLLOAD).
++MOD (IGC00YYY) LKLIB(LOCLLOAD)  DISTLIB(LOCLLOAD).
++MOD (IGC0021A) LKLIB(LOCLLOAD)  DISTLIB(LOCLLOAD).
++MOD (IGC0021C) LKLIB(LOCLLOAD)  DISTLIB(LOCLLOAD).
++MOD (IGC0022G) LKLIB(LOCLLOAD)  DISTLIB(LOCLLOAD).
++MOD (IGC0022H) LKLIB(LOCLLOAD)  DISTLIB(LOCLLOAD).
++MOD (IGC0024B) LKLIB(LOCLLOAD)  DISTLIB(LOCLLOAD).
++MOD (IGC0025D) LKLIB(LOCLLOAD)  DISTLIB(LOCLLOAD).
++MOD (IGG019WB) LKLIB(LOCLLOAD)  DISTLIB(LOCLLOAD).
++MOD (IGG019WC) LKLIB(LOCLLOAD)  DISTLIB(LOCLLOAD).
++MOD (IGG019WD) LKLIB(LOCLLOAD)  DISTLIB(LOCLLOAD).
++MOD (IGG019WE) LKLIB(LOCLLOAD)  DISTLIB(LOCLLOAD).
++MOD (IGG019WT) LKLIB(LOCLLOAD)  DISTLIB(LOCLLOAD).
++MOD (IGG019WZ) LKLIB(LOCLLOAD)  DISTLIB(LOCLLOAD).
++MOD (IGG019XQ) LKLIB(LOCLLOAD)  DISTLIB(LOCLLOAD).
++MOD (IGG019X3) LKLIB(LOCLLOAD)  DISTLIB(LOCLLOAD).
++MOD (IGG019YC) LKLIB(LOCLLOAD)  DISTLIB(LOCLLOAD).
++MOD (IGG019YD) LKLIB(LOCLLOAD)  DISTLIB(LOCLLOAD).
++MOD (IGG019YE) LKLIB(LOCLLOAD)  DISTLIB(LOCLLOAD).
++MOD (IGG019YI) LKLIB(LOCLLOAD)  DISTLIB(LOCLLOAD).
++MOD (IGG019YZ) LKLIB(LOCLLOAD)  DISTLIB(LOCLLOAD).
++MOD (IGG0198X) LKLIB(LOCLLOAD)  DISTLIB(LOCLLOAD).
++MOD (IGG0198Z) LKLIB(LOCLLOAD)  DISTLIB(LOCLLOAD).
++MOD (IGX00010) LKLIB(LOCLLOAD)  DISTLIB(LOCLLOAD).
++MOD (IGX00019) LKLIB(LOCLLOAD)  DISTLIB(LOCLLOAD).
++MOD (IGX00032) LKLIB(LOCLLOAD)  DISTLIB(LOCLLOAD).
++MOD (NSLCTRLO) LKLIB(LOCLLOAD)  DISTLIB(LOCLLOAD).
++MOD (NSLEHDRI) LKLIB(LOCLLOAD)  DISTLIB(LOCLLOAD).
++MOD (NSLEHDRO) LKLIB(LOCLLOAD)  DISTLIB(LOCLLOAD).
++MOD (NSLETRLI) LKLIB(LOCLLOAD)  DISTLIB(LOCLLOAD).
++MOD (NSLETRLO) LKLIB(LOCLLOAD)  DISTLIB(LOCLLOAD).
++MOD (NSLOHDRI) LKLIB(LOCLLOAD)  DISTLIB(LOCLLOAD).
++MOD (NSLOHDRO) LKLIB(LOCLLOAD)  DISTLIB(LOCLLOAD).
++MOD (NSLRHDRI) LKLIB(LOCLLOAD)  DISTLIB(LOCLLOAD).
++MOD (NSLTYPEC) LKLIB(LOCLLOAD)  DISTLIB(LOCLLOAD).
++MOD (NSLTYPEP) LKLIB(LOCLLOAD)  DISTLIB(LOCLLOAD).
++MOD (NSLTYPEW) LKLIB(LOCLLOAD)  DISTLIB(LOCLLOAD).
++MOD (NSLREPOS) LKLIB(LOCLLOAD)  DISTLIB(LOCLLOAD).
++MOD (UCC11RES) LKLIB(LOCLLOAD)  DISTLIB(LOCLLOAD).
++MOD (JSTATUS)  LKLIB(LOCLLOAD)  DISTLIB(LOCLLOAD).
$$
./       ADD   NAME=LA00151B
//SSUB151B JOB (M,AJNJ,S610C021),04542HMD,CLASS=A,NOTIFY=SSUB,
//  MSGCLASS=O TYPRUN=HOLD
//*ACCT        HOWARD DEAN,SSU
/*ROUTE  PRINT U90
/*JOBPARM L=999,S=1AAA
//***
//***    SYS PROG: H.M. DEAN
//***    DATE:     07/19/82
//***    LOCATION: SYST.LOCLMODS.CNTL(LA00151B)
//***    DESC:     SMP ----- SMF   EXITS
//***                        TSO   EXITS
//***                        USER  EXITS
//***
//***   WARNING:    D O     N O T    N U M B E R
//***               T H I S   D A T A S E T.....
//***
//***               IT CONTAINS IEBUPDTE INFORMATION
//***               AND YOU WILL RUIN THE LINE NUMBERS
//***               IF YOU RENUMBER..JUST USE NONUM UNDER
//***               FSE IF YOU MUST EDIT WITHOUT SPF
//***
//***               HOWARD DEAN, 10/10/81
//***
//***
//SMP      EXEC PUTSMP,OPT=200
//SMPCNTL  DD *
   RESTORE S(LA00151) DIS(WRITE).
   RECEIVE S(LA00151).
   APPLY   S(LA00151) DIS(WRITE).
//SMPPTFIN   DD  DATA,DLM=$$
++USERMOD (LA00151)   /* ALL OF OUR EXITS
     *****************************************************************
     *                                                               *
     *       GTEDS: MARINA DEL REY, CALIFORNIA                       *
     *                                                               *
     *       DATE: 07/19/82  BY: H.M. DEAN                           *
     *                                                               *
     *                                                               *
     *       RELEASE         - OS/MVS 3.8                            *
     *       ENVIRONMENT     - 12MB IBM 3033, 12MB AMDAHL V8         *
     *                          8MB IBM 3033N                        *
     *                                                               *
     *       PTF LEVEL       - 8204                                  *
     *                                                               *
     *       USERMOD         - LA00151                               *
     *       JOBNAME         - SSUD151B                              *
     *       TYPE            - MOD/MACUPD/ZAP                        *
     *                                                               *
     *       PRODUCT         - SYSTEM EXIT ROUTINES                  *
     *       MOD/LMOD        - SEE ++MOD STATEMENTS                  *
     *                       - SEE ++MAC STATEMENTS                  *
     *                       - SEE ++ZAP STATEMENTS                  *
     *                                                               *
     *       PROBLEM         - PROVIDE VARIOUS USER EXITS            *
     *                         AT VARIOUS POINTS IN MVS TO ALLOW     *
     *                         US TO MAKE THE OPERATING SYSTEM       *
     *                         FUNCTION AS GTEDS DESIRES.            *
     *                                                               *
     *                                                               *
     *       PURPOSE/        - USER EXITS ARE PROVIDED TO ALLOW      *
     *       ENHANCEMENT       GTEDS FUNCTIONS TO BE MAINTAINED      *
     *                         AT VARIOUS 'TRAP' POINTS IN THE       *
     *                         OPERATING SYSTEM.                     *
     *                                                               *
     *****************************************************************
     */.
++VER (Z038) FMID(JBB1326) /* INDICATE MVS SP/3 */.
++JCLIN.
//SYSGENA     JOB 'SYSTEM GENERATION',MSGLEVEL=1
//SG99        EXEC PGM=IEBCOPY
//SYSPRINT    DD SYSOUT=A
//SYSUT3      DD UNIT=SYSDA,SPACE=(CYL,(10,10))
//SYSUT4      DD UNIT=SYSDA,SPACE=(CYL,(10,10))
//LOCLLOAD    DD DSN=SYST.LOCLMODS.LOAD,DISP=SHR
//LINKLIB     DD DSN=SYS1.LINKLIB,DISP=SHR
//LPALIB      DD DSN=SYS1.LPALIB,DISP=SHR
//SYSIN       DD *
 COPY INDD=LOCLLOAD,OUTDD=LINKLIB
 S M=((JOBNAME,,R))   HMD 06/23/80 - STC INTERCEPT EXIT
 S M=((LOGONXIT,,R))  HMD 06/23/80 - TSO ACCTG EXIT MOD
 COPY INDD=LOCLLOAD,OUTDD=LPALIB
 S M=((JOBNAME,,R))   HMD 06/25/80 - STC INTERCEPT EXIT
 S M=((VSR1SSI,,R))   HMD 04/10/81 - STARS VSR1 SUBSYSTEM INTERFACE
++MOD (IKJEFLD)  LKLIB(LOCLLOAD) DISTLIB(LOCLLOAD)
                 VERSION(EBB1102,JBB1126)          /* HMD 03/81 */.
++MOD (LOGONXIT) LKLIB(LOCLLOAD) DISTLIB(LOCLLOAD) /* HMD 06/80 */.
++MOD (IKJEFF10) LKLIB(LOCLLOAD) DISTLIB(ACMDLIB)
                 VERSION(EBB1102,JBB1126)          /* HMD 03/81 */.
++MOD (IKJEFF53) LKLIB(LOCLLOAD) DISTLIB(AOST4)
                 VERSION(EBB1102,JBB1126)          /* HMD 03/81 */.
++MOD (IEECVXIT) LKLIB(LOCLLOAD) DISTLIB(AOSC5)
                 VERSION(EBB1102,JBB1126)          /* HMD 03/81 */.
++MOD (IEFUJI)   LKLIB(LOCLLOAD) DISTLIB(AOSB3).
++MOD (IEFUTL)   LKLIB(LOCLLOAD) DISTLIB(AOSB3)    /* HMD 05/80 */.
++MOD (IEFACTRT) LKLIB(LOCLLOAD) DISTLIB(AOSB3)    /* HMD 04/81 */.
++MOD (IEFUJV)   LKLIB(LOCLLOAD) DISTLIB(AOSB3)    /* HMD 07/80 */.
++MOD (IEFU29)   LKLIB(LOCLLOAD) DISTLIB(AOS00)    /* HMD 04/81 */.
++MOD (IEFU83)   LKLIB(LOCLLOAD) DISTLIB(AOS00)    /* HMD 04/81 */.
++MOD (IEFU84)   LKLIB(LOCLLOAD) DISTLIB(AOS00)    /* HMD 04/81 */.
++MOD (VSR1SSI)  LKLIB(LOCLLOAD) DISTLIB(LOCLLOAD) /* HMD 04/81 */.
++MOD (JOBNAME)  LKLIB(LOCLLOAD) DISTLIB(LOCLLOAD) /* HMD 06/80 */.
++MACUPD(SGIEE0MS).
./ CHANGE NAME=SGIEE0MS
         DC    CL80'//JOBNAME  DD DSN=SYS1.JOBNAME,DISP=SHR'    LA00151
         DC    CL80'//TSONAME  DD DSN=SYS1.TSONAME,DISP=SHR'    LA00151
./ ENDUP
++ZAP(IEEVJCL).
 NAME IEEVJCL
 VER 0180 C9C5,C5E2,C2F6,F0F5     IEESB605
 REP 0180 D1D6,C2D5,C1D4,C540     JOBNAME
 IDRDATA LA00151
$$
./       ADD   NAME=LA00155B
//SSUD155B JOB (M,AJNJ,S610C021),04542HMD,CLASS=A,NOTIFY=SSUD,
//   MSGCLASS=O
//*ACCT        HOWARD DEAN,SSU
/*ROUTE  PRINT U90
/*JOBPARM L=300,S=ANY
//***
//***    SYS PROG: H.M. DEAN
//***    DATE:     04/15/83 (MODIFIED BY H. DEAN)
//***    LOCATION: SYST.LOCLMODS.CNTL(LA00155B)
//***    DESC:     FULL-SCREEN EDIT:
//***              IKJEBECH - WORK WITHOUT LINE NUMBERS (ZAP)
//***              IKJEBEDE - WORK WITHOUT LINE NUMBERS (ZAP)
//***              AS1000CP
//***              AS1000DP   F
//***              AS1000LO     U
//***              AS1000MV       L
//***              AS1000ST         L
//***              AS1100AD
//***              AS1100AE            S
//***              AS1100BC              C
//***              AS1100BK                R
//***              AS1100CB  FFFFFFFF        E
//***              AS1100CX  FF                E
//***              AS1100ED  FFFFFF              N
//***              AS1100EE  FF       SSSSSSSSSSS
//***              AS1100FL  FF       SSS           E
//***              AS1100IN  FF       SSS             D
//***              AS1100LC           SSS     EEEEEEEE  I
//***              AS1100LL     SSSSSSSSS     E           T
//***              AS1100MA                   EEEEEE
//***              AS1100PK                   E
//***              AS1100RD                   E
//***              AS1100RM                   EEEEEEEE
//***              AS1100RS
//***              AS1100SD
//***              AS1100TB
//***              AS1100TL
//***              AS1100T1
//***              AS1100T2
//***
//***              EDIT SUBCOMMANDS:
//***              IKJEBECT - EDIT COUNT SUBCOMMAND
//***              IKJEBECX - EDIT 'CHANGE HEX' SUBCOMMAND
//***              IKJEBELX - EDIT 'LIST HEX' SUBCOMMAND
//***              IKJEBEMV - EDIT VARIABLE MOVE SUBROUTINE
//***              IKJEBENA - EDIT 'NAME' SUBCOMMAND
//***              IKJEBEOF - EDIT 'OFFLINE' SUBCOMMAND
//***              IKJEBEPT - EDIT 'PUT' SUBCOMMAND
//***              IKJEBESP - EDIT 'SPOT'/'SELECT'/'EXCLUDE'
//***              IKJEBESS - EDIT 'SAVE SHR' SUBCOMMAND
//***              IKJEBETB - EDIT 'LIST TABS' SUBCOMMAND
//***
//***              IKJEBMA9 - EDIT USER SUBCOMMAND TABLE
//***
//*****************************************************************
//***  F U L L     S C R E E N    E D I T    L O C A L    M O D   *
//***                                                             *
//***    E D I T     S U B C O M M A N D    L O C A L    M O D    *
//***                                                             *
//*** INSTALLED BY HOWARD DEAN ON 09/23/81                        *
//*****************************************************************
//*****************************************************************
//**           WARNING WARNING WARNING WARNING WARNING            *
//**             ×        ×       ×       ×       ×               *
//**             ×        ×       ×       ×       ×               *
//**             V        V       V       V       V               *
//**  NOTE:  DO NOT RENUMBER THIS DATASET. IT CONTAINS A MACRO    *
//**         UPDATE AND WILL BE RUINED IF RENUMBERING TAKES PLACE.*
//**                                                              *
//*****************************************************************
//SMP      EXEC PUTSMP,OPT=200
//SMPCNTL  DD *
   REJECT  S(LA00155).
   RECEIVE S(LA00155).
   APPLY   S(LA00155) DIS(WRITE).
//SMPPTFIN DD DATA,DLM=$$
++ USERMOD (LA00155)        /* F U L L    S C R E E N    E D I T
                               AND OTHER USEFULL EDIT SUBCOMMANDS....
     *****************************************************************
     *                                                               *
     *       GTEDS: MARINA DEL REY, CALIFORNIA                       *
     *                                                               *
     *       DATE: 04/15/83  BY: HOWARD M. DEAN                      *
     *                                                               *
     *                                                               *
     *       RELEASE         - OS/MVS 3.8                            *
     *       ENVIRONMENT     - 16MB IBM 3033, 16MB AMDAHL V8         *
     *                         24MB IBM 3081                         *
     *                                                               *
     *       PTF LEVEL       - 8301                                  *
     *                                                               *
     *       USERMOD         - LA00155                               *
     *       JOBNAME         - SSUD155A                              *
     *       TYPE            - MOD,ZAP                               *
     *                                                               *
     *       PRODUCT         - FULL SCREEN EDIT AND OTHER            *
     *                         SUBCOMMANDS                           *
     *                                                               *
     *       MODS            - IKJEBEMA,IKJEBECT,IKJEBECX,IKJEBETB,  *
     *                         IKJEBELX,IKJEBEMV(IKJEBEAA),          *
     *                         IKJEBENA,IKJEBEOF,IKJEBEPT,           *
     *                         IKJEBESP,IKJEBMSS,IKJEBMA9            *
     *                                                               *
     *                         AS1000CP,AS1000DP,AS1000LO,AS1000MV,  *
     *                         AS1000ST,AS1100AD,AS1100AE,AS1100BC,  *
     *                         AS1100BK,AS1100CB,AS1100CX,AS1100ED,  *
     *                         AS1100EE,AS1100FL,AS1100IN,AS1100LC,  *
     *                         AS1100LL,AS1100MA,AS1100PK,AS1100RD,  *
     *                         AS1100RM,AS1100SD,AS1100TB,AS1100TG,  *
     *                         AS1100TL,AS1100T1,AS1100T2            *
     *                                                               *
     *       LMODS           - IKJEBEMA,IKJEBECT,IKJEBECX,IKJEBETB   *
     *                         IKJEBELX,IKJEBEAA,IKJEBENA,           *
     *                         IKJEBEOF,IKJEBEPT,IKJEBESP,IKJEBESS   *
     *                                                               *
     *                         AS1000CP,AS1000DP,AS1000LO,           *
     *                         AS1000MV,AS1000ST,AS1100BK,           *
     *                         AS1100RS,AS1100IN,AS1100MA            *
     *                                                               *
     *       SZAP            - IKJEBEMA,IKJEBECH,IKJEBEDE            *
     *                                                               *
     *       PROBLEM         - PROVIDE FULL-SCREEN CAPABILITY        *
     *                         UNDER TSO EDIT. ADD OTHER USEFUL      *
     *                         EDIT SUBCOMMANDS FOR THOSE WHO        *
     *                         DO NOT HAVE FULL SCREEN TERMINALS     *
     *                                                               *
     *       ENHANCEMENT     - DUMMY ZAP TO IKJEBEMA FOR SMP         *
     *                            (TO AVOID MAINTAINCE REGRESSION)   *
     *                                                               *
     *                       IKJEBMA9 - EDIT USER SUBCOMMAND TABLE   *
     *                                                               *
     *                         ZAP FOR CHANGE AND DELETE SUBCOMMANDS *
     *                         TO WORK WITH NONUM DATASETS           *
     *                            (SEE ABOVE FOR MODULES ZAPPED)     *
     *                                                               *
     *                         FULL-SCREEN EDIT MODULES ADDED        *
     *                            (SEE ABOVE FOR MODULE LIST)        *
     *                                                               *
     *                       NEW EDIT SUBCOMMANDS:                   *
     *                                                               *
     *                       IKJEBECT - EDIT COUNT SUBCOMMAND        *
     *                       IKJEBECX - EDIT 'CHANGE HEX' SUBCOMMAND *
     *                       IKJEBELX - EDIT 'LIST HEX' SUBCOMMAND   *
     *                       IKJEBEMV - EDIT VARIABLE MOVE SUBROUTINE*
     *                       IKJEBENA - EDIT 'NAME' SUBCOMMAND       *
     *                       IKJEBEOF - EDIT 'OFFLINE' SUBCOMMAND    *
     *                       IKJEBEPT - EDIT 'PUT' SUBCOMMAND        *
     *                       IKJEBESP - EDIT 'SPOT'/'SELECT'/'EXCLUDE*
     *                       IKJEBESS - EDIT 'SAVE SHR' SUBCOMMAND   *
     *                       IKJEBETB - EDIT 'LIST TABS' SUBCOMMAND  *
     *                                                               *
     *                                                               *
     *                                                               *
     *****************************************************************
     */.
++ VER (Z038) FMID(EBB1102) PRE(UZ25185,UZ28995,UZ26263,
                                UZ33626,UZ52703,UZ53532,
                                UZ59807).
++ JCLIN.
//SYGEN01  JOB 'SYSTEM GENERATION',MSGLEVEL=1
//SG20      EXEC  PGM=IEWL,PARM='LIST,XREF,RENT,REUS'
//SYSUT1   DD  DISP=(NEW,DELETE),DSNAME=&&SYSUT1,SPACE=(1700,(400,50)),
//   UNIT=SYSDA
//SYSPRINT DD  SYSOUT=A
//SYSLMOD  DD  DSN=SYS1.CMDLIB,DISP=OLD
//ACMDLIB  DD  DSN=SYS1.ACMDLIB,DISP=OLD
//LOCLLOAD DD  DSN=SYST.LOCLMODS.LOAD,DISP=OLD
//LOCLOBJ  DD  DSN=SYST.LOCLMODS.OBJ,DISP=OLD
//SYSLIN   DD  *
  INCLUDE ACMDLIB(AS1000CP)
  NAME           AS1000CP(R)
  INCLUDE ACMDLIB(AS1000DP)
  NAME           AS1000DP(R)
  INCLUDE ACMDLIB(AS1000LO)
  NAME           AS1000LO(R)
  INCLUDE ACMDLIB(AS1000MV)
  NAME           AS1000MV(R)
  INCLUDE ACMDLIB(AS1000ST)
  NAME           AS1000ST(R)
  INCLUDE ACMDLIB(AS1100BK)
  NAME           AS1100BK(R)
  INCLUDE ACMDLIB(AS1100RS)
  NAME           AS1100RS(R)
  INCLUDE ACMDLIB(AS1100IN)
  NAME           AS1100IN(R)
  INCLUDE ACMDLIB(AS1100MA)
  INCLUDE ACMDLIB(AS1100AD)
  INCLUDE ACMDLIB(AS1100AE)
  INCLUDE ACMDLIB(AS1100BC)
  INCLUDE ACMDLIB(AS1100CB)
  INCLUDE ACMDLIB(AS1100CX)
  INCLUDE ACMDLIB(AS1100ED)
  INCLUDE ACMDLIB(AS1100EE)
  INCLUDE ACMDLIB(AS1100FL)
  INCLUDE ACMDLIB(AS1100LC)
  INCLUDE ACMDLIB(AS1100LL)
  INCLUDE ACMDLIB(AS1100PK)
  INCLUDE ACMDLIB(AS1100RD)
  INCLUDE ACMDLIB(AS1100RM)
  INCLUDE ACMDLIB(AS1100SD)
  INCLUDE ACMDLIB(AS1100TB)
  INCLUDE ACMDLIB(AS1100TG)
  INCLUDE ACMDLIB(AS1100TL)
  INCLUDE ACMDLIB(AS1100T1)
  INCLUDE ACMDLIB(AS1100T2)
  ENTRY          AS1100MA
  NAME           AS1100MA(R)
  INCLUDE ACMDLIB(IKJEBEMA)
  INCLUDE ACMDLIB(IKJEBEEN)
  INCLUDE ACMDLIB(IKJEBEXT)
  INCLUDE ACMDLIB(IKJEBEUT)
  INCLUDE ACMDLIB(IKJEBMA9)
  ENTRY   IKJEBEMA
  ALIAS   IKJEBEEN
  ALIAS   IKJEBEXT
  ALIAS   IKJEBEUT
  ORDER IKJEBEMA(P),IKJEBMA1,IKJEBMA2,IKJEBMA3
  ORDER IKJEBMA8,IKJEBMA9,IKJEBEAE,IKJEBEAT,IKJEBEEN
  ORDER IKJEBEN0,IKJEBEUT,PCL
  NAME    IKJEBEMA(R)
  INCLUDE ACMDLIB(IKJEBECH)
  INCLUDE ACMDLIB(IKJEBESE)
  ENTRY   IKJEBECH
  ALIAS   IKJEBESE
  NAME    IKJEBECH(R)
  INCLUDE  ACMDLIB(IKJEBECT)
  ENTRY    COUNT
  NAME     IKJEBECT(R)
  INCLUDE  ACMDLIB(IKJEBECX)
  ENTRY    IKJEBECH
  NAME     IKJEBECX(R)
  INCLUDE  ACMDLIB(IKJEBELX)
  ENTRY    IKJEBELT
  NAME     IKJEBELX(R)
  INCLUDE  ACMDLIB(IKJEBEOF)
  ENTRY    IKJEBEOF
  NAME     IKJEBEOF(R)
  INCLUDE  ACMDLIB(IKJEBEPT)
  ENTRY    PUT
  NAME     IKJEBEPT(R)
  INCLUDE  ACMDLIB(IKJEBENA)
  ENTRY    NAME
  NAME     IKJEBENA(R)
  INCLUDE  ACMDLIB(IKJEBESP)
  ENTRY    SPOT
  NAME     IKJEBESP(R)
  INCLUDE  ACMDLIB(IKJEBESS)
  ENTRY    IKJEBESA
  NAME     IKJEBESS(R)
  INCLUDE  ACMDLIB(IKJEBETB)
  ENTRY    IKJEBETB
  NAME     IKJEBETB(R)
++MOD  (AS1000CP)  TXLIB(LOCLOBJ) DISTLIB(ACMDLIB)    .
++MOD  (AS1000DP)  TXLIB(LOCLOBJ) DISTLIB(ACMDLIB)    .
++MOD  (AS1000LO)  TXLIB(LOCLOBJ) DISTLIB(ACMDLIB)    .
++MOD  (AS1000MV)  TXLIB(LOCLOBJ) DISTLIB(ACMDLIB)    .
++MOD  (AS1000ST)  TXLIB(LOCLOBJ) DISTLIB(ACMDLIB)    .
++MOD  (AS1100AD)  TXLIB(LOCLOBJ) DISTLIB(ACMDLIB)    .
++MOD  (AS1100AE)  TXLIB(LOCLOBJ) DISTLIB(ACMDLIB)    .
++MOD  (AS1100BC)  TXLIB(LOCLOBJ) DISTLIB(ACMDLIB)    .
++MOD  (AS1100BK)  TXLIB(LOCLOBJ) DISTLIB(ACMDLIB)    .
++MOD  (AS1100CB)  TXLIB(LOCLOBJ) DISTLIB(ACMDLIB)    .
++MOD  (AS1100CX)  TXLIB(LOCLOBJ) DISTLIB(ACMDLIB)    .
++MOD  (AS1100ED)  TXLIB(LOCLOBJ) DISTLIB(ACMDLIB)    .
++MOD  (AS1100EE)  TXLIB(LOCLOBJ) DISTLIB(ACMDLIB)    .
++MOD  (AS1100FL)  TXLIB(LOCLOBJ) DISTLIB(ACMDLIB)    .
++MOD  (AS1100IN)  TXLIB(LOCLOBJ) DISTLIB(ACMDLIB)    .
++MOD  (AS1100LC)  TXLIB(LOCLOBJ) DISTLIB(ACMDLIB)    .
++MOD  (AS1100LL)  TXLIB(LOCLOBJ) DISTLIB(ACMDLIB)    .
++MOD  (AS1100MA)  TXLIB(LOCLOBJ) DISTLIB(ACMDLIB)    .
++MOD  (AS1100PK)  TXLIB(LOCLOBJ) DISTLIB(ACMDLIB)    .
++MOD  (AS1100RD)  TXLIB(LOCLOBJ) DISTLIB(ACMDLIB)    .
++MOD  (AS1100RM)  TXLIB(LOCLOBJ) DISTLIB(ACMDLIB)    .
++MOD  (AS1100RS)  TXLIB(LOCLOBJ) DISTLIB(ACMDLIB)    .
++MOD  (AS1100SD)  TXLIB(LOCLOBJ) DISTLIB(ACMDLIB)    .
++MOD  (AS1100TB)  TXLIB(LOCLOBJ) DISTLIB(ACMDLIB)    .
++MOD  (AS1100TG)  TXLIB(LOCLOBJ) DISTLIB(ACMDLIB)    .
++MOD  (AS1100TL)  TXLIB(LOCLOBJ) DISTLIB(ACMDLIB)    .
++MOD  (AS1100T1)  TXLIB(LOCLOBJ) DISTLIB(ACMDLIB)    .
++MOD  (AS1100T2)  TXLIB(LOCLOBJ) DISTLIB(ACMDLIB)    .
++MOD  (IKJEBECT)  LKLIB(LOCLLOAD) DISTLIB(ACMDLIB)   .
++MOD  (IKJEBECX)  LKLIB(LOCLLOAD) DISTLIB(ACMDLIB)   .
++MOD  (IKJEBELX)  LKLIB(LOCLLOAD) DISTLIB(ACMDLIB)   .
++MOD  (IKJEBEAA)  LKLIB(LOCLLOAD) DISTLIB(ACMDLIB)   .
++MOD  (IKJEBENA)  LKLIB(LOCLLOAD) DISTLIB(ACMDLIB)   .
++MOD  (IKJEBEOF)  LKLIB(LOCLLOAD) DISTLIB(ACMDLIB)   .
++MOD  (IKJEBEPT)  LKLIB(LOCLLOAD) DISTLIB(ACMDLIB)   .
++MOD  (IKJEBESP)  LKLIB(LOCLLOAD) DISTLIB(ACMDLIB)   .
++MOD  (IKJEBESS)  LKLIB(LOCLLOAD) DISTLIB(ACMDLIB)   .
++MOD  (IKJEBETB)  LKLIB(LOCLLOAD) DISTLIB(ACMDLIB)   .
++MOD  (IKJEBMA9)  LKLIB(LOCLLOAD) DISTLIB(ACMDLIB)   .
++ ZAP (IKJEBEMA) /*
   DUMMY ZAP SO THAT SMP KNOWS THAT TSO EDIT WAS HIT BY FSE */.
   NAME IKJEBEMA
   VER 0000 47F0
   REP 0000 47F0
   IDRDATA LA00155
++ ZAP (IKJEBECH)  /*  =====>  CHANGE COMMAND      */.
   NAME IKJEBECH
   VER 0376 9101907C
   VER 037A 47E0
   REP 037A 47F0
   IDRDATA LA00155
++ ZAP (IKJEBEDE) /*  =====>  DELETE COMMAND     */.
   NAME IKJEBEDE
   VER 00CA 9101907C
   VER 00CE 4780
   REP 00CE 47F0
   IDRDATA LA00155
++MACUPD (IKJEBEHP) MALIAS(EDIT,E) DISTLIB(AHELP).
./  CHANGE  NAME=IKJEBEHP
)S SUBCOMMANDS -
  ALLOCATE,BOTTOM,CHANGE,CHANGEX,COPY,DELETE,DOWN,DSAT,
  END,EXEC,EXCLUDE,FIND,FORMAT,HELP,INPUT,INSERT,LDSN,
  LIST,LISTM,LISTSPC,LISTX,LTABS,
  MERGE,MOVE,OFFLINE,PROFILE,PUT,QLIST,RENUM,RUN,SAVE,SAVESHR,
  SCAN,SELECT,SEND,SPOT,SUBMIT,TABSET,TOP,UNNUM,UP,VERIFY.
  (TO OBTAIN HELP ON THE INSERT/REPLACE/DELETE FUNCTION, ENTER HELP
  LINEDIT).



  FULL-SCREEN EDIT SUBCOMMANDS -
     FSE,BLANK,CPY,DUP,LINENO,MVE,SHIFTL,SHIFTR

  LOCAL SUBCOMMANDS -
     SFIND      (SECURITY PACIFIC NATIONAL BANK EXTENDED 'FIND')

=LISTSPC=LISTSP
)F FUNCTION -
    THE LISTSPC COMMAND LISTS THE TRACKS ALLOCATED, TRACKS UNUSED, AND
    NUMBER OF EXTENTS FOR CATALOGED DISK DATA SETS, INDIVIDUALLY OR IN
    SMALL GROUPS. IT IS MORE EFFICIENT FOR THIS KIND OF DISPLAY THAN
    THE SPACE COMMAND SINCE IT SEARCHES FOR CATALOGED DATA SETS
    ONLY, WHEREAS SPACE SEARCHES FOR ANY DISK-RESIDENT DATA SETS -
    CATALOGED OR NOT.
)X SYNTAX -
    LISTSPC   DATASET('DSNAME-LIST')  LEVEL('INDEX-LEVEL')
              VOLUME('VOLUME-LIST')  EXTENTS
    REQUIRED - DATESET('DSNAME') OR LEVEL('INDEX-LEVEL') OR
               VOLUME('VOLUME')
    DEFAULTS - NONE
    ALIAS    - NONE
)O OPERANDS -
))DATASET('DSNAME-LIST') -
               - SPECIFIES A LIST OF DATA SET NAMES ABOUT WHICH YOU WISH
                 TO HAVE SPACE INFORMATION DISPLAYED.
))LEVEL('INDEX-LEVEL') -
               - SPECIFIES AN INDEX LEVEL IN THE CATALOG FOR
                 WHICH YOU WANT SPACE INFORMATION. THIS MAY BE
                 A DSNAME CONTAINING ONE EMBEDDED ASTERISK.
))VOLUME('VOLUME-LIST') -
               - IF USED WITH THE DATASET PARAMETER, SPECIFIES THE
                 VOLUME THE DATA SET RESIDES ON. NO CATALOG SEARCH
                 WILL BE PERFORMED.
                 IF SPECIFIED ALONE, SPECIFIES A LIST OF VOLUMES FOR
                 WHICH FREE SPACE INFORMATION WILL BE PRODUCED.
))EXTENTS      - IF SPECIFIED, THEN THE EXTENTS FOR EACH DATA SET WILL
                 BE DISPLAYED WITH HEXADECIMAL ADDRESSES.
=LDSN=LDS
)F FUNCTION -
               THE LDSN SUBCOMMAND IS USED TO DISPLAY ALLOCATION
               INFORMATION FOR DATA SETS ON A DIRECT ACCESS
               DEVICE.

               LDSN WILL SEARCH THE OS CATALOG AND CVOLS FOR THE
               ENTRIES FOR THE DATA SETS SPECIFIED.  ALLOCATION
               INFORMATION WILL BE OBTAINED FROM THE VOLUME TABLE
               OF CONTENTS, FORMATTED AND DISPLAYED.  IF A NAME IS
               AN INDEX NAME, ALL DATA SETS BELOW THE INDEX WILL
               BE DISPLAYED.

               THE USER MAY BYPASS THE CATALOG SEARCH BY SUPPLYING
               THE VOLUME SERIAL ON WHICH THE DATA SET RESIDES.
               THIS OPTION PERMITS DISPLAYING INFORMATION FOR
               UNCATALOGED DATA SETS.

               THE ATTRIBUTES TO BE DISPLAYED MAY BE SELECTED BY
               THE USER WHEN HE ENTERS THE LDSN SUBCOMMAND BY
               SPECIFYING KEYWORD OPERANDS.

               THE LDSN SUBCOMMAND MAY BE USED IN SUBCOMMAND PROCEDURES
               TO FIND THE ALLOCATION OF A DATA SET OR A GROUP OF
               DATA SETS AND SET THE RETURN CODE TO THE SPECIFIED
               VALUE.  THE RETURN CODE MAY THEN BE TESTED WITH THE
               &LASTCC VARIABLE. OUTPUT MAY BE SUPPRESSED BY
               SPECIFYING NOPRINT.  THE HARDCOPY KEYWORD MAY BE USED
               TO DIRECT THE OUTPUT TO A PRE-ALLOCATED DATA SET.

               THE USER MAY CHOOSE WHAT INFORMATION WILL BE
               DISPLAYED BY ENTERING KEYWORDS.

               THE INFORMATION THAT MAY BE DISPLAYED IS:
                1. VOLUME SERIAL ON WHICH THE DATA SET IS LOCATED.
                2. FILE SEQUENCE NUMBER.
                3. DEVICE TYPE CODE FROM CATALOG ENTRY.
                4. ALLOCATION  (ALLOCATED, USED, AND EXTENTS).
                5. SECONDARY ALLOCATION (AMOUNT AND UNITS).
                6. DATA SET ORGANIZATION.
                7. DCB (RECFM, BLKSIZE, AND LRECL).
                8. CREATION DATE.
                9. EXPIRATION DATE.
               10. LAST DATE REFERENCED (MVS SU 60).
               11. FULLY QUALIFIED DATA SET NAME.
               12. CCHHR OF THE FORMAT 1 DSCB.
               13. GENERATION DATA GROUP DATA.
               14. PDS DIRECTORY INFORMATION.
)X SYNTAX -
               LDSN (NAME-LIST)  SERIAL/NOSERIAL   ALLOC/NOALLOC
                                 DSORG/NODSORG     DCB/NODCB
                                 CRDATE/NOCRDATE   EXDATE/NOEXDATE
                                 LASTREF/NOLASTREF
                                 TOTALS/NOTOTALS   PRINT/NOPRINT
                                 HEADER/NOHEADER   ALL/DAONLY
                                 GDGDATA/NOGDGDATA SEQNO/NOSEQNO
                                 DEVTYPE/NODEVTYPE DEVICE/NODEVICE
                                 CCHHR/NOCCHHR     PDS/NOPDS
                                 SECONDARY/NOSECONDARY
                                 GENERIC           DSONLY
                                 HARDCOPY(DDNAME)  VOLUME(SERIAL)
                                 RC(TALLOC/TUSED/TDIFF/
                                    LALLOC/LUSED/LDIFF/NUM/
                                    PREVIOUS/DSORG/DIRALLOC/
                                    DIRUSED/ENTRIES/ALIASES/
                                    MEMBERS)

               DEFAULTS -  NAME-LIST DEFAULTS TO PREFIX
                           SERIAL   ALLOC   DSORG    DCB    CRDATE
                           NOEXDATE TOTALS  PRINT    HEADER ALL
                           NOPDS    NOSEQNO NODEVICE NODEVTYPE
                           NOGDGDATA    NOLASTREF    NOSECONDARY
)O OPERANDS -
               NAME-LIST - ONE OR MORE DATA SET OR INDEX LEVEL
                           NAMES. TSO NAMING CONVENTIONS ARE USED.
                           IF A SPECIFIED NAME IS AN INDEX NAME,
                           DATA SETS UNDER THAT LEVEL WILL BE
                           DISPLAYED.  IF NO NAME IS SPECIFIED,
                           THE PREFIX WILL BE USED.  FOR MVT AND
                           SVS, THIS IS THE USERID.  FOR MVS,
                           THE PREFIX MAY BE SPECIFIED WITH THE
                           PROFILE SUBCOMMAND. IF NO NAME IS
                           SPECIFIED AND THE PROFILE SPECIFIES
                           NOPREFIX, THE USERID WILL BE USED.

                           NOTE - IF A KEYWORD IS ENTERED,
                                  NAME-LIST MUST BE SPECIFIED.  IF
                                  NAME-LIST IS OMITTED, IT WILL
                                  NOT DEFAULT TO THE PREFIX, BUT
                                  THE KEYWORD WILL BE INTERPRETED
                                  AS THE NAME-LIST, NOT A KEYWORD.
))SERIAL        SPECIFIES THAT VOLUME SERIAL NUMBERS
                ARE TO BE DISPLAYED FOR EACH DATA SET

))NOSERIAL      SPECIFIES THAT VOLUMES SERIAL NUMBERS
                ARE NOT TO BE DISPLAYED FOR EACH DATA SET

))SEQNO         SPECIFIES THAT THE FILE SEQUENCE NUMBER
                IS TO BE DISPLAYED FOR EACH DATASET LISTED.

))NOSEQNO       SPECIFIES THAT THE FILE SEQUENCE NUMBER
                IS NOT TO BE DISPLAYED FOR EACH DATASET LISTED.

))DEVTYPE       SPECIFIES THAT THE DEVICE CODE FROM THE CATALOG
                IS TO BE DISPLAYED FOR EACH DATASET.

))NODEVTYPE     SPECIFIES THAT THE DEVICE CODE FROM THE CATALOG
                IS NOT TO BE DISPLAYED FOR EACH DATASET.

))DEVICE        SPECIFIES THAT THE NAME OF THE DEVICE (3350,3330,ETC)
                IS TO BE DISPLAYED FOR EACH DATASET LISTED.

))NODEVICE      SPECIFIES THAT THE DEVICE NAME IS NOT TO BE LISTED
                FOR EACH DATASET DISPLAYED.

))ALLOC         SPECIFIES THAT ALLOCATION INFORMATION (TRACKS ALLOC,
                TRACKS USED, AND EXTENTS) IS TO BE LISTEDFOR EACH
                DATASET DISPLAYED.

))NOALLOC       SPECIFIES THAT ALLOCATION INFORMATION IS NOT TO BE
                LISTED.

))SECONDARY     SPECIFIES THAT SECONDARY ALLOCATION VALUES ARE TO
                BE LISTED FOR EACH DATASET NAME DISPLAYED.

))NOSECONDARY   SPECIFES THAT SECONDARY ALLOCATION VALUES ARE NOT
                TO BE LISTED FOR EACH DATASET.

))DSORG         SPECIFIES THAT THE DATA SET ORGANIZATION (DSORG)
                IS TO BE LISTED FOR EACH DATASET DISPLAYED.

))NODSORG       SPECIFIES THAT THE DATA SET ORGANIZATION (DSORG)
                IS NOT TO BE LISTED FOR EACH DATASET DISPLAYED.

))PDS           SPECIFIES THAT PDS DIRECTORY INFORMATION (BLOCKS ALLOC,
                BLOCKS USED, ENTRIES, AND ALIASES) ARE TO BE LISTED
                FOR EACH DATASET DISPLAYED.

                NOTE: THE MESSAGE 'DATA SET IN USE' INDICATES THAT
                      ANOTHER USER HAS EXCLUSIVE CONTROL OF THE
                      DATA SET AND LDSN COULD NOT ALLOCATE IT.

                      IF AN ERROR OCURS, DURING THE PROCESSING OF
                      THE PDS DIRECTORY, AN ERROR MESSAGE WILL
                      APPEAR IN THE PDS DATA FIELDS:

                         RC = RETURN CODE FROM DAIR
                       DARC = DYNAMIC ALLOCATION RETURN CODE
                       CTRC = CATALOG RETURN CODE

))NOPDS         SPECIFIES THAT PDS DIRECTORY INFORMATION IS NOT
                TO BE LISTED FOR ANY PARTITIONED DATA SETS DISPLAYED.

))DCB           SPECIFIES THAT DCB INFORMATION (RECFM, BLKSIZE,
                LRECL) IS TO BE LISTED FOR EACH DATA SET NAME
                DISPLAYED.

))NODCB         SPECIFIES THAT DCB INFORMATION IS NOT TO BE LISTED
                FOR EACH DATA SET NAME DISPLAYED.

))CREATE        SPECIFIES THAT THE CREATION DATE IS TO BE DISPLAYED
                FOR EACH DATASET DISPLAYED.

))NOCRDATE      SPECIFIES THAT THE CREATION DATE IS NOT TO BE
                DISPLAYED FOR EACH DATA SET LISTED.

))EXDATE        SPECIFIES THAT THE EXPIRATION DATE IS TO BE
                DISPLAYED FOR EACH DATA SET LISTED.

))NOEXDATE      SPECIFIES THAT THE EXPIRATION DATE IS NOT TO BE
                DISPLAYED FOR EACH DATA SET LISTED.

))LASTREF       SPECIFIES THAT THE LAST REFERENCED DATE (MVS SU 60)
                IS TO BE DISPLAYED FOR EACH DATA SET LISTED.

))NOLASTREF     SPECIFIES THAT THE LAST REFERENCED DATE IS NOT
                DO BE DISPLAYED FOR EACH DATA SET LISTED.

))CCHHR         SPECIFIES THAT THE FORMAT 1 DSCB ADDRESS IS TO
                BE DISPLAYED FOR EACH DATA SET LISTED.

))NOCCHHR       SPECIFIES THAT THE FORMAT 1 DSCB ADDRESS IS NOT
                TO BE DISPLAYED FOR EACH DATA SET LISTED.

))TOTALS        SPECIFIES THAT TOTALS (TRACKS ALLOCATED, TRACKS
                USED AND NUMBER OF DATA SETS DISPLAYED) ARE TO BE
                DISPLAYED.

))NOTOTALS      SPECIFIES THAT TOTALS ARE NOT TO BE DISPLAYED FOR
                THE LISTED DATA SETS.

))PRINT         SPECIFIES THAT TERMINAL OUTPUT IS TO BE DISPLAYED.

))NOPRINT       SPECIFIES THAT TERMINAL OUTPUT IS TO BE SUPPRESSED.
                THE RESULTS OF THE SUBCOMMAND CAN BE INTERROGATED BY
                MEANS OF THE RETURN CODE (LASTCC). THIS KEYWORD WAS
                MEANT TO BE USED IN SUBCOMMAND PROCEDURES WHERE LDSN IS
                BEING USED TO SET THE RETURN CODE.

))HEADER        SPECIFIES THAT THE OUTPUT HEADER LINE IS TO BE
                DISPLAYED.

))NOHEADER      SPECIFIES THAT THE OUTPUT HEADER LINE IS NOT TO BE
                DISPLAYED.

))ALL           DISPLAY ALL DATA SET NAMES UNDER AN INDEX LEVEL.

))DAONLY        DISPLAY DATA SETS UNDER AN INDEX LEVEL ON MOUNTED
                DIRECT ACCESS DEVICES ONLY.

))GDGDATA       SPECIFIES THAT INFORMATION ABOUT GENERATION DATA
                GROUP INDICES ARE TO BE DISPLAYED.

))NOGDGDATA     SPECIFIES THAT INFORMATION ABOUT GENERATION GROUP
                INDICES ARE NOT TO BE DISPLAY.

))GENERIC       SPECIFIES THAT THE 'NAME' ENTRY       ** MVS ONLY **
                IS A GENERIC KEY TO BE SEARCHED VIA VSAM GENERIC
                LOCATE.

))DSONLY        SPECIFIES THAT THE 'NAME' ENTRY IS A WHOLE DATA
                SET NAME RATHER THAN AN INDEX.

))VOLUME        SPECIFIES THE VOLUME TO BE SEARCHED FOR THE DATA SET.
                THIS KEYWORD IS USEFUL IF THE DATA SETS TO BE DISPLAYED
                ARE NOT CATALOGED TO THE VOLUME SPECIFIED, OR NOT
                CATALOGED AT ALL.

                IF VOLUME(*) IS SPECIFIED, ALL ONLINE VOLUMES ARE
                SEARCH FOR THE DATA SET.

))HARDCOPY      SPECIFIES THE DDNAME A PRE-ALLOCATED DATA SET TO
                RECEIVE A COPY OF LDSN OUTPUT.

))RC            SPECIFIES HOW THE RETURN CODE IS TO BE SET:

                RC NOT SPECIFIED:  4 - SUCCESSFUL COMPLETION
                                  16 - UNABLE TO INTERPRET SUBCOMMAND

                TALLOC               - TOTAL TRACKS USED
                TUSED                - TOTAL TRACKS USED
                TDIFF                - TOTAL OVERALLOCATION
                                       (TALLOC-TUSED)
                LALLOC               - TRACKS ALLOCATED BY LAST
                                       DATA SET
                LUSED                - TRACKS USED BY LAST DATA SET
                LDIFF                - LAST DATA SET OVERALLOCATION
                                       (LALLOC-LUSED)
                NUM                  - NUMBER OF DATA SETS DISPLAYED
                                       (INCLUDES DATA SETS NOT
                                       FOUND, ETC.)
                PREVIOUS             - ASSUMES THE RETURN CODE OF
                                       THE PREVIOUS SUBCOMMAND.
                DSORG                - SETS THE RETURN CODE BASED
                                       ON THE DATA SET ORGANIZATION
                                       OF THE DATA SETS DISPLAYED.
                                       1 - ALL DATA SETS WERE SEQ.
                                       2 - ALL DATA SETS WERE PDS
                                       3 - DATA SETS WERE MIXED PDS
                                           AND SEQUENTIAL
                                       4 - AN ERROR OCCURRED OR A
                                           DATA SET OTHER THAN PDS
                                           OR SEQUENTIAL WAS
                                           PROCESSED
                DIRALLOC - SETS THE RETURN CODE TO THE
                           NUMBER OF DIRECTORY BLOCKS
                           ALLOCATED.
                DIRUSED  - SETS THE RETURN CODE TO THE
                           NUMBER OF DIRECTORY BLOCKS
                           USED.
                ENTRIES  - SETS THE RETURN CODE TO THE
                           NUMBER OF ENTRIES IN THE
                           DIRECTORY (MEMBERS AND
                           ALIASES).
                ALIASES  - SETS THE RETURN CODE TO THE
                           NUMBER OF ALIASES.
                MEMBERS  - SETS THE RETURN CODE TO
                           ENTRIES-ALIASES.
=LISTM=LM
)F FUNCTION -

   THE LISTM COMMAND DISPLAYS PDS DIRECTORY INFORMATION

)X SYNTAX -
   LISTM 'DSNAME' LIST('START' 'END')/NOLIST TTR COUNT
                  VOLUME('VOLSER')  USER('NBYTES')
   REQUIRED - 'DSNAME'
   DEFAULTS - LIST
   ALIAS    - LM

)O OPERANDS -

))DSNAME   SPECIFIES THE DATA SET NAME WHOSE DIRECTORY IS TO BE
           DISPLAYED.  IF A "MEMBER NAME" IS SPECIFIED WITH THE
           DATA SET NAME, IT WILL BE USED AS A STARTING AND ENDING
           SEARCH KEY AS IF IT HAD BEEN ENTERED AS 'START' AND 'END'
           ON THE LIST OPERAND.  IF LIST PARAMETERS ARE ALSO SUPPLIED,
           THEY WILL OVERRIDE THE "MEMBER NAME".

))LIST('START' 'END') SPECIFIES THAT THE DIRECTORY IS TO BE LISTED
                      BETWEEN THE MEMBERS SPECIFIED BY THE
                      'START' AND 'END' PARAMETERS INCLUSIVE.

                      NOTE- IF THE 'START' AND 'END' PARAMETERS
                      ARE NOT SPECIFIED THE ENTIRE DIRECTORY
                      ENTIRE DIRECTORY IS LISTED.
                      IF ONLY 'START' IS SPECIFIED, ALL
                      MEMBERS FROM THAT ONE TO THE END ARE LISTED.

))NOLIST        SPECIFIES THAT THE DIRECTORY IS NOT TO BE LISTED

))TTR           SPECIFIES THAT TTR INFORMATION FOR THE
                MEMBERS IS TO BE DISPLAYED

))COUNT         SPECIFIES THAT MEMBERS AND DIRECTORY
                BLOCKS ARE TO BE COUNTED.

))USER('NBYTES')       SPECIFIES THAT USER DATA INFORMATION IN THE
                       DIRECTORY ENTRIES IS TO BE DISPLAYED.
                       ENTRIES IS TO BE DISPLAYED.

                       'NBYTES' SPECIFIES THE NUMBER OF USER
                       DATA BYTES TO BE DISPLAYED. IF 'NBYTES'
                       IS NOT SPECIFIED, THE ENTIRE USER DATA
                       FIELD IS DISPLAYED.

))VOLUME('VOLSER')     SPECIFIES THE VOLUME SERIAL NUMBER ON
                       WHICH THE DATA SET RESIDES. THIS PARAMETER
                       IS ONLY NEEDED FOR DATA SETS THAT ARE NOT
                       CATALOGED.
=QLIST=QL
)F FUNCTION -
  THE QLIST SUBCOMMAND DISPLAYS A SEQUENTIAL DATA SET
  OR A MEMBER OF A PARTITIONED DATA SET ON THE TERMINAL.

  IT IS SIMILAR TO THE LIST COMMAND, WEAKER IN SOME AREAS,
  STRONGER IN OTHERS.  WHEN THE SYSTEM IS UNDER A HEAVY LOAD
  THIS SUBCOMMAND WILL RESPOND MUCH FASTER (IN THE TIME BETWEEN
  THE START OF THE SUBCOMMAND AND THE FIRST OUTPUT LINE APPEARING)
  THAN THE LIST COMMAND, ESPECIALLY WHEN LISTING A MEMBER.

  FEATURES IN QLIST THAT ARE NOT IN LIST -
     .  FILE KEYWORD FOR LISTING BY DDNAME
     .  HEX KEYWORD
     .  FOR PARTIAL LISTINGS, INSTEAD OF SPECIFYING A SEQUENCE
        NUMBER RANGE YOU SPECIFY THE MAXIMUM NUMBER OF RECORDS
        TO PRINT AND/OR THE NUMBER OF RECORDS TO BYPASS.
     .  IF NUM/SNUM/NONUM NOT SPECIFIED, WILL CHECK FOR SEQUENCE
        NUMBERS AND DEFAULT TO NUM OR NONUM ACCORDINGLY.
     .  ASA CARRIAGE CONTROL CHARACTERS WILL APPEAR IF PRESENT.
     .  OBJ KEYWORD WILL SUBSTITUTE DOTS FOR NON-PRINTABLE CHARACTERS
  FEATURES IN LIST THAT ARE NOT IN QLIST -
     .  PARTIAL LIST BY SEQUENCE NUMBER RANGE.
     .  MULTIPLE COLUMN RANGES.
     .  SPECIFIABLE SEQUENCE FIELD LOCATION AND LENGTH.
     .  MULTIPLE DATA SETS.
     .  LIST RECFM=U DATA SETS.
     .  HEADING LINE SHOWING DATA SET NAME.
)X SYNTAX  -
         QLIST    'DSNAME'  BYPASS('INTEGER')   MAX('INTEGER')
             NUM/SNUM/NONUM   COL('BEGIN COLUMN':'END COLUMN')
             FILE   HEX/X   QUICK/Q   OBJ
  REQUIRED - DSNAME
  DEFAULTS - NUM (UNLESS A NON-NUMERIC IS ENCOUNTERED, THEN NONUM)
)O OPERANDS -
  'DSNAME' - THE SEQUENTIAL DATA SET OR MEMBER OF A PARTITIONED
             DATA SET TO BE LISTED, OR, IF THE 'FILE' KEYWORD
             IS ALSO SPECIFIED, THE FILENAME (DDNAME) CURRENTLY
             ALLOCATED TO THE DATASET OR MEMBER TO BE LISTED.
))BYPASS('INTEGER')
           - THE NUMBER OF RECORDS TO SKIP BEFORE PRINTING.
))MAX('INTEGER')
           - THE MAXIMUM NUMBER OF RECORDS TO BE PRINTED.     .
))NUM      - NUM INDICATES THAT THE RECORDS CONTAIN A SEQUENCE
             FIELD, WHICH WILL APPEAR ON THE LEFT. FOR FIXED LENGTH
             RECORDS, THE FIELD IS IN THE LAST EIGHT COLUMNS. FOR
             VARIABLE LENGTH RECORDS, THE FIELD IS IN THE FIRST
             EIGHT COLUMNS.
))SNUM     - SNUM INDICATES THAT THE SEQUENCE FIELD IS NOT TO
             BE PRINTED.
))NONUM    - NONUM INDICATES THAT THE ENTIRE RECORD IS TO BE
             TREATED AS DATA, WITH NO SEQUENCE FIELDS.
))COL('BEGIN COLUMN':'END COLUMN')
           - A PAIR OF INTEGERS SEPARATED BY A COLON, INDICATING
             THE FIRST AND LAST COLUMN TO BE PRINTED.
))HEX      - INDICATES THE DATA IS TO BE PRINTED IN HEXADECIMAL.
             BLANKS ARE PRINTED AS '<>' INSTEAD OF '40'.
             SEQUENCE NUMBERS REMAIN IN DECIMAL FORMAT.
             THIS KEYWORD MAY BE ABBREVIATED TO 'X'.
))OBJ      - INSTRUCTS QLIST TO TRANSLATE NON-PRINTABLE CHARACTERS
             TO DOTS. THIS ALLOWS OBJECT DECKS TO BE LISTED WITHOUT
             SENDING A LOT OF HEX DATA THROUGH THE TERMINAL NETWORK.
             OBJECT DECKS CAN SOMETIMES CAUSE TERMINALS TO BEHAVE
             IN A STRANGE MANNER DUE THE THE HEX VALUES IN TXT FIELDS.
))FILE     - INDICATES THE FIRST OPERAND IS A FILENAME (DDNAME)
             INSTEAD OF A DATA SET NAME.  THE FILENAME MUST
             BE CURRENTLY ALLOCATED TO A DATA SET ON DISK.
             THIS MAKES IT POSSIBLE TO LIST A TEMPORARY DATA SET.
))QUICK    - THIS KEYWORD SPEEDS UP THE SUBCOMMAND SOMEWHAT BY CAUSING
             THE SUBCOMMAND NOT TO SEARCH THE CATALOG TO DETERMINE
             THE TRAILING QUALIFIER OF AN UNQUALIFIED DATA SET NAME.
             FOR EXAMPLE, IF YOU HAVE A DATA SET NAMED X.DATA
             YOU CAN LIST IT BY TYPING "QL X" OR "QL X.DATA".
             IN EITHER CASE THE SUBCOMMAND WILL SEARCH THE CATALOG
             TO FIND ANY ADDITIONAL TRAILING QUALIFIER. BUT IF
             YOU TYPE "QL X.DATA QUICK" YOU ARE TELLING IT THAT
             YOU HAVE SPECIFIED THE TRAILING QUALIFIER AND IT CAN
             SAVE ITSELF THE TROUBLE OF LOOKING FOR ONE.  IF YOU
             TYPED "QL X Q" (QUICK CAN BE ABBREVIATED Q) YOU WOULD
             BE INFORMED THAT DATA SET X DOES NOT EXIST, EVEN
             THOUGH X.DATA DOES EXIST.  NOTE THAT THE SUBCOMMAND MAY
             STILL HAVE TO SEARCH THE CATALOG TO FIND THE VOLUME
             BUT THIS IS A SEPARATE SEARCH FROM THE QUALIFIER SEARCH.
=DSAT
)F FUNCTION -
              THE DSAT SUBCOMMAND PRODUCES A ONE LINE SUMMARY OF
              INFORMATION ABOUT A SELECTED DATASET. DATA INCLUDES
              ALLOCATED SIZE, AMOUNT USED, AND DCB INFORMATION.
)X SYNTAX -
              DSAT 'DSNAME'
)O OPERANDS -
))'DSNAME'  - THE NAME OF THE DATASET TO BE LISTED.
              IF THE DATA SET NAME IS NOT ENCLOSED IN QUOTES,
              IT WILL BE PREFIXED BY THE VALUE IN YOUR
              USER PROFILE TABLE.
=CPY=CO
)F FUNCTION -
  THE CPY SUBCOMMAND IS USED TO COPY A LINE OR A RANGE OF LINES IN
  THE EDIT DATA SET.
)X SYNTAX -
        CPY 'LINE1' 'LINE2' 'LINE3' 'INCR' 'NUM(N)' I/R
  REQUIRED - 'LINE1' 'LINE2'
  DEFAULTS - 'INCR' AND 'NUM(N)' DEFAULT TO 1 AND I/R TO I
  ALIAS    - NONE
)O OPERANDS  -
  'LINE1' -  THE NUMBER OF THE LINE TO BE COPIED OR THE FIRST
             NUMBER OF A RANGE OF LINES TO BE COPIED.
  'LINE2' -  THE NUMBER OF THE LINE THAT 'LINE1' WILL BE COPIED TO
             OR THE LAST NUMBER OF A RANGE OF LINES TO BE COPIED
             IF 'LINE3' IS ENTERED.
  'LINE3' -  THE STARTING LINE NUMBER WHERE THE RANGE OF LINES IS
             TO BE COPIED.
  'INCR'  -  THE LINE NUMBER INCREMENT TO BE USED STARTING AT 'LINE3'.
  NOTE    -  IF 'LINE3' IS ENTERED, 'LINE1' MUST BE LESS THAN 'LINE2'
             AND 'LINE3' MUST BE EITHER LESS THAN 'LINE1' OR GREATER
             THAN 'LINE2'.
))NUM     -  THE NUMBER OF COPIES OF THE RANGE TO CREATE.
))I       -  LINES ARE TO BE INSERTED INTO THE DATA SET WITHOUT
             REPLACING EXISTING LINES.
))R       -  SPECIFIES THAT EXISTING LINES IN THE OUTPUT RANGE CAN
             BE REPLACED.
=DUP
)F FUNCTION -
  THE DUP SUBCOMMAND IS USED TO DUPLICATE A LINE IN THE EDIT DATA SET.
)X SYNTAX -
         DUP 'LINE1' 'LINE2' 'COUNT' 'INCR'  I/R
  REQUIRED - 'LINE1' 'LINE2'
  DEFAULTS - 'COUNT' AND 'INCR' DEFAULT TO 1, I/R TO I
)O OPERANDS  -
  'LINE1' -  THE NUMBER OF THE LINE TO BE DUPLICATED.
  'LINE2' -  THE NUMBER OF THE LINE WHERE 'LINE1' WILL BE DUPLICATED.
  'COUNT' -  THE NUMBER OF TIMES 'LINE1' WILL BE DUPLICATED.
  'INCR'  -  THE LINE NUMBER INCREMENT TO BE USED STARTING AT 'LINE2'.
))I       -  LINES ARE TO BE INSERTED INTO THE DATA SET WITHOUT
             REPLACING EXISTING LINES.
))R       -  SPECIFIES THAT EXISTING LINES IN THE OUTPUT RANGE CAN
             BE REPLACED.
=MVE
)F FUNCTION -
  THE MOVE SUBCOMMAND IS USED TO MOVE A LINE OR A RANGE OF LINES IN
  THE EDIT DATA SET.
)X SYNTAX -
        MVE 'LINE1' 'LINE2' 'LINE3' 'INCR'  I/R
  REQUIRED - 'LINE1' 'LINE2'
  DEFAULTS - 'INCR' DEFAULTS TO 1, I/R TO I
  ALIAS    - NONE
)O OPERANDS  -
  'LINE1' -  THE NUMBER OF THE LINE TO BE MOVED OR THE FIRST
             NUMBER OF A RANGE OF LINES TO BE MOVED.
  'LINE2' -  THE NUMBER OF THE LINE THAT 'LINE1' WILL BE MOVED TO
             OR THE LAST NUMBER OF A RANGE OF LINES TO BE MOVED
             IF 'LINE3' IS ENTERED.
  'LINE3' -  THE STARTING LINE NUMBER WHERE THE RANGE OF LINES IS
             TO BE MOVED.
  'INCR'  -  THE LINE NUMBER INCREMENT TO BE USED STARTING AT 'LINE3'.
  NOTE    -  IF 'LINE3' IS ENTERED, 'LINE1' MUST BE LESS THAN 'LINE2'
             AND 'LINE3' MUST BE EITHER LESS THAN 'LINE1' OR GREATER
             THAN 'LINE2'.
))I       -  LINES ARE TO BE INSERTED INTO THE DATA SET WITHOUT
             REPLACING EXISTING LINES.
))R       -  SPECIFIES THAT EXISTING LINES IN THE OUTPUT RANGE CAN
             BE REPLACED.
=SHIFTL=SL
)F FUNCTION -
  THE SHIFTL SUBCOMMAND IS USED TO SHIFT LEFT A COLUMN, RANGE OF
  COLUMNS OR THE ENTIRE LINE IN THE EDIT DATA SET.
)X SYNTAX -
      SHIFTL 'LINE1' 'LINE2' 'COL(N M)' 'NUM(N)'  R
  REQUIRED - 'LINE1'
  DEFAULTS - 'COL(N M)' DEFAULTS TO THE FIRST AND LAST DATA COLUMN.
             'NUM(N)' DEFAULTS TO 1
  ALIAS    - SL
)O OPERANDS  -
  'LINE1' -  THE NUMBER OF THE LINE TO BE SHIFTED OR THE FIRST
             NUMBER OF A RANGE OF LINES TO BE SHIFTED.
  'LINE2' -  THE LAST NUMBER OF A RANGE OF LINES TO BE SHIFTED.
))COL     -  THE COLUMN OR RANGE OF COLUMNS TO BE SHIFTED.
))NUM     -  THE NUMBER OF CHARACTER POSITIONS TO SHIFT THE COLUMN OR
             RANGE OF COLUMNS.
))R       -  DATA IN THE OUTPUT RANGE WILL BE REPLACED DURING THE
             SHIFTING PROCESS. IF R IS NOT ENTERED, NON BLANK DATA IN
             THE OUTPUT RANGE WILL TERMINATE THE SHIFTING PROCESS.
=SHIFTR=SR
)F FUNCTION -
  THE SHIFTR SUBCOMMAND IS USED TO SHIFT RIGHT A COLUMN, RANGE OF
  COLUMNS OR THE ENTIRE LINE IN THE EDIT DATA SET.
)X SYNTAX -
      SHIFTR 'LINE1' 'LINE2' 'COL(N M)' 'NUM(N)'  R
  REQUIRED - 'LINE1'
  DEFAULTS - 'COL(N M)' DEFAULTS TO THE FIRST AND LAST DATA COLUMN.
             'NUM(N)' DEFAULTS TO 1
  ALIAS    - SR
)O OPERANDS  -
  'LINE1' -  THE NUMBER OF THE LINE TO BE SHIFTED OR THE FIRST
             NUMBER OF A RANGE OF LINES TO BE SHIFTED.
  'LINE2' -  THE LAST NUMBER OF A RANGE OF LINES TO BE SHIFTED.
))COL     -  THE COLUMN OR RANGE OF COLUMNS TO BE SHIFTED.
))NUM     -  THE NUMBER OF CHARACTER POSITIONS TO SHIFT THE COLUMN OR
             RANGE OF COLUMNS.
))R       -  DATA IN THE OUTPUT RANGE WILL BE REPLACED DURING THE
             SHIFTING PROCESS. IF R IS NOT ENTERED, NON BLANK DATA IN
             THE OUTPUT RANGE WILL TERMINATE THE SHIFTING PROCESS.
=LINENO=LNO
)F FUNCTION -
  THE LINENO SUBCOMMAND IS USED TO LIST THE INTERNAL LINE NUMBER
  OF THE LINE POINTED TO BY THE CURRENT LINE POINTER.
)X SYNTAX -
          LINENO
  ALIAS - LNO
)O OPERANDS  -
  NONE
=BLANK=BL
)F FUNCTION -
  THE BLANK SUBCOMMAND IS USED TO INSERT OR ADD BLANK RECORDS IN
  THE EDIT DATA SET. USERS OF SUBCOMMAND FSE SHOULD ENTER THE
  BLANK SUBCOMMAND FOR INPUT OR LINE INSERTION.
)X SYNTAX -
       BLANK 'LINE1' 'COUNT' 'INCR' 'NUM(N)' I/R
  REQUIRED - 'LINE1'
  DEFAULTS - 'COUNT' AND 'INCR' DEFAULT TO 1, NUM(N) TO 2 AND I/R TO I
  ALIAS    - BL
)O OPERANDS  -
  'LINE1' - THE LINE NUMBER OF THE FIRST BLANK LINE. IF * IS ENTERED,
            THE FIRST BLANK LINE WILL BE INSERTED AT THE CURRENT LINE
            POINTER + THE LINE NUMBER INCREMENT.
  'COUNT' - THE NUMBER OF BLANK LINES TO BE INSERTED.
  'INCR'  - THE LINE NUMBER INCREMENT TO BE USED STARTING AT 'LINE1'.
))NUM(N)  - THE NUMBER OF BLANK CHARACTERS PER RECORD FOR VARIABLE
            LENGTH RECORDS. N DEFAULTS TO 2. IF N IS LARGER THAN THE
            MAXIMUM ALLOWED, N WILL BE SET TO THE MAXIMUM VALUE.
            NUM IS ONLY VALID FOR VARIABLE LENGTH DATA SETS.
))I       - LINES ARE TO BE INSERTED INTO THE DATA SET WITHOUT
            REPLACING EXISTING LINES.
))R       - SPECIFIES THAT EXISTING LINES IN THE OUTPUT RANGE CAN
            BE REPLACED.
=FSE
)F FUNCTION -
 THE FSE SUBCOMMAND ENABLES A TSO USER TO EDIT OR SCAN UP TO 20 LINES
 OF THE EDIT DATA SET USING THE HARDWARE FEATURES OF A 3270. THE FSE
 DISPLAY CONSISTS OF 5 PARTS:

 1. THE TOP LINE OF THE 3270 IS RESERVED FOR MESSAGES THAT MAY BE SENT
    BY OTHER TSO USERS OR THE COMPUTER OPERATOR. THE FSE USER MAY
    REMOVE ANY MESSAGES SENT BY MOVING THE CURSOR TO THE TOP LINE AND
    USING THE SPACE BAR. MESSAGES MAY ALSO BE REMOVED BY DEPRESSING
    THE CLEAR KEY FOLLOWED BY A REDISPLAY REQUEST. SEE REDISPLAY FOR
    ADDITIONAL INFORMATION.

 2. THE SECOND SCREEN LINE IS THE TAB LINE AND INFORMS THE USER IF ANY
    LOGICAL TABS ARE SET AND WHAT CHARACTER IS BEING USED AS THE
    LOGICAL TAB CHARACTER.

 3. THE THIRD SCREEN LINE CONTAINS A COLUMN TEMPLATE FOR THE DATA
    COLUMNS BEING DISPLAYED.

 4. THE FOURTH SCREEN LINE IS RESERVED FOR ENTRY OF EDIT OR FSE
    SUBCOMMANDS.

 5. STARTING AT LINE 5 AND CONTINUING TO THE END OF THE SCREEN IS THE
    DATA AREA. LINES ARE DISPLAYED ACCORDING TO THE MODE AND FORMAT
    CHOSEN.

 EDIT MODE - IN THIS MODE UP TO 20 LINES OF THE DATA SET ARE DISPLAYED
    WITH THE LINE NUMBERS PLACED BEFORE THE DATA. THE DATA MAY BE
    DISPLAYED STARTING AT ANY COLUMN IN CHARACTER OR HEXADECIMAL
    FORMAT. FOR NONUM DATA SETS THE INTERNAL LINE NUMBERS ARE PLACED
    BEFORE THE DATA.

 SCAN MODE - IN THIS MODE UP TO 20 LINES ARE DISPLAYED IN CARD IMAGE
    FORMAT STARTING AT ANY COLUMN IN CHARACTER OR HEXADECIMAL FORMAT.
    IN CHARACTER FORMAT ALL UNPRINTABLES ARE CONVERTED TO BLANKS. THE
    SUBCOMMAND LINE IS THE ONLY UNPROTECTED FIELD IN THIS MODE.

 EMALL MODE - IN THIS MODE UP TO 20 LINES ARE DISPLAYED AS ONE DISPLAY
    FIELD IN CARD IMAGE FORMAT. ONLY CHARACTER FORMAT IS AVAILABLE IN
    EMALL MODE. EMALL DISPLAYS THE ENTIRE LINE AND FOR LINES GREATER
    THAN 80 CHARACTERS, SCREEN WRAPAROUND WILL OCCUR. EMALL IS ONLY
    AVAILABLE FOR FIXED-LENGTH RECORD DATA SETS.

 EDIT MODE EDITING FEATURES

 NO EDITING - IF NO CHANGES ARE MADE TO THE DISPLAY, THE DISPLAYED
    DEFAULT PAGING SUBCOMMAND IS EXECUTED.

 LINE NUMBER EDITING - A D, DD, P, B, OR I MAY BE PLACED IN THE LINE
    NUMBER OF THE EDIT MODE DISPLAY.

    D      -  DELETE THE LINE.
    DD     -  DELETE A RANGE OF LINES BY PLACING A 'DD' IN THE FIRST
              AND LAST LINE NUMBER OF THE RANGE.
    P      -  BEGIN THE NEXT FSE DISPLAY AT THIS LINE.
    B OR I -  B OR I FOLLOWED BY A NUMBER, PLACES THAT NUMBER OF BLANK
              LINES AFTER THE LINE CONTAINING THE 'B' OR 'I'. FSE
              CALCULATES THE LINE NUMBER INCREMENT.

 DATA AREA EDITING - ALL DISPLAYED LINES IN THE DATA AREA OF THE EDIT
    MODE DISPLAY MAY BE EDITED BY:

    1 - OVERTYPING DISPLAYED CHARACTERS
    2 - USING THE (DEL) AND/OR (INS MODE) KEY
    3 - USING THE SPACE BAR AND/OR ERASE EOF KEY

 EMALL EDITING FEATURES

 ALL DATA CHARACTERS OF FIXED-LENGTH RECORDS MAY BE EDITED BY OVER-
 TYPING, USING THE SPACE BAR AND THE CHARACTER INSERT OR DELETE KEYS.
 SINCE THE EMALL DISPLAY IS ONE FIELD, BEFORE CHARACTERS MAY BE
 INSERTED, A CORRESPONDING NUMBER OF CHARACTERS MUST FIRST BE DELETED.
 AFTER DELETING CHARACTERS, A CORRESPONDING NUMBER OF CHARACTERS MUST
 BE INSERTED. SHOULD THE LENGTH OF THE DISPLAY DIFFER FROM THE LENGTH
 OF THE INPUT, A MESSAGE IS ISSUED AND THE UNCHANGED PAGE IS DISPLAYED.

 FSE SUBCOMMANDS

    CHAR 'N'    -  DISPLAY THE DATA IN CHARACTER FORMAT. ANY UNPRINT-
                   ABLES WILL BE DISPLAYED AS A 'N'.
    COL 'M' 'N' -  DISPLAY DATA FROM COLUMN 'M' TO 'N'. IF 'N' IS NOT
                   INPUT, THE MAXIMUM AMOUNT IS DISPLAYED. IF 'M' IS
                   NOT INPUT, DATA IS DISPLAYED FROM THE FIRST DATA
                   COLUMN.
    DCB         -  DISPLAY THE DCB ATTRIBUTES OF THE EDIT DATA SET.
    DSN         -  DISPLAY THE NAME OF THE EDIT DATA SET.
    EM 'N'      -  INITIATE EDIT MODE. 'N' WILL BE THE CHARACTER USED
                   PLACE TRAILING BLANKS ON VARIABLE-LENGTH RECORDS.
    EMALL       -  INITIATE THE EMALL MODE DISPLAY.
    FILL 'N'    -  DISPLAY TRAILING BLANKS TO COLUMN 'N' IN EDIT MODE.
                   IF 'N' IS NOT ENTERED, ALL TRAILING BLANKS ARE
                   DISPLAYED.
    HEX         -  DISPLAY THE DATA IN HEXADECIMAL FORMAT. HEX IS ONLY
                   AVAILABLE FOR EDIT AND SCAN MODES.
    HF 'N'      -  HALF-PAGE FORWARD 'N' HALF-PAGES. 'N' DEFAULTS TO 1.
    HB 'N'      -  HALF-PAGE BACKWARD 'N' HALF-PAGES. 'N' DEFAULTS TO 1
    MD 'N'      -  MOVE THE FSE DISPLAY TO LINE NUMBER 'N'.
    NOFILL      -  NO TRAILING BLANKS ARE DISPLAYED IN EDIT MODE.
    PF 'N'      -  PAGE FORWARD 'N' PAGES WITH ONE LINE OVERLAP.
                   'N' DEFAULTS TO 1.
    PB 'N'      -  PAGE BACKWARD 'N' PAGES WITH ONE LINE OVERLAP.
                   'N' DEFAULTS TO 1.
    SEPC 'N'    -  SET THE COMMAND SEPARATOR CHARACTER TO 'N'.
    SM          -  INITIATE SCAN MODE.
    T           -  TERMINATE FSE AND RETURN CONTROL TO EDIT.
    TABC 'N'    -  SET THE LOGICAL TAB CHARACTER TO 'N'.

 EDITING AND SUBCOMMAND ENTRY - WHEN EDITING, LINE DELETION AND/OR LINE
    INSERTION OCCUR AND A SUBCOMMAND IS ENTERED, THE CHANGES ARE MADE
    TO THE DISPLAYED PAGE BEFORE THE SUBCOMMAND(S) ARE PROCESSED.

 FIELD MARKS -  ENTRY OF A FIELD MARK WILL RESULT IN AN FSE REDISPLAY
    OF THE UNCHANGED DATA. FOR MULTIPLE SUBCOMMAND ENTRY, USE THE
    COMMAND SEPARATOR CHARACTER.

 FILL AND NOFILL - WHEN INSERTING CHARACTERS IN EDIT MODE, THE NUMBER
    OF TRAILING BLANKS DETERMINES THE NUMBER OF CHARACTERS THAT MAY
    BE INSERTED BEFORE INPUT BECOMES INHIBITED. WHEN INPUT DOES BECOME
    INHIBITED, THE USER MUST DELETE CHARACTERS BEFORE MORE CHARACTERS
    MAY BE INSERTED. THESE ARE HARDWARE FEATURES OF THE TERMINAL.

    THE FILL AND NOFILL SUBCOMMANDS PROVIDE THE FSE USER WITH CONTROL
    OF THESE HARDWARE FEATURES. THE FILL SUBCOMMAND CONTROLS THE
    OUTPUT OF TRAILING BLANKS AND THUS CONTROLS THE NUMBER OF
    CHARACTERS THAT CAN BE INSERTED WITH THE INSERT KEY. FILL WITH
    NO OPERAND CAUSES ALL TRAILING BLANKS TO BE DISPLAYED AND
    MINIMIZES THE USE OF THE INSERT KEY. HOWEVER, THE USE OF THE
    ARROW KEYS FOR CURSOR POSITIONING WHEN ADDING DATA TO A LINE IS
    MAXIMIZED. THE NOFILL SUBCOMMAND MAXIMIZES THE USE OF THE INSERT
    KEY BUT MINIMIZES THE USE OF THE ARROW KEYS FOR CURSOR POSITIONING
    WHEN ADDING DATA TO A LINE. WITH NOFILL THE FSE USER MUST POSITION
    THE CURSOR AFTER THE LAST NON BLANK CHARACTER AND USE THE SPACE
    BAR TO POSITION THE CURSOR TO THE DESIRED COLUMN TO AVOID LEFT-
    JUSTIFICATION OF THE ADDED DATA.

    RECOMMENDATION

    THE FSE USER IS ENCOURAGED TO TRY BOTH FILL 'N' AND NOFILL TO
    DETERMINE WHAT BEST SUITS HIS EDITING REQUIREMENTS. IN GENERAL
    FILL IS USED FOR DATA TYPE DATA SETS AND NOFILL IS USED FOR
    VARIABLE-LENGTH RECORD DATA SETS OR WHEN MANY CHARACTERS ARE TO
    BE INSERTED. FOR COBOL OR FORTRAN DATA SETS, FILL 50 WOULD
    SATISFY MOST EDITING REQUIREMENTS. FOR AN ASM DATA SET WHERE
    THE COMMENTS START IN COLUMN 31, FILL 30 COULD BE USED.

    FSE DEFAULTS TO FILL

 FUNCTION KEYS - PF1 WILL RESULT IN A REDISPLAY. PF2 TO PF12 ARE
    INTERPRETED AS THE ENTER KEY.

 INITIAL ENTRY - WHEN FSE IS FIRST INVOKED,  EDIT MODE, CHARACTER
    FORMAT, FULL PAGING STATUS AND THE FIRST DATA COLUMN ARE DISPLAYED.
    IF THE LINE POINTER IS AT THE TOP OR BOTTOM, THE DISPLAY STARTS
    FROM THE TOP. OTHERWISE, IT STARTS FROM THE CURRENT LINE POINTER.

 LOW INTENSITY DISPLAY - ERROR CONDITIONS IN DISPLAYED LINES OR INPUT
    ENTERED IS INDICATED BY LOW INTENSITY. ERROR CONDITIONS INCLUDE
    UNPRINTABLE CHARACTERS, LINE TRUNCATED AND INVALID HEXADECIMAL
    INPUT ENTERED.

 LOGICAL TABS - DATA MAY BE ENTERED IN EDIT OR EMALL MODES BY ENTERING
    THE LOGICAL TAB CHARACTER FOLLOWED BY DATA. THE DATA IS PLACED IN
    THE POSITION OF THE LOGICAL TAB SETTINGS. MULTIPLE LOGICAL TABS
    MAY BE ENTERED TO SKIP TAB SETTINGS. LOGICAL TABS ARE ONLY
    RECOGNIZED AS SUCH WHEN THE LINE IS BLANK.

 MULTIPLE SUBCOMMAND ENTRY - THE COMMAND SEPARATOR CHARACTER MAY BE
    USED TO ENTER MULTIPLE FSE SUBCOMMANDS. THE FSE USER NEED ONLY
    PLACE THE COMMAND SEPARATOR CHARACTER BETWEEN FSE SUBCOMMANDS.
    MULTIPLE EDIT SUBCOMMANDS MAY ALSO BE ENTERED BY SEPARATING THEM
    WITH THE SEPARATOR CHARACTER. HOWEVER, THE COMMAND SEPARATOR
    CHARACTER SHOULD NOT BE USED IN A 'FIND' OR 'CHANGE' STRING.
    COMBINING FSE AND EDIT SUBCOMMANDS IS NOT RECOMMENDED SINCE
    FSE WILL PROCESS ALL ITS SUBCOMMANDS BEFORE ANY EDIT SUBCOMMANDS.
    THIS MAY RESULT IN SUBCOMMANDS BEING PROCESSED IN A SEQUENCE
    OTHER THAN THAT INPUT.

 NEW DATA SETS -  WHEN CREATING NEW DATA SETS, IT IS RECOMMENDED THAT
    'INPUT MODE' BE TERMINATED IMMEDIATELY AND THE 'BLANK' SUBCOMMAND
    USED TO PLACE BLANK LINES IN THE DATA SET. FSE MAY THEN BE USED
    TO PERMIT ENTRY OF NEW DATA IN A FULL-SCREEN MODE.

 NONUM EDITING - FSE CONSIDERS 'NONUM' DATA SETS AS NUMBERED WITH THE
    LINE NUMBER NOT OCCUPYING A PORTION OF THE RECORD. FSE KEEPS TRACK
    OF THE LINE POINTER AND THE USER MAY EDIT HIS DATA AS IF IT WERE
    NUMBERED. THE DISPLAYED LINE NUMBERS FOR NONUM DATA SETS ARE THE
    INTERNAL LINE NUMBERS FOR EACH LINE WHICH MAY BE USED AS OPERANDS
    WITH ALL FSE SUBCOMMANDS AND MOST EDIT SUBCOMMANDS.

 PAGING - FULL PAGING STATUS IS THE DEFAULT AND IS INDICATED BY A PF
    OR PB ON THE SUBCOMMAND LINE. IF HF OR HB IS ENTERED, THE STATUS
    BECOMES HALF-PAGE AND THE DIRECTION IS DETERMINED BY THE SUBCOMMAND
    ENTERED. THE APPROPRIATE PAGING DIRECTION IS INVOKED WHEN THE TOP
    OR BOTTOM OF THE DATA SET IS DISPLAYED.

 EDIT SUBCOMMAND ENTRY - ANY EDIT SUBCOMMAND MAY BE ENTERED ON THE SUB-
    COMMAND LINE. FSE PRESENTS THE SUBCOMMAND TO EDIT FOR EXECUTION AND
    AUTOMATICALLY INVOKES ITSELF AFTER EXECUTION OF THE SUBCOMMAND
    UNLESS:

    1. THE SUBCOMMAND ENTERED WAS  END, HELP, INPUT, INSERT, RUN,
       SAVE OR SCAN.
    2. THE SUBCOMMAND COULD NOT COMPLETE SUCCESSFULLY SUCH AS 'FIND'
       NOT FINDING THE CHARACTER STRING.

    IF EITHER OF THE ABOVE OCCUR, THE USER MAY ENTER 'FSE' TO RETURN
    TO FULL-SCREEN EDITING.

    TYPICAL EDIT SUBCOMMANDS ENTERED UNDER FSE ARE 'FIND', 'CHANGE',
    'UP', 'DOWN', 'TOP' AND 'BOTTOM'.

 REDISPLAY -  AT ANY TIME BEFORE THE 'ENTER' KEY IS DEPRESSED, THE
    USER MAY REQUEST THAT THE ORIGINAL PAGE BE REDISPLAYED. THIS IS
    HELPFUL WHEN THE USER DECIDES THAT HE DOES NOT WANT TO MAKE THE
    CHANGES THAT HE HAS ENTERED. TO REDISPLAY THE ORIGINAL PAGE, THE
    'TEST REQUEST', 'PA2' OR 'PF1' KEY MAY BE DEPRESSED.

 RENUMBERING - TO MORE EFFICIENTLY PROVIDE SPACE FOR LINE INSERTION,
    THE FSE USER IS ENCOURAGED TO USE THE MOVE SUBCOMMAND RATHER THAN
    RENUM. FOR NONUM DATA SETS, THE INTERNAL LINE NUMBERS HAVE AN
    INCREMENT OF 100 AND ARE ESTABLISHED DURING EDIT INITIALIZATION.
    IF IT BECOMES NECESSARY TO RENUMBER THE INTERNAL LINE NUMBERS TO
    PROVIDE SPACE FOR LINE INSERTION, THE FSE USER SHOULD SAVE AND
    RE-EDIT THE DATA SET.

 RESTRICTIONS - THE USER TERMINAL MUST BE A 3275-2, 3277-2 OR
    EQUIVALENT TERMINAL.

 UNPRINTABLE CHARACTERS - IN EDIT MODE CHARACTER FORMAT, UNPRINTABLE
    CHARACTERS ARE CONVERTED TO AN INSTALLATION-DEFINED CHARACTER AND
    THE LINE(S) ARE DISPLAYED IN LOW INTENSITY. IN SCAN MODE CHARACTER
    FORMAT, THEY ARE CONVERTED TO BLANKS. TO EDIT LINES CONTAINING
    UNPRINTABLES, THE 'COL' SUBCOMMAND OF FSE MAY BE USED TO DISPLAY
    ONLY THOSE COLUMNS CONTAINING PRINTABLES OR THE 'HEX' SUBCOMMAND
    OF FSE MAY BE ENTERED TO EDIT ANY DATA ON THE LINE.

 VARIABLE-LENGTH RECORDS - FOR VARIABLE-LENGTH RECORDS TRAILING BLANKS
    ARE NORMALLY TRUNCATED. THE FSE USER MAY ADD TRAILING BLANKS BY
    PLACING AN INSTALLATION OR USER DEFINED CHARACTER IN THE POSITION
    OF THE LAST BLANK DESIRED. IF THE LAST CHARACTER OF A LINE IS THIS
    SPECIAL CHARACTER, IT IS CONVERTED TO A BLANK BEFORE THE LINE IS
    WRITTEN TO THE WORK FILE. WHEN LINES WITH TRAILING BLANKS ARE
    DISPLAYED, THE SPECIAL CHARACTER IS AUTOMATICALLY PLACED IN THE
    LAST DATA POSITION TO PREVENT TRUNCATION OF THE BLANKS IF THE LINE
    IS EDITED. IF A LINE IS EXTENDED BEYOND ITS MAXIMUM RECORD LENGTH
    (LRECL-4), THE LINE IS TRUNCATED AND A LINE TRUNCATED MESSAGE WILL
    APPEAR ON THE TAB LINE.
)X SYNTAX -
          FSE
)O OPERANDS  -
  NONE
=SFIND=SF=FS
)F FUNCTION -
  SFIND SEARCHES FOR A SPECIFIED CHARACTER STRING BEGINNING WITH THE
  CURRENT LINE, PROVIDED OPERANDS ARE SPECIFIED (SEE SYNTAX). THE
  CURRENT LINE POINTER * IS MOVED TO THE FIRST LINE FOUND TO CONTAIN
  THE STRING. THE SEARCH CAN BE MADE AT A SPECIFIC OFFSET WITHIN
  EACH LINE, BETWEEN SELECTED COLUMNS WITHIN EACH LINE, OR
  WITHIN ALL POSITIONS OF THE LINE.
)X SYNTAX -
        SFIND   '=CHAR-STRING='   'POSITION1'  'POSITION2'  ALL
  REQUIRED - NONE
  DEFAULTS - IF NO OPERANDS ARE SPECIFIED, THOSE SPECIFIED ON THE LAST
             PREVIOUS ISSUE OF THE FIND SUBCOMMAND ARE ASSUMED. THE
             SEARCH BEGINS AT THE LINE FOLLOWING THE CURRENT LINE.
  ALIAS    - SF,FS
)O OPERANDS -
  '=CHAR-STRING=' -
             = CAN BE CHOSEN TO BE ANY NON-NUMERIC CHARACTER, EXCEPT
             BLANK, COMMA, TAB, PARENTHESIS, ASTERISK, APOSTROPHE, OR
             SEMICOLON, WHICH DOES NOT APPEAR WITHIN THE SPECIFIED
             CHARACTER STRING. THE SECOND OCCURRENCE CAN BE REPLACED
             BY CARRIAGE RETURN IF 'POSITION' IS NOT SPECIFIED.
  'POSITION1' -
             SPECIFIES THE COLUMN WITHIN EACH LINE AT WHICH THE
             COMPARISON IS TO BE MADE. VALID ONLY IF CHARACTER
             STRING IS SPECIFIED ALSO. IF CHARACTER STRING IS
             SPECIFIED AND THIS OPERAND IS OMITTED, THE COMPARISON
             IS MADE AT EVERY COLUMN WITHIN EACH LINE.
  'POSITION2' -
             SPECIFIES THE COLUMN WITHIN EACH LINE AT WHICH THE
             SCAN IS TO BE STOPPED. WHEN BOTH POSITION1 AND POSITION2
             ARE SPECIFIED, THEY SERVE AS MARGINS WITHIN WHICH THE
             SCAN IS TO BE CONDUCTED. VALID ONLY IF POSITION1 IS
             SPECIFIED.
   ALL -
             SPECIFIES THAT THE SCAN IS TO CONTINUE UNTIL ALL
             REFERENCES TO THE STRING ARE FOUND.
=COUNT
)F FUNCTION -
  COUNT WILL DISPLAY THE NUMBER OF LINES BEING EDITED.
)X SYNTAX -
    COUNT
  REQUIRED - NONE
  DEFAULTS - NONE
  ALIAS    - NONE
)O OPERANDS - NONE
=CHANGEX=CX
)F FUNCTION -
  THE CHANGEX SUBCOMMAND IS USED TO MODIFY A CHARACTER-STRING IN A
  LINE OR RANGE OF LINES USING HEXADECIMAL STRINGS.  THE SYNTAX IS
  IDENTICAL TO THE 'CHANGE' SUBCOMMAND, EXCEPT THE TEXT STRINGS
  ARE HEXADECIMAL REPRESENTATIONS OF THE STRINGS TO BE CHANGED.
  HEX STRINGS MAY CONTAIN ONLY THE CHARACTERS 0 THRU 9 AND A THRU F.
  HEX STRINGS WITH AN ODD NUMBER OF DIGITS ARE PREFIXED WITH A 0.
)X SYNTAX -
         CHANGEX  'LINE-SPEC'  'STRING'  OR  =TEXT1=TEXT2= ALL
  REQUIRED - 'STRING' OR =TEXT1=TEXT2
  DEFAULTS - 'LINE-SPEC' DEFAULTS TO * .
  ALIAS    - CX
)O OPERANDS -
  'LINE-SPEC'
           - * FOR THE CURRENT LINE. * 'COUNT1' OR 'LINENUM1,LINENUM2'
             FOR A RANGE OF LINES. 'LINENUM' FOR A PARTICULAR LINE.
  'STRING'
           - A SEARCH FOR THE SPECIFIED CHARACTER STRING IS MADE IN THE
             LINE(S) SPECIFIED. THE FIRST LINE IN WHICH IT IS FOUND IS
             PRINTED UP TO THE STRING, AND THE USER COMPLETES THE LINE,
             BUT WITH ACTUAL CHARACTERS, NOT HEX STRINGS.
  '=TEXT1=TEXT2='ALL
           - = MAY BE ANY NON-NUMERIC CHARACTER EXCEPT BLANK, COMMA,
             TAB,PARENTHESIS,ASTERISK,APOSTROPHE,OR SEMICOLON. IT
             DELIMITS THE STRING AND CANNOT APPEAR WITHIN THE CHARACTER
             STRINGS TEXT1 AND TEXT2. THE LINE OR RANGE OF LINES IS
             SEARCHED FOR TEXT1, WHICH, IF FOUND, IS REPLACED BY TEXT2.
             THE KEYWORD 'ALL' IS OPTIONAL AND CAUSES EVERY OCCURRENCE
             OF TEXT1 TO BE REPLACED IN THE LINE(S). EXAMPLES -
             ==TEXT2=  TEXT2 WILL BE INSERTED IN FRONT OF THE LINE(S).
             =TEXT1==  TEXT1 WILL BE DELETED FROM THE LINE(S).
=LISTX=LX
)F FUNCTION -
  LISTX DISPLAYS AT THE TERMINAL LINES OF THE DATA SET BEING EDITED
  IN HEXADECIMAL FORMAT.
)X SYNTAX -
         LISTX  'LINE-SPEC'  NUM/SNUM
  REQUIRED - NONE
  DEFAULTS - NUM
  ALIAS    - LX
)O OPERANDS -
  'LINE-SPEC'
           - * OR 'LINENUM' TO INDICATE A SINGLE LINE TO BE LISTED.
             * 'COUNT' OR 'LINENUM1,LINENUM2' TO DISPLAY A RANGE OF
             LINES.  ONLY THE CURRENT LINE POSITION WILL BE DISPLAYED
             IF THIS OPERAND IS OMITTED.
))NUM      - THE LINE NUMBERS ARE TO BE DISPLAYED.
))SNUM     - THE LINE NUMBERS ARE NOT TO BE DISPLAYED.
=NAME=N
)F FUNCTION -
  THE NAME SUBCOMMAND DISPLAYS THE NAME OF THE DATASET
  CURRENTLY BEING EDITED, AND THE TYPE.
)X SYNTAX -
         NAME
  REQUIRED - NONE
  DEFAULTS - NONE
  ALIAS    - N
)O OPERANDS - NONE
=OFFLINE=OFF
)F FUNCTION -
  THE OFFLINE SUBCOMMAND PRINTS THE DATA BEING EDITED ON SYSOUT.
)X SYNTAX -
      OFFLINE   'LINE-SPEC'  NUM/SNUM  ASA  OFFLINE/TERM
                DEST  COPIES  NOTITLE  PUNCH  HOLD  CLASS(A)
  REQUIRED - NONE
  DEFAULTS - NUM
  ALIAS    - OFF
)O OPERANDS -
  'LINE-SPEC'
           - * OR 'LINENUM' TO INDICATE A SINGLE LINE TO BE LISTED.
             * 'COUNT' OR 'LINENUM1,LINENUM2' TO DISPLAY A RANGE OF
             LINES. THE ENTIRE DATA SET WILL BE DISPLAYED IF THIS
             OPERAND IS OMITTED.
))NUM      - THE LINE NUMBERS ARE TO BE DISPLAYED.
))SNUM     - THE LINE NUMBERS ARE NOT TO BE DISPLAYED.
))ASA      - THE FIRST COLUMN OF DATA IS FOR PRINTER CONTROL.
))OFFLINE  - THE OUTPUT IS TO BE DIRECTED TO SYSOUT.
))TERM     - THE OUTPUT IS TO BE DIRECTED TO THE TERMINAL.
))DEST('DESTINATION')
           - THE RJE STATION TO WHICH OFFLINE LISTS ARE TO BE ROUTED.
))COPIES('NN') - THE NUMBER OF COPIES OF OFFLINE OUTPUT.
))NOTITLE  - SUPPRESS LISTING THE DSNAME (OFFLINE ONLY)
))PUNCH    - THE OUTPUT IS TO BE DIRECTED TO A CARD PUNCH (OFFLINE
             ONLY).  SAME AS CLASS(B).
))CLASS('CLASS') - THE SYSOUT CLASS OF THE OFFLINE OUTPUT.
             SPECIFYING 'CLASS(B)' IS THE SAME AS SPECIFYING 'PUNCH'.
=PUT=P
)F FUNCTION -
  THE PUT SUBCOMMAND IS USED TO INSERT A STRING INTO ONE OR MORE
  EXISTING LINES AT A SPECIFIED COLUMN OR COLUMN RANGE.
)X SYNTAX -
         PUT LINERANGE STRING OPERATOR DESTINATION INCR/DECR('N')

  REQUIRED - STRING, DESTINATION
  DEFAULTS - LINERANGE DEFAULTS TO * .
           - OPERATOR DEFAULTS TO 'OVER' WHEN DEST IS ONE COLUMN,
             AND DEFAULTS TO 'ON' WHEN DEST IS A RANGE OF COLUMNS.
  ALIAS    - NONE
  EXAMPLES - PUT /X/ 72         WILL OVERLAY COLUMN 72 WITH AN 'X'.
             PUT /XY/ 30        WILL OVERLAY COLUMNS 30:31 WITH 'XY'.
             PUT /XY/ 30:71     WILL OVERLAY COLUMNS 30:31 WITH 'XY'
                                AND OVERLAY COLUMNS 32:71 WITH BLANKS.
             PUT /XY/ IN 30:71  WILL REPLACE COLUMNS 30:71 WITH 'XY',
                                SHIFTING COLUMN 72 OVER TO 32.
             PUT /XY/ AT 30     WILL SHIFT COLUMNS 30 AND BEYOND
                                TWO COLUMNS RIGHT AND INSERT 'XY'
                                IN COLUMNS 30:31.
)O OPERANDS -
  LINERANGE
           - * FOR THE CURRENT LINE. * 'COUNT1' OR 'LINENUM1,LINENUM2'
             FOR A RANGE OF LINES. 'LINENUM' FOR A PARTICULAR LINE.
  STRING
           - REPRESENTS THE REPLACEMENT STRING TO BE MOVED INTO THE
             LINE(S). IT IS SURROUNDED WITH DELIMITERS, LIKE
             A STRING IN THE 'FIND' SUBCOMMAND.
  OPERATOR
           - VALID OPERATORS ARE: AT, IN, ON, OVER.
             OPERATORS THAT BEGIN WITH THE LETTER 'O' NEVER CAUSE
             EXISTING DATA TO BE SHIFTED TO DIFFERENT COLUMNS, BUT
             SIMPLY OVERLAY EXISTING DATA.  OTHER OPERATORS CAN
             CAUSE EXISTING DATA TO BE SHIFTED TO NEW POSITIONS.
             AT - FOR INSERTING DATA BETWEEN ADJACENT COLUMNS.
                  THE DESTINATION MAY NOT BE A RANGE.
             IN - FOR REPLACING THE CONTENTS OF THE DESTINATION
                  AND, IF THE LENGTHS ARE UNEQUAL, SHIFTING
                  SUBSEQUENT COLUMNS OVER. IF THE STRING IS NULL
                  THE DESTINATION COLUMNS ARE DELETED.
             ON - FOR REPLACING THE CONTENTS OF THE DESTINATION
                  AND, IF THE LENGTHS ARE UNEQUAL, PADDING WITH BLANKS.
             OVER - FOR OVERLAYING AS MANY COLUMNS AS THE LENGTH OF
                  THE STRING REQUIRES, STARTING AT THE DESTINATION
                  COLUMN. DESTINATION MAY NOT BE A RANGE.
  DESTINATION
           - DESCRIBES THE DESTINATION OF THE DATA TO BE MOVED. IT HAS
             TWO FORMS, A COLUMN NUMBER OR A COLUMN RANGE: N, N:N .
))INCR('N') - WHEN THE STRING IS ALL-NUMERIC, THIS
              IS THE NUMBER TO BE ADDED TO THAT STRING.
=EXCLUDE=EXC
)F FUNCTION -
  EXCLUDE CAUSES ALL LINES CONTAINING A SPECIFIED STRING
  TO BE DELETED.
  A RANGE OF LINES MAY BE SPECIFIED, BUT IS OPTIONAL. ALSO, A
  COLUMN OR RANGE OF COLUMNS WHERE THE COMPARISON IS TO BE MADE
  MAY OPTIONALLY BE SPECIFIED.
  THE CURRENT LINE POINTER IS SET TO THE LAST LINE.
)X SYNTAX -
         EXCLUDE 'LINERANGE' 'STRING' 'POSITION'  PRESENT/ABSENT
                MASK  QUIETLY
  REQUIRED - 'STRING'
  DEFAULTS - PRESENT,   'LINERANGE' DEFAULTS TO ENTIRE DATASET.
  ALIAS    - NONE
)O OPERANDS -
  'LINERANGE' - * 'COUNT1'  OR   'LINENUM1,LINENUM2'
  'STRING'    - A DELIMITED STRING TO BE SEARCHED FOR.
  'POSITION'  - THE COLUMN WITHIN EACH LINE AT WHICH THE
                COMPARISON IS TO BE MADE.
                IF A RANGE (N:N) IS SPECIFIED, THE RANGE OF COLUMNS
                WITHIN WHICH THE COMPARISON IS TO BE MADE.
))PRESENT     - EXCLUDE LINES IN WHICH THE STRING IS PRESENT
))ABSENT      - EXCLUDE LINES IN WHICH THE STRING IS ABSENT
))MASK        - ASTERISKS IN THE STRING ARE ONLY PLACE-HOLDERS
))QUIETLY     - SUPPRESS THE NUMBER-OF-LINES-DELETED MESSAGE
=SELECT=SEL
)F FUNCTION -
  SELECT CAUSES ALL LINES CONTAINING A SPECIFIED STRING TO BE
  LEFT UNCHANGED WHILE ALL OTHERS ARE DELETED.
  A RANGE OF LINES MAY BE SPECIFIED, BUT IS OPTIONAL. ALSO, A
  COLUMN OR RANGE OF COLUMNS WHERE THE COMPARISON IS TO BE MADE
  MAY OPTIONALLY BE SPECIFIED.
  THE CURRENT LINE POINTER IS SET TO THE LAST LINE.
)X SYNTAX -
         SELECT 'LINERANGE' 'STRING' 'POSITION'  PRESENT/ABSENT
                MASK  QUIETLY
  REQUIRED - 'STRING'
  DEFAULTS - PRESENT,   'LINERANGE' DEFAULTS TO ENTIRE DATASET.
  ALIAS    - NONE
)O OPERANDS -
  'LINERANGE' - * 'COUNT1'  OR   'LINENUM1,LINENUM2'
  'STRING'    - A DELIMITED STRING TO BE SEARCHED FOR.
  'POSITION'  - THE COLUMN WITHIN EACH LINE AT WHICH THE
                COMPARISON IS TO BE MADE.
                IF A RANGE (N:N) IS SPECIFIED, THE RANGE OF COLUMNS
                WITHIN WHICH THE COMPARISON IS TO BE MADE.
))PRESENT     - SELECT LINES IN WHICH THE STRING IS PRESENT
))ABSENT      - SELECT LINES IN WHICH THE STRING IS ABSENT
))MASK        - ASTERISKS IN THE STRING ARE ONLY PLACE-HOLDERS
))QUIETLY     - SUPPRESS THE NUMBER-OF-LINES-DELETED MESSAGE
=SPOT=SP
)F FUNCTION -
  SPOT LISTS OR COUNTS ALL LINES CONTAINING A SPECIFIED CHARACTER
  STRING, OR LINES IN WHICH A SPECIFIED CHARACTER STRING IS ABSENT.
  A RANGE OF LINES MAY BE SPECIFIED, BUT IS OPTIONAL. ALSO, A
  COLUMN OR RANGE OF COLUMNS WHERE THE COMPARISON IS TO BE MADE
  MAY OPTIONALLY BE SPECIFIED.
  THE CURRENT LINE POINTER IS SET TO THE LAST LINE LISTED.
)X SYNTAX -
         SPOT 'LINERANGE' 'STRING' 'POSITION'  PRESENT/ABSENT
              MASK   COUNT
  REQUIRED - 'STRING'
  DEFAULTS - PRESENT,   'LINERANGE' DEFAULTS TO ENTIRE DATASET.
  ALIAS    - NONE
)O OPERANDS -
  'LINERANGE' - * 'COUNT1'  OR   'LINENUM1,LINENUM2'
  'STRING'    - A QUOTED STRING TO BE SEARCHED FOR.
  'POSITION'  - THE COLUMN WITHIN EACH LINE AT WHICH THE
                COMPARISON IS TO BE MADE.
                IF A RANGE (N:N) IS SPECIFIED, THE RANGE OF COLUMNS
                WITHIN WHICH THE COMPARISON IS TO BE MADE.
))PRESENT     - SHOW LINES IN WHICH THE STRING IS PRESENT
))ABSENT      - SHOW LINES IN WHICH THE STRING IS ABSENT
))MASK        - ASTERISKS IN THE STRING ARE ONLY PLACE-HOLDERS
))COUNT       - COUNT THE LINES, INSTEAD OF LISTING THEM
=LTABS=LT
)F FUNCTION -
  LISTTABS WILL DISPLAY THE CURRENT TAB SETTINGS IN YOU EDIT SESSION
)X SYNTAX -
         LISTTABS
  REQUIRED - NONE
  DEFAULTS - NONE
  ALIAS    - LTABS
)O OPERANDS -
             NONE
=SAVESHR=SS
)F FUNCTION -
  SAVESHR IS JUST LIKE SAVE EXCEPT IT ALLOCATES THE SAVE DATA SET
  SHARED INSTEAD OF OLD WHEN THE SAVE DATA SET IS A PDS.

  SAVESHR IS SERIALIZED WITH SAVESHR'S DONE BY OTHER USERS ON THE
  SAME DATA SET, AND WITH SPF FUNCTIONS DONE BY OTHER USERS ON THE
  SAME DATA SET, SO SIMULTANEOUS UPDATE OF THE PDS DOES NOT OCCUR.
  BUT SIMULTANEOUS UPDATE (UNPREDICTABLE RESULTS) COULD OCCUR IF
  ANOTHER USER OR JOB WRITES INTO THE PDS DISP=SHR USING SOMETHING
  OTHER THAN SPF OR THE SAVESHR SUBCOMMAND OF EDIT, AT THE SAME TIME.

  NOTE THAT IF ANOTHER USER IS DOING A REGULAR SAVE SUBCOMMAND AT THE
  SAME TIME YOU ENTER A SAVESHR SUBCOMMAND TO THE SAME PDS, ONE OF YOU
  WILL GET A MESSAGE TELLING YOU THE DATA SET CANNOT BE ALLOCATED,
  BECAUSE THE REGULAR SAVE SUBCOMMAND REQUESTS EXCLUSIVE CONTROL OF
  THE DATA SET.
)X SYNTAX -
         SAVESHR   'DSNAME'/*
                RENUM/REN('NEW-LINE' 'INCREM' 'OLD-LINE' 'END-LINE')
                    OR
                UNNUM/UNN
  REQUIRED - NONE
  DEFAULTS - 'DSNAME' DEFAULTS TO THE DATA SET NAME SPECIFIED WITH THE
             EDIT COMMAND.
           - BOTH 'NEW-LINE' AND 'INCREM' DEFAULT TO 10 .
             'OLD-LINE' DEFAULTS TO THE FIRST LINE IN THE DATA SET.
             'END-LINE' DEFAULTS TO THE LAST LINE IN THE DATA SET.
  ALIAS    - S
  NOTE     - 'NEW-LINE' IS REQUIRED IF 'INCREM' IS SPECIFIED.
             BOTH ARE REQUIRED IF 'OLD-LINE' IS SPECIFIED.
             SPECIFICATION OF 'END-LINE' REQUIRES ALL OTHER OPERANDS
             TO BE SPECIFIED.
  NOTE     - 'DSNAME'/* IS REQUIRED IF EITHER RENUM OR UNNUM IS
             SPECIFIED.
  NOTE     - SAVE MUST BE ISSUED IF THE USER WANTS TO RETAIN A NEW DATA
             SET CREATED BY THE EDIT COMMAND, OR TO INCORPORATE INTO AN
             OLD DATA SET CHANGES MADE UNDER EDIT.
)O OPERANDS -
  'DSNAME' - NAME TO BE ASSIGNED THE RETAINED COPY. IF 'DSNAME'
           + SPECIFIES AN EXISTING PARTITIONED DATA SET (PDS), WITHOUT
             SPECIFYING MEMBER NAME, MEMBER NAME 'TEMPNAME' IS USED.
             A NEW MEMBER IS CREATED IF NAMED MEMBER DOES NOT EXIST.
           + SPECIFIES AN EXISTING SEQUENTIAL DATA SET OR PDS MEMBER
             DIFFERENT FROM THAT SPECIFIED WITH THE EDIT COMMAND, THE
             USER WILL BE NOTIFIED. ANOTHER DATA SET NAME OR A CARRIAGE
             RETURN CAN BE ENTERED. A CARRIAGE RETURN WILL CAUSE THE
             SPECIFIED DATA SET OR PDS MEMBER TO BE REPLACED.
           + SPECIFIES A DATA SET WHICH DOES NOT ALREADY EXIST, A NEW
             SEQUENTIAL DATA SET, OR PDS IF A MEMBER NAME IS STATED,
             WILL BE ALLOCATED.
  'RENUM'  - SPECIFIES THE RENUMBERING OF ALL OR PART OF THE EDIT
             DATA SET OR THE ASSIGNING OF A NUMBER TO EACH LINE OF
             AN UNNUMBERED DATA SET
  'UNNUM'  - SPECIFIES THE REMOVAL OF LINE NUMBERS FROM LINES OF THE
             EDIT DATA SET
  'NEW-LINE'
           - THE NUMBER TO BE ASSIGNED TO THE FIRST LINE PROCESSED.
  'INCREM' - SPECIFIES THE INCREMENT TO BE USED IN RENUMBERING.
  'OLD-LINE'
           - SPECIFIES A LINE NUMBER IN THE DATA SET. NEW LINE NUMBERS
             ARE TO BE ASSIGNED BEGINNING WITH THIS LINE. THIS OPERAND
             IS VALID ONLY WITH LINE NUMBERED DATA SETS. IF THIS
             OPERAND IS OMITTED, THE ENTIRE DATA SET IS RENUMBERED.
  'END-LINE'
           - SPECIFIES A LINE NUMBER IN THE DATA SET. THIS OPERAND IS
             VALID ONLY WITH LINE-NUMBERED DATA SETS. NEW LINE NUMBERS
             ARE TO BE ASSIGNED BEGINNING AT 'OLD-LINE' AND
             ENDING AT 'END-LINE'. IF THIS OPERAND IS OMITTED,
             RENUMBERING APPLIES FROM 'OLD-LINE' THROUGH THE END
             OF THE DATA SET.
./     ENDUP
$$
./       ADD   NAME=LA00156B
//SSUD156B JOB (M,AJNJ,S610C021),04542HMD,CLASS=K,NOTIFY=SSUD,
//   MSGCLASS=O ,TYPRUN=HOLD
//*ACCT        HOWARD DEAN,SSU
/*ROUTE  PRINT U90
/*JOBPARM L=999,S=*
//***
//****************************************************************
//***   WARNING!! DO NOT RENUMBER THIS LOCAL MOD                **
//***   IT CONTAINS A MACRO UPDATE WHICH IS SEQUENCE DEPENDENT  **
//***   AND COULD BE RENDERED USELESS IF RENUMBERED. USE EDIT   **
//***   WITH THE 'NONUM' OPERAND, AND LEAVE 'AUTONUM' AND       **
//***   'NUM' OFF IF USING SPF.                                 **
//****************************************************************
//***
//***    SYS PROG: HOWARD M. DEAN
//***    DATE:     04/15/83
//***    LOCATION: SYST.LOCLMODS.CNTL(LA00156B)
//***    DESC:     APPLY NEW 'TEST' SUBCOMMANDS:
//***
//***              IKJEGSCU - USER SUBCOMMAND TABLE
//***              IKJEGLBP - LIST BREAKPOINT SUBCOMMAND
//***              IKJEGFND - FIND SUBCOMMAND
//***
//***              UPDATE TEST HELP TEXT
//***              IKJEGMNL - ZAP TO FLAG CHANGE FOR SMP
//***
//SMP      EXEC PUTSMP,OPT=200,REGION=3700K
//SMPCNTL  DD *
   RECEIVE S(LA00156).
   APPLY   S(LA00156) DIS(WRITE).
//SMPPTFIN DD DATA,DLM=$$
++ USERMOD (LA00156)    /* TEST SUBCOMMAND USER MODIFICATION
     *****************************************************************
     *                                                               *
     *       GTEDS: MARINA DEL REY, CALIFORNIA                       *
     *                                                               *
     *       DATE:  04/15/83  BY: HOWARD M. DEAN                     *
     *                                                               *
     *                                                               *
     *                                                               *
     *       RELEASE         - OS/MVS 3.8                            *
     *       ENVIRONMENT     - 16MB IBM 3033, 16MB AMDAHL V8         *
     *                       - 24MB IBM 3081                         *
     *                                                               *
     *       PTF LEVEL       - 8301  FMID (EBB1102)                  *
     *                                                               *
     *       USERMOD         - LA00156                               *
     *       JOBNAME         - SSUD156B                              *
     *       TYPE            - MOD/MACUPD                            *
     *                                                               *
     *       PRODUCT         - TEST COMMAND PROCESSOR (BASE MVS)     *
     *       LMOD            - TEST,IKJEGLBP,IKJEBFND                *
     *       MAC             - TEST (ALIAS T)                        *
     *       MOD (CSECT)     - IKJEGSCU,IKJEGLBP,IKJEGFND            *
     *       ZAP             - IKJEGMNL                              *
     *                                                               *
     *       PROBLEM         - PROVIDE A FACILITY FOR USER COMMANDS  *
     *                         TO BE ADDED TO THE 'TEST' COMMAND     *
     *                         PROCESSOR. THIS LOCAL MODIFICATION    *
     *                         UPDATES THE 'TEST' USER SUBCOMMAND    *
     *                         TABLE AND ADDS NEW TEST SUBCOMMANDS.  *
     *                                                               *
     *       PURPOSE/        - TWO NEW ADDED SUBCOMMANDS OF TEST:    *
     *       ENHANCEMENT       IKJEGLBP - (LISTBKPT,LB)              *
     *                         LISTS BREAKPOINTS SET                 *
     *                                                               *
     *                         IKJEGFND - (FIND,F)                   *
     *                         FIND A CHARACTER OR HEX STRING        *
     *                         WITHIN THE TESTED LOAD MODULE         *
     *                                                               *
     *                         UPDATE TEST HELP ACCORDINGLY          *
     *                         ZAP IKJEGMNL TO FLAG CHANGE FOR SMP   *
     *****************************************************************
     */.
++ VER (Z038) FMID(EBB1102) PRE(UZ51877,UZ52702,UZ53527,
                                UZ55717,UZ59049).
++ JCLIN.
//SG23    EXEC PGM=IEWL,
//  PARM='MAP,LET,LIST,NCAL,XREF,RENT'
//SYSPRINT     DD  SYSOUT=*
//SYSUT1       DD  UNIT=SYSDA,SPACE=(CYL,1)
//ACMDLIB      DD  DSN=SYS1.ACMDLIB,DISP=SHR
//SYSLMOD      DD  DSN=SYS1.CMDLIB,DISP=SHR
//SYSLIN       DD  *
 INCLUDE ACMDLIB(IKJEGLBP)    ** LIST BREAKPOINT SUBCOMMAND **
 ENTRY   IKJEGLBP             ** LB SUBCOMMAND ENTRY POINT  **
 NAME    IKJEGLBP(R)          ** LIST BREAKPOINT CMD MODULE **
 INCLUDE ACMDLIB(IKJEGFND)    ** FIND SUBCOMMAND PROCESSOR  **
 ENTRY   IKJEGFND             ** FIND SUBCOMMAND ENTRY POINT**
 NAME    IKJEGFND(R)          ** FIND SUBCOMMAND LOAD MOD   **
++ MOD(IKJEGSCU) DISTLIB(ACMDLIB) LMOD(TEST) TXLIB(LOCLOBJ)
   LEPARM(RENT,REUS).
++ MOD(IKJEGLBP) DISTLIB(ACMDLIB) LKLIB(LOCLLOAD)
   LEPARM(RENT,REUS).
++ MOD(IKJEGFND) DISTLIB(ACMDLIB) LKLIB(LOCLLOAD)
   LEPARM(RENT,REUS).
++ ZAP (IKJEGMNL) /* ZAP TO FLAG CHANGE FOR SMP ID CHECK */.
 NAME IKJEGMNL
 IDRDATA LA00156
 VER  0000 47F0,F00E        FLAG CHANGE FOR SMP
 REP  0000 47F0,F00E        REPLACE WITH SAME VALUE
++ MACUPD (TEST) DISTLIB(AHELP) SYSLIB(HELP) MALIAS(T).
./ CHANGE NAME=TEST,SEQFLD=738
  LISTDEB,LISTDCB,LISTMAP,LISTPSW,LISTTCB,LOAD,OFF,QUALIFY,RUN,WHERE,
  FIND,LISTBKPT,SEND,QLIST
=FIND=F
)F FUNCTION
               SEARCH AN ADDRESS RANGE FOR A SPECIFIED VALUE AND
               DISPLAY THE LOCATION OF THE FIRST CHARACTER OF THE
               STRING.

               THE FIND SUBCOMMAND OF TEST MAY BE USED TO LOCATE A
               SPECIFIC DATA STRING IN A PROGRAM BEING TESTED.  THE
               USER MUST SPECIFY AN ADDRESS RANGE WHERE THE STRING IS
               TO BE LOCATED AND A STRING OF DATA TO BE FOUND.  THE
               ADDRESS RANGE MAY BE SPECIFIED IN ANY FORM ACCEPTABLE
               TO TEST.  THE STRING TO BE LOCATED MUST BE SPECIFIED
               AS A DATA-TYPE AND VALUE.

               THE ADDRESS RETURNED IS ALWAYS AN ABSOLUTE ADDRESS.

               THE ENTIRE STRING MUST BE CONTAINED WITHIN THE ADDRESS
               RANGE SPECIFIED.
)X SYNTAX
               FIND  ADDRESS-RANGE  DATA-TYPE'VALUE'  ALL

               DEFAULTS - NONE
               REQUIRED - ADDRESS-RANGE, DATA-TYPE'VALUE'

               ALIAS    - F
)O OPERANDS
               ADDRESS-RANGE
                    SPECIFIES THE ADDRESSES BETWEEN WHICH THE SEARCH
                    IS TO BE PERFORMED.  SEE DESCRIPTION OF THE TEST
                    COMMAND FOR VALID ADDRESS FORMATS.  THIS OPERAND
                    MUST BE ENTERED AS A RANGE.

               DATA-TYPE'VALUE'
                    SPECIFIES THE TYPE OF DATA AND THE VALUE THAT IS
                    TO BE FOUND.  THE TYPE OF DATA IS INDICATED BY A
                    TYPE CODE CHARACTER.

                    THE VALUE IS ENTERED FOLLOWING THE CODE.  THE
                    DATA MUST BE ENCLOSED WITHIN APOSTROPHES.  ANY
                    SINGLE APOSTROPHES WITHIN THE DATA MUST BE CODED
                    AS TWO SINGLE APOSTROPHES.  CHARACTER DATA IS
                    ENTERED AS IS; ALL OTHER DATA TYPES WILL BE
                    TRANSLATED TO UPPERCASE (IF NECESSARY).

                    VALID DATA TYPES, TYPE CODES, MAXIMUM LENGTH,
                    LIMIT VALUES, AND ALLOWABLE CHARACTERS ARE
                    DEFINED BY THE FOLLOWING TABLE:

     --------------------------------------------------------------
    ×DATA TYPE       ×TYPE×MAX×   MAX    ×    MIN    ×VALID× VALID ×
    ×                ×CODE×LEN×  VALUE   ×   VALUE   ×SIGNS× CHARS ×
    ×--------------------------------------------------------------×
    ×CHARACTER       ×  C × 64×   N/A    ×    N/A    × N/A ×  ALL  ×
    ×HEXADECIMAL     ×  X × 64×   N/A    ×    N/A    × NONE×0-9,A-F×
    ×BINARY          ×  B × 64×   N/A    ×    N/A    × NONE×  0-1  ×
    ×HALFWORD        ×  H × 6 ×     32767×     -32768× +,- ×  0-9  ×
    ×FULLWORD        ×  F × 11×2147483647×-2147483648× +,- ×  0-9  ×
    ×PACKED DECIMAL  ×  P × 32×1*10**32-1×-1*10**32-1× +,- ×  0-9  ×
    ×ADDRESS CONSTANT×  A × 11×2147483647×          0×  +  ×  0-9  ×
    ×ADDRESS CONSTANT×  V × 11×2147483647×          0×  +  ×  0-9  ×
    ×HALFWORD ADDRESS×  Y × 6 ×     32767×          0×  +  ×  0-9  ×
     --------------------------------------------------------------

                    MAXIMUM LENGTH INCLUDES ONE CHARACTER FOR A SIGN
                    FOR DATA TYPES WHERE A SIGN IS VALID.  THE
                    NUMERIC PORTION HAS A MAXIMUM LENGTH OF ONE LESS
                    THAN THE VALUE SHOWN.

))ALL               SPECIFIES THAT ALL OCCURRENCES OF THE SEARCH
                    STRING WITHIN THE SPECIFIED RANGE ARE TO BE
                    IDENTIFIED.  IF ALL IS NOT SPECIFIED, PROCESSING
                    TERMINATES AFTER THE FIRST OCCURRENCE IS FOUND.
=LISTBKPT=LB
)F FUNCTION
               LIST THE ACTIVE BREAKPOINT SETTINGS UNDER THE TSO TEST
               COMMAND.

               THE FOLLOWING DATA IS DISPLAYED FOR EACH BREAKPOINT:

               1.   THE ABSOLUTE ADDRESS AT WHICH THE BREAKPOINT IS
                    LOCATED.
               2.   THE TEXT STRING USED TO SET THE BREAKPOINT
                    (UNLESS IT IS PART OF A RANGE - SEE BELOW).
               3.   THE LIST OF SUBCOMMANDS TO BE EXECUTED WHEN THE
                    BREAKPOINT IS REACHED (IF SPECIFIED).
               4.   THE COUNT VALUE (IF SPECIFIED).
               5.   NONOTIFY (IF SPECIFIED).

               IF BREAKPOINTS ARE DEFINED AS A RANGE, THEY WILL BE
               DISPLAYED AS THE FIRST ADDRESS IN THE RANGE PLUS A
               HEXADECIMAL DISPLACEMENT.
)X SYNTAX
               LISTBKPT

               ALIAS - LB
)O OPERANDS
               LISTBKPT HAS NO OPERANDS.
=QLIST=QL
)F FUNCTION -
  THE QLIST SUBCOMMAND DISPLAYS A SEQUENTIAL DATA SET
  OR A MEMBER OF A PARTITIONED DATA SET ON THE TERMINAL.

  IT IS SIMILAR TO THE TSO LIST COMMAND, WEAKER IN SOME AREAS,
  STRONGER IN OTHERS.  WHEN THE SYSTEM IS UNDER A HEAVY LOAD
  THIS SUBCOMMAND WILL RESPOND MUCH FASTER (IN THE TIME BETWEEN
  THE START OF THE SUBCOMMAND AND THE FIRST OUTPUT LINE APPEARING)
  THAN THE TSO LIST COMMAND, ESPECIALLY WHEN LISTING A MEMBER.

  FEATURES IN QLIST THAT ARE NOT IN TSO LIST -
     .  FILE KEYWORD FOR LISTING BY DDNAME
     .  HEX KEYWORD
     .  FOR PARTIAL LISTINGS, INSTEAD OF SPECIFYING A SEQUENCE
        NUMBER RANGE YOU SPECIFY THE MAXIMUM NUMBER OF RECORDS
        TO PRINT AND/OR THE NUMBER OF RECORDS TO BYPASS.
     .  IF NUM/SNUM/NONUM NOT SPECIFIED, WILL CHECK FOR SEQUENCE
        NUMBERS AND DEFAULT TO NUM OR NONUM ACCORDINGLY.
     .  ASA CARRIAGE CONTROL CHARACTERS WILL APPEAR IF PRESENT.
     .  OBJ KEYWORD WILL SUBSTITUTE DOTS FOR NON-PRINTABLE CHARACTERS
  FEATURES IN LIST THAT ARE NOT IN QLIST -
     .  PARTIAL LIST BY SEQUENCE NUMBER RANGE.
     .  MULTIPLE COLUMN RANGES.
     .  SPECIFIABLE SEQUENCE FIELD LOCATION AND LENGTH.
     .  MULTIPLE DATA SETS.
     .  LIST RECFM=U DATA SETS.
     .  HEADING LINE SHOWING DATA SET NAME.
)X SYNTAX  -
         QLIST 'DSNAME' BYPASS('INTEGER')   MAX('INTEGER')
             NUM/SNUM/NONUM   COL('BEGIN COLUMN':'END COLUMN')
             FILE   HEX/X   QUICK/Q   OBJ
  REQUIRED - DSNAME
  DEFAULTS - NUM (UNLESS A NON-NUMERIC IS ENCOUNTERED, THEN NONUM)
)O OPERANDS -
  'DSNAME' - THE SEQUENTIAL DATA SET OR MEMBER OF A PARTITIONED
             DATA SET TO BE LISTED, OR, IF THE 'FILE' KEYWORD
             IS ALSO SPECIFIED, THE FILENAME (DDNAME) CURRENTLY
             ALLOCATED TO THE DATASET OR MEMBER TO BE LISTED.
))BYPASS('INTEGER')
           - THE NUMBER OF RECORDS TO SKIP BEFORE PRINTING.
))MAX('INTEGER')
           - THE MAXIMUM NUMBER OF RECORDS TO BE PRINTED.     .
))NUM      - NUM INDICATES THAT THE RECORDS CONTAIN A SEQUENCE
             FIELD, WHICH WILL APPEAR ON THE LEFT. FOR FIXED LENGTH
             RECORDS, THE FIELD IS IN THE LAST EIGHT COLUMNS. FOR
             VARIABLE LENGTH RECORDS, THE FIELD IS IN THE FIRST
             EIGHT COLUMNS.
))SNUM     - SNUM INDICATES THAT THE SEQUENCE FIELD IS NOT TO
             BE PRINTED.
))NONUM    - NONUM INDICATES THAT THE ENTIRE RECORD IS TO BE
             TREATED AS DATA, WITH NO SEQUENCE FIELDS.
))COL('BEGIN COLUMN':'END COLUMN')
           - A PAIR OF INTEGERS SEPARATED BY A COLON, INDICATING
             THE FIRST AND LAST COLUMN TO BE PRINTED.
))HEX      - INDICATES THE DATA IS TO BE PRINTED IN HEXADECIMAL.
             BLANKS ARE PRINTED AS '<>' INSTEAD OF '40'.
             SEQUENCE NUMBERS REMAIN IN DECIMAL FORMAT.
             THIS KEYWORD MAY BE ABBREVIATED TO 'X'.
))OBJ      - INSTRUCTS QLIST TO TRANSLATE NON-PRINTABLE CHARACTERS
             TO DOTS. THIS ALLOWS OBJECT DECKS TO BE LISTED WITHOUT
             SENDING A LOT OF HEX DATA THROUGH THE TERMINAL NETWORK.
             OBJECT DECKS CAN SOMETIMES CAUSE TERMINALS TO BEHAVE
             IN A STRANGE MANNER DUE THE THE HEX VALUES IN TXT FIELDS.
))FILE     - INDICATES THE FIRST OPERAND IS A FILENAME (DDNAME)
             INSTEAD OF A DATA SET NAME.  THE FILENAME MUST
             BE CURRENTLY ALLOCATED TO A DATA SET ON DISK.
             THIS MAKES IT POSSIBLE TO LIST A TEMPORARY DATA SET.
))QUICK    - THIS KEYWORD SPEEDS UP THE SUBCOMMAND SOMEWHAT BY CAUSING
             THE SUBCOMMAND NOT TO SEARCH THE CATALOG TO DETERMINE
             THE TRAILING QUALIFIER OF AN UNQUALIFIED DATA SET NAME.
             FOR EXAMPLE, IF YOU HAVE A DATA SET NAMED X.DATA
             YOU CAN LIST IT BY TYPING "QL X" OR "QL X.DATA".
             IN EITHER CASE THE SUBCOMMAND WILL SEARCH THE CATALOG
             TO FIND ANY ADDITIONAL TRAILING QUALIFIER. BUT IF
             YOU TYPE "QL X.DATA QUICK" YOU ARE TELLING IT THAT
             YOU HAVE SPECIFIED THE TRAILING QUALIFIER AND IT CAN
             SAVE ITSELF THE TROUBLE OF LOOKING FOR ONE.  IF YOU
             TYPED "QL X Q" (QUICK CAN BE ABBREVIATED Q) YOU WOULD
             BE INFORMED THAT DATA SET X DOES NOT EXIST, EVEN
             THOUGH X.DATA DOES EXIST.  NOTE THAT THE SUBCOMMAND MAY
             STILL HAVE TO SEARCH THE CATALOG TO FIND THE VOLUME
             BUT THIS IS A SEPARATE SEARCH FROM THE QUALIFIER SEARCH.
=SEND=SE
)F FUNCTION -
  COMMUNICATION BETWEEN USER TERMINALS, OR BETWEEN USER TERMINAL AND
  OPERATOR CONSOLE.
)X SYNTAX -
    SEND   ''TEXT''  USER('USERID LIST')  NOW/LOGON/SAVE  WAIT/NOWAIT
                     OR
                     OPERATOR('ROUTING CODE')
                     OR
                     CN('CONSOLE IDENTIFIER')
  REQUIRED - ''TEXT''
  DEFAULTS - NOW, OPERATOR(2), NOWAIT,NOW
  ALIAS    - SE
  NOTE     - DEFAULT OF OPERATOR(2) IS FOR MASTER CONSOLE.
)O OPERANDS -
  ''TEXT'' - MESSAGE TO BE SENT IN QUOTES.  IF AN APOSTROPHE IS TO BE
             PART OF THE MESSAGE, IT MUST BE ENTERED AS 2 APOSTROPHES.
))USER('USERID LIST')
           - SPECIFIES THAT THE MESSAGE IS TO BE SENT TO THE INDICATED
             USER(S) ONLY.
    'USERID LIST'
           - LIST OF USERIDS TO WHOM MESSAGE IS TO BE ROUTED.
             IF '*' IS SPECIFIED INSTEAD OF A USERID, THE
             USERID OF THE SENDER WILL BE SUBSTITUTED.
))NOW      - SPECIFIES THAT THE MESSAGE IS TO BE SENT NOW.
))LOGON    - SPECIFIES THAT THE MESSAGE IS TO BE SENT NOW (IF USER IS
             CURRENTLY LOGGED ON) OR SAVED IN THE BROADCAST DATA SET
             UNTIL THE SPECIFIED USER LOGS ON.
))WAIT     - SPECIFIES THAT THE SENDER IS WILLING TO WAIT FOR ALL
             INDICATED LOGGED ON USERS TO RECEIVE THE MESSAGE.
))NOWAIT   - SPECIFIES THAT THE SENDER SHOULD NOT BE KEPT
             WAITING IF ANY LOGGED ON USER CANNOT RECEIVE
             THE MESSAGE IMMEDIATELY.
))SAVE     - SPECIFIES THAT THE MESSAGE IS TO BE SAVED IN THE
             BROADCAST DATASET AND NOT SENT NOW.
))OPERATOR('ROUTING CODE')
           - SPECIFIES THE MESSAGE IS TO BE ROUTED TO THE OPERATOR.
    'ROUTING CODE'
           - INTEGER SPECIFYING THE FUNCTIONAL CONSOLE TO WHICH MESSAGE
             IS TO BE ROUTED USING THE INTEGER AS A ROUTING CODE.
))CN('CONSOLE IDENTIFIER')
           - SPECIFIES THE MESSAGE IS TO BE SENT TO AN OPERATOR
             CONSOLE.
    'CONSOLE IDENTIFIER'
           - INTEGER SPECIFYING THE CONSOLE NUMBER. THIS NUMBER IS
             APPENDED TO ANY MESSAGE SENT FROM AN OPERATOR CONSOLE.

./ ENDUP
$$
//
./       ADD   NAME=LA00165B
//SSUI165B JOB (M,AJNJ,S610C021),02515HJT,MSGLEVEL=1,
//     CLASS=A,MSGCLASS=Q,NOTIFY=SSUI
//*ACCT        HOWARD THOMPSON,SSU
/*JOBPARM L=999,S=*
//***
//***    SYS PROG: J.C. WESSEL
//***
//***    DATE:     04/14/83 (MODIFIED BY H.M. DEAN)
//***
//***    LOCATION: SYST.LOCLMODS.CNTL(LA00165B)
//***
//***    DESC: 1. EXTERNAL WRITER, LOG AND SOMF SEPARATOR ROUTINES
//***          2. EXTERNAL WRITER, DDNAME=IEFRDER FORCE
//***          3. EXTERNAL WRITER, SYSLOG AND SYSOUT MICROFICHE FIXES
//***          4. EXTERNAL WRITER, RECFM=V RECORD TRUNCATION MODS
//***
//SMP      EXEC PUTSMP,REGION=3700K,OPT=200
//SMPCNTL  DD *
   RECEIVE S(LA00165).
   APPLY   S(LA00165) DIS(WRITE).
//SMPPTFIN DD DATA,DLM=$$
++ USERMOD (LA00165) /*
     *****************************************************************
     *                                                               *
     *       GTEDS: MARINA DEL REY, CALIFORNIA                       *
     *                                                               *
     *       DATE:  04/14/83  BY: J.C. WESSEL                        *
     *                                                               *
     *                                                               *
     *                                                               *
     *       RELEASE         - OS/MVS 3.8                            *
     *       ENVIRONMENT     - 16MB IBM 3033, 16MB AMDAHL V8         *
     *                         24MB IBM 3081                         *
     *                                                               *
     *       PTF LEVEL       - 8301 - FMID(JBB1326)                  *
     *                                                               *
     *                                                               *
     *       USERMOD         - LA00165                               *
     *       JOBNAME         - SSUD165B                              *
     *       TYPE            - MOD/ZAP/XZAP                          *
     *                                                               *
     *                                                               *
     *    1. PRODUCT         - SYSOUT MICROFICHE, LOG WRITER         *
     *       LMOD            - SOMFSEPR, SLOGCHKR                    *
     *       MOD (CSECT)     - SLOGCHKR, SOMFSEPR                    *
     *                                                               *
     *       PROBLEM         - PROVIDE A MEANS OF ASSURING THAT ONLY *
     *                         THE SYSTEM LOG USES THE LOG CLASSES.  *
     *                                                               *
     *                         PROVIDE A SEPARATOR ROUTINE FOR USE   *
     *                         WITH THE SYSOUT-MICROFICHE SYSTEM.    *
     *                                                               *
     *                                                               *
     *       PURPOSE/        - SLOGCHKR - CHECKS FOR 'SYSLOG' AS     *
     *       ENHANCEMENT       THE JOBNAME FOR THE EXTERNAL WRITER   *
     *                         AND PASSES RETURN CODE 4 IF NOT.      *
     *                                                               *
     *                         SOMFSEPR - SEPARATES SYSOUT DATA-     *
     *                         SETS.                                 *
     *                                                               *
     *                                                               *
     *    2. PRODUCT         - EXTERNAL WRITER                       *
     *       LMOD            - IASXWR00                              *
     *       MOD (CSECT)     - IASXWR00                              *
     *                                                               *
     *       PROBLEM         - EXTERNAL WRITER USES FIRST DD ENTRY   *
     *                         IN TIOT AS OUTPUT DDNAME. THUS, IF    *
     *                         A STEPLIB IS THE FIRST DDNAME, THEN   *
     *                         IT WILL BE OVERWRITTEN WITH EXT WTR   *
     *                         OUTPUT.                               *
     *                                                               *
     *       PURPOSE/        - PREVENT OVER-WRITING OF A STEPLIB.    *
     *       ENHANCEMENT                                             *
     *                                                               *
     *                                                               *
     *    3. PRODUCT         - EXTERNAL WRITER                       *
     *       LMOD            - IASXWR00                              *
     *       MOD (CSECT)     - IASXSD82                              *
     *                                                               *
     *                                                               *
     *       PROBLEM         - PROVIDE SUPPORT FOR SYSOUT/MICROFICHE *
     *                         SYSTEM, SYSLOG WRITER, ETC. CORRECT   *
     *                         VARIOUS ANNOYANCES IN THE IBM VERSION *
     *                         OF THE EXTERNAL WRITER.               *
     *                                                               *
     *       ENHANCEMENT     - SYSOUT MICROFICHE SYSTEM WORKS,       *
     *                         SYSLOG RETRIEVAL SYSTEM  WORKS.       *
     *                                                               *
     *                                                               *
     *    4. PRODUCT         - EXT WRITER, RECFM=V TRUNCATION        *
     *       LMOD            - IEFSD087, IEFSD094                    *
     *       MOD (CSECT)     - IEFSD089                              *
     *                                                               *
     *       PROBLEM         - EXTERNAL WRITER DOES NOT TRUNCATE     *
     *                         TRAILING BLANKS FROM VARIABLE LENGTH  *
     *                         INPUT RECORDS ON OUTPUT. ALSO, SOME   *
     *                         ERRONEOUS LONG RECORDS HAVE CREPT INTO*
     *                         OUR SYSOUT-MICROFICHE SYSTEM.         *
     *                                                               *
     *       PURPOSE/        - EXT WRITER TRUNCATES VARIABLE LENGTH  *
     *       ENHANCEMENT       OUTPUT RECORDS BY DELETING TRAILING   *
     *                         BLANKS. ALSO, RECORDS LONGER THAN     *
     *                         THE 'MAX' LRECL (SPECIFIED IN THE DEB)*
     *                         ARE CHOPPED OFF AT THE 'MAX'.         *
     *                                                               *
     *****************************************************************
     */.
++ VER (Z038) FMID(JBB1326) PRE(UZ57599) /* ALL CHANGED TO JBB1326 */.
++ JCLIN.
//SYSGEN01 JOB 'SYSTEM-GENERATION',MSGLEVEL=1
//SG19     EXEC PGM=IEBCOPY
//SYSPRINT DD   SYSOUT=A
//SYSUT3   DD   UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSUT4   DD   UNIT=SYSDA,SPACE=(CYL,(1,1))
//AOSB0    DD   DSNAME=SYS1.AOSB0,DISP=SHR,UNIT=DISK,VOL=SER=DLIB01
//LPALIB   DD   DSNAME=SYS1.LPALIB,DISP=SHR,UNIT=DISK,VOL=SER=SYSRES
//SYSIN    DD   *
  COPY     OUTDD=LPALIB,INDD=AOSB0
  SELECT   MEMBER=((SOMFSEPR,,R))
  SELECT   MEMBER=((SLOGCHKR,,R))
++ MOD (SOMFSEPR) LKLIB(LOCLLOAD) LEPARM(RENT,REUS) DISTLIB(AOSB0).
++ MOD (SLOGCHKR) LKLIB(LOCLLOAD) LEPARM(RENT,REUS) DISTLIB(AOSB0).
++ ZAP (IASXWR00) /*
***********************************************************************
*                                                                     *
*   LA16400 -- EXTERNAL-WRITER OUTPUT DDNAME FIX                      *
*                                                                     *
*   THIS MODIFICATION ADDS THE 'DDNAME=IEFRDER' SPECIFICATION TO THE  *
*   OUTPUT DATA-SET DCB AND DELETES THE INSTRUCTION WHICH MOVES THE   *
*   FIRST DDNAME IN THE TIOT INTO THE 'DCBDDNAM' FIELD OF THE OUTPUT  *
*   DATA-SET DCB (PREVENTS THE OVER-WRITING OF A STEPLIB).            *
*                                                                     *
***********************************************************************
  */.
  NAME  IASXWR00
  VER   007A  D2072028601C
  VER   0140  F040404040404040
  REP   007A  47000000,0700          DELETE TIOEDDNM MOVE
  REP   0140  C9C5C6D9C4C5D940       DCBDDNAM=IEFRDER
  IDRDATA  LA00165
++ ZAP (IASXSD82)  /*
***********************************************************************
*                                                                     *
*   LA16500 -- EXTERNAL-WRITER SYSOUT-MICROFICHE AND SYSLOG           *
*              MODIFICATIONS                                          *
*                                                                     *
*     1)  WHEN THE EXTERNAL-WRITER STARTS, IT USES 'DEST=LOCAL' AS    *
*   ONE OF THE JOB-SELECTION CRITERIA.  OUTPUT THAT HAS BEEN ROUTED   *
*   TO A SPECIFIC PRINTER IS THUS UNAVAILABLE TO THE EXTERNAL-WRITER  *
*   (AND THEREFORE UNAVAILABLE TO THE SYSOUT-MICROFICHE SYSTEM).      *
*   THIS MODIFICATION CAUSES THE EXTERNAL-WRITER TO NOT SPECIFY       *
*   DESTINATION AS A JOB-SELECTION CRITERION.                         *
*                                                                     *
*     2)  THE SYSOUT-MICROFICHE SYSTEM REQUIRES THAT EACH PRINT       *
*   DATA-SET BE PRECEDED BY A SEPARATOR RECORD.  THE EXTERNAL-WRITER  *
*   GENERATES A SEPARATOR PAGE ONLY WHEN THE JOB-NAME CHANGES.  THIS  *
*   MODIFICATION CAUSES THE SEPARATOR ROUTINE TO BE CALLED AT THE     *
*   BEGINNING OF EACH PRINT DATA-SET.                                 *
*                                                                     *
*     3)  THIS MODIFICATION ADDS THE 'LONG=YES' OPTION TO THE         *
*   WAITING-FOR-WORK 'WAIT' MACRO.  THE 'LOGEXEC' COMPONENT OF THE    *
*   SYSLOG SYSTEM USES THE 'LONG-WAIT' STATUS AS AN INDICATION THAT   *
*   THE EXTERNAL-WRITER ('LOGWTR') HAS FINISHED WRITING ANY AVAIL-    *
*   ABLE SYSOUT DATA-SETS AND IS THEREFORE 'READY' FOR MORE.          *
*                                                                     *
*     4)  AN OUTPUT CLASS MUST BE RESERVED FOR SYSLOG, BUT THERE IS   *
*   NO WAY TO PREVENT A USER FROM PUTTING OUTPUT INTO THIS RESERVED   *
*   CLASS (WHICH WOULD RESULT IN THE USER OUTPUT BEING INTERMIXED     *
*   WITH THE SYSTEM LOG).  THIS MODIFICATION ALLOWS A SEPARATOR ROU-  *
*   TINE TO PASS A RETURN-CODE OF 4 TO CAUSE THE OUTPUT DATA-SET TO   *
*   BE REJECTED (IE, BYPASSED BY THE EXTERNAL-WRITER AND PURGED BY    *
*   JES).  THUS THE 'LOGWTR' SEPARATOR ROUTINE CAN REJECT A NON-      *
*   SYSLOG DATA-SET IF THE JOB-NAME IS NOT 'SYSLOG'.                  *
*                                                                     *
***********************************************************************
  */.
  NAME  IASXSD82
  VER   0214  96207018,D20770309BFE        SD82SSOB+X'38'           (1)
  VER   03D6  D50330587028,4780947C        SD82AL+X'28'             (2)
  VER   0894  41101000,41000001,1311,0A01  WAIT                     (3)
  VER   0B44  58480024,92084006,45B09BD8   SD28SEP+X'60'            (4)
  VER   0D47  E9C1D7,E9C1D7,E9C1D7,E9C1D7,E9C1D7                    (3)
  VER   0D56  E9C1D7,E9C1D7,E9C1D7,E9C1D7,E9C1D7,E9C1D7             (4)
  VER   0D68  E9C1D7,E9C1D7,E9C1D7,E9C1D7                           (4)
  REP   0214  47000000,47000000,0700                                (1)
  REP   03D6  47000000,0700,47000000                                (2)
  REP   089C  47F09D46               B     PATCH1                   (3)
  REP   0B48  47F09D54               B     PATCH2                   (4)
  REP   0D48  1311          PATCH1   LCR   R1,R1                    (3)
  REP   0D4A  0780                   BCR   8,0                      (3)
  REP   0D4C  BF089D49               ICM   R0,8,*-1      LONG=YES   (3)
  REP   0D50  0A01                   SVC   1             WAIT       (3)
  REP   0D52  47F0989E               B     BACK1                    (3)
  REP   0D56  49F09D70      PATCH2   CH    R15,FOUR                 (4)
  REP   0D5A  47809D64               BE    DELETE        REJECTED   (4)
  REP   0D5E  92084006               MVI   6(R4),X'08'   SET 'KEEP' (4)
  REP   0D62  47F09B4A               B     BACK2                    (4)
  REP   0D66  92044006      DELETE   MVI   6(R4),X'04' SET 'DELETE' (4)
  REP   0D6A  45B09BD8               BAL   R11,DYNAL     UNALLOCATE (4)
  REP   0D6E  47F0974C               B     TESTCSCB      CONTINUE   (4)
  REP   0D72  0004          FOUR     DC    H'4'                     (4)
  IDRDATA  LA00165
++ ZAP  (IEFSD089) /*
***********************************************************************
*   LA16600 -- EXTERNAL-WRITER RECFM=V RECORD TRUNCATION MODIFICATION *
*                                                                     *
*   THIS MODIFICATION CAUSES THE EXTERNAL-WRITER TO TRUNCATE          *
*   VARIABLE-LENGTH OUTPUT RECORDS BY DELETING THE TRAILING BLANKS.   *
*   THIS IS ACCOMPLISHED BY SCANNING THE DATA PORTION (IE, EXCLUDING  *
*   THE CARRIAGE CONTROL CODE) OF THE INPUT RECORD (LENGTH IN         *
*   'INLSF' AND ADDRESS IN 'INLOC') FROM END TO BEGINNING UNTIL THE   *
*   FIRST NON-BLANK CHARACTER IS FOUND, AND THEN ADJUSTING THE        *
*   LENGTH FIELD ('INLSF') ACCORDINGLY.  AT LEAST NINE CHARACTERS     *
*   (TEN CHARACTERS IF THERE IS NO CARRIAGE CONTROL CODE) ARE RE-     *
*   TAINED TO ASSURE THAT NO BLOCK WILL BE LESS THAN EIGHTEEN BYTES   *
*   LONG.  IF THE RECORD LENGTH EXCEEDS THE MAXIMUM 'LRECL', THE      *
*   MAXIMUM 'LRECL' IS USED.  (THE MAXIMUM 'LRECL', IF IT WAS SPECI-  *
*   FIED, IS IN THE DEB.)  THIS MODIFICATION IS REQUIRED TO INCREASE  *
*   THE PROCESSING EFFICIENCY OF THE SYSOUT-MICROFICHE SYSTEM.        *
*                                                                     *
*   WHEN CONVERTING MACHINE-TYPE PRINTER CONTROL CODES TO ASA-TYPE    *
*   CODES, THE EXTERNAL-WRITER DISCONTINUES PROCESSING THE DATA-SET   *
*   WITH MESSAGE IEF316I IF IT ENCOUNTERS AN INVALID MACHINE CODE.    *
*   THIS MODIFICATION CAUSES THE EXTERNAL-WRITER TO SINGLE-SPACE THE  *
*   LINE WITH THE INVALID CODE (IE, USE X'40' AS THE CONTROL CODE)    *
*   AND TO CONTINUE PROCESSING THE DATA-SET.  THIS PREVENTS THE LOSS  *
*   OF THE REMAINDER OF THE DATA-SET.                                 *
*                                                                     *
***********************************************************************
                                                                    */.
  EXPAND IEFSD089(160)
  NAME   IEFSD089
*
  VER   0222  4770A0AC               BNE   BCCCO               07860000
  VER   022A  4780A0AC               BZ    BCCCO               07900000
  VER   023A  4740A0AC               BL    BCCCO               07980000
  VER   0242  4720A0AC               BH    BCCCO               08020000
  VER   024E  42408002               STC   R4,SAVED            08120000
  VER   0252  58F07074      OUTPT    L     R15,WOXXX           08324017
  VER   029A  41220004               LA    R2,4(R2)            08600000
  VER   05F8  00000000,00000000,00000000,00000000             EXPANSION
  VER   0608  00000000,00000000,00000000,00000000
  VER   0618  00000000,00000000,00000000,00000000
  VER   0628  00000000,00000000,00000000,00000000
  VER   0638  00000000,00000000,00000000,00000000
  VER   0648  00000000,00000000,00000000,00000000
  VER   0658  00000000,00000000,00000000,00000000
  VER   0668  00000000,00000000,00000000,00000000
  VER   0678  00000000,00000000,00000000,00000000
  VER   0688  00000000,00000000,00000000
*
  REP   0224  A24C                   ON INVALID MACHINE CONTROL CODE,
  REP   022C  A24C                      GO SET THE CONTROL CHARACTER
  REP   023C  A24C                         TO X'40' (AT TMAPR+4), AND
  REP   0244  A24C                            CONTINUE PROCESSING
*
  REP   0252  47F0A5F6      OUTPT    B     PATCH1
*
  REP   029A  47F0A67C               B     PATCH2
*
  REP   05F8  91805024      PATCH1   TM    DCBRECFM,DCBRECF
  REP   05FC  4710A672               BO    ENDPATCH
  REP   0600  91405024               TM    DCBRECFM,DCBRECV
  REP   0604  47E0A672               BNO   ENDPATCH
  REP   0608  41200004               LA    R2,4
  REP   060C  91065024               TM    DCBRECFM,DCBRECCC
  REP   0610  4780A616               BZ    NOCC
  REP   0614  41220001               LA    R2,1(R2)
  REP   0618  58F0502C      NOCC     L     R15,DCBDEBAD
  REP   061C  1700                   XR    R0,R0
  REP   061E  1810                   LR    R1,R0
  REP   0620  4300F010               IC    R0,DEBNMEXT
  REP   0624  4310F01C               IC    R1,DEBEXSCL
  REP   0628  89001000               SLL   R0,0(,R1)
  REP   062C  1810                   LR    R1,R0
  REP   062E  4801F02E               LH    R0,46(R1,R15)  DEBLRECL
  REP   0632  1200                   LTR   R0,R0
  REP   0634  47D0A644               BNP   LENOK
  REP   0638  1B02                   SR    R0,R2
  REP   063A  59008008               C     R0,INLSF
  REP   063E  47B0A644               BNL   LENOK
  REP   0642  50008008               ST    R0,INLSF
  REP   0646  98018008      LENOK    LM    R0,R1,INLSF & INLOC
  REP   064A  18F1                   LR    R15,R1
  REP   064C  4110100D               LA    R1,13(,R1)
  REP   0650  1F12                   SLR   R1,R2
  REP   0652  182F                   LR    R2,R15
  REP   0654  1E20                   ALR   R2,R0
  REP   0656  4800A67A               LH    R0,MINUSONE
  REP   065A  8720A672               BXLE  R2,R0,ENDPATCH
  REP   065E  95402000      LOOP     CLI   0(R2),C' '
  REP   0662  4770A668               BNE   FOUND
  REP   0666  8620A65C               BXH   R2,R0,LOOP
  REP   066A  41202001      FOUND    LA    R2,1(,R2)
  REP   066E  1F2F                   SLR   R2,R15
  REP   0670  50208008               ST    R2,INLSF
  REP   0674  58F07074      ENDPATCH (ZAPPED INSTRUCTION)
  REP   0678  47F0A254               B     OUTPT+4
  REP   067C  FFFF          MINUSONE DC    H'-1'
  REP   067E  41220004      PATCH2   (ZAPPED INSTRUCTION)
  REP   0682  4920A68C               CH    R2,FOURTEEN+2  FOR RECFM=V,
  REP   0686  47B0A2AC               BNL   TFOBS          ALLOW FOR BDW
  REP   068A  1B32                   SR    R3,R2          IN MIN LENGTH
  REP   068C  4120000E      FOURTEEN LA    R2,14          CHECK
  REP   0690  47F0A2AA               B     TFSMR+14
*
  IDRDATA  LA00165
$$
//
./       ADD   NAME=LA00170A
//SSUD170A JOB (M,AJNJ,S610C021),04542HMD,CLASS=A,NOTIFY=SSUD,
//   MSGCLASS=O,TYPRUN=HOLD
/*ROUTE  PRINT U90
//*ACCT        HOWARD DEAN,SSU
/*JOBPARM L=999
//***
//***    SYS PROG: H.M. DEAN
//***    DATE:     04/13/83
//***    LOCATION: SYST.LOCLMODS.CNTL(LA00170A)
//***    DESC:     ABEND PROCESSING USER EXIT LOCAL MODS:
//***
//***               1. SZAP LPALIB, IMS DFSMRCL0 MODULE NAME TABLE
//***                  ++MOD (DFSMRCL0)  FROM LOCLLOAD
//***
//***               2. IMS DUMP, ADD DFSAFMD0 TO MODULE NAME TABLE
//***                  FOR IMS DUMP FORMATTING.
//***                  ++MOD (DFSAFMD0)  FROM LOCLLOAD
//***
//***
//SMP      EXEC PUTSMP,REGION=3700K,OPT=200
//SMPCNTL  DD *
   RESTORE S(LA00170) DIS(WRITE).
   RECEIVE S(LA00170).
   APPLY   S(LA00170) DIS(WRITE).
//SMPPTFIN DD DATA,DLM=$$
++USERMOD (LA00170) /*  IMS CLEANUP AND DUMP FORMATTER
     *****************************************************************
     *                                                               *
     *       GTEDS: MARINA DEL REY, CALIFORNIA                       *
     *                                                               *
     *       DATE:  04/13/83  BY: H.M. DEAN                          *
     *                                                               *
     *                                                               *
     *       RELEASE         - OS/MVS 3.8                            *
     *       ENVIRONMENT     - 16MB IBM 3033, 16MB AMDAHL V8         *
     *                         24MB IBM 3081D                        *
     *                                                               *
     *       PTF LEVEL       - 8301 (FMID EBB1102)                   *
     *                                                               *
     *       USERMOD         - LA00170                               *
     *       JOBNAME         - SSUD170A                              *
     *       TYPE            - SUPERZAP/MOD                          *
     *                                                               *
     *                                                               *
     *    1. PRODUCT         - IMS                                   *
     *       LMOD            - DFSMRCL0 (IMS RESOURCE CLEANUP LMOD)  *
     *       MOD (CSECT)     - DFSMRCL0 (IMS RESOURCE CLEANUP)       *
     *       ZAP (MOD)       - IEAVTRML (CSECT IN IGC0001C)          *
     *                                                               *
     *       PROBLEM         - PROVIDE TERMINATION PROCESSING USER   *
     *                         EXIT FOR IMS RESOURCE CLEANUP         *
     *                                                               *
     *       PURPOSE/        - ADD DFSMRCL0 TO MODULE NAME TABLE     *
     *       ENHANCEMENT       FOR RTM EXIT PROCESSIONG              *
     *
     *                       - ADD MODULE DFSMRCL0 TO LPALIB         *
     *                                                               *
     *    2. PRODUCT         - IMS                                   *
     *       LMOD            - DFSAFMD0 (IMS DUMP FORMATTING LMOD)   *
     *       MOD (CSECT)     - DFSAFMD0                              *
     *       ZAP (MOD)       - IEAVADFM (CSECT IN IGC0005A (SNAP))   *
     *                                                               *
     *       PROBLEM         - PROVIDE MEANS TO FORMAT IMS DUMPS     *
     *                         VIA USER EXIT PROCESSING.             *
     *                                                               *
     *       PURPOSE/        - ADD DFSAFMD0 TO MODULE NAME TABLE     *
     *       ENHANCEMENT       FOR IMS DUMP TRANSLATION              *
     *                                                               *
     *****************************************************************
     */.
++VER (Z038) FMID(EBB1102).
++JCLIN.
//SG99      EXEC PGM=IEWL,REGION=512K,
//  PARM='MAP,LIST,LET,XREF,RENT,REFR,NCAL'
//SYSPRINT  DD   SYSOUT=A
//SYSLMOD   DD   DSN=SYS1.LPALIB,DISP=SHR
//LOCLLOAD  DD   DSN=SYS1.LOCLLOAD,DISP=SHR
//SYSUT1    DD   UNIT=SYSDA,SPACE=(CYL,1)
//SYSLIN    DD   *
 INCLUDE LOCLLOAD(DFSMRCL0)
 ENTRY   DFSMRCL0    HMD 04/13/83 - IMS RESOURCE CLEANUP EXIT
 NAME    DFSMRCL0(R)
 INCLUDE LOCLLOAD(DFSAFMD0)
 ENTRY   DFSAFMD0    HMD 04/13/83 - IMS DUMP FORMAT EXIT
 NAME    DFSAFMD0(R)
++MOD (DFSMRCL0) LKLIB(LOCLLOAD) DISTLIB(LOCLLOAD) LEPARM(RENT,REFR).
++MOD (DFSAFMD0) LKLIB(LOCLLOAD) DISTLIB(LOCLLOAD) LEPARM(RENT,REFR).
++ZAP (IEAVTRML)          /* LMOD=IGC0001C  ABEND-SVC 13  */.
***
***  ADD DFSMRCL0 TO MODULE NAME TABLE FOR IMS CLEAN UP .
***
 NAME IEAVTRML
 VER 0000 0000000000000000     VERIFY ZEROS
 REP 0000 C4C6E2D4D9C3D3F0     DC C'DFSMRCL0'
 IDRDATA LA00170
++ ZAP (IEAVADFM)         /* LMOD=IGC0005A  SNAP-SVC 51 */.
***
***  ADD DFSAFMD0 TO MODULE NAME TABLE FOR IMS DUMP FORMATTING.
***
 NAME IEAVADFM
 VER 0000 0000000000000000     VERIFY ZEROS
 REP 0000 C4C6E2C1C6D4C4F0     DC C'DFSAFMD0'
 IDRDATA LA00170
$$
//
./       ADD   NAME=LA00171A
//SSUD171A JOB (M,AJNJ,S610C021),04542HMD,CLASS=K,NOTIFY=SSUD,
//   MSGCLASS=O
/*ROUTE  PRINT PRINTER9
//*ACCT        HOWARD DEAN,SSU
/*JOBPARM L=999,S=ANY
//***
//***    SYS PROG: H. M. DEAN
//***    DATE:     06/24/82
//***    LOCATION: SYST.LOCLMODS.CNTL(LA00171A)
//***    DESC:     TOMARK CORP. ABEND-AID SYSTEM HOOKS
//***
//***    WARNING!  DO NOT RENUMBER THIS LOCAL MODIFICATION
//***              IT CONTAINS A MACRO UPDATE WHOSE SOURCE
//***              LINE NUMBERS WILL BE DESTROYED UPON RENUMBER.
//***
//********************************************************************
//*        LOCAL MOD FOR THE ABEND-AID OPERATING SYSTEM CHANGE       *
//*         FOR MVS SYSTEM PRODUCT (MVS/SP) RELEASE 1.3              *
//********************************************************************
//***
//***
//***
//SMP      EXEC PUTSMP,OPT=200
//SMPCNTL  DD *
   RECEIVE S(LA00171).
   APPLY   S(LA00171) DIS(WRITE).
//SMPPTFIN DD DATA,DLM=$$
++ USERMOD(LA00171)   /* TOMARK CORP. ABEND-AID PROGRAM PRODUCT
     *****************************************************************
     *                                                               *
     *       GTEDS: MARINA DEL REY, CALIFORNIA                       *
     *                                                               *
     *       DATE:  06/24/82  BY: H. M. DEAN                         *
     *                                                               *
     *                                                               *
     *                                                               *
     *       RELEASE         - OS/MVS 3.8                            *
     *       ENVIRONMENT     - 12MB IBM 3033, 12MB AMDAHL V8         *
     *                       - 8MB IBM 3033N                         *
     *                                                               *
     *       PTF LEVEL       - 8204 (FMID JBB1326)                   *
     *                                                               *
     *       USERMOD         - LA00171                               *
     *       JOBNAME         - SSUD171A                              *
     *       TYPE            - MOD/MACUPD
     *                                                               *
     *       PRODUCT         - TOMARK CORP. ABEND AID.               *
     *       LMOD            - IGC0005A (SNAP DUMP)                  *
     *       MOD (CSECT)     - ABENDAID (NEW) - JCLIN INCLUDED       *
     *                                                               *
     *       PROBLEM         - PROVIDE APPLICATION PROGRAMMERS       *
     *                         WITH A MEANS OF SIMPLIFYING THE       *
     *                         OUTPUT OF SYSTEM ABEND DUMPS.         *
     *                         DIAGNOSE PROBLEMS USING SOFTWARE,     *
     *                         SO THAT MASSIVE CORE DUMPS DO NOT     *
     *                         HAVE TO BE PRODUCED AN ANALYZED       *
     *
     *       PURPOSE/        - INSTALL TOMARK COPORATIONS ABEND-AID  *
     *       ENHANCEMENT       UTILITY. HOOKS ARE TO SNAP-DUMP       *
     *                         IGC0005A (SVC 51)                     *
     *                                                               *
     *                                                               *
     *****************************************************************
     */.
++ VER (Z038) FMID(JBB1326) PRE(JBB1226) /* TOMARK ABEND-AID */.
++ JCLIN.
//LINK     EXEC PGM=IEWL,PARM='LIST,XREF,NCAL,RENT,REFR'
//SYSLMOD  DD  DSN=SYS1.LPALIB,DISP=SHR
//AOSC5    DD  DSN=SYS1.AOSC5,DISP=SHR
//SYSLIN   DD  *
 INCLUDE AOSC5(ABENDAID)         ABEND-AID LOCAL MODIFICATION
 ORDER ABENDAID                  TOMARK CORP. ABEND AID (LA00171)
 ORDER IEAVAD00(P),IEAVAD03(P)
 ORDER IEAVAD01(P),IEAVAD0B
 ORDER IEAVAD07(P),IEAVAD08,IEAVAD05(P)
 ORDER IEAVAD02,IEAVAD09(P),IEAVADFM
 ORDER IEAVAD11(P),IEAVAD31,IEAVAD51,IEAVAD71,IEAVAD0A
 ORDER IEAVAD0E(P),IEAVAD0F,IEAVAD10
 ORDER IEAVAD0C(P),IEAVAD0D
 ORDER IEAVTSDG(P),IEAVTSDC,IEAVTSSE
 ORDER IEAVTSDL(P),IEAVTSDF
 ORDER IEAVTSDT(P),IEAVTSDH,IEAVTSDU
 ORDER IEAVTSDO,IEAVTSDW
 ALIAS IEAVTSDT
 ALIAS IEAVTSDA
 ENTRY ABENDAID          TOMARK CORP. ABEND AID (LA00171)
 NAME  IGC0005A(R)
++ MOD(ABENDAID) TXLIB(LOCLOBJ) DISTLIB(AOSC5) LEPARM(RENT,REFR).
++ MACUPD (SGIEA401) DISTLIB(AGENLIB).
./ CHANGE NAME=SGIEA401
         PUNCH ' ORDER ABENDAID        ** TOMARK ABEND-AID **' @LA00171
         PUNCH ' INCLUDE AOSC5(ABENDAID)  ** ABEND-AID **'     @LA00171
         PUNCH ' ENTRY ABENDAID        ** TOMARK ABEND-AID **' @LA00171
./ ENDUP
$$
./       ADD   NAME=LA00176B
//SSUD176B JOB (M,AJNJ,S610C021),04542HMD,CLASS=A,NOTIFY=SSUD,
//   MSGCLASS=O TYPRUN=HOLD
//*ACCT        HOWARD DEAN,SSU
/*ROUTE  PRINT U90
/*JOBPARM L=999,S=*
//***
//***    SYS PROG: HOWARD M. DEAN
//***    DATE:     04/09/83
//***    LOCATION: SYST.LOCLMODS.CNTL(LA00176B)
//***    DESC:     INSTALL APF TABLES FOR TSO:
//***
//***              IKJEFTE2 - TSO COMMAND APF TABLE
//***              IKJEFTE8 - TSO CALLED MODULE APF TABLE
//***
//SMP      EXEC PUTSMP,OPT=200
//SMPCNTL  DD *
   RECEIVE S(LA00176).
   APPLY   S(LA00176) DIS(WRITE).
//SMPPTFIN DD DATA,DLM=$$
++ USERMOD (LA00176) /* TSO APF AUTHORIZATION TABLES
     *****************************************************************
     *                                                               *
     *       GTEDS: MARINA DEL REY, CALIFORNIA                       *
     *                                                               *
     *       DATE:  04/09/83  BY: H.M. DEAN                          *
     *                                                               *
     *                                                               *
     *                                                               *
     *       RELEASE         - OS/MVS 3.8                            *
     *       ENVIRONMENT     - 16MB IBM 3033, 16MB AMDAHL V8         *
     *                       - 24MB IBM 3081                         *
     *                                                               *
     *       PTF LEVEL       - 8207 (FMID EBB1102)                   *
     *                                                               *
     *       USERMOD         - LA00176                               *
     *       JOBNAME         - SSUD176B                              *
     *       TYPE            - MOD                                   *
     *                                                               *
     *       PRODUCT         - TSO TERMINAL MONITOR PROGRAM (TMP)    *
     *       LMOD            - IKJEFT02                              *
     *       MOD (CSECT)     - IKJEFTE2, IKJEFTE8                    *
     *                                                               *
     *       PROBLEM         - CERTAIN TSO COMMANDS AND CALLED       *
     *                         PROGRAMS REQUIRE APF AUTHORIZATION    *
     *                         TO PERFORM THEIR TASKS.               *
     *                                                               *
     *       ENHANCEMENT     - REPLACE DEFAULT IBM APF AUTHORIZATION *
     *                         TABLE FOR TSO COMMANDS AND CALLED     *
     *                         MODULES WITH GTEDS CUSTOMIZED ONES.   *
     *                                                               *
     *****************************************************************
     */.
++VER (Z038) FMID(EBB1102) PRE(LA00175) /* PRE IS PCF II */.
++MOD (IKJEFTE2) DISTLIB(AOST4) LKLIB(LOCLLOAD).
++MOD (IKJEFTE8) DISTLIB(AOST4) LKLIB(LOCLLOAD).
$$
//
./       ADD   NAME=LA00177A
//SSUI177A JOB (M,AJNJ,S610C021),02515HJT,MSGLEVEL=1,
//     CLASS=A,MSGCLASS=Q,NOTIFY=SSUI
//*ACCT        HOWARD THOMPSON,SSU
/*JOBPARM L=999,S=ANY
//*********************************************************************
//***    SYS PROG:       UNIVERSITY COMPUTING COMPANY (UCC)
//***
//***    LOCAL CONTACT:  J.C. WESSEL
//***
//***    DATE:           04/13/83 (MODIFIED BY J.C. WESSEL)
//***
//***    LOCATION:       SYST.LOCLMODS.CNTL(LA00177A)
//***
//***    DESC:           UCC-1 (TMS) HOOKS FOR LEVEL 8301
//***
//*********************************************************************
//SMP      EXEC PUTSMP,REGION=3700K,OPT=200
//SYSIN  DD *
   RECEIVE S(LA00177) .
   APPLY   S(LA00177) DIS(WRITE).
//SMPPTFIN DD DATA,DLM=$$
++ USERMOD (LA00177) /* UCC-ONE (TMS)
***********************************************************************
*****                                                              ****
*****       GTEDS: MARINA DEL REY, CALIFORNIA                      ****
*****                                                              ****
*****       DATE:  04/13/83  BY: J.C. WESSEL                       ****
*****                                                              ****
*****                                                              ****
*****       RELEASE         - OS/MVS 3.8                           ****
*****       ENVIRONMENT     - 12MB IBM 3033, 12MB AMDAHL V8        ****
*****                         24MB IBM 3081                        ****
*****                                                              ****
*****       PTF LEVEL       - 8301                                 ****
*****                                                              ****
*****       SYSMOD          - LA00177                              ****
*****       JOBNAME         - SSUI177A                             ****
*****       TYPE            - ZAP/MOD                              ****
*****                                                              ****
*****       PRODUCT         - UCC-1 (TAPE MANAGEMENT SOFTWARE)     ****
*****                                                              ****
*****       LMOD            - EMODVOL1,OMODVOL1,IGC0024H,IGC0124H, ****
*****                         IGC0224H,IGC0324H,IGC0424H,IGC0524H, ****
*****                         IGC0524H,IGC0624H,IGC0724H,IGC0824H, ****
*****                         IGC0A24H,IGC0B24H,IGC0F24H,IGC0024I, ****
*****                         IGC0124I,IGC0224I,IGC0324I,IGC0424I, ****
*****                         IGC0524I,IGC0624I,IGG24900,TMSSVC    ****
*****                                                              ****
*****       MOD             - EMODVOL1,OMODVOL1,IGC0024H,IGC0124H, ****
*****                         IGC0224H,IGC0324H,IGC0424H,IGC0524H, ****
*****                         IGC0524H,IGC0624H,IGC0724H,IGC0824H, ****
*****                         IGC0A24H,IGC0B24H,IGC0F24H,IGC0024I, ****
*****                         IGC0124I,IGC0224I,IGC0324I,IGC0424I, ****
*****                         IGC0524I,IGC0624I,IGG24900,TMSSVC    ****
*****                                                              ****
*****       S/ZAP           - IFG0194F,IFG0196Q,IFG0195H,IFG0196N, ****
*****                         IFG0552B,IFG0553F,IFG0552V,IFG0551T, ****
*****                         IFG0200Y                             ****
*****                                                              ****
*****                                                              ****
*****       PROBLEM         - PROVIDE A TAPE MANAGEMENT SYSTEM     ****
*****                         TO INSURE THE SECURITY AND INTEGRITY ****
*****                         OF ALL GTEDS TAPE VOLUMES.           ****
*****                                                              ****
*****       PURPOSE/        - THIS MODIFICATION PROVIDES SERVICES  ****
*****       ENHANCEMENT       OF UCC-ONE TAPE MANAGEMENT SYSTEM    ****
*****                         TO MANAGE THE TAPE LIBRARY AT GTEDS  ****
*****                         MARINA DEL REY.                      ****
*****                                                              ****
***********************************************************************
     */.
++ VER (Z038)  FMID (EDM1102)  PRE (UZ22277 UZ32594 UZ32787 UZ37061
                                    UZ53371 UZ56648 UZ60202).
++JCLIN.
//SYSGEN01 JOB  'SYSTEM GENERATION',MSGLEVEL=(1,1)
//SG21     EXEC PGM=IEBCOPY
//LOCLLOAD DD   DSNAME=SYST.LOCLMODS.LOAD,DISP=SHR
//LPALIB   DD   DSNAME=SYS1.LPALIB,DISP=SHR
//SYSUT3   DD   UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSUT4   DD   UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSPRINT DD   SYSOUT=*
//SYSIN    DD   *
  COPY     OUTDD=LPALIB,INDD=LOCLLOAD
  SELECT MEMBER=((EMODVOL1,,R)) UCC-ONE MODULE
  SELECT MEMBER=((OMODVOL1,,R)) UCC-ONE MODULE
  SELECT MEMBER=((IGC0024H,,R)) UCC-ONE SVC XXX (248)
  SELECT MEMBER=((IGC0124H,,R)) UCC-ONE SVC XXX (248)
  SELECT MEMBER=((IGC0224H,,R)) UCC-ONE SVC XXX (248)
  SELECT MEMBER=((IGC0324H,,R)) UCC-ONE SVC XXX (248)
  SELECT MEMBER=((IGC0424H,,R)) UCC-ONE SVC XXX (248)
  SELECT MEMBER=((IGC0524H,,R)) UCC-ONE SVC XXX (248)
  SELECT MEMBER=((IGC0624H,,R)) UCC-ONE SVC XXX (248)
  SELECT MEMBER=((IGC0724H,,R)) UCC-ONE SVC XXX (248)
  SELECT MEMBER=((IGC0824H,,R)) UCC-ONE SVC XXX (248)
  SELECT MEMBER=((IGC0A24H,,R)) UCC-ONE SVC XXX (248)
  SELECT MEMBER=((IGC0B24H,,R)) UCC-ONE SVC XXX (248)
  SELECT MEMBER=((IGC0F24H,,R)) UCC-ONE SVC XXX (248)
  SELECT MEMBER=((IGC0024I,,R)) UCC-ONE SVC YYY (249)
  SELECT MEMBER=((IGC0124I,,R)) UCC-ONE SVC YYY (249)
  SELECT MEMBER=((IGC0224I,,R)) UCC-ONE SVC YYY (249)
  SELECT MEMBER=((IGC0324I,,R)) UCC-ONE SVC YYY (249)
  SELECT MEMBER=((IGC0424I,,R)) UCC-ONE SVC YYY (249)
  SELECT MEMBER=((IGC0524I,,R)) UCC-ONE SVC YYY (249)
  SELECT MEMBER=((IGC0624I,,R)) UCC-ONE SVC YYY (249)
  SELECT MEMBER=((IGG24900,,R)) UCC-ONE RESIDENT TABLE
  SELECT MEMBER=((TMSSVC,,R))   UCC-ONE RESIDENT SVC INTERFACE
++MOD(EMODVOL1) LKLIB(LOCLLOAD) LEPARM(RENT,REUS) DISTLIB(LOCLLOAD).
++MOD(OMODVOL1) LKLIB(LOCLLOAD) LEPARM(RENT,REUS) DISTLIB(LOCLLOAD).
++MOD(IGC0024H) LKLIB(LOCLLOAD) LEPARM(RENT,REUS) DISTLIB(LOCLLOAD).
++MOD(IGC0124H) LKLIB(LOCLLOAD) LEPARM(RENT,REUS) DISTLIB(LOCLLOAD).
++MOD(IGC0224H) LKLIB(LOCLLOAD) LEPARM(RENT,REUS) DISTLIB(LOCLLOAD).
++MOD(IGC0324H) LKLIB(LOCLLOAD) LEPARM(RENT,REUS) DISTLIB(LOCLLOAD).
++MOD(IGC0424H) LKLIB(LOCLLOAD) LEPARM(RENT,REUS) DISTLIB(LOCLLOAD).
++MOD(IGC0524H) LKLIB(LOCLLOAD) LEPARM(RENT,REUS) DISTLIB(LOCLLOAD).
++MOD(IGC0624H) LKLIB(LOCLLOAD) LEPARM(RENT,REUS) DISTLIB(LOCLLOAD).
++MOD(IGC0724H) LKLIB(LOCLLOAD) LEPARM(RENT,REUS) DISTLIB(LOCLLOAD).
++MOD(IGC0824H) LKLIB(LOCLLOAD) LEPARM(RENT,REUS) DISTLIB(LOCLLOAD).
++MOD(IGC0A24H) LKLIB(LOCLLOAD) LEPARM(RENT,REUS) DISTLIB(LOCLLOAD).
++MOD(IGC0B24H) LKLIB(LOCLLOAD) LEPARM(RENT,REUS) DISTLIB(LOCLLOAD).
++MOD(IGC0F24H) LKLIB(LOCLLOAD) LEPARM(RENT,REUS) DISTLIB(LOCLLOAD).
++MOD(IGC0024I) LKLIB(LOCLLOAD) LEPARM(RENT,REUS) DISTLIB(LOCLLOAD).
++MOD(IGC0124I) LKLIB(LOCLLOAD) LEPARM(RENT,REUS) DISTLIB(LOCLLOAD).
++MOD(IGC0224I) LKLIB(LOCLLOAD) LEPARM(RENT,REUS) DISTLIB(LOCLLOAD).
++MOD(IGC0324I) LKLIB(LOCLLOAD) LEPARM(RENT,REUS) DISTLIB(LOCLLOAD).
++MOD(IGC0424I) LKLIB(LOCLLOAD) LEPARM(RENT,REUS) DISTLIB(LOCLLOAD).
++MOD(IGC0524I) LKLIB(LOCLLOAD) LEPARM(RENT,REUS) DISTLIB(LOCLLOAD).
++MOD(IGC0624I) LKLIB(LOCLLOAD) LEPARM(RENT,REUS) DISTLIB(LOCLLOAD).
++MOD(IGG24900) LKLIB(LOCLLOAD) LEPARM(RENT,REUS) DISTLIB(LOCLLOAD).
++MOD(TMSSVC)   LKLIB(LOCLLOAD) LEPARM(RENT,REUS) DISTLIB(LOCLLOAD).
++ ZAP (IFG0194F) .
         NAME IFG0194A IFG0194F                                   40404
         VER  04AC 910140B1,471034F2                              40404
         VER  09F6 D501A01A3EDB,47203A4A                          40404
         VER  0E38 D20441CA3F81,920441CF                          40404
         VER  0FD8 0000,00000000,00000000,00000000,00000000       40404
         REP  04AC 910140B1,470034F2                              40404
         REP  09F6 1BFF,47F03FD6,47000000                         40404
         REP  0FD8 0AF8,47FF3FD8,47F03A4A,47F039FE,47F03E36       40404
         IDRDATA LA17716
++ ZAP (IFG0196Q) .
         NAME IGC0001I IFG0196Q
         VER 0020 F23441E04030,58B00010,D503B03841E0,47B03094
         VER 008E 4100000D
         REP 0020 41F00004,0AF8,47FF3024,47F03094,47F0308C,0700
         IDRDATA LA17716
++ ZAP (IFG0195H) .
         NAME IGC0001I IFG0195H                                   40369
         VER  0240 91037000,47E0333C,D20541C8402F                 40369
         VER  024E 45E03292,47F0333C,F224417D4030                 40369
         REP  0240 41F00008,0AF8,47FF3244,47F0333C                40369
         REP  024E D20541C8402F,45E03292,47F0333C                 40369
         IDRDATA LA17716
++ ZAP (IFG0552B) .
         NAME IGC0005E IFG0552B                                   40295
         VER 027A F23441E04030,58100010,D503103841E0,47B032E4     40295
         VER 01A4 47F032E4                                        40295
         VER 02DE 4100006C                                        40295
         REP 027A 41F00010,0AF8,47FF327E,47F032E4,47F032DC,0700   40295
         REP 01A4 47F03278                                        40295
         IDRDATA LA17716
++ ZAP (IFG0196N) .
         NAME IGC0001I IFG0196N                                   40316
         VER  00A2 D5013302A018,474030B8                          40316
         VER  02C4 1700,43004190                                  40316
         VER  0352 0000,00000000,00000000,00000000,00000000,00000000  6
         REP  00A2 47F03350                                       40316
         REP  0352 41F00014,0AF8,47FF3356,47F030AA,47F032C2,47F030B8
         IDRDATA LA17716
++ ZAP (IFG0553F) .
         NAME IGC0005E IFG0553F                                   40384
         VER  0518 9180202A,47E03526,910C202B,47803538            40384
         REP  0518 41F0001C,0AF8,47FF351C,47F03538,0700           40384
         IDRDATA LA17716
++ ZAP (IFG0552V) .
         NAME IGC0005E IFG0552V
         VER 0012 9180202A,47803020,910C202B,47803026
         REP 0012 41F0003C,0700,0AF8,47FF3018,47F03026
         IDRDATA LA17716
++ ZAP (IFG0551T) .
         NAME IGC0005E IFG0551T
         VER 00CA 9180202A,478030D8,910C202B,478030DE,D703200C200C
         REP 00CA 41F00040,0AF8,47FF30CE,47F030DE,0700
         IDRDATA LA17716
++ ZAP (IFG0200Y) .
         NAME IGC00020 IFG0200Y                                   40385
         VER 01F4 9180A012,47103224,41F03519                      40385
         VER 0226 9140A006,47E0323C                               40385
         VER 0570 00000000,0000,00000000                          40385
         REP 01F4 9180A012,4710356E                               40385
         REP 0570 41F00044,0AF8,47F03224                          40385
         IDRDATA LA17716
$$
//
./       ADD   NAME=LA00195A
//SSUD195A JOB (M,AJNJ,S610C021),04542HMD,CLASS=A,NOTIFY=SSUD,
//   MSGCLASS=O,TYPRUN=HOLD
//*ACCT        HOWARD DEAN,SSU
/*ROUTE  PRINT U90
/*JOBPARM L=999,S=*
//***
//***                  WARNING! WARNING! WARNING!
//***  DO NOT RENUMBER THIS MEMBER. IT CONTAINS MACRO UPDATES THAT
//***  ARE SEQUENCE DEPENDENT. THE MOD WILL BE RUINED IF RENUMBERED.
//***  IF YOU MUST USE SPF, THEN BE SURE THAT 'AUTONUM' IS OFF AND
//***  'NUMBER' IS OFF BEFORE MAKING CHANGES OR SAVING THIS MEMBER.
//***
//***    SYS PROG: HOWARD M. DEAN
//***    DATE:     04/09/83
//***    LOCATION: SYST.LOCLMODS.CNTL(LA00195A)
//***    DESC:     ACF2 MACRO UPDATES AND USER EXITS.
//***              TAILOR THE ACF2 SYSTEM TO GTE SPECIFICATIONS.
//***
//***              THE FOLLOWING ARE IMPLEMENTED AS MACRO UPDATES:
//***
//***              ACF$TWX  -  TELETYPE SUPPORT MODULE
//***              ACFCFDE  -  ACF FIELD DEFINITION ENTRY
//***              ACFFDR   -  ACF FIELD DEFINITION RECORD
//***              ACF2U1   -  ADD COPY STATEMENT FOR GTEU1J2
//***              USERCFDE -  GTE ADDITIONS TO CFDE
//***              USERLID  -  GTE USER LIDREC FIELDS
//***
//***              THE FOLLOWING ARE IMPLEMENTED AS SRC REPLACEMENTS:
//***
//***              GTEVIOXT -  GTE ACCESS VIOLATION EXIT
//***              GTEVLDXT -  GTE DATASET VALIDATION EXIT
//***              GTENPXIT -  GTE NEW PASSWORD EXIT
//***              GTEU1J2  -  GTE USER CODE TO JES2 USER EXIT
//***              GTEXPXIT -  GTE EXPIRED PASSWORD EXIT
//***
//***
//***                  WARNING! WARNING! WARNING!
//***  DO NOT RENUMBER THIS MEMBER. IT CONTAINS MACRO UPDATES THAT
//***  ARE SEQUENCE DEPENDENT. THE MOD WILL BE RUINED IF RENUMBERED.
//***  IF YOU MUST USE SPF, THEN BE SURE THAT 'AUTONUM' IS OFF AND
//***  'NUMBER' IS OFF BEFORE MAKING CHANGES OR SAVING THIS MEMBER.
//***
//SMP      EXEC PUTSMP,REGION=3700K,OPT=200
//SMPCNTL  DD *
   RECEIVE S(LA00195).
   APPLY   S(LA00195) DIS(WRITE).
//SMPPTFIN DD DATA,DLM=$$
++ USERMOD(LA00195)       /*  ACF2 PARAMETERS AND USER EXITS
     *****************************************************************
     *                                                               *
     *       GTEDS: MARINA DEL REY, CALIFORNIA                       *
     *                                                               *
     *       DATE:  04/09/83  BY: H.M. DEAN                          *
     *                                                               *
     *       RELEASE         - OS/MVS 3.8                            *
     *       ENVIRONMENT     - 16MB IBM 3033, 16MB AMDAHL V8         *
     *                       - 24MB IBM 3081                         *
     *                                                               *
     *       PTF LEVEL       - ACF 3.1.3 FLASH 8302 (FMID ACF3100)   *
     *                                                               *
     *       USERMOD         - LA00195                               *
     *       JOBNAME         - SSUD195A                              *
     *       TYPE            - MACUPD/SRC                            *
     *                                                               *
     *       PRODUCT         - ACCESS CONTROL FACILITY II (ACF2)     *
     *                                                               *
     *       LMOD            - ACFFDR, GTEVIOXT, GTEVLDXT, GTENPXIT  *
     *                         GTEXPXIT, ACF2U1J2                    *
     *                                                               *
     *       MOD (CSECT)     - GTEVIOXT,GTEVLDXT,GTENPXIT,GTEXPXIT,  *
     *                         ACF2U1J2                              *
     *                                                               *
     *       SRC             - GTEVIOXT,GTEVLDXT,GTENPXIT,GTEXPXIT   *
     *                                                               *
     *       MAC             - GTEU1J2                               *
     *                                                               *
     *       MACUPD          - ACFFDR, ACF$TWX, USERLID, ACF2U1,     *
     *                         ACFCFDE, USERCFDE                     *
     *                                                               *
     *       PROBLEM         - (1) ACCESS CONTROL FACILITY REQUIRES  *
     *                             PARAMETER MODULES THAT RESIDE IN  *
     *                             THE SYSTEM LINK PACK AREA OR THAT *
     *                             HAVE HOOKS IN MVS SYSTEM CODE.    *
     *                                                               *
     *                         (2) GTC AND GTEDS REQUIRE THAT        *
     *                             STANDARD ACF2 PROCESSING BE       *
     *                             ALTERED VIA EXITS TO MEET         *
     *                             INSTALLATION REQUIREMENTS.        *
     *                                                               *
     *       ENHANCEMENT     - (1) PARAMETER SOURCE IS UPDATED VIA   *
     *                             SMP SO THEIR ALTERATION AND       *
     *                             WHEREABOUTS CAN BE MONITORED.     *
     *                                                               *
     *                         (2) EXITS ARE INSTALLED VIA SMP       *
     *                             SO THEY WILL NOT BE LOST WHEN     *
     *                             NEW VERSIONS OF MVS OR ACF2 ARE   *
     *                             INSTALLED. SOURCE FOR EXITS IS IN *
     *                             LOCAL MOD DATASET. SEE SOURCE     *
     *                             FOR PURPOSE AND LOGIC OF EXITS.   *
     *****************************************************************
     */.
++ VER (Z038) FMID(ACF3100) PRE(TS63131,TS63132,TR75896).
++ JCLIN.
//SG2 EXEC ASMS,OBJ=OBJPDS03,MOD=ACFFDR,CLASS=A
//SYSIN DD *
      PRINT ON,GEN,NODATA
      COPY  ACFFDR
/*
//SG23      EXEC PGM=IEWL,
//  PARM='MAP,LIST,LET,XREF,RENT,LET'
//SYSPRINT  DD   SYSOUT=A
//SYSUT1    DD   UNIT=SYSDA,SPACE=(CYL,5)
//SYSLMOD   DD   DSN=SYS1.LPALIB,DISP=SHR
//ACFAMOD   DD   DSN=SYS1.ACFAMOD,DISP=SHR
//SYSLIN    DD   *
 INCLUDE ACFAMOD(ACFFDR)
 ALIAS   ACF2RLSE
 ALIAS   ACFDDLID
 NAME    ACFFDR(R)
 INCLUDE ACFAMOD(GTEVIOXT)
 ENTRY   GTEVIOXT
 NAME    GTEVIOXT(R)
 INCLUDE ACFAMOD(GTEVLDXT)
 ENTRY   GTEVLDXT
 NAME    GTEVLDXT(R)
 INCLUDE ACFAMOD(GTENPXIT)
 ENTRY   GTENPXIT
 NAME    GTENPXIT(R)
 INCLUDE ACFAMOD(GTEXPXIT)
 ENTRY   GTEXPXIT
 NAME    GTEXPXIT(R)
++SRC (GTEVIOXT) DISTLIB(ACFAMAC) SYSLIB(ACFMAC) TXLIB(LOCLCNTL).
++SRC (GTEVLDXT) DISTLIB(ACFAMAC) SYSLIB(ACFMAC) TXLIB(LOCLCNTL).
++SRC (GTENPXIT) DISTLIB(ACFAMAC) SYSLIB(ACFMAC) TXLIB(LOCLCNTL).
++SRC (GTEXPXIT) DISTLIB(ACFAMAC) SYSLIB(ACFMAC) TXLIB(LOCLCNTL).
++MAC (GTEU1J2)  DISTLIB(ACFAMAC) SYSLIB(ACFMAC) TXLIB(LOCLCNTL).
++MACUPD(ACF2U1) DISTLIB(ACFAMAC) SYSLIB(ACFMAC) ASSEM(ACF2U1J2).
./ CHANGE NAME=ACF2U1
         COPY GTEU1J2               INSERT GTE USER CODE       LA00195
./ ENDUP
++MACUPD(USERLID)  DISTLIB(ACFAMAC) SYSLIB(ACFMAC).
./ CHANGE NAME=USERLID
GTECOMP   DS   CL1       GTE COMPANY IDENTIFIER                LA00195
GTEDEPT   DS   CL2       GTE DEPT    IDENTIFIER                LA00195
GTEPROJ   DS   CL2       GTE PROJECT IDENTIFIER                LA00195
GTEGROUP  DS   CL2       GTE GROUP   IDENTIFIER                LA00195
GTELEVEL  DS   CL1       GTE LEVEL   IDENTIFIER                LA00195
./ ENDUP
++MACUPD(ACFCFDE)  DISTLIB(ACFAMAC) SYSLIB(ACFMAC).
./ CHANGE NAME=ACFCFDE                                         LA00195
   @CFDE  DFT-DEST,LIDTDRMT,CHAR,LIST=ALL,FLAGS=NULL+LIMIT,    LA00195 X
               ALTER=ALL-AUDIT,PRTN=1,RRTN=1,GROUP=5           LA00195
   @CFDE  DUMPAUTH,LIDMFLG,BIT,                                LA00195 X
               ALTER=SECURITY+ACCOUNT+CONSULT+LEADER,          LA00195 X
               LIST=ALL,                                       LA00195 X
               FLAGS=NULL+RESTRICT,BITMAP=LIDMRDMP,PRTN=3,     LA00195 X
               RRTN=3,GROUP=2                                  LA00195
   @CFDE  PREFIX,LIDPFX,CHAR,ALTER=ALL-AUDIT,LIST=ALL,         LA00195 X
./ ENDUP                                                       LA00195
++MACUPD(USERCFDE)  DISTLIB(ACFAMAC) SYSLIB(ACFMAC).
./ CHANGE NAME=USERCFDE                                        LA00195
   @CFDE  COMPANY,GTECOMP,CHAR,ALTER=SECURITY+ACCOUNT,         LA00195 X
               LIST=ALL,PRTN=1,RRTN=1,FLAGS=LIMIT              LA00195
   @CFDE  DEPT,GTEDEPT,CHAR,ALTER=SECURITY+ACCOUNT,            LA00195 X
               LIST=ALL,PRTN=1,RRTN=1,FLAGS=LIMIT              LA00195
   @CFDE  PROJECT,GTEPROJ,CHAR,ALTER=SECURITY+ACCOUNT,         LA00195 X
               LIST=ALL,PRTN=1,RRTN=1,FLAGS=LIMIT              LA00195
   @CFDE  GROUPID,GTEGROUP,CHAR,ALTER=SECURITY+ACCOUNT,        LA00195 X
               LIST=ALL,PRTN=1,RRTN=1,FLAGS=LIMIT              LA00195
   @CFDE  EMPLEVEL,GTELEVEL,CHAR,ALTER=SECURITY+ACCOUNT,       LA00195 X
               LIST=ALL,PRTN=1,RRTN=1,FLAGS=LIMIT              LA00195
./ ENDUP                                                       LA00195
++MACUPD(ACFFDR) DISTLIB(ACFAMAC) SYSLIB(ACFMAC) ASSEM(ACFFDR).
./ CHANGE NAME=ACFFDR                                          LA00195
FDR      TITLE 'FIELD DEFINITION RECORD - HOWARD M. DEAN'      LA00195
               STRING='S ACFBKUP', *** SVC 34 COMMAND TEXT *** LA00195 X
               CPUID=2BBB          *** SMF CPUID OF BACKUP CPU LA00195
         @BLPPGM PGM=TAPESCAN,LIB=SYS1.LINKLIB                 LA00195
         @BLPPGM PGM=TAPECOPY,LIB=SYS1.LINKLIB                 LA00195
         @BLPPGM PGM=TAPEMAP,LIB=SYS1.LINKLIB                  LA00195
         @BLPPGM PGM=COPYTAPE,LIB=SYS1.LINKLIB                 LA00195
         @BLPPGM PGM=COMPTAPE,LIB=SYS1.LINKLIB                 LA00195
         @BLPPGM PGM=OSTAP,LIB=SYS1.LINKLIB                    LA00195
         @BLPPGM PGM=MVTDEBE,LIB=SYS1.LINKLIB                  LA00195
         @BLPPGM PGM=SPARE01,LIB=SYS1.LINKLIB    DEFINE SPARE  LA00195
         @BLPPGM PGM=SPARE02,LIB=SYS1.LINKLIB    DEFINE SPARE  LA00195
         @BLPPGM PGM=SPARE03,LIB=SYS1.LINKLIB    DEFINE SPARE  LA00195
               RULE='ACF2.RULES',        ** RULES CLUSTER      LA00195 X
               LID='ACF2.LOGONIDS',      ** LOGONID CLUSTER    LA00195 X
               INFO='ACF2.INFOSTG',      ** GEN RESOURCE CLUS  LA00195 X
               BRULE='ACF2.BKRULES',     ** RULES BACKUP DS    LA00195 X
               BLID='ACF2.BKLIDS',       ** LOGONIDS BACKUP DS LA00195 X
               BINFO='ACF2.BKINFO'       ** RESOURCE BACKUP DS LA00195
               RULE='ACF2ALT.RULES',     ** ALT RULES CLUS     LA00195 X
               LID='ACF2ALT.LOGONIDS',   ** ALT LOGONID CLUS   LA00195 X
               INFO='ACF2ALT.INFOSTG',   ** ALT RESOURCE CLUS  LA00195 X
               BRULE='ACF2ALT.BKRULES',  ** ALT RULES BACKUP   LA00195 X
               BLID='ACF2ALT.BKLIDS',    ** ALT LOGONID BACKUP LA00195 X
               BINFO='ACF2ALT.BKINFO'    ** ALT RESRCE  BACKUP LA00195
               EXPPXIT=GTEXPXIT,   *** EXPIRED PASSWORD EXIT   LA00195 X
               NEWPXIT=GTENPXIT,   *** NEW PASSWORD VAL EXIT   LA00195 X
               VIOEXIT=GTEVIOXT,   *** DATASET VIOLATION EXIT  LA00195 X
               VLDEXIT=GTEVLDXT    *** DATASET PRE-VALID EXIT  LA00195
         @LOGPGM AMASPZAP,IMASPZAP,INCORZAP,LINKZAP            LA00195
*        THIS LINE DELETED BY USERMOD ------------------------ LA00195
*        THIS LINE DELETED BY USERMOD ------------------------ LA00195
*        THIS LINE DELETED BY USERMOD ------------------------ LA00195
*        THIS LINE DELETED BY USERMOD ------------------------ LA00195
*        THIS LINE DELETED BY USERMOD ------------------------ LA00195
*        THIS LINE DELETED BY USERMOD ------------------------ LA00195
         @MAINT LID=HMDMAINT,LIB=SYS1.LINKLIB,PGM=IEBCOPY      LA00195
         @MAINT LID=HMDMAINT,LIB=SYS1.LINKLIB,PGM=IEHPROGM     LA00195
         @MAINT LID=HMDMAINT,LIB=SYS1.LINKLIB,PGM=ICKDSF       LA00195
         @MAINT LID=HMDMAINT,LIB=SYS1.LINKLIB,PGM=ADRDSSU      LA00195
         @MAINT LID=HMDMAINT,LIB=SYS1.LINKLIB,PGM=FDR          LA00195
         @MAINT LID=HMDMAINT,LIB=SYS1.LINKLIB,PGM=FDRDSF       LA00195
               CONSOLE=WTP,        *** CONSOLE MODE FOR MSGS   LA00195 X
               CPUTIME=GMT,        *** CPU TIME ZONE = GMT     LA00195 X
               DECOMP=ALL,         *** DECOMP PERMISSION       LA00195 X
               DFLTSTC=STCID,      *** DEFAULT STC LOGONID     LA00195 X
               DFTLID=DFLTID,      *** DEFAULT BATCH LOGONID   LA00195 X
               MAXVIO=19,          *** MAX VIOLATIONS IN 1 JOB LA00195 X
               MODE=WARN,   11/82  *** GLOBAL ACF2 OPER MODE   LA00195 X
               STC=YES,            *** SYSTEM TASKS MONITOR    LA00195 X
               TAPEDSN=YES,        *** TAPES PROT AT DSN LEVEL LA00195 X
               UADS=YES,           *** UADS DATASET BEING USED LA00195 X
**       THIS CARD DELETED BY USERMOD -----------------------  LA00195
**       @PPGM IEHD****,FDR***,DRWD****,ICKDSF**,ADRDSSU       LA00195
         @PSWD MAXTRY=10,   *** MAX RETRIES FOR PSWD PER LOGON LA00195 X
               PASSLMT=19,  *** MAX PSWD ATTEMPTS IN ONE DAY   LA00195 X
               PSWDALT=YES, *** PSWD ALTER AT ENTRY TIME       LA00195 X
               PSWDFRC=YES, *** USER MUST ALTER ASSIGNED PSWD  LA00195 X
               WRNDAYS=10,  *** WARN X DAYS BEFORE EXPIRATION  LA00195 X
         @RESVOLS CKPT**,IMVS**,PG***,PS50**                   LA00195
         @RESVOLS PAK***,PACK**,ITST**                         LA00195
         @RESVOLS SP****,SWP***,SYSL**,VSM***                  LA00195
         @RESVOLS 0*****,1*****,2*****                         LA00195
         @RESVOLS 3*****,4*****,5*****                         LA00195
         @RESVOLS 6*****,7*****,8*****,9*****                  LA00195
         @SMF  PSWD=130,     *** INVALID PASSWORD/AUTHORITY    LA00195 X
               DSN=131,      *** DSN AND PROG VIO/LOG/TRACE    LA00195 X
               LID=132,      *** LOGONID MODIFICAITON JOURNAL  LA00195 X
               RULE=133,     *** ACCESS RULE MOD JOURNAL       LA00195 X
               JTRACE=134,   *** RESTRICTED LOGONID JOB LOG    LA00195 X
               COMMAND=135,  *** TSO COMMAND RECORDS           LA00195 X
               INFO=136,     *** INFO STG MODIFICATION JOURNAL LA00195 X
               RSRC=137,     *** RESOURCE VIO/LOG/TRACE        LA00195 X
         @TSO  ACCOUNT='DUMMY',    ***    DEFAULT TSO ACCOUNT  LA00195 X
               PERFORM=2,     *** PERFORM GROUP OR DEFAULT USE LA00195 X
               PROC=$$STDTSO,  *** DEFAULT TSO PROCEDURE NAME  LA00195 X
               REGION=3968,   *** DEFAULT REGION SIZE          LA00195 X
               SUBCLSS=B,     *** DEFAULT JOB SUBMIT CLASS     LA00195 X
               SUBHOLD=Q,     *** DEFAULT SYSOUT HOLD CALSS    LA00195 X
               SUBMSGC=A,     *** DEFAULT SUBMIT MSG CLASS     LA00195 X
               TIME=1439,     *** TIME DEFAULT(LOGONXIT ADDS)  LA00195 X
               TSOSOUT=A,     *** DEFAULT TSO SYSOUT CLASS     LA00195 X
               WAITIME=60     *** CHECK LOGON WAITTIME         LA00195
         @UID  COMPANY,DEPT,PROJECT,GROUPID,EMPLEVEL,LID       LA00195
         @WARN 'ACF999I WARNING! THIS RESOURCE ACCESS WILL SOON BE DENIX
               ED BY SECURITY MANAGEMENT'                      LA00195
./ ENDUP                                                       LA00195
++MACUPD (ACF$TWX) ASSEM(ACF$TWX) DISTLIB(ACFAMAC) SYSLIB(ACFMAC).
./ CHANGE NAME=ACF$TWX
$TWX     TITLE 'ACF2 - TWX TERMINAL X-OUT STRING MODULE'       LA00195
***************************************************************LA00195*
* PROGRAMMED    BY HOWARD M. DEAN 01/20/81                     LA00195*
* UPDATED       BY HOWARD M. DEAN 11/09/82                     LA00195*
* UPDATED       BY HOWARD M. DEAN 04/09/83 - ACF313 RETROFIT   LA00195*
***************************************************************LA00195*
         USING  ACF$TWX,0            ACF TWX X-OUT MODULE      LA00195
*                                                              LA00195
* THIS MODULE DEFINES AN INSTALLATION STRING TO USE FOR THE    LA00195
* X-OUT STRING ON ASCII TWX TERMINALS. IT REPLACES THE ACF2    LA00195
* DEFAULT STRING. PROGRAMMED FOR GTEDS LA BY HOWARD M. DEAN    LA00195
* ON JANUARY 12, 1981.                                         LA00195
*                                                              LA00195
LENGTH   DC     A(END-START)    LENGTH OF STRING               LA00195
START    DS     0C                                             LA00195
         DC     X'E7E7E7E7E7E7E7E7'    XXXXXXXX                LA00195
         DC     X'0D17171717171717'    1 RHO CR, 7 RHO IDLE    LA00195
         DC     X'D5D5D5D5D5D5D5D5'    MMMMMMMM                LA00195
         DC     X'0D17171717171717'    1 RHO CR, 7 RHO IDLE    LA00195
         DC     X'E9E9E9E9E9E9E9E9'    ZZZZZZZZ                LA00195
         DC     X'0D17171717171717'    1 RHO CR, 7 RHO IDLE    LA00195
         DC     X'D4D4D4D4D4D4D4D4'    NNNNNNNN                LA00195
         DC     X'0D17'                1 RHO CR                LA00195
END      DS     0C                                             LA00195
         END    ,                                              LA00195
./ ENDUP
$$
//
./       ADD   NAME=LA00196A
//SSUD196A JOB (M,AJNJ,S610C021),04542HMD,CLASS=K,NOTIFY=SSUD,
//   MSGCLASS=O,TYPRUN=HOLD
//*ACCT        HOWARD DEAN,SSU
/*ROUTE  PRINT U90
/*JOBPARM L=999,S=*
//***
//***    SYS PROG: HOWARD M. DEAN
//***    DATE:     04/13/83
//***    LOCATION: SYST.LOCLMODS.CNTL(LA00196A)
//***    DESC:     SYSGEN SUPPORT FOR AMDPSCAN PRINT DUMP EXIT
//***
//***          WARNING!! WARNING!! WARNING!! WARNING!!
//***          WARNING!! WARNING!! WARNING!! WARNING!!
//***
//***          DO NOT RENUMBER THIS DATA SET.
//***
//***          IT CONTAINS SOURCE UPDATE TEXT THAT MAY
//***          BE RUINED IF RENUMBERED.
//***
//***
//***
//SMP      EXEC PUTSMP,OPT=200
//SMPCNTL  DD *
   RECEIVE S(LA00196).
   APPLY   S(LA00196) DIS(WRITE).
//SMPPTFIN DD DATA,DLM=$$
++ USERMOD (LA00196) /* AMDPSCAN SYSGEN SUPPORT
     *****************************************************************
     *                                                               *
     *       GTEDS: MARINA DEL REY, CALIFORNIA                       *
     *                                                               *
     *       DATE:  04/13/83  BY: H.M. DEAN                          *
     *                                                               *
     *                                                               *
     *                                                               *
     *       RELEASE         - OS/MVS 3.8                            *
     *       ENVIRONMENT     - 12MB IBM 3033, 12MB AMDAHL V8          *
     *                       - 24MB IBM 3081                          *
     *                                                               *
     *       PTF LEVEL       - 8301  (FMID JBB1326)                  *
     *                                                               *
     *       USERMOD         - LA00196                               *
     *       JOBNAME         - SSUD196A                              *
     *       TYPE            - MACUPD                                *
     *                                                               *
     *       PRODUCT         - MVS/SP 1.3 SYSGEN                     *
     *       MAC             - SGAMA401                              *
     *                                                               *
     *       PROBLEM         - IBM'S AMDPSCAN PRINT DUMP EXIT        *
     *                         DOES NOT HAVE SYSGEN SUPPORT          *
     *                         AND WILL BE LOST DURING A FULLGEN.    *
     *                                                               *
     *                                                               *
     *       SOLUTION        - UPDATE SYSGEN MACRO SGAMA401 TO       *
     *                         LINK AMDPSCAN DURING A FULLGEN.       *
     *                                                               *
     *                                                               *
     *                                                               *
     *****************************************************************
     */.
++ VER (Z038) FMID(JBB1326) PRE(UZ90173).
++ MACUPD (SGAMA401) DISTLIB(AGENLIB).
./ CHANGE NAME=SGAMA401,LIST=ALL                                LA00196
&SGCTRLC(9)  SETC  'LPALIB'          SET TARGET LIBRARY NAME    LA00196
&SGCTRLC(10) SETC  ',RENT'           SET LKED PARAMETER         LA00196
          COPY  SGLEDPK1             PUNCH JCL STATEMENTS       LA00196
 PUNCH '//AOS12 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.AOS12' LA00196
          COPY  SGLEDPK2                                        LA00196
 PUNCH ' INCLUDE AOS12(AMDPSCAN)'                               LA00196
 PUNCH ' INCLUDE AOS12(AMDPSALZ)'                               LA00196
 PUNCH ' INCLUDE AOS12(AMDPSERT)'                               LA00196
 PUNCH ' INCLUDE AOS12(AMDPSMSG)'                               LA00196
 PUNCH ' INCLUDE AOS12(AMDPSQC1)'                               LA00196
 PUNCH ' INCLUDE AOS12(AMDPSQC3)'                               LA00196
 PUNCH ' INCLUDE AOS12(AMDPSMTT)'                               LA00196
 PUNCH ' INCLUDE AOS12(AMDPSSTT)'                               LA00196
 PUNCH ' INCLUDE AOS12(AMDPSLK1)'                               LA00196
 PUNCH ' INCLUDE AOS12(AMDPSLK3)'                               LA00196
 PUNCH ' INCLUDE AOS12(AMDPSPAG)'                               LA00196
 PUNCH ' INCLUDE AOS12(AMDPSTAT)'                               LA00196
 PUNCH ' INCLUDE AOS12(AMDPSUCB)'                               LA00196
 PUNCH ' INCLUDE AOS12(AMDPSVSM)'                               LA00196
 PUNCH ' INCLUDE AOS12(AMDPSSRM)'                               LA00196
 PUNCH ' INCLUDE AOS12(AMDPSLOP)'                               LA00196
 PUNCH ' INCLUDE AOS12(AMDPSOPS)'                               LA00196
 PUNCH ' INCLUDE AOS12(AMDPSBCP)'                               LA00196
 PUNCH ' INCLUDE AOS12(AMDPSBSI)'                               LA00196
 PUNCH ' INCLUDE AOS12(AMDPSFRN)'                               LA00196
 PUNCH ' INCLUDE AOS12(AMDPSGBF)'                               LA00196
 PUNCH ' INCLUDE AOS12(AMDPSIA1)'                               LA00196
 PUNCH ' INCLUDE AOS12(AMDPSPIN)'                               LA00196
 PUNCH ' INCLUDE AOS12(AMDPSPOT)'                               LA00196
 PUNCH ' INCLUDE AOS12(AMDPSRDR)'                               LA00196
 PUNCH ' INCLUDE AOS12(AMDPSWRR)'                               LA00196
 PUNCH ' INCLUDE AOS12(AMDPSXRA)'                               LA00196
 PUNCH ' INCLUDE AOS12(AMDPSXVR)'                               LA00196
 PUNCH ' ENTRY AMDPSCAN            IBM PRINT DUMP SCAN EXIT'    LA00196
 PUNCH ' NAME  AMDPSCAN(R)     '                                LA00196
 PUNCH '/*                     '                                LA00196
./  ENDUP                                                       LA00196
$$
//
./       ADD   NAME=LA00197A
//SSUD197A JOB (M,AJNJ,S610C021),04542HMD,CLASS=A,NOTIFY=SSUD,
//   MSGCLASS=O TYPRUN=HOLD
//*ACCT        HOWARD DEAN,SSU
/*ROUTE  PRINT U90
/*JOBPARM L=999,S=ANY
//***
//***    SYS PROG: HOWARD M. DEAN
//***    DATE:    04/13/83
//***    LOCATION: SYST.LOCLMODS.CNTL(LA00197A)
//***DESC:
//***              (1) MODIFY AMDPSCAN TO WORK ON A
//***                  DUMP CREATED BY ANY CPU MODEL.
//***
//***              (2) MODIFY AMDPSCAN TO ALWAYS TRACE
//***                  INSTRUCTIONS IN A DISABLED LOOP
//***                  SAD DUMP.
//***
//***
//SMP      EXEC PUTSMP,REGION=3700K,OPT=200
//SMPCNTL  DD *
   RECEIVE S(LA00197).
   APPLY   S(LA00197) DIS(WRITE).
//SMPPTFIN DD DATA,DLM=$$
++ USERMOD (LA00197) /* AMDPSCAN UPDATE LOCAL MODIFICATION
     *****************************************************************
     *                                                               *
     *       GTEDS: MARINA DEL REY, CALIFORNIA                       *
     *                                                               *
     *       DATE:  04/13/83  BY: H. M. DEAN                         *
     *                                                               *
     *                                                               *
     *                                                               *
     *       RELEASE         - OS/MVS 3.8                            *
     *       ENVIRONMENT     - 16MB IBM 3033, 16MB AMDAHL V8         *
     *                       - 24MB IBM 3081                         *
     *                                                               *
     *       PTF LEVEL       - 8301 (FMID ESC1326).                  *
     *                                                               *
     *       USERMOD         - LA00197                               *
     *       JOBNAME         - SSUD199A                              *
     *       TYPE            - ZAP                                   *
     *                                                               *
     *       PRODUCT         - AMDPSCAN (IBM PRINT DUMP EXIT)        *
     *       LMOD            - AMDPSCAN                              *
     *       MOD (CSECT)     - AMDPSCAN, AMDPSLOP                    *
     *                                                               *
     *       PROBLEM         - (1) AMDPSCAN ONLY WORKS ON IBM        *
     *                         CPU MODELS.                           *
     *                                                               *
     *                         (2) NEXT 5000 INSTRUCTIONS ARE NOT    *
     *                             AUTOMATICALLY PRINTED IN A        *
     *                             DISABLED LOOP SAD DUMP.           *
     *                                                               *
     *       ENHANCEMENT     - (1) CHANGE AMDSCAN TO BYPASS CPU      *
     *                             TYPE CHECK.                       *
     *                                                               *
     *                         (2) CHANGE NOOP TO UNCONDITIONAL      *
     *                             BRANCH TO TRACE NEXT 5000         *
     *                             INSTRUCTIONS IN A SAD DUMP WITH   *
     *                             DISABLED LOOP.                    *
     *****************************************************************
     */.
++ VER (Z038) FMID(ESC1326) PRE(US01080)
              /* AMDPSCAN + LATEST FIXES */.
++ ZAP (AMDPSCAN) DISTLIB(AOS12).
NAME AMDPSCAN
*
* THE FOLLOWING CHANGE WILL ALLOW AMDPSCAN TO
* WORK ON A DUMP CREATED BY ANY CPU MODEL, NOT
* JUST AN IBM PROCESSOR
*
*** HOWARD M. DEAN  04/13/83
*
VER 01B0 9102,D296
VER 01B4 4710,C1FC
REP 01B0 94FD,D296
REP 01B4 4700,C1FC
IDRDATA LA00197
*
++ ZAP (AMDPSLOP) DISTLIB(AOS12).
NAME AMDPSLOP
*
* THE FOLLOWING CHANGE WILL FORCE PRINTING
* OF THE 'NEXT' 5000 INSTRUCTIONS TO BE
* EXECUTED IN A STANDALONE DUMP
*
*** HOWARD M. DEAN  02/10/83
*
VER 094A 4700    --- TRACE SWITCH NOP
REP 094A 47F0    --- TRACE SWITCH UNCONDITONAL BRANCH
IDRDATA LA00197
$$
//
./       ADD   NAME=LA00198B
//SSUD198B JOB (T,AJNJ,S610C021),04542HMD,CLASS=A,NOTIFY=SSUD,
//    MSGCLASS=O
//*ACCT        HOWARD DEAN,SSU
/*ROUTE  PRINT U90
/*JOBPARM L=300,S=1AAA
//***
//***    SYS PROG: HOWARD DEAN
//***    DATE:     04/13/83
//***    LOCATION: SYST.LOCLMODS.CNTL(LA00198B)
//***    DESC:     AMDPRDMP GENERAL EXIT LOCAL MOD
//***
//***              AMDPRECT EXIT TABLE UPDATE  ZAP
//***
//***              THE FOLLOWING AMDPRDMP EXITS ARE
//***              CONTAINED HERIN:
//***
//***              RSMREL4  - FORMAT REAL STORAGE MGMT BLOCKS
//***              AMDPRCSA - FORMAT CSA REGION
//***              AMDPRMTR - FORMAT MASTER TRACE TABLE
//***
//SMP      EXEC PUTSMP,OPT=200
//SMPCNTL  DD *
   RECEIVE S(LA00198).
   APPLY   S(LA00198) DIS(WRITE).
//SMPPTFIN DD DATA,DLM=$$
++ USERMOD (LA00198) /*  AMDPRDMP USER EXIT LOCAL MOD
     *****************************************************************
     *                                                               *
     *       GTEDS: MARINA DEL REY, CALIFORNIA                       *
     *                                                               *
     *       DATE:  04/13/83   BY: H.M. DEAN                         *
     *                                                               *
     *       RELEASE         - OS/MVS 3.8  MVS/SP R1.0               *
     *       ENVIRONMENT     - 16MB IBM 3033, 16MB AMDAHL V8         *
     *                       - 24MB IBM 3081                         *
     *                                                               *
     *       PTF LEVEL       - 8301 (FMID JBB1326)                   *
     *                                                               *
     *       USERMOD         - LA00198                               *
     *       JOBNAME         - SSUD198B                              *
     *       TYPE            - MOD, ZAP                              *
     *                                                               *
     *       PRODUCT         - AMDPRDMP - PRINT DUMP ROUTINE         *
     *                                                               *
     *       LMOD            - RSMREL4,AMDPRCSA,AMDPRMTR             *
     *                                                               *
     *                                                               *
     *       MOD             - RSMREL4,AMDPRCSA,AMDPRMTR             *
     *                                                               *
     *                                                               *
     *       SZAP            - AMDPRECT (PRINT DUMP EXIT TABLE)      *
     *                                                               *
     *       PROBLEM         - PROVIDE USER FUNCTIONS TO PRINT       *
     *                         PARTS OF STORAGE DUMP UNAVAILABLE     *
     *                         FROM STANDARD IBM PRINT DUMP ROUTINES.*
     *                                                               *
     *                                                               *
     *       PURPOSE/        - ADD THE FOLLOWING USER EXITS:         *
     *       ENHANCEMENT                                             *
     *                         RSMREL4 -  PRINT REAL STORAGE MANAGER *
     *                         (RSMDATA)  CONTROL BLOCKS.            *
     *                                                               *
     *                         AMDPRCSA - PRINT CSA SUBPOOLS         *
     *                         (CSAMAP)                              *
     *                                                               *
     *                   **    AMDPRMTR - FORMAT MASTER TRACE TABLE  *
     *                         (MTRACE)                              *
     *                                                               *
     *                   **    NOTE: ALSO WILL BE CALLED WHEN        *
     *                               THE 'FORMAT' VERB IS SPECIFIED  *
     *                                                               *
     *****************************************************************
     */.
++VER (Z038) FMID(JBB1326) VERSION(EBB1102,JBB1126).
++IF  FMID(ESC1326) THEN REQ(LA00196,LA00197)
      /* AMDPSCAN + SYSGEN SUPPORT + USERMODS */.
++JCLIN.
//SYSGEN01      JOB 'SYSTEM-GENERATION',MSGLEVEL=1
//SG19  EXEC LINKS,
//   PARM='XREF,NCAL,LIST,LET',NAME=LINKLIB,OBJ=OBJPDS03
//AOS12   DD   DSN=SYS1.AOS12,DISP=SHR
//SYSIN   DD   *
 ENTRY   RSMREL4                * REAL STORAGE MANAGEMENT FORMAT
 INCLUDE AOS12(RSMREL4)
 NAME    RSMREL4(R)
 ENTRY   CSAMAP1                * COMMON STORAGE AREA FORMAT (CSA)
 INCLUDE AOS12(AMDPRCSA)
 NAME    AMDPRCSA(R)
 ENTRY   MTRACE                 * MASTER TRACE TABLE FORMAT
 INCLUDE AOS12(AMDPRMTR)
 NAME    AMDPRMTR(R)
++MOD (RSMREL4) TXLIB(LOCLLOAD) LEPARM (LIST,LET,NCAL,XREF) /*
                              RSM AMDPRDMP EXIT
     INTRODUCTION
         RSMDATA  IS AN  AMDPRDMP EXIT  FOR  FORMATTING REAL  STORAGE
         MANAGEMENT CONTROL BLOCKS. CURRENTLY  THERE ARE TWO VERSIONS
         AVAILABLE.
          1.  RSM833V1 FOR SU833
          2.  RSM850V1 FOR SU850
         THE FOLLOWING AREAS ARE FORMATTED BY RSMDATA.
          1.  GLOBAL AREAS AND QUEUES
              A.  PAGE VECTOR TABLE
              B.  PAGE FRAME TABLE
              C.  AVAILABLE PFTE QUEUE
              D.  COMMON QUEUE OF PFTE'S
              E.  SQA QUEUE OF PFTE'S
              F.  SQA RESERVED QUEUE OF PFTE'S
              G.  REAL STORAGE BUFFER QUEUE OF PFTE'S
              H.  RE-USABLE PCB
              I.  PCB FREE QUEUE (RUN BACKWARDS)
              J.  PCB DEFERRED QUEUE (RUN BACKWARDS)
              K.  PCB COMMON I/O QUEUE (RUN BACKWARDS)
          2.  LOCAL AREAS AND QUEUES
              A.  REAL STORAGE MANAGEMENT HEADER
              B.  SWAP CONTROL TABLE AND ANY EXTENSIONS
              C.  SWAP ROOT PCB
              D.  LOCAL QUEUE OF PFTE'S
              E.  LSQA QUEUE OF PFTE'S
              F.  PCB LOCAL I/O QUEUE (RUN BACKWARDS)
              NOTE: IF  A PCB ON EITHER  THE PCB DEFERRED  QUEUE, PCB
              COMMON I/O QUEUE,  OR PCB LOCAL I/O QUEUE  HAS EITHER A
              ROOT PCB OR RELATED PCB'S THEY WILL BE FORMATTED.
     INSTALLATION
          1.  RSMDATA IS  SUPPLIED IN  OBJECT FORM  AND MUST  BE LINK
              EDITED INTO SYS1.LINKLIB OR A USER LIBRARY.
              A.  LINK EDIT PARAMETERS
                      LIST,LET,NCAL,XREF
              B.  LINK EDIT CONTROL CARDS
                      ENTRY RSMR4121
                      NAME RSMREL4(R)
          2.  AMDPRDMP CONTROL  SECTION AMDPRECT  MUST BE  UPDATED TO
              ADD THE VERB RSMDATA.
              A.  SEE THE SERVICE AIDS  MANUAL (GC28-0674) APPENDIX C
                  FOR THE PROCEDURE TO SUPERZAP AMDPRECT.
              B.  THE DATA TO ADD TO AMDPRECT IS AS FOLLOWS.
                      REP OFFSET D9E2,D4D9,C5D3,F440,0000,0000,
                                     D9E2,D4C4,C1E3,C140
     USAGE
         TO INVOKE THE RSMDATA EXIT WHILE PRINTING A DUMP INCLUDE THE
         VERB RSMDATA IN THE CONTROL STATEMENTS FOR AMDPRDMP.
         IF THE RSM EXIT WAS LINK EDITED  ON A USER LIBRARY A STEPLIB
         DD CARD WILL BE NEEDED POINTING TO THE USER LIBRARY.
         BECAUSE RSMDATA  DOES NOT PRINT  THE SEGMENT TABLES  OR PAGE
         TABLES THE ASMDATA EXIT SHOULD ALSO BE USED.
   */.
++MOD (AMDPRCSA)  TXLIB(LOCLLOAD) LEPARM(LET,LIST,XREF,NCAL) /*
***********************************************************************
*                                                                     *
*  THIS MODULE IS INTENDED TO BE USED AS AN EXIT TO AMDPRDMP,         *
*  AND WILL OPERATE AS A VERB EXIT.  THE SELECTED VERB WILL           *
*  CAUSE THIS EXIT TO GET CONTROL, ONCE AN ENTRY IS ADDED             *
*  TO AMDPRECT.  THIS ROUTINE USES STANDARD PRINTDUMP LINKAGE         *
*  TO FORMAT AND PRINT CONTROL BLOCKS, PRINT MESSAGES, AND            *
*  TO ACCESS DUMPED DATA.  IT IS INTENDED TO BE USED TO               *
*  AID THE PSR IN DETERMINING A PROBLEM, WHEN EITHER CSA OR           *
*  SQA IS DEPLETED.  THE PROGRAM DOES NOT USE A GETMAINED             *
*  AREA FOR ITS' WORKAREA, SO IT IS NOT RE-ENTRANT, BUT THIS          *
*  SHOULD NOT PRESENT A PROBLEM, IF IT IS NOT PLACED IN LPA.          *
*  THE EXIT CHANGES SOME DATA IN THE WORKAREA, AFTER MOVING           *
*  THE DATA FROM PRINTDUMPS' BUFFER, FOR EASE OF FORMATTING.          *
*  (RATHER THAN FORMATTING FQE'S, THE ROUTINE COLLECTS DATA FROM      *
*  THE FQE, AND PRINTS INFORMATION CONCERNING ALLOCATED CORE.         *
*  THIS IS THE MAIN DIFFERENCE BETWEEN THIS VERSION OF THE PRO-       *
*  GRAM, AND THE EARLIER VERSION. )                                   *
*  WORKAREA LABELS MAY HAVE TO BE CHANGED, IF THE FOLLOWING MSS       *
*  CONTROL BLOCKS ARE CHANGED:                                        *
*                                                                     *
*               CVT, GDA, PQE, FBQE, SPQE, DQE, OR FQE.               *
*                                                                     *
*  THIS ROUTINE IS NOT FORMALLY SUPPORTED IN ANY WAY, BUT             *
*  I WOULD BE HAPPY TO ATTEMPT ANY CORRECTIONS, ON AN 'AS             *
*  AVAILABLE' BASIS.                                                  *
*                                                                     *
*        FRANK H. CONNERY, JR., REGION 9, T.A.G.                      *
*        (312) 245-7850   (IBM TIE LINE 8-261-7850)                   *
*        REGION 9, TECHNICAL SUPPORT GROUP  (F.E.)                    *
*        1 IBM PLAZA  (INTERNAL ZIP  38-528)                          *
*        CHICAGO, ILLINOIS   60611                                    *
*                                                                     *
***********************************************************************
    */.
++MOD (AMDPRMTR) TXLIB(LOCLLOAD) LEPARM(LIST,LET,XREF,NCAL) /*
* THIS PROGRAM WILL RUN AS AN EXIT TO PRINTDUMP. ITS'S FUNCTION IS TO
* FORMAT THE MASTER TRACE TABLE FOR AN SVC OR STANDALONE DUMP. IT WILL
* 1ST CHECK TO MAKE SURE THAT THE SYSTEM HAS SU64 INSTALLED AND THE
* MASTER TRACE IS ACTIVE. THE OUTPUT WILL BE IN 'REVERSE' ORDER DUE
* TO THE FACT THAT THE MASTER TRACE IS A BACKWARD WRAP-AROUND TABLE.
* TO IMPLEMENT THIS EXIT, IT MUST FIRST BE LINKED INTO EITHER
* LINKLIB OR A USER LIBRARY (USE STEPLIB ON PRINTDUMP IF SO), AND THE
* PRINTDUMP EXIT CONTROL TABLE ZAPPED TO INCLUDE THE EXIT NAME.
*
*        E.G.    NAME AMDPRECT
*                VER 00C8 4040404040404040,00000000,4040404040404040
*                REP 00C8 D4E3D9C1C3C54040,20000000,D4E3D9C1C3C54040
*
*                THE ABOVE ZAP WILL CAUSE THE EXIT TO BE ENTERED
*                WHENEVER THE FORMAT OPTION IS CHOSEN IN PRINTDUMP,
*                OR THE KEYWORD  'MTRACE' IS USED.
*
*                IF IT IS PREFERRED TO USE THE EXIT VIA KEYWORD ONLY,
*                CHANGE THE REP TO :
*
*                REP 00C8 D4E3D9C1C3C54040,00000000,D4E3D9C1C3C54040
*
*                AND USE THE KEYWORD 'MTRACE' WHEN USING PRINTDUMP.
*                WITH THE FIRST ZAP THE FORMAT OPTION OR THE KEYWORD
*                MAY BE USED. WITH THE 2ND ONLY THE KEYWORD WILL CAUSE
*                THE EXIT TO BE CALLED.
*
*                THIS VERSION WAS LAST UPDATED ON 79/11/27
*
* PLEASE REPORT ANY PROBLEMS WITH THIS EXIT TO  :
*      TOM MCCAFFERTY  8/249/9565
*
* THIS IS NOT A SUPPORTED FIELD SERVICE AID, BUT PROBLEMS WILL BE
* ADDRESSED INFORMALLY AS TIME PERMITS.
*
       */.
++ ZAP (AMDPRECT) /* UPDATE PRINT DUMP USER EXIT TABLE */.
  NAME AMDPRECT
* UPDATE PRINT-DUMP USER EXIT TABLE
  VER  0000F0  40404040,40404040 - VERIFY EMPTY ENTRY
  VER  0000FC  40404040,40404040 - VERIFY EMPTY ENTRY
  VER  000104  40404040,40404040 - VERIFY EMPTY ENTRY
  VER  000110  40404040,40404040 - VERIFY EMPTY ENTRY
  VER  000118  40404040,40404040 - VERIFY EMPTY ENTRY
  VER  000124  40404040,40404040 - VERIFY EMPTY ENTRY
  VER  00012C  40404040,40404040 - VERIFY EMPTY ENTRY
  VER  000134  00000000          - VERIFY EMPTY FLAG ENTRY
  VER  000138  40404040,40404040 - VERIFY EMPTY ENTRY
  VER  000140  40404040,40404040 - VERIFY EMPTY ENTRY
  VER  00014C  40404040,40404040 - VERIFY EMPTY ENTRY
* -----------------------------------------------------------
  REP  0000F0  D9E2D4D9,C5D3F440 - RSMREL4  (LOADMOD NAME)
  REP  0000FC  D9E2D4C4,C1E3C140 - RSMDATA  (CTL CARD NAME)
  REP  000104  C8C1E2D7,C2D3D2E2 - HASPBLKS (LOADMOD NAME)
  REP  000110  D1C5E2F2,C4C1E3C1 - JES2DATA (CTL CARD NAME)
  REP  000118  C1D4C4D7,D9C3E2C1 - AMDPRCSA (LOADMOD NAME)
  REP  000124  C3E2C1D4,C1D74040 - CSAMAP   (CTL CARD NAME)
  REP  00012C  C1D4C4D7,D9D4E3D9 - AMDPRMTR (LOADMOD NAME)
  REP  000134  20000000          - SET TO CALL FOR 'FORMAT'
  REP  000138  D4E3D9C1,C3C54040 - MTRACE   (CTL CARD NAME)
  REP  000140  C1D4C4D7,E2C3C1D5 - AMDPSCAN (LOADMOD NAME)
  REP  00014C  E2C3C1D5,40404040 - SCAN     (CTL CARD NAME)
  IDRDATA LA00198
$$
./       ADD   NAME=LA00207A
//SSUD207A JOB (M,AJNJ,S610C021),04542HMD,CLASS=K,NOTIFY=SSUD,
//   MSGCLASS=A ,TYPRUN=HOLD
//*ACCT        HOWARD DEAN,SSU
/*ROUTE  PRINT U90
/*JOBPARM L=999,S=ANY
//***
//***    SYS PROG: HOWARD M. DEAN
//***    DATE:     04/09/83
//***    LOCATION: SYST.LOCLMODS.CNTL(LA00207A)
//***    DESC:     UPDATE HASPCOMM TO DO THE FOLLOWING:
//***
//***              (1) $DU,PRT/PUN - CAUSE THE DISPLAY OF
//***                  A PRINTER OR PUNCH THAT IS ACTIVE
//***                  TO CONTAIN THE NUMBER OF LINES LEFT
//***                  TO PRINT BEHIND THE KEYWORK 'L='
//***
//***              (2) ADD NUMBER OF PRINT LINES FOR EACH CLASS,
//***                  JOB OR ROUTING CODE FOR THE $DF COMMAND.
//***
//***           WARNING!!!  - DO NOT RENUMBER THIS DATASET
//***           **********    IT CONTAINS A SEQUENCE DEPENDENT
//***           **********    SOURCE UPDATE AND MAY BE RUINED
//***           **********    IF RENUMBERED.
//***
//SMP      EXEC PUTSMP,OPT=200,REGION=3600K
//SMPCNTL  DD *
   RECEIVE S(LA00207).
   APPLY   S(LA00207) DIS(WRITE).
//SMPPTFIN DD DATA,DLM=$$
++ USERMOD (LA00207)   /*  HASPCOMM LOCAL MODIFICATION
     *****************************************************************
     *                                                               *
     *       GTEDS: MARINA DEL REY, CALIFORNIA                       *
     *                                                               *
     *       DATE:  04/09/83  BY: H.M. DEAN                          *
     *                                                               *
     *                                                               *
     *                                                               *
     *       RELEASE         - OS/MVS 3.8                            *
     *       ENVIRONMENT     - 16MB IBM 3033, 16MB AMDAHL V8         *
     *                       - 24MB IBM 3081                         *
     *                                                               *
     *       PTF LEVEL       - 8209 (FMID HJE2226)                   *
     *                                                               *
     *       USERMOD         - LA00207                               *
     *       JOBNAME         - SSUD207A                              *
     *       TYPE            - SRCUPD (HASPCOMM)                     *
     *                                                               *
     *       PRODUCT         - JES2 FOR MVS/SP 1.3                   *
     *       LMOD            - HASJES20                              *
     *       MOD (CSECT)     - HASPCOMM                              *
     *       SRCUPD          - HASPCOMM                              *
     *                                                               *
     *       PROBLEM         - JES2/NJE DOES NOT PROVIDE THE MEANS   *
     *                         TO DISPLAY LINE COUNTS FOR JOBS       *
     *                         AWAITING PRINT BY ROUTE CODE OR TO    *
     *                         DISPLAY THE NUMBER OF LINES LEFT TO   *
     *                         PRINT ON THE PRINTER/PUNCH.           *
     *                                                               *
     *       ENHANCEMENT     - MODIFY HASPCOMM TO DO THE FOLLOWING   *
     *                                                               *
     *                         (1) DISPLAY THE NUMBER OF LINES LEFT  *
     *                             TO PRINT VIA THE $DU,PRT/PUN      *
     *                             COMMAND BEHIND THE 'L=' KEYWORD.  *
     *                                                               *
     *                         (2) ADD NUMBER OF LINES TO $DF        *
     *                             FOR EACH ROUTE, CLASS, OR JOB.    *
     *****************************************************************
     */.
++VER (Z038) FMID(HJE2226)  /* MVS/SP 1.3 JES2 */
             PRE(UZ37266,UZ52546,UZ54839,
                 UZ57914,UZ58547,UZ59018,
                 UZ59743).
++ SRCUPD (HASPCOMM) DISTLIB(HASPSRC).
./ CHANGE NAME=HASPCOMM                                         LA01207
         $STORE (WD,WF)            SAVE WORK REGISTERS          LA01207
         TM    DCTSTAT,DCTINUSE    CHECK FOR ACTIVE             LA01207
         BZ    GTE&R.D             IF NOT, SKIP IT              LA01207
         L     R15,DCTPCE          POINT TO PCE                 LA01207
         L     R15,PWKJOE-PCEDSECT(R15)   POINT TO JOE          LA01207
         LR    WD,R15              ESTABLISH BASE               LA01207
         L     R15,JOERECCT-JOEDSECT(WD)  GET TOTAL RECORDS     LA01207
         TM    JOEFLAG-JOEDSECT(WD),$JOECKV                     LA01207
*                                  IS CHECKPOINT JOE VALID      LA01207
         BZ    GTE&R.X             IF NOT, DO NOT ADJUST COUNT  LA01207
         L     WE,JOECKPT-JOEDSECT(WD)                          LA01207
*                                  GET CHECKPOINT JOE OFFSET    LA01207
         N     WE,GTE&R.Y          CLEAN REGISTER OFFSET        LA01207
         BZ    GTE&R.X             NO CHECKPOINT JOE            LA01207
         AL    WE,$JOTABLE         POINT TO CKPT JOE            LA01207
         S     R15,JOETLNC-JOEDSECT(WE)  SUBTRACT RECS PRINTED  LA01207
         BNP   GTE&R.D             EITHER DONE PRINTING OR BAD  LA01207
GTE&R.X  CVD   R15,GTE&R.S         CONVERT LINE COUNT TO DEC.   LA01207
         MVC   1(L'GTE&R.M,WA),GTE&R.M       MASK TO COMMAND.   LA01207
         ED    1(L'GTE&R.M,WA),GTE&R.S       EDIT LINE COUNT.   LA01207
         MVC   0(2,WA),=C'L='      SET LINE COUNT PREFIX.       LA01207
         LA    R15,2(WA)           POINT FIRST BYTE OF EDIT.    LA01207
GTE&R.A  CLI   0(R15),X'40'        LOOK FOR START OF NUMERICS.  LA01207
         BNE   GTE&R.B             IF NON-BLANK - GO MOVE.      LA01207
         LA    R15,1(R15)          SEARCH FOR FIRST             LA01207
         B     GTE&R.A             NON-BLANK.                   LA01207
GTE&R.B  MVC   2(L'GTE&R.M,WA),0(R15)      DROP LEADING BLANKS. LA01207
         LA    WA,2(WA)            POINT TO OPERAND.            LA01207
GTE&R.C  CLI   0(WA),X'40'         LOOK FOR END OF LINE COUNT.  LA01207
         LA    WA,1(WA)            POINT PAST END BY ONE        LA01207
         BNE   GTE&R.C             IF NOT BLANK, KEEP LOOKING.  LA01207
         B     GTE&R.D             THAT IS ALL FOLKS            LA01207
GTE&R.M  DC    X'402020206B2020206B2020206B2020206B202020'      LA01207
GTE&R.S  DC    D'0'                SAVE AREA FOR LINE COUNT     LA01207
GTE&R.Y  DC    F'16777215'         CLEAR UPPER REGISTER BYTE    LA01207
GTE&R.D  DS    0H                                               LA01207
         $RESTORE (WD,WF)          RESTORE WORK REGISTERS       LA01207
         SLR   R10,R10             INITIALIZE RECORD COUNT      LA02207
         MVC   COMEWORK,$ZEROS     CLEAR DUMP RECORD COUNT      LA02207
         A     R10,JOERECCT        ADD RECORD COUNT             LA02207
         C     R10,=F'9999999'     CHECK FOR MAXIMUM            LA02207
         BL    *+8                 NO - CONTINUE                LA02207
         L     R10,=F'9999999'     LOAD MAXIMUM COUNT           LA02207
         L     R10,COMEWORK        LOAD RECORD COUNT            LA02207
         A     R10,JOERECCT        ADD RECORD COUNT             LA02207
         C     R10,=F'9999999'     CHECK FOR MAXIMUM            LA02207
         BL    *+8                 NO - CONTINUE                LA02207
         L     R10,=F'9999999'     LOAD MAXIMUM COUNT           LA02207
         ST    R10,COMEWORK        SAVE RECORD COUNT            LA02207
         LR    R0,R10              GET RECORD COUNT             LA02207
         CVD   R0,COMDWORK         CONVERT TO DECIMAL           LA02207
         MVC   5(8,WD),=XL8'4020202020202021'                   LA02207
         ED    5(8,WD),COMDWORK+4  EDIT COUNT IN                LA02207
         MVI   4(WD),C'('          MOVE IN LEADING   (          LA02207
         MVI   13(WD),C')'         MOVE IN TRAILING  )          LA02207
         MVI   14(WD),C','         MOVE IN TRAILING COMMA       LA02207
         LR    R10,WD              SAVE AREA POINTER            LA02207
         LA    WD,5(,WD)           POINT TO NEXT AREA           LA02207
         CLI   2(R10),C'*'         CHECK OVERFLOW               LA02207
         BE    *+8                 YES - NO INCREMENT           LA02207
         LA    WD,10(,WD)          POINT TO NEXT AREA           LA02207
         SLR   R10,R10             INITIALIZE RECORD COUNT      LA02207
         L     R0,COMEWORK         LOAD LINE COUNT              LA02207
         CVD   R0,COMDWORK         CONVERT TO DECIMAL           LA02207
         MVC   7(8,WD),=XL8'4020202020202021'                   LA02207
         ED    7(8,WD),COMDWORK+4  EDIT COUNT IN                LA02207
         MVI   6(WD),C'('          MOVE IN LEADING   (          LA02207
         MVI   15(WD),C')'         MOVE IN TRAILING  )          LA02207
         MVI   16(WD),C' '         CLEAR END OF LIST            LA02207
         LR    R10,WD              SAVE AREA POINTER            LA02207
         LA    WD,6(,WD)           POINT TO NEXT AREA           LA02207
         CLI   4(R10),C'*'         CHECK OVERFLOW               LA02207
         BE    *+8                 YES - NO INCREMENT           LA02207
         LA    WD,11(,WD)          POINT TO NEXT AREA           LA02207
         MVC   COMEWORK,$ZEROS     CLEAR LINE COUNT             LA02207
         MVC   CDFDMPCT,$ZEROS     CLEAR DUMPED COUNT           LA02207
         SLR   R10,R10             INITIALIZE RECORD COUNT      LA02207
./ ENDUP                                                        LA02207
$$
//
./       ADD   NAME=LA00208A
//SSUD208A JOB (M,AJNJ,S610C021),04542HMD,CLASS=A,NOTIFY=SSUD,
//  MSGCLASS=O ,TYPRUN=HOLD
//*ACCT        HOWARD DEAN,SSU
/*ROUTE  PRINT U90
/*JOBPARM L=300,S=*
//***
//***    WARNING!! - DO NOT RENUMBER THIS MODIFICATION
//***                IT CONTAINS A SOURCE UPDATE AND WILL BE
//***                DESTROYED IF RENUMBERED.
//***
//***    SYS PROG: H.M. DEAN
//***    DATE:     04/09/83
//***    LOCATION: SYST.LOCLMODS.CNTL(LA00208A)
//***    DESC:     (1) ACCT  CARD LOCAL MOD
//***
//***              (2) SYSOUT/MICROFICHE LOCAL MOD
//***
//***              (3) LITTLE LOCAL MOD TO MOVE INPUT DEVICE
//***                  TO JCL LISTING
//***
//SMP      EXEC PUTSMP,OPT=200,REGION=3600K
//SMPCNTL  DD *
  RECEIVE  S(LA00208).
  APPLY    S(LA00208) DIS(WRITE).
//SMPPTFIN DD DATA,DLM=$$
++ USERMOD (LA00208)        /* ACCT  CARD LOCAL MOD
                               SYSOUT/MICROFICHE LOCAL MOD
                               INPUT DEVICE TO JCL LISTING LOCAL MOD
     *****************************************************************
     *                                                               *
     *       GTEDS: MARINA DEL REY, CALIFORNIA                       *
     *                                                               *
     *       DATE: 04/09/83  BY: H.M. DEAN                           *
     *                                                               *
     *       RELEASE         - OS/MVS REL 3.8                        *
     *       ENVIRONMENT     - 16MB IBM 3033  16MB AMDAHL V8         *
     *                         24MB IBM 3081                         *
     *                                                               *
     *       PTF LEVEL       - 8209 FMID(HJE2226)                    *
     *                                                               *
     *       USERMOD         - LA00208                               *
     *       JOBNAME         - LA00208A                              *
     *       TYPE            - SRCUPD                                *
     *                                                               *
     *       PRODUCT         - MVS/SP 1.3 JES2 (HJE2226)             *
     *       SRCUPD          - HASPPRPU, HASPRDR                     *
     *                                                               *
     *       NOTE: THIS LOCAL MODIFICATION IS A JES2 ENHANCEMENT     *
     *             TO PROVIDE GTEDS SYSOUT/MICROFICHE PROCESSING     *
     *             AND GTEDS //*ACCT CARD PROCESSING                 *
     *                                                               *
     *                                                               *
     *       ENHANCEMENT     -                                       *
     *                                                               *
     *                    (1)  ADD THE '//*ACCT' JES2 CONTROL CARD   *
     *                         FORMAT IS '//*ACCT   PGMR,ROOM'       *
     *                         (MOD IS TO HASPRDR)                   *
     *                                                               *
     *                    (2)  INSTALL JES2 SYSOUT/MICROFICHE HOOKS  *
     *                                                               *
     *                         THIS MOD RETAINS A COPY OF THE CLASS  *
     *                         'A' OR 'F' OUTPUT FROM PRODUCTION     *
     *                         JOBS.  THE RETAINED CLASS 'A' AND 'F' *
     *                         OUTPUT WILL BE REQUED TO CLASS 'M'    *
     *                         WHEN IT PRINTS.  PRODUCTION JOBS OF   *
     *                         CERTAIN CLASSES WILL BE REQUEUED TO   *
     *                         CLASS 'M' FOR THE SYSOUT-MICROFICHE   *
     *                         EXTERNAL WRITER 'COMWTR'. A BIT IS    *
     *                         SET IN THE JCT TO INDICATE WHICH JOB  *
     *                         IS PRODUCTION BASED ON CODES IN THE   *
     *                         ACCOUNT PARAMETER OF THE JOB CARD.    *
     *                         (MOD IS TO HASPRDR, HASPPRPU)         *
     *                                                               *
     *                    (3)  MOVE JCTINDEV TO COL 73-80 OF JOB     *
     *                         CARD (SO INPUT DEVICE CAN BE          *
     *                         IDENTIFIED IN JCL OUTPUT LISTING)     *
     *                                                               *
     *                         THIS MOD IS USED IN SMF EXIT IEFUJV   *
     *                         TO DETERMINE IF INPUT JOB IS A        *
     *                         STARTED TASK (STCINRDR IN COL 73-80)  *
     *                         (MOD IS TO HASPRDR)                   *
     *****************************************************************
     */.
++VER (Z038) FMID(HJE2226)
             PRE(UZ37266,UZ52546,UZ54839,
                 UZ57914,UZ58547,UZ59018,
                 UZ59743,TT90004,LA00209).
++ SRCUPD (HASPRDR) DISTLIB (HASPSRC).
./ CHANGE  NAME=HASPRDR                                         LA01208
*        BE    RFLTEST             REPLACED CARD                LA01208
         BNE   RJCLCRD             NOT ACCT CARD OR COMMENT     LA01208
         CLC   3(5,RPI),RACCTCOD   Q. //*ACCT CARD              LA01208
         BNE   RFLTEST             A. NO, MUST BE JCL COMMENT   LA01208
         SPACE 3                                                LA01208
*****    HAVE //*ACCT              CONTROL CARD           ***** LA01208
*                                                             * LA01208
RACCTLNK DS    0H                  LINK TO //*ACCT SEGMENT      LA01208
         LTR   JCT,JCT             Q. JCT BUILT YET             LA01208
         BZ    RFLTEST             A. NO, DON'T PROCESS         LA01208
         MVI   JCTPNAME,C' '       CLEAR PROGRAMMER NAME        LA01208
         MVC   JCTPNAME+1(L'JCTPNAME-1),JCTPNAME                LA01208
         MVI   JCTROOMN,C' '       CLEAR ROOM NUMBER FIELD      LA01208
         MVC   JCTROOMN+1(L'JCTROOMN-1),JCTROOMN                LA01208
         $LINK HASPRCC3            LINK TO NEXT SEGMENT         LA01208
         BR    RL2                 RL2 HAS EXIT ADDRESS         LA01208
         SPACE 1                                                LA01208
RACCTCOD DC    C'ACCT '            //*ACCT CARD CODE            LA01208
         SPACE 2                                                LA01208
RJCLCRD  DS    0H                                               LA01208
*****    THIRD LOAD OF HASP COMMAND SCAN ROUTINE         ****** LA01208
*        ENTRY                                                * LA01208
*              FROM HASPRDR VIA $LINK                         * LA01208
*        INPUT                                                * LA01208
*              REG 05 (RPI) POINTS TO INPUT CARD              * LA01208
*              REG 14 (LINK) POINTS TO RETURN                 * LA01208
*              THIS ROUTINE EXPECTS THE FOLLOWING COMMAND CARDS LA01208
*                   //*ACCT        HASP ACCOUNTING FIELD DATA * LA01208
*                                    AND PROGRAMMER NAME      * LA01208
*        REGISTER USAGE                                       * LA01208
*              R0                  WORK REG       VOLATILE    * LA01208
*              R1                  WORK REG       VOLATILE    * LA01208
*              R2,RW               CARD COL ADDR  VOLATILE    * LA01208
*              R5,RPI              CARD POINTER   TRANSPARENT * LA01208
*              R6,RL1              LINK REG       VOLATILE    * LA01208
*              R7,RL2              EXIT ADDR      VOLATILE    * LA01208
         SPACE 1                                                LA01208
HASPRDRO CSECT           DEFINE SUBROUTINE CSECT                LA01208
HASPRCC3 $ENTRY          DEFINE ACCT OVERLAY                    LA01208
         $SAVE           SAVE REGS                              LA01208
         LR    BASE3,R15 SET UP ADDRESSABILITY                  LA01208
         SPACE 2                                                LA01208
         CLC   RACCT,3(RPI)        Q. //*ACCT CARD              LA01208
         BE    RACCTCD              YES, GO PROCESS             LA01208
         SPACE 1                                                LA01208
*****    EXIT  ROUTINE                                    ***** LA01208
*                                                             * LA01208
RCMDEND1 LA    RL2,RFLTEST         GET EXIT ADDRESS             LA01208
RCMDENDX $STORE ((RBI,RPI),RL2,JCT) SAVE REGS REQUIRED FOR RTN  LA01208
         $RETURN                   RETURN TO CALLING MODULE     LA01208
         EJECT                                                  LA01208
*****    PROCESS //*ACCT CARD                             ***** LA01208
*                                                             * LA01208
RACCTCD  DS    0H                                               LA01208
         MVI   69(RPI),X'EC'       SET UP CARD LIMIT            LA01208
         LA    RW,7(RPI)           POINT TO FIRST BLANK         LA01208
RFIND1   CLI   0(RW),C' '          COLUMN EMPTY                 LA01208
         BNE   RFIND2              FOUND THE CARD               LA01208
         LA    RW,1(,RW)           BUMP POINTER                 LA01208
         B     RFIND1              CONTINUE SEARCH              LA01208
RFIND2   EQU   *                   COLUMN POINTER INITIALIZED   LA01208
         MVI   JCTPNAME,C' '       CLEAR PGMR NAME FIELD FIRST  LA01208
         MVC   JCTPNAME+1(L'JCTPNAME-1),JCTPNAME                LA01208
         BAL   RL1,RASCAN          SCAN FOR PROGRAMMER NAME     LA01208
         LTR   R1,R1               TEST LENGTH OF NAME          LA01208
         BZ    RNAME2              NO NAME SUPPLIED             LA01208
         LR    R0,R1               SAVE LENGTH OF NAME FIELD    LA01208
RNAME    C     R1,RC20             TEST L'NAME FOR MAXIMUM      LA01208
         BNH   RNAME1              LENGTH LT OR EQ 20           LA01208
         LA    R1,20               SET MAX NAME LENGTH          LA01208
RNAME1   LA    R15,JCTPNAME        GET JCT PGMR NAME ADDR       LA01208
         BCTR  R1,0                REDUCE L'NAME FIELD FOR MVC  LA01208
         EX    R1,RJCTMVC2         MOVE PGMR NAME TO JCT        LA01208
         LR    R1,R0               RESET LENGTH OF NAME FIELD   LA01208
RNAME2   AR    RW,R1               SET CC PNTR TO NAME + L'NAME LA01208
         LA    RW,1(RW)            SET CC POINTER TO ROOM       LA01208
         MVI   JCTROOMN,C' '       CLEAR ROOM NO. FIELD FIRST   LA01208
         MVC   JCTROOMN+1(L'JCTROOMN-1),JCTROOMN                LA01208
         SPACE 1                                                LA01208
RROOM    BAL   RL1,RASCAN          SCAN FOR ROOM NUMBER         LA01208
         LTR   R1,R1               TEST LENGTH OF ROOM NUMBER   LA01208
         BZ    RROOM2              NO ROOM NO. SUPPLIED         LA01208
         C     R1,RC04             TEST L'ROOM FOR MAXIMUM      LA01208
         BNH   RROOM1              NOT TOO LONG, USE IT         LA01208
         MVC   JCTROOMN(4),0(RW)   MOVE FIRST FOUR CHARACTERS   LA01208
         B     RROOM2              THEN EXIT                    LA01208
RROOM1   BCTR  R1,0                REDUCE L'ROOM FOR MVC        LA01208
         LA    R15,JCTROOMN        GET JCT ROOM ADDR            LA01208
         EX    R1,RJCTMVC2         MOVE ROOM NO. TO JCT         LA01208
         LA    R1,1(R1)            RESET L'ROOM                 LA01208
RROOM2   AR    RW,R1               SET CC PNTR TO ROOM + L'ROOM LA01208
         LA    RW,1(RW)            SET CC POINTER TO LINE EST   LA01208
         B     RCMDEND1            GO TO ROUTINE EXIT           LA01208
         EJECT                                                  LA01208
*****    ROUTINE TO FIND LENGTH OF FIELD                  ***** LA01208
*                                                             * LA01208
*        INPUT                                                * LA01208
*              REG 2(RW) CONTAINS ADDR OF FIRST FIELD BYTE    * LA01208
*              REG 6(RL1) HAS RETURN ADDRESS                  * LA01208
*              FIELD TERMINATED BY COMMA, BLANK OR END OF CARD* LA01208
*        OUTPUT                                               * LA01208
*              REG 1(R1) CONTAINS LENGTH OF FIELD             * LA01208
*              REG 2(RW) CONTAINS ADDR OF FIRST FIELD BYTE    * LA01208
*        VOLATILE AREAS                                       * LA01208
*              REG 1 DATA IS DESTROYED                        * LA01208
         SPACE 1                                                LA01208
RASCAN   LA    R1,0(RW)            SET R1 TO START OF FIELD     LA01208
RASCAN1  CLI   0(R1),C','          TEST FOR FIELD END           LA01208
         BE    RASCANXT            FOUND, GO TO EXIT            LA01208
         CLC   0(10,R1),=10CL1' '  TEST FOR BLANKS              LA01208
         BE    RASCANXT            FOUND, GO TO EXIT            LA01208
         CLI   0(R1),X'EC'         TEST FOR CARD LIMIT          LA01208
         BE    RASCANX1            FOUND, GO TO SPECIAL EXIT    LA01208
         LA    R1,1(R1)            INCREMENT SCAN POINTER       LA01208
         B     RASCAN1             CONTINUE LOOP                LA01208
RASCANX1 MVI   1(R1),X'EC'         SET UP NEW CARD LIMIT        LA01208
RASCANXT SR    R1,RW               COMPUTE FIELD LENGTH         LA01208
         BR    RL1                 RETURN TO CALLER             LA01208
         SPACE 2                                                LA01208
RC04     DC    A(4)                ACCT FIELD CONSTANT          LA01208
RC20     DC    A(20)               NAME LENGTH CONSTANT         LA01208
RACCT    DC    C'ACCT '            ACCT CARD CODE               LA01208
RJCTMVC2 MVC   0(*-*,R15),0(RW)    EX USED FOR PGMR NAME & ROOM LA01208
         DROP  BASE3               DROP SEGMENT ADDRESSABILITY  LA01208
         EJECT                                                  LA01208
         L     RW,RSAVE1           GET JOB CARD POINTER         LA02208
         LA    RW,3(RW)            INCREMENT TO 'JOB'           LA02208
         NI    JCTUSER0,JCTCLEAR   CLEAR JCT PRODUCTION FLAG    LA02208
         CLC   0(4,RW),=C'JOB '    TEST FOR JOB CARD            LA02208
         BNE   LA208R04            BR IF ERROR - SKIP IT        LA02208
         LA    RW,4(RW)            POINT TO ACCTG FIELD         LA02208
         LA    R14,1               SET ACCT SCAN LIMITS         LA02208
         LA    R15,55(RW)          ..                           LA02208
LA208R01 CLI   0(RW),C'('          SCAN FOR ACCTG FIELD         LA02208
         BE    LA208R02            ..   FOUND - GO CHECK PROD   LA02208
         BXLE  RW,R14,LA208R01     ..   INCR PNTR AND TEST      LA02208
         B     LA208R04            ..   NOT FOUND - EXIT        LA02208
LA208R02 CLI   1(RW),C'P'          TEST FOR PRODUCTION JOB      LA02208
         BE    LA208R03            ..   YES                     LA02208
         CLI   1(RW),C'C'          ..                           LA02208
         BE    LA208R03            ..   YES - CUSTOMER RERUN    LA02208
         CLI   1(RW),C'R'          ..                           LA02208
         BNE   LA208R04            ..   NO - SKIP IT            LA02208
LA208R03 OI    JCTUSER0,JCTPROD    SET PRODUCTION JOB FLAG      LA02208
LA208R04 EQU   *                                                LA02208
JCTPROD  EQU   X'80'               PRODUCTION JOB FLAG          LA02208
JCTCLEAR EQU   X'00'               CLEAR PRODUCTION FLAG        LA02208
         MVC   72(8,RPI),JCTINDEV  MOVE INPUT DEVICE TO 73-80   LA03208
./ ENDUP                                                        LA00208
++ SRCUPD (HASPPRPU) DISTLIB (HASPSRC).
./ CHANGE NAME=HASPPRPU                                         LA00208
PJCTFREE DS    0H                                         @SPR2 LA00208
         TM    PDCTFLAG,DCTRSTRT+DCTRPT  Q. $E, $N, OR $I       LA02208
         BNZ   LA208PEX                  A. YES - SKIP IT       LA02208
         L     PW,PWKJOE           LOAD ADDRESS OF JOE          LA02208
         USING JOEDSECT,PW         ACTIVATE JOE ADDRESSABILITY  LA02208
         CLI   JOECURCL,LA208PCQ   Q. FICHE CLASS ON PRINTER    LA02208
         BE    LA208PRQ            A. YES - RE-QUEUE IT         LA02208
         CLI   JOECURCL,LA208LC1   Q. LOG CLASS ON PRINTER      LA02208
         BL    LA208RJE            A. NO                        LA02208
         CLI   JOECURCL,LA208LC9                                LA02208
         BH    LA208RJE            A. NO                        LA02208
         MVC   PMESSAGE(JOESIZE),0(PW) A. YES - RE-QUEUE IT     LA02208
         B     LA208ADD                                         LA02208
LA208RJE TM    PCEID,PCERJEID      Q. RJE OUTPUT                LA02208
         BO    LA208PEX            A. YES - SKIP IT             LA02208
         L     R15,PJCTBUF         LOAD ADDRESS OF JCT          LA02208
         TM    JCTUSER0-JCTDSECT(R15),JCTPROD Q. PRODUCTION JOB LA02208
         BO    LA208RQX            A. YES - GO TO IT            LA02208
         CLI   JCTACCTN-JCTDSECT(R15),C'P'    Q. PRODUCTION JOB LA02208
         BE    LA208RQX            A. YES - GO TO IT            LA02208
         CLI   JCTACCTN-JCTDSECT(R15),C'R'    Q. RERUN?         LA02208
         BE    LA208RQX            A. YES - GO TO IT            LA02208
         CLI   JCTACCTN-JCTDSECT(R15),C'C'    Q. CUSTOMER RERUN LA02208
         BNE   LA208PEX            A. NO, EXIT                  LA02208
LA208RQX CLI   JOECURCL,LA208PC1   Q. PRINT/FICHE CLASS         LA02208
         BE    LA208PRQ            A. YES - RE-QUEUE IT         LA02208
         CLI   JOECURCL,LA208PC2                                LA02208
         BNE   LA208PEX            A. NO - SKIP IT              LA02208
LA208PRQ MVC   PMESSAGE(JOESIZE),0(PW)  MOVE JOE TO WORK AREA   LA02208
         MVI   PMESSAGE+JOECURCL-JOEDSECT,LA208PCQ SET FICHE CL LA02208
LA208ADD LA    R0,PMESSAGE         LOAD ADDRESS OF NEW JOE      LA02208
         $#ADD WORK=(R0),CHAR=PCHJOE  RE-QUEUE THE JOE          LA02208
         DROP  PW                                               LA02208
JCTPROD  EQU   X'80'               PRODUCTION JOB FLAG          LA02208
LA208PC1 EQU   C'A'                CLASSES FOR PRINT AND FICHE  LA02208
LA208PC2 EQU   C'F'                                             LA02208
LA208PCQ EQU   C'M'                CLASS FOR MICROFICHE ONLY    LA02208
LA208LC1 EQU   C'U'                RANGE OF CLASSES             LA02208
LA208LC9 EQU   C'Y'                  FOR SYSLOG                 LA02208
LA208PEX DS    0H                                               LA02208
         SPACE 2                                                LA02208
         L     JCT,PJCTBUF         ADDRESS JCT BUFFER     @SPR2 LA02208
./ ENDUP                                                        LA00208
$$
//
./       ADD   NAME=LA00209A
//SSUD209A  JOB (M,AJNJ,S610C021),04542HMD,CLASS=A,NOTIFY=SSUD,
//  MSGCLASS=O TYPRUN=HOLD
//*ACCT        HOWARD DEAN,SSU
/*ROUTE  PRINT U90
/*JOBPARM L=300,S=ANY
//***
//***    SYS PROG: H.M. DEAN
//***    DATE:     04/09/83
//***    LOCATION: SYST.LOCLMODS.CNTL(LA00209A)
//***    DESC:     GTEDS SEPARATOR PAGE LOCAL MODIFICATION
//***
//SMP      EXEC PUTSMP,OPT=200,REGION=3600K
//SMPCNTL  DD *
  RECEIVE  S(LA00209).
  APPLY    S(LA00209) DIS(WRITE).
//SMPPTFIN DD DATA,DLM=$$
++ USERMOD (LA00209) /*
     *****************************************************************
     *                                                               *
     *       GTEDS: MARINA DEL REY, CALIFORNIA                       *
     *                                                               *
     *       DATE: 04/09/83      H.M. DEAN                           *
     *                                                               *
     *       RELEASE         - OS/MVS 3.8   SP 1.3                   *
     *       ENVIRONMENT     - 16MB IBM 3033  16MB AMDAHL V8         *
     *                         24MB IBM 3081                         *
     *                                                               *
     *       PTF LEVEL       - 8209 (FMID HJE2226)                   *
     *                                                               *
     *       USERMOD         - LA00209                               *
     *       JOBNAME         - LA00209A                              *
     *       TYPE            - SRCUPD                                *
     *                                                               *
     *       PRODUCT         - JES2 FOR MVS/SP 1.3                   *
     *       SRC             - HASPPRPU                              *
     *                                                               *
     *       ENHANCEMENT     - PROVIDE GTEDS SEPARATOR PAGES         *
     *                         (SEE DOCUMENTATION BELOW)             *
     *                                                               *
     *****************************************************************
     */.
++ VER (Z038) FMID(HJE2226)
              PRE(UZ37266,UZ52546,UZ54839,
                  UZ57914,UZ58547,UZ59018,
                  UZ59743).
++ SRCUPD  (HASPPRPU) DISTLIB(HASPSRC) /*
***********************************************************************
*                                                                     *
*         LA00209 -- LOCAL PRINT SEPARATOR PAGE MODIFICATION          *
*                                                                     *
*                                                                     *
*  HEADER PAGE --                                                     *
*                                                                     *
*     . IF THE JES2 INITIALIZATION PARAMETER &PRIDCT IS GREATER       *
*  THAN 29, THE JOB NAME, JOB ID, AND OUTPUT CLASS ARE PRINTED IN     *
*  NON-SLANTED BLOCK-LETTERS.                                         *
*                                                                     *
*     . THE IDENTIFICATION LINE IS PRINTED ELEVEN TIMES WITH          *
*  TRIPLE-SPACING (IE, THROUGH LINE 60 IF THE BLOCK-LETTERS ARE       *
*  PRINTED).                                                          *
*                                                                     *
*     . IF THIS IS NOT THE LAST HEADER PAGE AND IF THE PRINTER IS     *
*  NOT A 3800, A LINE OF ASTERISKS IS PRINTED AT THE CHANNEL-9        *
*  POSITION (ASSUMED TO BE LINE 63, ON THE PAGE PERFORATION.          *
*                                                                     *
*     .  THE NUMBER OF FULL HEADER PAGES PRODUCED IS CONTROLLED BY    *
*  &PRIDCT --  N=INT((&PRIDCT+62)/63) .                               *
*                                                                     *
*                                                                     *
*  TRAILER PAGE --                                                    *
*                                                                     *
*     .  ON NON-3800 PRINTERS, THE IDENTIFICATION LINE IS PRINTED     *
*  CONTINUOUSLY (ASSUMING 6 LPI) WITH TRIPLE-SPACING THROUGH THE      *
*  'NTH' LINE, WHERE N=&PRIDCT AND LINE 1 IS THE CHANNEL-1 POSITION,  *
*  EXCEPT --                                                          *
*                                                                     *
*        .  DOUBLE-SPACING IS USED BETWEEN THE FIRST TWO LINES TO     *
*  ALIGN THE PRINTED LINES WITH THE PAGE RULINGS AND PERFORATIONS.    *
*                                                                     *
*        .  A LINE OF ASTERISKS IS PRINTED AT EACH CHANNEL-9          *
*  POSITION BETWEEN THE FIRST AND LAST LINES AND AT THE NEXT          *
*  CHANNEL-9 POSITION FOLLOWING THE LAST LINE.                        *
*                                                                     *
*     .  ON THE 3800 PRINTER, THE IDENTIFICATION LINE IS PRINTED 21   *
*  TIMES WITH DOUBLE-SPACING BETWEEN THE FIRST TWO LINES AND TRIPLE-  *
*  SPACING FOR THE REMAINING LINES (IE, THROUGH LINE 60).  THIS IS    *
*  REPEATED ON SUBSEQUENT PAGES UNTIL THE NUMBER OF TRAILER PAGES     *
*  IS THE SAME AS THE NUMBER OF HEADER PAGES.                         *
*                                                                     *
*     .  THE IDENTIFICATION LINE SAYS 'PAUSE' INSTEAD OF 'END' IF     *
*  THE PRINTER HAS BEEN INTERRUPTED.                                  *
*                                                                     *
*                                                                     *
*     THE FORMAT OF THE IDENTIFICATION LINE IS MODIFIED SLIGHTLY      *
*  TO MAKE IT A FULL 132 CHARACTERS WIDE (INSTEAD OF 129).            *
*                                                                     *
*                                                                     *
*     THE FIRST TWO BYTES OF 'PCEUSER1' ARE USED FOR FLAGS AND        *
*  LINE-COUNT STORAGE.                                                *
*                                                                     *
*                                                                     *
*     IT IS ASSUMED THAT THE PAGE IS AT THE CHANNEL-1 POSITION AT     *
*  THE TIME THE SEPARATOR PAGE ROUTINE IS ENTERED.  THE ROUTINE       *
*  LEAVES THE PAGE AT THE CHANNEL-1 POSITION WHEN IT IS FINISHED.     *
*                                                                     *
*                                                                     *
*     IT IS ASSUMED THAT THERE ARE AT LEAST TWO LINES AVAILABLE IN    *
*  THE BUFFER -- A VALID ASSUMPTION SINCE THE SEPARATOR PAGE ROUTINE  *
*  RECEIVES A NEW BUFFER WHEN CALLED AND THE '$PBLOCK' MACRO          *
*  ('PBLOCK' SUBROUTINE) 'EMPTIES' THE BUFFER BEFORE RETURNING.       *
*                                                                     *
*                                                                     *
*     THE LINES OF ASTERISKS AT THE CHANNEL-9 POSITION ARE INTENDED   *
*  TO INDICATE THE POINTS AT WHICH THE CONTINUOUS FORMS MAY BE TORN   *
*  TO SEPARATE THE OUTPUT BY JOB.                                     *
*                                                                     *
*                                                                     *
*     THE SEPARATOR PAGES FOR REMOTE PRINT OUTPUT ARE UNAFFECTED BY   *
*  THIS MODIFICATION, EXCEPT --                                       *
*                                                                     *
*        .  'PAUSE' INSTEAD OF 'END' IS PRINTED ON THE TRAILER        *
*  PAGE IF THE PRINTER HAS BEEN INTERRUPTED.                          *
*                                                                     *
*        .  IF &TPIDCT IS GREATER THAN 29 --                          *
*                                                                     *
*           .  THE BLOCK-LETTERS ON THE HEADER PAGE ARE NON-SLANTED.  *
*                                                                     *
*           .  THE BLOCK-LETTERS ON THE TRAILER PAGE ARE OMITTED      *
*  (IE, REPLACED BY THE IDENTIFICATION LINE).                         *
*                                                                     *
*                                                                     *
*     BECAUSE OF THE VARYING PAGE SIZES AND LINES-PER-PAGE, THE       *
*  SEPARATOR PAGES FOR PRINT OUTPUT IN 'SPURT2' OUTPUT CLASSES ('0'   *
*  THROUGH '9') ARE THE SAME AS THOSE FOR REMOTE PRINT OUTPUT,        *
*  EXCEPT &PRIDCT IS USED INSTEAD OF &TPIDCT.                         *
*                                                                     *
*                                                                     *
*     SPECIAL 'START-JOB' AND 'END-JOB' CONTROL RECORDS ARE           *
*  GENERATED WHEN THE OUTPUT DEVICE IS AN 'AUTOCOM' MICROFICHE        *
*  PROCESSOR.  THESE RECORDS CONTAIN ONLY A ONE-BYTE AUTOCOM CONTROL  *
*  CODE (X'0F' FOR 'START', X'1F' FOR 'END'), SENT TO THE DEVICE VIA  *
*  A 'PRINT, SKIP-CHAN-9' CCW.  THE 'START-JOB' RECORD IS SENT JUST   *
*  BEFORE THE HEADER PAGE, AND THE 'END-JOB' RECORD IS SENT AFTER     *
*  THE LINE OF ASTERISKS FOLLOWING THE TRAILER PAGE.  ALSO, ONLY ONE  *
*  HEADER PAGE AND ONE TRAILER PAGE ARE GENERATED, REGARDLESS OF THE  *
*  &PRIDCT VALUE.  A DEVICE IS DETERMINED TO BE AN AUTOCOM IF ITS     *
*  DEVICE TYPE INDICATES A 3211 PRINTER AND ITS JES DEVICE NAME IS    *
*  FOUND IN THE 'AUTOCOMT' TABLE.  THIS TABLE IS DEFINED IN SUCH A    *
*  MANNER AS TO PERMIT EASY MODIFICATION VIA IMASPZAP.                *
*                                                                     *
*                                                                     *
*  OTHER CHANGES --                                                   *
*                                                                     *
*     .  WHEN PRINTING NON-'SPURT2' OUTPUT CLASSES (IE, THE NON-      *
*  NUMERIC CLASSES, 'A' THROUGH 'Z'), ISSUE THE 3800 'END-OF-         *
*  TRANSMISSION' COMMAND ONLY AT THE BEGINNING OF A JOB (IE, 'JOE')   *
*  INSTEAD OF AT THE BEGINNING OF EACH COPY OF EACH DATA-SET.         *
*                                                                     *
*     .  CORRECTLY MAINTAIN THE MESSAGE LINE COUNT (IE, COUNT 3       *
*  INSTEAD OF 4 FOR EACH LINE).                                       *
*                                                                     *
***********************************************************************
  */.
./ CHANGE  NAME=HASPPRPU,SEQFLD=738
HDRFORM  DS    XL5,2X      PP4-8  FORM TYPE START/CONT/END SPR2 LA00209C
                           PP9-10  BLANK                   SPR2 LA00209
HDRNUM   DS    XL8,2X      PP11-18 JOB NUMBER PP19-20 BLANKSPR2 LA00209
HDRNAME  DS    XL8,2X      PP21-28 JOB NAME PP29-30 BLANK  SPR2 LA00209
HDRJNAME DS    XL4,X       PP31-34 JOE NAME PP35 BLANK     SPR2 LA00209
HDRJID   DS    XL4,X       PP36-39 JOE ID   PP40 BLANK     SPR2 LA00209
HDRJROUT DS    XL8,X       PP41-48 JOE ROUTE  PP49 BLANK   SPR2 LA00209
HDRPNAME DS    XL20,X      PP50-69 PROGRAMMER PP70 BLANK   SPR2 LA00209
HDRRKEY  DS    XL4,X       PP71-74 'ROOM' PP75 BLANK       SPR2 LA00209
HDRROOM  DS    XL4,X       PP76-79 ROOM NUMBER PP80 BLANK  SPR2 LA00209
HDRPTTN  DS    0XL9,X      PP81 BLANK USED AS FILL CHARACTER OE LA00209
HDRTIME  DS    0XL11,XL8,X PP82-89 HH.MM.SS PP90 BLANK     SPR2 LA00209
HDRAM    DS    3XL1        PP91-92 AM/PM PP93 BLANK        SPR2 LA00209
HDRDATE  DS    XL9,2X      PP94-102 DD MMM YY PP103-104 BLANKOE LA00209
HDRDNAME DS    XL8,2X      PP105-112 DEVICE NAME PP113-114 SPR2 LA00209
HDRSKEY  DS    XL3,X       PP115-117 'SYS' PP118 BLANK     SPR2 LA00209
HDRSYS   DS    XL4,X       PP119-122 SYSTEM NAME PP123 BLANK OE LA00209
         SPACE 1                                           SPR2 LA00209
HDRFORMX DS    XL5,2X      PP124-128 FORM PP129-130 BLANK  SPR2 LA00209
HDRCLASX DS    X           PP131  JOE CLASS                SPR2 LA00209
HDRFRAMX DS    XL1         PP132 FRAME CHARACTER           SPR2 LA00209
PTESTFDS DS    0H                                               LA00209
         L     PL,PWKJOE           LOAD WORK-JOE ADDRESS        LA00209
         USING JOEDSECT,PL                                      LA00209
         CLI   JOECURCL,C'0'       IF THIS IS NOT A SPURT       LA00209
         BL    PWARMTST             CLASS, SKIP AHEAD           LA00209
         DROP  PL                                               LA00209
         TM    PPFLAG2,PPFDS       TEST FOR FIRST DATA SET G38E LA00209
         L     PL,PWKJOE           LOAD WORK-JOE ADDRESS        LA00209
         USING JOEDSECT,PL                                      LA00209
         CLI   JOECURCL,C'0'       IF THIS IS NOT A SPURT       LA00209
         BL    PNXTCPY              CLASS, SKIP AHEAD           LA00209
         DROP  PL                                               LA00209
         TM    PDCTFLAG,DCTRSTRT+DCTBKSP  TEST FOR $I           LA00209
         BNO   *+8                 SKIP NEXT IF NO              LA00209
         LA    R1,=C'PAUSE'        TRAILER PAGE ID              LA00209
         NI    PCEUSER1,X'7F'      INDICATE TRAILER PAGE        LA00209
         BNE   GTEACOM             BR IF NOT                 R4 LA00209
GTEACOM  NI    PCEUSER1,X'FF'-B'01000000'  CLEAR AUTOCOM FLAG   LA00209
         CLI   PDEVTYP3,UCB3211    IF THIS CANNOT BE AN AUTOCOM,LA00209
         BNE   BLKLCNT              SKIP AHEAD                  LA00209
         L     PL,PCEDCT           GET ADDRESS OF PRINTER DCT   LA00209
         USING DCTDSECT,PL                                      LA00209
         LA    R15,AUTOCOMT        SET UP LOOP CONTROL          LA00209
         LA    R0,L'AUTOCOMT        REGISTERS TO SCAN THE       LA00209
         LA    R1,AUTOCOMZ           AUTOCOM NAMES TABLE        LA00209
GTEACOML CLI   0(R15),X'FF'        IF THIS IS AN INACTIVE ENTRY,LA00209
         BE    GTEACOMS             SKIP IT                     LA00209
         CLC   DCTDEVN,0(R15)      IF PRINTER NAME MATCHES,     LA00209
         BE    GTEACOMF             GO SET FLAG                 LA00209
GTEACOMS BXLE  R15,R0,GTEACOML     STEP TO NEXT TABLE ENTRY     LA00209
         B     BLKLCNT             THIS IS NOT AN AUTOCOM       LA00209
         DROP  PL                                               LA00209
GTEACOMF OI    PCEUSER1,B'01000000'  SET AUTOCOM FLAG           LA00209
         SPACE 1                                                LA00209
         STC   PL,PCEUSER1+1       SET SEPARATR LINES-REMAINING LA00209
         SPACE 1                                           SPR2 LA00209
         ST    R1,PLNDISPL         SAVE THE LINE DISPLACEMENT   LA00209
         TM    PCEUSER1,X'80'      SKIP BLOCK-LETTERS IF THIS   LA00209
         BNO   PDEST                IS A TRAILER PAGE           LA00209
         TM    PCEUSER1,X'40'      IF THIS IS NOT AN AUTOCOM,   LA00209
         BNO   GTEPAGE              SKIP AHEAD                  LA00209
         LA    PC1,0(R1,PBUF)      BUILD THE CCW                LA00209
         ICM   PC1,8,=X'C9'         ('DRAIN-DATA-BUFFER')       LA00209
         L     PC2,PRCCWEJ+4                                    LA00209
         MVI   0(PC1),X'0F'        SET AUTOCOM 'SJOB' CODE      LA00209
         BAL   PL,PPPUT            ADD CCW TO CHAIN             LA00209
         BAL   PL,PPWRITE          WRITE IT                     LA00209
         BAL   PL,PPCHECK          WAIT FOR COMPLETION          LA00209
         LA    R1,BUFSTART-BUFDSECT  RELOAD LINE DISPLACEMENT   LA00209
         XR    PL,PL               RELOAD LINES-REMAINING       LA00209
         IC    PL,PCEUSER1+1                                    LA00209
         SPACE 1                                                LA00209
GTEPAGE  DS    0H                                               LA00209
        $PBLOCK BUFFER=(R1),DATA=(R0),SLANT=NO CALL BLK RTNSPR2 LA00209
         SPACE 1                                                LA00209
         SPACE 1                                                LA00209
         TM    PCEID,PCELCLID      TEST FOR LOCAL PRINT         LA00209
         BO    GTESEPR             BRANCH IF LOCAL              LA00209
*        TM    PCEID,PCELCLID      TEST FOR LOCAL PRINT         LA00209
*        BZ    PRIEJECT            BRANCH IF NOT LOCAL          LA00209
*        IC    JCT,$PRIDCT         LOCAL SEPARATOR LINE CNT  R4 LA00209
*RIEJECT DS    0H                                               LA00209
         TM    PCEUSER1,X'80'      IF THIS IS A TRAILER PAGE,   LA00209
         BNO   GTESPRT2             SKIP SUBTRACT               LA00209
         BL    GTESPRT2            BRANCH IF NO                 LA00209
GTESPRT1 SH    JCT,=H'29'          SUBTRACT BLOCK LTR LINES  R4 LA00209
GTESPRT2 AL    PC1,PRCCWID         CONSTRUCT                 R4 LA00209
         B     PRNOID              SKIP AHEAD                   LA00209
         SPACE 1                                                LA00209
GTESEPR  L     PL,PWKJOE           LOAD WORK-JOE ADDRESS        LA00209
         USING JOEDSECT,PL                                      LA00209
         CLI   JOECURCL,C'0'       IF THIS IS NOT A SPURT       LA00209
         BL    GTESEPR2             CLASS, SKIP AHEAD           LA00209
         XR    JCT,JCT             LOAD NUMBER OF LINES TO      LA00209
         IC    JCT,PCEUSER1+1       PRINT                       LA00209
         TM    PCEUSER1,X'80'      IF THIS IS A HEADER PAGE,    LA00209
         BO    GTESPRT1             GO SUBTRACT BLK LTR LINES   LA00209
         B     GTESPRT2            GO PRINT THE ID LINES        LA00209
         DROP  PL                                               LA00209
         SPACE 1                                                LA00209
GTESEPR2 L     PC2,PRCCWID+4       LOAD 2ND HALF OF PRINT CCW   LA00209
         TM    PCEUSER1,X'80'      IF THIS IS A TRAILER PAGE,   LA00209
         BNO   GTETRLR              SKIP AHEAD                  LA00209
         ICM   PC1,8,=X'19'        LOAD 'PRINT,SPACE-3' CODE    LA00209
         LA    JCT,10              LOAD NUMBER OF LINES TO PRNT LA00209
         BAL   PL,PPPUT            ADD CCW TO CHAIN             LA00209
         BCT   JCT,PPPUT            (N TIMES)                   LA00209
         L     JCT,PJCTBUF         RELOAD THE JCT ADDRESS       LA00209
         XR    R1,R1               LOAD NUMBER OF               LA00209
         IC    R1,PCEUSER1+1        LINES-REMAINING             LA00209
         SH    R1,=H'63'           SUBTRACT A PAGE OF LINES     LA00209
         BNP   GTELAST             BRANCH IF NO MORE PAGES      LA00209
         STC   R1,PCEUSER1+1       SAVE NEW LINES-REMAINING     LA00209
         CLI   PDEVTYP3,UCB3800    IF THIS IS A 3800,           LA00209
         BE    GTENXTPG             BYPASS ASTERISKS            LA00209
         ICM   PC1,8,=X'C9'        LOAD 'PRINT,SKIP-CHN-9' CODE LA00209
         BAL   PL,PPPUT            ADD CCW TO CHAIN             LA00209
         L     R1,PLNDISPL         LOAD CURRENT LINE DISPLACMNT LA00209
         LA    R1,132(R1)          OBTAIN NEXT LINE DISPLACEMNT LA00209
         ST    R1,PLNDISPL         SAVE NEW LINE DISPLACEMENT   LA00209
         LA    PC1,0(R1,PBUF)      LOAD THE ASTERISK LINE ADDR  LA00209
         MVI   0(PC1),C'*'         BUILD THE ASTERISK LINE      LA00209
         MVC   1(131,PC1),0(PC1)                                LA00209
         TM    PCEUSER1,X'40'      IF THIS IS AN AUTOCOM,       LA00209
         BO    GTELAST              SKIP TO END                 LA00209
GTENXTPG ICM   PC1,8,=X'89'        LOAD 'PRINT,SKIP-CHN-1' CODE LA00209
         BAL   PL,PPPUT            ADD CCW TO CHAIN             LA00209
         BAL   PL,PPWRITE          WRITE THE BUFFER             LA00209
         BAL   PL,PPCHECK          WAIT FOR COMPLETION          LA00209
         LA    R1,BUFSTART-BUFDSECT  RESET STARTING LINE        LA00209
         ST    R1,PLNDISPL           DISPLACEMENT               LA00209
         XR    PL,PL               RELOAD THE LOCAL SEPARATOR   LA00209
         IC    PL,$PRIDCT           LINE COUNT                  LA00209
         B     GTEPAGE             GO GENERATE NEXT PAGE        LA00209
         SPACE 1                                                LA00209
GTETRLR  CLI   PCEUSER1+1,2        TEST NUM OF SEPARATOR LINES  LA00209
         BNH   GTETRL5             BRANCH IF NOT MORE THAN 2    LA00209
GTE3800L ICM   PC1,8,=X'11'        LOAD 'PRINT,SPACE-2' CODE    LA00209
         BAL   PL,PPPUT            ADD CCW TO CHAIN             LA00209
         CLI   PDEVTYP3,UCB3800    IF THIS IS NOT A 3800,       LA00209
         BNE   GTETRL0              SKIP AHEAD                  LA00209
         ICM   PC1,8,=X'19'        LOAD 'PRINT,SPACE-3' CODE    LA00209
         LA    JCT,19              LOAD NUMBER OF LINES TO PRNT LA00209
         BAL   PL,PPPUT            ADD CCW TO CHAIN             LA00209
         BCT   JCT,PPPUT            (N TIMES)                   LA00209
         XR    R1,R1               LOAD NUMBER OF               LA00209
         IC    R1,PCEUSER1+1        LINES-REMAINING             LA00209
         SH    R1,=H'63'           SUBTRACT A PAGE OF LINES     LA00209
         BNP   GTETRL9             BRANCH IF NO MORE PAGES      LA00209
         STC   R1,PCEUSER1+1       SAVE NEW LINES-REMAINING     LA00209
         ICM   PC1,8,=X'89'        LOAD 'PRINT,SKIP-CHN-1' CODE LA00209
         BAL   PL,PPPUT            ADD CCW TO CHAIN             LA00209
         B     GTE3800L            GO GENERATE NEXT PAGE        LA00209
GTETRL0  XR    R0,R0               CLEAR DIVIDEND REGISTERS     LA00209
         LR    R1,R0                                            LA00209
         IC    R1,PCEUSER1+1       LOAD NUM OF LINES-REMAINING  LA00209
         D     R0,=F'3'            CALC NUM OF LINES TO PRINT,  LA00209
         BCTR  R1,0                 MINUS 1  (R/3-1)            LA00209
         CH    R1,=H'19'           IF NOT MORE THAN ONE PAGE,   LA00209
         BNH   GTETRL1              BRANCH                      LA00209
         LA    JCT,19              LOAD NUM OF LINES FOR 1ST PG LA00209
         LA    R1,2(R1)            ADJUST LINES-REMAINING       LA00209
         B     GTETRL2             SKIP AHEAD                   LA00209
GTETRL1  LR    JCT,R1              LOAD LINES TO PRINT MINUS 1  LA00209
GTETRL2  STC   R1,PCEUSER1+1       SAVE NEW LINES-REMAINING     LA00209
GTETRL3  LTR   JCT,JCT             TEST NUM OF LINES TO PRINT   LA00209
         BNP   GTETRL5             BRANCH IF NONE               LA00209
GTETRL4  ICM   PC1,8,=X'19'        LOAD 'PRINT,SPACE-3' CODE    LA00209
         BAL   PL,PPPUT            ADD CCW TO CHAIN             LA00209
         BCT   JCT,PPPUT            (N TIMES)                   LA00209
GTETRL5  ICM   PC1,8,=X'C9'        LOAD 'PRINT,SKIP-CHN-9' CODE LA00209
         BAL   PL,PPPUT            ADD CCW TO CHAIN             LA00209
         LR    JCT,PC1             SAVE THE ID LINE ADDRESS     LA00209
         LA    PC1,132(PC1)        OBTAIN NEXT LINE ADDRESS     LA00209
         MVI   0(PC1),C'*'         BUILD THE ASTERISK LINE      LA00209
         MVC   1(131,PC1),0(PC1)                                LA00209
         TM    PCEUSER1,X'40'      IF THIS IS AN AUTOCOM,       LA00209
         BO    GTETRLA              SKIP AHEAD                  LA00209
         ICM   PC1,8,=X'19'        LOAD 'PRINT,SPACE-3' CODE    LA00209
         XR    R1,R1               LOAD NUMBER OF               LA00209
         IC    R1,PCEUSER1+1        LINES-REMAINING             LA00209
         SH    R1,=H'22'           SUBTRACT A PAGE OF LINES     LA00209
         BNP   GTETRL9             BRANCH IF NONE LEFT          LA00209
         STC   R1,PCEUSER1+1       SAVE NEW LINES-REMAINING     LA00209
         BAL   PL,PPPUT            PRINT THE ASTERISK LINE      LA00209
         LR    PC1,JCT             RELOAD THE ID LINE ADDRESS   LA00209
         CLI   PCEUSER1+1,21       IF MORE THAN ONE PAGE        LA00209
         BNL   GTETRL6              REMAINING, BRANCH           LA00209
         XR    JCT,JCT             LOAD LINES TO PRINT,         LA00209
         IC    JCT,PCEUSER1+1       MINUS 1                     LA00209
         BCTR  JCT,0                                            LA00209
         B     GTETRL3             GO PRINT NEXT TRAILER PAGE   LA00209
GTETRL6  LA    JCT,20              LOAD LINES TO PRINT, MINUS 1 LA00209
         B     GTETRL4             GO PRINT NEXT TRAILER PAGE   LA00209
GTETRLA  L     JCT,PJCTBUF         RELOAD THE JCT ADDRESS       LA00209
         ICM   PC1,8,=X'01'        LOAD 'PRINT,NO-SPACE' CODE   LA00209
         BAL   PL,PPPUT            PRINT THE ASTERISK LINE      LA00209
         BAL   PL,PPWRITE          WRITE THE BUFFER             LA00209
         BAL   PL,PPCHECK          WAIT FOR COMPLETION          LA00209
         MVI   0(PC1),X'1F'        SET AUTOCOM 'EJOB' CODE      LA00209
         ICM   PC1,8,=X'C9'        BUILD THE CCW                LA00209
         L     PC2,PRCCWEJ+4        ('DRAIN-DATA-BUFFER')       LA00209
         BAL   PL,PPPUT            ADD CCW TO CHAIN             LA00209
         B     PRNOID              SKIP AHEAD                   LA00209
GTETRL9  L     JCT,PJCTBUF         RELOAD THE JCT ADDRESS       LA00209
         SPACE 1                                                LA00209
GTELAST  ICM   PC1,8,=X'89'        LOAD 'PRINT,SKIP-CHN-1' CODE LA00209
         BAL   PL,PPPUT            ADD CCW TO CHAIN             LA00209
         SPACE 1                                                LA00209
         LA    PW,3(,PW)            PAGE                     R4 LA00209
         SPACE 2                                          @SPR2 LA00209
         SPACE 2                                          @SPR2 LA00209
         SPACE 1                                                LA00209
AUTOCOMT DC    CL8'PRINTR9 '       AUTOCOM NAME TABLE           LA00209
         DC    XL8'FF'                                          LA00209
         DC    XL8'FF'                                          LA00209
AUTOCOMZ DC    XL8'FF'                                          LA00209
PHEADER2 DS    0H                                               LA00209
         OI    PCEUSER1,X'80'      INDICATE HEADER PAGE         LA00209
         L     R15,=A(PRINTID)     PRODUCE PRINTER         G38E LA00209
./       ENDUP
$$
//
./       ADD   NAME=LA00210A
//SSUD210A JOB (M,AJNJ,S610C021),04542HMD,CLASS=A,NOTIFY=SSUD,
//  MSGCLASS=O ,TYPRUN=HOLD
//*ACCT        HOWARD DEAN,SSU
/*ROUTE  PRINT U90
/*JOBPARM  S=ANY,L=999
//***
//***    SYS PROG: H.M. DEAN
//***    DATE:     04/09/83
//***    LOCATION: SYST.LOCLMODS.CNTL(LA00210A)
//***    DESC:     HASPCON, HASPSSM JES OUTPUT TO TSO
//***              NOTE: THIS MOD IS FOR MVS/SP 1.2 JES2 (HJE2226)
//***
//***          WARNING!! DO NOT RENUMBER THIS DATA SET
//***          IT CONTAINS SOURCE UPDATE TEXT THAT MAY
//***          BE RUINED IF RENUMBERED.
//***
//***
//SMP      EXEC PUTSMP,OPT=200,REGION=3600K
//SMPCNTL  DD *
   RECEIVE S(LA00210).
   APPLY   S(LA00210) DIS(WRITE).
//SMPPTFIN DD DATA,DLM=$$
++USERMOD  (LA00210)  /* HASPCON  AND HASPSSSM JES OUTPUT TO TSO
     *****************************************************************
     *                                                               *
     *       GTEDS: MARINA DEL REY, CALIFORNIA                       *
     *                                                               *
     *       DATE: 04/09/83  BY: H.M. DEAN                           *
     *                                                               *
     *       RELEASE         - OS/MVS 3.8                            *
     *       ENVIRONMENT     - 16MB IBM 3033, 16MB AMDAHL V8         *
     *                         24MB IBM 3081                         *
     *                                                               *
     *       PTF LEVEL       - 8209 (FMID HJE2226)                   *
     *                                                               *
     *       USERMOD         - LA00210                               *
     *       JOBNAME         - LA00210A                              *
     *       TYPE            - SRC UPDATE                            *
     *                                                               *
     *       PRODUCT         - MVS/SP 1.3 JES2 (HJE2226 - 5740XYS)   *
     *       MODULE          - HASPCON, HASPSSSM                     *
     *       CSECT           - SEE ABOVE                             *
     *                                                               *
     *       PROBLEM         - PROVIDE A MEANS TO ENTER JES2         *
     *                         COMMANDS AND RECEIVE RESPONSE         *
     *                         VIA TSO OPERATOR COMMANDS.            *
     *                                                               *
     *       PURPOSE/        - MODS TO HASPCON AND HASPSSSM          *
     *       ENHANCEMENT       PROVIDE A WAY TO RECIEVE RESPONSES    *
     *                         TO JES2 COMMANDS FROM TSO TERMINALS.  *
     *****************************************************************
     */.
++VER (Z038) FMID(HJE2226)
             PRE(UZ37266,UZ52546,UZ54839,
                 UZ57914,UZ58547,UZ59743,
                 TT90004).
++SRCUPD  (HASPCON) DISTLIB(HASPSRC).
./  CHANGE NAME=HASPCON                                         LA00210
         CLI   CMBUSER+7,0            BRANCH IF RESPONSE        LA00210
         BE    WTPUT                     TO TIME SHARING USER   LA00210
         SPACE 1                                                LA00210
WTPUT    DS    0H                                               LA00210
         MVI   CMBUSER+7,C' '         ENSURE VALID USERID       LA00210
         OI    CSACONCT,1             SUPRESS WTO               LA00210
         IC    R2,CMBML               COMPUTE TEXT              LA00210
         SH    R2,=Y(CMBJOBID-CMBMSG+L'CMBMID) LENGTH           LA00210
         BNP   WNRMFRE                IGNORE IF INVALID CMB     LA00210
         CH    R2,=H'99'              REDUCE TO MAXIMUM         LA00210
         BNH   WTPUT01                  IF TOO LARGE            LA00210
         LA    R2,99                  MAXIMUM MESSAGE SIZE      LA00210
WTPUT01  DS    0H                                               LA00210
         MVC   CMBMID(L'CMBMSG-(CMBJOBN-CMBMSG)),CMBJOBN        LA00210
         LR    R4,R1                  SAVE ADDR OF CMB          LA00210
         USING CMBDSECT,R4            SWITCH CMB ADDRESSIBILITY LA00210
         CLC   CMBFM,$SYSID           SKIP ADDITIONAL EDIT      LA00210
         BE    WTNOEDIT               IF ON OUR MACHINE         LA00210
         CLI   CMBJOBID,C' '          SKIP ADDITIONAL EDIT      LA00210
         BNE   WTNOEDIT               IF SENDER FILLED IN JOBID LA00210
         MVC   CMBJOBID(8),=C'     M0 '  ASSUME  FROM OUR NODE  LA00210
         CLC   CMBFMNOD,$OWNNODE      SKIP NODE EDIT IF     @HMDLA00210
         BE    WTNONODE               SENDER IS OUR NODE    @HMDLA00210
         MVC   CMBJOBID(8),$BLANKS    CLEAR CMBJOBID FIELD  @HMDLA00210
         MVC   CMBJOBID(6),=X'D52020202040'     BUILD       @HMDLA00210
         SR    R0,R0                     NXXXX              @HMDLA00210
         LH    R0,CMBFMNOD                PORTION           @HMDLA00210
         CVD   R0,#DOUBLE                   OF MESSAGE      @HMDLA00210
         MVO   #DOUBLE,#DOUBLE           ALIGN              @HMDLA00210
         LA    R1,CMBJOBID+1             ASSUME NO SIGNIFICANCE LA00210
         EDMK  CMBJOBID(5),#DOUBLE+5     TO EBCDIC          @HMDLA00210
         MVC   CMBJOBID+1(5),0(R1)    SHIFT OUT LEADING ZEROES  LA00210
         MVI   CMBJOBID+5,C'M'           SET MEMBER INDICATE    LA00210
         MVI   CMBJOBID+6,C'0'           SET MEMBER NUMBER  @HMDLA00210
WTNONODE MVN   CMBJOBID+6(1),CMBFMQUL    SET MEMBER NUMBER  @HMDLA00210
         MVC   CMBJOBID+8(L'CMBMSG-(CMBMID-CMBMSG)),CMBMID  @HMDLA00210
         SH    R2,=Y(CMBMID-(CMBJOBID+8))  REDUCE BY SHIFT AMT. LA00210
         SPACE 2                                                LA00210
WTNOEDIT LA    R1,CMBJOBID               ADDR OF TEXT BEGIN     LA00210
         TPUT  (1),(R2),EDIT,NOWAIT,USERIDL=CMBUSER             LA00210
         LR    R1,R4                     RESTORE ADDR OF CMB    LA00210
         B     WNRMFRE                   EXIT AND FREE CMB      LA00210
         SPACE 2                                                LA00210
         DROP  R4                                               LA00210
#DOUBLE  EQU   CSADSECT,8                DOUBLE WORD WORK AREA  LA00210
./ ENDUP                                                        LA00210
++SRCUPD  (HASPSSSM) DISTLIB(HASPSRC).
./  CHANGE NAME=HASPSSSM                                        LA00210
         CLI   SSCMSCID-SSCMBGN(R9),0     CHECK FOR ZEROS       LA00210
         TM    SSCMSCID+2-SSCMBGN(R9),X'80'     IS IT FROM TSO  LA00210
         BNO   S34NTS                           NO - BRANCH     LA00210
         L     R1,PSATOLD-PSA              ADDR OF CURRENT TCB  LA00210
         L     R1,TCBJSCB-TCB(,R1)         ADDR OF JSCB         LA00210
         L     R1,JSCBACT-IEZJSCB(,R1)     ADDR OF ACTIVE JSCB  LA00210
         ICM   R1,15,JSCBPSCB-IEZJSCB(R1)  ADDR OF PSCB (TSO)   LA00210
         BZ    S34NUCM                     NOT REALLY TSO       LA00210
         MVC   CMBUSER(7),PSCBUSER-PSCB(R1)    MOVE TSO USERID  LA00210
         NI    CMBFLAG,X'FF'-S34F7         TURN ON AUTHORITY    LA00210
         OI    CMBFLAG,CMBFLAGT                 SET TSO FLAG    LA00210
         B     S34NUCM                     SKIP UCM CODE        LA00210
S34NTS   NULL  ,                           SKIP T/S CODE        LA00210
./  ENDUP                                                       LA00210
$$
//
