//* THE FOLLOWING PROCEDURE MUST BE ADDED TO SYS1.PROCLIB
//GTFMUSE PROC K=34
//IEFPROC EXEC PGM=IHLGTF,REGION=&K.K,
//             PARM='MODE=EXT,DEBUG=NO,TIME=NO'
//IEFRDER  DD  DSNAME=SYS1.TRACE,DISP=(NEW,KEEP)
//SYSPRINT DD  SYSOUT=1,SPACE=(TRK,(1,1))
//SYSLIB   DD  DSNAME=SYS1.PARMLIB(GTFMUSE),DISP=SHR
//* THE FOLLOWING MEMBER MUST BE ADDED TO SYS1.PARMLIB
TRACE=SVC
//* THE FOLLOWING PROCEDURE MUST BE ADDED TO THE PROCEDURE LIBRARY USED
//* BY APPLICATION PROGRAMS
//AMUSE  PROC
//AMUSE  EXEC  PGM=MODUSE,PARM='ISASIZE(50K)',REGION=120K
//CMDLIB   DD  DSN=TSO.CMDLIB,DISP=SHR
//LINKLIB  DD  DSN=SYS1.LINKLIB,DISP=SHR
//         DD  DSN=SYS1.TLINKLIB,DISP=SHR
//         DD  DSN=SYS1.PLIO,DISP=SHR
//         DD  DSN=SYS1.TRANSLIB,DISP=SHR
//         DD  DSN=SYS1.PL1,DISP=SHR
//         DD  DSN=SYS1.COBOL,DISP=SHR
//         DD  DSN=SYS1.FORTH,DISP=SHR
//         DD  DSN=SYS1.FORTG,DISP=SHR
//         DD  DSN=SYS1.TSOPRCSR,DISP=SHR
//         DD  DSN=SYS1.PROCESOR,DISP=SHR
//         DD  DSN=SYS1.COBOLU,DISP=SHR
//         DD  DSN=SYS1.EDITOR,DISP=SHR
//STEPLIB  DD  DSN=SYS1.SERVLIB,DISP=SHR
//SVCLIB   DD  DSN=SYS1.SVCLIB,DISP=SHR
//SYSPRINT DD  SYSOUT=A,DCB=(RECFM=VBA,LRECL=137,BLKSIZE=996)
//* END OF JCL
