)ATTR
# TYPE(OUTPUT) INTENS(HIGH) JUST(LEFT)
)BODY
%---------- UPDATE A DATASET ON PANVALET FROM TSO / SPF-----------------
%ENTER/VERIFY PARAMETERS BELOW:+       PRESS %PF3+TO END
+
+PANVALET NAME %==>_NAMEPAN                 +
+                   % #MSG1
+SPF LIBRARY:
+   PROJECT%==>_PRJ1    +
+   LIBRARY%==>_LIB1    +
+   TYPE   %==>_TYP1    +
+   MEMBER %==>_MEMBER  +
+
+OTHER FULLY QUALIFIED PARTITIONED OR SEQUENTIAL DATASET NAME:
+   DATASET NAME %==>_DSN
+   DATASET TYPE %==>_TYPE   +
+   MEMBER NAME  %==>_OTHMEM  + (OPTIONAL - FOR PARTITIONED ONLY)
+
+DO YOU WANT TO DELETE THE DATASET AFTER UPDATING ON PANVALET?%YES/NO==>
+
+RESULTS:×#TEXT1
+        ×#TEXT2
+        ×#TEXT3
+        ×#TEXT4
+        ×#TEXT5
)INIT
 &DSN=''
 &OK =NO
 &TYPE=''
 &LIB1=''
 &OTHMEM=''
 &MEMBER=''
 &NAMEPAN=''
.HELP=PUHELP0
)PROC
IF (&DSN ^= ' ')
     VER (&DSN,DSNAME)
     VER(&TYPE,NONBLANK,MSG=PAN032)
     VER(&TYPE,LIST,CLIST,VSBASIC,DATA,PLI,PL1,TEXT,FORT,CNTL,
           ASM,OBJ,MSG=PAN032)
IF (&DSN=' ')
     VER (&PRJ1,NONBLANK,MSG=PAN036)
     VER (&LIB1,NONBLANK,MSG=PAN036)
     VER (&TYP1,NONBLANK,MSG=PAN036)
     VER (&MEMBER,NAME,MSG=PAN003)
     VER (&PRJ1,NAME,MSG=PAN003)
     VER (&LIB1,NAME,MSG=PAN003)
     VER (&TYP1,NAME,MSG=PAN003)
VER (&NAMEPAN,NONBLANK,MSG=PAN005)
VER (&OK,NONBLANK)
VER (&OK,LIST,YES,NO)
)END
