%-------------------   PROJECT2 SPF  INTERFACE  ------------------------
+                                                  PRESS %PF3+TO END
%ENTER NAME OF THE PROJECT2 DATASETS:
+DD2     DATASET %==>_P2DD2   +
+DD1     DATASET %==>_P2DD1   +      (OPTIONAL)
+FILE 11 DATASET %==>_P2INDS  +      (OPTIONAL)
+FILE 7  DATASET %==>_P2OUTP  +      (OPTIONAL)
+
+ PROJECT 2 PASSWORD %==>_P2PSW   +  REQUIRED
+
+  PRINTER LOCATION:%==> _P2PRINT +      PLOTTER LOCATION:%==>_P2PLOT+
+  ENTER %SYS +FOR BERLIN                 ENTER  %NO   +FOR NO PLOTS
+        %CY  +FOR CONN YANKEE                   %12   +FOR BERLIN 12" W
+        %MP1 +FOR MILLSTONE1(HP)                %35   +FOR BERLIN 35" W
+        %MP2 +FOR MILLSTONE2(ENGR OFF.)         %CY   +FOR CONN YANKEE
+        %MP3 +FOR MILLSTONE3(CPF)               %MP   +FOR MILLSTONE
+        %SB  +FOR SOUTH BROAD STREET
+        %NUS +FOR NU SOUTH
+        %CPF +FOR MP3 CPF SECOND FLOOR
+        %CYE +FOR CY EOF
+
+PROJECT2 VERSION %==>_P2VER+
)INIT
.CURSOR = P2DD2
IF (&P2PRINT = ' ')
    &P2PRINT=SYS
IF (&P2PLOT = ' ')
    &P2PLOT = NO
&P2VER = 82A5
)PROC
  VER (&P2PSW,NONBLANK)
  VER (&P2PRINT,LIST,SYS,CY,MP1,MP2,MP3,SB,NUS,CPF,CYE)
  VER (&P2DD1,DSNAME)
  VER (&P2DD2,DSNAME)
  VER (&P2DD2,NONBLANK)
  VER (&P2INDS,DSNAME)
  VER (&P2OUTP,DSNAME)
  VER (&P2PLOT,LIST,NO,12,35,MP,CY,ZT)
  VER (&P2VER,LIST,82A1,82A5,82A8,82B2)
)END
