         TITLE 'IGG09403 - TIME SHARING END MESSAGE'
IGG09403 CSECT
         COPY  LCGASMS2
**********************************************************************
*
*01* MODULE-NAME = IGG09403
*
*01*  DESCRIPTIVE-NAME = TIME SHARING END MESSAGE
*
*01* COPYRIGHT = NONE
*
*01* STATUS = 00
*
*01* FUNCTION = LIST FORM OF WTO MESSAGE FOR IGG09402
*
*01* NOTES = N/A
*
*01* RESTRICTIONS = N/A
*
*02*   DEPENDENCIES = NONE
*
*02*   RESTRICTIONS = NONE
*
*02*   REGISTER-CONVENTIONS = N/A
*
*02*   PATCH-LABEL = PTCHAREA
*
*01* MODULE-TYPE = ASSEMBLER LANGUAGE CSECT
*
*02*   PROCESSOR = SEE LISTING
*
*02*   ATTRIBUTES = N/A
*
*01* ENTRY-POINT = N/A
*
*02*   PURPOSE = SEE FUNCTION
*
*02*   LINKAGE = VIA LINKAGE EDITOR
*
*01* INPUT = N/A
*
*01* OUTPUT = N/A
*
*01* EXIT-NORMAL = N/A
*
*01* EXIT-ERROR = N/A
*
*01* EXTERNAL REFERENCES = NONE
*
*02*   CONTROL-BLOCKS = NONE
*
*01* TABLES = NONE
*
*01* MACROS = WTO (LIST FORM)
*
*01* CHANGE-ACTIVITY
*
**********************************************************************
         SPACE 3
         ENTRY MSGLIST
         ENTRY IKJ409I
MSGLIST  WTO   'IKJ405I TIME SHARING ENDED',ROUTCDE=2,DESC=5,MF=L
         SPACE 3
IKJ409I  WTO   'IKJ409I SYSTEM ERROR - TIME SHARING TERMINATED',       X
               ROUTCDE=(2),DESC=(5),MF=L
         SPACE 3
PTCHAREA DC    9F'0'                    PATCH AREA
         END
