         TITLE 'IDCRD06:IDCAMS REPAIRV SERVICE MODULE                  *
                        '
        MACRO
        GETMAIN &R,&LV=
        L     REG15,0(REG1)           GDTTBL ADDRESS
        L     REG15,GDTPRL(REG15)     PROL ROUTINE ADDRESS
        CNOP  2,4                     BOUNDARY ALIGNMENT
        LA    REG14,*+14              RETURN ADDRESS
        BALR  REG1,REG15              LINKAGE TO PROL ROUTINE
        DC    A(MODID)                MODULE ID ADDRESS
        DC    A(@SIZDATD)             AUTOMATIC STORAGE SIZE ADDRESS
        MEND
IDCRD06  CSECT ,                                                   0002
@MAINENT DS    0H                                                  0002
         USING *,@15                                               0002
         B     @PROLOG                                             0002
         DC    AL1(16)                                             0002
         DC    C'IDCRD06   77.300'                                 0002
         DROP  @15
@PROLOG  STM   @14,@12,12(@13)                                     0002
         BALR  @09,0                                               0002
@PSTART  LA    @10,4095(,@09)                                      0002
         LA    @11,4095(,@10)                                      0002
         LA    @12,4095(,@11)                                      0002
         USING @PSTART,@09                                         0002
         USING @PSTART+4095,@10                                    0002
         USING @PSTART+8190,@11                                    0002
         USING @PSTART+12285,@12                                   0002
         L     @00,@SIZDATD                                        0002
         GETMAIN  R,LV=(0)
         LR    @08,@01                                             0002
         USING @DATD,@08                                           0002
         ST    @13,@SA00001+4                                      0002
         LM    @00,@01,20(@13)                                     0002
         ST    @08,8(,@13)                                         0002
         LR    @13,@08                                             0002
         MVC   @PC00001(12),0(@01)                                 0002
        ST    1,LISTPTR
        ST    1,LISTSCAN
*   DO LISTLN=1 TO 255 WHILE(LISTTEST='0'B);                       0310
         LA    LISTLN,1                                            0310
@DL00310 L     @03,LISTSCAN                                        0310
         TM    LISTTEST(@03),B'10000000'                           0310
         BNZ   @DC00310                                            0310
*     LISTSCAN=LISTSCAN+4;                                         0311
         AL    @03,@CF00044                                        0311
         ST    @03,LISTSCAN                                        0311
*   END;                                                           0312
         AL    LISTLN,@CF00220                                     0312
         C     LISTLN,@CF00986                                     0312
         BNH   @DL00310                                            0312
@DC00310 DS    0H                                                  0313
*   DCL                                                            0313
*     1 IFGRPL BASED,               /* LEVEL ONE DECLARE             */
*      2 RPLCOMN,                   /* RPL COMMON SECTION X03004     */
*       3 RPLIDWD CHAR(4),          /* ID WORD OF RPL                */
*        4 RPLID BIT(8),            /* IDENT & HEADER TYPE           */
*        4 RPLSTYP PTR(8),          /* SUBTYPE                       */
*        4 RPLREQ PTR(8),           /* REQUEST TYPE                  */
*        4 RPLLEN PTR(8),           /* LENGTH OF THIS BLOCK          */
*         5 RPLLEN2 PTR(8),         /* LENGTH OF THIS BLOCK X03004   */
*       3 RPLPLHPT PTR(31),         /* PTR TO PLACEHOLDER            */
*       3 RPLECB PTR(31),           /* EXTERNAL ECB PTR OR INTERNAL
*                                      ECB                           */
*         5 RPLWAIT BIT(1),         /* EVENT WAITED ON               */
*         5 RPLPOST BIT(1),         /* EVENT COMPLETE                */
*       3 RPLFDBWD PTR(31),         /* FEEDBACK WORD@X04SVHS         */
*        4 RPLSTAT BIT(8),          /* CURRENT RPL STATUS            */
*        4 RPLFDBK PTR(24),         /* FEEDBACK AREA                 */
*         5 RPLRTNCD PTR(8),        /* RPL RETURN CODE               */
*          6 RPLERREG PTR(8),       /* SAME AS RPLRTNCD RECEIVED   0313
*                                      X3004BS                       */
*         5 RPLCNDCD BIT(16) BDY(BYTE),/* RPL CONDITION X3004BS      */
*          6 RPLCMPON PTR(8),       /* COMPONENT ISSUING CODE(VSAM)  */
*           7 RPLFDB2 PTR(8),       /* REASON CODE(VTAM) X03004      */
*            8 RPLERLK BIT(1),      /* ERROR LOCK SET X03004         */
*            8 RPLRVID BIT(1),      /* RVI RECEIVED X03004           */
*            8 RPLATND BIT(1),      /* ATTENTION RECEIVED X03004     */
*            8 RPLDVUNS BIT(1),     /* DEVICE UNUSEABLE X03004       */
*            8 RPLIOERR BIT(1),     /* I/O ERROR - 0=INPUT/ 1=OUTPUT
*                                      X03004                        */
*            8 RPLDLGFL BIT(1),     /* DIALOG INITIATION FAILED    0313
*                                      X03004                        */
*            8 RPLCUERR BIT(1),     /* CONTROL UNIT FAILURE X03004   */
*            8 RPLSTSAV BIT(1),     /* SENSE BYTES PRESENT X03004    */
*          6 RPLERRCD PTR(8),       /* ERROR CODE(VSAM)              */
*           7 RPLFDB3 PTR(8),       /* DATA FLAGS(VTAM) X03004       */
*            8 RPLUINPT BIT(1),     /* UNSOLICITED INPUT X03004      */
*            8 RPLSV32 BIT(1),      /* RESERVED X03004               */
*            8 RPLREOB BIT(1),      /* END OF BLOCK X03004           */
*            8 RPLREOM BIT(1),      /* END OF MESSAGE X03004         */
*            8 RPLREOT BIT(1),      /* END OF TRANSMISSION X03004    */
*            8 RPLLGFRC BIT(1),     /* LOGOFF RECEIVEDX03004         */
*            8 RPLRLG BIT(1),       /* LEADING GRAPHICS RECEIVED   0313
*                                      X03004                        */
*            8 RPLRDSOH BIT(1),     /* START-OF-HEADER (SOH) RECEIVED
*                                      X03004                        */
*       3 RPLKEYLE FIXED(15),       /* KEY LENGTH (PROC=GEN)         */
*        4 RPLKEYL FIXED(15),       /* SAME AS RPLKEYLE              */
*       3 RPLSTRID FIXED(15),       /* STRING IDENTIFIER             */
*       3 RPLCCHAR PTR(31),         /* CONTROL CHAR POINTER          */
*       3 RPLDACB PTR(31),          /* DATA ACB POINTER              */
*       3 RPLTCBPT PTR(31),         /* TCB POINTER                   */
*       3 RPLAREA PTR(31),          /* DATA AREA POINTER             */
*       3 RPLARG PTR(31),           /* SEARCH ARGUMENT PTR           */
*        4 RPLSAF PTR(16),          /* SOURCE ADDRESS FIELD X03004   */
*        4 RPLDAF PTR(16),          /* DESTINATION ADDRESS FIELD   0313
*                                      X03004                        */
*       3 RPLOPTCD BIT(32),         /* OPTION CODES                  */
*        4 RPLOPT1 BIT(8),          /* OPTION BYTE 1                 */
*         5 RPLLOC BIT(1),          /* LOCATE MODE MOVE MODE IF OFF  */
*         5 RPLDIR BIT(1),          /* DIRECT SEARCH ACCESS          */
*         5 RPLSEQ BIT(1),          /* SEQUENTIAL ACCESS             */
*         5 RPLSKP BIT(1),          /* SKIP SEQ ACCESS               */
*         5 RPLASY BIT(1),          /* ASYNCHRONOUS REQUEST SYNCH IF
*                                      OFF                           */
*         5 RPLKGE BIT(1),          /* SEARCH KEY GT/EQ SEARCH KEY EQ
*                                      IF OFF                        */
*         5 RPLGEN BIT(1),          /* GENERIC KEY REQUEST FULL KEY
*                                      IF OFF                        */
*         5 RPLECBSW BIT(1),        /* EXTERNAL ECB                  */
*          6 RPLECBIN BIT(1),       /* SAME AS RPLECBSW X03004       */
*        4 RPLOPT2 BIT(8),          /* OPTION BYTE 2                 */
*         5 RPLKEY BIT(1),          /* KEYED ACCESS                  */
*         5 RPLADR BIT(1),          /* ACCESS BY LOCATION            */
*          6 RPLADD BIT(1),         /* SAME AS RPLADR                */
*         5 RPLCNV BIT(1),          /* CINV ACCESS (BY RBA)          */
*         5 RPLBWD BIT(1),          /* FWD=0/BWD=1           @X04SVHS*/
*         5 RPLLRD BIT(1),          /* ARD=0/LRD=1           @X04SVHS*/
*         5 * BIT(1),               /* RESERVED              @X04SVHS*/
*         5 RPLUPD BIT(1),          /* UPDATE IF ON                  */
*         5 RPLNSP BIT(1),          /* NOTE STRING POSITION          */
*        4 RPLOPT3 BIT(8),          /* OPTION BYTE 3                 */
*         5 RPLEODS BIT(1),         /* END OF USER SYSOUT            */
*         5 RPLSFORM BIT(1),        /* SPECIAL FORM ON REMOTE PRINTER*/
*         5 RPLBLK BIT(1),          /* BLOCK=1,UNBLOCKED=0 FIXED   0313
*                                      BLOCK PROCESSING X04SVHS      */
*         5 RPLVFY BIT(1),          /* UCS/FCB VERIFY=1              */
*         5 RPLFLD BIT(1),          /* UCS FOLD=1                    */
*         5 RPLFMT BIT(2),          /* FORMAT TYPE 00=UCS LOAD 01=FCB
*                                      LOAD 10-11 RESERVED           */
*         5 RPLALIGN BIT(1),        /* 0=DO NOT ALIGN FCB BUFFER   0313
*                                      LOADS 1=ALIGN BUFFER AND    0313
*                                      NOTIFY OPERATOR               */
*        4 RPLOPT4 BIT(8),          /* OPTION BYTE 4                 */
*       3 RPLNXTRP PTR(31),         /* CHAIN TO NEXT RPL             */
*        4 RPLCHAIN PTR(31),        /* SAME AS RPLNXTRP              */
*       3 RPLRLEN PTR(31),          /* LENGTH OF RECORD              */
*       3 RPLBUFL PTR(31),          /* USER BUFFER SIZE              */
*       3 RPLOPTC2 BIT(32),         /* VTAM OPTIONS X03004           */
*        4 RPLOPT5 BIT(8),          /* OPTION BYTE 5 X03004          */
*         5 RPLDLGIN BIT(1),        /* 1 = CS / 0 = CA X03004        */
*         5 RPLSSNIN BIT(1),        /* 1 = CD / 0 = ED X03004        */
*         5 RPLPSOPT BIT(1),        /* 1 = PASS/0 = RELEASE X03004   */
*         5 RPLWRTYP BIT(3),        /* WRITE TYPE X03004             */
*          6 RPLNERAS BIT(1),       /* WRITE NO ERASE X03004         */
*          6 RPLEAU BIT(1),         /* WRITE EAU X03004              */
*          6 RPLERACE BIT(1),       /* WRITE WITH ERASE X03004       */
*         5 RPLNODE BIT(1),         /* 1=ANY/0=SPEC X03004           */
*         5 RPLWROPT BIT(1),        /* 1=CONV/0=NCONV X03004         */
*        4 RPLOPT6 BIT(8),          /* OPTION BYTE 6 X03004          */
*         5 RPLUNTYP BIT(3),        /* UNIT TYPE X03004              */
*          6 RPLEOB BIT(1),         /* WRITE = BLK X03004            */
*          6 RPLEOM BIT(1),         /* WRITE = LBM X03004            */
*          6 RPLEOT BIT(1),         /* WRITE = LBT X03004            */
*         5 RPLCOND BIT(1),         /* CONDITIONAL X03004            */
*         5 RPLNCOND BIT(1),        /* UNCONDITIONAL X03004          */
*         5 RPLLOCK BIT(1),         /* LOCK X03004                   */
*         5 RPLRSV67 BIT(1),        /* RESERVED X03004               */
*         5 RPLRSV68 BIT(1),        /* RESERVED X03004               */
*        4 RPLOPT7 BIT(8),          /* OPTION BYTE 7 X03004          */
*         5 RPLCNOPT BIT(3),        /* CONNECTION OPTION X03004      */
*          6 RPLCNALL BIT(1),       /* CONALL X03004                 */
*          6 RPLCNANY BIT(1),       /* CONANY X03004                 */
*          6 RPLCNIMM BIT(1),       /* RESERVED FOR CONIMM X03004    */
*         5 RPLQOPT BIT(1),         /* 1 = Q / 0 = NQ X03004         */
*         5 RPLTPOST BIT(1),        /* RPL ALREADY UNDER PSS @XM08790*/
*         5 RPLRLSOP BIT(1),        /* 1 = RELQ / 0 = NRELQ X03004   */
*         5 RPLRSV77 BIT(1),        /* RESERVED X03004               */
*         5 RPLRSV78 BIT(1),        /* RESERVED X03004               */
*        4 RPLOPT8 BIT(8),          /* OPTION BYTE 8 X03004          */
*         5 RPLODACQ BIT(1),        /* ACQUIRE X03004                */
*         5 RPLODACP BIT(1),        /* ACCEPT X03004                 */
*         5 RPLODPRM BIT(1),        /* PREEMPT X03004                */
*         5 RPLPEND BIT(1),         /* PEND X03004                   */
*         5 RPLSESS BIT(1),         /* SESSION X03004                */
*         5 RPLACTV BIT(1),         /* ACTIVE X03004                 */
*         5 RPLUNCON BIT(1),        /* UNCONDL X03004                */
*         5 RPLRSV88 BIT(1),        /* RESERVED X03004               */
*       3 RPLRBAR CHAR(8)           /* RBA RETURN LOCATION           */
*             BDY(WORD),                                           0313
*        4 RPLAIXPC PTR(16),        /* AIX POINTER COUNT     @X04SVHS*/
*        4 RPLAIXID BIT(8),         /* AIX POINTER TYPE      @X04SVHS*/
*         5 RPLAXPKP BIT(1),        /* RBA=0/PRIME=1         @XM07761*/
*         5 * BIT(7),               /* RESERVED              @X04SVHS*/
*        4 * BIT(8),                /* RESERVED              @X04SVHS*/
*        4 RPLDDDD PTR(32),         /* RELATIVE BYTE ADDRESS         */
*       3 RPLEXTDS BIT(8),          /* EXIT DEFINITIONS X03004       */
*        4 RPLEXTD1 BIT(8),         /* SAME AS RPLEXTDS X03004       */
*         5 RPLEXSCH BIT(1),        /* EXIT SCHEDULED X03004         */
*         5 RPLNEXIT BIT(1),        /* NO EXIT SPECIFIED X03004      */
*         5 RPLEXIT BIT(1),         /* ASYNCH EXIT           @XM01127*/
*         5 * BIT(2),               /* RESERVED              @XM01127*/
*         5 RPLNIB BIT(1),          /* ARG HAS NIB POINTER IF ON   0313
*                                      X03004                        */
*         5 RPLBRANC BIT(1),        /* BRANCH ENTRY TO MACRO IF ON 0313
*                                      X03004                        */
*       3 RPLACTIV BIT(8),          /* ACTIVE INDICATOR            0313
*                                      FF=ACTIVE/00=INACTIVE         */
*       3 RPLEMLEN PTR(16),         /* ERROR MESSAGE AREA LENGTH     */
*       3 RPLERMSA PTR(31);         /* PTR TO ERR MSG AREA           */
*   DCL                                                            0314
*     RPLGET PTR(8) CONSTANT(0);    /* GET REQUEST           @X04SVHS*/
*   DCL                                                            0315
*     RPLPUT PTR(8) CONSTANT(1);    /* PUT REQUEST           @X04SVHS*/
*   DCL                                                            0316
*     RPLCHECK PTR(8) CONSTANT(2);  /* CHECK REQUEST         @X04SVHS*/
*   DCL                                                            0317
*     RPLPOINT PTR(8) CONSTANT(3);  /* POINT REQUEST         @X04SVHS*/
*   DCL                                                            0318
*     RPLENDRE PTR(8) CONSTANT(4);  /* ENDREQ REQUEST@X04SVHS        */
*   DCL                                                            0319
*     RPLERASE PTR(8) CONSTANT(5);  /* ERASE REQUEST         @X04SVHS*/
*   DCL                                                            0320
*     RPLVERIF PTR(8) CONSTANT(6);  /* VERIFY REQUEST@X04SVHS        */
*   DCL                                                            0321
*     RPLPFMTD PTR(8) CONSTANT(8);  /* DATA PREFORMAT@X04SVHS        */
*   DCL                                                            0322
*     RPLPFMTI PTR(8) CONSTANT(9);  /* INDEX PREFORMAT       @X04SVHS*/
*   DCL                                                            0323
*     RPLFRCIO PTR(8) CONSTANT(10); /* FORCE I/O REQUEST     @X04SVHS*/
*   DCL                                                            0324
*     RPLGETIX PTR(8) CONSTANT(11); /* GETIX REQUEST@X04SVHS         */
*   DCL                                                            0325
*     RPLPUTIX PTR(8) CONSTANT(12); /* PUTIX REQUEST@X04SVHS         */
*   DCL                                                            0326
*     RPLSRCHB PTR(8) CONSTANT(13); /* SRCHBFR REQUEST       @X04SVHS*/
*   DCL                                                            0327
*     RPLMRKB PTR(8) CONSTANT(14);  /* MRKBFR REQUEST        @X04SVHS*/
*   DCL                                                            0328
*     RPLWRTB PTR(8) CONSTANT(15);  /* WRTBFR REQUEST        @X04SVHS*/
*   RFY                                                            0329
*     IFGRPL BASED(IOCRPL);                                        0329
*                                                                  0330
*   /*****************************************************************/
*   /*                                                               */
*   /* REPAIRV COMMUNICATIONS REGION                                 */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0330
*   DCL                                                            0330
*     1 REPTBL,                                                    0330
*      2 REPCB,                                                    0330
*       3 REPRESER CHAR(12),        /* SPACE FOR IDENTIFER REPTBL    */
*       3 REPARFIO PTR(31),         /* PTR TO IOCSTR FOR ALTERNATE 0330
*                                      REPORT FILE                   */
*       3 REPIRWIO PTR(31),         /* PTR TO IOCSTR FOR IN REPAIR 0330
*                                      WORK FILE                     */
*       3 REPORWIO PTR(31),         /* PTR TO IOCSTR FOR OUT REPAIR
*                                      WORK FILE                     */
*       3 REPIDSOP PTR(31),         /* PTR TO IOCTLBK FOR IN FILE    */
*       3 REPODSOP PTR(31),         /* PTR TO IOCTLBK FOR OUT DS     */
*       3 REPIDSAR PTR(31),         /* PTR TO UEXCP READ ARGUMENT  0330
*                                      LIST FOR INPUT DATA SET       */
*       3 REPODSAR PTR(31),         /* PTR TO UEXCP READ ARGUMENT  0330
*                                      LIST FOR OUTPUT DATA SET      */
*       3 REPSPRIT PTR(31),         /* PTR TO IDCRDPT ARG LIST       */
*       3 REPIBFPT PTR(31),         /* PTR TO IN BUFFER FOR FILE     */
*       3 REPOBFPT PTR(31),         /* PTR TO OUT BUFFER FOR DS      */
*       3 REPBUFF0 PTR(31),         /* PTR TO IN BUFFER FOR REPAIR 0330
*                                      WORK FILE                     */
*       3 REPBUFF1 PTR(31),         /* PTR TO OUT BUFFER TO REPAIR 0330
*                                      WORK FILE                     */
*       3 REPRWHDI PTR(31),         /* PTR TO INPUT REPAIR WORK FILE
*                                      HEADER RECORD                 */
*       3 REPRWHDO PTR(31),         /* PTR TO OUTPUT REPAIR WORK FILE
*                                      HEADER RECORD                 */
*       3 REPINCL PTR(31),          /* TO CLOSE INPUT                */
*       3 REPOUTCL PTR(31),         /* TO CLOSE OUTPUT               */
*       3 REPIXTN2 PTR(31),         /* ADDR OF INPUT XTNTTBL2        */
*       3 REPIXTNT PTR(31),         /* ADDR OF INPUT XTNTTBL         */
*       3 REPOXTN2 PTR(31),         /* ADDR OF OUTPUT XTNTTBL2       */
*       3 REPOXTNT PTR(31),         /* ADDR OF OUTPUT XTNTTBL        */
*       3 REPIINFO PTR(31),         /* ADDR OF INPUT UIOINFO AREA    */
*       3 REPOINFO PTR(31),         /* ADDR OF OUTPT UIOINFO AREA    */
*       3 REPRWHAR PTR(31),         /* ADDR OF REPAIR WORK FILE    0330
*                                      HEADER INFORMATION AREA       */
*       3 REPRWINA PTR(31),         /* ADDR OF REPAIR WORK FILE    0330
*                                      INFORMATION AREA              */
*       3 REPISYSI PTR(31),         /* INPUT USYSINFO AREA ADDR      */
*       3 REPOSYSI PTR(31),         /* OUTPUT USYSINFO AREA ADDR     */
*       3 REPILCPT PTR(31),         /* PTR TO LOCATION TABLE FOR THE
*                                      INPUT DATA SET                */
*       3 REPOLCPT PTR(31),         /* PTR TO LOCATION TABLE FOR THE
*                                      OUTPUT DATA SET               */
*       3 REPIDEVA PTR(31),         /* PTR TO INPUT DEVTYPE AREA     */
*       3 REPODEVA PTR(31),         /* PTR TO OPUT DEVTYPE AREA      */
*       3 REPQRPTR PTR(31),         /* PTR TO QNAME AND RNAME        */
*       3 REPALLAG PTR(31),         /* PTR TO SPACE FOR ALLAGL       */
*       3 REPEXOAR PTR(31),         /* PTR TO SPACE FOR EXOARG       */
*       3 REPOPAGL PTR(31),         /* PTR TO SPACE FOR OPNAGL       */
*       3 REPCPPTR PTR(31),         /* PTR TO CATALOG PARM LIST      */
*       3 REPCDSOP PTR(31),         /* IOCPTR FOR DS                 */
*                                                                  0330
*     /***************************************************************/
*     /*                                                             */
*     /* WORKING STORAGE FOR IDCRD02-IDCRD07                         */
*     /*                                                             */
*     /***************************************************************/
*                                                                  0330
*      2 REPCBEXT,                                                 0330
*       3 REPR0LN FIXED(16),        /* RWF RECORD 0 LENGTH           */
*       3 REPR1LN FIXED(16),        /* RWF RECORD 1 LENGTH           */
*       3 REPSRPR,                                                 0330
*        4 REPSRPRT BIT(1),         /* HEADER SWITCH FOR IDCRDPT     */
*        4 * BIT(7),                                               0330
*        4 * CHAR(1),               /* RESERVED                      */
*       3 REPRC FIXED(16),          /* RETURN CODE                   */
*       3 REPRCDCT FIXED(31),       /* RECORDS PROCESSED COUNTER     */
*       3 I FIXED(8),               /* INDEX1 FOR TNTTBL PROCESS     */
*       3 J FIXED(8),               /* INDEX2 FOR TNTTBL PROCESS     */
*       3 K FIXED(8),               /* INDEX3 FOR TNTTBL PROCESS     */
*       3 * FIXED(8),               /* RESERVED                      */
*       3 CKREQ BDY(WORD),          /* CKERR PARM LIST               */
*        4 CKRERN FIXED(15),        /* ERROR NUMBER                  */
*        4 * FIXED(15),             /* RESERVED                      */
*        4 CKRMVAR(10) PTR(31),     /* PTRS TO MSG VARIABLES         */
*       3 RDCATRC FIXED(31),        /* UCATLG RETURN CODE            */
*       3 WFIOGUK CHAR(11),         /* GET UPDATE KEY                */
*       3 * CHAR(1),                /* RESERVED                      */
*       3 WFAREA BDY(WORD),         /* WFIO ARGUEMENTS               */
*        4 WFIODAD PTR(31),         /* DATA ADDRESS                  */
*        4 WFIODLN FIXED(31),       /* DATA LENGTH                   */
*        4 WFIOKYA PTR(31),         /* KEY ADDRESS                   */
*        4 WFREQ BIT(16),           /* FUNCTION FLAGS                */
*         5 WFRTYP BIT(8),          /* FUNCTION TYPE                 */
*          6 WFRADD BIT(1),         /* ADDRCD                        */
*          6 WFRLD BIT(1),          /* LOADRCD                       */
*          6 WFRGET BIT(1),         /* GETRCD                        */
*          6 WFRUPD BIT(1),         /* UPDRCD                        */
*          6 WFRPOS BIT(1),         /* POSRCD                        */
*          6 * BIT(3),              /* RESERVED                      */
*         5 WFROPT BIT(8),          /* OPTIONS                       */
*          6 WFRIN BIT(1),          /* INPUT DS                      */
*          6 WFRUP BIT(1),          /* UPDATE                        */
*          6 * BIT(6),              /* RESERVED                      */
*       3 REPENQSW FIXED(8);        /* ENQUEUE SENSE SWITCH          */
*                                                                  0330
*   /*****************************************************************/
*   /*                                                               */
*   /* DATA STRUCTURES FOR REPAIRV REPAIR WORKFILE HEADER RECORD     */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0331
*   DCL                                                            0331
*     1 RWFHDR BDY(WORD) BASED,                                    0331
*      2 RWFHKEY CHAR(11),          /* RWF KEY                       */
*      2 RWFHDSNR CHAR(44),         /* REPAIRWORKFILE                */
*      2 RWFHDSNU CHAR(44),         /* DSNAME OF USER DATA SET       */
*      2 RWFHFM CHAR(4);            /* INFO AREA - SEE RWDEF         */
*                                                                  0331
*   /*****************************************************************/
*   /*                                                               */
*   /* ADDRESSABILITY TO INFORMATION AREA OF WORKFILE HDR REC        */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0332
*   DCL                                                            0332
*     1 RWDEF DEFINED(RWFHDR) BDY(WORD),                           0332
*      2 * CHAR(89),                /* SEE RWFHDR                    */
*      2 RWFHFT CHAR(1),            /* F MEANS FIXED RECORD BLANK  0332
*                                      MEANS NOT FIXED               */
*      2 RWFHDLN FIXED(16),         /* RCD LENGTH OR ZERO            */
*      2 RWFHKLN FIXED(8);          /* KEY LENGTH OR ZERO            */
*                                                                  0332
*   /*****************************************************************/
*   /*                                                               */
*   /* IDCRDPT ARGUMENT LIST                                         */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0333
*   DCL                                                            0333
*     1 SRPRTARG BDY(WORD) BASED(REPSPRIT),                        0333
*      2 SRVRECL FIXED(31),         /* VSAM REC LEN MINUS F + K      */
*      2 SRVREPTR PTR(31),          /* PTR TO VSAM RECORD            */
*      2 SRDSNHDR PTR(31),          /* PTR TO DSNAME IN RWF          */
*      2 SRVOLPTR PTR(31),          /* PTR TO VOL SER NUMBER         */
*      2 SRRWFDSN PTR(31),          /* PTR TO DSNAME OF RWF          */
*      2 SRRWFKEY PTR(31),          /* PTR TO KEY OF RWF             */
*      2 SRERCODE PTR(31),          /* PTR TO ERROR CODE             */
*      2 SRDSNPTR PTR(31),          /* PTR TO DSNAME - DATA SET      */
*      2 SRSPRECL FIXED(31),        /* KEY + DATA LEN STAGPACK       */
*      2 SRRECPTR PTR(31),          /* PTR TO COUNT OF NON-VSAM      */
*      2 SRCCHHRP PTR(31);          /* PTR TO CCHHR                  */
*                                                                  0333
*   /*****************************************************************/
*   /*                                                               */
*   /* REPAIR WORKFILE INFORMATION AREA                              */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0334
*   DCL                                                            0334
*     1 RWFINFO BASED(REPRWINA),                                   0334
*      2 RWFDDN CHAR(8),            /* DDNAME                        */
*      2 RWFDSN CHAR(44),           /* DSNAME                        */
*      2 RWFVOL(5) CHAR(6),         /* VOLSER                        */
*      2 RWFKEY1,                   /* BEGINING RWF KEY              */
*       3 RWFKVOL1 CHAR(6),         /* VOLSER                        */
*       3 RWFKCHR1 CHAR(5),         /* CCHHR                         */
*      2 RWFKEY2,                   /* ENDING RWF KEY                */
*       3 RWFKVOL2 CHAR(6),         /* VOLSER                        */
*       3 RWFKCHR2 CHAR(5);         /* CCHHR                         */
*                                                                  0334
*   /*****************************************************************/
*   /*                                                               */
*   /* RWF HEADER RECORD INFORMATION                                 */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0335
*   DCL                                                            0335
*     1 RWHDRINF BASED(REPRWHAR),                                  0335
*      2 RWHDRFIX CHAR(1),          /* F FOR FBS RECORD FORMAT 0 FOR
*                                      OTHER RCD FORMATS             */
*      2 * CHAR(4),                                                0335
*      2 RWHDRKLN FIXED(8),         /* KEY LN IF RWHDRFIX = F 0 IF 0335
*                                      RWHDRFIX ^= F                 */
*      2 RWHDRDLN FIXED(16);        /* DATA LN IF RWHDRFIX = F 0 IF
*                                      RWHDRFIX ^= F                 */
*                                                                  0335
*   /*****************************************************************/
*   /*                                                               */
*   /* IDCRDRD ARGUMENT LIST                                         */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0336
*   DCL                                                            0336
*     1 RDARG BDY(WORD) BASED,                                     0336
*      2 RDRES CHAR(8),             /* RESERVED                      */
*      2 RDCTLBK PTR(31),           /* POINTER TO I/O CNTL BLK       */
*      2 RDIOAREA PTR(31),          /* PTR TO RIOAREA                */
*      2 RDDARE PTR(31),            /* PTR TO DATA READ              */
*      2 RDLOCPTR PTR(31),          /* POINTER TO LOC TABLE          */
*      2 RDCCWCNT FIXED(15),        /* NUM OF CCWS EXECUTED          */
*      2 RDCHR,                                                    0336
*       3 RDCC FIXED(16),           /* CYLINDER NUMBER               */
*       3 RDHH FIXED(16),           /* HEAD NUMBER                   */
*       3 RDRECNUM FIXED(8),        /* RECORD NUMBER                 */
*      2 RDDS FIXED(8),             /* ZERO FOR DATA SET             */
*      2 RDRWPKLN PTR(31),          /* KEY LEN POINTER               */
*      2 RDSPACE,                   /* RESERVED FOR UEXCP            */
*       3 * FIXED(8),               /* RESERVED                      */
*       3 * PTR(24),                /* RESERVED                      */
*       3 * FIXED(15),              /* RESERVED                      */
*       3 * FIXED(15),              /* RESERVED                      */
*       3 * FIXED(15),              /* RESERVED                      */
*      2 RDFUNC FIXED(8),           /* WRITE FUNCTION BYTE           */
*      2 RDSPKL FIXED(8),           /* STAGING PACK KEY LENGTH       */
*      2 RDSPDL FIXED(15),          /* STAGING PACK DATA LENGTH      */
*      2 RDLENTOT FIXED(15),        /* NUM OF LENGTH ENTRIES         */
*      2 RDKLEN PTR(31),            /* PTR LEN ENTRIES FOR KL        */
*      2 RDDLEN PTR(31);            /* PTR LEN ENTRIES FOR DL        */
*   DCL                                                            0337
*     RDSPKLDL CHAR(3) DEFINED(RDSPKL);                            0337
*                                                                  0337
*   /*****************************************************************/
*   /*                                                               */
*   /* UIOINFO RETURN AREAS                                          */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0338
*   DCL                                                            0338
*     1 INFOAREA BASED,                                            0338
*      2 INFAREAL FIXED(16),        /* LENGTH OF RETURN AREA         */
*      2 INFDATAL FIXED(16),        /* LENGTH OF DATA RETURNED       */
*      2 INFAREA CHAR(*);                                          0338
*   DCL                                                            0339
*     1 INFODSN BASED,                                             0339
*      2 INFDSNID CHAR(2),          /* IDENTIFIER - X'0001'          */
*      2 INFDSNLN FIXED(16),        /* LENGTH OF DATA RETURNED       */
*      2 INFDSN CHAR(44);           /* DATA SET NAME                 */
*   DCL                                                            0340
*     1 INFOVOL BASED,                                             0340
*      2 INFVOLID CHAR(2),          /* IDENTIFIER - X'0002'          */
*      2 INFVOLLN FIXED(16),        /* LENGTH OF DATA RETURNED       */
*      2 INFVOL(5) CHAR(6);         /* VOLUME SERIAL NUMBER LIST     */
*                                                                  0340
*   /*****************************************************************/
*   /*                                                               */
*   /* DEVICE TYPE AREA DSECT                                        */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0341
*   DCL                                                            0341
*     1 DEVAREA BDY(WORD) BASED,                                   0341
*      2 DEVDEVTP,                  /* UCB DEVICE TYPE               */
*       3 DEVTBYT1 BIT(8),          /* MODEL BITS                    */
*       3 DEVTBYT2,                 /* OPTION FLAGS                  */
*        4 * BIT(4),                                               0341
*        4 DEVRVDEV BIT(1),         /* 0 = REAL DEVICE 1 = VIRTUAL 0341
*                                      DEVICE                        */
*        4 * BIT(3),                                               0341
*       3 DEVTBYT3 BIT(8),          /* CLASS BITS                    */
*       3 DEVTBYT4 BIT(8),          /* DEVICE CODE                   */
*      2 DEVMAXBK FIXED(32),        /* MAXIMUM DEVICE BLOCKSIZE      */
*      2 *,                                                        0341
*       3 DEVMAXCC FIXED(16),       /* MAXIMUM PHYSICAL CYLINDER     */
*       3 DEVMAXHH FIXED(16),       /* MAXIMUM PHYSICAL TRACKS       */
*      2 DEVWORD3,                                                 0341
*       3 DEVTC FIXED(16),          /* TRACK CAPACITY                */
*       3 DEVBOH,                                                  0341
*        4 DEVBOH1 FIXED(8),        /* BLOCK OVERHEAD 3330           */
*        4 DEVBOH2 FIXED(8),        /* THIS & ABOVE IS BLOCK         */
*      2 DEVWORD4,                                                 0341
*       3 DEVKC FIXED(8),           /* KEY CONSTANT                  */
*       3 DEV4B1,                                                  0341
*        4 * BIT(4),                                               0341
*        4 INF4FLG BIT(1),          /* ON INDICATES TWO BYTES OF   0341
*                                      BLOCK OVERHEAD MUST BE HANDLED*/
*        4 * BIT(3),                                               0341
*        4 * CHAR(2),               /* RESERVED                      */
*      2 DEVWORD5 FIXED(32);                                       0341
*                                                                  0341
*   /*****************************************************************/
*   /*                                                               */
*   /* EXTENT TABLE 2: DATA SET DEB EXTENTS                          */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0342
*   DCL                                                            0342
*     1 XTNTTBL2 BASED,                                            0342
*      2 XTN2ENT(140),                                             0342
*       3 XTN2DSN CHAR(44),         /* DATA SET NAME                 */
*       3 XTN2CHR1,                 /* LOWER LIMIT CCHH              */
*        4 XTN2CC1 FIXED(16),                                      0342
*        4 XTN2HH1 FIXED(16),                                      0342
*       3 XTN2CHR2,                 /* UPPER LIMIT CCHH              */
*        4 XTN2CC2 FIXED(16),                                      0342
*        4 XTN2HH2 FIXED(16);                                      0342
*                                                                  0342
*   /*****************************************************************/
*   /*                                                               */
*   /* EXTENT TABLE 3: USER SUPPLIED RANGE MERGED WITH XTNTTBL2      */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0343
*   DCL                                                            0343
*     1 XTNTTBL BASED,                                             0343
*      2 XTNTHDR,                   /* EXTENT TABLE HEADER           */
*       3 XTNHDDN CHAR(8),          /* DDNAME                        */
*       3 XTNHDSN CHAR(44),         /* DSNAME                        */
*       3 XTNHVOLN CHAR(1),         /* VOLUME COUNT OF 1             */
*       3 XTNHVOL CHAR(6),          /* VOLSER                        */
*       3 * CHAR(1),                                               0343
*       3 XTNHPWD CHAR(8),          /* PASSWORD                      */
*       3 XTNHCHR1,                 /* USER LOWER LIMIT CCHHR        */
*        4 XTNHCC1 FIXED(16),                                      0343
*        4 XTNHHH1 FIXED(16),                                      0343
*        4 XTNHR1 FIXED(8),                                        0343
*       3 * CHAR(3),                /* RESERVED                      */
*       3 XTNHCHR2,                 /* USER UPPER LIMIT CCHHR        */
*        4 XTNHCC2 FIXED(16),                                      0343
*        4 XTNHHH2 FIXED(16),                                      0343
*        4 XTNHR2 FIXED(8),                                        0343
*       3 * CHAR(3),                /* RESERVED                      */
*       3 XTNHMODE CHAR(1),         /* I=INPUT,O=OUTPUT              */
*       3 * CHAR(3),                                               0343
*      2 XTNTENT(140),              /* EXTENT TABLE ENTRIES          */
*       3 XTNTDDN CHAR(8),          /* DDNAME                        */
*       3 XTNTDSN CHAR(44),         /* DSNAME                        */
*       3 XTNTVOLN CHAR(1),         /* VOLUME COUNT OF 1             */
*       3 XTNTVOL CHAR(6),          /* VOLSER                        */
*       3 * CHAR(3),                /* RESERVED                      */
*       3 XTNTCHR1,                 /* MERGED LOW LIM CCHHR          */
*        4 XTNTCC1 FIXED(16),                                      0343
*        4 XTNTHH1 FIXED(16),                                      0343
*        4 XTNTR1 FIXED(8),                                        0343
*       3 * CHAR(3),                /* RESERVED                      */
*       3 XTNTCHR2,                 /* MERGED UPPER LIM CCHHR        */
*        4 XTNTCC2 FIXED(16),                                      0343
*        4 XTNTHH2 FIXED(16),                                      0343
*        4 XTNTR2 FIXED(8),                                        0343
*       3 * CHAR(3);                /* RESERVED                      */
*                                                                  0343
*   /*****************************************************************/
*   /*                                                               */
*   /* STRUCTURE TO REFERENCE 'RESERVE' QUEUE PARAMETERS             */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0344
*   DCL                                                            0344
*     1 SPLIST BASED(REPQRPTR),                                    0344
*      2 SPQNAME CHAR(8),           /* QNAME                         */
*      2 SPRNAME,                   /* RNAME                         */
*       3 SPRLEN CHAR(1),           /* RNAME LENGTH                  */
*       3 SPRVOL CHAR(6);           /* VOLSER                        */
*                                                                  0344
*   /*****************************************************************/
*   /*                                                               */
*   /* REPAIR WORKFILE DATA RECORD                                   */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0345
*   DCL                                                            0345
*     1 RWFR BASED BDY(WORD),                                      0345
*      2 RWFRKEY CHAR(11),          /* RWF KEY                       */
*      2 RWFRFLG CHAR(5),           /* SEE RWFRDE                    */
*      2 RWFRCNT,                                                  0345
*       3 RWFRCC FIXED(16),         /* CC                            */
*       3 RWFRHH FIXED(16),         /* HH                            */
*       3 RWFRR FIXED(8),           /* R                             */
*       3 RWFRKLN FIXED(8),         /* RECORD KEY LENGTH             */
*       3 RWFRDLN FIXED(16),        /* RECORD DATA LENGTH            */
*      2 RWFRKD CHAR(*);            /* RECORD KEY/DATA               */
*                                                                  0345
*   /*****************************************************************/
*   /*                                                               */
*   /* STRUCTURE TO ALLOW ADDRESSABILITY TO STATUS FIELDS OF OF      */
*   /* REPAIR WORKFILE DATA RECORD                                   */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0346
*   DCL                                                            0346
*     1 RWFRDE DEFINED(RWFR),                                      0346
*      2 * CHAR(11),                /* SEE RWFR                      */
*      2 RWFRF1 CHAR(1),            /* 0 WHEN FILE CREATED 1 WHEN  0346
*                                      FILE MODIFIED 2 WHEN FILE   0346
*                                      DEBLOCKED 3 WHEN DEBLOCKED AND
*                                      MODIFIED DEBLOCKED            */
*      2 RWFRF2 FIXED(16),          /* STATUS CODE                   */
*      2 RWFROV FIXED(8),           /* OVERFLOW RECORD               */
*      2 * CHAR(*);                 /* SEE RWFR                      */
*                                                                  0346
*   /*****************************************************************/
*   /*                                                               */
*   /* END OF REPAIRV GLOBAL DECLARATIONS                            */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0347
*                                                                  0347
*   /*****************************************************************/
*   /*                                                               */
*   /* REPAIRV I/O MAPPING MACRO -AMSDF66 THE FOLLOWING STRUCTURE IS */
*   /* USED BY IDCRDRD & REPAIRV TO DETERMINE THE LOCATION & READ    */
*   /* RETURN CODES OF THE RECORDS ON A TRACK. IT ALSO CONTAINS A    */
*   /* SAVE AREA FOR THE COUNT FIELD AND LENGTH INFORMATION FOR EACH */
*   /* RECORD,IF REQUIRED                                            */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0347
*   DCL                                                            0347
*     1 LOCTAB(125) BDY(WORD) BASED,/* LOC TABLE FOR READS           */
*      2 LOCADDR PTR(31),           /* ENTRY ADDRESS                 */
*      2 LOCRCNT FIXED(15),         /* RET CODE OF READ COUNT        */
*      2 LOCRCKD FIXED(15),         /* RET CODE KEY/DATA RD          */
*      2 LOCCNTFD CHAR(8),          /* SAVE AREA FOR COUNT           */
*      2 * CHAR(1),                 /* SAVE AREA FOR COUNT           */
*      2 LOCKLEN FIXED(8),          /* KEY LEN FOR SPACCR            */
*      2 LOCDLEN FIXED(15);         /* DATA LEN FOR SPACCR           */
*   DCL                                                            0348
*     1 RIOAREA BDY(WORD) BASED,                                   0348
*      2 RIOHDR,                                                   0348
*       3 RFIRST CHAR(1),           /* FIRST TIME INDICATOR          */
*       3 * CHAR(1),                /* RESERVED                      */
*       3 RPREV,                    /* PREVIOUS CCHHR                */
*        4 RPREVCC FIXED(15),       /* PREVIOUS CYLINDER ADDRESS     */
*        4 RPREVHH FIXED(15),       /* PREVIOUS READ ADDR            */
*        4 RPREVR FIXED(8),         /* PREVIOUS RECORD NUMBER        */
*       3 * CHAR(1),                /* RESERVED                      */
*       3 RNUMREC FIXED(15),        /* NUM OR RECS TO READ           */
*       3 * CHAR(16),               /* RESERVED FOR KEY AREA         */
*       3 * CHAR(256),              /* RESERVED                      */
*      2 RBUFF CHAR(*);             /* BUFFER READ IN AREA           */
*   DCL                                                            0349
*     1 RKEY BASED,                 /* STRUCTURE FOR KEYAREA         */
*      2 RKEYVOL CHAR(6),           /* VOLID                         */
*      2 RKEYCHR,                   /* CCHHR                         */
*       3 RKEYCC FIXED(15),         /* CYLINDER ADDRESS              */
*       3 RKEYHH FIXED(15),         /* HEAD ADDRESS                  */
*       3 RKEYR FIXED(8),           /* RECORD NUMBER                 */
*      2 RKEYFLG,                   /* FLAG BYTES                    */
*       3 RKEYFLG1 CHAR(1),         /* FLAG BYTE ONE                 */
*       3 RKEYFLG2 CHAR(2),         /* SECOND FLAGS                  */
*       3 RKEYFLG3 CHAR(1),         /* THIRD FLAGS                   */
*       3 * CHAR(1);                /* RESERVED                      */
*   DCL                                                            0350
*     1 RBUF BASED,                 /* STRUC FOR RECS IN RBUFF       */
*      2 RBUFCNT,                   /* RECORD COUNT AREA             */
*       3 RBCCHHR,                  /* CCHHR                         */
*        4 RBCC FIXED(15),          /* CYLINDER ADDRESS              */
*        4 RBHH FIXED(15),          /* HEAD ADDRESS                  */
*        4 RBREC FIXED(8),          /* RECORD NUMBER                 */
*       3 RBKL FIXED(8),            /* KEY LENGTH                    */
*       3 RBDL FIXED(15),           /* DATA LENGTH                   */
*      2 RKEYDAT CHAR(*);           /* KEY AND DATA AREA             */
*   DCL                                                            0351
*     1 WIOAREA BASED BDY(WORD),                                   0351
*      2 WNUMREC FIXED(31),         /* NUM OF RECORDS TO WRITE       */
*      2 WBUFF CHAR(*);             /* DATA AREAS FOR WRITES         */
*   DCL                                                            0352
*     1 WBUF BASED,                 /* STRUC WRITES FROM WBUFF       */
*      2 WBUFCNT,                   /* RECORD COUNT AREA             */
*       3 WBCCHHR,                  /* CCHHR                         */
*        4 WBCC FIXED(15),          /* CYLINDER ADDRESS              */
*        4 WBHH FIXED(15),          /* HEAD ADDRESS                  */
*        4 WBREC FIXED(8),          /* RECORD NUMBER                 */
*       3 WBKL FIXED(8),            /* KEY LENGTH                    */
*       3 WBDL FIXED(15),           /* DATA LENGTH                   */
*      2 WKEYDAT CHAR(*);           /* KEY AND DATA BUFFER           */
*/********************************************************************/
*/*                                                                  */
*/*   MACRO NAME = IEZCTGPL                                          */
*/*                                                                  */
*/*   DESCRIPTIVE NAME = CATALOG PARAMETER LIST                      */
*/*                                                                  */
*/*   FUNCTION = THE CATALOG PARAMETER LIST (CTGPL) DEFINES THE      */
*/*              CATALOG MANAGEMENT REQUEST AND ITS OPTIONS, THE     */
*/*              CATALOG RECORD TO BE PROCESSED, AND THE VSAM        */
*/*              CATALOG THAT CONTAINES THE RECORD.  THE CTGPL IS    */
*/*              BUILT BEFORE AN OS/VS COMPONENT ISSUES THE CATLG    */
*/*              MACRO INSTRUCTION (SVC 26) TO PROCESS A CATALOG     */
*/*              RECORD.  WHEN THE CATALOG MANAGEMENT ROUTINES       */
*/*              BUILD A CCA TO SUPPORT THE REQUEST, THE ADDRESS     */
*/*              OF THE CTGPL IS PUT INTO THE CCA (CCACPL).          */
*/*                                                                  */
*/*   CONTROL BLOCK STRUCTURE = THE CTGPL IS POINTED TO BY           */
*/*                             REGISTER 1.                          */
*/*                                                                  */
*/*   INCLUDED MACROS = NONE                                         */
*/*                                                                  */
*/*   METHOD OF ACCESS = PL/S - NO DECLARES NECESSARY                */
*/*                                                                  */
*/*   STATUS = VS/2 RELEASE 4   (CHANGE FLAG @Z40WSXX)       @Z40WSSM*/
*/*                                                                  */
*/*   DATE OF LAST CHANGE = 4 SEPT 75                        @Z40WSSM*/
*/*                                                                  */
*/********************************************************************/
*                                                                  0353
*   DECLARE                                                        0353
*     1 CTGPL BASED(REPCPPTR)       /* DECLARE CTGPL LEVEL ONE       */
*           BDY(WORD),              /* WORD BOUNDARY                 */
*         5 CTGOPTN1 BIT(8),        /* FIRST OPTION INDICATOR        */
*              10 CTGBYPSS BIT(1),  /* BYPASS                        */
*              10 CTGMAST BIT(1),   /* VERIFY MASTER PASSWORD        */
*              10 CTGCI BIT(1),     /* VERIFY CONTROL INTERVAL       */
*              10 CTGUPD BIT(1),    /* VERIFY UPDATE                 */
*              10 CTGREAD BIT(1),   /* VERIFY READ                   */
*              10 CTGNAME BIT(1),   /* 1 = 44-BYTE NAME OR VOL SER, 0
*                                      = ENTRY ID NUMBER             */
*              10 CTGCNAME BIT(1),  /* 1 = 44-BYTE NAME, 0 = ACB   0353
*                                      ADDRESS                       */
*              10 CTGGENLD BIT(1),  /* GENERIC LOCATE REQUEST  Y02020*/
*         5 CTGOPTN2 BIT(8),        /* SECOND OPTION INDICATOR       */
*              10 CTGEXT BIT(1),    /* EXTEND (UPDATE)               */
*                   15 CTGNSVS BIT(1),/* CATLG CLEANUP REQUEST     0353
*                                                            @ZA00605*/
*              10 CTGERASE BIT(1),  /* ERASE (DELETE)                */
*                   15 CTGSMF BIT(1),/* WRITE SMF (LSPACE)           */
*                        20 CTGREL BIT(1),/* RELEASE (UPDATE)        */
*                             25 CTGGTALL BIT(1),/* CONCAT SEARCH FOR
*                                                              Y02020
*                                      (LISTCAT)               Y02020*/
*              10 CTGPURG BIT(1),   /* PURGE (DELETE)                */
*                   15 CTGVMNT BIT(1),/* VOLUME MOUNT CALLER         */
*                        20 CTGRCATN BIT(1),/* RTN CATLG NAME(GLOC)
*                                                              Y02020*/
*              10 CTGGTNXT BIT(1),  /* GET NEXT (LIST CATALOG)       */
*              10 CTGDISC BIT(1),   /* DISCONNECT (DELETE)           */
*              10 CTGOVRID BIT(1),  /* ERASE OVERRIDE (DELETE)       */
*              10 CTGSCR BIT(1),    /* SCRATCH SPACE (DELETE)        */
*              10 * BIT(1),         /* RESERVED                      */
*         5 CTGOPTN3 BIT(8),        /* THIRD OPTION INDICATOR        */
*              10 CTGFUNC BIT(3),   /* CATALOG FUNCTION              */
*              10 CTGSUPLT BIT(1),  /* SUPER LOCATE                  */
*              10 CTGGDGL BIT(1),   /* GDG LOCATE REQUEST      Y02020
*                                      WITH BASE LEVEL GIVEN   Y02020
*                                      (CTGWAGB IN CTGWA)      Y02020*/
*              10 CTGSRH BIT(1),    /* 0 = SEARCH MASTER CATLG Y02020
*                                      ONLY                    Y02020
*                                      1 = SEARCH OS CATALOG FIRST   */
*              10 CTGNUM BIT(1),    /* 0 = SEARCH BOTH CATALOGS, 1 =
*                                      SEARCH ONE CATALOG            */
*              10 CTGAM0 BIT(1),    /* VSAM REQ VERSUS NONVSAM       */
*         5 CTGOPTN4 BIT(8),        /* GDG FLAGS                     */
*              10 CTGLBASE BIT(1),  /* LOCATE GDG BASE ONLY Y02020   */
*              10 CTGDOCAT BIT(1),  /* DO NOT OPEN NEEDED CATALOG  0353
*                                                              Y02020*/
*              10 * BIT(2),         /* RESERVED              @OZ07531*/
*              10 CTGBYPMT BIT(1),  /* BYPASS SECURITY PROMPTING TO
*                                      SYSTEM OPERATOR       @OZ07531*/
*              10 * BIT(3),         /* RESERVED              @OZ07531*/
*         5 CTGENT PTR(31),         /* USER ENTRY ADDR OR PTR TO   0353
*                                      VOLUME SERIAL NUMBER (LSPACE) */
*              10 CTGFVT PTR(31),   /* FVT ADDRESS (DEFINE, ALTER)   */
*         5 CTGCAT PTR(31),         /* CATALOG POINTER               */
*              10 CTGCVOL PTR(31),  /* CVOL PTR (SUPER LOCATE)       */
*         5 CTGWKA PTR(31),         /* WORKAREA ADDR                 */
*         5 CTGDSORG CHAR(2),       /* DATA SET ORG - SUPERLOCATE    */
*              10 CTGOPTNS BIT(5),  /* CMS OPTIONS                   */
*              10 * BIT(11),        /* RESERVED                      */
*         5 CTGTYPE CHAR(1),        /* ENTRY TYPE - LISTCAT, DELETE  */
*         5 CTGNOFLD PTR(8),        /* NUMBER OF FIELD POINTERS      */
*         5 CTGDDNM PTR(31),        /* DD NAME ADDR                  */
*              10 CTGNEWNM PTR(31), /* NEWNAME ADDRESS - ALTER       */
*                   15 CTGFDBK PTR(16),/* SUPER LOCATE FEEDBACK      */
*                   15 CTGFBFLG BIT(16),/* SUPER LOCATE FLAGS        */
*                        20 CTGPAR BIT(1),/* PARALLEL MOUNT        0353
*                                      -SUPERLOCATE                  */
*                        20 CTGKEEP BIT(1),/* FORCED KEEP -        0353
*                                      SUPERLOCATE                   */
*                        20 CTGGDGB BIT(1),/* GDG BASE LOCATE  Y02020*/
*                        20 CTGNGDSN BIT(1),/* GDG NAME GENERATED  0353
*                                                              Y02020*/
*                        20 * BIT(12),/* RESERVED              Y02020*/
*         5 CTGJSCB PTR(31),        /* JSCB ADDR                     */
*              10 CTGPSWD PTR(31),  /* PASSWORD ADDR                 */
*         5 CTGFIELD(*) PTR(31);    /* FIELD POINTERS                */
*/********************************************************************/
*/*     CONSTANTS USED TO SET AND/OR TEST FIELDS DECLARED ABOVE      */
*/********************************************************************/
*                                                                  0354
*   DECLARE                         /* CATALOG FUNCTION - CTGFUNC    */
*     CTGLOC BIT(3) CONSTANT('001'B),/* LOCATE                       */
*     CTGLSP BIT(3) CONSTANT('010'B),/* LSPACE                       */
*     CTGUPDAT BIT(3) CONSTANT('011'B),/* UPDATE                     */
*     CTGCMS BIT(3) CONSTANT('100'B);/* CMS FUNCTION                 */
*   DECLARE                         /* CMS OPTIONS - CTGOPTNS        */
*     CTGDEFIN BIT(5) CONSTANT('00001'B),/* DEFINE                   */
*     CTGALTER BIT(5) CONSTANT('00010'B),/* ALTER                    */
*     CTGDELET BIT(5) CONSTANT('00011'B),/* DELETE                   */
*     CTGLTCAT BIT(5) CONSTANT('00100'B),/* LIST CATALOG             */
*     CTGCNVTV BIT(5) CONSTANT('00110'B);/* CONVERTV         @Y30LSPS*/
*   DECLARE                         /* RECORD ENTRY TYPE - CTGTYPE   */
*     CTGTDATA CHAR(1) CONSTANT('D'),/* DATA                         */
*     CTGTINDX CHAR(1) CONSTANT('I'),/* INDEX                        */
*     CTGTALIN CHAR(1) CONSTANT('A'),/* ALIEN                        */
*     CTGTUCAT CHAR(1) CONSTANT('U'),/* USER CATALOG                 */
*     CTGTVOL CHAR(1) CONSTANT('V'),/* VOLUME                        */
*     CTGTCL CHAR(1) CONSTANT('C'), /* CLUSTER                       */
*     CTGTAIX CHAR(1) CONSTANT('G'),/* ALTERNATE INDEX       @Y30SSPJ*/
*     CTGTPATH CHAR(1) CONSTANT('R'),/* PATH                 @Y30SSPJ*/
*     CTGTFREE CHAR(1) CONSTANT('F'),/* FREE                 @Y30SSPJ*/
*     CTGTPTH CHAR(1) CONSTANT('R'),/* PATH                  @Y30SSSB*/
*     CTGTUPG CHAR(1) CONSTANT('Y'),/* UPGRADE               @Y30SSSB*/
*     CTGTGBS CHAR(1) CONSTANT('B'),/* GDG BASE                Y02020*/
*     CTGTANM CHAR(1) CONSTANT('X'),/* ALIAS NAME              Y02020*/
*     CTGTPGSP CHAR(1) CONSTANT('P'),/* PAGE SPACE             Y02020*/
*     CTGTMCAT CHAR(1) CONSTANT('M');/* MASTER CATALOG               */
*/********************************************************************/
*/*                 PROBLEM  DETERMINATION  FIELDS                   */
*/********************************************************************/
*                                                                  0357
*   DECLARE                                                        0357
*     1 * DEF(CTGDDNM),             /* PROBLEM DETERMINATION @Y30SSJG*/
*      2 CTGPROB CHAR(4),           /* PROBLEM DETERMINATION @Y30SSJG*/
*       3 CTGMODID CHAR(2),         /* MODULE IDENTIFICATION @Y30SSJG*/
*       3 CTGREASN CHAR(2),         /* REASON CODE           @Y30SSJG*/
*        4 CTGREAS1 CHAR(1),        /* HIGH ORDER BYTE ZERO  @Y30SSJG*/
*        4 CTGREAS2 CHAR(1);        /* REASON CODE LOW BYTE  @Y30SSJG*/
*                                                                  0357
*   /*****************************************************************/
*   /*                                                               */
*   /* VARIABLES USED IN IDCRD06 MODULE IDENTIFIER                   */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0358
*   DCL                                                            0358
*     MODID CHAR(4) STATIC INIT('RD06');                           0358
*                                                                  0358
*   /*****************************************************************/
*   /*                                                               */
*   /* FIELDS OF ZEROS                                               */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0359
*   DCL                                                            0359
*     ZERO FIXED(15) INIT(0);                                      0359
*   DCL                                                            0360
*     1 ZEROCNST CHAR(8) STATIC LOCAL,                             0360
*      2 *(8) CHAR(1) INIT((8)0);                                  0360
*                                                                  0361
*   /*****************************************************************/
*   /*                                                               */
*   /* PATCH AREA                                                    */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0361
*   DCL                                                            0361
*     1 FIXAREA STATIC LOCAL,                                      0361
*      2 * CHAR(256),                                              0361
*       3 *(256) CHAR(1) INIT((256)'00'X),                         0361
*      2 * CHAR(256),                                              0361
*       3 *(256) CHAR(1) INIT((256)'00'X),                         0361
*      2 * CHAR(256),                                              0361
*       3 *(256) CHAR(1) INIT((256)'00'X),                         0361
*      2 * CHAR(256),                                              0361
*       3 *(256) CHAR(1) INIT((256)'00'X);                         0361
*                                                                  0361
*   /*****************************************************************/
*   /*                                                               */
*   /* FINAL CONDITION CODE - ARGUMENT OF INVOCATION                 */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0362
*   DCL                                                            0362
*     LASTCC FIXED(15);                                            0362
*                                                                  0362
*   /*****************************************************************/
*   /*                                                               */
*   /* SPACE FOR DARGLIST (MESSAGE PARAMETER LIST)                   */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0363
*   DCL                                                            0363
*     DARGL CHAR(LENGTH(DARGLIST)+10*LENGTH(DARGARY)) BDY(WORD);   0363
*                                                                  0363
*   /*****************************************************************/
*   /*                                                               */
*   /* SPACE FOR ERCNVTAB (ERROR TABLE LIST)                         */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0364
*   DCL                                                            0364
*     ERCNVT CHAR(LENGTH(ERCNVTAB)) BDY(WORD);                     0364
*                                                                  0364
*   /*****************************************************************/
*   /*                                                               */
*   /* SAVE AREA TO KEEP CODEREGS UPON ENTRY TO THE INITIALIZATION   */
*   /* PORTION OF THIS MODULE WHICH GETS DYNAMIC STORAGE AND EXITS.  */
*   /* THE CODEREGS WILL BE RESTORED FROM THIS AREA WHEN ANY OF THE  */
*   /* NESTED PROCEDURES IS CALLED BY AN EXTERNAL PROCEDURE          */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0365
*   DCL                                                            0365
*     SPLITSAV CHAR(16) BDY(WORD);                                 0365
*   DCL                                                            0366
*     1 LINKAGES BASED(REG13),      /*                       @ZA27486*/
*      2 IDBYTES CHAR(4),           /*                       @ZA27486*/
*      2 BACKCHAN PTR(31),          /*                       @ZA27486*/
*      2 FORCHAIN PTR(31);          /*                       @ZA27486*/
*   DCL                                                            0367
*     SAVER13 PTR(31);              /*                       @ZA27486*/
*                                                                  0368
*   /*****************************************************************/
*   /*                                                               */
*   /* IDCRD06 ENTRY POINT RESTRICT DATA REG                         */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0368
*   RFY                                                            0368
*     REG7 RSTD;                                                   0368
*                                                                  0368
*   /*****************************************************************/
*   /*                                                               */
*   /* SET TRACE AND DUMP POINTS                                     */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0369
*   IF GDTDBG=NULLPTR THEN                                         0369
         L     @06,@PC00001                                        0369
         L     @06,GDTDBG(,@06)                                    0369
         LTR   @06,@06                                             0369
         BZ    @RT00369                                            0369
*     ;                                                            0370
*   ELSE                                                           0371
*     CALL IDCDB010(GDTTBL,'RD60');                                0371
         L     @06,@PC00001                                        0371
         ST    @06,@AL00001                                        0371
         LA    @15,@CC02177                                        0371
         ST    @15,@AL00001+4                                      0371
         MVI   @AL00001+4,X'80'                                    0371
         L     @15,GDTDBG(,@06)                                    0371
         LA    @01,@AL00001                                        0371
         BALR  @14,@15                                             0371
*   OLDERID2=NEWERID2;                                             0372
@RT00369 L     @06,@PC00001                                        0372
         L     @06,GDTTR2(,@06)                                    0372
         MVC   @TS00001(95),NEWERID2(@06)                          0372
         MVC   OLDERID2(95,@06),@TS00001                           0372
*   NEWID2='RD61';                                                 0373
*                                                                  0373
         MVC   NEWID2(4,@06),@CC02178                              0373
*   /*****************************************************************/
*   /*                                                               */
*   /* INITIALIZE DATA AREA POINTERS                                 */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0374
*   DDSTRU=ADDR(DARGL);                                            0374
         LA    @06,DARGL                                           0374
         ST    @06,DDSTRU                                          0374
*   ERCNVADR=ADDR(ERCNVT);                                         0375
         LA    @06,ERCNVT                                          0375
         ST    @06,ERCNVADR                                        0375
*   OPNPTR=REPOPAGL;                                               0376
*                                                                  0376
         L     @06,@PC00001+8                                      0376
         L     OPNPTR,REPOPAGL(,@06)                               0376
*   /*****************************************************************/
*   /*                                                               */
*   /* INITIALIZE AUTOMATIC STORAGE VIA THE PROLOG AND RETURN TO THE */
*   /* CALLER WITHOUT FREEING THE STORAGE                            */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0377
*   STM(REG9,REG12,SPLITSAV);                                      0377
         STM   REG9,REG12,SPLITSAV                                 0377
*   GEN(L REG13,4(,REG13));                                        0378
         L REG13,4(,REG13)
*   GEN(LM REG14,REG6,12(REG13));                                  0379
         LM REG14,REG6,12(REG13)
*   GEN(LM REG9,REG12,56(REG13));                                  0380
         LM REG9,REG12,56(REG13)
*   GEN(SR REG15,REG15);                                           0381
         SR REG15,REG15
*   GEN(BR REG14);                                                 0382
         BR REG14
         EJECT
*                                                                  0383
*/********************************************************************/
*/*                                                                  */
*/* PROCEDURE NAME - IDCRDPT                                         */
*/*                                                                  */
*/* FUNCTION - TO PRINT RECORD INFORMATION TO EITHER SYSPRINT OR     */
*/*            TO AN ALTERNATE REPORT FILE                           */
*/*                                                                  */
*/* ENTRY POINT - IDCRDPT (ONLY ENTRY POINT FOR THIS PROCEDURE)      */
*/*                                                                  */
*/*           LINKAGE - 'CALL IDCRDPT;'                              */
*/*                                                                  */
*/*           INPUT -                                                */
*/*                                                                  */
*/*             PRINT ARGUMENT LIST (SRPRTARG)                       */
*/*                                                                  */
*/*           OUTPUT -                                               */
*/*                                                                  */
*/*             RECORD PRINTED TO EITHER SYSPRINT OR TO AN           */
*/*             AN ALTERNATE REPORT FILE                             */
*/*                                                                  */
*/*           EXIT, NORMAL -                                         */
*/*                                                                  */
*/*             LASTCC = 00            FUNCTION COMPLETED NORMALLY   */
*/*                                                                  */
*/*           EXIT, ERROR -                                          */
*/*                                                                  */
*/*             LASTCC = 12            FUNCTION DID NOT COMPLETE     */
*/*                                                                  */
*/* INTERNAL INTERFACES -                                            */
*/*                                                                  */
*/*      MACROS/SVCS                                                 */
*/*                                                                  */
*/*            ?CALLCKER - REPAIRV MESSAGE WRITER                    */
*/*              WRITES ALL MESSAGES                                 */
*/*              GENERATES A CALL TO IDCRDER                         */
*/*                                                                  */
*/*      PROCEDURES/SUBROUTINES CALLED -                             */
*/*                                                                  */
*/*            NONE                                                  */
*/*                                                                  */
*/*      DATA AREAS                                                  */
*/*                                                                  */
*/*            SRMESTAB - REPAIRV MODIFICATION MESSAGE AREA          */
*/*              CONTAINS MODIFICATION MESSAGES THAT ARE APPLICABLE  */
*/*              TO RECORDS IN THE REPAIR WORKFILE THAT HAVE BEEN    */
*/*              MODIFIED (UNMODIFIED, MODIFIED, DEBLOCKED,          */
*/*              DEBLOCKED/MODIFIED).                                */
*/*                                                                  */
*/*            SRMERTAB - REPAIRV ERROR CODE MESSAGE AREA            */
*/*              CONTAINS THE STATUS MESSAGES THAT ARE APPLICABLE    */
*/*              TO RECORDS READ (NO ERROR, DESTAGE ERROR, OR        */
*/*              STAGE ERROR ON COUNT, KEY, OR DATA)                 */
*/*                                                                  */
*/* EXTERNAL INTERFACES -                                            */
*/*                                                                  */
*/*      MACROS/SVCS                                                 */
*/*                                                                  */
*/*            UPRINT - IDCAMS TEXT PROCESSOR PRINT ROUTINE          */
*/*              DISPLAYS SPECIFIED RECORD ON SYSPRINT OR AN         */
*/*              ALTERNATE REPORT FILE                               */
*/*              GENERATES A CALL TO AMSTP011                        */
*/*                                                                  */
*/*            UDUMP - IDCAMS DUMP POINT ROUTINE                     */
*/*              PRINTS A DUMP AT THE SPECIFIED DUMP POINT           */
*/*              GENERATES A CALL TO MODULE IDCDB01                  */
*/*                                                                  */
*/*            UTRACE - IDCAMS TRACE POINT ROUTINE                   */
*/*              SETS TRACE POINT                                    */
*/*                                                                  */
*/*      PROCEDURES/SUBROUTINES CALLED -                             */
*/*                                                                  */
*/*            NONE                                                  */
*/*                                                                  */
*/*      DATA AREAS -                                                */
*/*                                                                  */
*/*            DARGLIST - IDCAMS TEXT PROCESSOR ARGUMENT LIST        */
*/*              COMMUNICATES THE PRINT ARGUMENTS FOR PRINTING       */
*/*              THE OUTPUT RECORD                                   */
*/*                                                                  */
*/********************************************************************/
*                                                                  0383
*IDCRDPT:                                                          0383
*   PROCEDURE;                                                     0383
*                                                                  0383
@EL00001 L     @13,4(,@13)                                         0383
@EF00001 L     @00,@SIZDATD                                        0383
         LR    @01,@08                                             0383
         FREEMAIN R,LV=(0),A=(1)
@ER00001 LM    @14,@12,12(@13)                                     0383
         BR    @14                                                 0383
IDCRDPT  STM   @14,@12,@SA00002                                    0383
*   /*****************************************************************/
*   /*                                                               */
*   /* CONDITION CODE - SET LASTCC TO 12                             */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0384
*   DCL                                                            0384
*     CC12 FIXED(8) CONSTANT(83);                                  0384
*                                                                  0384
*   /*****************************************************************/
*   /*                                                               */
*   /* CONSTANTS FOR FORMATS (1 THROUGH 6)                           */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0385
*   DCL                                                            0385
*     SRFMT1 FIXED(8) CONSTANT(1);                                 0385
*   DCL                                                            0386
*     SRFMT2 FIXED(8) CONSTANT(2);                                 0386
*   DCL                                                            0387
*     SRFMT3 FIXED(8) CONSTANT(3);                                 0387
*   DCL                                                            0388
*     SRFMT4 FIXED(8) CONSTANT(4);                                 0388
*   DCL                                                            0389
*     SRFMT5 FIXED(8) CONSTANT(5);                                 0389
*   DCL                                                            0390
*     SRFMT6 FIXED(8) CONSTANT(6);                                 0390
*                                                                  0390
*   /*****************************************************************/
*   /*                                                               */
*   /* DARGARY REFERENCE NUMBERS FOR DATA INSERTS                    */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0391
*   DCL                                                            0391
*     SRDARGR1 FIXED(8) CONSTANT(1);                               0391
*   DCL                                                            0392
*     SRDARGR2 FIXED(8) CONSTANT(2);                               0392
*   DCL                                                            0393
*     SRDARGR3 FIXED(8) CONSTANT(3);                               0393
*   DCL                                                            0394
*     SRDARGR4 FIXED(8) CONSTANT(4);                               0394
*   DCL                                                            0395
*     SRDARGR5 FIXED(8) CONSTANT(5);                               0395
*                                                                  0395
*   /*****************************************************************/
*   /*                                                               */
*   /* DARGARY INDEX VALUE                                           */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0396
*   DCL                                                            0396
*     SRDARGX1 FIXED(8) CONSTANT(1);                               0396
*   DCL                                                            0397
*     SRDARGX2 FIXED(8) CONSTANT(2);                               0397
*   DCL                                                            0398
*     SRDARGX3 FIXED(8) CONSTANT(3);                               0398
*   DCL                                                            0399
*     SRDARGX4 FIXED(8) CONSTANT(4);                               0399
*   DCL                                                            0400
*     SRDARGX5 FIXED(8) CONSTANT(5);                               0400
*                                                                  0400
*   /*****************************************************************/
*   /*                                                               */
*   /* COUNT OF NUMBER OF DARGARY LISTS                              */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0401
*   DCL                                                            0401
*     SRDARGC1 FIXED(8) CONSTANT(1);                               0401
*   DCL                                                            0402
*     SRDARGC2 FIXED(8) CONSTANT(2);                               0402
*   DCL                                                            0403
*     SRDARGC3 FIXED(8) CONSTANT(3);                               0403
*   DCL                                                            0404
*     SRDARGC4 FIXED(8) CONSTANT(4);                               0404
*   DCL                                                            0405
*     SRDARGC5 FIXED(8) CONSTANT(5);                               0405
*                                                                  0405
*   /*****************************************************************/
*   /*                                                               */
*   /* LENGTH OF VOLUME SERIAL NUMBER FIELD PASSED                   */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0406
*   DCL                                                            0406
*     SRVOLLEN FIXED(8) CONSTANT(6);                               0406
*                                                                  0406
*   /*****************************************************************/
*   /*                                                               */
*   /* LENGTH OF DATA SET NAME PASSED                                */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0407
*   DCL                                                            0407
*     SRDSLEN FIXED(8) CONSTANT(44);                               0407
*                                                                  0407
*   /*****************************************************************/
*   /*                                                               */
*   /* LENGTH OF MODIFICATION MESSAGE                                */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0408
*   DCL                                                            0408
*     SRMODTL FIXED(8) CONSTANT(18);                               0408
*                                                                  0408
*   /*****************************************************************/
*   /*                                                               */
*   /* LENGTH OF FLAGS MESSAGE                                       */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0409
*   DCL                                                            0409
*     SRERTL FIXED(8) CONSTANT(48);                                0409
*                                                                  0409
*   /*****************************************************************/
*   /*                                                               */
*   /* LENGTH OF COUNT FIELDS                                        */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0410
*   DCL                                                            0410
*     SRCOUNTL FIXED(8) CONSTANT(8);                               0410
*                                                                  0410
*   /*****************************************************************/
*   /*                                                               */
*   /* LENGTH OF CCHHR FIELDS                                        */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0411
*   DCL                                                            0411
*     SRCCHHRL FIXED(8) CONSTANT(5);                               0411
*                                                                  0411
*   /*****************************************************************/
*   /*                                                               */
*   /* FORMAT 1 HEADER MESSAGE ENTRY IN IDCTSRD0                     */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0412
*   DCL                                                            0412
*     SRFOR1H BIT(8) CONSTANT('64'X);                              0412
*                                                                  0412
*   /*****************************************************************/
*   /*                                                               */
*   /* FORMAT 4 HEADER MESSAGE ENTRY IN IDCTSRD0                     */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0413
*   DCL                                                            0413
*     SRFOR4H BIT(8) CONSTANT('65'X);                              0413
*                                                                  0413
*   /*****************************************************************/
*   /*                                                               */
*   /* FORMAT 2+3 HEADER MESSAGE ENTRY IN IDCTSRD0                   */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0414
*   DCL                                                            0414
*     SRFOR23H BIT(8) CONSTANT('66'X);                             0414
*                                                                  0414
*   /*****************************************************************/
*   /*                                                               */
*   /* FORMAT 5+6 HEADER MESSAGE ENTRY IN IDCTSRD0                   */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0415
*   DCL                                                            0415
*     SRFOR56H BIT(8) CONSTANT('67'X);                             0415
*                                                                  0415
*   /*****************************************************************/
*   /*                                                               */
*   /* FORMAT 4 RECORD ID TITLE LINE MSG ENTRY IN IDCTSRD0           */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0416
*   DCL                                                            0416
*     SRFOR4R BIT(8) CONSTANT('68'X);                              0416
*                                                                  0416
*   /*****************************************************************/
*   /*                                                               */
*   /* FORMAT 5+6 RECORD ID TITLE LINE MSG ENTRY IN IDCTSRD0         */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0417
*   DCL                                                            0417
*     SRFOR56R BIT(8) CONSTANT('69'X);                             0417
*                                                                  0417
*   /*****************************************************************/
*   /*                                                               */
*   /* FORMAT 1 RECORD ID INFO LINE MESSAGE ENTRY IN IDCTSRD0        */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0418
*   DCL                                                            0418
*     SRFOR1RL BIT(8) CONSTANT('6A'X);                             0418
*                                                                  0418
*   /*****************************************************************/
*   /*                                                               */
*   /* FORMAT 4 RECORD ID INFO LINE MSG ENTRY IN IDCTSRD0            */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0419
*   DCL                                                            0419
*     SRFOR4RL BIT(8) CONSTANT('6B'X);                             0419
*                                                                  0419
*   /*****************************************************************/
*   /*                                                               */
*   /* FORMAT 2+3 RECORD ID INFO LINE MSG ENTRY IN IDCTSRD0          */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0420
*   DCL                                                            0420
*     SRFOR23L BIT(8) CONSTANT('6C'X);                             0420
*                                                                  0420
*   /*****************************************************************/
*   /*                                                               */
*   /* FORMAT 5+6 RECORD ID INFO LINE MSG ENTRY IN IDCTSRD0          */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0421
*   DCL                                                            0421
*     SRFOR56L BIT(8) CONSTANT('6D'X);                             0421
*                                                                  0421
*   /*****************************************************************/
*   /*                                                               */
*   /* FORMAT 4+5+6 RECORD TITLE LINE MSG ENTRY IN IDCTSRD0          */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0422
*   DCL                                                            0422
*     SRFORRTL BIT(8) CONSTANT('6E'X);                             0422
*                                                                  0422
*   /*****************************************************************/
*   /*                                                               */
*   /* FORMAT 4+5+6 RECORD HEX LINE MSG ENTRY IN IDCTSRD0            */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0423
*   DCL                                                            0423
*     SRFORHEX BIT(8) CONSTANT('6F'X);                             0423
*                                                                  0423
*   /*****************************************************************/
*   /*                                                               */
*   /* FORMAT 4+5+6 RECORD CHAR LINE MSG ENTRY IN IDCTSRD0           */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0424
*   DCL                                                            0424
*     SRFORCHA BIT(8) CONSTANT('70'X);                             0424
*                                                                  0424
*   /*****************************************************************/
*   /*                                                               */
*   /* FORMAT 4+5+6 HEX+CHAR LINE MSG ENTRY IN IDCTSRD0              */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0425
*   DCL                                                            0425
*     SRFORBTH BIT(8) CONSTANT('71'X);                             0425
*                                                                  0425
*   /*****************************************************************/
*   /*                                                               */
*   /* MESSAGE STATIC TEXT MODULE ID RD0                             */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0426
*   DCL                                                            0426
*     SRMSGID CHAR(3) CONSTANT('RD0');                             0426
*                                                                  0426
*   /*****************************************************************/
*   /*                                                               */
*   /* DATA SET NAME WHEN STAGINGPACK SPECIFIED                      */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0427
*   DCL                                                            0427
*     SRSTAGPK CHAR(44) INIT('STAGINGPACK');                       0427
*                                                                  0427
*   /*****************************************************************/
*   /*                                                               */
*   /* FORMAT TYPE REQUESTED (1 TO 6)                                */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0428
*   DCL                                                            0428
*     SRFINDEX FIXED(8);                                           0428
*                                                                  0428
*   /*****************************************************************/
*   /*                                                               */
*   /* POINTER TO RECORD                                             */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0429
*   DCL                                                            0429
*     SRPOINT PTR(31);                                             0429
*                                                                  0429
*   /*****************************************************************/
*   /*                                                               */
*   /* ADDRESSABILITY FOR KEY AND DATA LENGTH OF READ-IN RECD        */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0430
*   DCL                                                            0430
*     SRKLEN FIXED(8) BASED(SRRECPTR+5);                           0430
*   DCL                                                            0431
*     SRDATL FIXED(15) BASED(SRRECPTR+6);                          0431
*                                                                  0431
*   /*****************************************************************/
*   /*                                                               */
*   /* RECORD LENGTH                                                 */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0432
*   DCL                                                            0432
*     SRLENCTR FIXED(31);                                          0432
*                                                                  0432
*   /*****************************************************************/
*   /*                                                               */
*   /* ADDRESSABILITY TO MESSAGE FLAGS ERROR CODE INDEX              */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0433
*   DCL                                                            0433
*     SRHDERHH CHAR(2) BASED(SRERCODE);                            0433
*                                                                  0433
*   /*****************************************************************/
*   /*                                                               */
*   /* AREA TO SAVE THE MESSAGE FLAGS ERROR CODE INDEX               */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0434
*   DCL                                                            0434
*     SRHDERCD CHAR(2);                                            0434
*                                                                  0434
*   /*****************************************************************/
*   /*                                                               */
*   /* END OF FILE RETURN CODE                                       */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0435
*   DCL                                                            0435
*     RETCD29 FIXED(15) INIT(29);                                  0435
*                                                                  0435
*   /*****************************************************************/
*   /*                                                               */
*   /* END OF FILE RETURN CODE AREA                                  */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0436
*   DCL                                                            0436
*     RCAREA FIXED(15) BASED(SRERCODE);                            0436
*                                                                  0436
*   /*****************************************************************/
*   /*                                                               */
*   /* END OF FILE MESSAGE                                   @ZA25908*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0437
*   DCL                                                            0437
*     EOFMSG CHAR(9) INIT('** EOF **');/*                    @ZA25908*/
*                                                                  0437
*   /*****************************************************************/
*   /*                                                               */
*   /* END OF FILE MESSAGE LENGTH                                    */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0438
*   DCL                                                            0438
*     EOFMSGLN FIXED(8) INIT(9);                                   0438
*                                                                  0438
*   /*****************************************************************/
*   /*                                                               */
*   /* TABLE OF MODIFICATIONS FIELD MESSAGES                         */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0439
*   DCL                                                            0439
*     1 SRMESTAB CHAR(72) STATIC LOCAL,                            0439
*      2 SRMEST1 CHAR(18) INIT('UNMODIFIED        '),              0439
*      2 SRMEST2 CHAR(18) INIT('MODIFIED          '),              0439
*      2 SRMEST3 CHAR(18) INIT('DEBLOCKED         '),              0439
*      2 SRMEST4 CHAR(18) INIT('DEBLOCKED/MODIFIED');              0439
*                                                                  0439
*   /*****************************************************************/
*   /*                                                               */
*   /* TABLE OF ERROR CODE FLAG FIELD MESSAGES                       */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0440
*   DCL                                                            0440
*     1 SRMERTAB CHAR(29*48) STATIC LOCAL,                         0440
*      2 * CHAR(48) INIT('GOOD COUNT,GOOD KEY/DATA'),              0440
*      2 * CHAR(48) INIT('GOOD COUNT,BAD KEY/DATA'),               0440
*      2 * CHAR(48) INIT('GOOD COUNT,DESTAGE ERROR ON KEY/DATA'),  0440
*      2 * CHAR(48) INIT('GOOD COUNT,OVERFLOW,GOOD KEY/DATA'),     0440
*      2 * CHAR(48) INIT('GOOD COUNT,STAGE ERROR ON DATA'),        0440
*      2 * CHAR(48) INIT(' '),                                     0440
*      2 * CHAR(48) INIT('BAD COUNT,GOOD KEY/DATA'),               0440
*      2 * CHAR(48) INIT(                                          0440
*            'DESTAGE ERROR ON COUNT,DESTAGE ERROR ON KEY/DATA'),  0440
*      2 * CHAR(48) INIT(                                          0440
*            'STAGE ERROR ON COUNT,DESTAGE ERROR ON KEY/DATA'),    0440
*      2 * CHAR(48) INIT('STAGE ERROR ON COUNT,STAGE ERROR ON KEY/DATA'
*            ),                                                    0440
*      2 * CHAR(48) INIT(                                          0440
*            'STAGE ERROR ON COUNT,DESTG ERROR ON K/D,OVERFLOW'),  0440
*      2 * CHAR(48) INIT(                                          0440
*            'STAGE ERROR ON COUNT,STAGE ERROR ON K/D,OVERFLOW'),  0440
*      2 * CHAR(48) INIT(' '),                                     0440
*      2 * CHAR(48) INIT(' '),                                     0440
*      2 * CHAR(48) INIT(' '),                                     0440
*      2 * CHAR(48) INIT('GOOD COUNT,BAD KEY/DATA'),               0440
*      2 * CHAR(48) INIT(' '),                                     0440
*      2 * CHAR(48) INIT('BAD COUNT'),                             0440
*      2 * CHAR(48) INIT('BAD COUNT, BAD KEY/DATA'),               0440
*      2 * CHAR(48) INIT('DESTAGE ERROR ON COUNT,BAD KEY/DATA'),   0440
*      2 * CHAR(48) INIT('STAGE ERROR ON COUNT,BAD KEY/DATA'),     0440
*      2 * CHAR(48) INIT(' '),      /* RETURN CODE 22                */
*      2 * CHAR(48) INIT(' '),      /* RETURN CODE 23                */
*      2 * CHAR(48) INIT(' '),      /* RETURN CODE 24                */
*      2 * CHAR(48) INIT(' '),      /* RETURN CODE 25                */
*      2 * CHAR(48) INIT(' '),      /* RETURN CODE 26                */
*      2 * CHAR(48) INIT(' '),      /* RETURN CODE 27                */
*      2 * CHAR(48) INIT(' '),      /* RETURN CODE 28                */
*      2 * CHAR(48) INIT('END OF FILE RECORD');                    0440
         EJECT
*                                                                  0441
*   /*****************************************************************/
*   /*                                                               */
*   /* INITIALIZE PREVIOUSLY SAVED CODEREGS TO ALLOW ENTRY HERE      */
*   /* WITHOUT STANDARD PROLOGUE                                     */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0441
*   GEN(ENTRY IDCRDPT);                                            0441
         ENTRY IDCRDPT
*   LM(REG9,REG12,SPLITSAV);                                       0442
         LM    REG9,REG12,SPLITSAV                                 0442
*                                                                  0443
*   /*****************************************************************/
*   /*                                                               */
*   /* DETERMINE WHICH FORMAT WILL BE PRINTED BASED ON PARAMETERS    */
*   /* PASSED BY THE CALLER AND THE IDONLY PARAMETER OF THE FDT      */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0443
*   IF GDTDBG=NULLPTR THEN                                         0443
         L     @06,@PC00001                                        0443
         L     @06,GDTDBG(,@06)                                    0443
         LTR   @06,@06                                             0443
         BZ    @RT00443                                            0443
*     ;                                                            0444
*   ELSE                                                           0445
*     CALL IDCDB010(GDTTBL,'RD63');                                0445
         L     @06,@PC00001                                        0445
         ST    @06,@AL00001                                        0445
         LA    @15,@CC02351                                        0445
         ST    @15,@AL00001+4                                      0445
         MVI   @AL00001+4,X'80'                                    0445
         L     @15,GDTDBG(,@06)                                    0445
         LA    @01,@AL00001                                        0445
         BALR  @14,@15                                             0445
*   OLDERID2=NEWERID2;                                             0446
@RT00443 L     @06,@PC00001                                        0446
         L     @06,GDTTR2(,@06)                                    0446
         MVC   @TS00001(95),NEWERID2(@06)                          0446
         MVC   OLDERID2(95,@06),@TS00001                           0446
*   NEWID2='RD64';                                                 0447
         MVC   NEWID2(4,@06),@CC02352                              0447
*   IF SRVRECL^=NULLPTR                                            0448
*                                                                  0448
*/********************************************************************/
*/*                                                                  */
*/* THE FOLLOWING MATRIX INDICATES THE FIELDS THAT MUST BE           */
*/* FILLED IN IN THE PRINT ARGUMENT LIST SRPRTARG WHEN               */
*/* ROUTINE IDCRDPT IS CALLED                                        */
*/*                                                                  */
*/* FIELD        FORMAT1 FORMAT2 FORMAT3 FORMAT4 FORMAT5 FORMAT6     */
*/*                                                                  */
*/* SRVRECL      YES     NO      NO      YES     NO      NO          */
*/* SRVREPTR     YES     NO      NO      YES     NO      NO          */
*/* SRDSNHDR     YES     NO      NO      YES     NO      NO          */
*/* SRVOLPTR     YES     YES     YES     YES     YES     YES         */
*/* SRRWFDSN     YES     NO      NO      YES     NO      NO          */
*/* SRRWFKEY     YES     NO      NO      YES     NO      NO          */
*/* SRERCODE     NO      YES     YES     YES     YES     YES         */
*/* SRDSNPTR     NO      YES     NO      NO      YES     NO          */
*/* SRSPRECL     NO      NO      NO      NO      NO      YES         */
*/* SRRECPTR     NO      YES     NO      NO      YES     YES         */
*/* SRCCHHRP     NO      NO      YES     NO      NO      YES         */
*/*                                                                  */
*/********       IDONLY  IDONLY  IDONLY  FULLREC FULLREC  FULLREC    */
*/********       REPWRKF DATASET STGPACK REPWRKF DATASET  STGPACK    */
*/********************************************************************/
*                                                                  0448
*     THEN                                                         0448
         SLR   @06,@06                                             0448
         L     @15,@PC00001+8                                      0448
         L     @01,REPSPRIT(,@15)                                  0448
         C     @06,SRVRECL(,@01)                                   0448
         BE    @RF00448                                            0448
*     DO;                                                          0449
*       IF ADDR(IDONL)^=NULLPTR THEN                               0450
         L     @15,@PC00001+4                                      0450
         C     @06,FDTPTR+40(,@15)                                 0450
         BE    @RF00450                                            0450
*         SRFINDEX=SRFMT1;                                         0451
         LA    SRFINDEX,1                                          0451
*       ELSE                                                       0452
*         SRFINDEX=SRFMT4;                                         0452
         B     @RC00450                                            0452
@RF00450 LA    SRFINDEX,4                                          0452
*     END;                                                         0453
*   ELSE                                                           0454
*     DO;                                                          0454
         B     @RC00448                                            0454
@RF00448 DS    0H                                                  0455
*       IF SRDSNPTR^=NULLPTR THEN                                  0455
         SLR   @06,@06                                             0455
         L     @15,@PC00001+8                                      0455
         L     @01,REPSPRIT(,@15)                                  0455
         C     @06,SRDSNPTR(,@01)                                  0455
         BE    @RF00455                                            0455
*         DO;                                                      0456
*           IF ADDR(IDONL)^=NULLPTR THEN                           0457
         L     @15,@PC00001+4                                      0457
         C     @06,FDTPTR+40(,@15)                                 0457
         BE    @RF00457                                            0457
*             SRFINDEX=SRFMT2;                                     0458
         LA    SRFINDEX,2                                          0458
*           ELSE                                                   0459
*             SRFINDEX=SRFMT5;                                     0459
         B     @RC00457                                            0459
@RF00457 LA    SRFINDEX,5                                          0459
*         END;                                                     0460
*       ELSE                                                       0461
*         DO;                                                      0461
         B     @RC00455                                            0461
@RF00455 DS    0H                                                  0462
*           IF ADDR(IDONL)^=NULLPTR THEN                           0462
         L     @06,@PC00001+4                                      0462
         L     @06,FDTPTR+40(,@06)                                 0462
         LTR   @06,@06                                             0462
         BZ    @RF00462                                            0462
*             SRFINDEX=SRFMT3;                                     0463
         LA    SRFINDEX,3                                          0463
*           ELSE                                                   0464
*             SRFINDEX=SRFMT6;                                     0464
         B     @RC00462                                            0464
@RF00462 LA    SRFINDEX,6                                          0464
*         END;                                                     0465
@RC00462 DS    0H                                                  0466
*     END;                                                         0466
*                                                                  0466
@RC00455 DS    0H                                                  0467
*   /*****************************************************************/
*   /*                                                               */
*   /* IF THIS IS THE FIRST REPORT PAGE THE HEADER MUST BE FORCED    */
*   /* (UPRINT) TO PRINT.                                            */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0467
*   IF REPSRPRT=OFF THEN                                           0467
@RC00448 L     @06,@PC00001+8                                      0467
         TM    REPSRPRT(@06),B'10000000'                           0467
         BNZ   @RF00467                                            0467
*     DO;                                                          0468
*                                                                  0468
*       /*************************************************************/
*       /*                                                           */
*       /* THIS CODE EXECUTED ON INITIAL ENTRY TO IDCRDPT TO ENSURE  */
*       /* HEADER PROCESSING ON ALL PAGES OF REPORT                  */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0469
*       REPSRPRT=ON;                                               0469
         OI    REPSRPRT(@06),B'10000000'                           0469
*       DARGL=DARGL&&DARGL;                                        0470
         XC    DARGL(100),DARGL                                    0470
*       DARGSMOD=SRMSGID;                                          0471
         L     @05,DDSTRU                                          0471
         MVC   DARGSMOD(3,@05),@CC02242                            0471
*       DARGINS(SRDARGX2)=SRDARGR2;                                0472
         MVC   DARGINS+8(2,@05),@CH00155                           0472
*       DARGINL(SRDARGX2)=SRVOLLEN;                                0473
         MVC   DARGINL+8(2,@05),@CH00158                           0473
*       DARGDTM(SRDARGX2)=SRVOLPTR;                                0474
*                                                                  0474
         L     @06,REPSPRIT(,@06)                                  0474
         L     @06,SRVOLPTR(,@06)                                  0474
         ST    @06,DARGDTM+8(,@05)                                 0474
*       /*************************************************************/
*       /*                                                           */
*       /* FILL IN FIELDS OF DARGLIST COMMON TO FORMAT 1 & 4         */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0475
*       IF SRFINDEX=SRFMT1×SRFINDEX=SRFMT4 THEN                    0475
         C     SRFINDEX,@CF00220                                   0475
         BE    @RT00475                                            0475
         C     SRFINDEX,@CF00044                                   0475
         BNE   @RF00475                                            0475
@RT00475 DS    0H                                                  0476
*         DO;                                                      0476
*           DARGCNT=SRDARGC3;                                      0477
         LA    @06,3                                               0477
         L     @05,DDSTRU                                          0477
         STH   @06,DARGCNT(,@05)                                   0477
*           DARGINS(SRDARGX1)=SRDARGR1;                            0478
         MVC   DARGINS(2,@05),@CH00220                             0478
*           DARGINL(SRDARGX1)=SRDSLEN;                             0479
         LA    @15,44                                              0479
         STH   @15,DARGINL(,@05)                                   0479
*           DARGDTM(SRDARGX1)=SRRWFDSN;                            0480
*                                                                  0480
         L     @14,@PC00001+8                                      0480
         L     @14,REPSPRIT(,@14)                                  0480
         L     @03,SRRWFDSN(,@14)                                  0480
         ST    @03,DARGDTM(,@05)                                   0480
*           /*********************************************************/
*           /*                                                       */
*           /* OVERLAY COMMON DARGLIST VOLSER FIELD BECAUSE FORMATS 1*/
*           /* AND 4 HAVE AN EXTRA INSERT FIELD                      */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0481
*           DARGINS(SRDARGX2)=SRDARGR2;                            0481
         MVC   DARGINS+8(2,@05),@CH00155                           0481
*           DARGINL(SRDARGX2)=SRDSLEN;                             0482
         STH   @15,DARGINL+8(,@05)                                 0482
*           DARGDTM(SRDARGX2)=SRDSNHDR;                            0483
         L     @15,SRDSNHDR(,@14)                                  0483
         ST    @15,DARGDTM+8(,@05)                                 0483
*           DARGINS(SRDARGX3)=SRDARGR3;                            0484
         STH   @06,DARGINS+16(,@05)                                0484
*           DARGINL(SRDARGX3)=SRVOLLEN;                            0485
         MVC   DARGINL+16(2,@05),@CH00158                          0485
*           DARGDTM(SRDARGX3)=SRVOLPTR;                            0486
*                                                                  0486
         L     @06,SRVOLPTR(,@14)                                  0486
         ST    @06,DARGDTM+16(,@05)                                0486
*           /*********************************************************/
*           /*                                                       */
*           /* SET UP FOR MESSAGE FOR FORMAT 1                       */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0487
*           DARGSENT=SRFOR1H;                                      0487
         MVI   DARGSENT(@05),X'64'                                 0487
*           IF SRFINDEX=SRFMT4 THEN                                0488
*                                                                  0488
         C     SRFINDEX,@CF00044                                   0488
         BNE   @RF00488                                            0488
*             /*******************************************************/
*             /*                                                     */
*             /* IF FORMAT 4 CHANGE MESSAGE ID                       */
*             /*                                                     */
*             /*******************************************************/
*                                                                  0489
*             DARGSENT=SRFOR4H;                                    0489
         MVI   DARGSENT(@05),X'65'                                 0489
*           ELSE                                                   0490
*             ;                                                    0490
@RF00488 DS    0H                                                  0491
*         END;                                                     0491
*       ELSE                                                       0492
*         DO;                                                      0492
*                                                                  0492
         B     @RC00475                                            0492
@RF00475 DS    0H                                                  0493
*           /*********************************************************/
*           /*                                                       */
*           /* FILL IN FORMAT 2,3,4,& 6 COMMON FIELDS                */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0493
*           DARGCNT=SRDARGC2;                                      0493
         LA    @06,2                                               0493
         L     @05,DDSTRU                                          0493
         STH   @06,DARGCNT(,@05)                                   0493
*           DARGINS(SRDARGX1)=SRDARGR1;                            0494
         MVC   DARGINS(2,@05),@CH00220                             0494
*           DARGINL(SRDARGX1)=SRDSLEN;                             0495
         MVC   DARGINL(2,@05),@CH00599                             0495
*           IF SRFINDEX=SRFMT2×SRFINDEX=SRFMT5 THEN                0496
*                                                                  0496
         CR    SRFINDEX,@06                                        0496
         BE    @RT00496                                            0496
         C     SRFINDEX,@CF00287                                   0496
         BNE   @RF00496                                            0496
@RT00496 DS    0H                                                  0497
*             /*******************************************************/
*             /*                                                     */
*             /* UNIQUE DATA SET NAMES FOR FORMAT 2 AND 5            */
*             /*                                                     */
*             /*******************************************************/
*                                                                  0497
*             DARGDTM(SRDARGX1)=SRDSNPTR;                          0497
         L     @06,@PC00001+8                                      0497
         L     @06,REPSPRIT(,@06)                                  0497
         L     @06,SRDSNPTR(,@06)                                  0497
         L     @05,DDSTRU                                          0497
         ST    @06,DARGDTM(,@05)                                   0497
*           ELSE                                                   0498
*                                                                  0498
*             /*******************************************************/
*             /*                                                     */
*             /* UNIQUE MESSAGE ADDRESS FOR FORMAT 3 AND 6           */
*             /*                                                     */
*             /*******************************************************/
*                                                                  0498
*             DARGDTM(SRDARGX1)=ADDR(SRSTAGPK);                    0498
         B     @RC00496                                            0498
@RF00496 LA    @06,SRSTAGPK                                        0498
         L     @05,DDSTRU                                          0498
         ST    @06,DARGDTM(,@05)                                   0498
*           IF SRFINDEX=SRFMT2×SRFINDEX=SRFMT3 THEN                0499
*                                                                  0499
@RC00496 C     SRFINDEX,@CF00155                                   0499
         BE    @RT00499                                            0499
         C     SRFINDEX,@CF00164                                   0499
         BNE   @RF00499                                            0499
@RT00499 DS    0H                                                  0500
*             /*******************************************************/
*             /*                                                     */
*             /* MESSAGE ID FOR FORMAT 2 AND 3 HEADER                */
*             /*                                                     */
*             /*******************************************************/
*                                                                  0500
*             DARGSENT=SRFOR23H;                                   0500
         L     @06,DDSTRU                                          0500
         MVI   DARGSENT(@06),X'66'                                 0500
*           ELSE                                                   0501
*                                                                  0501
*             /*******************************************************/
*             /*                                                     */
*             /* MESSAGE ID FOR FORMAT 5 & 6 HEADER                  */
*             /*                                                     */
*             /*******************************************************/
*                                                                  0501
*             DARGSENT=SRFOR56H;                                   0501
         B     @RC00499                                            0501
@RF00499 L     @06,DDSTRU                                          0501
         MVI   DARGSENT(@06),X'67'                                 0501
*         END;                                                     0502
*                                                                  0502
@RC00499 DS    0H                                                  0503
*       /*************************************************************/
*       /*                                                           */
*       /* PRINT HEADER TO ALTERNATE FILE IF REPARFIO ^= 0 OR ELSE TO*/
*       /* SYSPRINT                                                  */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0503
*       CALL AMSTP011(GDTTBL,REPARFIO,DDSTRU);                     0503
@RC00475 L     @06,@PC00001                                        0503
         ST    @06,@AL00001                                        0503
         L     @05,@PC00001+8                                      0503
         LA    @05,REPARFIO(,@05)                                  0503
         ST    @05,@AL00001+4                                      0503
         LA    @05,DDSTRU                                          0503
         ST    @05,@AL00001+8                                      0503
         MVI   @AL00001+8,X'80'                                    0503
         L     @15,GDTPRT(,@06)                                    0503
         LA    @01,@AL00001                                        0503
         BALR  @14,@15                                             0503
*       RESPECIFY                                                  0504
*         RTNREG RSTD;                                             0504
*       TESTRC=RTNREG;                                             0505
         LR    TESTRC,RTNREG                                       0505
*       RESPECIFY                                                  0506
*         RTNREG UNRSTD;                                           0506
*                                                                  0506
*       /*************************************************************/
*       /*                                                           */
*       /* IF UPRINT HAS RETURNED A NON-ZERO RETURN CODE CALL IDCRDER*/
*       /* TO SET LASTCC VALUE FOR AMS                               */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0507
*       IF TESTRC^=0 THEN                                          0507
         LTR   TESTRC,TESTRC                                       0507
         BZ    @RF00507                                            0507
*         DO;                                                      0508
*           DO;                                                    0509
*             CKREQ=CKREQ&&CKREQ;                                  0510
         L     @06,@PC00001+8                                      0510
         XC    CKREQ(44,@06),CKREQ(@06)                            0510
*             CKRERN=CC12;                                         0511
         MVC   CKRERN(2,@06),@CH02185                              0511
*             CALL IDCRDER;                                        0512
         BAL   @14,IDCRDER                                         0512
*           END;                                                   0513
*           RETURN CODE(LASTCC12);                                 0514
         LA    @15,12                                              0514
         L     @14,@SA00002                                        0514
         LM    @00,@12,@SA00002+8                                  0514
         BR    @14                                                 0514
*         END;                                                     0515
*       ELSE                                                       0516
*         ;                                                        0516
@RF00507 DS    0H                                                  0517
*     END;                                                         0517
*   ELSE                                                           0518
*     ;                                                            0518
@RF00467 DS    0H                                                  0519
*                                                                  0519
*   /*****************************************************************/
*   /*                                                               */
*   /* CLEAR THE DARGLIST BEFORE NEXT UPRINT                         */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0519
*   DARGL=DARGL&&DARGL;                                            0519
*                                                                  0519
         XC    DARGL(100),DARGL                                    0519
*   /*****************************************************************/
*   /*                                                               */
*   /* INDICATE 'RD0' STATIC TEXT MODULE                             */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0520
*   DARGSMOD=SRMSGID;                                              0520
*                                                                  0520
         L     @06,DDSTRU                                          0520
         MVC   DARGSMOD(3,@06),@CC02242                            0520
*   /*****************************************************************/
*   /*                                                               */
*   /* IF FORMAT 4, SET MESSAGE ID TO PRINT RECID-MODS-FLAGS- COUNT  */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0521
*   IF SRFINDEX=SRFMT4 THEN                                        0521
         C     SRFINDEX,@CF00044                                   0521
         BNE   @RF00521                                            0521
*     DARGSENT=SRFOR4R;                                            0522
         MVI   DARGSENT(@06),X'68'                                 0522
*   ELSE                                                           0523
*     ;                                                            0523
*                                                                  0523
@RF00521 DS    0H                                                  0524
*   /*****************************************************************/
*   /*                                                               */
*   /* IF FORMAT 5 OR 6, SET MESSAGE ID TO PRINT RECID-FLAGS -COUNT  */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0524
*   IF SRFINDEX=SRFMT5×SRFINDEX=SRFMT6 THEN                        0524
         C     SRFINDEX,@CF00287                                   0524
         BE    @RT00524                                            0524
         C     SRFINDEX,@CF00158                                   0524
         BNE   @RF00524                                            0524
@RT00524 DS    0H                                                  0525
*     DARGSENT=SRFOR56R;                                           0525
         L     @06,DDSTRU                                          0525
         MVI   DARGSENT(@06),X'69'                                 0525
*   ELSE                                                           0526
*     ;                                                            0526
@RF00524 DS    0H                                                  0527
*   IF SRFINDEX>SRFMT3 THEN                                        0527
         C     SRFINDEX,@CF00164                                   0527
         BNH   @RF00527                                            0527
*     DO;                                                          0528
*                                                                  0528
*       /*************************************************************/
*       /*                                                           */
*       /* PRINT TITLE RECORD FOR FORMATS 4,5, AND 6                 */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0529
*       CALL AMSTP011(GDTTBL,REPARFIO,DDSTRU);                     0529
         L     @06,@PC00001                                        0529
         ST    @06,@AL00001                                        0529
         L     @05,@PC00001+8                                      0529
         LA    @05,REPARFIO(,@05)                                  0529
         ST    @05,@AL00001+4                                      0529
         LA    @05,DDSTRU                                          0529
         ST    @05,@AL00001+8                                      0529
         MVI   @AL00001+8,X'80'                                    0529
         L     @15,GDTPRT(,@06)                                    0529
         LA    @01,@AL00001                                        0529
         BALR  @14,@15                                             0529
*       RESPECIFY                                                  0530
*         RTNREG RSTD;                                             0530
*       TESTRC=RTNREG;                                             0531
         LR    TESTRC,RTNREG                                       0531
*       RESPECIFY                                                  0532
*         RTNREG UNRSTD;                                           0532
*                                                                  0532
*       /*************************************************************/
*       /*                                                           */
*       /* IF UPRINT ERROR CALL CALLCKER, SET LASTCC AND RETURN WITH */
*       /* CONDITION CODE 12                                         */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0533
*       IF TESTRC^=0 THEN                                          0533
         LTR   TESTRC,TESTRC                                       0533
         BZ    @RF00533                                            0533
*         DO;                                                      0534
*           DO;                                                    0535
*             CKREQ=CKREQ&&CKREQ;                                  0536
         L     @06,@PC00001+8                                      0536
         XC    CKREQ(44,@06),CKREQ(@06)                            0536
*             CKRERN=CC12;                                         0537
         MVC   CKRERN(2,@06),@CH02185                              0537
*             CALL IDCRDER;                                        0538
         BAL   @14,IDCRDER                                         0538
*           END;                                                   0539
*           RETURN CODE(LASTCC12);                                 0540
         LA    @15,12                                              0540
         L     @14,@SA00002                                        0540
         LM    @00,@12,@SA00002+8                                  0540
         BR    @14                                                 0540
*         END;                                                     0541
*       ELSE                                                       0542
*         ;                                                        0542
@RF00533 DS    0H                                                  0543
*     END;                                                         0543
*                                                                  0543
*   /*****************************************************************/
*   /*                                                               */
*   /* CLEAR THE DARGLIST BEFORE NEXT UPRINT INDICATE 'RD0' STATIC   */
*   /* TEXT MODULE                                                   */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0544
*   DARGL=DARGL&&DARGL;                                            0544
@RF00527 XC    DARGL(100),DARGL                                    0544
*   DARGSMOD=SRMSGID;                                              0545
         L     @06,DDSTRU                                          0545
         MVC   DARGSMOD(3,@06),@CC02242                            0545
*   RESPECIFY                                                      0546
*     RWFR BASED(SRVREPTR);                                        0546
*                                                                  0546
*   /*****************************************************************/
*   /*                                                               */
*   /* CONSTRUCT RECORD ID INFORMATION LINE FROM FORMAT DEPENDENT    */
*   /* SOURCES                                                       */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0547
*   IF SRFINDEX=SRFMT1×SRFINDEX=SRFMT4 THEN                        0547
         C     SRFINDEX,@CF00220                                   0547
         BE    @RT00547                                            0547
         C     SRFINDEX,@CF00044                                   0547
         BNE   @RF00547                                            0547
@RT00547 DS    0H                                                  0548
*     DO;                                                          0548
*                                                                  0548
*       /*************************************************************/
*       /*                                                           */
*       /* FILL FORMAT 1 DARGLIST WITH DATA INSERTS                  */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0549
*       DARGCNT=SRDARGC4;                                          0549
         LA    @06,4                                               0549
         L     @05,DDSTRU                                          0549
         STH   @06,DARGCNT(,@05)                                   0549
*       DARGSENT=SRFOR1RL;                                         0550
         MVI   DARGSENT(@05),X'6A'                                 0550
*       DARGINS(SRDARGX1)=SRDARGR1;                                0551
         MVC   DARGINS(2,@05),@CH00220                             0551
*       DARGINL(SRDARGX1)=SRVOLLEN;                                0552
         LA    @15,6                                               0552
         STH   @15,DARGINL(,@05)                                   0552
*       DARGDTM(SRDARGX1)=SRRWFKEY;                                0553
         L     @14,@PC00001+8                                      0553
         L     @14,REPSPRIT(,@14)                                  0553
         L     @03,SRRWFKEY(,@14)                                  0553
         ST    @03,DARGDTM(,@05)                                   0553
*       DARGINS(SRDARGX2)=SRDARGR2;                                0554
         MVC   DARGINS+8(2,@05),@CH00155                           0554
*       DARGINL(SRDARGX2)=SRCCHHRL;                                0555
         LA    @02,5                                               0555
         STH   @02,DARGINL+8(,@05)                                 0555
*       DARGDTM(SRDARGX2)=SRRWFKEY+SRVOLLEN;                       0556
         ALR   @03,@15                                             0556
         ST    @03,DARGDTM+8(,@05)                                 0556
*       DARGINS(SRDARGX3)=SRDARGR3;                                0557
         MVC   DARGINS+16(2,@05),@CH00164                          0557
*       DARGINL(SRDARGX3)=SRMODTL;                                 0558
*                                                                  0558
         LA    @15,18                                              0558
         STH   @15,DARGINL+16(,@05)                                0558
*       /*************************************************************/
*       /*                                                           */
*       /* OBTAIN MODIFICATION FIELD FROM VSAM RECORD TO PASS ADDRESS*/
*       /* OF APPROPRIATE MOD MESSAGE                                */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0559
*       DARGDTM(SRDARGX3)=ADDR(SRMESTAB)+(SRMODTL*RWFRF1);         0559
*                                                                  0559
         LA    @03,SRMESTAB                                        0559
         L     @14,SRVREPTR(,@14)                                  0559
         LR    @01,@15                                             0559
         SLR   @15,@15                                             0559
         IC    @15,RWFRF1(,@14)                                    0559
         MR    @00,@15                                             0559
         ALR   @03,@01                                             0559
         ST    @03,DARGDTM+16(,@05)                                0559
*       /*************************************************************/
*       /*                                                           */
*       /* OBTAIN FLAGS FIELD FROM VSAM RECORD TO PASS APPROPRIATE   */
*       /* ERROR FLAGS MESSAGE                                       */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0560
*       DARGINS(SRDARGX4)=SRDARGR4;                                0560
         STH   @06,DARGINS+24(,@05)                                0560
*       DARGINL(SRDARGX4)=SRERTL;                                  0561
         LA    @15,48                                              0561
         STH   @15,DARGINL+24(,@05)                                0561
*       DARGDTM(SRDARGX4)=ADDR(SRMERTAB)+(SRERTL*(RWFRF2-1));      0562
         LA    @03,SRMERTAB                                        0562
         LH    @01,RWFRF2(,@14)                                    0562
         N     @01,@CF03487                                        0562
         BCTR  @01,0                                               0562
         MR    @00,@15                                             0562
         ALR   @03,@01                                             0562
         ST    @03,DARGDTM+24(,@05)                                0562
*       IF SRFINDEX=SRFMT4 THEN                                    0563
         CR    SRFINDEX,@06                                        0563
         BNE   @RF00563                                            0563
*         DO;                                                      0564
*                                                                  0564
*           /*********************************************************/
*           /*                                                       */
*           /* CHANGE THE NUMBER OF DATA INSERTS TO 5 AND THE MSG FOR*/
*           /* FORMAT 4 RECORD ID INFOMATION LINE                    */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0565
*           DARGCNT=SRDARGC5;                                      0565
         STH   @02,DARGCNT(,@05)                                   0565
*           DARGSENT=SRFOR4RL;                                     0566
         MVI   DARGSENT(@05),X'6B'                                 0566
*           DARGINS(SRDARGX5)=SRDARGR5;                            0567
         STH   @02,DARGINS+32(,@05)                                0567
*           DARGINL(SRDARGX5)=SRCOUNTL;                            0568
         MVC   DARGINL+32(2,@05),@CH00039                          0568
*           DARGDTM(SRDARGX5)=ADDR(RWFRCNT);                       0569
         LA    @06,RWFRCNT(,@14)                                   0569
         ST    @06,DARGDTM+32(,@05)                                0569
*         END;                                                     0570
*       ELSE                                                       0571
*         ;                                                        0571
@RF00563 DS    0H                                                  0572
*     END;                                                         0572
*   ELSE                                                           0573
*     DO;                                                          0573
         B     @RC00547                                            0573
@RF00547 DS    0H                                                  0574
*       IF SRFINDEX=SRFMT2×SRFINDEX=SRFMT5 THEN                    0574
         C     SRFINDEX,@CF00155                                   0574
         BE    @RT00574                                            0574
         C     SRFINDEX,@CF00287                                   0574
         BNE   @RF00574                                            0574
@RT00574 DS    0H                                                  0575
*         DO;                                                      0575
*                                                                  0575
*           /*********************************************************/
*           /*                                                       */
*           /* PREPARE RECORD ID LINE FOR FORMAT 2 OR 5              */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0576
*           DARGCNT=SRDARGC3;                                      0576
         LA    @06,3                                               0576
         L     @05,DDSTRU                                          0576
         STH   @06,DARGCNT(,@05)                                   0576
*           DARGSENT=SRFOR23L;                                     0577
         MVI   DARGSENT(@05),X'6C'                                 0577
*           DARGINS(SRDARGX1)=SRDARGR1;                            0578
         MVC   DARGINS(2,@05),@CH00220                             0578
*           DARGINL(SRDARGX1)=SRVOLLEN;                            0579
         MVC   DARGINL(2,@05),@CH00158                             0579
*           DARGDTM(SRDARGX1)=SRVOLPTR;                            0580
         L     @15,@PC00001+8                                      0580
         L     @15,REPSPRIT(,@15)                                  0580
         L     @14,SRVOLPTR(,@15)                                  0580
         ST    @14,DARGDTM(,@05)                                   0580
*           DARGINS(SRDARGX2)=SRDARGR2;                            0581
         MVC   DARGINS+8(2,@05),@CH00155                           0581
*           DARGINL(SRDARGX2)=SRCCHHRL;                            0582
         LA    @14,5                                               0582
         STH   @14,DARGINL+8(,@05)                                 0582
*           DARGDTM(SRDARGX2)=SRRECPTR;                            0583
         L     @03,SRRECPTR(,@15)                                  0583
         ST    @03,DARGDTM+8(,@05)                                 0583
*           DARGINS(SRDARGX3)=SRDARGR3;                            0584
         STH   @06,DARGINS+16(,@05)                                0584
*           DARGINL(SRDARGX3)=SRERTL;                              0585
         LA    @06,48                                              0585
         STH   @06,DARGINL+16(,@05)                                0585
*           SRHDERCD=SRHDERHH;                                     0586
         L     @01,SRERCODE(,@15)                                  0586
         MVC   SRHDERCD(2),SRHDERHH(@01)                           0586
*           DARGDTM(SRDARGX3)=ADDR(SRMERTAB)+(SRERTL*(SRHDERCD-1));
         LA    @02,SRMERTAB                                        0587
         SLR   @01,@01                                             0587
         ICM   @01,3,SRHDERCD                                      0587
         BCTR  @01,0                                               0587
         MR    @00,@06                                             0587
         ALR   @02,@01                                             0587
         ST    @02,DARGDTM+16(,@05)                                0587
*           IF SRFINDEX=SRFMT5 THEN                                0588
         CR    SRFINDEX,@14                                        0588
         BNE   @RF00588                                            0588
*             DO;                                                  0589
*                                                                  0589
*               /*****************************************************/
*               /*                                                   */
*               /* CHANGE DATA INSERT NUMBER AND MESSAGE FOR FORMAT 5*/
*               /* RECORD ID INFOMATION LINE                         */
*               /*                                                   */
*               /*****************************************************/
*                                                                  0590
*               DARGCNT=SRDARGC4;                                  0590
         LA    @06,4                                               0590
         STH   @06,DARGCNT(,@05)                                   0590
*               DARGSENT=SRFOR56L;                                 0591
         MVI   DARGSENT(@05),X'6D'                                 0591
*               DARGINS(SRDARGX4)=SRDARGR4;                        0592
         STH   @06,DARGINS+24(,@05)                                0592
*               DARGINL(SRDARGX4)=SRCOUNTL;                        0593
         MVC   DARGINL+24(2,@05),@CH00039                          0593
*               DARGDTM(SRDARGX4)=SRRECPTR;                        0594
         ST    @03,DARGDTM+24(,@05)                                0594
*             END;                                                 0595
*           ELSE                                                   0596
*             ;                                                    0596
@RF00588 DS    0H                                                  0597
*         END;                                                     0597
*                                                                  0597
*       /*************************************************************/
*       /*                                                           */
*       /* FORMAT 3 OR FORMAT 6 HAS BEEN REQUESTED - PREPARE RECORD  */
*       /* ID LINE                                                   */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0598
*       ELSE                                                       0598
*         DO;                                                      0598
         B     @RC00574                                            0598
@RF00574 DS    0H                                                  0599
*           DARGCNT=SRDARGC3;                                      0599
         LA    @06,3                                               0599
         L     @05,DDSTRU                                          0599
         STH   @06,DARGCNT(,@05)                                   0599
*           DARGSENT=SRFOR23L;                                     0600
         MVI   DARGSENT(@05),X'6C'                                 0600
*           DARGINS(SRDARGX1)=SRDARGR1;                            0601
         MVC   DARGINS(2,@05),@CH00220                             0601
*           DARGINL(SRDARGX1)=SRVOLLEN;                            0602
         LA    @15,6                                               0602
         STH   @15,DARGINL(,@05)                                   0602
*           DARGDTM(SRDARGX1)=SRVOLPTR;                            0603
         L     @14,@PC00001+8                                      0603
         L     @14,REPSPRIT(,@14)                                  0603
         L     @03,SRVOLPTR(,@14)                                  0603
         ST    @03,DARGDTM(,@05)                                   0603
*           DARGINS(SRDARGX2)=SRDARGR2;                            0604
         MVC   DARGINS+8(2,@05),@CH00155                           0604
*           DARGINL(SRDARGX2)=SRCCHHRL;                            0605
         MVC   DARGINL+8(2,@05),@CH00287                           0605
*           DARGDTM(SRDARGX2)=SRCCHHRP;                            0606
         L     @03,SRCCHHRP(,@14)                                  0606
         ST    @03,DARGDTM+8(,@05)                                 0606
*           DARGINL(SRDARGX3)=SRERTL;                              0607
         LA    @03,48                                              0607
         STH   @03,DARGINL+16(,@05)                                0607
*           DARGINS(SRDARGX3)=SRDARGR3;                            0608
         STH   @06,DARGINS+16(,@05)                                0608
*           SRHDERCD=SRHDERHH;                                     0609
         L     @06,SRERCODE(,@14)                                  0609
         MVC   SRHDERCD(2),SRHDERHH(@06)                           0609
*           DARGDTM(SRDARGX3)=ADDR(SRMERTAB)+(SRERTL*(SRHDERCD-1));
         LA    @06,SRMERTAB                                        0610
         SLR   @01,@01                                             0610
         ICM   @01,3,SRHDERCD                                      0610
         BCTR  @01,0                                               0610
         MR    @00,@03                                             0610
         ALR   @06,@01                                             0610
         ST    @06,DARGDTM+16(,@05)                                0610
*           IF SRFINDEX=SRFMT6 THEN                                0611
         CR    SRFINDEX,@15                                        0611
         BNE   @RF00611                                            0611
*             DO;                                                  0612
*                                                                  0612
*               /*****************************************************/
*               /*                                                   */
*               /* CHANGE THE NUMBER OF DATA INSERTS TO 4 AND THE    */
*               /* MESSAGE FOR THE FORMAT 6 RECORD ID INFORMATION    */
*               /* LINE                                              */
*               /*                                                   */
*               /*****************************************************/
*                                                                  0613
*               DARGCNT=SRDARGC4;                                  0613
         LA    @06,4                                               0613
         STH   @06,DARGCNT(,@05)                                   0613
*               DARGSENT=SRFOR56L;                                 0614
         MVI   DARGSENT(@05),X'6D'                                 0614
*               DARGINS(SRDARGX4)=SRDARGR4;                        0615
         STH   @06,DARGINS+24(,@05)                                0615
*               DARGINL(SRDARGX4)=SRCOUNTL;                        0616
         MVC   DARGINL+24(2,@05),@CH00039                          0616
*               DARGDTM(SRDARGX4)=SRRECPTR;                        0617
         L     @06,SRRECPTR(,@14)                                  0617
         ST    @06,DARGDTM+24(,@05)                                0617
*             END;                                                 0618
*           ELSE                                                   0619
*             ;                                                    0619
@RF00611 DS    0H                                                  0620
*         END;                                                     0620
*     END;                                                         0621
@RC00574 DS    0H                                                  0622
*                                                                  0622
*   /*****************************************************************/
*   /*                                                               */
*   /* PRINT RECORD ID INFORMATION LINE TO ALTERNATE FILE IF REPARFIO*/
*   /* ^= 0 OR ELSE TO SYSPRINT                                      */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0622
*   CALL AMSTP011(GDTTBL,REPARFIO,DDSTRU);                         0622
*                                                                  0622
@RC00547 L     @06,@PC00001                                        0622
         ST    @06,@AL00001                                        0622
         L     @05,@PC00001+8                                      0622
         LA    @05,REPARFIO(,@05)                                  0622
         ST    @05,@AL00001+4                                      0622
         LA    @05,DDSTRU                                          0622
         ST    @05,@AL00001+8                                      0622
         MVI   @AL00001+8,X'80'                                    0622
         L     @15,GDTPRT(,@06)                                    0622
         LA    @01,@AL00001                                        0622
         BALR  @14,@15                                             0622
*   /*****************************************************************/
*   /*                                                               */
*   /* IF UPRINT HAS RETURNED A NON-ZERO RETURN CODE, CALL IDCRDER TO*/
*   /* SET LASTCC VALUE FOR AMS                                      */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0623
*   RESPECIFY                                                      0623
*     RTNREG RSTD;                                                 0623
*   TESTRC=RTNREG;                                                 0624
         LR    TESTRC,RTNREG                                       0624
*   RESPECIFY                                                      0625
*     RTNREG UNRSTD;                                               0625
*   IF TESTRC^=0 THEN                                              0626
         LTR   TESTRC,TESTRC                                       0626
         BZ    @RF00626                                            0626
*     DO;                                                          0627
*       DO;                                                        0628
*         CKREQ=CKREQ&&CKREQ;                                      0629
         L     @06,@PC00001+8                                      0629
         XC    CKREQ(44,@06),CKREQ(@06)                            0629
*         CKRERN=CC12;                                             0630
         MVC   CKRERN(2,@06),@CH02185                              0630
*         CALL IDCRDER;                                            0631
         BAL   @14,IDCRDER                                         0631
*       END;                                                       0632
*       RETURN CODE(LASTCC12);                                     0633
         LA    @15,12                                              0633
         L     @14,@SA00002                                        0633
         LM    @00,@12,@SA00002+8                                  0633
         BR    @14                                                 0633
*     END;                                                         0634
*   ELSE                                                           0635
*     ;                                                            0635
@RF00626 DS    0H                                                  0636
*   IF SRFINDEX>SRFMT3 THEN                                        0636
         C     SRFINDEX,@CF00164                                   0636
         BNH   @RF00636                                            0636
*     DO;                                                          0637
*                                                                  0637
*       /*************************************************************/
*       /*                                                           */
*       /* PRINT RECORD TITLE LINE IF FULLRECORD SPECIFIED I.E, IF   */
*       /* FORMAT 4,5, OR 6 WAS SPECIFIED                            */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0638
*       DARGL=DARGL&&DARGL;                                        0638
         XC    DARGL(100),DARGL                                    0638
*       DARGSMOD=SRMSGID;                                          0639
         L     @06,DDSTRU                                          0639
         MVC   DARGSMOD(3,@06),@CC02242                            0639
*       DARGSENT=SRFORRTL;                                         0640
         MVI   DARGSENT(@06),X'6E'                                 0640
*       CALL AMSTP011(GDTTBL,REPARFIO,DDSTRU);                     0641
*                                                                  0641
         L     @06,@PC00001                                        0641
         ST    @06,@AL00001                                        0641
         L     @05,@PC00001+8                                      0641
         LA    @05,REPARFIO(,@05)                                  0641
         ST    @05,@AL00001+4                                      0641
         LA    @05,DDSTRU                                          0641
         ST    @05,@AL00001+8                                      0641
         MVI   @AL00001+8,X'80'                                    0641
         L     @15,GDTPRT(,@06)                                    0641
         LA    @01,@AL00001                                        0641
         BALR  @14,@15                                             0641
*       /*************************************************************/
*       /*                                                           */
*       /* IF UPRINT HAS RETURNED A NON-ZERO RETURN CODE CALL IDCRDER*/
*       /* TO SET LASTCC VALUE FOR AMS                               */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0642
*       RESPECIFY                                                  0642
*         RTNREG RSTD;                                             0642
*       TESTRC=RTNREG;                                             0643
         LR    TESTRC,RTNREG                                       0643
*       RESPECIFY                                                  0644
*         RTNREG UNRSTD;                                           0644
*       IF TESTRC^=0 THEN                                          0645
         LTR   TESTRC,TESTRC                                       0645
         BZ    @RF00645                                            0645
*         DO;                                                      0646
*           DO;                                                    0647
*             CKREQ=CKREQ&&CKREQ;                                  0648
         L     @06,@PC00001+8                                      0648
         XC    CKREQ(44,@06),CKREQ(@06)                            0648
*             CKRERN=CC12;                                         0649
         MVC   CKRERN(2,@06),@CH02185                              0649
*             CALL IDCRDER;                                        0650
         BAL   @14,IDCRDER                                         0650
*           END;                                                   0651
*           RETURN CODE(LASTCC12);                                 0652
         LA    @15,12                                              0652
         L     @14,@SA00002                                        0652
         LM    @00,@12,@SA00002+8                                  0652
         BR    @14                                                 0652
*         END;                                                     0653
*       ELSE                                                       0654
*         ;                                                        0654
*                                                                  0654
@RF00645 DS    0H                                                  0655
*       /*************************************************************/
*       /*                                                           */
*       /* PRINT THE RECORD IF FULLRECORD SPECIFIED SET UP A POINTER */
*       /* TO THE RECORD TO PRINT AND GET THE LENGTH OF THE RECORD TO*/
*       /* PRINT                                                     */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0655
*       IF SRFINDEX=SRFMT4 THEN                                    0655
         C     SRFINDEX,@CF00044                                   0655
         BNE   @RF00655                                            0655
*         DO;                                                      0656
*           SRLENCTR=SRVRECL;                                      0657
         L     @06,@PC00001+8                                      0657
         L     @06,REPSPRIT(,@06)                                  0657
         L     SRLENCTR,SRVRECL(,@06)                              0657
*           SRPOINT=ADDR(RWFRKD);                                  0658
         L     SRPOINT,SRVREPTR(,@06)                              0658
         LA    SRPOINT,RWFRKD(,SRPOINT)                            0658
*         END;                                                     0659
*       ELSE                                                       0660
*         IF SRFINDEX=SRFMT5 THEN                                  0660
         B     @RC00655                                            0660
@RF00655 LA    @06,5                                               0660
         CR    SRFINDEX,@06                                        0660
         BNE   @RF00660                                            0660
*           DO;                                                    0661
*             SRLENCTR=SRKLEN+SRDATL;                              0662
         L     @15,@PC00001+8                                      0662
         L     @01,REPSPRIT(,@15)                                  0662
         L     @15,SRRECPTR(,@01)                                  0662
         ALR   @06,@15                                             0662
         SLR   SRLENCTR,SRLENCTR                                   0662
         IC    SRLENCTR,SRKLEN(,@06)                               0662
         AH    SRLENCTR,SRDATL+6(,@15)                             0662
*             SRPOINT=SRRECPTR+SRCOUNTL;                           0663
         AL    @15,@CF00039                                        0663
         LR    SRPOINT,@15                                         0663
*           END;                                                   0664
*         ELSE                                                     0665
*           DO;                                                    0665
         B     @RC00660                                            0665
@RF00660 DS    0H                                                  0666
*             SRLENCTR=SRSPRECL;                                   0666
         L     @06,@PC00001+8                                      0666
         L     @06,REPSPRIT(,@06)                                  0666
         L     SRLENCTR,SRSPRECL(,@06)                             0666
*             SRPOINT=SRRECPTR+SRCOUNTL;                           0667
         LA    SRPOINT,8                                           0667
         AL    SRPOINT,SRRECPTR(,@06)                              0667
*           END;                                                   0668
*       DARGL=DARGL&&DARGL;                                        0669
@RC00660 DS    0H                                                  0669
@RC00655 XC    DARGL(100),DARGL                                    0669
*       DARGSMOD=SRMSGID;                                          0670
         L     @06,DDSTRU                                          0670
         MVC   DARGSMOD(3,@06),@CC02242                            0670
*       DARGDBP=SRPOINT;                                           0671
         ST    SRPOINT,DARGDBP(,@06)                               0671
*       DARGILP=SRLENCTR;                                          0672
*                                                                  0672
         STH   SRLENCTR,DARGILP(,@06)                              0672
*       /*************************************************************/
*       /*                                                           */
*       /* DETERMINE TYPE OF PRINT CHARACTERS FOR THE RECORD         */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0673
*       IF ADDR(HEXA)^=NULLPTR THEN                                0673
         L     @15,@PC00001+4                                      0673
         L     @15,FDTPTR+56(,@15)                                 0673
         LTR   @15,@15                                             0673
         BZ    @RF00673                                            0673
*         DARGSENT=SRFORHEX;                                       0674
         MVI   DARGSENT(@06),X'6F'                                 0674
*       ELSE                                                       0675
*         IF ADDR(CHARA)^=NULLPTR THEN                             0675
         B     @RC00673                                            0675
@RF00673 L     @06,@PC00001+4                                      0675
         L     @06,FDTPTR+60(,@06)                                 0675
         LTR   @06,@06                                             0675
         BZ    @RF00675                                            0675
*           DARGSENT=SRFORCHA;                                     0676
         L     @06,DDSTRU                                          0676
         MVI   DARGSENT(@06),X'70'                                 0676
*         ELSE                                                     0677
*           DARGSENT=SRFORBTH;                                     0677
*                                                                  0677
         B     @RC00675                                            0677
@RF00675 L     @06,DDSTRU                                          0677
         MVI   DARGSENT(@06),X'71'                                 0677
*       /*************************************************************/
*       /*                                                           */
*       /* TEST FOR END OF FILE RECORD (REPRC = 29) AND MODIFY       */
*       /* DARGLIST TO PRINT END OF FILE IDENTIFIER                  */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0678
*       IF RCAREA=RETCD29 THEN      /*                       @ZA25908*/
@RC00675 DS    0H                                                  0678
@RC00673 L     @06,@PC00001+8                                      0678
         L     @06,REPSPRIT(,@06)                                  0678
         L     @06,SRERCODE(,@06)                                  0678
         CLC   RCAREA(2,@06),RETCD29                               0678
         BNE   @RF00678                                            0678
*         DO;                       /*                       @ZA25908*/
*           DARGSENT=SRFORCHA;      /*                       @ZA25908*/
         L     @06,DDSTRU                                          0680
         MVI   DARGSENT(@06),X'70'                                 0680
*           DARGILP=EOFMSGLN;       /*                       @ZA25908*/
         SLR   @15,@15                                             0681
         IC    @15,EOFMSGLN                                        0681
         STH   @15,DARGILP(,@06)                                   0681
*           DARGDBP=ADDR(EOFMSG);   /*                       @ZA25908*/
         LA    @15,EOFMSG                                          0682
         ST    @15,DARGDBP(,@06)                                   0682
*         END;                      /*                       @ZA25908*/
*                                                                  0683
*       /*************************************************************/
*       /*                                                           */
*       /* PRINT THE RECORD                                          */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0684
*       CALL AMSTP011(GDTTBL,REPARFIO,DDSTRU);                     0684
*                                                                  0684
@RF00678 L     @06,@PC00001                                        0684
         ST    @06,@AL00001                                        0684
         L     @02,@PC00001+8                                      0684
         LA    @02,REPARFIO(,@02)                                  0684
         ST    @02,@AL00001+4                                      0684
         LA    @02,DDSTRU                                          0684
         ST    @02,@AL00001+8                                      0684
         MVI   @AL00001+8,X'80'                                    0684
         L     @15,GDTPRT(,@06)                                    0684
         LA    @01,@AL00001                                        0684
         BALR  @14,@15                                             0684
*       /*************************************************************/
*       /*                                                           */
*       /* IF UPRINT HAS RETURNED A NO-ZERO RETURN CODE CALL IDCRDER */
*       /* TO SET LASTCC VALUE FOR AMS                               */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0685
*       RESPECIFY                                                  0685
*         RTNREG RSTD;                                             0685
*       TESTRC=RTNREG;                                             0686
         LR    TESTRC,RTNREG                                       0686
*       RESPECIFY                                                  0687
*         RTNREG UNRSTD;                                           0687
*       IF TESTRC^=0 THEN                                          0688
         LTR   TESTRC,TESTRC                                       0688
         BZ    @RF00688                                            0688
*         DO;                                                      0689
*           DO;                                                    0690
*             CKREQ=CKREQ&&CKREQ;                                  0691
         L     @06,@PC00001+8                                      0691
         XC    CKREQ(44,@06),CKREQ(@06)                            0691
*             CKRERN=CC12;                                         0692
         MVC   CKRERN(2,@06),@CH02185                              0692
*             CALL IDCRDER;                                        0693
         BAL   @14,IDCRDER                                         0693
*           END;                                                   0694
*           IF GDTDBG=NULLPTR THEN                                 0695
         L     @06,@PC00001                                        0695
         L     @06,GDTDBG(,@06)                                    0695
         LTR   @06,@06                                             0695
         BZ    @RT00695                                            0695
*             ;                                                    0696
*           ELSE                                                   0697
*             CALL IDCDB010(GDTTBL,'RD65');                        0697
         L     @06,@PC00001                                        0697
         ST    @06,@AL00001                                        0697
         LA    @15,@CC02355                                        0697
         ST    @15,@AL00001+4                                      0697
         MVI   @AL00001+4,X'80'                                    0697
         L     @15,GDTDBG(,@06)                                    0697
         LA    @01,@AL00001                                        0697
         BALR  @14,@15                                             0697
*           RETURN CODE(LASTCC12);                                 0698
@RT00695 LA    @15,12                                              0698
         L     @14,@SA00002                                        0698
         LM    @00,@12,@SA00002+8                                  0698
         BR    @14                                                 0698
*         END;                                                     0699
*     END;                                                         0700
@RF00688 DS    0H                                                  0701
*   RETURN CODE(LASTCC00);                                         0701
@RF00636 SLR   @15,@15                                             0701
         L     @14,@SA00002                                        0701
         LM    @00,@12,@SA00002+8                                  0701
         BR    @14                                                 0701
*   END IDCRDPT;                                                   0702
*IDCRDER:                                                          0703
*   PROCEDURE;                                                     0703
*                                                                  0703
IDCRDER  STM   @14,@12,@SA00003                                    0703
*/********************************************************************/
*/*                                                                  */
*/* PROCEDURE NAME - IDCRDER                                         */
*/*                                                                  */
*/* FUNCTION - THIS PROCEDURE WILL PRINT A MESSAGE IF ONE IS         */
*/*            ASSOCIATED WITH THE MESSAGE ENTRY NUMBER.             */
*/*            THE CURRENT AMS CONDITION CODE WILL BE REPLACED       */
*/*            IF THE CONDITION CODE ASSOCIATED WITH THE MESSAGE     */
*/*            ENTRY NUMBER IS GREATER.                              */
*/*                                                                  */
*/* ENTRY POINT - IDCRDER (ONLY ENTRY POINT FOR THIS PROCEDURE)      */
*/*                                                                  */
*/*           LINKAGE - '?CALLCKER (MSGNO,VAR1,...,VARN);'           */
*/*                                                                  */
*/*           INPUT -                                                */
*/*                                                                  */
*/*             MESSAGE ENTRY NUMBER AND MESSAGE VARIABLE(S)         */
*/*                                                                  */
*/*           OUTPUT -                                               */
*/*                                                                  */
*/*             REQUESTED MESSAGE IS WRITTEN TO SYSPRINT             */
*/*                                                                  */
*/*           EXIT, NORMAL -                                         */
*/*                                                                  */
*/*             LASTCC = HIGHEST CONDITION CODE VALUE                */
*/*                                                                  */
*/*           EXIT, ERROR -                                          */
*/*                                                                  */
*/*             NONE                                                 */
*/*                                                                  */
*/* INTERNAL INTERFACES -                                            */
*/*                                                                  */
*/*      MACROS/SVCS -                                               */
*/*                                                                  */
*/*            NONE                                                  */
*/*                                                                  */
*/*      PROCEDURES/SUBROUTINES CALLED -                             */
*/*                                                                  */
*/*            NONE                                                  */
*/*                                                                  */
*/*      DATA AREAS -                                                */
*/*                                                                  */
*/*            ERRORTAB - REPAIRV ACTION ARGUMENT TABLE AREA         */
*/*              CONTAINS THE ACTION ARGUMENTS FOR EACH INVOCATION   */
*/*              OF IDCRDER                                          */
*/*                                                                  */
*/*            MVARTBL - REPAIRV DYNAMIC INSERT MESSAGE TABLE AREA   */
*/*              CONTAINS LENGTH OF EACH DYNAMIC INSERT FOR EACH     */
*/*              MESSAGE                                             */
*/*                                                                  */
*/* EXTERNAL INTERFACES -                                            */
*/*                                                                  */
*/*      MACROS/SVCS -                                               */
*/*                                                                  */
*/*            UPRINT - IDCAMS TEXT PROCESSOR PRINT ROUTINE          */
*/*              DISPLAYS SPECIFIC MESSAGE ON SYSPRINT               */
*/*              GENERATES A CALL TO MODULE IDCTP011                 */
*/*                                                                  */
*/*            UERROR - IDCAMS TEXT PROCESSOR CATALOG ERROR ROUTINE  */
*/*              DISPLAYS THE CATALOG ERROR MESSAGE ON SYSPRINT      */
*/*              GENERATES A CALL TO MODULE IDCTPER                  */
*/*                                                                  */
*/*            UDUMP - IDCAMS DUMP POINT ROUTINE                     */
*/*              PRINTS A DUMP AT THE SPECIFIED DUMP POINT           */
*/*              GENERATES A CALL TO MODULE IDCDB01                  */
*/*                                                                  */
*/*            UTRACE - IDCAMS TRACE POINT ROUTINE                   */
*/*              SETS TRACE POINT                                    */
*/*                                                                  */
*/*      PROCEDURES/SUBROUTINES CALLED -                             */
*/*                                                                  */
*/*           NONE                                                   */
*/*                                                                  */
*/*      DATA AREAS -                                                */
*/*                                                                  */
*/*           DARGLIST - IDCAMS TEXT PROCESSOR ARGUMENT LIST         */
*/*             COMMUNICATES THE PRINT ARGUMENTS FOR PRINTING THE    */
*/*             OUTPUT MESSAGE                                       */
*/*                                                                  */
*/********************************************************************/
*                                                                  0704
*                                                                  0704
*   /*****************************************************************/
*   /*                                                               */
*   /* IDCRDER DECLARES                                              */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0704
*   DCL                                                            0704
*     MESSAG7 FIXED(8) CONSTANT(7); /* MESSGAE 7-IDC31207I           */
*   DCL                                                            0705
*     MESSAG33 FIXED(8) CONSTANT(33);/* MESSAGE 33 IDC31233I         */
*   DCL                                                            0706
*     CKIDX FIXED(8);               /* INDEX                         */
*                                                                  0706
*   /*****************************************************************/
*   /*                                                               */
*   /* STRUCTURE FOR VARIABLE LENGTH INSERTS FOR MESSAGES 7 AND 33   */
*   /* *********************************************************     */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0707
*   DCL                                                            0707
*     VARLENCK FIXED(8) BASED;                                     0707
*                                                                  0707
*   /*****************************************************************/
*   /*                                                               */
*   /* MESSAGE TABLE MAPPING                                         */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0708
*   DCL                                                            0708
*     1 ERRTAB DEFINED(ERRORTAB),   /* STRUCTURE FOR TABLE           */
*      2 ERRENT(*),                                                0708
*       3 ERRFLAG BIT(8),           /* FLAGS                         */
*        4 ERRCATLG BIT(1),         /* UCATLG ERROR                  */
*       3 ERRCNDCD BIN(8),          /* CONDITION CODE                */
*       3 ERRSTMOD CHAR(3),         /* STATIC TEXT MOD ID            */
*       3 ERRSTENT BIN(8),          /* STATIC TEXT ENTRY             */
*       3 * FIXED(15),              /* RESERVED                      */
*       3 ERRMVPTR PTR(31);         /* INSERT LENGTH ENTRY PTR       */
*   DCL                                                            0709
*     1 MSGVAR BASED(ERRMVPTR(CKRERN)),/* STRUCTURE FOR LENGTHS      */
*      2 MSGVARNO FIXED(15),        /* NUMBER OF LENGTHS             */
*      2 MSGLEN(*) FIXED(15);       /* INSERT LENGTHS                */
*                                                                  0709
*   /*****************************************************************/
*   /*                                                               */
*   /* MESSAGE TABLE                                                 */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0710
*   DCL                                                            0710
*     1 ERRORTAB BDY(WORD) STATIC LOCAL,                           0710
*      2 MSG001,                    /* IDC31201I                     */
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(12),                                       0710
*       3 * CHAR(3) INIT('RD0'),                                   0710
*       3 * BIN(8) INIT(1),                                        0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(ADDR(MENT001)),                           0710
*      2 MSG002,                    /* IDC31202I                     */
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(12),                                       0710
*       3 * CHAR(3) INIT('RD0'),                                   0710
*       3 * BIN(8) INIT(2),                                        0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(ADDR(MENT002)),                           0710
*      2 MSG003,                    /* IDC31203I                     */
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(12),                                       0710
*       3 * CHAR(3) INIT('RD0'),                                   0710
*       3 * BIN(8) INIT(3),                                        0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(ADDR(MENT003)),                           0710
*      2 MSG004,                    /* IDC31204I                     */
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(12),                                       0710
*       3 * CHAR(3) INIT('RD0'),                                   0710
*       3 * BIN(8) INIT(4),                                        0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(ADDR(MENT004)),                           0710
*      2 MSG005,                    /* IDC31205I                     */
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(12),                                       0710
*       3 * CHAR(3) INIT('RD0'),                                   0710
*       3 * BIN(8) INIT(5),                                        0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(ADDR(MENT005)),                           0710
*      2 MSG006,                    /* IDC31206I                     */
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(12),                                       0710
*       3 * CHAR(3) INIT('RD0'),                                   0710
*       3 * BIN(8) INIT(6),                                        0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(ADDR(MENT006)),                           0710
*      2 MSG007,                    /* IDC31207I                     */
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(12),                                       0710
*       3 * CHAR(3) INIT('RD0'),                                   0710
*       3 * BIN(8) INIT(7),                                        0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(ADDR(MENT007)),                           0710
*      2 MSG008,                    /* IDC31208I                     */
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(12),                                       0710
*       3 * CHAR(3) INIT('RD0'),                                   0710
*       3 * BIN(8) INIT(8),                                        0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(ADDR(MENT008)),                           0710
*      2 MSG009,                    /* IDC31209I                     */
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(12),                                       0710
*       3 * CHAR(3) INIT('RD0'),                                   0710
*       3 * BIN(8) INIT(9),                                        0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(ADDR(MENT009)),                           0710
*      2 MSG010,                    /* IDC31210I                     */
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(12),                                       0710
*       3 * CHAR(3) INIT('RD0'),                                   0710
*       3 * BIN(8) INIT(10),                                       0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(ADDR(MENT010)),                           0710
*      2 MSG011,                    /* IDC31211I                     */
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(12),                                       0710
*       3 * CHAR(3) INIT('RD0'),                                   0710
*       3 * BIN(8) INIT(11),                                       0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(ADDR(MENT011)),                           0710
*      2 MSG012,                    /* IDC31212I                     */
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(12),                                       0710
*       3 * CHAR(3) INIT('RD0'),                                   0710
*       3 * BIN(8) INIT(12),                                       0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(ADDR(MENT012)),                           0710
*      2 MSG013,                    /* IDC31213I                     */
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(12),                                       0710
*       3 * CHAR(3) INIT('RD0'),                                   0710
*       3 * BIN(8) INIT(13),                                       0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(ADDR(MENT013)),                           0710
*      2 MSG014,                    /* IDC31214I                     */
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(12),                                       0710
*       3 * CHAR(3) INIT('RD0'),                                   0710
*       3 * BIN(8) INIT(14),                                       0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(ADDR(MENT014)),                           0710
*      2 MSG015,                    /* IDC01215I                     */
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(0),                                        0710
*       3 * CHAR(3) INIT('RD0'),                                   0710
*       3 * BIN(8) INIT(15),                                       0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(ADDR(MENT015)),                           0710
*      2 MSG016,                    /* IDC11216I                     */
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(4),                                        0710
*       3 * CHAR(3) INIT('RD0'),                                   0710
*       3 * BIN(8) INIT(16),                                       0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(ADDR(MENT016)),                           0710
*      2 MSG017,                    /* IDC11217I                     */
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(4),                                        0710
*       3 * CHAR(3) INIT('RD0'),                                   0710
*       3 * BIN(8) INIT(17),                                       0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(ADDR(MENT017)),                           0710
*      2 MSG018,                    /* IDC11218I                     */
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(4),                                        0710
*       3 * CHAR(3) INIT('RD0'),                                   0710
*       3 * BIN(8) INIT(18),                                       0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(ADDR(MENT018)),                           0710
*      2 MSG019,                    /* IDC11219I                     */
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(4),                                        0710
*       3 * CHAR(3) INIT('RD0'),                                   0710
*       3 * BIN(8) INIT(19),                                       0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(ADDR(MENT019)),                           0710
*      2 MSG020,                    /* IDC31220I                     */
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(12),                                       0710
*       3 * CHAR(3) INIT('RD0'),                                   0710
*       3 * BIN(8) INIT(20),                                       0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(ADDR(MENT020)),                           0710
*      2 MSG021,                    /* IDC31221I                     */
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(12),                                       0710
*       3 * CHAR(3) INIT('RD0'),                                   0710
*       3 * BIN(8) INIT(21),                                       0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(ADDR(MENT021)),                           0710
*      2 MSG022,                    /* IDC31222I                     */
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(12),                                       0710
*       3 * CHAR(3) INIT('RD0'),                                   0710
*       3 * BIN(8) INIT(22),                                       0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(ADDR(MENT022)),                           0710
*      2 MSG023,                    /* IDC31223I                     */
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(12),                                       0710
*       3 * CHAR(3) INIT('RD0'),                                   0710
*       3 * BIN(8) INIT(23),                                       0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(ADDR(MENT023)),                           0710
*      2 MSG024,                    /* IDC31224I                     */
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(12),                                       0710
*       3 * CHAR(3) INIT('RD0'),                                   0710
*       3 * BIN(8) INIT(24),                                       0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(ADDR(MENT024)),                           0710
*      2 MSG025,                    /* IDC31251I                     */
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(12),                                       0710
*       3 * CHAR(3) INIT('RD0'),                                   0710
*       3 * BIN(8) INIT(25),                                       0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(ADDR(MENT025)),                           0710
*      2 MSG026,                    /* IDC31261I                     */
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(12),                                       0710
*       3 * CHAR(3) INIT('RD0'),                                   0710
*       3 * BIN(8) INIT(26),                                       0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(ADDR(MENT026)),                           0710
*      2 MSG027,                    /* IDC31227I                     */
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(12),                                       0710
*       3 * CHAR(3) INIT('RD0'),                                   0710
*       3 * BIN(8) INIT(27),                                       0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(ADDR(MENT027)),                           0710
*      2 MSG028,                    /* IDC31228I                     */
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(12),                                       0710
*       3 * CHAR(3) INIT('RD0'),                                   0710
*       3 * BIN(8) INIT(28),                                       0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(ADDR(MENT028)),                           0710
*      2 MSG029,                    /* IDC31229I                     */
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(12),                                       0710
*       3 * CHAR(3) INIT('RD0'),                                   0710
*       3 * BIN(8) INIT(29),                                       0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(ADDR(MENT029)),                           0710
*      2 MSG030,                    /* IDC31230I                     */
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(12),                                       0710
*       3 * CHAR(3) INIT('RD0'),                                   0710
*       3 * BIN(8) INIT(30),                                       0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(ADDR(MENT030)),                           0710
*      2 MSG031,                    /* IDC31231I                     */
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(12),                                       0710
*       3 * CHAR(3) INIT('RD0'),                                   0710
*       3 * BIN(8) INIT(31),                                       0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(ADDR(MENT031)),                           0710
*      2 MSG032,                    /* IDC31232I                     */
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(12),                                       0710
*       3 * CHAR(3) INIT('RD0'),                                   0710
*       3 * BIN(8) INIT(32),                                       0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(ADDR(MENT032)),                           0710
*      2 MSG033,                    /* IDC31233I                     */
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(12),                                       0710
*       3 * CHAR(3) INIT('RD0'),                                   0710
*       3 * BIN(8) INIT(33),                                       0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(ADDR(MENT033)),                           0710
*      2 MSG034,                    /* IDC31234I                     */
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(12),                                       0710
*       3 * CHAR(3) INIT('RD0'),                                   0710
*       3 * BIN(8) INIT(34),                                       0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(ADDR(MENT034)),                           0710
*      2 MSG035,                    /* IDC31235I                     */
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(12),                                       0710
*       3 * CHAR(3) INIT('RD0'),                                   0710
*       3 * BIN(8) INIT(35),                                       0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(ADDR(MENT035)),                           0710
*      2 MSG036,                    /* IDC31236I                     */
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(12),                                       0710
*       3 * CHAR(3) INIT('RD0'),                                   0710
*       3 * BIN(8) INIT(36),                                       0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(ADDR(MENT036)),                           0710
*      2 MSG037,                    /* IDC11237I                     */
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(04),                                       0710
*       3 * CHAR(3) INIT('RD0'),                                   0710
*       3 * BIN(8) INIT(37),                                       0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(ADDR(MENT037)),                           0710
*      2 MSG038,                    /* IDC31238I                     */
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(12),                                       0710
*       3 * CHAR(3) INIT('RD0'),                                   0710
*       3 * BIN(8) INIT(38),                                       0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(ADDR(MENT038)),                           0710
*      2 MSG039,                    /* IDC31239I                     */
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(12),                                       0710
*       3 * CHAR(3) INIT('RD0'),                                   0710
*       3 * BIN(8) INIT(39),                                       0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(ADDR(MENT039)),                           0710
*      2 MSG040,                    /* IDC31240I                     */
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(12),                                       0710
*       3 * CHAR(3) INIT('RD0'),                                   0710
*       3 * BIN(8) INIT(40),                                       0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(ADDR(MENT040)),                           0710
*      2 MSG041,                    /* IDC31241I                     */
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(12),                                       0710
*       3 * CHAR(3) INIT('RD0'),                                   0710
*       3 * BIN(8) INIT(41),                                       0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(ADDR(MENT041)),                           0710
*      2 MSG042,                    /* IDC31242I                     */
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(12),                                       0710
*       3 * CHAR(3) INIT('RD0'),                                   0710
*       3 * BIN(8) INIT(42),                                       0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(ADDR(MENT042)),                           0710
*      2 MSG043,                    /* IDC31243I                     */
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(12),                                       0710
*       3 * CHAR(3) INIT('RD0'),                                   0710
*       3 * BIN(8) INIT(43),                                       0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(ADDR(MENT043)),                           0710
*      2 MSG044,                    /* IDC11244I                     */
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(04),                                       0710
*       3 * CHAR(3) INIT('RD0'),                                   0710
*       3 * BIN(8) INIT(44),                                       0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(ADDR(MENT044)),                           0710
*      2 MSG045,                    /* IDC31245I                     */
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(12),                                       0710
*       3 * CHAR(3) INIT('RD0'),                                   0710
*       3 * BIN(8) INIT(45),                                       0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(ADDR(MENT045)),                           0710
*      2 MSG046,                    /* IDC31246I                     */
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(12),                                       0710
*       3 * CHAR(3) INIT('RD0'),                                   0710
*       3 * BIN(8) INIT(46),                                       0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(ADDR(MENT046)),                           0710
*      2 MSG047,                    /* IDC31247I             @ZA27389*/
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(12),                                       0710
*       3 * CHAR(3) INIT('RD0'),                                   0710
*       3 * BIN(8) INIT(47),                                       0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(ADDR(MENT047)),                           0710
*      2 MSG048,                    /* NULL ENTRY                    */
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(0),                                        0710
*       3 * CHAR(3) INIT('   '),                                   0710
*       3 * BIN(8) INIT(48),                                       0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(0),                                       0710
*      2 MSG049,                    /* NULL ENTRY                    */
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(0),                                        0710
*       3 * CHAR(3) INIT('   '),                                   0710
*       3 * BIN(8) INIT(1),                                        0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(0),                                       0710
*      2 MSG050,                    /* NULL ENTRY                    */
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(0),                                        0710
*       3 * CHAR(3) INIT('   '),                                   0710
*       3 * BIN(8) INIT(50),                                       0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(0),                                       0710
*      2 MSG051,                    /* NULL ENTRY                    */
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(0),                                        0710
*       3 * CHAR(3) INIT('   '),                                   0710
*       3 * BIN(8) INIT(51),                                       0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(0),                                       0710
*      2 MSG052,                    /* NULL ENTRY                    */
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(0),                                        0710
*       3 * CHAR(3) INIT('   '),                                   0710
*       3 * BIN(8) INIT(52),                                       0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(0),                                       0710
*      2 MSG053,                    /* NULL ENTRY                    */
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(0),                                        0710
*       3 * CHAR(3) INIT('   '),                                   0710
*       3 * BIN(8) INIT(53),                                       0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(0),                                       0710
*      2 MSG054,                    /* NULL ENTRY                    */
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(0),                                        0710
*       3 * CHAR(3) INIT('   '),                                   0710
*       3 * BIN(8) INIT(54),                                       0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(0),                                       0710
*      2 MSG055,                    /* NULL ENTRY                    */
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(0),                                        0710
*       3 * CHAR(3) INIT('   '),                                   0710
*       3 * BIN(8) INIT(55),                                       0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(0),                                       0710
*      2 MSG056,                    /* NULL ENTRY                    */
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(0),                                        0710
*       3 * CHAR(3) INIT('   '),                                   0710
*       3 * BIN(8) INIT(56),                                       0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(0),                                       0710
*      2 MSG057,                    /* NULL ENTRY                    */
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(0),                                        0710
*       3 * CHAR(3) INIT('   '),                                   0710
*       3 * BIN(8) INIT(57),                                       0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(0),                                       0710
*      2 MSG058,                    /* NULL ENTRY                    */
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(0),                                        0710
*       3 * CHAR(3) INIT('   '),                                   0710
*       3 * BIN(8) INIT(58),                                       0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(0),                                       0710
*      2 MSG059,                    /* NULL ENTRY                    */
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(0),                                        0710
*       3 * CHAR(3) INIT('   '),                                   0710
*       3 * BIN(8) INIT(59),                                       0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(0),                                       0710
*      2 MSG060,                    /* NULL ENTRY                    */
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(0),                                        0710
*       3 * CHAR(3) INIT('   '),                                   0710
*       3 * BIN(8) INIT(60),                                       0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(0),                                       0710
*      2 MSG061,                    /* NULL ENTRY                    */
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(0),                                        0710
*       3 * CHAR(3) INIT('   '),                                   0710
*       3 * BIN(8) INIT(61),                                       0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(0),                                       0710
*      2 MSG062,                    /* NULL ENTRY                    */
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(0),                                        0710
*       3 * CHAR(3) INIT('   '),                                   0710
*       3 * BIN(8) INIT(62),                                       0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(0),                                       0710
*      2 MSG063,                    /* NULL ENTRY                    */
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(0),                                        0710
*       3 * CHAR(3) INIT('   '),                                   0710
*       3 * BIN(8) INIT(63),                                       0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(0),                                       0710
*      2 MSG064,                    /* NULL ENTRY                    */
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(0),                                        0710
*       3 * CHAR(3) INIT('   '),                                   0710
*       3 * BIN(8) INIT(64),                                       0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(0),                                       0710
*      2 MSG065,                    /* NULL ENTRY                    */
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(0),                                        0710
*       3 * CHAR(3) INIT('   '),                                   0710
*       3 * BIN(8) INIT(65),                                       0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(0),                                       0710
*      2 MSG066,                    /* NULL ENTRY                    */
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(0),                                        0710
*       3 * CHAR(3) INIT('   '),                                   0710
*       3 * BIN(8) INIT(66),                                       0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(0),                                       0710
*      2 MSG067,                    /* NULL ENTRY                    */
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(0),                                        0710
*       3 * CHAR(3) INIT('   '),                                   0710
*       3 * BIN(8) INIT(1),                                        0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(0),                                       0710
*      2 MSG068,                    /* NULL ENTRY                    */
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(0),                                        0710
*       3 * CHAR(3) INIT('   '),                                   0710
*       3 * BIN(8) INIT(68),                                       0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(0),                                       0710
*      2 MSG069,                    /* NULL ENTRY                    */
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(0),                                        0710
*       3 * CHAR(3) INIT('   '),                                   0710
*       3 * BIN(8) INIT(69),                                       0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(0),                                       0710
*      2 MSG070,                    /* NULL ENTRY                    */
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(0),                                        0710
*       3 * CHAR(3) INIT('   '),                                   0710
*       3 * BIN(8) INIT(70),                                       0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(0),                                       0710
*      2 MSG071,                    /* NULL ENTRY                    */
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(0),                                        0710
*       3 * CHAR(3) INIT('   '),                                   0710
*       3 * BIN(8) INIT(71),                                       0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(0),                                       0710
*      2 MSG072,                    /* NULL ENTRY                    */
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(0),                                        0710
*       3 * CHAR(3) INIT('   '),                                   0710
*       3 * BIN(8) INIT(72),                                       0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(0),                                       0710
*      2 MSG073,                    /* NULL ENTRY                    */
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(0),                                        0710
*       3 * CHAR(3) INIT('   '),                                   0710
*       3 * BIN(8) INIT(73),                                       0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(0),                                       0710
*      2 MSG074,                    /* NULL ENTRY                    */
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(0),                                        0710
*       3 * CHAR(3) INIT('   '),                                   0710
*       3 * BIN(8) INIT(74),                                       0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(0),                                       0710
*      2 MSG075,                    /* NULL ENTRY                    */
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(0),                                        0710
*       3 * CHAR(3) INIT('   '),                                   0710
*       3 * BIN(8) INIT(75),                                       0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(0),                                       0710
*      2 MSG076,                    /* NULL ENTRY                    */
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(0),                                        0710
*       3 * CHAR(3) INIT('   '),                                   0710
*       3 * BIN(8) INIT(76),                                       0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(0),                                       0710
*      2 MSG077,                    /* IDC498D - STAGING             */
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(0),                                        0710
*       3 * CHAR(3) INIT('RD0'),    /*                       @ZA25908*/
*       3 * BIN(8) INIT(77),                                       0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(ADDR(MENT077)),/*                   @ZA25908*/
*      2 MSG078,                    /* IDC498D - VTOC HEADER         */
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(0),                                        0710
*       3 * CHAR(3) INIT('RD0'),    /*                       @ZA25908*/
*       3 * BIN(8) INIT(78),                                       0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(ADDR(MENT078)),/*                   @ZA25908*/
*      2 MSG079,                    /* IDC498D                       */
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(0),                                        0710
*       3 * CHAR(3) INIT('RD0'),                                   0710
*       3 * BIN(8) INIT(79),                                       0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(ADDR(MENT079)),                           0710
*      2 MSG080,                    /* SET LASTCC TO 0               */
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(0),                                        0710
*       3 * CHAR(3) INIT('   '),                                   0710
*       3 * BIN(8) INIT(0),                                        0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(0),                                       0710
*      2 MSG081,                    /* SET LASTCC TO 4               */
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(4),                                        0710
*       3 * CHAR(3) INIT('   '),                                   0710
*       3 * BIN(8) INIT(0),                                        0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(0),                                       0710
*      2 MSG082,                    /* SET LASTCC TO 8               */
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(8),                                        0710
*       3 * CHAR(3) INIT('   '),                                   0710
*       3 * BIN(8) INIT(0),                                        0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(0),                                       0710
*      2 MSG083,                    /* SET LASTCC TO 12              */
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(12),                                       0710
*       3 * CHAR(3) INIT('   '),                                   0710
*       3 * BIN(8) INIT(0),                                        0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(0),                                       0710
*      2 MSG084,                    /* NULL ENTRY                    */
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(0),                                        0710
*       3 * CHAR(3) INIT('   '),                                   0710
*       3 * BIN(8) INIT(84),                                       0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(0),                                       0710
*      2 MSG085,                    /* NULL ENTRY                    */
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(0),                                        0710
*       3 * CHAR(3) INIT('   '),                                   0710
*       3 * BIN(8) INIT(85),                                       0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(0),                                       0710
*      2 MSG086,                    /* NULL ENTRY                    */
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(0),                                        0710
*       3 * CHAR(3) INIT('   '),                                   0710
*       3 * BIN(8) INIT(86),                                       0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(0),                                       0710
*      2 MSG087,                    /* NULL ENTRY                    */
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(0),                                        0710
*       3 * CHAR(3) INIT('   '),                                   0710
*       3 * BIN(8) INIT(1),                                        0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(0),                                       0710
*      2 MSG088,                    /* NULL ENTRY                    */
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(0),                                        0710
*       3 * CHAR(3) INIT('   '),                                   0710
*       3 * BIN(8) INIT(88),                                       0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(0),                                       0710
*      2 MSG089,                    /* NULL ENTRY                    */
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(0),                                        0710
*       3 * CHAR(3) INIT('   '),                                   0710
*       3 * BIN(8) INIT(89),                                       0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(0),                                       0710
*      2 MSG090,                    /* IDC0001I                      */
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(0),                                        0710
*       3 * CHAR(3) INIT('UV0'),                                   0710
*       3 * BIN(8) INIT(1),                                        0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(ADDR(MENT090)),                           0710
*      2 MSG091,                    /* IDC3003I                      */
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(12),                                       0710
*       3 * CHAR(3) INIT('UV0'),                                   0710
*       3 * BIN(8) INIT(3),                                        0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(ADDR(MENT091)),                           0710
*      2 MSG092,                    /* IDC0005I                      */
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(0),                                        0710
*       3 * CHAR(3) INIT('UV0'),                                   0710
*       3 * BIN(8) INIT(5),                                        0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(ADDR(MENT092)),                           0710
*      2 MSG093,                    /* IDC3004I                      */
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(12),                                       0710
*       3 * CHAR(3) INIT('UV0'),                                   0710
*       3 * BIN(8) INIT(4),                                        0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(ADDR(MENT093)),                           0710
*      2 MSG094,                    /* NULL ENTRY                    */
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(0),                                        0710
*       3 * CHAR(3) INIT('   '),                                   0710
*       3 * BIN(8) INIT(94),                                       0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(0),                                       0710
*      2 MSG095,                    /* NULL ENTRY                    */
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(0),                                        0710
*       3 * CHAR(3) INIT('   '),                                   0710
*       3 * BIN(8) INIT(95),                                       0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(0),                                       0710
*      2 MSG096,                    /* NULL ENTRY                    */
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(0),                                        0710
*       3 * CHAR(3) INIT('   '),                                   0710
*       3 * BIN(8) INIT(96),                                       0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(0),                                       0710
*      2 MSG097,                    /* NULL ENTRY                    */
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(0),                                        0710
*       3 * CHAR(3) INIT('   '),                                   0710
*       3 * BIN(8) INIT(97),                                       0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(0),                                       0710
*      2 MSG098,                    /* NULL ENTRY                    */
*       3 * BIT(8) INIT('00'X),                                    0710
*       3 * BIN(8) INIT(0),                                        0710
*       3 * CHAR(3) INIT('   '),                                   0710
*       3 * BIN(8) INIT(98),                                       0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(0),                                       0710
*      2 MSG099,                    /* IDC3004I                      */
*       3 * BIT(8) INIT('80'X),     /* FLAG BIT SET ON               */
*       3 * BIN(8) INIT(0),                                        0710
*       3 * CHAR(3) INIT('   '),                                   0710
*       3 * BIN(8) INIT(99),                                       0710
*       3 * FIXED(15) INIT(0),                                     0710
*       3 * PTR(31) INIT(0);                                       0710
*                                                                  0710
*   /*****************************************************************/
*   /*                                                               */
*   /* INSERT LENGTHS TABLE                                          */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0711
*   DCL                                                            0711
*     1 MVARTBL BDY(WORD) STATIC LOCAL,                            0711
*      2 MENT001,                   /* IDC31201I                     */
*       3 * FIXED(15) INIT(3),                                     0711
*       3 * FIXED(15) INIT(5),                                     0711
*       3 * FIXED(15) INIT(5),                                     0711
*       3 * FIXED(15) INIT(44),                                    0711
*      2 MENT002,                   /* IDC31202I                     */
*       3 * FIXED(15) INIT(3),                                     0711
*       3 * FIXED(15) INIT(6),                                     0711
*       3 * FIXED(15) INIT(5),                                     0711
*       3 * FIXED(15) INIT(44),                                    0711
*      2 MENT003,                   /* IDC31203I                     */
*       3 * FIXED(15) INIT(0),                                     0711
*      2 MENT004,                   /* IDC31204I                     */
*       3 * FIXED(15) INIT(1),                                     0711
*       3 * FIXED(15) INIT(6),                                     0711
*      2 MENT005,                   /* IDC31205I                     */
*       3 * FIXED(15) INIT(1),                                     0711
*       3 * FIXED(15) INIT(5),                                     0711
*      2 MENT006,                   /* IDC31206I                     */
*       3 * FIXED(15) INIT(1),                                     0711
*       3 * FIXED(15) INIT(6),                                     0711
*      2 MENT007,                   /* IDC31207I                     */
*       3 * FIXED(15) INIT(1),                                     0711
*       3 * FIXED(15) INIT(5),                                     0711
*      2 MENT008,                   /* IDC31208I                     */
*       3 * FIXED(15) INIT(3),                                     0711
*       3 * FIXED(15) INIT(5),                                     0711
*       3 * FIXED(15) INIT(5),                                     0711
*       3 * FIXED(15) INIT(6),                                     0711
*      2 MENT009,                   /* IDC31209I                     */
*       3 * FIXED(15) INIT(0),                                     0711
*      2 MENT010,                   /* IDC31210I                     */
*       3 * FIXED(15) INIT(3),                                     0711
*       3 * FIXED(15) INIT(6),                                     0711
*       3 * FIXED(15) INIT(17),                                    0711
*       3 * FIXED(15) INIT(8),                                     0711
*      2 MENT011,                   /* IDC31211I                     */
*       3 * FIXED(15) INIT(1),                                     0711
*       3 * FIXED(15) INIT(44),                                    0711
*      2 MENT012,                   /* IDC31212I                     */
*       3 * FIXED(15) INIT(3),                                     0711
*       3 * FIXED(15) INIT(5),                                     0711
*       3 * FIXED(15) INIT(5),                                     0711
*       3 * FIXED(15) INIT(44),                                    0711
*      2 MENT013,                   /* IDC31213I                     */
*       3 * FIXED(15) INIT(4),                                     0711
*       3 * FIXED(15) INIT(2),                                     0711
*       3 * FIXED(15) INIT(2),                                     0711
*       3 * FIXED(15) INIT(13),                                    0711
*       3 * FIXED(15) INIT(44),                                    0711
*      2 MENT014,                   /* IDC31214I                     */
*       3 * FIXED(15) INIT(3),                                     0711
*       3 * FIXED(15) INIT(6),                                     0711
*       3 * FIXED(15) INIT(5),                                     0711
*       3 * FIXED(15) INIT(44),                                    0711
*      2 MENT015,                   /* IDC01215I                     */
*       3 * FIXED(15) INIT(1),                                     0711
*       3 * FIXED(15) INIT(44),                                    0711
*      2 MENT016,                   /* IDC11216I                     */
*       3 * FIXED(15) INIT(3),                                     0711
*       3 * FIXED(15) INIT(6),                                     0711
*       3 * FIXED(15) INIT(5),                                     0711
*       3 * FIXED(15) INIT(44),                                    0711
*      2 MENT017,                   /* IDC11217I                     */
*       3 * FIXED(15) INIT(3),                                     0711
*       3 * FIXED(15) INIT(6),                                     0711
*       3 * FIXED(15) INIT(5),                                     0711
*       3 * FIXED(15) INIT(44),                                    0711
*      2 MENT018,                   /* IDC11218I                     */
*       3 * FIXED(15) INIT(3),                                     0711
*       3 * FIXED(15) INIT(6),                                     0711
*       3 * FIXED(15) INIT(5),                                     0711
*       3 * FIXED(15) INIT(44),                                    0711
*      2 MENT019,                   /* IDC11219I                     */
*       3 * FIXED(15) INIT(3),                                     0711
*       3 * FIXED(15) INIT(6),                                     0711
*       3 * FIXED(15) INIT(4),                                     0711
*       3 * FIXED(15) INIT(44),                                    0711
*      2 MENT020,                   /* IDC31220I                     */
*       3 * FIXED(15) INIT(1),                                     0711
*       3 * FIXED(15) INIT(44),                                    0711
*      2 MENT021,                   /* IDC31221I                     */
*       3 * FIXED(15) INIT(3),                                     0711
*       3 * FIXED(15) INIT(6),                                     0711
*       3 * FIXED(15) INIT(5),                                     0711
*       3 * FIXED(15) INIT(44),                                    0711
*      2 MENT022,                   /* IDC31222I                     */
*       3 * FIXED(15) INIT(3),                                     0711
*       3 * FIXED(15) INIT(6),                                     0711
*       3 * FIXED(15) INIT(5),                                     0711
*       3 * FIXED(15) INIT(44),                                    0711
*      2 MENT023,                   /* IDC31223I                     */
*       3 * FIXED(15) INIT(4),                                     0711
*       3 * FIXED(15) INIT(6),                                     0711
*       3 * FIXED(15) INIT(5),                                     0711
*       3 * FIXED(15) INIT(17),                                    0711
*       3 * FIXED(15) INIT(44),                                    0711
*      2 MENT024,                   /* IDC31224I                     */
*       3 * FIXED(15) INIT(3),                                     0711
*       3 * FIXED(15) INIT(6),                                     0711
*       3 * FIXED(15) INIT(5),                                     0711
*       3 * FIXED(15) INIT(44),                                    0711
*      2 MENT025,                   /* IDC31225I                     */
*       3 * FIXED(15) INIT(3),                                     0711
*       3 * FIXED(15) INIT(6),                                     0711
*       3 * FIXED(15) INIT(5),                                     0711
*       3 * FIXED(15) INIT(17),                                    0711
*      2 MENT026,                   /* IDC31226I                     */
*       3 * FIXED(15) INIT(1),                                     0711
*       3 * FIXED(15) INIT(44),                                    0711
*      2 MENT027,                   /* IDC31227I                     */
*       3 * FIXED(15) INIT(3),                                     0711
*       3 * FIXED(15) INIT(6),                                     0711
*       3 * FIXED(15) INIT(4),                                     0711
*       3 * FIXED(15) INIT(44),                                    0711
*      2 MENT028,                   /* IDC31228I                     */
*       3 * FIXED(15) INIT(3),                                     0711
*       3 * FIXED(15) INIT(6),                                     0711
*       3 * FIXED(15) INIT(5),                                     0711
*       3 * FIXED(15) INIT(44),                                    0711
*      2 MENT029,                   /* IDC31229I                     */
*       3 * FIXED(15) INIT(2),                                     0711
*       3 * FIXED(15) INIT(4),                                     0711
*       3 * FIXED(15) INIT(44),                                    0711
*      2 MENT030,                   /* IDC31230I                     */
*       3 * FIXED(15) INIT(1),                                     0711
*       3 * FIXED(15) INIT(4),                                     0711
*      2 MENT031,                   /* IDC31231I                     */
*       3 * FIXED(15) INIT(1),                                     0711
*       3 * FIXED(15) INIT(44),                                    0711
*      2 MENT032,                   /* IDC31232I                     */
*       3 * FIXED(15) INIT(1),                                     0711
*       3 * FIXED(15) INIT(44),                                    0711
*      2 MENT033,                   /* IDC31233I                     */
*       3 * FIXED(15) INIT(3),                                     0711
*       3 * FIXED(15) INIT(17),                                    0711
*       3 * FIXED(15) INIT(5),                                     0711
*       3 * FIXED(15) INIT(44),                                    0711
*      2 MENT034,                   /* IDC31234I                     */
*       3 * FIXED(15) INIT(2),                                     0711
*       3 * FIXED(15) INIT(17),                                    0711
*       3 * FIXED(15) INIT(5),                                     0711
*      2 MENT035,                   /* IDC31235I                     */
*       3 * FIXED(15) INIT(3),                                     0711
*       3 * FIXED(15) INIT(5),                                     0711
*       3 * FIXED(15) INIT(5),                                     0711
*       3 * FIXED(15) INIT(44),                                    0711
*      2 MENT036,                   /* IDC31236I                     */
*       3 * FIXED(15) INIT(2),                                     0711
*       3 * FIXED(15) INIT(4),                                     0711
*       3 * FIXED(15) INIT(2),                                     0711
*      2 MENT037,                   /* IDC31237I                     */
*       3 * FIXED(15) INIT(1),                                     0711
*       3 * FIXED(15) INIT(5),                                     0711
*      2 MENT038,                   /* IDC31238I                     */
*       3 * FIXED(15) INIT(1),                                     0711
*       3 * FIXED(15) INIT(44),                                    0711
*      2 MENT039,                   /* IDC31239I                     */
*       3 * FIXED(15) INIT(1),                                     0711
*       3 * FIXED(15) INIT(5),                                     0711
*      2 MENT040,                   /* IDC31240I                     */
*       3 * FIXED(15) INIT(1),                                     0711
*       3 * FIXED(15) INIT(5),                                     0711
*      2 MENT041,                   /* IDC31241I                     */
*       3 * FIXED(15) INIT(0),                                     0711
*      2 MENT042,                   /* IDC31242I                     */
*       3 * FIXED(15) INIT(4),                                     0711
*       3 * FIXED(15) INIT(13),                                    0711
*       3 * FIXED(15) INIT(6),                                     0711
*       3 * FIXED(15) INIT(5),                                     0711
*       3 * FIXED(15) INIT(44),                                    0711
*      2 MENT043,                   /* IDC31243I                     */
*       3 * FIXED(15) INIT(1),                                     0711
*       3 * FIXED(15) INIT(5),                                     0711
*      2 MENT044,                   /* IDC11244I                     */
*       3 * FIXED(15) INIT(1),                                     0711
*       3 * FIXED(15) INIT(4),                                     0711
*      2 MENT045,                   /* IDC31245I                     */
*       3 * FIXED(15) INIT(2),                                     0711
*       3 * FIXED(15) INIT(4),                                     0711
*       3 * FIXED(15) INIT(44),                                    0711
*      2 MENT046,                   /* IDC31246I                     */
*       3 * FIXED(15) INIT(2),                                     0711
*       3 * FIXED(15) INIT(8),                                     0711
*       3 * FIXED(15) INIT(44),                                    0711
*      2 MENT047,                   /* IDC31247I             @ZA27389*/
*       3 * FIXED(15) INIT(0),                                     0711
*      2 MENT077,                   /* IDC498D               @ZA25908*/
*       3 * FIXED(15) INIT(1),      /*                       @ZA25908*/
*       3 * FIXED(15) INIT(6),      /*                       @ZA25908*/
*      2 MENT078,                   /* IDC498D               @ZA25908*/
*       3 * FIXED(15) INIT(1),      /*                       @ZA25908*/
*       3 * FIXED(15) INIT(6),      /*                       @ZA25908*/
*      2 MENT079,                   /* IDC498D                       */
*       3 * FIXED(15) INIT(1),                                     0711
*       3 * FIXED(15) INIT(6),                                     0711
*      2 MENT090,                   /* IDC0001I                      */
*       3 * FIXED(15) INIT(1),                                     0711
*       3 * FIXED(15) INIT(2),                                     0711
*      2 MENT091,                   /* IDC3003I                      */
*       3 * FIXED(15) INIT(1),                                     0711
*       3 * FIXED(15) INIT(2),                                     0711
*      2 MENT092,                   /* IDC0005I                      */
*       3 * FIXED(15) INIT(1),                                     0711
*       3 * FIXED(15) INIT(4),                                     0711
*      2 MENT093,                   /* IDC3004I                      */
*       3 * FIXED(15) INIT(0);                                     0711
         EJECT
*                                                                  0712
*   /*****************************************************************/
*   /*                                                               */
*   /* RESTORE CODEREGS UPON ENTRY HERE FROM WITHIN OR OUTSIDE THE   */
*   /* MODULE. BOTH CASES ARE HANDLED. THIS ALLOWS ENTRY WITHOUT THE */
*   /* STANDARD PROLOGUE AND AVOIDS A GETMAIN UPON EACH ENTRY        */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0712
*   GEN(ENTRY IDCRDER);                                            0712
         ENTRY IDCRDER
*   LM(REG9,REG12,SPLITSAV);                                       0713
         LM    REG9,REG12,SPLITSAV                                 0713
*   OLDERID2=NEWERID2;                                             0714
         L     @06,@PC00001                                        0714
         L     @15,GDTTR2(,@06)                                    0714
         MVC   @TS00001(95),NEWERID2(@15)                          0714
         MVC   OLDERID2(95,@15),@TS00001                           0714
*   NEWID2='RD6T';                                                 0715
         MVC   NEWID2(4,@15),@CC03304                              0715
*   IF GDTDBG=NULLPTR THEN                                         0716
         L     @06,GDTDBG(,@06)                                    0716
         LTR   @06,@06                                             0716
         BZ    @RT00716                                            0716
*     ;                                                            0717
*   ELSE                                                           0718
*     CALL IDCDB010(GDTTBL,'RD6S');                                0718
*                                                                  0718
         L     @06,@PC00001                                        0718
         ST    @06,@AL00001                                        0718
         LA    @15,@CC03305                                        0718
         ST    @15,@AL00001+4                                      0718
         MVI   @AL00001+4,X'80'                                    0718
         L     @15,GDTDBG(,@06)                                    0718
         LA    @01,@AL00001                                        0718
         BALR  @14,@15                                             0718
*   /*****************************************************************/
*   /*                                                               */
*   /* FOR CATALOG ERRORS FROM DEFINE OR DELETE, SET UP THE ERROR    */
*   /* CONVERSION TABLE AND CALL UERROR TO PRINT THE CATALOG ERROR   */
*   /* MESSAGE                                                       */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0719
*   IF ERRCATLG(CKRERN)=ON THEN                                    0719
@RT00716 L     @06,@PC00001+8                                      0719
         LH    @15,CKRERN(,@06)                                    0719
         MH    @15,@CH00038                                        0719
         LA    @14,ERRCATLG-12(@15)                                0719
         TM    0(@14),B'10000000'                                  0719
         BNO   @RF00719                                            0719
*     DO;                                                          0720
*       ERCNVTAB=ERCNVTAB&&ERCNVTAB;                               0721
         L     @15,ERCNVADR                                        0721
         XC    ERCNVTAB(32,@15),ERCNVTAB(@15)                      0721
*       ERCATLG=ON;                                                0722
         OI    ERCATLG(@15),B'10000000'                            0722
*       ERCATRC=RDCATRC;                                           0723
         L     @14,RDCATRC(,@06)                                   0723
         ST    @14,ERCATRC(,@15)                                   0723
*       ERCPLPT=REPCPPTR;                                          0724
         L     @06,REPCPPTR(,@06)                                  0724
         ST    @06,ERCPLPT(,@15)                                   0724
*       IF CTGOPTNS=CTGDELET THEN                                  0725
         TM    CTGOPTNS(@06),B'00011000'                           0725
         BNO   @RF00725                                            0725
         TM    CTGOPTNS(@06),B'11100000'                           0725
         BNZ   @RF00725                                            0725
*         ERCATDL=ON;                                              0726
         OI    ERCATDL(@15),B'00100000'                            0726
*       ELSE                                                       0727
*         ERCATDE=ON;                                              0727
         B     @RC00725                                            0727
@RF00725 L     @06,ERCNVADR                                        0727
         OI    ERCATDE(@06),B'01000000'                            0727
*       CALL IDCTPER0(GDTTBL,ERCNVADR);                            0728
@RC00725 L     @06,@PC00001                                        0728
         ST    @06,@AL00001                                        0728
         LA    @15,ERCNVADR                                        0728
         ST    @15,@AL00001+4                                      0728
         MVI   @AL00001+4,X'80'                                    0728
         L     @15,GDTERR(,@06)                                    0728
         LA    @01,@AL00001                                        0728
         BALR  @14,@15                                             0728
*     END;                                                         0729
*                                                                  0729
*   /*****************************************************************/
*   /*                                                               */
*   /* WHEN AN ERROR MESSAGE IS TO BE PRINTED, SET UP THE DATA       */
*   /* ARGUMENT LIST                                                 */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0730
*   DARGL=DARGL&&DARGL;                                            0730
@RF00719 XC    DARGL(100),DARGL                                    0730
*   DARGSMOD=ERRSTMOD(CKRERN);                                     0731
         L     @06,DDSTRU                                          0731
         L     @15,@PC00001+8                                      0731
         LH    @14,CKRERN(,@15)                                    0731
         MH    @14,@CH00038                                        0731
         LA    @01,ERRSTMOD-12(@14)                                0731
         MVC   DARGSMOD(3,@06),0(@01)                              0731
*   DARGSENT=ERRSTENT(CKRERN);                                     0732
*                                                                  0732
         SLR   @05,@05                                             0732
         IC    @05,ERRSTENT-12(@14)                                0732
         STC   @05,DARGSENT(,@06)                                  0732
*   /*****************************************************************/
*   /*                                                               */
*   /* UNIVERSAL MESSAGES HAVE AT MOST ONE INSERT. PUT BLOCK POINTER */
*   /* AND BLOCK LENGTH IN DATA ARGUMENT LIST                        */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0733
*   IF DARGSMOD='UV0'&MSGVARNO=1 THEN                              0733
         CLC   DARGSMOD(3,@06),@CC03077                            0733
         BNE   @RF00733                                            0733
         L     @14,ERRMVPTR-12(@14)                                0733
         CLC   MSGVARNO(2,@14),@CH00220                            0733
         BNE   @RF00733                                            0733
*     DO;                                                          0734
*       DARGDBP=CKRMVAR(1);                                        0735
         L     @15,CKRMVAR(,@15)                                   0735
         ST    @15,DARGDBP(,@06)                                   0735
*       DARGILP=MSGLEN(1);                                         0736
         LH    @15,MSGLEN(,@14)                                    0736
         STH   @15,DARGILP(,@06)                                   0736
*     END;                                                         0737
*                                                                  0737
*   /*****************************************************************/
*   /*                                                               */
*   /* COMPLETE DARGARY FOR REPAIRV MESSAGES WITH INSERT DATA        */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0738
*   IF DARGSMOD='RD0'&MSGVARNO>0 THEN                              0738
@RF00733 L     @06,DDSTRU                                          0738
         CLC   DARGSMOD(3,@06),@CC02242                            0738
         BNE   @RF00738                                            0738
         L     @15,@PC00001+8                                      0738
         LH    @15,CKRERN(,@15)                                    0738
         MH    @15,@CH00038                                        0738
         L     @01,ERRMVPTR-12(@15)                                0738
         LH    @15,MSGVARNO(,@01)                                  0738
         LTR   @15,@15                                             0738
         BNP   @RF00738                                            0738
*     DO;                                                          0739
*       DARGCNT=MSGVARNO;                                          0740
         STH   @15,DARGCNT(,@06)                                   0740
*       DO CKIDX=1 TO DARGCNT;                                     0741
         LA    CKIDX,1                                             0741
         B     @DE00741                                            0741
@DL00741 DS    0H                                                  0742
*         DARGINS(CKIDX)=CKIDX;                                    0742
         L     @06,DDSTRU                                          0742
         LR    @03,CKIDX                                           0742
         SLA   @03,3                                               0742
         STH   CKIDX,DARGINS-8(@03,@06)                            0742
*         DARGINL(CKIDX)=MSGLEN(CKIDX);                            0743
         LR    @15,CKIDX                                           0743
         ALR   @15,@15                                             0743
         L     @14,@PC00001+8                                      0743
         LH    @05,CKRERN(,@14)                                    0743
         MH    @05,@CH00038                                        0743
         L     @01,ERRMVPTR-12(@05)                                0743
         LH    @15,MSGLEN-2(@15,@01)                               0743
         STH   @15,DARGINL-8(@03,@06)                              0743
*         DARGDTM(CKIDX)=CKRMVAR(CKIDX);                           0744
         LR    @15,CKIDX                                           0744
         SLA   @15,2                                               0744
         L     @15,CKRMVAR-4(@15,@14)                              0744
         ST    @15,DARGDTM-8(@03,@06)                              0744
*       END;                                                       0745
*                                                                  0745
         AL    CKIDX,@CF00220                                      0745
@DE00741 L     @06,DDSTRU                                          0745
         CH    CKIDX,DARGCNT(,@06)                                 0745
         BNH   @DL00741                                            0745
*       /*************************************************************/
*       /*                                                           */
*       /* MESSAGE 7(IDC31207I) AND MESSAGE 33(IDC31233I) CAN HAVE A */
*       /* VARIABLE LENGTH INSERT. THIS LENGTH IS PASSED AS THE LAST */
*       /* PARAMETER OF THE CALLCKER PARAMETER LIST AND OVERLAYS THE */
*       /* FIXED LENGTH IN THE DARGLIST                              */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0746
*       IF CKRERN=MESSAG7 THEN                                     0746
         L     @06,@PC00001+8                                      0746
         CLC   CKRERN(2,@06),@CH00602                              0746
         BNE   @RF00746                                            0746
*         DARGINL(1)=CKRMVAR(2)->VARLENCK;                         0747
         L     @06,CKRMVAR+4(,@06)                                 0747
         SLR   @15,@15                                             0747
         IC    @15,VARLENCK(,@06)                                  0747
         L     @06,DDSTRU                                          0747
         STH   @15,DARGINL(,@06)                                   0747
*       ELSE                                                       0748
*         ;                                                        0748
@RF00746 DS    0H                                                  0749
*       IF CKRERN=MESSAG33 THEN                                    0749
         L     @06,@PC00001+8                                      0749
         CLC   CKRERN(2,@06),@CH02361                              0749
         BNE   @RF00749                                            0749
*         DARGINL(2)=CKRMVAR(4)->VARLENCK;                         0750
         L     @06,CKRMVAR+12(,@06)                                0750
         SLR   @15,@15                                             0750
         IC    @15,VARLENCK(,@06)                                  0750
         L     @06,DDSTRU                                          0750
         STH   @15,DARGINL+8(,@06)                                 0750
*       ELSE                                                       0751
*         ;                                                        0751
@RF00749 DS    0H                                                  0752
*     END;                                                         0752
*                                                                  0752
*   /*****************************************************************/
*   /*                                                               */
*   /* CALL UPRINT TO PRINT MESSAGE                                  */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0753
*   IF DARGSMOD^='   ' THEN                                        0753
@RF00738 L     @06,DDSTRU                                          0753
         CLC   DARGSMOD(3,@06),@CC02759                            0753
         BE    @RF00753                                            0753
*     CALL AMSTP011(GDTTBL,0,DDSTRU);                              0754
*                                                                  0754
         L     @06,@PC00001                                        0754
         ST    @06,@AL00001                                        0754
         LA    @15,@CF00117                                        0754
         ST    @15,@AL00001+4                                      0754
         LA    @15,DDSTRU                                          0754
         ST    @15,@AL00001+8                                      0754
         MVI   @AL00001+8,X'80'                                    0754
         L     @15,GDTPRT(,@06)                                    0754
         LA    @01,@AL00001                                        0754
         BALR  @14,@15                                             0754
*   /*****************************************************************/
*   /*                                                               */
*   /* KEEP THE HIGHEST CONDITION CODE IN LASTCC                     */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0755
*   IF LASTCC<=ERRCNDCD(CKRERN) THEN                               0755
@RF00753 L     @06,@PC00001+8                                      0755
         LH    @06,CKRERN(,@06)                                    0755
         MH    @06,@CH00038                                        0755
         SLR   @15,@15                                             0755
         IC    @15,ERRCNDCD-12(@06)                                0755
         CH    @15,LASTCC                                          0755
         BL    @RF00755                                            0755
*     LASTCC=ERRCNDCD(CKRERN);                                     0756
*                                                                  0756
         STH   @15,LASTCC                                          0756
*   /*****************************************************************/
*   /*                                                               */
*   /* IF CONDITION CODE IS GREATER THAN 4, ISSUE UDUMP              */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0757
*   IF ERRCNDCD(CKRERN)>4 THEN                                     0757
@RF00755 L     @06,@PC00001+8                                      0757
         LH    @06,CKRERN(,@06)                                    0757
         MH    @06,@CH00038                                        0757
         SLR   @15,@15                                             0757
         IC    @15,ERRCNDCD-12(@06)                                0757
         C     @15,@CF00044                                        0757
         BNH   @RF00757                                            0757
*     IF GDTDBG=NULLPTR THEN                                       0758
         L     @06,@PC00001                                        0758
         L     @06,GDTDBG(,@06)                                    0758
         LTR   @06,@06                                             0758
         BZ    @RT00758                                            0758
*       ;                                                          0759
*     ELSE                                                         0760
*       CALL IDCDB010(GDTTBL,'RD6U');                              0760
         L     @06,@PC00001                                        0760
         ST    @06,@AL00001                                        0760
         LA    @15,@CC03306                                        0760
         ST    @15,@AL00001+4                                      0760
         MVI   @AL00001+4,X'80'                                    0760
         L     @15,GDTDBG(,@06)                                    0760
         LA    @01,@AL00001                                        0760
         BALR  @14,@15                                             0760
*   END IDCRDER;                                                   0761
@EL00003 DS    0H                                                  0761
@EF00003 DS    0H                                                  0761
@ER00003 LM    @14,@12,@SA00003                                    0761
         BR    @14                                                 0761
*IDCRDIO:                                                          0762
*   PROCEDURE;                                                     0762
*                                                                  0762
IDCRDIO  STM   @14,@03,@SA00004                                    0762
         STM   @05,@12,@SA00004+24                                 0762
*/********************************************************************/
*/*                                                                  */
*/* PROCEDURE NAME - IDCRDIO                                         */
*/*                                                                  */
*/* FUNCTION - THIS PROCEDURE PERFORMS ALL OF THE I/O TO THE         */
*/*            REPAIRV WORKFILE                                      */
*/*                                                                  */
*/* ENTRY POINT - IDCRDIO (ONLY ENTRY POINT FOR THIS PROCEDURE)      */
*/*                                                                  */
*/*           LINKAGE - '?UPDRCD;'                                   */
*/*                     '?POSCRD (DS (IN × OUT);'                    */
*/*                     '?ADDRCD;'                                   */
*/*                     '?LOADRCD;'                                  */
*/*                     '?GETRCD DS (IN × OUT) FOR (NUP × UPD);'     */
*/*                                                                  */
*/*           INPUT -                                                */
*/*                                                                  */
*/*             WFIODAD - ADDRESS OF DATA BUFFER                     */
*/*             WFIODLN - LENGTH OF DATA                             */
*/*             WFIOKYA - ADDRESS OF KEY AREA                        */
*/*                                                                  */
*/*           OUTPUT -                                               */
*/*                                                                  */
*/*             IDCRDIO CALLS ONE OF THE FOLLOWING SUBROUTINES       */
*/*             TO PERFORM I/O ON THE WORKFILE:                      */
*/*                                                                  */
*/*                IDCRDOA - TO ADD A RECORD                         */
*/*                IDCRDOG - TO GET A RECORD                         */
*/*                IDCRDOU - TO UPDATE A RECORD                      */
*/*                IDCRDOP - TO POSITION TO A RECORD                 */
*/*                                                                  */
*/*           EXIT, NORMAL -                                         */
*/*                                                                  */
*/*             LASTCC = 00        FUNCTION COMPLETED NORMALLY       */
*/*                                                                  */
*/*           EXIT, ERROR -                                          */
*/*                                                                  */
*/*             LASTCC = 04        I/O ERROR                         */
*/*                                                                  */
*/*             LASTCC = 08        RECORD NOT FOUND                  */
*/*                                                                  */
*/*             LASTCC = 16        END OF FILE                       */
*/*                                                                  */
*/* INTERNAL INTERFACES -                                            */
*/*                                                                  */
*/*      MACROS/SVCS                                                 */
*/*                                                                  */
*/*           ?CALLCKER - REPAIRV MESSAGE WRITER ROUTINE             */
*/*              WRITES ALL MESSAGES                                 */
*/*              GENERATES A CALL TO PROCEDURE IDCRDER               */
*/*                                                                  */
*/*      PROCEDURES/SUBROUTINES CALLED                               */
*/*                                                                  */
*/*           IDCRDOU (?UPDRCD) - TO UPDATE A RECORD IN THE REPAIR   */
*/*                   WORKFILE                                       */
*/*                                                                  */
*/*           IDCRDOP (?POSRCD) - TO POSITION TO A RECORD IN THE     */
*/*                   REPAIR WORKFILE                                */
*/*                                                                  */
*/*           IDCRDOA (?ADDRCD × ?LOADRCD) - TO ADD OR WRITE A       */
*/*                   RECORD TO THE REPAIR WORKFILE                  */
*/*                                                                  */
*/*           IDCRDOG (?GETRCD) - TO READ A RECORD FROM THE REPAIR   */
*/*                   WORKFILE                                       */
*/*                                                                  */
*/*      DATA AREAS                                                  */
*/*                                                                  */
*/*           NONE                                                   */
*/*                                                                  */
*/* EXTERNAL INTERFACES -                                            */
*/*                                                                  */
*/*      MACROS/SVCS                                                 */
*/*                                                                  */
*/*           UDUMP - IDCAMS DUMP POINT ROUTINE                      */
*/*              PRINTS A DUMP AT THE SPECIFIED DUMP POINT           */
*/*              GENERATES A CALL TO MODULE IDCDB01                  */
*/*                                                                  */
*/*           UPOSIT - IDCAMS I/O ADAPTER POSITION RECORD ROUTINE    */
*/*              POSITIONS TO THE REQUESTED RECORD IN REPAIR WORKFILE*/
*/*              GENERATES A CALL TO MODULE IDCIOPO                  */
*/*                                                                  */
*/*           UGET - IDCAMS I/O ADAPTER GET ROUTINE                  */
*/*              READS RECORDS FROM THE REPAIR WORKFILE              */
*/*              GENERATES A CALL TO MODULE IDCIOGT                  */
*/*                                                                  */
*/*           UPUT - IDCAMS I/O ADAPTER PUT ROUTINE                  */
*/*              WRITES UPDATE REQUESTS TO THE REPAIR WORKFILE       */
*/*              GENERATES A CALL TO MODULE IDCIOPT                  */
*/*                                                                  */
*/*           UTRACE - IDCAMS TRACE POINT ROUTINE                    */
*/*              SETS TRACE POINT                                    */
*/*                                                                  */
*/*      PROCEDURES/SUBROUTINES CALLED -                             */
*/*                                                                  */
*/*           NONE                                                   */
*/*                                                                  */
*/*      DATA AREAS -                                                */
*/*                                                                  */
*/*           REPAIR WORKFILE DATA BUFFER                            */
*/*                                                                  */
*/********************************************************************/
*                                                                  0763
*                                                                  0763
*   /*****************************************************************/
*   /*                                                               */
*   /* IDCRDIO DECLARES                                              */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0763
*   DCL                                                            0763
*     WFIOKEYW CHAR(11) BASED(WFIOKYA);/* USERS KEY AREA             */
*   DCL                                                            0764
*     WFIOKEYI CHAR(11) BASED(IOCKYA);/* U-MACRO KEY AREA            */
*   DCL                                                            0765
*     WFIORC FIXED(31);             /* RETURN CODE                   */
*   DCL                                                            0766
*     MSG83 FIXED(8) CONSTANT(83);  /* CAUSES LASTCC=12              */
*                                                                  0766
*   /*****************************************************************/
*   /*                                                               */
*   /* RESTORE CODEREGS WHICH HAD BEEN SAVED DURING THE FIRST ENTRY  */
*   /* INTO THE MODULE AT THE DUMMY INITIALIZATION ENTRY POINT       */
*   /* IDCRD06. THIS AVOIDS DOING STANDARD PROLOGUE AT ENTRY IDCRDIO */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0767
*   GEN(ENTRY IDCRDIO);                                            0767
         ENTRY IDCRDIO
*   LM(REG9,REG12,SPLITSAV);                                       0768
         LM    REG9,REG12,SPLITSAV                                 0768
*   OLDERID2=NEWERID2;                                             0769
         L     @06,@PC00001                                        0769
         L     @05,GDTTR2(,@06)                                    0769
         MVC   @TS00001(95),NEWERID2(@05)                          0769
         MVC   OLDERID2(95,@05),@TS00001                           0769
*   NEWID2='RD68';                                                 0770
         MVC   NEWID2(4,@05),@CC03315                              0770
*   IF GDTDBG=NULLPTR THEN                                         0771
         L     @06,GDTDBG(,@06)                                    0771
         LTR   @06,@06                                             0771
         BZ    @RT00771                                            0771
*     ;                                                            0772
*   ELSE                                                           0773
*     CALL IDCDB010(GDTTBL,'RD69');                                0773
*                                                                  0773
         L     @06,@PC00001                                        0773
         ST    @06,@AL00001                                        0773
         LA    @05,@CC03316                                        0773
         ST    @05,@AL00001+4                                      0773
         MVI   @AL00001+4,X'80'                                    0773
         L     @15,GDTDBG(,@06)                                    0773
         LA    @01,@AL00001                                        0773
         BALR  @14,@15                                             0773
*   /*****************************************************************/
*   /*                                                               */
*   /* SET IOCS POINTER                                              */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0774
*   IF WFRIN=ON THEN                                               0774
@RT00771 L     @06,@PC00001+8                                      0774
         TM    WFRIN(@06),B'10000000'                              0774
         BNO   @RF00774                                            0774
*     IOCSPTR=REPIRWIO;                                            0775
         L     @06,REPIRWIO(,@06)                                  0775
         ST    @06,IOCSPTR                                         0775
*   ELSE                                                           0776
*     IOCSPTR=REPORWIO;                                            0776
*                                                                  0776
         B     @RC00774                                            0776
@RF00774 L     @06,@PC00001+8                                      0776
         L     @06,REPORWIO(,@06)                                  0776
         ST    @06,IOCSPTR                                         0776
*   /*****************************************************************/
*   /*                                                               */
*   /* CALL APPROPRIATE FUNCTIONAL SUBROUTINE                        */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0777
*   IF WFRADD=ON×WFRLD=ON THEN                                     0777
@RC00774 L     @06,@PC00001+8                                      0777
         TM    WFRADD(@06),B'11000000'                             0777
         BZ    @RF00777                                            0777
*     CALL IDCRDOA;                 /* ADDRCD OR LOADRCD             */
         BAL   @14,IDCRDOA                                         0778
*   IF WFRGET=ON THEN                                              0779
@RF00777 L     @06,@PC00001+8                                      0779
         TM    WFRGET(@06),B'00100000'                             0779
         BNO   @RF00779                                            0779
*     CALL IDCRDOG;                 /* GETRCD                        */
         BAL   @14,IDCRDOG                                         0780
*   IF WFRUPD=ON THEN                                              0781
@RF00779 L     @06,@PC00001+8                                      0781
         TM    WFRUPD(@06),B'00010000'                             0781
         BNO   @RF00781                                            0781
*     CALL IDCRDOU;                 /* UPDRCD                        */
         BAL   @14,IDCRDOU                                         0782
*   IF WFRPOS=ON THEN                                              0783
@RF00781 L     @06,@PC00001+8                                      0783
         TM    WFRPOS(@06),B'00001000'                             0783
         BNO   @RF00783                                            0783
*     CALL IDCRDOP;                 /* POSRCD                        */
*                                                                  0784
         BAL   @14,IDCRDOP                                         0784
*   /*****************************************************************/
*   /*                                                               */
*   /* IF AN I/O ERROR OCCURRED, CALL IDCRDER TO SET LASTCC=12       */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0785
*   IF WFIORC=4 THEN                                               0785
@RF00783 C     WFIORC,@CF00044                                     0785
         BNE   @RF00785                                            0785
*     DO;                                                          0786
*       CKREQ=CKREQ&&CKREQ;                                        0787
         L     @06,@PC00001+8                                      0787
         XC    CKREQ(44,@06),CKREQ(@06)                            0787
*       CKRERN=MSG83;                                              0788
         MVC   CKRERN(2,@06),@CH02185                              0788
*       CALL IDCRDER;                                              0789
         BAL   @14,IDCRDER                                         0789
*     END;                                                         0790
*   IF GDTDBG=NULLPTR THEN                                         0791
@RF00785 L     @06,@PC00001                                        0791
         L     @06,GDTDBG(,@06)                                    0791
         LTR   @06,@06                                             0791
         BZ    @RT00791                                            0791
*     ;                                                            0792
*   ELSE                                                           0793
*     CALL IDCDB010(GDTTBL,'RD6A');                                0793
         L     @06,@PC00001                                        0793
         ST    @06,@AL00001                                        0793
         LA    @05,@CC03321                                        0793
         ST    @05,@AL00001+4                                      0793
         MVI   @AL00001+4,X'80'                                    0793
         L     @15,GDTDBG(,@06)                                    0793
         LA    @01,@AL00001                                        0793
         BALR  @14,@15                                             0793
*   RETURN CODE(WFIORC);                                           0794
@RT00791 LR    @15,WFIORC                                          0794
         L     @14,@SA00004                                        0794
         LM    @00,@03,@SA00004+8                                  0794
         LM    @05,@12,@SA00004+24                                 0794
         BR    @14                                                 0794
*IDCRDOA:                                                          0795
*   PROCEDURE;                                                     0795
*                                                                  0795
IDCRDOA  STM   @14,@03,@SA00005                                    0795
         STM   @05,@12,@SA00005+24                                 0795
*/********************************************************************/
*/*                                                                  */
*/* PROCEDURE NAME - IDCRDOA                                         */
*/*                                                                  */
*/* FUNCTION - THIS SUBROUTINE PROCESSES NON-UPDATE PUT REQUESTS     */
*/*            FOR THE REPAIR WORKFILE. THIS SUBROUTINE ALLOWS       */
*/*            REPLACE PROCESSING FOR ADDRCD.                        */
*/*                                                                  */
*/********************************************************************/
*                                                                  0796
*   /*****************************************************************/
*   /*                                                               */
*   /* CLEAR GET UPDATE KEY. SET DATA AREA AND LENGTH IN IOCSTR.     */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0796
*   OLDERID2=NEWERID2;                                             0796
         L     @06,@PC00001                                        0796
         L     @06,GDTTR2(,@06)                                    0796
         MVC   @TS00001(95),NEWERID2(@06)                          0796
         MVC   OLDERID2(95,@06),@TS00001                           0796
*   NEWID2='RD6B';                                                 0797
         MVC   NEWID2(4,@06),@CC03325                              0797
*   WFIOGUK=' ';                                                   0798
         L     @06,@PC00001+8                                      0798
         MVI   WFIOGUK+1(@06),C' '                                 0798
         MVC   WFIOGUK+2(9,@06),WFIOGUK+1(@06)                     0798
         MVI   WFIOGUK(@06),C' '                                   0798
*   IOCDAD=WFIODAD;                                                0799
         L     @15,IOCSPTR                                         0799
         L     @14,WFIODAD(,@06)                                   0799
         ST    @14,IOCDAD(,@15)                                    0799
*   IOCDLN=WFIODLN;                                                0800
*                                                                  0800
         L     @14,WFIODLN(,@06)                                   0800
         ST    @14,IOCDLN(,@15)                                    0800
*   /*****************************************************************/
*   /*                                                               */
*   /* SET NON UPDATE OPTION IN RPL AND REPLACE OPTION IN IOCSTR FOR */
*   /* ADDRCD.                                                       */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0801
*   IF WFRADD=ON THEN                                              0801
         TM    WFRADD(@06),B'10000000'                             0801
         BNO   @RF00801                                            0801
*     DO;                                                          0802
*       RPLUPD=OFF;                                                0803
         L     @06,IOCEXT(,@15)                                    0803
         L     @01,IOCRPL(,@06)                                    0803
         NI    RPLUPD(@01),B'11111101'                             0803
*       IOCMODRP=ON;                                               0804
         OI    IOCMODRP(@06),B'00000010'                           0804
*     END;                                                         0805
*                                                                  0805
*   /*****************************************************************/
*   /*                                                               */
*   /* ISSUE UPUT                                                    */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0806
*   CALL IDCIOPT0(GDTTBL,IOCSPTR);                                 0806
@RF00801 L     @06,@PC00001                                        0806
         ST    @06,@AL00001                                        0806
         LA    @05,IOCSPTR                                         0806
         ST    @05,@AL00001+4                                      0806
         MVI   @AL00001+4,X'80'                                    0806
         L     @15,GDTPUT(,@06)                                    0806
         LA    @01,@AL00001                                        0806
         BALR  @14,@15                                             0806
*   RESPECIFY                                                      0807
*     RTNREG RSTD;                                                 0807
*   TESTRC=RTNREG;                                                 0808
         LR    TESTRC,RTNREG                                       0808
*   RESPECIFY                                                      0809
*     RTNREG UNRSTD;                                               0809
*                                                                  0809
*   /*****************************************************************/
*   /*                                                               */
*   /* RESET NO REPLACE PROCESSING FLAG IN IOCSTR. SAVE RETURN CODE  */
*   /* FROM UPUT AND RETURN.                                         */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0810
*   WFIORC=TESTRC;                                                 0810
         LR    WFIORC,TESTRC                                       0810
*   END IDCRDOA;                                                   0811
@EL00005 DS    0H                                                  0811
@EF00005 DS    0H                                                  0811
@ER00005 LM    @14,@03,@SA00005                                    0811
         LM    @05,@12,@SA00005+24                                 0811
         BR    @14                                                 0811
*IDCRDOG:                                                          0812
*   PROCEDURE;                                                     0812
*                                                                  0812
IDCRDOG  STM   @14,@03,@SA00006                                    0812
         STM   @05,@12,@SA00006+24                                 0812
*/********************************************************************/
*/*                                                                  */
*/* PROCEDURE NAME - IDCRDOG                                         */
*/*                                                                  */
*/* FUNCTION - THIS SUBROUTINE PROCESSES GET REQUESTS FOR INPUT AND  */
*/*            OUTPUT REPAIR WORKFILES. THIS SUBROUTINE ALLOWS       */
*/*            UPDATE AND NON-UPDATE MODES OF PROCESSING.            */
*/*                                                                  */
*/********************************************************************/
*                                                                  0813
*   /*****************************************************************/
*   /*                                                               */
*   /* CLEAR GET UPDATE KEY.                                         */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0813
*   OLDERID2=NEWERID2;                                             0813
         L     @06,@PC00001                                        0813
         L     @06,GDTTR2(,@06)                                    0813
         MVC   @TS00001(95),NEWERID2(@06)                          0813
         MVC   OLDERID2(95,@06),@TS00001                           0813
*   NEWID2='RD6C';                                                 0814
         MVC   NEWID2(4,@06),@CC03329                              0814
*   WFIOGUK=' ';                                                   0815
*                                                                  0815
         L     @06,@PC00001+8                                      0815
         MVI   WFIOGUK+1(@06),C' '                                 0815
         MVC   WFIOGUK+2(9,@06),WFIOGUK+1(@06)                     0815
         MVI   WFIOGUK(@06),C' '                                   0815
*   /*****************************************************************/
*   /*                                                               */
*   /* IF DATA SET IS FOR OUTPUT, SET RPL FOR UPDATE OR NON UPDATE   */
*   /* MODE.                                                         */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0816
*   IF WFRIN=OFF THEN                                              0816
         TM    WFRIN(@06),B'10000000'                              0816
         BNZ   @RF00816                                            0816
*     DO;                                                          0817
*       IF WFRUP=ON THEN                                           0818
         TM    WFRUP(@06),B'01000000'                              0818
         BNO   @RF00818                                            0818
*         RPLUPD=ON;                                               0819
         L     @06,IOCSPTR                                         0819
         L     @06,IOCEXT(,@06)                                    0819
         L     @06,IOCRPL(,@06)                                    0819
         OI    RPLUPD(@06),B'00000010'                             0819
*       ELSE                                                       0820
*         RPLUPD=OFF;                                              0820
         B     @RC00818                                            0820
@RF00818 L     @06,IOCSPTR                                         0820
         L     @06,IOCEXT(,@06)                                    0820
         L     @06,IOCRPL(,@06)                                    0820
         NI    RPLUPD(@06),B'11111101'                             0820
*       RPLAREA=IOCWKA;                                            0821
@RC00818 L     @06,IOCSPTR                                         0821
         L     @06,IOCEXT(,@06)                                    0821
         L     @01,IOCRPL(,@06)                                    0821
         L     @06,IOCWKA(,@06)                                    0821
         ST    @06,RPLAREA(,@01)                                   0821
*     END;                                                         0822
*                                                                  0822
*   /*****************************************************************/
*   /*                                                               */
*   /* ISSUE UGET                                                    */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0823
*   CALL IDCIOGT0(GDTTBL,IOCSPTR);                                 0823
@RF00816 L     @06,@PC00001                                        0823
         ST    @06,@AL00001                                        0823
         LA    @05,IOCSPTR                                         0823
         ST    @05,@AL00001+4                                      0823
         MVI   @AL00001+4,X'80'                                    0823
         L     @15,GDTGET(,@06)                                    0823
         LA    @01,@AL00001                                        0823
         BALR  @14,@15                                             0823
*   RESPECIFY                                                      0824
*     RTNREG RSTD;                                                 0824
*   TESTRC=RTNREG;                                                 0825
         LR    TESTRC,RTNREG                                       0825
*   RESPECIFY                                                      0826
*     RTNREG UNRSTD;                                               0826
*                                                                  0826
*   /*****************************************************************/
*   /*                                                               */
*   /* SAVE RETURN CODE FROM UGET.                                   */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0827
*   WFIORC=TESTRC;                                                 0827
*                                                                  0827
         LR    WFIORC,TESTRC                                       0827
*   /*****************************************************************/
*   /*                                                               */
*   /* UGET WAS SUCCESSFUL. RETURN DATA ADDRESS, DATA LENGTH AND KEY */
*   /* ADDRESS. SAVE GET UPDATE KEY FOR OUTPUT DATA SET              */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0828
*   IF WFIORC=0 THEN                                               0828
         LTR   WFIORC,WFIORC                                       0828
         BNZ   @RF00828                                            0828
*     DO;                                                          0829
*       WFIODAD=IOCDAD;                                            0830
         L     @06,@PC00001+8                                      0830
         L     @05,IOCSPTR                                         0830
         L     @15,IOCDAD(,@05)                                    0830
         ST    @15,WFIODAD(,@06)                                   0830
*       WFIODLN=IOCDLN;                                            0831
         L     @14,IOCDLN(,@05)                                    0831
         ST    @14,WFIODLN(,@06)                                   0831
*       WFIOKYA=IOCDAD+IOCRKP;                                     0832
         L     @05,IOCRKP-1(,@05)                                  0832
         LA    @05,0(,@05)                                         0832
         ALR   @15,@05                                             0832
         ST    @15,WFIOKYA(,@06)                                   0832
*       IF WFRIN=OFF&WFRUP=ON THEN                                 0833
         TM    WFRUP(@06),B'01000000'                              0833
         BNO   @RF00833                                            0833
         TM    WFRIN(@06),B'10000000'                              0833
         BNZ   @RF00833                                            0833
*         WFIOGUK=WFIOKEYW;                                        0834
         MVC   WFIOGUK(11,@06),WFIOKEYW(@15)                       0834
*     END;                                                         0835
*                                                                  0835
*   /*****************************************************************/
*   /*                                                               */
*   /* RETURN                                                        */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0836
*   END IDCRDOG;                                                   0836
@EL00006 DS    0H                                                  0836
@EF00006 DS    0H                                                  0836
@ER00006 LM    @14,@03,@SA00006                                    0836
         LM    @05,@12,@SA00006+24                                 0836
         BR    @14                                                 0836
*IDCRDOU:                                                          0837
*   PROCEDURE;                                                     0837
*                                                                  0837
IDCRDOU  STM   @14,@03,@SA00007                                    0837
         STM   @05,@12,@SA00007+24                                 0837
*/********************************************************************/
*/*                                                                  */
*/* PROCEDURE NAME - IDCRDOU                                         */
*/*                                                                  */
*/* FUNCTION - THIS SUBROUTINE PROCESSES PUT RECORD REQUESTS FOR     */
*/*            OUTPUT REPAIR WORKFILES. IF THE RECORD WAS NOT        */
*/*            READ FOR UPDATE, THIS SUBROUTINE ISSUES UPOSIT-UGET-  */
*/*            UPUT. IF UPOSIT FAILS,THIS SUBROUTINE ISSUES UPUT     */
*/*            NO-UPDATE.  IF THE RECORD WAS READ FOR UPDATE, THIS   */
*/*            SUBROUTINES ISSUES UPUT UPDATE.                       */
*/*                                                                  */
*/********************************************************************/
*                                                                  0838
*   /*****************************************************************/
*   /*                                                               */
*   /* IF RECORD WAS NOT GOTTEN FOR UPDATE, MUST ISSUE UPOSIT -UGET  */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0838
*   OLDERID2=NEWERID2;                                             0838
         L     @06,@PC00001                                        0838
         L     @05,GDTTR2(,@06)                                    0838
         MVC   @TS00001(95),NEWERID2(@05)                          0838
         MVC   OLDERID2(95,@05),@TS00001                           0838
*   NEWID2='RD6D';                                                 0839
         MVC   NEWID2(4,@05),@CC03333                              0839
*   IF WFIOGUK^=WFIOKEYW THEN                                      0840
         L     @05,@PC00001+8                                      0840
         L     @01,WFIOKYA(,@05)                                   0840
         CLC   WFIOGUK(11,@05),WFIOKEYW(@01)                       0840
         BE    @RF00840                                            0840
*     DO;                                                          0841
*                                                                  0841
*       /*************************************************************/
*       /*                                                           */
*       /* SET KEYLENGTH AND KEY ADDRESS FOR UPOSIT                  */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0842
*       IOCPTL=IOCKYL;                                             0842
         L     @02,IOCSPTR                                         0842
         SLR   @15,@15                                             0842
         IC    @15,IOCKYL(,@02)                                    0842
         STH   @15,IOCPTL(,@02)                                    0842
*       IOCKYA=WFIODAD+IOCRKP;                                     0843
*                                                                  0843
         L     @15,IOCRKP-1(,@02)                                  0843
         LA    @15,0(,@15)                                         0843
         AL    @15,WFIODAD(,@05)                                   0843
         ST    @15,IOCKYA(,@02)                                    0843
*       /*************************************************************/
*       /*                                                           */
*       /* ISSUE UPOSIT                                              */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0844
*       CALL IDCIOPO0(GDTTBL,IOCSPTR);                             0844
         ST    @06,@AL00001                                        0844
         LA    @05,IOCSPTR                                         0844
         ST    @05,@AL00001+4                                      0844
         MVI   @AL00001+4,X'80'                                    0844
         L     @15,GDTPOS(,@06)                                    0844
         LA    @01,@AL00001                                        0844
         BALR  @14,@15                                             0844
*       RESPECIFY                                                  0845
*         RTNREG RSTD;                                             0845
*       TESTRC=RTNREG;                                             0846
         LR    TESTRC,RTNREG                                       0846
*       RESPECIFY                                                  0847
*         RTNREG UNRSTD;                                           0847
*                                                                  0847
*       /*************************************************************/
*       /*                                                           */
*       /* SAVE RETURN CODE FROM UPOSIT                              */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0848
*       WFIORC=TESTRC;                                             0848
*                                                                  0848
         LR    WFIORC,TESTRC                                       0848
*       /*************************************************************/
*       /*                                                           */
*       /* RECORD DOES NOT EXIST, ISSUE UPUT ON UPDATE               */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0849
*       IF TESTRC=8 THEN                                           0849
         C     TESTRC,@CF00039                                     0849
         BNE   @RF00849                                            0849
*         DO;                                                      0850
*                                                                  0850
*           /*********************************************************/
*           /*                                                       */
*           /* RESET IOCSTR OPEN FLAG AFTER NO RECORD FOUND. SET DATA*/
*           /* ADDRESS, DATA LENGTH IN IOCSTR AND NO UPDATE IN RPL   */
*           /* AND ISSUE UPUT.                                       */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0851
*           IOCMSGOP=ON;                                           0851
         L     @06,IOCSPTR                                         0851
         OI    IOCMSGOP(@06),B'00100000'                           0851
*           IOCDAD=WFIODAD;                                        0852
         L     @05,@PC00001+8                                      0852
         L     @02,WFIODAD(,@05)                                   0852
         ST    @02,IOCDAD(,@06)                                    0852
*           IOCDLN=WFIODLN;                                        0853
         L     @05,WFIODLN(,@05)                                   0853
         ST    @05,IOCDLN(,@06)                                    0853
*           RPLUPD=OFF;                                            0854
         L     @06,IOCEXT(,@06)                                    0854
         L     @06,IOCRPL(,@06)                                    0854
         NI    RPLUPD(@06),B'11111101'                             0854
*           CALL IDCIOPT0(GDTTBL,IOCSPTR);                         0855
         L     @06,@PC00001                                        0855
         ST    @06,@AL00001                                        0855
         LA    @05,IOCSPTR                                         0855
         ST    @05,@AL00001+4                                      0855
         MVI   @AL00001+4,X'80'                                    0855
         L     @15,GDTPUT(,@06)                                    0855
         LA    @01,@AL00001                                        0855
         BALR  @14,@15                                             0855
*           RESPECIFY                                              0856
*             RTNREG RSTD;                                         0856
*           TESTRC=RTNREG;                                         0857
         LR    TESTRC,RTNREG                                       0857
*           RESPECIFY                                              0858
*             RTNREG UNRSTD;                                       0858
*                                                                  0858
*           /*********************************************************/
*           /*                                                       */
*           /* CLEAR GET UPDATE KEY                                  */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0859
*           WFIOGUK=' ';                                           0859
         L     @06,@PC00001+8                                      0859
         MVI   WFIOGUK+1(@06),C' '                                 0859
         MVC   WFIOGUK+2(9,@06),WFIOGUK+1(@06)                     0859
         MVI   WFIOGUK(@06),C' '                                   0859
*         END;                                                     0860
*                                                                  0860
*       /*************************************************************/
*       /*                                                           */
*       /* UPUT NON UPDATE WAS DONE, SET RETURN CODE                 */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0861
*       IF WFIORC=8 THEN                                           0861
@RF00849 C     WFIORC,@CF00039                                     0861
         BNE   @RF00861                                            0861
*         WFIORC=TESTRC;                                           0862
         LR    WFIORC,TESTRC                                       0862
*       ELSE                                                       0863
*                                                                  0863
*         /***********************************************************/
*         /*                                                         */
*         /* UPOSIT WAS SUCCESSFUL. SET RPL FOR UPDATE MODE AND ISSUE*/
*         /* UGET.                                                   */
*         /*                                                         */
*         /***********************************************************/
*                                                                  0863
*         IF TESTRC=0 THEN                                         0863
         B     @RC00861                                            0863
@RF00861 LTR   TESTRC,TESTRC                                       0863
         BNZ   @RF00863                                            0863
*           DO;                                                    0864
*             RPLUPD=ON;                                           0865
         L     @06,IOCSPTR                                         0865
         L     @06,IOCEXT(,@06)                                    0865
         L     @05,IOCRPL(,@06)                                    0865
         OI    RPLUPD(@05),B'00000010'                             0865
*             RPLAREA=IOCWKA;                                      0866
         L     @06,IOCWKA(,@06)                                    0866
         ST    @06,RPLAREA(,@05)                                   0866
*             CALL IDCIOGT0(GDTTBL,IOCSPTR);                       0867
         L     @06,@PC00001                                        0867
         ST    @06,@AL00001                                        0867
         LA    @05,IOCSPTR                                         0867
         ST    @05,@AL00001+4                                      0867
         MVI   @AL00001+4,X'80'                                    0867
         L     @15,GDTGET(,@06)                                    0867
         LA    @01,@AL00001                                        0867
         BALR  @14,@15                                             0867
*             RESPECIFY                                            0868
*               RTNREG RSTD;                                       0868
*             TESTRC=RTNREG;                                       0869
         LR    TESTRC,RTNREG                                       0869
*             RESPECIFY                                            0870
*               RTNREG UNRSTD;                                     0870
*                                                                  0870
*             /*******************************************************/
*             /*                                                     */
*             /* SAVE RETURN CODE FROM UGET                          */
*             /*                                                     */
*             /*******************************************************/
*                                                                  0871
*             WFIORC=TESTRC;                                       0871
*                                                                  0871
         LR    WFIORC,TESTRC                                       0871
*             /*******************************************************/
*             /*                                                     */
*             /* UGET WAS SUCCESSFUL. SAVE GET UPDATE KEY            */
*             /*                                                     */
*             /*******************************************************/
*                                                                  0872
*             IF WFIORC=0 THEN                                     0872
         LTR   WFIORC,WFIORC                                       0872
         BNZ   @RF00872                                            0872
*               WFIOGUK=WFIOKEYI;                                  0873
*                                                                  0873
         L     @06,@PC00001+8                                      0873
         L     @05,IOCSPTR                                         0873
         L     @05,IOCKYA(,@05)                                    0873
         MVC   WFIOGUK(11,@06),WFIOKEYI(@05)                       0873
*             /*******************************************************/
*             /*                                                     */
*             /* UGET FAILED. CLEAR GET UPDATE KEY.                  */
*             /*                                                     */
*             /*******************************************************/
*                                                                  0874
*             ELSE                                                 0874
*               WFIOGUK=' ';                                       0874
         B     @RC00872                                            0874
@RF00872 L     @06,@PC00001+8                                      0874
         MVI   WFIOGUK+1(@06),C' '                                 0874
         MVC   WFIOGUK+2(9,@06),WFIOGUK+1(@06)                     0874
         MVI   WFIOGUK(@06),C' '                                   0874
*           END;                                                   0875
*                                                                  0875
@RC00872 DS    0H                                                  0876
*       /*************************************************************/
*       /*                                                           */
*       /* END OF UPOSIT-UGET FOR UPDATE RECORD                      */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0876
*     END;                                                         0876
*                                                                  0876
@RF00863 DS    0H                                                  0876
@RC00861 DS    0H                                                  0877
*   /*****************************************************************/
*   /*                                                               */
*   /* IF RECORD WAS GOTTEN FOR UPDATE                               */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0877
*   IF WFIOGUK=WFIOKEYW THEN                                       0877
@RF00840 L     @06,@PC00001+8                                      0877
         L     @05,WFIOKYA(,@06)                                   0877
         CLC   WFIOGUK(11,@06),WFIOKEYW(@05)                       0877
         BNE   @RF00877                                            0877
*     DO;                                                          0878
*                                                                  0878
*       /*************************************************************/
*       /*                                                           */
*       /* SET DATA ADDRESS AND DATA LENGTH IN IOCSTR AND ISSUE UPUT */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0879
*       IOCDAD=WFIODAD;                                            0879
         L     @05,IOCSPTR                                         0879
         L     @02,WFIODAD(,@06)                                   0879
         ST    @02,IOCDAD(,@05)                                    0879
*       IOCDLN=WFIODLN;                                            0880
         L     @06,WFIODLN(,@06)                                   0880
         ST    @06,IOCDLN(,@05)                                    0880
*       CALL IDCIOPT0(GDTTBL,IOCSPTR);                             0881
         L     @06,@PC00001                                        0881
         ST    @06,@AL00001                                        0881
         LA    @05,IOCSPTR                                         0881
         ST    @05,@AL00001+4                                      0881
         MVI   @AL00001+4,X'80'                                    0881
         L     @15,GDTPUT(,@06)                                    0881
         LA    @01,@AL00001                                        0881
         BALR  @14,@15                                             0881
*       RESPECIFY                                                  0882
*         RTNREG RSTD;                                             0882
*       TESTRC=RTNREG;                                             0883
         LR    TESTRC,RTNREG                                       0883
*       RESPECIFY                                                  0884
*         RTNREG UNRSTD;                                           0884
*                                                                  0884
*       /*************************************************************/
*       /*                                                           */
*       /* SAVE RETURN CODE FROM UPUT AND CLEAR GET UPDATE KEY       */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0885
*       WFIORC=TESTRC;                                             0885
         LR    WFIORC,TESTRC                                       0885
*       WFIOGUK=' ';                                               0886
         L     @06,@PC00001+8                                      0886
         MVI   WFIOGUK+1(@06),C' '                                 0886
         MVC   WFIOGUK+2(9,@06),WFIOGUK+1(@06)                     0886
         MVI   WFIOGUK(@06),C' '                                   0886
*     END;                                                         0887
*                                                                  0887
*   /*****************************************************************/
*   /*                                                               */
*   /* RETURN                                                        */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0888
*   END IDCRDOU;                                                   0888
@EL00007 DS    0H                                                  0888
@EF00007 DS    0H                                                  0888
@ER00007 LM    @14,@03,@SA00007                                    0888
         LM    @05,@12,@SA00007+24                                 0888
         BR    @14                                                 0888
*IDCRDOP:                                                          0889
*   PROCEDURE;                                                     0889
*                                                                  0889
IDCRDOP  STM   @14,@03,@SA00008                                    0889
         STM   @05,@12,@SA00008+24                                 0889
*/********************************************************************/
*/*                                                                  */
*/* PROCEDURE NAME - IDCRDOP                                         */
*/*                                                                  */
*/* FUNCTION - THIS SUBROUTINE PROCESSES POINT REQUESTS FOR INPUT    */
*/*            AND OUTPUT REPAIR WORKFILES.                          */
*/*                                                                  */
*/********************************************************************/
*                                                                  0890
*   /*****************************************************************/
*   /*                                                               */
*   /* CLEAR GET UPDATE KEY                                          */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0890
*   OLDERID2=NEWERID2;                                             0890
         L     @06,@PC00001                                        0890
         L     @02,GDTTR2(,@06)                                    0890
         MVC   @TS00001(95),NEWERID2(@02)                          0890
         MVC   OLDERID2(95,@02),@TS00001                           0890
*   NEWID2='RD6E';                                                 0891
         MVC   NEWID2(4,@02),@CC03337                              0891
*   WFIOGUK=' ';                                                   0892
*                                                                  0892
         L     @02,@PC00001+8                                      0892
         MVI   WFIOGUK+1(@02),C' '                                 0892
         MVC   WFIOGUK+2(9,@02),WFIOGUK+1(@02)                     0892
         MVI   WFIOGUK(@02),C' '                                   0892
*   /*****************************************************************/
*   /*                                                               */
*   /* SET KEY ADDRESS AND KEY LENGTH IN IOCSTR AND ISSUE UPOSIT     */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0893
*   IOCPTL=IOCKYL;                                                 0893
         L     @15,IOCSPTR                                         0893
         SLR   @14,@14                                             0893
         IC    @14,IOCKYL(,@15)                                    0893
         STH   @14,IOCPTL(,@15)                                    0893
*   IOCKYA=WFIOKYA;                                                0894
         L     @02,WFIOKYA(,@02)                                   0894
         ST    @02,IOCKYA(,@15)                                    0894
*   CALL IDCIOPO0(GDTTBL,IOCSPTR);                                 0895
         ST    @06,@AL00001                                        0895
         LA    @02,IOCSPTR                                         0895
         ST    @02,@AL00001+4                                      0895
         MVI   @AL00001+4,X'80'                                    0895
         L     @15,GDTPOS(,@06)                                    0895
         LA    @01,@AL00001                                        0895
         BALR  @14,@15                                             0895
*   RESPECIFY                                                      0896
*     RTNREG RSTD;                                                 0896
*   TESTRC=RTNREG;                                                 0897
         LR    TESTRC,RTNREG                                       0897
*   RESPECIFY                                                      0898
*     RTNREG UNRSTD;                                               0898
*                                                                  0898
*   /*****************************************************************/
*   /*                                                               */
*   /* IF NO RECORD FOUND, RESET OPEN FLAG                           */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0899
*   IF TESTRC=8 THEN                                               0899
         C     TESTRC,@CF00039                                     0899
         BNE   @RF00899                                            0899
*     IOCMSGOP=ON;                                                 0900
*                                                                  0900
         L     @06,IOCSPTR                                         0900
         OI    IOCMSGOP(@06),B'00100000'                           0900
*   /*****************************************************************/
*   /*                                                               */
*   /* SAVE RETURN CODE FROM UPOSIT AND RETURN                       */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0901
*   WFIORC=TESTRC;                                                 0901
@RF00899 LR    WFIORC,TESTRC                                       0901
*   END IDCRDOP;                                                   0902
@EL00008 DS    0H                                                  0902
@EF00008 DS    0H                                                  0902
@ER00008 LM    @14,@03,@SA00008                                    0902
         LM    @05,@12,@SA00008+24                                 0902
         BR    @14                                                 0902
*   END IDCRDIO;                                                   0903
*IDCRDDC:                                                          0904
*   PROCEDURE;                                                     0904
*                                                                  0904
IDCRDDC  STM   @14,@12,@SA00009                                    0904
*/********************************************************************/
*/*                                                                  */
*/*  PROCEDURE NAME - IDCRDDC                                        */
*/*                                                                  */
*/*  FUNCTION - THIS PROCEDURE IS CALLED BY MODULE IDCRD02 TO READ   */
*/*             RECORDS FROM THE FIRST TRACK OF A VTOC (VTOCHEADER), */
*/*             OR VTOC, OR DATA SET, OR STAGING PACK OFFLINE TO THE */
*/*             MSS AS SPECIFIED BY THE EXTENT TABLE ENTRY, AND TO   */
*/*             DIRECT THEM TO EITHER SYSPRINT OR AN ALTERNATE       */
*/*             REPORT FILE.                                         */
*/*             THIS PROCEDURE IS CALLED BY MODULE IDCRD03 TO READ   */
*/*             RECORDS FROM THE FIRST TRACK OF A VTOC (VTOCHEADER), */
*/*             OR VTOC, OR DATA SET, OR STAGING PACK OFFLINE TO THE */
*/*             MSS AS SPECIFIED BY THE EXTENT TABLE ENTRY, AND TO   */
*/*             DIRECT THEM TO A REPAIR WORKFILE.                    */
*/*                                                                  */
*/*  ENTRY POINT - IDCRDDC (ONLY ENTRY POINT FOR THIS PROCEDURE)     */
*/*                                                                  */
*/*             LINKAGE - 'CALL IDCRDDC'                             */
*/*                                                                  */
*/*             INPUT-                                               */
*/*                                                                  */
*/*               VTOC, OR                                           */
*/*               VTOCHEADER, OR                                     */
*/*               DATA SET, OR                                       */
*/*               STAGING PACK OFFLINE TO THE MSS                    */
*/*                                                                  */
*/*             OUTPUT -                                             */
*/*                                                                  */
*/*               ERROR MESSAGE IDC01215I                            */
*/*                                                                  */
*/*             EXIT NORMAL -                                        */
*/*                                                                  */
*/*               LASTCC = 00      FUNCTION COMPLETED NORMALLY       */
*/*                                                                  */
*/*             EXIT ERROR -                                         */
*/*                                                                  */
*/*               LASTCC = 12      FUNCTION DID NOT COMPLETE         */
*/*                                                                  */
*/*  INTERNAL INTERFACES -                                           */
*/*                                                                  */
*/*       MACROS/SVCS                                                */
*/*                                                                  */
*/*            ?CALLCKER - REPAIRV MESSAGE WRITER ROUTINE            */
*/*              WRITES ALL MESSAGES                                 */
*/*              GENERATES A CALL TO MODULE IDCRDER                  */
*/*                                                                  */
*/*            ?LOADRCD - REPAIRV REPAIR WORKFILE WRITE ROUTINE      */
*/*              WRITES INPUT RECORDS TO THE REPAIR WORKFILE         */
*/*              GENERATES A CALL TO MODULE IDCRDIO                  */
*/*                                                                  */
*/*       PROCEDURES/SUBROUTINES CALLED                              */
*/*                                                                  */
*/*            IDCRDPT - TO WRITE THE INPUT RECORDS TO EITHER        */
*/*              SYSPRINT OR AN ALTERNATE REPORT FILE USING THE      */
*/*              UPRINT MACRO INTERFACE                              */
*/*                                                                  */
*/*       DATA AREAS                                                 */
*/*                                                                  */
*/*            NONE                                                  */
*/*                                                                  */
*/*  EXTERNAL INTERFACES -                                           */
*/*                                                                  */
*/*       MACROS/SVCS-                                               */
*/*                                                                  */
*/*            UDUMP - IDCAMS DUMP POINT ROUTINE                     */
*/*              PRINTS A DUMP AT THE SPECIFIED DUMP POINT           */
*/*              GENERATES A CALL TO MODULE IDCDB01                  */
*/*                                                                  */
*/*            UTRACE - IDCAMS TRACE POINT ROUTINE                   */
*/*              SETS TRACE POINT                                    */
*/*                                                                  */
*/*       PROCEDURES/SUBROUTINES CALLED                              */
*/*                                                                  */
*/*            IDCRDRD - TO READ INPUT RECORDS USING THE UEXCP       */
*/*              MACRO INTERFACE                                     */
*/*                                                                  */
*/*       DATA AREAS-                                                */
*/*                                                                  */
*/*            RDARG - IDCAMS I/O ADAPTER READ ARGUMENT LIST         */
*/*              COMMUNICATES THE PARAMETERS FOR READING THE         */
*/*              INPUT RECORD                                        */
*/*                                                                  */
*/*            DEVAREA - DEVTYPE SVC RETURN AREA                     */
*/*              COMMUNICATES THE CHARACTERISTICS OF THE INPUT       */
*/*              DEVICE                                              */
*/*                                                                  */
*/*            RBUF - IDCAMS I/O ADAPTER INPUT BUFFER                */
*/*              CONTAINS THE REQUESTED INPUT RECORD                 */
*/*                                                                  */
*/*            XTNTTBL - REPAIRV EXTENT TABLE                        */
*/*              CONTAINS USER SUPPLIED INFORMATION VIA SYNTAX IN    */
*/*              THE HEADER. CONTAINS EXTENT INFORMATION FOR EACH    */
*/*              EXTENT WITHIN THE USER SUPPLIES RANGE.              */
*/*                                                                  */
*/********************************************************************/
*                                                                  0905
*                                                                  0905
*   /*****************************************************************/
*   /*                                                               */
*   /* VARIABLES USED IN IDCRDDC RETURN CODES FROM IDCRDRD           */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0905
*   DCL                                                            0905
*                                                                  0905
*     /***************************************************************/
*     /*                                                             */
*     /* GOOD COUNT, GOOD KEY/DATA                                   */
*     /*                                                             */
*     /***************************************************************/
*                                                                  0905
*     RC01 FIXED(15) INIT(1),                                      0905
*                                                                  0905
*     /***************************************************************/
*     /*                                                             */
*     /* I/O ERROR ON COUNT, GOOD KEY/DATA                           */
*     /*                                                             */
*     /***************************************************************/
*                                                                  0905
*     RC07 FIXED(15) INIT(7),                                      0905
*                                                                  0905
*     /***************************************************************/
*     /*                                                             */
*     /* RESERVED - USED FOR COMPARISON TEST ONLY                    */
*     /*                                                             */
*     /***************************************************************/
*                                                                  0905
*     RC15 FIXED(15) INIT(15),                                     0905
*                                                                  0905
*     /***************************************************************/
*     /*                                                             */
*     /* GOOD COUNT, I/O ERROR ON KEY/DATA                           */
*     /*                                                             */
*     /***************************************************************/
*                                                                  0905
*     RC16 FIXED(15) INIT(16),                                     0905
*                                                                  0905
*     /***************************************************************/
*     /*                                                             */
*     /* I/O ERROR ON COUNT, I/O ERROR ON KEY/DATA                   */
*     /*                                                             */
*     /***************************************************************/
*                                                                  0905
*     RC19 FIXED(15) INIT(19),                                     0905
*                                                                  0905
*     /***************************************************************/
*     /*                                                             */
*     /* DESTAGE ERROR ON COUNT, I/O ERROR ON KEY/DATA               */
*     /*                                                             */
*     /***************************************************************/
*                                                                  0905
*     RC20 FIXED(15) INIT(20),                                     0905
*                                                                  0905
*     /***************************************************************/
*     /*                                                             */
*     /* STAGE ERROR ON COUNT, I/O ERROR ON KEY/DATA                 */
*     /*                                                             */
*     /***************************************************************/
*                                                                  0905
*     RC21 FIXED(15) INIT(21),                                     0905
*                                                                  0905
*     /***************************************************************/
*     /*                                                             */
*     /* END OF FILE                                                 */
*     /*                                                             */
*     /***************************************************************/
*                                                                  0905
*     RC29 FIXED(15) INIT(29),                                     0905
*                                                                  0905
*     /***************************************************************/
*     /*                                                             */
*     /* END OF TRACK                                                */
*     /*                                                             */
*     /***************************************************************/
*                                                                  0905
*     RC30 FIXED(15) INIT(30),                                     0905
*                                                                  0905
*     /***************************************************************/
*     /*                                                             */
*     /* UNEXPECTED RESULTS                                          */
*     /*                                                             */
*     /***************************************************************/
*                                                                  0905
*     RC31 FIXED(15) INIT(31),                                     0905
*                                                                  0905
*     /***************************************************************/
*     /*                                                             */
*     /* TRACK UNRECOVERABLE                                         */
*     /*                                                             */
*     /***************************************************************/
*                                                                  0905
*     RC32 FIXED(15) INIT(32),                                     0905
*                                                                  0905
*     /***************************************************************/
*     /*                                                             */
*     /* NO RECORD FOUND                                             */
*     /*                                                             */
*     /***************************************************************/
*                                                                  0905
*     RC33 FIXED(15) INIT(33);                                     0905
*                                                                  0905
*   /*****************************************************************/
*   /*                                                               */
*   /* ERROR MESSAGE IDC01215I                                       */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0906
*   DCL                                                            0906
*     MSG15 FIXED(15) INIT(15);                                    0906
*                                                                  0906
*   /*****************************************************************/
*   /*                                                               */
*   /* LENGTH OF COUNT FIELD                                         */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0907
*   DCL                                                            0907
*     COUNTLEN FIXED(15) INIT(8);                                  0907
*                                                                  0907
*   /*****************************************************************/
*   /*                                                               */
*   /* END OF FILE IDENTIFIER                                        */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0908
*   DCL                                                            0908
*     EOFIDENT CHAR(9) INIT('** EOF **');                          0908
*                                                                  0908
*   /*****************************************************************/
*   /*                                                               */
*   /* STAGING PACK IDENTIFIER                                       */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0909
*   DCL                                                            0909
*     STNGPK CHAR(44) INIT('STAGING PACK');                        0909
*                                                                  0909
*   /*****************************************************************/
*   /*                                                               */
*   /* VTOC DATA SET NAMES AND IDENTIFIER                            */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0910
*   DCL                                                            0910
*     VTOCHDR CHAR(44) INIT('VTOCHEADER');                         0910
*   DCL                                                            0911
*     FMT4DSCB CHAR(44) INIT('FORMAT4.DSCB');                      0911
*   DCL                                                            0912
*     1 FMT4DSN CHAR(44) STATIC LOCAL,                             0912
*      2 *(44) CHAR(1) INIT((44)'04'X);                            0912
*                                                                  0912
*   /*****************************************************************/
*   /*                                                               */
*   /* EXTERNAL ROUTINE CALLED BY IDCRDDC                            */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0913
*   DCL                                                            0913
*     IDCRDRD ENTRY EXTERNAL;                                      0913
*                                                                  0914
*   /*****************************************************************/
*   /*                                                               */
*   /* ENTRY POINT FOR IDCRDDC                                       */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0914
*   GEN;                                                           0914
*                                                                  0914
        ENTRY IDCRDDC
        LM    REG9,REG12,SPLITSAV
*   /*****************************************************************/
*   /*                                                               */
*   /* SETUP DATA AREAS ADDRESSABILITY                               */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0915
*   RESPECIFY                                                      0915
*     CKEYL BASED(CKEYLPTR);                                       0915
*   RESPECIFY                                                      0916
*     CDATL BASED(CDATLPTR);                                       0916
*   RESPECIFY                                                      0917
*     DATAL BASED(DATALPTR);                                       0917
*   RESPECIFY                                                      0918
*     DKEYL BASED(DKEYLPTR);                                       0918
*   RESPECIFY                                                      0919
*     DEVAREA BASED(REPIDEVA);                                     0919
*   RESPECIFY                                                      0920
*     XTNTTBL BASED(REPIXTNT);                                     0920
*   RESPECIFY                                                      0921
*     RDARG BASED(REPIDSAR);                                       0921
*   RESPECIFY                                                      0922
*     RBUF BASED(RDDARE);                                          0922
*   RESPECIFY                                                      0923
*     RKEY BASED(RDDARE-(LENGTH(RKEY)));                           0923
*                                                                  0923
*   /*****************************************************************/
*   /*                                                               */
*   /* SET TRACE AND DUMP POINTS                                     */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0924
*   IF GDTDBG=NULLPTR THEN                                         0924
         L     @06,@PC00001                                        0924
         L     @06,GDTDBG(,@06)                                    0924
         LTR   @06,@06                                             0924
         BZ    @RT00924                                            0924
*     ;                                                            0925
*   ELSE                                                           0926
*     CALL IDCDB010(GDTTBL,'RD6F');                                0926
         L     @06,@PC00001                                        0926
         ST    @06,@AL00001                                        0926
         LA    @05,@CC03381                                        0926
         ST    @05,@AL00001+4                                      0926
         MVI   @AL00001+4,X'80'                                    0926
         L     @15,GDTDBG(,@06)                                    0926
         LA    @01,@AL00001                                        0926
         BALR  @14,@15                                             0926
*   OLDERID2=NEWERID2;                                             0927
@RT00924 L     @06,@PC00001                                        0927
         L     @06,GDTTR2(,@06)                                    0927
         MVC   @TS00001(95),NEWERID2(@06)                          0927
         MVC   OLDERID2(95,@06),@TS00001                           0927
*   NEWID2='RD6G';                                                 0928
*                                                                  0928
         MVC   NEWID2(4,@06),@CC03382                              0928
*   /*****************************************************************/
*   /*                                                               */
*   /* CONSTRUCT THE READ ARGUMENT LIST (RDARG)                      */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0929
*   RDARG=''B;                                                     0929
         L     @06,@PC00001+8                                      0929
         L     @05,REPIDSAR(,@06)                                  0929
         XC    RDARG(60,@05),RDARG(@05)                            0929
*   RDCTLBK=REPIDSOP;                                              0930
         L     @15,REPIDSOP(,@06)                                  0930
         ST    @15,RDCTLBK(,@05)                                   0930
*   RDLOCPTR=REPILCPT;                                             0931
         L     @15,REPILCPT(,@06)                                  0931
         ST    @15,RDLOCPTR(,@05)                                  0931
*   RDIOAREA=REPIBFPT;                                             0932
         L     @15,REPIBFPT(,@06)                                  0932
         ST    @15,RDIOAREA(,@05)                                  0932
*   RDCHR=XTNTCHR1(I);                                             0933
         SLR   @15,@15                                             0933
         IC    @15,I(,@06)                                         0933
         MH    @15,@CH02987                                        0933
         L     @06,REPIXTNT(,@06)                                  0933
         ALR   @06,@15                                             0933
         MVC   RDCHR(5,@05),XTNTCHR1-78(@06)                       0933
*   IF(ADDR(DISPL)^=NULLPTR&ADDR(STAGR)^=NULLPTR)×(ADDR(COPY)^=NULLPTR&
*       ADDR(CSRNG)^=NULLPTR) THEN                                 0934
         SLR   @06,@06                                             0934
         L     @05,@PC00001+4                                      0934
         C     @06,FDTPTR(,@05)                                    0934
         BE    @GL00009                                            0934
         C     @06,FDTPTR+32(,@05)                                 0934
         BNE   @RT00934                                            0934
@GL00009 SLR   @06,@06                                             0934
         L     @05,@PC00001+4                                      0934
         C     @06,FDTPTR+136(,@05)                                0934
         BE    @RF00934                                            0934
         C     @06,FDTPTR+148(,@05)                                0934
         BE    @RF00934                                            0934
@RT00934 DS    0H                                                  0935
*     RDDS=ON;                                                     0935
         L     @06,@PC00001+8                                      0935
         L     @06,REPIDSAR(,@06)                                  0935
         MVI   RDDS(@06),X'01'                                     0935
*   ELSE                                                           0936
*     RDDS=OFF;                                                    0936
         B     @RC00934                                            0936
@RF00934 L     @06,@PC00001+8                                      0936
         L     @06,REPIDSAR(,@06)                                  0936
         MVI   RDDS(@06),X'00'                                     0936
*   IF ADDR(DISPL)^=NULLPTR&ADDR(DLENG)^=NULLPTR THEN              0937
@RC00934 SLR   @06,@06                                             0937
         L     @05,@PC00001+4                                      0937
         C     @06,FDTPTR(,@05)                                    0937
         BE    @RF00937                                            0937
         C     @06,FDTPTR+36(,@05)                                 0937
         BE    @RF00937                                            0937
*     DO;                                                          0938
*       RDKLEN=ADDR(DKEYLPTR);                                     0939
         L     @06,@PC00001+8                                      0939
         L     @06,REPIDSAR(,@06)                                  0939
         L     @15,FDTPTR+108(,@05)                                0939
         ST    @15,RDKLEN(,@06)                                    0939
*       RDDLEN=ADDR(DATALPTR);                                     0940
         L     @15,FDTPTR+112(,@05)                                0940
         ST    @15,RDDLEN(,@06)                                    0940
*       RDLENTOT=DLENGCNT;                                         0941
         LA    @05,FDTPTR+36(,@05)                                 0941
         L     @05,DLENGCNT(,@05)                                  0941
         STH   @05,RDLENTOT(,@06)                                  0941
*     END;                                                         0942
*   IF ADDR(COPY)^=NULLPTR&ADDR(CLEN)^=NULLPTR THEN                0943
@RF00937 SLR   @06,@06                                             0943
         L     @05,@PC00001+4                                      0943
         C     @06,FDTPTR+136(,@05)                                0943
         BE    @RF00943                                            0943
         C     @06,FDTPTR+156(,@05)                                0943
         BE    @RF00943                                            0943
*     DO;                                                          0944
*       RDKLEN=ADDR(CKEYLPTR);                                     0945
         L     @06,@PC00001+8                                      0945
         L     @06,REPIDSAR(,@06)                                  0945
         L     @15,FDTPTR+196(,@05)                                0945
         ST    @15,RDKLEN(,@06)                                    0945
*       RDDLEN=ADDR(CDATLPTR);                                     0946
         L     @15,FDTPTR+200(,@05)                                0946
         ST    @15,RDDLEN(,@06)                                    0946
*       RDLENTOT=CLENCNT;                                          0947
         LA    @05,FDTPTR+156(,@05)                                0947
         L     @05,CLENCNT(,@05)                                   0947
         STH   @05,RDLENTOT(,@06)                                  0947
*     END;                                                         0948
*                                                                  0949
*   /*****************************************************************/
*   /*                                                               */
*   /* CALL IDCRDRD TO READ EACH RECORD WITHIN THE CURRENT EXTENT    */
*   /* TABLE ENTRY AND DETERMINE PROCESS                             */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0949
*   DO UNTIL RDCHR>XTNTCHR2(I);                                    0949
*                                                                  0949
@RF00943 DS    0H                                                  0949
@DL00949 DS    0H                                                  0950
*     /***************************************************************/
*     /*                                                             */
*     /* CALL IDCRDRD TO READ THE RECORD                             */
*     /*                                                             */
*     /***************************************************************/
*                                                                  0950
*     CALL IDCRDRD(RDARG);                                         0950
*                                                                  0950
         L     @06,@PC00001+8                                      0950
         L     @06,REPIDSAR(,@06)                                  0950
         ST    @06,@AL00001                                        0950
         L     @15,@CV03369                                        0950
         LA    @01,@AL00001                                        0950
         BALR  @14,@15                                             0950
*     /***************************************************************/
*     /*                                                             */
*     /* SAVE RETURN CODE FROM IDCRDRD                               */
*     /*                                                             */
*     /***************************************************************/
*                                                                  0951
*     RESPECIFY                                                    0951
*       RTNREG RSTD;                                               0951
*     TESTRC=RTNREG;                                               0952
         LR    TESTRC,RTNREG                                       0952
*     RESPECIFY                                                    0953
*       RTNREG UNRSTD;                                             0953
*                                                                  0953
*     /***************************************************************/
*     /*                                                             */
*     /* SAVE RETURN CODE IN REPRC FOR FUTURE REFERENCE              */
*     /*                                                             */
*     /***************************************************************/
*                                                                  0954
*     REPRC=TESTRC;                                                0954
         L     @06,@PC00001+8                                      0954
         STH   TESTRC,REPRC(,@06)                                  0954
*                                                                  0955
*     /***************************************************************/
*     /*                                                             */
*     /* DISPLAY FUNCTION PROCESSING                                 */
*     /*                                                             */
*     /***************************************************************/
*                                                                  0955
*     IF ADDR(DISPL)^=NULLPTR THEN                                 0955
         SLR   @05,@05                                             0955
         L     @15,@PC00001+4                                      0955
         C     @05,FDTPTR(,@15)                                    0955
         BE    @RF00955                                            0955
*       DO;                                                        0956
*                                                                  0956
*         /***********************************************************/
*         /*                                                         */
*         /* DETERMINE IF RECORD IS TO BE DISPLAYED AND IF PROCESSING*/
*         /* IS TO CONTINUE                                          */
*         /*                                                         */
*         /***********************************************************/
*                                                                  0957
*         IF REPRC=RC01&ADDR(ALLA)=NULLPTR THEN                    0957
*                                                                  0957
         L     @14,@PC00001+8                                      0957
         LH    @14,REPRC(,@14)                                     0957
         N     @14,@CF03487                                        0957
         CH    @14,RC01                                            0957
         BNE   @RF00957                                            0957
         C     @05,FDTPTR+8(,@15)                                  0957
         BNE   @RF00957                                            0957
*           /*********************************************************/
*           /*                                                       */
*           /* PROCESSING CONTINUES WITHOUT DISPLAY OF RECORD UPDATE */
*           /* RECORD ADDRESS ONLY                                   */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0958
*           RDRECNUM=RDRECNUM+1;                                   0958
         L     @06,REPIDSAR(,@06)                                  0958
         LA    @05,1                                               0958
         SLR   @15,@15                                             0958
         IC    @15,RDRECNUM(,@06)                                  0958
         ALR   @05,@15                                             0958
         STC   @05,RDRECNUM(,@06)                                  0958
*         ELSE                                                     0959
*                                                                  0959
*           /*********************************************************/
*           /*                                                       */
*           /* PROCESSING CONTINUES FOR THE FOLLOWING RETURN CODES   */
*           /* WITH DISPLAY OF RECORD                                */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0959
*           IF(REPRC=RC01&ADDR(ALLA)^=NULLPTR)×(REPRC<RC16)×(REPRC=RC19
*               ) THEN                                             0959
         B     @RC00957                                            0959
@RF00957 L     @06,@PC00001+8                                      0959
         LH    @06,REPRC(,@06)                                     0959
         N     @06,@CF03487                                        0959
         CH    @06,RC01                                            0959
         BNE   @GL00016                                            0959
         L     @06,@PC00001+4                                      0959
         L     @06,FDTPTR+8(,@06)                                  0959
         LTR   @06,@06                                             0959
         BNZ   @RT00959                                            0959
@GL00016 L     @06,@PC00001+8                                      0959
         LH    @06,REPRC(,@06)                                     0959
         N     @06,@CF03487                                        0959
         CH    @06,RC16                                            0959
         BL    @RT00959                                            0959
         CH    @06,RC19                                            0959
         BNE   @RF00959                                            0959
@RT00959 DS    0H                                                  0960
*             DO;                                                  0960
*                                                                  0960
*               /*****************************************************/
*               /*                                                   */
*               /* DETERMINE RECORD ORIGIN AND CONSTRUCT THE SRPRTARG*/
*               /* IN THE COMMUNICATION REGION                       */
*               /*                                                   */
*               /*****************************************************/
*                                                                  0961
*               IF ADDR(DPVTC)^=NULLPTR THEN                       0961
         L     @06,@PC00001+4                                      0961
         L     @06,FDTPTR+116(,@06)                                0961
         LTR   @06,@06                                             0961
         BZ    @RF00961                                            0961
*                 DO;                                              0962
*                                                                  0962
*                   /*************************************************/
*                   /*                                               */
*                   /* BUILD SRPRTARG FOR VTOCHEADER                 */
*                   /*                                               */
*                   /*************************************************/
*                                                                  0963
*                   SRPRTARG=''B;                                  0963
         L     @06,@PC00001+8                                      0963
         L     @05,REPSPRIT(,@06)                                  0963
         XC    SRPRTARG(44,@05),SRPRTARG(@05)                      0963
*                   SRVOLPTR=ADDR(XTNHVOL);                        0964
         L     @01,REPIXTNT(,@06)                                  0964
         LA    @15,XTNHVOL(,@01)                                   0964
         ST    @15,SRVOLPTR(,@05)                                  0964
*                   SRERCODE=ADDR(REPRC);                          0965
         LA    @15,REPRC(,@06)                                     0965
         ST    @15,SRERCODE(,@05)                                  0965
*                   SRDSNPTR=ADDR(VTOCHDR);                        0966
         LA    @15,VTOCHDR                                         0966
         ST    @15,SRDSNPTR(,@05)                                  0966
*                   SRRECPTR=ADDR(RBUF);                           0967
         L     @06,REPIDSAR(,@06)                                  0967
         L     @06,RDDARE(,@06)                                    0967
         ST    @06,SRRECPTR(,@05)                                  0967
*                 END;                                             0968
*               IF ADDR(DSRNG)^=NULLPTR THEN                       0969
@RF00961 L     @06,@PC00001+4                                      0969
         L     @06,FDTPTR+24(,@06)                                 0969
         LTR   @06,@06                                             0969
         BZ    @RF00969                                            0969
*                 DO;                                              0970
*                                                                  0970
*                   /*************************************************/
*                   /*                                               */
*                   /* BUILD SRPRTARG FOR VTOC OR DATA SET           */
*                   /*                                               */
*                   /*************************************************/
*                                                                  0971
*                   SRPRTARG=''B;                                  0971
         L     @06,@PC00001+8                                      0971
         L     @05,REPSPRIT(,@06)                                  0971
         XC    SRPRTARG(44,@05),SRPRTARG(@05)                      0971
*                   SRVOLPTR=ADDR(XTNHVOL);                        0972
         L     @15,REPIXTNT(,@06)                                  0972
         LA    @14,XTNHVOL(,@15)                                   0972
         ST    @14,SRVOLPTR(,@05)                                  0972
*                   SRERCODE=ADDR(REPRC);                          0973
         LA    @06,REPRC(,@06)                                     0973
         ST    @06,SRERCODE(,@05)                                  0973
*                   IF XTNHDSN=FMT4DSN THEN                        0974
         CLC   XTNHDSN(44,@15),FMT4DSN                             0974
         BNE   @RF00974                                            0974
*                     SRDSNPTR=ADDR(FMT4DSCB);                     0975
         LA    @06,FMT4DSCB                                        0975
         ST    @06,SRDSNPTR(,@05)                                  0975
*                   ELSE                                           0976
*                     SRDSNPTR=ADDR(XTNHDSN);                      0976
         B     @RC00974                                            0976
@RF00974 L     @06,@PC00001+8                                      0976
         L     @05,REPSPRIT(,@06)                                  0976
         L     @06,REPIXTNT(,@06)                                  0976
         LA    @06,XTNHDSN(,@06)                                   0976
         ST    @06,SRDSNPTR(,@05)                                  0976
*                   SRRECPTR=ADDR(RBUF);                           0977
@RC00974 L     @06,@PC00001+8                                      0977
         L     @05,REPSPRIT(,@06)                                  0977
         L     @06,REPIDSAR(,@06)                                  0977
         L     @06,RDDARE(,@06)                                    0977
         ST    @06,SRRECPTR(,@05)                                  0977
*                 END;                                             0978
*                                                                  0978
*               /*****************************************************/
*               /*                                                   */
*               /* BUILD SRPRTARG FOR STAGING PACK                   */
*               /*                                                   */
*               /*****************************************************/
*                                                                  0979
*               IF ADDR(STAGR)^=NULLPTR THEN                       0979
@RF00969 L     @06,@PC00001+4                                      0979
         L     @06,FDTPTR+32(,@06)                                 0979
         LTR   @06,@06                                             0979
         BZ    @RF00979                                            0979
*                 DO;                                              0980
*                   SRPRTARG=''B;                                  0981
         L     @06,@PC00001+8                                      0981
         L     @05,REPSPRIT(,@06)                                  0981
         XC    SRPRTARG(44,@05),SRPRTARG(@05)                      0981
*                   SRVOLPTR=ADDR(XTNHVOL);                        0982
         L     @01,REPIXTNT(,@06)                                  0982
         LA    @15,XTNHVOL(,@01)                                   0982
         ST    @15,SRVOLPTR(,@05)                                  0982
*                   SRERCODE=ADDR(REPRC);                          0983
         LA    @15,REPRC(,@06)                                     0983
         ST    @15,SRERCODE(,@05)                                  0983
*                   SRCCHHRP=ADDR(RBUF);                           0984
         L     @01,REPIDSAR(,@06)                                  0984
         L     @15,RDDARE(,@01)                                    0984
         ST    @15,SRCCHHRP(,@05)                                  0984
*                   SRRECPTR=ADDR(RBUF);                           0985
         ST    @15,SRRECPTR(,@05)                                  0985
*                   IF(REPRC=RC07)×(REPRC=RC19) THEN               0986
         LH    @06,REPRC(,@06)                                     0986
         N     @06,@CF03487                                        0986
         CH    @06,RC07                                            0986
         BE    @RT00986                                            0986
         CH    @06,RC19                                            0986
         BNE   @RF00986                                            0986
@RT00986 DS    0H                                                  0987
*                     SRSPRECL=RDSPKL+RDSPDL;                      0987
         L     @06,@PC00001+8                                      0987
         L     @05,REPSPRIT(,@06)                                  0987
         L     @06,REPIDSAR(,@06)                                  0987
         SLR   @15,@15                                             0987
         IC    @15,RDSPKL(,@06)                                    0987
         AH    @15,RDSPDL(,@06)                                    0987
         ST    @15,SRSPRECL(,@05)                                  0987
*                   ELSE                                           0988
*                     SRSPRECL=RBKL+RBDL;                          0988
         B     @RC00986                                            0988
@RF00986 L     @06,@PC00001+8                                      0988
         L     @05,REPSPRIT(,@06)                                  0988
         L     @06,REPIDSAR(,@06)                                  0988
         L     @06,RDDARE(,@06)                                    0988
         SLR   @15,@15                                             0988
         IC    @15,RBKL(,@06)                                      0988
         AH    @15,RBDL(,@06)                                      0988
         ST    @15,SRSPRECL(,@05)                                  0988
*                 END;                                             0989
*                                                                  0989
@RC00986 DS    0H                                                  0990
*               /*****************************************************/
*               /*                                                   */
*               /* CALL IDCRDPT TO DISPLAY THE RECORD                */
*               /*                                                   */
*               /*****************************************************/
*                                                                  0990
*               CALL IDCRDPT;                                      0990
*                                                                  0990
@RF00979 BAL   @14,IDCRDPT                                         0990
*               /*****************************************************/
*               /*                                                   */
*               /* SAVE RETURN CODE FROM IDCRDPT                     */
*               /*                                                   */
*               /*****************************************************/
*                                                                  0991
*               RESPECIFY                                          0991
*                 RTNREG RSTD;                                     0991
*               TESTRC=RTNREG;                                     0992
         LR    TESTRC,RTNREG                                       0992
*               RESPECIFY                                          0993
*                 RTNREG UNRSTD;                                   0993
*                                                                  0993
*               /*****************************************************/
*               /*                                                   */
*               /* IF IDCRDPT FAILS, RETURN TO THE CALLER WITH RC =  */
*               /* 12                                                */
*               /*                                                   */
*               /*****************************************************/
*                                                                  0994
*               IF TESTRC^=0 THEN                                  0994
         LTR   TESTRC,TESTRC                                       0994
         BZ    @RF00994                                            0994
*                 RETURN CODE(LASTCC12);                           0995
*                                                                  0995
         LA    @15,12                                              0995
         L     @14,@SA00009                                        0995
         LM    @00,@12,@SA00009+8                                  0995
         BR    @14                                                 0995
*               /*****************************************************/
*               /*                                                   */
*               /* IF IDCRDPT IS SUCCESSFUL, UPDATE THE RECORD       */
*               /* ADDRESS AND UPDATE THE RECORDS PROCESSED COUNTER  */
*               /*                                                   */
*               /*****************************************************/
*                                                                  0996
*               ELSE                                               0996
*                 DO;                                              0996
@RF00994 DS    0H                                                  0997
*                   RDRECNUM=RDRECNUM+1;                           0997
         L     @06,@PC00001+8                                      0997
         L     @05,REPIDSAR(,@06)                                  0997
         LA    @15,1                                               0997
         SLR   @14,@14                                             0997
         IC    @14,RDRECNUM(,@05)                                  0997
         ALR   @14,@15                                             0997
         STC   @14,RDRECNUM(,@05)                                  0997
*                   REPRCDCT=REPRCDCT+1;                           0998
         AL    @15,REPRCDCT(,@06)                                  0998
         ST    @15,REPRCDCT(,@06)                                  0998
*                 END;                                             0999
*             END;                                                 1000
*           ELSE                                                   1001
*                                                                  1001
*             /*******************************************************/
*             /*                                                     */
*             /* PROCESSING TERMINATES FOR THE FOLLOWING RETURN CODES*/
*             /* - DETERMINE IF RECORD IS TO BE DISPLAYED            */
*             /*                                                     */
*             /*******************************************************/
*                                                                  1001
*             IF(REPRC>RC15&REPRC<RC19)×(REPRC>RC19&REPRC<RC29)×REPRC=
*                 RC31×REPRC=RC32×REPRC=RC33 THEN                  1001
         B     @RC00959                                            1001
@RF00959 L     @06,@PC00001+8                                      1001
         LH    @06,REPRC(,@06)                                     1001
         N     @06,@CF03487                                        1001
         CH    @06,RC15                                            1001
         BNH   @GL00022                                            1001
         CH    @06,RC19                                            1001
         BL    @RT01001                                            1001
@GL00022 L     @06,@PC00001+8                                      1001
         LH    @06,REPRC(,@06)                                     1001
         N     @06,@CF03487                                        1001
         CH    @06,RC19                                            1001
         BNH   @GL00021                                            1001
         CH    @06,RC29                                            1001
         BL    @RT01001                                            1001
@GL00021 L     @06,@PC00001+8                                      1001
         LH    @06,REPRC(,@06)                                     1001
         N     @06,@CF03487                                        1001
         CH    @06,RC31                                            1001
         BE    @RT01001                                            1001
         CH    @06,RC32                                            1001
         BE    @RT01001                                            1001
         CH    @06,RC33                                            1001
         BNE   @RF01001                                            1001
@RT01001 DS    0H                                                  1002
*               DO;                                                1002
*                                                                  1002
*                 /***************************************************/
*                 /*                                                 */
*                 /* DISPLAY THE RECORD FOR THE FOLLOWING SUBSET OF  */
*                 /* TERMINATING RETURN CODES                        */
*                 /*                                                 */
*                 /***************************************************/
*                                                                  1003
*                 IF(REPRC=RC16)×(REPRC=RC20)×(REPRC=RC21) THEN    1003
         L     @06,@PC00001+8                                      1003
         LH    @06,REPRC(,@06)                                     1003
         N     @06,@CF03487                                        1003
         CH    @06,RC16                                            1003
         BE    @RT01003                                            1003
         CH    @06,RC20                                            1003
         BE    @RT01003                                            1003
         CH    @06,RC21                                            1003
         BNE   @RF01003                                            1003
@RT01003 DS    0H                                                  1004
*                   DO;                                            1004
*                                                                  1004
*                     /***********************************************/
*                     /*                                             */
*                     /* DETERMINE RECORD ORIGIN AND BUILD SRPRTARG  */
*                     /* IN COMMUNICATIONS AREA                      */
*                     /*                                             */
*                     /***********************************************/
*                                                                  1005
*                     IF ADDR(DPVTC)^=NULLPTR THEN                 1005
         L     @06,@PC00001+4                                      1005
         L     @06,FDTPTR+116(,@06)                                1005
         LTR   @06,@06                                             1005
         BZ    @RF01005                                            1005
*                       DO;                                        1006
*                                                                  1006
*                         /*******************************************/
*                         /*                                         */
*                         /* BUILD SRPRTARG FOR VTOCHEADER           */
*                         /*                                         */
*                         /*******************************************/
*                                                                  1007
*                         SRPRTARG=''B;                            1007
         L     @06,@PC00001+8                                      1007
         L     @15,REPSPRIT(,@06)                                  1007
         XC    SRPRTARG(44,@15),SRPRTARG(@15)                      1007
*                         SRVOLPTR=ADDR(XTNHVOL);                  1008
         L     @01,REPIXTNT(,@06)                                  1008
         LA    @14,XTNHVOL(,@01)                                   1008
         ST    @14,SRVOLPTR(,@15)                                  1008
*                         SRERCODE=ADDR(REPRC);                    1009
         LA    @14,REPRC(,@06)                                     1009
         ST    @14,SRERCODE(,@15)                                  1009
*                         SRDSNPTR=ADDR(VTOCHDR);                  1010
         LA    @14,VTOCHDR                                         1010
         ST    @14,SRDSNPTR(,@15)                                  1010
*                         SRRECPTR=ADDR(RBUF);                     1011
         L     @06,REPIDSAR(,@06)                                  1011
         L     @06,RDDARE(,@06)                                    1011
         ST    @06,SRRECPTR(,@15)                                  1011
*                       END;                                       1012
*                                                                  1012
*                     /***********************************************/
*                     /*                                             */
*                     /* BUILD SRPRTARG FOR VTOC OR DATA SET         */
*                     /*                                             */
*                     /***********************************************/
*                                                                  1013
*                     IF ADDR(DSRNG)^=NULLPTR THEN                 1013
@RF01005 L     @06,@PC00001+4                                      1013
         L     @06,FDTPTR+24(,@06)                                 1013
         LTR   @06,@06                                             1013
         BZ    @RF01013                                            1013
*                       DO;                                        1014
*                         SRPRTARG=''B;                            1015
         L     @06,@PC00001+8                                      1015
         L     @15,REPSPRIT(,@06)                                  1015
         XC    SRPRTARG(44,@15),SRPRTARG(@15)                      1015
*                         SRVOLPTR=ADDR(XTNHVOL);                  1016
         L     @14,REPIXTNT(,@06)                                  1016
         LA    @05,XTNHVOL(,@14)                                   1016
         ST    @05,SRVOLPTR(,@15)                                  1016
*                         SRERCODE=ADDR(REPRC);                    1017
         LA    @06,REPRC(,@06)                                     1017
         ST    @06,SRERCODE(,@15)                                  1017
*                         IF XTNHDSN=FMT4DSN THEN                  1018
         CLC   XTNHDSN(44,@14),FMT4DSN                             1018
         BNE   @RF01018                                            1018
*                           SRDSNPTR=ADDR(FMT4DSCB);               1019
         LA    @06,FMT4DSCB                                        1019
         ST    @06,SRDSNPTR(,@15)                                  1019
*                         ELSE                                     1020
*                           SRDSNPTR=ADDR(XTNHDSN);                1020
         B     @RC01018                                            1020
@RF01018 L     @06,@PC00001+8                                      1020
         L     @01,REPSPRIT(,@06)                                  1020
         L     @06,REPIXTNT(,@06)                                  1020
         LA    @06,XTNHDSN(,@06)                                   1020
         ST    @06,SRDSNPTR(,@01)                                  1020
*                         SRRECPTR=ADDR(RBUF);                     1021
@RC01018 L     @06,@PC00001+8                                      1021
         L     @01,REPSPRIT(,@06)                                  1021
         L     @06,REPIDSAR(,@06)                                  1021
         L     @06,RDDARE(,@06)                                    1021
         ST    @06,SRRECPTR(,@01)                                  1021
*                       END;                                       1022
*                                                                  1022
*                     /***********************************************/
*                     /*                                             */
*                     /* BUILD SRPRTARG FOR STAGING PACK             */
*                     /*                                             */
*                     /***********************************************/
*                                                                  1023
*                     IF ADDR(STAGR)^=NULLPTR THEN                 1023
@RF01013 L     @06,@PC00001+4                                      1023
         L     @06,FDTPTR+32(,@06)                                 1023
         LTR   @06,@06                                             1023
         BZ    @RF01023                                            1023
*                       DO;                                        1024
*                         SRPRTARG=''B;                            1025
         L     @06,@PC00001+8                                      1025
         L     @15,REPSPRIT(,@06)                                  1025
         XC    SRPRTARG(44,@15),SRPRTARG(@15)                      1025
*                         SRVOLPTR=ADDR(XTNHVOL);                  1026
         L     @01,REPIXTNT(,@06)                                  1026
         LA    @14,XTNHVOL(,@01)                                   1026
         ST    @14,SRVOLPTR(,@15)                                  1026
*                         SRERCODE=ADDR(REPRC);                    1027
         LA    @14,REPRC(,@06)                                     1027
         ST    @14,SRERCODE(,@15)                                  1027
*                         SRCCHHRP=ADDR(RBUF);                     1028
         L     @06,REPIDSAR(,@06)                                  1028
         L     @06,RDDARE(,@06)                                    1028
         ST    @06,SRCCHHRP(,@15)                                  1028
*                         SRRECPTR=ADDR(RBUF);                     1029
         ST    @06,SRRECPTR(,@15)                                  1029
*                         SRSPRECL=RBKL+RBDL;                      1030
         SLR   @14,@14                                             1030
         IC    @14,RBKL(,@06)                                      1030
         AH    @14,RBDL(,@06)                                      1030
         ST    @14,SRSPRECL(,@15)                                  1030
*                       END;                                       1031
*                                                                  1031
*                     /***********************************************/
*                     /*                                             */
*                     /* CALL IDCRDPT TO DISPLAY THE RECORD          */
*                     /*                                             */
*                     /***********************************************/
*                                                                  1032
*                     CALL IDCRDPT;                                1032
*                                                                  1032
@RF01023 BAL   @14,IDCRDPT                                         1032
*                     /***********************************************/
*                     /*                                             */
*                     /* SAVE RETURN CODE FROM IDCRDPT               */
*                     /*                                             */
*                     /***********************************************/
*                                                                  1033
*                     RESPECIFY                                    1033
*                       RTNREG RSTD;                               1033
*                     TESTRC=RTNREG;                               1034
         LR    TESTRC,RTNREG                                       1034
*                     RESPECIFY                                    1035
*                       RTNREG UNRSTD;                             1035
*                                                                  1035
*                     /***********************************************/
*                     /*                                             */
*                     /* IF IDCRDPT IS SUCCESSFUL, UPDATE RECORDS    */
*                     /* PROCESSED COUNTER                           */
*                     /*                                             */
*                     /***********************************************/
*                                                                  1036
*                     IF TESTRC=0 THEN                             1036
         LTR   TESTRC,TESTRC                                       1036
         BNZ   @RF01036                                            1036
*                       REPRCDCT=REPRCDCT+1;                       1037
*                                                                  1037
         L     @06,@PC00001+8                                      1037
         LA    @15,1                                               1037
         AL    @15,REPRCDCT(,@06)                                  1037
         ST    @15,REPRCDCT(,@06)                                  1037
*                     /***********************************************/
*                     /*                                             */
*                     /* RETURN TO THE CALLER WITH RC = 12           */
*                     /*                                             */
*                     /***********************************************/
*                                                                  1038
*                     RETURN CODE(LASTCC12);                       1038
@RF01036 LA    @15,12                                              1038
         L     @14,@SA00009                                        1038
         LM    @00,@12,@SA00009+8                                  1038
         BR    @14                                                 1038
*                   END;                                           1039
*                                                                  1039
*                 /***************************************************/
*                 /*                                                 */
*                 /* FOR TERMINATING RETURN CODES OTHER THAN 16, 20, */
*                 /* AND 21, RETURN TO THE CALLER WITH RC = 12       */
*                 /*                                                 */
*                 /***************************************************/
*                                                                  1040
*                 ELSE                                             1040
*                   RETURN CODE(LASTCC12);                         1040
@RF01003 LA    @15,12                                              1040
         L     @14,@SA00009                                        1040
         LM    @00,@12,@SA00009+8                                  1040
         BR    @14                                                 1040
*               END;                                               1041
*       END;                                                       1042
@RF01001 DS    0H                                                  1042
@RC00959 DS    0H                                                  1042
@RC00957 DS    0H                                                  1043
*                                                                  1043
*     /***************************************************************/
*     /*                                                             */
*     /* COPY FUNCTION PROCESSING                                    */
*     /*                                                             */
*     /***************************************************************/
*                                                                  1043
*     IF ADDR(COPY)^=NULLPTR THEN                                  1043
@RF00955 L     @06,@PC00001+4                                      1043
         L     @06,FDTPTR+136(,@06)                                1043
         LTR   @06,@06                                             1043
         BZ    @RF01043                                            1043
*       DO;                                                        1044
*                                                                  1044
*         /***********************************************************/
*         /*                                                         */
*         /* PROCESSING CONTINUES FOR THE FOLLOWING RETURN CODES     */
*         /*                                                         */
*         /***********************************************************/
*                                                                  1045
*         IF(REPRC<RC16)×(REPRC=RC19) THEN                         1045
         L     @06,@PC00001+8                                      1045
         LH    @06,REPRC(,@06)                                     1045
         N     @06,@CF03487                                        1045
         CH    @06,RC16                                            1045
         BL    @RT01045                                            1045
         CH    @06,RC19                                            1045
         BNE   @RF01045                                            1045
@RT01045 DS    0H                                                  1046
*           DO;                                                    1046
*                                                                  1046
*             /*******************************************************/
*             /*                                                     */
*             /* CONSTRUCT OUTPUT RECORD TO REPAIR WORKFILE CONSTRUCT*/
*             /* RECORD KEY AND FLAGS                                */
*             /*                                                     */
*             /*******************************************************/
*                                                                  1047
*             RKEY=''B;                                            1047
         L     @06,@PC00001+8                                      1047
         L     @05,REPIDSAR(,@06)                                  1047
         L     @15,RDDARE(,@05)                                    1047
         SL    @15,@CF00474                                        1047
         XC    RKEY(16,@15),RKEY(@15)                              1047
*             RKEYVOL=XTNTVOL(I);                                  1048
         SLR   @14,@14                                             1048
         IC    @14,I(,@06)                                         1048
         MH    @14,@CH02987                                        1048
         L     @01,REPIXTNT(,@06)                                  1048
         ALR   @01,@14                                             1048
         MVC   RKEYVOL(6,@15),XTNTVOL-78(@01)                      1048
*             RKEYCHR=RDCHR;                                       1049
         MVC   RKEYCHR(5,@15),RDCHR(@05)                           1049
*             RKEYFLG2=REPRC;                                      1050
*                                                                  1050
         LH    @06,REPRC(,@06)                                     1050
         N     @06,@CF03487                                        1050
         STH   @06,RKEYFLG2(,@15)                                  1050
*             /*******************************************************/
*             /*                                                     */
*             /* GET LENGTH OF RECORD                                */
*             /*                                                     */
*             /*******************************************************/
*                                                                  1051
*             IF ADDR(CVTOC)^=NULLPTR×ADDR(CDSRG)^=NULLPTR THEN    1051
         SLR   @06,@06                                             1051
         L     @05,@PC00001+4                                      1051
         C     @06,FDTPTR+204(,@05)                                1051
         BNE   @RT01051                                            1051
         C     @06,FDTPTR+152(,@05)                                1051
         BE    @RF01051                                            1051
@RT01051 DS    0H                                                  1052
*               WFIODLN=LENGTH(RKEY)+COUNTLEN+RBKL+RBDL;           1052
         L     @06,@PC00001+8                                      1052
         LA    @05,16                                              1052
         AH    @05,COUNTLEN                                        1052
         L     @01,REPIDSAR(,@06)                                  1052
         L     @15,RDDARE(,@01)                                    1052
         SLR   @14,@14                                             1052
         IC    @14,RBKL(,@15)                                      1052
         ALR   @05,@14                                             1052
         AH    @05,RBDL(,@15)                                      1052
         ST    @05,WFIODLN(,@06)                                   1052
*             ELSE                                                 1053
*               IF ADDR(CSRNG)^=NULLPTR&REPRC=RC01 THEN            1053
         B     @RC01051                                            1053
@RF01051 L     @06,@PC00001+4                                      1053
         L     @06,FDTPTR+148(,@06)                                1053
         LTR   @06,@06                                             1053
         BZ    @RF01053                                            1053
         L     @06,@PC00001+8                                      1053
         LH    @05,REPRC(,@06)                                     1053
         N     @05,@CF03487                                        1053
         CH    @05,RC01                                            1053
         BNE   @RF01053                                            1053
*                 WFIODLN=LENGTH(RKEY)+COUNTLEN+RBKL+RBDL;         1054
         LA    @05,16                                              1054
         AH    @05,COUNTLEN                                        1054
         L     @01,REPIDSAR(,@06)                                  1054
         L     @15,RDDARE(,@01)                                    1054
         SLR   @14,@14                                             1054
         IC    @14,RBKL(,@15)                                      1054
         ALR   @05,@14                                             1054
         AH    @05,RBDL(,@15)                                      1054
         ST    @05,WFIODLN(,@06)                                   1054
*               ELSE                                               1055
*                 DO;                                              1055
         B     @RC01053                                            1055
@RF01053 DS    0H                                                  1056
*                   WFIODLN=LENGTH(RKEY)+COUNTLEN+RDSPKL+RDSPDL;   1056
*                                                                  1056
         L     @06,@PC00001+8                                      1056
         LA    @05,16                                              1056
         AH    @05,COUNTLEN                                        1056
         L     @15,REPIDSAR(,@06)                                  1056
         SLR   @14,@14                                             1056
         IC    @14,RDSPKL(,@15)                                    1056
         ALR   @05,@14                                             1056
         LH    @03,RDSPDL(,@15)                                    1056
         ALR   @05,@03                                             1056
         ST    @05,WFIODLN(,@06)                                   1056
*                   /*************************************************/
*                   /*                                               */
*                   /* CONSTRUCT COUNT BASED ON LENGTH PARAM         */
*                   /*                                               */
*                   /*************************************************/
*                                                                  1057
*                   RBCCHHR=RDCHR;                                 1057
         L     @06,RDDARE(,@15)                                    1057
         MVC   RBCCHHR(5,@06),RDCHR(@15)                           1057
*                   RBKL=RDSPKL;                                   1058
         STC   @14,RBKL(,@06)                                      1058
*                   RBDL=RDSPDL;                                   1059
         STH   @03,RBDL(,@06)                                      1059
*                 END;                                             1060
*                                                                  1060
*             /*******************************************************/
*             /*                                                     */
*             /* GET RECORD ADDRESS                                  */
*             /*                                                     */
*             /*******************************************************/
*                                                                  1061
*             WFIODAD=ADDR(RKEY);                                  1061
*                                                                  1061
@RC01053 DS    0H                                                  1061
@RC01051 L     @06,@PC00001+8                                      1061
         L     @05,REPIDSAR(,@06)                                  1061
         L     @05,RDDARE(,@05)                                    1061
         SL    @05,@CF00474                                        1061
         ST    @05,WFIODAD(,@06)                                   1061
*             /*******************************************************/
*             /*                                                     */
*             /* WRITE THE RECORD TO THE REPAIR WORKFILE             */
*             /*                                                     */
*             /*******************************************************/
*                                                                  1062
*             DO;                                                  1062
*               WFREQ=''B;                                         1063
         XC    WFREQ(2,@06),WFREQ(@06)                             1063
*               WFRLD=ON;           /* LOADRCD                       */
         OI    WFRLD(@06),B'01000000'                              1064
*               CALL IDCRDIO;                                      1065
         BAL   @14,IDCRDIO                                         1065
*               RFY                                                1066
*                 RTNREG RSTD;                                     1066
*               TESTRC=RTNREG;                                     1067
         LR    TESTRC,RTNREG                                       1067
*               RFY                                                1068
*                 RTNREG UNRSTD;                                   1068
*             END;                                                 1069
*                                                                  1069
*             /*******************************************************/
*             /*                                                     */
*             /* SAVE RETURN CODE FROM LOADRCD                       */
*             /*                                                     */
*             /*******************************************************/
*                                                                  1070
*             RESPECIFY                                            1070
*               RTNREG RSTD;                                       1070
*             TESTRC=RTNREG;                                       1071
         LR    TESTRC,RTNREG                                       1071
*             RESPECIFY                                            1072
*               RTNREG UNRSTD;                                     1072
*                                                                  1072
*             /*******************************************************/
*             /*                                                     */
*             /* IF LOADRCD FAILS RETURN TO CALLER WITH RC = 12      */
*             /*                                                     */
*             /*******************************************************/
*                                                                  1073
*             IF TESTRC^=0 THEN                                    1073
         LTR   TESTRC,TESTRC                                       1073
         BZ    @RF01073                                            1073
*               RETURN CODE(LASTCC12);                             1074
*                                                                  1074
         LA    @15,12                                              1074
         L     @14,@SA00009                                        1074
         LM    @00,@12,@SA00009+8                                  1074
         BR    @14                                                 1074
*             /*******************************************************/
*             /*                                                     */
*             /* IF LOADRCD IS SUCCESSFUL, UPDATE RECORD ADDRESS AND */
*             /* UPDATE RECORDS PROCESSED COUNTER                    */
*             /*                                                     */
*             /*******************************************************/
*                                                                  1075
*             ELSE                                                 1075
*               DO;                                                1075
@RF01073 DS    0H                                                  1076
*                 RDRECNUM=RDRECNUM+1;                             1076
         L     @06,@PC00001+8                                      1076
         L     @05,REPIDSAR(,@06)                                  1076
         LA    @15,1                                               1076
         SLR   @14,@14                                             1076
         IC    @14,RDRECNUM(,@05)                                  1076
         ALR   @14,@15                                             1076
         STC   @14,RDRECNUM(,@05)                                  1076
*                 REPRCDCT=REPRCDCT+1;                             1077
         AL    @15,REPRCDCT(,@06)                                  1077
         ST    @15,REPRCDCT(,@06)                                  1077
*               END;                                               1078
*           END;                                                   1079
*         ELSE                                                     1080
*                                                                  1080
*           /*********************************************************/
*           /*                                                       */
*           /* PROCESSING TERMINATES FOR THE FOLLOWING RETURN CODES  */
*           /*                                                       */
*           /*********************************************************/
*                                                                  1080
*           IF(REPRC>RC15&REPRC<RC19)×(REPRC>RC19&REPRC<RC29)×REPRC=
*               RC31×REPRC=RC32×REPRC=RC33 THEN                    1080
         B     @RC01045                                            1080
@RF01045 L     @06,@PC00001+8                                      1080
         LH    @06,REPRC(,@06)                                     1080
         N     @06,@CF03487                                        1080
         CH    @06,RC15                                            1080
         BNH   @GL00033                                            1080
         CH    @06,RC19                                            1080
         BL    @RT01080                                            1080
@GL00033 L     @06,@PC00001+8                                      1080
         LH    @06,REPRC(,@06)                                     1080
         N     @06,@CF03487                                        1080
         CH    @06,RC19                                            1080
         BNH   @GL00032                                            1080
         CH    @06,RC29                                            1080
         BL    @RT01080                                            1080
@GL00032 L     @06,@PC00001+8                                      1080
         LH    @06,REPRC(,@06)                                     1080
         N     @06,@CF03487                                        1080
         CH    @06,RC31                                            1080
         BE    @RT01080                                            1080
         CH    @06,RC32                                            1080
         BE    @RT01080                                            1080
         CH    @06,RC33                                            1080
         BNE   @RF01080                                            1080
@RT01080 DS    0H                                                  1081
*             DO;                                                  1081
*                                                                  1081
*               /*****************************************************/
*               /*                                                   */
*               /* COPY THE RECORD FOR THE FOLLOWING SUBSET OF       */
*               /* TERMINATING RETURN CODES                          */
*               /*                                                   */
*               /*****************************************************/
*                                                                  1082
*               IF(REPRC=RC16)×(REPRC=RC20)×(REPRC=RC21) THEN      1082
         L     @06,@PC00001+8                                      1082
         LH    @06,REPRC(,@06)                                     1082
         N     @06,@CF03487                                        1082
         CH    @06,RC16                                            1082
         BE    @RT01082                                            1082
         CH    @06,RC20                                            1082
         BE    @RT01082                                            1082
         CH    @06,RC21                                            1082
         BNE   @RF01082                                            1082
@RT01082 DS    0H                                                  1083
*                 DO;                                              1083
*                                                                  1083
*                   /*************************************************/
*                   /*                                               */
*                   /* CONSTRUCT OUTPUT RECORD FOR THE REPAIR        */
*                   /* WORKFILE CONSTRUCT RECORD KEY AND FLAGS       */
*                   /*                                               */
*                   /*************************************************/
*                                                                  1084
*                   RKEY=''B;                                      1084
         L     @06,@PC00001+8                                      1084
         L     @05,REPIDSAR(,@06)                                  1084
         L     @15,RDDARE(,@05)                                    1084
         SL    @15,@CF00474                                        1084
         XC    RKEY(16,@15),RKEY(@15)                              1084
*                   RKEYVOL=XTNTVOL(I);                            1085
         SLR   @14,@14                                             1085
         IC    @14,I(,@06)                                         1085
         MH    @14,@CH02987                                        1085
         L     @01,REPIXTNT(,@06)                                  1085
         ALR   @01,@14                                             1085
         MVC   RKEYVOL(6,@15),XTNTVOL-78(@01)                      1085
*                   RKEYCHR=RDCHR;                                 1086
         MVC   RKEYCHR(5,@15),RDCHR(@05)                           1086
*                   RKEYFLG2=REPRC;                                1087
*                                                                  1087
         LH    @06,REPRC(,@06)                                     1087
         N     @06,@CF03487                                        1087
         STH   @06,RKEYFLG2(,@15)                                  1087
*                   /*************************************************/
*                   /*                                               */
*                   /* GET LENGTH OF RECORD                          */
*                   /*                                               */
*                   /*************************************************/
*                                                                  1088
*                   IF ADDR(CVTOC)^=NULLPTR×ADDR(CDSRG)^=NULLPTR THEN
         SLR   @06,@06                                             1088
         L     @05,@PC00001+4                                      1088
         C     @06,FDTPTR+204(,@05)                                1088
         BNE   @RT01088                                            1088
         C     @06,FDTPTR+152(,@05)                                1088
         BE    @RF01088                                            1088
@RT01088 DS    0H                                                  1089
*                     WFIODLN=LENGTH(RKEY)+COUNTLEN+RBKL+RBDL;     1089
         L     @06,@PC00001+8                                      1089
         LA    @05,16                                              1089
         AH    @05,COUNTLEN                                        1089
         L     @01,REPIDSAR(,@06)                                  1089
         L     @15,RDDARE(,@01)                                    1089
         SLR   @14,@14                                             1089
         IC    @14,RBKL(,@15)                                      1089
         ALR   @05,@14                                             1089
         AH    @05,RBDL(,@15)                                      1089
         ST    @05,WFIODLN(,@06)                                   1089
*                   ELSE                                           1090
*                     IF ADDR(CSRNG)^=NULLPTR&REPRC=RC01 THEN      1090
         B     @RC01088                                            1090
@RF01088 L     @06,@PC00001+4                                      1090
         L     @06,FDTPTR+148(,@06)                                1090
         LTR   @06,@06                                             1090
         BZ    @RF01090                                            1090
         L     @06,@PC00001+8                                      1090
         LH    @05,REPRC(,@06)                                     1090
         N     @05,@CF03487                                        1090
         CH    @05,RC01                                            1090
         BNE   @RF01090                                            1090
*                       WFIODLN=LENGTH(RKEY)+COUNTLEN+RBKL+RBDL;   1091
         LA    @05,16                                              1091
         AH    @05,COUNTLEN                                        1091
         L     @01,REPIDSAR(,@06)                                  1091
         L     @15,RDDARE(,@01)                                    1091
         SLR   @14,@14                                             1091
         IC    @14,RBKL(,@15)                                      1091
         ALR   @05,@14                                             1091
         AH    @05,RBDL(,@15)                                      1091
         ST    @05,WFIODLN(,@06)                                   1091
*                     ELSE                                         1092
*                       WFIODLN=LENGTH(RKEY)+COUNTLEN+RDSPKL+RDSPDL;
*                                                                  1092
         B     @RC01090                                            1092
@RF01090 L     @06,@PC00001+8                                      1092
         LA    @05,16                                              1092
         AH    @05,COUNTLEN                                        1092
         L     @15,REPIDSAR(,@06)                                  1092
         SLR   @14,@14                                             1092
         IC    @14,RDSPKL(,@15)                                    1092
         ALR   @05,@14                                             1092
         AH    @05,RDSPDL(,@15)                                    1092
         ST    @05,WFIODLN(,@06)                                   1092
*                   /*************************************************/
*                   /*                                               */
*                   /* GET RECORD ADDRESS                            */
*                   /*                                               */
*                   /*************************************************/
*                                                                  1093
*                   WFIODAD=ADDR(RKEY);                            1093
*                                                                  1093
@RC01090 DS    0H                                                  1093
@RC01088 L     @06,@PC00001+8                                      1093
         L     @05,REPIDSAR(,@06)                                  1093
         L     @05,RDDARE(,@05)                                    1093
         SL    @05,@CF00474                                        1093
         ST    @05,WFIODAD(,@06)                                   1093
*                   /*************************************************/
*                   /*                                               */
*                   /* WRITE THE RECORD TO THE REPAIR WORKFILE       */
*                   /*                                               */
*                   /*************************************************/
*                                                                  1094
*                   DO;                                            1094
*                     WFREQ=''B;                                   1095
         XC    WFREQ(2,@06),WFREQ(@06)                             1095
*                     WFRLD=ON;     /* LOADRCD                       */
         OI    WFRLD(@06),B'01000000'                              1096
*                     CALL IDCRDIO;                                1097
         BAL   @14,IDCRDIO                                         1097
*                     RFY                                          1098
*                       RTNREG RSTD;                               1098
*                     TESTRC=RTNREG;                               1099
         LR    TESTRC,RTNREG                                       1099
*                     RFY                                          1100
*                       RTNREG UNRSTD;                             1100
*                   END;                                           1101
*                                                                  1101
*                   /*************************************************/
*                   /*                                               */
*                   /* SAVE RETURN CODE FROM LOADRCD                 */
*                   /*                                               */
*                   /*************************************************/
*                                                                  1102
*                   RESPECIFY                                      1102
*                     RTNREG RSTD;                                 1102
*                   TESTRC=RTNREG;                                 1103
         LR    TESTRC,RTNREG                                       1103
*                   RESPECIFY                                      1104
*                     RTNREG UNRSTD;                               1104
*                                                                  1104
*                   /*************************************************/
*                   /*                                               */
*                   /* IF LOADRCD IS SUCCESSFUL, UPDATE RECORDS      */
*                   /* PROCESSED COUNTER                             */
*                   /*                                               */
*                   /*************************************************/
*                                                                  1105
*                   IF TESTRC=0 THEN                               1105
         LTR   TESTRC,TESTRC                                       1105
         BNZ   @RF01105                                            1105
*                     REPRCDCT=REPRCDCT+1;                         1106
*                                                                  1106
         L     @06,@PC00001+8                                      1106
         LA    @15,1                                               1106
         AL    @15,REPRCDCT(,@06)                                  1106
         ST    @15,REPRCDCT(,@06)                                  1106
*                   /*************************************************/
*                   /*                                               */
*                   /* RETURN TO THE CALLER WITH RC = 12             */
*                   /*                                               */
*                   /*************************************************/
*                                                                  1107
*                   RETURN CODE(LASTCC12);                         1107
@RF01105 LA    @15,12                                              1107
         L     @14,@SA00009                                        1107
         LM    @00,@12,@SA00009+8                                  1107
         BR    @14                                                 1107
*                 END;                                             1108
*                                                                  1108
*               /*****************************************************/
*               /*                                                   */
*               /* FOR TERMINATING RETURN CODES OTHER THAN 16, 20,   */
*               /* AND 21, RETURN TO THE CALLER WITH RC = 12         */
*               /*                                                   */
*               /*****************************************************/
*                                                                  1109
*               ELSE                                               1109
*                 RETURN CODE(LASTCC12);                           1109
@RF01082 LA    @15,12                                              1109
         L     @14,@SA00009                                        1109
         LM    @00,@12,@SA00009+8                                  1109
         BR    @14                                                 1109
*             END;                                                 1110
*       END;                                                       1111
@RF01080 DS    0H                                                  1111
@RC01045 DS    0H                                                  1112
*                                                                  1112
*     /***************************************************************/
*     /*                                                             */
*     /* END OF FILE PROCESSING                                      */
*     /*                                                             */
*     /***************************************************************/
*                                                                  1112
*     IF REPRC=RC29 THEN                                           1112
@RF01043 L     @06,@PC00001+8                                      1112
         LH    @06,REPRC(,@06)                                     1112
         N     @06,@CF03487                                        1112
         CH    @06,RC29                                            1112
         BNE   @RF01112                                            1112
*       DO;                                                        1113
*                                                                  1113
*         /***********************************************************/
*         /*                                                         */
*         /* IF VTOCHEADER PROCESSING, RETURN TO THE CALLER WITH RC =*/
*         /* 00                                                      */
*         /*                                                         */
*         /***********************************************************/
*                                                                  1114
*         IF ADDR(DPVTC)^=NULLPTR×ADDR(CVTOC)^=NULLPTR THEN        1114
         SLR   @06,@06                                             1114
         L     @05,@PC00001+4                                      1114
         C     @06,FDTPTR+116(,@05)                                1114
         BNE   @RT01114                                            1114
         C     @06,FDTPTR+204(,@05)                                1114
         BE    @RF01114                                            1114
@RT01114 DS    0H                                                  1115
*           RETURN CODE(LASTCC00);                                 1115
*                                                                  1115
         SLR   @15,@15                                             1115
         L     @14,@SA00009                                        1115
         LM    @00,@12,@SA00009+8                                  1115
         BR    @14                                                 1115
*         /***********************************************************/
*         /*                                                         */
*         /* DISPLAY PROCESSING                                      */
*         /*                                                         */
*         /***********************************************************/
*                                                                  1116
*         IF ADDR(DISPL)^=NULLPTR THEN                             1116
@RF01114 SLR   @06,@06                                             1116
         L     @05,@PC00001+4                                      1116
         C     @06,FDTPTR(,@05)                                    1116
         BE    @RF01116                                            1116
*           DO;                                                    1117
*             IF ADDR(ALLA)=NULLPTR THEN                           1118
         C     @06,FDTPTR+8(,@05)                                  1118
         BNE   @RF01118                                            1118
*               RDRECNUM=RDRECNUM+1;                               1119
         L     @06,@PC00001+8                                      1119
         L     @06,REPIDSAR(,@06)                                  1119
         LA    @05,1                                               1119
         SLR   @15,@15                                             1119
         IC    @15,RDRECNUM(,@06)                                  1119
         ALR   @05,@15                                             1119
         STC   @05,RDRECNUM(,@06)                                  1119
*             ELSE                                                 1120
*               DO;                                                1120
*                                                                  1120
         B     @RC01118                                            1120
@RF01118 DS    0H                                                  1121
*                 /***************************************************/
*                 /*                                                 */
*                 /* CONSTRUCT SRPRTARG TO PRINT EOF IDENTIFIER      */
*                 /*                                                 */
*                 /***************************************************/
*                                                                  1121
*                 SRPRTARG=''B;                                    1121
         L     @06,@PC00001+8                                      1121
         L     @05,REPSPRIT(,@06)                                  1121
         XC    SRPRTARG(44,@05),SRPRTARG(@05)                      1121
*                 SRVOLPTR=ADDR(XTNHVOL);                          1122
         L     @01,REPIXTNT(,@06)                                  1122
         LA    @15,XTNHVOL(,@01)                                   1122
         ST    @15,SRVOLPTR(,@05)                                  1122
*                 SRERCODE=ADDR(REPRC);                            1123
         LA    @15,REPRC(,@06)                                     1123
         ST    @15,SRERCODE(,@05)                                  1123
*                 RKEYDAT(1:LENGTH(EOFIDENT))=EOFIDENT;            1124
         L     @06,REPIDSAR(,@06)                                  1124
         L     @06,RDDARE(,@06)                                    1124
         MVC   RKEYDAT(9,@06),EOFIDENT                             1124
*                 SRRECPTR=ADDR(RBUF);                             1125
         ST    @06,SRRECPTR(,@05)                                  1125
*                 IF ADDR(STAGR)^=NULLPTR THEN                     1126
         L     @15,@PC00001+4                                      1126
         L     @15,FDTPTR+32(,@15)                                 1126
         LTR   @15,@15                                             1126
         BZ    @RF01126                                            1126
*                   SRCCHHRP=ADDR(RBUF);                           1127
         ST    @06,SRCCHHRP(,@05)                                  1127
*                 IF ADDR(DSRNG)^=NULLPTR THEN                     1128
@RF01126 L     @06,@PC00001+4                                      1128
         L     @06,FDTPTR+24(,@06)                                 1128
         LTR   @06,@06                                             1128
         BZ    @RF01128                                            1128
*                   DO;                                            1129
*                     IF XTNHDSN=FMT4DSN THEN                      1130
         L     @06,@PC00001+8                                      1130
         L     @05,REPIXTNT(,@06)                                  1130
         CLC   XTNHDSN(44,@05),FMT4DSN                             1130
         BNE   @RF01130                                            1130
*                       SRDSNPTR=ADDR(FMT4DSCB);                   1131
         L     @06,REPSPRIT(,@06)                                  1131
         LA    @05,FMT4DSCB                                        1131
         ST    @05,SRDSNPTR(,@06)                                  1131
*                     ELSE                                         1132
*                       SRDSNPTR=ADDR(XTNHDSN);                    1132
         B     @RC01130                                            1132
@RF01130 L     @06,@PC00001+8                                      1132
         L     @05,REPSPRIT(,@06)                                  1132
         L     @06,REPIXTNT(,@06)                                  1132
         LA    @06,XTNHDSN(,@06)                                   1132
         ST    @06,SRDSNPTR(,@05)                                  1132
*                   END;                                           1133
*                                                                  1133
@RC01130 DS    0H                                                  1134
*                 /***************************************************/
*                 /*                                                 */
*                 /* CALL IDCRDPT TO PRINT END OF FILE IDENTIFIER    */
*                 /*                                                 */
*                 /***************************************************/
*                                                                  1134
*                 CALL IDCRDPT;                                    1134
*                                                                  1134
@RF01128 BAL   @14,IDCRDPT                                         1134
*                 /***************************************************/
*                 /*                                                 */
*                 /* SAVE RETURN CODE FROM IDCRDPT                   */
*                 /*                                                 */
*                 /***************************************************/
*                                                                  1135
*                 RESPECIFY                                        1135
*                   RTNREG RSTD;                                   1135
*                 TESTRC=RTNREG;                                   1136
         LR    TESTRC,RTNREG                                       1136
*                 RESPECIFY                                        1137
*                   RTNREG UNRSTD;                                 1137
*                                                                  1137
*                 /***************************************************/
*                 /*                                                 */
*                 /* IF IDCRDPT FAILS, RETURN TO THE CALLER WITH RC =*/
*                 /* 12                                              */
*                 /*                                                 */
*                 /***************************************************/
*                                                                  1138
*                 IF TESTRC^=0 THEN                                1138
         LTR   TESTRC,TESTRC                                       1138
         BZ    @RF01138                                            1138
*                   RETURN CODE(LASTCC12);                         1139
*                                                                  1139
         LA    @15,12                                              1139
         L     @14,@SA00009                                        1139
         LM    @00,@12,@SA00009+8                                  1139
         BR    @14                                                 1139
*                 /***************************************************/
*                 /*                                                 */
*                 /* IF IDCRDPT IS SUCCESSFUL, UPDATE THE RECORD     */
*                 /* ADDRESS AND THE RECORDS PROCESSED COUNTER       */
*                 /*                                                 */
*                 /***************************************************/
*                                                                  1140
*                 RDRECNUM=RDRECNUM+1;                             1140
@RF01138 L     @06,@PC00001+8                                      1140
         L     @05,REPIDSAR(,@06)                                  1140
         LA    @15,1                                               1140
         SLR   @14,@14                                             1140
         IC    @14,RDRECNUM(,@05)                                  1140
         ALR   @14,@15                                             1140
         STC   @14,RDRECNUM(,@05)                                  1140
*                 REPRCDCT=REPRCDCT+1;                             1141
         AL    @15,REPRCDCT(,@06)                                  1141
         ST    @15,REPRCDCT(,@06)                                  1141
*               END;                                               1142
*           END;                                                   1143
*                                                                  1143
@RC01118 DS    0H                                                  1144
*         /***********************************************************/
*         /*                                                         */
*         /* COPY PROCESSING                                         */
*         /*                                                         */
*         /***********************************************************/
*                                                                  1144
*         IF ADDR(COPY)^=NULLPTR THEN                              1144
@RF01116 SLR   @06,@06                                             1144
         L     @05,@PC00001+4                                      1144
         C     @06,FDTPTR+136(,@05)                                1144
         BE    @RF01144                                            1144
*           DO;                                                    1145
*                                                                  1145
*             /*******************************************************/
*             /*                                                     */
*             /* IF ALL RECORDS HAVE NOT BEEN COPIED, ISSUE MESSAGE  */
*             /* IDC01215I AND RETURN WITH RC = 00                   */
*             /*                                                     */
*             /*******************************************************/
*                                                                  1146
*             IF XTNHCHR2>=RDCHR THEN                              1146
         L     @04,@PC00001+8                                      1146
         L     @01,REPIXTNT(,@04)                                  1146
         L     @15,REPIDSAR(,@04)                                  1146
         CLC   XTNHCHR2(5,@01),RDCHR(@15)                          1146
         BL    @RF01146                                            1146
*               DO;                                                1147
*                                                                  1147
*                 /***************************************************/
*                 /*                                                 */
*                 /* ISSUE MESSAGE IDC01215I FOR STAGING PACK        */
*                 /*                                                 */
*                 /***************************************************/
*                                                                  1148
*                 IF ADDR(CSRNG)^=NULLPTR THEN                     1148
         C     @06,FDTPTR+148(,@05)                                1148
         BE    @RF01148                                            1148
*                   DO;                                            1149
*                     CKREQ=CKREQ&&CKREQ;                          1150
         XC    CKREQ(44,@04),CKREQ(@04)                            1150
*                     CKRERN=MSG15;                                1151
         LH    @06,MSG15                                           1151
         STH   @06,CKRERN(,@04)                                    1151
*                     CKRMVAR(1)=ADDR(STNGPK);                     1152
         LA    @06,STNGPK                                          1152
         ST    @06,CKRMVAR(,@04)                                   1152
*                     CALL IDCRDER;                                1153
         BAL   @14,IDCRDER                                         1153
*                   END;                                           1154
*                                                                  1154
*                 /***************************************************/
*                 /*                                                 */
*                 /* ISSUE MESSAGE IDC01215I FOR VTOC                */
*                 /*                                                 */
*                 /***************************************************/
*                                                                  1155
*                 IF XTNHDSN=FMT4DSN THEN                          1155
@RF01148 L     @06,@PC00001+8                                      1155
         L     @01,REPIXTNT(,@06)                                  1155
         CLC   XTNHDSN(44,@01),FMT4DSN                             1155
         BNE   @RF01155                                            1155
*                   DO;                                            1156
*                     CKREQ=CKREQ&&CKREQ;                          1157
         XC    CKREQ(44,@06),CKREQ(@06)                            1157
*                     CKRERN=MSG15;                                1158
         LH    @15,MSG15                                           1158
         STH   @15,CKRERN(,@06)                                    1158
*                     CKRMVAR(1)=ADDR(FMT4DSCB);                   1159
         LA    @15,FMT4DSCB                                        1159
         ST    @15,CKRMVAR(,@06)                                   1159
*                     CALL IDCRDER;                                1160
         BAL   @14,IDCRDER                                         1160
*                   END;                                           1161
*                                                                  1161
*                 /***************************************************/
*                 /*                                                 */
*                 /* ISSUE MESSAGE IDC01215I FOR DATA SET            */
*                 /*                                                 */
*                 /***************************************************/
*                                                                  1162
*                 ELSE                                             1162
*                   DO;                                            1162
         B     @RC01155                                            1162
@RF01155 DS    0H                                                  1163
*                     CKREQ=CKREQ&&CKREQ;                          1163
         L     @06,@PC00001+8                                      1163
         XC    CKREQ(44,@06),CKREQ(@06)                            1163
*                     CKRERN=MSG15;                                1164
         LH    @15,MSG15                                           1164
         STH   @15,CKRERN(,@06)                                    1164
*                     CKRMVAR(1)=ADDR(XTNHDSN);                    1165
         L     @01,REPIXTNT(,@06)                                  1165
         LA    @15,XTNHDSN(,@01)                                   1165
         ST    @15,CKRMVAR(,@06)                                   1165
*                     CALL IDCRDER;                                1166
         BAL   @14,IDCRDER                                         1166
*                   END;                                           1167
*               END;                                               1168
*                                                                  1168
@RC01155 DS    0H                                                  1169
*             /*******************************************************/
*             /*                                                     */
*             /* RETURN TO THE CALLER WITH RC = 00                   */
*             /*                                                     */
*             /*******************************************************/
*                                                                  1169
*             RETURN CODE(LASTCC00);                               1169
@RF01146 SLR   @15,@15                                             1169
         L     @14,@SA00009                                        1169
         LM    @00,@12,@SA00009+8                                  1169
         BR    @14                                                 1169
*           END;                                                   1170
*       END;                                                       1171
@RF01144 DS    0H                                                  1172
*                                                                  1172
*     /***************************************************************/
*     /*                                                             */
*     /* END OF TRACK PROCESSING                                     */
*     /*                                                             */
*     /***************************************************************/
*                                                                  1172
*     IF REPRC=RC30 THEN                                           1172
@RF01112 L     @06,@PC00001+8                                      1172
         LH    @06,REPRC(,@06)                                     1172
         N     @06,@CF03487                                        1172
         CH    @06,RC30                                            1172
         BNE   @RF01172                                            1172
*       DO;                                                        1173
*                                                                  1173
*         /***********************************************************/
*         /*                                                         */
*         /* IF VTOCHEADER PROCESSING, RETURN TO THE CALLER WITH RC =*/
*         /* 00                                                      */
*         /*                                                         */
*         /***********************************************************/
*                                                                  1174
*         IF ADDR(DPVTC)^=NULLPTR×ADDR(CVTOC)^=NULLPTR THEN        1174
         SLR   @06,@06                                             1174
         L     @05,@PC00001+4                                      1174
         C     @06,FDTPTR+116(,@05)                                1174
         BNE   @RT01174                                            1174
         C     @06,FDTPTR+204(,@05)                                1174
         BE    @RF01174                                            1174
@RT01174 DS    0H                                                  1175
*           RETURN CODE(LASTCC00);                                 1175
*                                                                  1175
         SLR   @15,@15                                             1175
         L     @14,@SA00009                                        1175
         LM    @00,@12,@SA00009+8                                  1175
         BR    @14                                                 1175
*         /***********************************************************/
*         /*                                                         */
*         /* DETERMINE IF ALL RECORDS IN THE RANGE HAVE BEEN READ    */
*         /*                                                         */
*         /***********************************************************/
*                                                                  1176
*         IF RDCHR=XTNHCHR2 THEN                                   1176
@RF01174 L     @06,@PC00001+8                                      1176
         L     @05,REPIDSAR(,@06)                                  1176
         L     @06,REPIXTNT(,@06)                                  1176
         CLC   RDCHR(5,@05),XTNHCHR2(@06)                          1176
         BNE   @RF01176                                            1176
*           DO;                                                    1177
*                                                                  1177
*             /*******************************************************/
*             /*                                                     */
*             /* IF LAST RECORD IN THE RANGE WAS NOT READ, ISSUE     */
*             /* MESSAGE IDC01215I AND RETURN TO THE CALLER WITH RC =*/
*             /* 00 ISSUE MESSAGE IDC01215I FOR STAGING PACK         */
*             /*                                                     */
*             /*******************************************************/
*                                                                  1178
*             IF(ADDR(DISPL)^=NULLPTR&ADDR(STAGR)^=NULLPTR)×(ADDR(COPY)
*                 ^=NULLPTR&ADDR(CSRNG)^=NULLPTR) THEN             1178
         SLR   @06,@06                                             1178
         L     @15,@PC00001+4                                      1178
         C     @06,FDTPTR(,@15)                                    1178
         BE    @GL00042                                            1178
         C     @06,FDTPTR+32(,@15)                                 1178
         BNE   @RT01178                                            1178
@GL00042 SLR   @06,@06                                             1178
         L     @15,@PC00001+4                                      1178
         C     @06,FDTPTR+136(,@15)                                1178
         BE    @RF01178                                            1178
         C     @06,FDTPTR+148(,@15)                                1178
         BE    @RF01178                                            1178
@RT01178 DS    0H                                                  1179
*               DO;                                                1179
*                 CKREQ=CKREQ&&CKREQ;                              1180
         L     @06,@PC00001+8                                      1180
         XC    CKREQ(44,@06),CKREQ(@06)                            1180
*                 CKRERN=MSG15;                                    1181
         LH    @15,MSG15                                           1181
         STH   @15,CKRERN(,@06)                                    1181
*                 CKRMVAR(1)=ADDR(STNGPK);                         1182
         LA    @15,STNGPK                                          1182
         ST    @15,CKRMVAR(,@06)                                   1182
*                 CALL IDCRDER;                                    1183
         BAL   @14,IDCRDER                                         1183
*               END;                                               1184
*                                                                  1184
*             /*******************************************************/
*             /*                                                     */
*             /* ISSUE MESSAGE IDC01215I FOR VTOC                    */
*             /*                                                     */
*             /*******************************************************/
*                                                                  1185
*             ELSE                                                 1185
*               IF XTNHDSN=FMT4DSN THEN                            1185
         B     @RC01178                                            1185
@RF01178 L     @06,@PC00001+8                                      1185
         L     @01,REPIXTNT(,@06)                                  1185
         CLC   XTNHDSN(44,@01),FMT4DSN                             1185
         BNE   @RF01185                                            1185
*                 DO;                                              1186
*                   CKREQ=CKREQ&&CKREQ;                            1187
         XC    CKREQ(44,@06),CKREQ(@06)                            1187
*                   CKRERN=MSG15;                                  1188
         LH    @15,MSG15                                           1188
         STH   @15,CKRERN(,@06)                                    1188
*                   CKRMVAR(1)=ADDR(FMT4DSCB);                     1189
         LA    @15,FMT4DSCB                                        1189
         ST    @15,CKRMVAR(,@06)                                   1189
*                   CALL IDCRDER;                                  1190
         BAL   @14,IDCRDER                                         1190
*                 END;                                             1191
*                                                                  1191
*             /*******************************************************/
*             /*                                                     */
*             /* ISSUE MESSAGE IDC01215I FOR DATA SET                */
*             /*                                                     */
*             /*******************************************************/
*                                                                  1192
*               ELSE                                               1192
*                 DO;                                              1192
         B     @RC01185                                            1192
@RF01185 DS    0H                                                  1193
*                   CKREQ=CKREQ&&CKREQ;                            1193
         L     @06,@PC00001+8                                      1193
         XC    CKREQ(44,@06),CKREQ(@06)                            1193
*                   CKRERN=MSG15;                                  1194
         LH    @15,MSG15                                           1194
         STH   @15,CKRERN(,@06)                                    1194
*                   CKRMVAR(1)=ADDR(XTNHDSN);                      1195
         L     @01,REPIXTNT(,@06)                                  1195
         LA    @15,XTNHDSN(,@01)                                   1195
         ST    @15,CKRMVAR(,@06)                                   1195
*                   CALL IDCRDER;                                  1196
         BAL   @14,IDCRDER                                         1196
*                 END;                                             1197
*             RETURN CODE(LASTCC00);                               1198
@RC01185 DS    0H                                                  1198
@RC01178 SLR   @15,@15                                             1198
         L     @14,@SA00009                                        1198
         LM    @00,@12,@SA00009+8                                  1198
         BR    @14                                                 1198
*           END;                                                   1199
*         ELSE                                                     1200
*           DO;                                                    1200
*                                                                  1200
@RF01176 DS    0H                                                  1201
*             /*******************************************************/
*             /*                                                     */
*             /* END OF TRACK WAS NOT ON LAST RECORD IN THE RANGE.   */
*             /* RESET RECORD NUMBER AND UPDATE CYLINDER AND HEAD    */
*             /* NUMBER AS REQUIRED                                  */
*             /*                                                     */
*             /*******************************************************/
*                                                                  1201
*             RDRECNUM=0;                                          1201
         L     @06,@PC00001+8                                      1201
         L     @05,REPIDSAR(,@06)                                  1201
         MVI   RDRECNUM(@05),X'00'                                 1201
*             IF RDHH=DEVMAXHH-1 THEN                              1202
         L     @06,REPIDEVA(,@06)                                  1202
         LH    @06,DEVMAXHH(,@06)                                  1202
         N     @06,@CF03487                                        1202
         BCTR  @06,0                                               1202
         LH    @15,RDHH(,@05)                                      1202
         N     @15,@CF03487                                        1202
         CR    @06,@15                                             1202
         BNE   @RF01202                                            1202
*               DO;                                                1203
*                 RDHH=0;                                          1204
         SLR   @06,@06                                             1204
         STH   @06,RDHH(,@05)                                      1204
*                 RDCC=RDCC+1;                                     1205
         LA    @06,1                                               1205
         LH    @15,RDCC(,@05)                                      1205
         N     @15,@CF03487                                        1205
         ALR   @06,@15                                             1205
         STH   @06,RDCC(,@05)                                      1205
*               END;                                               1206
*             ELSE                                                 1207
*               RDHH=RDHH+1;                                       1207
*                                                                  1207
         B     @RC01202                                            1207
@RF01202 L     @06,@PC00001+8                                      1207
         L     @06,REPIDSAR(,@06)                                  1207
         LA    @05,1                                               1207
         LH    @15,RDHH(,@06)                                      1207
         N     @15,@CF03487                                        1207
         ALR   @05,@15                                             1207
         STH   @05,RDHH(,@06)                                      1207
*             /*******************************************************/
*             /*                                                     */
*             /* DETERMINE IF NEXT TRACK IS OUT OF DATASETRANGE OR   */
*             /* STAGINGRANGE AND IF OUT OF RANGE ISSUE MESSAGE      */
*             /* IDC01215I AND RETURN TO THE CALLER WITH RC = 00     */
*             /*                                                     */
*             /*******************************************************/
*                                                                  1208
*             IF RDCHR>XTNHCHR2 THEN                               1208
@RC01202 L     @06,@PC00001+8                                      1208
         L     @05,REPIDSAR(,@06)                                  1208
         L     @06,REPIXTNT(,@06)                                  1208
         CLC   RDCHR(5,@05),XTNHCHR2(@06)                          1208
         BNH   @RF01208                                            1208
*               DO;                                                1209
*                                                                  1209
*                 /***************************************************/
*                 /*                                                 */
*                 /* ISSUE MESSAGE IDC01215I FOR STAGING PACK        */
*                 /*                                                 */
*                 /***************************************************/
*                                                                  1210
*                 IF(ADDR(DISPL)^=NULLPTR&ADDR(STAGR)^=NULLPTR)×(ADDR(
*                     COPY)^=NULLPTR&ADDR(CSRNG)^=NULLPTR) THEN    1210
         SLR   @06,@06                                             1210
         L     @15,@PC00001+4                                      1210
         C     @06,FDTPTR(,@15)                                    1210
         BE    @GL00045                                            1210
         C     @06,FDTPTR+32(,@15)                                 1210
         BNE   @RT01210                                            1210
@GL00045 SLR   @06,@06                                             1210
         L     @15,@PC00001+4                                      1210
         C     @06,FDTPTR+136(,@15)                                1210
         BE    @RF01210                                            1210
         C     @06,FDTPTR+148(,@15)                                1210
         BE    @RF01210                                            1210
@RT01210 DS    0H                                                  1211
*                   DO;                                            1211
*                     CKREQ=CKREQ&&CKREQ;                          1212
         L     @06,@PC00001+8                                      1212
         XC    CKREQ(44,@06),CKREQ(@06)                            1212
*                     CKRERN=MSG15;                                1213
         LH    @15,MSG15                                           1213
         STH   @15,CKRERN(,@06)                                    1213
*                     CKRMVAR(1)=ADDR(STNGPK);                     1214
         LA    @15,STNGPK                                          1214
         ST    @15,CKRMVAR(,@06)                                   1214
*                     CALL IDCRDER;                                1215
         BAL   @14,IDCRDER                                         1215
*                   END;                                           1216
*                                                                  1216
*                 /***************************************************/
*                 /*                                                 */
*                 /* ISSUE MESSAGE IDC01215I FOR VTOC                */
*                 /*                                                 */
*                 /***************************************************/
*                                                                  1217
*                 ELSE                                             1217
*                   IF XTNHDSN=FMT4DSN THEN                        1217
         B     @RC01210                                            1217
@RF01210 L     @06,@PC00001+8                                      1217
         L     @01,REPIXTNT(,@06)                                  1217
         CLC   XTNHDSN(44,@01),FMT4DSN                             1217
         BNE   @RF01217                                            1217
*                     DO;                                          1218
*                       CKREQ=CKREQ&&CKREQ;                        1219
         XC    CKREQ(44,@06),CKREQ(@06)                            1219
*                       CKRERN=MSG15;                              1220
         LH    @15,MSG15                                           1220
         STH   @15,CKRERN(,@06)                                    1220
*                       CKRMVAR(1)=ADDR(FMT4DSCB);                 1221
         LA    @15,FMT4DSCB                                        1221
         ST    @15,CKRMVAR(,@06)                                   1221
*                       CALL IDCRDER;                              1222
         BAL   @14,IDCRDER                                         1222
*                     END;                                         1223
*                                                                  1223
*                 /***************************************************/
*                 /*                                                 */
*                 /* ISSUE MESSAGE IDC01215I FOR DATA SET            */
*                 /*                                                 */
*                 /***************************************************/
*                                                                  1224
*                   ELSE                                           1224
*                     DO;                                          1224
         B     @RC01217                                            1224
@RF01217 DS    0H                                                  1225
*                       CKREQ=CKREQ&&CKREQ;                        1225
         L     @06,@PC00001+8                                      1225
         XC    CKREQ(44,@06),CKREQ(@06)                            1225
*                       CKRERN=MSG15;                              1226
         LH    @15,MSG15                                           1226
         STH   @15,CKRERN(,@06)                                    1226
*                       CKRMVAR(1)=ADDR(XTNHDSN);                  1227
         L     @01,REPIXTNT(,@06)                                  1227
         LA    @15,XTNHDSN(,@01)                                   1227
         ST    @15,CKRMVAR(,@06)                                   1227
*                       CALL IDCRDER;                              1228
         BAL   @14,IDCRDER                                         1228
*                     END;                                         1229
*                 RETURN CODE(LASTCC00);                           1230
@RC01217 DS    0H                                                  1230
@RC01210 SLR   @15,@15                                             1230
         L     @14,@SA00009                                        1230
         LM    @00,@12,@SA00009+8                                  1230
         BR    @14                                                 1230
*               END;                                               1231
*           END;                                                   1232
@RF01208 DS    0H                                                  1233
*       END;                                                       1233
*   END;                                                           1234
*                                                                  1234
@RF01172 DS    0H                                                  1234
@DE00949 L     @06,@PC00001+8                                      1234
         L     @05,REPIDSAR(,@06)                                  1234
         SLR   @15,@15                                             1234
         IC    @15,I(,@06)                                         1234
         MH    @15,@CH02987                                        1234
         L     @06,REPIXTNT(,@06)                                  1234
         ALR   @06,@15                                             1234
         CLC   RDCHR(5,@05),XTNTCHR2-78(@06)                       1234
         BNH   @DL00949                                            1234
*   /*****************************************************************/
*   /*                                                               */
*   /* END OF DO UNTIL RDCHR > XTNTCHR2(I) ALL RECORDS IN THIS EXTENT*/
*   /* ENTRY HAVE BEEN PROCESSED RETURN TO THE CALLER WITH RC = 00   */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1235
*   RETURN CODE(LASTCC00);                                         1235
         SLR   @15,@15                                             1235
         L     @14,@SA00009                                        1235
         LM    @00,@12,@SA00009+8                                  1235
         BR    @14                                                 1235
*   END IDCRDDC;                                                   1236
*                                                                  1237
*/********************************************************************/
*/*                                                                  */
*/*   PROCEDURE NAME - IDCRDRF                                       */
*/*                                                                  */
*/*   DESCRIPTION - THIS SERVICE ROUTINE IS USED TO OPEN THE         */
*/*            REPAIR WORKFILE AND TO ENSURE ITS VALIDITY            */
*/*            BY CHECKING THE HEADER RECORD                         */
*/*                                                                  */
*/*            IT GETS CORE FOR TWO NON HEADER RECORDS               */
*/*            EACH ONE EQUAL TO THE MAXIMUM BLOCKSIZE OF            */
*/*            THE REPAIR WORKFILE + OVERHEAD AREA                   */
*/*                                                                  */
*/*            IT OBTAINS TWO DATA BUFFER AREAS OF SIZE              */
*/*            IOCTRN + 16                                           */
*/*                                                                  */
*/*            IT CHECKS THE VALIDITY OF THE CCHH(R) PARAMETERS      */
*/*                                                                  */
*/*   MACROS ISSUED - UOPEN - TO OPEN THE REPAIR WORKFILE            */
*/*                   UGPOOL - TO GET BUFFER SPACE                   */
*/*                   UCLOSE - TO CLOSE THE REPAIR WORKFILE          */
*/*                   UIOINFO - TO GET THE DATA SET NAME             */
*/*                   ?GETRCD - TO READ THE HEADER RECORD            */
*/*                   ?CALLCKER - TO PRINT A MESSAGE                 */
*/*                                                                  */
*/*                                                                  */
*/*   MESSAGES -                                                     */
*/*       IDC31220I - INDICATING THE REPAIR WORKFILE HEADER          */
*/*                   WAS NOT FOUND OR NOT VALID                     */
*/*                                                                  */
*/*       IDC31233I - INDICATING THE CCHH OR CCHHR WAS NOT VALID     */
*/*                                                                  */
*/*                                                                  */
*/*                                                                  */
*/*   INPUT - A BYTE INDICATING I TO OPEN FOR INPUT OR               */
*/*               O TO OPEN FOR OUTPUT                               */
*/*                                                                  */
*/*   OUTPUT - REPBUFF0, REPBUFF1, REPR0LN, REPRILN                  */
*/*            RWF HEADER IN REPRWHDI (FOR INPUT) OR                 */
*/*                     REPRWHDO (FOR OUTPUT)                        */
*/*                                                                  */
*/********************************************************************/
*                                                                  1237
*IDCRDRF:                                                          1237
*   PROC(RFIO);                                                    1237
*                                                                  1237
IDCRDRF  STM   @14,@12,@SA00010                                    1237
         MVC   @PC00010(4),0(@01)                                  1237
*   /*****************************************************************/
*   /*                                                               */
*   /* THE FOLLOWING FIELDS ARE USED BY IDCRDRF                      */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1238
*   DCL                                                            1238
*     SAVCLOSE PTR(31);             /* COMMOM PTR FOR CLOSE          */
*   DCL                                                            1239
*     RFIO CHAR(1);                 /* INPUT/OUTPUT INDICATOR        */
*   DCL                                                            1240
*     RFDD CHAR(8);                 /* DDNAME AREA                   */
*   DCL                                                            1241
*     RFDSN CHAR(44);               /* DATA SET NAME AREA            */
*   DCL                                                            1242
*     RFPASS CHAR(8);               /* PASS WORD AREA                */
*   DCL                                                            1243
*     MAXSIZ FIXED(31);             /* MAXIMUM SIZE OF BUFFERS       */
*   DCL                                                            1244
*     REPKEY0 PTR(31);              /* BUFFER AREA PTR               */
*   DCL                                                            1245
*     RWFNAM CHAR(44);              /* AREA FOR UINFO DATA SET NAME  */
*   DCL                                                            1246
*     MES33PTR PTR(31);             /* COMMON PRT FOR MESSAGE 33     */
*   DCL                                                            1247
*     MES33LEN FIXED(8);            /* COMMON LENGTH FOR MESSAGE 33  */
*   DCL                                                            1248
*     RWFPTR1 PTR(31);              /* TO GET DANAME                 */
*                                                                  1248
*   /*****************************************************************/
*   /*                                                               */
*   /* THE FOLLOWING STRUCTURE IS USED BY IDCRDRF TO DEFINE THE      */
*   /* HEADER RECORD THAT IS READ IN BY GETRCD                       */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1249
*   DCL                                                            1249
*     1 RCDHEAD BASED(WFIODAD),                                    1249
*      2 RCDKEY CHAR(11),           /* REPAIR WF KEY AREA            */
*      2 RCKRWNM CHAR(15),          /* REPAIR WF DS NAME             */
*      2 * CHAR(114);               /* REST OF HEADER RECORD         */
*                                                                  1249
*   /*****************************************************************/
*   /*                                                               */
*   /* THE FOLLOWING AREAS ARE BASED                                 */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1250
*   DCL                                                            1250
*     RCDAREA CHAR(140) BASED;      /* AREA FOR HEADER RECORD        */
*   DCL                                                            1251
*     RWFDANA CHAR(44) BASED(RWFPTR1);/* AREA FOR DATA SET NAME      */
*                                                                  1251
*   /*****************************************************************/
*   /*                                                               */
*   /* THE FOLLOWING ARE LITERALS AND CONSTANTS USED BY IDCRDRF      */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1252
*   DCL                                                            1252
*     HEADRNM CHAR(15) INIT('REPAIRVWORKFILE');/* REPAIRWORKFILE   1252
*                                      LITERAL                       */
*   DCL                                                            1253
*     RD01 CHAR(8) INIT('RD01');    /* SUBPOOL ID                    */
*   DCL                                                            1254
*     BLANK8 CHAR(8) INIT('        ');/* FIELD WITH 8 BLANKS         */
*   DCL                                                            1255
*     INPUTIND CHAR(1) INIT('I');   /* TO INDICATE INPUT             */
*   DCL                                                            1256
*     MSG20 FIXED(8) CONSTANT(20);  /* CONSTANT FOR MSG IDC31220I    */
*   DCL                                                            1257
*     MSG33 FIXED(8) CONSTANT(33);  /* CONSTANT FOR MSG IDC31233I    */
*   DCL                                                            1258
*     REPRNG CHAR(17) INIT('REPAIRRANGE');/* LITERAL FOR MSG       1258
*                                      IDC31233I                     */
*   DCL                                                            1259
*     RANG CHAR(17) INIT('RANGE');  /* LITERAL FOR MSG IDC31233I     */
*   DCL                                                            1260
*     OUTREPK CHAR(17) INIT('OUTREPAIRKEY');/* LITERAL FOR MSG     1260
*                                      IDC31233I                     */
*   DCL                                                            1261
*     INREPK CHAR(17) INIT('INREPAIRKEY');/* LITERAL FOR MSG       1261
*                                      IDC31233I                     */
*   DCL                                                            1262
*     INREPRNG CHAR(17) INIT('INREPAIRRANGE');/* LITERAL FOR MSG   1262
*                                      IDC31233I                     */
*   DCL                                                            1263
*     KEYLEN FIXED(8) CONSTANT(16); /* RWF KEYLENGTH                 */
*                                                                  1263
*   /*****************************************************************/
*   /*                                                               */
*   /* THESE FIELDS ARE FOR THE UIOINFO MACRO                        */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1264
*   DCL                                                            1264
*     INFOBYT CHAR(1);              /* FOR UIOINFO                   */
*   DCL                                                            1265
*     INFOPTR PTR(31);              /* FOR UIOINFO                   */
*   DCL                                                            1266
*     INFODD CHAR(8);               /* DDNAME FOR UIOINFO            */
*   DCL                                                            1267
*     INFDSNPT PTR(31);             /* DSN PTR FOR UIOINFO           */
*   DCL                                                            1268
*     DSNIDENT FIXED(16) CONSTANT(1);/* DSN IDENTF FOR UIOINFO       */
*                                                                  1268
*   /*****************************************************************/
*   /*                                                               */
*   /* THIS STRUCTURE DEFINES A FIELD OF 44 BLANKS                   */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1269
*   DCL                                                            1269
*     1 BLANKS STATIC LOCAL,                                       1269
*      2 *(44) CHAR(1) INIT((44)'40'X);                            1269
*                                                                  1269
*   /*****************************************************************/
*   /*                                                               */
*   /* THIS STRUCTURE USED TO DEFINE THE REPAIR WORKFILE KEY         */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1270
*   DCL                                                            1270
*     1 HEADRKEY STATIC LOCAL,                                     1270
*      2 * CHAR(7) INIT('00000000000000'X),                        1270
*      2 * CHAR(4) INIT('REPV');                                   1270
*                                                                  1271
*   /*****************************************************************/
*   /*                                                               */
*   /* HERE BEGINS THE CODE FOR IDCRDRF INITIALIZE PREVIOUSLY SAVED  */
*   /* CODEREGS TO ALLOW ENTRY HERE.                                 */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1271
*   GEN(ENTRY IDCRDRF);                                            1271
         ENTRY IDCRDRF
*   LM(REG9,REG12,SPLITSAV);                                       1272
         LM    REG9,REG12,SPLITSAV                                 1272
*   IF GDTDBG=NULLPTR THEN                                         1273
         L     @06,@PC00001                                        1273
         L     @06,GDTDBG(,@06)                                    1273
         LTR   @06,@06                                             1273
         BZ    @RT01273                                            1273
*     ;                                                            1274
*   ELSE                                                           1275
*     CALL IDCDB010(GDTTBL,'RD66');                                1275
         L     @06,@PC00001                                        1275
         ST    @06,@AL00001                                        1275
         LA    @05,@CC03445                                        1275
         ST    @05,@AL00001+4                                      1275
         MVI   @AL00001+4,X'80'                                    1275
         L     @15,GDTDBG(,@06)                                    1275
         LA    @01,@AL00001                                        1275
         BALR  @14,@15                                             1275
*   OLDERID2=NEWERID2;                                             1276
@RT01273 L     @06,@PC00001                                        1276
         L     @06,GDTTR2(,@06)                                    1276
         MVC   @TS00001(95),NEWERID2(@06)                          1276
         MVC   OLDERID2(95,@06),@TS00001                           1276
*   NEWID2='RD67';                                                 1277
*                                                                  1277
         MVC   NEWID2(4,@06),@CC03446                              1277
*   /*****************************************************************/
*   /*                                                               */
*   /* INITIALIZED COMMON AREAS TO BLANKS                            */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1278
*   RFDD=' ';                                                      1278
         MVI   RFDD+1,C' '                                         1278
         MVC   RFDD+2(6),RFDD+1                                    1278
         MVI   RFDD,C' '                                           1278
*   RFDSN=' ';                                                     1279
*                                                                  1279
         MVI   RFDSN+1,C' '                                        1279
         MVC   RFDSN+2(42),RFDSN+1                                 1279
         MVI   RFDSN,C' '                                          1279
*   /*****************************************************************/
*   /*                                                               */
*   /* SETUP ADDRESSABILITY TO OPNAGL                                */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1280
*   RESPECIFY                                                      1280
*     OPNAGL BASED(REPOPAGL);                                      1280
*                                                                  1280
*   /*****************************************************************/
*   /*                                                               */
*   /* CHECK TO SEE IF REQUEST IS FOR DISPLAY                        */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1281
*   IF ADDR(DISPL)^=NULLPTR THEN                                   1281
*                                                                  1281
         L     @06,@PC00001+4                                      1281
         L     @05,FDTPTR(,@06)                                    1281
         LTR   @05,@05                                             1281
         BZ    @RF01281                                            1281
*     /***************************************************************/
*     /*                                                             */
*     /* CHECK IF INFILE DATA SET SUPPLIED                           */
*     /*                                                             */
*     /***************************************************************/
*                                                                  1282
*     DO;                                                          1282
*       IF ADDR(INFIL)^=ZERO THEN                                  1283
*                                                                  1283
         L     @06,FDTPTR+12(,@06)                                 1283
         CH    @06,ZERO                                            1283
         BE    @RF01283                                            1283
*         /***********************************************************/
*         /*                                                         */
*         /* INFILE DATA SET - SET DDNAME AND PASSWORD FROM FDT      */
*         /*                                                         */
*         /***********************************************************/
*                                                                  1284
*         DO;                                                      1284
*           RFDD=INFILVAL;                                         1285
         MVC   RFDD(8),INFILVAL(@06)                               1285
*           RFPASS=INFILPAS;                                       1286
         MVC   RFPASS(8),INFILPAS(@06)                             1286
*           INFOPTR=REPIINFO;                                      1287
         L     @06,@PC00001+8                                      1287
         L     @06,REPIINFO(,@06)                                  1287
         ST    @06,INFOPTR                                         1287
*           INFODD=RFDD;                                           1288
         MVC   INFODD(8),RFDD                                      1288
*           CALL INFORTN;                                          1289
         BAL   @14,INFORTN                                         1289
*         END;                                                     1290
*       ELSE                                                       1291
*                                                                  1291
*         /***********************************************************/
*         /*                                                         */
*         /* NO INFILE SPECIFIED-USE DS NAME FROM FDT                */
*         /*                                                         */
*         /***********************************************************/
*                                                                  1291
*         DO;                                                      1291
         B     @RC01283                                            1291
@RF01283 DS    0H                                                  1292
*           RFDSN=INDSVAL;                                         1292
         L     @06,@PC00001+4                                      1292
         L     @06,FDTPTR+16(,@06)                                 1292
         MVC   RFDSN(44),INDSVAL(@06)                              1292
*           RWFNAM=RFDSN;                                          1293
         MVC   RWFNAM(44),RFDSN                                    1293
*           RFPASS=INDSPAS;                                        1294
         MVC   RFPASS(8),INDSPAS(@06)                              1294
*         END;                                                     1295
*                                                                  1295
*       /*************************************************************/
*       /*                                                           */
*       /* CHECK THE REPAIRRANGE                                     */
*       /*                                                           */
*       /*************************************************************/
*                                                                  1296
*       IF ADDR(DRRNG)^=NULLPTR THEN                               1296
@RC01283 L     @06,@PC00001+4                                      1296
         L     @05,FDTPTR+28(,@06)                                 1296
         LTR   @05,@05                                             1296
         BZ    @RF01296                                            1296
*         DO;                                                      1297
*           IF RRCHRLEN^=5 THEN                                    1298
         L     @06,FDTPTR+96(,@06)                                 1298
         CLI   RRCHRLEN(@06),5                                     1298
         BE    @RF01298                                            1298
*             DO;                                                  1299
*                                                                  1299
*               /*****************************************************/
*               /*                                                   */
*               /* BAD CCHHR LENGTH ISSUE MSG IDC31233I RETURN WITH  */
*               /* RC = 12                                           */
*               /*                                                   */
*               /*****************************************************/
*                                                                  1300
*               DO;                                                1300
*                 CKREQ=CKREQ&&CKREQ;                              1301
         L     @15,@PC00001+8                                      1301
         XC    CKREQ(44,@15),CKREQ(@15)                            1301
*                 CKRERN=MSG33;                                    1302
         MVC   CKRERN(2,@15),@CH02361                              1302
*                 CKRMVAR(1)=ADDR(REPRNG);                         1303
         LA    @14,REPRNG                                          1303
         ST    @14,CKRMVAR(,@15)                                   1303
*                 CKRMVAR(2)=ADDR(RRCHRVAL);                       1304
         LA    @14,RRCHRVAL(,@06)                                  1304
         ST    @14,CKRMVAR+4(,@15)                                 1304
*                 CKRMVAR(3)=ADDR(RWFNAM);                         1305
         LA    @14,RWFNAM                                          1305
         ST    @14,CKRMVAR+8(,@15)                                 1305
*                 CKRMVAR(4)=ADDR(RRCHRLEN);                       1306
         ST    @06,CKRMVAR+12(,@15)                                1306
*                 CALL IDCRDER;                                    1307
         BAL   @14,IDCRDER                                         1307
*               END;                                               1308
*               RETURN CODE(LASTCC12);                             1309
         LA    @15,12                                              1309
         L     @14,@SA00010                                        1309
         LM    @00,@12,@SA00010+8                                  1309
         BR    @14                                                 1309
*             END;                                                 1310
*           ELSE                                                   1311
*             DO;                                                  1311
@RF01298 DS    0H                                                  1312
*               IF ADDR(RRCHH)^=NULLPTR&RRCHHLEN^=5 THEN           1312
         L     @06,@PC00001+4                                      1312
         L     @06,FDTPTR+100(,@06)                                1312
         LTR   @06,@06                                             1312
         BZ    @RF01312                                            1312
         CLI   RRCHHLEN(@06),5                                     1312
         BE    @RF01312                                            1312
*                 DO;                                              1313
*                                                                  1313
*                   /*************************************************/
*                   /*                                               */
*                   /* BAD CCHHR LENGTH ISSUE MSG IDC31233I RETURN   */
*                   /* WITH RC = 12                                  */
*                   /*                                               */
*                   /*************************************************/
*                                                                  1314
*                   DO;                                            1314
*                     CKREQ=CKREQ&&CKREQ;                          1315
         L     @15,@PC00001+8                                      1315
         XC    CKREQ(44,@15),CKREQ(@15)                            1315
*                     CKRERN=MSG33;                                1316
         MVC   CKRERN(2,@15),@CH02361                              1316
*                     CKRMVAR(1)=ADDR(REPRNG);                     1317
         LA    @14,REPRNG                                          1317
         ST    @14,CKRMVAR(,@15)                                   1317
*                     CKRMVAR(2)=ADDR(RRCHHVAL);                   1318
         LA    @14,RRCHHVAL(,@06)                                  1318
         ST    @14,CKRMVAR+4(,@15)                                 1318
*                     CKRMVAR(3)=ADDR(RWFDSN);                     1319
         L     @01,REPRWINA(,@15)                                  1319
         LA    @14,RWFDSN(,@01)                                    1319
         ST    @14,CKRMVAR+8(,@15)                                 1319
*                     CKRMVAR(4)=ADDR(RRCHHLEN);                   1320
         ST    @06,CKRMVAR+12(,@15)                                1320
*                     CALL IDCRDER;                                1321
         BAL   @14,IDCRDER                                         1321
*                   END;                                           1322
*                   RETURN CODE(LASTCC12);                         1323
         LA    @15,12                                              1323
         L     @14,@SA00010                                        1323
         LM    @00,@12,@SA00010+8                                  1323
         BR    @14                                                 1323
*                 END;                                             1324
*               ELSE                                               1325
*                 ;                                                1325
@RF01312 DS    0H                                                  1326
*             END;                                                 1326
*         END;                                                     1327
*       ELSE                                                       1328
*         ;                                                        1328
@RF01296 DS    0H                                                  1329
*     END;                                                         1329
*                                                                  1329
*   /*****************************************************************/
*   /*                                                               */
*   /* CHECK IF COPY REQUEST                                         */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1330
*   ELSE                                                           1330
*     IF ADDR(COPY)^=NULLPTR THEN                                  1330
*                                                                  1330
         B     @RC01281                                            1330
@RF01281 L     @06,@PC00001+4                                      1330
         L     @05,FDTPTR+136(,@06)                                1330
         LTR   @05,@05                                             1330
         BZ    @RF01330                                            1330
*       /*************************************************************/
*       /*                                                           */
*       /* COPY REQUEST - USE DDNAME AND COPY PASSWORD               */
*       /*                                                           */
*       /*************************************************************/
*                                                                  1331
*       DO;                                                        1331
*         RFDD=COFILVAL;                                           1332
         L     @06,FDTPTR+160(,@06)                                1332
         MVC   RFDD(8),COFILVAL(@06)                               1332
*         RFPASS=COFILPAS;                                         1333
         MVC   RFPASS(8),COFILPAS(@06)                             1333
*       END;                                                       1334
*                                                                  1334
*   /*****************************************************************/
*   /*                                                               */
*   /* CHECK IF DEBLOCK REQUEST                                      */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1335
*     ELSE                                                         1335
*       IF ADDR(DBLOC)^=NULLPTR THEN                               1335
*                                                                  1335
         B     @RC01330                                            1335
@RF01330 SLR   @06,@06                                             1335
         L     @05,@PC00001+4                                      1335
         C     @06,FDTPTR+276(,@05)                                1335
         BE    @RF01335                                            1335
*         /***********************************************************/
*         /*                                                         */
*         /* DEBLOCK REQUEST -CHECK IF FILE                          */
*         /*                                                         */
*         /***********************************************************/
*                                                                  1336
*         DO;                                                      1336
*           IF ADDR(DBFIL)^=NULLPTR THEN                           1337
*                                                                  1337
         L     @05,FDTPTR+280(,@05)                                1337
         CR    @05,@06                                             1337
         BE    @RF01337                                            1337
*             /*******************************************************/
*             /*                                                     */
*             /* FILE SPECIFIED - USE DDNAME AND PASSWORD            */
*             /*                                                     */
*             /*******************************************************/
*                                                                  1338
*             DO;                                                  1338
*               RFDD=DBFILVAL;                                     1339
         MVC   RFDD(8),DBFILVAL(@05)                               1339
*               RFPASS=DBFILPAS;                                   1340
         MVC   RFPASS(8),DBFILPAS(@05)                             1340
*               INFODD=RFDD;                                       1341
         MVC   INFODD(8),RFDD                                      1341
*               INFOPTR=REPOINFO;                                  1342
         L     @06,@PC00001+8                                      1342
         L     @06,REPOINFO(,@06)                                  1342
         ST    @06,INFOPTR                                         1342
*               CALL INFORTN;                                      1343
         BAL   @14,INFORTN                                         1343
*             END;                                                 1344
*                                                                  1344
*           /*********************************************************/
*           /*                                                       */
*           /* NO FILE SPECIFIED                                     */
*           /*                                                       */
*           /*********************************************************/
*                                                                  1345
*           ELSE                                                   1345
*                                                                  1345
*             /*******************************************************/
*             /*                                                     */
*             /* USE DATA SET NAME AND PASSWORD                      */
*             /*                                                     */
*             /*******************************************************/
*                                                                  1345
*             DO;                                                  1345
         B     @RC01337                                            1345
@RF01337 DS    0H                                                  1346
*               RFDSN=DBDSVAL;                                     1346
         L     @06,@PC00001+4                                      1346
         L     @06,FDTPTR+284(,@06)                                1346
         MVC   RFDSN(44),DBDSVAL(@06)                              1346
*               RFPASS=DBDSPAS;                                    1347
         MVC   RFPASS(8),DBDSPAS(@06)                              1347
*               RWFNAM=RFDSN;                                      1348
         MVC   RWFNAM(44),RFDSN                                    1348
*             END;                                                 1349
*                                                                  1349
*           /*********************************************************/
*           /*                                                       */
*           /* CHECK THE RANGE PARAMETERS                            */
*           /*                                                       */
*           /*********************************************************/
*                                                                  1350
*           IF DBCCHLEN^=4 THEN                                    1350
@RC01337 L     @06,@PC00001+4                                      1350
         L     @06,FDTPTR+300(,@06)                                1350
         CLI   DBCCHLEN(@06),4                                     1350
         BE    @RF01350                                            1350
*             DO;                                                  1351
*                                                                  1351
*               /*****************************************************/
*               /*                                                   */
*               /* BAD CCHH LENGTH ISSUE MSG IDC31233I RETURN WITH RC*/
*               /* = 12                                              */
*               /*                                                   */
*               /*****************************************************/
*                                                                  1352
*               DO;                                                1352
*                 CKREQ=CKREQ&&CKREQ;                              1353
         L     @15,@PC00001+8                                      1353
         XC    CKREQ(44,@15),CKREQ(@15)                            1353
*                 CKRERN=MSG33;                                    1354
         MVC   CKRERN(2,@15),@CH02361                              1354
*                 CKRMVAR(1)=ADDR(RANG);                           1355
         LA    @14,RANG                                            1355
         ST    @14,CKRMVAR(,@15)                                   1355
*                 CKRMVAR(2)=ADDR(DBCCHVAL);                       1356
         LA    @14,DBCCHVAL(,@06)                                  1356
         ST    @14,CKRMVAR+4(,@15)                                 1356
*                 CKRMVAR(3)=ADDR(RWFNAM);                         1357
         LA    @14,RWFNAM                                          1357
         ST    @14,CKRMVAR+8(,@15)                                 1357
*                 CKRMVAR(4)=ADDR(DBCCHLEN);                       1358
         ST    @06,CKRMVAR+12(,@15)                                1358
*                 CALL IDCRDER;                                    1359
         BAL   @14,IDCRDER                                         1359
*               END;                                               1360
*               RETURN CODE(LASTCC12);                             1361
         LA    @15,12                                              1361
         L     @14,@SA00010                                        1361
         LM    @00,@12,@SA00010+8                                  1361
         BR    @14                                                 1361
*             END;                                                 1362
*           ELSE                                                   1363
*             DO;                                                  1363
@RF01350 DS    0H                                                  1364
*               IF ADDR(DBHHH)^=NULLPTR&DBHHHLEN^=2 THEN           1364
         L     @06,@PC00001+4                                      1364
         L     @06,FDTPTR+304(,@06)                                1364
         LTR   @06,@06                                             1364
         BZ    @RF01364                                            1364
         CLI   DBHHHLEN(@06),2                                     1364
         BE    @RF01364                                            1364
*                 DO;                                              1365
*                                                                  1365
*                   /*************************************************/
*                   /*                                               */
*                   /* BAD HH LENGTH ISSUE MSG IDC31233I RETURN WITH */
*                   /* RC = 12                                       */
*                   /*                                               */
*                   /*************************************************/
*                                                                  1366
*                   DO;                                            1366
*                     CKREQ=CKREQ&&CKREQ;                          1367
         L     @15,@PC00001+8                                      1367
         XC    CKREQ(44,@15),CKREQ(@15)                            1367
*                     CKRERN=MSG33;                                1368
         MVC   CKRERN(2,@15),@CH02361                              1368
*                     CKRMVAR(1)=ADDR(RANG);                       1369
         LA    @14,RANG                                            1369
         ST    @14,CKRMVAR(,@15)                                   1369
*                     CKRMVAR(2)=ADDR(DBHHHVAL);                   1370
         LA    @14,DBHHHVAL(,@06)                                  1370
         ST    @14,CKRMVAR+4(,@15)                                 1370
*                     CKRMVAR(3)=ADDR(RWFNAM);                     1371
         LA    @14,RWFNAM                                          1371
         ST    @14,CKRMVAR+8(,@15)                                 1371
*                     CKRMVAR(4)=ADDR(DBHHHLEN);                   1372
         ST    @06,CKRMVAR+12(,@15)                                1372
*                     CALL IDCRDER;                                1373
         BAL   @14,IDCRDER                                         1373
*                   END;                                           1374
*                   RETURN CODE(LASTCC12);                         1375
         LA    @15,12                                              1375
         L     @14,@SA00010                                        1375
         LM    @00,@12,@SA00010+8                                  1375
         BR    @14                                                 1375
*                 END;                                             1376
*               ELSE                                               1377
*                 ;                                                1377
@RF01364 DS    0H                                                  1378
*             END;                                                 1378
*                                                                  1378
*           /*********************************************************/
*           /*                                                       */
*           /* THIS IS THE END OF DEBLOCK REQUEST                    */
*           /*                                                       */
*           /*********************************************************/
*                                                                  1379
*         END;                                                     1379
*                                                                  1380
*   /*****************************************************************/
*   /*                                                               */
*   /* CONTINUE CHECKING FOR MODIFY. THE CODE IS REALIGNED TO COLUMN */
*   /* 10.                                                           */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1380
*       ELSE                                                       1380
*                                                                  1380
*         /***********************************************************/
*         /*                                                         */
*         /* MUST BE MODIFY REQUEST CHECK FOR INPUT OR OUTPUT TO     */
*         /* WORKFILE                                                */
*         /*                                                         */
*         /***********************************************************/
*                                                                  1380
*         IF RFIO=INPUTIND THEN                                    1380
*                                                                  1380
         B     @RC01335                                            1380
@RF01335 L     @06,@PC00010                                        1380
         CLC   RFIO(1,@06),INPUTIND                                1380
         BNE   @RF01380                                            1380
*           /*********************************************************/
*           /*                                                       */
*           /* INPUT REQUEST - SEE IF INFILE                         */
*           /*                                                       */
*           /*********************************************************/
*                                                                  1381
*           DO;                                                    1381
*             IF ADDR(MINDS)^=NULLPTR THEN                         1382
*                                                                  1382
         L     @06,@PC00001+4                                      1382
         L     @06,FDTPTR+376(,@06)                                1382
         LTR   @06,@06                                             1382
         BZ    @RF01382                                            1382
*               /*****************************************************/
*               /*                                                   */
*               /* USE DATA SET NAME AND PASSWORD                    */
*               /*                                                   */
*               /*****************************************************/
*                                                                  1383
*               DO;                                                1383
*                 RFPASS=MINDSPAS;                                 1384
         MVC   RFPASS(8),MINDSPAS(@06)                             1384
*                 RFDSN=MINDSVAL;                                  1385
         MVC   RFDSN(44),MINDSVAL(@06)                             1385
*                 RWFNAM=RFDSN;                                    1386
         MVC   RWFNAM(44),RFDSN                                    1386
*               END;                                               1387
*                                                                  1387
*             /*******************************************************/
*             /*                                                     */
*             /* INFILE                                              */
*             /*                                                     */
*             /*******************************************************/
*                                                                  1388
*             ELSE                                                 1388
*                                                                  1388
*               /*****************************************************/
*               /*                                                   */
*               /* USE DDNAME AND PASSWORD                           */
*               /*                                                   */
*               /*****************************************************/
*                                                                  1388
*               DO;                                                1388
         B     @RC01382                                            1388
@RF01382 DS    0H                                                  1389
*                 RFPASS=MINFLPAS;                                 1389
         L     @06,@PC00001+4                                      1389
         L     @06,FDTPTR+372(,@06)                                1389
         MVC   RFPASS(8),MINFLPAS(@06)                             1389
*                 RFDD=MINFLVAL;                                   1390
         MVC   RFDD(8),MINFLVAL(@06)                               1390
*                 INFODD=RFDD;                                     1391
         MVC   INFODD(8),RFDD                                      1391
*                 INFOPTR=REPIINFO;                                1392
         L     @06,@PC00001+8                                      1392
         L     @06,REPIINFO(,@06)                                  1392
         ST    @06,INFOPTR                                         1392
*                 CALL INFORTN;                                    1393
         BAL   @14,INFORTN                                         1393
*               END;                                               1394
*                                                                  1394
*             /*******************************************************/
*             /*                                                     */
*             /* CHECK IF THE INREPAIRRANGE PARAMETERS ARE VALID ARE */
*             /* VALID                                               */
*             /*                                                     */
*             /*******************************************************/
*                                                                  1395
*             IF ADDR(MIRNG)^=NULLPTR THEN                         1395
@RC01382 L     @06,@PC00001+4                                      1395
         L     @05,FDTPTR+388(,@06)                                1395
         LTR   @05,@05                                             1395
         BZ    @RF01395                                            1395
*               DO;                                                1396
*                 IF MRRCHLEN^=4 THEN                              1397
         L     @06,FDTPTR+456(,@06)                                1397
         CLI   MRRCHLEN(@06),4                                     1397
         BE    @RF01397                                            1397
*                   DO;                                            1398
*                                                                  1398
*                     /***********************************************/
*                     /*                                             */
*                     /* BAD CCHH LENGTH ISSUE MSG IDC31233I RETURN  */
*                     /* WITH RC =12                                 */
*                     /*                                             */
*                     /***********************************************/
*                                                                  1399
*                     DO;                                          1399
*                       CKREQ=CKREQ&&CKREQ;                        1400
         L     @15,@PC00001+8                                      1400
         XC    CKREQ(44,@15),CKREQ(@15)                            1400
*                       CKRERN=MSG33;                              1401
         MVC   CKRERN(2,@15),@CH02361                              1401
*                       CKRMVAR(1)=ADDR(INREPRNG);                 1402
         LA    @14,INREPRNG                                        1402
         ST    @14,CKRMVAR(,@15)                                   1402
*                       CKRMVAR(2)=ADDR(MRRCHVAL);                 1403
         LA    @14,MRRCHVAL(,@06)                                  1403
         ST    @14,CKRMVAR+4(,@15)                                 1403
*                       CKRMVAR(3)=ADDR(RWFNAM);                   1404
         LA    @14,RWFNAM                                          1404
         ST    @14,CKRMVAR+8(,@15)                                 1404
*                       CKRMVAR(4)=ADDR(MRRCHLEN);                 1405
         ST    @06,CKRMVAR+12(,@15)                                1405
*                       CALL IDCRDER;                              1406
         BAL   @14,IDCRDER                                         1406
*                     END;                                         1407
*                     RETURN CODE(LASTCC12);                       1408
         LA    @15,12                                              1408
         L     @14,@SA00010                                        1408
         LM    @00,@12,@SA00010+8                                  1408
         BR    @14                                                 1408
*                   END;                                           1409
*                 ELSE                                             1410
*                   ;                                              1410
@RF01397 DS    0H                                                  1411
*                 IF ADDR(MRRHH)^=NULLPTR&MRRHHLEN^=2 THEN         1411
         L     @06,@PC00001+4                                      1411
         L     @06,FDTPTR+460(,@06)                                1411
         LTR   @06,@06                                             1411
         BZ    @RF01411                                            1411
         CLI   MRRHHLEN(@06),2                                     1411
         BE    @RF01411                                            1411
*                   DO;                                            1412
*                                                                  1412
*                     /***********************************************/
*                     /*                                             */
*                     /* BAD HH LENGTH ISSUE MSG IDC31233I RETURN    */
*                     /* WITH RC = 12                                */
*                     /*                                             */
*                     /***********************************************/
*                                                                  1413
*                     DO;                                          1413
*                       CKREQ=CKREQ&&CKREQ;                        1414
         L     @15,@PC00001+8                                      1414
         XC    CKREQ(44,@15),CKREQ(@15)                            1414
*                       CKRERN=MSG33;                              1415
         MVC   CKRERN(2,@15),@CH02361                              1415
*                       CKRMVAR(1)=ADDR(INREPRNG);                 1416
         LA    @14,INREPRNG                                        1416
         ST    @14,CKRMVAR(,@15)                                   1416
*                       CKRMVAR(2)=ADDR(MRRHHVAL);                 1417
         LA    @14,MRRHHVAL(,@06)                                  1417
         ST    @14,CKRMVAR+4(,@15)                                 1417
*                       CKRMVAR(3)=ADDR(RWFNAM);                   1418
         LA    @14,RWFNAM                                          1418
         ST    @14,CKRMVAR+8(,@15)                                 1418
*                       CKRMVAR(4)=ADDR(MRRHHLEN);                 1419
         ST    @06,CKRMVAR+12(,@15)                                1419
*                       CALL IDCRDER;                              1420
         BAL   @14,IDCRDER                                         1420
*                     END;                                         1421
*                     RETURN CODE(LASTCC12);                       1422
         LA    @15,12                                              1422
         L     @14,@SA00010                                        1422
         LM    @00,@12,@SA00010+8                                  1422
         BR    @14                                                 1422
*                   END;                                           1423
*                 ELSE                                             1424
*                   ;                                              1424
@RF01411 DS    0H                                                  1425
*               END;                                               1425
*             ELSE                                                 1426
*               DO;                                                1426
*                                                                  1426
         B     @RC01395                                            1426
@RF01395 DS    0H                                                  1427
*                 /***************************************************/
*                 /*                                                 */
*                 /* CHECK IF THE INREPAIRKEY PARAMETERS IS VALID    */
*                 /*                                                 */
*                 /***************************************************/
*                                                                  1427
*                 IF ADDR(MIRK)^=NULLPTR THEN                      1427
         L     @06,@PC00001+4                                      1427
         L     @05,FDTPTR+380(,@06)                                1427
         LTR   @05,@05                                             1427
         BZ    @RF01427                                            1427
*                   DO;                                            1428
*                     IF MIRCHLEN^=5 THEN                          1429
         L     @06,FDTPTR+440(,@06)                                1429
         CLI   MIRCHLEN(@06),5                                     1429
         BE    @RF01429                                            1429
*                       DO;                                        1430
*                                                                  1430
*                         /*******************************************/
*                         /*                                         */
*                         /* BAD CCHHR LENGTH ISSUE MSG IDC31233I    */
*                         /* RETURN WITH RC = 12                     */
*                         /*                                         */
*                         /*******************************************/
*                                                                  1431
*                         DO;                                      1431
*                           CKREQ=CKREQ&&CKREQ;                    1432
         L     @15,@PC00001+8                                      1432
         XC    CKREQ(44,@15),CKREQ(@15)                            1432
*                           CKRERN=MSG33;                          1433
         MVC   CKRERN(2,@15),@CH02361                              1433
*                           CKRMVAR(1)=ADDR(INREPK);               1434
         LA    @14,INREPK                                          1434
         ST    @14,CKRMVAR(,@15)                                   1434
*                           CKRMVAR(2)=ADDR(MIRCHVAL);             1435
         LA    @14,MIRCHVAL(,@06)                                  1435
         ST    @14,CKRMVAR+4(,@15)                                 1435
*                           CKRMVAR(3)=ADDR(RWFNAM);               1436
         LA    @14,RWFNAM                                          1436
         ST    @14,CKRMVAR+8(,@15)                                 1436
*                           CKRMVAR(4)=ADDR(MIRCHLEN);             1437
         ST    @06,CKRMVAR+12(,@15)                                1437
*                           CALL IDCRDER;                          1438
         BAL   @14,IDCRDER                                         1438
*                         END;                                     1439
*                         RETURN CODE(LASTCC12);                   1440
         LA    @15,12                                              1440
         L     @14,@SA00010                                        1440
         LM    @00,@12,@SA00010+8                                  1440
         BR    @14                                                 1440
*                       END;                                       1441
*                     ELSE                                         1442
*                       ;                                          1442
@RF01429 DS    0H                                                  1443
*                   END;                                           1443
*                 ELSE                                             1444
*                   ;                                              1444
@RF01427 DS    0H                                                  1445
*               END;                                               1445
*                                                                  1445
*             /*******************************************************/
*             /*                                                     */
*             /* END OF INPUT REQUEST                                */
*             /*                                                     */
*             /*******************************************************/
*                                                                  1446
*           END;                                                   1446
*                                                                  1446
*   /*****************************************************************/
*   /*                                                               */
*   /* MODIFY OUTPUT REQUEST TO WORKFILE                             */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1447
*         ELSE                                                     1447
*                                                                  1447
*           /*********************************************************/
*           /*                                                       */
*           /* CHECK IF OUTFILE OR DATA SET                          */
*           /*                                                       */
*           /*********************************************************/
*                                                                  1447
*           DO;                                                    1447
         B     @RC01380                                            1447
@RF01380 DS    0H                                                  1448
*             IF ADDR(MODS)^=NULLPTR THEN                          1448
*                                                                  1448
         L     @06,@PC00001+4                                      1448
         L     @06,FDTPTR+416(,@06)                                1448
         LTR   @06,@06                                             1448
         BZ    @RF01448                                            1448
*               /*****************************************************/
*               /*                                                   */
*               /* USE DATA SET NAME AND PASSWORD                    */
*               /*                                                   */
*               /*****************************************************/
*                                                                  1449
*               DO;                                                1449
*                 RFPASS=MODSPAS;                                  1450
         MVC   RFPASS(8),MODSPAS(@06)                              1450
*                 RFDSN=MODSVAL;                                   1451
         MVC   RFDSN(44),MODSVAL(@06)                              1451
*                 RWFNAM=RFDSN;                                    1452
         MVC   RWFNAM(44),RFDSN                                    1452
*               END;                                               1453
*                                                                  1453
*             /*******************************************************/
*             /*                                                     */
*             /* OUTFILE                                             */
*             /*                                                     */
*             /*******************************************************/
*                                                                  1454
*             ELSE                                                 1454
*                                                                  1454
*               /*****************************************************/
*               /*                                                   */
*               /* USE DDNAME AND PASSWORD                           */
*               /*                                                   */
*               /*****************************************************/
*                                                                  1454
*               DO;                                                1454
         B     @RC01448                                            1454
@RF01448 DS    0H                                                  1455
*                 RFPASS=MOUTFPAS;                                 1455
         L     @06,@PC00001+4                                      1455
         L     @06,FDTPTR+412(,@06)                                1455
         MVC   RFPASS(8),MOUTFPAS(@06)                             1455
*                 RFDD=MOUTFVAL;                                   1456
         MVC   RFDD(8),MOUTFVAL(@06)                               1456
*                 INFODD=RFDD;                                     1457
         MVC   INFODD(8),RFDD                                      1457
*                 INFOPTR=REPOINFO;                                1458
         L     @06,@PC00001+8                                      1458
         L     @06,REPOINFO(,@06)                                  1458
         ST    @06,INFOPTR                                         1458
*                 CALL INFORTN;                                    1459
         BAL   @14,INFORTN                                         1459
*               END;                                               1460
*                                                                  1460
*             /*******************************************************/
*             /*                                                     */
*             /* CHECK THE OUTREPAIRKEY PARAMETER                    */
*             /*                                                     */
*             /*******************************************************/
*                                                                  1461
*             IF MORCHLEN^=5 THEN                                  1461
@RC01448 L     @06,@PC00001+4                                      1461
         L     @06,FDTPTR+484(,@06)                                1461
         CLI   MORCHLEN(@06),5                                     1461
         BE    @RF01461                                            1461
*               DO;                                                1462
*                                                                  1462
*                 /***************************************************/
*                 /*                                                 */
*                 /* BAD CCHHR LENGTH ISSUE MSG IDC31233I RETURN WITH*/
*                 /* RC = 12                                         */
*                 /*                                                 */
*                 /***************************************************/
*                                                                  1463
*                 DO;                                              1463
*                   CKREQ=CKREQ&&CKREQ;                            1464
         L     @15,@PC00001+8                                      1464
         XC    CKREQ(44,@15),CKREQ(@15)                            1464
*                   CKRERN=MSG33;                                  1465
         MVC   CKRERN(2,@15),@CH02361                              1465
*                   CKRMVAR(1)=ADDR(OUTREPK);                      1466
         LA    @14,OUTREPK                                         1466
         ST    @14,CKRMVAR(,@15)                                   1466
*                   CKRMVAR(2)=ADDR(MORCHVAL);                     1467
         LA    @14,MORCHVAL(,@06)                                  1467
         ST    @14,CKRMVAR+4(,@15)                                 1467
*                   CKRMVAR(3)=ADDR(RWFNAM);                       1468
         LA    @14,RWFNAM                                          1468
         ST    @14,CKRMVAR+8(,@15)                                 1468
*                   CKRMVAR(4)=ADDR(MORCHLEN);                     1469
         ST    @06,CKRMVAR+12(,@15)                                1469
*                   CALL IDCRDER;                                  1470
         BAL   @14,IDCRDER                                         1470
*                 END;                                             1471
*                 RETURN CODE(LASTCC12);                           1472
         LA    @15,12                                              1472
         L     @14,@SA00010                                        1472
         LM    @00,@12,@SA00010+8                                  1472
         BR    @14                                                 1472
*               END;                                               1473
*             ELSE                                                 1474
*               ;                                                  1474
@RF01461 DS    0H                                                  1475
*           END;                                                   1475
*                                                                  1475
*   /*****************************************************************/
*   /*                                                               */
*   /* THE PASSWORD IS SET, AS IS THE DDNAME OR THE DATA SET         */
*   /* NAME-WHICHEVER WAS SPECIFIED CLEAR OUT THE OPNAGL SET UP      */
*   /* OPNAGL PARAMETERS                                             */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1476
*   OPNAGL=''B;                                                    1476
*                                                                  1476
@RC01380 DS    0H                                                  1476
@RC01335 DS    0H                                                  1476
@RC01330 DS    0H                                                  1476
@RC01281 L     @06,@PC00001+8                                      1476
         L     @05,REPOPAGL(,@06)                                  1476
         XC    OPNAGL(48,@05),OPNAGL(@05)                          1476
*   /*****************************************************************/
*   /*                                                               */
*   /* CHECK IF INPUT FILE                                           */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1477
*   IF RFIO=INPUTIND THEN                                          1477
*                                                                  1477
         L     @15,@PC00010                                        1477
         CLC   RFIO(1,@15),INPUTIND                                1477
         BNE   @RF01477                                            1477
*     /***************************************************************/
*     /*                                                             */
*     /* INPUT DATA SET SET INPUT INDICATOR AND GET IOCSTR PTR FROM  */
*     /* THE REPCB                                                   */
*     /*                                                             */
*     /***************************************************************/
*                                                                  1478
*     DO;                                                          1478
*       OPNOPTIN=ON;                                               1479
         OI    OPNOPTIN(@05),B'10000000'                           1479
*       OPNIOC=ADDR(REPIRWIO);                                     1480
         LA    @06,REPIRWIO(,@06)                                  1480
         ST    @06,OPNIOC(,@05)                                    1480
*     END;                                                         1481
*                                                                  1481
*   /*****************************************************************/
*   /*                                                               */
*   /* OUTPUT DATA SET                                               */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1482
*   ELSE                                                           1482
*                                                                  1482
*     /***************************************************************/
*     /*                                                             */
*     /* SET OUTPUT INDICATOR AND IOCSTR PTR FROM REPCB              */
*     /*                                                             */
*     /***************************************************************/
*                                                                  1482
*     DO;                                                          1482
         B     @RC01477                                            1482
@RF01477 DS    0H                                                  1483
*       OPNOPTUP=ON;                                               1483
         L     @06,@PC00001+8                                      1483
         L     @05,REPOPAGL(,@06)                                  1483
         OI    OPNOPTUP(@05),B'00100000'                           1483
*       OPNIOC=ADDR(REPORWIO);                                     1484
         LA    @06,REPORWIO(,@06)                                  1484
         ST    @06,OPNIOC(,@05)                                    1484
*     END;                                                         1485
*                                                                  1485
*   /*****************************************************************/
*   /*                                                               */
*   /* SET PASSWORD                                                  */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1486
*   OPNPWA=ADDR(RFPASS);                                           1486
*                                                                  1486
@RC01477 L     @06,@PC00001+8                                      1486
         L     @06,REPOPAGL(,@06)                                  1486
         LA    @05,RFPASS                                          1486
         ST    @05,OPNPWA(,@06)                                    1486
*   /*****************************************************************/
*   /*                                                               */
*   /* CHECK IF WANT DDNAME                                          */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1487
*   IF RFDD^=BLANK8 THEN                                           1487
*                                                                  1487
         CLC   RFDD(8),BLANK8                                      1487
         BE    @RF01487                                            1487
*     /***************************************************************/
*     /*                                                             */
*     /* DDNAME NOT BLANK - THEN WANT DDNAME                         */
*     /*                                                             */
*     /***************************************************************/
*                                                                  1488
*     OPNDDN=ADDR(RFDD);                                           1488
         LA    @05,RFDD                                            1488
         ST    @05,OPNDDN(,@06)                                    1488
*   ELSE                                                           1489
*                                                                  1489
*     /***************************************************************/
*     /*                                                             */
*     /* DDNAME BLANK - WANT DATA SET NAME                           */
*     /*                                                             */
*     /***************************************************************/
*                                                                  1489
*     OPNDSN=ADDR(RFDSN);                                          1489
*                                                                  1489
         B     @RC01487                                            1489
@RF01487 L     @06,@PC00001+8                                      1489
         L     @06,REPOPAGL(,@06)                                  1489
         LA    @05,RFDSN                                           1489
         ST    @05,OPNDSN(,@06)                                    1489
*   /*****************************************************************/
*   /*                                                               */
*   /* ISSUE OPEN                                                    */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1490
*   CALL IDCIOOP0(GDTTBL,OPNAGL);                                  1490
@RC01487 L     @06,@PC00001                                        1490
         ST    @06,@AL00001                                        1490
         L     @05,@PC00001+8                                      1490
         L     @05,REPOPAGL(,@05)                                  1490
         ST    @05,@AL00001+4                                      1490
         MVI   @AL00001+4,X'80'                                    1490
         L     @15,GDTOPN(,@06)                                    1490
         LA    @01,@AL00001                                        1490
         BALR  @14,@15                                             1490
*   RESPECIFY                                                      1491
*     RTNREG RSTD;                                                 1491
*   TESTRC=RTNREG;                                                 1492
         LR    TESTRC,RTNREG                                       1492
*   RESPECIFY                                                      1493
*     RTNREG UNRSTD;                                               1493
*                                                                  1493
*   /*****************************************************************/
*   /*                                                               */
*   /* CHECK RETURN CODE FROM OPEN                                   */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1494
*   IF TESTRC^=0 THEN                                              1494
*                                                                  1494
         LTR   TESTRC,TESTRC                                       1494
         BZ    @RF01494                                            1494
*     /***************************************************************/
*     /*                                                             */
*     /* BAD RETURN CODE-RETURN WITH RC 12                           */
*     /*                                                             */
*     /***************************************************************/
*                                                                  1495
*     RETURN CODE(LASTCC12);                                       1495
         LA    @15,12                                              1495
         L     @14,@SA00010                                        1495
         LM    @00,@12,@SA00010+8                                  1495
         BR    @14                                                 1495
*   ELSE                            /*                       @ZA20961*/
*     DO;                           /*                       @ZA20961*/
*                                                                  1496
@RF01494 DS    0H                                                  1497
*       /*************************************************************/
*       /*                                                           */
*       /* NOW SAVE THE IOCSTR POINTER (REPTBL) IN SAVCLOSE AND GET  */
*       /* DSNAME IN CASE IS NEEDED FOR MESSAGE                      */
*       /*                                                           */
*       /*************************************************************/
*                                                                  1497
*       IF RFIO=INPUTIND THEN                                      1497
         L     @06,@PC00010                                        1497
         CLC   RFIO(1,@06),INPUTIND                                1497
         BNE   @RF01497                                            1497
*         SAVCLOSE=REPIRWIO;                                       1498
         L     @06,@PC00001+8                                      1498
         L     @06,REPIRWIO(,@06)                                  1498
         ST    @06,SAVCLOSE                                        1498
*       ELSE                                                       1499
*         SAVCLOSE=REPORWIO;                                       1499
         B     @RC01497                                            1499
@RF01497 L     @06,@PC00001+8                                      1499
         L     @06,REPORWIO(,@06)                                  1499
         ST    @06,SAVCLOSE                                        1499
*       IOCSPTR=SAVCLOSE;                                          1500
@RC01497 L     @06,SAVCLOSE                                        1500
         ST    @06,IOCSPTR                                         1500
*       RWFPTR1=IOCDSN;                                            1501
*                                                                  1501
         L     RWFPTR1,IOCDSN(,@06)                                1501
*       /*************************************************************/
*       /*                                                           */
*       /*                                                   @ZA20961*/
*       /* ENSURE THAT THE DATA SET OPENED FIRST OF ALL IS   @ZA20961*/
*       /* A VSAM DATA SET. IF NOT, THE USER COULD NOT       @ZA20961*/
*       /* HAVE SPECIFIED A RWF SO WE SHOULD CLOSE THE DS    @ZA20961*/
*       /* AND PUT OUT MESSAGE IDC31220I.                    @ZA20961*/
*       /*                                                   @ZA20961*/
*       /*                                                           */
*       /*************************************************************/
*                                                                  1502
*       IF IOCDSOAM=OFF THEN        /*                       @ZA20961*/
         TM    IOCDSOAM(@06),B'10000000'                           1502
         BNZ   @RF01502                                            1502
*         TESTRC=12;                /*                       @ZA20961*/
         LA    TESTRC,12                                           1503
*       ELSE                        /*                       @ZA20961*/
*         DO;                       /*                       @ZA20961*/
*                                                                  1504
         B     @RC01502                                            1504
@RF01502 DS    0H                                                  1505
*           /*********************************************************/
*           /*                                                       */
*           /* SET RPLKGE OFF FOR GET RECORD RPLKGE IS GOTTEN FROM   */
*           /* THE IOC CONTROL BLOCK                                 */
*           /*                                                       */
*           /*********************************************************/
*                                                                  1505
*           RPLKGE=OFF;                                            1505
*                                                                  1505
         L     @06,IOCSPTR                                         1505
         L     @06,IOCEXT(,@06)                                    1505
         L     @06,IOCRPL(,@06)                                    1505
         NI    RPLKGE(@06),B'11111011'                             1505
*           /*********************************************************/
*           /*                                                       */
*           /* GET HEADER RECORD                                     */
*           /*                                                       */
*           /*********************************************************/
*                                                                  1506
*           IF RFIO=INPUTIND THEN                                  1506
         L     @06,@PC00010                                        1506
         CLC   RFIO(1,@06),INPUTIND                                1506
         BNE   @RF01506                                            1506
*             DO;                                                  1507
*               WFREQ=''B;                                         1508
         L     @06,@PC00001+8                                      1508
         XC    WFREQ(2,@06),WFREQ(@06)                             1508
*               WFRGET=ON;          /* GETRCD                        */
         OI    WFRGET(@06),B'00100000'                             1509
*               WFRIN=ON;           /* INPUT DS                      */
         OI    WFRIN(@06),B'10000000'                              1510
*               CALL IDCRDIO;                                      1511
         BAL   @14,IDCRDIO                                         1511
*               RFY                                                1512
*                 RTNREG RSTD;                                     1512
*               TESTRC=RTNREG;                                     1513
         LR    TESTRC,RTNREG                                       1513
*               RFY                                                1514
*                 RTNREG UNRSTD;                                   1514
*             END;                                                 1515
*           ELSE                                                   1516
*             DO;                                                  1516
         B     @RC01506                                            1516
@RF01506 DS    0H                                                  1517
*               WFREQ=''B;                                         1517
         L     @06,@PC00001+8                                      1517
         XC    WFREQ(2,@06),WFREQ(@06)                             1517
*               WFRGET=ON;          /* GETRCD                        */
         OI    WFRGET(@06),B'00100000'                             1518
*               CALL IDCRDIO;                                      1519
         BAL   @14,IDCRDIO                                         1519
*               RFY                                                1520
*                 RTNREG RSTD;                                     1520
*               TESTRC=RTNREG;                                     1521
         LR    TESTRC,RTNREG                                       1521
*               RFY                                                1522
*                 RTNREG UNRSTD;                                   1522
*             END;                                                 1523
*         END;                      /*                       @ZA20961*/
@RC01506 DS    0H                                                  1525
*     END;                          /*                       @ZA20961*/
*                                                                  1525
@RC01502 DS    0H                                                  1526
*   /*****************************************************************/
*   /*                                                               */
*   /* TEST IF GET SUCCESSFUL                                        */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1526
*   IF TESTRC^=0 THEN                                              1526
         LTR   TESTRC,TESTRC                                       1526
         BZ    @RF01526                                            1526
*     IF TESTRC^=4 THEN                                            1527
         C     TESTRC,@CF00044                                     1527
         BE    @RF01527                                            1527
*       DO;                                                        1528
*                                                                  1528
*         /***********************************************************/
*         /*                                                         */
*         /* HEADER NOT FOUND ISSUE MSG IDC31220I, CLOSE FILE AND    */
*         /* RETURN WITH RC = 12                                     */
*         /*                                                         */
*         /***********************************************************/
*                                                                  1529
*         DO;                                                      1529
*           CKREQ=CKREQ&&CKREQ;                                    1530
         L     @06,@PC00001+8                                      1530
         XC    CKREQ(44,@06),CKREQ(@06)                            1530
*           CKRERN=MSG20;                                          1531
         MVC   CKRERN(2,@06),@CH00647                              1531
*           CKRMVAR(1)=ADDR(RWFDANA);                              1532
         ST    RWFPTR1,CKRMVAR(,@06)                               1532
*           CALL IDCRDER;                                          1533
         BAL   @14,IDCRDER                                         1533
*         END;                                                     1534
*         CALL IDCIOCL0(GDTTBL,SAVCLOSE);                          1535
         L     @06,@PC00001                                        1535
         ST    @06,@AL00001                                        1535
         LA    @15,SAVCLOSE                                        1535
         ST    @15,@AL00001+4                                      1535
         MVI   @AL00001+4,X'80'                                    1535
         L     @15,GDTCLS(,@06)                                    1535
         LA    @01,@AL00001                                        1535
         BALR  @14,@15                                             1535
*         RETURN CODE(LASTCC12);                                   1536
         LA    @15,12                                              1536
         L     @14,@SA00010                                        1536
         LM    @00,@12,@SA00010+8                                  1536
         BR    @14                                                 1536
*       END;                                                       1537
*                                                                  1537
*   /*****************************************************************/
*   /*                                                               */
*   /* JUST CLOSE FILE AND RETURN WITH RC = 12                       */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1538
*     ELSE                                                         1538
*       DO;                                                        1538
@RF01527 DS    0H                                                  1539
*         CALL IDCIOCL0(GDTTBL,SAVCLOSE);                          1539
         L     @06,@PC00001                                        1539
         ST    @06,@AL00001                                        1539
         LA    @15,SAVCLOSE                                        1539
         ST    @15,@AL00001+4                                      1539
         MVI   @AL00001+4,X'80'                                    1539
         L     @15,GDTCLS(,@06)                                    1539
         LA    @01,@AL00001                                        1539
         BALR  @14,@15                                             1539
*         RETURN CODE(LASTCC12);                                   1540
         LA    @15,12                                              1540
         L     @14,@SA00010                                        1540
         LM    @00,@12,@SA00010+8                                  1540
         BR    @14                                                 1540
*       END;                                                       1541
*   ELSE                                                           1542
*     ;                                                            1542
*                                                                  1542
@RF01526 DS    0H                                                  1543
*   /*****************************************************************/
*   /*                                                               */
*   /* RETURN OK FROM READING HEADER RECORD CHECK HEADER RECORD TO   */
*   /* ENSURE THAT IT IS FOR THE REPAIR WORKFILE                     */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1543
*   IF RCDKEY^=HEADRKEY×RCKRWNM^=HEADRNM THEN                      1543
         L     @06,@PC00001+8                                      1543
         L     @06,WFIODAD(,@06)                                   1543
         CLC   RCDKEY(11,@06),HEADRKEY                             1543
         BNE   @RT01543                                            1543
         CLC   RCKRWNM(15,@06),HEADRNM                             1543
         BE    @RF01543                                            1543
@RT01543 DS    0H                                                  1544
*     DO;                                                          1544
*                                                                  1544
*       /*************************************************************/
*       /*                                                           */
*       /* DATA SET NOT REPAIR WORKFILE-ISSUE MSG IDC31220I, CLOSE   */
*       /* THE FILE AND RETURN WITH RC = 12                          */
*       /*                                                           */
*       /*************************************************************/
*                                                                  1545
*       DO;                                                        1545
*         CKREQ=CKREQ&&CKREQ;                                      1546
         L     @06,@PC00001+8                                      1546
         XC    CKREQ(44,@06),CKREQ(@06)                            1546
*         CKRERN=MSG20;                                            1547
         MVC   CKRERN(2,@06),@CH00647                              1547
*         CKRMVAR(1)=ADDR(RWFDANA);                                1548
         ST    RWFPTR1,CKRMVAR(,@06)                               1548
*         CALL IDCRDER;                                            1549
         BAL   @14,IDCRDER                                         1549
*       END;                                                       1550
*       CALL IDCIOCL0(GDTTBL,SAVCLOSE);                            1551
         L     @06,@PC00001                                        1551
         ST    @06,@AL00001                                        1551
         LA    @15,SAVCLOSE                                        1551
         ST    @15,@AL00001+4                                      1551
         MVI   @AL00001+4,X'80'                                    1551
         L     @15,GDTCLS(,@06)                                    1551
         LA    @01,@AL00001                                        1551
         BALR  @14,@15                                             1551
*       RETURN CODE(LASTCC12);                                     1552
         LA    @15,12                                              1552
         L     @14,@SA00010                                        1552
         LM    @00,@12,@SA00010+8                                  1552
         BR    @14                                                 1552
*     END;                                                         1553
*   ELSE                                                           1554
*     ;                                                            1554
*                                                                  1554
@RF01543 DS    0H                                                  1555
*   /*****************************************************************/
*   /*                                                               */
*   /* IT IS A REPAIR WORKFILE MOVE HEADER ADDRESS AREA POINTED TO BY*/
*   /* REPCB                                                         */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1555
*   IF RFIO=INPUTIND THEN                                          1555
         L     @06,@PC00010                                        1555
         CLC   RFIO(1,@06),INPUTIND                                1555
         BNE   @RF01555                                            1555
*     REPRWHDI->RCDAREA=RCDHEAD;                                   1556
         L     @06,@PC00001+8                                      1556
         L     @01,REPRWHDI(,@06)                                  1556
         L     @06,WFIODAD(,@06)                                   1556
         MVC   RCDAREA(140,@01),RCDHEAD(@06)                       1556
*   ELSE                                                           1557
*     REPRWHDO->RCDAREA=RCDHEAD;                                   1557
*                                                                  1557
         B     @RC01555                                            1557
@RF01555 L     @06,@PC00001+8                                      1557
         L     @01,REPRWHDO(,@06)                                  1557
         L     @06,WFIODAD(,@06)                                   1557
         MVC   RCDAREA(140,@01),RCDHEAD(@06)                       1557
*   /*****************************************************************/
*   /*                                                               */
*   /* CALC SIZE OF BUFFER-TWICE THE RECORD SIZE + 2*KEYLEN          */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1558
*   MAXSIZ=(SAVCLOSE->IOCTRN*2)+2*KEYLEN;                          1558
*                                                                  1558
@RC01555 L     @06,SAVCLOSE                                        1558
         L     @06,IOCTRN(,@06)                                    1558
         ALR   @06,@06                                             1558
         AL    @06,@CF00222                                        1558
         ST    @06,MAXSIZ                                          1558
*   /*****************************************************************/
*   /*                                                               */
*   /* GET THE BUFFER                                                */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1559
*   CALL IDCSAGP0(GDTTBL,MAXSIZ,REPKEY0,RD01,SETZERO);             1559
         L     @06,@PC00001                                        1559
         ST    @06,@AL00001                                        1559
         LA    @02,MAXSIZ                                          1559
         ST    @02,@AL00001+4                                      1559
         LA    @02,REPKEY0                                         1559
         ST    @02,@AL00001+8                                      1559
         LA    @02,RD01                                            1559
         ST    @02,@AL00001+12                                     1559
         LA    @02,SETZERO                                         1559
         ST    @02,@AL00001+16                                     1559
         MVI   @AL00001+16,X'80'                                   1559
         L     @15,GDTGPL(,@06)                                    1559
         LA    @01,@AL00001                                        1559
         BALR  @14,@15                                             1559
*   RESPECIFY                                                      1560
*     RTNREG RSTD;                                                 1560
*   TESTRC=RTNREG;                                                 1561
         LR    TESTRC,RTNREG                                       1561
*   RESPECIFY                                                      1562
*     RTNREG UNRSTD;                                               1562
*                                                                  1562
*   /*****************************************************************/
*   /*                                                               */
*   /* CHECK RETURN CODE FROM UGPOOL                                 */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1563
*   IF TESTRC^=0 THEN                                              1563
         LTR   TESTRC,TESTRC                                       1563
         BZ    @RF01563                                            1563
*     DO;                                                          1564
*                                                                  1564
*       /*************************************************************/
*       /*                                                           */
*       /* BAD RETURN FROM UGPOOL, CLOSE FILE AND RETURN WITH RC = 12*/
*       /*                                                           */
*       /*************************************************************/
*                                                                  1565
*       CALL IDCIOCL0(GDTTBL,SAVCLOSE);                            1565
         L     @06,@PC00001                                        1565
         ST    @06,@AL00001                                        1565
         LA    @15,SAVCLOSE                                        1565
         ST    @15,@AL00001+4                                      1565
         MVI   @AL00001+4,X'80'                                    1565
         L     @15,GDTCLS(,@06)                                    1565
         LA    @01,@AL00001                                        1565
         BALR  @14,@15                                             1565
*       RETURN CODE(LASTCC12);                                     1566
         LA    @15,12                                              1566
         L     @14,@SA00010                                        1566
         LM    @00,@12,@SA00010+8                                  1566
         BR    @14                                                 1566
*     END;                                                         1567
*   ELSE                                                           1568
*     ;                                                            1568
*                                                                  1568
@RF01563 DS    0H                                                  1569
*   /*****************************************************************/
*   /*                                                               */
*   /* RETURN FROM UGPOOL OK SET BUFFER ADDRESSES IN REPCB           */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1569
*   REPBUFF0=REPKEY0;                                              1569
         L     @06,@PC00001+8                                      1569
         L     @02,REPKEY0                                         1569
         ST    @02,REPBUFF0(,@06)                                  1569
*   REPBUFF1=REPBUFF0+(MAXSIZ/2)+KEYLEN;                           1570
*                                                                  1570
         L     @00,MAXSIZ                                          1570
         SRDA  @00,32                                              1570
         D     @00,@CF00155                                        1570
         ALR   @02,@01                                             1570
         AL    @02,@CF00474                                        1570
         ST    @02,REPBUFF1(,@06)                                  1570
*   /*****************************************************************/
*   /*                                                               */
*   /* RETURN TO CALLER WITH RC = 00                                 */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1571
*   RETURN CODE(TESTRC);                                           1571
         LR    @15,TESTRC                                          1571
         L     @14,@SA00010                                        1571
         LM    @00,@12,@SA00010+8                                  1571
         BR    @14                                                 1571
*                                                                  1572
*   /*****************************************************************/
*   /*                                                               */
*   /* THE PROC WILL THE SCAN THE UIOINFO RETURN AREA (INFOPTR) FOR  */
*   /* THE DATA SET NAME - IF THE DS NAME IS NOT RETURNED OR IF THE  */
*   /* UIOINFO FAILS, THE DS NAME IS SET TO BLANKS IN THE RWFNAM     */
*   /* FIELD                                                         */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1572
*INFORTN:                                                          1572
*   PROC;                                                          1572
INFORTN  STM   @14,@12,@SA00011                                    1572
*   RFY                                                            1573
*     IOINFOPT BASED(ADDR(INFOBYT));                               1573
*   RFY                                                            1574
*     INFOAREA BASED(INFOPTR);                                     1574
*                                                                  1574
*   /*****************************************************************/
*   /*                                                               */
*   /* ISSUE UIOINFO TO GET DATA SET NAME CONSTRUCT UIOINFO OPTION   */
*   /* BYTE                                                          */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1575
*   IOINFOPT=''B;                                                  1575
         LA    @06,INFOBYT                                         1575
         MVI   IOINFOPT(@06),X'00'                                 1575
*   IOINFDSN=ON;                                                   1576
*                                                                  1576
         OI    IOINFDSN(@06),B'00100000'                           1576
*   /*****************************************************************/
*   /*                                                               */
*   /* ISSUE UIOINFO                                                 */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1577
*   CALL IDCIOSI0(GDTTBL,IOINFOPT,INFOPTR,INFODD);                 1577
*                                                                  1577
         L     @02,@PC00001                                        1577
         ST    @02,@AL00001                                        1577
         ST    @06,@AL00001+4                                      1577
         LA    @06,INFOPTR                                         1577
         ST    @06,@AL00001+8                                      1577
         LA    @06,INFODD                                          1577
         ST    @06,@AL00001+12                                     1577
         MVI   @AL00001+12,X'80'                                   1577
         L     @15,GDTIFO(,@02)                                    1577
         LA    @01,@AL00001                                        1577
         BALR  @14,@15                                             1577
*   /*****************************************************************/
*   /*                                                               */
*   /* SAVE RETURN CODE FROM UIOINFO                                 */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1578
*   RESPECIFY                                                      1578
*     RTNREG RSTD;                                                 1578
*   TESTRC=RTNREG;                                                 1579
         LR    TESTRC,RTNREG                                       1579
*   RESPECIFY                                                      1580
*     RTNREG UNRSTD;                                               1580
*                                                                  1580
*   /*****************************************************************/
*   /*                                                               */
*   /* IF UIOINFO IS SUCCESSFUL, LOCATE DSNAME                       */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1581
*   IF TESTRC=0 THEN                                               1581
         LTR   TESTRC,TESTRC                                       1581
         BNZ   @RF01581                                            1581
*     DO;                                                          1582
*       INFDSNPT=INFOPTR+LENGTH(INFAREAL)+LENGTH(INFDATAL);        1583
         LA    INFDSNPT,4                                          1583
         AL    INFDSNPT,INFOPTR                                    1583
*       RESPECIFY                                                  1584
*         INFODSN BASED(INFDSNPT);                                 1584
*       IF INFDSNID=DSNIDENT THEN                                  1585
         CLC   INFDSNID(2,INFDSNPT),@CH00220                       1585
         BNE   @RF01585                                            1585
*         RWFNAM=INFDSN;                                           1586
         MVC   RWFNAM(44),INFDSN(INFDSNPT)                         1586
*       ELSE                                                       1587
*         RWFNAM=BLANKS;                                           1587
         B     @RC01585                                            1587
@RF01585 MVC   RWFNAM(44),BLANKS                                   1587
*     END;                                                         1588
*                                                                  1588
*   /*****************************************************************/
*   /*                                                               */
*   /* IF UIOINFO IS UNSUCCESSFUL, SET DSNAME EQUAL TO BLANKS        */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1589
*   ELSE                                                           1589
*     RWFNAM=BLANKS;                                               1589
         B     @RC01581                                            1589
@RF01581 MVC   RWFNAM(44),BLANKS                                   1589
*   RETURN;                                                        1590
@EL00011 DS    0H                                                  1590
@EF00011 DS    0H                                                  1590
@ER00011 LM    @14,@12,@SA00011                                    1590
         BR    @14                                                 1590
*   END INFORTN;                                                   1591
         B     @EL00011                                            1591
*   END IDCRDRF;                                                   1592
*IDCRDEX:                                                          1593
*   PROCEDURE;                                                     1593
*                                                                  1593
IDCRDEX  STM   @14,@12,@SA00012                                    1593
*/********************************************************************/
*/*                                                                  */
*/* PROCEDURE NAME - IDCRDEX                                         */
*/*                                                                  */
*/* FUNCTION - THIS PROCEDURE FREES AUTOMATIC STORAGE OBTAINED WHEN  */
*/*            THIS MODULE WAS INITIALLY ENTERED IN PROCEDURE        */
*/*            IDCRD06 AND RESTORES THE CODE REGS                    */
*/*                                                                  */
*/* ENTRY POINT - IDCRDEX (ONLY ENTRY POINT FOR THIS PROCEDURE)      */
*/*                                                                  */
*/*           LINKAGE - 'CALL IDCRDEX;'                              */
*/*                                                                  */
*/*           INPUT -                                                */
*/*                                                                  */
*/*             NONE                                                 */
*/*                                                                  */
*/*           OUTPUT -                                               */
*/*                                                                  */
*/*             NONE                                                 */
*/*                                                                  */
*/*           EXIT, NORMAL -                                         */
*/*                                                                  */
*/*             LASTCC = CURRENT VALUE                               */
*/*                                                                  */
*/*           EXIT, ERROR -                                          */
*/*                                                                  */
*/*             NONE                                                 */
*/*                                                                  */
*/* INTERNAL INTERFACES -                                            */
*/*                                                                  */
*/*      NONE                                                        */
*/*                                                                  */
*/* EXTERNAL INTERFACES -                                            */
*/*                                                                  */
*/*      MACROS/SVCS -                                               */
*/*                                                                  */
*/*            ?UEPIL - IDCAMS SYSTEM ADAPTER EPILOG ROUTINE         */
*/*              FACILITATES SYSTEM INDEPENDENT EPILOG ACTIVITY      */
*/*              GENERATES A CALL TO MODULE IDCDB01                  */
*/*                                                                  */
*/*            UTRACE - IDCAMS TRACE POINT ROUTINE                   */
*/*              SETS TRACE POINT                                    */
*/*                                                                  */
*/*      PROCEDURES/SUBROUTINES CALLED -                             */
*/*                                                                  */
*/*            NONE                                                  */
*/*                                                                  */
*/*      DATA AREAS -                                                */
*/*                                                                  */
*/*            NONE                                                  */
*/*                                                                  */
*/********************************************************************/
*                                                                  1594
*                                                                  1594
*   /*****************************************************************/
*   /*                                                               */
*   /* ENTRY POINT FOR IDCRDEX                                       */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1594
*   GEN(ENTRY IDCRDEX);                                            1594
         ENTRY IDCRDEX
*   GEN(STM 14,12,12(13));          /*                       @ZA27486*/
         STM 14,12,12(13)
*   LM(REG9,REG12,SPLITSAV);                                       1596
*                                                                  1596
         LM    REG9,REG12,SPLITSAV                                 1596
*   /*****************************************************************/
*   /*                                                               */
*   /* SET TRACE POINT                                               */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1597
*   OLDERID2=NEWERID2;                                             1597
         L     @06,@PC00001                                        1597
         L     @03,GDTTR2(,@06)                                    1597
         MVC   @TS00001(95),NEWERID2(@03)                          1597
         MVC   OLDERID2(95,@03),@TS00001                           1597
*   NEWID2='RD62';                                                 1598
*                                                                  1598
         MVC   NEWID2(4,@03),@CC03460                              1598
*   /*****************************************************************/
*   /*                                                               */
*   /* ISSUE UEPIL TO FREE STORAGE AND RETURN TO IDCRD01 AFTER       */
*   /* ESTABLISHING LINKAGE TO THE RD06 SAVE AREA.           @ZA27486*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1599
*   RESPECIFY                                                      1599
*    (REG8,                                                        1599
*     REG13) RESTRICTED;            /*                       @ZA27486*/
*   FORCHAIN=REG8;                  /*                       @ZA27486*/
         ST    REG8,FORCHAIN(,REG13)                               1600
*   SAVER13=REG13;                  /*                       @ZA27486*/
         LR    SAVER13,REG13                                       1601
*   REG13=REG8;                     /*                       @ZA27486*/
         LR    REG13,REG8                                          1602
*   BACKCHAN=SAVER13;               /*                       @ZA27486*/
         ST    SAVER13,BACKCHAN(,REG13)                            1603
*   FORCHAIN=NULLPTR;               /*                       @ZA27486*/
         SLR   @15,@15                                             1604
         ST    @15,FORCHAIN(,REG13)                                1604
*   RESPECIFY                                                      1605
*    (REG8,                                                        1605
*     REG13) UNRESTRICTED;          /*                       @ZA27486*/
*   CALL IDCSAEP0(GDTTBL,MODID,LASTCC);                            1606
         ST    @06,@AL00001                                        1606
         LA    @15,MODID                                           1606
         ST    @15,@AL00001+4                                      1606
         LA    @15,LASTCC                                          1606
         ST    @15,@AL00001+8                                      1606
         MVI   @AL00001+8,X'80'                                    1606
         L     @15,GDTEPL(,@06)                                    1606
         LA    @01,@AL00001                                        1606
         BALR  @14,@15                                             1606
*   END IDCRDEX;                                                   1607
@EL00012 DS    0H                                                  1607
@EF00012 DS    0H                                                  1607
@ER00012 LM    @14,@12,@SA00012                                    1607
         BR    @14                                                 1607
         EJECT
*   END IDCRD06                                                    1608
*                                                                  1608
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */
*/*%INCLUDE SYSLIB  (AMSDF01 )                                       */
*/*%INCLUDE SYSLIB  (AMSDF00 )                                       */
*/*%INCLUDE SYSLIB  (AMSDF02 )                                       */
*/*@INCLUDE SYSLIB  (AMSDF02 )                                       */
*/*%INCLUDE SYSLIB  (IDCCSRD )                                       */
*/*%INCLUDE SYSLIB  (IDCDF04 )                                       */
*/*%INCLUDE SYSLIB  (AMSDF05 )                                       */
*/*%INCLUDE SYSLIB  (IFGRPL  )                                       */
*/*%INCLUDE SYSLIB  (IDCDF65 )                                       */
*/*%INCLUDE SYSLIB  (IDCDF66 )                                       */
*/*%INCLUDE SYSLIB  (IEZCTGPL)                                       */
*                                                                  1608
*       ;                                                          1608
@DATA    DS    0H
@CH00602 DC    H'7'
@CH00038 DC    H'12'
@CH00647 DC    H'20'
@CH02361 DC    H'33'
@CH00599 DC    H'44'
@CH02987 DC    H'78'
@CH02185 DC    H'83'
@DATD    DSECT
         DS    0F
@SA00001 DS    18F
@PC00001 DS    3F
@SA00002 DS    15F
@SA00003 DS    15F
@SA00004 DS    14F
@SA00005 DS    14F
@SA00006 DS    14F
@SA00007 DS    14F
@SA00008 DS    14F
@SA00009 DS    15F
@SA00010 DS    15F
@PC00010 DS    1F
@SA00011 DS    15F
@SA00012 DS    15F
@AL00001 DS    5A
IDCRD06  CSECT
         DS    0F
@CF00117 DC    F'0'
@CF00220 DC    F'1'
@CH00220 EQU   @CF00220+2
@CF00155 DC    F'2'
@CH00155 EQU   @CF00155+2
@CF00164 DC    F'3'
@CH00164 EQU   @CF00164+2
@CF00044 DC    F'4'
@CF00287 DC    F'5'
@CH00287 EQU   @CF00287+2
@CF00158 DC    F'6'
@CH00158 EQU   @CF00158+2
@CF00039 DC    F'8'
@CH00039 EQU   @CF00039+2
@CF00474 DC    F'16'
@CF00222 DC    F'32'
@CF00986 DC    F'255'
@CF03487 DC    XL4'0000FFFF'
@DATD    DSECT
         DS    0D
LISTSCAN DS    A
IOCSPTR  DS    A
DDSTRU   DS    A
FSADDR   DS    A
ERCNVADR DS    A
DMPINDEX DS    A
CCMSGPTR DS    A
CMMSGPTR DS    A
CTMSGPTR DS    A
ELEMENT  DS    F
SAVCLOSE DS    A
MAXSIZ   DS    F
REPKEY0  DS    A
INFOPTR  DS    A
LISTPTR  DS    A
MES33PTR DS    A
LASTCC   DS    H
SETRC    DS    H
MES33LEN DS    FL1
@TS00001 DS    CL95
DARGL    DS    CL100
ERCNVT   DS    CL32
SPLITSAV DS    CL16
SRHDERCD DS    CL2
RFDD     DS    CL8
RFDSN    DS    CL44
RFPASS   DS    CL8
RWFNAM   DS    CL44
INFOBYT  DS    CL1
INFODD   DS    CL8
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA
@ENDDATD EQU   *
IDCRD06  CSECT
         DS    0F
@SIZDATD DC    AL1(0)
         DC    AL3(@ENDDATD-@DATD)
@CV03369 DC    V(IDCRDRD)
         DS    0D
ZERO     DC    H'0'
RETCD29  DC    H'29'
RC01     DC    H'1'
RC07     DC    H'7'
RC15     DC    H'15'
RC16     DC    H'16'
RC19     DC    H'19'
RC20     DC    H'20'
RC21     DC    H'21'
RC29     DC    H'29'
RC30     DC    H'30'
RC31     DC    H'31'
RC32     DC    H'32'
RC33     DC    H'33'
MSG15    DC    H'15'
COUNTLEN DC    H'8'
EOFMSGLN DC    AL1(9)
@CC02177 DC    C'RD60'
@CC02178 DC    C'RD61'
@CC02351 DC    C'RD63'
@CC02352 DC    C'RD64'
@CC02355 DC    C'RD65'
@CC03304 DC    C'RD6T'
@CC03305 DC    C'RD6S'
@CC03306 DC    C'RD6U'
@CC03315 DC    C'RD68'
@CC03316 DC    C'RD69'
@CC03321 DC    C'RD6A'
@CC03325 DC    C'RD6B'
@CC03329 DC    C'RD6C'
@CC03333 DC    C'RD6D'
@CC03337 DC    C'RD6E'
@CC03381 DC    C'RD6F'
@CC03382 DC    C'RD6G'
@CC03445 DC    C'RD66'
@CC03446 DC    C'RD67'
@CC03460 DC    C'RD62'
@CC02242 DC    C'RD0'
@CC02759 DC    C'   '
@CC03077 DC    C'UV0'
ALL      DC    CL3'ALL'
FORMAT   DC    CL4'FORM'
HSECOND  DC    CL4'HSEC'
CLOCK    DC    CL4'KLOK'
SETZERO  DC    CL4'ZERO'
SETBLANK DC    CL4'BLNK'
NOSET    DC    CL4'NSET'
OVERRIDE DC    CL4'OVRD'
ACQUIRE  DC    CL8'ACQUIRE '
RELINQ   DC    CL8'RELINQ  '
MOUNT    DC    CL8'MOUNT   '
DEMOUNT  DC    CL8'DEMOUNT '
DEFINE   DC    CL8'DEFINE  '
MOVE     DC    CL8'MOVE    '
TRACEQ   DC    CL8'TRACEQ  '
COPYTABL DC    CL8'COPYTABL'
COPYCRTG DC    CL8'COPYCRTG'
COPYVOL  DC    CL8'COPYVOL '
VVIC     DC    CL8'VVIC    '
TUNE     DC    CL8'TUNE    '
NAMES    DC    CL4'NAME'
UNIT     DC    CL4'UNIT'
SHR      DC    CL4'SHR '
EXCL     DC    CL4'EXCL'
NOWAIT   DC    CL4'NWAI'
WAIT     DC    CL4'WAIT'
SECCHECK DC    CL8'SECCHECK'
SCRVTOC  DC    CL8'SCRVTOC '
GETVTOC  DC    CL8'GETVTOC '
PUTVTOC  DC    CL8'PUTVTOC '
RECATLG  DC    CL8'RECATLG '
INITVOL  DC    CL8'INITVOL '
CHECK    DC    CL8'CHECK   '
POSTUCB  DC    CL8'POSTUCB '
GET      DC    CL8'GET     '
PUT      DC    CL8'PUT     '
CLOSE    DC    CL8'CLOSE   '
OPEN     DC    CL8'OPEN    '
RVOPENR  DC    CL8'OPENR   '
RVRDCNT  DC    CL8'READCNT '
RVREADKD DC    CL8'READKD  '
RVSPACCR DC    CL8'SPACCR  '
RVFWRITE DC    CL8'FWRITE  '
RVWRITER DC    CL8'WRITEREC'
PUTLABEL DC    CL8'PUTLABEL'
GETLABEL DC    CL8'GETLABEL'
CANCEL   DC    CL8'CANCEL  '
SET      DC    CL8'SET     '
SELECTX  DC    CL8'SELECTX '
CHANGEX  DC    CL8'CHANGEX '
SELECTDD DC    CL8'SELECTDD'
SELECTDS DC    CL8'SELECTDS'
TBLREST  DC    CL8'TBLREST '
NULLIFYC DC    CL8'NULLIFYC'
RDMSC    DC    CL8'RDMSC   '
RDMSCTBL DC    CL8'RDMSCTBL'
RDCARTLB DC    CL8'RDCARTLB'
AUDITCEL DC    CL8'AUDITCEL'
RDSTGAD  DC    CL8'RDSTGAD '
MODID    DC    CL4'RD06'
ZEROCNST DS    CL8
         ORG   ZEROCNST
@NM00144 DC    8AL1(0)
         ORG   ZEROCNST+8
FIXAREA  DS    CL1024
         ORG   FIXAREA
@NM00145 DS    CL256
         ORG   @NM00145
@NM00146 DC    256X'00'
         ORG   FIXAREA+256
@NM00147 DS    CL256
         ORG   @NM00147
@NM00148 DC    256X'00'
         ORG   FIXAREA+512
@NM00149 DS    CL256
         ORG   @NM00149
@NM00150 DC    256X'00'
         ORG   FIXAREA+768
@NM00151 DS    CL256
         ORG   @NM00151
@NM00152 DC    256X'00'
         ORG   FIXAREA+1024
SRSTAGPK DC    CL44'STAGINGPACK'
EOFMSG   DC    CL9'** EOF **'
SRMESTAB DS    CL72
         ORG   SRMESTAB
SRMEST1  DC    CL18'UNMODIFIED        '
SRMEST2  DC    CL18'MODIFIED          '
SRMEST3  DC    CL18'DEBLOCKED         '
SRMEST4  DC    CL18'DEBLOCKED/MODIFIED'
         ORG   SRMESTAB+72
SRMERTAB DS    CL1392
         ORG   SRMERTAB
@NM00153 DC    CL48'GOOD COUNT,GOOD KEY/DATA'
@NM00154 DC    CL48'GOOD COUNT,BAD KEY/DATA'
@NM00155 DC    CL48'GOOD COUNT,DESTAGE ERROR ON KEY/DATA'
@NM00156 DC    CL48'GOOD COUNT,OVERFLOW,GOOD KEY/DATA'
@NM00157 DC    CL48'GOOD COUNT,STAGE ERROR ON DATA'
@NM00158 DC    CL48' '
@NM00159 DC    CL48'BAD COUNT,GOOD KEY/DATA'
@NM00160 DC    CL48'DESTAGE ERROR ON COUNT,DESTAGE ERROR ON KEY/DATA'
@NM00161 DC    CL48'STAGE ERROR ON COUNT,DESTAGE ERROR ON KEY/DATA'
@NM00162 DC    CL48'STAGE ERROR ON COUNT,STAGE ERROR ON KEY/DATA'
@NM00163 DC    CL48'STAGE ERROR ON COUNT,DESTG ERROR ON K/D,OVERFLOW'
@NM00164 DC    CL48'STAGE ERROR ON COUNT,STAGE ERROR ON K/D,OVERFLOW'
@NM00165 DC    CL48' '
@NM00166 DC    CL48' '
@NM00167 DC    CL48' '
@NM00168 DC    CL48'GOOD COUNT,BAD KEY/DATA'
@NM00169 DC    CL48' '
@NM00170 DC    CL48'BAD COUNT'
@NM00171 DC    CL48'BAD COUNT, BAD KEY/DATA'
@NM00172 DC    CL48'DESTAGE ERROR ON COUNT,BAD KEY/DATA'
@NM00173 DC    CL48'STAGE ERROR ON COUNT,BAD KEY/DATA'
@NM00174 DC    CL48' '
@NM00175 DC    CL48' '
@NM00176 DC    CL48' '
@NM00177 DC    CL48' '
@NM00178 DC    CL48' '
@NM00179 DC    CL48' '
@NM00180 DC    CL48' '
@NM00181 DC    CL48'END OF FILE RECORD'
         ORG   SRMERTAB+1392
         DS    CL2
ERRORTAB DS    CL1188
         ORG   ERRORTAB
MSG001   DS    CL12
         ORG   MSG001
@NM00183 DC    X'00'
@NM00184 DC    AL1(12)
@NM00185 DC    CL3'RD0'
@NM00186 DC    AL1(1)
@NM00187 DC    H'0'
@NM00188 DC    AL4(MENT001)
         ORG   ERRORTAB+12
MSG002   DS    CL12
         ORG   MSG002
@NM00189 DC    X'00'
@NM00190 DC    AL1(12)
@NM00191 DC    CL3'RD0'
@NM00192 DC    AL1(2)
@NM00193 DC    H'0'
@NM00194 DC    AL4(MENT002)
         ORG   ERRORTAB+24
MSG003   DS    CL12
         ORG   MSG003
@NM00195 DC    X'00'
@NM00196 DC    AL1(12)
@NM00197 DC    CL3'RD0'
@NM00198 DC    AL1(3)
@NM00199 DC    H'0'
@NM00200 DC    AL4(MENT003)
         ORG   ERRORTAB+36
MSG004   DS    CL12
         ORG   MSG004
@NM00201 DC    X'00'
@NM00202 DC    AL1(12)
@NM00203 DC    CL3'RD0'
@NM00204 DC    AL1(4)
@NM00205 DC    H'0'
@NM00206 DC    AL4(MENT004)
         ORG   ERRORTAB+48
MSG005   DS    CL12
         ORG   MSG005
@NM00207 DC    X'00'
@NM00208 DC    AL1(12)
@NM00209 DC    CL3'RD0'
@NM00210 DC    AL1(5)
@NM00211 DC    H'0'
@NM00212 DC    AL4(MENT005)
         ORG   ERRORTAB+60
MSG006   DS    CL12
         ORG   MSG006
@NM00213 DC    X'00'
@NM00214 DC    AL1(12)
@NM00215 DC    CL3'RD0'
@NM00216 DC    AL1(6)
@NM00217 DC    H'0'
@NM00218 DC    AL4(MENT006)
         ORG   ERRORTAB+72
MSG007   DS    CL12
         ORG   MSG007
@NM00219 DC    X'00'
@NM00220 DC    AL1(12)
@NM00221 DC    CL3'RD0'
@NM00222 DC    AL1(7)
@NM00223 DC    H'0'
@NM00224 DC    AL4(MENT007)
         ORG   ERRORTAB+84
MSG008   DS    CL12
         ORG   MSG008
@NM00225 DC    X'00'
@NM00226 DC    AL1(12)
@NM00227 DC    CL3'RD0'
@NM00228 DC    AL1(8)
@NM00229 DC    H'0'
@NM00230 DC    AL4(MENT008)
         ORG   ERRORTAB+96
MSG009   DS    CL12
         ORG   MSG009
@NM00231 DC    X'00'
@NM00232 DC    AL1(12)
@NM00233 DC    CL3'RD0'
@NM00234 DC    AL1(9)
@NM00235 DC    H'0'
@NM00236 DC    AL4(MENT009)
         ORG   ERRORTAB+108
MSG010   DS    CL12
         ORG   MSG010
@NM00237 DC    X'00'
@NM00238 DC    AL1(12)
@NM00239 DC    CL3'RD0'
@NM00240 DC    AL1(10)
@NM00241 DC    H'0'
@NM00242 DC    AL4(MENT010)
         ORG   ERRORTAB+120
MSG011   DS    CL12
         ORG   MSG011
@NM00243 DC    X'00'
@NM00244 DC    AL1(12)
@NM00245 DC    CL3'RD0'
@NM00246 DC    AL1(11)
@NM00247 DC    H'0'
@NM00248 DC    AL4(MENT011)
         ORG   ERRORTAB+132
MSG012   DS    CL12
         ORG   MSG012
@NM00249 DC    X'00'
@NM00250 DC    AL1(12)
@NM00251 DC    CL3'RD0'
@NM00252 DC    AL1(12)
@NM00253 DC    H'0'
@NM00254 DC    AL4(MENT012)
         ORG   ERRORTAB+144
MSG013   DS    CL12
         ORG   MSG013
@NM00255 DC    X'00'
@NM00256 DC    AL1(12)
@NM00257 DC    CL3'RD0'
@NM00258 DC    AL1(13)
@NM00259 DC    H'0'
@NM00260 DC    AL4(MENT013)
         ORG   ERRORTAB+156
MSG014   DS    CL12
         ORG   MSG014
@NM00261 DC    X'00'
@NM00262 DC    AL1(12)
@NM00263 DC    CL3'RD0'
@NM00264 DC    AL1(14)
@NM00265 DC    H'0'
@NM00266 DC    AL4(MENT014)
         ORG   ERRORTAB+168
MSG015   DS    CL12
         ORG   MSG015
@NM00267 DC    X'00'
@NM00268 DC    AL1(0)
@NM00269 DC    CL3'RD0'
@NM00270 DC    AL1(15)
@NM00271 DC    H'0'
@NM00272 DC    AL4(MENT015)
         ORG   ERRORTAB+180
MSG016   DS    CL12
         ORG   MSG016
@NM00273 DC    X'00'
@NM00274 DC    AL1(4)
@NM00275 DC    CL3'RD0'
@NM00276 DC    AL1(16)
@NM00277 DC    H'0'
@NM00278 DC    AL4(MENT016)
         ORG   ERRORTAB+192
MSG017   DS    CL12
         ORG   MSG017
@NM00279 DC    X'00'
@NM00280 DC    AL1(4)
@NM00281 DC    CL3'RD0'
@NM00282 DC    AL1(17)
@NM00283 DC    H'0'
@NM00284 DC    AL4(MENT017)
         ORG   ERRORTAB+204
MSG018   DS    CL12
         ORG   MSG018
@NM00285 DC    X'00'
@NM00286 DC    AL1(4)
@NM00287 DC    CL3'RD0'
@NM00288 DC    AL1(18)
@NM00289 DC    H'0'
@NM00290 DC    AL4(MENT018)
         ORG   ERRORTAB+216
MSG019   DS    CL12
         ORG   MSG019
@NM00291 DC    X'00'
@NM00292 DC    AL1(4)
@NM00293 DC    CL3'RD0'
@NM00294 DC    AL1(19)
@NM00295 DC    H'0'
@NM00296 DC    AL4(MENT019)
         ORG   ERRORTAB+228
MSG020   DS    CL12
         ORG   MSG020
@NM00297 DC    X'00'
@NM00298 DC    AL1(12)
@NM00299 DC    CL3'RD0'
@NM00300 DC    AL1(20)
@NM00301 DC    H'0'
@NM00302 DC    AL4(MENT020)
         ORG   ERRORTAB+240
MSG021   DS    CL12
         ORG   MSG021
@NM00303 DC    X'00'
@NM00304 DC    AL1(12)
@NM00305 DC    CL3'RD0'
@NM00306 DC    AL1(21)
@NM00307 DC    H'0'
@NM00308 DC    AL4(MENT021)
         ORG   ERRORTAB+252
MSG022   DS    CL12
         ORG   MSG022
@NM00309 DC    X'00'
@NM00310 DC    AL1(12)
@NM00311 DC    CL3'RD0'
@NM00312 DC    AL1(22)
@NM00313 DC    H'0'
@NM00314 DC    AL4(MENT022)
         ORG   ERRORTAB+264
MSG023   DS    CL12
         ORG   MSG023
@NM00315 DC    X'00'
@NM00316 DC    AL1(12)
@NM00317 DC    CL3'RD0'
@NM00318 DC    AL1(23)
@NM00319 DC    H'0'
@NM00320 DC    AL4(MENT023)
         ORG   ERRORTAB+276
MSG024   DS    CL12
         ORG   MSG024
@NM00321 DC    X'00'
@NM00322 DC    AL1(12)
@NM00323 DC    CL3'RD0'
@NM00324 DC    AL1(24)
@NM00325 DC    H'0'
@NM00326 DC    AL4(MENT024)
         ORG   ERRORTAB+288
MSG025   DS    CL12
         ORG   MSG025
@NM00327 DC    X'00'
@NM00328 DC    AL1(12)
@NM00329 DC    CL3'RD0'
@NM00330 DC    AL1(25)
@NM00331 DC    H'0'
@NM00332 DC    AL4(MENT025)
         ORG   ERRORTAB+300
MSG026   DS    CL12
         ORG   MSG026
@NM00333 DC    X'00'
@NM00334 DC    AL1(12)
@NM00335 DC    CL3'RD0'
@NM00336 DC    AL1(26)
@NM00337 DC    H'0'
@NM00338 DC    AL4(MENT026)
         ORG   ERRORTAB+312
MSG027   DS    CL12
         ORG   MSG027
@NM00339 DC    X'00'
@NM00340 DC    AL1(12)
@NM00341 DC    CL3'RD0'
@NM00342 DC    AL1(27)
@NM00343 DC    H'0'
@NM00344 DC    AL4(MENT027)
         ORG   ERRORTAB+324
MSG028   DS    CL12
         ORG   MSG028
@NM00345 DC    X'00'
@NM00346 DC    AL1(12)
@NM00347 DC    CL3'RD0'
@NM00348 DC    AL1(28)
@NM00349 DC    H'0'
@NM00350 DC    AL4(MENT028)
         ORG   ERRORTAB+336
MSG029   DS    CL12
         ORG   MSG029
@NM00351 DC    X'00'
@NM00352 DC    AL1(12)
@NM00353 DC    CL3'RD0'
@NM00354 DC    AL1(29)
@NM00355 DC    H'0'
@NM00356 DC    AL4(MENT029)
         ORG   ERRORTAB+348
MSG030   DS    CL12
         ORG   MSG030
@NM00357 DC    X'00'
@NM00358 DC    AL1(12)
@NM00359 DC    CL3'RD0'
@NM00360 DC    AL1(30)
@NM00361 DC    H'0'
@NM00362 DC    AL4(MENT030)
         ORG   ERRORTAB+360
MSG031   DS    CL12
         ORG   MSG031
@NM00363 DC    X'00'
@NM00364 DC    AL1(12)
@NM00365 DC    CL3'RD0'
@NM00366 DC    AL1(31)
@NM00367 DC    H'0'
@NM00368 DC    AL4(MENT031)
         ORG   ERRORTAB+372
MSG032   DS    CL12
         ORG   MSG032
@NM00369 DC    X'00'
@NM00370 DC    AL1(12)
@NM00371 DC    CL3'RD0'
@NM00372 DC    AL1(32)
@NM00373 DC    H'0'
@NM00374 DC    AL4(MENT032)
         ORG   ERRORTAB+384
MSG033   DS    CL12
         ORG   MSG033
@NM00375 DC    X'00'
@NM00376 DC    AL1(12)
@NM00377 DC    CL3'RD0'
@NM00378 DC    AL1(33)
@NM00379 DC    H'0'
@NM00380 DC    AL4(MENT033)
         ORG   ERRORTAB+396
MSG034   DS    CL12
         ORG   MSG034
@NM00381 DC    X'00'
@NM00382 DC    AL1(12)
@NM00383 DC    CL3'RD0'
@NM00384 DC    AL1(34)
@NM00385 DC    H'0'
@NM00386 DC    AL4(MENT034)
         ORG   ERRORTAB+408
MSG035   DS    CL12
         ORG   MSG035
@NM00387 DC    X'00'
@NM00388 DC    AL1(12)
@NM00389 DC    CL3'RD0'
@NM00390 DC    AL1(35)
@NM00391 DC    H'0'
@NM00392 DC    AL4(MENT035)
         ORG   ERRORTAB+420
MSG036   DS    CL12
         ORG   MSG036
@NM00393 DC    X'00'
@NM00394 DC    AL1(12)
@NM00395 DC    CL3'RD0'
@NM00396 DC    AL1(36)
@NM00397 DC    H'0'
@NM00398 DC    AL4(MENT036)
         ORG   ERRORTAB+432
MSG037   DS    CL12
         ORG   MSG037
@NM00399 DC    X'00'
@NM00400 DC    AL1(4)
@NM00401 DC    CL3'RD0'
@NM00402 DC    AL1(37)
@NM00403 DC    H'0'
@NM00404 DC    AL4(MENT037)
         ORG   ERRORTAB+444
MSG038   DS    CL12
         ORG   MSG038
@NM00405 DC    X'00'
@NM00406 DC    AL1(12)
@NM00407 DC    CL3'RD0'
@NM00408 DC    AL1(38)
@NM00409 DC    H'0'
@NM00410 DC    AL4(MENT038)
         ORG   ERRORTAB+456
MSG039   DS    CL12
         ORG   MSG039
@NM00411 DC    X'00'
@NM00412 DC    AL1(12)
@NM00413 DC    CL3'RD0'
@NM00414 DC    AL1(39)
@NM00415 DC    H'0'
@NM00416 DC    AL4(MENT039)
         ORG   ERRORTAB+468
MSG040   DS    CL12
         ORG   MSG040
@NM00417 DC    X'00'
@NM00418 DC    AL1(12)
@NM00419 DC    CL3'RD0'
@NM00420 DC    AL1(40)
@NM00421 DC    H'0'
@NM00422 DC    AL4(MENT040)
         ORG   ERRORTAB+480
MSG041   DS    CL12
         ORG   MSG041
@NM00423 DC    X'00'
@NM00424 DC    AL1(12)
@NM00425 DC    CL3'RD0'
@NM00426 DC    AL1(41)
@NM00427 DC    H'0'
@NM00428 DC    AL4(MENT041)
         ORG   ERRORTAB+492
MSG042   DS    CL12
         ORG   MSG042
@NM00429 DC    X'00'
@NM00430 DC    AL1(12)
@NM00431 DC    CL3'RD0'
@NM00432 DC    AL1(42)
@NM00433 DC    H'0'
@NM00434 DC    AL4(MENT042)
         ORG   ERRORTAB+504
MSG043   DS    CL12
         ORG   MSG043
@NM00435 DC    X'00'
@NM00436 DC    AL1(12)
@NM00437 DC    CL3'RD0'
@NM00438 DC    AL1(43)
@NM00439 DC    H'0'
@NM00440 DC    AL4(MENT043)
         ORG   ERRORTAB+516
MSG044   DS    CL12
         ORG   MSG044
@NM00441 DC    X'00'
@NM00442 DC    AL1(4)
@NM00443 DC    CL3'RD0'
@NM00444 DC    AL1(44)
@NM00445 DC    H'0'
@NM00446 DC    AL4(MENT044)
         ORG   ERRORTAB+528
MSG045   DS    CL12
         ORG   MSG045
@NM00447 DC    X'00'
@NM00448 DC    AL1(12)
@NM00449 DC    CL3'RD0'
@NM00450 DC    AL1(45)
@NM00451 DC    H'0'
@NM00452 DC    AL4(MENT045)
         ORG   ERRORTAB+540
MSG046   DS    CL12
         ORG   MSG046
@NM00453 DC    X'00'
@NM00454 DC    AL1(12)
@NM00455 DC    CL3'RD0'
@NM00456 DC    AL1(46)
@NM00457 DC    H'0'
@NM00458 DC    AL4(MENT046)
         ORG   ERRORTAB+552
MSG047   DS    CL12
         ORG   MSG047
@NM00459 DC    X'00'
@NM00460 DC    AL1(12)
@NM00461 DC    CL3'RD0'
@NM00462 DC    AL1(47)
@NM00463 DC    H'0'
@NM00464 DC    AL4(MENT047)
         ORG   ERRORTAB+564
MSG048   DS    CL12
         ORG   MSG048
@NM00465 DC    X'00'
@NM00466 DC    AL1(0)
@NM00467 DC    CL3'   '
@NM00468 DC    AL1(48)
@NM00469 DC    H'0'
@NM00470 DC    A(0)
         ORG   ERRORTAB+576
MSG049   DS    CL12
         ORG   MSG049
@NM00471 DC    X'00'
@NM00472 DC    AL1(0)
@NM00473 DC    CL3'   '
@NM00474 DC    AL1(1)
@NM00475 DC    H'0'
@NM00476 DC    A(0)
         ORG   ERRORTAB+588
MSG050   DS    CL12
         ORG   MSG050
@NM00477 DC    X'00'
@NM00478 DC    AL1(0)
@NM00479 DC    CL3'   '
@NM00480 DC    AL1(50)
@NM00481 DC    H'0'
@NM00482 DC    A(0)
         ORG   ERRORTAB+600
MSG051   DS    CL12
         ORG   MSG051
@NM00483 DC    X'00'
@NM00484 DC    AL1(0)
@NM00485 DC    CL3'   '
@NM00486 DC    AL1(51)
@NM00487 DC    H'0'
@NM00488 DC    A(0)
         ORG   ERRORTAB+612
MSG052   DS    CL12
         ORG   MSG052
@NM00489 DC    X'00'
@NM00490 DC    AL1(0)
@NM00491 DC    CL3'   '
@NM00492 DC    AL1(52)
@NM00493 DC    H'0'
@NM00494 DC    A(0)
         ORG   ERRORTAB+624
MSG053   DS    CL12
         ORG   MSG053
@NM00495 DC    X'00'
@NM00496 DC    AL1(0)
@NM00497 DC    CL3'   '
@NM00498 DC    AL1(53)
@NM00499 DC    H'0'
@NM00500 DC    A(0)
         ORG   ERRORTAB+636
MSG054   DS    CL12
         ORG   MSG054
@NM00501 DC    X'00'
@NM00502 DC    AL1(0)
@NM00503 DC    CL3'   '
@NM00504 DC    AL1(54)
@NM00505 DC    H'0'
@NM00506 DC    A(0)
         ORG   ERRORTAB+648
MSG055   DS    CL12
         ORG   MSG055
@NM00507 DC    X'00'
@NM00508 DC    AL1(0)
@NM00509 DC    CL3'   '
@NM00510 DC    AL1(55)
@NM00511 DC    H'0'
@NM00512 DC    A(0)
         ORG   ERRORTAB+660
MSG056   DS    CL12
         ORG   MSG056
@NM00513 DC    X'00'
@NM00514 DC    AL1(0)
@NM00515 DC    CL3'   '
@NM00516 DC    AL1(56)
@NM00517 DC    H'0'
@NM00518 DC    A(0)
         ORG   ERRORTAB+672
MSG057   DS    CL12
         ORG   MSG057
@NM00519 DC    X'00'
@NM00520 DC    AL1(0)
@NM00521 DC    CL3'   '
@NM00522 DC    AL1(57)
@NM00523 DC    H'0'
@NM00524 DC    A(0)
         ORG   ERRORTAB+684
MSG058   DS    CL12
         ORG   MSG058
@NM00525 DC    X'00'
@NM00526 DC    AL1(0)
@NM00527 DC    CL3'   '
@NM00528 DC    AL1(58)
@NM00529 DC    H'0'
@NM00530 DC    A(0)
         ORG   ERRORTAB+696
MSG059   DS    CL12
         ORG   MSG059
@NM00531 DC    X'00'
@NM00532 DC    AL1(0)
@NM00533 DC    CL3'   '
@NM00534 DC    AL1(59)
@NM00535 DC    H'0'
@NM00536 DC    A(0)
         ORG   ERRORTAB+708
MSG060   DS    CL12
         ORG   MSG060
@NM00537 DC    X'00'
@NM00538 DC    AL1(0)
@NM00539 DC    CL3'   '
@NM00540 DC    AL1(60)
@NM00541 DC    H'0'
@NM00542 DC    A(0)
         ORG   ERRORTAB+720
MSG061   DS    CL12
         ORG   MSG061
@NM00543 DC    X'00'
@NM00544 DC    AL1(0)
@NM00545 DC    CL3'   '
@NM00546 DC    AL1(61)
@NM00547 DC    H'0'
@NM00548 DC    A(0)
         ORG   ERRORTAB+732
MSG062   DS    CL12
         ORG   MSG062
@NM00549 DC    X'00'
@NM00550 DC    AL1(0)
@NM00551 DC    CL3'   '
@NM00552 DC    AL1(62)
@NM00553 DC    H'0'
@NM00554 DC    A(0)
         ORG   ERRORTAB+744
MSG063   DS    CL12
         ORG   MSG063
@NM00555 DC    X'00'
@NM00556 DC    AL1(0)
@NM00557 DC    CL3'   '
@NM00558 DC    AL1(63)
@NM00559 DC    H'0'
@NM00560 DC    A(0)
         ORG   ERRORTAB+756
MSG064   DS    CL12
         ORG   MSG064
@NM00561 DC    X'00'
@NM00562 DC    AL1(0)
@NM00563 DC    CL3'   '
@NM00564 DC    AL1(64)
@NM00565 DC    H'0'
@NM00566 DC    A(0)
         ORG   ERRORTAB+768
MSG065   DS    CL12
         ORG   MSG065
@NM00567 DC    X'00'
@NM00568 DC    AL1(0)
@NM00569 DC    CL3'   '
@NM00570 DC    AL1(65)
@NM00571 DC    H'0'
@NM00572 DC    A(0)
         ORG   ERRORTAB+780
MSG066   DS    CL12
         ORG   MSG066
@NM00573 DC    X'00'
@NM00574 DC    AL1(0)
@NM00575 DC    CL3'   '
@NM00576 DC    AL1(66)
@NM00577 DC    H'0'
@NM00578 DC    A(0)
         ORG   ERRORTAB+792
MSG067   DS    CL12
         ORG   MSG067
@NM00579 DC    X'00'
@NM00580 DC    AL1(0)
@NM00581 DC    CL3'   '
@NM00582 DC    AL1(1)
@NM00583 DC    H'0'
@NM00584 DC    A(0)
         ORG   ERRORTAB+804
MSG068   DS    CL12
         ORG   MSG068
@NM00585 DC    X'00'
@NM00586 DC    AL1(0)
@NM00587 DC    CL3'   '
@NM00588 DC    AL1(68)
@NM00589 DC    H'0'
@NM00590 DC    A(0)
         ORG   ERRORTAB+816
MSG069   DS    CL12
         ORG   MSG069
@NM00591 DC    X'00'
@NM00592 DC    AL1(0)
@NM00593 DC    CL3'   '
@NM00594 DC    AL1(69)
@NM00595 DC    H'0'
@NM00596 DC    A(0)
         ORG   ERRORTAB+828
MSG070   DS    CL12
         ORG   MSG070
@NM00597 DC    X'00'
@NM00598 DC    AL1(0)
@NM00599 DC    CL3'   '
@NM00600 DC    AL1(70)
@NM00601 DC    H'0'
@NM00602 DC    A(0)
         ORG   ERRORTAB+840
MSG071   DS    CL12
         ORG   MSG071
@NM00603 DC    X'00'
@NM00604 DC    AL1(0)
@NM00605 DC    CL3'   '
@NM00606 DC    AL1(71)
@NM00607 DC    H'0'
@NM00608 DC    A(0)
         ORG   ERRORTAB+852
MSG072   DS    CL12
         ORG   MSG072
@NM00609 DC    X'00'
@NM00610 DC    AL1(0)
@NM00611 DC    CL3'   '
@NM00612 DC    AL1(72)
@NM00613 DC    H'0'
@NM00614 DC    A(0)
         ORG   ERRORTAB+864
MSG073   DS    CL12
         ORG   MSG073
@NM00615 DC    X'00'
@NM00616 DC    AL1(0)
@NM00617 DC    CL3'   '
@NM00618 DC    AL1(73)
@NM00619 DC    H'0'
@NM00620 DC    A(0)
         ORG   ERRORTAB+876
MSG074   DS    CL12
         ORG   MSG074
@NM00621 DC    X'00'
@NM00622 DC    AL1(0)
@NM00623 DC    CL3'   '
@NM00624 DC    AL1(74)
@NM00625 DC    H'0'
@NM00626 DC    A(0)
         ORG   ERRORTAB+888
MSG075   DS    CL12
         ORG   MSG075
@NM00627 DC    X'00'
@NM00628 DC    AL1(0)
@NM00629 DC    CL3'   '
@NM00630 DC    AL1(75)
@NM00631 DC    H'0'
@NM00632 DC    A(0)
         ORG   ERRORTAB+900
MSG076   DS    CL12
         ORG   MSG076
@NM00633 DC    X'00'
@NM00634 DC    AL1(0)
@NM00635 DC    CL3'   '
@NM00636 DC    AL1(76)
@NM00637 DC    H'0'
@NM00638 DC    A(0)
         ORG   ERRORTAB+912
MSG077   DS    CL12
         ORG   MSG077
@NM00639 DC    X'00'
@NM00640 DC    AL1(0)
@NM00641 DC    CL3'RD0'
@NM00642 DC    AL1(77)
@NM00643 DC    H'0'
@NM00644 DC    AL4(MENT077)
         ORG   ERRORTAB+924
MSG078   DS    CL12
         ORG   MSG078
@NM00645 DC    X'00'
@NM00646 DC    AL1(0)
@NM00647 DC    CL3'RD0'
@NM00648 DC    AL1(78)
@NM00649 DC    H'0'
@NM00650 DC    AL4(MENT078)
         ORG   ERRORTAB+936
MSG079   DS    CL12
         ORG   MSG079
@NM00651 DC    X'00'
@NM00652 DC    AL1(0)
@NM00653 DC    CL3'RD0'
@NM00654 DC    AL1(79)
@NM00655 DC    H'0'
@NM00656 DC    AL4(MENT079)
         ORG   ERRORTAB+948
MSG080   DS    CL12
         ORG   MSG080
@NM00657 DC    X'00'
@NM00658 DC    AL1(0)
@NM00659 DC    CL3'   '
@NM00660 DC    AL1(0)
@NM00661 DC    H'0'
@NM00662 DC    A(0)
         ORG   ERRORTAB+960
MSG081   DS    CL12
         ORG   MSG081
@NM00663 DC    X'00'
@NM00664 DC    AL1(4)
@NM00665 DC    CL3'   '
@NM00666 DC    AL1(0)
@NM00667 DC    H'0'
@NM00668 DC    A(0)
         ORG   ERRORTAB+972
MSG082   DS    CL12
         ORG   MSG082
@NM00669 DC    X'00'
@NM00670 DC    AL1(8)
@NM00671 DC    CL3'   '
@NM00672 DC    AL1(0)
@NM00673 DC    H'0'
@NM00674 DC    A(0)
         ORG   ERRORTAB+984
MSG083   DS    CL12
         ORG   MSG083
@NM00675 DC    X'00'
@NM00676 DC    AL1(12)
@NM00677 DC    CL3'   '
@NM00678 DC    AL1(0)
@NM00679 DC    H'0'
@NM00680 DC    A(0)
         ORG   ERRORTAB+996
MSG084   DS    CL12
         ORG   MSG084
@NM00681 DC    X'00'
@NM00682 DC    AL1(0)
@NM00683 DC    CL3'   '
@NM00684 DC    AL1(84)
@NM00685 DC    H'0'
@NM00686 DC    A(0)
         ORG   ERRORTAB+1008
MSG085   DS    CL12
         ORG   MSG085
@NM00687 DC    X'00'
@NM00688 DC    AL1(0)
@NM00689 DC    CL3'   '
@NM00690 DC    AL1(85)
@NM00691 DC    H'0'
@NM00692 DC    A(0)
         ORG   ERRORTAB+1020
MSG086   DS    CL12
         ORG   MSG086
@NM00693 DC    X'00'
@NM00694 DC    AL1(0)
@NM00695 DC    CL3'   '
@NM00696 DC    AL1(86)
@NM00697 DC    H'0'
@NM00698 DC    A(0)
         ORG   ERRORTAB+1032
MSG087   DS    CL12
         ORG   MSG087
@NM00699 DC    X'00'
@NM00700 DC    AL1(0)
@NM00701 DC    CL3'   '
@NM00702 DC    AL1(1)
@NM00703 DC    H'0'
@NM00704 DC    A(0)
         ORG   ERRORTAB+1044
MSG088   DS    CL12
         ORG   MSG088
@NM00705 DC    X'00'
@NM00706 DC    AL1(0)
@NM00707 DC    CL3'   '
@NM00708 DC    AL1(88)
@NM00709 DC    H'0'
@NM00710 DC    A(0)
         ORG   ERRORTAB+1056
MSG089   DS    CL12
         ORG   MSG089
@NM00711 DC    X'00'
@NM00712 DC    AL1(0)
@NM00713 DC    CL3'   '
@NM00714 DC    AL1(89)
@NM00715 DC    H'0'
@NM00716 DC    A(0)
         ORG   ERRORTAB+1068
MSG090   DS    CL12
         ORG   MSG090
@NM00717 DC    X'00'
@NM00718 DC    AL1(0)
@NM00719 DC    CL3'UV0'
@NM00720 DC    AL1(1)
@NM00721 DC    H'0'
@NM00722 DC    AL4(MENT090)
         ORG   ERRORTAB+1080
MSG091   DS    CL12
         ORG   MSG091
@NM00723 DC    X'00'
@NM00724 DC    AL1(12)
@NM00725 DC    CL3'UV0'
@NM00726 DC    AL1(3)
@NM00727 DC    H'0'
@NM00728 DC    AL4(MENT091)
         ORG   ERRORTAB+1092
MSG092   DS    CL12
         ORG   MSG092
@NM00729 DC    X'00'
@NM00730 DC    AL1(0)
@NM00731 DC    CL3'UV0'
@NM00732 DC    AL1(5)
@NM00733 DC    H'0'
@NM00734 DC    AL4(MENT092)
         ORG   ERRORTAB+1104
MSG093   DS    CL12
         ORG   MSG093
@NM00735 DC    X'00'
@NM00736 DC    AL1(12)
@NM00737 DC    CL3'UV0'
@NM00738 DC    AL1(4)
@NM00739 DC    H'0'
@NM00740 DC    AL4(MENT093)
         ORG   ERRORTAB+1116
MSG094   DS    CL12
         ORG   MSG094
@NM00741 DC    X'00'
@NM00742 DC    AL1(0)
@NM00743 DC    CL3'   '
@NM00744 DC    AL1(94)
@NM00745 DC    H'0'
@NM00746 DC    A(0)
         ORG   ERRORTAB+1128
MSG095   DS    CL12
         ORG   MSG095
@NM00747 DC    X'00'
@NM00748 DC    AL1(0)
@NM00749 DC    CL3'   '
@NM00750 DC    AL1(95)
@NM00751 DC    H'0'
@NM00752 DC    A(0)
         ORG   ERRORTAB+1140
MSG096   DS    CL12
         ORG   MSG096
@NM00753 DC    X'00'
@NM00754 DC    AL1(0)
@NM00755 DC    CL3'   '
@NM00756 DC    AL1(96)
@NM00757 DC    H'0'
@NM00758 DC    A(0)
         ORG   ERRORTAB+1152
MSG097   DS    CL12
         ORG   MSG097
@NM00759 DC    X'00'
@NM00760 DC    AL1(0)
@NM00761 DC    CL3'   '
@NM00762 DC    AL1(97)
@NM00763 DC    H'0'
@NM00764 DC    A(0)
         ORG   ERRORTAB+1164
MSG098   DS    CL12
         ORG   MSG098
@NM00765 DC    X'00'
@NM00766 DC    AL1(0)
@NM00767 DC    CL3'   '
@NM00768 DC    AL1(98)
@NM00769 DC    H'0'
@NM00770 DC    A(0)
         ORG   ERRORTAB+1176
MSG099   DS    CL12
         ORG   MSG099
@NM00771 DC    X'80'
@NM00772 DC    AL1(0)
@NM00773 DC    CL3'   '
@NM00774 DC    AL1(99)
@NM00775 DC    H'0'
@NM00776 DC    A(0)
         ORG   ERRORTAB+1188
MVARTBL  DS    CL306
         ORG   MVARTBL
MENT001  DS    CL8
         ORG   MENT001
@NM00777 DC    H'3'
@NM00778 DC    H'5'
@NM00779 DC    H'5'
@NM00780 DC    H'44'
         ORG   MVARTBL+8
MENT002  DS    CL8
         ORG   MENT002
@NM00781 DC    H'3'
@NM00782 DC    H'6'
@NM00783 DC    H'5'
@NM00784 DC    H'44'
         ORG   MVARTBL+16
MENT003  DS    CL2
         ORG   MENT003
@NM00785 DC    H'0'
         ORG   MVARTBL+18
MENT004  DS    CL4
         ORG   MENT004
@NM00786 DC    H'1'
@NM00787 DC    H'6'
         ORG   MVARTBL+22
MENT005  DS    CL4
         ORG   MENT005
@NM00788 DC    H'1'
@NM00789 DC    H'5'
         ORG   MVARTBL+26
MENT006  DS    CL4
         ORG   MENT006
@NM00790 DC    H'1'
@NM00791 DC    H'6'
         ORG   MVARTBL+30
MENT007  DS    CL4
         ORG   MENT007
@NM00792 DC    H'1'
@NM00793 DC    H'5'
         ORG   MVARTBL+34
MENT008  DS    CL8
         ORG   MENT008
@NM00794 DC    H'3'
@NM00795 DC    H'5'
@NM00796 DC    H'5'
@NM00797 DC    H'6'
         ORG   MVARTBL+42
MENT009  DS    CL2
         ORG   MENT009
@NM00798 DC    H'0'
         ORG   MVARTBL+44
MENT010  DS    CL8
         ORG   MENT010
@NM00799 DC    H'3'
@NM00800 DC    H'6'
@NM00801 DC    H'17'
@NM00802 DC    H'8'
         ORG   MVARTBL+52
MENT011  DS    CL4
         ORG   MENT011
@NM00803 DC    H'1'
@NM00804 DC    H'44'
         ORG   MVARTBL+56
MENT012  DS    CL8
         ORG   MENT012
@NM00805 DC    H'3'
@NM00806 DC    H'5'
@NM00807 DC    H'5'
@NM00808 DC    H'44'
         ORG   MVARTBL+64
MENT013  DS    CL10
         ORG   MENT013
@NM00809 DC    H'4'
@NM00810 DC    H'2'
@NM00811 DC    H'2'
@NM00812 DC    H'13'
@NM00813 DC    H'44'
         ORG   MVARTBL+74
MENT014  DS    CL8
         ORG   MENT014
@NM00814 DC    H'3'
@NM00815 DC    H'6'
@NM00816 DC    H'5'
@NM00817 DC    H'44'
         ORG   MVARTBL+82
MENT015  DS    CL4
         ORG   MENT015
@NM00818 DC    H'1'
@NM00819 DC    H'44'
         ORG   MVARTBL+86
MENT016  DS    CL8
         ORG   MENT016
@NM00820 DC    H'3'
@NM00821 DC    H'6'
@NM00822 DC    H'5'
@NM00823 DC    H'44'
         ORG   MVARTBL+94
MENT017  DS    CL8
         ORG   MENT017
@NM00824 DC    H'3'
@NM00825 DC    H'6'
@NM00826 DC    H'5'
@NM00827 DC    H'44'
         ORG   MVARTBL+102
MENT018  DS    CL8
         ORG   MENT018
@NM00828 DC    H'3'
@NM00829 DC    H'6'
@NM00830 DC    H'5'
@NM00831 DC    H'44'
         ORG   MVARTBL+110
MENT019  DS    CL8
         ORG   MENT019
@NM00832 DC    H'3'
@NM00833 DC    H'6'
@NM00834 DC    H'4'
@NM00835 DC    H'44'
         ORG   MVARTBL+118
MENT020  DS    CL4
         ORG   MENT020
@NM00836 DC    H'1'
@NM00837 DC    H'44'
         ORG   MVARTBL+122
MENT021  DS    CL8
         ORG   MENT021
@NM00838 DC    H'3'
@NM00839 DC    H'6'
@NM00840 DC    H'5'
@NM00841 DC    H'44'
         ORG   MVARTBL+130
MENT022  DS    CL8
         ORG   MENT022
@NM00842 DC    H'3'
@NM00843 DC    H'6'
@NM00844 DC    H'5'
@NM00845 DC    H'44'
         ORG   MVARTBL+138
MENT023  DS    CL10
         ORG   MENT023
@NM00846 DC    H'4'
@NM00847 DC    H'6'
@NM00848 DC    H'5'
@NM00849 DC    H'17'
@NM00850 DC    H'44'
         ORG   MVARTBL+148
MENT024  DS    CL8
         ORG   MENT024
@NM00851 DC    H'3'
@NM00852 DC    H'6'
@NM00853 DC    H'5'
@NM00854 DC    H'44'
         ORG   MVARTBL+156
MENT025  DS    CL8
         ORG   MENT025
@NM00855 DC    H'3'
@NM00856 DC    H'6'
@NM00857 DC    H'5'
@NM00858 DC    H'17'
         ORG   MVARTBL+164
MENT026  DS    CL4
         ORG   MENT026
@NM00859 DC    H'1'
@NM00860 DC    H'44'
         ORG   MVARTBL+168
MENT027  DS    CL8
         ORG   MENT027
@NM00861 DC    H'3'
@NM00862 DC    H'6'
@NM00863 DC    H'4'
@NM00864 DC    H'44'
         ORG   MVARTBL+176
MENT028  DS    CL8
         ORG   MENT028
@NM00865 DC    H'3'
@NM00866 DC    H'6'
@NM00867 DC    H'5'
@NM00868 DC    H'44'
         ORG   MVARTBL+184
MENT029  DS    CL6
         ORG   MENT029
@NM00869 DC    H'2'
@NM00870 DC    H'4'
@NM00871 DC    H'44'
         ORG   MVARTBL+190
MENT030  DS    CL4
         ORG   MENT030
@NM00872 DC    H'1'
@NM00873 DC    H'4'
         ORG   MVARTBL+194
MENT031  DS    CL4
         ORG   MENT031
@NM00874 DC    H'1'
@NM00875 DC    H'44'
         ORG   MVARTBL+198
MENT032  DS    CL4
         ORG   MENT032
@NM00876 DC    H'1'
@NM00877 DC    H'44'
         ORG   MVARTBL+202
MENT033  DS    CL8
         ORG   MENT033
@NM00878 DC    H'3'
@NM00879 DC    H'17'
@NM00880 DC    H'5'
@NM00881 DC    H'44'
         ORG   MVARTBL+210
MENT034  DS    CL6
         ORG   MENT034
@NM00882 DC    H'2'
@NM00883 DC    H'17'
@NM00884 DC    H'5'
         ORG   MVARTBL+216
MENT035  DS    CL8
         ORG   MENT035
@NM00885 DC    H'3'
@NM00886 DC    H'5'
@NM00887 DC    H'5'
@NM00888 DC    H'44'
         ORG   MVARTBL+224
MENT036  DS    CL6
         ORG   MENT036
@NM00889 DC    H'2'
@NM00890 DC    H'4'
@NM00891 DC    H'2'
         ORG   MVARTBL+230
MENT037  DS    CL4
         ORG   MENT037
@NM00892 DC    H'1'
@NM00893 DC    H'5'
         ORG   MVARTBL+234
MENT038  DS    CL4
         ORG   MENT038
@NM00894 DC    H'1'
@NM00895 DC    H'44'
         ORG   MVARTBL+238
MENT039  DS    CL4
         ORG   MENT039
@NM00896 DC    H'1'
@NM00897 DC    H'5'
         ORG   MVARTBL+242
MENT040  DS    CL4
         ORG   MENT040
@NM00898 DC    H'1'
@NM00899 DC    H'5'
         ORG   MVARTBL+246
MENT041  DS    CL2
         ORG   MENT041
@NM00900 DC    H'0'
         ORG   MVARTBL+248
MENT042  DS    CL10
         ORG   MENT042
@NM00901 DC    H'4'
@NM00902 DC    H'13'
@NM00903 DC    H'6'
@NM00904 DC    H'5'
@NM00905 DC    H'44'
         ORG   MVARTBL+258
MENT043  DS    CL4
         ORG   MENT043
@NM00906 DC    H'1'
@NM00907 DC    H'5'
         ORG   MVARTBL+262
MENT044  DS    CL4
         ORG   MENT044
@NM00908 DC    H'1'
@NM00909 DC    H'4'
         ORG   MVARTBL+266
MENT045  DS    CL6
         ORG   MENT045
@NM00910 DC    H'2'
@NM00911 DC    H'4'
@NM00912 DC    H'44'
         ORG   MVARTBL+272
MENT046  DS    CL6
         ORG   MENT046
@NM00913 DC    H'2'
@NM00914 DC    H'8'
@NM00915 DC    H'44'
         ORG   MVARTBL+278
MENT047  DS    CL2
         ORG   MENT047
@NM00916 DC    H'0'
         ORG   MVARTBL+280
MENT077  DS    CL4
         ORG   MENT077
@NM00917 DC    H'1'
@NM00918 DC    H'6'
         ORG   MVARTBL+284
MENT078  DS    CL4
         ORG   MENT078
@NM00919 DC    H'1'
@NM00920 DC    H'6'
         ORG   MVARTBL+288
MENT079  DS    CL4
         ORG   MENT079
@NM00921 DC    H'1'
@NM00922 DC    H'6'
         ORG   MVARTBL+292
MENT090  DS    CL4
         ORG   MENT090
@NM00923 DC    H'1'
@NM00924 DC    H'2'
         ORG   MVARTBL+296
MENT091  DS    CL4
         ORG   MENT091
@NM00925 DC    H'1'
@NM00926 DC    H'2'
         ORG   MVARTBL+300
MENT092  DS    CL4
         ORG   MENT092
@NM00927 DC    H'1'
@NM00928 DC    H'4'
         ORG   MVARTBL+304
MENT093  DS    CL2
         ORG   MENT093
@NM00929 DC    H'0'
         ORG   MVARTBL+306
EOFIDENT DC    CL9'** EOF **'
STNGPK   DC    CL44'STAGING PACK'
VTOCHDR  DC    CL44'VTOCHEADER'
FMT4DSCB DC    CL44'FORMAT4.DSCB'
FMT4DSN  DS    CL44
         ORG   FMT4DSN
@NM00930 DC    44X'04'
         ORG   FMT4DSN+44
HEADRNM  DC    CL15'REPAIRVWORKFILE'
RD01     DC    CL8'RD01'
BLANK8   DC    CL8'        '
INPUTIND DC    CL1'I'
REPRNG   DC    CL17'REPAIRRANGE'
RANG     DC    CL17'RANGE'
OUTREPK  DC    CL17'OUTREPAIRKEY'
INREPK   DC    CL17'INREPAIRKEY'
INREPRNG DC    CL17'INREPAIRRANGE'
BLANKS   DS    CL44
         ORG   BLANKS
@NM00932 DC    44X'40'
         ORG   BLANKS+44
HEADRKEY DS    CL11
         ORG   HEADRKEY
@NM00933 DC    X'00000000000000'
@NM00934 DC    CL4'REPV'
         ORG   HEADRKEY+11
@00      EQU   00                      EQUATES FOR REGISTERS 0-15
@01      EQU   01
@02      EQU   02
@03      EQU   03
@04      EQU   04
@05      EQU   05
@06      EQU   06
@07      EQU   07
@08      EQU   08
@09      EQU   09
@10      EQU   10
@11      EQU   11
@12      EQU   12
@13      EQU   13
@14      EQU   14
@15      EQU   15
INFDSNPT EQU   @02
RWFPTR1  EQU   @05
WFIORC   EQU   @04
CKIDX    EQU   @02
SRLENCTR EQU   @03
SRPOINT  EQU   @02
SRFINDEX EQU   @04
SAVER13  EQU   @02
OPNPTR   EQU   @02
TESTRC   EQU   @03
LISTLN   EQU   @02
RTNREG   EQU   @15
REG7     EQU   @07
REG8     EQU   @08
REG9     EQU   @09
REG12    EQU   @12
REG13    EQU   @13
REG0     EQU   @00
REG1     EQU   @01
REG10    EQU   @10
REG11    EQU   @11
REG14    EQU   @14
REG15    EQU   @15
REG2     EQU   @02
REG3     EQU   @03
REG4     EQU   @04
REG5     EQU   @05
REG6     EQU   @06
IDCSAEP0 EQU   0
IDCSAGP0 EQU   0
TRACE1   EQU   0
OLDERID1 EQU   TRACE1
TRACE2   EQU   0
OLDERID2 EQU   TRACE2
NEWID2   EQU   TRACE2+95
NEWERID2 EQU   5
LISTTEST EQU   0
CIRAGL   EQU   0
CIRTYPE  EQU   CIRAGL
ALLAGL   EQU   0
ALLSTS   EQU   ALLAGL+24
ALLDSP   EQU   ALLAGL+25
ALLORG   EQU   ALLAGL+26
ALLOPT   EQU   ALLAGL+28
UNITABL  EQU   0
UNITADR  EQU   UNITABL+4
@NM00010 EQU   UNITADR
UNITSTAT EQU   UNITABL+6
IDCIOOP0 EQU   0
IDCIOCL0 EQU   0
IDCIOPO0 EQU   0
IDCIOGT0 EQU   0
IDCIOPT0 EQU   0
IDCIOSI0 EQU   0
IOCSTR   EQU   0
IOCDAD   EQU   IOCSTR
IOCDLN   EQU   IOCSTR+4
IOCTRN   EQU   IOCSTR+8
IOCKYL   EQU   IOCSTR+12
IOCRKP   EQU   IOCSTR+13
IOCDSO   EQU   IOCSTR+16
IOCDSOAM EQU   IOCDSO
IOCRFM   EQU   IOCSTR+17
IOCMAC   EQU   IOCSTR+18
IOCMAC2  EQU   IOCSTR+19
IOCCHP   EQU   IOCSTR+20
IOCMSG   EQU   IOCSTR+21
IOCMSGOP EQU   IOCMSG
IOCDSN   EQU   IOCSTR+32
IOCRBA   EQU   IOCSTR+40
IOCTTR   EQU   IOCRBA
IOCMEM   EQU   IOCSTR+44
IOCKYA   EQU   IOCMEM
IOCNWM   EQU   IOCSTR+48
IOCPTL   EQU   IOCNWM
IOCEXT   EQU   IOCSTR+64
OPNAGL   EQU   0
OPNOPT   EQU   OPNAGL
OPNOPTIN EQU   OPNOPT
OPNOPTUP EQU   OPNOPT
OPNRFM   EQU   OPNAGL+1
OPNTYP   EQU   OPNAGL+2
OPNMOD   EQU   OPNAGL+3
OPNIOC   EQU   OPNAGL+4
OPNDDN   EQU   OPNAGL+8
OPNPWA   EQU   OPNAGL+12
OPNDSN   EQU   OPNAGL+16
OPNDEV   EQU   OPNAGL+24
OPNDSO   EQU   OPNAGL+41
OPNOPT2  EQU   OPNAGL+42
IOINFOPT EQU   0
IOINFDSN EQU   IOINFOPT
UVOLLIST EQU   0
UVOLENT  EQU   UVOLLIST+2
AMSTP011 EQU   0
IDCTPER0 EQU   0
DARGLIST EQU   0
DARGDBP  EQU   DARGLIST
DARGSTID EQU   DARGLIST+8
DARGSMOD EQU   DARGSTID
DARGSENT EQU   DARGSTID+3
DARGILP  EQU   DARGLIST+12
DARGCNT  EQU   DARGLIST+14
DARGARY  EQU   DARGLIST+20
DARGINS  EQU   DARGARY
DARGINL  EQU   DARGARY+2
DARGDTM  EQU   DARGARY+4
FMTLIST  EQU   0
FMTFLGS  EQU   FMTLIST
FMTSPF   EQU   FMTLIST+2
FMTRFNO  EQU   FMTSPF
FMTILEN  EQU   FMTRFNO
FMTIOFF  EQU   FMTLIST+4
FMTTRBC  EQU   FMTIOFF
FMTSTO   EQU   FMTTRBC
FMTOCOL  EQU   FMTLIST+6
FMTCNVF  EQU   FMTLIST+10
ERCNVTAB EQU   0
ERTYPE   EQU   ERCNVTAB
ERCATLG  EQU   ERTYPE
EROPER   EQU   ERCNVTAB+1
ERCATDE  EQU   EROPER
ERCATDL  EQU   EROPER
EROSOPER EQU   ERCNVTAB+2
ERCATRC  EQU   ERCNVTAB+16
ERCPLPT  EQU   ERCNVTAB+20
IDCDB010 EQU   0
DMPITM   EQU   0
DMPARY   EQU   0
DISPL    EQU   0
ALLA     EQU   0
INFIL    EQU   0
INFILPAS EQU   INFIL+1
INFILVAL EQU   INFIL+10
INDS     EQU   0
INDSPAS  EQU   INDS+1
INDSFLG  EQU   INDS+10
INDSVAL  EQU   INDS+21
DSRNG    EQU   0
DRRNG    EQU   0
STAGR    EQU   0
DLENG    EQU   0
DLENGCNT EQU   0
IDONL    EQU   0
DOUTF    EQU   0
DOTDS    EQU   0
DOTDSFLG EQU   DOTDS+10
HEXA     EQU   0
CHARA    EQU   0
VOLSR    EQU   0
VOLSRFLG EQU   VOLSR+10
DCCHR    EQU   0
DREC     EQU   0
VOLDS    EQU   0
VOLDSFLG EQU   VOLDS+10
DSCHR    EQU   0
DSCHH    EQU   0
VOLRR    EQU   0
VOLRRFLG EQU   VOLRR+10
RRCHR    EQU   0
RRCHRLEN EQU   RRCHR
RRCHRVAL EQU   RRCHR+1
RRCHH    EQU   0
RRCHHLEN EQU   RRCHH
RRCHHVAL EQU   RRCHH+1
DKEYLPTR EQU   0
DKEYL    EQU   0
DATALPTR EQU   0
DATAL    EQU   0
DPVTC    EQU   0
DVTCS    EQU   0
DVTCSFLG EQU   DVTCS+10
COPY     EQU   0
CINFL    EQU   0
CINDS    EQU   0
CINDSFLG EQU   CINDS+10
CSRNG    EQU   0
CDSRG    EQU   0
CLEN     EQU   0
CLENCNT  EQU   0
COFIL    EQU   0
COFILPAS EQU   COFIL+1
COFILVAL EQU   COFIL+10
CCATL    EQU   0
CCATLFLG EQU   CCATL+10
CVOLD    EQU   0
CVOLDFLG EQU   CVOLD+10
CDCHR    EQU   0
CDHHR    EQU   0
CVOLS    EQU   0
CVOLSFLG EQU   CVOLS+10
CCCHR    EQU   0
CRECR    EQU   0
CKEYLPTR EQU   0
CKEYL    EQU   0
CDATLPTR EQU   0
CDATL    EQU   0
CVTOC    EQU   0
CVTCS    EQU   0
CVTCSFLG EQU   CVTCS+10
DBLOC    EQU   0
DBFIL    EQU   0
DBFILPAS EQU   DBFIL+1
DBFILVAL EQU   DBFIL+10
DBDS     EQU   0
DBDSPAS  EQU   DBDS+1
DBDSFLG  EQU   DBDS+10
DBDSVAL  EQU   DBDS+21
DBVOL    EQU   0
DBVOLFLG EQU   DBVOL+10
DBCCH    EQU   0
DBCCHLEN EQU   DBCCH
DBCCHVAL EQU   DBCCH+1
DBHHH    EQU   0
DBHHHLEN EQU   DBHHH
DBHHHVAL EQU   DBHHH+1
DBKEY    EQU   0
DBDAT    EQU   0
MNCNT    EQU   0
MINFL    EQU   0
MINFLPAS EQU   MINFL+1
MINFLVAL EQU   MINFL+10
MINDS    EQU   0
MINDSPAS EQU   MINDS+1
MINDSFLG EQU   MINDS+10
MINDSVAL EQU   MINDS+21
MIRK     EQU   0
MIRNG    EQU   0
MOUTF    EQU   0
MOUTFPAS EQU   MOUTF+1
MOUTFVAL EQU   MOUTF+10
MODS     EQU   0
MODSPAS  EQU   MODS+1
MODSFLG  EQU   MODS+10
MODSVAL  EQU   MODS+21
MVTCS    EQU   0
MVTCSFLG EQU   MVTCS+10
MVTCR    EQU   0
MIRVO    EQU   0
MIRVOFLG EQU   MIRVO+10
MIRCH    EQU   0
MIRCHLEN EQU   MIRCH
MIRCHVAL EQU   MIRCH+1
MIDVO    EQU   0
MIDVOFLG EQU   MIDVO+10
MIDCH    EQU   0
MRRVO    EQU   0
MRRVOFLG EQU   MRRVO+10
MRRCH    EQU   0
MRRCHLEN EQU   MRRCH
MRRCHVAL EQU   MRRCH+1
MRRHH    EQU   0
MRRHHLEN EQU   MRRHH
MRRHHVAL EQU   MRRHH+1
MNDOF    EQU   0
MNDST    EQU   0
MNKOF    EQU   0
MNKST    EQU   0
MORVO    EQU   0
MORVOFLG EQU   MORVO+10
MORCH    EQU   0
MORCHLEN EQU   MORCH
MORCHVAL EQU   MORCH+1
MODVO    EQU   0
MODVOFLG EQU   MODVO+10
MODCH    EQU   0
CCMSG    EQU   0
CMMSG    EQU   0
CMVOLFLG EQU   CMMSG+6
CTMSG    EQU   0
CTARRAY  EQU   CTMSG+4
MDAGL    EQU   0
MDFLAGS  EQU   MDAGL+30
MDVTOC   EQU   MDAGL+32
PUAGL    EQU   0
CKAGL    EQU   0
CKFLAGS  EQU   CKAGL+28
EXCLAGL  EQU   0
EXCLFLAG EQU   EXCLAGL+22
EXOARG   EQU   0
EXOPT    EQU   EXOARG+32
EXFLG    EQU   EXOARG+33
EXGARG   EQU   0
EXWRARG  EQU   0
EXRWCHR  EQU   EXWRARG+26
EXSPACE  EQU   EXWRARG+36
EXPARG   EQU   0
EXPDATA  EQU   EXPARG+12
EXPDATAB EQU   0
EXPARRAY EQU   EXPDATAB+4
VS2AGL   EQU   0
VSLABOPT EQU   VS2AGL+28
VS2MSG   EQU   VS2AGL+35
VS2RESOP EQU   VS2AGL+36
VS1AGL   EQU   0
VSSECOPT EQU   VS1AGL+68
VSVTOPT  EQU   VS1AGL+69
VSCATOPT EQU   VS1AGL+70
VSRETURN EQU   VS1AGL+71
VSMSG    EQU   VS1AGL+72
VSRESOPT EQU   VS1AGL+73
RCTAGL   EQU   0
RCTOPT   EQU   RCTAGL+8
STAEPARM EQU   0
STARCVY  EQU   STAEPARM+52
STARETRY EQU   STAEPARM+53
VOLLABEL EQU   0
SV82LIST EQU   0
@NM00072 EQU   SV82LIST+4
SV82DCBP EQU   @NM00072
@NM00073 EQU   SV82LIST+12
SV82WRKP EQU   @NM00073
SRTAGL   EQU   0
LCTINFO  EQU   0
LCTFLAGS EQU   LCTINFO+32
UCTAGL   EQU   0
UCTFLAGS EQU   UCTAGL+68
SELAGL   EQU   0
SELFLAGS EQU   SELAGL+22
DATESAGL EQU   0
DATESOPT EQU   DATESAGL+20
VS3AGL   EQU   0
VS3FLAGS EQU   VS3AGL+58
VSDVTOC  EQU   0
VSDSTAT  EQU   0
VSDSFLG1 EQU   VSDSTAT+16
VSDFLG2  EQU   VSDSTAT+17
VSDSCR   EQU   0
VSDSCRFL EQU   VSDSCR+4
VSDUSAGE EQU   0
VSDDORG  EQU   VSDUSAGE+9
VSDALLOC EQU   VSDUSAGE+10
VSDUSEF  EQU   VSDUSAGE+11
VSDDSORG EQU   VSDUSAGE+16
VSDBLOCK EQU   0
VSDSPACE EQU   VSDBLOCK+12
VSDARRAY EQU   VSDBLOCK+16
VSDVARY  EQU   VSDARRAY+48
IODATA   EQU   0
IODSID   EQU   IODATA+16
IOCSEX   EQU   0
IOCRPL   EQU   IOCSEX+4
IOCWKA   EQU   IOCSEX+12
IOCXAD   EQU   IOCSEX+16
IOCXPM   EQU   IOCSEX+20
IOCFLG   EQU   IOCSEX+32
IOCDEV   EQU   IOCSEX+33
IOCINF   EQU   IOCSEX+34
IOCMOD   EQU   IOCSEX+35
IOCMODRP EQU   IOCMOD
IOCRCV   EQU   IOCSEX+44
IFGRPL   EQU   0
RPLCOMN  EQU   IFGRPL
RPLIDWD  EQU   RPLCOMN
RPLLEN   EQU   RPLIDWD+3
RPLECB   EQU   RPLCOMN+8
RPLFDBWD EQU   RPLCOMN+12
RPLFDBK  EQU   RPLFDBWD+1
RPLRTNCD EQU   RPLFDBK
RPLCNDCD EQU   RPLFDBK+1
RPLCMPON EQU   RPLCNDCD
RPLFDB2  EQU   RPLCMPON
RPLERRCD EQU   RPLCNDCD+1
RPLFDB3  EQU   RPLERRCD
RPLKEYLE EQU   RPLCOMN+16
RPLAREA  EQU   RPLCOMN+32
RPLARG   EQU   RPLCOMN+36
RPLOPTCD EQU   RPLCOMN+40
RPLOPT1  EQU   RPLOPTCD
RPLKGE   EQU   RPLOPT1
RPLECBSW EQU   RPLOPT1
RPLOPT2  EQU   RPLOPTCD+1
RPLADR   EQU   RPLOPT2
RPLUPD   EQU   RPLOPT2
RPLOPT3  EQU   RPLOPTCD+2
RPLNXTRP EQU   RPLCOMN+44
RPLOPTC2 EQU   RPLCOMN+56
RPLOPT5  EQU   RPLOPTC2
RPLWRTYP EQU   RPLOPT5
RPLOPT6  EQU   RPLOPTC2+1
RPLUNTYP EQU   RPLOPT6
RPLOPT7  EQU   RPLOPTC2+2
RPLCNOPT EQU   RPLOPT7
RPLOPT8  EQU   RPLOPTC2+3
RPLRBAR  EQU   RPLCOMN+60
RPLAIXID EQU   RPLRBAR+2
RPLEXTDS EQU   RPLCOMN+68
RPLEXTD1 EQU   RPLEXTDS
RWFHDR   EQU   0
SRPRTARG EQU   0
SRVRECL  EQU   SRPRTARG
SRVREPTR EQU   SRPRTARG+4
SRDSNHDR EQU   SRPRTARG+8
SRVOLPTR EQU   SRPRTARG+12
SRRWFDSN EQU   SRPRTARG+16
SRRWFKEY EQU   SRPRTARG+20
SRERCODE EQU   SRPRTARG+24
SRDSNPTR EQU   SRPRTARG+28
SRSPRECL EQU   SRPRTARG+32
SRRECPTR EQU   SRPRTARG+36
SRCCHHRP EQU   SRPRTARG+40
RWFINFO  EQU   0
RWFDSN   EQU   RWFINFO+8
RWFKEY1  EQU   RWFINFO+82
RWFKEY2  EQU   RWFINFO+93
RWHDRINF EQU   0
RDARG    EQU   0
RDCTLBK  EQU   RDARG+8
RDIOAREA EQU   RDARG+12
RDDARE   EQU   RDARG+16
RDLOCPTR EQU   RDARG+20
RDCHR    EQU   RDARG+26
RDCC     EQU   RDCHR
RDHH     EQU   RDCHR+2
RDRECNUM EQU   RDCHR+4
RDDS     EQU   RDARG+31
RDSPACE  EQU   RDARG+36
RDSPKL   EQU   RDARG+47
RDSPDL   EQU   RDARG+48
RDLENTOT EQU   RDARG+50
RDKLEN   EQU   RDARG+52
RDDLEN   EQU   RDARG+56
INFOAREA EQU   0
INFAREAL EQU   INFOAREA
INFDATAL EQU   INFOAREA+2
INFODSN  EQU   0
INFDSNID EQU   INFODSN
INFDSN   EQU   INFODSN+4
INFOVOL  EQU   0
DEVAREA  EQU   0
DEVDEVTP EQU   DEVAREA
DEVTBYT2 EQU   DEVDEVTP+1
@NM00119 EQU   DEVAREA+8
DEVMAXHH EQU   @NM00119+2
DEVWORD3 EQU   DEVAREA+12
DEVBOH   EQU   DEVWORD3+2
DEVWORD4 EQU   DEVAREA+16
DEV4B1   EQU   DEVWORD4+1
XTNTTBL2 EQU   0
XTN2ENT  EQU   XTNTTBL2
XTN2CHR1 EQU   XTN2ENT+44
XTN2CHR2 EQU   XTN2ENT+48
XTNTTBL  EQU   0
XTNTHDR  EQU   XTNTTBL
XTNHDSN  EQU   XTNTHDR+8
XTNHVOL  EQU   XTNTHDR+53
XTNHCHR1 EQU   XTNTHDR+68
XTNHCHR2 EQU   XTNTHDR+76
XTNTENT  EQU   XTNTTBL+88
XTNTVOL  EQU   XTNTENT+53
XTNTCHR1 EQU   XTNTENT+62
XTNTCHR2 EQU   XTNTENT+70
SPLIST   EQU   0
SPRNAME  EQU   SPLIST+8
RWFR     EQU   0
RWFRCNT  EQU   RWFR+16
RWFRKD   EQU   RWFR+24
LOCTAB   EQU   0
RIOAREA  EQU   0
RIOHDR   EQU   RIOAREA
RPREV    EQU   RIOHDR+2
RKEY     EQU   0
RKEYVOL  EQU   RKEY
RKEYCHR  EQU   RKEY+6
RKEYFLG  EQU   RKEY+11
RKEYFLG2 EQU   RKEYFLG+1
RBUF     EQU   0
RBUFCNT  EQU   RBUF
RBCCHHR  EQU   RBUFCNT
RBKL     EQU   RBUFCNT+5
RBDL     EQU   RBUFCNT+6
RKEYDAT  EQU   RBUF+8
WIOAREA  EQU   0
WBUF     EQU   0
WBUFCNT  EQU   WBUF
WBCCHHR  EQU   WBUFCNT
CTGPL    EQU   0
CTGOPTN1 EQU   CTGPL
CTGOPTN2 EQU   CTGPL+1
CTGEXT   EQU   CTGOPTN2
CTGERASE EQU   CTGOPTN2
CTGSMF   EQU   CTGERASE
CTGREL   EQU   CTGSMF
CTGPURG  EQU   CTGOPTN2
CTGVMNT  EQU   CTGPURG
CTGOPTN3 EQU   CTGPL+2
CTGOPTN4 EQU   CTGPL+3
CTGENT   EQU   CTGPL+4
CTGCAT   EQU   CTGPL+8
CTGDSORG EQU   CTGPL+16
CTGOPTNS EQU   CTGDSORG
CTGDDNM  EQU   CTGPL+20
CTGNEWNM EQU   CTGDDNM
CTGFBFLG EQU   CTGNEWNM+2
CTGJSCB  EQU   CTGPL+24
LINKAGES EQU   0
BACKCHAN EQU   LINKAGES+4
FORCHAIN EQU   LINKAGES+8
SRKLEN   EQU   0
SRDATL   EQU   0
SRHDERHH EQU   0
RCAREA   EQU   0
VARLENCK EQU   0
MSGVAR   EQU   0
MSGVARNO EQU   MSGVAR
MSGLEN   EQU   MSGVAR+2
WFIOKEYW EQU   0
WFIOKEYI EQU   0
RCDHEAD  EQU   0
RCDKEY   EQU   RCDHEAD
RCKRWNM  EQU   RCDHEAD+11
RCDAREA  EQU   0
RWFDANA  EQU   0
AMSTP041 EQU   0
AMSTP042 EQU   0
AMSTP043 EQU   0
AMSTP044 EQU   0
DBDATPTR EQU   0
DBKEYPTR EQU   0
DBLST    EQU   0
DBLSTCNT EQU   0
DBRNG    EQU   0
DMPTRM   EQU   0
DUMP     EQU   0
ERROR    EQU   0
FREC     EQU   0
FULLR    EQU   0
IDCIOCO0 EQU   0
IDCIOIT0 EQU   0
IDCIOST0 EQU   0
IDCIOTM0 EQU   0
IDCIOVY0 EQU   0
IDCIO050 EQU   0
IDCSAAL0 EQU   0
IDCSACA0 EQU   0
IDCSACL0 EQU   0
IDCSACR0 EQU   0
IDCSADE0 EQU   0
IDCSADL0 EQU   0
IDCSADQ0 EQU   0
IDCSAFP0 EQU   0
IDCSAFS0 EQU   0
IDCSAGS0 EQU   0
IDCSAID0 EQU   0
IDCSALC0 EQU   0
IDCSALD0 EQU   0
IDCSALK0 EQU   0
IDCSANQ0 EQU   0
IDCSAPR0 EQU   0
IDCSAPT0 EQU   0
IDCSAQL0 EQU   0
IDCSARC0 EQU   0
IDCSARV0 EQU   0
IDCSASC0 EQU   0
IDCSASI0 EQU   0
IDCSASN0 EQU   0
IDCSASS0 EQU   0
IDCSAST0 EQU   0
IDCSATI0 EQU   0
IDCSAUC0 EQU   0
IDCSAWO0 EQU   0
IDCSA060 EQU   0
IDCST010 EQU   0
MIDSA    EQU   0
MNDAT    EQU   0
MNKEY    EQU   0
MODIF    EQU   0
MODSA    EQU   0
MORK     EQU   0
MOVFL    EQU   0
MVTOC    EQU   0
NEWERID1 EQU   5
GDTTBL   EQU   0
GDTTR1   EQU   GDTTBL+8
GDTTR2   EQU   GDTTBL+12
GDTIOH   EQU   GDTTBL+36
GDTDBG   EQU   GDTTBL+40
GDTSTC   EQU   GDTTBL+44
GDTPRT   EQU   GDTTBL+48
GDTESS   EQU   GDTTBL+52
GDTESA   EQU   GDTTBL+56
GDTRST   EQU   GDTTBL+60
GDTRES   EQU   GDTTBL+64
GDTCAL   EQU   GDTTBL+68
GDTGSP   EQU   GDTTBL+72
GDTFSP   EQU   GDTTBL+76
GDTGPL   EQU   GDTTBL+80
GDTFPL   EQU   GDTTBL+84
GDTLOD   EQU   GDTTBL+88
GDTDEL   EQU   GDTTBL+92
GDTPRL   EQU   GDTTBL+96
GDTEPL   EQU   GDTTBL+100
GDTTIM   EQU   GDTTBL+104
GDTIIO   EQU   GDTTBL+108
GDTTIO   EQU   GDTTBL+112
GDTOPN   EQU   GDTTBL+124
GDTCLS   EQU   GDTTBL+128
GDTGET   EQU   GDTTBL+132
GDTPUT   EQU   GDTTBL+136
GDTPOS   EQU   GDTTBL+140
GDTCPY   EQU   GDTTBL+144
GDTCAT   EQU   GDTTBL+148
GDTSNP   EQU   GDTTBL+164
GDTVFY   EQU   GDTTBL+172
GDTUID   EQU   GDTTBL+192
GDTPMT   EQU   GDTTBL+196
GDTCIR   EQU   GDTTBL+200
GDTLNK   EQU   GDTTBL+204
GDTALC   EQU   GDTTBL+208
GDTDLC   EQU   GDTTBL+212
GDTQAL   EQU   GDTTBL+216
GDTSTW   EQU   GDTTBL+220
GDTSSC   EQU   GDTTBL+224
GDTENQ   EQU   GDTTBL+228
GDTRSV   EQU   GDTTBL+232
GDTDEQ   EQU   GDTTBL+236
GDTSFO   EQU   GDTTBL+240
GDTWTO   EQU   GDTTBL+244
GDTSCR   EQU   GDTTBL+248
GDTUNT   EQU   GDTTBL+252
GDTRCT   EQU   GDTTBL+256
GDTIFO   EQU   GDTTBL+260
GDTEXP   EQU   GDTTBL+264
GDTSTA   EQU   GDTTBL+268
GDTERR   EQU   GDTTBL+272
GDTUNC   EQU   GDTTBL+276
GDTLOC   EQU   GDTTBL+280
FDTTBL   EQU   0
FDTPTR   EQU   FDTTBL+8
REPTBL   EQU   0
REPCB    EQU   REPTBL
REPARFIO EQU   REPCB+12
REPIRWIO EQU   REPCB+16
REPORWIO EQU   REPCB+20
REPIDSOP EQU   REPCB+24
REPIDSAR EQU   REPCB+32
REPSPRIT EQU   REPCB+40
REPIBFPT EQU   REPCB+44
REPBUFF0 EQU   REPCB+52
REPBUFF1 EQU   REPCB+56
REPRWHDI EQU   REPCB+60
REPRWHDO EQU   REPCB+64
REPIXTNT EQU   REPCB+80
REPIINFO EQU   REPCB+92
REPOINFO EQU   REPCB+96
REPRWHAR EQU   REPCB+100
REPRWINA EQU   REPCB+104
REPILCPT EQU   REPCB+116
REPIDEVA EQU   REPCB+124
REPQRPTR EQU   REPCB+132
REPOPAGL EQU   REPCB+144
REPCPPTR EQU   REPCB+148
REPCBEXT EQU   REPTBL+156
REPSRPR  EQU   REPCBEXT+4
REPSRPRT EQU   REPSRPR
REPRC    EQU   REPCBEXT+6
REPRCDCT EQU   REPCBEXT+8
I        EQU   REPCBEXT+12
CKREQ    EQU   REPCBEXT+16
CKRERN   EQU   CKREQ
CKRMVAR  EQU   CKREQ+4
RDCATRC  EQU   REPCBEXT+60
WFIOGUK  EQU   REPCBEXT+64
WFAREA   EQU   REPCBEXT+76
WFIODAD  EQU   WFAREA
WFIODLN  EQU   WFAREA+4
WFIOKYA  EQU   WFAREA+8
WFREQ    EQU   WFAREA+12
WFRTYP   EQU   WFREQ
WFRADD   EQU   WFRTYP
WFRLD    EQU   WFRTYP
WFRGET   EQU   WFRTYP
WFRUPD   EQU   WFRTYP
WFRPOS   EQU   WFRTYP
WFROPT   EQU   WFREQ+1
WFRIN    EQU   WFROPT
WFRUP    EQU   WFROPT
RFIO     EQU   0
RWDEF    EQU   RWFHDR
RWFRDE   EQU   RWFR
RWFRF1   EQU   RWFRDE+11
RWFRF2   EQU   RWFRDE+12
@NM00143 EQU   CTGDDNM
CTGPROB  EQU   @NM00143
CTGREASN EQU   CTGPROB+2
ERRTAB   EQU   ERRORTAB
ERRENT   EQU   ERRTAB
ERRFLAG  EQU   ERRENT
ERRCATLG EQU   ERRFLAG
ERRCNDCD EQU   ERRENT+1
ERRSTMOD EQU   ERRENT+2
ERRSTENT EQU   ERRENT+5
ERRMVPTR EQU   ERRENT+8
RDSPKLDL EQU   RDSPKL
*                                      START UNREFERENCED COMPONENTS
@NM00182 EQU   ERRENT+6
CTGREAS2 EQU   CTGREASN+1
CTGREAS1 EQU   CTGREASN
CTGMODID EQU   CTGPROB
@NM00131 EQU   RWFRDE+15
RWFROV   EQU   RWFRDE+14
@NM00130 EQU   RWFRDE
RWFHKLN  EQU   RWDEF+92
RWFHDLN  EQU   RWDEF+90
RWFHFT   EQU   RWDEF+89
@NM00110 EQU   RWDEF
REPENQSW EQU   REPCBEXT+90
@NM00109 EQU   WFROPT
@NM00108 EQU   WFRTYP
@NM00107 EQU   REPCBEXT+75
@NM00106 EQU   CKREQ+2
@NM00105 EQU   REPCBEXT+15
K        EQU   REPCBEXT+14
J        EQU   REPCBEXT+13
@NM00104 EQU   REPSRPR+1
@NM00103 EQU   REPSRPR
REPR1LN  EQU   REPCBEXT+2
REPR0LN  EQU   REPCBEXT
REPCDSOP EQU   REPCB+152
REPEXOAR EQU   REPCB+140
REPALLAG EQU   REPCB+136
REPODEVA EQU   REPCB+128
REPOLCPT EQU   REPCB+120
REPOSYSI EQU   REPCB+112
REPISYSI EQU   REPCB+108
REPOXTNT EQU   REPCB+88
REPOXTN2 EQU   REPCB+84
REPIXTN2 EQU   REPCB+76
REPOUTCL EQU   REPCB+72
REPINCL  EQU   REPCB+68
REPOBFPT EQU   REPCB+48
REPODSAR EQU   REPCB+36
REPODSOP EQU   REPCB+28
REPRESER EQU   REPCB
FDTVERB  EQU   FDTTBL
GDTECT   EQU   GDTTBL+188
GDTPSB   EQU   GDTTBL+184
GDTUPT   EQU   GDTTBL+180
GDTCMB   EQU   GDTTBL+176
GDTSPR   EQU   GDTTBL+168
@NM00001 EQU   GDTTBL+160
GDTABH   EQU   GDTTBL+156
GDTABT   EQU   GDTTBL+152
GDTTOH   EQU   GDTTBL+120
GDTRIP   EQU   GDTTBL+116
GDTSAH   EQU   GDTTBL+32
GDTTPH   EQU   GDTTBL+28
GDTRIH   EQU   GDTTBL+24
GDTSTH   EQU   GDTTBL+20
GDTDBH   EQU   GDTTBL+16
GDTPRM   EQU   GDTTBL+4
GDTHDR   EQU   GDTTBL
@NM00931 EQU   RCDHEAD+26
IDBYTES  EQU   LINKAGES
CTGFIELD EQU   CTGPL+28
CTGPSWD  EQU   CTGJSCB
@NM00142 EQU   CTGFBFLG
CTGNGDSN EQU   CTGFBFLG
CTGGDGB  EQU   CTGFBFLG
CTGKEEP  EQU   CTGFBFLG
CTGPAR   EQU   CTGFBFLG
CTGFDBK  EQU   CTGNEWNM
CTGNOFLD EQU   CTGPL+19
CTGTYPE  EQU   CTGPL+18
@NM00141 EQU   CTGDSORG
CTGWKA   EQU   CTGPL+12
CTGCVOL  EQU   CTGCAT
CTGFVT   EQU   CTGENT
@NM00140 EQU   CTGOPTN4
CTGBYPMT EQU   CTGOPTN4
@NM00139 EQU   CTGOPTN4
CTGDOCAT EQU   CTGOPTN4
CTGLBASE EQU   CTGOPTN4
CTGAM0   EQU   CTGOPTN3
CTGNUM   EQU   CTGOPTN3
CTGSRH   EQU   CTGOPTN3
CTGGDGL  EQU   CTGOPTN3
CTGSUPLT EQU   CTGOPTN3
CTGFUNC  EQU   CTGOPTN3
@NM00138 EQU   CTGOPTN2
CTGSCR   EQU   CTGOPTN2
CTGOVRID EQU   CTGOPTN2
CTGDISC  EQU   CTGOPTN2
CTGGTNXT EQU   CTGOPTN2
CTGRCATN EQU   CTGVMNT
CTGGTALL EQU   CTGREL
CTGNSVS  EQU   CTGEXT
CTGGENLD EQU   CTGOPTN1
CTGCNAME EQU   CTGOPTN1
CTGNAME  EQU   CTGOPTN1
CTGREAD  EQU   CTGOPTN1
CTGUPD   EQU   CTGOPTN1
CTGCI    EQU   CTGOPTN1
CTGMAST  EQU   CTGOPTN1
CTGBYPSS EQU   CTGOPTN1
WKEYDAT  EQU   WBUF+8
WBDL     EQU   WBUFCNT+6
WBKL     EQU   WBUFCNT+5
WBREC    EQU   WBCCHHR+4
WBHH     EQU   WBCCHHR+2
WBCC     EQU   WBCCHHR
WBUFF    EQU   WIOAREA+4
WNUMREC  EQU   WIOAREA
RBREC    EQU   RBCCHHR+4
RBHH     EQU   RBCCHHR+2
RBCC     EQU   RBCCHHR
@NM00137 EQU   RKEYFLG+4
RKEYFLG3 EQU   RKEYFLG+3
RKEYFLG1 EQU   RKEYFLG
RKEYR    EQU   RKEYCHR+4
RKEYHH   EQU   RKEYCHR+2
RKEYCC   EQU   RKEYCHR
RBUFF    EQU   RIOAREA+282
@NM00136 EQU   RIOHDR+26
@NM00135 EQU   RIOHDR+10
RNUMREC  EQU   RIOHDR+8
@NM00134 EQU   RIOHDR+7
RPREVR   EQU   RPREV+4
RPREVHH  EQU   RPREV+2
RPREVCC  EQU   RPREV
@NM00133 EQU   RIOHDR+1
RFIRST   EQU   RIOHDR
LOCDLEN  EQU   LOCTAB+18
LOCKLEN  EQU   LOCTAB+17
@NM00132 EQU   LOCTAB+16
LOCCNTFD EQU   LOCTAB+8
LOCRCKD  EQU   LOCTAB+6
LOCRCNT  EQU   LOCTAB+4
LOCADDR  EQU   LOCTAB
RWFRDLN  EQU   RWFRCNT+6
RWFRKLN  EQU   RWFRCNT+5
RWFRR    EQU   RWFRCNT+4
RWFRHH   EQU   RWFRCNT+2
RWFRCC   EQU   RWFRCNT
RWFRFLG  EQU   RWFR+11
RWFRKEY  EQU   RWFR
SPRVOL   EQU   SPRNAME+1
SPRLEN   EQU   SPRNAME
SPQNAME  EQU   SPLIST
@NM00129 EQU   XTNTENT+75
XTNTR2   EQU   XTNTCHR2+4
XTNTHH2  EQU   XTNTCHR2+2
XTNTCC2  EQU   XTNTCHR2
@NM00128 EQU   XTNTENT+67
XTNTR1   EQU   XTNTCHR1+4
XTNTHH1  EQU   XTNTCHR1+2
XTNTCC1  EQU   XTNTCHR1
@NM00127 EQU   XTNTENT+59
XTNTVOLN EQU   XTNTENT+52
XTNTDSN  EQU   XTNTENT+8
XTNTDDN  EQU   XTNTENT
@NM00126 EQU   XTNTHDR+85
XTNHMODE EQU   XTNTHDR+84
@NM00125 EQU   XTNTHDR+81
XTNHR2   EQU   XTNHCHR2+4
XTNHHH2  EQU   XTNHCHR2+2
XTNHCC2  EQU   XTNHCHR2
@NM00124 EQU   XTNTHDR+73
XTNHR1   EQU   XTNHCHR1+4
XTNHHH1  EQU   XTNHCHR1+2
XTNHCC1  EQU   XTNHCHR1
XTNHPWD  EQU   XTNTHDR+60
@NM00123 EQU   XTNTHDR+59
XTNHVOLN EQU   XTNTHDR+52
XTNHDDN  EQU   XTNTHDR
XTN2HH2  EQU   XTN2CHR2+2
XTN2CC2  EQU   XTN2CHR2
XTN2HH1  EQU   XTN2CHR1+2
XTN2CC1  EQU   XTN2CHR1
XTN2DSN  EQU   XTN2ENT
DEVWORD5 EQU   DEVAREA+20
@NM00122 EQU   DEV4B1+1
@NM00121 EQU   DEV4B1
INF4FLG  EQU   DEV4B1
@NM00120 EQU   DEV4B1
DEVKC    EQU   DEVWORD4
DEVBOH2  EQU   DEVBOH+1
DEVBOH1  EQU   DEVBOH
DEVTC    EQU   DEVWORD3
DEVMAXCC EQU   @NM00119
DEVMAXBK EQU   DEVAREA+4
DEVTBYT4 EQU   DEVDEVTP+3
DEVTBYT3 EQU   DEVDEVTP+2
@NM00118 EQU   DEVTBYT2
DEVRVDEV EQU   DEVTBYT2
@NM00117 EQU   DEVTBYT2
DEVTBYT1 EQU   DEVDEVTP
INFVOL   EQU   INFOVOL+4
INFVOLLN EQU   INFOVOL+2
INFVOLID EQU   INFOVOL
INFDSNLN EQU   INFODSN+2
INFAREA  EQU   INFOAREA+4
RDFUNC   EQU   RDARG+46
@NM00116 EQU   RDSPACE+8
@NM00115 EQU   RDSPACE+6
@NM00114 EQU   RDSPACE+4
@NM00113 EQU   RDSPACE+1
@NM00112 EQU   RDSPACE
RDRWPKLN EQU   RDARG+32
RDCCWCNT EQU   RDARG+24
RDRES    EQU   RDARG
RWHDRDLN EQU   RWHDRINF+6
RWHDRKLN EQU   RWHDRINF+5
@NM00111 EQU   RWHDRINF+1
RWHDRFIX EQU   RWHDRINF
RWFKCHR2 EQU   RWFKEY2+6
RWFKVOL2 EQU   RWFKEY2
RWFKCHR1 EQU   RWFKEY1+6
RWFKVOL1 EQU   RWFKEY1
RWFVOL   EQU   RWFINFO+52
RWFDDN   EQU   RWFINFO
RWFHFM   EQU   RWFHDR+99
RWFHDSNU EQU   RWFHDR+55
RWFHDSNR EQU   RWFHDR+11
RWFHKEY  EQU   RWFHDR
RPLERMSA EQU   RPLCOMN+72
RPLEMLEN EQU   RPLCOMN+70
RPLACTIV EQU   RPLCOMN+69
RPLBRANC EQU   RPLEXTD1
RPLNIB   EQU   RPLEXTD1
@NM00102 EQU   RPLEXTD1
RPLEXIT  EQU   RPLEXTD1
RPLNEXIT EQU   RPLEXTD1
RPLEXSCH EQU   RPLEXTD1
RPLDDDD  EQU   RPLRBAR+4
@NM00101 EQU   RPLRBAR+3
@NM00100 EQU   RPLAIXID
RPLAXPKP EQU   RPLAIXID
RPLAIXPC EQU   RPLRBAR
RPLRSV88 EQU   RPLOPT8
RPLUNCON EQU   RPLOPT8
RPLACTV  EQU   RPLOPT8
RPLSESS  EQU   RPLOPT8
RPLPEND  EQU   RPLOPT8
RPLODPRM EQU   RPLOPT8
RPLODACP EQU   RPLOPT8
RPLODACQ EQU   RPLOPT8
RPLRSV78 EQU   RPLOPT7
RPLRSV77 EQU   RPLOPT7
RPLRLSOP EQU   RPLOPT7
RPLTPOST EQU   RPLOPT7
RPLQOPT  EQU   RPLOPT7
RPLCNIMM EQU   RPLCNOPT
RPLCNANY EQU   RPLCNOPT
RPLCNALL EQU   RPLCNOPT
RPLRSV68 EQU   RPLOPT6
RPLRSV67 EQU   RPLOPT6
RPLLOCK  EQU   RPLOPT6
RPLNCOND EQU   RPLOPT6
RPLCOND  EQU   RPLOPT6
RPLEOT   EQU   RPLUNTYP
RPLEOM   EQU   RPLUNTYP
RPLEOB   EQU   RPLUNTYP
RPLWROPT EQU   RPLOPT5
RPLNODE  EQU   RPLOPT5
RPLERACE EQU   RPLWRTYP
RPLEAU   EQU   RPLWRTYP
RPLNERAS EQU   RPLWRTYP
RPLPSOPT EQU   RPLOPT5
RPLSSNIN EQU   RPLOPT5
RPLDLGIN EQU   RPLOPT5
RPLBUFL  EQU   RPLCOMN+52
RPLRLEN  EQU   RPLCOMN+48
RPLCHAIN EQU   RPLNXTRP
RPLOPT4  EQU   RPLOPTCD+3
RPLALIGN EQU   RPLOPT3
RPLFMT   EQU   RPLOPT3
RPLFLD   EQU   RPLOPT3
RPLVFY   EQU   RPLOPT3
RPLBLK   EQU   RPLOPT3
RPLSFORM EQU   RPLOPT3
RPLEODS  EQU   RPLOPT3
RPLNSP   EQU   RPLOPT2
@NM00099 EQU   RPLOPT2
RPLLRD   EQU   RPLOPT2
RPLBWD   EQU   RPLOPT2
RPLCNV   EQU   RPLOPT2
RPLADD   EQU   RPLADR
RPLKEY   EQU   RPLOPT2
RPLECBIN EQU   RPLECBSW
RPLGEN   EQU   RPLOPT1
RPLASY   EQU   RPLOPT1
RPLSKP   EQU   RPLOPT1
RPLSEQ   EQU   RPLOPT1
RPLDIR   EQU   RPLOPT1
RPLLOC   EQU   RPLOPT1
RPLDAF   EQU   RPLARG+2
RPLSAF   EQU   RPLARG
RPLTCBPT EQU   RPLCOMN+28
RPLDACB  EQU   RPLCOMN+24
RPLCCHAR EQU   RPLCOMN+20
RPLSTRID EQU   RPLCOMN+18
RPLKEYL  EQU   RPLKEYLE
RPLRDSOH EQU   RPLFDB3
RPLRLG   EQU   RPLFDB3
RPLLGFRC EQU   RPLFDB3
RPLREOT  EQU   RPLFDB3
RPLREOM  EQU   RPLFDB3
RPLREOB  EQU   RPLFDB3
RPLSV32  EQU   RPLFDB3
RPLUINPT EQU   RPLFDB3
RPLSTSAV EQU   RPLFDB2
RPLCUERR EQU   RPLFDB2
RPLDLGFL EQU   RPLFDB2
RPLIOERR EQU   RPLFDB2
RPLDVUNS EQU   RPLFDB2
RPLATND  EQU   RPLFDB2
RPLRVID  EQU   RPLFDB2
RPLERLK  EQU   RPLFDB2
RPLERREG EQU   RPLRTNCD
RPLSTAT  EQU   RPLFDBWD
RPLPOST  EQU   RPLECB
RPLWAIT  EQU   RPLECB
RPLPLHPT EQU   RPLCOMN+4
RPLLEN2  EQU   RPLLEN
RPLREQ   EQU   RPLIDWD+2
RPLSTYP  EQU   RPLIDWD+1
RPLID    EQU   RPLIDWD
@NM00098 EQU   IOCRCV
IOCRCVRA EQU   IOCRCV
IOCRCVXM EQU   IOCRCV
IOCVLN   EQU   IOCSEX+42
IOCDNM   EQU   IOCSEX+40
IOCDLM   EQU   IOCSEX+36
IOCMODEX EQU   IOCMOD
IOCMODXM EQU   IOCMOD
IOCMODUB EQU   IOCMOD
IOCMODRG EQU   IOCMOD
IOCMODDY EQU   IOCMOD
IOCMODRR EQU   IOCMOD
IOCMODPD EQU   IOCMOD
IOCINFR1 EQU   IOCINF
IOCINFCT EQU   IOCINF
IOCINFDO EQU   IOCINF
IOCINFAC EQU   IOCINF
IOCINFQX EQU   IOCINF
IOCINFND EQU   IOCINF
IOCINFAE EQU   IOCINF
IOCINFPT EQU   IOCINF
@NM00097 EQU   IOCDEV
IOCDEVUR EQU   IOCDEV
IOCDEVMT EQU   IOCDEV
IOCDEVDA EQU   IOCDEV
@NM00096 EQU   IOCFLG
IOCFLGSP EQU   IOCFLG
IOCFLGOE EQU   IOCFLG
IOCFLGOP EQU   IOCFLG
IOCFLGIO EQU   IOCFLG
IOCFLGEF EQU   IOCFLG
IOCFLGDF EQU   IOCFLG
IOCFLGEX EQU   IOCFLG
IOCSID   EQU   IOCSEX+28
IOCNIO   EQU   IOCSEX+24
@NM00095 EQU   IOCXPM+2
IOCEXL   EQU   IOCXPM
IOCEXA   EQU   IOCXAD
IOCLRP   EQU   IOCSEX+10
IOCCBL   EQU   IOCSEX+8
IOCDEC   EQU   IOCRPL
IOCCBA   EQU   IOCSEX
@NM00094 EQU   IODATA+64
IODAEI   EQU   IODATA+60
@NM00093 EQU   IODATA+56
IODIOX   EQU   IODATA+52
IODOCS   EQU   IODATA+48
IODICS   EQU   IODATA+44
IODOSO   EQU   IODATA+40
IODOSS   EQU   IODATA+36
IODEOD   EQU   IODATA+32
@NM00092 EQU   IODATA+30
@NM00091 EQU   IODATA+28
IODOEV   EQU   IODATA+24
IODIEV   EQU   IODATA+20
IODINC   EQU   IODSID+2
IODMID   EQU   IODSID
IODXTN   EQU   IODATA+12
IODADD   EQU   IODATA+8
IODMSG   EQU   IODATA+4
IODIOC   EQU   IODATA
VSDDSN   EQU   VSDARRAY+4
VSDVOLCT EQU   VSDARRAY
VSDFMT0  EQU   VSDBLOCK+8
VSDVTOCS EQU   VSDBLOCK+4
VSDELEM  EQU   VSDBLOCK
VSDFREE  EQU   VSDUSAGE+24
VSDALLC  EQU   VSDUSAGE+19
VSDDSOR3 EQU   VSDDSORG+2
@NM00090 EQU   VSDDSORG
VSDSCAL  EQU   VSDUSAGE+12
@NM00089 EQU   VSDUSEF
VSDCALFR EQU   VSDUSEF
@NM00088 EQU   VSDALLOC
VSDABSTR EQU   VSDALLOC
VSDABLK  EQU   VSDALLOC
VSDATRK  EQU   VSDALLOC
VSDACYL  EQU   VSDALLOC
@NM00087 EQU   VSDDORG
VSDOU    EQU   VSDDORG
VSDOIS   EQU   VSDDORG
VSDODA   EQU   VSDDORG
VSDOUN   EQU   VSDDORG
VSDOPS   EQU   VSDDORG
VSDOPO   EQU   VSDDORG
VSDEXTS  EQU   VSDUSAGE+8
VSDSECAL EQU   VSDUSAGE+4
VSDFTRK  EQU   VSDUSAGE+2
VSDTRKS  EQU   VSDUSAGE
@NM00086 EQU   VSDSCR+5
@NM00085 EQU   VSDSCRFL
VSDVSAM  EQU   VSDSCRFL
VSDCATLC EQU   VSDSCRFL
VSDACBPT EQU   VSDSCR
VSDPRTC  EQU   VSDSTAT+25
VSDCAT   EQU   VSDSTAT+22
VSDEXP   EQU   VSDSTAT+20
VSDCRE   EQU   VSDSTAT+18
@NM00084 EQU   VSDFLG2
VSDERROR EQU   VSDFLG2
VSDPROT  EQU   VSDFLG2
VSDPWW   EQU   VSDFLG2
VSDPWR   EQU   VSDFLG2
@NM00083 EQU   VSDSFLG1
VSDCVSAM EQU   VSDSFLG1
VSDCATLG EQU   VSDSFLG1
VSDVSAME EQU   VSDSFLG1
VSDVSAMC EQU   VSDSFLG1
VSDVTOCE EQU   VSDSFLG1
VSDVTOCC EQU   VSDSFLG1
VSDOWNER EQU   VSDSTAT+8
VSDEXPIR EQU   VSDSTAT+4
VSDCREAT EQU   VSDSTAT
VSDFRCCL EQU   VSDVTOC+21
@NM00082 EQU   VSDVTOC+20
VSDFREXT EQU   VSDVTOC+16
@NM00081 EQU   VSDVTOC+15
VSDFRTRK EQU   VSDVTOC+11
@NM00080 EQU   VSDVTOC+10
VSDFRCYL EQU   VSDVTOC+6
@NM00079 EQU   VSDVTOC
@NM00078 EQU   VS3FLAGS
VS3SYSNM EQU   VS3FLAGS
VS3UNCAT EQU   VS3FLAGS
VS3SCR   EQU   VS3FLAGS
VS3USAGE EQU   VS3FLAGS
VS3STAT  EQU   VS3FLAGS
VS3DD    EQU   VS3AGL+50
VS3VOL   EQU   VS3AGL+44
VS3POOL  EQU   VS3AGL+40
VS3DEV   EQU   VS3AGL+36
VS3UCBP  EQU   VS3AGL+32
VS3CREAT EQU   VS3AGL+28
VS3EXPIR EQU   VS3AGL+24
VS3AST   EQU   VS3AGL+22
VS3LEVLN EQU   VS3AGL+20
VS3LEVP  EQU   VS3AGL+16
VS3EXDSP EQU   VS3AGL+12
VS3LISTP EQU   VS3AGL+8
VS3HEAD  EQU   VS3AGL
@NM00077 EQU   DATESOPT
DATDAYOP EQU   DATESOPT
DATDTEOP EQU   DATESOPT
DATSUB   EQU   DATESOPT
DATADD   EQU   DATESOPT
DATRETRN EQU   DATESAGL+16
DATDAYS  EQU   DATESAGL+12
DATDATE  EQU   DATESAGL+8
DATHEAD  EQU   DATESAGL
@NM00076 EQU   SELFLAGS
SELVOL   EQU   SELAGL+16
SELDDNP  EQU   SELAGL+12
SELUCBP  EQU   SELAGL+8
SELHEAD  EQU   SELAGL
@NM00075 EQU   UCTFLAGS
UCTVSCAT EQU   UCTFLAGS
UCTDD    EQU   UCTAGL+60
UCTVOLP  EQU   UCTAGL+56
UCTACBP  EQU   UCTAGL+52
UCTDSN   EQU   UCTAGL+8
UCTHEAD  EQU   UCTAGL
@NM00074 EQU   LCTFLAGS
LCTVSCAT EQU   LCTFLAGS
LCTOWNER EQU   LCTINFO+24
LCTEXPIR EQU   LCTINFO+20
LCTCREAT EQU   LCTINFO+16
LCTACBP  EQU   LCTINFO+12
LCTMULVC EQU   LCTINFO+8
LCTHEAD  EQU   LCTINFO
SRTWORKP EQU   SRTAGL+28
SRTFLDLN EQU   SRTAGL+24
SRTPOSIT EQU   SRTAGL+20
SRTLEN   EQU   SRTAGL+16
SRTNUM   EQU   SRTAGL+12
SRTADDR  EQU   SRTAGL+8
SRTHEAD  EQU   SRTAGL
SV82DEBP EQU   SV82WRKP
SV82TTRP EQU   SV82LIST+8
SV82VOLP EQU   SV82DCBP
SV82UCBP EQU   SV82LIST+1
SV82CODE EQU   SV82LIST
VOLRESV3 EQU   VOLLABEL+55
VOLOWNER EQU   VOLLABEL+45
VOLRESV1 EQU   VOLLABEL+20
VOLVTOC  EQU   VOLLABEL+15
VOLSECTY EQU   VOLLABEL+14
VOLSERNO EQU   VOLLABEL+8
VOLNO    EQU   VOLLABEL+7
VOLLABI  EQU   VOLLABEL+4
VOLKEY   EQU   VOLLABEL
STAVTTR  EQU   STAEPARM+54
@NM00071 EQU   STARETRY
STAVTOC  EQU   STARETRY
STAOFF   EQU   STARETRY
STAIO05  EQU   STARETRY
@NM00070 EQU   STARCVY
STACLEAR EQU   STARCVY
STAVPOST EQU   STARCVY
STAVENQ  EQU   STARCVY
STAVDMNT EQU   STARCVY
STAVMNT  EQU   STARCVY
STATCB   EQU   STAEPARM+48
STARTADD EQU   STAEPARM+44
STAEXSAV EQU   STAEPARM+40
STARTSAV EQU   STAEPARM+36
STARTTR  EQU   STAEPARM+32
@NM00069 EQU   STAEPARM+30
STARVOL  EQU   STAEPARM+24
STARUCB  EQU   STAEPARM+20
@NM00068 EQU   STAEPARM+18
STAVVOL  EQU   STAEPARM+12
STAVUCB  EQU   STAEPARM+8
STAHEAD  EQU   STAEPARM
RCTDSET  EQU   RCTAGL+32
RCTNVOL  EQU   RCTAGL+26
RCTOVOL  EQU   RCTAGL+20
RCTNDEV  EQU   RCTAGL+16
RCTODEV  EQU   RCTAGL+12
@NM00067 EQU   RCTAGL+10
@NM00066 EQU   RCTOPT
RCTVOL   EQU   RCTOPT
RCTDEV   EQU   RCTOPT
RCTHEAD  EQU   RCTAGL
@NM00065 EQU   VSRESOPT
VSREAL   EQU   VSRESOPT
VSRES    EQU   VSRESOPT
@NM00064 EQU   VSMSG
VSTOV    EQU   VSMSG
VSFROMV  EQU   VSMSG
@NM00063 EQU   VSRETURN
VSUCAT   EQU   VSRETURN
VSVSAM   EQU   VSRETURN
@NM00062 EQU   VSCATOPT
VSLIST   EQU   VSCATOPT
VSSERIAL EQU   VSCATOPT
VSDEVICE EQU   VSCATOPT
@NM00061 EQU   VSVTOPT
VSVSFLAG EQU   VSVTOPT
VSALTTRK EQU   VSVTOPT
VSTIME   EQU   VSVTOPT
VSUCMAST EQU   VSSECOPT
VSOPCAT  EQU   VSSECOPT
VSUCTEST EQU   VSSECOPT
VSWRITE  EQU   VSSECOPT
VSREAD   EQU   VSSECOPT
VSNONONV EQU   VSSECOPT
VSMASTER EQU   VSSECOPT
VSNOVSAM EQU   VSSECOPT
VSODEVP  EQU   VS1AGL+64
VSOSERP  EQU   VS1AGL+60
VSDEVP   EQU   VS1AGL+56
VSSERP   EQU   VS1AGL+52
VSPFILEP EQU   VS1AGL+48
VSPSWDP  EQU   VS1AGL+44
VSCATDDP EQU   VS1AGL+40
VSACBP   EQU   VS1AGL+36
VSCATP   EQU   VS1AGL+32
VSNXTATP EQU   VS1AGL+28
VSNUMATP EQU   VS1AGL+24
VSIOP    EQU   VS1AGL+20
VSFILEP  EQU   VS1AGL+16
VSVOLP   EQU   VS1AGL+12
VSUCBP   EQU   VS1AGL+8
VSHEAD   EQU   VS1AGL
VSVTOCPT EQU   VS2AGL+48
@NM00060 EQU   VS2AGL+45
VSDDNAME EQU   VS2AGL+37
@NM00059 EQU   VS2RESOP
VS2REAL  EQU   VS2RESOP
VS2RES   EQU   VS2RESOP
@NM00058 EQU   VS2MSG
VS2TOV   EQU   VS2MSG
VSVOLUME EQU   VS2AGL+29
@NM00057 EQU   VSLABOPT
VSNOVTOC EQU   VSLABOPT
VSVOLSER EQU   VSLABOPT
VSOWNER  EQU   VSLABOPT
VSIOBKPT EQU   VS2AGL+24
VSVOLPTR EQU   VS2AGL+20
VSOWNPTR EQU   VS2AGL+16
VSVTOCSZ EQU   VS2AGL+12
VSUCBPTR EQU   VS2AGL+8
VS2HEAD  EQU   VS2AGL
EXPDATAL EQU   EXPARRAY+6
@NM00056 EQU   EXPARRAY+5
EXPKEYLN EQU   EXPARRAY+4
EXPDATAP EQU   EXPARRAY
EXPRECNO EQU   EXPDATAB
EXPCCHHR EQU   EXPARG+16
EXPCTLBK EQU   EXPARG+8
EXPHEAD  EQU   EXPARG
EXRWFUN  EQU   EXWRARG+46
@NM00055 EQU   EXSPACE+8
@NM00054 EQU   EXSPACE+6
@NM00053 EQU   EXSPACE+4
@NM00052 EQU   EXSPACE+1
@NM00051 EQU   EXSPACE
EXRWKDLN EQU   EXWRARG+32
@NM00050 EQU   EXWRARG+31
EXRECNUM EQU   EXRWCHR+4
EXHH     EQU   EXRWCHR+2
EXCC     EQU   EXRWCHR
EXCCWCNT EQU   EXWRARG+24
EXLOCPTR EQU   EXWRARG+20
EXRWDARE EQU   EXWRARG+16
EXRWIOAR EQU   EXWRARG+12
EXRWCTBL EQU   EXWRARG+8
EXRWRES  EQU   EXWRARG
EXGDATAL EQU   EXGARG+30
@NM00049 EQU   EXGARG+29
EXGKEYLN EQU   EXGARG+28
EXGDATAP EQU   EXGARG+24
EXGRECNO EQU   EXGARG+20
EXGCCHH2 EQU   EXGARG+16
EXGCCHH1 EQU   EXGARG+12
EXGCTLBK EQU   EXGARG+8
EXGHEAD  EQU   EXGARG
EXOVTH   EQU   EXFLG
EXORVT   EQU   EXFLG
EXORDS   EQU   EXFLG
EXOSPK   EQU   EXFLG
EXORVS   EQU   EXFLG
@NM00048 EQU   EXFLG
EXOREAD  EQU   EXFLG
@NM00047 EQU   EXOPT
EXOREP   EQU   EXOPT
EXOVTOC  EQU   EXOPT
EXONEW   EQU   EXOPT
EXOPASS  EQU   EXOPT
EXOLAB   EQU   EXOPT
EXOTAB   EQU   EXOPT
EXOCTLBK EQU   EXOARG+28
EXOEXT   EQU   EXOARG+24
EXOUCB   EQU   EXOARG+20
EXOVSN   EQU   EXOARG+16
EXODSN   EQU   EXOARG+12
EXODDN   EQU   EXOARG+8
EXOHEAD  EQU   EXOARG
@NM00046 EQU   EXCLFLAG
EXCLMNT  EQU   EXCLFLAG
EXCLVOL  EQU   EXCLAGL+16
EXCLDDP  EQU   EXCLAGL+12
EXCLUCBP EQU   EXCLAGL+8
EXCLHEAD EQU   EXCLAGL
@NM00045 EQU   CKFLAGS
CKDMTABL EQU   CKFLAGS
CKRETTYP EQU   CKFLAGS
CKTESTVT EQU   CKFLAGS
CKLABELP EQU   CKAGL+24
CKDATYPE EQU   CKAGL+20
CKDDNAME EQU   CKAGL+12
CKUCBPTR EQU   CKAGL+8
CKHEAD   EQU   CKAGL
PULABELP EQU   PUAGL+16
PUTTRPTR EQU   PUAGL+12
PUUCBPTR EQU   PUAGL+8
PUHEAD   EQU   PUAGL
MDR      EQU   MDVTOC+4
MDHH     EQU   MDVTOC+2
MDCC     EQU   MDVTOC
@NM00044 EQU   MDAGL+31
MDVTOCTR EQU   MDFLAGS
MDFORCE  EQU   MDFLAGS
MDDEQ    EQU   MDFLAGS
MDENQ    EQU   MDFLAGS
MDWAIT   EQU   MDFLAGS
MDPOST   EQU   MDFLAGS
MDCLEAR  EQU   MDFLAGS
MDNEWVOL EQU   MDFLAGS
MDLABEL  EQU   MDAGL+24
MDPUAGL  EQU   MDAGL+20
MDDDNAME EQU   MDAGL+12
MDUCBPTR EQU   MDAGL+8
MDHEAD   EQU   MDAGL
CTTBLRR  EQU   CTARRAY+3
CTTBLHH  EQU   CTARRAY+2
CTTBLCC  EQU   CTARRAY+1
CTTBLID  EQU   CTARRAY
CTREALH  EQU   CTMSG+3
CTREALCC EQU   CTMSG+1
@NM00043 EQU   CTMSG
CMCSN2   EQU   CMMSG+28
CMCSN1   EQU   CMMSG+16
CMNUMCRT EQU   CMMSG+15
@NM00042 EQU   CMMSG+14
CMNEWVOL EQU   CMMSG+8
@NM00041 EQU   CMMSG+7
@NM00040 EQU   CMVOLFLG
CMRONLY  EQU   CMVOLFLG
CMBIND   EQU   CMVOLFLG
CMSCRCRT EQU   CMVOLFLG
CMEXCL   EQU   CMVOLFLG
CMDERAS  EQU   CMVOLFLG
CMSCRVOL EQU   CMVOLFLG
CMCECART EQU   CMVOLFLG
CMOLDVOL EQU   CMMSG
CCOLDCSN EQU   CCMSG+24
CCNEWCSN EQU   CCMSG+12
@NM00039 EQU   CCMSG+10
CCVOL    EQU   CCMSG+4
@NM00038 EQU   CCMSG+2
CCEJCODE EQU   CCMSG+1
CCPSTCDE EQU   CCMSG
MODCHVAL EQU   MODCH+1
MODCHLEN EQU   MODCH
MODVOVAL EQU   MODVO+21
MODVOLEN EQU   MODVO+20
MODVOMEM EQU   MODVO+12
MODVOMLN EQU   MODVO+11
MODVOFUQ EQU   MODVOFLG
MODVOPOS EQU   MODVO+9
MODVOPAS EQU   MODVO+1
MODVOPLN EQU   MODVO
MORVOVAL EQU   MORVO+21
MORVOLEN EQU   MORVO+20
MORVOMEM EQU   MORVO+12
MORVOMLN EQU   MORVO+11
MORVOFUQ EQU   MORVOFLG
MORVOPOS EQU   MORVO+9
MORVOPAS EQU   MORVO+1
MORVOPLN EQU   MORVO
MNKSTVAL EQU   MNKST+1
MNKSTLEN EQU   MNKST
MNKOFVAL EQU   MNKOF
MNDSTVAL EQU   MNDST+1
MNDSTLEN EQU   MNDST
MNDOFVAL EQU   MNDOF
MRRVOVAL EQU   MRRVO+21
MRRVOLEN EQU   MRRVO+20
MRRVOMEM EQU   MRRVO+12
MRRVOMLN EQU   MRRVO+11
MRRVOFUQ EQU   MRRVOFLG
MRRVOPOS EQU   MRRVO+9
MRRVOPAS EQU   MRRVO+1
MRRVOPLN EQU   MRRVO
MIDCHVAL EQU   MIDCH+1
MIDCHLEN EQU   MIDCH
MIDVOVAL EQU   MIDVO+21
MIDVOLEN EQU   MIDVO+20
MIDVOMEM EQU   MIDVO+12
MIDVOMLN EQU   MIDVO+11
MIDVOFUQ EQU   MIDVOFLG
MIDVOPOS EQU   MIDVO+9
MIDVOPAS EQU   MIDVO+1
MIDVOPLN EQU   MIDVO
MIRVOVAL EQU   MIRVO+21
MIRVOLEN EQU   MIRVO+20
MIRVOMEM EQU   MIRVO+12
MIRVOMLN EQU   MIRVO+11
MIRVOFUQ EQU   MIRVOFLG
MIRVOPOS EQU   MIRVO+9
MIRVOPAS EQU   MIRVO+1
MIRVOPLN EQU   MIRVO
MVTCRVAL EQU   MVTCR+1
MVTCRLEN EQU   MVTCR
MVTCSVAL EQU   MVTCS+21
MVTCSLEN EQU   MVTCS+20
MVTCSMEM EQU   MVTCS+12
MVTCSMLN EQU   MVTCS+11
MVTCSFUQ EQU   MVTCSFLG
MVTCSPOS EQU   MVTCS+9
MVTCSPAS EQU   MVTCS+1
MVTCSPLN EQU   MVTCS
MODSLEN  EQU   MODS+20
MODSMEM  EQU   MODS+12
MODSMLN  EQU   MODS+11
MODSFUQ  EQU   MODSFLG
MODSPOS  EQU   MODS+9
MODSPLN  EQU   MODS
MOUTFLEN EQU   MOUTF+9
MOUTFPLN EQU   MOUTF
MINDSLEN EQU   MINDS+20
MINDSMEM EQU   MINDS+12
MINDSMLN EQU   MINDS+11
MINDSFUQ EQU   MINDSFLG
MINDSPOS EQU   MINDS+9
MINDSPLN EQU   MINDS
MINFLLEN EQU   MINFL+9
MINFLPLN EQU   MINFL
MNCNTVAL EQU   MNCNT+1
MNCNTLEN EQU   MNCNT
DBDATVAL EQU   DBDAT
DBKEYVAL EQU   DBKEY
DBVOLVAL EQU   DBVOL+21
DBVOLLEN EQU   DBVOL+20
DBVOLMEM EQU   DBVOL+12
DBVOLMLN EQU   DBVOL+11
DBVOLFUQ EQU   DBVOLFLG
DBVOLPOS EQU   DBVOL+9
DBVOLPAS EQU   DBVOL+1
DBVOLPLN EQU   DBVOL
DBDSLEN  EQU   DBDS+20
DBDSMEM  EQU   DBDS+12
DBDSMLN  EQU   DBDS+11
DBDSFUQ  EQU   DBDSFLG
DBDSPOS  EQU   DBDS+9
DBDSPLN  EQU   DBDS
DBFILLEN EQU   DBFIL+9
DBFILPLN EQU   DBFIL
CVTCSVAL EQU   CVTCS+21
CVTCSLEN EQU   CVTCS+20
CVTCSMEM EQU   CVTCS+12
CVTCSMLN EQU   CVTCS+11
CVTCSFUQ EQU   CVTCSFLG
CVTCSPOS EQU   CVTCS+9
CVTCSPAS EQU   CVTCS+1
CVTCSPLN EQU   CVTCS
CDATLVAL EQU   CDATL
CKEYLVAL EQU   CKEYL
CRECRVAL EQU   CRECR+1
CRECRLEN EQU   CRECR
CCCHRVAL EQU   CCCHR+1
CCCHRLEN EQU   CCCHR
CVOLSVAL EQU   CVOLS+21
CVOLSLEN EQU   CVOLS+20
CVOLSMEM EQU   CVOLS+12
CVOLSMLN EQU   CVOLS+11
CVOLSFUQ EQU   CVOLSFLG
CVOLSPOS EQU   CVOLS+9
CVOLSPAS EQU   CVOLS+1
CVOLSPLN EQU   CVOLS
CDHHRVAL EQU   CDHHR+1
CDHHRLEN EQU   CDHHR
CDCHRVAL EQU   CDCHR+1
CDCHRLEN EQU   CDCHR
CVOLDVAL EQU   CVOLD+21
CVOLDLEN EQU   CVOLD+20
CVOLDMEM EQU   CVOLD+12
CVOLDMLN EQU   CVOLD+11
CVOLDFUQ EQU   CVOLDFLG
CVOLDPOS EQU   CVOLD+9
CVOLDPAS EQU   CVOLD+1
CVOLDPLN EQU   CVOLD
CCATLVAL EQU   CCATL+21
CCATLLEN EQU   CCATL+20
CCATLMEM EQU   CCATL+12
CCATLMLN EQU   CCATL+11
CCATLFUQ EQU   CCATLFLG
CCATLPOS EQU   CCATL+9
CCATLPAS EQU   CCATL+1
CCATLPLN EQU   CCATL
COFILLEN EQU   COFIL+9
COFILPLN EQU   COFIL
CINDSVAL EQU   CINDS+21
CINDSLEN EQU   CINDS+20
CINDSMEM EQU   CINDS+12
CINDSMLN EQU   CINDS+11
CINDSFUQ EQU   CINDSFLG
CINDSPOS EQU   CINDS+9
CINDSPAS EQU   CINDS+1
CINDSPLN EQU   CINDS
CINFLVAL EQU   CINFL+10
CINFLLEN EQU   CINFL+9
CINFLPAS EQU   CINFL+1
CINFLPLN EQU   CINFL
DVTCSVAL EQU   DVTCS+21
DVTCSLEN EQU   DVTCS+20
DVTCSMEM EQU   DVTCS+12
DVTCSMLN EQU   DVTCS+11
DVTCSFUQ EQU   DVTCSFLG
DVTCSPOS EQU   DVTCS+9
DVTCSPAS EQU   DVTCS+1
DVTCSPLN EQU   DVTCS
DATALVAL EQU   DATAL
DKEYLVAL EQU   DKEYL
VOLRRVAL EQU   VOLRR+21
VOLRRLEN EQU   VOLRR+20
VOLRRMEM EQU   VOLRR+12
VOLRRMLN EQU   VOLRR+11
VOLRRFUQ EQU   VOLRRFLG
VOLRRPOS EQU   VOLRR+9
VOLRRPAS EQU   VOLRR+1
VOLRRPLN EQU   VOLRR
DSCHHVAL EQU   DSCHH+1
DSCHHLEN EQU   DSCHH
DSCHRVAL EQU   DSCHR+1
DSCHRLEN EQU   DSCHR
VOLDSVAL EQU   VOLDS+21
VOLDSLEN EQU   VOLDS+20
VOLDSMEM EQU   VOLDS+12
VOLDSMLN EQU   VOLDS+11
VOLDSFUQ EQU   VOLDSFLG
VOLDSPOS EQU   VOLDS+9
VOLDSPAS EQU   VOLDS+1
VOLDSPLN EQU   VOLDS
DRECVAL  EQU   DREC+1
DRECLEN  EQU   DREC
DCCHRVAL EQU   DCCHR+1
DCCHRLEN EQU   DCCHR
VOLSRVAL EQU   VOLSR+21
VOLSRLEN EQU   VOLSR+20
VOLSRMEM EQU   VOLSR+12
VOLSRMLN EQU   VOLSR+11
VOLSRFUQ EQU   VOLSRFLG
VOLSRPOS EQU   VOLSR+9
VOLSRPAS EQU   VOLSR+1
VOLSRPLN EQU   VOLSR
DOTDSVAL EQU   DOTDS+21
DOTDSLEN EQU   DOTDS+20
DOTDSMEM EQU   DOTDS+12
DOTDSMLN EQU   DOTDS+11
DOTDSFUQ EQU   DOTDSFLG
DOTDSPOS EQU   DOTDS+9
DOTDSPAS EQU   DOTDS+1
DOTDSPLN EQU   DOTDS
DOUTFVAL EQU   DOUTF+10
DOUTFLEN EQU   DOUTF+9
DOUTFPAS EQU   DOUTF+1
DOUTFPLN EQU   DOUTF
INDSLEN  EQU   INDS+20
INDSMEM  EQU   INDS+12
INDSMLN  EQU   INDS+11
INDSFUQ  EQU   INDSFLG
INDSPOS  EQU   INDS+9
INDSPLN  EQU   INDS
INFILLEN EQU   INFIL+9
INFILPLN EQU   INFIL
@NM00037 EQU   DMPARY+15
DMPARYTP EQU   DMPARY+14
DMPARYEX EQU   DMPARY+12
DMPARYIC EQU   DMPARY+10
DMPARYSZ EQU   DMPARY+8
DMPARYNM EQU   DMPARY
@NM00036 EQU   DMPITM+15
DMPITMTP EQU   DMPITM+14
DMPITMLN EQU   DMPITM+12
DMPITMPT EQU   DMPITM+8
DMPITMNM EQU   DMPITM
@NM00035 EQU   ERCNVTAB+24
ERDSNM   EQU   ERCNVTAB+12
@NM00034 EQU   ERCNVTAB+4
@NM00033 EQU   ERCNVTAB+3
@NM00032 EQU   EROSOPER
EROSUCDX EQU   EROSOPER
EROSCATL EQU   EROSOPER
@NM00031 EQU   EROPER
ERCATAL  EQU   EROPER
ERCATLC  EQU   EROPER
@NM00030 EQU   ERTYPE
EROSCAT  EQU   ERTYPE
@NM00029 EQU   FMTCNVF+1
FMTAR    EQU   FMTCNVF+1
FMTBS    EQU   FMTCNVF+1
FMTSS    EQU   FMTCNVF+1
FMTAL    EQU   FMTCNVF+1
FMTZS    EQU   FMTCNVF+1
@NM00028 EQU   FMTCNVF
FMTPU    EQU   FMTCNVF
FMTBD    EQU   FMTCNVF
FMTBHD   EQU   FMTCNVF
FMTBHA   EQU   FMTCNVF
FMTBH    EQU   FMTCNVF
FMTOLEN  EQU   FMTLIST+8
FMTRIO   EQU   FMTOCOL
FMTSPT   EQU   FMTSTO
FMTSTL   EQU   FMTILEN
@NM00027 EQU   FMTFLGS+1
FMTHDF   EQU   FMTFLGS
FMTDFF   EQU   FMTFLGS
FMTSTF   EQU   FMTFLGS
FMTREPF  EQU   FMTFLGS
FMTBDF   EQU   FMTFLGS
FMTIDF   EQU   FMTFLGS
FMTSCF   EQU   FMTFLGS
FMTEOLF  EQU   FMTFLGS
DARGPCT  EQU   DARGINL
DARGREP  EQU   DARGINS
@NM00026 EQU   DARGLIST+19
DARGIND  EQU   DARGLIST+18
DARGRETL EQU   DARGLIST+16
DARGRETP EQU   DARGLIST+4
UVOLVOL  EQU   UVOLENT+4
UVOLDEV  EQU   UVOLENT
UVOLCNT  EQU   UVOLLIST
@NM00025 EQU   IOINFOPT
IOINFTMS EQU   IOINFOPT
IOINFSUP EQU   IOINFOPT
IOINFVOL EQU   IOINFOPT
IOINFDVT EQU   IOINFOPT
OPNVOL   EQU   OPNAGL+44
@NM00024 EQU   OPNAGL+43
@NM00023 EQU   OPNOPT2
OPNOPTJM EQU   OPNOPT2
@NM00022 EQU   OPNOPT2
OPNOPTAS EQU   OPNOPT2
@NM00021 EQU   OPNDSO
OPNDSOPO EQU   OPNDSO
OPNDSOIS EQU   OPNDSO
OPNDSOPS EQU   OPNDSO
OPNDSOAM EQU   OPNDSO
OPNKYL   EQU   OPNAGL+40
OPNBLK   EQU   OPNAGL+36
OPNREC   EQU   OPNAGL+32
OPNDEVIX EQU   OPNDEV+4
OPNDEVDT EQU   OPNDEV
OPNCBP   EQU   OPNAGL+20
OPNMODRP EQU   OPNMOD
OPNMODUB EQU   OPNMOD
OPNMODRS EQU   OPNMOD
OPNMODAX EQU   OPNMOD
OPNMODRR EQU   OPNMOD
OPNMODRC EQU   OPNMOD
OPNMODAC EQU   OPNMOD
OPNMODPD EQU   OPNMOD
@NM00020 EQU   OPNTYP
OPNTYPRV EQU   OPNTYP
OPNTYPEX EQU   OPNTYP
OPNTYPRA EQU   OPNTYP
OPNTYPXM EQU   OPNTYP
OPNTYPCI EQU   OPNTYP
OPNTYPSO EQU   OPNTYP
OPNTYPSI EQU   OPNTYP
@NM00019 EQU   OPNRFM
OPNRFMBK EQU   OPNRFM
OPNRFMSF EQU   OPNRFM
OPNRFMUN EQU   OPNRFM
OPNRFMVR EQU   OPNRFM
OPNRFMFX EQU   OPNRFM
OPNOPTSK EQU   OPNOPT
OPNOPTDR EQU   OPNOPT
OPNOPTCR EQU   OPNOPT
OPNOPTKS EQU   OPNOPT
OPNOPTBK EQU   OPNOPT
OPNOPTOT EQU   OPNOPT
IOCREL   EQU   IOCSTR+60
IOCWORK  EQU   IOCSTR+56
IOCRRN   EQU   IOCSTR+52
IOCPNM   EQU   IOCNWM+2
IOCVRC   EQU   IOCTTR
IOCCBP   EQU   IOCSTR+36
IOCHURBA EQU   IOCSTR+28
IOCVOLSR EQU   IOCSTR+22
@NM00018 EQU   IOCMSG
IOCMSGAE EQU   IOCMSG
IOCMSGCE EQU   IOCMSG
IOCMSGOE EQU   IOCMSG
@NM00017 EQU   IOCMSG
IOCCHPSY EQU   IOCCHP
IOCCHPAS EQU   IOCCHP
IOCCHPBK EQU   IOCCHP
IOCCHPCR EQU   IOCCHP
IOCCHPKS EQU   IOCCHP
IOCCHPSK EQU   IOCCHP
IOCCHPDR EQU   IOCCHP
IOCCHPSQ EQU   IOCCHP
@NM00016 EQU   IOCMAC2
IOCMACPA EQU   IOCMAC2
@NM00015 EQU   IOCMAC2
IOCMACCP EQU   IOCMAC2
IOCMACRR EQU   IOCMAC2
IOCMACAS EQU   IOCMAC2
IOCMACSK EQU   IOCMAC2
@NM00014 EQU   IOCMAC
IOCMACCC EQU   IOCMAC
IOCMACDR EQU   IOCMAC
IOCMACBK EQU   IOCMAC
IOCMACCR EQU   IOCMAC
IOCMACUP EQU   IOCMAC
IOCMACOT EQU   IOCMAC
IOCMACIN EQU   IOCMAC
@NM00013 EQU   IOCRFM
IOCRFMBK EQU   IOCRFM
IOCRFMSF EQU   IOCRFM
IOCRFMUN EQU   IOCRFM
IOCRFMVR EQU   IOCRFM
IOCRFMFX EQU   IOCRFM
@NM00012 EQU   IOCDSO
IOCDSOPO EQU   IOCDSO
IOCDSOIS EQU   IOCDSO
IOCDSOPS EQU   IOCDSO
UNITVTOC EQU   UNITABL+7
@NM00011 EQU   UNITSTAT
UNITUSHR EQU   UNITSTAT
UNITXSHR EQU   UNITSTAT
UNITISHR EQU   UNITSTAT
UNITUA   EQU   @NM00010+1
UNITCHA  EQU   @NM00010
UNITUCB  EQU   UNITABL
ALLUNCNT EQU   ALLAGL+30
ALLVLCNT EQU   ALLAGL+29
@NM00009 EQU   ALLOPT
ALLOPTUN EQU   ALLOPT
ALLOPTPV EQU   ALLOPT
ALLOPTDS EQU   ALLOPT
ALLOPTVL EQU   ALLOPT
@NM00008 EQU   ALLORG+1
ALLORGVS EQU   ALLORG+1
@NM00007 EQU   ALLORG+1
ALLORGGS EQU   ALLORG+1
ALLORGUN EQU   ALLORG
ALLORGPO EQU   ALLORG
ALLORGMQ EQU   ALLORG
ALLORGCQ EQU   ALLORG
ALLORGCX EQU   ALLORG
ALLORGDA EQU   ALLORG
ALLORGPS EQU   ALLORG
ALLORGIS EQU   ALLORG
ALLDSPUN EQU   ALLDSP
ALLDSPCG EQU   ALLDSP
ALLDSPDE EQU   ALLDSP
ALLDSPKP EQU   ALLDSP
@NM00006 EQU   ALLDSP
ALLSTSOD EQU   ALLSTS
ALLSTSMD EQU   ALLSTS
ALLSTSNW EQU   ALLSTS
ALLSTSSR EQU   ALLSTS
@NM00005 EQU   ALLSTS
ALLPWD   EQU   ALLAGL+20
ALLVLP   EQU   ALLAGL+16
ALLULP   EQU   ALLAGL+12
ALLDDN   EQU   ALLAGL+4
ALLDSN   EQU   ALLAGL
CIRPID   EQU   CIRAGL+28
CIRPWD   EQU   CIRAGL+24
CIRCAT   EQU   CIRAGL+20
CIRWKP   EQU   CIRAGL+16
CIRTLR   EQU   CIRAGL+12
CIRHDR   EQU   CIRAGL+8
CIRTLN   EQU   CIRAGL+6
CIRHLN   EQU   CIRAGL+4
@NM00004 EQU   CIRAGL+1
@NM00003 EQU   CIRTYPE
CIRTYPAQ EQU   CIRTYPE
CIRTYP1Q EQU   CIRTYPE
NEWID1   EQU   TRACE1+95
CALLID   EQU   OLDERID1+90
@NM00002 EQU   OLDERID1
*                                      END UNREFERENCED COMPONENTS
@RC00450 EQU   @RC00448
@RC00457 EQU   @RC00455
@RT00758 EQU   @EL00003
@RF00757 EQU   @EL00003
@RF00828 EQU   @EL00006
@RF00833 EQU   @EL00006
@RF00877 EQU   @EL00007
@RC01395 EQU   @RC01380
@RC01581 EQU   @EL00011
@PB00012 EQU   @EL00001
@RC01585 EQU   @RC01581
@PB00010 EQU   @PB00012
@PB00009 EQU   @PB00010
@PB00004 EQU   @PB00009
@PB00003 EQU   @PB00004
@PB00002 EQU   @PB00003
@ENDDATA EQU   *
         END   IDCRD06,(C'PLS1214',0603,77300)
