         TITLE '***** IDCTSAU0 - AUDITMSS STATIC TEXT *****'   @Z40LB22
************************************************************   @Z40LB22
*                                                          *   @Z40LB22
* MODULE NAME -   IDCTSAU0                                 *   @Z40LB22
*                                                          *   @Z40LB22
*                                                          *   @Z40LB22
* DESCRIPTIVE NAME - STATIC TEXT MODULE FOR THE AUDITMSS   *   @Z40LB22
*         FUNCTION                                         *   @Z40LB22
*                                                          *   @Z40LB22
*                                                          *   @Z40LB22
* COPYRIGHT - NONE                                         *   @Z40LB22
*                                                          *   @Z40LB22
* STATUS - RELEASE 0  LEVEL 0                              *   @Z40LB22
*                                                          *   @Z40LB22
* FUNCTION - CONTAINS NO EXECUTABLE CODE, ONLY STATIC TEXT *   @Z40LB22
*        ENTRIES FOR THE FUNCTION AUDITMSS.                *   @Z40LB22
*        THIS MODULE IS LOADED BY IDCTP05 WHEN A STATIC    *   @Z40LB22
*        TEXT REQUEST IS MADE.                             *   @Z40LB22
*                                                          *   @Z40LB22
* NOTES - NONE                                             *   @Z40LB22
*                                                          *   @Z40LB22
*        DEPENDENCIES - NONE                               *   @Z40LB22
*        RESTRICTIONS - NONE                               *   @Z40LB22
*        REGISTER CONVENTIONS - NA                         *   @Z40LB22
*        PATCH AREA - NA                                   *   @Z40LB22
*                                                          *   @Z40LB22
* MODULE TYPE - TABLES                                     *   @Z40LB22
*                                                          *   @Z40LB22
*        PROCESSOR - ASSEMBLER                             *   @Z40LB22
*        MODULE SIZE - 5000 BYTES                          *   @Z40LB22
*        ATTRIBUTES - READ-ONLY                            *   @Z40LB22
*                                                          *   @Z40LB22
* ENTRY POINT - NA                                         *   @Z40LB22
*                                                          *   @Z40LB22
* EXIT NORMAL - NA                                         *   @Z40LB22
*                                                          *   @Z40LB22
* EXIT ERROR - NA                                          *   @Z40LB22
*                                                          *   @Z40LB22
* EXTERNAL REFERENCES - NA                                 *   @Z40LB22
*                                                          *   @Z40LB22
* TABLES - NA                                              *   @Z40LB22
*                                                          *   @Z40LB22
* MACROS - NA                                              *   @Z40LB22
*                                                          *   @Z40LB22
* CHANGE ACTIVITY -                                        *   @Z40LB22
*                                                          *   @Z40LB22
* CHANGE 1  9/19/75    @Z40LB25 SUBTITLES/HEADERS          *   @VS41108
*                                                          *   @Z40LB22
************************************************************   @Z40LB22
         EJECT                                                 @Z40LB22
************************************************************   @Z40LB22
*                                                          *   @Z40LB22
* THIS MODULE IS THE STATIC TEXT REQUIRED BY THE           *   @Z40LB22
* AUDITMSS FSR                                             *   @Z40LB22
*                                                          *   @Z40LB22
************************************************************   @Z40LB22
*                                                              @Z40LB22
IDCTSAU0 CSECT                                                 @Z40LB22
*                                                              @Z40LB22
INDEX    DC    Y((INDEXEND-INDEX1)/2)  COUNT OF ENTRIES        @Z40LB22
INDEX1   DC    Y(TXT1-INDEX)           MSG IDC3822I            @Z40LB22
INDEX2   DC    Y(TXT2-INDEX)           MSG IDC31140I           @Z40LB22
INDEX3   DC    Y(TXT3-INDEX)           MSG IDC31140I           @Z40LB22
INDEX4   DC    Y(TXT4-INDEX)           MSG IDC21147I           @Z40LB22
INDEX5   DC    Y(TXT5-INDEX)           MSG IDC21143I           @Z40LB22
INDEX6   DC    Y(TXT6-INDEX)           MSG IDC21144I           @Z40LB22
INDEX7   DC    Y(TXT7-INDEX)           MSG IDC31142I           @Z40LB22
INDEX8   DC    Y(TXT8-INDEX)           MSG IDC31142I           @Z40LB22
INDEX9   DC    Y(TXT9-INDEX)           MSG IDC21141I           @Z40LB22
INDEX10  DC    Y(TXT10-INDEX)          MSG IDC21141I           @Z40LB22
INDEX11  DC    Y(TXT11-INDEX)          (CHECK - ALL)           @VS41108
INDEX12  DC    Y(TXT12-INDEX)          (CHECK - FULL)          @VS41108
INDEX13  DC    Y(TXT13-INDEX)          (CHECK - EMPTY)         @VS41108
INDEX14  DC    Y(TXT14-INDEX)          CELLS FOUND VACANT      @VS41108
INDEX15  DC    Y(TXT15-INDEX)          CELLS FOUND OCCUPIED    @VS41108
INDEX16  DC    Y(TXT16-INDEX)          VACANT CELLS            @VS41108
INDEX17  DC    Y(TXT17-INDEX)          (READ - XRANGE, NOLIST) @VS41108
INDEX18  DC    Y(TXT18-INDEX)          (READ - XRANGE, LIST)   @VS41108
INDEX19  DC    Y(TXT19-INDEX)          (READ - CELL, NOLIST)   @VS41108
INDEX20  DC    Y(TXT20-INDEX)          MAP OF BACK             @Z40LB22
INDEX21  DC    Y(TXT21-INDEX)          STAT TEXT ENTRIES OF MAP@Z40LB22
INDEX22  DC    Y(TXT22-INDEX)          STAT TEXT ENTRIES OF MAP@Z40LB22
INDEX23  DC    Y(TXT23-INDEX)          STAT TEXT ENTRIES OF MAP@Z40LB22
INDEX24  DC    Y(TXT24-INDEX)          STAT TEXT ENTRIES OF MAP@Z40LB22
INDEX25  DC    Y(TXT25-INDEX)          STAT TEXT ENTRIES OF MAP@Z40LB22
INDEX26  DC    Y(TXT26-INDEX)          STAT TEXT ENTRIES OF MAP@Z40LB22
INDEX27  DC    Y(TXT27-INDEX)          STAT TEXT ENTRIES OF MAP@Z40LB22
INDEX28  DC    Y(TXT28-INDEX)          STAT TEXT ENTRIES OF MAP@Z40LB22
INDEX29  DC    Y(TXT29-INDEX)          NUMBER OF FULL CELLS    @Z40LB22
INDEX30  DC    Y(TXT30-INDEX)          NUMBER OF EMPTY CELLS   @Z40LB22
INDEX31  DC    Y(TXT31-INDEX)          C = EMPTY  C = FULL     @Z40LB22
INDEX32  DC    Y(TXT32-INDEX)          O = EMPTY  * = FULL     @Z40LB22
INDEX33  DC    Y(TXT33-INDEX)          A BLANK DATA LINE       @Z40LB22
INDEX34  DC    Y(TXT34-INDEX)          MAP OF FRONT            @Z40LB22
INDEX35  DC    Y(TXT35-INDEX)          (READ - CELL, LIST)     @VS41108
INDEX36  DC    H'-1'                   UNUSED                  @VS41108
INDEX37  DC    Y(TXT37-INDEX)          CART. NOT ACCESSED      @VS41108
INDEX38  DC    Y(TXT38-INDEX)          INCORRECT CELL LOC      @VS41108
INDEX39  DC    Y(TXT39-INDEX)          OCCUPIED CELLS          @VS41108
INDEX40  DC    H'-1'                   UNUSED                  @VS41108
INDEX41  DC    H'-1'                   UNUSED                  @VS41108
INDEX42  DC    H'-1'                   UNUSED                  @VS41108
INDEX43  DC    H'-1'                   UNUSED                  @VS41108
INDEX44  DC    Y(TXT44-INDEX)          IDC31148I               @Z40LB25
INDEX45  DC    Y(TXT45-INDEX)          IDC31145I               @Z40LB25
INDEX46  DC    Y(TXT46-INDEX)          IDC31146I               @Z40LB25
INDEX47  DC    Y(TXT47-INDEX)          VACANT LOCATIONS        @Z40LB22
INDEX48  DC    Y(TXT48-INDEX)          OCCUPIED LOCATIONS      @Z40LB22
INDEXEND DS    0H                                              @Z40LB22
         EJECT                                                 @Z40LB22
**********************************************************     @Z40LB22
*                                                        *     @Z40LB22
* IDC3822I  MSF NOT AVAILABLE                            *     @Z40LB22
* IDCAU01                                                *     @Z40LB22
*                                                        *     @Z40LB22
**********************************************************     @Z40LB22
         SPACE 3                                               @Z40LB22
TXT1     DC    Y(TXT1B-TXT1A)          ENTRY LENGTH            @Z40LB22
         DC    X'8000'                 MESSAGE FLAG            @Z40LB22
         SPACE 1                                               @Z40LB22
* SPACING CONTROL SUB-STRUCTURE                                @Z40LB22
TXT1A    DC    X'4000'                 SPACE CONTROL FLAG      @Z40LB22
         DC    H'2'                    SPACING FACTOR          @Z40LB22
         DC    C'R '                   SPACING TYPE            @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT SUB-STRUCTURE                                    @Z40LB22
         DC    X'8400'                 STATIC TEXT FLAG        @Z40LB22
         DC    Y(STE11B-STE11A)        TEXT LENGTH             @Z40LB22
         DC    Y(STE11A-TXT1A)         TEXT OFFSET             @Z40LB22
         DC    H'1'                    PRINT COLUMN            @Z40LB22
         DC    Y(STE11B-STE11A)        PRINT FIELD LENGTH      @Z40LB22
         DC    H'0'                    CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT ENTRIES                                          @Z40LB22
STE11A   DC    C'IDC3822I  MSF NOT AVALIABLE'                  @Z40LB22
STE11B   EQU   *                                               @Z40LB22
TXT1B    EQU   *                                               @Z40LB22
         EJECT                                                 @Z40LB22
*************************************************************  @Z40LB22
*                                                           *  @Z40LB22
* IDC31140I ** UNABLE TO OBTAIN THE MSC CONFIGURATION TABLE *  @Z40LB22
* IDCAU01                                                   *  @Z40LB22
*                                                           *  @Z40LB22
*************************************************************  @Z40LB22
         SPACE 3                                               @Z40LB22
TXT2     DC    Y(TXT2B-TXT2A)          ENTRY LENGTH            @Z40LB22
         DC    X'8000'                 MESSAGE FLAG            @Z40LB22
         SPACE 1                                               @Z40LB22
* SPACING CONTROL SUB-STRUCTURE                                @Z40LB22
TXT2A    DC    X'4000'                 SPACE CONTROL FLAG      @Z40LB22
         DC    H'2'                    SPACING FACTOR          @Z40LB22
         DC    C'R '                   SPACING TYPE            @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT SUB-STRUCTURE                                    @Z40LB22
         DC    X'8400'                 STATIC TEXT FLAG        @Z40LB22
         DC    Y(STE21B-STE21A)        TEXT LENGTH             @Z40LB22
         DC    Y(STE21A-TXT2A)         TEXT OFFSET             @Z40LB22
         DC    H'1'                    PRINT COLUMN            @Z40LB22
         DC    Y(STE21B-STE21A)        PRINT FIELD LENGTH      @Z40LB22
         DC    H'0'                    CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT ENTRIES                                          @Z40LB22
STE21A   DC    C'IDC31140I ** UNABLE TO OBTAIN THE '           @Z40LB22
         DC    C'MSC CONFIGURATION TABLE'                      @Z40LB22
STE21B   EQU   *                                               @Z40LB22
TXT2B    EQU   *                                               @Z40LB22
         EJECT                                                 @Z40LB22
*************************************************************  @Z40LB22
*                                                           *  @Z40LB22
* IDC31140I ** UNABLE TO OBTAIN THE MSF CELL MAPS           *  @Z40LB22
* IDCAU01                                                   *  @Z40LB22
*                                                           *  @Z40LB22
*************************************************************  @Z40LB22
         SPACE 3                                               @Z40LB22
TXT3     DC    Y(TXT3B-TXT3A)          ENTRY LENGTH            @Z40LB22
         DC    X'8000'                 MESSAGE FLAG            @Z40LB22
         SPACE 1                                               @Z40LB22
* SPACING CONTROL SUB-STRUCTURE                                @Z40LB22
TXT3A    DC    X'4000'                 SPACE CONTROL FLAG      @Z40LB22
         DC    H'2'                    SPACING FACTOR          @Z40LB22
         DC    C'R '                   SPACING TYPE            @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT SUB-STRUCTURE                                    @Z40LB22
         DC    X'8400'                 STATIC TEXT FLAG        @Z40LB22
         DC    Y(STE31B-STE31A)        TEXT LENGTH             @Z40LB22
         DC    Y(STE31A-TXT3A)         TEXT OFFSET             @Z40LB22
         DC    H'1'                    PRINT COLUMN            @Z40LB22
         DC    Y(STE31B-STE31A)        PRINT FIELD LENGTH      @Z40LB22
         DC    H'0'                    CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT ENTRIES                                          @Z40LB22
STE31A   DC    C'IDC31140I ** UNABLE TO OBTAIN THE '           @Z40LB22
         DC    C'MSF CELL MAPS'                                @Z40LB22
STE31B   EQU   *                                               @Z40LB22
TXT3B    EQU   *                                               @Z40LB22
         EJECT                                                 @Z40LB22
************************************************************** @Z40LB22
*                                                              @Z40LB22
* IDC21147I  ** INCOMPLETE CHECK REPORT PRODUCED,              @Z40LB22
*               ERROR WITHIN X RANGE NNN NNN                   @Z40LB22
* IDCAU03                                                      @Z40LB22
*                                                              @Z40LB22
************************************************************** @Z40LB22
         SPACE 3                                               @Z40LB22
TXT4     DC    Y(TXT4B-TXT4A)          ENTRY LENGTH            @Z40LB22
         DC    X'8000'                 MESSAGE FLAG            @Z40LB22
         SPACE 1                                               @Z40LB22
* SPACING CONTROL SUB-STRUCTURE                                @Z40LB22
TXT4A    DC    X'4000'                 SPACE CONTROL FLAG      @Z40LB22
         DC    H'2'                    SPACING FACTOR          @Z40LB22
         DC    C'R '                   SPACING TYPE            @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT SUB-STRUCTURE                                    @Z40LB22
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB22
         DC    Y(STE41B-STE41A)        TEXT LENGTH             @Z40LB22
         DC    Y(STE41A-TXT4A)         TEXT OFFSET             @Z40LB22
         DC    H'1'                    PRINT COLUMN            @Z40LB22
         DC    Y(STE41B-STE41A)        PRINT FIELD LENGTH      @Z40LB22
         DC    H'0'                    CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* INSERT DATA SUB-STRUCTURE                                    @Z40LB22
         DC    X'2000'                 INSERT DATA FLAG        @Z40LB22
         DC    H'1'                    INSERT REFERENCE NUMBER @Z40LB22
         DC    H'0'                    RESERVED                @Z40LB22
         DC    H'70'                   PRINT COLUMN            @Z40LB22
         DC    H'3'                    OUTPUT LENGTH           @Z40LB22
         DC    X'1060'                 CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* INSERT DATA SUB-STRUCTURE                                    @Z40LB22
         DC    X'A000'                 INSERT DATA FLAG        @Z40LB22
         DC    H'2'                    INSERT REFERENCE NUMBER @Z40LB22
         DC    H'0'                    RESERVED                @Z40LB22
         DC    H'74'                   PRINT COLUMN            @Z40LB22
         DC    H'3'                    OUTPUT LENGTH           @Z40LB22
         DC    X'1060'                 CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT ENTRIES                                          @Z40LB22
STE41A   DC    C'IDC21147I  ** INCOMPLETE CHECK REPORT '       @Z40LB22
         DC    C'PRODUCED, ERROR WITHIN X RANGE NNN NNN'       @Z40LB22
STE41B   EQU   *                                               @Z40LB22
TXT4B    EQU   *                                               @Z40LB22
         EJECT                                                 @Z40LB22
************************************************************** @Z40LB22
*                                                              @Z40LB22
* IDC21143I  ** INCOMPLETE READ REPORT PRODUCED,               @Z40LB22
*               ERROR AT X LOCATION NNN                        @Z40LB22
* IDCAU03                                                      @Z40LB22
*                                                              @Z40LB22
************************************************************** @Z40LB22
         SPACE 3                                               @Z40LB22
TXT5     DC    Y(TXT5B-TXT5A)          ENTRY LENGTH            @Z40LB22
         DC    X'8000'                 MESSAGE FLAG            @Z40LB22
         SPACE 1                                               @Z40LB22
* SPACING CONTROL SUB-STRUCTURE                                @Z40LB22
TXT5A    DC    X'4000'                 SPACE CONTROL FLAG      @Z40LB22
         DC    H'2'                    SPACING FACTOR          @Z40LB22
         DC    C'R '                   SPACING TYPE            @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT SUB-STRUCTURE                                    @Z40LB22
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB22
         DC    Y(STE51B-STE51A)        TEXT LENGTH             @Z40LB22
         DC    Y(STE51A-TXT5A)         TEXT OFFSET             @Z40LB22
         DC    H'1'                    PRINT COLUMN            @Z40LB22
         DC    Y(STE51B-STE51A)        PRINT FIELD LENGTH      @Z40LB22
         DC    H'0'                    CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* INSERT DATA SUB-STRUCTURE                                    @Z40LB22
         DC    X'A000'                 INSERT DATA FLAG        @Z40LB22
         DC    H'1'                    INSERT REFERENCE NUMBER @Z40LB22
         DC    H'0'                    RESERVED                @Z40LB22
         DC    H'68'                   PRINT COLUMN            @Z40LB22
         DC    H'3'                    OUTPUT LENGTH           @Z40LB22
         DC    X'1060'                 CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT ENTRIES                                          @Z40LB22
STE51A   DC    C'IDC21143I  ** INCOMPLETE READ REPORT '        @Z40LB22
         DC    C'PRODUCED, ERROR AT X LOCATION NNN'            @Z40LB22
STE51B   EQU   *                                               @Z40LB22
TXT5B    EQU   *                                               @Z40LB22
         EJECT                                                 @Z40LB22
************************************************************** @Z40LB22
*                                                              @Z40LB22
* IDC21144I  LOW XRANGE XXX IS GREATER THAN HIGH XRANGE XXX    @Z40LB22
* IDCAU03                                                      @Z40LB22
*                                                              @Z40LB22
************************************************************** @Z40LB22
         SPACE 3                                               @Z40LB22
TXT6     DC    Y(TXT6B-TXT6A)          ENTRY LENGTH            @Z40LB22
         DC    X'8000'                 MESSAGE FLAG            @Z40LB22
         SPACE 1                                               @Z40LB22
* SPACING CONTROL SUB-STRUCTURE                                @Z40LB22
TXT6A    DC    X'4000'                 SPACE CONTROL FLAG      @Z40LB22
         DC    H'2'                    SPACING FACTOR          @Z40LB22
         DC    C'R '                   SPACING TYPE            @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT SUB-STRUCTURE                                    @Z40LB22
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB22
         DC    Y(STE61B-STE61A)        TEXT LENGTH             @Z40LB22
         DC    Y(STE61A-TXT6A)         TEXT OFFSET             @Z40LB22
         DC    H'1'                    PRINT COLUMN            @Z40LB22
         DC    Y(STE61B-STE61A)        PRINT FIELD LENGTH      @Z40LB22
         DC    H'0'                    CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* INSERT DATA SUB-STRUCTURE                                    @Z40LB22
         DC    X'2000'                 INSERT DATA FLAG        @Z40LB22
         DC    H'1'                    INSERT REFERENCE NUMBER @Z40LB22
         DC    H'0'                    RESERVED                @Z40LB22
         DC    H'23'                   PRINT COLUMN            @Z40LB22
         DC    H'3'                    OUTPUT LENGTH           @Z40LB22
         DC    X'1060'                 CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* INSERT DATA SUB-STRUCTURE                                    @Z40LB22
         DC    X'A000'                 INSERT DATA FLAG        @Z40LB22
         DC    H'2'                    INSERT REFERENCE NUMBER @Z40LB22
         DC    H'0'                    RESERVED                @Z40LB22
         DC    H'55'                   PRINT COLUMN            @Z40LB22
         DC    H'3'                    OUTPUT LENGTH           @Z40LB22
         DC    X'1060'                 CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT ENTRIES                                          @Z40LB22
STE61A   DC    C'IDC21144I  LOW XRANGE XXX IS GREATER THAN '   @Z40LB22
         DC    C'HIGH XRANGE XXX'                              @Z40LB22
STE61B   EQU   *                                               @Z40LB22
TXT6B    EQU   *                                               @Z40LB22
         EJECT                                                 @Z40LB22
***************************************************************@Z40LB22
*                                                             *@Z40LB22
* IDC31142I  AUDITMSS TERMINATED.  NO VALID CELL(S) SPECIFIED *@Z40LB22
* IDCAU03                                                     *@Z40LB22
*                                                             *@Z40LB22
***************************************************************@Z40LB22
         SPACE 3                                               @Z40LB22
TXT7     DC    Y(TXT7B-TXT7A)          ENTRY LENGTH            @Z40LB22
         DC    X'8000'                 MESSAGE FLAG            @Z40LB22
         SPACE 1                                               @Z40LB22
* SPACING CONTROL SUB-STRUCTURE                                @Z40LB22
TXT7A    DC    X'4000'                 SPACE CONTROL FLAG      @Z40LB22
         DC    H'2'                    SPACING FACTOR          @Z40LB22
         DC    C'R '                   SPACING TYPE            @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT SUB-STRUCTURE                                    @Z40LB22
         DC    X'8400'                 STATIC TEXT FLAG        @Z40LB22
         DC    Y(STE71B-STE71A)        TEXT LENGTH             @Z40LB22
         DC    Y(STE71A-TXT7A)         TEXT OFFSET             @Z40LB22
         DC    H'1'                    PRINT COLUMN            @Z40LB22
         DC    Y(STE71B-STE71A)        PRINT FIELD LENGTH      @Z40LB22
         DC    H'0'                    CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT ENTRIES                                          @Z40LB22
STE71A   DC    C'IDC31142I  AUDITMSS TERMINATED.  '            @Z40LB22
         DC    C'NO VALID CELL(S) SPECIFIED'                   @Z40LB22
STE71B   EQU   *                                               @Z40LB22
TXT7B    EQU   *                                               @Z40LB22
         EJECT                                                 @Z40LB22
*****************************************************************
*                                                               *
* IDC31142I  AUDITMSS TERMINATED.  NO VALID XRANGE(S) SPECIFIED *
* IDCAU03                                                       *
*                                                               *
*****************************************************************
         SPACE 3                                               @Z40LB22
TXT8     DC    Y(TXT8B-TXT8A)          ENTRY LENGTH            @Z40LB22
         DC    X'8000'                 MESSAGE FLAG            @Z40LB22
         SPACE 1                                               @Z40LB22
* SPACING CONTROL SUB-STRUCTURE                                @Z40LB22
TXT8A    DC    X'4000'                 SPACE CONTROL FLAG      @Z40LB22
         DC    H'2'                    SPACING FACTOR          @Z40LB22
         DC    C'R '                   SPACING TYPE            @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT SUB-STRUCTURE                                    @Z40LB22
         DC    X'8400'                 STATIC TEXT FLAG        @Z40LB22
         DC    Y(STE81B-STE81A)        TEXT LENGTH             @Z40LB22
         DC    Y(STE81A-TXT8A)         TEXT OFFSET             @Z40LB22
         DC    H'1'                    PRINT COLUMN            @Z40LB22
         DC    Y(STE81B-STE81A)        PRINT FIELD LENGTH      @Z40LB22
         DC    H'0'                    CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT ENTRIES                                          @Z40LB22
STE81A   DC    C'IDC31142I  AUDITMSS TERMINATED.  '            @Z40LB22
         DC    C'NO VALID XRANGE(S) SPECIFIED'                 @Z40LB22
STE81B   EQU   *                                               @Z40LB22
TXT8B    EQU   *                                               @Z40LB22
         EJECT                                                 @Z40LB22
************************************************************** @Z40LB22
*                                                              @Z40LB22
* IDC21141I  CELL NNN NN N IS NOT VALID FOR MSF N              @Z40LB22
*            AND NOT PROCESSED                                 @Z40LB22
* IDCAU03                                                      @Z40LB22
*                                                              @Z40LB22
************************************************************** @Z40LB22
         SPACE 3                                               @Z40LB22
TXT9     DC    Y(TXT9B-TXT9A)          ENTRY LENGTH            @Z40LB22
         DC    X'8000'                 MESSAGE FLAG            @Z40LB22
         SPACE 1                                               @Z40LB22
* SPACING CONTROL SUB-STRUCTURE                                @Z40LB22
TXT9A    DC    X'4000'                 SPACE CONTROL FLAG      @Z40LB22
         DC    H'2'                    SPACING FACTOR          @Z40LB22
         DC    C'R '                   SPACING TYPE            @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT SUB-STRUCTURE                                    @Z40LB22
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB22
         DC    Y(STE91B-STE91A)        TEXT LENGTH             @Z40LB22
         DC    Y(STE91A-TXT9A)         TEXT OFFSET             @Z40LB22
         DC    H'1'                    PRINT COLUMN            @Z40LB22
         DC    Y(STE91B-STE91A)        PRINT FIELD LENGTH      @Z40LB22
         DC    H'0'                    CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* INSERT DATA SUB-STRUCTURE                                    @Z40LB22
         DC    X'2000'                 INSERT DATA FLAG        @Z40LB22
         DC    H'1'                    INSERT REFERENCE NUMBER @Z40LB22
         DC    H'0'                    RESERVED                @Z40LB22
         DC    H'17'                   PRINT COLUMN            @Z40LB22
         DC    H'3'                    OUTPUT LENGTH           @Z40LB22
         DC    X'1060'                 CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* INSERT DATA SUB-STRUCTURE                                    @Z40LB22
         DC    X'2000'                 INSERT DATA FLAG        @Z40LB22
         DC    H'2'                    INSERT REFERENCE NUMBER @Z40LB22
         DC    H'0'                    RESERVED                @Z40LB22
         DC    H'21'                   PRINT COLUMN            @Z40LB22
         DC    H'2'                    OUTPUT LENGTH           @Z40LB22
         DC    X'1060'                 CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* INSERT DATA SUB-STRUCTURE                                    @Z40LB22
         DC    X'2000'                 INSERT DATA FLAG        @Z40LB22
         DC    H'3'                    INSERT REFERENCE NUMBER @Z40LB22
         DC    H'0'                    RESERVED                @Z40LB22
         DC    H'24'                   PRINT COLUMN            @Z40LB22
         DC    H'1'                    OUTPUT LENGTH           @Z40LB22
         DC    X'1060'                 CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* INSERT DATA SUB-STRUCTURE                                    @Z40LB22
         DC    X'A000'                 INSERT DATA FLAG        @Z40LB22
         DC    H'4'                    INSERT REFERENCE NUMBER @Z40LB22
         DC    H'0'                    RESERVED                @Z40LB22
         DC    H'47'                   PRINT COLUMN            @Z40LB22
         DC    H'1'                    OUTPUT LENGTH           @Z40LB22
         DC    X'1060'                 CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT ENTRIES                                          @Z40LB22
STE91A   DC    C'IDC21141I  CELL NNN    N IS NOT VALID FOR '   @Z40LB22
         DC    C'MSF N AND NOT PROCESSED'                      @Z40LB22
STE91B   EQU   *                                               @Z40LB22
TXT9B    EQU   *                                               @Z40LB22
         EJECT                                                 @Z40LB22
************************************************************** @Z40LB22
*                                                              @Z40LB22
* IDC21141I  XRANGE (NNN NNN) IS NOT VALID FOR MSF N           @Z40LB22
*            AND NOT PROCESSED                                 @Z40LB22
* IDCAU03                                                      @Z40LB22
*                                                              @Z40LB22
************************************************************** @Z40LB22
         SPACE 3                                               @Z40LB22
TXT10    DC    Y(TXT10B-TXT10A)        ENTRY LENGTH            @Z40LB22
         DC    X'8000'                 MESSAGE FLAG            @Z40LB22
         SPACE 1                                               @Z40LB22
* SPACING CONTROL SUB-STRUCTURE                                @Z40LB22
TXT10A   DC    X'4000'                 SPACE CONTROL FLAG      @Z40LB22
         DC    H'2'                    SPACING FACTOR          @Z40LB22
         DC    C'R '                   SPACING TYPE            @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT SUB-STRUCTURE                                    @Z40LB22
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB22
         DC    Y(STE101B-STE101A)      TEXT LENGTH             @Z40LB22
         DC    Y(STE101A-TXT10A)       TEXT OFFSET             @Z40LB22
         DC    H'1'                    PRINT COLUMN            @Z40LB22
         DC    Y(STE101B-STE101A)      PRINT FIELD LENGTH      @Z40LB22
         DC    H'0'                    CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* INSERT DATA SUB-STRUCTURE                                    @Z40LB22
         DC    X'2000'                 INSERT DATA FLAG        @Z40LB22
         DC    H'1'                    INSERT REFERENCE NUMBER @Z40LB22
         DC    H'0'                    RESERVED                @Z40LB22
         DC    H'20'                   PRINT COLUMN            @Z40LB22
         DC    H'3'                    OUTPUT LENGTH           @Z40LB22
         DC    X'1060'                 CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* INSERT DATA SUB-STRUCTURE                                    @Z40LB22
         DC    X'2000'                 INSERT DATA FLAG        @Z40LB22
         DC    H'2'                    INSERT REFERENCE NUMBER @Z40LB22
         DC    H'0'                    RESERVED                @Z40LB22
         DC    H'24'                   PRINT COLUMN            @Z40LB22
         DC    H'3'                    OUTPUT LENGTH           @Z40LB22
         DC    X'1060'                 CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* INSERT DATA SUB-STRUCTURE                                    @Z40LB22
         DC    X'A000'                 INSERT DATA FLAG        @Z40LB22
         DC    H'3'                    INSERT REFERENCE NUMBER @Z40LB22
         DC    H'0'                    RESERVED                @Z40LB22
         DC    H'50'                   PRINT COLUMN            @Z40LB22
         DC    H'1'                    OUTPUT LENGTH           @Z40LB22
         DC    X'1060'                 CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT ENTRIES                                          @Z40LB22
STE101A  DC    C'IDC21141I  XRANGE (NNN NNN) IS NOT VALID '    @Z40LB22
         DC    C'FOR MSF N AND NOT PROCESSED'                  @Z40LB22
STE101B  EQU   *                                               @Z40LB22
TXT10B   EQU   *                                               @Z40LB22
         EJECT                                                 @Z40LB22
************************************************************** @Z40LB22
*                                                              @Z40LB22
*               AUDITMSS MSF N  (CHECK - ALL)                  @Z40LB22
* IDCAU03 (SUBTITLE)                                           @Z40LB22
*                                                              @Z40LB22
************************************************************** @Z40LB22
         SPACE 3                                               @Z40LB22
TXT11    DC    Y(TXT11B-TXT11A)        ENTRY LENGTH            @Z40LB22
         DC    X'0000'                 MESSAGE FLAG            @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT SUB-STRUCTURE                                    @Z40LB22
TXT11A   DC    X'0400'                 STATIC TEXT FLAG        @Z40LB22
         DC    Y(STE111B-STE111A)      TEXT LENGTH             @Z40LB22
         DC    Y(STE111A-TXT11A)       TEXT OFFSET             @Z40LB22
         DC    H'1'                    PRINT COLUMN            @Z40LB22
         DC    Y(STE111B-STE111A)      PRINT FIELD LENGTH      @Z40LB22
         DC    H'0'                    CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* INSERT DATA SUB-STRUCTURE                                    @Z40LB22
         DC    X'A000'                 INSERT DATA FLAG        @Z40LB22
         DC    H'1'                    INSERT REFERENCE NUMBER @Z40LB22
         DC    H'0'                    RESERVED                @Z40LB22
         DC    H'40'                   PRINT COLUMN            @Z40LB22
         DC    H'1'                    OUTPUT LENGTH           @Z40LB22
         DC    X'1060'                 CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT ENTRIES                                          @Z40LB22
STE111A  DC    C'-'                                            @Z40LB22
         DC    C'                         AUDITMSS MSF N  '    @Z40LB22
         DC    C'(CHECK - ALL)'                                @Z40LB22
STE111B  EQU   *                                               @Z40LB22
TXT11B   EQU   *                                               @Z40LB22
         EJECT                                                 @Z40LB22
************************************************************** @Z40LB22
*                                                              @Z40LB22
*               AUDITMSS MSF N  (CHECK - FULL)                 @Z40LB22
* IDCAU03 (SUBTITLE)                                           @Z40LB22
*                                                              @Z40LB22
************************************************************** @Z40LB22
         SPACE 3                                               @Z40LB22
TXT12    DC    Y(TXT12B-TXT12A)        ENTRY LENGTH            @Z40LB22
         DC    X'0000'                 MESSAGE FLAG            @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT SUB-STRUCTURE                                    @Z40LB22
TXT12A   DC    X'0400'                 STATIC TEXT FLAG        @Z40LB22
         DC    Y(STE121B-STE121A)      TEXT LENGTH             @Z40LB22
         DC    Y(STE121A-TXT12A)       TEXT OFFSET             @Z40LB22
         DC    H'1'                    PRINT COLUMN            @Z40LB22
         DC    Y(STE121B-STE121A)      PRINT FIELD LENGTH      @Z40LB22
         DC    H'0'                    CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* INSERT DATA SUB-STRUCTURE                                    @Z40LB22
         DC    X'A000'                 INSERT DATA FLAG        @Z40LB22
         DC    H'1'                    INSERT REFERENCE NUMBER @Z40LB22
         DC    H'0'                    RESERVED                @Z40LB22
         DC    H'40'                   PRINT COLUMN            @Z40LB22
         DC    H'1'                    OUTPUT LENGTH           @Z40LB22
         DC    X'1060'                 CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT ENTRIES                                          @Z40LB22
STE121A  DC    C'-'                                            @Z40LB22
         DC    C'                         AUDITMSS MSF N  '    @Z40LB22
         DC    C'(CHECK - FULL)'                               @Z40LB22
STE121B  EQU   *                                               @Z40LB22
TXT12B   EQU   *                                               @Z40LB22
         EJECT                                                 @Z40LB22
************************************************************** @Z40LB22
*                                                              @Z40LB22
*             AUDITMSS MSF N  (CHECK - EMPTY)                  @Z40LB22
* IDCAU03 (SUBTITLE)                                           @Z40LB22
*                                                              @Z40LB22
************************************************************** @Z40LB22
         SPACE 3                                               @Z40LB22
TXT13    DC    Y(TXT13B-TXT13A)        ENTRY LENGTH            @Z40LB22
         DC    X'0000'                 MESSAGE FLAG            @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT SUB-STRUCTURE                                    @Z40LB22
TXT13A   DC    X'0400'                 STATIC TEXT FLAG        @Z40LB22
         DC    Y(STE131B-STE131A)      TEXT LENGTH             @Z40LB22
         DC    Y(STE131A-TXT13A)       TEXT OFFSET             @Z40LB22
         DC    H'1'                    PRINT COLUMN            @Z40LB22
         DC    Y(STE131B-STE131A)      PRINT FIELD LENGTH      @Z40LB22
         DC    H'0'                    CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* INSERT DATA SUB-STRUCTURE                                    @Z40LB22
         DC    X'A000'                 INSERT DATA FLAG        @Z40LB22
         DC    H'1'                    INSERT REFERENCE NUMBER @Z40LB22
         DC    H'0'                    RESERVED                @Z40LB22
         DC    H'40'                   PRINT COLUMN            @Z40LB22
         DC    H'1'                    OUTPUT LENGTH           @Z40LB22
         DC    X'1060'                 CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT ENTRIES                                          @Z40LB22
STE131A  DC    C'-'                                            @Z40LB22
         DC    C'                         AUDITMSS MSF N  '    @Z40LB22
         DC    C'(CHECK - EMPTY)'                              @Z40LB22
STE131B  EQU   *                                               @Z40LB22
TXT13B   EQU   *                                               @Z40LB22
         EJECT                                                 @Z40LB22
************************************************************** @Z40LB22
*                                                              @Z40LB22
*       CELLS FOUND VACANT  (MSC TABLES INDICATE OCCUPIED)     @Z40LB22
* IDCAU03 (HEADER)                                             @Z40LB22
*                                                              @Z40LB22
************************************************************** @Z40LB22
         SPACE 3                                               @Z40LB22
TXT14    DC    Y(TXT14F-TXT14A)        ENTRY LENGTH            @Z40LB22
         DC    X'4000'                 HEADER FLAG             @Z40LB22
         DC    H'3'                    HEADLINE COUNT          @Z40LB22
         DC    H'7'                    PAGE LINES              @Z40LB22
         SPACE 1                                               @Z40LB22
* SPACING CONTROL SUB-STRUCTURE                                @Z40LB22
TXT14A   DC    X'4000'                 SPACE CONTROL FLAG      @Z40LB22
         DC    H'3'                    SPACING FACTOR          @Z40LB22
         DC    C'R '                   SPACING TYPE            @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT SUB-STRUCTURE                                    @Z40LB22
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB22
         DC    Y(STE141B-STE141A)      TEXT LENGTH             @Z40LB22
         DC    Y(STE141A-TXT14A)       TEXT OFFSET             @Z40LB22
         DC    H'1'                    PRINT COLUMN            @Z40LB22
         DC    Y(STE141B-STE141A)      PRINT FIELD LENGTH      @Z40LB22
         DC    H'0'                    CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* SPACING CONTROL SUB-STRUCTURE                                @Z40LB22
         DC    X'4000'                 SPACE CONTROL FLAG      @Z40LB22
         DC    H'2'                    SPACING FACTOR          @Z40LB22
         DC    C'R '                   SPACING TYPE            @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT SUB-STRUCTURE                                    @Z40LB22
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB22
         DC    Y(STE141D-STE141C)      TEXT LENGTH             @Z40LB22
         DC    Y(STE141C-TXT14A)       TEXT OFFSET             @Z40LB22
         DC    H'1'                    PRINT COLUMN            @Z40LB22
         DC    Y(STE141D-STE141C)      PRINT FIELD LENGTH      @Z40LB22
         DC    H'0'                    CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* SPACING CONTROL SUB-STRUCTURE                                @Z40LB22
         DC    X'4000'                 SPACE CONTROL FLAG      @Z40LB22
         DC    H'1'                    SPACING FACTOR          @Z40LB22
         DC    C'R '                   SPACING TYPE            @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT SUB-STRUCTURE                                    @Z40LB22
         DC    X'8400'                 STATIC TEXT FLAG        @Z40LB22
         DC    Y(STE141F-STE141E)      TEXT LENGTH             @Z40LB22
         DC    Y(STE141E-TXT14A)       TEXT OFFSET             @Z40LB22
         DC    H'1'                    PRINT COLUMN            @Z40LB22
         DC    Y(STE141F-STE141E)      PRINT FIELD LENGTH      @Z40LB22
         DC    H'0'                    CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT ENTRIES                                          @Z40LB22
STE141A  DC    C'                CELLS FOUND VACANT  (MSC '    @Z40LB22
         DC    C'TABLES INDICATE OCCUPIED)'                    @Z40LB22
STE141B  EQU   *                                               @Z40LB22
STE141C  DC    C'        X  Y  Z    X  Y  Z    X  Y  Z    '    @Z40LB22
         DC    C'X  Y  Z    X  Y  Z    X  Y  Z'                @Z40LB22
STE141D  EQU   *                                               @Z40LB22
STE141E  DC    C' '                                            @Z40LB22
STE141F  EQU   *                                               @Z40LB22
TXT14F   EQU   *                                               @Z40LB22
         EJECT                                                 @Z40LB22
************************************************************** @Z40LB22
*                                                              @Z40LB22
*       CELLS FOUND OCCUPIED (MSC TABLES INDICATE VACANT)      @Z40LB22
* IDCAU03 (HEADER)                                             @Z40LB22
*                                                              @Z40LB22
************************************************************** @Z40LB22
         SPACE 3                                               @Z40LB22
TXT15    DC    Y(TXT15F-TXT15A)        ENTRY LENGTH            @Z40LB22
         DC    X'4000'                 HEADER FLAG             @Z40LB22
         DC    H'3'                    HEADLINE COUNT          @Z40LB22
         DC    H'7'                    PAGE LINES              @Z40LB22
         SPACE 1                                               @Z40LB22
* SPACING CONTROL SUB-STRUCTURE                                @Z40LB22
TXT15A   DC    X'4000'                 SPACE CONTROL FLAG      @Z40LB22
         DC    H'3'                    SPACING FACTOR          @Z40LB22
         DC    C'R '                   SPACING TYPE            @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT SUB-STRUCTURE                                    @Z40LB22
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB22
         DC    Y(STE151B-STE151A)      TEXT LENGTH             @Z40LB22
         DC    Y(STE151A-TXT15A)       TEXT OFFSET             @Z40LB22
         DC    H'1'                    PRINT COLUMN            @Z40LB22
         DC    Y(STE151B-STE151A)      PRINT FIELD LENGTH      @Z40LB22
         DC    H'0'                    CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT ENTRIES                                          @Z40LB22
* SPACING CONTROL SUB-STRUCTURE                                @Z40LB22
         DC    X'4000'                 SPACE CONTROL FLAG      @Z40LB22
         DC    H'2'                    SPACING FACTOR          @Z40LB22
         DC    C'R '                   SPACING TYPE            @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT SUB-STRUCTURE                                    @Z40LB22
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB22
         DC    Y(STE151D-STE151C)      TEXT LENGTH             @Z40LB22
         DC    Y(STE151C-TXT15A)       TEXT OFFSET             @Z40LB22
         DC    H'1'                    PRINT COLUMN            @Z40LB22
         DC    Y(STE151D-STE151C)      PRINT FIELD LENGTH      @Z40LB22
         DC    H'0'                    CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* SPACING CONTROL SUB-STRUCTURE                                @Z40LB22
         DC    X'4000'                 SPACE CONTROL FLAG      @Z40LB22
         DC    H'1'                    SPACING FACTOR          @Z40LB22
         DC    C'R '                   SPACING TYPE            @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT SUB-STRUCTURE                                    @Z40LB22
         DC    X'8400'                 STATIC TEXT FLAG        @Z40LB22
         DC    Y(STE151F-STE151E)      TEXT LENGTH             @Z40LB22
         DC    Y(STE151E-TXT15A)       TEXT OFFSET             @Z40LB22
         DC    H'1'                    PRINT COLUMN            @Z40LB22
         DC    Y(STE151F-STE151E)      PRINT FIELD LENGTH      @Z40LB22
         DC    H'0'                    CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT ENTRIES                                          @Z40LB22
STE151A  DC    C'                CELLS FOUND OCCUPIED (MSC '   @Z40LB22
         DC    C'TABLES INDICATE VACANT)'                      @Z40LB22
STE151B  EQU   *                                               @Z40LB22
STE151C  DC    C'        X  Y  Z    X  Y  Z    X  Y  Z    '    @Z40LB22
         DC    C'X  Y  Z    X  Y  Z    X  Y  Z'                @Z40LB22
STE151D  EQU   *                                               @Z40LB22
STE151E  DC    C' '                                            @Z40LB22
STE151F  EQU   *                                               @Z40LB22
TXT15F   EQU   *                                               @Z40LB22
         EJECT                                                 @Z40LB22
************************************************************** @Z40LB22
*                                                              @Z40LB22
*                    VACANT CELLS                              @Z40LB22
* IDCAU03 (HEADER)                                             @Z40LB22
*                                                              @Z40LB22
************************************************************** @Z40LB22
         SPACE 3                                               @Z40LB22
TXT16    DC    Y(TXT16F-TXT16A)        ENTRY LENGTH            @Z40LB22
         DC    X'4000'                 HEADER FLAG             @Z40LB22
         DC    H'3'                    HEADLINE COUNT          @Z40LB22
         DC    H'7'                    PAGE LINES              @Z40LB22
         SPACE 1                                               @Z40LB22
* SPACING CONTROL SUB-STRUCTURE                                @Z40LB22
TXT16A   DC    X'4000'                 SPACE CONTROL FLAG      @Z40LB22
         DC    H'3'                    SPACING FACTOR          @Z40LB22
         DC    C'R '                   SPACING TYPE            @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT SUB-STRUCTURE                                    @Z40LB22
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB22
         DC    Y(STE161B-STE161A)      TEXT LENGTH             @Z40LB22
         DC    Y(STE161A-TXT16A)       TEXT OFFSET             @Z40LB22
         DC    H'1'                    PRINT COLUMN            @Z40LB22
         DC    Y(STE161B-STE161A)      PRINT FIELD LENGTH      @Z40LB22
         DC    H'0'                    CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* SPACING CONTROL SUB-STRUCTURE                                @Z40LB22
         DC    X'4000'                 SPACE CONTROL FLAG      @Z40LB22
         DC    H'2'                    SPACING FACTOR          @Z40LB22
         DC    C'R '                   SPACING TYPE            @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT SUB-STRUCTURE                                    @Z40LB22
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB22
         DC    Y(STE161D-STE161C)      TEXT LENGTH             @Z40LB22
         DC    Y(STE161C-TXT16A)       TEXT OFFSET             @Z40LB22
         DC    H'1'                    PRINT COLUMN            @Z40LB22
         DC    Y(STE161D-STE161C)      PRINT FIELD LENGTH      @Z40LB22
         DC    H'0'                    CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* SPACING CONTROL SUB-STRUCTURE                                @Z40LB22
         DC    X'4000'                 SPACE CONTROL FLAG      @Z40LB22
         DC    H'1'                    SPACING FACTOR          @Z40LB22
         DC    C'R '                   SPACING TYPE            @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT SUB-STRUCTURE                                    @Z40LB22
         DC    X'8400'                 STATIC TEXT FLAG        @Z40LB22
         DC    Y(STE161F-STE161E)      TEXT LENGTH             @Z40LB22
         DC    Y(STE161E-TXT16A)       TEXT OFFSET             @Z40LB22
         DC    H'1'                    PRINT COLUMN            @Z40LB22
         DC    Y(STE161F-STE161E)      PRINT FIELD LENGTH      @Z40LB22
         DC    H'0'                    CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT ENTRIES                                          @Z40LB22
STE161A  DC    C'                                   VACANT '   @Z40LB22
         DC    C'CELLS'                                        @Z40LB22
STE161B  EQU   *                                               @Z40LB22
STE161C  DC    C'        X  Y  Z    X  Y  Z    X  Y  Z    '    @Z40LB22
         DC    C'X  Y  Z    X  Y  Z    X  Y  Z'                @Z40LB22
STE161D  EQU   *                                               @Z40LB22
STE161E  DC    C' '                                            @Z40LB22
STE161F  EQU   *                                               @Z40LB22
TXT16F   EQU   *                                               @Z40LB22
         EJECT                                                 @Z40LB22
************************************************************** @Z40LB22
*                                                              @Z40LB22
*           AUDITMSS MSF N  (READ - XRANGE, NOLIST)            @Z40LB22
* IDCAU03 (SUBTITLE)                                           @Z40LB22
*                                                              @Z40LB22
************************************************************** @Z40LB22
         SPACE 3                                               @Z40LB22
TXT17    DC    Y(TXT17B-TXT17A)        ENTRY LENGTH            @Z40LB22
         DC    X'0000'                 MESSAGE FLAG            @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT SUB-STRUCTURE                                    @Z40LB22
TXT17A   DC    X'0400'                 STATIC TEXT FLAG        @Z40LB22
         DC    Y(STE171B-STE171A)      TEXT LENGTH             @Z40LB22
         DC    Y(STE171A-TXT17A)       TEXT OFFSET             @Z40LB22
         DC    H'1'                    PRINT COLUMN            @Z40LB22
         DC    Y(STE171B-STE171A)      PRINT FIELD LENGTH      @Z40LB22
         DC    H'0'                    CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* INSERT DATA SUB-STRUCTURE                                    @Z40LB22
         DC    X'A000'                 INSERT DATA FLAG        @Z40LB22
         DC    H'1'                    INSERT REFERENCE NUMBER @Z40LB22
         DC    H'0'                    RESERVED                @Z40LB22
         DC    H'36'                   PRINT COLUMN            @Z40LB22
         DC    H'1'                    OUTPUT LENGTH           @Z40LB22
         DC    X'1060'                 CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT ENTRIES                                          @Z40LB22
STE171A  DC    C'-'                                            @Z40LB22
         DC    C'                     AUDITMSS MSF N  '        @Z40LB22
         DC    C'(READ - XRANGE, NOLIST)'                      @Z40LB22
STE171B  EQU   *                                               @Z40LB22
TXT17B   EQU   *                                               @Z40LB22
         EJECT                                                 @Z40LB22
************************************************************** @Z40LB22
*                                                              @Z40LB22
*           AUDITMSS MSF N  (READ - XRANGE, LIST)              @Z40LB22
* IDCAU03 (SUBTITLE)                                           @Z40LB22
*                                                              @Z40LB22
************************************************************** @Z40LB22
         SPACE 3                                               @Z40LB22
TXT18    DC    Y(TXT18B-TXT18A)        ENTRY LENGTH            @Z40LB22
         DC    X'0000'                 MESSAGE FLAG            @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT SUB-STRUCTURE                                    @Z40LB22
TXT18A   DC    X'0400'                 STATIC TEXT FLAG        @Z40LB22
         DC    Y(STE181B-STE181A)      TEXT LENGTH             @Z40LB22
         DC    Y(STE181A-TXT18A)       TEXT OFFSET             @Z40LB22
         DC    H'1'                    PRINT COLUMN            @Z40LB22
         DC    Y(STE181B-STE181A)      PRINT FIELD LENGTH      @Z40LB22
         DC    H'0'                    CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* INSERT DATA SUB-STRUCTURE                                    @Z40LB22
         DC    X'A000'                 INSERT DATA FLAG        @Z40LB22
         DC    H'1'                    INSERT REFERENCE NUMBER @Z40LB22
         DC    H'0'                    RESERVED                @Z40LB22
         DC    H'36'                   PRINT COLUMN            @Z40LB22
         DC    H'1'                    OUTPUT LENGTH           @Z40LB22
         DC    X'1060'                 CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT ENTRIES                                          @Z40LB22
STE181A  DC    C'-'                                            @Z40LB22
         DC    C'                     AUDITMSS MSF N  '        @Z40LB22
         DC    C'(READ - XRANGE, LIST)'                        @Z40LB22
STE181B  EQU   *                                               @Z40LB22
TXT18B   EQU   *                                               @Z40LB22
         EJECT                                                 @Z40LB22
************************************************************** @Z40LB22
*                                                              @Z40LB22
*           AUDITMSS MSF N  (READ - CELL, NOLIST)              @Z40LB22
* IDCAU03 (SUBTITLE)                                           @Z40LB22
*                                                              @Z40LB22
************************************************************** @Z40LB22
         SPACE 3                                               @Z40LB22
TXT19    DC    Y(TXT19B-TXT19A)        ENTRY LENGTH            @Z40LB22
         DC    X'0000'                 MESSAGE FLAG            @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT SUB-STRUCTURE                                    @Z40LB22
TXT19A   DC    X'0400'                 STATIC TEXT FLAG        @Z40LB22
         DC    Y(STE191B-STE191A)      TEXT LENGTH             @Z40LB22
         DC    Y(STE191A-TXT19A)       TEXT OFFSET             @Z40LB22
         DC    H'1'                    PRINT COLUMN            @Z40LB22
         DC    Y(STE191B-STE191A)      PRINT FIELD LENGTH      @Z40LB22
         DC    H'0'                    CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* INSERT DATA SUB-STRUCTURE                                    @Z40LB22
         DC    X'A000'                 INSERT DATA FLAG        @Z40LB22
         DC    H'1'                    INSERT REFERENCE NUMBER @Z40LB22
         DC    H'0'                    RESERVED                @Z40LB22
         DC    H'36'                   PRINT COLUMN            @Z40LB22
         DC    H'1'                    OUTPUT LENGTH           @Z40LB22
         DC    X'1060'                 CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT ENTRIES                                          @Z40LB22
STE191A  DC    C'-'                                            @Z40LB22
         DC    C'                     AUDITMSS MSF N  '        @Z40LB22
         DC    C'(READ - CELL, NOLIST)'                        @Z40LB22
STE191B  EQU   *                                               @Z40LB22
TXT19B   EQU   *                                               @Z40LB22
         EJECT                                                 @Z40LB22
************************************************************** @Z40LB22
*                                                              @Z40LB22
* TXT20** AUDITMSS MSF N - MAP OF BACK (CC)                    @Z40LB22
* IDCAU02                                                      @Z40LB22
*                                                              @Z40LB22
************************************************************** @Z40LB22
         SPACE 3                                               @Z40LB22
TXT20    DC    Y(TXT20B-TXT20A)        ENTRY LENGTH            @Z40LB22
         DC    X'0000'                 MESSAGE FLAG            @Z40LB22
         SPACE 1                                               @Z40LB22
* SPACING CONTROL SUB-STRUCTURE                                @Z40LB22
TXT20A   DC    X'4000'                 SPACE CONTROL FLAG      @Z40LB22
         DC    H'3'                    SPACING FACTOR          @Z40LB22
         DC    C'E '                   SPACING TYPE            @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT SUB-STRUCTURE                                    @Z40LB22
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB22
         DC    Y(STE201B-STE201A)      TEXT LENGTH             @Z40LB22
         DC    Y(STE201A-TXT20A)       TEXT OFFSET             @Z40LB22
         DC    H'1'                    PRINT COLUMN            @Z40LB22
         DC    Y(STE201B-STE201A)      PRINT FIELD LENGTH      @Z40LB22
         DC    H'0'                    CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* INSERT DATA SUB-STRUCTURE                                    @Z40LB22
         DC    X'2000'                 INSERT DATA FLAG        @Z40LB22
         DC    H'1'                    INSERT REFERENCE NUMBER @Z40LB22
         DC    H'0'                    RESERVED                @Z40LB22
         DC    H'14'                   PRINT COLUMN            @Z40LB22
         DC    H'1'                    OUTPUT LENGTH           @Z40LB22
         DC    X'1060'                 CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* INSERT DATA SUB-STRUCTURE                                    @Z40LB22
         DC    X'A000'                 INSERT DATA FLAG        @Z40LB22
         DC    H'2'                    INSERT REFERENCE NUMBER @Z40LB22
         DC    H'0'                    RESERVED                @Z40LB22
         DC    H'31'                   PRINT COLUMN            @Z40LB22
         DC    H'2'                    OUTPUT LENGTH           @Z40LB22
         DC    X'0000'                 CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT ENTRIES                                          @Z40LB22
STE201A  DC    C'AUDITMSS MSF N - MAP OF BACK (CC)'            @Z40LB22
STE201B  EQU   *                                               @Z40LB22
TXT20B   EQU   *                                               @Z40LB22
         EJECT                                                 @Z40LB22
*************************************************************  @Z40LB22
*                                                           *  @Z40LB22
* A1 MSF**'   234    240 245 247'                           *  @Z40LB22
* IDCAU02                                                   *  @Z40LB22
*                                                           *  @Z40LB22
*************************************************************  @Z40LB22
         SPACE 1                                               @Z40LB22
TXT21    DC    Y(TXT21B-TXT21A)        ENTRY LENGTH            @Z40LB22
         DC    X'0000'                 MESSAGE FLAG            @Z40LB22
         SPACE 1                                               @Z40LB22
* SPACING CONTROL SUB-STRUCTURE                                @Z40LB22
TXT21A   DC    X'4000'                 SPACE CONTROL FLAG      @Z40LB22
         DC    H'1'                    SPACING FACTOR          @Z40LB22
         DC    C'R '                   SPACING TYPE            @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT SUB-STRUCTURE                                    @Z40LB22
         DC    X'8400'                 STATIC TEXT FLAG        @Z40LB22
         DC    Y(STE211B-STE211A)      TEXT LENGTH             @Z40LB22
         DC    Y(STE211A-TXT21A)       TEXT OFFSET             @Z40LB22
         DC    H'1'                    PRINT COLUMN            @Z40LB22
         DC    Y(STE211B-STE211A)        PRINT FIELD LENGTH    @Z40LB22
         DC    H'0'                    CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT ENTRIES                                          @Z40LB22
STE211A  DC    C'   234    240 245 247'                        @Z40LB22
STE211B  EQU   *                                               @Z40LB22
TXT21B   EQU   *                                               @Z40LB22
         EJECT                                                 @Z40LB22
*************************************************************  @Z40LB22
*                                                           *  @Z40LB22
*         '   234    240 245 247'                           *  @Z40LB22
* A1 MSF**'     ×     ×    × ×  '                           *  @Z40LB22
* IDCAU02                                                   *  @Z40LB22
*                                                           *  @Z40LB22
*************************************************************  @Z40LB22
         SPACE 1                                               @Z40LB22
TXT22    DC    Y(TXT22B-TXT22A)        ENTRY LENGTH            @Z40LB22
         DC    X'0000'                 MESSAGE FLAG            @Z40LB22
         SPACE 1                                               @Z40LB22
* SPACING CONTROL SUB-STRUCTURE                                @Z40LB22
TXT22A   DC    X'4000'                 SPACE CONTROL FLAG      @Z40LB22
         DC    H'1'                    SPACING FACTOR          @Z40LB22
         DC    C'R '                   SPACING TYPE            @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT SUB-STRUCTURE                                    @Z40LB22
         DC    X'8400'                 STATIC TEXT FLAG        @Z40LB22
         DC    Y(STE221B-STE221A)      TEXT LENGTH             @Z40LB22
         DC    Y(STE221A-TXT22A)       TEXT OFFSET             @Z40LB22
         DC    H'1'                    PRINT COLUMN            @Z40LB22
         DC    Y(STE221B-STE221A)      PRINT FIELD LENGTH      @Z40LB22
         DC    H'0'                    CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT ENTRIES                                          @Z40LB22
STE221A  DC    C'     ×     ×    × ×  '                        @Z40LB22
STE221B  EQU   *                                               @Z40LB22
TXT22B   EQU   *                                               @Z40LB22
         EJECT                                                 @Z40LB22
*************************************************************  @Z40LB22
*                                                           *  @Z40LB22
* A2 MSF**'    206 210  215  220  225  230  235  240 245'   *  @Z40LB22
*         ' 247'                                            *  @Z40LB22
* IDCAU02                                                   *  @Z40LB22
*                                                           *  @Z40LB22
*************************************************************  @Z40LB22
         SPACE 1                                               @Z40LB22
TXT23    DC    Y(TXT23B-TXT23A)        ENTRY LENGTH            @Z40LB22
         DC    X'0000'                 MESSAGE FLAG            @Z40LB22
         SPACE 1                                               @Z40LB22
* SPACING CONTROL SUB-STRUCTURE                                @Z40LB22
TXT23A   DC    X'4000'                 SPACE CONTROL FLAG      @Z40LB22
         DC    H'1'                    SPACING FACTOR          @Z40LB22
         DC    C'R '                   SPACING TYPE            @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT SUB-STRUCTURE                                    @Z40LB22
         DC    X'8400'                 STATIC TEXT FLAG        @Z40LB22
         DC    Y(STE231B-STE231A)      TEXT LENGTH             @Z40LB22
         DC    Y(STE231A-TXT23A)       TEXT OFFSET             @Z40LB22
         DC    H'1'                    PRINT COLUMN            @Z40LB22
         DC    Y(STE231B-STE231A)      PRINT FIELD LENGTH      @Z40LB22
         DC    H'0'                    CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT ENTRIES                                          @Z40LB22
STE231A  DC    C'    206 210  215  220  225  230'              @Z40LB22
         DC    C'  235  240 245 247'                           @Z40LB22
STE231B  EQU   *                                               @Z40LB22
TXT23B   EQU   *                                               @Z40LB22
         EJECT                                                 @Z40LB22
*************************************************************  @Z40LB22
*                                                           *  @Z40LB22
*         '    206 210  215  220  225  230  235  240 245'   *  @Z40LB22
* A2 MSF**'     ×   ×    ×    ×    ×    ×    ×    ×    ×'   *  @Z40LB22
*         ' 247'                                            *  @Z40LB22
*         ' ×  '                                            *  @Z40LB22
* IDCAU02                                                   *  @Z40LB22
*                                                           *  @Z40LB22
*************************************************************  @Z40LB22
         SPACE 1                                               @Z40LB22
TXT24    DC    Y(TXT24B-TXT24A)        ENTRY LENGTH            @Z40LB22
         DC    X'0000'                 MESSAGE FLAG            @Z40LB22
         SPACE 1                                               @Z40LB22
* SPACING CONTROL SUB-STRUCTURE                                @Z40LB22
TXT24A   DC    X'4000'                 SPACE CONTROL FLAG      @Z40LB22
         DC    H'1'                    SPACING FACTOR          @Z40LB22
         DC    C'R '                   SPACING TYPE            @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT SUB-STRUCTURE                                    @Z40LB22
         DC    X'8400'                 STATIC TEXT FLAG        @Z40LB22
         DC    Y(STE241B-STE241A)      TEXT LENGTH             @Z40LB22
         DC    Y(STE241A-TXT24A)       TEXT OFFSET             @Z40LB22
         DC    H'1'                    PRINT COLUMN            @Z40LB22
         DC    Y(STE241B-STE241A)      PRINT FIELD LENGTH      @Z40LB22
         DC    H'0'                    CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT ENTRIES                                          @Z40LB22
STE241A  DC    C'     ×   ×    ×    ×    ×    ×'               @Z40LB22
         DC    C'    ×    ×    × ×'                            @Z40LB22
STE241B  EQU   *                                               @Z40LB22
TXT24B   EQU   *                                               @Z40LB22
         EJECT                                                 @Z40LB22
*************************************************************  @Z40LB22
*                                                           *  @Z40LB22
* A3 MSF**'   178 180 185  190  200  205  210  215  220'    *  @Z40LB22
*         '  225  230  235  240 245 247'                    *  @Z40LB22
* IDCAU02                                                   *  @Z40LB22
*                                                           *  @Z40LB22
*************************************************************  @Z40LB22
         SPACE 1                                               @Z40LB22
TXT25    DC    Y(TXT25B-TXT25A)        ENTRY LENGTH            @Z40LB22
         DC    X'0000'                 MESSAGE FLAG            @Z40LB22
         SPACE 1                                               @Z40LB22
* SPACING CONTROL SUB-STRUCTURE                                @Z40LB22
TXT25A   DC    X'4000'                 SPACE CONTROL FLAG      @Z40LB22
         DC    H'1'                    SPACING FACTOR          @Z40LB22
         DC    C'R '                   SPACING TYPE            @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT SUB-STRUCTURE                                    @Z40LB22
         DC    X'8400'                 STATIC TEXT FLAG        @Z40LB22
         DC    Y(STE251B-STE251A)      TEXT LENGTH             @Z40LB22
         DC    Y(STE251A-TXT25A)       TEXT OFFSET             @Z40LB22
         DC    H'1'                    PRINT COLUMN            @Z40LB22
         DC    Y(STE251B-STE251A)      PRINT FIELD LENGTH      @Z40LB22
         DC    H'0'                    CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT ENTRIES                                          @Z40LB22
STE251A  DC    C'   178 180 185  190  195  200  205  210  215' @Z40LB22
         DC    C'  220  225  230  235  240 245 247'            @Z40LB22
STE251B  EQU   *                                               @Z40LB22
TXT25B   EQU   *                                               @Z40LB22
         EJECT                                                 @Z40LB22
*************************************************************  @Z40LB22
*                                                           *  @Z40LB22
*         '   178 180 185  190  200  205  210  215  220'    *  @Z40LB22
* A3 MSF**'     × ×    ×    ×    ×    ×    ×    ×    ×'     *  @Z40LB22
*         '  225  230  235  240 245 247'                    *  @Z40LB22
*         '   ×    ×    ×    ×   ×  ×'                      *  @Z40LB22
* IDCAU02                                                   *  @Z40LB22
*                                                           *  @Z40LB22
*************************************************************  @Z40LB22
         SPACE 1                                               @Z40LB22
TXT26    DC    Y(TXT26B-TXT26A)        ENTRY LENGTH            @Z40LB22
         DC    X'0000'                 MESSAGE FLAG            @Z40LB22
         SPACE 1                                               @Z40LB22
* SPACING CONTROL SUB-STRUCTURE                                @Z40LB22
TXT26A   DC    X'4000'                 SPACE CONTROL FLAG      @Z40LB22
         DC    H'1'                    SPACING FACTOR          @Z40LB22
         DC    C'R '                   SPACING TYPE            @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT SUB-STRUCTURE                                    @Z40LB22
         DC    X'8400'                 STATIC TEXT FLAG        @Z40LB22
         DC    Y(STE261B-STE261A)      TEXT LENGTH             @Z40LB22
         DC    Y(STE261A-TXT26A)       TEXT OFFSET             @Z40LB22
         DC    H'1'                    PRINT COLUMN            @Z40LB22
         DC    Y(STE261B-STE261A)      PRINT FIELD LENGTH      @Z40LB22
         DC    H'0'                    CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT ENTRIES                                          @Z40LB22
STE261A  DC    C'     × ×    ×    ×    ×    ×    ×    ×'       @Z40LB22
         DC    C'    ×    ×    ×    ×    ×    ×    × ×'        @Z40LB22
STE261B  EQU   *                                               @Z40LB22
TXT26B   EQU   *                                               @Z40LB22
         EJECT                                                 @Z40LB22
*************************************************************  @Z40LB22
*                                                           *  @Z40LB22
* A4 MSF**'    150  155  160  165  170  175  180  185  190' *  @Z40LB22
*         '  195  200  205  210  215  220  225  230  235'   *  @Z40LB22
*         '  240 245 247'                                   *  @Z40LB22
* IDCAU02                                                   *  @Z40LB22
*                                                           *  @Z40LB22
*************************************************************  @Z40LB22
         SPACE 1                                               @Z40LB22
TXT27    DC    Y(TXT27B-TXT27A)        ENTRY LENGTH            @Z40LB22
         DC    X'0000'                 MESSAGE FLAG            @Z40LB22
         SPACE 1                                               @Z40LB22
* SPACING CONTROL SUB-STRUCTURE                                @Z40LB22
TXT27A   DC    X'4000'                 SPACE CONTROL FLAG      @Z40LB22
         DC    H'1'                    SPACING FACTOR          @Z40LB22
         DC    C'R '                   SPACING TYPE            @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT SUB-STRUCTURE                                    @Z40LB22
         DC    X'8400'                 STATIC TEXT FLAG        @Z40LB22
         DC    Y(STE271B-STE271A)      TEXT LENGTH             @Z40LB22
         DC    Y(STE271A-TXT27A)       TEXT OFFSET             @Z40LB22
         DC    H'1'                    PRINT COLUMN            @Z40LB22
         DC    Y(STE271B-STE271A)      PRINT FIELD LENGTH      @Z40LB22
         DC    H'0'                    CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT ENTRIES                                          @Z40LB22
STE271A  DC    C'    150  155  160  165  170  175  180  185'   @Z40LB22
         DC    C'  190  195  200  205  210  215  220  225  '   @Z40LB22
         DC    C'230  235  240 245 247'                        @Z40LB22
STE271B  EQU   *                                               @Z40LB22
TXT27B   EQU   *                                               @Z40LB22
         EJECT                                                 @Z40LB22
*************************************************************  @Z40LB22
*                                                           *  @Z40LB22
*         '    150  155  160  165  170  175  180  185  190' *  @Z40LB22
* A4 MSF**'     ×    ×    ×    ×    ×    ×    ×    ×    × ' *  @Z40LB22
*         '  195  200  205  210  215  220  225  230  235'   *  @Z40LB22
* A4 MSF**'   ×    ×    ×    ×    ×    ×    ×    ×    × '   *  @Z40LB22
*         '  240 245 247'                                   *  @Z40LB22
* A4 MSF**'   ×    × ×'                                     *  @Z40LB22
* IDCAU02                                                   *  @Z40LB22
*                                                           *  @Z40LB22
*************************************************************  @Z40LB22
         SPACE 1                                               @Z40LB22
TXT28    DC    Y(TXT28B-TXT28A)        ENTRY LENGTH            @Z40LB22
         DC    X'0000'                 MESSAGE FLAG            @Z40LB22
         SPACE 1                                               @Z40LB22
* SPACING CONTROL SUB-STRUCTURE                                @Z40LB22
TXT28A   DC    X'4000'                 SPACE CONTROL FLAG      @Z40LB22
         DC    H'1'                    SPACING FACTOR          @Z40LB22
         DC    C'R '                   SPACING TYPE            @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT SUB-STRUCTURE                                    @Z40LB22
         DC    X'8400'                 STATIC TEXT FLAG        @Z40LB22
         DC    Y(STE281B-STE281A)      TEXT LENGTH             @Z40LB22
         DC    Y(STE281A-TXT28A)       TEXT OFFSET             @Z40LB22
         DC    H'1'                    PRINT COLUMN            @Z40LB22
         DC    Y(STE281B-STE281A)      PRINT FIELD LENGTH      @Z40LB22
         DC    H'0'                    CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT ENTRIES                                          @Z40LB22
STE281A  DC    C'     ×    ×    ×    ×    ×    ×    ×    ×'    @Z40LB22
         DC    C'    ×    ×    ×    ×    ×    ×    ×    ×'     @Z40LB22
         DC    C'    ×    ×    ×    × ×'                       @Z40LB22
STE281B  EQU   *                                               @Z40LB22
TXT28B   EQU   *                                               @Z40LB22
         EJECT                                                 @Z40LB22
************************************************************   @Z40LB22
*                                                           *  @Z40LB22
*   TXT29** TOTAL NUMBER OF FULL CELLS: NNNN                   @Z40LB22
* IDCAU02                                                   *  @Z40LB22
*                                                           *  @Z40LB22
************************************************************   @Z40LB22
         SPACE 3                                               @Z40LB22
TXT29    DC    Y(TXT29B-TXT29A)        ENTRY LENGTH            @Z40LB22
         DC    X'0000'                 MESSAGE FLAG            @Z40LB22
         SPACE 1                                               @Z40LB22
* SPACING CONTROL SUB-STRUCTURE                                @Z40LB22
TXT29A   DC    X'4000'                 SPACE CONTROL FLAG      @Z40LB22
         DC    H'3'                    SPACING FACTOR          @Z40LB22
         DC    C'R '                   SPACING TYPE            @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT SUB-STRUCTURE                                    @Z40LB22
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB22
         DC    Y(STE291B-STE291A)      TEXT LENGTH             @Z40LB22
         DC    Y(STE291A-TXT29A)       TEXT OFFSET             @Z40LB22
         DC    H'1'                    PRINT COLUMN            @Z40LB22
         DC    Y(STE291B-STE291A)      PRINT FIELD LENGTH      @Z40LB22
         DC    H'0'                    CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* INSERT DATA SUB-STRUCTURE                                    @Z40LB22
         DC    X'A000'                 INSERT DATA FLAG        @Z40LB22
         DC    H'1'                    INSERT REFERENCE NUMBER @Z40LB22
         DC    H'0'                    RESERVED                @Z40LB22
         DC    H'29'                   PRINT COLUMN            @Z40LB22
         DC    H'4'                    OUTPUT LENGTH           @Z40LB22
         DC    X'1060'                 CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT ENTRIES                                          @Z40LB22
STE291A  DC    C'TOTAL NUMBER OF FULL CELLS: '                 @Z40LB22
STE291B  EQU   *                                               @Z40LB22
TXT29B   EQU   *                                               @Z40LB22
         EJECT                                                 @Z40LB22
************************************************************   @Z40LB22
*                                                           *  @Z40LB22
*   TXT30** TOTAL NUMBER OF EMPTY CELLS: NNNN                  @Z40LB22
* IDCAU02                                                   *  @Z40LB22
*                                                           *  @Z40LB22
************************************************************   @Z40LB22
         SPACE 3                                               @Z40LB22
TXT30    DC    Y(TXT30B-TXT30A)        ENTRY LENGTH            @Z40LB22
         DC    X'0000'                 MESSAGE FLAG            @Z40LB22
         SPACE 1                                               @Z40LB22
* SPACING CONTROL SUB-STRUCTURE                                @Z40LB22
TXT30A   DC    X'4000'                 SPACE CONTROL FLAG      @Z40LB22
         DC    H'2'                    SPACING FACTOR          @Z40LB22
         DC    C'R '                   SPACING TYPE            @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT SUB-STRUCTURE                                    @Z40LB22
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB22
         DC    Y(STE301B-STE301A)      TEXT LENGTH             @Z40LB22
         DC    Y(STE301A-TXT30A)       TEXT OFFSET             @Z40LB22
         DC    H'1'                    PRINT COLUMN            @Z40LB22
         DC    Y(STE301B-STE301A)      PRINT FIELD LENGTH      @Z40LB22
         DC    H'0'                    CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* INSERT DATA SUB-STRUCTURE                                    @Z40LB22
         DC    X'A000'                 INSERT DATA FLAG        @Z40LB22
         DC    H'1'                    INSERT REFERENCE NUMBER @Z40LB22
         DC    H'0'                    RESERVED                @Z40LB22
         DC    H'30'                   PRINT COLUMN            @Z40LB22
         DC    H'4'                    OUTPUT LENGTH           @Z40LB22
         DC    X'1060'                 CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT ENTRIES                                          @Z40LB22
STE301A  DC    C'TOTAL NUMBER OF EMPTY CELLS: '                @Z40LB22
STE301B  EQU   *                                               @Z40LB22
TXT30B   EQU   *                                               @Z40LB22
         EJECT                                                 @Z40LB22
************************************************************** @Z40LB22
*                                                           *  @Z40LB22
* TXT31** C = EMPTY   C = FULL                                 @Z40LB22
* IDCAU02                                                   *  @Z40LB22
*                                                           *  @Z40LB22
************************************************************** @Z40LB22
         SPACE 3                                               @Z40LB22
TXT31    DC    Y(TXT31B-TXT31A)        ENTRY LENGTH            @Z40LB22
         DC    X'0000'                 MESSAGE FLAG            @Z40LB22
         SPACE 1                                               @Z40LB22
* SPACING CONTROL SUB-STRUCTURE                                @Z40LB22
TXT31A   DC    X'4000'                 SPACE CONTROL FLAG      @Z40LB22
         DC    H'2'                    SPACING FACTOR          @Z40LB22
         DC    C'R '                   SPACING TYPE            @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT SUB-STRUCTURE                                    @Z40LB22
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB22
         DC    Y(STE311B-STE311A)      TEXT LENGTH             @Z40LB22
         DC    Y(STE311A-TXT31A)       TEXT OFFSET             @Z40LB22
         DC    H'1'                    PRINT COLUMN            @Z40LB22
         DC    Y(STE311B-STE311A)      PRINT FIELD LENGTH      @Z40LB22
         DC    H'0'                    CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* INSERT DATA SUB-STRUCTURE                                    @Z40LB22
         DC    X'2000'                 INSERT DATA FLAG        @Z40LB22
         DC    H'1'                    INSERT REFERENCE NUMBER @Z40LB22
         DC    H'0'                    RESERVED                @Z40LB22
         DC    H'1'                    PRINT COLUMN            @Z40LB22
         DC    H'1'                    OUTPUT LENGTH           @Z40LB22
         DC    X'0000'                 CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* INSERT DATA SUB-STRUCTURE                                    @Z40LB22
         DC    X'A000'                 INSERT DATA FLAG        @Z40LB22
         DC    H'2'                    INSERT REFERENCE NUMBER @Z40LB22
         DC    H'0'                    RESERVED                @Z40LB22
         DC    H'13'                   PRINT COLUMN            @Z40LB22
         DC    H'1'                    OUTPUT LENGTH           @Z40LB22
         DC    X'0000'                 CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT ENTRIES                                          @Z40LB22
STE311A  DC    C'X = EMPTY   X = FULL'                         @Z40LB22
STE311B  EQU   *                                               @Z40LB22
TXT31B   EQU   *                                               @Z40LB22
         EJECT                                                 @Z40LB22
************************************************************** @Z40LB22
*                                                           *  @Z40LB22
* TXT32** O = EMPTY   * = FULL      (CONSTANT)                 @Z40LB22
* IDCAU02                                                   *  @Z40LB22
*                                                           *  @Z40LB22
************************************************************** @Z40LB22
         SPACE 3                                               @Z40LB22
TXT32    DC    Y(TXT32B-TXT32A)        ENTRY LENGTH            @Z40LB22
         DC    X'0000'                 MESSAGE FLAG            @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT SUB-STRUCTURE                                    @Z40LB22
TXT32A   DC    X'8400'                 STATIC TEXT FLAG        @Z40LB22
         DC    Y(STE321B-STE321A)      TEXT LENGTH             @Z40LB22
         DC    Y(STE321A-TXT32A)       TEXT OFFSET             @Z40LB22
         DC    H'1'                    PRINT COLUMN            @Z40LB22
         DC    Y(STE321B-STE321A)      PRINT FIELD LENGTH      @Z40LB22
         DC    H'0'                    CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT ENTRIES                                          @Z40LB22
STE321A  DC    C'O'                                            @Z40LB22
         DC    C'*'                                            @Z40LB22
STE321B  EQU   *                                               @Z40LB22
TXT32B   EQU   *                                               @Z40LB22
         EJECT                                                 @Z40LB22
************************************************************** @Z40LB22
*                                                           *  @Z40LB22
* TXT33** NOTE: A 120 (BLANK) BYTE BLOCK DATA LINE             @Z40LB22
* IDCAU02                                                   *  @Z40LB22
*                                                           *  @Z40LB22
************************************************************** @Z40LB22
         SPACE 3                                               @Z40LB22
TXT33    DC    Y(TXT33B-TXT33A)        ENTRY LENGTH            @Z40LB22
         DC    X'0000'                 MESSAGE FLAG            @Z40LB22
         SPACE 1                                               @Z40LB22
* SPACING CONTROL SUB-STRUCTURE                                @Z40LB22
TXT33A   DC    X'4000'                 SPACE CONTROL FLAG      @Z40LB22
         DC    H'1'                    SPACING FACTOR          @Z40LB22
         DC    C'R '                   SPACING TYPE            @Z40LB22
         SPACE 1                                               @Z40LB22
* BLOCK DATA SUB-STRUCTURE                                     @Z40LB22
         DC    X'9000'                 BLOCK DATA FLAG         @Z40LB22
         DC    H'120,00,01,120'        LNG,OFST,PC,LNG         @Z40LB22
         DC    X'0000'                 CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
TXT33B   EQU   *                                               @Z40LB22
         EJECT                                                 @Z40LB22
************************************************************** @Z40LB22
*                                                              @Z40LB22
* TXT34** AUDITMSS MSF N - MAP OF FRONT (CC)                   @Z40LB22
* IDCAU02                                                   *  @Z40LB22
*                                                              @Z40LB22
************************************************************** @Z40LB22
         SPACE 3                                               @Z40LB22
TXT34    DC    Y(TXT34B-TXT34A)        ENTRY LENGTH            @Z40LB22
         DC    X'0000'                 MESSAGE FLAG            @Z40LB22
         SPACE 1                                               @Z40LB22
* SPACING CONTROL SUB-STRUCTURE                                @Z40LB22
TXT34A   DC    X'4000'                 SPACE CONTROL FLAG      @Z40LB22
         DC    H'1'                    SPACING FACTOR          @Z40LB22
         DC    C'E '                   SPACING TYPE            @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT SUB-STRUCTURE                                    @Z40LB22
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB22
         DC    Y(STE341B-STE341A)      TEXT LENGTH             @Z40LB22
         DC    Y(STE341A-TXT34A)       TEXT OFFSET             @Z40LB22
         DC    H'1'                    PRINT COLUMN            @Z40LB22
         DC    Y(STE341B-STE341A)      PRINT FIELD LENGTH      @Z40LB22
         DC    H'0'                    CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* INSERT DATA SUB-STRUCTURE                                    @Z40LB22
         DC    X'2000'                 INSERT DATA FLAG        @Z40LB22
         DC    H'1'                    INSERT REFERENCE NUMBER @Z40LB22
         DC    H'0'                    RESERVED                @Z40LB22
         DC    H'14'                   PRINT COLUMN            @Z40LB22
         DC    H'1'                    OUTPUT LENGTH           @Z40LB22
         DC    X'1060'                 CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* INSERT DATA SUB-STRUCTURE                                    @Z40LB22
         DC    X'A000'                 INSERT DATA FLAG        @Z40LB22
         DC    H'2'                    INSERT REFERENCE NUMBER @Z40LB22
         DC    H'0'                    RESERVED                @Z40LB22
         DC    H'32'                   PRINT COLUMN            @Z40LB22
         DC    H'2'                    OUTPUT LENGTH           @Z40LB22
         DC    X'0000'                 CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT ENTRIES                                          @Z40LB22
STE341A  DC    C'AUDITMSS MSF N - MAP OF FRONT (CC)'           @Z40LB22
STE341B  EQU   *                                               @Z40LB22
TXT34B   EQU   *                                               @Z40LB22
         EJECT                                                 @Z40LB22
************************************************************** @Z40LB22
*                                                              @Z40LB22
*           AUDITMSS MSF N  (READ - CELL, LIST)                @Z40LB22
* IDCAU03 (SUBTITLE)                                           @Z40LB22
*                                                              @Z40LB22
************************************************************** @Z40LB22
         SPACE 3                                               @Z40LB22
TXT35    DC    Y(TXT35B-TXT35A)        ENTRY LENGTH            @Z40LB22
         DC    X'0000'                 MESSAGE FLAG            @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT SUB-STRUCTURE                                    @Z40LB22
TXT35A   DC    X'0400'                 STATIC TEXT FLAG        @Z40LB22
         DC    Y(STE351B-STE351A)      TEXT LENGTH             @Z40LB22
         DC    Y(STE351A-TXT35A)       TEXT OFFSET             @Z40LB22
         DC    H'1'                    PRINT COLUMN            @Z40LB22
         DC    Y(STE351B-STE351A)      PRINT FIELD LENGTH      @Z40LB22
         DC    H'0'                    CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* INSERT DATA SUB-STRUCTURE                                    @Z40LB22
         DC    X'A000'                 INSERT DATA FLAG        @Z40LB22
         DC    H'1'                    INSERT REFERENCE NUMBER @Z40LB22
         DC    H'0'                    RESERVED                @Z40LB22
         DC    H'36'                   PRINT COLUMN            @Z40LB22
         DC    H'1'                    OUTPUT LENGTH           @Z40LB22
         DC    X'1060'                 CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT ENTRIES                                          @Z40LB22
STE351A  DC    C'-'                                            @Z40LB22
         DC    C'                     AUDITMSS MSF N  '        @Z40LB22
         DC    C'(READ - CELL, LIST)'                          @Z40LB22
STE351B  EQU   *                                               @Z40LB22
TXT35B   EQU   *                                               @Z40LB22
         EJECT                                                 @Z40LB22
************************************************************** @Z40LB22
*                                                              @Z40LB22
*               STID 36 IS NOT USED                            @Z40LB22
*                                                              @Z40LB22
************************************************************** @Z40LB22
         EJECT                                                 @Z40LB22
************************************************************** @Z40LB22
*                                                              @Z40LB22
*               CARTRIDGES NOT ACCESSED                        @Z40LB22
* IDCAU03 (HEADER)                                             @Z40LB22
*                                                              @Z40LB22
************************************************************** @Z40LB22
         SPACE 3                                               @Z40LB22
TXT37    DC    Y(TXT37F-TXT37A)        ENTRY LENGTH            @Z40LB22
         DC    X'4000'                 HEADER FLAG             @Z40LB22
         DC    H'3'                    HEADLINE COUNT          @Z40LB22
         DC    H'7'                    PAGE LINES              @Z40LB22
         SPACE 1                                               @Z40LB22
* SPACING CONTROL SUB-STRUCTURE                                @Z40LB22
TXT37A   DC    X'4000'                 SPACE CONTROL FLAG      @Z40LB22
         DC    H'3'                    SPACING FACTOR          @Z40LB22
         DC    C'R '                   SPACING TYPE            @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT SUB-STRUCTURE                                    @Z40LB22
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB22
         DC    Y(STE371B-STE371A)      TEXT LENGTH             @Z40LB22
         DC    Y(STE371A-TXT37A)       TEXT OFFSET             @Z40LB22
         DC    H'1'                    PRINT COLUMN            @Z40LB22
         DC    Y(STE371B-STE371A)      PRINT FIELD LENGTH      @Z40LB22
         DC    H'0'                    CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* SPACING CONTROL SUB-STRUCTURE                                @Z40LB22
         DC    X'4000'                 SPACE CONTROL FLAG      @Z40LB22
         DC    H'2'                    SPACING FACTOR          @Z40LB22
         DC    C'R '                   SPACING TYPE            @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT SUB-STRUCTURE                                    @Z40LB22
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB22
         DC    Y(STE371D-STE371C)      TEXT LENGTH             @Z40LB22
         DC    Y(STE371C-TXT37A)       TEXT OFFSET             @Z40LB22
         DC    H'1'                    PRINT COLUMN            @Z40LB22
         DC    Y(STE371D-STE371C)      PRINT FIELD LENGTH      @Z40LB22
         DC    H'0'                    CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* SPACING CONTROL SUB-STRUCTURE                                @Z40LB22
         DC    X'4000'                 SPACE CONTROL FLAG      @Z40LB22
         DC    H'1'                    SPACING FACTOR          @Z40LB22
         DC    C'R '                   SPACING TYPE            @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT SUB-STRUCTURE                                    @Z40LB22
         DC    X'8400'                 STATIC TEXT FLAG        @Z40LB22
         DC    Y(STE371F-STE371E)      TEXT LENGTH             @Z40LB22
         DC    Y(STE371E-TXT37A)       TEXT OFFSET             @Z40LB22
         DC    H'1'                    PRINT COLUMN            @Z40LB22
         DC    Y(STE371F-STE371E)      PRINT FIELD LENGTH      @Z40LB22
         DC    H'0'                    CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT ENTRIES                                          @Z40LB22
STE371A  DC    C'                             CARTRIDGES '     @Z40LB22
         DC    C'NOT ACCESSED'                                 @Z40LB22
STE371B  EQU   *                                               @Z40LB22
STE371C  DC    C'        X  Y  Z    X  Y  Z    X  Y  Z    '    @Z40LB22
         DC    C'X  Y  Z    X  Y  Z    X  Y  Z'                @Z40LB22
STE371D  EQU   *                                               @Z40LB22
STE371E  DC    C' '                                            @Z40LB22
STE371F  EQU   *                                               @Z40LB22
TXT37F   EQU   *                                               @Z40LB22
         EJECT                                                 @Z40LB22
************************************************************** @Z40LB22
*                                                              @Z40LB22
*     CARTRIDGE LABELS CONTAINING INCORRECT CELL LOCATIONS     @Z40LB22
* IDCAU03 (HEADER)                                             @Z40LB22
*                                                              @Z40LB22
************************************************************** @Z40LB22
         SPACE 3                                               @Z40LB22
TXT38    DC    Y(TXT38H-TXT38A)        ENTRY LENGTH            @Z40LB22
         DC    X'4000'                 HEADER FLAG             @Z40LB22
         DC    H'4'                    HEADLINE COUNT          @Z40LB22
         DC    H'8'                    PAGE LINES              @Z40LB22
         SPACE 1                                               @Z40LB22
* SPACING CONTROL SUB-STRUCTURE                                @Z40LB22
TXT38A   DC    X'4000'                 SPACE CONTROL FLAG      @Z40LB22
         DC    H'3'                    SPACING FACTOR          @Z40LB22
         DC    C'R '                   SPACING TYPE            @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT SUB-STRUCTURE                                    @Z40LB22
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB22
         DC    Y(STE381B-STE381A)      TEXT LENGTH             @Z40LB22
         DC    Y(STE381A-TXT38A)       TEXT OFFSET             @Z40LB22
         DC    H'1'                    PRINT COLUMN            @Z40LB22
         DC    Y(STE381B-STE381A)      PRINT FIELD LENGTH      @Z40LB22
         DC    H'0'                    CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* SPACING CONTROL SUB-STRUCTURE                                @Z40LB22
         DC    X'4000'                 SPACE CONTROL FLAG      @Z40LB22
         DC    H'2'                    SPACING FACTOR          @Z40LB22
         DC    C'R '                   SPACING TYPE            @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT SUB-STRUCTURE                                    @Z40LB22
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB22
         DC    Y(STE381D-STE381C)      TEXT LENGTH             @Z40LB22
         DC    Y(STE381C-TXT38A)       TEXT OFFSET             @Z40LB22
         DC    H'1'                    PRINT COLUMN            @Z40LB22
         DC    Y(STE381D-STE381C)      PRINT FIELD LENGTH      @Z40LB22
         DC    H'0'                    CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* SPACING CONTROL SUB-STRUCTURE                                @Z40LB22
         DC    X'4000'                 SPACE CONTROL FLAG      @Z40LB22
         DC    H'1'                    SPACING FACTOR          @Z40LB22
         DC    C'R '                   SPACING TYPE            @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT SUB-STRUCTURE                                    @Z40LB22
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB22
         DC    Y(STE381F-STE381E)      TEXT LENGTH             @Z40LB22
         DC    Y(STE381E-TXT38A)       TEXT OFFSET             @Z40LB22
         DC    H'1'                    PRINT COLUMN            @Z40LB22
         DC    Y(STE381F-STE381E)      PRINT FIELD LENGTH      @Z40LB22
         DC    H'0'                    CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* SPACING CONTROL SUB-STRUCTURE                                @Z40LB22
         DC    X'4000'                 SPACE CONTROL FLAG      @Z40LB22
         DC    H'1'                    SPACING FACTOR          @Z40LB22
         DC    C'R '                   SPACING TYPE            @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT SUB-STRUCTURE                                    @Z40LB22
         DC    X'8400'                 STATIC TEXT FLAG        @Z40LB22
         DC    Y(STE381H-STE381G)      TEXT LENGTH             @Z40LB22
         DC    Y(STE381G-TXT38A)       TEXT OFFSET             @Z40LB22
         DC    H'1'                    PRINT COLUMN            @Z40LB22
         DC    Y(STE381H-STE381G)      PRINT FIELD LENGTH      @Z40LB22
         DC    H'0'                    CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT ENTRIES                                          @Z40LB22
STE381A  DC    C'               CARTRIDGE LABELS CONTAINING '  @Z40LB22
         DC    C'INCORRECT CELL LOCATIONS'                     @Z40LB22
STE381B  EQU   *                                               @Z40LB22
STE381C  DC    C'LOCATION            ----------------------'   @Z40LB22
         DC    C'CARTRIDGE LABELS----------------------'       @Z40LB22
STE381D  EQU   *                                               @Z40LB22
STE381E  DC    C' X  Y  Z             X  Y  Z  MSF      CNS1'  @Z40LB22
         DC    C'          CSN2      SEQ  VOLUME  TYPE'        @Z40LB22
STE381F  EQU   *                                               @Z40LB22
STE381G  DC    C' '                                            @Z40LB22
STE381H  EQU   *                                               @Z40LB22
TXT38H   EQU   *                                               @Z40LB22
         EJECT                                                 @Z40LB22
************************************************************** @Z40LB22
*                                                              @Z40LB22
*                    OCCUPIED CELLS                            @Z40LB22
* IDCAU03 (HEADER)                                             @Z40LB22
*                                                              @Z40LB22
************************************************************** @Z40LB22
         SPACE 3                                               @Z40LB22
TXT39    DC    Y(TXT39H-TXT39A)        ENTRY LENGTH            @Z40LB22
         DC    X'4000'                 HEADER FLAG             @Z40LB22
         DC    H'4'                    HEADLINE COUNT          @Z40LB22
         DC    H'8'                    PAGE LINES              @Z40LB22
         SPACE 1                                               @Z40LB22
* SPACING CONTROL SUB-STRUCTURE                                @Z40LB22
TXT39A   DC    X'4000'                 SPACE CONTROL FLAG      @Z40LB22
         DC    H'3'                    SPACING FACTOR          @Z40LB22
         DC    C'R '                   SPACING TYPE            @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT SUB-STRUCTURE                                    @Z40LB22
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB22
         DC    Y(STE391B-STE391A)      TEXT LENGTH             @Z40LB22
         DC    Y(STE391A-TXT39A)       TEXT OFFSET             @Z40LB22
         DC    H'1'                    PRINT COLUMN            @Z40LB22
         DC    Y(STE391B-STE391A)      PRINT FIELD LENGTH      @Z40LB22
         DC    H'0'                    CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* SPACING CONTROL SUB-STRUCTURE                                @Z40LB22
         DC    X'4000'                 SPACE CONTROL FLAG      @Z40LB22
         DC    H'2'                    SPACING FACTOR          @Z40LB22
         DC    C'R '                   SPACING TYPE            @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT SUB-STRUCTURE                                    @Z40LB22
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB22
         DC    Y(STE391D-STE391C)      TEXT LENGTH             @Z40LB22
         DC    Y(STE391C-TXT39A)       TEXT OFFSET             @Z40LB22
         DC    H'1'                    PRINT COLUMN            @Z40LB22
         DC    Y(STE391D-STE391C)      PRINT FIELD LENGTH      @Z40LB22
         DC    H'0'                    CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* SPACING CONTROL SUB-STRUCTURE                                @Z40LB22
         DC    X'4000'                 SPACE CONTROL FLAG      @Z40LB22
         DC    H'1'                    SPACING FACTOR          @Z40LB22
         DC    C'R '                   SPACING TYPE            @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT SUB-STRUCTURE                                    @Z40LB22
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB22
         DC    Y(STE391F-STE391E)      TEXT LENGTH             @Z40LB22
         DC    Y(STE391E-TXT39A)       TEXT OFFSET             @Z40LB22
         DC    H'1'                    PRINT COLUMN            @Z40LB22
         DC    Y(STE391F-STE391E)      PRINT FIELD LENGTH      @Z40LB22
         DC    H'0'                    CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* SPACING CONTROL SUB-STRUCTURE                                @Z40LB22
         DC    X'4000'                 SPACE CONTROL FLAG      @Z40LB22
         DC    H'1'                    SPACING FACTOR          @Z40LB22
         DC    C'R '                   SPACING TYPE            @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT SUB-STRUCTURE                                    @Z40LB22
         DC    X'8400'                 STATIC TEXT FLAG        @Z40LB22
         DC    Y(STE391H-STE391G)      TEXT LENGTH             @Z40LB22
         DC    Y(STE391G-TXT39A)       TEXT OFFSET             @Z40LB22
         DC    H'1'                    PRINT COLUMN            @Z40LB22
         DC    Y(STE391H-STE391G)      PRINT FIELD LENGTH      @Z40LB22
         DC    H'0'                    CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT ENTRIES                                          @Z40LB22
STE391A  DC    C'                                  OCCUPIED'   @Z40LB22
         DC    C' CELLS'                                       @Z40LB22
STE391B  EQU   *                                               @Z40LB22
STE391C  DC    C'LOCATION  MISMATCH  ----------------------'   @Z40LB22
         DC    C'CARTRIDGE LABELS----------------------'       @Z40LB22
STE391D  EQU   *                                               @Z40LB22
STE391E  DC    C' X  Y  Z     (*)     X  Y  Z  MSF      CNS1'  @Z40LB22
         DC    C'          CSN2      SEQ  VOLUME  TYPE'        @Z40LB22
STE391F  EQU   *                                               @Z40LB22
STE391G  DC    C' '                                            @Z40LB22
STE391H  EQU   *                                               @Z40LB22
TXT39H   EQU   *                                               @Z40LB22
         EJECT                                                 @Z40LB22
************************************************************** @Z40LB22
*                                                              @Z40LB22
*               STID 40 IS NOT USED                            @Z40LB22
*                                                              @Z40LB22
************************************************************** @Z40LB22
         EJECT                                                 @Z40LB22
************************************************************** @Z40LB22
*                                                              @Z40LB22
*               STID 41 IS NOT USED                            @Z40LB22
*                                                              @Z40LB22
************************************************************** @Z40LB22
         EJECT                                                 @Z40LB22
************************************************************** @Z40LB22
*                                                              @Z40LB22
*               STID 42 IS NOT USED                            @Z40LB22
*                                                              @Z40LB22
************************************************************** @Z40LB22
         EJECT                                                 @Z40LB22
************************************************************** @Z40LB22
*                                                              @Z40LB22
*               STID 43 IS NOT USED                            @Z40LB22
*                                                              @Z40LB22
************************************************************** @Z40LB22
         EJECT                                                 @Z40LB22
************************************************************** @Z40LB22
*                                                              @Z40LB22
* IDC31148I  ** NO CHECK REPORT PRODUCED,                      @Z40LB22
*               ERROR WITHIN X RANGE NNN NNN                   @Z40LB22
* IDCAU03                                                      @Z40LB22
*                                                              @Z40LB22
************************************************************** @Z40LB22
         SPACE 3                                               @Z40LB22
TXT44    DC    Y(TXT44B-TXT44A)        ENTRY LENGTH            @Z40LB22
         DC    X'8000'                 MESSAGE FLAG            @Z40LB22
         SPACE 1                                               @Z40LB22
* SPACING CONTROL SUB-STRUCTURE                                @Z40LB22
TXT44A   DC    X'4000'                 SPACE CONTROL FLAG      @Z40LB22
         DC    H'2'                    SPACING FACTOR          @Z40LB22
         DC    C'R '                   SPACING TYPE            @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT SUB-STRUCTURE                                    @Z40LB22
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB22
         DC    Y(STE441B-STE441A)      TEXT LENGTH             @Z40LB22
         DC    Y(STE441A-TXT44A)       TEXT OFFSET             @Z40LB22
         DC    H'1'                    PRINT COLUMN            @Z40LB22
         DC    Y(STE441B-STE441A)      PRINT FIELD LENGTH      @Z40LB22
         DC    H'0'                    CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* INSERT DATA SUB-STRUCTURE                                    @Z40LB22
         DC    X'2000'                 INSERT DATA FLAG        @Z40LB22
         DC    H'1'                    INSERT REFERENCE NUMBER @Z40LB22
         DC    H'0'                    RESERVED                @Z40LB22
         DC    H'62'                   PRINT COLUMN            @Z40LB22
         DC    H'3'                    OUTPUT LENGTH           @Z40LB22
         DC    X'1060'                 CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* INSERT DATA SUB-STRUCTURE                                    @Z40LB22
         DC    X'A000'                 INSERT DATA FLAG        @Z40LB22
         DC    H'2'                    INSERT REFERENCE NUMBER @Z40LB22
         DC    H'0'                    RESERVED                @Z40LB22
         DC    H'66'                   PRINT COLUMN            @Z40LB22
         DC    H'3'                    OUTPUT LENGTH           @Z40LB22
         DC    X'1060'                 CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT ENTRIES                                          @Z40LB22
STE441A  DC    C'IDC31148I  ** NO CHECK REPORT '               @Z40LB22
         DC    C'PRODUCED, ERROR WITHIN X RANGE NNN NNN'       @Z40LB22
STE441B  EQU   *                                               @Z40LB22
TXT44B   EQU   *                                               @Z40LB22
         EJECT                                                 @Z40LB22
************************************************************** @Z40LB22
*                                                              @Z40LB22
* IDC31145I  ** NO READ REPORT PRODUCED,                       @Z40LB22
*               ERROR AT X LOCATION NNN                        @Z40LB22
* IDCAU03                                                      @Z40LB22
*                                                              @Z40LB22
************************************************************** @Z40LB22
         SPACE 3                                               @Z40LB22
TXT45    DC    Y(TXT45B-TXT45A)        ENTRY LENGTH            @Z40LB22
         DC    X'8000'                 MESSAGE FLAG            @Z40LB22
         SPACE 1                                               @Z40LB22
* SPACING CONTROL SUB-STRUCTURE                                @Z40LB22
TXT45A   DC    X'4000'                 SPACE CONTROL FLAG      @Z40LB22
         DC    H'2'                    SPACING FACTOR          @Z40LB22
         DC    C'R '                   SPACING TYPE            @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT SUB-STRUCTURE                                    @Z40LB22
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB22
         DC    Y(STE451B-STE451A)      TEXT LENGTH             @Z40LB22
         DC    Y(STE451A-TXT45A)       TEXT OFFSET             @Z40LB22
         DC    H'1'                    PRINT COLUMN            @Z40LB22
         DC    Y(STE451B-STE451A)      PRINT FIELD LENGTH      @Z40LB22
         DC    H'0'                    CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* INSERT DATA SUB-STRUCTURE                                    @Z40LB22
         DC    X'A000'                 INSERT DATA FLAG        @Z40LB22
         DC    H'1'                    INSERT REFERENCE NUMBER @Z40LB22
         DC    H'0'                    RESERVED                @Z40LB22
         DC    H'60'                   PRINT COLUMN            @Z40LB22
         DC    H'3'                    OUTPUT LENGTH           @Z40LB22
         DC    X'1060'                 CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT ENTRIES                                          @Z40LB22
STE451A  DC    C'IDC31145I  ** NO READ REPORT '                @Z40LB22
         DC    C'PRODUCED, ERROR AT X LOCATION NNN'            @Z40LB22
STE451B  EQU   *                                               @Z40LB22
TXT45B   EQU   *                                               @Z40LB22
         EJECT                                                 @Z40LB22
***************************************************************@Z40LB22
*                                                             *@Z40LB22
* IDC01146I  NO DISCREPANCIES FOUND, REPORT NOT PRINTED       *@Z40LB22
* IDCAU03                                                     *@Z40LB22
*                                                             *@Z40LB22
***************************************************************@Z40LB22
         SPACE 3                                               @Z40LB22
TXT46    DC    Y(TXT46B-TXT46A)        ENTRY LENGTH            @Z40LB22
         DC    X'8000'                 MESSAGE FLAG            @Z40LB22
         SPACE 1                                               @Z40LB22
* SPACING CONTROL SUB-STRUCTURE                                @Z40LB22
TXT46A   DC    X'4000'                 SPACE CONTROL FLAG      @Z40LB22
         DC    H'2'                    SPACING FACTOR          @Z40LB22
         DC    C'R '                   SPACING TYPE            @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT SUB-STRUCTURE                                    @Z40LB22
         DC    X'8400'                 STATIC TEXT FLAG        @Z40LB22
         DC    Y(STE461B-STE461A)      TEXT LENGTH             @Z40LB22
         DC    Y(STE461A-TXT46A)       TEXT OFFSET             @Z40LB22
         DC    H'1'                    PRINT COLUMN            @Z40LB22
         DC    Y(STE461B-STE461A)      PRINT FIELD LENGTH      @Z40LB22
         DC    H'0'                    CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT ENTRIES                                          @Z40LB22
STE461A  DC    C'IDC01146I  NO DISCREPANCIES FOUND, REPORT '   @Z40LB22
         DC    C'NOT PRINTED'                                  @Z40LB22
STE461B  EQU   *                                               @Z40LB22
TXT46B   EQU   *                                               @Z40LB22
         EJECT                                                 @Z40LB22
************************************************************** @Z40LB22
*                                                              @Z40LB22
* TXT47** VACANT CELL LOCATIONS (150 12 0 ETC..)               @Z40LB22
* IDCAU03                                                      @Z40LB22
*                                                              @Z40LB22
************************************************************** @Z40LB22
         SPACE 3                                               @Z40LB22
TXT47    DC    Y(TXT47B-TXT47A)        ENTRY LENGTH            @Z40LB22
         DC    X'0000'                 MESSAGE FLAG            @Z40LB22
         SPACE 1                                               @Z40LB22
* SPACING CONTROL SUB-STRUCTURE                                @Z40LB22
TXT47A   DC    X'4000'                 SPACE CONTROL FLAG      @Z40LB22
         DC    H'1'                    SPACING FACTOR          @Z40LB22
         DC    C'R '                   SPACING TYPE            @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT SUB-STRUCTURE                                    @Z40LB22
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB22
         DC    Y(STE471B-STE471A)      TEXT LENGTH             @Z40LB22
         DC    Y(STE471A-TXT47A)       TEXT OFFSET             @Z40LB22
         DC    H'1'                    PRINT COLUMN            @Z40LB22
         DC    Y(STE471B-STE471A)      PRINT FIELD LENGTH      @Z40LB22
         DC    H'0'                    CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* INSERT DATA SUB-STRUCTURE                                    @Z40LB22
         DC    X'2000'                 INSERT DATA FLAG        @Z40LB22
         DC    H'1'                    INSERT REFERENCE NUMBER @Z40LB22
         DC    H'0'                    RESERVED                @Z40LB22
         DC    H'8'                    PRINT COLUMN            @Z40LB22
         DC    H'3'                    OUTPUT LENGTH           @Z40LB22
         DC    X'1060'                 CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* INSERT DATA SUB-STRUCTURE                                    @Z40LB22
         DC    X'2000'                 INSERT DATA FLAG        @Z40LB22
         DC    H'2'                    INSERT REFERENCE NUMBER @Z40LB22
         DC    H'0'                    RESERVED                @Z40LB22
         DC    H'12'                   PRINT COLUMN            @Z40LB22
         DC    H'2'                    OUTPUT LENGTH           @Z40LB22
         DC    X'1060'                 CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* INSERT DATA SUB-STRUCTURE                                    @Z40LB22
         DC    X'2000'                 INSERT DATA FLAG        @Z40LB22
         DC    H'3'                    INSERT REFERENCE NUMBER @Z40LB22
         DC    H'0'                    RESERVED                @Z40LB22
         DC    H'15'                   PRINT COLUMN            @Z40LB22
         DC    H'1'                    OUTPUT LENGTH           @Z40LB22
         DC    X'1060'                 CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* INSERT DATA SUB-STRUCTURE                                    @Z40LB22
         DC    X'2000'                 INSERT DATA FLAG        @Z40LB22
         DC    H'4'                    INSERT REFERENCE NUMBER @Z40LB22
         DC    H'0'                    RESERVED                @Z40LB22
         DC    H'19'                   PRINT COLUMN            @Z40LB22
         DC    H'3'                    OUTPUT LENGTH           @Z40LB22
         DC    X'1060'                 CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* INSERT DATA SUB-STRUCTURE                                    @Z40LB22
         DC    X'2000'                 INSERT DATA FLAG        @Z40LB22
         DC    H'5'                    INSERT REFERENCE NUMBER @Z40LB22
         DC    H'0'                    RESERVED                @Z40LB22
         DC    H'23'                   PRINT COLUMN            @Z40LB22
         DC    H'2'                    OUTPUT LENGTH           @Z40LB22
         DC    X'1060'                 CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* INSERT DATA SUB-STRUCTURE                                    @Z40LB22
         DC    X'2000'                 INSERT DATA FLAG        @Z40LB22
         DC    H'6'                    INSERT REFERENCE NUMBER @Z40LB22
         DC    H'0'                    RESERVED                @Z40LB22
         DC    H'26'                   PRINT COLUMN            @Z40LB22
         DC    H'1'                    OUTPUT LENGTH           @Z40LB22
         DC    X'1060'                 CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* INSERT DATA SUB-STRUCTURE                                    @Z40LB22
         DC    X'2000'                 INSERT DATA FLAG        @Z40LB22
         DC    H'7'                    INSERT REFERENCE NUMBER @Z40LB22
         DC    H'0'                    RESERVED                @Z40LB22
         DC    H'30'                   PRINT COLUMN            @Z40LB22
         DC    H'3'                    OUTPUT LENGTH           @Z40LB22
         DC    X'1060'                 CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* INSERT DATA SUB-STRUCTURE                                    @Z40LB22
         DC    X'2000'                 INSERT DATA FLAG        @Z40LB22
         DC    H'8'                    INSERT REFERENCE NUMBER @Z40LB22
         DC    H'0'                    RESERVED                @Z40LB22
         DC    H'34'                   PRINT COLUMN            @Z40LB22
         DC    H'2'                    OUTPUT LENGTH           @Z40LB22
         DC    X'1060'                 CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* INSERT DATA SUB-STRUCTURE                                    @Z40LB22
         DC    X'2000'                 INSERT DATA FLAG        @Z40LB22
         DC    H'9'                    INSERT REFERENCE NUMBER @Z40LB22
         DC    H'0'                    RESERVED                @Z40LB22
         DC    H'37'                   PRINT COLUMN            @Z40LB22
         DC    H'1'                    OUTPUT LENGTH           @Z40LB22
         DC    X'1060'                 CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* INSERT DATA SUB-STRUCTURE                                    @Z40LB22
         DC    X'2000'                 INSERT DATA FLAG        @Z40LB22
         DC    H'10'                   INSERT REFERENCE NUMBER @Z40LB22
         DC    H'0'                    RESERVED                @Z40LB22
         DC    H'41'                   PRINT COLUMN            @Z40LB22
         DC    H'3'                    OUTPUT LENGTH           @Z40LB22
         DC    X'1060'                 CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* INSERT DATA SUB-STRUCTURE                                    @Z40LB22
         DC    X'2000'                 INSERT DATA FLAG        @Z40LB22
         DC    H'11'                   INSERT REFERENCE NUMBER @Z40LB22
         DC    H'0'                    RESERVED                @Z40LB22
         DC    H'45'                   PRINT COLUMN            @Z40LB22
         DC    H'2'                    OUTPUT LENGTH           @Z40LB22
         DC    X'1060'                 CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* INSERT DATA SUB-STRUCTURE                                    @Z40LB22
         DC    X'2000'                 INSERT DATA FLAG        @Z40LB22
         DC    H'12'                   INSERT REFERENCE NUMBER @Z40LB22
         DC    H'0'                    RESERVED                @Z40LB22
         DC    H'48'                   PRINT COLUMN            @Z40LB22
         DC    H'1'                    OUTPUT LENGTH           @Z40LB22
         DC    X'1060'                 CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* INSERT DATA SUB-STRUCTURE                                    @Z40LB22
         DC    X'2000'                 INSERT DATA FLAG        @Z40LB22
         DC    H'13'                   INSERT REFERENCE NUMBER @Z40LB22
         DC    H'0'                    RESERVED                @Z40LB22
         DC    H'52'                   PRINT COLUMN            @Z40LB22
         DC    H'3'                    OUTPUT LENGTH           @Z40LB22
         DC    X'1060'                 CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* INSERT DATA SUB-STRUCTURE                                    @Z40LB22
         DC    X'2000'                 INSERT DATA FLAG        @Z40LB22
         DC    H'14'                   INSERT REFERENCE NUMBER @Z40LB22
         DC    H'0'                    RESERVED                @Z40LB22
         DC    H'56'                   PRINT COLUMN            @Z40LB22
         DC    H'2'                    OUTPUT LENGTH           @Z40LB22
         DC    X'1060'                 CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* INSERT DATA SUB-STRUCTURE                                    @Z40LB22
         DC    X'2000'                 INSERT DATA FLAG        @Z40LB22
         DC    H'15'                   INSERT REFERENCE NUMBER @Z40LB22
         DC    H'0'                    RESERVED                @Z40LB22
         DC    H'59'                   PRINT COLUMN            @Z40LB22
         DC    H'1'                    OUTPUT LENGTH           @Z40LB22
         DC    X'1060'                 CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* INSERT DATA SUB-STRUCTURE                                    @Z40LB22
         DC    X'2000'                 INSERT DATA FLAG        @Z40LB22
         DC    H'16'                   INSERT REFERENCE NUMBER @Z40LB22
         DC    H'0'                    RESERVED                @Z40LB22
         DC    H'63'                   PRINT COLUMN            @Z40LB22
         DC    H'3'                    OUTPUT LENGTH           @Z40LB22
         DC    X'1060'                 CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* INSERT DATA SUB-STRUCTURE                                    @Z40LB22
         DC    X'2000'                 INSERT DATA FLAG        @Z40LB22
         DC    H'17'                   INSERT REFERENCE NUMBER @Z40LB22
         DC    H'0'                    RESERVED                @Z40LB22
         DC    H'67'                   PRINT COLUMN            @Z40LB22
         DC    H'2'                    OUTPUT LENGTH           @Z40LB22
         DC    X'1060'                 CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* INSERT DATA SUB-STRUCTURE                                    @Z40LB22
         DC    X'A000'                 INSERT DATA FLAG        @Z40LB22
         DC    H'18'                   INSERT REFERENCE NUMBER @Z40LB22
         DC    H'0'                    RESERVED                @Z40LB22
         DC    H'70'                   PRINT COLUMN            @Z40LB22
         DC    H'1'                    OUTPUT LENGTH           @Z40LB22
         DC    X'1060'                 CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT ENTRIES                                          @Z40LB22
STE471A  DC    C'                                         '    @Z40LB22
         DC    C'                       '                      @Z40LB22
STE471B  EQU   *                                               @Z40LB22
TXT47B   EQU   *                                               @Z40LB22
         EJECT                                                 @Z40LB22
************************************************************** @Z40LB22
*                                                              @Z40LB22
* TXT48** OCCUPIED CELL LOCATIONS, CSNS, SEQ, VOL, TYPE, ETC.. @Z40LB22
* IDCAU03                                                      @Z40LB22
*                                                              @Z40LB22
************************************************************** @Z40LB22
         SPACE 3                                               @Z40LB22
TXT48    DC    Y(TXT48B-TXT48A)        ENTRY LENGTH            @Z40LB22
         DC    X'0000'                 MESSAGE FLAG            @Z40LB22
         SPACE 1                                               @Z40LB22
* SPACING CONTROL SUB-STRUCTURE                                @Z40LB22
TXT48A   DC    X'4000'                 SPACE CONTROL FLAG      @Z40LB22
         DC    H'1'                    SPACING FACTOR          @Z40LB22
         DC    C'R '                   SPACING TYPE            @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT SUB-STRUCTURE                                    @Z40LB22
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB22
         DC    Y(STE481B-STE481A)      TEXT LENGTH             @Z40LB22
         DC    Y(STE481A-TXT48A)       TEXT OFFSET             @Z40LB22
         DC    H'1'                    PRINT COLUMN            @Z40LB22
         DC    Y(STE481B-STE481A)      PRINT FIELD LENGTH      @Z40LB22
         DC    H'0'                    CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* INSERT DATA SUB-STRUCTURE                                    @Z40LB22
         DC    X'2000'                 INSERT DATA FLAG        @Z40LB22
         DC    H'1'                    INSERT REFERENCE NUMBER @Z40LB22
         DC    H'0'                    RESERVED                @Z40LB22
         DC    H'1'                    PRINT COLUMN            @Z40LB22
         DC    H'3'                    OUTPUT LENGTH           @Z40LB22
         DC    X'1060'                 CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* INSERT DATA SUB-STRUCTURE                                    @Z40LB22
         DC    X'2000'                 INSERT DATA FLAG        @Z40LB22
         DC    H'2'                    INSERT REFERENCE NUMBER @Z40LB22
         DC    H'0'                    RESERVED                @Z40LB22
         DC    H'5'                    PRINT COLUMN            @Z40LB22
         DC    H'2'                    OUTPUT LENGTH           @Z40LB22
         DC    X'1060'                 CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* INSERT DATA SUB-STRUCTURE                                    @Z40LB22
         DC    X'2000'                 INSERT DATA FLAG        @Z40LB22
         DC    H'3'                    INSERT REFERENCE NUMBER @Z40LB22
         DC    H'0'                    RESERVED                @Z40LB22
         DC    H'8'                    PRINT COLUMN            @Z40LB22
         DC    H'1'                    OUTPUT LENGTH           @Z40LB22
         DC    X'1060'                 CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* INSERT DATA SUB-STRUCTURE                                    @Z40LB22
         DC    X'2000'                 INSERT DATA FLAG        @Z40LB22
         DC    H'4'                    INSERT REFERENCE NUMBER @Z40LB22
         DC    H'0'                    RESERVED                @Z40LB22
         DC    H'15'                   PRINT COLUMN            @Z40LB22
         DC    H'1'                    OUTPUT LENGTH           @Z40LB22
         DC    X'0000'                 CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* INSERT DATA SUB-STRUCTURE                                    @Z40LB22
         DC    X'2000'                 INSERT DATA FLAG        @Z40LB22
         DC    H'5'                    INSERT REFERENCE NUMBER @Z40LB22
         DC    H'0'                    RESERVED                @Z40LB22
         DC    H'21'                   PRINT COLUMN            @Z40LB22
         DC    H'3'                    OUTPUT LENGTH           @Z40LB22
         DC    X'1060'                 CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* INSERT DATA SUB-STRUCTURE                                    @Z40LB22
         DC    X'2000'                 INSERT DATA FLAG        @Z40LB22
         DC    H'6'                    INSERT REFERENCE NUMBER @Z40LB22
         DC    H'0'                    RESERVED                @Z40LB22
         DC    H'25'                   PRINT COLUMN            @Z40LB22
         DC    H'2'                    OUTPUT LENGTH           @Z40LB22
         DC    X'1060'                 CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* INSERT DATA SUB-STRUCTURE                                    @Z40LB22
         DC    X'2000'                 INSERT DATA FLAG        @Z40LB22
         DC    H'7'                    INSERT REFERENCE NUMBER @Z40LB22
         DC    H'0'                    RESERVED                @Z40LB22
         DC    H'28'                   PRINT COLUMN            @Z40LB22
         DC    H'1'                    OUTPUT LENGTH           @Z40LB22
         DC    X'1060'                 CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* INSERT DATA SUB-STRUCTURE                                    @Z40LB22
         DC    X'2000'                 INSERT DATA FLAG        @Z40LB22
         DC    H'8'                    INSERT REFERENCE NUMBER @Z40LB22
         DC    H'0'                    RESERVED                @Z40LB22
         DC    H'32'                   PRINT COLUMN            @Z40LB22
         DC    H'1'                    OUTPUT LENGTH           @Z40LB22
         DC    X'1060'                 CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* INSERT DATA SUB-STRUCTURE                                    @Z40LB22
         DC    X'2000'                 INSERT DATA FLAG        @Z40LB22
         DC    H'9'                    INSERT REFERENCE NUMBER @Z40LB22
         DC    H'0'                    RESERVED                @Z40LB22
         DC    H'36'                   PRINT COLUMN            @Z40LB22
         DC    H'12'                   OUTPUT LENGTH           @Z40LB22
         DC    X'0000'                 CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* INSERT DATA SUB-STRUCTURE                                    @Z40LB22
         DC    X'2000'                 INSERT DATA FLAG        @Z40LB22
         DC    H'10'                   INSERT REFERENCE NUMBER @Z40LB22
         DC    H'0'                    RESERVED                @Z40LB22
         DC    H'50'                   PRINT COLUMN            @Z40LB22
         DC    H'12'                   OUTPUT LENGTH           @Z40LB22
         DC    X'0000'                 CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* INSERT DATA SUB-STRUCTURE                                    @Z40LB22
         DC    X'2000'                 INSERT DATA FLAG        @Z40LB22
         DC    H'11'                   INSERT REFERENCE NUMBER @Z40LB22
         DC    H'0'                    RESERVED                @Z40LB22
         DC    H'65'                   PRINT COLUMN            @Z40LB22
         DC    H'1'                    OUTPUT LENGTH           @Z40LB22
         DC    X'0000'                 CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* INSERT DATA SUB-STRUCTURE                                    @Z40LB22
         DC    X'2000'                 INSERT DATA FLAG        @Z40LB22
         DC    H'12'                   INSERT REFERENCE NUMBER @Z40LB22
         DC    H'0'                    RESERVED                @Z40LB22
         DC    H'69'                   PRINT COLUMN            @Z40LB22
         DC    H'6'                    OUTPUT LENGTH           @Z40LB22
         DC    X'0000'                 CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* INSERT DATA SUB-STRUCTURE                                    @Z40LB22
         DC    X'A000'                 INSERT DATA FLAG        @Z40LB22
         DC    H'13'                   INSERT REFERENCE NUMBER @Z40LB22
         DC    H'0'                    RESERVED                @Z40LB22
         DC    H'77'                   PRINT COLUMN            @Z40LB22
         DC    H'4'                    OUTPUT LENGTH           @Z40LB22
         DC    X'0000'                 CONVERSION FLAGS        @Z40LB22
         SPACE 1                                               @Z40LB22
* STATIC TEXT ENTRIES                                          @Z40LB22
STE481A  DC    C'              *                    IBM C'     @Z40LB22
         DC    C'ART0001  IBM CART0002       VOL001  TYPE'     @Z40LB22
STE481B  EQU   *                                               @Z40LB22
TXT48B   EQU   *                                               @Z40LB22
         END
