         IATYABN
         PRINT OFF
         IATYEQU
         IATYREG
         END
ADCD     IATYADCD
AMD      IATYAMD
AME      IATYAME
ATCB     IATYATCB
ATDE     IATYATDE
         END
ATR      IATYATR
ATRE     IATYATRE
BAL      IATYBAL
BDL      IATYBDL
         PRINT OFF
         IATYTVT
         IATYEQU
         IATYREG
         END
BFE      IATYBFE
CBT      IATYCBT
         END
CKI      IATYCKI
         END
CKP      IATYCKP TYPE=DSECT,CKPT=YES
         END
CKR      IATYCKR
         PRINT OFF
         IATYRAB
         IATYEQU
         IATYREG
         END
CMD      IATYCMD
CNB      IATYCNB
         END
CNC      IATYCNC TYPE=DSECT
         PRINT OFF
         IATYEQU
         IATYREG
         IATYCNS TYPE=(INPUT,OUTPUT,MLOG,FCTQ),CODES=YES
         END
CND      IATYCND
CNR      IATYCNR
CNS      IATYCNS TYPE=(INPUT,OUTPUT,MLOG,FCTQ),CODES=YES
CNT      IATYCNT
CNU      IATYCNU
CPB      IATYCPB
CPP      IATYCPP
CSR      IATYCSR
CTB      IATYCTB SRF=YES,TYPE=INISH
         END
         PRINT OFF
         IATYEQU
         IATYREG
         DSECT
MPCSTART EQU   *
         PRINT ON
CTC      IATYCTC
         END
CTE      IATYCTE
CVAL     RATYCVAL TYPE=DSECT                               *LBD 02/84*
CXE      IATYCXE
DAT      IATYDAT
DCC      IATYDDC
DDL      IATYDDL
DDR      IATYDDR WORK=YES
         PRINT OFF
         IATYSEL
         IATYEQU
         IATYREG
         END
         PRINT OFF
         IATYTVT
         IATYEQU
         IATYREG
         PRINT ON
DEL      IATYDEL
         END
DFC      IATYDFC
DFR      IATYDFR
         END
         PRINT OFF
         IATYEQU
         IATYREG
         IATYJNT
         IATYTVT
         IATYFCT
         IATYCNS TYPE=(INPUT,OUTPUT,MLOG,FCTQ),CODES=YES
         PRINT ON
DJC      IATYDJC
         END
         PRINT OFF
         IATYDAT
         PRINT  ON
DJS      IATYDJS
DLF      IATYDLF
DLT      IATYDLT
DMC      IATYDMC
DNT      IATYDNT
DSB      IATYDSB
         END
DSN      IATYDSN
DSP      IATYDSP
DSQ      IATYDSQ
DSS      IATYDSS
         END
         DSECT
DUM      IATYDUM
DST      IATYDST
DVE      IATYDVE
DYA      IATYDYA
DYD      IATYDYD
DYN      IATYDYN
DYQ      IATYDYQ
DYR      IATYDYR
ECF      IATYECF
ELB      IATYELB
         DSECT
         IATYEQU
         END
FCT      IATYFCT
FDB      IATYFDB
FDD      IATYFDD
FMH      IATYFMH
         DSECT
FRP      IATYFRP
FSLA     IATYFSLA
FSW      IATYFSW
         DSECT
GMS      IATYGMS
GSD      IATYGSD
HWS      IATYHWS
ICA      IATYICA
ICT      IATYICT
         PRINT OFF
         IATYMPS TYPE=DSECT
         IATYJDS
         IATYEQU
         IATYREG
         END
ICW      IATYICW TYPE=DSECT
         END
         PRINT OFF
         IATYFCT
         IATYTVT
         IATYEQU
         IATYREG
         PRINT ON
IDD      IATYIDD
         END
IEB      IATYIEB
         END
IIW      IATYIIW
         END
         PRINT OFF
         IATYCNS TYPE=(INPUT,OUTPUT,MLOG,FCTQ),CODES=YES
         IATYTVT
         IATYFCT
         IATYEQU
         IATYREG
         PRINT ON
IJP      IATYIJP TYPE=DSECT
         END
IJS      IATYIJS
INC      IATYINC
INM      IATYINM
         PRINT OFF
         IATYJST
         IATYEQU
         IATYREG
         END
         PRINT OFF
         IATYTVT
         IATYEQU
         IATYREG
         PRINT ON
INT      IATYINT
         END
         PRINT OFF
         IATYTVT
         IATYDLF
         IATYSEL
         IATYEQU
         IATYREG
         IATYDSN
         IATYFCT
         IATYCNS TYPE=(INPUT,OUTPUT,MLOG,FCTQ),CODES=YES
         PRINT ON
ISR      IATYISR
ITK      IATYITK
JBT      IATYJBT
JCT      IATYJCT
JDAB     IATYJDA
JDE      IATYJDE
JDS      IATYJDS
JIB      IATYJIB
JMQ      IATYJMQ
JMR      IATYJMR
JNM      IATYJNM
JNR      IATYJNR
JNT      IATYJNT
JOB      IATYJOB
JQE      IATYJQE
JQX      IATYJQX
         END
         PRINT OFF
         IATYTVT
         IATYDLF
         IATYEQU
         IATYREG
         IATYDSN
         IATYFCT
         IATYCNS TYPE=(INPUT,OUTPUT,MLOG,FCTQ),CODES=YES
         PRINT ON
         DSECT
JSA      IATYJSA TYPE=DSECT
         DSECT
JST      IATYJST
JSW      IATYJSW
JVT      IATYJVT
LCB      IATYLCB
LCQC     RATYLCQC                                          *LBD 02/84*
LET      IATYLET
LOC      IATYLOC
LOCRESP  IATYLRS
LVS      IATYLVS
MAR      IATYMAR
MCL      IATYMCL TYPE=DSECT
MDS      IATYMDS TYPE=DSECT
MEM      IATYMEM
MFT      IATYMFT TYPE=DSECT
MGP      IATYMGP TYPE=DSECT
MGR      IATYMGR
MIE      IATYMIE
MIH      IATYMIH
MJE      IATYMJE
MJH      IATYMJH
MLB      IATYMLB TYPE=DSECT
MPC      IATYMPC
MSQ      IATYMSQ
MSU      IATYMSU
MSV      IATYMSV
MTAT     IATYMTC
MTV      IATYMTV TYPE=
MWA      IATYMWA
NAM      IATYNAM
         END
         PRINT OFF
         IATYEQU
         IATYREG
         IATYDSN
         IATYFCT
         IATYTVT
         IATYCNS TYPE=(INPUT,OUTPUT,MLOG,FCTQ),CODES=YES
         PRINT ON
NBF      IATYNBF
         DSECT
NCB      IATYNCB
         DSECT
NCK      IATYNCK
NCM      IATYNCM
NCN      IATYNCN
NCP      IATYNCP TYPE=DSECT
NCQ      IATYNCQ
NCT      IATYNCT
NDH      IATYNDH
NDP      IATYNDP
         END
         PRINT OFF
         IATYEQU
         IATYREG
         IATYDSN
         IATYFCT
         DSECT
         IATYNCB
         IATYTVT
         IATYRSQ
         IATYCNS TYPE=(INPUT,OUTPUT,MLOG,FCTQ),CODES=YES
         PRINT ON
NDT      IATYNDT
NET      IATYNET TYPE=DSECT
NFD      IATYNFD
NFR      IATYNFR
NJD      IATYNJD TYPE=DSECT
NJE      IATYNJE
NJH      IATYNJH
NJO      IATYNJO TYPE=DSECT
NJP      IATYNJP
NJT      IATYNJT
NJY      IATYNJY
NLG      IATYNLG
NOD      IATYNOD
NRG      IATYNRG
NRQ      IATYNRQ
         DSECT
NSM      IATYNSM
OAT      IATYOAT
OCK      IATYOCK
OSD      IATYOSD
         DSECT
OSE      IATYOSE TYPE=DSECT
         END
OSS      IATYOSS
OS1      IATYOS1
OS2      IATYOS2
OS3      IATYOS3
OS4      IATYOS4
OS5      IATYOS5
OS6      IATYOS6
OS7      IATYOS7
         END
         PRINT OFF
         IATYEQU
         IATYREG
         IATYFCT
         IATYTVT
         IATYCNS TYPE=(INPUT,OUTPUT,MLOG,FCTQ),CODES=YES
         IATYSUP RMT=ALL
         IATYWSP TYPE=DSECT
         PRINT ON
IATYPAR  IATYPAR
PAS      IATYPAS
PAT      IATYPAT
PCD      IATYPCD
PDIR     IATYPDIR
PFK      IATYPFK
PID      IATYPID
PPQ      IATYPPQ
         END
         PRINT OFF
         IATYEQU
         IATYREG
         IATYFCT
         IATYTVT
         IATYCNS TYPE=(INPUT,OUTPUT,MLOG,FCTQ),CODES=YES
         IATYSUP RMT=ALL
         IATYWSP TYPE=DSECT
         PRINT ON
PRM      IATYPRM
IATYPRO  IATYPRO
PUR      IATYPUR
RAB      IATYRAB
RAT      IATYRAT TYPE=DSECT
RDS      IATYRDS TYPE=DSECT
         DSECT
RES      IATYRES
RIE      IATYRIE
RIO      IATYRIO
RIP      IATY#RIP TYPE=CSECT
         DSECT                                             *LBD 02/84*
RIR      IATYRIR
         END
         PRINT OFF
         IATYEQU
         IATYREG
         IATYFCT
         IATYTVT
         IATYCNS TYPE=(INPUT,OUTPUT,MLOG,FCTQ),CODES=YES
         IATYSUP RMT=ALL
         PRINT ON
RJB      IATYRJB TYPE=DSECT
RJP      IATYRJP TYPE=DSECT
RJS      IATYRJS TYPE=DSECT
         END
         PRINT OFF
         IATYEQU
         IATYREG
         IATYFCT
         IATYCNS TYPE=(INPUT,OUTPUT,MLOG,FCTQ),CODES=YES
         PRINT ON
RLT      IATYRLT TYPE=DSECT,ENTRY=ALL
         DSECT
RPL      IATYRPL
RSQ      IATYRSQ
RSR      IATYRSR
RXE      IATYRXE
SAT      IATYSAT
         END
SAV      IATYSAV
SCB      IATYSCB
SCT      IATYSCT
SDG      IATYSDG
SET      IATYSET
         END
         PRINT OFF
         IATYEQU
         IATYREG
         IATYFCT
         IATYTVT
         IATYMPC
         IATYCNS TYPE=(INPUT,OUTPUT,MLOG,FCTQ),CODES=YES
         IATYSUP RMT=ALL
         PRINT ON
         DSECT
SMR      IATYSMR
SOR      IATYSOR
SPB      IATYSPB
SPCI     IATYSPC
SPP      IATYSPP TYPE=DSECT
SEQ      IATYSQE
SRD      IATYSRD
SRF      IATYSRF PREFIX=SRF                                 *LBD 02/84*
SRT      IATYSRT
         DSECT
SSCX     IATYSSCX
         DSECT
SSXE     IATYSSXE
         END
         PRINT OFF
         IATYEQU
         IATYREG
         IATYDSN
         IATYFCT
         DSECT
         IATYNCB
         IATYRSQ
         IATYCNS TYPE=(INPUT,OUTPUT,MLOG,FCTQ),CODES=YES
         PRINT ON
STA      IATYSTA
STP      IATYSTP
STT      IATYSTT
SUP      IATYSUP RMT=ALL
SVT      IATYSVT
SVX      IATYSVX
SYS      IATYSYS
S35      IATYS35
TFC      IATYTFC
TPC      IATYTPC
         END
         PRINT OFF
         IATYREG
         IATYFCT
         IATYSEL
         IATYSTA
         IATYWSP
         PRINT ON
TSWKGRWP IATYTSWK MOD=GRWP
         END
         PRINT OFF
         IATYFCT
         IATYREG
         IATYSEL
         IATYSTA
         IATYWSP
         PRINT ON
TSWKGRWQ IATYTSWK MOD=GRWQ
         END
         PRINT OFF
         IATYFCT
         IATYREG
         IATYSEL
         IATYSTA
         IATYWSP
         PRINT ON
TSWKNULL IATYTSWK MOD=NULL,OLD=YES
         END
         PRINT OFF
         IATYFCT
         IATYREG
         IATYSEL
         IATYSTA
         IATYWSP
         PRINT ON
TSWKPURG IATYTSWK MOD=PURG
         END
         PRINT OFF
         IATYFCT
         IATYREG
         IATYSEL
         IATYSTA
         IATYWSP
         PRINT ON
TSWKSICN IATYTSWK MOD=SICN
         END
         PRINT OFF
         IATYFCT
         IATYREG
         IATYSEL
         IATYSTA
         IATYWSP
         PRINT ON
TSWKSIOP IATYTSWK MOD=SIOP
         END
         PRINT OFF
         IATYFCT
         IATYREG
         IATYSEL
         IATYSTA
         IATYWSP
         PRINT ON
TSWKSIST IATYTSWK MOD=SIST
         END
         PRINT OFF
         IATYFCT
         IATYREG
         IATYSEL
         IATYSTA
         IATYWSP
         PRINT ON
TSWKSIVL IATYTSWK MOD=SIVL
         END
         PRINT OFF
         IATYFCT
         IATYREG
         IATYSEL
         IATYSTA
         IATYWSP
         PRINT ON
TSWKUX30 IATYTSWK MOD=UX30
         END
         PRINT OFF
         IATYEQU
         IATYREG
         IATYDSN
         IATYFCT
         DSECT
         IATYNCB
         IATYRSQ
         IATYCNS TYPE=(INPUT,OUTPUT,MLOG,FCTQ),CODES=YES
         PRINT ON
TQE      IATYTQE
TRCE     IATYTRC
TVT      IATYTVT
UCN      IATYUCN
UTAB     IATYUTB
UVR      IATYUVR
UXL      IATYUXL TYPE=DSECT
VAT      IATYVAT
         DSECT
VCK      IATYVCK
VFY      IATYVFY TYPE=DSECT
VLM      IATYVLM
VOL      IATYVOL
VSR      IATYVSR
VTS      IATYVTS TYPE=DSECT
VUA      IATYVUA
VUP      IATYVUP
         DSECT
VUT      IATYVUT
WSB      IATYWSB
WSP      IATYWSP TYPE=DSECT
WTD      IATYWTD
WTO      IATYWTO
XPR      IATYXPR
XTN      IATYXTN
         END
