//SSPXDD2  JOB (143030,SVS1,TN,SYSTEMS),
//             DAVIS,
//             CLASS=T,
//             MSGCLASS=X,
//             NOTIFY=SSPXDD
//STEP020  EXEC PGM=IDCAMS
//SYSPRINT DD  SYSOUT=*
//FILEOUT  DD  DSN=SSPV.DMS.ACCT.KSDS,
//             DISP=SHR
//SYSPRINT DD  SYSOUT=*
   VERIFY FILE(FILEOUT)
   REPRO -
         INFILE(FILEIN) -
         OUTFILE(FILEOUT) -
         REUSE
   PRINT -
         INFILE(FILEOUT)
//*NODE--------->AAAAAAPPPPUUUUUUUUUUUUUUUUUUUUUUUUUNNNNNNNNNNNNNNNNNN
//FILEIN   DD  *
APPXAT           143020
APPXBC           143020
APPXBK           143020
APPXBT           143020
APPXCC           143020
APPXCS           143020
APPXDB           143020
APPXDH           143020
APPXDM           143020
APPXDO           143020
APPXDR           143020
APPXDS           143020
APPXDV           143020
APPXEJ           143020
APPXGI           143020
APPXHI           143020
APPXJB           143020
APPXJD           143020
APPXJK           143020
APPXJM           143020
APPXJN           143020
APPXJO           143020
APPXJP           143020
APPXKS           143020
APPXPC           143020
APPXPK           143020
APPXRB           143020
APPXRH           143020
APPXRU           143020
APPXRW           143020
APPXST           143020
APPXTO           143020
APPXWS           143020
CAPEX            143030
CNV              143020M205
CNVT             143020M205
CNVXAM           143020M205
CNVX01           143020M205
CNVX02           143020M205
CNVX03           143020M205
CNVX04           143020M205
CNVX05           143020M205
CNVY             143020M205
DBAXSG           143030
DBDC             143030
DDEP             143030
DDET             143030
DDEXAD           DDE
DDEXDE           DDE
DDEXMO           DDE
DDEXSH           DDE
DMXV             DMX
DMXY             DMX
EACP             W14EAC
EACT             W14EAC
EACV             W14EAC
EACY             W14EAC
EARP             W14EAR
EART             W14EAR
EARV             W14EAR
EARY             W14EAR
EAS              W14EAR
EASP             W14EAR
EAST             W14EAR
EASV             W14EAR
EASY             W14EAR
EGB              W14EGB
EGBP             W14EGB
EGBT             W14EGB
EGBV             W14EGB
EGBY             W14EGB
EIRP             W14EIR
EIRT             W14EIR
EIRV             W14EIR
EIRY             W14EIR
EPBP             W14EPB
ERBP             W14EBP
ESLV             W14ESL
ESLY             W14ESL
ESO              W14ESO
ESOP             W14ESO
ESOT             W14ESO
ESOV             W14ESO
ESOY             W14ESO
ESRV             W14ESR
ESRY             W14ESR
ETLP             W14ETL
ETLT             W14ETL
ETLV             W14ETL
ETLY             W14ETL
ETTP             W14ETT
ETTT             W14ETT
ETUP             W14EUI
ETUT             W14EUI
ETUV             W14EUI
ETUY             W14EUI
EUBP             W14EUB
EUBT             W14EUB
EUBV             W14EUB
EUBY             W14EUB
EWBP             W14EWB
FAS              W14FIS
FASP             W14FIS
FAST             W14FIS
FIS              W14FIS
FISP             W14FIS
FIST             W14FIS
FISV             W14FIS
FISY             W14FIS
GAR              W14GAR
GARP             W14GAR
GART             W14GAR
GARV             W14GAR
GARY             W14GAR
GBP              W14GBP
GCAP             GCA
GDV              DATAVT
GGS              W14GGS
GGSP             W14GGS
GGST             W14GGS
GGSV             W14GGS
GGSY             W14GGS
GGSZ             W14GGS
GG1CAT           VSAMDS
GLUP             W14GLU
GLUT             W14GLU
GLUV             W14GLU
GLUW             W14GLU
GLUY             W14GLU
GLUZ             W14GLU
GMNP             W14GMN
GMNT             W14GMN
GNR              W14GNR
GNRP             W14GNR
GNRT             W14GNR
GNRV             W14GNR
GNRY             W14GNR
GOCT             W14GOC
GPCP             W14GPC
GPCT             W14GPC
GPCV             W14GPC
GPCY             W14GPC
GPPP             W14GPP
GPPT             W14GPP
GPPV             W14GPP
GPPY             W14GPP
GPRP             W14GPR
GPRT             W14GPR
GPRV             W14GPR
GPRY             W14GPR
GPVP             W14GPV
GPVT             W14GPV
GPVV             W14GPV
GPVY             W14GPV
GRPP             W14GRP
GRPT             W14GRP
GRPV             W14GRP
GRPY             W14GRP
GTEV             W14GTE
GTEY             W14GTE
GTS              W14GTS
IMSVS            143030
IPO1             143030
MASTER           143030
MOAA             143030
MOAX             143030
MOA1             143030
MODEL            143030
MVSCNV           143020M205
MVSCONV          143020M205
PASSWORD         143030
SCHXOP           143040
SICT.ASDSPSS     9492DP
SICT.CENSPAC     7152DP
SICT.INFOCNTR    145012
SICT.INFOCTR     145012
SICT.UTPS        7160DP
SICT.VSPC        145012
SICT.VSPCSMF     145012
SICV             145012
SICXMT           145012
SICY             145012
SOP              143040
SOPP             143040
SOPT             143040
SOPV             143040
SOPXAC           143040
SOPXAR           143040    AL RICHARDS              COMPUTER OPS
SOPXAS           143040    ALICE SHULTZ             PROD     ORT
SOPXAW           143040    ANNA WYSZYNSKI           COMPUTER OPS
SOPXBB           143040    BRIDGETT BYRD            COMPUTER OPS
SOPXBD           143040
SOPXCJ           143040
SOPXCM           143040    CHYRLENE MARSHALL        COMPUTER OPS
SOPXDH           143040    DAVID HUTTON             COMPUTER OPS
SOPXED           143040
SOPXJB           143040    JIM BOYLE                PROD     ORT
SOPXJC           143040
SOPXJK           143040    JANICE KRUGER            COMPUTER OPS
SOPXJO           143040
SOPXJT           143040    JEFF TAYLOR              COMPUTER OPS
SOPXKR           143040    KATHY RICHARDS           COMPUTER OPS
SOPXLD           143040
SOPXLR           143040
SOPXMG           143040    MARTHA GENTRY
SOPXMH           143040    MIKE HAMBACH             PROD     ORT
SOPXQQ           143040
SOPXRA           143040    ROZ AIELLO               COMPUTER OPS
SOPXRW           143040
SOPXSB           143040    SUSAN BECKETT
SOPXSD           143040    SHARON DICKMAN           COMPUTER OPS
SOPXXX           143040
SOPY             143040
SSP              143030
SSP.ADR          143030
SSP.APL40        143030
SSP.AUXA02       143030
SSP.CAPTFO06     143030
SSP.CAPTFO07     143030
SSP.CAPTFO08     143030
SSP.CAPTFO09     143030
SSP.CAPTFO10     143030
SSP.CAPTFO11     143030
SSP.CAPTFO12     143030
SSP.CASORT61     143030
SSP.CASORT62     143030
SSP.CBT          143030
SSP.CICSTEST     143030
SSP.CICS15       143030
SSP.CICS15M      143030
SSP.COBOL23      143030
SSP.CODAP        143030
SSP.CPUA         143030
SSP.CPUB         143030
SSP.DBD          143030
SSP.DBZAP        143030
SSP.DDE          143030
SSP.DMS          143030
SSP.DMS205       143030
SSP.DPS23        143030
SSP.DPS24        143030
SSP.DSPRT        143030
SSP.DSPRT10      143030
SSP.DUMDUM       143030
SSP.DUMMY        143030
SSP.EASYT082     143030
SSP.GDV          143030
SSP.IMS20        143030
SSP.IMS20B       143030
SSP.INFOCNTR     143030
SSP.IPO38H       143030
SSP.IRAC10       143030
SSP.ISP110       143030
SSP.IVP          143030
SSP.IVPLIB       143030
SSP.JOBLIB       143030
SSP.JSC40        143030
SSP.JSI          143030
SSP.KEYM26       143030
SSP.KEYM30       143030
SSP.LIB22        143030
SSP.LINKLIB      143030
SSP.LISTPTS      143030
SSP.LOADLIB2     143030
SSP.LOADLIB3     143030
SSP.MDASD22      143030
SSP.MDASD50      143030
SSP.MOA          143030
SSP.MVSCNV       143030
SSP.MVSSYS       143030
SSP.MVS38H       143030
SSP.NCCF         143030
SSP.NCCF20       143030
SSP.NCP21        143030
SSP.NETMN20      143030
SSP.NETMON       143030
SSP.NGA10        143030
SSP.NPDA10       143030
SSP.OMC212       143030
SSP.OMC250       143030
SSP.OMNICM21     143030
SSP.OMON510      143030
SSP.OMON515      143030
SSP.OMS11        143030
SSP.ONLMASTR     143030
SSP.OPS          143030
SSP.OSPOOL       143030
SSP.PLI40        143030
SSP.PME          143030
SSP.PMEIND       143030
SSP.PME30        143030
SSP.PNB          143030
SSP.PROB         143030
SSP.PROCLIBX     143030
SSP.PTS          143030
SSP.RPG10        143030
SSP.SAR          143030
SSP.SAR20        143030
SSP.SAS796       143030
SSP.SCH61        143030
SSP.SCH61X       143030
SSP.SCRIPT       143030
SSP.SMFMDL       143030
SSP.SMU14        143030
SSP.SOPT         143030
SSP.SOURCE       143030
SSP.SPSS         143030
SSP.STAR210      143030
SSP.SYS          143030
SSP.TEST         143030
SSP.TESTLOAD     143030
SSP.TLMSII       143030
SSP.TLMSXX       143030
SSP.TLMS41       143030
SSP.TSO          143030
SSP.TSP45        143030
SSP.TSS          143030
SSP.TSS30        143030
SSP.UCC2         143030
SSP.UCC2441      143030
SSP.UMAXV22A     143030
SSP.US           143030
SSP.USX          143030
SSP.VSPC21Z      143030
SSP.VSPC211      143030
SSP.VS1          143030
SSP.VTAMOBJ      143030
SSPP             143030
SSPT             143030
SSPV             143030
SSPXDD           143030    DEAN DAVIS
SSPXDM           143030    DALE MILLER
SSPXHH           143030    HORACE HEFFNER
SSPXJO           143030    JOYCE ORMISTON
SSPXKR           143030    RON KOLL
SSPXKS           143030    KEITH STOUT
SSPXRK           143030    RON KOHL
SSPY             143030
SSXV             143030
SYSAUTH          143030
SYSCAT           143030
SYSCTLG          143030
SYS1             143030
SYS3             143030
SYS4             143030
TAR              W14TAR
TARP             W14TAR
TART             W14TAR
TARV             W14TAR
TARY             W14TAR
TEMPDS           143040
UCAT             VSAMDS
UCC2             143030
USER             VSAMDS
USERCAT          VSAMDS
VPECTRLT         W14GPR
VPEDBT           W14GPR
VPPCTRLT         W14GPR
VPPDBT           W14GPR
VSAMDSET         VSAMDS
Z9999992         VSAMDS
Z9999994         VSAMDS
Z9999996         VSAMDS
