//SSPXKR1  JOB (143030,SCIC,TN,SYSTEMS),KOHL,CLASS=T,MSGCLASS=X,
//     NOTIFY=SSPXKR
//STEP10  EXEC LDCMDCL,LM=SSP326
//SYSIN  DD DSN=SSP.MOA.SRCLIB(SSP326),DISP=SHR
//COB.SYSLIB  DD
//            DD
//            DD
//            DD DSN=SSP.MOA.SRCLIB,DISP=SHR
