029000
029100 01  DATA-SPACE-RECORD.
029200
029300     02  DA-KEY.
029400         03  DS-ID           PIC XX.
029500         03  DS-VOL          PIC X(6).
029600         03  DS-TYPE         PIC X.
029700         03  DS-CYL          PIC 9999 COMP.
029800         03  DS-TRK          PIC 9999 COMP.
029900         03  DS-DSPC-CNT     PIC 9999 COMP.
030000         03  DS-EXT-CNT      PIC 9999 COMP.
030100         03  FILLER          PIC X(35).
030200     02  DS-DATASETS         PIC 9(5) COMP-3.
030300     02  DS-DATASPACES       PIC 9(5) COMP-3.
030400     02  DS-RCOV-IND         PIC X.
030500     02  DS-CAT-VOL          PIC X(6).
030600     02  DS-DEVICE           PIC X(4).
030700     02  DS-TRKS-CYL         PIC 999 COMP-3.
030800     02  DS-CLASS            PIC 9.
030900     02  DS-DS-THIS-EXT      PIC 9(5) COMP-3.
031000     02  DS-EXTENT.
031100         03  DS-TOT-TRKS     PIC 9(5) COMP-3.
031200         03  DS-USD-TRKS     PIC 9(5) COMP-3.
031300         03  DS-BEG-CYL      PIC 9999 COMP.
031400         03  DS-BEG-TRK      PIC 9999 COMP.
031500         03  DS-SPACE-MAP.
031600             04  DS-SPACE-MAP-SEG PIC X(34)  OCCURS 16 TIMES
031700                                        INDEXED BY XSSM.
031800
