//SSP507   JOB (143030,SMVS,TN,SYSTEMS),
//            DEAN.DAVIS,
//            NOTIFY=SSPXDD,
//            CLASS=A,
//            MSGCLASS=X
//STEP01   EXEC SSPCOB,MOD=SSP507
//LKED.SYSIN DD *
 IDENTIFY SSP507('DSM MASTER FILE LIST UTILITY')
 NAME SSP507(R)
