//SSP511   JOB (143030,SMVS,TN,SYSTEMS),
//            DEAN.DAVIS,
//            NOTIFY=SSPXDD,
//            CLASS=T,
//            MSGCLASS=X
//STEP01   EXEC SSPCOB,MOD=SSP511,
//            SLIB='SSP.DMS.SRCLIB'
