011000 01  DSM-RECORD.
011100     05  DSM-KEY                 PIC X(44).
011110     05  DSM-CREATE-DATE.
011111         07  DSM-CREATE-DATE-MM  PIC 9(2).
011112         07  DSM-CREATE-DATE-DD  PIC 9(2).
011113         07  DSM-CREATE-DATE-YY  PIC 9(2).
011120     05  DSM-CHG-DATE.
011121         07  DSM-CHG-DATE-MM     PIC 9(2).
011122         07  DSM-CHG-DATE-DD     PIC 9(2).
011123         07  DSM-CHG-DATE-YY     PIC 9(2).
011130     05  DSM-STRUCTURE           PIC X(4).
011140     05  DSM-SIZE                PIC 9(5).
011150     05  DSM-GROWTH              PIC 9(3).
011160     05  DSM-GDG                 PIC 9(2).
011170     05  DSM-DEV-TYPE            PIC X(4).
011180     05  DSM-VOLSER              PIC X(6).
011190     05  DSM-RETAIN-DATE.
011191         07  DSM-RETAIN-DATE-MM  PIC 9(2).
011192         07  DSM-RETAIN-DATE-DD  PIC 9(2).
011193         07  DSM-RETAIN-DATE-YY  PIC 9(2).
011194     05  DSM-RECFM               PIC X(3).
011195     05  DSM-LRECL               PIC 9(5).
011196     05  DSM-BLKSIZE             PIC 9(5).
011197     05  DSM-NUM-RECS            PIC 9(7).
011198     05  DSM-DESCR               PIC X(80).
011200     05  FILLER                  PIC X(114).
