//*  MEMBER=MTAMCL IN SYS1.PROCLIB
//RPG   EXEC  PGM=IESRPG,PARM='NODECK,LOAD,LIST,NOSEQN',REGION=128K,
//             TIME=15
//SYSPRINT DD  SYSOUT=A,DCB=(RECFM=FB,LRECL=121,BLKSIZE=1210)
//SYSPUNCH DD  DUMMY
//SYSUT1 DD DSN=&SYSUT1,UNIT=SYSDA,SPACE=(1700,(100,20))
//SYSUT2 DD DSN=&SYSUT2,UNIT=SYSDA,SPACE=(1700,(100,20))
//SYSUT3 DD DSN=&SYSUT3,UNIT=SYSDA,SPACE=(1700,(100,20))
//SYSGO DD DSN=&LOADSET1,DISP=(NEW,PASS,DELETE),UNIT=SYSDA,
//             SPACE=(80,(200,50,))
//ASS      EXEC  PGM=IEUASM,PARM='LOAD,NODECK',REGION=128K
//SYSLIB DD    DSN=SYS1.MACLIB,DISP=SHR
//SYSPRINT DD SYSOUT=A,DCB=(RECFM=FB,LRECL=121,BLKSIZE=1210)
//SYSUT1 DD DSN=&SYSUT1,UNIT=SYSDA,SPACE=(1700,(200,20))
//SYSUT2 DD DSN=&SYSUT2,UNIT=SYSDA,SPACE=(1700,(200,20))
//SYSUT3 DD DSN=&SYSUT3,UNIT=SYSDA,SPACE=(1700,(200,20))
//SYSPUNCH DD  DUMMY
//SYSGO DD DSN=&LOADSET2,DISP=(NEW,PASS,DELETE),UNIT=SYSDA,
//             SPACE=(80,(200,50,))
//LKED   EXEC  PGM=IEWL,PARM=(XREF,LIST,),REGION=192K,
//             COND=((8,LT,RPG),(4,LT,ASS))
//SYSPRINT DD SYSOUT=A
//SYSLIB DD    DSN=SYS1.LINKLIB,DISP=SHR
//SYSUT1 DD    DSN=&SYSUT1,UNIT=SYSDA,SPACE=(1024,(50,20))
//SYSLIN DD    DSN=*.RPG.SYSGO,DISP=(OLD,DELETE,DELETE)
//       DD    DSN=*.ASS.SYSGO,DISP=(OLD,DELETE,DELETE)
//       DD    DDNAME=SYSIN
//SYSLMOD DD   DSN=BIBL,DISP=(,PASS),UNIT=SYSDA,SPACE=(TRK,(2,2,2))
