         MACRO
&LABEL   BMCLAM
.*             COPYRIGHT GMD-I6 1970,1973
.*                                                         11MAR70-PAHL
.*  LOAD REGISTER &SYSLIST(&K-1) WITH &SYSLIST(&K)         12JUN72-PAHL
.*
.*  &SYSLIST(&K-1) : ABS.EXPR<16   REGISTER TO BE LOADED
.*  &SYSLIST(&K)   : RX-ADDR×(REG)×<RX-ADDR>   ADDR/VALUE TO BE LOADED
.*                   INTO REGISTER &SYSLIST(&K-1)
.*
         LCLA  &K
         LCLC  &C1,&C2
         AIF   ('&LABEL' EQ '').LOOP
&LABEL   DC    0H'0'
.LOOP    AIF   (&K GE N'&SYSLIST).MEND
&K       SETA  &K+2
         AIF   ('&SYSLIST(&K)' EQ '').LOOP
         AIF   ('&SYSLIST(&K)'(1,1) EQ '(').LR
         AIF   ('&SYSLIST(&K)'(1,1) EQ '<').L
.*  &SYSLIST(&K) = RX-ADDR
         AIF   ('&SYSLIST(&K)' EQ '0').LA0
         LA    &SYSLIST(&K-1),&SYSLIST(&K)
         AGO   .LOOP
.LA0     SR    &SYSLIST(&K-1),&SYSLIST(&K-1)
         AGO   .LOOP
.*  &SYSLIST(&K) = (REG)
.LR      AIF   ('&SYSLIST(&K,1)' EQ '&SYSLIST(&K-1,1)').LOOP
         LR    &SYSLIST(&K-1),&SYSLIST(&K,1)
         AGO   .LOOP
.*  &SYSLIST(&K) = <RX-ADDR>
.L       AIF   (K'&SYSLIST(&K) GT 10).LTWO
&C1      SETC  '&SYSLIST(&K)'(2,K'&SYSLIST(&K)-2)
&C2      SETC  ''
         AGO   .LOAD
.LTWO    ANOP
&C1      SETC  '&SYSLIST(&K)'(2,8)
&C2      SETC  '&SYSLIST(&K)'(10,K'&SYSLIST(&K)-10)
.LOAD    ANOP
         L     &SYSLIST(&K-1),&C1&C2
         AGO   .LOOP
.MEND    MEND
