//T87080F JOB 87080F,GRZ.FCBLIST,CLASS=B,PRTY=13,MSGCLASS=0,
//  NOTIFY=T87080
//*      GENOSSENSCHAFTS-RECHENZENTRALE NORDDEUTSCHLAND GMBH.
//*      SANDKRUGERSTRASSE
//*      2900 OLDENBURG
//*      TEL. 0441/400200(W.SCHWARZ)
//* MIT DIESER PROZEDUR WIRD EIN FCB, WIE ES SICH AUF DER
//* SYS1.IMAGELIB BEFINDET, ANGELISTET.
//* ANGABE DES IMAGES UNTER PARM=.... (MAX. 4 STELLEN - OHNE FCB2..)
//FCBLIST  EXEC PGM=FCB2LIST,PARM=NORM <=== FCB-IMAGE FCB2NORM
//STEPLIB  DD DSN=GRZ1.LOADLIB,DISP=SHR
//IMAGELIB DD DSN=SYS1.IMAGELIB,DISP=SHR
//FCBOUT   DD SYSOUT=P,DCB=BLKSIZE=16200,HOLD=YES
//SYSUDUMP DD SYSOUT=P
//SNAP     DD SYSOUT=Z
