//LSPOOL  PROC
//LOAD    EXEC PGM=LSPOOL
//SYSUDUMP  DD SYSOUT=0
//OUT       DD DSN=SYS2.LSPOOL.CTL,DISP=MOD
//CTL       DD DSN=SYS2.DSPOOL.CTL,DISP=OLD
