./ ADD NAME=UMGG02BJ,LIST=ALL,LEVEL=00,SOURCE=0
//JOBNAME   JOB 66661083,TCT-ANA,CLASS=H,MSGCLASS=X,NOTIFY=USER-ID
/*JOBPARM LINES=100,ROOM=RAUM
//* REFER  USER-ID.A.CNTL(ANATCT)
//*
//* COBOL-PROGRAMM MIT INTERNEM SORT
//*
//STEP0   EXEC PGM=IEWL,PARM=('LET,XREF,LIST,MAP')
//SYSPRINT  DD SYSOUT=*
//SYSUT1    DD UNIT=SYSDA,DISP=NEW,SPACE=(CYL,(2,2))
//OBJECT    DD DSN=USER-ID.A.OBJ,DISP=SHR
//SYSLIB    DD DSN=USER-ID.A.LOAD,DISP=SHR
//          DD DSN=SYS1.ANSSUB,DISP=SHR  COBOL-LIBRARY
//SYSLMOD   DD DSN=&TEMP,UNIT=SYSDA,DISP=(NEW,PASS,DELETE),
//             SPACE=(TRK,(10,10,1))
//SYSLIN    DD *
 INCLUDE OBJECT(ANATCT)
 INCLUDE SYSLIB(ILBOPRM)    FUER PARMVERARBEITUNG
 NAME ANATCT(R)
//STEP1   EXEC PGM=ANATCT
//STEPLIB   DD DSN=&TEMP,DISP=(OLD,PASS,DELETE)
//SORTLIB   DD DSN=SM01.SORTLIB,DISP=SHR
//SYSPRINT  DD SYSOUT=*
//SYSOUT    DD SYSOUT=*
//SYSABEND  DD SYSOUT=*
//SYSUDUMP  DD SYSOUT=*
//TCTIN     DD DSN=CICSXXX.TABELLEN(IRCTCTTL),DISP=SHR,
// DCB=(RECFM=FB,LRECL=80,BLKSIZE=3120)
//          DD DSN=CICSXXX.TABELLEN(IRCTCTTS),DISP=SHR,
// DCB=(RECFM=FB,LRECL=80,BLKSIZE=3120)
//          DD DSN=CICSXXX.TABELLEN(IRCTCTLO),DISP=SHR,
// DCB=(RECFM=FB,LRECL=80,BLKSIZE=3120)
//          DD DSN=CICSXXX.TABELLEN(IRCTCTK0),DISP=SHR,
// DCB=(RECFM=FB,LRECL=80,BLKSIZE=3120)
//          DD DSN=CICSXXX.TABELLEN(IRCTCTCD),DISP=SHR,
// DCB=(RECFM=FB,LRECL=80,BLKSIZE=3120)
//SORTWK01  DD UNIT=SYSDA,SPACE=(TRK,(200),,CONTIG)
//PRINTER   DD SYSOUT=*
