//S1  EXEC  PGM=UNEC01
//SYSSPIE   DD  SYSOUT=A
//SYSUDUMP  DD  SYSOUT=A
//SYSLIST  DD  SYSOUT=A
//SYSIN     DD  *
      ( P A R A M E T E R K A R T E N )
//SMFEIN5   DD                          EINGABE
//SMFAUS5   DD                          AUSGABE
