MEMBER NAME  VTOCFORM
//VTOCFORM PROC PLATTE=SYSRES
//VTOC   EXEC  PGM=SYS10,PARM='ISA(4K),R'
//STEPLIB  DD  DSN=RZSYS10,
//             UNIT=DISK,VOL=SER=SYSRES,DISP=SHR
//DDVOL    DD  UNIT=DISK,DISP=SHR,VOL=SER=&PLATTE
//SYSPRINT DD  SYSOUT=A
//PLIDUMP  DD  SYSOUT=D
//PRINT    DD  SYSOUT=A,DCB=(RECFM=VBA,LRECL=137,BLKSIZE=141)
//OUT      DD  SYSOUT=A,DCB=(RECFM=FA,BLKSIZE=133)
//SOUT     DD  DSN=&&VTOC,
//             UNIT=WORK,DISP=(,PASS),
//             SPACE=(3128,(400,400),RLSE),
//             DCB=(RECFM=FB,BLKSIZE=3128,LRECL=68)
//SORT   EXEC  PGM=SORT
//STEPLIB  DD  DSN=SM01.LINKLIB,
//             UNIT=DISK,VOL=SER=SYSRES,DISP=SHR
//SORTLIB  DD  DSN=SYS1.SORTLIB,DISP=SHR
//SYSOUT   DD  SYSOUT=D
//SORTWK01 DD  UNIT=WORK,SPACE=(TRK,(80),,CONTIG)
//SORTWK02 DD  UNIT=WORK,SPACE=(TRK,(80),,CONTIG)
//SORTWK03 DD  UNIT=WORK,SPACE=(TRK,(80),,CONTIG)
//SORTWK04 DD  UNIT=WORK,SPACE=(TRK,(80),,CONTIG)
//SORTIN   DD  DSN=&&VTOC,DISP=(OLD,DELETE)
//SORTOUT  DD  SYSOUT=A,DCB=(RECFM=F,BLKSIZE=68,LRECL=68)
//SYSIN  DD  *
  SORT  FIELDS=(1,44,CH,A,50,6,CH,A)
/*
