//*
//*      THIS IS JCL TO CREATE THE SPECIAL SEQUENTIAL RANDOMIZER
//*
//*      INPUT IS A SORTED SET OF ACTUAL AND SORTED KEYS FOR THE
//*      ANALYZER AND TABLE-CREATER UVWW03AS
//*
//*      BEFORE USING THIS PROCEDURE VERIFY,THAT YOU CAN USE THIS
//*      SPECIAL RANDOMIZER FOR YOUR SPECIAL KEYS
//*
//*      MAKE CHANGES TO THE SOURCE CODE IF NECESSARY
//*
//*      MAKE CHANGES TO THIS PROCEDURE FOR YOUR SOURCE AND LOADLIB,
//*
//*      IF ALL OK , YOU MUST COPY SEQRANDM INTO IMSVS.RESLIB OR
//*      CONCATENATED LIBRARY
//*
//ANAL   PROC KEYS=K
//ANL    EXEC PGM=UVWW03AS
//STEPLIB   DD  DSN=LOADLIB,DISP=SHR
//TABLE     DD  DSN=TABS.ASM,DISP=(,CATLG),UNIT=SYSDA,
//  DCB=(RECFM=FB,LRECL=80,BLKSIZE=3120),SPACE=(CYL,(1,1))
//INFILE    DD  DSN=&KEYS,DISP=SHR
//OUTFILE   DD  SYSOUT=*
//       PEND
//ASM    PROC  M=TEMP,L='NCAL,RENT'
//ASM    EXEC  PGM=IEV90,PARM='NODECK,LOAD',REGION=256K
//SYSLIB DD    DSNAME=SYS1.MACLIB,DISP=SHR
//SYSUT1 DD    UNIT=SYSDA,SPACE=(CYL,(1,1)),DSN=&SYSUT1
//SYSPRINT  DD SYSOUT=*
//SYSIN  DD    DSN=SOURCE(&M),DISP=SHR
//SYSLIN DD    DSNAME=&LOADSET,UNIT=SYSDA,SPACE=(3120,(25,10)),
//             DISP=(MOD,PASS),DCB=(BLKSIZE=3120,LRECL=80,RECFM=FBS)
//LKED   EXEC  PGM=IEWL,PARM=(XREF,LIST,&L),REGION=256K,
//             COND=(5,LT,ASM)
//SYSLIN DD    DSNAME=&LOADSET,DISP=(OLD,DELETE)
//       DD    DDNAME=SYSIN
//SYSLMOD DD   DSNAME=LOADLIB(&M),DISP=SHR
//SYSUT1 DD    DSNAME=&SYSUT1,UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSPRINT DD  SYSOUT=*
//SYSIN  DD  DUMMY
//    PEND
//**
//**
//**********************************************************
//**   COMPILE AND LINK ANALYSER AND TABLE CREATER
//ANA    EXEC ASM,M=UVWW03AS,L='NCAL'
//**
//**********************************************************
//**   COMPILE AND LINK AS REENTRANT HDAMSEQ
//SEQ   EXEC ASM,M=UVWW02AS
//**********************************************************
//**** ANALYSE KEYS ON INFILE,  PRODUCE TABLE. *************
//**** GET JUMP STATISTICS*************
//GO    EXEC ANAL,KEYS='SORTED.KEYS'
//**********************************************************
//*** COMPILE TABLE AND LINK AS REENTRANT TO UVWW02AS ******
//EX2   EXEC  ASM
//ASM.SYSIN   DD  DSN=TABS.ASM,DISP=(OLD,DELETE)
//LKED.SYSLMOD DD DSN=LOADLIB,DISP=SHR
//LKED.SYSIN  DD  *
  INCLUDE SYSLMOD(UVWW02AS)
  ENTRY HDAMSEQ
  NAME  SEQRANDM(R)         *** SEQUENTIAL RAND NAME
/*
