QUEUE    CSECT
         RETTE (10,11)
* ANZEIGEN DER LAUFENDEN PARTITION UND DER INPUT-OUTPUT QUEUE
* FUER CICS-, VSPC- UND RTAM-ANWENDERIN VS1
* IN CICS MUSS EIN CICS-STEUERPR. DIESES PROGRAMM ALS UNTERPROGRAMM
* AUFRUFEN. EIN PL1-STEUERPR. LIEGT BEI.
* FUER VSPC WIRD DIESES PROGRAMM ALS BATCH-JOB AUSGEFUERT UND MIT
* DEM LOAD-OUTPUT-BEFEHL DIE AUSGABE AM BILDSCHIRM ANGEZEIGT
* RTAM-ANWENDER MUESSEN DIE AUSGABE DEM TERMINAL ENTSPRECHEND
* MODIFIZIEREN
* DIE ANZUZEIGENDE PARTITION MUSS EBENFALLS MODIFIZIERT WERDEN
*
         L     2,16   CVT
         L     1,0(2)  CVTP  TCB
         L     1,4(1)  CURRENT TCB
         IC    0,=X'01'
         SVC   243   KEY=0
         CLM   15,1,=X'10'   WAS JOB  AUTHORIZED
         BE    WTO
         CLM   15,1,=X'00'
         BNE   WAITEXB
WTO      EQU   *
         MODESET KEY=ZERO
         OPEN  (LISTE,(OUTPUT))
         MVI   QUELIST,X'40'
         MVC   QUELIST+1(L'QUELIST-1),QUELIST
         MVI   VS,X'0B'
ANF1     EQU   *
         L     R0,0
         L     R5,16(R0)     ADR CVT
         LA    R5,244(R5)         POINTER TCB P0
         L     R6,0(R5)
         L     R5,0(R6)      TCB  PARTITION P0
TCB      EQU   *
         LA    R6,40(R6)   TCB PARTITION P10
         L     R5,0(R6)      TCB P5 LADEN
         L     R8,164(R5)    ADR TCBTCT
         L     R7,124(R5)
         MVC   M3+14(8),64(R7)
         CLC   64(6,R7),INIT
         BNE   P0
         LA    R2,3
         LA    R4,M
         B     P2
P0       EQU   *
         C      R8,=F'0'
         BE    P1
         L     R9,28(R8)     ADR JMR
         L     R2,32(R9)
         C     R2,=F'0'
         BE    *+14
         MVC   WK1,32(R9)
         B     *+10
         MVC   WK1,56(R8)
         L     R3,WK1        JOB INITATION-ZEIT
         BAL   R4,TIMECNVR
         LA    R2,TAB
P3       CLC   0(3,R2),20(R9)
         BNE   *+14
         MVC   M8+14(17),3(R2)
         B     P4
         LA    R2,20(R2)
         CLC   0(3,R2),=C'XXX'
         BNE   P3
         MVC   M8+14(17),=C'                '
         MVC   M8+14(3),20(R9)
P4       EQU   *
         MVC   OUTINIT1,OUTINIT
         MVC   WK1,8(R9)
         L     R3,WK1
         BAL   R4,TIMECNVR
         ZAP   WK1,=PL1'0'
         MVC   MONTAB,=PL2'31,28,31,30,31,30,31,31,30,31,30,31'
         ZAP   MONFLD,=PL1'1'
         MVO   WK1,12(2,R9)
         UNPK  YEAR,WK1+2(2)
         DP    WK1,=PL1'4'
         CP    WK1+3(1),=PL1'0'
         BNZ   NOLAP
         ZAP   MONTAB+2(2),=PL2'29'
NOLAP    ZAP   WK1,14(2,R9)
         LA    R4,MONTAB
DATLOOP  SP    WK1,0(2,4)
         BNH   HIT
         AP    MONFLD,=PL1'1'
         LA    4,2(4)
         B     DATLOOP
HIT      AP    WK1,0(2,4)
         UNPK  MON,MONFLD
         UNPK  DAY,WK1+2(2)
         XC    DATUM,=X'0030910030910030'
P1       EQU   *
         L     R7,12(R5)     ADR TIOT IM TCB
         MVC   M3+37(8),8(R7)
         MVC   M4+14(8),OUTINIT1
         MVC   M4+37(8),OUTINIT
         MVC   M5+14(8),DATUM
         ZAP   WK1,=PL1'0'
         MVO   WK1,44(1,R9)
         OI    WK1+3,X'0F'
         UNPK  M5+37(2),WK1+3(1)
         LA    R4,M1
         LA    R2,7
P2       EQU   *
UEB      EQU   *
         MVC   QUELIST+1(47),0(R4)
         BAL   R3,PRINT
         LA    R4,47(R4)
         BCT   R2,UEB
         MVI   TCB+3,X'24'
         MVC   M0+23(2),=C'9 '
         MVC   M2+29(2),=C'9 '
         MVC   INIT,=C'INIT9 '
END3     NOP   END2
         OI    END3+1,X'F0'
         B     ANF1
TIMECNVR EQU   *
         SR    R2,R2
         AH    R3,=H'50'
         D     R2,=F'100'
         SR       R2,R2               GET HOURS
         D     R2,=F'3600'
         CVD   R3,PAKT
         UNPK  HOUR,PAKT
         LR    R3,R2         GET MINUTES
         SR    R2,R2
         D     2,=F'60'
         CVD   R3,PAKT
         UNPK     MINUTE,PAKT
         CVD   R2,PAKT
         UNPK  SECOND,PAKT
         OC    TIME(8),=8X'F0'
         MVC   OUTINIT(2),HOUR
         MVI   OUTINIT+2,C'.'
         MVC   OUTINIT+3(2),MINUTE
         MVI      OUTINIT+5,C'.'
         MVC   OUTINIT+6(2),SECOND
         BR    R4
INIT     DC    C'INIT10'
WK1      DS    F
WK2      DS    F
PAKT     DS    D
TIME     DS    0CL6
HOUR     DS    CL2
MINUTE   DS    CL2
SECOND   DS    CL2
OUTINIT  DS    CL8
OUTINIT1 DS    CL8
BUFFER   DS    0D
LENGTH   DC    H'51'
         DC    X'8000'
TEXT     DC    CL47' '
MBUF     DS    0D
         DC    H'20'
         DC    X'9000'
         DC    C'D N=B,USER=TR   '
M        DC    C'***********************************************'
M0       DC    C'*********** PARTITION P10 IST FREI ************'
M1       DC    C'***********************************************'
M2       DC    C'*---------------- PARTITION P10 --------------*'
M3       DC    C'*  JOBNAME             *  STEPNAME            *'
M4       DC    C'*  START-ZEIT          *  EINGELESEN          *'
M5       DC    C'*  DATUM               *  PRTY                *'
M8       DC    C'*  NAME                                       *'
M6       DC    C'***********************************************'
WORKAREA DS    45F
MONTAB   EQU   WORKAREA+00,24
MONFLD   EQU   WORKAREA+24,2
DATUM    EQU   WORKAREA+27,8
DAY      EQU   WORKAREA+26,3
MON      EQU   WORKAREA+29,3
YEAR     EQU   WORKAREA+32,3
TAB      DC    CL20'AUGXXXXXXXX'
         DC    CL20'HZ XXXXXX'
         DC    CL20'HG XXXXXX'
         DC    CL20'HW XXXX'
         DC    CL20'KA XXXXXXX'
         DC    CL20'XXX'
END2     EQU   *
         LA    R9,QUELIST+1
         USING QUE,R9
         USING JLE,R7
         MVI   QUEU,X'8B'
         MVC   QUELIST(L'QUEU),QUEU
         BAL   R3,PRINT
         MVI   VS,X'0B'
         L     R0,0
         L     R5,16(R0)  ADR  CVT
         LA    R5,X'128'(R5)
         L     R6,0(R5)      ADR JESCT
         LA    R6,X'F0'(R6)
         L     R5,0(R6)  ADR JLIH
         L     R6,4(R5) JLIE
A0       L     R7,8(R6) JLE
         B     A00
SNAP     EQU   *
         L     R7,0(R7)
A00      EQU   *
         STH   R7,HW
         CLC   HW,=X'0000'
         BE    A1
         CLI   JLEFLAG,X'80'
         BNE   SNAP
         CLC   JLEFLAG+1(3),=CL3'0'
         BE    SNAP
         MVC   FELD,0(R7)
         CLI   JLECL,C'Z'
         BE    SNAP
*          SNAP DCB=SNAPDCB,STORAGE=(FELD,FEND)
X00      EQU   *
         TM    JLETYPE,X'10'
         BO    A04
A01      NOP   A02
         CLI   QUELIST+1,X'40'
         BE    *+8
         BAL   R3,PRINT
         MVI   XMODE,X'01'
         LA    R9,QUELIST+1
         MVI   VS,X'13'
         OI    A01+1,X'F0'
A02      EQU   *
         CLI   XMODE,X'00'
         BE    *+10
         MVC   QUEN(5),=C'SOUTQ'
         B     A03
A04      EQU   *
         CLI   XMODE,X'00'
         BE    *+10
         MVC   QUEN(4),=C'JOBQ'
A03      EQU   *
         CLI   QUELIST+1,X'40'
         BNE   A05
         MVC   QUEN(17),=C'INPUT QUEUE EMPTY'
         BAL   R3,PRINT
         XI    XMODE,X'01'
         B     A02
A05      EQU   *
         MVC   QCLASS,JLECL
         TM    JLESTAT,X'80'
         BZ    *+14
         MVC   QSTAT(4),=C'HOLD'
         B     *+10
         MVC   QSTAT(5),=CL5' '
         MVC   QJOBN(8),JLENAM
         LA    R8,15
         MVN   WORT+3(1),JLETYPE
         S     R8,WORT
         CVD   R8,DWORT
         MVC   QPRTY,=X'40202020'
         ED    QPRTY,DWORT+6
         CLC   JLEQID,=H'0'
         BNE   *+14
         MVC   QUSER(7),=C'CENTRAL'
         B     *+10
         MVC   QUSER,=C'TR      '
         XI    XMODE,X'01'
         CLI   XMODE,X'01'
         BE    P00
         LA    R9,34(R9)
         B     SNAP
P00      EQU   *
         LA    R9,QUELIST+1
P01      EQU   *
         BAL   R3,PRINT
         B     SNAP
A1       EQU   *
P02      EQU   *
         L     R6,0(R6)
         STH   R6,HW
         CLC   HW,=X'0000'
         BNE   A0
         BAL   R3,PRINT
         CLOSE (LISTE)
         MODESET KEY=NZERO
         IC    0,=X'02'
         SVC   243
         B     END
WAITEXB  ST    15,ERROR
         ABEND 10,DUMP
PRINT    EQU   *
         MVI   QUELIST,C' '
         PUT   LISTE,QUELIST
         MVI   QUELIST,X'40'
         MVC   QUELIST+1(L'QUELIST-1),QUELIST
         MVI   VS,X'0B'
         BR    R3
               LTORG
LISTE    DCB   DDNAME=LISTQ,MACRF=PM,DSORG=PS,LRECL=80,BLKSIZE=80,     *
               RECFM=FBM
SNAPDCB DCB DSORG=PS,RECFM=VBA,MACRF=(W),BLKSIZE=882,LRECL=125,        *
               DDNAME=SNAP
ERROR    DS    F
FELD     DS    CL112
FEND     DS    CL1
QUEU     DC    C' QUEUE    PRTY JOBNAME  USER    STAT        PRTY JOBNA*
               ME  USER    STAT            '
BLANK    DS    CL10
QUELIST  DS    0CL90
VS       DS    CL1
         DS    CL89
XMODE    DC    X'01'
JLET     DS    CL1
WORT     DC    F'0'
DWORT    DS    D
HW       DS    H
QUE      DSECT
QUEN     DS    CL6
QCLASS   DS    CL1
         DS    CL1
QPRTY    DS    CL4
         DS    CL2
QJOBN    DS    CL9
QUSER    DS    CL8
QSTAT    DS    CL5
         DS    CL3
         DS    CL37
         CNOP  0,4
JLE      DSECT
JLEFLAG  DS    CL1
         DS    CL3
JLENAM   DS    CL8
JOBNUM   DS    CL4
JLEQID   DS    CL2
JLECL    DS    CL1
JLETYPE  DS    CL1
         DS    CL4
JLEB     DS    CL1
JLESTAT  DS    CL1
         END
****************************************
**  UNTERPROGRAMM FUER CICS *******
***********************************
AKTIV  START
         BC    R15,12(R15)
         DC    AL1(7)
         DC   CL7'AKTIV'
         RETTE (11)
         LTR   R1,R1
         BZ    END
         L     R15,0(R1)
         L     R1,4(R1)
         ST    R1,RETTE
         L     R10,0(R1)    INHALT TAB-ZAEHLER
         MVI   QUELIST,C' '
         MVC   QUELIST+1(L'QUELIST-1),QUELIST
         MVI   XMODE,X'01'
         NI    A01+1,X'0F'
ANF1     EQU   *
         L     R0,0
         L     R5,16(R0)     ADR CVT
         LA    R5,244(R5)         POINTER TCB P0
         L     R6,0(R5)
         L     R5,0(R6)      TCB  PARTITION P0
TCB      EQU   *
         LA    R6,40(R6)   TCB PARTITION P10
         L     R5,0(R6)      TCB P5 LADEN
         L     R8,164(R5)    ADR TCBTCT
         L     R7,124(R5)
         MVC   M3+14(8),64(R7)
         CLC   64(6,R7),INIT
         BNE   P0
         LA    R2,3
         LA    R4,M
         B     P2
P0       EQU   *
         L     R9,28(R8)     ADR JMR
         L     R2,32(R9)
         C     R2,=F'8640000'
         BH    *+22
         C     R2,=F'0'
         BE    *+14
         MVC   WK1,32(R9)
         B     *+10
         MVC   WK1,56(R8)
         L     R3,WK1        JOB INITATION-ZEIT
         BAL   R4,TIMECNVR
         LA    R2,TAB
P3       CLC   0(3,R2),20(R9)
         BNE   *+14
         MVC   M8+14(17),3(R2)
         B     P4
         LA    R2,20(R2)
         CLC   0(3,R2),=C'XXX'
         BNE   P3
         MVC   M8+14(17),=C'                 '
         MVC   M8+14(3),20(R9)
P4       EQU   *
         MVC   OUTINIT1,OUTINIT
         MVC   WK1,8(R9)
         L     R3,WK1
         BAL   R4,TIMECNVR
         ZAP   WK1,=PL1'0'
         MVC   MONTAB,=PL2'31,28,31,30,31,30,31,31,30,31,30,31'
         ZAP   MONFLD,=PL1'1'
         MVO   WK1,12(2,R9)
         UNPK  YEAR,WK1+2(2)
         DP    WK1,=PL1'4'
         CP    WK1+3(1),=PL1'0'
         BNZ   NOLAP
         ZAP   MONTAB+2(2),=PL2'29'
NOLAP    ZAP   WK1,14(2,R9)
         LA    R4,MONTAB
DATLOOP  SP    WK1,0(2,4)
         BNH   HIT
         AP    MONFLD,=PL1'1'
         LA    4,2(4)
         B     DATLOOP
HIT      AP    WK1,0(2,4)
         UNPK  MON,MONFLD
         UNPK  DAY,WK1+2(2)
         XC    DATUM,=X'0030910030910030'
P1       EQU   *
         L     R7,12(R5)     ADR TIOT IM TCB
         MVC   M3+37(8),8(R7)
         MVC   M4+14(8),OUTINIT1
         MVC   M4+37(8),OUTINIT
         MVC   M5+14(8),DATUM
         ZAP   WK1,=PL1'0'
         MVO   WK1,44(1,R9)
         OI    WK1+3,X'0F'
         UNPK  M5+37(2),WK1+3(1)
         LA    R4,M1
         LA    R2,7
P2       EQU   *
UEB      EQU   *
         MVC   QUELIST+1(47),0(R4)
         BAL   R3,PRINT
         LA    R4,47(R4)
         BCT   R2,UEB
         CLI   TCB+3,X'2C'
         BE    END2
         CLI   TCB+3,X'24'
         BE    END4
         MVI   TCB+3,X'24'
         MVC   M0+23(2),=C'9 '
         MVC   M2+29(2),=C'9 '
         MVC   INIT,=C'INIT9 '
         B     ANF1
END4     EQU   *
         MVI   TCB+3,X'2C'
         MVC   M0+23(2),=C'11'
         MVC   M2+29(2),=C'11'
         MVC   INIT,=C'INIT11'
         B     ANF1
TIMECNVR EQU   *
         SR    R2,R2
         AH    R3,=H'50'
         D     R2,=F'100'
         SR    R2,R2               GET HOURS
         D     R2,=F'3600'
         CVD   R3,PAKT
         UNPK  HOUR,PAKT
         LR    R3,R2         GET MINUTES
         SR    R2,R2
         D     2,=F'60'
         CVD   R3,PAKT
         UNPK     MINUTE,PAKT
         CVD   R2,PAKT
         UNPK  SECOND,PAKT
         OC    TIME(8),=8X'F0'
         MVC   OUTINIT(2),HOUR
         MVI   OUTINIT+2,C'.'
         MVC   OUTINIT+3(2),MINUTE
         MVI      OUTINIT+5,C'.'
         MVC   OUTINIT+6(2),SECOND
         BR    R4
INIT     DC    C'INIT10'
WK1      DS    F
WK2      DS    F
PAKT     DS    D
TIME     DS    0CL6
HOUR     DS    CL2
MINUTE   DS    CL2
SECOND   DS    CL2
OUTINIT  DS    CL8
OUTINIT1 DS    CL8
BUFFER   DS    0D
LENGTH   DC    H'51'
         DC    X'8000'
TEXT     DC    CL47' '
MBUF     DS    0D
         DC    H'20'
         DC    X'9000'
         DC    C'D N=B,USER=TR   '
M        DC    C'***********************************************'
M0       DC    C'*********** PARTITION P10 IST FREI ************'
M1       DC    C'***********************************************'
M2       DC    C'*---------------- PARTITION P10 --------------*'
M3       DC    C'*  JOBNAME             *  STEPNAME            *'
M4       DC    C'*  START-ZEIT          *  EINGELESEN          *'
M5       DC    C'*  DATUM               *  PRTY                *'
M8       DC    C'*  NAME                                       *'
M6       DC    C'***********************************************'
WORKAREA DS    45F
MONTAB   EQU   WORKAREA+00,24
MONFLD   EQU   WORKAREA+24,2
DATUM    EQU   WORKAREA+27,8
DAY      EQU   WORKAREA+26,3
MON      EQU   WORKAREA+29,3
YEAR     EQU   WORKAREA+32,3
TAB      DC    CL20'AUG********'
         DC    CL20'HZ ******'
         DC    CL20'HG ******'
         DC    CL20'HW ****'
         DC    CL20'XXX'
END2     EQU   *
         LA    R9,QUELIST+1
         USING QUE,R9
         USING JLE,R7
         MVI   QUEU,X'8B'
         MVC   QUELIST(L'QUEU),QUEU
         BAL   R3,PRINT
         MVI   VS,X'0B'
         L     R0,0
         L     R5,16(R0)  ADR  CVT
         LA    R5,X'128'(R5)
         L     R6,0(R5)      ADR JESCT
         LA    R6,X'F0'(R6)
         L     R5,0(R6)  ADR JLIH
         L     R6,4(R5) JLIE
A0       L     R7,8(R6) JLE
         B     A00
SNAP     EQU   *
         L     R7,0(R7)
A00      EQU   *
         STH   R7,HW
         CLC   HW,=X'0000'
         BE    A1
         CLI   JLEFLAG,X'80'
         BNE   SNAP
         CLC   JLEFLAG+1(3),=CL3'0'
         BE    SNAP
         MVC   FELD,0(R7)
         CLI JLECL,C'Z'
         BE SNAP
*          SNAP DCB=SNAPDCB,STORAGE=(FELD,FEND)
X00      EQU   *
         TM    JLETYPE,X'10'
         BO    A04
A01      NOP   A02
         CLI   QUELIST+1,X'40'
         BE    *+8
         BAL   R3,PRINT
         MVI   XMODE,X'01'
         LA    R9,QUELIST+1
         MVI   VS,X'13'
         OI    A01+1,X'F0'
A02      EQU   *
         CLI   XMODE,X'00'
         BE    *+10
         MVC   QUEN(5),=C'SOUTQ'
         B     A03
A04      EQU   *
         CLI   XMODE,X'00'
         BE    *+10
         MVC   QUEN(4),=C'JOBQ'
A03      EQU   *
         CLI   QUELIST+1,X'40'
         BNE   A05
         MVC   QUEN(17),=C'INPUT QUEUE EMPTY'
         BAL   R3,PRINT
         XI    XMODE,X'01'
         B     A02
A05      EQU   *
         MVC   QCLASS,JLECL
         TM    JLESTAT,X'80'
         BZ    *+14
         MVC   QSTAT(4),=C'HOLD'
         B     *+10
         MVC   QSTAT(5),=CL5' '
         MVC   QJOBN(8),JLENAM
         LA    R8,15
         MVN   WORT+3(1),JLETYPE
         S     R8,WORT
         CVD   R8,DWORT
         MVC   QPRTY,=X'40202020'
         ED    QPRTY,DWORT+6
         CLC   JLEQID,=H'0'
         BNE   *+14
         MVC   QUSER(7),=C'CENTRAL'
         B     *+10
         MVC   QUSER,=C'TR      '
         XI    XMODE,X'01'
         CLI   XMODE,X'01'
         BE    P00
         LA    R9,34(R9)
         B     SNAP
P00      EQU   *
         LA    R9,QUELIST+1
P01      EQU   *
         BAL   R3,PRINT
         B     SNAP
A1       EQU   *
P02      EQU   *
         L     R6,0(R6)
         STH   R6,HW
         CLC   HW,=X'0000'
         BNE   A0
         BAL   R3,PRINT
         L     R1,RETTE
         ST    R10,0(R1)
         MVI   TCB+3,X'28'
         MVC   M0+23(2),=C'10'
         MVC   M2+29(2),=C'10'
         MVC   INIT,=C'INIT10'
         B     END
PRINT    EQU   *
         MVI QUELIST,C' '
         MVI   QUELIST,X'40'
         MVC   0(80,R15),QUELIST
         LA    R15,80(R15)
         BCTR  R10,0
         MVC   QUELIST+1(L'QUELIST-1),QUELIST
         BR    R3
         LTORG
FELD     DS    CL112
FEND     DS    CL1
QUEU     DC    C' QUEUE    PRTY JOBNAME  USER    STAT        PRTY JOBNA*
               ME  USER    STAT            '
RETTE    DS    F
QUELIST  DS    0CL90
VS       DS    CL1
         DS    CL89
XMODE    DC    X'01'
JLET     DS    CL1
WORT     DC    F'0'
DWORT    DS    D
HW       DS    H
QUE      DSECT
QUEN     DS    CL6
QCLASS   DS    CL1
         DS    CL1
QPRTY    DS    CL4
         DS    CL2
QJOBN    DS    CL9
QUSER    DS    CL8
QSTAT    DS    CL5
         DS    CL3
         DS    CL37
         CNOP  0,4
JLE      DSECT
JLEFLAG  DS    CL1
         DS    CL3
JLENAM   DS    CL8
JOBNUM   DS    CL4
JLEQID   DS    CL2
JLECL    DS    CL1
JLETYPE  DS    CL1
         DS   CL4
JLEB     DS    CL1
JLESTAT  DS    CL1
         END
***************************************
***   PL1 STEUERPROGRAMM  *************
***************************************
°   HACICSA:PROC OPTIONS (MAIN);
°        DCL AKTIV ENTRY ((300)CHAR(80),BIN FIXED(31))
°               OPTIONS (ASM INTER),
°               TAB(300) CHAR(80),
°               TAB80 CHAR(80),
°               NTAB BIN FIXED(31);
°        EXEC CICS HANDLE AID ENTER (EKEY) ANYKEY (ENDE);
°        TAB = ' ';
           L=80;
°           NTAB = 300;
°        CALL AKTIV (TAB,NTAB);
°        K = (299-NTAB)/23;
°           IF K*23 < 299-NTAB
°              THEN K = K + 1;
°           DO I = 1 TO K;
°              DO J = (I-1)*23+1 TO I*23;
°      EXEC CICS SEND TEXT FROM (TAB(J))  ACCUM LENGTH (L);
°              END;
°              EXEC CICS SEND  PAGE;
°              EXEC CICS RECEIVE;
°   EKEY:
°           END;
°   ENDE:
°           TAB80 = 'BITTE LOESCHTASTE DRUECKEN';
°           EXEC CICS SEND TEXT FROM (TAB80) ERASE LENGTH (L);
°           EXEC CICS RETURN;
°   END;
