         TITLE ' IEADQIQE:  PROC  OPTIONS(REENTRANT NOSAVEAREA NOAUTO'
IEADQIQE CSECT ,                                                01.0001
@PROLOG  STM   @14,@12,12(@13)                                  01.0001
         BALR  @10,0                                            01.0001
@PSTART  DS    0H                                               01.0001
         USING @PSTART,@10                                      01.0001
*R15 = R13 ;                            /* SAVE REGISTER             */
         LR    R15,R13                                          03.0023
*GEN CODE  ;                                                    03.0024
         SETLOCK  OBTAIN,TYPE=LOCAL,MODE=UNCOND,                       *
               RELATED=('RESOURCE=IQE QUEUE, RELEASED IN THIS MODULE')
* R13 = R15 ;                           /* RESTORE REGISTER          */
         LR    R13,R15                                          03.0025
*RESPECIFY  (R11,R14,R15)  UNRSTD;      /* FREE REGISTERS            */
*/********************************************************************/
*/* END OF LOCK-                                                     */
*/*      OUTPUT-                                                     */
*/*        R11,R14,R15 = VOLATILE                                    */
*/********************************************************************/
*                                                               02.0027
*IQEPTR  = ASXBFIQE;                    /*POINT TO FIRST IQE         */
         L     @11,ASCBPTR                                      02.0027
         L     @11,ASXBPTR(,@11)                                02.0027
         L     IQEPTR,ASXBFIQE(,@11)                            02.0027
*PREVIQE = 0 ;                          /*  INIT POINTER TO PREVIOUS */
         SR    PREVIQE,PREVIQE                                  02.0028
*/*  SCAN THE QUEUE,DEQUEUEING IQES FOR THE TASK                     */
*DO WHILE (IQEPTR ^= 0) ;               /* SEARCH WHILE THERE ARE
*                                          UNSEARCHED IQES           */
         B     @DE00029                                         02.0029
@DL00029 DS    0H                                               02.0030
*     IF IQETCBA = RMPLTCBA             /* IF IQE IS FOR      TASK   */
*          THEN                                                 02.0030
*                                                               02.0030
         L     @11,RMPLPTR(,PARMREG)                            02.0030
         SR    @00,@00                                          02.0030
         ICM   @00,7,IQETCBA(IQEPTR)                            02.0030
         C     @00,RMPLTCBA(,@11)                               02.0030
         BNE   @RF00030                                         02.0030
*/********************************************************************/
*/*   DEQUEUE THE IQE FROM THE QUEUE.                                */
*/********************************************************************/
*          DO;                                                  02.0031
*/*********************************************************************
*/*   DQIQE -                                                         *
*/*      THIS SEGMENT DEQUEUES THE IQE FROM THE ASYNCHRONOUS EXIT  Q. *
*/*      INPUT:                                                       *
*/*        IQEPTR  (R2) - POINTS TO THE IQE TO BE DEQUEUED            *
*/*        PREVIQE (R3) - CONTAINS ADDR OF THE IQE  PRECEDING THE ONE *
*/*                TO BE DEQUEUED.  IF THERE IS NO PREVIOUS , THEN IT *
*/*                CONTAINS ZEROES.                                   *
*/*********************************************************************
*IF PREVIQE = 0                         /* IF THIS IS THE TOP IQE     *
*     THEN                                                      03.0032
         LTR   PREVIQE,PREVIQE                                  03.0032
         BNZ   @RF00032                                         03.0032
*     ASXBFIQE = IQEPTR-> IQELNKA;      /* UPDATE PTR TO FIRST        *
         L     @11,ASCBPTR                                      03.0033
         L     @11,ASXBPTR(,@11)                                03.0033
         SR    @00,@00                                          03.0033
         ICM   @00,7,IQELNKA(IQEPTR)                            03.0033
         ST    @00,ASXBFIQE(,@11)                               03.0033
*     ELSE                                                      03.0034
*     PREVIQE-> IQELNKA = IQEPTR-> IQELNKA; /* UPDATE CHAIN IN PREVIOUS
*                                          IQE                        *
         B     @RC00032                                         03.0034
@RF00032 MVC   IQELNKA(3,PREVIQE),IQELNKA(IQEPTR)               03.0034
*IF ASXBLIQE = IQEPTR                   /* IF THIS WAS LAST IQE       *
*     THEN                                                      03.0035
@RC00032 L     @11,ASCBPTR                                      03.0035
         L     @11,ASXBPTR(,@11)                                03.0035
         C     IQEPTR,ASXBLIQE(,@11)                            03.0035
         BNE   @RF00035                                         03.0035
*     ASXBLIQE = PREVIQE;               /* UPDATE PTR TO LAST IQE     *
         ST    PREVIQE,ASXBLIQE(,@11)                           03.0036
*/********************************************************************/
*/*  END OF DQIQE -                                                   *
*/********************************************************************/
*                                                               02.0037
*          END;                                                 02.0037
*                                                               02.0037
*          ELSE                                                 02.0038
*          PREVIQE = IQEPTR;            /* UPDATE PTR TO PREVIOUS    */
*                                                               02.0038
         B     @RC00030                                         02.0038
@RF00030 LR    PREVIQE,IQEPTR                                   02.0038
*     IQEPTR = IQELNKA;                 /* GET NEXT IQE              */
@RC00030 SR    @11,@11                                          02.0039
         ICM   @11,7,IQELNKA(IQEPTR)                            02.0039
         LR    IQEPTR,@11                                       02.0039
*END;                                                           02.0040
*                                                               02.0040
@DE00029 LTR   IQEPTR,IQEPTR                                    02.0040
         BNZ   @DL00029                                         02.0040
*/********************************************************************/
*/* DELETE THE FRR FROM STACK AND RELEASE THE LOCAL LOCK.            */
*/********************************************************************/
*/********************************************************************/
*/* UNLOCK -                                                         */
*/* THIS SEGMENT RELEASE THE LOCAL LOCK AND DELETES THE              */
*/*      RECOVERY FOOTPRINT.                                         */
*/********************************************************************/
*RESPECIFY (R11,R14,R15) RSTD ;         /* RESTRICT REGISTERS        */
*R15 = R13 ;                            /* SAVE REGISTER             */
         LR    R15,R13                                          03.0042
*GEN CODE ;                                                     03.0043
         SETLOCK  RELEASE,TYPE=LOCAL,                                  *
               RELATED=('RESOURCE=IQE QUEUE, OBTAINED IN THIS MODULE')
*R13 = R15 ;                            /* RESTORE REGISTER          */
         LR    R13,R15                                          03.0044
*RESPECIFY (R11,R14,R15) UNRSTD ;       /* FREE THE REGISTERS        */
*/********************************************************************/
*/*  END OF UNLOCK                                                   */
*/*      OUTPUT:                                                     */
*/*        R11,R12,R14,R15 = VOLATILE                                */
*/********************************************************************/
*                                                               02.0046
*IEAVEER1:  ;                                                   01.0046
*END   IEADQIQE                                                 01.0047
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.      *
*/*%INCLUDE SYSUT5  (PROLOG  )                                        *
*/*%INCLUDE SYSUT5  (DECLARES)                                        *
*/*%INCLUDE SYSUT5  (MAPMACS )                                        *
*/*%INCLUDE SYSLIB  (IHAIQE  )                                        *
*/*%INCLUDE SYSLIB  (IHARMPL )                                        *
*/*%INCLUDE SYSLIB  (IHAASXB )                                        *
*/*%INCLUDE SYSLIB  (IHAASCB )                                        *
*/*%INCLUDE SYSLIB  (IHAPSA  )                                        *
*/*%INCLUDE SYSUT5  (REGS    )                                        *
*/*%INCLUDE SYSUT5  (IQEPURGE)                                        *
*/*%INCLUDE SYSUT5  (LOCK    )                                        *
*/*%INCLUDE SYSUT5  (DQIQE   )                                        *
*/*%INCLUDE SYSUT5  (UNLOCK  )                                        *
*;                                                              01.0047
@EL00001 DS    0H                                               01.0047
@EF00001 DS    0H                                               01.0047
@ER00001 LM    @14,@12,12(@13)                                  01.0047
         BR    @14                                              01.0047
@DATA    DS    0H
@DATD    DSECT
         DS    0F
IEADQIQE CSECT
         DS    0F
@DATD    DSECT
         DS    0D
@ENDDATD EQU   *
IEADQIQE CSECT
         NOPR  ((@ENDDATD-@DATD)*16)
         DS    0F
@SIZDATD DC    AL1(0)
         DC    AL3(@ENDDATD-@DATD)
         DS    0D
NULL     DC    X'00'
         DC    XL23'0'
@00      EQU   00                      EQUATES FOR REGISTERS 0-15
@01      EQU   01
@02      EQU   02
@03      EQU   03
@04      EQU   04
@05      EQU   05
@06      EQU   06
@07      EQU   07
@08      EQU   08
@09      EQU   09
@10      EQU   10
@11      EQU   11
@12      EQU   12
@13      EQU   13
@14      EQU   14
@15      EQU   15
IQEPTR   EQU   @02
PARMREG  EQU   @01
PREVIQE  EQU   @03
R11      EQU   @11
R12      EQU   @12
R13      EQU   @13
R14      EQU   @14
R15      EQU   @15
PSA      EQU   0
FLCRNPSW EQU   PSA
FLCROPSW EQU   PSA+8
FLCICCW2 EQU   PSA+16
PSAEEPSW EQU   PSA+132
PSAESPSW EQU   PSA+136
FLCSVILC EQU   PSAESPSW+1
PSAEPPSW EQU   PSA+140
FLCPIILC EQU   PSAEPPSW+1
FLCPICOD EQU   PSAEPPSW+2
PSAPICOD EQU   FLCPICOD+1
FLCTEA   EQU   PSAEPPSW+4
FLCPER   EQU   PSA+152
FLCMCLA  EQU   PSA+168
FLCIOEL  EQU   FLCMCLA+4
FLCIOA   EQU   FLCMCLA+16
FLCFSA   EQU   FLCMCLA+80
PSAAOLD  EQU   PSA+548
PSASUPER EQU   PSA+552
PSASUP1  EQU   PSASUPER
PSASUP2  EQU   PSASUPER+1
PSASUP3  EQU   PSASUPER+2
PSASUP4  EQU   PSASUPER+3
PSACLHT  EQU   PSA+640
PSALKSA  EQU   PSA+696
PSAHLHI  EQU   PSA+760
PSADSSFL EQU   PSA+836
PSADSSF1 EQU   PSADSSFL
PSADSSF3 EQU   PSADSSFL+2
PSADSSF4 EQU   PSADSSFL+3
PSARSVT  EQU   PSA+896
IQESECT  EQU   0
IQELNK   EQU   IQESECT
IQELNKA  EQU   IQELNK+1
IQEIRB   EQU   IQESECT+8
IQEFLAGS EQU   IQEIRB
IQETCB   EQU   IQESECT+12
IQETCBA  EQU   IQETCB+1
RMPL     EQU   0
RMPLFLG1 EQU   RMPL
RMPLTCBA EQU   RMPL+8
RMPLPTR  EQU   0
ASXB     EQU   0
ASXBAEQ  EQU   ASXB+168
ASXBFIQE EQU   ASXBAEQ
ASXBLIQE EQU   ASXBAEQ+4
ASCB     EQU   0
ASCBFW1  EQU   ASCB+100
ASCBRCTF EQU   ASCBFW1+2
ASCBFLG1 EQU   ASCBFW1+3
ASCBASXB EQU   ASCB+108
ASCBDSP1 EQU   ASCB+114
ASCBFLG2 EQU   ASCB+115
IQEEND   EQU   0
ASXBPTR  EQU   ASCBASXB
ASCBPTR  EQU   PSAAOLD
PSARSVTE EQU   PSARSVT
FLC      EQU   PSA
*                                      START UNREFERENCED COMPONENTS
PSARSAV  EQU   PSARSVTE+60
PSARSTK  EQU   PSARSVTE+56
PSAESAV3 EQU   PSARSVTE+52
PSAESTK3 EQU   PSARSVTE+48
PSAESAV2 EQU   PSARSVTE+44
PSAESTK2 EQU   PSARSVTE+40
PSAESAV1 EQU   PSARSVTE+36
PSAESTK1 EQU   PSARSVTE+32
PSAPSAV  EQU   PSARSVTE+28
PSAPSTK  EQU   PSARSVTE+24
PSAMSAV  EQU   PSARSVTE+20
PSAMSTK  EQU   PSARSVTE+16
PSASSAV  EQU   PSARSVTE+12
PSASSTK  EQU   PSARSVTE+8
PSANSTK  EQU   PSARSVTE+4
PSACSTK  EQU   PSARSVTE
ASCBEND  EQU   ASCB+208
ASCBSRBT EQU   ASCB+200
ASCBSWTL EQU   ASCB+196
ASCBRS14 EQU   ASCB+195
ASCBSMCT EQU   ASCB+194
ASCBRS12 EQU   ASCB+192
ASCBPCTT EQU   ASCB+188
ASCBVGTT EQU   ASCB+184
ASCBLGCB EQU   ASCB+180
ASCBJBNS EQU   ASCB+176
ASCBJBNI EQU   ASCB+172
ASCBMCC  EQU   ASCB+168
ASCBRTWA EQU   ASCB+164
ASCBIQEA EQU   ASCB+160
ASCBXMPQ EQU   ASCB+156
ASCBRS01 EQU   ASCB+154
ASCBFMCT EQU   ASCB+152
ASCBOUXB EQU   ASCB+148
ASCBOUCB EQU   ASCB+144
ASCBMECB EQU   ASCB+140
ASCBQECB EQU   ASCB+136
ASCBCMSB EQU   ASCB+132
ASCBCMSF EQU   ASCB+128
ASCBTCBS EQU   ASCB+124
ASCBNVSC EQU   ASCB+122
ASCBVSC  EQU   ASCB+120
ASCBSRBS EQU   ASCB+118
ASCBSSRB EQU   ASCB+116
ASCBRV06 EQU   ASCBFLG2
ASCBRV05 EQU   ASCBFLG2
ASCBRV04 EQU   ASCBFLG2
ASCBSNQS EQU   ASCBFLG2
ASCBS2S  EQU   ASCBFLG2
ASCBCEXT EQU   ASCBFLG2
ASCBPXMT EQU   ASCBFLG2
ASCBXMPT EQU   ASCBFLG2
ASCBRF07 EQU   ASCBDSP1
ASCBRF06 EQU   ASCBDSP1
ASCBRF05 EQU   ASCBDSP1
ASCBRF04 EQU   ASCBDSP1
ASCBRF03 EQU   ASCBDSP1
ASCBRF02 EQU   ASCBDSP1
ASCBFAIL EQU   ASCBDSP1
ASCBNOQ  EQU   ASCBDSP1
ASCBSWCT EQU   ASCB+112
ASCBTMCH EQU   ASCB+104
ASCBNSWP EQU   ASCBFLG1
ASCBTYP1 EQU   ASCBFLG1
ASCBSTND EQU   ASCBFLG1
ASCBABNT EQU   ASCBFLG1
ASCBTERM EQU   ASCBFLG1
ASCBS3S  EQU   ASCBFLG1
ASCBCMSH EQU   ASCBFLG1
ASCBTOFF EQU   ASCBFLG1
ASCBRF01 EQU   ASCBRCTF
ASCBTMLW EQU   ASCBRCTF
ASCBOUT  EQU   ASCBRCTF
ASCBWAIT EQU   ASCBRCTF
ASCBFND  EQU   ASCBRCTF
ASCBFQU  EQU   ASCBRCTF
ASCBFRS  EQU   ASCBRCTF
ASCBTMNO EQU   ASCBRCTF
ASCBAFFN EQU   ASCBFW1
ASCBDUMP EQU   ASCB+96
ASCBQSVC EQU   ASCB+92
ASCBUBET EQU   ASCB+88
ASCBECB  EQU   ASCB+84
ASCBJSTL EQU   ASCB+80
ASCBEWST EQU   ASCB+72
ASCBEJST EQU   ASCB+64
ASCBTSB  EQU   ASCB+60
ASCBCSCB EQU   ASCB+56
ASCBRSM  EQU   ASCB+52
ASCBLDA  EQU   ASCB+48
ASCBSTOR EQU   ASCB+44
ASCBDP   EQU   ASCB+43
ASCBRV07 EQU   ASCB+42
ASCBIOSM EQU   ASCB+40
ASCBSEQN EQU   ASCB+38
ASCBASID EQU   ASCB+36
ASCBCPUS EQU   ASCB+32
ASCBSPL  EQU   ASCB+28
ASCBLSLQ EQU   ASCB+24
ASCBFSLQ EQU   ASCB+20
ASCBIOSP EQU   ASCB+16
ASCBLOCK EQU   ASCB+12
ASCBBWDP EQU   ASCB+8
ASCBFWDP EQU   ASCB+4
ASCBASCB EQU   ASCB
ASCBEGIN EQU   ASCB
ASXBEND  EQU   ASXB+232
ASXBRV25 EQU   ASXB+228
ASXBRV24 EQU   ASXB+224
ASXBRV23 EQU   ASXB+220
ASXBRV22 EQU   ASXB+216
ASXBRV21 EQU   ASXB+212
ASXBRV20 EQU   ASXB+208
ASXBRV19 EQU   ASXB+204
ASXBRV18 EQU   ASXB+200
ASXBRV17 EQU   ASXB+196
ASXBRV16 EQU   ASXB+192
ASXBLSRB EQU   ASXBAEQ+20
ASXBFSRB EQU   ASXBAEQ+16
ASXBLRQE EQU   ASXBAEQ+12
ASXBFRQE EQU   ASXBAEQ+8
ASXBETSK EQU   ASXB+164
ASXBSIRB EQU   ASXB+160
ASXBPSWD EQU   ASXB+152
ASXBPRG  EQU   ASXB+136
ASXBTAXE EQU   ASXB+132
ASXBOUSB EQU   ASXB+128
ASXBDDR  EQU   ASXB+124
ASXBRCTD EQU   ASXB+120
ASXBRSMD EQU   ASXB+116
ASXBSPSA EQU   ASXB+112
ASXBFRWA EQU   ASXB+108
ASXBFLSA EQU   ASXB+36
ASXBIHSA EQU   ASXB+32
ASXBRV15 EQU   ASXB+28
ASXBRV14 EQU   ASXB+24
ASXBLWA  EQU   ASXB+20
ASXBMPST EQU   ASXB+16
ASXBRS00 EQU   ASXB+14
ASXBTCBS EQU   ASXB+12
ASXBLTCB EQU   ASXB+8
ASXBFTCB EQU   ASXB+4
ASXBASXB EQU   ASXB
ASXBEGIN EQU   ASXB
RMPLDCBL EQU   RMPL+20
RMPLRMWA EQU   RMPL+16
RMPLRBPA EQU   RMPL+12
RMPLASCB EQU   RMPL+4
RMPLASID EQU   RMPL+2
RMPLFLG2 EQU   RMPL+1
@NM00008 EQU   RMPLFLG1
RMPLWT1M EQU   RMPLFLG1
RMPLJST  EQU   RMPLFLG1
RMPLRCOV EQU   RMPLFLG1
RMPLIPUF EQU   RMPLFLG1
RMPLRBPP EQU   RMPLFLG1
RMPLTERM EQU   RMPLFLG1
RMPLTYPE EQU   RMPLFLG1
IQEOUTLM EQU   IQESECT+20
IQEDCB   EQU   IQESECT+16
IQESTAT2 EQU   IQETCB
IQEIRBA  EQU   IQEIRB+1
@NM00007 EQU   IQEFLAGS
@NM00006 EQU   IQEFLAGS
@NM00005 EQU   IQEFLAGS
@NM00004 EQU   IQEFLAGS
@NM00003 EQU   IQEFLAGS
@NM00002 EQU   IQEFLAGS
@NM00001 EQU   IQEFLAGS
IQEPURGE EQU   IQEFLAGS
IQEPARAM EQU   IQESECT+4
IQESTAT1 EQU   IQELNK
@NM00032 EQU   PSA+3412
PSASTAK  EQU   PSA+3072
@NM00031 EQU   PSA+1024
PSAUSEND EQU   PSA+1024
PSARV060 EQU   PSA+1020
PSARV059 EQU   PSA+1018
PSASVC13 EQU   PSA+1016
PSALSFCC EQU   PSA+1012
PSASFACC EQU   PSA+1008
PSASTOP  EQU   PSA+992
PSASTART EQU   PSA+976
PSARSPSW EQU   PSA+968
PSASRPSW EQU   PSA+960
PSARV045 EQU   PSA+892
PSARV044 EQU   PSA+888
PSARV043 EQU   PSA+884
PSARV042 EQU   PSA+880
PSARV041 EQU   PSA+876
PSARV040 EQU   PSA+872
PSARV025 EQU   PSA+868
PSADSSED EQU   PSA+868
PSADSSPR EQU   PSA+864
PSADSSFW EQU   PSA+860
PSADSS14 EQU   PSA+856
PSADSSPP EQU   PSA+848
PSADSSRP EQU   PSA+840
PSADSS05 EQU   PSADSSF4
PSADSS10 EQU   PSADSSF4
PSADSSVE EQU   PSADSSF4
PSADSSDE EQU   PSADSSF4
PSADSSC0 EQU   PSADSSF4
PSADSSIE EQU   PSADSSF4
PSADSS12 EQU   PSADSSF4
PSADSSRC EQU   PSADSSF4
PSARV057 EQU   PSADSSF3
PSARV056 EQU   PSADSSF3
PSARV055 EQU   PSADSSF3
PSARV054 EQU   PSADSSF3
PSADSSRW EQU   PSADSSF3
PSADSSNM EQU   PSADSSF3
PSADSSES EQU   PSADSSF3
PSADSSGP EQU   PSADSSF3
PSADSSF2 EQU   PSADSSFL+1
PSADSSPI EQU   PSADSSF1
PSADSSOI EQU   PSADSSF1
PSADSSSP EQU   PSADSSF1
PSADSSTP EQU   PSADSSF1
PSADSSDW EQU   PSADSSF1
PSADSSDD EQU   PSADSSF1
PSADSSDM EQU   PSADSSF1
PSADSSMV EQU   PSADSSF1
PSADSSTS EQU   PSA+816
PSADSSWK EQU   PSA+812
PSADSSR3 EQU   PSA+808
PSADSSR2 EQU   PSA+804
PSADSSRS EQU   PSA+800
PSASTOR  EQU   PSA+796
PSARV058 EQU   PSA+794
PSAVSTAP EQU   PSA+792
PSAWKVAP EQU   PSA+788
PSAWKRAP EQU   PSA+784
PSAMCHIC EQU   PSA+783
PSAMODE  EQU   PSA+782
PSASYMSK EQU   PSA+781
PSAMCHFL EQU   PSA+780
PSACR0   EQU   PSA+776
PSAPSWSV EQU   PSA+768
PSALITA  EQU   PSA+764
PSACLHS  EQU   PSAHLHI
PSALKR15 EQU   PSALKSA+60
PSALKR14 EQU   PSALKSA+56
PSALKR13 EQU   PSALKSA+52
PSALKR12 EQU   PSALKSA+48
PSALKR11 EQU   PSALKSA+44
PSALKR10 EQU   PSALKSA+40
PSALKR9  EQU   PSALKSA+36
PSALKR8  EQU   PSALKSA+32
PSALKR7  EQU   PSALKSA+28
PSALKR6  EQU   PSALKSA+24
PSALKR5  EQU   PSALKSA+20
PSALKR4  EQU   PSALKSA+16
PSALKR3  EQU   PSALKSA+12
PSALKR2  EQU   PSALKSA+8
PSALKR1  EQU   PSALKSA+4
PSALKR0  EQU   PSALKSA
PSARV023 EQU   PSACLHT+52
PSALOCAL EQU   PSACLHT+48
PSACMSL  EQU   PSACLHT+44
PSAOPTL  EQU   PSACLHT+40
PSATPACL EQU   PSACLHT+36
PSATPDNL EQU   PSACLHT+32
PSATPNCL EQU   PSACLHT+28
PSAIOSLL EQU   PSACLHT+24
PSAIOSUL EQU   PSACLHT+20
PSAIOSCL EQU   PSACLHT+16
PSAIOSSL EQU   PSACLHT+12
PSASALCL EQU   PSACLHT+8
PSAASML  EQU   PSACLHT+4
PSADISPL EQU   PSACLHT
PSASRSA  EQU   PSA+636
PSARV050 EQU   PSA+634
PSADSSGO EQU   PSA+633
PSARECUR EQU   PSA+632
PSAHLHIS EQU   PSA+628
PSAIPCSA EQU   PSA+624
@NM00030 EQU   PSA+621
PSAIPCDM EQU   PSA+620
PSAIPCD  EQU   PSA+616
@NM00029 EQU   PSA+613
PSAIPCRM EQU   PSA+612
PSAIPCR  EQU   PSA+608
PSAMCHEX EQU   PSA+600
PSAMPSW  EQU   PSA+592
PSAEXPS2 EQU   PSA+584
PSAEXPS1 EQU   PSA+576
PSAPIREG EQU   PSA+572
PSARSREG EQU   PSA+568
PSAGPREG EQU   PSA+556
PSARV022 EQU   PSASUP4
PSARV021 EQU   PSASUP4
PSARV020 EQU   PSASUP4
PSARV019 EQU   PSASUP4
PSARV018 EQU   PSASUP4
PSARV017 EQU   PSASUP4
PSARV016 EQU   PSASUP4
PSARV015 EQU   PSASUP4
PSARV014 EQU   PSASUP3
PSARV013 EQU   PSASUP3
PSARV012 EQU   PSASUP3
PSARV011 EQU   PSASUP3
PSARV010 EQU   PSASUP3
PSARV009 EQU   PSASUP3
PSARV008 EQU   PSASUP3
PSARV007 EQU   PSASUP3
PSALCR   EQU   PSASUP2
PSARTM   EQU   PSASUP2
PSAACR   EQU   PSASUP2
PSAIPCE2 EQU   PSASUP2
PSAIPCES EQU   PSASUP2
PSAIPCEC EQU   PSASUP2
PSAGTF   EQU   PSASUP2
PSAIPCRI EQU   PSASUP2
PSAIPCRP EQU   PSASUP1
PSAIPCDR EQU   PSASUP1
PSADISP  EQU   PSASUP1
PSALOCK  EQU   PSASUP1
PSAPI    EQU   PSASUP1
PSAEXT   EQU   PSASUP1
PSASVC   EQU   PSASUP1
PSAIO    EQU   PSASUP1
PSAANEW  EQU   PSA+544
PSATOLD  EQU   PSA+540
PSATNEW  EQU   PSA+536
PSALCCAR EQU   PSA+532
PSALCCAV EQU   PSA+528
PSAPCCAR EQU   PSA+524
PSAPCCAV EQU   PSA+520
PSACPULA EQU   PSA+518
PSACPUPA EQU   PSA+516
PSAPSA   EQU   PSA+512
FLCHDEND EQU   PSA+512
FLCCRSAV EQU   FLCMCLA+280
FLCGRSAV EQU   FLCMCLA+216
FLCFPSAV EQU   FLCMCLA+184
FLCFLA   EQU   FLCMCLA+88
FLCRGNCD EQU   FLCMCLA+84
FLCFSAA  EQU   FLCFSA+1
@NM00028 EQU   FLCFSA
@NM00027 EQU   FLCMCLA+72
FLCMCIC  EQU   FLCMCLA+64
@NM00026 EQU   FLCMCLA+20
FLCIOAA  EQU   FLCIOA+1
@NM00025 EQU   FLCIOA
@NM00024 EQU   FLCMCLA+15
@NM00023 EQU   FLCMCLA+14
@NM00022 EQU   FLCMCLA+12
FLCLCL   EQU   FLCMCLA+8
FLCIOELA EQU   FLCIOEL+1
@NM00021 EQU   FLCIOEL
FLCCHNID EQU   FLCMCLA
@NM00020 EQU   PSA+160
FLCMTRCD EQU   PSA+157
@NM00019 EQU   PSA+156
FLCPERA  EQU   FLCPER+1
@NM00018 EQU   FLCPER
@NM00017 EQU   PSA+151
FLCPERCD EQU   PSA+150
FLCMCNUM EQU   PSA+149
@NM00016 EQU   PSA+148
FLCTEAA  EQU   FLCTEA+1
@NM00015 EQU   FLCTEA
PSAPIPC  EQU   PSAPICOD
PSAPIMC  EQU   PSAPICOD
PSAPIPER EQU   PSAPICOD
PSARV049 EQU   FLCPICOD
FLCPILCB EQU   FLCPIILC
@NM00014 EQU   FLCPIILC
@NM00013 EQU   PSAEPPSW
FLCSVCN  EQU   PSAESPSW+2
FLCSILCB EQU   FLCSVILC
@NM00012 EQU   FLCSVILC
@NM00011 EQU   PSAESPSW
FLCEICOD EQU   PSAEEPSW+2
PSASPAD  EQU   PSAEEPSW
@NM00010 EQU   PSA+128
FLCINPSW EQU   PSA+120
FLCMNPSW EQU   PSA+112
FLCPNPSW EQU   PSA+104
FLCSNPSW EQU   PSA+96
FLCENPSW EQU   PSA+88
FLCTRACE EQU   PSA+84
FLCTIMER EQU   PSA+80
FLCCVT2  EQU   PSA+76
FLCCAW   EQU   PSA+72
FLCCSW   EQU   PSA+64
FLCIOPSW EQU   PSA+56
FLCMOPSW EQU   PSA+48
FLCPOPSW EQU   PSA+40
FLCSOPSW EQU   PSA+32
FLCEOPSW EQU   PSA+24
@NM00009 EQU   FLCICCW2+4
FLCCVT   EQU   FLCICCW2
FLCICCW1 EQU   FLCROPSW
FLCIPPSW EQU   FLCRNPSW
*                                      END UNREFERENCED COMPONENTS
@RF00035 EQU   @RC00030
IEAVEER1 EQU   @EL00001
@ENDDATA EQU   *
         END   IEADQIQE
