//FORT   EXEC  PGM=IEKAA00,REGION=228K
//SYSPRINT DD  SYSOUT=A
//SYSPUNCH DD  SYSOUT=B
//SYSLIN   DD  DSNAME=&LOADSET,UNIT=SYSSQ,DISP=(MOD,PASS),             *
//             SPACE=(400,(200,50),RLSE)
