//IEFPROC EXEC PGM=IEFVRRC,                 RESTART READER PROGRAM     *
//             REGION=50K,                  RESTART READER REGION      *
//             PARM=RESTART
//IEFRDER DD DUMMY
//IEFPDSI DD DSNAME=SYS1.PROCLIB,DISP=SHR   PROCEDURE LIBRARY      I272
//IEFDATA DD DUMMY
