//TSTRACE PROC TRREGN=20K,         DEFAULTS:REGION SIZE=20K
//             TRPARM=100,                   ENTRY RATE=100 ENTRIES/SEC
//             VOLCNT=20,                    VOLUME COUNT=20
//             BLKSIZE=2048                  BUFFER SIZE=2048
//*
//* DESCRIPTION OF SYMBOLIC PARAMETERS ---
//*  TRREGN - TRACE WRITER REGION SIZE
//*  TRPARM  - AN ESTIMATE OF THE RATE AT WHICH ENTRIES WILL BE MADE
//*            INTO TRACE BUFFERS IN NUMBER OF ENTRIES PER SECONDS
//*  VOLCNT  - MAXIMUM NO. OF VOLUMES AVAILABLE FOR TRACE DATA SET
//*            PER RUN. MAXIMUM VALUE ALLOWED IS 255.
//*  BLKSIZE - SIZE OF TRACE BUFFERS. MINIMUM SIZE ALLOWED BY TRACE
//*            WRITER IS 128; MAXIMUM ALLOWED BY SYSTEM IS 32,760
//*
//IEFPROC EXEC PGM=IKJFATRC,       INVOKES INITIALIZATION MODULE
//             DPRTY=14,           PRIORITY SHOULD AT LEAST BE HIGHER
//             REGION=&TRREGN,     THAN CPU-BOUND JOBS IN THE SYSTEM
//             PARM=&TRPARM
//*
//IEFRDER DD   DSNAME=TSTRACE,     NAME OF TRACE DATA SET
//             UNIT=2400,          DATA SET CREATED ON 9-TRK TAPE(S)
//             DISP=(NEW,KEEP),
//             DCB=(BLKSIZE=&BLKSIZE),
//             VOLUME=(,,,&VOLCNT)
