         MACRO
&LABEL   DSECTS
         GBLB  &EXC,&TST
         SPACE 3
         DAD
         SPACE 3
         NODAD
         SPACE 3
         VOLD
         SPACE 3
         DSD
         SPACE 3
         QMIN
         SPACE 3
         QMAJ
         SPACE 3
         TADSECT
         SPACE 3
         DBLTBLD
         SPACE 3
.*
         MEND
