         TITLE 'ALLOCATE OPTION ROUTINE                                *
                        '
IKJEFD36 CSECT ,                                                   0001
@MAINENT DS    0H                                                  0001
         USING *,@15                                               0001
         B     @PROLOG                                             0001
         DC    AL1(16)                                             0001
         DC    C'IKJEFD36  74.204'                                 0001
         DROP  @15
@PROLOG  STM   @14,@12,12(@13)                                     0001
         BALR  @12,0                                               0001
@PSTART  DS    0H                                                  0001
         USING @PSTART,@12                                         0001
         L     @00,@SIZDATD                                        0001
         GETMAIN  R,LV=(0)
         LR    @11,@01                                             0001
         USING @DATD,@11                                           0001
         ST    @13,@SA00001+4                                      0001
         LM    @00,@01,20(@13)                                     0001
         ST    @11,8(,@13)                                         0001
         LR    @13,@11                                             0001
         XC    @ZTEMPS(@ZLEN),@ZTEMPS
         MVC   @PC00001(4),0(@01)                                  0001
*                                                                  0068
* /*                   END OF CVT MACRO                              */
*                                                                  0069
*/********************************************************************/
*/*                                                                  */
*/* SEGMENT NAME -                                                   */
*/*      PRMPTFLE                                                    */
*/*                                                                  */
*/* FUNCTION -                                                       */
*/*      THIS ROUTINE NOTIFIES THE USER THAT THE REQUESTED FILENAME  */
*/*      IS IN USE, AND PROMPTS THE USER TO ENTER EITHER FREE OR     */
*/*      CARRIAGE RETURN. IF FREE IS ENTERED, THE FILE IS FREED AND  */
*/*      RE-ALLOCATED. ELSE, ALLOCATE TERMINATES.                    */
*/*                                                                  */
*/* OPERATION -                                                      */
*/*      DAIRFAIL IS INVOKED TO ISSUE THE FILE IN USE MESSAGE. THE   */
*/*      PROMPT MESSAGE IS SET UP AND ROUTINE PRMOPT IS INVOKED TO   */
*/*      ISSUE THE PUTGET AND ANALYZE THE RESPONSE.                  */
*/*                                                                  */
*/* INPUT -                                                          */
*/*      DDNAME PDE                                                  */
*/*                                                                  */
*/* OUTPUT -                                                         */
*/*      FILE FREED AND RE-ALLOCATED, OR                             */
*/*      ALLOCATE TERMINATION INDICATED                              */
*/*                                                                  */
*/* NOTE:  THIS ROUTINE REPRESENTS A DIRECT LINE FUNCTION AND CAN    */
*/*        BE INCORPORATED AS AN INCLUDED CODE SEGMENT WHEN THE      */
*/*        INCLUDE FUNCTION HAS RECEIVED A STANDARD DEFINITION.      */
*/********************************************************************/
*    PRMPTFLE:                                                     0069
*        AWAPTR = R1;                  /* PTR TO WORKAREA            */
PRMPTFLE LR    AWAPTR,R1                                           0069
*        MSGTABLE = MSGTABLE && MSGTABLE;                          0070
         L     @10,MSGPTR(,AWAPTR)                                 0070
         XC    MSGTABLE(64,@10),MSGTABLE(@10)                      0070
*        ENTRYCD = 1;                  /* SET ENTRY CODE             */
         MVC   ENTRYCD(2,AWAPTR),@CH00033                          0071
*        R1 = AWAPTR;                  /* WORKAREA PTR IN REG 1      */
         LR    R1,AWAPTR                                           0072
*        CALL IKJEFD35;                /* ISSUE FILE IN USE MSG      */
*                                                                  0073
         L     @15,@CV00329                                        0073
         BALR  @14,@15                                             0073
*        IF RBCODE12 = '0'B THEN       /* IF NO ERROR,               */
         TM    RBCODE12(AWAPTR),B'10000000'                        0074
         BNZ   @RF00074                                            0074
*          DO;                         /* THEN                       */
*            MSGID = '113A';           /* SET MESSAGE ID             */
         L     @10,MSGPTR(,AWAPTR)                                 0076
         MVC   MSGID(4,@10),@CC01352                               0076
*            MTPUTLSW = '0'B;          /* INDICATE PUTGET            */
         NI    MTPUTLSW(@10),B'10111111'                           0077
*            VAR1 = DDNPTR;            /* PTR TO DDNAME VARIABLE     */
         L     @02,PTRPDL(,AWAPTR)                                 0078
         MVC   VAR1(3,@10),DDNPTR+1(@02)                           0078
*            L1 = DDNLEN;              /* DDNAME VARIABLE LENGTH     */
         MVC   L1(1,@10),DDNLEN+1(@02)                             0079
*            CALL PRMOPT;              /* ISSUE MSG AND PROCESS    0080
*                                         RESPONSE                   */
         BAL   @14,PRMOPT                                          0080
*          END;                                                    0081
*        IF RBCODE12 = '1'B THEN                                   0082
@RF00074 TM    RBCODE12(AWAPTR),B'10000000'                        0082
         BNO   @RF00082                                            0082
*          RETCODE = 12;                                           0083
         L     @10,REGSAVE(,R13)                                   0083
         MVC   RETCODE(4,@10),@CF01355                             0083
*        ELSE                                                      0084
*          RETCODE = 0;                                            0084
*                                                                  0084
         B     @RC00082                                            0084
@RF00082 L     @10,REGSAVE(,R13)                                   0084
         SLR   @15,@15                                             0084
         ST    @15,RETCODE(,@10)                                   0084
*        RETURN;                       /* RETURN TO CALLER           */
@EL00001 L     @13,4(,@13)                                         0085
@EF00001 L     @00,@SIZDATD                                        0085
         LR    @01,@11                                             0085
         FREEMAIN R,LV=(0),A=(1)
@ER00001 LM    @14,@12,12(@13)                                     0085
         BR    @14                                                 0085
*/********************************************************************/
*/*                                                                  */
*/* SEGMENT NAME -                                                   */
*/*      PRMOPT                                                      */
*/*                                                                  */
*/* FUNCTION -                                                       */
*/*      THIS ROUTINE PROMPTS THE USER FOR A TERMINAL RESPONSE, AND  */
*/*      INVOKES COMMAND SCAN TO CHECK THE RESPONSE.                 */
*/*                                                                  */
*/* OPERATION -                                                      */
*/*      ISSUE PROMPT MESSAGE. SET UP THE                            */
*/*      PARAMETER LIST FOR COMMAND SCAN, PASSING THE BUFFER         */
*/*      RETURNED FROM PUTGET. INVOKE COMMAND SCAN. SAVE THE RETURN  */
*/*      CODE AND ANALYZE COMMAND SCAN OUTPUT.                       */
*/*                                                                  */
*/* INPUT -                                                          */
*/*      PROMPT MESSAGE TO BE ISSUED                                 */
*/*                                                                  */
*/* OUTPUT -                                                         */
*/*      PROMPT MESSAGE ISSUED                                       */
*/*      RESPONSE SCANNED FOR VALIDITY                               */
*/*                                                                  */
*/* NOTE:  THIS ROUTINE REPRESENTS A DIRECT LINE FUNCTION AND CAN    */
*/*        BE INCORPORATED AS AN INCLUDED CODE SEGMENT WHEN THE      */
*/*        INCLUDE FUNCTION HAS RECEIVED A STANDARD DEFINITION.      */
*/********************************************************************/
*    PRMOPT: PROC;                                                 0086
         B     @EL00001                                            0086
PRMOPT   STM   @14,@12,@SA00002                                    0086
*    PRMOPT1:                                                      0087
*        CALL PUTMSG;                  /* ISSUE PROMPT MSG           */
PRMOPT1  BAL   @14,PUTMSG                                          0087
*        NULLRSP = '0'B;               /* INIT FLAG          @Y30NQKH*/
         NI    NULLRSP,B'01111111'                                 0088
*        IF RCODESV > 0 THEN           /* IF PUTGET FAILED,          */
         L     @10,RCODESV(,AWAPTR)                                0089
         LTR   @10,@10                                             0089
         BNP   @RF00089                                            0089
*          RBCODE12 = '1'B;            /* SET ALLOC FAILED INDICATOR */
         OI    RBCODE12(AWAPTR),B'10000000'                        0090
*        ELSE                          /* ELSE               @YM05480*/
*          IF RETSIZE = 2 THEN         /* IF NULL RESPONSE   @YM05480*/
         B     @RC00089                                            0091
@RF00089 L     @10,MSGPTR(,AWAPTR)                                 0091
         L     @10,RETMSG-1(,@10)                                  0091
         LA    @10,0(,@10)                                         0091
         CLC   RETSIZE(2,@10),@CH00082                             0091
         BNE   @RF00091                                            0091
*            DO;                       /* THEN               @Y30NQKH*/
*              NULLRSP = '1'B;         /* INDICATE SO        @Y30NQKH*/
         OI    NULLRSP,B'10000000'                                 0093
*              GO TO INVRSP;           /* PROCESS INVALID    @YM05480*/
         B     INVRSP                                              0094
*            END;                      /*                    @Y30NQKH*/
*        ELSE                                                      0096
*          DO;                         /* IF PUTGET SUCCESSFUL,      */
@RF00091 DS    0H                                                  0097
*            CSPLPTR = ADDR(SCANAREA); /* CSCAN PARM LIST PTR        */
         LA    CSPLPTR,SCANAREA                                    0097
*            SYNCHK = '1'B;            /* NO SYNTAX CHECK            */
         OI    SYNCHK,B'10000000'                                  0098
*            CSPLFLG = ADDR(FLAGWORD); /* FLAGS IN CSCAN LIST        */
         LA    @10,FLAGWORD                                        0099
         ST    @10,CSPLFLG(,CSPLPTR)                               0099
*            IF RETSIZE > 20 THEN      /* IF LENGTH > 20     @YM05480*/
         LA    @10,20                                              0100
         L     @05,MSGPTR(,AWAPTR)                                 0100
         L     @05,RETMSG-1(,@05)                                  0100
         LA    @05,0(,@05)                                         0100
         CH    @10,RETSIZE(,@05)                                   0100
         BNL   @RF00100                                            0100
*              RETSIZE = 20;           /* SET LENGTH TO 20   @YM05480*/
         STH   @10,RETSIZE(,@05)                                   0101
*            PGLENGH = RETSIZE+2;      /* SET LEN OF INPUT   @YM05468*/
@RF00100 L     @10,MSGPTR(,AWAPTR)                                 0102
         L     @10,RETMSG-1(,@10)                                  0102
         LA    @10,0(,@10)                                         0102
         LH    @05,RETSIZE(,@10)                                   0102
         LA    @02,2                                               0102
         ALR   @02,@05                                             0102
         STH   @02,PGLENGH                                         0102
*            PGOFFST = 0;              /* SET OFFSET TO 0            */
         SLR   @02,@02                                             0103
         STH   @02,PGOFFST                                         0103
*                                      /* COPY INPUT INTO BUFFER     */
*            PGINPUT(1:RETSIZE-2) = RETCHAR(1:RETSIZE-2); /* @YM05480*/
         SL    @05,@CF00321                                        0104
         EX    @05,@SM01407                                        0104
*            CSPLCBUF = ADDR(PGBUFFR); /* RESPONSE IN LIST           */
         LA    @10,PGBUFFR                                         0105
         ST    @10,CSPLCBUF(,CSPLPTR)                              0105
*            CSPLOA = ADDR(SCANOUT);   /* PTR TO OUTPUT AREA         */
         LA    @10,SCANOUT                                         0106
         ST    @10,CSPLOA(,CSPLPTR)                                0106
*            CSPLUPT = CPPLUPT;        /* PTR TO UPT                 */
         L     @10,CPPLPTR(,AWAPTR)                                0107
         L     @05,CPPLUPT(,@10)                                   0107
         ST    @05,CSPLUPT(,CSPLPTR)                               0107
*            CSPLECT = CPPLECT;        /* PTR TO ECT                 */
         L     @10,CPPLECT(,@10)                                   0108
         ST    @10,CSPLECT(,CSPLPTR)                               0108
*            CSPLECB = ADDR(COMMECB);  /* PTR TO ECB                 */
         LA    @10,COMMECB(,AWAPTR)                                0109
         ST    @10,CSPLECB(,CSPLPTR)                               0109
*            R1 = CSPLPTR;             /* PTR IN REGISTER 1          */
         LR    R1,CSPLPTR                                          0110
*              DO; /*CALLTSSR EP(IKJSCAN)*/                        0111
*                RESPECIFY GPR01P RSTD;                            0112
*                IF CVTSCAN = 0                                    0113
*                  THEN                                            0113
         L     @10,CVTPTR                                          0113
         C     @02,CVTSCAN(,@10)                                   0113
         BNE   @RF00113                                            0113
*                    GEN(LINK EP=IKJSCAN);                         0114
         LINK EP=IKJSCAN
*                  ELSE                                            0115
*                    CALL CVTSCAN;                                 0115
         B     @RC00113                                            0115
@RF00113 L     @10,CVTPTR                                          0115
         L     @15,CVTSCAN(,@10)                                   0115
         BALR  @14,@15                                             0115
*                RESPECIFY GPR01P UNRSTD;                          0116
@RC00113 DS    0H                                                  0117
*              END;   /* INVOKE COMMAND SCAN@Y30NQKH*/             0117
*            RCODESV = R15;            /* SAVE RETURN CODE           */
         ST    R15,RCODESV(,AWAPTR)                                0118
*            IF RCODESV > 0 THEN       /* IF COMMAND SCAN FAILED     */
         L     @10,RCODESV(,AWAPTR)                                0119
         LTR   @10,@10                                             0119
         BNP   @RF00119                                            0119
*              DO;                     /* ISSUE SYSTEM ERROR MSG     */
*                ENTRYCD = 4;          /* SET ENTRY CODE             */
         MVC   ENTRYCD(2,AWAPTR),@CH00319                          0121
*                R1 = AWAPTR;          /* WORKAREA PTR IN REG 1      */
         LR    R1,AWAPTR                                           0122
*                                      /* ISSUE SYSTEM ERROR MSG     */
*                CALL IKJEFD35;                                    0123
         L     @15,@CV00329                                        0123
         BALR  @14,@15                                             0123
*              END;                                                0124
*            ELSE                                                  0125
*              DO;                     /* IF CMD SCAN SUCCESSFUL     */
         B     @RC00119                                            0125
@RF00119 DS    0H                                                  0126
*                CSOAPTR = CSPLOA;     /* SET PTR TO OUTPUT AREA     */
         L     CSOAPTR,CSPLOA(,CSPLPTR)                            0126
*                IF CSOANOC='1'B THEN  /* IF NULL RESPONSE   @Y30NQKH*/
         TM    CSOANOC(CSOAPTR),B'00010000'                        0127
         BNO   @RF00127                                            0127
*                  DO;                 /* THEN               @Y30NQKH*/
*                    NULLRSP = '1'B;   /* INDICATE SO        @Y30NQKH*/
         OI    NULLRSP,B'10000000'                                 0129
*                    GO TO INVRSP;     /* PROCESS INVALID    @Y30NQKH*/
         B     INVRSP                                              0130
*                  END;                /*                    @Y30NQKH*/
*                ELSE                  /* ELSE               @Y30NQKH*/
*                IF CSOACNM = 0 ×      /* IF PTR IS 0,       @Y30NQKH*/
*                   CSOALNM > 4 THEN   /* LENGTH > 4, THEN   @Y30NQKH*/
@RF00127 L     @10,CSOACNM(,CSOAPTR)                               0132
         LTR   @10,@10                                             0132
         BZ    @RT00132                                            0132
         LH    @15,CSOALNM(,CSOAPTR)                               0132
         C     @15,@CF00319                                        0132
         BH    @RT00132                                            0132
*                  GO TO INVRSP;       /* PROCESS INVALID    @Y30NQKH
*                                         RESPONSE           @Y30NQKH*/
*                ELSE                  /* ELSE               @Y30NQKH*/
*                                      /* IF FREE ENTERED,   @Y30NQKH*/
*                  IF CSOABUF(1:CSOALNM) = 'FREE' THEN    /* @Y30NQKH*/
         BCTR  @15,0                                               0134
         EX    @15,@SC01409                                        0134
         BNE   @RF00134                                            0134
*                    CALL VALIDRSP;    /* PROCESS VALID REPLY@Y30NQKH*/
         BAL   @14,VALIDRSP                                        0135
*                  ELSE                /* ELSE               @Y30NQKH*/
*                    IF CSOALNM>3 THEN /* IF LENGTH > 3 THEN @Y30NQKH*/
         B     @RC00134                                            0136
@RF00134 LH    @10,CSOALNM(,CSOAPTR)                               0136
         C     @10,@CF00321                                        0136
         BH    @RT00136                                            0136
*                      GO TO INVRSP;   /* PROCESS INVALID    @Y30NQKH
*                                         RESPONSE           @Y30NQKH*/
*                    ELSE              /* ELSE               @Y30NQKH*/
*                                      /* IF END ENTERED     @Y30NQKH*/
*                      IF CSOABUF(1:CSOALNM) = 'END' THEN /* @Y30NQKH*/
         L     @01,CSOACNM(,CSOAPTR)                               0138
         BCTR  @10,0                                               0138
         EX    @10,@SC01411                                        0138
         BNE   @RF00138                                            0138
*                        DO;           /* THEN               @Y30NQKH*/
*                                     /* INDICATE ALLOC ERROR@Y30NQKH*/
*                          RBCODE12 = '1'B;               /* @Y30NQKH*/
*                                      /* TERMINATION REQ    @Y30NQKH*/
*                          TERMOPT = '1'B;                /* @Y30NQKH*/
         OI    RBCODE12(AWAPTR),B'10001000'                        0141
*                        END;          /*                    @Y30NQKH*/
*                      ELSE            /* ELSE, PROCESS      @Y30NQKH*/
*                        DO;           /* INVALID RESPONSE   @Y30NQKH*/
         B     @RC00138                                            0143
@RF00138 DS    0H                                                  0144
*         INVRSP:                                                  0144
*                                      /* IF NULL RESPONSE   @Y30NQKH*/
*                        IF NULLRSP = '1'B THEN           /* @Y30NQKH*/
INVRSP   TM    NULLRSP,B'10000000'                                 0144
         BNO   @RF00144                                            0144
*                          DO;         /* THEN               @Y30NQKH*/
*                                      /* CLEAR INDICATOR    @Y30NQKH*/
*                            NULLRSP = '0'B;              /* @Y30NQKH*/
         NI    NULLRSP,B'01111111'                                 0146
*                                      /* SET MESSAGE ID     @Y30NQKH*/
*                            MSGID = '115B';              /* @Y30NQKH*/
         L     @10,MSGPTR(,AWAPTR)                                 0147
         MVC   MSGID(4,@10),@CC01370                               0147
*                          END;        /*                    @Y30NQKH*/
*                        ELSE          /* ELSE,PROCESS       @Y30NQKH*/
*                          DO;         /* OTHER THAN NULL    @Y30NQKH*/
         B     @RC00144                                            0149
@RF00144 DS    0H                                                  0150
*                                      /* SET MESSAGE ID     @Y30NQKH*/
*                            MSGID = '115A';              /* @Y30NQKH*/
         L     @10,MSGPTR(,AWAPTR)                                 0150
         MVC   MSGID(4,@10),@CC01371                               0150
*                                      /* PTR TO RESPONSE    @Y30NQKH*/
*                            VAR1 = ADDR(RETCHAR);        /* @Y30NQKH*/
         L     @02,RETMSG-1(,@10)                                  0151
         LA    @02,0(,@02)                                         0151
         LA    @15,RETCHAR(,@02)                                   0151
         ST    @15,@TF00001                                        0151
         MVC   VAR1(3,@10),@TF00001+1                              0151
*                                      /* LEN OF VARIABLE    @Y30NQKH*/
*                            L1 = RETSIZE-2;              /* @Y30NQKH*/
         LH    @02,RETSIZE(,@02)                                   0152
         BCTR  @02,0                                               0152
         BCTR  @02,0                                               0152
         STC   @02,L1(,@10)                                        0152
*                          END;        /*                    @Y30NQKH*/
*                        MTPUTLSW = '1'B;/* INDICATE PUTLINE         */
@RC00144 L     @10,MSGPTR(,AWAPTR)                                 0154
         OI    MTPUTLSW(@10),B'01000000'                           0154
*                        CALL PUTMSG;    /* ISSUE MESSAGE            */
         BAL   @14,PUTMSG                                          0155
*                                        /* IF PUTLINE FAILED,       */
*                        IF RCODESV > 0 THEN                       0156
         L     @10,RCODESV(,AWAPTR)                                0156
         LTR   @10,@10                                             0156
         BNP   @RF00156                                            0156
*                                        /* INDICATE SO              */
*                          RBCODE12 = '1'B;                        0157
         OI    RBCODE12(AWAPTR),B'10000000'                        0157
*                        ELSE                                      0158
*                          DO;           /* OTHERWISE,               */
         B     @RC00156                                            0158
@RF00156 DS    0H                                                  0159
*                                        /* SET MESSAGE ID           */
*                            MSGID = '116A';                       0159
         L     @10,MSGPTR(,AWAPTR)                                 0159
         MVC   MSGID(4,@10),@CC01372                               0159
*                                        /* INDICATE PUTGET          */
*                            MTPUTLSW='0'B;                        0160
         NI    MTPUTLSW(@10),B'10111111'                           0160
*                            VAR1=DDNPTR;/* PTR TO DDNAME VARIABLE   */
         L     @02,PTRPDL(,AWAPTR)                                 0161
         MVC   VAR1(3,@10),DDNPTR+1(@02)                           0161
*                            L1 = DDNLEN;/* SET VARIABLE LENGTH      */
         MVC   L1(1,@10),DDNLEN+1(@02)                             0162
*                                        /* ISSUE MESSAGE            */
*                            GO TO PRMOPT1;                        0163
         B     PRMOPT1                                             0163
*                          END;                                    0164
*                      END;                                        0165
*               END;                                               0166
*          END;                                                    0167
*    END PRMOPT;                                                   0168
@EL00002 DS    0H                                                  0168
@EF00002 DS    0H                                                  0168
@ER00002 LM    @14,@12,@SA00002                                    0168
         BR    @14                                                 0168
*/********************************************************************/
*/*                                                                  */
*/* SEGMENT NAME -                                                   */
*/*      VALIDRSP                                                    */
*/*                                                                  */
*/* FUNCTION -                                                       */
*/*      THIS ROUTINE FREES THE FILE AND RE-ALLOCATES IT.            */
*/*                                                                  */
*/* OPERATION -                                                      */
*/*      POINTER TO CURRENT TEXT IS SAVED. A GETMAIN IS ISSUED FOR   */
*/*      STORAGE FOR BUILDING THE FREE FUNCTION TEXT. TWO TEXT       */
*/*      UNITS ARE SET UP IN THE STORAGE - ONE SPECIFYING THE        */
*/*      DDNAME TO BE FREED, AND ONE SPECIFYING THAT PERMANENTLY     */
*/*      ALLOCATED DATA SETS ARE TO BE FREED. THE VERB IN THE        */
*/*      REQUEST BLOCK IS SET TO UNALLOC, AND DYNAMIC ALLOCATION IS  */
*/*      INVOKED. THE ORIGINAL TEXT POINTER IS SET BACK IN THE       */
*/*      REQUEST BLOCK AND THE VERB IS SET TO ALLOC. DYNAMIC         */
*/*      ALLOCATION IS INVOKED AGAIN.                                */
*/*                                                                  */
*/* INPUT -                                                          */
*/*      SVC 99 REQUEST BLOCK                                        */
*/*                                                                  */
*/* OUTPUT -                                                         */
*/*      FILE FREED AND RE-ALLOCATED                                 */
*/*                                                                  */
*/* NOTE:  THIS ROUTINE REPRESENTS A DIRECT LINE FUNCTION AND CAN    */
*/*        BE INCORPORATED AS AN INCLUDED CODE SEGMENT WHEN THE      */
*/*        INCLUDE FUNCTION HAS RECEIVED A STANDARD DEFINITION.      */
*/********************************************************************/
*    VALIDRSP: PROC;                                               0169
VALIDRSP STM   @14,@12,@SA00003                                    0169
*        SAVETXTP = S99TXTPP;          /* SAVE PTR TO TEXT           */
         L     @10,PTRS99RB(,AWAPTR)                               0170
         L     SAVETXTP,S99TXTPP(,@10)                             0170
*        PRMPTXTP = ADDR(PRMTEXT);     /* SET POINTER TO STORAGE     */
         LA    PRMPTXTP,PRMTEXT                                    0171
*        FILEADDR = ADDR(FILEKEY);     /* ADDRESS OF FILE TEXT       */
         LA    @05,FILEKEY                                         0172
         ST    @05,FILEADDR                                        0172
*        PERMADDR = ADDR(PERMKEY);     /* ADDRESS OF PERM TEXT       */
         LA    @05,PERMKEY                                         0173
         ST    @05,PERMADDR                                        0173
*        ENDPRMT = '1'B;               /* END OF ADDRESS LIST        */
         OI    ENDPRMT,B'10000000'                                 0174
*        FILEKEY = DUNDDNAM;           /* FILE TEXT - KEY,           */
         MVC   FILEKEY(2),@CH00491                                 0175
*        FILENUM = 1;                  /* NUMBER,                    */
         MVC   FILENUM(2),@CH00033                                 0176
*        FILELEN = DDNLEN;             /* LENGTH AND PARM            */
         L     @05,PTRPDL(,AWAPTR)                                 0177
         LH    @15,DDNLEN(,@05)                                    0177
         STH   @15,FILELEN                                         0177
*        FILEBUF(1:FILELEN)=DDNBUF(1:FILELEN);                     0178
         BCTR  @15,0                                               0178
         L     @05,DDNPTR(,@05)                                    0178
         EX    @15,@SM01414                                        0178
*        PERMKEY = DUNUNALC;           /* PERM TEXT - KEY,           */
         MVC   PERMKEY(2),@CH00503                                 0179
*        PERMNUM = 0;                  /* AND NUMBER                 */
         SLR   @05,@05                                             0180
         STH   @05,PERMNUM                                         0180
*        S99TXTPP = PRMPTXTP;          /* PTR IN REQUEST BLOCK       */
         ST    PRMPTXTP,S99TXTPP(,@10)                             0181
*        S99VERB = S99VRBUN;           /* UNALLOC VERB               */
         MVI   S99VERB(@10),X'02'                                  0182
*        S99ERROR = S99ERROR && S99ERROR;/* CLEAR ERROR FIELD        */
         XC    S99ERROR(2,@10),S99ERROR(@10)                       0183
*        SAVEFLG = S99FLG11;             /* SAVE FLAG SETTING        */
         MVC   SAVEFLG(1),S99FLG11(@10)                            0184
*        S99FLG11 = S99FLG11 && S99FLG11;/* CLEAR FLAGS              */
         XC    S99FLG11(1,@10),S99FLG11(@10)                       0185
*        CALL DYNSVC;                  /* INVOKE DYN ALLOCATION      */
         BAL   @14,DYNSVC                                          0186
*        IF RCODESV = 0 THEN           /* IF DYN ALLOC SUCCESSFUL    */
         L     @10,RCODESV(,AWAPTR)                                0187
         LTR   @10,@10                                             0187
         BNZ   @RF00187                                            0187
*          DO;                                                     0188
*            S99TXTPP = SAVETXTP;      /* RESOTRE FORMER TEXT PTR    */
         L     @10,PTRS99RB(,AWAPTR)                               0189
         ST    SAVETXTP,S99TXTPP(,@10)                             0189
*            S99FLG11 = SAVEFLG;       /* RESTORE FLAG SETTINGS      */
         MVC   S99FLG11(1,@10),SAVEFLG                             0190
*            S99VERB = S99VRBAL;       /* SET ALLOC VERB             */
         MVI   S99VERB(@10),X'01'                                  0191
*            CALL DYNSVC;              /* INVOKE DYN ALLOCATION      */
         BAL   @14,DYNSVC                                          0192
*            IF RCODESV > 0 THEN       /* IF DYN ALLOC FAILED,       */
         L     @10,RCODESV(,AWAPTR)                                0193
         LTR   @10,@10                                             0193
         BNP   @RF00193                                            0193
*              DO;                                                 0194
*                RBCODE12 = '1'B;      /* INDICATE ALLOC FAILED      */
         OI    RBCODE12(AWAPTR),B'10000000'                        0195
*                ENTRYCD = 1;          /* INDICATE ALLOC ERROR       */
         MVC   ENTRYCD(2,AWAPTR),@CH00033                          0196
*                R1 = AWAPTR;          /* WORKAREA PTR IN REG 1      */
         LR    R1,AWAPTR                                           0197
*                CALL IKJEFD35;        /* ISSUE ERROR MESSAGE        */
         L     @15,@CV00329                                        0198
         BALR  @14,@15                                             0198
*              END;                                                0199
*          END;                                                    0200
*        ELSE                          /* ELSE,                      */
*          DO;                         /* IF DYN ALLOC FAILED        */
         B     @RC00187                                            0201
@RF00187 DS    0H                                                  0202
*            RBCODE12 = '1'B;          /* INDICATE ALLOC FAILED      */
         OI    RBCODE12(AWAPTR),B'10000000'                        0202
*            ENTRYCD = 1;              /* INDICATE ALLOC ERROR       */
         MVC   ENTRYCD(2,AWAPTR),@CH00033                          0203
*            R1 = AWAPTR;              /* WORKAREA PTR IN REG 1      */
         LR    R1,AWAPTR                                           0204
*            CALL IKJEFD35;            /* ISSUE ERROR MESSAGE        */
         L     @15,@CV00329                                        0205
         BALR  @14,@15                                             0205
*          END;                                                    0206
*    END VALIDRSP;                                                 0207
@EL00003 DS    0H                                                  0207
@EF00003 DS    0H                                                  0207
@ER00003 LM    @14,@12,@SA00003                                    0207
         BR    @14                                                 0207
*/********************************************************************/
*/*                                                                  */
*/* SEGMENT NAME -                                                   */
*/*      DYNSVC                                                      */
*/*                                                                  */
*/* FUNCTION -                                                       */
*/*      THIS ROUTINE INVOKES DYNAMIC ALLOCATION                     */
*/*                                                                  */
*/* OPERATION -                                                      */
*/*      THE PARAMETER LIST IS COMPLETED. THE MACRO TO INVOKE SVC 99 */
*/*      IS ISSUED. THE RETURN CODE FROM DYNAMIC ALLOCATION IS       */
*/*      SAVED.                                                      */
*/*                                                                  */
*/* INPUT -                                                          */
*/*      SVC 99 REQUEST BLOCK                                        */
*/*                                                                  */
*/* OUTPUT -                                                         */
*/*      RETURN CODE                                                 */
*/*                                                                  */
*/********************************************************************/
*    DYNSVC: PROC;                                                 0208
*                                                                  0208
DYNSVC   STM   @14,@12,12(@13)                                     0208
*        R1 = ADDR(S99RBPTR);          /* PTR IN REGISTER 1          */
         LA    R1,S99RBPTR                                         0209
*        S99RBPTR = PTRS99RB;          /* PTR TO REQUEST BLOCK       */
         L     @10,PTRS99RB(,AWAPTR)                               0210
         ST    @10,S99RBPTR                                        0210
*        S99RBPND = '1'B;              /* HIGH ORDER BIT ON          */
*                                                                  0211
*                                                                  0211
         OI    S99RBPND,B'10000000'                                0211
*         /*MACDATE Y-2 73082*/                                    0212
*         SVC (99);                    /* ISSUE SVC 99               */
*                                                                  0212
         SVC   99                                                  0212
*        RCODESV = R15;                /* SAVE RETURN CODE           */
*                                                                  0213
         ST    R15,RCODESV(,AWAPTR)                                0213
*    END DYNSVC;                                                   0214
@EL00004 DS    0H                                                  0214
@EF00004 DS    0H                                                  0214
@ER00004 LM    @14,@12,12(@13)                                     0214
         BR    @14                                                 0214
*/********************************************************************/
*/*                                                                  */
*/* SEGMENT NAME -                                                   */
*/*      PUTMSG                                                      */
*/*                                                                  */
*/* FUNCTION -                                                       */
*/*      THIS ROUTINE INVOKES THE MESSAGE PROCESSOR, IKJEFF02.       */
*/*                                                                  */
*/* OPERATION -                                                      */
*/*      THE PARAMETER LIST TO IKJEFF02 IS COMPLETED. IKJEFF02 IS    */
*/*      LOADED IN, AND CALLED. THE RETURN CODE IN REGISTER 15 IS    */
*/*      SAVED. THE MESSAGE PROCESSOR IS DELETED.                    */
*/*                                                                  */
*/* INPUT -                                                          */
*/*      IKJEFF02 PARAMETER LIST                                     */
*/*                                                                  */
*/* OUTPUT -                                                         */
*/*      RETURN CODE  = 0 - PUTLINE/PUTGET SUCCESSFUL                */
*/*                  ^= 0 - PUTLINE/PUTGET FAILED                    */
*/*                                                                  */
*/********************************************************************/
*    PUTMSG: PROC;                                                 0215
PUTMSG   STM   @14,@12,@SA00005                                    0215
*        LISTPTR = ADDR(MSGCSECT);     /* ADDR OF PARM LIST          */
         L     @10,MSGPTR(,AWAPTR)                                 0216
         LA    @02,MSGCSECT(,@10)                                  0216
         ST    @02,LISTPTR(,@10)                                   0216
*        MTCPPL = CPPLPTR;             /* PTR TO CPPL                */
         L     @02,CPPLPTR(,AWAPTR)                                0217
         ST    @02,MTCPPL(,@10)                                    0217
*        ECBPTR = ADDR(COMMECB);       /* COMMUNICATIONS ECB         */
         LA    @02,COMMECB(,AWAPTR)                                0218
         ST    @02,ECBPTR(,@10)                                    0218
*        COMMECB = 0;                  /* SET ECB TO 0               */
         SLR   @02,@02                                             0219
         ST    @02,COMMECB(,AWAPTR)                                0219
*        MTHIGH = '1'B;                /* HIGH ORDER BIT ON          */
         OI    MTHIGH(@10),B'10000000'                             0220
*        MSGCSECT = PTRMSGS;           /* PTR TO MSG CSECT           */
         L     @02,PTRMSGS(,AWAPTR)                                0221
         ST    @02,MSGCSECT(,@10)                                  0221
*        R1 = ADDR(MSGTABLE);          /* PARM LIST IN REG 1         */
*                                                                  0222
         LR    R1,@10                                              0222
*        GEN (LINK EP=IKJEFF02);       /* INVOKE MSG PROCESSOR       */
*                                                                  0223
         LINK EP=IKJEFF02
*        RCODESV = R15;                /* SAVE RETURN CODE           */
*                                                                  0224
         ST    R15,RCODESV(,AWAPTR)                                0224
*    END PUTMSG;                                                   0225
*                                                                  0225
*                                                                  0225
@EL00005 DS    0H                                                  0225
@EF00005 DS    0H                                                  0225
@ER00005 LM    @14,@12,@SA00005                                    0225
         BR    @14                                                 0225
*  DECLARE /*GENERAL PURPOSE REGISTERS */                          0226
*    GPR00P PTR(31) REG(0),                                        0226
*    GPR01P PTR(31) REG(1),                                        0226
*    GPR02P PTR(31) REG(2),                                        0226
*    GPR03P PTR(31) REG(3),                                        0226
*    GPR04P PTR(31) REG(4),                                        0226
*    GPR05P PTR(31) REG(5),                                        0226
*    GPR06P PTR(31) REG(6),                                        0226
*    GPR07P PTR(31) REG(7),                                        0226
*    GPR08P PTR(31) REG(8),                                        0226
*    GPR09P PTR(31) REG(9),                                        0226
*    GPR14P PTR(31) REG(14),                                       0226
*    GPR15P PTR(31) REG(15);                                       0226
*                                                                  0226
*  DECLARE /* COMMON VARIABLES */                                  0227
*    I256C CHAR(256) BASED,                                        0227
*    I031F FIXED(31) BASED,                                        0227
*    I031P PTR(31)   BASED,                                        0227
*    I015F FIXED(15) BASED,                                        0227
*    I015P PTR(15)   BASED,                                        0227
*    I008P PTR(8)    BASED,                                        0227
*    I001C CHAR(1)   BASED;                                        0227
*                                                                  0227
*    END IKJEFD36                                                  0228
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.      *
*/*%INCLUDE SYSLIB  (IKJZT430)                                        *
*/*%INCLUDE SYSLIB  (IKJCPPL )                                        *
*/*%INCLUDE SYSLIB  (IKJEFFMT)                                        *
*/*%INCLUDE SYSLIB  (IKJCSPL )                                        *
*/*%INCLUDE SYSLIB  (IKJCSOA )                                        *
*/*%INCLUDE SYSLIB  (IEFZB4D0)                                        *
*/*%INCLUDE SYSLIB  (IEFZB4D2)                                        *
*/*%INCLUDE SYSLIB  (CVT     )                                        *
*;                                                                 0228
@DATA    DS    0H
@CH00033 DC    H'1'
@CH00082 DC    H'2'
@CH00491 DC    XL2'0001'
@CH00503 DC    XL2'0007'
@SM01407 MVC   PGINPUT(0),RETCHAR(@10)
@SC01409 CLC   CSOABUF(0,@10),@CC01366
@SC01411 CLC   CSOABUF(0,@01),@CC01368
@SM01414 MVC   FILEBUF(0),DDNBUF(@05)
@DATD    DSECT
         DS    0F
@SA00001 DS    18F
@PC00001 DS    1F
@SAV001  EQU   @SA00001
@SA00002 DS    15F
@SA00005 DS    15F
@SA00003 DS    15F
@TF00001 DS    F
@ZTEMPS  DS    C
@ZTEMPND EQU   *
@ZLEN    EQU   @ZTEMPND-@ZTEMPS
@TEMPS   EQU   @ZTEMPS
@L       EQU   @ZLEN
IKJEFD36 CSECT
         DS    0F
@CF00321 DC    F'3'
@CF00319 DC    F'4'
@CH00319 EQU   @CF00319+2
@CF01355 DC    F'12'
@DATD    DSECT
         DS    0D
S99RBPTR DS    AL4
         ORG   S99RBPTR
S99RBPND DS    BL1
         ORG   S99RBPTR+4
S99TUFP  DS    A
PRMFLG   DS    CL1
         ORG   PRMFLG
NULLRSP  DS    BL1
@NM00001 EQU   PRMFLG+0
         ORG   PRMFLG+1
         DS    CL3
PGBUFFR  DS    CL22
         ORG   PGBUFFR
PGLENGH  DS    FL2
PGOFFST  DS    FL2
PGINPUT  DS    CL18
         ORG   PGBUFFR+22
         DS    CL2
FLAGWORD DS    CL4
         ORG   FLAGWORD
SYNCHK   DS    BL1
@NM00011 EQU   FLAGWORD+0
@NM00012 DS    AL3
         ORG   FLAGWORD+4
SCANAREA DS    CL24
SCANOUT  DS    CL8
PRMTEXT  DS    CL26
         ORG   PRMTEXT
FILEADDR DS    AL4
PERMADDR DS    AL4
         ORG   PERMADDR
ENDPRMT  DS    BL1
         ORG   PRMTEXT+8
FILEKEY  DS    FL2
FILENUM  DS    FL2
FILELEN  DS    FL2
FILEBUF  DS    CL8
PERMKEY  DS    FL2
PERMNUM  DS    FL2
         ORG   PRMTEXT+26
SAVEFLG  DS    CL1
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA
@ENDDATD EQU   *
@DATEND  EQU   *
IKJEFD36 CSECT
         DS    0F
@SIZDATD DC    AL1(1)
         DC    AL3(@ENDDATD-@DATD)
@SIZ001  EQU   @SIZDATD
@CV00329 DC    V(IKJEFD35)
         DS    0D
@CC01352 DC    C'113A'
@CC01366 DC    C'FREE'
@CC01370 DC    C'115B'
@CC01371 DC    C'115A'
@CC01372 DC    C'116A'
@CC01368 DC    C'END'
         DS    CL1
PATCH36  DC    25F'0'
@00      EQU   00                      EQUATES FOR REGISTERS 0-15
@01      EQU   01
@02      EQU   02
@03      EQU   03
@04      EQU   04
@05      EQU   05
@06      EQU   06
@07      EQU   07
@08      EQU   08
@09      EQU   09
@10      EQU   10
@11      EQU   11
@12      EQU   12
@13      EQU   13
@14      EQU   14
@15      EQU   15
@0       EQU   00
@1       EQU   01
@2       EQU   02
@3       EQU   03
@4       EQU   04
@5       EQU   05
@6       EQU   06
@7       EQU   07
@8       EQU   08
@9       EQU   09
@A       EQU   10
@B       EQU   11
@C       EQU   12
@D       EQU   13
@E       EQU   14
@F       EQU   15
SAVETXTP EQU   @04
PRMPTXTP EQU   @02
CSOAPTR  EQU   @02
CSPLPTR  EQU   @04
AWAPTR   EQU   @03
R1       EQU   @01
R13      EQU   @13
R15      EQU   @15
GPR01P   EQU   @01
GPR00P   EQU   @00
GPR02P   EQU   @02
GPR03P   EQU   @03
GPR04P   EQU   @04
GPR05P   EQU   @05
GPR06P   EQU   @06
GPR07P   EQU   @07
GPR08P   EQU   @08
GPR09P   EQU   @09
GPR14P   EQU   @14
GPR15P   EQU   @15
R0       EQU   @00
R14      EQU   @14
CVTPTR   EQU   16
REGSAVE  EQU   4
RETCODE  EQU   16
ALLOCWA  EQU   0
CPPLPTR  EQU   ALLOCWA
PTRPDL   EQU   ALLOCWA+4
SWITCH   EQU   ALLOCWA+12
RBCODE12 EQU   SWITCH
TERMOPT  EQU   SWITCH
ENTRYCD  EQU   ALLOCWA+14
PTRS99RB EQU   ALLOCWA+20
RCODESV  EQU   ALLOCWA+24
PTRMSGS  EQU   ALLOCWA+32
VCFLAGS  EQU   ALLOCWA+36
MSGPTR   EQU   ALLOCWA+48
CMDTWO   EQU   ALLOCWA+60
COMMECB  EQU   ALLOCWA+160
ALLOCPDL EQU   0
DSNPDE   EQU   ALLOCPDL+48
DSNPTR   EQU   DSNPDE
DSNFLAGS EQU   DSNPDE+6
MBRPTR   EQU   DSNPDE+8
MBRFLAGS EQU   DSNPDE+14
PASSPTR  EQU   DSNPDE+16
PASSFLAG EQU   DSNPDE+22
DDNMEPDE EQU   ALLOCPDL+76
DDNPTR   EQU   DDNMEPDE
DDNLEN   EQU   DDNMEPDE+4
DDNFLAGS EQU   DDNMEPDE+6
CLASPDE  EQU   ALLOCPDL+84
CLASPTR  EQU   CLASPDE
CLASFLG  EQU   CLASPDE+6
SERPDE   EQU   ALLOCPDL+92
SERPTR   EQU   SERPDE
SERFLAGS EQU   SERPDE+6
BLKPDE   EQU   ALLOCPDL+104
BLKPTR   EQU   BLKPDE
BLKFLAGS EQU   BLKPDE+6
ABLKPDE  EQU   ALLOCPDL+112
ABLKPTR  EQU   ABLKPDE
ABLKFLG  EQU   ABLKPDE+6
SPACPDE  EQU   ALLOCPDL+120
SPACEPTR EQU   SPACPDE
SPACEFLG EQU   SPACPDE+6
SPACPDE2 EQU   ALLOCPDL+128
SPACPTR2 EQU   SPACPDE2
SPACFLG2 EQU   SPACPDE2+6
DIRECPDE EQU   ALLOCPDL+136
DIRPTR   EQU   DIRECPDE
DIRFLAGS EQU   DIRECPDE+6
ATTRPDE  EQU   ALLOCPDL+144
ATTRPTR  EQU   ATTRPDE
ATTRFLAG EQU   ATTRPDE+6
USIDPDE  EQU   ALLOCPDL+152
USIDPTR  EQU   USIDPDE
USIDFLAG EQU   USIDPDE+6
UTYPPDE  EQU   ALLOCPDL+160
UTYPPTR  EQU   UTYPPDE
UTYPFLAG EQU   UTYPPDE+6
UNCNTPDE EQU   ALLOCPDL+168
UCNTPTR  EQU   UNCNTPDE
UCNTFLAG EQU   UNCNTPDE+6
POSTPDE  EQU   ALLOCPDL+180
POSPTR   EQU   POSTPDE
POSFLAG  EQU   POSTPDE+6
MXVOLPDE EQU   ALLOCPDL+188
MXVOLPTR EQU   MXVOLPDE
MXVOLFLG EQU   MXVOLPDE+6
VOLSQPDE EQU   ALLOCPDL+196
VOLSQPTR EQU   VOLSQPDE
VOLSQFLG EQU   VOLSQPDE+6
VVGRPDE  EQU   ALLOCPDL+204
VVGPPTR  EQU   VVGRPDE
VVGPFLG  EQU   VVGRPDE+6
DSNBUF   EQU   0
DDNBUF   EQU   0
CPPL     EQU   0
CPPLUPT  EQU   CPPL+4
CPPLECT  EQU   CPPL+12
MSGTABLE EQU   0
LISTPTR  EQU   MSGTABLE
TMCTPTR  EQU   MSGTABLE+4
MTCPPL   EQU   TMCTPTR
ECBPTR   EQU   MSGTABLE+8
@NM00006 EQU   MSGTABLE+12
MTHIGH   EQU   @NM00006
MSGCSECT EQU   MSGTABLE+16
SW       EQU   MSGTABLE+20
MTPUTLSW EQU   SW
RETMSG   EQU   MSGTABLE+21
SW2      EQU   MSGTABLE+24
MSGID    EQU   MSGTABLE+40
MTINSRTS EQU   MSGTABLE+44
L1       EQU   MTINSRTS
VAR1     EQU   MTINSRTS+1
L2       EQU   MTINSRTS+4
L3       EQU   MTINSRTS+8
L4       EQU   MTINSRTS+12
RET      EQU   0
RETSIZE  EQU   RET
RETCHAR  EQU   RET+2
CSPL     EQU   0
CSPLUPT  EQU   CSPL
CSPLECT  EQU   CSPL+4
CSPLECB  EQU   CSPL+8
CSPLFLG  EQU   CSPL+12
CSPLOA   EQU   CSPL+16
CSPLCBUF EQU   CSPL+20
CSOA     EQU   0
CSOACNM  EQU   CSOA
CSOALNM  EQU   CSOA+4
CSOAFLG  EQU   CSOA+6
CSOANOC  EQU   CSOAFLG
CSOABUF  EQU   0
S99RB    EQU   0
S99VERB  EQU   S99RB+1
S99FLAG1 EQU   S99RB+2
S99FLG11 EQU   S99FLAG1
S99RSC   EQU   S99RB+4
S99ERROR EQU   S99RSC
S99TXTPP EQU   S99RB+8
S99FLAG2 EQU   S99RB+16
S99FLG21 EQU   S99FLAG2
S99FLG22 EQU   S99FLAG2+1
S99TUPL  EQU   0
S99TUPTR EQU   S99TUPL
S99TUP   EQU   0
S99TUNIT EQU   0
S99TUENT EQU   S99TUNIT+4
S99TUFLD EQU   0
CVTMAP   EQU   0
CVTDAR   EQU   CVTMAP+72
CVTFLGS1 EQU   CVTDAR
CVTDCB   EQU   CVTMAP+116
CVTIERLC EQU   CVTMAP+144
CVTOPTA  EQU   CVTMAP+182
CVTOPTB  EQU   CVTMAP+183
CVTGTF   EQU   CVTMAP+236
CVTGTFST EQU   CVTGTF
CVTGTFS  EQU   CVTGTFST
CVTSTATE EQU   CVTGTFST
CVTTMODE EQU   CVTGTFST
CVTFORM  EQU   CVTGTFST
CVTAQAVT EQU   CVTMAP+240
CVTTCMFG EQU   CVTAQAVT
CVTVOLM2 EQU   CVTMAP+244
CVTTATA  EQU   CVTVOLM2
CVTTSKS  EQU   CVTTATA
CVTVOLF2 EQU   CVTTSKS
CVTTAT   EQU   CVTTATA+1
CVTATER  EQU   CVTMAP+248
CVTEXT1  EQU   CVTMAP+252
CVTPURG  EQU   CVTMAP+260
CVTQMSG  EQU   CVTMAP+268
CVTDMSR  EQU   CVTMAP+272
CVTERPV  EQU   CVTMAP+316
CVTINTLA EQU   CVTMAP+320
CVTAPF   EQU   CVTMAP+324
CVTEXT2  EQU   CVTMAP+328
CVTHJES  EQU   CVTMAP+332
CVTPGSIA EQU   CVTMAP+348
CVTA1F1  EQU   CVTMAP+356
CVTSYSK  EQU   CVTMAP+357
CVTVOLM1 EQU   CVTMAP+380
CVTVOLF1 EQU   CVTVOLM1
CVTATMCT EQU   CVTMAP+388
CVTXTNT1 EQU   0
CVTXTNT2 EQU   0
CVTDSSV  EQU   CVTXTNT2
CVTFLGBT EQU   CVTXTNT2+5
CVTQID   EQU   CVTXTNT2+24
CVTRV400 EQU   CVTXTNT2+52
CVTRV409 EQU   CVTXTNT2+53
CVTATCVT EQU   CVTXTNT2+64
CVTRV429 EQU   CVTXTNT2+84
CVTRV438 EQU   CVTXTNT2+85
CVTRV457 EQU   CVTXTNT2+112
CVTRV466 EQU   CVTXTNT2+113
CVTFIX   EQU   -256
CVTRELNO EQU   CVTFIX+252
ABLKBUF  EQU   0
ATTRBUF  EQU   0
BLKBUF   EQU   0
CLASSBUF EQU   0
DIRBUF   EQU   0
I001C    EQU   0
I008P    EQU   0
I015F    EQU   0
I015P    EQU   0
I031F    EQU   0
I031P    EQU   0
I256C    EQU   0
MBRBUF   EQU   0
MSGECB   EQU   0
MSGTMCT  EQU   0
MXVOLBUF EQU   0
PASSBUF  EQU   0
POSTBUF  EQU   0
SERBUF   EQU   0
SPACBUF2 EQU   0
SPACEBUF EQU   0
UCNTBUF  EQU   0
USIDBUF  EQU   0
UTYPBUF  EQU   0
VSEQBUF  EQU   0
VVGPBUF  EQU   0
INPARMS  EQU   0
CVTS01   EQU   CVTPGSIA
CVTLPDIA EQU   CVTS01+12
CVTDIRST EQU   CVTLPDIA
CVTSLIDA EQU   CVTS01+24
CVTCTLFG EQU   CVTS01+50
CVTSCAN  EQU   CVTS01+132
CVTRV210 EQU   CVTS01+424
CVTRV219 EQU   CVTS01+425
CVTRV228 EQU   CVTS01+426
CVTRV237 EQU   CVTS01+427
CVTMFRTR EQU   CVTS01+452
CVTRV262 EQU   CVTS01+468
CVTRV271 EQU   CVTS01+469
CVTRV280 EQU   CVTS01+470
CVTRV289 EQU   CVTS01+471
CVTGSDA  EQU   CVTS01+600
*                                      START UNREFERENCED COMPONENTS
CVTRV628 EQU   CVTS01+728
CVTRV627 EQU   CVTS01+724
CVTRV626 EQU   CVTS01+720
CVTRV625 EQU   CVTS01+716
CVTRV624 EQU   CVTS01+712
CVTRV623 EQU   CVTS01+708
CVTRV622 EQU   CVTS01+704
CVTRV621 EQU   CVTS01+700
CVTRV620 EQU   CVTS01+696
CVTRV619 EQU   CVTS01+692
CVTRV618 EQU   CVTS01+688
CVTRV617 EQU   CVTS01+684
CVTRV616 EQU   CVTS01+680
CVTRV615 EQU   CVTS01+676
CVTRV614 EQU   CVTS01+672
CVTRV613 EQU   CVTS01+668
CVTRV612 EQU   CVTS01+664
CVTRV611 EQU   CVTS01+660
CVTRV610 EQU   CVTS01+656
CVTRV609 EQU   CVTS01+652
CVTRV608 EQU   CVTS01+648
CVTRV607 EQU   CVTS01+644
CVTRV606 EQU   CVTS01+640
CVTRV605 EQU   CVTS01+636
CVTRV604 EQU   CVTS01+632
CVTRV603 EQU   CVTS01+628
CVTRV602 EQU   CVTS01+624
CVTSSCR  EQU   CVTS01+620
CVTEVENT EQU   CVTS01+616
CVTCRCA  EQU   CVTS01+612
CVTTPIO  EQU   CVTS01+608
CVTADV   EQU   CVTS01+604
CVTGSDAB EQU   CVTGSDA
CVTQV3   EQU   CVTS01+596
CVTQV2   EQU   CVTS01+592
CVTQV1   EQU   CVTS01+588
CVTRPT   EQU   CVTS01+584
CVTSSRB  EQU   CVTS01+580
CVTCSDRL EQU   CVTS01+576
CVTEXP1  EQU   CVTS01+572
CVTRMPMT EQU   CVTS01+568
CVTRMPTT EQU   CVTS01+564
CVTVPSA  EQU   CVTS01+560
CVTVSTOP EQU   CVTS01+556
CVTGTFR8 EQU   CVTS01+552
CVTQUIT  EQU   CVTS01+548
CVTVACR  EQU   CVTS01+544
CVTWTCB  EQU   CVTS01+540
CVTSTPRS EQU   CVTS01+536
CVT0PT02 EQU   CVTS01+532
CVTDARCM EQU   CVTS01+528
CVTIRECM EQU   CVTS01+524
CVTJRECM EQU   CVTS01+520
CVTVEMS0 EQU   CVTS01+516
CVTSPFRR EQU   CVTS01+512
CVTRLSTG EQU   CVTS01+508
CVT0TC0A EQU   CVTS01+504
CVTGMBR  EQU   CVTS01+500
CVTLFRM  EQU   CVTS01+496
CVTRMBR  EQU   CVTS01+492
CVTVIOP  EQU   CVTS01+488
CVTRV307 EQU   CVTS01+486
CVTRV306 EQU   CVTS01+484
CVTRV305 EQU   CVTS01+482
CVTRV304 EQU   CVTS01+480
CVTRV303 EQU   CVTS01+478
CVTRV302 EQU   CVTS01+476
CVTRV301 EQU   CVTS01+475
CVTRV300 EQU   CVTS01+474
CVTRV299 EQU   CVTS01+473
CVTRV298 EQU   CVTS01+472
CVTRV297 EQU   CVTRV289
CVTRV296 EQU   CVTRV289
CVTRV295 EQU   CVTRV289
CVTRV294 EQU   CVTRV289
CVTRV293 EQU   CVTRV289
CVTRV292 EQU   CVTRV289
CVTRV291 EQU   CVTRV289
CVTRV290 EQU   CVTRV289
CVTRV288 EQU   CVTRV280
CVTRV287 EQU   CVTRV280
CVTRV286 EQU   CVTRV280
CVTRV285 EQU   CVTRV280
CVTRV284 EQU   CVTRV280
CVTRV283 EQU   CVTRV280
CVTRV282 EQU   CVTRV280
CVTRV281 EQU   CVTRV280
CVTRV279 EQU   CVTRV271
CVTRV278 EQU   CVTRV271
CVTRV277 EQU   CVTRV271
CVTRV276 EQU   CVTRV271
CVTRV275 EQU   CVTRV271
CVTRV274 EQU   CVTRV271
CVTRV273 EQU   CVTRV271
CVTRV272 EQU   CVTRV271
CVTRV270 EQU   CVTRV262
CVTRV269 EQU   CVTRV262
CVTRV268 EQU   CVTRV262
CVTRV267 EQU   CVTRV262
CVTRV266 EQU   CVTRV262
CVTRV265 EQU   CVTRV262
CVTRV264 EQU   CVTRV262
CVTRV263 EQU   CVTRV262
CVTVFP   EQU   CVTS01+464
CVTVSI   EQU   CVTS01+460
CVTVPSIB EQU   CVTS01+456
CVTMFACT EQU   CVTMFRTR
CVTMFCTL EQU   CVTS01+448
CVTPVBP  EQU   CVTS01+444
CVTPWI   EQU   CVTS01+440
CVTRV254 EQU   CVTS01+438
CVTRV253 EQU   CVTS01+436
CVTRV252 EQU   CVTS01+434
CVTRV251 EQU   CVTS01+433
CVTRV250 EQU   CVTS01+432
CVTRV249 EQU   CVTS01+431
CVTRV248 EQU   CVTS01+430
CVTRV247 EQU   CVTS01+429
CVTRV246 EQU   CVTS01+428
CVTRV245 EQU   CVTRV237
CVTRV244 EQU   CVTRV237
CVTRV243 EQU   CVTRV237
CVTRV242 EQU   CVTRV237
CVTRV241 EQU   CVTRV237
CVTRV240 EQU   CVTRV237
CVTRV239 EQU   CVTRV237
CVTRV238 EQU   CVTRV237
CVTRV236 EQU   CVTRV228
CVTRV235 EQU   CVTRV228
CVTRV234 EQU   CVTRV228
CVTRV233 EQU   CVTRV228
CVTRV232 EQU   CVTRV228
CVTRV231 EQU   CVTRV228
CVTRV230 EQU   CVTRV228
CVTRV229 EQU   CVTRV228
CVTRV227 EQU   CVTRV219
CVTRV226 EQU   CVTRV219
CVTRV225 EQU   CVTRV219
CVTRV224 EQU   CVTRV219
CVTRV223 EQU   CVTRV219
CVTRV222 EQU   CVTRV219
CVTRV221 EQU   CVTRV219
CVTRV220 EQU   CVTRV219
CVTRV218 EQU   CVTRV210
CVTRV217 EQU   CVTRV210
CVTRV216 EQU   CVTRV210
CVTRV215 EQU   CVTRV210
CVTRV214 EQU   CVTRV210
CVTRV213 EQU   CVTRV210
CVTRV212 EQU   CVTRV210
CVTRV211 EQU   CVTRV210
CVTLCCAT EQU   CVTS01+420
CVTPCCAT EQU   CVTS01+416
CVTIPCRP EQU   CVTS01+412
CVTIPCRI EQU   CVTS01+408
CVTIPCDS EQU   CVTS01+404
CVTAIDVT EQU   CVTS01+400
CVTSSAP  EQU   CVTS01+396
CVTEHCIR EQU   CVTS01+392
CVTEHDEF EQU   CVTS01+388
CVTDAIR  EQU   CVTS01+384
CVTPERFM EQU   CVTS01+380
CVT044R2 EQU   CVTS01+376
CVTFETCH EQU   CVTS01+372
CVTRSTWD EQU   CVTS01+368
CVTSPOST EQU   CVTS01+364
CVTIOBP  EQU   CVTS01+360
CVTASMVT EQU   CVTS01+356
CVTRECRQ EQU   CVTS01+352
CVTWSAC  EQU   CVTS01+348
CVTRV149 EQU   CVTS01+344
CVTWSAL  EQU   CVTS01+340
CVTSPSA  EQU   CVTS01+336
CVTGLMN  EQU   CVTS01+332
CVTVEAC0 EQU   CVTS01+328
CVT062R1 EQU   CVTS01+324
CVTRPOST EQU   CVTS01+320
CVTDQIQE EQU   CVTS01+316
CVTCSD   EQU   CVTS01+312
CVTLKRMA EQU   CVTS01+308
CVTRSPIE EQU   CVTS01+304
CVTRENQ  EQU   CVTS01+300
CVTLQCB  EQU   CVTS01+296
CVTFQCB  EQU   CVTS01+292
CVTQCS01 EQU   CVTS01+288
CVTAPFT  EQU   CVTS01+284
CVTPARRL EQU   CVTS01+280
CVTVWAIT EQU   CVTS01+276
CVTGSPL  EQU   CVTS01+272
CVTLSMQ  EQU   CVTS01+268
CVTGSMQ  EQU   CVTS01+264
CVTEXPRO EQU   CVTS01+260
CVTOPCTP EQU   CVTS01+256
CVTSIC   EQU   CVTS01+252
CVTTPIOS EQU   CVTS01+248
CVTRTMS  EQU   CVTS01+244
CVTSDBF  EQU   CVTS01+240
CVTSCBP  EQU   CVTS01+236
CVTSDMP  EQU   CVTS01+232
CVTSV60  EQU   CVTS01+228
CVTRTMCT EQU   CVTS01+224
CVTASCBL EQU   CVTS01+220
CVTASCBH EQU   CVTS01+216
CVTGDA   EQU   CVTS01+212
CVTASVT  EQU   CVTS01+208
CVTVVMDI EQU   CVTS01+204
CVTAQTOP EQU   CVTS01+200
CVTIOSCS EQU   CVTS01+196
CVTSDRM  EQU   CVTS01+192
CVTOPTE  EQU   CVTS01+188
CVTSTXU  EQU   CVTS01+184
CVTQUIS  EQU   CVTS01+180
CVTPARS  EQU   CVTS01+176
CVTS1EE  EQU   CVTS01+172
CVTFRAS  EQU   CVTS01+168
CVTQSAS  EQU   CVTS01+164
CVTCRAS  EQU   CVTS01+160
CVTCRMN  EQU   CVTS01+156
CVTDELCP EQU   CVTS01+152
CVTFRECL EQU   CVTS01+148
CVTGETCL EQU   CVTS01+144
CVTBLDCP EQU   CVTS01+140
CVTAUTHL EQU   CVTS01+136
CVTRV144 EQU   CVTS01+130
CVTMAXMP EQU   CVTS01+128
CVTSTCK  EQU   CVTS01+124
CVTRV139 EQU   CVTS01+123
CVTDSSAC EQU   CVTS01+122
CVTRV513 EQU   CVTS01+121
CVTIOSPL EQU   CVTS01+120
CVTPTGT  EQU   CVTS01+116
CVTCSPIE EQU   CVTS01+112
CVTSMFEX EQU   CVTS01+108
CVTOLT0A EQU   CVTS01+104
CVTSRBRT EQU   CVTS01+100
CVTPUTL  EQU   CVTS01+96
CVTRV519 EQU   CVTS01+92
CVTRV327 EQU   CVTS01+88
CVTRV326 EQU   CVTS01+84
CVTRV325 EQU   CVTS01+80
CVTRV324 EQU   CVTS01+76
CVT0VL01 EQU   CVTS01+72
CVTSHRVM EQU   CVTS01+68
CVTRV332 EQU   CVTS01+64
CVTTAS   EQU   CVTS01+60
CVTRSCN  EQU   CVTS01+56
CVTTRAC2 EQU   CVTS01+54
CVTTRACE EQU   CVTS01+52
CVTAPG   EQU   CVTS01+51
CVTSDTRC EQU   CVTCTLFG
CVTGTRCE EQU   CVTCTLFG
CVTNOMP  EQU   CVTCTLFG
CVTRSV79 EQU   CVTCTLFG
CVTDSTAT EQU   CVTCTLFG
CVTRSV78 EQU   CVTCTLFG
CVTRV333 EQU   CVTCTLFG
CVTRV323 EQU   CVTCTLFG
CVTSPVLK EQU   CVTS01+49
CVTRSV77 EQU   CVTS01+48
CVTRV331 EQU   CVTS01+44
CVTRV330 EQU   CVTS01+40
CVTRV329 EQU   CVTS01+36
CVTRV328 EQU   CVTS01+32
CVTRV322 EQU   CVTS01+28
CVTSLID  EQU   CVTSLIDA+1
CVTSYLK  EQU   CVTSLIDA
CVTRV321 EQU   CVTS01+20
CVTRV320 EQU   CVTS01+16
CVTLPDIR EQU   CVTLPDIA+1
CVTRSV69 EQU   CVTDIRST
CVTRSV68 EQU   CVTDIRST
CVTRSV67 EQU   CVTDIRST
CVTRSV66 EQU   CVTDIRST
CVTRSV65 EQU   CVTDIRST
CVTRSV64 EQU   CVTDIRST
CVTRSV63 EQU   CVTDIRST
CVTDICOM EQU   CVTDIRST
CVTPVTP  EQU   CVTS01+8
CVTLPDSR EQU   CVTS01+4
CVTGETL  EQU   CVTS01
CVTLEVL  EQU   CVTRELNO+2
CVTNUMB  EQU   CVTRELNO
CVTMDL   EQU   CVTFIX+250
@NM00017 EQU   CVTFIX+248
@NM00016 EQU   CVTFIX
CVTRV482 EQU   CVTXTNT2+128
CVTRV481 EQU   CVTXTNT2+124
CVTRV480 EQU   CVTXTNT2+120
CVTRV479 EQU   CVTXTNT2+118
CVTRV478 EQU   CVTXTNT2+117
CVTRV477 EQU   CVTXTNT2+116
CVTRV476 EQU   CVTXTNT2+115
CVTRV475 EQU   CVTXTNT2+114
CVTRV474 EQU   CVTRV466
CVTRV473 EQU   CVTRV466
CVTRV472 EQU   CVTRV466
CVTRV471 EQU   CVTRV466
CVTRV470 EQU   CVTRV466
CVTRV469 EQU   CVTRV466
CVTRV468 EQU   CVTRV466
CVTRV467 EQU   CVTRV466
CVTRV465 EQU   CVTRV457
CVTRV464 EQU   CVTRV457
CVTRV463 EQU   CVTRV457
CVTRV462 EQU   CVTRV457
CVTRV461 EQU   CVTRV457
CVTRV460 EQU   CVTRV457
CVTRV459 EQU   CVTRV457
CVTRV458 EQU   CVTRV457
CVTRV456 EQU   CVTXTNT2+108
CVTRV455 EQU   CVTXTNT2+104
CVTRV454 EQU   CVTXTNT2+100
CVTRV453 EQU   CVTXTNT2+96
CVTRV452 EQU   CVTXTNT2+94
CVTRV451 EQU   CVTXTNT2+92
CVTRV450 EQU   CVTXTNT2+90
CVTRV449 EQU   CVTXTNT2+88
CVTRV448 EQU   CVTXTNT2+87
CVTRV447 EQU   CVTXTNT2+86
CVTRV446 EQU   CVTRV438
CVTRV445 EQU   CVTRV438
CVTRV444 EQU   CVTRV438
CVTRV443 EQU   CVTRV438
CVTRV442 EQU   CVTRV438
CVTRV441 EQU   CVTRV438
CVTRV440 EQU   CVTRV438
CVTRV439 EQU   CVTRV438
CVTRV437 EQU   CVTRV429
CVTRV436 EQU   CVTRV429
CVTRV435 EQU   CVTRV429
CVTRV434 EQU   CVTRV429
CVTRV433 EQU   CVTRV429
CVTRV432 EQU   CVTRV429
CVTRV431 EQU   CVTRV429
CVTRV430 EQU   CVTRV429
CVTRV428 EQU   CVTXTNT2+80
CVTRV427 EQU   CVTXTNT2+76
CVTRV426 EQU   CVTXTNT2+72
CVTRV425 EQU   CVTXTNT2+68
CVTATACT EQU   CVTATCVT
CVTRV423 EQU   CVTXTNT2+62
CVTRV422 EQU   CVTXTNT2+60
CVTRV421 EQU   CVTXTNT2+58
CVTRV420 EQU   CVTXTNT2+56
CVTRV419 EQU   CVTXTNT2+55
CVTRV418 EQU   CVTXTNT2+54
CVTRV417 EQU   CVTRV409
CVTRV416 EQU   CVTRV409
CVTRV415 EQU   CVTRV409
CVTRV414 EQU   CVTRV409
CVTRV413 EQU   CVTRV409
CVTRV412 EQU   CVTRV409
CVTRV411 EQU   CVTRV409
CVTRV410 EQU   CVTRV409
CVTRV408 EQU   CVTRV400
CVTRV407 EQU   CVTRV400
CVTRV406 EQU   CVTRV400
CVTRV405 EQU   CVTRV400
CVTRV404 EQU   CVTRV400
CVTRV403 EQU   CVTRV400
CVTRV402 EQU   CVTRV400
CVTRV401 EQU   CVTRV400
CVTICB   EQU   CVTXTNT2+48
CVTSKTA  EQU   CVTXTNT2+44
CVTRSV99 EQU   CVTXTNT2+40
CVTRSV98 EQU   CVTXTNT2+36
CVTRSV97 EQU   CVTXTNT2+34
CVTRSV96 EQU   CVTXTNT2+32
CVTOLTEP EQU   CVTXTNT2+28
CVTQIDA  EQU   CVTQID+1
CVTRSV95 EQU   CVTQID
CVTRSV94 EQU   CVTXTNT2+20
CVTRSV93 EQU   CVTXTNT2+16
CVTRSV92 EQU   CVTXTNT2+12
CVTDEBVR EQU   CVTXTNT2+8
CVTRSV91 EQU   CVTXTNT2+6
CVTRSV9H EQU   CVTFLGBT
CVTRSV9G EQU   CVTFLGBT
CVTRSV9F EQU   CVTFLGBT
CVTRSV9E EQU   CVTFLGBT
CVTRSV9D EQU   CVTFLGBT
CVTRSV9C EQU   CVTFLGBT
CVTVME   EQU   CVTFLGBT
CVTNPE   EQU   CVTFLGBT
CVTNUCLS EQU   CVTXTNT2+4
CVTDSSVA EQU   CVTDSSV+1
CVTRSV89 EQU   CVTDSSV
CVTRSV88 EQU   CVTXTNT1+8
CVTRSV87 EQU   CVTXTNT1+4
CVTFACHN EQU   CVTXTNT1
CVTRV488 EQU   CVTMAP+412
CVTRV487 EQU   CVTMAP+408
CVTRV486 EQU   CVTMAP+404
CVTRV485 EQU   CVTMAP+400
CVTACTAP EQU   CVTMAP+396
CVTAUTH  EQU   CVTMAP+392
CVTATMCA EQU   CVTATMCT+1
CVTATMST EQU   CVTATMCT
CVTRSV61 EQU   CVTMAP+384
CVTVOLT1 EQU   CVTVOLM1+1
CVTVOLI1 EQU   CVTVOLF1
CVTSTOA  EQU   CVTMAP+376
CVTRSV58 EQU   CVTMAP+374
CVTRSV57 EQU   CVTMAP+372
CVTDDCE  EQU   CVTMAP+368
CVTPNWFR EQU   CVTMAP+364
CVTSMF   EQU   CVTMAP+360
CVTSULK  EQU   CVTMAP+358
CVTSLKO  EQU   CVTSYSK
CVTSLKP  EQU   CVTSYSK
CVTSLKQ  EQU   CVTSYSK
CVTSLKR  EQU   CVTSYSK
CVTRSV56 EQU   CVTSYSK
CVTRSV55 EQU   CVTSYSK
CVTRSV54 EQU   CVTSYSK
CVTRSV53 EQU   CVTSYSK
CVTRSV52 EQU   CVTA1F1
CVTRSV51 EQU   CVTA1F1
CVTRSV50 EQU   CVTA1F1
CVTRSV49 EQU   CVTA1F1
CVTRSV48 EQU   CVTA1F1
CVTRSV47 EQU   CVTA1F1
CVTSRSW  EQU   CVTA1F1
CVTPFSW  EQU   CVTA1F1
CVTPCVT  EQU   CVTMAP+352
CVTRSV46 EQU   CVTMAP+344
CVTRSV45 EQU   CVTMAP+340
CVTRSV44 EQU   CVTMAP+338
CVTRSV43 EQU   CVTMAP+336
CVTHJESA EQU   CVTHJES+1
CVTRSV42 EQU   CVTHJES
CVTEXT2A EQU   CVTEXT2+1
CVTRSV41 EQU   CVTEXT2
CVTAPFA  EQU   CVTAPF+1
CVTRSV40 EQU   CVTAPF
CVTRV518 EQU   CVTINTLA
CVTRV517 EQU   CVTERPV
CVTEORM  EQU   CVTMAP+312
CVTMCHPR EQU   CVTMAP+308
CVTTZ    EQU   CVTMAP+304
CVTJEPS  EQU   CVTMAP+300
CVTJESCT EQU   CVTMAP+296
CVTMODE  EQU   CVTMAP+292
CVTPTRV  EQU   CVTMAP+288
CVTREAL  EQU   CVTMAP+284
CVTRSV39 EQU   CVTMAP+280
CVTRSV38 EQU   CVTMAP+276
CVTDMSRA EQU   CVTDMSR+1
CVTRSV37 EQU   CVTDMSR
CVTQMSGA EQU   CVTQMSG+1
CVTRSV36 EQU   CVTQMSG
CVTAMFF  EQU   CVTMAP+264
CVTPURGA EQU   CVTPURG+1
CVTRSV35 EQU   CVTPURG
CVTCBSP  EQU   CVTMAP+256
CVTATERA EQU   CVTATER+1
CVTSYST  EQU   CVTATER
CVTVOLT2 EQU   CVTTAT
CVTVOLI2 EQU   CVTVOLF2
CVTAQAVB EQU   CVTAQAVT+1
CVTRSV34 EQU   CVTTCMFG
CVTRSV33 EQU   CVTTCMFG
CVTRSV32 EQU   CVTTCMFG
CVTRSV31 EQU   CVTTCMFG
CVTRSV30 EQU   CVTTCMFG
CVTRSV29 EQU   CVTTCMFG
CVTRSV28 EQU   CVTTCMFG
CVTTCRDY EQU   CVTTCMFG
CVTGTFA  EQU   CVTGTF+1
CVTRSV27 EQU   CVTGTFST
CVTRNIO  EQU   CVTGTFST
CVTUSR   EQU   CVTGTFST
CVTRV318 EQU   CVTFORM
CVTRV317 EQU   CVTTMODE
CVTRV316 EQU   CVTSTATE
CVTRV315 EQU   CVTGTFS
CVTGTFAV EQU   CVTGTFS
CVT0SCR1 EQU   CVTMAP+232
CVTRV515 EQU   CVTMAP+228
CVTRMS   EQU   CVTMAP+224
CVTPATCH EQU   CVTMAP+220
CVTTSCE  EQU   CVTMAP+216
CVTLNKSC EQU   CVTMAP+214
CVTQABST EQU   CVTMAP+212
CVTMDLDS EQU   CVTMAP+208
CVTUSER  EQU   CVTMAP+204
CVTABEND EQU   CVTMAP+200
CVTSMCA  EQU   CVTMAP+196
CVTRSV18 EQU   CVTMAP+192
CVTQLPAQ EQU   CVTMAP+188
CVTQCDSR EQU   CVTMAP+184
CVTRSV17 EQU   CVTOPTB
CVTRSV16 EQU   CVTOPTB
CVTFP    EQU   CVTOPTB
CVTAPTHR EQU   CVTOPTB
CVTNLOG  EQU   CVTOPTB
CVTTOD   EQU   CVTOPTB
CVTCTIMS EQU   CVTOPTB
CVTPROT  EQU   CVTOPTB
CVTXPFP  EQU   CVTOPTA
CVTASCII EQU   CVTOPTA
CVTRSV13 EQU   CVTOPTA
CVTRSV12 EQU   CVTOPTA
CVTNIP   EQU   CVTOPTA
CVTDDR   EQU   CVTOPTA
CVTAPR   EQU   CVTOPTA
CVTCCH   EQU   CVTOPTA
CVTSNCTR EQU   CVTMAP+180
CVTQMWR  EQU   CVTMAP+176
CVTQOCR  EQU   CVTMAP+172
CVT1EF00 EQU   CVTMAP+168
CVTMZ00  EQU   CVTMAP+164
CVTHEAD  EQU   CVTMAP+160
CVTRSV11 EQU   CVTMAP+156
CVT0PT01 EQU   CVTMAP+152
CVTMSER  EQU   CVTMAP+148
CVTRV516 EQU   CVTIERLC
CVTILCH  EQU   CVTMAP+140
CVT0DS   EQU   CVTMAP+136
CVTFBOSV EQU   CVTMAP+132
CVTNUCB  EQU   CVTMAP+128
CVTIXAVL EQU   CVTMAP+124
CVTIOQET EQU   CVTMAP+120
CVTDCBA  EQU   CVTMAP+117
CVTMVS2  EQU   CVTDCB
CVT6DAT  EQU   CVTDCB
CVT4MPS  EQU   CVTDCB
CVTRSV09 EQU   CVTDCB
CVT4MS1  EQU   CVTDCB
CVT2SPS  EQU   CVTDCB
CVT1SSS  EQU   CVTDCB
CVTRSV08 EQU   CVTDCB
CVTSTB   EQU   CVTMAP+112
CVTQTD00 EQU   CVTMAP+108
CVTQTE00 EQU   CVTMAP+104
CVTCUCB  EQU   CVTMAP+100
CVTSJQ   EQU   CVTMAP+96
CVTPBLDL EQU   CVTMAP+92
CVTTPC   EQU   CVTMAP+88
CVTSVDCB EQU   CVTMAP+84
CVTBRET  EQU   CVTMAP+82
CVTEXIT  EQU   CVTMAP+80
CVT0FN00 EQU   CVTMAP+76
CVTDARA  EQU   CVTDAR+1
CVTRSV07 EQU   CVTFLGS1
CVTRSV06 EQU   CVTFLGS1
CVTRSV05 EQU   CVTFLGS1
CVTRSV04 EQU   CVTFLGS1
CVTRSV03 EQU   CVTFLGS1
CVTRSV02 EQU   CVTFLGS1
CVTRSV01 EQU   CVTFLGS1
CVTDMPLK EQU   CVTFLGS1
CVTXITP  EQU   CVTMAP+68
CVTZDTAB EQU   CVTMAP+64
CVTMSLT  EQU   CVTMAP+60
CVTDATE  EQU   CVTMAP+56
CVTBTERM EQU   CVTMAP+52
CVTSYSAD EQU   CVTMAP+48
CVTXTLER EQU   CVTMAP+44
CVTILK2  EQU   CVTMAP+40
CVTILK1  EQU   CVTMAP+36
CVTPRLTV EQU   CVTMAP+32
CVTPCNVT EQU   CVTMAP+28
CVT0VL00 EQU   CVTMAP+24
CVTXAPG  EQU   CVTMAP+20
CVTBUF   EQU   CVTMAP+16
CVTJOB   EQU   CVTMAP+12
CVTLINK  EQU   CVTMAP+8
CVT0EF00 EQU   CVTMAP+4
CVTTCBP  EQU   CVTMAP
CVT      EQU   CVTMAP
S99TUPRM EQU   S99TUFLD+2
S99TULEN EQU   S99TUFLD
S99TUPAR EQU   S99TUENT+2
S99TULNG EQU   S99TUENT
S99TUNUM EQU   S99TUNIT+2
S99TUKEY EQU   S99TUNIT
S99TUPND EQU   S99TUP
S99TUPLN EQU   S99TUPTR
S99FLG24 EQU   S99FLAG2+3
S99FLG23 EQU   S99FLAG2+2
S99PCINT EQU   S99FLG22
S99UDEVT EQU   S99FLG22
S99MOUNT EQU   S99FLG21
S99CATLG EQU   S99FLG21
S99TIONQ EQU   S99FLG21
S99OFFLN EQU   S99FLG21
S99WTUNT EQU   S99FLG21
S99NORES EQU   S99FLG21
S99WTDSN EQU   S99FLG21
S99WTVOL EQU   S99FLG21
S99RSV01 EQU   S99RB+12
S99INFO  EQU   S99RSC+2
S99FLG12 EQU   S99FLAG1+1
S99JBSYS EQU   S99FLG11
S99NOMNT EQU   S99FLG11
S99NOCNV EQU   S99FLG11
S99ONCNV EQU   S99FLG11
S99RBLN  EQU   S99RB
@NM00015 EQU   CSOA+7
@NM00014 EQU   CSOAFLG
@NM00013 EQU   CSOAFLG
CSOAEXEC EQU   CSOAFLG
CSOABAD  EQU   CSOAFLG
CSOAQM   EQU   CSOAFLG
CSOAVNP  EQU   CSOAFLG
CSOAVWP  EQU   CSOAFLG
MSGRTN   EQU   MSGTABLE+60
VAR4     EQU   MTINSRTS+13
HIGHL4   EQU   L4
VAR3     EQU   MTINSRTS+9
HIGHL3   EQU   L3
VAR2     EQU   MTINSRTS+5
HIGHL2   EQU   L2
HIGHL1   EQU   L1
@NM00010 EQU   MSGTABLE+36
@NM00009 EQU   MSGTABLE+32
MTOLDPTR EQU   MSGTABLE+28
@NM00008 EQU   MSGTABLE+25
@NM00007 EQU   SW2
MTPGMSW  EQU   SW2
MTNPLMSW EQU   SW2
MTNOXQSW EQU   SW2
MTDOMSW  EQU   SW2
MT2OLDSW EQU   SW2
MTNHEXSW EQU   SW
MTWTPSW  EQU   SW
MTJOBISW EQU   SW
MTKEY1SW EQU   SW
MTHEXSW  EQU   SW
MTWTOSW  EQU   SW
MTNOIDSW EQU   SW
CPPLPSCB EQU   CPPL+8
CPPLCBUF EQU   CPPL
DSNTERM  EQU   DSNBUF
VVGPRSV2 EQU   VVGRPDE+7
VVGPRSV1 EQU   VVGPFLG
VVGPRES  EQU   VVGPFLG
VVGPLEN  EQU   VVGRPDE+4
VOLRSV2  EQU   VOLSQPDE+7
VOLRSV1  EQU   VOLSQFLG
VOLPRES  EQU   VOLSQFLG
VOLSQLEN EQU   VOLSQPDE+4
MXVRSV2  EQU   MXVOLPDE+7
MXVRSV1  EQU   MXVOLFLG
MXVPRES  EQU   MXVOLFLG
MXVOLLEN EQU   MXVOLPDE+4
POSRSV2  EQU   POSTPDE+7
POSRSV1  EQU   POSFLAG
POSPRES  EQU   POSFLAG
POSLEN   EQU   POSTPDE+4
LABLRSV1 EQU   ALLOCPDL+178
LABELPDE EQU   ALLOCPDL+176
UCNTRSV2 EQU   UNCNTPDE+7
UCNTRSV1 EQU   UCNTFLAG
UCNTPRES EQU   UCNTFLAG
UCNTLEN  EQU   UNCNTPDE+4
UTYPRSV2 EQU   UTYPPDE+7
UTYPRSV1 EQU   UTYPFLAG
UTYPPRES EQU   UTYPFLAG
UTYPLEN  EQU   UTYPPDE+4
USIDRSV2 EQU   USIDPDE+7
USIDRSV1 EQU   USIDFLAG
USIDPRES EQU   USIDFLAG
USIDLEN  EQU   USIDPDE+4
ATTRRSV2 EQU   ATTRPDE+7
ATTRRSV1 EQU   ATTRFLAG
ATTRPRES EQU   ATTRFLAG
ATTRLEN  EQU   ATTRPDE+4
DIRRSV2  EQU   DIRECPDE+7
DIRRSV1  EQU   DIRFLAGS
DIRPRES  EQU   DIRFLAGS
DIRLEN   EQU   DIRECPDE+4
SPCRSV22 EQU   SPACPDE2+7
SPCRSV12 EQU   SPACFLG2
SPCPRES2 EQU   SPACFLG2
SPACLEN2 EQU   SPACPDE2+4
SPACRSV2 EQU   SPACPDE+7
SPACRSV1 EQU   SPACEFLG
SPACPRES EQU   SPACEFLG
SPACELEN EQU   SPACPDE+4
ABLKRSV2 EQU   ABLKPDE+7
ABLKRSV1 EQU   ABLKFLG
ABLKPRES EQU   ABLKFLG
ABLKLEN  EQU   ABLKPDE+4
BLKRSV2  EQU   BLKPDE+7
BLKRSV1  EQU   BLKFLAGS
BLKPRES  EQU   BLKFLAGS
BLKLEN   EQU   BLKPDE+4
SERNEXT  EQU   SERPDE+8
SERRSV2  EQU   SERPDE+7
SERRSV1  EQU   SERFLAGS
SERPRES  EQU   SERFLAGS
SERLEN   EQU   SERPDE+4
CLASRSV2 EQU   CLASPDE+7
CLASRSV1 EQU   CLASFLG
CLASPRES EQU   CLASFLG
CLASLEN  EQU   CLASPDE+4
DDNRSV2  EQU   DDNMEPDE+7
DDNRSV1  EQU   DDNFLAGS
DDNPRES  EQU   DDNFLAGS
DSNNEXT  EQU   DSNPDE+24
PASSRSV2 EQU   DSNPDE+23
PASSRSV1 EQU   PASSFLAG
PASSPRES EQU   PASSFLAG
PASSLEN  EQU   DSNPDE+20
MBRRSV2  EQU   DSNPDE+15
MBRRSV1  EQU   MBRFLAGS
MBRPRES  EQU   MBRFLAGS
MBRLEN   EQU   DSNPDE+12
DSNRSV2  EQU   DSNPDE+7
DSNRSV1  EQU   DSNFLAGS
DSNQUOT  EQU   DSNFLAGS
DSNPRES  EQU   DSNFLAGS
DSNLENGH EQU   DSNPDE+4
DISPPDE  EQU   ALLOCPDL+46
RNDPDE   EQU   ALLOCPDL+44
RLSEPDE  EQU   ALLOCPDL+42
VSEQPDE  EQU   ALLOCPDL+40
PRIVPDE  EQU   ALLOCPDL+38
MAXVPDE  EQU   ALLOCPDL+36
POSPDE   EQU   ALLOCPDL+34
LABLPDE  EQU   ALLOCPDL+32
UCNTPDE  EQU   ALLOCPDL+30
UNITPDE  EQU   ALLOCPDL+28
HOLDPDE  EQU   ALLOCPDL+26
DESTPDE  EQU   ALLOCPDL+24
USINGPDE EQU   ALLOCPDL+22
DIRPDE   EQU   ALLOCPDL+20
SPACEPDE EQU   ALLOCPDL+18
BLOKPDE  EQU   ALLOCPDL+16
VOLPDE   EQU   ALLOCPDL+14
STATSPDE EQU   ALLOCPDL+12
FILEPDE  EQU   ALLOCPDL+10
DSPDE    EQU   ALLOCPDL+8
@NM00005 EQU   ALLOCPDL+4
@NM00004 EQU   ALLOCPDL
FIRSTPTR EQU   ALLOCWA+176
PPLPTR   EQU   ALLOCWA+172
NBLKBUF1 EQU   ALLOCWA+164
PDLADDR3 EQU   ALLOCWA+156
PPLTWO   EQU   ALLOCWA+128
CMDTWOBF EQU   CMDTWO+4
CMDTWOOF EQU   CMDTWO+2
CMDTWOLN EQU   CMDTWO
Q        EQU   ALLOCWA+56
P        EQU   ALLOCWA+52
PRCODE   EQU   ALLOCWA+44
PMPTPDL  EQU   ALLOCWA+40
@NM00003 EQU   ALLOCWA+38
NCLASBUF EQU   ALLOCWA+37
@NM00002 EQU   VCFLAGS
SPACE2   EQU   VCFLAGS
SPACE1   EQU   VCFLAGS
AVBLK    EQU   VCFLAGS
DSNCTR   EQU   ALLOCWA+30
VLISTCTR EQU   ALLOCWA+28
TXT      EQU   ALLOCWA+16
AWARSV2  EQU   ALLOCWA+13
FIRSTPDE EQU   SWITCH
AWARSV1  EQU   SWITCH
ASTRSK   EQU   SWITCH
CONT     EQU   SWITCH
PROMPT   EQU   SWITCH
DSOVRLAY EQU   SWITCH
GTPLPTR  EQU   ALLOCWA+8
*                                      END UNREFERENCED COMPONENTS
@RC00082 EQU   @EL00001
@RT00132 EQU   INVRSP
@RT00136 EQU   INVRSP
@RC00089 EQU   @EL00002
@RC00119 EQU   @EL00002
@RC00138 EQU   @EL00002
@RC00134 EQU   @EL00002
@RC00156 EQU   @EL00002
@RC00187 EQU   @EL00003
@RF00193 EQU   @RC00187
@EL01    EQU   @EL00001
@ENDDATA EQU   *
         END   IKJEFD36,(C'PLS0315',0603,74204)
