         TITLE 'ISTZRM01-FRR FOR TPIOS/IOS INTERFACE'
ISTZRM01 CSECT ,                                                   0001
@MAINENT DS    0H                                                  0001
         USING *,@15                                               0001
         B     @PROLOG                                             0001
         DC    AL1(16)                                             0001
         DC    C'ISTZRM01  78.336'                                 0001
         DROP  @15
@PROLOG  BALR  @12,0                                               0001
@PSTART  DS    0H                                                  0001
         USING @PSTART,@12                                         0001
         PRINT OFF
         PRINT ON
         PRINT OFF
         PRINT ON
*                                                                  0280
*/* END OF ATBUILD                                                   */
*                                                                  0280
*                                                                  0280
*   /*****************************************************************/
*   /*                                                               */
*   /* REGISTER DECLARES                                             */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0280
*   DO;                             /* ISTREG (0,1,2,3,4,5,6,7,8,9,10
*                                      ,11,12,13,14,15)              */
*   END;                            /* ISTREG                        */
*   RFY                                                            0282
*    (GPR00P,                                                      0282
*     GPR01P,                                                      0282
*     GPR04P,                                                      0282
*     GPR05P,                                                      0282
*     GPR06P,                                                      0282
*     GPR07P,                                                      0282
*     GPR09P,                                                      0282
*     GPR10P,                                                      0282
*     GPR12P,                                                      0282
*     GPR13P,                                                      0282
*     GPR14P,                                                      0282
*     GPR15P,                                                      0282
*     GPR07F) RSTD;                                                0282
*   DCL                                                            0283
*     SDWAPTR REG(10) PTR(31) RSTD;                                0283
*   DCL                                                            0284
*     WKAREAPT REG(9) PTR(31) RSTD;                                0284
*   DCL                                                            0285
*     UCBPTR REG(5) PTR(31) RSTD;                                  0285
*   DCL                                                            0286
*     ICNCBPTR REG(4) PTR(31) RSTD;                                0286
*   DCL                                                            0287
*     LDNCBPTR REG(4) PTR(31) RSTD;                                0287
*   DCL                                                            0288
*     OLD REG(7) PTR(31) RSTD;                                     0288
*   DCL                                                            0289
*     NEW REG(6) PTR(31) RSTD;                                     0289
*   DCL                                                            0290
*     BUFPTR REG(8) PTR(31);                                       0290
*   DCL                                                            0291
*     BASEREG REG(12) PTR(31) RSTD;                                0291
*   DCL                                                            0292
*     RTNREG REG(14) PTR(31) RSTD;                                 0292
*                                                                  0292
*   /*****************************************************************/
*   /*                                                               */
*   /* VARIABLE DECLARES                                             */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0293
*   DCL                                                            0293
*     FRRID CHAR(8) CONSTANT('ISTZRM01');                          0293
*   DCL                                                            0294
*     ON BIT(1) CONSTANT('1'B);                                    0294
*   DCL                                                            0295
*     OFF BIT(1) CONSTANT('0'B);                                   0295
*   DCL                                                            0296
*     HION BIT(32) CONSTANT('80000000'X);                          0296
*   DCL                                                            0297
*     HIOFF BIT(32) CONSTANT('7FFFFFFF'X);                         0297
*   DCL                                                            0298
*     CVTPTR PTR(31) LOCATION(16);                                 0298
*   DCL                                                            0299
*     FRRSPTR PTR(31) CONSTANT(0);                                 0299
*   DCL                                                            0300
*     FRREPTR PTR(31) CONSTANT(0);                                 0300
*   DCL                                                            0301
*     IOBPRPTR PTR(31) CONSTANT(0);                                0301
*   DCL                                                            0302
*     IOBSTPTR PTR(31) CONSTANT(0);                                0302
*   DCL                                                            0303
*     SRBPTR PTR(31) CONSTANT(0);                                  0303
*   DCL                                                            0304
*     IOSBPTR PTR(31) CONSTANT(0);                                 0304
*                                                                  0304
*   /*****************************************************************/
*   /*                                                               */
*   /* FRR PARMAREA                                                  */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0305
*   DCL                                                            0305
*     1 PARMLIST CHAR(24) BDY(WORD) BASED,                         0305
*      2 DWORD0 CHAR(8) BDY(WORD),                                 0305
*       3 WORD0 PTR(31),                                           0305
*       3 WORD1 PTR(31);            /*                       @ZM31967*/
*                                                                  0305
*   /*****************************************************************/
*   /*                                                               */
*   /* SDUMP LIST FORM                                               */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0306
*   GEN DATA DEFS(DUMPLIST);                                       0306
*   DCL                                                            0307
*     DUMPLIST CHAR(24) GEND STATIC LOCAL;                         0307
*                                                                  0307
*   /*****************************************************************/
*   /*                                                               */
*   /* SQA DUMP BUFFER AS USED FOR 370X                              */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0308
*   DCL                                                            0308
*     1 BUF370X BDY(WORD) BASED,                                   0308
*      2 B370XF1A PTR(31),                                         0308
*      2 B370XF1L FIXED(15),                                       0308
*      2 B370XF1R CHAR(2),                                         0308
*      2 B370XUCB CHAR(LENGTH(UCB)),                               0308
*      2 B370XUOB CHAR(LENGTH(UCBOB)),                             0308
*      2 B370XU07 CHAR(LENGTH(UCBOBS07)),                          0308
*      2 B370XF2A PTR(31),                                         0308
*      2 B370XF2L FIXED(15),                                       0308
*      2 B370XF2R CHAR(2),                                         0308
*      2 B370XICN CHAR(LENGTH(ISTICNCB)),                          0308
*      2 B370XF3A PTR(31),                                         0308
*      2 B370XF3L FIXED(15),                                       0308
*      2 B370XF3R CHAR(2);                                         0308
*                                                                  0308
*   /*****************************************************************/
*   /*                                                               */
*   /* SQA DUMP BUFFER AS USED FOR 3270                              */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0309
*   DCL                                                            0309
*     1 BUF3270 BDY(WORD) BASED,                                   0309
*      2 B3270F1A PTR(31),                                         0309
*      2 B3270F1L FIXED(15),                                       0309
*      2 B3270F1R CHAR(2),                                         0309
*      2 B3270UCB CHAR(LENGTH(UCB)),                               0309
*      2 B3270UOB CHAR(LENGTH(UCBOB)),                             0309
*      2 B3270U06 CHAR(LENGTH(UCBOBS06)),                          0309
*      2 B3270F2A PTR(31),                                         0309
*      2 B3270F2L FIXED(15),                                       0309
*      2 B3270F2R CHAR(2),                                         0309
*      2 B3270LDN CHAR(LENGTH(ISTLDNCB)),                          0309
*      2 B3270F3A PTR(31),                                         0309
*      2 B3270F3L FIXED(15),                                       0309
*      2 B3270F3R CHAR(2);                                         0309
*                                                                  0309
*   /*****************************************************************/
*   /*                                                               */
*   /* WORK AREA POINTED TO BY REG 0 AT ENTRY                        */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0310
*   DCL                                                            0310
*     1 WKAREA CHAR(200) BDY(WORD) BASED,                          0310
*       3 FRR69PRM PTR(31),                                        0310
*       3 REG14SV PTR(31),                                         0310
*       3 SDMPAREA CHAR(24);                                       0310
*                                                                  0310
*   /*****************************************************************/
*   /*                                                               */
*   /* RESPECIFIES FOR CONTROL BLOCKS                                */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0311
*   RFY                                                            0311
*     SDWA BASED(SDWAPTR);                                         0311
*   RFY                                                            0312
*     WKAREA BASED(WKAREAPT);                                      0312
*   RFY                                                            0313
*     ISTICNCB BASED(ICNCBPTR);                                    0313
*   RFY                                                            0314
*     ISTLDNCB BASED(LDNCBPTR);                                    0314
*   RFY                                                            0315
*     BUF370X BASED(BUFPTR);                                       0315
*   RFY                                                            0316
*     BUF3270 BASED(BUFPTR);                                       0316
*                                                                  0316
*   /*****************************************************************/
*   /*                                                               */
*   /* START OF CODE                                                 */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0317
*   WKAREAPT=GPR00P;                /* WORK AREA PTR PASSED TO     0317
*                                      ISTZRM01                      */
         LR    WKAREAPT,GPR00P                                     0317
*   SDWAPTR=GPR01P;                 /* SDWA(RTCA) WORK AREA          */
         LR    SDWAPTR,GPR01P                                      0318
*   REG14SV=RTNREG;                 /* SAVE RETURN ADDR              */
         ST    RTNREG,REG14SV(,WKAREAPT)                           0319
*   DO;                             /* LISATCVT                    0320
*                                      CVTBASE(PAGEABLE,(GPR15P))    */
*     GPR15P=ATCLCPTR;              /* SET UP ATCVT POINTER          */
         L     GPR15P,ATCLCPTR                                     0321
*   END;                            /* LISATCVT GET ATCVT ADDR       */
*   RFY                                                            0323
*     PARMLIST BASED(FRR69PRM);                                    0323
*   GPR15P=GPR15P->ATCAP69;         /* GET ADDR OF FRR ROUTINE -   0324
*                                      ISTAPM69                      */
         L     GPR15P,ATCAP69(,GPR15P)                             0324
*   GEN REFS(GPR15P,GPR06P,GPR07P,PSACSTK,PSA,FRRSPARM,FRRS,FRRSLAST,
*       PSALSFCC,FRRSELEN,FRRSCURR,FRRSENTR) SETS(FRR69PRM,GPR06P, 0325
*       GPR07P,FRRSCURR,FRRSFRRA,FRRSPARM);                        0325
         SETFRR A,FRRAD=(GPR15P),PARMAD=(GPR07P),                      *
               WRKREGS=(GPR06P,GPR07P) ADD ISTAPM69 TO FRR STACK
*   FRR69PRM=GPR07P;                                               0326
         ST    GPR07P,FRR69PRM(,WKAREAPT)                          0326
*   DWORD0=FRRID;                   /* STORE ID OF THIS FRR IN     0327
*                                      ISTAPM69 FRR PARM AREA        */
         L     @11,FRR69PRM(,WKAREAPT)                             0327
         MVC   DWORD0(8,@11),@CC03620                              0327
*   RFY                                                            0328
*     PARMLIST BASED(SDWAPARM);                                    0328
*   IF WORD0>0 THEN                 /* IS UCB LOCKWORD STORED        */
         L     @11,SDWAPARM(,SDWAPTR)                              0329
         L     @11,WORD0(,@11)                                     0329
         LTR   @11,@11                                             0329
         BNP   @RF00329                                            0329
*     DO;                           /* YES                           */
*       RFY                                                        0331
*         UCB BASED(0);                                            0331
*       UCBPTR=WORD0-(ADDR(UCBLOCK)-ADDR(UCB))+LENGTH(UCB);/* GET PTR
*                                      TO BASIC UCB                  */
         AL    @11,@CF00065                                        0332
         LR    UCBPTR,@11                                          0332
*       RFY                                                        0333
*         UCB;                                                     0333
*       IF UCB3COMM=ON THEN         /* IF COMMUNICATIONS DEVICE CLASS*/
         TM    UCB3COMM(UCBPTR),B'01000000'                        0334
         BNO   @RF00334                                            0334
*         DO;                       /* DEVICE IS A 370X              */
*           ICNCBPTR=UCBICNCB;      /* GET ICNCB PTR                 */
         L     ICNCBPTR,UCBICNCB(,UCBPTR)                          0336
*         END;                                                     0337
*       ELSE                                                       0338
*         DO;                       /* DEVICE IS A LOCAL 3270        */
         B     @RC00334                                            0338
@RF00334 DS    0H                                                  0339
*           LDNCBPTR=UCBLDNCB;      /* GET LDNCB PTR                 */
         L     LDNCBPTR,UCBLDNCB-1(,UCBPTR)                        0339
         LA    LDNCBPTR,0(,LDNCBPTR)                               0339
*         END;                                                     0340
*     END;                                                         0341
@RC00334 DS    0H                                                  0342
*   IF SDWAFMID^='0000'X THEN                                      0342
@RF00329 CLC   SDWAFMID(2,SDWAPTR),@CB03676                        0342
         BNE   @RT00342                                            0342
*     GO TO ZR010200;               /* IF CURRENT ADDRESS SPACE IS 0343
*                                      NOT THE ONE THAT ABENDED, SKIP
*                                      SDUMP. IT WILL BE DONE BY   0343
*                                      MEMORY TERM MODULE            */
*   OLD=CVTPTR->CVTSDBF;            /* GET PTR TO 4K SDMP BUFFER IN
*                                      SQA                           */
         L     @11,CVTPTR                                          0344
         L     OLD,CVTSDBF(,@11)                                   0344
*   OLD=OLD&HIOFF;                  /* TURN OFF HI ORDER LOCK BIT IN
*                                      OLD REG FOR CS                */
         N     OLD,@CF02355                                        0345
*   NEW=OLD×HION;                   /* TURN ON HI ORDER LOCK BIT IN
*                                      NEW REG FOR CS                */
         LR    NEW,OLD                                             0346
         O     NEW,@CF02357                                        0346
*   CS(OLD,NEW,CVTPTR->CVTSDBF);    /* ATTEMPT TO ACQUIRE/LOCK BUFFER*/
         L     @11,CVTPTR                                          0347
         CS    OLD,@06,CVTSDBF(@11)                                0347
*   BC(4,ZR010200);                 /* BUFFER WAS LOCKED ALREADY,  0348
*                                      SKIP SDUMP                    */
         BC    4,ZR010200                                          0348
*   RFY                                                            0349
*    (BUFPTR) RSTD;                                                0349
*   BUFPTR=OLD;                     /* INIT BUFFER PTR REG           */
         LR    BUFPTR,OLD                                          0350
*   IF WORD0>0 THEN                 /* IS UCB LOCKWORD STORED        */
         L     @11,SDWAPARM(,SDWAPTR)                              0351
         L     @11,WORD0(,@11)                                     0351
         LTR   @11,@11                                             0351
         BNP   @RF00351                                            0351
*     DO;                           /* YES                           */
*       RFY                                                        0353
*        (GPR02P,                                                  0353
*         GPR03F) RSTD;                                            0353
*       IF UCB3COMM=ON THEN         /* IF COMMUNICATIONS DEVICE CLASS*/
         TM    UCB3COMM(UCBPTR),B'01000000'                        0354
         BNO   @RF00354                                            0354
*         DO;                       /* DEVICE IS A 370X, INITIALIZE
*                                      SQA BUFFER                    */
*           GPR02P=LENGTH(UCB);                                    0356
         LA    @11,512                                             0356
         LR    GPR02P,@11                                          0356
*           B370XF1A=UCBPTR-GPR02P; /* ADDR OF UCB PREFIX            */
         LR    @11,UCBPTR                                          0357
         SLR   @11,GPR02P                                          0357
         ST    @11,B370XF1A(,BUFPTR)                               0357
*           B370XF1L=LENGTH(UCB)+LENGTH(UCBOB)+LENGTH(UCBOBS07);/* 0358
*                                      LENGTH OF UCB (PREFIX + COMMON
*                                      SECTION + DEVICE DEPENDENT  0358
*                                      SECTION)                      */
         MVC   B370XF1L(2,BUFPTR),@CH03701                         0358
*           B370XF1R='0000'X;                                      0359
         MVC   B370XF1R(2,BUFPTR),@CB03676                         0359
*           GPR02P=ADDR(B370XUCB);                                 0360
         LA    GPR02P,B370XUCB(,BUFPTR)                            0360
*           GPR03F=LENGTH(B370XUCB);                               0361
         LA    @11,512                                             0361
         LR    GPR03F,@11                                          0361
*           GPR06P=ADDR(UCB);       /* ADDR UCB PREFIX               */
         LR    GPR06P,UCBPTR                                       0362
         SLR   GPR06P,@11                                          0362
*           GPR07F=LENGTH(UCB);     /* LENGTH UCB PREFIX             */
         LR    GPR07F,@11                                          0363
*           MVCL(GPR02P,GPR06P);    /* MOVE UCB PREFIX TO SQA BUFFER */
         MVCL  GPR02P,GPR06P                                       0364
*           B370XUOB=UCBOB;         /* MOVE UCB COMMON SECTION TO SQA
*                                      BUFFER                        */
         MVC   B370XUOB(24,BUFPTR),UCBOB(UCBPTR)                   0365
*           B370XU07=UCBOBS07;      /* MOVE UCB DEVICE DEPENDENT   0366
*                                      SECTION TO SQA BUF            */
         MVC   B370XU07(8,BUFPTR),UCBOBS07(UCBPTR)                 0366
*           B370XF2A=ADDR(ISTICNCB);/* ADDR ICNCB                    */
         ST    ICNCBPTR,B370XF2A(,BUFPTR)                          0367
*           B370XF2L=LENGTH(ISTICNCB);/* LENGTH                      */
         LA    @11,464                                             0368
         STH   @11,B370XF2L(,BUFPTR)                               0368
*           B370XF2R='0000'X;                                      0369
         MVC   B370XF2R(2,BUFPTR),@CB03676                         0369
*           GPR02P=ADDR(B370XICN);                                 0370
         LA    GPR02P,B370XICN(,BUFPTR)                            0370
*           GPR03F=LENGTH(B370XICN);                               0371
         LR    GPR03F,@11                                          0371
*           GPR06P=ADDR(ISTICNCB);  /* ADDR ICNCB                    */
         LR    GPR06P,ICNCBPTR                                     0372
*           GPR07F=LENGTH(ISTICNCB);/* LENGTH ICNCB                  */
         LR    GPR07F,@11                                          0373
*           MVCL(GPR02P,GPR06P);    /* MOVE ICNCB TO SQA BUFFER      */
         MVCL  GPR02P,GPR06P                                       0374
*           B370XF3A=0;             /* FINISH OFF USE OF SQA BUFFER  */
         SLR   @11,@11                                             0375
         ST    @11,B370XF3A(,BUFPTR)                               0375
*           B370XF3L=0;                                            0376
         STH   @11,B370XF3L(,BUFPTR)                               0376
*           B370XF3R='0000'X;                                      0377
         MVC   B370XF3R(2,BUFPTR),@CB03676                         0377
*         END;                                                     0378
*       ELSE                                                       0379
*         DO;                       /* DEVICE IS LOCAL 3270,       0379
*                                      INITIALIZE SQA BUFFER         */
         B     @RC00354                                            0379
@RF00354 DS    0H                                                  0380
*           GPR02P=LENGTH(UCB);                                    0380
         LA    @11,512                                             0380
         LR    GPR02P,@11                                          0380
*           B3270F1A=UCBPTR-GPR02P; /* ADDR OF UCB PREFIX            */
         LR    @11,UCBPTR                                          0381
         SLR   @11,GPR02P                                          0381
         ST    @11,B3270F1A(,BUFPTR)                               0381
*           B3270F1L=LENGTH(UCB)+LENGTH(UCBOB)+LENGTH(UCBOBS06);/* 0382
*                                      LENGTH OF UCB (PREFIX + COMMON
*                                      SECTION + DEVICE DEPENDENT  0382
*                                      SECTION)                      */
         MVC   B3270F1L(2,BUFPTR),@CH03703                         0382
*           B3270F1R='0000'X;                                      0383
         MVC   B3270F1R(2,BUFPTR),@CB03676                         0383
*           GPR02P=ADDR(B3270UCB);                                 0384
         LA    GPR02P,B3270UCB(,BUFPTR)                            0384
*           GPR03F=LENGTH(B3270UCB);                               0385
         LA    @11,512                                             0385
         LR    GPR03F,@11                                          0385
*           GPR06P=ADDR(UCB);       /* ADDR UCB PREFIX               */
         LR    GPR06P,UCBPTR                                       0386
         SLR   GPR06P,@11                                          0386
*           GPR07F=LENGTH(UCB);     /* LENGTH UCB PREFIX             */
         LR    GPR07F,@11                                          0387
*           MVCL(GPR02P,GPR06P);    /* MOVE UCB PREFIX TO SQA BUFFER */
         MVCL  GPR02P,GPR06P                                       0388
*           B3270UOB=UCBOB;         /* MOVE UCB COMMON SECTION TO SQA
*                                      BUFFER                        */
         MVC   B3270UOB(24,BUFPTR),UCBOB(UCBPTR)                   0389
*           B3270U06=UCBOBS06;      /* MOVE UCB DEVICE DEPENDENT   0390
*                                      SECTION TO SQA BUF            */
         MVC   B3270U06(16,BUFPTR),UCBOBS06(UCBPTR)                0390
*           B3270F2A=ADDR(ISTLDNCB);/* ADDR LDNCB                    */
         ST    LDNCBPTR,B3270F2A(,BUFPTR)                          0391
*           B3270F2L=LENGTH(ISTLDNCB);/* LENGTH LDNCB                */
         LA    @11,416                                             0392
         STH   @11,B3270F2L(,BUFPTR)                               0392
*           B3270F2R='0000'X;                                      0393
         MVC   B3270F2R(2,BUFPTR),@CB03676                         0393
*           GPR02P=ADDR(B3270LDN);                                 0394
         LA    GPR02P,B3270LDN(,BUFPTR)                            0394
*           GPR03F=LENGTH(B3270LDN);                               0395
         LR    GPR03F,@11                                          0395
*           GPR06P=ADDR(ISTLDNCB);  /* ADDR LDNCB                    */
         LR    GPR06P,LDNCBPTR                                     0396
*           GPR07F=LENGTH(ISTLDNCB);/* LENGTH LDNCB                  */
         LR    GPR07F,@11                                          0397
*           MVCL(GPR02P,GPR06P);    /* MOVE LDNCB TO SQA BUFFER      */
         MVCL  GPR02P,GPR06P                                       0398
*           B3270F3A=0;             /* FINISH OFF USE OF SQA BUFFER  */
         SLR   @11,@11                                             0399
         ST    @11,B3270F3A(,BUFPTR)                               0399
*           B3270F3L=0;                                            0400
         STH   @11,B3270F3L(,BUFPTR)                               0400
*           B3270F3R='0000'X;                                      0401
         MVC   B3270F3R(2,BUFPTR),@CB03676                         0401
*         END;                                                     0402
*       RFY                                                        0403
*        (GPR02P,                                                  0403
*         GPR03F) UNRSTD;                                          0403
@RC00354 DS    0H                                                  0404
*     END;                                                         0404
*   ELSE                                                           0405
*     DO;                           /* IF UCB LOCKWORD WAS NOT STORED
*                                      IN FRR PARM AREA              */
         B     @RC00351                                            0405
@RF00351 DS    0H                                                  0406
*       B370XF1A=0;                 /* INDUCATE SQA BUFFER IS EMPTY  */
         SLR   @11,@11                                             0406
         ST    @11,B370XF1A(,BUFPTR)                               0406
*       B370XF1L=0;                                                0407
         STH   @11,B370XF1L(,BUFPTR)                               0407
*       B370XF1R='0000'X;                                          0408
         MVC   B370XF1R(2,BUFPTR),@CB03676                         0408
*     END;                                                         0409
*   RFY                                                            0410
*    (BUFPTR) UNRSTD;                                              0410
@RC00351 DS    0H                                                  0411
*   SDMPAREA=DUMPLIST;              /* MOVE SDUMP LIST FORM TO WORK
*                                      AREA                          */
         MVC   SDMPAREA(24,WKAREAPT),DUMPLIST                      0411
*   GPR07F=0;                       /* ZERO INDICATES DUMP CURRENT 0412
*                                      ADDRESS SPACE                 */
*                                                                  0412
         SLR   GPR07F,GPR07F                                       0412
*   /*****************************************************************/
*   /*                                                               */
*   /* TAKE AN SDUMP OF THIS MEMORY                                  */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0413
*   GPR01P=ADDR(SDMPAREA);                                         0413
         LA    GPR01P,SDMPAREA(,WKAREAPT)                          0413
*   GEN CODE REFS(CVTPTR,CVTMAP,CVTSDMP,GPR07F,SDMPAREA);          0414
         SDUMP BRANCH=YES,ASID=(GPR07F),MF=(E,(1))
*ZR010200:                                                         0415
*   IF WORD0>0 THEN                 /* IS UCB LOCKWORD STORED        */
ZR010200 L     @11,SDWAPARM(,SDWAPTR)                              0415
         L     @11,WORD0(,@11)                                     0415
         LTR   @11,@11                                             0415
         BNP   @RF00415                                            0415
*     DO;                           /* UNLOCK UCB GLOBAL SPIN LOCK   */
*       RFY                                                        0417
*        (GPR11P) RSTD;                                            0417
*       GPR11P=WORD0;               /* ADDR OF UCB LOCKWORD  @ZM31967*/
         L     @08,SDWAPARM(,SDWAPTR)                              0418
         L     @08,WORD0(,@08)                                     0418
         LR    GPR11P,@08                                          0418
*       GPR06P=BASEREG;             /* SAVE BASE REG ACROSS SETLOCK  */
         LR    GPR06P,BASEREG                                      0419
*       GEN SETS(GPR12P,GPR13P,GPR14P) REFS(GPR11P,PSALITA,FLC);   0420
         SETLOCK RELEASE,TYPE=IOSUCB,ADDR=(11),                        *
               RELATED=('LOCK (ICNCB/LDNCB)  HELD AT TIME OF ABEND')
*       BASEREG=GPR06P;             /* RESTORE BASE REG              */
         LR    BASEREG,GPR06P                                      0421
*       RFY                                                        0422
*        (GPR11P) UNRSTD;                                          0422
*                                                                  0422
*/*   THE FOLLOWING LINE OF CODE HAS BEEN DELETED BY PTM P001798     */
*/*     WORD1->ZSAFSV19->ZSAFLOCK=OFF    RESET LOCK OWNERSHIP BIT  0423
*                                                            @ZM31967
*                                                            @ZM41798*/
*                                                                  0423
*     END;                                                         0423
*   SDWAREXN=FRRID;                 /* STORE FRR ID IN SDWA RECORDING
*                                      AREA                          */
@RF00415 MVC   SDWAREXN(8,SDWAPTR),@CC03620                        0424
*   SDWAVRA(1:24)=PARMLIST;         /* INIT VARIABLE RECORDING AREA
*                                      WITH ISTZRM01 FRR PARMLIST    */
         L     @11,SDWAPARM(,SDWAPTR)                              0425
         MVC   SDWAVRA(24,SDWAPTR),PARMLIST(@11)                   0425
*   SDWAHEX=ON;                                                    0426
         OI    SDWAHEX(SDWAPTR),B'10000000'                        0426
*   SDWAURAL=24;                                                   0427
         MVI   SDWAURAL(SDWAPTR),X'18'                             0427
*   DO;                             /* SETRP RECORD(YES)WKAREA(SDWAPT
*                                      R)RC(0)                       */
*     RESPECIFY                                                    0429
*      (GPR00P,                                                    0429
*       GPR01P,                                                    0429
*       GPR14P,                                                    0429
*       GPR15P) RSTD;                                              0429
*     GPR01P=SDWAPTR;                                              0430
         LR    GPR01P,SDWAPTR                                      0430
*     GPR01P->SDWARCDE=0;           /* SAVE RC VALUE                 */
         MVI   SDWARCDE(GPR01P),X'00'                              0431
*     GPR01P->SDWARCRD='1'B;        /* TURN ON RECORD INDICATOR      */
         OI    SDWARCRD(GPR01P),B'10000000'                        0432
*     RESPECIFY                                                    0433
*      (GPR00P,                                                    0433
*       GPR01P,                                                    0433
*       GPR14P,                                                    0433
*       GPR15P) UNRSTD;                                            0433
*   END;                            /* INIT TO PERCOLATE             */
*   GEN REFS(GPR06P,GPR07P,PSACSTK,PSA,FRRSCURR,FRRS,FRRSEMP,FRRSELEN)
*       SETS(GPR06P,GPR07P,FRRSCURR);                              0435
         SETFRR D,WRKREGS=(GPR06P,GPR07P) DELETE ISTAPM69 FRR ENTRY
*   RTNREG=REG14SV;                                                0436
         L     RTNREG,REG14SV(,WKAREAPT)                           0436
*   RETURN;                                                        0437
@EL00001 DS    0H                                                  0437
@EF00001 DS    0H                                                  0437
@ER00001 BR    @14                                                 0437
*   DO;                             /* TPEPILOG                      */
*     GEN(PRINT OFF);                                              0439
         PRINT OFF
*     DO;                                                          0440
*       DCL                                                        0441
*         GPR00F FIXED(31) REG(00),                                0441
*         GPR00P PTR(31) REG(00),                                  0441
*         GPR01F FIXED(31) REG(01),                                0441
*         GPR01P PTR(31) REG(01),                                  0441
*         GPR02F FIXED(31) REG(02),                                0441
*         GPR02P PTR(31) REG(02),                                  0441
*         GPR03F FIXED(31) REG(03),                                0441
*         GPR03P PTR(31) REG(03),                                  0441
*         GPR04F FIXED(31) REG(04),                                0441
*         GPR04P PTR(31) REG(04),                                  0441
*         GPR05F FIXED(31) REG(05),                                0441
*         GPR05P PTR(31) REG(05),                                  0441
*         GPR06F FIXED(31) REG(06),                                0441
*         GPR06P PTR(31) REG(06),                                  0441
*         GPR07F FIXED(31) REG(07),                                0441
*         GPR07P PTR(31) REG(07),                                  0441
*         GPR08F FIXED(31) REG(08),                                0441
*         GPR08P PTR(31) REG(08),                                  0441
*         GPR09F FIXED(31) REG(09),                                0441
*         GPR09P PTR(31) REG(09),                                  0441
*         GPR10F FIXED(31) REG(10),                                0441
*         GPR10P PTR(31) REG(10),                                  0441
*         GPR11F FIXED(31) REG(11),                                0441
*         GPR11P PTR(31) REG(11),                                  0441
*         GPR12F FIXED(31) REG(12),                                0441
*         GPR12P PTR(31) REG(12),                                  0441
*         GPR13F FIXED(31) REG(13),                                0441
*         GPR13P PTR(31) REG(13),                                  0441
*         GPR14F FIXED(31) REG(14),                                0441
*         GPR14P PTR(31) REG(14),                                  0441
*         GPR15F FIXED(31) REG(15),                                0441
*         GPR15P PTR(31) REG(15);                                  0441
*     END;                                                         0442
*     GEN(PRINT ON);                                               0443
         PRINT ON
*   END;                            /* TPEPILOG                      */
*   END ISTZRM01                                                   0445
*                                                                  0445
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */
*/*%INCLUDE SYSLIB  (IHAFRRS )                                       */
*/*%INCLUDE SYSLIB  (IHAPSA  )                                       */
*/*%INCLUDE SYSLIB  (CVT     )                                       */
*/*%INCLUDE SYSLIB  (IHASDWA )                                       */
*/*%INCLUDE SYSLIB  (IEFUCBOB)                                       */
*/*%INCLUDE SYSLIB  (IEZIOB  )                                       */
*/*%INCLUDE SYSLIB  (IHASRB  )                                       */
*/*%INCLUDE SYSLIB  (IECDIOSB)                                       */
*                                                                  0445
*       ;                                                          0445
         B     @EL00001                                            0445
@DATA    DS    0H
@CH03701 DC    H'544'
@CH03703 DC    H'552'
@DATD    DSECT
         DS    0F
ISTZRM01 CSECT
         DS    0F
@CF00065 DC    F'8'
@CF02355 DC    XL4'7FFFFFFF'
@CF02357 DC    XL4'80000000'
@DATD    DSECT
         DS    0D
ISTZRM01 CSECT
         NOPR  ((@ENDDATD-@DATD)*16)
         DS    0F
@SIZDATD DC    AL1(0)
         DC    AL3(@ENDDATD-@DATD)
         DS    0D
@CC03620 DC    C'ISTZRM01'
@CB03676 DC    X'0000'
ISTZRM01 CSECT
DUMPLIST SDUMP SDATA=(ALLPSA,CSA,LSQA,SQA,TRT,LPA,NUC,SWA),BUFFER=YES, *
               MF=L
@DATD    DSECT
@ENDDATD EQU   *
ISTZRM01 CSECT
@00      EQU   00                      EQUATES FOR REGISTERS 0-15
@01      EQU   01
@02      EQU   02
@03      EQU   03
@04      EQU   04
@05      EQU   05
@06      EQU   06
@07      EQU   07
@08      EQU   08
@09      EQU   09
@10      EQU   10
@11      EQU   11
@12      EQU   12
@13      EQU   13
@14      EQU   14
@15      EQU   15
SDWAPTR  EQU   @10
UCBPTR   EQU   @05
RPHPTR   EQU   @01
LDNCBPTR EQU   @04
GPR00P   EQU   @00
GPR01P   EQU   @01
GPR04P   EQU   @04
GPR05P   EQU   @05
GPR06P   EQU   @06
GPR07P   EQU   @07
GPR09P   EQU   @09
GPR10P   EQU   @10
GPR12P   EQU   @12
GPR13P   EQU   @13
GPR14P   EQU   @14
GPR15P   EQU   @15
GPR07F   EQU   @07
WKAREAPT EQU   @09
ICNCBPTR EQU   @04
OLD      EQU   @07
NEW      EQU   @06
BUFPTR   EQU   @08
BASEREG  EQU   @12
RTNREG   EQU   @14
GPR02P   EQU   @02
GPR03F   EQU   @03
GPR11P   EQU   @11
GPR00F   EQU   @00
GPR01F   EQU   @01
GPR02F   EQU   @02
GPR03P   EQU   @03
GPR04F   EQU   @04
GPR05F   EQU   @05
GPR06F   EQU   @06
GPR08F   EQU   @08
GPR08P   EQU   @08
GPR09F   EQU   @09
GPR10F   EQU   @10
GPR11F   EQU   @11
GPR12F   EQU   @12
GPR13F   EQU   @13
GPR14F   EQU   @14
GPR15F   EQU   @15
PSA      EQU   0
FLCRNPSW EQU   PSA
FLCROPSW EQU   PSA+8
FLCICCW2 EQU   PSA+16
PSAEEPSW EQU   PSA+132
PSAESPSW EQU   PSA+136
FLCSVILC EQU   PSAESPSW+1
PSAEPPSW EQU   PSA+140
FLCPIILC EQU   PSAEPPSW+1
FLCPICOD EQU   PSAEPPSW+2
PSAPICOD EQU   FLCPICOD+1
FLCTEA   EQU   PSAEPPSW+4
FLCPER   EQU   PSA+152
FLCMCLA  EQU   PSA+168
FLCIOEL  EQU   FLCMCLA+4
FLCIOA   EQU   FLCMCLA+16
FLCFSA   EQU   FLCMCLA+80
PSASUPER EQU   PSA+552
PSASUP1  EQU   PSASUPER
PSASUP2  EQU   PSASUPER+1
PSASUP3  EQU   PSASUPER+2
PSASUP4  EQU   PSASUPER+3
PSACLHT  EQU   PSA+640
PSALKSA  EQU   PSA+696
PSAHLHI  EQU   PSA+760
PSALITA  EQU   PSA+764
PSADSSFL EQU   PSA+836
PSADSSF1 EQU   PSADSSFL
PSADSSF3 EQU   PSADSSFL+2
PSADSSF4 EQU   PSADSSFL+3
PSARSVT  EQU   PSA+896
PSALSFCC EQU   PSA+1012
CVTPTR   EQU   16
ATCLCPTR EQU   1032
FRRS     EQU   0
FRRSHEAD EQU   FRRS
FRRSEMP  EQU   FRRSHEAD
FRRSLAST EQU   FRRSHEAD+4
FRRSELEN EQU   FRRSHEAD+8
FRRSCURR EQU   FRRSHEAD+12
FRRSENTR EQU   0
FRRSFRRA EQU   FRRSENTR
FRRSFLGS EQU   FRRSENTR+4
FRRSFLG1 EQU   FRRSFLGS
FRRSPARM EQU   FRRSENTR+8
CVTMAP   EQU   0
CVTDAR   EQU   CVTMAP+72
CVTFLGS1 EQU   CVTDAR
CVTDCB   EQU   CVTMAP+116
CVTIERLC EQU   CVTMAP+144
CVTOPTA  EQU   CVTMAP+182
CVTOPTB  EQU   CVTMAP+183
CVTGTF   EQU   CVTMAP+236
CVTGTFST EQU   CVTGTF
CVTGTFS  EQU   CVTGTFST
CVTSTATE EQU   CVTGTFST
CVTTMODE EQU   CVTGTFST
CVTFORM  EQU   CVTGTFST
CVTAQAVT EQU   CVTMAP+240
CVTTCMFG EQU   CVTAQAVT
CVTVOLM2 EQU   CVTMAP+244
CVTTATA  EQU   CVTVOLM2
CVTTSKS  EQU   CVTTATA
CVTVOLF2 EQU   CVTTSKS
CVTTAT   EQU   CVTTATA+1
CVTATER  EQU   CVTMAP+248
CVTEXT1  EQU   CVTMAP+252
CVTPURG  EQU   CVTMAP+260
CVTQMSG  EQU   CVTMAP+268
CVTDMSR  EQU   CVTMAP+272
CVTRSV37 EQU   CVTDMSR
CVTDMSRF EQU   CVTRSV37
CVTERPV  EQU   CVTMAP+316
CVTINTLA EQU   CVTMAP+320
CVTAPF   EQU   CVTMAP+324
CVTEXT2  EQU   CVTMAP+328
CVTHJES  EQU   CVTMAP+332
CVTPGSIA EQU   CVTMAP+348
CVTA1F1  EQU   CVTMAP+356
CVTSYSK  EQU   CVTMAP+357
CVTVOLM1 EQU   CVTMAP+380
CVTVOLF1 EQU   CVTVOLM1
CVTXTNT1 EQU   0
CVTXTNT2 EQU   0
CVTDSSV  EQU   CVTXTNT2
CVTFLGBT EQU   CVTXTNT2+5
CVTQID   EQU   CVTXTNT2+24
CVTRV400 EQU   CVTXTNT2+52
CVTRV409 EQU   CVTXTNT2+53
CVTATCVT EQU   CVTXTNT2+64
CVTRV429 EQU   CVTXTNT2+84
CVTRV438 EQU   CVTXTNT2+85
CVTRV457 EQU   CVTXTNT2+112
CVTRV466 EQU   CVTXTNT2+113
CVTFIX   EQU   0
CVTRELNO EQU   CVTFIX+252
SDWA     EQU   0
SDWAPARM EQU   SDWA
SDWAFIOB EQU   SDWA+4
SDWAABCC EQU   SDWAFIOB
SDWACMPF EQU   SDWAABCC
SDWACTL1 EQU   SDWA+8
SDWACMKA EQU   SDWACTL1
SDWAMWPA EQU   SDWACTL1+1
SDWAPMKA EQU   SDWACTL1+4
SDWACTL2 EQU   SDWA+16
SDWACMKP EQU   SDWACTL2
SDWAMWPP EQU   SDWACTL2+1
SDWAPMKP EQU   SDWACTL2+4
SDWAGRSV EQU   SDWA+24
SDWANAME EQU   SDWA+88
SDWAEC1  EQU   SDWA+104
SDWAEMK1 EQU   SDWAEC1
SDWAMWP1 EQU   SDWAEC1+1
SDWAINT1 EQU   SDWAEC1+2
SDWANXT1 EQU   SDWAEC1+4
SDWAAEC1 EQU   SDWA+112
SDWAILC1 EQU   SDWAAEC1+1
SDWAINC1 EQU   SDWAAEC1+2
SDWAICD1 EQU   SDWAINC1+1
SDWAEC2  EQU   SDWA+120
SDWAEMK2 EQU   SDWAEC2
SDWAMWP2 EQU   SDWAEC2+1
SDWAINT2 EQU   SDWAEC2+2
SDWANXT2 EQU   SDWAEC2+4
SDWAAEC2 EQU   SDWA+128
SDWAILC2 EQU   SDWAAEC2+1
SDWAINC2 EQU   SDWAAEC2+2
SDWAICD2 EQU   SDWAINC2+1
SDWASRSV EQU   SDWA+136
SDWAIDNT EQU   SDWA+200
SDWAMCH  EQU   SDWA+204
SDWASTCK EQU   SDWAMCH
SDWAMCHI EQU   SDWAMCH+8
SDWAMCHS EQU   SDWAMCHI
SDWAMCHD EQU   SDWAMCHI+1
SDWARSR1 EQU   SDWAMCH+12
SDWARSR2 EQU   SDWAMCH+13
SDWAFLGS EQU   SDWA+232
SDWAERRA EQU   SDWAFLGS
SDWAERRB EQU   SDWAFLGS+1
SDWAERRC EQU   SDWAFLGS+2
SDWAERRD EQU   SDWAFLGS+3
SDWAFMID EQU   SDWA+236
SDWAIOFS EQU   SDWA+238
SDWACPUA EQU   SDWA+248
SDWAPARQ EQU   SDWA+252
SDWARCDE EQU   SDWAPARQ
SDWAACF2 EQU   SDWAPARQ+1
SDWARCRD EQU   SDWAACF2
SDWAACF3 EQU   SDWAPARQ+2
SDWAACF4 EQU   SDWAPARQ+3
SDWALKWA EQU   SDWA+256
SDWALKWS EQU   SDWALKWA
SDWARECP EQU   SDWA+292
SDWAREXN EQU   SDWARECP+16
SDWASNPA EQU   SDWA+320
SDWADUMP EQU   SDWASNPA
SDWADPFS EQU   SDWADUMP+1
SDWADDAT EQU   SDWASNPA+4
SDWASDAT EQU   SDWADDAT
SDWAPDAT EQU   SDWADDAT+2
SDWADPSA EQU   SDWA+328
SDWADPSL EQU   SDWADPSA
SDWARA   EQU   SDWA+400
SDWADPVA EQU   SDWARA+2
SDWAHEX  EQU   SDWADPVA
SDWAURAL EQU   SDWARA+3
SDWAVRA  EQU   SDWARA+4
UCB      EQU   0
UCBLOCK  EQU   UCB+504
UCBOB    EQU   0
UCBJBNR  EQU   UCBOB
UCBFL5   EQU   UCBOB+1
UCBAF    EQU   UCBFL5
UCBSTAT  EQU   UCBOB+3
UCBCHAN  EQU   UCBOB+4
UCBSFLS  EQU   UCBOB+6
UCBFLA   EQU   UCBSFLS
UCBFL1   EQU   UCBFLA
UCBBSY   EQU   UCBFL1
UCBNRY   EQU   UCBFL1
UCBPST   EQU   UCBFL1
UCBCUB   EQU   UCBFL1
UCBFLB   EQU   UCBSFLS+1
UCBCHM   EQU   UCBOB+8
UCBCHM1  EQU   UCBCHM
UCBPTH0  EQU   UCBCHM1
UCBPTH1  EQU   UCBCHM1
UCBWGT   EQU   UCBOB+12
UCBTYP   EQU   UCBOB+16
UCBTBYT1 EQU   UCBTYP
UCB1FEA5 EQU   UCBTBYT1
UCB1FEA6 EQU   UCBTBYT1
UCBTBYT2 EQU   UCBTYP+1
UCB2OPT2 EQU   UCBTBYT2
UCBDUDN1 EQU   UCB2OPT2
UCB2OPT3 EQU   UCBTBYT2
UCBDUDN2 EQU   UCB2OPT3
UCB2OPT4 EQU   UCBTBYT2
UCBRWTAU EQU   UCB2OPT4
UCB2OPT6 EQU   UCBTBYT2
UCB2OPT7 EQU   UCBTBYT2
UCBTBYT3 EQU   UCBTYP+2
UCBDVCLS EQU   UCBTBYT3
UCB3COMM EQU   UCBDVCLS
UCBTBYT4 EQU   UCBTYP+3
UCBEXTPT EQU   UCBOB+20
UCBFLC   EQU   UCBEXTPT
UCBDEV   EQU   UCBOB+24
UCBCMEXT EQU   0
UCBATI   EQU   UCBCMEXT+3
@NM00080 EQU   UCBATI
UCBFLP1  EQU   UCBCMEXT+5
UCBMT    EQU   0
UCBOCR   EQU   0
UCB3540X EQU   0
UCBDKBYT EQU   UCB3540X+6
UCB3800X EQU   0
UCBOPTNS EQU   UCB3800X
UCBACTIV EQU   UCB3800X+3
UCBMDRBF EQU   UCB3800X+36
UCBUCS   EQU   0
UCBUCSOP EQU   UCBUCS+4
UCBFCBOP EQU   UCBUCS+5
IOBPREFX EQU   0
IOBCFLG1 EQU   IOBPREFX
IOBSTDRD EQU   0
IOBFLAG1 EQU   IOBSTDRD
IOBCYCCK EQU   IOBFLAG1
IOBRSTRT EQU   IOBFLAG1
IOBFLAG2 EQU   IOBSTDRD+1
IOBPURGE EQU   IOBFLAG2
IOBRDHA0 EQU   IOBFLAG2
IOBSENS0 EQU   IOBSTDRD+2
IOBS0B7  EQU   IOBSENS0
IOBSENS1 EQU   IOBSTDRD+3
IOBECBPT EQU   IOBSTDRD+4
IOBFLAG3 EQU   IOBSTDRD+8
IOBFL3   EQU   IOBFLAG3
IOBCNC   EQU   IOBFL3
IOBICL   EQU   IOBFL3
IOBCSW   EQU   IOBSTDRD+9
IOBIOCSW EQU   IOBCSW
IOBSTBYT EQU   IOBIOCSW+3
IOBUSTAT EQU   IOBSTBYT
IOBCSTAT EQU   IOBSTBYT+1
IOBSTART EQU   IOBSTDRD+16
IOBDCBPT EQU   IOBSTDRD+20
IOBFLAG4 EQU   IOBDCBPT
IOBRESTR EQU   IOBSTDRD+24
IOBINCAM EQU   IOBSTDRD+28
IOBBTAMF EQU   IOBINCAM
SRBSECT  EQU   0
SRBFLC   EQU   SRBSECT+12
IOSB     EQU   0
IOSFLA   EQU   IOSB
IOSACHN  EQU   IOSFLA
IOSFLB   EQU   IOSB+1
IOSFLC   EQU   IOSB+2
IOSDVALT EQU   IOSFLC
IOSPKEY  EQU   IOSB+12
IOSOPT   EQU   IOSB+14
IOSOPT2  EQU   IOSB+15
@NM00084 EQU   IOSB+20
IOSCSW   EQU   @NM00084+1
IOSTATUS EQU   IOSCSW+3
IOSIPIB  EQU   IOSB+44
IOSPATH  EQU   IOSB+86
IOSCHN   EQU   IOSPATH
IOSCKEY  EQU   IOSB+89
IOSEEKA  EQU   IOSB+100
IOSCCHH  EQU   IOSEEKA+3
IOSSKHH  EQU   IOSCCHH+2
ISTLOK   EQU   0
LOKCHN   EQU   ISTLOK+1
LOKCHNG  EQU   LOKCHN
@NM00091 EQU   LOKCHNG+2
ISTPAB   EQU   0
PABWQCHN EQU   ISTPAB
PABWEQA  EQU   PABWQCHN
PABCHAIN EQU   PABWQCHN+4
PABRUNNG EQU   PABCHAIN
PABRPHFG EQU   ISTPAB+12
PABFLAGS EQU   PABRPHFG
PABERLCK EQU   PABFLAGS
PABERRLK EQU   PABERLCK
PABEND   EQU   ISTPAB+16
ISTDYPAB EQU   0
DYPCHAIN EQU   ISTDYPAB+4
DYPPACMD EQU   ISTDYPAB+12
ISTRPH   EQU   0
RPHCNTL  EQU   ISTRPH
RPHFLAGS EQU   RPHCNTL+2
RPHFSTLC EQU   RPHFLAGS
RPHFLGB  EQU   RPHCNTL+3
RPHRPHA  EQU   ISTRPH+4
RPHTSKID EQU   ISTRPH+8
RPHRESMA EQU   ISTRPH+16
RPHWPFLG EQU   RPHRESMA
RPHWEA   EQU   ISTRPH+24
RPHCSPA  EQU   RPHWEA
RPHSRPRM EQU   ISTRPH+28
RPHPABQA EQU   ISTRPH+36
RPHWORK  EQU   ISTRPH+40
RPHSAVE1 EQU   RPHWORK
RPHSBITS EQU   RPHSAVE1+1
ISTATCVT EQU   0
ATCRPTCH EQU   ISTATCVT
ATCITFLD EQU   ISTATCVT+8
ATCITCDS EQU   ATCITFLD+8
ATCITFLG EQU   ATCITCDS+4
ATCITRA1 EQU   ATCITFLG+2
ATCSMPAB EQU   ISTATCVT+88
ATCVDPAB EQU   ISTATCVT+152
ATCLDTIL EQU   ISTATCVT+408
ATCGTSTR EQU   ISTATCVT+608
ATCLUDVT EQU   ISTATCVT+768
ATCANYDT EQU   ISTATCVT+776
@NM00101 EQU   ISTATCVT+780
ATCPODVT EQU   ISTATCVT+804
ATCSTAT  EQU   ISTATCVT+936
ATCSTAT1 EQU   ATCSTAT
ATCPOFLG EQU   ATCSTAT+2
ATCSTAT4 EQU   ATCSTAT+3
ATCBITAN EQU   ISTATCVT+940
ATCFLAG2 EQU   ATCBITAN+1
ATCONID  EQU   ISTATCVT+944
ATCSSCPA EQU   ISTATCVT+948
ATCHPGM  EQU   ISTATCVT+1012
ATCVLCNT EQU   ISTATCVT+1016
ATCRNO   EQU   ISTATCVT+1020
@NM00124 EQU   ISTATCVT+1028
ATCSHRFG EQU   @NM00124+8
ATCCPDVT EQU   ISTATCVT+1096
ATCSMSDQ EQU   ISTATCVT+1140
ATCRID   EQU   ISTATCVT+1152
ATCLDAPP EQU   ISTATCVT+1288
ATCSQAFR EQU   ISTATCVT+1312
ATCORTCB EQU   ATCSQAFR+4
ATCORSRB EQU   ATCORTCB
ATCICAPP EQU   ISTATCVT+1320
ATCDAPVT EQU   ISTATCVT+1340
ATCGSRBQ EQU   ISTATCVT+1472
ATCGSRBG EQU   ATCGSRBQ
ATCENFLG EQU   ISTATCVT+1512
@NM00139 EQU   ISTATCVT+1575
ATCVTFLG EQU   ISTATCVT+1576
ATCAP69  EQU   ISTATCVT+1652
ATCZFLAG EQU   ISTATCVT+1696
ATCCRA   EQU   ISTATCVT+1720
ATCCRACN EQU   ATCCRA+4
ATCSRB   EQU   ISTATCVT+1728
ATCSRBCN EQU   ATCSRB+4
ATCCRPL  EQU   ISTATCVT+1736
ATCRPLCN EQU   ATCCRPL+4
ISTAVT   EQU   0
ISTRETRG EQU   ISTAVT+44
ISTDEVCH EQU   0
DEVSHCH  EQU   ISTDEVCH
DEVCHAR  EQU   DEVSHCH
DEVTCODE EQU   ISTDEVCH+1
DEVFLAGS EQU   ISTDEVCH+3
DEVFCCTL EQU   DEVFLAGS
DEVCHAR3 EQU   DEVFLAGS
DEVMODE  EQU   ISTDEVCH+5
ISTCCW   EQU   0
CCWVADDR EQU   ISTCCW
CCWFLAGS EQU   ISTCCW+4
CCWSPARE EQU   ISTCCW+5
ISTNCB   EQU   0
NCBFLAGS EQU   ISTNCB+24
NCBFRAS  EQU   NCBFLAGS+1
NCBFTRIO EQU   NCBFRAS
NCBFLAG1 EQU   NCBFLAGS+2
NCBEXFLG EQU   ISTNCB+28
ISTLDNCB EQU   0
LDNDLCIA EQU   ISTLDNCB+104
LDNCAW   EQU   LDNDLCIA+8
LDNSENSE EQU   LDNDLCIA+12
@NM00158 EQU   LDNSENSE
LDNSTS   EQU   LDNDLCIA+14
@NM00160 EQU   LDNSTS
LDNDEVCA EQU   ISTLDNCB+128
LDNPENDQ EQU   LDNDEVCA+16
LDNBUFFQ EQU   LDNDEVCA+24
LDNUNAME EQU   LDNDEVCA+36
LDNRMLEN EQU   LDNDEVCA+42
LDNSIOCT EQU   LDNDEVCA+44
LDNFLAG1 EQU   LDNDEVCA+48
LDNFLAG2 EQU   LDNDEVCA+52
@NM00163 EQU   LDNFLAG2
LDNTESTM EQU   @NM00163
LDNTMIND EQU   LDNTESTM
@NM00165 EQU   LDNFLAG2+1
LDNRDREQ EQU   @NM00165
LDNSYSUA EQU   ISTLDNCB+184
LDNDCDEB EQU   LDNSYSUA+16
LDNDIDEB EQU   LDNDCDEB+36
LDNSPACE EQU   LDNDCDEB+40
ISTICNCB EQU   0
ICNDLCIA EQU   ISTICNCB+104
ICNSENSE EQU   ICNDLCIA+12
@NM00186 EQU   ICNSENSE
ICNDTCHK EQU   @NM00186
ICNOVRUN EQU   @NM00186
@NM00187 EQU   ICNSENSE+1
ICNSTS   EQU   ICNDLCIA+14
@NM00189 EQU   ICNSTS
ICNDEVCA EQU   ISTICNCB+128
ICNWSCCW EQU   ICNDEVCA
ICNWSTIC EQU   ICNDEVCA+8
ICNNPCCW EQU   ICNDEVCA+24
ICNSMNOP EQU   ICNDEVCA+32
ICNRSCCW EQU   ICNDEVCA+40
ICNRSTIC EQU   ICNDEVCA+48
ICNPENDQ EQU   ICNDEVCA+56
ICNBUFFQ EQU   ICNDEVCA+64
ICNBUFRQ EQU   ICNBUFFQ+6
ICNFLAG1 EQU   ICNDEVCA+80
ICNFLAG2 EQU   ICNDEVCA+84
@NM00192 EQU   ICNFLAG2
ICNLAT   EQU   ICNDEVCA+92
ICNUNAME EQU   ICNDEVCA+96
ICNTECT  EQU   ICNDEVCA+101
ICNSIOCT EQU   ICNDEVCA+102
ICNSYSUA EQU   ISTICNCB+232
ICNCKFLD EQU   ICNSYSUA
ICNDCDEB EQU   ICNSYSUA+16
ICNDIDEB EQU   ICNDCDEB+36
ICNSPACE EQU   ICNDCDEB+40
ISTZFSAV EQU   0
ISTZ19SV EQU   0
ZSAF19FG EQU   ISTZ19SV
PARMLIST EQU   0
DWORD0   EQU   PARMLIST
WORD0    EQU   DWORD0
BUF370X  EQU   0
B370XF1A EQU   BUF370X
B370XF1L EQU   BUF370X+4
B370XF1R EQU   BUF370X+6
B370XUCB EQU   BUF370X+8
B370XUOB EQU   BUF370X+520
B370XU07 EQU   BUF370X+544
B370XF2A EQU   BUF370X+552
B370XF2L EQU   BUF370X+556
B370XF2R EQU   BUF370X+558
B370XICN EQU   BUF370X+560
B370XF3A EQU   BUF370X+1024
B370XF3L EQU   BUF370X+1028
B370XF3R EQU   BUF370X+1030
BUF3270  EQU   0
B3270F1A EQU   BUF3270
B3270F1L EQU   BUF3270+4
B3270F1R EQU   BUF3270+6
B3270UCB EQU   BUF3270+8
B3270UOB EQU   BUF3270+520
B3270U06 EQU   BUF3270+544
B3270F2A EQU   BUF3270+560
B3270F2L EQU   BUF3270+564
B3270F2R EQU   BUF3270+566
B3270LDN EQU   BUF3270+568
B3270F3A EQU   BUF3270+984
B3270F3L EQU   BUF3270+988
B3270F3R EQU   BUF3270+990
WKAREA   EQU   0
FRR69PRM EQU   WKAREA
REG14SV  EQU   WKAREA+4
SDMPAREA EQU   WKAREA+8
ISTXDYP  EQU   0
ISTXPAB  EQU   0
UCBBGN   EQU   0
FLC      EQU   PSA
PSARSVTE EQU   PSARSVT
PSACSTK  EQU   PSARSVTE
CVTS01   EQU   CVTPGSIA
CVTLPDIA EQU   CVTS01+12
CVTDIRST EQU   CVTLPDIA
CVTSLIDA EQU   CVTS01+24
CVTCTLFG EQU   CVTS01+50
CVTSDMP  EQU   CVTS01+232
CVTSDBF  EQU   CVTS01+240
CVTRV210 EQU   CVTS01+424
CVTRV219 EQU   CVTS01+425
CVTRV228 EQU   CVTS01+426
CVTRV237 EQU   CVTS01+427
CVTMFRTR EQU   CVTS01+452
CVTRV262 EQU   CVTS01+468
CVTRV271 EQU   CVTS01+469
CVTRV280 EQU   CVTS01+470
CVTRV289 EQU   CVTS01+471
CVTGSDA  EQU   CVTS01+600
UCBOBS01 EQU   UCBDEV
UCBSTAB  EQU   UCBOBS01+10
UCBBSVL  EQU   UCBSTAB
UCBPRSRS EQU   UCBSTAB
UCBDMCT  EQU   UCBOBS01+11
UCBFL4   EQU   UCBOBS01+13
UCBOBS02 EQU   UCBDEV
UCBTFL1  EQU   UCBOBS02+19
UCBXTN   EQU   UCBOBS02+20
UCBVOPT  EQU   UCBXTN
UCBOBS03 EQU   UCBDEV
UCBXTADR EQU   UCBOBS03
UCBOBS04 EQU   UCBDEV
UCBBTA   EQU   UCBOBS04+12
UCBOBS06 EQU   UCBDEV
UCBAOF   EQU   UCBOBS06
UCBAOF1  EQU   UCBAOF
UCBAOF2  EQU   UCBAOF+1
@NM00079 EQU   UCBOBS06+3
UCBIRB   EQU   UCBOBS06+4
UCBGRAF  EQU   UCBIRB
UCBLDNCA EQU   UCBOBS06+8
UCBRDYQ  EQU   UCBLDNCA
UCBIRLN  EQU   UCBRDYQ
UCBLDNCB EQU   UCBRDYQ+1
UCBCTLNK EQU   UCBOBS06+12
UCBOBS07 EQU   UCBDEV
UCBICNCB EQU   UCBOBS07+4
UCBOBS08 EQU   UCBDEV
UCBCTCAD EQU   UCBOBS08
UCBCTCF1 EQU   UCBOBS08+4
UCBOBS09 EQU   UCBDEV
IOBORG01 EQU   IOBPREFX+8
IOBNIOBA EQU   IOBORG01
IOBNFLG1 EQU   IOBNIOBA
IOBPRTOV EQU   IOBNFLG1
IOBORG02 EQU   IOBPREFX+8
IOBDQADA EQU   IOBORG02
IOBDEQIN EQU   IOBDQADA
IOBORG03 EQU   IOBPREFX+12
IOBORG04 EQU   IOBINCAM
IOBORG12 EQU   IOBINCAM
IOBFL4   EQU   IOBORG12
IOBEXTEN EQU   IOBSTDRD+32
IOBSEEK  EQU   IOBEXTEN
IOBBB    EQU   IOBSEEK+1
IOBCC    EQU   IOBSEEK+3
IOBHH    EQU   IOBSEEK+5
IOBORG05 EQU   IOBEXTEN
IOBORG06 EQU   IOBEXTEN
IOBNXTPT EQU   IOBORG06+4
IOBSTATA EQU   IOBNXTPT
IOBORG07 EQU   IOBEXTEN+8
W1IEXTEN EQU   IOBORG07
IOBORG08 EQU   IOBEXTEN+8
IOBINDCT EQU   IOBORG08+4
IOBUNSQR EQU   IOBORG08+5
IOBFCHAD EQU   IOBORG08+8
IOBORG09 EQU   IOBEXTEN+8
IOBDPLAD EQU   IOBORG09+4
IOBDTYPE EQU   IOBORG09+8
IOBDTYP2 EQU   IOBORG09+9
IOBDSTAT EQU   IOBORG09+10
IOBSTAT1 EQU   IOBDSTAT
IOBORG10 EQU   IOBEXTEN+8
IOBSEEK2 EQU   IOBORG10
IOBORG11 EQU   IOBEXTEN
IOBERCT  EQU   IOBORG11
IOBUCBXV EQU   IOBERCT
IOBNAME  EQU   IOBORG11+4
IOBORG13 EQU   IOBEXTEN
IOBSKADR EQU   IOBORG13
IOSATTSC EQU   IOSIPIB
IOSWTOWA EQU   IOSIPIB
IOSPCISC EQU   IOSIPIB
PABXTNSN EQU   PABEND
@NM00171 EQU   LDNFLAG1
LDNUFLAG EQU   @NM00171
@NM00173 EQU   @NM00171+1
LDNCLREC EQU   @NM00173
@NM00177 EQU   LDNSPACE
LDNZH003 EQU   @NM00177+16
@NM00182 EQU   @NM00177+20
@NM00200 EQU   ICNFLAG1
@NM00201 EQU   @NM00200
ICNCLREC EQU   @NM00201
@NM00204 EQU   @NM00200+1
ICNANSIP EQU   @NM00204
ICNRDREQ EQU   @NM00204
ICNUFLAG EQU   @NM00200+2
ICNUHARD EQU   ICNUFLAG
ICNURQCN EQU   ICNUFLAG
@NM00208 EQU   ICNSPACE
ICNZH002 EQU   @NM00208+12
ICNZS002 EQU   ICNZH002
ICNZS003 EQU   ICNZH002
ICNZS004 EQU   ICNZH002
ICNZS006 EQU   ICNZH002
ICNZS007 EQU   ICNZH002
ICNZS008 EQU   ICNZH002
ICNZS009 EQU   ICNZH002+1
ICNZS00A EQU   ICNZH002+1
@NM00209 EQU   @NM00208+19
ICNRSRT  EQU   @NM00209
@NM00211 EQU   @NM00208+20
ISTICNCT EQU   ISTICNCB
ICNSTATS EQU   ISTICNCT+464
ICNBUFF  EQU   ICNBUFRQ
ICNCUUA  EQU   ICNUNAME
ICNIDT   EQU   ICNLAT
ICNLCVTA EQU   ICNLAT
ICNZD001 EQU   ICNWSCCW
ICNZD002 EQU   ICNWSTIC
ICNZD003 EQU   ICNRSCCW
ICNZD004 EQU   ICNRSTIC
ICNZD005 EQU   ICNNPCCW
ICNZD006 EQU   ICNSMNOP
ICNZH001 EQU   ICNSIOCT
ICNZX001 EQU   ICNTECT
LDNCPQ   EQU   LDNCAW
LDNCUUA  EQU   LDNUNAME
LDNINIT  EQU   LDNRMLEN
LDNVCPAD EQU   LDNCAW
LDNZARM  EQU   LDNRMLEN
LDNZH002 EQU   LDNSIOCT
SRB      EQU   SRBSECT
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS
ICNSLODN EQU   ICNSTATS+28
ICNRDBUF EQU   ICNSTATS+24
ICNOPIU  EQU   ICNSTATS+20
ICNIPIU  EQU   ICNSTATS+16
ICNRDATN EQU   ICNSTATS+12
ICNATTN  EQU   ICNSTATS+8
ICNCHRD  EQU   ICNSTATS+4
ICNCHWR  EQU   ICNSTATS
@NM00216 EQU   ISTICNCT
@NM00215 EQU   @NM00208+23
ICNHKMSK EQU   @NM00208+22
ICNERCNT EQU   @NM00208+21
@NM00214 EQU   @NM00211
@NM00213 EQU   @NM00211
@NM00212 EQU   @NM00211
ICNZF026 EQU   @NM00211
ICNZF024 EQU   @NM00211
ICNZF023 EQU   @NM00211
ICNZF022 EQU   @NM00211
ICNZF021 EQU   @NM00211
@NM00210 EQU   @NM00209
ICNZF016 EQU   @NM00209
ICNZF011 EQU   @NM00209
ICNZF00E EQU   ICNRSRT
ICNZF00A EQU   @NM00209
ICNZF005 EQU   @NM00209
ICNZF004 EQU   @NM00209
ICNZF001 EQU   @NM00209
ICNZX013 EQU   @NM00208+18
ICNZX012 EQU   @NM00208+17
ICNZX011 EQU   @NM00208+16
ICNZX010 EQU   @NM00208+14
ICNZS010 EQU   ICNZH002+1
ICNZS00F EQU   ICNZH002+1
ICNZS00E EQU   ICNZH002+1
ICNZS00D EQU   ICNZH002+1
ICNZS00C EQU   ICNZH002+1
ICNZS00B EQU   ICNZH002+1
ICNZS01A EQU   ICNZS00A
ICNZS019 EQU   ICNZS009
ICNZS018 EQU   ICNZS008
ICNZS017 EQU   ICNZS007
ICNZS016 EQU   ICNZS006
ICNZS005 EQU   ICNZH002
ICNZS014 EQU   ICNZS004
ICNZS013 EQU   ICNZS003
ICNZS012 EQU   ICNZS002
ICNZS001 EQU   ICNZH002
ICNZV006 EQU   @NM00208+8
ICNZC001 EQU   @NM00208
@NM00207 EQU   @NM00200+3
@NM00206 EQU   ICNUFLAG
ICNUIOEM EQU   ICNUFLAG
ICNROLN  EQU   ICNURQCN
ICNUDELR EQU   ICNUFLAG
ICNUSOFT EQU   ICNUFLAG
ICNZF00F EQU   ICNUHARD
ICNUDISC EQU   ICNUFLAG
@NM00205 EQU   @NM00204
ICNZF013 EQU   ICNRDREQ
ICNZF010 EQU   ICNANSIP
ICNSLOW  EQU   @NM00204
@NM00203 EQU   @NM00201
ICNZF008 EQU   ICNCLREC
ICNCLOSE EQU   @NM00201
@NM00202 EQU   @NM00201
@NM00184 EQU   @NM00177+23
LDNZX006 EQU   @NM00177+22
LDNZCHNC EQU   @NM00177+21
@NM00183 EQU   @NM00182
LDNZENTR EQU   @NM00182
LDNZDSIC EQU   @NM00182
LDNZCTOV EQU   @NM00182
LDNZCHNE EQU   @NM00182
LDNZX005 EQU   @NM00177+19
LDNZX001 EQU   @NM00177+18
LDNZS00F EQU   LDNZH003+1
LDNZS00E EQU   LDNZH003+1
LDNZS00D EQU   LDNZH003+1
@NM00181 EQU   LDNZH003+1
LDNZS00B EQU   LDNZH003+1
@NM00180 EQU   LDNZH003
LDNZS006 EQU   LDNZH003
@NM00179 EQU   LDNZH003
LDNZS004 EQU   LDNZH003
LDNZS003 EQU   LDNZH003
LDNZS002 EQU   LDNZH003
LDNZS001 EQU   LDNZH003
@NM00178 EQU   LDNZH003
LDNZFBUF EQU   @NM00177+12
LDNZV006 EQU   @NM00177+8
LDNZC001 EQU   @NM00177
@NM00176 EQU   @NM00171+3
@NM00175 EQU   @NM00171+2
@NM00174 EQU   @NM00173
LDNZF001 EQU   LDNCLREC
LDNCLOSD EQU   @NM00173
@NM00172 EQU   LDNUFLAG
LDNUIOEM EQU   LDNUFLAG
LDNUDELR EQU   LDNUFLAG
LDNUINOP EQU   LDNUFLAG
LDNUDISC EQU   LDNUFLAG
@NM00093 EQU   PABXTNSN+12
PABNPSSQ EQU   PABXTNSN+8
PABLOCK  EQU   PABXTNSN+4
PABLAST  EQU   PABXTNSN
IOSPCIWA EQU   IOSPCISC+44
IOSPCIRS EQU   IOSPCISC+8
@NM00089 EQU   IOSPCISC+4
@NM00088 EQU   IOSPCISC
IOSWRNDR EQU   IOSWTOWA+4
IOSWTOPT EQU   IOSWTOWA+3
IOSWTOCP EQU   IOSWTOWA+2
IOSWTOCH EQU   IOSWTOWA
IOSATTWA EQU   IOSATTSC+40
@NM00087 EQU   IOSATTSC+24
IOSATTSN EQU   IOSATTSC
IOBSKSS  EQU   IOBSKADR+3
IOBSK0   EQU   IOBSKADR+2
IOBSKTT  EQU   IOBSKADR+1
IOBSKRV  EQU   IOBSKADR
IOBCSWSV EQU   IOBORG11+17
IOBSENSV EQU   IOBORG11+16
IOBRCD   EQU   IOBORG11+12
IOBMDREC EQU   IOBORG11+8
IOBNAMEA EQU   IOBNAME+1
IOBNAMSZ EQU   IOBNAME
IOBERCTA EQU   IOBERCT+1
IOBRTYPE EQU   IOBUCBXV
IOBRDCHP EQU   IOBORG10+20
IOBNEXTA EQU   IOBORG10+16
IOBREADA EQU   IOBORG10+12
IOBBUFC  EQU   IOBORG10+8
IOBSK2R  EQU   IOBSEEK2+7
IOBSK2HH EQU   IOBSEEK2+5
IOBSK2CC EQU   IOBSEEK2+3
IOBSK2BB EQU   IOBSEEK2+1
IOBSK2M  EQU   IOBSEEK2
IOBCHNPR EQU   IOBORG09+40
IOBDNCRF EQU   IOBORG09+32
IOBRSV35 EQU   IOBORG09+24
IOBDQPTR EQU   IOBORG09+20
IOBRSV34 EQU   IOBORG09+18
IOBDBYTN EQU   IOBORG09+16
IOBDCPND EQU   IOBORG09+12
IOBSTAT2 EQU   IOBDSTAT+1
IOBSIORT EQU   IOBSTAT1
IOBADDVU EQU   IOBSTAT1
IOBBUFF  EQU   IOBSTAT1
IOBENQUE EQU   IOBSTAT1
IOBPASS2 EQU   IOBSTAT1
IOBSYNCH EQU   IOBSTAT1
IOBNEWVL EQU   IOBSTAT1
IOBABNRM EQU   IOBSTAT1
IOBRELEX EQU   IOBDTYP2
IOBADDTY EQU   IOBDTYP2
IOBTYPE  EQU   IOBDTYP2
IOBRQUST EQU   IOBDTYP2
IOBSUFFX EQU   IOBDTYP2
IOBSBLKL EQU   IOBDTYP2
IOBSKEY  EQU   IOBDTYP2
IOBRELBL EQU   IOBDTYPE
IOBRDEXC EQU   IOBDTYPE
IOBDYNBF EQU   IOBDTYPE
IOBACTAD EQU   IOBDTYPE
IOBFDBCK EQU   IOBDTYPE
IOBEXTSC EQU   IOBDTYPE
IOBOVFLO EQU   IOBDTYPE
IOBVERFY EQU   IOBDTYPE
IOBDPLB  EQU   IOBDPLAD+1
IOBDAYLI EQU   IOBDPLAD
IOBDIOBS EQU   IOBORG09+2
IOBDBYTR EQU   IOBORG09
IOBBCHAD EQU   IOBORG08+12
IOBFCHNB EQU   IOBFCHAD+1
IOBCOUNT EQU   IOBFCHAD
IOBASYN  EQU   IOBORG08+7
IOBAPP   EQU   IOBORG08+6
IOBRSV32 EQU   IOBUNSQR
IOBRSV31 EQU   IOBUNSQR
IOBRSV30 EQU   IOBUNSQR
IOBKNRWR EQU   IOBUNSQR
IOBKNWR  EQU   IOBUNSQR
IOBNTAV2 EQU   IOBUNSQR
IOBNTAV1 EQU   IOBUNSQR
IOBCPBSY EQU   IOBUNSQR
IOBCHNNL EQU   IOBINDCT
IOBRSV29 EQU   IOBINDCT
IOBRSV28 EQU   IOBINDCT
IOBRSV27 EQU   IOBINDCT
IOBKEYAD EQU   IOBINDCT
IOBOVPTR EQU   IOBINDCT
IOBUNSCH EQU   IOBINDCT
IOBDEQCP EQU   IOBINDCT
IOBCCWAD EQU   IOBORG08
W1OEXTEN EQU   W1IEXTEN
IOBCCW   EQU   IOBORG06+8
IOBNXTPB EQU   IOBNXTPT+1
IOBRSV26 EQU   IOBSTATA
IOBRSV25 EQU   IOBSTATA
IOBRSV24 EQU   IOBSTATA
IOBRSV23 EQU   IOBSTATA
IOBRSV22 EQU   IOBSTATA
IOBRSV21 EQU   IOBSTATA
IOBRSV20 EQU   IOBSTATA
IOBAVLFL EQU   IOBSTATA
IOBRSV37 EQU   IOBORG06+1
IOBUCBXG EQU   IOBORG06
IOBCPA   EQU   IOBORG05+32
IOBERINF EQU   IOBORG05+16
IOBERCCW EQU   IOBORG05+8
IOBSNDPT EQU   IOBORG05+7
IOBRCVPT EQU   IOBORG05+6
IOBWORK  EQU   IOBORG05+1
IOBUCBX  EQU   IOBORG05
IOBR     EQU   IOBSEEK+7
IOBHH2   EQU   IOBHH+1
IOBHH1   EQU   IOBHH
IOBCC2   EQU   IOBCC+1
IOBCC1   EQU   IOBCC
IOBBB2   EQU   IOBBB+1
IOBBB1   EQU   IOBBB
IOBM     EQU   IOBSEEK
IOBRSV46 EQU   IOBFL4
IOBRSV47 EQU   IOBFL4
IOBENT   EQU   IOBFL4
IOBEQP   EQU   IOBFL4
IOBBUS   EQU   IOBFL4
IOBDCK   EQU   IOBFL4
IOBREJ   EQU   IOBFL4
IOBOVR   EQU   IOBFL4
IOBCRILC EQU   IOBORG04+1
IOBCRDCC EQU   IOBORG04
IOBGQECB EQU   IOBORG03
IOBSWAP  EQU   IOBORG02+4
IOBDQADB EQU   IOBDQADA+1
IOBRSV13 EQU   IOBDEQIN
IOBRSV12 EQU   IOBDEQIN
IOBRSV11 EQU   IOBDEQIN
IOBRSV10 EQU   IOBDEQIN
IOBRSV09 EQU   IOBDEQIN
IOBRSV08 EQU   IOBDEQIN
IOBRSV07 EQU   IOBDEQIN
IOBDEQ   EQU   IOBDEQIN
IOBNECB  EQU   IOBORG01+4
IOBNIOBB EQU   IOBNIOBA+1
IOBFIRST EQU   IOBNFLG1
IOBUPERR EQU   IOBNFLG1
IOBSPAN  EQU   IOBNFLG1
IOBBKSPC EQU   IOBNFLG1
IOBUPDAT EQU   IOBNFLG1
IOBREAD  EQU   IOBNFLG1
IOBWRITE EQU   IOBNFLG1
IOBSEGMT EQU   IOBPRTOV
UCBRV066 EQU   UCBOBS09+4
UCBIOSBA EQU   UCBOBS09
UCBRV042 EQU   UCBOBS08+5
UCBRV082 EQU   UCBCTCF1
UCBRV081 EQU   UCBCTCF1
UCBRV080 EQU   UCBCTCF1
UCBRV079 EQU   UCBCTCF1
UCBRV078 EQU   UCBCTCF1
UCBRV077 EQU   UCBCTCF1
UCBRV076 EQU   UCBCTCF1
UCBCTC80 EQU   UCBCTCF1
UCBCTCAL EQU   UCBCTCAD
UCBRV040 EQU   UCBOBS07
UCBCTLNA EQU   UCBCTLNK+1
UCBRLN   EQU   UCBCTLNK
UCBRDYQA EQU   UCBLDNCB
UCBINRLN EQU   UCBIRLN
UCBIRBA  EQU   UCBIRB+1
UCBRV039 EQU   UCBGRAF
UCBDWNR  EQU   UCBGRAF
UCBRPND  EQU   UCBGRAF
UCBUPM   EQU   UCBGRAF
UCBBTAM  EQU   UCBGRAF
UCBDRNO  EQU   UCBGRAF
UCBDRO   EQU   UCBGRAF
UCBOIP   EQU   UCBGRAF
UCBATRCD EQU   @NM00079
UCBSKPFG EQU   @NM00079
UCBRIPND EQU   @NM00079
UCBRTIAC EQU   @NM00079
UCBRSV79 EQU   @NM00079
UCBRSV78 EQU   @NM00079
UCBRSV77 EQU   @NM00079
UCBOLTEP EQU   @NM00079
UCBATNCT EQU   UCBOBS06+2
UCBRSV76 EQU   UCBAOF2
UCBRSV75 EQU   UCBAOF2
UCBRSV74 EQU   UCBAOF2
UCBRSV73 EQU   UCBAOF2
UCBRSV72 EQU   UCBAOF2
UCBRSV71 EQU   UCBAOF2
UCBRSV70 EQU   UCBAOF2
UCBRSV69 EQU   UCBAOF2
UCBRSV68 EQU   UCBAOF1
UCBRSV67 EQU   UCBAOF1
UCBRSV66 EQU   UCBAOF1
UCBRSV65 EQU   UCBAOF1
UCBRSV64 EQU   UCBAOF1
UCBOFNL  EQU   UCBAOF1
UCBOFSP  EQU   UCBAOF1
UCBOFMCR EQU   UCBAOF1
UCBBTB   EQU   UCBBTA+1
UCBDI    EQU   UCBBTA
UCBSNS   EQU   UCBOBS04+8
UCBTEB   EQU   UCBOBS04+4
UCBGCB   EQU   UCBOBS04+3
UCBOPEN  EQU   UCBOBS04+2
UCBSTART EQU   UCBOBS04
UCBXTNB  EQU   UCBXTN+1
UCBRSV22 EQU   UCBVOPT
UCBRSV21 EQU   UCBVOPT
UCBRSV20 EQU   UCBVOPT
UCBESVE  EQU   UCBVOPT
UCBERPC  EQU   UCBVOPT
UCBESVC  EQU   UCBVOPT
UCBEVA   EQU   UCBVOPT
UCBESV   EQU   UCBVOPT
UCBRV009 EQU   UCBTFL1
UCBRV008 EQU   UCBTFL1
UCBRV007 EQU   UCBTFL1
UCBRV006 EQU   UCBTFL1
UCBRV005 EQU   UCBTFL1
UCBRV038 EQU   UCBTFL1
UCBNSLTP EQU   UCBTFL1
UCBNLTP  EQU   UCBTFL1
UCBRES1B EQU   UCBOBS02+18
UCBFSER  EQU   UCBOBS02+12
@NM00078 EQU   UCBOBS02+4
UCBFSEQ  EQU   UCBOBS02+2
UCBFSCT  EQU   UCBOBS02
UCBNEXP  EQU   UCBOBS01+20
UCBBASE  EQU   UCBOBS01+16
UCBRES1A EQU   UCBOBS01+15
UCBUSER  EQU   UCBOBS01+14
UCBFL47  EQU   UCBFL4
UCBFL46  EQU   UCBFL4
UCBFL45  EQU   UCBFL4
UCBRV065 EQU   UCBFL4
UCBDSS   EQU   UCBFL4
UCBRV028 EQU   UCBFL4
UCBWDAV  EQU   UCBFL4
UCBDAVV  EQU   UCBFL4
UCBSQC   EQU   UCBOBS01+12
UCBDATP  EQU   UCBOBS01+12
UCBDMC   EQU   UCBDMCT
UCBMOUNT EQU   UCBDMCT
UCBBNUL  EQU   UCBSTAB
UCBSHAR  EQU   UCBSTAB
UCBBSTR  EQU   UCBSTAB
UCBBPUB  EQU   UCBSTAB
UCBBPRV  EQU   UCBSTAB
UCBBALB  EQU   UCBPRSRS
UCBPGFL  EQU   UCBSTAB
UCBDVSHR EQU   UCBBSVL
UCBVOLI  EQU   UCBOBS01+4
UCBVTOC  EQU   UCBOBS01
CVTRV628 EQU   CVTS01+728
CVTRV627 EQU   CVTS01+724
CVTRV626 EQU   CVTS01+720
CVTRV625 EQU   CVTS01+716
CVTRV624 EQU   CVTS01+712
CVTRV623 EQU   CVTS01+708
CVTRV622 EQU   CVTS01+704
CVTRV621 EQU   CVTS01+700
CVTIHASU EQU   CVTS01+696
CVTSUSP  EQU   CVTS01+692
CVTT6SVC EQU   CVTS01+688
CVTCDAL  EQU   CVTS01+684
CVTTCTL  EQU   CVTS01+680
CVTRSUME EQU   CVTS01+676
CVTJTERM EQU   CVTS01+672
CVTASMRM EQU   CVTS01+668
CVTTCASP EQU   CVTS01+664
CVT0PT03 EQU   CVTS01+660
CVT0PT0E EQU   CVTS01+656
CVTRV609 EQU   CVTS01+652
CVTCGK   EQU   CVTS01+648
CVTRAC   EQU   CVTS01+644
CVTRV606 EQU   CVTS01+640
CVTRV605 EQU   CVTS01+636
CVTRV604 EQU   CVTS01+632
CVTEFF02 EQU   CVTS01+628
CVTCBBR  EQU   CVTS01+624
CVTSSCR  EQU   CVTS01+620
CVTEVENT EQU   CVTS01+616
CVTCRCA  EQU   CVTS01+612
CVTTPIO  EQU   CVTS01+608
CVTADV   EQU   CVTS01+604
CVTGSDAB EQU   CVTGSDA
CVTQV3   EQU   CVTS01+596
CVTQV2   EQU   CVTS01+592
CVTQV1   EQU   CVTS01+588
CVTRPT   EQU   CVTS01+584
CVTSSRB  EQU   CVTS01+580
CVTCSDRL EQU   CVTS01+576
CVTEXP1  EQU   CVTS01+572
CVTRMPMT EQU   CVTS01+568
CVTRMPTT EQU   CVTS01+564
CVTVPSA  EQU   CVTS01+560
CVTVSTOP EQU   CVTS01+556
CVTGTFR8 EQU   CVTS01+552
CVTQUIT  EQU   CVTS01+548
CVTVACR  EQU   CVTS01+544
CVTWTCB  EQU   CVTS01+540
CVTSTPRS EQU   CVTS01+536
CVT0PT02 EQU   CVTS01+532
CVTDARCM EQU   CVTS01+528
CVTIRECM EQU   CVTS01+524
CVTJRECM EQU   CVTS01+520
CVTVEMS0 EQU   CVTS01+516
CVTSPFRR EQU   CVTS01+512
CVTRLSTG EQU   CVTS01+508
CVT0TC0A EQU   CVTS01+504
CVTGMBR  EQU   CVTS01+500
CVTLFRM  EQU   CVTS01+496
CVTRMBR  EQU   CVTS01+492
CVTVIOP  EQU   CVTS01+488
CVTRV307 EQU   CVTS01+486
CVTRV306 EQU   CVTS01+484
CVTRV305 EQU   CVTS01+482
CVTRV304 EQU   CVTS01+480
CVTRV303 EQU   CVTS01+478
CVTRV302 EQU   CVTS01+476
CVTTRCA  EQU   CVTS01+472
CVTRV297 EQU   CVTRV289
CVTRV296 EQU   CVTRV289
CVTRV295 EQU   CVTRV289
CVTRV294 EQU   CVTRV289
CVTRV293 EQU   CVTRV289
CVTRV292 EQU   CVTRV289
CVTRV291 EQU   CVTRV289
CVTRV290 EQU   CVTRV289
CVTRV288 EQU   CVTRV280
CVTRV287 EQU   CVTRV280
CVTRV286 EQU   CVTRV280
CVTRV285 EQU   CVTRV280
CVTRV284 EQU   CVTRV280
CVTRV283 EQU   CVTRV280
CVTRV282 EQU   CVTRV280
CVTRV281 EQU   CVTRV280
CVTRV279 EQU   CVTRV271
CVTRV278 EQU   CVTRV271
CVTRV277 EQU   CVTRV271
CVTRV276 EQU   CVTRV271
CVTRV275 EQU   CVTRV271
CVTRV274 EQU   CVTRV271
CVTRV273 EQU   CVTRV271
CVTRV272 EQU   CVTRV271
CVTRV270 EQU   CVTRV262
CVTRV269 EQU   CVTRV262
CVTRV268 EQU   CVTRV262
CVTRV267 EQU   CVTRV262
CVTRV266 EQU   CVTRV262
CVTRV265 EQU   CVTRV262
CVTRV264 EQU   CVTRV262
CVTRV263 EQU   CVTRV262
CVTVFP   EQU   CVTS01+464
CVTVSI   EQU   CVTS01+460
CVTVPSIB EQU   CVTS01+456
CVTMFACT EQU   CVTMFRTR
CVTMFCTL EQU   CVTS01+448
CVTPVBP  EQU   CVTS01+444
CVTPWI   EQU   CVTS01+440
CVTRV254 EQU   CVTS01+438
CVTRV253 EQU   CVTS01+436
CVTRV252 EQU   CVTS01+434
CVTRV251 EQU   CVTS01+433
CVTRV250 EQU   CVTS01+432
CVTRV249 EQU   CVTS01+431
CVTRV248 EQU   CVTS01+430
CVTRV247 EQU   CVTS01+429
CVTRV246 EQU   CVTS01+428
CVTRV245 EQU   CVTRV237
CVTRV244 EQU   CVTRV237
CVTRV243 EQU   CVTRV237
CVTRV242 EQU   CVTRV237
CVTRV241 EQU   CVTRV237
CVTRV240 EQU   CVTRV237
CVTRV239 EQU   CVTRV237
CVTRV238 EQU   CVTRV237
CVTRV236 EQU   CVTRV228
CVTRV235 EQU   CVTRV228
CVTRV234 EQU   CVTRV228
CVTRV233 EQU   CVTRV228
CVTRV232 EQU   CVTRV228
CVTRV231 EQU   CVTRV228
CVTRV230 EQU   CVTRV228
CVTRV229 EQU   CVTRV228
CVTRV227 EQU   CVTRV219
CVTRV226 EQU   CVTRV219
CVTRV225 EQU   CVTRV219
CVTRV224 EQU   CVTRV219
CVTRV223 EQU   CVTRV219
CVTRV222 EQU   CVTRV219
CVTRV221 EQU   CVTRV219
CVTRV220 EQU   CVTRV219
CVTRV218 EQU   CVTRV210
CVTRV217 EQU   CVTRV210
CVTRV216 EQU   CVTRV210
CVTRV215 EQU   CVTRV210
CVTRV214 EQU   CVTRV210
CVTRV213 EQU   CVTRV210
CVTRV212 EQU   CVTRV210
CVTRV211 EQU   CVTRV210
CVTLCCAT EQU   CVTS01+420
CVTPCCAT EQU   CVTS01+416
CVTIPCRP EQU   CVTS01+412
CVTIPCRI EQU   CVTS01+408
CVTIPCDS EQU   CVTS01+404
CVTAIDVT EQU   CVTS01+400
CVTSSAP  EQU   CVTS01+396
CVTEHCIR EQU   CVTS01+392
CVTEHDEF EQU   CVTS01+388
CVTDAIR  EQU   CVTS01+384
CVTPERFM EQU   CVTS01+380
CVT044R2 EQU   CVTS01+376
CVTFETCH EQU   CVTS01+372
CVTRSTWD EQU   CVTS01+368
CVTSPOST EQU   CVTS01+364
CVTIOBP  EQU   CVTS01+360
CVTASMVT EQU   CVTS01+356
CVTRECRQ EQU   CVTS01+352
CVTWSAC  EQU   CVTS01+348
CVTRV149 EQU   CVTS01+344
CVTWSAL  EQU   CVTS01+340
CVTSPSA  EQU   CVTS01+336
CVTGLMN  EQU   CVTS01+332
CVTVEAC0 EQU   CVTS01+328
CVT062R1 EQU   CVTS01+324
CVTRPOST EQU   CVTS01+320
CVTDQIQE EQU   CVTS01+316
CVTCSD   EQU   CVTS01+312
CVTLKRMA EQU   CVTS01+308
CVTRSPIE EQU   CVTS01+304
CVTRENQ  EQU   CVTS01+300
CVTLQCB  EQU   CVTS01+296
CVTFQCB  EQU   CVTS01+292
CVTQCS01 EQU   CVTS01+288
CVTAPFT  EQU   CVTS01+284
CVTPARRL EQU   CVTS01+280
CVTVWAIT EQU   CVTS01+276
CVTGSPL  EQU   CVTS01+272
CVTLSMQ  EQU   CVTS01+268
CVTGSMQ  EQU   CVTS01+264
CVTEXPRO EQU   CVTS01+260
CVTOPCTP EQU   CVTS01+256
CVTSIC   EQU   CVTS01+252
CVTTPIOS EQU   CVTS01+248
CVTRTMS  EQU   CVTS01+244
CVTSCBP  EQU   CVTS01+236
CVTSV60  EQU   CVTS01+228
CVTRTMCT EQU   CVTS01+224
CVTASCBL EQU   CVTS01+220
CVTASCBH EQU   CVTS01+216
CVTGDA   EQU   CVTS01+212
CVTASVT  EQU   CVTS01+208
CVTVVMDI EQU   CVTS01+204
CVTAQTOP EQU   CVTS01+200
CVTIOSCS EQU   CVTS01+196
CVTSDRM  EQU   CVTS01+192
CVTOPTE  EQU   CVTS01+188
CVTSTXU  EQU   CVTS01+184
CVTQUIS  EQU   CVTS01+180
CVTPARS  EQU   CVTS01+176
CVTS1EE  EQU   CVTS01+172
CVTFRAS  EQU   CVTS01+168
CVTQSAS  EQU   CVTS01+164
CVTCRAS  EQU   CVTS01+160
CVTCRMN  EQU   CVTS01+156
CVTDELCP EQU   CVTS01+152
CVTFRECL EQU   CVTS01+148
CVTGETCL EQU   CVTS01+144
CVTBLDCP EQU   CVTS01+140
CVTAUTHL EQU   CVTS01+136
CVTSCAN  EQU   CVTS01+132
CVTRV144 EQU   CVTS01+130
CVTMAXMP EQU   CVTS01+128
CVTSTCK  EQU   CVTS01+124
CVTRV139 EQU   CVTS01+123
CVTDSSAC EQU   CVTS01+122
CVTRV513 EQU   CVTS01+121
CVTIOSPL EQU   CVTS01+120
CVTPTGT  EQU   CVTS01+116
CVTCSPIE EQU   CVTS01+112
CVTSMFEX EQU   CVTS01+108
CVTOLT0A EQU   CVTS01+104
CVTSRBRT EQU   CVTS01+100
CVTPUTL  EQU   CVTS01+96
CVTASCRL EQU   CVTS01+92
CVTASCRF EQU   CVTS01+88
CVTRV326 EQU   CVTS01+84
CVTRV325 EQU   CVTS01+80
CVTRV324 EQU   CVTS01+76
CVT0VL01 EQU   CVTS01+72
CVTSHRVM EQU   CVTS01+68
CVTRV332 EQU   CVTS01+64
CVTTAS   EQU   CVTS01+60
CVTRSCN  EQU   CVTS01+56
CVTTRAC2 EQU   CVTS01+54
CVTTRACE EQU   CVTS01+52
CVTAPG   EQU   CVTS01+51
CVTSDTRC EQU   CVTCTLFG
CVTGTRCE EQU   CVTCTLFG
CVTNOMP  EQU   CVTCTLFG
CVTRSV79 EQU   CVTCTLFG
CVTDSTAT EQU   CVTCTLFG
CVTRSV78 EQU   CVTCTLFG
CVTRV333 EQU   CVTCTLFG
CVTRV323 EQU   CVTCTLFG
CVTSPVLK EQU   CVTS01+49
CVTRSV77 EQU   CVTS01+48
CVTRV331 EQU   CVTS01+44
CVTRV330 EQU   CVTS01+40
CVTRV329 EQU   CVTS01+36
CVTRV328 EQU   CVTS01+32
CVTRV322 EQU   CVTS01+28
CVTSLID  EQU   CVTSLIDA+1
CVTSYLK  EQU   CVTSLIDA
CVTRV321 EQU   CVTS01+20
CVTRV320 EQU   CVTS01+16
CVTLPDIR EQU   CVTLPDIA+1
CVTRSV69 EQU   CVTDIRST
CVTRSV68 EQU   CVTDIRST
CVTRSV67 EQU   CVTDIRST
CVTRSV66 EQU   CVTDIRST
CVTRSV65 EQU   CVTDIRST
CVTRSV64 EQU   CVTDIRST
CVTRSV63 EQU   CVTDIRST
CVTDICOM EQU   CVTDIRST
CVTPVTP  EQU   CVTS01+8
CVTLPDSR EQU   CVTS01+4
CVTGETL  EQU   CVTS01
PSARSAV  EQU   PSARSVTE+60
PSARSTK  EQU   PSARSVTE+56
PSAESAV3 EQU   PSARSVTE+52
PSAESTK3 EQU   PSARSVTE+48
PSAESAV2 EQU   PSARSVTE+44
PSAESTK2 EQU   PSARSVTE+40
PSAESAV1 EQU   PSARSVTE+36
PSAESTK1 EQU   PSARSVTE+32
PSAPSAV  EQU   PSARSVTE+28
PSAPSTK  EQU   PSARSVTE+24
PSAMSAV  EQU   PSARSVTE+20
PSAMSTK  EQU   PSARSVTE+16
PSASSAV  EQU   PSARSVTE+12
PSASSTK  EQU   PSARSVTE+8
PSANSTK  EQU   PSARSVTE+4
WORD1    EQU   DWORD0+4
ZSAF19IO EQU   ISTZ19SV+12
ZSAF19RD EQU   ISTZ19SV+8
ZSAF19R1 EQU   ISTZ19SV+4
ZSAF19RV EQU   ISTZ19SV+1
ZSAFRSVS EQU   ZSAF19FG
ZSAFLOCK EQU   ZSAF19FG
ZSAFSV19 EQU   ISTZFSAV+40
ZSAFSVR2 EQU   ISTZFSAV+36
ZSAFSVVR EQU   ISTZFSAV+12
ZSAFSVRR EQU   ISTZFSAV+8
ZSAFSVFC EQU   ISTZFSAV+4
ZSAFSVBC EQU   ISTZFSAV
@NM00199 EQU   ICNSYSUA+232
ICNSRB   EQU   ICNSYSUA+188
ICNIOSB  EQU   ICNDCDEB+64
ICNDEBAD EQU   ICNDIDEB+1
ICNDCBIF EQU   ICNDIDEB
ICNUCBAD EQU   ICNDCDEB+32
ICNAPPAD EQU   ICNDCDEB+29
ICNEXSCL EQU   ICNDCDEB+28
ICNDCBAD EQU   ICNDCDEB+25
ICNDEBID EQU   ICNDCDEB+24
@NM00198 EQU   ICNDCDEB
ICNERPWA EQU   ICNSYSUA+8
ICNCNTRL EQU   ICNSYSUA+4
ICNCKPAB EQU   ICNCKFLD+1
@NM00197 EQU   ICNCKFLD
ICNCKBIT EQU   ICNCKFLD
ICNLNKMD EQU   ICNDEVCA+100
ICNMSIZE EQU   ICNDEVCA+88
@NM00196 EQU   ICNFLAG2+3
@NM00195 EQU   ICNFLAG2+2
@NM00194 EQU   ICNFLAG2+1
@NM00193 EQU   @NM00192
ICNLCLUS EQU   @NM00192
ICNPATHO EQU   ICNDEVCA+76
ICNPATHI EQU   ICNDEVCA+72
ICNBUFNO EQU   ICNBUFFQ+4
ICNBUFQH EQU   ICNBUFFQ
ICNPNDQT EQU   ICNPENDQ+4
ICNPNDQH EQU   ICNPENDQ
ICNWBCCW EQU   ICNDEVCA+16
ICNLOCK  EQU   ICNDLCIA+20
ICNSIB   EQU   ICNDLCIA+16
@NM00191 EQU   ICNSTS+1
@NM00190 EQU   @NM00189
ICNPOSTF EQU   @NM00189
ICNERROR EQU   @NM00189
ICNBUSYF EQU   @NM00189
ICNREADY EQU   @NM00189
@NM00188 EQU   @NM00187
ICNDTREJ EQU   @NM00187
ICNDLCHK EQU   @NM00187
ICNABORT EQU   @NM00186
ICNIPLRQ EQU   @NM00186
ICNSN02  EQU   ICNOVRUN
ICNSN01  EQU   ICNDTCHK
ICNEQCHK EQU   @NM00186
ICNBOCHK EQU   @NM00186
ICNINTRQ EQU   @NM00186
ICNCMDRJ EQU   @NM00186
ICNCAW   EQU   ICNDLCIA+8
ICNCSW   EQU   ICNDLCIA
@NM00185 EQU   ISTICNCB+102
ICNPUNA  EQU   ISTICNCB+100
ICNUSECT EQU   ISTICNCB+96
ICNPCPAB EQU   ISTICNCB+64
ICNUFPAB EQU   ISTICNCB+48
ICNCB    EQU   ISTICNCB
@NM00170 EQU   LDNSYSUA+232
LDNSRB   EQU   LDNSYSUA+188
LDNIOSB  EQU   LDNDCDEB+64
LDNDEBAD EQU   LDNDIDEB+1
LDNDCBIF EQU   LDNDIDEB
LDNUCBAD EQU   LDNDCDEB+32
LDNAPPAD EQU   LDNDCDEB+29
LDNEXSCL EQU   LDNDCDEB+28
LDNDCBAD EQU   LDNDCDEB+25
LDNDEBID EQU   LDNDCDEB+24
@NM00169 EQU   LDNDCDEB
LDNERPWA EQU   LDNSYSUA+8
LDNCNTRL EQU   LDNSYSUA+4
LDNTCCW  EQU   LDNSYSUA
@NM00168 EQU   LDNFLAG2+3
@NM00167 EQU   LDNFLAG2+2
@NM00166 EQU   @NM00165
LDNMSEL  EQU   @NM00165
LDNISESS EQU   @NM00165
LDNZATTP EQU   LDNRDREQ
@NM00164 EQU   @NM00163
LDNPURGE EQU   @NM00163
LDNRESET EQU   @NM00163
LDNZF006 EQU   LDNTMIND
LDNLOSTS EQU   @NM00163
LDNPLOCK EQU   @NM00163
LDNLLOCK EQU   @NM00163
LDNAPLNA EQU   LDNDEVCA+46
LDNRBLEN EQU   LDNDEVCA+40
LDNACREQ EQU   LDNDEVCA+32
LDNBUFRQ EQU   LDNBUFFQ+6
LDNBUFNO EQU   LDNBUFFQ+4
LDNBUFQH EQU   LDNBUFFQ
LDNPNDQT EQU   LDNPENDQ+4
LDNPNDQH EQU   LDNPENDQ
LDNTICCW EQU   LDNDEVCA+8
LDNSLCCW EQU   LDNDEVCA
LDNLOCK  EQU   LDNDLCIA+20
LDNSIB   EQU   LDNDLCIA+16
@NM00162 EQU   LDNSTS+1
@NM00161 EQU   @NM00160
LDNPOSTF EQU   @NM00160
LDNERROR EQU   @NM00160
LDNBUSYF EQU   @NM00160
LDNREADY EQU   @NM00160
@NM00159 EQU   LDNSENSE+1
LDNOPCHK EQU   @NM00158
LDNCTCHK EQU   @NM00158
LDNUNSPY EQU   @NM00158
LDNDTCHK EQU   @NM00158
LDNEQCHK EQU   @NM00158
LDNBOCHK EQU   @NM00158
LDNINTRQ EQU   @NM00158
LDNCMDRJ EQU   @NM00158
LDNCSW   EQU   LDNDLCIA
@NM00157 EQU   ISTLDNCB+102
LDNPUNA  EQU   ISTLDNCB+100
LDNUSECT EQU   ISTLDNCB+96
LDNPCPAB EQU   ISTLDNCB+64
LDNUFPAB EQU   ISTLDNCB+48
LDNCB    EQU   ISTLDNCB
NCBRSV01 EQU   ISTNCB+46
NCBSWDAF EQU   ISTNCB+44
NCBDEVCH EQU   ISTNCB+36
NCBFMCBP EQU   ISTNCB+32
NCBLTRC  EQU   ISTNCB+30
@NM00156 EQU   ISTNCB+29
@NM00155 EQU   NCBEXFLG
@NM00154 EQU   NCBEXFLG
@NM00153 EQU   NCBEXFLG
@NM00152 EQU   NCBEXFLG
NCBEXSDA EQU   NCBEXFLG
NCBEXSNO EQU   NCBEXFLG
NCBEXAIL EQU   NCBEXFLG
NCBEXAIC EQU   NCBEXFLG
NCBNMLLN EQU   NCBFLAGS+3
@NM00151 EQU   NCBFLAG1
NCBUEXIT EQU   NCBFLAG1
NCBFORCE EQU   NCBFLAG1
NCBTTF   EQU   NCBFLAG1
NCBRSYNC EQU   NCBFLAG1
NCBRSTRT EQU   NCBFLAG1
NCBCONF  EQU   NCBFLAG1
NCBSNAI  EQU   NCBFLAG1
NCBFLTIO EQU   NCBFTRIO
NCBCSTAT EQU   NCBFLAGS
NCBNCSL  EQU   ISTNCB+22
NCBNCBA  EQU   ISTNCB+20
NCBFMCBA EQU   ISTNCB+16
NCBNSNA  EQU   ISTNCB+12
NCBTSKID EQU   ISTNCB+8
NCBRDTE  EQU   ISTNCB+4
NCBDAF   EQU   ISTNCB+2
NCBLNGTH EQU   ISTNCB+1
NCBTYPE  EQU   ISTNCB
CCWCOUNT EQU   ISTCCW+6
CCWSPRSV EQU   CCWSPARE
CCWCFTX  EQU   CCWSPARE
CCWTRCE  EQU   CCWSPARE
CCWNULL  EQU   CCWFLAGS
CCWPCI   EQU   CCWFLAGS
CCWSKIP  EQU   CCWFLAGS
CCWSLI   EQU   CCWFLAGS
CCWCC    EQU   CCWFLAGS
CCWCD    EQU   CCWFLAGS
CCWADDR  EQU   CCWVADDR+1
CCWCODE  EQU   CCWVADDR
DEVRSV01 EQU   ISTDEVCH+7
DEVAUXTP EQU   ISTDEVCH+6
DEVADVFE EQU   DEVMODE
@NM00150 EQU   DEVMODE
DEVBASIC EQU   DEVMODE
DEVREC   EQU   DEVMODE
DEVPHYSA EQU   ISTDEVCH+4
DEVCSLPN EQU   DEVCHAR3
DEVCSTCL EQU   DEVCHAR3
DEVCCHEK EQU   DEVCHAR3
DEVCATTN EQU   DEVCHAR3
DEVCSWL  EQU   DEVFCCTL
DEVCRVB  EQU   DEVFCCTL
DEVCSSL  EQU   DEVFCCTL
DEVCBSC  EQU   DEVFCCTL
DEVMCODE EQU   ISTDEVCH+2
DEVCHAR2 EQU   DEVTCODE
DEVSPOLL EQU   DEVCHAR
DEVCCTL  EQU   DEVCHAR
DEVNNSPT EQU   DEVCHAR
DEVSPS   EQU   DEVCHAR
DEVSUBND EQU   DEVCHAR
DEVCONVR EQU   DEVCHAR
DEVOTPUT EQU   DEVCHAR
DEVINPUT EQU   DEVCHAR
ISTRETR7 EQU   ISTRETRG+4
ISTRETR6 EQU   ISTRETRG
ISTRSV01 EQU   ISTAVT+42
ISTPDAVP EQU   ISTAVT+38
ISTVTTP  EQU   ISTAVT+36
ISTAGTWT EQU   ISTAVT+34
ISTATRT  EQU   ISTAVT+32
ISTARID  EQU   ISTAVT+30
ISTX1    EQU   ISTAVT+29
ISTPHNM  EQU   ISTAVT+24
ISTAPSEX EQU   ISTAVT+20
ISTVTTIK EQU   ISTAVT+18
AVTASID  EQU   ISTAVT+16
ISTAPSTA EQU   ISTAVT+12
ISTAS53  EQU   ISTAVT+8
ISTAS49  EQU   ISTAVT+4
ISTACVT  EQU   ISTAVT
ATCAOS   EQU   ISTATCVT+1868
@NM00149 EQU   ISTATCVT+1860
@NM00148 EQU   ISTATCVT+1852
@NM00147 EQU   ISTATCVT+1844
@NM00146 EQU   ISTATCVT+1836
@NM00145 EQU   ISTATCVT+1828
@NM00144 EQU   ISTATCVT+1820
@NM00143 EQU   ISTATCVT+1816
ATCCACSA EQU   ISTATCVT+1812
ATCMXCSA EQU   ISTATCVT+1808
ATCTPMPB EQU   ISTATCVT+1776
ATCTRMPB EQU   ISTATCVT+1744
ATCRPLAC EQU   ATCRPLCN+2
ATCRPLRC EQU   ATCRPLCN
ATCCRPLQ EQU   ATCCRPL
ATCSRBAC EQU   ATCSRBCN+2
ATCSRBRC EQU   ATCSRBCN
ATCSRBQ  EQU   ATCSRB
ATCCRAAC EQU   ATCCRACN+2
ATCCRARC EQU   ATCCRACN
ATCCRAQ  EQU   ATCCRA
ATCLUFFD EQU   ISTATCVT+1716
ATCVIOPM EQU   ISTATCVT+1712
ATCTPMMI EQU   ISTATCVT+1708
ATCPXSRB EQU   ISTATCVT+1704
ATCRPLCT EQU   ISTATCVT+1702
ATCCRACT EQU   ISTATCVT+1700
ATCSRBCT EQU   ISTATCVT+1698
ATCSTNSM EQU   ISTATCVT+1697
@NM00142 EQU   ATCZFLAG
ATCZF001 EQU   ATCZFLAG
ATCTPCP1 EQU   ISTATCVT+1692
ATCTPCP0 EQU   ISTATCVT+1688
ATCZR01  EQU   ISTATCVT+1684
ATCMPLTA EQU   ISTATCVT+1680
ATCASCB  EQU   ISTATCVT+1676
ATCAP86  EQU   ISTATCVT+1672
ATCAP85  EQU   ISTATCVT+1668
ATCAP84  EQU   ISTATCVT+1664
ATCAP83  EQU   ISTATCVT+1660
ATCAP82  EQU   ISTATCVT+1656
ATCAP66  EQU   ISTATCVT+1648
ATCAP62  EQU   ISTATCVT+1644
ATCAPC59 EQU   ISTATCVT+1640
ATCAP56  EQU   ISTATCVT+1636
ATCAP55  EQU   ISTATCVT+1632
ATCAP41  EQU   ISTATCVT+1628
ATCAPC25 EQU   ISTATCVT+1624
ATCAP23  EQU   ISTATCVT+1620
ATCAPBE  EQU   ISTATCVT+1616
ATCPSTA  EQU   ISTATCVT+1612
ATCSMABF EQU   ISTATCVT+1608
ATCSMAPR EQU   ISTATCVT+1604
ATCTPWQA EQU   ISTATCVT+1600
ATCSMAID EQU   ISTATCVT+1596
ATCSMARA EQU   ISTATCVT+1592
ATCCACXA EQU   ISTATCVT+1588
ATCATA10 EQU   ISTATCVT+1584
ATCHLTCB EQU   ISTATCVT+1580
@NM00141 EQU   ATCVTFLG
ATCVTACT EQU   ATCVTFLG
@NM00140 EQU   @NM00139
ATCVTMAB EQU   @NM00139
ATCVTBAM EQU   ISTATCVT+1572
@NM00138 EQU   ISTATCVT+1568
@NM00137 EQU   ISTATCVT+1520
ATCCCOOC EQU   ISTATCVT+1516
@NM00136 EQU   ISTATCVT+1513
ATCSNUF  EQU   ATCENFLG
ATCOPKL  EQU   ATCENFLG
ATCABEN  EQU   ATCENFLG
ATCSRDN  EQU   ATCENFLG
ATCDLDN  EQU   ATCENFLG
ATCTIMER EQU   ISTATCVT+1508
ATCAIWT  EQU   ISTATCVT+1504
ATCOROBT EQU   ISTATCVT+1500
ATCDMAPP EQU   ISTATCVT+1496
ATCZDVTX EQU   ISTATCVT+1492
ATCPXCRA EQU   ISTATCVT+1488
ATCICNCB EQU   ISTATCVT+1484
ATCCMTCB EQU   ISTATCVT+1480
ATCPRPH  EQU   ISTATCVT+1476
ATCGSRBF EQU   ATCGSRBG
ATCSRBRT EQU   ISTATCVT+1468
ATCTSCPC EQU   ISTATCVT+1464
@NM00135 EQU   ISTATCVT+1460
ATCCDTCB EQU   ISTATCVT+1456
ATCORFRL EQU   ISTATCVT+1452
ATCORFPX EQU   ISTATCVT+1448
ATCORFMG EQU   ISTATCVT+1444
ATCSMBQ  EQU   ISTATCVT+1440
ATCINFDD EQU   ISTATCVT+1436
ATCAP67  EQU   ISTATCVT+1432
ATCAP65  EQU   ISTATCVT+1428
ATCAP64  EQU   ISTATCVT+1424
ATCAP63  EQU   ISTATCVT+1420
ATCAP61  EQU   ISTATCVT+1416
ATCAP58  EQU   ISTATCVT+1412
ATCAP57  EQU   ISTATCVT+1408
ATCAP54  EQU   ISTATCVT+1404
ATCAP53  EQU   ISTATCVT+1400
ATCAP52  EQU   ISTATCVT+1396
ATCAP51  EQU   ISTATCVT+1392
ATCAP38  EQU   ISTATCVT+1388
ATCAP37  EQU   ISTATCVT+1384
ATCAP34  EQU   ISTATCVT+1380
ATCAP32  EQU   ISTATCVT+1376
ATCAP31  EQU   ISTATCVT+1372
ATCAP12  EQU   ISTATCVT+1368
ATCAP11  EQU   ISTATCVT+1364
ATCDAPDG EQU   ATCDAPVT+20
ATCDXCEA EQU   ATCDAPVT+16
ATCDCEA  EQU   ATCDAPVT+12
ATCDPCIA EQU   ATCDAPVT+8
ATCDSIOA EQU   ATCDAPVT+4
ATCDEOEA EQU   ATCDAPVT
ATCZAEA  EQU   ATCICAPP+16
ATCZCEA  EQU   ATCICAPP+12
ATCZCPCI EQU   ATCICAPP+8
ATCZSIOA EQU   ATCICAPP+4
ATCCDRPH EQU   ATCICAPP
ATCORQG  EQU   ATCORSRB
ATCORTBF EQU   ATCSQAFR
@NM00134 EQU   ISTATCVT+1308
ATCZLAEA EQU   ATCLDAPP+16
ATCZLCEA EQU   ATCLDAPP+12
ATCZLPCI EQU   ATCLDAPP+8
ATCSMFRR EQU   ATCLDAPP+4
ATCCDTID EQU   ATCLDAPP
@NM00133 EQU   ISTATCVT+1256
ATCZPAB2 EQU   ISTATCVT+1224
@NM00132 EQU   ISTATCVT+1224
@NM00131 EQU   ISTATCVT+1164
ATCCPCFE EQU   ISTATCVT+1160
@NM00130 EQU   ATCRID+2
ATCCDRMA EQU   ATCRID
@NM00129 EQU   ATCSMSDQ+8
@NM00128 EQU   ATCSMSDQ+4
@NM00127 EQU   ATCSMSDQ
ATCSEQNO EQU   ISTATCVT+1136
ATCSMPMD EQU   ISTATCVT+1132
ATCPAREA EQU   ISTATCVT+1128
ATCCPCSM EQU   ISTATCVT+1124
ATCQLOCK EQU   ISTATCVT+1120
ATCITQLE EQU   ISTATCVT+1116
ATCSQCDS EQU   ISTATCVT+1112
ATCUSSVT EQU   ISTATCVT+1108
ATCNOSQ  EQU   ISTATCVT+1104
ATCINCIP EQU   ATCCPDVT+4
ATCTSCNI EQU   ATCCPDVT
ATCMGCRT EQU   ISTATCVT+1092
ATCMACRT EQU   ISTATCVT+1088
ATCCSMT  EQU   ISTATCVT+1084
ATCDRUSL EQU   ISTATCVT+1080
ATCDRULL EQU   ISTATCVT+1076
ATCCFCDR EQU   ISTATCVT+1072
@NM00126 EQU   ISTATCVT+1069
ATCMROUT EQU   ISTATCVT+1060
ATCONFIG EQU   ISTATCVT+1052
ATCNODEL EQU   ISTATCVT+1044
@NM00125 EQU   @NM00124+9
ATCLAST  EQU   ATCSHRFG
ATCSHRTN EQU   @NM00124
@NM00123 EQU   ISTATCVT+1026
ATCNMCTR EQU   ISTATCVT+1024
ATCPOIA  EQU   ATCRNO+1
@NM00122 EQU   ATCRNO
ATCLCLCT EQU   ATCVLCNT+2
ATCRNCNT EQU   ATCVLCNT
ATCHBSIZ EQU   ATCHPGM+2
ATCHBFNO EQU   ATCHPGM
@NM00121 EQU   ISTATCVT+1011
ATCXRANG EQU   ISTATCVT+1010
ATCMAXID EQU   ISTATCVT+1009
ATCMSGSP EQU   ISTATCVT+1008
ATCCIDM  EQU   ISTATCVT+1006
ATCACTRM EQU   ISTATCVT+1004
ATCECTLP EQU   ISTATCVT+1000
ATCECNET EQU   ISTATCVT+996
ATCECOPC EQU   ISTATCVT+992
ATCECSES EQU   ISTATCVT+988
ATCECDSP EQU   ISTATCVT+984
ATCECVRY EQU   ISTATCVT+980
ATCECHLT EQU   ISTATCVT+976
ATCECMOD EQU   ISTATCVT+972
ATCVDLOK EQU   ISTATCVT+968
ATCRDTLK EQU   ISTATCVT+964
ATCVOCLK EQU   ISTATCVT+960
ATCITLIM EQU   ISTATCVT+958
ATCTMINV EQU   ISTATCVT+956
ATCHOSTA EQU   ISTATCVT+954
ATCPUNSA EQU   ISTATCVT+952
ATCSAF   EQU   ISTATCVT+950
ATCVTMID EQU   ATCSSCPA
ATCHCNID EQU   ATCONID+2
ATCSCNID EQU   ATCONID
@NM00120 EQU   ATCBITAN+3
@NM00119 EQU   ATCBITAN+2
@NM00118 EQU   ATCFLAG2
@NM00117 EQU   ATCFLAG2
@NM00116 EQU   ATCFLAG2
ATCCRYPF EQU   ATCFLAG2
ATCTUNCL EQU   ATCFLAG2
ATCTUNRQ EQU   ATCFLAG2
ATCTUNAC EQU   ATCFLAG2
ATCCDLRA EQU   ATCFLAG2
@NM00115 EQU   ATCBITAN
@NM00114 EQU   ATCSTAT4
@NM00113 EQU   ATCSTAT4
@NM00112 EQU   ATCSTAT4
@NM00111 EQU   ATCSTAT4
@NM00110 EQU   ATCSTAT4
ATCPRTAT EQU   ATCSTAT4
ATCNCSD  EQU   ATCSTAT4
ATCMTST  EQU   ATCSTAT4
@NM00109 EQU   ATCPOFLG
@NM00108 EQU   ATCPOFLG
@NM00107 EQU   ATCPOFLG
@NM00106 EQU   ATCPOFLG
@NM00105 EQU   ATCPOFLG
@NM00104 EQU   ATCPOFLG
@NM00103 EQU   ATCPOFLG
ATCPOUNS EQU   ATCPOFLG
@NM00102 EQU   ATCSTAT+1
ATCHIP   EQU   ATCSTAT1
ATCMDHLT EQU   ATCSTAT1
ATCINHLT EQU   ATCSTAT1
ATCNETSL EQU   ATCSTAT1
ATCQKHLT EQU   ATCSTAT1
ATCSNHLT EQU   ATCSTAT1
ATCACTIV EQU   ATCSTAT1
ATCSTART EQU   ATCSTAT1
ATCNOP00 EQU   ISTATCVT+932
ATCTSBUF EQU   ISTATCVT+928
ATCFEPT  EQU   ISTATCVT+924
ATCFDVT  EQU   ISTATCVT+920
ATCCONFT EQU   ISTATCVT+916
ATCRDTH  EQU   ISTATCVT+912
ATCSIBQ  EQU   ISTATCVT+908
ATCHLTMS EQU   ISTATCVT+904
ATCECPRM EQU   ISTATCVT+900
ATCVPARM EQU   ISTATCVT+896
ATCOCHA  EQU   ISTATCVT+892
ATCDSPLQ EQU   ISTATCVT+888
ATCVARYQ EQU   ISTATCVT+884
ATCHALTQ EQU   ISTATCVT+880
ATCMODQ  EQU   ISTATCVT+876
ATCSRT   EQU   ISTATCVT+872
ATCRDT   EQU   ISTATCVT+868
ATCSDVT  EQU   ISTATCVT+864
ATCDLRPT EQU   ISTATCVT+860
ATCBPDA  EQU   ISTATCVT+856
ATCACDA  EQU   ISTATCVT+852
ATCMNT   EQU   ISTATCVT+848
ATCUEP   EQU   ISTATCVT+844
ATCNODDS EQU   ISTATCVT+840
ATCITRT  EQU   ISTATCVT+836
ATCTODVT EQU   ISTATCVT+832
ATCTRCPT EQU   ISTATCVT+828
ATCMODTB EQU   ISTATCVT+824
ATCUSSPT EQU   ISTATCVT+820
ATCTUBUF EQU   ISTATCVT+816
ATCTACB  EQU   ISTATCVT+812
ATCDWA   EQU   ISTATCVT+808
ATCCFCR2 EQU   ATCPODVT
ATCEPA   EQU   ISTATCVT+800
ATCPULQB EQU   @NM00101+16
ATCMCQAB EQU   @NM00101+12
ATCLUSMQ EQU   @NM00101+8
ATCLUIOQ EQU   @NM00101+4
ATCIOLQB EQU   @NM00101
ATCTSCAP EQU   ATCANYDT
ATCTSCCO EQU   ATCLUDVT+4
ATCTSCSR EQU   ATCLUDVT
ATCVTLOD EQU   ISTATCVT+764
ATCTSCLF EQU   ISTATCVT+760
ATCTSCLE EQU   ISTATCVT+756
ATCTSCLB EQU   ISTATCVT+752
ATCTSCLS EQU   ISTATCVT+748
ATCTSCCF EQU   ISTATCVT+744
ATCTSCFV EQU   ISTATCVT+740
ATCTSCCE EQU   ISTATCVT+736
ATCTSCCB EQU   ISTATCVT+732
ATCTSCWS EQU   ISTATCVT+728
ATCTSCEM EQU   ISTATCVT+724
ATCTSCNS EQU   ISTATCVT+720
ATCTSCER EQU   ISTATCVT+716
ATCTSCPR EQU   ISTATCVT+712
ATCTSCGR EQU   ISTATCVT+708
ATCTSCCI EQU   ISTATCVT+704
ATCTSVT  EQU   ISTATCVT+700
ATCDVLOD EQU   ISTATCVT+696
ATCCDCNR EQU   ISTATCVT+692
ATCCDCNF EQU   ISTATCVT+688
ATCCDCND EQU   ISTATCVT+684
ATCCDCNA EQU   ISTATCVT+680
ATCCDCCP EQU   ISTATCVT+676
ATCCDFDN EQU   ISTATCVT+672
ATCCDFIN EQU   ISTATCVT+668
ATCCDFND EQU   ISTATCVT+664
ATCCDDEL EQU   ISTATCVT+660
ATCCDADD EQU   ISTATCVT+656
ATCTCLIM EQU   ISTATCVT+652
ATCRACTR EQU   ISTATCVT+648
ATCRACTI EQU   ISTATCVT+644
ATCREMOV EQU   ISTATCVT+640
ATCRACIO EQU   ISTATCVT+636
ATCADD   EQU   ISTATCVT+632
ATCPUCRT EQU   ISTATCVT+628
ATCSMRS  EQU   ISTATCVT+624
ATCSMRQ  EQU   ISTATCVT+620
ATCORCPX EQU   ISTATCVT+616
ATCORCAF EQU   ISTATCVT+612
ATCFRSTR EQU   ATCGTSTR
ATCSTMA  EQU   ISTATCVT+604
ATCSRTAD EQU   ISTATCVT+600
ATCOCRT  EQU   ISTATCVT+596
ATCOCCFS EQU   ISTATCVT+592
ATCOCCFP EQU   ISTATCVT+588
ATCSRTDF EQU   ISTATCVT+584
ATCLUCRT EQU   ISTATCVT+580
ATCINCY5 EQU   ISTATCVT+576
ATCINCW3 EQU   ISTATCVT+572
ATCINCU6 EQU   ISTATCVT+568
ATCINCTQ EQU   ISTATCVT+564
ATCINCS1 EQU   ISTATCVT+560
ATCSRTAB EQU   ISTATCVT+556
ATCINCRD EQU   ISTATCVT+552
ATCINCPH EQU   ISTATCVT+548
ATCINCLQ EQU   ISTATCVT+544
ATCNOCRT EQU   ISTATCVT+540
ATCINCF1 EQU   ISTATCVT+536
ATCINCCI EQU   ISTATCVT+532
ATCINCCO EQU   ISTATCVT+528
ATCBLDLA EQU   ISTATCVT+524
ATCALOAD EQU   ISTATCVT+520
ATCADEL  EQU   ISTATCVT+516
ATCESC02 EQU   ISTATCVT+512
ATCESC01 EQU   ISTATCVT+508
ATCDEC01 EQU   ISTATCVT+504
ATCDEC00 EQU   ISTATCVT+500
ATCCPCRT EQU   ISTATCVT+496
ATCMSGM  EQU   ISTATCVT+492
ATCCPCFR EQU   ISTATCVT+488
ATCCPCGR EQU   ISTATCVT+484
ATCCPCPP EQU   ISTATCVT+480
ATCMSGP  EQU   ISTATCVT+476
ATCCPCNT EQU   ISTATCVT+472
ATCAUTHA EQU   ISTATCVT+468
ATCACCTA EQU   ISTATCVT+464
ATCAP39  EQU   ISTATCVT+460
ATCAP36  EQU   ISTATCVT+456
ATCAP35  EQU   ISTATCVT+452
ATCAP33  EQU   ISTATCVT+448
ATCAPCR5 EQU   ISTATCVT+444
ATCAICPT EQU   ISTATCVT+440
ATCAPI   EQU   ISTATCVT+436
ATCAICTN EQU   ISTATCVT+432
ATCACC01 EQU   ISTATCVT+428
ATCACC00 EQU   ISTATCVT+424
ATCLDECB EQU   ATCLDTIL+12
ATCLDLCK EQU   ATCLDTIL+8
ATCLDLST EQU   ATCLDTIL+4
ATCLDNCS EQU   ATCLDTIL
ATCNOSPB EQU   ISTATCVT+376
ATCNSPAB EQU   ISTATCVT+344
ATCLUSRT EQU   ISTATCVT+312
ATCPUIOP EQU   ISTATCVT+280
ATCPUPAB EQU   ISTATCVT+248
ATCPXPAB EQU   ISTATCVT+216
ATCPOPAB EQU   ISTATCVT+184
@NM00100 EQU   ATCVDPAB+16
ATCFEPAB EQU   ATCVDPAB
ATCTCIPB EQU   ISTATCVT+120
ATCCSPAB EQU   ATCSMPAB+16
@NM00099 EQU   ATCSMPAB
ATCTMRPB EQU   ISTATCVT+56
ATCITPAB EQU   ISTATCVT+24
@NM00098 EQU   ATCITRA1
ATCITSCP EQU   ATCITRA1
ATCITMSG EQU   ATCITRA1
ATCITPIU EQU   ATCITRA1
ATCITSMS EQU   ATCITRA1
ATCITPSS EQU   ATCITRA1
ATCITLCK EQU   ATCITRA1
ATCITAPI EQU   ATCITRA1
ATCITCNT EQU   ATCITFLG
ATCITRPH EQU   ATCITCDS
ATCITTBL EQU   ATCITFLD+4
ATCITPRM EQU   ATCITFLD
ATCPTCHA EQU   ATCRPTCH+4
ATCVTLVL EQU   ATCRPTCH
RPHUPSTA EQU   ISTRPH+104
RPHSAV16 EQU   RPHWORK+60
RPHSAV15 EQU   RPHWORK+56
RPHSAV14 EQU   RPHWORK+52
RPHSAV13 EQU   RPHWORK+48
RPHSAV12 EQU   RPHWORK+44
RPHSAV11 EQU   RPHWORK+40
RPHSAV10 EQU   RPHWORK+36
RPHSAVE9 EQU   RPHWORK+32
RPHSAVE8 EQU   RPHWORK+28
RPHSAVE7 EQU   RPHWORK+24
RPHSAVE6 EQU   RPHWORK+20
RPHSAVE5 EQU   RPHWORK+16
RPHSAVE4 EQU   RPHWORK+12
RPHSAVE3 EQU   RPHWORK+8
RPHSAVE2 EQU   RPHWORK+4
RPHSHALF EQU   RPHSAVE1+2
RPHSBIT8 EQU   RPHSBITS
RPHSBIT7 EQU   RPHSBITS
RPHSBIT6 EQU   RPHSBITS
RPHSBIT5 EQU   RPHSBITS
RPHSBIT4 EQU   RPHSBITS
RPHSBIT3 EQU   RPHSBITS
RPHSBIT2 EQU   RPHSBITS
RPHSBIT1 EQU   RPHSBITS
RPHSBYTE EQU   RPHSAVE1
RPHPABQP EQU   RPHPABQA+1
RPHPABFG EQU   RPHPABQA
RPHCRR   EQU   ISTRPH+32
RPHSRP34 EQU   RPHSRPRM+2
RPHSRP12 EQU   RPHSRPRM
RPHWEGT  EQU   RPHCSPA
RPHMAJCB EQU   ISTRPH+21
RPHPABOF EQU   ISTRPH+20
RPHRESUM EQU   RPHRESMA+1
@NM00097 EQU   RPHWPFLG
RPHPURGE EQU   RPHWPFLG
RPHPT    EQU   RPHWPFLG
RPHWT    EQU   RPHWPFLG
RPHRSKEY EQU   RPHWPFLG
RPHDVTA  EQU   ISTRPH+12
RPHTIK   EQU   RPHTSKID+3
@NM00096 EQU   RPHTSKID
RPHRPHAP EQU   RPHRPHA+1
@NM00095 EQU   RPHRPHA
RPHGATE  EQU   RPHRPHA
RPHABEND EQU   RPHFLGB
RPHUWAIT EQU   RPHFLGB
RPHRLCRA EQU   RPHFLGB
@NM00094 EQU   RPHFLGB
RPHPGCMP EQU   RPHFLGB
RPHFBAPS EQU   RPHFLGB
RPHBSSP  EQU   RPHFLGB
RPHLOCK  EQU   RPHFLGB
RPHFNFLG EQU   RPHFSTLC
RPHMLTCP EQU   RPHFLAGS
RPHSMCLR EQU   RPHFLAGS
RPHSMTYP EQU   RPHFLAGS
RPHSMQ   EQU   RPHFLAGS
RPHAPTYP EQU   RPHFLAGS
RPHSPGIN EQU   RPHFLAGS
RPHOGIND EQU   RPHFLAGS
RPHLNGTH EQU   RPHCNTL+1
RPHTYPE  EQU   RPHCNTL
DYPPAB   EQU   ISTDYPAB+16
DYPOCRPH EQU   DYPPACMD
DYPTSKID EQU   ISTDYPAB+8
DYPPACTB EQU   DYPCHAIN
DYPFLGS  EQU   ISTDYPAB+2
DYPLNGTH EQU   ISTDYPAB+1
DYPTYPE  EQU   ISTDYPAB
PABRPHA  EQU   PABRPHFG+1
PABNODQ  EQU   PABFLAGS
PABINHBT EQU   PABFLAGS
PABERLOK EQU   PABERRLK
PABSSN   EQU   PABFLAGS
PABDYNAM EQU   PABFLAGS
PABXTND  EQU   PABFLAGS
PABPRIOR EQU   PABFLAGS
PABAPYP  EQU   PABFLAGS
PABDVTA  EQU   ISTPAB+9
PABOFFST EQU   ISTPAB+8
PABCHNGP EQU   PABCHAIN+1
PABRSV02 EQU   PABCHAIN
PABDELAY EQU   PABCHAIN
PABQUED  EQU   PABRUNNG
PABRESET EQU   PABCHAIN
PABUNCON EQU   PABCHAIN
PABCDP   EQU   PABCHAIN
PABRESCH EQU   PABCHAIN
PABCHNG  EQU   PABCHAIN
PABWEQP  EQU   PABWEQA+1
PABRSV01 EQU   PABWEQA
PABWEQG  EQU   PABWEQA
LOKXCL   EQU   @NM00091
LOKPRY   EQU   @NM00091
@NM00092 EQU   @NM00091
@NM00090 EQU   LOKCHNG
LOKCT    EQU   ISTLOK
IOSEND   EQU   IOSB+108
IOSSKR   EQU   IOSEEKA+7
IOSSKH2  EQU   IOSSKHH+1
IOSSKH1  EQU   IOSSKHH
IOSSKCC  EQU   IOSCCHH
IOSSKBB  EQU   IOSEEKA+1
IOSSKM   EQU   IOSEEKA
IOSEEK   EQU   IOSB+92
IOSMDM   EQU   IOSB+91
IOSMDB   EQU   IOSB+90
IOSCKEY7 EQU   IOSCKEY
IOSCKEY6 EQU   IOSCKEY
IOSCKEY5 EQU   IOSCKEY
IOSCKEY4 EQU   IOSCKEY
@NM00086 EQU   IOSCKEY
IOSFMSK  EQU   IOSB+88
IOSCUDEV EQU   IOSPATH+1
@NM00085 EQU   IOSCHN
IOSPATH3 EQU   IOSCHN
IOSPATH2 EQU   IOSCHN
IOSEXP   EQU   IOSCHN
IOSGDP   EQU   IOSCHN
IOSAFF   EQU   IOSB+85
IOSRSS1B EQU   IOSB+84
IOSDSID  EQU   IOSB+80
IOSVST   EQU   IOSB+76
IOSRST   EQU   IOSB+72
IOSDIE   EQU   IOSB+68
IOSABN   EQU   IOSB+64
IOSNRM   EQU   IOSB+60
IOSPCI   EQU   IOSB+56
IOSERP   EQU   IOSB+52
IOSPCHN  EQU   IOSB+48
IOSSNS   EQU   IOSB+42
IOSAPMSK EQU   IOSB+40
IOSRES4A EQU   IOSB+36
IOSUSE   EQU   IOSB+32
IOSSRB   EQU   IOSB+28
IOSCSWRC EQU   IOSCSW+5
IOSTSB   EQU   IOSTATUS+1
IOSTSA   EQU   IOSTATUS
IOSCSWCA EQU   IOSCSW
IOSCC    EQU   @NM00084
IOSUCB   EQU   IOSB+16
IOSOPT2X EQU   IOSOPT2
IOSHTP   EQU   IOSOPT2
IOSRELSE EQU   IOSOPT
IOSAPR   EQU   IOSOPT
IOSTSLL  EQU   IOSOPT
IOSNERP  EQU   IOSOPT
IOSPSLL  EQU   IOSOPT
IOSQISCE EQU   IOSOPT
IOSDEP   EQU   IOSOPT
IOSBYP   EQU   IOSOPT
IOSCOD   EQU   IOSB+13
IOSPKY7  EQU   IOSPKEY
IOSPGDPX EQU   IOSPKEY
IOSIDR   EQU   IOSPKEY
IOSLCL   EQU   IOSPKEY
@NM00083 EQU   IOSPKEY
IOSPGAD  EQU   IOSB+8
IOSASID  EQU   IOSB+6
IOSPRLVL EQU   IOSB+5
IOSDVRID EQU   IOSB+4
IOSPROC  EQU   IOSB+3
IOSFLC7  EQU   IOSFLC
IOSFLC6  EQU   IOSFLC
IOSRWAIT EQU   IOSFLC
IOSTP    EQU   IOSFLC
IOSCC3WE EQU   IOSFLC
IOSVERIF EQU   IOSDVALT
IOSDVMNT EQU   IOSFLC
IOSLOG   EQU   IOSFLB
IOSBDCST EQU   IOSFLB
IOSMSG   EQU   IOSFLB
IOSFLB4  EQU   IOSFLB
IOSFLB3  EQU   IOSFLB
IOSFLB2  EQU   IOSFLB
IOSSDR   EQU   IOSFLB
IOSDIESE EQU   IOSFLB
IOSIOSB  EQU   IOSFLA
IOSDOM   EQU   IOSFLA
IOSEX    EQU   IOSFLA
IOSSMDB  EQU   IOSFLA
IOSSMDA  EQU   IOSFLA
IOSERR   EQU   IOSFLA
IOSCCHN  EQU   IOSACHN
IOSDCHN  EQU   IOSACHN
@NM00082 EQU   SRBSECT+40
@NM00081 EQU   SRBSECT+38
SRBPRIOR EQU   SRBSECT+37
SRBPKF   EQU   SRBSECT+36
SRBSAVE  EQU   SRBSECT+32
SRBPARM  EQU   SRBSECT+28
SRBRMTR  EQU   SRBSECT+24
SRBEP    EQU   SRBSECT+20
SRBPTCB  EQU   SRBFLC+4
SRBPASID EQU   SRBFLC+2
SRBCPAFF EQU   SRBFLC
SRBASCB  EQU   SRBSECT+8
SRBFLNK  EQU   SRBSECT+4
SRBID    EQU   SRBSECT
IOBERRCT EQU   IOBSTDRD+30
IOBRSV19 EQU   IOBINCAM+1
IOBOLTST EQU   IOBBTAMF
IOBRFTMG EQU   IOBBTAMF
IOBRSV17 EQU   IOBBTAMF
IOBRSV16 EQU   IOBBTAMF
IOBRSV15 EQU   IOBBTAMF
IOBRSV14 EQU   IOBBTAMF
IOBINUSE EQU   IOBBTAMF
IOBPRMER EQU   IOBBTAMF
IOBRSTRB EQU   IOBRESTR+1
IOBREPOS EQU   IOBRESTR
IOBDCBPB EQU   IOBDCBPT+1
IOBRSV44 EQU   IOBFLAG4
IOBJES3I EQU   IOBFLAG4
IOBRSV42 EQU   IOBFLAG4
IOBRSV41 EQU   IOBFLAG4
IOBRSV40 EQU   IOBFLAG4
IOBPMERR EQU   IOBFLAG4
IOBCC3WE EQU   IOBFLAG4
IOBGDPOL EQU   IOBFLAG4
IOBSTRTB EQU   IOBSTART+1
IOBSIOCC EQU   IOBSTART
IOBCSB7  EQU   IOBCSTAT
IOBCSB6  EQU   IOBCSTAT
IOBCSB5  EQU   IOBCSTAT
IOBCSB4  EQU   IOBCSTAT
IOBCSB3  EQU   IOBCSTAT
IOBCSB2  EQU   IOBCSTAT
IOBCSB1  EQU   IOBCSTAT
IOBCSB0  EQU   IOBCSTAT
IOBUSB7  EQU   IOBUSTAT
IOBUSB6  EQU   IOBUSTAT
IOBUSB5  EQU   IOBUSTAT
IOBUSB4  EQU   IOBUSTAT
IOBUSB3  EQU   IOBUSTAT
IOBUSB2  EQU   IOBUSTAT
IOBUSB1  EQU   IOBUSTAT
IOBUSB0  EQU   IOBUSTAT
IOBCMDA  EQU   IOBIOCSW
IOBLOG   EQU   IOBFL3
IOBJAM   EQU   IOBICL
IOBMSG   EQU   IOBFL3
IOBSDR   EQU   IOBCNC
IOBACU   EQU   IOBFL3
IOBCDC   EQU   IOBFL3
IOBICC   EQU   IOBFL3
IOBCCC   EQU   IOBFL3
IOBECBPB EQU   IOBECBPT+1
IOBECBCC EQU   IOBECBPT
IOBS1B7  EQU   IOBSENS1
IOBS1B6  EQU   IOBSENS1
IOBS1B5  EQU   IOBSENS1
IOBS1B4  EQU   IOBSENS1
IOBS1B3  EQU   IOBSENS1
IOBS1B2  EQU   IOBSENS1
IOBS1B1  EQU   IOBSENS1
IOBS1B0  EQU   IOBSENS1
IOBSNSC9 EQU   IOBS0B7
IOBS0B6  EQU   IOBSENS0
IOBS0B5  EQU   IOBSENS0
IOBS0B4  EQU   IOBSENS0
IOBS0B3  EQU   IOBSENS0
IOBS0B2  EQU   IOBSENS0
IOBS0B1  EQU   IOBSENS0
IOBS0B0  EQU   IOBSENS0
IOBPNCH  EQU   IOBFLAG2
IOBSTATO EQU   IOBFLAG2
IOBSKUPD EQU   IOBFLAG2
IOBALTTR EQU   IOBFLAG2
IOBRRT2  EQU   IOBRDHA0
IOBRRT3  EQU   IOBPURGE
IOBSENSE EQU   IOBFLAG2
IOBHALT  EQU   IOBFLAG2
IOBSPSVC EQU   IOBRSTRT
IOBUNREL EQU   IOBFLAG1
IOBIOERR EQU   IOBFLAG1
IOBFCREX EQU   IOBCYCCK
IOBRPSTN EQU   IOBFLAG1
IOBERRTN EQU   IOBFLAG1
IOBCMDCH EQU   IOBFLAG1
IOBDATCH EQU   IOBFLAG1
IOBCNOPA EQU   IOBPREFX+12
IOBCICB  EQU   IOBPREFX+8
IOBCECB  EQU   IOBPREFX+4
IOBCONOP EQU   IOBPREFX+3
IOBCINOP EQU   IOBPREFX+2
IOBRSV05 EQU   IOBPREFX+1
IOBPCI   EQU   IOBCFLG1
IOBRSTCH EQU   IOBCFLG1
IOBABAPP EQU   IOBCFLG1
IOBPTST  EQU   IOBCFLG1
IOBRSV04 EQU   IOBCFLG1
IOBRSV03 EQU   IOBCFLG1
IOBRSV02 EQU   IOBCFLG1
IOBRSV01 EQU   IOBCFLG1
UCBERADR EQU   UCBUCS+12
UCBFCBID EQU   UCBUCS+8
UCBERCNT EQU   UCBUCS+7
UCBRSV51 EQU   UCBUCS+6
UCBRSV50 EQU   UCBFCBOP
UCBRSV49 EQU   UCBFCBOP
UCBRSV48 EQU   UCBFCBOP
UCBRSV47 EQU   UCBFCBOP
UCBRSV46 EQU   UCBFCBOP
UCBRSV45 EQU   UCBFCBOP
UCBRSV44 EQU   UCBFCBOP
UCBFCBO1 EQU   UCBFCBOP
UCBUCSPE EQU   UCBUCSOP
UCBRSV43 EQU   UCBUCSOP
UCBRSV42 EQU   UCBUCSOP
UCBRSV41 EQU   UCBUCSOP
UCBRSV40 EQU   UCBUCSOP
UCBRSV39 EQU   UCBUCSOP
UCBUCSO2 EQU   UCBUCSOP
UCBUCSO1 EQU   UCBUCSOP
UCBUCSID EQU   UCBUCS
UCBMDRBA EQU   UCBMDRBF+1
UCBRV075 EQU   UCBMDRBF
UCBRV074 EQU   UCB3800X+32
UCBIMAGE EQU   UCB3800X+28
UCBFCBNM EQU   UCB3800X+24
UCBCHAR4 EQU   UCB3800X+20
UCBCHAR3 EQU   UCB3800X+16
UCBCHAR2 EQU   UCB3800X+12
UCBCHAR1 EQU   UCB3800X+8
UCBCGMID EQU   UCB3800X+4
UCBBRSTA EQU   UCBACTIV
UCBRV063 EQU   UCBACTIV
UCBRV062 EQU   UCBACTIV
UCBRV061 EQU   UCBACTIV
UCBRV060 EQU   UCBACTIV
UCBRV059 EQU   UCBACTIV
UCBRV058 EQU   UCBACTIV
UCBRV057 EQU   UCBACTIV
UCBRV050 EQU   UCB3800X+2
UCBCGMNO EQU   UCB3800X+1
UCBRV083 EQU   UCBOPTNS
UCBBRSTR EQU   UCBOPTNS
UCBRV056 EQU   UCBOPTNS
UCBRV055 EQU   UCBOPTNS
UCBRV054 EQU   UCBOPTNS
UCBRV053 EQU   UCBOPTNS
UCBRV052 EQU   UCBOPTNS
UCBRV051 EQU   UCBOPTNS
UCBRV073 EQU   UCB3540X+7
UCBRV072 EQU   UCBDKBYT
UCBRV071 EQU   UCBDKBYT
UCBRV070 EQU   UCBDKBYT
UCBRV069 EQU   UCBDKBYT
UCBRV068 EQU   UCBDKBYT
UCBRV067 EQU   UCBDKBYT
UCBVLVER EQU   UCBDKBYT
UCBDKAMX EQU   UCBDKBYT
UCBVLSER EQU   UCB3540X
UCBRDATA EQU   UCBOCR+4
UCBFRID  EQU   UCBOCR
UCBCLN   EQU   UCBMT+14
UCBERG   EQU   UCBMT+12
UCBMS    EQU   UCBMT+11
UCBNB    EQU   UCBMT+10
UCBPW    EQU   UCBMT+9
UCBPR    EQU   UCBMT+8
UCBSIO   EQU   UCBMT+6
UCBTW    EQU   UCBMT+5
UCBTR    EQU   UCBMT+4
UCBTWT   EQU   UCBMT+3
UCBTRT   EQU   UCBMT+2
UCBCTD   EQU   UCBMT
UCBWTOID EQU   UCBCMEXT+17
UCBRV043 EQU   UCBCMEXT+16
UCBASID  EQU   UCBCMEXT+14
UCBMFCNT EQU   UCBCMEXT+12
UCBPMSK  EQU   UCBCMEXT+10
UCBCCWOF EQU   UCBCMEXT+8
UCBRV041 EQU   UCBCMEXT+6
UCBRV036 EQU   UCBFLP1
UCBRV035 EQU   UCBFLP1
UCBERLOG EQU   UCBFLP1
UCBRV033 EQU   UCBFLP1
UCBRV032 EQU   UCBFLP1
UCBRV031 EQU   UCBFLP1
UCBSHRUP EQU   UCBFLP1
UCBNSRCH EQU   UCBFLP1
UCBSNSCT EQU   UCBCMEXT+4
UCBHPDV  EQU   @NM00080
UCBHALI  EQU   @NM00080
UCBRSV09 EQU   @NM00080
UCBRSV08 EQU   @NM00080
UCBRSV07 EQU   @NM00080
UCBRSV06 EQU   @NM00080
UCBRSV05 EQU   @NM00080
UCBRSV04 EQU   @NM00080
UCBDTI   EQU   UCBCMEXT+2
UCBSTI   EQU   UCBCMEXT+1
UCBETI   EQU   UCBCMEXT
UCBEXTP  EQU   UCBEXTPT+1
UCBDDRSW EQU   UCBFLC
UCBTICBT EQU   UCBFLC
UCBIVRR  EQU   UCBFLC
UCBIVRS  EQU   UCBFLC
UCBITF   EQU   UCBFLC
UCBUDE   EQU   UCBFLC
UCBWAA   EQU   UCBFLC
UCBATTP  EQU   UCBFLC
UCBUNTYP EQU   UCBTBYT4
UCBRSV11 EQU   UCBDVCLS
UCBRSV10 EQU   UCBDVCLS
UCB3CHAR EQU   UCBDVCLS
UCB3UREC EQU   UCBDVCLS
UCB3DISP EQU   UCBDVCLS
UCB3DACC EQU   UCBDVCLS
UCB3TAPE EQU   UCBDVCLS
UCBDVPWR EQU   UCB2OPT7
UCBVLPWR EQU   UCB2OPT6
UCB2OPT5 EQU   UCBTBYT2
UCBRVDEV EQU   UCBRWTAU
UCBRPS   EQU   UCBDUDN2
UCBRR    EQU   UCBDUDN1
UCB2OPT1 EQU   UCBTBYT2
UCB2OPT0 EQU   UCBTBYT2
UCB1FEA7 EQU   UCBTBYT1
UCBD6250 EQU   UCB1FEA6
UCBD1600 EQU   UCB1FEA5
UCB1FEA4 EQU   UCBTBYT1
UCB1FEA3 EQU   UCBTBYT1
UCB1FEA2 EQU   UCBTBYT1
UCB1FEA1 EQU   UCBTBYT1
UCB1FEA0 EQU   UCBTBYT1
UCBNAME  EQU   UCBOB+13
UCBRV029 EQU   UCBWGT
UCBVHRSN EQU   UCBWGT
UCBVORSN EQU   UCBWGT
UCBMTPXP EQU   UCBWGT
UCBREW   EQU   UCBWGT
UCBPUB   EQU   UCBWGT
UCBOUT   EQU   UCBWGT
UCBIN    EQU   UCBWGT
UCBCPU   EQU   UCBOB+11
UCBLCI   EQU   UCBOB+10
UCBCNT   EQU   UCBOB+9
UCBRV017 EQU   UCBCHM1
UCBRV016 EQU   UCBCHM1
UCBRV015 EQU   UCBCHM1
UCBRV014 EQU   UCBCHM1
UCBSPB   EQU   UCBPTH1
UCBPPB   EQU   UCBPTH1
UCBSPA   EQU   UCBPTH0
UCBPPA   EQU   UCBPTH0
UCBSIGP  EQU   UCBFLB
UCBVALPH EQU   UCBFLB
UCBCRHSN EQU   UCBFLB
UCBCRHRV EQU   UCBFLB
UCBRESVH EQU   UCBFLB
UCBSPST  EQU   UCBFLB
UCBASNS  EQU   UCBFLB
UCBIORST EQU   UCBFLB
UCBQISCE EQU   UCBFL1
UCBACTV  EQU   UCBFL1
UCBSAP   EQU   UCBFL1
UCBNOTRC EQU   UCBCUB
UCBPSNS  EQU   UCBFL1
UCBUSING EQU   UCBPST
UCBNOTRD EQU   UCBNRY
UCBBUSYD EQU   UCBBSY
UCBUA    EQU   UCBCHAN+1
UCBCHA   EQU   UCBCHAN
UCBDADI  EQU   UCBSTAT
UCBSYSR  EQU   UCBSTAT
UCBPRES  EQU   UCBSTAT
UCBALOC  EQU   UCBSTAT
UCBUNLD  EQU   UCBSTAT
UCBRESV  EQU   UCBSTAT
UCBCHGS  EQU   UCBSTAT
UCBONLI  EQU   UCBSTAT
UCBID    EQU   UCBOB+2
UCBALTPH EQU   UCBFL5
UCBALTCU EQU   UCBFL5
UCBNALOC EQU   UCBFL5
UCBENVRD EQU   UCBFL5
UCBVSDR  EQU   UCBFL5
UCBSASK  EQU   UCBFL5
UCBAMV   EQU   UCBAF
UCBDCC   EQU   UCBFL5
UCBMONT  EQU   UCBJBNR
UCBRV011 EQU   UCBJBNR
UCBRSV02 EQU   UCBJBNR
UCBOLDSM EQU   UCBJBNR
UCBRV003 EQU   UCBJBNR
UCBDUC   EQU   UCBJBNR
UCBJES3  EQU   UCBJBNR
UCBVRDEV EQU   UCBJBNR
UCBCMSEG EQU   UCBOB
UCBPFXND EQU   UCB+512
UCBIOQ   EQU   UCB+508
UCBPXST  EQU   UCB+504
@NM00077 EQU   UCB
@NM00076 EQU   SDWA+512
@NM00075 EQU   SDWADPVA
SDWAEBC  EQU   SDWADPVA
SDWAVRAL EQU   SDWARA
@NM00074 EQU   SDWA+396
SDWACOMP EQU   SDWA+392
SDWARCPL EQU   SDWA+364
@NM00073 EQU   SDWADPSA+32
SDWATO4  EQU   SDWADPSL+28
SDWAFRM4 EQU   SDWADPSL+24
SDWATO3  EQU   SDWADPSL+20
SDWAFRM3 EQU   SDWADPSL+16
SDWATO2  EQU   SDWADPSL+12
SDWAFRM2 EQU   SDWADPSL+8
SDWATO1  EQU   SDWADPSL+4
SDWAFRM1 EQU   SDWADPSL
@NM00072 EQU   SDWADDAT+3
@NM00071 EQU   SDWAPDAT
SDWAUSPL EQU   SDWAPDAT
SDWADPSW EQU   SDWAPDAT
SDWATJPA EQU   SDWAPDAT
SDWATLPA EQU   SDWAPDAT
SDWADREG EQU   SDWAPDAT
SDWADSAH EQU   SDWAPDAT
SDWADSAS EQU   SDWAPDAT
@NM00070 EQU   SDWADDAT+1
@NM00069 EQU   SDWASDAT
SDWAQQS  EQU   SDWASDAT
SDWACBS  EQU   SDWASDAT
SDWAGTF  EQU   SDWASDAT
SDWASWA  EQU   SDWASDAT
SDWALSQA EQU   SDWASDAT
SDWASQA  EQU   SDWASDAT
SDWANUC  EQU   SDWASDAT
@NM00068 EQU   SDWADUMP+2
@NM00067 EQU   SDWADPFS
SDWASLST EQU   SDWADPFS
@NM00066 EQU   SDWADPFS
SDWADLST EQU   SDWADPFS
SDWADPT  EQU   SDWADPFS
SDWADPID EQU   SDWADUMP
SDWADPLA EQU   SDWA+316
SDWACSCT EQU   SDWARECP+8
SDWAMODN EQU   SDWARECP
@NM00065 EQU   SDWALKWA+32
SDWATALW EQU   SDWALKWS+28
SDWATDLW EQU   SDWALKWS+24
SDWATNLW EQU   SDWALKWS+20
SDWAAPLW EQU   SDWALKWS+16
SDWAIPLW EQU   SDWALKWS+12
SDWAILLW EQU   SDWALKWS+8
SDWAIULW EQU   SDWALKWS+4
SDWAICLW EQU   SDWALKWS
SDWAFLLK EQU   SDWAACF4
SDWACMS  EQU   SDWAACF4
SDWAOPTM EQU   SDWAACF4
SDWATADB EQU   SDWAACF4
SDWATDNB EQU   SDWAACF4
SDWATNCB EQU   SDWAACF4
SDWAILCH EQU   SDWAACF4
SDWAIUCB EQU   SDWAACF4
SDWAICAT EQU   SDWAACF3
SDWAIPRG EQU   SDWAACF3
SDWASALL EQU   SDWAACF3
SDWAASMP EQU   SDWAACF3
SDWADISP EQU   SDWAACF3
@NM00064 EQU   SDWAACF3
@NM00063 EQU   SDWAACF2
SDWAFREE EQU   SDWAACF2
SDWAUPRG EQU   SDWAACF2
@NM00062 EQU   SDWAACF2
SDWASPIN EQU   SDWAACF2
@NM00061 EQU   SDWAACF2
SDWALCPU EQU   SDWACPUA+2
@NM00060 EQU   SDWACPUA
SDWARECA EQU   SDWA+244
SDWARTYA EQU   SDWA+240
@NM00059 EQU   SDWA+239
@NM00058 EQU   SDWAIOFS
SDWANIOP EQU   SDWAIOFS
SDWANOIO EQU   SDWAIOFS
SDWAIOHT EQU   SDWAIOFS
SDWAIOQR EQU   SDWAIOFS
@NM00057 EQU   SDWAERRD
SDWAMCIV EQU   SDWAERRD
SDWARPIV EQU   SDWAERRD
SDWAMABD EQU   SDWAERRD
SDWACTS  EQU   SDWAERRD
SDWASTAE EQU   SDWAERRD
SDWANRBE EQU   SDWAERRD
SDWACLUP EQU   SDWAERRD
@NM00056 EQU   SDWAERRC
SDWAEAS  EQU   SDWAERRC
SDWAPERC EQU   SDWAERRC
SDWAIRB  EQU   SDWAERRC
SDWASTAI EQU   SDWAERRC
SDWASTAF EQU   SDWAERRC
SDWASRBM EQU   SDWAERRB
SDWALDIS EQU   SDWAERRB
SDWAENRB EQU   SDWAERRB
SDWATYP1 EQU   SDWAERRB
@NM00055 EQU   SDWAERRB
SDWAPGIO EQU   SDWAERRA
SDWATEXC EQU   SDWAERRA
SDWASVCE EQU   SDWAERRA
SDWAABTM EQU   SDWAERRA
SDWASVCD EQU   SDWAERRA
SDWARKEY EQU   SDWAERRA
SDWAPCHK EQU   SDWAERRA
SDWAMCHK EQU   SDWAERRA
SDWATIME EQU   SDWAMCH+20
SDWARFSA EQU   SDWAMCH+16
@NM00054 EQU   SDWAMCH+14
SDWAVEQR EQU   SDWARSR2
SDWAPGFX EQU   SDWARSR2
SDWAFLSQ EQU   SDWARSR2
SDWAFSQA EQU   SDWARSR2
SDWANUCL EQU   SDWARSR2
SDWASPER EQU   SDWARSR2
SDWAINTC EQU   SDWARSR2
SDWAOFLN EQU   SDWARSR2
SDWACHNG EQU   SDWARSR1
SDWAMSER EQU   SDWARSR1
@NM00053 EQU   SDWARSR1
SDWACPID EQU   SDWAMCH+10
SDWATERR EQU   SDWAMCHD
SDWAFPRX EQU   SDWAMCHD
SDWAINSF EQU   SDWAMCHD
SDWAACR  EQU   SDWAMCHD
SDWASCK  EQU   SDWAMCHD
SDWAPSWU EQU   SDWAMCHD
SDWAREGU EQU   SDWAMCHD
SDWASKYF EQU   SDWAMCHD
@NM00052 EQU   SDWAMCHS
SDWARSRF EQU   SDWAMCHS
SDWARSRC EQU   SDWAMCHS
SDWAINVP EQU   SDWAMCHS
SDWATSVL EQU   SDWAMCHS
SDWARCDF EQU   SDWAMCHS
SDWASRVL EQU   SDWAMCHS
SDWASCKE EQU   SDWASTCK+4
SDWASCKB EQU   SDWASTCK
SDWALNTH EQU   SDWAIDNT+1
SDWASPID EQU   SDWAIDNT
SDWASR15 EQU   SDWASRSV+60
SDWASR14 EQU   SDWASRSV+56
SDWASR13 EQU   SDWASRSV+52
SDWASR12 EQU   SDWASRSV+48
SDWASR11 EQU   SDWASRSV+44
SDWASR10 EQU   SDWASRSV+40
SDWASR09 EQU   SDWASRSV+36
SDWASR08 EQU   SDWASRSV+32
SDWASR07 EQU   SDWASRSV+28
SDWASR06 EQU   SDWASRSV+24
SDWASR05 EQU   SDWASRSV+20
SDWASR04 EQU   SDWASRSV+16
SDWASR03 EQU   SDWASRSV+12
SDWASR02 EQU   SDWASRSV+8
SDWASR01 EQU   SDWASRSV+4
SDWASR00 EQU   SDWASRSV
SDWATRN2 EQU   SDWAAEC2+4
SDWAIPC2 EQU   SDWAICD2
SDWAIMC2 EQU   SDWAICD2
SDWAIPR2 EQU   SDWAICD2
@NM00051 EQU   SDWAINC2
@NM00050 EQU   SDWAILC2
SDWAIL2  EQU   SDWAILC2
@NM00049 EQU   SDWAILC2
@NM00048 EQU   SDWAAEC2
SDWAADD2 EQU   SDWANXT2+1
@NM00047 EQU   SDWANXT2
@NM00046 EQU   SDWAEC2+3
SDWASGN2 EQU   SDWAINT2
SDWAEXP2 EQU   SDWAINT2
SDWADEC2 EQU   SDWAINT2
SDWAFPO2 EQU   SDWAINT2
SDWACC2  EQU   SDWAINT2
@NM00045 EQU   SDWAINT2
SDWAPGM2 EQU   SDWAMWP2
SDWAWAT2 EQU   SDWAMWP2
SDWAMCK2 EQU   SDWAMWP2
SDWAECT2 EQU   SDWAMWP2
SDWAKEY2 EQU   SDWAMWP2
SDWAEXT2 EQU   SDWAEMK2
SDWAIO2  EQU   SDWAEMK2
SDWATRM2 EQU   SDWAEMK2
@NM00044 EQU   SDWAEMK2
SDWAPER2 EQU   SDWAEMK2
@NM00043 EQU   SDWAEMK2
SDWATRAN EQU   SDWAAEC1+4
SDWAIPC1 EQU   SDWAICD1
SDWAIMC1 EQU   SDWAICD1
SDWAIPR1 EQU   SDWAICD1
@NM00042 EQU   SDWAINC1
@NM00041 EQU   SDWAILC1
SDWAIL1  EQU   SDWAILC1
@NM00040 EQU   SDWAILC1
@NM00039 EQU   SDWAAEC1
SDWAADD1 EQU   SDWANXT1+1
@NM00038 EQU   SDWANXT1
@NM00037 EQU   SDWAEC1+3
SDWASGN1 EQU   SDWAINT1
SDWAEXP1 EQU   SDWAINT1
SDWADEC1 EQU   SDWAINT1
SDWAFPO1 EQU   SDWAINT1
SDWACC1  EQU   SDWAINT1
@NM00036 EQU   SDWAINT1
SDWAPGM1 EQU   SDWAMWP1
SDWAWAT1 EQU   SDWAMWP1
SDWAMCK1 EQU   SDWAMWP1
SDWAECT1 EQU   SDWAMWP1
SDWAKEY1 EQU   SDWAMWP1
SDWAEXT1 EQU   SDWAEMK1
SDWAIO1  EQU   SDWAEMK1
SDWATRM1 EQU   SDWAEMK1
@NM00035 EQU   SDWAEMK1
SDWAPER1 EQU   SDWAEMK1
@NM00034 EQU   SDWAEMK1
SDWAIOBR EQU   SDWA+100
SDWAEPA  EQU   SDWA+96
@NM00033 EQU   SDWANAME+4
SDWARBAD EQU   SDWANAME
SDWAGR15 EQU   SDWAGRSV+60
SDWAGR14 EQU   SDWAGRSV+56
SDWAGR13 EQU   SDWAGRSV+52
SDWAGR12 EQU   SDWAGRSV+48
SDWAGR11 EQU   SDWAGRSV+44
SDWAGR10 EQU   SDWAGRSV+40
SDWAGR09 EQU   SDWAGRSV+36
SDWAGR08 EQU   SDWAGRSV+32
SDWAGR07 EQU   SDWAGRSV+28
SDWAGR06 EQU   SDWAGRSV+24
SDWAGR05 EQU   SDWAGRSV+20
SDWAGR04 EQU   SDWAGRSV+16
SDWAGR03 EQU   SDWAGRSV+12
SDWAGR02 EQU   SDWAGRSV+8
SDWAGR01 EQU   SDWAGRSV+4
SDWAGR00 EQU   SDWAGRSV
SDWANXTP EQU   SDWACTL2+5
SDWASGP  EQU   SDWAPMKP
SDWAEUP  EQU   SDWAPMKP
SDWADOP  EQU   SDWAPMKP
SDWAFPP  EQU   SDWAPMKP
SDWACCP  EQU   SDWAPMKP
SDWAILP  EQU   SDWAPMKP
SDWAINTP EQU   SDWACTL2+2
SDWASPVP EQU   SDWAMWPP
SDWAWATP EQU   SDWAMWPP
SDWAMCKP EQU   SDWAMWPP
@NM00032 EQU   SDWAMWPP
SDWAKEYP EQU   SDWAMWPP
SDWAEXTP EQU   SDWACMKP
SDWAIOP  EQU   SDWACMKP
SDWANXTA EQU   SDWACTL1+5
SDWASGA  EQU   SDWAPMKA
SDWAEUA  EQU   SDWAPMKA
SDWADOA  EQU   SDWAPMKA
SDWAFPA  EQU   SDWAPMKA
SDWACCA  EQU   SDWAPMKA
SDWAILA  EQU   SDWAPMKA
SDWAINTA EQU   SDWACTL1+2
SDWASPVA EQU   SDWAMWPA
SDWAWATA EQU   SDWAMWPA
SDWAMCKA EQU   SDWAMWPA
@NM00031 EQU   SDWAMWPA
SDWAKEYA EQU   SDWAMWPA
SDWAEXTA EQU   SDWACMKA
SDWAIOA  EQU   SDWACMKA
SDWACMPC EQU   SDWAABCC+1
@NM00030 EQU   SDWACMPF
SDWASTCC EQU   SDWACMPF
@NM00029 EQU   SDWACMPF
SDWASTEP EQU   SDWACMPF
SDWAREQ  EQU   SDWACMPF
CVTLEVL  EQU   CVTRELNO+2
CVTNUMB  EQU   CVTRELNO
CVTMDL   EQU   CVTFIX+250
@NM00028 EQU   CVTFIX+248
@NM00027 EQU   CVTFIX
CVTRV482 EQU   CVTXTNT2+128
CVTRV481 EQU   CVTXTNT2+124
CVTRV480 EQU   CVTXTNT2+120
CVTRV479 EQU   CVTXTNT2+118
CVTRV478 EQU   CVTXTNT2+117
CVTRV477 EQU   CVTXTNT2+116
CVTRV476 EQU   CVTXTNT2+115
CVTRV475 EQU   CVTXTNT2+114
CVTRV474 EQU   CVTRV466
CVTRV473 EQU   CVTRV466
CVTRV472 EQU   CVTRV466
CVTRV471 EQU   CVTRV466
CVTRV470 EQU   CVTRV466
CVTRV469 EQU   CVTRV466
CVTRV468 EQU   CVTRV466
CVTRV467 EQU   CVTRV466
CVTRV465 EQU   CVTRV457
CVTRV464 EQU   CVTRV457
CVTRV463 EQU   CVTRV457
CVTRV462 EQU   CVTRV457
CVTRV461 EQU   CVTRV457
CVTRV460 EQU   CVTRV457
CVTRV459 EQU   CVTRV457
CVTRV458 EQU   CVTRV457
CVTRV456 EQU   CVTXTNT2+108
CVTRV455 EQU   CVTXTNT2+104
CVTRV454 EQU   CVTXTNT2+100
CVTRV453 EQU   CVTXTNT2+96
CVTRV452 EQU   CVTXTNT2+94
CVTRV451 EQU   CVTXTNT2+92
CVTRV450 EQU   CVTXTNT2+90
CVTRV449 EQU   CVTXTNT2+88
CVTRV448 EQU   CVTXTNT2+87
CVTRV447 EQU   CVTXTNT2+86
CVTRV446 EQU   CVTRV438
CVTRV445 EQU   CVTRV438
CVTRV444 EQU   CVTRV438
CVTRV443 EQU   CVTRV438
CVTRV442 EQU   CVTRV438
CVTRV441 EQU   CVTRV438
CVTRV440 EQU   CVTRV438
CVTRV439 EQU   CVTRV438
CVTRV437 EQU   CVTRV429
CVTRV436 EQU   CVTRV429
CVTRV435 EQU   CVTRV429
CVTRV434 EQU   CVTRV429
CVTRV433 EQU   CVTRV429
CVTRV432 EQU   CVTRV429
CVTRV431 EQU   CVTRV429
CVTRV430 EQU   CVTRV429
CVTRV428 EQU   CVTXTNT2+80
CVTRV427 EQU   CVTXTNT2+76
CVTRV426 EQU   CVTXTNT2+72
CVTRV425 EQU   CVTXTNT2+68
CVTATACT EQU   CVTATCVT
CVTRV423 EQU   CVTXTNT2+62
CVTRV422 EQU   CVTXTNT2+60
CVTRV421 EQU   CVTXTNT2+58
CVTRV420 EQU   CVTXTNT2+56
CVTRV419 EQU   CVTXTNT2+55
CVTRV418 EQU   CVTXTNT2+54
CVTRV417 EQU   CVTRV409
CVTRV416 EQU   CVTRV409
CVTRV415 EQU   CVTRV409
CVTRV414 EQU   CVTRV409
CVTRV413 EQU   CVTRV409
CVTRV412 EQU   CVTRV409
CVTRV411 EQU   CVTRV409
CVTRV410 EQU   CVTRV409
CVTRV408 EQU   CVTRV400
CVTRV407 EQU   CVTRV400
CVTRV406 EQU   CVTRV400
CVTRV405 EQU   CVTRV400
CVTRV404 EQU   CVTRV400
CVTRV403 EQU   CVTRV400
CVTRV402 EQU   CVTRV400
CVTRV401 EQU   CVTRV400
CVTICB   EQU   CVTXTNT2+48
CVTSKTA  EQU   CVTXTNT2+44
CVTCCVT  EQU   CVTXTNT2+40
CVTRSV98 EQU   CVTXTNT2+36
CVTRSV97 EQU   CVTXTNT2+34
CVTRSV96 EQU   CVTXTNT2+32
CVTOLTEP EQU   CVTXTNT2+28
CVTQIDA  EQU   CVTQID+1
CVTRSV95 EQU   CVTQID
CVTRSV94 EQU   CVTXTNT2+20
CVTRSV93 EQU   CVTXTNT2+16
CVTRSV92 EQU   CVTXTNT2+12
CVTDEBVR EQU   CVTXTNT2+8
CVTRSV91 EQU   CVTXTNT2+6
CVTRSV9H EQU   CVTFLGBT
CVTRSV9G EQU   CVTFLGBT
CVTRSV9F EQU   CVTFLGBT
CVTRSV9E EQU   CVTFLGBT
CVTRSV9D EQU   CVTFLGBT
CVTBAH   EQU   CVTFLGBT
CVTVME   EQU   CVTFLGBT
CVTNPE   EQU   CVTFLGBT
CVTNUCLS EQU   CVTXTNT2+4
CVTDSSVA EQU   CVTDSSV+1
CVTRSV89 EQU   CVTDSSV
CVTRSV88 EQU   CVTXTNT1+8
CVTRSV87 EQU   CVTXTNT1+4
CVTFACHN EQU   CVTXTNT1
CVTRV488 EQU   CVTMAP+412
CVTRV487 EQU   CVTMAP+408
CVTRV486 EQU   CVTMAP+404
CVTRV485 EQU   CVTMAP+400
CVTACTAP EQU   CVTMAP+396
CVTAUTH  EQU   CVTMAP+392
CVTRV490 EQU   CVTMAP+388
CVTSU    EQU   CVTMAP+384
CVTVOLT1 EQU   CVTVOLM1+1
CVTVOLI1 EQU   CVTVOLF1
CVTSTOA  EQU   CVTMAP+376
CVTRSV58 EQU   CVTMAP+374
CVTRSV57 EQU   CVTMAP+372
CVTDDCE  EQU   CVTMAP+368
CVTPNWFR EQU   CVTMAP+364
CVTSMF   EQU   CVTMAP+360
CVTSULK  EQU   CVTMAP+358
CVTSLKO  EQU   CVTSYSK
CVTSLKP  EQU   CVTSYSK
CVTSLKQ  EQU   CVTSYSK
CVTSLKR  EQU   CVTSYSK
CVTRSV56 EQU   CVTSYSK
CVTRSV55 EQU   CVTSYSK
CVTRSV54 EQU   CVTSYSK
CVTRSV53 EQU   CVTSYSK
CVTRSV52 EQU   CVTA1F1
CVTRSV51 EQU   CVTA1F1
CVTRSV50 EQU   CVTA1F1
CVTRSV49 EQU   CVTA1F1
CVTRSV48 EQU   CVTA1F1
CVTRSV47 EQU   CVTA1F1
CVTSRSW  EQU   CVTA1F1
CVTPFSW  EQU   CVTA1F1
CVTPCVT  EQU   CVTMAP+352
CVTRSV46 EQU   CVTMAP+344
CVTRSV45 EQU   CVTMAP+340
CVTRSV44 EQU   CVTMAP+338
CVTRSV43 EQU   CVTMAP+336
CVTHJESA EQU   CVTHJES+1
CVTRSV42 EQU   CVTHJES
CVTEXT2A EQU   CVTEXT2+1
CVTRSV41 EQU   CVTEXT2
CVTAPFA  EQU   CVTAPF+1
CVTRSV40 EQU   CVTAPF
CVTRV518 EQU   CVTINTLA
CVTRV517 EQU   CVTERPV
CVTEORM  EQU   CVTMAP+312
CVTMCHPR EQU   CVTMAP+308
CVTTZ    EQU   CVTMAP+304
CVTJEPS  EQU   CVTMAP+300
CVTJESCT EQU   CVTMAP+296
CVTMODE  EQU   CVTMAP+292
CVTPTRV  EQU   CVTMAP+288
CVTREAL  EQU   CVTMAP+284
CVTRSV39 EQU   CVTMAP+280
CVTRSV38 EQU   CVTMAP+276
CVTDMSRA EQU   CVTDMSR+1
CVTRV634 EQU   CVTDMSRF
CVTRV633 EQU   CVTDMSRF
CVTRV632 EQU   CVTDMSRF
CVTRV631 EQU   CVTDMSRF
CVTRV630 EQU   CVTDMSRF
CVTRV629 EQU   CVTDMSRF
CVTUDUMP EQU   CVTDMSRF
CVTSDUMP EQU   CVTDMSRF
CVTQMSGA EQU   CVTQMSG+1
CVTRSV36 EQU   CVTQMSG
CVTAMFF  EQU   CVTMAP+264
CVTPURGA EQU   CVTPURG+1
CVTRSV35 EQU   CVTPURG
CVTCBSP  EQU   CVTMAP+256
CVTATERA EQU   CVTATER+1
CVTSYST  EQU   CVTATER
CVTVOLT2 EQU   CVTTAT
CVTVOLI2 EQU   CVTVOLF2
CVTAQAVB EQU   CVTAQAVT+1
CVTRSV34 EQU   CVTTCMFG
CVTRSV33 EQU   CVTTCMFG
CVTRSV32 EQU   CVTTCMFG
CVTRSV31 EQU   CVTTCMFG
CVTRSV30 EQU   CVTTCMFG
CVTRSV29 EQU   CVTTCMFG
CVTLDEV  EQU   CVTTCMFG
CVTTCRDY EQU   CVTTCMFG
CVTGTFA  EQU   CVTGTF+1
CVTRSV27 EQU   CVTGTFST
CVTRNIO  EQU   CVTGTFST
CVTUSR   EQU   CVTGTFST
CVTRV318 EQU   CVTFORM
CVTRV317 EQU   CVTTMODE
CVTRV316 EQU   CVTSTATE
CVTRV315 EQU   CVTGTFS
CVTGTFAV EQU   CVTGTFS
CVT0SCR1 EQU   CVTMAP+232
CVTRV515 EQU   CVTMAP+228
CVTRMS   EQU   CVTMAP+224
CVTPATCH EQU   CVTMAP+220
CVTTSCE  EQU   CVTMAP+216
CVTLNKSC EQU   CVTMAP+214
CVTQABST EQU   CVTMAP+212
CVTMDLDS EQU   CVTMAP+208
CVTUSER  EQU   CVTMAP+204
CVTABEND EQU   CVTMAP+200
CVTSMCA  EQU   CVTMAP+196
CVTRSV18 EQU   CVTMAP+192
CVTQLPAQ EQU   CVTMAP+188
CVTQCDSR EQU   CVTMAP+184
CVTVS1B  EQU   CVTOPTB
CVTVS1A  EQU   CVTOPTB
CVTFP    EQU   CVTOPTB
CVTAPTHR EQU   CVTOPTB
CVTNLOG  EQU   CVTOPTB
CVTTOD   EQU   CVTOPTB
CVTCTIMS EQU   CVTOPTB
CVTPROT  EQU   CVTOPTB
CVTXPFP  EQU   CVTOPTA
CVTASCII EQU   CVTOPTA
CVTRSV13 EQU   CVTOPTA
CVTRSV12 EQU   CVTOPTA
CVTNIP   EQU   CVTOPTA
CVTDDR   EQU   CVTOPTA
CVTAPR   EQU   CVTOPTA
CVTCCH   EQU   CVTOPTA
CVTSNCTR EQU   CVTMAP+180
CVTQMWR  EQU   CVTMAP+176
CVTQOCR  EQU   CVTMAP+172
CVT1EF00 EQU   CVTMAP+168
CVTMZ00  EQU   CVTMAP+164
CVTHEAD  EQU   CVTMAP+160
CVTRSV11 EQU   CVTMAP+156
CVT0PT01 EQU   CVTMAP+152
CVTMSER  EQU   CVTMAP+148
CVTRV516 EQU   CVTIERLC
CVTILCH  EQU   CVTMAP+140
CVT0DS   EQU   CVTMAP+136
CVTFBOSV EQU   CVTMAP+132
CVTNUCB  EQU   CVTMAP+128
CVTIXAVL EQU   CVTMAP+124
CVTIOQET EQU   CVTMAP+120
CVTDCBA  EQU   CVTMAP+117
CVTMVS2  EQU   CVTDCB
CVT6DAT  EQU   CVTDCB
CVT4MPS  EQU   CVTDCB
CVTRSV09 EQU   CVTDCB
CVT4MS1  EQU   CVTDCB
CVT2SPS  EQU   CVTDCB
CVT1SSS  EQU   CVTDCB
CVTRSV08 EQU   CVTDCB
CVTSTB   EQU   CVTMAP+112
CVTQTD00 EQU   CVTMAP+108
CVTQTE00 EQU   CVTMAP+104
CVTCUCB  EQU   CVTMAP+100
CVTSJQ   EQU   CVTMAP+96
CVTPBLDL EQU   CVTMAP+92
CVTTPC   EQU   CVTMAP+88
CVTSVDCB EQU   CVTMAP+84
CVTBRET  EQU   CVTMAP+82
CVTEXIT  EQU   CVTMAP+80
CVT0FN00 EQU   CVTMAP+76
CVTDARA  EQU   CVTDAR+1
CVTRSV07 EQU   CVTFLGS1
CVTRSV06 EQU   CVTFLGS1
CVTRSV05 EQU   CVTFLGS1
CVTRSV04 EQU   CVTFLGS1
CVTRSV03 EQU   CVTFLGS1
CVTRSV02 EQU   CVTFLGS1
CVTRSV01 EQU   CVTFLGS1
CVTDMPLK EQU   CVTFLGS1
CVTXITP  EQU   CVTMAP+68
CVTZDTAB EQU   CVTMAP+64
CVTMSLT  EQU   CVTMAP+60
CVTDATE  EQU   CVTMAP+56
CVTBTERM EQU   CVTMAP+52
CVTSYSAD EQU   CVTMAP+48
CVTXTLER EQU   CVTMAP+44
CVTILK2  EQU   CVTMAP+40
CVTILK1  EQU   CVTMAP+36
CVTPRLTV EQU   CVTMAP+32
CVTPCNVT EQU   CVTMAP+28
CVT0VL00 EQU   CVTMAP+24
CVTXAPG  EQU   CVTMAP+20
CVTBUF   EQU   CVTMAP+16
CVTJOB   EQU   CVTMAP+12
CVTLINK  EQU   CVTMAP+8
CVT0EF00 EQU   CVTMAP+4
CVTTCBP  EQU   CVTMAP
CVT      EQU   CVTMAP
@NM00002 EQU   FRRSFLGS+1
@NM00001 EQU   FRRSFLG1
FRRSRCUR EQU   FRRSFLG1
FRRSENTS EQU   FRRS+84
FRRSRTMW EQU   FRRS+16
@NM00026 EQU   PSA+3668
PSASTAK  EQU   PSA+3072
@NM00025 EQU   PSA+1048
PSAUSEND EQU   PSA+1048
PSARV062 EQU   PSA+1044
PSACDAL  EQU   PSA+1040
PSAWTCOD EQU   PSA+1036
PSAATCVT EQU   PSA+1032
PSAPCPSW EQU   PSA+1024
PSAPIR2  EQU   PSA+1020
PSARV059 EQU   PSA+1018
PSASVC13 EQU   PSA+1016
PSASFACC EQU   PSA+1008
PSASTOP  EQU   PSA+992
PSASTART EQU   PSA+976
PSARSPSW EQU   PSA+968
PSASRPSW EQU   PSA+960
PSARV045 EQU   PSA+892
PSARV044 EQU   PSA+888
PSARV043 EQU   PSA+884
PSARV042 EQU   PSA+880
PSARV041 EQU   PSA+876
PSARV040 EQU   PSA+872
PSARV025 EQU   PSA+868
PSADSSED EQU   PSA+868
PSADSSPR EQU   PSA+864
PSADSSFW EQU   PSA+860
PSADSS14 EQU   PSA+856
PSADSSPP EQU   PSA+848
PSADSSRP EQU   PSA+840
PSADSS05 EQU   PSADSSF4
PSADSS10 EQU   PSADSSF4
PSADSSVE EQU   PSADSSF4
PSADSSDE EQU   PSADSSF4
PSADSSC0 EQU   PSADSSF4
PSADSSIE EQU   PSADSSF4
PSADSS12 EQU   PSADSSF4
PSADSSRC EQU   PSADSSF4
PSARV057 EQU   PSADSSF3
PSARV056 EQU   PSADSSF3
PSARV055 EQU   PSADSSF3
PSADSSMC EQU   PSADSSF3
PSADSSRW EQU   PSADSSF3
PSADSSNM EQU   PSADSSF3
PSADSSES EQU   PSADSSF3
PSADSSGP EQU   PSADSSF3
PSADSSF2 EQU   PSADSSFL+1
PSADSSPI EQU   PSADSSF1
PSADSSOI EQU   PSADSSF1
PSADSSSP EQU   PSADSSF1
PSADSSTP EQU   PSADSSF1
PSADSSDW EQU   PSADSSF1
PSADSSDD EQU   PSADSSF1
PSADSSDM EQU   PSADSSF1
PSADSSMV EQU   PSADSSF1
PSADSSTS EQU   PSA+816
PSADSSWK EQU   PSA+812
PSADSSR3 EQU   PSA+808
PSADSSR2 EQU   PSA+804
PSADSSRS EQU   PSA+800
PSASTOR  EQU   PSA+796
PSACPUSA EQU   PSA+794
PSAVSTAP EQU   PSA+792
PSAWKVAP EQU   PSA+788
PSAWKRAP EQU   PSA+784
PSAMCHIC EQU   PSA+783
PSARV061 EQU   PSA+782
PSASYMSK EQU   PSA+781
PSAMCHFL EQU   PSA+780
PSACR0   EQU   PSA+776
PSAPSWSV EQU   PSA+768
PSACLHS  EQU   PSAHLHI
PSALKR15 EQU   PSALKSA+60
PSALKR14 EQU   PSALKSA+56
PSALKR13 EQU   PSALKSA+52
PSALKR12 EQU   PSALKSA+48
PSALKR11 EQU   PSALKSA+44
PSALKR10 EQU   PSALKSA+40
PSALKR9  EQU   PSALKSA+36
PSALKR8  EQU   PSALKSA+32
PSALKR7  EQU   PSALKSA+28
PSALKR6  EQU   PSALKSA+24
PSALKR5  EQU   PSALKSA+20
PSALKR4  EQU   PSALKSA+16
PSALKR3  EQU   PSALKSA+12
PSALKR2  EQU   PSALKSA+8
PSALKR1  EQU   PSALKSA+4
PSALKR0  EQU   PSALKSA
PSARV023 EQU   PSACLHT+52
PSALOCAL EQU   PSACLHT+48
PSACMSL  EQU   PSACLHT+44
PSAOPTL  EQU   PSACLHT+40
PSATPACL EQU   PSACLHT+36
PSATPDNL EQU   PSACLHT+32
PSATPNCL EQU   PSACLHT+28
PSAIOSLL EQU   PSACLHT+24
PSAIOSUL EQU   PSACLHT+20
PSAIOSCL EQU   PSACLHT+16
PSAIOSSL EQU   PSACLHT+12
PSASALCL EQU   PSACLHT+8
PSAASML  EQU   PSACLHT+4
PSADISPL EQU   PSACLHT
PSASRSA  EQU   PSA+636
PSARV050 EQU   PSA+634
PSADSSGO EQU   PSA+633
PSARECUR EQU   PSA+632
PSAHLHIS EQU   PSA+628
PSAIPCSA EQU   PSA+624
@NM00024 EQU   PSA+621
PSAIPCDM EQU   PSA+620
PSAIPCD  EQU   PSA+616
@NM00023 EQU   PSA+613
PSAIPCRM EQU   PSA+612
PSAIPCR  EQU   PSA+608
PSAMCHEX EQU   PSA+600
PSAMPSW  EQU   PSA+592
PSAEXPS2 EQU   PSA+584
PSAEXPS1 EQU   PSA+576
PSAPIREG EQU   PSA+572
PSARSREG EQU   PSA+568
PSAGPREG EQU   PSA+556
PSARV022 EQU   PSASUP4
PSARV021 EQU   PSASUP4
PSARV020 EQU   PSASUP4
PSARV019 EQU   PSASUP4
PSARV018 EQU   PSASUP4
PSARV017 EQU   PSASUP4
PSARV016 EQU   PSASUP4
PSARV015 EQU   PSASUP4
PSARV014 EQU   PSASUP3
PSARV013 EQU   PSASUP3
PSARV012 EQU   PSASUP3
PSARV011 EQU   PSASUP3
PSASPR   EQU   PSASUP3
PSAPSREG EQU   PSASUP3
PSAPI2   EQU   PSASUP3
PSAIOSUP EQU   PSASUP3
PSALCR   EQU   PSASUP2
PSARTM   EQU   PSASUP2
PSAACR   EQU   PSASUP2
PSAIPCE2 EQU   PSASUP2
PSAIPCES EQU   PSASUP2
PSAIPCEC EQU   PSASUP2
PSAGTF   EQU   PSASUP2
PSAIPCRI EQU   PSASUP2
PSARV063 EQU   PSASUP1
PSATCTL  EQU   PSASUP1
PSADISP  EQU   PSASUP1
PSALOCK  EQU   PSASUP1
PSAPI    EQU   PSASUP1
PSAEXT   EQU   PSASUP1
PSASVC   EQU   PSASUP1
PSAIO    EQU   PSASUP1
PSAAOLD  EQU   PSA+548
PSAANEW  EQU   PSA+544
PSATOLD  EQU   PSA+540
PSATNEW  EQU   PSA+536
PSALCCAR EQU   PSA+532
PSALCCAV EQU   PSA+528
PSAPCCAR EQU   PSA+524
PSAPCCAV EQU   PSA+520
PSACPULA EQU   PSA+518
PSACPUPA EQU   PSA+516
PSAPSA   EQU   PSA+512
FLCHDEND EQU   PSA+512
FLCCRSAV EQU   FLCMCLA+280
FLCGRSAV EQU   FLCMCLA+216
FLCFPSAV EQU   FLCMCLA+184
FLCFLA   EQU   FLCMCLA+88
FLCRGNCD EQU   FLCMCLA+84
FLCFSAA  EQU   FLCFSA+1
@NM00022 EQU   FLCFSA
@NM00021 EQU   FLCMCLA+72
FLCMCIC  EQU   FLCMCLA+64
@NM00020 EQU   FLCMCLA+20
FLCIOAA  EQU   FLCIOA+1
@NM00019 EQU   FLCIOA
@NM00018 EQU   FLCMCLA+15
@NM00017 EQU   FLCMCLA+14
@NM00016 EQU   FLCMCLA+12
FLCLCL   EQU   FLCMCLA+8
FLCIOELA EQU   FLCIOEL+1
@NM00015 EQU   FLCIOEL
FLCCHNID EQU   FLCMCLA
@NM00014 EQU   PSA+160
FLCMTRCD EQU   PSA+157
@NM00013 EQU   PSA+156
FLCPERA  EQU   FLCPER+1
@NM00012 EQU   FLCPER
@NM00011 EQU   PSA+151
FLCPERCD EQU   PSA+150
FLCMCNUM EQU   PSA+149
@NM00010 EQU   PSA+148
FLCTEAA  EQU   FLCTEA+1
@NM00009 EQU   FLCTEA
PSAPIPC  EQU   PSAPICOD
PSAPIMC  EQU   PSAPICOD
PSAPIPER EQU   PSAPICOD
PSARV049 EQU   FLCPICOD
FLCPILCB EQU   FLCPIILC
@NM00008 EQU   FLCPIILC
@NM00007 EQU   PSAEPPSW
FLCSVCN  EQU   PSAESPSW+2
FLCSILCB EQU   FLCSVILC
@NM00006 EQU   FLCSVILC
@NM00005 EQU   PSAESPSW
FLCEICOD EQU   PSAEEPSW+2
PSASPAD  EQU   PSAEEPSW
@NM00004 EQU   PSA+128
FLCINPSW EQU   PSA+120
FLCMNPSW EQU   PSA+112
FLCPNPSW EQU   PSA+104
FLCSNPSW EQU   PSA+96
FLCENPSW EQU   PSA+88
FLCTRACE EQU   PSA+84
FLCTIMER EQU   PSA+80
FLCCVT2  EQU   PSA+76
FLCCAW   EQU   PSA+72
FLCCSW   EQU   PSA+64
FLCIOPSW EQU   PSA+56
FLCMOPSW EQU   PSA+48
FLCPOPSW EQU   PSA+40
FLCSOPSW EQU   PSA+32
FLCEOPSW EQU   PSA+24
@NM00003 EQU   FLCICCW2+4
FLCCVT   EQU   FLCICCW2
FLCICCW1 EQU   FLCROPSW
FLCIPPSW EQU   FLCRNPSW
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS
@RT00342 EQU   ZR010200
@ENDDATA EQU   *
         END   ISTZRM01,(C'PLS1053',0702,78336)
