++USERMOD(ZP60028)            /* IMPROVE MODULE HEADER FORMAT */  .
++VER(Z038) FMID(EBB1102) PRE(UZ60132)
 /*
   PROBLEM DESCRIPTION:
     DUMP FORMAT OF MODULE HEADER HIDES SOME USEFUL CHARACTERS.
       UZ60132 SUPPRESSED THE OUTPUT OF UNPRINTABLE CHARACTERS
       IN THE FORMATTING OF MODULE HEADERS BY INPLEMENTING
       TRANSLATION OF THE ORIGINAL DATA.  THE SUPPLIED TRANSLATE
       TABLE CONVERTS ALL CHARACTERS TO PERIODS EXCEPT EBCDIC
       DECIMAL DIGITS AND UPPER CASE LETTERS.

       THIS USERMODS ALLOWS THE OUTPUT OF ALL STANDARD KEYBOARD
       CHARACTERS WHILE TRANSLATING THE REST TO THE TILDE OR
       "SQUIGGLE" CHARACTER.

   SPECIAL CONDITIONS:
     ACTION:
       A "CLPA" MUST BE PERFORMED AT IPL TIME FOR THIS SYSMOD TO
       BECOME ACTIVE.

   COMMENTS:
     PRYCROFT SIX P/L PUBLIC DOMAIN USERMOD FOR MVS 3.8 NUMBER 28.
     THIS USERMOD WAS CONTRIBUTED BY TOM ARMSTRONG.

     THE FOLLOWING MODULES AND/OR MACROS ARE AFFECTED BY THIS USERMOD:
     MODULES:
       IEAVAD07
 */.
++MOD(IEAVAD07) DISTLIB(AOSC5).
ESD      
ESD      
TXT 
TXT 
TXT 
TXT 
TXT 
TXT 
TXT 
TXT 
TXT 
TXT 
TXT 
TXT 
TXT 
TXT 
TXT 
TXT 
TXT 
TXT 
TXT 
TXT 
TXT 
TXT 
TXT 
TXT 
TXT 
TXT 
TXT 
TXT 
TXT 
TXT 
TXT 
TXT 
TXT 
TXT 
TXT 
TXT 
TXT 
TXT 
TXT 
TXT 
TXT 
TXT 
TXT 
TXT 
TXT 
TXT 
TXT 
TXT 
TXT 
TXT 
TXT 
TXT 
TXT 
RLD      
END 
  IDENTIFY IEAVAD07('ZP60028')
