         TITLE 'HMASMTM4-ICT MOD SECTION BUILD (BUILD ASSEM ENTRIES)'
HMASMTM4 CSECT ,                                                   0001
@MAINENT DS    0H                                                  0001
         USING *,@15                                               0001
         B     @PROLOG                                             0001
         DC    AL1(16)                                             0001
         DC    C'HMASMTM4  78.334'                                 0001
         DROP  @15
@PROLOG  STM   @14,@12,12(@13)                                     0001
         BALR  @12,0                                               0001
@PSTART  LA    @10,4095(,@12)                                      0001
         USING @PSTART,@12                                         0001
         USING @PSTART+4095,@10                                    0001
         ST    @13,@SA00001+4                                      0001
         LA    @14,@SA00001                                        0001
         ST    @14,8(,@13)                                         0001
         LR    @13,@14                                             0001
         MVC   @PC00001(20),0(@01)                                 0001
*                                      .... NOTE - MCB NOT PRESENT IF
*                                      RESTORE.                      */
*                                                                  0211
*   /*****************************************************************/
*   /*                                                               */
*   /* ILNITIALIZE POINTERS SWITCHES PARMS ETC.                      */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0212
*   CALL INITPROC;                  /*                               */
*                                                                  0212
         BAL   @14,INITPROC                                        0212
*   /*****************************************************************/
*   /*                                                               */
*   /* SEARCH THE GTA FILE PASSED FROM CALLER AND PROCESS EACH ENTRY.*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0213
*   DO WHILE GTPRETRN^=GTPEOF&TM4HIRC=ZERO;/*                        */
*                                                                  0213
         B     @DE00213                                            0213
@DL00213 DS    0H                                                  0214
*     /***************************************************************/
*     /*                                                             */
*     /* GET AN ENTRY FROM THE GTA FILE AND SET SWITCHES ETC.        */
*     /*                                                             */
*     /***************************************************************/
*                                                                  0214
*     CALL MODINIT;                 /*                               */
*                                                                  0214
         BAL   @14,MODINIT                                         0214
*     /***************************************************************/
*     /*                                                             */
*     /* CREATE (A)CDS SOURCE ENTRY IF REQUIRED.                     */
*     /*                                                             */
*     /***************************************************************/
*                                                                  0215
*     IF MODBLD=ON THEN             /*                               */
         TM    MODBLD,B'00010000'                                  0215
         BNO   @RF00215                                            0215
*       CALL SRCENTRY;              /*                               */
*                                                                  0216
         BAL   @14,SRCENTRY                                        0216
*     /***************************************************************/
*     /*                                                             */
*     /* DETERMINE IF ICT MOD ENTRY SHOULD BE BUILT AN IF IT SHOULD  */
*     /* INDICATE ASSEMBLY.                                          */
*     /*                                                             */
*     /***************************************************************/
*                                                                  0217
*     IF MODBLD=ON THEN             /*                               */
@RF00215 TM    MODBLD,B'00010000'                                  0217
         BNO   @RF00217                                            0217
*       CALL NEEDASM;               /*                               */
*                                                                  0218
         BAL   @14,NEEDASM                                         0218
*     /***************************************************************/
*     /*                                                             */
*     /* ICT ENTRY CREATION IF THE MOD IS TO BE ASSEMBLED AND ITS    */
*     /* SYSIN HAS BEEN DETERMINED, OR IT IS MOD ENTRY NOT TO BE     */
*     /* ASSEMBLED.                                                  */
*     /*                                                             */
*     /***************************************************************/
*                                                                  0219
*     IF MODBLD=ON THEN             /* MOD ENTRY SHOULD BE BUILT ....
*                                      NOT NECESSARILY FOR ASSEMBLY  */
@RF00217 TM    MODBLD,B'00010000'                                  0219
         BNO   @RF00219                                            0219
*       DO;                                                        0220
*                                                                  0220
*         /***********************************************************/
*         /*                                                         */
*         /* CREATE AN ICT ENTRY FOR THE MODULE.                     */
*         /*                                                         */
*         /***********************************************************/
*                                                                  0221
*         CALL ICTENTRY;            /*                               */
*                                                                  0221
         BAL   @14,ICTENTRY                                        0221
*         /***********************************************************/
*         /*                                                         */
*         /* UPDATE THE GTA FILE WILTH THE ADDRESS OF THE MOD ENTRY  */
*         /* JUST BUILT. THE FILE WILL BE USED FOR BUILDING THE LIST */
*         /* OF ASSEM ADDRESSED HUNG OFF THE CAUSER MACRO OR SROUCE  */
*         /* ENTRY.                                                  */
*         /*                                                         */
*         /***********************************************************/
*                                                                  0222
*         IF MODBLD=ON THEN         /*                               */
         TM    MODBLD,B'00010000'                                  0222
         BNO   @RF00222                                            0222
*           CALL GTAUPDTE;          /*                               */
         BAL   @14,GTAUPDTE                                        0223
*       END;                                                       0224
*                                                                  0224
@RF00222 DS    0H                                                  0225
*     /***************************************************************/
*     /*                                                             */
*     /* IF ERRORS OCCURRED BUILDING THIS ENTRY SET ICT ENTRY TO     */
*     /* PREVENT FURTHER PROCESSIG FOR THE ASSEMBLY.                 */
*     /*                                                             */
*     /***************************************************************/
*                                                                  0225
*     IF MODBLD=OFF&GTPRETRN^=GTPEOF/*                               */
*         &BLDENT@^=ZERO            /* AN ASSEMBLY ENTRY WAS BUILT   */
*       THEN                                                       0225
@RF00219 TM    MODBLD,B'00010000'                                  0225
         BNZ   @RF00225                                            0225
         L     @15,@PC00001+16                                     0225
         L     @01,GTPPTR(,@15)                                    0225
         CLI   GTPRETRN(@01),4                                     0225
         BE    @RF00225                                            0225
         L     @15,BLDENT@                                         0225
         LTR   @15,@15                                             0225
         BZ    @RF00225                                            0225
*       BLDENT@->ICTMCPL(1)=ON;     /*                               */
*                                                                  0226
         OI    ICTMCPL(@15),B'00100000'                            0226
*     /***************************************************************/
*     /*                                                             */
*     /* END OF PROCESSING FOR A GTA ENTRY, GO TO TOP OF DO AND GET  */
*     /* ANOTHER.                                                    */
*     /*                                                             */
*     /***************************************************************/
*                                                                  0227
*   END;                            /*                               */
*                                                                  0227
@RF00225 DS    0H                                                  0227
@DE00213 L     @15,@PC00001+16                                     0227
         L     @01,GTPPTR(,@15)                                    0227
         CLI   GTPRETRN(@01),4                                     0227
         BE    @DC00213                                            0227
         CH    TM4HIRC,@CH00089                                    0227
         BE    @DL00213                                            0227
@DC00213 DS    0H                                                  0228
*   /*****************************************************************/
*   /*                                                               */
*   /* BUILD CHAIN OF ASSEMBLIES IN CAUSER ICT ENTRY.                */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0228
*   IF ICMODPTR^=ZERO               /* A CAUSER WAS INDICATED        */
*       &TM4HIRC<STOPPTF THEN       /* ... BY THE CALLER             */
         L     @02,@PC00001+4                                      0228
         ICM   @15,15,ICMODPTR(@02)                                0228
         BZ    @RF00228                                            0228
         CH    TM4HIRC,@CH00063                                    0228
         BNL   @RF00228                                            0228
*     CALL ASMCHAIN;                /*                               */
*                                                                  0229
         BAL   @14,ASMCHAIN                                        0229
*   /*****************************************************************/
*   /*                                                               */
*   /* RETURN TO CALLER WITH ERROR CODE.                             */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0230
*   RETURN CODE(TM4HIRC);           /* RETURN TO CALLER WITH MAX RC  */
@RF00228 LR    @15,TM4HIRC                                         0230
         L     @13,4(,@13)                                         0230
         L     @14,12(,@13)                                        0230
         LM    @00,@12,20(@13)                                     0230
         BR    @14                                                 0230
*                                                                  0231
*   /*****************************************************************/
*   /*                                                               */
*   /* INITIALIZE POINTERS SWITCHES ETC.                             */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0231
*INITPROC:                                                         0231
*   PROC;                           /*                               */
@EL00001 L     @13,4(,@13)                                         0231
@EF00001 DS    0H                                                  0231
@ER00001 LM    @14,@12,12(@13)                                     0231
         BR    @14                                                 0231
INITPROC STM   @14,@01,@SA00002                                    0231
         STM   @04,@12,@SA00002+16                                 0231
*   RFY                                                            0232
*     HMASMGTP BASED(GTPPTR);       /*                               */
*   RFY                                                            0233
*     ICTMOD BASED(ICMODPTR);       /* BASE ON MOD PARAMETER PASSED  */
*   RFY                                                            0234
*     ICTPTF BASED(ICPTFPTR);       /* BASE ON SYSMOD PARAMETER    0234
*                                      PASSED                        */
*   RFY                                                            0235
*     MCBELEMP BASED(ELMCBPTR);     /* BASE ON MCB PARAMETER PASSED  */
*   RFY                                                            0236
*     MCBPTFMP BASED(ELMCBPTR);     /* BASE ON MCB PARAMETER PASSED  */
*                                                                  0236
*   /*****************************************************************/
*   /*                                                               */
*   /* SET UP FOR MESSSAGES                                          */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0237
*   HMASMMGP=''B;                   /* AND MSG                       */
         XC    HMASMMGP(24),HMASMMGP                               0237
*   MGPPRINT=ON;                    /* ALL MSGS TO SMPOUT AND        */
*   MGPHLDS=ON;                     /* LOG                           */
*                                                                  0239
         OI    MGPPRINT,B'10010000'                                0239
*   /*****************************************************************/
*   /*                                                               */
*   /* SET UP GTP PARMS AND OPEN THE FILE.                           */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0240
*   GTPFUNCT=GTPOPENN;              /*                               */
         L     @15,@PC00001+16                                     0240
         L     @15,GTPPTR(,@15)                                    0240
         MVI   GTPFUNCT(@15),X'01'                                 0240
*   CALL HMASMGTA(HMASMGTP);        /*                               */
*                                                                  0241
         ST    @15,@AL00001                                        0241
         L     @15,@CV01857                                        0241
         LA    @01,@AL00001                                        0241
         BALR  @14,@15                                             0241
*   /*****************************************************************/
*   /*                                                               */
*   /* INIT SWITHCES POINTERS ETC.                                   */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0242
*   BLDENT@=ZERO;                   /* ADDR OF ICT MOD ENTRY         */
         SLR   @15,@15                                             0242
         ST    @15,BLDENT@                                         0242
*   IOPPTR=CCAIOPTR;                /* SET UP BASE IOP ADDRESS       */
         L     IOPPTR,CCAIOPTR(,CCAPTR)                            0243
*   TM4HIRC=ZERO;                   /* INITIALIZE HIGHEST RC       0244
*                                      COLLECTOR                     */
         SLR   TM4HIRC,TM4HIRC                                     0244
*   TM4SWCH1=OFF;                   /* INITIALIZE LOCAL SWITCHES     */
         MVI   TM4SWCH1,B'00000000'                                0245
*   TM4SWCH2=OFF;                   /* INITIALIZE LOCAL SWITCHES     */
*                                                                  0246
         MVI   TM4SWCH2,B'00000000'                                0246
*   /*****************************************************************/
*   /*                                                               */
*   /* DETERMINE CAUSER TYPE AND SET INDICATOR.                      */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0247
*   IF ICMODPTR^=ZERO THEN          /* CALLER INDICATED A CAUSER     */
         L     @14,@PC00001+4                                      0247
         L     @14,ICMODPTR(,@14)                                  0247
         CR    @14,@15                                             0247
         BE    @RF00247                                            0247
*     DO;                           /*                               */
*       IF ICTMMACR(1)=ON×ICTMMACU(1)=ON THEN/* MAC MODIFICATION     */
         TM    ICTMMACR(@14),B'00001100'                           0249
         BZ    @RF00249                                            0249
*         MACTYPE=ON;               /*                               */
         OI    MACTYPE,B'10000000'                                 0250
*       ELSE                        /* SRC MODIFICATION              */
*         SRCTYPE=ON;               /*                               */
         B     @RC00249                                            0251
@RF00249 OI    SRCTYPE,B'01000000'                                 0251
*     END;                          /*                               */
*   END INITPROC;                   /*                               */
@EL00002 DS    0H                                                  0253
@EF00002 DS    0H                                                  0253
@ER00002 LM    @14,@01,@SA00002                                    0253
         LM    @04,@12,@SA00002+16                                 0253
         BR    @14                                                 0253
*MODINIT:                                                          0254
*   PROC;                           /*                               */
MODINIT  STM   @14,@02,@SA00003                                    0254
         STM   @05,@12,@SA00003+20                                 0254
*   RFY                                                            0255
*     HMASMIOP BASED(IOPPTR);       /*                               */
*                                                                  0255
*   /*****************************************************************/
*   /*                                                               */
*   /* INITIALIZE CONTROL SWITHCES ETC. USED FOR EACH MOD.           */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0256
*   ASMSYSIN=BLANKS;                /* ASSEMBLY SYSIN DD NAME        */
         MVC   ASMSYSIN(8),BLANKS                                  0256
*   BLDENT@=ZERO;                   /* PTR TO ICT MOD ENTRY          */
         SLR   @05,@05                                             0257
         ST    @05,BLDENT@                                         0257
*   STOWSRC=OFF;                    /* FOR (A)CDS SRC ENTRY STOW     */
*   SRCICT=OFF;                     /* SRC ENTRY IN ICT              */
*   SRCFND=OFF;                     /* SRC ENTRY ON (A)CDS           */
*   MODBLD=OFF;                     /* OK TO BUILD MOD ICT ENTRY     */
*   MODASM=OFF;                     /* SET UP MOD ENTRY FOR ASSMBLY  */
         NI    STOWSRC,B'00000111'                                 0262
*   SAVEBUPT=BLANKS;                /*                               */
         MVC   SAVEBUPT(7),BLANKS                                  0263
*   SAVEBUTP='';                    /*                               */
*                                                                  0264
         SLR   SAVEBUTP,SAVEBUTP                                   0264
*   /*****************************************************************/
*   /*                                                               */
*   /* GET A ASSEMBLY RECORD FROM THE GTA FILE.                      */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0265
*   GTPFUNCT=GTPGETN;               /*                               */
         L     @05,@PC00001+16                                     0265
         L     @05,GTPPTR(,@05)                                    0265
         MVI   GTPFUNCT(@05),X'08'                                 0265
*   CALL HMASMGTA(HMASMGTP);        /*                               */
         ST    @05,@AL00001                                        0266
         L     @15,@CV01857                                        0266
         LA    @01,@AL00001                                        0266
         BALR  @14,@15                                             0266
*   IF GTPRETRN>GTPEOF THEN         /*                               */
         L     @05,@PC00001+16                                     0267
         L     @05,GTPPTR(,@05)                                    0267
         CLI   GTPRETRN(@05),4                                     0267
         BNH   @RF00267                                            0267
*     TM4HIRC=MAX(TM4HIRC,GTPRETRN);/* SET ERROR CODE                */
         SLR   @02,@02                                             0268
         IC    @02,GTPRETRN(,@05)                                  0268
         CR    TM4HIRC,@02                                         0268
         BNL   *+6
         LR    TM4HIRC,@02                                         0268
*   IF GTPRETRN=GTPGOOD THEN        /*                               */
@RF00267 L     @05,@PC00001+16                                     0269
         L     @05,GTPPTR(,@05)                                    0269
         CLI   GTPRETRN(@05),0                                     0269
         BNE   @RF00269                                            0269
*     MODBLD=ON;                    /* ASSUME GOOD ASSEMBLY ENTRY    */
         OI    MODBLD,B'00010000'                                  0270
*   END MODINIT;                    /*                               */
@EL00003 DS    0H                                                  0271
@EF00003 DS    0H                                                  0271
@ER00003 LM    @14,@02,@SA00003                                    0271
         LM    @05,@12,@SA00003+20                                 0271
         BR    @14                                                 0271
*SRCENTRY:                                                         0272
*   PROC;                           /*                               */
SRCENTRY STM   @14,@02,@SA00004                                    0272
         STM   @04,@12,@SA00004+20                                 0272
*   RFY                                                            0273
*     HMASMIOP BASED(IOPPTR);       /*                               */
*   RFY                                                            0274
*     MCBELEMP BASED(ELMCBPTR);     /* MCB PASSED FROM CALLER        */
*   RFY                                                            0275
*     ICTMOD BASED(CCAICMOD);       /* GET ENTIRE MOD SECTION        */
*                                                                  0275
*   /*****************************************************************/
*   /*                                                               */
*   /* INIT SOME SAVE AREAS.                                         */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0276
*   SAVEDLIB=BLANKS;                /* NO DLIB DDNAME FOR SRC        */
         MVC   SAVEDLIB(8),BLANKS                                  0276
*   SAVESYS=BLANKS;                 /* NO SYSLIB DDNAME FOR SRC      */
         MVC   SAVESYS(8),BLANKS                                   0277
*   SAVEFMID=BLANKS;                /* NO FMID                       */
         MVC   SAVEFMID(7),BLANKS                                  0278
*   ASMSYSIN=BLANKS;                /* NO ASSEMBLER SYSIN DDNAME     */
*                                                                  0279
         MVC   ASMSYSIN(8),BLANKS                                  0279
*   /*****************************************************************/
*   /*                                                               */
*   /* IF THE CAUSER OF THE ASSEMBLY IS A SOURCE THEN DATA FROM ITS  */
*   /* ICT ENTRY IS SAVED FOR LATER USE.                             */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0280
*   IF SRCTYPE=ON THEN              /*                               */
         TM    SRCTYPE,B'01000000'                                 0280
         BNO   @RF00280                                            0280
*     DO;                           /*                               */
*       SAVESYS=ICMODPTR->ICTTOLIB(1);/* SAVE FOR USE AS INPUT DSN   */
         L     @15,@PC00001+4                                      0282
         L     @15,ICMODPTR(,@15)                                  0282
         MVC   SAVESYS(8),ICTTOLIB(@15)                            0282
*       SAVEFMID=ICMODPTR->ICTMFMID(1);/* SAVE FMID                  */
         MVC   SAVEFMID(7),ICTMFMID(@15)                           0283
*       SAVEDLIB=ICMODPTR->ICTMDSTL(1);/*                            */
         MVC   SAVEDLIB(8),ICTMDSTL(@15)                           0284
*       SRCICT=ON;                  /* INDICATES ICT ENTRY FOUND     */
         OI    SRCICT,B'01000000'                                  0285
*     END;                          /*                               */
*                                                                  0286
*   /*****************************************************************/
*   /*                                                               */
*   /* IF THE CAUSER IS NOT A SRC THEN THIS IS A ASSEMBLY CAUSED BY A*/
*   /* MACRO. THE ASSEMBLIES ARE DIRECTLY RELATED TO THE MACRO OR ,  */
*   /* AT RESTORE, THOSE ASSEMBLIES NOT RELATABLE TO A CAUSER.       */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0287
*   ELSE                                                           0287
*     DO;                                                          0287
*                                                                  0287
         B     @RC00280                                            0287
@RF00280 DS    0H                                                  0288
*       /*************************************************************/
*       /*                                                           */
*       /* IF AN ICT ENTRY ALREADY EXISTS FOR THIS ELEMENT THEN THE  */
*       /* (A) CDS PROCESSING HAS ALREADY BEEN DONE.                 */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0288
*       SRCICT=OFF;                 /* INIT LOOP SWITCH              */
         NI    SRCICT,B'10111111'                                  0288
*       DO M=1 BY 1 WHILE ICTMEND(M)^=ICTENDNT/* LOOP THRU MODS      */
*             &SRCICT=OFF;          /* UNTIL END OR MATCH            */
         LA    M,1                                                 0289
         B     @DE00289                                            0289
@DL00289 DS    0H                                                  0290
*         IF(ICTMSRCR(M)=ON×ICTMSRCU(M)=ON)/* SOURCE TYPE            */
*             &ICTMNAME(M)=ASSMNM THEN/* AND RIGHT NAME              */
         LR    @05,M                                               0290
         MH    @05,@CH01971                                        0290
         L     @15,CCAICMOD(,CCAPTR)                               0290
         ST    @05,@TF00001                                        0290
         ALR   @05,@15                                             0290
         AL    @05,@CF01990                                        0290
         TM    ICTMSRCR-9(@05),B'00000011'                         0290
         BZ    @RF00290                                            0290
         L     @05,@PC00001+16                                     0290
         L     @05,GTPPTR(,@05)                                    0290
         L     @05,GTPBUFAD(,@05)                                  0290
         LR    @14,@15                                             0290
         AL    @14,@TF00001                                        0290
         AL    @14,@CF01991                                        0290
         CLC   ICTMNAME(8,@14),ASSMNM(@05)                         0290
         BNE   @RF00290                                            0290
*           DO;                     /*                               */
*             SRCICT=ON;            /* INDICATE SRC ENTRY FOUND      */
         OI    SRCICT,B'01000000'                                  0292
*             SAVESYS=ICTTOLIB(M);  /* SAVE TOLIB FOR LATER          */
         LR    @05,@15                                             0293
         AL    @05,@TF00001                                        0293
         AL    @05,@CF01992                                        0293
         MVC   SAVESYS(8),ICTTOLIB-32(@05)                         0293
*             SAVEFMID=ICTMFMID(M); /* SAVE FMID                     */
         LR    @05,@15                                             0294
         AL    @05,@TF00001                                        0294
         AL    @05,@CF01993                                        0294
         MVC   SAVEFMID(7),ICTMFMID-88(@05)                        0294
*             SAVEDLIB=ICTMDSTL(M); /*                               */
         AL    @15,@TF00001                                        0295
         AL    @15,@CF01994                                        0295
         MVC   SAVEDLIB(8),ICTMDSTL-48(@15)                        0295
*           END;                    /*                               */
*       END;                        /*                               */
*                                                                  0297
@RF00290 AH    M,@CH00071                                          0297
@DE00289 LR    @05,M                                               0297
         MH    @05,@CH01971                                        0297
         L     @01,CCAICMOD(,CCAPTR)                               0297
         AL    @01,@CF01991                                        0297
         L     @05,ICTMEND(@05,@01)                                0297
         CL    @05,ICTENDNT                                        0297
         BE    @DC00289                                            0297
         TM    SRCICT,B'01000000'                                  0297
         BZ    @DL00289                                            0297
@DC00289 DS    0H                                                  0298
*       /*************************************************************/
*       /*                                                           */
*       /* IF NO ICT ENTRY THEN (A)CDS PROCESSING MUST BE DONE.      */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0298
*       IF SRCICT=OFF THEN          /*                               */
         TM    SRCICT,B'01000000'                                  0298
         BNZ   @RF00298                                            0298
*         DO;                       /*                               */
*                                                                  0299
*           /*********************************************************/
*           /*                                                       */
*           /* CHECK FOR ENTRY ALREADY ON (A)CDS.                    */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0300
*           IOPDSID=TBLXCDSI;       /* CDS OR ACDS                   */
         L     @15,@PC00001                                        0300
         MVC   IOPDSID(1,IOPPTR),TBLXCDSI(@15)                     0300
*           IOPFUNCT=IOPLOC;        /*                               */
         MVI   IOPFUNCT(IOPPTR),X'03'                              0301
*           IOPTYPE=IOPSRC;         /*                               */
         MVI   IOPTYPE(IOPPTR),X'08'                               0302
*           IOPNAME=ASSMNM;         /*                               */
         L     @15,@PC00001+16                                     0303
         L     @01,GTPPTR(,@15)                                    0303
         L     @01,GTPBUFAD(,@01)                                  0303
         MVC   IOPNAME(8,IOPPTR),ASSMNM(@01)                       0303
*           CALL HMASMIO(HMASMIOP); /*                               */
*                                                                  0304
         ST    IOPPTR,@AL00001                                     0304
         L     @15,@CV01853                                        0304
         LA    @01,@AL00001                                        0304
         BALR  @14,@15                                             0304
*           /*********************************************************/
*           /*                                                       */
*           /* ENTRY THERE, SET INDICATOR, SAVE DLISTLIB AND SYSLIB. */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0305
*           IF IOPRETRN=IOPGOOD THEN/*                               */
         CLI   IOPRETRN(IOPPTR),0                                  0305
         BNE   @RF00305                                            0305
*             DO;                   /*                               */
*               SRCFND=ON;          /*                               */
         OI    SRCFND,B'00100000'                                  0307
*               SAVESYS=IOPSRSYS;   /*                               */
         MVC   SAVESYS(8),IOPSRSYS(IOPPTR)                         0308
*               SAVEDLIB=IOPSRDLB;  /*                               */
         MVC   SAVEDLIB(8),IOPSRDLB(IOPPTR)                        0309
*               SAVEFMID=IOPFMID;   /*                               */
         MVC   SAVEFMID(7),IOPFMID(IOPPTR)                         0310
*             END;                  /*                               */
*                                                                  0311
*           /*********************************************************/
*           /*                                                       */
*           /* THE FOLLOWING PROCESSING IS FOR APPLY , ACCEPT OR     */
*           /* RESTORE WITH THE ASSEMBLY CAUSER KNOWN                */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0312
*           IF ICMODPTR^=ZERO THEN  /* ASSEMBLY CAUSER IS KNOWN      */
@RF00305 L     @15,@PC00001+4                                      0312
         L     @15,ICMODPTR(,@15)                                  0312
         LTR   @15,@15                                             0312
         BZ    @RF00312                                            0312
*             DO;                   /*                               */
*                                                                  0313
*               /*****************************************************/
*               /*                                                   */
*               /* IF THE DISTLIB FOR THE SRC HAS NOT YET BEEN       */
*               /* DETERMINED THEN USE ASMLIB FROM THE MACRO IN THE  */
*               /* SYSMOD.                                           */
*               /*                                                   */
*               /*****************************************************/
*                                                                  0314
*               IF SAVEDLIB=BLANKS THEN/*                            */
         CLC   SAVEDLIB(8),BLANKS                                  0314
         BNE   @RF00314                                            0314
*                 SAVEDLIB=ICMODPTR->ICTMASLB(1);/* ASMLIB FROM MAC
*                                      ICT                           */
*                                                                  0315
         MVC   SAVEDLIB(8),ICTMASLB(@15)                           0315
*               /*****************************************************/
*               /*                                                   */
*               /* IF SRC ENTRY NOT FOUND BUT ITS DISTLIB HAS BEEN   */
*               /* DETERMINED, THEN A CDS ENTRY CAN BE CREATED.      */
*               /*                                                   */
*               /*****************************************************/
*                                                                  0316
*               IF SRCFND=OFF&SAVEDLIB^=BLANKS THEN/*                */
@RF00314 TM    SRCFND,B'00100000'                                  0316
         BNZ   @RF00316                                            0316
         CLC   SAVEDLIB(8),BLANKS                                  0316
         BE    @RF00316                                            0316
*                 STOWSRC=ON;       /*                               */
*                                                                  0317
         OI    STOWSRC,B'10000000'                                 0317
*               /*****************************************************/
*               /*                                                   */
*               /* IF THE SYSLIB HAS NOT YET BEEN DETERMINED THEN    */
*               /* CHECK FOR DISTLIB AS SYSGEN TOTAL COPY TO         */
*               /* DETERMINE SYSLIB.                                 */
*               /*                                                   */
*               /*****************************************************/
*                                                                  0318
*               IF CCAAPPLY=ON      /*                               */
*                   &SAVESYS=BLANKS /* NEED SYSLIB                   */
*                   &SAVEDLIB^=BLANKS/* A DISTLIB IS KNOWN           */
*                   &IOPRETRN<=IOPNOTFD THEN/* NO IO ERRORS          */
@RF00316 TM    CCAAPPLY(CCAPTR),B'01000000'                        0318
         BNO   @RF00318                                            0318
         CLC   SAVESYS(8),BLANKS                                   0318
         BNE   @RF00318                                            0318
         CLC   SAVEDLIB(8),BLANKS                                  0318
         BE    @RF00318                                            0318
         CLI   IOPRETRN(IOPPTR),4                                  0318
         BH    @RF00318                                            0318
*                 DO;               /*                               */
*                   RFY                                            0320
*                     HMASMIOP BASED(TBLXIOP2);/* IOP FOR DLIB LOCATE*/
*                   IOPDSID=IOPCDSM;/*                               */
         L     @15,@PC00001                                        0321
         L     @15,TBLXIOP2(,@15)                                  0321
         MVI   IOPDSID(@15),X'02'                                  0321
*                   IOPFUNCT=IOPLOC;/* SET FUNCTION TO LOCATE        */
         MVI   IOPFUNCT(@15),X'03'                                 0322
*                   IOPTYPE=IOPDLB; /* INDICATE DLIB ENTRY           */
         MVI   IOPTYPE(@15),X'06'                                  0323
*                   IOPNAME=SAVEDLIB;/* DISTLIB ENTRY NAME           */
         MVC   IOPNAME(8,@15),SAVEDLIB                             0324
*                   CALL HMASMIO(HMASMIOP);/* CALL SMP IO INTERFACE
*                                      MODULE                        */
         ST    @15,@AL00001                                        0325
         L     @15,@CV01853                                        0325
         LA    @01,@AL00001                                        0325
         BALR  @14,@15                                             0325
*                   IF IOPRETRN=IOPGOOD THEN/* TOTAL COPY DLIB     0326
*                                      (IE.-FOUND)                   */
*                                                                  0326
         L     @15,@PC00001                                        0326
         L     @01,TBLXIOP2(,@15)                                  0326
         CLI   IOPRETRN(@01),0                                     0326
         BNE   @RF00326                                            0326
*                     /***********************************************/
*                     /*                                             */
*                     /* SAVE THE TARGET SYSLIB FROM THE DLIB ENTRY  */
*                     /*                                             */
*                     /***********************************************/
*                                                                  0327
*                     DO L=1 BY 1 WHILE IOPDLBND(L)^=IOPEOLST;/*     */
         LA    L,1                                                 0327
         B     @DE00327                                            0327
@DL00327 DS    0H                                                  0328
*                       IF IOPDLIND(L)=IOPDLSYS THEN/* SYSLIB TYPE 0328
*                                      ENTRY?                        */
         LR    @05,L                                               0328
         MH    @05,@CH00527                                        0328
         L     @15,@PC00001                                        0328
         L     @15,TBLXIOP2(,@15)                                  0328
         SLR   @14,@14                                             0328
         IC    @14,IOPDLIND-9(@05,@15)                             0328
         CH    @14,@CH00071                                        0328
         BNE   @RF00328                                            0328
*                         DO;       /*                               */
*                           SAVESYS=IOPDSYS(L);/* SAVE SYSLIB        */
         ALR   @15,@05                                             0330
         MVC   SAVESYS(8),IOPDSYS-9(@15)                           0330
*                           STOWSRC=ON;/* SRC ENTRY TO BE CHANGED    */
         OI    STOWSRC,B'10000000'                                 0331
*                         END;      /*                               */
*                     END;          /*                               */
@RF00328 AH    L,@CH00071                                          0333
@DE00327 LR    @05,L                                               0333
         MH    @05,@CH00527                                        0333
         L     @15,@PC00001                                        0333
         L     @01,TBLXIOP2(,@15)                                  0333
         SLR   @00,@00                                             0333
         IC    @00,IOPDLBND-9(@05,@01)                             0333
         CH    @00,@CH00716                                        0333
         BNE   @DL00327                                            0333
*                 END;              /*                               */
*                                                                  0334
@RF00326 DS    0H                                                  0335
*               /*****************************************************/
*               /*                                                   */
*               /* ADD OR MODIFY THE CDS SRC ENTRY                   */
*               /*                                                   */
*               /*****************************************************/
*                                                                  0335
*               RFY                                                0335
*                 HMASMIOP BASED(IOPPTR);/*                          */
@RF00318 DS    0H                                                  0336
*               IF STOWSRC=ON THEN  /*                               */
         TM    STOWSRC,B'10000000'                                 0336
         BNO   @RF00336                                            0336
*                 DO;               /*                               */
*                   IOPBUTYP=IOPBUMOD;/* MODIFY THE ENTRY            */
         MVI   IOPBUTYP(IOPPTR),X'03'                              0338
*                   IF SRCFND=OFF THEN/* NO CDS ENTRY                */
         TM    SRCFND,B'00100000'                                  0339
         BNZ   @RF00339                                            0339
*                     DO;           /*                               */
*                       IOPMACNT=''B;/* INIT MAC ENTRY               */
         XC    IOPMACNT(104,IOPPTR),IOPMACNT(IOPPTR)               0341
*                       IOPMACFX=BLANKS;/* INIT FIXED FIELD          */
         MVI   IOPMACFX+8(IOPPTR),C' '                             0342
         MVC   IOPMACFX+9(71,IOPPTR),IOPMACFX+8(IOPPTR)            0342
         MVC   IOPMACFX(8,IOPPTR),BLANKS                           0342
*                       IOPMCLNG=IOPMCASI;/* LANGUAGE TYPE           */
         MVI   IOPMCLNG(IOPPTR),X'00'                              0343
*                       IOPNTLVL=IOPMACLC;/* CURENT LEVEL            */
         MVI   IOPNTLVL(IOPPTR),X'03'                              0344
*                       IOPRMID=NULLPTF#;/* RMID VALUE ==> NEW     0345
*                                      ELEMENT                       */
         MVC   IOPRMID(7,IOPPTR),@CC01873                          0345
*                       IOPFMID=NULLPTF#;/* FMID VALUE ==> NEW     0346
*                                      ELEMENT                       */
         MVC   IOPFMID(7,IOPPTR),@CC01873                          0346
*                       IOPBUTYP=IOPBUADD;/* ADD THE ENTRY           */
         MVI   IOPBUTYP(IOPPTR),X'01'                              0347
*                       IOPMACND(1)=IOPEOLST;/* VARIABLE LIST NULL   */
         MVI   IOPMACND(IOPPTR),X'FF'                              0348
*                       IOPDLIB=SAVEDLIB;/* DISTRIBUTION LIB FROM ICT*/
         MVC   IOPDLIB(8,IOPPTR),SAVEDLIB                          0349
*                     END;          /*                               */
*                   IOPFUNCT=IOPSTOWR;/* INDICATE STOW REPLACE     0351
*                                      FUNCTION                      */
@RF00339 MVI   IOPFUNCT(IOPPTR),X'54'                              0351
*                   IOPTYPE=IOPSRC; /* INDICATE SRC ENTRY            */
         MVI   IOPTYPE(IOPPTR),X'08'                               0352
*                   IOPNAME=ASSMNM; /* SRC NAME BEING PROCESSED      */
         L     @15,@PC00001+16                                     0353
         L     @01,GTPPTR(,@15)                                    0353
         L     @01,GTPBUFAD(,@01)                                  0353
         MVC   IOPNAME(8,IOPPTR),ASSMNM(@01)                       0353
*                   IOPBUSMD=ICPTFPTR->ICTPTFS(1);/* SYSMOD CAUSING
*                                      STOW                          */
         L     @15,@PC00001+8                                      0354
         L     @01,ICPTFPTR(,@15)                                  0354
         MVC   IOPBUSMD(7,IOPPTR),ICTPTFS(@01)                     0354
*                   IOPMCSYS=SAVESYS;/* SYSLIB VALUE                 */
         MVC   IOPMCSYS(8,IOPPTR),SAVESYS                          0355
*                   IOPDSID=TBLXCDSI;/* CDS OR ACDS                  */
         L     @15,@PC00001                                        0356
         MVC   IOPDSID(1,IOPPTR),TBLXCDSI(@15)                     0356
*                   CALL HMASMIO(HMASMIOP);/*                        */
         ST    IOPPTR,@AL00001                                     0357
         L     @15,@CV01853                                        0357
         LA    @01,@AL00001                                        0357
         BALR  @14,@15                                             0357
*                 END;              /*                               */
*               IF IOPRETRN>IOPNTFND THEN/* IF ERROR                 */
@RF00336 CLI   IOPRETRN(IOPPTR),4                                  0359
         BNH   @RF00359                                            0359
*                 DO;               /*                               */
*                   TM4HIRC=MAX(TM4HIRC,IOPRETRN);/* SET CODE        */
         SLR   @15,@15                                             0361
         IC    @15,IOPRETRN(,IOPPTR)                               0361
         CR    TM4HIRC,@15                                         0361
         BNL   *+6
         LR    TM4HIRC,@15                                         0361
*                   MODBLD=OFF;     /* ENTRY FOR ASSEMBLY IS NOGO    */
         NI    MODBLD,B'11101111'                                  0362
*                 END;              /*                               */
*             END;                  /*                               */
*         END;                      /*                               */
*     END;                          /*                               */
*   END SRCENTRY;                   /*                               */
@EL00004 DS    0H                                                  0367
@EF00004 DS    0H                                                  0367
@ER00004 LM    @14,@02,@SA00004                                    0367
         LM    @04,@12,@SA00004+20                                 0367
         BR    @14                                                 0367
*NEEDASM:                                                          0368
*   PROC;                           /*                               */
NEEDASM  STM   @14,@02,@SA00005                                    0368
         STM   @05,@12,@SA00005+20                                 0368
*   RFY                                                            0369
*     HMASMIOP BASED(IOPPTR);       /*                               */
*                                                                  0369
*   /*****************************************************************/
*   /*                                                               */
*   /* DETERMINE IF AN ASSEMBLY IS TO BE SET UP.                     */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0370
*   MODBLD=OFF;                     /* ASSUME NO MOD ENTRY OR        */
*   MODASM=OFF;                     /* ...ASSEMBLY .                 */
*                                                                  0371
         NI    MODBLD,B'11100111'                                  0371
*   /*****************************************************************/
*   /*                                                               */
*   /* IF APPLY OR ACCEPT, CHECK FOR DISTMOD VALUE. IF NOT SPECIFIED */
*   /* THEN (A)CDS MOD ENTRY IS CHECKED .                            */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0372
*   IF CCAAPPLY=ON                  /*                               */
*       ×CCAACCPT=ON THEN           /*                               */
         TM    CCAAPPLY(CCAPTR),B'01100000'                        0372
         BZ    @RF00372                                            0372
*     DO;                           /*                               */
*                                                                  0373
*       /*************************************************************/
*       /*                                                           */
*       /* CHECK FOR DISTMOD VALUE FIRST.                            */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0374
*       IF ICMODPTR->ICTMDOBJ(1)^=BLANKS THEN/*                      */
         L     @05,@PC00001+4                                      0374
         L     @05,ICMODPTR(,@05)                                  0374
         CLC   ICTMDOBJ(8,@05),BLANKS                              0374
         BE    @RF00374                                            0374
*         DO;                       /*                               */
*           MODBLD=ON;              /* OK TO ASSEMBLE                */
*           MODASM=ON;              /*                               */
         OI    MODBLD,B'00011000'                                  0377
*         END;                      /*                               */
*                                                                  0378
*       /*************************************************************/
*       /*                                                           */
*       /* NO DISTMOD SO MUST CHECK FOR A MOD ENTRY.                 */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0379
*       ELSE                        /*                               */
*         DO;                       /*                               */
         B     @RC00374                                            0379
@RF00374 DS    0H                                                  0380
*           IOPFUNCT=IOPLOC;        /*                               */
         MVI   IOPFUNCT(IOPPTR),X'03'                              0380
*           IOPDSID=TBLXCDSI;       /*                               */
         L     @05,@PC00001                                        0381
         MVC   IOPDSID(1,IOPPTR),TBLXCDSI(@05)                     0381
*           IOPNAME=ASSMNM;         /*                               */
         L     @05,@PC00001+16                                     0382
         L     @05,GTPPTR(,@05)                                    0382
         L     @05,GTPBUFAD(,@05)                                  0382
         MVC   IOPNAME(8,IOPPTR),ASSMNM(@05)                       0382
*           IOPTYPE=IOPMOD;         /*                               */
         MVI   IOPTYPE(IOPPTR),X'05'                               0383
*           CALL HMASMIO(HMASMIOP); /*                               */
         ST    IOPPTR,@AL00001                                     0384
         L     @15,@CV01853                                        0384
         LA    @01,@AL00001                                        0384
         BALR  @14,@15                                             0384
*           IF IOPRETRN=IOPGOOD&    /* MOD ENTRY EXISTS              */
*               (CCAAPPLY=ON        /* MAKES IT OK IF APPLY          */
*               ×                   /*                               */
*               (CCAACCPT=ON        /* ..IF ACCEPT MUST NOT BE       */
*               &IOPDLIB^='SYSPUNCH'/* A GENASSEM ENTRY              */
*               &IOPDLIB^=BLANKS)) THEN/*                            */
         CLI   IOPRETRN(IOPPTR),0                                  0385
         BNE   @RF00385                                            0385
         TM    CCAAPPLY(CCAPTR),B'01000000'                        0385
         BO    @RT00385                                            0385
         TM    CCAACCPT(CCAPTR),B'00100000'                        0385
         BNO   @RF00385                                            0385
         CLC   IOPDLIB(8,IOPPTR),@CC01939                          0385
         BE    @RF00385                                            0385
         CLC   IOPDLIB(8,IOPPTR),BLANKS                            0385
         BE    @RF00385                                            0385
@RT00385 DS    0H                                                  0386
*             DO;                   /*                               */
*               MODBLD=ON;          /* MUST ASSEMBLE                 */
*               MODASM=ON;          /*                               */
         OI    MODBLD,B'00011000'                                  0388
*             END;                  /*                               */
*         END;                      /*                               */
*                                                                  0390
@RF00385 DS    0H                                                  0391
*       /*************************************************************/
*       /*                                                           */
*       /* IO ERROR CHECK                                            */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0391
*       IF IOPRETRN>IOPNTFND THEN   /* IO ERROR                      */
@RC00374 CLI   IOPRETRN(IOPPTR),4                                  0391
         BNH   @RF00391                                            0391
*         DO;                       /*                               */
*           TM4HIRC=MAX(TM4HIRC,IOPRETRN);/*                         */
         SLR   @05,@05                                             0393
         IC    @05,IOPRETRN(,IOPPTR)                               0393
         CR    TM4HIRC,@05                                         0393
         BNL   *+6
         LR    TM4HIRC,@05                                         0393
*           MODBLD=OFF;             /*                               */
*           MODASM=OFF;             /*                               */
         NI    MODBLD,B'11100111'                                  0395
*         END;                      /*                               */
*     END;                          /*                               */
*                                                                  0397
@RF00391 DS    0H                                                  0398
*   /*****************************************************************/
*   /*                                                               */
*   /* IF RESTORE THEN CHECK ACDS MOD ENTRY TO DETERMINE IF ASSEMBLY */
*   /* NEED BE DONE.                                                 */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0398
*   RFY                                                            0398
*     HMASMIOP BASED(TBLXIOP2);     /* SPECIAL IOP FOR RESTORE     0398
*                                      ...TIME LOCATE OF CDS MOD   0398
*                                      ENTRY.                        */
@RF00372 DS    0H                                                  0399
*   IF CCARES=ON THEN               /*                               */
         TM    CCARES(CCAPTR),B'00001000'                          0399
         BNO   @RF00399                                            0399
*     DO;                           /*                               */
*       IOPFUNCT=IOPLOC;            /*                               */
         L     @05,@PC00001                                        0401
         L     @05,TBLXIOP2(,@05)                                  0401
         MVI   IOPFUNCT(@05),X'03'                                 0401
*       IOPDSID=IOPCDSA;            /*                               */
         MVI   IOPDSID(@05),X'0C'                                  0402
*       IOPNAME=ASSMNM;             /*                               */
         L     @15,@PC00001+16                                     0403
         L     @01,GTPPTR(,@15)                                    0403
         L     @01,GTPBUFAD(,@01)                                  0403
         MVC   IOPNAME(8,@05),ASSMNM(@01)                          0403
*       IOPTYPE=IOPMOD;             /*                               */
         MVI   IOPTYPE(@05),X'05'                                  0404
*       CALL HMASMIO(HMASMIOP);     /*                               */
         ST    @05,@AL00001                                        0405
         L     @15,@CV01853                                        0405
         LA    @01,@AL00001                                        0405
         BALR  @14,@15                                             0405
*       IF IOPRETRN=IOPGOOD&        /* BYPASS THE ASSEMBLY IF A      */
*           (IOPDLIB^='SYSPUNCH'    /* ... DLIB OBJECT MODULE        */
*           &IOPDLIB^=BLANKS) THEN  /* ..... CAN BE OBTAINED.        */
         L     @05,@PC00001                                        0406
         L     @05,TBLXIOP2(,@05)                                  0406
         CLI   IOPRETRN(@05),0                                     0406
         BNE   @RF00406                                            0406
         CLC   IOPDLIB(8,@05),@CC01939                             0406
         BE    @RF00406                                            0406
         CLC   IOPDLIB(8,@05),BLANKS                               0406
         BE    @RF00406                                            0406
*         DO;                       /*                               */
*           MODBLD=ON;              /* BUILD MOD ICT ENTRY BUT       */
*           MODASM=OFF;             /* ... DONT ASSEMBL IT           */
         OI    MODBLD,B'00010000'                                  0409
         NI    MODASM,B'11110111'                                  0409
*         END;                      /*                               */
*       ELSE                        /* OTHERWISE ....                */
*         DO;                       /*                               */
         B     @RC00406                                            0411
@RF00406 DS    0H                                                  0412
*           MODBLD=ON;              /* ....SCHEDULE THE ASSEMBLY.    */
*           MODASM=ON;              /*                               */
         OI    MODBLD,B'00011000'                                  0413
*         END;                      /*                               */
*                                                                  0414
*       /*************************************************************/
*       /*                                                           */
*       /* IF NOT ON ACDS CHECK FOR CDS MOD ENTRY TO DETERMINE IF ICT*/
*       /* MOD ENTRY BUILDING SHOULD CONTINUE.                       */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0415
*       IF IOPRETRN=IOPNOTFD THEN   /*                               */
@RC00406 L     @05,@PC00001                                        0415
         L     @05,TBLXIOP2(,@05)                                  0415
         CLI   IOPRETRN(@05),4                                     0415
         BNE   @RF00415                                            0415
*         DO;                       /*                               */
*           IOPDSID=IOPCDSM;        /*                               */
         MVI   IOPDSID(@05),X'02'                                  0417
*           CALL HMASMIO(HMASMIOP); /*                               */
         ST    @05,@AL00001                                        0418
         L     @15,@CV01853                                        0418
         LA    @01,@AL00001                                        0418
         BALR  @14,@15                                             0418
*           IF IOPRETRN^=IOPGOOD THEN/* NO ENTRY EXISTS              */
         L     @05,@PC00001                                        0419
         L     @05,TBLXIOP2(,@05)                                  0419
         CLI   IOPRETRN(@05),0                                     0419
         BE    @RF00419                                            0419
*             DO;                   /*                               */
*               MODBLD=OFF;         /* NO ICT MOD ENTRY TO BE BUILT  */
*               MODASM=OFF;         /*                               */
         NI    MODBLD,B'11100111'                                  0422
*             END;                  /*                               */
*         END;                      /*                               */
*                                                                  0424
@RF00419 DS    0H                                                  0425
*       /*************************************************************/
*       /*                                                           */
*       /* IO ERROR CHECK                                            */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0425
*       IF IOPRETRN>IOPNTFND THEN   /* IO ERROR                      */
@RF00415 L     @05,@PC00001                                        0425
         L     @05,TBLXIOP2(,@05)                                  0425
         CLI   IOPRETRN(@05),4                                     0425
         BNH   @RF00425                                            0425
*         DO;                       /*                               */
*           TM4HIRC=MAX(TM4HIRC,IOPRETRN);/*                         */
         SLR   @15,@15                                             0427
         IC    @15,IOPRETRN(,@05)                                  0427
         CR    TM4HIRC,@15                                         0427
         BNL   *+6
         LR    TM4HIRC,@15                                         0427
*           MODBLD=OFF;             /*                               */
*           MODASM=OFF;             /*                               */
         NI    MODBLD,B'11100111'                                  0429
*         END;                      /*                               */
*     END;                          /*                               */
@RF00425 DS    0H                                                  0432
*   RFY                                                            0432
*     HMASMIOP BASED(IOPPTR);       /* NORMAL IOP                    */
*                                                                  0432
@RF00399 DS    0H                                                  0433
*   /*****************************************************************/
*   /*                                                               */
*   /* CHECK FOR ASSEMBLER SYSIN DATA SET.                           */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0433
*   IF MODASM=ON THEN               /*                               */
         TM    MODASM,B'00001000'                                  0433
         BNO   @RF00433                                            0433
*     DO;                           /*                               */
*       CALL ASMINPUT;              /*                               */
         BAL   @14,ASMINPUT                                        0435
*       IF ASMSYSIN=BLANKS THEN     /* COULDNOT DETERMINE SYSIN      */
         CLC   ASMSYSIN(8),BLANKS                                  0436
         BNE   @RF00436                                            0436
*         DO;                       /*                               */
*           MODASM=OFF;             /* STOP ASSEMBLY                 */
*           MODBLD=OFF;             /* ... AND DONT BUILT ICT ENTRY  */
         NI    MODASM,B'11100111'                                  0439
*         END;                      /*                               */
*     END;                          /*                               */
*   END NEEDASM;                    /*                               */
@EL00005 DS    0H                                                  0442
@EF00005 DS    0H                                                  0442
@ER00005 LM    @14,@02,@SA00005                                    0442
         LM    @05,@12,@SA00005+20                                 0442
         BR    @14                                                 0442
*ASMINPUT:                                                         0443
*   PROC;                           /*                               */
ASMINPUT STM   @14,@02,@SA00006                                    0443
         STM   @05,@12,@SA00006+20                                 0443
*   RFY                                                            0444
*     HMASMIOP BASED(IOPPTR);       /*                               */
*                                                                  0444
*   /*****************************************************************/
*   /*                                                               */
*   /* DETERMINE THE INPUT (SYSIN) DATA SET FOR THE ASSEMBLY AND PUT */
*   /* DD NAME IN ASMSYSIN. NOTE THAT AT ACCEPT TIME, ASMSYSIN WILL  */
*   /* NOT BE SET UP (AND HENCE ASSEMBLIES WILL NOT BE DONE) FOR (1) */
*   /* ASSEMBLY ENTRIES ON THE CDS AND (2) SOURCE FOUND ON THE STS   */
*   /* DATASET.                                                      */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0445
*   IF SRCICT=ON                    /* SOURCE TO BE ASSEMBLED FOUND
*                                      IN ICT                        */
*     THEN                                                         0445
         TM    SRCICT,B'01000000'                                  0445
         BNO   @RF00445                                            0445
*     ASMSYSIN=SAVESYS;             /* FROMLIB IS SOURCE''S TOLIB    */
*                                                                  0446
         MVC   ASMSYSIN(8),SAVESYS                                 0446
*   /*****************************************************************/
*   /*                                                               */
*   /* FROMLIB IS DETERMINED.                                        */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0447
*   IF CCAAPPLY=ON×CCARES=ON THEN   /*                               */
@RF00445 TM    CCAAPPLY(CCAPTR),B'01001000'                        0447
         BZ    @RF00447                                            0447
*     DO;                           /*                               */
*                                                                  0448
*       /*************************************************************/
*       /*                                                           */
*       /* IF CDS ASSEM ENTRY FOR THE ELEMENT THEN CDS IS FROMLIB.   */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0449
*       IF ASMSYSIN=BLANKS THEN     /*                               */
         CLC   ASMSYSIN(8),BLANKS                                  0449
         BNE   @RF00449                                            0449
*         DO;                       /*                               */
*                                                                  0450
*           /*********************************************************/
*           /*                                                       */
*           /* LOCATE ASM CDS ENTRY.                                 */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0451
*           IOPNAME=ASSMNM;         /*                               */
         L     @05,@PC00001+16                                     0451
         L     @05,GTPPTR(,@05)                                    0451
         L     @05,GTPBUFAD(,@05)                                  0451
         MVC   IOPNAME(8,IOPPTR),ASSMNM(@05)                       0451
*           IOPTYPE=IOPASM;         /*                               */
         MVI   IOPTYPE(IOPPTR),X'01'                               0452
*           IOPDSID=IOPCDSM;        /*                               */
         MVI   IOPDSID(IOPPTR),X'02'                               0453
*           IOPFUNCT=IOPLOC;        /*                               */
         MVI   IOPFUNCT(IOPPTR),X'03'                              0454
*           CALL HMASMIO(HMASMIOP); /*                               */
         ST    IOPPTR,@AL00001                                     0455
         L     @15,@CV01853                                        0455
         LA    @01,@AL00001                                        0455
         BALR  @14,@15                                             0455
*           IF IOPRETRN=IOPGOOD THEN/*                               */
         CLI   IOPRETRN(IOPPTR),0                                  0456
         BNE   @RF00456                                            0456
*             DO;                   /*                               */
*               ASMSYSIN=SMPCDS;    /* ICT FROM LIB SET              */
         MVC   ASMSYSIN(8),@CC01867                                0458
*               SAVEBUPT=IOPABUPT;  /* BU SYSMOD NAME                */
         MVC   SAVEBUPT(7),IOPABUPT(IOPPTR)                        0459
*               SAVEBUTP=IOPABUTP;  /* BU MOD TYPE                   */
         SLR   SAVEBUTP,SAVEBUTP                                   0460
         IC    SAVEBUTP,IOPABUTP(,IOPPTR)                          0460
*             END;                  /*                               */
*         END;                      /*                               */
*                                                                  0462
@RF00456 DS    0H                                                  0463
*       /*************************************************************/
*       /*                                                           */
*       /* TRY CDS SRC ENTRY FOR FROMLIB.                            */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0463
*       IF ASMSYSIN=BLANKS          /*                               */
*           &SRCFND=ON THEN         /*                               */
@RF00449 CLC   ASMSYSIN(8),BLANKS                                  0463
         BNE   @RF00463                                            0463
         TM    SRCFND,B'00100000'                                  0463
         BNO   @RF00463                                            0463
*         ASMSYSIN=SAVESYS;         /*                               */
*                                                                  0464
         MVC   ASMSYSIN(8),SAVESYS                                 0464
*       /*************************************************************/
*       /*                                                           */
*       /* IF STILL NO FROMLIB TRY TO USE THE STS (APPLY ONLY).      */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0465
*       IF CCAAPPLY=ON              /*                               */
*           &ASMSYSIN=BLANKS THEN   /*                               */
@RF00463 TM    CCAAPPLY(CCAPTR),B'01000000'                        0465
         BNO   @RF00465                                            0465
         CLC   ASMSYSIN(8),BLANKS                                  0465
         BNE   @RF00465                                            0465
*         DO;                       /*                               */
*                                                                  0466
*           /*********************************************************/
*           /*                                                       */
*           /* CHECK FOR MEMBER ON STS.                              */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0467
*           IOPDSID=IOPSTS;         /*                               */
         MVI   IOPDSID(IOPPTR),X'1A'                               0467
*           IOPNAME=ASSMNM;         /*                               */
         L     @05,@PC00001+16                                     0468
         L     @05,GTPPTR(,@05)                                    0468
         L     @05,GTPBUFAD(,@05)                                  0468
         MVC   IOPNAME(8,IOPPTR),ASSMNM(@05)                       0468
*           IOPFUNCT=IOPLOC;        /*                               */
         MVI   IOPFUNCT(IOPPTR),X'03'                              0469
*           CALL HMASMIO(HMASMIOP); /*                               */
         ST    IOPPTR,@AL00001                                     0470
         L     @15,@CV01853                                        0470
         LA    @01,@AL00001                                        0470
         BALR  @14,@15                                             0470
*           IF IOPRETRN=IOPGOOD THEN/* FOUND IT ON STS               */
         CLI   IOPRETRN(IOPPTR),0                                  0471
         BNE   @RF00471                                            0471
*             ASMSYSIN=SMPSTS;      /* USE STS AS FROMLIB            */
         MVC   ASMSYSIN(8),@CC01869                                0472
*         END;                      /*                               */
@RF00471 DS    0H                                                  0474
*     END;                          /*                               */
*                                                                  0474
@RF00465 DS    0H                                                  0475
*   /*****************************************************************/
*   /*                                                               */
*   /* SET ERROR CODE IF IO FAILED.                                  */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0475
*   IF IOPRETRN>IOPNOTFD THEN       /* IO ERROR                      */
@RF00447 CLI   IOPRETRN(IOPPTR),4                                  0475
         BNH   @RF00475                                            0475
*     DO;                           /*                               */
*       MODASM=OFF;                 /*                               */
*       MODBLD=OFF;                 /*                               */
         NI    MODASM,B'11100111'                                  0478
*       TM4HIRC=MAX(TM4HIRC,IOPRETRN);/*                             */
         SLR   @05,@05                                             0479
         IC    @05,IOPRETRN(,IOPPTR)                               0479
         CR    TM4HIRC,@05                                         0479
         BNL   *+6
         LR    TM4HIRC,@05                                         0479
*     END;                          /*                               */
*                                                                  0480
*   /*****************************************************************/
*   /*                                                               */
*   /* IF RESTORE, OR ACCEPT, OR APPLY AND ALL ABOVE ATTEMPTS TO     */
*   /* DESIGNATE A FROMLIB HAVE FAILED, THE DLIB (DETERMINED FOR THE */
*   /* SOURCE ELEMENT TO BE TO BE ASSEMBLED) WILL BE USE AS ASSEMBLER*/
*   /* INPUT.                                                        */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0481
*   IF ASMSYSIN=BLANKS THEN         /*                               */
@RF00475 CLC   ASMSYSIN(8),BLANKS                                  0481
         BNE   @RF00481                                            0481
*     ASMSYSIN=SAVEDLIB;            /*                               */
         MVC   ASMSYSIN(8),SAVEDLIB                                0482
*   END ASMINPUT;                   /*                               */
@EL00006 DS    0H                                                  0483
@EF00006 DS    0H                                                  0483
@ER00006 LM    @14,@02,@SA00006                                    0483
         LM    @05,@12,@SA00006+20                                 0483
         BR    @14                                                 0483
*ICTENTRY:                                                         0484
*   PROC;                           /*                               */
ICTENTRY STM   @14,@02,@SA00007                                    0484
         STM   @04,@12,@SA00007+20                                 0484
*   DCL                                                            0485
*     AX FIXED(31);                 /* LOOP CONTROL                  */
*   RFY                                                            0486
*     HMASMIOP BASED(IOPPTR);       /*                               */
*                                                                  0486
*   /*****************************************************************/
*   /*                                                               */
*   /* AN ICT ENTRY FOR THE MODULE TO BE ASSEMBLED IS CREATED.       */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0487
*   RESPECIFY                                                      0487
*     ICTPTF BASED(ICPTFPTR);       /* PTF SECT ENTRY PASSED         */
*   RESPECIFY                                                      0488
*     ICTMOD BASED(BLDENT@);        /* ADDRESSIBILITY TO MOD SECT    */
*   BLDENT@=TBLXTOP;                /* ADDR OF ENTRY TO BE OBTAINED  */
*                                                                  0489
         L     @05,@PC00001                                        0489
         MVC   BLDENT@(4),TBLXTOP(@05)                             0489
*   /*****************************************************************/
*   /*                                                               */
*   /* BUILD AN MCB FOR USE IN INITIALIZING THE ICT ENTRY            */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0490
*   IF CCARES=OFF THEN              /* IF MCB PTR AVAILABLE BUILD IT */
         TM    CCARES(CCAPTR),B'00001000'                          0490
         BNZ   @RF00490                                            0490
*     CALL BLDMCB;                  /*                               */
*                                                                  0491
         BAL   @14,BLDMCB                                          0491
*   /*****************************************************************/
*   /*                                                               */
*   /* GET A BASIC MOD SECTION ENTRY                                 */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0492
*   CALL HMASMTAD(TBLXPARM,         /* PARM LIST                     */
*       'M',                        /* BUILD MOD SECTION ENTRY       */
*       ASSMNM);                    /* ENTRY NAME                    */
@RF00490 L     @05,@PC00001                                        0492
         ST    @05,@AL00001                                        0492
         LA    @05,@CC00668                                        0492
         ST    @05,@AL00001+4                                      0492
         L     @05,@PC00001+16                                     0492
         L     @05,GTPPTR(,@05)                                    0492
         L     @05,GTPBUFAD(,@05)                                  0492
         ST    @05,@AL00001+8                                      0492
         L     @15,@CV01856                                        0492
         LA    @01,@AL00001                                        0492
         BALR  @14,@15                                             0492
*   RESPECIFY                                                      0493
*     RTNCODE RSTD;                                                0493
*   IF RTNCODE^=ZERO THEN           /*                               */
         LTR   RTNCODE,RTNCODE                                     0494
         BZ    @RF00494                                            0494
*     DO;                           /*                               */
*       MODBLD=OFF;                 /*                               */
*       MODASM=OFF;                 /*                               */
         NI    MODBLD,B'11100111'                                  0497
*       TM4HIRC=MAX(TM4HIRC,RTNCODE);/* SAVE RETURN CODE FROM TAD    */
         CR    TM4HIRC,RTNCODE                                     0498
         BNL   *+6
         LR    TM4HIRC,RTNCODE                                     0498
*       RESPECIFY                                                  0499
*         RTNCODE UNRSTD;                                          0499
*     END;                          /*                               */
*   ELSE                                                           0501
*     DO;                                                          0501
*                                                                  0501
         B     @RC00494                                            0501
@RF00494 DS    0H                                                  0502
*       /*************************************************************/
*       /*                                                           */
*       /* BASIC MOD SECTION ENTRY OBTAINED ... INITIALIZE IT FROM   */
*       /* THE PTF SECT ENTRY PASSED AND THE MCB CALL TM1 TO COMPLETE*/
*       /* THE ICT FROM DATA IN THE (A)CDS ELEMENT ENTRY.            */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0502
*       ICTMMOD(1)=ON;              /* SET ICT MOD SECT INDICATOR    */
         L     @05,BLDENT@                                         0502
         OI    ICTMMOD(@05),B'10000000'                            0502
*       CALL HMASMTM1(TBLXPARM,     /* PARM LIST                     */
*           BLDENT@,                /* PTR TO MOD SECT ENTRY         */
*           ICPTFPTR,               /* PTR TO PTF SECT ENTRY         */
*           ELMCBPTR);              /* PTR TO INITIALIZED MCB        */
         L     @05,@PC00001                                        0503
         ST    @05,@AL00001                                        0503
         LA    @05,BLDENT@                                         0503
         ST    @05,@AL00001+4                                      0503
         L     @05,@PC00001+8                                      0503
         ST    @05,@AL00001+8                                      0503
         L     @05,@PC00001+12                                     0503
         ST    @05,@AL00001+12                                     0503
         L     @15,@CV01858                                        0503
         LA    @01,@AL00001                                        0503
         BALR  @14,@15                                             0503
*       RESPECIFY                                                  0504
*         RTNCODE RSTD;                                            0504
*       IF RTNCODE^=ZERO THEN                                      0505
         LTR   RTNCODE,RTNCODE                                     0505
         BZ    @RF00505                                            0505
*         DO;                       /*                               */
*           MODBLD=OFF;             /*                               */
*           MODASM=OFF;             /*                               */
         NI    MODBLD,B'11100111'                                  0508
*           TM4HIRC=MAX(TM4HIRC,RTNCODE);/* SAVE RETURN CODE         */
         CR    TM4HIRC,RTNCODE                                     0509
         BNL   *+6
         LR    TM4HIRC,RTNCODE                                     0509
*           RESPECIFY                                              0510
*             RTNCODE UNRSTD;                                      0510
*         END;                      /*                               */
*                                                                  0511
*       /*************************************************************/
*       /*                                                           */
*       /* IF STILL OK TO CONTINUE                                   */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0512
*       IF MODBLD=ON THEN           /*                               */
@RF00505 TM    MODBLD,B'00010000'                                  0512
         BNO   @RF00512                                            0512
*         DO;                       /*                               */
*                                                                  0513
*           /*********************************************************/
*           /*                                                       */
*           /* COMPLETE MOD SECT ENTRY INITIALIZATION INITIALIZE     */
*           /* ELEMENT FMID                                          */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0514
*           IF CCAAPPLY=ON×CCAACCPT=ON THEN/*                        */
         TM    CCAAPPLY(CCAPTR),B'01100000'                        0514
         BZ    @RF00514                                            0514
*             DO;                   /*                               */
*               IF SAVEFMID(1)^=BLANK THEN/*                         */
         CLI   SAVEFMID,C' '                                       0516
         BE    @RF00516                                            0516
*                 ICTMFMID(1)=SAVEFMID;/*                            */
         L     @05,BLDENT@                                         0517
         MVC   ICTMFMID(7,@05),SAVEFMID                            0517
*               ELSE                /*                               */
*                 DO;               /*                               */
         B     @RC00516                                            0518
@RF00516 DS    0H                                                  0519
*                   IF ICTPTYPE(1)=IOPPFUNC THEN/* FUNCTION SYSMOD ? */
         L     @05,@PC00001+8                                      0519
         L     @05,ICPTFPTR(,@05)                                  0519
         CLI   ICTPTYPE(@05),4                                     0519
         BNE   @RF00519                                            0519
*                     ICTMFMID(1)=ICTPTFS(1);/* YES - FMID IS      0520
*                                      SYSMOD''S NAME                */
         L     @02,BLDENT@                                         0520
         MVC   ICTMFMID(7,@02),ICTPTFS(@05)                        0520
*                   ELSE                                           0521
*                     ICTMFMID(1)=ICTPFMID(1);/* NO - FMID IS FROM 0521
*                                      SYSMOD''S FMID                */
         B     @RC00519                                            0521
@RF00519 L     @05,BLDENT@                                         0521
         L     @02,@PC00001+8                                      0521
         L     @02,ICPTFPTR(,@02)                                  0521
         MVC   ICTMFMID(7,@05),ICTPFMID(@02)                       0521
*                 END;              /*                               */
*                                                                  0522
@RC00519 DS    0H                                                  0523
*               /*****************************************************/
*               /*                                                   */
*               /* INITIALIZE ELEMENT RMID                           */
*               /*                                                   */
*               /*****************************************************/
*                                                                  0523
*               ICTMRMID(1)=ICTPTFS(1);/* SYSMOD NAME IS RMID        */
*                                                                  0523
@RC00516 L     @05,BLDENT@                                         0523
         L     @02,@PC00001+8                                      0523
         L     @02,ICPTFPTR(,@02)                                  0523
         MVC   ICTMRMID(7,@05),ICTPTFS(@02)                        0523
*               /*****************************************************/
*               /*                                                   */
*               /* FILL IN ICT SRC VALUES FROM PTF ENTRY PASSED AND  */
*               /* OTHER FIELDS                                      */
*               /*                                                   */
*               /*****************************************************/
*                                                                  0524
*               ICTPPTR(1)=ICPTFPTR;/* PTR TO ICT PTF ENTRY          */
         ST    @02,ICTPPTR(,@05)                                   0524
*             END;                                                 0525
*                                                                  0525
*           /*********************************************************/
*           /*                                                       */
*           /* DO RESTORE COMPLETION AND CHECK                       */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0526
*           IF CCARES=ON THEN       /*                               */
@RF00514 TM    CCARES(CCAPTR),B'00001000'                          0526
         BNO   @RF00526                                            0526
*             DO;                   /*                               */
*                                                                  0527
*               /*****************************************************/
*               /*                                                   */
*               /* CALL HMASMTID TO BUILD THE MOD ID LIST            */
*               /*                                                   */
*               /*****************************************************/
*                                                                  0528
*               RFY                                                0528
*                 HMASMIOP BASED(TBLXIOP2);                        0528
*               IF IOPRETRN=IOPGOOD /* MOD ENTRY WAS FOUND           */
*                   &IOPDSID=IOPCDSA THEN/* .... ON THE ACDS         */
         L     @05,@PC00001                                        0529
         L     @02,TBLXIOP2(,@05)                                  0529
         CLI   IOPRETRN(@02),0                                     0529
         BNE   @RF00529                                            0529
         CLI   IOPDSID(@02),12                                     0529
         BNE   @RF00529                                            0529
*                 DO;               /*                               */
*                   CALL HMASMTID(TBLXPARM,/* TBLX PARM              */
*                       BLDENT@,    /* PTR TO ICT MOD ENTRY          */
*                       ICTMICHA(1),/* PTR TO ACDS MOD ID LIST       */
*                       HMASMIOP);  /* IOP W/ EXTENDED ACDS IOP ENTRY*/
         ST    @05,@AL00001                                        0531
         LA    @05,BLDENT@                                         0531
         ST    @05,@AL00001+4                                      0531
         L     @05,BLDENT@                                         0531
         LA    @05,ICTMICHA(,@05)                                  0531
         ST    @05,@AL00001+8                                      0531
         ST    @02,@AL00001+12                                     0531
         L     @15,@CV01859                                        0531
         LA    @01,@AL00001                                        0531
         BALR  @14,@15                                             0531
*                   RFY                                            0532
*                     RTNCODE RSTD;                                0532
*                   TM4HIRC=MAX(TM4HIRC,RTNCODE);/* SAVE RETURN CODE */
         CR    TM4HIRC,RTNCODE                                     0533
         BNL   *+6
         LR    TM4HIRC,RTNCODE                                     0533
*                   RFY                                            0534
*                     RTNCODE UNRSTD;                              0534
*                   ICTMFMID(1)=IOPFMID;/* FMID IS ACDS FMID         */
         L     @05,BLDENT@                                         0535
         L     @02,@PC00001                                        0535
         L     @15,TBLXIOP2(,@02)                                  0535
         MVC   ICTMFMID(7,@05),IOPFMID(@15)                        0535
*                   ICTMRMID(1)=IOPRMID;/* RMID IS ACDS RMID         */
         MVC   ICTMRMID(7,@05),IOPRMID(@15)                        0536
*                   ICTMDSTL(1)=IOPMCDLB;/* DISTLIB FROM THE ACDS    */
         MVC   ICTMDSTL(8,@05),IOPMCDLB(@15)                       0537
*                   ICTFMLIB(1)=IOPMCDLB;/* FROM LIB IS DISTLIB      */
         MVC   ICTFMLIB(8,@05),IOPMCDLB(@15)                       0538
*                   ICTMTCHN(1)=TBLXNULL;/* DISREGARD CDS ALIAS LIST */
         MVC   ICTMTCHN(4,@05),TBLXNULL(@02)                       0539
*                   DO AX=1 BY 1    /* SEARCH ALL SUB-ENTRIES FOR  0540
*                                      ALIASES                       */
*                         WHILE(IOPMACND(AX)^=IOPEOLST);           0540
         LA    AX,1                                                0540
         B     @DE00540                                            0540
@DL00540 DS    0H                                                  0541
*                     IF IOPMCTYP(AX)=IOPMCMAL THEN/* ALIAS ENTRY?   */
         LR    @05,AX                                              0541
         MH    @05,@CH00527                                        0541
         L     @15,@PC00001                                        0541
         L     @14,TBLXIOP2(,@15)                                  0541
         SLR   @09,@09                                             0541
         IC    @09,IOPMCTYP-9(@05,@14)                             0541
         CH    @09,@CH00280                                        0541
         BNE   @RF00541                                            0541
*                       DO;         /* YES,                          */
*                         CALL HMASMTAI(TBLXPARM,/* ADD ALIAS TO   0543
*                                      INDEX LIST                    */
*                             ICTMTCHN(1),/* ...                     */
*                             ADDR(IOPMCDTA(AX)),/* ...              */
*                             LENGTH(ICTTALLS));/* ...               */
         ST    @15,@AL00001                                        0543
         L     @01,BLDENT@                                         0543
         LA    @15,ICTMTCHN(,@01)                                  0543
         ST    @15,@AL00001+4                                      0543
         LA    @05,IOPMCDTA-9(@05,@14)                             0543
         ST    @05,@TF00001                                        0543
         LA    @05,@TF00001                                        0543
         ST    @05,@AL00001+8                                      0543
         LA    @05,@CF00063                                        0543
         ST    @05,@AL00001+12                                     0543
         L     @15,@CV01855                                        0543
         LA    @01,@AL00001                                        0543
         BALR  @14,@15                                             0543
*                         RESPECIFY                                0544
*                           RTNCODE RSTD;                          0544
*                         TM4HIRC=MAX(TM4HIRC,RTNCODE);/* RETURN CODE
*                                      FROM TAI                      */
         CR    TM4HIRC,RTNCODE                                     0545
         BNL   *+6
         LR    TM4HIRC,RTNCODE                                     0545
*                         RESPECIFY                                0546
*                           RTNCODE UNRSTD;                        0546
*                       END;                                       0547
*                   END;            /*                               */
@RF00541 AH    AX,@CH00071                                         0548
@DE00540 LR    @05,AX                                              0548
         MH    @05,@CH00527                                        0548
         L     @15,@PC00001                                        0548
         L     @01,TBLXIOP2(,@15)                                  0548
         SLR   @00,@00                                             0548
         IC    @00,IOPMACND-9(@05,@01)                             0548
         CH    @00,@CH00716                                        0548
         BNE   @DL00540                                            0548
*                 END;              /*                               */
*                                                                  0549
*               /*****************************************************/
*               /*                                                   */
*               /* IF CDS IS SYSIN FOR ASSEMBLY THE CHECK IF THE     */
*               /* CAUSER OF THE CDS ASSEM ENTRY IS THE RESTORED     */
*               /* SYSMOD AND IF SO SET UP THIS ICT MOD FOR DELETE.  */
*               /*                                                   */
*               /*****************************************************/
*                                                                  0550
*               IF SAVEBUTP=IOPBUADD/* THE ASSEM ENTRY ADDED BY      */
*                   &SAVEBUPT=ICPTFPTR->ICTPTFS(1)/* ..THE RESTORED
*                                                              SYSMOD*/
*                 THEN              /*                               */
@RF00529 CH    SAVEBUTP,@CH00071                                   0550
         BNE   @RF00550                                            0550
         L     @05,@PC00001+8                                      0550
         L     @05,ICPTFPTR(,@05)                                  0550
         CLC   SAVEBUPT(7),ICTPTFS(@05)                            0550
         BNE   @RF00550                                            0550
*                 DO;               /*                               */
*                   ICTMIDEL(1)=ON; /* SET UP THIS MOD FOR DELETE    */
         L     @02,BLDENT@                                         0552
         OI    ICTMIDEL(@02),B'01000000'                           0552
*                 END;              /*                               */
*             END;                                                 0554
@RF00550 DS    0H                                                  0555
*         END;                      /*                               */
@RF00526 DS    0H                                                  0556
*     END;                          /*                               */
@RF00512 DS    0H                                                  0557
*   RFY                                                            0557
*     HMASMIOP BASED(IOPPTR);       /* NORMAL IOP                    */
*                                                                  0557
@RC00494 DS    0H                                                  0558
*   /*****************************************************************/
*   /*                                                               */
*   /* ADD UNIQUE FIELDS IN ICT ENTRY FOR ASSEMBLED MODULES.         */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0558
*   IF MODASM=ON&ASMSYSIN^=BLANKS   /* ASSEMBLY CAN BE DONE?         */
*     THEN                          /*                               */
         TM    MODASM,B'00001000'                                  0558
         BNO   @RF00558                                            0558
         CLC   ASMSYSIN(8),BLANKS                                  0558
         BE    @RF00558                                            0558
*     DO;                           /*                               */
*       ICTMASM(1)=ON;              /* ASSEMBLY NEEDED               */
         L     @02,BLDENT@                                         0560
         OI    ICTMASM(@02),B'01000000'                            0560
*       ICTMDOAS(1)=ON;             /* ASSEMBLY NEEDED               */
         OI    ICTMDOAS(@02),B'00000100'                           0561
*       ICTMLANG(1)=IOPMCASI;       /* USE ASSEMBLER LANGUAGE        */
         MVI   ICTMLANG(@02),X'00'                                 0562
*       ICTFMLIB(1)=ASMSYSIN;       /* SET FROM LIB FOR ASSEMBLY     */
         MVC   ICTFMLIB(8,@02),ASMSYSIN                            0563
*     END;                          /*                               */
*   END ICTENTRY;                   /*                               */
@EL00007 DS    0H                                                  0565
@EF00007 DS    0H                                                  0565
@ER00007 LM    @14,@02,@SA00007                                    0565
         LM    @04,@12,@SA00007+20                                 0565
         BR    @14                                                 0565
*BLDMCB:                                                           0566
*   PROC;                           /*                               */
BLDMCB   STM   @14,@12,12(@13)                                     0566
*   RFY                                                            0567
*     HMASMIOP BASED(IOPPTR);       /*                               */
*                                                                  0567
*   /*****************************************************************/
*   /*                                                               */
*   /* BUILD AN MCB FOR USE BY TM1 IN CREATING ICT MOD ENTRY.        */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0568
*   MCBELEMP=BLANKS;                /* BLANK OUT THE MCB             */
         L     @15,@PC00001+12                                     0568
         L     @15,ELMCBPTR(,@15)                                  0568
         MVI   MCBELEMP+8(@15),C' '                                0568
         MVC   MCBELEMP+9(132,@15),MCBELEMP+8(@15)                 0568
         MVC   MCBELEMP(8,@15),BLANKS                              0568
*   MCBELEPM=''B;                   /* ZERO THE FLAGS                */
         XC    MCBELEPM(4,@15),MCBELEPM(@15)                       0569
*   MCBEFLG5=''B;                   /* MORE                          */
         MVI   MCBEFLG5(@15),X'00'                                 0570
*   MCBEND(1)=IOPEOLST;             /* VAIABLE LIST ENPTY            */
         MVI   MCBEND(@15),X'FF'                                   0571
*   MCBENAME=ASSMNM;                /* NAME FROM GTA FILE            */
         L     @14,@PC00001+16                                     0572
         L     @01,GTPPTR(,@14)                                    0572
         L     @01,GTPBUFAD(,@01)                                  0572
         MVC   MCBENAME(8,@15),ASSMNM(@01)                         0572
*   MCBEDIST=ICMODPTR->ICTMDOBJ(1); /* DISTLIB FROM DISTOBJ OF MAC   */
         L     @14,@PC00001+4                                      0573
         L     @01,ICMODPTR(,@14)                                  0573
         MVC   MCBEDIST(8,@15),ICTMDOBJ(@01)                       0573
*   END BLDMCB;                     /*                               */
@EL00008 DS    0H                                                  0574
@EF00008 DS    0H                                                  0574
@ER00008 LM    @14,@12,12(@13)                                     0574
         BR    @14                                                 0574
*GTAUPDTE:                                                         0575
*   PROC;                           /*                               */
GTAUPDTE STM   @14,@02,@SA00009                                    0575
         STM   @04,@12,@SA00009+20                                 0575
*   RFY                                                            0576
*     HMASMGTP BASED(GTPPTR);       /*                               */
*   RFY                                                            0577
*     HMASMIOP BASED(IOPPTR);       /*                               */
*                                                                  0577
*   /*****************************************************************/
*   /*                                                               */
*   /* IF THE ICT MOD ENTRY CREATE PROCESS WAS SUCCESSFUL THEN THE   */
*   /* GTA FILE ENTRY FOR THE ASSEMBLED MOD WILL HAVE THE ADDRESS OF */
*   /* THE ICT MOD ENTRY FILLED IN.                                  */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0578
*   IF MODBLD=ON THEN               /*                               */
         TM    MODBLD,B'00010000'                                  0578
         BNO   @RF00578                                            0578
*     DO;                           /*                               */
*       GTPFUNCT=GTPADD;            /*                               */
         L     @02,@PC00001+16                                     0580
         L     @02,GTPPTR(,@02)                                    0580
         MVI   GTPFUNCT(@02),X'04'                                 0580
*       ASSM@=BLDENT@;              /*                               */
         L     @01,GTPBUFAD(,@02)                                  0581
         MVC   ASSM@(4,@01),BLDENT@                                0581
*       CALL HMASMGTA(HMASMGTP);    /*                               */
         ST    @02,@AL00001                                        0582
         L     @15,@CV01857                                        0582
         LA    @01,@AL00001                                        0582
         BALR  @14,@15                                             0582
*       TM4HIRC=MAX(TM4HIRC,GTPRETRN);/*                             */
         L     @02,@PC00001+16                                     0583
         L     @02,GTPPTR(,@02)                                    0583
         SLR   @15,@15                                             0583
         IC    @15,GTPRETRN(,@02)                                  0583
         CR    TM4HIRC,@15                                         0583
         BNL   *+6
         LR    TM4HIRC,@15                                         0583
*     END;                          /*                               */
*   END GTAUPDTE;                   /*                               */
@EL00009 DS    0H                                                  0585
@EF00009 DS    0H                                                  0585
@ER00009 LM    @14,@02,@SA00009                                    0585
         LM    @04,@12,@SA00009+20                                 0585
         BR    @14                                                 0585
*ASMCHAIN:                                                         0586
*   PROC;                           /*                               */
*                                                                  0586
ASMCHAIN STM   @14,@02,@SA00010                                    0586
         STM   @04,@12,@SA00010+20                                 0586
*   /*****************************************************************/
*   /*                                                               */
*   /* THEN ASSEMBLY CHAIN IN THE CAUSER ENTRY MUST BE UPDATED WITH  */
*   /* THE ADDRESS OF THIS MODULE TO BE ASSEMBLED ENTRY.             */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0587
*                                                                  0587
*   /*****************************************************************/
*   /*                                                               */
*   /* GO THRU THE GTA FILE AND GET THE ICTMOD ENTRY ADDRESS FOR EACH*/
*   /* ASSEMBLY TO BE DONE.                                          */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0587
*   GTPFUNCT=GTPOPENN;              /*                               */
         L     @02,@PC00001+16                                     0587
         L     @02,GTPPTR(,@02)                                    0587
         MVI   GTPFUNCT(@02),X'01'                                 0587
*   CALL HMASMGTA(HMASMGTP);        /*                               */
         ST    @02,@AL00001                                        0588
         L     @15,@CV01857                                        0588
         LA    @01,@AL00001                                        0588
         BALR  @14,@15                                             0588
*   DO WHILE GTPRETRN^=GTPEOF&TM4HIRC<STOPPTF;/*                     */
         B     @DE00589                                            0589
@DL00589 DS    0H                                                  0590
*     GTPFUNCT=GTPGETN;             /*                               */
         L     @02,@PC00001+16                                     0590
         L     @02,GTPPTR(,@02)                                    0590
         MVI   GTPFUNCT(@02),X'08'                                 0590
*     CALL HMASMGTA(HMASMGTP);      /*                               */
         ST    @02,@AL00001                                        0591
         L     @15,@CV01857                                        0591
         LA    @01,@AL00001                                        0591
         BALR  @14,@15                                             0591
*     IF GTPRETRN=GTPGOOD           /*                               */
*         &ASSM@^=ZERO THEN         /* THIS MOD HAS AN ENTRY         */
         L     @02,@PC00001+16                                     0592
         L     @02,GTPPTR(,@02)                                    0592
         CLI   GTPRETRN(@02),0                                     0592
         BNE   @RF00592                                            0592
         L     @02,GTPBUFAD(,@02)                                  0592
         ICM   @15,15,ASSM@(@02)                                   0592
         BZ    @RF00592                                            0592
*       DO;                         /*                               */
*                                                                  0593
*         /***********************************************************/
*         /*                                                         */
*         /* BUILD THE CHAIN OF MOD ICT ENTRY ADDRESSED.             */
*         /*                                                         */
*         /***********************************************************/
*                                                                  0594
*         CALL HMASMTAI(            /*                               */
*             TBLXPARM,             /* STANDARD PARMS                */
*             ICMODPTR->ICTMACHN(1),/* CHAIN TO BE BUILT             */
*             ADDR(ASSM@),          /* ADDRESS OF JUST BUILT ENTRY   */
*             LENGTH(ASSM@));       /* LENGTH OF ENTRY IN CHAIN      */
         L     @15,@PC00001                                        0594
         ST    @15,@AL00001                                        0594
         L     @15,@PC00001+4                                      0594
         L     @01,ICMODPTR(,@15)                                  0594
         LA    @15,ICTMACHN(,@01)                                  0594
         ST    @15,@AL00001+4                                      0594
         LA    @02,ASSM@(,@02)                                     0594
         ST    @02,@TF00001                                        0594
         LA    @02,@TF00001                                        0594
         ST    @02,@AL00001+8                                      0594
         LA    @02,@CF00046                                        0594
         ST    @02,@AL00001+12                                     0594
         L     @15,@CV01855                                        0594
         LA    @01,@AL00001                                        0594
         BALR  @14,@15                                             0594
*         RFY                                                      0595
*           RTNCODE RSTD;           /*                               */
*         TM4HIRC=MAX(TM4HIRC,RTNCODE);/*                            */
         CR    TM4HIRC,RTNCODE                                     0596
         BNL   *+6
         LR    TM4HIRC,RTNCODE                                     0596
*         RFY                                                      0597
*           RTNCODE UNRSTD;         /*                               */
*       END;                        /*                               */
*   END;                            /*                               */
@RF00592 DS    0H                                                  0599
@DE00589 L     @02,@PC00001+16                                     0599
         L     @02,GTPPTR(,@02)                                    0599
         CLI   GTPRETRN(@02),4                                     0599
         BE    @DC00589                                            0599
         CH    TM4HIRC,@CH00063                                    0599
         BL    @DL00589                                            0599
@DC00589 DS    0H                                                  0600
*   END ASMCHAIN;                   /*                               */
@EL00010 DS    0H                                                  0600
@EF00010 DS    0H                                                  0600
@ER00010 LM    @14,@02,@SA00010                                    0600
         LM    @04,@12,@SA00010+20                                 0600
         BR    @14                                                 0600
*   END HMASMTM4                    /*                               */
*                                                                  0601
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */
*/*%INCLUDE SYSLIB  (HMASMCCA)                                       */
*/*%INCLUDE SYSLIB  (HMASMIOP)                                       */
*/*%INCLUDE SYSLIB  (HMASMICT)                                       */
*/*%INCLUDE SYSLIB  (HMASMMCB)                                       */
*/*%INCLUDE SYSLIB  (HMASMMGP)                                       */
*/*%INCLUDE SYSLIB  (HMASMGTP)                                       */
*                                                                  0601
*       ;                                                          0601
@DATA    DS    0H
@CH00089 DC    H'0'
@CH00071 DC    H'1'
@CH00280 DC    H'2'
@CH00527 DC    H'9'
@CH01971 DC    H'144'
@CH00716 DC    H'255'
         DS    0F
@SA00001 DS    18F
@PC00001 DS    5F
@SA00005 DS    13F
@SA00007 DS    14F
@SA00006 DS    0F
@SA00010 DS    0F
@SA00009 DS    0F
@SA00004 DS    0F
@SA00003 DS    0F
@SA00002 DS    0F
         DS    14F
@AL00001 DS    4A
@TF00001 DS    F
         DS    0F
@CF00046 DC    F'4'
@CF00063 DC    F'8'
@CH00063 EQU   @CF00063+2
@CF01991 DC    F'-144'
@CF01990 DC    F'-135'
@CF01992 DC    F'-112'
@CF01994 DC    F'-96'
@CF01993 DC    F'-56'
@CV01853 DC    V(HMASMIO)
@CV01855 DC    V(HMASMTAI)
@CV01856 DC    V(HMASMTAD)
@CV01857 DC    V(HMASMGTA)
@CV01858 DC    V(HMASMTM1)
@CV01859 DC    V(HMASMTID)
@CV01854 DC    V(HMASMMSG)
         DS    0D
BLDENT@  DS    A
@CC01867 DC    C'SMPCDS  '
@CC01869 DC    C'SMPSTS  '
@CC01939 DC    C'SYSPUNCH'
@CC01873 DC    C'       '
@CC00668 DC    C'M'
ICTENDCH DC    X'FFFFFFFF'
HMASMMGP DS    CL24
         ORG   HMASMMGP
MGPFIXED DS    CL12
         ORG   MGPFIXED
MGPCLEAR DS    CL6
         ORG   MGPCLEAR
MGPMGNO1 DS    FL2
MGPMGNO2 DS    FL2
MGPMGNO3 DS    FL2
         ORG   MGPFIXED+6
MGPFLAGS DS    BL2
         ORG   MGPFLAGS
MGPPRINT DS    BL1
MGPLIST  EQU   MGPFLAGS+0
MGPRPT   EQU   MGPFLAGS+0
MGPHLDS  EQU   MGPFLAGS+0
MGPWTOR  EQU   MGPFLAGS+0
MGPWTO   EQU   MGPFLAGS+0
MGPWTP   EQU   MGPFLAGS+0
@NM00250 EQU   MGPFLAGS+0
         ORG   MGPFIXED+8
MGPTYPE  DS    FL1
@NM00251 DS    CL3
         ORG   HMASMMGP+12
MGPVAR   DS    CL12
         ORG   MGPVAR
MGPVARPT DS    3A
         ORG   HMASMMGP+24
SAVEDLIB DS    CL8
SAVESYS  DS    CL8
SAVEFMID DS    CL7
SAVEBUPT DS    CL7
ASMSYSIN DS    CL8
TM4SWCH1 DS    BL1
         ORG   TM4SWCH1
STOWSRC  DS    BL1
SRCICT   EQU   TM4SWCH1+0
SRCFND   EQU   TM4SWCH1+0
MODBLD   EQU   TM4SWCH1+0
MODASM   EQU   TM4SWCH1+0
@NM00255 EQU   TM4SWCH1+0
         ORG   TM4SWCH1+1
TM4SWCH2 DS    BL1
         ORG   TM4SWCH2
MACTYPE  DS    BL1
SRCTYPE  EQU   TM4SWCH2+0
@NM00256 EQU   TM4SWCH2+0
         ORG   TM4SWCH2+1
BLANKS   DC    CL8'        '
PATCHTM4 DS    CL80
         ORG   PATCHTM4
@NM00257 DC    80X'FF'
         ORG   PATCHTM4+80
@00      EQU   00                      EQUATES FOR REGISTERS 0-15
@01      EQU   01
@02      EQU   02
@03      EQU   03
@04      EQU   04
@05      EQU   05
@06      EQU   06
@07      EQU   07
@08      EQU   08
@09      EQU   09
@10      EQU   10
@11      EQU   11
@12      EQU   12
@13      EQU   13
@14      EQU   14
@15      EQU   15
AX       EQU   @02
M        EQU   @04
L        EQU   @04
TM4HIRC  EQU   @03
SAVEBUTP EQU   @04
IOPPTR   EQU   @02
CCAPTR   EQU   @11
RTNCODE  EQU   @15
RTNREG   EQU   @14
TBLXOPTS EQU   0
TBLFLAGS EQU   TBLXOPTS+8
TBLFLG1  EQU   TBLFLAGS
TBLFLG2  EQU   TBLFLAGS+2
TBLFLG3  EQU   TBLFLAGS+3
TBLFLG4  EQU   TBLFLAGS+5
TBLFLG5  EQU   TBLFLAGS+7
HMASMCCA EQU   0
CCAFBUFR EQU   HMASMCCA+4
CCADSAD  EQU   CCAFBUFR+124
CCATPAD  EQU   CCAFBUFR+128
CCAFLAG7 EQU   CCAFBUFR+132
CCAFIOP  EQU   HMASMCCA+140
CCAIOPTR EQU   CCAFIOP
CCAFSYS  EQU   HMASMCCA+148
CCASREL  EQU   CCAFSYS+12
CCAFLAGA EQU   CCAFSYS+21
CCAFSTA  EQU   HMASMCCA+188
CCAFICT  EQU   HMASMCCA+192
CCAICT   EQU   CCAFICT
CCAICPTF EQU   CCAFICT+4
CCAICMOD EQU   CCAFICT+8
CCAICLMD EQU   CCAFICT+12
CCAFPGM  EQU   HMASMCCA+208
CCABLDLP EQU   CCAFPGM
CCADBLDL EQU   CCAFPGM+4
CCAFGTP  EQU   HMASMCCA+224
CCASEGTP EQU   CCAFGTP
@NM00023 EQU   HMASMCCA+244
CCAFFUNC EQU   HMASMCCA+264
CCAFLAG1 EQU   CCAFFUNC+8
CCAAPPLY EQU   CCAFLAG1
CCAACCPT EQU   CCAFLAG1
CCARES   EQU   CCAFLAG1
CCAFLAG2 EQU   CCAFFUNC+11
CCAFPROC EQU   HMASMCCA+276
CCAFLAG3 EQU   CCAFPROC
CCAFDIS  EQU   HMASMCCA+278
CCAFLAG4 EQU   CCAFDIS
CCAFLAG5 EQU   CCAFDIS+1
CCAFLAG6 EQU   CCAFDIS+2
CCAFCNV  EQU   HMASMCCA+281
CCAFLAG8 EQU   CCAFCNV
CCAFCTL  EQU   HMASMCCA+282
CCAFLAG9 EQU   CCAFCTL
CCAFDSNG EQU   HMASMCCA+298
CCAFLAGB EQU   CCAFDSNG
CCABLDLA EQU   0
@NM00039 EQU   CCABLDLA
CCABLDLL EQU   0
@NM00041 EQU   CCABLDLL
CCALKDRC EQU   @NM00041+20
@NM00043 EQU   CCABLDLL+124
CCAASMRC EQU   @NM00043+20
@NM00045 EQU   CCABLDLL+248
CCACPYRC EQU   @NM00045+20
@NM00047 EQU   CCABLDLL+372
CCACOMRC EQU   @NM00047+20
@NM00049 EQU   CCABLDLL+496
CCAZAPRC EQU   @NM00049+20
@NM00051 EQU   CCABLDLL+620
CCASUPRC EQU   @NM00051+20
@NM00053 EQU   CCABLDLL+744
CCAUPDRC EQU   @NM00053+20
CCABLDLM EQU   0
CCABELMT EQU   CCABLDLM+4
CCABMPOS EQU   CCABELMT
HMASMIOP EQU   0
IOPDSID  EQU   HMASMIOP
IOPFUNCT EQU   HMASMIOP+1
IOPRETRN EQU   HMASMIOP+2
IOPTYPE  EQU   HMASMIOP+3
IOPNAME  EQU   HMASMIOP+4
@NM00057 EQU   HMASMIOP+12
@NM00058 EQU   @NM00057
IOPDDNAM EQU   HMASMIOP+24
IOPBUFAD EQU   HMASMIOP+52
IOPDRMAP EQU   HMASMIOP+56
IOPINAME EQU   IOPDRMAP
IOPINAM  EQU   IOPINAME
IOPITYP  EQU   IOPINAM
IOPUSERL EQU   IOPDRMAP+11
IOPEND   EQU   IOPDRMAP+12
IOPLMCTL EQU   0
IOPQSMIF EQU   0
@NM00168 EQU   IOPQSMIF
IOPQSMLS EQU   IOPQSMIF+8
IOPQSMNM EQU   IOPQSMLS
IOPBS02  EQU   0
IOPBS04  EQU   0
IOPBAPF  EQU   IOPBS04
HMASMICT EQU   0
ICTCORE  EQU   HMASMICT
ICTPSPLN EQU   ICTCORE
ICTMSPLN EQU   ICTCORE+4
ICTLSPLN EQU   ICTCORE+8
ICTGMSPL EQU   0
ICTPTF   EQU   0
ICTPTFS  EQU   ICTPTF
ICTPFLG1 EQU   ICTPTF+7
ICTPFLG3 EQU   ICTPTF+8
ICTPPROC EQU   ICTPFLG3
ICTPFLG5 EQU   ICTPTF+9
ICTPFLG6 EQU   ICTPTF+11
ICTPFLF  EQU   ICTPFLG6
ICTPFLG2 EQU   ICTPTF+12
ICTPFLG4 EQU   ICTPTF+13
ICTPFLG8 EQU   ICTPTF+14
ICTPFLG9 EQU   ICTPTF+15
@NM00195 EQU   ICTPFLG9
ICTPFLGA EQU   ICTPTF+16
ICTPUSR1 EQU   ICTPFLGA
ICTPTYPE EQU   ICTPTF+17
ICTPFMID EQU   ICTPTF+22
ICTPCHN  EQU   ICTPTF+64
ICTPRCHN EQU   ICTPTF+68
ICTPSCHN EQU   ICTPTF+72
ICTPPCHN EQU   ICTPTF+76
ICTPICHN EQU   ICTPTF+80
ICTPNCHN EQU   ICTPTF+84
ICTPVCHN EQU   ICTPTF+88
ICTPDCHN EQU   ICTPTF+92
ICTPBCHN EQU   ICTPTF+96
ICTIXPF  EQU   0
ICTENTLS EQU   0
ICTENTNT EQU   ICTENTLS
ICTENTNM EQU   ICTENTNT
ICTENTST EQU   ICTENTNT+7
ICTREQLS EQU   0
ICTREQNT EQU   ICTREQLS
ICTREQNM EQU   ICTREQNT
ICTREQST EQU   ICTREQNT+7
ICTSUPLS EQU   0
ICTSUPNT EQU   ICTSUPLS
ICTSUPNM EQU   ICTSUPNT
ICTPRELS EQU   0
ICTPRENT EQU   ICTPRELS
ICTPRENM EQU   ICTPRENT
ICTPREST EQU   ICTPRENT+7
ICTIRQLS EQU   0
ICTIRQNT EQU   ICTIRQLS
ICTIRQNM EQU   ICTIRQNT
ICTIRQST EQU   ICTIRQNT+7
ICTCSRST EQU   ICTIRQNT+15
ICTNPRLS EQU   0
ICTNPRNT EQU   ICTNPRLS
ICTNPRNM EQU   ICTNPRNT
ICTVRSLS EQU   0
ICTVRSNT EQU   ICTVRSLS
ICTVRSNM EQU   ICTVRSNT
ICTDELLS EQU   0
ICTDELNT EQU   ICTDELLS
ICTDELNM EQU   ICTDELNT
ICTDELST EQU   ICTDELNT+7
ICTSBYLS EQU   0
ICTSBYNT EQU   ICTSBYLS
ICTSBYNM EQU   ICTSBYNT
ICTMOD   EQU   0
ICTMNAME EQU   ICTMOD
ICTMEND  EQU   ICTMNAME
ICTMFLG2 EQU   ICTMOD+8
ICTMCPL  EQU   ICTMFLG2
ICTMFLG1 EQU   ICTMOD+9
ICTMMODR EQU   ICTMFLG1
ICTMMOD  EQU   ICTMMODR
ICTMASM  EQU   ICTMMODR
ICTMMACR EQU   ICTMFLG1
ICTMMACU EQU   ICTMFLG1
ICTMSRCR EQU   ICTMFLG1
ICTMSRCU EQU   ICTMFLG1
ICTMFLG3 EQU   ICTMOD+10
ICTMFLG4 EQU   ICTMOD+11
ICTMIDEL EQU   ICTMFLG4
ICTMFLG5 EQU   ICTMOD+12
ICTMODF4 EQU   ICTMOD+13
ICTMLEP1 EQU   ICTMODF4
ICTMODF5 EQU   ICTMOD+14
ICTMLEP2 EQU   ICTMODF5
ICTMODF6 EQU   ICTMOD+15
ICTMLEP3 EQU   ICTMODF6
ICTMODF7 EQU   ICTMOD+16
ICTMLEP4 EQU   ICTMODF7
ICTMACF4 EQU   ICTMOD+17
ICTMDOAS EQU   ICTMACF4
ICTMLANG EQU   ICTMOD+20
ICTFMLIB EQU   ICTMOD+24
ICTTOLIB EQU   ICTMOD+32
ICTMASLB EQU   ICTMOD+40
ICTMDSTL EQU   ICTMOD+48
ICTMDOBJ EQU   ICTMOD+64
ICTMRMID EQU   ICTMOD+80
ICTMFMID EQU   ICTMOD+88
ICTPPTR  EQU   ICTMOD+96
ICTMCHN  EQU   ICTMOD+100
ICTMICHN EQU   ICTMOD+104
ICTMICHA EQU   ICTMOD+108
ICTMACHN EQU   ICTMOD+112
ICTMTCHN EQU   ICTMOD+116
ICTMVCHN EQU   ICTMOD+120
ICTMUCHN EQU   ICTMOD+124
ICTIXMF  EQU   0
ICTMIDLS EQU   0
ICTMID   EQU   ICTMIDLS
ICTMODID EQU   ICTMID
ICTMODST EQU   ICTMID+7
ICTASMLS EQU   0
ICTASMAD EQU   ICTASMLS
ICTTALLS EQU   0
ICTTALNM EQU   ICTTALLS
ICTMVRLS EQU   0
ICTMVRNT EQU   ICTMVRLS
ICTMVRNM EQU   ICTMVRNT
ICTMUMLS EQU   0
ICTMUMNT EQU   ICTMUMLS
ICTMUMNM EQU   ICTMUMNT
ICTLMOD  EQU   0
ICTLMNAM EQU   ICTLMOD
ICTLNAME EQU   ICTLMNAM
ICTLFLG4 EQU   ICTLMOD+8
ICTLFLG1 EQU   ICTLMOD+9
ICTLFLG5 EQU   ICTLMOD+10
ICTLFLG6 EQU   ICTLMOD+11
ICTLFLG7 EQU   ICTLMOD+12
ICTLFLG2 EQU   ICTLMOD+13
ICTLFLG3 EQU   ICTLMOD+14
ICTLCHN  EQU   ICTLMOD+34
ICTIXLF  EQU   0
MCBPTFMP EQU   0
MCBVERMP EQU   0
MCBVEND  EQU   MCBVERMP+8
MCBIFMP  EQU   0
MCBIEND  EQU   MCBIFMP+8
MCBELEMP EQU   0
MCBENAME EQU   MCBELEMP+1
MCBEDIST EQU   MCBELEMP+9
MCBELEPM EQU   MCBELEMP+136
MCBEFLG1 EQU   MCBELEPM
MCBEFLG2 EQU   MCBELEPM+1
MCBEFLG3 EQU   MCBELEPM+2
MCBEFLG4 EQU   MCBELEPM+3
MCBEFLG5 EQU   MCBELEMP+140
MCBEEND  EQU   MCBELEMP+141
HMASMGTP EQU   0
GTPFUNCT EQU   HMASMGTP
GTPRETRN EQU   HMASMGTP+1
GTPBUFAD EQU   HMASMGTP+12
GTPRESTR EQU   HMASMGTP+16
GTPFLGS1 EQU   HMASMGTP+26
ASSMLST  EQU   0
ASSMNM   EQU   ASSMLST
ASSM@    EQU   ASSMLST+8
CCADSIDA EQU   0
CCATYPEA EQU   0
IOPBS01  EQU   0
IOPBS03  EQU   0
TBLXPARM EQU   0
TBLXINDX EQU   TBLXPARM+4
TBLXIOP2 EQU   TBLXPARM+16
TBLXTBL  EQU   TBLXPARM+28
TBLXTOP  EQU   TBLXPARM+32
TBLXNULL EQU   TBLXPARM+36
TBLXCDSI EQU   TBLXPARM+60
TBLXFLG1 EQU   TBLXPARM+80
TBLXRC   EQU   TBLXPARM+92
ICMODPTR EQU   0
ICPTFPTR EQU   0
ELMCBPTR EQU   0
GTPPTR   EQU   0
IOPUDATA EQU   IOPEND
IOPINAM3 EQU   IOPINAME
@NM00064 EQU   IOPINAM3
IOPSTCMP EQU   IOPUDATA
IOPDYNDT EQU   IOPUDATA
IOPSPACE EQU   IOPDYNDT+44
IOPDTYPE EQU   IOPDYNDT+50
IOPNTMAX EQU   IOPDRMAP
IOPNTMAP EQU   IOPDRMAP
IOPCDMAP EQU   IOPNTMAP
IOPPTMAP EQU   IOPCDMAP
IOPSCMAP EQU   IOPPTMAP
IOPDIRCT EQU   IOPSCMAP+12
IOPCDMAX EQU   IOPDIRCT
IOPCQMAP EQU   IOPDRMAP
@NM00075 EQU   IOPUDATA
@NM00076 EQU   IOPUDATA
IOPASMNT EQU   IOPUDATA
IOPASMDR EQU   IOPASMNT
IOPNTLVL EQU   IOPASMDR
IOPABUNT EQU   IOPASMDR+1
IOPABUPT EQU   IOPABUNT
IOPABUTP EQU   IOPABUNT+7
IOPLMDNT EQU   IOPUDATA
IOPLMDDR EQU   IOPLMDNT
IOPLMLEP EQU   IOPLMDDR+1
IOPLMDF1 EQU   IOPLMLEP
IOPFLGS2 EQU   IOPLMDF1
IOPLMDF2 EQU   IOPLMLEP+1
IOPLMDF3 EQU   IOPLMLEP+2
IOPLMDF4 EQU   IOPLMLEP+3
IOPLMDF5 EQU   IOPLMDDR+5
IOPFLGS3 EQU   IOPLMDF5
IOPLMDFX EQU   IOPLMDNT+24
@NM00085 EQU   IOPLMDFX
IOPLNTRY EQU   IOPLMDFX+8
IOPLSYS  EQU   IOPLNTRY
IOPSYSLB EQU   IOPLSYS
IOPMACNT EQU   IOPUDATA
IOPMACDR EQU   IOPMACNT
IOPRMIDE EQU   IOPMACDR+1
IOPRMID  EQU   IOPRMIDE
IOPRMST  EQU   IOPRMIDE+7
IOPFMIDE EQU   IOPMACDR+9
IOPFMID  EQU   IOPFMIDE
IOPMCLNG EQU   IOPMACDR+17
IOPMACFX EQU   IOPMACNT+24
IOPBUNT  EQU   IOPMACFX
IOPBUSMD EQU   IOPBUNT
IOPBUTYP EQU   IOPBUNT+7
IOPMCSYS EQU   IOPMACFX+64
IOPMCDLB EQU   IOPMACFX+72
IOPMCEND EQU   IOPMACNT+104
IOPMACVR EQU   IOPMCEND
IOPMCENT EQU   IOPMACVR
IOPMCDTA EQU   IOPMCENT
IOPMCASM EQU   IOPMCDTA
IOPMACID EQU   IOPMCASM
IOPMACND EQU   IOPMACID
IOPMACST EQU   IOPMCASM+7
IOPMCIND EQU   IOPMCENT+8
IOPMCTYP EQU   IOPMCIND
IOPEOFNT EQU   IOPUDATA
IOPSRCNT EQU   IOPUDATA
IOPSRCDR EQU   IOPSRCNT
@NM00096 EQU   IOPSRCDR+1
@NM00098 EQU   @NM00096+7
@NM00102 EQU   IOPSRCDR+9
IOPSRCFX EQU   IOPSRCNT+24
@NM00106 EQU   IOPSRCFX
IOPSRSYS EQU   IOPSRCFX+64
IOPSRDLB EQU   IOPSRCFX+72
IOPSREND EQU   IOPSRCNT+104
IOPSRCVR EQU   IOPSREND
IOPSNTRY EQU   IOPSRCVR
IOPSRDTA EQU   IOPSNTRY
IOPSRCID EQU   IOPSRDTA
IOPSRCST EQU   IOPSRDTA+7
IOPMODNT EQU   IOPUDATA
IOPMODDR EQU   IOPMODNT
@NM00112 EQU   IOPMODDR+1
@NM00114 EQU   @NM00112+7
@NM00118 EQU   IOPMODDR+9
IOPMODFX EQU   IOPMODNT+24
@NM00122 EQU   IOPMODFX
IOPMDLEP EQU   IOPMODFX+8
IOPMODF1 EQU   IOPMDLEP
IOPMODF2 EQU   IOPMDLEP+1
IOPMODF3 EQU   IOPMDLEP+2
IOPMODF4 EQU   IOPMDLEP+3
IOPDLIB  EQU   IOPMODFX+72
IOPMDEND EQU   IOPMODNT+104
IOPMODVR EQU   IOPMDEND
IOPMNTRY EQU   IOPMODVR
IOPMDDTA EQU   IOPMNTRY
IOPLMODS EQU   IOPMDDTA
IOPMODID EQU   IOPLMODS
IOPMODST EQU   IOPLMODS+7
IOPDLBNT EQU   IOPUDATA
IOPDLBDR EQU   IOPDLBNT
IOPDLBFX EQU   IOPDLBNT+24
@NM00133 EQU   IOPDLBFX
IOPDLEND EQU   IOPDLBNT+104
IOPDLBVR EQU   IOPDLEND
IOPDNTRY EQU   IOPDLBVR
IOPDSYS  EQU   IOPDNTRY
IOPDLBND EQU   IOPDSYS
IOPDLIND EQU   IOPDNTRY+8
IOPSYSNT EQU   IOPUDATA
IOPSYSDR EQU   IOPSYSNT
IOPSYSF1 EQU   IOPSYSDR+4
IOPFLGS7 EQU   IOPSYSF1
IOPSYSFX EQU   IOPSYSNT+24
@NM00140 EQU   IOPSYSFX
IOPSYEND EQU   IOPSYSNT+184
IOPSYSVR EQU   IOPSYEND
IOPSYSTR EQU   IOPSYSVR
IOPSYNTR EQU   IOPSYSTR
IOPPTFNT EQU   IOPUDATA
IOPPTFDR EQU   IOPPTFNT
IOPPSTAT EQU   IOPPTFDR+2
IOPPTFF1 EQU   IOPPSTAT
IOPFLGS5 EQU   IOPPTFF1
IOPPTFF2 EQU   IOPPSTAT+1
IOPPTFF3 EQU   IOPPSTAT+3
IOPPTFFX EQU   IOPPTFNT+24
@NM00149 EQU   IOPPTFFX
@NM00150 EQU   @NM00149
IOPPDTES EQU   IOPPTFFX+41
@NM00153 EQU   IOPPDTES
IOPPTPFX EQU   IOPPDTES+6
IOPDATES EQU   IOPPTPFX
IOPPTEND EQU   IOPPTFNT+104
IOPPTFVR EQU   IOPPTEND
IOPPNTRY EQU   IOPPTFVR
IOPPMODS EQU   IOPPNTRY
IOPENTNT EQU   IOPUDATA+104
IOPSRLNT EQU   IOPUDATA+104
IOPPRENT EQU   IOPUDATA+104
IOPNPRNT EQU   IOPUDATA+104
IOPSUPNT EQU   IOPUDATA+104
IOPREQNT EQU   IOPUDATA+104
IOPIRQNT EQU   IOPUDATA+104
IOPFIDNT EQU   IOPUDATA+104
IOPDELNT EQU   IOPUDATA+104
IOPVERNT EQU   IOPUDATA+104
IOPSBYNT EQU   IOPUDATA+104
IOPQSMNT EQU   IOPUDATA
IOPQSMDR EQU   IOPQSMNT
IOPQFMNT EQU   IOPUDATA
IOPQFMDR EQU   IOPQFMNT
IOPQFEND EQU   IOPQFMNT+2
IOPQFMVR EQU   IOPQFEND
IOPQFMLS EQU   IOPQFMVR
IOPQFMNM EQU   IOPQFMLS
IOPPTSYS EQU   IOPUDATA
IOPPTSDR EQU   IOPPTSYS
IOPPTSFX EQU   IOPPTSYS+24
IOPDSSPC EQU   IOPPTSFX
IOPPTFG1 EQU   IOPPTSFX+34
IOPPSEND EQU   IOPPTSYS+1064
IOPPTSVR EQU   IOPPSEND
IOPPTNTR EQU   IOPPTSVR
@NM00178 EQU   IOPPTNTR
IOPPTFMD EQU   @NM00178
IOPPTREL EQU   IOPPTFMD
IOPBPDS  EQU   IOPUDATA
IOPBLEP1 EQU   IOPBPDS+8
IOPBLEP2 EQU   IOPBPDS+9
@NM00182 EQU   IOPBPDS+18
IOPBFTB0 EQU   @NM00182
IOPBFTB1 EQU   IOPBFTB0
ICTENDNT EQU   ICTENDCH
MCBVVLST EQU   MCBVEND
MCBVNTRY EQU   MCBVVLST
MCBVNUM  EQU   MCBVNTRY
MCBIVLST EQU   MCBIEND
MCBINTRY EQU   MCBIVLST
MCBINUM  EQU   MCBINTRY
MCBEVLST EQU   MCBEEND
MCBENTRY EQU   MCBEVLST
MCBENUM  EQU   MCBENTRY
MCBEND   EQU   MCBENUM
ICTENDIX EQU   ICTENDCH
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS
MCBEIND  EQU   MCBEVLST+8
@NM00249 EQU   MCBENTRY+7
MCBIIND  EQU   MCBIVLST+8
@NM00242 EQU   MCBINTRY+7
MCBIND   EQU   MCBINUM
MCBVIND  EQU   MCBVVLST+8
@NM00240 EQU   MCBVNTRY+7
MCBVND   EQU   MCBVNUM
IOPBCEND EQU   IOPBPDS+21
IOPBFTB3 EQU   IOPBFTB0+2
IOPBFTB2 EQU   IOPBFTB0+1
@NM00184 EQU   IOPBFTB1
IOPBAPFP EQU   IOPBFTB1
IOPBSSI  EQU   IOPBFTB1
IOPBPAGA EQU   IOPBFTB1
@NM00183 EQU   IOPBFTB1
IOPBAOSL EQU   IOPBFTB1
IOPBSEPA EQU   IOPBPDS+15
IOPBFTBL EQU   IOPBPDS+13
IOPBSTOR EQU   IOPBPDS+10
IOPBREFR EQU   IOPBLEP2
IOPBLEF  EQU   IOPBLEP2
IOPBTEST EQU   IOPBLEP2
IOPBNE   EQU   IOPBLEP2
@NM00181 EQU   IOPBLEP2
IOPBDC   EQU   IOPBLEP2
@NM00180 EQU   IOPBLEP1
IOPBSCTR EQU   IOPBLEP1
IOPBOL   EQU   IOPBLEP1
@NM00179 EQU   IOPBLEP1
IOPBOVLY EQU   IOPBLEP1
IOPBREUS EQU   IOPBLEP1
IOPBRENT EQU   IOPBLEP1
IOPBNL   EQU   IOPBPDS+7
IOPBTTRN EQU   IOPBPDS+4
IOPBZERO EQU   IOPBPDS+3
IOPBTTRT EQU   IOPBPDS
IOPPTIND EQU   IOPPTNTR+8
IOPPTSND EQU   IOPPTREL
@NM00177 EQU   IOPPTSFX+872
IOPSYZPP EQU   IOPPTSFX+772
IOPSYZPR EQU   IOPPTSFX+771
IOPSYZPS EQU   IOPPTSFX+763
IOPSYZAP EQU   IOPPTSFX+755
IOPSYUPP EQU   IOPPTSFX+655
IOPSYUPR EQU   IOPPTSFX+654
IOPSYUPS EQU   IOPPTSFX+646
IOPSYUPD EQU   IOPPTSFX+638
IOPSYSPP EQU   IOPPTSFX+538
IOPSYSPR EQU   IOPPTSFX+537
IOPSYSPS EQU   IOPPTSFX+529
IOPSYSUP EQU   IOPPTSFX+521
IOPSYLKP EQU   IOPPTSFX+421
IOPSYLKR EQU   IOPPTSFX+420
IOPSYLKS EQU   IOPPTSFX+412
IOPSYLKD EQU   IOPPTSFX+404
IOPSYCPP EQU   IOPPTSFX+304
IOPSYCPR EQU   IOPPTSFX+303
IOPSYCPS EQU   IOPPTSFX+295
IOPSYCPY EQU   IOPPTSFX+287
IOPSYCOP EQU   IOPPTSFX+187
IOPSYCOR EQU   IOPPTSFX+186
IOPSYCOS EQU   IOPPTSFX+178
IOPSYCOM EQU   IOPPTSFX+170
IOPSYASP EQU   IOPPTSFX+70
IOPSYASR EQU   IOPPTSFX+69
IOPSYASS EQU   IOPPTSFX+61
IOPSYASM EQU   IOPPTSFX+53
@NM00176 EQU   IOPPTSFX+35
@NM00175 EQU   IOPPTFG1
IOPPTSNJ EQU   IOPPTFG1
IOPPTSNP EQU   IOPPTFG1
IOPSYPLN EQU   IOPPTSFX+32
IOPDSPFX EQU   IOPPTSFX+6
IOPDSDIR EQU   IOPDSSPC+4
IOPDSSEC EQU   IOPDSSPC+2
IOPDSPRM EQU   IOPDSSPC
@NM00174 EQU   IOPPTSDR+4
IOPPTPEM EQU   IOPPTSDR+2
IOPPCNVL EQU   IOPPTSDR+1
@NM00173 EQU   IOPPTSDR
IOPQFMTP EQU   IOPQFMLS+8
@NM00172 EQU   IOPQFMLS+7
IOPQFMND EQU   IOPQFMNM
@NM00171 EQU   IOPQFMDR
@NM00167 EQU   IOPQSMDR
@NM00166 EQU   IOPSBYNT+8
IOPSBYST EQU   IOPSBYNT+7
IOPSBYNM EQU   IOPSBYNT
@NM00165 EQU   IOPVERNT+8
IOPVERST EQU   IOPVERNT+7
IOPVERNM EQU   IOPVERNT
@NM00164 EQU   IOPDELNT+8
IOPDELST EQU   IOPDELNT+7
IOPDELNM EQU   IOPDELNT
@NM00163 EQU   IOPFIDNT+8
IOPFIDST EQU   IOPFIDNT+7
IOPFIDNM EQU   IOPFIDNT
@NM00162 EQU   IOPIRQNT+8
IOPIRQST EQU   IOPIRQNT+7
IOPIRQNM EQU   IOPIRQNT
@NM00161 EQU   IOPREQNT+8
IOPREQST EQU   IOPREQNT+7
IOPREQNM EQU   IOPREQNT
@NM00160 EQU   IOPSUPNT+8
IOPSUPST EQU   IOPSUPNT+7
IOPSUPNM EQU   IOPSUPNT
@NM00159 EQU   IOPNPRNT+8
IOPNPRST EQU   IOPNPRNT+7
IOPNPRNM EQU   IOPNPRNT
@NM00158 EQU   IOPPRENT+8
IOPPREST EQU   IOPPRENT+7
IOPPRENM EQU   IOPPRENT
@NM00157 EQU   IOPSRLNT+8
IOPSRLST EQU   IOPSRLNT+7
@NM00156 EQU   IOPSRLNT+4
IOPSRLNM EQU   IOPSRLNT
@NM00155 EQU   IOPENTNT+8
IOPENTST EQU   IOPENTNT+7
IOPENTNM EQU   IOPENTNT
IOPPIND  EQU   IOPPNTRY+8
IOPPTFND EQU   IOPPMODS
IOPPFMID EQU   IOPPTFFX+73
@NM00154 EQU   IOPPTPFX+24
IOPUCLT  EQU   IOPDATES+21
IOPUCLD  EQU   IOPDATES+18
IOPACCT  EQU   IOPDATES+15
IOPACCD  EQU   IOPDATES+12
IOPRSTT  EQU   IOPDATES+9
IOPRSTD  EQU   IOPDATES+6
IOPAPPT  EQU   IOPDATES+3
IOPAPPD  EQU   IOPDATES
IOPRECT  EQU   @NM00153+3
IOPRECD  EQU   @NM00153
@NM00152 EQU   IOPPTFFX+8
@NM00151 EQU   @NM00149+7
IOPPRELN EQU   @NM00150
@NM00148 EQU   IOPPTFDR+20
IOPSBYNO EQU   IOPPTFDR+13
IOPDBYNO EQU   IOPPTFDR+6
@NM00147 EQU   IOPPTFF3
IOPFLF   EQU   IOPPTFF3
IOPDBYP  EQU   IOPPTFF3
IOPSBYP  EQU   IOPPTFF3
IOPPMDLP EQU   IOPPTFF2+1
IOPPADDP EQU   IOPPTFF2+1
@NM00146 EQU   IOPPTFF2+1
IOPLRFP  EQU   IOPPTFF2
IOPJCLP  EQU   IOPPTFF2
IOPSUPP  EQU   IOPPTFF2
IOPREQP  EQU   IOPPTFF2
IOPPREP  EQU   IOPPTFF2
IOPNPRP  EQU   IOPPTFF2
IOPIRQP  EQU   IOPPTFF2
IOPDELP  EQU   IOPPTFF2
IOPREGEN EQU   IOPFLGS5
IOPBYP   EQU   IOPFLGS5
IOPDUMMP EQU   IOPFLGS5
@NM00145 EQU   IOPFLGS5
IOPERROR EQU   IOPFLGS5
IOPACC   EQU   IOPFLGS5
IOPRES   EQU   IOPFLGS5
IOPAPP   EQU   IOPFLGS5
IOPPTYPE EQU   IOPPTFDR+1
@NM00144 EQU   IOPPTFDR
IOPSYSTP EQU   IOPSYSTR+8
IOPSYSND EQU   IOPSYNTR
@NM00143 EQU   IOPSYSFX+21
IOPSYSID EQU   IOPSYSFX+13
IOPNUCID EQU   IOPSYSFX+12
IOPSREL  EQU   IOPSYSFX+8
@NM00142 EQU   @NM00140+7
@NM00141 EQU   @NM00140
@NM00139 EQU   IOPSYSDR+5
@NM00138 EQU   IOPFLGS7
IOPSYNG  EQU   IOPFLGS7
IOPSYDL  EQU   IOPFLGS7
IOPSTSNP EQU   IOPFLGS7
IOPMTSNP EQU   IOPFLGS7
IOPPEMAX EQU   IOPSYSDR+2
IOPSCNVL EQU   IOPSYSDR+1
@NM00137 EQU   IOPSYSDR
@NM00136 EQU   IOPDLBFX+8
@NM00135 EQU   @NM00133+7
@NM00134 EQU   @NM00133
@NM00132 EQU   IOPDLBDR+1
@NM00131 EQU   IOPDLBDR
IOPMDIND EQU   IOPMNTRY+8
@NM00130 EQU   IOPMODST
IOPMODND EQU   IOPMODID
@NM00129 EQU   IOPMODFX+12
@NM00128 EQU   IOPMODF4
@NM00127 EQU   IOPMODF3
@NM00126 EQU   IOPMODF2
IOPMPAGA EQU   IOPMODF2
IOPMNE   EQU   IOPMODF2
@NM00125 EQU   IOPMODF1
IOPMDC   EQU   IOPMODF1
IOPMREFR EQU   IOPMODF1
IOPMOVLY EQU   IOPMODF1
IOPMSCTR EQU   IOPMODF1
IOPMREUS EQU   IOPMODF1
IOPMRENT EQU   IOPMODF1
IOPMAPF  EQU   IOPMODF1
@NM00124 EQU   @NM00122+7
@NM00123 EQU   @NM00122
@NM00121 EQU   IOPMODDR+17
@NM00120 EQU   @NM00118+7
@NM00119 EQU   @NM00118
@NM00117 EQU   @NM00114
@NM00116 EQU   @NM00114
@NM00115 EQU   @NM00114
@NM00113 EQU   @NM00112
@NM00111 EQU   IOPMODDR
IOPSRIND EQU   IOPSNTRY+8
@NM00110 EQU   IOPSRCST
IOPSRCND EQU   IOPSRCID
@NM00109 EQU   IOPSRCFX+8
@NM00108 EQU   @NM00106+7
@NM00107 EQU   @NM00106
@NM00105 EQU   IOPSRCDR+18
IOPSRLNG EQU   IOPSRCDR+17
@NM00104 EQU   @NM00102+7
@NM00103 EQU   @NM00102
@NM00101 EQU   @NM00098
@NM00100 EQU   @NM00098
@NM00099 EQU   @NM00098
@NM00097 EQU   @NM00096
@NM00095 EQU   IOPSRCDR
IOPEOFND EQU   IOPEOFNT
@NM00094 EQU   IOPMACST
@NM00093 EQU   IOPMACFX+8
@NM00092 EQU   IOPMACDR+18
IOPFMST  EQU   IOPFMIDE+7
@NM00091 EQU   IOPRMST
IOPRMASM EQU   IOPRMST
@NM00090 EQU   IOPRMST
@NM00089 EQU   IOPMACDR
IOPLMIND EQU   IOPLNTRY+8
IOPLMDND EQU   IOPSYSLB
@NM00087 EQU   @NM00085+7
@NM00086 EQU   @NM00085
@NM00084 EQU   IOPLMDDR+6
@NM00083 EQU   IOPFLGS3
IOPCHREP EQU   IOPFLGS3
IOPLINK  EQU   IOPFLGS3
IOPCOPY  EQU   IOPFLGS3
@NM00082 EQU   IOPLMDF4
@NM00081 EQU   IOPLMDF3
@NM00080 EQU   IOPLMDF2
IOPPAGA  EQU   IOPLMDF2
IOPNE    EQU   IOPLMDF2
@NM00079 EQU   IOPFLGS2
IOPDC    EQU   IOPFLGS2
IOPREFR  EQU   IOPFLGS2
IOPOVLY  EQU   IOPFLGS2
IOPSCTR  EQU   IOPFLGS2
IOPREUS  EQU   IOPFLGS2
IOPRENT  EQU   IOPFLGS2
IOPAPF   EQU   IOPFLGS2
@NM00078 EQU   IOPLMDDR
@NM00077 EQU   IOPASMDR+9
IOPALLOC EQU   @NM00076+4
IOPUSED  EQU   @NM00076
IOPTPSEQ EQU   @NM00075+8
IOPVLSER EQU   @NM00075+2
IOPBLKSI EQU   @NM00075
IOPCQMAX EQU   IOPCQMAP+12
@NM00074 EQU   IOPCQMAP+11
@NM00073 EQU   IOPCQMAP+8
@NM00072 EQU   IOPCQMAP
IOPPTMAX EQU   IOPCDMAX
@NM00071 EQU   IOPSCMAP+11
@NM00070 EQU   IOPSCMAP+8
@NM00069 EQU   IOPSCMAP
IOPDIRMX EQU   IOPNTMAX+12
@NM00068 EQU   IOPNTMAX+11
@NM00067 EQU   IOPNTMAX+8
@NM00066 EQU   IOPNTMAX
@NM00065 EQU   IOPDTYPE
IOPDMOD  EQU   IOPDTYPE
IOPDJCL  EQU   IOPDTYPE
IOPDSRC  EQU   IOPDTYPE
IOPDMAC  EQU   IOPDTYPE
IOPSDIR  EQU   IOPSPACE+4
IOPSSCND EQU   IOPSPACE+2
IOPSPRIM EQU   IOPSPACE
IOPDSN   EQU   IOPDYNDT
IOPNTYPE EQU   IOPSTCMP+17
IOPNNAME EQU   IOPSTCMP+9
IOPOTYPE EQU   IOPSTCMP+8
IOPONAME EQU   IOPSTCMP
IOPISEQ3 EQU   IOPINAM3+6
IOPITYP3 EQU   @NM00064+5
IOPIPTF3 EQU   @NM00064
TBLXEND0 EQU   TBLXPARM+124
@NM00007 EQU   TBLXPARM+108
TBLXIOP3 EQU   TBLXPARM+104
TBLXD2GT EQU   TBLXPARM+100
TBLXDLGT EQU   TBLXPARM+96
@NM00006 EQU   TBLXRC+3
TBLXIRC  EQU   TBLXRC+2
TBLXLRC  EQU   TBLXRC+1
TBLXTRC  EQU   TBLXRC
TBLXIBGN EQU   TBLXPARM+88
TBLXTSLP EQU   TBLXPARM+84
@NM00005 EQU   TBLXPARM+83
@NM00004 EQU   TBLXPARM+82
@NM00003 EQU   TBLXPARM+81
@NM00002 EQU   TBLXFLG1
TBLXTCRC EQU   TBLXFLG1
TBLXFUND EQU   TBLXPARM+72
TBLXFUNC EQU   TBLXPARM+64
@NM00001 EQU   TBLXPARM+62
TBLXCRQI EQU   TBLXPARM+61
TBLXLMGT EQU   TBLXPARM+56
TBLXSCGT EQU   TBLXPARM+52
TBLXSREL EQU   TBLXPARM+48
TBLXASGT EQU   TBLXPARM+44
TBLXIFGT EQU   TBLXPARM+40
TBLXSEGT EQU   TBLXPARM+24
TBLXIOPF EQU   TBLXPARM+20
TBLXEND  EQU   TBLXINDX+8
TBLXSTRT EQU   TBLXINDX+4
TBLXCUR  EQU   TBLXINDX
TBLXHDR  EQU   TBLXPARM
@NM00254 EQU   HMASMGTP+27
GTPPSIZE EQU   GTPFLGS1
@NM00253 EQU   GTPFLGS1
GTPRCDNF EQU   GTPFLGS1
GTPNOSPM EQU   GTPFLGS1
GTPPOS   EQU   GTPRESTR+8
GTPRCD   EQU   GTPRESTR+4
GTPPAG   EQU   GTPRESTR
GTPWKAD  EQU   HMASMGTP+8
GTPKEYLN EQU   HMASMGTP+6
GTPRCDLN EQU   HMASMGTP+4
@NM00252 EQU   HMASMGTP+2
@NM00248 EQU   MCBEFLG5
MCBEDEL  EQU   MCBEFLG5
MCBESTD  EQU   MCBEFLG5
@NM00247 EQU   MCBEFLG4
@NM00246 EQU   MCBEFLG3
@NM00245 EQU   MCBEFLG2
MCBEPAGA EQU   MCBEFLG2
MCBENE   EQU   MCBEFLG2
@NM00244 EQU   MCBEFLG1
MCBEDC   EQU   MCBEFLG1
MCBEREFR EQU   MCBEFLG1
MCBEOVLY EQU   MCBEFLG1
MCBESCTR EQU   MCBEFLG1
MCBEREUS EQU   MCBEFLG1
MCBERENT EQU   MCBEFLG1
MCBEAPF  EQU   MCBEFLG1
MCBERMID EQU   MCBELEMP+129
MCBELLKD EQU   MCBELEMP+128
MCBEJLKD EQU   MCBELEMP+116
MCBELUPI EQU   MCBELEMP+115
MCBEJUPI EQU   MCBELEMP+103
MCBELCPY EQU   MCBELEMP+102
MCBEJCPY EQU   MCBELEMP+90
MCBELASM EQU   MCBELEMP+89
MCBEJASM EQU   MCBELEMP+77
MCBERLF  EQU   MCBELEMP+73
MCBESSI  EQU   MCBELEMP+65
MCBEDALS EQU   MCBELEMP+57
MCBEASLB EQU   MCBELEMP+49
MCBELKLB EQU   MCBELEMP+41
MCBETXLB EQU   MCBELEMP+33
MCBESYS  EQU   MCBELEMP+25
MCBEDOBJ EQU   MCBELEMP+17
@NM00243 EQU   MCBELEMP
MCBIFENV EQU   MCBIFMP+1
@NM00241 EQU   MCBIFMP
MCBSFMID EQU   MCBVERMP+1
@NM00239 EQU   MCBVERMP
MCBPTP   EQU   MCBPTFMP+10
MCBPRELN EQU   MCBPTFMP+8
MCBPNO   EQU   MCBPTFMP+1
MCBTYPE  EQU   MCBPTFMP
ICTIXL   EQU   ICTIXLF
@NM00238 EQU   ICTLMOD+38
ICTLTTR  EQU   ICTLMOD+31
ICTTG2   EQU   ICTLMOD+23
ICTTG1   EQU   ICTLMOD+15
@NM00237 EQU   ICTLFLG3
ICTLZAP  EQU   ICTLFLG3
ICTLLKD  EQU   ICTLFLG3
ICTLCPY  EQU   ICTLFLG3
ICTLXPND EQU   ICTLFLG3
ICTTIND2 EQU   ICTLFLG3
ICTTIND1 EQU   ICTLFLG3
@NM00236 EQU   ICTLFLG2
ICTLDEL  EQU   ICTLFLG2
@NM00235 EQU   ICTLFLG2
ICTLTDEL EQU   ICTLFLG2
ICTLINK  EQU   ICTLFLG2
ICTCOPY  EQU   ICTLFLG2
@NM00234 EQU   ICTLFLG7
@NM00233 EQU   ICTLFLG6
@NM00232 EQU   ICTLFLG5
ICTLPAGA EQU   ICTLFLG5
ICTLNE   EQU   ICTLFLG5
@NM00231 EQU   ICTLFLG1
ICTLDC   EQU   ICTLFLG1
ICTLREFR EQU   ICTLFLG1
ICTLOVLY EQU   ICTLFLG1
ICTLSCTR EQU   ICTLFLG1
ICTLREUS EQU   ICTLFLG1
ICTLRENT EQU   ICTLFLG1
ICTLAPF  EQU   ICTLFLG1
@NM00230 EQU   ICTLFLG4
ICTLPASS EQU   ICTLFLG4
ICTLDDCK EQU   ICTLFLG4
ICTLMSG  EQU   ICTLFLG4
ICTLCPL  EQU   ICTLFLG4
ICTLNOGO EQU   ICTLFLG4
ICTLPROC EQU   ICTLFLG4
ICTLEND  EQU   ICTLNAME
@NM00229 EQU   ICTMUMNT+7
ICTMUMND EQU   ICTMUMNM
@NM00228 EQU   ICTMVRNT+7
ICTMVRND EQU   ICTMVRNM
ICTTALND EQU   ICTTALNM
ICTASMND EQU   ICTASMAD
ICTMIDTY EQU   ICTMODST
ICTMIDAM EQU   ICTMODST
ICTMIDRG EQU   ICTMODST
ICTMIDF1 EQU   ICTMODST
ICTMIDPL EQU   ICTMODST
ICTMIDPS EQU   ICTMODST
@NM00227 EQU   ICTMODST
ICTMIDND EQU   ICTMODID
ICTIXM   EQU   ICTIXMF
@NM00226 EQU   ICTMOD+128
@NM00225 EQU   ICTMOD+95
@NM00224 EQU   ICTMOD+87
ICTMSSI  EQU   ICTMOD+72
ICTMSYSL EQU   ICTMOD+56
ICTMRELN EQU   ICTMOD+22
@NM00223 EQU   ICTMOD+21
@NM00222 EQU   ICTMOD+19
ICTMACF5 EQU   ICTMOD+18
ICTMZMPR EQU   ICTMACF4
ICTMZOMZ EQU   ICTMACF4
ICTMXUPD EQU   ICTMACF4
ICTMFXC  EQU   ICTMACF4
ICTMFXBS EQU   ICTMACF4
ICTMHASM EQU   ICTMACF4
ICTMACDL EQU   ICTMACF4
@NM00221 EQU   ICTMLEP4
@NM00220 EQU   ICTMLEP3
@NM00219 EQU   ICTMLEP2
ICTMPAGA EQU   ICTMLEP2
ICTMNE   EQU   ICTMLEP2
@NM00218 EQU   ICTMLEP1
ICTMDC   EQU   ICTMLEP1
ICTMREFR EQU   ICTMLEP1
ICTMOVLY EQU   ICTMLEP1
ICTMSCTR EQU   ICTMLEP1
ICTMREUS EQU   ICTMLEP1
ICTMRENT EQU   ICTMLEP1
ICTMAPF  EQU   ICTMLEP1
@NM00217 EQU   ICTMFLG5
ICTMNORL EQU   ICTMFLG5
ICTMELCK EQU   ICTMFLG5
ICTMCOPY EQU   ICTMFLG5
ICTMPASS EQU   ICTMFLG5
@NM00216 EQU   ICTMFLG4
ICTMTSEL EQU   ICTMFLG4
ICTMDSTE EQU   ICTMFLG4
ICTMMIDE EQU   ICTMFLG4
ICTMASOC EQU   ICTMFLG4
ICTMSELM EQU   ICTMFLG4
ICTMISEL EQU   ICTMFLG4
@NM00215 EQU   ICTMFLG3
ICTMPRMS EQU   ICTMFLG3
ICTMALIS EQU   ICTMFLG3
ICTMWRK  EQU   ICTMFLG3
ICTMTRX  EQU   ICTMFLG3
ICTMRELF EQU   ICTMFLG3
ICTLIBTX EQU   ICTMFLG3
ICTLIBLK EQU   ICTMFLG3
ICTMXPND EQU   ICTMFLG1
ICTMZAP  EQU   ICTMFLG1
@NM00214 EQU   ICTMFLG2
@NM00213 EQU   ICTMFLG2
ICTMMIDU EQU   ICTMFLG2
ICTMDEL  EQU   ICTMFLG2
ICTMMSG  EQU   ICTMFLG2
ICTMNOGO EQU   ICTMFLG2
ICTMPROC EQU   ICTMFLG2
@NM00212 EQU   ICTSBYNT+7
ICTSBYND EQU   ICTSBYNM
ICTDELEX EQU   ICTDELST
ICTDELND EQU   ICTDELNM
@NM00211 EQU   ICTVRSNT+7
ICTVRSND EQU   ICTVRSNM
@NM00210 EQU   ICTNPRNT+7
ICTNPRND EQU   ICTNPRNM
@NM00209 EQU   ICTCSRST
@NM00208 EQU   ICTCSRST
ICTCSRF  EQU   ICTCSRST
@NM00207 EQU   ICTCSRST
ICTCSRNM EQU   ICTIRQNT+8
@NM00206 EQU   ICTIRQST
ICTIREQT EQU   ICTIRQST
ICTIREQI EQU   ICTIRQST
ICTIREQB EQU   ICTIRQST
ICTIREQS EQU   ICTIRQST
@NM00205 EQU   ICTIRQST
ICTIRQND EQU   ICTIRQNM
@NM00204 EQU   ICTPREST
ICTPREQT EQU   ICTPREST
ICTPREQI EQU   ICTPREST
ICTPREQB EQU   ICTPREST
ICTPREQS EQU   ICTPREST
@NM00203 EQU   ICTPREST
ICTPREND EQU   ICTPRENM
@NM00202 EQU   ICTSUPNT+7
ICTSUPND EQU   ICTSUPNM
@NM00201 EQU   ICTREQST
ICTRREQT EQU   ICTREQST
ICTRREQI EQU   ICTREQST
ICTRREQB EQU   ICTREQST
ICTRREQS EQU   ICTREQST
@NM00200 EQU   ICTREQST
ICTREQND EQU   ICTREQNM
@NM00199 EQU   ICTENTST
ICTEREQT EQU   ICTENTST
ICTEREQI EQU   ICTENTST
ICTEREQB EQU   ICTENTST
ICTEREQS EQU   ICTENTST
@NM00198 EQU   ICTENTST
ICTENTND EQU   ICTENTNM
ICTIXP   EQU   ICTIXPF
@NM00197 EQU   ICTPTF+100
ICTPTPFX EQU   ICTPTF+38
ICTPRELN EQU   ICTPTF+36
ICTPRECT EQU   ICTPTF+33
ICTPRECD EQU   ICTPTF+30
ICTPVERN EQU   ICTPTF+29
ICTPSUPN EQU   ICTPTF+20
ICTPONUM EQU   ICTPTF+18
ICTPUSR8 EQU   ICTPFLGA
ICTPUSR7 EQU   ICTPFLGA
ICTPUSR6 EQU   ICTPFLGA
ICTPUSR5 EQU   ICTPFLGA
ICTPUSR4 EQU   ICTPFLGA
ICTPUSR3 EQU   ICTPFLGA
ICTPUSR2 EQU   ICTPFLGA
ICTPPASS EQU   ICTPUSR1
@NM00196 EQU   @NM00195
ICTPRQBY EQU   @NM00195
ICTPRQOK EQU   @NM00195
ICTPRQCK EQU   @NM00195
@NM00194 EQU   ICTPFLG9
ICTPPDEL EQU   ICTPFLG9
ICTPWRKO EQU   ICTPFLG9
ICTPMSL  EQU   ICTPFLG9
@NM00193 EQU   ICTPFLG8
ICTPDCPL EQU   ICTPFLG8
ICTPECPL EQU   ICTPFLG8
ICTPGCPL EQU   ICTPFLG8
@NM00192 EQU   ICTPFLG4
@NM00191 EQU   ICTPFLG4
@NM00190 EQU   ICTPFLG4
ICTPGELM EQU   ICTPFLG4
ICTPDIMP EQU   ICTPFLG4
ICTPDEXP EQU   ICTPFLG4
ICTPREDO EQU   ICTPFLG4
ICTPCDSE EQU   ICTPFLG4
@NM00189 EQU   ICTPFLG2
ICTPRCND EQU   ICTPFLG2
ICTPTPS  EQU   ICTPFLG2
ICTPTR1  EQU   ICTPFLG2
ICTPVRSP EQU   ICTPFLG2
@NM00188 EQU   ICTPFLG6
ICTFLF   EQU   ICTPFLF
ICTPDBYP EQU   ICTPFLG6
ICTPSBYP EQU   ICTPFLG6
ICTPMDLP EQU   ICTPFLG5+1
ICTPADDP EQU   ICTPFLG5+1
@NM00187 EQU   ICTPFLG5+1
ICTPLRFP EQU   ICTPFLG5
ICTPJCLP EQU   ICTPFLG5
ICTPSUPP EQU   ICTPFLG5
ICTPREQP EQU   ICTPFLG5
ICTPPREP EQU   ICTPFLG5
ICTPNPRP EQU   ICTPFLG5
ICTPIRQP EQU   ICTPFLG5
ICTPDELP EQU   ICTPFLG5
@NM00186 EQU   ICTPFLG3
ICTPSLST EQU   ICTPFLG3
ICTPNOLB EQU   ICTPFLG3
ICTPVERJ EQU   ICTPFLG3
ICTPMSG  EQU   ICTPFLG3
ICTPCPL  EQU   ICTPFLG3
ICTPNOGO EQU   ICTPFLG3
ICTPROCS EQU   ICTPPROC
ICTREGEN EQU   ICTPFLG1
ICTBYP   EQU   ICTPFLG1
ICTDUMMP EQU   ICTPFLG1
@NM00185 EQU   ICTPFLG1
ICTERROR EQU   ICTPFLG1
ICTACC   EQU   ICTPFLG1
ICTRES   EQU   ICTPFLG1
ICTAPP   EQU   ICTPFLG1
ICTPEND  EQU   ICTPTFS
ICTLEN   EQU   ICTGMSPL+1
ICTSP    EQU   ICTGMSPL
ICTLLEN  EQU   ICTLSPLN+1
ICTLSP   EQU   ICTLSPLN
ICTMLEN  EQU   ICTMSPLN+1
ICTMSP   EQU   ICTMSPLN
ICTPLEN  EQU   ICTPSPLN+1
ICTPSP   EQU   ICTPSPLN
IOPBS04E EQU   IOPBS04+2
IOPBAPFC EQU   IOPBAPF+1
IOPBAPFL EQU   IOPBAPF
IOPBS2NM EQU   IOPBS02+3
IOPBS2EP EQU   IOPBS02
IOPQSMTP EQU   IOPQSMLS+8
@NM00170 EQU   IOPQSMLS+7
IOPQSMND EQU   IOPQSMNM
@NM00169 EQU   @NM00168+7
IOPQSMFM EQU   @NM00168
@NM00088 EQU   IOPLMCTL+17
IOPLMCRD EQU   IOPLMCTL+9
IOPLMCRN EQU   IOPLMCTL+1
IOPLMCC  EQU   IOPLMCTL
@NM00063 EQU   IOPUSERL
@NM00062 EQU   IOPUSERL
IOPALIS  EQU   IOPUSERL
IOPTTR   EQU   IOPDRMAP+8
IOPINAM2 EQU   IOPINAM+1
IOPITYP2 EQU   IOPITYP
@NM00061 EQU   HMASMIOP+32
IOPDELDD EQU   IOPDDNAM
@NM00060 EQU   @NM00057+10
IOPSEQNO EQU   @NM00057+8
@NM00059 EQU   @NM00058+7
IOPPTFNM EQU   @NM00058
IOPNAM17 EQU   IOPNAME
CCABMREC EQU   CCABELMT+10
CCABPOS  EQU   CCABMPOS+8
CCABNAME EQU   CCABMPOS
@NM00056 EQU   CCABLDLM+2
@NM00055 EQU   CCABLDLM
CCAUPDPM EQU   @NM00053+24
@NM00054 EQU   @NM00053+21
CCARUPDT EQU   CCAUPDRC
CCAUPDSP EQU   @NM00053+12
CCAUPDTE EQU   @NM00053+8
CCAUPDNM EQU   @NM00053
CCASUPPM EQU   @NM00051+24
@NM00052 EQU   @NM00051+21
CCARSUP  EQU   CCASUPRC
CCASUPSP EQU   @NM00051+12
CCAIOSUP EQU   @NM00051+8
CCASUPNM EQU   @NM00051
CCAZAPPM EQU   @NM00049+24
@NM00050 EQU   @NM00049+21
CCARZAP  EQU   CCAZAPRC
CCAZAPSP EQU   @NM00049+12
CCASPZAP EQU   @NM00049+8
CCAZAPNM EQU   @NM00049
CCACOMPM EQU   @NM00047+24
@NM00048 EQU   @NM00047+21
CCARCOMP EQU   CCACOMRC
CCACOMSP EQU   @NM00047+12
CCACOMRS EQU   @NM00047+8
CCACOMNM EQU   @NM00047
CCACPYPM EQU   @NM00045+24
@NM00046 EQU   @NM00045+21
CCARCOPY EQU   CCACPYRC
CCACPYSP EQU   @NM00045+12
CCACOPY  EQU   @NM00045+8
CCACPYNM EQU   @NM00045
CCAASMPM EQU   @NM00043+24
@NM00044 EQU   @NM00043+21
CCARASM  EQU   CCAASMRC
CCAASMSP EQU   @NM00043+12
CCAASM   EQU   @NM00043+8
CCAASMNM EQU   @NM00043
CCALKDPM EQU   @NM00041+24
@NM00042 EQU   @NM00041+21
CCARLINK EQU   CCALKDRC
CCALKDSP EQU   @NM00041+12
CCALKED  EQU   @NM00041+8
CCALKDNM EQU   @NM00041
CCAPGMPM EQU   @NM00039+24
@NM00040 EQU   @NM00039+21
CCABPGRC EQU   @NM00039+20
CCABPGSP EQU   @NM00039+12
CCABPGAD EQU   @NM00039+8
CCABPGNM EQU   @NM00039
CCAEND   EQU   HMASMCCA+371
@NM00038 EQU   HMASMCCA+309
CCACURDD EQU   CCAFDSNG+3
CCACURDS EQU   CCAFDSNG+2
@NM00037 EQU   CCAFLAGB
CCAOUTNG EQU   CCAFLAGB
CCALOGNG EQU   CCAFLAGB
CCAFMID  EQU   HMASMCCA+291
CCALSTDS EQU   CCAFCTL+8
CCARPTDS EQU   CCAFCTL+7
CCATIME  EQU   CCAFCTL+4
CCADATE  EQU   CCAFCTL+1
@NM00036 EQU   CCAFLAG9
CCARVCAN EQU   CCAFLAG9
CCARVEST EQU   CCAFLAG9
CCAPTSNJ EQU   CCAFLAG9
CCASTSNP EQU   CCAFLAG9
CCAMTSNP EQU   CCAFLAG9
CCAPTSNP EQU   CCAFLAG9
@NM00035 EQU   CCAFLAG8
CCAACDSC EQU   CCAFLAG8
CCACDSC  EQU   CCAFLAG8
@NM00034 EQU   CCAFLAG6
CCAACRUP EQU   CCAFLAG6
CCACRQUP EQU   CCAFLAG6
CCAACDUP EQU   CCAFLAG6
CCACDSUP EQU   CCAFLAG6
@NM00033 EQU   CCAFLAG5
CCAACROS EQU   CCAFLAG5
CCACRQOS EQU   CCAFLAG5
CCAACDOS EQU   CCAFLAG5
CCACDSOS EQU   CCAFLAG5
@NM00032 EQU   CCAFLAG4
CCAACRIS EQU   CCAFLAG4
CCACRQIS EQU   CCAFLAG4
CCAACDIS EQU   CCAFLAG4
CCACDSIS EQU   CCAFLAG4
@NM00031 EQU   CCAFLAG3+1
CCARGNP  EQU   CCAFLAG3+1
CCADISRQ EQU   CCAFLAG3+1
CCAICTOK EQU   CCAFLAG3
CCADELP  EQU   CCAFLAG3
CCACMPRS EQU   CCAFLAG3
CCAZAPP  EQU   CCAFLAG3
CCALINKP EQU   CCAFLAG3
CCACOPYP EQU   CCAFLAG3
CCAASIP  EQU   CCAFLAG3
CCAUPDP  EQU   CCAFLAG3
CCAEOSMP EQU   CCAFLAG2
CCAEOFNC EQU   CCAFLAG2
@NM00030 EQU   CCAFLAG2
CCACHECK EQU   CCAFLAG2
CCATERM  EQU   CCAFLAG2
CCASVCLB EQU   CCAFLAG2
CCANCPTF EQU   CCAFLAG2
@NM00029 EQU   CCAFLAG1+1
CCAUNL   EQU   CCAFLAG1+1
CCARESET EQU   CCAFLAG1+1
CCALOG   EQU   CCAFLAG1+1
CCACNV   EQU   CCAFLAG1+1
CCALIST  EQU   CCAFLAG1
CCAUPDU  EQU   CCAFLAG1
CCAUPDJ  EQU   CCAFLAG1
CCAREJ   EQU   CCAFLAG1
CCAREC   EQU   CCAFLAG1
CCAFUNCT EQU   CCAFFUNC
@NM00028 EQU   @NM00023+18
@NM00027 EQU   @NM00023+16
CCATBLPA EQU   @NM00023+12
@NM00026 EQU   @NM00023+8
@NM00025 EQU   @NM00023+4
@NM00024 EQU   @NM00023
CCAIFGTP EQU   CCAFGTP+16
CCAGTP3  EQU   CCAFGTP+12
CCAGTP2  EQU   CCAFGTP+8
CCAGTP1  EQU   CCAFGTP+4
CCASETAD EQU   CCASEGTP
CCACLST  EQU   CCAFPGM+12
CCASPDCB EQU   CCAFPGM+8
CCARVAD  EQU   CCAFSTA
CCAACDID EQU   CCAFSYS+32
CCACDSID EQU   CCAFSYS+24
CCALNLEN EQU   CCAFSYS+22
@NM00022 EQU   CCAFLAGA
CCAPSYSF EQU   CCAFLAGA
CCAASYSF EQU   CCAFLAGA
CCACSYSF EQU   CCAFLAGA
CCANUCID EQU   CCAFSYS+20
CCAASREL EQU   CCAFSYS+16
CCACSREL EQU   CCASREL
CCAPEMAX EQU   CCAFSYS+10
CCAPGLEN EQU   CCAFSYS+8
CCAIOPAS EQU   CCAFSYS+4
CCAIOPCS EQU   CCAFSYS
CCAPESIZ EQU   CCAFIOP+4
@NM00021 EQU   CCAFLAG7+3
CCALOGP  EQU   CCAFLAG7+2
CCAOUTP  EQU   CCAFLAG7+2
CCASLBP  EQU   CCAFLAG7+2
CCARPTP  EQU   CCAFLAG7+2
CCALISTP EQU   CCAFLAG7+2
CCAJCLP  EQU   CCAFLAG7+2
CCAPTFP  EQU   CCAFLAG7+2
CCATLBP  EQU   CCAFLAG7+2
CCAUT3P  EQU   CCAFLAG7+1
CCAUT2P  EQU   CCAFLAG7+1
CCAUT1P  EQU   CCAFLAG7+1
CCAWK5P  EQU   CCAFLAG7+1
CCAWK4P  EQU   CCAFLAG7+1
CCAWK3P  EQU   CCAFLAG7+1
CCAWK2P  EQU   CCAFLAG7+1
CCAWK1P  EQU   CCAFLAG7+1
CCAACRQP EQU   CCAFLAG7
CCACRQP  EQU   CCAFLAG7
CCASTSP  EQU   CCAFLAG7
CCAMTSP  EQU   CCAFLAG7
CCAPTSP  EQU   CCAFLAG7
CCASCDSP EQU   CCAFLAG7
CCAACDSP EQU   CCAFLAG7
CCACDSP  EQU   CCAFLAG7
@NM00020 EQU   CCAFBUFR+122
@NM00019 EQU   CCAFBUFR+120
@NM00018 EQU   CCAFBUFR+118
CCATBFMX EQU   CCAFBUFR+116
CCA4BFMX EQU   CCAFBUFR+114
CCA3BFMX EQU   CCAFBUFR+112
CCA2BFMX EQU   CCAFBUFR+110
CCA1BFMX EQU   CCAFBUFR+108
CCAXBFMX EQU   CCAFBUFR+106
CCAQBFMX EQU   CCAFBUFR+104
CCASBFMX EQU   CCAFBUFR+102
CCAMBFMX EQU   CCAFBUFR+100
CCAPBFMX EQU   CCAFBUFR+98
CCAVBFMX EQU   CCAFBUFR+96
CCAABFMX EQU   CCAFBUFR+94
CCACBFMX EQU   CCAFBUFR+92
@NM00017 EQU   CCAFBUFR+88
@NM00016 EQU   CCAFBUFR+84
CCA4BFSZ EQU   CCAFBUFR+80
CCATBFSZ EQU   CCAFBUFR+76
CCAWBFSZ EQU   CCAFBUFR+72
CCAQBFSZ EQU   CCAFBUFR+68
CCAPBFSZ EQU   CCAFBUFR+64
CCAVBFSZ EQU   CCAFBUFR+60
CCACBFSZ EQU   CCAFBUFR+56
@NM00015 EQU   CCAFBUFR+52
CCA4BFOA EQU   CCAFBUFR+48
CCA4BFIA EQU   CCAFBUFR+44
CCATBFIA EQU   CCAFBUFR+40
CCAWBFOA EQU   CCAFBUFR+36
CCAWBFIA EQU   CCAFBUFR+32
CCAQBFOA EQU   CCAFBUFR+28
CCAQBFIA EQU   CCAFBUFR+24
CCAPBFOA EQU   CCAFBUFR+20
CCAPBFIA EQU   CCAFBUFR+16
CCAVBFOA EQU   CCAFBUFR+12
CCAVBFIA EQU   CCAFBUFR+8
CCACBFOA EQU   CCAFBUFR+4
CCACBFIA EQU   CCAFBUFR
CCAID    EQU   HMASMCCA
@NM00014 EQU   TBLFLG5
TBLICTOK EQU   TBLFLG5
@NM00013 EQU   TBLFLG4
TBLBPFM  EQU   TBLFLG4
@NM00012 EQU   TBLFLG4
TBLBPIRQ EQU   TBLFLG4
TBLBPREQ EQU   TBLFLG4
TBLBPPRE EQU   TBLFLG4
TBLBPID  EQU   TBLFLG4
@NM00011 EQU   TBLFLG3+1
TBLSTS   EQU   TBLFLG3
TBLMTS   EQU   TBLFLG3
TBLPTS   EQU   TBLFLG3
TBLACRQ  EQU   TBLFLG3
TBLCRQ   EQU   TBLFLG3
TBLSCDS  EQU   TBLFLG3
TBLACDS  EQU   TBLFLG3
TBLCDS   EQU   TBLFLG3
TBLMASS  EQU   TBLFLG2
@NM00010 EQU   TBLFLG2
TBLFMID  EQU   TBLFLG2
TBLGROUP EQU   TBLFLG2
TBLEXC   EQU   TBLFLG2
TBLSEL   EQU   TBLFLG2
@NM00009 EQU   TBLFLG1+1
TBLDISW  EQU   TBLFLG1+1
TBLDISR  EQU   TBLFLG1+1
TBLDISN  EQU   TBLFLG1+1
TBLNOJCL EQU   TBLFLG1
TBLFLUSH EQU   TBLFLG1
TBLUSER  EQU   TBLFLG1
TBLAPAR  EQU   TBLFLG1
TBLCOMP  EQU   TBLFLG1
TBLASSEM EQU   TBLFLG1
TBLCHECK EQU   TBLFLG1
TBLNOAPP EQU   TBLFLG1
@NM00008 EQU   TBLXOPTS+5
TBLNUCID EQU   TBLXOPTS+4
TBLJCLGT EQU   TBLXOPTS
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS
@RF00247 EQU   @EL00002
@RC00249 EQU   @EL00002
@RF00269 EQU   @EL00003
@RC00280 EQU   @EL00004
@RF00298 EQU   @EL00004
@RF00312 EQU   @EL00004
@RF00359 EQU   @EL00004
@RF00433 EQU   @EL00005
@RF00436 EQU   @EL00005
@RF00481 EQU   @EL00006
@RF00558 EQU   @EL00007
@RF00578 EQU   @EL00009
@ENDDATA EQU   *
         END   HMASMTM4,(C'PLS2201',0802,78334)
