         TITLE 'ISTZAF1R/A1R-VS1/M1R-VS2: 3270 S/R ATOP DEVICE SCHEDULE*
               ER       '
ISTZAF1R CSECT ,                                                   0001
@MAINENT DS    0H                                                  0001
         USING *,@15                                               0001
         B     @PROLOG                                             0001
         DC    AL1(16)                                             0001
         DC    C'ISTZAF1R  78.061'                                 0001
         DROP  @15
@PROLOG  DS    0H                                                  0002
*                                                                  0623
         BALR  PTRG12,0                ESTABLISH MODULE BASE
@PTRG12  EQU   *                       MODULE BASE ADDRESS
         USING @PTRG12,PTRG12,PTRG11   MODULE BASE ADDRESS
         LA    PTRG11,2048(,PTRG12)    INCREMENT BASE ADDRESS
         LA    PTRG11,2048(,PTRG11)    INCREMENT BASE ADDRESS
*/* TPZENTER  AC(AC1R)SAVES(ZCRSAVNO)                                */
*                                                                  0624
*   DO;                                                            0624
*                                                                  0624
*/* ATBUILD (ISTZSAVE,ISTZCRR)                                       */
*/* END OF ATBUILD                                                   */
*/* ATBUILD (ISTRPH,ISTCRA)                                          */
*/* END OF ATBUILD                                                   */
*                                                                  0625
*     RFY                                                          0625
*      (GPR00P,                                                    0625
*       GPR01P,                                                    0625
*       GPR02P,                                                    0625
*       GPR03P,                                                    0625
*       GPR04P,                                                    0625
*       GPR05P,                                                    0625
*       GPR06P,                                                    0625
*       GPR07P,                                                    0625
*       GPR12P,                                                    0625
*       GPR13P,                                                    0625
*       GPR15P) RSTD;                                              0625
*     GEN SETS(GPR12P);                                            0626
*                     /* ESTABLISH BASE */
          BALR  GPR12P,0
          USING *,GPR12P
*     DO;                           /* LISATCVT                    0627
*                                      CVTBASE(PAGEABLE,(GPR02P))    */
*       GPR02P=ATCLCPTR;            /* SET UP ATCVT POINTER          */
         L     GPR02P,ATCLCPTR                                     0628
*     END;                          /* LISATCVT                      */
*     GPR03P=GPR01P->RPHCRR;        /* ADDRESS CRA                   */
         L     GPR03P,RPHCRR(,GPR01P)                              0630
*     GPR04P=ADDR(GPR03P->CRAPROCR);/* ADDRESS ZCRR                  */
         LA    GPR04P,CRAPROCR(,GPR03P)                            0631
*     GPR06P=GPR04P;                /* INITIALIZE ZCR POINTER        */
         LR    GPR06P,GPR04P                                       0632
*     GPR05P=LENGTH(ISTZCRR);       /* SETUP ZCRR LENGTH             */
         LA    GPR05P,536                                          0633
*     GPR07P=0;                     /* ZERO REG 7                    */
         SLR   GPR07P,GPR07P                                       0634
*     MVCL(GPR04P,GPR06P);          /* CLEAR ZCRR                    */
         MVCL  GPR04P,GPR06P                                       0635
*     GPR04P=ADDR(GPR03P->CRAPROCR);/* ADDRESS ZCRR                  */
         LA    GPR04P,CRAPROCR(,GPR03P)                            0636
*     GPR04P->ZCRFRRA=GPR03P->CRAFRR;/* SAVE CURRENT FRR POINTER     */
         L     @14,CRAFRR(,GPR03P)                                 0637
         ST    @14,ZCRFRRA(,GPR04P)                                0637
*     GPR03P->CRAFRR=0;             /* CLEAR FRR POINTER             */
         SLR   @14,@14                                             0638
         ST    @14,CRAFRR(,GPR03P)                                 0638
*     GPR04P->ZCRCHAIN=GPR03P->CRACRR;/* SAVE CURRENT CRR            */
         L     @09,CRACRR(,GPR03P)                                 0639
         ST    @09,ZCRCHAIN(,GPR04P)                               0639
*     GPR03P->CRACRR=GPR04P;        /* SET ZCRR AS CURRENT CRR       */
         ST    GPR04P,CRACRR(,GPR03P)                              0640
*     GPR04P->ZCRID=ZCTYPE;         /* INDICATE CRR AS ZCRR          */
         MVI   ZCRID(GPR04P),X'00'                                 0641
*     GPR04P->ZCRLEN=ZCLNG;         /* SET ZCRR LENGTH               */
         MVC   ZCRLEN(2,GPR04P),@CH01279                           0642
*     GPR04P->ZCRTID=ZCRTAC1R;      /* SET THREAD ID                 */
         MVI   ZCRTID(GPR04P),X'11'                                0643
*     GPR04P->ZCREAC1R='1'B;        /* SET MODULE ENTERED            */
         OI    ZCREAC1R(GPR04P),B'00000100'                        0644
*     GPR04P->ZCRTNAME='AC1R';      /* SET THREAD NAME               */
         MVC   ZCRTNAME(4,GPR04P),@CC04477                         0645
*     GPR05P=ADDR(GPR04P->ZCRSAVEZ);/* ADDR 1ST BUFF                 */
         LA    GPR05P,ZCRSAVEZ(,GPR04P)                            0646
*     GPR06P=0;                     /* ADDRESS PREVIOUS BUFFER       */
         LR    GPR06P,@14                                          0647
*     DO GPR00P=ZCRSAVNO TO 1 BY-1; /* INITIALIZE SAVE AREAS         */
         LA    GPR00P,6                                            0648
@DL00648 DS    0H                                                  0649
*       GPR05P->ZSAZSVBC=GPR06P;    /* SET BACK POINTER              */
         ST    GPR06P,ZSAZSVBC(,GPR05P)                            0649
*       GPR05P->ZSAZSVFC=GPR05P+ZSAZSVSZ;/* SET FWRD PTR             */
         LA    @14,40                                              0650
         LR    @09,GPR05P                                          0650
         ALR   @09,@14                                             0650
         ST    @09,ZSAZSVFC(,GPR05P)                               0650
*       GPR06P=GPR05P;              /* PREV. BUFF = CURRENT BUFF     */
         LR    GPR06P,GPR05P                                       0651
*       GPR05P=GPR05P+ZSAZSVSZ;     /* POINT TO NEXT BUFF            */
         ALR   GPR05P,@14                                          0652
*     END;                          /* END SAVE AREA INITIALIZING    */
         BCTR  GPR00P,0                                            0653
         LTR   GPR00P,GPR00P                                       0653
         BP    @DL00648                                            0653
*     GPR06P->ZSAZSVFC=0;           /* SET LAST FWRD POINTER         */
         SLR   @14,@14                                             0654
         ST    @14,ZSAZSVFC(,GPR06P)                               0654
*     GPR13P=ADDR(GPR04P->ZCRSAVEZ);/* ADDRESS SAVE AREA CHAIN       */
         LA    GPR13P,ZCRSAVEZ(,GPR04P)                            0655
*     RFY                                                          0656
*      (GPR00P,                                                    0656
*       GPR01P,                                                    0656
*       GPR02P,                                                    0656
*       GPR03P,                                                    0656
*       GPR04P,                                                    0656
*       GPR05P,                                                    0656
*       GPR06P,                                                    0656
*       GPR07P,                                                    0656
*       GPR12P,                                                    0656
*       GPR13P,                                                    0656
*       GPR15P) UNRSTD;                                            0656
*   END;                            /* END TPZENTER GENERATION       */
*   PTRZCR=CRACRR;                  /* ADDRESS ZCR                   */
         L     @14,RPHCRR(,PTRRPH)                                 0658
         L     PTRZCR,CRACRR(,@14)                                 0658
*   PTRFMC=RPHMAJCB;                /* ADDRESS FMCB                  */
         L     PTRFMC,RPHMAJCB-1(,PTRRPH)                          0659
         LA    PTRFMC,0(,PTRFMC)                                   0659
*/*** START -TPLOCK (FMCLOCK)TYPE(XCLSIVE)- **                       */
*                                                                  0660
*   DO;                                                            0660
*     RFY                                                          0661
*      (GPR00P,                                                    0661
*       GPR01P,                                                    0661
*       GPR02P,                                                    0661
*       GPR03P,                                                    0661
*       GPR04P,                                                    0661
*       GPR15P) RSTD;                                              0661
*     GENERATE REFS(GPR00P,GPR01P,GPR15P,RPHWORK) SETS(RPHWORK);   0662
         STM GPR00P,GPR14P,RPHWORK(GPR01P)
*     GPR02P=ADDR(FMCLOCK);         /* SET PARAM - LOCKWORD PTR      */
         LA    GPR02P,FMCLOCK(,PTRFMC)                             0663
*     GPR04P=GPR01P->RPHCRR;        /* SET PARAM - ISTCRA PTR        */
         L     GPR04P,RPHCRR(,GPR01P)                              0664
*     GPR00P=CRALMS04;              /* SET PARAM - LOCK LEVEL FLAG   */
         LA    GPR00P,8                                            0665
*     GPR03P=ADDR(GPR04P->CRAL4PTR);/* SET PARAM - LOCK LEVEL PTR    */
         LA    GPR03P,CRAL4PTR(,GPR04P)                            0666
*     GPR15P=ATCLCPTR->ATCAP36;     /* ADDRESS OF LOCK ROUTINE       */
         L     @14,ATCLCPTR                                        0667
         L     GPR15P,ATCAP36(,@14)                                0667
*     DCL                                                          0668
*       FMZL0027 BASED(GPR15P) LABEL VALUERANGE(*);                0668
*     CALL FMZL0027;                                               0669
         BALR  @14,@15                                             0669
*     GENERATE REFS(GPR00P,GPR01P,GPR14P,RPHWORK) SETS(GPR00P,GPR01P,
*         GPR02P,GPR03P,GPR04P,GPR05P,GPR06P,GPR07P,GPR08P,GPR09P, 0670
*         GPR10P,GPR11P,GPR12P,GPR13P,GPR14P,GPR15P);              0670
         LM GPR00P,GPR15P,RPHWORK(GPR01P)
*     RFY                                                          0671
*      (GPR00P,                                                    0671
*       GPR01P,                                                    0671
*       GPR02P,                                                    0671
*       GPR03P,                                                    0671
*       GPR04P,                                                    0671
*       GPR15P) UNRSTD;                                            0671
*   END;                                                           0672
*                                                                  0672
*/*** END -TPLOCK (FMCLOCK)TYPE(XCLSIVE)- **                         */
*                                                                  0673
*                                   /* GET FMCB LOCK                 */
*                                                                  0673
*   /*****************************************************************/
*   /*                                                               */
*   /* SEGMENT(SEG000A)REQUEST                                       */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0673
*   DO;                                                            0673
*     GOTO SEG000A;                                                0674
         B     SEG000A                                             0674
*SEG000A#:                                                         0675
*   END;                            /* INITIALIZATION SEGMENT        */
SEG000A# DS    0H                                                  0676
*/*** START -TPLOCK (DNCBLOCK)TYPE(XCLSIVE)- **                      */
*                                                                  0676
*   DO;                                                            0676
*     RFY                                                          0677
*      (GPR00P,                                                    0677
*       GPR01P,                                                    0677
*       GPR02P,                                                    0677
*       GPR03P,                                                    0677
*       GPR04P,                                                    0677
*       GPR15P) RSTD;                                              0677
*     GENERATE REFS(GPR00P,GPR01P,GPR15P,RPHWORK) SETS(RPHWORK);   0678
         STM GPR00P,GPR14P,RPHWORK(GPR01P)
*     GPR02P=ADDR(DNCLOCK);         /* SET PARAM - LOCKWORD PTR      */
         LA    GPR02P,DNCLOCK(,PTRDNC)                             0679
*     GPR04P=GPR01P->RPHCRR;        /* SET PARAM - ISTCRA PTR        */
         L     GPR04P,RPHCRR(,GPR01P)                              0680
*     GPR00P=CRALMS05;              /* SET PARAM - LOCK LEVEL FLAG   */
         LA    GPR00P,16                                           0681
*     GPR03P=ADDR(GPR04P->CRAL5PTR);/* SET PARAM - LOCK LEVEL PTR    */
         LA    GPR03P,CRAL5PTR(,GPR04P)                            0682
*     GPR15P=ATCLCPTR->ATCAP36;     /* ADDRESS OF LOCK ROUTINE       */
         L     @14,ATCLCPTR                                        0683
         L     GPR15P,ATCAP36(,@14)                                0683
*     DCL                                                          0684
*       FMZL0033 BASED(GPR15P) LABEL VALUERANGE(*);                0684
*     CALL FMZL0033;                                               0685
         BALR  @14,@15                                             0685
*     GENERATE REFS(GPR00P,GPR01P,GPR14P,RPHWORK) SETS(GPR00P,GPR01P,
*         GPR02P,GPR03P,GPR04P,GPR05P,GPR06P,GPR07P,GPR08P,GPR09P, 0686
*         GPR10P,GPR11P,GPR12P,GPR13P,GPR14P,GPR15P);              0686
         LM GPR00P,GPR15P,RPHWORK(GPR01P)
*     RFY                                                          0687
*      (GPR00P,                                                    0687
*       GPR01P,                                                    0687
*       GPR02P,                                                    0687
*       GPR03P,                                                    0687
*       GPR04P,                                                    0687
*       GPR15P) UNRSTD;                                            0687
*   END;                                                           0688
*                                                                  0688
*/*** END -TPLOCK (DNCBLOCK)TYPE(XCLSIVE)- **                        */
*                                                                  0689
*                                   /* GET DNCB LOCK                 */
*   IF DNCZF002='1'B                /* IF DIALOG SCHED IN PROGRESS   */
*       &FMCLCPB2=0 THEN            /* & WAITQ IS EMPTY              */
         TM    DNCZF002(PTRDNC),B'00000010'                        0689
         BNO   @RF00689                                            0689
         L     @14,FMCLCPB2-1(,PTRFMC)                             0689
         LA    @14,0(,@14)                                         0689
         LTR   @14,@14                                             0689
         BNZ   @RF00689                                            0689
*     CALL SUB00CA;                 /* BIND FSB PROCESSOR            */
         BAL   @14,SUB00CA                                         0690
*   ELSE                                                           0691
*     ;                             /* NO NEED TO BIND               */
@RF00689 DS    0H                                                  0692
*   IF(RPHWEA&MASKWORD)=0 THEN                                     0692
         L     @14,RPHWEA(,PTRRPH)                                 0692
         N     @14,@CF04406                                        0692
         LTR   @14,@14                                             0692
         BZ    @RT00692                                            0692
*     ;                             /* IF ATOP WAS EMPTY             */
*   ELSE                                                           0694
*     DO;                           /* IF ATOP NOT EMPTY             */
*/* TPFEL (,FMCPAB5) RETPTR(PTRLCP)                                  */
*                                                                  0695
*       DO;                         /* BEGIN TPFEL CODE GENERATION   */
*         DCL                                                      0696
*           FMZCA038 BIT(32) CONSTANT('80000000'X);                0696
*         DCL                                                      0697
*           FMZCB038 BIT(32) CONSTANT('7FFFFFFF'X);                0697
*         RFY                                                      0698
*          (GPR00P,                                                0698
*           GPR01P,                                                0698
*           GPR14P,                                                0698
*           GPR15P) RSTD;                                          0698
*         RFY                                                      0699
*           ISTWKE;                                                0699
*         GPR15P=ADDR(FMCPAB5);     /* ADDRESS QUEUE POINTER         */
         LA    GPR15P,FMCPAB5(,PTRFMC)                             0700
*         GPR14P=GPR15P->PABWEQA×FMZCA038;                         0701
         L     @09,@CF01681                                        0701
         L     GPR14P,PABWEQA(,GPR15P)                             0701
         OR    GPR14P,@09                                          0701
*         IF GPR14P=FMZCA038 THEN                                  0702
         CLR   GPR14P,@09                                          0702
         BE    @RT00702                                            0702
*           ;                                                      0703
*         ELSE                                                     0704
*           DO;                                                    0704
*             GPR00P=FMZCA038;      /* INITIALIZE QUIT FLAG          */
         L     GPR00P,@CF01681                                     0705
*             DO WHILE(GPR00P^=GPR14P->WKECHAIN);                  0706
         B     @DE00706                                            0706
@DL00706 DS    0H                                                  0707
*               GPR14P=GPR14P->WKECHAIN;/* SEARCH FOR END OF CHAIN   */
         L     GPR14P,WKECHAIN(,GPR14P)                            0707
*             END;                                                 0708
@DE00706 C     GPR00P,WKECHAIN(,GPR14P)                            0708
         BNE   @DL00706                                            0708
*           END;                                                   0709
*         GPR14P=GPR14P&FMZCB038;                                  0710
@RT00702 N     GPR14P,@CF02493                                     0710
*         PTRLCP=GPR14P;                                           0711
         LR    PTRLCP,GPR14P                                       0711
*         RFY                                                      0712
*          (GPR00P,                                                0712
*           GPR01P,                                                0712
*           GPR14P,                                                0712
*           GPR15P) UNRSTD;                                        0712
*       END;                        /* END TPFEL GENERATION FIND   0713
*                                      OLDEST ATOP ELEMENT           */
*       IF PTRLCP->FSBTYPE^=FSTYPE THEN/* IF ELEMENT WAS A LCPB      */
         CLI   FSBTYPE(PTRLCP),X'02'                               0714
         BE    @RF00714                                            0714
*/********************************************************************/
*/*                                                                  */
*/*            DETERMINE WHICH LCPB PROCESSOR IS TO BE ENTERED       */
*/*                                                                  */
*/********************************************************************/
*                                                                  0715
*         IF LCCWOP=LNFY THEN       /* IF NOTIFY LCCW                */
*                                                                  0715
         L     @14,LCPNXLCW(,PTRLCP)                               0715
         CLI   LCCWOP(@14),X'F5'                                   0715
         BNE   @RF00715                                            0715
*           /*********************************************************/
*           /*                                                       */
*           /* SEGMENT(SEG00BC)REQUEST                               */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0716
*           DO;                                                    0716
*             GOTO SEG00BC;                                        0717
         B     SEG00BC                                             0717
*SEG00BC#:                                                         0718
*           END;                    /* HANDLE NOTIFY LCCW            */
*         ELSE                      /* NOT NOTIFY LCCW               */
*           IF LCCWOP=LCLEAR        /* IF LCCW=CLEAR                 */
*               ×LCCWOP=LCLRNFY     /* × LCCW=CLEAR NOTIFY           */
*               ×LCCWOP=LCRUD       /* × LCCW=CLEAR UNBIND           */
*               ×LCCWOP=LCRUDNFY THEN/* × LCCW=CLEAR UNBIND NOTIFY   */
*                                                                  0719
         B     @RC00715                                            0719
@RF00715 L     @14,LCPNXLCW(,PTRLCP)                               0719
         CLI   LCCWOP(@14),X'F2'                                   0719
         BE    @RT00719                                            0719
         CLI   LCCWOP(@14),X'F8'                                   0719
         BE    @RT00719                                            0719
         CLI   LCCWOP(@14),X'F3'                                   0719
         BE    @RT00719                                            0719
         CLI   LCCWOP(@14),X'F4'                                   0719
         BNE   @RF00719                                            0719
@RT00719 DS    0H                                                  0720
*             /*******************************************************/
*             /*                                                     */
*             /* SEGMENT(SEG00BE)REQUEST                             */
*             /*                                                     */
*             /*******************************************************/
*                                                                  0720
*             DO;                                                  0720
*               GOTO SEG00BE;                                      0721
         B     SEG00BE                                             0721
*SEG00BE#:                                                         0722
*             END;                  /* HANDLE CLEAR REQUESTS         */
*           ELSE                                                   0723
*             DO;                   /* NOT NOTIFY OR CLEAR           */
         B     @RC00719                                            0723
@RF00719 DS    0H                                                  0724
*/********************************************************************/
*/*                                                                  */
*/*            PROCESS SEND LCCW                                     */
*/*                                                                  */
*/********************************************************************/
*                                                                  0724
*               RFY                                                0724
*                 PTRG14 RSTD;      /* WORKING REGISTER              */
*               PTRG15=LCPNXLCW;    /* ADDRESS FIRST LCCW            */
         L     PTRG15,LCPNXLCW(,PTRLCP)                            0725
*               PTRG14=LENGTH(ISTRH);/* LENGTH TO SKIP               */
         LA    PTRG14,3                                            0726
*               ZCRTSW2='1'B;       /* INITIALIZE LOOPING SWITCH     */
         OI    ZCRTSW2(PTRZCR),B'01000000'                         0727
*               DO WHILE(ZCRTSW2='1'B);/* LOOP CONTROL               */
         B     @DE00728                                            0728
@DL00728 DS    0H                                                  0729
*                 IF PTRG15->LCCWCNT>PTRG14 THEN/* IF LCCW IS THE ONE
*                                      WITH THE SRU                  */
         LH    @09,LCCWCNT(,PTRG15)                                0729
         N     @09,@CF04690                                        0729
         CR    PTRG14,@09                                          0729
         BNL   @RF00729                                            0729
*                   ZCRTSW2='0'B;   /* END THE LOOP                  */
         NI    ZCRTSW2(PTRZCR),B'10111111'                         0730
*                 ELSE                                             0731
*                   DO;             /* MORE DATA TO SKIP OVER        */
         B     @RC00729                                            0731
@RF00729 DS    0H                                                  0732
*                     PTRG14=PTRG14-PTRG15->LCCWCNT;/* DECREMENT SKIP
*                                      COUNT BY NUMBER OF RH BYTES IN
*                                      LCCW                          */
         LH    @09,LCCWCNT(,PTRG15)                                0732
         N     @09,@CF04690                                        0732
         SLR   PTRG14,@09                                          0732
*                     PTRG15=PTRG15+LENGTH(ISTLCCW);/* ADDRESS NEXT
*                                      LCCW                          */
         AL    PTRG15,@CF00071                                     0733
*                   END;            /* END MORE DATA TO SKIP OVER    */
*               END;                /* LCCW WITH SRU LOCATED         */
@RC00729 DS    0H                                                  0735
@DE00728 TM    ZCRTSW2(PTRZCR),B'01000000'                         0735
         BO    @DL00728                                            0735
*               IF PTRG15->LCCWIDAT='1'B THEN/* IF IMMEDIATE DATA IN
*                                      LCCW                          */
         TM    LCCWIDAT(PTRG15),B'00001000'                        0736
         BNO   @RF00736                                            0736
*                 PTRG15=ADDR(PTRG15->LCCWDATA);/* ADDRESS DATA IN 0737
*                                      LCCW                          */
         LA    @09,LCCWDATA(,PTRG15)                               0737
         LR    PTRG15,@09                                          0737
*               ELSE                /* NOT IMMEDIATE DATA            */
*                 PTRG15=PTRG15->LCCWDATA;/* ADDRESS DATA FROM LCCW  */
         B     @RC00736                                            0738
@RF00736 L     PTRG15,LCCWDATA(,PTRG15)                            0738
*               PTRG15=PTRG15+PTRG14;/* ADDRESS SRU CODE BYTE        */
@RC00736 ALR   PTRG15,PTRG14                                       0739
*               RFY                                                0740
*                 PTRG14 UNRSTD;    /* RELEASE WORK REGISTER         */
*               ZCROPCDE=PTRG15->SRUQSREQ;/* GET REQUEST CODE        */
         MVC   ZCROPCDE(1,PTRZCR),SRUQSREQ(PTRG15)                 0741
*               IF ZCROPCDE=SRBIND THEN/* IF BIND REQUEST            */
*                                                                  0742
         CLI   ZCROPCDE(PTRZCR),X'31'                              0742
         BNE   @RF00742                                            0742
*                 /***************************************************/
*                 /*                                                 */
*                 /* SEGMENT(SEG00BA)REQUEST                         */
*                 /*                                                 */
*                 /***************************************************/
*                                                                  0743
*                 DO;                                              0743
*                   GOTO SEG00BA;                                  0744
         B     SEG00BA                                             0744
*SEG00BA#:                                                         0745
*                 END;              /* PROCESS BIND REQUEST          */
*               ELSE                /* NOT BIND REQUEST              */
*                                                                  0746
*                 /***************************************************/
*                 /*                                                 */
*                 /* SEGMENT(SEG00BB)REQUEST                         */
*                 /*                                                 */
*                 /***************************************************/
*                                                                  0746
*                 DO;                                              0746
         B     @RC00742                                            0746
@RF00742 DS    0H                                                  0747
*                   GOTO SEG00BB;                                  0747
         B     SEG00BB                                             0747
*SEG00BB#:                                                         0748
*                 END;              /* PROCESS INVALID REQUEST       */
*             END;                  /* END NOT NOTIFY OR CLEAR       */
*       ELSE                                                       0750
*         DO;                       /* NOT LCPB - MUST BE FSB        */
         B     @RC00714                                            0750
@RF00714 DS    0H                                                  0751
*/********************************************************************/
*/*                                                                  */
*/*            PROCESS FSB (CLEAR COMPLETION)                        */
*/*                                                                  */
*/********************************************************************/
*                                                                  0751
*           /*********************************************************/
*           /*                                                       */
*           /* SEGMENT(SEGDEQF)REQUEST                               */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0751
*           DO;                                                    0751
*             GOTO SEGDEQF;                                        0752
         B     SEGDEQF                                             0752
*SEGDEQF#:                                                         0753
*           END;                    /* DEQUE ATOP FSB        @XM01548*/
SEGDEQF# DS    0H                                                  0754
*           SPTFSB=PTRLCP;          /* ADDRESS FSB                   */
         ST    PTRLCP,SPTFSB(,PTRZCR)                              0754
*           CALL SUB00CE;           /* PROCESS CLEAR FSB             */
         BAL   @14,SUB00CE                                         0755
*           IF FMCAWATQ=0           /* NO WAIT QUE           @ZA18903*/
*             THEN                                                 0756
         L     @14,FMCAWATQ-1(,PTRFMC)                             0756
         LA    @14,0(,@14)                                         0756
         LTR   @14,@14                                             0756
         BNZ   @RF00756                                            0756
*             FMCCIPI='0'B;         /* NO CLEAR IN PROGRESS  @ZA18903*/
         NI    FMCCIPI(PTRFMC),B'10111111'                         0757
*           ELSE                                                   0758
*             ;                     /*                       @ZA18903*/
@RF00756 DS    0H                                                  0759
*         END;                      /* END FSB PROCESSING            */
*     END;                          /* END ATOP NOT EMPTY            */
@RC00714 DS    0H                                                  0761
*/********************************************************************/
*/*            EXIT LINKAGE CODE                                     */
*/********************************************************************/
*/*** START -TPUNLOCK (DNCBLOCK)- **                                 */
*                                                                  0761
*   DO;                                                            0761
*                                                                  0761
@RT00692 DS    0H                                                  0762
*/* ATBUILD (ISTRPH,ISTLOK,ISTCRA)                                   */
*/* END OF ATBUILD                                                   */
*                                                                  0762
*     RFY                                                          0762
*      (GPR00P,                                                    0762
*       GPR01P,                                                    0762
*       GPR02P,                                                    0762
*       GPR03P,                                                    0762
*       GPR04P,                                                    0762
*       GPR15P) RSTD;                                              0762
*     GENERATE REFS(GPR00P,GPR01P,GPR15P,RPHWORK) SETS(RPHWORK);   0763
         STM GPR00P,GPR15P,RPHWORK(GPR01P)
*     GPR02P=ADDR(DNCLOCK);         /* SET PARAM - LOCKWORD PTR      */
         LA    GPR02P,DNCLOCK(,PTRDNC)                             0764
*     GPR04P=GPR01P->RPHCRR;        /* SET PARAM - ISTCRA PTR        */
         L     GPR04P,RPHCRR(,GPR01P)                              0765
*     GPR00P=CRALMS05;              /* SET PARAM - LOCK LEVEL FLAG   */
         LA    GPR00P,16                                           0766
*     GPR03P=ADDR(GPR04P->CRAL5PTR);/* SET PARAM - LOCK LEVEL PTR    */
         LA    GPR03P,CRAL5PTR(,GPR04P)                            0767
*     DO;                           /* LISATCVT                    0768
*                                      CVTBASE(PAGEABLE,(GPR15P))    */
*       GPR15P=ATCLCPTR;            /* SET UP ATCVT POINTER          */
         L     GPR15P,ATCLCPTR                                     0769
*     END;                          /* LISATCVT                      */
*     GPR15P=GPR15P->ATCAP33;                                      0771
         L     GPR15P,ATCAP33(,GPR15P)                             0771
*     DCL                                                          0772
*       FMZL0047 BASED(GPR15P) LABEL VALUERANGE(*);                0772
*     CALL FMZL0047;                                               0773
         BALR  @14,@15                                             0773
*     GENERATE REFS(GPR00P,GPR01P,GPR15P,RPHWORK) SETS(GPR00P,GPR01P,
*         GPR02P,GPR03P,GPR04P,GPR05P,GPR06P,GPR07P,GPR08P,GPR09P, 0774
*         GPR10P,GPR11P,GPR12P,GPR13P,GPR14P,GPR15P);              0774
         LM GPR00P,GPR15P,RPHWORK(GPR01P)
*     RFY                                                          0775
*      (GPR00P,                                                    0775
*       GPR01P,                                                    0775
*       GPR02P,                                                    0775
*       GPR03P,                                                    0775
*       GPR04P,                                                    0775
*       GPR15P) UNRSTD;                                            0775
*   END;                                                           0776
*                                                                  0776
*/*** END -TPUNLOCK (DNCBLOCK)- **                                   */
*                                                                  0777
*                                   /* RELEASE DNCB LOCK             */
*/*** START -TPUNLOCK (FMCLOCK)- **                                  */
*                                                                  0777
*   DO;                                                            0777
*                                                                  0777
*/* ATBUILD (ISTRPH,ISTLOK,ISTCRA)                                   */
*/* END OF ATBUILD                                                   */
*                                                                  0778
*     RFY                                                          0778
*      (GPR00P,                                                    0778
*       GPR01P,                                                    0778
*       GPR02P,                                                    0778
*       GPR03P,                                                    0778
*       GPR04P,                                                    0778
*       GPR15P) RSTD;                                              0778
*     GENERATE REFS(GPR00P,GPR01P,GPR15P,RPHWORK) SETS(RPHWORK);   0779
         STM GPR00P,GPR15P,RPHWORK(GPR01P)
*     GPR02P=ADDR(FMCLOCK);         /* SET PARAM - LOCKWORD PTR      */
         LA    GPR02P,FMCLOCK(,PTRFMC)                             0780
*     GPR04P=GPR01P->RPHCRR;        /* SET PARAM - ISTCRA PTR        */
         L     GPR04P,RPHCRR(,GPR01P)                              0781
*     GPR00P=CRALMS04;              /* SET PARAM - LOCK LEVEL FLAG   */
         LA    GPR00P,8                                            0782
*     GPR03P=ADDR(GPR04P->CRAL4PTR);/* SET PARAM - LOCK LEVEL PTR    */
         LA    GPR03P,CRAL4PTR(,GPR04P)                            0783
*     DO;                           /* LISATCVT                    0784
*                                      CVTBASE(PAGEABLE,(GPR15P))    */
*       GPR15P=ATCLCPTR;            /* SET UP ATCVT POINTER          */
         L     GPR15P,ATCLCPTR                                     0785
*     END;                          /* LISATCVT                      */
*     GPR15P=GPR15P->ATCAP33;                                      0787
         L     GPR15P,ATCAP33(,GPR15P)                             0787
*     DCL                                                          0788
*       FMZL0057 BASED(GPR15P) LABEL VALUERANGE(*);                0788
*     CALL FMZL0057;                                               0789
         BALR  @14,@15                                             0789
*     GENERATE REFS(GPR00P,GPR01P,GPR15P,RPHWORK) SETS(GPR00P,GPR01P,
*         GPR02P,GPR03P,GPR04P,GPR05P,GPR06P,GPR07P,GPR08P,GPR09P, 0790
*         GPR10P,GPR11P,GPR12P,GPR13P,GPR14P,GPR15P);              0790
         LM GPR00P,GPR15P,RPHWORK(GPR01P)
*     RFY                                                          0791
*      (GPR00P,                                                    0791
*       GPR01P,                                                    0791
*       GPR02P,                                                    0791
*       GPR03P,                                                    0791
*       GPR04P,                                                    0791
*       GPR15P) UNRSTD;                                            0791
*   END;                                                           0792
*                                                                  0792
*/*** END -TPUNLOCK (FMCLOCK)- **                                    */
*                                                                  0793
*                                   /* RELEASE FMCB LOCK             */
*   IF ZCREXTYP='1'B THEN           /* IF SCHED SWITCH ON            */
         TM    ZCREXTYP(PTRZCR),B'01000000'                        0793
         BNO   @RF00793                                            0793
*/* TPEXIT  NORM                                                     */
*                                                                  0794
*     DO;                                                          0794
*       RESPECIFY                                                  0795
*         GPR15P RSTD;                                             0795
*                                                                  0795
*/* ATBUILD (ISTPAB,ISTDYPAB,ISTATCVT)                               */
*/* END OF ATBUILD                                                   */
*                                                                  0796
*       DO;                         /* LISATCVT                    0796
*                                      CVTBASE(PAGEABLE,(GPR15P))    */
*         GPR15P=ATCLCPTR;          /* SET UP ATCVT POINTER          */
         L     GPR15P,ATCLCPTR                                     0797
*       END;                        /* LISATCVT                      */
*       RESPECIFY                                                  0799
*         GPR00F RSTD;                                             0799
*       GPR00F=4;                   /* SET PARAMETER REGISTER TO 4   */
         LA    GPR00F,4                                            0800
*       GPR15P=GPR15P->ATCAP31;                                    0801
         L     GPR15P,ATCAP31(,GPR15P)                             0801
*       DCL                                                        0802
*         FMZL0067 BASED(GPR15P) LABEL VALUERANGE(*);              0802
*       CALL FMZL0067;                                             0803
         BALR  @14,@15                                             0803
*       RESPECIFY                                                  0804
*        (GPR00F,                                                  0804
*         GPR15P) UNRSTD;                                          0804
*     END;                          /* **** END OF TPEXIT EXIT WITH
*                                      SCHEDULING                    */
*   ELSE                            /* IF SCHED SWITCH OFF           */
*/* TPEXIT  NONE                                                     */
*                                                                  0806
*     DO;                                                          0806
         B     @RC00793                                            0806
@RF00793 DS    0H                                                  0807
*       RESPECIFY                                                  0807
*         GPR15P RSTD;                                             0807
*                                                                  0807
*/* ATBUILD (ISTPAB,ISTDYPAB,ISTATCVT)                               */
*/* END OF ATBUILD                                                   */
*                                                                  0808
*       DO;                         /* LISATCVT                    0808
*                                      CVTBASE(PAGEABLE,(GPR15P))    */
*         GPR15P=ATCLCPTR;          /* SET UP ATCVT POINTER          */
         L     GPR15P,ATCLCPTR                                     0809
*       END;                        /* LISATCVT                      */
*       RESPECIFY                                                  0811
*         GPR00F RSTD;                                             0811
*       GPR00F=0;                   /* SET PARAMETER REGISTER TO 0   */
         SLR   GPR00F,GPR00F                                       0812
*       GPR15P=GPR15P->ATCAP31;                                    0813
         L     GPR15P,ATCAP31(,GPR15P)                             0813
*       DCL                                                        0814
*         FMZL0075 BASED(GPR15P) LABEL VALUERANGE(*);              0814
*       CALL FMZL0075;                                             0815
         BALR  @14,@15                                             0815
*       RESPECIFY                                                  0816
*        (GPR00F,                                                  0816
*         GPR15P) UNRSTD;                                          0816
*     END;                          /* **** END OF TPEXIT NORMAL EXIT
*                                      PROCESSING                    */
         EJECT
*                                                                  0818
*/********************************************************************/
*/*                                                                  */
*/* SEGMENT-                                                         */
*/*      SEG000A                                                     */
*/*                                                                  */
*/* FUNCTION-                                                        */
*/*      PERFORM THE INITIALIZATION REQUIRED BY THIS MODULE.         */
*/*      FIELDS ARE ADDRESSED AND SWITCHES INITIALIZED.              */
*/*                                                                  */
*/********************************************************************/
*                                                                  0818
*   /*****************************************************************/
*   /*                                                               */
*   /* SEGMENT(SEG000A)START                                         */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0818
*   DO;                                                            0818
@RC00793 DS    0H                                                  0819
*     GOTO SEG000A@;                                               0819
         B     SEG000A@                                            0819
*SEG000A:                                                          0820
*   END;                            /* AF1R000A: SUBROUTINE          */
SEG000A  DS    0H                                                  0821
*   ZCREXTYP='1'B;                  /* INITIALIZE EXIT TO 'SCHED'    */
         OI    ZCREXTYP(PTRZCR),B'01000000'                        0821
*   PTRDNC=FMCDNCBA;                /* ADDRESS DNCB                  */
         L     @14,FMCDNCBA(,PTRFMC)                               0822
         LR    PTRDNC,@14                                          0822
*   PTRICN=FMCDNCBA;                /* ADDRESS ICNCB                 */
         LR    PTRICN,@14                                          0823
*   DO WHILE(PTRICN->NCBTYPE^=ICTYPE&PTRICN->NCBTYPE^=LDTYPE);/*   0824
*                                      ADDRESS SCHEDULABLE NODE      */
         B     @DE00824                                            0824
@DL00824 DS    0H                                                  0825
*     PTRICN=PTRICN->NCBNSNA;       /* ADDRESS NEXT NODE IN CHAIN    */
         L     PTRICN,NCBNSNA(,PTRICN)                             0825
*   END;                            /* NODE NOW ADDRESSED            */
*                                                                  0826
@DE00824 CLI   NCBTYPE(PTRICN),X'06'                               0826
         BE    @DC00824                                            0826
         CLI   NCBTYPE(PTRICN),X'07'                               0826
         BNE   @DL00824                                            0826
@DC00824 DS    0H                                                  0827
*   /*****************************************************************/
*   /*                                                               */
*   /* SEGMENT(SEG000A)FINISH                                        */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0827
*   DO;                                                            0827
*     GOTO SEG000A#;                                               0828
         B     SEG000A#                                            0828
*SEG000A@:                                                         0829
*   END;                            /* END AFIR000A                  */
SEG000A@ DS    0H                                                  0830
         EJECT
*                                                                  0830
*/********************************************************************/
*/*                                                                  */
*/* SEGMENT-                                                         */
*/*      SEG00BA                                                     */
*/*                                                                  */
*/* FUNCTION-                                                        */
*/*      PROCESS BIND REQUEST.                                       */
*/*      THE BIND FUNCTIONAL PROCESSOR DOES NOTHING IF A CLEAR       */
*/*      IS IN PROGRESS.                                             */
*/*      OTHERWISE, THE FMCB BHSET IS SET TO 0, AND THE      @X50BHFZ*/
*/*      DNCB MODE AND BHSET ARE SET TO MATCH THE FMCB MODE  @X50BHFZ*/
*/*      AND BHSET.  I/O IS DONE TO INSURE THAT THE NCP MODE @X50BHFZ*/
*/*      AND BHSET MATCH THE DNCB MODE AND BHSET.            @X50BHFZ*/
*/*                                                                  */
*/********************************************************************/
*                                                                  0830
*   /*****************************************************************/
*   /*                                                               */
*   /* SEGMENT(SEG00BA)START                                         */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0830
*   DO;                                                            0830
*     GOTO SEG00BA@;                                               0831
         B     SEG00BA@                                            0831
*SEG00BA:                                                          0832
*   END;                            /* AF1R00BA: SUBROUTINE          */
SEG00BA  DS    0H                                                  0833
*   IF FMCCIPI='1'B THEN                                           0833
         TM    FMCCIPI(PTRFMC),B'01000000'                         0833
         BO    @RT00833                                            0833
*     ;                             /* EXIT IF CLEAR IN PROGRESS     */
*   ELSE                                                           0835
*     DO;                           /* CLEAR NOT IN PROGRESS         */
*       CALL SUB000G;               /* DEQUEUE CURRENT ATOP ELEM     */
         BAL   @14,SUB000G                                         0836
*       CALL SUB000H;               /* QUEUE BIND LCPB TO FMCB     0837
*                                      ASYNCHRONOUS WAIT QUEUE       */
         BAL   @14,SUB000H                                         0837
*       PTRG15=0;                   /* INITIALIZE RETURN FLAG        */
         SLR   PTRG15,PTRG15                                       0838
*       DNCZF002='1'B;              /* INITIALIZE DNCB DIALOG      0839
*                                      SCHEDULE FLAG                 */
         OI    DNCZF002(PTRDNC),B'00000010'                        0839
*       IF PTRICN->NCBTYPE=LDTYPE THEN                             0840
         CLI   NCBTYPE(PTRICN),X'07'                               0840
         BE    @RT00840                                            0840
*         ;                         /* IF LOCAL, NO NEED TO MATCH  0841
*                                      FMCB AND DNCB MODE/BHSET      */
*       ELSE                                                       0842
*         DO;                       /* PROCESS 370X DNCB/FMCB MODE 0842
*                                      AND BHSET MATCHING            */
*           FMCBHSET=0;             /* FORCE BHSET DESELECTION     0843
*                                                            @X50BHFZ*/
         MVI   FMCBHSET(PTRFMC),X'00'                              0843
*           IF DNCMODE^=ISTPROCD(2:4) THEN                         0844
         CLC   DNCMODE(3,PTRDNC),ISTPROCD+49(PTRFMC)               0844
         BE    @RF00844                                            0844
*             DO;                   /* IF MODES DON'T MATCH          */
*               PTRG00=0;           /* INDICATE MODE PROCESSING      */
         SLR   PTRG00,PTRG00                                       0846
*               CALL SUB0BAA;       /* BUILD SET MODE PIU            */
         BAL   @14,SUB0BAA                                         0847
*             END;                  /* END MODES DON'T MATCH         */
*           ELSE                                                   0849
*             ;                     /* MODES MATCH                   */
@RF00844 DS    0H                                                  0850
*           IF DNCBHSET^=FMCBHSET THEN                             0850
         CLC   DNCBHSET(1,PTRDNC),FMCBHSET(PTRFMC)                 0850
         BE    @RF00850                                            0850
*             DO;                   /* IF BHSETS DON'T MATCH         */
*               PTRG00=1;           /* INDICATE BHSET PROCESSING     */
         LA    PTRG00,1                                            0852
*               CALL SUB0BAA;       /* BUILD SET BHSET ASSOC. PIU    */
         BAL   @14,SUB0BAA                                         0853
*             END;                  /* END BHSETS DON'T MATCH        */
*           ELSE                                                   0855
*             ;                     /* BHSETS MATCH                  */
@RF00850 DS    0H                                                  0856
*         END;                      /* END MODE/BHSET MATCHING       */
*       IF PTRG15=0 THEN            /* IF NO I/O REQUIRED            */
@RT00840 LTR   PTRG15,PTRG15                                       0857
         BNZ   @RF00857                                            0857
*         CALL SUB00CA;             /* BIND FSB PROCESSOR            */
         BAL   @14,SUB00CA                                         0858
*       ELSE                                                       0859
*         DO;                       /* IF BIND I/O REQUIRED          */
*                                                                  0859
         B     @RC00857                                            0859
@RF00857 DS    0H                                                  0860
*           /*********************************************************/
*           /*                                                       */
*           /* SEGMENT(SEG0BAB)REQUEST                               */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0860
*           DO;                                                    0860
*             GOTO SEG0BAB;                                        0861
         B     SEG0BAB                                             0861
*SEG0BAB#:                                                         0862
*           END;                    /* START BIND I/O                */
SEG0BAB# DS    0H                                                  0863
*           ZCREXTYP='0'B;          /* INDICATE NO SCHEDULE ON XIT   */
         NI    ZCREXTYP(PTRZCR),B'10111111'                        0863
*         END;                      /* END BIND I/O                  */
*     END;                          /* END CLEAR NOT IN PROGRESS     */
*                                                                  0865
@RC00857 DS    0H                                                  0866
*   /*****************************************************************/
*   /*                                                               */
*   /* SEGMENT(SEG00BA)FINISH                                        */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0866
*   DO;                                                            0866
@RT00833 DS    0H                                                  0867
*     GOTO SEG00BA#;                                               0867
         B     SEG00BA#                                            0867
*SEG00BA@:                                                         0868
*   END;                            /* END OF SUBROUTINE             */
SEG00BA@ DS    0H                                                  0869
         EJECT
*                                                                  0869
*/********************************************************************/
*/*                                                                  */
*/* SEGMENT-                                                         */
*/*      SEG0BAB                                                     */
*/*                                                                  */
*/* FUNCTION-                                                        */
*/*      INITIATE BIND I/O REQUESTS.                                 */
*/*      THIS ROUTINE MOVES REQUESTS FROM THE SCHED QUEUE TO THE     */
*/*      WAIT QUEUE AND CALLS THE START I/O ROUTINE FOR EACH ELEMENT */
*/*      MOVED.  THIS ROUTINE IS USED TO ISSUE THE I/O FOR           */
*/*      MATCHING MODES AND BHSETS.                                  */
*/*                                                                  */
*/********************************************************************/
*                                                                  0869
*   /*****************************************************************/
*   /*                                                               */
*   /* SEGMENT(SEG0BAB)START                                         */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0869
*   DO;                                                            0869
*     GOTO SEG0BAB@;                                               0870
         B     SEG0BAB@                                            0870
*SEG0BAB:                                                          0871
*   END;                            /* AF1R0BAB: SUBROUTINE          */
SEG0BAB  DS    0H                                                  0872
*   DO WHILE((FMCSHEDQ&MASKWORD)^=0);/* DO WHILE SCHEDQ NOT EMPTY    */
         B     @DE00872                                            0872
@DL00872 DS    0H                                                  0873
*/* TPFEL (,FMCSHEDQ) RETPTR(PTRLSC)                                 */
*                                                                  0873
*     DO;                           /* BEGIN TPFEL CODE GENERATION   */
*       RFY                                                        0874
*        (GPR00P,                                                  0874
*         GPR01P,                                                  0874
*         GPR14P,                                                  0874
*         GPR15P) RSTD;                                            0874
*       GPR15P=ADDR(FMCSHEDQ);      /* ADDRESS QUEUE POINTER         */
         LA    GPR15P,FMCSHEDQ(,PTRFMC)                            0875
*       GPR14P=GPR15P->PABWEQA×FMZCA038;                           0876
         L     @09,@CF01681                                        0876
         L     GPR14P,PABWEQA(,GPR15P)                             0876
         OR    GPR14P,@09                                          0876
*       IF GPR14P=FMZCA038 THEN                                    0877
         CLR   GPR14P,@09                                          0877
         BE    @RT00877                                            0877
*         ;                                                        0878
*       ELSE                                                       0879
*         DO;                                                      0879
*           GPR00P=FMZCA038;        /* INITIALIZE QUIT FLAG          */
         L     GPR00P,@CF01681                                     0880
*           DO WHILE(GPR00P^=GPR14P->WKECHAIN);                    0881
         B     @DE00881                                            0881
@DL00881 DS    0H                                                  0882
*             GPR14P=GPR14P->WKECHAIN;/* SEARCH FOR END OF CHAIN     */
         L     GPR14P,WKECHAIN(,GPR14P)                            0882
*           END;                                                   0883
@DE00881 C     GPR00P,WKECHAIN(,GPR14P)                            0883
         BNE   @DL00881                                            0883
*         END;                                                     0884
*       GPR14P=GPR14P&FMZCB038;                                    0885
@RT00877 N     GPR14P,@CF02493                                     0885
*       PTRLSC=GPR14P;                                             0886
         LR    PTRLSC,GPR14P                                       0886
*       RFY                                                        0887
*        (GPR00P,                                                  0887
*         GPR01P,                                                  0887
*         GPR14P,                                                  0887
*         GPR15P) UNRSTD;                                          0887
*     END;                          /* END TPFEL GENERATION LOCATE 0888
*                                      ELDEST SCHEDQ ELEM.           */
*     RFY                                                          0889
*      (PTRG08,                                                    0889
*       PTRG09) RSTD;               /* QUEUE TRANSFER PARAMETERS     */
*     PTRG08=ADDR(FMCSHEDQ);        /* ADDRESS SCHEDULE QUEUE        */
         LA    PTRG08,FMCSHEDQ(,PTRFMC)                            0890
*     PTRG09=ADDR(FMCLCPBQ);        /* ADDRESS WAIT QUEUE            */
         LA    PTRG09,FMCLCPBQ(,PTRFMC)                            0891
*     CALL ATCZPSVT->ZPSZDFH0;      /* TRANSFER SCHEDQ ELEMENT TO  0892
*                                      WAIT QUEUE                    */
         L     @14,ATCZPSVT(,PTRATC)                               0892
         L     @15,ZPSZDFH0(,@14)                                  0892
         BALR  @14,@15                                             0892
*     RFY                                                          0893
*      (PTRG08,                                                    0893
*       PTRG09) UNRSTD;             /* END CALLING OF QUEUE XFER     */
*     FMCZX003=FMCZX003-1;          /* DECREMENT SCHED QUEUE COUNT   */
         SLR   @14,@14                                             0894
         IC    @14,FMCZX003(,PTRFMC)                               0894
         BCTR  @14,0                                               0894
         STC   @14,FMCZX003(,PTRFMC)                               0894
*     PTRZOB=LSCFDBA;               /* ADDRESS I/O BUFFER            */
         L     PTRZOB,LSCFDBA(,PTRLSC)                             0895
*     LSCFDBA=0;                    /* CLEAR BUFFER POINTER          */
         SLR   @14,@14                                             0896
         ST    @14,LSCFDBA(,PTRLSC)                                0896
*     CALL ATCZFSVT->ZFSZEFBB;      /* CALL SHIPOUT                  */
         L     @14,ATCZFSVT(,PTRATC)                               0897
         L     @15,ZFSZEFBB(,@14)                                  0897
         BALR  @14,@15                                             0897
*   END;                            /* END OF I/O SCHEDULING         */
*                                                                  0898
@DE00872 L     @14,FMCSHEDQ(,PTRFMC)                               0898
         N     @14,@CF04406                                        0898
         LTR   @14,@14                                             0898
         BNZ   @DL00872                                            0898
*   /*****************************************************************/
*   /*                                                               */
*   /* SEGMENT(SEG0BAB)FINISH                                        */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0899
*   DO;                                                            0899
*     GOTO SEG0BAB#;                                               0900
         B     SEG0BAB#                                            0900
*SEG0BAB@:                                                         0901
*   END;                            /* END OF SEGMENT                */
SEG0BAB@ DS    0H                                                  0902
         EJECT
*                                                                  0902
*/********************************************************************/
*/*                                                                  */
*/* SEGMENT-                                                         */
*/*      SEG00BB                                                     */
*/*                                                                  */
*/* FUNCTION-                                                        */
*/*      PROCESS INVALID REQUEST CODE.                               */
*/*      AN EXCEPTION RESPONSE IS RETURNED.                          */
*/*                                                                  */
*/* PARAMETERS-                                                      */
*/*      ZCROPCDE CONTAINS THE REQUEST CODE.                         */
*/*                                                                  */
*/********************************************************************/
*                                                                  0902
*   /*****************************************************************/
*   /*                                                               */
*   /* SEGMENT(SEG00BB)START                                         */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0902
*   DO;                                                            0902
*     GOTO SEG00BB@;                                               0903
         B     SEG00BB@                                            0903
*SEG00BB:                                                          0904
*   END;                            /* AF1R00BB: SUBROUTINE          */
SEG00BB  DS    0H                                                  0905
*   CALL SUB000G;                   /* DEQUEUE CURRENT ATOP ELEM     */
         BAL   @14,SUB000G                                         0905
*   CALL SUB0FNE;                   /* ALLOCATE BUFFER, ADDR FSB     */
         BAL   @14,SUB0FNE                                         0906
*   PTRG00=ZCROPCDE;                /* GET SRU CODE                  */
         SLR   PTRG00,PTRG00                                       0907
         IC    PTRG00,ZCROPCDE(,PTRZCR)                            0907
*   CALL SUB000D;                   /* BUILD A FSB                   */
         BAL   @14,SUB000D                                         0908
*   FDBDATAA->SRUSENSE=SRUFIERR;    /* SET FUNCTION INTERPRET ERR    */
         L     @14,SPTFSB(,PTRZCR)                                 0909
         LA    @09,32                                              0909
         ALR   @09,@14                                             0909
         L     @08,FDBDATAA(,@09)                                  0909
         MVC   SRUSENSE(4,@08),@CB01673                            0909
*   FDBDATAA->CARRAY(LENGTH(SRUSENSE)+1)=ZCROPCDE;/* SET COMMAND CODE*/
         MVC   CARRAY+4(1,@08),ZCROPCDE(PTRZCR)                    0910
*   RHEXCEPT='1'B;                  /* SET EXCEPTION RESPONSE        */
         LA    @08,17                                              0911
         ALR   @08,@14                                             0911
         OI    RHEXCEPT(@08),B'00010000'                           0911
*   RHSENSE='1'B;                   /* SET SENSE DATA AVAILABLE      */
         OI    RHSENSE(@08),B'00000100'                            0912
*   FDBDATCT=LENGTH(ISTRH)+LENGTH(SRUSENSE)+1;/* SET FDB DATA COUNT
*                                      TO INCLUDE RU                 */
         MVC   FDBDATCT(2,@09),@CH00071                            0913
*   FSBMJRCD=FRNORM;                /* MAJOR RETURN CODE=NORMAL      */
         MVI   FSBMJRCD(@14),X'00'                                 0914
*   FSBMNRCD=FRMOK;                 /* MINOR RETURN CODE=NORMAL      */
         MVI   FSBMNRCD(@14),X'00'                                 0915
*   CALL SUB000E;                   /* POST FSB BACK TO REQUESTOR    */
*                                                                  0916
         BAL   @14,SUB000E                                         0916
*   /*****************************************************************/
*   /*                                                               */
*   /* SEGMENT(SEG00BB)FINISH                                        */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0917
*   DO;                                                            0917
*     GOTO SEG00BB#;                                               0918
         B     SEG00BB#                                            0918
*SEG00BB@:                                                         0919
*   END;                            /* END OF SUBBROUTINE            */
SEG00BB@ DS    0H                                                  0920
         EJECT
*                                                                  0920
*/********************************************************************/
*/*                                                                  */
*/* SEGMENT-                                                         */
*/*      SEG00BC                                                     */
*/*                                                                  */
*/* FUNCTION-                                                        */
*/*      HANDLE NOTIFY LCCW.                                         */
*/*                                                                  */
*/********************************************************************/
*                                                                  0920
*   /*****************************************************************/
*   /*                                                               */
*   /* SEGMENT(SEG00BC)START                                         */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0920
*   DO;                                                            0920
*     GOTO SEG00BC@;                                               0921
         B     SEG00BC@                                            0921
*SEG00BC:                                                          0922
*   END;                            /* AF1R00BC: SUBROUTINE          */
SEG00BC  DS    0H                                                  0923
*   CALL SUB000G;                   /* DEQUEUE CURRENT ATOP ELEM     */
         BAL   @14,SUB000G                                         0923
*   CALL SUB0BCA;                   /* PERFORM NOTIFY FUNCTION       */
         BAL   @14,SUB0BCA                                         0924
*/*TPPOST  (LCPRPHA)                                                 */
*                                                                  0925
*   DO;                             /* DECLARE AND RESTRICT REGS     */
*     RESPECIFY                                                    0926
*      (GPR00F,                                                    0926
*       GPR01F,                                                    0926
*       GPR04F,                                                    0926
*       GPR05F,                                                    0926
*       GPR06F,                                                    0926
*       GPR14F,                                                    0926
*       GPR15F) RSTD;               /* 0,1,4,5,6,14, AND 15          */
*/* ATBUILD (ISTPAB,ISTDYPAB,ISTRPH)                                 */
*/* END OF ATBUILD                                                   */
*                                                                  0927
*     GEN REFS(GPR01P,GPR02F,GPR06F) SETS(RPHWORK);                0927
        STM GPR02F,GPR06F,RPHWORK(GPR01P)
*     GPR04F=LCPRPHA;               /* LOAD RPH PNTR INTO REG 4      */
         L     GPR04F,LCPRPHA(,PTRLCP)                             0928
*     RFY                                                          0929
*       GPR03F RSTD;                                               0929
*     GPR03F=0;                                                    0930
         SLR   @09,@09                                             0930
         LR    GPR03F,@09                                          0930
*     DO;                           /* MODESET SAVEKEY(GPR06F)     0931
*                                      KEYADDR(GPR03F)             0931
*                                      WORKREG(GPR05F)               */
*       RESPECIFY                                                  0932
*        (GPR02F) RESTRICTED;                                      0932
*       GPR05F=GPR02F;              /* SAVE REGISTER 2               */
         LR    GPR05F,GPR02F                                       0933
*       IPK;                        /* SAVE CURRENT PSW KEY          */
         IPK                                                       0934
*       GPR06F=GPR02F;                                             0935
         LR    GPR06F,GPR02F                                       0935
*       GPR02F=GPR05F;              /* RESTORE REGISTER 2            */
         LR    GPR02F,GPR05F                                       0936
*       SPKA(GPR03F);               /* SET PSW KEY                   */
         SPKA  0(GPR03F)                                           0937
*       RESPECIFY                                                  0938
*        (GPR02F) UNRESTRICTED;                                    0938
*     END;                          /* MODESET SAVEKEY(GPR06F)     0939
*                                      KEYADDR(GPR03F)             0939
*                                      WORKREG(GPR05F)               */
*     RFY                                                          0940
*       GPR03F UNRSTD;                                             0940
*     GPR05P=GPR04P->RPHMAJCB+GPR04P->RPHPABOF;/* LOAD REG 5 WITH  0941
*                                      ADDR OF MAJOR CONTROL BLOCK 0941
*                                      PLUS OFFSET OF PAB IN BLOCK   */
         L     GPR05P,RPHMAJCB-1(,GPR04P)                          0941
         LA    GPR05P,0(,GPR05P)                                   0941
         SLR   @08,@08                                             0941
         IC    @08,RPHPABOF(,GPR04P)                               0941
         ALR   GPR05P,@08                                          0941
*     GPR14P=0;                     /* LOAD 0 INTO REG 14            */
         LR    GPR14P,@09                                          0942
*     GPR15P='FFFFFFFF'X;           /* LOAD REG 15 WITH DUMMY ADDRESS*/
         SLR   GPR15P,GPR15P                                       0943
         BCTR  GPR15P,0                                            0943
*     CS(GPR14P,GPR15P,GPR04P->RPHRESMA);/* COMPARE RESUME ADDRESS 0944
*                                      WITH 0 AND,IF EQUAL, PUT DUMMY
*                                      ADDRESS IN CONTROL BLOCK    0944
*                                      RESUME ADDRESS                */
         CS    GPR14P,@15,RPHRESMA(GPR04P)                         0944
*     BC(8,FMZT0097);               /* IF EQUAL, BYPASS REMAINDER OF
*                                      EXPANSION                     */
         BC    8,FMZT0097                                          0945
*FMZL0097:                                                         0946
*     IF GPR04P->RPHWT='1'B THEN    /* WT/EXT CONTENTION FLAG ON     */
FMZL0097 TM    RPHWT(GPR04P),B'00001000'                           0946
         BNO   @RF00946                                            0946
*       DO;                         /* IN RPH                        */
*         GPR14P=GPR04P->RPHRESMA×RPHWT1;/* LOAD REG 14 WITH FLAG  0948
*                                      FIELD AND MAKE CERTAIN WT/EXT
*                                      CONTENTION FLAG STILL ON      */
         L     GPR14P,RPHRESMA(,GPR04P)                            0948
         O     GPR14P,@CF00690                                     0948
*         GPR15P=GPR14P×RPHPT1;     /* LOAD REG 15 WITH FLAG FIELD 0949
*                                      AND TURN POST FLAG ON         */
         LR    GPR15P,GPR14P                                       0949
         O     GPR15P,@CF00694                                     0949
*         CS(GPR14P,GPR15P,GPR04P->RPHRESMA);/* COMPARE REG 14 WITH
*                                      FLAG FIELD--IF WT/EXT BIT ON,
*                                      TURN ON POST FLAG             */
         CS    GPR14P,@15,RPHRESMA(GPR04P)                         0950
*         BC(4,FMZL0097);           /* IF WT/EXT BIT WAS OFF, LOOP TO
*                                      TEST CONTENTION FLAG          */
         BC    4,FMZL0097                                          0951
*         BC(8,FMZT0097);           /* IF WT/EXT BIT WAS OFF, BRANCH
*                                      TO BYPASS CODE GEN            */
         BC    8,FMZT0097                                          0952
*       END;                        /* IF POST FLAG IS ON, FALL THRU
*                                      BOTTOM OF LOOP                */
*     ELSE                                                         0954
*       ;                           /* WT/EXT CONTENTION FLAG OFF    */
@RF00946 DS    0H                                                  0955
*     IF GPR04P->RPHTSKID=GPR01P->RPHTSKID THEN                    0955
         CLC   RPHTSKID(4,GPR04P),RPHTSKID(GPR01P)                 0955
         BNE   @RF00955                                            0955
*       DO;                                                        0956
*         GPR05P->PABCHNGP=GPR01P->RPHPABQP;/* PUT PAB QUEUE ADDRESS
*                                      IN SECOND WORD OF PAB         */
         MVC   PABCHNGP(3,GPR05P),RPHPABQP(GPR01P)                 0957
*         GPR01P->RPHPABQP=GPR05P;  /* PUT PAB ADDRESS (IN MAJOR   0958
*                                      CONTROL BLOCK) IN PAB QUEUE 0958
*                                      ADRESS IN RPH                 */
         STCM  GPR05P,7,RPHPABQP(GPR01P)                           0958
*       END;                                                       0959
*     ELSE                                                         0960
*       DO;                                                        0960
         B     @RC00955                                            0960
@RF00955 DS    0H                                                  0961
*         GPR00F=0;                 /* SET REG 0 TO INDICATE ENA     */
         SLR   GPR00F,GPR00F                                       0961
*         DO;                       /* LISATCVT                    0962
*                                      CVTBASE(PAGEABLE,(GPR15P))    */
*           GPR15P=ATCLCPTR;        /* SET UP ATCVT POINTER          */
         L     GPR15P,ATCLCPTR                                     0963
*         END;                      /* LISATCVT PUT POINTER TO ATCVT
*                                      IN IN REG 15                  */
*         CALL GPR15P->ATCAP32;     /* CALL ISTAPC32: TPSCHED        */
         L     @09,ATCAP32(,GPR15P)                                0965
         LR    @15,@09                                             0965
         BALR  @14,@15                                             0965
*       END;                                                       0966
*FMZT0097:                                                         0967
*     DO;                           /* MODESET KEYADDR(GPR06F)     0967
*                                      WORKREG(GPR05F)               */
@RC00955 DS    0H                                                  0967
FMZT0097 DS    0H                                                  0968
*       GPR05F=GPR06F;              /* GET KEY FORM SAVE LOCATION    */
         LR    GPR05F,GPR06F                                       0968
*       SPKA(GPR05F);               /* SET PSW KEY                   */
         SPKA  0(GPR05F)                                           0969
*     END;                          /* MODESET KEYADDR(GPR06F)     0970
*                                      WORKREG(GPR05F)               */
*     GEN REFS(GPR04P,RPHWORK) SETS(GPR02F,GPR03F,GPR04F,GPR05F,GPR06F)
*         ;                                                        0971
        LM GPR02F,GPR06F,RPHWORK(GPR01P)
*     RESPECIFY                                                    0972
*      (GPR00F,                                                    0972
*       GPR01F,                                                    0972
*       GPR04F,                                                    0972
*       GPR05F,                                                    0972
*       GPR06F,                                                    0972
*       GPR14F,                                                    0972
*       GPR15F) UNRSTD;             /* UNRESTRICT REGS 0,1, 4,5,14,
*                                      AND 15                        */
*   END;                            /* ***END OF TPPOST GENERATION***
*                                      POST ASSOCIATED RPH           */
*                                                                  0973
*   /*****************************************************************/
*   /*                                                               */
*   /* SEGMENT(SEG00BC)FINISH                                        */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0974
*   DO;                                                            0974
*     GOTO SEG00BC#;                                               0975
         B     SEG00BC#                                            0975
*SEG00BC@:                                                         0976
*   END;                            /* END OF SUBROUTINE             */
SEG00BC@ DS    0H                                                  0977
         EJECT
*                                                                  0977
*/********************************************************************/
*/*                                                                  */
*/* SEGMENT-                                                         */
*/*      SEG00BE                                                     */
*/*                                                                  */
*/* FUNCTION-                                                        */
*/*      CLEAR (,UNBIND (,NOTIFY) ) LCCW PROCESSOR                   */
*/*                                                                  */
*/********************************************************************/
*                                                                  0977
*   /*****************************************************************/
*   /*                                                               */
*   /* SEGMENT(SEG00BE)START                                         */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0977
*   DO;                                                            0977
*     GOTO SEG00BE@;                                               0978
         B     SEG00BE@                                            0978
*SEG00BE:                                                          0979
*   END;                            /* AF1R00BE: SUBROUTINE          */
SEG00BE  DS    0H                                                  0980
*   ZCRCRLCP=PTRLCP;                /* SAVE LCPB POINTER             */
         ST    PTRLCP,ZCRCRLCP(,PTRZCR)                            0980
*   PTRG15=0;                       /* INITIALIZE RETURN CODE        */
         SLR   PTRG15,PTRG15                                       0981
*   FMCCIPI='1'B;                   /* INDICATE CLEAR IN PROGRESS    */
         OI    FMCCIPI(PTRFMC),B'01000000'                         0982
*   ADDR(FMCPAB2)->PABINHBT='1'B;   /* STOP CLIP DATA TRAFFIC        */
         L     @14,PABINHBT+80(,PTRFMC)                            0983
@GL00006 LR    @09,@14                                             0983
         O     @09,@CF04694                                        0983
         CS    @14,@09,PABINHBT+80(PTRFMC)                         0983
         BNE   @GL00006                                            0983
*   ADDR(FMCPAB3)->PABINHBT='1'B;   /* STOP TOP DATA TRAFFIC         */
         L     @14,PABINHBT+96(,PTRFMC)                            0984
@GL00007 LR    @09,@14                                             0984
         O     @09,@CF04694                                        0984
         CS    @14,@09,PABINHBT+96(PTRFMC)                         0984
         BNE   @GL00007                                            0984
*   ADDR(FMCPAB5)->PABINHBT='1'B;   /* STOP ATOP DATA TRAFFIC        */
         L     @14,PABINHBT+128(,PTRFMC)                           0985
@GL00008 LR    @09,@14                                             0985
         O     @09,@CF04694                                        0985
         CS    @14,@09,PABINHBT+128(PTRFMC)                        0985
         BNE   @GL00008                                            0985
*   IF DNCZF002='1'B THEN                                          0986
         TM    DNCZF002(PTRDNC),B'00000010'                        0986
         BNO   @RF00986                                            0986
*     DO;                           /* IF A BIND IS IN PROGRESS      */
*                                                                  0987
*       /*************************************************************/
*       /*                                                           */
*       /* SEGMENT(SEG0BEA)REQUEST                                   */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0988
*       DO;                                                        0988
*         GOTO SEG0BEA;                                            0989
         B     SEG0BEA                                             0989
*SEG0BEA#:                                                         0990
*       END;                        /* TERMINATE DIALOG SCHEDULING   */
SEG0BEA# DS    0H                                                  0991
*       PTRLCP=ZCRCRLCP;            /* RESTORE CLEAR LCPB    @ZA15142*/
         L     PTRLCP,ZCRCRLCP(,PTRZCR)                            0991
*       CALL SUB000G;               /* DEQUEUE CURRENT ATOP ELEM     */
         BAL   @14,SUB000G                                         0992
*       CALL SUB000H;               /* QUEUE CLEAR LCPB TO ASYNCH  0993
*                                      WAIT QUEUE                    */
         BAL   @14,SUB000H                                         0993
*       CALL SUB0FNE;               /* ALLOCATE BUFFER, ADDR FSB     */
         BAL   @14,SUB0FNE                                         0994
*       PTRG00=SRCLEAR;             /* SET CLEAR RU CODE             */
         LA    PTRG00,161                                          0995
*       CALL SUB000D;               /* BUILD FSB IN BUFFER           */
         BAL   @14,SUB000D                                         0996
*       FSBMJRCD=FRCLRRSP;          /* SET MAJOR=CLEAR               */
         L     @14,SPTFSB(,PTRZCR)                                 0997
         MVI   FSBMJRCD(@14),X'31'                                 0997
*       FSBMNRCD=LCPMNRCD;          /* SET MINOR=CLEAR CODE  @XM17957*/
         MVC   FSBMNRCD(1,@14),LCPMNRCD(PTRLCP)                    0998
*/*  TPQUE (ADDR(ISTFSB),FMCPAB2) NORM                               */
*                                                                  0999
*       DO;                                                        0999
*         RFY                                                      1000
*          (GPR00P,                                                1000
*           GPR01P,                                                1000
*           GPR04P,                                                1000
*           GPR05P,                                                1000
*           GPR15P) RSTD;                                          1000
*         GEN REFS(GPR01P) SETS(RPHWORK)                           1001
*             (STM GPR02P,GPR08P,RPHWORK(GPR01P));                 1001
         STM GPR02P,GPR08P,RPHWORK(GPR01P)
*         GPR00P=0;                                                1002
         SLR   GPR00P,GPR00P                                       1002
*         GPR15P=ADDR(FMCPAB2);     /* HOLD PAB PTR                  */
         LA    GPR15P,FMCPAB2(,PTRFMC)                             1003
*         GPR04P=ADDR(ISTFSB);      /* WORK ELE PTR                  */
         L     GPR04P,SPTFSB(,PTRZCR)                              1004
*         GPR05P=GPR15P;            /* PASS PAB PTR                  */
         LR    GPR05P,GPR15P                                       1005
*         CALL ATCLCPTR->ATCAP37->ISTAPC37;                        1006
         L     @14,ATCLCPTR                                        1006
         L     @15,ATCAP37(,@14)                                   1006
         BALR  @14,@15                                             1006
*         GEN(NOPR  0)                                             1007
*         NOSETS NOREFS;                                           1007
         NOPR  0
*         RFY                                                      1008
*          (GPR00P,                                                1008
*           GPR01P,                                                1008
*           GPR04P,                                                1008
*           GPR05P,                                                1008
*           GPR15P) UNRSTD;                                        1008
*       END;                        /* *** END OF TPQUE GENERATION 1009
*                                      QUEUE FSB TO CLIP             */
*     END;                          /* END BIND IN PROGRESS          */
*   ELSE                                                           1011
*     DO;                           /* NOT BIND IN PROGRESS          */
*                                                                  1011
         B     @RC00986                                            1011
@RF00986 DS    0H                                                  1012
*       /*************************************************************/
*       /*                                                           */
*       /* REQSTORE CBID(DCLCP)CLEAR(YES)RPH(PTRRPH)                 */
*       /*                                                           */
*       /*************************************************************/
*                                                                  1012
*       DO;                                                        1012
*                                                                  1012
*/* ATBUILD (ISTDYPAB,ISTATCVT,ISTRPH)                               */
*/* END OF ATBUILD                                                   */
*                                                                  1013
*         RFY                                                      1013
*          (GPR02P,                                                1013
*           GPR03P,                                                1013
*           GPR04P,                                                1013
*           GPR15P) RSTD;                                          1013
*         RFY                                                      1014
*          (GPR01P,                                                1014
*           GPR13P) RSTD;                                          1014
*         GENERATE REFS(GPR01P,GPR02P,GPR13P) SETS(RPHWORK);       1015
           STM GPR02P,GPR13P,RPHWORK(GPR01P)
*         RFY                                                      1016
*          (GPR01P,                                                1016
*           GPR13P) UNRSTD;                                        1016
*         DO;                       /* LISATCVT                    1017
*                                      CVTBASE(PAGEABLE,(GPR15P))    */
*           GPR15P=ATCLCPTR;        /* SET UP ATCVT POINTER          */
         L     GPR15P,ATCLCPTR                                     1018
*         END;                      /* LISATCVT                      */
*         GPR02P=GPR15P->ATCBPDA×'80000000'X;                      1020
         L     GPR02P,ATCBPDA(,GPR15P)                             1020
         O     GPR02P,@CF01681                                     1020
*         DCL                                                      1021
*           1 FMZA0118 FIXED(31) STATIC LOCAL,                     1021
*            2 * FIXED(8) INIT(184),                               1021
*            2 * PTR(24) INIT(0);                                  1021
*         GPR03F=FMZA0118;                                         1022
         L     GPR03F,FMZA0118                                     1022
*         GPR04F=5;                                                1023
         LA    GPR04F,5                                            1023
*         GPR15P=GPR15P->ATCSMRQ;                                  1024
         L     GPR15P,ATCSMRQ(,GPR15P)                             1024
*         DCL                                                      1025
*           FMZL0118 BASED(GPR15P) LABEL VALUERANGE(*);            1025
*         CALL FMZL0118;                                           1026
         BALR  @14,@15                                             1026
*         RFY                                                      1027
*          (GPR13P) RSTD;                                          1027
*         GENERATE REFS(GPR01P,RPHWORK) SETS(GPR02P,GPR13P);       1028
           LM GPR02P,GPR13P,RPHWORK(GPR01P)
*         RFY                                                      1029
*          (GPR13P) UNRSTD;                                        1029
*         RFY                                                      1030
*          (GPR02P,                                                1030
*           GPR03P,                                                1030
*           GPR04P,                                                1030
*           GPR15P) UNRSTD;                                        1030
*       END;                        /* ******** END OF REQSTORE    1031
*                                      EXPANSION GET LCPB    @ZA25507*/
*       IF PTRG15=8 THEN            /* IF REQSTORE REQUEST WAS NOT 1032
*                                      SATISFIED,            @ZA09588*/
         C     PTRG15,@CF00071                                     1032
         BNE   @RF01032                                            1032
*/*  TPWAIT                                                          */
*                                                                  1033
*         DO;                       /* BEGIN TPWAIT GENERATION       */
*           RFY                                                    1034
*            (GPR01P,                                              1034
*             GPR14P,                                              1034
*             GPR15P) RSTD;                                        1034
*           RFY                                                    1035
*            (GPR00P) RSTD;                                        1035
*           GEN(STM   GPR00P,GPR15P,RPHWORK(GPR01P))               1036
*           REFS(GPR00P,GPR01P,GPR15P) SETS(RPHWORK);              1036
         STM   GPR00P,GPR15P,RPHWORK(GPR01P)
*           RFY                                                    1037
*            (GPR00P) UNRSTD;                                      1037
*           GPR15P=ADDR(LHAA0137);                                 1038
         LA    GPR15P,LHAA0137                                     1038
*           GPR14P=0;                                              1039
         SLR   GPR14P,GPR14P                                       1039
*           GPR15P=GPR15P&'00FFFFFF'X;                             1040
         N     GPR15P,@CF04406                                     1040
*           GPR15P=GPR15P×RPHWT1;                                  1041
         O     GPR15P,@CF00690                                     1041
*           CS(GPR14P,GPR15P,GPR01P->RPHRESMA);                    1042
         CS    GPR14P,@15,RPHRESMA(GPR01P)                         1042
*           BC(7,LHAB0137);                                        1043
*                                                                  1043
         BC    7,LHAB0137                                          1043
*/* TPEXIT  NONE                                                     */
*                                                                  1044
*           DO;                                                    1044
*             RESPECIFY                                            1045
*               GPR15P RSTD;                                       1045
*                                                                  1045
*/* ATBUILD (ISTPAB,ISTDYPAB,ISTATCVT)                               */
*/* END OF ATBUILD                                                   */
*                                                                  1046
*             DO;                   /* LISATCVT                    1046
*                                      CVTBASE(PAGEABLE,(GPR15P))    */
*               GPR15P=ATCLCPTR;    /* SET UP ATCVT POINTER          */
         L     GPR15P,ATCLCPTR                                     1047
*             END;                  /* LISATCVT                      */
*             RESPECIFY                                            1049
*               GPR00F RSTD;                                       1049
*             GPR00F=0;             /* SET PARAMETER REGISTER TO 0   */
         SLR   GPR00F,GPR00F                                       1050
*             GPR15P=GPR15P->ATCAP31;                              1051
         L     GPR15P,ATCAP31(,GPR15P)                             1051
*             DCL                                                  1052
*               FMZL0142 BASED(GPR15P) LABEL VALUERANGE(*);        1052
*             CALL FMZL0142;                                       1053
         BALR  @14,@15                                             1053
*             RESPECIFY                                            1054
*              (GPR00F,                                            1054
*               GPR15P) UNRSTD;                                    1054
*           END;                    /* **** END OF TPEXIT            */
*LHAB0137:                                                         1056
*           ;                                                      1056
LHAB0137 DS    0H                                                  1057
*           GPR01P->RPHRESMA=0;                                    1057
         SLR   @09,@09                                             1057
         ST    @09,RPHRESMA(,GPR01P)                               1057
*           RFY                                                    1058
*            (GPR00P) RSTD;                                        1058
*LHAA0137:                                                         1059
*           ;                                                      1059
LHAA0137 DS    0H                                                  1060
*           GEN(LM    GPR00P,GPR15P,RPHWORK(GPR01P))               1060
*           REFS(RPHWORK,GPR01P) SETS(GPR00P,GPR15P);              1060
         LM    GPR00P,GPR15P,RPHWORK(GPR01P)
*           RFY                                                    1061
*            (GPR00P,                                              1061
*             GPR01P,                                              1061
*             GPR14P,                                              1061
*             GPR15P) UNRSTD;                                      1061
*         END;                      /* ****END OF TPWAIT WAIT FOR IT
*                                                            @ZA09588*/
*       ELSE                                                       1063
*         ;                         /* REQSTORE WAS OK       @ZA09588*/
@RF01032 DS    0H                                                  1064
*       MVECTOR->LCPTYPE=DCLTYPE;   /* SET DCLCP TYPE IN LCPB        */
         L     @14,MVECTOR(,PTRRPH)                                1064
         MVI   LCPTYPE(@14),X'12'                                  1064
*       MVECTOR->LCPLNGTH=LENGTH(ISTDCLCP);/* SET DCLCP LENGTH IN  1065
*                                      LCPB                          */
         MVI   LCPLNGTH(@14),X'64'                                 1065
*       ADDR(MVECTOR->DCLLCCW2)->CARRAY(1:LENGTH(WAZOO))=WAZOO;/*  1066
*                                      INITIALIZE LCCW PROGRAM     1066
*                                                            @XM08708*/
         MVC   CARRAY+56(16,@14),WAZOO                             1066
*       MVECTOR->LCPNXLCW=ADDR(MVECTOR->DCLLCCW2);/* ADDRESS RESET 1067
*                                      LCCW LIST             @XM08708*/
         LA    @09,DCLLCCW2(,@14)                                  1067
         ST    @09,LCPNXLCW(,@14)                                  1067
*       MVECTOR->LCPCID=LCPCID;     /* COPY CID FROM CLEAR LCPB      */
         MVC   LCPCID(4,@14),LCPCID(PTRLCP)                        1068
*       MVECTOR->LCPCLREP=PTRLCP;   /* SET POINTER TO CURRENT LCPB   */
         ST    PTRLCP,LCPCLREP(,@14)                               1069
*       MVECTOR->LCPATOP='1'B;      /* SET ATOP FLAG IN LCPB         */
         OI    LCPATOP(@14),B'00000001'                            1070
*       MVECTOR->LCPZMIRC=LCPMNRCD; /* COPY MINOR RETURN CODE        */
         MVC   LCPZMIRC(1,@14),LCPMNRCD(PTRLCP)                    1071
*       IF LCPINTER='1'B THEN       /*                       @ZA25404*/
         TM    LCPINTER(PTRLCP),B'01000000'                        1072
         BNO   @RF01072                                            1072
*         MVECTOR->LCPINTER='1'B;   /*                       @ZA25404*/
         OI    LCPINTER(@14),B'01000000'                           1073
*       ELSE                                                       1074
*         ;                         /*                       @ZA25404*/
@RF01072 DS    0H                                                  1075
*/*  TPQUE (MVECTOR,FMCPAB3) RESET(YES)                              */
*                                                                  1075
*       DO;                                                        1075
*         RFY                                                      1076
*          (GPR00P,                                                1076
*           GPR01P,                                                1076
*           GPR02P,                                                1076
*           GPR15P) RSTD;                                          1076
*         GEN REFS(GPR01P) SETS(RPHWORK)                           1077
*             (STM   GPR14P,GPR09P,RPHWORK(GPR01P));               1077
         STM   GPR14P,GPR09P,RPHWORK(GPR01P)
*         GPR00P=ADDR(FMCPAB3);                                    1078
         LA    GPR00P,FMCPAB3(,PTRFMC)                             1078
*         GPR02P=MVECTOR;                                          1079
         L     GPR02P,MVECTOR(,PTRRPH)                             1079
*         CALL ATCLCPTR->ATCAP34->ISTAPC34;                        1080
         L     @14,ATCLCPTR                                        1080
         L     @15,ATCAP34(,@14)                                   1080
         BALR  @14,@15                                             1080
*         GEN REFS(RPHWORK,GPR01P) NOSETS                          1081
*             (LM    GPR14P,GPR09P,RPHWORK(GPR01P));               1081
         LM    GPR14P,GPR09P,RPHWORK(GPR01P)
*         RFY                                                      1082
*          (GPR00P,                                                1082
*           GPR01P,                                                1082
*           GPR02P,                                                1082
*           GPR15P) UNRSTD;                                        1082
*       END;                        /* *** END OF TPQUE GENERATION 1083
*                                      QUEUE LCPB TO TOP W/RESET     */
*       RFY                                                        1084
*         PTRG08 RSTD;              /* FOR QUEUE LOOP                */
*       PTRG08=FMCLCPB2;            /* ADDRESS ELEMENT FROM WAITQ    */
         L     PTRG08,FMCLCPB2-1(,PTRFMC)                          1085
         LA    PTRG08,0(,PTRG08)                                   1085
*       DO WHILE(PTRG08^=0);        /* LOOP THROUGH QUEUE            */
         B     @DE01086                                            1086
@DL01086 DS    0H                                                  1087
*         PTRG08->LCPZMIRC=LCPMNRCD;/* COPY MINOR RETURN CODE        */
         MVC   LCPZMIRC(1,PTRG08),LCPMNRCD(PTRLCP)                 1087
*         PTRG08=PTRG08->LCPCHAI2;  /* ADDRESS NEXT ELEMENT          */
         L     @14,LCPCHAI2-1(,PTRG08)                             1088
         LA    @14,0(,@14)                                         1088
         LR    PTRG08,@14                                          1088
*       END;                        /* END OF QUEUE LOOP             */
@DE01086 LTR   PTRG08,PTRG08                                       1089
         BNZ   @DL01086                                            1089
*       RFY                                                        1090
*         PTRG08 UNRSTD;            /* NO LONGER REQUIRED            */
*       CALL SUB000G;               /* DEQUEUE CURRENT ATOP ELEM     */
         BAL   @14,SUB000G                                         1091
*       CALL SUB000H;               /* QUEUE CLEAR LCPB TO         1092
*                                      ASYNCHRONOUS WAIT QUEUE       */
         BAL   @14,SUB000H                                         1092
*     END;                          /* END BIND NOT IN PROGRESS      */
*                                                                  1093
*   /*****************************************************************/
*   /*                                                               */
*   /* SEGMENT(SEG00BE)FINISH                                        */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1094
*   DO;                                                            1094
@RC00986 DS    0H                                                  1095
*     GOTO SEG00BE#;                                               1095
         B     SEG00BE#                                            1095
*SEG00BE@:                                                         1096
*   END;                            /* END OF SEGMENT                */
SEG00BE@ DS    0H                                                  1097
         EJECT
*                                                                  1097
*/********************************************************************/
*/*                                                                  */
*/* SEGMENT-                                                         */
*/*      SEG0BEA                                                     */
*/*                                                                  */
*/* FUNCTION-                                                        */
*/*      TERMINATE DIALOG SCHEDULING ACTIVITIES.                     */
*/*                                                                  */
*/********************************************************************/
*                                                                  1097
*   /*****************************************************************/
*   /*                                                               */
*   /* SEGMENT(SEG0BEA)START                                         */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1097
*   DO;                                                            1097
*     GOTO SEG0BEA@;                                               1098
         B     SEG0BEA@                                            1098
*SEG0BEA:                                                          1099
*   END;                            /* AF1R0BEA: SUBROUTINE          */
SEG0BEA  DS    0H                                                  1100
*   PTRG15=0;                       /* INITIALIZE RETURN CODE        */
         SLR   PTRG15,PTRG15                                       1100
*   IF PTRICN->NCBCONF='1'B×        /* IF 370X IS SICK       @ZA18903*/
*       ZCRCRLCP->LCPINTER='1'B     /* OR INTERNAL           @ZA18903*/
*     THEN                          /*                       @ZA18903*/
         TM    NCBCONF(PTRICN),B'01000000'                         1101
         BO    @RT01101                                            1101
         L     @14,ZCRCRLCP(,PTRZCR)                               1101
         TM    LCPINTER(@14),B'01000000'                           1101
         BNO   @RF01101                                            1101
@RT01101 DS    0H                                                  1102
*     PTRG15=4;                     /* SET ERROR RETURN CODE         */
         LA    PTRG15,4                                            1102
*   ELSE                            /* 370X IS NOT SICK              */
*     IF PTRICN->NCBNSNA^=0 THEN                                   1103
         B     @RC01101                                            1103
@RF01101 L     @14,NCBNSNA(,PTRICN)                                1103
         LTR   @14,@14                                             1103
         BZ    @RF01103                                            1103
*       DO;                         /* IF THIS IS A REMOTE           */
*         PTRG15=NCBNSNA;           /* INITIALIZE NCB SCAN           */
         L     PTRG15,NCBNSNA(,PTRDNC)                             1105
*         DO WHILE(PTRG15->NCBNSNA^=0);/* FIND ASSOCIATED LOCAL NCB  */
         B     @DE01106                                            1106
@DL01106 DS    0H                                                  1107
*           PTRG15=PTRG15->NCBNSNA; /* GET NEXT SCHEDULABLE BLOCK    */
         L     PTRG15,NCBNSNA(,PTRG15)                             1107
*         END;                      /* END SCAN TO LOCAL             */
@DE01106 L     @14,NCBNSNA(,PTRG15)                                1108
         LTR   @14,@14                                             1108
         BNZ   @DL01106                                            1108
*         IF PTRG15->NCBCONF='1'B THEN/* IF ASSOCIATED LOCAL SICK    */
         TM    NCBCONF(PTRG15),B'01000000'                         1109
         BNO   @RF01109                                            1109
*           PTRG15=4;               /* SET ERROR RETURN CODE         */
         LA    PTRG15,4                                            1110
*         ELSE                      /* ASSOCIATED LOCAL IS WELL      */
*           PTRG15=0;               /* SET OK RETURN CODE            */
         B     @RC01109                                            1111
@RF01109 SLR   PTRG15,PTRG15                                       1111
*       END;                        /* END REMOTE PROCESSING         */
*     ELSE                                                         1113
*       ;                           /* THIS IS A LOCAL 370X          */
@RF01103 DS    0H                                                  1114
*   IF PTRG15=0 THEN                /* IF 370X IS WELL               */
@RC01103 DS    0H                                                  1114
@RC01101 LTR   PTRG15,PTRG15                                       1114
         BNZ   @RF01114                                            1114
*     DNCZF008='1'B;                /* SET DNCB PURGE FLAG           */
         OI    DNCZF008(PTRDNC),B'00000001'                        1115
*   ELSE                                                           1116
*     DO;                           /* A 370X IS SICK                */
         B     @RC01114                                            1116
@RF01114 DS    0H                                                  1117
*       DO WHILE(FMCLCPB2^=0);      /* CLEAR THE WAIT QUEUE          */
         B     @DE01117                                            1117
@DL01117 DS    0H                                                  1118
*/* TPDEQ (,FMCLCPBQ) RETPTR(PTRLSC)                                 */
*                                                                  1118
*         DO;                       /* BEGIN TPDEQ CODE GENERATION   */
*           RFY                                                    1119
*            (GPR00P,                                              1119
*             GPR01P,                                              1119
*             GPR14P,                                              1119
*             GPR15P) RSTD;                                        1119
*           GPR15P=ADDR(FMCLCPBQ);  /* ADDRESS QUEUE POINTER         */
         LA    GPR15P,FMCLCPBQ(,PTRFMC)                            1120
*           GPR14P=GPR15P->PABWEQA×FMZCA038;                       1121
         L     @09,@CF01681                                        1121
         L     GPR14P,PABWEQA(,GPR15P)                             1121
         OR    GPR14P,@09                                          1121
*           IF GPR14P=FMZCA038 THEN                                1122
         CLR   GPR14P,@09                                          1122
         BE    @RT01122                                            1122
*             ;                                                    1123
*           ELSE                                                   1124
*             DO;                                                  1124
*FMZL1160:                                                         1125
*               ;                                                  1125
FMZL1160 DS    0H                                                  1126
*               DO WHILE(GPR14P->WKECHAIN^=FMZCA038);              1126
         B     @DE01126                                            1126
@DL01126 DS    0H                                                  1127
*                 GPR15P=ADDR(GPR14P->WKECHAIN);                   1127
         LA    GPR15P,WKECHAIN(,GPR14P)                            1127
*                 GPR14P=GPR15P->PABWEQA;                          1128
         L     GPR14P,PABWEQA(,GPR15P)                             1128
*               END;                                               1129
@DE01126 L     @09,@CF01681                                        1129
         CL    @09,WKECHAIN(,GPR14P)                               1129
         BNE   @DL01126                                            1129
*               GPR00P=FMZCA038;                                   1130
         LR    GPR00P,@09                                          1130
*               CS(GPR14P,GPR00P,GPR15P->PABWEQA);                 1131
         CS    GPR14P,@00,PABWEQA(GPR15P)                          1131
*               BC(7,FMZL1160);                                    1132
         BC    7,FMZL1160                                          1132
*               GPR14P->WKECHAIN=0;                                1133
         SLR   @09,@09                                             1133
         ST    @09,WKECHAIN(,GPR14P)                               1133
*             END;                                                 1134
*ISTA0160:                                                         1135
*           ;                                                      1135
@RT01122 DS    0H                                                  1135
ISTA0160 DS    0H                                                  1136
*           GPR14P=GPR14P&FMZCB038;                                1136
         N     GPR14P,@CF02493                                     1136
*           PTRLSC=GPR14P;                                         1137
         LR    PTRLSC,GPR14P                                       1137
*           RFY                                                    1138
*            (GPR00P,                                              1138
*             GPR01P,                                              1138
*             GPR14P,                                              1138
*             GPR15P) UNRSTD;                                      1138
*         END;                      /* END TPDEQ GENERATION REMOVE 1139
*                                      ELEMENT FROM QUEUE            */
*         ZCRPCOD1=ZCPLSCB;         /* FLAG AS LSCB RELEASE          */
         MVI   ZCRPCOD1(PTRZCR),X'08'                              1140
*         CALL ATCZPSVT->ZPSZDFB0;  /* RELEASE LSCB                  */
         L     @14,ATCZPSVT(,PTRATC)                               1141
         L     @15,ZPSZDFB0(,@14)                                  1141
         BALR  @14,@15                                             1141
*       END;                        /* END CLEAR OF WAIT QUEUE       */
@DE01117 L     @14,FMCLCPB2-1(,PTRFMC)                             1142
         LA    @14,0(,@14)                                         1142
         LTR   @14,@14                                             1142
         BNZ   @DL01117                                            1142
*       FMCZX003=0;                 /* ZERO REQUEST COUNT            */
         MVI   FMCZX003(PTRFMC),X'00'                              1143
*     END;                          /* END SICK 370X                 */
*   ZCRTSW1='1'B;                   /* SET SECRET PROGRAM SWITCH     */
@RC01114 OI    ZCRTSW1(PTRZCR),B'10000000'                         1145
*   CALL SUB00CA;                   /* BUILD COMN'D CLEARED FSB      */
*                                                                  1146
         BAL   @14,SUB00CA                                         1146
*   /*****************************************************************/
*   /*                                                               */
*   /* SEGMENT(SEG0BEA)FINISH                                        */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1147
*   DO;                                                            1147
*     GOTO SEG0BEA#;                                               1148
         B     SEG0BEA#                                            1148
*SEG0BEA@:                                                         1149
*   END;                            /* END OF SUBROUTINE             */
         EJECT
*                                                                  1150
*/********************************************************************/
*/*                                                                  */
*/* SUBROUTINE-                                                      */
*/*      SUB00CA                                                     */
*/*                                                                  */
*/* FUNCTION-                                                        */
*/*      PROCESS BIND FSB.                                           */
*/*                                                                  */
*/********************************************************************/
*                                                                  1150
*SUB00CA:                                                          1150
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);/* AF1R00CA: SUBROUTINE          */
         B     @PB00002                                            1150
SUB00CA  DS    0H                                                  1151
*   RFY                                                            1151
*     PTRG14 RSTD;                  /* TO SAVE RETURN REGISTER       */
*   ZCRSVF1=PTRG14;                 /* SAVE RETURN POINTER           */
         ST    PTRG14,ZCRSVF1(,PTRZCR)                             1152
*   RFY                                                            1153
*     PTRG14 UNRSTD;                /* SAVED                         */
*   CALL SUB000F;                   /* DEQUEUE BIND LCBP             */
         BAL   @14,SUB000F                                         1154
*   PTRLCP=SPTLCP;                  /* GET LCPB POINTER              */
         L     PTRLCP,SPTLCP(,PTRZCR)                              1155
*   DNCZF002='0'B;                  /* CLEAR DNCB DIALOG SCHED FLG   */
         NI    DNCZF002(PTRDNC),B'11111101'                        1156
*   IF PTRLCP^=0 THEN                                              1157
         LTR   PTRLCP,PTRLCP                                       1157
         BZ    @RF01157                                            1157
*     DO;                           /* IF LCPB WAS FOUND     @ZA26464*/
*       CALL SUB0FNE;               /* ALLOCATE BUFFER, ADDR FSB     */
         BAL   @14,SUB0FNE                                         1159
*       PTRG00=SRBIND;              /* SET BIND SRU CODE             */
         LA    PTRG00,49                                           1160
*       CALL SUB000D;               /* BUILDAFSB                     */
         BAL   @14,SUB000D                                         1161
*       IF DNCZF003='1'B THEN                                      1162
         TM    DNCZF003(PTRDNC),B'00000001'                        1162
         BNO   @RF01162                                            1162
*         DO;                       /* IF DNCB DIALOG SCHED ERROR    */
*           DNCZF003='0'B;          /* CLEAR SAID FLAG               */
         NI    DNCZF003(PTRDNC),B'11111110'                        1164
*           ISTRH=RHRESP;           /* INITIALIZE RESPONSE RH        */
         L     @14,SPTFSB(,PTRZCR)                                 1165
         LA    @09,17                                              1165
         ALR   @09,@14                                             1165
         MVC   ISTRH(3,@09),@CB01580                               1165
*           RHEXCEPT='1'B;          /* FLAG AS EXCEPTION RESPONSE    */
         OI    RHEXCEPT(@09),B'00010000'                           1166
*           FSBMJRCD=FRNORM;        /* SET MAJOR=NORMAL              */
         MVI   FSBMJRCD(@14),X'00'                                 1167
*           FSBMNRCD=FRMOK;         /* SET MINOR=OK                  */
         MVI   FSBMNRCD(@14),X'00'                                 1168
*         END;                      /* END DIALOG SCHED ERROR        */
*       ELSE                        /* NOT DIALOG SCHED ERROR        */
*         IF ZCRTSW1='0'B THEN                                     1170
         B     @RC01162                                            1170
@RF01162 TM    ZCRTSW1(PTRZCR),B'10000000'                         1170
         BNZ   @RF01170                                            1170
*           DO;                     /* IF SECRET SWITCH OFF          */
*             FSBMJRCD=FRNORM;      /* SET MAJOR=NORMAL              */
         L     @14,SPTFSB(,PTRZCR)                                 1172
         MVI   FSBMJRCD(@14),X'00'                                 1172
*             FSBMNRCD=FRMOK;       /* SET MINOR=OK                  */
         MVI   FSBMNRCD(@14),X'00'                                 1173
*             ADDR(FMCPAB2)->PABINHBT='0'B;/* CLEAR CLIP INHIBIT FLAG*/
         L     @14,PABINHBT+80(,PTRFMC)                            1174
@GL00010 LR    @09,@14                                             1174
         N     @09,@CF04700                                        1174
         CS    @14,@09,PABINHBT+80(PTRFMC)                         1174
         BNE   @GL00010                                            1174
*             ADDR(FMCPAB3)->PABINHBT='0'B;/* CLEAR TOP INHIBIT FLAG */
         L     @14,PABINHBT+96(,PTRFMC)                            1175
@GL00011 LR    @09,@14                                             1175
         N     @09,@CF04700                                        1175
         CS    @14,@09,PABINHBT+96(PTRFMC)                         1175
         BNE   @GL00011                                            1175
*             ADDR(FMCPAB5)->PABINHBT='0'B;/* CLEAR ATOP INHIBIT FLAG*/
         L     @14,PABINHBT+128(,PTRFMC)                           1176
@GL00012 LR    @09,@14                                             1176
         N     @09,@CF04700                                        1176
         CS    @14,@09,PABINHBT+128(PTRFMC)                        1176
         BNE   @GL00012                                            1176
*           END;                    /* END SECRET SWITCH OFF         */
*         ELSE                                                     1178
*           DO;                     /* SECRET SWITCH IS ON           */
         B     @RC01170                                            1178
@RF01170 DS    0H                                                  1179
*             FSBMJRCD=FRPURGE;     /* SET MAJOR=CLEARED             */
         L     @14,SPTFSB(,PTRZCR)                                 1179
         MVI   FSBMJRCD(@14),X'1C'                                 1179
*             FSBMNRCD=ZCRCRLCP->LCPZMIRC;/* SET MINOR=FROM CLEAR  1180
*                                      LCPB                          */
         L     @09,ZCRCRLCP(,PTRZCR)                               1180
         MVC   FSBMNRCD(1,@14),LCPZMIRC(@09)                       1180
*           END;                    /* END SECRET SWITCH ON          */
*       CALL SUB000E;               /* POST FSB BACK TO REQUESTOR    */
@RC01170 DS    0H                                                  1182
@RC01162 BAL   @14,SUB000E                                         1182
*     END;                          /*                       @ZA26464*/
*   ELSE                                                           1184
*     ;                             /*                       @ZA26464*/
@RF01157 DS    0H                                                  1185
*   RFY                                                            1185
*     PTRG14 RSTD;                  /* TO RESTORE RETURN POINTER     */
*   PTRG14=ZCRSVF1;                 /* RESTORE RETURN POINTER        */
         L     PTRG14,ZCRSVF1(,PTRZCR)                             1186
*   RFY                                                            1187
*     PTRG14 UNRSTD;                /* RESTORED                      */
*   END SUB00CA;                    /* END OF SUBROUTINE             */
@EL00002 DS    0H                                                  1188
@EF00002 DS    0H                                                  1188
@ER00002 BR    @14                                                 1188
         EJECT
*                                                                  1189
*/********************************************************************/
*/*                                                                  */
*/* SUBROUTINE-                                                      */
*/*      SUB00CE                                                     */
*/*                                                                  */
*/* FUNCTION-                                                        */
*/*      PROCESS CLEAR FSB.                                          */
*/*                                                                  */
*/********************************************************************/
*                                                                  1189
*SUB00CE:                                                          1189
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);/* AF1R00CE: SUBROUTINE          */
SUB00CE  DS    0H                                                  1190
*   RFY                                                            1190
*     PTRG14 RSTD;                  /* TO SAVE RETURN REG            */
*   ZCRSVF2=PTRG14;                 /* SAVE RETURN REG               */
         ST    PTRG14,ZCRSVF2(,PTRZCR)                             1191
*   RFY                                                            1192
*     PTRG14 UNRSTD;                /* SAVED                         */
*   PTRLCP=FSBLCPB;                 /* ADDRESS LCPB ASSOCIATED WITH
*                                      CURRENT FSB                   */
         L     @14,SPTFSB(,PTRZCR)                                 1193
         L     PTRLCP,FSBLCPB(,@14)                                1193
*   IF LCPATOP='1'B THEN            /* IF LCPB SCHED FROM ATOP       */
         TM    LCPATOP(PTRLCP),B'00000001'                         1194
         BNO   @RF01194                                            1194
*     PTRLCP=LCPCLREP;              /* ADDRESS ITS ASSOS. LCPB       */
         L     PTRLCP,LCPCLREP(,PTRLCP)                            1195
*   ELSE                                                           1196
*     ;                             /* IF LCPB NOT SCHED FROM ATOP   */
@RF01194 DS    0H                                                  1197
*/* NEXT 4 LINES REMOVED BY APAR OZ25404                     @ZA25404*/
*/* ?TPFEL(,FMCLCPAQ);              ** GET OLDEST ELEMENT ON AWAIT   */
*/* IF RPHWEA=PTRLCP THEN                                            */
*/*   ;                             ** IF ELEMENT IS FOR FSB         */
*/* ELSE                            ** NOT, CLEAN UP PREVIOUS CLRS   */
*                                                                  1197
*   /*****************************************************************/
*   /*                                                               */
*   /* SEGMENT(SEG0CEA)REQUEST                                       */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1197
*   DO;                                                            1197
*     GOTO SEG0CEA;                                                1198
         B     SEG0CEA                                             1198
*SEG0CEA#:                                                         1199
*   END;                            /* CLEAN UP PREVIOUS CLEARS      */
SEG0CEA# DS    0H                                                  1200
*/* NEXT 5 LINES REMOVED BY OZ25404                          @ZA25404*/
*/* CALL SUB000F;                   ** REMOVE CLEAR LCPB FROM Q      */
*/* IF(LCPRSTQH&MASKWORD)=0 THEN                                     */
*/*   ;                             ** IF SIDE QUEUE EMPTY           */
*/* ELSE                            ** IF NOT EMPTY                  */
*/*   CALL SUB0CEB;                 ** CLEAN UP PREVIOUS CLEARS      */
*                                                                  1200
*   IF FSBLCPB->LCPATOP='1'B THEN   /* IF LCPB SCHED FROM ATOP       */
*                                                                  1200
         L     @14,SPTFSB(,PTRZCR)                                 1200
         L     @14,FSBLCPB(,@14)                                   1200
         TM    LCPATOP(@14),B'00000001'                            1200
         BNO   @RF01200                                            1200
*     /***************************************************************/
*     /*                                                             */
*     /* RELSTORE BUFADDR(FSBLCPB)                                   */
*     /*                                                             */
*     /***************************************************************/
*                                                                  1201
*     DO;                                                          1201
*                                                                  1201
*/* ATBUILD (ISTATCVT,ISTRPH)                                        */
*/* END OF ATBUILD                                                   */
*                                                                  1202
*       RFY                                                        1202
*        (GPR02P,                                                  1202
*         GPR03P,                                                  1202
*         GPR04P,                                                  1202
*         GPR15P) RSTD;                                            1202
*       RFY                                                        1203
*        (GPR01P,                                                  1203
*         GPR13P) RSTD;                                            1203
*       GENERATE REFS(GPR01P,GPR02P,GPR13P) SETS(RPHWORK);         1204
          STM GPR02P,GPR13P,RPHWORK(GPR01P)
*       RFY                                                        1205
*         GPR13P UNRSTD;                                           1205
*       GPR04P=FSBLCPB;                                            1206
         L     @14,SPTFSB(,PTRZCR)                                 1206
         L     GPR04P,FSBLCPB(,@14)                                1206
*       DCL                                                        1207
*         1 FMZA0166 FIXED(31) STATIC LOCAL,                       1207
*          2 * FIXED(8) INIT(64),                                  1207
*          2 * PTR(24) INIT(0);                                    1207
*       GPR03F=FMZA0166;                                           1208
         L     GPR03F,FMZA0166                                     1208
*       DO;                         /* LISATCVT                    1209
*                                      CVTBASE(PAGEABLE,(GPR15P))    */
*         GPR15P=ATCLCPTR;          /* SET UP ATCVT POINTER          */
         L     GPR15P,ATCLCPTR                                     1210
*       END;                        /* LISATCVT                      */
*       GPR02P=GPR15P->ATCBPDA;                                    1212
         L     GPR02P,ATCBPDA(,GPR15P)                             1212
*       GPR15P=GPR15P->ATCSMRS;                                    1213
         L     GPR15P,ATCSMRS(,GPR15P)                             1213
*       DCL                                                        1214
*         FMZL0166 BASED(GPR15P) LABEL VALUERANGE(*);              1214
*       CALL FMZL0166;                                             1215
         BALR  @14,@15                                             1215
*       RFY                                                        1216
*         GPR13P RSTD;                                             1216
*       GENERATE REFS(GPR01P,RPHWORK) SETS(GPR02P,GPR13P);         1217
          LM GPR02P,GPR13P,RPHWORK(GPR01P)
*       RFY                                                        1218
*        (GPR01P,                                                  1218
*         GPR13P) UNRSTD;                                          1218
*       RFY                                                        1219
*        (GPR02P,                                                  1219
*         GPR03P,                                                  1219
*         GPR04P,                                                  1219
*         GPR15P) UNRSTD;                                          1219
*     END;                          /* *********END OF RELSTORE    1220
*                                      EXPANSION********* THROW IT 1220
*                                      AWAY                          */
*   ELSE                                                           1221
*     ;                             /* NOT SCHEDULED FROM ATOP       */
@RF01200 DS    0H                                                  1222
*   IF LCCWOP=LCRUDNFY              /* IF NOTIFY                     */
*       ×LCCWOP=LCLRNFY THEN        /* × CLEAR NOTIFY                */
         L     @14,LCPNXLCW(,PTRLCP)                               1222
         CLI   LCCWOP(@14),X'F4'                                   1222
         BE    @RT01222                                            1222
         CLI   LCCWOP(@14),X'F8'                                   1222
         BNE   @RF01222                                            1222
@RT01222 DS    0H                                                  1223
*     CALL SUB0BCA;                 /* PERFORM NOTIFY FUNCTION       */
         BAL   @14,SUB0BCA                                         1223
*   ELSE                                                           1224
*     ;                             /* NOTIFY NOT SPECIFIED          */
@RF01222 DS    0H                                                  1225
*   IF LCCWOP=LCLEAR×               /* IF CLEAR OR           @XM19464*/
*       LCCWOP=LCLRNFY THEN         /* CLEAR NOTIFY          @XM19464*/
         L     @14,LCPNXLCW(,PTRLCP)                               1225
         CLI   LCCWOP(@14),X'F2'                                   1225
         BE    @RT01225                                            1225
         CLI   LCCWOP(@14),X'F8'                                   1225
         BNE   @RF01225                                            1225
@RT01225 DS    0H                                                  1226
*     DO;                           /*                       @XM19464*/
*       ADDR(FMCPAB2)->PABINHBT='0'B;/* ALLOW CLIP TRAFFIC           */
         L     @14,PABINHBT+80(,PTRFMC)                            1227
@GL00015 LR    @09,@14                                             1227
         N     @09,@CF04700                                        1227
         CS    @14,@09,PABINHBT+80(PTRFMC)                         1227
         BNE   @GL00015                                            1227
*       ADDR(FMCPAB3)->PABINHBT='0'B;/* ALLOW TOP TRAFFIC            */
         L     @14,PABINHBT+96(,PTRFMC)                            1228
@GL00016 LR    @09,@14                                             1228
         N     @09,@CF04700                                        1228
         CS    @14,@09,PABINHBT+96(PTRFMC)                         1228
         BNE   @GL00016                                            1228
*       ADDR(FMCPAB5)->PABINHBT='0'B;/* ALLOW ATOP TRAFFIC           */
         L     @14,PABINHBT+128(,PTRFMC)                           1229
@GL00017 LR    @09,@14                                             1229
         N     @09,@CF04700                                        1229
         CS    @14,@09,PABINHBT+128(PTRFMC)                        1229
         BNE   @GL00017                                            1229
*     END;                          /* END CLEAR ONLY                */
*   ELSE                                                           1231
*     ;                             /* NOT CLEAR ONLY                */
@RF01225 DS    0H                                                  1232
*   FSBMJRCD=FRNORM;                /* MAJOR=NORMAL                  */
         L     @14,SPTFSB(,PTRZCR)                                 1232
         MVI   FSBMJRCD(@14),X'00'                                 1232
*   FSBMNRCD=FRMOK;                 /* MINOR=OK                      */
         MVI   FSBMNRCD(@14),X'00'                                 1233
*   FSBLCPB=PTRLCP;                 /* SET CLEAR FSB LCPB ADDRESS    */
         ST    PTRLCP,FSBLCPB(,@14)                                1234
*   FSBLCCWA=LCPNXLCW;              /* SET CLEAR FSB LCCW ADDRESS    */
         L     @09,LCPNXLCW(,PTRLCP)                               1235
         ST    @09,FSBLCCWA(,@14)                                  1235
*   FSBSEQID=FMCOASN+1;             /* INCREMENT ASYNCH SEQ NO.      */
         LA    @09,1                                               1236
         LH    @08,FMCOASN(,PTRFMC)                                1236
         N     @08,@CF04690                                        1236
         ALR   @09,@08                                             1236
         STH   @09,FSBSEQID(,@14)                                  1236
*   CALL SUB000E;                   /* QUEUE FSB TO REQUESTOR        */
         BAL   @14,SUB000E                                         1237
*   FMCOASN=0;                      /* CLEAR ASYNCH SEQ. NO.         */
         SLR   @14,@14                                             1238
         STH   @14,FMCOASN(,PTRFMC)                                1238
*   FMCOSSN=0;                      /* CLEAR OUTBOUND SEQ. NO.       */
         STH   @14,FMCOSSN(,PTRFMC)                                1239
*   FMCISSN=0;                      /* CLEAR INBOUND SEQ. NO.        */
         STH   @14,FMCISSN(,PTRFMC)                                1240
*   RFY                                                            1241
*     PTRG14 RSTD;                  /* TO RESTORE RETURN REGISTER    */
*   PTRG14=ZCRSVF2;                 /* RESTORE RETURN REGISTER       */
         L     PTRG14,ZCRSVF2(,PTRZCR)                             1242
*   RFY                                                            1243
*     PTRG14 UNRSTD;                /* RESTORED                      */
*   RETURN;                         /* END OF SUBROUTINE             */
@EL00003 DS    0H                                                  1244
@EF00003 DS    0H                                                  1244
@ER00003 BR    @14                                                 1244
         EJECT
*                                                                  1245
*/********************************************************************/
*/*                                                                  */
*/* SEGMENT-                                                         */
*/*      SEG0CEA                                                     */
*/*                                                                  */
*/* FUNCTION-                                                        */
*/*      CLEAN UP AFTER A PREVIOUS CLEAR.                            */
*/*                                                                  */
*/********************************************************************/
*                                                                  1245
*   /*****************************************************************/
*   /*                                                               */
*   /* SEGMENT(SEG0CEA)START                                         */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1245
*   DO;                                                            1245
*     GOTO SEG0CEA@;                                               1246
*SEG0CEA:                                                          1247
*   END;                            /* AF1R0CEA: SUBROUTINE          */
SEG0CEA  DS    0H                                                  1248
*   ZCRSVWK3=SPTFSB;                /* SAVE FSB POINTER AROUND CALL
*                                                            @XM01601*/
         L     @14,SPTFSB(,PTRZCR)                                 1248
         ST    @14,ZCRSVWK3(,PTRZCR)                               1248
*/*  ALL CODE BELOW REMOVED BY OZ25404                       @ZA25404*/
*/* SPTFSB=LCPRSTQH&MASKWORD;       ** ADDRESS 1ST ELEMENT OF SIDE   */
*/*                                    QUEUE                         */
*/* DO WHILE(SPTFSB^=0);            ** CLEAR OUT SIDE QUEUE          */
*/*   IF FSBTYPE=FSTYPE THEN                                         */
*/*     DO;                         ** IF ELEMENT IS A FSB           */
*/*       SPTLCP=FSBLCPB;           ** ADDRESS ASSOCIATED LCPB       */
*/*       IF SPTLCP->LCPATOP='1'B THEN** IF LCPB SCHED FROM ATOP     */
*/*         SPTLCP=SPTLCP->LCPCLREP;** ADDRESS ITS ASSOC. LCPB       */
*/*       ELSE                                                       */
*/*         ;                       ** LCPB NOT SCHED FROM ATOP      */
*/*       ?TPDEQ(SPTLCP,FMCLCPAQ);  ** REMOVE ASSOCIATED LCPB FROM 1249
***                                    AWAIT QUEUE                   */
*/*       IF(SPTLCP->LCPRSTQH&MASKWORD)=0 THEN                       */
*/*         ;                       ** IF THAT ASSOCIATED SIDEQ IS 1249
***                                    EMPTY NO NEED TO MESS         */
*/*       ELSE                      ** THE SIDEQ IS NOT EMPTY        */
*/*         CALL SUB0CEB;           ** CLEAR UP THE SIDE QUEUE       */
*/*       IF FSBLCPB->LCPATOP='1'B THEN** IF LCPB ASSOCIATED WITH THE
***                                    FSB SCHED FROM THE ATOP       */
*/*         ?RELSTORE BUFADDR(FSBLCPB);** GET RID OF THE LCPB        */
*/*       ELSE                                                       */
*/*         ;                       ** LCPB NOT SCHED FROM ATOP      */
*/*       IF SPTLCP->LCPNXLCW->LCCWOP=LCRUDNFY×SPTLCP->LCPNXLCW->LCCWOP
***           =LCLRNFY THEN         ** IF NOTIFY REQUIRED            */
*/*         CALL SUB0BCA;           ** PROCESS NOTIFY FUNCTION       */
*/*       ELSE                                                     1249
*           ;                       ** OTHERWISE DON'T               */
*/*       FSBMJRCD=FRNORM;          ** MAJOR RC=NORMAL               */
*/*       FSBMNRCD=FRMOK;           ** MINOR RC=OK                   */
*/*       FMCOASN=FMCOASN+1;        ** INCREMENT FMCB SEQUENCE CTR   */
*/*       FSBSEQID=FMCOASN;         ** SET SEQUENCE NUMBER           */
*/*       FSBLCPB=SPTLCP;           ** SET ADDRESS OF LCPB           */
*/*       FSBLCCWA=SPTLCP->LCPNXLCW;** SET ADDRESS OF LCCW           */
*/*       SPTLCP=FSBFSBA&MASKWORD;  ** ADDRESS NEXT ELEMENT          */
*/*       CALL SUB000E;             ** QUEUE FSB TO CLR REQUESTOR    */
*/*       SPTFSB=SPTLCP;            ** ADDRESS NEXT ELEMENT          */
*/*     END;                        ** END ELEMENT IS A FSB          */
*/*   ELSE                          ** ELEMENT IS NOT A FSB          */
*/*     SPTFSB=SPTFSB->LCPCHAIN&MASKWORD;** ADDRESS NEXT CHAINED ELEM*/
*/* END;                            ** END SEARCHING SIDE QUEUE      */
*                                                                  1249
*KRUNCH:                                                           1249
*   ;                               /* DO UNTIL SIMULATION           */
KRUNCH   DS    0H                                                  1250
*/* ?TPFEL(,FMCLCPAQ);  OZ25404 ZAPED  GET OLDEST AWAITQ ELEMENT     */
*/* IF RPHWEA^=PTRLCP THEN                                         1250
*     DO;                           ** IF ELDEST NOT ORIGIONAL CLR   */
*                                                                  1250
*   CALL SUB000F;                   /* REMOVE OLDEST LCPB FROM     1250
*                                      ASYNCHRONOUS WAIT QUEUE       */
         BAL   @14,SUB000F                                         1250
*   IF SPTLCP->FSBTYPE=FSTYPE THEN  /* GOT A FSB             @ZA25404*/
         L     @14,SPTLCP(,PTRZCR)                                 1251
         CLI   FSBTYPE(@14),X'02'                                  1251
         BNE   @RF01251                                            1251
*     DO;                           /*                       @ZA25404*/
*       IF SPTLCP->FSBATOP='1'B THEN/* GOT A DCLCP RET IT    @ZA25404*/
*                                                                  1253
         TM    FSBATOP(@14),B'00000001'                            1253
         BNO   @RF01253                                            1253
*         /***********************************************************/
*         /*                                                         */
*         /* RELSTORE BUFADDR(SPTLCP->FSBLCPB)                       */
*         /*                                                         */
*         /***********************************************************/
*                                                                  1254
*         DO;                                                      1254
*                                                                  1254
*/* ATBUILD (ISTATCVT,ISTRPH)                                        */
*/* END OF ATBUILD                                                   */
*                                                                  1255
*           RFY                                                    1255
*            (GPR02P,                                              1255
*             GPR03P,                                              1255
*             GPR04P,                                              1255
*             GPR15P) RSTD;                                        1255
*           RFY                                                    1256
*            (GPR01P,                                              1256
*             GPR13P) RSTD;                                        1256
*           GENERATE REFS(GPR01P,GPR02P,GPR13P) SETS(RPHWORK);     1257
          STM GPR02P,GPR13P,RPHWORK(GPR01P)
*           RFY                                                    1258
*             GPR13P UNRSTD;                                       1258
*           GPR04P=SPTLCP->FSBLCPB;                                1259
         L     @14,SPTLCP(,PTRZCR)                                 1259
         L     GPR04P,FSBLCPB(,@14)                                1259
*           DCL                                                    1260
*             1 FMZA0183 FIXED(31) STATIC LOCAL,                   1260
*              2 * FIXED(8) INIT(64),                              1260
*              2 * PTR(24) INIT(0);                                1260
*           GPR03F=FMZA0183;                                       1261
         L     GPR03F,FMZA0183                                     1261
*           DO;                     /* LISATCVT                    1262
*                                      CVTBASE(PAGEABLE,(GPR15P))    */
*             GPR15P=ATCLCPTR;      /* SET UP ATCVT POINTER          */
         L     GPR15P,ATCLCPTR                                     1263
*           END;                    /* LISATCVT                      */
*           GPR02P=GPR15P->ATCBPDA;                                1265
         L     GPR02P,ATCBPDA(,GPR15P)                             1265
*           GPR15P=GPR15P->ATCSMRS;                                1266
         L     GPR15P,ATCSMRS(,GPR15P)                             1266
*           DCL                                                    1267
*             FMZL0183 BASED(GPR15P) LABEL VALUERANGE(*);          1267
*           CALL FMZL0183;                                         1268
         BALR  @14,@15                                             1268
*           RFY                                                    1269
*             GPR13P RSTD;                                         1269
*           GENERATE REFS(GPR01P,RPHWORK) SETS(GPR02P,GPR13P);     1270
          LM GPR02P,GPR13P,RPHWORK(GPR01P)
*           RFY                                                    1271
*            (GPR01P,                                              1271
*             GPR13P) UNRSTD;                                      1271
*           RFY                                                    1272
*            (GPR02P,                                              1272
*             GPR03P,                                              1272
*             GPR04P,                                              1272
*             GPR15P) UNRSTD;                                      1272
*         END;                      /* *********END OF RELSTORE    1273
*                                      EXPANSION*********            */
*                                                                  1273
*       /*************************************************************/
*       /*                                                           */
*       /*                                                   @ZA25404*/
*       /*                                                           */
*       /*************************************************************/
*                                                                  1274
*       ELSE                                                       1274
*         ;                         /* NOW GET RID OF FSB    @ZA25404*/
@RF01253 DS    0H                                                  1275
*       SPTLCP=ADDR(SPTLCP->FSBFDB)-(ADDR(SPTLCP->FSBFDB)->FDBOFSET);
         L     @14,SPTLCP(,PTRZCR)                                 1275
         LA    @09,FSBFDB(,@14)                                    1275
         SH    @09,FDBOFSET+32(,@14)                               1275
         ST    @09,SPTLCP(,PTRZCR)                                 1275
*                                   /* GET FSB ADDR IN BUF   @ZA25404*/
*                                                                  1276
*       /*************************************************************/
*       /*                                                           */
*       /* RELSTORE BUFADDR(SPTLCP)                                  */
*       /*                                                           */
*       /*************************************************************/
*                                                                  1276
*       DO;                                                        1276
*                                                                  1276
*/* ATBUILD (ISTATCVT,ISTRPH)                                        */
*/* END OF ATBUILD                                                   */
*                                                                  1277
*         RFY                                                      1277
*          (GPR02P,                                                1277
*           GPR03P,                                                1277
*           GPR04P,                                                1277
*           GPR15P) RSTD;                                          1277
*         RFY                                                      1278
*          (GPR01P,                                                1278
*           GPR13P) RSTD;                                          1278
*         GENERATE REFS(GPR01P,GPR02P,GPR13P) SETS(RPHWORK);       1279
          STM GPR02P,GPR13P,RPHWORK(GPR01P)
*         RFY                                                      1280
*           GPR13P UNRSTD;                                         1280
*         GPR04P=SPTLCP;                                           1281
         L     GPR04P,SPTLCP(,PTRZCR)                              1281
*         DCL                                                      1282
*           1 FMZA0199 FIXED(31) STATIC LOCAL,                     1282
*            2 * FIXED(8) INIT(64),                                1282
*            2 * PTR(24) INIT(0);                                  1282
*         GPR03F=FMZA0199;                                         1283
         L     GPR03F,FMZA0199                                     1283
*         DO;                       /* LISATCVT                    1284
*                                      CVTBASE(PAGEABLE,(GPR15P))    */
*           GPR15P=ATCLCPTR;        /* SET UP ATCVT POINTER          */
         L     GPR15P,ATCLCPTR                                     1285
*         END;                      /* LISATCVT                      */
*         GPR02P=GPR15P->ATCBPDA;                                  1287
         L     GPR02P,ATCBPDA(,GPR15P)                             1287
*         GPR15P=GPR15P->ATCSMRS;                                  1288
         L     GPR15P,ATCSMRS(,GPR15P)                             1288
*         DCL                                                      1289
*           FMZL0199 BASED(GPR15P) LABEL VALUERANGE(*);            1289
*         CALL FMZL0199;                                           1290
         BALR  @14,@15                                             1290
*         RFY                                                      1291
*           GPR13P RSTD;                                           1291
*         GENERATE REFS(GPR01P,RPHWORK) SETS(GPR02P,GPR13P);       1292
          LM GPR02P,GPR13P,RPHWORK(GPR01P)
*         RFY                                                      1293
*          (GPR01P,                                                1293
*           GPR13P) UNRSTD;                                        1293
*         RFY                                                      1294
*          (GPR02P,                                                1294
*           GPR03P,                                                1294
*           GPR04P,                                                1294
*           GPR15P) UNRSTD;                                        1294
*       END;                        /* *********END OF RELSTORE    1295
*                                      EXPANSION*********            */
*                                                                  1295
*       /*************************************************************/
*       /*                                                           */
*       /*                                                   @ZA25404*/
*       /*                                                           */
*       /*************************************************************/
*                                                                  1296
*       GOTO KRUNCH;                /*                       @ZA25404*/
         B     KRUNCH                                              1296
*     END;                          /*                       @ZA25404*/
*   ELSE                            /*                       @ZA25404*/
*     IF SPTLCP^=PTRLCP THEN        /*                       @ZA25404*/
@RF01251 C     PTRLCP,SPTLCP(,PTRZCR)                              1298
         BE    @RF01298                                            1298
*       DO;                         /*                       @ZA25404*/
*         CALL SUB0CEC;             /* BUILDAFSB                     */
         BAL   @14,SUB0CEC                                         1300
*         GOTO KRUNCH;              /* CONTINUE CHECKING             */
         B     KRUNCH                                              1301
*       END;                        /* END ELDEST NOT ORIG. CLEAR    */
*     ELSE                                                         1303
*       ;                           /* ELDEST NOW ORIGINAL CLEAR     */
@RF01298 DS    0H                                                  1304
*   SPTFSB=ZCRSVWK3;                /* RESTORE FSB POINTER   @XM01601*/
*                                                                  1304
         L     @14,ZCRSVWK3(,PTRZCR)                               1304
         ST    @14,SPTFSB(,PTRZCR)                                 1304
*   /*****************************************************************/
*   /*                                                               */
*   /* SEGMENT(SEG0CEA)FINISH                                        */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1305
*   DO;                                                            1305
*     GOTO SEG0CEA#;                                               1306
         B     SEG0CEA#                                            1306
*SEG0CEA@:                                                         1307
*   END;                            /* END OF SUBROUTINE             */
*   END SUB00CE;                    /* END OF SUBROUTINE             */
         B     @EL00003                                            1308
         EJECT
*                                                                  1309
*/********************************************************************/
*/*                                                                  */
*/* SUBROUTINE-                                                      */
*/*      SUB0CEB                                                     */
*/*                                                                  */
*/* FUNCTION-                                                        */
*/*      CLEANS UP THE CLEAR SIDE QUEUE.                             */
*/*                                                                  */
*/* PARAMETERS-                                                      */
*/*      SPTLCP = A(LCPB) WITH SIDE QUEUE TO BE CLEARED.             */
*/*                                                                  */
*/********************************************************************/
*/* APAR OZ25404 DELETES THIS SUBROUTINE ITS FUNCTION WILL BE      1309
*   DONE ELSEWERE                                            @ZA25404
*SUB0CEB:                                                          1309
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);** AF1R0CEB: SUBROUTINE          */
*/* RFY                                                              */
*/*   PTRG14 RSTD;                  ** TO SAVE RETURN REGISTER       */
*/* ZCRSVF3=PTRG14;                 ** SAVE RETURN REGISTER          */
*/* RFY                                                              */
*/*   PTRG14 UNRSTD;                ** SAVED                         */
*/* ZCRSVWK1=PTRLCP;                ** SAVE POINTER FOR CALLER       **
*CEBMORE:                                                          1309
*   ;                               ** DO UNTIL SIMULATION           */
*/* ?TPDEQ(,SPTLCP->LCPRSTQH) RESET(YES) RETPTR(PTRLCP);   GET       */
*/*                                    ABSOLUTE OLDEST ELEMENT       */
*/* IF PTRLCP^=0 THEN                                                */
*/*   DO;                           ** IF ELEMENT FOUND              */
*/*     ZCRSVF7=SPTLCP;             ** SAVE ORIG ELEM PTR    @XA12201*/
*/*     SPTLCP=PTRLCP;              ** GET ADDR OF SIDE QUEUE ELEMENT*/
*/*                                                          @XA12201*/
*/*     CALL SUB0CEC;               ** BUILD COMMAND CLEARED FSB     */
*/*     SPTLCP=ZCRSVF7;             ** RESTORE ORIGINAL ELEMENT      */
*/*                                    POINTER               @XA12201*/
*/*     GOTO CEBMORE;               ** AND TRY AGAIN                 */
*/*   END;                          ** END ELEMENT FOUND             */
*/* ELSE                                                             */
*/*   ;                             ** SIDEQUEUE NOW EMPTY           **
*BUG01:                                                            1309
*   PTRLCP=ZCRSVWK1;                ** RESTORE POINTER FOR CALLER    */
*/* RFY                                                              */
*/*   PTRG14 RSTD;                  ** TO RESTORE RETURN REGISTER    **
*BUG02:                                                              */
*/* PTRG14=ZCRSVF3;                 ** RESTORE RETURN REGISTER       */
*/* RFY                                                              */
*/*   PTRG14 UNRSTD;                ** RESTORED                      */
*/* END SUB0CEB;                    ** END OF SUBROUTINE             */
*                                                                  1309
         EJECT
*                                                                  1309
*/********************************************************************/
*/*                                                                  */
*/* SUBROUTINE-                                                      */
*/*      SUB0CEC                                                     */
*/*                                                                  */
*/* FUNCTION-                                                        */
*/*      BUILD FSB FOR COMMAND CLEARED.                              */
*/*                                                                  */
*/********************************************************************/
*                                                                  1309
*SUB0CEC:                                                          1309
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);/* AF1R0CEC: SUBROUTINE          */
SUB0CEC  DS    0H                                                  1310
*   RFY                                                            1310
*     PTRG14 RSTD;                  /* TO SAVE RETURN REGISTER       */
*   ZCRSVF4=PTRG14;                 /* SAVE RETURN REGISTER          */
         ST    PTRG14,ZCRSVF4(,PTRZCR)                             1311
*   RFY                                                            1312
*     PTRG14 UNRSTD;                /* SAVED                         */
*   ZCRSVWK2=SPTFSB;                /* SAVE PARAMETER REGISTER       */
         L     @14,SPTFSB(,PTRZCR)                                 1313
         ST    @14,ZCRSVWK2(,PTRZCR)                               1313
*   CALL SUB0FNE;                   /* ALLOCATE BUFFER, ADDR FSB     */
         BAL   @14,SUB0FNE                                         1314
*   PTRG00=0;                       /* SET UNDEFINED RU CODE         */
         SLR   PTRG00,PTRG00                                       1315
*   CALL SUB000D;                   /* BUILDAFSB                     */
         BAL   @14,SUB000D                                         1316
*   FSBMJRCD=FRPURGE;               /* MAJOR=COMMAND CLEARED         */
         L     @14,SPTFSB(,PTRZCR)                                 1317
         MVI   FSBMJRCD(@14),X'1C'                                 1317
*   FSBMNRCD=LSCZMNRC;              /* MINOR=LSCB COPY       @XM01602*/
         MVC   FSBMNRCD(1,@14),LSCZMNRC(PTRLSC)                    1318
*   CALL SUB000E;                   /* QUEUE FSB TO REQUESTOR        */
         BAL   @14,SUB000E                                         1319
*BUG03:                                                            1320
*   SPTFSB=ZCRSVWK2;                /* RESTORE PARAMETER REGISTER    */
BUG03    L     @14,ZCRSVWK2(,PTRZCR)                               1320
         ST    @14,SPTFSB(,PTRZCR)                                 1320
*   RFY                                                            1321
*     PTRG14 RSTD;                  /* TO RESTORE RETURN REG         */
*BUG04:                                                            1322
*   PTRG14=ZCRSVF4;                 /* RESTORE RETURN REG            */
BUG04    L     PTRG14,ZCRSVF4(,PTRZCR)                             1322
*   RFY                                                            1323
*     PTRG14 UNRSTD;                /* RESTORED                      */
*   END SUB0CEC;                    /* END OF SUBROUTINE             */
@EL00004 DS    0H                                                  1324
@EF00004 DS    0H                                                  1324
@ER00004 BR    @14                                                 1324
         EJECT
*                                                                  1325
*/********************************************************************/
*/*                                                                  */
*/* SUBROUTINE-                                                      */
*/*      SUB000E                                                     */
*/*                                                                  */
*/* FUNCTION-                                                        */
*/*      QUEUE CLEAR FSB TO REQUESTOR.                               */
*/*                                                                  */
*/********************************************************************/
*                                                                  1325
*SUB000E:                                                          1325
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);/* AF1R000E: SUBROUTINE          */
SUB000E  DS    0H                                                  1326
*   RFY                                                            1326
*     PTRG14 RSTD;                  /* TO SAVE RETURN REGISTER       */
*   ZCRSVF5=PTRG14;                 /* SAVE RETURN REGISTER          */
         ST    PTRG14,ZCRSVF5(,PTRZCR)                             1327
*/*IF SPTLCP->LCPTYPE^=DCLTYPE THEN     IF THE LCPB IS NOT   @ZA28190*/
*                                                                  1328
*   IF SPTLCP->LCPFTYPE=LCRPHFT THEN                               1328
         L     @09,SPTLCP(,PTRZCR)                                 1328
         TM    LCPFTYPE(@09),B'10000000'                           1328
         BNO   @RF01328                                            1328
*     DO;                           /* IF RPH IN LCPB                */
*       SPTLCP->LCPRPHA->RPHWEA=SPTFSB;/* PLACE FSB ON RPH           */
         L     @09,LCPRPHA(,@09)                                   1330
         L     @08,SPTFSB(,PTRZCR)                                 1330
         ST    @08,RPHWEA(,@09)                                    1330
*/*TPPOST  (SPTLCP->LCPRPHA)                                         */
*                                                                  1331
*       DO;                         /* DECLARE AND RESTRICT REGS     */
*         RESPECIFY                                                1332
*          (GPR00F,                                                1332
*           GPR01F,                                                1332
*           GPR04F,                                                1332
*           GPR05F,                                                1332
*           GPR06F,                                                1332
*           GPR14F,                                                1332
*           GPR15F) RSTD;           /* 0,1,4,5,6,14, AND 15          */
*/* ATBUILD (ISTPAB,ISTDYPAB,ISTRPH)                                 */
*/* END OF ATBUILD                                                   */
*                                                                  1333
*         GEN REFS(GPR01P,GPR02F,GPR06F) SETS(RPHWORK);            1333
        STM GPR02F,GPR06F,RPHWORK(GPR01P)
*         GPR04F=SPTLCP->LCPRPHA;   /* LOAD RPH PNTR INTO REG 4      */
         L     @09,SPTLCP(,PTRZCR)                                 1334
         L     GPR04F,LCPRPHA(,@09)                                1334
*         RFY                                                      1335
*           GPR03F RSTD;                                           1335
*         GPR03F=0;                                                1336
         SLR   @09,@09                                             1336
         LR    GPR03F,@09                                          1336
*         DO;                       /* MODESET SAVEKEY(GPR06F)     1337
*                                      KEYADDR(GPR03F)             1337
*                                      WORKREG(GPR05F)               */
*           RESPECIFY                                              1338
*            (GPR02F) RESTRICTED;                                  1338
*           GPR05F=GPR02F;          /* SAVE REGISTER 2               */
         LR    GPR05F,GPR02F                                       1339
*           IPK;                    /* SAVE CURRENT PSW KEY          */
         IPK                                                       1340
*           GPR06F=GPR02F;                                         1341
         LR    GPR06F,GPR02F                                       1341
*           GPR02F=GPR05F;          /* RESTORE REGISTER 2            */
         LR    GPR02F,GPR05F                                       1342
*           SPKA(GPR03F);           /* SET PSW KEY                   */
         SPKA  0(GPR03F)                                           1343
*           RESPECIFY                                              1344
*            (GPR02F) UNRESTRICTED;                                1344
*         END;                      /* MODESET SAVEKEY(GPR06F)     1345
*                                      KEYADDR(GPR03F)             1345
*                                      WORKREG(GPR05F)               */
*         RFY                                                      1346
*           GPR03F UNRSTD;                                         1346
*         GPR05P=GPR04P->RPHMAJCB+GPR04P->RPHPABOF;/* LOAD REG 5 WITH
*                                      ADDR OF MAJOR CONTROL BLOCK 1347
*                                      PLUS OFFSET OF PAB IN BLOCK   */
         L     GPR05P,RPHMAJCB-1(,GPR04P)                          1347
         LA    GPR05P,0(,GPR05P)                                   1347
         SLR   @08,@08                                             1347
         IC    @08,RPHPABOF(,GPR04P)                               1347
         ALR   GPR05P,@08                                          1347
*         GPR14P=0;                 /* LOAD 0 INTO REG 14            */
         LR    GPR14P,@09                                          1348
*         GPR15P='FFFFFFFF'X;       /* LOAD REG 15 WITH DUMMY ADDRESS*/
         SLR   GPR15P,GPR15P                                       1349
         BCTR  GPR15P,0                                            1349
*         CS(GPR14P,GPR15P,GPR04P->RPHRESMA);/* COMPARE RESUME     1350
*                                      ADDRESS WITH 0 AND,IF EQUAL,
*                                      PUT DUMMY ADDRESS IN CONTROL
*                                      BLOCK RESUME ADDRESS          */
         CS    GPR14P,@15,RPHRESMA(GPR04P)                         1350
*         BC(8,FMZT0216);           /* IF EQUAL, BYPASS REMAINDER OF
*                                      EXPANSION                     */
         BC    8,FMZT0216                                          1351
*FMZL0216:                                                         1352
*         IF GPR04P->RPHWT='1'B THEN/* WT/EXT CONTENTION FLAG ON     */
FMZL0216 TM    RPHWT(GPR04P),B'00001000'                           1352
         BNO   @RF01352                                            1352
*           DO;                     /* IN RPH                        */
*             GPR14P=GPR04P->RPHRESMA×RPHWT1;/* LOAD REG 14 WITH FLAG
*                                      FIELD AND MAKE CERTAIN WT/EXT
*                                      CONTENTION FLAG STILL ON      */
         L     GPR14P,RPHRESMA(,GPR04P)                            1354
         O     GPR14P,@CF00690                                     1354
*             GPR15P=GPR14P×RPHPT1; /* LOAD REG 15 WITH FLAG FIELD 1355
*                                      AND TURN POST FLAG ON         */
         LR    GPR15P,GPR14P                                       1355
         O     GPR15P,@CF00694                                     1355
*             CS(GPR14P,GPR15P,GPR04P->RPHRESMA);/* COMPARE REG 14 1356
*                                      WITH FLAG FIELD--IF WT/EXT BIT
*                                      ON, TURN ON POST FLAG         */
         CS    GPR14P,@15,RPHRESMA(GPR04P)                         1356
*             BC(4,FMZL0216);       /* IF WT/EXT BIT WAS OFF, LOOP TO
*                                      TEST CONTENTION FLAG          */
         BC    4,FMZL0216                                          1357
*             BC(8,FMZT0216);       /* IF WT/EXT BIT WAS OFF, BRANCH
*                                      TO BYPASS CODE GEN            */
         BC    8,FMZT0216                                          1358
*           END;                    /* IF POST FLAG IS ON, FALL THRU
*                                      BOTTOM OF LOOP                */
*         ELSE                                                     1360
*           ;                       /* WT/EXT CONTENTION FLAG OFF    */
@RF01352 DS    0H                                                  1361
*         IF GPR04P->RPHTSKID=GPR01P->RPHTSKID THEN                1361
         CLC   RPHTSKID(4,GPR04P),RPHTSKID(GPR01P)                 1361
         BNE   @RF01361                                            1361
*           DO;                                                    1362
*             GPR05P->PABCHNGP=GPR01P->RPHPABQP;/* PUT PAB QUEUE   1363
*                                      ADDRESS IN SECOND WORD OF PAB */
         MVC   PABCHNGP(3,GPR05P),RPHPABQP(GPR01P)                 1363
*             GPR01P->RPHPABQP=GPR05P;/* PUT PAB ADDRESS (IN MAJOR 1364
*                                      CONTROL BLOCK) IN PAB QUEUE 1364
*                                      ADRESS IN RPH                 */
         STCM  GPR05P,7,RPHPABQP(GPR01P)                           1364
*           END;                                                   1365
*         ELSE                                                     1366
*           DO;                                                    1366
         B     @RC01361                                            1366
@RF01361 DS    0H                                                  1367
*             GPR00F=0;             /* SET REG 0 TO INDICATE ENA     */
         SLR   GPR00F,GPR00F                                       1367
*             DO;                   /* LISATCVT                    1368
*                                      CVTBASE(PAGEABLE,(GPR15P))    */
*               GPR15P=ATCLCPTR;    /* SET UP ATCVT POINTER          */
         L     GPR15P,ATCLCPTR                                     1369
*             END;                  /* LISATCVT PUT POINTER TO ATCVT
*                                      IN IN REG 15                  */
*             CALL GPR15P->ATCAP32; /* CALL ISTAPC32: TPSCHED        */
         L     @09,ATCAP32(,GPR15P)                                1371
         LR    @15,@09                                             1371
         BALR  @14,@15                                             1371
*           END;                                                   1372
*FMZT0216:                                                         1373
*         DO;                       /* MODESET KEYADDR(GPR06F)     1373
*                                      WORKREG(GPR05F)               */
@RC01361 DS    0H                                                  1373
FMZT0216 DS    0H                                                  1374
*           GPR05F=GPR06F;          /* GET KEY FORM SAVE LOCATION    */
         LR    GPR05F,GPR06F                                       1374
*           SPKA(GPR05F);           /* SET PSW KEY                   */
         SPKA  0(GPR05F)                                           1375
*         END;                      /* MODESET KEYADDR(GPR06F)     1376
*                                      WORKREG(GPR05F)               */
*         GEN REFS(GPR04P,RPHWORK) SETS(GPR02F,GPR03F,GPR04F,GPR05F,
*             GPR06F);                                             1377
        LM GPR02F,GPR06F,RPHWORK(GPR01P)
*         RESPECIFY                                                1378
*          (GPR00F,                                                1378
*           GPR01F,                                                1378
*           GPR04F,                                                1378
*           GPR05F,                                                1378
*           GPR06F,                                                1378
*           GPR14F,                                                1378
*           GPR15F) UNRSTD;         /* UNRESTRICT REGS 0,1, 4,5,14,
*                                      AND 15                        */
*       END;                        /* ***END OF TPPOST GENERATION***
*                                      POST RPH                      */
*     END;                          /* END RPH IN LCPB               */
*   ELSE                            /* NOT LCPB                      */
*/*  TPQUE (ADDR(ISTFSB),SPTLCP->LCPPABA->ISTPAB) NORM               */
*                                                                  1381
*     DO;                                                          1381
         B     @RC01328                                            1381
@RF01328 DS    0H                                                  1382
*       RFY                                                        1382
*        (GPR00P,                                                  1382
*         GPR01P,                                                  1382
*         GPR04P,                                                  1382
*         GPR05P,                                                  1382
*         GPR15P) RSTD;                                            1382
*       GEN REFS(GPR01P) SETS(RPHWORK)                             1383
*           (STM GPR02P,GPR08P,RPHWORK(GPR01P));                   1383
         STM GPR02P,GPR08P,RPHWORK(GPR01P)
*       GPR00P=0;                                                  1384
         SLR   GPR00P,GPR00P                                       1384
*       GPR15P=ADDR(SPTLCP->LCPPABA->ISTPAB);/* HOLD PAB PTR         */
         L     @09,SPTLCP(,PTRZCR)                                 1385
         L     GPR15P,LCPPABA(,@09)                                1385
*       GPR04P=ADDR(ISTFSB);        /* WORK ELE PTR                  */
         L     GPR04P,SPTFSB(,PTRZCR)                              1386
*       GPR05P=GPR15P;              /* PASS PAB PTR                  */
         LR    GPR05P,GPR15P                                       1387
*       CALL ATCLCPTR->ATCAP37->ISTAPC37;                          1388
         L     @09,ATCLCPTR                                        1388
         L     @15,ATCAP37(,@09)                                   1388
         BALR  @14,@15                                             1388
*       GEN(NOPR  0)                                               1389
*       NOSETS NOREFS;                                             1389
         NOPR  0
*       RFY                                                        1390
*        (GPR00P,                                                  1390
*         GPR01P,                                                  1390
*         GPR04P,                                                  1390
*         GPR05P,                                                  1390
*         GPR15P) UNRSTD;                                          1390
*     END;                          /* *** END OF TPQUE GENERATION 1391
*                                      QUEUE AND SCHEDULE PAB        */
*/*ELSE                                CNT LAYER LCPB        @ZA28190*/
*/*?TPQUE (ADDR(ISTFSB),FMCPAB2) NORM;      DRIVE CLIP       @ZA28190*/
*                                                                  1392
*   PTRG14=ZCRSVF5;                 /* RESTORE RETURN REGISTER       */
@RC01328 L     PTRG14,ZCRSVF5(,PTRZCR)                             1392
*   RFY                                                            1393
*     PTRG14 UNRSTD;                /* RESTORED                      */
*   END SUB000E;                    /* END OF SUBROUTINE             */
@EL00005 DS    0H                                                  1394
@EF00005 DS    0H                                                  1394
@ER00005 BR    @14                                                 1394
         EJECT
*                                                                  1395
*/********************************************************************/
*/*                                                                  */
*/* SUBROUTINE-                                                      */
*/*      SUB000F                                                     */
*/*                                                                  */
*/* FUNCTION-                                                        */
*/*      DEQUEUE LCPB FROM ASYNCH WAIT QUEUE.                        */
*/*                                                                  */
*/********************************************************************/
*                                                                  1395
*SUB000F:                                                          1395
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);/* AF1R000F: SUBROUTINE          */
SUB000F  DS    0H                                                  1396
*   RFY                                                            1396
*     PTRG14 RSTD;                  /* TO SAVE RETURN REGISTER       */
*   ZCRSVF5=PTRG14;                 /* SAVE RETURN REGISTER          */
         ST    PTRG14,ZCRSVF5(,PTRZCR)                             1397
*/* TPDEQ (,FMCLCPAQ) RETPTR(SPTLCP)RESET(YES)                       */
*                                                                  1398
*   DO;                             /* BEGIN TPDEQ CODE GENERATION   */
*     RFY                                                          1399
*      (GPR00P,                                                    1399
*       GPR01P,                                                    1399
*       GPR14P,                                                    1399
*       GPR15P) RSTD;                                              1399
*     GPR15P=ADDR(FMCLCPAQ);        /* ADDRESS QUEUE POINTER         */
         LA    GPR15P,FMCLCPAQ(,PTRFMC)                            1400
*     RFY                                                          1401
*      (GPR02P,                                                    1401
*       GPR03P) RSTD;                                              1401
*     STM(GPR02P,GPR03P,GPR01P->RPHWORK(5:12));                    1402
         STM   GPR02P,GPR03P,RPHWORK+4(GPR01P)                     1402
*     IF GPR15P->PABWEQA=PABWEQG1×GPR15P->PABWEQA=0 THEN           1403
         L     @09,PABWEQA(,GPR15P)                                1403
         CL    @09,@CF01681                                        1403
         BE    @RT01403                                            1403
         LTR   @09,@09                                             1403
         BNZ   @RF01403                                            1403
@RT01403 DS    0H                                                  1404
*       GPR14P=PABWEQG1;                                           1404
         L     GPR14P,@CF01681                                     1404
*     ELSE                                                         1405
*       DO;                                                        1405
         B     @RC01403                                            1405
@RF01403 DS    0H                                                  1406
*FMZL1234:                                                         1406
*         ;                                                        1406
FMZL1234 DS    0H                                                  1407
*         GPR14P=GPR15P->PABWEQA;                                  1407
         L     GPR14P,PABWEQA(,GPR15P)                             1407
*         IF GPR14P->WKECHAIN=PABWEQG1 THEN                        1408
         L     @09,@CF01681                                        1408
         CL    @09,WKECHAIN(,GPR14P)                               1408
         BNE   @RF01408                                            1408
*           DO;                                                    1409
*             IF GPR14P->FSBTYPE=FSTYPE×GPR14P->LCPRESET='0'B×GPR14P->
*                 LCPRSTQH=PABWEQG1 THEN                           1410
         CLI   FSBTYPE(GPR14P),X'02'                               1410
         BE    @RT01410                                            1410
         TM    LCPRESET(GPR14P),B'10000000'                        1410
         BZ    @RT01410                                            1410
         CL    @09,LCPRSTQH(,GPR14P)                               1410
         BNE   @RF01410                                            1410
@RT01410 DS    0H                                                  1411
*               DO;                                                1411
*                 GPR02P=PABWEQG1;                                 1412
         L     GPR02P,@CF01681                                     1412
*                 CS(GPR14P,GPR02P,GPR15P->PABWEQA);               1413
         CS    GPR14P,@02,PABWEQA(GPR15P)                          1413
*                 BC(7,FMZL1234);                                  1414
         BC    7,FMZL1234                                          1414
*                 GPR14P->WKECHAIN=0;                              1415
         SLR   @09,@09                                             1415
         ST    @09,WKECHAIN(,GPR14P)                               1415
*               END;                                               1416
*             ELSE                                                 1417
*               DO;                                                1417
         B     @RC01410                                            1417
@RF01410 DS    0H                                                  1418
*                 GPR15P=ADDR(GPR14P->LCPRSTQH);                   1418
         LA    GPR15P,LCPRSTQH(,GPR14P)                            1418
*                 GOTO FMZL1234;                                   1419
         B     FMZL1234                                            1419
*               END;                                               1420
*           END;                                                   1421
*         ELSE                                                     1422
*           DO;                                                    1422
         B     @RC01408                                            1422
@RF01408 DS    0H                                                  1423
*             GPR15P=ADDR(GPR14P->WKECHAIN);                       1423
         LA    GPR15P,WKECHAIN(,GPR14P)                            1423
*             GOTO FMZL1234;                                       1424
         B     FMZL1234                                            1424
*           END;                                                   1425
*       END;                                                       1426
@RC01408 DS    0H                                                  1427
*ISTA0234:                                                         1427
*     ;                                                            1427
@RC01403 DS    0H                                                  1427
ISTA0234 DS    0H                                                  1428
*     LM(GPR02P,GPR03P,GPR01P->RPHWORK(5:12));                     1428
         LM    GPR02P,GPR03P,RPHWORK+4(GPR01P)                     1428
*     RFY                                                          1429
*      (GPR02P,                                                    1429
*       GPR03P) UNRSTD;                                            1429
*     GPR14P=GPR14P&FMZCB038;                                      1430
         N     GPR14P,@CF02493                                     1430
*     SPTLCP=GPR14P;                                               1431
         ST    GPR14P,SPTLCP(,PTRZCR)                              1431
*     RFY                                                          1432
*      (GPR00P,                                                    1432
*       GPR01P,                                                    1432
*       GPR14P,                                                    1432
*       GPR15P) UNRSTD;                                            1432
*   END;                            /* END TPDEQ GENERATION REMOVE 1433
*                                      FROM QUE              @ZA25404*/
*   PTRG14=ZCRSVF5;                 /* RESTORE RETURN REGISTER       */
         L     PTRG14,ZCRSVF5(,PTRZCR)                             1434
*   RFY                                                            1435
*     PTRG14 UNRSTD;                /* RESTORED                      */
*   END SUB000F;                    /* END OF SUBROUTINE             */
@EL00006 DS    0H                                                  1436
@EF00006 DS    0H                                                  1436
@ER00006 BR    @14                                                 1436
         EJECT
*                                                                  1437
*/********************************************************************/
*/*                                                                  */
*/* SUBROUTINE-                                                      */
*/*      SUB000G                                                     */
*/*                                                                  */
*/* FUNCTION-                                                        */
*/*      REMOVE CURRENT ELEMENT FROM ATOP.                           */
*/*                                                                  */
*/********************************************************************/
*                                                                  1437
*SUB000G:                                                          1437
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);/* AF1R000G: SUBROUTINE          */
SUB000G  DS    0H                                                  1438
*   RFY                                                            1438
*     PTRG14 RSTD;                  /* TO SAVE RETURN REGISTER       */
*   ZCRSVF5=PTRG14;                 /* SAVE RETURN REGISTER          */
         ST    PTRG14,ZCRSVF5(,PTRZCR)                             1439
*/* TPDEQ (PTRLCP,FMCPAB5) RESET(YES)                                */
*                                                                  1440
*   DO;                             /* BEGIN TPDEQ CODE GENERATION   */
*     RFY                                                          1441
*      (GPR00P,                                                    1441
*       GPR01P,                                                    1441
*       GPR14P,                                                    1441
*       GPR15P) RSTD;                                              1441
*     GPR15P=ADDR(FMCPAB5);         /* ADDRESS QUEUE POINTER         */
         LA    GPR15P,FMCPAB5(,PTRFMC)                             1442
*     RFY                                                          1443
*      (GPR02P,                                                    1443
*       GPR03P) RSTD;                                              1443
*     STM(GPR02P,GPR03P,GPR01P->RPHWORK(5:12));                    1444
         STM   GPR02P,GPR03P,RPHWORK+4(GPR01P)                     1444
*     GPR03P=PTRLCP×FMZCA038;                                      1445
         L     @09,@CF01681                                        1445
         LR    GPR03P,PTRLCP                                       1445
         OR    GPR03P,@09                                          1445
*     GPR14P=FMZCA038;                                             1446
         LR    GPR14P,@09                                          1446
*     GPR15P=ADDR(GPR15P->PABWEQA);                                1447
*FMZL1241:                                                         1448
*     ;                                                            1448
FMZL1241 DS    0H                                                  1449
*     GPR02P=GPR15P->PABWEQA×FMZCA038;                             1449
         L     GPR02P,PABWEQA(,GPR15P)                             1449
         O     GPR02P,@CF01681                                     1449
*     DO WHILE(GPR02P^=GPR14P);                                    1450
         B     @DE01450                                            1450
@DL01450 DS    0H                                                  1451
*FMZL2241:                                                         1451
*       ;                                                          1451
FMZL2241 DS    0H                                                  1452
*       IF GPR02P=GPR03P THEN                                      1452
         CR    GPR02P,GPR03P                                       1452
         BNE   @RF01452                                            1452
*         DO;                                                      1453
*           GPR00P=GPR02P->WKECHAIN;                               1454
         L     GPR00P,WKECHAIN(,GPR02P)                            1454
*           CS(GPR02P,GPR00P,GPR15P->PABWEQA);                     1455
         CS    GPR02P,@00,PABWEQA(GPR15P)                          1455
*           BC(7,FMZL3241);                                        1456
         BC    7,FMZL3241                                          1456
*           GPR14P=GPR02P;                                         1457
         LR    GPR14P,GPR02P                                       1457
*           GPR14P->WKECHAIN=0;                                    1458
         SLR   @09,@09                                             1458
         ST    @09,WKECHAIN(,GPR14P)                               1458
*         END;                                                     1459
*       ELSE                                                       1460
*         DO;                                                      1460
         B     @RC01452                                            1460
@RF01452 DS    0H                                                  1461
*           IF(GPR02P->WKECHAIN)=GPR14P THEN                       1461
         C     GPR14P,WKECHAIN(,GPR02P)                            1461
         BNE   @RF01461                                            1461
*             DO;                                                  1462
*               IF GPR02P->FSBTYPE=FSTYPE THEN                     1463
         CLI   FSBTYPE(GPR02P),X'02'                               1463
         BNE   @RF01463                                            1463
*                 DO;                                              1464
*                   GPR02P=GPR14P;                                 1465
         LR    GPR02P,GPR14P                                       1465
*                   GOTO FMZL3241;                                 1466
         B     FMZL3241                                            1466
*                 END;                                             1467
*               GPR15P=ADDR(GPR02P->LCPRSTQH);                     1468
@RF01463 LA    GPR15P,LCPRSTQH(,GPR02P)                            1468
*               GOTO FMZL1241;                                     1469
         B     FMZL1241                                            1469
*             END;                                                 1470
*           ELSE                                                   1471
*             DO;                                                  1471
@RF01461 DS    0H                                                  1472
*               GPR15P=ADDR(GPR02P->WKECHAIN);                     1472
         LA    GPR15P,WKECHAIN(,GPR02P)                            1472
*               GPR02P=GPR02P->WKECHAIN;                           1473
         L     GPR02P,WKECHAIN(,GPR02P)                            1473
*               GOTO FMZL2241;                                     1474
         B     FMZL2241                                            1474
*             END;                                                 1475
*         END;                                                     1476
*FMZL3241:                                                         1477
*       ;                                                          1477
@RC01452 DS    0H                                                  1477
FMZL3241 DS    0H                                                  1478
*     END;                                                         1478
@DE01450 CR    GPR02P,GPR14P                                       1478
         BNE   @DL01450                                            1478
*ISTA0241:                                                         1479
*     ;                                                            1479
ISTA0241 DS    0H                                                  1480
*     LM(GPR02P,GPR03P,GPR01P->RPHWORK(5:12));                     1480
         LM    GPR02P,GPR03P,RPHWORK+4(GPR01P)                     1480
*     RFY                                                          1481
*      (GPR02P,                                                    1481
*       GPR03P) UNRSTD;                                            1481
*     GPR14P=GPR14P&FMZCB038;                                      1482
         N     GPR14P,@CF02493                                     1482
*     GPR01P->RPHWEA=GPR14P;                                       1483
         ST    GPR14P,RPHWEA(,GPR01P)                              1483
*     RFY                                                          1484
*      (GPR00P,                                                    1484
*       GPR01P,                                                    1484
*       GPR14P,                                                    1484
*       GPR15P) UNRSTD;                                            1484
*   END;                            /* END TPDEQ GENERATION REMOVE 1485
*                                      CURRENT ATOP ELEMENT  @ZA12769*/
*   SPTLCP=PTRLCP;                  /* SAVE LCPB POINTER             */
         ST    PTRLCP,SPTLCP(,PTRZCR)                              1486
*   PTRG14=ZCRSVF5;                 /* RESTORE RETURN POINTER        */
         L     PTRG14,ZCRSVF5(,PTRZCR)                             1487
*   RFY                                                            1488
*     PTRG14 UNRSTD;                /* RESTORED                      */
*   END SUB000G;                    /* END OF SUBROUTINE             */
@EL00007 DS    0H                                                  1489
@EF00007 DS    0H                                                  1489
@ER00007 BR    @14                                                 1489
@PB00007 DS    0H                                                  1490
         EJECT
*                                                                  1490
*/***********************************************************@XM01548*/
*/*                                                          @XM01548*/
*/* SEGMENT-                                                 @XM01548*/
*/*      SEGDEQF                                             @XM01548*/
*/*                                                          @XM01548*/
*/* FUNCTION-                                                @XM01548*/
*/*      REMOVE FSB FROM ATOP.                               @XM01548*/
*/*                                                          @XM01548*/
*/***********************************************************@XM01548*/
*                                                                  1490
*   /*****************************************************************/
*   /*                                                               */
*   /* SEGMENT(SEGDEQF)START                                         */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1490
*   DO;                                                            1490
*     GOTO SEGDEQF@;                                               1491
         B     SEGDEQF@                                            1491
*SEGDEQF:                                                          1492
*   END;                            /* AF1RDEQF: SUBROUTINE  @XM01548*/
SEGDEQF  DS    0H                                                  1493
*/* TPDEQ (PTRLCP,FMCPAB5) RESET(YES)                                */
*                                                                  1493
*   DO;                             /* BEGIN TPDEQ CODE GENERATION   */
*     RFY                                                          1494
*      (GPR00P,                                                    1494
*       GPR01P,                                                    1494
*       GPR14P,                                                    1494
*       GPR15P) RSTD;                                              1494
*     GPR15P=ADDR(FMCPAB5);         /* ADDRESS QUEUE POINTER         */
         LA    GPR15P,FMCPAB5(,PTRFMC)                             1495
*     RFY                                                          1496
*      (GPR02P,                                                    1496
*       GPR03P) RSTD;                                              1496
*     STM(GPR02P,GPR03P,GPR01P->RPHWORK(5:12));                    1497
         STM   GPR02P,GPR03P,RPHWORK+4(GPR01P)                     1497
*     GPR03P=PTRLCP×FMZCA038;                                      1498
         L     @09,@CF01681                                        1498
         LR    GPR03P,PTRLCP                                       1498
         OR    GPR03P,@09                                          1498
*     GPR14P=FMZCA038;                                             1499
         LR    GPR14P,@09                                          1499
*     GPR15P=ADDR(GPR15P->PABWEQA);                                1500
*FMZL1249:                                                         1501
*     ;                                                            1501
FMZL1249 DS    0H                                                  1502
*     GPR02P=GPR15P->PABWEQA×FMZCA038;                             1502
         L     GPR02P,PABWEQA(,GPR15P)                             1502
         O     GPR02P,@CF01681                                     1502
*     DO WHILE(GPR02P^=GPR14P);                                    1503
         B     @DE01503                                            1503
@DL01503 DS    0H                                                  1504
*FMZL2249:                                                         1504
*       ;                                                          1504
FMZL2249 DS    0H                                                  1505
*       IF GPR02P=GPR03P THEN                                      1505
         CR    GPR02P,GPR03P                                       1505
         BNE   @RF01505                                            1505
*         DO;                                                      1506
*           GPR00P=GPR02P->WKECHAIN;                               1507
         L     GPR00P,WKECHAIN(,GPR02P)                            1507
*           CS(GPR02P,GPR00P,GPR15P->PABWEQA);                     1508
         CS    GPR02P,@00,PABWEQA(GPR15P)                          1508
*           BC(7,FMZL3249);                                        1509
         BC    7,FMZL3249                                          1509
*           GPR14P=GPR02P;                                         1510
         LR    GPR14P,GPR02P                                       1510
*           GPR14P->WKECHAIN=0;                                    1511
         SLR   @09,@09                                             1511
         ST    @09,WKECHAIN(,GPR14P)                               1511
*         END;                                                     1512
*       ELSE                                                       1513
*         DO;                                                      1513
         B     @RC01505                                            1513
@RF01505 DS    0H                                                  1514
*           IF(GPR02P->WKECHAIN)=GPR14P THEN                       1514
         C     GPR14P,WKECHAIN(,GPR02P)                            1514
         BNE   @RF01514                                            1514
*             DO;                                                  1515
*               IF GPR02P->FSBTYPE=FSTYPE THEN                     1516
         CLI   FSBTYPE(GPR02P),X'02'                               1516
         BNE   @RF01516                                            1516
*                 DO;                                              1517
*                   GPR02P=GPR14P;                                 1518
         LR    GPR02P,GPR14P                                       1518
*                   GOTO FMZL3249;                                 1519
         B     FMZL3249                                            1519
*                 END;                                             1520
*               GPR15P=ADDR(GPR02P->LCPRSTQH);                     1521
@RF01516 LA    GPR15P,LCPRSTQH(,GPR02P)                            1521
*               GOTO FMZL1249;                                     1522
         B     FMZL1249                                            1522
*             END;                                                 1523
*           ELSE                                                   1524
*             DO;                                                  1524
@RF01514 DS    0H                                                  1525
*               GPR15P=ADDR(GPR02P->WKECHAIN);                     1525
         LA    GPR15P,WKECHAIN(,GPR02P)                            1525
*               GPR02P=GPR02P->WKECHAIN;                           1526
         L     GPR02P,WKECHAIN(,GPR02P)                            1526
*               GOTO FMZL2249;                                     1527
         B     FMZL2249                                            1527
*             END;                                                 1528
*         END;                                                     1529
*FMZL3249:                                                         1530
*       ;                                                          1530
@RC01505 DS    0H                                                  1530
FMZL3249 DS    0H                                                  1531
*     END;                                                         1531
@DE01503 CR    GPR02P,GPR14P                                       1531
         BNE   @DL01503                                            1531
*ISTA0249:                                                         1532
*     ;                                                            1532
ISTA0249 DS    0H                                                  1533
*     LM(GPR02P,GPR03P,GPR01P->RPHWORK(5:12));                     1533
         LM    GPR02P,GPR03P,RPHWORK+4(GPR01P)                     1533
*     RFY                                                          1534
*      (GPR02P,                                                    1534
*       GPR03P) UNRSTD;                                            1534
*     GPR14P=GPR14P&FMZCB038;                                      1535
         N     GPR14P,@CF02493                                     1535
*     GPR01P->RPHWEA=GPR14P;                                       1536
         ST    GPR14P,RPHWEA(,GPR01P)                              1536
*     RFY                                                          1537
*      (GPR00P,                                                    1537
*       GPR01P,                                                    1537
*       GPR14P,                                                    1537
*       GPR15P) UNRSTD;                                            1537
*   END;                            /* END TPDEQ GENERATION REMOVE 1538
*                                      CURRENT ATOP FSB @XM01548,  1538
*                                                            @ZA12769*/
*   SPTLCP=PTRLCP;                  /* SAVE LCPB POINTER     @XM01548*/
*                                                                  1539
         ST    PTRLCP,SPTLCP(,PTRZCR)                              1539
*   /*****************************************************************/
*   /*                                                               */
*   /* SEGMENT(SEGDEQF)FINISH                                        */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1540
*   DO;                                                            1540
*     GOTO SEGDEQF#;                                               1541
         B     SEGDEQF#                                            1541
*SEGDEQF@:                                                         1542
*   END;                            /* END OF SEGMENT        @XM01548*/
         EJECT
*                                                                  1543
*/********************************************************************/
*/*                                                                  */
*/* SUBROUTINE-                                                      */
*/*      SUB000H                                                     */
*/*                                                                  */
*/* FUNCTION-                                                        */
*/*      QUEUE LCPB TO ASYNCHRONOUT WAIT QUEUE.                      */
*/*                                                                  */
*/********************************************************************/
*                                                                  1543
*SUB000H:                                                          1543
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);/* AF1R000H: SUBROUTINE          */
         B     @PB00008                                            1543
SUB000H  DS    0H                                                  1544
*   RFY                                                            1544
*     PTRG14 RSTD;                  /* TO SAVE RETURN REGISTER       */
*   ZCRSVF5=PTRG14;                 /* SAVED                         */
         ST    PTRG14,ZCRSVF5(,PTRZCR)                             1545
*/*  TPQUE (PTRLCP,FMCLCPAQ)                                         */
*                                                                  1546
*   DO;                                                            1546
*     RFY                                                          1547
*      (GPR00P,                                                    1547
*       GPR01P,                                                    1547
*       GPR02P,                                                    1547
*       GPR14P,                                                    1547
*       GPR15P) RSTD;                                              1547
*     GEN REFS(GPR01P) SETS(RPHWORK)(STM GPR02P,GPR08P,RPHWORK(GPR01P))
*         ;                                                        1548
         STM GPR02P,GPR08P,RPHWORK(GPR01P)
*     GPR15P=PTRLCP;                /* GET WORK ELEM POINTER         */
         LR    GPR15P,PTRLCP                                       1549
*     GPR14P=ADDR(FMCLCPAQ);        /* ADDRESS PAB/QUEUE POINTER     */
         LA    GPR14P,FMCLCPAQ(,PTRFMC)                            1550
*     GPR15P=GPR15P×PABWEQG1;                                      1551
         O     GPR15P,@CF01681                                     1551
*     GPR02P=GPR14P->PABWEQA;       /* INITIALIZE WITH QUEUE HEADER  */
         L     GPR02P,PABWEQA(,GPR14P)                             1552
*CMZA0257:                                                         1553
*     ;                             /* CS FAIL TARGET                */
CMZA0257 DS    0H                                                  1554
*     GPR00P=GPR02P;                /* SAVE QUEUE CONTENTS           */
         LR    GPR00P,GPR02P                                       1554
*     GPR15P->PABCHAIN=GPR02P×PABWEQG1;/* FORWARD CHAIN WORK ELEMENT */
         LR    @09,GPR02P                                          1555
         O     @09,@CF01681                                        1555
         ST    @09,PABCHAIN(,GPR15P)                               1555
*     CS(GPR02P,GPR15P,GPR14P->PABWEQA);/* CHECK FOR END OF QUEUE    */
         CS    GPR02P,@15,PABWEQA(GPR14P)                          1556
*     BC(7,CMZA0257);                                              1557
         BC    7,CMZA0257                                          1557
*     GEN REFS(RPHWORK,GPR01P) NOSETS                              1558
*         (LM    GPR02P,GPR08P,RPHWORK(GPR01P));                   1558
         LM    GPR02P,GPR08P,RPHWORK(GPR01P)
*     RFY                                                          1559
*      (GPR00P,                                                    1559
*       GPR01P,                                                    1559
*       GPR02P,                                                    1559
*       GPR14P,                                                    1559
*       GPR15P) UNRSTD;                                            1559
*   END;                            /* *** END OF TPQUE GENERATION 1560
*                                      QUEUE LCPB TO AWAITQ          */
*   PTRG14=ZCRSVF5;                 /* RESTORE RETURN POINTER        */
         L     PTRG14,ZCRSVF5(,PTRZCR)                             1561
*   RFY                                                            1562
*     PTRG14 UNRSTD;                /* RESTORED                      */
*   END SUB000H;                    /* END OF SUBROUTINE             */
@EL00008 DS    0H                                                  1563
@EF00008 DS    0H                                                  1563
@ER00008 BR    @14                                                 1563
         EJECT
*                                                                  1564
*/********************************************************************/
*/*                                                                  */
*/* SUBROUTINE-                                                      */
*/*      SUB0BCA                                                     */
*/*                                                                  */
*/* FUNCTION-                                                        */
*/*      PERFORM NOTIFY FUNCTION.                                    */
*/*                                                                  */
*/********************************************************************/
*                                                                  1564
*SUB0BCA:                                                          1564
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);/* AF1R-BCA: SUBROUTINE          */
SUB0BCA  DS    0H                                                  1565
*   RFY                                                            1565
*     PTRG14 RSTD;                  /* TO SAVE RETURN POINTER        */
*   ZCRSVF5=PTRG14;                 /* SAVED                         */
         ST    PTRG14,ZCRSVF5(,PTRZCR)                             1566
*   ZCRPCOD1=0;                     /* ALLOCATE A FSB PARAMETER      */
         MVI   ZCRPCOD1(PTRZCR),X'00'                              1567
*   ZCRPFSB='1'B;                   /* ALLOCATE A FSB PARAMETER      */
         OI    ZCRPFSB(PTRZCR),B'00100000'                         1568
*   CALL ATCZPSVT->ZPSZDFA0;        /* ALLOCATE A FSB ROUTINE        */
         L     @09,ATCZPSVT(,PTRATC)                               1569
         L     @15,ZPSZDFA0(,@09)                                  1569
         BALR  @14,@15                                             1569
*   MVECTOR->FSBMJRCD=FRNOTIFY;     /* MAJOR=NOTIFY                  */
         L     @09,MVECTOR(,PTRRPH)                                1570
         MVI   FSBMJRCD(@09),X'30'                                 1570
*   MVECTOR->FSBMNRCD=SPTLCP->LCPMNRCD;/* MINOR=FROM LCPB            */
         L     @08,SPTLCP(,PTRZCR)                                 1571
         MVC   FSBMNRCD(1,@09),LCPMNRCD(@08)                       1571
*   MVECTOR->FSBSAF=FMCSAF;         /* SAF COPIED FROM FMCB          */
         MVC   FSBSAF(2,@09),FMCSAF(PTRFMC)                        1572
*   MVECTOR->FSBDAF=NCBDAF;         /* DAF COPIED FROM DNCB          */
         MVC   FSBDAF(2,@09),NCBDAF(PTRDNC)                        1573
*/*  TPQUE (MVECTOR,FMCSIPA->ISTPAB) NORM                            */
*                                                                  1574
*   DO;                                                            1574
*     RFY                                                          1575
*      (GPR00P,                                                    1575
*       GPR01P,                                                    1575
*       GPR04P,                                                    1575
*       GPR05P,                                                    1575
*       GPR15P) RSTD;                                              1575
*     GEN REFS(GPR01P) SETS(RPHWORK)(STM GPR02P,GPR08P,RPHWORK(GPR01P))
*         ;                                                        1576
         STM GPR02P,GPR08P,RPHWORK(GPR01P)
*     GPR00P=0;                                                    1577
         SLR   GPR00P,GPR00P                                       1577
*     GPR15P=ADDR(FMCSIPA->ISTPAB); /* HOLD PAB PTR                  */
         L     GPR15P,FMCSIPA(,PTRFMC)                             1578
*     GPR04P=MVECTOR;               /* WORK ELE PTR                  */
         L     GPR04P,MVECTOR(,PTRRPH)                             1579
*     GPR05P=GPR15P;                /* PASS PAB PTR                  */
         LR    GPR05P,GPR15P                                       1580
*     CALL ATCLCPTR->ATCAP37->ISTAPC37;                            1581
         L     @09,ATCLCPTR                                        1581
         L     @15,ATCAP37(,@09)                                   1581
         BALR  @14,@15                                             1581
*     GEN(NOPR  0)                                                 1582
*     NOSETS NOREFS;                                               1582
         NOPR  0
*     RFY                                                          1583
*      (GPR00P,                                                    1583
*       GPR01P,                                                    1583
*       GPR04P,                                                    1583
*       GPR05P,                                                    1583
*       GPR15P) UNRSTD;                                            1583
*   END;                            /* *** END OF TPQUE GENERATION 1584
*                                      QUEUE FSB TO SIP              */
*   PTRG14=ZCRSVF5;                 /* RESTORE RETURN POINTER        */
         L     PTRG14,ZCRSVF5(,PTRZCR)                             1585
*   RFY                                                            1586
*     PTRG14 UNRSTD;                /* RESTORED                      */
*   END SUB0BCA;                    /* END OF SUBROUTINE             */
@EL00009 DS    0H                                                  1587
@EF00009 DS    0H                                                  1587
@ER00009 BR    @14                                                 1587
         EJECT
*                                                                  1588
*/********************************************************************/
*/*                                                                  */
*/* SUBROUTINE-                                                      */
*/*      SUB000D                                                     */
*/*                                                                  */
*/* FUNCTION-                                                        */
*/*      BUILD A RESPONSE FSB                                        */
*/*                                                                  */
*/********************************************************************/
*                                                                  1588
*SUB000D:                                                          1588
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);/* AF1R000D: SUBROUTINE          */
SUB000D  DS    0H                                                  1589
*   RFY                                                            1589
*     PTRG14 RSTD;                  /* TO SAVE RETURN REGISTER       */
*   ZCRSVF5=PTRG14;                 /* SAVE RETURN REGISTER          */
         ST    PTRG14,ZCRSVF5(,PTRZCR)                             1590
*   FSBTYPE=FSTYPE;                 /* SET FSB TYPE                  */
         L     @09,SPTFSB(,PTRZCR)                                 1591
         MVI   FSBTYPE(@09),X'02'                                  1591
*   FSBLNGTH=LENGTH(ISTFSB);        /* SET FSB LENGTH                */
         MVI   FSBLNGTH(@09),X'2C'                                 1592
*   FSBELI='1'B;                    /* END OF LCPB                   */
*   FSBECI='1'B;                    /* END OF LCCW (COMMAND)         */
         OI    FSBELI(@09),B'11000000'                             1594
*   FSBDAF=NCBDAF;                  /* SET DAF FROM DNCB             */
         MVC   FSBDAF(2,@09),NCBDAF(PTRDNC)                        1595
*   FSBSAF=FMCSAF;                  /* SET SAF FROM FMCB             */
         MVC   FSBSAF(2,@09),FMCSAF(PTRFMC)                        1596
*   FSBLCPB=SPTLCP;                 /* SET LCPB POINTER              */
         L     @08,SPTLCP(,PTRZCR)                                 1597
         ST    @08,FSBLCPB(,@09)                                   1597
*   FSBLCCWA=SPTLCP->LCPNXLCW;      /* SET LCCW POINTER              */
         L     @08,LCPNXLCW(,@08)                                  1598
         ST    @08,FSBLCCWA(,@09)                                  1598
*   FMCOASN=FMCOASN+1;              /* INCREMENT SEQUENCE CTR        */
         LA    @09,1                                               1599
         LH    @08,FMCOASN(,PTRFMC)                                1599
         N     @08,@CF04690                                        1599
         ALR   @08,@09                                             1599
         STH   @08,FMCOASN(,PTRFMC)                                1599
*   FSBSEQID=FMCOASN;               /* SET SEQUENCE COUNTER          */
         L     @08,SPTFSB(,PTRZCR)                                 1600
         MVC   FSBSEQID(2,@08),FMCOASN(PTRFMC)                     1600
*   SRUQSREQ=PTRG00;                /* SET RESPONSE CODE             */
         STC   PTRG00,SRUQSREQ+68(,PTRZIB)                         1601
*   FDBDATAA=ADDR(BTUTEXT);         /* ADDRESS TEXT                  */
         AL    @08,@CF00363                                        1602
         LA    @09,BTUTEXT+48(,PTRZIB)                             1602
         ST    @09,FDBDATAA(,@08)                                  1602
*   FDBDATCT=1;                     /* SET DATA COUNT=1              */
         LA    @09,1                                               1603
         STH   @09,FDBDATCT(,@08)                                  1603
*   FDBOFSET=DZIBFDBS;              /* SET FDB OFFSET        @DC35830*/
         L     @09,DZIBFDBS                                        1604
         STH   @09,FDBOFSET(,@08)                                  1604
*   PTRG14=ADDR(SPTLCP->LCPNXLCW->LCCWDATA);/* GET ADDRESS OF LCCW 1605
*                                      DATA                  @XM07083*/
         L     @09,SPTLCP(,PTRZCR)                                 1605
         L     @09,LCPNXLCW(,@09)                                  1605
         LA    PTRG14,LCCWDATA(,@09)                               1605
*   IF SPTLCP->LCPNXLCW->LCCWIDAT='1'B THEN                        1606
         TM    LCCWIDAT(@09),B'00001000'                           1606
         BO    @RT01606                                            1606
*     ;                             /* IF IMMEDIATE DATA     @XM07083*/
*   ELSE                            /* NOT IMMEDIATE DATA    @XM07083*/
*     PTRG14=PTRG14->INDIRECT;      /* ADDRESS RH FROM LCCW  @XM07083*/
         L     PTRG14,INDIRECT(,PTRG14)                            1608
*   FSBRHFLD=PTRG14->ISTRH;         /* COPY RH FROM LCCW     @XM07083*/
@RT01606 L     @09,SPTFSB(,PTRZCR)                                 1609
         MVC   FSBRHFLD(3,@09),ISTRH(PTRG14)                       1609
*BUG06:                                                            1610
*   RHQS='1'B;                      /* SET RH AS RESPONSE            */
BUG06    L     @09,SPTFSB(,PTRZCR)                                 1610
         OI    RHQS+17(@09),B'10000000'                            1610
*BUG07:                                                            1611
*   RHFME='1'B;                     /* SET FUNCTION MANAGEMENT END   */
BUG07    L     @09,SPTFSB(,PTRZCR)                                 1611
         OI    RHFME+17(@09),B'10000000'                           1611
*BUG08:                                                            1612
*   FSBTHFLD=THASYRES;              /* SET ASYNCHRONOUS RESPONSE     */
BUG08    L     @09,SPTFSB(,PTRZCR)                                 1612
         MVC   FSBTHFLD(2,@09),@CB01544                            1612
*BUG09:                                                            1613
*   FSBTHCNT=LENGTH(ISTRH)+1;       /* SET TH COUNT                  */
BUG09    L     @09,SPTFSB(,PTRZCR)                                 1613
         MVC   FSBTHCNT(2,@09),@CH00073                            1613
*   PTRG14=ZCRSVF5;                 /* RESTORE RETURN REGISTER       */
         L     PTRG14,ZCRSVF5(,PTRZCR)                             1614
*   RFY                                                            1615
*     PTRG14 UNRSTD;                /* RESTORED                      */
*   END SUB000D;                    /* END OF SUBROUTINE             */
@EL00010 DS    0H                                                  1616
@EF00010 DS    0H                                                  1616
@ER00010 BR    @14                                                 1616
         EJECT
*                                                                  1617
*/********************************************************************/
*/*                                                                  */
*/* SEGMENT-                                                         */
*/*      SEG0BAA                                                     */
*/*                                                                  */
*/* FUNCTION-                                                        */
*/*      BUILD SET MODE PIU.                                         */
*/*                                                                  */
*/********************************************************************/
*                                                                  1617
*SUB0BAA:                                                          1617
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);/* AF1R0BAA: SUBROUTINE          */
SUB0BAA  DS    0H                                                  1618
*   RFY                                                            1618
*     PTRG14 RSTD;                  /* TO SAVE RETURN REGISTER       */
*   ZCRSVF5=PTRG14;                 /* SAVE RETURN REGISTER          */
         ST    PTRG14,ZCRSVF5(,PTRZCR)                             1619
*   RFY                                                            1620
*     PTRG14 UNRSTD;                /* SAVED                         */
*   ZCRSVWK5=PTRG00;                /* SAVE PARAMETER REGISTER     1621
*                                                            @X50BHFZ*/
         ST    PTRG00,ZCRSVWK5(,PTRZCR)                            1621
*   ZCRPCOD1=0;                     /* ZERO PARM FLAGS               */
         MVI   ZCRPCOD1(PTRZCR),X'00'                              1622
*   ZCRPLSBF='1'B;                  /* SET ALLOCATION PARAMETERS     */
         OI    ZCRPLSBF(PTRZCR),B'00010000'                        1623
*   CALL ATCZPSVT->ZPSZDFA0;        /* GO GET LSCB WITH BUFF         */
         L     @14,ATCZPSVT(,PTRATC)                               1624
         L     @15,ZPSZDFA0(,@14)                                  1624
         BALR  @14,@15                                             1624
*   MVECTOR->LSCLCPBA=PTRLCP;       /* INIT LSCB LCPB ADDR           */
         L     @14,MVECTOR(,PTRRPH)                                1625
         ST    PTRLCP,LSCLCPBA(,@14)                               1625
*   MVECTOR->LSCLCCWA=LCPNXLCW;     /* INIT LSCB LCCW ADDR           */
         L     @09,LCPNXLCW(,PTRLCP)                               1626
         ST    @09,LSCLCCWA(,@14)                                  1626
*   RFY                                                            1627
*     ISTZOBUF BASED(MVECTOR->LSCFDBA);                            1627
*   RFY                                                            1628
*     ISTBTU BASED(ADDR(ZOBBTU));                                  1628
*   RFY                                                            1629
*     ISTFDB BASED(ADDR(ZOBFDB));                                  1629
*   ZOBLNG2=ZOBLNG1;                /* COPY BUFFER LENGTH            */
         L     @14,LSCFDBA(,@14)                                   1630
         LH    @09,ZOBLNG1(,@14)                                   1630
         N     @09,@CF04690                                        1630
         STH   @09,ZOBLNG2(,@14)                                   1630
*   FDBDATAA=ADDR(ZOBBTU);          /* SET START OF TEXT POINTER     */
         LA    @09,ZOBBTU(,@14)                                    1631
         ST    @09,FDBDATAA(,@14)                                  1631
*   BTUFID='0E00'X;                 /* INIT TRANSMISSION HEADER      */
         LA    @09,28                                              1632
         ALR   @09,@14                                             1632
         MVC   BTUFID(2,@09),@CB04669                              1632
*   BTURH=0;                        /* INIT REQUEST HEADER           */
         SLR   @08,@08                                             1633
         STCM  @08,15,BTURH(@09)                                   1633
*   BTUSORCE=FMCSAF;                /* INIT BTU SAF                  */
         MVC   BTUSORCE(2,@09),FMCSAF(PTRFMC)                      1634
*   BTUDEST=NCBDAF;                 /* INIT BTU DAF                  */
         MVC   BTUDEST(2,@09),NCBDAF(PTRDNC)                       1635
*   BTUZRT03='1'B;                  /* SET ON LOOK AT FMCB STATE     */
         OI    BTUZRT03(@09),B'00010000'                           1636
*   IF PROCFTX='1'B THEN                                           1637
         TM    PROCFTX+48(PTRFMC),B'00000001'                      1637
         BNO   @RF01637                                            1637
*     ZOBRT06='1'B;                 /* COPY CRITICAL TEXT FLAG     1638
*                                                            @XM09248*/
         OI    ZOBRT06(@14),B'10000000'                            1638
*   IF NCBFTRIO='1'B THEN                                          1639
@RF01637 CLI   NCBFTRIO(PTRDNC),1                                  1639
         BNE   @RF01639                                            1639
*     ZOBRT08='1'B;                 /* COPY I/O TRACE FLAG   @XM09248*/
         L     @14,MVECTOR(,PTRRPH)                                1640
         L     @14,LSCFDBA(,@14)                                   1640
         OI    ZOBRT08(@14),B'01000000'                            1640
*   DCL                                                            1641
*     SEQ1FMC DEFINED FMCSEQ1 CHAR(1);                             1641
@RF01639 DS    0H                                                  1642
*   MVN(BTUREQ(2),SEQ1FMC);         /* SET REQTAG IN BTU             */
         L     @14,MVECTOR(,PTRRPH)                                1642
         LA    @09,28                                              1642
         AL    @09,LSCFDBA(,@14)                                   1642
         MVN   BTUREQ+1(1,@09),SEQ1FMC(PTRFMC)                     1642
*   MVECTOR->LSCREQTG=BTUREQ;       /* SET REQTAG IN LSCB    @ZA15142*/
         MVC   LSCREQTG(2,@14),BTUREQ(@09)                         1643
*   FMCSEQ1=FMCSEQ1+1;              /* UP FMCB SEQUENCE COUNT        */
         LA    @14,1                                               1644
         SLR   @09,@09                                             1644
         IC    @09,FMCSEQ1(,PTRFMC)                                1644
         ALR   @14,@09                                             1644
         STC   @14,FMCSEQ1(,PTRFMC)                                1644
*   IF FMCSEQ1>='10'X THEN                                         1645
         CLI   FMCSEQ1(PTRFMC),16                                  1645
         BL    @RF01645                                            1645
*     FMCSEQ1=1;                    /* IF OVERFLOW, RESET IT         */
         MVI   FMCSEQ1(PTRFMC),X'01'                               1646
*   BDUCOMND=BCMDZ;                 /* SET BDU COMMAND TO CONTROL    */
@RF01645 L     @14,MVECTOR(,PTRRPH)                                1647
         L     @14,LSCFDBA(,@14)                                   1647
         LA    @09,42                                              1647
         ALR   @09,@14                                             1647
         MVI   BDUCOMND(@09),X'08'                                 1647
*   IF ZCRSVWK5=0 THEN                                             1648
         L     @08,ZCRSVWK5(,PTRZCR)                               1648
         LTR   @08,@08                                             1648
         BNZ   @RF01648                                            1648
*     DO;                           /* IS ENTRY FOR SET MODE?      1649
*                                                            @X50BHFZ*/
*       BDUMODIF=BMODZSMM;          /* SET BDU MODIF= SET MODE       */
         MVI   BDUMODIF(@09),X'9A'                                 1650
*       IF DEVINPUT='0'B THEN                                      1651
         TM    DEVINPUT+36(PTRDNC),B'10000000'                     1651
         BNZ   @RF01651                                            1651
*         DO;                       /* IS DEV OUTPUT ONLY?   @XM08645*/
*           BTUTEXT(1:2)=ISTPROCD(2:3);/* SET PROCESSING OPTIONS     */
         AL    @14,@CF02143                                        1653
         MVC   BTUTEXT(2,@14),ISTPROCD+49(PTRFMC)                  1653
*           BTUDCF=(ADDR(BTUTEXT)-ADDR(BTURH))+2;/* INITIALIZE DATA
*                                      COUNT                         */
         LA    @09,BTUTEXT(,@14)                                   1654
         LA    @08,BTURH(,@14)                                     1654
         SLR   @09,@08                                             1654
         AL    @09,@CF00037                                        1654
         STH   @09,BTUDCF(,@14)                                    1654
*         END;                      /* END OUTPUT ONLY DEVICE        */
*       ELSE                                                       1656
*         DO;                       /* NOT OUTPUT ONLY               */
         B     @RC01651                                            1656
@RF01651 DS    0H                                                  1657
*           BTUTEXT(1:3)=ISTPROCD(2:4);/* SET PROCESSING OPTIONS     */
         L     @14,MVECTOR(,PTRRPH)                                1657
         LA    @09,28                                              1657
         AL    @09,LSCFDBA(,@14)                                   1657
         MVC   BTUTEXT(3,@09),ISTPROCD+49(PTRFMC)                  1657
*           BTUTEXT(3)=BTUTEXT(3)&PROSANDC;/* CLEAR READ CONTINUOUS
*                                      FLAG                          */
         NI    BTUTEXT+2(@09),X'7F'                                1658
*           BTUDCF=(ADDR(BTUTEXT)-ADDR(BTURH))+3;/* INITIALIZE DATA
*                                      COUNT                         */
         LA    @14,BTUTEXT(,@09)                                   1659
         LA    @08,BTURH(,@09)                                     1659
         SLR   @14,@08                                             1659
         AL    @14,@CF00312                                        1659
         STH   @14,BTUDCF(,@09)                                    1659
*         END;                      /* END NOT OUTPUT ONLY           */
*     END;                          /* END SET MODE PROCESSING       */
*   ELSE                                                           1662
*     DO;                           /* ENTRY FOR BHSET DESELECT    1662
*                                                            @X50BHFZ*/
         B     @RC01648                                            1662
@RF01648 DS    0H                                                  1663
*       BDUMODIF=BMODZBHM;          /* SET MODIF=BHSET ASSOC         */
         L     @14,MVECTOR(,PTRRPH)                                1663
         L     @14,LSCFDBA(,@14)                                   1663
         MVI   BDUMODIF+42(@14),X'8D'                              1663
*       BTUDCF=(ADDR(BTUTEXT)-ADDR(BTURH))+1;/* INITIALIZE DATA COUNT*/
         AL    @14,@CF02143                                        1664
         LA    @09,BTUTEXT(,@14)                                   1664
         LA    @08,BTURH(,@14)                                     1664
         SLR   @09,@08                                             1664
         AL    @09,@CF00035                                        1664
         STH   @09,BTUDCF(,@14)                                    1664
*       BTUTEXT(1)='A0'X;           /* BUILD DEACTIVATE CTL BYTE     */
         MVI   BTUTEXT(@14),X'A0'                                  1665
*     END;                          /* END BLOCK HANDLER PROCESS     */
*   FDBDATCT=BTUDCF+DISBTURH;       /* SET FDB DATA COUNT FOR LENGTH
*                                      OF TH,RH,RU TO BE SHIPPED OUT */
@RC01648 L     @14,MVECTOR(,PTRRPH)                                1667
         L     @14,LSCFDBA(,@14)                                   1667
         LH    @09,BTUDCF+28(,@14)                                 1667
         N     @09,@CF04690                                        1667
         AL    @09,DISBTURH                                        1667
         STH   @09,FDBDATCT(,@14)                                  1667
*   DNCZF002='1'B;                  /* SET DNCB DIALOG IN PROGRESS   */
         OI    DNCZF002(PTRDNC),B'00000010'                        1668
*   DNCZV002=PTRFMC;                /* INIT DIALG SCHED FMCB ADDR    */
         STCM  PTRFMC,7,DNCZV002(PTRDNC)                           1669
*   IF FMCZF007='1'B THEN                                          1670
         TM    FMCZF007(PTRFMC),B'00000100'                        1670
         BNO   @RF01670                                            1670
*     DNCZF007='1'B;                /* SET BUFFER TRACE ACTIVE       */
         OI    DNCZF007(PTRDNC),B'00010000'                        1671
*   ELSE                                                           1672
*     DNCZF007='0'B;                /* IN DNCB SAME AS FMCB          */
         B     @RC01670                                            1672
@RF01670 NI    DNCZF007(PTRDNC),B'11101111'                        1672
*/*  TPQUE (MVECTOR,FMCSHEDQ)                                        */
*                                                                  1673
*   DO;                                                            1673
@RC01670 DS    0H                                                  1674
*     RFY                                                          1674
*      (GPR00P,                                                    1674
*       GPR01P,                                                    1674
*       GPR02P,                                                    1674
*       GPR14P,                                                    1674
*       GPR15P) RSTD;                                              1674
*     GEN REFS(GPR01P) SETS(RPHWORK)(STM GPR02P,GPR08P,RPHWORK(GPR01P))
*         ;                                                        1675
         STM GPR02P,GPR08P,RPHWORK(GPR01P)
*     GPR15P=MVECTOR;               /* GET WORK ELEM POINTER         */
         L     GPR15P,MVECTOR(,PTRRPH)                             1676
*     GPR14P=ADDR(FMCSHEDQ);        /* ADDRESS PAB/QUEUE POINTER     */
         LA    GPR14P,FMCSHEDQ(,PTRFMC)                            1677
*     GPR15P=GPR15P×PABWEQG1;                                      1678
         O     GPR15P,@CF01681                                     1678
*     GPR02P=GPR14P->PABWEQA;       /* INITIALIZE WITH QUEUE HEADER  */
         L     GPR02P,PABWEQA(,GPR14P)                             1679
*CMZA0269:                                                         1680
*     ;                             /* CS FAIL TARGET                */
CMZA0269 DS    0H                                                  1681
*     GPR00P=GPR02P;                /* SAVE QUEUE CONTENTS           */
         LR    GPR00P,GPR02P                                       1681
*     GPR15P->PABCHAIN=GPR02P×PABWEQG1;/* FORWARD CHAIN WORK ELEMENT */
         LR    @09,GPR02P                                          1682
         O     @09,@CF01681                                        1682
         ST    @09,PABCHAIN(,GPR15P)                               1682
*     CS(GPR02P,GPR15P,GPR14P->PABWEQA);/* CHECK FOR END OF QUEUE    */
         CS    GPR02P,@15,PABWEQA(GPR14P)                          1683
*     BC(7,CMZA0269);                                              1684
         BC    7,CMZA0269                                          1684
*     GEN REFS(RPHWORK,GPR01P) NOSETS                              1685
*         (LM    GPR02P,GPR08P,RPHWORK(GPR01P));                   1685
         LM    GPR02P,GPR08P,RPHWORK(GPR01P)
*     RFY                                                          1686
*      (GPR00P,                                                    1686
*       GPR01P,                                                    1686
*       GPR02P,                                                    1686
*       GPR14P,                                                    1686
*       GPR15P) UNRSTD;                                            1686
*   END;                            /* *** END OF TPQUE GENERATION 1687
*                                      QUEUE LSCB WITH CTL BTU TO  1687
*                                      SCHED Q                       */
*   FMCZX003=FMCZX003+1;            /* INCREMT LSCB COUNT            */
         LA    @14,1                                               1688
         SLR   @09,@09                                             1688
         IC    @09,FMCZX003(,PTRFMC)                               1688
         ALR   @14,@09                                             1688
         STC   @14,FMCZX003(,PTRFMC)                               1688
*   FMCZF002='1'B;                  /* SET I/O SCHED SUSPENDED       */
         OI    FMCZF002(PTRFMC),B'01000000'                        1689
*   PTRG15=4;                       /* SET RETURN CODE               */
         LA    PTRG15,4                                            1690
*   RFY                                                            1691
*     PTRG14 RSTD;                  /* TO RESTORE RETURN REGISTER    */
*   PTRG14=ZCRSVF5;                 /* RESTORE RETURN REGISTER       */
         L     PTRG14,ZCRSVF5(,PTRZCR)                             1692
*   RFY                                                            1693
*     PTRG14 UNRSTD;                /* RESTORED                      */
*   END SUB0BAA;                    /* END OF SUBROUTINE             */
@EL00011 DS    0H                                                  1694
@EF00011 DS    0H                                                  1694
@ER00011 BR    @14                                                 1694
         EJECT
*                                                                  1695
*/********************************************************************/
*/*                                                                  */
*/* SUBROUTINE-                                                      */
*/*      SUB0FNE                                                     */
*/*                                                                  */
*/* FUNCTION-                                                        */
*/*      ALLOCATE A BUFFER AND ADDRESS FSB IN BUFFER.                */
*/*                                                                  */
*/* PARAMETERS-                                                      */
*/*      **NONE**                                                    */
*/*                                                                  */
*/* RETURNS-                                                         */
*/*      PTRZXB = ADDRESS OF BUFFER.                                 */
*/*      SPTFSB = ADDRESS OF FSB IN BUFFER.                          */
*/*                                                                  */
*/********************************************************************/
*                                                                  1695
*SUB0FNE:                                                          1695
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);/* AF1R0FNE: SUBROUTINE          */
SUB0FNE  DS    0H                                                  1696
*   RFY                                                            1696
*     PTRG14 RSTD;                  /* TO SAVE RETURN REGISTER       */
*   ZCRSVF6=PTRG14;                 /* SAVE RETURN REGISTER          */
         ST    PTRG14,ZCRSVF6(,PTRZCR)                             1697
*   ZCRPCOD1=ZCPBUF;                /* DFA0 - PAGEABLE BUFFER REQD   */
         MVI   ZCRPCOD1(PTRZCR),X'04'                              1698
*   CALL ATCZPSVT->ZPSZDFA0;        /* ALLOCATE A PAGEABLE BUFFER    */
         L     @09,ATCZPSVT(,PTRATC)                               1699
         L     @15,ZPSZDFA0(,@09)                                  1699
         BALR  @14,@15                                             1699
*   PTRZIB=MVECTOR;                 /* ADDRESS ALLOCATED BUFFER      */
         L     PTRZIB,MVECTOR(,PTRRPH)                             1700
*   SPTFSB=ADDR(ZIBFSB);            /* ADDRESS FSB           @DC35830*/
         LA    @09,ZIBFSB(,PTRZIB)                                 1701
         ST    @09,SPTFSB(,PTRZCR)                                 1701
*   PTRG14=ZCRSVF6;                 /* RESTORE RETURN REGISTER       */
         L     PTRG14,ZCRSVF6(,PTRZCR)                             1702
*   RFY                                                            1703
*     PTRG14 UNRSTD;                /* RESTORED                      */
*   END SUB0FNE;                    /* END OF SUBROUTINE             */
@EL00012 DS    0H                                                  1704
@EF00012 DS    0H                                                  1704
@ER00012 BR    @14                                                 1704
@PB00012 DS    0H                                                  1705
*/* TPEPILOG                                                         */
*                                                                  1705
*   GEN(PRINT OFF);                                                1705
         PRINT OFF
*/* TEMPLATE FOR CHAIN FIELD OF WORK ELEMENT */                    1706
*DCL  1  ISTWKE BDY(WORD) BASED(WKEPTR),                           1706
*        2  * CHAR(4),                 /* SPACE                       *
*        2  WKECHAIN PTR(31),          /* CHAIN POINTER               *
*           3 WKEFLAGS BIT(8),         /* FLAGS                       *
*             4 WKEGATE  BIT(1),       /* GATE BIT                    *
*             4 *        BIT(7),       /* RESERVED                    *
*           3 WKECHNGP PTR(24);        /* PTR ADDRESS                 *
*   DCL                                                            1707
*     ISTAPC34 ENTRY BASED(ATCAP34) VALRG(*);/* RESET ROUTINE        */
*   DCL                                                            1708
*     ISTAPC37 ENTRY BASED(ATCAP37) VALRG(*);/* TPQUE ROUTINE        */
*   GEN(PRINT ON);                                                 1709
*                                                                  1709
         PRINT ON
*/* END OF TPEPILOG                                                  */
*                                                                  1710
*   END ISTZAF1R                    /* THUS ENDETH ISTZAF1R          */
*                                                                  1710
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */
*/*%INCLUDE SYSLIB  (IECDIOSB)                                       */
*/*%INCLUDE SYSLIB  (IHASRB  )                                       */
*/*%INCLUDE SYSLIB  (IHAPSA  )                                       */
*                                                                  1710
*       ;                                                          1710
@EL00001 DS    0H                                                  1710
@EF00001 DS    0H                                                  1710
@ER00001 BR    @14                                                 1710
@DATA    DS    0H
@CH00073 DC    H'4'
@CH01279 DC    H'172'
@DATD    DSECT
         DS    0F
ISTZAF1R CSECT
         DS    0F
@CF00035 DC    F'1'
@CF00037 DC    F'2'
@CF00312 DC    F'3'
@CF00071 DC    F'8'
@CH00071 EQU   @CF00071+2
@CF02143 DC    F'28'
@CF00363 DC    F'32'
@CF00690 DC    XL4'08000000'
@CF00694 DC    XL4'04000000'
@CF01681 DC    XL4'80000000'
@CF02493 DC    XL4'7FFFFFFF'
@CF04406 DC    XL4'00FFFFFF'
@CF04690 DC    XL4'0000FFFF'
@CF04694 DC    BL4'00000010000000000000000000000000'
@CF04700 DC    BL4'11111101111111111111111111111111'
@DATD    DSECT
         DS    0D
IOSBPTR  DS    A
SRBPTR   DS    A
LCPBPTR  DS    A
BDUPTR   DS    A
BTUPTR   DS    A
DNCBPTR  DS    A
FMCBPTR  DS    A
FSBPTR   DS    A
WKEPTR   DS    A
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA
@ENDDATD EQU   *
ISTZAF1R CSECT
         DS    0F
@SIZDATD DC    AL1(0)
         DC    AL3(@ENDDATD-@DATD)
         DS    0D
DZIBFDBS DC    AL4(ZIBFDBS-ISTZIBUF)
DISBTURH DC    AL4(BTURH-ISTBTU)
FMZA0118 DS    FL4
         ORG   FMZA0118
@NM00114 DC    AL1(184)
@NM00115 DC    AL3(0)
         ORG   FMZA0118+4
FMZA0166 DS    FL4
         ORG   FMZA0166
@NM00116 DC    AL1(64)
@NM00117 DC    AL3(0)
         ORG   FMZA0166+4
FMZA0183 DS    FL4
         ORG   FMZA0183
@NM00118 DC    AL1(64)
@NM00119 DC    AL3(0)
         ORG   FMZA0183+4
FMZA0199 DS    FL4
         ORG   FMZA0199
@NM00120 DC    AL1(64)
@NM00121 DC    AL3(0)
         ORG   FMZA0199+4
@CC04477 DC    C'AC1R'
@CB01673 DC    X'10000020'
@CB01580 DC    X'938000'
@CB01544 DC    X'1F00'
@CB04669 DC    X'0E00'
         DS    CL1
WAZOO    DS    CL16
         ORG   WAZOO
@NM00105 DC    X'2B'
@NM00106 DC    B'01000000'
@NM00107 DC    AL2(0)
@NM00108 DC    A(0)
@NM00109 DC    X'23'
@NM00110 DC    B'00000000'
@NM00111 DC    AL2(0)
@NM00112 DC    A(0)
         ORG   WAZOO+16
@00      EQU   00                      EQUATES FOR REGISTERS 0-15
@01      EQU   01
@02      EQU   02
@03      EQU   03
@04      EQU   04
@05      EQU   05
@06      EQU   06
@07      EQU   07
@08      EQU   08
@09      EQU   09
@10      EQU   10
@11      EQU   11
@12      EQU   12
@13      EQU   13
@14      EQU   14
@15      EQU   15
RPHPTR   EQU   @01
GPR00F   EQU   @00
GPR00P   EQU   @00
GPR01F   EQU   @01
GPR01P   EQU   @01
GPR02F   EQU   @02
GPR02P   EQU   @02
GPR03F   EQU   @03
GPR03P   EQU   @03
GPR04F   EQU   @04
GPR04P   EQU   @04
GPR05F   EQU   @05
GPR05P   EQU   @05
GPR06F   EQU   @06
GPR06P   EQU   @06
GPR07P   EQU   @07
GPR08P   EQU   @08
GPR09P   EQU   @09
GPR10P   EQU   @10
GPR11P   EQU   @11
GPR12P   EQU   @12
GPR13P   EQU   @13
GPR14F   EQU   @14
GPR14P   EQU   @14
GPR15F   EQU   @15
GPR15P   EQU   @15
PTRG00   EQU   @00
PTRRPH   EQU   @01
PTRATC   EQU   @02
PTRICN   EQU   @03
PTRDNC   EQU   @04
PTRFMC   EQU   @05
PTRZIB   EQU   @06
PTRZOB   EQU   @06
PTRLCP   EQU   @07
PTRLSC   EQU   @07
PTRG07   EQU   @07
PTRG08   EQU   @08
PTRG09   EQU   @09
PTRZCR   EQU   @10
PTRG11   EQU   @11
PTRG12   EQU   @12
PTRG13   EQU   @13
PTRG14   EQU   @14
PTRG15   EQU   @15
GPR07F   EQU   @07
GPR08F   EQU   @08
GPR09F   EQU   @09
GPR10F   EQU   @10
GPR11F   EQU   @11
GPR12F   EQU   @12
GPR13F   EQU   @13
PSA      EQU   0
FLCRNPSW EQU   PSA
FLCROPSW EQU   PSA+8
FLCICCW2 EQU   PSA+16
PSAEEPSW EQU   PSA+132
PSAESPSW EQU   PSA+136
FLCSVILC EQU   PSAESPSW+1
PSAEPPSW EQU   PSA+140
FLCPIILC EQU   PSAEPPSW+1
FLCPICOD EQU   PSAEPPSW+2
PSAPICOD EQU   FLCPICOD+1
FLCTEA   EQU   PSAEPPSW+4
FLCPER   EQU   PSA+152
FLCMCLA  EQU   PSA+168
FLCIOEL  EQU   FLCMCLA+4
FLCIOA   EQU   FLCMCLA+16
FLCFSA   EQU   FLCMCLA+80
PSASUPER EQU   PSA+552
PSASUP1  EQU   PSASUPER
PSASUP2  EQU   PSASUPER+1
PSASUP3  EQU   PSASUPER+2
PSASUP4  EQU   PSASUPER+3
PSACLHT  EQU   PSA+640
PSALKSA  EQU   PSA+696
PSAHLHI  EQU   PSA+760
PSADSSFL EQU   PSA+836
PSADSSF1 EQU   PSADSSFL
PSADSSF3 EQU   PSADSSFL+2
PSADSSF4 EQU   PSADSSFL+3
PSARSVT  EQU   PSA+896
ATCLCPTR EQU   1032
IOSB     EQU   0
IOSFLA   EQU   IOSB
IOSACHN  EQU   IOSFLA
IOSFLB   EQU   IOSB+1
IOSFLC   EQU   IOSB+2
IOSDVALT EQU   IOSFLC
IOSPKEY  EQU   IOSB+12
IOSOPT   EQU   IOSB+14
IOSOPT2  EQU   IOSB+15
@NM00002 EQU   IOSB+20
IOSCSW   EQU   @NM00002+1
IOSTATUS EQU   IOSCSW+3
IOSIPIB  EQU   IOSB+44
IOSPATH  EQU   IOSB+86
IOSCHN   EQU   IOSPATH
IOSCKEY  EQU   IOSB+89
IOSEEKA  EQU   IOSB+100
IOSCCHH  EQU   IOSEEKA+3
IOSSKHH  EQU   IOSCCHH+2
SRBSECT  EQU   0
SRBFLC   EQU   SRBSECT+12
ISTZPSVT EQU   0
ZPSZDFA0 EQU   ISTZPSVT
ZPSZDFH0 EQU   ISTZPSVT+12
ZPSZDFB0 EQU   ISTZPSVT+16
ISTZFSVT EQU   0
ZFSZEFBB EQU   ISTZFSVT
ZFSZEABB EQU   ZFSZEFBB
ZFSZEFAB EQU   ISTZFSVT+4
ZFSZEAAB EQU   ZFSZEFAB
ISTRPH   EQU   0
RPHCNTL  EQU   ISTRPH
RPHFLAGS EQU   RPHCNTL+2
RPHAPTYP EQU   RPHFLAGS
RPHFSTLC EQU   RPHFLAGS
RPHFLGB  EQU   RPHCNTL+3
RPHRPHA  EQU   ISTRPH+4
RPHTSKID EQU   ISTRPH+8
RPHRESMA EQU   ISTRPH+16
RPHWPFLG EQU   RPHRESMA
RPHWT    EQU   RPHWPFLG
RPHPABOF EQU   ISTRPH+20
RPHMAJCB EQU   ISTRPH+21
RPHWEA   EQU   ISTRPH+24
RPHCSPA  EQU   RPHWEA
RPHSRPRM EQU   ISTRPH+28
RPHCRR   EQU   ISTRPH+32
RPHPABQA EQU   ISTRPH+36
RPHPABQP EQU   RPHPABQA+1
RPHWORK  EQU   ISTRPH+40
RPHSAVE1 EQU   RPHWORK
RPHSBITS EQU   RPHSAVE1+1
ISTZSAVE EQU   0
ZSAZSVBC EQU   ISTZSAVE
ZSAZSVMS EQU   ZSAZSVBC
ZSAZSVFC EQU   ISTZSAVE+4
ISTLCCW  EQU   0
LCCWOP   EQU   ISTLCCW
LCCWRWOP EQU   LCCWOP
LCCWCTL  EQU   LCCWRWOP
LCCWFLAG EQU   ISTLCCW+1
LCCWIDAT EQU   LCCWFLAG
LCCWLSI  EQU   LCCWFLAG
LCCWCNT  EQU   ISTLCCW+2
LCCWDATA EQU   ISTLCCW+4
ISTLCPB  EQU   0
LCPTYPE  EQU   ISTLCPB
LCPLNGTH EQU   ISTLCPB+1
LCPREQTG EQU   ISTLCPB+2
LCPFLAGS EQU   LCPREQTG
LCPZF001 EQU   LCPFLAGS
LCPZRT02 EQU   LCPZF001
LCPZF002 EQU   LCPFLAGS
LCPZRT03 EQU   LCPZF002
LCPZF003 EQU   LCPFLAGS
LCPZRT04 EQU   LCPZF003
LCPZF004 EQU   LCPFLAGS
LCPZRT05 EQU   LCPZF004
LCPZRT06 EQU   LCPFLAGS
LCPZRT07 EQU   LCPFLAGS
LCPMNRCD EQU   LCPREQTG+1
LCPZRT08 EQU   LCPMNRCD
LCPZRT09 EQU   LCPMNRCD
LCPCHAIN EQU   ISTLCPB+4
LCPCHAI1 EQU   LCPCHAIN
LCPCHAI2 EQU   LCPCHAIN+1
LCPRUCNT EQU   ISTLCPB+8
LCPZMIRC EQU   LCPRUCNT
LCPFLAG2 EQU   ISTLCPB+9
LCPTLBPI EQU   LCPFLAG2
LCPFID0  EQU   LCPFLAG2
LCPATOP  EQU   LCPFLAG2
LCPSEQ   EQU   ISTLCPB+10
LCPCID   EQU   ISTLCPB+16
LCPNXLCW EQU   ISTLCPB+20
LCPFDBA  EQU   ISTLCPB+24
LCPFLG1  EQU   ISTLCPB+37
LCPRESET EQU   LCPFLG1
LCPINTER EQU   LCPFLG1
LCPFLCCW EQU   ISTLCPB+40
LCPCLREP EQU   ISTLCPB+44
LCPLCCW  EQU   ISTLCPB+48
LCPRSTQH EQU   LCPLCCW
LCPPABA  EQU   LCPLCCW+4
LCPRPHA  EQU   LCPPABA
LCPFTYPE EQU   LCPRPHA
ISTZCRR  EQU   0
ZCRCRR   EQU   ISTZCRR
ZCRID    EQU   ZCRCRR
ZCRLEN   EQU   ZCRCRR+1
ZCRCHAIN EQU   ISTZCRR+4
ZCRFRRA  EQU   ISTZCRR+8
ZCRFLGS1 EQU   ISTZCRR+12
ZCRFLGS2 EQU   ISTZCRR+13
ZCRSWFLD EQU   ISTZCRR+14
ZCRENDSH EQU   ZCRSWFLD
ZCREXTYP EQU   ZCRSWFLD
ZCRNDLCP EQU   ZCRSWFLD
ZCRRESET EQU   ZCRSWFLD
ZCRFLGS3 EQU   ISTZCRR+15
ZCRGENSW EQU   ISTZCRR+16
ZCRTSW1  EQU   ZCRGENSW
ZCRTSW2  EQU   ZCRGENSW
ZCRPFLGS EQU   ISTZCRR+17
ZCRIBPR  EQU   ISTZCRR+18
ZCRSCPSW EQU   ISTZCRR+19
ZCRCRLCP EQU   ISTZCRR+20
ZCRPARMS EQU   ISTZCRR+24
ZCRFBPTR EQU   ZCRPARMS
ZCRDFRDA EQU   ZCRPARMS+10
ZCRPCOD1 EQU   ZCRPARMS+12
ZCRPFSB  EQU   ZCRPCOD1
ZCRPLSBF EQU   ZCRPCOD1
ZCRPCOD2 EQU   ZCRPARMS+13
ZCRSVRTN EQU   ISTZCRR+56
ZCRSVF1  EQU   ZCRSVRTN
ZCRSVF2  EQU   ZCRSVRTN+4
ZCRSVF4  EQU   ZCRSVRTN+12
ZCRSVF5  EQU   ZCRSVRTN+16
ZCRSVF6  EQU   ZCRSVRTN+20
ZCRWKARA EQU   ISTZCRR+156
ZCRSVWK2 EQU   ZCRWKARA+4
ZCRSVWK3 EQU   ZCRWKARA+8
ZCRSVWK4 EQU   ZCRWKARA+12
ZCRSVWK5 EQU   ZCRWKARA+16
ZCROPCDE EQU   ISTZCRR+183
ZCRCIDSV EQU   ISTZCRR+192
ZCRSAVEZ EQU   ISTZCRR+196
ZCRAUDIT EQU   ISTZCRR+440
ZCRTID   EQU   ZCRAUDIT
ZCRTNAME EQU   ZCRAUDIT+1
ZCRENTER EQU   ZCRAUDIT+5
ZCREAC1R EQU   ZCRENTER+16
ZCRLCPB  EQU   ISTZCRR+480
ZCRRHRU  EQU   ZCRLCPB
ISTBDU   EQU   0
BDUCOMND EQU   ISTBDU
BDUMODIF EQU   ISTBDU+1
BDUMOD1  EQU   BDUMODIF
BDUDAF   EQU   ISTBDU+2
BDUFUNC  EQU   BDUDAF
BDUCHECK EQU   BDUFUNC
BDUFLAGS EQU   BDUDAF+1
ISTBTU   EQU   0
BTUBTH   EQU   ISTBTU
BTUFID   EQU   BTUBTH
BTUDEST  EQU   BTUBTH+2
BTUSORCE EQU   BTUBTH+4
BTUREQ   EQU   BTUBTH+6
BTURQFLG EQU   BTUREQ
BTUZRT03 EQU   BTURQFLG
BTUDCF   EQU   BTUBTH+8
BTURH    EQU   BTUBTH+10
BTUBDU   EQU   ISTBTU+14
BTUSYSTR EQU   ISTBTU+18
BTUTEXT  EQU   ISTBTU+20
ISTTH    EQU   0
THFLAG1  EQU   ISTTH
THFLGA   EQU   THFLAG1
THMPF    EQU   THFLGA
THFLGB   EQU   THFLAG1+1
ISTTH2   EQU   0
TH2FLAG1 EQU   ISTTH2
TH2MPF   EQU   TH2FLAG1
ISTRH    EQU   0
RHFLAGS  EQU   ISTRH
RH1      EQU   RHFLAGS
RHQS     EQU   RH1
RHSENSE  EQU   RH1
RH2      EQU   RHFLAGS+1
RHFME    EQU   RH2
RHEXCEPT EQU   RH2
RHRETRY  EQU   RH2
RHRSVD1  EQU   RH2
RH3      EQU   RHFLAGS+2
ISTSRU   EQU   0
SRUQSREQ EQU   ISTSRU
SRUTYPE  EQU   ISTSRU+1
SRULDID  EQU   ISTSRU+2
SRUSPSN  EQU   SRULDID
ISTPFCRR EQU   0
PFCCRR   EQU   ISTPFCRR
PFCCRRID EQU   PFCCRR
PFCCRRLN EQU   PFCCRR+2
PFCHDR   EQU   ISTPFCRR+4
PFCCRRO  EQU   PFCHDR
PFCFRRO  EQU   PFCHDR+4
ISTAPCRR EQU   0
APCATFLG EQU   ISTAPCRR+16
APCRFLG  EQU   ISTAPCRR+18
APCSAVE  EQU   ISTAPCRR+44
APCCOMF  EQU   ISTAPCRR+116
APCCOMF1 EQU   APCCOMF
APC31FLG EQU   ISTAPCRR+132
APC52FLG EQU   ISTAPCRR+133
APC53FLG EQU   ISTAPCRR+134
APC54FLG EQU   ISTAPCRR+135
APC57FLG EQU   ISTAPCRR+136
ISTDCCRR EQU   0
CRRSPACE EQU   ISTDCCRR+12
CRRSAREA EQU   0
CRRMAS   EQU   CRRSAREA+148
CRRMAS1  EQU   CRRMAS
CRRMAS2  EQU   CRRMAS+1
CRRMAS3  EQU   CRRMAS+2
CRRMAS4  EQU   CRRMAS+3
CRRRMAS1 EQU   CRRMAS+4
CRRRMAS2 EQU   CRRMAS+5
CRRRMAS3 EQU   CRRMAS+6
CRRSMAS  EQU   CRRRMAS3
CRRATS   EQU   CRRSAREA+156
CRRATS1  EQU   CRRATS
CRRATS2  EQU   CRRATS+1
CRRATS3  EQU   CRRATS+2
CRRATS4  EQU   CRRATS+3
CRRRATS1 EQU   CRRATS+4
CRRRATS2 EQU   CRRATS+5
CRRRATS3 EQU   CRRATS+6
CRRSATS  EQU   CRRRATS3
CRRFLGS1 EQU   CRRSAREA+164
CRRFLGS2 EQU   CRRSAREA+165
CRRFLGS3 EQU   CRRSAREA+166
CRRFLGS4 EQU   CRRSAREA+167
CRRFLGS  EQU   CRRSAREA+168
CRRRFLG1 EQU   CRRSAREA+169
CRRRTYPE EQU   CRRRFLG1
CRRFDBK1 EQU   CRRSAREA+170
CRRFDB2  EQU   CRRFDBK1+1
CRRFDB3  EQU   CRRFDBK1+2
CRRFDBK2 EQU   CRRSAREA+176
CRRDSB   EQU   CRRFDBK2
CRRESR   EQU   CRRFDBK2+2
CRRTRBUF EQU   CRRSAREA+204
CRRBFLGS EQU   CRRSAREA+280
ISTASCRR EQU   0
ASCFLAGS EQU   ISTASCRR+16
ASCFLG1  EQU   ASCFLAGS
ASCFLG2  EQU   ASCFLAGS+2
ASCFLG3  EQU   ASCFLAGS+4
ASCUSRGS EQU   ISTASCRR+28
ISTRIA   EQU   0
RIAABRGS EQU   ISTRIA+16
RIAFLGS  EQU   ISTRIA+80
RIAFLG1  EQU   RIAFLGS
RIAFLG2  EQU   RIAFLGS+1
ISTCFCRR EQU   0
CFCAUDIT EQU   ISTCFCRR
CFCNTRD  EQU   CFCAUDIT
CFCCRT   EQU   CFCAUDIT+1
ISTCRA   EQU   0
CRABASIC EQU   ISTCRA
CRAHDR   EQU   CRABASIC
CRACRR   EQU   CRAHDR
CRAFRR   EQU   CRAHDR+4
CRALKACT EQU   CRABASIC+8
CRAL4PTR EQU   CRABASIC+24
CRAL5PTR EQU   CRABASIC+28
CRAPROCR EQU   ISTCRA+312
CRASVC   EQU   ISTCRA+848
CRABUFA  EQU   CRASVC+68
ISTPAB   EQU   0
PABWQCHN EQU   ISTPAB
PABWEQA  EQU   PABWQCHN
PABCHAIN EQU   PABWQCHN+4
PABCHNGP EQU   PABCHAIN+1
PABRPHFG EQU   ISTPAB+12
PABFLAGS EQU   PABRPHFG
PABERLCK EQU   PABFLAGS
PABERRLK EQU   PABERLCK
PABINHBT EQU   PABFLAGS
ISTDYPAB EQU   0
ISTLOK   EQU   0
LOKCHN   EQU   ISTLOK+1
LOKCHNG  EQU   LOKCHN
@NM00060 EQU   LOKCHNG+2
ISTATCVT EQU   0
ATCCOM   EQU   ISTATCVT
ATCSTAT  EQU   ATCCOM
ATCSTAT1 EQU   ATCSTAT
ATCSTFLG EQU   ATCSTAT+1
ATCPOFLG EQU   ATCSTAT+2
ATCSTAT4 EQU   ATCSTAT+3
ATCBPDA  EQU   ATCCOM+128
ATCIOTRC EQU   ATCCOM+140
ATCTHTRC EQU   ATCIOTRC
ATCSMRQ  EQU   ATCCOM+180
ATCSMRS  EQU   ATCCOM+188
ATCCSMR  EQU   ISTATCVT+296
ATCSHRFG EQU   ISTATCVT+316
ATCHPGM  EQU   ISTATCVT+384
ATCAP33  EQU   ISTATCVT+444
ATCAP36  EQU   ISTATCVT+452
ATCVLCNT EQU   ISTATCVT+772
ATCRNO   EQU   ISTATCVT+788
ATCSOPD  EQU   ISTATCVT+792
ATCSIPD  EQU   ISTATCVT+800
ATCSECST EQU   ISTATCVT+812
ATCSTAT2 EQU   ISTATCVT+818
ATCVTBAM EQU   ISTATCVT+908
@NM00068 EQU   ATCVTBAM+3
ATCAOSM  EQU   ISTATCVT+912
ATCGSRBQ EQU   ATCAOSM+4
ATCGSRBG EQU   ATCGSRBQ
ATCAP31  EQU   ATCAOSM+24
ATCAP32  EQU   ATCAOSM+28
ATCAP34  EQU   ATCAOSM+32
ATCZFSVT EQU   ATCAOSM+68
ATCZPSVT EQU   ATCAOSM+72
ATCICAPP EQU   ATCAOSM+100
ATCLDAPP EQU   ATCAOSM+120
ATCDAPVT EQU   ATCAOSM+140
ATCAP37  EQU   ATCAOSM+264
ATCCRA   EQU   ATCAOSM+280
ATCCRACN EQU   ATCCRA+4
ATCSRB   EQU   ATCAOSM+288
ATCSRBCN EQU   ATCSRB+4
ATCCRPL  EQU   ATCAOSM+296
ATCRPLCN EQU   ATCCRPL+4
ATCSQAFR EQU   ATCAOSM+304
ATCORTBC EQU   ATCSQAFR+4
ATCORSRB EQU   ATCORTBC
@NM00070 EQU   ATCAOSM+332
ATCVTFLG EQU   ATCAOSM+392
ATCZFLAG EQU   ATCAOSM+588
ISTDEVCH EQU   0
DEVSHCH  EQU   ISTDEVCH
DEVCHAR  EQU   DEVSHCH
DEVINPUT EQU   DEVCHAR
DEVTCODE EQU   ISTDEVCH+1
DEVFLAGS EQU   ISTDEVCH+3
DEVFCCTL EQU   DEVFLAGS
DEVCHAR3 EQU   DEVFLAGS
ISTNCB   EQU   0
NCBTYPE  EQU   ISTNCB
NCBDAF   EQU   ISTNCB+2
NCBNSNA  EQU   ISTNCB+12
NCBFLAGS EQU   ISTNCB+24
NCBFRAS  EQU   NCBFLAGS+1
NCBFTRIO EQU   NCBFRAS
NCBFLAG1 EQU   NCBFLAGS+2
NCBCONF  EQU   NCBFLAG1
NCBDEVCH EQU   ISTNCB+36
ISTICNCB EQU   0
@NM00075 EQU   ISTICNCB+53
ICNCKFLD EQU   ISTICNCB+96
ICNFLAG  EQU   ISTICNCB+100
ICNZF006 EQU   ICNFLAG
ICNFFLAG EQU   ISTICNCB+101
ICNZSWS  EQU   ISTICNCB+102
ICNFLAG2 EQU   ISTICNCB+236
ICNZD001 EQU   ISTICNCB+288
ICNWSCCW EQU   ICNZD001
ICNZD002 EQU   ISTICNCB+296
ICNZD003 EQU   ISTICNCB+320
ICNRSCCW EQU   ICNZD003
ICNZD004 EQU   ISTICNCB+328
ICNZS1VR EQU   ISTICNCB+348
ICNSRV02 EQU   ICNZS1VR
ICNDIEWA EQU   ICNSRV02
ICNDCDEB EQU   ISTICNCB+480
ICNDIDEB EQU   ICNDCDEB+12
ICNZFLAG EQU   ISTICNCB+508
ICNZH002 EQU   ISTICNCB+509
ICNZS002 EQU   ICNZH002
ICNZS003 EQU   ICNZH002
ICNZS004 EQU   ICNZH002
ICNZS006 EQU   ICNZH002
ICNZS007 EQU   ICNZH002
ICNZS008 EQU   ICNZH002
ICNZS009 EQU   ICNZH002+1
ICNZS00A EQU   ICNZH002+1
ICNZCONS EQU   ISTICNCB+680
ISTDNCB  EQU   0
DNCNCB   EQU   ISTDNCB
DNCBHSET EQU   ISTDNCB+48
DNCMODE  EQU   ISTDNCB+49
DNCOS    EQU   ISTDNCB+56
DNCZFLGS EQU   DNCOS
DNCZF002 EQU   DNCZFLGS
DNCZF003 EQU   DNCZFLGS
DNCZF007 EQU   DNCZFLGS+1
DNCZF008 EQU   DNCZFLGS+1
DNCBSCED EQU   DNCOS+2
DNCZV002 EQU   DNCOS+21
DNCLOCK  EQU   DNCOS+36
ISTPROCD EQU   0
PROPROC  EQU   ISTPROCD
PROPROC1 EQU   PROPROC
PROPROC2 EQU   PROPROC+1
PROCFTX  EQU   PROPROC2
PROPROC3 EQU   PROPROC+2
PROPROC4 EQU   PROPROC+3
PROPROCS EQU   0
PROSETMS EQU   PROPROCS+1
PROSETM2 EQU   PROSETMS
PROSETM3 EQU   PROSETMS+1
PROSETM4 EQU   PROSETMS+2
ISTFMCB  EQU   0
FMCSAF   EQU   ISTFMCB+2
FMCDNCBA EQU   ISTFMCB+16
FMCSTAT  EQU   ISTFMCB+28
FMCZF007 EQU   FMCSTAT
FMCSTAT1 EQU   ISTFMCB+29
FMCCMDFL EQU   ISTFMCB+31
FMCCMPS1 EQU   ISTFMCB+36
FMCPROCD EQU   ISTFMCB+48
FMCPAB2  EQU   ISTFMCB+80
FMCPAB3  EQU   ISTFMCB+96
FMCPAB5  EQU   ISTFMCB+128
FMCSIPA  EQU   ISTFMCB+148
FMCNXOSQ EQU   ISTFMCB+152
FMCNXCFM EQU   FMCNXOSQ
FMCOSSN  EQU   FMCNXCFM
FMCNXOSC EQU   FMCNXOSQ+2
FMCOASN  EQU   FMCNXOSC
FMCISSN  EQU   ISTFMCB+156
FMCSSTAT EQU   ISTFMCB+159
FMCCIPI  EQU   FMCSSTAT
FMCPACE  EQU   ISTFMCB+160
FMCPACEN EQU   FMCPACE
FMCPACEM EQU   FMCPACE+1
FMCPACPC EQU   FMCPACE+2
FMCCVAL  EQU   FMCPACE+3
FMCOBCE  EQU   FMCCVAL
FMCCLEXT EQU   ISTFMCB+164
FMCRPLA  EQU   FMCCLEXT
FMCFBA   EQU   FMCCLEXT+4
FMCCMPS2 EQU   FMCCLEXT+16
FMCFLGA  EQU   FMCCMPS2
FMCFLGCL EQU   FMCCMPS2+1
FMCPSCMD EQU   FMCCMPS2+2
FMCPSTAT EQU   FMCCMPS2+3
FMCBHSET EQU   ISTFMCB+185
FMCSTAT2 EQU   ISTFMCB+186
FMCMODEB EQU   ISTFMCB+189
FMCCLSEQ EQU   ISTFMCB+190
FMCRRESP EQU   ISTFMCB+195
FMCSSEGQ EQU   ISTFMCB+200
FMCLOCK  EQU   ISTFMCB+204
FMCFBAS  EQU   ISTFMCB+216
FMCZV002 EQU   FMCFBAS
FMCSNCTL EQU   ISTFMCB+224
FMCSCFLG EQU   FMCSNCTL
FMCVS1   EQU   ISTFMCB+232
FMCZFLAG EQU   FMCVS1
FMCZF002 EQU   FMCZFLAG
FMCZF006 EQU   FMCZFLAG
FMCSHEDQ EQU   FMCVS1+8
FMCLBXM  EQU   FMCVS1+12
FMCSHEAQ EQU   FMCLBXM
FMCLCPBQ EQU   FMCVS1+16
FMCLCPB2 EQU   FMCLCPBQ+1
FMCLCPAQ EQU   FMCVS1+20
FMCAWATQ EQU   FMCLCPAQ+1
FMCZX003 EQU   FMCVS1+30
FMCSEQ1  EQU   FMCVS1+34
FMCZFLG2 EQU   FMCVS1+35
FMCCVFLG EQU   FMCVS1+44
FMCFLAG  EQU   0
FMCFLGB  EQU   FMCFLAG
ISTFDB   EQU   0
FDBDATAA EQU   ISTFDB+4
FDBDATCT EQU   ISTFDB+8
FDBOFSET EQU   ISTFDB+10
ISTFSB   EQU   0
FSBFSB   EQU   ISTFSB
FSBTYPE  EQU   FSBFSB
FSBLNGTH EQU   FSBFSB+1
FSBMNRCD EQU   FSBFSB+2
FSBSFLGS EQU   FSBFSB+3
FSBFSBA  EQU   FSBFSB+4
FSBBTH   EQU   FSBFSB+8
FSBCID   EQU   FSBBTH
FSBSAF   EQU   FSBCID
FSBDAF   EQU   FSBCID+2
FSBRQTAG EQU   FSBBTH+4
FSBSEQID EQU   FSBRQTAG
FSBFLAGS EQU   FSBSEQID
FSBSEQ   EQU   FSBSEQID+1
FSBCSWST EQU   FSBBTH+6
FSBTHFLD EQU   FSBCSWST
FSBTH1   EQU   FSBTHFLD
FSBSYSRS EQU   FSBTH1
FSBTH2   EQU   FSBTHFLD+1
FSBEXTRS EQU   FSBTH2
FSBXFSTS EQU   FSBEXTRS
FSBXCODE EQU   FSBEXTRS
FSBNETRS EQU   FSBFSB+16
FSBSRCAT EQU   FSBNETRS
FSBMJRCD EQU   FSBSRCAT
FSBERC   EQU   FSBNETRS+1
FSBELI   EQU   FSBERC
FSBECI   EQU   FSBERC
FSBFBMI  EQU   FSBERC
FSBDMGRS EQU   FSBFSB+18
FSBSS1   EQU   FSBDMGRS
FSBSS2   EQU   FSBDMGRS+1
FSBLCPB  EQU   FSBFSB+20
FSBMSGID EQU   FSBLCPB
FSBLCCWA EQU   FSBFSB+24
FSBRLSTS EQU   FSBLCCWA
FSBTHCNT EQU   FSBFSB+28
FSBFDB   EQU   ISTFSB+32
ISTLH    EQU   0
ISTZIBUF EQU   0
ZIBFSM   EQU   ISTZIBUF+4
ISTZOBUF EQU   0
ZOBFSM   EQU   ISTZOBUF+4
ZOBLNG1  EQU   ZOBFSM
ISTDCLCP EQU   0
DCLLCCW2 EQU   ISTDCLCP+56
DCLRTYPE EQU   ISTDCLCP+76
DCLRFLG  EQU   DCLRTYPE+1
DCLFLAG1 EQU   ISTDCLCP+78
ISTLSCB  EQU   0
LSC1WORD EQU   ISTLSCB
LSCREQTG EQU   LSC1WORD+2
LSCZRT02 EQU   LSCREQTG
LSCZRT03 EQU   LSCREQTG
LSCZRT04 EQU   LSCREQTG
LSCZRT05 EQU   LSCREQTG
LSCZRT06 EQU   LSCREQTG
LSCZRT07 EQU   LSCREQTG
LSCZMNRC EQU   LSCREQTG+1
LSCZRT08 EQU   LSCZMNRC
LSCZRT09 EQU   LSCZMNRC
LSCCHAIN EQU   ISTLSCB+4
LSCCHAI1 EQU   LSCCHAIN
LSCRUCNT EQU   ISTLSCB+8
LSCFLGS  EQU   ISTLSCB+9
LSCSEQ   EQU   ISTLSCB+10
LSCLCPBA EQU   ISTLSCB+16
LSCLCCWA EQU   ISTLSCB+20
LSCFDBA  EQU   ISTLSCB+24
CARRAY   EQU   0
INDIRECT EQU   0
FMZL0027 EQU   0
FMZL0033 EQU   0
ISTWKE   EQU   0
WKECHAIN EQU   ISTWKE+4
WKEFLAGS EQU   WKECHAIN
FMZL0047 EQU   0
FMZL0057 EQU   0
FMZL0067 EQU   0
FMZL0075 EQU   0
ISTAPC37 EQU   0
FMZL0118 EQU   0
FMZL0142 EQU   0
ISTAPC34 EQU   0
FMZL0166 EQU   0
FMZL0183 EQU   0
FMZL0199 EQU   0
ZIBSRB   EQU   0
IOSATTSC EQU   IOSIPIB
IOSWTOWA EQU   IOSIPIB
IOSPCISC EQU   IOSIPIB
PSARSVTE EQU   PSARSVT
LCPZTIE  EQU   LCPCID
LCPZSNAM EQU   LCPZTIE+8
SRUSENSE EQU   ISTSRU
SRURMS   EQU   ISTSRU
SRUZIB   EQU   ISTSRU
SRUNETS  EQU   SRUZIB
ISTUNBRU EQU   SRUTYPE
FSBCOMBN EQU   FSBNETRS
FSBRHFLD EQU   FSBCOMBN+1
FSBRH3   EQU   FSBRHFLD+2
FSBLDFLG EQU   FSBRH3
@NM00093 EQU   FSBRQTAG
ZIBDIO   EQU   ZIBFSM
ZIBCCW2  EQU   ZIBDIO+8
ZIBCPTCC EQU   ZIBCCW2
ZIBAIO   EQU   ISTZIBUF
ZIBAIOCM EQU   ZIBAIO
ZIBFIB   EQU   ZIBAIO+16
ZIBFSB   EQU   ZIBFIB
ZIBMDREC EQU   ZIBFSB+4
ZIBMDRIN EQU   ZIBFSB+28
ZIBBTU   EQU   ZIBFIB+32
ZIBFDBS  EQU   ZIBBTU
@NM00097 EQU   ZIBBTU+12
ZIBFID1  EQU   @NM00097+1
ZIBFITXT EQU   ZIBFID1
ZIBSIB   EQU   ZIBFIB
ZIBREC   EQU   ZIBMDRIN
ZIBRECPL EQU   ZIBREC
ZIBRECHD EQU   ZIBRECPL
ZIBRECRS EQU   ZIBREC+8
ZIBRECDT EQU   ZIBREC+10
ZIBMDRRC EQU   ZIBMDREC
ZIBRCPL  EQU   ZIBMDRRC
ZIBRCDT  EQU   ZIBMDRRC+24
@NM00099 EQU   ZIBBTU
ZOBDLBT  EQU   ISTZOBUF
ZOBDLBCM EQU   ZOBDLBT
ZOBFDB   EQU   ZOBDLBCM
ZOBLNG2  EQU   ZOBDLBCM+14
@NM00100 EQU   ZOBDLBCM+25
ZOBBTU   EQU   ZOBDLBT+28
ZOBWCC   EQU   ZOBDLBT+48
ZOBECCC  EQU   ZOBDLBT+50
ZOBDIO   EQU   ZOBFSM
ZOBCCW2  EQU   ZOBDIO+8
ZOBCPTCC EQU   ZOBCCW2
ZOBFLAGS EQU   ZOBCCW2+5
ZOBRT06  EQU   ZOBFLAGS
ZOBRT08  EQU   ZOBFLAGS
ZOBCCW3  EQU   ZOBDIO+16
ZOBCPTRC EQU   ZOBCCW3
ZOBCPN2C EQU   ZOBCPTRC
ZOBCPTRA EQU   ZOBCCW3+1
@NM00104 EQU   ZOBBTU
MVECTOR  EQU   RPHSRPRM
SPTFSB   EQU   ZCRSVWK4
SPTLCP   EQU   ZCRSVWK5
TEMPFLG  EQU   FSBSFLGS
FSBATOP  EQU   TEMPFLG
SEQ1FMC  EQU   FMCSEQ1
FLC      EQU   PSA
SRB      EQU   SRBSECT
ZOBTEXT  EQU   ZOBBTU
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS
@NM00113 EQU   TEMPFLG
ZOBTH2   EQU   @NM00104+4
ZOBLH    EQU   @NM00104
ZOBCPN2K EQU   ZOBCCW3+6
ZOBRSV99 EQU   ZOBCCW3+5
ZOBCPN2F EQU   ZOBCCW3+4
ZOBCPTC2 EQU   ZOBCPTRA
ZOBCPTC1 EQU   ZOBCPN2C
ZOBCPNPK EQU   ZOBCCW2+6
ZOBRSV03 EQU   ZOBFLAGS
ZOBCPNPF EQU   ZOBCCW2+4
ZOBCPTCA EQU   ZOBCCW2+1
ZOBCPNPC EQU   ZOBCPTCC
ZOBCPWTK EQU   ZOBDIO+6
ZOBRSV02 EQU   ZOBDIO+5
ZOBCPWTF EQU   ZOBDIO+4
ZOBCPTXA EQU   ZOBDIO+1
ZOBCPWTC EQU   ZOBDIO
ZOBRSV09 EQU   ZOBECCC
ZOBECSP  EQU   ZOBECCC
ZOBRSV08 EQU   ZOBECCC
ZOBRSV07 EQU   ZOBDLBT+49
ZOBRSV06 EQU   ZOBWCC
ZOBWCSP  EQU   ZOBWCC
ZOBRSV05 EQU   ZOBWCC
ZOBRSV10 EQU   ZOBDLBCM+26
@NM00103 EQU   @NM00100
@NM00102 EQU   @NM00100
@NM00101 EQU   @NM00100
ZOBRSV04 EQU   ZOBDLBCM+16
ZOBRSV01 EQU   ZOBDLBCM+12
ZIBTH2   EQU   @NM00099+4
ZIBLH    EQU   @NM00099
ZIBRCTXT EQU   ZIBMDRRC+36
ZIBRCRID EQU   ZIBRCDT+10
ZIBRCNAM EQU   ZIBRCDT+2
ZIBRCUA  EQU   ZIBRCDT
ZIBRCPUI EQU   ZIBRCPL+20
ZIBRCPUN EQU   ZIBRCPL+16
ZIBRCTIM EQU   ZIBRCPL+12
ZIBRCDAT EQU   ZIBRCPL+8
ZIBRCRS1 EQU   ZIBRCPL+6
ZIBRCSID EQU   ZIBRCPL+5
ZIBRCID  EQU   ZIBRCPL+4
ZIBRCSW  EQU   ZIBRCPL+2
ZIBRCSYR EQU   ZIBRCPL+1
ZIBRCL   EQU   ZIBRCPL
ZIBRECTX EQU   ZIBREC+22
ZIBRECID EQU   ZIBRECDT+10
ZIBRECNA EQU   ZIBRECDT+2
ZIBRECUA EQU   ZIBRECDT
ZIBRECSV EQU   ZIBRECRS
ZIBRECDA EQU   ZIBRECPL+4
ZIBRECSI EQU   ZIBRECHD+3
ZIBRECDV EQU   ZIBRECHD+2
ZIBRECFL EQU   ZIBRECHD+1
ZIBRECTY EQU   ZIBRECHD
ZIBTEXT  EQU   ZIBSIB+4
ZIBRSV04 EQU   ZIBSIB
ZIBTEXT2 EQU   ZIBFITXT
ZIBTEXT1 EQU   ZIBFIB+52
@NM00098 EQU   @NM00097
@NM00096 EQU   ZIBMDREC
@NM00095 EQU   ZIBFSB
ZIBLNG2  EQU   ZIBAIOCM+14
ZIBRSV03 EQU   ZIBAIOCM+13
ZIBWKBYT EQU   ZIBAIOCM+12
ZIBFDBZ  EQU   ZIBAIOCM
ZIBCPNPK EQU   ZIBCCW2+6
ZIBRSV02 EQU   ZIBCCW2+5
ZIBCPTPF EQU   ZIBCCW2+4
ZIBCPTCA EQU   ZIBCCW2+1
ZIBCPNPC EQU   ZIBCPTCC
ZIBCPRDK EQU   ZIBDIO+6
ZIBRSV01 EQU   ZIBDIO+5
ZIBCPRDF EQU   ZIBDIO+4
ZIBCPTXA EQU   ZIBDIO+1
ZIBCPRDC EQU   ZIBDIO
FSBRT0B  EQU   @NM00093+1
FSBRT0A  EQU   @NM00093+1
FSBRT09  EQU   @NM00093+1
FSBRT08  EQU   @NM00093+1
FSBRT07  EQU   @NM00093
FSBRT06  EQU   @NM00093
FSBRT05  EQU   @NM00093
FSBRT04  EQU   @NM00093
FSBRT03  EQU   @NM00093
FSBRT02  EQU   @NM00093
FSBRT01  EQU   @NM00093
FSBRT00  EQU   @NM00093
FSBLDCUF EQU   FSBLDFLG
FSBLDSIF EQU   FSBLDFLG
FSBLDSOF EQU   FSBLDFLG
FSBLDEBF EQU   FSBLDFLG
FSBLDBBF EQU   FSBLDFLG
FSBLDFME EQU   FSBLDFLG
FSBLDSCF EQU   FSBLDFLG
FSBLDRMF EQU   FSBLDFLG
FSBRH2   EQU   FSBRHFLD+1
FSBRH1   EQU   FSBRHFLD
FSBALIGN EQU   FSBCOMBN
UNBTYPE  EQU   ISTUNBRU
SRUNAF   EQU   SRUZIB+3
SRUNSREQ EQU   SRUNETS+2
SRUNSUBC EQU   SRUNETS+1
SRUNSCAT EQU   SRUNETS
SRUREQRE EQU   SRURMS+2
SRUPFX2  EQU   SRURMS+1
SRUPFX1  EQU   SRURMS
SRUSENS2 EQU   SRUSENSE+2
SRUSNS2  EQU   SRUSENSE+1
SRUSNS1  EQU   SRUSENSE
LCPZTRV4 EQU   LCPZSNAM+4
LCPZTRV1 EQU   LCPZSNAM
LCPZSNA  EQU   LCPZTIE+4
LCPZFMCA EQU   LCPZTIE
PSARSAV  EQU   PSARSVTE+60
PSARSTK  EQU   PSARSVTE+56
PSAESAV3 EQU   PSARSVTE+52
PSAESTK3 EQU   PSARSVTE+48
PSAESAV2 EQU   PSARSVTE+44
PSAESTK2 EQU   PSARSVTE+40
PSAESAV1 EQU   PSARSVTE+36
PSAESTK1 EQU   PSARSVTE+32
PSAPSAV  EQU   PSARSVTE+28
PSAPSTK  EQU   PSARSVTE+24
PSAMSAV  EQU   PSARSVTE+20
PSAMSTK  EQU   PSARSVTE+16
PSASSAV  EQU   PSARSVTE+12
PSASSTK  EQU   PSARSVTE+8
PSANSTK  EQU   PSARSVTE+4
PSACSTK  EQU   PSARSVTE
IOSPCIWA EQU   IOSPCISC+44
IOSPCIRS EQU   IOSPCISC+8
@NM00007 EQU   IOSPCISC+4
@NM00006 EQU   IOSPCISC
IOSWRNDR EQU   IOSWTOWA+4
IOSWTOPT EQU   IOSWTOWA+3
IOSWTOCP EQU   IOSWTOWA+2
IOSWTOCH EQU   IOSWTOWA
IOSATTWA EQU   IOSATTSC+40
@NM00005 EQU   IOSATTSC+24
IOSATTSN EQU   IOSATTSC
WKECHNGP EQU   WKECHAIN+1
@NM00123 EQU   WKEFLAGS
WKEGATE  EQU   WKEFLAGS
@NM00122 EQU   ISTWKE
LSCTLBAD EQU   ISTLSCB+28
LSCFDB2  EQU   LSCFDBA+1
LSCFDB1  EQU   LSCFDBA
LSCLCCW1 EQU   ISTLSCB+12
LSCRRCNT EQU   LSCSEQ+1
LSCRRCCT EQU   LSCSEQ
LSCATOP  EQU   LSCFLGS
LSCFREE  EQU   LSCFLGS
LSCDSTAT EQU   LSCFLGS
LSCEXRES EQU   LSCFLGS
LSCZRIMM EQU   LSCFLGS
LSCRSV01 EQU   LSCFLGS
LSCSMODE EQU   LSCFLGS
LSCZMIRC EQU   LSCRUCNT
LSCCHAI2 EQU   LSCCHAIN+1
LSCCHNG  EQU   LSCCHAI1
LSCZRTSC EQU   LSCZMNRC
LSCZRT0B EQU   LSCZMNRC
LSCZRT0A EQU   LSCZMNRC
LSCZRTL9 EQU   LSCZRT09
LSCZRTL8 EQU   LSCZRT08
LSCZRTL7 EQU   LSCZRT07
LSCZRTL6 EQU   LSCZRT06
LSCZRTL5 EQU   LSCZRT05
LSCZRTL4 EQU   LSCZRT04
LSCZRTL3 EQU   LSCZRT03
LSCZRTL2 EQU   LSCZRT02
LSCZRT01 EQU   LSCREQTG
LSCZRT00 EQU   LSCREQTG
LSCLNGTH EQU   LSC1WORD+1
LSCTYPE  EQU   LSC1WORD
DCLECHAR EQU   ISTDCLCP+98
DCLIOLEN EQU   ISTDCLCP+96
DCLBTLEN EQU   ISTDCLCP+92
DCLCLDOA EQU   ISTDCLCP+88
DCLIOBUF EQU   ISTDCLCP+84
DCLLDO1  EQU   ISTDCLCP+80
DCLRSV03 EQU   ISTDCLCP+79
DCLRSV02 EQU   DCLFLAG1
DCLRPLS  EQU   DCLFLAG1
DCLBTEIS EQU   DCLFLAG1
DCLNODE  EQU   DCLFLAG1
DCLRSV04 EQU   DCLFLAG1
DCLSRESW EQU   DCLFLAG1
DCLBNSP  EQU   DCLRFLG
DCLCONV  EQU   DCLRFLG
DCLRSV01 EQU   DCLRFLG
DCLRQTP  EQU   DCLRTYPE
DCLRPLA  EQU   ISTDCLCP+72
DCLLCCW3 EQU   ISTDCLCP+64
DCLLCPB  EQU   ISTDCLCP
ZOBCHAIN EQU   ISTZOBUF
ZIBLNG1  EQU   ZIBFSM
ZIBCHAIN EQU   ISTZIBUF
LHVDATA  EQU   ISTLH+4
LHFUNCT  EQU   ISTLH+3
@NM00094 EQU   ISTLH+2
LHLEN    EQU   ISTLH
FSBRSV01 EQU   FSBFSB+30
FSBRLRSV EQU   FSBRLSTS
FSBCFTX  EQU   FSBRLSTS
FSBICNCB EQU   FSBMSGID
FSBSSOC  EQU   FSBSS2
FSBSSCC  EQU   FSBSS2
FSBSSDC  EQU   FSBSS2
FSBSSEC  EQU   FSBSS2
FSBSSIR  EQU   FSBSS2
FSBSSCR  EQU   FSBSS2
@NM00092 EQU   FSBSS2
@NM00091 EQU   FSBSS1
FSBSSDE  EQU   FSBSS1
FSBSSUS  EQU   FSBSS1
@NM00090 EQU   FSBSS1
FSBSOHI  EQU   FSBERC
FSBLGI   EQU   FSBERC
FSBLMRI  EQU   FSBFBMI
FSBETI   EQU   FSBERC
FSBEMI   EQU   FSBERC
FSBEBI   EQU   FSBERC
FSBXLCI  EQU   FSBXCODE
FSBXFINS EQU   FSBXCODE
FSBXNORM EQU   FSBXFSTS
FSBSCODE EQU   FSBSYSRS
FSBSPHSE EQU   FSBSYSRS
FSBSERR  EQU   FSBSYSRS
FSBCMD   EQU   FSBSEQ
FSBDTRCE EQU   FSBFLAGS
FSBASBTU EQU   FSBFLAGS
FSBINPET EQU   FSBFLAGS
FSBNONCB EQU   FSBFLAGS
FSBLBIND EQU   FSBFLAGS
FSBFFIND EQU   FSBFLAGS
FSBACIND EQU   FSBFLAGS
FSBRFIND EQU   FSBFLAGS
FSBGATE  EQU   FSBFSBA
FSBLATOP EQU   FSBSFLGS
FSBRSV02 EQU   FSBSFLGS
FSBPGBUF EQU   FSBSFLGS
FSBMNSDA EQU   FSBMNRCD
FSBMNOA  EQU   FSBMNRCD
FSBMNDIF EQU   FSBMNRCD
FSBMNEOP EQU   FSBMNRCD
FSBMNDNU EQU   FSBMNRCD
FSBMNATN EQU   FSBMNRCD
FSBMNRVI EQU   FSBMNRCD
FSBMNELI EQU   FSBMNRCD
FDBFDBA  EQU   ISTFDB
FMCFLRSV EQU   FMCFLGB
FMCFLGA8 EQU   FMCFLGB
FMCCLRPH EQU   FMCVS1+45
FMCRSV0X EQU   FMCCVFLG
FMCVYRPH EQU   FMCCVFLG
FMCZV004 EQU   FMCVS1+40
FMCLOCK2 EQU   FMCVS1+36
@NM00089 EQU   FMCZFLG2
FMCZF027 EQU   FMCZFLG2
FMCZF026 EQU   FMCZFLG2
FMCSEQ1B EQU   FMCSEQ1
FMCSEQ1T EQU   FMCSEQ1
FMCZX006 EQU   FMCVS1+33
FMCZX005 EQU   FMCVS1+32
FMCZX004 EQU   FMCVS1+31
FMCZX002 EQU   FMCVS1+29
FMCZX001 EQU   FMCVS1+28
FMCZV001 EQU   FMCVS1+24
@NM00088 EQU   FMCLCPAQ
FMCLCPB1 EQU   FMCLCPBQ
FMCASCDQ EQU   FMCSHEAQ+1
@NM00087 EQU   FMCSHEAQ
FMCZFCSQ EQU   FMCVS1+6
FMCZH001 EQU   FMCVS1+4
FMCZF025 EQU   FMCZFLAG+3
FMCZF024 EQU   FMCZFLAG+3
FMCZF023 EQU   FMCZFLAG+3
FMCZF022 EQU   FMCZFLAG+3
FMCZF021 EQU   FMCZFLAG+3
FMCZF020 EQU   FMCZFLAG+3
FMCZF019 EQU   FMCZFLAG+3
FMCZF018 EQU   FMCZFLAG+3
FMCZF017 EQU   FMCZFLAG+2
FMCZF016 EQU   FMCZFLAG+2
FMCZF015 EQU   FMCZFLAG+2
FMCZF014 EQU   FMCZFLAG+2
FMCZF013 EQU   FMCZFLAG+2
FMCZF012 EQU   FMCZFLAG+2
FMCZF011 EQU   FMCZFLAG+2
FMCZF010 EQU   FMCZFLAG+2
FMCZF00F EQU   FMCZFLAG+1
FMCZF00E EQU   FMCZFLAG+1
FMCZF00D EQU   FMCZFLAG+1
FMCZF00C EQU   FMCZFLAG+1
FMCZF00B EQU   FMCZFLAG+1
FMCRSV10 EQU   FMCZFLAG+1
FMCZF009 EQU   FMCZFLAG+1
FMCZFD06 EQU   FMCZF006+1
FMCZFC06 EQU   FMCZF006
FMCZFB06 EQU   FMCZF006
FMCZFA06 EQU   FMCZF006
FMCZF005 EQU   FMCZFLAG
FMCZF004 EQU   FMCZFLAG
FMCZF003 EQU   FMCZFLAG
FMCZF001 EQU   FMCZFLAG
FMCFRESA EQU   ISTFMCB+228
FMCSCSQN EQU   FMCSNCTL+2
FMCSCCTL EQU   FMCSNCTL+1
FMCSTCTL EQU   FMCSCFLG
FMCSCCLO EQU   FMCSCFLG
FMCAPRO  EQU   FMCSCFLG
FMCLURO  EQU   FMCSCFLG
FMCOBSAC EQU   FMCSCFLG
FMCIBSAC EQU   FMCSCFLG
FMCFBRE  EQU   ISTFMCB+220
FMCFBXM  EQU   FMCZV002
FMCASEGQ EQU   ISTFMCB+212
FMCRDTPT EQU   ISTFMCB+208
FMCSEGD  EQU   FMCSSEGQ
FMCRSPLM EQU   ISTFMCB+198
FMCPSTRS EQU   ISTFMCB+196
@NM00086 EQU   FMCRRESP
FMCTSLHA EQU   FMCRRESP
FMCFRRN  EQU   FMCRRESP
FMCFME   EQU   FMCRRESP
FMCFEX   EQU   FMCRRESP
FMCFPE   EQU   FMCRRESP
FMCCTLB  EQU   ISTFMCB+194
FMCBSQNO EQU   FMCCLSEQ+2
FMCTSQNO EQU   FMCCLSEQ
FMCOBPRG EQU   FMCMODEB
FMCIBPRG EQU   FMCMODEB
FMCRESOT EQU   FMCMODEB
FMCRSTSR EQU   FMCMODEB
FMCLUQ   EQU   FMCMODEB
FMCAPQ   EQU   FMCMODEB
FMCCLEAR EQU   FMCMODEB
FMCHOLD  EQU   FMCMODEB
FMCIPSEQ EQU   ISTFMCB+188
FMCLUSTR EQU   ISTFMCB+187
FMCRSV87 EQU   FMCSTAT2
FMCSEQI  EQU   FMCSTAT2
FMCCPIP  EQU   FMCSTAT2
FMCALIPR EQU   FMCSTAT2
FMCIAIO  EQU   FMCSTAT2
FMCZF00A EQU   FMCSTAT2
FMCVPIP  EQU   FMCSTAT2
FMCPRMRC EQU   FMCCLEXT+20
FMCRSV89 EQU   FMCPSTAT
FMCPCLSD EQU   FMCPSTAT
FMCDDOCD EQU   FMCPSTAT
FMCIDVFD EQU   FMCPSTAT
FMCELKST EQU   FMCPSTAT
FMCRSV88 EQU   FMCPSCMD
FMCRDBLK EQU   FMCPSCMD
FMCDSEOC EQU   FMCPSCMD
FMCPURGE EQU   FMCPSCMD
FMCRESTI EQU   FMCPSCMD
FMCCNTCT EQU   FMCPSCMD
FMCINVT  EQU   FMCPSCMD
FMCFLGB7 EQU   FMCFLGCL
FMCFLGB6 EQU   FMCFLGCL
FMCFLGB5 EQU   FMCFLGCL
FMCFLGB4 EQU   FMCFLGCL
FMCFLGB3 EQU   FMCFLGCL
FMCFLGB2 EQU   FMCFLGCL
FMCFLGB1 EQU   FMCFLGCL
FMCFLGB0 EQU   FMCFLGCL
FMCFLGA7 EQU   FMCFLGA
FMCFLGA6 EQU   FMCFLGA
FMCFLGA5 EQU   FMCFLGA
FMCFLGA4 EQU   FMCFLGA
FMCFLGA3 EQU   FMCFLGA
FMCFLGA2 EQU   FMCFLGA
FMCFLGA1 EQU   FMCFLGA
FMCFLGA0 EQU   FMCFLGA
FMCDCLOK EQU   FMCCLEXT+12
FMCRAFM  EQU   FMCCLEXT+8
FMCFBPTR EQU   FMCFBA+1
FMCFBRSV EQU   FMCFBA
FMCRPLPT EQU   FMCRPLA+1
FMCRPLRS EQU   FMCRPLA
FMCPRCLS EQU   FMCCVAL
FMCIBCE  EQU   FMCCVAL
FMCONLY  EQU   FMCOBCE
FMCLAST  EQU   FMCOBCE
FMCMIDLE EQU   FMCOBCE
FMCFIRST EQU   FMCOBCE
FMCCPCNT EQU   FMCPACPC
FMCMPCNT EQU   FMCPACEM
FMCNPCNT EQU   FMCPACEN
FMCCONF  EQU   FMCSSTAT
FMCPURCH EQU   FMCSSTAT
FMCNSALU EQU   FMCSSTAT
FMCBIP   EQU   FMCSSTAT
FMCSDTR  EQU   FMCSSTAT
FMCUIPI  EQU   FMCSSTAT
FMCSNBI  EQU   FMCSSTAT
FMCRVD01 EQU   ISTFMCB+158
FMCSIP   EQU   FMCSIPA
FMCEXLST EQU   ISTFMCB+144
FMCPAB4  EQU   ISTFMCB+112
FMCPAB1  EQU   ISTFMCB+64
FMCFASYA EQU   ISTFMCB+60
FMCMODE  EQU   ISTFMCB+52
FMCVWT   EQU   ISTFMCB+44
FMCRPLH  EQU   ISTFMCB+40
FMCBUFNB EQU   FMCCMPS1+2
FMCBUFLM EQU   FMCCMPS1
FMCDEBA  EQU   ISTFMCB+32
@NM00085 EQU   FMCCMDFL
FMCSNA   EQU   FMCCMDFL
FMCVSNA  EQU   FMCCMDFL
FMCCMDR  EQU   FMCCMDFL
@NM00084 EQU   ISTFMCB+30
@NM00083 EQU   FMCSTAT1
FMCLTCLS EQU   FMCSTAT1
FMCHPURG EQU   FMCSTAT1
FMCVSP2  EQU   FMCSTAT1
FMCVSP1  EQU   FMCSTAT
FMCLTEAS EQU   FMCSTAT
FMCDEDSC EQU   FMCSTAT
FMCDEVOF EQU   FMCSTAT
FMCDAPT  EQU   FMCSTAT
FMCPRMTE EQU   FMCSTAT
FMCPRMTR EQU   FMCSTAT
FMCUSFLD EQU   ISTFMCB+24
FMCFMCBA EQU   ISTFMCB+20
FMCDVTA  EQU   ISTFMCB+12
FMCTSKID EQU   ISTFMCB+8
FMCNXTCB EQU   ISTFMCB+4
FMCLNGTH EQU   ISTFMCB+1
FMCTYPE  EQU   ISTFMCB
PROSRDEF EQU   PROSETM4
PRORSV47 EQU   PROSETM4
PROSCON  EQU   PROSETM4
PRORSV46 EQU   PROSETM3
PROSMONT EQU   PROSETM3
PRORSV45 EQU   PROSETM3
PROSNTO  EQU   PROSETM3
PRORSV44 EQU   PROSETM3
PRORSV43 EQU   PROSETM2
PROSNTFL EQU   PROSETM2
PRORSV42 EQU   PROSETM2
PRORSV41 EQU   PROPROCS
PROMODC  EQU   PROPROC4
PROMODT  EQU   PROPROC4
PROMODM  EQU   PROPROC4
PROMODB  EQU   PROPROC4
PRORSV14 EQU   PROPROC4
PRORSV13 EQU   PROPROC4
PRORSV12 EQU   PROPROC4
PROEIB   EQU   PROPROC4
PROMONT3 EQU   PROPROC3
PROMONT2 EQU   PROPROC3
PROMONIT EQU   PROPROC3
PROSUBLK EQU   PROPROC3
PRONTO   EQU   PROPROC3
PROLGIN  EQU   PROPROC3
PROERPI  EQU   PROPROC3
PRORSV07 EQU   PROPROC3
PROEMLC  EQU   PROPROC2
PRONTFL  EQU   PROPROC2
PRORSV05 EQU   PROPROC2
PRORSV04 EQU   PROPROC2
PROLGOT  EQU   PROPROC2
PROERPO  EQU   PROPROC2
PRORSV03 EQU   PROPROC2
PRORPLC  EQU   PROPROC1
PROCS    EQU   PROPROC1
PROCA    EQU   PROPROC1
PRORESPX EQU   PROPROC1
PRODFASY EQU   PROPROC1
PROXPOPT EQU   PROPROC1
PROTRUNC EQU   PROPROC1
PROASYIP EQU   PROPROC1
DNCZC001 EQU   DNCOS+40
DNCZV005 EQU   DNCOS+32
DNCZV004 EQU   DNCOS+28
DNCZV003 EQU   DNCOS+24
DNCZX001 EQU   DNCOS+20
DNCZV001 EQU   DNCOS+17
DNCZX003 EQU   DNCOS+16
DNCZV000 EQU   DNCOS+12
DNCSESCQ EQU   DNCOS+8
DNCSESIQ EQU   DNCOS+4
DNCACIP  EQU   DNCBSCED+1
DNCLICP  EQU   DNCBSCED
DNCZPSRD EQU   DNCZFLGS+1
DNCPSOL  EQU   DNCZFLGS+1
DNCZF006 EQU   DNCZFLGS+1
DNCZF005 EQU   DNCZFLGS+1
DNCZF004 EQU   DNCZFLGS+1
DNCZRSCH EQU   DNCZFLGS
DNCDISC  EQU   DNCZFLGS
DNCCONT  EQU   DNCZFLGS
DNCINVIT EQU   DNCZFLGS
DNCSESS  EQU   DNCZFLGS
DNCZF001 EQU   DNCZFLGS
ICNZCON6 EQU   ICNZCONS+10
ICNZCON5 EQU   ICNZCONS+8
ICNZCON4 EQU   ICNZCONS+6
ICNZCON3 EQU   ICNZCONS+4
ICNZCON2 EQU   ICNZCONS+2
ICNZCON1 EQU   ICNZCONS
ICNZATSA EQU   ISTICNCB+676
ICNZX012 EQU   ISTICNCB+675
ICNZX011 EQU   ISTICNCB+674
ICNZX010 EQU   ISTICNCB+672
ICNSRB   EQU   ISTICNCB+628
ICNIOSB  EQU   ISTICNCB+520
ICNZC001 EQU   ISTICNCB+512
ICNZX013 EQU   ISTICNCB+511
ICNZS010 EQU   ICNZH002+1
ICNZS00F EQU   ICNZH002+1
ICNZS00E EQU   ICNZH002+1
ICNZS00D EQU   ICNZH002+1
ICNZS00C EQU   ICNZH002+1
ICNZS00B EQU   ICNZH002+1
ICNZS01A EQU   ICNZS00A
ICNZS019 EQU   ICNZS009
ICNZS018 EQU   ICNZS008
ICNZS017 EQU   ICNZS007
ICNZS016 EQU   ICNZS006
ICNZS005 EQU   ICNZH002
ICNZS014 EQU   ICNZS004
ICNZS013 EQU   ICNZS003
ICNZS012 EQU   ICNZS002
ICNZS001 EQU   ICNZH002
ICNZF028 EQU   ICNZFLAG
ICNZF027 EQU   ICNZFLAG
ICNZF026 EQU   ICNZFLAG
ICNZF025 EQU   ICNZFLAG
ICNZF024 EQU   ICNZFLAG
ICNZF023 EQU   ICNZFLAG
ICNZF022 EQU   ICNZFLAG
ICNZF021 EQU   ICNZFLAG
ICNWORD5 EQU   ISTICNCB+504
ICNMSIZE EQU   ISTICNCB+500
ICNLCVTA EQU   ISTICNCB+496
ICNDEBAD EQU   ICNDIDEB+1
ICNDCBIF EQU   ICNDIDEB
ICNUCBAD EQU   ICNDCDEB+8
ICNAPPAD EQU   ICNDCDEB+5
ICNEXSCL EQU   ICNDCDEB+4
ICNDCBAD EQU   ICNDCDEB+1
ICNDEBID EQU   ICNDCDEB
@NM00082 EQU   ISTICNCB+477
ICNERCNT EQU   ISTICNCB+476
ICNZX002 EQU   ISTICNCB+475
ICNZX001 EQU   ISTICNCB+474
ICNZH001 EQU   ISTICNCB+472
ICNZSW3R EQU   ISTICNCB+468
ICNZSW2R EQU   ISTICNCB+464
ICNZSW1R EQU   ISTICNCB+460
ICNZS4VR EQU   ISTICNCB+436
ICNZS4RR EQU   ISTICNCB+432
ICNZS4FC EQU   ISTICNCB+428
ICNZS4BC EQU   ISTICNCB+424
ICNZS3VR EQU   ISTICNCB+400
ICNZS3RR EQU   ISTICNCB+396
ICNZS3FC EQU   ISTICNCB+392
ICNZS3BC EQU   ISTICNCB+388
ICNZS1RC EQU   ICNZS1VR+36
ICNDIEW3 EQU   ICNDIEWA+8
ICNDIEW2 EQU   ICNDIEWA+4
ICNDIEW1 EQU   ICNDIEWA
ICNZS1RR EQU   ISTICNCB+344
ICNZS1FC EQU   ISTICNCB+340
ICNZS1BC EQU   ISTICNCB+336
ICNRSTIC EQU   ICNZD004
ICNRDCOD EQU   ICNRSCCW
ICNZD006 EQU   ISTICNCB+312
ICNZD005 EQU   ISTICNCB+304
ICNWSTIC EQU   ICNZD002
ICNWRCOD EQU   ICNWSCCW
ICNZV008 EQU   ISTICNCB+284
ICNZV007 EQU   ISTICNCB+280
ICNZV006 EQU   ISTICNCB+276
ICNZV005 EQU   ISTICNCB+272
ICNZV004 EQU   ISTICNCB+268
ICNLSTIT EQU   ISTICNCB+264
ICNLSTIF EQU   ISTICNCB+260
ICNZV002 EQU   ISTICNCB+256
ICNZV001 EQU   ISTICNCB+252
ICNZV00A EQU   ISTICNCB+249
ICNBUFF  EQU   ISTICNCB+248
ICNCPQ   EQU   ISTICNCB+244
ICNNICNA EQU   ISTICNCB+240
@NM00081 EQU   ICNFLAG2+2
ICNZF019 EQU   ICNFLAG2+2
ICNZF018 EQU   ICNFLAG2+2
ICNZF017 EQU   ICNFLAG2+2
ICNZF016 EQU   ICNFLAG2+2
ICNZF015 EQU   ICNFLAG2+2
ICNMSG   EQU   ICNFLAG2+1
ICNCLOSE EQU   ICNFLAG2+1
ICNZF014 EQU   ICNFLAG2+1
ICNZF013 EQU   ICNFLAG2+1
ICNZF012 EQU   ICNFLAG2+1
ICNZF011 EQU   ICNFLAG2+1
ICNZF00D EQU   ICNFLAG2+1
ICNZF00B EQU   ICNFLAG2+1
ICNZF00A EQU   ICNFLAG2
ICNZF008 EQU   ICNFLAG2
ICNZF007 EQU   ICNFLAG2
ICNZF005 EQU   ICNFLAG2
ICNZF004 EQU   ICNFLAG2
ICNZF003 EQU   ICNFLAG2
ICNZF002 EQU   ICNFLAG2
ICNZF001 EQU   ICNFLAG2
ICNLOCK  EQU   ISTICNCB+232
ICNLICNA EQU   ISTICNCB+228
ICNRPH   EQU   ISTICNCB+120
ICNZV003 EQU   ISTICNCB+116
ICNLAST  EQU   ISTICNCB+112
ICNLSTBT EQU   ISTICNCB+108
ICNSIOQ  EQU   ISTICNCB+104
ICNFLAG1 EQU   ISTICNCB+103
ICNZSW08 EQU   ICNZSWS
ICNZSW07 EQU   ICNZSWS
ICNZSW06 EQU   ICNZSWS
ICNZSW05 EQU   ICNZSWS
ICNZSW04 EQU   ICNZSWS
ICNZSW03 EQU   ICNZSWS
ICNZSW02 EQU   ICNZSWS
ICNZSW01 EQU   ICNZSWS
ICNZFF69 EQU   ICNFFLAG
@NM00080 EQU   ICNFFLAG
ICNZFF05 EQU   ICNFFLAG
ICNZFF04 EQU   ICNFFLAG
ICNZFF03 EQU   ICNFFLAG
ICNZFF02 EQU   ICNFFLAG
ICNZFF01 EQU   ICNFFLAG
ICNZFF00 EQU   ICNFFLAG
@NM00079 EQU   ICNFLAG
ICNZCRIT EQU   ICNFLAG
ICNSTART EQU   ICNFLAG
ICNSLOW  EQU   ICNFLAG
ICNZF010 EQU   ICNFLAG
ICNZF00F EQU   ICNFLAG
ICNZF00E EQU   ICNFLAG
ICNCONF  EQU   ICNZF006
ICNCKPAB EQU   ICNCKFLD+1
ICNRSV07 EQU   ICNCKFLD
ICNCKBIT EQU   ICNCKFLD
ICNZPAB4 EQU   ISTICNCB+80
ICNZPAB1 EQU   ISTICNCB+64
ICNRSV01 EQU   ISTICNCB+60
@NM00078 EQU   ISTICNCB+56
@NM00077 EQU   ISTICNCB+54
@NM00076 EQU   @NM00075
ICNRRY   EQU   @NM00075
ICNLCLUS EQU   @NM00075
ICNROLN  EQU   @NM00075
ICNRNRY  EQU   @NM00075
ICNLNKMD EQU   ISTICNCB+52
ICNCUUA  EQU   ISTICNCB+48
ICNCB    EQU   ISTICNCB
NCBRSV01 EQU   ISTNCB+46
NCBSWDAF EQU   ISTNCB+44
NCBFMCBP EQU   ISTNCB+32
NCBLTRC  EQU   ISTNCB+30
NCBRVPT1 EQU   ISTNCB+28
NCBNMLLN EQU   NCBFLAGS+3
@NM00074 EQU   NCBFLAG1
NCBFORCE EQU   NCBFLAG1
NCBTTF   EQU   NCBFLAG1
NCBRSYNC EQU   NCBFLAG1
NCBRSTRT EQU   NCBFLAG1
NCBSNAI  EQU   NCBFLAG1
NCBFLTIO EQU   NCBFTRIO
NCBCSTAT EQU   NCBFLAGS
NCBNCSL  EQU   ISTNCB+22
NCBNCBA  EQU   ISTNCB+20
NCBFMCBA EQU   ISTNCB+16
NCBTSKID EQU   ISTNCB+8
NCBRDTE  EQU   ISTNCB+4
NCBLNGTH EQU   ISTNCB+1
DEVRSV03 EQU   ISTDEVCH+5
DEVPHYSA EQU   ISTDEVCH+4
DEVCSLPN EQU   DEVCHAR3
DEVCSTCL EQU   DEVCHAR3
DEVCCHEK EQU   DEVCHAR3
DEVCATTN EQU   DEVCHAR3
DEVCSWL  EQU   DEVFCCTL
DEVCRVB  EQU   DEVFCCTL
DEVCSSL  EQU   DEVFCCTL
DEVCBSC  EQU   DEVFCCTL
DEVMCODE EQU   ISTDEVCH+2
DEVCHAR2 EQU   DEVTCODE
DEVRSV01 EQU   DEVCHAR
DEVCCTL  EQU   DEVCHAR
DEVNNSPT EQU   DEVCHAR
DEVSPS   EQU   DEVCHAR
DEVSUBND EQU   DEVCHAR
DEVCONVR EQU   DEVCHAR
DEVOTPUT EQU   DEVCHAR
ATCAOS   EQU   ISTATCVT+1584
ATCPOPAB EQU   ATCAOSM+640
ATCVIOPM EQU   ATCAOSM+636
ATCTPMMI EQU   ATCAOSM+632
ATCTPMPB EQU   ATCAOSM+600
ATCRSV88 EQU   ATCAOSM+596
ATCRPLCT EQU   ATCAOSM+594
ATCCRACT EQU   ATCAOSM+592
ATCSRBCT EQU   ATCAOSM+590
ATCRSV75 EQU   ATCAOSM+589
ATCRSV66 EQU   ATCZFLAG
ATCZF001 EQU   ATCZFLAG
ATCTPCP1 EQU   ATCAOSM+584
ATCTPCP0 EQU   ATCAOSM+580
ATCAICTN EQU   ATCAOSM+576
ATCZR01  EQU   ATCAOSM+572
ATCMPLTA EQU   ATCAOSM+568
ATCASCB  EQU   ATCAOSM+564
ATCAP86  EQU   ATCAOSM+560
ATCAP85  EQU   ATCAOSM+556
ATCAP84  EQU   ATCAOSM+552
ATCAP83  EQU   ATCAOSM+548
ATCAP82  EQU   ATCAOSM+544
ATCAP69  EQU   ATCAOSM+540
ATCAP66  EQU   ATCAOSM+536
ATCAP62  EQU   ATCAOSM+532
ATCAPC59 EQU   ATCAOSM+528
ATCAP56  EQU   ATCAOSM+524
ATCAP55  EQU   ATCAOSM+520
ATCRCFY0 EQU   ATCAOSM+516
ATCAP41  EQU   ATCAOSM+512
ATCAPC25 EQU   ATCAOSM+508
ATCAP23  EQU   ATCAOSM+504
ATCTPSPB EQU   ATCAOSM+472
ATCTRMPB EQU   ATCAOSM+440
ATCAPBE  EQU   ATCAOSM+436
ATCPSTA  EQU   ATCAOSM+432
ATCSMABF EQU   ATCAOSM+428
ATCSMAPR EQU   ATCAOSM+424
ATCTPWQA EQU   ATCAOSM+420
ATCSMAID EQU   ATCAOSM+416
ATCSMARA EQU   ATCAOSM+412
ATCCACXA EQU   ATCAOSM+408
ATCZLAAB EQU   ATCAOSM+404
ATCATA10 EQU   ATCAOSM+400
ATCHLTCB EQU   ATCAOSM+396
@NM00073 EQU   ATCVTFLG
ATCVTACT EQU   ATCVTFLG
ATCRPT40 EQU   ATCAOSM+388
ATCRPT39 EQU   ATCAOSM+384
ATCRPT38 EQU   ATCAOSM+380
ATCRPT37 EQU   ATCAOSM+376
ATCRPT36 EQU   ATCAOSM+372
ATCRPT35 EQU   ATCAOSM+368
ATCRPT34 EQU   ATCAOSM+364
ATCRPT33 EQU   ATCAOSM+360
ATCRPT32 EQU   ATCAOSM+356
ATCRPT31 EQU   ATCAOSM+352
ATCRPT30 EQU   ATCAOSM+348
ATCRPT29 EQU   ATCAOSM+344
ATCRPT28 EQU   ATCAOSM+340
ATCRPT27 EQU   ATCAOSM+336
@NM00072 EQU   ATCAOSM+333
@NM00071 EQU   @NM00070
ATCSNUF  EQU   @NM00070
ATCOPKL  EQU   @NM00070
ATCABEN  EQU   @NM00070
ATCAIWT  EQU   ATCAOSM+328
ATCINFDD EQU   ATCAOSM+324
ATCORFMG EQU   ATCAOSM+320
ATCORFRL EQU   ATCAOSM+316
ATCOROBT EQU   ATCAOSM+312
ATCORQG  EQU   ATCORSRB
ATCORTBF EQU   ATCSQAFR
ATCRPLAC EQU   ATCRPLCN+2
ATCRPLRC EQU   ATCRPLCN
ATCCRPLQ EQU   ATCCRPL
ATCSRBAC EQU   ATCSRBCN+2
ATCSRBRC EQU   ATCSRBCN
ATCSRBQ  EQU   ATCSRB
ATCCRAAC EQU   ATCCRACN+2
ATCCRARC EQU   ATCCRACN
ATCCRAQ  EQU   ATCCRA
ATCRPT12 EQU   ATCAOSM+276
ATCDMAPP EQU   ATCAOSM+272
ATCAP38  EQU   ATCAOSM+268
ATCZDFJ0 EQU   ATCAOSM+260
ATCAP51  EQU   ATCAOSM+256
ATCZPAB2 EQU   ATCAOSM+224
ATCZPAB1 EQU   ATCAOSM+192
ATCZLFVT EQU   ATCAOSM+188
ATCZLPVT EQU   ATCAOSM+184
ATCZDVTX EQU   ATCAOSM+180
ATCZDVTA EQU   ATCAOSM+176
ATCZDVT9 EQU   ATCAOSM+172
ATCZDVT8 EQU   ATCAOSM+168
ATCZDVT7 EQU   ATCAOSM+164
ATCRSV56 EQU   ATCDAPVT+22
ATCDAPDG EQU   ATCDAPVT+20
ATCDXCEA EQU   ATCDAPVT+16
ATCDCEA  EQU   ATCDAPVT+12
ATCDPCIA EQU   ATCDAPVT+8
ATCDSIOA EQU   ATCDAPVT+4
ATCDEOEA EQU   ATCDAPVT
ATCZLAEA EQU   ATCLDAPP+16
ATCZLCEA EQU   ATCLDAPP+12
ATCRSV17 EQU   ATCLDAPP+8
ATCSMFRR EQU   ATCLDAPP+4
ATCCDTID EQU   ATCLDAPP
ATCZAEA  EQU   ATCICAPP+16
ATCZCEA  EQU   ATCICAPP+12
ATCCDTCB EQU   ATCICAPP+8
ATCZSIOA EQU   ATCICAPP+4
ATCCDRPH EQU   ATCICAPP
ATCAP65  EQU   ATCAOSM+96
ATCZDVT6 EQU   ATCAOSM+92
ATCZDVT4 EQU   ATCAOSM+88
ATCZDVT3 EQU   ATCAOSM+84
ATCZDVT1 EQU   ATCAOSM+80
ATCICNCB EQU   ATCAOSM+76
ATCAP64  EQU   ATCAOSM+64
ATCAP63  EQU   ATCAOSM+60
ATCAP61  EQU   ATCAOSM+56
ATCAP58  EQU   ATCAOSM+52
ATCAP57  EQU   ATCAOSM+48
ATCAP54  EQU   ATCAOSM+44
ATCAP53  EQU   ATCAOSM+40
ATCAP52  EQU   ATCAOSM+36
ATCAP12  EQU   ATCAOSM+20
ATCAP11  EQU   ATCAOSM+16
ATCCMTCB EQU   ATCAOSM+12
ATCPRPH  EQU   ATCAOSM+8
ATCGSRBF EQU   ATCGSRBG
ATCSRBRT EQU   ATCAOSM
@NM00069 EQU   @NM00068
ATCVTMAB EQU   @NM00068
@NM00067 EQU   ATCVTBAM
ATCVDLOK EQU   ISTATCVT+904
ATCVFPAB EQU   ISTATCVT+872
ATCVDPAB EQU   ISTATCVT+840
ATCIOECB EQU   ISTATCVT+836
ATCINCW3 EQU   ISTATCVT+832
ATCMODTB EQU   ISTATCVT+828
ATCUSSPT EQU   ISTATCVT+824
ATCSRTAB EQU   ISTATCVT+820
@NM00066 EQU   ISTATCVT+819
@NM00065 EQU   ATCSTAT2
ATCTRSMS EQU   ATCSTAT2
ATCTRLOK EQU   ATCSTAT2
ATCTRPSS EQU   ATCSTAT2
ATCTRESC EQU   ATCSTAT2
ATCTRAPI EQU   ATCSTAT2
ATCNMCTR EQU   ISTATCVT+816
ATCSEC51 EQU   ATCSECST
ATCSEC40 EQU   ATCSIPD+8
ATCSEC30 EQU   ATCSIPD+4
ATCSEC21 EQU   ATCSIPD
ATCSEC10 EQU   ATCSOPD+4
ATCSEC01 EQU   ATCSOPD
ATCPOIA  EQU   ATCRNO+1
@NM00064 EQU   ATCRNO
ATCPODVT EQU   ISTATCVT+784
ATCS49XL EQU   ISTATCVT+780
ATCS49XI EQU   ISTATCVT+776
ATCLCLCT EQU   ATCVLCNT+2
ATCRNCNT EQU   ATCVLCNT
ATCCFEAD EQU   ISTATCVT+768
ATCPTR00 EQU   ISTATCVT+736
ATCRSV10 EQU   ISTATCVT+704
ATCTACB  EQU   ISTATCVT+700
ATCVTINM EQU   ISTATCVT+696
ATCTCLIM EQU   ISTATCVT+692
ATCTCLOM EQU   ISTATCVT+688
ATCVTIPB EQU   ISTATCVT+656
ATCTCIPB EQU   ISTATCVT+624
ATCTIPAB EQU   ISTATCVT+592
ATCOCCCB EQU   ISTATCVT+588
ATCOCCOB EQU   ISTATCVT+584
ATCCDLAD EQU   ISTATCVT+580
ATCCCLAD EQU   ISTATCVT+576
ATCDLRPB EQU   ISTATCVT+544
ATCPGPAB EQU   ISTATCVT+512
ATCVPAB1 EQU   ISTATCVT+480
ATCRSV97 EQU   ISTATCVT+476
ATCRDTLK EQU   ISTATCVT+472
ATCVOCLK EQU   ISTATCVT+468
ATCCDFDN EQU   ISTATCVT+464
ATCCDFIN EQU   ISTATCVT+460
ATCDVTLK EQU   ISTATCVT+456
ATCAP35  EQU   ISTATCVT+448
ATCRSV99 EQU   ISTATCVT+440
ATCONFIG EQU   ISTATCVT+432
ATCNODDS EQU   ISTATCVT+428
ATCNODEL EQU   ISTATCVT+420
ATCRSV69 EQU   ISTATCVT+416
ATCAPCR5 EQU   ISTATCVT+412
ATCLDECB EQU   ISTATCVT+408
ATCLDNCS EQU   ISTATCVT+404
ATCCDPTR EQU   ISTATCVT+400
ATCADEL  EQU   ISTATCVT+396
ATCTODVT EQU   ISTATCVT+392
ATCDEBCH EQU   ISTATCVT+388
ATCHBSIZ EQU   ATCHPGM+2
ATCHBFNO EQU   ATCHPGM
ATCCRME  EQU   ISTATCVT+380
ATCRVCHS EQU   ISTATCVT+372
ATCECTLP EQU   ISTATCVT+368
ATCZDVTB EQU   ISTATCVT+364
ATCECPRT EQU   ISTATCVT+360
ATCVTLOD EQU   ISTATCVT+356
ATCTRPAB EQU   ISTATCVT+352
ATCMSGM  EQU   ISTATCVT+348
ATCMSGP  EQU   ISTATCVT+344
ATCEPT   EQU   ISTATCVT+340
ATCDVT   EQU   ISTATCVT+336
ATCTRCPT EQU   ISTATCVT+332
ATCDVLOD EQU   ISTATCVT+328
ATCALERT EQU   ISTATCVT+324
ATCEPA   EQU   ISTATCVT+320
ATCSAF   EQU   ISTATCVT+318
ATCXRANG EQU   ISTATCVT+317
ATCLAST  EQU   ATCSHRFG
ATCSHRTN EQU   ISTATCVT+308
ATCUEP   EQU   ISTATCVT+304
ATCOCRT  EQU   ISTATCVT+300
ATCCSMA  EQU   ATCCSMR
ATCESC02 EQU   ISTATCVT+292
ATCESC01 EQU   ISTATCVT+288
ATCCDFND EQU   ISTATCVT+284
ATCCDDEL EQU   ISTATCVT+280
ATCCDADD EQU   ISTATCVT+276
ATCMNT   EQU   ISTATCVT+272
ATCRSV16 EQU   ISTATCVT+270
ATCMAXID EQU   ISTATCVT+269
ATCMSGSP EQU   ATCCOM+268
ATCCIDM  EQU   ATCCOM+266
ATCACTRM EQU   ATCCOM+264
ATCNERAP EQU   ATCCOM+260
ATCNESAL EQU   ATCCOM+256
ATCRCC65 EQU   ATCCOM+252
ATCRCC26 EQU   ATCCOM+248
ATCRCC63 EQU   ATCCOM+244
ATCRSV11 EQU   ATCCOM+242
ATCVTMID EQU   ATCCOM+240
ATCAPOST EQU   ATCCOM+236
ATCNERFN EQU   ATCCOM+232
ATCNERNE EQU   ATCCOM+228
ATCNERCV EQU   ATCCOM+224
ATCNERST EQU   ATCCOM+220
ATCDCC61 EQU   ATCCOM+216
ATCDCC60 EQU   ATCCOM+212
ATCSRTDF EQU   ATCCOM+208
ATCSRTAD EQU   ATCCOM+204
ATCFIRA  EQU   ATCCOM+200
ATCSMBQ  EQU   ATCCOM+196
ATCSMRC  EQU   ATCCOM+192
ATCSMQU  EQU   ATCCOM+184
ATCACDA  EQU   ATCCOM+176
ATCSTMA  EQU   ATCCOM+172
ATCFRSTR EQU   ATCCOM+168
ATCGTSTR EQU   ATCCOM+164
ATCREADA EQU   ATCCOM+160
ATCALOAD EQU   ATCCOM+156
ATCBLDLA EQU   ATCCOM+152
ATCFBRPH EQU   ATCCOM+148
ATCBFTRC EQU   ATCCOM+144
ATCTPBUF EQU   ATCTHTRC
ATCREMOV EQU   ATCCOM+136
ATCADD   EQU   ATCCOM+132
ATCDVTPT EQU   ATCCOM+124
ATCFEPT  EQU   ATCCOM+120
ATCFDVT  EQU   ATCCOM+116
ATCCONFT EQU   ATCCOM+112
ATCPTCHA EQU   ATCCOM+108
ATCAUTHA EQU   ATCCOM+104
ATCACCTA EQU   ATCCOM+100
ATCRDTH  EQU   ATCCOM+96
ATCFRSCH EQU   ATCCOM+92
ATCFSB   EQU   ATCCOM+88
ATCHLTMS EQU   ATCCOM+84
ATCECPRM EQU   ATCCOM+80
ATCECNET EQU   ATCCOM+76
ATCECOPC EQU   ATCCOM+72
ATCVPARM EQU   ATCCOM+68
ATCECVRQ EQU   ATCCOM+64
ATCECSES EQU   ATCCOM+60
ATCOCHA  EQU   ATCCOM+56
ATCDSPLQ EQU   ATCCOM+52
ATCECDSP EQU   ATCCOM+48
ATCVARYQ EQU   ATCCOM+44
ATCECVRY EQU   ATCCOM+40
ATCHALTQ EQU   ATCCOM+36
ATCECHLT EQU   ATCCOM+32
ATCMODQ  EQU   ATCCOM+28
ATCECMOD EQU   ATCCOM+24
ATCASCHD EQU   ATCCOM+20
ATCSRT   EQU   ATCCOM+16
ATCRDT   EQU   ATCCOM+12
ATCDCFRR EQU   ATCCOM+8
ATCAPI   EQU   ATCCOM+4
ATCRSV04 EQU   ATCSTAT4
ATCVTTRC EQU   ATCSTAT4
ATCNCSD  EQU   ATCSTAT4
ATCMTST  EQU   ATCSTAT4
ATCTPRT  EQU   ATCSTAT4
ATCPRTAT EQU   ATCSTAT4
@NM00063 EQU   ATCPOFLG
ATCPOUNS EQU   ATCPOFLG
ATCHSDMF EQU   ATCSTFLG
@NM00062 EQU   ATCSTAT1
ATCMDHLT EQU   ATCSTAT1
ATCINHLT EQU   ATCSTAT1
ATCNETSL EQU   ATCSTAT1
ATCQKHLT EQU   ATCSTAT1
ATCSNHLT EQU   ATCSTAT1
ATCACTIV EQU   ATCSTAT1
ATCSTART EQU   ATCSTAT1
LOKXCL   EQU   @NM00060
LOKPRY   EQU   @NM00060
@NM00061 EQU   @NM00060
@NM00059 EQU   LOKCHNG
LOKCT    EQU   ISTLOK
DYPPAB   EQU   ISTDYPAB+16
DYPRSV01 EQU   ISTDYPAB+12
DYPTSKID EQU   ISTDYPAB+8
DYPCHAIN EQU   ISTDYPAB+4
DYPFLGS  EQU   ISTDYPAB+2
DYPLNGTH EQU   ISTDYPAB+1
DYPTYPE  EQU   ISTDYPAB
PABRPHA  EQU   PABRPHFG+1
PABNODQ  EQU   PABFLAGS
PABERLOK EQU   PABERRLK
PABSSN   EQU   PABFLAGS
PABDYNAM EQU   PABFLAGS
PABNORPR EQU   PABFLAGS
PABPRIOR EQU   PABFLAGS
PABAPYP  EQU   PABFLAGS
PABDVTA  EQU   ISTPAB+9
PABOFFST EQU   ISTPAB+8
PABRSV02 EQU   PABCHAIN
PABDELAY EQU   PABCHAIN
PABRUNNG EQU   PABCHAIN
PABRESET EQU   PABCHAIN
PABUNCON EQU   PABCHAIN
PABCDP   EQU   PABCHAIN
PABRESCH EQU   PABCHAIN
PABCHNG  EQU   PABCHAIN
PABWEQP  EQU   PABWEQA+1
PABRSV01 EQU   PABWEQA
PABWEQG  EQU   PABWEQA
CRACHAIN EQU   ISTCRA+928
CRARSV02 EQU   ISTCRA+924
CRARSV01 EQU   ISTCRA+920
CRABFTBA EQU   CRABUFA
CRAMASK  EQU   CRASVC+64
CRAHSIZ  EQU   CRASVC+60
CRAASCRR EQU   CRASVC
CRAPSS   EQU   ISTCRA+160
CRARPH   EQU   ISTCRA+52
CRALAPTR EQU   CRABASIC+48
CRAL9PTR EQU   CRABASIC+44
CRAL8PTR EQU   CRABASIC+40
CRAL7PTR EQU   CRABASIC+36
CRAL6PTR EQU   CRABASIC+32
CRAL3PTR EQU   CRABASIC+20
CRAL2PTR EQU   CRABASIC+16
CRAL1PTR EQU   CRABASIC+12
CRALEV01 EQU   CRALKACT+3
CRALEV02 EQU   CRALKACT+3
CRALEV03 EQU   CRALKACT+3
CRALEV04 EQU   CRALKACT+3
CRALEV05 EQU   CRALKACT+3
CRALEV06 EQU   CRALKACT+3
CRALEV07 EQU   CRALKACT+3
CRALEV08 EQU   CRALKACT+3
CRALEV09 EQU   CRALKACT+2
CRALEV10 EQU   CRALKACT+2
CRALEV11 EQU   CRALKACT+2
CRALEV12 EQU   CRALKACT+2
CRALEV13 EQU   CRALKACT+2
CRALEV14 EQU   CRALKACT+2
CRALEV15 EQU   CRALKACT+2
CRALEV16 EQU   CRALKACT+2
CRALEV17 EQU   CRALKACT+1
CRALEV18 EQU   CRALKACT+1
CRALEV19 EQU   CRALKACT+1
CRALEV20 EQU   CRALKACT+1
CRALEV21 EQU   CRALKACT+1
CRALEV22 EQU   CRALKACT+1
CRALEV23 EQU   CRALKACT+1
CRALEV24 EQU   CRALKACT+1
CRALEV25 EQU   CRALKACT
CRALEV26 EQU   CRALKACT
CRALEV27 EQU   CRALKACT
CRALEV28 EQU   CRALKACT
CRALEV29 EQU   CRALKACT
CRALEV30 EQU   CRALKACT
CRALEV31 EQU   CRALKACT
CRALEV32 EQU   CRALKACT
CCFRSVD1 EQU   CFCCRT
CCFCR2   EQU   CFCCRT
CCFCRP   EQU   CFCCRT
CCFCR1   EQU   CFCCRT
CCFCS2   EQU   CFCCRT
CCFCS1   EQU   CFCCRT
NCFRSVD  EQU   CFCNTRD
NCFCR2   EQU   CFCNTRD
NCFCRP   EQU   CFCNTRD
NCFCR1   EQU   CFCNTRD
NCFCS2   EQU   CFCNTRD
NCFCS1   EQU   CFCNTRD
RIARSV03 EQU   RIAFLGS+2
RIARSV02 EQU   RIAFLG2
RIABR15  EQU   RIAFLG2
RIARSPCC EQU   RIAFLG2
RIARTPXT EQU   RIAFLG2
RIACONT  EQU   RIAFLG2
RIAFABN  EQU   RIAFLG2
RIARSV01 EQU   RIAFLG1
RIACTIVE EQU   RIAFLG1
RIACTL   EQU   RIAFLG1
RIAABR15 EQU   RIAABRGS+60
RIAABR14 EQU   RIAABRGS+56
RIAABR13 EQU   RIAABRGS+52
RIAABR12 EQU   RIAABRGS+48
RIAABR11 EQU   RIAABRGS+44
RIAABR10 EQU   RIAABRGS+40
RIAABR09 EQU   RIAABRGS+36
RIAABR08 EQU   RIAABRGS+32
RIAABR07 EQU   RIAABRGS+28
RIAABR06 EQU   RIAABRGS+24
RIAABR05 EQU   RIAABRGS+20
RIAABR04 EQU   RIAABRGS+16
RIAABR03 EQU   RIAABRGS+12
RIAABR02 EQU   RIAABRGS+8
RIAABR01 EQU   RIAABRGS+4
RIAABR00 EQU   RIAABRGS
RIARSV04 EQU   ISTRIA+14
RIAABPSW EQU   ISTRIA+4
RIAABCD  EQU   ISTRIA
ASCPSREG EQU   ISTASCRR+44
ASCUSR01 EQU   ASCUSRGS+12
ASCUSR00 EQU   ASCUSRGS+8
ASCUSR15 EQU   ASCUSRGS+4
ASCUSR14 EQU   ASCUSRGS
ASCETRYA EQU   ISTASCRR+24
ASCKEY   EQU   ISTASCRR+23
ASCAUDIT EQU   ASCFLG3
ASCFBDUD EQU   ASCFLG3
ASCLLKF  EQU   ASCFLG3
ASCKEYF  EQU   ASCFLG3
ASCFBDAL EQU   ASCFLG3
ASCFSRGT EQU   ASCFLG3
ASCICR   EQU   ASCFLG2
ASCFSRIC EQU   ASCFLG2
ASCFBDIC EQU   ASCFLG2
ASCFBAIC EQU   ASCFLG2
ASCPASTR EQU   ASCFLG1
ASCFSR   EQU   ASCFLG1
ASCFBD   EQU   ASCFLG1
ASCFBA   EQU   ASCFLG1
ASCPFCRR EQU   ISTASCRR
CRRRVPT5 EQU   CRRSAREA+316
CRRRVPT4 EQU   CRRSAREA+312
CRRRVPT3 EQU   CRRSAREA+308
CRRRVPT2 EQU   CRRSAREA+304
CRRRVPT1 EQU   CRRSAREA+300
CRRRVCR2 EQU   CRRSAREA+292
CRRRVCR1 EQU   CRRSAREA+291
CRRXFNCD EQU   CRRSAREA+290
CRRLDOCT EQU   CRRSAREA+288
CRRBTLEN EQU   CRRSAREA+284
CRRBLEN  EQU   CRRSAREA+282
CRRBRTCD EQU   CRRSAREA+281
@NM00058 EQU   CRRBFLGS
CRRBFLG1 EQU   CRRBFLGS
CRRBLDAD EQU   CRRSAREA+276
CRRBARAD EQU   CRRSAREA+272
CRRRTN12 EQU   CRRSAREA+268
CRRRTN11 EQU   CRRSAREA+264
CRRRTN10 EQU   CRRSAREA+260
CRRRTN9  EQU   CRRSAREA+256
CRRRTN8  EQU   CRRSAREA+252
CRRRTN7  EQU   CRRSAREA+248
CRRRTN6  EQU   CRRSAREA+244
CRRRTN5  EQU   CRRSAREA+240
CRRRTN4  EQU   CRRSAREA+236
CRRRTN3  EQU   CRRSAREA+232
CRRRTN2  EQU   CRRSAREA+228
CRRRTN1  EQU   CRRSAREA+224
CRRRES1  EQU   CRRSAREA+222
CRRLCNT  EQU   CRRSAREA+220
CRRATCVT EQU   CRRSAREA+216
CRRVALCK EQU   CRRSAREA+212
CRRARPL  EQU   CRRTRBUF+4
CRRBIND  EQU   CRRTRBUF+3
CRRTRRES EQU   CRRTRBUF
CRRCLDO  EQU   CRRSAREA+200
CRRUECB  EQU   CRRSAREA+196
CRRLCPB  EQU   CRRSAREA+192
CRRCMDAD EQU   CRRSAREA+188
CRRFMCB  EQU   CRRSAREA+184
CRRCLCCW EQU   CRRSAREA+180
CRRESR2  EQU   CRRESR+1
CRRESR1  EQU   CRRESR
CRRDSB2  EQU   CRRDSB+1
CRRDSB1  EQU   CRRDSB
CRRDTACT EQU   CRRSAREA+174
CRRRSV99 EQU   CRRSAREA+173
CRRRDSOH EQU   CRRFDB3
CRRRLG   EQU   CRRFDB3
CRRLGFRC EQU   CRRFDB3
CRRRDEOT EQU   CRRFDB3
CRRRDEOM EQU   CRRFDB3
CRRRDEOB EQU   CRRFDB3
CRRUNUSD EQU   CRRFDB3
CRRUINPT EQU   CRRFDB3
CRRSTSAV EQU   CRRFDB2
CRRCUERR EQU   CRRFDB2
CRRDLGFL EQU   CRRFDB2
CRRIOERR EQU   CRRFDB2
CRRDVUNS EQU   CRRFDB2
CRRATND  EQU   CRRFDB2
CRRRVID  EQU   CRRFDB2
CRRERLK  EQU   CRRFDB2
CRRRTNCD EQU   CRRFDBK1
CRRNSNA  EQU   CRRRTYPE
CRRDFSYN EQU   CRRRTYPE
CRRRESP  EQU   CRRRTYPE
CRRDFASY EQU   CRRRTYPE
CRRDBLCK EQU   CRRRFLG1
CRRRPSBD EQU   CRRRFLG1
CRRRPLOQ EQU   CRRRFLG1
CRRRPLS  EQU   CRRRFLG1
CRRSW7   EQU   CRRFLGS
CRRSW6   EQU   CRRFLGS
CRRSW5   EQU   CRRFLGS
CRRSW4   EQU   CRRFLGS
CRRSW3   EQU   CRRFLGS
CRRSW2   EQU   CRRFLGS
CRRSW1   EQU   CRRFLGS
CRRSW0   EQU   CRRFLGS
CRRRSV04 EQU   CRRFLGS4
CRRFMCLK EQU   CRRFLGS4
CRRDLCCW EQU   CRRFLGS3
CRRRESET EQU   CRRFLGS3
CRRSUBBK EQU   CRRFLGS3
CRRRSV08 EQU   CRRFLGS3
CRRDEBQ  EQU   CRRFLGS3
CRRSTSPR EQU   CRRFLGS3
CRRDREQ  EQU   CRRFLGS3
CRRDFDBK EQU   CRRFLGS3
CRRDFSB  EQU   CRRFLGS2
CRRDPROC EQU   CRRFLGS2
CRREXTS  EQU   CRRFLGS2
CRRELSRI EQU   CRRFLGS2
CRRPOST  EQU   CRRFLGS2
CRRENDLW EQU   CRRFLGS2
CRRPRGIP EQU   CRRFLGS2
CRRDEXP  EQU   CRRFLGS2
CRRSOLRQ EQU   CRRFLGS1
CRRREQP  EQU   CRRFLGS1
CRRCPROC EQU   CRRFLGS1
CRRFINI  EQU   CRRFLGS1
CRRPREIO EQU   CRRFLGS1
CRRINIO  EQU   CRRFLGS1
CRRFLDOS EQU   CRRFLGS1
CRRDOCUR EQU   CRRFLGS1
CRRRATS4 EQU   CRRATS+7
@NM00057 EQU   CRRSATS
CRRASC51 EQU   CRRSATS
CRRASC40 EQU   CRRSATS
CRRASC30 EQU   CRRSATS
CRRASC21 EQU   CRRSATS
CRRASC10 EQU   CRRSATS
CRRASC01 EQU   CRRSATS
@NM00056 EQU   CRRRATS2
CRRPLIC  EQU   CRRRATS2
CRRRC81  EQU   CRRRATS2
CRRRC80  EQU   CRRRATS2
CRRRC65  EQU   CRRRATS2
CRRRC63  EQU   CRRRATS2
CRRRC55  EQU   CRRRATS2
CRRRC54  EQU   CRRRATS2
CRRRC53  EQU   CRRRATS1
CRRRC52  EQU   CRRRATS1
CRRRC51  EQU   CRRRATS1
CRRRC30  EQU   CRRRATS1
CRRRC26  EQU   CRRRATS1
CRRRC23  EQU   CRRRATS1
CRRRC22  EQU   CRRRATS1
CRRRC21  EQU   CRRRATS1
@NM00055 EQU   CRRATS4
CRRC3X   EQU   CRRATS4
CRRC85   EQU   CRRATS4
CRRC83   EQU   CRRATS4
CRRC82   EQU   CRRATS4
CRRC61   EQU   CRRATS4
CRRC60   EQU   CRRATS4
CRRC81   EQU   CRRATS3
CRRC80   EQU   CRRATS3
CRRC75   EQU   CRRATS3
CRRC51   EQU   CRRATS3
CRRC50   EQU   CRRATS3
CRRC42   EQU   CRRATS3
CRRC41   EQU   CRRATS3
CRRC40   EQU   CRRATS3
CRRC32   EQU   CRRATS2
CRRC31   EQU   CRRATS2
CRRC30   EQU   CRRATS2
CRRC25   EQU   CRRATS2
CRRC24   EQU   CRRATS2
CRRC23   EQU   CRRATS2
CRRC22   EQU   CRRATS2
CRRC21   EQU   CRRATS2
CRRC20   EQU   CRRATS1
CRRC13   EQU   CRRATS1
CRRC12   EQU   CRRATS1
CRRC11   EQU   CRRATS1
CRRC10   EQU   CRRATS1
CRRC02   EQU   CRRATS1
CRRC01   EQU   CRRATS1
CRRC00   EQU   CRRATS1
CRRRMAS4 EQU   CRRMAS+7
@NM00054 EQU   CRRSMAS
CRRMSC51 EQU   CRRSMAS
CRRMSC40 EQU   CRRSMAS
CRRMSC30 EQU   CRRSMAS
CRRMSC21 EQU   CRRSMAS
CRRMSC10 EQU   CRRSMAS
CRRMSC01 EQU   CRRSMAS
@NM00053 EQU   CRRRMAS2
CRRRM81  EQU   CRRRMAS2
CRRRM80  EQU   CRRRMAS2
CRRRM65  EQU   CRRRMAS2
CRRRM63  EQU   CRRRMAS2
CRRRM55  EQU   CRRRMAS2
CRRRM54  EQU   CRRRMAS2
CRRRM53  EQU   CRRRMAS1
CRRRM52  EQU   CRRRMAS1
CRRRM51  EQU   CRRRMAS1
CRRRM30  EQU   CRRRMAS1
CRRRM26  EQU   CRRRMAS1
CRRRM23  EQU   CRRRMAS1
CRRRM22  EQU   CRRRMAS1
CRRRM21  EQU   CRRRMAS1
@NM00052 EQU   CRRMAS4
CRRM3X   EQU   CRRMAS4
CRRM85   EQU   CRRMAS4
CRRM83   EQU   CRRMAS4
CRRM82   EQU   CRRMAS4
CRRM61   EQU   CRRMAS4
CRRM60   EQU   CRRMAS4
CRRM81   EQU   CRRMAS3
CRRM80   EQU   CRRMAS3
CRRM75   EQU   CRRMAS3
CRRM51   EQU   CRRMAS3
CRRM50   EQU   CRRMAS3
CRRM42   EQU   CRRMAS3
CRRM41   EQU   CRRMAS3
CRRM40   EQU   CRRMAS3
CRRM32   EQU   CRRMAS2
CRRM31   EQU   CRRMAS2
CRRM30   EQU   CRRMAS2
CRRM25   EQU   CRRMAS2
CRRM24   EQU   CRRMAS2
CRRM23   EQU   CRRMAS2
CRRM22   EQU   CRRMAS2
CRRM21   EQU   CRRMAS2
CRRM20   EQU   CRRMAS1
CRRM13   EQU   CRRMAS1
CRRM12   EQU   CRRMAS1
CRRM11   EQU   CRRMAS1
CRRM10   EQU   CRRMAS1
CRRM02   EQU   CRRMAS1
CRRM01   EQU   CRRMAS1
CRRM00   EQU   CRRMAS1
CRRFSB   EQU   CRRSAREA+144
CRRSAVE1 EQU   CRRSAREA+72
CRRSAVE  EQU   CRRSAREA
CRRRSV22 EQU   ISTDCCRR+4
CRRCRR   EQU   ISTDCCRR
@NM00051 EQU   ISTAPCRR+137
@NM00050 EQU   APC57FLG
APCNREL  EQU   APC57FLG
APCRECRA EQU   APC57FLG
@NM00049 EQU   APC54FLG
APCRLST  EQU   APC54FLG
APCPR153 EQU   APC53FLG
@NM00048 EQU   APC52FLG
APCWKF   EQU   APC52FLG
APCNWF   EQU   APC52FLG
APCRDQ   EQU   APC52FLG
APCQENQ  EQU   APC52FLG
APCSMSR  EQU   APC52FLG
APCCKRQ  EQU   APC52FLG
@NM00047 EQU   APC31FLG
APCSORT  EQU   APC31FLG
APCRESCH EQU   APC31FLG
APCTPXIT EQU   APC31FLG
APCSWTWD EQU   ISTAPCRR+128
APCSAV2  EQU   ISTAPCRR+124
APCSAV1  EQU   ISTAPCRR+120
APCRETCD EQU   APCCOMF+2
@NM00046 EQU   APCCOMF1+1
APCZLBER EQU   APCCOMF1
APCEXIT  EQU   APCCOMF1
APCRELR  EQU   APCCOMF1
APCIRB2  EQU   APCCOMF1
APCIRB1  EQU   APCCOMF1
APCSMCR  EQU   APCCOMF1
APCUETSK EQU   APCCOMF1
APCSSTSK EQU   APCCOMF1
APCESTAL EQU   APCSAVE
APCFRRPM EQU   ISTAPCRR+40
APCQWFO  EQU   ISTAPCRR+36
APCPABSV EQU   ISTAPCRR+32
APCRTRN  EQU   ISTAPCRR+28
APCTCBA  EQU   ISTAPCRR+24
APCPSTA  EQU   ISTAPCRR+20
@NM00045 EQU   APCRFLG+1
APC31R   EQU   APCRFLG
APC58R   EQU   APCRFLG
APC57R   EQU   APCRFLG
APC56R   EQU   APCRFLG
APC54R   EQU   APCRFLG
APC53R   EQU   APCRFLG
APC52R   EQU   APCRFLG
APC51R   EQU   APCRFLG
@NM00044 EQU   APCATFLG+1
APC31E   EQU   APCATFLG
APC58E   EQU   APCATFLG
APC57E   EQU   APCATFLG
APC56E   EQU   APCATFLG
APC54E   EQU   APCATFLG
APC53E   EQU   APCATFLG
APC52E   EQU   APCATFLG
APC51E   EQU   APCATFLG
APCHDRSV EQU   ISTAPCRR
PFCRSV01 EQU   ISTPFCRR+13
PFCFTA   EQU   ISTPFCRR+12
CRRFRR   EQU   PFCFRRO
CRRCHAIN EQU   PFCCRRO
CRRLEN   EQU   PFCCRRLN
PFCRSV10 EQU   PFCCRR+1
CRRID    EQU   PFCCRRID
SRURSV01 EQU   SRULDID+4
SRUPSSN  EQU   SRULDID+2
SRUDFCLV EQU   SRUSPSN
@NM00043 EQU   SRUTYPE
SRUPSAC  EQU   SRUTYPE
SRUSPAC  EQU   SRUTYPE
RHRSVD5  EQU   RH3
RHRSVD4  EQU   RH3
RHLOG    EQU   RH3
RHRSVD3  EQU   RH3
RHRCDIR  EQU   RH3
RHCDIR   EQU   RH3
RHEB     EQU   RH3
RHBB     EQU   RH3
RHPACE   EQU   RH2
RHRSVD2  EQU   RH2
RHINOP   EQU   RHRSVD1
RHBUSY   EQU   RHRETRY
RHRRN    EQU   RH2
RHPE     EQU   RH2
RHCHAIN  EQU   RH1
RHFORMAT EQU   RH1
RHDIRI   EQU   RH1
RHSCI    EQU   RH1
RHTYPE   EQU   RH1
TH2SNF   EQU   ISTTH2+4
TH2OAF   EQU   ISTTH2+3
TH2DAF   EQU   ISTTH2+2
TH2CDF   EQU   TH2FLAG1+1
TH2SEF   EQU   TH2FLAG1+1
TH2PYF   EQU   TH2FLAG1+1
TH2AFI   EQU   TH2FLAG1
TH2PSI   EQU   TH2FLAG1
TH2CMPLI EQU   TH2MPF
TH2RHI   EQU   TH2MPF
TH2FID   EQU   TH2FLAG1
THDCF    EQU   ISTTH+8
THSNF    EQU   ISTTH+6
THOAF    EQU   ISTTH+4
THDAF    EQU   ISTTH+2
THCDF    EQU   THFLGB
THSEF    EQU   THFLGB
THPYF    EQU   THFLGB
THAFI    EQU   THFLGA
THPSI    EQU   THFLGA
THCMPLI  EQU   THMPF
THRHI    EQU   THMPF
THFID    EQU   THFLAG1
BTUEXTR  EQU   ISTBTU+19
BTURSV02 EQU   BTUSYSTR
BTUPHASE EQU   BTUSYSTR
BTURSV01 EQU   BTUSYSTR
BTUPAD   EQU   BTURH+3
BTURH3   EQU   BTURH+2
BTURH2   EQU   BTURH+1
BTURH1   EQU   BTURH
BTUZRTSC EQU   BTURQFLG+1
BTUZRT0B EQU   BTURQFLG+1
BTUZRT0A EQU   BTURQFLG+1
BTUZRT09 EQU   BTURQFLG+1
BTUZRT08 EQU   BTURQFLG+1
BTUZRT07 EQU   BTURQFLG
BTUZRT06 EQU   BTURQFLG
BTUZRT05 EQU   BTURQFLG
BTUZRT04 EQU   BTURQFLG
BTUZRT02 EQU   BTURQFLG
BTUZRT01 EQU   BTURQFLG
BTUZRT00 EQU   BTURQFLG
BTUCDF   EQU   BTUFID+1
BTUSCF   EQU   BTUFID+1
BTUPRY   EQU   BTUFID+1
BTUASFL  EQU   BTUFID
BTUPSFL  EQU   BTUFID
BTUMPF   EQU   BTUFID
BTUFIDNO EQU   BTUFID
BDURSV04 EQU   BDUFLAGS
BDURTOE  EQU   BDUFLAGS
BDUSTPR  EQU   BDUFLAGS
BDURSV03 EQU   BDUFLAGS
BDUALT   EQU   BDUFUNC
BDUNACK  EQU   BDUFUNC
BDUACK   EQU   BDUFUNC
BDUTRPM  EQU   BDUFUNC
BDUFBMI  EQU   BDUFUNC
BDULDGPH EQU   BDUFUNC
BDUHEADP EQU   BDUFUNC
BDUSOH   EQU   BDUCHECK
BDURSV01 EQU   BDUMODIF
BDUMOD0  EQU   BDUMOD1
ZCRRU    EQU   ZCRRHRU+3
ZCRRH    EQU   ZCRRHRU
ZCRWORDA EQU   ISTZCRR+477
ZCRCMNRC EQU   ISTZCRR+476
ZCRRSV97 EQU   ZCRENTER+18
ZCREIC2B EQU   ZCRENTER+18
ZCREAC2B EQU   ZCRENTER+18
ZCRELCAB EQU   ZCRENTER+18
ZCREDCMF EQU   ZCRENTER+18
ZCREBCIF EQU   ZCRENTER+18
ZCREICSG EQU   ZCRENTER+18
ZCREDCK0 EQU   ZCRENTER+18
ZCRECFY0 EQU   ZCRENTER+17
ZCREKCCB EQU   ZCRENTER+17
ZCREDCNB EQU   ZCRENTER+17
ZCREICOE EQU   ZCRENTER+17
ZCREBCNB EQU   ZCRENTER+17
ZCREBC0L EQU   ZCRENTER+17
ZCREBCAL EQU   ZCRENTER+17
ZCREDCQR EQU   ZCRENTER+17
ZCREDCPR EQU   ZCRENTER+16
ZCREBCSB EQU   ZCRENTER+16
ZCRECCCI EQU   ZCRENTER+16
ZCRECCAI EQU   ZCRENTER+16
ZCRECCBI EQU   ZCRENTER+16
ZCREBCAR EQU   ZCRENTER+16
ZCREBCDR EQU   ZCRENTER+16
ZCREBCBR EQU   ZCRENTER+15
ZCREDCXR EQU   ZCRENTER+15
ZCREDCWB EQU   ZCRENTER+15
ZCREDCWR EQU   ZCRENTER+15
ZCREKCCN EQU   ZCRENTER+15
ZCREKCBN EQU   ZCRENTER+15
ZCREKCBB EQU   ZCRENTER+15
ZCREJC0B EQU   ZCRENTER+15
ZCREJCDB EQU   ZCRENTER+14
ZCREJCCB EQU   ZCRENTER+14
ZCREJCBB EQU   ZCRENTER+14
ZCREJCAB EQU   ZCRENTER+14
ZCREIC1B EQU   ZCRENTER+14
ZCREIC0B EQU   ZCRENTER+14
ZCREICX0 EQU   ZCRENTER+14
ZCREICWB EQU   ZCRENTER+14
ZCREICVB EQU   ZCRENTER+13
ZCREICUB EQU   ZCRENTER+13
ZCREICTB EQU   ZCRENTER+13
ZCREICSC EQU   ZCRENTER+13
ZCREICSB EQU   ZCRENTER+13
ZCREICRB EQU   ZCRENTER+13
ZCREICQB EQU   ZCRENTER+13
ZCREICQA EQU   ZCRENTER+13
ZCREICOB EQU   ZCRENTER+12
ZCREICOA EQU   ZCRENTER+12
ZCREICNB EQU   ZCRENTER+12
ZCREICNA EQU   ZCRENTER+12
ZCREICMB EQU   ZCRENTER+12
ZCREICLB EQU   ZCRENTER+12
ZCREICKG EQU   ZCRENTER+12
ZCREICKE EQU   ZCRENTER+12
ZCREICKB EQU   ZCRENTER+11
ZCREICJB EQU   ZCRENTER+11
ZCREICID EQU   ZCRENTER+11
ZCREICIB EQU   ZCRENTER+11
ZCREICHB EQU   ZCRENTER+11
ZCREICGB EQU   ZCRENTER+11
ZCREICEB EQU   ZCRENTER+11
ZCREICDB EQU   ZCRENTER+11
ZCREICCI EQU   ZCRENTER+10
ZCREICCB EQU   ZCRENTER+10
ZCREICBI EQU   ZCRENTER+10
ZCREICBB EQU   ZCRENTER+10
ZCREICAB EQU   ZCRENTER+10
ZCREICAA EQU   ZCRENTER+10
ZCREHCAN EQU   ZCRENTER+10
ZCREGC0B EQU   ZCRENTER+10
ZCREGC0A EQU   ZCRENTER+9
ZCREGCLA EQU   ZCRENTER+9
ZCREGCEB EQU   ZCRENTER+9
ZCREGCDB EQU   ZCRENTER+9
@NM00042 EQU   ZCRENTER+9
ZCREGCBB EQU   ZCRENTER+9
ZCREGCAB EQU   ZCRENTER+9
ZCREFCEB EQU   ZCRENTER+9
ZCREFCEA EQU   ZCRENTER+8
ZCREECTA EQU   ZCRENTER+8
ZCREECEA EQU   ZCRENTER+8
ZCREECDA EQU   ZCRENTER+8
ZCREECCB EQU   ZCRENTER+8
ZCREECCA EQU   ZCRENTER+8
ZCREECBB EQU   ZCRENTER+8
ZCREECBA EQU   ZCRENTER+8
ZCREDCMB EQU   ZCRENTER+7
ZCREDCL0 EQU   ZCRENTER+7
ZCREDCKB EQU   ZCRENTER+7
ZCREDCKA EQU   ZCRENTER+7
ZCREDCJ0 EQU   ZCRENTER+7
ZCREDCI0 EQU   ZCRENTER+7
ZCREDCH0 EQU   ZCRENTER+7
ZCREDCF0 EQU   ZCRENTER+7
ZCREDCE0 EQU   ZCRENTER+6
ZCREDCD0 EQU   ZCRENTER+6
ZCREDCC0 EQU   ZCRENTER+6
ZCREDCB0 EQU   ZCRENTER+6
ZCREDCA0 EQU   ZCRENTER+6
ZCRECC2B EQU   ZCRENTER+6
ZCRECC1B EQU   ZCRENTER+6
ZCRECC1A EQU   ZCRENTER+6
ZCRECC0B EQU   ZCRENTER+5
ZCRECC0A EQU   ZCRENTER+5
ZCREBC0B EQU   ZCRENTER+5
ZCREBC0A EQU   ZCRENTER+5
ZCREBCZ0 EQU   ZCRENTER+5
ZCREBCY0 EQU   ZCRENTER+5
ZCREBCX0 EQU   ZCRENTER+5
ZCREBCXA EQU   ZCRENTER+5
ZCREBCSC EQU   ZCRENTER+4
ZCREBCRB EQU   ZCRENTER+4
ZCREBCRA EQU   ZCRENTER+4
ZCREBCQB EQU   ZCRENTER+4
ZCREBCPB EQU   ZCRENTER+4
ZCREBCOB EQU   ZCRENTER+4
ZCREBCNE EQU   ZCRENTER+4
ZCREBCND EQU   ZCRENTER+4
ZCREBCMB EQU   ZCRENTER+3
ZCREBCLB EQU   ZCRENTER+3
ZCREBCLA EQU   ZCRENTER+3
ZCREBCKB EQU   ZCRENTER+3
ZCREBCKA EQU   ZCRENTER+3
ZCREBCJB EQU   ZCRENTER+3
ZCREBCJA EQU   ZCRENTER+3
ZCREBCID EQU   ZCRENTER+3
ZCREBCIB EQU   ZCRENTER+2
ZCREBCIA EQU   ZCRENTER+2
ZCREBCHB EQU   ZCRENTER+2
ZCREBCHA EQU   ZCRENTER+2
ZCREBCGB EQU   ZCRENTER+2
ZCREBCGA EQU   ZCRENTER+2
ZCREBCFB EQU   ZCRENTER+2
ZCREBCFA EQU   ZCRENTER+2
ZCREBCEB EQU   ZCRENTER+1
ZCREBCDI EQU   ZCRENTER+1
ZCREBCCB EQU   ZCRENTER+1
ZCREBCBI EQU   ZCRENTER+1
ZCREBCBB EQU   ZCRENTER+1
ZCREBCBA EQU   ZCRENTER+1
ZCREBCAM EQU   ZCRENTER+1
ZCREBCAI EQU   ZCRENTER+1
ZCREBCAG EQU   ZCRENTER
ZCREBCAE EQU   ZCRENTER
ZCREBCAB EQU   ZCRENTER
ZCREBCAA EQU   ZCRENTER
ZCREAC1B EQU   ZCRENTER
ZCREAC0B EQU   ZCRENTER
ZCREAC0A EQU   ZCRENTER
ZCREAC1A EQU   ZCRENTER
ZCRREMIC EQU   ISTZCRR+436
ZCRDAFSV EQU   ZCRCIDSV+2
ZCRSAFSV EQU   ZCRCIDSV
ZCRR13SV EQU   ISTZCRR+188
ZCRR2SV  EQU   ISTZCRR+184
ZCRPRMTC EQU   ISTZCRR+182
ZCRRCDSV EQU   ISTZCRR+181
ZCRAWQSW EQU   ISTZCRR+180
ZCRTOPQ  EQU   ISTZCRR+180
ZCRLSTFB EQU   ISTZCRR+180
ZCRXSCHD EQU   ISTZCRR+180
ZCRNXTEL EQU   ISTZCRR+180
ZCRSCANQ EQU   ISTZCRR+180
ZCRMOREL EQU   ISTZCRR+180
ZCRFBPRC EQU   ISTZCRR+180
ZCRFSBSV EQU   ISTZCRR+176
ZCRSVWK1 EQU   ZCRWKARA
ZCRSVF25 EQU   ZCRSVRTN+96
ZCRSVF24 EQU   ZCRSVRTN+92
ZCRSVF23 EQU   ZCRSVRTN+88
ZCRSVF22 EQU   ZCRSVRTN+84
ZCRSVF21 EQU   ZCRSVRTN+80
ZCRSVF20 EQU   ZCRSVRTN+76
ZCRSVF19 EQU   ZCRSVRTN+72
ZCRSVF18 EQU   ZCRSVRTN+68
ZCRSVF17 EQU   ZCRSVRTN+64
ZCRSVF16 EQU   ZCRSVRTN+60
ZCRSVF15 EQU   ZCRSVRTN+56
ZCRSVF14 EQU   ZCRSVRTN+52
ZCRSVF13 EQU   ZCRSVRTN+48
ZCRSVF12 EQU   ZCRSVRTN+44
ZCRSVF11 EQU   ZCRSVRTN+40
ZCRSVF10 EQU   ZCRSVRTN+36
ZCRSVF9  EQU   ZCRSVRTN+32
ZCRSVF8  EQU   ZCRSVRTN+28
ZCRSVF7  EQU   ZCRSVRTN+24
ZCRSVF3  EQU   ZCRSVRTN+8
ZCRPVZB  EQU   ISTZCRR+52
ZCRZLB   EQU   ISTZCRR+48
ZCRBFPTR EQU   ISTZCRR+44
ZCRCCWA  EQU   ISTZCRR+40
ZCRPSW   EQU   ZCRPARMS+15
ZCRPCHAR EQU   ZCRPARMS+14
ZCRPRES2 EQU   ZCRPCOD2
ZCRPMFGF EQU   ZCRPCOD2
ZCRPFHDR EQU   ZCRPCOD2
ZCRPPG2  EQU   ZCRPCOD2
ZCRPRES  EQU   ZCRPCOD1
ZCRPCFTX EQU   ZCRPCOD1
ZCRPBUF  EQU   ZCRPCOD1
ZCRPLSCB EQU   ZCRPCOD1
ZCRPLSBQ EQU   ZCRPLSBF
ZCRPLNG  EQU   ZCRPCOD1
ZCRPPG   EQU   ZCRPCOD1
ZCRDTODA EQU   ZCRDFRDA
ZCRMLNG  EQU   ZCRPARMS+8
ZCRTBPTR EQU   ZCRPARMS+4
ZCRCBPTR EQU   ZCRFBPTR
@NM00041 EQU   ZCRSCPSW
ZCRSKIPT EQU   ZCRSCPSW
ZCRFSBWE EQU   ZCRSCPSW
ZCRPRCMP EQU   ZCRSCPSW
ZCRLREQ  EQU   ZCRSCPSW
ZCRRJLCP EQU   ZCRSCPSW
ZCRTPINV EQU   ZCRSCPSW
ZCRTPEX  EQU   ZCRSCPSW
@NM00040 EQU   ZCRIBPR
ZCR3270R EQU   ZCRIBPR
ZCR3270  EQU   ZCRIBPR
ZCRLCPFD EQU   ZCRIBPR
ZCRLCPFR EQU   ZCRIBPR
ZCRRELK  EQU   ZCRIBPR
ZCRERR   EQU   ZCRIBPR
ZCRNOBUF EQU   ZCRIBPR
@NM00039 EQU   ZCRPFLGS
ZCRQAHED EQU   ZCRPFLGS
ZCRF1RES EQU   ZCRGENSW
ZCRBRIS  EQU   ZCRGENSW
ZCRCLRBD EQU   ZCRGENSW
ZCREXRES EQU   ZCRGENSW
ZCRLCSYN EQU   ZCRGENSW
ZCRRT06  EQU   ZCRGENSW
ZCRINLCP EQU   ZCRFLGS3
ZCRWRPTR EQU   ZCRFLGS3
ZCRNOFRE EQU   ZCRFLGS3
ZCREDRIV EQU   ZCRFLGS3
ZCRDISC  EQU   ZCRFLGS3
ZCRTPDIS EQU   ZCRFLGS3
ZCRTPCON EQU   ZCRFLGS3
ZCRTIC   EQU   ZCRFLGS3
ZCRCNLXL EQU   ZCRRESET
ZCRENDAN EQU   ZCRSWFLD
ZCRENDXL EQU   ZCRSWFLD
ZCRENDX  EQU   ZCRSWFLD
ZCROB1   EQU   ZCRNDLCP
ZCRENDPR EQU   ZCRSWFLD
ZCRSLCP  EQU   ZCRENDSH
ZCRIF0E3 EQU   ZCRFLGS2
ZCRIF0E2 EQU   ZCRFLGS2
ZCRIF0E1 EQU   ZCRFLGS2
ZCROB    EQU   ZCRFLGS2
ZCRFMSED EQU   ZCRFLGS2
ZCRSHEDI EQU   ZCRFLGS2
ZCRLOCAL EQU   ZCRFLGS2
ZCRFEXIT EQU   ZCRFLGS1
ZCRUNSOL EQU   ZCRFLGS1
ZCRENDLP EQU   ZCRFLGS1
ZCRNRMEX EQU   ZCRFLGS1
ZCRWAIT  EQU   ZCRFLGS1
ZCRDEQSW EQU   ZCRFLGS1
ZCRQUESW EQU   ZCRFLGS1
ZCREXSW  EQU   ZCRFLGS1
ZCRFLAG  EQU   ZCRCRR+3
LCPUBFSB EQU   LCPFLCCW
LCPRSV77 EQU   ISTLCPB+39
LCPLCCWC EQU   ISTLCPB+38
LCPRSV78 EQU   LCPFLG1
LCPTRANS EQU   LCPFLG1
LCPSTLB  EQU   LCPFLG1
LCPREDRV EQU   LCPFLG1
LCPDIRPT EQU   LCPFLG1
LCPSTYPE EQU   ISTLCPB+36
LCPFSNCH EQU   ISTLCPB+34
LCPFOSN  EQU   ISTLCPB+32
LCPTLBAD EQU   ISTLCPB+28
LCPFDB2  EQU   LCPFDBA+1
LCPFDB1  EQU   LCPFDBA
LCPDAF   EQU   LCPCID+2
LCPSAF   EQU   LCPCID
LCPLCCW1 EQU   ISTLCPB+12
LCPRRCNT EQU   LCPSEQ+1
LCPRRCCT EQU   LCPSEQ
LCPFREE  EQU   LCPFLAG2
LCPDSTAT EQU   LCPFLAG2
LCPEXRES EQU   LCPFID0
LCPZRIMM EQU   LCPTLBPI
LCPRSTRT EQU   LCPFLAG2
LCPASYN  EQU   LCPFLAG2
LCPPRFLG EQU   LCPFLAG2
LCPCHNG  EQU   LCPCHAI1
LCPZRT0B EQU   LCPMNRCD
LCPZRT0A EQU   LCPMNRCD
LCPZRTL9 EQU   LCPZRT09
LCPZRTL8 EQU   LCPZRT08
LCPZRTL7 EQU   LCPZRT07
LCPZRTL6 EQU   LCPZRT06
LCPZRTL5 EQU   LCPZRT05
LCPZRTL4 EQU   LCPZRT04
LCPZRTL3 EQU   LCPZRT03
LCPZRTL2 EQU   LCPZRT02
LCPZRT01 EQU   LCPFLAGS
LCPZRT00 EQU   LCPFLAGS
LCCWACI  EQU   LCCWFLAG
LCCWRFI  EQU   LCCWFLAG
LCCWPER  EQU   LCCWLSI
LCCWNTVC EQU   LCCWFLAG
LCCWCKPT EQU   LCCWFLAG
LCCWCC   EQU   LCCWFLAG
LCCWCD   EQU   LCCWFLAG
LCCWTYPE EQU   LCCWCTL
LCCWMODE EQU   LCCWCTL
LCCWSOP  EQU   LCCWRWOP
@NM00038 EQU   LCCWRWOP
LCCWSD   EQU   LCCWOP
LCCWSI   EQU   LCCWOP
ZSAZTRAC EQU   ISTZSAVE+36
ZSAZSVVR EQU   ISTZSAVE+12
ZSAZSVRR EQU   ISTZSAVE+8
ZSAZACTV EQU   ZSAZSVMS
RPHNEXPO EQU   ISTRPH+104
RPHSAV16 EQU   RPHWORK+60
RPHSAV15 EQU   RPHWORK+56
RPHSAV14 EQU   RPHWORK+52
RPHSAV13 EQU   RPHWORK+48
RPHSAV12 EQU   RPHWORK+44
RPHSAV11 EQU   RPHWORK+40
RPHSAV10 EQU   RPHWORK+36
RPHSAVE9 EQU   RPHWORK+32
RPHSAVE8 EQU   RPHWORK+28
RPHSAVE7 EQU   RPHWORK+24
RPHSAVE6 EQU   RPHWORK+20
RPHSAVE5 EQU   RPHWORK+16
RPHSAVE4 EQU   RPHWORK+12
RPHSAVE3 EQU   RPHWORK+8
RPHSAVE2 EQU   RPHWORK+4
RPHSHALF EQU   RPHSAVE1+2
RPHSBIT8 EQU   RPHSBITS
RPHSBIT7 EQU   RPHSBITS
RPHSBIT6 EQU   RPHSBITS
RPHSBIT5 EQU   RPHSBITS
RPHSBIT4 EQU   RPHSBITS
RPHSBIT3 EQU   RPHSBITS
RPHSBIT2 EQU   RPHSBITS
RPHSBIT1 EQU   RPHSBITS
RPHSBYTE EQU   RPHSAVE1
RPHPABFG EQU   RPHPABQA
RPHSRP34 EQU   RPHSRPRM+2
RPHSRP12 EQU   RPHSRPRM
RPHWEGT  EQU   RPHCSPA
RPHRESUM EQU   RPHRESMA+1
RPHRSV01 EQU   RPHWPFLG
RPHPURGE EQU   RPHWPFLG
RPHPT    EQU   RPHWPFLG
RPHRSKEY EQU   RPHWPFLG
RPHDVTA  EQU   ISTRPH+12
RPHTIK   EQU   RPHTSKID+3
@NM00037 EQU   RPHTSKID
RPHRPHAP EQU   RPHRPHA+1
@NM00036 EQU   RPHRPHA
RPHGATE  EQU   RPHRPHA
@NM00035 EQU   RPHFLGB
RPHRLCRA EQU   RPHFLGB
RPHNRSAV EQU   RPHFLGB
RPHPGCMP EQU   RPHFLGB
RPHFBAPS EQU   RPHFLGB
RPHBSSP  EQU   RPHFLGB
RPHLOCK  EQU   RPHFLGB
RPHFNFLG EQU   RPHFSTLC
RPHMLTCP EQU   RPHFLAGS
RPHSMCLR EQU   RPHFLAGS
RPHSMTYP EQU   RPHFLAGS
RPHSMQ   EQU   RPHFLAGS
RPHAUTEX EQU   RPHAPTYP
RPHSPGIN EQU   RPHFLAGS
RPHOGIND EQU   RPHFLAGS
RPHLNGTH EQU   RPHCNTL+1
RPHTYPE  EQU   RPHCNTL
ZFSZWRD4 EQU   ISTZFSVT+36
ZFSZWRD3 EQU   ISTZFSVT+32
ZFSZEFCB EQU   ISTZFSVT+28
ZFSZFFEB EQU   ISTZFSVT+24
ZFSZDFJ0 EQU   ISTZFSVT+20
ZFSZFFFB EQU   ISTZFSVT+16
ZFSZFFDB EQU   ISTZFSVT+12
ZFSZFFCB EQU   ISTZFSVT+8
ZFSZEMAB EQU   ZFSZEAAB
ZFSZEMBB EQU   ZFSZEABB
ZPSZDFQR EQU   ISTZPSVT+80
ZPSZDFPR EQU   ISTZPSVT+76
ZPSZDFXR EQU   ISTZPSVT+72
ZPSZWRD5 EQU   ISTZPSVT+68
ZPSZWRD4 EQU   ISTZPSVT+64
ZPSZDFMB EQU   ISTZPSVT+60
ZPSZDFMF EQU   ISTZPSVT+56
ZPSZDFNB EQU   ISTZPSVT+52
@NM00034 EQU   ISTZPSVT+48
ZPSZDFF0 EQU   ISTZPSVT+44
ZPSZTRTT EQU   ISTZPSVT+40
ZPSZBFOB EQU   ISTZPSVT+36
ZPSZBFMB EQU   ISTZPSVT+32
ZPSZBFZ0 EQU   ISTZPSVT+28
ZPSZBFY0 EQU   ISTZPSVT+24
ZPSZDFI0 EQU   ISTZPSVT+20
ZPSZDFD0 EQU   ISTZPSVT+8
ZPSZDFC0 EQU   ISTZPSVT+4
@NM00009 EQU   SRBSECT+40
@NM00008 EQU   SRBSECT+38
SRBPRIOR EQU   SRBSECT+37
SRBPKF   EQU   SRBSECT+36
SRBSAVE  EQU   SRBSECT+32
SRBPARM  EQU   SRBSECT+28
SRBRMTR  EQU   SRBSECT+24
SRBEP    EQU   SRBSECT+20
SRBPTCB  EQU   SRBFLC+4
SRBPASID EQU   SRBFLC+2
SRBCPAFF EQU   SRBFLC
SRBASCB  EQU   SRBSECT+8
SRBFLNK  EQU   SRBSECT+4
SRBID    EQU   SRBSECT
IOSEND   EQU   IOSB+108
IOSSKR   EQU   IOSEEKA+7
IOSSKH2  EQU   IOSSKHH+1
IOSSKH1  EQU   IOSSKHH
IOSSKCC  EQU   IOSCCHH
IOSSKBB  EQU   IOSEEKA+1
IOSSKM   EQU   IOSEEKA
IOSEEK   EQU   IOSB+92
IOSMDM   EQU   IOSB+91
IOSMDB   EQU   IOSB+90
IOSCKEY7 EQU   IOSCKEY
IOSCKEY6 EQU   IOSCKEY
IOSCKEY5 EQU   IOSCKEY
IOSCKEY4 EQU   IOSCKEY
@NM00004 EQU   IOSCKEY
IOSFMSK  EQU   IOSB+88
IOSCUDEV EQU   IOSPATH+1
@NM00003 EQU   IOSCHN
IOSPATH3 EQU   IOSCHN
IOSPATH2 EQU   IOSCHN
IOSEXP   EQU   IOSCHN
IOSGDP   EQU   IOSCHN
IOSAFF   EQU   IOSB+85
IOSRSS1B EQU   IOSB+84
IOSDSID  EQU   IOSB+80
IOSVST   EQU   IOSB+76
IOSRST   EQU   IOSB+72
IOSDIE   EQU   IOSB+68
IOSABN   EQU   IOSB+64
IOSNRM   EQU   IOSB+60
IOSPCI   EQU   IOSB+56
IOSERP   EQU   IOSB+52
IOSPCHN  EQU   IOSB+48
IOSSNS   EQU   IOSB+42
IOSAPMSK EQU   IOSB+40
IOSRES4A EQU   IOSB+36
IOSUSE   EQU   IOSB+32
IOSSRB   EQU   IOSB+28
IOSCSWRC EQU   IOSCSW+5
IOSTSB   EQU   IOSTATUS+1
IOSTSA   EQU   IOSTATUS
IOSCSWCA EQU   IOSCSW
IOSCC    EQU   @NM00002
IOSUCB   EQU   IOSB+16
IOSOPT2X EQU   IOSOPT2
IOSHTP   EQU   IOSOPT2
IOSRELSE EQU   IOSOPT
IOSAPR   EQU   IOSOPT
IOSTSLL  EQU   IOSOPT
IOSNERP  EQU   IOSOPT
IOSPSLL  EQU   IOSOPT
IOSQISCE EQU   IOSOPT
IOSDEP   EQU   IOSOPT
IOSBYP   EQU   IOSOPT
IOSCOD   EQU   IOSB+13
IOSPKY7  EQU   IOSPKEY
IOSPGDPX EQU   IOSPKEY
IOSIDR   EQU   IOSPKEY
IOSLCL   EQU   IOSPKEY
@NM00001 EQU   IOSPKEY
IOSPGAD  EQU   IOSB+8
IOSASID  EQU   IOSB+6
IOSPRLVL EQU   IOSB+5
IOSDVRID EQU   IOSB+4
IOSPROC  EQU   IOSB+3
IOSFLC7  EQU   IOSFLC
IOSFLC6  EQU   IOSFLC
IOSRWAIT EQU   IOSFLC
IOSTP    EQU   IOSFLC
IOSCC3WE EQU   IOSFLC
IOSVERIF EQU   IOSDVALT
IOSDVMNT EQU   IOSFLC
IOSLOG   EQU   IOSFLB
IOSBDCST EQU   IOSFLB
IOSMSG   EQU   IOSFLB
IOSFLB4  EQU   IOSFLB
IOSFLB3  EQU   IOSFLB
IOSFLB2  EQU   IOSFLB
IOSSDR   EQU   IOSFLB
IOSDIESE EQU   IOSFLB
IOSIOSB  EQU   IOSFLA
IOSDOM   EQU   IOSFLA
IOSEX    EQU   IOSFLA
IOSSMDB  EQU   IOSFLA
IOSSMDA  EQU   IOSFLA
IOSERR   EQU   IOSFLA
IOSCCHN  EQU   IOSACHN
IOSDCHN  EQU   IOSACHN
@NM00033 EQU   PSA+3668
PSASTAK  EQU   PSA+3072
@NM00032 EQU   PSA+1048
PSAUSEND EQU   PSA+1048
PSARV062 EQU   PSA+1044
PSACDAL  EQU   PSA+1040
PSAWTCOD EQU   PSA+1036
PSAATCVT EQU   PSA+1032
PSAPCPSW EQU   PSA+1024
PSAPIR2  EQU   PSA+1020
PSARV059 EQU   PSA+1018
PSASVC13 EQU   PSA+1016
PSALSFCC EQU   PSA+1012
PSASFACC EQU   PSA+1008
PSASTOP  EQU   PSA+992
PSASTART EQU   PSA+976
PSARSPSW EQU   PSA+968
PSASRPSW EQU   PSA+960
PSARV045 EQU   PSA+892
PSARV044 EQU   PSA+888
PSARV043 EQU   PSA+884
PSARV042 EQU   PSA+880
PSARV041 EQU   PSA+876
PSARV040 EQU   PSA+872
PSARV025 EQU   PSA+868
PSADSSED EQU   PSA+868
PSADSSPR EQU   PSA+864
PSADSSFW EQU   PSA+860
PSADSS14 EQU   PSA+856
PSADSSPP EQU   PSA+848
PSADSSRP EQU   PSA+840
PSADSS05 EQU   PSADSSF4
PSADSS10 EQU   PSADSSF4
PSADSSVE EQU   PSADSSF4
PSADSSDE EQU   PSADSSF4
PSADSSC0 EQU   PSADSSF4
PSADSSIE EQU   PSADSSF4
PSADSS12 EQU   PSADSSF4
PSADSSRC EQU   PSADSSF4
PSARV057 EQU   PSADSSF3
PSARV056 EQU   PSADSSF3
PSARV055 EQU   PSADSSF3
PSADSSMC EQU   PSADSSF3
PSADSSRW EQU   PSADSSF3
PSADSSNM EQU   PSADSSF3
PSADSSES EQU   PSADSSF3
PSADSSGP EQU   PSADSSF3
PSADSSF2 EQU   PSADSSFL+1
PSADSSPI EQU   PSADSSF1
PSADSSOI EQU   PSADSSF1
PSADSSSP EQU   PSADSSF1
PSADSSTP EQU   PSADSSF1
PSADSSDW EQU   PSADSSF1
PSADSSDD EQU   PSADSSF1
PSADSSDM EQU   PSADSSF1
PSADSSMV EQU   PSADSSF1
PSADSSTS EQU   PSA+816
PSADSSWK EQU   PSA+812
PSADSSR3 EQU   PSA+808
PSADSSR2 EQU   PSA+804
PSADSSRS EQU   PSA+800
PSASTOR  EQU   PSA+796
PSACPUSA EQU   PSA+794
PSAVSTAP EQU   PSA+792
PSAWKVAP EQU   PSA+788
PSAWKRAP EQU   PSA+784
PSAMCHIC EQU   PSA+783
PSARV061 EQU   PSA+782
PSASYMSK EQU   PSA+781
PSAMCHFL EQU   PSA+780
PSACR0   EQU   PSA+776
PSAPSWSV EQU   PSA+768
PSALITA  EQU   PSA+764
PSACLHS  EQU   PSAHLHI
PSALKR15 EQU   PSALKSA+60
PSALKR14 EQU   PSALKSA+56
PSALKR13 EQU   PSALKSA+52
PSALKR12 EQU   PSALKSA+48
PSALKR11 EQU   PSALKSA+44
PSALKR10 EQU   PSALKSA+40
PSALKR9  EQU   PSALKSA+36
PSALKR8  EQU   PSALKSA+32
PSALKR7  EQU   PSALKSA+28
PSALKR6  EQU   PSALKSA+24
PSALKR5  EQU   PSALKSA+20
PSALKR4  EQU   PSALKSA+16
PSALKR3  EQU   PSALKSA+12
PSALKR2  EQU   PSALKSA+8
PSALKR1  EQU   PSALKSA+4
PSALKR0  EQU   PSALKSA
PSARV023 EQU   PSACLHT+52
PSALOCAL EQU   PSACLHT+48
PSACMSL  EQU   PSACLHT+44
PSAOPTL  EQU   PSACLHT+40
PSATPACL EQU   PSACLHT+36
PSATPDNL EQU   PSACLHT+32
PSATPNCL EQU   PSACLHT+28
PSAIOSLL EQU   PSACLHT+24
PSAIOSUL EQU   PSACLHT+20
PSAIOSCL EQU   PSACLHT+16
PSAIOSSL EQU   PSACLHT+12
PSASALCL EQU   PSACLHT+8
PSAASML  EQU   PSACLHT+4
PSADISPL EQU   PSACLHT
PSASRSA  EQU   PSA+636
PSARV050 EQU   PSA+634
PSADSSGO EQU   PSA+633
PSARECUR EQU   PSA+632
PSAHLHIS EQU   PSA+628
PSAIPCSA EQU   PSA+624
@NM00031 EQU   PSA+621
PSAIPCDM EQU   PSA+620
PSAIPCD  EQU   PSA+616
@NM00030 EQU   PSA+613
PSAIPCRM EQU   PSA+612
PSAIPCR  EQU   PSA+608
PSAMCHEX EQU   PSA+600
PSAMPSW  EQU   PSA+592
PSAEXPS2 EQU   PSA+584
PSAEXPS1 EQU   PSA+576
PSAPIREG EQU   PSA+572
PSARSREG EQU   PSA+568
PSAGPREG EQU   PSA+556
PSARV022 EQU   PSASUP4
PSARV021 EQU   PSASUP4
PSARV020 EQU   PSASUP4
PSARV019 EQU   PSASUP4
PSARV018 EQU   PSASUP4
PSARV017 EQU   PSASUP4
PSARV016 EQU   PSASUP4
PSARV015 EQU   PSASUP4
PSARV014 EQU   PSASUP3
PSARV013 EQU   PSASUP3
PSARV012 EQU   PSASUP3
PSARV011 EQU   PSASUP3
PSASPR   EQU   PSASUP3
PSAPSREG EQU   PSASUP3
PSAPI2   EQU   PSASUP3
PSAIOSUP EQU   PSASUP3
PSALCR   EQU   PSASUP2
PSARTM   EQU   PSASUP2
PSAACR   EQU   PSASUP2
PSAIPCE2 EQU   PSASUP2
PSAIPCES EQU   PSASUP2
PSAIPCEC EQU   PSASUP2
PSAGTF   EQU   PSASUP2
PSAIPCRI EQU   PSASUP2
PSARV063 EQU   PSASUP1
PSATCTL  EQU   PSASUP1
PSADISP  EQU   PSASUP1
PSALOCK  EQU   PSASUP1
PSAPI    EQU   PSASUP1
PSAEXT   EQU   PSASUP1
PSASVC   EQU   PSASUP1
PSAIO    EQU   PSASUP1
PSAAOLD  EQU   PSA+548
PSAANEW  EQU   PSA+544
PSATOLD  EQU   PSA+540
PSATNEW  EQU   PSA+536
PSALCCAR EQU   PSA+532
PSALCCAV EQU   PSA+528
PSAPCCAR EQU   PSA+524
PSAPCCAV EQU   PSA+520
PSACPULA EQU   PSA+518
PSACPUPA EQU   PSA+516
PSAPSA   EQU   PSA+512
FLCHDEND EQU   PSA+512
FLCCRSAV EQU   FLCMCLA+280
FLCGRSAV EQU   FLCMCLA+216
FLCFPSAV EQU   FLCMCLA+184
FLCFLA   EQU   FLCMCLA+88
FLCRGNCD EQU   FLCMCLA+84
FLCFSAA  EQU   FLCFSA+1
@NM00029 EQU   FLCFSA
@NM00028 EQU   FLCMCLA+72
FLCMCIC  EQU   FLCMCLA+64
@NM00027 EQU   FLCMCLA+20
FLCIOAA  EQU   FLCIOA+1
@NM00026 EQU   FLCIOA
@NM00025 EQU   FLCMCLA+15
@NM00024 EQU   FLCMCLA+14
@NM00023 EQU   FLCMCLA+12
FLCLCL   EQU   FLCMCLA+8
FLCIOELA EQU   FLCIOEL+1
@NM00022 EQU   FLCIOEL
FLCCHNID EQU   FLCMCLA
@NM00021 EQU   PSA+160
FLCMTRCD EQU   PSA+157
@NM00020 EQU   PSA+156
FLCPERA  EQU   FLCPER+1
@NM00019 EQU   FLCPER
@NM00018 EQU   PSA+151
FLCPERCD EQU   PSA+150
FLCMCNUM EQU   PSA+149
@NM00017 EQU   PSA+148
FLCTEAA  EQU   FLCTEA+1
@NM00016 EQU   FLCTEA
PSAPIPC  EQU   PSAPICOD
PSAPIMC  EQU   PSAPICOD
PSAPIPER EQU   PSAPICOD
PSARV049 EQU   FLCPICOD
FLCPILCB EQU   FLCPIILC
@NM00015 EQU   FLCPIILC
@NM00014 EQU   PSAEPPSW
FLCSVCN  EQU   PSAESPSW+2
FLCSILCB EQU   FLCSVILC
@NM00013 EQU   FLCSVILC
@NM00012 EQU   PSAESPSW
FLCEICOD EQU   PSAEEPSW+2
PSASPAD  EQU   PSAEEPSW
@NM00011 EQU   PSA+128
FLCINPSW EQU   PSA+120
FLCMNPSW EQU   PSA+112
FLCPNPSW EQU   PSA+104
FLCSNPSW EQU   PSA+96
FLCENPSW EQU   PSA+88
FLCTRACE EQU   PSA+84
FLCTIMER EQU   PSA+80
FLCCVT2  EQU   PSA+76
FLCCAW   EQU   PSA+72
FLCCSW   EQU   PSA+64
FLCIOPSW EQU   PSA+56
FLCMOPSW EQU   PSA+48
FLCPOPSW EQU   PSA+40
FLCSOPSW EQU   PSA+32
FLCEOPSW EQU   PSA+24
@NM00010 EQU   FLCICCW2+4
FLCCVT   EQU   FLCICCW2
FLCICCW1 EQU   FLCROPSW
FLCIPPSW EQU   FLCRNPSW
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS
@RC00719 EQU   @RC00714
@RC00715 EQU   @RC00714
@RC00742 EQU   @RC00714
SEG00BB# EQU   @RC00714
@RC01109 EQU   @RC01103
SEG0CEA@ EQU   @EL00003
@RC01410 EQU   @RC01408
@PB00006 EQU   @PB00007
@RC01651 EQU   @RC01648
@PB00011 EQU   @PB00012
SEG00BC# EQU   @RC00715
SEG00BE# EQU   @RC00719
SEG00BA# EQU   @RC00742
@PB00005 EQU   @PB00006
@PB00010 EQU   @PB00011
@PB00004 EQU   @PB00005
@PB00009 EQU   @PB00010
@PB00003 EQU   @PB00004
@PB00008 EQU   @PB00009
@PB00002 EQU   @PB00003
SEGDEQF@ EQU   @PB00008
SEG0BEA@ EQU   @PB00002
@ENDDATA EQU   *
         END   ISTZAF1R,(C'PLS1939',0603,78061)
