/* REXX
 ×
 × Name: SYSVAR
 ×
 × Author: David Alcock
 ×         dalcock@csw.com (work)
 ×         davea@ticnet.com (home)
 ×
 × Purpose: Show all of the SYSVAR() variables
 */
address TSO "CLRSCRN"   /* Installation dependant */
say "SYSVAR():"
say "  User:"
say "    syspref---"sysvar(syspref)
say "    sysproc---"sysvar(sysproc)
say "    sysuid----"sysvar(sysuid)
say "  Terminal:"
say "    syslterm--"sysvar(syslterm)
say "    syswterm--"sysvar(syswterm)
say "  Exec:"
say "    sysenv----"sysvar(sysenv)
say "    sysicmd---"sysvar(sysicmd)
say "    sysispf---"sysvar(sysispf)
say "    sysnest---"sysvar(sysnest)
say "    syspcmd---"sysvar(syspcmd)
say "    sysscmd---"sysvar(sysscmd)
say "  System:"
say "    syscpu----"sysvar(syscpu)
say "    syshsm----"sysvar(syshsm)
say "    syslracf--"sysvar(syslracf)
say "    sysracf---"sysvar(sysracf)
say "    syssrv----"sysvar(syssrv)
say "    systsoe---"sysvar(systsoe)
if sysvar(systsoe) > "2040" then do
   say "    sysjes----"sysvar(sysjes)
   say "    sysnode---"sysvar(sysnode)
   say "    systermid-"sysvar(systermid)
   end
say "  Language:"
say "    sysdterm--"sysvar(sysdterm)
say "    syskterm--"sysvar(syskterm)
say "    sysplang--"sysvar(sysplang)
say "    sysslang--"sysvar(sysslang)
say " "

if sysvar(systsoe) > "2040" then do
   say "non-SYSVAR:"
   x = syscpus(cpus.)
   if x == 0 then do
      do i = 1 to cpus.0
         say "  syscpus."i" ... "cpus.i
         end
      end
end
