         TITLE 'IGCT010D - TCOPY,TCHNG,ICOPY,ICHNG SERVICE RTN         *
                        '
IGCT010D CSECT ,                                                   0001
@PROLOG  BALR  @11,0                                               0001
@PSTART  DS    0H                                                  0001
         USING @PSTART,@11                                         0001
IGCT010D  IEDHJN  AFTERHJN,HJN   MODULE ID MACRO
*   ROPCAVT=REG1;                   /* ADDRESS OF OP CTL AVT @Y17XAR5*/
         LR    ROPCAVT,REG1                                        0350
*   PARAM=OCCIB;                    /* ADDR OF PARAMETER LIST      0351
*                                                            @Y17XAR5*/
         L     @12,OPCCOPCE(,ROPCAVT)                              0351
         L     PARAM,OCCIB-1(,@12)                                 0351
         LA    PARAM,0(,PARAM)                                     0351
*   AVT=OPCAVTPT;                   /* ADDRESS OF TCAM AVT   @Y17XAR5*/
         L     AVT,OPCAVTPT(,ROPCAVT)                              0352
*   RSAVE=ADDR(OPCSAVE);            /* ADDRESS OF SAVEAREA   @Y17XARW*/
         LA    RSAVE,OPCSAVE(,ROPCAVT)                             0353
*   OPCFLAG1=ZERO;                  /* CLEAR FLAGS           @Y17XAR5*/
         MVI   OPCFLAG1(ROPCAVT),X'00'                             0354
*   IF OCPARM^=ZERO THEN            /* IS THIS A RETURN FORM       0355
*                                      STARTLINE?            @Y17XAR5*/
         LH    @10,OCPARM(,@12)                                    0355
         LTR   @10,@10                                             0355
         BNZ   @RT00355                                            0355
*     GO TO FREERU;                 /* YES                   @Y17XAR5*/
*   ELSE                                                           0357
*     IF OCRESP='0'B THEN           /* IS IT AN OPCE WITHOUT       0357
*                                      RESPONSE?             @Y17XAR5*/
         TM    OCRESP(@12),B'00000001'                             0357
         BZ    @RT00357                                            0357
*       GO TO REQUEST;              /* YES - PROCESS REQUEST @Y17XAR5*/
*     ELSE                                                         0359
*       GO TO ANSWER;               /* NO - PROCESS RESPONSE @Y17XAR5*/
         B     ANSWER                                              0359
*FREERU:                                                           0360
*   REG1=OPCCOPCE;                  /* SETUP TO FREE START/STOP OPCE
*                                                            @Y17XAR5*/
FREERU   L     REG1,OPCCOPCE(,ROPCAVT)                             0360
*   OPCCOPCE=REG1->OCCIB;           /* SETUP REAL OPCE       @Y17XAR5*/
         L     @12,OCCIB-1(,REG1)                                  0361
         LA    @12,0(,@12)                                         0361
         ST    @12,OPCCOPCE(,ROPCAVT)                              0361
*   GOTO COMPLETE;                  /* FINISH PROCESSING ICHNG     0362
*                                                            @Y17XARW*/
         B     COMPLETE                                            0362
*REQUEST:                           /*                       @Y17XAR5*/
*   PARAM->WQCBADR=OPCCOPCE;        /* SAVE ELEMENT ADDRESS  @Y17XAR5*/
REQUEST  L     @12,OPCCOPCE(,ROPCAVT)                              0363
         ST    @12,WQCBADR(,PARAM)                                 0363
*   IF PARAM->WENTCD<=1 THEN        /* IS IT TCOPY OR TCHNG? @Y17XAR5*/
         CLI   WENTCD(PARAM),1                                     0364
         BH    @RF00364                                            0364
*     DO;                           /* YES                   @Y17XAR5*/
*       CALL GETUNIT;               /* GET AND BUILD RU      @Y17XAR5*/
         BAL   @14,GETUNIT                                         0366
*       BDUCMND=CD0CTRL;            /* SET UP MODIFIER       @Y17XAR5*/
         LA    @12,12                                              0367
         ALR   @12,RPRU                                            0367
         MVI   BDUCMND(@12),X'08'                                  0367
*       BDUMODIF=CD0CCDSI;          /*                       @Y17XAR5*/
         MVI   BDUMODIF(@12),X'21'                                 0368
*     END;                          /*                       @Y17XAR5*/
*   ELSE                                                           0370
*     DO;                           /* ICOPY OR ICHNG        @Y17XAR5*/
         B     @RC00364                                            0370
@RF00364 DS    0H                                                  0371
*       CALL GETUNIT;               /* GET AND BUILD RU      @Y17XAR5*/
         BAL   @14,GETUNIT                                         0371
*       RELEASE(PARAM);                                            0372
*       BDUCMND=CD0CTRL;            /* SET UP MODIFIER       @Y17XAR5*/
         LA    @12,12                                              0373
         ALR   @12,RPRU                                            0373
         MVI   BDUCMND(@12),X'08'                                  0373
*       BDUMODIF=CD0CCSII;          /*                       @Y17XAR5*/
         MVI   BDUMODIF(@12),X'05'                                 0374
*     END;                          /*                       @Y17XAR5*/
*   OPCMODID=MOD02;                 /* MODULE ID FOR XCTL    @Y17XAR5*/
@RC00364 MVC   OPCMODID(2,ROPCAVT),MOD02                           0376
*   GO TO XCTL;                     /* TRANSFER CONTROL TO DISPATCHER
*                                                            @Y17XAR5*/
         B     XCTL                                                0377
*   RESTRICT(PARAM);                                               0378
*   RESPECIFY                                                      0379
*     REG12 RESTRICTED;                                            0379
*GETUNIT:                                                          0380
*                                                                  0380
*   /*****************************************************************/
*   /*                                                               */
*   /* THIS ROUTINE BUILDS A REQUEST UNIT AND SENDS IT TO THE RU     */
*   /* DISPATCHER                                            @Y17XAR5*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0380
*   RFY                                                            0380
*     REG14 RSTD;                   /*                       @Y17XAR5*/
GETUNIT  DS    0H                                                  0381
*   SAVERET1=REG14;                 /* SAVE RETURN REG       @Y17XAR5*/
         L     @15,OPCWORK(,ROPCAVT)                               0381
         ST    REG14,SAVERET1(,@15)                                0381
*   RFY                                                            0382
*     REG14 UNRSTD;                 /*                       @Y17XAR5*/
*   TNTNDX=WTNTNDX;                 /* SAVE TRM NAME TABLE INDEX     */
         LH    @10,WTNTNDX(,PARAM)                                 0383
         STH   @10,TNTNDX(,@15)                                    0383
*   IF TNTNDX=ZERO THEN                                            0384
         LTR   @10,@10                                             0384
         BNZ   @RF00384                                            0384
*     DO;                           /*                       @Y17XARW*/
*       RTRM=WTO-LENGTH(IEDNTRM);   /* SETUP TTE             @Y17XARW*/
         L     @10,WTO(,PARAM)                                     0386
         SL    @10,@CF01542                                        0386
         ST    @10,RTRM(,ROPCAVT)                                  0386
*       TNTNDX=OCTRMTBL;            /* SETUP TNT             @Y17XARW*/
         L     @10,OPCCOPCE(,ROPCAVT)                              0387
         LH    @10,OCTRMTBL(,@10)                                  0387
         N     @10,@CF01908                                        0387
         STH   @10,TNTNDX(,@15)                                    0387
*     END;                          /*                       @Y17XARW*/
*   ELSE                                                           0389
*     DO;                           /*                       @Y17XARW*/
         B     @RC00384                                            0389
@RF00384 DS    0H                                                  0390
*       REG1=TNTNDX;                /* GET TNT INDEX         @YM07744*/
         L     @10,OPCWORK(,ROPCAVT)                               0390
         LH    REG1,TNTNDX(,@10)                                   0390
*       CALL IEDQTNT;               /* GET TTE               @YM07744*/
         L     @15,AVTRNMPT(,AVT)                                  0391
         BALR  @14,@15                                             0391
*       RTRM=REG1-LENGTH(IEDNTRM);  /* BACKUP TERM ADDR      @Y17XAR5*/
         LR    @10,REG1                                            0392
         SL    @10,@CF01542                                        0392
         ST    @10,RTRM(,ROPCAVT)                                  0392
*       OCTRMTBL=TNTNDX;            /* SETUP TNT IN OPCE     @Y17XAR5*/
         L     @10,OPCCOPCE(,ROPCAVT)                              0393
         L     @09,OPCWORK(,ROPCAVT)                               0393
         LH    @09,TNTNDX(,@09)                                    0393
         STH   @09,OCTRMTBL(,@10)                                  0393
*     END;                          /*                       @Y17XARW*/
*   CALL CHK3705;                   /* CHECK 3705 STATUS     @Y17XAR5*/
@RC00384 BAL   @14,CHK3705                                         0395
*   IF ERRFLG='1'B THEN                                            0396
         TM    ERRFLG(ROPCAVT),B'10000000'                         0396
         BO    @RT00396                                            0396
*     GOTO ERREXIT;                 /* PROCESS ERROR         @Y17XAR5*/
*   PARAM->WLINK=SAVTRQCH;          /* LINK THIS CIB ...       S05331*/
         L     @10,AVTSAVTP(,AVT)                                  0398
         MVC   WLINK(3,PARAM),SAVTRQCH+1(@10)                      0398
*   SAVTRQCH=PARAM;                 /* ... AT TOP OF CHAIN     S05331*/
         ST    PARAM,SAVTRQCH(,@10)                                0399
*   PARAM->WRTCD=0;                 /* CLEAR THE RETURN CODE @ZA02648*/
         MVI   WRTCD(PARAM),X'00'                                  0400
*   RFY                                                            0401
*     REG15 RSTD;                   /*                       @Y17XARW*/
*   REG15=OPCGETBF;                 /* ADDRESS OF GETBUFF RTN      0402
*                                                            @Y17XAR5*/
         L     REG15,OPCGETBF(,ROPCAVT)                            0402
*   REG1=ONE;                       /* SET NUMBER OF UNITS           */
         LA    REG1,1                                              0403
*   GENERATE;                                                      0404
         BALR  REG14,REG15         /* LINK TO GET UNIT               */
*   RFY                                                            0405
*     REG15 UNRSTD;                 /*                       @Y17XAR5*/
*BUILDRU:                           /* NOW BUILD AN RU       @Y17XAR5*/
*   OCUNIT=REG1;                    /* SAVE BUF ADDR IN OPCE @Y17XAR5*/
BUILDRU  L     @10,OPCCOPCE(,ROPCAVT)                              0406
         ST    REG1,OCUNIT(,@10)                                   0406
*   RPRU=REG1;                      /* SETUP RU BASE         @Y17XAR5*/
         LR    RPRU,REG1                                           0407
*   PRURH=TRHFID0;                  /* SET UP RH FLAGS       @Y17XAR5*/
         LR    @09,RPRU                                            0408
         SL    @09,@CF00064                                        0408
         MVC   PRURH(3,@09),@CB01509                               0408
*   PRUTH=TTH0BYT0;                 /* SET UP TH FLAGS       @Y17XAR5*/
         MVI   PRUTH(@09),X'0C'                                    0409
*   PRUTTCIN=TNTNDX;                /* SET UP TNT            @Y17XAR5*/
         L     @09,OPCWORK(,ROPCAVT)                               0410
         LH    @06,TNTNDX(,@09)                                    0410
         STH   @06,PRUTTCIN(,RPRU)                                 0410
*   PRUDATCT=LENGTH(IEDBDU);        /* SET UP DATA COUNT     @Y17XAR5*/
         MVC   PRUDATCT(2,RPRU),@CH00089                           0411
*   PRUTIC=INVALTIC;                /* SET UP INVALID TIC    @Y17XAR5*/
         MVC   PRUTIC(4,RPRU),@CB01756                             0412
*   BDUHEADR='1'B;                  /* TURN ON HDR FLAG      @Y17XAR5*/
         OI    BDUHEADR+12(RPRU),B'01000000'                       0413
*   OCWTG=MODT0;                    /* SET UP RETURN TO T0   @Y17XAR5*/
         MVC   OCWTG(2,@10),MODT0                                  0414
*   OCACTREQ='1'B;                  /* YES- INDICATE IN OPCE @Y17XAR5*/
         OI    OCACTREQ(@10),B'00001000'                           0415
*   OCPTRSAV=INVALTIC;              /* INDICATE NO SAVED BUFFERS YET
*                                                            @Y17XAR5*/
         MVC   OCPTRSAV(4,@10),@CF01756                            0416
*   REG14=SAVERET1;                 /* RESTORE RETURN REG    @Y17XAR5*/
         L     REG14,SAVERET1(,@09)                                0417
*   RETURN;                                                        0418
@EL00001 DS    0H                                                  0418
@EF00001 DS    0H                                                  0418
@ER00001 BR    @14                                                 0418
*ERREXIT:                           /* YES                   @Y17XAR5*/
*   OCUNIT=INVALTIC;                /* SET UP INVALID TIC    @Y17XAR5*/
ERREXIT  L     @10,OPCCOPCE(,ROPCAVT)                              0419
         MVC   OCUNIT(4,@10),@CF01756                              0419
*   PARAM->WVERB=RNRETCD;           /* RETURN FROM 3705 SERVICE    0420
*                                      ROUTINE FLAG          @G36XRRU*/
         MVI   WVERB(PARAM),X'FF'                                  0420
*   OPCLDNME=MODNAMEA;              /* XCTL MODULE NAME      @G36XRRU*/
         MVC   OPCLDNME(8,ROPCAVT),MODNAMEA                        0421
*   PARAM->WRTCD=BADRSP;            /* SAVE RETURN CODE      @G36XRRU*/
         MVI   WRTCD(PARAM),X'1C'                                  0422
*   GO TO XCTL;                     /* RETURN TO APPLICATION @Y17XAR5*/
         B     XCTL                                                0423
*ANSWER:                                                           0424
*                                                                  0424
*   /*****************************************************************/
*   /*                                                               */
*   /* THIS ROUTINE PROCESSES RESPONSES                      @Y17XAR5*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0424
*   IF(WANSCD>TCHNG1A&WANSCD<=TCHNG1B)/* IF 1ST PASS OF      @ZM46809*/
*     THEN                                                         0424
ANSWER   CLI   WANSCD(PARAM),7                                     0424
         BNH   @RF00424                                            0424
         CLI   WANSCD(PARAM),11                                    0424
         BH    @RF00424                                            0424
*     DO;                           /* TCHNG DO NOT          @ZM46809
*                                      DEQUEUE CIB           @ZM46809*/
*       WENTCD=WANSCD;              /* SET ANSWER CODE       @ZM46809*/
         IC    @10,WANSCD(,PARAM)                                  0426
         STC   @10,WENTCD(,PARAM)                                  0426
*       GOTO BRANCH;                /* PROCESS RESPONSE      @ZM46809*/
         B     BRANCH                                              0427
*     END;                                                         0428
*   IF(WANSCD>TCHNG1A&              /* IS THIS FIRST         @Y17XAR5*/
*       WANSCD<=TCHNG1B)×           /* ENTRY FOR TCHNG       @Y17XAR5*/
*       WANSCD=TCHNG2×              /* IS THIS SECOND TCHNG  @Y17XAR5*/
*       WANSCD=ICOPY×               /* IS THIS ICOPY         @Y17XAR5*/
*       WANSCD=TCOPY                /* IS THIS TCOPY         @Y17XAR5*/
*     THEN                                                         0429
@RF00424 CLI   WANSCD(PARAM),7                                     0429
         BNH   @GL00004                                            0429
         CLI   WANSCD(PARAM),11                                    0429
         BNH   @RT00429                                            0429
@GL00004 CLI   WANSCD(PARAM),12                                    0429
         BE    @RT00429                                            0429
         CLI   WANSCD(PARAM),4                                     0429
         BE    @RT00429                                            0429
         CLI   WANSCD(PARAM),0                                     0429
         BNE   @RF00429                                            0429
@RT00429 DS    0H                                                  0430
*     DO;                                                          0430
*       CALL CIBLOOP;               /* SEARCH FOR CIB        @Y17XAR5*/
         BAL   @14,CIBLOOP                                         0431
*       IF NOCIB='1'B THEN                                         0432
         TM    NOCIB(ROPCAVT),B'01000000'                          0432
         BO    @RT00432                                            0432
*         GOTO FREEOPCE;            /* IF NO CIB, FREE OPCE AND UNITS
*                                                            @Y17XAR5*/
*       IF^(ELMNT->WANSCD>TCHNG1A&ELMNT->WANSCD<=TCHNG1B) THEN/* IF
*                                      NOT FIRST ENTRY FOR TCHNG   0434
*                                                            @Y17XAR5*/
         L     @10,ELMNT-1(,ROPCAVT)                               0434
         LA    @10,0(,@10)                                         0434
         CLI   WANSCD(@10),7                                       0434
         BNH   @RT00434                                            0434
         CLI   WANSCD(@10),11                                      0434
         BNH   @RF00434                                            0434
@RT00434 DS    0H                                                  0435
*         PARAM->WLINK=ELMNT->WLINK;/* TAKE CIB OFF CHAIN      S05331*/
         L     @10,ELMNT-1(,ROPCAVT)                               0435
         MVC   WLINK(3,PARAM),WLINK(@10)                           0435
*     END;                          /*                       @Y17XAR5*/
*   ELSE                                                           0437
*     ELMNT=PARAM;                  /* SETUP CIB ADDRESS     @Y17XAR5*/
         B     @RC00429                                            0437
@RF00429 STCM  PARAM,7,ELMNT(ROPCAVT)                              0437
*   ELMNT->WENTCD=ELMNT->WANSCD;    /* SET ANSWER CODE               */
@RC00429 L     @10,ELMNT-1(,ROPCAVT)                               0438
         LA    @10,0(,@10)                                         0438
         IC    @09,WANSCD(,@10)                                    0438
         STC   @09,WENTCD(,@10)                                    0438
*   RFY                                                            0439
*     RWORK RSTD;                   /*                       @Y17XAR5*/
*BRANCH:                            /*                       @ZM46809*/
*   RWORK=ELMNT->WENTCD;            /* GET ANSWER CODE       @Y17XAR5*/
BRANCH   L     @10,ELMNT-1(,ROPCAVT)                               0440
         SLR   RWORK,RWORK                                         0440
         IC    RWORK,WENTCD(,@10)                                  0440
*   SRL(RWORK,2);                   /* SHIFT OUT FLAGS       @Y17XAR5*/
         SRL   RWORK,2                                             0441
*   SLL(RWORK,2);                   /* RESTORE CODE VALUE    @Y17XAR5*/
         SLL   RWORK,2                                             0442
*   GEN;                                                           0443
         B     BRANCHA(RWORK)      /* BRANCH TO PROPER ROUTINE       */
BRANCHA  EQU   *
         B     ATCOPY              /* TCOPY RESPONSE ROUTINE         */
         B     AICOPY              /* ICOPY RESPONSE ROUTINE         */
         B     ATCHNG1             /* TCHNG RESPONSE 1 ROUTINE       */
         B     ATCHNG2             /* TCHNG RESPONSE 2 ROUTINE       */
         B     AICHNG1             /* ICHNG RESPONSE 1 ROUTINE       */
         B     AICHNG2             /* ICHNG RESPONSE 2 ROUTINE       */
*   RFY                                                            0444
*     RWORK UNRSTD;                 /*                       @Y17XAR5*/
*FREEOPCE:                          /*                       @Y17XAR5*/
*   CALL CHAINBUF;                  /* CHAIN SAVED BUFFS TO OPCE   0445
*                                                            @Y17XAR5*/
FREEOPCE BAL   @14,CHAINBUF                                        0445
*   REG1=OPCCOPCE;                  /* SET UP TO FREE OPCE   @Y17XAR5*/
         L     REG1,OPCCOPCE(,ROPCAVT)                             0446
*   CALL FREEBUFF;                  /* FREE OPCE             @Y17XAR5*/
         L     @15,OPCFREBF(,ROPCAVT)                              0447
         BALR  @14,@15                                             0447
*   REG0=ZERO;                      /* SETUP FOR NEXT MOD    @Y17XAR5*/
         SLR   REG0,REG0                                           0448
*   OPCMODID=MOD00;                 /* SETUP NEXT MOD ID     @Y17XAR5*/
         MVC   OPCMODID(2,ROPCAVT),MOD00                           0449
*   GOTO XCTL;                      /* XCTL TO NEXT MOD      @Y17XAR5*/
         B     XCTL                                                0450
*COMPLETE:                                                         0451
*   IF REG1->OCATTACH='1'B THEN                                    0451
COMPLETE TM    OCATTACH(REG1),B'00000010'                          0451
         BNO   @RF00451                                            0451
*     DO;                           /* ARE THERE ATTACHED OPCES?   0452
*                                                            @Y17XAR5*/
*       OPCNEXT=REG1->OCELEM;       /* CHAIN OPCES TO OP CTL AVT   0453
*                                                            @Y17XAR5*/
         L     @10,OCELEM(,REG1)                                   0453
         ST    @10,OPCNEXT(,ROPCAVT)                               0453
*       REG1->OCELEM=ZERO;          /* DETACH OPCES          @Y17XAR5*/
         SLR   @10,@10                                             0454
         ST    @10,OCELEM(,REG1)                                   0454
*       REG1->OCATTACH='0'B;        /* INDICATE NO ATTACHED OPCES  0455
*                                                            @Y17XAR5*/
         NI    OCATTACH(REG1),B'11111101'                          0455
*     END;                          /*                       @Y17XAR5*/
*   CALL FREEBUFF;                  /* FREE START/STOP OPCE  @Y17XAR5*/
@RF00451 L     @15,OPCFREBF(,ROPCAVT)                              0457
         BALR  @14,@15                                             0457
*   CALL CIBLOOP;                   /* SEARCH FOR CIB        @Y17XAR5*/
         BAL   @14,CIBLOOP                                         0458
*   IF NOCIB='1'B THEN                                             0459
         TM    NOCIB(ROPCAVT),B'01000000'                          0459
         BO    @RT00459                                            0459
*     GOTO FREEOPCE;                /* IF NO CIB FOUND,FREE OPCE   0460
*                                                            @Y17XAR5*/
*   PARAM->WLINK=ELMNT->WLINK;      /* DEQUEUE THE CIB       @Y17XAR5*/
         L     @10,ELMNT-1(,ROPCAVT)                               0461
         MVC   WLINK(3,PARAM),WLINK(@10)                           0461
*ATCHNG2:                                                          0462
*   RPRU=OCUNIT;                    /* SET UP RU POINTER     @Y17XAR5*/
ATCHNG2  L     @10,OPCCOPCE(,ROPCAVT)                              0462
         L     RPRU,OCUNIT(,@10)                                   0462
*   GEN REFS(RPRU,ROPCAVT,OPCHNEND);                               0463
      EX  RPRU,OPCHNEND(ROPCAVT)  IS THIS END OF UNIT
*   BC(SEVEN,BADRU);                /* YES, ERROR            @Y17XAR5*/
         BC    7,BADRU                                             0464
*   IF PRURHSDI='1'B×BDUSYRSP^=GOODRSP/* IF BAD RESPONSE             */
*       ×ELMNT->WRTCD^=ZERO THEN                                   0465
         LR    @10,RPRU                                            0465
         AL    @10,@CF01912                                        0465
         TM    PRURHSDI(@10),B'00000100'                           0465
         BO    @RT00465                                            0465
         CLI   BDUSYRSP+12(RPRU),X'60'                             0465
         BNE   @RT00465                                            0465
         L     @10,ELMNT-1(,ROPCAVT)                               0465
         CLI   WRTCD(@10),0                                        0465
         BNE   @RT00465                                            0465
*     GOTO BADRU;                   /* GO FREE BUFFERS       @Y17XAR5*/
*   ELSE                                                           0467
*     GOTO GOODRESP;                /* PROCESS GOOD RESPONSE @Y17XAR5*/
         B     GOODRESP                                            0467
*BADRU:                             /*                       @Y17XAR5*/
*   CALL CHAINBUF;                  /* CHAIN SAVED BUFFS TO OPCE   0468
*                                                            @Y17XAR5*/
BADRU    BAL   @14,CHAINBUF                                        0468
*   REG0=BADRSP;                    /* SETUP BAD RET CODE    @Y17XAR5*/
         LA    REG0,28                                             0469
*   OPCLDNME=MODNAME7;              /* SETUP FOR NEXT MOD    @Y17XAR5*/
         MVC   OPCLDNME(8,ROPCAVT),MODNAME7                        0470
*   GO TO XCTL;                     /* RETURN TO APPLICATION @Y17XAR5*/
         B     XCTL                                                0471
*GOODRESP:                          /*                       @Y17XAR5*/
*   REG1=OCUNIT;                    /* SET UP TO FREE RU     @Y17XAR5*/
GOODRESP L     @10,OPCCOPCE(,ROPCAVT)                              0472
         L     REG1,OCUNIT(,@10)                                   0472
*   CALL FREEBUFF;                  /* FREE RU               @Y17XAR5*/
         L     @15,OPCFREBF(,ROPCAVT)                              0473
         BALR  @14,@15                                             0473
*   OCUNIT=OCPTRSAV;                /* SETUP CHECKPOINT SAVED BUFFERS
*                                                            @YM08026*/
         L     @10,OPCCOPCE(,ROPCAVT)                              0474
         L     @09,OCPTRSAV(,@10)                                  0474
         ST    @09,OCUNIT(,@10)                                    0474
*   REG1=OCPTRSAV;                  /* ANY SAVED BUFFERS?    @Y17XARW*/
         LR    REG1,@09                                            0475
*   GEN REFS(REG1,ROPCAVT,OPCHNEND);                               0476
       EX    REG1,OPCHNEND(ROPCAVT)  IS THIS END OF UNIT
*   BC(SEVEN,NOCHEKPT);             /* YES, NO SAVED BUFFS-RETURN TO
*                                      APPL                  @Y17XAR5*/
         BC    7,NOCHEKPT                                          0477
*   OCWTG=MOD07;                    /* SET UP WHERE-TO-GO    @Y17XAR5*/
         L     @10,OPCCOPCE(,ROPCAVT)                              0478
         MVC   OCWTG(2,@10),MOD07                                  0478
*   REG0=ZERO;                      /* SETUP FOR CHECKPOINT  @Y17XARW*/
         SLR   REG0,REG0                                           0479
*   OCPARM=ZERO;                    /*                       @Y17XAR5*/
         SLR   @09,@09                                             0480
         STH   @09,OCPARM(,@10)                                    0480
*   IF OCOPTCDE^=OCICHNG THEN       /* IF THIS IS NOT ICHNG  @Y17XAR5*/
         CLI   OCOPTCDE(@10),X'49'                                 0481
         BE    @RF00481                                            0481
*     OCOPTCDE=OCTCHNG;             /* IT MUST BE A TCHNG ENTRY    0482
*                                                            @Y17XAR5*/
         MVI   OCOPTCDE(@10),X'56'                                 0482
*   REG1=WTNTNDX;                   /* PASS TTCIN AS PARM    @ZM46777*/
@RF00481 LH    REG1,WTNTNDX(,PARAM)                                0483
*   GEN(    LINK EP=IEDQNB02);      /* CHECKPOINT RESOURCE   @ZM46777*/
             LINK EP=IEDQNB02
*   OPCLDNME=MODNAME5;              /* SETUP FOR NEXT MOD    @Y17XAR5*/
         MVC   OPCLDNME(8,ROPCAVT),MODNAME5                        0485
*   GO TO XCTL;                     /* GOTO CHECKPOINT       @Y17XAR5*/
         B     XCTL                                                0486
*NOCHEKPT:                                                         0487
*   OCWTG=ZERO;                     /* CLEAR WHERE-TO-GO     @Y17XAR5*/
NOCHEKPT L     @10,OPCCOPCE(,ROPCAVT)                              0487
         SLR   @09,@09                                             0487
         STH   @09,OCWTG(,@10)                                     0487
*   REG0=ZERO;                      /* SETUP GOOD RETURN     @Y17XAR5*/
         SLR   REG0,REG0                                           0488
*   OPCMODID=MOD07;                 /* SETUP NEXT MOD        @Y17XAR5*/
         MVC   OPCMODID(2,ROPCAVT),MOD07                           0489
*   GOTO XCTL;                      /* GO XCTL               @Y17XAR5*/
         B     XCTL                                                0490
*AICHNG2:                                                          0491
*   RFY                                                            0491
*     RWORK RSTD;                   /*                       @Y17XAR5*/
AICHNG2  DS    0H                                                  0492
*/* SEARCH FOR START/STOP OPCE ON THE WAITL CHAIN            @Y17XAR5*/
*                                                                  0492
*   RWORK=ADDR(OPCWAITV);           /* SETUP ADDR OF WAITV CHAIN   0492
*                                                            @Y17XAR5*/
         LA    RWORK,OPCWAITV(,ROPCAVT)                            0492
*   REG1=OPCWAITV;                  /* GET FIRST ELEM ON CHAIN     0493
*                                                            @Y17XAR5*/
         L     REG1,OPCWAITV(,ROPCAVT)                             0493
*   SEARCH='1'B;                    /* INDICATE SEARCH IN PROGRSS  0494
*                                                            @Y17XAR5*/
         OI    SEARCH(ROPCAVT),B'00100000'                         0494
*   DO WHILE(SEARCH='1'B);          /* FIND START/STOP OPCE  @Y17XAR5*/
         B     @DE00495                                            0495
@DL00495 DS    0H                                                  0496
*     IF REG1->OCCIB=OPCCOPCE THEN                                 0496
         L     @10,OCCIB-1(,REG1)                                  0496
         LA    @10,0(,@10)                                         0496
         C     @10,OPCCOPCE(,ROPCAVT)                              0496
         BNE   @RF00496                                            0496
*       SEARCH='0'B;                /* IF FOUND A MATCH      @Y17XAR5*/
         NI    SEARCH(ROPCAVT),B'11011111'                         0497
*     ELSE                                                         0498
*       DO;                         /* SETUP TO CHECK NEXT OPCE    0498
*                                                            @Y17XAR5*/
         B     @RC00496                                            0498
@RF00496 DS    0H                                                  0499
*         RWORK=REG1;               /* SAVE PREVIOUS OPCE    @Y17XAR5*/
         LR    RWORK,REG1                                          0499
*         REG1=REG1->OCLINK;        /* POINT TO NEXT OPCE    @Y17XAR5*/
         L     REG1,OCLINK(,REG1)                                  0500
*       END;                        /*                       @Y17XAR5*/
*   END;                            /*                       @Y17XAR5*/
@RC00496 DS    0H                                                  0502
@DE00495 TM    SEARCH(ROPCAVT),B'00100000'                         0502
         BO    @DL00495                                            0502
*   RWORK->OCLINK=REG1->OCLINK;     /* DELINK START/STOP OPCE      0503
*                                                            @Y17XAR5*/
         L     @10,OCLINK(,REG1)                                   0503
         ST    @10,OCLINK(,RWORK)                                  0503
*   RFY                                                            0504
*     RWORK UNRSTD;                 /*                       @Y17XAR5*/
*   IF REG1->OCSWITCH=OCVARON THEN                                 0505
         CLI   OCSWITCH(REG1),X'D1'                                0505
         BNE   @RF00505                                            0505
*     DO;                           /* SHOULD LINE BE RESTARTED?   0506
*                                                            @Y17XAR5*/
*       OPCCOPCE=REG1;              /* SETUP ADDR OF START/STOP OPCE
*                                                            @Y17XAR5*/
         ST    REG1,OPCCOPCE(,ROPCAVT)                             0507
*       OCRESP='0'B;                /* CLEAR RESPONSE FIELD  @Y17XAR5*/
         L     @10,OPCCOPCE(,ROPCAVT)                              0508
         NI    OCRESP(@10),B'11111110'                             0508
*       OCPARM=ZERO;                /* CLEAR PARM FIELD      @Y17XAR5*/
         SLR   @09,@09                                             0509
         STH   @09,OCPARM(,@10)                                    0509
*       OCWTG=MODT0;                /* SETUP WHERE-TO-GO     @Y17XAR5*/
         MVC   OCWTG(2,@10),MODT0                                  0510
*       OCALSTAT=ZERO;              /* CLEAR 'ALL' STATUS FIELD    0511
*                                                            @Y17XAR5*/
         MVI   OCALSTAT(@10),X'00'                                 0511
*       OCELMPRI=ZERO;              /* CLEAR PRIORITY FIELD  @Y17XAR5*/
         MVI   OCELMPRI(@10),X'00'                                 0512
*       OPCMODID=MODVI;             /* XCTL TO NEXT MOD      @Y17XAR5*/
         MVC   OPCMODID(2,ROPCAVT),MODVI                           0513
*       GOTO XCTL;                  /* XCTL TO NEXT MOD      @Y17XAR5*/
         B     XCTL                                                0514
*     END;                          /*                       @Y17XAR5*/
*   ELSE                            /* COMPLETE ICHNG PROCESS      0516
*                                                            @Y17XAR5*/
*     GOTO COMPLETE;                /* COMPLETE ICHNG PROCESSING   0516
*                                                            @Y17XAR5*/
*AICHNG1:                                                          0517
*   OPCLDNME=MODNAME3;              /* SET NAME FOR XCTL     @Y17XAR5*/
AICHNG1  MVC   OPCLDNME(8,ROPCAVT),MODNAME3                        0517
*   REG0=0;                         /* INDICATE ENTRY FROM T0        */
         SLR   REG0,REG0                                           0518
*   GOTO XCTL;                                                     0519
         B     XCTL                                                0519
*AICOPY:                                                           0520
*   OPCLDNME=MODNAME2;              /* SET NAME FOR XCTL             */
AICOPY   MVC   OPCLDNME(8,ROPCAVT),MODNAME2                        0520
*   GO TO XCTL;                                                    0521
         B     XCTL                                                0521
*ATCOPY:                                                           0522
*ATCHNG1:                                                          0522
*   OPCLDNME=MODNAME1;              /* SET NAME FOR XCTL             */
ATCOPY   DS    0H                                                  0522
ATCHNG1  MVC   OPCLDNME(8,ROPCAVT),MODNAME1                        0522
*XCTL:                                                             0523
*   OPCFLAG1=ZERO;                  /* CLEAR FLAGS           @Y17XAR5*/
XCTL     MVI   OPCFLAG1(ROPCAVT),X'00'                             0523
*   REG1=ROPCAVT;                   /* OP CTL AVT ADDRESS    @Y17XAR5*/
         LR    REG1,ROPCAVT                                        0524
*   GEN EXIT REFS(OPCXCTL,ROPCAVT);                                0525
         XCTL  SF=(E,OPCXCTL(ROPCAVT))
*CHK3705:                           /*                       @Y17XAR5*/
*                                                                  0526
*   /*****************************************************************/
*   /*                                                               */
*   /* THIS ROUTINE GETS THE NCP TTE FOR THE DEVICE AND CHECKS STATUS*/
*   /* OF NCP                                                @Y17XAR5*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0526
*   RFY                                                            0526
*     REG14 RSTD;                   /*                       @Y17XAR5*/
CHK3705  DS    0H                                                  0527
*   SAVERET2=REG14;                 /* SAVE RETURN REG       @Y17XAR5*/
         L     @15,OPCWORK(,ROPCAVT)                               0527
         ST    REG14,SAVERET2(,@15)                                0527
*   RFY                                                            0528
*     REG14 UNRSTD;                 /*                       @Y17XAR5*/
*   RFY                                                            0529
*     REG15 RSTD;                   /*                       @Y17XAR5*/
*   IF TRMCOHRT=ZERO THEN                                          0530
         L     @14,RTRM(,ROPCAVT)                                  0530
         LH    @10,TRMCOHRT(,@14)                                  0530
         N     @10,@CF01908                                        0530
         LTR   @10,@10                                             0530
         BNZ   @RF00530                                            0530
*     DO;                           /* IF TTE NOT IN HIERARCHY USE 0531
*                                      NETWRK ADDR TO FIND NCP TTE 0531
*                                                            @Y17XARW*/
*       IF TRMTYPE=TRMNSDLC THEN                                   0532
         CLI   TRMTYPE(@14),X'20'                                  0532
         BNE   @RF00532                                            0532
*         ERRFLG='1'B;              /* IF THIS IS A LINE, ERROR    0533
*                                                            @Y17XAR5*/
         OI    ERRFLG(ROPCAVT),B'10000000'                         0533
*       ELSE                                                       0534
*         DO;                       /*                       @Y17XAR5*/
         B     @RC00532                                            0534
@RF00532 DS    0H                                                  0535
*           REG1=TNTNDX;            /* SET UP TO GET NA      @Y17XAR5*/
         L     @14,OPCWORK(,ROPCAVT)                               0535
         LH    REG1,TNTNDX(,@14)                                   0535
*           CALL IEDIAP04;          /*                       @Y17XAR5*/
         L     @10,AVTSAVTP(,AVT)                                  0536
         L     @15,SAVTTNTX(,@10)                                  0536
         BALR  @14,@15                                             0536
*           IF REG15=0 THEN         /* IS NCP INACTIVE?      @Y17XAR5*/
         LTR   REG15,REG15                                         0537
         BNZ   @RF00537                                            0537
*             ERRFLG='1'B;          /* YES                   @Y17XAR5*/
         OI    ERRFLG(ROPCAVT),B'10000000'                         0538
*           ELSE                                                   0539
*             DO;                   /* NO                    @Y17XAR5*/
         B     @RC00537                                            0539
@RF00537 DS    0H                                                  0540
*               SALEN='10'X-SAVTSUBL;/* GET LENGTH OF SUBAREA      0540
*                                                            @Y17XAR5*/
         L     @14,OPCWORK(,ROPCAVT)                               0540
         L     @10,AVTSAVTP(,AVT)                                  0540
         LA    @09,16                                              0540
         SLR   @06,@06                                             0540
         IC    @06,SAVTSUBL(,@10)                                  0540
         SLR   @09,@06                                             0540
         ST    @09,SALEN(,@14)                                     0540
*               SRL(REG15,SALEN);   /* SHIFT OUT NA TO GET SUBAREA 0541
*                                                            @Y17XAR5*/
         SRL   REG15,0(@09)                                        0541
*               RSAT=SAVTSAT+(LENGTH(IEDSATD)*(REG15-1));/* FIND SAT
*                                      ENTRY                 @Y17XAR5*/
         LR    @09,REG15                                           0542
         BCTR  @09,0                                               0542
         SLA   @09,3                                               0542
         AL    @09,SAVTSAT(,@10)                                   0542
         STCM  @09,7,RSAT(@14)                                     0542
*               LCB=SATRNLCB;       /* GET LCB ADDRESS       @Y17XAR5*/
         L     @10,SATRNLCB(,@09)                                  0543
         STCM  @10,7,LCB(@14)                                      0543
*               IF LCB^=0 THEN                                     0544
         LTR   @10,@10                                             0544
         BZ    @RF00544                                            0544
*                 DO;               /* IS THERE AN LCB       @Y17XAR5*/
*                   REG1=LCBTTCIN;  /* YES -SET UP TO FIND NCP TTE 0546
*                                                            @Y17XAR5*/
         LH    REG1,LCBTTCIN(,@10)                                 0546
         N     REG1,@CF01908                                       0546
*                   CALL IEDQTNT;   /*                       @Y17XAR5*/
         L     @15,AVTRNMPT(,AVT)                                  0547
         BALR  @14,@15                                             0547
*                 END;              /*                       @Y17XAR5*/
*               ELSE                                               0549
*                 ERRFLG='1'B;      /* NO LCB                @Y17XAR5*/
         B     @RC00544                                            0549
@RF00544 OI    ERRFLG(ROPCAVT),B'10000000'                         0549
*             END;                  /*                       @Y17XAR5*/
*         END;                      /*                       @Y17XAR5*/
*     END;                          /*                       @Y17XAR5*/
*   ELSE                                                           0553
*     DO;                           /*                       @Y17XAR5*/
         B     @RC00530                                            0553
@RF00530 DS    0H                                                  0554
*       RFY                                                        0554
*         REG15 UNRSTD;             /*                       @Y17XAR5*/
*       SAVETTE=RTRM;               /* SAVE TTE BASE         @Y17XAR5*/
         L     @10,OPCWORK(,ROPCAVT)                               0555
         L     @09,RTRM(,ROPCAVT)                                  0555
         ST    @09,SAVETTE(,@10)                                   0555
*       REG1=RTRM+LENGTH(IEDNTRM);  /* SETUP TO FIND NCP TTE @Y17XAR5*/
         LA    @09,14(,@09)                                        0556
         LR    REG1,@09                                            0556
*       DO UNTIL TRMTYPE=TRMLNCP;   /* SEARCH FOR NCP TTE    @Y17XAR5*/
@DL00557 DS    0H                                                  0558
*         CALL COHORTLK;            /*                       @Y17XAR5*/
         L     @15,OPCHORT(,ROPCAVT)                               0558
         BALR  @14,@15                                             0558
*         RTRM=REG1-LENGTH(IEDNTRM);/* SETUP TTE BASE        @Y17XAR5*/
         LR    @10,REG1                                            0559
         SL    @10,@CF01542                                        0559
         ST    @10,RTRM(,ROPCAVT)                                  0559
*       END;                        /*                       @Y17XAR5*/
@DE00557 L     @10,RTRM(,ROPCAVT)                                  0560
         CLI   TRMTYPE(@10),X'0F'                                  0560
         BNE   @DL00557                                            0560
*       RTRM=SAVETTE;               /* RESTORE TTE BASE      @Y17XAR5*/
         L     @10,OPCWORK(,ROPCAVT)                               0561
         L     @10,SAVETTE(,@10)                                   0561
         ST    @10,RTRM(,ROPCAVT)                                  0561
*     END;                          /*                       @Y17XAR5*/
*   IF ERRFLG='0'B THEN                                            0563
@RC00530 TM    ERRFLG(ROPCAVT),B'10000000'                         0563
         BNZ   @RF00563                                            0563
*     DO;                           /*                       @Y17XAR5*/
*       REG1=REG1-LENGTH(IEDNTRM);  /* ADJUST TTE            @Y17XAR5*/
         SL    REG1,@CF01542                                       0565
*       IF REG1->TRMRSACT='0'B×REG1->TRMINPG='1'B THEN/* IF NCP NOT
*                                      ACTIVE OR ACT/DEACT IN      0566
*                                      PROGRESS              @Y17XAR5*/
         TM    TRMINPG(REG1),B'00100000'                           0566
         BNZ   @RT00566                                            0566
         TM    TRMRSACT(REG1),B'10000000'                          0566
         BO    @RF00566                                            0566
@RT00566 DS    0H                                                  0567
*         ERRFLG='1'B;              /* SETUP ERROR FLAG      @Y17XAR5*/
         OI    ERRFLG(ROPCAVT),B'10000000'                         0567
*     END;                                                         0568
@RF00566 DS    0H                                                  0569
*   REG14=SAVERET2;                 /* RESTORE RETURN REG    @Y17XAR5*/
@RF00563 L     @10,OPCWORK(,ROPCAVT)                               0569
         L     REG14,SAVERET2(,@10)                                0569
*   RETURN;                         /*                       @Y17XAR5*/
         B     @EL00001                                            0570
*CIBLOOP:                           /*                       @Y17XAR5*/
*                                                                  0571
*   /*****************************************************************/
*   /*                                                               */
*   /* THIS ROUTINE SCANS THE CIB CHAIN FOR ORIGINAL APPLICATION CIB.*/
*   /* IF CIB FOUND, CIB ADDRESS WILL BE STORED IN ELMNT.    @Y17XAR5*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0571
*   RFY                                                            0571
*     REG14 RSTD;                                                  0571
CIBLOOP  DS    0H                                                  0572
*   PARAM=ADDR(SAVTRQCH)-4;         /* INITIALIZE FOR LOOP     S05331*/
         L     PARAM,AVTSAVTP(,AVT)                                0572
         LA    PARAM,SAVTRQCH(,PARAM)                              0572
         SL    PARAM,@CF00349                                      0572
*SRCHLOOP:                          /*                         S05331*/
*   ELMNT=PARAM->WLINK;             /* GET NEXT CIB ADDR       S05331*/
SRCHLOOP MVC   ELMNT(3,ROPCAVT),WLINK(PARAM)                       0573
*   IF ELMNT=ZERO THEN              /* END OF CHAIN?         @Y17XAR5*/
         L     @15,ELMNT-1(,ROPCAVT)                               0574
         LA    @15,0(,@15)                                         0574
         LTR   @15,@15                                             0574
         BNZ   @RF00574                                            0574
*     NOCIB='1'B;                   /* YES - FREE OPCE AND UNIT    0575
*                                                            @Y17XAR5*/
         OI    NOCIB(ROPCAVT),B'01000000'                          0575
*   ELSE                                                           0576
*     DO;                           /* ELSE CONTINUE SEARCH  @Y17XAR5*/
         B     @RC00574                                            0576
@RF00574 DS    0H                                                  0577
*       IF ELMNT=OCCIB THEN         /* FOUND CIB?            @Y17XAR5*/
         L     @15,OPCCOPCE(,ROPCAVT)                              0577
         CLC   ELMNT(3,ROPCAVT),OCCIB(@15)                         0577
         BE    @RT00577                                            0577
*         GO TO FOUND;              /* BRANCH IF YES           S05331*/
*       PARAM=ELMNT;                /* UPDATE PREV CIB ADDRS05331    */
         L     PARAM,ELMNT-1(,ROPCAVT)                             0579
         LA    PARAM,0(,PARAM)                                     0579
*       GO TO SRCHLOOP;                                            0580
         B     SRCHLOOP                                            0580
*     END;                          /*                       @Y17XAR5*/
*FOUND:                                                            0582
*   RFY                                                            0582
*     REG14 UNRSTD;                                                0582
*   RETURN;                         /*                       @Y17XAR5*/
         B     @EL00001                                            0583
*CHAINBUF:                                                         0584
*                                                                  0584
*   /*****************************************************************/
*   /*                                                               */
*   /* THIS ROUTINE CHECKS TO SEE IF THERE ARE ANY SAVED BUFFERS     */
*   /* CONTAINING COPIED LINE/DEVICE INFO. IF SO, THE BUFFERS ARE    */
*   /* CHAINED OFF THE LAST RESPONSE UNIT LINKED TO OCUNIT IN THE    */
*   /* OPCE. A RETURN IS THEN MADE TO FREE THE BUFFERS.      @Y17XAR5*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0584
*   RFY                                                            0584
*     REG14 RSTD;                                                  0584
CHAINBUF DS    0H                                                  0585
*   REG1=OCPTRSAV;                  /* SETUP PTR TO SAVED BUFFS    0585
*                                                            @Y17XAR5*/
         L     @15,OPCCOPCE(,ROPCAVT)                              0585
         L     REG1,OCPTRSAV(,@15)                                 0585
*   GEN REFS(REG1,ROPCAVT,OPCHNEND);                               0586
        EX   REG1,OPCHNEND(ROPCAVT)  IS THIS END OF UNIT
*   BC(SEVEN,NOSAVED);              /* IF SO, NO SAVED BUFFS @Y17XAR5*/
         BC    7,NOSAVED                                           0587
*   PREVADDR=OPCCOPCE;              /* POINT TO OPCE         @Y17XAR5*/
         L     @15,OPCCOPCE(,ROPCAVT)                              0588
         ST    @15,PREVADDR(,ROPCAVT)                              0588
*   REG1=OCUNIT;                    /* SETUP TO FIND LAST UNIT     0589
*                                                            @Y17XAR5*/
         L     REG1,OCUNIT(,@15)                                   0589
*FINDLAST:                                                         0590
*   GEN REFS(REG1,ROPCAVT,OPCHNEND);                               0590
FINDLAST DS    0H                                                  0590
        EX   REG1,OPCHNEND(ROPCAVT)  IS THIS LAST UNIT
*   BC(SEVEN,LASTUNIT);             /* IF SO, CHAIN SAVED BUFFS TO 0591
*                                      THIS UNIT             @Y17XAR5*/
         BC    7,LASTUNIT                                          0591
*   PREVADDR=REG1;                  /* SAVE PREVIOUS BUFF ADDR     0592
*                                                            @Y17XAR5*/
         ST    REG1,PREVADDR(,ROPCAVT)                             0592
*   REG1=REG1->OCUNIT;              /* POINT TO NEXT UNIT    @Y17XAR5*/
         L     REG1,OCUNIT(,REG1)                                  0593
*   GOTO FINDLAST;                  /* FIND LAST UNIT                */
         B     FINDLAST                                            0594
*LASTUNIT:                                                         0595
*   PREVADDR->OCUNIT=OCPTRSAV;      /* CHAIN SAVED BUFFS TO LAST UNIT
*                                                            @Y17XAR5*/
LASTUNIT L     @15,PREVADDR(,ROPCAVT)                              0595
         L     @10,OPCCOPCE(,ROPCAVT)                              0595
         L     @10,OCPTRSAV(,@10)                                  0595
         ST    @10,OCUNIT(,@15)                                    0595
*NOSAVED:                                                          0596
*   RFY                                                            0596
*     REG14 UNRSTD;                                                0596
*   RETURN;                                                        0597
         B     @EL00001                                            0597
*   END IGCT010D                                                   0598
*                                                                  0598
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */
*/*%INCLUDE SYSLIB  (TAVTD   )                                       */
*/*%INCLUDE SYSLIB  (TBDUD   )                                       */
*/*%INCLUDE SYSLIB  (TCD0D   )                                       */
*/*%INCLUDE SYSLIB  (TLCBD   )                                       */
*/*%INCLUDE SYSLIB  (TOPCED  )                                       */
*/*%INCLUDE SYSLIB  (TOPCAVTD)                                       */
*/*%INCLUDE SYSLIB  (TRHD    )                                       */
*/*%INCLUDE SYSLIB  (TTHD    )                                       */
*/*%INCLUDE SYSLIB  (TTRMD   )                                       */
*/*%INCLUDE SYSLIB  (TPRUD   )                                       */
*/*%INCLUDE SYSLIB  (TSATD   )                                       */
*                                                                  0598
*       ;                                                          0598
         B     @EL00001                                            0598
@DATA    DS    0H
@CH00089 DC    H'6'
         DS    0F
         DS    0F
@CF00349 DC    F'4'
@CF00064 DC    F'8'
@CF01542 DC    F'14'
@CF01912 DC    F'-8'
@CF01756 DC    XL4'08000002'
@CF01908 DC    XL4'0000FFFF'
         DS    0D
@CB01756 DC    X'08000002'
@CB01509 DC    X'0B8000'
MODT0    DC    CL2'T0'
MODVI    DC    CL2'VI'
MOD00    DC    CL2'00'
MOD02    DC    CL2'02'
MOD07    DC    CL2'07'
MODNAMEA DC    CL8'IGC0A10D'
MODNAME1 DC    CL8'IGCT110D'
MODNAME2 DC    CL8'IGCT210D'
MODNAME3 DC    CL8'IGCI210D'
MODNAME5 DC    CL8'IGC0610D'
MODNAME7 DC    CL8'IGC0710D'
         DS    CL1
ZAPAREA  DC    XL104'0'
@00      EQU   00                      EQUATES FOR REGISTERS 0-15
@01      EQU   01
@02      EQU   02
@03      EQU   03
@04      EQU   04
@05      EQU   05
@06      EQU   06
@07      EQU   07
@08      EQU   08
@09      EQU   09
@10      EQU   10
@11      EQU   11
@12      EQU   12
@13      EQU   13
@14      EQU   14
@15      EQU   15
@0       EQU   00
@1       EQU   01
@2       EQU   02
@3       EQU   03
@4       EQU   04
@5       EQU   05
@6       EQU   06
@7       EQU   07
@8       EQU   08
@9       EQU   09
@A       EQU   10
@B       EQU   11
@C       EQU   12
@D       EQU   13
@E       EQU   14
@F       EQU   15
REG0     EQU   @00
REG1     EQU   @01
ROPCAVT  EQU   @02
AVT      EQU   @04
RWORK    EQU   @06
RPRU     EQU   @07
PARAM    EQU   @08
RBASE    EQU   @11
REG12    EQU   @12
RSAVE    EQU   @13
REG14    EQU   @14
REG15    EQU   @15
LCBXPTR  EQU   @05
IEDQAPTR EQU   0
IEDQLPTR EQU   0
IEDQSATP EQU   0
IEDPRUQP EQU   0
ROPCE    EQU   0
IEDQAVTD EQU   0
AVTSAVEX EQU   IEDQAVTD+288
@NM00003 EQU   IEDQAVTD+388
AVTCKFLG EQU   @NM00003
AVTBASE  EQU   IEDQAVTD+412
AVTPKF   EQU   AVTBASE
AVTRNMPT EQU   IEDQAVTD+424
AVTOSECB EQU   IEDQAVTD+492
AVTECB1  EQU   AVTOSECB
AVTHG02  EQU   IEDQAVTD+528
AVTDISP  EQU   IEDQAVTD+552
AVTHD    EQU   IEDQAVTD+556
AVTSCOPT EQU   AVTHD
AVTSAVTP EQU   IEDQAVTD+612
AVTSAVTF EQU   AVTSAVTP
AVTCKPEL EQU   IEDQAVTD+652
AVTCKRMV EQU   AVTCKPEL
AVTCKELF EQU   IEDQAVTD+680
AVTCKBYT EQU   IEDQAVTD+691
AVTHG01  EQU   IEDQAVTD+692
AVTCKLNK EQU   IEDQAVTD+696
AVTCRELE EQU   IEDQAVTD+708
AVTCCELE EQU   AVTCRELE
AVTCLRHI EQU   IEDQAVTD+716
AVTADBUF EQU   IEDQAVTD+720
AVTSYSER EQU   IEDQAVTD+728
AVTCKPQB EQU   IEDQAVTD+804
AVTCKPTB EQU   AVTCKPQB
AVTCKPEC EQU   AVTCKPQB+4
AVTCKPCC EQU   AVTCKPEC
AVTOPCQB EQU   IEDQAVTD+816
AVTOPCOB EQU   AVTOPCQB
AVTOPCEC EQU   AVTOPCQB+4
AVTOPCCC EQU   AVTOPCEC
AVTOLTQB EQU   IEDQAVTD+828
AVTCWFL1 EQU   IEDQAVTD+924
AVTCWFL2 EQU   IEDQAVTD+925
AVTSUBT  EQU   IEDQAVTD+948
AVTIOTR  EQU   IEDQAVTD+949
AVTBIT1  EQU   IEDQAVTD+1050
AVTBIT2  EQU   IEDQAVTD+1051
AVTBIT3  EQU   IEDQAVTD+1052
AVTBIT4  EQU   IEDQAVTD+1136
@NM00085 EQU   IEDQAVTD+1232
IEDNSVTD EQU   0
SAVTDIAG EQU   IEDNSVTD
SAVTDIAF EQU   SAVTDIAG
SAVTSAT  EQU   IEDNSVTD+80
SAVTLUSQ EQU   IEDNSVTD+88
SAVTRQCH EQU   IEDNSVTD+232
SAVTTCPU EQU   IEDNSVTD+238
SAVTTNTX EQU   IEDNSVTD+252
SAVTZELM EQU   IEDNSVTD+270
SAVTSUBL EQU   IEDNSVTD+272
SAVTRDRV EQU   IEDNSVTD+284
SAVTCKQB EQU   IEDNSVTD+300
SAVTCKTB EQU   SAVTCKQB
SAVTCKEC EQU   SAVTCKQB+4
SAVTCKCC EQU   SAVTCKEC
IEDBDU   EQU   0
BDUCMND  EQU   IEDBDU
BDUMODIF EQU   IEDBDU+1
BDUFNFLG EQU   IEDBDU+2
BDUHEADR EQU   BDUFNFLG
BDUBDUFG EQU   IEDBDU+3
BDURSP   EQU   IEDBDU+4
BDUSYRSP EQU   BDURSP
BDUEXRSP EQU   BDURSP+1
BDUEND   EQU   IEDBDU+6
IEDQLCB  EQU   0
LCBRCB   EQU   IEDQLCB
LCBTSOB  EQU   IEDQLCB+19
LCBCHAIN EQU   IEDQLCB+20
LCBSCRNN EQU   LCBCHAIN
LCBTETEN EQU   LCBCHAIN
LCBINSRC EQU   IEDQLCB+21
LCBLKMDE EQU   LCBINSRC+2
LCBNTXT  EQU   IEDQLCB+24
LCBSTAT4 EQU   LCBNTXT
LCBPHASE EQU   LCBSTAT4
LCBSCBDA EQU   IEDQLCB+25
LCBMHA   EQU   IEDQLCB+29
LCBFLAG1 EQU   IEDQLCB+32
LCBIOBSN EQU   IEDQLCB+33
LCBSNS   EQU   LCBIOBSN+1
LCBSENS0 EQU   LCBSNS
LCBLOSDT EQU   LCBSENS0
LCBTMOUT EQU   LCBSENS0
LCBFLAG3 EQU   LCBIOBSN+7
LCBCSW   EQU   LCBIOBSN+8
LCBCSWST EQU   LCBCSW+3
LCBCSWUS EQU   LCBCSWST
LCBCSWCS EQU   LCBCSWST+1
LCBSIOCC EQU   LCBIOBSN+15
LCBDCBPT EQU   IEDQLCB+52
LCBRCQCB EQU   IEDQLCB+56
LCBTHSQ  EQU   IEDQLCB+60
LCBINCAM EQU   LCBTHSQ
LCBERRCT EQU   IEDQLCB+62
LCBLSPCI EQU   IEDQLCB+65
LCBRCBFR EQU   LCBLSPCI
LCBSTATE EQU   IEDQLCB+70
LCBSTAT1 EQU   LCBSTATE
LCBSTAT2 EQU   LCBSTATE+1
LCBBEOTN EQU   LCBSTAT2
LCBSYNC  EQU   LCBSTAT2
LCBDIAL  EQU   LCBSTAT2
LCBTSTSW EQU   IEDQLCB+72
LCBERB   EQU   IEDQLCB+76
LCBERBST EQU   IEDQLCB+84
LCBDLNKN EQU   LCBERBST
LCBERBCT EQU   IEDQLCB+88
LCBRBCT2 EQU   LCBERBCT+1
LCBTTCIN EQU   IEDQLCB+90
LCBMSGFM EQU   IEDQLCB+92
LCBOBRCH EQU   IEDQLCB+96
LCBINVPT EQU   LCBOBRCH+1
LCBBFRW  EQU   LCBINVPT
LCBTPCD  EQU   IEDQLCB+100
LCBSTAT5 EQU   LCBTPCD
LCBSTAT6 EQU   LCBTPCD+4
LCBRSPSV EQU   LCBTPCD+8
LCBSAVSN EQU   IEDQLCB+112
LCBERCCW EQU   IEDQLCB+120
LCBCPA   EQU   IEDQLCB+144
LCBCCW5  EQU   LCBCPA+32
LCBATTEL EQU   LCBCCW5
LCBQEBPL EQU   LCBATTEL
IEDQLCBX EQU   0
LCBXCON  EQU   IEDQLCBX
LCBXFLAG EQU   LCBXCON
LCBXDCT  EQU   LCBXCON+1
LCBXRADR EQU   LCBXCON+4
IEDQOPCE EQU   0
OCLINK   EQU   IEDQOPCE
OCELEM   EQU   IEDQOPCE+4
OCELMPRI EQU   OCELEM
OCUNIT   EQU   IEDQOPCE+8
OCRUDEST EQU   OCUNIT
OCCKPKEY EQU   OCRUDEST
OCSCAN   EQU   OCCKPKEY
OCOPTCDE EQU   IEDQOPCE+12
OCSWITCH EQU   IEDQOPCE+13
OCFLAG   EQU   IEDQOPCE+14
OCATTACH EQU   OCFLAG
OCRESP   EQU   OCFLAG
@NM00149 EQU   IEDQOPCE+16
OCDEST   EQU   @NM00149
OCREQVAL EQU   OCDEST+1
OCTRMTBL EQU   IEDQOPCE+20
OCLINENO EQU   IEDQOPCE+22
OCTIOT   EQU   OCLINENO
OCTRUNIT EQU   IEDQOPCE+24
OCRSID   EQU   OCTRUNIT
OCALSTAT EQU   OCRSID
OCACTREQ EQU   OCALSTAT
OCPARM   EQU   IEDQOPCE+28
OCWTG    EQU   IEDQOPCE+30
OCBACKUP EQU   IEDQOPCE+32
OCMODNME EQU   IEDQOPCE+40
OCIPLWA  EQU   OCMODNME
OCPTRSAV EQU   OCMODNME+4
OCCKDATA EQU   IEDQOPCE+48
OCRSTGTM EQU   OCCKDATA
IEDQOPCN EQU   0
OCLDNME  EQU   IEDQOPCN
OCLINTTE EQU   OCLDNME
OCREQFLG EQU   OCLINTTE+2
OCPREFLG EQU   OCLINTTE+3
IEDQOPCD EQU   0
OPCAVTPT EQU   IEDQOPCD+8
OPCCOPCE EQU   IEDQOPCD+12
OPCSAVE  EQU   IEDQOPCD+56
OPCWORK  EQU   IEDQOPCD+140
OPCFLAG1 EQU   IEDQOPCD+146
OPCAQCTL EQU   IEDQOPCD+180
OPCXCTL  EQU   IEDQOPCD+204
OPCLDNME EQU   IEDQOPCD+212
OPCMODID EQU   OPCLDNME+3
OPCHORT  EQU   IEDQOPCD+256
OPCNEXT  EQU   IEDQOPCD+272
OPCGETBF EQU   IEDQOPCD+276
OPCFREBF EQU   IEDQOPCD+280
OPCSPEC  EQU   IEDQOPCD+300
OPCHNEND EQU   IEDQOPCD+302
OPCWRKSP EQU   IEDQOPCD+320
OPCWAITV EQU   IEDQOPCD+364
OPCPWCOB EQU   IEDQOPCD+368
OPCPWQCB EQU   OPCPWCOB
OPCPWECB EQU   OPCPWCOB+4
IEDRH    EQU   0
TRHBYTE0 EQU   IEDRH
TRHBYTE1 EQU   IEDRH+1
TRHBYTE2 EQU   IEDRH+2
IEDTH    EQU   0
TTHBYTE0 EQU   IEDTH
TTHSNF   EQU   IEDTH+6
TTHTAG   EQU   TTHSNF
TTHTAG1  EQU   TTHTAG
IEDTRM   EQU   0
IEDNTRM  EQU   IEDTRM
TRMBYTE4 EQU   IEDNTRM
TRMBYTE3 EQU   IEDNTRM+1
TRMBYTE2 EQU   IEDNTRM+2
TRMRSACT EQU   TRMBYTE2
TRMINPG  EQU   TRMBYTE2
TRMBYTE1 EQU   IEDNTRM+3
TRMSCPRQ EQU   TRMBYTE1
TRMCOHRT EQU   IEDNTRM+4
TRMBYTE0 EQU   IEDNTRM+6
TRMSIBPT EQU   IEDNTRM+7
TRMTYPE  EQU   IEDNTRM+11
IEDQTRM  EQU   IEDTRM+14
TRMSTATE EQU   IEDQTRM
TRMLOG   EQU   TRMSTATE
TRMINSEQ EQU   IEDQTRM+4
TLISTCNT EQU   TRMINSEQ
TRMOUTSQ EQU   IEDQTRM+6
TLISTEN  EQU   TRMOUTSQ
TRMDSORG EQU   TLISTEN
TRMALTD  EQU   IEDQTRM+8
TRMDEVFL EQU   IEDQTRM+10
TRMSTAT  EQU   IEDQTRM+12
IEDPRUQD EQU   0
PRUTTCIN EQU   IEDPRUQD
PRUDATCT EQU   IEDPRUQD+2
PRUTIC   EQU   IEDPRUQD+8
PRUDATA  EQU   IEDPRUQD+12
IEDPRUND EQU   0
PRURHTH  EQU   IEDPRUND
PRURH    EQU   PRURHTH
PRURHFG0 EQU   PRURH
PRURHSDI EQU   PRURHFG0
PRURHFG1 EQU   PRURH+1
PRURHFG2 EQU   PRURH+2
PRUTH    EQU   PRURHTH+3
PRUFIDN  EQU   PRUTH
IEDSATD  EQU   0
SATRNLCB EQU   IEDSATD
IEDNTNTD EQU   0
AREA     EQU   0
SALEN    EQU   AREA
LCB      EQU   AREA+5
RSAT     EQU   AREA+9
TNTNDX   EQU   AREA+14
SAVETTE  EQU   AREA+20
SAVERET1 EQU   AREA+24
SAVERET2 EQU   AREA+28
WORKAREA EQU   0
WQCBADR  EQU   WORKAREA
WLINK    EQU   WORKAREA+5
WVERB    EQU   WORKAREA+8
WENTCD   EQU   WORKAREA+9
WANSCD   EQU   WORKAREA+10
WRTCD    EQU   WORKAREA+11
WTO      EQU   WORKAREA+16
WTNTNDX  EQU   WORKAREA+24
FIELD    EQU   0
IEDQTNT  EQU   0
FREEBUFF EQU   0
COHORTLK EQU   0
IEDIAP04 EQU   0
IEDQTPTR EQU   0
LCBRSPIN EQU   LCBIOBSN
LCBLUSNS EQU   LCBRSPIN+5
LCBSCPRS EQU   LCBRSPIN+9
LCBCSWU1 EQU   LCBSCPRS+2
LCBRSPFG EQU   LCBRSPIN+15
LCBCOREQ EQU   LCBTPCD
@NM00132 EQU   LCBCPA+40
LCBQNX   EQU   LCBERCCW
LCBQNXMN EQU   LCBQNX
LCBCANCL EQU   LCBSAVSN
LCBCANFG EQU   LCBCANCL
OCCIB    EQU   OCREQVAL
OCCKPKY1 EQU   OCCKPKEY
OCCKPTYP EQU   OCCKPKY1
OCICACTN EQU   OCMODNME
OCICDADR EQU   OCICACTN
OCICSW   EQU   OCICDADR+3
OPCAQWD  EQU   OPCAQCTL
OPCAQWD1 EQU   OPCAQWD
OPCAQWD2 EQU   OPCAQWD+4
OPCAQWD3 EQU   OPCAQWD+8
TRMPRE1  EQU   TRMBYTE4
TRMNCP1  EQU   TRMBYTE4
TRMPRE   EQU   TRMBYTE3
TRMNCP   EQU   TRMBYTE3
TRMPU    EQU   TRMBYTE3
TRMLU    EQU   TRMBYTE3
TRMLINK  EQU   TRMBYTE3
PTRS     EQU   OPCWRKSP
ELMNT    EQU   PTRS+1
RTRM     EQU   PTRS+4
PREVADDR EQU   PTRS+8
FLAGS    EQU   OPCFLAG1
ERRFLG   EQU   FLAGS
NOCIB    EQU   FLAGS
SEARCH   EQU   FLAGS
BDUTEXT  EQU   BDUEND
*                                      START UNREFERENCED COMPONENTS
@NM00205 EQU   FLAGS
@NM00204 EQU   PTRS
@NM00190 EQU   TRMLINK
TRMLSTAT EQU   TRMLINK
TRMLINT  EQU   TRMLINK
TRMEPMOD EQU   TRMLINK
TRMLULOG EQU   TRMLU
TRMINERR EQU   TRMLU
TRMLUREQ EQU   TRMLU
TRMSESRQ EQU   TRMLU
TRMTDIFF EQU   TRMLU
TRMLUTM  EQU   TRMLU
TRMLUIT  EQU   TRMLU
TRMAUTO  EQU   TRMLU
TRMPCONT EQU   TRMPU
@NM00189 EQU   TRMPU
TRMNCONT EQU   TRMNCP
TRMQUCKN EQU   TRMNCP
TRMSLOWN EQU   TRMNCP
TRMSYGEN EQU   TRMNCP
TRMNCPCL EQU   TRMNCP
TRMIPLDM EQU   TRMNCP
TRMINOUT EQU   TRMPRE
TRMRDOUT EQU   TRMPRE
TRMNLOUT EQU   TRMPRE
TRMWROUT EQU   TRMPRE
TRMASNXI EQU   TRMPRE
TRMSTMM  EQU   TRMPRE
TRMCMODE EQU   TRMPRE
TRMSTPND EQU   TRMPRE
@NM00188 EQU   TRMNCP1
TRMINOP  EQU   TRMNCP1
TRMLYNCH EQU   TRMPRE1
TRMSPOUT EQU   TRMPRE1
TRMERLCK EQU   TRMPRE1
TRMQNPL  EQU   TRMPRE1
TRMSPACT EQU   TRMPRE1
TRMOCNI  EQU   TRMPRE1
TRMSESSN EQU   TRMPRE1
TRMCONT  EQU   TRMPRE1
OPCAQLST EQU   OPCAQWD3+1
OPCAQRQ3 EQU   OPCAQWD3
OPCAQSEC EQU   OPCAQWD2+1
OPCAQRQ2 EQU   OPCAQWD2
OPCAQFST EQU   OPCAQWD1+1
OPCAQREQ EQU   OPCAQWD1
OCICINAC EQU   OCICSW
@NM00155 EQU   OCICSW
OCICATST EQU   OCICDADR+1
OCICTYPE EQU   OCICDADR
@NM00154 EQU   OCCKPKY1
OCCKPENV EQU   OCCKPKY1
OCCKPRST EQU   OCCKPTYP
OCCKPNCP EQU   OCCKPTYP
OCCKPINC EQU   OCCKPTYP
@NM00140 EQU   LCBCANCL+3
LCBCANTH EQU   LCBCANCL+1
@NM00139 EQU   LCBCANFG
LCBCANCD EQU   LCBCANFG
@NM00138 EQU   LCBCANFG
LCBCANEB EQU   LCBCANFG
LCBCANXT EQU   LCBCANFG
LCBUNADD EQU   LCBQNX+21
LCBUASZE EQU   LCBQNX+20
LCBDSTEA EQU   LCBQNX+16
@NM00137 EQU   LCBQNX+8
LCBIOSBS EQU   LCBQNX+5
@NM00136 EQU   LCBQNX+4
LCBSTSAV EQU   LCBQNX+1
@NM00135 EQU   LCBQNXMN
LCBNX509 EQU   LCBQNXMN
LCBNX162 EQU   LCBQNXMN
LCBNX142 EQU   LCBQNXMN
LCBNX064 EQU   LCBQNXMN
@NM00134 EQU   @NM00132+4
LCBNCPPT EQU   @NM00132+1
@NM00133 EQU   @NM00132
LCBWRSCH EQU   LCBCOREQ+8
LCBCQLNK EQU   LCBCOREQ+4
LCBCQELE EQU   LCBCOREQ
LCBPAKCH EQU   LCBRSPIN+16
@NM00131 EQU   LCBRSPFG
LCBRSRH  EQU   LCBRSPFG
LCBEXPI  EQU   LCBRSPFG
@NM00130 EQU   LCBRSPIN+12
LCBUSUE1 EQU   LCBCSWU1
@NM00129 EQU   LCBCSWU1
@NM00128 EQU   LCBSCPRS+1
LCBDFCMD EQU   LCBSCPRS
LCBUSER  EQU   LCBLUSNS+2
LCBSMIN  EQU   LCBLUSNS+1
LCBSMAJ  EQU   LCBLUSNS
LCBRHSV  EQU   LCBRSPIN+2
LCBSNS0  EQU   LCBRSPIN+1
@NM00127 EQU   LCBRSPIN
FCOUNT   EQU   FIELD
WRQTG    EQU   WORKAREA+26
WFROM    EQU   WORKAREA+20
WECBA    EQU   WORKAREA+12
WPRI     EQU   WORKAREA+4
RLNGTH   EQU   AREA+16
@NM00203 EQU   AREA+12
@NM00202 EQU   AREA+8
@NM00201 EQU   AREA+4
TNTFIRST EQU   IEDNTNTD+82
@NM00200 EQU   IEDNTNTD+41
TNTENLEN EQU   IEDNTNTD+40
@NM00199 EQU   IEDNTNTD
SATRNRVT EQU   IEDSATD+4
@NM00198 EQU   IEDPRUND+4
PRUTHEFI EQU   PRUFIDN
PRUTHUSS EQU   PRUFIDN
PRUTHEIU EQU   PRUFIDN
PRUTHBIU EQU   PRUFIDN
PRUTHTYE EQU   PRUFIDN
@NM00197 EQU   PRURHFG2
PRURHCSI EQU   PRURHFG2
@NM00196 EQU   PRURHFG2
PRURHCDI EQU   PRURHFG2
PRURHEB  EQU   PRURHFG2
PRURHBB  EQU   PRURHFG2
PRURHPI  EQU   PRURHFG1
@NM00195 EQU   PRURHFG1
PRURHER  EQU   PRURHFG1
PRURHDR2 EQU   PRURHFG1
@NM00194 EQU   PRURHFG1
PRURHDR1 EQU   PRURHFG1
PRURHEC  EQU   PRURHFG0
PRURHBC  EQU   PRURHFG0
PRURHFI  EQU   PRURHFG0
@NM00193 EQU   PRURHFG0
PRURUCAT EQU   PRURHFG0
PRURHTYP EQU   PRURHFG0
PRUNUNIT EQU   PRUTIC+1
@NM00192 EQU   PRUTIC
@NM00191 EQU   IEDPRUQD+4
TRMOPT   EQU   IEDTRM+34
TRMOPTBL EQU   IEDQTRM+18
TRMOPNO  EQU   IEDQTRM+17
TRMCHCIN EQU   IEDQTRM+16
TRMSENSE EQU   TRMSTAT+3
TRMTEMPR EQU   TRMSTAT+2
TRMSIO   EQU   TRMSTAT
@NM00187 EQU   TRMDEVFL+1
TRMTPIN  EQU   TRMDEVFL+1
TRMNCPI  EQU   TRMDEVFL+1
TRMRNTRM EQU   TRMDEVFL+1
@NM00186 EQU   TRMDEVFL+1
TRMLMD   EQU   TRMDEVFL+1
TRMCONC  EQU   TRMDEVFL+1
TRMTSOB  EQU   TRMDEVFL
TRMBFDY  EQU   TRMDEVFL
TRMTBLK  EQU   TRMDEVFL
TRMSBLK  EQU   TRMDEVFL
TRMBLKS  EQU   TRMDEVFL
TRMADDC  EQU   TRMDEVFL
TRMDDIG  EQU   TRMDEVFL
TRMBUFS  EQU   TRMDEVFL
TRMPRILK EQU   TRMALTD
TRMLGB   EQU   TRMDSORG
TRMUTERM EQU   TLISTCNT
TRMDESTQ EQU   IEDQTRM+1
TRMSCNYN EQU   TRMSTATE
TRMOPTFN EQU   TRMSTATE
TRMHELDN EQU   TRMSTATE
TRMACPTN EQU   TRMSTATE
TRMPREF  EQU   TRMSTATE
TRMPROC  EQU   TRMLOG
TRMLIST  EQU   TRMLOG
TRMLINE  EQU   TRMSTATE
TRMSUBST EQU   IEDNTRM+12
TRMRLMCT EQU   IEDNTRM+10
TRMCOHTG EQU   TRMSIBPT+1
TRMGPCNT EQU   TRMSIBPT
TRMBUFRD EQU   TRMBYTE0
TRMSNA   EQU   TRMBYTE0
TRMGP    EQU   TRMBYTE0
TRMDIAL  EQU   TRMBYTE0
@NM00185 EQU   TRMBYTE0
TRMOUTPT EQU   TRMBYTE0
TRMINPUT EQU   TRMBYTE0
TRMUDEF  EQU   TRMBYTE0
TRMSTOTE EQU   TRMBYTE1
TRMCKPRN EQU   TRMBYTE1
TRMTSATN EQU   TRMBYTE1
TRMTRACE EQU   TRMBYTE1
TRMSWBCK EQU   TRMBYTE1
TRMAUTOC EQU   TRMBYTE1
TRMINPTP EQU   TRMBYTE1
TRMWTNEG EQU   TRMSCPRQ
TRMWRBRK EQU   TRMBYTE2
TRMNOSND EQU   TRMBYTE2
TRMPREP  EQU   TRMBYTE2
TRMGPACT EQU   TRMBYTE2
TRMANDL  EQU   TRMBYTE2
TRMCLOSN EQU   TRMINPG
TRMREMB  EQU   TRMBYTE2
TTHDCF   EQU   IEDTH+8
TTHTAG2  EQU   TTHTAG+1
@NM00184 EQU   TTHTAG1
TTHTAGS  EQU   TTHTAG1
TTHOAF   EQU   IEDTH+4
TTHDAF   EQU   IEDTH+2
TTHBYTE1 EQU   IEDTH+1
TTHEFI   EQU   TTHBYTE0
@NM00183 EQU   TTHBYTE0
TTHEBIU  EQU   TTHBYTE0
TTHBBIU  EQU   TTHBYTE0
TTHFTYPE EQU   TTHBYTE0
@NM00182 EQU   TRHBYTE2
@NM00181 EQU   TRHBYTE2
@NM00180 EQU   TRHBYTE2
TRHCSI   EQU   TRHBYTE2
@NM00179 EQU   TRHBYTE2
TRHCDI   EQU   TRHBYTE2
TRHEB    EQU   TRHBYTE2
TRHBB    EQU   TRHBYTE2
TRHPI    EQU   TRHBYTE1
@NM00178 EQU   TRHBYTE1
@NM00177 EQU   TRHBYTE1
@NM00176 EQU   TRHBYTE1
TRHER    EQU   TRHBYTE1
TRHDR2   EQU   TRHBYTE1
@NM00175 EQU   TRHBYTE1
TRHDR1   EQU   TRHBYTE1
TRHEC    EQU   TRHBYTE0
TRHBC    EQU   TRHBYTE0
TRHSDI   EQU   TRHBYTE0
TRHFI    EQU   TRHBYTE0
@NM00174 EQU   TRHBYTE0
TRHRUCAT EQU   TRHBYTE0
TRHTYPE  EQU   TRHBYTE0
OPCBOTTM EQU   IEDQOPCD+1184
@NM00173 EQU   IEDQOPCD+1100
@NM00172 EQU   IEDQOPCD+948
@NM00171 EQU   IEDQOPCD+940
@NM00170 EQU   IEDQOPCD+380
@NM00169 EQU   OPCPWCOB+9
@NM00168 EQU   OPCPWCOB+8
@NM00167 EQU   OPCPWECB+1
OPCPWCCC EQU   OPCPWECB
OPCPWCHN EQU   OPCPWQCB+1
OPCPWVTO EQU   OPCPWQCB
OPCTOTCK EQU   IEDQOPCD+360
OPCAPXTL EQU   IEDQOPCD+356
OPCDECR  EQU   IEDQOPCD+352
OPCBUFWT EQU   IEDQOPCD+348
OPCADGOT EQU   IEDQOPCD+318
OPCRQCNT EQU   IEDQOPCD+316
OPPOLSTP EQU   IEDQOPCD+312
OPCCKCIB EQU   IEDQOPCD+308
OPCEND   EQU   IEDQOPCD+307
OPCSTCBS EQU   IEDQOPCD+306
OPCOQSW  EQU   IEDQOPCD+301
@NM00166 EQU   OPCSPEC
@NM00165 EQU   OPCSPEC
@NM00164 EQU   OPCSPEC
@NM00163 EQU   OPCSPEC
OPCFRMCA EQU   OPCSPEC
OPCRSTRT EQU   OPCSPEC
OPCPART  EQU   OPCSPEC
OPCALTD  EQU   OPCSPEC
OPCBFEND EQU   IEDQOPCD+296
OPCBFIRS EQU   IEDQOPCD+292
OPCAVBUF EQU   IEDQOPCD+290
OPCIPLCT EQU   IEDQOPCD+289
OPCCLNTS EQU   IEDQOPCD+288
OPCHA8   EQU   IEDQOPCD+286
OPCBFREQ EQU   IEDQOPCD+284
OPCFMDFC EQU   IEDQOPCD+268
OPCSCNC  EQU   IEDQOPCD+264
OPCHORTG EQU   IEDQOPCD+260
OPCCKPTL EQU   IEDQOPCD+252
OPCCKPTF EQU   IEDQOPCD+248
OPCWAITA EQU   IEDQOPCD+244
OPCWAITR EQU   IEDQOPCD+240
OPCWAITP EQU   IEDQOPCD+236
OPCWAITO EQU   IEDQOPCD+232
OPCWAITN EQU   IEDQOPCD+228
OPCWAITL EQU   IEDQOPCD+224
OPCWAITC EQU   IEDQOPCD+220
@NM00162 EQU   OPCLDNME+5
@NM00161 EQU   OPCLDNME
OPCWAIT  EQU   IEDQOPCD+192
OPCCKERB EQU   IEDQOPCD+164
OPCBFERB EQU   IEDQOPCD+148
OPCFLAG2 EQU   IEDQOPCD+147
OPCWRKSZ EQU   IEDQOPCD+144
OPCRSAVE EQU   IEDQOPCD+132
OPCQCBAD EQU   IEDQOPCD+128
OPCTRMWA EQU   IEDQOPCD+52
OPCPSTWT EQU   IEDQOPCD+48
OPCTNTEA EQU   IEDQOPCD+44
OPCPGCK  EQU   IEDQOPCD+40
OPCLCB   EQU   IEDQOPCD+36
@NM00160 EQU   IEDQOPCD+32
OPCIPLAD EQU   IEDQOPCD+28
OPCTOFLK EQU   IEDQOPCD+24
OPCOPTLK EQU   IEDQOPCD+20
OPCDCBLK EQU   IEDQOPCD+16
OPCDOUBL EQU   IEDQOPCD
@NM00159 EQU   OCLDNME+4
@NM00158 EQU   OCPREFLG
OCTOTEP  EQU   OCPREFLG
OCREPOST EQU   OCPREFLG
OCRSPSNT EQU   OCPREFLG
OCBFREQ  EQU   OCPREFLG
OCIDLE   EQU   OCREQFLG
OCFORCE  EQU   OCREQFLG
OCDCARD  EQU   OCREQFLG
OCPARTAL EQU   OCREQFLG
OCADNCP  EQU   OCREQFLG
@NM00157 EQU   OCREQFLG
@NM00156 EQU   OCREQFLG
OCFLUSHZ EQU   OCREQFLG
OCRESPCT EQU   OCLINTTE
OCCKPTWA EQU   OCCKDATA+4
@NM00153 EQU   OCRSTGTM+2
OCCKDAT2 EQU   OCRSTGTM+1
OCCKDAT1 EQU   OCRSTGTM
OCPUADR  EQU   OCIPLWA+2
OCWTGSAV EQU   OCIPLWA
OCDVRDCT EQU   OCBACKUP+6
OCNCP    EQU   OCBACKUP+4
OCBUFGOT EQU   OCBACKUP+2
OCBUFNED EQU   OCBACKUP
OCRESNUM EQU   OCPARM
OCSEQ    EQU   OCTRUNIT+2
@NM00152 EQU   OCRSID+1
OCNONE   EQU   OCALSTAT
OCSOME   EQU   OCALSTAT
OCALLFLG EQU   OCALSTAT
OCREDRVE EQU   OCALSTAT
OCSEQIND EQU   OCALSTAT
@NM00151 EQU   OCALSTAT
OCRENTRD EQU   OCALSTAT
OCWTGB   EQU   OCTIOT
@NM00150 EQU   @NM00149+2
OCCONID  EQU   OCDEST
OCRLN    EQU   IEDQOPCE+15
OCSSCP   EQU   OCFLAG
OCOUTPUT EQU   OCFLAG
OCLINE   EQU   OCFLAG
OCMPP    EQU   OCFLAG
OCTOTE   EQU   OCFLAG
OCCONSOL EQU   OCFLAG
@NM00148 EQU   OCSWITCH
OCQUCKN  EQU   OCSWITCH
OCPRIFLG EQU   OCOPTCDE
@NM00147 EQU   OCRUDEST+1
@NM00146 EQU   OCSCAN
OCNOTUCB EQU   OCSCAN
OCNONAME EQU   OCSCAN
OCALLRLN EQU   OCSCAN
OCDDNAME EQU   OCSCAN
OCDDNRLN EQU   OCSCAN
OCADDR   EQU   OCSCAN
OCELMPTR EQU   OCELEM+1
LCBERADR EQU   LCBXRADR+1
LCBPCIRC EQU   LCBXRADR
LCBDCT3  EQU   LCBXDCT+2
LCBDCT2  EQU   LCBXDCT+1
LCBDCT1  EQU   LCBXDCT
@NM00145 EQU   LCBXFLAG
LCBERPND EQU   LCBXFLAG
LCBSRCPF EQU   LCBXFLAG
LCBGPCTV EQU   LCBXFLAG
@NM00144 EQU   LCBXFLAG
@NM00143 EQU   LCBXFLAG
@NM00142 EQU   LCBXFLAG
@NM00141 EQU   LCBXFLAG
LCBCCW10 EQU   LCBCPA+72
LCBCCW9  EQU   LCBCPA+64
LCBCCW8  EQU   LCBCPA+56
LCBCCW7  EQU   LCBCPA+48
LCBCCW6  EQU   LCBCPA+40
LCBCP    EQU   LCBQEBPL+4
LCBIOSB  EQU   LCBQEBPL+1
LCBSIO   EQU   LCBQEBPL
LCBCCW4  EQU   LCBCPA+24
LCBCCW3  EQU   LCBCPA+16
LCBCCW2  EQU   LCBCPA+8
LCBCCW1  EQU   LCBCPA
@NM00126 EQU   LCBERCCW+16
LCBATL05 EQU   LCBERCCW+8
@NM00125 EQU   LCBERCCW
LCBCSWSV EQU   LCBSAVSN+1
LCBSNSV  EQU   LCBSAVSN
LCBBFSNS EQU   LCBRSPSV
LCBWAITC EQU   LCBTPCD+5
LCBINPAK EQU   LCBSTAT6
LCBMHBID EQU   LCBSTAT6
LCBRTRRO EQU   LCBSTAT6
LCBHDRPD EQU   LCBSTAT6
LCBCHN   EQU   LCBSTAT6
LCBBFRSV EQU   LCBTPCD+1
@NM00124 EQU   LCBSTAT5
LCBLUS   EQU   LCBSTAT5
LCBLUNIT EQU   LCBSTAT5
LCBPERM  EQU   LCBSTAT5
LCBNXCMD EQU   LCBBFRW
LCBERMSK EQU   LCBOBRCH
LCBSCBA  EQU   IEDQLCB+93
LCBOLT   EQU   LCBMSGFM
LCBEOT   EQU   LCBMSGFM
LCBENQ   EQU   LCBMSGFM
LCBTTD   EQU   LCBMSGFM
LCBRSTRT EQU   LCBMSGFM
LCBVSTRT EQU   LCBMSGFM
LCBACKI  EQU   LCBMSGFM
LCBNAK   EQU   LCBMSGFM
@NM00123 EQU   LCBRBCT2
LCBDCNT  EQU   LCBRBCT2
LCBRBCT1 EQU   LCBERBCT
LCBERBCH EQU   IEDQLCB+85
LCBCOMPL EQU   LCBDLNKN
LCBPRCPG EQU   LCBERBST
LCBERROR EQU   LCBERBST
@NM00122 EQU   LCBERBST
LCBINQ   EQU   LCBERBST
LCBRDERR EQU   LCBERBST
LCBEOMSG EQU   LCBERBST
LCBMSG   EQU   LCBERBST
LCBERBLK EQU   IEDQLCB+81
LCBERBPY EQU   IEDQLCB+80
LCBERBQB EQU   LCBERB+1
LCBERBKY EQU   LCBERB
LCBRECAD EQU   IEDQLCB+73
@NM00121 EQU   LCBTSTSW
@NM00120 EQU   LCBTSTSW
@NM00119 EQU   LCBTSTSW
@NM00118 EQU   LCBTSTSW
@NM00117 EQU   LCBTSTSW
@NM00116 EQU   LCBTSTSW
@NM00115 EQU   LCBTSTSW
LCBCONCT EQU   LCBTSTSW
LCBRESP  EQU   LCBSTAT2
LCBBFRAV EQU   LCBDIAL
LCBATTN  EQU   LCBSYNC
LCBNEGRP EQU   LCBSTAT2
LCBSNDPR EQU   LCBSTAT2
LCBCONNN EQU   LCBBEOTN
LCBMSGNN EQU   LCBSTAT2
LCBTRACE EQU   LCBSTAT2
LCBSENDN EQU   LCBSTAT1
LCBRECVN EQU   LCBSTAT1
LCBFREEN EQU   LCBSTAT1
LCBCONT  EQU   LCBSTAT1
LCBINITN EQU   LCBSTAT1
LCBOCNI  EQU   LCBSTAT1
LCBOCWTN EQU   LCBSTAT1
LCBRCLLN EQU   LCBSTAT1
LCBRECOF EQU   IEDQLCB+68
LCBRDBFR EQU   LCBRCBFR
LCBUCBX  EQU   IEDQLCB+64
LCBTTBIN EQU   LCBERRCT
@NM00114 EQU   LCBINCAM
LCBGETMN EQU   LCBINCAM
LCBRESTR EQU   LCBRCQCB
LCBPCILK EQU   LCBDCBPT
LCBSTART EQU   LCBIOBSN+16
LCBAP4OL EQU   LCBSIOCC
LCBAP3OL EQU   LCBSIOCC
LCBAP2OL EQU   LCBSIOCC
LCBAP1OL EQU   LCBSIOCC
LCBSIOC2 EQU   LCBSIOCC
LCBSIOC1 EQU   LCBSIOCC
@NM00113 EQU   LCBSIOCC
LCBCSWRC EQU   LCBCSW+5
LCBCSCHC EQU   LCBCSWCS
LCBCSICC EQU   LCBCSWCS
LCBCSCCC EQU   LCBCSWCS
LCBCSCDC EQU   LCBCSWCS
LCBCSPTC EQU   LCBCSWCS
LCBCSPGC EQU   LCBCSWCS
LCBCSIL  EQU   LCBCSWCS
LCBCSPCI EQU   LCBCSWCS
LCBUSUE  EQU   LCBCSWUS
LCBUSUC  EQU   LCBCSWUS
LCBUSDE  EQU   LCBCSWUS
LCBUSCE  EQU   LCBCSWUS
LCBUSBSY EQU   LCBCSWUS
LCBUSCUE EQU   LCBCSWUS
LCBUSSM  EQU   LCBCSWUS
LCBUSAT  EQU   LCBCSWUS
LCBCSWCA EQU   LCBCSW
LCBOBR   EQU   LCBFLAG3
LCBOBRRD EQU   LCBFLAG3
LCBIOMSG EQU   LCBFLAG3
LCBSOHC  EQU   LCBFLAG3
LCBRLAD  EQU   LCBFLAG3
LCBSOHR  EQU   LCBFLAG3
@NM00112 EQU   LCBFLAG3
LCBECBPT EQU   LCBIOBSN+4
LCBECBCC EQU   LCBIOBSN+3
LCBSENS1 EQU   LCBSNS+1
LCBABORT EQU   LCBTMOUT
LCBNOTIN EQU   LCBLOSDT
LCBOVRUN EQU   LCBSENS0
LCBDATCK EQU   LCBSENS0
LCBEQUCK EQU   LCBSENS0
LCBBUSCK EQU   LCBSENS0
LCBINTRQ EQU   LCBSENS0
LCBCMDRJ EQU   LCBSENS0
LCBFLAG2 EQU   LCBIOBSN
@NM00111 EQU   LCBFLAG1
LCBUNREL EQU   LCBFLAG1
LCBEXCPN EQU   LCBFLAG1
@NM00110 EQU   LCBFLAG1
LCBERPIN EQU   LCBFLAG1
@NM00109 EQU   LCBFLAG1
LCBFSBFR EQU   LCBMHA
LCBISZE  EQU   IEDQLCB+28
LCBLNENT EQU   LCBSCBDA+1
@NM00108 EQU   LCBSCBDA
LCBCPGMH EQU   LCBSTAT4
LCBREAL  EQU   LCBPHASE
@NM00107 EQU   LCBSTAT4
LCBACTRQ EQU   LCBSTAT4
LCBIPLRQ EQU   LCBSTAT4
LCBDACRQ EQU   LCBSTAT4
LCBDMPRQ EQU   LCBSTAT4
@NM00106 EQU   LCBLKMDE
LCBLOCKI EQU   LCBLKMDE
LCBLOCKR EQU   LCBLKMDE
LCBHMFLG EQU   LCBLKMDE
LCBBDFLG EQU   LCBLKMDE
@NM00105 EQU   LCBINSRC
LCBABRTN EQU   LCBCHAIN
LCBCTLMD EQU   LCBTETEN
LCBBFRSZ EQU   LCBCHAIN
LCBUREQN EQU   LCBCHAIN
LCBNORTY EQU   LCBCHAIN
LCBERMSG EQU   LCBCHAIN
LCBEXCP  EQU   LCBCHAIN
LCBINVRQ EQU   LCBSCRNN
LCB2741N EQU   LCBTSOB
LCBINHBN EQU   LCBTSOB
LCBCIRCD EQU   LCBTSOB
LCBPREP  EQU   LCBTSOB
LCBSOPL  EQU   LCBTSOB
LCBSATRD EQU   LCBTSOB
LCBTSBUF EQU   LCBTSOB
LCBWRBRK EQU   LCBTSOB
LCBTDL   EQU   IEDQLCB+18
LCBEOLTD EQU   IEDQLCB+16
LCBRSLNK EQU   IEDQLCB+13
LCBRSPRI EQU   IEDQLCB+12
LCBSTCBA EQU   IEDQLCB+9
LCBRSKEY EQU   IEDQLCB+8
LCBLINK  EQU   LCBRCB+5
LCBPRI   EQU   LCBRCB+4
LCBQCBA  EQU   LCBRCB+1
LCBKEY   EQU   LCBRCB
BDUXGRPH EQU   BDUEXRSP
BDUXFINL EQU   BDUEXRSP
BDUXINIT EQU   BDUEXRSP
BDURESP  EQU   BDUSYRSP
BDUPHASE EQU   BDUSYRSP
BDUERROR EQU   BDUSYRSP
BDUXERLK EQU   BDUBDUFG
BDUALTAK EQU   BDUFNFLG
BDUNEGAK EQU   BDUFNFLG
BDUPOSAK EQU   BDUFNFLG
BDUTPTX  EQU   BDUFNFLG
BDUFRSTB EQU   BDUFNFLG
BDULEADG EQU   BDUFNFLG
BDUSTHDR EQU   BDUFNFLG
SAVTBITN EQU   IEDNSVTD+312
@NM00104 EQU   SAVTCKQB+8
@NM00103 EQU   SAVTCKEC+1
@NM00102 EQU   SAVTCKCC
SAVTCKPO EQU   SAVTCKCC
SAVTCKWA EQU   SAVTCKCC
SAVTCKCH EQU   SAVTCKTB+1
SAVTCKVT EQU   SAVTCKTB
@NM00101 EQU   IEDNSVTD+297
SAVTRDFG EQU   SAVTRDRV+12
@NM00100 EQU   SAVTRDRV+5
SAVTRDPY EQU   SAVTRDRV+4
SAVTRDQB EQU   SAVTRDRV+1
SAVTRDKY EQU   SAVTRDRV
SAVTNID  EQU   IEDNSVTD+280
SAVTDVAS EQU   IEDNSVTD+276
SAVTPLSZ EQU   IEDNSVTD+274
@NM00099 EQU   IEDNSVTD+273
@NM00098 EQU   SAVTZELM+1
SAVTSUBM EQU   SAVTZELM
SAVTMHDX EQU   IEDNSVTD+268
SAVTNAT1 EQU   IEDNSVTD+266
SAVTSH20 EQU   IEDNSVTD+264
SAVTLCBS EQU   IEDNSVTD+260
SAVTRNMP EQU   IEDNSVTD+256
SAVTNAX  EQU   IEDNSVTD+248
SAVTSUBV EQU   IEDNSVTD+247
SAVTSUBA EQU   IEDNSVTD+246
SAVTSIBC EQU   IEDNSVTD+244
SAVTBSM  EQU   IEDNSVTD+240
SAVTSCPT EQU   SAVTTCPU
SAVTRQTG EQU   IEDNSVTD+236
SAVTMAND EQU   IEDNSVTD+228
SAVTSPLN EQU   IEDNSVTD+224
SAVTNADL EQU   IEDNSVTD+222
SAVTNATL EQU   IEDNSVTD+220
SAVTMHTB EQU   IEDNSVTD+216
SAVTSSMH EQU   IEDNSVTD+212
SAVTQRS  EQU   IEDNSVTD+208
SAVTRQIN EQU   IEDNSVTD+204
SAVTDFCO EQU   IEDNSVTD+200
SAVTSAO  EQU   IEDNSVTD+196
SAVTSARI EQU   IEDNSVTD+192
SAVTSAC  EQU   IEDNSVTD+188
SAVTSAI  EQU   IEDNSVTD+184
SAVTCSCI EQU   IEDNSVTD+180
SAVTSSRP EQU   IEDNSVTD+176
SAVTSSRQ EQU   IEDNSVTD+172
SAVTSCLU EQU   IEDNSVTD+168
SAVTXTRQ EQU   IEDNSVTD+164
SAVTMVBF EQU   IEDNSVTD+160
@NM00097 EQU   IEDNSVTD+148
SAVTIPCQ EQU   IEDNSVTD+144
@NM00096 EQU   IEDNSVTD+136
SAVTXFMI EQU   IEDNSVTD+132
@NM00095 EQU   IEDNSVTD+124
SAVTXFMO EQU   IEDNSVTD+120
@NM00094 EQU   IEDNSVTD+116
SAVTSSSR EQU   IEDNSVTD+112
SAVTSCPQ EQU   IEDNSVTD+108
SAVTSLCB EQU   IEDNSVTD+104
SAVTLUSR EQU   IEDNSVTD+100
@NM00093 EQU   SAVTLUSQ+8
SAVTLUSP EQU   SAVTLUSQ+4
SAVTLUSB EQU   SAVTLUSQ
@NM00092 EQU   IEDNSVTD+84
SAVTNAT  EQU   IEDNSVTD+76
SAVTCLUP EQU   IEDNSVTD+72
SAVTPIUT EQU   IEDNSVTD+68
SAVTRNTA EQU   IEDNSVTD+64
SAVTDNIR EQU   IEDNSVTD+60
SAVTCNIR EQU   IEDNSVTD+56
SAVTFLDH EQU   IEDNSVTD+52
SAVTSRTN EQU   IEDNSVTD+48
SAVTSREQ EQU   IEDNSVTD+44
SAVTFAIL EQU   IEDNSVTD+42
SAVTSUSE EQU   IEDNSVTD+40
SAVTSIB  EQU   IEDNSVTD+36
SAVTPRTN EQU   IEDNSVTD+32
@NM00091 EQU   IEDNSVTD+28
SAVTWH20 EQU   IEDNSVTD+26
SAVTPWT  EQU   IEDNSVTD+24
SAVTPRTQ EQU   IEDNSVTD+20
SAVTPREQ EQU   IEDNSVTD+16
SAVTPH20 EQU   IEDNSVTD+14
SAVTPUSE EQU   IEDNSVTD+12
SAVTPLCB EQU   IEDNSVTD+8
SAVTPOOL EQU   IEDNSVTD+4
SAVTPRMT EQU   SAVTDIAF
SAVTVIRT EQU   SAVTDIAF
AVTCPBNO EQU   IEDQAVTD+1244
AVTHRESS EQU   IEDQAVTD+1243
@NM00090 EQU   IEDQAVTD+1242
@NM00089 EQU   IEDQAVTD+1241
@NM00088 EQU   IEDQAVTD+1240
@NM00087 EQU   IEDQAVTD+1237
@NM00086 EQU   IEDQAVTD+1236
AVTHRESE EQU   @NM00085
AVTRADDR EQU   IEDQAVTD+1228
AVTNADDR EQU   IEDQAVTD+1224
AVTHRESN EQU   IEDQAVTD+1220
AVTVOLRN EQU   IEDQAVTD+1216
AVTTOTNN EQU   IEDQAVTD+1212
AVTTRCYN EQU   IEDQAVTD+1208
AVTRCTRN EQU   IEDQAVTD+1204
AVTNOVON EQU   IEDQAVTD+1200
AVTADEBN EQU   IEDQAVTD+1196
AVTVOLRR EQU   IEDQAVTD+1192
AVTTOTNR EQU   IEDQAVTD+1188
AVTTRCYR EQU   IEDQAVTD+1184
AVTRCTRR EQU   IEDQAVTD+1180
AVTNOVOR EQU   IEDQAVTD+1176
AVTADEBR EQU   IEDQAVTD+1172
AVTLODPT EQU   IEDQAVTD+1168
AVTIOBN  EQU   IEDQAVTD+1164
AVTIOBR  EQU   IEDQAVTD+1160
AVTCPBPT EQU   IEDQAVTD+1156
AVTFCPB  EQU   IEDQAVTD+1152
@NM00084 EQU   IEDQAVTD+1148
AVTINCPQ EQU   IEDQAVTD+1144
@NM00083 EQU   IEDQAVTD+1140
@NM00082 EQU   IEDQAVTD+1137
@NM00081 EQU   AVTBIT4
@NM00080 EQU   AVTBIT4
@NM00079 EQU   AVTBIT4
@NM00078 EQU   AVTBIT4
@NM00077 EQU   AVTBIT4
@NM00076 EQU   AVTBIT4
@NM00075 EQU   AVTBIT4
AVTRUFTN EQU   AVTBIT4
@NM00074 EQU   IEDQAVTD+1132
AVTNOBFQ EQU   IEDQAVTD+1128
@NM00073 EQU   IEDQAVTD+1124
AVTDKENQ EQU   IEDQAVTD+1120
@NM00072 EQU   IEDQAVTD+1116
AVTDKAPQ EQU   IEDQAVTD+1112
AVTCOPY  EQU   IEDQAVTD+1108
AVTIA    EQU   IEDQAVTD+1104
AVTFL    EQU   IEDQAVTD+1100
@NM00071 EQU   IEDQAVTD+1096
AVTNCPBQ EQU   IEDQAVTD+1092
AVTTOTNC EQU   IEDQAVTD+1088
AVTCMAX  EQU   IEDQAVTD+1084
AVTCMIN  EQU   IEDQAVTD+1080
AVTHM02  EQU   IEDQAVTD+1076
AVTOPCIN EQU   IEDQAVTD+1074
AVTDCTLN EQU   IEDQAVTD+1072
AVTOPMSK EQU   IEDQAVTD+1068
AVTDDFT  EQU   IEDQAVTD+1064
AVTSTEAL EQU   IEDQAVTD+1060
AVTOPTN  EQU   IEDQAVTD+1056
AVTDSKCT EQU   IEDQAVTD+1054
AVTCKRST EQU   IEDQAVTD+1053
AVTSTAN  EQU   AVTBIT3
AVTSTACN EQU   AVTBIT3
AVTSTAIN EQU   AVTBIT3
AVTSTAYN EQU   AVTBIT3
AVTOLTBN EQU   AVTBIT3
AVTTSAB  EQU   AVTBIT3
AVTRFULN EQU   AVTBIT3
AVTRECVN EQU   AVTBIT3
@NM00070 EQU   AVTBIT2
@NM00069 EQU   AVTBIT2
AVTOPEIN EQU   AVTBIT2
AVTSTRTN EQU   AVTBIT2
AVTTOPOL EQU   AVTBIT2
AVTCOPYN EQU   AVTBIT2
AVTREUSN EQU   AVTBIT2
AVTEXTSC EQU   AVTBIT2
AVTDISKN EQU   AVTBIT1
AVTQUCKN EQU   AVTBIT1
AVTCLOSN EQU   AVTBIT1
AVTREADN EQU   AVTBIT1
AVTDLAYN EQU   AVTBIT1
AVTAQTAN EQU   AVTBIT1
AVTTSON  EQU   AVTBIT1
AVTAPLKN EQU   AVTBIT1
AVTDUMBR EQU   IEDQAVTD+1048
AVTDLQX  EQU   IEDQAVTD+1046
AVTINTLV EQU   IEDQAVTD+1044
AVTSMCNT EQU   IEDQAVTD+1042
AVTAVFCT EQU   IEDQAVTD+1040
AVTOPCON EQU   IEDQAVTD+1038
AVTOPCNT EQU   IEDQAVTD+1036
AVTLNCNT EQU   IEDQAVTD+1034
AVTKEYLE EQU   IEDQAVTD+1032
AVTHA16  EQU   IEDQAVTD+1030
AVTHA7   EQU   IEDQAVTD+1028
AVTHA4   EQU   IEDQAVTD+1026
AVTHA3   EQU   IEDQAVTD+1024
AVTHA2   EQU   IEDQAVTD+1022
AVTGETMS EQU   IEDQAVTD+1021
@NM00068 EQU   IEDQAVTD+1020
AVTGETMD EQU   IEDQAVTD+1016
AVTGETMN EQU   IEDQAVTD+1012
AVTCWTOT EQU   IEDQAVTD+1008
AVTCWINT EQU   IEDQAVTD+956
AVTDTRAP EQU   IEDQAVTD+952
@NM00067 EQU   IEDQAVTD+950
@NM00066 EQU   AVTIOTR
AVTIOTRH EQU   AVTIOTR
AVTIOTRE EQU   AVTIOTR
@NM00065 EQU   AVTSUBT
AVTSUBPT EQU   AVTSUBT
AVTSUBON EQU   AVTSUBT
AVTAFE30 EQU   IEDQAVTD+944
AVTAFE20 EQU   IEDQAVTD+940
AVTAFE10 EQU   IEDQAVTD+936
AVTCWEC2 EQU   IEDQAVTD+932
AVTCWPM2 EQU   IEDQAVTD+928
AVTCWTS2 EQU   IEDQAVTD+927
AVTCWTS1 EQU   IEDQAVTD+926
AVTCWCLD EQU   AVTCWFL2
AVTCWRAP EQU   AVTCWFL2
@NM00064 EQU   AVTCWFL2
@NM00063 EQU   AVTCWFL2
@NM00062 EQU   AVTCWFL2
@NM00061 EQU   AVTCWFL2
@NM00060 EQU   AVTCWFL2
AVTCWACT EQU   AVTCWFL2
@NM00059 EQU   AVTCWFL1
@NM00058 EQU   AVTCWFL1
@NM00057 EQU   AVTCWFL1
@NM00056 EQU   AVTCWFL1
@NM00055 EQU   AVTCWFL1
@NM00054 EQU   AVTCWFL1
@NM00053 EQU   AVTCWFL1
AVTCOMWN EQU   AVTCWFL1
AVTCWEC1 EQU   IEDQAVTD+920
AVTCWPM1 EQU   IEDQAVTD+916
AVTCAREA EQU   IEDQAVTD+912
AVTFZERO EQU   IEDQAVTD+908
AVTCADDR EQU   IEDQAVTD+904
AVTCOREC EQU   IEDQAVTD+900
@NM00052 EQU   IEDQAVTD+892
AVTCPBCB EQU   IEDQAVTD+888
@NM00051 EQU   IEDQAVTD+880
AVTDSIOB EQU   IEDQAVTD+876
@NM00050 EQU   IEDQAVTD+868
AVTCPRMB EQU   IEDQAVTD+864
@NM00049 EQU   IEDQAVTD+856
AVTCLOSB EQU   IEDQAVTD+852
@NM00048 EQU   IEDQAVTD+844
AVTACTIB EQU   IEDQAVTD+840
@NM00047 EQU   IEDQAVTD+836
AVTOLTEB EQU   IEDQAVTD+832
AVTOLTCH EQU   AVTOLTQB+1
AVTOLTVT EQU   AVTOLTQB
@NM00046 EQU   AVTOPCQB+8
@NM00045 EQU   AVTOPCEC+1
@NM00044 EQU   AVTOPCCC
AVTOPCPO EQU   AVTOPCCC
AVTOPCWA EQU   AVTOPCCC
AVTOPCCH EQU   AVTOPCOB+1
AVTOPCVT EQU   AVTOPCOB
@NM00043 EQU   AVTCKPQB+9
AVTCKPTS EQU   AVTCKPQB+8
@NM00042 EQU   AVTCKPEC+1
@NM00041 EQU   AVTCKPCC
AVTCKPPO EQU   AVTCKPCC
AVTCKPWA EQU   AVTCKPCC
AVTCKPCH EQU   AVTCKPTB+1
AVTCKPVT EQU   AVTCKPTB
@NM00040 EQU   IEDQAVTD+796
AVTBFRTB EQU   IEDQAVTD+792
@NM00039 EQU   IEDQAVTD+784
AVTBFREB EQU   IEDQAVTD+780
AVTTIMQ  EQU   IEDQAVTD+776
@NM00038 EQU   IEDQAVTD+772
AVTIMQPS EQU   IEDQAVTD+768
AVTINOUT EQU   IEDQAVTD+766
AVTREFTM EQU   IEDQAVTD+764
@NM00037 EQU   IEDQAVTD+752
AVTDELYB EQU   IEDQAVTD+748
AVTOCQPT EQU   IEDQAVTD+744
AVTTSOPT EQU   IEDQAVTD+740
AVTSUPPT EQU   IEDQAVTD+736
AVTCBQCB EQU   IEDQAVTD+732
AVTMSGS  EQU   IEDQAVTD+729
@NM00036 EQU   AVTSYSER
@NM00035 EQU   AVTSYSER
@NM00034 EQU   AVTSYSER
@NM00033 EQU   AVTSYSER
@NM00032 EQU   AVTSYSER
@NM00031 EQU   AVTSYSER
AVTCMAXN EQU   AVTSYSER
AVTCMINN EQU   AVTSYSER
AVT2260L EQU   IEDQAVTD+724
AVTABEPL EQU   AVTADBUF
AVTHFF   EQU   AVTCLRHI+2
@NM00030 EQU   AVTCLRHI
AVTCCLNK EQU   AVTCRELE+5
AVTCCPRI EQU   AVTCRELE+4
AVTCCQCB EQU   AVTCCELE+1
AVTCCKEY EQU   AVTCCELE
AVTDELAD EQU   IEDQAVTD+704
AVTDELEM EQU   IEDQAVTD+700
AVTBSX   EQU   AVTCKLNK
AVTOPETR EQU   AVTHG01
@NM00029 EQU   AVTCKBYT
AVTCKONQ EQU   AVTCKBYT
@NM00028 EQU   AVTCKBYT
@NM00027 EQU   AVTCKBYT
@NM00026 EQU   AVTCKBYT
@NM00025 EQU   AVTCKBYT
@NM00024 EQU   AVTCKBYT
@NM00023 EQU   AVTCKBYT
AVTOPERT EQU   IEDQAVTD+690
AVTOPXCL EQU   IEDQAVTD+688
AVTOPERL EQU   IEDQAVTD+687
@NM00022 EQU   IEDQAVTD+686
AVTCKTIM EQU   IEDQAVTD+684
AVTCKELV EQU   IEDQAVTD+682
AVTCPRCD EQU   IEDQAVTD+681
AVTWARMN EQU   AVTCKELF
AVTCRTLN EQU   AVTCKELF
AVTCPIPN EQU   AVTCKELF
AVTCCLCN EQU   AVTCKELF
AVTCINCN EQU   AVTCKELF
@NM00021 EQU   AVTCKELF
AVTCMCPN EQU   AVTCKELF
AVTNQBCK EQU   AVTCKELF
AVTCKQAD EQU   IEDQAVTD+677
AVTSCBSZ EQU   IEDQAVTD+676
@NM00020 EQU   IEDQAVTD+672
AVTCKELE EQU   IEDQAVTD+668
@NM00019 EQU   AVTCKPEL+8
AVTCKRLK EQU   AVTCKPEL+5
AVTCKRPR EQU   AVTCKPEL+4
AVTCKRMQ EQU   AVTCKRMV+1
AVTCKRKY EQU   AVTCKRMV
AVTHK    EQU   IEDQAVTD+648
AVTHI    EQU   IEDQAVTD+644
AVTIOT   EQU   IEDQAVTD+640
AVTNX    EQU   IEDQAVTD+636
AVTTONE  EQU   IEDQAVTD+632
AVTA3TL  EQU   IEDQAVTD+628
AVTDMECB EQU   IEDQAVTD+624
AVTABEND EQU   IEDQAVTD+618
AVTPLCBN EQU   IEDQAVTD+616
@NM00018 EQU   AVTSAVTP+1
@NM00017 EQU   AVTSAVTF
AVTSNA   EQU   AVTSAVTF
AVTONSNA EQU   AVTSAVTF
AVTVTMCP EQU   AVTSAVTF
@NM00016 EQU   IEDQAVTD+608
AVTCMBSS EQU   IEDQAVTD+604
AVTRCV   EQU   IEDQAVTD+600
AVTSEND  EQU   IEDQAVTD+596
AVTCSCH  EQU   IEDQAVTD+592
AVTQ1    EQU   IEDQAVTD+588
AVTE7    EQU   IEDQAVTD+584
AVTHB    EQU   IEDQAVTD+580
AVTR1    EQU   IEDQAVTD+576
AVTBZ    EQU   IEDQAVTD+572
AVTEZ    EQU   IEDQAVTD+568
AVTEC    EQU   IEDQAVTD+564
AVTEW    EQU   IEDQAVTD+560
AVTNDIAL EQU   AVTSCOPT
AVTN2741 EQU   AVTSCOPT
AVTCONCO EQU   AVTSCOPT
AVTCONC  EQU   AVTSCOPT
AVTCMBUF EQU   AVTSCOPT
AVTAPDMP EQU   AVTSCOPT
@NM00015 EQU   AVTSCOPT
AVTHA    EQU   AVTDISP
AVTEA    EQU   IEDQAVTD+548
AVTAX    EQU   IEDQAVTD+544
AVTA3    EQU   IEDQAVTD+540
AVTGD    EQU   IEDQAVTD+536
AVTAL    EQU   IEDQAVTD+532
AVTOLTST EQU   AVTHG02
AVTE8    EQU   IEDQAVTD+524
AVTUI    EQU   IEDQAVTD+520
AVTCOMPT EQU   IEDQAVTD+516
AVTCRSRF EQU   IEDQAVTD+512
@NM00014 EQU   IEDQAVTD+508
AVTKA02  EQU   IEDQAVTD+504
AVTOPTPT EQU   IEDQAVTD+500
AVTPCBPT EQU   IEDQAVTD+496
@NM00013 EQU   AVTECB1
AVTCOMP  EQU   AVTECB1
@NM00012 EQU   AVTECB1
AVTOPECA EQU   IEDQAVTD+488
AVTOLECA EQU   IEDQAVTD+484
AVTCKECA EQU   IEDQAVTD+480
AVTCWECA EQU   IEDQAVTD+476
AVTCWTCB EQU   IEDQAVTD+472
AVTOLTCB EQU   IEDQAVTD+468
AVTOCTCB EQU   IEDQAVTD+464
AVTCKTCB EQU   IEDQAVTD+460
AVTAS    EQU   IEDQAVTD+456
AVTNOLBF EQU   IEDQAVTD+454
AVTNCKPR EQU   IEDQAVTD+453
AVTCIB   EQU   IEDQAVTD+452
AVTSPLPT EQU   IEDQAVTD+448
AVTMVBFR EQU   IEDQAVTD+444
AVTSBTA  EQU   IEDQAVTD+440
AVTRARTN EQU   IEDQAVTD+436
AVTBSCAN EQU   IEDQAVTD+432
AVTRDYA  EQU   IEDQAVTD+428
AVTDISTR EQU   IEDQAVTD+420
AVTPARM3 EQU   IEDQAVTD+416
@NM00011 EQU   AVTPKF
@NM00010 EQU   AVTPKF
@NM00009 EQU   AVTPKF
AVTFTCHF EQU   AVTPKF
@NM00008 EQU   AVTPKF
@NM00007 EQU   AVTPKF
@NM00006 EQU   AVTPKF
@NM00005 EQU   AVTPKF
AVTPARM  EQU   IEDQAVTD+408
AVTEXS2A EQU   IEDQAVTD+402
AVTEXA2S EQU   IEDQAVTD+396
AVTOCGET EQU   IEDQAVTD+392
AVTCKAVT EQU   @NM00003+1
@NM00004 EQU   AVTCKFLG
AVTCKHLT EQU   AVTCKFLG
AVTCKREQ EQU   AVTCKFLG
AVTCKENV EQU   AVTCKFLG
AVTCKNAC EQU   AVTCKFLG
AVTCKTAC EQU   AVTCKFLG
@NM00002 EQU   IEDQAVTD+384
AVTREADD EQU   IEDQAVTD+380
AVTREADY EQU   IEDQAVTD+376
AVTRACE  EQU   IEDQAVTD+372
AVTTCB   EQU   IEDQAVTD+368
AVTPASWD EQU   IEDQAVTD+360
AVTCTLCH EQU   IEDQAVTD+352
AVTDOUBL EQU   IEDQAVTD+344
AVTDOUBX EQU   IEDQAVTD+336
AVTDPARM EQU   IEDQAVTD+332
AVTCSTCS EQU   IEDQAVTD+328
AVTDLQ   EQU   AVTSAVEX+32
@NM00001 EQU   AVTSAVEX
AVTSAVE4 EQU   IEDQAVTD+216
AVTSAVE3 EQU   IEDQAVTD+144
AVTSAVE2 EQU   IEDQAVTD+72
AVTSAVE1 EQU   IEDQAVTD
*                                      END UNREFERENCED COMPONENTS
@RT00355 EQU   FREERU
@RT00357 EQU   REQUEST
@RF00357 EQU   ANSWER
@RT00396 EQU   ERREXIT
@RT00432 EQU   FREEOPCE
@RF00434 EQU   @RC00429
@RT00459 EQU   FREEOPCE
@RT00465 EQU   BADRU
@RF00465 EQU   GOODRESP
@RF00505 EQU   COMPLETE
@RC00532 EQU   @RC00530
@RC00537 EQU   @RC00530
@RC00544 EQU   @RC00530
@RC00574 EQU   @EL00001
FOUND    EQU   @EL00001
NOSAVED  EQU   @EL00001
@RT00577 EQU   FOUND
@EL01    EQU   @EL00001
@ENDDATA EQU   *
@DATEND  EQU   *
         END   IGCT010D,(C'PLS1321',0701,77209)
