         TITLE 'IGCV810D, STOPLINE FOR 3705 LINES                      *
                        '
IGCV810D CSECT ,                                                01S0001
@PROLOG  DS    0H                                               01S0002
         USING *,RBASE                  ESTABLISH A BASE REGISTER
         LR    RBASE,REG15              SETUP BASE REG
IGCV810D IEDHJN AFTERHJN,HJN            MODULE IDENTIFICATION MACRO
*   ROPCAVT=RPARM;                  /* SET BASE POINTER FOR OP  03S0398
*                                      CONTROL AVT                   */
         LR    ROPCAVT,RPARM                                    03S0398
*   RAVT=OPCAVTPT;                  /* SET THE BASE POINTER FOR THE
*                                      TCAM ADDRESS VECTOR TABLE     */
         L     RAVT,OPCAVTPT(,ROPCAVT)                          03S0399
*   ROPCE=OPCCOPCE;                 /* SET THE BASE POINTER FOR THE
*                                      OPERATOR CONTROL ELEMENT      */
         L     ROPCE,OPCCOPCE(,ROPCAVT)                         03S0400
*   OPCFLAG1=ZERO;                  /* CLEAR CONTROL SWITCHES        */
         MVI   OPCFLAG1(ROPCAVT),X'00'                          03S0401
*   IF OCRESP=ON THEN                                           02S0402
         TM    OCRESP(ROPCE),B'00000001'                        02S0402
         BNO   @RF00402                                         02S0402
*     DO;                           /* IF THIS IS AN OPCE WITH A
*                                      NON-SNA RESPONSE, PROCESS THE
*                                      RESPONSE                      */
*                                                               03S0404
*       /*************************************************************/
*       /*                                                           */
*       /* PROCESS.RESPROC: THIS ROUTINE WILL PROCESS A NON-SNA      */
*       /* RESPONSE                                                  */
*       /*                                                           */
*       /*************************************************************/
*                                                               03S0404
*       RFY                                                     03S0404
*        (RWORK5,                                               03S0404
*         RWORK6,                                               03S0404
*         RWORK7,                                               03S0404
*         RWORKA) RSTD;                                         03S0404
*       CALL IPWLSRCH;              /* SEARCH WAITV CHAIN FOR   03S0405
*                                      MATCHING OPCE                 */
         BAL   @14,IPWLSRCH                                     03S0405
*       RZERO->OCLINK=RPARM->OCLINK;/* UNLINK OPCE FROM CHAIN        */
         L     @11,OCLINK(,RPARM)                               03S0406
         LR    @09,RZERO                                        03S0406
         ST    @11,OCLINK(,@09)                                 03S0406
*       RWORK6=RPARM;               /* SAVE ADDRESS OF REAL OPCE     */
         LR    RWORK6,RPARM                                     03S0407
*       RWORKA=0;                   /* CLEAR OUT WORK REGISTER  03S0408
*                                                            @OY19465*/
         SLR   RWORKA,RWORKA                                    03S0408
*       WAITFLG=ON;                 /* TURN WAITFLG ON       @OY19465*/
         OI    WAITFLG(ROPCAVT),B'00100000'                     03S0409
*       RPARM=RZERO->OCLINK;        /* SET RPARM TO NEXT ELEMENT
*                                                            @OY19465*/
         LR    RPARM,@11                                        03S0410
*       DO WHILE(WAITFLG=ON);       /* CONTINUE UNITL WAITFLG IS
*                                      TURNED OFF            @OY19465*/
         B     @DE00411                                         03S0411
@DL00411 DS    0H                                               03S0412
*         IF RPARM=ZERO THEN                                    03S0412
         LTR   RPARM,RPARM                                      03S0412
         BNZ   @RF00412                                         03S0412
*           WAITFLG=OFF;            /* END OF WAITV CHAIN    @OY19465*/
         NI    WAITFLG(ROPCAVT),B'11011111'                     03S0413
*         ELSE                                                  03S0414
*           DO;                     /* CONTINUE SEARCHING    @OY19465*/
         B     @RC00412                                         03S0414
@RF00412 DS    0H                                               03S0415
*             IF OCTRMTBL=RPARM->OCTRMTBL&RPARM->OCDACTIP=OFF THEN
         CLC   OCTRMTBL(2,ROPCE),OCTRMTBL(RPARM)                03S0415
         BNE   @RF00415                                         03S0415
         TM    OCDACTIP(RPARM),B'01000000'                      03S0415
         BNZ   @RF00415                                         03S0415
*               DO;                 /* IF THE TTCIN OF THE ELEMENT IS
*                                      EQUAL TO THAT OF THE CURRENT
*                                      OPCE AND A DEACT HAS NOT BEEN
*                                      SENT OUT FOR THE LINE THEN
*                                      DELINK THE ELEMENT OFF OF
*                                      OPCWAITV AND ATTACH IT TO THE
*                                      CURRENT ELEMENT       @OY19465*/
*                 CALL DLKATT;      /* CALL THE DELINK AND ATTACH
*                                      ROUTINE               @OY19465*/
         BAL   @14,DLKATT                                       03S0417
*                 RPARM=RZERO->OCLINK;/* SET REGISTER RPARM UP FOR
*                                      REST OF SEARCH OF THE CHAIN
*                                                            @OY19465*/
         LR    @11,RZERO                                        03S0418
         L     RPARM,OCLINK(,@11)                               03S0418
*               END;                /*                       @OY19465*/
*             ELSE                                              03S0420
*               DO;                 /* MUST SEARCH CHAIN FOR ANY
*                                      STOPTERMS THAT ARE IN PROGRESS
*                                      ON THIS LINE          @OY19465*/
         B     @RC00415                                         03S0420
@RF00415 DS    0H                                               03S0421
*                 IF RPARM->OCWTG=MODVF&OCBACKUP=RPARM->OCBACKUP THEN
         CLC   OCWTG(2,RPARM),MODVF                             03S0421
         BNE   @RF00421                                         03S0421
         CLC   OCBACKUP(8,ROPCE),OCBACKUP(RPARM)                03S0421
         BNE   @RF00421                                         03S0421
*                   DO;             /* THIS IS A STOPTERM FOR A 03S0422
*                                      TERMINAL ON A LINE IN THIS
*                                      GROUP                 @OY19465*/
*                     WAITFLG=OFF;  /* ONCE WE FIND A STOPTERM FOR A
*                                      TERMINAL IN THIS GROUP, THEN
*                                      WE KNOW THAT THERE WILL BE NO
*                                      MORE OPCE'S ON THIS CHAIN
*                                      WHICH NEED TO BE ATTACHED
*                                                            @OY19465*/
         NI    WAITFLG(ROPCAVT),B'11011111'                     03S0423
*                     RWORK5=RZERO; /* SAVE RZERO            @OY19465*/
         LR    RWORK5,RZERO                                     03S0424
*                     RWORK7=RPARM; /* SAVE RPARM            @OY19465*/
         LR    RWORK7,RPARM                                     03S0425
*                     RPARM=RPARM->OCTRMTBL;/* GET TTCIN OF TERMINAL
*                                                            @OY19465*/
         SLR   @11,@11                                          03S0426
         ICM   @11,3,OCTRMTBL(RPARM)                            03S0426
         LR    RPARM,@11                                        03S0426
*                     CALL IEDQTNT; /* GET TRM ENTRY         @OY19465*/
         L     @15,AVTRNMPT(,RAVT)                              03S0427
         BALR  @14,@15                                          03S0427
*                     RTRM=RPARM;   /* SET UP TERMINAL BASE  @OY19465*/
         LR    RTRM,RPARM                                       03S0428
*                     RPARM=OCTRMTBL;/* RESET RPARM FOR REST OF 03S0429
*                                      SEARCH                @OY19465*/
         SLR   RPARM,RPARM                                      03S0429
         ICM   RPARM,3,OCTRMTBL(ROPCE)                          03S0429
*                     DO WHILE(TRMTYPE^=TRMNSDLC);/* LOOP UNTIL FIND
*                                      LINE                  @OY19465*/
         B     @DE00430                                         03S0430
@DL00430 DS    0H                                               03S0431
*                       CALL IEDQTNT;/* GET TTE              @OY19465*/
         L     @15,AVTRNMPT(,RAVT)                              03S0431
         BALR  @14,@15                                          03S0431
*                       CALL COHORTLK;/* GET NEXT RES        @OY19465*/
         L     @15,OPCHORT(,ROPCAVT)                            03S0432
         BALR  @14,@15                                          03S0432
*                       RTRM=RPARM; /* EST ADDRESSABILITY    @OY19465*/
         LR    RTRM,RPARM                                       03S0433
*                       RPARM=RZERO;/* SET UP INTERFACE TO TNT CODE
*                                                            @OY19465*/
         LR    RPARM,RZERO                                      03S0434
*                     END;          /* END OF LOOP TO FIND LINE 03S0435
*                                                            @OY19465*/
@DE00430 LR    @11,RTRM                                         03S0435
         AL    @11,@CF01505                                     03S0435
         CLI   TRMTYPE-11(@11),X'20'                            03S0435
         BNE   @DL00430                                         03S0435
*                     IF RPARM=OCTRMTBL THEN                    03S0436
         SLR   @11,@11                                          03S0436
         ICM   @11,3,OCTRMTBL(ROPCE)                            03S0436
         CR    RPARM,@11                                        03S0436
         BNE   @RF00436                                         03S0436
*                       DO;         /* TERMINAL IS ON CURRENT LINE
*                                                            @OY19465*/
*                         RZERO=RWORK5;/* RESTORE RZERO      @OY19465*/
         LR    RZERO,RWORK5                                     03S0438
*                         RPARM=RWORK7;/* RESTORE RPARM      @OY19465*/
         LR    RPARM,RWORK7                                     03S0439
*                         CALL DLKATT;/* DELINK THE STOPTERM ELEMENT
*                                      AND ATTACH TO CURRENT ELEMENT
*                                                            @OY19465*/
         BAL   @14,DLKATT                                       03S0440
*                       END;        /*                       @OY19465*/
*                     ELSE                                      03S0442
*                       ;           /*                       @OY19465*/
@RF00436 DS    0H                                               03S0443
*                   END;            /*                       @OY19465*/
*                 ELSE                                          03S0444
*                   DO;             /* THIS ELEMENT ON WAITCHN DOES
*                                      NOT NEED TO BE ATTACHED TO THE
*                                      CURRENT ELEMENT THEREFORE THE
*                                      CHAIN POINTERS WILL BE   03S0444
*                                      INCREMENTED IN ORDER TO  03S0444
*                                      CONTINUE THE SEARCH   @OY19465*/
         B     @RC00421                                         03S0444
@RF00421 DS    0H                                               03S0445
*                     RZERO=RPARM;  /* SAVE CURRENT POINTER  @OY19465*/
         LR    RZERO,RPARM                                      03S0445
*                     RPARM=RPARM->OCLINK;/* NEXT ELEMENT TO BE 03S0446
*                                      COMPARED WITH CURRENT OPCE
*                                                            @OY19465*/
         L     RPARM,OCLINK(,RPARM)                             03S0446
*                   END;                                        03S0447
*               END;                                            03S0448
@RC00421 DS    0H                                               03S0449
*           END;                                                03S0449
@RC00415 DS    0H                                               03S0450
*       END;                                                    03S0450
@RC00412 DS    0H                                               03S0450
@DE00411 TM    WAITFLG(ROPCAVT),B'00100000'                     03S0450
         BO    @DL00411                                         03S0450
*       IF RWORKA^=0 THEN                                       03S0451
         LTR   RWORKA,RWORKA                                    03S0451
         BZ    @RF00451                                         03S0451
*         RWORK6=RWORKA;            /* IF RWORKA IS NOT 0 THEN RWORK6
*                                      MUST BE RESTORED BECAUSE 03S0452
*                                      RWORK6 WAS CHANGED BECAUSE
*                                      MORE THAN ONE ELEMENT ON THE
*                                      WAIT CHAIN MAY BE DELINKED AND
*                                      ATTACHED TO THE CURRENT OPCE
*                                                            @OY19465*/
         LR    RWORK6,RWORKA                                    03S0452
*       RWORK7=OCPARM;              /* SAVE RETURN CODE              */
@RF00451 LH    @11,OCPARM(,ROPCE)                               03S0453
         LR    RWORK7,@11                                       03S0453
*       RWORK6->OCUNIT=INVALTIC;    /* INDICATE OPCE ONLY UNIT TO BE
*                                      FREED                         */
         MVC   OCUNIT(4,RWORK6),@CF01775                        03S0454
*       IF OCPARM^=ONE&RWORK6->OCALLFLG=OFF THEN                03S0455
         CH    @11,@CH00061                                     03S0455
         BE    @RF00455                                         03S0455
         TM    OCALLFLG(RWORK6),B'00000100'                     03S0455
         BNZ   @RF00455                                         03S0455
*         DO;                       /* IF NOT A GOOD RESPONSE AND NOT
*                                      AN 'ALL' REQUEST THEN @YM06145*/
*           IF OCPARM=TWO THEN                                  03S0457
         CH    @11,@CH00065                                     03S0457
         BNE   @RF00457                                         03S0457
*             DO;                   /* IF LINE ALREADY STOPPED THEN  */
*               IF RWORK6->OCTOTE=ON THEN                       03S0459
         TM    OCTOTE(RWORK6),B'01000000'                       03S0459
         BNO   @RF00459                                         03S0459
*                 TRMSTOTE=ON;      /* INDICATE TOTE OWN     @YM06145*/
         LR    @11,RTRM                                         03S0460
         AL    @11,@CF02313                                     03S0460
         OI    TRMSTOTE-3(@11),B'00000001'                      03S0460
*               OPCWRKSP(1)=MSG25;  /* SETUP MSG NUMBER              */
@RF00459 MVC   OPCWRKSP(4,ROPCAVT),@CF02218                     03S0461
*               OPCWRKSP(2)=EIGHT;  /* SETUP RETURN CODE             */
         MVC   OPCWRKSP+4(4,ROPCAVT),@CF00045                   03S0462
*             END;                                              03S0463
*           ELSE                                                03S0464
*             DO;                                               03S0464
         B     @RC00457                                         03S0464
@RF00457 DS    0H                                               03S0465
*               OPCWRKSP(1)=MSG199; /* BAD RESPONSE                  */
         MVC   OPCWRKSP(4,ROPCAVT),@CF02224                     03S0465
*               OPCWRKSP(2)=FOUR;   /* SETUP RETURN CODE             */
         MVC   OPCWRKSP+4(4,ROPCAVT),@CF00256                   03S0466
*               RWORK6->OCUNIT=OCUNIT;/* ATTACH UNIT FROM INPUT OPCE
*                                      TO REAL OPCE                  */
         MVC   OCUNIT(4,RWORK6),OCUNIT(ROPCE)                   03S0467
*               OCUNIT=INVALTIC;    /* INDICATE LAST UNIT    @OY20509*/
         MVC   OCUNIT(4,ROPCE),@CF01775                         03S0468
*             END;                                              03S0469
*         END;                                                  03S0470
@RC00457 DS    0H                                               03S0471
*       RPARM=ROPCE;                /* SETUP INPUT OPCE TO BE FREED  */
@RF00455 LR    RPARM,ROPCE                                      03S0471
*       RFY                                                     03S0472
*         RSAVE RSTD;                                           03S0472
*       RSAVE=ADDR(OPCSAVE);        /* SETUP SAVEAREA                */
         LA    RSAVE,OPCSAVE(,ROPCAVT)                          03S0473
*       CALL FREEBUFF;              /* FREE INPUT OPCE AND ATTACHED
*                                      UNIT                          */
         L     @15,OPCFREBF(,ROPCAVT)                           03S0474
         BALR  @14,@15                                          03S0474
*       RFY                                                     03S0475
*         RSAVE UNRSTD;                                         03S0475
*       ROPCE=RWORK6;               /* SETUP ADDRESS OF REAL OPCE    */
         LR    ROPCE,RWORK6                                     03S0476
*       OPCCOPCE=RWORK6;            /* SAVE OPCE ADDR IN OP CONTROL
*                                      AVT                           */
         ST    RWORK6,OPCCOPCE(,ROPCAVT)                        03S0477
*       RPARM=OCTRMTBL;             /* GET TTCIN OF LINE TTE         */
         SLR   RPARM,RPARM                                      03S0478
         ICM   RPARM,3,OCTRMTBL(ROPCE)                          03S0478
*       CALL IEDQTNT;               /* GET LINE TTE                  */
         L     @15,AVTRNMPT(,RAVT)                              03S0479
         BALR  @14,@15                                          03S0479
*       RTRM=RPARM;                 /* SETUP TERM BASE               */
         LR    RTRM,RPARM                                       03S0480
*       OCWTG=OCWTGB;               /* SETUP WHERE-TO-GO FIELD       */
         MVC   OCWTG(2,ROPCE),OCWTGB(ROPCE)                     03S0481
*       IF RWORK7=ONE THEN                                      03S0482
         CH    RWORK7,@CH00061                                  03S0482
         BNE   @RF00482                                         03S0482
*         DO;                       /* WAS IT A GOOD RESPONSE?       */
*           OPCWRKSP(1)=MSG26;      /* SETUP GOOD RESPONSE           */
         MVC   OPCWRKSP(4,ROPCAVT),@CF02220                     03S0484
*           OPCWRKSP(2)=ZERO;       /* SETUP GOOD RETURN CODE        */
         SLR   @11,@11                                          03S0485
         ST    @11,OPCWRKSP+4(,ROPCAVT)                         03S0485
*           IF OCTOTE=ON THEN                                   03S0486
         TM    OCTOTE(ROPCE),B'01000000'                        03S0486
         BNO   @RF00486                                         03S0486
*             TRMSTOTE=ON;          /* INDICATE TOTE OWNERSHIP       */
         LR    @11,RTRM                                         03S0487
         AL    @11,@CF02313                                     03S0487
         OI    TRMSTOTE-3(@11),B'00000001'                      03S0487
*           CALL IPEXIT;            /* PERFORM NORMAL EXIT PROCESSING*/
@RF00486 BAL   @14,IPEXIT                                       03S0488
*         END;                                                  03S0489
*       ELSE                        /* EITHER A BAD RESPONSE OR LINE
*                                      ALREADY STOPPED               */
*         CALL IPERROR;             /* PERFORM ERROR PROCESSING      */
         B     @RC00482                                         03S0490
@RF00482 BAL   @14,IPERROR                                      03S0490
*       RFY                                                     03S0491
*        (RWORK6,                                               03S0491
*         RWORK7) UNRSTD;                                       03S0491
@RC00482 DS    0H                                               03S0492
*     END;                                                      02S0492
*   ELSE                                                        02S0493
*     IF OCPARM^=ZERO THEN                                      02S0493
         B     @RC00402                                         02S0493
@RF00402 LH    @11,OCPARM(,ROPCE)                               02S0493
         LTR   @11,@11                                          02S0493
         BZ    @RF00493                                         02S0493
*       DO;                         /* IF THIS IS AN OPCE WITH A SNA
*                                      RESPONSE, PROCESS IT          */
*                                                               03S0495
*         /***********************************************************/
*         /*                                                         */
*         /* PROCESS.SNAPROC: THIS SEGMENT PROCESSES SNA RESPONSES   */
*         /*                                                         */
*         /***********************************************************/
*                                                               03S0495
*         OCWTG=OCWTGB;             /* SETUP WHERE-TO-GO FIELD       */
         MVC   OCWTG(2,ROPCE),OCWTGB(ROPCE)                     03S0495
*         OPCWRKSP(1)=OCPARM;       /* SETUP MESSAGE NUMBER          */
         ST    @11,OPCWRKSP(,ROPCAVT)                           03S0496
*         RPARM=OCTRMTBL;           /* SETUP TTCIN OF SNA LINE       */
         SLR   RPARM,RPARM                                      03S0497
         ICM   RPARM,3,OCTRMTBL(ROPCE)                          03S0497
*         CALL IEDQTNT;             /* GET LINE TTE                  */
         L     @15,AVTRNMPT(,RAVT)                              03S0498
         BALR  @14,@15                                          03S0498
*         RTRM=RPARM;               /* SETUP TERM BASE               */
         LR    RTRM,RPARM                                       03S0499
*         IF OCPARM=MSG401 THEN                                 03S0500
         CLC   OCPARM(2,ROPCE),@CH02230                         03S0500
         BNE   @RF00500                                         03S0500
*           DO;                     /* IF SNA LINE DEACTIVATED, 03S0501
*                                      PROCESS NORMALLY              */
*             OPCWRKSP(2)=ZERO;     /* SETUP RETURN CODE             */
         SLR   @11,@11                                          03S0502
         ST    @11,OPCWRKSP+4(,ROPCAVT)                         03S0502
*             CALL IPEXIT;          /* DO NORMAL EXIT PROCESSING     */
         BAL   @14,IPEXIT                                       03S0503
*           END;                                                03S0504
*         ELSE                                                  03S0505
*           DO;                                                 03S0505
         B     @RC00500                                         03S0505
@RF00500 DS    0H                                               03S0506
*             IF OCPARM=MSG539 THEN                             03S0506
         CLC   OCPARM(2,ROPCE),@CH02232                         03S0506
         BNE   @RF00506                                         03S0506
*               OPCWRKSP(2)=EIGHT;  /* LINE ALREADY DEACTIVATED      */
         MVC   OPCWRKSP+4(4,ROPCAVT),@CF00045                   03S0507
*             ELSE                                              03S0508
*               OPCWRKSP(2)=FOUR;   /* ELSE SETUP ERROR RETURN CODE  */
         B     @RC00506                                         03S0508
@RF00506 MVC   OPCWRKSP+4(4,ROPCAVT),@CF00256                   03S0508
*             CALL IPERROR;         /* DO ERROR PROCESSING           */
@RC00506 BAL   @14,IPERROR                                      03S0509
*           END;                                                03S0510
*       END;                                                    02S0511
*     ELSE                                                      02S0512
*       FIRSTREQ=ON;                /* ELSE INDICATE ITS A FIRST
*                                      REQUEST                       */
         B     @RC00493                                         02S0512
@RF00493 OI    FIRSTREQ(ROPCAVT),B'10000000'                    02S0512
*   DO WHILE(FIRSTREQ=ON×MORLINES=ON);/* IF THIS IS A FIRST REQUEST
*                                      OR MORE LINES ARE LEFT TO
*                                      PROCESS, PROCESS STOPLINE
*                                      REQUEST                       */
@RC00493 DS    0H                                               02S0513
@RC00402 B     @DE00513                                         02S0513
@DL00513 DS    0H                                               02S0514
*                                                               03S0514
*     /***************************************************************/
*     /*                                                             */
*     /* PROCESS.STPLPROC: THIS SEGMENT PROCESSES STOPLINE REQUESTS  */
*     /*                                                             */
*     /***************************************************************/
*                                                               03S0514
*     MORLINES=OFF;                 /* RESET LINE INDICATOR          */
         NI    MORLINES(ROPCAVT),B'10111111'                    03S0514
*     IF FIRSTREQ=ON THEN                                       03S0515
         TM    FIRSTREQ(ROPCAVT),B'10000000'                    03S0515
         BNO   @RF00515                                         03S0515
*       DO;                         /* IF THIS REQUEST IS FIRST ONE,
*                                      SETUP TO ESTABLISH FIRST LINE */
*         FIRSTREQ=OFF;             /* TURN OFF FIRST REQUEST FLAG   */
         NI    FIRSTREQ(ROPCAVT),B'01111111'                    03S0517
*                                                               04S0518
*         /***********************************************************/
*         /*                                                         */
*         /* PROCESS.STPLPROC.FIRSTLN: THIS SEGMENT ESTABLISHES THE  */
*         /* FIRST LINE TO BE STOPPED                                */
*         /*                                                         */
*         /***********************************************************/
*                                                               04S0518
*         IF OCRENTRD=ON THEN                                   04S0518
         TM    OCRENTRD(ROPCE),B'10000000'                      04S0518
         BNO   @RF00518                                         04S0518
*           DO;                     /* IS THIS A RE-ENTRY?           */
*             OCRENTRD=OFF;         /* RE-SET 'RE-ENTERED' INDICATOR */
         NI    OCRENTRD(ROPCE),B'01111111'                      04S0520
*             OCWTG=OCWTGB;         /* SETUP WHERE-TO-GO FIELD       */
         MVC   OCWTG(2,ROPCE),OCWTGB(ROPCE)                     04S0521
*           END;                                                04S0522
*         RPARM=OCTRMTBL;           /* GET TTCIN OF RESOURCE         */
@RF00518 SLR   RPARM,RPARM                                      04S0523
         ICM   RPARM,3,OCTRMTBL(ROPCE)                          04S0523
*         CALL IEDQTNT;             /* FIND TTE OF RESOURCE          */
         L     @15,AVTRNMPT(,RAVT)                              04S0524
         BALR  @14,@15                                          04S0524
*         RTRM=RPARM;               /* SETUP TERM BASE               */
         LR    RTRM,RPARM                                       04S0525
*         IF TRMTYPE=TRMGRP THEN                                04S0526
         LR    @11,RTRM                                         04S0526
         SH    @11,@CH01234                                     04S0526
         CLI   TRMTYPE(@11),X'00'                               04S0526
         BNE   @RF00526                                         04S0526
*           DO;                     /* IS THIS A GROUP TTE           */
*             IF TRMSUBST^=ZERO THEN                            04S0528
         ICM   @09,3,TRMSUBST(@11)                              04S0528
         BZ    @RF00528                                         04S0528
*               DO;                                             04S0529
*                 OCTRMTBL=TRMSUBST;/* SAVE TTCIN OF LINE            */
         SLR   @09,@09                                          04S0530
         ICM   @09,3,TRMSUBST(@11)                              04S0530
         STH   @09,OCTRMTBL(,ROPCE)                             04S0530
*                 RPARM=OCTRMTBL;   /* GET TTCIN FROM OPCE           */
         LR    RPARM,@09                                        04S0531
*                 CALL IEDQTNT;     /* FIND LINE TTE                 */
         L     @15,AVTRNMPT(,RAVT)                              04S0532
         BALR  @14,@15                                          04S0532
*                 RTRM=RPARM;       /* SETUP LINE TTE ADDRESS        */
         LR    RTRM,RPARM                                       04S0533
*               END;                                            04S0534
*             ELSE                                              04S0535
*               DO;                                             04S0535
         B     @RC00528                                         04S0535
@RF00528 DS    0H                                               04S0536
*                 EXITFLG=ON;       /* PREPARE TO EXIT               */
         OI    EXITFLG(ROPCAVT),B'00010000'                     04S0536
*                 OPCMODID=MOD03;   /* SETUP MOD ID                  */
         MVC   OPCMODID(2,ROPCAVT),MOD03                        04S0537
*                 RZERO=MSG541;     /* GROUP HAS NO LINES ATTACHED   */
         LA    RZERO,541                                        04S0538
*                 RPARM=FOUR;       /* SETUP RETURN CODE             */
         LA    RPARM,4                                          04S0539
*               END;                                            04S0540
*           END;                                                04S0541
@RC00528 DS    0H                                               04S0542
*         IF EXITFLG=OFF THEN                                   04S0542
@RF00526 TM    EXITFLG(ROPCAVT),B'00010000'                     04S0542
         BNZ   @RF00542                                         04S0542
*           DO;                                                 04S0543
*             IF OCSWITCH^=OCSTPLNI THEN/* STOPLINE,C OY14092        */
         CLI   OCSWITCH(ROPCE),X'12'                            04S0544
         BE    @RF00544                                         04S0544
*               DO;                 /* YES OY14092                   */
*                 CALL IPWLSRCH;    /* SEARCH WAITV CHAIN    @OY19465*/
         BAL   @14,IPWLSRCH                                     04S0546
*                 IF RPARM=ZERO THEN                            04S0547
         LTR   RPARM,RPARM                                      04S0547
         BNZ   @RF00547                                         04S0547
*                   DO;             /* IF A MATCH WAS NOT FOUND      */
*                     IF OCALLFLG=ON THEN                       04S0549
         TM    OCALLFLG(ROPCE),B'00000100'                      04S0549
         BNO   @RF00549                                         04S0549
*                       DO;         /* CHECK 'ALL' STATUS            */
*                         OCSOME=OFF;/* INDICATE AN UNSET STATUS     */
*                         OCNONE=OFF;                           04S0552
         NI    OCSOME(ROPCE),B'11111100'                        04S0552
*                       END;                                    04S0553
*                   END;                                        04S0554
*                 ELSE                                          04S0555
*                   DO;                                         04S0555
         B     @RC00547                                         04S0555
@RF00547 DS    0H                                               04S0556
*                     IF RPARM->OCSWITCH=OCSTPLNI THEN/* STOPLINE,I
*                                      OY14092                       */
         CLI   OCSWITCH(RPARM),X'12'                            04S0556
         BNE   @RF00556                                         04S0556
*                       DO;         /* YES OY14092                   */
*                         OCELEM=RPARM;/* ATTACH THE WAITING OPCE
*                                      OY14092                       */
         ST    RPARM,OCELEM(,ROPCE)                             04S0558
*                         RZERO->OCLINK=RPARM->OCLINK;/* DELINK OPCE
*                                      OY14092                       */
         L     @11,OCLINK(,RPARM)                               04S0559
         LR    @09,RZERO                                        04S0559
         ST    @11,OCLINK(,@09)                                 04S0559
*                         RPARM->OCLINK=RPARM->OCLINK&&RPARM->OCLINK;
         LR    @09,@11                                          04S0560
         XR    @09,@11                                          04S0560
         ST    @09,OCLINK(,RPARM)                               04S0560
*                                   /* CLEAROY14092                  */
*                         OCATTACH=ON;/* INDICATE OPCE IS ATTACHED
*                                      OY14092                       */
         OI    OCATTACH(ROPCE),B'00000010'                      04S0561
*                       END;        /* OY14092                       */
*                     ELSE          /* STOPLINE,C OY14092            */
*                       DO;         /* YES OY14092                   */
         B     @RC00556                                         04S0563
@RF00556 DS    0H                                               04S0564
*                         OCWTGB=OCWTG;/* SETUP BACKUP WHERE-TO-GO   */
         MVC   OCWTGB(2,ROPCE),OCWTG(ROPCE)                     04S0564
*                         OCRENTRD=ON;/* SETUP RE-ENTERED FLAG       */
         OI    OCRENTRD(ROPCE),B'10000000'                      04S0565
*                         OCWTG=MODV8;/* SETUP TO RETURN TO THIS
*                                      MODULE                        */
         MVC   OCWTG(2,ROPCE),MODV8                             04S0566
*                         RZERO=ZERO;/* SETUP INTERFACE TO NEXT MOD  */
         SLR   RZERO,RZERO                                      04S0567
*                         OPCMODID=MOD00;/* SETUP FOR XCTL TO NEXT
*                                      MODULE                        */
         MVC   OPCMODID(2,ROPCAVT),MOD00                        04S0568
*                         EXITFLG=ON;/* SETUP TO EXIT                */
         OI    EXITFLG(ROPCAVT),B'00010000'                     04S0569
*                                                               05S0570
*                         /*******************************************/
*                         /*                                         */
*                         /* PROCESS.STPLPROC.WLATTACH: THIS SEGMENT */
*                         /* ATTACHES THE INPUT OPCE TO AN OPCE ON   */
*                         /* THE WAITV CHAIN WITH THE SAME GROUPNAME */
*                         /*                                         */
*                         /*******************************************/
*                                                               05S0570
*                         DO WHILE(RPARM->OCATTACH=ON);/* SEARCH FOR
*                                      LAST OPCE ATTACHED            */
         B     @DE00570                                         05S0570
@DL00570 DS    0H                                               05S0571
*                           RPARM=RPARM->OCELMPTR;/* GOTO NEXT OPCE  */
         SLR   @11,@11                                          05S0571
         ICM   @11,7,OCELMPTR(RPARM)                            05S0571
         LR    RPARM,@11                                        05S0571
*                         END;                                  05S0572
@DE00570 TM    OCATTACH(RPARM),B'00000010'                      05S0572
         BO    @DL00570                                         05S0572
*                         RPARM->OCELMPTR=ROPCE;/* ATTACH INPUT OPCE
*                                      TO WAIT CHAIN                 */
         STCM  ROPCE,7,OCELMPTR(RPARM)                          05S0573
*                         RPARM->OCATTACH=ON;/* INDICATE OPCE IS
*                                      ATTACHED                      */
         OI    OCATTACH(RPARM),B'00000010'                      05S0574
*                       END;                                    04S0575
*                   END;            /* OY14092                       */
*               END;                /* OY14092                       */
*           END;                                                04S0578
*       END;                                                    03S0579
*     ELSE                                                      03S0580
*       DO;                                                     03S0580
         B     @RC00515                                         03S0580
@RF00515 DS    0H                                               03S0581
*         RPARM=OCTRMTBL;           /* GET TTCIN OF FIRST LINE       */
         SLR   RPARM,RPARM                                      03S0581
         ICM   RPARM,3,OCTRMTBL(ROPCE)                          03S0581
*         CALL IEDQTNT;             /* FIND LINE TTE                 */
         L     @15,AVTRNMPT(,RAVT)                              03S0582
         BALR  @14,@15                                          03S0582
*         RTRM=RPARM;               /* SETUP TERM BASE               */
         LR    RTRM,RPARM                                       03S0583
*       END;                                                    03S0584
*     IF TRMSTOTE=ON&OCTOTE=OFF THEN                            03S0585
@RC00515 LR    @11,RTRM                                         03S0585
         AL    @11,@CF02313                                     03S0585
         TM    TRMSTOTE-3(@11),B'00000001'                      03S0585
         BNO   @RF00585                                         03S0585
         TM    OCTOTE(ROPCE),B'01000000'                        03S0585
         BNZ   @RF00585                                         03S0585
*       DO;                         /* TOTE IN CONTROL       @YM08560*/
*         OPCWRKSP(1)=MSG49;        /* SET UP FOR MSG 49     @YM08560*/
         MVC   OPCWRKSP(4,ROPCAVT),@CF02222                     03S0587
*         OPCWRKSP(2)=FOUR;         /* SET                   @YM08560*/
         MVC   OPCWRKSP+4(4,ROPCAVT),@CF00256                   03S0588
*         EXITFLG=ON;               /* SET UP TO EXIT        @YM08560*/
         OI    EXITFLG(ROPCAVT),B'00010000'                     03S0589
*         CALL IPERROR;             /* DO ERROR PROCESSINF   @YM08560*/
         BAL   @14,IPERROR                                      03S0590
*       END;                                                    03S0591
*     IF EXITFLG=OFF THEN                                       03S0592
@RF00585 TM    EXITFLG(ROPCAVT),B'00010000'                     03S0592
         BNZ   @RF00592                                         03S0592
*       DO;                         /* IF NOT DONE PROCESSING CHECK
*                                      FOR SNA REQUEST               */
*                                                               04S0594
*         /***********************************************************/
*         /*                                                         */
*         /* PROCESS.STPLPROC.SNACHK: CHECK FOR SNA LINE PROCESSING  */
*         /*                                                         */
*         /***********************************************************/
*                                                               04S0594
*         IF TRMTYPE=TRMSDLC THEN                               04S0594
         LR    @11,RTRM                                         04S0594
         AL    @11,@CF01505                                     04S0594
         CLI   TRMTYPE-11(@11),X'21'                            04S0594
         BNE   @RF00594                                         04S0594
*           DO;                     /* IF ITS A SNA LINE SETUP TO
*                                      EXIT                          */
*             OCIPLWA=ZERO;         /* CLEAR OUT FOR ACT/DEACT       */
         SLR   @11,@11                                          04S0596
         ST    @11,OCIPLWA(,ROPCE)                              04S0596
*             OCPTRSAV=ZERO;        /* CLEAR OUT FOR ACT/DEACT       */
         ST    @11,OCPTRSAV(,ROPCE)                             04S0597
*             OCWTGB=OCWTG;         /* SETUP BACKUP WHERE-TO-GO      */
         MVC   OCWTGB(2,ROPCE),OCWTG(ROPCE)                     04S0598
*             OCWTG=MODV8;          /* SETUP TO RETURN TO THIS MODULE*/
         MVC   OCWTG(2,ROPCE),MODV8                             04S0599
*             OPCMODID=MODFC;       /* SETUP TO PROCESS SNA LINE     */
         MVC   OPCMODID(2,ROPCAVT),MODFC                        04S0600
*             IEDQOPCN(1:8)=IEDQOPCN(1:8)&&IEDQOPCN(1:8);/* CLEAR
*                                      NEGATIVE PREFIX               */
         LR    @11,ROPCE                                        04S0601
         AL    @11,@CF02320                                     04S0601
         XC    IEDQOPCN(8,@11),IEDQOPCN(@11)                    04S0601
*             EXITFLG=ON;           /* SETUP TO EXIT                 */
         OI    EXITFLG(ROPCAVT),B'00010000'                     04S0602
*           END;                                                04S0603
*         IF EXITFLG=OFF THEN                                   03S0604
@RF00594 TM    EXITFLG(ROPCAVT),B'00010000'                     03S0604
         BNZ   @RF00604                                         03S0604
*           DO;                     /* IF NOT DONE PROCESSING THEN
*                                      VERIFY NCP STATUS             */
*                                                               04S0606
*             /*******************************************************/
*             /*                                                     */
*             /* PROCESS.STPLPROC.NCPCHK: THIS SEGMENT CHECKS FOR    */
*             /* STATUS OF NCP                                       */
*             /*                                                     */
*             /*******************************************************/
*                                                               04S0606
*             IF TRMCOHRT^=ZERO THEN                            04S0606
         LR    @11,RTRM                                         04S0606
         AL    @11,@CF02321                                     04S0606
         ICM   @09,3,TRMCOHRT-4(@11)                            04S0606
         BZ    @RF00606                                         04S0606
*               DO;                 /* IF MORE TTES EXIST, CONTINUE
*                                      PROCESSING                    */
*                 RPARM=RTRM;       /* SETUP TTE ADDRESS             */
         LR    RPARM,RTRM                                       04S0608
*                 RFY                                           04S0609
*                   RSAVE RSTD;                                 04S0609
*                 RSAVE=ADDR(OPCSAVE);/* SETUP A SAVEAREA            */
         LA    RSAVE,OPCSAVE(,ROPCAVT)                          04S0610
*                 CALL COHORTLK;    /* FIND NEXT HIGHER RESOURCE     */
         L     @15,OPCHORT(,ROPCAVT)                            04S0611
         BALR  @14,@15                                          04S0611
*                 RFY                                           04S0612
*                   RSAVE UNRSTD;                               04S0612
*                 RPARM=RPARM-LENGTH(IEDNTRM);/* POINT TO NEGATIVE
*                                      PREFIX                        */
         LA    @11,14                                           04S0613
         SLR   RPARM,@11                                        04S0613
*                 RFY                                           04S0614
*                   REG09 RSTD;                                 04S0614
*                 REG09=RPARM;      /* SAVE NCP TTE FOR SETUP OF NSL
*                                      BUFER                         */
         LR    REG09,RPARM                                      04S0615
*                 IF OCACTREQ=OFF&RPARM->TRMINPG=ON THEN        04S0616
         TM    OCACTREQ(ROPCE),B'00001000'                      04S0616
         BNZ   @RF00616                                         04S0616
         TM    TRMINPG(RPARM),B'00100000'                       04S0616
         BNO   @RF00616                                         04S0616
*                   DO;             /* IF THIS NOT AN ACT/DEACT RQST
*                                      AND TERM IS IN PROGRESS       */
*                     OPCWRKSP(7)=RPARM;/* SAVE THE NCP ADDR         */
         ST    RPARM,OPCWRKSP+24(,ROPCAVT)                      04S0618
*                     OCBACKUP=''B; /* CLEAR TO INSERT THE UCB  04S0619
*                                      ADDRESS                       */
         XC    OCBACKUP(8,ROPCE),OCBACKUP(ROPCE)                04S0619
*                     RFY                                       04S0620
*                       IHADCB BASED(RPARM);/* BASE FOR DCB  @XM05704*/
*                     RPARM=RPARM+LENGTH(IEDNTRM);/* BACK TO TTE
*                                                            @XM05704*/
         ALR   RPARM,@11                                        04S0621
*                     RPARM=RPARM->TRMDESTQ->QCBDCBAD;/* GET DEB ADDR*/
         ICM   @11,7,TRMDESTQ(RPARM)                            04S0622
         SLR   @07,@07                                          04S0622
         ICM   @07,7,QCBDCBAD(@11)                              04S0622
         LR    RPARM,@07                                        04S0622
*                     RPARM=DCBDEBAD;/* GET DEB ADDR         @XM05704*/
         L     @11,DCBDEBAD+40(,RPARM)                          04S0623
         LR    RPARM,@11                                        04S0623
*                     RFY                                       04S0624
*                       IHADCB BASED;/*                      @XM05704*/
*                     RFY                                       04S0625
*                       IEDQDEB BASED(RPARM);                   04S0625
*                     RPARM=RPARM-(ADDR(DEBNMSUB)-ADDR(IEDQDEB));
         SH    RPARM,@CH00776                                   04S0626
*                     OCBACKUP(1:3)=DEBUCBAD->UCBNAME;/* INSERT THE
*                                      UCB ADDRESS                   */
         ICM   @11,7,DEBUCBAD(RPARM)                            04S0627
         MVC   OCBACKUP(3,ROPCE),UCBNAME(@11)                   04S0627
*                     RPARM=OPCWRKSP(7);/* RESTORE NCP ADDR          */
         L     @11,OPCWRKSP+24(,ROPCAVT)                        04S0628
         LR    RPARM,@11                                        04S0628
*                     OPCWRKSP(1)=MSG210;/* SETUP ERR MSG NUMBER     */
         MVC   OPCWRKSP(4,ROPCAVT),@CF02226                     04S0629
*                     OPCWRKSP(2)=FOUR;/* SETUP RETURN CODE          */
         MVC   OPCWRKSP+4(4,ROPCAVT),@CF00256                   04S0630
*                     EXITFLG=ON;   /* PREPARE TO EXIT               */
         OI    EXITFLG(ROPCAVT),B'00010000'                     04S0631
*                     CALL IPERROR; /* PROCESS ERROR                 */
         BAL   @14,IPERROR                                      04S0632
*                   END;                                        04S0633
*               END;                                            04S0634
*             ELSE                                              04S0635
*               DO;                                             04S0635
         B     @RC00606                                         04S0635
@RF00606 DS    0H                                               04S0636
*                 OPCWRKSP(1)=MSG400;/* SETUP MSG NUMBER             */
         MVC   OPCWRKSP(4,ROPCAVT),@CF02228                     04S0636
*                 OPCWRKSP(2)=FOUR; /* SETUP ERROR MSG CODE          */
         MVC   OPCWRKSP+4(4,ROPCAVT),@CF00256                   04S0637
*                 EXITFLG=ON;       /* PREPARE TO EXIT               */
         OI    EXITFLG(ROPCAVT),B'00010000'                     04S0638
*                 CALL IPERROR;     /* PROCESS ERRORS                */
         BAL   @14,IPERROR                                      04S0639
*               END;                                            04S0640
*             IF EXITFLG=OFF THEN                               03S0641
@RC00606 TM    EXITFLG(ROPCAVT),B'00010000'                     03S0641
         BNZ   @RF00641                                         03S0641
*               DO;                 /* IF NOT DONE PROCESSING, VERIFY
*                                      LINE STATUS                   */
*                                                               04S0643
*                 /***************************************************/
*                 /*                                                 */
*                 /* PROCESS.STPLPROC.LNCHK: THIS SEGMENT CHECKS     */
*                 /* STATUS OF LINE                                  */
*                 /*                                                 */
*                 /***************************************************/
*                                                               04S0643
*                 IF TRMRSACT=OFF THEN                          04S0643
         LR    @11,RTRM                                         04S0643
         SH    @11,@CH01234                                     04S0643
         TM    TRMRSACT(@11),B'10000000'                        04S0643
         BNZ   @RF00643                                         04S0643
*                   DO;             /* IF LINE IS NOT ACTIVE         */
*                     IF OCTOTE=ON THEN                         04S0645
         TM    OCTOTE(ROPCE),B'01000000'                        04S0645
         BNO   @RF00645                                         04S0645
*                       TRMSTOTE=ON;/* CHECK FOR TOTE REQUEST        */
         OI    TRMSTOTE(@11),B'00000001'                        04S0646
*                     OPCWRKSP(1)=MSG25;/* SETUP MSG NUMBER          */
@RF00645 MVC   OPCWRKSP(4,ROPCAVT),@CF02218                     04S0647
*                     OPCWRKSP(2)=EIGHT;/* SETUP ERROR MSG CODE      */
         MVC   OPCWRKSP+4(4,ROPCAVT),@CF00045                   04S0648
*                     EXITFLG=ON;   /* INDICATE EXIT                 */
         OI    EXITFLG(ROPCAVT),B'00010000'                     04S0649
*                     CALL IPERROR; /* PROCESS ERRORS                */
         BAL   @14,IPERROR                                      04S0650
*                   END;                                        04S0651
*                 IF EXITFLG=OFF THEN                           03S0652
@RF00643 TM    EXITFLG(ROPCAVT),B'00010000'                     03S0652
         BNZ   @RF00652                                         03S0652
*                   DO;             /* IF NOT DONE PROCESSING PREPARE
*                                      TO BUILD STOPLINE REQUEST     */
*                     OCWTGB=OCWTG; /* SETUP BACKUP FIELD TO    03S0654
*                                      WHERE-TO-GO                   */
         MVC   OCWTGB(2,ROPCE),OCWTG(ROPCE)                     03S0654
*                     RPARM=ONE;    /* GET ONE BUFFER UNIT           */
         LA    RPARM,1                                          03S0655
*                     RFY                                       03S0656
*                       RSAVE RSTD;                             03S0656
*                     RSAVE=ADDR(OPCSAVE);/* SETUP ADDRESS OF   03S0657
*                                      SAVEAREA                      */
         LA    RSAVE,OPCSAVE(,ROPCAVT)                          03S0657
*                     CALL ALLOCBUF;/* GET A BUFFER UNIT, THEN BUILD
*                                      STOPLINE REQUEST              */
         L     @15,OPCGETBF(,ROPCAVT)                           03S0658
         BALR  @14,@15                                          03S0658
*                     RFY                                       03S0659
*                       RSAVE UNRSTD;                           03S0659
*                                                               04S0660
*                     /***********************************************/
*                     /*                                             */
*                     /* PROCESS.STPLPROC.BLDACT: BUILD A STOPLINE   */
*                     /* REQUEST                                     */
*                     /*                                             */
*                     /***********************************************/
*                                                               04S0660
*                     IEDNSLD(1:LENGTH(IEDNSLD))=''B;/* CLEAR BUFFER */
         XC    IEDNSLD(48,RPARM),IEDNSLD(RPARM)                 04S0660
*/* SETUP NSL BUFFER                                                 */
*                                                               04S0661
*                     IF OCACTREQ=ON THEN                       04S0661
         TM    OCACTREQ(ROPCE),B'00001000'                      04S0661
         BNO   @RF00661                                         04S0661
*                       DO;         /* IF THIS IS RQST FROM     04S0662
*                                      ACT/DEACT, CHECK FOR TYPE OF
*                                      RQST                          */
*                         IF OCFLUSHZ=ON THEN                   04S0663
         LR    @11,ROPCE                                        04S0663
         AL    @11,@CF02322                                     04S0663
         TM    OCFLUSHZ-2(@11),B'10000000'                      04S0663
         BNO   @RF00663                                         04S0663
*                           NSLREQTY=NSLCLOSN;/* IF THIS IS FLUSH
*                                      CLOSEDOWN, INDICATE FLUSH TO
*                                      NSL                           */
         MVI   NSLREQTY(RPARM),X'0B'                            04S0664
*                         ELSE                                  04S0665
*                           IF REG09->TRMNCPCL=ON THEN          04S0665
         B     @RC00663                                         04S0665
@RF00663 TM    TRMNCPCL(REG09),B'01000000'                      04S0665
         BNO   @RF00665                                         04S0665
*                             NSLREQTY=NSLSTOPL;/* IF CLOSEDOWN IN
*                                      PROGRESS, PROCESS STOPLINE,C  */
         MVI   NSLREQTY(RPARM),X'02'                            04S0666
*                           ELSE                                04S0667
*                             NSLREQTY=NSLSTPLI;/* ELSE IT'S 'F 04S0667
*                                      DEACT' RQST                   */
         B     @RC00665                                         04S0667
@RF00665 MVI   NSLREQTY(RPARM),X'09'                            04S0667
*                         RFY                                   04S0668
*                           REG09 UNRSTD;                       04S0668
@RC00665 DS    0H                                               04S0668
@RC00663 DS    0H                                               04S0669
*                       END;                                    04S0669
*                     ELSE                                      04S0670
*                       DO;                                     04S0670
         B     @RC00661                                         04S0670
@RF00661 DS    0H                                               04S0671
*                         IF OCSWITCH=OCSTPLNI THEN             04S0671
         CLI   OCSWITCH(ROPCE),X'12'                            04S0671
         BNE   @RF00671                                         04S0671
*                           NSLREQTY=NSLSTPLI;/* IF THIS IS A   04S0672
*                                      STOPLINE,I CMD, INDICATE FOR
*                                      NSL                           */
         MVI   NSLREQTY(RPARM),X'09'                            04S0672
*                         ELSE                                  04S0673
*                           NSLREQTY=NSLSTOPL;/* ELSE THIS IS A 04S0673
*                                      STOPLINE,C CMD                */
         B     @RC00671                                         04S0673
@RF00671 MVI   NSLREQTY(RPARM),X'02'                            04S0673
*                       END;                                    04S0674
@RC00671 DS    0H                                               04S0675
*                     NSLFLGBK=OPRVE;/* SETUP MOD NAME               */
@RC00661 MVI   NSLFLGBK(RPARM),X'05'                            04S0675
*                     NSLPRIBK=PRIMEDFG;/* SETUP PRIORITY            */
         MVI   NSLPRIBK(RPARM),X'DF'                            04S0676
*                     NSLGRPNM=OCBACKUP;/* SETUP GROUP NAME          */
         MVC   NSLGRPNM(8,RPARM),OCBACKUP(ROPCE)                04S0677
*                     NSLTTEPT=RTRM;/* SETUP LINE TTE ADDRESS        */
         ST    RTRM,NSLTTEPT(,RPARM)                            04S0678
*/* SETUP OPRE FIELDS                                                */
*                                                               04S0679
*                     OPREPRI=PRIOPCTL;/* SETUP POST PRIORITY        */
         MVI   OPREPRI(RPARM),X'DC'                             04S0679
*                     OPREQCB=SAVTSPLN;/* SETUP STOPLINE QCB ADDR    */
         L     @11,AVTSAVTP(,RAVT)                              04S0680
         MVC   OPREQCB(3,RPARM),SAVTSPLN+1(@11)                 04S0680
*/* SETUP SVC 102 PAREMETER LIST AND ISSUE SVC 102                   */
*                                                               04S0681
*                     OPCAQWD1=RPARM;/* SETUP BUFF ADDR              */
         ST    RPARM,OPCAQWD1(,ROPCAVT)                         04S0681
*                     OPCAQWD2=RPARM;/* SETUP BUFF ADDR              */
         ST    RPARM,OPCAQWD2(,ROPCAVT)                         04S0682
*                     OPCAQREQ=OPRQST;/* TPOST REQUEST               */
         MVC   OPCAQREQ(1,ROPCAVT),OPRQST                       04S0683
*                     OPCAQRQ2=OPEND;/* END OF LIST                  */
         MVC   OPCAQRQ2(1,ROPCAVT),OPEND                        04S0684
*                     RPARM=ADDR(OPCAQCTL);/* SETUP ADDRESS OF PLIST */
         LA    RPARM,OPCAQCTL(,ROPCAVT)                         04S0685
*                     GEN(SVC 102); /* POST ELEM TO IEDNSL           */
         SVC 102
*/* SETUP TO EXIT TO NEXT MODULE                                     */
*                                                               04S0687
*                     OCWTG=MODVE;  /* SETUP WHERE-TO-GO FIELD       */
         MVC   OCWTG(2,ROPCE),MODVE                             04S0687
*                     OCDACTIP=OFF; /* TURN DEACT-IN-PROG FLAG OFF
*                                                            @OY19465*/
         NI    OCDACTIP(ROPCE),B'10111111'                      04S0688
*                     OCLINK=OPCWAITV;/* GET FIRST OPCE              */
         MVC   OCLINK(4,ROPCE),OPCWAITV(ROPCAVT)                04S0689
*                     OPCWAITV=ROPCE;/* LINK THIS OPCE TO THE   04S0690
*                                      BEGINNING OF THE OPCWAITV
*                                      CHAIN                         */
         ST    ROPCE,OPCWAITV(,ROPCAVT)                         04S0690
*                     RZERO=ZERO;   /* SETUP INTERFACE TO NEXT MOD   */
         SLR   RZERO,RZERO                                      04S0691
*                     OPCMODID=MOD00;/* SETUP TO XCTL TO NEXT MODULE */
         MVC   OPCMODID(2,ROPCAVT),MOD00                        04S0692
*                   END;                                        03S0693
*               END;                                            03S0694
@RF00652 DS    0H                                               03S0695
*           END;                                                03S0695
@RF00641 DS    0H                                               03S0696
*       END;                                                    03S0696
@RF00604 DS    0H                                               03S0697
*   END;                                                        02S0697
@RF00592 DS    0H                                               02S0697
@DE00513 TM    FIRSTREQ(ROPCAVT),B'11000000'                    02S0697
         BNZ   @DL00513                                         02S0697
*                                                               02S0698
*   /*****************************************************************/
*   /*                                                               */
*   /* EPILOGUE: THIS SEGMENT COMPLETES THE EPILOGUE CODE THAT WAS   */
*   /* ALTERED BY THE MODULE PROCEDURE STATEMENT.                    */
*   /*                                                               */
*   /*****************************************************************/
*                                                               02S0698
*   OPCFLAG1=ZERO;                  /* CLEAR FLAG FIELDS             */
         MVI   OPCFLAG1(ROPCAVT),X'00'                          02S0698
*   RPARM=ROPCAVT;                  /* SET THE ARGUMENT REGISTER IN
*                                      PREPARATION TO TRANSFERRING
*                                      CONTROL TO THE NEXT MODULE    */
         LR    RPARM,ROPCAVT                                    02S0699
*   GEN EXIT REFS(OPCXCTL,ROPCAVT) NOSEQFLOW SETS(REG15);       02S0700
*                                   /*
         XCTL  SF=(E,OPCXCTL(ROPCAVT)) TRANSFER CONTROL MACRO
*                                                               02S0701
*   /*****************************************************************/
*   /*                                                               */
*   /* IPERROR: THIS SEGMENT PERFORMS FINAL ERROR PROCESSING         */
*   /*                                                               */
*   /*****************************************************************/
*                                                               02S0701
*IPERROR:                                                       02S0701
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                            02S0701
@EL00001 DS    0H                                               02S0701
@EF00001 DS    0H                                               02S0701
@ER00001 BR    @14                                              02S0701
IPERROR  DS    0H                                               02S0702
*   OPCWRKSP(3)=REG14;              /* SAVE RETURN ADDRESS           */
         ST    REG14,OPCWRKSP+8(,ROPCAVT)                       02S0702
*                                                               03S0703
*   /*****************************************************************/
*   /*                                                               */
*   /* PROCESS.IPERROR.UPDSTATE: THIS SEGMENT UPDATES STATUS FOR ALL */
*   /* ERROR PROCESSING                                              */
*   /*                                                               */
*   /*****************************************************************/
*                                                               03S0703
*   IF OCALLFLG=ON THEN                                         03S0703
         TM    OCALLFLG(ROPCE),B'00000100'                      03S0703
         BNO   @RF00703                                         03S0703
*     DO;                           /* CHECK FOR STOPLINE,ALL REQUEST*/
*       IF OCSOME=OFF THEN                                      03S0705
         TM    OCSOME(ROPCE),B'00000010'                        03S0705
         BNZ   @RF00705                                         03S0705
*         DO;                       /* IF STATUS IS UNSET OR NO LINES
*                                      STOPPED                       */
*           OCNONE=ON;              /* INDICATE NO LINES STOPPED     */
         OI    OCNONE(ROPCE),B'00000001'                        03S0707
*           OPCWRKSP(1)=MSG544;     /* SETUP MSG NUMBER              */
         MVC   OPCWRKSP(4,ROPCAVT),@CF02240                     03S0708
*         END;                                                  03S0709
*       ELSE                                                    03S0710
*         DO;                                                   03S0710
         B     @RC00705                                         03S0710
@RF00705 DS    0H                                               03S0711
*           OCNONE=OFF;             /* INDICATE SOME LINES STOPPED   */
         NI    OCNONE(ROPCE),B'11111110'                        03S0711
*           OPCWRKSP(1)=MSG545;     /* SETUP MSG NUMBER              */
         MVC   OPCWRKSP(4,ROPCAVT),@CF02242                     03S0712
*         END;                                                  03S0713
*       CALL IPMLNCHK;              /* CHECK FOR MORE LINES          */
@RC00705 BAL   @14,IPMLNCHK                                     03S0714
*     END;                                                      03S0715
*   IF MORLINES=OFF THEN                                        02S0716
@RF00703 TM    MORLINES(ROPCAVT),B'01000000'                    02S0716
         BNZ   @RF00716                                         02S0716
*     DO;                           /* IF NO MORE LINES TO PROCESS,
*                                      EXIT                          */
*       IF OCWTG=ZERO THEN                                      02S0718
         ICM   @11,3,OCWTG(ROPCE)                               02S0718
         BNZ   @RF00718                                         02S0718
*         DO;                       /* IF THIS IS AN EXTERNAL CALLER,
*                                      SETUP FOR EXIT                */
*           RZERO=OPCWRKSP(1);      /* SETUP MSG NUMBER              */
         L     RZERO,OPCWRKSP(,ROPCAVT)                         02S0720
*           RPARM=OPCWRKSP(2);      /* SETUP MSG CODE                */
         L     RPARM,OPCWRKSP+4(,ROPCAVT)                       02S0721
*           OPCMODID=MOD03;         /* SETUP NEXT MODULE TO GET 02S0722
*                                      CONTROL                       */
         MVC   OPCMODID(2,ROPCAVT),MOD03                        02S0722
*           IF OCSOME=ON THEN                                   02S0723
         TM    OCSOME(ROPCE),B'00000010'                        02S0723
         BNO   @RF00723                                         02S0723
*             DO;                   /* IF SOME LINES HAVE BEEN  02S0724
*                                      STOPPED SUCCESSFULLY THEN
*                                      CHKPT THEM                    */
*               OCPARM=RZERO;       /* SAVE MSG NUMBER       @YM06145*/
         STH   RZERO,OCPARM(,ROPCE)                             02S0725
*               OCWTG=MOD03;        /* SETUP WHERE-TO-GO             */
         MVC   OCWTG(2,ROPCE),MOD03                             02S0726
*               OPCMODID=MOD06;     /* SETUP EXIT TO CHKPOINT        */
         MVC   OPCMODID(2,ROPCAVT),MOD06                        02S0727
*             END;                                              02S0728
*           CALL IPEXTERN;          /* PERFORM NON-INTERNAL     02S0729
*                                      INVOCATION PROCESSING         */
@RF00723 BAL   @14,IPEXTERN                                     02S0729
*         END;                                                  02S0730
*       ELSE                                                    02S0731
*         CALL IPINTERN;            /* PERFORM INTERNAL INVOCATION
*                                      PROCESSING                    */
         B     @RC00718                                         02S0731
@RF00718 BAL   @14,IPINTERN                                     02S0731
*     END;                                                      02S0732
@RC00718 DS    0H                                               02S0733
*   REG14=OPCWRKSP(3);              /* RESTORE RETURN ADDRESS        */
@RF00716 L     REG14,OPCWRKSP+8(,ROPCAVT)                       02S0733
*   END;                                                        02S0734
@EL00002 DS    0H                                               02S0734
@EF00002 DS    0H                                               02S0734
@ER00002 BR    @14                                              02S0734
*                                                               02S0735
*   /*****************************************************************/
*   /*                                                               */
*   /* IPEXTERN: THIS INTERNAL PROCEDURE PROCESSES ALL EXTERNAL      */
*   /* INVOCATIONS TO STOPLINE                                       */
*   /*                                                               */
*   /*****************************************************************/
*                                                               02S0735
*IPEXTERN:                                                      02S0735
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                            02S0735
IPEXTERN DS    0H                                               02S0736
*   IF OCTOTE=ON THEN                                           02S0736
         TM    OCTOTE(ROPCE),B'01000000'                        02S0736
         BNO   @RF00736                                         02S0736
*     DO;                           /* IF THIS IS TOTE INPUT         */
*       OCWTG=MOD07;                /* SETUP WHERE-TO-GO-FIELD       */
         MVC   OCWTG(2,ROPCE),MOD07                             02S0738
*       OCPARM=RPARM;               /* SETUP INTERFACE TO NEXT MODULE*/
         STH   RPARM,OCPARM(,ROPCE)                             02S0739
*       RZERO=RPARM;                                            02S0740
         LR    RZERO,RPARM                                      02S0740
*       IF OPCMODID=MOD03 THEN                                  02S0741
         CLC   OPCMODID(2,ROPCAVT),MOD03                        02S0741
         BNE   @RF00741                                         02S0741
*         DO;                       /* IF NEXT MOD IS MSG MOD        */
*           OPCMODID=MOD07;         /* RESET NEXT MOD ID             */
         MVC   OPCMODID(2,ROPCAVT),MOD07                        02S0743
*           OCWTG=ZERO;             /* INITIALIZE WHERE-TO-GO FIELD  */
         SLR   @11,@11                                          02S0744
         STH   @11,OCWTG(,ROPCE)                                02S0744
*         END;                                                  02S0745
*     END;                                                      02S0746
*   END;                                                        02S0747
@EL00003 DS    0H                                               02S0747
@EF00003 DS    0H                                               02S0747
@ER00003 BR    @14                                              02S0747
*                                                               02S0748
*   /*****************************************************************/
*   /*                                                               */
*   /* IPEXIT: THIS INTERNAL PROCEDURE PERFORMS ALL NORMAL EXIT      */
*   /* PROCESSING                                                    */
*   /*                                                               */
*   /*****************************************************************/
*                                                               02S0748
*IPEXIT:                                                        02S0748
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                            02S0748
IPEXIT   DS    0H                                               02S0749
*   OPCWRKSP(5)=REG14;              /* SAVE RETURN ADDRESS           */
         ST    REG14,OPCWRKSP+16(,ROPCAVT)                      02S0749
*                                                               03S0750
*   /*****************************************************************/
*   /*                                                               */
*   /* PROCESS.IPEXIT.UPDSTATN: THIS SEGMENT UPDATES ALL STATUS FOR  */
*   /* NORMAL PROCESSING                                             */
*   /*                                                               */
*   /*****************************************************************/
*                                                               03S0750
*   IF OCALLFLG=ON THEN                                         03S0750
         TM    OCALLFLG(ROPCE),B'00000100'                      03S0750
         BNO   @RF00750                                         03S0750
*     DO;                           /* CHECK FOR A STOPLINE,ALL 03S0751
*                                      REQUEST                       */
*       IF(OCSOME=OFF&OCNONE=OFF)×(OCSOME=ON&OCNONE=ON) THEN    03S0752
         TM    OCSOME(ROPCE),B'00000011'                        03S0752
         BZ    @RT00752                                         03S0752
         TM    OCSOME(ROPCE),B'00000011'                        03S0752
         BNO   @RF00752                                         03S0752
@RT00752 DS    0H                                               03S0753
*         DO;                       /* IF ALL LINES HAVE BEEN STOPPED
*                                      OR STATUS IS UNSET            */
*           OCSOME=ON;              /* INDICATE ALL LINES HAVE       */
*           OCNONE=ON;              /* BEEN STOPPED                  */
         OI    OCSOME(ROPCE),B'00000011'                        03S0755
*           OPCWRKSP(1)=MSG543;     /* SETUP MSG NUMBER              */
         MVC   OPCWRKSP(4,ROPCAVT),@CF02238                     03S0756
*         END;                                                  03S0757
*       ELSE                                                    03S0758
*         DO;                                                   03S0758
         B     @RC00752                                         03S0758
@RF00752 DS    0H                                               03S0759
*           OCSOME=ON;              /* INDICATE SOME LINES HAVE      */
*           OCNONE=OFF;             /* BEEN STOPPED                  */
         OI    OCSOME(ROPCE),B'00000010'                        03S0760
         NI    OCNONE(ROPCE),B'11111110'                        03S0760
*           OPCWRKSP(1)=MSG545;     /* SETUP MSG NUMBER              */
         MVC   OPCWRKSP(4,ROPCAVT),@CF02242                     03S0761
*         END;                                                  03S0762
*       CALL IPMLNCHK;              /* CHECK FOR MORE LINES          */
@RC00752 BAL   @14,IPMLNCHK                                     03S0763
*     END;                                                      03S0764
*   IF MORLINES=OFF THEN                                        02S0765
@RF00750 TM    MORLINES(ROPCAVT),B'01000000'                    02S0765
         BNZ   @RF00765                                         02S0765
*     DO;                           /* IF NO MORE LINES TO PROCESS
*                                      THEN                          */
*       IF OCWTG=ZERO THEN                                      02S0767
         ICM   @11,3,OCWTG(ROPCE)                               02S0767
         BNZ   @RF00767                                         02S0767
*         DO;                       /* IF THIS IS AN EXTERNAL CALL
*                                      THEN PROCESS CALL             */
*           RZERO=OPCWRKSP(1);      /* SETUP INTERFACE TO NEXT MOD   */
         L     RZERO,OPCWRKSP(,ROPCAVT)                         02S0769
*           RPARM=OPCWRKSP(2);                                  02S0770
         L     RPARM,OPCWRKSP+4(,ROPCAVT)                       02S0770
*           OCPARM=RZERO;                                       02S0771
         STH   RZERO,OCPARM(,ROPCE)                             02S0771
*           OPCMODID=MOD06;         /* SETUP NEXT MOD ID             */
         MVC   OPCMODID(2,ROPCAVT),MOD06                        02S0772
*           OCWTG=MOD09;            /* SETUP WHERE-TO-GO FIELD       */
         MVC   OCWTG(2,ROPCE),MOD09                             02S0773
*           CALL IPEXTERN;          /* PROCESS EXTERNAL INVOCATION   */
         BAL   @14,IPEXTERN                                     02S0774
*         END;                                                  02S0775
*       ELSE                                                    02S0776
*         CALL IPINTERN;            /* ELSE PROCESS INTERNAL    02S0776
*                                      INVOCATION                    */
         B     @RC00767                                         02S0776
@RF00767 BAL   @14,IPINTERN                                     02S0776
*     END;                                                      02S0777
@RC00767 DS    0H                                               02S0778
*   REG14=OPCWRKSP(5);              /* RESTORE RETURN ADDRESS        */
@RF00765 L     REG14,OPCWRKSP+16(,ROPCAVT)                      02S0778
*   END;                                                        02S0779
@EL00004 DS    0H                                               02S0779
@EF00004 DS    0H                                               02S0779
@ER00004 BR    @14                                              02S0779
*                                                               02S0780
*   /*****************************************************************/
*   /*                                                               */
*   /* IPINTERN: THIS INTERNAL PROCEDURE PROCESSES INTERNAL          */
*   /* INVOCATIONS FOR STOPLINE                                      */
*   /*                                                               */
*   /*****************************************************************/
*                                                               02S0780
*IPINTERN:                                                      02S0780
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                            02S0780
IPINTERN DS    0H                                               02S0781
*   RFY                                                         02S0781
*     RSAVE RSTD;                                               02S0781
*   OPCWRKSP(4)=REG14;              /* SAVE RETURN REGISTER  @YM07370*/
         ST    REG14,OPCWRKSP+12(,ROPCAVT)                      02S0782
*   OCPARM=OPCWRKSP(1);             /* SETUP MSG NUMBER              */
         L     @11,OPCWRKSP(,ROPCAVT)                           02S0783
         STH   @11,OCPARM(,ROPCE)                               02S0783
*   RZERO=OPCWRKSP(1);              /* SETUP FOR NEXT MODULE         */
         LR    RZERO,@11                                        02S0784
*   OPCMODID=OCWTG;                 /* SETUP FOR NEXT MODULE         */
         MVC   OPCMODID(2,ROPCAVT),OCWTG(ROPCE)                 02S0785
*   OCWTG=ZERO;                     /* CLEAR WHERE-TO-GO FIELD       */
         SLR   @09,@09                                          02S0786
         STH   @09,OCWTG(,ROPCE)                                02S0786
*   IF OPCMODID=MODFG&OCPARM=MSG199 THEN                        02S0787
         CLC   OPCMODID(2,ROPCAVT),MODFG                        02S0787
         BNE   @RF00787                                         02S0787
         CH    @11,@CH02224                                     02S0787
         BNE   @RF00787                                         02S0787
*     DO;                           /* IF EXIT IS TO DEACT           */
*       RPARM=OCUNIT;               /* SETUP TO FREE UNIT            */
         L     RPARM,OCUNIT(,ROPCE)                             02S0789
*       RSAVE=ADDR(OPCSAVE);        /* SETUP ADDRESS OF SAVE AREA    */
         LA    RSAVE,OPCSAVE(,ROPCAVT)                          02S0790
*       CALL FREEBUFF;              /* FREE UNIT                     */
         L     @15,OPCFREBF(,ROPCAVT)                           02S0791
         BALR  @14,@15                                          02S0791
*       OCUNIT=INVALTIC;            /* SETUP INVALID TIC             */
         MVC   OCUNIT(4,ROPCE),@CF01775                         02S0792
*     END;                                                      02S0793
*   ELSE                                                        02S0794
*     IF OPCMODID=MOD07 THEN                                    02S0794
         B     @RC00787                                         02S0794
@RF00787 CLC   OPCMODID(2,ROPCAVT),MOD07                        02S0794
         BNE   @RF00794                                         02S0794
*       DO;                         /* IF WRITE MODULE IS NEXT MODULE
*                                      TO GET CONTROL                */
*         OCPARM=ZERO;              /* RESET MSG NUMBER              */
         SLR   @11,@11                                          02S0796
         STH   @11,OCPARM(,ROPCE)                               02S0796
*         RZERO=ZERO;               /* RESET MSG NUMBER              */
         SLR   RZERO,RZERO                                      02S0797
*       END;                                                    02S0798
*   REG14=OPCWRKSP(4);              /* RESTORE RETURN ADDRESS   02S0799
*                                                            @YM07370*/
@RF00794 DS    0H                                               02S0799
@RC00787 L     REG14,OPCWRKSP+12(,ROPCAVT)                      02S0799
*   END;                                                        02S0800
@EL00005 DS    0H                                               02S0800
@EF00005 DS    0H                                               02S0800
@ER00005 BR    @14                                              02S0800
*   RFY                                                         02S0801
*     RSAVE UNRSTD;                                             02S0801
*                                                               02S0802
*   /*****************************************************************/
*   /*                                                               */
*   /* IPMLNCHK: THIS INTERNAL PROCEDURE CHECKS FOR MORE LINES TO    */
*   /* PROCESS                                                       */
*   /*                                                               */
*   /*****************************************************************/
*                                                               02S0802
*IPMLNCHK:                                                      02S0802
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                            02S0802
IPMLNCHK DS    0H                                               02S0803
*   OPCWRKSP(4)=REG14;              /* SAVE RETURN ADDRESS           */
         ST    REG14,OPCWRKSP+12(,ROPCAVT)                      02S0803
*   RPARM=TRMCOHTG;                 /* GET TTCIN OF LINE             */
         LR    @11,RTRM                                         02S0804
         AL    @11,@CF02322                                     02S0804
         SLR   RPARM,RPARM                                      02S0804
         ICM   RPARM,3,TRMCOHTG-8(@11)                          02S0804
*   CALL IEDQTNT;                   /* GET LINE TTE                  */
         L     @15,AVTRNMPT(,RAVT)                              02S0805
         BALR  @14,@15                                          02S0805
*   RPARM=RPARM-LENGTH(IEDNTRM);    /* BACKUP TO NEGATIVE PREFIX     */
         SH    RPARM,@CH01234                                   02S0806
*   IF RPARM->TRMTYPE=TRMGRP THEN                               02S0807
         CLI   TRMTYPE(RPARM),X'00'                             02S0807
         BNE   @RF00807                                         02S0807
*     MORLINES=OFF;                 /* IF GROUP TTE, INDICATE NO MORE
*                                      LINES TO PROCESS              */
         NI    MORLINES(ROPCAVT),B'10111111'                    02S0808
*   ELSE                                                        02S0809
*     DO;                           /* IF IT'S A LINE TTE CONTINUE
*                                      PROCESSING                    */
         B     @RC00807                                         02S0809
@RF00807 DS    0H                                               02S0810
*       MORLINES=ON;                /* INDICATE MORLINES TO PROCESS  */
         OI    MORLINES(ROPCAVT),B'01000000'                    02S0810
*       OCTRMTBL=TRMCOHTG;          /* SETUP TTCIN OF NEW LINE TO
*                                      PROCESS                       */
         LR    @11,RTRM                                         02S0811
         AL    @11,@CF02322                                     02S0811
         MVC   OCTRMTBL(2,ROPCE),TRMCOHTG-8(@11)                02S0811
*     END;                                                      02S0812
*   REG14=OPCWRKSP(4);              /* RESTORE RETURN ADDRESS        */
@RC00807 L     REG14,OPCWRKSP+12(,ROPCAVT)                      02S0813
*   END;                                                        02S0814
@EL00006 DS    0H                                               02S0814
@EF00006 DS    0H                                               02S0814
@ER00006 BR    @14                                              02S0814
*                                                               02S0815
*   /*****************************************************************/
*   /*                                                               */
*   /* IPWLSRCH: THIS INTERNAL PROCEDURE SEARCHES THE OPCWAITV CHAIN */
*   /* FOR AN OPCE WITH THE SAME GROUPNAME AS THE INPUT OPCE         */
*   /*                                                               */
*   /*****************************************************************/
*                                                               02S0815
*IPWLSRCH:                                                      02S0815
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                            02S0815
IPWLSRCH DS    0H                                               02S0816
*   RZERO=ADDR(OPCWAITV);           /* SETUP ADDR OF OPCWAITV        */
         LA    RZERO,OPCWAITV(,ROPCAVT)                         02S0816
*   RPARM=OPCWAITV;                 /* GET FIRST ELEMENT ON THE CHAIN*/
         L     RPARM,OPCWAITV(,ROPCAVT)                         02S0817
*   RPARM=RPARM&MASKBYTE;           /* CLEAR HI BYTE         @YM06061*/
         N     RPARM,@CF02216                                   02S0818
*   WAITFLG=ON;                     /* INITIALIZE WAIT INDICATOR     */
         OI    WAITFLG(ROPCAVT),B'00100000'                     02S0819
*   DO WHILE(WAITFLG=ON);           /* SEARCH CHAIN FOR MATCHING
*                                      GROUPNAME                     */
         B     @DE00820                                         02S0820
@DL00820 DS    0H                                               02S0821
*     IF RPARM=ZERO THEN            /* IF THIS IS END OF CHAIN, SETUP
*                                      TO EXIT                       */
         LTR   RPARM,RPARM                                      02S0821
         BNZ   @RF00821                                         02S0821
*       WAITFLG=OFF;                /* INDICATE SEARCH ENDED         */
         NI    WAITFLG(ROPCAVT),B'11011111'                     02S0822
*     ELSE                                                      02S0823
*       DO;                                                     02S0823
         B     @RC00821                                         02S0823
@RF00821 DS    0H                                               02S0824
*         IF OCBACKUP=RPARM->OCBACKUP THEN                      02S0824
         CLC   OCBACKUP(8,ROPCE),OCBACKUP(RPARM)                02S0824
         BNE   @RF00824                                         02S0824
*           DO;                     /* GROUPS MATCH          @OY19465*/
*             IF OCRESP^=ON THEN                                02S0826
         TM    OCRESP(ROPCE),B'00000001'                        02S0826
         BO    @RF00826                                         02S0826
*               WAITFLG=OFF;        /* IF THIS IS A REQUEST THEN TURN
*                                      WAITFLG OFF BECAUSE ALL WE
*                                      NEED TO MATCH ARE GROUPS 02S0827
*                                                            @OY19465*/
         NI    WAITFLG(ROPCAVT),B'11011111'                     02S0827
*             ELSE                                              02S0828
*               IF OCTRMTBL=RPARM->OCTRMTBL&RPARM->OCDACTIP=ON THEN
         B     @RC00826                                         02S0828
@RF00826 CLC   OCTRMTBL(2,ROPCE),OCTRMTBL(RPARM)                02S0828
         BNE   @RF00828                                         02S0828
         TM    OCDACTIP(RPARM),B'01000000'                      02S0828
         BNO   @RF00828                                         02S0828
*                 WAITFLG=OFF;      /* ENSURE ON A RESPONSE THAT THIS
*                                      IS THE CORRECT OPCE BY   02S0829
*                                      MATCHING TTCINS       @OY19465*/
         NI    WAITFLG(ROPCAVT),B'11011111'                     02S0829
*               ELSE                                            02S0830
*                 DO;               /* NOT CORRECT OPCE      @OY19465*/
         B     @RC00828                                         02S0830
@RF00828 DS    0H                                               02S0831
*                   RZERO=RPARM;    /* SAVE PREVIOUS OPCE ADDRESS
*                                                            @OY19465*/
         LR    RZERO,RPARM                                      02S0831
*                   RPARM=RPARM->OCLINK;/* SETUP ADDRESS OF NEXT OPCE
*                                      ON CHAIN              @OY19465*/
         L     RPARM,OCLINK(,RPARM)                             02S0832
*                 END;              /*                       @OY19465*/
*           END;                                                02S0834
*         ELSE                                                  02S0835
*           DO;                                                 02S0835
         B     @RC00824                                         02S0835
@RF00824 DS    0H                                               02S0836
*             RZERO=RPARM;          /* SAVE PREVIOUS OPCE ADDRESS    */
         LR    RZERO,RPARM                                      02S0836
*             RPARM=RPARM->OCLINK;  /* SETUP ADDRESS OF NEXT OPCE ON
*                                      CHAIN                         */
         L     RPARM,OCLINK(,RPARM)                             02S0837
*           END;                                                02S0838
*       END;                                                    02S0839
@RC00824 DS    0H                                               02S0840
*   END;                                                        02S0840
@RC00821 DS    0H                                               02S0840
@DE00820 TM    WAITFLG(ROPCAVT),B'00100000'                     02S0840
         BO    @DL00820                                         02S0840
*   END;                                                        02S0841
@EL00007 DS    0H                                               02S0841
@EF00007 DS    0H                                               02S0841
@ER00007 BR    @14                                              02S0841
*                                                               02S0842
*   /*****************************************************************/
*   /*                                                               */
*   /* DLKATT: THIS INTERNAL PROCEDURE DELINKS AN ELEMENT AND ITS    */
*   /* ATTACHED CHAIN. IT THEN ATTACHES THE ELEMENT TO AN ELEMENT    */
*   /* POINTED TO BY RWORK6. IT ALSO MERGES THE ATTACHED CHAINS OF   */
*   /* THE ELEMENTS                                                  */
*   /*                                                               */
*   /*****************************************************************/
*                                                               02S0842
*DLKATT:                                                        02S0842
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                            02S0842
DLKATT   DS    0H                                               02S0843
*   RFY                                                         02S0843
*    (RWORK6,                                                   02S0843
*     RWORK7) RSTD;                                             02S0843
*   RZERO->OCLINK=RPARM->OCLINK;    /* TAKE THE ELEMENT OUT OF THE
*                                      CHAIN                 @OY19465*/
         LR    @11,RZERO                                        02S0844
         MVC   OCLINK(4,@11),OCLINK(RPARM)                      02S0844
*   IF RWORK6->OCATTACH=ON THEN                                 02S0845
         TM    OCATTACH(RWORK6),B'00000010'                     02S0845
         BNO   @RF00845                                         02S0845
*     DO;                           /* FIRST ELEMENT HAS ATTACHED
*                                      CHAIN                 @OY19465*/
*       RWORK5=RWORK6->OCELEM;      /* SAVE THE ATTACHED CHAIN  02S0847
*                                                            @OY19465*/
         L     RWORK5,OCELEM(,RWORK6)                           02S0847
*       RWORK6->OCELEM=RPARM;       /* ATTACH ELEMENT TO FIRST  02S0848
*                                      ELEMENT               @OY19465*/
         ST    RPARM,OCELEM(,RWORK6)                            02S0848
*       IF RPARM->OCATTACH^=ON THEN                             02S0849
         TM    OCATTACH(RPARM),B'00000010'                      02S0849
         BO    @RF00849                                         02S0849
*         DO;                       /* SECOND ELEMENT DOES NOT HAVE
*                                      ATTACHED CHAIN        @OY19465*/
*           RPARM->OCELEM=RWORK5;   /* ATTACH FIRST'S CHAIN TO SECOND
*                                      ELEMENT               @OY19465*/
         ST    RWORK5,OCELEM(,RPARM)                            02S0851
*           RPARM->OCATTACH=ON;     /* TURN ON OCATTACH      @OY19465*/
         OI    OCATTACH(RPARM),B'00000010'                      02S0852
*         END;                                                  02S0853
*       ELSE                                                    02S0854
*         DO;                       /* RPARM AND RWORK6 HAVE ATTACHED
*                                      CHAINS                @OY19465*/
         B     @RC00849                                         02S0854
@RF00849 DS    0H                                               02S0855
*           RWORK7=RPARM;           /* SAVE RPARM            @OY19465*/
         LR    RWORK7,RPARM                                     02S0855
*           DO WHILE(RWORK7->OCATTACH=ON);/* SEARCH FOR END OF CHAIN
*                                                            @OY19465*/
         B     @DE00856                                         02S0856
@DL00856 DS    0H                                               02S0857
*             RWORK7=RWORK7->OCELEM;/* GO DOWN ATTACHED CHAIN   02S0857
*                                                            @OY19465*/
         L     RWORK7,OCELEM(,RWORK7)                           02S0857
*           END;                                                02S0858
@DE00856 TM    OCATTACH(RWORK7),B'00000010'                     02S0858
         BO    @DL00856                                         02S0858
*           RWORK7->OCELEM=RWORK5;  /* ATTACH SECOND CHAIN TO END OF
*                                      FIRST CHAIN           @OY19465*/
         ST    RWORK5,OCELEM(,RWORK7)                           02S0859
*           RWORK7->OCATTACH=ON;    /* TURN ON OCATTACH      @OY19465*/
         OI    OCATTACH(RWORK7),B'00000010'                     02S0860
*         END;                                                  02S0861
*     END;                                                      02S0862
*   ELSE                                                        02S0863
*     DO;                                                       02S0863
         B     @RC00845                                         02S0863
@RF00845 DS    0H                                               02S0864
*       RWORK6->OCATTACH=ON;        /* TURN ON OCATTACH      @OY19465*/
         OI    OCATTACH(RWORK6),B'00000010'                     02S0864
*       RWORK6->OCELEM=RPARM;       /* ATTACH SECOND CHAIN   @OY19465*/
         ST    RPARM,OCELEM(,RWORK6)                            02S0865
*     END;                                                      02S0866
*   RPARM->OCLINK=RPARM->OCLINK&&RPARM->OCLINK;/* OY14092            */
@RC00845 L     @11,OCLINK(,RPARM)                               02S0867
         LR    @09,@11                                          02S0867
         XR    @09,@11                                          02S0867
         ST    @09,OCLINK(,RPARM)                               02S0867
*   IF RPARM->OCWTG=MODVE THEN      /* PARTIALLY DONE OY14092        */
         CLC   OCWTG(2,RPARM),MODVE                             02S0868
         BNE   @RF00868                                         02S0868
*     RPARM->OCWTG=MODV8;           /* RESTART OY14092               */
         MVC   OCWTG(2,RPARM),MODV8                             02S0869
*   ELSE                            /* NOT STOPLINE OY14092          */
*     IF RPARM->OCWTG=MODVF THEN    /* PARTIALLY DONE OY14092        */
         B     @RC00868                                         02S0870
@RF00868 CLC   OCWTG(2,RPARM),MODVF                             02S0870
         BNE   @RF00870                                         02S0870
*       RPARM->OCWTG=MODV9;         /* RESTART OY14092               */
         MVC   OCWTG(2,RPARM),MODV9                             02S0871
*     ELSE                          /* OY14092                       */
*       IF RPARM->OCWTG^=MODVG&(RPARM->OCWTG^=MODV8&RPARM->OCWTG^=MODV9
*           ) THEN                  /* ALL STARTED OY14092           */
         B     @RC00870                                         02S0872
@RF00870 CLC   OCWTG(2,RPARM),MODVG                             02S0872
         BE    @RF00872                                         02S0872
         CLC   OCWTG(2,RPARM),MODV8                             02S0872
         BE    @RF00872                                         02S0872
         CLC   OCWTG(2,RPARM),MODV9                             02S0872
         BE    @RF00872                                         02S0872
*         RPARM->OCWTG=MODV8;       /* RESTART OY14092               */
         MVC   OCWTG(2,RPARM),MODV8                             02S0873
*   IF WAITFLG=ON THEN                                          02S0874
@RF00872 DS    0H                                               02S0874
@RC00870 DS    0H                                               02S0874
@RC00868 TM    WAITFLG(ROPCAVT),B'00100000'                     02S0874
         BNO   @RF00874                                         02S0874
*     DO;                           /* AT THIS POINT WE MUST STILL
*                                      CONTINUE TO SEARCH THE WAITV
*                                      CHAIN. THEREFORE, RWORK6 MUST
*                                      BE SET EQUAL TO RPARM IN ORDER
*                                      TO ATTACH THE NEXT ELEMENT IF
*                                      NECESSARY             @OY19465*/
*       RWORKA=RWORK6;                                          02S0876
         LR    RWORKA,RWORK6                                    02S0876
*       RWORK6=RPARM;                                           02S0877
         LR    RWORK6,RPARM                                     02S0877
*     END;                                                      02S0878
*   END;                                                        02S0879
@EL00008 DS    0H                                               02S0879
@EF00008 DS    0H                                               02S0879
@ER00008 BR    @14                                              02S0879
*   RFY                                                         02S0880
*    (RWORK6,                                                   02S0880
*     RWORK7) UNRSTD;                                           02S0880
*   END IGCV810D                                                01S0881
*                                                               01S0881
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */
*/*%INCLUDE SYSLIB  (TAVTD   )                                       */
*/*%INCLUDE SYSLIB  (IHADCBDF)                                       */
*/*%INCLUDE SYSLIB  (IHADCB  )                                       */
*/*%INCLUDE SYSLIB  (TDEBD   )                                       */
*/*%INCLUDE SYSLIB  (IEFUCBOB)                                       */
*/*%INCLUDE SYSLIB  (TNSLD   )                                       */
*/*%INCLUDE SYSLIB  (TOPCED  )                                       */
*/*%INCLUDE SYSLIB  (TOPCAVTD)                                       */
*/*%INCLUDE SYSLIB  (TOPRED  )                                       */
*/*%INCLUDE SYSLIB  (TPRFD   )                                       */
*/*%INCLUDE SYSLIB  (TPRIOR  )                                       */
*/*%INCLUDE SYSLIB  (TQCBD   )                                       */
*/*%INCLUDE SYSLIB  (TTRMD   )                                       */
*/*%INCLUDE SYSUT5  (RFY     )                                       */
*/*%INCLUDE SYSUT5  (DCL     )                                       */
*/*%INCLUDE SYSUT5  (PROCESS )                                       */
*/*%INCLUDE SYSUT5  (INITIAL )                                       */
*/*%INCLUDE SYSUT5  (RESPROC )                                       */
*/*%INCLUDE SYSUT5  (SNAPROC )                                       */
*/*%INCLUDE SYSUT5  (STPLPROC)                                       */
*/*%INCLUDE SYSUT5  (FIRSTLN )                                       */
*/*%INCLUDE SYSUT5  (WLATTACH)                                       */
*/*%INCLUDE SYSUT5  (SNACHK  )                                       */
*/*%INCLUDE SYSUT5  (NCPCHK  )                                       */
*/*%INCLUDE SYSUT5  (LNCHK   )                                       */
*/*%INCLUDE SYSUT5  (BLDACT  )                                       */
*/*%INCLUDE SYSUT5  (EPILOGUE)                                       */
*/*%INCLUDE SYSUT5  (IPERROR )                                       */
*/*%INCLUDE SYSUT5  (UPDSTATE)                                       */
*/*%INCLUDE SYSUT5  (IPEXTERN)                                       */
*/*%INCLUDE SYSUT5  (IPEXIT  )                                       */
*/*%INCLUDE SYSUT5  (UPDSTATN)                                       */
*/*%INCLUDE SYSUT5  (IPINTERN)                                       */
*/*%INCLUDE SYSUT5  (IPMLNCHK)                                       */
*/*%INCLUDE SYSUT5  (IPWLSRCH)                                       */
*/*%INCLUDE SYSUT5  (DLKATT  )                                       */
*                                                               01S0881
*       ;                                                       01S0881
@DATA    DS    0H
@CH00061 DC    H'1'
@CH00065 DC    H'2'
@CH01234 DC    H'14'
@CH00776 DC    H'36'
@CH02230 DC    H'401'
@CH02232 DC    H'539'
         DS    0F
         DS    0F
@CF00256 DC    F'4'
@CF00045 DC    F'8'
@CF02218 DC    F'25'
@CF02220 DC    F'26'
@CF02222 DC    F'49'
@CF02224 DC    F'199'
@CH02224 EQU   @CF02224+2
@CF02226 DC    F'210'
@CF02228 DC    F'400'
@CF02238 DC    F'543'
@CF02240 DC    F'544'
@CF02242 DC    F'545'
@CF02313 DC    F'-11'
@CF02321 DC    F'-10'
@CF02320 DC    F'-8'
@CF02322 DC    F'-6'
@CF01505 DC    F'-3'
@CF01775 DC    XL4'08000002'
@CF02216 DC    XL4'00FFFFFF'
         DS    0D
OPRQST   DC    X'0C'
OPEND    DC    X'80'
MOD00    DC    CL2'00'
MOD03    DC    CL2'03'
MOD06    DC    CL2'06'
MOD07    DC    CL2'07'
MOD09    DC    CL2'09'
MODFC    DC    CL2'FC'
MODFG    DC    CL2'FG'
MODVE    DC    CL2'VE'
MODV8    DC    CL2'V8'
MODV9    DC    CL2'V9'
MODVG    DC    CL2'VG'
MODVF    DC    CL2'VF'
ZAPAREA  DC    XL104'0'
@00      EQU   00                      EQUATES FOR REGISTERS 0-15
@01      EQU   01
@02      EQU   02
@03      EQU   03
@04      EQU   04
@05      EQU   05
@06      EQU   06
@07      EQU   07
@08      EQU   08
@09      EQU   09
@10      EQU   10
@11      EQU   11
@12      EQU   12
@13      EQU   13
@14      EQU   14
@15      EQU   15
ROPCE    EQU   @03
ROPCAVT  EQU   @02
RAVT     EQU   @04
RPARM    EQU   @01
RTRM     EQU   @08
RZERO    EQU   @00
RWORK5   EQU   @05
RWORKA   EQU   @10
RWORK6   EQU   @06
RWORK7   EQU   @07
REG09    EQU   @09
RBASE    EQU   @12
RSAVE    EQU   @13
REG14    EQU   @14
REG15    EQU   @15
IEDQAVTD EQU   0
AVTSAVEX EQU   IEDQAVTD+288
AVTREADD EQU   IEDQAVTD+380
AVTBUFSW EQU   IEDQAVTD+384
@NM00004 EQU   IEDQAVTD+388
AVTCKFLG EQU   @NM00004
AVTBASE  EQU   IEDQAVTD+412
AVTPKF   EQU   AVTBASE
AVTRNMPT EQU   IEDQAVTD+424
AVTOSECB EQU   IEDQAVTD+492
AVTECB1  EQU   AVTOSECB
AVTHG02  EQU   IEDQAVTD+528
AVTDISP  EQU   IEDQAVTD+552
AVTHD    EQU   IEDQAVTD+556
AVTSCOPT EQU   AVTHD
AVTSAVTP EQU   IEDQAVTD+612
AVTSAVTF EQU   AVTSAVTP
AVTCKPEL EQU   IEDQAVTD+652
AVTCKRMV EQU   AVTCKPEL
AVTCKELF EQU   IEDQAVTD+680
AVTCKBYT EQU   IEDQAVTD+691
AVTHG01  EQU   IEDQAVTD+692
AVTCKLNK EQU   IEDQAVTD+696
AVTCRELE EQU   IEDQAVTD+708
AVTCCELE EQU   AVTCRELE
AVTCLRHI EQU   IEDQAVTD+716
AVTADBUF EQU   IEDQAVTD+720
AVTSYSER EQU   IEDQAVTD+728
AVTBFRFG EQU   IEDQAVTD+784
AVTCKPQB EQU   IEDQAVTD+804
AVTCKPTB EQU   AVTCKPQB
AVTCKPEC EQU   AVTCKPQB+4
AVTCKPCC EQU   AVTCKPEC
AVTOPCQB EQU   IEDQAVTD+816
AVTOPCOB EQU   AVTOPCQB
AVTOPCEC EQU   AVTOPCQB+4
AVTOPCCC EQU   AVTOPCEC
AVTOLTQB EQU   IEDQAVTD+828
AVTCWFL1 EQU   IEDQAVTD+924
AVTCWFL2 EQU   IEDQAVTD+925
AVTSUBT  EQU   IEDQAVTD+948
AVTIOTR  EQU   IEDQAVTD+949
AVTBIT1  EQU   IEDQAVTD+1050
AVTBIT2  EQU   IEDQAVTD+1051
AVTBIT3  EQU   IEDQAVTD+1052
AVTBIT4  EQU   IEDQAVTD+1136
@NM00086 EQU   IEDQAVTD+1232
IEDQAPTR EQU   0
IEDNSVTD EQU   0
SAVTDIAG EQU   IEDNSVTD
SAVTDIAF EQU   SAVTDIAG
SAVTLUSQ EQU   IEDNSVTD+88
SAVTSPLN EQU   IEDNSVTD+224
SAVTTCPU EQU   IEDNSVTD+238
SAVTZELM EQU   IEDNSVTD+270
SAVTRDRV EQU   IEDNSVTD+284
SAVTCKQB EQU   IEDNSVTD+300
SAVTCKTB EQU   SAVTCKQB
SAVTCKEC EQU   SAVTCKQB+4
SAVTCKCC EQU   SAVTCKEC
IHADCB   EQU   0
IHADCS1A EQU   0
DCBBCKUP EQU   IHADCS1A+8
IHADCS2K EQU   0
DCBDUMPD EQU   IHADCS2K
DCBTRSTA EQU   IHADCS2K+5
DCBDSORG EQU   IHADCS2K+6
DCBDSRG2 EQU   DCBDSORG+1
DCBRNCKD EQU   IHADCS2K+12
DCBEXLST EQU   IHADCS2K+16
IHADCS24 EQU   0
DCBOFLGS EQU   IHADCS24+8
DCBOFLWR EQU   DCBOFLGS
DCBIFLG  EQU   IHADCS24+9
DCBIBPCT EQU   DCBIFLG
DCBMACR  EQU   IHADCS24+10
DCBMACR1 EQU   DCBMACR
DCBMRFE  EQU   DCBMACR1
DCBMRGET EQU   DCBMRFE
DCBMRAPG EQU   DCBMACR1
DCBMRRD  EQU   DCBMRAPG
DCBMRCI  EQU   DCBMACR1
DCBMRMVG EQU   DCBMRCI
DCBMRLCG EQU   DCBMACR1
DCBMRABC EQU   DCBMACR1
DCBMRPT1 EQU   DCBMRABC
DCBMRSBG EQU   DCBMRPT1
DCBMRCRL EQU   DCBMACR1
DCBMRCHK EQU   DCBMRCRL
DCBMRRDX EQU   DCBMRCHK
DCBMRDMG EQU   DCBMACR1
DCBMACR2 EQU   DCBMACR+1
DCBMRPUT EQU   DCBMACR2
DCBMRWRT EQU   DCBMACR2
DCBMRMVP EQU   DCBMACR2
DCBMR5WD EQU   DCBMACR2
DCBMRLDM EQU   DCBMR5WD
DCBMRLCP EQU   DCBMRLDM
DCBMR4WD EQU   DCBMACR2
DCBMRPT2 EQU   DCBMR4WD
DCBMRTMD EQU   DCBMRPT2
DCBMR3WD EQU   DCBMACR2
DCBMRCTL EQU   DCBMR3WD
DCBMRSTK EQU   DCBMRCTL
DCBMR1WD EQU   DCBMACR2
DCBMRSWA EQU   DCBMR1WD
DCBMRDMD EQU   DCBMRSWA
IHADCS25 EQU   0
DCBMACRF EQU   IHADCS25+2
DCBMACF1 EQU   DCBMACRF
DCBMFFE  EQU   DCBMACF1
DCBMFGET EQU   DCBMFFE
DCBMFAPG EQU   DCBMACF1
DCBMFRD  EQU   DCBMFAPG
DCBMFCI  EQU   DCBMACF1
DCBMFMVG EQU   DCBMFCI
DCBMFLCG EQU   DCBMACF1
DCBMFABC EQU   DCBMACF1
DCBMFPT1 EQU   DCBMFABC
DCBMFSBG EQU   DCBMFPT1
DCBMFCRL EQU   DCBMACF1
DCBMFCHK EQU   DCBMFCRL
DCBMFDMG EQU   DCBMACF1
DCBMACF2 EQU   DCBMACRF+1
DCBMFPUT EQU   DCBMACF2
DCBMFWRT EQU   DCBMACF2
DCBMFMVP EQU   DCBMACF2
DCBMF5WD EQU   DCBMACF2
DCBMFLDM EQU   DCBMF5WD
DCBMFLCP EQU   DCBMFLDM
DCBMF4WD EQU   DCBMACF2
DCBMFPT2 EQU   DCBMF4WD
DCBMFTMD EQU   DCBMFPT2
DCBMF3WD EQU   DCBMACF2
DCBMFCTL EQU   DCBMF3WD
DCBMFSTK EQU   DCBMFCTL
DCBMF1WD EQU   DCBMACF2
DCBMFSWA EQU   DCBMF1WD
DCBMFDMD EQU   DCBMFSWA
DCBDEBAD EQU   IHADCS25+4
DCBIFLGS EQU   DCBDEBAD
DCBIFPCT EQU   DCBIFLGS
IHADCS27 EQU   0
DCBGET   EQU   IHADCS27
DCBPUT   EQU   DCBGET
DCBGETA  EQU   DCBPUT+1
IHADCS43 EQU   0
DCBSCTAB EQU   IHADCS43
IEDQDEB  EQU   0
DEBPRF   EQU   IEDQDEB
DEBAPVT  EQU   DEBPRF
DEBNMSUB EQU   IEDQDEB+36
DEBNMEXT EQU   IEDQDEB+52
DEBUCBS  EQU   IEDQDEB+68
IEDQDPTR EQU   0
UCB      EQU   0
UCBOB    EQU   0
UCBJBNR  EQU   UCBOB
UCBFL5   EQU   UCBOB+1
UCBAF    EQU   UCBFL5
UCBSTAT  EQU   UCBOB+3
UCBCHAN  EQU   UCBOB+4
UCBSFLS  EQU   UCBOB+6
UCBFLA   EQU   UCBSFLS
UCBFL1   EQU   UCBFLA
UCBBSY   EQU   UCBFL1
UCBNRY   EQU   UCBFL1
UCBPST   EQU   UCBFL1
UCBCUB   EQU   UCBFL1
UCBFLB   EQU   UCBSFLS+1
UCBCHM   EQU   UCBOB+8
UCBCHM1  EQU   UCBCHM
UCBPTH0  EQU   UCBCHM1
UCBPTH1  EQU   UCBCHM1
UCBWGT   EQU   UCBOB+12
UCBNAME  EQU   UCBOB+13
UCBTYP   EQU   UCBOB+16
UCBTBYT1 EQU   UCBTYP
UCB1FEA5 EQU   UCBTBYT1
UCB1FEA6 EQU   UCBTBYT1
UCBTBYT2 EQU   UCBTYP+1
UCB2OPT2 EQU   UCBTBYT2
UCBDUDN1 EQU   UCB2OPT2
UCB2OPT3 EQU   UCBTBYT2
UCBDUDN2 EQU   UCB2OPT3
UCB2OPT4 EQU   UCBTBYT2
UCBRWTAU EQU   UCB2OPT4
UCB2OPT6 EQU   UCBTBYT2
UCB2OPT7 EQU   UCBTBYT2
UCBTBYT3 EQU   UCBTYP+2
UCBDVCLS EQU   UCBTBYT3
UCBTBYT4 EQU   UCBTYP+3
UCBEXTPT EQU   UCBOB+20
UCBFLC   EQU   UCBEXTPT
UCBDEV   EQU   UCBOB+24
UCBCMEXT EQU   0
UCBATI   EQU   UCBCMEXT+3
@NM00119 EQU   UCBATI
UCBFLP1  EQU   UCBCMEXT+5
UCBMT    EQU   0
UCBOCR   EQU   0
UCB3540X EQU   0
UCBDKBYT EQU   UCB3540X+6
UCB3800X EQU   0
UCBOPTNS EQU   UCB3800X
UCBACTIV EQU   UCB3800X+3
UCBMDRBF EQU   UCB3800X+36
UCBUCS   EQU   0
UCBUCSOP EQU   UCBUCS+4
UCBFCBOP EQU   UCBUCS+5
IEDNNSLD EQU   0
IEDNSLD  EQU   0
NSLPLCB  EQU   IEDNSLD+8
NSLGPCUS EQU   IEDNSLD+12
NSLPRIBK EQU   IEDNSLD+18
NSLFLGBK EQU   IEDNSLD+19
NSLERB   EQU   IEDNSLD+20
NSLESTAT EQU   NSLERB+8
NSLREQTY EQU   IEDNSLD+35
NSLGRPNM EQU   IEDNSLD+36
NSLTTEPT EQU   IEDNSLD+44
IEDNSLP  EQU   0
IEDQOPCE EQU   0
OCLINK   EQU   IEDQOPCE
OCELEM   EQU   IEDQOPCE+4
OCELMPTR EQU   OCELEM+1
OCUNIT   EQU   IEDQOPCE+8
OCRUDEST EQU   OCUNIT
OCCKPKEY EQU   OCRUDEST
OCSCAN   EQU   OCCKPKEY
OCOPTCDE EQU   IEDQOPCE+12
OCSWITCH EQU   IEDQOPCE+13
OCFLAG   EQU   IEDQOPCE+14
OCTOTE   EQU   OCFLAG
OCATTACH EQU   OCFLAG
OCRESP   EQU   OCFLAG
@NM00129 EQU   IEDQOPCE+16
OCDEST   EQU   @NM00129
OCREQVAL EQU   OCDEST+1
OCTRMTBL EQU   IEDQOPCE+20
OCLINENO EQU   IEDQOPCE+22
OCTIOT   EQU   OCLINENO
OCWTGB   EQU   OCTIOT
OCTRUNIT EQU   IEDQOPCE+24
OCRSID   EQU   OCTRUNIT
OCALSTAT EQU   OCRSID
OCRENTRD EQU   OCALSTAT
OCDACTIP EQU   OCALSTAT
OCACTREQ EQU   OCALSTAT
OCALLFLG EQU   OCALSTAT
OCSOME   EQU   OCALSTAT
OCNONE   EQU   OCALSTAT
OCPARM   EQU   IEDQOPCE+28
OCWTG    EQU   IEDQOPCE+30
OCBACKUP EQU   IEDQOPCE+32
OCMODNME EQU   IEDQOPCE+40
OCIPLWA  EQU   OCMODNME
OCPTRSAV EQU   OCMODNME+4
OCCKDATA EQU   IEDQOPCE+48
OCRSTGTM EQU   OCCKDATA
IEDQOPCN EQU   0
OCLDNME  EQU   IEDQOPCN
OCLINTTE EQU   OCLDNME
OCREQFLG EQU   OCLINTTE+2
OCFLUSHZ EQU   OCREQFLG
OCPREFLG EQU   OCLINTTE+3
IEDQOPCD EQU   0
OPCAVTPT EQU   IEDQOPCD+8
OPCCOPCE EQU   IEDQOPCD+12
OPCSAVE  EQU   IEDQOPCD+56
OPCFLAG1 EQU   IEDQOPCD+146
OPCAQCTL EQU   IEDQOPCD+180
OPCXCTL  EQU   IEDQOPCD+204
OPCLDNME EQU   IEDQOPCD+212
OPCMODID EQU   OPCLDNME+3
OPCHORT  EQU   IEDQOPCD+256
OPCGETBF EQU   IEDQOPCD+276
OPCFREBF EQU   IEDQOPCD+280
OPCSPEC  EQU   IEDQOPCD+300
OPCWRKSP EQU   IEDQOPCD+320
OPCWAITV EQU   IEDQOPCD+364
OPCPWCOB EQU   IEDQOPCD+368
OPCPWQCB EQU   OPCPWCOB
OPCPWECB EQU   OPCPWCOB+4
IEDOPRED EQU   0
OPREQCB  EQU   IEDOPRED+1
OPREPRI  EQU   IEDOPRED+4
OPRESAVE EQU   IEDOPRED+8
OPREFLG3 EQU   IEDOPRED+14
IEDQPRF  EQU   0
PRFRCB   EQU   IEDQPRF
PRFKEY   EQU   PRFRCB
PRFQCBA  EQU   PRFRCB+1
PRFPRI   EQU   PRFRCB+4
PRFLINK  EQU   PRFRCB+5
PRFTIC   EQU   IEDQPRF+8
PRFTICC  EQU   PRFTIC
PRFNBUNT EQU   IEDQPRF+12
PRFSUNIT EQU   PRFNBUNT
PRFPLQCB EQU   PRFSUNIT
@NM00161 EQU   IEDQPRF+16
PRFSVFFO EQU   @NM00161
PRFSTAT1 EQU   IEDQPRF+20
PRFEOFN  EQU   PRFSTAT1
PRFCORE  EQU   IEDQPRF+21
PRFXTRA  EQU   PRFCORE
PRFSCAN  EQU   IEDQPRF+24
PRFTQBCK EQU   IEDQPRF+26
PRFNTXT  EQU   PRFTQBCK
PRFEOBOF EQU   PRFNTXT
PRFCHDR  EQU   IEDQPRF+32
PRFHQBCK EQU   IEDQPRF+35
IEDQPPTR EQU   0
IEDPF1   EQU   0
PRF1FLG1 EQU   IEDPF1+3
PRF1WD2  EQU   IEDPF1+4
PRF1SEQP EQU   PRF1WD2
PRF1SQID EQU   PRF1SEQP
PRF1TAG1 EQU   PRF1SQID
IEDPF2   EQU   0
PRF2FLG2 EQU   IEDPF2
PRF2WD2  EQU   IEDPF2+4
IEDQQCB  EQU   0
QCBDSFLG EQU   IEDQQCB
QCBDISK  EQU   QCBDSFLG
QCBELCHN EQU   IEDQQCB+1
QCBEOLDT EQU   IEDQQCB+16
QCBBYTE1 EQU   QCBEOLDT+1
QCBLKRLN EQU   IEDQQCB+18
QCBRETCT EQU   QCBLKRLN
QCBSTAT  EQU   IEDQQCB+19
QCBINSRC EQU   IEDQQCB+21
@NM00171 EQU   QCBINSRC
QCBTSOF2 EQU   @NM00171+1
QCBTSOF1 EQU   @NM00171+2
QCBINTVL EQU   IEDQQCB+24
QCBPREN  EQU   IEDQQCB+28
QCBLKRRN EQU   QCBPREN+1
QCBDCBAD EQU   IEDQQCB+33
QCBFLAG  EQU   IEDQQCB+36
IEDQQPTR EQU   0
IEDQPQCB EQU   0
QCBFHDLZ EQU   IEDQPQCB+3
QCBPFEFO EQU   QCBFHDLZ+1
QCBFHDTZ EQU   IEDQPQCB+6
QCBINTLF EQU   IEDQPQCB+12
IEDNQCB  EQU   0
QCBSTAT1 EQU   IEDNQCB+4
QCBPLCBA EQU   IEDNQCB+5
IEDQTRM  EQU   0
TRMSTATE EQU   IEDQTRM
TRMLOG   EQU   TRMSTATE
TRMDESTQ EQU   IEDQTRM+1
TRMINSEQ EQU   IEDQTRM+4
TLISTCNT EQU   TRMINSEQ
TRMOUTSQ EQU   IEDQTRM+6
TLISTEN  EQU   TRMOUTSQ
TRMDSORG EQU   TLISTEN
TRMALTD  EQU   IEDQTRM+8
TRMDEVFL EQU   IEDQTRM+10
TRMSTAT  EQU   IEDQTRM+12
IEDQTPTR EQU   0
IEDNTRM  EQU   0
TRMBYTE4 EQU   IEDNTRM
TRMBYTE3 EQU   IEDNTRM+1
TRMBYTE2 EQU   IEDNTRM+2
TRMRSACT EQU   TRMBYTE2
TRMINPG  EQU   TRMBYTE2
TRMBYTE1 EQU   IEDNTRM+3
TRMSCPRQ EQU   TRMBYTE1
TRMSTOTE EQU   TRMBYTE1
TRMCOHRT EQU   IEDNTRM+4
TRMBYTE0 EQU   IEDNTRM+6
TRMSIBPT EQU   IEDNTRM+7
TRMCOHTG EQU   TRMSIBPT+1
TRMTYPE  EQU   IEDNTRM+11
TRMSUBST EQU   IEDNTRM+12
IEDQTNT  EQU   0
COHORTLK EQU   0
FREEBUFF EQU   0
ALLOCBUF EQU   0
DEBSUBR  EQU   0
QCBLDCB  EQU   0
UCBBGN   EQU   0
UCBDCPTR EQU   0
DCBPTR   EQU   QCBDCBAD
DEBUCB   EQU   DEBUCBS
DEBDVMOD EQU   DEBUCB
DEBUCBAD EQU   DEBUCB+1
UCBPTR   EQU   DEBUCBAD
UCBOBS01 EQU   UCBDEV
UCBSTAB  EQU   UCBOBS01+10
UCBBSVL  EQU   UCBSTAB
UCBPRSRS EQU   UCBSTAB
UCBDMCT  EQU   UCBOBS01+11
UCBFL4   EQU   UCBOBS01+13
UCBOBS02 EQU   UCBDEV
UCBTFL1  EQU   UCBOBS02+19
UCBXTN   EQU   UCBOBS02+20
UCBVOPT  EQU   UCBXTN
UCBOBS03 EQU   UCBDEV
UCBXTADR EQU   UCBOBS03
UCBOBS04 EQU   UCBDEV
UCBBTA   EQU   UCBOBS04+12
UCBOBS06 EQU   UCBDEV
UCBAOF   EQU   UCBOBS06
UCBAOF1  EQU   UCBAOF
UCBAOF2  EQU   UCBAOF+1
@NM00118 EQU   UCBOBS06+3
UCBIRB   EQU   UCBOBS06+4
UCBGRAF  EQU   UCBIRB
UCBLDNCA EQU   UCBOBS06+8
UCBRDYQ  EQU   UCBLDNCA
UCBIRLN  EQU   UCBRDYQ
UCBLDNCB EQU   UCBRDYQ+1
UCBCTLNK EQU   UCBOBS06+12
UCBOBS07 EQU   UCBDEV
UCBOBS08 EQU   UCBDEV
UCBCTCAD EQU   UCBOBS08
UCBCTCF1 EQU   UCBOBS08+4
UCBOBS09 EQU   UCBDEV
OCCKPKY1 EQU   OCCKPKEY
OCCKPTYP EQU   OCCKPKY1
OCICACTN EQU   OCMODNME
OCICDADR EQU   OCICACTN
OCICSW   EQU   OCICDADR+3
OPCAQWD  EQU   OPCAQCTL
OPCAQWD1 EQU   OPCAQWD
OPCAQREQ EQU   OPCAQWD1
OPCAQWD2 EQU   OPCAQWD+4
OPCAQRQ2 EQU   OPCAQWD2
OPCAQWD3 EQU   OPCAQWD+8
TRMPRE1  EQU   TRMBYTE4
TRMNCP1  EQU   TRMBYTE4
TRMPRE   EQU   TRMBYTE3
TRMNCP   EQU   TRMBYTE3
TRMNCPCL EQU   TRMNCP
TRMPU    EQU   TRMBYTE3
TRMLU    EQU   TRMBYTE3
TRMLINK  EQU   TRMBYTE3
FLAGS    EQU   OPCFLAG1
FIRSTREQ EQU   FLAGS
MORLINES EQU   FLAGS
WAITFLG  EQU   FLAGS
EXITFLG  EQU   FLAGS
OCCIB    EQU   OCREQVAL
PRFSHDR  EQU   IEDQPRF+42
TRMOPT   EQU   IEDQTRM+20
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS
ERRFLG   EQU   FLAGS
@NM00181 EQU   TRMLINK
TRMLSTAT EQU   TRMLINK
TRMLINT  EQU   TRMLINK
TRMEPMOD EQU   TRMLINK
TRMLULOG EQU   TRMLU
TRMINERR EQU   TRMLU
TRMLUREQ EQU   TRMLU
TRMSESRQ EQU   TRMLU
TRMTDIFF EQU   TRMLU
TRMLUTM  EQU   TRMLU
TRMLUIT  EQU   TRMLU
TRMAUTO  EQU   TRMLU
TRMPCONT EQU   TRMPU
@NM00180 EQU   TRMPU
TRMNCONT EQU   TRMNCP
TRMQUCKN EQU   TRMNCP
TRMSLOWN EQU   TRMNCP
TRMSYGEN EQU   TRMNCP
TRMIPLDM EQU   TRMNCP
TRMINOUT EQU   TRMPRE
TRMRDOUT EQU   TRMPRE
TRMNLOUT EQU   TRMPRE
TRMWROUT EQU   TRMPRE
TRMASNXI EQU   TRMPRE
TRMSTMM  EQU   TRMPRE
TRMCMODE EQU   TRMPRE
TRMSTPND EQU   TRMPRE
@NM00179 EQU   TRMNCP1
TRMINOP  EQU   TRMNCP1
TRMLYNCH EQU   TRMPRE1
TRMSPOUT EQU   TRMPRE1
TRMERLCK EQU   TRMPRE1
TRMQNPL  EQU   TRMPRE1
TRMSPACT EQU   TRMPRE1
TRMOCNI  EQU   TRMPRE1
TRMSESSN EQU   TRMPRE1
TRMCONT  EQU   TRMPRE1
OPCAQLST EQU   OPCAQWD3+1
OPCAQRQ3 EQU   OPCAQWD3
OPCAQSEC EQU   OPCAQWD2+1
OPCAQFST EQU   OPCAQWD1+1
OCICINAC EQU   OCICSW
@NM00134 EQU   OCICSW
OCICATST EQU   OCICDADR+1
OCICTYPE EQU   OCICDADR
@NM00133 EQU   OCCKPKY1
OCCKPENV EQU   OCCKPKY1
OCCKPRST EQU   OCCKPTYP
OCCKPNCP EQU   OCCKPTYP
OCCKPINC EQU   OCCKPTYP
UCBRV066 EQU   UCBOBS09+4
UCBIOSBA EQU   UCBOBS09
UCBRV042 EQU   UCBOBS08+5
UCBRV082 EQU   UCBCTCF1
UCBRV081 EQU   UCBCTCF1
UCBRV080 EQU   UCBCTCF1
UCBRV079 EQU   UCBCTCF1
UCBRV078 EQU   UCBCTCF1
UCBRV077 EQU   UCBCTCF1
UCBRV076 EQU   UCBCTCF1
UCBCTC80 EQU   UCBCTCF1
UCBCTCAL EQU   UCBCTCAD
UCBICNCB EQU   UCBOBS07+4
UCBRV040 EQU   UCBOBS07
UCBCTLNA EQU   UCBCTLNK+1
UCBRLN   EQU   UCBCTLNK
UCBRDYQA EQU   UCBLDNCB
UCBINRLN EQU   UCBIRLN
UCBIRBA  EQU   UCBIRB+1
UCBRV039 EQU   UCBGRAF
UCBDWNR  EQU   UCBGRAF
UCBRPND  EQU   UCBGRAF
UCBUPM   EQU   UCBGRAF
UCBBTAM  EQU   UCBGRAF
UCBDRNO  EQU   UCBGRAF
UCBDRO   EQU   UCBGRAF
UCBOIP   EQU   UCBGRAF
UCBATRCD EQU   @NM00118
UCBSKPFG EQU   @NM00118
UCBRIPND EQU   @NM00118
UCBRTIAC EQU   @NM00118
UCBRSV79 EQU   @NM00118
UCBRSV78 EQU   @NM00118
UCBRSV77 EQU   @NM00118
UCBOLTEP EQU   @NM00118
UCBATNCT EQU   UCBOBS06+2
UCBRSV76 EQU   UCBAOF2
UCBRSV75 EQU   UCBAOF2
UCBRSV74 EQU   UCBAOF2
UCBRSV73 EQU   UCBAOF2
UCBRSV72 EQU   UCBAOF2
UCBRSV71 EQU   UCBAOF2
UCBRSV70 EQU   UCBAOF2
UCBRSV69 EQU   UCBAOF2
UCBRSV68 EQU   UCBAOF1
UCBRSV67 EQU   UCBAOF1
UCBRSV66 EQU   UCBAOF1
UCBRSV65 EQU   UCBAOF1
UCBRSV64 EQU   UCBAOF1
UCBOFNL  EQU   UCBAOF1
UCBOFSP  EQU   UCBAOF1
UCBOFMCR EQU   UCBAOF1
UCBBTB   EQU   UCBBTA+1
UCBDI    EQU   UCBBTA
UCBSNS   EQU   UCBOBS04+8
UCBTEB   EQU   UCBOBS04+4
UCBGCB   EQU   UCBOBS04+3
UCBOPEN  EQU   UCBOBS04+2
UCBSTART EQU   UCBOBS04
UCBXTNB  EQU   UCBXTN+1
UCBRSV22 EQU   UCBVOPT
UCBRSV21 EQU   UCBVOPT
UCBRSV20 EQU   UCBVOPT
UCBESVE  EQU   UCBVOPT
UCBERPC  EQU   UCBVOPT
UCBESVC  EQU   UCBVOPT
UCBEVA   EQU   UCBVOPT
UCBESV   EQU   UCBVOPT
UCBRV009 EQU   UCBTFL1
UCBRV008 EQU   UCBTFL1
UCBRV007 EQU   UCBTFL1
UCBRV006 EQU   UCBTFL1
UCBRV005 EQU   UCBTFL1
UCBRV038 EQU   UCBTFL1
UCBNSLTP EQU   UCBTFL1
UCBNLTP  EQU   UCBTFL1
UCBRES1B EQU   UCBOBS02+18
UCBFSER  EQU   UCBOBS02+12
@NM00117 EQU   UCBOBS02+4
UCBFSEQ  EQU   UCBOBS02+2
UCBFSCT  EQU   UCBOBS02
UCBNEXP  EQU   UCBOBS01+20
UCBBASE  EQU   UCBOBS01+16
UCBRES1A EQU   UCBOBS01+15
UCBUSER  EQU   UCBOBS01+14
UCBFL47  EQU   UCBFL4
UCBFL46  EQU   UCBFL4
UCBFL45  EQU   UCBFL4
UCBRV065 EQU   UCBFL4
UCBDSS   EQU   UCBFL4
UCBRV028 EQU   UCBFL4
UCBWDAV  EQU   UCBFL4
UCBDAVV  EQU   UCBFL4
UCBSQC   EQU   UCBOBS01+12
UCBDATP  EQU   UCBOBS01+12
UCBDMC   EQU   UCBDMCT
UCBMOUNT EQU   UCBDMCT
UCBBNUL  EQU   UCBSTAB
UCBSHAR  EQU   UCBSTAB
UCBBSTR  EQU   UCBSTAB
UCBBPUB  EQU   UCBSTAB
UCBBPRV  EQU   UCBSTAB
UCBBALB  EQU   UCBPRSRS
UCBPGFL  EQU   UCBSTAB
UCBDVSHR EQU   UCBBSVL
UCBVOLI  EQU   UCBOBS01+4
UCBVTOC  EQU   UCBOBS01
TRMRLMCT EQU   IEDNTRM+10
TRMGPCNT EQU   TRMSIBPT
TRMBUFRD EQU   TRMBYTE0
TRMSNA   EQU   TRMBYTE0
TRMGP    EQU   TRMBYTE0
TRMDIAL  EQU   TRMBYTE0
@NM00178 EQU   TRMBYTE0
TRMOUTPT EQU   TRMBYTE0
TRMINPUT EQU   TRMBYTE0
TRMUDEF  EQU   TRMBYTE0
TRMCKPRN EQU   TRMBYTE1
TRMTSATN EQU   TRMBYTE1
TRMTRACE EQU   TRMBYTE1
TRMSWBCK EQU   TRMBYTE1
TRMAUTOC EQU   TRMBYTE1
TRMINPTP EQU   TRMBYTE1
TRMWTNEG EQU   TRMSCPRQ
TRMWRBRK EQU   TRMBYTE2
TRMNOSND EQU   TRMBYTE2
TRMPREP  EQU   TRMBYTE2
TRMGPACT EQU   TRMBYTE2
TRMANDL  EQU   TRMBYTE2
TRMCLOSN EQU   TRMINPG
TRMREMB  EQU   TRMBYTE2
TRMOPTBL EQU   IEDQTRM+18
TRMOPNO  EQU   IEDQTRM+17
TRMCHCIN EQU   IEDQTRM+16
TRMSENSE EQU   TRMSTAT+3
TRMTEMPR EQU   TRMSTAT+2
TRMSIO   EQU   TRMSTAT
@NM00177 EQU   TRMDEVFL+1
TRMTPIN  EQU   TRMDEVFL+1
TRMNCPI  EQU   TRMDEVFL+1
TRMRNTRM EQU   TRMDEVFL+1
@NM00176 EQU   TRMDEVFL+1
TRMLMD   EQU   TRMDEVFL+1
TRMCONC  EQU   TRMDEVFL+1
TRMTSOB  EQU   TRMDEVFL
TRMBFDY  EQU   TRMDEVFL
TRMTBLK  EQU   TRMDEVFL
TRMSBLK  EQU   TRMDEVFL
TRMBLKS  EQU   TRMDEVFL
TRMADDC  EQU   TRMDEVFL
TRMDDIG  EQU   TRMDEVFL
TRMBUFS  EQU   TRMDEVFL
TRMPRILK EQU   TRMALTD
TRMLGB   EQU   TRMDSORG
TRMUTERM EQU   TLISTCNT
TRMSCNYN EQU   TRMSTATE
TRMOPTFN EQU   TRMSTATE
TRMHELDN EQU   TRMSTATE
TRMACPTN EQU   TRMSTATE
TRMPREF  EQU   TRMSTATE
TRMPROC  EQU   TRMLOG
TRMLIST  EQU   TRMLOG
TRMLINE  EQU   TRMSTATE
QCBTTCIN EQU   QCBPLCBA+1
@NM00175 EQU   QCBPLCBA
@NM00174 EQU   QCBSTAT1
QCBFLUSH EQU   QCBSTAT1
QCBNDXRQ EQU   QCBSTAT1
QCBESIG  EQU   QCBSTAT1
QCBRCVRQ EQU   QCBSTAT1
QCBSNDRQ EQU   QCBSTAT1
QCBWAITC EQU   QCBSTAT1
QCBPLCBN EQU   QCBSTAT1
QCBCHAIN EQU   IEDNQCB
QCBPQBCK EQU   IEDQPQCB+25
QCBPRIPQ EQU   IEDQPQCB+24
QCBCFHDR EQU   IEDQPQCB+21
QCBLFEFO EQU   IEDQPQCB+18
QCBFFEFO EQU   IEDQPQCB+15
QCBPREVF EQU   QCBINTLF
QCBINTFF EQU   IEDQPQCB+9
QCBDATSQ EQU   QCBFHDTZ+1
@NM00173 EQU   QCBFHDTZ
@NM00172 EQU   QCBPFEFO
QCBDATFL EQU   QCBFHDLZ
QCBDNHDR EQU   IEDQPQCB
QCBQBACK EQU   IEDQQCB+37
QCBCKPT  EQU   QCBFLAG
QCBPROC  EQU   QCBFLAG
QCBSDFFO EQU   QCBFLAG
QCBTERMQ EQU   QCBFLAG
QCBRSRV  EQU   QCBFLAG
QCBREAD  EQU   QCBFLAG
QCBNOBRK EQU   QCBFLAG
QCBTSSES EQU   QCBFLAG
QCBLGBAD EQU   QCBDCBAD
QCBRELLN EQU   IEDQQCB+32
QCBTJID  EQU   QCBLKRRN+1
QCBCARCT EQU   QCBLKRRN
QCBPRLVL EQU   QCBPREN
QCBMSGCT EQU   IEDQQCB+26
QCBEXTO  EQU   QCBINTVL
QCBDISC  EQU   QCBTSOF1
QCBDELAY EQU   QCBTSOF1
QCBPARTO EQU   QCBTSOF1
QCBSATRD EQU   QCBTSOF1
QCBNOBUF EQU   QCBTSOF1
QCBTPUT  EQU   QCBTSOF1
QCBTGET  EQU   QCBTSOF1
QCBWRBRK EQU   QCBTSOF1
QCBSATLC EQU   QCBTSOF2
QCBSATTI EQU   QCBTSOF2
QCBSATCH EQU   QCBTSOF2
QCBSIMRD EQU   QCBTSOF2
QCBDSSMI EQU   QCBTSOF2
QCBPOSTO EQU   QCBTSOF2
QCBBUFQ  EQU   QCBTSOF2
QCBINHBN EQU   QCBTSOF2
QCBSATCT EQU   @NM00171
QCBSCBOF EQU   IEDQQCB+20
QCBTIME  EQU   QCBSTAT
QCBCLOCK EQU   QCBSTAT
QCBSCHDL EQU   QCBSTAT
QCBSMODE EQU   QCBSTAT
QCBSEND  EQU   QCBSTAT
QCBBUFRD EQU   QCBSTAT
QCBTRMHO EQU   QCBSTAT
QCBEOM   EQU   QCBSTAT
QCBHUCT  EQU   QCBRETCT
QCBIEND  EQU   QCBRETCT
QCBEND   EQU   QCBRETCT
QCBNL    EQU   QCBRETCT
QCBLOGCT EQU   QCBRETCT
@NM00170 EQU   QCBBYTE1
QCBRITRM EQU   QCBBYTE1
@NM00169 EQU   QCBEOLDT
QCBSLINK EQU   IEDQQCB+13
QCBSTPRI EQU   IEDQQCB+12
QCBSTCHN EQU   IEDQQCB+9
QCBSTVTO EQU   IEDQQCB+8
QCBLINK  EQU   IEDQQCB+5
QCBPRI   EQU   IEDQQCB+4
QCBCNTEN EQU   QCBELCHN+2
@NM00168 EQU   QCBELCHN+2
@NM00167 EQU   QCBELCHN
QCBHELD  EQU   QCBDSFLG
QCBFQCB  EQU   QCBDSFLG
QCBDRQQ  EQU   QCBDSFLG
QCBALTMH EQU   QCBDSFLG
QCBREUS  EQU   QCBDISK
QCBNREUS EQU   QCBDISK
QCBCORE  EQU   QCBDSFLG
QCBTSQ   EQU   QCBDSFLG
PRF2SEQP EQU   PRF2WD2
@NM00166 EQU   IEDPF2+1
@NM00165 EQU   PRF2FLG2
PRF2TERM EQU   PRF2FLG2
PRF2SMI  EQU   PRF2FLG2
PRF2FORM EQU   PRF2FLG2
PRF2TNTI EQU   PRF2FLG2
PRF1RULN EQU   PRF1SEQP+2
PRF1TAG2 EQU   PRF1SQID+1
@NM00164 EQU   PRF1TAG1
PRF1TAGS EQU   PRF1TAG1
@NM00163 EQU   PRF1FLG1
PRF1LOGD EQU   PRF1FLG1
PRF1USS  EQU   PRF1FLG1
PRF1FORM EQU   PRF1FLG1
PRF1EXPI EQU   PRF1FLG1
PRF1FIDI EQU   PRF1FLG1
PRF1RH   EQU   IEDPF1
PRFDEST  EQU   IEDQPRF+40
PRFISEQ  EQU   IEDQPRF+38
PRFSTXT  EQU   PRFHQBCK
PRFNHDR  EQU   PRFCHDR
PRFCRCD  EQU   IEDQPRF+29
PRFSVSEQ EQU   PRFNTXT+1
PRFSVPRI EQU   PRFEOBOF
PRFISIZE EQU   PRFSCAN+1
@NM00162 EQU   PRFSCAN
PRFEOB   EQU   PRFXTRA+1
PRFSTSO  EQU   PRFXTRA
PRFNHDRN EQU   PRFSTAT1
PRFNLSTN EQU   PRFSTAT1
PRFLOCK  EQU   PRFEOFN
PRFDUPLN EQU   PRFSTAT1
PRFTSMSG EQU   PRFSTAT1
PRFITCPN EQU   PRFSTAT1
PRFERMGN EQU   PRFSTAT1
PRFCNCLN EQU   PRFSTAT1
PRFSVFLG EQU   @NM00161+3
PRFSIZE  EQU   PRFSVFFO+2
PRFSRCE  EQU   PRFSVFFO
PRFLCB   EQU   IEDQPRF+13
PRFPIUO  EQU   PRFPLQCB
PRFTI0   EQU   PRFTIC+1
@NM00160 EQU   PRFTICC
@NM00159 EQU   PRFTICC
@NM00158 EQU   PRFTICC
PRFTICON EQU   PRFTICC
@NM00157 EQU   PRFTICC
@NM00156 EQU   PRFTICC
PRFBFMM  EQU   PRFTICC
PRFEOMSG EQU   PRFTICC
PRFCOUNT EQU   PRFLINK+1
@NM00155 EQU   PRFLINK
PRFFLAGS EQU   PRFPRI
PRFIOADR EQU   PRFQCBA
PRFOPCDE EQU   PRFKEY
@NM00154 EQU   OPREFLG3
OPREATCH EQU   OPREFLG3
@NM00153 EQU   OPREFLG3
OPREFLG2 EQU   IEDOPRED+13
OPREFLG1 EQU   IEDOPRED+12
OPRETIC  EQU   OPRESAVE
OPRELINK EQU   IEDOPRED+5
OPREKEY  EQU   IEDOPRED
OPCBOTTM EQU   IEDQOPCD+1188
OPCDSRWT EQU   IEDQOPCD+1184
@NM00152 EQU   IEDQOPCD+1100
@NM00151 EQU   IEDQOPCD+948
@NM00150 EQU   IEDQOPCD+940
@NM00149 EQU   IEDQOPCD+380
@NM00148 EQU   OPCPWCOB+9
@NM00147 EQU   OPCPWCOB+8
@NM00146 EQU   OPCPWECB+1
OPCPWCCC EQU   OPCPWECB
OPCPWCHN EQU   OPCPWQCB+1
OPCPWVTO EQU   OPCPWQCB
OPCTOTCK EQU   IEDQOPCD+360
OPCAPXTL EQU   IEDQOPCD+356
OPCDECR  EQU   IEDQOPCD+352
OPCBUFWT EQU   IEDQOPCD+348
OPCADGOT EQU   IEDQOPCD+318
OPCRQCNT EQU   IEDQOPCD+316
OPPOLSTP EQU   IEDQOPCD+312
OPCCKCIB EQU   IEDQOPCD+308
OPCEND   EQU   IEDQOPCD+307
OPCSTCBS EQU   IEDQOPCD+306
OPCHNEND EQU   IEDQOPCD+302
OPCOQSW  EQU   IEDQOPCD+301
@NM00145 EQU   OPCSPEC
@NM00144 EQU   OPCSPEC
@NM00143 EQU   OPCSPEC
@NM00142 EQU   OPCSPEC
OPCFRMCA EQU   OPCSPEC
OPCRSTRT EQU   OPCSPEC
OPCPART  EQU   OPCSPEC
OPCALTD  EQU   OPCSPEC
OPCBFEND EQU   IEDQOPCD+296
OPCBFIRS EQU   IEDQOPCD+292
OPCAVBUF EQU   IEDQOPCD+290
OPCIPLCT EQU   IEDQOPCD+289
OPCCLNTS EQU   IEDQOPCD+288
OPCHA8   EQU   IEDQOPCD+286
OPCBFREQ EQU   IEDQOPCD+284
OPCNEXT  EQU   IEDQOPCD+272
OPCFMDFC EQU   IEDQOPCD+268
OPCSCNC  EQU   IEDQOPCD+264
OPCHORTG EQU   IEDQOPCD+260
OPCCKPTL EQU   IEDQOPCD+252
OPCCKPTF EQU   IEDQOPCD+248
OPCWAITA EQU   IEDQOPCD+244
OPCWAITR EQU   IEDQOPCD+240
OPCWAITP EQU   IEDQOPCD+236
OPCWAITO EQU   IEDQOPCD+232
OPCWAITN EQU   IEDQOPCD+228
OPCWAITL EQU   IEDQOPCD+224
OPCWAITC EQU   IEDQOPCD+220
@NM00141 EQU   OPCLDNME+5
@NM00140 EQU   OPCLDNME
OPCWAIT  EQU   IEDQOPCD+192
OPCCKERB EQU   IEDQOPCD+164
OPCBFERB EQU   IEDQOPCD+148
OPCFLAG2 EQU   IEDQOPCD+147
OPCWRKSZ EQU   IEDQOPCD+144
OPCWORK  EQU   IEDQOPCD+140
OPCRSAVE EQU   IEDQOPCD+132
OPCQCBAD EQU   IEDQOPCD+128
OPCTRMWA EQU   IEDQOPCD+52
OPCPSTWT EQU   IEDQOPCD+48
OPCTNTEA EQU   IEDQOPCD+44
OPCPGCK  EQU   IEDQOPCD+40
OPCLCB   EQU   IEDQOPCD+36
@NM00139 EQU   IEDQOPCD+32
OPCIPLAD EQU   IEDQOPCD+28
OPCTOFLK EQU   IEDQOPCD+24
OPCOPTLK EQU   IEDQOPCD+20
OPCDCBLK EQU   IEDQOPCD+16
OPCDOUBL EQU   IEDQOPCD
@NM00138 EQU   OCLDNME+4
@NM00137 EQU   OCPREFLG
OCTOTEP  EQU   OCPREFLG
OCREPOST EQU   OCPREFLG
OCRSPSNT EQU   OCPREFLG
OCBFREQ  EQU   OCPREFLG
OCIDLE   EQU   OCREQFLG
OCFORCE  EQU   OCREQFLG
OCDCARD  EQU   OCREQFLG
OCPARTAL EQU   OCREQFLG
OCADNCP  EQU   OCREQFLG
@NM00136 EQU   OCREQFLG
@NM00135 EQU   OCREQFLG
OCRESPCT EQU   OCLINTTE
OCCKPTWA EQU   OCCKDATA+4
@NM00132 EQU   OCRSTGTM+2
OCCKDAT2 EQU   OCRSTGTM+1
OCCKDAT1 EQU   OCRSTGTM
OCPUADR  EQU   OCIPLWA+2
OCWTGSAV EQU   OCIPLWA
OCDVRDCT EQU   OCBACKUP+6
OCNCP    EQU   OCBACKUP+4
OCBUFGOT EQU   OCBACKUP+2
OCBUFNED EQU   OCBACKUP
OCRESNUM EQU   OCPARM
OCSEQ    EQU   OCTRUNIT+2
@NM00131 EQU   OCRSID+1
OCREDRVE EQU   OCALSTAT
OCSEQIND EQU   OCALSTAT
@NM00130 EQU   @NM00129+2
OCCONID  EQU   OCDEST
OCRLN    EQU   IEDQOPCE+15
OCSSCP   EQU   OCFLAG
OCOUTPUT EQU   OCFLAG
OCLINE   EQU   OCFLAG
OCMPP    EQU   OCFLAG
OCCONSOL EQU   OCFLAG
@NM00128 EQU   OCSWITCH
OCQUCKN  EQU   OCSWITCH
OCPRIFLG EQU   OCOPTCDE
@NM00127 EQU   OCRUDEST+1
@NM00126 EQU   OCSCAN
OCNOTUCB EQU   OCSCAN
OCNONAME EQU   OCSCAN
OCALLRLN EQU   OCSCAN
OCDDNAME EQU   OCSCAN
OCDDNRLN EQU   OCSCAN
OCADDR   EQU   OCSCAN
OCELMPRI EQU   OCELEM
@NM00125 EQU   NSLGRPNM+4
NSLOPCEP EQU   NSLGRPNM
@NM00124 EQU   IEDNSLD+34
NSLUNCNT EQU   NSLERB+12
NSLBUFFR EQU   NSLERB+9
@NM00123 EQU   NSLESTAT
NSLMPPI  EQU   NSLESTAT
@NM00122 EQU   NSLESTAT
NSLELINK EQU   NSLERB+5
NSLERBPR EQU   NSLERB+4
NSLERQCB EQU   NSLERB
NSLTTCIN EQU   IEDNSLD+16
NSLCTTRM EQU   IEDNSLD+13
@NM00121 EQU   NSLGPCUS
NSLDRDRV EQU   NSLGPCUS
NSLSDIAL EQU   NSLGPCUS
NSLNGPSL EQU   NSLGPCUS
NSLGPTSP EQU   NSLGPCUS
NSLNGPST EQU   NSLGPCUS
NSLSAVE  EQU   IEDNSLD+9
@NM00120 EQU   NSLPLCB
NSLPLCBR EQU   NSLPLCB
NSLOPRE  EQU   IEDNSLD
NSLSAVE2 EQU   IEDNNSLD+4
NSLSAVE1 EQU   IEDNNSLD
UCBERADR EQU   UCBUCS+12
UCBFCBID EQU   UCBUCS+8
UCBERCNT EQU   UCBUCS+7
UCBRSV51 EQU   UCBUCS+6
UCBRSV50 EQU   UCBFCBOP
UCBRSV49 EQU   UCBFCBOP
UCBRSV48 EQU   UCBFCBOP
UCBRSV47 EQU   UCBFCBOP
UCBRSV46 EQU   UCBFCBOP
UCBRSV45 EQU   UCBFCBOP
UCBRSV44 EQU   UCBFCBOP
UCBFCBO1 EQU   UCBFCBOP
UCBUCSPE EQU   UCBUCSOP
UCBRSV43 EQU   UCBUCSOP
UCBRSV42 EQU   UCBUCSOP
UCBRSV41 EQU   UCBUCSOP
UCBRSV40 EQU   UCBUCSOP
UCBRSV39 EQU   UCBUCSOP
UCBUCSO2 EQU   UCBUCSOP
UCBUCSO1 EQU   UCBUCSOP
UCBUCSID EQU   UCBUCS
UCBMDRBA EQU   UCBMDRBF+1
UCBRV075 EQU   UCBMDRBF
UCBRV074 EQU   UCB3800X+32
UCBIMAGE EQU   UCB3800X+28
UCBFCBNM EQU   UCB3800X+24
UCBCHAR4 EQU   UCB3800X+20
UCBCHAR3 EQU   UCB3800X+16
UCBCHAR2 EQU   UCB3800X+12
UCBCHAR1 EQU   UCB3800X+8
UCBCGMID EQU   UCB3800X+4
UCBBRSTA EQU   UCBACTIV
UCBRV063 EQU   UCBACTIV
UCBRV062 EQU   UCBACTIV
UCBRV061 EQU   UCBACTIV
UCBRV060 EQU   UCBACTIV
UCBRV059 EQU   UCBACTIV
UCBRV058 EQU   UCBACTIV
UCBRV057 EQU   UCBACTIV
UCBRV050 EQU   UCB3800X+2
UCBCGMNO EQU   UCB3800X+1
UCBRV083 EQU   UCBOPTNS
UCBBRSTR EQU   UCBOPTNS
UCBRV056 EQU   UCBOPTNS
UCBRV055 EQU   UCBOPTNS
UCBRV054 EQU   UCBOPTNS
UCBRV053 EQU   UCBOPTNS
UCBRV052 EQU   UCBOPTNS
UCBRV051 EQU   UCBOPTNS
UCBRV073 EQU   UCB3540X+7
UCBRV072 EQU   UCBDKBYT
UCBRV071 EQU   UCBDKBYT
UCBRV070 EQU   UCBDKBYT
UCBRV069 EQU   UCBDKBYT
UCBRV068 EQU   UCBDKBYT
UCBRV067 EQU   UCBDKBYT
UCBVLVER EQU   UCBDKBYT
UCBDKAMX EQU   UCBDKBYT
UCBVLSER EQU   UCB3540X
UCBRDATA EQU   UCBOCR+4
UCBFRID  EQU   UCBOCR
UCBCLN   EQU   UCBMT+14
UCBERG   EQU   UCBMT+12
UCBMS    EQU   UCBMT+11
UCBNB    EQU   UCBMT+10
UCBPW    EQU   UCBMT+9
UCBPR    EQU   UCBMT+8
UCBSIO   EQU   UCBMT+6
UCBTW    EQU   UCBMT+5
UCBTR    EQU   UCBMT+4
UCBTWT   EQU   UCBMT+3
UCBTRT   EQU   UCBMT+2
UCBCTD   EQU   UCBMT
UCBWTOID EQU   UCBCMEXT+17
UCBRV043 EQU   UCBCMEXT+16
UCBASID  EQU   UCBCMEXT+14
UCBMFCNT EQU   UCBCMEXT+12
UCBPMSK  EQU   UCBCMEXT+10
UCBCCWOF EQU   UCBCMEXT+8
UCBRV041 EQU   UCBCMEXT+6
UCBRV036 EQU   UCBFLP1
UCBRV035 EQU   UCBFLP1
UCBERLOG EQU   UCBFLP1
UCBRV033 EQU   UCBFLP1
UCBRV032 EQU   UCBFLP1
UCBRV031 EQU   UCBFLP1
UCBSHRUP EQU   UCBFLP1
UCBNSRCH EQU   UCBFLP1
UCBSNSCT EQU   UCBCMEXT+4
UCBHPDV  EQU   @NM00119
UCBHALI  EQU   @NM00119
UCBRSV09 EQU   @NM00119
UCBRSV08 EQU   @NM00119
UCBRSV07 EQU   @NM00119
UCBRSV06 EQU   @NM00119
UCBRSV05 EQU   @NM00119
UCBRSV04 EQU   @NM00119
UCBDTI   EQU   UCBCMEXT+2
UCBSTI   EQU   UCBCMEXT+1
UCBETI   EQU   UCBCMEXT
UCBEXTP  EQU   UCBEXTPT+1
UCBDDRSW EQU   UCBFLC
UCBTICBT EQU   UCBFLC
UCBIVRR  EQU   UCBFLC
UCBIVRS  EQU   UCBFLC
UCBITF   EQU   UCBFLC
UCBUDE   EQU   UCBFLC
UCBWAA   EQU   UCBFLC
UCBATTP  EQU   UCBFLC
UCBUNTYP EQU   UCBTBYT4
UCBRSV11 EQU   UCBDVCLS
UCBRSV10 EQU   UCBDVCLS
UCB3CHAR EQU   UCBDVCLS
UCB3UREC EQU   UCBDVCLS
UCB3DISP EQU   UCBDVCLS
UCB3DACC EQU   UCBDVCLS
UCB3COMM EQU   UCBDVCLS
UCB3TAPE EQU   UCBDVCLS
UCBDVPWR EQU   UCB2OPT7
UCBVLPWR EQU   UCB2OPT6
UCB2OPT5 EQU   UCBTBYT2
UCBRVDEV EQU   UCBRWTAU
UCBRPS   EQU   UCBDUDN2
UCBRR    EQU   UCBDUDN1
UCB2OPT1 EQU   UCBTBYT2
UCB2OPT0 EQU   UCBTBYT2
UCB1FEA7 EQU   UCBTBYT1
UCBD6250 EQU   UCB1FEA6
UCBD1600 EQU   UCB1FEA5
UCB1FEA4 EQU   UCBTBYT1
UCB1FEA3 EQU   UCBTBYT1
UCB1FEA2 EQU   UCBTBYT1
UCB1FEA1 EQU   UCBTBYT1
UCB1FEA0 EQU   UCBTBYT1
UCBRV029 EQU   UCBWGT
UCBVHRSN EQU   UCBWGT
UCBVORSN EQU   UCBWGT
UCBMTPXP EQU   UCBWGT
UCBREW   EQU   UCBWGT
UCBPUB   EQU   UCBWGT
UCBOUT   EQU   UCBWGT
UCBIN    EQU   UCBWGT
UCBCPU   EQU   UCBOB+11
UCBLCI   EQU   UCBOB+10
UCBCNT   EQU   UCBOB+9
UCBRV017 EQU   UCBCHM1
UCBRV016 EQU   UCBCHM1
UCBRV015 EQU   UCBCHM1
UCBRV014 EQU   UCBCHM1
UCBSPB   EQU   UCBPTH1
UCBPPB   EQU   UCBPTH1
UCBSPA   EQU   UCBPTH0
UCBPPA   EQU   UCBPTH0
UCBSIGP  EQU   UCBFLB
UCBVALPH EQU   UCBFLB
UCBCRHSN EQU   UCBFLB
UCBCRHRV EQU   UCBFLB
UCBRESVH EQU   UCBFLB
UCBSPST  EQU   UCBFLB
UCBASNS  EQU   UCBFLB
UCBIORST EQU   UCBFLB
UCBQISCE EQU   UCBFL1
UCBACTV  EQU   UCBFL1
UCBSAP   EQU   UCBFL1
UCBNOTRC EQU   UCBCUB
UCBPSNS  EQU   UCBFL1
UCBUSING EQU   UCBPST
UCBNOTRD EQU   UCBNRY
UCBBUSYD EQU   UCBBSY
UCBUA    EQU   UCBCHAN+1
UCBCHA   EQU   UCBCHAN
UCBDADI  EQU   UCBSTAT
UCBSYSR  EQU   UCBSTAT
UCBPRES  EQU   UCBSTAT
UCBALOC  EQU   UCBSTAT
UCBUNLD  EQU   UCBSTAT
UCBRESV  EQU   UCBSTAT
UCBCHGS  EQU   UCBSTAT
UCBONLI  EQU   UCBSTAT
UCBID    EQU   UCBOB+2
UCBALTPH EQU   UCBFL5
UCBALTCU EQU   UCBFL5
UCBNALOC EQU   UCBFL5
UCBENVRD EQU   UCBFL5
UCBVSDR  EQU   UCBFL5
UCBSASK  EQU   UCBFL5
UCBAMV   EQU   UCBAF
UCBDCC   EQU   UCBFL5
UCBMONT  EQU   UCBJBNR
UCBRV011 EQU   UCBJBNR
UCBRSV02 EQU   UCBJBNR
UCBOLDSM EQU   UCBJBNR
UCBRV003 EQU   UCBJBNR
UCBDUC   EQU   UCBJBNR
UCBJES3  EQU   UCBJBNR
UCBVRDEV EQU   UCBJBNR
UCBCMSEG EQU   UCBOB
UCBPFXND EQU   UCB+512
UCBIOQ   EQU   UCB+508
UCBLOCK  EQU   UCB+504
UCBPXST  EQU   UCB+504
@NM00116 EQU   UCB
DEBAPPAD EQU   IEDQDEB+65
DEBEXSCL EQU   IEDQDEB+64
DEBDCBAD EQU   IEDQDEB+61
DEBPROTG EQU   IEDQDEB+60
DEBECBAD EQU   IEDQDEB+57
DEBPRIOR EQU   IEDQDEB+56
DEBUSRPG EQU   IEDQDEB+53
DEBSYSPG EQU   IEDQDEB+49
DEBOPATB EQU   IEDQDEB+48
DEBIRBAD EQU   IEDQDEB+45
DEBOFLGS EQU   IEDQDEB+44
DEBDEBAD EQU   IEDQDEB+41
DEBAMLNG EQU   IEDQDEB+40
DEBTCBAD EQU   IEDQDEB+37
@NM00115 EQU   DEBPRF+33
DEBLNGTH EQU   DEBPRF+32
DEBDCBMK EQU   DEBPRF+28
DEBDSCBA EQU   DEBPRF+21
DEBWKARA EQU   DEBPRF+20
DEBXCEA  EQU   DEBAPVT+16
DEBCEA   EQU   DEBAPVT+12
DEBPCIA  EQU   DEBAPVT+8
DEBSIOA  EQU   DEBAPVT+4
DEBEOEA  EQU   DEBAPVT
DCBBUFSI EQU   IHADCS43+6
DCBUNTCT EQU   IHADCS43+5
DCBILCT  EQU   IHADCS43+4
DCBSCTAD EQU   DCBSCTAB+1
@NM00114 EQU   DCBSCTAB
DCBPUTA  EQU   DCBGETA
@NM00113 EQU   DCBPUT
DCBDEBA  EQU   DCBDEBAD+1
@NM00112 EQU   DCBIFLGS
DCBIFIOE EQU   DCBIFLGS
DCBCH12  EQU   DCBIFPCT
DCBCH9   EQU   DCBIFPCT
DCBIFEC  EQU   DCBIFLGS
DCBMFSTI EQU   DCBMFDMD
DCBMFAWR EQU   DCBMFSTK
DCBMFUIP EQU   DCBMFTMD
DCBMFIDW EQU   DCBMFLCP
DCBMFWRK EQU   DCBMFMVP
DCBMFRDQ EQU   DCBMFWRT
DCBMFGTQ EQU   DCBMFPUT
DCBMFSTL EQU   DCBMACF2
DCBMFCK  EQU   DCBMFDMG
DCBMFRDX EQU   DCBMFCHK
DCBMFDBF EQU   DCBMFSBG
DCBMFRDI EQU   DCBMFLCG
DCBMFRDK EQU   DCBMFMVG
DCBMFWRQ EQU   DCBMFRD
DCBMFPTQ EQU   DCBMFGET
DCBMFECP EQU   DCBMACF1
DCBTIOT  EQU   IHADCS25
DCBMRSTI EQU   DCBMRDMD
DCBMRAWR EQU   DCBMRSTK
DCBMRUIP EQU   DCBMRTMD
DCBMRIDW EQU   DCBMRLCP
DCBMRWRK EQU   DCBMRMVP
DCBMRRDQ EQU   DCBMRWRT
DCBMRGTQ EQU   DCBMRPUT
DCBMRSTL EQU   DCBMACR2
DCBMRCK  EQU   DCBMRDMG
DCBPGFXA EQU   DCBMRRDX
DCBMRDBF EQU   DCBMRSBG
DCBMRRDI EQU   DCBMRLCG
DCBMRRDK EQU   DCBMRMVG
DCBMRWRQ EQU   DCBMRRD
DCBMRPTQ EQU   DCBMRGET
DCBMRECP EQU   DCBMACR1
@NM00111 EQU   DCBIFLG
DCBIBIOE EQU   DCBIFLG
DCBICH12 EQU   DCBIBPCT
DCBICH9  EQU   DCBIBPCT
DCBIBEC  EQU   DCBIFLG
DCBOFIOF EQU   DCBOFLGS
DCBOFUEX EQU   DCBOFLGS
DCBOFTM  EQU   DCBOFLGS
DCBOFPPC EQU   DCBOFLGS
DCBOFOPN EQU   DCBOFLGS
DCBOFEOV EQU   DCBOFLGS
DCBOFLRB EQU   DCBOFLGS
DCBOFIOD EQU   DCBOFLWR
DCBDDNAM EQU   IHADCS24
DCBEXLSA EQU   DCBEXLST+1
DCBEIOBX EQU   DCBEXLST
DCBRNCKA EQU   DCBRNCKD+1
@NM00110 EQU   DCBRNCKD
DCBIOBAD EQU   IHADCS2K+8
DCBDSGTR EQU   DCBDSRG2
@NM00109 EQU   DCBDSRG2
DCBDSRG1 EQU   DCBDSORG
DCBCHNGL EQU   DCBTRSTA
DCBNIDLE EQU   DCBTRSTA
DCBBAKUP EQU   DCBTRSTA
DCBIPLED EQU   DCBTRSTA
DCBRSTRT EQU   DCBTRSTA
DCBINITL EQU   DCBTRSTA
DCBAUTOD EQU   DCBTRSTA
DCBAUTOI EQU   DCBTRSTA
@NM00108 EQU   IHADCS2K+4
DCBDUMPA EQU   DCBDUMPD+1
DCBUNITN EQU   DCBDUMPD
DCBBCKUA EQU   DCBBCKUP+1
@NM00107 EQU   DCBBCKUP
DCBIPLTX EQU   IHADCS1A
@NM00106 EQU   IHADCB
SAVTLLCB EQU   IEDNSVTD+316
SAVTBITN EQU   IEDNSVTD+312
@NM00105 EQU   SAVTCKQB+8
@NM00104 EQU   SAVTCKEC+1
@NM00103 EQU   SAVTCKCC
SAVTCKPO EQU   SAVTCKCC
SAVTCKWA EQU   SAVTCKCC
SAVTCKCH EQU   SAVTCKTB+1
SAVTCKVT EQU   SAVTCKTB
@NM00102 EQU   IEDNSVTD+297
SAVTRDFG EQU   SAVTRDRV+12
@NM00101 EQU   SAVTRDRV+5
SAVTRDPY EQU   SAVTRDRV+4
SAVTRDQB EQU   SAVTRDRV+1
SAVTRDKY EQU   SAVTRDRV
SAVTNID  EQU   IEDNSVTD+280
SAVTDVAS EQU   IEDNSVTD+276
SAVTPLSZ EQU   IEDNSVTD+274
@NM00100 EQU   IEDNSVTD+273
SAVTSUBL EQU   IEDNSVTD+272
@NM00099 EQU   SAVTZELM+1
SAVTSUBM EQU   SAVTZELM
SAVTMHDX EQU   IEDNSVTD+268
SAVTNAT1 EQU   IEDNSVTD+266
SAVTSH20 EQU   IEDNSVTD+264
SAVTLCBS EQU   IEDNSVTD+260
SAVTRNMP EQU   IEDNSVTD+256
SAVTTNTX EQU   IEDNSVTD+252
SAVTNAX  EQU   IEDNSVTD+248
SAVTSUBV EQU   IEDNSVTD+247
SAVTSUBA EQU   IEDNSVTD+246
SAVTSIBC EQU   IEDNSVTD+244
SAVTBSM  EQU   IEDNSVTD+240
SAVTSCPT EQU   SAVTTCPU
SAVTRQTG EQU   IEDNSVTD+236
SAVTRQCH EQU   IEDNSVTD+232
SAVTMAND EQU   IEDNSVTD+228
SAVTNADL EQU   IEDNSVTD+222
SAVTNATL EQU   IEDNSVTD+220
SAVTMHTB EQU   IEDNSVTD+216
SAVTSSMH EQU   IEDNSVTD+212
SAVTQRS  EQU   IEDNSVTD+208
SAVTRQIN EQU   IEDNSVTD+204
SAVTDFCO EQU   IEDNSVTD+200
SAVTSAO  EQU   IEDNSVTD+196
SAVTSARI EQU   IEDNSVTD+192
SAVTSAC  EQU   IEDNSVTD+188
SAVTSAI  EQU   IEDNSVTD+184
SAVTCSCI EQU   IEDNSVTD+180
SAVTSSRP EQU   IEDNSVTD+176
SAVTSSRQ EQU   IEDNSVTD+172
SAVTSCLU EQU   IEDNSVTD+168
SAVTXTRQ EQU   IEDNSVTD+164
SAVTMVBF EQU   IEDNSVTD+160
@NM00098 EQU   IEDNSVTD+148
SAVTIPCQ EQU   IEDNSVTD+144
@NM00097 EQU   IEDNSVTD+136
SAVTXFMI EQU   IEDNSVTD+132
@NM00096 EQU   IEDNSVTD+124
SAVTXFMO EQU   IEDNSVTD+120
@NM00095 EQU   IEDNSVTD+116
SAVTSSSR EQU   IEDNSVTD+112
SAVTSCPQ EQU   IEDNSVTD+108
SAVTSLCB EQU   IEDNSVTD+104
SAVTLUSR EQU   IEDNSVTD+100
@NM00094 EQU   SAVTLUSQ+8
SAVTLUSP EQU   SAVTLUSQ+4
SAVTLUSB EQU   SAVTLUSQ
@NM00093 EQU   IEDNSVTD+84
SAVTSAT  EQU   IEDNSVTD+80
SAVTNAT  EQU   IEDNSVTD+76
SAVTCLUP EQU   IEDNSVTD+72
SAVTPIUT EQU   IEDNSVTD+68
SAVTRNTA EQU   IEDNSVTD+64
SAVTDNIR EQU   IEDNSVTD+60
SAVTCNIR EQU   IEDNSVTD+56
SAVTFLDH EQU   IEDNSVTD+52
SAVTSRTN EQU   IEDNSVTD+48
SAVTSREQ EQU   IEDNSVTD+44
SAVTFAIL EQU   IEDNSVTD+42
SAVTSUSE EQU   IEDNSVTD+40
SAVTSIB  EQU   IEDNSVTD+36
SAVTPRTN EQU   IEDNSVTD+32
@NM00092 EQU   IEDNSVTD+28
SAVTWH20 EQU   IEDNSVTD+26
SAVTPWT  EQU   IEDNSVTD+24
SAVTPRTQ EQU   IEDNSVTD+20
SAVTPREQ EQU   IEDNSVTD+16
SAVTPH20 EQU   IEDNSVTD+14
SAVTPUSE EQU   IEDNSVTD+12
SAVTPLCB EQU   IEDNSVTD+8
SAVTPOOL EQU   IEDNSVTD+4
SAVTPRMT EQU   SAVTDIAF
SAVTVIRT EQU   SAVTDIAF
AVTCPBNO EQU   IEDQAVTD+1244
AVTHRESS EQU   IEDQAVTD+1243
@NM00091 EQU   IEDQAVTD+1242
@NM00090 EQU   IEDQAVTD+1241
@NM00089 EQU   IEDQAVTD+1240
@NM00088 EQU   IEDQAVTD+1237
@NM00087 EQU   IEDQAVTD+1236
AVTHRESE EQU   @NM00086
AVTRADDR EQU   IEDQAVTD+1228
AVTNADDR EQU   IEDQAVTD+1224
AVTHRESN EQU   IEDQAVTD+1220
AVTVOLRN EQU   IEDQAVTD+1216
AVTTOTNN EQU   IEDQAVTD+1212
AVTTRCYN EQU   IEDQAVTD+1208
AVTRCTRN EQU   IEDQAVTD+1204
AVTNOVON EQU   IEDQAVTD+1200
AVTADEBN EQU   IEDQAVTD+1196
AVTVOLRR EQU   IEDQAVTD+1192
AVTTOTNR EQU   IEDQAVTD+1188
AVTTRCYR EQU   IEDQAVTD+1184
AVTRCTRR EQU   IEDQAVTD+1180
AVTNOVOR EQU   IEDQAVTD+1176
AVTADEBR EQU   IEDQAVTD+1172
AVTLODPT EQU   IEDQAVTD+1168
AVTIOBN  EQU   IEDQAVTD+1164
AVTIOBR  EQU   IEDQAVTD+1160
AVTCPBPT EQU   IEDQAVTD+1156
AVTFCPB  EQU   IEDQAVTD+1152
@NM00085 EQU   IEDQAVTD+1148
AVTINCPQ EQU   IEDQAVTD+1144
@NM00084 EQU   IEDQAVTD+1140
@NM00083 EQU   IEDQAVTD+1137
@NM00082 EQU   AVTBIT4
@NM00081 EQU   AVTBIT4
@NM00080 EQU   AVTBIT4
@NM00079 EQU   AVTBIT4
@NM00078 EQU   AVTBIT4
@NM00077 EQU   AVTBIT4
@NM00076 EQU   AVTBIT4
AVTRUFTN EQU   AVTBIT4
@NM00075 EQU   IEDQAVTD+1132
AVTNOBFQ EQU   IEDQAVTD+1128
@NM00074 EQU   IEDQAVTD+1124
AVTDKENQ EQU   IEDQAVTD+1120
@NM00073 EQU   IEDQAVTD+1116
AVTDKAPQ EQU   IEDQAVTD+1112
AVTCOPY  EQU   IEDQAVTD+1108
AVTIA    EQU   IEDQAVTD+1104
AVTFL    EQU   IEDQAVTD+1100
@NM00072 EQU   IEDQAVTD+1096
AVTNCPBQ EQU   IEDQAVTD+1092
AVTTOTNC EQU   IEDQAVTD+1088
AVTCMAX  EQU   IEDQAVTD+1084
AVTCMIN  EQU   IEDQAVTD+1080
AVTHM02  EQU   IEDQAVTD+1076
AVTOPCIN EQU   IEDQAVTD+1074
AVTDCTLN EQU   IEDQAVTD+1072
AVTOPMSK EQU   IEDQAVTD+1068
AVTDDFT  EQU   IEDQAVTD+1064
AVTSTEAL EQU   IEDQAVTD+1060
AVTOPTN  EQU   IEDQAVTD+1056
AVTDSKCT EQU   IEDQAVTD+1054
AVTCKRST EQU   IEDQAVTD+1053
AVTSTAN  EQU   AVTBIT3
AVTSTACN EQU   AVTBIT3
AVTSTAIN EQU   AVTBIT3
AVTSTAYN EQU   AVTBIT3
AVTOLTBN EQU   AVTBIT3
AVTTSAB  EQU   AVTBIT3
AVTRFULN EQU   AVTBIT3
AVTRECVN EQU   AVTBIT3
@NM00071 EQU   AVTBIT2
@NM00070 EQU   AVTBIT2
AVTOPEIN EQU   AVTBIT2
AVTSTRTN EQU   AVTBIT2
AVTTOPOL EQU   AVTBIT2
AVTCOPYN EQU   AVTBIT2
AVTREUSN EQU   AVTBIT2
AVTEXTSC EQU   AVTBIT2
AVTDISKN EQU   AVTBIT1
AVTQUCKN EQU   AVTBIT1
AVTCLOSN EQU   AVTBIT1
AVTREADN EQU   AVTBIT1
AVTDLAYN EQU   AVTBIT1
AVTAQTAN EQU   AVTBIT1
AVTTSON  EQU   AVTBIT1
AVTAPLKN EQU   AVTBIT1
AVTDUMBR EQU   IEDQAVTD+1048
AVTDLQX  EQU   IEDQAVTD+1046
AVTINTLV EQU   IEDQAVTD+1044
AVTSMCNT EQU   IEDQAVTD+1042
AVTAVFCT EQU   IEDQAVTD+1040
AVTOPCON EQU   IEDQAVTD+1038
AVTOPCNT EQU   IEDQAVTD+1036
AVTLNCNT EQU   IEDQAVTD+1034
AVTKEYLE EQU   IEDQAVTD+1032
AVTHA16  EQU   IEDQAVTD+1030
AVTHA7   EQU   IEDQAVTD+1028
AVTHA4   EQU   IEDQAVTD+1026
AVTHA3   EQU   IEDQAVTD+1024
AVTHA2   EQU   IEDQAVTD+1022
AVTGETMS EQU   IEDQAVTD+1021
@NM00069 EQU   IEDQAVTD+1020
AVTGETMD EQU   IEDQAVTD+1016
AVTGETMN EQU   IEDQAVTD+1012
AVTCWTOT EQU   IEDQAVTD+1008
AVTCWINT EQU   IEDQAVTD+956
AVTDTRAP EQU   IEDQAVTD+952
@NM00068 EQU   IEDQAVTD+950
@NM00067 EQU   AVTIOTR
AVTIOTRH EQU   AVTIOTR
AVTIOTRE EQU   AVTIOTR
@NM00066 EQU   AVTSUBT
AVTSUBPT EQU   AVTSUBT
AVTSUBON EQU   AVTSUBT
AVTAFE30 EQU   IEDQAVTD+944
AVTAFE20 EQU   IEDQAVTD+940
AVTAFE10 EQU   IEDQAVTD+936
AVTCWEC2 EQU   IEDQAVTD+932
AVTCWPM2 EQU   IEDQAVTD+928
AVTCWTS2 EQU   IEDQAVTD+927
AVTCWTS1 EQU   IEDQAVTD+926
AVTCWCLD EQU   AVTCWFL2
AVTCWRAP EQU   AVTCWFL2
@NM00065 EQU   AVTCWFL2
@NM00064 EQU   AVTCWFL2
@NM00063 EQU   AVTCWFL2
@NM00062 EQU   AVTCWFL2
@NM00061 EQU   AVTCWFL2
AVTCWACT EQU   AVTCWFL2
@NM00060 EQU   AVTCWFL1
@NM00059 EQU   AVTCWFL1
@NM00058 EQU   AVTCWFL1
@NM00057 EQU   AVTCWFL1
@NM00056 EQU   AVTCWFL1
@NM00055 EQU   AVTCWFL1
@NM00054 EQU   AVTCWFL1
AVTCOMWN EQU   AVTCWFL1
AVTCWEC1 EQU   IEDQAVTD+920
AVTCWPM1 EQU   IEDQAVTD+916
AVTCAREA EQU   IEDQAVTD+912
AVTFZERO EQU   IEDQAVTD+908
AVTCADDR EQU   IEDQAVTD+904
AVTCOREC EQU   IEDQAVTD+900
@NM00053 EQU   IEDQAVTD+892
AVTCPBCB EQU   IEDQAVTD+888
@NM00052 EQU   IEDQAVTD+880
AVTDSIOB EQU   IEDQAVTD+876
@NM00051 EQU   IEDQAVTD+868
AVTCPRMB EQU   IEDQAVTD+864
@NM00050 EQU   IEDQAVTD+856
AVTCLOSB EQU   IEDQAVTD+852
@NM00049 EQU   IEDQAVTD+844
AVTACTIB EQU   IEDQAVTD+840
@NM00048 EQU   IEDQAVTD+836
AVTOLTEB EQU   IEDQAVTD+832
AVTOLTCH EQU   AVTOLTQB+1
AVTOLTVT EQU   AVTOLTQB
@NM00047 EQU   AVTOPCQB+8
@NM00046 EQU   AVTOPCEC+1
@NM00045 EQU   AVTOPCCC
AVTOPCPO EQU   AVTOPCCC
AVTOPCWA EQU   AVTOPCCC
AVTOPCCH EQU   AVTOPCOB+1
AVTOPCVT EQU   AVTOPCOB
@NM00044 EQU   AVTCKPQB+9
AVTCKPTS EQU   AVTCKPQB+8
@NM00043 EQU   AVTCKPEC+1
@NM00042 EQU   AVTCKPCC
AVTCKPPO EQU   AVTCKPCC
AVTCKPWA EQU   AVTCKPCC
AVTCKPCH EQU   AVTCKPTB+1
AVTCKPVT EQU   AVTCKPTB
@NM00041 EQU   IEDQAVTD+796
AVTBFRTB EQU   IEDQAVTD+792
@NM00040 EQU   IEDQAVTD+788
AVTSELCH EQU   IEDQAVTD+785
AVTBFRTN EQU   AVTBFRFG
AVTBFREB EQU   IEDQAVTD+780
AVTTIMQ  EQU   IEDQAVTD+776
@NM00039 EQU   IEDQAVTD+772
AVTIMQPS EQU   IEDQAVTD+768
AVTINOUT EQU   IEDQAVTD+766
AVTREFTM EQU   IEDQAVTD+764
@NM00038 EQU   IEDQAVTD+752
AVTDELYB EQU   IEDQAVTD+748
AVTOCQPT EQU   IEDQAVTD+744
AVTTSOPT EQU   IEDQAVTD+740
AVTSUPPT EQU   IEDQAVTD+736
AVTCBQCB EQU   IEDQAVTD+732
AVTMSGS  EQU   IEDQAVTD+729
@NM00037 EQU   AVTSYSER
@NM00036 EQU   AVTSYSER
@NM00035 EQU   AVTSYSER
@NM00034 EQU   AVTSYSER
@NM00033 EQU   AVTSYSER
@NM00032 EQU   AVTSYSER
AVTCMAXN EQU   AVTSYSER
AVTCMINN EQU   AVTSYSER
AVT2260L EQU   IEDQAVTD+724
AVTABEPL EQU   AVTADBUF
AVTHFF   EQU   AVTCLRHI+2
@NM00031 EQU   AVTCLRHI
AVTCCLNK EQU   AVTCRELE+5
AVTCCPRI EQU   AVTCRELE+4
AVTCCQCB EQU   AVTCCELE+1
AVTCCKEY EQU   AVTCCELE
AVTDELAD EQU   IEDQAVTD+704
AVTDELEM EQU   IEDQAVTD+700
AVTBSX   EQU   AVTCKLNK
AVTOPETR EQU   AVTHG01
@NM00030 EQU   AVTCKBYT
AVTCKONQ EQU   AVTCKBYT
@NM00029 EQU   AVTCKBYT
@NM00028 EQU   AVTCKBYT
@NM00027 EQU   AVTCKBYT
@NM00026 EQU   AVTCKBYT
@NM00025 EQU   AVTCKBYT
@NM00024 EQU   AVTCKBYT
AVTOPERT EQU   IEDQAVTD+690
AVTOPXCL EQU   IEDQAVTD+688
AVTOPERL EQU   IEDQAVTD+687
@NM00023 EQU   IEDQAVTD+686
AVTCKTIM EQU   IEDQAVTD+684
AVTCKELV EQU   IEDQAVTD+682
AVTCPRCD EQU   IEDQAVTD+681
AVTWARMN EQU   AVTCKELF
AVTCRTLN EQU   AVTCKELF
AVTCPIPN EQU   AVTCKELF
AVTCCLCN EQU   AVTCKELF
AVTCINCN EQU   AVTCKELF
@NM00022 EQU   AVTCKELF
AVTCMCPN EQU   AVTCKELF
AVTNQBCK EQU   AVTCKELF
AVTCKQAD EQU   IEDQAVTD+677
AVTSCBSZ EQU   IEDQAVTD+676
@NM00021 EQU   IEDQAVTD+672
AVTCKELE EQU   IEDQAVTD+668
@NM00020 EQU   AVTCKPEL+8
AVTCKRLK EQU   AVTCKPEL+5
AVTCKRPR EQU   AVTCKPEL+4
AVTCKRMQ EQU   AVTCKRMV+1
AVTCKRKY EQU   AVTCKRMV
AVTHK    EQU   IEDQAVTD+648
AVTHI    EQU   IEDQAVTD+644
AVTIOT   EQU   IEDQAVTD+640
AVTNX    EQU   IEDQAVTD+636
AVTTONE  EQU   IEDQAVTD+632
AVTA3TL  EQU   IEDQAVTD+628
AVTDMECB EQU   IEDQAVTD+624
AVTABEND EQU   IEDQAVTD+618
AVTPLCBN EQU   IEDQAVTD+616
@NM00019 EQU   AVTSAVTP+1
@NM00018 EQU   AVTSAVTF
AVTSNA   EQU   AVTSAVTF
AVTONSNA EQU   AVTSAVTF
AVTVTMCP EQU   AVTSAVTF
@NM00017 EQU   IEDQAVTD+608
AVTCMBSS EQU   IEDQAVTD+604
AVTRCV   EQU   IEDQAVTD+600
AVTSEND  EQU   IEDQAVTD+596
AVTCSCH  EQU   IEDQAVTD+592
AVTQ1    EQU   IEDQAVTD+588
AVTE7    EQU   IEDQAVTD+584
AVTHB    EQU   IEDQAVTD+580
AVTR1    EQU   IEDQAVTD+576
AVTBZ    EQU   IEDQAVTD+572
AVTEZ    EQU   IEDQAVTD+568
AVTEC    EQU   IEDQAVTD+564
AVTEW    EQU   IEDQAVTD+560
AVTNDIAL EQU   AVTSCOPT
AVTN2741 EQU   AVTSCOPT
AVTCONCO EQU   AVTSCOPT
AVTCONC  EQU   AVTSCOPT
AVTCMBUF EQU   AVTSCOPT
AVTAPDMP EQU   AVTSCOPT
@NM00016 EQU   AVTSCOPT
AVTHA    EQU   AVTDISP
AVTEA    EQU   IEDQAVTD+548
AVTAX    EQU   IEDQAVTD+544
AVTA3    EQU   IEDQAVTD+540
AVTGD    EQU   IEDQAVTD+536
AVTAL    EQU   IEDQAVTD+532
AVTOLTST EQU   AVTHG02
AVTE8    EQU   IEDQAVTD+524
AVTUI    EQU   IEDQAVTD+520
AVTCOMPT EQU   IEDQAVTD+516
AVTCRSRF EQU   IEDQAVTD+512
@NM00015 EQU   IEDQAVTD+508
AVTKA02  EQU   IEDQAVTD+504
AVTOPTPT EQU   IEDQAVTD+500
AVTPCBPT EQU   IEDQAVTD+496
@NM00014 EQU   AVTECB1
AVTCOMP  EQU   AVTECB1
@NM00013 EQU   AVTECB1
AVTOPECA EQU   IEDQAVTD+488
AVTOLECA EQU   IEDQAVTD+484
AVTCKECA EQU   IEDQAVTD+480
AVTCWECA EQU   IEDQAVTD+476
AVTCWTCB EQU   IEDQAVTD+472
AVTOLTCB EQU   IEDQAVTD+468
AVTOCTCB EQU   IEDQAVTD+464
AVTCKTCB EQU   IEDQAVTD+460
AVTAS    EQU   IEDQAVTD+456
AVTNOLBF EQU   IEDQAVTD+454
AVTNCKPR EQU   IEDQAVTD+453
AVTCIB   EQU   IEDQAVTD+452
AVTSPLPT EQU   IEDQAVTD+448
AVTMVBFR EQU   IEDQAVTD+444
AVTSBTA  EQU   IEDQAVTD+440
AVTRARTN EQU   IEDQAVTD+436
AVTBSCAN EQU   IEDQAVTD+432
AVTRDYA  EQU   IEDQAVTD+428
AVTDISTR EQU   IEDQAVTD+420
AVTPARM3 EQU   IEDQAVTD+416
@NM00012 EQU   AVTPKF
@NM00011 EQU   AVTPKF
@NM00010 EQU   AVTPKF
AVTFTCHF EQU   AVTPKF
@NM00009 EQU   AVTPKF
@NM00008 EQU   AVTPKF
@NM00007 EQU   AVTPKF
@NM00006 EQU   AVTPKF
AVTPARM  EQU   IEDQAVTD+408
AVTEXS2A EQU   IEDQAVTD+402
AVTEXA2S EQU   IEDQAVTD+396
AVTOCGET EQU   IEDQAVTD+392
AVTCKAVT EQU   @NM00004+1
@NM00005 EQU   AVTCKFLG
AVTCKHLT EQU   AVTCKFLG
AVTCKREQ EQU   AVTCKFLG
AVTCKENV EQU   AVTCKFLG
AVTCKNAC EQU   AVTCKFLG
AVTCKTAC EQU   AVTCKFLG
AVTBUENT EQU   IEDQAVTD+386
@NM00003 EQU   IEDQAVTD+385
AVTFULLT EQU   AVTBUFSW
AVTUNCON EQU   AVTBUFSW
@NM00002 EQU   AVTBUFSW
AVTBUFTR EQU   AVTREADD
AVTREADY EQU   IEDQAVTD+376
AVTRACE  EQU   IEDQAVTD+372
AVTTCB   EQU   IEDQAVTD+368
AVTPASWD EQU   IEDQAVTD+360
AVTCTLCH EQU   IEDQAVTD+352
AVTDOUBL EQU   IEDQAVTD+344
AVTDOUBX EQU   IEDQAVTD+336
AVTDPARM EQU   IEDQAVTD+332
AVTCSTCS EQU   IEDQAVTD+328
AVTDLQ   EQU   AVTSAVEX+32
@NM00001 EQU   AVTSAVEX
AVTSAVE4 EQU   IEDQAVTD+216
AVTSAVE3 EQU   IEDQAVTD+144
AVTSAVE2 EQU   IEDQAVTD+72
AVTSAVE1 EQU   IEDQAVTD
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS
@RC00500 EQU   @RC00493
@RF00542 EQU   @RC00515
@RF00544 EQU   @RC00515
@RC00547 EQU   @RC00515
@RC00556 EQU   @RC00515
@RF00616 EQU   @RC00606
@RF00736 EQU   @EL00003
@RF00741 EQU   @EL00003
@RC00828 EQU   @RC00824
@RC00826 EQU   @RC00824
@RC00849 EQU   @RC00845
@RF00874 EQU   @EL00008
@RF00549 EQU   @RC00547
@ENDDATA EQU   *
         END   IGCV810D,(C'PLS1407',0701,78073)
