        COPYMODS Program  -  Explanation of PARM Keywords     Level 21


Note:  It is very easy to change PARM keywords in the COPYMODS program
       because of its table-driven PARM parser at label PARMCHK.  See
       label PARMTABL for all permissible parms, and what switches they
       set.

Note:  This document may become obsolete, depending upon new enhancement
       features that may be put in after this document was written.
       The Level number at the upper right corner of this document
       reflects the COPYMODS program level at which this document
       claims some accuracy.

PARMTABL  from  Level 21 of the COPYMODS program.

              PARM    X'01'  PARM     Flags Set  Explanation of PARM
              Length  is
                      OFF

                      X'10'
                      is a
                      default

PARMTABL DC    X'07',X'00',C'LTMSKIP ',X'200000' FIRST ENTRY-skip LTM's
PTELEN   EQU   *-PARMTABL
PTEFLG   EQU   PTELEN-PBYTES
         DC    X'07',X'00',C'SKIPLTM ',X'200000' skip leading tape mks
         DC    X'07',X'11',C'COPYLTM ',X'200000' DEFAULT - copy them
         DC    X'07',X'01',C'LTMCOPY ',X'200000' synonym for COPYLTM
         DC    X'07',X'00',C'LBLINFO ',X'DE0000' print all SL types
         DC    X'06',X'00',C'PRINTL  ',X'DE0000' synonym
         DC    X'06',X'00',C'LABELS  ',X'DE0000' synonym
         DC    X'06',X'01',C'NOLABL  ',X'DE0000' don't print label info
         DC    X'07',X'11',C'NOLABEL ',X'DE0000' DEFAULT-syn for NOLABL
         DC    X'04',X'00',C'HDR1    ',X'020000' print HDR1 labels
         DC    X'06',X'01',C'NOHDR1  ',X'020000' don't print HDR1
         DC    X'04',X'00',C'HDR2    ',X'040000' print HDR2 labels
         DC    X'06',X'01',C'NOHDR2  ',X'040000' don't print HDR2
         DC    X'04',X'00',C'EOF1    ',X'080000' print EOF1 labels
         DC    X'06',X'01',C'NOEOF1  ',X'080000' don't print EOF1
         DC    X'04',X'00',C'EOF2    ',X'100000' print EOF2 labels
         DC    X'06',X'01',C'NOEOF2  ',X'100000' don't print EOF2
         DC    X'04',X'00',C'EOV1    ',X'400000' print EOV1 labels
         DC    X'06',X'01',C'NOEOV1  ',X'400000' don't print EOV1
         DC    X'04',X'00',C'EOV2    ',X'800000' print EOV2 labels
         DC    X'06',X'01',C'NOEOV2  ',X'800000' don't print EOV2
         DC    X'04',X'00',C'HDRS    ',X'060000' print HDR labels
         DC    X'06',X'01',C'NOHDRS  ',X'060000' don't print HDRs
         DC    X'04',X'00',C'EOFS    ',X'180000' print EOF labels
         DC    X'06',X'01',C'NOEOFS  ',X'180000' don't print EOFs
         DC    X'04',X'00',C'EOVS    ',X'C00000' print EOV labels
         DC    X'06',X'01',C'NOEOVS  ',X'C00000' don't print EOVs
         DC    X'06',X'00',C'CHGVOL  ',X'000100' change VOLSER to JCL
         DC    X'08',X'11',C'NOCHGVOL',X'000100' DEFAULT-keep VOLSER
         DC    X'06',X'00',C'JCLVOL  ',X'000100' synonym for CHGVOL
         DC    X'08',X'01',C'NOJCLVOL',X'000100' synonym for NOCHGVOL
         DC    X'06',X'00',C'NEWVOL  ',X'000100' synonym for CHGVOL
         DC    X'08',X'01',C'NONEWVOL',X'000100' synonym for NOCHGVOL
         DC    X'06',X'10',C'VOLLBL  ',X'000200' DEFAULT-print VOL1 lbl
         DC    X'08',X'01',C'NOVOLLBL',X'000200' don't print VOL1 lbl
         DC    X'07',X'00',C'EOV2EOF ',X'000400' convert EOV to EOF
         DC    X'08',X'00',C'EOVTOEOF',X'000400' synonym for EOV2EOF
         DC    X'06',X'00',C'EOVCHG  ',X'000400' synonym for EOV2EOF
         DC    X'08',X'11',C'NOEOVCHG',X'000400' DEFAULT-don't convert
         DC    X'04',X'00',C'READ    ',X'000800' READ INPUT NO COPY
         DC    X'08',X'00',C'READONLY',X'000800' synonym for READ
         DC    X'07',X'00',C'NOWRITE ',X'000800' synonym for READ
         DC    X'07',X'11',C'WRITE   ',X'000800' DEFAULT-copy tapes
         DC    X'07',X'01',C'NOEXTRA ',X'010000' ALL EXTRAS OFF
EFFS     DC    X'FFFFFFFFFFFFFFFF'


