$DOC........THIS MEMBER
HELP........HELP MEMBER OF PRINTDS
JCL.........JCL TO ASSEMBLE THE PRINTDS COMMAND
PRINTDS.....PRINTDS CSECT
PRINTDSX....PRINTDS CSECT
PRINTDSY....PRINTDS CSECT
