//X97TEST JOB (0496,CO26,0,1),AUSTIN,NOTIFY=AUSTIN
//*
//X97TEST EXEC PGM=IEBGENER
//SYSIN     DD DUMMY
//SYSPRINT  DD SYSOUT=*
//SYSUT1    DD DISP=SHR,DSN=SRS1.SAS.PAGEPLOT.PRINT(X97TEST)
//SYSUT2    DD SYSOUT=X
//*
//
