         TITLE 'IGCMSG6C - PUT OUT ERROR MESSAGES                      *
                        '
IGCMSG6C CSECT ,                                                   0001
@MAINENT DS    0H                                                  0001
         USING *,@15                                               0001
         B     @PROLOG                                             0001
         DC    AL1(16)                                             0001
         DC    C'IGCMSG6C  76.315'                                 0001
         DROP  @15
@PROLOG  STM   @14,@12,12(@13)                                     0001
         BALR  @12,0                                               0001
@PSTART  DS    0H                                                  0001
         USING @PSTART,@12                                         0001
         L     @00,@SIZDATD                                        0001
         GETMAIN  R,LV=(0)
         LR    @11,@01                                             0001
         USING @DATD,@11                                           0001
         ST    @13,@SA00001+4                                      0001
         LM    @00,@01,20(@13)                                     0001
         ST    @11,8(,@13)                                         0001
         LR    @13,@11                                             0001
         XC    @ZTEMPS(@ZLEN),@ZTEMPS
         MVC   @PC00001(4),0(@01)                                  0001
*                                   /* CHARACTER STRING              */
*                                                                  0026
*   /*****************************************************************/
*   /*                                                               */
*   /* LOCATE CORRECT INSTRUCTIONS                                   */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0026
*   INSTPTR=ADDR(INSTENTX(1));                                     0026
         LA    @10,OPTABLE                                         0026
         L     @05,@PC00001                                        0026
         AH    @10,OPID(,@05)                                      0026
         L     @10,PRETTAB(,@10)                                   0026
         AH    @10,OPRETCOD(,@05)                                  0026
         AL    @10,@CF00192                                        0026
         L     INSTPTR,PINSTTAB(,@10)                              0026
         LA    INSTPTR,INSTENTX+8(,INSTPTR)                        0026
*   MSGINDEX=LENGTH(MSGID)+1;       /* START WITH FIRST BYTE OF    0027
*                                      MESSAGE AREA PAST MESSAGE   0027
*                                      IDENTIFIER                    */
         LA    MSGINDEX,9                                          0027
*   RESPECIFY                                                      0028
*     INSTENTX BASED(INSTPTR);                                     0028
*                                                                  0028
*   /*****************************************************************/
*   /*                                                               */
*   /* PROCESS ALL INSTRUCTIONS                                      */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0029
*   DO WHILE ADDR(INST)^=0;                                        0029
         B     @DE00029                                            0029
@DL00029 DS    0H                                                  0030
*     IF INSTTYPE=MVECLLER THEN     /* LOCATE NEXT DATA TO MOVE      */
         CLI   INSTTYPE(INSTPTR),2                                 0030
         BNE   @RF00030                                            0030
*       DO;                         /* USER PROVIDED DATA            */
*         IF INSTULEN=0 THEN        /* USE USER PROVIDED LENGTH IF 0032
*                                      PASSED                        */
         CLI   INSTULEN(INSTPTR),0                                 0032
         BNE   @RF00032                                            0032
*           DO;                                                    0033
*             WORDPTR=ADDR(USERXDTA);/* USER CHARACTER STRING        */
         LH    @10,INSTINDX(,INSTPTR)                              0034
         SLA   @10,2                                               0034
         L     @15,@PC00001                                        0034
         L     @10,USERPTR-4(@10,@15)                              0034
         LA    WORDPTR,USERXDTA(,@10)                              0034
*             MAXSIZE=USERXLEN;     /* USER LENGTH FOR STRING        */
         LH    MAXSIZE,USERXLEN(,@10)                              0035
*           END;                                                   0036
*         ELSE                                                     0037
*           DO;                                                    0037
         B     @RC00032                                            0037
@RF00032 DS    0H                                                  0038
*             WORDPTR=USERPTR(INSTINDX);/* USER CHARACTER STRING     */
         LH    @10,INSTINDX(,INSTPTR)                              0038
         SLA   @10,2                                               0038
         L     @15,@PC00001                                        0038
         L     WORDPTR,USERPTR-4(@10,@15)                          0038
*             MAXSIZE=INSTULEN;     /* DEFAULT LENGTH FOR STRING     */
         SLR   MAXSIZE,MAXSIZE                                     0039
         IC    MAXSIZE,INSTULEN(,INSTPTR)                          0039
*           END;                                                   0040
*                                                                  0040
*         /***********************************************************/
*         /*                                                         */
*         /* CORRECT SIZE PASSED BY USER BY REMOVEING TRAILING BLANKS*/
*         /*                                                         */
*         /***********************************************************/
*                                                                  0041
*         DO MAXSIZE=MAXSIZE TO 1 BY-1 WHILE WORDPTR->THEWORD(MAXSIZE)=
*               ' ';                                               0041
@RC00032 B     @DE00041                                            0041
@DL00041 LR    @10,WORDPTR                                         0041
         ALR   @10,MAXSIZE                                         0041
         BCTR  @10,0                                               0041
         CLI   THEWORD(@10),C' '                                   0041
         BNE   @DC00041                                            0041
*         END;                                                     0042
         BCTR  MAXSIZE,0                                           0042
@DE00041 LTR   MAXSIZE,MAXSIZE                                     0042
         BP    @DL00041                                            0042
@DC00041 DS    0H                                                  0043
*       END;                                                       0043
*     ELSE                                                         0044
*       DO;                         /* CHARACTER CONSTANT DATA       */
         B     @RC00030                                            0044
@RF00030 DS    0H                                                  0045
*         WORDPTR=ADDR(INSTDATA);                                  0045
         L     @10,INSTADDR-1(,INSTPTR)                            0045
         LA    @10,0(,@10)                                         0045
         LA    WORDPTR,INSTDATA(,@10)                              0045
*         MAXSIZE=INSTLEN;                                         0046
         SLR   MAXSIZE,MAXSIZE                                     0046
         IC    MAXSIZE,INSTLEN(,@10)                               0046
*       END;                                                       0047
*     CALL COPYWORD;                /* PUT TEXT IN MESSAGE           */
@RC00030 BAL   @14,COPYWORD                                        0048
*     INSTPTR=INSTPTR+LENGTH(INSTENT);/* POINT TO NEXT INSTRUCTION   */
         AH    INSTPTR,@CH00190                                    0049
*   END;                                                           0050
@DE00029 L     @10,INSTADDR-1(,INSTPTR)                            0050
         LA    @10,0(,@10)                                         0050
         LTR   @10,@10                                             0050
         BNZ   @DL00029                                            0050
*   CALL WTORTN;                    /* PUT OUT REST OF MESSAGE       */
         BAL   @14,WTORTN                                          0051
*COPYWORD:                                                         0052
*   PROC;                                                          0052
*                                                                  0052
@EL00001 L     @13,4(,@13)                                         0052
@EF00001 L     @00,@SIZDATD                                        0052
         LR    @01,@11                                             0052
         FREEMAIN R,LV=(0),A=(1)
@ER00001 LM    @14,@12,12(@13)                                     0052
         BR    @14                                                 0052
COPYWORD STM   @14,@03,@SA00002                                    0052
         STM   @05,@12,@SA00002+24                                 0052
*/********************************************************************/
*/* FUNCTION: COPIES CHARACTER STING INTO WTO PARAMETER LIST.        */
*/*   CALLS WTORTN TO PUT OUT CURRENT LINE IF THE BUFFER IS FILLED.  */
*/********************************************************************/
*                                                                  0053
*   IXWORD=1;                       /* INDEX INTO CURRENT WORD       */
*                                                                  0053
         LA    @10,1                                               0053
         LR    IXWORD,@10                                          0053
*   /*****************************************************************/
*   /*                                                               */
*   /* PROCESS THE CURRENT CHARACTER STRING                          */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0054
*   DO IXFIELD=1 TO MAXSIZE;                                       0054
*                                                                  0054
         LR    IXFIELD,@10                                         0054
         B     @DE00054                                            0054
@DL00054 DS    0H                                                  0055
*     /***************************************************************/
*     /*                                                             */
*     /* CHECK IF ANY MORE ROOM IN BUFFER                            */
*     /*                                                             */
*     /***************************************************************/
*                                                                  0055
*     IF MSGINDEX+IXWORD>=LENGTH(WTOXX03) THEN                     0055
         LR    @10,MSGINDEX                                        0055
         ALR   @10,IXWORD                                          0055
         CH    @10,@CH00087                                        0055
         BL    @RF00055                                            0055
*       CALL WTORTN;                /* FULL PUT IT OUT               */
*                                                                  0056
         BAL   @14,WTORTN                                          0056
*     /***************************************************************/
*     /*                                                             */
*     /* CHECK FOR END OF WORD                                       */
*     /*                                                             */
*     /***************************************************************/
*                                                                  0057
*     IF WORDPTR->THEWORD(IXWORD)=' '×IXFIELD=MAXSIZE THEN         0057
@RF00055 LR    @10,WORDPTR                                         0057
         ALR   @10,IXWORD                                          0057
         BCTR  @10,0                                               0057
         CLI   THEWORD(@10),C' '                                   0057
         BE    @RT00057                                            0057
         CR    IXFIELD,MAXSIZE                                     0057
         BNE   @RF00057                                            0057
@RT00057 DS    0H                                                  0058
*       DO;                                                        0058
*         WTOXX03(MSGINDEX:MSGINDEX+IXWORD-1)=WORDPTR->THEWORD(1:IXWORD
*             );                    /* MOVE THE WORD                 */
*                                                                  0059
         LA    @10,WTOXX03-1(MSGINDEX)                             0059
         LR    @07,IXWORD                                          0059
         BCTR  @07,0                                               0059
         EX    @07,@SM00193                                        0059
*         /***********************************************************/
*         /*                                                         */
*         /* CORRECT CURRENT DATA POINTERS                           */
*         /*                                                         */
*         /***********************************************************/
*                                                                  0060
*         WORDPTR=WORDPTR+IXWORD;   /* NEXT WORD                     */
         ALR   WORDPTR,IXWORD                                      0060
*         MSGINDEX=MSGINDEX+IXWORD; /* NEXT FREE SPOT WTO PARAMETER
*                                      LIST                          */
         ALR   MSGINDEX,IXWORD                                     0061
*         IXWORD=1;                 /* PROCESS NEW WORD NEXT         */
         LA    IXWORD,1                                            0062
*       END;                                                       0063
*     ELSE                                                         0064
*       IXWORD=IXWORD+1;            /* PT TO NEXT BYTE IN WORD       */
         B     @RC00057                                            0064
@RF00057 AH    IXWORD,@CH00042                                     0064
*   END;                                                           0065
@RC00057 AH    IXFIELD,@CH00042                                    0065
@DE00054 CR    IXFIELD,MAXSIZE                                     0065
         BNH   @DL00054                                            0065
*   END COPYWORD;                                                  0066
@EL00002 DS    0H                                                  0066
@EF00002 DS    0H                                                  0066
@ER00002 LM    @14,@03,@SA00002                                    0066
         LM    @05,@12,@SA00002+24                                 0066
         BR    @14                                                 0066
*WTORTN:                                                           0067
*   PROC;                                                          0067
*                                                                  0067
WTORTN   STM   @14,@03,12(@13)                                     0067
         STM   @05,@12,40(@13)                                     0067
*/********************************************************************/
*/*FUNCTION - FORMATS WTO PARAMETER LIST AND ISSUES A WTO ON THE     */
*/*  CURRENT PORTION OF THE MESSAGE.                                 */
*/********************************************************************/
*                                                                  0068
*   WTOXX01=WTOX01+MSGINDEX-LENGTH(WTOX03)-1;/* LENGTH               */
         LR    @10,MSGINDEX                                        0068
         AH    @10,WTOX01                                          0068
         BCTR  @10,0                                               0068
         BCTR  @10,0                                               0068
         STH   @10,WTOXX01                                         0068
*   WTOXX02=WTOX02;                 /* MCS FLAG                      */
         MVC   WTOXX02(2),WTOX02                                   0069
*   WTOXX03(1:LENGTH(MSGID))=MSGID; /* PLACE MESSAGE ID IN EACH LINE */
         LA    @10,OPTABLE                                         0070
         L     @05,@PC00001                                        0070
         AH    @10,OPID(,@05)                                      0070
         L     @10,PRETTAB(,@10)                                   0070
         AH    @10,OPRETCOD(,@05)                                  0070
         AL    @10,@CF00192                                        0070
         L     @10,PINSTTAB(,@10)                                  0070
         MVC   WTOXX03(8),MSGID(@10)                               0070
*   WTOXX04=WTOX04;                 /* DESCRIPTOR CODES              */
         LA    @10,WTOXX03                                         0071
         BCTR  @10,0                                               0071
         ALR   @10,MSGINDEX                                        0071
         MVC   WTOXX04(2,@10),WTOX04                               0071
*   WTOXX05=WTOX05;                 /* ROUTING CODES                 */
*                                                                  0072
         MVC   WTOXX05(2,@10),WTOX05                               0072
*   /*****************************************************************/
*   /*                                                               */
*   /* PUT THE MESSAGE OUT                                           */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0073
*   DO;                             /* WTOP MF(E,WTOXX)              */
*     RFY                                                          0074
*       GPR01P RSTD;                /* RESTRICT REG 1                */
*     GPR01P=ADDR(WTOXX);           /* ADDRESS CONTROL PROGRAM LIST  */
         LA    GPR01P,WTOXX                                        0075
*     SVC(35);                      /* ISSUE WTO SVC                 */
         SVC   35                                                  0076
*     RFY                                                          0077
*       GPR01P UNRSTD;              /* RELEASE REG 1                 */
*   END;                            /* WTOP MF(E,WTOXX)              */
*   MSGINDEX=LENGTH(MSGID)+1;       /* POINT TO START OF MESSAGE   0079
*                                      BUFFER AGAIN                  */
         LA    MSGINDEX,9                                          0079
*   END WTORTN;                                                    0080
@EL00003 DS    0H                                                  0080
@EF00003 DS    0H                                                  0080
@ER00003 LM    @14,@03,12(@13)                                     0080
         LM    @05,@12,40(@13)                                     0080
         BR    @14                                                 0080
*   END IGCMSG6C;                                                  0081
@DATA    DS    0H
@CH00042 DC    H'1'
@CH00190 DC    H'4'
@CH00087 DC    H'72'
@SM00193 MVC   0(0,@10),THEWORD(WORDPTR)
@DATD    DSECT
         DS    0F
@SA00001 DS    18F
@PC00001 DS    1F
@SA00002 DS    14F
@ZTEMPS  DS    C
@ZTEMPND EQU   *
@ZLEN    EQU   @ZTEMPND-@ZTEMPS
IGCMSG6C CSECT
         DS    0F
@CF00192 DC    F'-4'
@DATD    DSECT
         DS    0D
WTOXX    DS    CL80
         ORG   WTOXX
WTOXX01  DS    FL2
WTOXX02  DS    BL2
WTOXX03  DS    CL72
@NM00003 DS    2BL2
         ORG   WTOXX+80
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA
@ENDDATD EQU   *
IGCMSG6C CSECT
         DS    0F
@SIZDATD DC    AL1(0)
         DC    AL3(@ENDDATD-@DATD)
         DS    0D
WTOX     DS    CL9
         ORG   WTOX
WTOX01   DC    H'5'
WTOX02   DC    B'1000000000000000'
WTOX03   DC    CL1'?'
WTOX04   DC    B'0000000000000000'
WTOX05   DC    B'0000000010100000'
         ORG   WTOX+9
         DS    CL3
SECN05B  DS    CL12
         ORG   SECN05B
@NM00005 DC    AL4(IHJ101I)
         DC    AL4(IHJ101I)
         DC    F'0'
         ORG   SECN05B+12
SECK05B  DS    CL12
         ORG   SECK05B
@NM00031 DC    AL4(IHJ102I)
         DC    AL4(IHJ102I)
         DC    F'0'
         ORG   SECK05B+12
IHJ101I  DS    CL32
         ORG   IHJ101I
@NM00006 DC    CL8'IHJ101I'
@NM00007 DS    CL4
         ORG   @NM00007
@NM00008 DC    AL1(1)
@NM00009 DC    AL3(AMSG)
         ORG   IHJ101I+12
@NM00010 DS    CL4
         ORG   @NM00010
@NM00011 DC    AL1(1)
@NM00012 DC    AL3(CMSG)
         ORG   IHJ101I+16
@NM00013 DS    CL4
         ORG   @NM00013
@NM00014 DC    AL1(2)
@NM00015 DC    AL1(44)
@NM00016 DC    H'1'
         ORG   IHJ101I+20
@NM00017 DS    CL4
         ORG   @NM00017
@NM00018 DC    AL1(1)
@NM00019 DC    AL3(COMMA)
         ORG   IHJ101I+24
@NM00020 DS    CL4
         ORG   @NM00020
@NM00021 DC    AL1(2)
@NM00022 DC    AL1(6)
@NM00023 DC    H'2'
         ORG   IHJ101I+28
@NM00024 DC    F'0'
         ORG   IHJ101I+32
AMSG     DS    CL24
         ORG   AMSG
@NM00025 DC    AL1(23)
@NM00026 DC    CL23'USER NOT AUTHORIZED TO '
         ORG   AMSG+24
CMSG     DS    CL15
         ORG   CMSG
@NM00027 DC    AL1(14)
@NM00028 DC    CL14'DASD DATA SET='
         ORG   CMSG+15
COMMA    DS    CL2
         ORG   COMMA
@NM00029 DC    AL1(1)
@NM00030 DC    CL1','
         ORG   COMMA+2
         DS    CL3
IHJ102I  DS    CL20
         ORG   IHJ102I
@NM00032 DC    CL8'IHJ102I'
@NM00033 DS    CL4
         ORG   @NM00033
@NM00034 DC    AL1(1)
@NM00035 DC    AL3(MSG102)
         ORG   IHJ102I+12
@NM00036 DS    CL4
         ORG   @NM00036
@NM00037 DC    AL1(2)
@NM00038 DC    AL1(6)
@NM00039 DC    H'1'
         ORG   IHJ102I+16
@NM00040 DC    F'0'
         ORG   IHJ102I+20
MSG102   DS    CL41
         ORG   MSG102
@NM00041 DC    AL1(40)
@NM00042 DC    CL40'USER NOT RACF AUTHORIZED TO TAPE VOLUME='
         ORG   MSG102+41
PATCH    DS    CL100
         DS    CL3
OPTABLE  DC    AL4(SECN05B)
         DC    AL4(SECK05B)
         DS    1XL4
@00      EQU   00                      EQUATES FOR REGISTERS 0-15
@01      EQU   01
@02      EQU   02
@03      EQU   03
@04      EQU   04
@05      EQU   05
@06      EQU   06
@07      EQU   07
@08      EQU   08
@09      EQU   09
@10      EQU   10
@11      EQU   11
@12      EQU   12
@13      EQU   13
@14      EQU   14
@15      EQU   15
IXFIELD  EQU   @06
MAXSIZE  EQU   @03
WORDPTR  EQU   @05
IXWORD   EQU   @02
INSTPTR  EQU   @02
MSGINDEX EQU   @04
GPR01P   EQU   @01
GPR00F   EQU   @00
GPR00P   EQU   @00
GPR01F   EQU   @01
GPR14F   EQU   @14
GPR14P   EQU   @14
GPR15F   EQU   @15
GPR15P   EQU   @15
@NM00001 EQU   0
RETTAB   EQU   @NM00001
PRETTAB  EQU   0
INSTTAB  EQU   0
MSGID    EQU   INSTTAB
INSTENT  EQU   INSTTAB+8
PINSTTAB EQU   0
INSTENTX EQU   0
INSTTYPE EQU   INSTENTX
INSTADDR EQU   INSTENTX+1
INSTULEN EQU   INSTADDR
INSTINDX EQU   INSTADDR+1
INST     EQU   0
INSTLEN  EQU   INST
INSTDATA EQU   INST+1
@NM00002 EQU   0
USERXLEN EQU   @NM00002
USERXDTA EQU   @NM00002+2
@NM00004 EQU   0
WTOXX04  EQU   @NM00004
WTOXX05  EQU   @NM00004+2
THEWORD  EQU   0
IKEBC    EQU   0
IKEBF15  EQU   0
IKEBF31  EQU   0
IKEBP15  EQU   0
IKEBP31  EQU   0
IKEBP8   EQU   0
PARMLIST EQU   0
OPID     EQU   PARMLIST
OPRETCOD EQU   PARMLIST+2
USERPTR  EQU   PARMLIST+4
@PB00003 EQU   @EL00001
@PB00002 EQU   @PB00003
@ENDDATA EQU   *
         END   IGCMSG6C,(C'PLS2218',0701,76315)
