SVTM     TITLE 'ISTINCCL - ERP CONTROL                                 *
                        '
ISTINCCL CSECT ,                                                   0001
@MAINENT DS    0H                                                  0001
         USING *,@15                                               0001
         B     @PROLOG                                             0001
         DC    AL1(16)                                             0001
         DC    C'ISTINCCL  78.152'                                 0001
         DROP  @15
@PROLOG  BALR  @11,0                                               0001
@PSTART  LA    @12,4095(,@11)                                      0001
         USING @PSTART,@11                                         0001
         USING @PSTART+4095,@12                                    0001
         B     CCLMAIN           /* BRANCH TO MAINLINE CODE  @XM09430*/
         ENTRY ISTINXCL          /* CALL ENTRY POINT NAME    @XM09430*/
ISTINXCL STM   14,12,12(13)      /* SAVE CALLERS REGISTERS   @XM09430*/
         USING ISTINXCL,15       /* TEMPORARY ADDRESSABILITY @XM09430*/
         LR    11,13             /* SAVE @(CALLER SAVE AREA) @XM09430*/
         SH    13,CCLH72         /* R13=@(ISTINCCL SAVE AREA)@XM09430*/
         ST    13,8(11)          /* SET CALLER FORWARD PTR   @XM09430*/
         ST    11,4(13)          /* SET ISTINCCL BACK PTR    @XM09430*/
         SH    15,XCLDISP        /* SET R15 = @(ISTINCCL)    @XM09430*/
         BR    15                /* GO TO ISTINCCL           @XM09430*/
CCLH72   DC    H'72'             /* LENGTH OF STD SAVE AREA  @XM09430*/
XCLDISP  DC    AL2(ISTINXCL-ISTINCCL) /* OFFSET OF ISTINXCL  @XM09430*/
         DROP  15                /* RLSE TEMPORARY BASE REG  @XM09430*/
CCLMAIN  DS    0H                /* TARGET FOR PSS ENTRY     @XM09430*/
         USING @DATD,CCLWKPT     /* VARIABLES BASE REGISTER  @XM09430*/
*IF CCLR1->RPHTYPE = RPTYPE      /* IF ENTRY IS VIA TPQUE    @XM09430*/
*  THEN DO;                      /* THEN PERF PSS LINKAGE    @XM09430*/
*                                                                  0642
         CLI   RPHTYPE(CCLR1),X'01'                                0642
         BNE   @RF00642                                            0642
*    DO;                                                           0644
*/***  CRRMAINT  PROCNM(ISTINCCL)COMP(VY)FUNC(MAIN)  ***/          0645
*    DCL CMZK0011 PTR(31) REG(1);                                  0645
*    RFY (CMZK0011) RSTD;                                          0646
*                                                                  0646
*/* ATBUILD (ISTRPH,ISTCRA,ISTPFCRR,ISTVYCRR)  */                  0647
*    RFY ISTZSAVE;                                                 0647
*    RFY ISTPFCRR;                                                 0648
*    RFY ISTCFCRR;                                                 0649
*    RFY ISTZCRR ;                                                 0650
*    RFY ISTASCRR;                                                 0651
*    RFY ISTAPCRR;                                                 0652
*    RFY ISTCRA  ;                                                 0653
*    RFY ISTCNSTA;                                                 0654
*    RFY ISTVYCRR;                                                 0655
*/* END OF ATBUILD */                                              0656
*    /*** SAVE CRR AND FRR POINTERS ***/                           0656
*ADDR(CMZK0011->RPHCRR->CRAPROCR)->PFCCRRO = CMZK0011->RPHCRR->CRACRR;
         L     @15,RPHCRR(,CMZK0011)                               0656
         LA    @10,312                                             0656
         ALR   @10,@15                                             0656
         L     @00,CRACRR(,@15)                                    0656
         ST    @00,PFCCRRO(,@10)                                   0656
*ADDR(CMZK0011->RPHCRR->CRAPROCR)->PFCFRRO = CMZK0011->RPHCRR->CRAFRR;
         L     @00,CRAFRR(,@15)                                    0657
         ST    @00,PFCFRRO(,@10)                                   0657
*    /*** SET UP POINTERS TO OUR CRR, FRR ***/                     0658
*CMZK0011->RPHCRR->CRACRR = ADDR(CMZK0011->RPHCRR->CRAPROCR);      0658
         LA    @10,CRAPROCR(,@15)                                  0658
         ST    @10,CRACRR(,@15)                                    0658
*CMZK0011->RPHCRR->CRAFRR = 0;                                     0659
         SLR   @09,@09                                             0659
         ST    @09,CRAFRR(,@15)                                    0659
*    /*** SET OUR COMPONENT PROCESS ID IN CRR ***/                 0660
*CMZK0011->RPHCRR->CRACRR->PFCFTA = TIDINCCL;                      0660
         MVI   PFCFTA(@10),X'02'                                   0660
*    /*** CLEAR COMPONENT ENTERED INDICATORS ***/                  0661
*CMZK0011->RPHCRR->CRACRR->VYCNTRD = '0'B;                         0661
         XC    VYCNTRD+1(11,@10),VYCNTRD+1(@10)                    0661
         MVI   VYCNTRD(@10),B'00000000'                            0661
*    /*** SET ENTERED BIT FOR THIS PROCEDURE ***/                  0662
*CMZK0011->RPHCRR->CRACRR->NINCCL = '1'B;                          0662
         OI    NINCCL(@10),B'10000000'                             0662
*    /*** CLEAR AND SET CURRENT PROCEDURE BIT ***/                 0663
*CMZK0011->RPHCRR->CRACRR->VYCCRT = '0'B;                          0663
         XC    VYCCRT+1(11,@10),VYCCRT+1(@10)                      0663
         MVI   VYCCRT(@10),B'00000000'                             0663
*CMZK0011->RPHCRR->CRACRR->CINCCL = '1'B;                          0664
         OI    CINCCL(@10),B'10000000'                             0664
*    END; /*       @XM09430*/                                      0665
*    IF RPHWEA=0                                           /*@ZA20811*/
*      THEN                                                /*@ZA20811*/
         L     @15,RPHWEA(,CCLR1)                                  0666
         CR    @15,@09                                             0666
         BE    @RT00666                                            0666
*        GOTO EXIT;                                        /*@ZA20811*/
*    CCLNCSPL = RPHWEA;          /* INITIALIZE NCSPL POINTER @XM09430*/
         LR    CCLNCSPL,@15                                        0668
*    NCSPLRPH = ADDR(ISTRPH);    /* INITIALIZE RPH POINTER   @XM09430*/
         ST    CCLR1,NCSPLRPH(,CCLNCSPL)                           0669
*    IF NCSPLVCD=NCSPLVC6 &      /* IF THIS IS PAB PURGE     @ZA32868*/
*       NCSPLVBF=NCSTPPST                                  /*@ZA32868*/
*      THEN                                                /*@ZA32868*/
         CLI   NCSPLVCD(CCLNCSPL),X'06'                            0670
         BNE   @RF00670                                            0670
         CLC   NCSPLVBF(2,CCLNCSPL),@CB02052                       0670
         BNE   @RF00670                                            0670
*        DO;                                               /*@ZA32868*/
*        WKPT5=NCSPLWEL;                                   /*@ZA32868*/
*                                                                  0672
         L     WKPT5,NCSPLWEL(,CCLNCSPL)                           0672
*/*TPPOST  (WKPT5)  */                                             0673
*         DO;                                                      0673
*                                       /*DECLARE AND RESTRICT REGS*/
*           RESPECIFY (GPR00F,GPR01F,GPR04F,GPR05F,                0674
*                     GPR06F,GPR14F,GPR15F) RSTD;                  0674
*                                       /*0,1,4,5,6,14, AND 15   */
*                                                                  0675
*/* ATBUILD (ISTPAB,ISTDYPAB,ISTRPH)  */                           0675
*/* END OF ATBUILD */                                              0675
*           GEN REFS(GPR01P,GPR02F,GPR06F)SETS(RPHWORK);           0675
        STM GPR02F,GPR06F,RPHWORK(GPR01P)
*           GPR04F=WKPT5;               /*LOAD RPH PNTR INTO REG 4*/
         LR    GPR04F,WKPT5                                        0676
*           RFY GPR03F RSTD;                                       0677
*           GPR03F=0;                                              0678
*                                                                  0678
         SLR   @10,@10                                             0678
         LR    GPR03F,@10                                          0678
*         DO; /*MODESET  SAVEKEY(GPR06F) KEYADDR(GPR03F) WORKREG(GPR05F
**/         RESPECIFY (GPR02F) RESTRICTED;                         0679
*           GPR05F = GPR02F; /*SAVE REGISTER 2*/                   0681
         LR    GPR05F,GPR02F                                       0681
*           IPK; /*SAVE CURRENT PSW KEY*/                          0682
         IPK                                                       0682
*           GPR06F = GPR02F;                                       0683
         LR    GPR06F,GPR02F                                       0683
*           GPR02F = GPR05F; /*RESTORE REGISTER 2*/                0684
         LR    GPR02F,GPR05F                                       0684
*           SPKA (GPR03F); /*SET PSW KEY*/                         0685
         SPKA  0(GPR03F)                                           0685
*           RESPECIFY (GPR02F) UNRESTRICTED;                       0686
*         END; /*MODESET  SAVEKEY(GPR06F) KEYADDR(GPR03F) WORKREG(GPR05
*)*/        RFY GPR03F UNRSTD;                                     0687
*           GPR05P=GPR04P->RPHMAJCB+GPR04P->RPHPABOF;              0689
         L     GPR05P,RPHMAJCB-1(,GPR04P)                          0689
         LA    GPR05P,0(,GPR05P)                                   0689
         SLR   @07,@07                                             0689
         IC    @07,RPHPABOF(,GPR04P)                               0689
         ALR   GPR05P,@07                                          0689
*                                       /*LOAD REG 5  WITH ADDR OF*/
*                                       /*MAJOR CONTROL BLOCK PLUS*/
*                                       /*OFFSET OF PAB IN BLOCK  */
*           GPR14P=0;                   /*LOAD 0 INTO REG 14      */
         LR    GPR14P,@10                                          0690
*           GPR15P='FFFFFFFF'X;         /*LOAD REG 15 WITH DUMMY  */
         SLR   GPR15P,GPR15P                                       0691
         BCTR  GPR15P,0                                            0691
*                                       /*ADDRESS                 */
*           CS (GPR14P,GPR15P,GPR04P->RPHRESMA);                   0692
         CS    GPR14P,@15,RPHRESMA(GPR04P)                         0692
*                                       /*COMPARE RESUME ADDRESS  */
*                                       /*WITH 0 AND,IF EQUAL, PUT*/
*                                       /*DUMMY ADDRESS IN CONTROL*/
*                                       /*BLOCK RESUME ADDRESS    */
*           BC (8,FMZT0013);            /*IF EQUAL, BYPASS REMAINDER*/
         BC    8,FMZT0013                                          0693
*                                       /*OF EXPANSION              */
*FMZL0013:  IF GPR04P->RPHWT='1'B THEN  /*WT/EXT CONTENTION FLAG ON */
FMZL0013 TM    RPHWT(GPR04P),B'00001000'                           0694
         BNO   @RF00694                                            0694
*           DO;                         /*IN RPH                    */
*             GPR14P=GPR04P->RPHRESMA×RPHWT1;                      0696
         L     GPR14P,RPHRESMA(,GPR04P)                            0696
         O     GPR14P,@CF01354                                     0696
*                                       /*LOAD REG 14 WITH FLAG FIELD*/
*                                       /*AND MAKE CERTAIN WT/EXT    */
*                                       /*CONTENTION FLAG STILL ON   */
*             GPR15P=GPR14P×RPHPT1;     /*LOAD REG 15 WITH FLAG FIELD*/
         LR    GPR15P,GPR14P                                       0697
         O     GPR15P,@CF01358                                     0697
*                                       /*AND TURN POST FLAG ON      */
*             CS (GPR14P,GPR15P,GPR04P->RPHRESMA);                 0698
         CS    GPR14P,@15,RPHRESMA(GPR04P)                         0698
*                                       /*COMPARE REG 14 WITH FLAG */
*                                       /*FIELD--IF WT/EXT BIT ON, */
*                                       /*TURN ON POST FLAG        */
*             BC (4,FMZL0013);          /*IF WT/EXT BIT WAS OFF, LOOP*/
         BC    4,FMZL0013                                          0699
*                                       /*TO TEST CONTENTION FLAG    */
*             BC (8,FMZT0013);          /*IF WT/EXT BIT WAS OFF,     */
         BC    8,FMZT0013                                          0700
*                                       /*BRANCH TO BYPASS CODE GEN  */
*           END;                        /*IF POST FLAG IS ON, FALL*/
*                                       /*THRU BOTTOM OF LOOP     */
*           ELSE;                       /*WT/EXT CONTENTION FLAG OFF*/
@RF00694 DS    0H                                                  0703
*           IF GPR04P->RPHTSKID=GPR01P->RPHTSKID                   0703
*           THEN DO;                                               0703
         CLC   RPHTSKID(4,GPR04P),RPHTSKID(GPR01P)                 0703
         BNE   @RF00703                                            0703
*             GPR05P->PABCHNGP=GPR01P->RPHPABQP;                   0705
         MVC   PABCHNGP(3,GPR05P),RPHPABQP(GPR01P)                 0705
*                                       /*PUT PAB QUEUE ADDRESS*/  0706
*                                       /*IN SECOND WORD OF PAB     */
*             GPR01P->RPHPABQP=GPR05P;  /*PUT PAB ADDRESS (IN MAJOR */
         STCM  GPR05P,7,RPHPABQP(GPR01P)                           0706
*                                       /*CONTROL BLOCK) IN PAB */ 0707
*                                       /*QUEUE ADRESS IN RPH    */
*             END;                                                 0707
*           ELSE DO;                                               0708
         B     @RC00703                                            0708
@RF00703 DS    0H                                                  0709
*             GPR00F=0;                 /*SET REG 0 TO INDICATE ENA*/
*                                                                  0709
         SLR   GPR00F,GPR00F                                       0709
*         DO; /* LISATCVT CVTBASE(PAGEABLE,(GPR15P)) */            0710
*           GPR15P = ATCLCPTR; /*SET UP ATCVT POINTER*/            0711
         L     GPR15P,ATCLCPTR                                     0711
*         END; /*LISATCVT*/             /*PUT POINTER TO ATCVT IN */
*                                       /*  IN REG 15             */
*             CALL GPR15P->ATCAP32;     /* CALL ISTAPC32: TPSCHED */
         L     @10,ATCAP32(,GPR15P)                                0713
         LR    @15,@10                                             0713
         BALR  @14,@15                                             0713
*             END;                                                 0714
*FMZT0013:                                                         0715
*         DO; /*MODESET  KEYADDR(GPR06F) WORKREG(GPR05F)*/         0715
@RC00703 DS    0H                                                  0715
FMZT0013 DS    0H                                                  0716
*           GPR05F = GPR06F; /*GET KEY FORM SAVE LOCATION*/        0716
         LR    GPR05F,GPR06F                                       0716
*           SPKA (GPR05F); /*SET PSW KEY*/                         0717
         SPKA  0(GPR05F)                                           0717
*         END; /*MODESET  KEYADDR(GPR06F) WORKREG(GPR05F)*/        0718
*           GEN REFS(GPR04P,                                       0719
*           RPHWORK)                                               0719
*               SETS(GPR02F,GPR03F,                                0719
*                     GPR04F,GPR05F,GPR06F);                       0719
        LM GPR02F,GPR06F,RPHWORK(GPR01P)
*           RESPECIFY (GPR00F,GPR01F,GPR04F,GPR05F,GPR06F,         0720
*           GPR14F,GPR15F) UNRSTD;      /*UNRESTRICT REGS 0,1,    */
*                                       /*4,5,14, AND 15          */
*         END;  /****END OF TPPOST GENERATION****/                 0721
*            /*@ZA32868*/                                          0722
*                                                                  0722
*/* TPEXIT  NORM */                                                0722
*         DO;                                                      0722
*           RESPECIFY GPR15P RSTD;                                 0723
*                                                                  0723
*/* ATBUILD (ISTPAB,ISTDYPAB,ISTATCVT)  */                         0724
*/* END OF ATBUILD */                                              0724
*                                                                  0724
*         DO; /* LISATCVT CVTBASE(PAGEABLE,(GPR15P)) */            0724
*           GPR15P = ATCLCPTR; /*SET UP ATCVT POINTER*/            0725
         L     GPR15P,ATCLCPTR                                     0725
*         END; /*LISATCVT*/                                        0726
*           RESPECIFY GPR00F RSTD;                                 0727
*           GPR00F=4;    /* SET PARAMETER REGISTER TO 4 */         0728
         LA    GPR00F,4                                            0728
*           GPR15P=GPR15P->ATCAP31;                                0729
         L     GPR15P,ATCAP31(,GPR15P)                             0729
*           DCL FMZL0025 BASED(GPR15P) LABEL VALUERANGE(*);        0730
*           CALL FMZL0025;                                         0731
         BALR  @14,@15                                             0731
*           RESPECIFY (GPR00F,GPR15P) UNRSTD;                      0732
*         END; /***** END OF TPEXIT  *****/                        0733
*        /*@ZA32868*/                                              0734
*        END;                                              /*@ZA32868*/
*    CCLSV = NCSPLWKA            /* R13 = @(VARY WORK AREA)  @XM09430*/
*      + WKALEN                  /* + LENGTH OF WORK AREA    @XM09430*/
*      - SAVEADJ;                /* - LENGTH(REG SAVE AREA)  @XM09430*/
@RF00670 L     @15,NCSPLWKA(,CCLNCSPL)                             0735
         LR    CCLSV,@15                                           0735
         AL    CCLSV,WKALEN(,@15)                                  0735
         SL    CCLSV,@CF01905                                      0735
*    END;                        /* END PSS ENTRY LINKAGE    @XM09430*/
*  ELSE DO;                      /* ELSE PERF STD LINKAGE    @XM09430*/
         B     @RC00642                                            0737
@RF00642 DS    0H                                                  0738
*    CCLNCSPL = CCLR1;           /* INITIALIZE NCSPL POINTER @XM09430*/
         LR    CCLNCSPL,CCLR1                                      0738
*    CCLR1 = NCSPLRPH;           /* SET REG 1 -> ISTRPH      @XM09430*/
*                                                                  0739
         L     CCLR1,NCSPLRPH(,CCLNCSPL)                           0739
*    DO;                                                           0740
*/***  CRRMAINT  PROCNM(ISTINCCL)COMP(VY)FUNC(SUB)  ***/           0741
*    DCL CMZK0033 PTR(31) REG(1);                                  0741
*    RFY (CMZK0033) RSTD;                                          0742
*                                                                  0742
*/* ATBUILD (ISTRPH,ISTCRA,ISTPFCRR,ISTVYCRR)  */                  0743
*/* END OF ATBUILD */                                              0743
*    /*** SET ENTERED BIT FOR THIS PROCEDURE ***/                  0743
*CMZK0033->RPHCRR->CRACRR->NINCCL = '1'B;                          0743
         L     @15,RPHCRR(,CMZK0033)                               0743
         L     @15,CRACRR(,@15)                                    0743
         OI    NINCCL(@15),B'10000000'                             0743
*    /*** CLEAR AND SET CURRENT PROCEDURE BIT ***/                 0744
*CMZK0033->RPHCRR->CRACRR->VYCCRT = '0'B;                          0744
         XC    VYCCRT+1(11,@15),VYCCRT+1(@15)                      0744
         MVI   VYCCRT(@15),B'00000000'                             0744
*CMZK0033->RPHCRR->CRACRR->CINCCL = '1'B;                          0745
         OI    CINCCL(@15),B'10000000'                             0745
*    END; /*        @XM09430*/                                     0746
*    END;                        /* END STANDARD LINKAGE     @XM09430*/
*CCLSV->FWDPTR = CCL0;           /* ZERO SAVE AREA FWD PTR   @XM09430*/
@RC00642 SLR   @15,@15                                             0748
         ST    @15,FWDPTR(,CCLSV)                                  0748
*CCLRDT=NCSPLRPT;                       /*ADDRESS RDTE*/           0749
         L     CCLRDT,NCSPLRPT(,CCLNCSPL)                          0749
*NCSPLCID=SAF0+RPRDAF;           /* CID FOR FAILING NODE     @XM09617*/
         LH    @15,RPRDAF(,CCLRDT)                                 0750
         N     @15,@CF05852                                        0750
         ST    @15,NCSPLCID(,CCLNCSPL)                             0750
*IF NCSPLVBF=NCSERSTR                                              0751
*  THEN  /*SEGMENT(CCLRET)REQUEST*/DO;GOTO CCLRET;CCLRET#:END;      /*I
* RETURN FROM DLR */                                               0751
         CLC   NCSPLVBF(2,CCLNCSPL),@CB02072                       0751
         BNE   @RF00751                                            0751
         B     CCLRET                                              0753
*  ELSE DO;                                                        0755
         B     @RC00751                                            0755
@RF00751 DS    0H                                                  0756
*/********************************************************************/
*/*     INITIALIZE WORKAREA AND GET DAF LOCK                         */
*/*     FIRST WORD OF NCSPL WORKAREA PTS TO AVAILABLE WORKSPACE      */
*/*     SECOND WORD IS LENGTH OF WORKAREA                            */
*/*     WORKSPACE IS ALLOCATED FROM TOP DOWN,                        */
*/*     SAVEAREAS FROM BOTTOM UP                                     */
*/********************************************************************/
*       CCLWKPT=(WKANEXT+7)&(-8);       /* SET DATA BASE REG @XM09430*/
         L     @15,NCSPLWKA(,CCLNCSPL)                             0756
         LA    CCLWKPT,7                                           0756
         AL    CCLWKPT,WKANEXT(,@15)                               0756
         N     CCLWKPT,@CF04696                                    0756
*       WKANEXT=CCLWKPT+@SIZDATD;       /* UPDATE NEXT AVAIL @XM09430*/
         LR    @10,CCLWKPT                                         0757
         AL    @10,@SIZDATD                                        0757
         ST    @10,WKANEXT(,@15)                                   0757
*       CCLWRKL=CCLWRKL&&CCLWRKL;       /*CLEAR WORK AREA*/        0758
         XC    CCLWRKL(127),CCLWRKL                                0758
*       IF NCSPLVBF = NCSVFORC          /* IF FORCE DEACT    @DA06111*/
*         × NCSPLVBF = NCSVRACT         /* OR FORCE REACT    @DA06111*/
*         × (RPRHDTYP = RPRENTSW        /* OR IF A SW PU     @XM09430*/
*         & RPRENTRY = RPRENTCC)        /*         @XM08671  @XM09430*/
*         THEN  /*SEGMENT(CCLFORC)REQUEST*/DO;GOTO CCLFORC;CCLFORC#:END
         CLC   NCSPLVBF(2,CCLNCSPL),@CB02111                       0759
         BE    @RT00759                                            0759
         CLC   NCSPLVBF(2,CCLNCSPL),@CB02113                       0759
         BE    @RT00759                                            0759
         CLI   RPRHDTYP(CCLRDT),X'04'                              0759
         BNE   @RF00759                                            0759
         CLI   RPRENTRY(CCLRDT),X'71'                              0759
         BNE   @RF00759                                            0759
@RT00759 DS    0H                                                  0760
         B     CCLFORC                                             0761
* /* THEN SET UP ERP @DA06111*/                                    0763
*         ELSE                          /*          @DA06111 @ZA13630*/
*          DO;                                            /* @ZA13630*/
         B     @RC00759                                            0763
@RF00759 DS    0H                                                  0764
*/* * * * * * * * * * * * * * * * * * * * * * * * * * * * *  @ZA13630*/
*/* TEST FOR FAILURE AT PREVIOUS REOCVERY ATTEMPTS IN THIS   @ZA13630*/
*/* SESSION                                                  @ZA13630*/
*/* * * * * * * * * * * * * * * * * * * * * * * * * * * * *  @ZA13630*/
*          CCLLCK = ON;                                   /* @ZA13630*/
         OI    CCLLCK,B'01000000'                                  0764
*          CALL CCLLOCK;                                  /* @ZA13630*/
         BAL   @14,CCLLOCK                                         0765
*          IF CCLLCK = OFF               /* IF SESSION DOES  @ZA13630*/
*            × (CCLLCK = ON &            /* NOT EXIST OR IF  @ZA13630*/
*              NCBFMCBA->FMCHPURG = ON)  /* SESSION EXIST    @ZA13630*/
*              THEN DO;                  /* AND HARD PURGE   @ZA13630*/
         TM    CCLLCK,B'01000000'                                  0766
         BZ    @RT00766                                            0766
         TM    CCLLCK,B'01000000'                                  0766
         BNO   @RF00766                                            0766
         L     @15,CCLNCB                                          0766
         L     @15,NCBFMCBA(,@15)                                  0766
         TM    FMCHPURG(@15),B'01000000'                           0766
         BNO   @RF00766                                            0766
@RT00766 DS    0H                                                  0767
*                 CCLLCK = OFF;          /* HAS BEEN DONE -  @ZA13630*/
         NI    CCLLCK,B'10111111'                                  0768
*                 CALL CCLLOCK;          /* RELEASE DAF LOCK @ZA13630*/
         BAL   @14,CCLLOCK                                         0769
*                 GOTO CCLOUT;           /* AND EXIT         @ZA13630*/
         B     CCLOUT                                              0770
*                 END;                                    /* @ZA13630*/
*              ELSE DO;                  /* HARD PURGE HAS   @ZA13630*/
@RF00766 DS    0H                                                  0773
*                 CCLLCK = OFF;          /* NOT OCCURED      @ZA13630*/
         NI    CCLLCK,B'10111111'                                  0773
*                 CALL CCLLOCK;                           /* @ZA13630*/
         BAL   @14,CCLLOCK                                         0774
*                 END;                                    /* @ZA13630*/
*          END;                                           /* @ZA13630*/
*        /*SEGMENT(CCLCNFS)REQUEST*/DO;GOTO CCLCNFS;CCLCNFS#:END;     /
* SET SICK FLAGS             */                                    0777
@RC00759 DS    0H                                                  0778
         B     CCLCNFS                                             0778
CCLCNFS# DS    0H                                                  0780
*       NCSPLCID=SAF0+RPRDAF;          /* SET UP CID                 */
         LH    @15,RPRDAF(,CCLRDT)                                 0780
         N     @15,@CF05852                                        0780
         ST    @15,NCSPLCID(,CCLNCSPL)                             0780
*       NCSPLRAD=NCSPLRPT;             /* SET UP RAD         @DM09611*/
         L     @15,NCSPLRPT(,CCLNCSPL)                             0781
         ST    @15,NCSPLRAD(,CCLNCSPL)                             0781
*       IF RPRENTRY=RPRENTLC           /* LOCAL 3270                 */
*         THEN DO;                                                 0782
         CLI   RPRENTRY(CCLRDT),X'45'                              0782
         BNE   @RF00782                                            0782
*              CCLSWN = ON;            /*SET TO NOTIFY USER  @X50BHEM*/
         OI    CCLSWN,B'00100000'                                  0784
*              CALL CCLHARD;           /*HARD CASE           @DM09834*/
         BAL   @14,CCLHARD                                         0785
*              END;                                                0786
*         ELSE                         /* NO */                    0787
*          DO;                                                     0787
         B     @RC00782                                            0787
@RF00782 DS    0H                                                  0788
*          CCLLCK=ON;                  /* INDICATE LOCK REQUEST      */
         OI    CCLLCK,B'01000000'                                  0788
*          CALL CCLLOCK;               /* IF CIDFIND         @DA08954*/
         BAL   @14,CCLLOCK                                         0789
*          IF CCLLCK = ON              /* IS SUCCESSFUL      @DA08954*/
*            THEN                                                  0790
         TM    CCLLCK,B'01000000'                                  0790
         BNO   @RF00790                                            0790
*             DO;                                                  0791
*/********************************************************************/
*/*    DETERMINE IF THE ERROR OCCURED ON 370X OR CLUSTER CTL         */
*/*    AND GO TO THE APPROPRIATE SUBROUTINE                          */
*/*    UPON RETURN CCLSW1=ON IF VARY DEACTIVATE OR START UP IS IN    */
*/*                  CCLSW2=ON IF THIS IS A RECURSIVE ERROR          */
*/*            CCLSWN=ON IF USER IS TO BE NOTIFIED                  */
*/********************************************************************/
*        IF RPRENTRY = RPRENTLU   /* IF ERP IS FOR AN LU     @DA06111*/
*          THEN IF NCBFORCE = ON  /* AND IT IS RECURSIVE     @DA06111*/
         CLI   RPRENTRY(CCLRDT),X'81'                              0792
         BNE   @RF00792                                            0792
*            THEN CCLSW1 = ON;    /* DO NOT ISSUE DEACT      @DA06111*/
         L     @15,CCLNCB                                          0793
         TM    NCBFORCE(@15),B'00000100'                           0793
         BNO   @RF00793                                            0793
         OI    CCLSW1,B'10000000'                                  0794
*            ELSE DO;             /* ELSE PROC LU ERP:       @DA06111*/
         B     @RC00793                                            0795
@RF00793 DS    0H                                                  0796
*              NCBFORCE = ON;     /* INDIC LU ERP RECVD      @DA06111*/
         L     @15,CCLNCB                                          0796
         OI    NCBFORCE(@15),B'00000100'                           0796
*              RFY WKPT2 RSTD;    /* RESTRICT WORK REG       @DA06111*/
*              IF NCSPLRPT->RLUACTLU = OFF /* IF ACTIVATE    @DA06111*/
*                                 /* IS IN PROCESS FOR LU    @DA06111*/
*                THEN CCLSW1 = ON;/* THEN DO NOT DO DEACT    @DA06111*/
         L     @15,NCSPLRPT(,CCLNCSPL)                             0798
         TM    RLUACTLU(@15),B'10000000'                           0798
         BNZ   @RF00798                                            0798
         OI    CCLSW1,B'10000000'                                  0799
*                ELSE CCLSWN = ON;/* ELSE NOTIFY USER        @DA06111*/
         B     @RC00798                                            0800
@RF00798 OI    CCLSWN,B'00100000'                                  0800
*              END;               /*                         @DA06111*/
*          ELSE                   /* IF NOT AN LU ERP:       @DA06111*/
*            IF RPRENTRY=RPRENTRN                                  0802
*             THEN  /*SEGMENT(CCLRN)REQUEST*/DO;GOTO CCLRN;CCLRN#:END;
         B     @RC00792                                            0802
@RF00792 CLI   RPRENTRY(CCLRDT),X'01'                              0802
         BNE   @RF00802                                            0802
         B     CCLRN                                               0804
*             ELSE  /*SEGMENT(CCLCLUS)REQUEST*/DO;GOTO CCLCLUS;CCLCLUS#
         B     @RC00802                                            0806
@RF00802 DS    0H                                                  0807
         B     CCLCLUS                                             0807
*END;/*              @DA06111*/                                    0808
CCLCLUS# DS    0H                                                  0809
*            NCBRSTRT=ON;                                          0809
@RC00802 DS    0H                                                  0809
@RC00792 L     @15,CCLNCB                                          0809
         OI    NCBRSTRT(@15),B'00100000'                           0809
*            CCLLCK=OFF;             /*RELEASE LOCK*/              0810
         NI    CCLLCK,B'10111111'                                  0810
*            CALL CCLLOCK;                                         0811
         BAL   @14,CCLLOCK                                         0811
*            IF CCLSW2=ON               /*RECURSIVE          @DM09834*/
*             THEN DO;                                     /*@DM09834*/
         TM    CCLSW2,B'01000000'                                  0812
         BNO   @RF00812                                            0812
*                IF NCSPLMOM=ON        /* MOM                @DM09834*/
*                & NCSPLVBF=NCSEERRA   /*AND SOFT            @DM09834*/
*                 THEN DO;    /* THEN NOT TRUE RECURSIVE     @DM09834*/
         TM    NCSPLMOM(CCLNCSPL),B'10000000'                      0814
         BNO   @RF00814                                            0814
         CLC   NCSPLVBF(2,CCLNCSPL),@CB02052                       0814
         BNE   @RF00814                                            0814
*/********************************************************************/
*/*    SW2 IS SET    THEREFORE AN ERP NCSPL                         */
*/*  FOR THIS NODE WAS BEING PROCESSED WHEN MOM FAILED.IF CONTACT   */
*/*  WAS FLUSHED THE RECOVERY PROCESS FOR THE ORIGINAL ERROR AT THIS */
*/*  NODE WAS TERMINATED AND THE NCSPL WAS FREED. IF NOT THEN DLR IS */
*/*  PROCESSING A COMMAND ON THAT NCSPL AND PURGE WILL FLUSH IT .    */
*/*  XXXPRGDN IS SET IN CASE THAT COMMAND COMPLETES BEFORE IN CAN BE */
*/*  PURGED. XXXOUERP IS SET SO CCLRET WILL RECOGNIZE THE SITUATION  */
*/* AND FREE THAT NCSPL. RECOVERY WILL CONTINUE FOR THE NCSPL WITH   */
*/*  MOM SET                                                         */
*/********************************************************************/
*                  CCLSW2=OFF;    /* NOT TRUE RECOURSIVE     @DM09834*/
         NI    CCLSW2,B'10111111'                                  0816
*                  IF RPRENTRY=RPRENTRN     /*370X           @DM09834*/
*                   THEN IF RDTCTCFL=ON    /*CONTACT FLUSHED @DM09834*/
         CLI   RPRENTRY(CCLRDT),X'01'                              0817
         BNE   @RF00817                                            0817
*                       THEN  RDTCTCFL=OFF; /*CLR CNTC FLSHD @DM09834*/
         TM    RDTCTCFL(CCLRDT),B'00010000'                        0818
         BNO   @RF00818                                            0818
         NI    RDTCTCFL(CCLRDT),B'11101111'                        0819
*                       ELSE DO;   /*CONTACT NOT FLUSHED     @DM09834*/
         B     @RC00818                                            0820
@RF00818 DS    0H                                                  0821
*                            RDTPRGDN=ON; /* SET PRGDN       @DM09834*/
*                            RDTOUERP=ON; /*SET OUERP        @DM09834*/
         OI    RDTPRGDN(CCLRDT),B'11000000'                        0822
*                            END;                          /*@DM09834*/
*                   ELSE IF RCCCTCFL=ON   /*CLUST CTL        @DM09834*/
*                       THEN  RCCCTCFL=OFF;  /*CLEAR         @DM09834*/
         B     @RC00817                                            0824
@RF00817 TM    RCCCTCFL(CCLRDT),B'01000000'                        0824
         BNO   @RF00824                                            0824
         NI    RCCCTCFL(CCLRDT),B'10111111'                        0825
*                       ELSE DO; /*CONTACT NOT FLUSHED       @DM09834*/
         B     @RC00824                                            0826
@RF00824 DS    0H                                                  0827
*                            RCCPRGDN=ON; /*SET PRGDN        @DM09834*/
*                            RCCOUERP=ON; /*SET OUERP        @DM09834*/
         OI    RCCPRGDN(CCLRDT),B'00000110'                        0828
*                            END;                          /*@DM09834*/
*                  CALL CCLSOFT;                           /*@DM09834*/
@RC00824 DS    0H                                                  0830
@RC00817 BAL   @14,CCLSOFT                                         0830
*                  END;                                    /*@DM09834*/
*                 ELSE CALL CCLHARD;    /*TRUE RECURSIVE     @DM09834*/
         B     @RC00814                                            0832
@RF00814 BAL   @14,CCLHARD                                         0832
*                END;                                      /*@DM09834*/
*             ELSE DO;                                             0834
         B     @RC00812                                            0834
@RF00812 DS    0H                                                  0835
*               CCLMSGID=MSG619I;    /*RECOVERY IN PROGRESS*/      0835
         MVC   CCLMSGID(4),@CC04612                                0835
*               CALL CCLWTO;                                       0836
         BAL   @14,CCLWTO                                          0836
*               IF (RPRENTRY = RPRENTRN /* IF IT IS A 370X   @X50BHEM*/
*                  & RRNRBREM = ON)     /* WHICH IS REMOTE   @X50BHEM*/
*                  THEN; /* THEN NOTIFY USER AFTER ACTPU     @X50BHEM*/
         CLI   RPRENTRY(CCLRDT),X'01'                              0837
         BNE   @RF00837                                            0837
         TM    RRNRBREM(CCLRDT),B'00000100'                        0837
         BO    @RT00837                                            0837
*                  ELSE CALL CCLNTFU;   /* ELSE NOTIFY NOW   @X50BHEM*/
@RF00837 BAL   @14,CCLNTFU                                         0839
*               IF CCLSW1=ON           /*VARY DEACT OR START UP*/  0840
*                 THEN DO;                                         0840
@RT00837 TM    CCLSW1,B'10000000'                                  0840
         BNO   @RF00840                                            0840
*                      NCSPLMOM=OFF;    /*DONOT CARE IF MUM*/      0842
         NI    NCSPLMOM(CCLNCSPL),B'01111111'                      0842
*                      NCSPLVBF=NCSEDACT;  /*HARD*/                0843
         MVC   NCSPLVBF(2,CCLNCSPL),@CB02056                       0843
*                      CALL CCLHARD;   /*TREAT AS HARD*/           0844
         BAL   @14,CCLHARD                                         0844
*                      END;                                        0845
*                 ELSE DO;                                         0846
         B     @RC00840                                            0846
@RF00840 DS    0H                                                  0847
*                      /* IF NOT A SOFT ERROR, OR            @D32CKLB*/
*                      /* IF ON PU IN SWITCHED OR            @D32CKLB*/
*                      /* LOCAL SUBAREA, THEN                @D32CKLB*/
*                      /* TREAT AS HARD ERROR                @D32CKLB*/
*                      IF NCSPLVBF^=NCSEERRA               /*@D32CKLB*/
*                         ×(RPRENTRY=RPRENTCC&RPRHDTYP=RPRENTSW)   0847
*                         ×(RPRENTRY=RPRENTCC&RPRHDTYP=RPRENTLS)   0847
*                         THEN DO;                         /*@D32CKLB*/
         CLC   NCSPLVBF(2,CCLNCSPL),@CB02052                       0847
         BNE   @RT00847                                            0847
         CLI   RPRENTRY(CCLRDT),X'71'                              0847
         BNE   @GL00009                                            0847
         CLI   RPRHDTYP(CCLRDT),X'04'                              0847
         BE    @RT00847                                            0847
@GL00009 CLI   RPRENTRY(CCLRDT),X'71'                              0847
         BNE   @RF00847                                            0847
         CLI   RPRHDTYP(CCLRDT),X'05'                              0847
         BNE   @RF00847                                            0847
@RT00847 DS    0H                                                  0848
*                              CALL CCLHARD;               /*@D32CKLB*/
         BAL   @14,CCLHARD                                         0849
*                              END;                        /*@D32CKLB*/
*                         ELSE CALL CCLSOFT; /* SOFT         @D32CKLB*/
         B     @RC00847                                            0851
@RF00847 BAL   @14,CCLSOFT                                         0851
*                      END;                                        0852
*               END;                                               0853
*               END;                                       /*@DA08954*/
*             ELSE DO;            /* CIDFIND FAILED @DA06111 @ZA13630*/
         B     @RC00790                                            0855
@RF00790 DS    0H                                                  0856
*    CCLOUT:    IF NCSFORCE = ON  /* AND FORCE DEACT COMMAND @DA06111*/
*                  & FORCERPH=CCL0/* AND NO RPH TO POST      @XM08998*/
*                  & NCSPLMOM = OFF /* NOT A SPINOFF         @DM04924*/
*                 THEN DO;        /* THEN WRITE PROC UNAVAIL @DA06111*/
CCLOUT   TM    NCSFORCE(CCLNCSPL),B'00100000'                      0856
         BNO   @RF00856                                            0856
         L     @15,FORCERPH                                        0856
         LTR   @15,@15                                             0856
         BNZ   @RF00856                                            0856
         TM    NCSPLMOM(CCLNCSPL),B'10000000'                      0856
         BNZ   @RF00856                                            0856
*                   CCLMSGID = MSG414I;/* MESSAGE            @DA06111*/
         MVC   CCLMSGID(4),@CC04618                                0858
*                   CALL CCLWTO;  /* TO ACKNOWLEDGE          @DA06111*/
         BAL   @14,CCLWTO                                          0859
*                   END;          /* THE FORCE DEACT COMMAND @DA06111*/
*               CCLTPQR = 0;      /* INDIC FREE NCSPL, EXIT  @DA06111*/
@RF00856 SLR   CCLTPQR,CCLTPQR                                     0861
*               END;              /* END CIDFIND FAILED      @DA06111*/
*             END;                                                 0863
@RC00790 DS    0H                                                  0864
*        END;                                                      0864
@RC00782 DS    0H                                                  0865
*/********************************************************************/
*/*    UPON RETURN FROM CCLRET,CCLSOFT,OR CCLHARD CCLTPQR CONTAINS   */
*/*  EITHER THE ADDRESS OF A PAB (DLR OR VARY) TO TPQUE TO OR ZERO,  */
*/*  INDICATING THE NCSPL CAN BE FREED                               */
*/********************************************************************/
*RFY WKPT1 RSTD;                                                   0865
@RC00751 DS    0H                                                  0866
*IF NCSPLSPL ^= CCL0              /* IF (DIS)CONTACT NCSPL   @DA06111*/
*  THEN DO;                       /* IS NOT FREED YET        @DA06111*/
         SLR   @15,@15                                             0866
         L     @10,NCSPLSPL(,CCLNCSPL)                             0866
         CR    @10,@15                                             0866
         BE    @RF00866                                            0866
*    WKPT1 = NCSPLSPL;            /* THEN SET PARAMETER      @DA06111*/
         LR    WKPT1,@10                                           0868
*    NCSPLSPL = CCL0;             /* ZERO AUX NCSPL POINTER  @DA06111*/
         ST    @15,NCSPLSPL(,CCLNCSPL)                             0869
*    CALL CCLFREE;                /* AND GO FREE THE NCSPL   @DA06111*/
         BAL   @14,CCLFREE                                         0870
*    END;                         /*                         @DA06111*/
*RFY WKPT5 RSTD;                  /* RESTRICT RPH PTR REG    @XM09430*/
@RF00866 DS    0H                                                  0873
*WKPT5 = FORCERPH;                /* GET ADDR OF RPH TO POST @DA06111*/
         L     WKPT5,FORCERPH                                      0873
*IF CCLTPQR=CCL0                                                   0874
*  THEN DO;  /*FINISHED-FREE NCSPL*/                               0874
         SLR   @15,@15                                             0874
         CR    CCLTPQR,@15                                         0874
         BNE   @RF00874                                            0874
*    IF RPRHDTYP = RPRENTSW &     /* IF SWITCHED PU ERP      @XM09430*/
*       RPRENTRY = RPRENTCC       /*                         @XM08666*/
*      THEN DO;                   /* THEN DO NOT FREE NCSPL  @XM09430*/
         CLI   RPRHDTYP(CCLRDT),X'04'                              0876
         BNE   @RF00876                                            0876
         CLI   RPRENTRY(CCLRDT),X'71'                              0876
         BNE   @RF00876                                            0876
*        IF WKPT5 ^= CCL0         /* IF CONTACT RPH SAVED    @XM09430*/
*          THEN DO;                                                0878
*                                                                  0878
         CLR   WKPT5,@15                                           0878
         BE    @RF00878                                            0878
*/*TPPOST  (WKPT5)  */                                             0880
*            DO;                                                   0880
*                                       /*DECLARE AND RESTRICT REGS*/
*              RESPECIFY (GPR00F,GPR01F,GPR04F,GPR05F,             0881
*                        GPR06F,GPR14F,GPR15F) RSTD;               0881
*                                       /*0,1,4,5,6,14, AND 15   */
*                                                                  0882
*/* ATBUILD (ISTPAB,ISTDYPAB,ISTRPH)  */                           0882
*/* END OF ATBUILD */                                              0882
*              GEN REFS(GPR01P,GPR02F,GPR06F)SETS(RPHWORK);        0882
        STM GPR02F,GPR06F,RPHWORK(GPR01P)
*              GPR04F=WKPT5;            /*LOAD RPH PNTR INTO REG 4*/
         LR    GPR04F,WKPT5                                        0883
*              RFY GPR03F RSTD;                                    0884
*              GPR03F=0;                                           0885
*                                                                  0885
         SLR   @10,@10                                             0885
         LR    GPR03F,@10                                          0885
*            DO; /*MODESET  SAVEKEY(GPR06F) KEYADDR(GPR03F) WORKREG(GPR
*5F)*/         RESPECIFY (GPR02F) RESTRICTED;                      0886
*              GPR05F = GPR02F; /*SAVE REGISTER 2*/                0888
         LR    GPR05F,GPR02F                                       0888
*              IPK; /*SAVE CURRENT PSW KEY*/                       0889
         IPK                                                       0889
*              GPR06F = GPR02F;                                    0890
         LR    GPR06F,GPR02F                                       0890
*              GPR02F = GPR05F; /*RESTORE REGISTER 2*/             0891
         LR    GPR02F,GPR05F                                       0891
*              SPKA (GPR03F); /*SET PSW KEY*/                      0892
         SPKA  0(GPR03F)                                           0892
*              RESPECIFY (GPR02F) UNRESTRICTED;                    0893
*            END; /*MODESET  SAVEKEY(GPR06F) KEYADDR(GPR03F) WORKREG(GP
*05F)*/        RFY GPR03F UNRSTD;                                  0894
*              GPR05P=GPR04P->RPHMAJCB+GPR04P->RPHPABOF;           0896
         L     GPR05P,RPHMAJCB-1(,GPR04P)                          0896
         LA    GPR05P,0(,GPR05P)                                   0896
         SLR   @09,@09                                             0896
         IC    @09,RPHPABOF(,GPR04P)                               0896
         ALR   GPR05P,@09                                          0896
*                                       /*LOAD REG 5  WITH ADDR OF*/
*                                       /*MAJOR CONTROL BLOCK PLUS*/
*                                       /*OFFSET OF PAB IN BLOCK  */
*              GPR14P=0;                /*LOAD 0 INTO REG 14      */
         LR    GPR14P,@10                                          0897
*              GPR15P='FFFFFFFF'X;      /*LOAD REG 15 WITH DUMMY  */
         SLR   GPR15P,GPR15P                                       0898
         BCTR  GPR15P,0                                            0898
*                                       /*ADDRESS                 */
*              CS (GPR14P,GPR15P,GPR04P->RPHRESMA);                0899
         CS    GPR14P,@15,RPHRESMA(GPR04P)                         0899
*                                       /*COMPARE RESUME ADDRESS  */
*                                       /*WITH 0 AND,IF EQUAL, PUT*/
*                                       /*DUMMY ADDRESS IN CONTROL*/
*                                       /*BLOCK RESUME ADDRESS    */
*              BC (8,FMZT0040);         /*IF EQUAL, BYPASS REMAINDER*/
         BC    8,FMZT0040                                          0900
*                                       /*OF EXPANSION              */
*FMZL0040:     IF GPR04P->RPHWT='1'B THEN                          0901
FMZL0040 TM    RPHWT(GPR04P),B'00001000'                           0901
         BNO   @RF00901                                            0901
*                                       /*WT/EXT CONTENTION FLAG ON */
*              DO;                      /*IN RPH                    */
*                GPR14P=GPR04P->RPHRESMA×RPHWT1;                   0903
         L     GPR14P,RPHRESMA(,GPR04P)                            0903
         O     GPR14P,@CF01354                                     0903
*                                       /*LOAD REG 14 WITH FLAG FIELD*/
*                                       /*AND MAKE CERTAIN WT/EXT    */
*                                       /*CONTENTION FLAG STILL ON   */
*                GPR15P=GPR14P×RPHPT1;  /*LOAD REG 15 WITH FLAG FIELD*/
         LR    GPR15P,GPR14P                                       0904
         O     GPR15P,@CF01358                                     0904
*                                       /*AND TURN POST FLAG ON      */
*                CS (GPR14P,GPR15P,GPR04P->RPHRESMA);              0905
         CS    GPR14P,@15,RPHRESMA(GPR04P)                         0905
*                                       /*COMPARE REG 14 WITH FLAG */
*                                       /*FIELD--IF WT/EXT BIT ON, */
*                                       /*TURN ON POST FLAG        */
*                BC (4,FMZL0040);       /*IF WT/EXT BIT WAS OFF, LOOP*/
         BC    4,FMZL0040                                          0906
*                                       /*TO TEST CONTENTION FLAG    */
*                BC (8,FMZT0040);       /*IF WT/EXT BIT WAS OFF,     */
         BC    8,FMZT0040                                          0907
*                                       /*BRANCH TO BYPASS CODE GEN  */
*              END;                     /*IF POST FLAG IS ON, FALL*/
*                                       /*THRU BOTTOM OF LOOP     */
*              ELSE;                    /*WT/EXT CONTENTION FLAG OFF*/
@RF00901 DS    0H                                                  0910
*              IF GPR04P->RPHTSKID=GPR01P->RPHTSKID                0910
*              THEN DO;                                            0910
         CLC   RPHTSKID(4,GPR04P),RPHTSKID(GPR01P)                 0910
         BNE   @RF00910                                            0910
*                GPR05P->PABCHNGP=GPR01P->RPHPABQP;                0912
         MVC   PABCHNGP(3,GPR05P),RPHPABQP(GPR01P)                 0912
*                                       /*PUT PAB QUEUE ADDRESS*/  0913
*                                       /*IN SECOND WORD OF PAB     */
*                GPR01P->RPHPABQP=GPR05P;                          0913
         STCM  GPR05P,7,RPHPABQP(GPR01P)                           0913
*                                       /*PUT PAB ADDRESS (IN MAJOR */
*                                       /*CONTROL BLOCK) IN PAB */ 0914
*                                       /*QUEUE ADRESS IN RPH    */
*                END;                                              0914
*              ELSE DO;                                            0915
         B     @RC00910                                            0915
@RF00910 DS    0H                                                  0916
*                GPR00F=0;              /*SET REG 0 TO INDICATE ENA*/
*                                                                  0916
         SLR   GPR00F,GPR00F                                       0916
*            DO; /* LISATCVT CVTBASE(PAGEABLE,(GPR15P)) */         0917
*              GPR15P = ATCLCPTR; /*SET UP ATCVT POINTER*/         0918
         L     GPR15P,ATCLCPTR                                     0918
*            END; /*LISATCVT*/          /*PUT POINTER TO ATCVT IN */
*                                       /*  IN REG 15             */
*                CALL GPR15P->ATCAP32;  /* CALL ISTAPC32: TPSCHED */
         L     @10,ATCAP32(,GPR15P)                                0920
         LR    @15,@10                                             0920
         BALR  @14,@15                                             0920
*                END;                                              0921
*FMZT0040:                                                         0922
*            DO; /*MODESET  KEYADDR(GPR06F) WORKREG(GPR05F)*/      0922
@RC00910 DS    0H                                                  0922
FMZT0040 DS    0H                                                  0923
*              GPR05F = GPR06F; /*GET KEY FORM SAVE LOCATION*/     0923
         LR    GPR05F,GPR06F                                       0923
*              SPKA (GPR05F); /*SET PSW KEY*/                      0924
         SPKA  0(GPR05F)                                           0924
*            END; /*MODESET  KEYADDR(GPR06F) WORKREG(GPR05F)*/     0925
*              GEN REFS(GPR04P,                                    0926
*              RPHWORK)                                            0926
*                  SETS(GPR02F,GPR03F,                             0926
*                        GPR04F,GPR05F,GPR06F);                    0926
        LM GPR02F,GPR06F,RPHWORK(GPR01P)
*              RESPECIFY (GPR00F,GPR01F,GPR04F,GPR05F,GPR06F,      0927
*              GPR14F,GPR15F) UNRSTD;   /*UNRESTRICT REGS 0,1,    */
*                                       /*4,5,14, AND 15          */
*            END;  /****END OF TPPOST GENERATION****/       /* THEN TPP
*ST CONTACT RPH @XM09430*/                                         0928
*            END;                                                  0929
*GENERATE;                        /* AND RETURN TO ISTINCE9  @XM09430*/
@RF00878 DS    0H                                                  0930
          L     13,4(13)          /* ADDR CALLER SAVE AREA   @XM09430*/
          LM    14,12,12(13)      /* RESTORE CALLER REGS     @XM09430*/
          BR    14                /* RETURN TO ISTINCE9      @XM09430*/
*        END;                     /* END SWITCHED PU ERP     @XM09430*/
*       WKPT1=CCLNCSPL;  /*NCSPL TO BE FREED*/                     0932
@RF00876 LR    WKPT1,CCLNCSPL                                      0932
*       CCLSV = ADDR(CCLR1->RPHCRR->CRACRR->VYCRRSAV);     /*@VS40762*/
         L     @15,RPHCRR(,CCLR1)                                  0933
         L     CCLSV,CRACRR(,@15)                                  0933
         LA    CCLSV,VYCRRSAV(,CCLSV)                              0933
*       CALL CCLFREE;                                              0934
         BAL   @14,CCLFREE                                         0934
*       END;                                                       0935
*  ELSE DO;  /* TPQ NCSPL TO PAB IN CCLTPQR*/                      0936
         B     @RC00874                                            0936
@RF00874 DS    0H                                                  0937
*       RFY ISTDYPAB BASED(WKPT1);                                 0937
*       WKPT1=CCLTPQR;   /* TPQUE CLOBBERS REG 2*/                 0938
         LR    WKPT1,CCLTPQR                                       0938
*       WKASPTR=CCLSV;  /* SAVEAREA PTR FOR DLR PROCESSOR*/        0939
*                                                                  0939
         L     @15,NCSPLWKA(,CCLNCSPL)                             0939
         L     @15,WKANEXT(,@15)                                   0939
         ST    CCLSV,WKASPTR(,@15)                                 0939
*/*  TPQUE (CCLNCSPL,DYPPAB) NORM */                               0940
*                                                                  0940
*        DO;                                                       0940
*        RFY (GPR00P,GPR01P,GPR04P,GPR05P,GPR15P) RSTD;            0941
*        GEN REFS(GPR01P) SETS(RPHWORK)                            0942
*        (STM GPR02P,GPR08P,RPHWORK(GPR01P));                      0942
         STM GPR02P,GPR08P,RPHWORK(GPR01P)
*        GPR00P=0;                                                 0943
         SLR   GPR00P,GPR00P                                       0943
*        GPR15P=ADDR(DYPPAB); /*HOLD PAB PTR*/                     0944
         LA    GPR15P,DYPPAB(,WKPT1)                               0944
*        GPR04P=CCLNCSPL; /*WORK ELE PTR*/                         0945
*        GPR05P=GPR15P; /*PASS PAB PTR*/                           0946
         LR    GPR05P,GPR15P                                       0946
*        CALL ATCLCPTR->ATCAP37->ISTAPC37;                         0947
         L     @10,ATCLCPTR                                        0947
         L     @15,ATCAP37(,@10)                                   0947
         BALR  @14,@15                                             0947
*        GEN(NOPR  0)NOSETS NOREFS;                                0948
         NOPR  0
*        RFY (GPR00P,GPR01P,GPR04P,GPR05P,GPR15P) UNRSTD;          0949
*        END; /**** END OF TPQUE GENERATION ****/                  0950
*       END;                                                       0951
*  IF WKPT5 ^= CCL0           /* IF AN RPH EXISTS            @DA06111*/
*    THEN                                                          0952
@RC00874 LTR   WKPT5,WKPT5                                         0952
         BZ    @RF00952                                            0952
*/*TPPOST  (WKPT5)  */                                             0953
*          DO;                                                     0953
*                                       /*DECLARE AND RESTRICT REGS*/
*            RESPECIFY (GPR00F,GPR01F,GPR04F,GPR05F,               0954
*                      GPR06F,GPR14F,GPR15F) RSTD;                 0954
*                                       /*0,1,4,5,6,14, AND 15   */
*                                                                  0955
*/* ATBUILD (ISTPAB,ISTDYPAB,ISTRPH)  */                           0955
*/* END OF ATBUILD */                                              0955
*            GEN REFS(GPR01P,GPR02F,GPR06F)SETS(RPHWORK);          0955
        STM GPR02F,GPR06F,RPHWORK(GPR01P)
*            GPR04F=WKPT5;              /*LOAD RPH PNTR INTO REG 4*/
         LR    GPR04F,WKPT5                                        0956
*            RFY GPR03F RSTD;                                      0957
*            GPR03F=0;                                             0958
*                                                                  0958
         SLR   @10,@10                                             0958
         LR    GPR03F,@10                                          0958
*          DO; /*MODESET  SAVEKEY(GPR06F) KEYADDR(GPR03F) WORKREG(GPR05
*)*/         RESPECIFY (GPR02F) RESTRICTED;                        0959
*            GPR05F = GPR02F; /*SAVE REGISTER 2*/                  0961
         LR    GPR05F,GPR02F                                       0961
*            IPK; /*SAVE CURRENT PSW KEY*/                         0962
         IPK                                                       0962
*            GPR06F = GPR02F;                                      0963
         LR    GPR06F,GPR02F                                       0963
*            GPR02F = GPR05F; /*RESTORE REGISTER 2*/               0964
         LR    GPR02F,GPR05F                                       0964
*            SPKA (GPR03F); /*SET PSW KEY*/                        0965
         SPKA  0(GPR03F)                                           0965
*            RESPECIFY (GPR02F) UNRESTRICTED;                      0966
*          END; /*MODESET  SAVEKEY(GPR06F) KEYADDR(GPR03F) WORKREG(GPR0
*F)*/        RFY GPR03F UNRSTD;                                    0967
*            GPR05P=GPR04P->RPHMAJCB+GPR04P->RPHPABOF;             0969
         L     GPR05P,RPHMAJCB-1(,GPR04P)                          0969
         LA    GPR05P,0(,GPR05P)                                   0969
         SLR   @09,@09                                             0969
         IC    @09,RPHPABOF(,GPR04P)                               0969
         ALR   GPR05P,@09                                          0969
*                                       /*LOAD REG 5  WITH ADDR OF*/
*                                       /*MAJOR CONTROL BLOCK PLUS*/
*                                       /*OFFSET OF PAB IN BLOCK  */
*            GPR14P=0;                  /*LOAD 0 INTO REG 14      */
         LR    GPR14P,@10                                          0970
*            GPR15P='FFFFFFFF'X;        /*LOAD REG 15 WITH DUMMY  */
         SLR   GPR15P,GPR15P                                       0971
         BCTR  GPR15P,0                                            0971
*                                       /*ADDRESS                 */
*            CS (GPR14P,GPR15P,GPR04P->RPHRESMA);                  0972
         CS    GPR14P,@15,RPHRESMA(GPR04P)                         0972
*                                       /*COMPARE RESUME ADDRESS  */
*                                       /*WITH 0 AND,IF EQUAL, PUT*/
*                                       /*DUMMY ADDRESS IN CONTROL*/
*                                       /*BLOCK RESUME ADDRESS    */
*            BC (8,FMZT0058);           /*IF EQUAL, BYPASS REMAINDER*/
         BC    8,FMZT0058                                          0973
*                                       /*OF EXPANSION              */
*FMZL0058:   IF GPR04P->RPHWT='1'B THEN /*WT/EXT CONTENTION FLAG ON */
FMZL0058 TM    RPHWT(GPR04P),B'00001000'                           0974
         BNO   @RF00974                                            0974
*            DO;                        /*IN RPH                    */
*              GPR14P=GPR04P->RPHRESMA×RPHWT1;                     0976
         L     GPR14P,RPHRESMA(,GPR04P)                            0976
         O     GPR14P,@CF01354                                     0976
*                                       /*LOAD REG 14 WITH FLAG FIELD*/
*                                       /*AND MAKE CERTAIN WT/EXT    */
*                                       /*CONTENTION FLAG STILL ON   */
*              GPR15P=GPR14P×RPHPT1;    /*LOAD REG 15 WITH FLAG FIELD*/
         LR    GPR15P,GPR14P                                       0977
         O     GPR15P,@CF01358                                     0977
*                                       /*AND TURN POST FLAG ON      */
*              CS (GPR14P,GPR15P,GPR04P->RPHRESMA);                0978
         CS    GPR14P,@15,RPHRESMA(GPR04P)                         0978
*                                       /*COMPARE REG 14 WITH FLAG */
*                                       /*FIELD--IF WT/EXT BIT ON, */
*                                       /*TURN ON POST FLAG        */
*              BC (4,FMZL0058);         /*IF WT/EXT BIT WAS OFF, LOOP*/
         BC    4,FMZL0058                                          0979
*                                       /*TO TEST CONTENTION FLAG    */
*              BC (8,FMZT0058);         /*IF WT/EXT BIT WAS OFF,     */
         BC    8,FMZT0058                                          0980
*                                       /*BRANCH TO BYPASS CODE GEN  */
*            END;                       /*IF POST FLAG IS ON, FALL*/
*                                       /*THRU BOTTOM OF LOOP     */
*            ELSE;                      /*WT/EXT CONTENTION FLAG OFF*/
@RF00974 DS    0H                                                  0983
*            IF GPR04P->RPHTSKID=GPR01P->RPHTSKID                  0983
*            THEN DO;                                              0983
         CLC   RPHTSKID(4,GPR04P),RPHTSKID(GPR01P)                 0983
         BNE   @RF00983                                            0983
*              GPR05P->PABCHNGP=GPR01P->RPHPABQP;                  0985
         MVC   PABCHNGP(3,GPR05P),RPHPABQP(GPR01P)                 0985
*                                       /*PUT PAB QUEUE ADDRESS*/  0986
*                                       /*IN SECOND WORD OF PAB     */
*              GPR01P->RPHPABQP=GPR05P; /*PUT PAB ADDRESS (IN MAJOR */
         STCM  GPR05P,7,RPHPABQP(GPR01P)                           0986
*                                       /*CONTROL BLOCK) IN PAB */ 0987
*                                       /*QUEUE ADRESS IN RPH    */
*              END;                                                0987
*            ELSE DO;                                              0988
         B     @RC00983                                            0988
@RF00983 DS    0H                                                  0989
*              GPR00F=0;                /*SET REG 0 TO INDICATE ENA*/
*                                                                  0989
         SLR   GPR00F,GPR00F                                       0989
*          DO; /* LISATCVT CVTBASE(PAGEABLE,(GPR15P)) */           0990
*            GPR15P = ATCLCPTR; /*SET UP ATCVT POINTER*/           0991
         L     GPR15P,ATCLCPTR                                     0991
*          END; /*LISATCVT*/            /*PUT POINTER TO ATCVT IN */
*                                       /*  IN REG 15             */
*              CALL GPR15P->ATCAP32;    /* CALL ISTAPC32: TPSCHED */
         L     @10,ATCAP32(,GPR15P)                                0993
         LR    @15,@10                                             0993
         BALR  @14,@15                                             0993
*              END;                                                0994
*FMZT0058:                                                         0995
*          DO; /*MODESET  KEYADDR(GPR06F) WORKREG(GPR05F)*/        0995
@RC00983 DS    0H                                                  0995
FMZT0058 DS    0H                                                  0996
*            GPR05F = GPR06F; /*GET KEY FORM SAVE LOCATION*/       0996
         LR    GPR05F,GPR06F                                       0996
*            SPKA (GPR05F); /*SET PSW KEY*/                        0997
         SPKA  0(GPR05F)                                           0997
*          END; /*MODESET  KEYADDR(GPR06F) WORKREG(GPR05F)*/       0998
*            GEN REFS(GPR04P,                                      0999
*            RPHWORK)                                              0999
*                SETS(GPR02F,GPR03F,                               0999
*                      GPR04F,GPR05F,GPR06F);                      0999
        LM GPR02F,GPR06F,RPHWORK(GPR01P)
*            RESPECIFY (GPR00F,GPR01F,GPR04F,GPR05F,GPR06F,        1000
*            GPR14F,GPR15F) UNRSTD;     /*UNRESTRICT REGS 0,1,    */
*                                       /*4,5,14, AND 15          */
*          END;  /****END OF TPPOST GENERATION****/     /* THEN TPPOST
*T              @DA06111*/                                         1001
*RFY WKPT1 UNRSTD;                                                 1002
@RF00952 DS    0H                                                  1003
*RFY WKPT5 UNRSTD;                    /* FREE UP RPH PTR REG @XM09430*/
*EXIT:;                                                    /*@ZA20811*/
EXIT     DS    0H                                                  1005
*/* TPEXIT  NORM */                                                1005
* DO;                                                              1005
*   RESPECIFY GPR15P RSTD;                                         1006
*                                                                  1006
*/* ATBUILD (ISTPAB,ISTDYPAB,ISTATCVT)  */                         1007
*/* END OF ATBUILD */                                              1007
*                                                                  1007
* DO; /* LISATCVT CVTBASE(PAGEABLE,(GPR15P)) */                    1007
*   GPR15P = ATCLCPTR; /*SET UP ATCVT POINTER*/                    1008
         L     GPR15P,ATCLCPTR                                     1008
* END; /*LISATCVT*/                                                1009
*   RESPECIFY GPR00F RSTD;                                         1010
*   GPR00F=4;    /* SET PARAMETER REGISTER TO 4 */                 1011
         LA    GPR00F,4                                            1011
*   GPR15P=GPR15P->ATCAP31;                                        1012
         L     GPR15P,ATCAP31(,GPR15P)                             1012
*   DCL FMZL0070 BASED(GPR15P) LABEL VALUERANGE(*);                1013
*   CALL FMZL0070;                                                 1014
         BALR  @14,@15                                             1014
*   RESPECIFY (GPR00F,GPR15P) UNRSTD;                              1015
* END; /***** END OF TPEXIT  *****/                          /* EXIT*/
* /*SEGMENT(CCLRN)START*/DO;GOTO CCLRN@;CCLRN:END;                 1017
         B     CCLRN@                                              1018
CCLRN    DS    0H                                                  1020
*/********************************************************************/
*/*     PROCESSES ERROR ON 370X                                      */
*/*     OUTPUT: CCLSW2=ON IF ERROR IS RECURSIVE                      */
*/*             CCLSW1=ON IF VARY DEACTIVATE OR START UP IN PROGRESS */
*/*                       FOR THIS NODE                              */
*/*             CCLSWN=ON IF USER IS TO BE NOTIFIED                  */
*/********************************************************************/
*NCSPLP3=RDTEPAB;                       /*PAB PTR FOR DLR*/        1020
         L     @15,RDTEPAB(,CCLRDT)                                1020
         ST    @15,NCSPLP3(,CCLNCSPL)                              1020
*ICNZF010 = OFF;                        /* A.N.S. = NO       @XM09398*/
         L     @06,CCLNCB                                          1021
         L     @15,ICNZF010(,@06)                                  1021
@GL00016 LR    @10,@15                                             1021
         N     @10,@CF05859                                        1021
         CS    @15,@10,ICNZF010(@06)                               1021
         BNE   @GL00016                                            1021
*IF RRNERPIP=ON                                                    1022
*   THEN CCLSW2=ON;                     /* RECURSIVE ERROR*/       1022
         TM    RRNERPIP(CCLRDT),B'00000100'                        1022
         BNO   @RF01022                                            1022
         OI    CCLSW2,B'01000000'                                  1023
*   ELSE DO;                                                       1024
         B     @RC01022                                            1024
@RF01022 DS    0H                                                  1025
*        IF RRNLCDIP=ON                 /* VARY DEACT IN PROG*/    1025
*          THEN DO;                                      /*@DM09911*/
         TM    RRNLCDIP(CCLRDT),B'00001000'                        1025
         BNO   @RF01025                                            1025
*               CCLSW1=ON;                                         1027
         OI    CCLSW1,B'10000000'                                  1027
*               CCLSWN=ON;                  /*NOTIFY USER @DM09911*/
         OI    CCLSWN,B'00100000'                                  1028
*               END;                                               1029
*          ELSE DO;                                                1030
         B     @RC01025                                            1030
@RF01025 DS    0H                                                  1031
*               RRNERPIP=ON;            /* ERP IN PROGRESS*/       1031
         OI    RRNERPIP(CCLRDT),B'00000100'                        1031
*               IF ICNSTART=OFF                                    1032
*                  THEN CCLSWN=ON;             /*NOTIFY USER @DM09911*/
         L     @15,CCLNCB                                          1032
         TM    ICNSTART(@15),B'00000100'                           1032
         BNZ   @RF01032                                            1032
         OI    CCLSWN,B'00100000'                                  1033
*                  ELSE CCLSW1 = ON;    /* ELSE IN START-UP  @DA06111*/
         B     @RC01032                                            1034
@RF01032 OI    CCLSW1,B'10000000'                                  1034
*               END;                                               1035
@RC01032 DS    0H                                                  1036
*        END;                                                      1036
@RC01025 DS    0H                                                  1037
* /*SEGMENT(CCLRN)FINISH*/DO;GOTO CCLRN#;CCLRN@:END;               1037
@RC01022 DS    0H                                                  1038
         B     CCLRN#                                              1038
CCLRN@   DS    0H                                                  1040
* /*SEGMENT(CCLCLUS)START*/DO;GOTO CCLCLUS@;CCLCLUS:END;           1040
         B     CCLCLUS@                                            1041
CCLCLUS  DS    0H                                                  1043
*/********************************************************************/
*/*     PROCESS ERROR ON CLUSTER CTL                                 */
*/*     OUTPUT: CCLSW2=ON IF ERROR IS RECURSIVE                      */
*/*             CCLSW1=ON  IF VARY DEACTIVATE OR START UP IN PROGRESS*/
*/*                       FOR THIS NODE                              */
*/*             CCLSWN=ON IF USER IS TO BE NOTIFIED                  */
*/********************************************************************/
*NCSPLP3=RCCEPAB;                       /*PAB PTR FOR PLR*/        1043
         L     @15,RCCEPAB(,CCLRDT)                                1043
         ST    @15,NCSPLP3(,CCLNCSPL)                              1043
*IF RCCERPIP=ON                                                    1044
*  THEN CCLSW2=ON;                      /*RECURSIVE ERROR*/        1044
         TM    RCCERPIP(CCLRDT),B'00100000'                        1044
         BNO   @RF01044                                            1044
         OI    CCLSW2,B'01000000'                                  1045
*  ELSE DO;                                                        1046
         B     @RC01044                                            1046
@RF01044 DS    0H                                                  1047
*       IF RCCCUDIE=ON                                             1047
*         THEN DO;               /*VARY DEACT IN PROGRESS*/        1047
         TM    RCCCUDIE(CCLRDT),B'01000000'                        1047
         BNO   @RF01047                                            1047
*              CCLSW1=ON;                                          1049
         OI    CCLSW1,B'10000000'                                  1049
*              CCLSWN=ON;               /*NOTIFY USER       @DM09911*/
         OI    CCLSWN,B'00100000'                                  1050
*              END;                                                1051
*         ELSE DO;                                                 1052
         B     @RC01047                                            1052
@RF01047 DS    0H                                                  1053
*              RCCERPIP=ON;             /*ERP IN PROGRESS*/        1053
         OI    RCCERPIP(CCLRDT),B'00100000'                        1053
*              IF RPRHDTYP = RPRENTSW /* IF A SWITCHED PU    @XM09430*/
*                THEN CCLSW1 = ON;    /* THEN SET DEACT IN PR@XM09430*/
         CLI   RPRHDTYP(CCLRDT),X'04'                              1054
         BNE   @RF01054                                            1054
         OI    CCLSW1,B'10000000'                                  1055
*              IF CCNSTART=OFF                                     1056
*                THEN CCLSWN=ON;         /*NOTIFY USER    @DM09911*/
@RF01054 L     @15,CCLNCB                                          1056
         TM    CCNSTART(@15),B'01000000'                           1056
         BNZ   @RF01056                                            1056
         OI    CCLSWN,B'00100000'                                  1057
*                ELSE CCLSW1 = ON;      /* ELSE IN START-UP  @DA06111*/
         B     @RC01056                                            1058
@RF01056 OI    CCLSW1,B'10000000'                                  1058
*              END;                                                1059
@RC01056 DS    0H                                                  1060
*       END;                                                       1060
@RC01047 DS    0H                                                  1061
* /*SEGMENT(CCLCLUS)FINISH*/DO;GOTO CCLCLUS#;CCLCLUS@:END;         1061
@RC01044 DS    0H                                                  1062
         B     CCLCLUS#                                            1062
*CCLSOFT: PROC OPTIONS(NOSAVE,NOSAVEAREA);                         1064
         B     @PB00002                                            1064
CCLSOFT  DS    0H                                                  1065
*/********************************************************************/
*/* PERFORMS INITIAL PROCESSING OF SOFT ERP REQUESTS.                */
*/* THE ROUTINE FIRST CALLS CCLPGNT TO SOFT PURGE VARY'S FMCBS.     */
*/* IF THE FAILING NODE IS AN CLUSTER CTL OR REMOTE 370X THEN        */
*/*  SUBROUTINE CCLCNTC IS CALLED TO DO A CONTACT TO THE DEVICE.     */
*/* IF NOT SUCCESSFUL CCLSOFT STOPS PROCESSING.                     */
*/* FOLLOWING THE CONTACT IF THE FAILING NODE IS A 370X THEN         */
*/* AN ERP REQUEST IS TPQUE ED TO THE DLR PAB AT THE FAILED LEVEL    */
*/* IF AN CLUSTER CTL SUBROUTINE CCLACTP IS CALLED TO INITIATE       */
*/* AN ACTIVATE PHYSICAL OPERATION TO THE CLUSTER                    */
*/********************************************************************/
*CCLSAVE1=CCLR14;            /*SAVE RETURN*/                       1065
         ST    CCLR14,CCLSAVE1                                     1065
*NCSPRMRC=LCPMNSF;           /*INDICATE SOFT PURGE*/               1066
         MVI   NCSPRMRC(CCLNCSPL),X'01'                            1066
*CCLPRG=PRGVO;                 /*PURGE VARY ONLY*/                 1067
         MVI   CCLPRG,X'00'                                        1067
*CALL CCLPGNT;                                                     1068
         BAL   @14,CCLPGNT                                         1068
*CCLQUIT=OFF;                       /*CLEAR SWITCH*/               1069
         NI    CCLQUIT,B'11110111'                                 1069
*IF RPRENTRY=RPRENTRN                                              1070
*   THEN DO;                  /* 370X*/                            1070
         CLI   RPRENTRY(CCLRDT),X'01'                              1070
         BNE   @RF01070                                            1070
*        IF RRNRBREM=ON       /* REMOTE*/                          1072
*          THEN DO;                                                1072
         TM    RRNRBREM(CCLRDT),B'00000100'                        1072
         BNO   @RF01072                                            1072
*            CCLLCK = ON;         /* INDIC SET LOCK          @X50BHEM*/
         OI    CCLLCK,B'01000000'                                  1074
*            CALL CCLLOCK;        /* FIND NCB, SET DAF LOCK  @X50BHEM*/
         BAL   @14,CCLLOCK                                         1075
*            IF CCLLCK = ON       /* IF CIDCTL FIND          @X50BHEM*/
*              THEN DO;           /* IS SUCCESSFUL           @X50BHEM*/
         TM    CCLLCK,B'01000000'                                  1076
         BNO   @RF01076                                            1076
*                NCBTTF = ON;     /* SET TRICKLE TRAFFIC     @X50BHEM*/
         L     @15,CCLNCB                                          1078
         OI    NCBTTF(@15),B'00001000'                             1078
*                CCLLCK = OFF;    /* INDIC RELEASE LOCK      @X50BHEM*/
         NI    CCLLCK,B'10111111'                                  1079
*                CALL CCLLOCK;    /* RELEASE THE DAF LOCK    @X50BHEM*/
         BAL   @14,CCLLOCK                                         1080
*                NCSPL2CN = OFF;  /* INDIC FIRST CONTACT     @X50BHEM*/
         NI    NCSPL2CN(CCLNCSPL),B'11111101'                      1081
*                CALL CCLCNTC;    /* SEND CONTACT REQUEST    @X50BHEM*/
         BAL   @14,CCLCNTC                                         1082
*                IF CCLQUIT = OFF /* IF CONTACT SUCCESSFUL   @X50BHEM*/
*                  THEN IF NCSIORC = NCSLD /* AND IF LOADED  @X50BHEM*/
         TM    CCLQUIT,B'00001000'                                 1083
         BNZ   @RF01083                                            1083
*                    THEN CALL CCLACTP;/* THEN SEND ACTPU    @X50BHEM*/
         CLI   NCSIORC(CCLNCSPL),X'00'                             1084
         BNE   @RF01084                                            1084
         BAL   @14,CCLACTP                                         1085
*                    ELSE NCSPLCMD = NCSCERPP;/* ELSE RELOAD @X50BHEM*/
         B     @RC01084                                            1086
@RF01084 MVC   NCSPLCMD(2,CCLNCSPL),@CB02256                       1086
*                END;             /* END OF CONTACT CODE     @X50BHEM*/
*               END;                                               1088
*          ELSE NCSPLCMD=NCSCERPP;  /*ERP CMND*/                   1089
         B     @RC01072                                            1089
@RF01072 MVC   NCSPLCMD(2,CCLNCSPL),@CB02256                       1089
*        END;                                                      1090
*   ELSE DO;                                                       1091
         B     @RC01070                                            1091
@RF01070 DS    0H                                                  1092
*        CALL CCLCNTC;                                             1092
         BAL   @14,CCLCNTC                                         1092
*        IF CCLQUIT=OFF                                            1093
*           THEN DO;                                               1093
         TM    CCLQUIT,B'00001000'                                 1093
         BNZ   @RF01093                                            1093
*                CALL CCLACTP;                                     1095
         BAL   @14,CCLACTP                                         1095
*                CCLQUIT=ON;       /*CCLACTP WILL SET CCLTPQR*/    1096
         OI    CCLQUIT,B'00001000'                                 1096
*                END;                                              1097
*           ELSE;                                                  1098
@RF01093 DS    0H                                                  1099
*        END;                                                      1099
*IF CCLQUIT=ON                                                     1100
*  THEN ;                                                          1100
@RC01070 TM    CCLQUIT,B'00001000'                                 1100
         BO    @RT01100                                            1100
*  ELSE DO;         /*CCLTPQR=PAB TO TPQ TO IN MAINLINE*/          1102
*       IF RPRENTRY=RPRENTRN                                       1103
*          THEN CCLTPQR=RDTDPAB;                                   1103
         CLI   RPRENTRY(CCLRDT),X'01'                              1103
         BNE   @RF01103                                            1103
         L     CCLTPQR,RDTDPAB(,CCLRDT)                            1104
*          ELSE CCLTPQR=RCCDPAB;                                   1105
         B     @RC01103                                            1105
@RF01103 L     CCLTPQR,RCCDPAB(,CCLRDT)                            1105
*       END;                                                       1106
@RC01103 DS    0H                                                  1107
*CCLR14=CCLSAVE1;                                                  1107
@RT01100 L     CCLR14,CCLSAVE1                                     1107
*END CCLSOFT;                                                      1108
@EL00002 DS    0H                                                  1108
@EF00002 DS    0H                                                  1108
@ER00002 BR    @14                                                 1108
@PB00002 DS    0H                                                  1109
* /*SEGMENT(CCLRET)START*/DO;GOTO CCLRET@;CCLRET:END;              1109
         B     CCLRET@                                             1110
CCLRET   DS    0H                                                  1112
*/********************************************************************/
*/* INITIAL PROCESSOR OF NCSPLS RETURNED FROM DLR.IT ANALIZES RETURN */
*/* CODES AND OTHER INDICATORS TO DETERMINE WHAT PROCESSING IS       */
*/* REQUIRED.                                                        */
*/********************************************************************/
*CCLSV=NCSPLWKA+WKALEN-SAVEADJ;   /*SAVE AREA*/                    1112
         L     @15,NCSPLWKA(,CCLNCSPL)                             1112
         LR    CCLSV,@15                                           1112
         AL    CCLSV,WKALEN(,@15)                                  1112
         SL    CCLSV,@CF01905                                      1112
*CCLWKPT = NCSPLWKA + 8;           /* RESET DATA BASE REG    @XM09430*/
         AL    @15,@CF00060                                        1113
         LR    CCLWKPT,@15                                         1113
*CCLSWW=OFF;  /*CLEAR WORK SWITCH*/                                1114
         NI    CCLSWW,B'11101111'                                  1114
*IF NCSIORC=NCSLDIOP   /*I/O PURGED*/                              1115
*  THEN CCLSWW=ON;                                                 1115
         CLI   NCSIORC(CCLNCSPL),X'08'                             1115
         BNE   @RF01115                                            1115
         OI    CCLSWW,B'00010000'                                  1116
*  ELSE DO;       /* A PURGE MAY HAVE BEEN DONE TO TERMINATE  */   1117
         B     @RC01115                                            1117
@RF01115 DS    0H                                                  1118
*                 /*THIS I/O REQUEST BUT IT COMPLETED BEFORE  */   1118
*                 /*THE PURGE WAS ISSUED .XXXPRGDN FLAG COVERS*/   1118
*                 /*THIS POSSIBILITY */                            1118
*       IF RPRENTRY=RPRENTRN                                       1118
*         THEN IF RDTPRGDN=ON                                      1118
         CLI   RPRENTRY(CCLRDT),X'01'                              1118
         BNE   @RF01118                                            1118
*                 THEN CCLSWW=ON;                                  1119
         TM    RDTPRGDN(CCLRDT),B'01000000'                        1119
         BNO   @RF01119                                            1119
         OI    CCLSWW,B'00010000'                                  1120
*                 ELSE;                                            1121
@RF01119 DS    0H                                                  1122
*         ELSE IF RCCPRGDN=ON                                      1122
*                 THEN CCLSWW=ON;                                  1122
         B     @RC01118                                            1122
@RF01118 TM    RCCPRGDN(CCLRDT),B'00000010'                        1122
         BNO   @RF01122                                            1122
         OI    CCLSWW,B'00010000'                                  1123
*                 ELSE;                                            1124
@RF01122 DS    0H                                                  1125
*       END;                                                       1125
@RC01118 DS    0H                                                  1126
*IF CCLSWW=ON                                                      1126
*  THEN DO;       /*I/O WAS PURGED*/                               1126
@RC01115 TM    CCLSWW,B'00010000'                                  1126
         BNO   @RF01126                                            1126
*       CCLSWW=OFF;     /*CLEAR SWW*/                              1128
         NI    CCLSWW,B'11101111'                                  1128
*       IF NCSFORCE = ON             /* IF FORCE CMD         @DM04898*/
*         THEN DO;                   /* VARY FAILED          @DM04898*/
         TM    NCSFORCE(CCLNCSPL),B'00100000'                      1129
         BNO   @RF01129                                            1129
*           CCLMSGID = MSG034I;      /*                      @DM04898*/
         MVC   CCLMSGID(4),@CC04626                                1131
*           CALL CCLWTO;             /*                      @DM04898*/
         BAL   @14,CCLWTO                                          1132
*           END;                     /*                      @DM04898*/
*       IF RPRENTRY=RPRENTRN                                       1134
*         THEN DO;          /*370X*/                               1134
@RF01129 CLI   RPRENTRY(CCLRDT),X'01'                              1134
         BNE   @RF01134                                            1134
*              IF RDTOUERP=ON                                      1136
*                THEN DO;   /*RECOVERING UNDER MOM*/               1136
         TM    RDTOUERP(CCLRDT),B'10000000'                        1136
         BNO   @RF01136                                            1136
*                     RDTOUERP=OFF;  /*CLEAR OUERP*/               1138
*                     RDTPRGDN=OFF; /*CLEAR PRGDN*/                1139
         NI    RDTOUERP(CCLRDT),B'00111111'                        1139
*                     CCLSWW=ON;    /*SET WORK SWITCH*/            1140
         OI    CCLSWW,B'00010000'                                  1140
*                     END;                                         1141
*                ELSE;                                             1142
@RF01136 DS    0H                                                  1143
*              END;                                                1143
*         ELSE DO; /*CLUSTER CTL*/                                 1144
         B     @RC01134                                            1144
@RF01134 DS    0H                                                  1145
*              IF RCCOUERP=ON                                      1145
*                THEN DO;   /*RECOVERING UNDER MOM*/               1145
         TM    RCCOUERP(CCLRDT),B'00000100'                        1145
         BNO   @RF01145                                            1145
*                     RCCOUERP=OFF; /*CLEAR OUERP*/                1147
*                     RCCPRGDN=OFF; /*CLEAR PRGDN*/                1148
         NI    RCCOUERP(CCLRDT),B'11111001'                        1148
*                     CCLSWW=ON;  /*SET WORK SWITCH*/              1149
         OI    CCLSWW,B'00010000'                                  1149
*                     END;                                         1150
*                ELSE;                                             1151
@RF01145 DS    0H                                                  1152
*              END;                                                1152
*       IF CCLSWW=ON                                               1153
*         THEN CCLTPQR=CCL0;  /*OUERP WAS SET-RECOVERING UNDER MOM*/
@RC01134 TM    CCLSWW,B'00010000'                                  1153
         BNO   @RF01153                                            1153
         SLR   CCLTPQR,CCLTPQR                                     1154
*                             /*NOW FREE THIS NCSPL AND EXIT*/     1155
*         ELSE DO;            /*OUERP NOT SET-RECOVER FINISHED */  1155
         B     @RC01153                                            1155
@RF01153 DS    0H                                                  1156
*                             /* POST ANY WAITING RPHS AND FREE NCSPL*/
*              CCLSW3=ON;     /*TELLS CCLPOST TO FREE NCSPL*/      1156
*              CCLSW2=OFF;    /*TELLS CCLPOST TO POST WAITING RPHS*/
         OI    CCLSW3,B'00100000'                                  1157
         NI    CCLSW2,B'10111111'                                  1157
*              CALL CCLPOST;                                       1158
         BAL   @14,CCLPOST                                         1158
*              END;                                                1159
*       END;                                                       1160
*  ELSE DO; /*IO NOT PURGED */                                     1161
         B     @RC01126                                            1161
@RF01126 DS    0H                                                  1162
*       IF NCSIORC=NCSLDAOK                                        1162
*         THEN DO;        /*CMND SUCCESSFUL*/                      1162
         CLI   NCSIORC(CCLNCSPL),X'00'                             1162
         BNE   @RF01162                                            1162
*              IF NCSPLCMD=NCSCERPP                                1164
*                × NCSPLCMD=NCSCRSRT                               1164
*                THEN  /*SEGMENT(CCLRET1)REQUEST*/DO;GOTO CCLRET1;CCLRE
*1#:END;                                                           1164
         CLC   NCSPLCMD(2,CCLNCSPL),@CB02256                       1164
         BE    @RT01164                                            1164
         CLC   NCSPLCMD(2,CCLNCSPL),@CB02252                       1164
         BNE   @RF01164                                            1164
@RT01164 DS    0H                                                  1165
         B     CCLRET1                                             1166
*                     /*PROCESS ERP OR RESTART*/                   1168
*                ELSE  /*SEGMENT(CCLRET2)REQUEST*/DO;GOTO CCLRET2;CCLRE
*2#:END;                                                           1168
         B     @RC01164                                            1168
@RF01164 DS    0H                                                  1169
         B     CCLRET2                                             1169
*                    /*SDT OR ACT PHYSICAL*/                       1171
*              END;                                                1171
*         ELSE DO;  /*CMND UNSUCCESSFUL-PROCESS AS HARD*/          1172
         B     @RC01162                                            1172
@RF01162 DS    0H                                                  1173
*              NCSPLVBF=NCSEDACT;                                  1173
         MVC   NCSPLVBF(2,CCLNCSPL),@CB02056                       1173
*              NCSPLMOM=OFF;                                       1174
         NI    NCSPLMOM(CCLNCSPL),B'01111111'                      1174
*              CALL CCLHARD;                                       1175
         BAL   @14,CCLHARD                                         1175
*              END;                                                1176
*       END;                                                       1177
@RC01162 DS    0H                                                  1178
* /*SEGMENT(CCLRET)FINISH*/DO;GOTO CCLRET#;CCLRET@:END;            1178
@RC01126 DS    0H                                                  1179
         B     CCLRET#                                             1179
CCLRET@  DS    0H                                                  1181
* /*SEGMENT(CCLRET1)START*/DO;GOTO CCLRET1@;CCLRET1:END;           1181
         B     CCLRET1@                                            1182
CCLRET1  DS    0H                                                  1184
*/********************************************************************/
*/* RECEIVES CONTROL FROM CCLRET TO CONTINUE PROCESSING AFTER A     */
*/* SUCCESSFUL ERP OR RESTART OPERATION                              */
*/*                                                                  */
*/********************************************************************/
*IF NCSPLCMD=NCSCERPP                                              1184
*  THEN DO;    /*ERP*/                                             1184
         CLC   NCSPLCMD(2,CCLNCSPL),@CB02256                       1184
         BNE   @RF01184                                            1184
*       IF RRNRBREM =OFF                                           1186
*          THEN CALL CCLACTP;                              /*@D32CKLB*/
         TM    RRNRBREM(CCLRDT),B'00000100'                        1186
         BNZ   @RF01186                                            1186
         BAL   @14,CCLACTP                                         1187
*          ELSE DO;                                                1188
         B     @RC01186                                            1188
@RF01186 DS    0H                                                  1189
*            NCSPL2CN = ON;   /* INDIC SECOND CONTACT        @X50BHEM*/
         OI    NCSPL2CN(CCLNCSPL),B'00000010'                      1189
*               CCLQUIT=OFF;       /*CLEAR SW*/                    1190
         NI    CCLQUIT,B'11110111'                                 1190
*               CALL CCLCNTC; /* REMOTE 370X*/                     1191
         BAL   @14,CCLCNTC                                         1191
*               IF CCLQUIT=ON  /*CONTACT FAILED*/                  1192
*                  THEN;                                           1192
         TM    CCLQUIT,B'00001000'                                 1192
         BO    @RT01192                                            1192
*                  ELSE CALL CCLACTP;   /* CONTACT OK-NOW ACT PHY*/
         BAL   @14,CCLACTP                                         1194
*               END;                                               1195
*       END;                                                       1196
*  ELSE DO;    /*RESTART*/                                         1197
         B     @RC01184                                            1197
@RF01184 DS    0H                                                  1198
*       NCSPLCMD=NCSNCPPG;       /* PURGE COMMAND CODE       @XM09577*/
         MVC   NCSPLCMD(2,CCLNCSPL),@CB02246                       1198
*       NCSOVFMC=OFF;            /* RESET 'ONLY VARY' FLAG   @XM09577*/
         NI    NCSOVFMC(CCLNCSPL),B'01111111'                      1199
*       NCSOUFMC=OFF;            /* RESET 'ONLY USER' FLAG   @XM09577*/
         NI    NCSOUFMC(CCLNCSPL),B'11101111'                      1200
*       IF RPRENTRY=RPRENTCC                                       1201
*          THEN DO;  /*CLUSTER CTL*/                               1201
         CLI   RPRENTRY(CCLRDT),X'71'                              1201
         BNE   @RF01201                                            1201
*               NCSPRMRC=LCPMNTF;  /*FIRM PURGE*/                  1203
         MVI   NCSPRMRC(CCLNCSPL),X'10'                            1203
*               NCSOUFMC=ON;                                       1204
         OI    NCSOUFMC(CCLNCSPL),B'00010000'                      1204
*               CCLPRG=PRGUO;       /*PURGE USER*/                 1205
         MVI   CCLPRG,X'02'                                        1205
*               NCSPLVBF=NCSEERRA;    /* SET SOFT FAILURE    @D31KKDQ*/
         MVC   NCSPLVBF(2,CCLNCSPL),@CB02052                       1206
*               END;                                               1207
*          ELSE DO;   /*370X*/                                     1208
         B     @RC01201                                            1208
@RF01201 DS    0H                                                  1209
*               NCSPRMRC=LCPMNSF;   /* SOFT PURGE */               1209
         MVI   NCSPRMRC(CCLNCSPL),X'01'                            1209
*               CCLPRG=PRGVU;        /* PURGE VARY AND USER*/      1210
         MVI   CCLPRG,X'04'                                        1210
*               NCSPLVBF=NCSEERRA;    /*SET SOFT             @D31KKDQ*/
         MVC   NCSPLVBF(2,CCLNCSPL),@CB02052                       1211
*               END;                                               1212
*       CALL CCLCNFC;                  /*RESET SICK FLAGS    @DM12195*/
@RC01201 BAL   @14,CCLCNFC                                         1213
*       CALL CCLSPIN;         /*SPIN OFF ERPS TO LOWER NODES*/     1214
         BAL   @14,CCLSPIN                                         1214
*       CCLMSGID=MSG621I;       /*RECOVERY SUCCESSFUL*/            1215
         MVC   CCLMSGID(4),@CC04614                                1215
*       CALL CCLWTO;                                               1216
         BAL   @14,CCLWTO                                          1216
*       IF RPRENTRY=RPRENTRN   /* IF 370X NOTIFY TOLTEP      @D32CKLB*/
*         THEN DO;                                         /*@D32CKLB*/
         CLI   RPRENTRY(CCLRDT),X'01'                              1217
         BNE   @RF01217                                            1217
*               /*SEGMENT(CCLTTEP)REQUEST*/DO;GOTO CCLTTEP;CCLTTEP#:END
         B     CCLTTEP                                             1220
CCLTTEP# DS    0H                                                  1222
*                  /*@D32CKLB*/                                    1222
*              CCLSW3=OFF;        /* SO NCSPL NOT FREED      @D32CKLB*/
         NI    CCLSW3,B'11011111'                                  1222
*              CALL CCLPOST;       /* POST WAITING RPHS      @D32CKLB*/
         BAL   @14,CCLPOST                                         1223
*              NCSPLVCD=NCSPLVC8;  /* 'DIAL' VERB CODE       @D32CKLB*/
         MVI   NCSPLVCD(CCLNCSPL),X'08'                            1224
*              NCSPLVBF=NCSDLRST;  /* 'LINK RESTART'         @D32CKLB*/
         MVC   NCSPLVBF(2,CCLNCSPL),@CB02080                       1225
*              WKANEXT=ADDR(WKAFREE);                      /*@D32CKLB*/
         L     @15,NCSPLWKA(,CCLNCSPL)                             1226
         LA    @10,WKAFREE(,@15)                                   1226
         ST    @10,WKANEXT(,@15)                                   1226
*              CCLTPQR=RDTVPAB;    /* 370X VARY PAB          @D32CKLB*/
         L     CCLTPQR,RDTVPAB(,CCLRDT)                            1227
*              END;                                        /*@D32CKLB*/
*         ELSE DO;                                         /*@D32CKLB*/
         B     @RC01217                                            1229
@RF01217 DS    0H                                                  1230
*              CCLSW3=ON;      /* CCLPOST TO FREE NCSPL      @D32CKLB*/
         OI    CCLSW3,B'00100000'                                  1230
*              CALL CCLPOST;  /*POST ANY WAITING RPHS        @D32CKLB*/
         BAL   @14,CCLPOST                                         1231
*              END;                                        /*@D32CKLB*/
*       END;                                                       1233
@RC01217 DS    0H                                                  1234
* /*SEGMENT(CCLRET1)FINISH*/DO;GOTO CCLRET1#;CCLRET1@:END;         1234
@RC01184 DS    0H                                                  1235
         B     CCLRET1#                                            1235
CCLRET1@ DS    0H                                                  1237
* /*SEGMENT(CCLRET2)START*/DO;GOTO CCLRET2@;CCLRET2:END;           1237
         B     CCLRET2@                                            1238
CCLRET2  DS    0H                                                  1240
*/********************************************************************/
*/* RECEIVES CONTROL FROM CCLRET TO CONTINUE PROCESSING AFTER A     */
*/* SUCCESSFUL START DATA TRAFFIC OR ACTIVATE PHYSICAL OPERATION     */
*/*                                                                  */
*/********************************************************************/
*CCLSWW=OFF;     /*CLEAR WORK SWITCH*/                             1240
         NI    CCLSWW,B'11101111'                                  1240
*IF RPRENTRY=RPRENTCC × NCSPLCMD=NCSCSDT                           1241
*  THEN NCSPLCMD=NCSCRSRT;    /*IF CLUSTER OR CMND SDT- RESTART*/  1241
         CLI   RPRENTRY(CCLRDT),X'71'                              1241
         BE    @RT01241                                            1241
         CLC   NCSPLCMD(2,CCLNCSPL),@CB02186                       1241
         BNE   @RF01241                                            1241
@RT01241 DS    0H                                                  1242
         MVC   NCSPLCMD(2,CCLNCSPL),@CB02252                       1242
*  ELSE DO;                                                        1243
         B     @RC01241                                            1243
@RF01241 DS    0H                                                  1244
*    CCLLCK = ON;              /* INDIC SET LOCK             @X50BHEM*/
         OI    CCLLCK,B'01000000'                                  1244
*    CALL CCLLOCK;             /* FIND NCB, SET DAF LOCK     @X50BHEM*/
         BAL   @14,CCLLOCK                                         1245
*    IF CCLLCK = ON            /* IF CIDCTL FIND             @X50BHEM*/
*      THEN DO;                /* IS SUCCESSFUL              @X50BHEM*/
         TM    CCLLCK,B'01000000'                                  1246
         BNO   @RF01246                                            1246
*        NCBTTF = OFF;         /* TRICKLE TRAFFIC = OFF      @X50BHEM*/
         L     @15,CCLNCB                                          1248
         NI    NCBTTF(@15),B'11110111'                             1248
*        CCLLCK = OFF;         /* INDIC RELEASE LOCK         @X50BHEM*/
         NI    CCLLCK,B'10111111'                                  1249
*        CALL CCLLOCK;         /* GO RELEASE DAF LOCK        @X50BHEM*/
         BAL   @14,CCLLOCK                                         1250
*        END;                  /*                            @X50BHEM*/
*    CALL CCLNTFU;             /* NOTIFY USER IF NECESSARY   @X50BHEM*/
@RF01246 BAL   @14,CCLNTFU                                         1252
*       IF RUNAME=RRNNCPNM         /* IF CORRECT NCP AND     @X50BHEM*/
*         & (RUBYT2=SRUCOLD × RUBYT2=SRUERP) /* COLD OR ERP  @X50BHEM*/
*         THEN DO;  /*ACT PHY SUCCESSFUL*/                         1253
         CLC   RUNAME(7),RRNNCPNM(CCLRDT)                          1253
         BNE   @RF01253                                            1253
         CLI   RUBYT2,X'01'                                        1253
         BE    @RT01253                                            1253
         CLI   RUBYT2,X'02'                                        1253
         BNE   @RF01253                                            1253
@RT01253 DS    0H                                                  1254
*           IF RUBYT2 = SRUCOLD    /* IF NCP IN COLD STATE   @X50BHEM*/
*             THEN NCSFMCLD = ON;  /* SET NCSPL COLD FLAG    @X50BHEM*/
         CLI   RUBYT2,X'01'                                        1255
         BNE   @RF01255                                            1255
         OI    NCSFMCLD(CCLNCSPL),B'00100000'                      1256
*             ELSE NCSFMERP = ON;  /* OTHERWISE, ERP STATE   @X50BHEM*/
         B     @RC01255                                            1257
@RF01255 OI    NCSFMERP(CCLNCSPL),B'00010000'                      1257
*              NCSPLCMD=NCSCSDT;   /*START DATA TRAFFIC*/          1258
@RC01255 MVC   NCSPLCMD(2,CCLNCSPL),@CB02186                       1258
*              NCSPLOLN=SDTLN;     /*LENGTH=1*/                    1259
         MVC   NCSPLOLN(2,CCLNCSPL),@CH00062                       1259
*              NCSPLRUI=CCL0;                                      1260
         SLR   @15,@15                                             1260
         ST    @15,NCSPLRUI(,CCLNCSPL)                             1260
*              NCSPLRUO=ADDR(CCLRUOBF);  /*RU BUFFER*/             1261
         LA    @15,CCLRUOBF                                        1261
         ST    @15,NCSPLRUO(,CCLNCSPL)                             1261
*              RUSDT=SDTCD;             /*X'AO'*/                  1262
         MVI   RUSDT,X'A0'                                         1262
*              END;                                                1263
*         ELSE DO;            /*ACT PHY NOT SUCCESSFUL-CHANGE TO HARD*/
         B     @RC01253                                            1264
@RF01253 DS    0H                                                  1265
*              NCSPLMOM=OFF;                                       1265
         NI    NCSPLMOM(CCLNCSPL),B'01111111'                      1265
*              NCSPLVBF=NCSEDACT;                                  1266
         MVC   NCSPLVBF(2,CCLNCSPL),@CB02056                       1266
*              CALL CCLHARD;                                       1267
         BAL   @14,CCLHARD                                         1267
*              CCLSWW=ON;                                          1268
         OI    CCLSWW,B'00010000'                                  1268
*              END;                                                1269
*       END;                                                       1270
@RC01253 DS    0H                                                  1271
*IF CCLSWW=ON          /*BACK FROM CCLHARD-EXIT*/                  1271
*   THEN;                                                          1271
@RC01241 TM    CCLSWW,B'00010000'                                  1271
         BO    @RT01271                                            1271
*   ELSE DO;             /*SET CCLTPQR=PAB PTR*/                   1273
*        IF RPRENTRY=RPRENTRN  /*GET DLR PAB*/                     1274
*          THEN CCLTPQR=RDTDPAB;                                   1274
         CLI   RPRENTRY(CCLRDT),X'01'                              1274
         BNE   @RF01274                                            1274
         L     CCLTPQR,RDTDPAB(,CCLRDT)                            1275
*          ELSE CCLTPQR=RCCDPAB;                                   1276
         B     @RC01274                                            1276
@RF01274 L     CCLTPQR,RCCDPAB(,CCLRDT)                            1276
*        END;                                                      1277
@RC01274 DS    0H                                                  1278
* /*SEGMENT(CCLRET2)FINISH*/DO;GOTO CCLRET2#;CCLRET2@:END;         1278
@RT01271 DS    0H                                                  1279
         B     CCLRET2#                                            1279
*CCLHARD: PROC OPTIONS(NOSAVE,NOSAVEAREA);                         1281
         B     @PB00003                                            1281
CCLHARD  DS    0H                                                  1282
*/********************************************************************/
*/* PROCESSES FAILURES WHICH ARE UNRECOVERABLE INITIALLY OR HAVE     */
*/* BECOME SO AS A RESULT OF AN UNSUCCESSFUL RECOVERY ATTEMPT        */
*/*                                                                  */
*/********************************************************************/
*CCLSAVE2=CCLR14;   /*SAVE RETURN*/                                1282
         ST    CCLR14,CCLSAVE2                                     1282
*CALL CCLNTFU;      /* NOTIFY USER IF NOT ALREADY DONE       @X50BHEM*/
         BAL   @14,CCLNTFU                                         1283
*IF NCSPLMOM^=ON                                                   1284
*  THEN DO;                                                        1284
         TM    NCSPLMOM(CCLNCSPL),B'10000000'                      1284
         BO    @RF01284                                            1284
*       IF CCLSW2=ON                                               1286
*          THEN DO; /*RECURSIVE ERROR*/                            1286
         TM    CCLSW2,B'01000000'                                  1286
         BNO   @RF01286                                            1286
*               NCSPLVBF=NCSEDACT;  /*SET HARD*/                   1288
         MVC   NCSPLVBF(2,CCLNCSPL),@CB02056                       1288
*               IF RPRENTRY=RPRENTRN /*SET PRGDN-DLR HAS A NCSPL FOR*/
*                  THEN RDTPRGDN=ON; /*THIS NODE-PURGE WILL FLUSH IT*/
         CLI   RPRENTRY(CCLRDT),X'01'                              1289
         BNE   @RF01289                                            1289
         OI    RDTPRGDN(CCLRDT),B'01000000'                        1290
*                  ELSE RCCPRGDN=ON;                               1291
         B     @RC01289                                            1291
@RF01289 OI    RCCPRGDN(CCLRDT),B'00000010'                        1291
*               END;                                               1292
*          ELSE;                                                   1293
@RF01286 DS    0H                                                  1294
*        CALL CCLHRD1;  /*CONTINUE HARD PROCESSING*/               1294
@RC01286 BAL   @14,CCLHRD1                                         1294
*        END;                                                      1295
*  ELSE DO;  /* MOM ON-THIS NCSPL IS RESULT OF ERROR AT HIGHER NODE*/
         B     @RC01284                                            1296
@RF01284 DS    0H                                                  1297
*       IF CCLSW2=ON                                               1297
*         THEN DO; /*AN ERP NCSPL WAS BEING PROCESSED ON THIS*/    1297
         TM    CCLSW2,B'01000000'                                  1297
         BNO   @RF01297                                            1297
*                  /* NODE WHEN MOM FAILED*/                       1299
*              IF RPRENTRY=RPRENTRN  /*370X*/                      1299
*                THEN IF RDTCTCFL=ON                               1299
         CLI   RPRENTRY(CCLRDT),X'01'                              1299
         BNE   @RF01299                                            1299
*                       THEN DO;  /*CONTACT FLUSHED*/              1300
         TM    RDTCTCFL(CCLRDT),B'00010000'                        1300
         BNO   @RF01300                                            1300
*                            CCLSW2=OFF;  /*CLEAR SW2*/            1302
         NI    CCLSW2,B'10111111'                                  1302
*                            RDTCTCFL=OFF; /*CLEAR*/               1303
         NI    RDTCTCFL(CCLRDT),B'11101111'                        1303
*                            END;                                  1304
*                       ELSE RDTPRGDN=ON; /*SET PRGDN*/            1305
         B     @RC01300                                            1305
@RF01300 OI    RDTPRGDN(CCLRDT),B'01000000'                        1305
*                ELSE IF RCCCTCFL=ON                               1306
*                       THEN DO; /*CONTACT FLUSHED*/               1306
         B     @RC01299                                            1306
@RF01299 TM    RCCCTCFL(CCLRDT),B'01000000'                        1306
         BNO   @RF01306                                            1306
*                            CCLSW2=OFF; /*CLEAR SW2*/             1308
         NI    CCLSW2,B'10111111'                                  1308
*                            RCCCTCFL=OFF; /*CLEAR*/               1309
         NI    RCCCTCFL(CCLRDT),B'10111111'                        1309
*                            END;                                  1310
*                       ELSE RCCPRGDN=ON; /*SET PRGDN*/            1311
         B     @RC01306                                            1311
@RF01306 OI    RCCPRGDN(CCLRDT),B'00000010'                        1311
*              END;                                                1312
*         ELSE;                                                    1313
@RF01297 DS    0H                                                  1314
*       CCLSW3=ON;  /*TELLS CCLPOST TO FREE NCSPL*/                1314
@RC01297 OI    CCLSW3,B'00100000'                                  1314
*       CALL CCLHRD1; /*FINISH HARD PROCESSING*/                   1315
         BAL   @14,CCLHRD1                                         1315
*       END;                                                       1316
*CCLR14=CCLSAVE2;   /*RESTORE RETURN*/                             1317
@RC01284 L     CCLR14,CCLSAVE2                                     1317
*END CCLHARD;                                                      1318
@EL00003 DS    0H                                                  1318
@EF00003 DS    0H                                                  1318
@ER00003 BR    @14                                                 1318
*CCLHRD1:PROC OPTIONS(NOSAVE,NOSAVEAREA);                          1319
CCLHRD1  DS    0H                                                  1320
*/********************************************************************/
*/*  CALLED BY CCLHARD TO COMPLETE PROCESSING HARD FAILURE          */
*/*                                                                  */
*/********************************************************************/
*CCLSAVE3=CCLR14;   /*SAVE RETURN PT*/                             1320
         ST    CCLR14,CCLSAVE3                                     1320
*IF RPRENTRY=RPRENTCC  /* IF PU FAILED                       @D32CKLB*/
*   THEN                                                           1321
         CLI   RPRENTRY(CCLRDT),X'71'                              1321
         BNE   @RF01321                                            1321
*   IF RPRHDTYP=RPRENTSW               /* IF IN SWITCHED-SA  @D32CKLB*/
*      ×(RPRHDTYP=RPRENTLS             /* OR LOCAL SUBAREA   @D32CKLB*/
*       &NCSPLVBF=NCSEERRA)            /* & SOFT FAILURE     @D32CKLB*/
*      THEN DO;                        /* SET UP PURGES      @D32CKLB*/
         CLI   RPRHDTYP(CCLRDT),X'04'                              1322
         BE    @RT01322                                            1322
         CLI   RPRHDTYP(CCLRDT),X'05'                              1322
         BNE   @RF01322                                            1322
         CLC   NCSPLVBF(2,CCLNCSPL),@CB02052                       1322
         BNE   @RF01322                                            1322
@RT01322 DS    0H                                                  1323
*                                                          /*@ZA10951*/
*                                                          /*@ZA10951*/
*                                                          /*@ZA10951*/
*RFY (WKPT1,WKPT2) RSTD;            /* RESET RPRLIVE         @ZA10951*/
*WKPT1 = NCSPLRPT;                  /* POINT TO PU RDTE      @ZA10951*/
*                                                                  1325
         L     WKPT1,NCSPLRPT(,CCLNCSPL)                           1325
*/*  DOUNTIL(WKPT2->RPRENTED=ON×WKPT1->RPRENTRY<=NCSPLRPT->RPRENTRY)  *
*                                                                  1326
*    DO  UNTIL(WKPT2->RPRENTED=ON×WKPT1->RPRENTRY<=NCSPLRPT->RPRENTRY);
@DL01326 DS    0H                                                  1327
*   IF WKPT1->RPRENTRY = RPRENTLU & /* LU ?                  @ZA10951*/
*      WKPT1->RPRONLIN = ON         /* ONLIN ?               @ZA10951*/
*     THEN WKPT1->RPRLIVE = ON;     /* YES, RESET RPRLIVE    @ZA10951*/
         CLI   RPRENTRY(WKPT1),X'81'                               1327
         BNE   @RF01327                                            1327
         TM    RPRONLIN(WKPT1),B'00001000'                         1327
         BNO   @RF01327                                            1327
         OI    RPRLIVE(WKPT1),B'00000001'                          1328
*     ELSE;                                                /*@ZA10951*/
@RF01327 DS    0H                                                  1330
*   WKPT2 = WKPT1;                  /* SET WKPT2 = CURRENT   @ZA10951*/
         LR    WKPT2,WKPT1                                         1330
*   WKPT1 = WKPT1 + (WKPT1->RPRELEN); /* SET WKPT1 TO NEXT   @ZA10951*/
*                                                                  1331
         AH    WKPT1,RPRELEN(,WKPT1)                               1331
*    END; /* END  */                                               1332
@DE01326 TM    RPRENTED(WKPT2),B'00000100'                         1332
         BO    @DC01326                                            1332
         L     @15,NCSPLRPT(,CCLNCSPL)                             1332
         CLC   RPRENTRY(1,WKPT1),RPRENTRY(@15)                     1332
         BH    @DL01326                                            1332
@DC01326 DS    0H                                                  1333
*#DC00091:;                           /*                       @ZA10951
*/                                                                 1333
#DC00091 DS    0H                                                  1334
*RFY (WKPT1,WKPT2) UNRSTD;          /*                       @ZA10951*/
*                                                          /*@ZA10951*/
*                                                          /*@ZA10951*/
*                                                          /*@ZA10951*/
*           NCSPRMRC=LCPMNPF;          /* HARD PURGE         @D32CKLB*/
         MVI   NCSPRMRC(CCLNCSPL),X'03'                            1335
*           CCLPRG=PRGVO;              /* VARY ONLY          @D32CKLB*/
         MVI   CCLPRG,X'00'                                        1336
*           CALL CCLPGNT;              /* DO PURGE           @D32CKLB*/
         BAL   @14,CCLPGNT                                         1337
*           NCSPRMRC=LCPMNTF;          /* FIRM PURGE         @D32CKLB*/
         MVI   NCSPRMRC(CCLNCSPL),X'10'                            1338
*           CCLPRG=PRGUO;              /* USER ONLY          @D32CKLB*/
         MVI   CCLPRG,X'02'                                        1339
*           END;                                           /*@D32CKLB*/
*      ELSE DO;                                            /*@D32CKLB*/
         B     @RC01322                                            1341
@RF01322 DS    0H                                                  1342
*           NCSPRMRC=LCPMNPF;          /* HARD PURGE         @D32CKLB*/
         MVI   NCSPRMRC(CCLNCSPL),X'03'                            1342
*           CCLPRG=PRGVU;              /* VARY & USER        @D32CKLB*/
         MVI   CCLPRG,X'04'                                        1343
*           END;                                           /*@D32CKLB*/
*ELSE DO;                              /* ELSE NOT PU        @D32CKLB*/
         B     @RC01321                                            1345
@RF01321 DS    0H                                                  1346
*IF RPRENTRY=RPRENTRN&ICNZF010=ON  /*IF 370X+AUTO NET SHUTDOWN*/   1346
*  THEN NCSPRMRC=LCPMNAS;    /*PURGE MINOR RC=AUTO NET SHUTDOWN*/  1346
         CLI   RPRENTRY(CCLRDT),X'01'                              1346
         BNE   @RF01346                                            1346
         L     @15,CCLNCB                                          1346
         TM    ICNZF010(@15),B'00010000'                           1346
         BNO   @RF01346                                            1346
         MVI   NCSPRMRC(CCLNCSPL),X'04'                            1347
*  ELSE NCSPRMRC=LCPMNPF;    /*SET HARD PURGE*/                    1348
         B     @RC01346                                            1348
@RF01346 MVI   NCSPRMRC(CCLNCSPL),X'03'                            1348
*CCLPRG=PRGVU; /*PURGE VARY+USER*/                                 1349
@RC01346 MVI   CCLPRG,X'04'                                        1349
*     END;                                                 /*@D32CKLB*/
*CALL CCLPGNT;                                                     1351
@RC01321 BAL   @14,CCLPGNT                                         1351
*CALL CCLSPIN;   /*SPIN OFF ERP NCSPLS TO LOWER NETWORK NODES @XM9005*/
         BAL   @14,CCLSPIN                                         1352
*IF CCLSW1=ON                          /*                    @D32CKLB*/
*   & RPRINIMM=ON                                          /*@ZA19909*/
*   THEN DO;                           /*                    @D32CKLB*/
         TM    CCLSW1,B'10000000'                                  1353
         BNO   @RF01353                                            1353
         TM    RPRINIMM(CCLRDT),B'00000001'                        1353
         BNO   @RF01353                                            1353
*     IF RPRENTRY = RPRENTLU           /* IF ERP IS FOR LU   @DA06111*/
*       THEN;                          /* THEN SKIP TPPOSTS  @DA06111*/
         CLI   RPRENTRY(CCLRDT),X'81'                              1355
         BE    @RT01355                                            1355
*       ELSE DO;                       /*                    @DM04898*/
*         CALL CCLPOST;                /* POST WAITING RPHS  @D32CKLB*/
         BAL   @14,CCLPOST                                         1358
*         CCLMSGID=MSG031I;            /* ERP COMPLETE       @DM04898*/
         MVC   CCLMSGID(4),@CC04624                                1359
*         CALL CCLWTO;                 /*                    @DM04898*/
         BAL   @14,CCLWTO                                          1360
*         END;                         /*                    @DM04898*/
*     CCLTPQR=CCL0;                    /* SO ML FREES NCSPL  @D32CKLB*/
@RT01355 SLR   CCLTPQR,CCLTPQR                                     1362
*     END;                             /*                    @D32CKLB*/
*   ELSE                               /*                    @D32CKLB*/
*   IF CCLSW3=ON                       /*                    @D32CKLB*/
*      THEN CALL CCLPOST;              /* POST WAITING RPHS  @D32CKLB*/
         B     @RC01353                                            1364
@RF01353 TM    CCLSW3,B'00100000'                                  1364
         BNO   @RF01364                                            1364
         BAL   @14,CCLPOST                                         1365
*      ELSE DO;                        /*                    @D32CKLB*/
         B     @RC01364                                            1366
@RF01364 DS    0H                                                  1367
*           CCLMSGID=MSG129I;          /* MSG FOR V INACT    @D32CKLB*/
         MVC   CCLMSGID(4),@CC04616                                1367
*           IF RPRENTRY=RPRENTCC       /* IF PU FAILED       @D32CKLB*/
*              THEN DO;                                    /*@D32CKLB*/
         CLI   RPRENTRY(CCLRDT),X'71'                              1368
         BNE   @RF01368                                            1368
*              /* IF PU IN SWITCHED SUBAREA, OR IF IN        @D32CKLB*/
*              /* LOCAL SUBAREA AND SOFT ERROR               @D32CKLB*/
*              /* THEN SET UP 'CONNECTION LOST' MESSAGE      @D32CKLB*/
*                   IF RPRHDTYP=RPRENTSW                  /* @D32CKLB*/
*                      ×(RPRHDTYP=RPRENTLS                         1370
*                       &NCSPLVBF=NCSEERRA)                        1370
*                      THEN DO;                            /*@D32CKLB*/
         CLI   RPRHDTYP(CCLRDT),X'04'                              1370
         BE    @RT01370                                            1370
         CLI   RPRHDTYP(CCLRDT),X'05'                              1370
         BNE   @RF01370                                            1370
         CLC   NCSPLVBF(2,CCLNCSPL),@CB02052                       1370
         BNE   @RF01370                                            1370
@RT01370 DS    0H                                                  1371
*                           CCLMSGID=MSG676I;              /*@D32CKLB*/
         MVC   CCLMSGID(4),@CC04620                                1372
*                           NCSPLRSO=ON;                   /*@D32CKLB*/
         OI    NCSPLRSO(CCLNCSPL),B'01000000'                      1373
*                           END;                           /*@D32CKLB*/
*                      ELSE;                               /*@D32CKLB*/
@RF01370 DS    0H                                                  1376
*                   END;                                   /*@D32CKLB*/
*               CALL CCLWTO;                                       1377
@RF01368 BAL   @14,CCLWTO                                          1377
*               NCSPLRID=RPRNAME;   /*NAME OF FAILING NODE*/       1378
         MVC   NCSPLRID(8,CCLNCSPL),RPRNAME(CCLRDT)                1378
*               NCSPLVCD=NCSPLVC1;  /*VARY*/                       1379
         MVI   NCSPLVCD(CCLNCSPL),X'01'                            1379
*               IF RPRENTRY = RPRENTLU  /* IF FORCE DEACT    @DA06111*/
*                 THEN NCSPLVBF=NCSVDEI;/* ISSUE DEACT IMM   @DA06111*/
         CLI   RPRENTRY(CCLRDT),X'81'                              1380
         BNE   @RF01380                                            1380
         MVC   NCSPLVBF(2,CCLNCSPL),@CB02066                       1381
*                 ELSE NCSPLVBF=NCSVDII;/* ELSE IMM INTERNAL @DA06111*/
         B     @RC01380                                            1382
@RF01380 MVC   NCSPLVBF(2,CCLNCSPL),@CB02068                       1382
*               /* REMOVE THREE LINES OF CODE                @DA06130*/
*               WKANEXT=NCSPLWKA+CCL8;  /* ALL SPACE AVAILABLE*/   1383
@RC01380 L     @15,NCSPLWKA(,CCLNCSPL)                             1383
         LA    @10,8                                               1383
         ALR   @10,@15                                             1383
         ST    @10,WKANEXT(,@15)                                   1383
*       IF RPRENTRY=RPRENTLC   /*3270 LOCAL      @XM09554    @D32CKLB*/
*         THEN DO;                                                 1384
         CLI   RPRENTRY(CCLRDT),X'45'                              1384
         BNE   @RF01384                                            1384
*              NCSPLRPT=CCLRDT+RPRELEN;   /*PT TO TERMINAL  @DM08671*/
         LR    @15,CCLRDT                                          1386
         AH    @15,RPRELEN(,CCLRDT)                                1386
         ST    @15,NCSPLRPT(,CCLNCSPL)                             1386
*              END;                                       /*@DM08671*/
*         ELSE DO;                                                 1388
         B     @RC01384                                            1388
@RF01384 DS    0H                                                  1389
*           IF RPRENTRY = RPRENTLU  /* IF ERP IS FOR AN LU   @DA06111*/
*             THEN CALL CCLCNFC;    /* THEN CLEAR SICK FLGS  @DA06111*/
         CLI   RPRENTRY(CCLRDT),X'81'                              1389
         BNE   @RF01389                                            1389
         BAL   @14,CCLCNFC                                         1390
*             ELSE CALL CCLPOST;    /*SW3 TELLS CCLPOST TO FREE NCSPL*/
         B     @RC01389                                            1391
@RF01389 BAL   @14,CCLPOST                                         1391
*                                   /*                       @DA06111*/
*              END;                                        /*@D32CKLB*/
@RC01389 DS    0H                                                  1393
*                  DO WHILE(RPRENTRY^=RPRHDTYP);/* FIND THE  @DA06130*/
@RC01384 B     @DE01393                                            1393
@DL01393 DS    0H                                                  1394
*                    CCLRDT = CCLRDT - RPRPELEN;/* SUBAREA   @DA06130*/
         SH    CCLRDT,RPRPELEN(,CCLRDT)                            1394
*                    END;                       /* HEADER    @DA06130*/
@DE01393 CLC   RPRENTRY(1,CCLRDT),RPRHDTYP(CCLRDT)                 1395
         BNE   @DL01393                                            1395
*                  CCLTPQR = RDTVPAB;           /* VARY PAB  @DA06130*/
         L     CCLTPQR,RDTVPAB(,CCLRDT)                            1396
*           END;                       /* END CCLSW3 OFF     @D32CKLB*/
*CCLR14=CCLSAVE3;   /*RESTORE RETURN*/                             1398
@RC01364 DS    0H                                                  1398
@RC01353 L     CCLR14,CCLSAVE3                                     1398
*END CCLHRD1;                                                      1399
@EL00004 DS    0H                                                  1399
@EF00004 DS    0H                                                  1399
@ER00004 BR    @14                                                 1399
*CCLCNTC: PROC OPTIONS(NOSAVE,NOSAVEAREA);                         1400
CCLCNTC  DS    0H                                                  1401
*/********************************************************************/
*/* ISSUES A  CONTACT COMMAND TO THE BOUNDARY NODE OF THE FAILING    */
*/* NODE.CALLED ONLY IF FAILING NODE IS REMOTE 370X OR CLUSTER CTL   */
*/*                                                                  */
*/********************************************************************/
*CCLSAVE4=CCLR14; /*SAVE RETURN*/                                  1401
         ST    CCLR14,CCLSAVE4                                     1401
*CCLSWW=OFF;       /*INITIALIZE SW*/                               1402
         NI    CCLSWW,B'11101111'                                  1402
*IF NCSPLSPL = CCL0          /* IF NO NCSPL OBTAINED YET     @DA06111*/
*  THEN DO;                  /* THEN GET NCSPL, WORK AREA    @DA06111*/
         L     @15,NCSPLSPL(,CCLNCSPL)                             1403
         LTR   @15,@15                                             1403
         BNZ   @RF01403                                            1403
*    CALL CCLGET;            /* CALL GET NCSPL SUBROUTINE    @DA06111*/
         BAL   @14,CCLGET                                          1405
*    IF CCLNSTR=ON           /* FAIL CONTACT IF NO STORAGE   @DA06111*/
*      THEN CCLSWW = ON;     /* SET CONTACT FAILED SWITCH    @DA06111*/
         TM    CCLNSTR,B'00000001'                                 1406
         BNO   @RF01406                                            1406
         OI    CCLSWW,B'00010000'                                  1407
*      ELSE NCSPLSPL = CCLSAVEB;/* ELSE SET AUX NCSPL PTR    @DA06111*/
         B     @RC01406                                            1408
@RF01406 L     @15,CCLSAVEB                                        1408
         ST    @15,NCSPLSPL(,CCLNCSPL)                             1408
*    END;                     /* END GET NCSPL CODE          @DA06111*/
@RC01406 DS    0H                                                  1410
*IF NCSPLSPL = CCL0           /* IF AUX NCSPL NOT OBTAINED   @DA06111*/
*  THEN;                      /* THEN ABANDON OPERATION      @DA06111*/
@RF01403 L     @15,NCSPLSPL(,CCLNCSPL)                             1410
         LTR   @15,@15                                             1410
         BZ    @RT01410                                            1410
*  ELSE DO;                                                        1412
*       IF NCSFORCE = ON       /* IF CONTACT FOR FORCE DEACT @DA06111*/
*         THEN NCSPLSPL->NCSFORCE = ON;/* THEN COPY NCSFORCE @DA06111*/
         TM    NCSFORCE(CCLNCSPL),B'00100000'                      1413
         BNO   @RF01413                                            1413
         L     @15,NCSPLSPL(,CCLNCSPL)                             1414
         OI    NCSFORCE(@15),B'00100000'                           1414
*       NCSPLSPL->NCSPLVCD=NCSPLVC6;    /*VERB CODE=INTERNAL @DA06111*/
@RF01413 L     @15,NCSPLSPL(,CCLNCSPL)                             1415
         MVI   NCSPLVCD(@15),X'06'                                 1415
*       NCSPLSPL->NCSVSTAT=ON;          /* MARK NCSPL STATIC @DA06111*/
         OI    NCSVSTAT(@15),B'00100000'                           1416
*       NCSPLSPL->NCSPLWEL=CCLNCSPL->NCSPLRPH;/* SET RPH PTR @DA06111*/
         L     @10,NCSPLRPH(,CCLNCSPL)                             1417
         ST    @10,NCSPLWEL(,@15)                                  1417
*       IF CCLDISC = OFF      /* IF CONTACT TO BE ISSUED     @DA06111*/
*         THEN DO;            /*                             @DA06111*/
         TM    CCLDISC,B'00010000'                                 1418
         BNZ   @RF01418                                            1418
*       NCSPLSPL->NCSPLVBF = NCSCON;  /* INDIC CONTACT REQ   @DA06111*/
         MVC   NCSPLVBF(2,@15),@CB02058                            1420
*       IF NCSPL2CN = ON              /* SECOND CONTACT ?    @XM08972*/
*         THEN NCSPLSPL->NCSPL2CN=ON; /* INDICATE 2ND CONTACT@XM08972*/
         TM    NCSPL2CN(CCLNCSPL),B'00000010'                      1421
         BNO   @RF01421                                            1421
         OI    NCSPL2CN(@15),B'00000010'                           1422
*         ELSE NCSPLSPL->NCSPL2CN=OFF;/* INDICATE 1ST CONTACT@XM08972*/
         B     @RC01421                                            1423
@RF01421 L     @15,NCSPLSPL(,CCLNCSPL)                             1423
         NI    NCSPL2CN(@15),B'11111101'                           1423
*       CALL CCLTPQWT;                /* SCHEDULE CONTACT    @XM07933*/
@RC01421 BAL   @14,CCLTPQWT                                        1424
*       IF NCSPLSPL->NCSIORC=NCSLDAOK /* IF +FME             @XM07933*/
*       THEN DO;                      /*                     @XM07933*/
         L     @15,NCSPLSPL(,CCLNCSPL)                             1425
         CLI   NCSIORC(@15),X'00'                                  1425
         BNE   @RF01425                                            1425
*         IF CCLNCSPL->NCSIORC=NCSNCE                      /*@XM07933*/
*         THEN DO;       /*CONTACT FAILED DUE TO ERP*/             1427
         CLI   NCSIORC(CCLNCSPL),X'10'                             1427
         BNE   @RF01427                                            1427
*              CCLQUIT=ON;                                         1429
         OI    CCLQUIT,B'00001000'                                 1429
*              IF NCSFORCE = ON       /* IF FORCE CMD        @DM04898*/
*                THEN DO;             /* VARY FAILED         @DM04898*/
         TM    NCSFORCE(CCLNCSPL),B'00100000'                      1430
         BNO   @RF01430                                            1430
*                  CCLMSGID=MSG034I;  /*                     @DM04898*/
         MVC   CCLMSGID(4),@CC04626                                1432
*                  CALL CCLWTO;       /*                     @DM04898*/
         BAL   @14,CCLWTO                                          1433
*                  END;               /*                     @DM04898*/
*              IF RPRENTRY=RPRENTRN  /*370X*/                      1435
*                 THEN DO;                                         1435
@RF01430 CLI   RPRENTRY(CCLRDT),X'01'                              1435
         BNE   @RF01435                                            1435
*                      RDTPRGDN=OFF; /*SET PRGDN*/                 1437
*                      RDTCTCFL=ON;  /*CONTACT FLUSHED*/           1438
         OI    RDTCTCFL(CCLRDT),B'00010000'                        1438
         NI    RDTPRGDN(CCLRDT),B'10111111'                        1438
*                      END;                                        1439
*                 ELSE DO;    /*CLUSTER CTL*/                      1440
         B     @RC01435                                            1440
@RF01435 DS    0H                                                  1441
*                      RCCPRGDN=OFF;  /*SET PRGDN*/                1441
         NI    RCCPRGDN(CCLRDT),B'11111101'                        1441
*                      RCCCTCFL=ON; /*SET CONTACT FLUSHED*/        1442
         OI    RCCCTCFL(CCLRDT),B'01000000'                        1442
*                      END;                                        1443
*              END;                                                1444
*         ELSE DO;                                                 1445
         B     @RC01427                                            1445
@RF01427 DS    0H                                                  1446
*              IF CCLNCSPL->NCSIORC=NCSLD /*CONTACTED LOADED @XM09534*/
*                                                          /*@XM07933*/
*              × (CCLNCSPL->NCSIORC=NCSNLD /* OR NEEDS LOAD  @XM09534*/
*                                                          /*@XM07933*/
*              & RPRENTRY = RPRENTRN   /* AND REMOTE 370X    @X50BHEM*/
*              & NCSPL2CN = OFF)       /* AND FIRST CONTACT  @X50BHEM*/
*                THEN;        /*COMPLETED SUCCESSFULLY*/           1446
         CLI   NCSIORC(CCLNCSPL),X'00'                             1446
         BE    @RT01446                                            1446
         CLI   NCSIORC(CCLNCSPL),X'0C'                             1446
         BNE   @RF01446                                            1446
         CLI   RPRENTRY(CCLRDT),X'01'                              1446
         BNE   @RF01446                                            1446
         TM    NCSPL2CN(CCLNCSPL),B'00000010'                      1446
         BZ    @RT01446                                            1446
*                ELSE DO;                                  /*@XM07933*/
@RF01446 DS    0H                                                  1449
*                     CCLSWW=ON;        /* FAILED            @XM07933*/
         OI    CCLSWW,B'00010000'                                  1449
*                     CCLDISC = ON;     /* INDIC SEND DISCON @DA06111*/
         OI    CCLDISC,B'00010000'                                 1450
*                     END;                                 /*@XM07933*/
*             END;                   /* END NOT FAIL BY ERP  @DA06111*/
*       END;                         /* END +FME PROCESSING  @XM07933*/
*       ELSE CCLSWW=ON;              /* ELSE CONTACT FAILED  @XM07933*/
         B     @RC01425                                            1454
@RF01425 OI    CCLSWW,B'00010000'                                  1454
*         END;                       /* END NOT SEND CONTACT @DA06111*/
@RC01425 DS    0H                                                  1456
*       IF CCLDISC = ON              /* IF SEND DISCONTACT   @DA06111*/
*         THEN DO;                   /* IS INDICATED:        @DA06111*/
@RF01418 TM    CCLDISC,B'00010000'                                 1456
         BNO   @RF01456                                            1456
*           CCLDISC = OFF;           /* CLEAR DISCON SWITCH  @DA06111*/
         NI    CCLDISC,B'11101111'                                 1458
*           NCSPLSPL->NCSPLVBF = NCSDICON;/* SET CMD CODE    @DA06111*/
         L     @15,NCSPLSPL(,CCLNCSPL)                             1459
         MVC   NCSPLVBF(2,@15),@CB02076                            1459
*           CALL CCLTPQWT;           /* SCHED DISCONTACT     @DA06111*/
         BAL   @14,CCLTPQWT                                        1460
*           IF CCLNCSPL->NCSIORC=NCSNCD /* FAILED BY DEACT?  @DM04903*/
*             THEN CCLNCSPL->NCSPLVBF=NCSEDACT;/* HARD ERP   @DM04903*/
         CLI   NCSIORC(CCLNCSPL),X'08'                             1461
         BNE   @RF01461                                            1461
         MVC   NCSPLVBF(2,CCLNCSPL),@CB02056                       1462
*           END;                     /*                      @DA06111*/
@RF01461 DS    0H                                                  1464
*       IF CCLQUIT=ON                                              1464
*         THEN CCLTPQR=CCL0;  /*FREE NCSPL IN MAINLINE*/           1464
@RF01456 TM    CCLQUIT,B'00001000'                                 1464
         BNO   @RF01464                                            1464
         SLR   CCLTPQR,CCLTPQR                                     1465
*         ELSE;                                                    1466
@RF01464 DS    0H                                                  1467
*       END;                                                       1467
*IF CCLSWW^=ON THEN;  /*CONTACT SUCCESSFUL OR FAILED DUE TO DEACT*/
@RT01410 TM    CCLSWW,B'00010000'                                  1468
         BNO   @RT01468                                            1468
*  ELSE DO;    /*NO STORAGE OR FAILED*/                            1470
*       NCSPLVBF=NCSEDACT;    /*SET HARD*/                         1471
         MVC   NCSPLVBF(2,CCLNCSPL),@CB02056                       1471
*       NCSPLMOM=OFF;                                              1472
         NI    NCSPLMOM(CCLNCSPL),B'01111111'                      1472
*       CALL CCLHARD;          /*PROCESS HARD*/                    1473
         BAL   @14,CCLHARD                                         1473
*       CCLQUIT=ON;    /*TELLS CALLER TO EXIT*/                    1474
         OI    CCLQUIT,B'00001000'                                 1474
*       END;                                                       1475
*CCLR14=CCLSAVE4;                                                  1476
@RT01468 L     CCLR14,CCLSAVE4                                     1476
*END CCLCNTC;                                                      1477
@EL00005 DS    0H                                                  1477
@EF00005 DS    0H                                                  1477
@ER00005 BR    @14                                                 1477
*CCLTPQWT: PROC OPTIONS(NOSAVE,NOSAVEAREA);                /*@XM07933*/
CCLTPQWT DS    0H                                                  1479
*/********************************************************************/
*/* TPQUE CONTACT OR DISCONTACT REQUEST TO BOUNDARY NODE VARY PAB    */
*/* AND WAIT FOR COMPLETION OF THE CONTACT/DISCONTACT.               */
*/********************************************************************/
*CCLSAV15 = CCLR14;                   /* SAVE RETURN         @XM07933*/
         ST    CCLR14,CCLSAV15                                     1479
*RFY WKPT1 RSTD;                                           /*@XM07933*/
*IF RPRENTRY=RPRENTRN          /* IF ERP FOR (REMOTE) 370X   @DA06111*/
*  THEN DO;                    /* THEN USE ISTRIN TO REF     @DA06111*/
         CLI   RPRENTRY(CCLRDT),X'01'                              1481
         BNE   @RF01481                                            1481
*    WKPT1=RRNTRENT;           /* GET ADDR OF RIN RDTE       @DA06111*/
         L     @15,RRNTRENT(,CCLRDT)                               1483
         LR    WKPT1,@15                                           1483
*    RINRPHCN=NCSPLRPH;        /* SET RPH WAITING FOR CONTCT @DA06111*/
         L     @10,NCSPLRPH(,CCLNCSPL)                             1484
         ST    @10,RINRPHCN(,@15)                                  1484
*    END;                      /*                            @DA06111*/
*  ELSE DO;                    /* ELSE USE ISTRCC TO REF     @DA06111*/
         B     @RC01481                                            1486
@RF01481 DS    0H                                                  1487
*    WKPT1=NCSPLRPT;           /* ELSE GET ADDR OF PU RDTE   @DA06111*/
         L     WKPT1,NCSPLRPT(,CCLNCSPL)                           1487
*    RCCRPHCN = NCSPLRPH;      /* SET RPH WAITING FOR CONTCT @DA06111*/
         L     @15,NCSPLRPH(,CCLNCSPL)                             1488
         ST    @15,RCCRPHCN(,CCLRDT)                               1488
*    END;                      /*                            @DA06111*/
*NCSPLSPL->NCSPLRRP=WKPT1;     /* SET CV9 INPUT -> RDTE      @DA06111*/
@RC01481 L     @15,NCSPLSPL(,CCLNCSPL)                             1490
         ST    WKPT1,NCSPLRRP(,@15)                                1490
*DO WHILE WKPT1->RPRENTRY^=RPRENTRN;/* LOCATE BOUNDARY NODE  @DA06111*/
         B     @DE01491                                            1491
@DL01491 DS    0H                                                  1492
*  WKPT1=WKPT1->RPRNSNEA;      /* VARY PAB TO QUEUE          @DA06111*/
         L     WKPT1,RPRNSNEA(,WKPT1)                              1492
*  END;                        /* CONTACT OR DISCONTACT      @DA06111*/
@DE01491 CLI   RPRENTRY(WKPT1),X'01'                               1493
         BNE   @DL01491                                            1493
*RFY ISTDYPAB BASED(WKPT1);    /* ADDRESSABILITY FOR DYPAB   @DA06111*/
*WKPT1=WKPT1->RDTVPAB;         /* GET ADDR OF BNN VARY PAB   @DA06111*/
         L     WKPT1,RDTVPAB(,WKPT1)                               1495
*RFY ISTDYPAB BASED(WKPT1);    /* ADDRESSABILITY FOR DYPAB   @DA06111*/
*/*  TPQUE (NCSPLSPL,DYPPAB) NORM */                               1497
*                                                                  1497
*  DO;                                                             1497
*  RFY (GPR00P,GPR01P,GPR04P,GPR05P,GPR15P) RSTD;                  1498
*  GEN REFS(GPR01P) SETS(RPHWORK)                                  1499
*        (STM GPR02P,GPR08P,RPHWORK(GPR01P));                      1499
         STM GPR02P,GPR08P,RPHWORK(GPR01P)
*  GPR00P=0;                                                       1500
         SLR   GPR00P,GPR00P                                       1500
*  GPR15P=ADDR(DYPPAB); /*HOLD PAB PTR*/                           1501
         LA    GPR15P,DYPPAB(,WKPT1)                               1501
*  GPR04P=NCSPLSPL; /*WORK ELE PTR*/                               1502
         L     GPR04P,NCSPLSPL(,CCLNCSPL)                          1502
*  GPR05P=GPR15P; /*PASS PAB PTR*/                                 1503
         LR    GPR05P,GPR15P                                       1503
*  CALL ATCLCPTR->ATCAP37->ISTAPC37;                               1504
         L     @10,ATCLCPTR                                        1504
         L     @15,ATCAP37(,@10)                                   1504
         BALR  @14,@15                                             1504
*  GEN(NOPR  0)NOSETS NOREFS;                                      1505
         NOPR  0
*  RFY (GPR00P,GPR01P,GPR04P,GPR05P,GPR15P) UNRSTD;                1506
*  END; /**** END OF TPQUE GENERATION ****/                           /
*@XM07933*/                                                        1507
*/*  TPWAIT   */                                                   1508
*  DO; /* BEGIN TPWAIT GENERATION*/                                1508
*  RFY (GPR01P,GPR14P,GPR15P) RSTD;                                1509
*  RFY (GPR00P) RSTD;                                              1510
*  GEN (STM   GPR00P,GPR15P,RPHWORK(GPR01P))                       1511
*  REFS(GPR00P,GPR01P,GPR15P) SETS(RPHWORK);                       1511
         STM   GPR00P,GPR15P,RPHWORK(GPR01P)
*  RFY (GPR00P) UNRSTD;                                            1512
*  GPR15P=ADDR(LHAA0099);                                          1513
         LA    GPR15P,LHAA0099                                     1513
*  GPR14P=0;                                                       1514
         SLR   GPR14P,GPR14P                                       1514
*  GPR15P=GPR15P & '00FFFFFF'X;                                    1515
         N     GPR15P,@CF04783                                     1515
*  GPR15P=GPR15P × RPHWT1;                                         1516
         O     GPR15P,@CF01354                                     1516
*  CS (GPR14P,GPR15P,GPR01P->RPHRESMA);                            1517
         CS    GPR14P,@15,RPHRESMA(GPR01P)                         1517
*  BC (7,LHAB0099);                                                1518
*                                                                  1518
         BC    7,LHAB0099                                          1518
*/* TPEXIT  NONE */                                                1519
*  DO;                                                             1519
*    RESPECIFY GPR15P RSTD;                                        1520
*                                                                  1520
*/* ATBUILD (ISTPAB,ISTDYPAB,ISTATCVT)  */                         1521
*/* END OF ATBUILD */                                              1521
*                                                                  1521
*  DO; /* LISATCVT CVTBASE(PAGEABLE,(GPR15P)) */                   1521
*    GPR15P = ATCLCPTR; /*SET UP ATCVT POINTER*/                   1522
         L     GPR15P,ATCLCPTR                                     1522
*  END; /*LISATCVT*/                                               1523
*    RESPECIFY GPR00F RSTD;                                        1524
*    GPR00F=0;     /*SET PARAMETER REGISTER TO 0*/                 1525
         SLR   GPR00F,GPR00F                                       1525
*    GPR15P=GPR15P->ATCAP31;                                       1526
         L     GPR15P,ATCAP31(,GPR15P)                             1526
*    DCL FMZL0104 BASED(GPR15P) LABEL VALUERANGE(*);               1527
*    CALL FMZL0104;                                                1528
         BALR  @14,@15                                             1528
*    RESPECIFY (GPR00F,GPR15P) UNRSTD;                             1529
*  END; /***** END OF TPEXIT  *****/                               1530
*LHAB0099:;                                                        1531
LHAB0099 DS    0H                                                  1532
*  GPR01P->RPHRESMA = 0;                                           1532
         SLR   @15,@15                                             1532
         ST    @15,RPHRESMA(,GPR01P)                               1532
*  RFY (GPR00P) RSTD;                                              1533
*LHAA0099:;                                                        1534
LHAA0099 DS    0H                                                  1535
*  GEN (LM    GPR00P,GPR15P,RPHWORK(GPR01P))                       1535
*  REFS(RPHWORK,GPR01P) SETS(GPR00P,GPR15P);                       1535
         LM    GPR00P,GPR15P,RPHWORK(GPR01P)
*  RFY (GPR00P,GPR01P,GPR14P,GPR15P) UNRSTD;                       1536
*  END; /*****END OF TPWAIT *****/                                 1537
*           /*@XM07933*/                                           1538
*RFY WKPT1 UNRSTD;        /* UNRESTRICT WORK REG             @DA06111*/
*CCLR14 = CCLSAV15;                   /* RETURN ADDRESS      @XM07933*/
         L     CCLR14,CCLSAV15                                     1539
*END CCLTPQWT;                                             /*@XM07933*/
@EL00006 DS    0H                                                  1540
@EF00006 DS    0H                                                  1540
@ER00006 BR    @14                                                 1540
*CCLSPIN: PROC OPTIONS(NOSAVE,NOSAVEAREA);                         1541
CCLSPIN  DS    0H                                                  1542
*/********************************************************************/
*/* SPINS OFF ERP NCSPLS TO NETWORK NODES INCLUDED WITHIN THE SCOPE  */
*/* OF A FAILING NODE                                                */
*/********************************************************************/
*CCLSAVE5=CCLR14;                                                  1542
         ST    CCLR14,CCLSAVE5                                     1542
*RFY (WKPT1,WKPT2,WKPT3) RSTD;                                     1543
*CCLENT=RPRENTRY;   /*ENTRY TYPE OF FAILING NODE*/                 1544
         MVC   CCLENT(1),RPRENTRY(CCLRDT)                          1544
*WKPT1=NCSPLRPT;                                                   1545
         L     WKPT1,NCSPLRPT(,CCLNCSPL)                           1545
*RFY (ISTRPRE,ISTRIN,ISTRCC) BASED(WKPT1);                         1546
*CCLLOOP=ON;             /* INIT*/                                 1547
         OI    CCLLOOP,B'00000100'                                 1547
*DO WHILE CCLLOOP=ON;                                              1548
         B     @DE01548                                            1548
@DL01548 DS    0H                                                  1549
*  WKPT2=CCL0;         /*WKPT2 WILL ADDR THE NETWORK SUBNODE*/     1549
         SLR   WKPT2,WKPT2                                         1549
*  IF RPRENTED=ON                                                  1550
*    THEN CCLLOOP=OFF;   /*NO SUBNODES*/                           1550
         TM    RPRENTED(WKPT1),B'00000100'                         1550
         BNO   @RF01550                                            1550
         NI    CCLLOOP,B'11111011'                                 1551
*    ELSE DO;                                                      1552
         B     @RC01550                                            1552
@RF01550 DS    0H                                                  1553
*         WKPT1=WKPT1+RPRELEN;     /*NEXT RDTE*/                   1553
         AH    WKPT1,RPRELEN(,WKPT1)                               1553
*         IF RPRENTRY<=CCLENT                                      1554
*           THEN CCLLOOP=OFF; /*OUT OF SCOPE OF FAILING NODE*/     1554
         CLC   RPRENTRY(1,WKPT1),CCLENT                            1554
         BH    @RF01554                                            1554
         NI    CCLLOOP,B'11111011'                                 1555
*           ELSE DO;                                               1556
         B     @RC01554                                            1556
@RF01554 DS    0H                                                  1557
*                IF RPRENTRY=RPRENTCC & RPRINV=OFF & RCCEPAB^=CCL0 1557
*                  &(RCCRPHCN=CCL0      /* OR NOT AWAITING CONTACTED */
*                   ×RCCRPHCN->RPHWEA->NCSPLVCD=NCSPLVC3)          1557
*                                      /* OR ERP AWAITING CONTACTED  */
*                   THEN WKPT2=WKPT1; /*CTL CL +VALID+ ERP PAB PRESNT*/
         CLI   RPRENTRY(WKPT1),X'71'                               1557
         BNE   @RF01557                                            1557
         TM    RPRINV(WKPT1),B'01000000'                           1557
         BNZ   @RF01557                                            1557
         SLR   @15,@15                                             1557
         C     @15,RCCEPAB(,WKPT1)                                 1557
         BE    @RF01557                                            1557
         L     @09,RCCRPHCN(,WKPT1)                                1557
         CR    @09,@15                                             1557
         BE    @RT01557                                            1557
         L     @15,RPHWEA(,@09)                                    1557
         CLI   NCSPLVCD(@15),X'03'                                 1557
         BNE   @RF01557                                            1557
@RT01557 DS    0H                                                  1558
         LR    WKPT2,WKPT1                                         1558
*                   ELSE IF RPRENTRY=RPRENTIN                      1559
*                         &RPRINV=OFF & RINREMOT^=CCL0             1559
*                  &(RINRPHCN=CCL0      /* OR NOT AWAITING CONTACTED */
*                   ×RINRPHCN->RPHWEA->NCSPLVCD=NCSPLVC3)          1559
*                                      /* OR ERP AWAITING CONTACTED  */
*                        THEN WKPT2=RINREMOT;  /*REMOTE 370X*/     1559
         B     @RC01557                                            1559
@RF01557 CLI   RPRENTRY(WKPT1),X'82'                               1559
         BNE   @RF01559                                            1559
         TM    RPRINV(WKPT1),B'01000000'                           1559
         BNZ   @RF01559                                            1559
         SLR   @15,@15                                             1559
         C     @15,RINREMOT(,WKPT1)                                1559
         BE    @RF01559                                            1559
         L     @09,RINRPHCN(,WKPT1)                                1559
         CR    @09,@15                                             1559
         BE    @RT01559                                            1559
         L     @15,RPHWEA(,@09)                                    1559
         CLI   NCSPLVCD(@15),X'03'                                 1559
         BNE   @RF01559                                            1559
@RT01559 DS    0H                                                  1560
         L     WKPT2,RINREMOT(,WKPT1)                              1560
*                END;                                              1561
@RF01559 DS    0H                                                  1561
@RC01557 DS    0H                                                  1562
*         END;                                                     1562
@RC01554 DS    0H                                                  1563
*   IF WKPT2=CCL0                                                  1563
*     THEN;    /*LOOK AT NEXT*/                                    1563
@RC01550 LTR   WKPT2,WKPT2                                         1563
         BZ    @RT01563                                            1563
*     ELSE DO;  /*ATTEMPT TO SPIN OFF ERP*/                        1565
*          RFY (ISTRPRE,ISTRDT,ISTRCC) BASED(WKPT2);               1566
*          CALL CCLGET;  /*GET NCSPL AND WORKAREA*/                1567
         BAL   @14,CCLGET                                          1567
*          IF CCLNSTR=ON                                           1568
*            THEN DO;    /*NO STORAGE*/                            1568
         TM    CCLNSTR,B'00000001'                                 1568
         BNO   @RF01568                                            1568
*                 CCLMSGID=MSG620I;                                1570
         MVC   CCLMSGID(4),@CC04622                                1570
*                 CCLRDT=WKPT2;    /*RDTE PTR FOR MSG*/            1571
         LR    CCLRDT,WKPT2                                        1571
*                 CALL CCLWTO;     /*WRT MSG*/                     1572
         BAL   @14,CCLWTO                                          1572
*                 CCLRDT=NCSPLRPT; /*RESTORE CCLRDT*/              1573
         L     CCLRDT,NCSPLRPT(,CCLNCSPL)                          1573
*                 END;                                             1574
*            ELSE DO;    /*LOOK AT NEXT*/                          1575
         B     @RC01568                                            1575
@RF01568 DS    0H                                                  1576
*                 WKPT3=CCLSAVEB;       /*COVER 2ND NCSPL*/        1576
         L     WKPT3,CCLSAVEB                                      1576
*                 RFY ISTNCSPL BASED (WKPT3);                      1577
*                 /*COPY 1ST NCSPL                                   */
*                 ISTNCSPL(1:256)=CCLNCSPL->ISTNCSPL(1:256);       1578
         MVC   ISTNCSPL(256,WKPT3),ISTNCSPL(CCLNCSPL)              1578
*                 ISTNCSPL(257:LENGTH(ISTNCSPL))                   1579
*                  = CCLNCSPL->ISTNCSPL(257:LENGTH(ISTNCSPL));     1579
         MVC   ISTNCSPL+256(24,WKPT3),ISTNCSPL+256(CCLNCSPL)       1579
*                 NCSPLRPT=WKPT2;  /*RDTE*/                        1580
         ST    WKPT2,NCSPLRPT(,WKPT3)                              1580
*                 NCSPLMOM=ON;     /*MOM FAILED*/                  1581
         OI    NCSPLMOM(WKPT3),B'10000000'                         1581
*                 NCSPLRID=RPRNAME;                                1582
         MVC   NCSPLRID(8,WKPT3),RPRNAME(WKPT2)                    1582
*                 NCSPLSPL=CCL0;/* CLEAR PTR TO CONTACT NCSPL @XM08651*
         SLR   @15,@15                                             1583
         ST    @15,NCSPLSPL(,WKPT3)                                1583
*                 NCSPLWKA=CCLSAVEA;   /*WKA*/                     1584
         L     @15,CCLSAVEA                                        1584
         ST    @15,NCSPLWKA(,WKPT3)                                1584
*                 IF CCLREQ=ON                                     1585
*                   THEN DO;       /*NCSPL REQSTORED*/             1585
         TM    CCLREQ,B'10000000'                                  1585
         BNO   @RF01585                                            1585
*                        NCSPLREQ=ON;                              1587
         OI    NCSPLREQ(WKPT3),B'00010000'                         1587
*                        END;                                      1588
*                   ELSE;                                          1589
@RF01585 DS    0H                                                  1590
*                 RFY  ISTNCSPL BASED(CCLNCSPL);                   1590
*                 IF RPRENTRY=RPRENTRN                             1591
*                    THEN WKPT3=RDTEPAB;                           1591
         CLI   RPRENTRY(WKPT2),X'01'                               1591
         BNE   @RF01591                                            1591
         L     WKPT3,RDTEPAB(,WKPT2)                               1592
*                   ELSE WKPT3=RCCEPAB;                            1593
         B     @RC01591                                            1593
@RF01591 L     WKPT3,RCCEPAB(,WKPT2)                               1593
*                 RFY ISTDYPAB BASED(WKPT3);                       1594
*                                                                  1594
@RC01591 DS    0H                                                  1595
*/*  TPQUE (CCLSAVEB,DYPPAB) NORM */                               1595
*                                                                  1595
*                  DO;                                             1595
*                  RFY (GPR00P,GPR01P,GPR04P,GPR05P,GPR15P) RSTD;  1596
*                  GEN REFS(GPR01P) SETS(RPHWORK)                  1597
*        (STM GPR02P,GPR08P,RPHWORK(GPR01P));                      1597
         STM GPR02P,GPR08P,RPHWORK(GPR01P)
*                  GPR00P=0;                                       1598
         SLR   GPR00P,GPR00P                                       1598
*                  GPR15P=ADDR(DYPPAB); /*HOLD PAB PTR*/           1599
         LA    GPR15P,DYPPAB(,WKPT3)                               1599
*                  GPR04P=CCLSAVEB; /*WORK ELE PTR*/               1600
         L     GPR04P,CCLSAVEB                                     1600
*                  GPR05P=GPR15P; /*PASS PAB PTR*/                 1601
         LR    GPR05P,GPR15P                                       1601
*                  CALL ATCLCPTR->ATCAP37->ISTAPC37;               1602
         L     @09,ATCLCPTR                                        1602
         L     @15,ATCAP37(,@09)                                   1602
         BALR  @14,@15                                             1602
*                  GEN(NOPR  0)NOSETS NOREFS;                      1603
         NOPR  0
*                  RFY (GPR00P,GPR01P,GPR04P,GPR05P,GPR15P) UNRSTD;
*                  END; /**** END OF TPQUE GENERATION ****/        1605
*                 END;                                             1606
*          END;                                                    1607
@RC01568 DS    0H                                                  1608
* END;  /*DOWHILE*/                                                1608
@RT01563 DS    0H                                                  1608
@DE01548 TM    CCLLOOP,B'00000100'                                 1608
         BO    @DL01548                                            1608
*RFY(ISTRPRE,ISTRDT,ISTRCC) BASED (CCLRDT);                        1609
*RFY ISTRIN BASED(RRNTRENT);                                       1610
*RFY(WKPT1,WKPT2,WKPT3)UNRSTD;                                     1611
*CCLR14=CCLSAVE5;                                                  1612
         L     CCLR14,CCLSAVE5                                     1612
*END CCLSPIN;                                                      1613
@EL00007 DS    0H                                                  1613
@EF00007 DS    0H                                                  1613
@ER00007 BR    @14                                                 1613
*CCLGET:PROC OPTIONS(NOSAVE,NOSAVEAREA);                           1614
CCLGET   DS    0H                                                  1615
*/********************************************************************/
*/* GETS NCSPL AND NCSPLWKA FOR SUBROUTINES CONTACT AND CCLSPIN      */
*/* OUTPUT: CCLNSTR=ON IF COULDNOT OBTAIN STORAGE                    */
*/*         CCLSAVEA=ADDR WORK AREA                                  */
*/*         CCLSAVEB=ADDR NCSPL                                      */
*/*         CCLREQ=ON IF REQSTORE DONE FOR NCSPL             @D32CKLB*/
*/*                                                                  */
*/********************************************************************/
*RFY CCLR15 RSTD;                                                  1615
*CCLSAVE6=CCLR14;                                                  1616
         ST    CCLR14,CCLSAVE6                                     1616
*CCLREQ=OFF;  /*CLEAR OUTPUT FLAGS*/                               1617
         NI    CCLREQ,B'01111111'                                  1617
*CCLNSTR=OFF;                                                      1618
         NI    CCLNSTR,B'11111110'                                 1618
*RFY ISTGTNCS BASED(ADDR(CCLR1->RPHCRR->CRACRR->VYCRRCW3));/*@D32CKLB*/
*/********************************************************************/
*/* SET UP PARAMETER LIST FOR ISTINCW3 TO OBTAIN NCSPL AND WORK AREA */
*/* AND INDICATE THAT REQSTORE MAY BE USED, BUT WITHOUT QUEUING TO   */
*/* WAIT FOR THE STORAGE TO BECOME AVAILABLE.                @D32CKLB*/
*/********************************************************************/
*GTNCSAD = 0;                          /* 'GET NCSPL'        @D32CKLB*/
         L     @10,RPHCRR(,CCLR1)                                  1620
         LA    @09,118                                             1620
         AL    @09,CRACRR(,@10)                                    1620
         SLR   @10,@10                                             1620
         ST    @10,GTNCSAD(,@09)                                   1620
*GTNCSREQ = ON;                        /* PERMIT REQSTORE    @D32CKLB*/
*GTNCSRQU = OFF;                       /* DO NOT QUEUE       @D32CKLB*/
*GTNCSWKA = OFF;                       /* GET WORKAREA       @D32CKLB*/
         OI    GTNCSREQ(@09),B'10000000'                           1623
         NI    GTNCSRQU(@09),B'10011111'                           1623
*RFY CCLR0 RSTD;                       /*                    @D32CKLB*/
*CCLR0 = ADDR(ISTGTNCS);               /* PASS PARM. LIST    @D32CKLB*/
         LR    CCLR0,@09                                           1625
*CALL ATCINCW3;                        /* INVOKE ISTINCW3    @D32CKLB*/
         L     @10,NCSPLCVT(,CCLNCSPL)                             1626
         L     @15,ATCINCW3(,@10)                                  1626
         BALR  @14,@15                                             1626
*IF CCLR15 = CCL0                      /* STORAGE OBTAINED   @D32CKLB*/
*   THEN DO;                           /*                    @D32CKLB*/
         LTR   CCLR15,CCLR15                                       1627
         BNZ   @RF01627                                            1627
*        CCLSAVEB = CCLR0->GTNCSAD;    /* ADDRESS NCSPL      @D32CKLB*/
         LR    @10,CCLR0                                           1629
         L     @10,GTNCSAD(,@10)                                   1629
         ST    @10,CCLSAVEB                                        1629
*        CCLSAVEA = CCLSAVEB->NCSPLWKA;/*ADDRESS WORK AREA   @D32CKLB*/
         L     @09,NCSPLWKA(,@10)                                  1630
         ST    @09,CCLSAVEA                                        1630
*        IF CCLSAVEB->NCSPLREQ = ON    /* REQSTORE DONE      @D32CKLB*/
*           THEN CCLREQ = ON;          /* TELL CALLER        @D32CKLB*/
         TM    NCSPLREQ(@10),B'00010000'                           1631
         BNO   @RF01631                                            1631
         OI    CCLREQ,B'10000000'                                  1632
*        ELSE;                                             /*@D32CKLB*/
@RF01631 DS    0H                                                  1634
*        END;                          /*                    @D32CKLB*/
*        ELSE CCLNSTR = ON;            /* NOT OBTAINED       @D32CKLB*/
         B     @RC01627                                            1635
@RF01627 OI    CCLNSTR,B'00000001'                                 1635
*RFY CCLR0 UNRSTD;                                         /*@D32CKLB*/
@RC01627 DS    0H                                                  1637
* CCLR14=CCLSAVE6;                                                 1637
         L     CCLR14,CCLSAVE6                                     1637
* RFY CCLR15 UNRSTD;                                               1638
* END CCLGET;                                                      1639
@EL00008 DS    0H                                                  1639
@EF00008 DS    0H                                                  1639
@ER00008 BR    @14                                                 1639
*CCLPOST:PROC OPTIONS(NOSAVE,NOSAVEAREA);                          1640
CCLPOST  DS    0H                                                  1641
*/********************************************************************/
*/* CALLED BY CCLRET1 OR CCLHRD1 TO POST ANY WAITING RPHS          */
*/*                                                                  */
*/********************************************************************/
*RFY (WKPT1,WKPT2,WKPT3) RSTD;                                     1641
*CCLSAVE7=CCLR14;                                                  1642
         ST    CCLR14,CCLSAVE7                                     1642
*IF CCLSW2=ON   /*DONT POST*/                                      1643
*  THEN;                                                           1643
         TM    CCLSW2,B'01000000'                                  1643
         BO    @RT01643                                            1643
*  ELSE DO;                                                        1645
*    CCLLCK=ON;   /*GET DAF LOCK*/                                 1646
         OI    CCLLCK,B'01000000'                                  1646
*    CALL CCLLOCK;                                                 1647
         BAL   @14,CCLLOCK                                         1647
*      IF CCLLCK = ON                     /* IF CIDCTL       @DA08954*/
*        THEN DO;                         /* IF SUCCESSFUL   @DA08954*/
         TM    CCLLCK,B'01000000'                                  1648
         BNO   @RF01648                                            1648
*    NCBRSTRT=OFF;                                                 1650
         L     @15,CCLNCB                                          1650
         NI    NCBRSTRT(@15),B'11011111'                           1650
*    IF RPRENTRY=RPRENTRN    /*370X*/                              1651
*      THEN DO;                                                    1651
         CLI   RPRENTRY(CCLRDT),X'01'                              1651
         BNE   @RF01651                                            1651
*        RRNERPIP=OFF;    /*CLEAR ERP IN PROGRESS*/                1653
         NI    RRNERPIP(CCLRDT),B'11111011'                        1653
*        RDTPRGDN=OFF;    /*CLEAR PRGDN*/                          1654
         NI    RDTPRGDN(CCLRDT),B'10111111'                        1654
*        WKPT1=NCSPLRPT;  /*RDTE                             @DM10676*/
         L     WKPT1,NCSPLRPT(,CCLNCSPL)                           1655
*        RFY (ISTRPRE,ISTRCC,ISTRIN) BASED(WKPT1);         /*@DM10676*/
*        DO WHILE RPRENTED=OFF;   /*NOT LAST IN SEG          @DM10676*/
         B     @DE01657                                            1657
@DL01657 DS    0H                                                  1658
*          WKPT1=WKPT1+RPRELEN;   /*NEXT                     @DM10676*/
         AH    WKPT1,RPRELEN(,WKPT1)                               1658
*          CALL CLPOSTDQ;         /* POST WAITING CONTACTS   @DA06111*/
         BAL   @14,CLPOSTDQ                                        1659
*            END;  /*DOWHILE                                 @DM10676*/
@DE01657 TM    RPRENTED(WKPT1),B'00000100'                         1660
         BZ    @DL01657                                            1660
*           RFY (ISTRPRE,ISTRCC) BASED (CCLRDT);          /*@DM10676*/
*           RFY (ISTRIN) BASED (RRNTRENT);                /*@DM10676*/
*         END;                                             /*@DM10676*/
*      ELSE DO;    /*CLUSTER CTL                             @DM10676*/
         B     @RC01651                                            1664
@RF01651 DS    0H                                                  1665
*        RCCERPIP=OFF;    /*CLEAR ERPIP                      #DM10676*/
*        RCCPRGDN=OFF;    /*CLEAR PRGDN                      @DM10676*/
         NI    RCCERPIP(CCLRDT),B'11011101'                        1666
*        END;                                              /*@DM10676*/
*    RFY WKPT3 UNRSTD;    /* FREE WORK REG                   @DA06111*/
@RC01651 DS    0H                                                  1669
*    WKPT1=NCBFMCBA;                                               1669
         L     @15,CCLNCB                                          1669
         L     WKPT1,NCBFMCBA(,@15)                                1669
*    RFY ISTFMCB BASED(WKPT1);                                     1670
*    DO WHILE FMCMODE^=VFMCB;     /*FIND VARYS FMCB*/              1671
         B     @DE01671                                            1671
@DL01671 DS    0H                                                  1672
*      WKPT1=FMCFMCBA;  /*NEXT FMCB*/                              1672
         L     WKPT1,FMCFMCBA(,WKPT1)                              1672
*    END;                                                          1673
@DE01671 CLC   FMCMODE(8,WKPT1),@CC04646                           1673
         BNE   @DL01671                                            1673
*    IF FMCVWT=CCL0     /*WAITING RPH*/                            1674
*      THEN;                                                       1674
         L     @15,FMCVWT(,WKPT1)                                  1674
         LTR   @15,@15                                             1674
         BZ    @RT01674                                            1674
*      ELSE DO;                                                    1676
*        WKPT2 = FMCVWT;    /* GET ADDR OF RPH TO TPPOST     @DA06111*/
         L     WKPT2,FMCVWT(,WKPT1)                                1677
*        FMCVWT = CCL0;     /* ZERO WAITING RPH FIELD        @DA06111*/
*                                                                  1678
         SLR   @15,@15                                             1678
         ST    @15,FMCVWT(,WKPT1)                                  1678
*/*TPPOST  (WKPT2)  */                                             1679
*           DO;                                                    1679
*                                       /*DECLARE AND RESTRICT REGS*/
*             RESPECIFY (GPR00F,GPR01F,GPR04F,GPR05F,              1680
*                       GPR06F,GPR14F,GPR15F) RSTD;                1680
*                                       /*0,1,4,5,6,14, AND 15   */
*                                                                  1681
*/* ATBUILD (ISTPAB,ISTDYPAB,ISTRPH)  */                           1681
*/* END OF ATBUILD */                                              1681
*             GEN REFS(GPR01P,GPR02F,GPR06F)SETS(RPHWORK);         1681
        STM GPR02F,GPR06F,RPHWORK(GPR01P)
*             GPR04F=WKPT2;             /*LOAD RPH PNTR INTO REG 4*/
         LR    GPR04F,WKPT2                                        1682
*             RFY GPR03F RSTD;                                     1683
*             GPR03F=0;                                            1684
*                                                                  1684
         SLR   @10,@10                                             1684
         LR    GPR03F,@10                                          1684
*           DO; /*MODESET  SAVEKEY(GPR06F) KEYADDR(GPR03F) WORKREG(GPR0
*F)*/         RESPECIFY (GPR02F) RESTRICTED;                       1685
*             GPR05F = GPR02F; /*SAVE REGISTER 2*/                 1687
         LR    GPR05F,GPR02F                                       1687
*             IPK; /*SAVE CURRENT PSW KEY*/                        1688
         IPK                                                       1688
*             GPR06F = GPR02F;                                     1689
         LR    GPR06F,GPR02F                                       1689
*             GPR02F = GPR05F; /*RESTORE REGISTER 2*/              1690
         LR    GPR02F,GPR05F                                       1690
*             SPKA (GPR03F); /*SET PSW KEY*/                       1691
         SPKA  0(GPR03F)                                           1691
*             RESPECIFY (GPR02F) UNRESTRICTED;                     1692
*           END; /*MODESET  SAVEKEY(GPR06F) KEYADDR(GPR03F) WORKREG(GPR
*5F)*/        RFY GPR03F UNRSTD;                                   1693
*             GPR05P=GPR04P->RPHMAJCB+GPR04P->RPHPABOF;            1695
         L     GPR05P,RPHMAJCB-1(,GPR04P)                          1695
         LA    GPR05P,0(,GPR05P)                                   1695
         SLR   @09,@09                                             1695
         IC    @09,RPHPABOF(,GPR04P)                               1695
         ALR   GPR05P,@09                                          1695
*                                       /*LOAD REG 5  WITH ADDR OF*/
*                                       /*MAJOR CONTROL BLOCK PLUS*/
*                                       /*OFFSET OF PAB IN BLOCK  */
*             GPR14P=0;                 /*LOAD 0 INTO REG 14      */
         LR    GPR14P,@10                                          1696
*             GPR15P='FFFFFFFF'X;       /*LOAD REG 15 WITH DUMMY  */
         SLR   GPR15P,GPR15P                                       1697
         BCTR  GPR15P,0                                            1697
*                                       /*ADDRESS                 */
*             CS (GPR14P,GPR15P,GPR04P->RPHRESMA);                 1698
         CS    GPR14P,@15,RPHRESMA(GPR04P)                         1698
*                                       /*COMPARE RESUME ADDRESS  */
*                                       /*WITH 0 AND,IF EQUAL, PUT*/
*                                       /*DUMMY ADDRESS IN CONTROL*/
*                                       /*BLOCK RESUME ADDRESS    */
*             BC (8,FMZT0120);          /*IF EQUAL, BYPASS REMAINDER*/
         BC    8,FMZT0120                                          1699
*                                       /*OF EXPANSION              */
*FMZL0120:    IF GPR04P->RPHWT='1'B THEN/*WT/EXT CONTENTION FLAG ON */
FMZL0120 TM    RPHWT(GPR04P),B'00001000'                           1700
         BNO   @RF01700                                            1700
*             DO;                       /*IN RPH                    */
*               GPR14P=GPR04P->RPHRESMA×RPHWT1;                    1702
         L     GPR14P,RPHRESMA(,GPR04P)                            1702
         O     GPR14P,@CF01354                                     1702
*                                       /*LOAD REG 14 WITH FLAG FIELD*/
*                                       /*AND MAKE CERTAIN WT/EXT    */
*                                       /*CONTENTION FLAG STILL ON   */
*               GPR15P=GPR14P×RPHPT1;   /*LOAD REG 15 WITH FLAG FIELD*/
         LR    GPR15P,GPR14P                                       1703
         O     GPR15P,@CF01358                                     1703
*                                       /*AND TURN POST FLAG ON      */
*               CS (GPR14P,GPR15P,GPR04P->RPHRESMA);               1704
         CS    GPR14P,@15,RPHRESMA(GPR04P)                         1704
*                                       /*COMPARE REG 14 WITH FLAG */
*                                       /*FIELD--IF WT/EXT BIT ON, */
*                                       /*TURN ON POST FLAG        */
*               BC (4,FMZL0120);        /*IF WT/EXT BIT WAS OFF, LOOP*/
         BC    4,FMZL0120                                          1705
*                                       /*TO TEST CONTENTION FLAG    */
*               BC (8,FMZT0120);        /*IF WT/EXT BIT WAS OFF,     */
         BC    8,FMZT0120                                          1706
*                                       /*BRANCH TO BYPASS CODE GEN  */
*             END;                      /*IF POST FLAG IS ON, FALL*/
*                                       /*THRU BOTTOM OF LOOP     */
*             ELSE;                     /*WT/EXT CONTENTION FLAG OFF*/
@RF01700 DS    0H                                                  1709
*             IF GPR04P->RPHTSKID=GPR01P->RPHTSKID                 1709
*             THEN DO;                                             1709
         CLC   RPHTSKID(4,GPR04P),RPHTSKID(GPR01P)                 1709
         BNE   @RF01709                                            1709
*               GPR05P->PABCHNGP=GPR01P->RPHPABQP;                 1711
         MVC   PABCHNGP(3,GPR05P),RPHPABQP(GPR01P)                 1711
*                                       /*PUT PAB QUEUE ADDRESS*/  1712
*                                       /*IN SECOND WORD OF PAB     */
*               GPR01P->RPHPABQP=GPR05P;/*PUT PAB ADDRESS (IN MAJOR */
         STCM  GPR05P,7,RPHPABQP(GPR01P)                           1712
*                                       /*CONTROL BLOCK) IN PAB */ 1713
*                                       /*QUEUE ADRESS IN RPH    */
*               END;                                               1713
*             ELSE DO;                                             1714
         B     @RC01709                                            1714
@RF01709 DS    0H                                                  1715
*               GPR00F=0;               /*SET REG 0 TO INDICATE ENA*/
*                                                                  1715
         SLR   GPR00F,GPR00F                                       1715
*           DO; /* LISATCVT CVTBASE(PAGEABLE,(GPR15P)) */          1716
*             GPR15P = ATCLCPTR; /*SET UP ATCVT POINTER*/          1717
         L     GPR15P,ATCLCPTR                                     1717
*           END; /*LISATCVT*/           /*PUT POINTER TO ATCVT IN */
*                                       /*  IN REG 15             */
*               CALL GPR15P->ATCAP32;   /* CALL ISTAPC32: TPSCHED */
         L     @10,ATCAP32(,GPR15P)                                1719
         LR    @15,@10                                             1719
         BALR  @14,@15                                             1719
*               END;                                               1720
*FMZT0120:                                                         1721
*           DO; /*MODESET  KEYADDR(GPR06F) WORKREG(GPR05F)*/       1721
@RC01709 DS    0H                                                  1721
FMZT0120 DS    0H                                                  1722
*             GPR05F = GPR06F; /*GET KEY FORM SAVE LOCATION*/      1722
         LR    GPR05F,GPR06F                                       1722
*             SPKA (GPR05F); /*SET PSW KEY*/                       1723
         SPKA  0(GPR05F)                                           1723
*           END; /*MODESET  KEYADDR(GPR06F) WORKREG(GPR05F)*/      1724
*             GEN REFS(GPR04P,                                     1725
*             RPHWORK)                                             1725
*                 SETS(GPR02F,GPR03F,                              1725
*                       GPR04F,GPR05F,GPR06F);                     1725
        LM GPR02F,GPR06F,RPHWORK(GPR01P)
*             RESPECIFY (GPR00F,GPR01F,GPR04F,GPR05F,GPR06F,       1726
*             GPR14F,GPR15F) UNRSTD;    /*UNRESTRICT REGS 0,1,    */
*                                       /*4,5,14, AND 15          */
*           END;  /****END OF TPPOST GENERATION****/  /* TPPOST RPH WAI
*ING FOR ERP    @DA06111*/                                         1727
*         END;                                                     1728
*    RFY WKPT2 UNRSTD;     /* FREE UP WORK REGISTER          @DA06111*/
@RT01674 DS    0H                                                  1730
*    CCLLCK=OFF;                                                   1730
         NI    CCLLCK,B'10111111'                                  1730
*    CALL CCLLOCK;  /*FREE LOCK*/                                  1731
         BAL   @14,CCLLOCK                                         1731
*    END;                                                          1732
*      END;                                                /*@DA08954*/
@RF01648 DS    0H                                                  1734
*IF CCLSW3=ON                                                      1734
*  THEN CCLTPQR=CCL0;  /* FREE NCSPL IN MAINLINE*/                 1734
@RT01643 TM    CCLSW3,B'00100000'                                  1734
         BNO   @RF01734                                            1734
         SLR   CCLTPQR,CCLTPQR                                     1735
*  ELSE;                                                           1736
@RF01734 DS    0H                                                  1737
*CCLR14=CCLSAVE7;                                                  1737
         L     CCLR14,CCLSAVE7                                     1737
*RFY WKPT1 UNRSTD;                                                 1738
*END CCLPOST;                                                      1739
@EL00009 DS    0H                                                  1739
@EF00009 DS    0H                                                  1739
@ER00009 BR    @14                                                 1739
*CCLFREE: PROC OPTIONS(NOSAVE,NOSAVEAREA);                         1740
CCLFREE  DS    0H                                                  1741
*/********************************************************************/
*/* FREE THE NCSPL AND NCSPL WORKAREA                                */
*/* WKPT1=NCSPL                                                      */
*/********************************************************************/
*RFY (WKPT1,WKPT3) RSTD;                                   /*@D32CKLB*/
*RFY ISTNCSPL BASED(WKPT1);                                        1742
*WKPT3=CCLR14; /*SAVE RETURN*/                                     1743
         LR    WKPT3,CCLR14                                        1743
*RFY ISTGTNCS BASED(ADDR(CCLR1->RPHCRR->CRACRR->VYCRRCW3));/*@D32CKLB*/
*RFY CCLR0 RSTD;                                           /*@D32CKLB*/
*GTNCSAD=WKPT1;                        /* ADDRESS NCSPL      @D32CKLB*/
         L     @15,RPHCRR(,CCLR1)                                  1746
         LA    @07,118                                             1746
         AL    @07,CRACRR(,@15)                                    1746
         ST    WKPT1,GTNCSAD(,@07)                                 1746
*CCLR0=ADDR(ISTGTNCS);                 /* PASS PARM. LIST    @D32CKLB*/
         LR    CCLR0,@07                                           1747
*CALL ATCINCW3;                        /* INVOKE ISTINCW3    @D32CKLB*/
         L     @07,NCSPLCVT(,WKPT1)                                1748
         L     @15,ATCINCW3(,@07)                                  1748
         BALR  @14,@15                                             1748
*RFY ISTNCSPL BASED(CCLNCSPL);                                     1749
*CCLR14=WKPT3;                                                     1750
         LR    CCLR14,WKPT3                                        1750
*RFY(WKPT1,WKPT3) UNRSTD;                                  /*@D32CKLB*/
*END CCLFREE;                                                      1752
@EL00010 DS    0H                                                  1752
@EF00010 DS    0H                                                  1752
@ER00010 BR    @14                                                 1752
*CCLACTP:PROC OPTIONS(NOSAVE,NOSAVEAREA);                          1753
CCLACTP  DS    0H                                                  1754
*/********************************************************************/
*/* SETS UP AN ACTIVATE PHYSICAL REQUEST AS PART OF RECOVERY ON A    */
*/* SOFT FAILURE                                                    */
*/*                                                                  */
*/********************************************************************/
*CCLSAVE8=CCLR14;   /*RETURN PT*/                                  1754
         ST    CCLR14,CCLSAVE8                                     1754
*NCSPLCMD=NCSCAPU;  /*ACT PHY CMND*/                               1755
         MVC   NCSPLCMD(2,CCLNCSPL),@CB02178                       1755
*NCSPLRIO=ON;   /*RESTART IO*/                                     1756
         OI    NCSPLRIO(CCLNCSPL),B'00100000'                      1756
*NCSPLOLN=LENGTH(RUACTPHY);    /*LENGTH OF OUTPUT RU         @D32CKLB*/
         MVC   NCSPLOLN(2,CCLNCSPL),@CH00708                       1757
*NCSPLRUO=ADDR(CCLRUOBF);  /*RU BUFFER*/                           1758
         LA    @15,CCLRUOBF                                        1758
         ST    @15,NCSPLRUO(,CCLNCSPL)                             1758
*NCSPLRUI=ADDR(CCLRUIBF);  /* RU INPUT BUFFER*/                    1759
         LA    @15,CCLRUIBF                                        1759
         ST    @15,NCSPLRUI(,CCLNCSPL)                             1759
*RFY ISTRUB BASED(ADDR(RUACTPHY));                         /*@D32CKLB*/
*SRUQSREQ=SRACTPU;                     /* ACTPU REQUEST      @D32CKLB*/
         LA    @15,RUACTPHY                                        1761
         MVI   SRUQSREQ(@15),X'11'                                 1761
*SRUDAT1I=ATCCONFT->CONSCPID;          /* SSCP ID IN RU      @D32CKLB*/
         L     @10,NCSPLCVT(,CCLNCSPL)                             1762
         L     @10,ATCCONFT(,@10)                                  1762
         MVC   SRUDAT1I(6,@15),CONSCPID(@10)                       1762
*IF RPRENTRY=RPRENTRN    /*370X*/                                  1763
*   THEN DO;                                                       1763
         CLI   RPRENTRY(CCLRDT),X'01'                              1763
         BNE   @RF01763                                            1763
*         SRUDAT1T=SRUERP;   /* ERP ACTIVATION               @X50BHEM*/
         MVI   SRUDAT1T(@15),X'02'                                 1765
*         SRUFMPRO=SRUFMP5;  /* FM PROFILE 5                 @D32CKLB*/
         NI    SRUFMPRO(@15),B'01011111'                           1766
         OI    SRUFMPRO(@15),B'01010000'                           1766
*         SRUTSPRO=SRUTSP5;  /* TS LEVEL 5                   @D32CKLB*/
         NI    SRUTSPRO(@15),B'11110101'                           1767
         OI    SRUTSPRO(@15),B'00000101'                           1767
*         CCLTPQR=RDTDPAB;   /*DLR PAB*/                           1768
         L     CCLTPQR,RDTDPAB(,CCLRDT)                            1768
*         END;                                                     1769
*   ELSE DO;  /*CLUSTER CTL*/                                      1770
         B     @RC01763                                            1770
@RF01763 DS    0H                                                  1771
*         SRUDAT1T=SRUCOLD;  /* COLD ACTIVATION     @D32CKLB,@X50BHEM*/
         LA    @15,RUACTPHY                                        1771
         MVI   SRUDAT1T(@15),X'01'                                 1771
*         SRUFMPRO=SRUFMP0;  /* FM PROFILE 0                 @D32CKLB*/
         NI    SRUFMPRO(@15),B'00001111'                           1772
*         SRUTSPRO=SRUTSP1;  /* TS LEVEL 1                   @D32CKLB*/
         NI    SRUTSPRO(@15),B'11110001'                           1773
         OI    SRUTSPRO(@15),B'00000001'                           1773
*         CCLTPQR=RCCDPAB;  /*DLR PAB*/                            1774
         L     CCLTPQR,RCCDPAB(,CCLRDT)                            1774
*         END;                                                     1775
*CCLR14=CCLSAVE8;                                                  1776
@RC01763 L     CCLR14,CCLSAVE8                                     1776
*END CCLACTP;                                                      1777
@EL00011 DS    0H                                                  1777
@EF00011 DS    0H                                                  1777
@ER00011 BR    @14                                                 1777
*CCLPGNT:PROC OPTIONS (NOSAVE,NOSAVEAREA);                         1778
CCLPGNT  DS    0H                                                  1779
*/********************************************************************/
*/* DOES PURGES OR NOTIFYS OF USER OR VARY FMCBS                     */
*/* FOR EVERY RDTE WITHIN THE SCOPE OF THE FAILING NODE              */
*/********************************************************************/
*RFY WKPT1 RSTD;                                                   1779
*CCLSAVE9=CCLR14;   /*SAVE RETURN*/                                1780
         ST    CCLR14,CCLSAVE9                                     1780
*CCLLOOP=ON;                                                       1781
         OI    CCLLOOP,B'00000100'                                 1781
*CCLRPT=NCSPLRPT;   /*SAVE RDTE*/                                  1782
         L     @15,NCSPLRPT(,CCLNCSPL)                             1782
         ST    @15,CCLRPT                                          1782
*CCLCID=NCSPLCID;    /*SAVE CID*/                                  1783
         MVC   CCLCID(4),NCSPLCID(CCLNCSPL)                        1783
*IF NCSPRMRC=LCPMNEW  /*LOST CONTACT SET IF NOTIFY*/               1784
*  THEN NCSPLCMD=NCSCNOTF;   /*NOTIFY CMND*/                       1784
         CLI   NCSPRMRC(CCLNCSPL),X'02'                            1784
         BNE   @RF01784                                            1784
         MVC   NCSPLCMD(2,CCLNCSPL),@CB02070                       1785
*  ELSE NCSPLCMD=NCSNCPPG;    /*PURGE*/                            1786
         B     @RC01784                                            1786
@RF01784 MVC   NCSPLCMD(2,CCLNCSPL),@CB02246                       1786
*WKPT1=NCSPLRPT;    /*ENTRY RDTE*/                                 1787
@RC01784 L     WKPT1,NCSPLRPT(,CCLNCSPL)                           1787
*RFY (ISTRPRE,ISTRDT) BASED (WKPT1);                               1788
*CCLENT=RPRENTRY;   /*TYPE OF FAILING NODE                   @DM09556*/
         MVC   CCLENT(1),RPRENTRY(WKPT1)                           1789
*NCSOVFMC=OFF;   /*CLEAR*/                                         1790
         NI    NCSOVFMC(CCLNCSPL),B'01111111'                      1790
*NCSOUFMC=OFF;   /*CLEAR*/                                         1791
         NI    NCSOUFMC(CCLNCSPL),B'11101111'                      1791
*IF RPRENTRY=RPRENTRN    /*370X*/                                  1792
*  THEN DO;                                                        1792
         CLI   RPRENTRY(WKPT1),X'01'                               1792
         BNE   @RF01792                                            1792
*       IF CCLPRG=PRGVO  /*PURGE VARY ONLY*/                       1794
*         THEN DO;                                                 1794
         CLI   CCLPRG,X'00'                                        1794
         BNE   @RF01794                                            1794
*              NCSOVFMC=ON;  /*PURGE VARY ONLY*/                   1796
         OI    NCSOVFMC(CCLNCSPL),B'10000000'                      1796
*              CALL CCLCIO;                                        1797
         BAL   @14,CCLCIO                                          1797
*              END;                                                1798
*         ELSE DO;   /*PURGE BOTH VARY AND USER*/                  1799
         B     @RC01794                                            1799
@RF01794 DS    0H                                                  1800
*              IF NCSPRMRC=LCPMNSF    /*SOFT SUC RECOVRY   @DM0667*/
*              THEN;                   /* DONT PURGE 370X   @DM0667*/
         CLI   NCSPRMRC(CCLNCSPL),X'01'                            1800
         BE    @RT01800                                            1800
*              ELSE CALL CCLCIO;                                   1802
         BAL   @14,CCLCIO                                          1802
*              DO WHILE CCLLOOP=ON;                                1803
@RT01800 B     @DE01803                                            1803
@DL01803 DS    0H                                                  1804
*                IF RPRENTED=ON         /* LAST SEG IN RDTE*/      1804
*                  THEN CCLLOOP=OFF;                               1804
         TM    RPRENTED(WKPT1),B'00000100'                         1804
         BNO   @RF01804                                            1804
         NI    CCLLOOP,B'11111011'                                 1805
*                  ELSE DO;                                        1806
         B     @RC01804                                            1806
@RF01804 DS    0H                                                  1807
*                       WKPT1=WKPT1+RPRELEN;  /*NEXT SEG*/         1807
         AH    WKPT1,RPRELEN(,WKPT1)                               1807
*                       IF RPRENTRY=RPRENTCC ×  /*IF CLUSTER CTL*/ 1808
*                          RPRENTRY=RPRENTLU ×  /*OR LU */         1808
*                          RPRENTRY=RPRENTIN   /*OR REMOTE RN THEN*/
*                         THEN;       /*SKIP*/                     1808
         CLI   RPRENTRY(WKPT1),X'71'                               1808
         BE    @RT01808                                            1808
         CLI   RPRENTRY(WKPT1),X'81'                               1808
         BE    @RT01808                                            1808
         CLI   RPRENTRY(WKPT1),X'82'                               1808
         BE    @RT01808                                            1808
*                         ELSE IF RPRENTRY<=CCLENT                 1810
*                                THEN CCLLOOP=OFF; /*OUT NODES SCOPE */
         CLC   RPRENTRY(1,WKPT1),CCLENT                            1810
         BH    @RF01810                                            1810
         NI    CCLLOOP,B'11111011'                                 1811
*                                ELSE CALL CCLCIO;                 1812
         B     @RC01810                                            1812
@RF01810 BAL   @14,CCLCIO                                          1812
*                       END;                                       1813
@RC01810 DS    0H                                                  1813
@RT01808 DS    0H                                                  1814
*              END;  /*DO WHILE*/                                  1814
@RC01804 DS    0H                                                  1814
@DE01803 TM    CCLLOOP,B'00000100'                                 1814
         BO    @DL01803                                            1814
*              END;                                                1815
*       END;                                                       1816
*  ELSE DO;   /*CLUSTER CTL*/                                      1817
         B     @RC01792                                            1817
@RF01792 DS    0H                                                  1818
*       IF CCLPRG=PRGVO                                            1818
*         THEN NCSOVFMC=ON;  /* PURGE VARY ONLY*/                  1818
         CLI   CCLPRG,X'00'                                        1818
         BNE   @RF01818                                            1818
         OI    NCSOVFMC(CCLNCSPL),B'10000000'                      1819
*         ELSE DO;                                                 1820
         B     @RC01818                                            1820
@RF01818 DS    0H                                                  1821
*              IF CCLPRG=PRGUO                                     1821
*                THEN NCSOUFMC=ON; /*PURGE USER ONLY*/             1821
         CLI   CCLPRG,X'02'                                        1821
         BNE   @RF01821                                            1821
         OI    NCSOUFMC(CCLNCSPL),B'00010000'                      1822
*                ELSE;             /*PURGE BOTH*/                  1823
@RF01821 DS    0H                                                  1824
*              END;                                                1824
*       IF CCLPRG^= PRGUO                                          1825
*         THEN CALL CCLCIO;   /*NOT PURGE USER ONLY*/              1825
@RC01818 CLI   CCLPRG,X'02'                                        1825
         BE    @RF01825                                            1825
         BAL   @14,CCLCIO                                          1826
*         ELSE;                                                    1827
@RF01825 DS    0H                                                  1828
*       DO WHILE CCLLOOP=ON;                                       1828
         B     @DE01828                                            1828
@DL01828 DS    0H                                                  1829
*         IF RPRENTED=ON           /* LAST SEGMENT*/               1829
*           THEN CCLLOOP=OFF;                                      1829
         TM    RPRENTED(WKPT1),B'00000100'                         1829
         BNO   @RF01829                                            1829
         NI    CCLLOOP,B'11111011'                                 1830
*           ELSE DO;                                               1831
         B     @RC01829                                            1831
@RF01829 DS    0H                                                  1832
*                 WKPT1=WKPT1+RPRELEN; /* NEXT SEG*/               1832
         AH    WKPT1,RPRELEN(,WKPT1)                               1832
*                 IF RPRENTRY<=CCLENT  /*OUT OF NODES SCOPE*/      1833
*                  THEN CCLLOOP=OFF;  /*EXIT*/                     1833
         CLC   RPRENTRY(1,WKPT1),CCLENT                            1833
         BH    @RF01833                                            1833
         NI    CCLLOOP,B'11111011'                                 1834
*                  ELSE DO;           /*DO PURGE OR NOTFY    @XM07949*/
         B     @RC01833                                            1835
@RF01833 DS    0H                                                  1836
*                    CALL CCLCIO;      /*                    @XM07949*/
         BAL   @14,CCLCIO                                          1836
*                    END;              /*                    @XM07949*/
*                END;                                              1838
@RC01833 DS    0H                                                  1839
*         END; /*DO WHILE*/                                        1839
@RC01829 DS    0H                                                  1839
@DE01828 TM    CCLLOOP,B'00000100'                                 1839
         BO    @DL01828                                            1839
*        END;                                                      1840
*RFY (ISTRPRE,ISTRDT) BASED (CCLRDT);                              1841
@RC01792 DS    0H                                                  1842
*RFY (WKPT1) UNRSTD;                                               1842
*NCSPLRPT=CCLRPT;    /* RESTORE RPT - CORRUPTED BY CCLCIO*/        1843
         L     @15,CCLRPT                                          1843
         ST    @15,NCSPLRPT(,CCLNCSPL)                             1843
*NCSPLRAD=CCLRDT;    /*RESTORE RAD TO ENTRY RDTE             @DM09611*/
         ST    CCLRDT,NCSPLRAD(,CCLNCSPL)                          1844
*NCSPLCID=CCLCID;    /* RESTORE CID */                             1845
         MVC   NCSPLCID(4,CCLNCSPL),CCLCID                         1845
*CCLR14=CCLSAVE9;                                                  1846
         L     CCLR14,CCLSAVE9                                     1846
*END CCLPGNT;                                                      1847
@EL00012 DS    0H                                                  1847
@EF00012 DS    0H                                                  1847
@ER00012 BR    @14                                                 1847
*CCLCIO:PROC OPTIONS(NOSAVE,NOSAVEAREA);                           1848
CCLCIO   DS    0H                                                  1849
*/********************************************************************/
*/* FINISHES SETTING UP NCSPL FOR PURGE OR NOTIFY AND CALL CIO      */
*/*  TO DO THE OPERATION                                           */
*/*                                                                  */
*/********************************************************************/
*RFY WKPT1 RSTD;                                                   1849
*CCLSAV10=CCLR14;  /*SAVE RETURN*/                                 1850
         ST    CCLR14,CCLSAV10                                     1850
*IF CCLLCK=ON THEN; /*DO NOT GET LOCK-ALREADY HAVE IT        @X50BHEM*/
         TM    CCLLCK,B'01000000'                                  1851
         BO    @RT01851                                            1851
*   ELSE DO;   /*GET LOCK                                    @D31KKDQ*/
*        NCSPLDAF=WKPT1->RPRDAF;  /*CIDCTL AND ISTINCIO      @D31KKDQ*/
         MVC   NCSPLDAF(2,CCLNCSPL),RPRDAF(WKPT1)                  1854
*        CCLLCK=ON;  /*GET DAF LOCK                          @D31KKDQ*/
         OI    CCLLCK,B'01000000'                                  1855
*        CALL CCLLOCK;                                     /*@D31KKDQ*/
         BAL   @14,CCLLOCK                                         1856
*        END;                                              /*@D31KKDQ*/
*IF CCLLCK=OFF                                                     1858
*  THEN;  /*COULD NOT GET LOCK  SEG NOT OPENED*/                   1858
@RT01851 TM    CCLLCK,B'01000000'                                  1858
         BZ    @RT01858                                            1858
*  ELSE DO;  /*GOT LOCK -DNCB PTR IN CCLNCB*/                      1860
*       NCSPLRPT=WKPT1;  /*RDTE FOR ISTINCIO*/                     1861
         ST    WKPT1,NCSPLRPT(,CCLNCSPL)                           1861
*       NCSPLRAD=WKPT1;  /*SET UP RAD                        @DM09611*/
         ST    WKPT1,NCSPLRAD(,CCLNCSPL)                           1862
*       CCLR1=CCLNCSPL;  /*NCSPL*/                                 1863
         LR    CCLR1,CCLNCSPL                                      1863
*       CCLR2=CCLNCB;    /*NCB*/                                   1864
         L     CCLR2,CCLNCB                                        1864
*       IF (NCSPRMRC=LCPMNPF×NCSPRMRC=LCPMNAS)                     1865
*          &CCLSW1=OFF & CCLSW3=OFF    /* IF HARD PURGE      @XM12352*/
*         THEN WKPT1->RPRINIMM=ON;     /* LET CLSDST KNOW    @XM12352*/
         CLI   NCSPRMRC(CCLNCSPL),X'03'                            1865
         BE    @GL00042                                            1865
         CLI   NCSPRMRC(CCLNCSPL),X'04'                            1865
         BNE   @RF01865                                            1865
@GL00042 TM    CCLSW1,B'10100000'                                  1865
         BNZ   @RF01865                                            1865
         OI    RPRINIMM(WKPT1),B'00000001'                         1866
*         ELSE;                                            /*@XM12352*/
@RF01865 DS    0H                                                  1868
*       CALL ISTINCIO;                                             1868
         L     @15,@CV04851                                        1868
         BALR  @14,@15                                             1868
*       CCLR1=NCSPLRPH;   /*RESTORE RPH*/                          1869
*                                                                  1869
         L     CCLR1,NCSPLRPH(,CCLNCSPL)                           1869
*        DO;                                                       1870
*/***  CRRMAINT  PROCNM(ISTINCCL)FUNC(RET)COMP(VY)  ***/           1871
*        DCL CMZK0132 PTR(31) REG(1);                              1871
*        RFY (CMZK0132) RSTD;                                      1872
*        /*** CLEAR AND SET CURRENT PROCEDURE BIT ***/             1873
*CMZK0132->RPHCRR->CRACRR->VYCCRT = '0'B;                          1873
         L     @15,RPHCRR(,CMZK0132)                               1873
         L     @15,CRACRR(,@15)                                    1873
         XC    VYCCRT+1(11,@15),VYCCRT+1(@15)                      1873
         MVI   VYCCRT(@15),B'00000000'                             1873
*CMZK0132->RPHCRR->CRACRR->CINCCL = '1'B;                          1874
         OI    CINCCL(@15),B'10000000'                             1874
*        END;     /*@DM09460*/                                     1875
*       CCLLCK = OFF;     /* (ISTINCIO RELEASES DAF LOCK)    @X50BHEM*/
         NI    CCLLCK,B'10111111'                                  1876
*       END;                                                       1877
*RFY WKPT1 UNRSTD;                                                 1878
@RT01858 DS    0H                                                  1879
*CCLR14=CCLSAV10;                                                  1879
         L     CCLR14,CCLSAV10                                     1879
*END CCLCIO;                                                       1880
@EL00013 DS    0H                                                  1880
@EF00013 DS    0H                                                  1880
@ER00013 BR    @14                                                 1880
*CCLNTFU: PROC OPTIONS(NOSAVE,NOSAVEAREA);                         1881
CCLNTFU  DS    0H                                                  1882
*/********************************************************************/
*/* SETS UP A REQUEST FOR A NOTIFY OPERATION FOR A CLUSTER  CTL OR   */
*/*IF A 370X ALL 3270 CLUSTERS WITHIN THAT NODE AND CALLS CCLPGNT TO */
*/* COMPLETE THE OPERATION                                           */
*/********************************************************************/
*CCLSAV14=CCLR14;              /*SAVE RETURN    @DM09599*/         1882
         ST    CCLR14,CCLSAV14                                     1882
*IF CCLSWN = ON THEN DO; /* NOTIFY USER IF NOT ALREADY DONE  @X50BHEM*/
         TM    CCLSWN,B'00100000'                                  1883
         BNO   @RF01883                                            1883
*  CCLSWN = OFF;         /* INDIC NOTIFY ALREADY DONE        @X50BHEM*/
         NI    CCLSWN,B'11011111'                                  1885
*IF RPRENTRY^=RPRENTRN     /*CLUSTER CTL*/                         1886
*  THEN DO;                                                        1886
         CLI   RPRENTRY(CCLRDT),X'01'                              1886
         BE    @RF01886                                            1886
*       NCSPRMRC=LCPMNEW;  /*MINOR RC=LOST CONTACT*/               1888
         MVI   NCSPRMRC(CCLNCSPL),X'02'                            1888
*       CCLPRG=PRGUO;      /*PURGE USER ONLY*/                     1889
         MVI   CCLPRG,X'02'                                        1889
*       CALL CCLPGNT;     /*DO NOTIFY*/                            1890
         BAL   @14,CCLPGNT                                         1890
*       END;                                                       1891
*  ELSE DO;                 /* LOOK FOR 3270 CLUSTERS*/            1892
         B     @RC01886                                            1892
@RF01886 DS    0H                                                  1893
*       RFY WKPT1 RSTD;                                            1893
*       RFY ISTRPRE BASED(WKPT1);                                  1894
*       CCLLOOP2=ON;        /* INIT LOOP SW*/                      1895
         OI    CCLLOOP2,B'00000010'                                1895
*       WKPT1=NCSPLRPT;                                            1896
         L     @15,NCSPLRPT(,CCLNCSPL)                             1896
         LR    WKPT1,@15                                           1896
*       CCLNTUS=NCSPLRPT;   /*SAVE RDTE*/                          1897
         ST    @15,CCLNTUS                                         1897
*       DO WHILE CCLLOOP2=ON;                                      1898
         B     @DE01898                                            1898
@DL01898 DS    0H                                                  1899
*         IF RPRENTED=ON                                           1899
*           THEN CCLLOOP2=OFF;                                     1899
         TM    RPRENTED(WKPT1),B'00000100'                         1899
         BNO   @RF01899                                            1899
         NI    CCLLOOP2,B'11111101'                                1900
*           ELSE DO;                                               1901
         B     @RC01899                                            1901
@RF01899 DS    0H                                                  1902
*                WKPT1=WKPT1+RPRELEN;  /*NEXT SEG*/                1902
         AH    WKPT1,RPRELEN(,WKPT1)                               1902
*                IF RPRENTRY=RPRENTCL                              1903
*                  THEN DO;   /*3270 CLUSTER*/                     1903
         CLI   RPRENTRY(WKPT1),X'70'                               1903
         BNE   @RF01903                                            1903
*                       NCSPRMRC=LCPMNEW;  /*LOST CONTACT*/        1905
         MVI   NCSPRMRC(CCLNCSPL),X'02'                            1905
*                       NCSPLRPT=WKPT1;                            1906
         ST    WKPT1,NCSPLRPT(,CCLNCSPL)                           1906
*                       CCLPRG=PRGUO;     /*PURGE USER ONLY*/      1907
         MVI   CCLPRG,X'02'                                        1907
*                       CALL CCLPGNT;                              1908
         BAL   @14,CCLPGNT                                         1908
*                       WKPT1=NCSPLRPT;   /*RESTORE WKPT1*/        1909
         L     WKPT1,NCSPLRPT(,CCLNCSPL)                           1909
*                       END;                                       1910
*                  ELSE;                                           1911
@RF01903 DS    0H                                                  1912
*                END;                                              1912
*             END; /*DO WHILE*/                                    1913
@RC01899 DS    0H                                                  1913
@DE01898 TM    CCLLOOP2,B'00000010'                                1913
         BO    @DL01898                                            1913
*        NCSPLRPT=CCLNTUS;    /*RESTORE RDTE*/                     1914
         L     @15,CCLNTUS                                         1914
         ST    @15,NCSPLRPT(,CCLNCSPL)                             1914
*        RFY ISTRPRE BASED(CCLRDT);                                1915
*        RFY WKPT1 UNRSTD;                                         1916
*        END;                                                      1917
*END;                       /* NOTIFY ALREADY DONE           @X50BHEM*/
@RC01886 DS    0H                                                  1919
*CCLR14=CCLSAV14;                /*RESTORE RETURN ADR @DM09599*/   1919
@RF01883 L     CCLR14,CCLSAV14                                     1919
*END CCLNTFU;                                                      1920
@EL00014 DS    0H                                                  1920
@EF00014 DS    0H                                                  1920
@ER00014 BR    @14                                                 1920
*CCLLOCK: PROC OPTIONS(NOSAVE,NOSAVEAREA);                         1921
CCLLOCK  DS    0H                                                  1922
*/********************************************************************/
*/*     INPUT: CCLLCK=ON  GET DAF LOCK                               */
*/*                  =OFF RELEASE LOCK                               */
*/*     OUTPUT:CCLNCB=NCB PTR IF CCLLCK=ON                           */
*/********************************************************************/
*RFY CCLR15 RSTD;                                                  1922
*CCLSAV11=CCLR14;         /*SAVE RETURN REG*/                      1923
         ST    CCLR14,CCLSAV11                                     1923
*SAVETPQR=CIDREG;         /* SAVE R2                         @ZA24523*/
         ST    CIDREG,SAVETPQR                                     1924
*CIDREG=NCSPLCID;         /*CIDCTL INPUT*/                         1925
         L     CIDREG,NCSPLCID(,CCLNCSPL)                          1925
*IF CCLLCK=ON                                                      1926
*  THEN DO;    /*GET DAF LOCK*/                                    1926
*                                                                  1926
         TM    CCLLCK,B'01000000'                                  1926
         BNO   @RF01926                                            1926
*        DO; /* CIDCTL(FIND) LOCK(XCLUSIVE) */                     1928
*                                                                  1928
*        RFY (EMCR2,EMCR3) RSTD;                                   1929
*          GEN SETS(RPHWORK)                                       1930
*        (STM EMCR0,EMCR15,RPHWORK(RPHPTR) SAVE REGS IN RPH);      1930
         STM EMCR0,EMCR15,RPHWORK(RPHPTR) SAVE REGS IN RPH
*          EMCR3 = '00'X; /*CLEAR EXTRA BITS*/                     1931
         SLR   EMCR3,EMCR3                                         1931
*          EMCR3 = '02'X; /*INDICATE EXCLUSIVE LOCK*/              1932
         LA    EMCR3,2                                             1932
*          CALL ATCLCPTR->ATCCDFND->ISTSDCCF; /*PROCESS REQUEST*/  1933
*                                                                  1933
         L     @10,ATCLCPTR                                        1933
         L     @15,ATCCDFND(,@10)                                  1933
         BALR  @14,@15                                             1933
*        RFY (EMCR2,EMCR3) UNRSTD;                                 1934
*        END; /*CIDCTL*/                                           1935
*       RFY CCLR0 RSTD;                                            1936
*       IF CCLR15=CCL0                                             1937
*         THEN CCLNCB=CCLR0;  /*GOT LOCK AND NCB PTR*/             1937
         LTR   CCLR15,CCLR15                                       1937
         BNZ   @RF01937                                            1937
         ST    CCLR0,CCLNCB                                        1938
*         ELSE CCLLCK=OFF;    /*NO LOCK*/                          1939
         B     @RC01937                                            1939
@RF01937 NI    CCLLCK,B'10111111'                                  1939
*       RFY CCLR0 UNRSTD;                                          1940
@RC01937 DS    0H                                                  1941
*       END;                                                       1941
*  ELSE                                                            1942
*        DO; /* CIDCTL(FINISH)  */                                 1942
*                                                                  1942
         B     @RC01926                                            1942
@RF01926 DS    0H                                                  1943
*        RFY (EMCR2,EMCR3) RSTD;                                   1943
*          GEN SETS(RPHWORK)                                       1944
*        (STM EMCR0,EMCR15,RPHWORK(RPHPTR) SAVE REGS IN RPH);      1944
         STM EMCR0,EMCR15,RPHWORK(RPHPTR) SAVE REGS IN RPH
*          EMCR3 = '00'X; /*CLEAR EXTRA BITS*/                     1945
         SLR   EMCR3,EMCR3                                         1945
*          CALL ATCLCPTR->ATCCDFIN->ISTSDCCR; /*PROCESS REQUEST*/  1946
*                                                                  1946
         L     @10,ATCLCPTR                                        1946
         L     @15,ATCCDFIN(,@10)                                  1946
         BALR  @14,@15                                             1946
*        RFY (EMCR2,EMCR3) UNRSTD;                                 1947
*        END; /*CIDCTL*/                                           1948
*CIDREG=SAVETPQR;             /* RESTORE R2                  @ZA24523*/
@RC01926 L     CIDREG,SAVETPQR                                     1949
*CCLR14=CCLSAV11;                                                  1950
         L     CCLR14,CCLSAV11                                     1950
*RFY CCLR15 UNRSTD;                                                1951
*END CCLLOCK;                                                      1952
@EL00015 DS    0H                                                  1952
@EF00015 DS    0H                                                  1952
@ER00015 BR    @14                                                 1952
*CCLWTO: PROC OPTIONS(NOSAVE,NOSAVEAREA);                          1953
CCLWTO   DS    0H                                                  1954
*/********************************************************************/
*/*  MESSAGE WRITER                                                  */
*/*  INPUT: CCLMSGID HAS NUMBER OF DESIRED MSG                       */
*/*         RPRNAME HAS NODENAME                                     */
*/********************************************************************/
*CCLSAV12=CCLR14;                                                  1954
         ST    CCLR14,CCLSAV12                                     1954
*IF CCLMSGID = MSG414I                                     /*@XM08638*/
*  THEN                                                            1955
         CLC   CCLMSGID(4),@CC04618                                1955
         BNE   @RF01955                                            1955
*/*TPMSG MSGID((ADDR(CCLMSGID)))MSG((ADDR(MSG414TX)))OPTIONS(NCSPLSID)P
*AREA(NCSPLWRF)*/                                                  1956
*                                                                  1956
*        DO;                                                       1956
*          DCL REG1141  REG(1)  PTR;                               1957
*          RFY (REG1141) RSTD;                                     1958
*                                                                  1958
*        RFY (EMCR13) RSTD;                                        1959
*          DCL 1 * BASED(REG1141),                                 1960
*              2 CMZID141 PTR(31),                                 1960
*              2 *,                                                1960
*                3 CMZRL141 PTR(8),                                1960
*                3 CMZRA141 PTR(24) BDY(BYTE),                     1960
*              2 CMZEA141 PTR(31),                                 1960
*              2 CMZVP141 PTR(31);                                 1960
*                                                                  1960
*/*XREGSET  PID('PLAREA')PPARM(NCSPLWRF)RREG(,REG1141)*/           1961
*        DO;                                                       1961
*          REG1141=ADDR(NCSPLWRF);       /*SET RREG SYMBOL TO ADDRESS*/
         LA    REG1141,NCSPLWRF(,CCLNCSPL)                         1962
*                                        /*OF PPARM OPERAND          */
*        END;  /* XREGSET */                                       1963
*          CMZID141 = 0;                                           1964
         SLR   @15,@15                                             1964
         ST    @15,CMZID141(,REG1141)                              1964
*          CMZRL141 = 0;                                           1965
         MVI   CMZRL141(REG1141),X'00'                             1965
*          CMZRA141 = 0;                                           1966
         STCM  @15,7,CMZRA141(REG1141)                             1966
*          CMZEA141 = 0;                                           1967
         ST    @15,CMZEA141(,REG1141)                              1967
*          CMZVP141 = 0;                                           1968
         ST    @15,CMZVP141(,REG1141)                              1968
*          CMZID141=ADDR(CCLMSGID);                                1969
         LA    @15,CCLMSGID                                        1969
         ST    @15,CMZID141(,REG1141)                              1969
*          CMZVP141 = ADDR(MSG414TX);                              1970
         LA    @15,@CC04628                                        1970
         ST    @15,CMZVP141(,REG1141)                              1970
*          DCL CMZSA141 (18) PTR(31) BASED(EMCR13);                1971
*          CMZSA141(5) = ADDR(NCSPLSID);                           1972
*                                                                  1972
         LA    @15,NCSPLSID(,CCLNCSPL)                             1972
         ST    @15,CMZSA141+16(,EMCR13)                            1972
*          DCL REG15141 REG(15) PTR;                               1973
*          RFY REG15141 RSTD;                                      1974
*                                                                  1974
*        DO; /* LISATCVT CVTBASE(PAGEABLE,(REG15141)) */           1975
*          REG15141 = ATCLCPTR; /*SET UP ATCVT POINTER*/           1976
         L     REG15141,ATCLCPTR                                   1976
*        END; /*LISATCVT*/                                         1977
*          DCL CMTA141 BASED(REG15141) ENTRY VALUERANGE(*);        1978
*          REG15141 = REG15141->ATCMSGP;                           1979
         L     REG15141,ATCMSGP(,REG15141)                         1979
*          CALL CMTA141;                                           1980
         BALR  @14,@15                                             1980
*          RESPECIFY (REG1141,REG15141)  UNRESTRICTED;             1981
*                                                                  1981
*        RFY (EMCR13) UNRSTD;                                      1982
*        END;/*@DM04897,@XM08638*/                                 1983
*  ELSE                                                            1984
*/*TPMSG MSGID((ADDR(CCLMSGID)))MSG((ADDR(RPRNAME)))OPTIONS(NCSPLSID)PL
*REA(NCSPLWRF)*/                                                   1984
*                                                                  1984
*        DO;                                                       1984
         B     @RC01955                                            1984
@RF01955 DS    0H                                                  1985
*          DCL REG1150  REG(1)  PTR;                               1985
*          RFY (REG1150) RSTD;                                     1986
*                                                                  1986
*        RFY (EMCR13) RSTD;                                        1987
*          DCL 1 * BASED(REG1150),                                 1988
*              2 CMZID150 PTR(31),                                 1988
*              2 *,                                                1988
*                3 CMZRL150 PTR(8),                                1988
*                3 CMZRA150 PTR(24) BDY(BYTE),                     1988
*              2 CMZEA150 PTR(31),                                 1988
*              2 CMZVP150 PTR(31);                                 1988
*                                                                  1988
*/*XREGSET  PID('PLAREA')PPARM(NCSPLWRF)RREG(,REG1150)*/           1989
*        DO;                                                       1989
*          REG1150=ADDR(NCSPLWRF);       /*SET RREG SYMBOL TO ADDRESS*/
         LA    REG1150,NCSPLWRF(,CCLNCSPL)                         1990
*                                        /*OF PPARM OPERAND          */
*        END;  /* XREGSET */                                       1991
*          CMZID150 = 0;                                           1992
         SLR   @15,@15                                             1992
         ST    @15,CMZID150(,REG1150)                              1992
*          CMZRL150 = 0;                                           1993
         MVI   CMZRL150(REG1150),X'00'                             1993
*          CMZRA150 = 0;                                           1994
         STCM  @15,7,CMZRA150(REG1150)                             1994
*          CMZEA150 = 0;                                           1995
         ST    @15,CMZEA150(,REG1150)                              1995
*          CMZVP150 = 0;                                           1996
         ST    @15,CMZVP150(,REG1150)                              1996
*          CMZID150=ADDR(CCLMSGID);                                1997
         LA    @15,CCLMSGID                                        1997
         ST    @15,CMZID150(,REG1150)                              1997
*          CMZVP150 = ADDR(RPRNAME);                               1998
         ST    CCLRDT,CMZVP150(,REG1150)                           1998
*          DCL CMZSA150 (18) PTR(31) BASED(EMCR13);                1999
*          CMZSA150(5) = ADDR(NCSPLSID);                           2000
*                                                                  2000
         LA    @15,NCSPLSID(,CCLNCSPL)                             2000
         ST    @15,CMZSA150+16(,EMCR13)                            2000
*          DCL REG15150 REG(15) PTR;                               2001
*          RFY REG15150 RSTD;                                      2002
*                                                                  2002
*        DO; /* LISATCVT CVTBASE(PAGEABLE,(REG15150)) */           2003
*          REG15150 = ATCLCPTR; /*SET UP ATCVT POINTER*/           2004
         L     REG15150,ATCLCPTR                                   2004
*        END; /*LISATCVT*/                                         2005
*          DCL CMTA150 BASED(REG15150) ENTRY VALUERANGE(*);        2006
*          REG15150 = REG15150->ATCMSGP;                           2007
         L     REG15150,ATCMSGP(,REG15150)                         2007
*          CALL CMTA150;                                           2008
         BALR  @14,@15                                             2008
*          RESPECIFY (REG1150,REG15150)  UNRESTRICTED;             2009
*                                                                  2009
*        RFY (EMCR13) UNRSTD;                                      2010
*        END;/*         @DM04897*/                                 2011
*CCLR1=NCSPLRPH;     /*RESTORE RPH*/                               2012
@RC01955 L     CCLR1,NCSPLRPH(,CCLNCSPL)                           2012
*CCLR14=CCLSAV12;                                                  2013
         L     CCLR14,CCLSAV12                                     2013
*END CCLWTO;                                                       2014
@EL00016 DS    0H                                                  2014
@EF00016 DS    0H                                                  2014
@ER00016 BR    @14                                                 2014
@PB00016 DS    0H                                                  2015
* /*SEGMENT(CCLCNFS)START*/DO;GOTO CCLCNFS@;CCLCNFS:END;           2015
         B     CCLCNFS@                                            2016
CCLCNFS  DS    0H                                                  2018
*/*******************************************************************/
*/* SET NCB AND FMC CONF FLAGS (SICK FLAGS) FOR EVERY OPEN SEGMENT  */
*/* WITHIN THE SCOPE OF THE FAILING NODE                           */
*/*******************************************************************/
*RFY (ISTRPRE,ISTRIN)BASED(WKPT1);                                 2018
*RFY ISTFMCB BASED(WKPT3);                                         2019
*RFY (WKPT1,WKPT2,WKPT3) RSTD;                                     2020
*IF NCSPLMOM=ON     /*NCB-FMCCONF WERE SET WHEN MOM FAILED*/       2021
*  THEN;                                                           2021
         TM    NCSPLMOM(CCLNCSPL),B'10000000'                      2021
         BO    @RT02021                                            2021
*  ELSE DO;   /*SET SICK FLAGS*/                                   2023
*       WKPT1=CCLRDT;    /*NCSPLRPT*/                              2024
         LR    WKPT1,CCLRDT                                        2024
*       WKPT2=CCL0;      /*CLEAR WKPT2*/                           2025
         SLR   WKPT2,WKPT2                                         2025
*       CCLENT=RPRENTRY; /*TYPE OF FAILING NODE*/                  2026
         MVC   CCLENT(1),RPRENTRY(WKPT1)                           2026
*       CCLLOOP=ON;                                                2027
         OI    CCLLOOP,B'00000100'                                 2027
*       DO WHILE CCLLOOP=ON;                                       2028
         B     @DE02028                                            2028
@DL02028 DS    0H                                                  2029
*         NCSPLCID=SAF0+RPRDAF;   /*INPUT FOR CIDCTL*/             2029
         LH    @15,RPRDAF(,WKPT1)                                  2029
         N     @15,@CF05852                                        2029
         ST    @15,NCSPLCID(,CCLNCSPL)                             2029
*         CCLLCK=ON;                                               2030
         OI    CCLLCK,B'01000000'                                  2030
*         CALL CCLLOCK;         /* GET LOCK AND NCB PTR*/          2031
         BAL   @14,CCLLOCK                                         2031
*         IF CCLLCK=OFF THEN;   /* THIS SEG NOT OPEN*/             2032
         TM    CCLLCK,B'01000000'                                  2032
         BZ    @RT02032                                            2032
*           ELSE DO;           /* SET SICK FLAGS*/                 2034
*         RFY (ISTDEVCH) BASED (ADDR(RPRDEVCH)); /*@XM07567 @XM07997 */
*         IF (RPRENTRY=RPRENTTR & DEVSUBND=OFF) × /*        @XM07997 */
*            RPRENTRY=RPRENTLU ×  /* PREVENT AUTOLOGONS FOR @XM07997 */
*            RPRENTRY=RPRENTCM ×  /* TR,CM,UTERM, & LU UNTIL@XM07997 */
*            RPRENTRY=RPRENTUT    /* SECOND NOTIFY          @XM07997 */
*           THEN RPRLIVE = OFF;   /*               @XM07567,@XM07997 */
         CLI   RPRENTRY(WKPT1),X'80'                               2036
         BNE   @GL00046                                            2036
         TM    DEVSUBND+44(WKPT1),B'00010000'                      2036
         BZ    @RT02036                                            2036
@GL00046 CLI   RPRENTRY(WKPT1),X'81'                               2036
         BE    @RT02036                                            2036
         CLI   RPRENTRY(WKPT1),X'90'                               2036
         BE    @RT02036                                            2036
         CLI   RPRENTRY(WKPT1),X'75'                               2036
         BNE   @RF02036                                            2036
@RT02036 DS    0H                                                  2037
         NI    RPRLIVE(WKPT1),B'11111110'                          2037
*           ELSE;                 /*               @XM07567,@XM07997 */
@RF02036 DS    0H                                                  2039
*                NCBCONF=ON;                                       2039
         L     @15,CCLNCB                                          2039
         OI    NCBCONF(@15),B'01000000'                            2039
*                WKPT3=NCBFMCBA;                                   2040
         L     WKPT3,NCBFMCBA(,@15)                                2040
*                DO WHILE WKPT3^=CCL0;  /*FIND ALL FMCBS ON NCB CHAIN*/
         B     @DE02041                                            2041
@DL02041 DS    0H                                                  2042
*                  FMCCONF=ON; /*SET SICK FLAG*/                   2042
         OI    FMCCONF(WKPT3),B'00000001'                          2042
*                  WKPT3=FMCFMCBA; /*NEXT*/                        2043
         L     WKPT3,FMCFMCBA(,WKPT3)                              2043
*                  END;                                            2044
@DE02041 LTR   WKPT3,WKPT3                                         2044
         BNZ   @DL02041                                            2044
*                CCLLCK=OFF; /*FREE DAF LOCK*/                     2045
         NI    CCLLCK,B'10111111'                                  2045
*                CALL CCLLOCK;                                     2046
         BAL   @14,CCLLOCK                                         2046
*                END;                                              2047
*         CCLLOOP2=ON;                                             2048
@RT02032 DS    0H                                                  2049
*         CCLSWW=OFF;                                              2049
         OI    CCLLOOP2,B'00000010'                                2049
         NI    CCLSWW,B'11101111'                                  2049
*         DO WHILE CCLLOOP2=ON;  /*GET NEXT SEG*/                  2050
         B     @DE02050                                            2050
@DL02050 DS    0H                                                  2051
*           IF CCLSWW=ON /*SWW SET IF LAST SEG OR OUT OF SCOPE*/   2051
*             THEN DO;                                             2051
         TM    CCLSWW,B'00010000'                                  2051
         BNO   @RF02051                                            2051
*                  IF WKPT2=CCL0                                   2053
*                    THEN DO;                                      2053
         LTR   WKPT2,WKPT2                                         2053
         BNZ   @RF02053                                            2053
*                         CCLLOOP=OFF;  /*FINISHED*/               2055
*                         CCLLOOP2=OFF;                            2056
         NI    CCLLOOP,B'11111001'                                 2056
*                         END;                                     2057
*                    ELSE DO; /*A REMOTE RN WAS FOUND AND PROCESSED*/
         B     @RC02053                                            2058
@RF02053 DS    0H                                                  2059
*                             /* NOW CONTINUE WITH ORIGINAL NODE*/ 2059
*                         WKPT1=WKPT2; /*RM RN TERM ENTRY */       2059
         LR    WKPT1,WKPT2                                         2059
*                         WKPT2=CCL0; /*CLEAR WKPT2*/              2060
         SLR   WKPT2,WKPT2                                         2060
*                         CCLSWW=OFF;                              2061
         NI    CCLSWW,B'11101111'                                  2061
*                         END;                                     2062
*                  END;                                            2063
*             ELSE DO;                                             2064
         B     @RC02051                                            2064
@RF02051 DS    0H                                                  2065
*                  IF RPRENTED =ON                                 2065
*                    THEN CCLSWW=ON;/*END OF SEG*/                 2065
         TM    RPRENTED(WKPT1),B'00000100'                         2065
         BNO   @RF02065                                            2065
         OI    CCLSWW,B'00010000'                                  2066
*                    ELSE DO;                                      2067
         B     @RC02065                                            2067
@RF02065 DS    0H                                                  2068
*                         WKPT1=WKPT1+RPRELEN; /*NEXT SEG*/        2068
         AH    WKPT1,RPRELEN(,WKPT1)                               2068
*                         IF RPRENTRY<=CCLENT                      2069
*                           THEN CCLSWW=ON; /*OUT OF SCOPE OF NODE*/
         CLC   RPRENTRY(1,WKPT1),CCLENT                            2069
         BH    @RF02069                                            2069
         OI    CCLSWW,B'00010000'                                  2070
*                           ELSE IF RPRENTRY=RPRENTIN              2071
*                                  THEN  IF RPRINV=OFF             2071
         B     @RC02069                                            2071
@RF02069 CLI   RPRENTRY(WKPT1),X'82'                               2071
         BNE   @RF02071                                            2071
*                                          &  RINREMOT^=CCL0       2072
*                                         THEN DO; /*REMOTE RN*/   2072
         TM    RPRINV(WKPT1),B'01000000'                           2072
         BNZ   @RF02072                                            2072
         L     @15,RINREMOT(,WKPT1)                                2072
         LTR   @15,@15                                             2072
         BZ    @RF02072                                            2072
*                                              WKPT2=WKPT1;/*SAVE*/
         LR    WKPT2,WKPT1                                         2074
*                                              WKPT1=RINREMOT;     2075
         LR    WKPT1,@15                                           2075
*                                              CCLLOOP2=OFF;       2076
         NI    CCLLOOP2,B'11111101'                                2076
*                                              END;                2077
*                                         ELSE;                    2078
@RF02072 DS    0H                                                  2079
*                                  ELSE CCLLOOP2=OFF;              2079
         B     @RC02071                                            2079
@RF02071 NI    CCLLOOP2,B'11111101'                                2079
*                         END;                                     2080
@RC02071 DS    0H                                                  2080
@RC02069 DS    0H                                                  2081
*                  END;                                            2081
@RC02065 DS    0H                                                  2082
*         END; /*LOOP2 DOWHILE*/                                   2082
@RC02051 DS    0H                                                  2082
@DE02050 TM    CCLLOOP2,B'00000010'                                2082
         BO    @DL02050                                            2082
*       END; /*LOOP DOWHILE*/                                      2083
@DE02028 TM    CCLLOOP,B'00000100'                                 2083
         BO    @DL02028                                            2083
*       END;                                                       2084
*RFY ISTRPRE BASED(CCLRDT);                                        2085
@RT02021 DS    0H                                                  2086
*RFY ISTRIN BASED(RRNTRENT);                                       2086
*RFY (WKPT1,WKPT2,WKPT3) UNRSTD;                                   2087
* /*SEGMENT(CCLCNFS)FINISH*/DO;GOTO CCLCNFS#;CCLCNFS@:END;         2088
         B     CCLCNFS#                                            2089
*CCLCNFC: PROC OPTIONS(NOSAVE,NOSAVEAREA);                         2091
         B     @PB00017                                            2091
CCLCNFC  DS    0H                                                  2092
*/*******************************************************************/
*/*  CLEAR SICK FLAGS: NCB-FMC CONF                                 */
*/*******************************************************************/
*RFY (WKPT1,WKPT2) RSTD;                                           2092
*RFY (ISTRPRE,ISTRLN) BASED(WKPT1);                                2093
*RFY ISTFMCB BASED(WKPT2);                                         2094
*CCLSAV13=CCLR14; /*SAVE RETURN*/                                  2095
         ST    CCLR14,CCLSAV13                                     2095
*CCLCID=NCSPLCID;    /*SAVE CID*/                                  2096
         MVC   CCLCID(4),NCSPLCID(CCLNCSPL)                        2096
*CCLRPT=NCSPLRPT;   /*SAVE RDTE                              @D31KKDQ*/
         L     @15,NCSPLRPT(,CCLNCSPL)                             2097
         ST    @15,CCLRPT                                          2097
*WKPT1=NCSPLRPT;    /*NCSPLRPT*/                                   2098
         LR    WKPT1,@15                                           2098
*CCLENT=RPRENTRY;  /* ENTRY TYPE OF FAILING NODE*/                 2099
         MVC   CCLENT(1),RPRENTRY(WKPT1)                           2099
*CCLLOOP=ON;                                                       2100
         OI    CCLLOOP,B'00000100'                                 2100
*DO WHILE CCLLOOP=ON;                                              2101
         B     @DE02101                                            2101
@DL02101 DS    0H                                                  2102
*  NCSPLDAF=RPRDAF;  /*CIDCTL INPUT*/                              2102
         MVC   NCSPLDAF(2,CCLNCSPL),RPRDAF(WKPT1)                  2102
*  CCLLCK=ON;  /*GET DAF LOCK*/                                    2103
         OI    CCLLCK,B'01000000'                                  2103
*  CALL CCLLOCK;                                                   2104
         BAL   @14,CCLLOCK                                         2104
*  IF CCLLCK=OFF                                                   2105
*    THEN;  /*NO LOCK-NO OPEN SEG*/                                2105
         TM    CCLLCK,B'01000000'                                  2105
         BZ    @RT02105                                            2105
*    ELSE DO; /*PROCESS*/                                          2107
*        NCBCONF=OFF; /*NCB SICK FLAG OFF*/                        2108
         L     @15,CCLNCB                                          2108
         NI    NCBCONF(@15),B'10111111'                            2108
*        IF (RPRNSNEA^=CCL0            /* IF NSNEA EXISTS    @X50BHEM*/
*          & RPRNSNEA->RPRENTRY=RPRENTLN /* AND IT IS A LINE @D31KKDQ*/
*          & RPRNSNEA->RLNPORT=ON)     /* WHICH IS A PORT    @XM10276*/
*          THEN DO;           /*YES THEN THIS IS A DIAL TERM @D31KKDQ*/
         L     @10,RPRNSNEA(,WKPT1)                                2109
         LTR   @10,@10                                             2109
         BZ    @RF02109                                            2109
         CLI   RPRENTRY(@10),X'50'                                 2109
         BNE   @RF02109                                            2109
         TM    RLNPORT(@10),B'00010000'                            2109
         BNO   @RF02109                                            2109
*              WKPT2=NCBFMCBA; /*FIRST FMCB                  @D31KKDQ*/
         L     WKPT2,NCBFMCBA(,@15)                                2111
*              DO WHILE WKPT2^=CCL0;/*CLEAR FMCCONF IN PSOLS FMCB*/
         B     @DE02112                                            2112
@DL02112 DS    0H                                                  2113
*                IF FMCMODE=FMPSOL                         /*@D31KKDQ*/
*                  THEN FMCCONF=OFF;                       /*@D31KKDQ*/
         CLC   FMCMODE(8,WKPT2),@CC03459                           2113
         BNE   @RF02113                                            2113
         NI    FMCCONF(WKPT2),B'11111110'                          2114
*                  ELSE;                                   /*@D31KKDQ*/
@RF02113 DS    0H                                                  2116
*                WKPT2=FMCFMCBA;     /*NEXT                  @D31KKDQ*/
         L     WKPT2,FMCFMCBA(,WKPT2)                              2116
*                END;                                      /*@D31KKDQ*/
@DE02112 LTR   WKPT2,WKPT2                                         2117
         BNZ   @DL02112                                            2117
*              END;                                        /*@D31KKDQ*/
*          ELSE DO;         /*NOT DIAL                       @D31KKDQ*/
         B     @RC02109                                            2119
@RF02109 DS    0H                                                  2120
*              WKPT2=NCBFMCBA; /*CLEAR CONF IN NON RECORD FMCBS*/  2120
         L     @15,CCLNCB                                          2120
         L     WKPT2,NCBFMCBA(,@15)                                2120
*              DO WHILE WKPT2^=CCL0;                       /*@D31KKDQ*/
         B     @DE02121                                            2121
@DL02121 DS    0H                                                  2122
*                IF FMCMODE^=RECORD                        /*@D31KKDQ*/
*                  THEN FMCCONF=OFF;  /*CLEAR                @D31KKDQ*/
         CLC   FMCMODE(8,WKPT2),@CC03457                           2122
         BE    @RF02122                                            2122
         NI    FMCCONF(WKPT2),B'11111110'                          2123
*                  ELSE;                                   /*@D31KKDQ*/
@RF02122 DS    0H                                                  2125
*                WKPT2=FMCFMCBA;        /*NEXT               @D31KKDQ*/
         L     WKPT2,FMCFMCBA(,WKPT2)                              2125
*                END;                                      /*@D31KKDQ*/
@DE02121 LTR   WKPT2,WKPT2                                         2126
         BNZ   @DL02121                                            2126
*              END;                                        /*@D31KKDQ*/
*          END;                                                    2128
@RC02109 DS    0H                                                  2129
*        IF RPRENTRY=RPRENTCC                             /* @DM12195*/
*         × RPRENTRY=RPRENTRN    /* FOR CLUSTER OR 370X      @XM09577*/
*         × (RPRENTRY=RPRENTLU   /* OR FOR AN LU             @DA06111*/
*         & NCBFORCE=ON)         /* AND FORCE DEACTIVATE     @DA06111*/
*         THEN                                    /*@DM12195 @DM12456*/
@RT02105 CLI   RPRENTRY(WKPT1),X'71'                               2129
         BE    @RT02129                                            2129
         CLI   RPRENTRY(WKPT1),X'01'                               2129
         BE    @RT02129                                            2129
         CLI   RPRENTRY(WKPT1),X'81'                               2129
         BNE   @RF02129                                            2129
         L     @15,CCLNCB                                          2129
         TM    NCBFORCE(@15),B'00000100'                           2129
         BNO   @RF02129                                            2129
@RT02129 DS    0H                                                  2130
*         DO;                                              /*@DM12456*/
*           IF CCLLCK=ON                                   /*@ZA18443*/
*                  THEN                                    /*@ZA18443*/
         TM    CCLLCK,B'01000000'                                  2131
         BNO   @RF02131                                            2131
*                    DO;                                   /*@ZA18443*/
*          CCLLCK = OFF; /*RELEASE LOCK                      @XM09577*/
         NI    CCLLCK,B'10111111'                                  2133
*          CALL CCLLOCK;                                   /*@DM12456*/
         BAL   @14,CCLLOCK                                         2134
*                    END;                                  /*@ZA18443*/
*         END;                                              /*@DM12456*
*        ELSE DO;             /* SOFT PURGE NON-SNA @DM12195,@X50BHEM*/
         B     @RC02129                                            2137
@RF02129 DS    0H                                                  2138
*          IF RPRONLIN=ON /* ALLOW AUTOLOGONS TO    @XM07949,@XM07997*/
*            THEN RPRLIVE=ON; /* OCCUR              @XM07949,@XM07997*/
         TM    RPRONLIN(WKPT1),B'00001000'                         2138
         BNO   @RF02138                                            2138
         OI    RPRLIVE(WKPT1),B'00000001'                          2139
*            ELSE;             /*                   @XM07949,@XM07997*/
@RF02138 DS    0H                                                  2141
*          CALL CCLCIO;                                            2141
         BAL   @14,CCLCIO                                          2141
*        END;                                                      2142
*  CCLLOOP2=ON;                                                    2143
@RC02129 OI    CCLLOOP2,B'00000010'                                2143
*  DO WHILE CCLLOOP2=ON;/*LOOK AT EACH SEG IN NODE*/               2144
         B     @DE02144                                            2144
@DL02144 DS    0H                                                  2145
*    IF RPRENTED=ON                                                2145
*      THEN DO;    /*LAST SEG*/                                    2145
         TM    RPRENTED(WKPT1),B'00000100'                         2145
         BNO   @RF02145                                            2145
*           CCLLOOP=OFF;                                           2147
*           CCLLOOP2=OFF;                                          2148
         NI    CCLLOOP,B'11111001'                                 2148
*           END;                                                   2149
*      ELSE DO;                                                    2150
         B     @RC02145                                            2150
@RF02145 DS    0H                                                  2151
*           WKPT1=WKPT1+RPRELEN;  /*NEXT SEG*/                     2151
         AH    WKPT1,RPRELEN(,WKPT1)                               2151
*           IF RPRENTRY<=CCLENT  /*OUT OF SCOPE OF NODE*/          2152
*             THEN DO;  /*FINISHED*/                               2152
         CLC   RPRENTRY(1,WKPT1),CCLENT                            2152
         BH    @RF02152                                            2152
*                  CCLLOOP=OFF;                                    2154
*                  CCLLOOP2=OFF;                                   2155
         NI    CCLLOOP,B'11111001'                                 2155
*                  END;                                            2156
*             ELSE DO;                                             2157
         B     @RC02152                                            2157
@RF02152 DS    0H                                                  2158
*                 IF CCLRPT->RPRENTRY=RPRENTRN  /*           @XM09577*/
*                   &( RPRENTRY=RPRENTCC  /*CLUSTER CTL      @XM09577*/
*                   × RPRENTRY=RPRENTLU /*LOG UNIT*/               2158
*                   × RPRENTRY=RPRENTIN)  /*REM RN           @XM09577*/
*                   THEN;   /*GET NEXT SEG*/                       2158
         L     @15,CCLRPT                                          2158
         CLI   RPRENTRY(@15),X'01'                                 2158
         BNE   @RF02158                                            2158
         CLI   RPRENTRY(WKPT1),X'71'                               2158
         BE    @RT02158                                            2158
         CLI   RPRENTRY(WKPT1),X'81'                               2158
         BE    @RT02158                                            2158
         CLI   RPRENTRY(WKPT1),X'82'                               2158
         BE    @RT02158                                            2158
*                   ELSE CCLLOOP2=OFF; /*PROCESS THIS RDTE*/       2160
@RF02158 NI    CCLLOOP2,B'11111101'                                2160
*                  END;                                            2161
@RT02158 DS    0H                                                  2162
*           END;                                                   2162
@RC02152 DS    0H                                                  2163
*      END; /*LOOP2 DO WHILE*/                                     2163
@RC02145 DS    0H                                                  2163
@DE02144 TM    CCLLOOP2,B'00000010'                                2163
         BO    @DL02144                                            2163
*   END; /*LOOP DOWHILE*/                                          2164
@DE02101 TM    CCLLOOP,B'00000100'                                 2164
         BO    @DL02101                                            2164
*RFY (WKPT1,WKPT2) UNRSTD;                                         2165
*RFY ISTRPRE BASED(CCLRDT);                                        2166
*NCSPLCID=CCLCID;   /*RESTORE CID*/                                2167
         MVC   NCSPLCID(4,CCLNCSPL),CCLCID                         2167
*NCSPLRPT=CCLRPT;  /*RESTORE                                 @D31KKDQ*/
         L     @15,CCLRPT                                          2168
         ST    @15,NCSPLRPT(,CCLNCSPL)                             2168
*NCSPLRAD=CCLRDT;             /*RESTORE-CLOBBERED BY CCLCIO  @D31KKDQ*/
         ST    CCLRDT,NCSPLRAD(,CCLNCSPL)                          2169
*CCLR14=CCLSAV13;                                                  2170
         L     CCLR14,CCLSAV13                                     2170
*END CCLCNFC;                                                      2171
@EL00017 DS    0H                                                  2171
@EF00017 DS    0H                                                  2171
@ER00017 BR    @14                                                 2171
@PB00017 DS    0H                                                  2172
* /*SEGMENT(CCLTTEP)START*/DO;GOTO CCLTTEP@;CCLTTEP:END;           2172
         B     CCLTTEP@                                            2173
CCLTTEP  DS    0H                                                  2175
*/********************************************************************/
*/*   IF A DEVICE WITHIN THE SUCCESSFULLY RECOVERED 370X IS IN TEST */
*/*  MODE THIS ROUTINE NOTIFIES TOLTEP OF SUCCESSFUL RESTART BY      */
*/*  TPQUEING A TIE TO THE ATCTCIPB PAB                              */
*/********************************************************************/
*RFY ISTRPRE BASED(WKPT1);                                         2175
*RFY ISTTIE  BASED(WKPT2);                                         2176
*RFY (WKPT1,WKPT2) RSTD;                                           2177
*WKPT1=NCSPLRPT;    /*370X RDTE*/                                  2178
         L     WKPT1,NCSPLRPT(,CCLNCSPL)                           2178
*CCLDAF=NCSPLDAF;   /*SAVE*/                                       2179
         MVC   CCLDAF(2),NCSPLDAF(CCLNCSPL)                        2179
*CCLLOOP=ON;                                                       2180
         OI    CCLLOOP,B'00000100'                                 2180
*DO WHILE CCLLOOP=ON;/*LOOP THROUGH NODE*/                         2181
         B     @DE02181                                            2181
@DL02181 DS    0H                                                  2182
*  IF RPRINTST=OFF                                                 2182
*    THEN;                                                         2182
         TM    RPRINTST(WKPT1),B'00000001'                         2182
         BZ    @RT02182                                            2182
*    ELSE DO;        /*IN TEST MODE*/                              2184
*         NCSPLWEL=NCSPLRPH;  /*RPH*/                              2185
         L     @15,NCSPLRPH(,CCLNCSPL)                             2185
         ST    @15,NCSPLWEL(,CCLNCSPL)                             2185
*         NCSPLRID=RPRNAME;   /*NODE NAME*/                        2186
         MVC   NCSPLRID(8,CCLNCSPL),RPRNAME(WKPT1)                 2186
*         NCSPLDAF=RPRDAF;    /*NODE DAF*/                         2187
         MVC   NCSPLDAF(2,CCLNCSPL),RPRDAF(WKPT1)                  2187
*         WKPT2=WKANEXT;      /* GET TIE AREA*/                    2188
         L     @15,NCSPLWKA(,CCLNCSPL)                             2188
         L     @10,WKANEXT(,@15)                                   2188
         LR    WKPT2,@10                                           2188
*         WKANEXT=WKANEXT+LENGTH(ISTTIE); /*UPDATE NXT AVAIL*/     2189
         AL    @10,@CF00802                                        2189
         ST    @10,WKANEXT(,@15)                                   2189
*         ISTTIE=ISTTIE&&ISTTIE; /*CLEAR TIE*/                     2190
         XC    ISTTIE(16,WKPT2),ISTTIE(WKPT2)                      2190
*         TIETYPE=TITYPE;        /*TYPE CODE*/                     2191
         MVI   TIETYPE(WKPT2),X'18'                                2191
*         TIELNGTH=LENGTH(ISTTIE);                                 2192
         MVI   TIELNGTH(WKPT2),X'10'                               2192
*         TIEREQ=TIEREQ2;        /*INDICATES NCSPL*/               2193
         MVI   TIEREQ(WKPT2),X'02'                                 2193
*         TIEPTR1=CCLNCSPL;      /*NCSPL*/                         2194
         ST    CCLNCSPL,TIEPTR1(,WKPT2)                            2194
*                                /*TPQUE TO TOLTEP PAB*/           2195
*         RFY ISTDYPAB BASED(ADDR(ATCTCIPB));                      2195
*                                                                  2195
*/*  TPQUE (WKPT2,DYPPAB) NORM */                                  2196
*                                                                  2196
*          DO;                                                     2196
*          RFY (GPR00P,GPR01P,GPR04P,GPR05P,GPR15P) RSTD;          2197
*          GEN REFS(GPR01P) SETS(RPHWORK)                          2198
*        (STM GPR02P,GPR08P,RPHWORK(GPR01P));                      2198
         STM GPR02P,GPR08P,RPHWORK(GPR01P)
*          GPR00P=0;                                               2199
         SLR   GPR00P,GPR00P                                       2199
*          GPR15P=ADDR(DYPPAB); /*HOLD PAB PTR*/                   2200
         L     GPR15P,NCSPLCVT(,CCLNCSPL)                          2200
         LA    GPR15P,DYPPAB+624(,GPR15P)                          2200
*          GPR04P=WKPT2; /*WORK ELE PTR*/                          2201
         LR    GPR04P,WKPT2                                        2201
*          GPR05P=GPR15P; /*PASS PAB PTR*/                         2202
         LR    GPR05P,GPR15P                                       2202
*          CALL ATCLCPTR->ATCAP37->ISTAPC37;                       2203
         L     @10,ATCLCPTR                                        2203
         L     @15,ATCAP37(,@10)                                   2203
         BALR  @14,@15                                             2203
*          GEN(NOPR  0)NOSETS NOREFS;                              2204
         NOPR  0
*          RFY (GPR00P,GPR01P,GPR04P,GPR05P,GPR15P) UNRSTD;        2205
*          END; /**** END OF TPQUE GENERATION ****/                2206
*                                                                  2206
*/*  TPWAIT   */                                                   2207
*          DO; /* BEGIN TPWAIT GENERATION*/                        2207
*          RFY (GPR01P,GPR14P,GPR15P) RSTD;                        2208
*          RFY (GPR00P) RSTD;                                      2209
*          GEN (STM   GPR00P,GPR15P,RPHWORK(GPR01P))               2210
*          REFS(GPR00P,GPR01P,GPR15P) SETS(RPHWORK);               2210
         STM   GPR00P,GPR15P,RPHWORK(GPR01P)
*          RFY (GPR00P) UNRSTD;                                    2211
*          GPR15P=ADDR(LHAA0168);                                  2212
         LA    GPR15P,LHAA0168                                     2212
*          GPR14P=0;                                               2213
         SLR   GPR14P,GPR14P                                       2213
*          GPR15P=GPR15P & '00FFFFFF'X;                            2214
         N     GPR15P,@CF04783                                     2214
*          GPR15P=GPR15P × RPHWT1;                                 2215
         O     GPR15P,@CF01354                                     2215
*          CS (GPR14P,GPR15P,GPR01P->RPHRESMA);                    2216
         CS    GPR14P,@15,RPHRESMA(GPR01P)                         2216
*          BC (7,LHAB0168);                                        2217
*                                                                  2217
         BC    7,LHAB0168                                          2217
*/* TPEXIT  NONE */                                                2218
*          DO;                                                     2218
*            RESPECIFY GPR15P RSTD;                                2219
*                                                                  2219
*/* ATBUILD (ISTPAB,ISTDYPAB,ISTATCVT)  */                         2220
*/* END OF ATBUILD */                                              2220
*                                                                  2220
*          DO; /* LISATCVT CVTBASE(PAGEABLE,(GPR15P)) */           2220
*            GPR15P = ATCLCPTR; /*SET UP ATCVT POINTER*/           2221
         L     GPR15P,ATCLCPTR                                     2221
*          END; /*LISATCVT*/                                       2222
*            RESPECIFY GPR00F RSTD;                                2223
*            GPR00F=0;     /*SET PARAMETER REGISTER TO 0*/         2224
         SLR   GPR00F,GPR00F                                       2224
*            GPR15P=GPR15P->ATCAP31;                               2225
         L     GPR15P,ATCAP31(,GPR15P)                             2225
*            DCL FMZL0173 BASED(GPR15P) LABEL VALUERANGE(*);       2226
*            CALL FMZL0173;                                        2227
         BALR  @14,@15                                             2227
*            RESPECIFY (GPR00F,GPR15P) UNRSTD;                     2228
*          END; /***** END OF TPEXIT  *****/                       2229
*LHAB0168:;GPR01P->RPHRESMA = 0;                                   2230
LHAB0168 DS    0H                                                  2231
         SLR   @15,@15                                             2231
         ST    @15,RPHRESMA(,GPR01P)                               2231
*          RFY (GPR00P) RSTD;                                      2232
*LHAA0168:;GEN (LM    GPR00P,GPR15P,RPHWORK(GPR01P))               2233
LHAA0168 DS    0H                                                  2234
*          REFS(RPHWORK,GPR01P) SETS(GPR00P,GPR15P);               2234
         LM    GPR00P,GPR15P,RPHWORK(GPR01P)
*          RFY (GPR00P,GPR01P,GPR14P,GPR15P) UNRSTD;               2235
*          END; /*****END OF TPWAIT *****/                         2236
*         WKANEXT=WKANEXT-LENGTH(ISTTIE);  /*FREE TIE AREA*/       2237
         L     @15,NCSPLWKA(,CCLNCSPL)                             2237
         L     @10,WKANEXT(,@15)                                   2237
         SL    @10,@CF00802                                        2237
         ST    @10,WKANEXT(,@15)                                   2237
*         END;                                                     2238
*  IF RPRENTED=ON      /*END OF NODE*/                             2239
*    THEN CCLLOOP=OFF;                                             2239
@RT02182 TM    RPRENTED(WKPT1),B'00000100'                         2239
         BNO   @RF02239                                            2239
         NI    CCLLOOP,B'11111011'                                 2240
*    ELSE WKPT1=WKPT1+RPRELEN;             /*KEEP LOOKING*/        2241
         B     @RC02239                                            2241
@RF02239 AH    WKPT1,RPRELEN(,WKPT1)                               2241
*  END; /*DO WHILE*/                                               2242
@RC02239 DS    0H                                                  2242
@DE02181 TM    CCLLOOP,B'00000100'                                 2242
         BO    @DL02181                                            2242
*RFY ISTRPRE BASED(CCLRDT);                                        2243
*RFY (WKPT1,WKPT2) UNRSTD;                                         2244
*NCSPLRID=RPRNAME;  /*RESTORE*/                                    2245
         MVC   NCSPLRID(8,CCLNCSPL),RPRNAME(CCLRDT)                2245
*NCSPLDAF=CCLDAF;   /*RESTORE*/                                    2246
         MVC   NCSPLDAF(2,CCLNCSPL),CCLDAF                         2246
* /*SEGMENT(CCLTTEP)FINISH*/DO;GOTO CCLTTEP#;CCLTTEP@:END;         2247
         B     CCLTTEP#                                            2248
CCLTTEP@ DS    0H                                                  2250
* /*SEGMENT(CCLFORC)START*/DO;GOTO CCLFORC@;CCLFORC:END;     /*    2250
*                    @DA06111*/                                    2250
         B     CCLFORC@                                            2251
CCLFORC  DS    0H                                                  2253
*/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * *@DA06111*/
*/*                                                          @DA06111*/
*/* ROUTINE WILL INIT SWITCHES, ISSUE QUIESCE (FOR LOCAL     @DA06111*/
*/* 370X) OR DISCONTACT (FOR PU) FOR FORCED DEACTIVATE       @DA06111*/
*/*                                                          @DA06111*/
*/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * *@DA06111*/
*RFY (WKPT1,WKPT2) RSTD;         /* RESTRICT WORK REGISTERS  @DA06111*/
*WKPT1 = NCSPLRPT;               /* SET UP WORK REG          @DA06111*/
         L     WKPT1,NCSPLRPT(,CCLNCSPL)                           2254
*NCSFORCE = ON;                  /* INDIC FORCE DEACT IN PROG@DA06111*/
         OI    NCSFORCE(CCLNCSPL),B'00100000'                      2255
*IF NCSPLVBF = NCSVRACT          /* IF FORCE REACTIVATE      @DA06111*/
*  THEN NCSPLVBF = NCSEERRA;     /* THEN INDIC SOFT ERP      @DA06111*/
         CLC   NCSPLVBF(2,CCLNCSPL),@CB02113                       2256
         BNE   @RF02256                                            2256
         MVC   NCSPLVBF(2,CCLNCSPL),@CB02052                       2257
*  ELSE;                         /*                          @DA06111*/
@RF02256 DS    0H                                                  2259
*IF RPRENTRY = RPRENTLU          /* IF ERP IS FOR AN LU      @DA06111*/
*  THEN;                         /* THEN SKIP THIS PROCESS   @DA06111*/
         CLI   RPRENTRY(CCLRDT),X'81'                              2259
         BE    @RT02259                                            2259
*  ELSE IF RPRENTRY = RPRENTRN   /* IF ERP IS FOR A 370X     @DA06111*/
*    & RRNRBREM = OFF            /* WHICH IS NOT REMOTE      @DA06111*/
*    THEN DO;                    /* THEN PROCESS LOCAL 370X  @DA06111*/
         CLI   RPRENTRY(CCLRDT),X'01'                              2261
         BNE   @RF02261                                            2261
         TM    RRNRBREM(CCLRDT),B'00000100'                        2261
         BNZ   @RF02261                                            2261
*      NCSPLRIO = ON;            /* DON'T LET QUIESCE HANG   @XM08649*/
         OI    NCSPLRIO(CCLNCSPL),B'00100000'                      2263
*   NCSPLCMD=NCSNCPPG;         /*SCHEDULE A PURGE            @ZA18488*/
         MVC   NCSPLCMD(2,CCLNCSPL),@CB02246                       2264
*   NCSPRMRC=LCPMNSF;          /* SOFT PURGE                 @ZA18488*/
         MVI   NCSPRMRC(CCLNCSPL),X'01'                            2265
*   IF NCSOVFMC=OFF            /*                            @ZA18488*/
*   THEN DO;                   /*                            @ZA18488*/
         TM    NCSOVFMC(CCLNCSPL),B'10000000'                      2266
         BNZ   @RF02266                                            2266
*   NCSOVFMC=ON;               /*                            @ZA18488*/
         OI    NCSOVFMC(CCLNCSPL),B'10000000'                      2268
*   CALL CCLCIO;               /*DO PURGE                    @ZA18488*/
         BAL   @14,CCLCIO                                          2269
*   NCSOVFMC=OFF;              /*RESET 'ONLY VARY' FLAG      @ZA18488*/
         NI    NCSOVFMC(CCLNCSPL),B'01111111'                      2270
*   END;                       /*                            @ZA18488*/
*   ELSE CALL CCLCIO;          /*                            @ZA18488*/
         B     @RC02266                                            2272
@RF02266 BAL   @14,CCLCIO                                          2272
*      NCSPLCMD = NCSCQUIS;      /* INDIC TO DO A QUIESCE    @DA06111*/
@RC02266 MVC   NCSPLCMD(2,CCLNCSPL),@CB02161                       2273
*      CALL CCLCIO;              /* AND CALL ISTINCIO        @DA06111*/
         BAL   @14,CCLCIO                                          2274
*      NCSPLRIO = OFF;           /*                          @XM08649*/
         NI    NCSPLRIO(CCLNCSPL),B'11011111'                      2275
*      END;                      /*                          @DA06111*/
*    ELSE DO;                    /* FOR PU OR REMOTE 370X:   @DA06111*/
         B     @RC02261                                            2277
@RF02261 DS    0H                                                  2278
*      IF NCSPLMOM = OFF         /* THAT IS NOT A SPIN-OFF   @DM04398*/
*        THEN DO;                /*                @XM08987  @DM04398*/
         TM    NCSPLMOM(CCLNCSPL),B'10000000'                      2278
         BNZ   @RF02278                                            2278
*          CALL CLPOSTDQ;        /* POST CONTACT IF NECESSRY @DA06111*/
         BAL   @14,CLPOSTDQ                                        2280
*          IF (RPRENTRY=RPRENTRN &     /* REMOTE RN ?        @DM14962*/
*              RRNRBREM=ON) ×          /*                    @DM14962*/
*             (RPRENTRY=RPRENTCC &     /* LEASED PU ?        @DM14962*/
*              RPRHDTYP^=RPRENTSW) ×   /*                    @DM14962*/
*             (RPRENTRY=RPRENTCC &     /* SWITCHED PU ?      @DM14962*/
*              RPRHDTYP=RPRENTSW &     /*                    @DM14962*/
*              NCSDCONT = ON)          /* DISCONTACT ALLOWED @DM14962*/
*            THEN DO;                  /* THEN SEND DISCONT. @DM14962*/
         CLI   RPRENTRY(CCLRDT),X'01'                              2281
         BNE   @GL00059                                            2281
         TM    RRNRBREM(CCLRDT),B'00000100'                        2281
         BO    @RT02281                                            2281
@GL00059 CLI   RPRENTRY(CCLRDT),X'71'                              2281
         BNE   @GL00058                                            2281
         CLI   RPRHDTYP(CCLRDT),X'04'                              2281
         BNE   @RT02281                                            2281
@GL00058 CLI   RPRENTRY(CCLRDT),X'71'                              2281
         BNE   @RF02281                                            2281
         CLI   RPRHDTYP(CCLRDT),X'04'                              2281
         BNE   @RF02281                                            2281
         TM    NCSDCONT(CCLNCSPL),B'00010000'                      2281
         BNO   @RF02281                                            2281
@RT02281 DS    0H                                                  2282
*              CCLDISC=ON;       /* INDICATE DISCONTACT      @XM08987*/
         OI    CCLDISC,B'00010000'                                 2283
*              CALL CCLCNTC;     /* ISSUE DISCONTACT         @XM08987*/
         BAL   @14,CCLCNTC                                         2284
*              END;              /*                          @DM14962*/
*          END;                  /*                          @XM08987*/
*        ELSE;                   /* DELETION OF DISCONTACT   @DM04400*/
@RF02278 DS    0H                                                  2288
*      END;                      /*                          @DA06111*/
@RC02278 DS    0H                                                  2289
* /*SEGMENT(CCLFORC)FINISH*/DO;GOTO CCLFORC#;CCLFORC@:END;        /*
*                      @DA06111*/                                  2289
@RC02261 DS    0H                                                  2289
@RT02259 DS    0H                                                  2290
         B     CCLFORC#                                            2290
*CLPOSTDQ:PROC OPTIONS(NOSAVE,NOSAVEAREA);/* POST CONTACTS   @DA06111*/
         B     @PB00018                                            2292
CLPOSTDQ DS    0H                                                  2293
*/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * *@DA06111*/
*/*                                                          @DA06111*/
*/* THIS SUBROUTINE DEQUEUES CONTACT AND DISCONTACT NCSPLS   @DA06111*/
*/* FROM THE 370X HEADER VARY PAB AND TPPOSTS THE RPH OF THE @DA06111*/
*/* SUBNODE PROCESS WHICH IS WAITING FOR THE I/O COMPLETION. @DA06111*/
*/* THIS SUBROUTINE IS CALLED TO POST CONTACTS IN TWO INS-   @DA06111*/
*/* TANCES: 1) LOOK AHEAD POSTING OF SUB NODES DURING 370X   @DA06111*/
*/* ERPS (WKPT1 -> PU OR RIN RDTE AND IS ^= CCLRDT). 2) SAME @DA06111*/
*/* NODE POSTING OF FAILING NODE FOR FORCE DEACTIVATE (WKPT1 @DA06111*/
*/* -> PU OR REMOTE 370X RDTE AND IS = CCLRDT - IN THIS CASE @DA06111*/
*/* THE WAITING RPH IS NOT POSTED AT THIS TIME BUT IS SAVED  @DA06111*/
*/* IN FORCERPH FOR LATER POSTING).                          @DA06111*/
*/*                                                          @DA06111*/
*/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * *@DA06111*/
*RFY(WKPT1,WKPT2,WKPT3) RSTD;    /* RESTRICT WORK REGS       @DA06111*/
*CCLSAV16 = CCLR14;              /* SAVE RETURN ADDRESS      @DA06111*/
         ST    CCLR14,CCLSAV16                                     2294
*RFY(ISTRPRE,ISTRCC,ISTRIN) BASED(WKPT1);/* ADDRESS RDTE     @DM04399*/
*IF RPRENTRY = RPRENTRN          /* IF ERP FOR REMOTE 370X:  @DA06111*/
*  THEN WKPT3 = RRNTRENT;        /* THEN GET ADDR RIN RDTE   @DA06111*/
         CLI   RPRENTRY(WKPT1),X'01'                               2296
         BNE   @RF02296                                            2296
         L     WKPT3,RRNTRENT(,CCLRDT)                             2297
*  ELSE WKPT3 = WKPT1;           /* ELSE GET ADDR PU OR RIN  @DA06111*/
         B     @RC02296                                            2298
@RF02296 LR    WKPT3,WKPT1                                         2298
*RFY(ISTRPRE,ISTRCC,ISTRIN) BASED(WKPT3);/* ADDRESS RDTE     @DA06111*/
@RC02296 DS    0H                                                  2300
*IF RPRENTRY = RPRENTCC          /* GET ADDR OF WAITING RPH  @DA06111*/
*  THEN WKPT2 = RCCRPHCN;        /* FROM RCC RDTE FOR SNA PU @DA06111*/
         CLI   RPRENTRY(WKPT3),X'71'                               2300
         BNE   @RF02300                                            2300
         L     WKPT2,RCCRPHCN(,WKPT3)                              2301
*  ELSE IF RPRENTRY = RPRENTIN   /* OR FROM RIN RDT ENTRY    @DA06111*/
*    THEN WKPT2 = RINRPHCN;      /* FOR A REMOTE 370X        @DA06111*/
         B     @RC02300                                            2302
@RF02300 CLI   RPRENTRY(WKPT3),X'82'                               2302
         BNE   @RF02302                                            2302
         L     WKPT2,RINRPHCN(,WKPT3)                              2303
*    ELSE WKPT2 = CCL0;          /* ZERO RPH PTR IF NEITHER  @DA06111*/
         B     @RC02302                                            2304
@RF02302 SLR   WKPT2,WKPT2                                         2304
*IF WKPT2 = CCL0                 /* IF NO WAITING ON CONTACT @DA06111*/
*  THEN;                         /* THEN SKIP REST OF PROC   @DA06111*/
@RC02302 DS    0H                                                  2305
@RC02300 LTR   WKPT2,WKPT2                                         2305
         BZ    @RT02305                                            2305
*  ELSE DO;                      /* ELSE DEQ NCSPL, POST RPH @DA06111*/
*    /* * * * * * * * * * * * * * * * * * * * * * * * * * * *@DA06111*/
*    /*                                                      @DA06111*/
*    /* INDICATE 'FAILED DUE TO ERP' IN ORIGINAL NCSPL,      @DA06111*/
*    /* POS/NEG FME WILL BE IN 'CONTACT' NCSPL.              @DA06111*/
*    /*                                                      @DA06111*/
*    /* * * * * * * * * * * * * * * * * * * * * * * * * * * *@DA06111*/
*    WKPT2->RPHWEA->NCSIORC = NCSNCE;/*             @DM10676,@DA06111*/
         L     @15,RPHWEA(,WKPT2)                                  2308
         MVI   NCSIORC(@15),X'10'                                  2308
*    IF RPRCONP = ON             /* IF WAITING FOR CONTACTED @DA06111*/
*      THEN DO;                  /* THEN TPPOST RPH:         @DA06111*/
         TM    RPRCONP(WKPT3),B'00001000'                          2309
         BNO   @RF02309                                            2309
*        IF WKPT2->RPHWEA->NCSPLVCD^=NCSPLVC3 /* NOT ERP ?   @DM04903*/
*          THEN                               /* NO CONTACT  @DM04903*/
         CLI   NCSPLVCD(@15),X'03'                                 2311
         BE    @RF02311                                            2311
*            WKPT2->RPHWEA->NCSIORC=NCSNC;/*DRIVE CVO DISC.  @DM04903*/
         MVI   NCSIORC(@15),X'04'                                  2312
*          ELSE;                 /*                          @DM04903*/
@RF02311 DS    0H                                                  2314
*        RPRCONP = OFF;          /* CLEAR CONTACT PENDING    @DA06111*/
         NI    RPRCONP(WKPT3),B'11110111'                          2314
*        IF RPRENTRY = RPRENTIN  /* ZERO CONTACT RPH POINTER @DA06111*/
*          THEN RINRPHCN = CCL0; /* IN RIN OF REMOTE 370X    @DA06111*/
         CLI   RPRENTRY(WKPT3),X'82'                               2315
         BNE   @RF02315                                            2315
         SLR   @15,@15                                             2316
         ST    @15,RINRPHCN(,WKPT3)                                2316
*          ELSE RCCRPHCN = CCL0; /* OR IN RCC RDTE OF SNA PU @DA06111*/
         B     @RC02315                                            2317
@RF02315 SLR   @15,@15                                             2317
         ST    @15,RCCRPHCN(,WKPT3)                                2317
*        END;                    /* END CONTACT PENDING      @DA06111*/
*      ELSE DO;                  /* ELSE DEQUE NCSPL IF POSS @DA06111*/
         B     @RC02309                                            2319
@RF02309 DS    0H                                                  2320
*        NCSPLP1 = WKPT3;        /* INIT VPAB PTR VARIABLE   @DA06111*/
         ST    WKPT3,NCSPLP1(,CCLNCSPL)                            2320
*        DO WHILE(NCSPLP1->RPRENTRY^=RPRENTRN);/* FIND THE   @DA06111*/
         B     @DE02321                                            2321
@DL02321 DS    0H                                                  2322
*          NCSPLP1 = NCSPLP1->RPRNSNEA;/* BOUNDARY NODE 370X @DA06111*/
         L     @15,NCSPLP1(,CCLNCSPL)                              2322
         L     @15,RPRNSNEA(,@15)                                  2322
         ST    @15,NCSPLP1(,CCLNCSPL)                              2322
*          END;                  /* HEADER VARY PAB          @DA06111*/
@DE02321 L     @15,NCSPLP1(,CCLNCSPL)                              2323
         CLI   RPRENTRY(@15),X'01'                                 2323
         BNE   @DL02321                                            2323
*        NCSPLP1 = NCSPLP1->RDTVPAB;/* SET TPQUE PAB POINTER @DA06111*/
         L     @15,RDTVPAB(,@15)                                   2324
         ST    @15,NCSPLP1(,CCLNCSPL)                              2324
*        RFY CCLR15 RSTD;        /* RESTRICT TPDEQ RETPTR    @DA06111*/
*                                                                  2325
*/* TPDEQ (WKPT2->RPHWEA->NCSPLSPL,NCSPLP1->DYPPAB) RETPTR(CCLR15) */
*        DO; /* BEGIN TPDEQ CODE GENERATION */                     2326
*        DCL FMZCA186 BIT(32) CONSTANT('80000000'X);               2327
*        DCL FMZCB186 BIT(32) CONSTANT('7FFFFFFF'X);               2328
*        RFY (GPR00P,GPR01P,GPR14P,GPR15P) RSTD;                   2329
*                                                                  2329
*        RFY ISTWKE  ;                                             2330
*        GPR15P=ADDR(NCSPLP1->DYPPAB); /*ADDRESS QUEUE POINTER */  2331
         L     @09,NCSPLP1(,CCLNCSPL)                              2331
         LA    GPR15P,DYPPAB(,@09)                                 2331
*        RFY (GPR02P,GPR03P) RSTD;                                 2332
*        STM(GPR02P,GPR03P,GPR01P->RPHWORK(5:12));                 2333
         STM   GPR02P,GPR03P,RPHWORK+4(GPR01P)                     2333
*        GPR03P=WKPT2->RPHWEA->NCSPLSPL × FMZCA186;                2334
         L     @09,@CF01395                                        2334
         L     @08,RPHWEA(,WKPT2)                                  2334
         L     GPR03P,NCSPLSPL(,@08)                               2334
         OR    GPR03P,@09                                          2334
*        GPR14P=FMZCA186;                                          2335
         LR    GPR14P,@09                                          2335
*        GPR15P=ADDR(GPR15P->PABWEQA);                             2336
*        GPR02P=GPR15P->PABWEQA×FMZCA186;                          2337
         O     @09,PABWEQA(,GPR15P)                                2337
         LR    GPR02P,@09                                          2337
*        DO WHILE(GPR02P^=GPR14P);                                 2338
         B     @DE02338                                            2338
@DL02338 DS    0H                                                  2339
*FMZL2186:;                                                        2339
FMZL2186 DS    0H                                                  2340
*          IF GPR02P=GPR03P                                        2340
*          THEN DO;                                                2340
         CR    GPR02P,GPR03P                                       2340
         BNE   @RF02340                                            2340
*            GPR00P=GPR02P->WKECHAIN;                              2342
         L     GPR00P,WKECHAIN(,GPR02P)                            2342
*            CS(GPR02P,GPR00P,GPR15P->PABWEQA);                    2343
         CS    GPR02P,@00,PABWEQA(GPR15P)                          2343
*            BC(7,FMZL3186);                                       2344
         BC    7,FMZL3186                                          2344
*            GPR14P=GPR02P;                                        2345
         LR    GPR14P,GPR02P                                       2345
*            GPR14P->WKECHAIN=0;                                   2346
         SLR   @09,@09                                             2346
         ST    @09,WKECHAIN(,GPR14P)                               2346
*            END;                                                  2347
*          ELSE DO;                                                2348
         B     @RC02340                                            2348
@RF02340 DS    0H                                                  2349
*            IF (GPR02P->WKECHAIN)=GPR14P                          2349
*            THEN                                                  2349
         L     @09,WKECHAIN(,GPR02P)                               2349
         CR    @09,GPR14P                                          2349
         BE    @RT02349                                            2349
*              GOTO ISTA0186;                                      2350
*            ELSE DO;                                              2351
*              GPR15P=ADDR(GPR02P->WKECHAIN);                      2352
         LA    GPR15P,WKECHAIN(,GPR02P)                            2352
*              GPR02P=GPR02P->WKECHAIN;                            2353
         LR    GPR02P,@09                                          2353
*              GOTO FMZL2186;                                      2354
         B     FMZL2186                                            2354
*              END;                                                2355
*            END;                                                  2356
*FMZL3186:;                                                        2357
@RC02340 DS    0H                                                  2357
FMZL3186 DS    0H                                                  2358
*        END;                                                      2358
@DE02338 CR    GPR02P,GPR14P                                       2358
         BNE   @DL02338                                            2358
*ISTA0186:;                                                        2359
ISTA0186 DS    0H                                                  2360
*        LM (GPR02P,GPR03P,GPR01P->RPHWORK(5:12));                 2360
         LM    GPR02P,GPR03P,RPHWORK+4(GPR01P)                     2360
*        RFY (GPR02P,GPR03P) UNRSTD;                               2361
*        GPR14P=GPR14P&FMZCB186;                                   2362
         N     GPR14P,@CF01393                                     2362
*        CCLR15=GPR14P;                                            2363
         LR    CCLR15,GPR14P                                       2363
*        RFY (GPR00P,GPR01P,GPR14P,GPR15P) UNRSTD;                 2364
*        END; /* END TPDEQ GENERATION */                           2365
*        IF CCLR15 ^= CCL0       /* IF TPDEQ FOUND A NCSPL   @DA06111*/
*          THEN IF RPRENTRY = RPRENTIN /* THEN CLEAR RPH PTR @DA06111*/
         SLR   @09,@09                                             2366
         CR    CCLR15,@09                                          2366
         BE    @RF02366                                            2366
*            THEN RINRPHCN = CCL0;/* IN RIN FOR REMOTE 370X  @DA06111*/
         CLI   RPRENTRY(WKPT3),X'82'                               2367
         BNE   @RF02367                                            2367
         ST    @09,RINRPHCN(,WKPT3)                                2368
*            ELSE RCCRPHCN = CCL0;/* OR RCC RDTE FOR SNA PU  @DA06111*/
         B     @RC02367                                            2369
@RF02367 SLR   @00,@00                                             2369
         ST    @00,RCCRPHCN(,WKPT3)                                2369
*          ELSE WKPT2 = CCL0;    /* ELSE LET CONTACT FLOW    @DA06111*/
         B     @RC02366                                            2370
@RF02366 SLR   WKPT2,WKPT2                                         2370
*        RFY CCLR15 UNRSTD;      /* FREE UP TPDEQ RETPTR     @DA06111*/
@RC02366 DS    0H                                                  2372
*        END;                    /* END NOT CONTACT PENDING  @DA06111*/
*    IF WKPT2 = CCL0             /* IF NO CONTACT RPH        @DA06111*/
*      THEN;                     /* THEN NOTHING TO TPPOST   @DA06111*/
@RC02309 LTR   WKPT2,WKPT2                                         2373
         BZ    @RT02373                                            2373
*      ELSE DO;                  /* ELSE TPPOST THE RPH      @DA06111*/
*        IF WKPT1 = CCLRDT       /* IF FORCE DEACTIVATE      @DA06111*/
*          THEN FORCERPH = WKPT2;/* THEN SAVE RPH ADDRESS    @DA06111*/
         CR    WKPT1,CCLRDT                                        2376
         BNE   @RF02376                                            2376
         ST    WKPT2,FORCERPH                                      2377
*          ELSE                                                    2378
*/*TPPOST  (WKPT2)  */                                             2378
*                DO;                                               2378
         B     @RC02376                                            2378
@RF02376 DS    0H                                                  2379
*                                       /*DECLARE AND RESTRICT REGS*/
*                  RESPECIFY (GPR00F,GPR01F,GPR04F,GPR05F,         2379
*                            GPR06F,GPR14F,GPR15F) RSTD;           2379
*                                       /*0,1,4,5,6,14, AND 15   */
*                                                                  2380
*/* ATBUILD (ISTPAB,ISTDYPAB,ISTRPH)  */                           2380
*/* END OF ATBUILD */                                              2380
*                  GEN REFS(GPR01P,GPR02F,GPR06F)SETS(RPHWORK);    2380
        STM GPR02F,GPR06F,RPHWORK(GPR01P)
*                  GPR04F=WKPT2;        /*LOAD RPH PNTR INTO REG 4*/
         LR    GPR04F,WKPT2                                        2381
*                  RFY GPR03F RSTD;                                2382
*                  GPR03F=0;                                       2383
*                                                                  2383
         SLR   @09,@09                                             2383
         LR    GPR03F,@09                                          2383
*                DO; /*MODESET  SAVEKEY(GPR06F) KEYADDR(GPR03F) WORKREG
*GPR05F)*/         RESPECIFY (GPR02F) RESTRICTED;                  2384
*                  GPR05F = GPR02F; /*SAVE REGISTER 2*/            2386
         LR    GPR05F,GPR02F                                       2386
*                  IPK; /*SAVE CURRENT PSW KEY*/                   2387
         IPK                                                       2387
*                  GPR06F = GPR02F;                                2388
         LR    GPR06F,GPR02F                                       2388
*                  GPR02F = GPR05F; /*RESTORE REGISTER 2*/         2389
         LR    GPR02F,GPR05F                                       2389
*                  SPKA (GPR03F); /*SET PSW KEY*/                  2390
         SPKA  0(GPR03F)                                           2390
*                  RESPECIFY (GPR02F) UNRESTRICTED;                2391
*                END; /*MODESET  SAVEKEY(GPR06F) KEYADDR(GPR03F) WORKRE
*(GPR05F)*/        RFY GPR03F UNRSTD;                              2392
*                  GPR05P=GPR04P->RPHMAJCB+GPR04P->RPHPABOF;       2394
         L     GPR05P,RPHMAJCB-1(,GPR04P)                          2394
         LA    GPR05P,0(,GPR05P)                                   2394
         SLR   @08,@08                                             2394
         IC    @08,RPHPABOF(,GPR04P)                               2394
         ALR   GPR05P,@08                                          2394
*                                       /*LOAD REG 5  WITH ADDR OF*/
*                                       /*MAJOR CONTROL BLOCK PLUS*/
*                                       /*OFFSET OF PAB IN BLOCK  */
*                  GPR14P=0;            /*LOAD 0 INTO REG 14      */
         LR    GPR14P,@09                                          2395
*                  GPR15P='FFFFFFFF'X;  /*LOAD REG 15 WITH DUMMY  */
         SLR   GPR15P,GPR15P                                       2396
         BCTR  GPR15P,0                                            2396
*                                       /*ADDRESS                 */
*                  CS (GPR14P,GPR15P,GPR04P->RPHRESMA);            2397
         CS    GPR14P,@15,RPHRESMA(GPR04P)                         2397
*                                       /*COMPARE RESUME ADDRESS  */
*                                       /*WITH 0 AND,IF EQUAL, PUT*/
*                                       /*DUMMY ADDRESS IN CONTROL*/
*                                       /*BLOCK RESUME ADDRESS    */
*                  BC (8,FMZT0192);     /*IF EQUAL, BYPASS REMAINDER*/
         BC    8,FMZT0192                                          2398
*                                       /*OF EXPANSION              */
*FMZL0192:         IF GPR04P->RPHWT='1'B THEN                      2399
FMZL0192 TM    RPHWT(GPR04P),B'00001000'                           2399
         BNO   @RF02399                                            2399
*                                       /*WT/EXT CONTENTION FLAG ON */
*                  DO;                  /*IN RPH                    */
*                    GPR14P=GPR04P->RPHRESMA×RPHWT1;               2401
         L     GPR14P,RPHRESMA(,GPR04P)                            2401
         O     GPR14P,@CF01354                                     2401
*                                       /*LOAD REG 14 WITH FLAG FIELD*/
*                                       /*AND MAKE CERTAIN WT/EXT    */
*                                       /*CONTENTION FLAG STILL ON   */
*                    GPR15P=GPR14P×RPHPT1;                         2402
         LR    GPR15P,GPR14P                                       2402
         O     GPR15P,@CF01358                                     2402
*                                       /*LOAD REG 15 WITH FLAG FIELD*/
*                                       /*AND TURN POST FLAG ON      */
*                    CS (GPR14P,GPR15P,GPR04P->RPHRESMA);          2403
         CS    GPR14P,@15,RPHRESMA(GPR04P)                         2403
*                                       /*COMPARE REG 14 WITH FLAG */
*                                       /*FIELD--IF WT/EXT BIT ON, */
*                                       /*TURN ON POST FLAG        */
*                    BC (4,FMZL0192);   /*IF WT/EXT BIT WAS OFF, LOOP*/
         BC    4,FMZL0192                                          2404
*                                       /*TO TEST CONTENTION FLAG    */
*                    BC (8,FMZT0192);   /*IF WT/EXT BIT WAS OFF,     */
         BC    8,FMZT0192                                          2405
*                                       /*BRANCH TO BYPASS CODE GEN  */
*                  END;                 /*IF POST FLAG IS ON, FALL*/
*                                       /*THRU BOTTOM OF LOOP     */
*                  ELSE;                /*WT/EXT CONTENTION FLAG OFF*/
@RF02399 DS    0H                                                  2408
*                  IF GPR04P->RPHTSKID=GPR01P->RPHTSKID            2408
*                  THEN DO;                                        2408
         CLC   RPHTSKID(4,GPR04P),RPHTSKID(GPR01P)                 2408
         BNE   @RF02408                                            2408
*                    GPR05P->PABCHNGP=GPR01P->RPHPABQP;            2410
         MVC   PABCHNGP(3,GPR05P),RPHPABQP(GPR01P)                 2410
*                                       /*PUT PAB QUEUE ADDRESS*/  2411
*                                       /*IN SECOND WORD OF PAB     */
*                    GPR01P->RPHPABQP=GPR05P;                      2411
         STCM  GPR05P,7,RPHPABQP(GPR01P)                           2411
*                                       /*PUT PAB ADDRESS (IN MAJOR */
*                                       /*CONTROL BLOCK) IN PAB */ 2412
*                                       /*QUEUE ADRESS IN RPH    */
*                    END;                                          2412
*                  ELSE DO;                                        2413
         B     @RC02408                                            2413
@RF02408 DS    0H                                                  2414
*                    GPR00F=0;          /*SET REG 0 TO INDICATE ENA*/
*                                                                  2414
         SLR   GPR00F,GPR00F                                       2414
*                DO; /* LISATCVT CVTBASE(PAGEABLE,(GPR15P)) */     2415
*                  GPR15P = ATCLCPTR; /*SET UP ATCVT POINTER*/     2416
         L     GPR15P,ATCLCPTR                                     2416
*                END; /*LISATCVT*/      /*PUT POINTER TO ATCVT IN */
*                                       /*  IN REG 15             */
*                    CALL GPR15P->ATCAP32;                         2418
         L     @09,ATCAP32(,GPR15P)                                2418
         LR    @15,@09                                             2418
         BALR  @14,@15                                             2418
*                                       /* CALL ISTAPC32: TPSCHED */
*                    END;                                          2419
*FMZT0192:                                                         2420
*                DO; /*MODESET  KEYADDR(GPR06F) WORKREG(GPR05F)*/  2420
@RC02408 DS    0H                                                  2420
FMZT0192 DS    0H                                                  2421
*                  GPR05F = GPR06F; /*GET KEY FORM SAVE LOCATION*/ 2421
         LR    GPR05F,GPR06F                                       2421
*                  SPKA (GPR05F); /*SET PSW KEY*/                  2422
         SPKA  0(GPR05F)                                           2422
*                END; /*MODESET  KEYADDR(GPR06F) WORKREG(GPR05F)*/ 2423
*                  GEN REFS(GPR04P,                                2424
*                  RPHWORK)                                        2424
*                      SETS(GPR02F,GPR03F,                         2424
*                            GPR04F,GPR05F,GPR06F);                2424
        LM GPR02F,GPR06F,RPHWORK(GPR01P)
*                  RESPECIFY (GPR00F,GPR01F,GPR04F,GPR05F,GPR06F,  2425
*                  GPR14F,GPR15F) UNRSTD;                          2425
*                                       /*UNRESTRICT REGS 0,1,    */
*                                       /*4,5,14, AND 15          */
*                END;  /****END OF TPPOST GENERATION****/  /* ELSE TPPO
*T CONTACT NOW  @DA06111*/                                         2426
*        END;                    /*                          @DA06111*/
@RC02376 DS    0H                                                  2428
*    END;                        /* END RXXRPHCN ^= 0        @DA06111*/
@RT02373 DS    0H                                                  2429
*CCLR14 = CCLSAV16;              /* RESTORE RETURN ADDRESS   @DA06111*/
@RT02305 L     CCLR14,CCLSAV16                                     2429
*END CLPOSTDQ;                   /*                          @DA06111*/
*                                                                  2430
@EL00018 DS    0H                                                  2430
@EF00018 DS    0H                                                  2430
@ER00018 BR    @14                                                 2430
@PB00018 DS    0H                                                  2431
*/* TPEPILOG   */                                                  2431
* GEN (PRINT OFF);                                                 2431
*                                                                  2431
         PRINT OFF
*/* VS1, VS2 TPIOS SAVEAREA FORMAT */                              2432
*DCL  1  ISTZSAVE BDY(WORD) BASED,                                 2432
*        2   ZSAZSVBC PTR(31),         /* SAVEAREA BACK CHAIN        */
*            3   ZSAZSVMS CHAR(1),     /* MODULE TRACE CODE          */
*                4 ZSAZACTV BIT(1),    /* ACTIVE SAVE AREA FLAG      */
*        2   ZSAZSVFC PTR(31),         /* SAVEAREA FORWARD CHAIN     */
*        2   ZSAZSVRR PTR(31),         /* RETURN REGISTER            */
*        2   ZSAZSVVR (6) PTR(31),    /* VARIABLE REGS (7-12) SVEAREA*/
*        2   ZSAZTRAC CHAR(4);        /* EBCDIC NAME OF OWNER        */
*/*                                                                2433
*THE FOLLOWING EQUATES SHOULD READ ''FIXED(8) CONSTANT(LENGTH(X))'',
*WHERE X IS THE NAME OF THE VARIABLE CONTROL BLOCK OR FIELD OF WHICH
*LENGTH IS THE VALUE BEING EQUATED, SHOULD THE PLS COMPILER BE     2433
*BE ABLE TO TAKE IT.                                               2433
*                                                                    */
*DCL ZSAZSVVA FIXED(8) CONSTANT(8);  /* DISPLACEMENT TO VARIABLE REGS*/
*DCL ZSAZSVSZ FIXED(8) CONSTANT(40); /* LENGTH OF ISTZSAVE           */
*/* PREFIX FOR CRR                                                   */
*/*                                                                  */
*/* RELEASE 1 - JUNE 28, 1973                                        */
*/*                                                                  */
*DCL 1 ISTPFCRR BASED BDY(WORD),        /* PREFIX FOR CRR            */
*     2  PFCCRR   CHAR(4),              /* CRR HEADER                */
*        3  PFCCRRID CHAR(1),           /* CRR ID FIELD              */
*           4  CRRID CHAR(1),           /* BASIC CTL LAYER DEFINITION*/
*        3  PFCRSV10 CHAR(1),           /* RESERVED FOR ALIGNMENT    */
*        3  PFCCRRLN CHAR(2),           /* CRR LENGTH                */
*           4  CRRLEN CHAR(2),          /* BASIC CTL LAYER DEF       */
*     2  PFCHDR CHAR(8) BDY(WORD),      /* SAVE AREA FOR OLD CRR FRR */
*        3  PFCCRRO  PTR(31),           /* PTR TO OLD CRR            */
*           4  CRRCHAIN PTR(31),        /* BASIC CTL LAYER DEFINITION
*                                          FOR OLD CRR PTR           */
*        3  PFCFRRO  PTR(31),           /* PTR TO OLD FRR            */
*           4  CRRFRR   PTR(31),        /* BASIC CTL LAYER         2435
*                                          DEFINITION OF OLD FRR PTR */
*     2  PFCFTA BIT(8),                 /* ID OF LAST FUNCTION TRACED*/
*     2  PFCRSV01 CHAR(3);              /* ALIGNMENT                 */
*DCL PFIDPIE BIT(8) CONSTANT('80'X);    /* DOS/VS TPIOS              */
*DCL PFIDORE BIT(8) CONSTANT('81'X);    /* DOS/VS BMS                */
*DCL PFIDAPE BIT(8) CONSTANT('82'X);    /* DOS/VS PSS                */
*DCL PFCIDPSV BIT(8) CONSTANT('38'X); /* COMPONENT ID              2439
*                                          PSS - VS1 AND 2           */
*DCL PFCIDTPV BIT(8) CONSTANT('3C'X); /* COMPONENT ID              2440
*                                          TPIOS VS1 AND 2           */
*DCL PFCIDSME BIT(8) CONSTANT('3D'X); /* COMPONENT ID              2441
*                                          STORAGE MANAGEMENT DOS    */
*DCL PFCIDOC BIT(8) CONSTANT('31'X);    /* COMPONENT ID OPEN/CLOSE   */
*DCL PFCIDPS BIT(8) CONSTANT('32'X);    /* PORT SOLICITOR            */
*DCL PFCIDCS BIT(8) CONSTANT('34'X);    /* CLUSTER SOLICITOR         */
*DCL PFCIDIT BIT(8) CONSTANT('35'X);    /* INIT/TERM                 */
*DCL PFCIDVY BIT(8) CONSTANT('36'X);    /* VARY                      */
*DCL PFCIDNS  BIT(8) CONSTANT('37'X);   /* NET. STAT.SRV.            */
*DCL PFCIDTPE BIT(8) CONSTANT('38'X);   /* COMPONENT ID            2448
*                                          TPIOS - DOS               */
*DCL PFCIDCL BIT(8) CONSTANT('39'X);    /* COMPONENT ID            2449
*                                          CONTROL LAYER             */
*DCL PFCIDPSE BIT(8) CONSTANT('3A'X);   /* COMPONENT ID            2450
*                                          PSS - DOS                 */
*DCL PFCIDSMV BIT(8) CONSTANT('3F'X);   /* COMPONENT ID            2451
*                                          STORAGE MANAGEMENT        */
*DCL PFCIDTIO BIT(8) CONSTANT('40'X);   /* COMPONENT ID TIIO       2452
*                                          PROCESSING (VS2)          */
*DCL PFCIDRS  BIT(8) CONSTANT('41'X);   /* ID FOR REMOTE SOLICITOR   */
*/* CRR FOR COMMAND FACILITIES                                      */
*/*  REVISIONS                                         001 06/02/75 */
*DCL  1  ISTCFCRR BDY(WORD) BASED, /* CRR FOR COMMAND FACILITIES    */
*        2 CFCAUDIT,               /* AUDIT TRAIL FOR CMD FACILITIES*/
*          3 CFCNTRD  CHAR(1),     /* LIST OF MODULES IN COMMAND    */
*                                  /* FACILITIES ENTERED            */
*            4 NCFCS1   BIT(1),    /* IND MODULE ISTCFCS1 ENTERED   */
*            4 NCFCS2   BIT(1),    /* IND MODULE ISTCFCS2 ENTERED   */
*            4 NCFCR1   BIT(1),    /* IND MODULE ISTCFCR1 ENTERED   */
*            4 NCFCRP   BIT(1),    /* IND MODULE ISTCFCRP ENTERED   */
*            4 NCFCR2   BIT(1),    /* IND MODULE ISTCFCR2 ENTERED   */
*            4 NCFRSVD  BIT(3),    /* RESERVED                      */
*          3 CFCCRT   CHAR(1),     /* LIST OF MODULES IN COMMAND    */
*                                  /* FACILITIES RUNNING            */
*            4 CCFCS1   BIT(1),    /* IND MODULE ISTCFCS1 RUNNING   */
*            4 CCFCS2   BIT(1),    /* IND MODULE ISTCFCS2 RUNNING   */
*            4 CCFCR1   BIT(1),    /* IND MODULE ISTCFCR1 RUNNING   */
*            4 CCFCRP   BIT(1),    /* IND MODULE ISTCFCRP RUNNING   */
*            4 CCFCR2   BIT(1),    /* IND MODULE ISTCFCR2 RUNNING   */
*            4 CCFRSVD1 BIT(3);    /* RESERVED                      */
*DCL TIDCFCS1 BIT(8) CONSTANT('00'X); /* THREAD ID FOR ISTCFCS1     */
*DCL TIDCFCR1 BIT(8) CONSTANT('01'X); /* THREAD ID FOR ISTCFCR1     */
*DCL TIDCFCR2 BIT(8) CONSTANT('02'X); /* THREAD ID FOR ISTCFCR2     */
*/* COMPONENT RECOVERY RECORD FOR TPIOS */                         2458
*/*  DELTA                                             006 02/10/75  */
*DCL                                                               2458
*1  ISTZCRR BDY(WORD) BASED,     /* CONTROL WORD                     */
*   2  ZCRCRR CHAR(4),           /* CONTROL WORD                     */
*      3  ZCRID CHAR(1),         /* CONTROL BLOCK ID                 */
*      3  ZCRLEN CHAR(2),        /* LENGTH OF ZCR                    */
*      3  ZCRFLAG CHAR(1),       /* FLAGS                            */
*   2  ZCRCHAIN PTR(31),         /* POINTER TO PREVIOUS ZCR          */
*   2  ZCRFRRA PTR(31),          /* PTR TO FRR                       */
*   2  ZCRFLGS1 CHAR(1),         /* FLGS USED BY REQUEST COMPLETION  */
*      3  ZCREXSW BIT(1),        /* EXIT SWITCH                      */
*      3  ZCRQUESW BIT(1),       /* QUEUE SWITCH                     */
*      3  ZCRDEQSW BIT(1),       /* DEQUEUE SWITCH                   */
*      3  ZCRWAIT BIT(1),        /* WAIT Q ANALYSIS COMPLETE         */
*      3  ZCRNRMEX BIT(1),       /* NORMAL EXIT TO BE TAKEN          */
*      3  ZCRENDLP BIT(1),       /* END OF LOOP SWITCH               */
*      3  ZCRUNSOL BIT(1),       /* UNSOLICITED DATA                 */
*      3  ZCRFEXIT BIT(1),       /* FORCE EXIT SWITCH                */
*   2  ZCRFLGS2 CHAR(1),         /* FLAGS USED WITHIN TPIOS          */
*      3  ZCRLOCAL BIT(1),       /* LOCAL SUPPORT                    */
*      3  ZCRSHEDI BIT(1),       /* IMMEDIATE SCHEDULE               */
*      3  ZCRFMSED BIT(1),       /* FMCB SEARCH ENDED                */
*      3  ZCROB    BIT(1),       /* OUTBOUND PROC IN PROGRESS        */
*      3  ZCRIF0E1 BIT(1),       /* SWITCH FOR STRUCTURED PGM USED BY
*                                   INBOUND PROCESSING               */
*      3  ZCRIF0E2 BIT(1),       /* SWITCH FOR STRUCTURED PGM USED BY
*                                   INBOUND PROCESSING               */
*      3  ZCRIF0E3 BIT(1),       /* SWITCH FOR STRUCTURED PGM USED BY
*                                   INBOUND PROCESSING               */
*   2  ZCRSWFLD CHAR(1),         /* SWITCHES FOR TPIOS OUTBOUND      */
*      3  ZCRENDSH BIT(1),       /* EXIT FROM REMOTE DEV SCHEDULER   */
*         4  ZCRSLCP BIT(1),     /* SCHEDULE LCPB                    */
*      3  ZCREXTYP BIT(1),       /* TPEXIT TYPE                      */
*      3  ZCRENDPR BIT(1),       /* EXIT FROM INNER PROCESS          */
*      3  ZCRNDLCP BIT(1),       /* EXIT FROM LCPB PROCESSING        */
*         4  ZCROB1 BIT(1),      /* REMOTE DEV SCHED 1ST TIME SWITCH */
*      3  ZCRENDX BIT(1),        /* EXIT FROM LCCW/BTU XLATION       */
*      3  ZCRENDXL BIT(1),       /* EXIT FROM LCCW PROC              */
*      3  ZCRENDAN BIT(1),       /* EXIT FROM LCPB ANALYSIS          */
*      3  ZCRRESET BIT(1),                                         2458
*         4  ZCRCNLXL BIT(1),    /* CANCEL FURTHER XLATE             */
*   2  ZCRFLGS3 CHAR(1),         /* FLAGS FOR OUTBOUND PROCESSING    */
*      3  ZCRTIC BIT(1),         /* SELECT NOT TO BE SENT            */
*      3  ZCRTPCON BIT(1),       /* TPIOS CONTACT SENT               */
*      3  ZCRTPDIS BIT(1),       /* TPIOS DISCONNECT TO BE SENT      */
*      3  ZCRDISC  BIT(1),       /* DISCONNECT IN PROCESS            */
*      3  ZCREDRIV BIT(1),       /* DO DERIVE                        */
*      3  ZCRNOFRE BIT(1),       /* NO FREEING OF SIO QUEUE          */
*      3  ZCRWRPTR BIT(1),       /* WRITE TO PRINTER REQUEST         */
*      3  ZCRINLCP BIT(1),       /* ERROR OCCURED DURING OUTBND PROC */
*   2  ZCRGENSW CHAR(1),         /* GENERAL SWITCHES                 */
*      3  ZCRTSW1  BIT(1),       /* TEMP SW FOR STRUCTURED PGM       */
*      3  ZCRTSW2  BIT(1),       /* TEMP SW FOR STRUCTURED PGM       */
*      3  ZCRRT06  BIT(1),       /* CRITICAL TEXT OPTION             */
*      3  ZCRLCSYN BIT(1),       /* LCCW SYNC SPECIFIED              */
*      3  ZCREXRES BIT(1),       /* EXCEPTION RESPONSE SPECIFIED     */
*      3  ZCRCLRBD BIT(1),       /* FLAG INDICATING BIND WAS CLEARED */
*      3  ZCRBRIS  BIT(1),       /* BRACKET REJECTED DUE TO IN BRAC. */
*      3  ZCRF1RES BIT(1),       /* FID1 RESPONSE TO BE GENERATED    */
*   2  ZCRPFLGS CHAR(1),         /* UTILITIES PROC OPTION FLAGS      */
*      3  ZCRQAHED BIT(1),      /* QXFR RTN TO USE INSERT OPT'N ON TPQ*
*      3  *        BIT(7),      /* RESERVED                          */
*   2  ZCRIBPR CHAR(1),          /* INBOUND PROCESSING FLAGS         */
*         3  ZCRNOBUF BIT(1),    /* FSB WITH NO BUFFER               */
*         3  ZCRERR   BIT(1),    /* ERROR INDICATOR                  */
*         3  ZCRRELK  BIT(1),    /* RESET ERROR LOCK FUNCTION REQ.   */
*         3  ZCRLCPFR BIT(1),    /* FLAG IND. DEALLOCATE ATOP LCPB   */
*         3  ZCRLCPFD BIT(1),    /* FLAG IND. LCPB FOUND ON WAITQ    */
*         3  ZCR3270  BIT(1),    /* 3270 DEVICE                      */
*         3  ZCR3270R BIT(1),    /* 3270 DEVICE IN RECORD MODE       */
*         3  *        BIT(1),    /* RESERVED                         */
*   2  ZCRSCPSW CHAR(1),         /* SESSION CONTROL FLAGS            */
*         3  ZCRTPEX BIT(1),     /* TP EXIT                          */
*         3  ZCRTPINV BIT(1),    /* INVOKE TPIOS                     */
*         3  ZCRRJLCP BIT(1),    /* LCPB REJECTED                    */
*         3  ZCRLREQ BIT(1),     /* REQUEST                          */
*         3  ZCRPRCMP BIT(1),    /* PROCESSING COMPLETE              */
*         3  ZCRFSBWE BIT(1),    /* FSB IS WORK ELEMENT              */
*         3  ZCRSKIPT BIT(1),    /* SKIP TRACE FLAG                  */
*         3  ZCRMDATA BIT(1),    /* LCCW DATA HAS BEEN MOVED @ZA29724*/
*   2  ZCRCRLCP PTR(31),         /* CURRENT LCPB PTR                 */
*   2  ZCRPARMS BDY(WORD),       /* PARAMETERS PASSED TO UTILITIES */
*      3  ZCRFBPTR PTR(31),      /* PTR TO FROM BUFFER               */
*         4  ZCRCBPTR PTR(31),   /* PTR TO CURRENT BUFFER            */
*      3  ZCRTBPTR PTR(31),      /* PTR TO TO-OR-TRANSLATE BUFFER    */
*      3  ZCRMLNG FIXED(16),     /* LENGTH TO MOVE         @ZA28610  */
*      3  ZCRDFRDA FIXED(15),    /* OFFSET FROM DATA ADDR IN FROM BUF*/
*         4  ZCRDTODA FIXED(15), /* OFFSET FROM DATA ADDR XLATE BUF  */
*      3  ZCRPCOD1 CHAR(1),      /* CODE BYTE FOR ALLOC/DISALLOC     */
*         4  ZCRPPG BIT(1),      /* GET PAGEABLE BUFF                */
*         4  ZCRPLNG BIT(1),     /* LENGTH OF BUFFER SPECIFIED       */
*         4  ZCRPFSB BIT(1),     /* GET FSB                          */
*         4  ZCRPLSBF BIT(1),    /* GET LSCB AND BUFFER              */
*            5 ZCRPLSBQ BIT(1),  /* PURGE LSCB QUEUE                 */
*         4  ZCRPLSCB BIT(1),    /* GET OR RELEASE LSCB              */
*         4  ZCRPBUF BIT(1),     /* GET OR RELEASE BUFFER            */
*         4  ZCRPCFTX BIT(1),    /* CONFIDENTIAL TEXT                */
*         4  ZCRPRES BIT(1),     /* RESERVED                         */
*      3  ZCRPCOD2 CHAR(1),      /* CODE BYTE FOR MOVE               */
*         4  ZCRPPG2 BIT(1),     /* GET PAGEABLE BUFFER              */
*         4  ZCRPFHDR BIT(1),    /* FROM BUFFER FDB TO BE USED       */
*         4  ZCRPMFGF BIT(1),    /* MOVE STARTS WIHT 1ST BUFF IN BLOCK*
*         4  ZCRPRES2 BIT(5),    /* RESERVED                         */
*      3  ZCRPCHAR CHAR(1),      /* TRANSLATE & TEST SEARCH CHARACTER*/
*      3  ZCRPSW   CHAR(1),      /* SWITCH FIELD                     */
*   2  ZCRCCWA PTR(31),          /* PTR TO CURRENT CCW (CCW 1 OR 2)  */
*   2  ZCRBFPTR PTR(31),         /* SAVE 1ST BUFF PTR IN TO-BUFF CHN
*                                   OR LAST BUFFER IN CHANNEL PGM    */
*   2  ZCRZLB PTR(31),           /* PTR TO CURR BUFF IN CHANNEL PGM  */
*   2  ZCRPVZB PTR(31),          /* PTR TO PREVIOUS BUFF IN CHAN PGM */
*   2  ZCRSVRTN BDY(WORD),       /* REG 14 SAVE AREAS                */
*      3  ZCRSVF1 PTR(31),       /* SAVE REQUIRED REGISTER           */
*      3  ZCRSVF2 PTR(31),       /* SAVE REQUIRED REGISTER           */
*      3  ZCRSVF3 PTR(31),       /* SAVE REQUIRED REGISTER           */
*      3  ZCRSVF4 PTR(31),       /* SAVE REQUIRED REGISTER           */
*      3  ZCRSVF5 PTR(31),       /* SAVE REQUIRED REGISTER           */
*      3  ZCRSVF6 PTR(31),       /* SAVE REQUIRED REGISTER           */
*      3  ZCRSVF7 PTR(31),       /* SAVE REQUIRED REGISTER           */
*      3  ZCRSVF8 PTR(31),       /* SAVE REQUIRED REGISTER           */
*      3  ZCRSVF9 PTR(31),       /* SAVE REQUIRED REGISTER           */
*      3  ZCRSVF10 PTR(31),      /* SAVE REQUIRED REGISTER           */
*      3  ZCRSVF11 PTR(31),      /* SAVE REQUIRED REGISTER           */
*      3  ZCRSVF12 PTR(31),      /* SAVE REQUIRED REGISTER           */
*      3  ZCRSVF13 PTR(31),      /* SAVE REQUIRED REGISTER           */
*      3  ZCRSVF14 PTR(31),      /* SAVE REQUIRED REGISTER           */
*      3  ZCRSVF15 PTR(31),      /* SAVE REQUIRED REGISTER           */
*      3  ZCRSVF16 PTR(31),      /* SAVE REQUIRED REGISTER           */
*      3  ZCRSVF17 PTR(31),      /* SAVE REQUIRED REGISTER           */
*      3  ZCRSVF18 PTR(31),      /* SAVE REQUIRED REGISTER           */
*      3  ZCRSVF19 PTR(31),      /* SAVE REQUIRED REGISTER           */
*      3  ZCRSVF20 PTR(31),      /* SAVE REQUIRED REGISTER           */
*      3  ZCRSVF21 PTR(31),      /* SAVE REQUIRED REGISTER           */
*      3  ZCRSVF22 PTR(31),      /* SAVE REQUIRED REGISTER           */
*      3  ZCRSVF23 PTR(31),      /* SAVE REQUIRED REGISTER           */
*      3  ZCRSVF24 PTR(31),      /* SAVE REQUIRED REGISTER           */
*      3  ZCRSVF25 PTR(31),      /* SAVE REQUIRED REGISTER           */
*   2  ZCRWKARA BDY(WORD),       /* TEMPORARY REG SAVE AREA          */
*      3  ZCRSVWK1 PTR(31),      /* SAVE REQUIRED REG                */
*      3  ZCRSVWK2 PTR(31),      /* SAVE REQUIRED REG                */
*      3  ZCRSVWK3 PTR(31),      /* SAVE REQUIRED REG                */
*      3  ZCRSVWK4 PTR(31),      /* SAVE REQUIRED REG                */
*      3  ZCRSVWK5 PTR(31),      /* SAVE REQUIRED REG                */
*   2  ZCRFSBSV PTR(31),         /* FSB CHAIN PTR SAVEAREA           */
*   2  ZCRFBPRC BIT(1),          /* FSB PROCESS SW                   */
*   2  ZCRMOREL BIT(1),          /* MORE ELEMENTS SW                 */
*   2  ZCRSCANQ BIT(1),          /* SCAN QUEUE SW                    */
*   2  ZCRNXTEL BIT(1),          /* NEXT ELEMENT SW                  */
*   2  ZCRXSCHD BIT(1),          /* EXIT SCHEDULE SW                 */
*   2  ZCRLSTFB BIT(1),          /* INBOUND PROC LAST FSB FOR ELEM SW*/
*   2  ZCRTOPQ  BIT(1),          /* QUEUE ELEMENT TO TOP SW          */
*   2  ZCRAWQSW BIT(1),          /* CHECK AWAITQ FOR MORE WORK =1    */
*                                /* CHECK WAITQ =0                   */
*   2  ZCRRCDSV CHAR(1),         /* RETURN CODE SAVEAREA             */
*   2  ZCRPRMTC CHAR(1),         /* PREEMPT COMPLETION PARAMETER BYTE*/
*   2  ZCROPCDE CHAR(1),         /* OP CODE TO BE TRANSFORMED         *
*   2  ZCRR2SV PTR(31),          /* ISTZBFDI REG 2 SAVE EREA         */
*   2  ZCRR13SV PTR(31),         /* ISTSBFDI REG 13 SAVE EREA        */
*   2  ZCRCIDSV BDY(WORD),       /* ISTZBFDI CID SAVE AREA           */
*      3  ZCRSAFSV CHAR(2),      /* ISTZBFDI SAF SAVE AREA           */
*      3  ZCRDAFSV CHAR(2),      /* ISTZBFDI DAF SAVE AREA           */
*   2  ZCRSAVEZ (6) BDY(WORD) CHAR(LENGTH(ISTZSAVE)),              2458
*                                /* SAVE/TRACE AREAS FOR TPIOS MODS  */
*   2  ZCRREMIC PTR(31),        /* POINTER TO REMOTE RN ICNCB        */
*   2  ZCRAUDIT CHAR(36),        /* TPIOS AUDIT TRAIL AREA           */
*      3  ZCRTID CHAR(1),        /* THREAD I.D.                      */
*      3  ZCRTNAME CHAR(4),      /* LAST 4 CHARS OF THREAD NAME      */
*      3  ZCRENTER BIT(248),     /* BIT ARRAY FOR MODULES ENTERED    */
*         4  ZCREAC1A BIT(1),    /* ISTZAC1A ENTERED                 */
*         4  ZCREAC0A BIT(1),    /* ISTZAC0A ENTERED                 */
*         4  ZCREAC0B BIT(1),    /* ISTZAC0B ENTERED                 */
*         4  ZCREAC1B BIT(1),    /* ISTZAC1B ENTERED                 */
*         4  ZCREBCAA BIT(1),    /* ISTZBCAA ENTERED                 */
*         4  ZCREBCAB BIT(1),    /* ISTZBCAB ENTERED                 */
*         4  ZCREBCAE BIT(1),    /* ISTZBCAE ENTERED                 */
*         4  ZCREBCAG BIT(1),    /* ISTZBCAG ENTERED                 */
*         4  ZCREBCAI BIT(1),    /* ISTZBCAI ENTERED                 */
*         4  ZCREBCAM BIT(1),    /* ISTZBCAM ENTERED                 */
*         4  ZCREBCBA BIT(1),    /* ISTZBCBA ENTERED                 */
*         4  ZCREBCBB BIT(1),    /* ISTZBCBB ENTERED                 */
*         4  ZCREBCBI BIT(1),    /* ISTZBCBI ENTERED                 */
*         4  ZCREBCCB BIT(1),    /* ISTZBCCB ENTERED                 */
*         4  ZCREBCDI BIT(1),    /* ISTZBCDI ENTERED                 */
*         4  ZCREBCEB BIT(1),    /* ISTZBCEB ENTERED                 */
*         4  ZCREBCFA BIT(1),    /* ISTZBCFA ENTERED                 */
*         4  ZCREBCFB BIT(1),    /* ISTZBCFB ENTERED                 */
*         4  ZCREBCGA BIT(1),    /* ISTZBCGA ENTERED                 */
*         4  ZCREBCGB BIT(1),    /* ISTZBCGB ENTERED                 */
*         4  ZCREBCHA BIT(1),    /* ISTZBCHA ENTERED                 */
*         4  ZCREBCHB BIT(1),    /* ISTZBCHB ENTERED                 */
*         4  ZCREBCIA BIT(1),    /* ISTZBCIA ENTERED                 */
*         4  ZCREBCIB BIT(1),    /* ISTZBCIB ENTERED                 */
*         4  ZCREBCID BIT(1),    /* ISTZBCID ENTERED                 */
*         4  ZCREBCJA BIT(1),    /* ISTZBCJA ENTERED                 */
*         4  ZCREBCJB BIT(1),    /* ISTZBCJB ENTERED                 */
*         4  ZCREBCKA BIT(1),    /* ISTZBCKA ENTERED                 */
*         4  ZCREBCKB BIT(1),    /* ISTZBCKB ENTERED                 */
*         4  ZCREBCLA BIT(1),    /* ISTZBCLA ENTERED                 */
*         4  ZCREBCLB BIT(1),    /* ISTZBCLB ENTERED                 */
*         4  ZCREBCMB BIT(1),    /* ISTZBCMB ENTERED                 */
*         4  ZCREBCND BIT(1),    /* ISTZBCND ENTERED                 */
*         4  ZCREBCNE BIT(1),    /* ISTZBCNE ENTERED                 */
*         4  ZCREBCOB BIT(1),    /* ISTZBCOB ENTERED                 */
*         4  ZCREBCPB BIT(1),    /* ISTZBCPB ENTERED                 */
*         4  ZCREBCQB BIT(1),    /* ISTZBCQB ENTERED                 */
*         4  ZCREBCRA BIT(1),    /* ISTZBCRA ENTERED                 */
*         4  ZCREBCRB BIT(1),    /* ISTZBCRB ENTERED                 */
*         4  ZCREBCSC BIT(1),    /* ISTZBCSC ENTERED                 */
*         4  ZCREBCXA BIT(1),    /* ISTZBCXA ENTERED                 */
*         4  ZCREBCX0 BIT(1),    /* ISTZBCX0 ENTERED                 */
*         4  ZCREBCY0 BIT(1),    /* ISTZBCY0 ENTERED                 */
*         4  ZCREBCZ0 BIT(1),    /* ISTZBCZ0 ENTERED                 */
*         4  ZCREBC0A BIT(1),    /* ISTZBC0A ENTERED                 */
*         4  ZCREBC0B BIT(1),    /* ISTZBC0B ENTERED                 */
*         4  ZCRECC0A BIT(1),    /* ISTZCC0A ENTERED                 */
*         4  ZCRECC0B BIT(1),    /* ISTZCC0B ENTERED                 */
*         4  ZCRECC1A BIT(1),    /* ISTZCC1A ENTERED                 */
*         4  ZCRECC1B BIT(1),    /* ISTZCC1B ENTERED                 */
*         4  ZCRECC2B BIT(1),    /* ISTZCC2B ENTERED                 */
*         4  ZCREDCA0 BIT(1),    /* ISTZDCA0 ENTERED                 */
*         4  ZCREDCB0 BIT(1),    /* ISTZDCB0 ENTERED                 */
*         4  ZCREDCC0 BIT(1),    /* ISTZDCC0 ENTERED                 */
*         4  ZCREDCD0 BIT(1),    /* ISTZDCD0 ENTERED                 */
*         4  ZCREDCE0 BIT(1),    /* ISTZDCE0 ENTERED                 */
*         4  ZCREDCF0 BIT(1),    /* ISTZDCF0 ENTERED                 */
*         4  ZCREDCH0 BIT(1),    /* ISTZDCH0 ENTERED                 */
*         4  ZCREDCI0 BIT(1),    /* ISTZDCI0 ENTERED                 */
*         4  ZCREDCJ0 BIT(1),    /* ISTZDCJ0 ENTERED                 */
*         4  ZCREDCKA BIT(1),    /* ISTZDCKA ENTERED                 */
*         4  ZCREDCKB BIT(1),    /* ISTZDCKB ENTERED                 */
*         4  ZCREDCL0 BIT(1),    /* ISTZDCL0 ENTERED                 */
*         4  ZCREDCMB BIT(1),    /* ISTZDCMB ENTERED                 */
*         4  ZCREECBA BIT(1),    /* ISTZECBA ENTERED                 */
*         4  ZCREECBB BIT(1),    /* ISTZECBB ENTERED                 */
*         4  ZCREECCA BIT(1),    /* ISTZECCA ENTERED                 */
*         4  ZCREECCB BIT(1),    /* ISTZECCB ENTERED                 */
*         4  ZCREECDA BIT(1),    /* ISTZECDA ENTERED                 */
*         4  ZCREECEA BIT(1),    /* ISTZECEA ENTERED                 */
*         4  ZCREECTA BIT(1),    /* ISTZECTA ENTERED                 */
*         4  ZCREFCEA BIT(1),    /* ISTZFCEA ENTERED                 */
*         4  ZCREFCEB BIT(1),    /* ISTZFCEB ENTERED                 */
*         4  ZCREGCAB BIT(1),    /* ISTZGCAB ENTERED                 */
*         4  ZCREGCBB BIT(1),    /* ISTZGCBB ENTERED                 */
*         4  *        BIT(1),    /* NOT USED                         */
*         4  ZCREGCDB BIT(1),    /* ISTZGCDB ENTERED                 */
*         4  ZCREGCEB BIT(1),    /* ISTZGCEB ENTERED                 */
*         4  ZCREGCLA BIT(1),    /* ISTZGCLA ENTERED                 */
*         4  ZCREGC0A BIT(1),    /* ISTZGC0A ENTERED                 */
*         4  ZCREGC0B BIT(1),    /* ISTZGC0B ENTERED                 */
*         4  ZCREHCAN BIT(1),    /* ISTZHCAN ENTERED                 */
*         4  ZCREICAA BIT(1),    /* ISTZICAA ENTERED                 */
*         4  ZCREICAB BIT(1),    /* ISTZICAB ENTERED                 */
*         4  ZCREICBB BIT(1),    /* ISTZICBB ENTERED                 */
*         4  ZCREICBI BIT(1),    /* ISTZICBI ENTERED                 */
*         4  ZCREICCB BIT(1),    /* ISTZICCB ENTERED                 */
*         4  ZCREICCI BIT(1),    /* ISTZICCI ENTERED                 */
*         4  ZCREICDB BIT(1),    /* ISTZICDB ENTERED                 */
*         4  ZCREICEB BIT(1),    /* ISTZICEB ENTERED                 */
*         4  ZCREICGB BIT(1),    /* ISTZICGB ENTERED                 */
*         4  ZCREICHB BIT(1),    /* ISTZICHB ENTERED                 */
*         4  ZCREICIB BIT(1),    /* ISTZICIB ENTERED                 */
*         4  ZCREICID BIT(1),    /* ISTZICID ENTERED                 */
*         4  ZCREICJB BIT(1),    /* ISTZICJB ENTERED                 */
*         4  ZCREICKB BIT(1),    /* ISTZICKB ENTERED                 */
*         4  ZCREICKE BIT(1),    /* ISTZICKE ENTERED                 */
*         4  ZCREICKG BIT(1),    /* ISTZICKG ENTERED                 */
*         4  ZCREICLB BIT(1),    /* ISTZICLB ENTERED                 */
*         4  ZCREICMB BIT(1),    /* ISTZICMB ENTERED                 */
*         4  ZCREICNA BIT(1),    /* ISTZICNA ENTERED                 */
*         4  ZCREICNB BIT(1),    /* ISTZICNB ENTERED                 */
*         4  ZCREICOA BIT(1),    /* ISTZICOA ENTERED                 */
*         4  ZCREICOB BIT(1),    /* ISTZICOB ENTERED                 */
*         4  ZCREICQA BIT(1),    /* ISTZICQA ENTERED                 */
*         4  ZCREICQB BIT(1),    /* ISTZICQB ENTERED                 */
*         4  ZCREICRB BIT(1),    /* ISTZICRB ENTERED                 */
*         4  ZCREICSB BIT(1),    /* ISTZICSB ENTERED                 */
*         4  ZCREICSC BIT(1),    /* ISTZICSC ENTERED                 */
*         4  ZCREICTB BIT(1),    /* ISTZICTB ENTERED                 */
*         4  ZCREICUB BIT(1),    /* ISTZICUB ENTERED                 */
*         4  ZCREICVB BIT(1),    /* ISTZICVB ENTERED                 */
*         4  ZCREICWB BIT(1),    /* ISTZICWB ENTERED                 */
*         4  ZCREICX0 BIT(1),    /* ISTZICX0 ENTERED                 */
*         4  ZCREIC0B BIT(1),    /* ISTZIC0B ENTERED                 */
*         4  ZCREIC1B BIT(1),    /* ISTZIC1B ENTERED                 */
*         4  ZCREJCAB BIT(1),    /* ISTZJCAB ENTERED                 */
*         4  ZCREJCBB BIT(1),    /* ISTZJCBB ENTERED                 */
*         4  ZCREJCCB BIT(1),    /* ISTZJCCB ENTERED                 */
*         4  ZCREJCDB BIT(1),    /* ISTZJCDB ENTERED                 */
*         4  ZCREJC0B BIT(1),    /* ISTZJC0B ENTERED                 */
*         4  ZCREKCBB BIT(1),    /* ISTZKCBB ENTERED                 */
*         4  ZCREKCBN BIT(1),    /* ISTZKCBN ENTERED                 */
*         4  ZCREKCCN BIT(1),    /* ISTZKCCN ENTERED                 */
*         4  ZCREDCWR BIT(1),    /* ISTZDCWR ENTERED                 */
*         4  ZCREDCWB BIT(1),    /* ISTZDCWB ENTERED                 */
*         4  ZCREDCXR BIT(1),    /* ISTZDCXR ENTERED                 */
*         4  ZCREBCBR BIT(1),    /* ISTZBCBR ENTERED                 */
*         4  ZCREBCDR BIT(1),    /* ISTZBCDR ENTERED                 */
*         4  ZCREBCAR BIT(1),    /* ISTZBCAR ENTERED                 */
*         4  ZCRECCBI BIT(1),    /* ISTZCCBI ENTERED                 */
*         4  ZCRECCAI BIT(1),    /* ISTZCCAI ENTERED                 */
*         4  ZCRECCCI BIT(1),    /* ISTZCCCI ENTERED                 */
*         4  ZCREAC1R BIT(1),    /* ISTZAC1R ENTERED                 */
*         4  ZCREBCSB BIT(1),    /* ISTZBCSB ENTERED                 */
*         4  ZCREDCPR BIT(1),    /* ISTZDCPR ENTERED                 */
*         4  ZCREDCQR BIT(1),    /* ISTZDCQR ENTERED                 */
*         4  ZCREBCAL BIT(1),    /* ISTZBCAL ENTERED                 */
*         4  ZCREBC0L BIT(1),    /* ISTZBC0L ENTERED                 */
*         4  ZCREBCNB BIT(1),    /* ISTZBCNB ENTERED                 */
*         4  ZCREICOE BIT(1),    /* ISTZICOE ENTERED                 */
*         4  ZCREDCNB BIT(1),    /* ISTZDCNB ENTERED                 */
*         4  ZCREKCCB BIT(1),    /* ISTZKCCB ENTERED                 */
*         4  ZCRECFY0 BIT(1),    /* ISTZCFY0 ENTERED                 */
*         4  ZCREDCK0 BIT(1),    /* ISTZDFK0 ENTERED                 */
*         4  ZCREICSG BIT(1),    /* ISTZICSG ENTERED                 */
*         4  ZCREBCIF BIT(1),    /* ISTZBCIF ENTERED                 */
*         4  ZCREDCMF BIT(1),    /* ISTZDCMF ENTERED                 */
*         4  ZCRELCAB BIT(1),    /* ISTZLCAB ENTERED                 */
*         4  ZCREAC2B BIT(1),    /* ISTZAC2B ENTERED                 */
*         4  ZCREIC2B BIT(1),    /* ISTZIC2B ENTERED                 */
*         4  ZCRRSV97 BIT(97),   /* RESERVED                         */
*   2  ZCRCMNRC CHAR(1),                /* PURGE MWOR RETURN CODE    */
*   2  ZCRWORDA CHAR(3),                /* RESERVED FOR LATER USE    */
*   2  ZCRLCPB  CHAR(LENGTH(ISTLCPB)),  /* 3270 S/R LCPB             */
*      3 ZCRRHRU,                       /* SAVEAREA FOR RH AND RU    */
*        4 ZCRRH    CHAR(3),            /* RH                        */
*        4 ZCRRU    CHAR(*);            /* RU                        */
*DCL ZCTYPE BIT(8) CONSTANT('00'X);   /* ZCR TYPE                   */
*DCL ZCLNG FIXED(15) CONSTANT(172);   /* ZCRR LENGTH                */
*DCL ZCRSAVNO BIT(8) CONSTANT('06'X); /* NUMBER OF SAVEAREAS IN ZCRR */
*DCL ZCRLSVNO BIT(8) CONSTANT('04'X); /* NUMBER OF SAVE AREAS IN   2462
*                                         LOCAL SUPPORT              */
*/* *** EQUATES FOR ZCRRCDSV *** */                                2463
*                                                                  2463
*DCL ZCRMRFSB BIT(8) CONSTANT('0C'X);  /* REQUEST COMPLETION MOVE FSB
*                                         TO PROCESS                 */
*DCL ZCRSRCHQ BIT(8) CONSTANT('10'X);  /* REQUEST COMPLETION SEARCH
*                                         REQUEST QUEUE              */
*DCL ZCREXIT  BIT(8) CONSTANT('14'X);  /* REQUEST COMPLETION EXIT    */
*DCL ZCRSFSB  BIT(8) CONSTANT('18'X);  /* REQUEST COMPLETION SINGLE
*                                         FSB                        */
*DCL ZCRDLFSB BIT(8) CONSTANT('1C'X);  /* REQUEST COMPLETION DUAL FSB *
*DCL ZCRNOSCH BIT (8) CONSTANT('20'X); /* REQUEST COMPLETION, EXIT WITH
*                                         SCHED NONE                 */
*DCL ZCRNRSCH BIT (8) CONSTANT('24'X); /* REQUEST COMPLETION, EXIT WITH
*                                         SCHED NORM                 */
*DCL ZCRLGERR FIXED(8) CONSTANT(8);    /* LOGICAL ERROR              */
*DCL ZCPLSCB BIT(8) CONSTANT('08'X);   /* GET A RELEASE LSCB         */
*DCL ZCPBUF  BIT(8) CONSTANT('04'X);   /* GET A RELEASE BUFFER       */
*DCL ZCRTAC0A FIXED(8) CONSTANT(01);   /* LOCAL DEVICE SCHEDULER(OUT)*/
*DCL ZCRTAC0B FIXED(8) CONSTANT(02);   /* REMOTE DEVICE SCHEDLER(OUT)*/
*DCL ZCRTCC1A FIXED(8) CONSTANT(03);   /* LOCAL DIALOG SCHEDLER(IN)  */
*DCL ZCRTCC1B FIXED(8) CONSTANT(04);   /* REMOTE DIALOG SCHEDLER(IN) */
*DCL ZCRTDCE0 FIXED(8) CONSTANT(05);   /* NCP SLOWDOWN RECOVERY      */
*DCL ZCRTDCKA FIXED(8) CONSTANT(06);   /* LOCAL GENERAL FUNCTIONS    */
*DCL ZCRTDCKB FIXED(8) CONSTANT(07);   /* REMOTE GENERAL FUNCTIONS   */
*DCL ZCRTFCEB FIXED(8) CONSTANT(08);   /* REMOTE READ BUFFER ALLOC.  */
*DCL ZCRTGCLA FIXED(8) CONSTANT(09);   /* LCAL CTL & TEST FEEDBACK(IN)*
*DCL ZCRTGC0A FIXED(8) CONSTANT(10);   /* LOCAL REQ. COMPLETION(IN)  */
*DCL ZCRTGC0B FIXED(8) CONSTANT(11);   /* REMOTE REQ. COMPLETION(IN) */
*DCL ZCRTICWB FIXED(8) CONSTANT(12);   /* RESET CLEANUP (PHASE 5)    */
*DCL ZCRTIC0B FIXED(8) CONSTANT(13);   /* REMOTE REQ COMPLTION CTL(IN)*
*DCL ZCRTAC1B FIXED(8) CONSTANT(14);   /* ISTZAC1B THREAD ID         */
*DCL ZCRTIC1B FIXED(8) CONSTANT(15);   /* ISTZIC1B THREAD ID         */
*DCL ZCRTCCBI FIXED(8) CONSTANT(16);   /* ISTZCCBI THREAD ID         */
*DCL ZCRTAC1R FIXED(8) CONSTANT(17);   /* ISTZAC1R THREAD ID         */
*DCL ZCRTAC1A FIXED(8) CONSTANT(18);   /* ISTZAC1A THREAD ID         */
*DCL ZCRTLCAB FIXED(8) CONSTANT(19);   /* ISTZLCAB THREAD ID         */
*/* COMPONENT RECOVERY                                               */
*/*                                                                  */
*DCL 1 ISTASCRR BDY(WORD) BASED,        /* CRR FOR SMS               */
*     2  ASCPFCRR CHAR(LENGTH(ISTPFCRR)),                          2492
*     2  ASCFLAGS CHAR(7),              /* FLAGS                     */
*        3  ASCFLG1 CHAR(2),            /* MODULE TRACE FLAGS        */
*           4  ASCFBA BIT(1),           /* ALLOCATION IN PATH        */
*           4  ASCFBD BIT(1),           /* DE-ALLOCATION IN PATH     */
*           4  ASCFSR BIT(1),           /* FSR IN PATH               */
*           4  ASCPASTR BIT(13),        /* RESERVED PATH FLAGS       */
*        3  ASCFLG2 CHAR(2),            /* MODULE IN CONTROL FLAGS   */
*           4  ASCFBAIC BIT(1),         /* ALLOCATION IN CONTROL     */
*           4  ASCFBDIC BIT(1),         /* DE-ALLOCATION IN CONTROL  */
*           4  ASCFSRIC BIT(1),         /* FSR IN CONTROL            */
*           4  ASCICR BIT(13),          /* RESERVED IN CONTROL FLAGS */
*        3  ASCFLG3 CHAR(3),            /* AUDIT FLAGS               */
*           4  ASCFSRGT BIT(1),         /* FSR DOING GET PROCESSING  */
*           4  ASCFBDAL BIT(1),         /* FBD DOING ALLOCATION      */
*           4  ASCKEYF BIT(1),          /* KEY HAS BEEN ALTERED      */
*           4  ASCLLKF BIT(1),          /* LOCAL LOCK HELD           */
*           4  ASCFBDUD BIT(1),         /* FBD USING USER DATA       */
*           4  ASCAUDIT BIT(19),        /* RESERVED AUDIT BITS       */
*     2  ASCKEY CHAR(1),                /* ORIGINAL KEY              */
*     2  ASCETRYA PTR(31),              /* RETRY ADRS FOR CONTINUE 2492
*                                          OPTION                    */
*     2  ASCUSRGS CHAR(16),             /* SAVE AREA FOR USER REGS 2492
*                                          14 - 1                    */
*        3  ASCUSR14 CHAR(4),           /* REGISTER 14               */
*        3  ASCUSR15 CHAR(4),           /* REGISTER 15               */
*        3  ASCUSR00 CHAR(4),           /* REGISTER 0                */
*        3  ASCUSR01 CHAR(4),           /* REGISTER 1                */
*     2  ASCPSREG CHAR(16);             /* SAVE AREA FOR PSS       2492
*                                          REGS 1 - 4                */
*/*  INITIAL LEVEL                                      001 04/09/75 */
*DCL 1 ISTAPCRR BDY(WORD) BASED,                                   2493
*     2 APCHDRSV CHAR(LENGTH(ISTPFCRR)),  /* HEADER                  */
*     2  APCATFLG CHAR(2),              /* AUDIT TRACE FLAGS         */
*        3  APC51E BIT(1),              /* ISTAPC51 WAS ENTERED      */
*        3  APC52E BIT(1),              /* ISTAPC52  '     '         */
*        3  APC53E BIT(1),              /* ISTAPC53                  */
*        3  APC54E BIT(1),                                         2493
*        3  APC56E BIT(1),                                         2493
*        3  APC57E BIT(1),                                         2493
*        3  APC58E BIT(1),                                         2493
*        3  APC31E BIT(1),                                         2493
*        3 * BIT(8),                    /* RESERVED                  */
*     2  APCRFLG CHAR(2),               /* AUDIT TRACE FLAGS         */
*        3  APC51R BIT(1),              /* ISTAPCR1 IS RUNNING       */
*        3  APC52R BIT(1),              /* ISTAPC52 IS RUNNING       */
*        3  APC53R BIT(1),                                         2493
*        3  APC54R BIT(1),                                         2493
*        3  APC56R BIT(1),                                         2493
*        3  APC57R BIT(1),                                         2493
*        3  APC58R BIT(1),                                         2493
*        3  APC31R BIT(1),                                         2493
*        3  *      BIT(8),              /* RESERVED                  */
*     2  APCPSTA PTR(31),               /* PST@                      */
*     2  APCTCBA PTR(31),               /* TCB@                      */
*     2  APCRTRN PTR(31),               /*@ TO BR14 TO RTN TO SYSTEM */
*     2  APCPABSV PTR(31),              /*SAVED PAB@ TO REDISPATCH   */
*     2  APCQWFO PTR(31),               /* Q@ IN PST WORK AREA ON    */
*     2  APCFRRPM PTR(31),              /* WORKAREA@ RTN'D FROM SETFR*/
*     2  APCSAVE CHAR(72),                                         2493
*        3  APCESTAL CHAR(72),          /* ESTAE PARAMETER LIST AREA */
*     2  APCCOMF CHAR(4) BDY(HWORD),    /* FLAGS USED BY ALL PSS RTN */
*        3  APCCOMF1 CHAR(2),                                      2493
*           4  APCSSTSK BIT(1),         /* IRB TYPE WORK             */
*           4  APCUETSK BIT(1),         /* USER EXIT RUNNING UNDER IRB*
*           4  APCSMCR BIT(1),          /* SMA CRA BEING USED        */
*           4  APCIRB1 BIT(1),          /* IRB1 BEING USED           */
*           4  APCIRB2 BIT(1),          /* IRB2 BEING USED           */
*           4  APCRELR BIT(1),          /*CALL ISTAPC58 TO RLEASE CRA*/
*           4  APCEXIT BIT(1),          /* TELLS ISTAPC58 TO EXIT SYS*/
*           4  APCZLBER BIT(1),         /* ERR WHILE RUNNING ZLFAB PAB*
*           4  * BIT(8),                /* RESERVED                  */
*        3  APCRETCD FIXED(15),         /* RTN CODE FOR R15 FOR SYS  */
*     2  APCSAV1 PTR(31),               /* 1ST SAVE WORD             */
*     2  APCSAV2 PTR(31),               /* 2ND SAVE WORD             */
*     2  APCSWTWD CHAR(4),              /* SWITCH AREA FOR PSS RTN   */
*     2  APC31FLG CHAR(1),              /* ISTAPC31 FLAGS            */
*        3  APCTPXIT BIT(1),            /* TPEXIT IN PROGRESS        */
*        3  APCRESCH BIT(1),            /*PAB TPEXIT OCCURED  RESCHED*/
*        3  APCSORT BIT(1),       /* PAB SORTED TO PROPER PST/MPST   */
*        3  *       BIT(5),       /* RESERVED                        */
*     2  APC52FLG CHAR(1),        /* ISTAPC52 FLAGS                  */
*        3  APCCKRQ BIT(1),       /* CHECK RDY Q FOR WORK            */
*        3  APCSMSR BIT(1),       /* RETURNING SMS RPH               */
*        3  APCQENQ BIT(1),       /* ENQUEUEING PAB'S ON PST Q'S     */
*        3  APCRDQ BIT(1),        /* DEQUEING PAB'S FROM PST RDY Q   */
*        3  APCNWF BIT(1),        /* NO WORK FOUND                   */
*        3  APCWKF   BIT(1),      /* WORK FOUND                      */
*        3    *      BIT(2),      /* RESERVED                        */
*     2  APC53FLG CHAR(1),        /* ISTAPC53 FLAGS                  */
*        3  APCPR153 BIT(1),      /* USED PREALLOCATED CRA           */
*     2  APC54FLG CHAR(1),        /* ISTAPC54 FLAGS                  */
*        3  APCRLST BIT(1),       /* SMS BEING CALLED TO RELEASE UECB*/
*        3  * BIT(7),             /* RESERVED                        */
*     2  APC57FLG CHAR(1),        /* ISTAPC57 FLAGS                  */
*        3  APCRECRA BIT(1),      /* RELEASE CRA BEING DONE          */
*        3  APCNREL BIT(1),       /* DID NOT RELEASE CRA             */
*        3  *   BIT(6),           /* RESERVED                        */
*     2  * CHAR(15);              /* RESERVED                        */
*/*               COMPONENT RECOVERY AREA                            */
*/*  REVISIONS                                         005 04/09/75  */
*DCL 1  ISTCRA BASED BDY(DWORD),        /* COMPONENT RECOVERY AREA   */
*     2  CRABASIC BDY(WORD),            /* CRA WITHOUT PROCESS CRR   */
*      3 CRAHDR CHAR(8) BDY(WORD),      /* CRA HEADER                */
*        4  CRACRR PTR(31),             /* PTR TO ACTIVE CRR         */
*        4  CRAFRR PTR(31),             /* PTR TO ACTIVE FRR         */
*      3 CRALKACT BIT(32),              /* LOCK LEVEL AND          2494
*                                          OWNERSHIP FLAGS           */
*        4  CRALEV32 BIT(1),            /* 1 = LEVEL 32 LOCK HELD    */
*        4  CRALEV31 BIT(1),            /* 1 = LEVEL 31 LOCK HELD    */
*        4  CRALEV30 BIT(1),            /* 1 = LEVEL 30 LOCK HELD    */
*        4  CRALEV29 BIT(1),            /* 1 = LEVEL 29 LOCK HELD    */
*        4  CRALEV28 BIT(1),            /* 1 = LEVEL 28 LOCK HELD    */
*        4  CRALEV27 BIT(1),            /* 1 = LEVEL 27 LOCK HELD    */
*        4  CRALEV26 BIT(1),            /* 1 = LEVEL 26 LOCK HELD    */
*        4  CRALEV25 BIT(1),            /* 1 = LEVEL 25 LOCK HELD    */
*        4  CRALEV24 BIT(1),            /* 1 = LEVEL 24 LOCK HELD    */
*        4  CRALEV23 BIT(1),            /* 1 = LEVEL 23 LOCK HELD    */
*        4  CRALEV22 BIT(1),            /* 1 = LEVEL 22 LOCK HELD    */
*        4  CRALEV21 BIT(1),            /* 1 = LEVEL 21 LOCK HELD    */
*        4  CRALEV20 BIT(1),            /* 1 = LEVEL 20 LOCK HELD    */
*        4  CRALEV19 BIT(1),            /* 1 = LEVEL 19 LOCK HELD    */
*        4  CRALEV18 BIT(1),            /* 1 = LEVEL 18 LOCK HELD    */
*        4  CRALEV17 BIT(1),            /* 1 = LEVEL 17 LOCK HELD    */
*        4  CRALEV16 BIT(1),            /* 1 = LEVEL 16 LOCK HELD    */
*        4  CRALEV15 BIT(1),            /* 1 = LEVEL 15 LOCK HELD    */
*        4  CRALEV14 BIT(1),            /* 1 = LEVEL 14 LOCK HELD    */
*        4  CRALEV13 BIT(1),            /* 1 = LEVEL 13 LOCK HELD    */
*        4  CRALEV12 BIT(1),            /* 1 = LEVEL 12 LOCK HELD    */
*        4  CRALEV11 BIT(1),            /* 1 = LEVEL 11 LOCK HELD    */
*        4  CRALEV10 BIT(1),            /* 1 = LEVEL 10 LOCK HELD    */
*        4  CRALEV09 BIT(1),            /* 1 = LEVEL 9 LOCK HELD     */
*        4  CRALEV08 BIT(1),            /* 1 = LEVEL 8 LOCK HELD     */
*        4  CRALEV07 BIT(1),            /* 1 = LEVEL 7 LOCK HELD     */
*        4  CRALEV06 BIT(1),            /* 1 = LEVEL 6 LOCK HELD     */
*        4  CRALEV05 BIT(1),            /* 1 = LEVEL 5 LOCK HELD     */
*        4  CRALEV04 BIT(1),            /* 1 = LEVEL 4 LOCK HELD     */
*        4  CRALEV03 BIT(1),            /* 1 = LEVEL 3 LOCK HELD     */
*        4  CRALEV02 BIT(1),            /* 1 = LEVEL 2 LOCK HELD     */
*        4  CRALEV01 BIT(1),            /* 1 = LEVEL 1 LOCK HELD     */
*      3 CRAL1PTR PTR(31),              /* PTR TO LEVEL 1 LOCK       */
*      3 CRAL2PTR PTR(31),              /* PTR TO LEVEL 2 LOCK       */
*      3 CRAL3PTR PTR(31),              /* PTR TO LEVEL 3 LOCK       */
*      3 CRAL4PTR PTR(31),              /* PTR TO LEVEL 4 LOCK       */
*      3 CRAL5PTR PTR(31),              /* PTR TO LEVEL 5 LOCK       */
*      3 CRAL6PTR PTR(31),              /* PTR TO LEVEL 6 LOCK       */
*      3 CRAL7PTR PTR(31),              /* PTR TO LEVEL 7 LOCK       */
*      3 CRAL8PTR PTR(31),              /* PTR TO LEVEL 8 LOCK       */
*      3 CRAL9PTR PTR(31),              /* PTR TO LEVEL 9 LOCK       */
*      3 CRALAPTR PTR(31),              /* RESERVED                  */
*/*                                                                  */
*/*   VS1/VS2 EXTENSION                                              */
*/*                                                                  */
*     2  CRARPH CHAR(LENGTH(ISTRPH)),   /* RPH ASSOCIATED WITH     2494
*                                          THIS CRH                  */
*     2  CRAPSS CHAR(LENGTH(ISTAPCRR)), /* PSS CRR                   */
*     2  CRAPROCR CHAR(LENGTH(ISTZCRR)) BDY(DWORD), /* PROCESS CRR   */
*     2  CRASVC CHAR(72) BDY(WORD),     /* SERVICE RTN CRA           */
*        3  CRAASCRR CHAR(LENGTH(ISTASCRR)), /* CRR FOR SMS          */
*        3  CRAHSIZ  PTR(31),           /* HEADER SIZE QUED SMS REQ  */
*        3  CRAMASK  PTR(31),           /* PREFIX MASK QUED SMS REQ  */
*        3  CRABUFA  FIXED(31),         /* BUFF QUE FOR FBQ ALLOCATION*
*           4 CRABFTBA BIT(1),          /* NO BUFFERS ALLOCATED YET   *
*     2  CRARSV01 PTR(31),              /* RESERVED                  */
*     2  CRARSV02 PTR(31),              /* RESERVED                  */
*     2  CRACHAIN PTR(31);              /* CHAIN FIELD USED TO QUEUE
*                                          CRA TO PREALLOCATE QUEUE
*                                          WHEN NOT IN USE           */
*DCL CRALMS32 BIT(32) CONSTANT('80000000'X); /* 32ND LEVEL LOCK MASK */
*DCL CRALMS31 BIT(32) CONSTANT('40000000'X); /* 31ST LEVEL LOCK MASK */
*DCL CRALMS30 BIT(32) CONSTANT('20000000'X); /* 30TH LEVEL LOCK MASK */
*DCL CRALMS29 BIT(32) CONSTANT('10000000'X); /* 29TH LEVEL LOCK MASK */
*DCL CRALMS28 BIT(32) CONSTANT('08000000'X); /* 28TH LEVEL LOCK MASK */
*DCL CRALMS27 BIT(32) CONSTANT('04000000'X); /* 27TH LEVEL LOCK MASK */
*DCL CRALMS26 BIT(32) CONSTANT('02000000'X); /* 26TH LEVEL LOCK MASK */
*DCL CRALMS25 BIT(32) CONSTANT('01000000'X); /* 25TH LEVEL LOCK MASK */
*DCL CRALMS24 BIT(32) CONSTANT('00800000'X); /* 24TH LEVEL LOCK MASK */
*DCL CRALMS23 BIT(32) CONSTANT('00400000'X); /* 23RD LEVEL LOCK MASK */
*DCL CRALMS22 BIT(32) CONSTANT('00200000'X); /* 22ND LEVEL LOCK MASK */
*DCL CRALMS21 BIT(32) CONSTANT('00100000'X); /* 21ST LEVEL LOCK MASK */
*DCL CRALMS20 BIT(32) CONSTANT('00080000'X); /* 20TH LEVEL LOCK MASK */
*DCL CRALMS19 BIT(32) CONSTANT('00040000'X); /* 19TH LEVEL LOCK MASK */
*DCL CRALMS18 BIT(32) CONSTANT('00020000'X); /* 18TH LEVEL LOCK MASK */
*DCL CRALMS17 BIT(32) CONSTANT('00010000'X); /* 17TH LEVEL LOCK MASK */
*DCL CRALMS16 BIT(32) CONSTANT('00008000'X); /* 16TH LEVEL LOCK MASK */
*DCL CRALMS15 BIT(32) CONSTANT('00004000'X); /* 15TH LEVEL LOCK MASK */
*DCL CRALMS14 BIT(32) CONSTANT('00002000'X); /* 14TH LEVEL LOCK MASK */
*DCL CRALMS13 BIT(32) CONSTANT('00001000'X); /* 13TH LEVEL LOCK MASK */
*DCL CRALMS12 BIT(32) CONSTANT('00000800'X); /* 12TH LEVEL LOCK MASK */
*DCL CRALMS11 BIT(32) CONSTANT('00000400'X); /* 11TH LEVEL LOCK MASK */
*DCL CRALMS10 BIT(32) CONSTANT('00000200'X); /* 10TH LEVEL LOCK MASK */
*DCL CRALMS09 BIT(32) CONSTANT('00000100'X); /* 9TH LEVEL LOCK MASK  */
*DCL CRALMS08 BIT(32) CONSTANT('00000080'X); /* 8TH LEVEL LOCK MASK  */
*DCL CRALMS07 BIT(32) CONSTANT('00000040'X); /* 7TH LEVEL LOCK MASK  */
*DCL CRALMS06 BIT(32) CONSTANT('00000020'X); /* 6TH LEVEL LOCK MASK  */
*DCL CRALMS05 BIT(32) CONSTANT('00000010'X); /* 5TH LEVEL LOCK MASK  */
*DCL CRALMS04 BIT(32) CONSTANT('00000008'X); /* 4TH LEVEL LOCK MASK  */
*DCL CRALMS03 BIT(32) CONSTANT('00000004'X); /* 3RD LEVEL LOCK MASK  */
*DCL CRALMS02 BIT(32) CONSTANT('00000002'X); /* 2ND LEVEL LOCK MASK  */
*DCL CRALMS01 BIT(32) CONSTANT('00000001'X); /* 1ST LEVEL LOCK MASK  */
*DCL CRACRA   CHAR(4) CONSTANT('CRA ');      /* CHARACTER C.B. ID    */
* /*  CONNECTION SERVICES COMPONENT RECOVERY RECORD                  */
* /* COMPLETED DCR SOLUTIONS                                         */
* /* 1H0540 APRIL 28, 1973 MB                                        */
*/* ZTR4417 JUNE 20, 73 DNM */                                     2528
* DCL 1 ISTCNSTA BDY(WORD) BASED,       /* CONNECTION SERVICES     2528
*                                          COMPONENT RECOVERY RECORD */
*     2  CNSTPFX CHAR(LENGTH(ISTPFCRR)), /* STANDARD PREFIX        2528
*                                          FOR CRR                   */
*     2  CNSTFLDA CHAR(3),              /* TRACE FIELD A - HISTORY   */
*        3  CNSMRINA BIT(1),            /* MASTER ENTERED            */
*        3  CNSAUTHA BIT(1),            /* ABOUT TO CALL AUTHORI-  2528
*                                          SATION EXIT       ZTR4417 */
*        3  CNSAQINA BIT(1),            /* ACQUIRE ENTERED           */
*        3  CNSXREQA BIT(1),            /* ACQUIRE SATISFIED         */
*        3  CNSQREQA BIT(1),            /* ACQUIRE QUEUED            */
*        3  CNSRLINA BIT(1),            /* RELEASE ENTERED           */
*        3  CNSDORLA BIT(1),            /* DOREL REALLOCATION      2528
*                                          ENTERED                   */
*        3  CNSTRRLA BIT(1),            /* RELEASE OF ACTIVE       2528
*                                          CONNECTION                */
*        3  CNSRQRLA BIT(1),            /* RELEASE QUEUED REQUEST    */
*        3  CNSPSINA BIT(1),            /* PASS ENTERED              */
*        3  CNSACINA BIT(1),            /* ACCEPT ENTERED            */
*        3  CNSLGINA BIT(1),            /* LOGON ENTERED             */
*        3  CNSGBINA BIT(1),            /* PREEMPT ENTERED           */
*        3  CNSCLINA BIT(1),            /* CANCEL ENTERED            */
*        3  CNSCLAQA BIT(1),            /* CANCEL ACQUIRES           */
*        3  CNSTCONA BIT(1),            /* TCONNECT                  */
*        3  CNSACONA BIT(1),            /* ACONNECT                  */
*        3  CNSQUEUA BIT(1),            /* QUEUE                     */
*        3  CNSSEARA BIT(1),            /* SEARCH Q                  */
*        3  CNSGETSA BIT(1),            /* CONNECTION SERVICES     2528
*                                          GETSTORE                  */
*        3  CNSFREEA BIT(1),            /* CONNECTION SERVICES     2528
*                                          FREESTORE                 */
*        3  CNSACCTA BIT(1),            /* ABOUT TO CALL           2528
*                                          ACCOUNTING EXIT           */
*        3  CNSLOG0A BIT(1),            /* LOGON 0                   */
*        3  CNSRSV01 BIT(1),            /* RESERVED                  */
*     2  CNSTFLDB CHAR(3),              /* TRACE FIELD B -         2528
*                                          CURRENT ACTIVITY          */
*        3  CNSMRINB BIT(1),                                       2528
*        3  CNSAUTHB BIT(1),                                       2528
*        3  CNSAQINB BIT(1),                                       2528
*        3  CNSXREQB BIT(1),                                       2528
*        3  CNSQREQB BIT(1),                                       2528
*        3  CNSRLINB BIT(1),                                       2528
*        3  CNSDORLB BIT(1),                                       2528
*        3  CNSTRRLB BIT(1),                                       2528
*        3  CNSRQRLB BIT(1),                                       2528
*        3  CNSPSINB BIT(1),                                       2528
*        3  CNSACINB BIT(1),                                       2528
*        3  CNSLGINB BIT(1),                                       2528
*        3  CNSGBINB BIT(1),                                       2528
*        3  CNSCLINB BIT(1),                                       2528
*        3  CNSCLAQB BIT(1),                                       2528
*        3  CNSTCONB BIT(1),                                       2528
*        3  CNSACONB BIT(1),                                       2528
*        3  CNSQUEUB BIT(1),                                       2528
*        3  CNSSEARB BIT(1),                                       2528
*        3  CNSGETSB BIT(1),                                       2528
*        3  CNSFREEB BIT(1),                                       2528
*        3  CNSACCTB BIT(1),                                       2528
*        3  CNSLOG0B BIT(1),                                       2528
*        3  CNSRSV05 BIT(1);                                       2528
*/*    CRR FOR VARY                                                  */
*/*  REVISIONS                                         009 03/24/75  */
*/*                                                                  */
* DCL 1 ISTVYCRR BDY(WORD) BASED,       /* CRR FOR SSCP              */
*     2  VYCCNS   CHAR(LENGTH(ISTCNSTA)), /* RESERVE SPACE FOR     2529
*                                          CONN. SVCS. AUDIT         */
*     2  VYCAUDIT,                      /* AUDIT TRAIL FOR SSCP      */
*        3  VYCNTRD CHAR(12),           /* LIST OF MODULES IN SSCP   */
*                                       /* 1 = ENTERED               */
*           4  NINCCL BIT(1),           /* MODULE = ISTINCCL         */
*           4  NINCIO BIT(1),           /* MODULE = ISTINCIO         */
*           4  NINCDL BIT(1),           /* MODULE = ISTINCDL         */
*           4  NINCMY BIT(1),           /* MODULE = ISTINCMY         */
*           4  NINCMD BIT(1),           /* MODULE = ISTINCMD         */
*           4  NINCVI BIT(1),           /* MODULE = ISTINCVI         */
*           4  NINCVA BIT(1),           /* MODULE = ISTINCVA         */
*           4  NINCLF BIT(1),           /* MODULE = ISTINCLF         */
*           4  NINCR1 BIT(1),           /* MODULE = ISTINCR1         */
*           4  NINCSM BIT(1),           /* MODULE = ISTINCSM         */
*           4  NINCFS BIT(1),           /* MODULE = ISTINCFS         */
*           4  NINCVX BIT(1),           /* MODULE = ISTINCVX         */
*           4  NINCVP BIT(1),           /* MODULE = ISTINCVP         */
*           4  NINCVS BIT(1),           /* MODULE = ISTINCVS         */
*           4  NINCVN BIT(1),           /* MODULE = ISTINCVO         */
*           4  NINCMS BIT(1),           /* MODULE = ISTINCMS         */
*           4  NINCR2 BIT(1),           /* MODULE = ISTINCR2         */
*           4  NINCIP BIT(1),           /* MODULE = ISTINCIP         */
*           4  NINCD1 BIT(1),           /* MODULE = ISTINCD1         */
*           4  NINCD2 BIT(1),           /* MODULE = ISTINCD2         */
*           4  NINCD3 BIT(1),           /* MODULE = ISTINCD3         */
*           4  NINCD4 BIT(1),           /* MODULE = ISTINCD4         */
*           4  NINCD5 BIT(1),           /* MODULE = ISTINCD5         */
*           4  NINCD6 BIT(1),           /* MODULE = ISTINCD6         */
*           4  NINCD7 BIT(1),           /* MODULE = ISTINCD7         */
*           4  NINCD8 BIT(1),           /* MODULE = ISTINCD8         */
*           4  NINCD9 BIT(1),           /* MODULE = ISTINCD9         */
*           4  NINCE0 BIT(1),           /* MODULE = ISTINCE0         */
*           4  NINCE2 BIT(1),           /* MODULE = ISTINCE2         */
*           4  NINCE3 BIT(1),           /* MODULE = ISTINCE3         */
*           4  NINCE4 BIT(1),           /* MODULE = ISTINCE4         */
*           4  NINCFM BIT(1),           /* MODULE = ISTINCFM         */
*           4  NINCF1 BIT(1),           /* MODULE = ISTINCF1         */
*           4  NINCF3 BIT(1),           /* MODULE = ISTINCF3         */
*           4  NINCF4 BIT(1),           /* MODULE = ISTINCF4         */
*           4  NINCL0 BIT(1),           /* MODULE = ISTINCL0         */
*           4  NINCL1 BIT(1),           /* MODULE = ISTINCL1         */
*           4  NINCL2 BIT(1),           /* MODULE = ISTINCL2         */
*           4  NINCL3 BIT(1),           /* MODULE = ISTINCL3         */
*           4  NINCL4 BIT(1),           /* MODULE = ISTINCL4         */
*           4  NINCL5 BIT(1),           /* MODULE = ISTINCL5         */
*           4  NINCL6 BIT(1),           /* MODULE = ISTINCL6         */
*           4  NINCL7 BIT(1),           /* MODULE = ISTINCL7         */
*           4  NINCL8 BIT(1),           /* MODULE = ISTINCL8         */
*           4  NINCS1 BIT(1),           /* MODULE = ISTINCS1         */
*           4  NINCUM BIT(1),           /* MODULE = ISTINCUM         */
*           4  NINCU0 BIT(1),           /* MODULE = ISTINCU0          *
*           4  NINCU1 BIT(1),           /* MODULE = ISTINCU1         */
*           4  NINCU2 BIT(1),           /* MODULE = ISTINCU2         */
*           4  NINCU3 BIT(1),           /* MODULE = ISTINCU3         */
*           4  NINCU4 BIT(1),           /* MODULE = ISTINCU4         */
*           4  NINCU5 BIT(1),           /* MODULE = ISTINCU5         */
*           4  NINCU6 BIT(1),           /* MODULE = ISTINCU6         */
*           4  NINCU7 BIT(1),           /* MODULE = ISTINCU7         */
*           4  NINCU8 BIT(1),           /* MODULE = ISTINCU8         */
*           4  NINCV2 BIT(1),           /* MODULE = ISTINCV2         */
*           4  NINCV3 BIT(1),           /* MODULE = ISTINCV3         */
*           4  NINCV4 BIT(1),           /* MODULE = ISTINCV4         */
*           4  NINCV5 BIT(1),           /* MODULE = ISTINCV5         */
*           4  NINCV6 BIT(1),           /* MODULE = ISTINCV6         */
*           4  NINCV7 BIT(1),           /* MODULE = ISTINCV7         */
*           4  NINCV8 BIT(1),           /* MODULE = ISTINCV8         */
*           4  NINCV9 BIT(1),           /* MODULE = ISTINCV9         */
*           4  NINCW0 BIT(1),           /* MODULE = ISTINCW0         */
*           4  NINCW2 BIT(1),           /* MODULE = ISTINCW2         */
*           4  NINCW4 BIT(1),           /* MODULE = ISTINCW4         */
*           4  NINCW5 BIT(1),           /* MODULE = ISTINCW5         */
*           4  NINCW6 BIT(1),           /* MODULE = ISTINCW6         */
*           4  NINCW7 BIT(1),           /* MODULE = ISTINCW7         */
*           4  NINCW8 BIT(1),           /* MODULE = ISTINCW8         */
*           4  NINCW9 BIT(1),           /* MODULE = ISTINCW9         */
*           4  NINCX0 BIT(1),           /* MODULE = ISTINCX0         */
*           4  NINCX1 BIT(1),           /* MODULE = ISTINCX1         */
*           4  NINCX2 BIT(1),           /* MODULE = ISTINCX2         */
*           4  NINCX3 BIT(1),           /* MODULE = ISTINCX3         */
*           4  NINCX6 BIT(1),           /* MODULE = ISTINCX6         */
*           4  NINCX7 BIT(1),           /* MODULE = ISTINCX7         */
*           4  NINCX8 BIT(1),           /* MODULE = ISTINCX8         */
*           4  NINCX9 BIT(1),           /* MODULE = ISTINCX9         */
*           4  NINCUA BIT(1),           /* MODULE = ISTINCUA         */
*           4  NINCUB BIT(1),           /* MODULE = ISTINCUB         */
*           4  NINCUQ BIT(1),           /* MODULE = ISTINCUQ         */
*           4  NINCE1 BIT(1),           /* MODULE = ISTINCE1         */
*           4  NINCE5 BIT(1),           /* MODULE = ISTINCE5         */
*           4  NINCE6 BIT(1),           /* MODULE = ISTINCE6         */
*           4  NINCE7 BIT(1),           /* MODULE = ISTINCE7         */
*           4  NINCE8 BIT(1),           /* MODULE = ISTINCE8         */
*           4  NINCR3 BIT(1),           /* MODULE = ISTINCR3         */
*           4  NINCR5 BIT(1),           /* MODULE = ISTINCR5         */
*           4  NINCVO BIT(1),           /* MODULE = ISTINCVO         */
*           4  NINCE9 BIT(1),           /* MODULE = ISTINCE9         */
*           4  NINCFE BIT(1),           /* MODULE = ISTINCFE         */
*           4  VYCRSV01 BIT(4),         /* RESERVED                  */
*        3  VYCCRT CHAR(12),            /* LIST OF SSCP MODULES      */
*                                       /* 2 =  RUNNING              */
*           4  CINCCL BIT(1),           /* MODULE = ISTINCCL         */
*           4  CINCIO BIT(1),           /* MODULE = ISTINCIO         */
*           4  CINCDL BIT(1),           /* MODULE = ISTINCDL         */
*           4  CINCMY BIT(1),           /* MODULE = ISTINCMY         */
*           4  CINCMD BIT(1),           /* MODULE = ISTINCMD         */
*           4  CINCVI BIT(1),           /* MODULE = ISTINCVI         */
*           4  CINCVA BIT(1),           /* MODULE = ISTINCVA         */
*           4  CINCLF BIT(1),           /* MODULE = ISTINCLF         */
*           4  CINCR1 BIT(1),           /* MODULE = ISTINCR1         */
*           4  CINCSM BIT(1),           /* MODULE = ISTINCSM         */
*           4  CINCFS BIT(1),           /* MODULE = ISTINCFS         */
*           4  CINCVX BIT(1),           /* MODULE = ISTINCVX         */
*           4  CINCVP BIT(1),           /* MODULE = ISTINCVP         */
*           4  CINCVS BIT(1),           /* MODULE = ISTINCVS         */
*           4  CINCVN BIT(1),           /* MODULE = ISTINCVO         */
*           4  CINCMS BIT(1),           /* MODULE = ISTINCMS         */
*           4  CINCR2 BIT(1),           /* MODULE = ISTINCR2         */
*           4  CINCIP BIT(1),           /* MODULE = ISTINCIP         */
*           4  CINCD1 BIT(1),           /* MODULE = ISTINCD1         */
*           4  CINCD2 BIT(1),           /* MODULE = ISTINCD2         */
*           4  CINCD3 BIT(1),           /* MODULE = ISTINCD3         */
*           4  CINCD4 BIT(1),           /* MODULE = ISTINCD4         */
*           4  CINCD5 BIT(1),           /* MODULE = ISTINCD5         */
*           4  CINCD6 BIT(1),           /* MODULE = ISTINCD6         */
*           4  CINCD7 BIT(1),           /* MODULE = ISTINCD7         */
*           4  CINCD8 BIT(1),           /* MODULE = ISTINCD8         */
*           4  CINCD9 BIT(1),           /* MODULE = ISTINCD9         */
*           4  CINCE0 BIT(1),           /* MODULE = ISTINCE0         */
*           4  CINCE2 BIT(1),           /* MODULE = ISTINCE2         */
*           4  CINCE3 BIT(1),           /* MODULE = ISTINCE3         */
*           4  CINCE4 BIT(1),           /* MODULE = ISTINCE4         */
*           4  CINCFM BIT(1),           /* MODULE = ISTINCFM         */
*           4  CINCF1 BIT(1),           /* MODULE = ISTINCF1         */
*           4  CINCF3 BIT(1),           /* MODULE = ISTINCF3         */
*           4  CINCF4 BIT(1),           /* MODULE = ISTINCF4         */
*           4  CINCL0 BIT(1),           /* MODULE = ISTINCL0         */
*           4  CINCL1 BIT(1),           /* MODULE = ISTINCL1         */
*           4  CINCL2 BIT(1),           /* MODULE = ISTINCL2         */
*           4  CINCL3 BIT(1),           /* MODULE = ISTINCL3         */
*           4  CINCL4 BIT(1),           /* MODULE = ISTINCL4         */
*           4  CINCL5 BIT(1),           /* MODULE = ISTINCL5         */
*           4  CINCL6 BIT(1),           /* MODULE = ISTINCL6         */
*           4  CINCL7 BIT(1),           /* MODULE = ISTINCL7         */
*           4  CINCL8 BIT(1),           /* MODULE = ISTINCL8         */
*           4  CINCS1 BIT(1),           /* MODULE = ISTINCS1         */
*           4  CINCUM BIT(1),           /* MODULE = ISTINCUM         */
*           4  CINCU0 BIT(1),           /* MODULE = ISTINCU0          *
*           4  CINCU1 BIT(1),           /* MODULE = ISTINCU1         */
*           4  CINCU2 BIT(1),           /* MODULE = ISTINCU2         */
*           4  CINCU3 BIT(1),           /* MODULE = ISTINCU3         */
*           4  CINCU4 BIT(1),           /* MODULE = ISTINCU4         */
*           4  CINCU5 BIT(1),           /* MODULE = ISTINCU5         */
*           4  CINCU6 BIT(1),           /* MODULE = ISTINCU6         */
*           4  CINCU7 BIT(1),           /* MODULE = ISTINCU7         */
*           4  CINCU8 BIT(1),           /* MODULE = ISTINCU8         */
*           4  CINCV2 BIT(1),           /* MODULE = ISTINCV2         */
*           4  CINCV3 BIT(1),           /* MODULE = ISTINCV3         */
*           4  CINCV4 BIT(1),           /* MODULE = ISTINCV4         */
*           4  CINCV5 BIT(1),           /* MODULE = ISTINCV5         */
*           4  CINCV6 BIT(1),           /* MODULE = ISTINCV6         */
*           4  CINCV7 BIT(1),           /* MODULE = ISTINCV7         */
*           4  CINCV8 BIT(1),           /* MODULE = ISTINCV8         */
*           4  CINCV9 BIT(1),           /* MODULE = ISTINCV9         */
*           4  CINCW0 BIT(1),           /* MODULE = ISTINCW0         */
*           4  CINCW2 BIT(1),           /* MODULE = ISTINCW2         */
*           4  CINCW4 BIT(1),           /* MODULE = ISTINCW4         */
*           4  CINCW5 BIT(1),           /* MODULE = ISTINCW5         */
*           4  CINCW6 BIT(1),           /* MODULE = ISTINCW6         */
*           4  CINCW7 BIT(1),           /* MODULE = ISTINCW7         */
*           4  CINCW8 BIT(1),           /* MODULE = ISTINCW8         */
*           4  CINCW9 BIT(1),           /* MODULE = ISTINCW9         */
*           4  CINCX0 BIT(1),           /* MODULE = ISTINCX0         */
*           4  CINCX1 BIT(1),           /* MODULE = ISTINCX1         */
*           4  CINCX2 BIT(1),           /* MODULE = ISTINCX2         */
*           4  CINCX3 BIT(1),           /* MODULE = ISTINCX3         */
*           4  CINCX6 BIT(1),           /* MODULE = ISTINCX6         */
*           4  CINCX7 BIT(1),           /* MODULE = ISTINCX7         */
*           4  CINCX8 BIT(1),           /* MODULE = ISTINCX8         */
*           4  CINCX9 BIT(1),           /* MODULE = ISTINCX9         */
*           4  CINCUA BIT(1),           /* MODULE = ISTINCUA         */
*           4  CINCUB BIT(1),           /* MODULE = ISTINCUB         */
*           4  CINCUQ BIT(1),           /* MODULE = ISTINCUQ         */
*           4  CINCE1 BIT(1),           /* MODULE = ISTINCE1         */
*           4  CINCE5 BIT(1),           /* MODULE = ISTINCE5         */
*           4  CINCE6 BIT(1),           /* MODULE = ISTINCE6         */
*           4  CINCE7 BIT(1),           /* MODULE = ISTINCE7         */
*           4  CINCE8 BIT(1),           /* MODULE = ISTINCE8         */
*           4  CINCR3 BIT(1),           /* MODULE = ISTINCR3         */
*           4  CINCR5 BIT(1),           /* MODULE = ISTINCR5         */
*           4  CINCVO BIT(1),           /* MODULE = ISTINCVO         */
*           4  CINCE9 BIT(1),           /* MODULE = ISTINCE9         */
*           4  CINCFE BIT(1),           /* MODULE = ISTINCFE         */
*           4  VYCRSV03 BIT(4),         /* RESERVED                  */
*     2  VYCRRSAV CHAR(72),             /* SAVE AREA USED BY ISTINCIP*/
*                                       /* TO CALL ISTINCW3          */
*     2  VYCRRCW3 CHAR(8),              /* PARAM LIST USED BY        */
*                                       /* ISTINCIP TO CALL ISTINCW3 */
*     2  VYCRSV04 CHAR(2),              /* RESERVED                  */
*     2  VYCRSV02 PTR(31);              /* RESERVED                  */
*DCL TIDINCDL BIT(8) CONSTANT('00'X);   /* THREAD ID FOR ISTINCDL    */
*DCL TIDINCMY BIT(8) CONSTANT('01'X);   /* THREAD ID FOR ISTINCMY    */
*DCL TIDINCCL BIT(8) CONSTANT('02'X);   /* THREAD ID FOR ISTINCCL    */
*DCL TIDINCFE BIT(8) CONSTANT('04'X);   /* THREAD ID FOR ISTINCFE    */
*/* TEMPLATE FOR CHAIN FIELD OF WORK ELEMENT */                    2534
*DCL  1  ISTWKE BDY(WORD) BASED(WKEPTR),                           2534
*        2  * CHAR(4),                 /* SPACE                       *
*        2  WKECHAIN PTR(31),          /* CHAIN POINTER               *
*           3 WKEFLAGS BIT(8),         /* FLAGS                       *
*             4 WKEGATE  BIT(1),       /* GATE BIT                    *
*             4 *        BIT(7),       /* RESERVED                    *
*           3 WKECHNGP PTR(24);        /* PTR ADDRESS                 *
* DCL ISTAPC34 ENTRY BASED(ATCAP34) VALRG(*); /*RESET ROUTINE*/    2535
* DCL ISTAPC37 ENTRY BASED(ATCAP37) VALRG(*); /*TPQUE ROUTINE*/    2536
*                                                                  2536
* DECLARE                                                          2537
*   EMCR0 PTR REG(0),                                              2537
*   EMCR1 PTR REG(1),                                              2537
*   EMCR2 PTR REG(2),                                              2537
*   EMCR3 PTR REG(3),                                              2537
*   EMCR4 PTR REG(4),                                              2537
*   EMCR5 PTR REG(5),                                              2537
*   EMCR6 PTR REG(6),                                              2537
*   EMCR7 PTR REG(7),                                              2537
*   EMCR8 PTR REG(8),                                              2537
*   EMCR9 PTR REG(9),                                              2537
*   EMCR10 PTR REG(10),                                            2537
*   EMCR11 PTR REG(11),                                            2537
*   EMCR12 PTR REG(12),                                            2537
*   EMCR13 PTR REG(13),                                            2537
*   EMCR14 PTR REG(14),                                            2537
*   EMCR15 PTR REG(15);                                            2537
*                                                                  2537
* DECLARE                                                          2538
*   ISTSDCCA ENTRY BASED(ATCCDADD) VALRG(*), /*CIDCTL ADD ROUTINE*/
*   ISTSDCCD ENTRY BASED(ATCCDDEL) VALRG(*), /*CIDCTL DELETE ROUTINE*/
*   ISTSDCCF ENTRY BASED(ATCCDFND) VALRG(*), /*CIDCTL FIND ROUTINE*/
*   ISTSDCCN ENTRY BASED(ATCCDFDN) VALRG(*), /*CIDCTL FIND NCB ROUTINE*
*   ISTSDCCR ENTRY BASED(ATCCDFIN) VALRG(*); /*CIDCTL FINISH ROUTINE*/
*   DCL CMZCIDM FIXED(15) DEFINED(ATCCIDM); /*CIDMASK ALIAS*/      2539
* GEN (PRINT ON);                                                  2540
         PRINT ON
*/* END OF TPEPILOG */                                             2541
*END ISTINCCL                                                      2541
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.      *
*/*%INCLUDE SYSLIB  (CVT     )                                        *
*/*%INCLUDE SYSLIB  (IEZIOB  )                                        *
*/*%INCLUDE SYSLIB  (IECDIOSB)                                        *
*/*%INCLUDE SYSLIB  (IHASRB  )                                        *
*;                                                                 2541
@EL00001 DS    0H                                                  2541
@EF00001 DS    0H                                                  2541
@ER00001 BR    @14                                                 2541
@DATA    DS    0H
@CH00062 DC    H'1'
@CH00708 DC    H'9'
@DATD    DSECT
         DS    0F
ISTINCCL CSECT
         DS    0F
@CF00060 DC    F'8'
@CF00802 DC    F'16'
@CF01905 DC    F'72'
@CF04696 DC    F'-8'
@CF01354 DC    XL4'08000000'
@CF01358 DC    XL4'04000000'
@CF01393 DC    XL4'7FFFFFFF'
@CF01395 DC    XL4'80000000'
@CF04783 DC    XL4'00FFFFFF'
@CF05852 DC    XL4'0000FFFF'
@CF05859 DC    BL4'11101111111111111111111111111111'
@DATD    DSECT
         DS    0D
CCLWRK   DS    CL127
         ORG   CCLWRK
CCLSAVE1 DS    AL4
CCLSAVE2 DS    AL4
CCLSAVE3 DS    AL4
CCLSAVE4 DS    AL4
CCLSAVE5 DS    AL4
CCLSAVE6 DS    AL4
CCLSAVE7 DS    AL4
CCLSAVE8 DS    AL4
CCLSAVE9 DS    AL4
CCLSAV10 DS    AL4
CCLSAV11 DS    AL4
CCLSAV12 DS    AL4
CCLSAV13 DS    AL4
CCLSAV14 DS    AL4
CCLSAV15 DS    AL4
CCLSAV16 DS    AL4
CCLSAVEA DS    AL4
CCLSAVEB DS    AL4
FORCERPH DS    AL4
SAVETPQR DS    AL4
CCLRPT   DS    AL4
CCLNTUS  DS    AL4
CCLNCB   DS    AL4
CCLENT   DS    BL1
CCLCID   DS    CL4
         ORG   CCLCID
CCLSAF   DS    CL2
CCLDAF   DS    CL2
         ORG   CCLWRK+97
CCLMSGID DS    CL4
CCLPRG   DS    CL1
CCLRUIBF DS    CL14
         ORG   CCLRUIBF
RUBYT1   DS    BL1
RUBYT2   DS    BL1
RUNAME   DS    CL7
RUCHAR   DS    CL5
         ORG   CCLWRK+116
CCLRUOBF DS    CL9
         ORG   CCLRUOBF
RUACTPHY DS    CL9
         ORG   RUACTPHY
RUSDT    DS    BL1
         ORG   CCLWRK+125
CCLSWS   DS    BL2
         ORG   CCLSWS
CCLSW1   DS    BL1
CCLSW2   EQU   CCLSWS+0
CCLSW3   EQU   CCLSWS+0
CCLSWW   EQU   CCLSWS+0
CCLQUIT  EQU   CCLSWS+0
CCLLOOP  EQU   CCLSWS+0
CCLLOOP2 EQU   CCLSWS+0
CCLNSTR  EQU   CCLSWS+0
CCLREQ   DS    BL1
CCLLCK   EQU   CCLSWS+1
CCLSWN   EQU   CCLSWS+1
CCLDISC  EQU   CCLSWS+1
@NM00076 EQU   CCLSWS+1
         ORG   CCLWRK+127
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA
@ENDDATD EQU   *
ISTINCCL CSECT
         DS    0F
@SIZDATD DC    AL1(0)
         DC    AL3(@ENDDATD-@DATD)
@CV04851 DC    V(ISTINCIO)
         DS    0D
@CC03457 DC    C'RECORD  '
@CC03459 DC    C'ISTYPSOL'
@CC04628 DC    C'VARY    '
@CC04646 DC    C'ISTYSSCP'
@CC04612 DC    C'619I'
@CC04614 DC    C'621I'
@CC04616 DC    C'129I'
@CC04618 DC    C'414I'
@CC04620 DC    C'676I'
@CC04622 DC    C'620I'
@CC04624 DC    C'031I'
@CC04626 DC    C'034I'
@CB02052 DC    X'0001'
@CB02056 DC    X'0004'
@CB02058 DC    X'0080'
@CB02066 DC    X'0012'
@CB02068 DC    X'0032'
@CB02070 DC    X'FFF8'
@CB02072 DC    X'0008'
@CB02076 DC    X'0100'
@CB02080 DC    X'0400'
@CB02111 DC    X'0802'
@CB02113 DC    X'1002'
@CB02161 DC    X'F01A'
@CB02178 DC    X'D001'
@CB02186 DC    X'D005'
@CB02246 DC    X'FFFF'
@CB02252 DC    X'0043'
@CB02256 DC    X'0045'
@00      EQU   00                      EQUATES FOR REGISTERS 0-15
@01      EQU   01
@02      EQU   02
@03      EQU   03
@04      EQU   04
@05      EQU   05
@06      EQU   06
@07      EQU   07
@08      EQU   08
@09      EQU   09
@10      EQU   10
@11      EQU   11
@12      EQU   12
@13      EQU   13
@14      EQU   14
@15      EQU   15
GPR00F   EQU   @00
GPR00P   EQU   @00
GPR01F   EQU   @01
GPR01P   EQU   @01
GPR02F   EQU   @02
GPR02P   EQU   @02
GPR03F   EQU   @03
GPR03P   EQU   @03
GPR04F   EQU   @04
GPR04P   EQU   @04
GPR05F   EQU   @05
GPR05P   EQU   @05
GPR06F   EQU   @06
GPR14F   EQU   @14
GPR14P   EQU   @14
GPR15F   EQU   @15
GPR15P   EQU   @15
RPHPTR   EQU   @01
LDPRMPTR EQU   @01
CCLR0    EQU   @00
CCLR1    EQU   @01
CCLR2    EQU   @02
CCLTPQR  EQU   @02
CIDREG   EQU   @02
CCLWKPT  EQU   @03
CCLNCSPL EQU   @04
WKPT1    EQU   @06
WKPT2    EQU   @07
WKPT3    EQU   @10
WKPT5    EQU   @08
CCLSV    EQU   @13
CCLR15   EQU   @15
CCLRDT   EQU   @05
CCLR14   EQU   @14
CMZK0011 EQU   @01
CMZK0033 EQU   @01
CMZK0132 EQU   @01
EMCR2    EQU   @02
EMCR3    EQU   @03
REG1141  EQU   @01
EMCR13   EQU   @13
REG15141 EQU   @15
REG1150  EQU   @01
REG15150 EQU   @15
EMCR0    EQU   @00
EMCR1    EQU   @01
EMCR10   EQU   @10
EMCR11   EQU   @11
EMCR12   EQU   @12
EMCR14   EQU   @14
EMCR15   EQU   @15
EMCR4    EQU   @04
EMCR5    EQU   @05
EMCR6    EQU   @06
EMCR7    EQU   @07
EMCR8    EQU   @08
EMCR9    EQU   @09
GPR06P   EQU   @06
GPR07F   EQU   @07
GPR07P   EQU   @07
GPR08F   EQU   @08
GPR08P   EQU   @08
GPR09F   EQU   @09
GPR09P   EQU   @09
GPR10F   EQU   @10
GPR10P   EQU   @10
GPR11F   EQU   @11
GPR11P   EQU   @11
GPR12F   EQU   @12
GPR12P   EQU   @12
GPR13F   EQU   @13
GPR13P   EQU   @13
ATCLCPTR EQU   1032
CVTMAP   EQU   0
CVTDAR   EQU   CVTMAP+72
CVTFLGS1 EQU   CVTDAR
CVTDCB   EQU   CVTMAP+116
CVTIERLC EQU   CVTMAP+144
CVTOPTA  EQU   CVTMAP+182
CVTOPTB  EQU   CVTMAP+183
CVTGTF   EQU   CVTMAP+236
CVTGTFST EQU   CVTGTF
CVTGTFS  EQU   CVTGTFST
CVTSTATE EQU   CVTGTFST
CVTTMODE EQU   CVTGTFST
CVTFORM  EQU   CVTGTFST
CVTAQAVT EQU   CVTMAP+240
CVTTCMFG EQU   CVTAQAVT
CVTVOLM2 EQU   CVTMAP+244
CVTTATA  EQU   CVTVOLM2
CVTTSKS  EQU   CVTTATA
CVTVOLF2 EQU   CVTTSKS
CVTTAT   EQU   CVTTATA+1
CVTATER  EQU   CVTMAP+248
CVTEXT1  EQU   CVTMAP+252
CVTPURG  EQU   CVTMAP+260
CVTQMSG  EQU   CVTMAP+268
CVTDMSR  EQU   CVTMAP+272
CVTRSV37 EQU   CVTDMSR
CVTDMSRF EQU   CVTRSV37
CVTERPV  EQU   CVTMAP+316
CVTINTLA EQU   CVTMAP+320
CVTAPF   EQU   CVTMAP+324
CVTEXT2  EQU   CVTMAP+328
CVTHJES  EQU   CVTMAP+332
CVTPGSIA EQU   CVTMAP+348
CVTA1F1  EQU   CVTMAP+356
CVTSYSK  EQU   CVTMAP+357
CVTVOLM1 EQU   CVTMAP+380
CVTVOLF1 EQU   CVTVOLM1
CVTATMCT EQU   CVTMAP+388
CVTXTNT1 EQU   0
CVTXTNT2 EQU   0
CVTDSSV  EQU   CVTXTNT2
CVTFLGBT EQU   CVTXTNT2+5
CVTQID   EQU   CVTXTNT2+24
CVTSHS   EQU   CVTXTNT2+40
CVTRV400 EQU   CVTXTNT2+52
CVTRV409 EQU   CVTXTNT2+53
CVTATCVT EQU   CVTXTNT2+64
CVTRV429 EQU   CVTXTNT2+84
CVTRV438 EQU   CVTXTNT2+85
CVTRV457 EQU   CVTXTNT2+112
CVTRV466 EQU   CVTXTNT2+113
CVTFIX   EQU   0
CVTRELNO EQU   CVTFIX+252
IOBPREFX EQU   0
IOBCFLG1 EQU   IOBPREFX
IOBSTDRD EQU   0
IOBFLAG1 EQU   IOBSTDRD
IOBCYCCK EQU   IOBFLAG1
IOBRSTRT EQU   IOBFLAG1
IOBFLAG2 EQU   IOBSTDRD+1
IOBPURGE EQU   IOBFLAG2
IOBRDHA0 EQU   IOBFLAG2
IOBSENS0 EQU   IOBSTDRD+2
IOBS0B7  EQU   IOBSENS0
IOBSENS1 EQU   IOBSTDRD+3
IOBECBPT EQU   IOBSTDRD+4
IOBFLAG3 EQU   IOBSTDRD+8
IOBFL3   EQU   IOBFLAG3
IOBCNC   EQU   IOBFL3
IOBICL   EQU   IOBFL3
IOBCSW   EQU   IOBSTDRD+9
IOBIOCSW EQU   IOBCSW
IOBSTBYT EQU   IOBIOCSW+3
IOBUSTAT EQU   IOBSTBYT
IOBCSTAT EQU   IOBSTBYT+1
IOBSTART EQU   IOBSTDRD+16
IOBDCBPT EQU   IOBSTDRD+20
IOBFLAG4 EQU   IOBDCBPT
IOBRESTR EQU   IOBSTDRD+24
IOBINCAM EQU   IOBSTDRD+28
IOBBTAMF EQU   IOBINCAM
IOSB     EQU   0
IOSFLA   EQU   IOSB
IOSACHN  EQU   IOSFLA
IOSFLB   EQU   IOSB+1
IOSFLC   EQU   IOSB+2
IOSDVALT EQU   IOSFLC
IOSPKEY  EQU   IOSB+12
IOSOPT   EQU   IOSB+14
IOSOPT2  EQU   IOSB+15
@NM00004 EQU   IOSB+20
IOSCSW   EQU   @NM00004+1
IOSTATUS EQU   IOSCSW+3
IOSIPIB  EQU   IOSB+44
IOSPATH  EQU   IOSB+86
IOSCHN   EQU   IOSPATH
IOSCKEY  EQU   IOSB+89
IOSEEKA  EQU   IOSB+100
IOSCCHH  EQU   IOSEEKA+3
IOSSKHH  EQU   IOSCCHH+2
SRBSECT  EQU   0
SRBFLC   EQU   SRBSECT+12
ISTRPH   EQU   0
RPHCNTL  EQU   ISTRPH
RPHTYPE  EQU   RPHCNTL
RPHFLAGS EQU   RPHCNTL+2
RPHAPTYP EQU   RPHFLAGS
RPHFSTLC EQU   RPHFLAGS
RPHFLGB  EQU   RPHCNTL+3
RPHRPHA  EQU   ISTRPH+4
RPHTSKID EQU   ISTRPH+8
RPHRESMA EQU   ISTRPH+16
RPHWPFLG EQU   RPHRESMA
RPHWT    EQU   RPHWPFLG
RPHPABOF EQU   ISTRPH+20
RPHMAJCB EQU   ISTRPH+21
RPHWEA   EQU   ISTRPH+24
RPHCSPA  EQU   RPHWEA
RPHSRPRM EQU   ISTRPH+28
RPHCRR   EQU   ISTRPH+32
RPHPABQA EQU   ISTRPH+36
RPHPABQP EQU   RPHPABQA+1
RPHWORK  EQU   ISTRPH+40
RPHSAVE1 EQU   RPHWORK
RPHSBITS EQU   RPHSAVE1+1
ISTPAB   EQU   0
PABWQCHN EQU   ISTPAB
PABWEQA  EQU   PABWQCHN
PABCHAIN EQU   PABWQCHN+4
PABCHNGP EQU   PABCHAIN+1
PABRPHFG EQU   ISTPAB+12
PABFLAGS EQU   PABRPHFG
PABERLCK EQU   PABFLAGS
PABERRLK EQU   PABERLCK
ISTDYPAB EQU   0
DYPPAB   EQU   ISTDYPAB+16
ISTLOK   EQU   0
LOKCHN   EQU   ISTLOK+1
LOKCHNG  EQU   LOKCHN
@NM00016 EQU   LOKCHNG+2
ISTATCVT EQU   0
ATCCOM   EQU   ISTATCVT
ATCSTAT  EQU   ATCCOM
ATCSTAT1 EQU   ATCSTAT
ATCSTFLG EQU   ATCSTAT+1
ATCPOFLG EQU   ATCSTAT+2
ATCSTAT4 EQU   ATCSTAT+3
ATCCONFT EQU   ATCCOM+112
ATCIOTRC EQU   ATCCOM+140
ATCTHTRC EQU   ATCIOTRC
ATCCIDM  EQU   ATCCOM+266
ATCCDADD EQU   ISTATCVT+276
ATCCDDEL EQU   ISTATCVT+280
ATCCDFND EQU   ISTATCVT+284
ATCCSMR  EQU   ISTATCVT+296
ATCSHRFG EQU   ISTATCVT+316
ATCMSGP  EQU   ISTATCVT+344
ATCHPGM  EQU   ISTATCVT+384
ATCCDFIN EQU   ISTATCVT+460
ATCCDFDN EQU   ISTATCVT+464
ATCTCIPB EQU   ISTATCVT+624
ATCVLCNT EQU   ISTATCVT+772
ATCRNO   EQU   ISTATCVT+788
ATCSOPD  EQU   ISTATCVT+792
ATCSIPD  EQU   ISTATCVT+800
ATCSECST EQU   ISTATCVT+812
ATCSTAT2 EQU   ISTATCVT+818
ATCINCW3 EQU   ISTATCVT+832
ATCVTBAM EQU   ISTATCVT+908
@NM00024 EQU   ATCVTBAM+3
ATCAOSM  EQU   ISTATCVT+912
ATCGSRBQ EQU   ATCAOSM+4
ATCGSRBG EQU   ATCGSRBQ
ATCAP31  EQU   ATCAOSM+24
ATCAP32  EQU   ATCAOSM+28
ATCAP34  EQU   ATCAOSM+32
ATCICAPP EQU   ATCAOSM+100
ATCLDAPP EQU   ATCAOSM+120
ATCDAPVT EQU   ATCAOSM+140
ATCAP37  EQU   ATCAOSM+264
ATCCRA   EQU   ATCAOSM+280
ATCCRACN EQU   ATCCRA+4
ATCSRB   EQU   ATCAOSM+288
ATCSRBCN EQU   ATCSRB+4
ATCCRPL  EQU   ATCAOSM+296
ATCRPLCN EQU   ATCCRPL+4
ATCSQAFR EQU   ATCAOSM+304
ATCORTBC EQU   ATCSQAFR+4
ATCORSRB EQU   ATCORTBC
@NM00026 EQU   ATCAOSM+332
ATCVTFLG EQU   ATCAOSM+392
ATCZFLAG EQU   ATCAOSM+588
ISTPOHD  EQU   0
POHSTAT  EQU   ISTPOHD+1
ISTPFX   EQU   0
PFXID    EQU   ISTPFX
ISTNCSPL EQU   0
@NM00030 EQU   ISTNCSPL
NCSPFX   EQU   @NM00030
NCSPLVCD EQU   ISTNCSPL+17
NCSPLVBF EQU   ISTNCSPL+18
NCSPLVFL EQU   ISTNCSPL+20
NCSVSTAT EQU   NCSPLVFL
NCSDCONT EQU   NCSPLVFL
NCSPLVF1 EQU   ISTNCSPL+21
NCSOVFMC EQU   NCSPLVF1
NCSPRMRC EQU   ISTNCSPL+22
NCSIORC  EQU   ISTNCSPL+23
NCSPLRID EQU   ISTNCSPL+28
NCSPLRPT EQU   ISTNCSPL+52
NCSPLCMD EQU   ISTNCSPL+60
NCSCMDA  EQU   NCSPLCMD
NCSCRFLG EQU   ISTNCSPL+67
NCSFMCLD EQU   NCSCRFLG
NCSFMERP EQU   NCSCRFLG
NCSPLWRF EQU   ISTNCSPL+72
NCSPLRAD EQU   ISTNCSPL+144
NCSIOCID EQU   ISTNCSPL+148
NCSPLCID EQU   NCSIOCID
NCSPLDAF EQU   NCSPLCID+2
NCSPLWKA EQU   ISTNCSPL+152
NCSPLCVT EQU   ISTNCSPL+156
NCSPLRPH EQU   ISTNCSPL+160
NCSPLFSB EQU   ISTNCSPL+168
NCSPLFL1 EQU   ISTNCSPL+176
NCSPLREQ EQU   NCSPLFL1
NCSPL2CN EQU   NCSPLFL1
NCSPLFL2 EQU   ISTNCSPL+177
NCSPLRIO EQU   NCSPLFL2
NCSOUFMC EQU   NCSPLFL2
NCSPLFL3 EQU   ISTNCSPL+178
NCSPLMOM EQU   NCSPLFL3
NCSPLFL4 EQU   ISTNCSPL+179
NCSPLRSO EQU   NCSPLFL4
NCSPLFL5 EQU   ISTNCSPL+181
NCSFORCE EQU   NCSPLFL5
NCSPLOLN EQU   ISTNCSPL+182
NCSPLP1  EQU   ISTNCSPL+184
NCSPLP3  EQU   ISTNCSPL+192
NCSPLSPL EQU   ISTNCSPL+196
NCSPLWEL EQU   ISTNCSPL+200
NCSPLRRP EQU   ISTNCSPL+204
NCSPLRUO EQU   ISTNCSPL+208
NCSPLRUI EQU   ISTNCSPL+212
NCSPLAPP EQU   ISTNCSPL+216
NCSSENSE EQU   ISTNCSPL+244
NCSCRMSK EQU   ISTNCSPL+268
NCSCHKPT EQU   NCSCRMSK
NCSCRMOD EQU   NCSCRMSK+2
NCSPLSID EQU   ISTNCSPL+271
NCSPLSTA EQU   NCSPLSID
NCSPLPHD EQU   NCSPLSID+1
NCSAPP   EQU   0
NCSAPBUE EQU   NCSAPP+88
NCSUSSRU EQU   0
ISTDEVCH EQU   0
DEVSHCH  EQU   ISTDEVCH
DEVCHAR  EQU   DEVSHCH
DEVSUBND EQU   DEVCHAR
DEVTCODE EQU   ISTDEVCH+1
DEVFLAGS EQU   ISTDEVCH+3
DEVFCCTL EQU   DEVFLAGS
DEVCHAR3 EQU   DEVFLAGS
ISTRPRE  EQU   0
RPRNAME  EQU   ISTRPRE
RPRCOMID EQU   ISTRPRE+8
RPRDAF   EQU   RPRCOMID+2
RPRELEN  EQU   ISTRPRE+16
RPRPELEN EQU   ISTRPRE+18
RPRENTRY EQU   ISTRPRE+20
RPRFLAGA EQU   ISTRPRE+21
RPRINV   EQU   RPRFLAGA
RPRENTED EQU   RPRFLAGA
RPRLIVE  EQU   RPRFLAGA
RPRFLAGB EQU   ISTRPRE+22
RPRONLIN EQU   RPRFLAGB
RPRINTST EQU   RPRFLAGB
RPRCAUSE EQU   ISTRPRE+23
RPRHDTYP EQU   ISTRPRE+27
RPRNSNEA EQU   ISTRPRE+36
RPRDEVCH EQU   ISTRPRE+44
RPRFLAGD EQU   ISTRPRE+61
RPRCONP  EQU   RPRFLAGD
RPRINIMM EQU   RPRFLAGD
RPRFLAGC EQU   ISTRPRE+62
ISTRCPRE EQU   0
RCPPMODE EQU   ISTRCPRE+91
RCPLGNIN EQU   ISTRCPRE+92
ISTRDT   EQU   0
RDTPLEN  EQU   ISTRDT+72
RDTPRIOR EQU   RDTPLEN
RDTFLAGB EQU   ISTRDT+91
RDTOUERP EQU   RDTFLAGB
RDTPRGDN EQU   RDTFLAGB
RDTCTCFL EQU   RDTFLAGB
RDTVPAB  EQU   ISTRDT+92
RDTEPAB  EQU   ISTRDT+96
RDTDPAB  EQU   ISTRDT+100
RDTVYRPH EQU   ISTRDT+108
RDTSTCNT EQU   ISTRDT+112
ISTRAP   EQU   0
RAPFLG   EQU   ISTRAP+108
RAPFLGB  EQU   ISTRAP+109
RAPFLGC  EQU   ISTRAP+110
ISTRLC   EQU   0
RLCADR   EQU   ISTRLC+72
RLCFLAG  EQU   RLCADR
ISTRRN   EQU   0
RRNADR   EQU   ISTRRN+136
RRNFLAG  EQU   RRNADR
RRNLCDIP EQU   RRNFLAG
RRNERPIP EQU   RRNFLAG
RRNUCBAD EQU   RRNADR+1
RRNTRENT EQU   ISTRRN+148
RRNRDF   EQU   ISTRRN+172
RRNRDFA  EQU   RRNRDF
RRNRBREM EQU   RRNRDFA
RRNRDFB  EQU   RRNRDF+1
RRNCMF   EQU   ISTRRN+176
RRNCMFA  EQU   RRNCMF
RRNCMFB  EQU   RRNCMF+1
RRNCMFC  EQU   RRNCMF+2
RRNCMFD  EQU   RRNCMF+3
RRNNMDPD EQU   ISTRRN+192
RRNHPRE  EQU   ISTRRN+216
RRNNCPNM EQU   ISTRRN+221
ISTRGP   EQU   0
RGPFLG   EQU   ISTRGP+72
ISTRLN   EQU   0
RLNADR   EQU   ISTRLN+72
RLNFLAG  EQU   RLNADR
RLNUCBAD EQU   RLNADR+1
RLNSTAT1 EQU   ISTRLN+86
RLNSTAT2 EQU   ISTRLN+87
RLNRDF   EQU   ISTRLN+88
RLNRDFA  EQU   RLNRDF
RLNRACNT EQU   RLNRDFA
RLNPORT  EQU   RLNRDFA
RLNRDFB  EQU   RLNRDF+1
RLNCRFLG EQU   ISTRLN+102
RLNLSCMD EQU   RLNCRFLG
ISTRPT   EQU   0
RPTLNCID EQU   ISTRPT+116
RPTDITT  EQU   ISTRPT+128
RPTFLAG1 EQU   ISTRPT+140
ISTRCL   EQU   0
RCLADR   EQU   ISTRCL+72
RCLFLAG  EQU   RCLADR
ISTRTR   EQU   0
RTRADR   EQU   ISTRTR+124
RTRFLAG  EQU   RTRADR
RTRRDFA  EQU   ISTRTR+136
RTRRAALL EQU   RTRRDFA
RTRRDFB  EQU   ISTRTR+137
RTRRDFC  EQU   ISTRTR+138
RTRRDFD  EQU   ISTRTR+139
RTRRDFE  EQU   ISTRTR+140
RTRRDFF  EQU   ISTRTR+141
RTRCRFLG EQU   ISTRTR+143
RTRLSCMD EQU   RTRCRFLG
RTRBSCID EQU   ISTRTR+188
ISTRIN   EQU   0
RINDFD   EQU   ISTRIN+124
RINREMPO EQU   RINDFD
RINNODEF EQU   RINDFD
RINLDISC EQU   RINDFD
RINNODID EQU   ISTRIN+125
RINRLDAF EQU   ISTRIN+126
RINREMOT EQU   ISTRIN+128
RINVPAB  EQU   ISTRIN+132
RINRPHCN EQU   ISTRIN+136
RINNCSPL EQU   ISTRIN+140
RINCNCNT EQU   ISTRIN+144
ISTRDS   EQU   0
ISTDOT   EQU   0
ISTRCC   EQU   0
RCCFLAG  EQU   ISTRCC+73
RCCCUDIE EQU   RCCFLAG
RCCERPIP EQU   RCCFLAG
RCCOUERP EQU   RCCFLAG
RCCPRGDN EQU   RCCFLAG
RCCFLAGB EQU   ISTRCC+74
RCCSTAID EQU   ISTRCC+78
RCCID48  EQU   RCCSTAID+2
RCCDPAB  EQU   ISTRCC+92
RCCEPAB  EQU   ISTRCC+96
RCCRPHCN EQU   ISTRCC+100
RCCCRFLG EQU   ISTRCC+108
RCCCTCFL EQU   RCCCRFLG
ISTRLU   EQU   0
RLUFLAG  EQU   ISTRLU+125
RLUCRFLG EQU   ISTRLU+126
RLUACTLU EQU   RLUCRFLG
RLUPACE  EQU   ISTRLU+132
RLUNCPPC EQU   ISTRLU+134
RLUUSSTB EQU   ISTRLU+140
RLUMODET EQU   ISTRLU+152
ISTRPX   EQU   0
ISTRLX   EQU   0
RLXFLAGA EQU   ISTRLX+76
ISTRSW   EQU   0
ISTRDA   EQU   0
RDAADR   EQU   ISTRDA+72
RDAFLAG  EQU   RDAADR
RDAUCBAD EQU   RDAADR+1
ISTRLS   EQU   0
ISTDNT   EQU   0
ISTGNT   EQU   0
ISTPAT   EQU   0
PATFLAGA EQU   ISTPAT+7
ISTPROCD EQU   0
PROPROC  EQU   ISTPROCD
PROPROC1 EQU   PROPROC
PROPROC2 EQU   PROPROC+1
PROPROC3 EQU   PROPROC+2
PROPROC4 EQU   PROPROC+3
PROPROCS EQU   0
PROSETMS EQU   PROPROCS+1
PROSETM2 EQU   PROSETMS
PROSETM3 EQU   PROSETMS+1
PROSETM4 EQU   PROSETMS+2
ISTFMCB  EQU   0
FMCFMCBA EQU   ISTFMCB+20
FMCSTAT  EQU   ISTFMCB+28
FMCSTAT1 EQU   ISTFMCB+29
FMCHPURG EQU   FMCSTAT1
FMCCMDFL EQU   ISTFMCB+31
FMCCMPS1 EQU   ISTFMCB+36
FMCVWT   EQU   ISTFMCB+44
FMCMODE  EQU   ISTFMCB+52
FMCSIPA  EQU   ISTFMCB+148
FMCNXOSQ EQU   ISTFMCB+152
FMCNXCFM EQU   FMCNXOSQ
FMCNXOSC EQU   FMCNXOSQ+2
FMCSSTAT EQU   ISTFMCB+159
FMCCONF  EQU   FMCSSTAT
FMCPACE  EQU   ISTFMCB+160
FMCPACEN EQU   FMCPACE
FMCPACEM EQU   FMCPACE+1
FMCPACPC EQU   FMCPACE+2
FMCCVAL  EQU   FMCPACE+3
FMCOBCE  EQU   FMCCVAL
FMCCLEXT EQU   ISTFMCB+164
FMCRPLA  EQU   FMCCLEXT
FMCFBA   EQU   FMCCLEXT+4
FMCCMPS2 EQU   FMCCLEXT+16
FMCFLGA  EQU   FMCCMPS2
FMCFLGCL EQU   FMCCMPS2+1
FMCPSCMD EQU   FMCCMPS2+2
FMCPSTAT EQU   FMCCMPS2+3
FMCSTAT2 EQU   ISTFMCB+186
FMCMODEB EQU   ISTFMCB+189
FMCCLSEQ EQU   ISTFMCB+190
FMCRRESP EQU   ISTFMCB+195
FMCSSEGQ EQU   ISTFMCB+200
FMCFBAS  EQU   ISTFMCB+216
FMCZV002 EQU   FMCFBAS
FMCSNCTL EQU   ISTFMCB+224
FMCSCFLG EQU   FMCSNCTL
FMCVS1   EQU   ISTFMCB+232
FMCZFLAG EQU   FMCVS1
FMCZF006 EQU   FMCZFLAG
FMCLBXM  EQU   FMCVS1+12
FMCSHEAQ EQU   FMCLBXM
FMCLCPBQ EQU   FMCVS1+16
FMCLCPAQ EQU   FMCVS1+20
FMCSEQ1  EQU   FMCVS1+34
FMCZFLG2 EQU   FMCVS1+35
FMCCVFLG EQU   FMCVS1+44
FMCFLAG  EQU   0
FMCFLGB  EQU   FMCFLAG
ISTNCB   EQU   0
NCBFMCBA EQU   ISTNCB+16
NCBFLAGS EQU   ISTNCB+24
NCBFRAS  EQU   NCBFLAGS+1
NCBFTRIO EQU   NCBFRAS
NCBFLAG1 EQU   NCBFLAGS+2
NCBCONF  EQU   NCBFLAG1
NCBRSTRT EQU   NCBFLAG1
NCBTTF   EQU   NCBFLAG1
NCBFORCE EQU   NCBFLAG1
ISTICNCB EQU   0
@NM00049 EQU   ISTICNCB+53
ICNCKFLD EQU   ISTICNCB+96
ICNFLAG  EQU   ISTICNCB+100
ICNZF006 EQU   ICNFLAG
ICNZF010 EQU   ICNFLAG
ICNSTART EQU   ICNFLAG
ICNFFLAG EQU   ISTICNCB+101
ICNZSWS  EQU   ISTICNCB+102
ICNFLAG2 EQU   ISTICNCB+236
ICNZD001 EQU   ISTICNCB+288
ICNWSCCW EQU   ICNZD001
ICNZD002 EQU   ISTICNCB+296
ICNZD003 EQU   ISTICNCB+320
ICNRSCCW EQU   ICNZD003
ICNZD004 EQU   ISTICNCB+328
ICNZS1VR EQU   ISTICNCB+348
ICNSRV02 EQU   ICNZS1VR
ICNDIEWA EQU   ICNSRV02
ICNDCDEB EQU   ISTICNCB+480
ICNDIDEB EQU   ICNDCDEB+12
ICNZFLAG EQU   ISTICNCB+508
ICNZH002 EQU   ISTICNCB+509
ICNZS002 EQU   ICNZH002
ICNZS003 EQU   ICNZH002
ICNZS004 EQU   ICNZH002
ICNZS006 EQU   ICNZH002
ICNZS007 EQU   ICNZH002
ICNZS008 EQU   ICNZH002
ICNZS009 EQU   ICNZH002+1
ICNZS00A EQU   ICNZH002+1
ICNZCONS EQU   ISTICNCB+680
ISTCCNCB EQU   0
CCNFLGA  EQU   ISTCCNCB+48
CCNSTART EQU   CCNFLGA
ISTTIE   EQU   0
TIETYPE  EQU   ISTTIE
TIELNGTH EQU   ISTTIE+1
TIEREQ   EQU   ISTTIE+3
TIETIEA  EQU   ISTTIE+4
TIESNA   EQU   ISTTIE+8
TIEPTR1  EQU   TIESNA
TIERPHA  EQU   ISTTIE+12
ISTLCCW  EQU   0
LCCWOP   EQU   ISTLCCW
LCCWRWOP EQU   LCCWOP
LCCWCTL  EQU   LCCWRWOP
LCCWFLAG EQU   ISTLCCW+1
LCCWLSI  EQU   LCCWFLAG
ISTLCPB  EQU   0
LCPREQTG EQU   ISTLCPB+2
LCPFLAGS EQU   LCPREQTG
LCPZF001 EQU   LCPFLAGS
LCPZRT02 EQU   LCPZF001
LCPZF002 EQU   LCPFLAGS
LCPZRT03 EQU   LCPZF002
LCPZF003 EQU   LCPFLAGS
LCPZRT04 EQU   LCPZF003
LCPZF004 EQU   LCPFLAGS
LCPZRT05 EQU   LCPZF004
LCPZRT06 EQU   LCPFLAGS
LCPZRT07 EQU   LCPFLAGS
LCPMNRCD EQU   LCPREQTG+1
LCPZRT08 EQU   LCPMNRCD
LCPZRT09 EQU   LCPMNRCD
LCPCHAIN EQU   ISTLCPB+4
LCPCHAI1 EQU   LCPCHAIN
LCPRUCNT EQU   ISTLCPB+8
LCPFLAG2 EQU   ISTLCPB+9
LCPTLBPI EQU   LCPFLAG2
LCPFID0  EQU   LCPFLAG2
LCPSEQ   EQU   ISTLCPB+10
LCPCID   EQU   ISTLCPB+16
LCPFDBA  EQU   ISTLCPB+24
LCPFLG1  EQU   ISTLCPB+37
LCPFLCCW EQU   ISTLCPB+40
LCPLCCW  EQU   ISTLCPB+48
LCPPABA  EQU   LCPLCCW+4
LCPRPHA  EQU   LCPPABA
ISTLDPRM EQU   0
LDPFG    EQU   ISTLDPRM+20
LDPFB2   EQU   ISTLDPRM+21
ISTCONFT EQU   0
CONHALT  EQU   ISTCONFT+106
CONFLAGS EQU   ISTCONFT+110
CONDSFLG EQU   CONFLAGS
CONOPTFL EQU   CONFLAGS+1
CONSTAT  EQU   CONFLAGS+2
CONBUFF  EQU   CONFLAGS+3
CONFLG01 EQU   ISTCONFT+416
CONSCPID EQU   ISTCONFT+1356
CONSTAID EQU   CONSCPID+3
ISTRH    EQU   0
RHFLAGS  EQU   ISTRH
RH1      EQU   RHFLAGS
RH2      EQU   RHFLAGS+1
RHRETRY  EQU   RH2
RHRSVD1  EQU   RH2
RH3      EQU   RHFLAGS+2
ISTRU    EQU   0
RUDATA   EQU   ISTRU
ISTRUB   EQU   0
NSRUNA5  EQU   0
ISTGTNCS EQU   0
GTNCSAD  EQU   ISTGTNCS
GTNCSFLG EQU   ISTGTNCS+4
GTNCSREQ EQU   GTNCSFLG
GTNCSRQU EQU   GTNCSFLG
GTNCSWKA EQU   GTNCSFLG
CCLWKA   EQU   0
WKANEXT  EQU   CCLWKA
WKALEN   EQU   CCLWKA+4
WKAFREE  EQU   CCLWKA+8
WKASPTR  EQU   0
SAVEAREA EQU   0
FWDPTR   EQU   SAVEAREA+8
ISTZSAVE EQU   0
ZSAZSVBC EQU   ISTZSAVE
ZSAZSVMS EQU   ZSAZSVBC
ISTPFCRR EQU   0
PFCCRR   EQU   ISTPFCRR
PFCCRRID EQU   PFCCRR
PFCCRRLN EQU   PFCCRR+2
PFCHDR   EQU   ISTPFCRR+4
PFCCRRO  EQU   PFCHDR
PFCFRRO  EQU   PFCHDR+4
PFCFTA   EQU   ISTPFCRR+12
ISTCFCRR EQU   0
CFCAUDIT EQU   ISTCFCRR
CFCNTRD  EQU   CFCAUDIT
CFCCRT   EQU   CFCAUDIT+1
ISTZCRR  EQU   0
ZCRCRR   EQU   ISTZCRR
ZCRFLGS1 EQU   ISTZCRR+12
ZCRFLGS2 EQU   ISTZCRR+13
ZCRSWFLD EQU   ISTZCRR+14
ZCRENDSH EQU   ZCRSWFLD
ZCRNDLCP EQU   ZCRSWFLD
ZCRRESET EQU   ZCRSWFLD
ZCRFLGS3 EQU   ISTZCRR+15
ZCRGENSW EQU   ISTZCRR+16
ZCRPFLGS EQU   ISTZCRR+17
ZCRIBPR  EQU   ISTZCRR+18
ZCRSCPSW EQU   ISTZCRR+19
ZCRPARMS EQU   ISTZCRR+24
ZCRFBPTR EQU   ZCRPARMS
ZCRDFRDA EQU   ZCRPARMS+10
ZCRPCOD1 EQU   ZCRPARMS+12
ZCRPLSBF EQU   ZCRPCOD1
ZCRPCOD2 EQU   ZCRPARMS+13
ZCRSVRTN EQU   ISTZCRR+56
ZCRWKARA EQU   ISTZCRR+156
ZCRCIDSV EQU   ISTZCRR+192
ZCRAUDIT EQU   ISTZCRR+440
ZCRENTER EQU   ZCRAUDIT+5
ZCRLCPB  EQU   ISTZCRR+480
ZCRRHRU  EQU   ZCRLCPB
ISTASCRR EQU   0
ASCFLAGS EQU   ISTASCRR+16
ASCFLG1  EQU   ASCFLAGS
ASCFLG2  EQU   ASCFLAGS+2
ASCFLG3  EQU   ASCFLAGS+4
ASCUSRGS EQU   ISTASCRR+28
ISTAPCRR EQU   0
APCATFLG EQU   ISTAPCRR+16
APCRFLG  EQU   ISTAPCRR+18
APCSAVE  EQU   ISTAPCRR+44
APCCOMF  EQU   ISTAPCRR+116
APCCOMF1 EQU   APCCOMF
APC31FLG EQU   ISTAPCRR+132
APC52FLG EQU   ISTAPCRR+133
APC53FLG EQU   ISTAPCRR+134
APC54FLG EQU   ISTAPCRR+135
APC57FLG EQU   ISTAPCRR+136
ISTCRA   EQU   0
CRABASIC EQU   ISTCRA
CRAHDR   EQU   CRABASIC
CRACRR   EQU   CRAHDR
CRAFRR   EQU   CRAHDR+4
CRALKACT EQU   CRABASIC+8
CRAPROCR EQU   ISTCRA+312
CRASVC   EQU   ISTCRA+848
CRABUFA  EQU   CRASVC+68
ISTCNSTA EQU   0
CNSTFLDA EQU   ISTCNSTA+16
CNSTFLDB EQU   ISTCNSTA+19
ISTVYCRR EQU   0
VYCAUDIT EQU   ISTVYCRR+22
VYCNTRD  EQU   VYCAUDIT
NINCCL   EQU   VYCNTRD
VYCCRT   EQU   VYCAUDIT+12
CINCCL   EQU   VYCCRT
VYCRRSAV EQU   ISTVYCRR+46
VYCRRCW3 EQU   ISTVYCRR+118
FMZL0025 EQU   0
ISTAPC37 EQU   0
FMZL0070 EQU   0
FMZL0104 EQU   0
ISTSDCCF EQU   0
ISTSDCCR EQU   0
@NM00078 EQU   0
CMZID141 EQU   @NM00078
@NM00079 EQU   @NM00078+4
CMZRL141 EQU   @NM00079
CMZRA141 EQU   @NM00079+1
CMZEA141 EQU   @NM00078+8
CMZVP141 EQU   @NM00078+12
CMZSA141 EQU   0
CMTA141  EQU   0
@NM00080 EQU   0
CMZID150 EQU   @NM00080
@NM00081 EQU   @NM00080+4
CMZRL150 EQU   @NM00081
CMZRA150 EQU   @NM00081+1
CMZEA150 EQU   @NM00080+8
CMZVP150 EQU   @NM00080+12
CMZSA150 EQU   0
CMTA150  EQU   0
FMZL0173 EQU   0
ISTWKE   EQU   0
WKECHAIN EQU   ISTWKE+4
WKEFLAGS EQU   WKECHAIN
ISTAPC34 EQU   0
ISTSDCCA EQU   0
ISTSDCCD EQU   0
ISTSDCCN EQU   0
CVTS01   EQU   CVTPGSIA
CVTLPDIA EQU   CVTS01+12
CVTDIRST EQU   CVTLPDIA
CVTSLIDA EQU   CVTS01+24
CVTCTLFG EQU   CVTS01+50
CVTRV210 EQU   CVTS01+424
CVTRV219 EQU   CVTS01+425
CVTRV228 EQU   CVTS01+426
CVTRV237 EQU   CVTS01+427
CVTMFRTR EQU   CVTS01+452
CVTRV262 EQU   CVTS01+468
CVTRV271 EQU   CVTS01+469
CVTRV280 EQU   CVTS01+470
CVTRV289 EQU   CVTS01+471
CVTGSDA  EQU   CVTS01+600
IOBORG01 EQU   IOBPREFX+8
IOBNIOBA EQU   IOBORG01
IOBNFLG1 EQU   IOBNIOBA
IOBPRTOV EQU   IOBNFLG1
IOBORG02 EQU   IOBPREFX+8
IOBDQADA EQU   IOBORG02
IOBDEQIN EQU   IOBDQADA
IOBORG03 EQU   IOBPREFX+12
IOBORG04 EQU   IOBINCAM
IOBORG12 EQU   IOBINCAM
IOBFL4   EQU   IOBORG12
IOBEXTEN EQU   IOBSTDRD+32
IOBSEEK  EQU   IOBEXTEN
IOBBB    EQU   IOBSEEK+1
IOBCC    EQU   IOBSEEK+3
IOBHH    EQU   IOBSEEK+5
IOBORG05 EQU   IOBEXTEN
IOBORG06 EQU   IOBEXTEN
IOBNXTPT EQU   IOBORG06+4
IOBSTATA EQU   IOBNXTPT
IOBORG07 EQU   IOBEXTEN+8
W1IEXTEN EQU   IOBORG07
IOBORG08 EQU   IOBEXTEN+8
IOBINDCT EQU   IOBORG08+4
IOBUNSQR EQU   IOBORG08+5
IOBFCHAD EQU   IOBORG08+8
IOBORG09 EQU   IOBEXTEN+8
IOBDPLAD EQU   IOBORG09+4
IOBDTYPE EQU   IOBORG09+8
IOBDTYP2 EQU   IOBORG09+9
IOBDSTAT EQU   IOBORG09+10
IOBSTAT1 EQU   IOBDSTAT
IOBORG10 EQU   IOBEXTEN+8
IOBSEEK2 EQU   IOBORG10
IOBORG11 EQU   IOBEXTEN
IOBERCT  EQU   IOBORG11
IOBUCBXV EQU   IOBERCT
IOBNAME  EQU   IOBORG11+4
IOBORG13 EQU   IOBEXTEN
IOBSKADR EQU   IOBORG13
IOSATTSC EQU   IOSIPIB
IOSWTOWA EQU   IOSIPIB
IOSPCISC EQU   IOSIPIB
LCPZTIE  EQU   LCPCID
LCPZSNAM EQU   LCPZTIE+8
ISTSENRU EQU   RUDATA
SRUSENSE EQU   ISTSENRU
SRUSENS1 EQU   SRUSENSE
SRUSENS2 EQU   SRUSENSE+2
ISTSRU   EQU   ISTRUB
SRUQSREQ EQU   ISTSRU
SRUDATA  EQU   ISTSRU+1
SRUTYPE  EQU   SRUDATA
SRULDID  EQU   SRUDATA+1
SRUSPSN  EQU   SRULDID
ISTNSRU  EQU   ISTRUB
NSRUNETS EQU   ISTNSRU
NSRUDATA EQU   ISTNSRU+3
NSRUHOOK EQU   NSRUDATA
NSSSVRU  EQU   NSRUDATA
NSSSVNOD EQU   NSSSVRU+3
NSSSVT3  EQU   NSSSVNOD
NSSSVT3C EQU   NSSSVT3+2
NSSSVT3G EQU   NSSSVT3+5
NSSSVT4  EQU   NSSSVNOD
NSSSVT5  EQU   NSSSVNOD
NSRUDAT1 EQU   NSRUDATA
NSRUDAT2 EQU   NSRUDAT1+2
ISTTRRU  EQU   NSRUDAT2
TRRTYPE  EQU   ISTTRRU
ISTCTDRU EQU   NSRUDAT2
ISTINORU EQU   NSRUDAT2
SRUDAT1  EQU   SRUDATA
SRUDAT1T EQU   SRUDAT1
SRUDAT1L EQU   SRUDAT1+1
SRUFMPRO EQU   SRUDAT1L
SRUTSPRO EQU   SRUDAT1L
SRUDAT1I EQU   SRUDAT1+2
SRUDAT2  EQU   SRUDATA
ISTMRU   EQU   ISTRUB
SRUDATA3 EQU   SRUDATA
SRUDATA4 EQU   SRUDATA
NSRUDAT3 EQU   NSRUDAT2
NSRUDAT4 EQU   NSRUDAT2
NSRUDAT5 EQU   NSRUDAT2
NSRUDAT6 EQU   NSRUDAT2
NSRUDAT7 EQU   NSRUDAT2
NSRUDIL  EQU   NSRUDAT2
NSRUDILB EQU   NSRUDIL+1
NSRUNA   EQU   NSRUDAT2
NSRUNA2  EQU   NSRUNA+1
NSRUCLSP EQU   NSRUDAT2
NSRUOH1  EQU   NSRUDAT2
NSRUDAT8 EQU   NSRUDATA
ISTUNBRU EQU   SRUTYPE
CCLWRKL  EQU   CCLWRK
CMZCIDM  EQU   ATCCIDM
RTRDNCBA EQU   ISTRTR+40
SRB      EQU   SRBSECT
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS
UNBTYPE  EQU   ISTUNBRU
NSRUDA8T EQU   NSRUDAT8
NSRUOHID EQU   NSRUOH1
NSRULSV  EQU   NSRUCLSP
NSRUNA4  EQU   NSRUNA+2
NSRUNA3  EQU   NSRUNA2
NSRUNA1  EQU   NSRUNA
NSRUDILF EQU   NSRUDIL+4
NSRUDILE EQU   NSRUDIL+3
NSRUDILD EQU   NSRUDIL+2
NSRUDILC EQU   NSRUDILB
@NM00074 EQU   NSRUDILB
NSRUDILA EQU   NSRUDIL
NSRUDA7T EQU   NSRUDAT7
NSRUDA6L EQU   NSRUDAT6+4
NSRUDA6S EQU   NSRUDAT6
NSRUDA5E EQU   NSRUDAT5
NSRUDA4T EQU   NSRUDAT4
NSRUDA3S EQU   NSRUDAT3
SRUDAT4D EQU   SRUDATA4
SRUDAT3I EQU   SRUDATA3
MRUDATA  EQU   ISTMRU+9
MRURESP  EQU   ISTMRU+7
MRUMODIF EQU   ISTMRU+6
MRUCMND  EQU   ISTMRU+5
MRUDAF   EQU   ISTMRU+3
MRUREQ   EQU   ISTMRU+2
MRUPREF  EQU   ISTMRU
SRUDAT2N EQU   SRUDAT2+1
SRUDAT2T EQU   SRUDAT2
INORUET  EQU   ISTINORU
CTDRUSTA EQU   ISTCTDRU
TRRDATA  EQU   ISTTRRU+4
TRRSTAT  EQU   ISTTRRU+3
TRRPEP   EQU   ISTTRRU+2
TRRTIME  EQU   ISTTRRU+1
@NM00073 EQU   TRRTYPE
TRRFMT2  EQU   TRRTYPE
@NM00072 EQU   TRRTYPE
NSRUDAF  EQU   NSRUDAT1
NSSSVT5A EQU   NSSSVT5
NSSSVT4D EQU   NSSSVT4+3
NSSSVT4C EQU   NSSSVT4+2
NSSSVT4B EQU   NSSSVT4+1
NSSSVT4A EQU   NSSSVT4
NSSSVT3K EQU   NSSSVT3+8
NSSSVT3J EQU   NSSSVT3+7
NSSSVT3I EQU   NSSSVT3+6
@NM00071 EQU   NSSSVT3G
NSSSVT3H EQU   NSSSVT3G
NSSSVT3F EQU   NSSSVT3+4
NSSSVT3E EQU   NSSSVT3+3
@NM00070 EQU   NSSSVT3C
NSSSVT3D EQU   NSSSVT3C
NSSSVT3B EQU   NSSSVT3+1
NSSSVT3A EQU   NSSSVT3
NSSSVT   EQU   NSSSVRU+2
NSSSVDAF EQU   NSSSVRU
NSRUHKTY EQU   NSRUHOOK
NSRURCD  EQU   NSRUNETS+2
NSRUSUB  EQU   NSRUNETS+1
NSRUID   EQU   NSRUNETS
SRURSV01 EQU   SRULDID+4
SRUPSSN  EQU   SRULDID+2
SRUDFCLV EQU   SRUSPSN
@NM00069 EQU   SRUTYPE
SRUPSAC  EQU   SRUTYPE
SRUSPAC  EQU   SRUTYPE
SENRU    EQU   ISTSENRU+4
SRUSNS4  EQU   SRUSENS2+1
SRUSNS3  EQU   SRUSENS2
SRUSNST  EQU   SRUSENS1+1
SRUSNS1  EQU   SRUSENS1
LCPZTRV4 EQU   LCPZSNAM+4
LCPZTRV1 EQU   LCPZSNAM
LCPZSNA  EQU   LCPZTIE+4
LCPZFMCA EQU   LCPZTIE
IOSPCIWA EQU   IOSPCISC+44
IOSPCIRS EQU   IOSPCISC+8
@NM00009 EQU   IOSPCISC+4
@NM00008 EQU   IOSPCISC
IOSWRNDR EQU   IOSWTOWA+4
IOSWTOPT EQU   IOSWTOWA+3
IOSWTOCP EQU   IOSWTOWA+2
IOSWTOCH EQU   IOSWTOWA
IOSATTWA EQU   IOSATTSC+40
@NM00007 EQU   IOSATTSC+24
IOSATTSN EQU   IOSATTSC
IOBSKSS  EQU   IOBSKADR+3
IOBSK0   EQU   IOBSKADR+2
IOBSKTT  EQU   IOBSKADR+1
IOBSKRV  EQU   IOBSKADR
IOBCSWSV EQU   IOBORG11+17
IOBSENSV EQU   IOBORG11+16
IOBRCD   EQU   IOBORG11+12
IOBMDREC EQU   IOBORG11+8
IOBNAMEA EQU   IOBNAME+1
IOBNAMSZ EQU   IOBNAME
IOBERCTA EQU   IOBERCT+1
IOBRTYPE EQU   IOBUCBXV
IOBRDCHP EQU   IOBORG10+20
IOBNEXTA EQU   IOBORG10+16
IOBREADA EQU   IOBORG10+12
IOBBUFC  EQU   IOBORG10+8
IOBSK2R  EQU   IOBSEEK2+7
IOBSK2HH EQU   IOBSEEK2+5
IOBSK2CC EQU   IOBSEEK2+3
IOBSK2BB EQU   IOBSEEK2+1
IOBSK2M  EQU   IOBSEEK2
IOBCHNPR EQU   IOBORG09+40
IOBDNCRF EQU   IOBORG09+32
IOBRSV35 EQU   IOBORG09+24
IOBDQPTR EQU   IOBORG09+20
IOBRSV34 EQU   IOBORG09+18
IOBDBYTN EQU   IOBORG09+16
IOBDCPND EQU   IOBORG09+12
IOBSTAT2 EQU   IOBDSTAT+1
IOBSIORT EQU   IOBSTAT1
IOBADDVU EQU   IOBSTAT1
IOBBUFF  EQU   IOBSTAT1
IOBENQUE EQU   IOBSTAT1
IOBPASS2 EQU   IOBSTAT1
IOBSYNCH EQU   IOBSTAT1
IOBNEWVL EQU   IOBSTAT1
IOBABNRM EQU   IOBSTAT1
IOBRELEX EQU   IOBDTYP2
IOBADDTY EQU   IOBDTYP2
IOBTYPE  EQU   IOBDTYP2
IOBRQUST EQU   IOBDTYP2
IOBSUFFX EQU   IOBDTYP2
IOBSBLKL EQU   IOBDTYP2
IOBSKEY  EQU   IOBDTYP2
IOBRELBL EQU   IOBDTYPE
IOBRDEXC EQU   IOBDTYPE
IOBDYNBF EQU   IOBDTYPE
IOBACTAD EQU   IOBDTYPE
IOBFDBCK EQU   IOBDTYPE
IOBEXTSC EQU   IOBDTYPE
IOBOVFLO EQU   IOBDTYPE
IOBVERFY EQU   IOBDTYPE
IOBDPLB  EQU   IOBDPLAD+1
IOBDAYLI EQU   IOBDPLAD
IOBDIOBS EQU   IOBORG09+2
IOBDBYTR EQU   IOBORG09
IOBBCHAD EQU   IOBORG08+12
IOBFCHNB EQU   IOBFCHAD+1
IOBCOUNT EQU   IOBFCHAD
IOBASYN  EQU   IOBORG08+7
IOBAPP   EQU   IOBORG08+6
IOBRSV32 EQU   IOBUNSQR
IOBRSV31 EQU   IOBUNSQR
IOBRSV30 EQU   IOBUNSQR
IOBKNRWR EQU   IOBUNSQR
IOBKNWR  EQU   IOBUNSQR
IOBNTAV2 EQU   IOBUNSQR
IOBNTAV1 EQU   IOBUNSQR
IOBCPBSY EQU   IOBUNSQR
IOBCHNNL EQU   IOBINDCT
IOBRSV29 EQU   IOBINDCT
IOBRSV28 EQU   IOBINDCT
IOBRSV27 EQU   IOBINDCT
IOBKEYAD EQU   IOBINDCT
IOBOVPTR EQU   IOBINDCT
IOBUNSCH EQU   IOBINDCT
IOBDEQCP EQU   IOBINDCT
IOBCCWAD EQU   IOBORG08
W1OEXTEN EQU   W1IEXTEN
IOBCCW   EQU   IOBORG06+8
IOBNXTPB EQU   IOBNXTPT+1
IOBRSV26 EQU   IOBSTATA
IOBRSV25 EQU   IOBSTATA
IOBRSV24 EQU   IOBSTATA
IOBRSV23 EQU   IOBSTATA
IOBRSV22 EQU   IOBSTATA
IOBRSV21 EQU   IOBSTATA
IOBRSV20 EQU   IOBSTATA
IOBAVLFL EQU   IOBSTATA
IOBRSV37 EQU   IOBORG06+1
IOBUCBXG EQU   IOBORG06
IOBCPA   EQU   IOBORG05+32
IOBERINF EQU   IOBORG05+16
IOBERCCW EQU   IOBORG05+8
IOBSNDPT EQU   IOBORG05+7
IOBRCVPT EQU   IOBORG05+6
IOBWORK  EQU   IOBORG05+1
IOBUCBX  EQU   IOBORG05
IOBR     EQU   IOBSEEK+7
IOBHH2   EQU   IOBHH+1
IOBHH1   EQU   IOBHH
IOBCC2   EQU   IOBCC+1
IOBCC1   EQU   IOBCC
IOBBB2   EQU   IOBBB+1
IOBBB1   EQU   IOBBB
IOBM     EQU   IOBSEEK
IOBRSV46 EQU   IOBFL4
IOBRSV47 EQU   IOBFL4
IOBENT   EQU   IOBFL4
IOBEQP   EQU   IOBFL4
IOBBUS   EQU   IOBFL4
IOBDCK   EQU   IOBFL4
IOBREJ   EQU   IOBFL4
IOBOVR   EQU   IOBFL4
IOBCRILC EQU   IOBORG04+1
IOBCRDCC EQU   IOBORG04
IOBGQECB EQU   IOBORG03
IOBSWAP  EQU   IOBORG02+4
IOBDQADB EQU   IOBDQADA+1
IOBRSV13 EQU   IOBDEQIN
IOBRSV12 EQU   IOBDEQIN
IOBRSV11 EQU   IOBDEQIN
IOBRSV10 EQU   IOBDEQIN
IOBRSV09 EQU   IOBDEQIN
IOBRSV08 EQU   IOBDEQIN
IOBRSV07 EQU   IOBDEQIN
IOBDEQ   EQU   IOBDEQIN
IOBNECB  EQU   IOBORG01+4
IOBNIOBB EQU   IOBNIOBA+1
IOBFIRST EQU   IOBNFLG1
IOBUPERR EQU   IOBNFLG1
IOBSPAN  EQU   IOBNFLG1
IOBBKSPC EQU   IOBNFLG1
IOBUPDAT EQU   IOBNFLG1
IOBREAD  EQU   IOBNFLG1
IOBWRITE EQU   IOBNFLG1
IOBSEGMT EQU   IOBPRTOV
CVTRV628 EQU   CVTS01+728
CVTRV627 EQU   CVTS01+724
CVTRV626 EQU   CVTS01+720
CVTRV625 EQU   CVTS01+716
CVTRV624 EQU   CVTS01+712
CVTRV623 EQU   CVTS01+708
CVTRV622 EQU   CVTS01+704
CVTRV621 EQU   CVTS01+700
CVTRV620 EQU   CVTS01+696
CVTRV619 EQU   CVTS01+692
CVTRV618 EQU   CVTS01+688
CVTRV617 EQU   CVTS01+684
CVTRV616 EQU   CVTS01+680
CVTRV615 EQU   CVTS01+676
CVTRV614 EQU   CVTS01+672
CVTRV613 EQU   CVTS01+668
CVTTCASP EQU   CVTS01+664
CVT0PT03 EQU   CVTS01+660
CVT0PT0E EQU   CVTS01+656
CVTIRM   EQU   CVTS01+652
CVTCGK   EQU   CVTS01+648
CVTRV607 EQU   CVTS01+644
CVTRV606 EQU   CVTS01+640
CVTRV605 EQU   CVTS01+636
CVTRV604 EQU   CVTS01+632
CVTEFF02 EQU   CVTS01+628
CVTCBBR  EQU   CVTS01+624
CVTSSCR  EQU   CVTS01+620
CVTEVENT EQU   CVTS01+616
CVTCRCA  EQU   CVTS01+612
CVTTPIO  EQU   CVTS01+608
CVTADV   EQU   CVTS01+604
CVTGSDAB EQU   CVTGSDA
CVTQV3   EQU   CVTS01+596
CVTQV2   EQU   CVTS01+592
CVTQV1   EQU   CVTS01+588
CVTRPT   EQU   CVTS01+584
CVTSSRB  EQU   CVTS01+580
CVTCSDRL EQU   CVTS01+576
CVTEXP1  EQU   CVTS01+572
CVTRMPMT EQU   CVTS01+568
CVTRMPTT EQU   CVTS01+564
CVTVPSA  EQU   CVTS01+560
CVTVSTOP EQU   CVTS01+556
CVTGTFR8 EQU   CVTS01+552
CVTQUIT  EQU   CVTS01+548
CVTVACR  EQU   CVTS01+544
CVTWTCB  EQU   CVTS01+540
CVTSTPRS EQU   CVTS01+536
CVT0PT02 EQU   CVTS01+532
CVTDARCM EQU   CVTS01+528
CVTIRECM EQU   CVTS01+524
CVTJRECM EQU   CVTS01+520
CVTVEMS0 EQU   CVTS01+516
CVTSPFRR EQU   CVTS01+512
CVTRLSTG EQU   CVTS01+508
CVT0TC0A EQU   CVTS01+504
CVTGMBR  EQU   CVTS01+500
CVTLFRM  EQU   CVTS01+496
CVTRMBR  EQU   CVTS01+492
CVTVIOP  EQU   CVTS01+488
CVTRV307 EQU   CVTS01+486
CVTRV306 EQU   CVTS01+484
CVTRV305 EQU   CVTS01+482
CVTRV304 EQU   CVTS01+480
CVTRV303 EQU   CVTS01+478
CVTRV302 EQU   CVTS01+476
CVTTRCA  EQU   CVTS01+472
CVTRV297 EQU   CVTRV289
CVTRV296 EQU   CVTRV289
CVTRV295 EQU   CVTRV289
CVTRV294 EQU   CVTRV289
CVTRV293 EQU   CVTRV289
CVTRV292 EQU   CVTRV289
CVTRV291 EQU   CVTRV289
CVTRV290 EQU   CVTRV289
CVTRV288 EQU   CVTRV280
CVTRV287 EQU   CVTRV280
CVTRV286 EQU   CVTRV280
CVTRV285 EQU   CVTRV280
CVTRV284 EQU   CVTRV280
CVTRV283 EQU   CVTRV280
CVTRV282 EQU   CVTRV280
CVTRV281 EQU   CVTRV280
CVTRV279 EQU   CVTRV271
CVTRV278 EQU   CVTRV271
CVTRV277 EQU   CVTRV271
CVTRV276 EQU   CVTRV271
CVTRV275 EQU   CVTRV271
CVTRV274 EQU   CVTRV271
CVTRV273 EQU   CVTRV271
CVTRV272 EQU   CVTRV271
CVTRV270 EQU   CVTRV262
CVTRV269 EQU   CVTRV262
CVTRV268 EQU   CVTRV262
CVTRV267 EQU   CVTRV262
CVTRV266 EQU   CVTRV262
CVTRV265 EQU   CVTRV262
CVTRV264 EQU   CVTRV262
CVTRV263 EQU   CVTRV262
CVTVFP   EQU   CVTS01+464
CVTVSI   EQU   CVTS01+460
CVTVPSIB EQU   CVTS01+456
CVTMFACT EQU   CVTMFRTR
CVTMFCTL EQU   CVTS01+448
CVTPVBP  EQU   CVTS01+444
CVTPWI   EQU   CVTS01+440
CVTRV254 EQU   CVTS01+438
CVTRV253 EQU   CVTS01+436
CVTRV252 EQU   CVTS01+434
CVTRV251 EQU   CVTS01+433
CVTRV250 EQU   CVTS01+432
CVTRV249 EQU   CVTS01+431
CVTRV248 EQU   CVTS01+430
CVTRV247 EQU   CVTS01+429
CVTRV246 EQU   CVTS01+428
CVTRV245 EQU   CVTRV237
CVTRV244 EQU   CVTRV237
CVTRV243 EQU   CVTRV237
CVTRV242 EQU   CVTRV237
CVTRV241 EQU   CVTRV237
CVTRV240 EQU   CVTRV237
CVTRV239 EQU   CVTRV237
CVTRV238 EQU   CVTRV237
CVTRV236 EQU   CVTRV228
CVTRV235 EQU   CVTRV228
CVTRV234 EQU   CVTRV228
CVTRV233 EQU   CVTRV228
CVTRV232 EQU   CVTRV228
CVTRV231 EQU   CVTRV228
CVTRV230 EQU   CVTRV228
CVTRV229 EQU   CVTRV228
CVTRV227 EQU   CVTRV219
CVTRV226 EQU   CVTRV219
CVTRV225 EQU   CVTRV219
CVTRV224 EQU   CVTRV219
CVTRV223 EQU   CVTRV219
CVTRV222 EQU   CVTRV219
CVTRV221 EQU   CVTRV219
CVTRV220 EQU   CVTRV219
CVTRV218 EQU   CVTRV210
CVTRV217 EQU   CVTRV210
CVTRV216 EQU   CVTRV210
CVTRV215 EQU   CVTRV210
CVTRV214 EQU   CVTRV210
CVTRV213 EQU   CVTRV210
CVTRV212 EQU   CVTRV210
CVTRV211 EQU   CVTRV210
CVTLCCAT EQU   CVTS01+420
CVTPCCAT EQU   CVTS01+416
CVTIPCRP EQU   CVTS01+412
CVTIPCRI EQU   CVTS01+408
CVTIPCDS EQU   CVTS01+404
CVTAIDVT EQU   CVTS01+400
CVTSSAP  EQU   CVTS01+396
CVTEHCIR EQU   CVTS01+392
CVTEHDEF EQU   CVTS01+388
CVTDAIR  EQU   CVTS01+384
CVTPERFM EQU   CVTS01+380
CVT044R2 EQU   CVTS01+376
CVTFETCH EQU   CVTS01+372
CVTRSTWD EQU   CVTS01+368
CVTSPOST EQU   CVTS01+364
CVTIOBP  EQU   CVTS01+360
CVTASMVT EQU   CVTS01+356
CVTRECRQ EQU   CVTS01+352
CVTWSAC  EQU   CVTS01+348
CVTRV149 EQU   CVTS01+344
CVTWSAL  EQU   CVTS01+340
CVTSPSA  EQU   CVTS01+336
CVTGLMN  EQU   CVTS01+332
CVTVEAC0 EQU   CVTS01+328
CVT062R1 EQU   CVTS01+324
CVTRPOST EQU   CVTS01+320
CVTDQIQE EQU   CVTS01+316
CVTCSD   EQU   CVTS01+312
CVTLKRMA EQU   CVTS01+308
CVTRSPIE EQU   CVTS01+304
CVTRENQ  EQU   CVTS01+300
CVTLQCB  EQU   CVTS01+296
CVTFQCB  EQU   CVTS01+292
CVTQCS01 EQU   CVTS01+288
CVTAPFT  EQU   CVTS01+284
CVTPARRL EQU   CVTS01+280
CVTVWAIT EQU   CVTS01+276
CVTGSPL  EQU   CVTS01+272
CVTLSMQ  EQU   CVTS01+268
CVTGSMQ  EQU   CVTS01+264
CVTEXPRO EQU   CVTS01+260
CVTOPCTP EQU   CVTS01+256
CVTSIC   EQU   CVTS01+252
CVTTPIOS EQU   CVTS01+248
CVTRTMS  EQU   CVTS01+244
CVTSDBF  EQU   CVTS01+240
CVTSCBP  EQU   CVTS01+236
CVTSDMP  EQU   CVTS01+232
CVTSV60  EQU   CVTS01+228
CVTRTMCT EQU   CVTS01+224
CVTASCBL EQU   CVTS01+220
CVTASCBH EQU   CVTS01+216
CVTGDA   EQU   CVTS01+212
CVTASVT  EQU   CVTS01+208
CVTVVMDI EQU   CVTS01+204
CVTAQTOP EQU   CVTS01+200
CVTIOSCS EQU   CVTS01+196
CVTSDRM  EQU   CVTS01+192
CVTOPTE  EQU   CVTS01+188
CVTSTXU  EQU   CVTS01+184
CVTQUIS  EQU   CVTS01+180
CVTPARS  EQU   CVTS01+176
CVTS1EE  EQU   CVTS01+172
CVTFRAS  EQU   CVTS01+168
CVTQSAS  EQU   CVTS01+164
CVTCRAS  EQU   CVTS01+160
CVTCRMN  EQU   CVTS01+156
CVTDELCP EQU   CVTS01+152
CVTFRECL EQU   CVTS01+148
CVTGETCL EQU   CVTS01+144
CVTBLDCP EQU   CVTS01+140
CVTAUTHL EQU   CVTS01+136
CVTSCAN  EQU   CVTS01+132
CVTRV144 EQU   CVTS01+130
CVTMAXMP EQU   CVTS01+128
CVTSTCK  EQU   CVTS01+124
CVTRV139 EQU   CVTS01+123
CVTDSSAC EQU   CVTS01+122
CVTRV513 EQU   CVTS01+121
CVTIOSPL EQU   CVTS01+120
CVTPTGT  EQU   CVTS01+116
CVTCSPIE EQU   CVTS01+112
CVTSMFEX EQU   CVTS01+108
CVTOLT0A EQU   CVTS01+104
CVTSRBRT EQU   CVTS01+100
CVTPUTL  EQU   CVTS01+96
CVTASCRL EQU   CVTS01+92
CVTASCRF EQU   CVTS01+88
CVTRV326 EQU   CVTS01+84
CVTRV325 EQU   CVTS01+80
CVTRV324 EQU   CVTS01+76
CVT0VL01 EQU   CVTS01+72
CVTSHRVM EQU   CVTS01+68
CVTRV332 EQU   CVTS01+64
CVTTAS   EQU   CVTS01+60
CVTRSCN  EQU   CVTS01+56
CVTTRAC2 EQU   CVTS01+54
CVTTRACE EQU   CVTS01+52
CVTAPG   EQU   CVTS01+51
CVTSDTRC EQU   CVTCTLFG
CVTGTRCE EQU   CVTCTLFG
CVTNOMP  EQU   CVTCTLFG
CVTRSV79 EQU   CVTCTLFG
CVTDSTAT EQU   CVTCTLFG
CVTRSV78 EQU   CVTCTLFG
CVTRV333 EQU   CVTCTLFG
CVTRV323 EQU   CVTCTLFG
CVTSPVLK EQU   CVTS01+49
CVTRSV77 EQU   CVTS01+48
CVTRV331 EQU   CVTS01+44
CVTRV330 EQU   CVTS01+40
CVTRV329 EQU   CVTS01+36
CVTRV328 EQU   CVTS01+32
CVTRV322 EQU   CVTS01+28
CVTSLID  EQU   CVTSLIDA+1
CVTSYLK  EQU   CVTSLIDA
CVTRV321 EQU   CVTS01+20
CVTRV320 EQU   CVTS01+16
CVTLPDIR EQU   CVTLPDIA+1
CVTRSV69 EQU   CVTDIRST
CVTRSV68 EQU   CVTDIRST
CVTRSV67 EQU   CVTDIRST
CVTRSV66 EQU   CVTDIRST
CVTRSV65 EQU   CVTDIRST
CVTRSV64 EQU   CVTDIRST
CVTRSV63 EQU   CVTDIRST
CVTDICOM EQU   CVTDIRST
CVTPVTP  EQU   CVTS01+8
CVTLPDSR EQU   CVTS01+4
CVTGETL  EQU   CVTS01
WKECHNGP EQU   WKECHAIN+1
@NM00094 EQU   WKEFLAGS
WKEGATE  EQU   WKEFLAGS
@NM00093 EQU   ISTWKE
VYCRSV02 EQU   ISTVYCRR+128
VYCRSV04 EQU   ISTVYCRR+126
VYCRSV03 EQU   VYCCRT+11
CINCFE   EQU   VYCCRT+11
CINCE9   EQU   VYCCRT+11
CINCVO   EQU   VYCCRT+11
CINCR5   EQU   VYCCRT+11
CINCR3   EQU   VYCCRT+10
CINCE8   EQU   VYCCRT+10
CINCE7   EQU   VYCCRT+10
CINCE6   EQU   VYCCRT+10
CINCE5   EQU   VYCCRT+10
CINCE1   EQU   VYCCRT+10
CINCUQ   EQU   VYCCRT+10
CINCUB   EQU   VYCCRT+10
CINCUA   EQU   VYCCRT+9
CINCX9   EQU   VYCCRT+9
CINCX8   EQU   VYCCRT+9
CINCX7   EQU   VYCCRT+9
CINCX6   EQU   VYCCRT+9
CINCX3   EQU   VYCCRT+9
CINCX2   EQU   VYCCRT+9
CINCX1   EQU   VYCCRT+9
CINCX0   EQU   VYCCRT+8
CINCW9   EQU   VYCCRT+8
CINCW8   EQU   VYCCRT+8
CINCW7   EQU   VYCCRT+8
CINCW6   EQU   VYCCRT+8
CINCW5   EQU   VYCCRT+8
CINCW4   EQU   VYCCRT+8
CINCW2   EQU   VYCCRT+8
CINCW0   EQU   VYCCRT+7
CINCV9   EQU   VYCCRT+7
CINCV8   EQU   VYCCRT+7
CINCV7   EQU   VYCCRT+7
CINCV6   EQU   VYCCRT+7
CINCV5   EQU   VYCCRT+7
CINCV4   EQU   VYCCRT+7
CINCV3   EQU   VYCCRT+7
CINCV2   EQU   VYCCRT+6
CINCU8   EQU   VYCCRT+6
CINCU7   EQU   VYCCRT+6
CINCU6   EQU   VYCCRT+6
CINCU5   EQU   VYCCRT+6
CINCU4   EQU   VYCCRT+6
CINCU3   EQU   VYCCRT+6
CINCU2   EQU   VYCCRT+6
CINCU1   EQU   VYCCRT+5
CINCU0   EQU   VYCCRT+5
CINCUM   EQU   VYCCRT+5
CINCS1   EQU   VYCCRT+5
CINCL8   EQU   VYCCRT+5
CINCL7   EQU   VYCCRT+5
CINCL6   EQU   VYCCRT+5
CINCL5   EQU   VYCCRT+5
CINCL4   EQU   VYCCRT+4
CINCL3   EQU   VYCCRT+4
CINCL2   EQU   VYCCRT+4
CINCL1   EQU   VYCCRT+4
CINCL0   EQU   VYCCRT+4
CINCF4   EQU   VYCCRT+4
CINCF3   EQU   VYCCRT+4
CINCF1   EQU   VYCCRT+4
CINCFM   EQU   VYCCRT+3
CINCE4   EQU   VYCCRT+3
CINCE3   EQU   VYCCRT+3
CINCE2   EQU   VYCCRT+3
CINCE0   EQU   VYCCRT+3
CINCD9   EQU   VYCCRT+3
CINCD8   EQU   VYCCRT+3
CINCD7   EQU   VYCCRT+3
CINCD6   EQU   VYCCRT+2
CINCD5   EQU   VYCCRT+2
CINCD4   EQU   VYCCRT+2
CINCD3   EQU   VYCCRT+2
CINCD2   EQU   VYCCRT+2
CINCD1   EQU   VYCCRT+2
CINCIP   EQU   VYCCRT+2
CINCR2   EQU   VYCCRT+2
CINCMS   EQU   VYCCRT+1
CINCVN   EQU   VYCCRT+1
CINCVS   EQU   VYCCRT+1
CINCVP   EQU   VYCCRT+1
CINCVX   EQU   VYCCRT+1
CINCFS   EQU   VYCCRT+1
CINCSM   EQU   VYCCRT+1
CINCR1   EQU   VYCCRT+1
CINCLF   EQU   VYCCRT
CINCVA   EQU   VYCCRT
CINCVI   EQU   VYCCRT
CINCMD   EQU   VYCCRT
CINCMY   EQU   VYCCRT
CINCDL   EQU   VYCCRT
CINCIO   EQU   VYCCRT
VYCRSV01 EQU   VYCNTRD+11
NINCFE   EQU   VYCNTRD+11
NINCE9   EQU   VYCNTRD+11
NINCVO   EQU   VYCNTRD+11
NINCR5   EQU   VYCNTRD+11
NINCR3   EQU   VYCNTRD+10
NINCE8   EQU   VYCNTRD+10
NINCE7   EQU   VYCNTRD+10
NINCE6   EQU   VYCNTRD+10
NINCE5   EQU   VYCNTRD+10
NINCE1   EQU   VYCNTRD+10
NINCUQ   EQU   VYCNTRD+10
NINCUB   EQU   VYCNTRD+10
NINCUA   EQU   VYCNTRD+9
NINCX9   EQU   VYCNTRD+9
NINCX8   EQU   VYCNTRD+9
NINCX7   EQU   VYCNTRD+9
NINCX6   EQU   VYCNTRD+9
NINCX3   EQU   VYCNTRD+9
NINCX2   EQU   VYCNTRD+9
NINCX1   EQU   VYCNTRD+9
NINCX0   EQU   VYCNTRD+8
NINCW9   EQU   VYCNTRD+8
NINCW8   EQU   VYCNTRD+8
NINCW7   EQU   VYCNTRD+8
NINCW6   EQU   VYCNTRD+8
NINCW5   EQU   VYCNTRD+8
NINCW4   EQU   VYCNTRD+8
NINCW2   EQU   VYCNTRD+8
NINCW0   EQU   VYCNTRD+7
NINCV9   EQU   VYCNTRD+7
NINCV8   EQU   VYCNTRD+7
NINCV7   EQU   VYCNTRD+7
NINCV6   EQU   VYCNTRD+7
NINCV5   EQU   VYCNTRD+7
NINCV4   EQU   VYCNTRD+7
NINCV3   EQU   VYCNTRD+7
NINCV2   EQU   VYCNTRD+6
NINCU8   EQU   VYCNTRD+6
NINCU7   EQU   VYCNTRD+6
NINCU6   EQU   VYCNTRD+6
NINCU5   EQU   VYCNTRD+6
NINCU4   EQU   VYCNTRD+6
NINCU3   EQU   VYCNTRD+6
NINCU2   EQU   VYCNTRD+6
NINCU1   EQU   VYCNTRD+5
NINCU0   EQU   VYCNTRD+5
NINCUM   EQU   VYCNTRD+5
NINCS1   EQU   VYCNTRD+5
NINCL8   EQU   VYCNTRD+5
NINCL7   EQU   VYCNTRD+5
NINCL6   EQU   VYCNTRD+5
NINCL5   EQU   VYCNTRD+5
NINCL4   EQU   VYCNTRD+4
NINCL3   EQU   VYCNTRD+4
NINCL2   EQU   VYCNTRD+4
NINCL1   EQU   VYCNTRD+4
NINCL0   EQU   VYCNTRD+4
NINCF4   EQU   VYCNTRD+4
NINCF3   EQU   VYCNTRD+4
NINCF1   EQU   VYCNTRD+4
NINCFM   EQU   VYCNTRD+3
NINCE4   EQU   VYCNTRD+3
NINCE3   EQU   VYCNTRD+3
NINCE2   EQU   VYCNTRD+3
NINCE0   EQU   VYCNTRD+3
NINCD9   EQU   VYCNTRD+3
NINCD8   EQU   VYCNTRD+3
NINCD7   EQU   VYCNTRD+3
NINCD6   EQU   VYCNTRD+2
NINCD5   EQU   VYCNTRD+2
NINCD4   EQU   VYCNTRD+2
NINCD3   EQU   VYCNTRD+2
NINCD2   EQU   VYCNTRD+2
NINCD1   EQU   VYCNTRD+2
NINCIP   EQU   VYCNTRD+2
NINCR2   EQU   VYCNTRD+2
NINCMS   EQU   VYCNTRD+1
NINCVN   EQU   VYCNTRD+1
NINCVS   EQU   VYCNTRD+1
NINCVP   EQU   VYCNTRD+1
NINCVX   EQU   VYCNTRD+1
NINCFS   EQU   VYCNTRD+1
NINCSM   EQU   VYCNTRD+1
NINCR1   EQU   VYCNTRD+1
NINCLF   EQU   VYCNTRD
NINCVA   EQU   VYCNTRD
NINCVI   EQU   VYCNTRD
NINCMD   EQU   VYCNTRD
NINCMY   EQU   VYCNTRD
NINCDL   EQU   VYCNTRD
NINCIO   EQU   VYCNTRD
VYCCNS   EQU   ISTVYCRR
CNSRSV05 EQU   CNSTFLDB+2
CNSLOG0B EQU   CNSTFLDB+2
CNSACCTB EQU   CNSTFLDB+2
CNSFREEB EQU   CNSTFLDB+2
CNSGETSB EQU   CNSTFLDB+2
CNSSEARB EQU   CNSTFLDB+2
CNSQUEUB EQU   CNSTFLDB+2
CNSACONB EQU   CNSTFLDB+2
CNSTCONB EQU   CNSTFLDB+1
CNSCLAQB EQU   CNSTFLDB+1
CNSCLINB EQU   CNSTFLDB+1
CNSGBINB EQU   CNSTFLDB+1
CNSLGINB EQU   CNSTFLDB+1
CNSACINB EQU   CNSTFLDB+1
CNSPSINB EQU   CNSTFLDB+1
CNSRQRLB EQU   CNSTFLDB+1
CNSTRRLB EQU   CNSTFLDB
CNSDORLB EQU   CNSTFLDB
CNSRLINB EQU   CNSTFLDB
CNSQREQB EQU   CNSTFLDB
CNSXREQB EQU   CNSTFLDB
CNSAQINB EQU   CNSTFLDB
CNSAUTHB EQU   CNSTFLDB
CNSMRINB EQU   CNSTFLDB
CNSRSV01 EQU   CNSTFLDA+2
CNSLOG0A EQU   CNSTFLDA+2
CNSACCTA EQU   CNSTFLDA+2
CNSFREEA EQU   CNSTFLDA+2
CNSGETSA EQU   CNSTFLDA+2
CNSSEARA EQU   CNSTFLDA+2
CNSQUEUA EQU   CNSTFLDA+2
CNSACONA EQU   CNSTFLDA+2
CNSTCONA EQU   CNSTFLDA+1
CNSCLAQA EQU   CNSTFLDA+1
CNSCLINA EQU   CNSTFLDA+1
CNSGBINA EQU   CNSTFLDA+1
CNSLGINA EQU   CNSTFLDA+1
CNSACINA EQU   CNSTFLDA+1
CNSPSINA EQU   CNSTFLDA+1
CNSRQRLA EQU   CNSTFLDA+1
CNSTRRLA EQU   CNSTFLDA
CNSDORLA EQU   CNSTFLDA
CNSRLINA EQU   CNSTFLDA
CNSQREQA EQU   CNSTFLDA
CNSXREQA EQU   CNSTFLDA
CNSAQINA EQU   CNSTFLDA
CNSAUTHA EQU   CNSTFLDA
CNSMRINA EQU   CNSTFLDA
CNSTPFX  EQU   ISTCNSTA
CRACHAIN EQU   ISTCRA+928
CRARSV02 EQU   ISTCRA+924
CRARSV01 EQU   ISTCRA+920
CRABFTBA EQU   CRABUFA
CRAMASK  EQU   CRASVC+64
CRAHSIZ  EQU   CRASVC+60
CRAASCRR EQU   CRASVC
CRAPSS   EQU   ISTCRA+160
CRARPH   EQU   ISTCRA+52
CRALAPTR EQU   CRABASIC+48
CRAL9PTR EQU   CRABASIC+44
CRAL8PTR EQU   CRABASIC+40
CRAL7PTR EQU   CRABASIC+36
CRAL6PTR EQU   CRABASIC+32
CRAL5PTR EQU   CRABASIC+28
CRAL4PTR EQU   CRABASIC+24
CRAL3PTR EQU   CRABASIC+20
CRAL2PTR EQU   CRABASIC+16
CRAL1PTR EQU   CRABASIC+12
CRALEV01 EQU   CRALKACT+3
CRALEV02 EQU   CRALKACT+3
CRALEV03 EQU   CRALKACT+3
CRALEV04 EQU   CRALKACT+3
CRALEV05 EQU   CRALKACT+3
CRALEV06 EQU   CRALKACT+3
CRALEV07 EQU   CRALKACT+3
CRALEV08 EQU   CRALKACT+3
CRALEV09 EQU   CRALKACT+2
CRALEV10 EQU   CRALKACT+2
CRALEV11 EQU   CRALKACT+2
CRALEV12 EQU   CRALKACT+2
CRALEV13 EQU   CRALKACT+2
CRALEV14 EQU   CRALKACT+2
CRALEV15 EQU   CRALKACT+2
CRALEV16 EQU   CRALKACT+2
CRALEV17 EQU   CRALKACT+1
CRALEV18 EQU   CRALKACT+1
CRALEV19 EQU   CRALKACT+1
CRALEV20 EQU   CRALKACT+1
CRALEV21 EQU   CRALKACT+1
CRALEV22 EQU   CRALKACT+1
CRALEV23 EQU   CRALKACT+1
CRALEV24 EQU   CRALKACT+1
CRALEV25 EQU   CRALKACT
CRALEV26 EQU   CRALKACT
CRALEV27 EQU   CRALKACT
CRALEV28 EQU   CRALKACT
CRALEV29 EQU   CRALKACT
CRALEV30 EQU   CRALKACT
CRALEV31 EQU   CRALKACT
CRALEV32 EQU   CRALKACT
@NM00092 EQU   ISTAPCRR+137
@NM00091 EQU   APC57FLG
APCNREL  EQU   APC57FLG
APCRECRA EQU   APC57FLG
@NM00090 EQU   APC54FLG
APCRLST  EQU   APC54FLG
APCPR153 EQU   APC53FLG
@NM00089 EQU   APC52FLG
APCWKF   EQU   APC52FLG
APCNWF   EQU   APC52FLG
APCRDQ   EQU   APC52FLG
APCQENQ  EQU   APC52FLG
APCSMSR  EQU   APC52FLG
APCCKRQ  EQU   APC52FLG
@NM00088 EQU   APC31FLG
APCSORT  EQU   APC31FLG
APCRESCH EQU   APC31FLG
APCTPXIT EQU   APC31FLG
APCSWTWD EQU   ISTAPCRR+128
APCSAV2  EQU   ISTAPCRR+124
APCSAV1  EQU   ISTAPCRR+120
APCRETCD EQU   APCCOMF+2
@NM00087 EQU   APCCOMF1+1
APCZLBER EQU   APCCOMF1
APCEXIT  EQU   APCCOMF1
APCRELR  EQU   APCCOMF1
APCIRB2  EQU   APCCOMF1
APCIRB1  EQU   APCCOMF1
APCSMCR  EQU   APCCOMF1
APCUETSK EQU   APCCOMF1
APCSSTSK EQU   APCCOMF1
APCESTAL EQU   APCSAVE
APCFRRPM EQU   ISTAPCRR+40
APCQWFO  EQU   ISTAPCRR+36
APCPABSV EQU   ISTAPCRR+32
APCRTRN  EQU   ISTAPCRR+28
APCTCBA  EQU   ISTAPCRR+24
APCPSTA  EQU   ISTAPCRR+20
@NM00086 EQU   APCRFLG+1
APC31R   EQU   APCRFLG
APC58R   EQU   APCRFLG
APC57R   EQU   APCRFLG
APC56R   EQU   APCRFLG
APC54R   EQU   APCRFLG
APC53R   EQU   APCRFLG
APC52R   EQU   APCRFLG
APC51R   EQU   APCRFLG
@NM00085 EQU   APCATFLG+1
APC31E   EQU   APCATFLG
APC58E   EQU   APCATFLG
APC57E   EQU   APCATFLG
APC56E   EQU   APCATFLG
APC54E   EQU   APCATFLG
APC53E   EQU   APCATFLG
APC52E   EQU   APCATFLG
APC51E   EQU   APCATFLG
APCHDRSV EQU   ISTAPCRR
ASCPSREG EQU   ISTASCRR+44
ASCUSR01 EQU   ASCUSRGS+12
ASCUSR00 EQU   ASCUSRGS+8
ASCUSR15 EQU   ASCUSRGS+4
ASCUSR14 EQU   ASCUSRGS
ASCETRYA EQU   ISTASCRR+24
ASCKEY   EQU   ISTASCRR+23
ASCAUDIT EQU   ASCFLG3
ASCFBDUD EQU   ASCFLG3
ASCLLKF  EQU   ASCFLG3
ASCKEYF  EQU   ASCFLG3
ASCFBDAL EQU   ASCFLG3
ASCFSRGT EQU   ASCFLG3
ASCICR   EQU   ASCFLG2
ASCFSRIC EQU   ASCFLG2
ASCFBDIC EQU   ASCFLG2
ASCFBAIC EQU   ASCFLG2
ASCPASTR EQU   ASCFLG1
ASCFSR   EQU   ASCFLG1
ASCFBD   EQU   ASCFLG1
ASCFBA   EQU   ASCFLG1
ASCPFCRR EQU   ISTASCRR
ZCRRU    EQU   ZCRRHRU+3
ZCRRH    EQU   ZCRRHRU
ZCRWORDA EQU   ISTZCRR+477
ZCRCMNRC EQU   ISTZCRR+476
ZCRRSV97 EQU   ZCRENTER+18
ZCREIC2B EQU   ZCRENTER+18
ZCREAC2B EQU   ZCRENTER+18
ZCRELCAB EQU   ZCRENTER+18
ZCREDCMF EQU   ZCRENTER+18
ZCREBCIF EQU   ZCRENTER+18
ZCREICSG EQU   ZCRENTER+18
ZCREDCK0 EQU   ZCRENTER+18
ZCRECFY0 EQU   ZCRENTER+17
ZCREKCCB EQU   ZCRENTER+17
ZCREDCNB EQU   ZCRENTER+17
ZCREICOE EQU   ZCRENTER+17
ZCREBCNB EQU   ZCRENTER+17
ZCREBC0L EQU   ZCRENTER+17
ZCREBCAL EQU   ZCRENTER+17
ZCREDCQR EQU   ZCRENTER+17
ZCREDCPR EQU   ZCRENTER+16
ZCREBCSB EQU   ZCRENTER+16
ZCREAC1R EQU   ZCRENTER+16
ZCRECCCI EQU   ZCRENTER+16
ZCRECCAI EQU   ZCRENTER+16
ZCRECCBI EQU   ZCRENTER+16
ZCREBCAR EQU   ZCRENTER+16
ZCREBCDR EQU   ZCRENTER+16
ZCREBCBR EQU   ZCRENTER+15
ZCREDCXR EQU   ZCRENTER+15
ZCREDCWB EQU   ZCRENTER+15
ZCREDCWR EQU   ZCRENTER+15
ZCREKCCN EQU   ZCRENTER+15
ZCREKCBN EQU   ZCRENTER+15
ZCREKCBB EQU   ZCRENTER+15
ZCREJC0B EQU   ZCRENTER+15
ZCREJCDB EQU   ZCRENTER+14
ZCREJCCB EQU   ZCRENTER+14
ZCREJCBB EQU   ZCRENTER+14
ZCREJCAB EQU   ZCRENTER+14
ZCREIC1B EQU   ZCRENTER+14
ZCREIC0B EQU   ZCRENTER+14
ZCREICX0 EQU   ZCRENTER+14
ZCREICWB EQU   ZCRENTER+14
ZCREICVB EQU   ZCRENTER+13
ZCREICUB EQU   ZCRENTER+13
ZCREICTB EQU   ZCRENTER+13
ZCREICSC EQU   ZCRENTER+13
ZCREICSB EQU   ZCRENTER+13
ZCREICRB EQU   ZCRENTER+13
ZCREICQB EQU   ZCRENTER+13
ZCREICQA EQU   ZCRENTER+13
ZCREICOB EQU   ZCRENTER+12
ZCREICOA EQU   ZCRENTER+12
ZCREICNB EQU   ZCRENTER+12
ZCREICNA EQU   ZCRENTER+12
ZCREICMB EQU   ZCRENTER+12
ZCREICLB EQU   ZCRENTER+12
ZCREICKG EQU   ZCRENTER+12
ZCREICKE EQU   ZCRENTER+12
ZCREICKB EQU   ZCRENTER+11
ZCREICJB EQU   ZCRENTER+11
ZCREICID EQU   ZCRENTER+11
ZCREICIB EQU   ZCRENTER+11
ZCREICHB EQU   ZCRENTER+11
ZCREICGB EQU   ZCRENTER+11
ZCREICEB EQU   ZCRENTER+11
ZCREICDB EQU   ZCRENTER+11
ZCREICCI EQU   ZCRENTER+10
ZCREICCB EQU   ZCRENTER+10
ZCREICBI EQU   ZCRENTER+10
ZCREICBB EQU   ZCRENTER+10
ZCREICAB EQU   ZCRENTER+10
ZCREICAA EQU   ZCRENTER+10
ZCREHCAN EQU   ZCRENTER+10
ZCREGC0B EQU   ZCRENTER+10
ZCREGC0A EQU   ZCRENTER+9
ZCREGCLA EQU   ZCRENTER+9
ZCREGCEB EQU   ZCRENTER+9
ZCREGCDB EQU   ZCRENTER+9
@NM00084 EQU   ZCRENTER+9
ZCREGCBB EQU   ZCRENTER+9
ZCREGCAB EQU   ZCRENTER+9
ZCREFCEB EQU   ZCRENTER+9
ZCREFCEA EQU   ZCRENTER+8
ZCREECTA EQU   ZCRENTER+8
ZCREECEA EQU   ZCRENTER+8
ZCREECDA EQU   ZCRENTER+8
ZCREECCB EQU   ZCRENTER+8
ZCREECCA EQU   ZCRENTER+8
ZCREECBB EQU   ZCRENTER+8
ZCREECBA EQU   ZCRENTER+8
ZCREDCMB EQU   ZCRENTER+7
ZCREDCL0 EQU   ZCRENTER+7
ZCREDCKB EQU   ZCRENTER+7
ZCREDCKA EQU   ZCRENTER+7
ZCREDCJ0 EQU   ZCRENTER+7
ZCREDCI0 EQU   ZCRENTER+7
ZCREDCH0 EQU   ZCRENTER+7
ZCREDCF0 EQU   ZCRENTER+7
ZCREDCE0 EQU   ZCRENTER+6
ZCREDCD0 EQU   ZCRENTER+6
ZCREDCC0 EQU   ZCRENTER+6
ZCREDCB0 EQU   ZCRENTER+6
ZCREDCA0 EQU   ZCRENTER+6
ZCRECC2B EQU   ZCRENTER+6
ZCRECC1B EQU   ZCRENTER+6
ZCRECC1A EQU   ZCRENTER+6
ZCRECC0B EQU   ZCRENTER+5
ZCRECC0A EQU   ZCRENTER+5
ZCREBC0B EQU   ZCRENTER+5
ZCREBC0A EQU   ZCRENTER+5
ZCREBCZ0 EQU   ZCRENTER+5
ZCREBCY0 EQU   ZCRENTER+5
ZCREBCX0 EQU   ZCRENTER+5
ZCREBCXA EQU   ZCRENTER+5
ZCREBCSC EQU   ZCRENTER+4
ZCREBCRB EQU   ZCRENTER+4
ZCREBCRA EQU   ZCRENTER+4
ZCREBCQB EQU   ZCRENTER+4
ZCREBCPB EQU   ZCRENTER+4
ZCREBCOB EQU   ZCRENTER+4
ZCREBCNE EQU   ZCRENTER+4
ZCREBCND EQU   ZCRENTER+4
ZCREBCMB EQU   ZCRENTER+3
ZCREBCLB EQU   ZCRENTER+3
ZCREBCLA EQU   ZCRENTER+3
ZCREBCKB EQU   ZCRENTER+3
ZCREBCKA EQU   ZCRENTER+3
ZCREBCJB EQU   ZCRENTER+3
ZCREBCJA EQU   ZCRENTER+3
ZCREBCID EQU   ZCRENTER+3
ZCREBCIB EQU   ZCRENTER+2
ZCREBCIA EQU   ZCRENTER+2
ZCREBCHB EQU   ZCRENTER+2
ZCREBCHA EQU   ZCRENTER+2
ZCREBCGB EQU   ZCRENTER+2
ZCREBCGA EQU   ZCRENTER+2
ZCREBCFB EQU   ZCRENTER+2
ZCREBCFA EQU   ZCRENTER+2
ZCREBCEB EQU   ZCRENTER+1
ZCREBCDI EQU   ZCRENTER+1
ZCREBCCB EQU   ZCRENTER+1
ZCREBCBI EQU   ZCRENTER+1
ZCREBCBB EQU   ZCRENTER+1
ZCREBCBA EQU   ZCRENTER+1
ZCREBCAM EQU   ZCRENTER+1
ZCREBCAI EQU   ZCRENTER+1
ZCREBCAG EQU   ZCRENTER
ZCREBCAE EQU   ZCRENTER
ZCREBCAB EQU   ZCRENTER
ZCREBCAA EQU   ZCRENTER
ZCREAC1B EQU   ZCRENTER
ZCREAC0B EQU   ZCRENTER
ZCREAC0A EQU   ZCRENTER
ZCREAC1A EQU   ZCRENTER
ZCRTNAME EQU   ZCRAUDIT+1
ZCRTID   EQU   ZCRAUDIT
ZCRREMIC EQU   ISTZCRR+436
ZCRSAVEZ EQU   ISTZCRR+196
ZCRDAFSV EQU   ZCRCIDSV+2
ZCRSAFSV EQU   ZCRCIDSV
ZCRR13SV EQU   ISTZCRR+188
ZCRR2SV  EQU   ISTZCRR+184
ZCROPCDE EQU   ISTZCRR+183
ZCRPRMTC EQU   ISTZCRR+182
ZCRRCDSV EQU   ISTZCRR+181
ZCRAWQSW EQU   ISTZCRR+180
ZCRTOPQ  EQU   ISTZCRR+180
ZCRLSTFB EQU   ISTZCRR+180
ZCRXSCHD EQU   ISTZCRR+180
ZCRNXTEL EQU   ISTZCRR+180
ZCRSCANQ EQU   ISTZCRR+180
ZCRMOREL EQU   ISTZCRR+180
ZCRFBPRC EQU   ISTZCRR+180
ZCRFSBSV EQU   ISTZCRR+176
ZCRSVWK5 EQU   ZCRWKARA+16
ZCRSVWK4 EQU   ZCRWKARA+12
ZCRSVWK3 EQU   ZCRWKARA+8
ZCRSVWK2 EQU   ZCRWKARA+4
ZCRSVWK1 EQU   ZCRWKARA
ZCRSVF25 EQU   ZCRSVRTN+96
ZCRSVF24 EQU   ZCRSVRTN+92
ZCRSVF23 EQU   ZCRSVRTN+88
ZCRSVF22 EQU   ZCRSVRTN+84
ZCRSVF21 EQU   ZCRSVRTN+80
ZCRSVF20 EQU   ZCRSVRTN+76
ZCRSVF19 EQU   ZCRSVRTN+72
ZCRSVF18 EQU   ZCRSVRTN+68
ZCRSVF17 EQU   ZCRSVRTN+64
ZCRSVF16 EQU   ZCRSVRTN+60
ZCRSVF15 EQU   ZCRSVRTN+56
ZCRSVF14 EQU   ZCRSVRTN+52
ZCRSVF13 EQU   ZCRSVRTN+48
ZCRSVF12 EQU   ZCRSVRTN+44
ZCRSVF11 EQU   ZCRSVRTN+40
ZCRSVF10 EQU   ZCRSVRTN+36
ZCRSVF9  EQU   ZCRSVRTN+32
ZCRSVF8  EQU   ZCRSVRTN+28
ZCRSVF7  EQU   ZCRSVRTN+24
ZCRSVF6  EQU   ZCRSVRTN+20
ZCRSVF5  EQU   ZCRSVRTN+16
ZCRSVF4  EQU   ZCRSVRTN+12
ZCRSVF3  EQU   ZCRSVRTN+8
ZCRSVF2  EQU   ZCRSVRTN+4
ZCRSVF1  EQU   ZCRSVRTN
ZCRPVZB  EQU   ISTZCRR+52
ZCRZLB   EQU   ISTZCRR+48
ZCRBFPTR EQU   ISTZCRR+44
ZCRCCWA  EQU   ISTZCRR+40
ZCRPSW   EQU   ZCRPARMS+15
ZCRPCHAR EQU   ZCRPARMS+14
ZCRPRES2 EQU   ZCRPCOD2
ZCRPMFGF EQU   ZCRPCOD2
ZCRPFHDR EQU   ZCRPCOD2
ZCRPPG2  EQU   ZCRPCOD2
ZCRPRES  EQU   ZCRPCOD1
ZCRPCFTX EQU   ZCRPCOD1
ZCRPBUF  EQU   ZCRPCOD1
ZCRPLSCB EQU   ZCRPCOD1
ZCRPLSBQ EQU   ZCRPLSBF
ZCRPFSB  EQU   ZCRPCOD1
ZCRPLNG  EQU   ZCRPCOD1
ZCRPPG   EQU   ZCRPCOD1
ZCRDTODA EQU   ZCRDFRDA
ZCRMLNG  EQU   ZCRPARMS+8
ZCRTBPTR EQU   ZCRPARMS+4
ZCRCBPTR EQU   ZCRFBPTR
ZCRCRLCP EQU   ISTZCRR+20
ZCRMDATA EQU   ZCRSCPSW
ZCRSKIPT EQU   ZCRSCPSW
ZCRFSBWE EQU   ZCRSCPSW
ZCRPRCMP EQU   ZCRSCPSW
ZCRLREQ  EQU   ZCRSCPSW
ZCRRJLCP EQU   ZCRSCPSW
ZCRTPINV EQU   ZCRSCPSW
ZCRTPEX  EQU   ZCRSCPSW
@NM00083 EQU   ZCRIBPR
ZCR3270R EQU   ZCRIBPR
ZCR3270  EQU   ZCRIBPR
ZCRLCPFD EQU   ZCRIBPR
ZCRLCPFR EQU   ZCRIBPR
ZCRRELK  EQU   ZCRIBPR
ZCRERR   EQU   ZCRIBPR
ZCRNOBUF EQU   ZCRIBPR
@NM00082 EQU   ZCRPFLGS
ZCRQAHED EQU   ZCRPFLGS
ZCRF1RES EQU   ZCRGENSW
ZCRBRIS  EQU   ZCRGENSW
ZCRCLRBD EQU   ZCRGENSW
ZCREXRES EQU   ZCRGENSW
ZCRLCSYN EQU   ZCRGENSW
ZCRRT06  EQU   ZCRGENSW
ZCRTSW2  EQU   ZCRGENSW
ZCRTSW1  EQU   ZCRGENSW
ZCRINLCP EQU   ZCRFLGS3
ZCRWRPTR EQU   ZCRFLGS3
ZCRNOFRE EQU   ZCRFLGS3
ZCREDRIV EQU   ZCRFLGS3
ZCRDISC  EQU   ZCRFLGS3
ZCRTPDIS EQU   ZCRFLGS3
ZCRTPCON EQU   ZCRFLGS3
ZCRTIC   EQU   ZCRFLGS3
ZCRCNLXL EQU   ZCRRESET
ZCRENDAN EQU   ZCRSWFLD
ZCRENDXL EQU   ZCRSWFLD
ZCRENDX  EQU   ZCRSWFLD
ZCROB1   EQU   ZCRNDLCP
ZCRENDPR EQU   ZCRSWFLD
ZCREXTYP EQU   ZCRSWFLD
ZCRSLCP  EQU   ZCRENDSH
ZCRIF0E3 EQU   ZCRFLGS2
ZCRIF0E2 EQU   ZCRFLGS2
ZCRIF0E1 EQU   ZCRFLGS2
ZCROB    EQU   ZCRFLGS2
ZCRFMSED EQU   ZCRFLGS2
ZCRSHEDI EQU   ZCRFLGS2
ZCRLOCAL EQU   ZCRFLGS2
ZCRFEXIT EQU   ZCRFLGS1
ZCRUNSOL EQU   ZCRFLGS1
ZCRENDLP EQU   ZCRFLGS1
ZCRNRMEX EQU   ZCRFLGS1
ZCRWAIT  EQU   ZCRFLGS1
ZCRDEQSW EQU   ZCRFLGS1
ZCRQUESW EQU   ZCRFLGS1
ZCREXSW  EQU   ZCRFLGS1
ZCRFRRA  EQU   ISTZCRR+8
ZCRCHAIN EQU   ISTZCRR+4
ZCRFLAG  EQU   ZCRCRR+3
ZCRLEN   EQU   ZCRCRR+1
ZCRID    EQU   ZCRCRR
CCFRSVD1 EQU   CFCCRT
CCFCR2   EQU   CFCCRT
CCFCRP   EQU   CFCCRT
CCFCR1   EQU   CFCCRT
CCFCS2   EQU   CFCCRT
CCFCS1   EQU   CFCCRT
NCFRSVD  EQU   CFCNTRD
NCFCR2   EQU   CFCNTRD
NCFCRP   EQU   CFCNTRD
NCFCR1   EQU   CFCNTRD
NCFCS2   EQU   CFCNTRD
NCFCS1   EQU   CFCNTRD
PFCRSV01 EQU   ISTPFCRR+13
CRRFRR   EQU   PFCFRRO
CRRCHAIN EQU   PFCCRRO
CRRLEN   EQU   PFCCRRLN
PFCRSV10 EQU   PFCCRR+1
CRRID    EQU   PFCCRRID
ZSAZTRAC EQU   ISTZSAVE+36
ZSAZSVVR EQU   ISTZSAVE+12
ZSAZSVRR EQU   ISTZSAVE+8
ZSAZSVFC EQU   ISTZSAVE+4
ZSAZACTV EQU   ZSAZSVMS
@NM00077 EQU   SAVEAREA
@NM00075 EQU   GTNCSFLG
GTNCSAPP EQU   GTNCSFLG
NSRUNA6  EQU   NSRUNA5
RUBDATA  EQU   ISTRUB
RHRSVD5  EQU   RH3
RHRSVD4  EQU   RH3
RHLOG    EQU   RH3
RHRSVD3  EQU   RH3
RHRCDIR  EQU   RH3
RHCDIR   EQU   RH3
RHEB     EQU   RH3
RHBB     EQU   RH3
RHPACE   EQU   RH2
RHRSVD2  EQU   RH2
RHINOP   EQU   RHRSVD1
RHBUSY   EQU   RHRETRY
RHEXCEPT EQU   RH2
RHRRN    EQU   RH2
RHPE     EQU   RH2
RHFME    EQU   RH2
RHCHAIN  EQU   RH1
RHSENSE  EQU   RH1
RHFORMAT EQU   RH1
RHDIRI   EQU   RH1
RHSCI    EQU   RH1
RHTYPE   EQU   RH1
RHQS     EQU   RH1
CONUESBF EQU   ISTCONFT+1362
CONSTVAR EQU   CONSTAID+1
CONSTFIL EQU   CONSTAID
CONBLKNO EQU   CONSCPID+2
CONFILL  EQU   CONSCPID+1
CONFCNL  EQU   CONSCPID
CONF01SV EQU   ISTCONFT+1352
CONSDMLC EQU   ISTCONFT+1348
CONSDECB EQU   ISTCONFT+1344
CONUNITS EQU   ISTCONFT+1342
CONRVPT1 EQU   ISTCONFT+1341
CONGLBBH EQU   ISTCONFT+1340
CONRSV24 EQU   ISTCONFT+1312
CONFTTAT EQU   ISTCONFT+1284
CONFXXAT EQU   ISTCONFT+1256
CONFLDAT EQU   ISTCONFT+1228
CONFTRAT EQU   ISTCONFT+1200
CONFNSAT EQU   ISTCONFT+1172
CONCSCB  EQU   ISTCONFT+1168
CONRSV50 EQU   ISTCONFT+1166
CONLIST  EQU   ISTCONFT+1164
CONSTAFP EQU   ISTCONFT+1160
CONECDET EQU   ISTCONFT+1156
CONRECON EQU   ISTCONFT+1036
CONNTSOL EQU   ISTCONFT+916
CONTRACE EQU   ISTCONFT+796
CONTOLTP EQU   ISTCONFT+676
CONVVTAM EQU   ISTCONFT+556
CONVTHDR EQU   ISTCONFT+420
CONRSV01 EQU   ISTCONFT+417
CONNSNEC EQU   CONFLG01
CONFTPSA EQU   CONFLG01
CONFTTA  EQU   CONFLG01
CONFTNSA EQU   CONFLG01
CONFTNAC EQU   CONFLG01
CONFTEXS EQU   CONFLG01
CONFTTMR EQU   CONFLG01
CONFTSTM EQU   CONFLG01
CONCRPLD EQU   ISTCONFT+404
CONPPDBF EQU   ISTCONFT+392
CONNPDBF EQU   ISTCONFT+380
CONAPDBF EQU   ISTCONFT+368
CONWPDBF EQU   ISTCONFT+356
CONIODBF EQU   ISTCONFT+344
CONUEDBF EQU   ISTCONFT+332
CONVPDBF EQU   ISTCONFT+320
CONVFDBF EQU   ISTCONFT+308
CONLPDBF EQU   ISTCONFT+296
CONLFDBF EQU   ISTCONFT+284
CONSPDBF EQU   ISTCONFT+272
CONSFDBF EQU   ISTCONFT+260
CONCRPLS EQU   ISTCONFT+248
CONPPSBF EQU   ISTCONFT+236
CONNPSBF EQU   ISTCONFT+224
CONAPSBF EQU   ISTCONFT+212
CONWPSBF EQU   ISTCONFT+200
CONIOSBF EQU   ISTCONFT+188
CONVPSBF EQU   ISTCONFT+176
CONVFSBF EQU   ISTCONFT+164
CONLPSBF EQU   ISTCONFT+152
CONLFSBF EQU   ISTCONFT+140
CONSPSBF EQU   ISTCONFT+128
CONSFSBF EQU   ISTCONFT+116
CONRSV17 EQU   ISTCONFT+115
CONCRPL  EQU   CONBUFF+1
CONPPEX  EQU   CONBUFF+1
CONNPEX  EQU   CONBUFF+1
CONAPEX  EQU   CONBUFF+1
CONWPEX  EQU   CONBUFF+1
CONIOEX  EQU   CONBUFF
CONUECB  EQU   CONBUFF
CONVPEX  EQU   CONBUFF
CONVFEX  EQU   CONBUFF
CONLPEX  EQU   CONBUFF
CONLFEX  EQU   CONBUFF
CONSPEX  EQU   CONBUFF
CONSFEX  EQU   CONBUFF
CONACTV  EQU   CONSTAT
CONVRYIN EQU   CONSTAT
CONLODED EQU   CONSTAT
CONDSOPN EQU   CONSTAT
CONSTOR  EQU   CONSTAT
@NM00068 EQU   CONSTAT
@NM00067 EQU   CONSTAT
@NM00066 EQU   CONSTAT
CONIOTR  EQU   CONOPTFL
CONMODTR EQU   CONOPTFL
CONBTUTR EQU   CONOPTFL
CONBUFTR EQU   CONOPTFL
@NM00065 EQU   CONOPTFL
@NM00064 EQU   CONOPTFL
@NM00063 EQU   CONOPTFL
CONWRMST EQU   CONOPTFL
CONSYLST EQU   CONDSFLG
CONSYLIB EQU   CONDSFLG
CONSYOBJ EQU   CONDSFLG
@NM00062 EQU   CONDSFLG
@NM00061 EQU   CONDSFLG
@NM00060 EQU   CONDSFLG
CONMODFY EQU   ISTCONFT+109
CONDISPL EQU   ISTCONFT+108
CONVARY  EQU   ISTCONFT+107
CONHLTS  EQU   CONHALT
CONHLTQ  EQU   CONHALT
CONLAST  EQU   ISTCONFT+105
CONRES2  EQU   ISTCONFT+104
CONCID   EQU   ISTCONFT+102
CONBUFSZ EQU   ISTCONFT+100
CONRSV02 EQU   ISTCONFT+96
CONDCBBA EQU   ISTCONFT+92
CONDCBLA EQU   ISTCONFT+88
CONDCBOA EQU   ISTCONFT+84
CONLDPRM EQU   ISTCONFT+80
CONRDBUF EQU   ISTCONFT+76
CONSTCIB EQU   ISTCONFT+72
CONENDLA EQU   ISTCONFT+68
CONVARLA EQU   ISTCONFT+64
CONMODLA EQU   ISTCONFT+60
CONHLTLA EQU   ISTCONFT+56
CONNCSLA EQU   ISTCONFT+52
CONDISLA EQU   ISTCONFT+48
CONCIBAD EQU   ISTCONFT+44
CONACB   EQU   ISTCONFT+40
CONFBPNM EQU   ISTCONFT+32
CONDMNM  EQU   ISTCONFT+24
CONAPSNM EQU   ISTCONFT+16
CONAPINM EQU   ISTCONFT+8
CONCONFG EQU   ISTCONFT
LDPTCEP  EQU   ISTLDPRM+24
LDPRSV02 EQU   ISTLDPRM+22
LDPRSV01 EQU   LDPFB2
LDPACTIF EQU   LDPFB2
LDPATACH EQU   LDPFB2
LDPFLAST EQU   LDPFB2
LDPRSV03 EQU   LDPFG
LDPPB    EQU   LDPFG
LDPFX    EQU   LDPFG
LDPDCBA  EQU   ISTLDPRM+16
LDPPDS   EQU   ISTLDPRM+8
LDPMBR   EQU   ISTLDPRM
LCPFTYPE EQU   LCPRPHA
LCPRSTQH EQU   LCPLCCW
LCPCLREP EQU   ISTLCPB+44
LCPUBFSB EQU   LCPFLCCW
LCPRSV77 EQU   ISTLCPB+39
LCPLCCWC EQU   ISTLCPB+38
LCPRSV78 EQU   LCPFLG1
LCPTRANS EQU   LCPFLG1
LCPSTLB  EQU   LCPFLG1
LCPREDRV EQU   LCPFLG1
LCPDIRPT EQU   LCPFLG1
LCPINTER EQU   LCPFLG1
LCPRESET EQU   LCPFLG1
LCPSTYPE EQU   ISTLCPB+36
LCPFSNCH EQU   ISTLCPB+34
LCPFOSN  EQU   ISTLCPB+32
LCPTLBAD EQU   ISTLCPB+28
LCPFDB2  EQU   LCPFDBA+1
LCPFDB1  EQU   LCPFDBA
LCPNXLCW EQU   ISTLCPB+20
LCPDAF   EQU   LCPCID+2
LCPSAF   EQU   LCPCID
LCPLCCW1 EQU   ISTLCPB+12
LCPRRCNT EQU   LCPSEQ+1
LCPRRCCT EQU   LCPSEQ
LCPATOP  EQU   LCPFLAG2
LCPFREE  EQU   LCPFLAG2
LCPDSTAT EQU   LCPFLAG2
LCPEXRES EQU   LCPFID0
LCPZRIMM EQU   LCPTLBPI
LCPRSTRT EQU   LCPFLAG2
LCPASYN  EQU   LCPFLAG2
LCPPRFLG EQU   LCPFLAG2
LCPZMIRC EQU   LCPRUCNT
LCPCHAI2 EQU   LCPCHAIN+1
LCPCHNG  EQU   LCPCHAI1
LCPZRT0B EQU   LCPMNRCD
LCPZRT0A EQU   LCPMNRCD
LCPZRTL9 EQU   LCPZRT09
LCPZRTL8 EQU   LCPZRT08
LCPZRTL7 EQU   LCPZRT07
LCPZRTL6 EQU   LCPZRT06
LCPZRTL5 EQU   LCPZRT05
LCPZRTL4 EQU   LCPZRT04
LCPZRTL3 EQU   LCPZRT03
LCPZRTL2 EQU   LCPZRT02
LCPZRT01 EQU   LCPFLAGS
LCPZRT00 EQU   LCPFLAGS
LCPLNGTH EQU   ISTLCPB+1
LCPTYPE  EQU   ISTLCPB
LCCWDATA EQU   ISTLCCW+4
LCCWCNT  EQU   ISTLCCW+2
LCCWACI  EQU   LCCWFLAG
LCCWRFI  EQU   LCCWFLAG
LCCWPER  EQU   LCCWLSI
LCCWIDAT EQU   LCCWFLAG
LCCWNTVC EQU   LCCWFLAG
LCCWCKPT EQU   LCCWFLAG
LCCWCC   EQU   LCCWFLAG
LCCWCD   EQU   LCCWFLAG
LCCWTYPE EQU   LCCWCTL
LCCWMODE EQU   LCCWCTL
LCCWSOP  EQU   LCCWRWOP
@NM00059 EQU   LCCWRWOP
LCCWSD   EQU   LCCWOP
LCCWSI   EQU   LCCWOP
TIEPTR2  EQU   TIERPHA
TIEGATE  EQU   TIETIEA
TIERETCD EQU   ISTTIE+2
@NM00058 EQU   CCNFLGA
@NM00057 EQU   CCNFLGA
CCNCB    EQU   ISTCCNCB
ICNZCON6 EQU   ICNZCONS+10
ICNZCON5 EQU   ICNZCONS+8
ICNZCON4 EQU   ICNZCONS+6
ICNZCON3 EQU   ICNZCONS+4
ICNZCON2 EQU   ICNZCONS+2
ICNZCON1 EQU   ICNZCONS
ICNZATSA EQU   ISTICNCB+676
ICNZX012 EQU   ISTICNCB+675
ICNZX011 EQU   ISTICNCB+674
ICNZX010 EQU   ISTICNCB+672
ICNSRB   EQU   ISTICNCB+628
ICNIOSB  EQU   ISTICNCB+520
ICNZC001 EQU   ISTICNCB+512
ICNZX013 EQU   ISTICNCB+511
ICNZS010 EQU   ICNZH002+1
ICNZS00F EQU   ICNZH002+1
ICNZS00E EQU   ICNZH002+1
ICNZS00D EQU   ICNZH002+1
ICNZS00C EQU   ICNZH002+1
ICNZS00B EQU   ICNZH002+1
ICNZS01A EQU   ICNZS00A
ICNZS019 EQU   ICNZS009
ICNZS018 EQU   ICNZS008
ICNZS017 EQU   ICNZS007
ICNZS016 EQU   ICNZS006
ICNZS005 EQU   ICNZH002
ICNZS014 EQU   ICNZS004
ICNZS013 EQU   ICNZS003
ICNZS012 EQU   ICNZS002
ICNZS001 EQU   ICNZH002
ICNZF028 EQU   ICNZFLAG
ICNZF027 EQU   ICNZFLAG
ICNZF026 EQU   ICNZFLAG
ICNZF025 EQU   ICNZFLAG
ICNZF024 EQU   ICNZFLAG
ICNZF023 EQU   ICNZFLAG
ICNZF022 EQU   ICNZFLAG
ICNZF021 EQU   ICNZFLAG
ICNWORD5 EQU   ISTICNCB+504
ICNMSIZE EQU   ISTICNCB+500
ICNLCVTA EQU   ISTICNCB+496
ICNDEBAD EQU   ICNDIDEB+1
ICNDCBIF EQU   ICNDIDEB
ICNUCBAD EQU   ICNDCDEB+8
ICNAPPAD EQU   ICNDCDEB+5
ICNEXSCL EQU   ICNDCDEB+4
ICNDCBAD EQU   ICNDCDEB+1
ICNDEBID EQU   ICNDCDEB
@NM00056 EQU   ISTICNCB+477
ICNERCNT EQU   ISTICNCB+476
ICNZX002 EQU   ISTICNCB+475
ICNZX001 EQU   ISTICNCB+474
ICNZH001 EQU   ISTICNCB+472
ICNZSW3R EQU   ISTICNCB+468
ICNZSW2R EQU   ISTICNCB+464
ICNZSW1R EQU   ISTICNCB+460
ICNZS4VR EQU   ISTICNCB+436
ICNZS4RR EQU   ISTICNCB+432
ICNZS4FC EQU   ISTICNCB+428
ICNZS4BC EQU   ISTICNCB+424
ICNZS3VR EQU   ISTICNCB+400
ICNZS3RR EQU   ISTICNCB+396
ICNZS3FC EQU   ISTICNCB+392
ICNZS3BC EQU   ISTICNCB+388
ICNZS1RC EQU   ICNZS1VR+36
ICNDIEW3 EQU   ICNDIEWA+8
ICNDIEW2 EQU   ICNDIEWA+4
ICNDIEW1 EQU   ICNDIEWA
ICNZS1RR EQU   ISTICNCB+344
ICNZS1FC EQU   ISTICNCB+340
ICNZS1BC EQU   ISTICNCB+336
ICNRSTIC EQU   ICNZD004
ICNRDCOD EQU   ICNRSCCW
ICNZD006 EQU   ISTICNCB+312
ICNZD005 EQU   ISTICNCB+304
ICNWSTIC EQU   ICNZD002
ICNWRCOD EQU   ICNWSCCW
ICNZV008 EQU   ISTICNCB+284
ICNZV007 EQU   ISTICNCB+280
ICNZV006 EQU   ISTICNCB+276
ICNZV005 EQU   ISTICNCB+272
ICNZV004 EQU   ISTICNCB+268
ICNLSTIT EQU   ISTICNCB+264
ICNLSTIF EQU   ISTICNCB+260
ICNZV002 EQU   ISTICNCB+256
ICNZV001 EQU   ISTICNCB+252
ICNZV00A EQU   ISTICNCB+249
ICNBUFF  EQU   ISTICNCB+248
ICNCPQ   EQU   ISTICNCB+244
ICNNICNA EQU   ISTICNCB+240
@NM00055 EQU   ICNFLAG2+2
ICNZF019 EQU   ICNFLAG2+2
ICNZF018 EQU   ICNFLAG2+2
ICNZF017 EQU   ICNFLAG2+2
ICNZF016 EQU   ICNFLAG2+2
ICNZF015 EQU   ICNFLAG2+2
ICNMSG   EQU   ICNFLAG2+1
ICNCLOSE EQU   ICNFLAG2+1
ICNZF014 EQU   ICNFLAG2+1
ICNZF013 EQU   ICNFLAG2+1
ICNZF012 EQU   ICNFLAG2+1
ICNZF011 EQU   ICNFLAG2+1
ICNZF00D EQU   ICNFLAG2+1
ICNZF00B EQU   ICNFLAG2+1
ICNZF00A EQU   ICNFLAG2
ICNZF008 EQU   ICNFLAG2
ICNZF007 EQU   ICNFLAG2
ICNZF005 EQU   ICNFLAG2
ICNZF004 EQU   ICNFLAG2
ICNZF003 EQU   ICNFLAG2
ICNZF002 EQU   ICNFLAG2
ICNZF001 EQU   ICNFLAG2
ICNLOCK  EQU   ISTICNCB+232
ICNLICNA EQU   ISTICNCB+228
ICNRPH   EQU   ISTICNCB+120
ICNZV003 EQU   ISTICNCB+116
ICNLAST  EQU   ISTICNCB+112
ICNLSTBT EQU   ISTICNCB+108
ICNSIOQ  EQU   ISTICNCB+104
ICNFLAG1 EQU   ISTICNCB+103
ICNZSW08 EQU   ICNZSWS
ICNZSW07 EQU   ICNZSWS
ICNZSW06 EQU   ICNZSWS
ICNZSW05 EQU   ICNZSWS
ICNZSW04 EQU   ICNZSWS
ICNZSW03 EQU   ICNZSWS
ICNZSW02 EQU   ICNZSWS
ICNZSW01 EQU   ICNZSWS
ICNZFF69 EQU   ICNFFLAG
@NM00054 EQU   ICNFFLAG
ICNZFF05 EQU   ICNFFLAG
ICNZFF04 EQU   ICNFFLAG
ICNZFF03 EQU   ICNFFLAG
ICNZFF02 EQU   ICNFFLAG
ICNZFF01 EQU   ICNFFLAG
ICNZFF00 EQU   ICNFFLAG
@NM00053 EQU   ICNFLAG
ICNZCRIT EQU   ICNFLAG
ICNSLOW  EQU   ICNFLAG
ICNZF00F EQU   ICNFLAG
ICNZF00E EQU   ICNFLAG
ICNCONF  EQU   ICNZF006
ICNCKPAB EQU   ICNCKFLD+1
ICNRSV07 EQU   ICNCKFLD
ICNCKBIT EQU   ICNCKFLD
ICNZPAB4 EQU   ISTICNCB+80
ICNZPAB1 EQU   ISTICNCB+64
ICNRSV01 EQU   ISTICNCB+60
@NM00052 EQU   ISTICNCB+56
@NM00051 EQU   ISTICNCB+54
@NM00050 EQU   @NM00049
ICNRRY   EQU   @NM00049
ICNLCLUS EQU   @NM00049
ICNROLN  EQU   @NM00049
ICNRNRY  EQU   @NM00049
ICNLNKMD EQU   ISTICNCB+52
ICNCUUA  EQU   ISTICNCB+48
ICNCB    EQU   ISTICNCB
NCBRSV01 EQU   ISTNCB+46
NCBSWDAF EQU   ISTNCB+44
NCBDEVCH EQU   ISTNCB+36
NCBFMCBP EQU   ISTNCB+32
NCBLTRC  EQU   ISTNCB+30
NCBRVPT1 EQU   ISTNCB+28
NCBNMLLN EQU   NCBFLAGS+3
@NM00048 EQU   NCBFLAG1
NCBRSYNC EQU   NCBFLAG1
NCBSNAI  EQU   NCBFLAG1
NCBFLTIO EQU   NCBFTRIO
NCBCSTAT EQU   NCBFLAGS
NCBNCSL  EQU   ISTNCB+22
NCBNCBA  EQU   ISTNCB+20
NCBNSNA  EQU   ISTNCB+12
NCBTSKID EQU   ISTNCB+8
NCBRDTE  EQU   ISTNCB+4
NCBDAF   EQU   ISTNCB+2
NCBLNGTH EQU   ISTNCB+1
NCBTYPE  EQU   ISTNCB
FMCFLRSV EQU   FMCFLGB
FMCFLGA8 EQU   FMCFLGB
FMCCLRPH EQU   FMCVS1+45
FMCRSV0X EQU   FMCCVFLG
FMCVYRPH EQU   FMCCVFLG
FMCZV004 EQU   FMCVS1+40
FMCLOCK2 EQU   FMCVS1+36
@NM00047 EQU   FMCZFLG2
FMCZF027 EQU   FMCZFLG2
FMCZF026 EQU   FMCZFLG2
FMCSEQ1B EQU   FMCSEQ1
FMCSEQ1T EQU   FMCSEQ1
FMCZX006 EQU   FMCVS1+33
FMCZX005 EQU   FMCVS1+32
FMCZX004 EQU   FMCVS1+31
FMCZX003 EQU   FMCVS1+30
FMCZX002 EQU   FMCVS1+29
FMCZX001 EQU   FMCVS1+28
FMCZV001 EQU   FMCVS1+24
FMCAWATQ EQU   FMCLCPAQ+1
@NM00046 EQU   FMCLCPAQ
FMCLCPB2 EQU   FMCLCPBQ+1
FMCLCPB1 EQU   FMCLCPBQ
FMCASCDQ EQU   FMCSHEAQ+1
@NM00045 EQU   FMCSHEAQ
FMCSHEDQ EQU   FMCVS1+8
FMCZFCSQ EQU   FMCVS1+6
FMCZH001 EQU   FMCVS1+4
FMCZF025 EQU   FMCZFLAG+3
FMCZF024 EQU   FMCZFLAG+3
FMCZF023 EQU   FMCZFLAG+3
FMCZF022 EQU   FMCZFLAG+3
FMCZF021 EQU   FMCZFLAG+3
FMCZF020 EQU   FMCZFLAG+3
FMCZF019 EQU   FMCZFLAG+3
FMCZF018 EQU   FMCZFLAG+3
FMCZF017 EQU   FMCZFLAG+2
FMCZF016 EQU   FMCZFLAG+2
FMCZF015 EQU   FMCZFLAG+2
FMCZF014 EQU   FMCZFLAG+2
FMCZF013 EQU   FMCZFLAG+2
FMCZF012 EQU   FMCZFLAG+2
FMCZF011 EQU   FMCZFLAG+2
FMCZF010 EQU   FMCZFLAG+2
FMCZF00F EQU   FMCZFLAG+1
FMCZF00E EQU   FMCZFLAG+1
FMCZF00D EQU   FMCZFLAG+1
FMCZF00C EQU   FMCZFLAG+1
FMCZF00B EQU   FMCZFLAG+1
FMCRSV10 EQU   FMCZFLAG+1
FMCZF009 EQU   FMCZFLAG+1
FMCZFD06 EQU   FMCZF006+1
FMCZFC06 EQU   FMCZF006
FMCZFB06 EQU   FMCZF006
FMCZFA06 EQU   FMCZF006
FMCZF005 EQU   FMCZFLAG
FMCZF004 EQU   FMCZFLAG
FMCZF003 EQU   FMCZFLAG
FMCZF002 EQU   FMCZFLAG
FMCZF001 EQU   FMCZFLAG
FMCFRESA EQU   ISTFMCB+228
FMCSCSQN EQU   FMCSNCTL+2
FMCSCCTL EQU   FMCSNCTL+1
FMCSTCTL EQU   FMCSCFLG
FMCSCCLO EQU   FMCSCFLG
FMCAPRO  EQU   FMCSCFLG
FMCLURO  EQU   FMCSCFLG
FMCOBSAC EQU   FMCSCFLG
FMCIBSAC EQU   FMCSCFLG
FMCFBRE  EQU   ISTFMCB+220
FMCFBXM  EQU   FMCZV002
FMCASEGQ EQU   ISTFMCB+212
FMCRDTPT EQU   ISTFMCB+208
FMCLOCK  EQU   ISTFMCB+204
FMCSEGD  EQU   FMCSSEGQ
FMCRSPLM EQU   ISTFMCB+198
FMCPSTRS EQU   ISTFMCB+196
@NM00044 EQU   FMCRRESP
FMCTSLHA EQU   FMCRRESP
FMCFRRN  EQU   FMCRRESP
FMCFME   EQU   FMCRRESP
FMCFEX   EQU   FMCRRESP
FMCFPE   EQU   FMCRRESP
FMCCTLB  EQU   ISTFMCB+194
FMCBSQNO EQU   FMCCLSEQ+2
FMCTSQNO EQU   FMCCLSEQ
FMCOBPRG EQU   FMCMODEB
FMCIBPRG EQU   FMCMODEB
FMCRESOT EQU   FMCMODEB
FMCRSTSR EQU   FMCMODEB
FMCLUQ   EQU   FMCMODEB
FMCAPQ   EQU   FMCMODEB
FMCCLEAR EQU   FMCMODEB
FMCHOLD  EQU   FMCMODEB
FMCIPSEQ EQU   ISTFMCB+188
FMCLUSTR EQU   ISTFMCB+187
FMCRSV87 EQU   FMCSTAT2
FMCSEQI  EQU   FMCSTAT2
FMCCPIP  EQU   FMCSTAT2
FMCALIPR EQU   FMCSTAT2
FMCIAIO  EQU   FMCSTAT2
FMCZF00A EQU   FMCSTAT2
FMCVPIP  EQU   FMCSTAT2
FMCBHSET EQU   ISTFMCB+185
FMCPRMRC EQU   FMCCLEXT+20
FMCRSV89 EQU   FMCPSTAT
FMCPCLSD EQU   FMCPSTAT
FMCDDOCD EQU   FMCPSTAT
FMCIDVFD EQU   FMCPSTAT
FMCELKST EQU   FMCPSTAT
FMCRSV88 EQU   FMCPSCMD
FMCRDBLK EQU   FMCPSCMD
FMCDSEOC EQU   FMCPSCMD
FMCPURGE EQU   FMCPSCMD
FMCRESTI EQU   FMCPSCMD
FMCCNTCT EQU   FMCPSCMD
FMCINVT  EQU   FMCPSCMD
FMCFLGB7 EQU   FMCFLGCL
FMCFLGB6 EQU   FMCFLGCL
FMCFLGB5 EQU   FMCFLGCL
FMCFLGB4 EQU   FMCFLGCL
FMCFLGB3 EQU   FMCFLGCL
FMCFLGB2 EQU   FMCFLGCL
FMCFLGB1 EQU   FMCFLGCL
FMCFLGB0 EQU   FMCFLGCL
FMCFLGA7 EQU   FMCFLGA
FMCFLGA6 EQU   FMCFLGA
FMCFLGA5 EQU   FMCFLGA
FMCFLGA4 EQU   FMCFLGA
FMCFLGA3 EQU   FMCFLGA
FMCFLGA2 EQU   FMCFLGA
FMCFLGA1 EQU   FMCFLGA
FMCFLGA0 EQU   FMCFLGA
FMCDCLOK EQU   FMCCLEXT+12
FMCRAFM  EQU   FMCCLEXT+8
FMCFBPTR EQU   FMCFBA+1
FMCFBRSV EQU   FMCFBA
FMCRPLPT EQU   FMCRPLA+1
FMCRPLRS EQU   FMCRPLA
FMCPRCLS EQU   FMCCVAL
FMCIBCE  EQU   FMCCVAL
FMCONLY  EQU   FMCOBCE
FMCLAST  EQU   FMCOBCE
FMCMIDLE EQU   FMCOBCE
FMCFIRST EQU   FMCOBCE
FMCCPCNT EQU   FMCPACPC
FMCMPCNT EQU   FMCPACEM
FMCNPCNT EQU   FMCPACEN
FMCPURCH EQU   FMCSSTAT
FMCNSALU EQU   FMCSSTAT
FMCBIP   EQU   FMCSSTAT
FMCSDTR  EQU   FMCSSTAT
FMCUIPI  EQU   FMCSSTAT
FMCCIPI  EQU   FMCSSTAT
FMCSNBI  EQU   FMCSSTAT
FMCRVD01 EQU   ISTFMCB+158
FMCISSN  EQU   ISTFMCB+156
FMCOASN  EQU   FMCNXOSC
FMCOSSN  EQU   FMCNXCFM
FMCSIP   EQU   FMCSIPA
FMCEXLST EQU   ISTFMCB+144
FMCPAB5  EQU   ISTFMCB+128
FMCPAB4  EQU   ISTFMCB+112
FMCPAB3  EQU   ISTFMCB+96
FMCPAB2  EQU   ISTFMCB+80
FMCPAB1  EQU   ISTFMCB+64
FMCFASYA EQU   ISTFMCB+60
FMCPROCD EQU   ISTFMCB+48
FMCRPLH  EQU   ISTFMCB+40
FMCBUFNB EQU   FMCCMPS1+2
FMCBUFLM EQU   FMCCMPS1
FMCDEBA  EQU   ISTFMCB+32
@NM00043 EQU   FMCCMDFL
FMCSNA   EQU   FMCCMDFL
FMCVSNA  EQU   FMCCMDFL
FMCCMDR  EQU   FMCCMDFL
@NM00042 EQU   ISTFMCB+30
@NM00041 EQU   FMCSTAT1
FMCLTCLS EQU   FMCSTAT1
FMCVSP2  EQU   FMCSTAT1
FMCVSP1  EQU   FMCSTAT
FMCLTEAS EQU   FMCSTAT
FMCZF007 EQU   FMCSTAT
FMCDEDSC EQU   FMCSTAT
FMCDEVOF EQU   FMCSTAT
FMCDAPT  EQU   FMCSTAT
FMCPRMTE EQU   FMCSTAT
FMCPRMTR EQU   FMCSTAT
FMCUSFLD EQU   ISTFMCB+24
FMCDNCBA EQU   ISTFMCB+16
FMCDVTA  EQU   ISTFMCB+12
FMCTSKID EQU   ISTFMCB+8
FMCNXTCB EQU   ISTFMCB+4
FMCSAF   EQU   ISTFMCB+2
FMCLNGTH EQU   ISTFMCB+1
FMCTYPE  EQU   ISTFMCB
PROSRDEF EQU   PROSETM4
PRORSV47 EQU   PROSETM4
PROSCON  EQU   PROSETM4
PRORSV46 EQU   PROSETM3
PROSMONT EQU   PROSETM3
PRORSV45 EQU   PROSETM3
PROSNTO  EQU   PROSETM3
PRORSV44 EQU   PROSETM3
PROCPUID EQU   PROSETM3
PRORSV43 EQU   PROSETM2
PROSNTFL EQU   PROSETM2
PRORSV42 EQU   PROSETM2
PRORSV41 EQU   PROPROCS
PROMODC  EQU   PROPROC4
PROMODT  EQU   PROPROC4
PROMODM  EQU   PROPROC4
PROMODB  EQU   PROPROC4
PRORSV14 EQU   PROPROC4
PRORSV13 EQU   PROPROC4
PRORSV12 EQU   PROPROC4
PROEIB   EQU   PROPROC4
PROMONT3 EQU   PROPROC3
PROMONT2 EQU   PROPROC3
PROMONIT EQU   PROPROC3
PROSUBLK EQU   PROPROC3
PRONTO   EQU   PROPROC3
PROLGIN  EQU   PROPROC3
PROERPI  EQU   PROPROC3
PRORSV07 EQU   PROPROC3
PROCFTX  EQU   PROPROC2
PROEMLC  EQU   PROPROC2
PRONTFL  EQU   PROPROC2
PRORSV05 EQU   PROPROC2
PRORSV04 EQU   PROPROC2
PROLGOT  EQU   PROPROC2
PROERPO  EQU   PROPROC2
PRORSV03 EQU   PROPROC2
PRORPLC  EQU   PROPROC1
PROCS    EQU   PROPROC1
PROCA    EQU   PROPROC1
PRORESPX EQU   PROPROC1
PRODFASY EQU   PROPROC1
PROXPOPT EQU   PROPROC1
PROTRUNC EQU   PROPROC1
PROASYIP EQU   PROPROC1
PATRSV01 EQU   PATFLAGA
PATUSEFG EQU   PATFLAGA
PATRDCNT EQU   ISTPAT+6
PATGRPID EQU   ISTPAT+5
PATPTHID EQU   ISTPAT+4
PATDINDX EQU   ISTPAT+2
PATGINDX EQU   ISTPAT
GNTGRPNM EQU   ISTGNT
DNTTELNO EQU   ISTDNT+1
DNTCTDIG EQU   ISTDNT
RLSRSV02 EQU   ISTRLS+140
RLSRSV01 EQU   ISTRLS+138
RLSCTELU EQU   ISTRLS+136
RLSPRE   EQU   ISTRLS
RDARSVPT EQU   ISTRDA+84
RDAPUBI  EQU   ISTRDA+83
RDADFCUA EQU   ISTRDA+80
RDACTPCC EQU   ISTRDA+79
RDADACUA EQU   ISTRDA+76
RDALUBA  EQU   RDAUCBAD+1
RDACHQI  EQU   RDAUCBAD
RDARSV01 EQU   RDAFLAG
RDARBISA EQU   RDAFLAG
RDAPRE   EQU   ISTRDA
RSWRSV01 EQU   ISTRSW+152
RSWRSV02 EQU   ISTRSW+150
RSWCTELU EQU   ISTRSW+148
RSWGRUPZ EQU   ISTRSW+146
RSWDIALZ EQU   ISTRSW+144
RSWGRUPT EQU   ISTRSW+140
RSWDIALT EQU   ISTRSW+136
RSWPRE   EQU   ISTRSW
RLXRSV03 EQU   ISTRLX+80
RLXRSV02 EQU   ISTRLX+77
RLXRSV01 EQU   RLXFLAGA
RLXINUSE EQU   RLXFLAGA
RLXNLUX  EQU   ISTRLX+72
RLXPRE   EQU   ISTRLX
RPXRSV01 EQU   ISTRPX+80
RPXRSV02 EQU   ISTRPX+77
RPXMAXLU EQU   ISTRPX+76
RPXFLUX  EQU   ISTRPX+72
RPXPRE   EQU   ISTRPX
RLURSV02 EQU   ISTRLU+172
RLULGMOD EQU   ISTRLU+164
RLUMODEP EQU   RLUMODET+8
RLUMODEN EQU   RLUMODET
RLUUSSPT EQU   RLUUSSTB+8
RLUUSSNM EQU   RLUUSSTB
RLURSV01 EQU   ISTRLU+137
RLULOCAD EQU   ISTRLU+136
RLUNCPPM EQU   RLUNCPPC+1
RLUNCPPN EQU   RLUNCPPC
RLUPACEM EQU   RLUPACE+1
RLUPACEN EQU   RLUPACE
RLUINTA  EQU   ISTRLU+128
RLUSSCFM EQU   ISTRLU+127
RLUCRRSV EQU   RLUCRFLG
RLURSV00 EQU   RLUFLAG
RLUNDSES EQU   RLUFLAG
RLUGSTAT EQU   RLUFLAG
RLUBATCH EQU   RLUFLAG
RLURBISA EQU   RLUFLAG
RLUTYPE  EQU   ISTRLU+124
RLUCRPR  EQU   ISTRLU
RCCRVPT2 EQU   ISTRCC+144
RCCXTOSW EQU   ISTRCC+140
RCCSWTOX EQU   ISTRCC+136
RCCRSPT2 EQU   ISTRCC+133
RCCADDR  EQU   ISTRCC+132
RCCPASSL EQU   ISTRCC+131
RCCMXOUT EQU   ISTRCC+130
RCCMXDAT EQU   ISTRCC+128
RCCINDEX EQU   ISTRCC+126
RCCPATHZ EQU   ISTRCC+124
RCCPATHT EQU   ISTRCC+120
RCCDPQ   EQU   ISTRCC+116
RCCTPAB  EQU   ISTRCC+112
RCCRSV02 EQU   ISTRCC+109
RCCCRRSV EQU   RCCCRFLG
RCCACTPU EQU   RCCCRFLG
RCCNCSPL EQU   ISTRCC+104
RCCVPAB  EQU   ISTRCC+88
@NM00040 EQU   ISTRCC+87
RCCSESCT EQU   ISTRCC+86
RCCIDNUM EQU   RCCID48+3
RCCIDBLK EQU   RCCID48+2
RCCIDPA2 EQU   RCCID48+1
RCCIDPUT EQU   RCCID48
RCCIDPA1 EQU   RCCSTAID
RCCCTELU EQU   ISTRCC+76
RCCCNCNT EQU   ISTRCC+75
RCCRTGOH EQU   RCCFLAGB
RCCBRKCN EQU   RCCFLAGB
RCCRESET EQU   RCCFLAGB
RCCFINAL EQU   RCCFLAGB
RCCBNNSP EQU   RCCFLAGB
RCCIRETR EQU   RCCFLAGB
RCCDIALP EQU   RCCFLAGB
RCCDSTCT EQU   RCCFLAGB
RCCCTPGD EQU   RCCFLAG
RCCOHIMM EQU   RCCFLAG
RCCLDISC EQU   RCCFLAG
RCCRBISA EQU   RCCFLAG
RCCTYPE  EQU   ISTRCC+72
RCCPRE   EQU   ISTRCC
DOTADTRM EQU   ISTDOT
RDSADDOT EQU   ISTRDS+76
RDSCTATR EQU   ISTRDS+74
RDSCTTRM EQU   ISTRDS+72
RDSPRE   EQU   ISTRDS
RINRSV05 EQU   ISTRIN+156
RINRSV04 EQU   ISTRIN+152
RINLOCRN EQU   ISTRIN+148
RINRSV02 EQU   ISTRIN+145
RTRCNCNT EQU   RINCNCNT
RTRNCSPL EQU   RINNCSPL
RTRRPHCN EQU   RINRPHCN
RTRVPAB  EQU   RINVPAB
RTRREMOT EQU   RINREMOT
RTRRLDAF EQU   RINRLDAF
RTRNODID EQU   RINNODID
RINRSV01 EQU   RINDFD
RTRLDISC EQU   RINLDISC
RTRNODEF EQU   RINNODEF
RTRREMPO EQU   RINREMPO
RINCRPRE EQU   ISTRIN
RTRRSV04 EQU   ISTRTR+210
RTRLCTI  EQU   ISTRTR+209
RTRIDCAS EQU   RTRBSCID+1
RTRIDLEN EQU   RTRBSCID
RTRRSVDD EQU   ISTRTR+181
RTRRDFG  EQU   ISTRTR+180
RTRDIAA  EQU   ISTRTR+176
RTRPOLA  EQU   ISTRTR+172
RTRCADDR EQU   ISTRTR+164
RTRCTADR EQU   ISTRTR+162
RTRCTPOL EQU   ISTRTR+160
RTRCTDIA EQU   ISTRTR+158
RTRRSV03 EQU   ISTRTR+156
RTRRVPT1 EQU   ISTRTR+152
RTRBHSN1 EQU   ISTRTR+144
RTRCRSV2 EQU   RTRCRFLG
RTRDTRLM EQU   RTRLSCMD
RTRCRSV1 EQU   RTRCRFLG
RTRTRMAX EQU   ISTRTR+142
RTRRSV24 EQU   RTRRDFF
RTRRFDEK EQU   RTRRDFF
RTRRFANK EQU   RTRRDFF
RTRRFPFK EQU   RTRRDFF
RTRRFPEN EQU   RTRRDFF
RTRRFXCT EQU   RTRRDFF
RTRRESCT EQU   RTRRDFE
RTRRESUP EQU   RTRRDFE
RTRREATT EQU   RTRRDFE
RTRRECHK EQU   RTRRDFE
RTRREACR EQU   RTRRDFE
RTRRSV0A EQU   RTRRDFE
RTRREBRK EQU   RTRRDFE
RTRRSV11 EQU   RTRRDFD
RTRRSV10 EQU   RTRRDFD
RTRRDBHI EQU   RTRRDFD
RTRRDBHD EQU   RTRRDFD
RTRRDBHN EQU   RTRRDFD
RTRRSV23 EQU   RTRRDFC
RTRRCXMS EQU   RTRRDFC
RTRRCMSG EQU   RTRRDFC
RTRRCBLK EQU   RTRRDFC
RTRRCPT3 EQU   RTRRDFC
RTRRCIT2 EQU   RTRRDFC
RTRRCIT1 EQU   RTRRDFC
RTRRSV32 EQU   RTRRDFB
RTRRBEND EQU   RTRRDFB
RTRRBECT EQU   RTRRDFB
RTRRSV02 EQU   RTRRDFA
RTRRACTR EQU   RTRRDFA
RTRRSV60 EQU   RTRRDFA
RTRRACDT EQU   RTRRDFA
RTRRAPT3 EQU   RTRRAALL
RTRRAPT2 EQU   RTRRAALL
RTRRAPT1 EQU   RTRRAALL
RTRRAATN EQU   RTRRDFA
RTRRSV45 EQU   ISTRTR+132
RTRRSV01 EQU   ISTRTR+130
RTRCTECM EQU   ISTRTR+128
RTRADRPT EQU   RTRADR+1
RTRRSV22 EQU   RTRFLAG
RTRVTERM EQU   RTRFLAG
RTRRSV51 EQU   RTRFLAG
RTRRBISA EQU   RTRFLAG
RTRRSV21 EQU   RTRFLAG
RTRCRPR  EQU   ISTRTR
RCLRVPT2 EQU   ISTRCL+92
RCLRVPT1 EQU   ISTRCL+88
RCLGPOLA EQU   ISTRCL+84
RCLCTNGP EQU   ISTRCL+82
RCLRSV01 EQU   ISTRCL+80
RCLCTECM EQU   ISTRCL+78
RCLCTETR EQU   ISTRCL+76
RCLGPADR EQU   RCLADR+1
RCLRSV33 EQU   RCLFLAG
RCLBATCH EQU   RCLFLAG
RCLRBISA EQU   RCLFLAG
RCLRSV22 EQU   RCLFLAG
RCLPRE   EQU   ISTRCL
RPTRSV03 EQU   ISTRPT+156
RPTRSV02 EQU   ISTRPT+152
RPTNSNSV EQU   ISTRPT+148
RPTPTHCT EQU   ISTRPT+146
RPTPEPCT EQU   ISTRPT+144
RPTDAFSV EQU   ISTRPT+142
RPTRSV01 EQU   ISTRPT+141
RPTISTAT EQU   RPTFLAG1
RPTDYNAM EQU   RPTFLAG1
RPTVYIMM EQU   RPTFLAG1
RPTVIODN EQU   RPTFLAG1
RPTONLIN EQU   RPTFLAG1
RPTHLVPD EQU   RPTFLAG1
RPTVRYPD EQU   RPTFLAG1
RPTASLEP EQU   RPTFLAG1
RPTUTERM EQU   ISTRPT+136
RPTATERM EQU   ISTRPT+132
RPTDIVT  EQU   RPTDITT
RPTCTNM  EQU   ISTRPT+120
RPTLNDAF EQU   RPTLNCID+2
RPTLNSAF EQU   RPTLNCID
RPTLN    EQU   ISTRPT
RLNRVPT2 EQU   ISTRLN+112
RLNNCSPL EQU   ISTRLN+108
RLNX2SW  EQU   ISTRLN+104
@NM00039 EQU   ISTRLN+103
RLNCRRSV EQU   RLNCRFLG
RLNSWEP  EQU   RLNCRFLG
RLNSVSKP EQU   RLNLSCMD
RLNSESLM EQU   RLNLSCMD
RLNNPRLM EQU   RLNLSCMD
RLNSWNCP EQU   RLNCRFLG
RLNACTLN EQU   RLNCRFLG
RLNPAUSE EQU   ISTRLN+101
RLNPOLMT EQU   ISTRLN+100
RLNACTSN EQU   ISTRLN+98
RLNRESV1 EQU   ISTRLN+97
RLNACTRM EQU   ISTRLN+96
RLNCTSES EQU   ISTRLN+95
RLNRDSLM EQU   ISTRLN+94
RLNAUTOA EQU   ISTRLN+92
RLNRDFD  EQU   RLNRDF+3
RLNRDFC  EQU   RLNRDF+2
RLNMULTP EQU   RLNRDFB
RLNRATRN EQU   RLNRDFB
RLNRAPOL EQU   RLNRDFB
RLNTTV   EQU   RLNRDFB
RLNRSV0B EQU   RLNRDFB
RLNAUTOD EQU   RLNRDFB
RLNANSWR EQU   RLNRDFB
RLNRBUSE EQU   RLNRDFB
RLNRAPEP EQU   RLNRDFA
RLNRANCP EQU   RLNRDFA
RLNRAEP  EQU   RLNRDFA
RLNIDV   EQU   RLNRDFA
RLNGANSW EQU   RLNRDFA
RLNRACAN EQU   RLNRACNT
RLNRACAT EQU   RLNRACNT
RLNRSV04 EQU   RLNSTAT2
RLNINUSE EQU   RLNSTAT2
RLNOHIN  EQU   RLNSTAT2
RLNRSV03 EQU   RLNSTAT1
RLNVD    EQU   RLNSTAT1
RLNINOPP EQU   RLNSTAT1
RLNINOPL EQU   RLNSTAT1
RLNLRST  EQU   RLNSTAT1
RLNTRAP  EQU   RLNSTAT1
RLNACTCT EQU   ISTRLN+84
RLNCTECM EQU   ISTRLN+82
RLNCTEIN EQU   ISTRLN+80
RLNCTETR EQU   ISTRLN+78
RLNCTECL EQU   ISTRLN+76
RLNCUA   EQU   RLNUCBAD
RLNRSV01 EQU   RLNFLAG
RLNRBISA EQU   RLNFLAG
RLNEAM   EQU   RLNFLAG
RLNPRE   EQU   ISTRLN
RGPRVPT2 EQU   ISTRGP+88
RGPRVPT1 EQU   ISTRGP+84
RGPCTECM EQU   ISTRGP+82
RGPCTEIN EQU   ISTRGP+80
RGPCTETR EQU   ISTRGP+78
RGPCTECL EQU   ISTRGP+76
RGPCTELN EQU   ISTRGP+74
RGPRSV03 EQU   ISTRGP+73
RGPRSV02 EQU   RGPFLG
RGPASDLC EQU   RGPFLG
RGPABSC  EQU   RGPFLG
RGPASS   EQU   RGPFLG
RGPADIL  EQU   RGPFLG
RGPPRE   EQU   ISTRGP
RRNRINNM EQU   ISTRRN+248
@NM00038 EQU   ISTRRN+247
RRNRDCUA EQU   ISTRRN+244
RRNLASTE EQU   ISTRRN+240
RRNNCSPL EQU   ISTRRN+236
RRNRPLPT EQU   ISTRRN+232
RRNMSIZE EQU   ISTRRN+228
RRNCTPCC EQU   ISTRRN+220
RRNHBUFS EQU   ISTRRN+218
RRNHLENT EQU   RRNHPRE+1
RRNHLENH EQU   RRNHPRE
RRNNMNCP EQU   ISTRRN+208
RRNDELAY EQU   ISTRRN+206
RRNRSV04 EQU   ISTRRN+200
RRNRSV88 EQU   RRNNMDPD+7
RRNPUBI  EQU   RRNNMDPD+6
RRNDPLUB EQU   RRNNMDPD
RRNEPADR EQU   ISTRRN+190
RRNCPLUB EQU   ISTRRN+184
RRNFLUX  EQU   ISTRRN+180
RRNRSV05 EQU   RRNCMFD
RRNREMPO EQU   RRNCMFD
RRNCDREC EQU   RRNCMFD
RRNCDDSI EQU   RRNCMFD
RRNCDBCK EQU   RRNCMFD
RRNCDDTL EQU   RRNCMFD
RRNCDSTD EQU   RRNCMFD
RRNCDCSP EQU   RRNCMFD
RRNCCCSL EQU   RRNCMFC
RRNCCSIM EQU   RRNCMFC
RRNCCRCM EQU   RRNCMFC
RRNCCRIM EQU   RRNCMFC
RRNCCCRC EQU   RRNCMFC
RRNCCRST EQU   RRNCMFC
RRNCCRDQ EQU   RRNCMFC
RRNCCRCN EQU   RRNCMFC
RRNCBALT EQU   RRNCMFB
RRNCBMOD EQU   RRNCMFB
RRNCBNPL EQU   RRNCMFB
RRNCBRLS EQU   RRNCMFB
RRNCBRDS EQU   RRNCMFB
RRNCBDLR EQU   RRNCMFB
RRNCBDLH EQU   RRNCMFB
RRNCBDLO EQU   RRNCMFB
RRNCADGO EQU   RRNCMFA
RRNCADTD EQU   RRNCMFA
RRNCACDT EQU   RRNCMFA
RRNCAMBH EQU   RRNCMFA
RRNCAATI EQU   RRNCMFA
RRNCAATG EQU   RRNCMFA
RRNCAATD EQU   RRNCMFA
RRNCAALL EQU   RRNCMFA
RRNRSV55 EQU   RRNRDF+3
RRNPTASL EQU   RRNRDFB+1
RRNRSV01 EQU   RRNRDFB+1
RRNVYDON EQU   RRNRDFB+1
RRNRBBUP EQU   RRNRDFB+1
RRNRSV03 EQU   RRNRDFB
RRNRBCT2 EQU   RRNRDFB
RRNRBCT1 EQU   RRNRDFB
RRNRBSEC EQU   RRNRDFB
RRNRBCCT EQU   RRNRDFB
RRNRBCCL EQU   RRNRDFB
RRNRSV02 EQU   RRNRDFB
RRNRBMDL EQU   RRNRDFB
RRNRAPEP EQU   RRNRDFA
RRNRANCP EQU   RRNRDFA
RRNRAOLT EQU   RRNRDFA
RRNRASYN EQU   RRNRDFA
RRNRADMP EQU   RRNRDFA
RRNRAIPL EQU   RRNRDFA
RRNRASHT EQU   RRNRDFA
RRNCTENT EQU   ISTRRN+170
RRNCTECM EQU   ISTRRN+168
RRNCTEIN EQU   ISTRRN+166
RRNCTETR EQU   ISTRRN+164
RRNCTECL EQU   ISTRRN+162
RRNCTELI EQU   ISTRRN+160
RRNCTEGP EQU   ISTRRN+158
RRNCTBHS EQU   ISTRRN+156
RRNBHSET EQU   ISTRRN+152
RRNRLDIP EQU   ISTRRN+147
RRNRNCUA EQU   ISTRRN+144
RRNGRPA  EQU   ISTRRN+140
RRNLUBA  EQU   RRNUCBAD+1
RRNCHQI  EQU   RRNUCBAD
RRNRSV11 EQU   RRNFLAG
RRNDSTCT EQU   RRNFLAG
RRNLCDIE EQU   RRNFLAG
RRNLCSIP EQU   RRNFLAG
RRNRBISA EQU   RRNFLAG
RRNRSV89 EQU   RRNFLAG
RRNPRE   EQU   ISTRRN
RLCRVPT2 EQU   ISTRLC+80
RLCRVPT1 EQU   ISTRLC+79
RLCLCCUA EQU   ISTRLC+76
RLCUCBAD EQU   RLCADR+1
RLCRSVDE EQU   RLCFLAG
RLCACNT  EQU   RLCFLAG
RLCRSV14 EQU   RLCFLAG
RLCRBISA EQU   RLCFLAG
RLCRSV22 EQU   RLCFLAG
RLCPRE   EQU   ISTRLC
RAPRVPT2 EQU   ISTRAP+116
RAPRVPT1 EQU   ISTRAP+112
RAPBFACT EQU   ISTRAP+111
RAPRSV17 EQU   RAPFLGC
RAPRSV16 EQU   RAPFLGC
RAPRSV15 EQU   RAPFLGC
RAPRSV14 EQU   RAPFLGC
RAPRSV13 EQU   RAPFLGC
RAPRSV12 EQU   RAPFLGC
RAPRSV11 EQU   RAPFLGC
RAPRSV10 EQU   RAPFLGC
RAPANVPC EQU   RAPFLGB
RAPASPO  EQU   RAPFLGB
RAPAPPO  EQU   RAPFLGB
RAPAACQ  EQU   RAPFLGB
RAPAPRMT EQU   RAPFLGB
RAPAPASS EQU   RAPFLGB
RAPABLCK EQU   RAPFLGB
RAPALLF  EQU   RAPFLGB
RAPRSV06 EQU   RAPFLG
RAPRSV05 EQU   RAPFLG
RAPRSV04 EQU   RAPFLG
RAPRSV03 EQU   RAPFLG
RAPATLGN EQU   RAPFLG
RAPASLGI EQU   RAPFLG
RAPAQUI  EQU   RAPFLG
RAPABLGN EQU   RAPFLG
RAPACEQD EQU   ISTRAP+106
RAPTRPRE EQU   ISTRAP+104
RAPACEAP EQU   ISTRAP+100
RAPICEAQ EQU   ISTRAP+96
RAPICEAC EQU   ISTRAP+92
RAPICELG EQU   ISTRAP+88
RAPAPPWD EQU   ISTRAP+80
RAPACDEB EQU   ISTRAP+76
RAPACBA  EQU   ISTRAP+72
RAPPRE   EQU   ISTRAP
RDTVSRPL EQU   ISTRDT+132
RDTCRSPW EQU   ISTRDT+124
RDTCRSDS EQU   ISTRDT+116
@NM00037 EQU   ISTRDT+113
RRNSTCNT EQU   RDTSTCNT
RRNVYRPH EQU   RDTVYRPH
RDTTPAB  EQU   ISTRDT+104
RDTRSV01 EQU   RDTFLAGB
RDTBHSET EQU   RDTFLAGB
RDTCTPGD EQU   RDTFLAGB
RDTLGCT  EQU   ISTRDT+90
RDTNODID EQU   ISTRDT+89
RDTMAXID EQU   ISTRDT+88
RDTCTSNT EQU   ISTRDT+86
RDTFLAGS EQU   ISTRDT+84
RDTBACK  EQU   ISTRDT+80
RDTFORW  EQU   ISTRDT+76
RDTLEN   EQU   RDTPLEN+1
RDTPRILS EQU   RDTPRIOR
RDTPRISW EQU   RDTPRIOR
RDTPRIRN EQU   RDTPRIOR
RDTPRILC EQU   RDTPRIOR
RDTPRIAP EQU   RDTPRIOR
@NM00036 EQU   RDTPRIOR
RDTPRE   EQU   ISTRDT
RCPRSV05 EQU   ISTRCPRE+120
RCPRSV04 EQU   ISTRCPRE+116
RCPRSV03 EQU   ISTRCPRE+112
RCPINTA  EQU   RCPLGNIN+16
RCPLGNCT EQU   RCPLGNIN+8
RCPLGNAP EQU   RCPLGNIN
@NM00035 EQU   RCPPMODE
RCPRRECD EQU   RCPPMODE
RCPRBASC EQU   RCPPMODE
RCPBFLIM EQU   ISTRCPRE+90
RCPBHSI2 EQU   ISTRCPRE+89
RCPBHSI1 EQU   ISTRCPRE+88
RCPACETR EQU   ISTRCPRE+84
RCPICEAQ EQU   ISTRCPRE+80
RCPLNAPA EQU   ISTRCPRE+76
RCPICELN EQU   ISTRCPRE+72
RCPPRE   EQU   ISTRCPRE
RPRCONID EQU   ISTRPRE+63
RPRCLVPD EQU   RPRFLAGC
RPRRSV05 EQU   RPRFLAGD
RPRACTP  EQU   RPRFLAGD
RPRRSON  EQU   RPRFLAGD
RPRCONCT EQU   RPRFLAGD
RPRLTASN EQU   RPRFLAGD
RPRPTHCT EQU   ISTRPRE+60
RPRSWDAF EQU   ISTRPRE+58
RPRSTPCT EQU   ISTRPRE+56
RPRRVPT1 EQU   ISTRPRE+52
RPRNCBA  EQU   ISTRPRE+40
RPRLGONB EQU   ISTRPRE+32
RPRLGONF EQU   ISTRPRE+28
RPRTIOCT EQU   ISTRPRE+26
RPRPEPCT EQU   ISTRPRE+24
RPRRSV03 EQU   RPRCAUSE
RPRRSYNC EQU   RPRCAUSE
RPRCRCPT EQU   RPRCAUSE
RPRNOSRT EQU   RPRCAUSE
RPRVYIMM EQU   RPRFLAGB
RPRHLVPD EQU   RPRFLAGB
RPRVIODN EQU   RPRFLAGB
RPRAOPN  EQU   RPRFLAGB
RPRENTVT EQU   RPRFLAGB
RPRENTVH EQU   RPRFLAGB
RPRVRYPD EQU   RPRFLAGA
RPRENTIO EQU   RPRFLAGA
RPRENTBF EQU   RPRFLAGA
RPRTIED  EQU   RPRFLAGA
RPRACT   EQU   RPRFLAGA
RPRRLOCK EQU   ISTRPRE+12
RPRSAF   EQU   RPRCOMID
DEVRSV03 EQU   ISTDEVCH+5
DEVPHYSA EQU   ISTDEVCH+4
DEVCSLPN EQU   DEVCHAR3
DEVCSTCL EQU   DEVCHAR3
DEVCCHEK EQU   DEVCHAR3
DEVCATTN EQU   DEVCHAR3
DEVCSWL  EQU   DEVFCCTL
DEVCRVB  EQU   DEVFCCTL
DEVCSSL  EQU   DEVFCCTL
DEVCBSC  EQU   DEVFCCTL
DEVMCODE EQU   ISTDEVCH+2
DEVCHAR2 EQU   DEVTCODE
DEVRSV01 EQU   DEVCHAR
DEVCCTL  EQU   DEVCHAR
DEVNNSPT EQU   DEVCHAR
DEVSPS   EQU   DEVCHAR
DEVCONVR EQU   DEVCHAR
DEVOTPUT EQU   DEVCHAR
DEVINPUT EQU   DEVCHAR
NCSRUITS EQU   NCSUSSRU+2
NCSRULEN EQU   NCSUSSRU
NCSAPPAB EQU   NCSAPP+608
NCSAPDAT EQU   NCSAPBUE+8
NCSAPRU  EQU   NCSAPBUE+3
NCSRSV04 EQU   NCSAPBUE
NCSAPEND EQU   NCSAPP+84
NCSAPTXT EQU   NCSAPP+76
NCSAPECB EQU   NCSAPP+72
NCSAPSA  EQU   NCSAPP
NCSPLPDB EQU   NCSPLSID+5
NCSPLNID EQU   NCSPLPHD
NCSPLPO  EQU   NCSPLSTA
NCSRSVD4 EQU   NCSPLSTA
NCSRSVD2 EQU   NCSCRMOD
NCSPTMOD EQU   NCSCRMOD
NCSAIMOD EQU   NCSCRMOD
NCSRSVD1 EQU   NCSCHKPT+1
NCSPTUSE EQU   NCSCHKPT+1
NCSRNME  EQU   NCSCHKPT+1
NCSCUA   EQU   NCSCHKPT+1
NCSANSMD EQU   NCSCHKPT+1
NCSLGMOD EQU   NCSCHKPT
NCSLGAPL EQU   NCSCHKPT
NCSDTRLM EQU   NCSCHKPT
NCSESLM  EQU   NCSCHKPT
NCSNRPL  EQU   NCSCHKPT
NCSPOLD  EQU   NCSCHKPT
NCSPACTV EQU   NCSCHKPT
NCSACTV  EQU   NCSCHKPT
NCSCRDTE EQU   ISTNCSPL+264
NCSPLRTY EQU   ISTNCSPL+263
NCSPLRH  EQU   ISTNCSPL+260
NCSUFMCB EQU   ISTNCSPL+256
NCSMGLPT EQU   ISTNCSPL+252
NCSCPWPT EQU   ISTNCSPL+248
NCSSENS2 EQU   NCSSENSE+2
NCSSNS2  EQU   NCSSENSE+1
NCSSNS1  EQU   NCSSENSE
NCSPLNSN EQU   ISTNCSPL+240
NCSPLMID EQU   ISTNCSPL+232
NCSPLPID EQU   ISTNCSPL+231
NCSPLGID EQU   ISTNCSPL+230
NCSPLSQN EQU   ISTNCSPL+228
NCSRNAME EQU   ISTNCSPL+220
NCSPLP2  EQU   ISTNCSPL+188
@NM00034 EQU   NCSPLFL5
NCSSDLK  EQU   NCSPLFL5
NCSSCPPS EQU   NCSPLFL5
NCSDLRSN EQU   ISTNCSPL+180
NCSPL2AP EQU   NCSPLFL4
NCSDSPN  EQU   NCSPLFL4
NCSDSPI  EQU   NCSPLFL4
NCSDSPA  EQU   NCSPLFL4
NCSDSPE  EQU   NCSPLFL4
NCSPLVID EQU   NCSPLFL4
NCSDLNID EQU   NCSPLFL4
NCSEND   EQU   NCSPLFL3
NCSFINAL EQU   NCSPLFL3
NCSANS   EQU   NCSPLFL3
NCSPID   EQU   NCSPLFL3
NCSGID   EQU   NCSPLFL3
NCSPLANS EQU   NCSPLFL3
NCSEPP   EQU   NCSPLFL3
NCSPLVIT EQU   NCSPLFL2
NCSPLVIS EQU   NCSPLFL2
NCSREMPO EQU   NCSPLFL2
NCSPLDS  EQU   NCSPLFL2
NCSPLRSF EQU   NCSPLFL2
NCSPLVDP EQU   NCSPLFL2
NCSPLPOS EQU   NCSPLFL1
NCSPLAPU EQU   NCSPLFL1
NCSPLNON EQU   NCSPLFL1
NCSPLEBN EQU   NCSPLFL1
NCSPLSOM EQU   NCSPLFL1
NCSPL2IN EQU   NCSPLFL1
NCSPLRCR EQU   ISTNCSPL+172
NCSPLECB EQU   ISTNCSPL+164
NCSPLSAF EQU   NCSPLCID
NCSPLRCD EQU   NCSPLRAD+1
NCSLSCMD EQU   NCSPLRAD
NCSPLWRE EQU   ISTNCSPL+68
NCSSTCMD EQU   NCSCRFLG
NCSUSRNF EQU   NCSCRFLG
NCSOPRQU EQU   NCSCRFLG
NCSCRDSE EQU   NCSCRFLG
NCSPLCLD EQU   NCSCRFLG
NCSPLWRM EQU   NCSCRFLG
NCSPLUAD EQU   ISTNCSPL+64
NCSMSGSP EQU   ISTNCSPL+63
NCSNCPEP EQU   ISTNCSPL+62
NCSCMDB  EQU   NCSPLCMD+1
@NM00033 EQU   NCSCMDA
NCSPLUFM EQU   NCSCMDA
NCSPLFLO EQU   NCSCMDA
NCSPLSYN EQU   NCSCMDA
NCSPLCTL EQU   NCSCMDA
NCSPLSYS EQU   NCSCMDA
NCSPLLPT EQU   ISTNCSPL+56
NCSCRPID EQU   ISTNCSPL+51
NCSCRCMD EQU   ISTNCSPL+50
NCSDLID  EQU   ISTNCSPL+44
NCSPLLID EQU   ISTNCSPL+36
NCSRRNPT EQU   ISTNCSPL+24
NCSRSV02 EQU   NCSPLVFL
NCSDACLK EQU   NCSPLVFL
NCSABCON EQU   NCSPLVFL
NCSVDEL  EQU   NCSPLVFL
NCSVNCSA EQU   NCSPLVFL
NCSVBF16 EQU   NCSPLVBF+1
NCSVBF15 EQU   NCSPLVBF+1
NCSVBF14 EQU   NCSPLVBF+1
NCSVBF13 EQU   NCSPLVBF+1
NCSVBF12 EQU   NCSPLVBF+1
NCSVBF11 EQU   NCSPLVBF+1
NCSVBF10 EQU   NCSPLVBF+1
NCSVBF09 EQU   NCSPLVBF+1
NCSVBF08 EQU   NCSPLVBF
NCSVBF07 EQU   NCSPLVBF
NCSVBF06 EQU   NCSPLVBF
NCSVBF05 EQU   NCSPLVBF
NCSVBF04 EQU   NCSPLVBF
NCSVBF03 EQU   NCSPLVBF
NCSVBF02 EQU   NCSPLVBF
NCSVBF01 EQU   NCSPLVBF
@NM00032 EQU   ISTNCSPL+16
NCSCRWKA EQU   NCSPFX+12
@NM00031 EQU   NCSPFX
PFXBCK   EQU   ISTPFX+12
PFXFWD   EQU   ISTPFX+8
PFXLNG   EQU   ISTPFX+5
PFXPRTY  EQU   ISTPFX+4
PFXCBID  EQU   PFXID
POHID    EQU   ISTPOHD+2
POHGEN   EQU   POHSTAT
POHRREQ  EQU   POHSTAT
POHRSVD2 EQU   POHSTAT
POHCNTRL EQU   POHSTAT
POHLBL   EQU   POHSTAT
POHDATA  EQU   POHSTAT
POHEND   EQU   POHSTAT
POHRSVD1 EQU   ISTPOHD
ATCAOS   EQU   ISTATCVT+1584
ATCPOPAB EQU   ATCAOSM+640
ATCVIOPM EQU   ATCAOSM+636
ATCTPMMI EQU   ATCAOSM+632
ATCTPMPB EQU   ATCAOSM+600
ATCRSV88 EQU   ATCAOSM+596
ATCRPLCT EQU   ATCAOSM+594
ATCCRACT EQU   ATCAOSM+592
ATCSRBCT EQU   ATCAOSM+590
ATCRSV75 EQU   ATCAOSM+589
ATCRSV66 EQU   ATCZFLAG
ATCZF001 EQU   ATCZFLAG
ATCTPCP1 EQU   ATCAOSM+584
ATCTPCP0 EQU   ATCAOSM+580
ATCAICTN EQU   ATCAOSM+576
ATCZR01  EQU   ATCAOSM+572
ATCMPLTA EQU   ATCAOSM+568
ATCASCB  EQU   ATCAOSM+564
ATCAP86  EQU   ATCAOSM+560
ATCAP85  EQU   ATCAOSM+556
ATCAP84  EQU   ATCAOSM+552
ATCAP83  EQU   ATCAOSM+548
ATCAP82  EQU   ATCAOSM+544
ATCAP69  EQU   ATCAOSM+540
ATCAP66  EQU   ATCAOSM+536
ATCAP62  EQU   ATCAOSM+532
ATCAPC59 EQU   ATCAOSM+528
ATCAP56  EQU   ATCAOSM+524
ATCAP55  EQU   ATCAOSM+520
ATCRCFY0 EQU   ATCAOSM+516
ATCAP41  EQU   ATCAOSM+512
ATCAPC25 EQU   ATCAOSM+508
ATCAP23  EQU   ATCAOSM+504
ATCTPSPB EQU   ATCAOSM+472
ATCTRMPB EQU   ATCAOSM+440
ATCAPBE  EQU   ATCAOSM+436
ATCPSTA  EQU   ATCAOSM+432
ATCSMABF EQU   ATCAOSM+428
ATCSMAPR EQU   ATCAOSM+424
ATCTPWQA EQU   ATCAOSM+420
ATCSMAID EQU   ATCAOSM+416
ATCSMARA EQU   ATCAOSM+412
ATCCACXA EQU   ATCAOSM+408
ATCZLAAB EQU   ATCAOSM+404
ATCATA10 EQU   ATCAOSM+400
ATCHLTCB EQU   ATCAOSM+396
@NM00029 EQU   ATCVTFLG
ATCVTACT EQU   ATCVTFLG
ATCRPT40 EQU   ATCAOSM+388
ATCRPT39 EQU   ATCAOSM+384
ATCRPT38 EQU   ATCAOSM+380
ATCRPT37 EQU   ATCAOSM+376
ATCRPT36 EQU   ATCAOSM+372
ATCRPT35 EQU   ATCAOSM+368
ATCRPT34 EQU   ATCAOSM+364
ATCRPT33 EQU   ATCAOSM+360
ATCRPT32 EQU   ATCAOSM+356
ATCRPT31 EQU   ATCAOSM+352
ATCRPT30 EQU   ATCAOSM+348
ATCRPT29 EQU   ATCAOSM+344
ATCRPT28 EQU   ATCAOSM+340
ATCRPT27 EQU   ATCAOSM+336
@NM00028 EQU   ATCAOSM+333
@NM00027 EQU   @NM00026
ATCSNUF  EQU   @NM00026
ATCOPKL  EQU   @NM00026
ATCABEN  EQU   @NM00026
ATCAIWT  EQU   ATCAOSM+328
ATCINFDD EQU   ATCAOSM+324
ATCORFMG EQU   ATCAOSM+320
ATCORFRL EQU   ATCAOSM+316
ATCOROBT EQU   ATCAOSM+312
ATCORQG  EQU   ATCORSRB
ATCORTBF EQU   ATCSQAFR
ATCRPLAC EQU   ATCRPLCN+2
ATCRPLRC EQU   ATCRPLCN
ATCCRPLQ EQU   ATCCRPL
ATCSRBAC EQU   ATCSRBCN+2
ATCSRBRC EQU   ATCSRBCN
ATCSRBQ  EQU   ATCSRB
ATCCRAAC EQU   ATCCRACN+2
ATCCRARC EQU   ATCCRACN
ATCCRAQ  EQU   ATCCRA
ATCRPT12 EQU   ATCAOSM+276
ATCDMAPP EQU   ATCAOSM+272
ATCAP38  EQU   ATCAOSM+268
ATCZDFJ0 EQU   ATCAOSM+260
ATCAP51  EQU   ATCAOSM+256
ATCZPAB2 EQU   ATCAOSM+224
ATCZPAB1 EQU   ATCAOSM+192
ATCZLFVT EQU   ATCAOSM+188
ATCZLPVT EQU   ATCAOSM+184
ATCZDVTX EQU   ATCAOSM+180
ATCZDVTA EQU   ATCAOSM+176
ATCZDVT9 EQU   ATCAOSM+172
ATCZDVT8 EQU   ATCAOSM+168
ATCZDVT7 EQU   ATCAOSM+164
ATCRSV56 EQU   ATCDAPVT+22
ATCDAPDG EQU   ATCDAPVT+20
ATCDXCEA EQU   ATCDAPVT+16
ATCDCEA  EQU   ATCDAPVT+12
ATCDPCIA EQU   ATCDAPVT+8
ATCDSIOA EQU   ATCDAPVT+4
ATCDEOEA EQU   ATCDAPVT
ATCZLAEA EQU   ATCLDAPP+16
ATCZLCEA EQU   ATCLDAPP+12
ATCRSV17 EQU   ATCLDAPP+8
ATCSMFRR EQU   ATCLDAPP+4
ATCCDTID EQU   ATCLDAPP
ATCZAEA  EQU   ATCICAPP+16
ATCZCEA  EQU   ATCICAPP+12
ATCCDTCB EQU   ATCICAPP+8
ATCZSIOA EQU   ATCICAPP+4
ATCCDRPH EQU   ATCICAPP
ATCAP65  EQU   ATCAOSM+96
ATCZDVT6 EQU   ATCAOSM+92
ATCZDVT4 EQU   ATCAOSM+88
ATCZDVT3 EQU   ATCAOSM+84
ATCZDVT1 EQU   ATCAOSM+80
ATCICNCB EQU   ATCAOSM+76
ATCZPSVT EQU   ATCAOSM+72
ATCZFSVT EQU   ATCAOSM+68
ATCAP64  EQU   ATCAOSM+64
ATCAP63  EQU   ATCAOSM+60
ATCAP61  EQU   ATCAOSM+56
ATCAP58  EQU   ATCAOSM+52
ATCAP57  EQU   ATCAOSM+48
ATCAP54  EQU   ATCAOSM+44
ATCAP53  EQU   ATCAOSM+40
ATCAP52  EQU   ATCAOSM+36
ATCAP12  EQU   ATCAOSM+20
ATCAP11  EQU   ATCAOSM+16
ATCCMTCB EQU   ATCAOSM+12
ATCPRPH  EQU   ATCAOSM+8
ATCGSRBF EQU   ATCGSRBG
ATCSRBRT EQU   ATCAOSM
@NM00025 EQU   @NM00024
ATCVTMAB EQU   @NM00024
@NM00023 EQU   ATCVTBAM
ATCVDLOK EQU   ISTATCVT+904
ATCVFPAB EQU   ISTATCVT+872
ATCVDPAB EQU   ISTATCVT+840
ATCIOECB EQU   ISTATCVT+836
ATCMODTB EQU   ISTATCVT+828
ATCUSSPT EQU   ISTATCVT+824
ATCSRTAB EQU   ISTATCVT+820
@NM00022 EQU   ISTATCVT+819
@NM00021 EQU   ATCSTAT2
ATCTRSMS EQU   ATCSTAT2
ATCTRLOK EQU   ATCSTAT2
ATCTRPSS EQU   ATCSTAT2
ATCTRESC EQU   ATCSTAT2
ATCTRAPI EQU   ATCSTAT2
ATCNMCTR EQU   ISTATCVT+816
ATCSEC51 EQU   ATCSECST
ATCSEC40 EQU   ATCSIPD+8
ATCSEC30 EQU   ATCSIPD+4
ATCSEC21 EQU   ATCSIPD
ATCSEC10 EQU   ATCSOPD+4
ATCSEC01 EQU   ATCSOPD
ATCPOIA  EQU   ATCRNO+1
@NM00020 EQU   ATCRNO
ATCPODVT EQU   ISTATCVT+784
ATCS49XL EQU   ISTATCVT+780
ATCS49XI EQU   ISTATCVT+776
ATCLCLCT EQU   ATCVLCNT+2
ATCRNCNT EQU   ATCVLCNT
ATCCFEAD EQU   ISTATCVT+768
ATCPTR00 EQU   ISTATCVT+736
ATCRSV10 EQU   ISTATCVT+704
ATCTACB  EQU   ISTATCVT+700
ATCVTINM EQU   ISTATCVT+696
ATCTCLIM EQU   ISTATCVT+692
ATCTCLOM EQU   ISTATCVT+688
ATCVTIPB EQU   ISTATCVT+656
ATCTIPAB EQU   ISTATCVT+592
ATCOCCCB EQU   ISTATCVT+588
ATCOCCOB EQU   ISTATCVT+584
ATCCDLAD EQU   ISTATCVT+580
ATCCCLAD EQU   ISTATCVT+576
ATCDLRPB EQU   ISTATCVT+544
ATCPGPAB EQU   ISTATCVT+512
ATCVPAB1 EQU   ISTATCVT+480
ATCRSV97 EQU   ISTATCVT+476
ATCRDTLK EQU   ISTATCVT+472
ATCVOCLK EQU   ISTATCVT+468
ATCDVTLK EQU   ISTATCVT+456
ATCAP36  EQU   ISTATCVT+452
ATCAP35  EQU   ISTATCVT+448
ATCAP33  EQU   ISTATCVT+444
ATCRSV99 EQU   ISTATCVT+440
ATCONFIG EQU   ISTATCVT+432
ATCNODDS EQU   ISTATCVT+428
ATCNODEL EQU   ISTATCVT+420
ATCRSV69 EQU   ISTATCVT+416
ATCAPCR5 EQU   ISTATCVT+412
ATCLDECB EQU   ISTATCVT+408
ATCLDNCS EQU   ISTATCVT+404
ATCCDPTR EQU   ISTATCVT+400
ATCADEL  EQU   ISTATCVT+396
ATCTODVT EQU   ISTATCVT+392
ATCDEBCH EQU   ISTATCVT+388
ATCHBSIZ EQU   ATCHPGM+2
ATCHBFNO EQU   ATCHPGM
ATCCRME  EQU   ISTATCVT+380
ATCRVCHS EQU   ISTATCVT+372
ATCECTLP EQU   ISTATCVT+368
ATCZDVTB EQU   ISTATCVT+364
ATCECPRT EQU   ISTATCVT+360
ATCVTLOD EQU   ISTATCVT+356
ATCTRPAB EQU   ISTATCVT+352
ATCMSGM  EQU   ISTATCVT+348
ATCEPT   EQU   ISTATCVT+340
ATCDVT   EQU   ISTATCVT+336
ATCTRCPT EQU   ISTATCVT+332
ATCDVLOD EQU   ISTATCVT+328
ATCALERT EQU   ISTATCVT+324
ATCEPA   EQU   ISTATCVT+320
ATCSAF   EQU   ISTATCVT+318
ATCXRANG EQU   ISTATCVT+317
ATCLAST  EQU   ATCSHRFG
ATCSHRTN EQU   ISTATCVT+308
ATCUEP   EQU   ISTATCVT+304
ATCOCRT  EQU   ISTATCVT+300
ATCCSMA  EQU   ATCCSMR
ATCESC02 EQU   ISTATCVT+292
ATCESC01 EQU   ISTATCVT+288
ATCMNT   EQU   ISTATCVT+272
ATCRSV16 EQU   ISTATCVT+270
ATCMAXID EQU   ISTATCVT+269
ATCMSGSP EQU   ATCCOM+268
ATCACTRM EQU   ATCCOM+264
ATCNERAP EQU   ATCCOM+260
ATCNESAL EQU   ATCCOM+256
ATCRCC65 EQU   ATCCOM+252
ATCRCC26 EQU   ATCCOM+248
ATCRCC63 EQU   ATCCOM+244
ATCRSV11 EQU   ATCCOM+242
ATCVTMID EQU   ATCCOM+240
ATCAPOST EQU   ATCCOM+236
ATCNERFN EQU   ATCCOM+232
ATCNERNE EQU   ATCCOM+228
ATCNERCV EQU   ATCCOM+224
ATCNERST EQU   ATCCOM+220
ATCDCC61 EQU   ATCCOM+216
ATCDCC60 EQU   ATCCOM+212
ATCSRTDF EQU   ATCCOM+208
ATCSRTAD EQU   ATCCOM+204
ATCFIRA  EQU   ATCCOM+200
ATCSMBQ  EQU   ATCCOM+196
ATCSMRC  EQU   ATCCOM+192
ATCSMRS  EQU   ATCCOM+188
ATCSMQU  EQU   ATCCOM+184
ATCSMRQ  EQU   ATCCOM+180
ATCACDA  EQU   ATCCOM+176
ATCSTMA  EQU   ATCCOM+172
ATCFRSTR EQU   ATCCOM+168
ATCGTSTR EQU   ATCCOM+164
ATCREADA EQU   ATCCOM+160
ATCALOAD EQU   ATCCOM+156
ATCBLDLA EQU   ATCCOM+152
ATCFBRPH EQU   ATCCOM+148
ATCBFTRC EQU   ATCCOM+144
ATCTPBUF EQU   ATCTHTRC
ATCREMOV EQU   ATCCOM+136
ATCADD   EQU   ATCCOM+132
ATCBPDA  EQU   ATCCOM+128
ATCDVTPT EQU   ATCCOM+124
ATCFEPT  EQU   ATCCOM+120
ATCFDVT  EQU   ATCCOM+116
ATCPTCHA EQU   ATCCOM+108
ATCAUTHA EQU   ATCCOM+104
ATCACCTA EQU   ATCCOM+100
ATCRDTH  EQU   ATCCOM+96
ATCFRSCH EQU   ATCCOM+92
ATCFSB   EQU   ATCCOM+88
ATCHLTMS EQU   ATCCOM+84
ATCECPRM EQU   ATCCOM+80
ATCECNET EQU   ATCCOM+76
ATCECOPC EQU   ATCCOM+72
ATCVPARM EQU   ATCCOM+68
ATCECVRQ EQU   ATCCOM+64
ATCECSES EQU   ATCCOM+60
ATCOCHA  EQU   ATCCOM+56
ATCDSPLQ EQU   ATCCOM+52
ATCECDSP EQU   ATCCOM+48
ATCVARYQ EQU   ATCCOM+44
ATCECVRY EQU   ATCCOM+40
ATCHALTQ EQU   ATCCOM+36
ATCECHLT EQU   ATCCOM+32
ATCMODQ  EQU   ATCCOM+28
ATCECMOD EQU   ATCCOM+24
ATCASCHD EQU   ATCCOM+20
ATCSRT   EQU   ATCCOM+16
ATCRDT   EQU   ATCCOM+12
ATCDCFRR EQU   ATCCOM+8
ATCAPI   EQU   ATCCOM+4
ATCRSV04 EQU   ATCSTAT4
ATCVTTRC EQU   ATCSTAT4
ATCNCSD  EQU   ATCSTAT4
ATCMTST  EQU   ATCSTAT4
ATCTPRT  EQU   ATCSTAT4
ATCPRTAT EQU   ATCSTAT4
@NM00019 EQU   ATCPOFLG
ATCPOUNS EQU   ATCPOFLG
ATCHSDMF EQU   ATCSTFLG
@NM00018 EQU   ATCSTAT1
ATCMDHLT EQU   ATCSTAT1
ATCINHLT EQU   ATCSTAT1
ATCNETSL EQU   ATCSTAT1
ATCQKHLT EQU   ATCSTAT1
ATCSNHLT EQU   ATCSTAT1
ATCACTIV EQU   ATCSTAT1
ATCSTART EQU   ATCSTAT1
LOKXCL   EQU   @NM00016
LOKPRY   EQU   @NM00016
@NM00017 EQU   @NM00016
@NM00015 EQU   LOKCHNG
LOKCT    EQU   ISTLOK
DYPRSV01 EQU   ISTDYPAB+12
DYPTSKID EQU   ISTDYPAB+8
DYPCHAIN EQU   ISTDYPAB+4
DYPFLGS  EQU   ISTDYPAB+2
DYPLNGTH EQU   ISTDYPAB+1
DYPTYPE  EQU   ISTDYPAB
PABRPHA  EQU   PABRPHFG+1
PABNODQ  EQU   PABFLAGS
PABINHBT EQU   PABFLAGS
PABERLOK EQU   PABERRLK
PABSSN   EQU   PABFLAGS
PABDYNAM EQU   PABFLAGS
PABNORPR EQU   PABFLAGS
PABPRIOR EQU   PABFLAGS
PABAPYP  EQU   PABFLAGS
PABDVTA  EQU   ISTPAB+9
PABOFFST EQU   ISTPAB+8
PABRSV02 EQU   PABCHAIN
PABDELAY EQU   PABCHAIN
PABRUNNG EQU   PABCHAIN
PABRESET EQU   PABCHAIN
PABUNCON EQU   PABCHAIN
PABCDP   EQU   PABCHAIN
PABRESCH EQU   PABCHAIN
PABCHNG  EQU   PABCHAIN
PABWEQP  EQU   PABWEQA+1
PABRSV01 EQU   PABWEQA
PABWEQG  EQU   PABWEQA
RPHNEXPO EQU   ISTRPH+104
RPHSAV16 EQU   RPHWORK+60
RPHSAV15 EQU   RPHWORK+56
RPHSAV14 EQU   RPHWORK+52
RPHSAV13 EQU   RPHWORK+48
RPHSAV12 EQU   RPHWORK+44
RPHSAV11 EQU   RPHWORK+40
RPHSAV10 EQU   RPHWORK+36
RPHSAVE9 EQU   RPHWORK+32
RPHSAVE8 EQU   RPHWORK+28
RPHSAVE7 EQU   RPHWORK+24
RPHSAVE6 EQU   RPHWORK+20
RPHSAVE5 EQU   RPHWORK+16
RPHSAVE4 EQU   RPHWORK+12
RPHSAVE3 EQU   RPHWORK+8
RPHSAVE2 EQU   RPHWORK+4
RPHSHALF EQU   RPHSAVE1+2
RPHSBIT8 EQU   RPHSBITS
RPHSBIT7 EQU   RPHSBITS
RPHSBIT6 EQU   RPHSBITS
RPHSBIT5 EQU   RPHSBITS
RPHSBIT4 EQU   RPHSBITS
RPHSBIT3 EQU   RPHSBITS
RPHSBIT2 EQU   RPHSBITS
RPHSBIT1 EQU   RPHSBITS
RPHSBYTE EQU   RPHSAVE1
RPHPABFG EQU   RPHPABQA
RPHSRP34 EQU   RPHSRPRM+2
RPHSRP12 EQU   RPHSRPRM
RPHWEGT  EQU   RPHCSPA
RPHRESUM EQU   RPHRESMA+1
RPHRSV01 EQU   RPHWPFLG
RPHPURGE EQU   RPHWPFLG
RPHPT    EQU   RPHWPFLG
RPHRSKEY EQU   RPHWPFLG
RPHDVTA  EQU   ISTRPH+12
RPHTIK   EQU   RPHTSKID+3
@NM00014 EQU   RPHTSKID
RPHRPHAP EQU   RPHRPHA+1
@NM00013 EQU   RPHRPHA
RPHGATE  EQU   RPHRPHA
@NM00012 EQU   RPHFLGB
RPHRLCRA EQU   RPHFLGB
RPHNRSAV EQU   RPHFLGB
RPHPGCMP EQU   RPHFLGB
RPHFBAPS EQU   RPHFLGB
RPHBSSP  EQU   RPHFLGB
RPHLOCK  EQU   RPHFLGB
RPHFNFLG EQU   RPHFSTLC
RPHMLTCP EQU   RPHFLAGS
RPHSMCLR EQU   RPHFLAGS
RPHSMTYP EQU   RPHFLAGS
RPHSMQ   EQU   RPHFLAGS
RPHAUTEX EQU   RPHAPTYP
RPHSPGIN EQU   RPHFLAGS
RPHOGIND EQU   RPHFLAGS
RPHLNGTH EQU   RPHCNTL+1
@NM00011 EQU   SRBSECT+40
@NM00010 EQU   SRBSECT+38
SRBPRIOR EQU   SRBSECT+37
SRBPKF   EQU   SRBSECT+36
SRBSAVE  EQU   SRBSECT+32
SRBPARM  EQU   SRBSECT+28
SRBRMTR  EQU   SRBSECT+24
SRBEP    EQU   SRBSECT+20
SRBPTCB  EQU   SRBFLC+4
SRBPASID EQU   SRBFLC+2
SRBCPAFF EQU   SRBFLC
SRBASCB  EQU   SRBSECT+8
SRBFLNK  EQU   SRBSECT+4
SRBID    EQU   SRBSECT
IOSEND   EQU   IOSB+108
IOSSKR   EQU   IOSEEKA+7
IOSSKH2  EQU   IOSSKHH+1
IOSSKH1  EQU   IOSSKHH
IOSSKCC  EQU   IOSCCHH
IOSSKBB  EQU   IOSEEKA+1
IOSSKM   EQU   IOSEEKA
IOSEEK   EQU   IOSB+92
IOSMDM   EQU   IOSB+91
IOSMDB   EQU   IOSB+90
IOSCKEY7 EQU   IOSCKEY
IOSCKEY6 EQU   IOSCKEY
IOSCKEY5 EQU   IOSCKEY
IOSCKEY4 EQU   IOSCKEY
@NM00006 EQU   IOSCKEY
IOSFMSK  EQU   IOSB+88
IOSCUDEV EQU   IOSPATH+1
@NM00005 EQU   IOSCHN
IOSPATH3 EQU   IOSCHN
IOSPATH2 EQU   IOSCHN
IOSEXP   EQU   IOSCHN
IOSGDP   EQU   IOSCHN
IOSAFF   EQU   IOSB+85
IOSRSS1B EQU   IOSB+84
IOSDSID  EQU   IOSB+80
IOSVST   EQU   IOSB+76
IOSRST   EQU   IOSB+72
IOSDIE   EQU   IOSB+68
IOSABN   EQU   IOSB+64
IOSNRM   EQU   IOSB+60
IOSPCI   EQU   IOSB+56
IOSERP   EQU   IOSB+52
IOSPCHN  EQU   IOSB+48
IOSSNS   EQU   IOSB+42
IOSAPMSK EQU   IOSB+40
IOSRES4A EQU   IOSB+36
IOSUSE   EQU   IOSB+32
IOSSRB   EQU   IOSB+28
IOSCSWRC EQU   IOSCSW+5
IOSTSB   EQU   IOSTATUS+1
IOSTSA   EQU   IOSTATUS
IOSCSWCA EQU   IOSCSW
IOSCC    EQU   @NM00004
IOSUCB   EQU   IOSB+16
IOSOPT2X EQU   IOSOPT2
IOSHTP   EQU   IOSOPT2
IOSRELSE EQU   IOSOPT
IOSAPR   EQU   IOSOPT
IOSTSLL  EQU   IOSOPT
IOSNERP  EQU   IOSOPT
IOSPSLL  EQU   IOSOPT
IOSQISCE EQU   IOSOPT
IOSDEP   EQU   IOSOPT
IOSBYP   EQU   IOSOPT
IOSCOD   EQU   IOSB+13
IOSPKY7  EQU   IOSPKEY
IOSPGDPX EQU   IOSPKEY
IOSIDR   EQU   IOSPKEY
IOSLCL   EQU   IOSPKEY
@NM00003 EQU   IOSPKEY
IOSPGAD  EQU   IOSB+8
IOSASID  EQU   IOSB+6
IOSPRLVL EQU   IOSB+5
IOSDVRID EQU   IOSB+4
IOSPROC  EQU   IOSB+3
IOSFLC7  EQU   IOSFLC
IOSFLC6  EQU   IOSFLC
IOSRWAIT EQU   IOSFLC
IOSTP    EQU   IOSFLC
IOSCC3WE EQU   IOSFLC
IOSVERIF EQU   IOSDVALT
IOSDVMNT EQU   IOSFLC
IOSLOG   EQU   IOSFLB
IOSBDCST EQU   IOSFLB
IOSMSG   EQU   IOSFLB
IOSFLB4  EQU   IOSFLB
IOSFLB3  EQU   IOSFLB
IOSFLB2  EQU   IOSFLB
IOSSDR   EQU   IOSFLB
IOSDIESE EQU   IOSFLB
IOSIOSB  EQU   IOSFLA
IOSDOM   EQU   IOSFLA
IOSEX    EQU   IOSFLA
IOSSMDB  EQU   IOSFLA
IOSSMDA  EQU   IOSFLA
IOSERR   EQU   IOSFLA
IOSCCHN  EQU   IOSACHN
IOSDCHN  EQU   IOSACHN
IOBERRCT EQU   IOBSTDRD+30
IOBRSV19 EQU   IOBINCAM+1
IOBOLTST EQU   IOBBTAMF
IOBRFTMG EQU   IOBBTAMF
IOBRSV17 EQU   IOBBTAMF
IOBRSV16 EQU   IOBBTAMF
IOBRSV15 EQU   IOBBTAMF
IOBRSV14 EQU   IOBBTAMF
IOBINUSE EQU   IOBBTAMF
IOBPRMER EQU   IOBBTAMF
IOBRSTRB EQU   IOBRESTR+1
IOBREPOS EQU   IOBRESTR
IOBDCBPB EQU   IOBDCBPT+1
IOBRSV44 EQU   IOBFLAG4
IOBJES3I EQU   IOBFLAG4
IOBRSV42 EQU   IOBFLAG4
IOBRSV41 EQU   IOBFLAG4
IOBRSV40 EQU   IOBFLAG4
IOBPMERR EQU   IOBFLAG4
IOBCC3WE EQU   IOBFLAG4
IOBGDPOL EQU   IOBFLAG4
IOBSTRTB EQU   IOBSTART+1
IOBSIOCC EQU   IOBSTART
IOBCSB7  EQU   IOBCSTAT
IOBCSB6  EQU   IOBCSTAT
IOBCSB5  EQU   IOBCSTAT
IOBCSB4  EQU   IOBCSTAT
IOBCSB3  EQU   IOBCSTAT
IOBCSB2  EQU   IOBCSTAT
IOBCSB1  EQU   IOBCSTAT
IOBCSB0  EQU   IOBCSTAT
IOBUSB7  EQU   IOBUSTAT
IOBUSB6  EQU   IOBUSTAT
IOBUSB5  EQU   IOBUSTAT
IOBUSB4  EQU   IOBUSTAT
IOBUSB3  EQU   IOBUSTAT
IOBUSB2  EQU   IOBUSTAT
IOBUSB1  EQU   IOBUSTAT
IOBUSB0  EQU   IOBUSTAT
IOBCMDA  EQU   IOBIOCSW
IOBLOG   EQU   IOBFL3
IOBJAM   EQU   IOBICL
IOBMSG   EQU   IOBFL3
IOBSDR   EQU   IOBCNC
IOBACU   EQU   IOBFL3
IOBCDC   EQU   IOBFL3
IOBICC   EQU   IOBFL3
IOBCCC   EQU   IOBFL3
IOBECBPB EQU   IOBECBPT+1
IOBECBCC EQU   IOBECBPT
IOBS1B7  EQU   IOBSENS1
IOBS1B6  EQU   IOBSENS1
IOBS1B5  EQU   IOBSENS1
IOBS1B4  EQU   IOBSENS1
IOBS1B3  EQU   IOBSENS1
IOBS1B2  EQU   IOBSENS1
IOBS1B1  EQU   IOBSENS1
IOBS1B0  EQU   IOBSENS1
IOBSNSC9 EQU   IOBS0B7
IOBS0B6  EQU   IOBSENS0
IOBS0B5  EQU   IOBSENS0
IOBS0B4  EQU   IOBSENS0
IOBS0B3  EQU   IOBSENS0
IOBS0B2  EQU   IOBSENS0
IOBS0B1  EQU   IOBSENS0
IOBS0B0  EQU   IOBSENS0
IOBPNCH  EQU   IOBFLAG2
IOBSTATO EQU   IOBFLAG2
IOBSKUPD EQU   IOBFLAG2
IOBALTTR EQU   IOBFLAG2
IOBRRT2  EQU   IOBRDHA0
IOBRRT3  EQU   IOBPURGE
IOBSENSE EQU   IOBFLAG2
IOBHALT  EQU   IOBFLAG2
IOBSPSVC EQU   IOBRSTRT
IOBUNREL EQU   IOBFLAG1
IOBIOERR EQU   IOBFLAG1
IOBFCREX EQU   IOBCYCCK
IOBRPSTN EQU   IOBFLAG1
IOBERRTN EQU   IOBFLAG1
IOBCMDCH EQU   IOBFLAG1
IOBDATCH EQU   IOBFLAG1
IOBCNOPA EQU   IOBPREFX+12
IOBCICB  EQU   IOBPREFX+8
IOBCECB  EQU   IOBPREFX+4
IOBCONOP EQU   IOBPREFX+3
IOBCINOP EQU   IOBPREFX+2
IOBRSV05 EQU   IOBPREFX+1
IOBPCI   EQU   IOBCFLG1
IOBRSTCH EQU   IOBCFLG1
IOBABAPP EQU   IOBCFLG1
IOBPTST  EQU   IOBCFLG1
IOBRSV04 EQU   IOBCFLG1
IOBRSV03 EQU   IOBCFLG1
IOBRSV02 EQU   IOBCFLG1
IOBRSV01 EQU   IOBCFLG1
CVTLEVL  EQU   CVTRELNO+2
CVTNUMB  EQU   CVTRELNO
CVTMDL   EQU   CVTFIX+250
@NM00002 EQU   CVTFIX+248
@NM00001 EQU   CVTFIX
CVTRV482 EQU   CVTXTNT2+128
CVTRV481 EQU   CVTXTNT2+124
CVTRV480 EQU   CVTXTNT2+120
CVTRV479 EQU   CVTXTNT2+118
CVTRV478 EQU   CVTXTNT2+117
CVTRV477 EQU   CVTXTNT2+116
CVTRV476 EQU   CVTXTNT2+115
CVTRV475 EQU   CVTXTNT2+114
CVTRV474 EQU   CVTRV466
CVTRV473 EQU   CVTRV466
CVTRV472 EQU   CVTRV466
CVTRV471 EQU   CVTRV466
CVTRV470 EQU   CVTRV466
CVTRV469 EQU   CVTRV466
CVTRV468 EQU   CVTRV466
CVTRV467 EQU   CVTRV466
CVTRV465 EQU   CVTRV457
CVTRV464 EQU   CVTRV457
CVTRV463 EQU   CVTRV457
CVTRV462 EQU   CVTRV457
CVTRV461 EQU   CVTRV457
CVTRV460 EQU   CVTRV457
CVTRV459 EQU   CVTRV457
CVTRV458 EQU   CVTRV457
CVTRV456 EQU   CVTXTNT2+108
CVTRV455 EQU   CVTXTNT2+104
CVTRV454 EQU   CVTXTNT2+100
CVTRV453 EQU   CVTXTNT2+96
CVTRV452 EQU   CVTXTNT2+94
CVTRV451 EQU   CVTXTNT2+92
CVTRV450 EQU   CVTXTNT2+90
CVTRV449 EQU   CVTXTNT2+88
CVTRV448 EQU   CVTXTNT2+87
CVTRV447 EQU   CVTXTNT2+86
CVTRV446 EQU   CVTRV438
CVTRV445 EQU   CVTRV438
CVTRV444 EQU   CVTRV438
CVTRV443 EQU   CVTRV438
CVTRV442 EQU   CVTRV438
CVTRV441 EQU   CVTRV438
CVTRV440 EQU   CVTRV438
CVTRV439 EQU   CVTRV438
CVTRV437 EQU   CVTRV429
CVTRV436 EQU   CVTRV429
CVTRV435 EQU   CVTRV429
CVTRV434 EQU   CVTRV429
CVTRV433 EQU   CVTRV429
CVTRV432 EQU   CVTRV429
CVTRV431 EQU   CVTRV429
CVTRV430 EQU   CVTRV429
CVTRV428 EQU   CVTXTNT2+80
CVTRV427 EQU   CVTXTNT2+76
CVTRV426 EQU   CVTXTNT2+72
CVTRV425 EQU   CVTXTNT2+68
CVTATACT EQU   CVTATCVT
CVTRV423 EQU   CVTXTNT2+62
CVTRV422 EQU   CVTXTNT2+60
CVTRV421 EQU   CVTXTNT2+58
CVTRV420 EQU   CVTXTNT2+56
CVTRV419 EQU   CVTXTNT2+55
CVTRV418 EQU   CVTXTNT2+54
CVTRV417 EQU   CVTRV409
CVTRV416 EQU   CVTRV409
CVTRV415 EQU   CVTRV409
CVTRV414 EQU   CVTRV409
CVTRV413 EQU   CVTRV409
CVTRV412 EQU   CVTRV409
CVTRV411 EQU   CVTRV409
CVTRV410 EQU   CVTRV409
CVTRV408 EQU   CVTRV400
CVTRV407 EQU   CVTRV400
CVTRV406 EQU   CVTRV400
CVTRV405 EQU   CVTRV400
CVTRV404 EQU   CVTRV400
CVTRV403 EQU   CVTRV400
CVTRV402 EQU   CVTRV400
CVTRV401 EQU   CVTRV400
CVTICB   EQU   CVTXTNT2+48
CVTSKTA  EQU   CVTXTNT2+44
CVTSHSB  EQU   CVTSHS
CVTRSV98 EQU   CVTXTNT2+36
CVTRSV97 EQU   CVTXTNT2+34
CVTRSV96 EQU   CVTXTNT2+32
CVTOLTEP EQU   CVTXTNT2+28
CVTQIDA  EQU   CVTQID+1
CVTRSV95 EQU   CVTQID
CVTRSV94 EQU   CVTXTNT2+20
CVTRSV93 EQU   CVTXTNT2+16
CVTRSV92 EQU   CVTXTNT2+12
CVTDEBVR EQU   CVTXTNT2+8
CVTRSV91 EQU   CVTXTNT2+6
CVTRSV9H EQU   CVTFLGBT
CVTRSV9G EQU   CVTFLGBT
CVTRSV9F EQU   CVTFLGBT
CVTRSV9E EQU   CVTFLGBT
CVTRSV9D EQU   CVTFLGBT
CVTRSV9C EQU   CVTFLGBT
CVTVME   EQU   CVTFLGBT
CVTNPE   EQU   CVTFLGBT
CVTNUCLS EQU   CVTXTNT2+4
CVTDSSVA EQU   CVTDSSV+1
CVTRSV89 EQU   CVTDSSV
CVTRSV88 EQU   CVTXTNT1+8
CVTRSV87 EQU   CVTXTNT1+4
CVTFACHN EQU   CVTXTNT1
CVTRV488 EQU   CVTMAP+412
CVTRV487 EQU   CVTMAP+408
CVTRV486 EQU   CVTMAP+404
CVTRV485 EQU   CVTMAP+400
CVTACTAP EQU   CVTMAP+396
CVTAUTH  EQU   CVTMAP+392
CVTATMCA EQU   CVTATMCT+1
CVTATMST EQU   CVTATMCT
CVTRSV61 EQU   CVTMAP+384
CVTVOLT1 EQU   CVTVOLM1+1
CVTVOLI1 EQU   CVTVOLF1
CVTSTOA  EQU   CVTMAP+376
CVTRSV58 EQU   CVTMAP+374
CVTRSV57 EQU   CVTMAP+372
CVTDDCE  EQU   CVTMAP+368
CVTPNWFR EQU   CVTMAP+364
CVTSMF   EQU   CVTMAP+360
CVTSULK  EQU   CVTMAP+358
CVTSLKO  EQU   CVTSYSK
CVTSLKP  EQU   CVTSYSK
CVTSLKQ  EQU   CVTSYSK
CVTSLKR  EQU   CVTSYSK
CVTRSV56 EQU   CVTSYSK
CVTRSV55 EQU   CVTSYSK
CVTRSV54 EQU   CVTSYSK
CVTRSV53 EQU   CVTSYSK
CVTRSV52 EQU   CVTA1F1
CVTRSV51 EQU   CVTA1F1
CVTRSV50 EQU   CVTA1F1
CVTRSV49 EQU   CVTA1F1
CVTRSV48 EQU   CVTA1F1
CVTRSV47 EQU   CVTA1F1
CVTSRSW  EQU   CVTA1F1
CVTPFSW  EQU   CVTA1F1
CVTPCVT  EQU   CVTMAP+352
CVTRSV46 EQU   CVTMAP+344
CVTRSV45 EQU   CVTMAP+340
CVTRSV44 EQU   CVTMAP+338
CVTRSV43 EQU   CVTMAP+336
CVTHJESA EQU   CVTHJES+1
CVTRSV42 EQU   CVTHJES
CVTEXT2A EQU   CVTEXT2+1
CVTRSV41 EQU   CVTEXT2
CVTAPFA  EQU   CVTAPF+1
CVTRSV40 EQU   CVTAPF
CVTRV518 EQU   CVTINTLA
CVTRV517 EQU   CVTERPV
CVTEORM  EQU   CVTMAP+312
CVTMCHPR EQU   CVTMAP+308
CVTTZ    EQU   CVTMAP+304
CVTJEPS  EQU   CVTMAP+300
CVTJESCT EQU   CVTMAP+296
CVTMODE  EQU   CVTMAP+292
CVTPTRV  EQU   CVTMAP+288
CVTREAL  EQU   CVTMAP+284
CVTRSV39 EQU   CVTMAP+280
CVTRSV38 EQU   CVTMAP+276
CVTDMSRA EQU   CVTDMSR+1
CVTRV634 EQU   CVTDMSRF
CVTRV633 EQU   CVTDMSRF
CVTRV632 EQU   CVTDMSRF
CVTRV631 EQU   CVTDMSRF
CVTRV630 EQU   CVTDMSRF
CVTRV629 EQU   CVTDMSRF
CVTUDUMP EQU   CVTDMSRF
CVTSDUMP EQU   CVTDMSRF
CVTQMSGA EQU   CVTQMSG+1
CVTRSV36 EQU   CVTQMSG
CVTAMFF  EQU   CVTMAP+264
CVTPURGA EQU   CVTPURG+1
CVTRSV35 EQU   CVTPURG
CVTCBSP  EQU   CVTMAP+256
CVTATERA EQU   CVTATER+1
CVTSYST  EQU   CVTATER
CVTVOLT2 EQU   CVTTAT
CVTVOLI2 EQU   CVTVOLF2
CVTAQAVB EQU   CVTAQAVT+1
CVTRSV34 EQU   CVTTCMFG
CVTRSV33 EQU   CVTTCMFG
CVTRSV32 EQU   CVTTCMFG
CVTRSV31 EQU   CVTTCMFG
CVTRSV30 EQU   CVTTCMFG
CVTRSV29 EQU   CVTTCMFG
CVTRSV28 EQU   CVTTCMFG
CVTTCRDY EQU   CVTTCMFG
CVTGTFA  EQU   CVTGTF+1
CVTRSV27 EQU   CVTGTFST
CVTRNIO  EQU   CVTGTFST
CVTUSR   EQU   CVTGTFST
CVTRV318 EQU   CVTFORM
CVTRV317 EQU   CVTTMODE
CVTRV316 EQU   CVTSTATE
CVTRV315 EQU   CVTGTFS
CVTGTFAV EQU   CVTGTFS
CVT0SCR1 EQU   CVTMAP+232
CVTRV515 EQU   CVTMAP+228
CVTRMS   EQU   CVTMAP+224
CVTPATCH EQU   CVTMAP+220
CVTTSCE  EQU   CVTMAP+216
CVTLNKSC EQU   CVTMAP+214
CVTQABST EQU   CVTMAP+212
CVTMDLDS EQU   CVTMAP+208
CVTUSER  EQU   CVTMAP+204
CVTABEND EQU   CVTMAP+200
CVTSMCA  EQU   CVTMAP+196
CVTRSV18 EQU   CVTMAP+192
CVTQLPAQ EQU   CVTMAP+188
CVTQCDSR EQU   CVTMAP+184
CVTRSV17 EQU   CVTOPTB
CVTRSV16 EQU   CVTOPTB
CVTFP    EQU   CVTOPTB
CVTAPTHR EQU   CVTOPTB
CVTNLOG  EQU   CVTOPTB
CVTTOD   EQU   CVTOPTB
CVTCTIMS EQU   CVTOPTB
CVTPROT  EQU   CVTOPTB
CVTXPFP  EQU   CVTOPTA
CVTASCII EQU   CVTOPTA
CVTRSV13 EQU   CVTOPTA
CVTRSV12 EQU   CVTOPTA
CVTNIP   EQU   CVTOPTA
CVTDDR   EQU   CVTOPTA
CVTAPR   EQU   CVTOPTA
CVTCCH   EQU   CVTOPTA
CVTSNCTR EQU   CVTMAP+180
CVTQMWR  EQU   CVTMAP+176
CVTQOCR  EQU   CVTMAP+172
CVT1EF00 EQU   CVTMAP+168
CVTMZ00  EQU   CVTMAP+164
CVTHEAD  EQU   CVTMAP+160
CVTRSV11 EQU   CVTMAP+156
CVT0PT01 EQU   CVTMAP+152
CVTMSER  EQU   CVTMAP+148
CVTRV516 EQU   CVTIERLC
CVTILCH  EQU   CVTMAP+140
CVT0DS   EQU   CVTMAP+136
CVTFBOSV EQU   CVTMAP+132
CVTNUCB  EQU   CVTMAP+128
CVTIXAVL EQU   CVTMAP+124
CVTIOQET EQU   CVTMAP+120
CVTDCBA  EQU   CVTMAP+117
CVTMVS2  EQU   CVTDCB
CVT6DAT  EQU   CVTDCB
CVT4MPS  EQU   CVTDCB
CVTRSV09 EQU   CVTDCB
CVT4MS1  EQU   CVTDCB
CVT2SPS  EQU   CVTDCB
CVT1SSS  EQU   CVTDCB
CVTRSV08 EQU   CVTDCB
CVTSTB   EQU   CVTMAP+112
CVTQTD00 EQU   CVTMAP+108
CVTQTE00 EQU   CVTMAP+104
CVTCUCB  EQU   CVTMAP+100
CVTSJQ   EQU   CVTMAP+96
CVTPBLDL EQU   CVTMAP+92
CVTTPC   EQU   CVTMAP+88
CVTSVDCB EQU   CVTMAP+84
CVTBRET  EQU   CVTMAP+82
CVTEXIT  EQU   CVTMAP+80
CVT0FN00 EQU   CVTMAP+76
CVTDARA  EQU   CVTDAR+1
CVTRSV07 EQU   CVTFLGS1
CVTRSV06 EQU   CVTFLGS1
CVTRSV05 EQU   CVTFLGS1
CVTRSV04 EQU   CVTFLGS1
CVTRSV03 EQU   CVTFLGS1
CVTRSV02 EQU   CVTFLGS1
CVTRSV01 EQU   CVTFLGS1
CVTDMPLK EQU   CVTFLGS1
CVTXITP  EQU   CVTMAP+68
CVTZDTAB EQU   CVTMAP+64
CVTMSLT  EQU   CVTMAP+60
CVTDATE  EQU   CVTMAP+56
CVTBTERM EQU   CVTMAP+52
CVTSYSAD EQU   CVTMAP+48
CVTXTLER EQU   CVTMAP+44
CVTILK2  EQU   CVTMAP+40
CVTILK1  EQU   CVTMAP+36
CVTPRLTV EQU   CVTMAP+32
CVTPCNVT EQU   CVTMAP+28
CVT0VL00 EQU   CVTMAP+24
CVTXAPG  EQU   CVTMAP+20
CVTBUF   EQU   CVTMAP+16
CVTJOB   EQU   CVTMAP+12
CVTLINK  EQU   CVTMAP+8
CVT0EF00 EQU   CVTMAP+4
CVTTCBP  EQU   CVTMAP
CVT      EQU   CVTMAP
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS
@RT00666 EQU   EXIT
CCLRET#  EQU   @RC00751
CCLFORC# EQU   @RC00759
@RC00793 EQU   @RC00792
@RC00798 EQU   @RC00792
CCLRN#   EQU   @RC00802
@RC00818 EQU   @RC00817
@RC00812 EQU   @RC00790
@RC00840 EQU   @RC00790
@RC00847 EQU   @RC00790
CCLCLUS@ EQU   @PB00002
@RC01072 EQU   @RC01070
@RC01153 EQU   @RC01126
@RC01164 EQU   @RC01162
CCLRET2# EQU   @RC01162
@RC01186 EQU   @RC01184
@RT01192 EQU   @RC01184
@RC01289 EQU   @RC01286
@RC01306 EQU   @RC01297
@RC01299 EQU   @RC01297
@RC01322 EQU   @RC01321
@RC01427 EQU   @RC01425
@RT01446 EQU   @RC01425
@RC01794 EQU   @RC01792
@PB00015 EQU   @PB00016
@RC02053 EQU   @RC02051
CCLCNFS@ EQU   @PB00017
@RF02131 EQU   @RC02129
@RF02281 EQU   @RC02278
CCLFORC@ EQU   @PB00018
@RC02315 EQU   @RC02309
@RT02349 EQU   ISTA0186
@RC02367 EQU   @RC02366
@RC00814 EQU   @RC00812
@RF01076 EQU   @RC01072
@RC01084 EQU   @RC01072
@RF01083 EQU   @RC01072
CCLRET1# EQU   @RC01164
@RC01300 EQU   @RC01299
@RC01435 EQU   @RC01427
@PB00014 EQU   @PB00015
@PB00013 EQU   @PB00014
@PB00012 EQU   @PB00013
@PB00011 EQU   @PB00012
@PB00010 EQU   @PB00011
@PB00009 EQU   @PB00010
@PB00008 EQU   @PB00009
@PB00007 EQU   @PB00008
@PB00006 EQU   @PB00007
@PB00005 EQU   @PB00006
@PB00004 EQU   @PB00005
@PB00003 EQU   @PB00004
CCLRET2@ EQU   @PB00003
@ENDDATA EQU   *
         END   ISTINCCL,(C'PLS2155',0603,78152)
