         TITLE 'ISTINCDP - 370X LOAD/DUMP/ERP SUBTASK CONTROL          *
                        '
ISTINCDP CSECT ,                                                   0001
@MAINENT DS    0H                                                  0001
         USING *,@15                                               0001
         B     @PROLOG                                             0001
         DC    AL1(16)                                             0001
         DC    C'ISTINCDP  75.230'                                 0001
         DROP  @15
@PROLOG  STM   @14,@12,12(@13)                                     0001
         BALR  @12,0                                               0001
@PSTART  DS    0H                                                  0001
         USING @PSTART,@12                                         0001
         ST    @13,@SA00001+4                                      0001
         LA    @14,@SA00001                                        0001
         ST    @14,8(,@13)                                         0001
         LR    @13,@14                                             0001
*                                                                  0227
*/*------------------------------------------------------------------*/
*/* THIS IS MAIN PROCESSOR, IT WAITS FOR ECB. IF THE ECB IS POSTED,  */
*/* IT DEQUEUES ALL OF THE WAITING CONTROL BLOCKS AND DROPS INTO A   */
*/* LOOP THAT ROUTES THE CONTROL BLOCKS (NCSPL OR DLRPL) TO THE      */
*/* PROPER PROCESSING MODULE.                                        */
*/*------------------------------------------------------------------*/
*                                                                  0228
*                                                                  0228
* DO; /* LISATCVT CVTBASE(FIXED,(AVTPTR)) */                       0228
*                                                                  0228
* RFY (EMCR15) RSTD;                                               0229
*   GEN SETS (EMCR15)                                              0230
*        (L     EMCR15,X'10' POINT TO CVT);                        0230
         L     EMCR15,X'10' POINT TO CVT
*   AVTPTR = EMCR15->CVTEXT2->CVTATCVT; /*SET UP AVT POINTER*/     0231
*                                                                  0231
         L     @14,CVTEXT2(,EMCR15)                                0231
         L     @14,CVTATCVT(,@14)                                  0231
         ST    @14,AVTPTR                                          0231
* RFY (EMCR15) UNRSTD;                                             0232
* END; /*LISATCVT*/                                                0233
*ATCVTPTR = ISTACVT;                 /* SET BASE FOR ATCVT */      0234
         L     ATCVTPTR,ISTACVT(,@14)                              0234
*DO UNTIL(ATCNCSD = ON);             /* DO UNTIL N.C.S. IS QUIESCED */
@DL00235 DS    0H                                                  0236
*/*VWAIT  ECB(ATCLDECB)TASK(VTAM)*/                                0236
*   DO;                                                            0236
*                                                                  0236
*   DCL GPR01F FIXED(31) REG(01);                                  0237
*   DCL GPR01P PTR(31)   REG(01);        /*DECLARE AND RESTRICT REG 1*/
*     RESPECIFY GPR01F RSTD;             /*INVOKE XREGSET MACRO TO*/
*                                        /*TEST ECB PARM VALIDITY */
*                                                                  0240
*/*XREGSET  PPARM(ATCLDECB)RREG(1,GPR01F)PID('ECB')*/              0240
*   DO;                                                            0240
*     GPR01F=ADDR(ATCLDECB);             /*SET RREG SYMBOL TO ADDRESS*/
         LA    GPR01F,ATCLDECB(,ATCVTPTR)                          0241
*                                        /*OF PPARM OPERAND          */
*   END;  /* XREGSET */                                            0242
*     GEN;                                                         0243
         WAIT 1,ECB=(1)
*     RESPECIFY GPR01F UNRSTD;           /*UNRESTRICT REG 1          */
*   END;  /* VWAIT */                                              0245
*                                                                  0245
*/* DOINF  */                                                      0246
*                                                                  0246
*   DO  UNTIL(1=2);                           /* DEQUE ALL NCSPL */
@DL00246 DS    0H                                                  0247
*    ATCLDECB = 0;                    /* CLEAR ECB */              0247
         SLR   @11,@11                                             0247
         ST    @11,ATCLDECB(,ATCVTPTR)                             0247
*    GEN REFS(CDPSAVE) (STM 0,15,CDPSAVE);                         0248
*                                                                  0248
         STM 0,15,CDPSAVE
*/* TPDEQ (,ATCLDNCS) RETPTR(CDPRCREG)NSTR */                      0249
*     DO; /* BEGIN TPDEQ CODE GENERATION */                        0249
*     DCL FMZCA014 BIT(32) CONSTANT('80000000'X);                  0250
*     DCL FMZCB014 BIT(32) CONSTANT('7FFFFFFF'X);                  0251
*     DCL GPR00F FIXED(31) REG(00);                                0252
*     DCL GPR00P PTR(31)   REG(00);                                0253
*     DCL GPR14F FIXED(31) REG(14);                                0254
*     DCL GPR14P PTR(31)   REG(14);                                0255
*     DCL GPR15F FIXED(31) REG(15);                                0256
*     DCL GPR15P PTR(31)   REG(15);                                0257
*     RFY (GPR00P,GPR01P,GPR14P,GPR15P) RSTD;                      0258
*                                                                  0258
*     RFY ISTWKE  ;                                                0259
*     GPR15P=ADDR(ATCLDNCS); /*ADDRESS QUEUE POINTER */            0260
         LA    GPR15P,ATCLDNCS(,ATCVTPTR)                          0260
*     GPR14P=GPR15P->PABWEQA×FMZCA014;                             0261
         L     @11,@CF00732                                        0261
         L     GPR14P,PABWEQA(,GPR15P)                             0261
         OR    GPR14P,@11                                          0261
*     IF GPR14P=FMZCA014 THEN;                                     0262
         CLR   GPR14P,@11                                          0262
         BE    @RT00262                                            0262
*     ELSE DO;                                                     0264
*FMZL1014:;                                                        0265
FMZL1014 DS    0H                                                  0266
*       DO WHILE(GPR14P->WKECHAIN^=FMZCA014);                      0266
         B     @DE00266                                            0266
@DL00266 DS    0H                                                  0267
*         GPR15P=ADDR(GPR14P->WKECHAIN);                           0267
         LA    GPR15P,WKECHAIN(,GPR14P)                            0267
*         GPR14P=GPR15P->PABWEQA;                                  0268
         L     GPR14P,PABWEQA(,GPR15P)                             0268
*       END;                                                       0269
@DE00266 L     @11,@CF00732                                        0269
         CL    @11,WKECHAIN(,GPR14P)                               0269
         BNE   @DL00266                                            0269
*       GPR00P=FMZCA014;                                           0270
         LR    GPR00P,@11                                          0270
*       CS(GPR14P,GPR00P,GPR15P->PABWEQA);                         0271
         CS    GPR14P,@00,PABWEQA(GPR15P)                          0271
*       BC(7,FMZL1014);                                            0272
         BC    7,FMZL1014                                          0272
*       GPR14P->WKECHAIN=0;                                        0273
         SLR   @11,@11                                             0273
         ST    @11,WKECHAIN(,GPR14P)                               0273
*     END;                                                         0274
*ISTA0014:;                                                        0275
@RT00262 DS    0H                                                  0275
ISTA0014 DS    0H                                                  0276
*     GPR14P=GPR14P&FMZCB014;                                      0276
         N     GPR14P,@CF00730                                     0276
*     CDPRCREG=GPR14P;                                             0277
         LR    CDPRCREG,GPR14P                                     0277
*     RFY (GPR00P,GPR01P,GPR14P,GPR15P) UNRSTD;                    0278
*     END; /* END TPDEQ GENERATION */   /* DEQUE A NCSPL */        0279
*    GEN REFS(CDPSAV2) (LM 2,8,CDPSAV2);                           0280
*                                                                  0280
         LM 2,8,CDPSAV2
*/*   LEAVE ON(CDPRCREG=0) */                                      0281
*     IF (CDPRCREG=0) THEN                                         0281
         LTR   CDPRCREG,CDPRCREG                                   0281
         BZ    @RT00281                                            0281
*       GOTO #DC00013;    /* EXIT LOOP IF QUEUE IS EMPTY */        0282
*    IF CDPRCREG->DLRPLIDF=DLRPLBID /*IF CB A DLRPL          @X50BHKG*/
*     THEN                          /*                       @X50BHKG*/
         CLI   DLRPLIDF(CDPRCREG),80                               0283
         BNE   @RF00283                                            0283
*       IF CDPRCREG->DLRPLFCD=DLRPLCPM /* IF CPMSG           @X50BHYJ*/
*         THEN                      /*                       @X50BHYJ*/
*                                                                  0284
         CLI   DLRPLFCD(CDPRCREG),189                              0284
         BNE   @RF00284                                            0284
*GEN(ATTACH EP=ISTINCOQ,SF=(E,CMZINCDP));      /*            YES   0285
*@X50BHYJ*/                                                        0285
         ATTACH EP=ISTINCOQ,SF=(E,CMZINCDP)
*         ELSE                      /*                       @X50BHYJ*/
*           CALL ISTINCR6;          /*            NO         @X50BHYJ*/
         B     @RC00284                                            0286
@RF00284 L     @15,@CV01803                                        0286
         BALR  @14,@15                                             0286
*     ELSE                          /*                       @X50BHKG*/
*      DO;                          /*DO NCSPL               @X50BHKG*/
         B     @RC00283                                            0287
@RF00283 DS    0H                                                  0288
*        NCSPLPTR = CDPRCREG;         /* GET DEQUED NCSPL ADDR */  0288
         LR    NCSPLPTR,CDPRCREG                                   0288
*        IF NCSPLCMD = NCSCRVIO       /*IF VSAM I/O          @X50BHKG*/
*         THEN                        /*                     @X50BHKG*/
         CLC   NCSPLCMD(2,NCSPLPTR),@CB01425                       0289
         BNE   @RF00289                                            0289
*          CALL ISTINCR4;             /*                     @XM9198K*/
         L     @15,@CV01804                                        0290
         BALR  @14,@15                                             0290
*         ELSE                        /*                     @X50BHKG*/
*          IF NCSPLCMD=NCSDABDN       /*                     @D32CKKG*/
*           THEN CALL ISTINCY0;                            /*@XM19498*/
         B     @RC00289                                            0291
@RF00289 CLC   NCSPLCMD(2,NCSPLPTR),@CB01678                       0291
         BNE   @RF00291                                            0291
         L     @15,@CV01805                                        0292
         BALR  @14,@15                                             0292
*           ELSE IF ISTAHIP = ON     /* IS HALT IN PROCESS         */
*           THEN DO;                 /* YES, DO FOLLOWING:   @D32CKKG*/
         B     @RC00291                                            0293
@RF00291 L     @11,AVTPTR                                          0293
         TM    ISTAHIP(@11),B'10000000'                            0293
         BNO   @RF00293                                            0293
*            NCSIORC = NCSHALTD;     /* SET RETURN CODE IN NCSP */ 0295
         MVI   NCSIORC(NCSPLPTR),X'18'                             0295
*            CDPR1 = NCSPLRPH;       /* GET RPH ADDR. FOR TPPOST */
         L     CDPR1,NCSPLRPH(,NCSPLPTR)                           0296
*            GEN REFS(CDPSAVE) (STM 0,15,CDPSAVE);                 0297
         STM 0,15,CDPSAVE
*/*TPPOST    NSTR*/                                                0298
*             DO;                                                  0298
*                                                                  0298
*             DCL GPR02F FIXED(31) REG(02);                        0299
*             DCL GPR02P PTR(31)   REG(02);                        0300
*             DCL GPR03F FIXED(31) REG(03);                        0301
*             DCL GPR03P PTR(31)   REG(03);                        0302
*             DCL GPR04F FIXED(31) REG(04);                        0303
*             DCL GPR04P PTR(31)   REG(04);                        0304
*             DCL GPR05F FIXED(31) REG(05);                        0305
*             DCL GPR05P PTR(31)   REG(05);                        0306
*             DCL GPR06F FIXED(31) REG(06);                        0307
*             DCL GPR06P PTR(31)   REG(06);                        0308
*                                       /*DECLARE AND RESTRICT REGS*/
*               RESPECIFY (GPR00F,GPR01F,GPR04F,GPR05F,            0309
*                         GPR06F,GPR14F,GPR15F) RSTD;              0309
*                                       /*0,1,4,5,6,14, AND 15   */
*                                                                  0310
*/* ATBUILD (ISTPAB,ISTDYPAB,ISTRPH,ISTAVT,ISTATCVT)  */           0310
*/* END OF ATBUILD */                                              0310
*               GPR04F=GPR01F;          /*LOAD RPH PNTR INTO REG 4*/
         LR    GPR04F,GPR01F                                       0310
*               RFY GPR03F RSTD;                                   0311
*               GPR03F=0;                                          0312
*                                                                  0312
         SLR   @11,@11                                             0312
         LR    GPR03F,@11                                          0312
*             DO; /*MODESET  SAVEKEY(GPR06F) KEYADDR(GPR03F) WORKREG(GP
*05F)*/         RESPECIFY (GPR02F) RESTRICTED;                     0313
*               GPR05F = GPR02F; /*SAVE REGISTER 2*/               0315
         LR    GPR05F,GPR02F                                       0315
*               IPK; /*SAVE CURRENT PSW KEY*/                      0316
         IPK                                                       0316
*               GPR06F = GPR02F;                                   0317
         LR    GPR06F,GPR02F                                       0317
*               GPR02F = GPR05F; /*RESTORE REGISTER 2*/            0318
         LR    GPR02F,GPR05F                                       0318
*               SPKA (GPR03F); /*SET PSW KEY*/                     0319
         SPKA  0(GPR03F)                                           0319
*               RESPECIFY (GPR02F) UNRESTRICTED;                   0320
*             END; /*MODESET  SAVEKEY(GPR06F) KEYADDR(GPR03F) WORKREG(G
*R05F)*/        RFY GPR03F UNRSTD;                                 0321
*               GPR05P=GPR04P->RPHMAJCB+GPR04P->RPHPABOF;          0323
         L     GPR05P,RPHMAJCB-1(,GPR04P)                          0323
         LA    GPR05P,0(,GPR05P)                                   0323
         SLR   @08,@08                                             0323
         IC    @08,RPHPABOF(,GPR04P)                               0323
         ALR   GPR05P,@08                                          0323
*                                       /*LOAD REG 5  WITH ADDR OF*/
*                                       /*MAJOR CONTROL BLOCK PLUS*/
*                                       /*OFFSET OF PAB IN BLOCK  */
*               GPR14P=0;               /*LOAD 0 INTO REG 14      */
         LR    GPR14P,@11                                          0324
*               GPR15P='FFFFFFFF'X;     /*LOAD REG 15 WITH DUMMY  */
         SLR   GPR15P,GPR15P                                       0325
         BCTR  GPR15P,0                                            0325
*                                       /*ADDRESS                 */
*               CS (GPR14P,GPR15P,GPR04P->RPHRESMA);               0326
         CS    GPR14P,@15,RPHRESMA(GPR04P)                         0326
*                                       /*COMPARE RESUME ADDRESS  */
*                                       /*WITH 0 AND,IF EQUAL, PUT*/
*                                       /*DUMMY ADDRESS IN CONTROL*/
*                                       /*BLOCK RESUME ADDRESS    */
*               BC (8,FMZT0020);        /*IF EQUAL, BYPASS REMAINDER*/
         BC    8,FMZT0020                                          0327
*                                       /*OF EXPANSION              */
*FMZL0020:      IF GPR04P->RPHWT='1'B THEN                         0328
FMZL0020 TM    RPHWT(GPR04P),B'00001000'                           0328
         BNO   @RF00328                                            0328
*                                       /*WT/EXT CONTENTION FLAG ON */
*               DO;                     /*IN RPH                    */
*                 GPR14P=GPR04P->RPHRESMA×RPHWT1;                  0330
         L     GPR14P,RPHRESMA(,GPR04P)                            0330
         O     GPR14P,@CF00756                                     0330
*                                       /*LOAD REG 14 WITH FLAG FIELD*/
*                                       /*AND MAKE CERTAIN WT/EXT    */
*                                       /*CONTENTION FLAG STILL ON   */
*                 GPR15P=GPR14P×RPHPT1; /*LOAD REG 15 WITH FLAG FIELD*/
         LR    GPR15P,GPR14P                                       0331
         O     GPR15P,@CF00746                                     0331
*                                       /*AND TURN POST FLAG ON      */
*                 CS (GPR14P,GPR15P,GPR04P->RPHRESMA);             0332
         CS    GPR14P,@15,RPHRESMA(GPR04P)                         0332
*                                       /*COMPARE REG 14 WITH FLAG */
*                                       /*FIELD--IF WT/EXT BIT ON, */
*                                       /*TURN ON POST FLAG        */
*                 BC (4,FMZL0020);      /*IF WT/EXT BIT WAS OFF, LOOP*/
         BC    4,FMZL0020                                          0333
*                                       /*TO TEST CONTENTION FLAG    */
*                 BC (8,FMZT0020);      /*IF WT/EXT BIT WAS OFF,     */
         BC    8,FMZT0020                                          0334
*                                       /*BRANCH TO BYPASS CODE GEN  */
*               END;                    /*IF POST FLAG IS ON, FALL*/
*                                       /*THRU BOTTOM OF LOOP     */
*               ELSE;                   /*WT/EXT CONTENTION FLAG OFF*/
@RF00328 DS    0H                                                  0337
*               GPR00F=0;               /*SET REG 0 TO INDICATE ENA*/
*                                                                  0337
         SLR   GPR00F,GPR00F                                       0337
*             DO; /* LISATCVT CVTBASE(PAGEABLE,(GPR15P)) */        0338
*               GPR15P = ATCLCPTR; /*SET UP ATCVT POINTER*/        0339
         L     GPR15P,ATCLCPTR                                     0339
*             END; /*LISATCVT*/         /*PUT POINTER TO ATCVT IN */
*                                       /*  IN REG 15             */
*               CALL GPR15P->ATCAP32;   /* CALL ISTAPC32: TPSCHED */
         L     @11,ATCAP32(,GPR15P)                                0341
         LR    @15,@11                                             0341
         BALR  @14,@15                                             0341
*FMZT0020:                                                         0342
*             DO; /*MODESET  KEYADDR(GPR06F) WORKREG(GPR05F)*/     0342
FMZT0020 DS    0H                                                  0343
*               GPR05F = GPR06F; /*GET KEY FORM SAVE LOCATION*/    0343
         LR    GPR05F,GPR06F                                       0343
*               SPKA (GPR05F); /*SET PSW KEY*/                     0344
         SPKA  0(GPR05F)                                           0344
*             END; /*MODESET  KEYADDR(GPR06F) WORKREG(GPR05F)*/    0345
*               RESPECIFY (GPR00F,GPR01F,GPR04F,GPR05F,GPR06F,     0346
*               GPR14F,GPR15F) UNRSTD;  /*UNRESTRICT REGS 0,1,    */
*                                       /*4,5,14, AND 15          */
*             END;  /****END OF TPPOST GENERATION****/           /* TP
* POST */                                                          0347
*            GEN REFS(CDPSAV2) (LM 2,8,CDPSAV2);                   0348
         LM 2,8,CDPSAV2
*           END;                                          /*@D32CKKG*/
*                                                                  0349
*/*------------------------------------------------------------------*/
*/* THIS SECTION DETERMINES IF IT IS ERP, LOAD, DUMP, OR A DIAL      */
*/* COMMAND TO BE                                            @D32CKGH*/
*/* PERFORMED AND PASSES CONTROL TO ISTINCRP, ISTINC05,      @D32CKGH*/
*/* ISTINCXI, OR ISTINCY0 ACCORDINGLY                        @D32CKGH*/
*/*------------------------------------------------------------------*/
*                                                                  0350
*         ELSE                                                     0350
*IF NCSPLVCD = NCSPLVC3              /* ERP ? */                   0350
*  THEN                                                            0350
         B     @RC00293                                            0350
@RF00293 CLI   NCSPLVCD(NCSPLPTR),X'03'                            0350
         BNE   @RF00350                                            0350
*GEN(ATTACH EP=ISTINCRP,SF=(E,CMZINCDP));           /* YES, INVOKE ISTI
*CRP */                                                            0351
         ATTACH EP=ISTINCRP,SF=(E,CMZINCDP)
*  ELSE                              /* NOT ERP, DO FOLLOWS */     0352
*    IF NCSPLCMD=NCSCLCND ×          /* CONDITIONAL LOAD OR */     0352
*       NCSPLCMD=NCSCUCND            /* UNCONDITIONAL LOAD ? */    0352
*      THEN                                                        0352
         B     @RC00350                                            0352
@RF00350 CLC   NCSPLCMD(2,NCSPLPTR),@CB01664                       0352
         BE    @RT00352                                            0352
         CLC   NCSPLCMD(2,NCSPLPTR),@CB01666                       0352
         BNE   @RF00352                                            0352
@RT00352 DS    0H                                                  0353
*GEN(ATTACH EP=ISTINC05,SF=(E,CMZINCDP));       /* YES, LOAD ISTINC05 *
         ATTACH EP=ISTINC05,SF=(E,CMZINCDP)
*      ELSE                          /* SEE IF DUMP */             0354
*        IF NCSPLCMD=NCSDUCMD                                      0354
*          THEN                                                    0354
         B     @RC00352                                            0354
@RF00352 CLC   NCSPLCMD(2,NCSPLPTR),@CB01670                       0354
         BNE   @RF00354                                            0354
*GEN(ATTACH EP=ISTINCXI,SF=(E,CMZINCDP));   /* YES, IT IS DUMP */  0355
         ATTACH EP=ISTINCXI,SF=(E,CMZINCDP)
*          ELSE                                                    0356
*            IF NCSPLCMD=NCSDOUT            /* DIAL OUT      @D32CKGH*/
*             × NCSPLCMD=NCSDCNT            /* DIAL CONTACT  @D32CKGH*/
*             × NCSPLCMD=NCSDENAS      /* DIAL ENABLE ANSWER @D32CKKG*/
*          THEN CALL ISTINCY0;              /* YES           @XM19498*/
         B     @RC00354                                            0356
@RF00354 CLC   NCSPLCMD(2,NCSPLPTR),@CB01674                       0356
         BE    @RT00356                                            0356
         CLC   NCSPLCMD(2,NCSPLPTR),@CB01676                       0356
         BE    @RT00356                                            0356
         CLC   NCSPLCMD(2,NCSPLPTR),@CB01680                       0356
         BNE   @RF00356                                            0356
@RT00356 DS    0H                                                  0357
         L     @15,@CV01805                                        0357
         BALR  @14,@15                                             0357
*          ELSE DO;                  /* ERROR CONDITION */         0358
         B     @RC00356                                            0358
@RF00356 DS    0H                                                  0359
*            NCSIORC=NCSUNREC;       /* SET UP ERROR CODE IN NCSPL */
         MVI   NCSIORC(NCSPLPTR),X'1C'                             0359
*            CDPR1 = NCSPLRPH;       /* GET RPH ADDR FOR TPOST */  0360
         L     CDPR1,NCSPLRPH(,NCSPLPTR)                           0360
*            GEN REFS(CDPSAVE) (STM 0,15,CDPSAVE);                 0361
*                                                                  0361
         STM 0,15,CDPSAVE
*/*TPPOST    NSTR*/                                                0362
*             DO;                                                  0362
*                                       /*DECLARE AND RESTRICT REGS*/
*               RESPECIFY (GPR00F,GPR01F,GPR04F,GPR05F,            0363
*                         GPR06F,GPR14F,GPR15F) RSTD;              0363
*                                       /*0,1,4,5,6,14, AND 15   */
*                                                                  0364
*/* ATBUILD (ISTPAB,ISTDYPAB,ISTRPH,ISTAVT,ISTATCVT)  */           0364
*/* END OF ATBUILD */                                              0364
*               GPR04F=GPR01F;          /*LOAD RPH PNTR INTO REG 4*/
         LR    GPR04F,GPR01F                                       0364
*               RFY GPR03F RSTD;                                   0365
*               GPR03F=0;                                          0366
*                                                                  0366
         SLR   @11,@11                                             0366
         LR    GPR03F,@11                                          0366
*             DO; /*MODESET  SAVEKEY(GPR06F) KEYADDR(GPR03F) WORKREG(GP
*05F)*/         RESPECIFY (GPR02F) RESTRICTED;                     0367
*               GPR05F = GPR02F; /*SAVE REGISTER 2*/               0369
         LR    GPR05F,GPR02F                                       0369
*               IPK; /*SAVE CURRENT PSW KEY*/                      0370
         IPK                                                       0370
*               GPR06F = GPR02F;                                   0371
         LR    GPR06F,GPR02F                                       0371
*               GPR02F = GPR05F; /*RESTORE REGISTER 2*/            0372
         LR    GPR02F,GPR05F                                       0372
*               SPKA (GPR03F); /*SET PSW KEY*/                     0373
         SPKA  0(GPR03F)                                           0373
*               RESPECIFY (GPR02F) UNRESTRICTED;                   0374
*             END; /*MODESET  SAVEKEY(GPR06F) KEYADDR(GPR03F) WORKREG(G
*R05F)*/        RFY GPR03F UNRSTD;                                 0375
*               GPR05P=GPR04P->RPHMAJCB+GPR04P->RPHPABOF;          0377
         L     GPR05P,RPHMAJCB-1(,GPR04P)                          0377
         LA    GPR05P,0(,GPR05P)                                   0377
         SLR   @08,@08                                             0377
         IC    @08,RPHPABOF(,GPR04P)                               0377
         ALR   GPR05P,@08                                          0377
*                                       /*LOAD REG 5  WITH ADDR OF*/
*                                       /*MAJOR CONTROL BLOCK PLUS*/
*                                       /*OFFSET OF PAB IN BLOCK  */
*               GPR14P=0;               /*LOAD 0 INTO REG 14      */
         LR    GPR14P,@11                                          0378
*               GPR15P='FFFFFFFF'X;     /*LOAD REG 15 WITH DUMMY  */
         SLR   GPR15P,GPR15P                                       0379
         BCTR  GPR15P,0                                            0379
*                                       /*ADDRESS                 */
*               CS (GPR14P,GPR15P,GPR04P->RPHRESMA);               0380
         CS    GPR14P,@15,RPHRESMA(GPR04P)                         0380
*                                       /*COMPARE RESUME ADDRESS  */
*                                       /*WITH 0 AND,IF EQUAL, PUT*/
*                                       /*DUMMY ADDRESS IN CONTROL*/
*                                       /*BLOCK RESUME ADDRESS    */
*               BC (8,FMZT0035);        /*IF EQUAL, BYPASS REMAINDER*/
         BC    8,FMZT0035                                          0381
*                                       /*OF EXPANSION              */
*FMZL0035:      IF GPR04P->RPHWT='1'B THEN                         0382
FMZL0035 TM    RPHWT(GPR04P),B'00001000'                           0382
         BNO   @RF00382                                            0382
*                                       /*WT/EXT CONTENTION FLAG ON */
*               DO;                     /*IN RPH                    */
*                 GPR14P=GPR04P->RPHRESMA×RPHWT1;                  0384
         L     GPR14P,RPHRESMA(,GPR04P)                            0384
         O     GPR14P,@CF00756                                     0384
*                                       /*LOAD REG 14 WITH FLAG FIELD*/
*                                       /*AND MAKE CERTAIN WT/EXT    */
*                                       /*CONTENTION FLAG STILL ON   */
*                 GPR15P=GPR14P×RPHPT1; /*LOAD REG 15 WITH FLAG FIELD*/
         LR    GPR15P,GPR14P                                       0385
         O     GPR15P,@CF00746                                     0385
*                                       /*AND TURN POST FLAG ON      */
*                 CS (GPR14P,GPR15P,GPR04P->RPHRESMA);             0386
         CS    GPR14P,@15,RPHRESMA(GPR04P)                         0386
*                                       /*COMPARE REG 14 WITH FLAG */
*                                       /*FIELD--IF WT/EXT BIT ON, */
*                                       /*TURN ON POST FLAG        */
*                 BC (4,FMZL0035);      /*IF WT/EXT BIT WAS OFF, LOOP*/
         BC    4,FMZL0035                                          0387
*                                       /*TO TEST CONTENTION FLAG    */
*                 BC (8,FMZT0035);      /*IF WT/EXT BIT WAS OFF,     */
         BC    8,FMZT0035                                          0388
*                                       /*BRANCH TO BYPASS CODE GEN  */
*               END;                    /*IF POST FLAG IS ON, FALL*/
*                                       /*THRU BOTTOM OF LOOP     */
*               ELSE;                   /*WT/EXT CONTENTION FLAG OFF*/
@RF00382 DS    0H                                                  0391
*               GPR00F=0;               /*SET REG 0 TO INDICATE ENA*/
*                                                                  0391
         SLR   GPR00F,GPR00F                                       0391
*             DO; /* LISATCVT CVTBASE(PAGEABLE,(GPR15P)) */        0392
*               GPR15P = ATCLCPTR; /*SET UP ATCVT POINTER*/        0393
         L     GPR15P,ATCLCPTR                                     0393
*             END; /*LISATCVT*/         /*PUT POINTER TO ATCVT IN */
*                                       /*  IN REG 15             */
*               CALL GPR15P->ATCAP32;   /* CALL ISTAPC32: TPSCHED */
         L     @11,ATCAP32(,GPR15P)                                0395
         LR    @15,@11                                             0395
         BALR  @14,@15                                             0395
*FMZT0035:                                                         0396
*             DO; /*MODESET  KEYADDR(GPR06F) WORKREG(GPR05F)*/     0396
FMZT0035 DS    0H                                                  0397
*               GPR05F = GPR06F; /*GET KEY FORM SAVE LOCATION*/    0397
         LR    GPR05F,GPR06F                                       0397
*               SPKA (GPR05F); /*SET PSW KEY*/                     0398
         SPKA  0(GPR05F)                                           0398
*             END; /*MODESET  KEYADDR(GPR06F) WORKREG(GPR05F)*/    0399
*               RESPECIFY (GPR00F,GPR01F,GPR04F,GPR05F,GPR06F,     0400
*               GPR14F,GPR15F) UNRSTD;  /*UNRESTRICT REGS 0,1,    */
*                                       /*4,5,14, AND 15          */
*             END;  /****END OF TPPOST GENERATION****/           /* TPP
*ST */                                                             0401
*            GEN REFS(CDPSAV2) (LM 2,8,CDPSAV2);                   0402
         LM 2,8,CDPSAV2
*            END;                                                  0403
*      END;                           /*END PROCESS NCSPL    @X50BHKG*/
*                                                                  0404
@RC00356 DS    0H                                                  0404
@RC00354 DS    0H                                                  0404
@RC00352 DS    0H                                                  0404
@RC00350 DS    0H                                                  0404
@RC00293 DS    0H                                                  0404
@RC00291 DS    0H                                                  0404
@RC00289 DS    0H                                                  0405
*   END; /* END  */                                                0405
@RC00283 DS    0H                                                  0405
@DE00246 B     @DL00246                                            0405
*#DC00013:;                                                        0406
#DC00013 DS    0H                                                  0407
*END;                                                              0407
*                                                                  0407
@DE00235 TM    ATCNCSD(ATCVTPTR),B'00010000'                       0407
         BNO   @DL00235                                            0407
*/* TPEPILOG   */                                                  0408
* GEN (PRINT OFF);                                                 0408
*                                                                  0408
         PRINT OFF
*/* TEMPLATE FOR CHAIN FIELD OF WORK ELEMENT */                    0409
*DCL  1  ISTWKE BDY(WORD) BASED(WKEPTR),                           0409
*        2  * CHAR(4),                 /* SPACE                       *
*        2  WKECHAIN PTR(31),          /* CHAIN POINTER               *
*           3 WKEFLAGS BIT(8),         /* FLAGS                       *
*             4 WKEGATE  BIT(1),       /* GATE BIT                    *
*             4 *        BIT(7),       /* RESERVED                    *
*           3 WKECHNGP PTR(24);        /* PTR ADDRESS                 *
*                                                                  0410
* DECLARE                                                          0410
*   EMCR0 PTR REG(0),                                              0410
*   EMCR1 PTR REG(1),                                              0410
*   EMCR2 PTR REG(2),                                              0410
*   EMCR3 PTR REG(3),                                              0410
*   EMCR4 PTR REG(4),                                              0410
*   EMCR5 PTR REG(5),                                              0410
*   EMCR6 PTR REG(6),                                              0410
*   EMCR7 PTR REG(7),                                              0410
*   EMCR8 PTR REG(8),                                              0410
*   EMCR9 PTR REG(9),                                              0410
*   EMCR10 PTR REG(10),                                            0410
*   EMCR11 PTR REG(11),                                            0410
*   EMCR12 PTR REG(12),                                            0410
*   EMCR13 PTR REG(13),                                            0410
*   EMCR14 PTR REG(14),                                            0410
*   EMCR15 PTR REG(15);                                            0410
*                                                                  0410
*GEN DATA;                                                         0411
* GEN (PRINT ON);                                                  0412
         PRINT ON
*/* END OF TPEPILOG */                                             0413
*END ISTINCDP                                                      0413
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.      *
*/*%INCLUDE SYSLIB  (CVT     )                                        *
*;                                                                 0413
@EL00001 L     @13,4(,@13)                                         0413
@EF00001 DS    0H                                                  0413
@ER00001 LM    @14,@12,12(@13)                                     0413
         BR    @14                                                 0413
@DATA    DS    0H
         DS    0F
@SA00001 DS    18F
         DS    0F
@CF00730 DC    XL4'7FFFFFFF'
@CF00732 DC    XL4'80000000'
@CF00746 DC    XL4'04000000'
@CF00756 DC    XL4'08000000'
@CV01803 DC    V(ISTINCR6)
@CV01804 DC    V(ISTINCR4)
@CV01805 DC    V(ISTINCY0)
         DS    0D
CVTPTR   DS    A
AVTPTR   DS    A
WKEPTR   DS    A
@CB01425 DC    X'0C00'
@CB01664 DC    X'0041'
@CB01666 DC    X'0042'
@CB01670 DC    X'0044'
@CB01674 DC    X'0046'
@CB01676 DC    X'0047'
@CB01678 DC    X'0048'
@CB01680 DC    X'0049'
CDPSAVE  DS    CL64
         ORG   CDPSAVE
@NM00021 DS    CL8
CDPSAV2  DS    AL4
         ORG   CDPSAVE+64
ISTINCDP CSECT
CMZINCDP ATTACH SM=SUPV,SF=L
ISTINCDP CSECT
@00      EQU   00                      EQUATES FOR REGISTERS 0-15
@01      EQU   01
@02      EQU   02
@03      EQU   03
@04      EQU   04
@05      EQU   05
@06      EQU   06
@07      EQU   07
@08      EQU   08
@09      EQU   09
@10      EQU   10
@11      EQU   11
@12      EQU   12
@13      EQU   13
@14      EQU   14
@15      EQU   15
RPHPTR   EQU   @01
NCSPLPTR EQU   @09
ATCVTPTR EQU   @10
CDPRCREG EQU   @01
CDPR1    EQU   @01
EMCR15   EQU   @15
GPR01F   EQU   @01
GPR01P   EQU   @01
GPR00F   EQU   @00
GPR00P   EQU   @00
GPR14F   EQU   @14
GPR14P   EQU   @14
GPR15F   EQU   @15
GPR15P   EQU   @15
GPR02F   EQU   @02
GPR03F   EQU   @03
GPR04F   EQU   @04
GPR04P   EQU   @04
GPR05F   EQU   @05
GPR05P   EQU   @05
GPR06F   EQU   @06
EMCR0    EQU   @00
EMCR1    EQU   @01
EMCR10   EQU   @10
EMCR11   EQU   @11
EMCR12   EQU   @12
EMCR13   EQU   @13
EMCR14   EQU   @14
EMCR2    EQU   @02
EMCR3    EQU   @03
EMCR4    EQU   @04
EMCR5    EQU   @05
EMCR6    EQU   @06
EMCR7    EQU   @07
EMCR8    EQU   @08
EMCR9    EQU   @09
GPR02P   EQU   @02
GPR03P   EQU   @03
GPR06P   EQU   @06
ATCLCPTR EQU   1032
CVTMAP   EQU   0
CVTDAR   EQU   CVTMAP+72
CVTFLGS1 EQU   CVTDAR
CVTDCB   EQU   CVTMAP+116
CVTIERLC EQU   CVTMAP+144
CVTOPTA  EQU   CVTMAP+182
CVTOPTB  EQU   CVTMAP+183
CVTGTF   EQU   CVTMAP+236
CVTGTFST EQU   CVTGTF
CVTGTFS  EQU   CVTGTFST
CVTSTATE EQU   CVTGTFST
CVTTMODE EQU   CVTGTFST
CVTFORM  EQU   CVTGTFST
CVTAQAVT EQU   CVTMAP+240
CVTTCMFG EQU   CVTAQAVT
CVTVOLM2 EQU   CVTMAP+244
CVTTATA  EQU   CVTVOLM2
CVTTSKS  EQU   CVTTATA
CVTVOLF2 EQU   CVTTSKS
CVTTAT   EQU   CVTTATA+1
CVTATER  EQU   CVTMAP+248
CVTEXT1  EQU   CVTMAP+252
CVTPURG  EQU   CVTMAP+260
CVTQMSG  EQU   CVTMAP+268
CVTDMSR  EQU   CVTMAP+272
CVTERPV  EQU   CVTMAP+316
CVTINTLA EQU   CVTMAP+320
CVTAPF   EQU   CVTMAP+324
CVTEXT2  EQU   CVTMAP+328
CVTHJES  EQU   CVTMAP+332
CVTPGSIA EQU   CVTMAP+348
CVTA1F1  EQU   CVTMAP+356
CVTSYSK  EQU   CVTMAP+357
CVTVOLM1 EQU   CVTMAP+380
CVTVOLF1 EQU   CVTVOLM1
CVTATMCT EQU   CVTMAP+388
CVTXTNT1 EQU   0
CVTXTNT2 EQU   0
CVTDSSV  EQU   CVTXTNT2
CVTFLGBT EQU   CVTXTNT2+5
CVTQID   EQU   CVTXTNT2+24
CVTSHS   EQU   CVTXTNT2+40
CVTRV400 EQU   CVTXTNT2+52
CVTRV409 EQU   CVTXTNT2+53
CVTATCVT EQU   CVTXTNT2+64
CVTRV429 EQU   CVTXTNT2+84
CVTRV438 EQU   CVTXTNT2+85
CVTRV457 EQU   CVTXTNT2+112
CVTRV466 EQU   CVTXTNT2+113
CVTFIX   EQU   0
CVTRELNO EQU   CVTFIX+252
ISTAVT   EQU   0
ISTACVT  EQU   ISTAVT
ISTAS49  EQU   ISTAVT+4
ISTAHIP  EQU   ISTAS49
ISTPAB   EQU   0
PABWQCHN EQU   ISTPAB
PABWEQA  EQU   PABWQCHN
PABCHAIN EQU   PABWQCHN+4
PABRPHFG EQU   ISTPAB+12
PABFLAGS EQU   PABRPHFG
PABERLCK EQU   PABFLAGS
PABERRLK EQU   PABERLCK
ISTLOK   EQU   0
LOKCHN   EQU   ISTLOK+1
LOKCHNG  EQU   LOKCHN
@NM00004 EQU   LOKCHNG+2
ISTDYPAB EQU   0
ISTRPH   EQU   0
RPHCNTL  EQU   ISTRPH
RPHFLAGS EQU   RPHCNTL+2
RPHAPTYP EQU   RPHFLAGS
RPHFSTLC EQU   RPHFLAGS
RPHFLGB  EQU   RPHCNTL+3
RPHRPHA  EQU   ISTRPH+4
RPHTSKID EQU   ISTRPH+8
RPHRESMA EQU   ISTRPH+16
RPHWPFLG EQU   RPHRESMA
RPHWT    EQU   RPHWPFLG
RPHPABOF EQU   ISTRPH+20
RPHMAJCB EQU   ISTRPH+21
RPHWEA   EQU   ISTRPH+24
RPHCSPA  EQU   RPHWEA
RPHSRPRM EQU   ISTRPH+28
RPHPABQA EQU   ISTRPH+36
RPHWORK  EQU   ISTRPH+40
RPHSAVE1 EQU   RPHWORK
RPHSBITS EQU   RPHSAVE1+1
ISTATCVT EQU   0
ATCCOM   EQU   ISTATCVT
ATCSTAT  EQU   ATCCOM
ATCSTAT1 EQU   ATCSTAT
ATCSTFLG EQU   ATCSTAT+1
ATCPOFLG EQU   ATCSTAT+2
ATCSTAT4 EQU   ATCSTAT+3
ATCNCSD  EQU   ATCSTAT4
ATCIOTRC EQU   ATCCOM+140
ATCTHTRC EQU   ATCIOTRC
ATCCSMR  EQU   ISTATCVT+296
ATCSHRFG EQU   ISTATCVT+316
ATCHPGM  EQU   ISTATCVT+384
ATCLDNCS EQU   ISTATCVT+404
ATCLDECB EQU   ISTATCVT+408
ATCVLCNT EQU   ISTATCVT+772
ATCRNO   EQU   ISTATCVT+788
ATCSOPD  EQU   ISTATCVT+792
ATCSIPD  EQU   ISTATCVT+800
ATCSECST EQU   ISTATCVT+812
ATCAOSM  EQU   ISTATCVT+912
ATCGSRBQ EQU   ATCAOSM+4
ATCGSRBG EQU   ATCGSRBQ
ATCAP32  EQU   ATCAOSM+28
ATCICAPP EQU   ATCAOSM+100
ATCLDAPP EQU   ATCAOSM+120
ATCDAPVT EQU   ATCAOSM+140
ATCVTFLG EQU   ATCAOSM+392
ATCZFLAG EQU   ATCAOSM+588
ISTPOHD  EQU   0
POHSTAT  EQU   ISTPOHD+1
ISTPFX   EQU   0
PFXID    EQU   ISTPFX
ISTNCSPL EQU   0
@NM00014 EQU   ISTNCSPL
NCSPFX   EQU   @NM00014
NCSPLVCD EQU   ISTNCSPL+17
NCSPLVBF EQU   ISTNCSPL+18
NCSPLVFL EQU   ISTNCSPL+20
NCSPLVF1 EQU   ISTNCSPL+21
NCSIORC  EQU   ISTNCSPL+23
NCSPLCMD EQU   ISTNCSPL+60
NCSCMDA  EQU   NCSPLCMD
NCSCRFLG EQU   ISTNCSPL+67
NCSPLRAD EQU   ISTNCSPL+144
NCSIOCID EQU   ISTNCSPL+148
NCSPLCID EQU   NCSIOCID
NCSPLRPH EQU   ISTNCSPL+160
NCSPLFSB EQU   ISTNCSPL+168
NCSPLFL1 EQU   ISTNCSPL+176
NCSPLFL2 EQU   ISTNCSPL+177
NCSPLFL3 EQU   ISTNCSPL+178
NCSPLFL4 EQU   ISTNCSPL+179
NCSPLFL5 EQU   ISTNCSPL+181
NCSPLAPP EQU   ISTNCSPL+216
NCSSENSE EQU   ISTNCSPL+244
NCSCRMSK EQU   ISTNCSPL+268
NCSCHKPT EQU   NCSCRMSK
NCSCRMOD EQU   NCSCRMSK+2
NCSPLSID EQU   ISTNCSPL+271
NCSPLSTA EQU   NCSPLSID
NCSPLPHD EQU   NCSPLSID+1
NCSAPP   EQU   0
NCSAPBUE EQU   NCSAPP+88
NCSUSSRU EQU   0
ISTTPMPL EQU   0
ISTDLRPL EQU   0
DLRPLRSA EQU   ISTDLRPL
DLRPLIDF EQU   DLRPLRSA
DLRPLFCD EQU   DLRPLRSA+2
DLRPLIST EQU   ISTDLRPL+80
ISTWKE   EQU   0
WKECHAIN EQU   ISTWKE+4
WKEFLAGS EQU   WKECHAIN
CVTS01   EQU   CVTPGSIA
CVTLPDIA EQU   CVTS01+12
CVTDIRST EQU   CVTLPDIA
CVTSLIDA EQU   CVTS01+24
CVTCTLFG EQU   CVTS01+50
CVTRV210 EQU   CVTS01+424
CVTRV219 EQU   CVTS01+425
CVTRV228 EQU   CVTS01+426
CVTRV237 EQU   CVTS01+427
CVTMFRTR EQU   CVTS01+452
CVTRV262 EQU   CVTS01+468
CVTRV271 EQU   CVTS01+469
CVTRV280 EQU   CVTS01+470
CVTRV289 EQU   CVTS01+471
CVTGSDA  EQU   CVTS01+600
DLRPLCOQ EQU   DLRPLIST
DLRPLOPT EQU   DLRPLCOQ
DLRPLCR6 EQU   DLRPLIST
@NM00020 EQU   DLRPLCR6+8
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS
DLRPLTPL EQU   DLRPLCR6+44
DLRPLMSG EQU   DLRPLCR6+24
DLRPLSA2 EQU   DLRPLCR6+20
DLRPLSA1 EQU   DLRPLCR6+16
DLRPLMID EQU   DLRPLCR6+12
DLRPLSWS EQU   @NM00020+1
DLRPLFNC EQU   @NM00020
DLRPLNOD EQU   DLRPLCR6+4
DLRPLCON EQU   DLRPLCR6
DLRPLTPM EQU   DLRPLCOQ+4
DLRPLGYN EQU   DLRPLOPT
DLRPLFOL EQU   DLRPLOPT
CVTRV628 EQU   CVTS01+728
CVTRV627 EQU   CVTS01+724
CVTRV626 EQU   CVTS01+720
CVTRV625 EQU   CVTS01+716
CVTRV624 EQU   CVTS01+712
CVTRV623 EQU   CVTS01+708
CVTRV622 EQU   CVTS01+704
CVTRV621 EQU   CVTS01+700
CVTRV620 EQU   CVTS01+696
CVTRV619 EQU   CVTS01+692
CVTRV618 EQU   CVTS01+688
CVTRV617 EQU   CVTS01+684
CVTRV616 EQU   CVTS01+680
CVTRV615 EQU   CVTS01+676
CVTRV614 EQU   CVTS01+672
CVTRV613 EQU   CVTS01+668
CVTTCASP EQU   CVTS01+664
CVT0PT03 EQU   CVTS01+660
CVT0PT0E EQU   CVTS01+656
CVTIRM   EQU   CVTS01+652
CVTCGK   EQU   CVTS01+648
CVTRV607 EQU   CVTS01+644
CVTRV606 EQU   CVTS01+640
CVTRV605 EQU   CVTS01+636
CVTRV604 EQU   CVTS01+632
CVTEFF02 EQU   CVTS01+628
CVTCBBR  EQU   CVTS01+624
CVTSSCR  EQU   CVTS01+620
CVTEVENT EQU   CVTS01+616
CVTCRCA  EQU   CVTS01+612
CVTTPIO  EQU   CVTS01+608
CVTADV   EQU   CVTS01+604
CVTGSDAB EQU   CVTGSDA
CVTQV3   EQU   CVTS01+596
CVTQV2   EQU   CVTS01+592
CVTQV1   EQU   CVTS01+588
CVTRPT   EQU   CVTS01+584
CVTSSRB  EQU   CVTS01+580
CVTCSDRL EQU   CVTS01+576
CVTEXP1  EQU   CVTS01+572
CVTRMPMT EQU   CVTS01+568
CVTRMPTT EQU   CVTS01+564
CVTVPSA  EQU   CVTS01+560
CVTVSTOP EQU   CVTS01+556
CVTGTFR8 EQU   CVTS01+552
CVTQUIT  EQU   CVTS01+548
CVTVACR  EQU   CVTS01+544
CVTWTCB  EQU   CVTS01+540
CVTSTPRS EQU   CVTS01+536
CVT0PT02 EQU   CVTS01+532
CVTDARCM EQU   CVTS01+528
CVTIRECM EQU   CVTS01+524
CVTJRECM EQU   CVTS01+520
CVTVEMS0 EQU   CVTS01+516
CVTSPFRR EQU   CVTS01+512
CVTRLSTG EQU   CVTS01+508
CVT0TC0A EQU   CVTS01+504
CVTGMBR  EQU   CVTS01+500
CVTLFRM  EQU   CVTS01+496
CVTRMBR  EQU   CVTS01+492
CVTVIOP  EQU   CVTS01+488
CVTRV307 EQU   CVTS01+486
CVTRV306 EQU   CVTS01+484
CVTRV305 EQU   CVTS01+482
CVTRV304 EQU   CVTS01+480
CVTRV303 EQU   CVTS01+478
CVTRV302 EQU   CVTS01+476
CVTTRCA  EQU   CVTS01+472
CVTRV297 EQU   CVTRV289
CVTRV296 EQU   CVTRV289
CVTRV295 EQU   CVTRV289
CVTRV294 EQU   CVTRV289
CVTRV293 EQU   CVTRV289
CVTRV292 EQU   CVTRV289
CVTRV291 EQU   CVTRV289
CVTRV290 EQU   CVTRV289
CVTRV288 EQU   CVTRV280
CVTRV287 EQU   CVTRV280
CVTRV286 EQU   CVTRV280
CVTRV285 EQU   CVTRV280
CVTRV284 EQU   CVTRV280
CVTRV283 EQU   CVTRV280
CVTRV282 EQU   CVTRV280
CVTRV281 EQU   CVTRV280
CVTRV279 EQU   CVTRV271
CVTRV278 EQU   CVTRV271
CVTRV277 EQU   CVTRV271
CVTRV276 EQU   CVTRV271
CVTRV275 EQU   CVTRV271
CVTRV274 EQU   CVTRV271
CVTRV273 EQU   CVTRV271
CVTRV272 EQU   CVTRV271
CVTRV270 EQU   CVTRV262
CVTRV269 EQU   CVTRV262
CVTRV268 EQU   CVTRV262
CVTRV267 EQU   CVTRV262
CVTRV266 EQU   CVTRV262
CVTRV265 EQU   CVTRV262
CVTRV264 EQU   CVTRV262
CVTRV263 EQU   CVTRV262
CVTVFP   EQU   CVTS01+464
CVTVSI   EQU   CVTS01+460
CVTVPSIB EQU   CVTS01+456
CVTMFACT EQU   CVTMFRTR
CVTMFCTL EQU   CVTS01+448
CVTPVBP  EQU   CVTS01+444
CVTPWI   EQU   CVTS01+440
CVTRV254 EQU   CVTS01+438
CVTRV253 EQU   CVTS01+436
CVTRV252 EQU   CVTS01+434
CVTRV251 EQU   CVTS01+433
CVTRV250 EQU   CVTS01+432
CVTRV249 EQU   CVTS01+431
CVTRV248 EQU   CVTS01+430
CVTRV247 EQU   CVTS01+429
CVTRV246 EQU   CVTS01+428
CVTRV245 EQU   CVTRV237
CVTRV244 EQU   CVTRV237
CVTRV243 EQU   CVTRV237
CVTRV242 EQU   CVTRV237
CVTRV241 EQU   CVTRV237
CVTRV240 EQU   CVTRV237
CVTRV239 EQU   CVTRV237
CVTRV238 EQU   CVTRV237
CVTRV236 EQU   CVTRV228
CVTRV235 EQU   CVTRV228
CVTRV234 EQU   CVTRV228
CVTRV233 EQU   CVTRV228
CVTRV232 EQU   CVTRV228
CVTRV231 EQU   CVTRV228
CVTRV230 EQU   CVTRV228
CVTRV229 EQU   CVTRV228
CVTRV227 EQU   CVTRV219
CVTRV226 EQU   CVTRV219
CVTRV225 EQU   CVTRV219
CVTRV224 EQU   CVTRV219
CVTRV223 EQU   CVTRV219
CVTRV222 EQU   CVTRV219
CVTRV221 EQU   CVTRV219
CVTRV220 EQU   CVTRV219
CVTRV218 EQU   CVTRV210
CVTRV217 EQU   CVTRV210
CVTRV216 EQU   CVTRV210
CVTRV215 EQU   CVTRV210
CVTRV214 EQU   CVTRV210
CVTRV213 EQU   CVTRV210
CVTRV212 EQU   CVTRV210
CVTRV211 EQU   CVTRV210
CVTLCCAT EQU   CVTS01+420
CVTPCCAT EQU   CVTS01+416
CVTIPCRP EQU   CVTS01+412
CVTIPCRI EQU   CVTS01+408
CVTIPCDS EQU   CVTS01+404
CVTAIDVT EQU   CVTS01+400
CVTSSAP  EQU   CVTS01+396
CVTEHCIR EQU   CVTS01+392
CVTEHDEF EQU   CVTS01+388
CVTDAIR  EQU   CVTS01+384
CVTPERFM EQU   CVTS01+380
CVT044R2 EQU   CVTS01+376
CVTFETCH EQU   CVTS01+372
CVTRSTWD EQU   CVTS01+368
CVTSPOST EQU   CVTS01+364
CVTIOBP  EQU   CVTS01+360
CVTASMVT EQU   CVTS01+356
CVTRECRQ EQU   CVTS01+352
CVTWSAC  EQU   CVTS01+348
CVTRV149 EQU   CVTS01+344
CVTWSAL  EQU   CVTS01+340
CVTSPSA  EQU   CVTS01+336
CVTGLMN  EQU   CVTS01+332
CVTVEAC0 EQU   CVTS01+328
CVT062R1 EQU   CVTS01+324
CVTRPOST EQU   CVTS01+320
CVTDQIQE EQU   CVTS01+316
CVTCSD   EQU   CVTS01+312
CVTLKRMA EQU   CVTS01+308
CVTRSPIE EQU   CVTS01+304
CVTRENQ  EQU   CVTS01+300
CVTLQCB  EQU   CVTS01+296
CVTFQCB  EQU   CVTS01+292
CVTQCS01 EQU   CVTS01+288
CVTAPFT  EQU   CVTS01+284
CVTPARRL EQU   CVTS01+280
CVTVWAIT EQU   CVTS01+276
CVTGSPL  EQU   CVTS01+272
CVTLSMQ  EQU   CVTS01+268
CVTGSMQ  EQU   CVTS01+264
CVTEXPRO EQU   CVTS01+260
CVTOPCTP EQU   CVTS01+256
CVTSIC   EQU   CVTS01+252
CVTTPIOS EQU   CVTS01+248
CVTRTMS  EQU   CVTS01+244
CVTSDBF  EQU   CVTS01+240
CVTSCBP  EQU   CVTS01+236
CVTSDMP  EQU   CVTS01+232
CVTSV60  EQU   CVTS01+228
CVTRTMCT EQU   CVTS01+224
CVTASCBL EQU   CVTS01+220
CVTASCBH EQU   CVTS01+216
CVTGDA   EQU   CVTS01+212
CVTASVT  EQU   CVTS01+208
CVTVVMDI EQU   CVTS01+204
CVTAQTOP EQU   CVTS01+200
CVTIOSCS EQU   CVTS01+196
CVTSDRM  EQU   CVTS01+192
CVTOPTE  EQU   CVTS01+188
CVTSTXU  EQU   CVTS01+184
CVTQUIS  EQU   CVTS01+180
CVTPARS  EQU   CVTS01+176
CVTS1EE  EQU   CVTS01+172
CVTFRAS  EQU   CVTS01+168
CVTQSAS  EQU   CVTS01+164
CVTCRAS  EQU   CVTS01+160
CVTCRMN  EQU   CVTS01+156
CVTDELCP EQU   CVTS01+152
CVTFRECL EQU   CVTS01+148
CVTGETCL EQU   CVTS01+144
CVTBLDCP EQU   CVTS01+140
CVTAUTHL EQU   CVTS01+136
CVTSCAN  EQU   CVTS01+132
CVTRV144 EQU   CVTS01+130
CVTMAXMP EQU   CVTS01+128
CVTSTCK  EQU   CVTS01+124
CVTRV139 EQU   CVTS01+123
CVTDSSAC EQU   CVTS01+122
CVTRV513 EQU   CVTS01+121
CVTIOSPL EQU   CVTS01+120
CVTPTGT  EQU   CVTS01+116
CVTCSPIE EQU   CVTS01+112
CVTSMFEX EQU   CVTS01+108
CVTOLT0A EQU   CVTS01+104
CVTSRBRT EQU   CVTS01+100
CVTPUTL  EQU   CVTS01+96
CVTASCRL EQU   CVTS01+92
CVTASCRF EQU   CVTS01+88
CVTRV326 EQU   CVTS01+84
CVTRV325 EQU   CVTS01+80
CVTRV324 EQU   CVTS01+76
CVT0VL01 EQU   CVTS01+72
CVTSHRVM EQU   CVTS01+68
CVTRV332 EQU   CVTS01+64
CVTTAS   EQU   CVTS01+60
CVTRSCN  EQU   CVTS01+56
CVTTRAC2 EQU   CVTS01+54
CVTTRACE EQU   CVTS01+52
CVTAPG   EQU   CVTS01+51
CVTSDTRC EQU   CVTCTLFG
CVTGTRCE EQU   CVTCTLFG
CVTNOMP  EQU   CVTCTLFG
CVTRSV79 EQU   CVTCTLFG
CVTDSTAT EQU   CVTCTLFG
CVTRSV78 EQU   CVTCTLFG
CVTRV333 EQU   CVTCTLFG
CVTRV323 EQU   CVTCTLFG
CVTSPVLK EQU   CVTS01+49
CVTRSV77 EQU   CVTS01+48
CVTRV331 EQU   CVTS01+44
CVTRV330 EQU   CVTS01+40
CVTRV329 EQU   CVTS01+36
CVTRV328 EQU   CVTS01+32
CVTRV322 EQU   CVTS01+28
CVTSLID  EQU   CVTSLIDA+1
CVTSYLK  EQU   CVTSLIDA
CVTRV321 EQU   CVTS01+20
CVTRV320 EQU   CVTS01+16
CVTLPDIR EQU   CVTLPDIA+1
CVTRSV69 EQU   CVTDIRST
CVTRSV68 EQU   CVTDIRST
CVTRSV67 EQU   CVTDIRST
CVTRSV66 EQU   CVTDIRST
CVTRSV65 EQU   CVTDIRST
CVTRSV64 EQU   CVTDIRST
CVTRSV63 EQU   CVTDIRST
CVTDICOM EQU   CVTDIRST
CVTPVTP  EQU   CVTS01+8
CVTLPDSR EQU   CVTS01+4
CVTGETL  EQU   CVTS01
WKECHNGP EQU   WKECHAIN+1
@NM00023 EQU   WKEFLAGS
WKEGATE  EQU   WKEFLAGS
@NM00022 EQU   ISTWKE
DLRPLUSR EQU   ISTDLRPL+76
DLRPLRNF EQU   ISTDLRPL+73
DLRPLRPF EQU   ISTDLRPL+72
DLRPLR15 EQU   DLRPLRSA+16
@NM00019 EQU   DLRPLRSA+8
DLRPLQPT EQU   DLRPLRSA+4
DLRPLRCD EQU   DLRPLRSA+3
DLRPLLTH EQU   DLRPLRSA+1
TPMPLCID EQU   ISTTPMPL+16
TPMPLTXT EQU   ISTTPMPL+12
TPMPLRNF EQU   ISTTPMPL+8
TPMPLRBA EQU   ISTTPMPL+5
TPMPLRLN EQU   ISTTPMPL+4
TPMPLMID EQU   ISTTPMPL
NCSRUITS EQU   NCSUSSRU+2
NCSRULEN EQU   NCSUSSRU
NCSAPPAB EQU   NCSAPP+608
NCSAPDAT EQU   NCSAPBUE+8
NCSAPRU  EQU   NCSAPBUE+3
NCSRSV04 EQU   NCSAPBUE
NCSAPEND EQU   NCSAPP+84
NCSAPTXT EQU   NCSAPP+76
NCSAPECB EQU   NCSAPP+72
NCSAPSA  EQU   NCSAPP
NCSPLPDB EQU   NCSPLSID+5
NCSPLNID EQU   NCSPLPHD
NCSPLPO  EQU   NCSPLSTA
NCSRSVD4 EQU   NCSPLSTA
NCSRSVD2 EQU   NCSCRMOD
NCSPTMOD EQU   NCSCRMOD
NCSAIMOD EQU   NCSCRMOD
NCSRSVD1 EQU   NCSCHKPT+1
NCSPTUSE EQU   NCSCHKPT+1
NCSRNME  EQU   NCSCHKPT+1
NCSCUA   EQU   NCSCHKPT+1
NCSANSMD EQU   NCSCHKPT+1
NCSLGMOD EQU   NCSCHKPT
NCSLGAPL EQU   NCSCHKPT
NCSDTRLM EQU   NCSCHKPT
NCSESLM  EQU   NCSCHKPT
NCSNRPL  EQU   NCSCHKPT
NCSPOLD  EQU   NCSCHKPT
NCSPACTV EQU   NCSCHKPT
NCSACTV  EQU   NCSCHKPT
NCSCRDTE EQU   ISTNCSPL+264
NCSPLRTY EQU   ISTNCSPL+263
NCSPLRH  EQU   ISTNCSPL+260
NCSUFMCB EQU   ISTNCSPL+256
NCSMGLPT EQU   ISTNCSPL+252
NCSCPWPT EQU   ISTNCSPL+248
NCSSENS2 EQU   NCSSENSE+2
NCSSNS2  EQU   NCSSENSE+1
NCSSNS1  EQU   NCSSENSE
NCSPLNSN EQU   ISTNCSPL+240
NCSPLMID EQU   ISTNCSPL+232
NCSPLPID EQU   ISTNCSPL+231
NCSPLGID EQU   ISTNCSPL+230
NCSPLSQN EQU   ISTNCSPL+228
NCSRNAME EQU   ISTNCSPL+220
NCSPLRUI EQU   ISTNCSPL+212
NCSPLRUO EQU   ISTNCSPL+208
NCSPLRRP EQU   ISTNCSPL+204
NCSPLWEL EQU   ISTNCSPL+200
NCSPLSPL EQU   ISTNCSPL+196
NCSPLP3  EQU   ISTNCSPL+192
NCSPLP2  EQU   ISTNCSPL+188
NCSPLP1  EQU   ISTNCSPL+184
NCSPLOLN EQU   ISTNCSPL+182
@NM00018 EQU   NCSPLFL5
NCSFORCE EQU   NCSPLFL5
NCSSDLK  EQU   NCSPLFL5
NCSSCPPS EQU   NCSPLFL5
NCSDLRSN EQU   ISTNCSPL+180
NCSPL2AP EQU   NCSPLFL4
NCSDSPN  EQU   NCSPLFL4
NCSDSPI  EQU   NCSPLFL4
NCSDSPA  EQU   NCSPLFL4
NCSDSPE  EQU   NCSPLFL4
NCSPLVID EQU   NCSPLFL4
NCSPLRSO EQU   NCSPLFL4
NCSDLNID EQU   NCSPLFL4
NCSEND   EQU   NCSPLFL3
NCSFINAL EQU   NCSPLFL3
NCSANS   EQU   NCSPLFL3
NCSPID   EQU   NCSPLFL3
NCSGID   EQU   NCSPLFL3
NCSPLANS EQU   NCSPLFL3
NCSEPP   EQU   NCSPLFL3
NCSPLMOM EQU   NCSPLFL3
NCSPLVIT EQU   NCSPLFL2
NCSPLVIS EQU   NCSPLFL2
NCSREMPO EQU   NCSPLFL2
NCSPLDS  EQU   NCSPLFL2
NCSOUFMC EQU   NCSPLFL2
NCSPLRIO EQU   NCSPLFL2
NCSPLRSF EQU   NCSPLFL2
NCSPLVDP EQU   NCSPLFL2
NCSPLPOS EQU   NCSPLFL1
NCSPL2CN EQU   NCSPLFL1
NCSPLAPU EQU   NCSPLFL1
NCSPLNON EQU   NCSPLFL1
NCSPLREQ EQU   NCSPLFL1
NCSPLEBN EQU   NCSPLFL1
NCSPLSOM EQU   NCSPLFL1
NCSPL2IN EQU   NCSPLFL1
NCSPLRCR EQU   ISTNCSPL+172
NCSPLECB EQU   ISTNCSPL+164
NCSPLCVT EQU   ISTNCSPL+156
NCSPLWKA EQU   ISTNCSPL+152
NCSPLDAF EQU   NCSPLCID+2
NCSPLSAF EQU   NCSPLCID
NCSPLRCD EQU   NCSPLRAD+1
NCSLSCMD EQU   NCSPLRAD
NCSPLWRF EQU   ISTNCSPL+72
NCSPLWRE EQU   ISTNCSPL+68
NCSSTCMD EQU   NCSCRFLG
NCSUSRNF EQU   NCSCRFLG
NCSOPRQU EQU   NCSCRFLG
NCSCRDSE EQU   NCSCRFLG
NCSFMERP EQU   NCSCRFLG
NCSFMCLD EQU   NCSCRFLG
NCSPLCLD EQU   NCSCRFLG
NCSPLWRM EQU   NCSCRFLG
NCSPLUAD EQU   ISTNCSPL+64
NCSMSGSP EQU   ISTNCSPL+63
NCSNCPEP EQU   ISTNCSPL+62
NCSCMDB  EQU   NCSPLCMD+1
@NM00017 EQU   NCSCMDA
NCSPLUFM EQU   NCSCMDA
NCSPLFLO EQU   NCSCMDA
NCSPLSYN EQU   NCSCMDA
NCSPLCTL EQU   NCSCMDA
NCSPLSYS EQU   NCSCMDA
NCSPLLPT EQU   ISTNCSPL+56
NCSPLRPT EQU   ISTNCSPL+52
NCSCRPID EQU   ISTNCSPL+51
NCSCRCMD EQU   ISTNCSPL+50
NCSDLID  EQU   ISTNCSPL+44
NCSPLLID EQU   ISTNCSPL+36
NCSPLRID EQU   ISTNCSPL+28
NCSRRNPT EQU   ISTNCSPL+24
NCSPRMRC EQU   ISTNCSPL+22
NCSOVFMC EQU   NCSPLVF1
NCSRSV02 EQU   NCSPLVFL
NCSDACLK EQU   NCSPLVFL
NCSABCON EQU   NCSPLVFL
NCSDCONT EQU   NCSPLVFL
NCSVSTAT EQU   NCSPLVFL
NCSVDEL  EQU   NCSPLVFL
NCSVNCSA EQU   NCSPLVFL
NCSVBF16 EQU   NCSPLVBF+1
NCSVBF15 EQU   NCSPLVBF+1
NCSVBF14 EQU   NCSPLVBF+1
NCSVBF13 EQU   NCSPLVBF+1
NCSVBF12 EQU   NCSPLVBF+1
NCSVBF11 EQU   NCSPLVBF+1
NCSVBF10 EQU   NCSPLVBF+1
NCSVBF09 EQU   NCSPLVBF+1
NCSVBF08 EQU   NCSPLVBF
NCSVBF07 EQU   NCSPLVBF
NCSVBF06 EQU   NCSPLVBF
NCSVBF05 EQU   NCSPLVBF
NCSVBF04 EQU   NCSPLVBF
NCSVBF03 EQU   NCSPLVBF
NCSVBF02 EQU   NCSPLVBF
NCSVBF01 EQU   NCSPLVBF
@NM00016 EQU   ISTNCSPL+16
NCSCRWKA EQU   NCSPFX+12
@NM00015 EQU   NCSPFX
PFXBCK   EQU   ISTPFX+12
PFXFWD   EQU   ISTPFX+8
PFXLNG   EQU   ISTPFX+5
PFXPRTY  EQU   ISTPFX+4
PFXCBID  EQU   PFXID
POHID    EQU   ISTPOHD+2
POHGEN   EQU   POHSTAT
POHRREQ  EQU   POHSTAT
POHRSVD2 EQU   POHSTAT
POHCNTRL EQU   POHSTAT
POHLBL   EQU   POHSTAT
POHDATA  EQU   POHSTAT
POHEND   EQU   POHSTAT
POHRSVD1 EQU   ISTPOHD
ATCAOS   EQU   ISTATCVT+1584
ATCPOPAB EQU   ATCAOSM+640
ATCVIOPM EQU   ATCAOSM+636
ATCTPMMI EQU   ATCAOSM+632
ATCTPMPB EQU   ATCAOSM+600
ATCRSV88 EQU   ATCAOSM+596
ATCRPLCT EQU   ATCAOSM+594
ATCCRACT EQU   ATCAOSM+592
ATCSRBCT EQU   ATCAOSM+590
ATCRSV75 EQU   ATCAOSM+589
ATCRSV66 EQU   ATCZFLAG
ATCZF001 EQU   ATCZFLAG
ATCTPCP1 EQU   ATCAOSM+584
ATCTPCP0 EQU   ATCAOSM+580
ATCAICTN EQU   ATCAOSM+576
ATCZR01  EQU   ATCAOSM+572
ATCMPLTA EQU   ATCAOSM+568
ATCASCB  EQU   ATCAOSM+564
ATCAP86  EQU   ATCAOSM+560
ATCAP85  EQU   ATCAOSM+556
ATCAP84  EQU   ATCAOSM+552
ATCAP83  EQU   ATCAOSM+548
ATCAP82  EQU   ATCAOSM+544
ATCAP69  EQU   ATCAOSM+540
ATCAP66  EQU   ATCAOSM+536
ATCAP62  EQU   ATCAOSM+532
ATCAPC59 EQU   ATCAOSM+528
ATCAP56  EQU   ATCAOSM+524
ATCAP55  EQU   ATCAOSM+520
ATCRCFY0 EQU   ATCAOSM+516
ATCAP41  EQU   ATCAOSM+512
ATCAPC25 EQU   ATCAOSM+508
ATCAP23  EQU   ATCAOSM+504
ATCTPSPB EQU   ATCAOSM+472
ATCTRMPB EQU   ATCAOSM+440
ATCAPBE  EQU   ATCAOSM+436
ATCPSTA  EQU   ATCAOSM+432
ATCSMABF EQU   ATCAOSM+428
ATCSMAPR EQU   ATCAOSM+424
ATCTPWQA EQU   ATCAOSM+420
ATCSMAID EQU   ATCAOSM+416
ATCSMARA EQU   ATCAOSM+412
ATCCACXA EQU   ATCAOSM+408
ATCZLAAB EQU   ATCAOSM+404
ATCATA10 EQU   ATCAOSM+400
ATCHLTCB EQU   ATCAOSM+396
@NM00013 EQU   ATCVTFLG
ATCVTACT EQU   ATCVTFLG
ATCRPT40 EQU   ATCAOSM+388
ATCRPT39 EQU   ATCAOSM+384
ATCRPT38 EQU   ATCAOSM+380
ATCRPT37 EQU   ATCAOSM+376
ATCRPT36 EQU   ATCAOSM+372
ATCRPT35 EQU   ATCAOSM+368
ATCRPT34 EQU   ATCAOSM+364
ATCRPT33 EQU   ATCAOSM+360
ATCRPT32 EQU   ATCAOSM+356
ATCRPT31 EQU   ATCAOSM+352
ATCRPT30 EQU   ATCAOSM+348
ATCRPT29 EQU   ATCAOSM+344
ATCRPT28 EQU   ATCAOSM+340
ATCRPT27 EQU   ATCAOSM+336
ATCRPT26 EQU   ATCAOSM+332
ATCRPT25 EQU   ATCAOSM+328
ATCRPT24 EQU   ATCAOSM+324
ATCRPT23 EQU   ATCAOSM+320
ATCRPT22 EQU   ATCAOSM+316
ATCRPT21 EQU   ATCAOSM+312
ATCRPT20 EQU   ATCAOSM+308
ATCRPT19 EQU   ATCAOSM+304
ATCRPT18 EQU   ATCAOSM+300
ATCRPT17 EQU   ATCAOSM+296
ATCRPT16 EQU   ATCAOSM+292
ATCRPT15 EQU   ATCAOSM+288
ATCRPT14 EQU   ATCAOSM+284
ATCRPT13 EQU   ATCAOSM+280
ATCRPT12 EQU   ATCAOSM+276
ATCRPT11 EQU   ATCAOSM+272
ATCAP38  EQU   ATCAOSM+268
ATCAP37  EQU   ATCAOSM+264
ATCZDFJ0 EQU   ATCAOSM+260
ATCAP51  EQU   ATCAOSM+256
ATCZPAB2 EQU   ATCAOSM+224
ATCZPAB1 EQU   ATCAOSM+192
ATCZLFVT EQU   ATCAOSM+188
ATCZLPVT EQU   ATCAOSM+184
ATCZDVTX EQU   ATCAOSM+180
ATCZDVTA EQU   ATCAOSM+176
ATCZDVT9 EQU   ATCAOSM+172
ATCZDVT8 EQU   ATCAOSM+168
ATCZDVT7 EQU   ATCAOSM+164
ATCRSV56 EQU   ATCDAPVT+22
ATCDAPDG EQU   ATCDAPVT+20
ATCDXCEA EQU   ATCDAPVT+16
ATCDCEA  EQU   ATCDAPVT+12
ATCDPCIA EQU   ATCDAPVT+8
ATCDSIOA EQU   ATCDAPVT+4
ATCDEOEA EQU   ATCDAPVT
ATCZLAEA EQU   ATCLDAPP+16
ATCZLCEA EQU   ATCLDAPP+12
ATCRSV17 EQU   ATCLDAPP+8
ATCSMFRR EQU   ATCLDAPP+4
ATCCDTID EQU   ATCLDAPP
ATCZAEA  EQU   ATCICAPP+16
ATCZCEA  EQU   ATCICAPP+12
ATCCDTCB EQU   ATCICAPP+8
ATCZSIOA EQU   ATCICAPP+4
ATCCDRPH EQU   ATCICAPP
ATCAP65  EQU   ATCAOSM+96
ATCZDVT6 EQU   ATCAOSM+92
ATCZDVT4 EQU   ATCAOSM+88
ATCZDVT3 EQU   ATCAOSM+84
ATCZDVT1 EQU   ATCAOSM+80
ATCICNCB EQU   ATCAOSM+76
ATCZPSVT EQU   ATCAOSM+72
ATCZFSVT EQU   ATCAOSM+68
ATCAP64  EQU   ATCAOSM+64
ATCAP63  EQU   ATCAOSM+60
ATCAP61  EQU   ATCAOSM+56
ATCAP58  EQU   ATCAOSM+52
ATCAP57  EQU   ATCAOSM+48
ATCAP54  EQU   ATCAOSM+44
ATCAP53  EQU   ATCAOSM+40
ATCAP52  EQU   ATCAOSM+36
ATCAP34  EQU   ATCAOSM+32
ATCAP31  EQU   ATCAOSM+24
ATCAP12  EQU   ATCAOSM+20
ATCAP11  EQU   ATCAOSM+16
ATCCMTCB EQU   ATCAOSM+12
ATCPRPH  EQU   ATCAOSM+8
ATCGSRBF EQU   ATCGSRBG
ATCSRBRT EQU   ATCAOSM
ATCRSVBB EQU   ISTATCVT+908
ATCVDLOK EQU   ISTATCVT+904
ATCVFPAB EQU   ISTATCVT+872
ATCVDPAB EQU   ISTATCVT+840
ATCIOECB EQU   ISTATCVT+836
ATCINCW3 EQU   ISTATCVT+832
ATCMODTB EQU   ISTATCVT+828
ATCUSSPT EQU   ISTATCVT+824
ATCSRTAB EQU   ISTATCVT+820
@NM00012 EQU   ISTATCVT+819
ATCSTAT2 EQU   ISTATCVT+818
ATCNMCTR EQU   ISTATCVT+816
ATCSEC51 EQU   ATCSECST
ATCSEC40 EQU   ATCSIPD+8
ATCSEC30 EQU   ATCSIPD+4
ATCSEC21 EQU   ATCSIPD
ATCSEC10 EQU   ATCSOPD+4
ATCSEC01 EQU   ATCSOPD
ATCPOIA  EQU   ATCRNO+1
@NM00011 EQU   ATCRNO
ATCPODVT EQU   ISTATCVT+784
ATCS49XL EQU   ISTATCVT+780
ATCS49XI EQU   ISTATCVT+776
ATCLCLCT EQU   ATCVLCNT+2
ATCRNCNT EQU   ATCVLCNT
ATCCFEAD EQU   ISTATCVT+768
ATCPTR00 EQU   ISTATCVT+736
ATCRSV10 EQU   ISTATCVT+704
ATCTACB  EQU   ISTATCVT+700
ATCVTINM EQU   ISTATCVT+696
ATCTCLIM EQU   ISTATCVT+692
ATCTCLOM EQU   ISTATCVT+688
ATCVTIPB EQU   ISTATCVT+656
ATCTCIPB EQU   ISTATCVT+624
ATCTIPAB EQU   ISTATCVT+592
ATCOCCCB EQU   ISTATCVT+588
ATCOCCOB EQU   ISTATCVT+584
ATCCDLAD EQU   ISTATCVT+580
ATCCCLAD EQU   ISTATCVT+576
ATCDLRPB EQU   ISTATCVT+544
ATCPGPAB EQU   ISTATCVT+512
ATCVPAB1 EQU   ISTATCVT+480
ATCRSV97 EQU   ISTATCVT+476
ATCRDTLK EQU   ISTATCVT+472
ATCVOCLK EQU   ISTATCVT+468
ATCCDFDN EQU   ISTATCVT+464
ATCCDFIN EQU   ISTATCVT+460
ATCDVTLK EQU   ISTATCVT+456
ATCAP36  EQU   ISTATCVT+452
ATCAP35  EQU   ISTATCVT+448
ATCAP33  EQU   ISTATCVT+444
ATCRSV99 EQU   ISTATCVT+440
ATCONFIG EQU   ISTATCVT+432
ATCNODDS EQU   ISTATCVT+428
ATCNODEL EQU   ISTATCVT+420
ATCRSV69 EQU   ISTATCVT+416
ATCAPCR5 EQU   ISTATCVT+412
ATCCDPTR EQU   ISTATCVT+400
ATCADEL  EQU   ISTATCVT+396
ATCTODVT EQU   ISTATCVT+392
ATCDEBCH EQU   ISTATCVT+388
ATCHBSIZ EQU   ATCHPGM+2
ATCHBFNO EQU   ATCHPGM
ATCCRME  EQU   ISTATCVT+380
ATCRVCHS EQU   ISTATCVT+372
ATCECTLP EQU   ISTATCVT+368
ATCZDVTB EQU   ISTATCVT+364
ATCECPRT EQU   ISTATCVT+360
ATCVTLOD EQU   ISTATCVT+356
ATCTRPAB EQU   ISTATCVT+352
ATCMSGM  EQU   ISTATCVT+348
ATCMSGP  EQU   ISTATCVT+344
ATCEPT   EQU   ISTATCVT+340
ATCDVT   EQU   ISTATCVT+336
ATCTRCPT EQU   ISTATCVT+332
ATCDVLOD EQU   ISTATCVT+328
ATCALERT EQU   ISTATCVT+324
ATCEPA   EQU   ISTATCVT+320
ATCSAF   EQU   ISTATCVT+318
ATCXRANG EQU   ISTATCVT+317
ATCLAST  EQU   ATCSHRFG
ATCSHRTN EQU   ISTATCVT+308
ATCUEP   EQU   ISTATCVT+304
ATCOCRT  EQU   ISTATCVT+300
ATCCSMA  EQU   ATCCSMR
ATCESC02 EQU   ISTATCVT+292
ATCESC01 EQU   ISTATCVT+288
ATCCDFND EQU   ISTATCVT+284
ATCCDDEL EQU   ISTATCVT+280
ATCCDADD EQU   ISTATCVT+276
ATCMNT   EQU   ISTATCVT+272
ATCRSV16 EQU   ISTATCVT+270
ATCMAXID EQU   ISTATCVT+269
ATCMSGSP EQU   ATCCOM+268
ATCCIDM  EQU   ATCCOM+266
ATCACTRM EQU   ATCCOM+264
ATCNERAP EQU   ATCCOM+260
ATCNESAL EQU   ATCCOM+256
ATCRCC65 EQU   ATCCOM+252
ATCRCC26 EQU   ATCCOM+248
ATCRCC63 EQU   ATCCOM+244
ATCRSV11 EQU   ATCCOM+242
ATCVTMID EQU   ATCCOM+240
ATCAPOST EQU   ATCCOM+236
ATCNERFN EQU   ATCCOM+232
ATCNERNE EQU   ATCCOM+228
ATCNERCV EQU   ATCCOM+224
ATCNERST EQU   ATCCOM+220
ATCDCC61 EQU   ATCCOM+216
ATCDCC60 EQU   ATCCOM+212
ATCSRTDF EQU   ATCCOM+208
ATCSRTAD EQU   ATCCOM+204
ATCFIRA  EQU   ATCCOM+200
ATCSMBQ  EQU   ATCCOM+196
ATCSMRC  EQU   ATCCOM+192
ATCSMRS  EQU   ATCCOM+188
ATCSMQU  EQU   ATCCOM+184
ATCSMRQ  EQU   ATCCOM+180
ATCACDA  EQU   ATCCOM+176
ATCSTMA  EQU   ATCCOM+172
ATCFRSTR EQU   ATCCOM+168
ATCGTSTR EQU   ATCCOM+164
ATCREADA EQU   ATCCOM+160
ATCALOAD EQU   ATCCOM+156
ATCBLDLA EQU   ATCCOM+152
ATCFBRPH EQU   ATCCOM+148
ATCBFTRC EQU   ATCCOM+144
ATCTPBUF EQU   ATCTHTRC
ATCREMOV EQU   ATCCOM+136
ATCADD   EQU   ATCCOM+132
ATCBPDA  EQU   ATCCOM+128
ATCDVTPT EQU   ATCCOM+124
ATCFEPT  EQU   ATCCOM+120
ATCFDVT  EQU   ATCCOM+116
ATCCONFT EQU   ATCCOM+112
ATCPTCHA EQU   ATCCOM+108
ATCAUTHA EQU   ATCCOM+104
ATCACCTA EQU   ATCCOM+100
ATCRDTH  EQU   ATCCOM+96
ATCFRSCH EQU   ATCCOM+92
ATCFSB   EQU   ATCCOM+88
ATCHLTMS EQU   ATCCOM+84
ATCECPRM EQU   ATCCOM+80
ATCECNET EQU   ATCCOM+76
ATCECOPC EQU   ATCCOM+72
ATCVPARM EQU   ATCCOM+68
ATCECVRQ EQU   ATCCOM+64
ATCECSES EQU   ATCCOM+60
ATCOCHA  EQU   ATCCOM+56
ATCDSPLQ EQU   ATCCOM+52
ATCECDSP EQU   ATCCOM+48
ATCVARYQ EQU   ATCCOM+44
ATCECVRY EQU   ATCCOM+40
ATCHALTQ EQU   ATCCOM+36
ATCECHLT EQU   ATCCOM+32
ATCMODQ  EQU   ATCCOM+28
ATCECMOD EQU   ATCCOM+24
ATCASCHD EQU   ATCCOM+20
ATCSRT   EQU   ATCCOM+16
ATCRDT   EQU   ATCCOM+12
ATCDCFRR EQU   ATCCOM+8
ATCAPI   EQU   ATCCOM+4
ATCRSV04 EQU   ATCSTAT4
ATCMTST  EQU   ATCSTAT4
ATCTPRT  EQU   ATCSTAT4
ATCPRTAT EQU   ATCSTAT4
@NM00010 EQU   ATCPOFLG
ATCPOUNS EQU   ATCPOFLG
ATCHSDMF EQU   ATCSTFLG
@NM00009 EQU   ATCSTAT1
ATCMDHLT EQU   ATCSTAT1
ATCINHLT EQU   ATCSTAT1
ATCNETSL EQU   ATCSTAT1
ATCQKHLT EQU   ATCSTAT1
ATCSNHLT EQU   ATCSTAT1
ATCACTIV EQU   ATCSTAT1
ATCSTART EQU   ATCSTAT1
RPHNEXPO EQU   ISTRPH+104
RPHSAV16 EQU   RPHWORK+60
RPHSAV15 EQU   RPHWORK+56
RPHSAV14 EQU   RPHWORK+52
RPHSAV13 EQU   RPHWORK+48
RPHSAV12 EQU   RPHWORK+44
RPHSAV11 EQU   RPHWORK+40
RPHSAV10 EQU   RPHWORK+36
RPHSAVE9 EQU   RPHWORK+32
RPHSAVE8 EQU   RPHWORK+28
RPHSAVE7 EQU   RPHWORK+24
RPHSAVE6 EQU   RPHWORK+20
RPHSAVE5 EQU   RPHWORK+16
RPHSAVE4 EQU   RPHWORK+12
RPHSAVE3 EQU   RPHWORK+8
RPHSAVE2 EQU   RPHWORK+4
RPHSHALF EQU   RPHSAVE1+2
RPHSBIT8 EQU   RPHSBITS
RPHSBIT7 EQU   RPHSBITS
RPHSBIT6 EQU   RPHSBITS
RPHSBIT5 EQU   RPHSBITS
RPHSBIT4 EQU   RPHSBITS
RPHSBIT3 EQU   RPHSBITS
RPHSBIT2 EQU   RPHSBITS
RPHSBIT1 EQU   RPHSBITS
RPHSBYTE EQU   RPHSAVE1
RPHPABQP EQU   RPHPABQA+1
RPHPABFG EQU   RPHPABQA
RPHCRR   EQU   ISTRPH+32
RPHSRP34 EQU   RPHSRPRM+2
RPHSRP12 EQU   RPHSRPRM
RPHWEGT  EQU   RPHCSPA
RPHRESUM EQU   RPHRESMA+1
RPHRSV01 EQU   RPHWPFLG
RPHPURGE EQU   RPHWPFLG
RPHPT    EQU   RPHWPFLG
RPHRSKEY EQU   RPHWPFLG
RPHDVTA  EQU   ISTRPH+12
RPHTIK   EQU   RPHTSKID+3
@NM00008 EQU   RPHTSKID
RPHRPHAP EQU   RPHRPHA+1
@NM00007 EQU   RPHRPHA
RPHGATE  EQU   RPHRPHA
@NM00006 EQU   RPHFLGB
RPHRLCRA EQU   RPHFLGB
RPHNRSAV EQU   RPHFLGB
RPHPGCMP EQU   RPHFLGB
RPHFBAPS EQU   RPHFLGB
RPHBSSP  EQU   RPHFLGB
RPHLOCK  EQU   RPHFLGB
RPHFNFLG EQU   RPHFSTLC
RPHMLTCP EQU   RPHFLAGS
RPHSMCLR EQU   RPHFLAGS
RPHSMTYP EQU   RPHFLAGS
RPHSMQ   EQU   RPHFLAGS
RPHAUTEX EQU   RPHAPTYP
RPHSPGIN EQU   RPHFLAGS
RPHOGIND EQU   RPHFLAGS
RPHLNGTH EQU   RPHCNTL+1
RPHTYPE  EQU   RPHCNTL
DYPPAB   EQU   ISTDYPAB+16
DYPRSV01 EQU   ISTDYPAB+12
DYPTSKID EQU   ISTDYPAB+8
DYPCHAIN EQU   ISTDYPAB+4
DYPFLGS  EQU   ISTDYPAB+2
DYPLNGTH EQU   ISTDYPAB+1
DYPTYPE  EQU   ISTDYPAB
LOKXCL   EQU   @NM00004
LOKPRY   EQU   @NM00004
@NM00005 EQU   @NM00004
@NM00003 EQU   LOKCHNG
LOKCT    EQU   ISTLOK
PABRPHA  EQU   PABRPHFG+1
PABNODQ  EQU   PABFLAGS
PABINHBT EQU   PABFLAGS
PABERLOK EQU   PABERRLK
PABSSN   EQU   PABFLAGS
PABDYNAM EQU   PABFLAGS
PABNORPR EQU   PABFLAGS
PABPRIOR EQU   PABFLAGS
PABAPYP  EQU   PABFLAGS
PABDVTA  EQU   ISTPAB+9
PABOFFST EQU   ISTPAB+8
PABCHNGP EQU   PABCHAIN+1
PABRSV02 EQU   PABCHAIN
PABRUNNG EQU   PABCHAIN
PABRESET EQU   PABCHAIN
PABUNCON EQU   PABCHAIN
PABCDP   EQU   PABCHAIN
PABRESCH EQU   PABCHAIN
PABCHNG  EQU   PABCHAIN
PABWEQP  EQU   PABWEQA+1
PABRSV01 EQU   PABWEQA
PABWEQG  EQU   PABWEQA
ISTPDAVP EQU   ISTAVT+40
ISTAVR01 EQU   ISTAVT+38
ISTVTTP  EQU   ISTAVT+36
ISTAGTWT EQU   ISTAVT+34
ISTATRT  EQU   ISTAVT+32
ISTARID  EQU   ISTAVT+30
ISTX1    EQU   ISTAVT+29
ISTPHNM  EQU   ISTAVT+24
ISTAPSEX EQU   ISTAVT+20
ISTVTTIK EQU   ISTAVT+18
AVTASID  EQU   ISTAVT+16
ISTAPSTA EQU   ISTAVT+12
ISTAS53  EQU   ISTAVT+8
CVTLEVL  EQU   CVTRELNO+2
CVTNUMB  EQU   CVTRELNO
CVTMDL   EQU   CVTFIX+250
@NM00002 EQU   CVTFIX+248
@NM00001 EQU   CVTFIX
CVTRV482 EQU   CVTXTNT2+128
CVTRV481 EQU   CVTXTNT2+124
CVTRV480 EQU   CVTXTNT2+120
CVTRV479 EQU   CVTXTNT2+118
CVTRV478 EQU   CVTXTNT2+117
CVTRV477 EQU   CVTXTNT2+116
CVTRV476 EQU   CVTXTNT2+115
CVTRV475 EQU   CVTXTNT2+114
CVTRV474 EQU   CVTRV466
CVTRV473 EQU   CVTRV466
CVTRV472 EQU   CVTRV466
CVTRV471 EQU   CVTRV466
CVTRV470 EQU   CVTRV466
CVTRV469 EQU   CVTRV466
CVTRV468 EQU   CVTRV466
CVTRV467 EQU   CVTRV466
CVTRV465 EQU   CVTRV457
CVTRV464 EQU   CVTRV457
CVTRV463 EQU   CVTRV457
CVTRV462 EQU   CVTRV457
CVTRV461 EQU   CVTRV457
CVTRV460 EQU   CVTRV457
CVTRV459 EQU   CVTRV457
CVTRV458 EQU   CVTRV457
CVTRV456 EQU   CVTXTNT2+108
CVTRV455 EQU   CVTXTNT2+104
CVTRV454 EQU   CVTXTNT2+100
CVTRV453 EQU   CVTXTNT2+96
CVTRV452 EQU   CVTXTNT2+94
CVTRV451 EQU   CVTXTNT2+92
CVTRV450 EQU   CVTXTNT2+90
CVTRV449 EQU   CVTXTNT2+88
CVTRV448 EQU   CVTXTNT2+87
CVTRV447 EQU   CVTXTNT2+86
CVTRV446 EQU   CVTRV438
CVTRV445 EQU   CVTRV438
CVTRV444 EQU   CVTRV438
CVTRV443 EQU   CVTRV438
CVTRV442 EQU   CVTRV438
CVTRV441 EQU   CVTRV438
CVTRV440 EQU   CVTRV438
CVTRV439 EQU   CVTRV438
CVTRV437 EQU   CVTRV429
CVTRV436 EQU   CVTRV429
CVTRV435 EQU   CVTRV429
CVTRV434 EQU   CVTRV429
CVTRV433 EQU   CVTRV429
CVTRV432 EQU   CVTRV429
CVTRV431 EQU   CVTRV429
CVTRV430 EQU   CVTRV429
CVTRV428 EQU   CVTXTNT2+80
CVTRV427 EQU   CVTXTNT2+76
CVTRV426 EQU   CVTXTNT2+72
CVTRV425 EQU   CVTXTNT2+68
CVTATACT EQU   CVTATCVT
CVTRV423 EQU   CVTXTNT2+62
CVTRV422 EQU   CVTXTNT2+60
CVTRV421 EQU   CVTXTNT2+58
CVTRV420 EQU   CVTXTNT2+56
CVTRV419 EQU   CVTXTNT2+55
CVTRV418 EQU   CVTXTNT2+54
CVTRV417 EQU   CVTRV409
CVTRV416 EQU   CVTRV409
CVTRV415 EQU   CVTRV409
CVTRV414 EQU   CVTRV409
CVTRV413 EQU   CVTRV409
CVTRV412 EQU   CVTRV409
CVTRV411 EQU   CVTRV409
CVTRV410 EQU   CVTRV409
CVTRV408 EQU   CVTRV400
CVTRV407 EQU   CVTRV400
CVTRV406 EQU   CVTRV400
CVTRV405 EQU   CVTRV400
CVTRV404 EQU   CVTRV400
CVTRV403 EQU   CVTRV400
CVTRV402 EQU   CVTRV400
CVTRV401 EQU   CVTRV400
CVTICB   EQU   CVTXTNT2+48
CVTSKTA  EQU   CVTXTNT2+44
CVTSHSB  EQU   CVTSHS
CVTRSV98 EQU   CVTXTNT2+36
CVTRSV97 EQU   CVTXTNT2+34
CVTRSV96 EQU   CVTXTNT2+32
CVTOLTEP EQU   CVTXTNT2+28
CVTQIDA  EQU   CVTQID+1
CVTRSV95 EQU   CVTQID
CVTRSV94 EQU   CVTXTNT2+20
CVTRSV93 EQU   CVTXTNT2+16
CVTRSV92 EQU   CVTXTNT2+12
CVTDEBVR EQU   CVTXTNT2+8
CVTRSV91 EQU   CVTXTNT2+6
CVTRSV9H EQU   CVTFLGBT
CVTRSV9G EQU   CVTFLGBT
CVTRSV9F EQU   CVTFLGBT
CVTRSV9E EQU   CVTFLGBT
CVTRSV9D EQU   CVTFLGBT
CVTRSV9C EQU   CVTFLGBT
CVTVME   EQU   CVTFLGBT
CVTNPE   EQU   CVTFLGBT
CVTNUCLS EQU   CVTXTNT2+4
CVTDSSVA EQU   CVTDSSV+1
CVTRSV89 EQU   CVTDSSV
CVTRSV88 EQU   CVTXTNT1+8
CVTRSV87 EQU   CVTXTNT1+4
CVTFACHN EQU   CVTXTNT1
CVTRV488 EQU   CVTMAP+412
CVTRV487 EQU   CVTMAP+408
CVTRV486 EQU   CVTMAP+404
CVTRV485 EQU   CVTMAP+400
CVTACTAP EQU   CVTMAP+396
CVTAUTH  EQU   CVTMAP+392
CVTATMCA EQU   CVTATMCT+1
CVTATMST EQU   CVTATMCT
CVTRSV61 EQU   CVTMAP+384
CVTVOLT1 EQU   CVTVOLM1+1
CVTVOLI1 EQU   CVTVOLF1
CVTSTOA  EQU   CVTMAP+376
CVTRSV58 EQU   CVTMAP+374
CVTRSV57 EQU   CVTMAP+372
CVTDDCE  EQU   CVTMAP+368
CVTPNWFR EQU   CVTMAP+364
CVTSMF   EQU   CVTMAP+360
CVTSULK  EQU   CVTMAP+358
CVTSLKO  EQU   CVTSYSK
CVTSLKP  EQU   CVTSYSK
CVTSLKQ  EQU   CVTSYSK
CVTSLKR  EQU   CVTSYSK
CVTRSV56 EQU   CVTSYSK
CVTRSV55 EQU   CVTSYSK
CVTRSV54 EQU   CVTSYSK
CVTRSV53 EQU   CVTSYSK
CVTRSV52 EQU   CVTA1F1
CVTRSV51 EQU   CVTA1F1
CVTRSV50 EQU   CVTA1F1
CVTRSV49 EQU   CVTA1F1
CVTRSV48 EQU   CVTA1F1
CVTRSV47 EQU   CVTA1F1
CVTSRSW  EQU   CVTA1F1
CVTPFSW  EQU   CVTA1F1
CVTPCVT  EQU   CVTMAP+352
CVTRSV46 EQU   CVTMAP+344
CVTRSV45 EQU   CVTMAP+340
CVTRSV44 EQU   CVTMAP+338
CVTRSV43 EQU   CVTMAP+336
CVTHJESA EQU   CVTHJES+1
CVTRSV42 EQU   CVTHJES
CVTEXT2A EQU   CVTEXT2+1
CVTRSV41 EQU   CVTEXT2
CVTAPFA  EQU   CVTAPF+1
CVTRSV40 EQU   CVTAPF
CVTRV518 EQU   CVTINTLA
CVTRV517 EQU   CVTERPV
CVTEORM  EQU   CVTMAP+312
CVTMCHPR EQU   CVTMAP+308
CVTTZ    EQU   CVTMAP+304
CVTJEPS  EQU   CVTMAP+300
CVTJESCT EQU   CVTMAP+296
CVTMODE  EQU   CVTMAP+292
CVTPTRV  EQU   CVTMAP+288
CVTREAL  EQU   CVTMAP+284
CVTRSV39 EQU   CVTMAP+280
CVTRSV38 EQU   CVTMAP+276
CVTDMSRA EQU   CVTDMSR+1
CVTRSV37 EQU   CVTDMSR
CVTQMSGA EQU   CVTQMSG+1
CVTRSV36 EQU   CVTQMSG
CVTAMFF  EQU   CVTMAP+264
CVTPURGA EQU   CVTPURG+1
CVTRSV35 EQU   CVTPURG
CVTCBSP  EQU   CVTMAP+256
CVTATERA EQU   CVTATER+1
CVTSYST  EQU   CVTATER
CVTVOLT2 EQU   CVTTAT
CVTVOLI2 EQU   CVTVOLF2
CVTAQAVB EQU   CVTAQAVT+1
CVTRSV34 EQU   CVTTCMFG
CVTRSV33 EQU   CVTTCMFG
CVTRSV32 EQU   CVTTCMFG
CVTRSV31 EQU   CVTTCMFG
CVTRSV30 EQU   CVTTCMFG
CVTRSV29 EQU   CVTTCMFG
CVTRSV28 EQU   CVTTCMFG
CVTTCRDY EQU   CVTTCMFG
CVTGTFA  EQU   CVTGTF+1
CVTRSV27 EQU   CVTGTFST
CVTRNIO  EQU   CVTGTFST
CVTUSR   EQU   CVTGTFST
CVTRV318 EQU   CVTFORM
CVTRV317 EQU   CVTTMODE
CVTRV316 EQU   CVTSTATE
CVTRV315 EQU   CVTGTFS
CVTGTFAV EQU   CVTGTFS
CVT0SCR1 EQU   CVTMAP+232
CVTRV515 EQU   CVTMAP+228
CVTRMS   EQU   CVTMAP+224
CVTPATCH EQU   CVTMAP+220
CVTTSCE  EQU   CVTMAP+216
CVTLNKSC EQU   CVTMAP+214
CVTQABST EQU   CVTMAP+212
CVTMDLDS EQU   CVTMAP+208
CVTUSER  EQU   CVTMAP+204
CVTABEND EQU   CVTMAP+200
CVTSMCA  EQU   CVTMAP+196
CVTRSV18 EQU   CVTMAP+192
CVTQLPAQ EQU   CVTMAP+188
CVTQCDSR EQU   CVTMAP+184
CVTRSV17 EQU   CVTOPTB
CVTRSV16 EQU   CVTOPTB
CVTFP    EQU   CVTOPTB
CVTAPTHR EQU   CVTOPTB
CVTNLOG  EQU   CVTOPTB
CVTTOD   EQU   CVTOPTB
CVTCTIMS EQU   CVTOPTB
CVTPROT  EQU   CVTOPTB
CVTXPFP  EQU   CVTOPTA
CVTASCII EQU   CVTOPTA
CVTRSV13 EQU   CVTOPTA
CVTRSV12 EQU   CVTOPTA
CVTNIP   EQU   CVTOPTA
CVTDDR   EQU   CVTOPTA
CVTAPR   EQU   CVTOPTA
CVTCCH   EQU   CVTOPTA
CVTSNCTR EQU   CVTMAP+180
CVTQMWR  EQU   CVTMAP+176
CVTQOCR  EQU   CVTMAP+172
CVT1EF00 EQU   CVTMAP+168
CVTMZ00  EQU   CVTMAP+164
CVTHEAD  EQU   CVTMAP+160
CVTRSV11 EQU   CVTMAP+156
CVT0PT01 EQU   CVTMAP+152
CVTMSER  EQU   CVTMAP+148
CVTRV516 EQU   CVTIERLC
CVTILCH  EQU   CVTMAP+140
CVT0DS   EQU   CVTMAP+136
CVTFBOSV EQU   CVTMAP+132
CVTNUCB  EQU   CVTMAP+128
CVTIXAVL EQU   CVTMAP+124
CVTIOQET EQU   CVTMAP+120
CVTDCBA  EQU   CVTMAP+117
CVTMVS2  EQU   CVTDCB
CVT6DAT  EQU   CVTDCB
CVT4MPS  EQU   CVTDCB
CVTRSV09 EQU   CVTDCB
CVT4MS1  EQU   CVTDCB
CVT2SPS  EQU   CVTDCB
CVT1SSS  EQU   CVTDCB
CVTRSV08 EQU   CVTDCB
CVTSTB   EQU   CVTMAP+112
CVTQTD00 EQU   CVTMAP+108
CVTQTE00 EQU   CVTMAP+104
CVTCUCB  EQU   CVTMAP+100
CVTSJQ   EQU   CVTMAP+96
CVTPBLDL EQU   CVTMAP+92
CVTTPC   EQU   CVTMAP+88
CVTSVDCB EQU   CVTMAP+84
CVTBRET  EQU   CVTMAP+82
CVTEXIT  EQU   CVTMAP+80
CVT0FN00 EQU   CVTMAP+76
CVTDARA  EQU   CVTDAR+1
CVTRSV07 EQU   CVTFLGS1
CVTRSV06 EQU   CVTFLGS1
CVTRSV05 EQU   CVTFLGS1
CVTRSV04 EQU   CVTFLGS1
CVTRSV03 EQU   CVTFLGS1
CVTRSV02 EQU   CVTFLGS1
CVTRSV01 EQU   CVTFLGS1
CVTDMPLK EQU   CVTFLGS1
CVTXITP  EQU   CVTMAP+68
CVTZDTAB EQU   CVTMAP+64
CVTMSLT  EQU   CVTMAP+60
CVTDATE  EQU   CVTMAP+56
CVTBTERM EQU   CVTMAP+52
CVTSYSAD EQU   CVTMAP+48
CVTXTLER EQU   CVTMAP+44
CVTILK2  EQU   CVTMAP+40
CVTILK1  EQU   CVTMAP+36
CVTPRLTV EQU   CVTMAP+32
CVTPCNVT EQU   CVTMAP+28
CVT0VL00 EQU   CVTMAP+24
CVTXAPG  EQU   CVTMAP+20
CVTBUF   EQU   CVTMAP+16
CVTJOB   EQU   CVTMAP+12
CVTLINK  EQU   CVTMAP+8
CVT0EF00 EQU   CVTMAP+4
CVTTCBP  EQU   CVTMAP
CVT      EQU   CVTMAP
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS
@RT00281 EQU   #DC00013
@RC00284 EQU   @RC00283
@ENDDATA EQU   *
         END   ISTINCDP,(C'PLS1819',0603,75230)
