SVTM     TITLE 'IKTIST00, LOSTERM EXIT SCHEDULER'
IKTIST00 CSECT ,                                                01S0001
@MAINENT DS    0H                                               01S0001
         USING *,@15                                            01S0001
         B     @PROLOG                                          01S0001
         DC    AL1(16)                                          01S0001
         DC    C'IKTIST00  78.336'                              01S0001
         DROP  @15
@PROLOG  STM   @14,@12,12(@13)                                  01S0001
         BALR  @12,0                                            01S0001
@PSTART  DS    0H                                               01S0001
         USING @PSTART,@12                                      01S0001
         PRINT OFF
         PRINT ON
*   DO;                             /* REQSTORE CBID(UECB)CLEAR(YES)S
*                                      AVE(NO)PRIORITY(YES)          */
*                                                               01S0122
*/* ATBUILD (ISTDYPAB,ISTATCVT,ISTRPH)                               */
*/* END OF ATBUILD                                                   */
*                                                               01S0122
*     DO;                                                       01S0122
*     END;                                                      01S0123
*     DO;                                                       01S0124
*       RFY                                                     01S0125
*        (GPR02P,                                               01S0125
*         GPR03P,                                               01S0125
*         GPR04P,                                               01S0125
*         GPR15P) RSTD;                                         01S0125
*     END;                                                      01S0126
*     DO;                           /* LISATCVT                 01S0127
*                                      CVTBASE(PAGEABLE,(GPR15P))    */
*       GPR15P=ATCLCPTR;            /* SET UP ATCVT POINTER          */
         L     GPR15P,ATCLCPTR                                  01S0128
*     END;                          /* LISATCVT                      */
*     GPR02P=GPR15P->ATCBPDA×'80000000'X;                       01S0130
         L     GPR02P,ATCBPDA(,GPR15P)                          01S0130
         O     GPR02P,@CF01163                                  01S0130
*     DCL                                                       01S0131
*       1 FMZA0002 FIXED(31) STATIC LOCAL,                      01S0131
*        2 * FIXED(8) INIT(208),                                01S0131
*        2 * PTR(24) INIT(0);                                   01S0131
*     GPR03F=FMZA0002;                                          01S0132
         L     GPR03F,FMZA0002                                  01S0132
*     GPR04F=17;                                                01S0133
         LA    GPR04F,17                                        01S0133
*     GPR15P=GPR15P->ATCSMRQ;                                   01S0134
         L     GPR15P,ATCSMRQ(,GPR15P)                          01S0134
*     DCL                                                       01S0135
*       FMZL0002 BASED(GPR15P) LABEL VALUERANGE(*);             01S0135
*     CALL FMZL0002;                                            01S0136
         BALR  @14,@15                                          01S0136
*     DO;                                                       01S0137
*       RFY                                                     01S0138
*        (GPR02P,                                               01S0138
*         GPR03P,                                               01S0138
*         GPR04P,                                               01S0138
*         GPR15P) UNRSTD;                                       01S0138
*     END;                                                      01S0139
*   END;                            /* REQSTORE                      */
*   IF RETCDE<8 THEN                /* IF STORAGE IS AVAILABLE       */
         C     RETCDE,@CF00037                                  01S0141
         BNL   @RF00141                                         01S0141
*     DO;                                                       01S0142
*       UECBPTR=STORADDR;           /* SAVE UECB ADDRESS             */
         LR    UECBPTR,STORADDR                                 01S0143
*       DO;                         /* REQSTORE CBID(VRPL)SAVE(NO)PRI
*                                      ORITY(YES)                    */
*                                                               01S0145
*/* ATBUILD (ISTDYPAB,ISTATCVT,ISTRPH)                               */
*/* END OF ATBUILD                                                   */
*                                                               01S0145
*         DO;                                                   01S0145
*         END;                                                  01S0146
*         DO;                                                   01S0147
*           RFY                                                 01S0148
*            (GPR02P,                                           01S0148
*             GPR03P,                                           01S0148
*             GPR04P,                                           01S0148
*             GPR15P) RSTD;                                     01S0148
*         END;                                                  01S0149
*         DO;                       /* LISATCVT                 01S0150
*                                      CVTBASE(PAGEABLE,(GPR15P))    */
*           GPR15P=ATCLCPTR;        /* SET UP ATCVT POINTER          */
         L     GPR15P,ATCLCPTR                                  01S0151
*         END;                      /* LISATCVT                      */
*         GPR02P=GPR15P->ATCBPDA×'80000000'X;                   01S0153
         L     GPR02P,ATCBPDA(,GPR15P)                          01S0153
         O     GPR02P,@CF01163                                  01S0153
*         DCL                                                   01S0154
*           1 FMZA0023 FIXED(31) STATIC LOCAL,                  01S0154
*            2 * FIXED(8) INIT(80),                             01S0154
*            2 * PTR(24) INIT(0);                               01S0154
*         GPR03F=FMZA0023;                                      01S0155
         L     GPR03F,FMZA0023                                  01S0155
*         GPR04F=33;                                            01S0156
         LA    GPR04F,33                                        01S0156
*         GPR15P=GPR15P->ATCSMRQ;                               01S0157
         L     GPR15P,ATCSMRQ(,GPR15P)                          01S0157
*         DCL                                                   01S0158
*           FMZL0023 BASED(GPR15P) LABEL VALUERANGE(*);         01S0158
*         CALL FMZL0023;                                        01S0159
         BALR  @14,@15                                          01S0159
*         DO;                                                   01S0160
*           RFY                                                 01S0161
*            (GPR02P,                                           01S0161
*             GPR03P,                                           01S0161
*             GPR04P,                                           01S0161
*             GPR15P) UNRSTD;                                   01S0161
*         END;                                                  01S0162
*       END;                        /* REQSTORE                      */
*       IF RETCDE<8 THEN            /* IF STORAGE IS AVAILABLE       */
         C     RETCDE,@CF00037                                  01S0164
         BNL   @RF00164                                         01S0164
*         DO;                                                   01S0165
*           RFY                                                 01S0166
*             STORADDR RSTD;                                    01S0166
*           VRPLPTR=STORADDR;       /* SAVE VRPL ADDRESS             */
         LR    VRPLPTR,STORADDR                                 01S0167
*           RFY                                                 01S0168
*             STORADDR UNRSTD;                                  01S0168
*                                                               02S0169
*           /*********************************************************/
*           /*                                                       */
*           /* SEGMENT UECBINIT- INITIALIZE THE UECB                 */
*           /*                                                       */
*           /*********************************************************/
*                                                               02S0169
*           DO;                                                 02S0169
*             UECID=UEID;           /* SET ID                        */
         MVI   UECID(UECBPTR),X'10'                             02S0170
*             UECLEN=LENGTH(ISTUECB);/* SET LENGTH                   */
         MVI   UECLEN(UECBPTR),X'54'                            02S0171
*             UECTYPE=UECLOGOF;     /* SET EXIT ID                   */
         MVI   UECTYPE(UECBPTR),X'09'                           02S0172
*             UECTSKID=ACDTSKID;    /* GET TASK ID                   */
         L     @14,PSAAOLD                                      02S0173
         L     @14,ASCBASXB(,@14)                               02S0173
         L     @14,ASXBMPST(,@14)                               02S0173
         L     @14,MPSDBTBL(,@14)                               02S0173
         L     @14,DCEDBPTR(,@14)                               02S0173
         L     @10,ACDTSKID(,@14)                               02S0173
         ST    @10,UECTSKID(,UECBPTR)                           02S0173
*             UECEXLST=ACBEXLST;    /* GET EXIT LIST POINTER         */
         L     @14,ACDACB(,@14)                                 02S0174
         L     @10,ACBEXLST(,@14)                               02S0174
         ST    @10,UECEXLST(,UECBPTR)                           02S0174
*             PABOFFST=ADDR(UECPAB)-ADDR(ISTUECB);/* GET PAB OFFSET  */
         LA    @10,16                                           02S0175
         ALR   @10,UECBPTR                                      02S0175
         MVI   PABOFFST(@10),X'10'                              02S0175
*             PABDVTA=ADDR(UECDVTPT);/* GET DVT ADDRESS              */
         LA    @03,UECDVTPT(,UECBPTR)                           02S0176
         STCM  @03,7,PABDVTA(@10)                               02S0176
*             PABAPYP='1'B;         /* SET USER EXIT FLAG            */
         OI    PABAPYP(@10),B'10000000'                         02S0177
*             UECACB=ACDACB;        /* GET ACB ADDRESS               */
         ST    @14,UECACB(,UECBPTR)                             02S0178
*             UECNDID=RPLARG;       /* COPY CID FROM RPL             */
         L     @14,RPLARG(,PTRRPL)                              02S0179
         ST    @14,UECNDID(,UECBPTR)                            02S0179
*             UECUSFLD=VRPLPTR;     /* ADDRESS OF COPIED RPL         */
         ST    VRPLPTR,UECUSFLD(,UECBPTR)                       02S0180
*             UECRSNBT=1;           /* UECB REASON CODE= TSO LOSTERM */
         MVI   UECRSNBT(UECBPTR),X'01'                          02S0181
*             UECVRPL=VRPLPTR;      /* ADDRESS OF COPIED RPL         */
         ST    VRPLPTR,UECVRPL(,UECBPTR)                        02S0182
*             UECDVTPT=ATCUEP;      /* GET EXIT INTERFACE ADDRESS    */
         L     @14,ATCLCPTR                                     02S0183
         L     @10,ATCUEP(,@14)                                 02S0183
         ST    @10,UECDVTPT(,UECBPTR)                           02S0183
*           END;                                                02S0184
*           VRPLPTR->IFGRPL=IFGRPL; /* COPY RPL TO VRPL              */
         MVC   IFGRPL(112,VRPLPTR),IFGRPL(PTRRPL)               01S0185
*           VRPLPTR->RPLAREA=0;     /* CLEAR AREA POINTER    @ZM42851*/
         SLR   @10,@10                                          01S0186
         ST    @10,RPLAREA(,VRPLPTR)                            01S0186
*           DO;                     /* TPQUE (UECBPTR,UECPAB) NORM
*                                      NSTR                          */
*             DO;                                               01S0188
*               RFY                                             01S0189
*                (GPR00P,                                       01S0189
*                 GPR01P,                                       01S0189
*                 GPR04P,                                       01S0189
*                 GPR05P,                                       01S0189
*                 GPR15P) RSTD;                                 01S0189
*             END;                                              01S0190
*             GPR00P=0;                                         01S0191
         SLR   GPR00P,GPR00P                                    01S0191
*             GPR15P=ADDR(UECPAB);                              01S0192
         LA    GPR15P,UECPAB(,UECBPTR)                          01S0192
*             GPR04P=UECBPTR;       /* WORK ELE PTR                  */
         LR    GPR04P,UECBPTR                                   01S0193
*             GPR05P=GPR15P;        /* PASS PAB PTR                  */
         LR    GPR05P,GPR15P                                    01S0194
*             CALL ATCLCPTR->ATCAP37->ISTAPC37;                 01S0195
         L     @15,ATCAP37(,@14)                                01S0195
         BALR  @14,@15                                          01S0195
*             GEN(DC BL2'01000')                                01S0196
*             NOSETS NOREFS;                                    01S0196
         DC BL2'01000'
*             DO;                                               01S0197
*               RFY                                             01S0198
*                (GPR00P,                                       01S0198
*                 GPR01P,                                       01S0198
*                 GPR04P,                                       01S0198
*                 GPR05P,                                       01S0198
*                 GPR15P) UNRSTD;                               01S0198
*             END;                                              01S0199
*           END;                    /* TPQUE SCHEDULE USER EXIT      */
*           RETCDE=0;               /* INDICATE THAT UECB/VRPL WAS
*                                      BUILT LOSTERM WAS SCHEDULED   */
         SLR   RETCDE,RETCDE                                    01S0201
*         END;                                                  01S0202
*       ELSE                                                    01S0203
*         DO;                                                   01S0203
         B     @RC00164                                         01S0203
@RF00164 DS    0H                                               01S0204
*           DO;                     /* RELSTORE                 01S0204
*                                      BUFADDR(UECBPTR)SAVE(NO)      */
*                                                               01S0205
*             /*******************************************************/
*             /*                                                     */
*             /* RELSTORE BUFADDR(UECBPTR)SAVE(NO)                   */
*             /*                                                     */
*             /*******************************************************/
*                                                               01S0205
*             DO;                                               01S0205
*                                                               01S0205
*/* ATBUILD (ISTATCVT,ISTRPH)                                        */
*/* END OF ATBUILD                                                   */
*                                                               01S0206
*               DO;                                             01S0206
*               END;                                            01S0207
*               DO;                                             01S0208
*                 RFY                                           01S0209
*                  (GPR02P,                                     01S0209
*                   GPR03P,                                     01S0209
*                   GPR04P,                                     01S0209
*                   GPR15P) RSTD;                               01S0209
*               END;                                            01S0210
*               GPR04P=UECBPTR;                                 01S0211
         LR    GPR04P,UECBPTR                                   01S0211
*               DCL                                             01S0212
*                 1 FMZA0055 FIXED(31) STATIC LOCAL,            01S0212
*                  2 * FIXED(8) INIT(0),                        01S0212
*                  2 * PTR(24) INIT(0);                         01S0212
*               GPR03F=FMZA0055;                                01S0213
         L     GPR03F,FMZA0055                                  01S0213
*               DO;                 /* LISATCVT                 01S0214
*                                      CVTBASE(PAGEABLE,(GPR15P))    */
*                 GPR15P=ATCLCPTR;  /* SET UP ATCVT POINTER          */
         L     GPR15P,ATCLCPTR                                  01S0215
*               END;                /* LISATCVT                      */
*               GPR02P=GPR15P->ATCBPDA;                         01S0217
         L     GPR02P,ATCBPDA(,GPR15P)                          01S0217
*               GPR15P=GPR15P->ATCSMRS;                         01S0218
         L     GPR15P,ATCSMRS(,GPR15P)                          01S0218
*               DCL                                             01S0219
*                 FMZL0055 BASED(GPR15P) LABEL VALUERANGE(*);   01S0219
*               CALL FMZL0055;                                  01S0220
         BALR  @14,@15                                          01S0220
*               DO;                                             01S0221
*                 RFY                                           01S0222
*                  (GPR02P,                                     01S0222
*                   GPR03P,                                     01S0222
*                   GPR04P,                                     01S0222
*                   GPR15P) UNRSTD;                             01S0222
*               END;                                            01S0223
*             END;                                              01S0224
*           END;                    /* RELSTORE RETURN UECB STG      */
*           RETCDE=4;               /* INDICATE THAT UECB/VRPL WAS
*                                      NOT BUILT LOSTERM NOT    01S0226
*                                      SCHEDULED                     */
         LA    RETCDE,4                                         01S0226
*         END;                                                  01S0227
*     END;                                                      01S0228
*   ELSE                                                        01S0229
*     RETCDE=4;                     /* INDICATE THAT UECB/VRPL WAS
*                                      NOT BUILT LOSTERM NOT    01S0229
*                                      SCHEDULED                     */
         B     @RC00141                                         01S0229
@RF00141 LA    RETCDE,4                                         01S0229
*   RETURN CODE(RETCDE);            /* RETURN TO CALLER              */
@RC00141 L     @14,12(,@13)                                     01S0230
         LM    @00,@12,20(@13)                                  01S0230
         BR    @14                                              01S0230
*   DO;                             /* TPEPILOG                      */
*     GEN(PRINT OFF);                                           01S0232
         PRINT OFF
*     DO;                                                       01S0233
*       DCL                                                     01S0234
*         GPR00F FIXED(31) REG(00),                             01S0234
*         GPR00P PTR(31) REG(00),                               01S0234
*         GPR01F FIXED(31) REG(01),                             01S0234
*         GPR01P PTR(31) REG(01),                               01S0234
*         GPR02F FIXED(31) REG(02),                             01S0234
*         GPR02P PTR(31) REG(02),                               01S0234
*         GPR03F FIXED(31) REG(03),                             01S0234
*         GPR03P PTR(31) REG(03),                               01S0234
*         GPR04F FIXED(31) REG(04),                             01S0234
*         GPR04P PTR(31) REG(04),                               01S0234
*         GPR05F FIXED(31) REG(05),                             01S0234
*         GPR05P PTR(31) REG(05),                               01S0234
*         GPR06F FIXED(31) REG(06),                             01S0234
*         GPR06P PTR(31) REG(06),                               01S0234
*         GPR07F FIXED(31) REG(07),                             01S0234
*         GPR07P PTR(31) REG(07),                               01S0234
*         GPR08F FIXED(31) REG(08),                             01S0234
*         GPR08P PTR(31) REG(08),                               01S0234
*         GPR09F FIXED(31) REG(09),                             01S0234
*         GPR09P PTR(31) REG(09),                               01S0234
*         GPR10F FIXED(31) REG(10),                             01S0234
*         GPR10P PTR(31) REG(10),                               01S0234
*         GPR11F FIXED(31) REG(11),                             01S0234
*         GPR11P PTR(31) REG(11),                               01S0234
*         GPR12F FIXED(31) REG(12),                             01S0234
*         GPR12P PTR(31) REG(12),                               01S0234
*         GPR13F FIXED(31) REG(13),                             01S0234
*         GPR13P PTR(31) REG(13),                               01S0234
*         GPR14F FIXED(31) REG(14),                             01S0234
*         GPR14P PTR(31) REG(14),                               01S0234
*         GPR15F FIXED(31) REG(15),                             01S0234
*         GPR15P PTR(31) REG(15);                               01S0234
*     END;                                                      01S0235
*     DO;                                                       01S0236
*       DCL                                                     01S0237
*         ISTAPC34 ENTRY BASED(ATCAP34) VALRG(*);/* RESET ROUTINE    */
*       DCL                                                     01S0238
*         ISTAPC37 ENTRY BASED(ATCAP37) VALRG(*);/* TPQUE ROUTINE    */
*     END;                                                      01S0239
*     GEN(PRINT ON);                                            01S0240
         PRINT ON
*   END;                            /* TPEPILOG                      */
*   END IKTIST00                                                01S0242
*                                                               01S0242
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */
*/*%INCLUDE SYSUT5  (PROLOG  )                                       */
*/*%INCLUDE SYSUT5  (IKTIST00)                                       */
*/*%INCLUDE SYSLIB  (IFGRPL  )                                       */
*/*%INCLUDE SYSLIB  (IFGRPLVT)                                       */
*/*%INCLUDE SYSLIB  (ISTRPLFB)                                       */
*/*%INCLUDE SYSLIB  (IFGACB  )                                       */
*/*%INCLUDE SYSLIB  (IFGACBVT)                                       */
*/*%INCLUDE SYSLIB  (IFGEXLST)                                       */
*/*%INCLUDE SYSLIB  (IFGEXLVT)                                       */
*/*%INCLUDE SYSLIB  (IHAPSA  )                                       */
*/*%INCLUDE SYSLIB  (IHAASCB )                                       */
*/*%INCLUDE SYSLIB  (IHAASXB )                                       */
*/*%INCLUDE SYSLIB  (IHASRB  )                                       */
*/*%INCLUDE SYSUT5  (UECBINIT)                                       */
*                                                               01S0242
*       ;                                                       01S0242
@EL00001 DS    0H                                               01S0242
@EF00001 DS    0H                                               01S0242
@ER00001 LM    @14,@12,12(@13)                                  01S0242
         BR    @14                                              01S0242
@DATA    DS    0H
@DATD    DSECT
         DS    0F
IKTIST00 CSECT
         DS    0F
@CF00037 DC    F'8'
@CF01163 DC    XL4'80000000'
@DATD    DSECT
         DS    0D
@ENDDATD EQU   *
IKTIST00 CSECT
         NOPR  ((@ENDDATD-@DATD)*16)
         DS    0F
@SIZDATD DC    AL1(0)
         DC    AL3(@ENDDATD-@DATD)
         DS    0D
FMZA0002 DS    FL4
         ORG   FMZA0002
@NM00145 DC    AL1(208)
@NM00146 DC    AL3(0)
         ORG   FMZA0002+4
FMZA0023 DS    FL4
         ORG   FMZA0023
@NM00147 DC    AL1(80)
@NM00148 DC    AL3(0)
         ORG   FMZA0023+4
FMZA0055 DS    FL4
         ORG   FMZA0055
@NM00149 DC    AL1(0)
@NM00150 DC    AL3(0)
         ORG   FMZA0055+4
@00      EQU   00                      EQUATES FOR REGISTERS 0-15
@01      EQU   01
@02      EQU   02
@03      EQU   03
@04      EQU   04
@05      EQU   05
@06      EQU   06
@07      EQU   07
@08      EQU   08
@09      EQU   09
@10      EQU   10
@11      EQU   11
@12      EQU   12
@13      EQU   13
@14      EQU   14
@15      EQU   15
VRPLPTR  EQU   @02
RPHPTR   EQU   @01
PTRRPL   EQU   @01
STORADDR EQU   @03
RETCDE   EQU   @15
UECBPTR  EQU   @11
GPR02P   EQU   @02
GPR03P   EQU   @03
GPR04P   EQU   @04
GPR15P   EQU   @15
GPR03F   EQU   @03
GPR04F   EQU   @04
GPR00P   EQU   @00
GPR01P   EQU   @01
GPR05P   EQU   @05
GPR00F   EQU   @00
GPR01F   EQU   @01
GPR02F   EQU   @02
GPR05F   EQU   @05
GPR06F   EQU   @06
GPR06P   EQU   @06
GPR07F   EQU   @07
GPR07P   EQU   @07
GPR08F   EQU   @08
GPR08P   EQU   @08
GPR09F   EQU   @09
GPR09P   EQU   @09
GPR10F   EQU   @10
GPR10P   EQU   @10
GPR11F   EQU   @11
GPR11P   EQU   @11
GPR12F   EQU   @12
GPR12P   EQU   @12
GPR13F   EQU   @13
GPR13P   EQU   @13
GPR14F   EQU   @14
GPR14P   EQU   @14
GPR15F   EQU   @15
PSA      EQU   0
FLCRNPSW EQU   PSA
FLCROPSW EQU   PSA+8
FLCICCW2 EQU   PSA+16
PSAEEPSW EQU   PSA+132
PSAESPSW EQU   PSA+136
FLCSVILC EQU   PSAESPSW+1
PSAEPPSW EQU   PSA+140
FLCPIILC EQU   PSAEPPSW+1
FLCPICOD EQU   PSAEPPSW+2
PSAPICOD EQU   FLCPICOD+1
FLCTEA   EQU   PSAEPPSW+4
FLCPER   EQU   PSA+152
FLCMCLA  EQU   PSA+168
FLCIOEL  EQU   FLCMCLA+4
FLCIOA   EQU   FLCMCLA+16
FLCFSA   EQU   FLCMCLA+80
PSAAOLD  EQU   PSA+548
PSASUPER EQU   PSA+552
PSASUP1  EQU   PSASUPER
PSASUP2  EQU   PSASUPER+1
PSASUP3  EQU   PSASUPER+2
PSASUP4  EQU   PSASUPER+3
PSACLHT  EQU   PSA+640
PSALKSA  EQU   PSA+696
PSAHLHI  EQU   PSA+760
PSADSSFL EQU   PSA+836
PSADSSF1 EQU   PSADSSFL
PSADSSF3 EQU   PSADSSFL+2
PSADSSF4 EQU   PSADSSFL+3
PSARSVT  EQU   PSA+896
ATCLCPTR EQU   1032
IFGRPL   EQU   0
RPLCOMN  EQU   IFGRPL
RPLIDWD  EQU   RPLCOMN
RPLLEN   EQU   RPLIDWD+3
RPLECB   EQU   RPLCOMN+8
RPLEXITP EQU   RPLECB
RPLFDBWD EQU   RPLCOMN+12
RPLFDBK  EQU   RPLFDBWD+1
RPLRTNCD EQU   RPLFDBK
RPLCNDCD EQU   RPLFDBK+1
RPLCMPON EQU   RPLCNDCD
RPLFDB2  EQU   RPLCMPON
RPLERRCD EQU   RPLCNDCD+1
RPLFDB3  EQU   RPLERRCD
RPLKEYLE EQU   RPLCOMN+16
RPLAREA  EQU   RPLCOMN+32
RPLARG   EQU   RPLCOMN+36
RPLOPTCD EQU   RPLCOMN+40
RPLOPT1  EQU   RPLOPTCD
RPLECBSW EQU   RPLOPT1
RPLOPT2  EQU   RPLOPTCD+1
RPLADR   EQU   RPLOPT2
RPLOPT3  EQU   RPLOPTCD+2
RPLOPT4  EQU   RPLOPTCD+3
RPLNXTRP EQU   RPLCOMN+44
RPLOPTC2 EQU   RPLCOMN+56
RPLOPT5  EQU   RPLOPTC2
RPLWRTYP EQU   RPLOPT5
RPLOPT6  EQU   RPLOPTC2+1
RPLUNTYP EQU   RPLOPT6
RPLOPT7  EQU   RPLOPTC2+2
RPLCNOPT EQU   RPLOPT7
RPLOPT8  EQU   RPLOPTC2+3
RPLRBAR  EQU   RPLCOMN+60
RPLAIXID EQU   RPLRBAR+2
RPLEXTDS EQU   RPLCOMN+68
RPLEXTD1 EQU   RPLEXTDS
RPLVTEXT EQU   IFGRPL+76
RPLFDBK2 EQU   RPLVTEXT+12
RPLSSNSI EQU   RPLFDBK2
RPLDSB   EQU   RPLSSNSI
RPLDSB1  EQU   RPLDSB
RPLSSEI  EQU   RPLDSB1
RPLDSB2  EQU   RPLDSB+1
RPLUSNSI EQU   RPLFDBK2+2
RPLOPTC3 EQU   RPLVTEXT+20
RPLOPT9  EQU   RPLOPTC3
RPLOPT10 EQU   RPLOPTC3+1
RPLOPT11 EQU   RPLOPTC3+2
RPLOPT12 EQU   RPLOPTC3+3
RPLOSENS EQU   RPLVTEXT+24
RPLSSNSO EQU   RPLOSENS
RPLSSEO  EQU   RPLSSNSO
RPLOF16  EQU   0
RPLRH3   EQU   RPLOF16
RPLSRTYP EQU   RPLOF16+1
RPLSTYPE EQU   RPLSRTYP
RPLRTYPE EQU   RPLSRTYP
RPLCHN   EQU   RPLOF16+2
RPLVTFL1 EQU   RPLOF16+3
RPLVTFL2 EQU   RPLOF16+4
RPLPOSTV EQU   RPLVTFL2
RPLRESP  EQU   RPLVTFL2
RPLCNTRL EQU   RPLOF16+5
RPLCNTDF EQU   RPLCNTRL
RPLCNTDC EQU   RPLCNTRL+1
RPLCNTSC EQU   RPLCNTRL+2
RPLOF60  EQU   0
RPLOBSQ  EQU   RPLOF60+4
RPLIBSQ  EQU   RPLOF60+5
IFGACB   EQU   0
ACBCOMN  EQU   IFGACB
ACBLENG  EQU   ACBCOMN+2
ACBLENG2 EQU   ACBLENG
ACBAMBL  EQU   ACBCOMN+4
ACBJWA   EQU   ACBAMBL
ACBIBCT  EQU   ACBJWA
ACBMACRF EQU   ACBCOMN+12
ACBMACR1 EQU   ACBMACRF
ACBADR   EQU   ACBMACR1
ACBCNV   EQU   ACBMACR1
ACBMACR2 EQU   ACBMACRF+1
ACBBUFPL EQU   ACBCOMN+20
ACBMACR3 EQU   ACBBUFPL
ACBRECFM EQU   ACBCOMN+24
ACBCCTYP EQU   ACBCOMN+25
ACBOPT   EQU   ACBCOMN+26
ACBDSORG EQU   ACBOPT
ACBDSOR1 EQU   ACBDSORG
ACBCROPS EQU   ACBDSOR1
ACBDVIND EQU   ACBDSOR1
ACBDSOR2 EQU   ACBDSORG+1
ACBEXLST EQU   ACBCOMN+36
ACBDDNM  EQU   ACBCOMN+40
ACBAMETH EQU   ACBDDNM+3
ACBOFLGS EQU   ACBCOMN+48
ACBEXFG  EQU   ACBOFLGS
ACBIOSFG EQU   ACBOFLGS
ACBINFLG EQU   ACBCOMN+50
ACBINFL1 EQU   ACBINFLG
ACBVVIC  EQU   ACBINFL1
ACBINFL2 EQU   ACBINFLG+1
ACBUJFCB EQU   ACBCOMN+52
ACBBLKSZ EQU   ACBCOMN+60
ACBAPID  EQU   ACBCOMN+72
ACBVTEXT EQU   IFGACB+76
IFGEXLST EQU   0
EXLCOMN  EQU   IFGEXLST
EXLLEN   EQU   EXLCOMN+2
EXLEODF  EQU   EXLCOMN+5
EXLSYNF  EQU   EXLCOMN+10
EXLLERF  EQU   EXLCOMN+15
EXLSCIPF EQU   EXLCOMN+20
EXLUPADF EQU   EXLSCIPF
EXLSCIPS EQU   EXLUPADF
EXLSCIPA EQU   EXLUPADF
EXLSCIPK EQU   EXLUPADF
EXLSCIPP EQU   EXLCOMN+21
EXLLGNF  EQU   EXLCOMN+25
EXLJRNF  EQU   EXLCOMN+30
EXLOPNF  EQU   EXLCOMN+35
EXLVTEXT EQU   IFGEXLST+40
EXLNLGNF EQU   EXLVTEXT
EXLRLRQF EQU   EXLVTEXT+5
EXLATTNF EQU   EXLVTEXT+15
EXLTPNDF EQU   EXLVTEXT+20
EXLTNSEF EQU   EXLVTEXT+25
EXLDFAS  EQU   0
EXLDFASF EQU   EXLDFAS
EXLRESP  EQU   0
EXLRESPF EQU   EXLRESP
IFGEXLEF EQU   0
EXLENTRY EQU   IFGEXLEF
EXLFLAG  EQU   EXLENTRY
EXLENFL  EQU   EXLFLAG
EXLEXITP EQU   EXLENTRY+1
ASCB     EQU   0
ASCBSUPC EQU   ASCB+16
ASCBFW1  EQU   ASCB+100
ASCBRCTF EQU   ASCBFW1+2
ASCBFLG1 EQU   ASCBFW1+3
ASCBASXB EQU   ASCB+108
ASCBDSP1 EQU   ASCB+114
ASCBFLG2 EQU   ASCB+115
ASCBLKGP EQU   ASCB+128
ASCBSRQ  EQU   ASCB+180
ASCBSRQ1 EQU   ASCBSRQ
ASCBSRQ2 EQU   ASCBSRQ+1
ASCBSRQ3 EQU   ASCBSRQ+2
ASCBSRQ4 EQU   ASCBSRQ+3
ASXB     EQU   0
ASXBMPST EQU   ASXB+16
ASXBAEQ  EQU   ASXB+168
ASXBCASW EQU   ASXB+216
ASXBCRB1 EQU   ASXBCASW
SRBSECT  EQU   0
SRBFLC   EQU   SRBSECT+12
ISTLOK   EQU   0
LOKCHN   EQU   ISTLOK+1
LOKCHNG  EQU   LOKCHN
@NM00083 EQU   LOKCHNG+2
ISTPAB   EQU   0
PABWQCHN EQU   ISTPAB
PABWEQA  EQU   PABWQCHN
PABCHAIN EQU   PABWQCHN+4
PABRUNNG EQU   PABCHAIN
PABOFFST EQU   ISTPAB+8
PABDVTA  EQU   ISTPAB+9
PABRPHFG EQU   ISTPAB+12
PABFLAGS EQU   PABRPHFG
PABAPYP  EQU   PABFLAGS
PABERLCK EQU   PABFLAGS
PABERRLK EQU   PABERLCK
PABEND   EQU   ISTPAB+16
ISTACDEB EQU   0
ACDTSKID EQU   ISTACDEB+8
ACDANYQ  EQU   ISTACDEB+48
ACDACB   EQU   ISTACDEB+64
ACDLUFLG EQU   ISTACDEB+102
ISTDYPAB EQU   0
DYPCHAIN EQU   ISTDYPAB+4
DYPPACMD EQU   ISTDYPAB+12
ISTRPH   EQU   0
RPHCNTL  EQU   ISTRPH
RPHFLAGS EQU   RPHCNTL+2
RPHFSTLC EQU   RPHFLAGS
RPHFLGB  EQU   RPHCNTL+3
RPHRPHA  EQU   ISTRPH+4
RPHTSKID EQU   ISTRPH+8
RPHRESMA EQU   ISTRPH+16
RPHWPFLG EQU   RPHRESMA
RPHWEA   EQU   ISTRPH+24
RPHCSPA  EQU   RPHWEA
RPHSRPRM EQU   ISTRPH+28
RPHPABQA EQU   ISTRPH+36
RPHWORK  EQU   ISTRPH+40
RPHSAVE1 EQU   RPHWORK
RPHSBITS EQU   RPHSAVE1+1
ISTATCVT EQU   0
ATCRPTCH EQU   ISTATCVT
ATCITFLD EQU   ISTATCVT+8
ATCITCDS EQU   ATCITFLD+8
ATCITFLG EQU   ATCITCDS+4
ATCITRA1 EQU   ATCITFLG+2
ATCSMPAB EQU   ISTATCVT+88
ATCVDPAB EQU   ISTATCVT+152
ATCLDTIL EQU   ISTATCVT+408
ATCGTSTR EQU   ISTATCVT+608
ATCSMRQ  EQU   ISTATCVT+620
ATCSMRS  EQU   ISTATCVT+624
ATCLUDVT EQU   ISTATCVT+768
ATCANYDT EQU   ISTATCVT+776
@NM00095 EQU   ISTATCVT+780
ATCPODVT EQU   ISTATCVT+804
ATCUEP   EQU   ISTATCVT+844
ATCBPDA  EQU   ISTATCVT+856
ATCSTAT  EQU   ISTATCVT+936
ATCSTAT1 EQU   ATCSTAT
ATCPOFLG EQU   ATCSTAT+2
ATCSTAT4 EQU   ATCSTAT+3
ATCBITAN EQU   ISTATCVT+940
ATCFLAG2 EQU   ATCBITAN+1
ATCONID  EQU   ISTATCVT+944
ATCSSCPA EQU   ISTATCVT+948
ATCHPGM  EQU   ISTATCVT+1012
ATCVLCNT EQU   ISTATCVT+1016
ATCRNO   EQU   ISTATCVT+1020
@NM00118 EQU   ISTATCVT+1028
ATCSHRFG EQU   @NM00118+8
ATCCPDVT EQU   ISTATCVT+1096
ATCSMSDQ EQU   ISTATCVT+1140
ATCRID   EQU   ISTATCVT+1152
ATCLDAPP EQU   ISTATCVT+1288
ATCSQAFR EQU   ISTATCVT+1312
ATCORTCB EQU   ATCSQAFR+4
ATCORSRB EQU   ATCORTCB
ATCICAPP EQU   ISTATCVT+1320
ATCDAPVT EQU   ISTATCVT+1340
ATCAP34  EQU   ISTATCVT+1380
ATCAP37  EQU   ISTATCVT+1384
ATCGSRBQ EQU   ISTATCVT+1472
ATCGSRBG EQU   ATCGSRBQ
ATCENFLG EQU   ISTATCVT+1512
@NM00133 EQU   ISTATCVT+1575
ATCVTFLG EQU   ISTATCVT+1576
ATCZFLAG EQU   ISTATCVT+1696
ATCCRA   EQU   ISTATCVT+1720
ATCCRACN EQU   ATCCRA+4
ATCSRB   EQU   ISTATCVT+1728
ATCSRBCN EQU   ATCSRB+4
ATCCRPL  EQU   ISTATCVT+1736
ATCRPLCN EQU   ATCCRPL+4
ISTUECB  EQU   0
UECID    EQU   ISTUECB
UECLEN   EQU   ISTUECB+1
UECTYPE  EQU   ISTUECB+3
UECTSKID EQU   ISTUECB+8
UECEXLST EQU   ISTUECB+12
UECPAB   EQU   ISTUECB+16
UECPLIST EQU   ISTUECB+32
UECACB   EQU   UECPLIST
UECNDID  EQU   UECPLIST+4
UECTPNCD EQU   UECNDID
UECREQTR EQU   UECPLIST+8
UECUSFLD EQU   UECREQTR
UECCPBND EQU   UECPLIST+12
UECDLEN  EQU   UECCPBND
UECRSNCD EQU   UECDLEN
UECRSNBT EQU   UECRSNCD+3
UECVRPL  EQU   UECPLIST+16
UECDVTPT EQU   ISTUECB+68
ISTMPST  EQU   0
MPSRSV07 EQU   ISTMPST+4
MPSRQFGA EQU   ISTMPST+8
MPSRQUE  EQU   MPSRQFGA
MPSFLGA  EQU   MPSRQFGA+4
MPSFLGAA EQU   MPSFLGA
MPSFLGAB EQU   MPSFLGA+1
MPSCRA   EQU   ISTMPST+24
MPSCRACT EQU   MPSCRA+4
MPSSRB   EQU   ISTMPST+32
MPSSRBCT EQU   MPSSRB+4
MPSCRPL  EQU   ISTMPST+40
MPSRPLCT EQU   MPSCRPL+4
MPSDBTBL EQU   ISTMPST+124
ISTDCE   EQU   0
DCEDBPTR EQU   ISTDCE
FMZL0002 EQU   0
FMZL0023 EQU   0
ISTAPC37 EQU   0
FMZL0055 EQU   0
ISTACB   EQU   0
ISTAPC34 EQU   0
ISTRPL   EQU   0
ISTXDYP  EQU   0
ISTXPAB  EQU   0
PSARSVTE EQU   PSARSVT
PABXTNSN EQU   PABEND
FLC      EQU   PSA
SRB      EQU   SRBSECT
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS
@NM00085 EQU   PABXTNSN+12
PABNPSSQ EQU   PABXTNSN+8
PABLOCK  EQU   PABXTNSN+4
PABLAST  EQU   PABXTNSN
PSARSAV  EQU   PSARSVTE+60
PSARSTK  EQU   PSARSVTE+56
PSAESAV3 EQU   PSARSVTE+52
PSAESTK3 EQU   PSARSVTE+48
PSAESAV2 EQU   PSARSVTE+44
PSAESTK2 EQU   PSARSVTE+40
PSAESAV1 EQU   PSARSVTE+36
PSAESTK1 EQU   PSARSVTE+32
PSAPSAV  EQU   PSARSVTE+28
PSAPSTK  EQU   PSARSVTE+24
PSAMSAV  EQU   PSARSVTE+20
PSAMSTK  EQU   PSARSVTE+16
PSASSAV  EQU   PSARSVTE+12
PSASSTK  EQU   PSARSVTE+8
PSANSTK  EQU   PSARSVTE+4
PSACSTK  EQU   PSARSVTE
DCERSV01 EQU   ISTDCE+12
DCETERM  EQU   ISTDCE+8
DCECHN   EQU   ISTDCE+4
MPSSRB1  EQU   ISTMPST+172
MPSSAVE  EQU   ISTMPST+140
MPSMQLBP EQU   ISTMPST+136
MPSSYSRT EQU   ISTMPST+132
MPSQEL   EQU   ISTMPST+128
MPSASCB  EQU   ISTMPST+120
MPSTPPAB EQU   ISTMPST+88
MPSSMPAB EQU   ISTMPST+56
MPSSMRPH EQU   ISTMPST+52
MPSSRB55 EQU   ISTMPST+48
MPSRPLAC EQU   MPSRPLCT+2
MPSRPLRC EQU   MPSRPLCT
MPSCRPLQ EQU   MPSCRPL
MPSSRBAC EQU   MPSSRBCT+2
MPSSRBRC EQU   MPSSRBCT
MPSSRBQ  EQU   MPSSRB
MPSCRAAC EQU   MPSCRACT+2
MPSCRARC EQU   MPSCRACT
MPSCRAQ  EQU   MPSCRA
MPSMPSTP EQU   ISTMPST+20
MPSPSTCT EQU   ISTMPST+16
MPSASID  EQU   MPSFLGA+2
MPSRMGOC EQU   MPSFLGAB
MPSPSTAB EQU   MPSFLGAA
MPSRSV01 EQU   MPSFLGAA
MPSTPBU  EQU   MPSFLGAA
MPMEMTRM EQU   MPSFLGAA
MPSAUTH  EQU   MPSFLGAA
MPSCRAO  EQU   MPSFLGAA
MPSSRBO  EQU   MPSFLGAA
MPSRQUEG EQU   MPSRQUE
MPSTSOIR EQU   MPSRSV07
MPSTSOIW EQU   MPSRSV07
MPSID    EQU   ISTMPST
UECSYMNM EQU   ISTUECB+76
UECLGDTA EQU   ISTUECB+72
UECREQNM EQU   ISTUECB+60
UECRVPT4 EQU   ISTUECB+56
UECLCID  EQU   UECPLIST+20
@NM00144 EQU   UECRSNCD
UECDAF   EQU   UECTPNCD+2
UECSAF   EQU   UECTPNCD
UECRPLAD EQU   UECACB
UECFORW  EQU   ISTUECB+4
UECRSV01 EQU   ISTUECB+2
ATCAOS   EQU   ISTATCVT+1868
@NM00143 EQU   ISTATCVT+1860
@NM00142 EQU   ISTATCVT+1852
@NM00141 EQU   ISTATCVT+1844
@NM00140 EQU   ISTATCVT+1836
@NM00139 EQU   ISTATCVT+1828
@NM00138 EQU   ISTATCVT+1820
@NM00137 EQU   ISTATCVT+1816
ATCCACSA EQU   ISTATCVT+1812
ATCMXCSA EQU   ISTATCVT+1808
ATCTPMPB EQU   ISTATCVT+1776
ATCTRMPB EQU   ISTATCVT+1744
ATCRPLAC EQU   ATCRPLCN+2
ATCRPLRC EQU   ATCRPLCN
ATCCRPLQ EQU   ATCCRPL
ATCSRBAC EQU   ATCSRBCN+2
ATCSRBRC EQU   ATCSRBCN
ATCSRBQ  EQU   ATCSRB
ATCCRAAC EQU   ATCCRACN+2
ATCCRARC EQU   ATCCRACN
ATCCRAQ  EQU   ATCCRA
ATCLUFFD EQU   ISTATCVT+1716
ATCVIOPM EQU   ISTATCVT+1712
ATCTPMMI EQU   ISTATCVT+1708
ATCPXSRB EQU   ISTATCVT+1704
ATCRPLCT EQU   ISTATCVT+1702
ATCCRACT EQU   ISTATCVT+1700
ATCSRBCT EQU   ISTATCVT+1698
ATCSTNSM EQU   ISTATCVT+1697
@NM00136 EQU   ATCZFLAG
ATCZF001 EQU   ATCZFLAG
ATCTPCP1 EQU   ISTATCVT+1692
ATCTPCP0 EQU   ISTATCVT+1688
ATCZR01  EQU   ISTATCVT+1684
ATCMPLTA EQU   ISTATCVT+1680
ATCASCB  EQU   ISTATCVT+1676
ATCAP86  EQU   ISTATCVT+1672
ATCAP85  EQU   ISTATCVT+1668
ATCAP84  EQU   ISTATCVT+1664
ATCAP83  EQU   ISTATCVT+1660
ATCAP82  EQU   ISTATCVT+1656
ATCAP69  EQU   ISTATCVT+1652
ATCAP66  EQU   ISTATCVT+1648
ATCAP62  EQU   ISTATCVT+1644
ATCAPC59 EQU   ISTATCVT+1640
ATCAP56  EQU   ISTATCVT+1636
ATCAP55  EQU   ISTATCVT+1632
ATCAP41  EQU   ISTATCVT+1628
ATCAPC25 EQU   ISTATCVT+1624
ATCAP23  EQU   ISTATCVT+1620
ATCAPBE  EQU   ISTATCVT+1616
ATCPSTA  EQU   ISTATCVT+1612
ATCSMABF EQU   ISTATCVT+1608
ATCSMAPR EQU   ISTATCVT+1604
ATCTPWQA EQU   ISTATCVT+1600
ATCSMAID EQU   ISTATCVT+1596
ATCSMARA EQU   ISTATCVT+1592
ATCCACXA EQU   ISTATCVT+1588
ATCATA10 EQU   ISTATCVT+1584
ATCHLTCB EQU   ISTATCVT+1580
@NM00135 EQU   ATCVTFLG
ATCVTACT EQU   ATCVTFLG
@NM00134 EQU   @NM00133
ATCVTMAB EQU   @NM00133
ATCVTBAM EQU   ISTATCVT+1572
@NM00132 EQU   ISTATCVT+1568
@NM00131 EQU   ISTATCVT+1520
ATCCCOOC EQU   ISTATCVT+1516
@NM00130 EQU   ISTATCVT+1513
ATCSNUF  EQU   ATCENFLG
ATCOPKL  EQU   ATCENFLG
ATCABEN  EQU   ATCENFLG
ATCSRDN  EQU   ATCENFLG
ATCDLDN  EQU   ATCENFLG
ATCTIMER EQU   ISTATCVT+1508
ATCAIWT  EQU   ISTATCVT+1504
ATCOROBT EQU   ISTATCVT+1500
ATCDMAPP EQU   ISTATCVT+1496
ATCZDVTX EQU   ISTATCVT+1492
ATCPXCRA EQU   ISTATCVT+1488
ATCICNCB EQU   ISTATCVT+1484
ATCCMTCB EQU   ISTATCVT+1480
ATCPRPH  EQU   ISTATCVT+1476
ATCGSRBF EQU   ATCGSRBG
ATCSRBRT EQU   ISTATCVT+1468
ATCTSCPC EQU   ISTATCVT+1464
@NM00129 EQU   ISTATCVT+1460
ATCCDTCB EQU   ISTATCVT+1456
ATCORFRL EQU   ISTATCVT+1452
ATCORFPX EQU   ISTATCVT+1448
ATCORFMG EQU   ISTATCVT+1444
ATCSMBQ  EQU   ISTATCVT+1440
ATCINFDD EQU   ISTATCVT+1436
ATCAP67  EQU   ISTATCVT+1432
ATCAP65  EQU   ISTATCVT+1428
ATCAP64  EQU   ISTATCVT+1424
ATCAP63  EQU   ISTATCVT+1420
ATCAP61  EQU   ISTATCVT+1416
ATCAP58  EQU   ISTATCVT+1412
ATCAP57  EQU   ISTATCVT+1408
ATCAP54  EQU   ISTATCVT+1404
ATCAP53  EQU   ISTATCVT+1400
ATCAP52  EQU   ISTATCVT+1396
ATCAP51  EQU   ISTATCVT+1392
ATCAP38  EQU   ISTATCVT+1388
ATCAP32  EQU   ISTATCVT+1376
ATCAP31  EQU   ISTATCVT+1372
ATCAP12  EQU   ISTATCVT+1368
ATCAP11  EQU   ISTATCVT+1364
ATCDAPDG EQU   ATCDAPVT+20
ATCDXCEA EQU   ATCDAPVT+16
ATCDCEA  EQU   ATCDAPVT+12
ATCDPCIA EQU   ATCDAPVT+8
ATCDSIOA EQU   ATCDAPVT+4
ATCDEOEA EQU   ATCDAPVT
ATCZAEA  EQU   ATCICAPP+16
ATCZCEA  EQU   ATCICAPP+12
ATCZCPCI EQU   ATCICAPP+8
ATCZSIOA EQU   ATCICAPP+4
ATCCDRPH EQU   ATCICAPP
ATCORQG  EQU   ATCORSRB
ATCORTBF EQU   ATCSQAFR
@NM00128 EQU   ISTATCVT+1308
ATCZLAEA EQU   ATCLDAPP+16
ATCZLCEA EQU   ATCLDAPP+12
ATCZLPCI EQU   ATCLDAPP+8
ATCSMFRR EQU   ATCLDAPP+4
ATCCDTID EQU   ATCLDAPP
@NM00127 EQU   ISTATCVT+1256
ATCZPAB2 EQU   ISTATCVT+1224
@NM00126 EQU   ISTATCVT+1224
@NM00125 EQU   ISTATCVT+1164
ATCCPCFE EQU   ISTATCVT+1160
@NM00124 EQU   ATCRID+2
ATCCDRMA EQU   ATCRID
@NM00123 EQU   ATCSMSDQ+8
@NM00122 EQU   ATCSMSDQ+4
@NM00121 EQU   ATCSMSDQ
ATCSEQNO EQU   ISTATCVT+1136
ATCSMPMD EQU   ISTATCVT+1132
ATCPAREA EQU   ISTATCVT+1128
ATCCPCSM EQU   ISTATCVT+1124
ATCQLOCK EQU   ISTATCVT+1120
ATCITQLE EQU   ISTATCVT+1116
ATCSQCDS EQU   ISTATCVT+1112
ATCUSSVT EQU   ISTATCVT+1108
ATCNOSQ  EQU   ISTATCVT+1104
ATCINCIP EQU   ATCCPDVT+4
ATCTSCNI EQU   ATCCPDVT
ATCMGCRT EQU   ISTATCVT+1092
ATCMACRT EQU   ISTATCVT+1088
ATCCSMT  EQU   ISTATCVT+1084
ATCDRUSL EQU   ISTATCVT+1080
ATCDRULL EQU   ISTATCVT+1076
ATCCFCDR EQU   ISTATCVT+1072
@NM00120 EQU   ISTATCVT+1069
ATCMROUT EQU   ISTATCVT+1060
ATCONFIG EQU   ISTATCVT+1052
ATCNODEL EQU   ISTATCVT+1044
@NM00119 EQU   @NM00118+9
ATCLAST  EQU   ATCSHRFG
ATCSHRTN EQU   @NM00118
@NM00117 EQU   ISTATCVT+1026
ATCNMCTR EQU   ISTATCVT+1024
ATCPOIA  EQU   ATCRNO+1
@NM00116 EQU   ATCRNO
ATCLCLCT EQU   ATCVLCNT+2
ATCRNCNT EQU   ATCVLCNT
ATCHBSIZ EQU   ATCHPGM+2
ATCHBFNO EQU   ATCHPGM
@NM00115 EQU   ISTATCVT+1011
ATCXRANG EQU   ISTATCVT+1010
ATCMAXID EQU   ISTATCVT+1009
ATCMSGSP EQU   ISTATCVT+1008
ATCCIDM  EQU   ISTATCVT+1006
ATCACTRM EQU   ISTATCVT+1004
ATCECTLP EQU   ISTATCVT+1000
ATCECNET EQU   ISTATCVT+996
ATCECOPC EQU   ISTATCVT+992
ATCECSES EQU   ISTATCVT+988
ATCECDSP EQU   ISTATCVT+984
ATCECVRY EQU   ISTATCVT+980
ATCECHLT EQU   ISTATCVT+976
ATCECMOD EQU   ISTATCVT+972
ATCVDLOK EQU   ISTATCVT+968
ATCRDTLK EQU   ISTATCVT+964
ATCVOCLK EQU   ISTATCVT+960
ATCITLIM EQU   ISTATCVT+958
ATCTMINV EQU   ISTATCVT+956
ATCHOSTA EQU   ISTATCVT+954
ATCPUNSA EQU   ISTATCVT+952
ATCSAF   EQU   ISTATCVT+950
ATCVTMID EQU   ATCSSCPA
ATCHCNID EQU   ATCONID+2
ATCSCNID EQU   ATCONID
@NM00114 EQU   ATCBITAN+3
@NM00113 EQU   ATCBITAN+2
@NM00112 EQU   ATCFLAG2
@NM00111 EQU   ATCFLAG2
@NM00110 EQU   ATCFLAG2
ATCCRYPF EQU   ATCFLAG2
ATCTUNCL EQU   ATCFLAG2
ATCTUNRQ EQU   ATCFLAG2
ATCTUNAC EQU   ATCFLAG2
ATCCDLRA EQU   ATCFLAG2
@NM00109 EQU   ATCBITAN
@NM00108 EQU   ATCSTAT4
@NM00107 EQU   ATCSTAT4
@NM00106 EQU   ATCSTAT4
@NM00105 EQU   ATCSTAT4
@NM00104 EQU   ATCSTAT4
ATCPRTAT EQU   ATCSTAT4
ATCNCSD  EQU   ATCSTAT4
ATCMTST  EQU   ATCSTAT4
@NM00103 EQU   ATCPOFLG
@NM00102 EQU   ATCPOFLG
@NM00101 EQU   ATCPOFLG
@NM00100 EQU   ATCPOFLG
@NM00099 EQU   ATCPOFLG
@NM00098 EQU   ATCPOFLG
@NM00097 EQU   ATCPOFLG
ATCPOUNS EQU   ATCPOFLG
@NM00096 EQU   ATCSTAT+1
ATCHIP   EQU   ATCSTAT1
ATCMDHLT EQU   ATCSTAT1
ATCINHLT EQU   ATCSTAT1
ATCNETSL EQU   ATCSTAT1
ATCQKHLT EQU   ATCSTAT1
ATCSNHLT EQU   ATCSTAT1
ATCACTIV EQU   ATCSTAT1
ATCSTART EQU   ATCSTAT1
ATCNOP00 EQU   ISTATCVT+932
ATCTSBUF EQU   ISTATCVT+928
ATCFEPT  EQU   ISTATCVT+924
ATCFDVT  EQU   ISTATCVT+920
ATCCONFT EQU   ISTATCVT+916
ATCRDTH  EQU   ISTATCVT+912
ATCSIBQ  EQU   ISTATCVT+908
ATCHLTMS EQU   ISTATCVT+904
ATCECPRM EQU   ISTATCVT+900
ATCVPARM EQU   ISTATCVT+896
ATCOCHA  EQU   ISTATCVT+892
ATCDSPLQ EQU   ISTATCVT+888
ATCVARYQ EQU   ISTATCVT+884
ATCHALTQ EQU   ISTATCVT+880
ATCMODQ  EQU   ISTATCVT+876
ATCSRT   EQU   ISTATCVT+872
ATCRDT   EQU   ISTATCVT+868
ATCSDVT  EQU   ISTATCVT+864
ATCDLRPT EQU   ISTATCVT+860
ATCACDA  EQU   ISTATCVT+852
ATCMNT   EQU   ISTATCVT+848
ATCNODDS EQU   ISTATCVT+840
ATCITRT  EQU   ISTATCVT+836
ATCTODVT EQU   ISTATCVT+832
ATCTRCPT EQU   ISTATCVT+828
ATCMODTB EQU   ISTATCVT+824
ATCUSSPT EQU   ISTATCVT+820
ATCTUBUF EQU   ISTATCVT+816
ATCTACB  EQU   ISTATCVT+812
ATCDWA   EQU   ISTATCVT+808
ATCCFCR2 EQU   ATCPODVT
ATCEPA   EQU   ISTATCVT+800
ATCPULQB EQU   @NM00095+16
ATCMCQAB EQU   @NM00095+12
ATCLUSMQ EQU   @NM00095+8
ATCLUIOQ EQU   @NM00095+4
ATCIOLQB EQU   @NM00095
ATCTSCAP EQU   ATCANYDT
ATCTSCCO EQU   ATCLUDVT+4
ATCTSCSR EQU   ATCLUDVT
ATCVTLOD EQU   ISTATCVT+764
ATCTSCLF EQU   ISTATCVT+760
ATCTSCLE EQU   ISTATCVT+756
ATCTSCLB EQU   ISTATCVT+752
ATCTSCLS EQU   ISTATCVT+748
ATCTSCCF EQU   ISTATCVT+744
ATCTSCFV EQU   ISTATCVT+740
ATCTSCCE EQU   ISTATCVT+736
ATCTSCCB EQU   ISTATCVT+732
ATCTSCWS EQU   ISTATCVT+728
ATCTSCEM EQU   ISTATCVT+724
ATCTSCNS EQU   ISTATCVT+720
ATCTSCER EQU   ISTATCVT+716
ATCTSCPR EQU   ISTATCVT+712
ATCTSCGR EQU   ISTATCVT+708
ATCTSCCI EQU   ISTATCVT+704
ATCTSVT  EQU   ISTATCVT+700
ATCDVLOD EQU   ISTATCVT+696
ATCCDCNR EQU   ISTATCVT+692
ATCCDCNF EQU   ISTATCVT+688
ATCCDCND EQU   ISTATCVT+684
ATCCDCNA EQU   ISTATCVT+680
ATCCDCCP EQU   ISTATCVT+676
ATCCDFDN EQU   ISTATCVT+672
ATCCDFIN EQU   ISTATCVT+668
ATCCDFND EQU   ISTATCVT+664
ATCCDDEL EQU   ISTATCVT+660
ATCCDADD EQU   ISTATCVT+656
ATCTCLIM EQU   ISTATCVT+652
ATCRACTR EQU   ISTATCVT+648
ATCRACTI EQU   ISTATCVT+644
ATCREMOV EQU   ISTATCVT+640
ATCRACIO EQU   ISTATCVT+636
ATCADD   EQU   ISTATCVT+632
ATCPUCRT EQU   ISTATCVT+628
ATCORCPX EQU   ISTATCVT+616
ATCORCAF EQU   ISTATCVT+612
ATCFRSTR EQU   ATCGTSTR
ATCSTMA  EQU   ISTATCVT+604
ATCSRTAD EQU   ISTATCVT+600
ATCOCRT  EQU   ISTATCVT+596
ATCOCCFS EQU   ISTATCVT+592
ATCOCCFP EQU   ISTATCVT+588
ATCSRTDF EQU   ISTATCVT+584
ATCLUCRT EQU   ISTATCVT+580
ATCINCY5 EQU   ISTATCVT+576
ATCINCW3 EQU   ISTATCVT+572
ATCINCU6 EQU   ISTATCVT+568
ATCINCTQ EQU   ISTATCVT+564
ATCINCS1 EQU   ISTATCVT+560
ATCSRTAB EQU   ISTATCVT+556
ATCINCRD EQU   ISTATCVT+552
ATCINCPH EQU   ISTATCVT+548
ATCINCLQ EQU   ISTATCVT+544
ATCNOCRT EQU   ISTATCVT+540
ATCINCF1 EQU   ISTATCVT+536
ATCINCCI EQU   ISTATCVT+532
ATCINCCO EQU   ISTATCVT+528
ATCBLDLA EQU   ISTATCVT+524
ATCALOAD EQU   ISTATCVT+520
ATCADEL  EQU   ISTATCVT+516
ATCESC02 EQU   ISTATCVT+512
ATCESC01 EQU   ISTATCVT+508
ATCDEC01 EQU   ISTATCVT+504
ATCDEC00 EQU   ISTATCVT+500
ATCCPCRT EQU   ISTATCVT+496
ATCMSGM  EQU   ISTATCVT+492
ATCCPCFR EQU   ISTATCVT+488
ATCCPCGR EQU   ISTATCVT+484
ATCCPCPP EQU   ISTATCVT+480
ATCMSGP  EQU   ISTATCVT+476
ATCCPCNT EQU   ISTATCVT+472
ATCAUTHA EQU   ISTATCVT+468
ATCACCTA EQU   ISTATCVT+464
ATCAP39  EQU   ISTATCVT+460
ATCAP36  EQU   ISTATCVT+456
ATCAP35  EQU   ISTATCVT+452
ATCAP33  EQU   ISTATCVT+448
ATCAPCR5 EQU   ISTATCVT+444
ATCAICPT EQU   ISTATCVT+440
ATCAPI   EQU   ISTATCVT+436
ATCAICTN EQU   ISTATCVT+432
ATCACC01 EQU   ISTATCVT+428
ATCACC00 EQU   ISTATCVT+424
ATCLDECB EQU   ATCLDTIL+12
ATCLDLCK EQU   ATCLDTIL+8
ATCLDLST EQU   ATCLDTIL+4
ATCLDNCS EQU   ATCLDTIL
ATCNOSPB EQU   ISTATCVT+376
ATCNSPAB EQU   ISTATCVT+344
ATCLUSRT EQU   ISTATCVT+312
ATCPUIOP EQU   ISTATCVT+280
ATCPUPAB EQU   ISTATCVT+248
ATCPXPAB EQU   ISTATCVT+216
ATCPOPAB EQU   ISTATCVT+184
@NM00094 EQU   ATCVDPAB+16
ATCFEPAB EQU   ATCVDPAB
ATCTCIPB EQU   ISTATCVT+120
ATCCSPAB EQU   ATCSMPAB+16
@NM00093 EQU   ATCSMPAB
ATCTMRPB EQU   ISTATCVT+56
ATCITPAB EQU   ISTATCVT+24
@NM00092 EQU   ATCITRA1
ATCITSCP EQU   ATCITRA1
ATCITMSG EQU   ATCITRA1
ATCITPIU EQU   ATCITRA1
ATCITSMS EQU   ATCITRA1
ATCITPSS EQU   ATCITRA1
ATCITLCK EQU   ATCITRA1
ATCITAPI EQU   ATCITRA1
ATCITCNT EQU   ATCITFLG
ATCITRPH EQU   ATCITCDS
ATCITTBL EQU   ATCITFLD+4
ATCITPRM EQU   ATCITFLD
ATCPTCHA EQU   ATCRPTCH+4
ATCVTLVL EQU   ATCRPTCH
RPHUPSTA EQU   ISTRPH+104
RPHSAV16 EQU   RPHWORK+60
RPHSAV15 EQU   RPHWORK+56
RPHSAV14 EQU   RPHWORK+52
RPHSAV13 EQU   RPHWORK+48
RPHSAV12 EQU   RPHWORK+44
RPHSAV11 EQU   RPHWORK+40
RPHSAV10 EQU   RPHWORK+36
RPHSAVE9 EQU   RPHWORK+32
RPHSAVE8 EQU   RPHWORK+28
RPHSAVE7 EQU   RPHWORK+24
RPHSAVE6 EQU   RPHWORK+20
RPHSAVE5 EQU   RPHWORK+16
RPHSAVE4 EQU   RPHWORK+12
RPHSAVE3 EQU   RPHWORK+8
RPHSAVE2 EQU   RPHWORK+4
RPHSHALF EQU   RPHSAVE1+2
RPHSBIT8 EQU   RPHSBITS
RPHSBIT7 EQU   RPHSBITS
RPHSBIT6 EQU   RPHSBITS
RPHSBIT5 EQU   RPHSBITS
RPHSBIT4 EQU   RPHSBITS
RPHSBIT3 EQU   RPHSBITS
RPHSBIT2 EQU   RPHSBITS
RPHSBIT1 EQU   RPHSBITS
RPHSBYTE EQU   RPHSAVE1
RPHPABQP EQU   RPHPABQA+1
RPHPABFG EQU   RPHPABQA
RPHCRR   EQU   ISTRPH+32
RPHSRP34 EQU   RPHSRPRM+2
RPHSRP12 EQU   RPHSRPRM
RPHWEGT  EQU   RPHCSPA
RPHMAJCB EQU   ISTRPH+21
RPHPABOF EQU   ISTRPH+20
RPHRESUM EQU   RPHRESMA+1
@NM00091 EQU   RPHWPFLG
RPHPURGE EQU   RPHWPFLG
RPHPT    EQU   RPHWPFLG
RPHWT    EQU   RPHWPFLG
RPHRSKEY EQU   RPHWPFLG
RPHDVTA  EQU   ISTRPH+12
RPHTIK   EQU   RPHTSKID+3
@NM00090 EQU   RPHTSKID
RPHRPHAP EQU   RPHRPHA+1
@NM00089 EQU   RPHRPHA
RPHGATE  EQU   RPHRPHA
RPHABEND EQU   RPHFLGB
RPHUWAIT EQU   RPHFLGB
RPHRLCRA EQU   RPHFLGB
@NM00088 EQU   RPHFLGB
RPHPGCMP EQU   RPHFLGB
RPHFBAPS EQU   RPHFLGB
RPHBSSP  EQU   RPHFLGB
RPHLOCK  EQU   RPHFLGB
RPHFNFLG EQU   RPHFSTLC
RPHMLTCP EQU   RPHFLAGS
RPHSMCLR EQU   RPHFLAGS
RPHSMTYP EQU   RPHFLAGS
RPHSMQ   EQU   RPHFLAGS
RPHAPTYP EQU   RPHFLAGS
RPHSPGIN EQU   RPHFLAGS
RPHOGIND EQU   RPHFLAGS
RPHLNGTH EQU   RPHCNTL+1
RPHTYPE  EQU   RPHCNTL
DYPPAB   EQU   ISTDYPAB+16
DYPOCRPH EQU   DYPPACMD
DYPTSKID EQU   ISTDYPAB+8
DYPPACTB EQU   DYPCHAIN
DYPFLGS  EQU   ISTDYPAB+2
DYPLNGTH EQU   ISTDYPAB+1
DYPTYPE  EQU   ISTDYPAB
@NM00087 EQU   ISTACDEB+120
ACDNIB   EQU   ISTACDEB+116
ACDEAS   EQU   ISTACDEB+112
ACDUNTNM EQU   ISTACDEB+104
@NM00086 EQU   ACDLUFLG+1
ACDAACQ  EQU   ACDLUFLG+1
ACDAPASS EQU   ACDLUFLG+1
ACDCSM   EQU   ACDLUFLG+1
ACDPARS  EQU   ACDLUFLG+1
ACDTSO   EQU   ACDLUFLG+1
ACDSCIP  EQU   ACDLUFLG+1
ACDNSEXT EQU   ACDLUFLG+1
ACDAUTHE EQU   ACDLUFLG
ACDTPEND EQU   ACDLUFLG
ACDABEND EQU   ACDLUFLG
ACDCLOSE EQU   ACDLUFLG
ACDQUIES EQU   ACDLUFLG
ACDNSESS EQU   ACDLUFLG
ACDREADY EQU   ACDLUFLG
ACDACTIV EQU   ACDLUFLG
ACDRQID  EQU   ISTACDEB+100
ACDSMCNT EQU   ISTACDEB+96
ACDPACNT EQU   ISTACDEB+92
ACDASCNT EQU   ISTACDEB+88
ACDSMQ   EQU   ISTACDEB+84
ACDSSCNT EQU   ISTACDEB+80
ACDECB   EQU   ISTACDEB+76
ACDLUCBA EQU   ISTACDEB+72
ACDLOCK  EQU   ISTACDEB+68
ACDDEB   EQU   ISTACDEB+60
ACDTCB   EQU   ISTACDEB+56
ACDRARQ  EQU   ACDANYQ+4
ACDRAFQ  EQU   ACDANYQ
ACDSSPAB EQU   ISTACDEB+32
ACDNEPAB EQU   ISTACDEB+16
ACDRDTE  EQU   ISTACDEB+12
ACDCHN   EQU   ISTACDEB+4
ACDSAF   EQU   ISTACDEB+2
ACDLNGTH EQU   ISTACDEB+1
ACDTYPE  EQU   ISTACDEB
PABRPHA  EQU   PABRPHFG+1
PABNODQ  EQU   PABFLAGS
PABINHBT EQU   PABFLAGS
PABERLOK EQU   PABERRLK
PABSSN   EQU   PABFLAGS
PABDYNAM EQU   PABFLAGS
PABXTND  EQU   PABFLAGS
PABPRIOR EQU   PABFLAGS
PABCHNGP EQU   PABCHAIN+1
PABRSV02 EQU   PABCHAIN
PABDELAY EQU   PABCHAIN
PABQUED  EQU   PABRUNNG
PABRESET EQU   PABCHAIN
PABUNCON EQU   PABCHAIN
PABCDP   EQU   PABCHAIN
PABRESCH EQU   PABCHAIN
PABCHNG  EQU   PABCHAIN
PABWEQP  EQU   PABWEQA+1
PABRSV01 EQU   PABWEQA
PABWEQG  EQU   PABWEQA
LOKXCL   EQU   @NM00083
LOKPRY   EQU   @NM00083
@NM00084 EQU   @NM00083
@NM00082 EQU   LOKCHNG
LOKCT    EQU   ISTLOK
@NM00081 EQU   SRBSECT+40
@NM00080 EQU   SRBSECT+38
SRBPRIOR EQU   SRBSECT+37
SRBPKF   EQU   SRBSECT+36
SRBSAVE  EQU   SRBSECT+32
SRBPARM  EQU   SRBSECT+28
SRBRMTR  EQU   SRBSECT+24
SRBEP    EQU   SRBSECT+20
SRBPTCB  EQU   SRBFLC+4
SRBPASID EQU   SRBFLC+2
SRBCPAFF EQU   SRBFLC
SRBASCB  EQU   SRBSECT+8
SRBFLNK  EQU   SRBSECT+4
SRBID    EQU   SRBSECT
ASXBEND  EQU   ASXB+232
ASXBRV25 EQU   ASXB+228
ASXBRV24 EQU   ASXB+224
ASXBPT0E EQU   ASXB+220
ASXBCRB4 EQU   ASXBCASW+3
ASXBCRB3 EQU   ASXBCASW+2
ASXBCRB2 EQU   ASXBCASW+1
ASXBCR06 EQU   ASXBCRB1
ASXBCR05 EQU   ASXBCRB1
ASXBCR04 EQU   ASXBCRB1
ASXBCR03 EQU   ASXBCRB1
ASXBCR02 EQU   ASXBCRB1
ASXBCR01 EQU   ASXBCRB1
ASXBTFD  EQU   ASXBCRB1
ASXBPIP  EQU   ASXBCRB1
ASXBCTDC EQU   ASXB+212
ASXBTDCB EQU   ASXB+208
ASXBRV19 EQU   ASXB+204
ASXBRV18 EQU   ASXB+200
ASXBRV17 EQU   ASXB+196
ASXBRV16 EQU   ASXB+192
ASXBLSRB EQU   ASXBAEQ+20
ASXBFSRB EQU   ASXBAEQ+16
ASXBLRQE EQU   ASXBAEQ+12
ASXBFRQE EQU   ASXBAEQ+8
ASXBLIQE EQU   ASXBAEQ+4
ASXBFIQE EQU   ASXBAEQ
ASXBETSK EQU   ASXB+164
ASXBSIRB EQU   ASXB+160
ASXBPSWD EQU   ASXB+152
ASXBPRG  EQU   ASXB+136
ASXBRV26 EQU   ASXB+132
ASXBOUSB EQU   ASXB+128
ASXBDDR  EQU   ASXB+124
ASXBRCTD EQU   ASXB+120
ASXBRSMD EQU   ASXB+116
ASXBSPSA EQU   ASXB+112
ASXBFRWA EQU   ASXB+108
ASXBFLSA EQU   ASXB+36
ASXBIHSA EQU   ASXB+32
ASXBRV15 EQU   ASXB+28
ASXBRV14 EQU   ASXB+24
ASXBLWA  EQU   ASXB+20
ASXBRS00 EQU   ASXB+14
ASXBTCBS EQU   ASXB+12
ASXBLTCB EQU   ASXB+8
ASXBFTCB EQU   ASXB+4
ASXBASXB EQU   ASXB
ASXBEGIN EQU   ASXB
ASCBEND  EQU   ASCB+208
ASCBSRBT EQU   ASCB+200
ASCBSWTL EQU   ASCB+196
ASCBRS14 EQU   ASCB+195
ASCBSMCT EQU   ASCB+194
ASCBRS12 EQU   ASCB+192
ASCBPCTT EQU   ASCB+188
ASCBVGTT EQU   ASCB+184
ASCBRV43 EQU   ASCBSRQ4
ASCBRV42 EQU   ASCBSRQ4
ASCBRV41 EQU   ASCBSRQ4
ASCBRV40 EQU   ASCBSRQ4
ASCBRV39 EQU   ASCBSRQ4
ASCBRV38 EQU   ASCBSRQ4
ASCBRV37 EQU   ASCBSRQ4
ASCBRV36 EQU   ASCBSRQ4
ASCBRV35 EQU   ASCBSRQ3
ASCBRV34 EQU   ASCBSRQ3
ASCBRV33 EQU   ASCBSRQ3
ASCBRV32 EQU   ASCBSRQ3
ASCBRV31 EQU   ASCBSRQ3
ASCBRV30 EQU   ASCBSRQ3
ASCBRV29 EQU   ASCBSRQ3
ASCBRV28 EQU   ASCBSRQ3
ASCBRV27 EQU   ASCBSRQ2
ASCBRV26 EQU   ASCBSRQ2
ASCBRV25 EQU   ASCBSRQ2
ASCBRV24 EQU   ASCBSRQ2
ASCBRV23 EQU   ASCBSRQ2
ASCBRV22 EQU   ASCBSRQ2
ASCBRV21 EQU   ASCBSRQ2
ASCBRV20 EQU   ASCBSRQ2
ASCBRV19 EQU   ASCBSRQ1
ASCBRV18 EQU   ASCBSRQ1
ASCBRV17 EQU   ASCBSRQ1
ASCBRV16 EQU   ASCBSRQ1
ASCBRV15 EQU   ASCBSRQ1
ASCBRV14 EQU   ASCBSRQ1
ASCBRV13 EQU   ASCBSRQ1
ASCBSTA  EQU   ASCBSRQ1
ASCBJBNS EQU   ASCB+176
ASCBJBNI EQU   ASCB+172
ASCBMCC  EQU   ASCB+168
ASCBRTWA EQU   ASCB+164
ASCBIQEA EQU   ASCB+160
ASCBXMPQ EQU   ASCB+156
ASCBRS01 EQU   ASCB+154
ASCBFMCT EQU   ASCB+152
ASCBOUXB EQU   ASCB+148
ASCBOUCB EQU   ASCB+144
ASCBMECB EQU   ASCB+140
ASCBQECB EQU   ASCB+136
ASCBLSQH EQU   ASCBLKGP+4
ASCBLOCK EQU   ASCBLKGP
ASCBTCBS EQU   ASCB+124
ASCBNVSC EQU   ASCB+122
ASCBVSC  EQU   ASCB+120
ASCBSRBS EQU   ASCB+118
ASCBSSRB EQU   ASCB+116
ASCBRV06 EQU   ASCBFLG2
ASCBRV05 EQU   ASCBFLG2
ASCBRV04 EQU   ASCBFLG2
ASCBSNQS EQU   ASCBFLG2
ASCBS2S  EQU   ASCBFLG2
ASCBCEXT EQU   ASCBFLG2
ASCBPXMT EQU   ASCBFLG2
ASCBXMPT EQU   ASCBFLG2
ASCBRF07 EQU   ASCBDSP1
ASCBRF06 EQU   ASCBDSP1
ASCBRF05 EQU   ASCBDSP1
ASCBRF04 EQU   ASCBDSP1
ASCBRF03 EQU   ASCBDSP1
ASCBRF02 EQU   ASCBDSP1
ASCBFAIL EQU   ASCBDSP1
ASCBNOQ  EQU   ASCBDSP1
ASCBSWCT EQU   ASCB+112
ASCBTMCH EQU   ASCB+104
ASCBNSWP EQU   ASCBFLG1
ASCBTYP1 EQU   ASCBFLG1
ASCBSTND EQU   ASCBFLG1
ASCBABNT EQU   ASCBFLG1
ASCBTERM EQU   ASCBFLG1
ASCBS3S  EQU   ASCBFLG1
ASCBCMSH EQU   ASCBFLG1
ASCBTOFF EQU   ASCBFLG1
ASCBRF01 EQU   ASCBRCTF
ASCBTMLW EQU   ASCBRCTF
ASCBOUT  EQU   ASCBRCTF
ASCBWAIT EQU   ASCBRCTF
ASCBRV08 EQU   ASCBRCTF
ASCBFQU  EQU   ASCBRCTF
ASCBFRS  EQU   ASCBRCTF
ASCBTMNO EQU   ASCBRCTF
ASCBAFFN EQU   ASCBFW1
ASCBDUMP EQU   ASCB+96
ASCBQSVC EQU   ASCB+92
ASCBUBET EQU   ASCB+88
ASCBECB  EQU   ASCB+84
ASCBJSTL EQU   ASCB+80
ASCBEWST EQU   ASCB+72
ASCBEJST EQU   ASCB+64
ASCBTSB  EQU   ASCB+60
ASCBCSCB EQU   ASCB+56
ASCBRSM  EQU   ASCB+52
ASCBLDA  EQU   ASCB+48
ASCBSTOR EQU   ASCB+44
ASCBDP   EQU   ASCB+43
ASCBRV07 EQU   ASCB+42
ASCBIOSM EQU   ASCB+40
ASCBSEQN EQU   ASCB+38
ASCBASID EQU   ASCB+36
ASCBCPUS EQU   ASCB+32
ASCBSPL  EQU   ASCB+28
ASCBIOSP EQU   ASCB+24
ASCBSYNC EQU   ASCBSUPC+4
ASCBSVRB EQU   ASCBSUPC
ASCBCMSF EQU   ASCB+12
ASCBBWDP EQU   ASCB+8
ASCBFWDP EQU   ASCB+4
ASCBASCB EQU   ASCB
ASCBEGIN EQU   ASCB
EXLEADDR EQU   EXLEXITP
@NM00055 EQU   EXLENFL
EXLLNK   EQU   EXLENFL
EXLACTM  EQU   EXLENFL
EXLSPEC  EQU   EXLENFL
EXLRESPP EQU   EXLRESP+1
@NM00054 EQU   EXLRESPF
EXLRESPK EQU   EXLRESPF
EXLRESPA EQU   EXLRESPF
EXLRESPS EQU   EXLRESPF
EXLDFASP EQU   EXLDFAS+1
@NM00053 EQU   EXLDFASF
EXLDFASK EQU   EXLDFASF
EXLDFASA EQU   EXLDFASF
EXLDFASS EQU   EXLDFASF
EXLTNSEP EQU   EXLVTEXT+26
@NM00052 EQU   EXLTNSEF
EXLTNSEK EQU   EXLTNSEF
EXLTNSEA EQU   EXLTNSEF
EXLTNSES EQU   EXLTNSEF
EXLTPNDP EQU   EXLVTEXT+21
@NM00051 EQU   EXLTPNDF
EXLTPNDK EQU   EXLTPNDF
EXLTPNDA EQU   EXLTPNDF
EXLTPNDS EQU   EXLTPNDF
EXLATTNP EQU   EXLVTEXT+16
@NM00050 EQU   EXLATTNF
EXLATTNK EQU   EXLATTNF
EXLATTNA EQU   EXLATTNF
EXLATTNS EQU   EXLATTNF
@NM00049 EQU   EXLVTEXT+10
EXLRLRQP EQU   EXLVTEXT+6
@NM00048 EQU   EXLRLRQF
EXLRLRQK EQU   EXLRLRQF
EXLRLRQA EQU   EXLRLRQF
EXLRLRQS EQU   EXLRLRQF
EXLNLGNP EQU   EXLVTEXT+1
@NM00047 EQU   EXLNLGNF
EXLNLGNK EQU   EXLNLGNF
EXLNLGNA EQU   EXLNLGNF
EXLNLGNS EQU   EXLNLGNF
EXLOPNP  EQU   EXLCOMN+36
@NM00046 EQU   EXLOPNF
EXLOPNK  EQU   EXLOPNF
EXLOPNA  EQU   EXLOPNF
EXLOPNS  EQU   EXLOPNF
EXLJRNP  EQU   EXLCOMN+31
@NM00045 EQU   EXLJRNF
EXLJRNK  EQU   EXLJRNF
EXLJRNA  EQU   EXLJRNF
EXLJRNS  EQU   EXLJRNF
EXLLGNP  EQU   EXLCOMN+26
@NM00044 EQU   EXLLGNF
EXLLGNK  EQU   EXLLGNF
EXLLGNA  EQU   EXLLGNF
EXLLGNS  EQU   EXLLGNF
EXLUPADP EQU   EXLSCIPP
@NM00043 EQU   EXLUPADF
EXLUPADK EQU   EXLSCIPK
EXLUPADA EQU   EXLSCIPA
EXLUPADS EQU   EXLSCIPS
EXLLERP  EQU   EXLCOMN+16
@NM00042 EQU   EXLLERF
EXLLERK  EQU   EXLLERF
EXLLERA  EQU   EXLLERF
EXLLERS  EQU   EXLLERF
EXLSYNP  EQU   EXLCOMN+11
@NM00041 EQU   EXLSYNF
EXLSYNK  EQU   EXLSYNF
EXLSYNA  EQU   EXLSYNF
EXLSYNS  EQU   EXLSYNF
EXLEODP  EQU   EXLCOMN+6
@NM00040 EQU   EXLEODF
EXLEODK  EQU   EXLEODF
EXLEODA  EQU   EXLEODF
EXLEODS  EQU   EXLEODF
@NM00039 EQU   EXLCOMN+4
EXLLEN2  EQU   EXLLEN
EXLSTYP  EQU   EXLCOMN+1
EXLID    EQU   EXLCOMN
ACBTNIB  EQU   ACBVTEXT+12
@NM00038 EQU   ACBVTEXT+8
@NM00037 EQU   ACBVTEXT+6
ACBRTN   EQU   ACBVTEXT
ACBAMAX  EQU   ACBAPID
@NM00036 EQU   ACBCOMN+70
ACBSRID  EQU   ACBCOMN+68
ACBUAPTR EQU   ACBCOMN+64
ACBLRECL EQU   ACBCOMN+62
ACBMSGLN EQU   ACBBLKSZ
ACBBUFSP EQU   ACBCOMN+56
@NM00035 EQU   ACBUJFCB+1
ACBOPTN  EQU   ACBUJFCB
@NM00034 EQU   ACBINFL2
ACBCBIC  EQU   ACBINFL2
ACBSOPEN EQU   ACBINFL2
ACBSWARN EQU   ACBINFL2
ACBBYPSS EQU   ACBINFL1
ACBSDS   EQU   ACBVVIC
ACBUCRA  EQU   ACBINFL1
ACBSCRA  EQU   ACBINFL1
ACBCAT   EQU   ACBINFL1
ACBIJRQE EQU   ACBINFL1
ACBJEPS  EQU   ACBINFL1
@NM00033 EQU   ACBINFL1
ACBERFLG EQU   ACBCOMN+49
ACBBUSY  EQU   ACBIOSFG
ACBLOCK  EQU   ACBEXFG
@NM00032 EQU   ACBOFLGS
ACBDSERR EQU   ACBOFLGS
ACBOPEN  EQU   ACBOFLGS
ACBEOV   EQU   ACBOFLGS
@NM00031 EQU   ACBOFLGS
ACBDEB   EQU   ACBDDNM+5
ACBERFL  EQU   ACBDDNM+4
ACBAM    EQU   ACBAMETH
ACBINFL  EQU   ACBDDNM+2
ACBTIOT  EQU   ACBDDNM
ACBUEL   EQU   ACBEXLST
ACBPASSW EQU   ACBCOMN+32
ACBMSGAR EQU   ACBCOMN+28
@NM00030 EQU   ACBDSOR2
ACBDORGA EQU   ACBDSOR2
@NM00029 EQU   ACBDSOR2
@NM00028 EQU   ACBDSOR1
ACBOPTJ  EQU   ACBDVIND
ACBCRNRE EQU   ACBCROPS
ACBCRNCK EQU   ACBCROPS
ACBASA   EQU   ACBCCTYP
@NM00027 EQU   ACBCCTYP
ACBRECAF EQU   ACBRECFM
ACBJBUF  EQU   ACBBUFPL+2
ACBMACR4 EQU   ACBBUFPL+1
@NM00026 EQU   ACBMACR3
ACBNCFX  EQU   ACBMACR3
ACBSIS   EQU   ACBMACR3
ACBDFR   EQU   ACBMACR3
ACBICI   EQU   ACBMACR3
ACBGSR   EQU   ACBMACR3
ACBLSR   EQU   ACBMACR3
@NM00025 EQU   ACBMACR3
ACBBUFNI EQU   ACBCOMN+18
ACBBUFND EQU   ACBCOMN+16
ACBSTRNO EQU   ACBCOMN+15
ACBBSTNO EQU   ACBCOMN+14
ACBAIX   EQU   ACBMACR2
ACBDSN   EQU   ACBMACR2
ACBRST   EQU   ACBMACR2
ACBLOGON EQU   ACBMACR2
ACBSKP   EQU   ACBMACR2
@NM00024 EQU   ACBMACR2
ACBUBF   EQU   ACBMACR1
ACBOUT   EQU   ACBMACR1
ACBIN    EQU   ACBMACR1
ACBDIR   EQU   ACBMACR1
ACBSEQ   EQU   ACBMACR1
ACBBLK   EQU   ACBCNV
ACBADD   EQU   ACBADR
ACBKEY   EQU   ACBMACR1
ACBINRTN EQU   ACBCOMN+8
ACBAMWAP EQU   ACBIBCT
ACBLEN2  EQU   ACBLENG2
ACBSTYP  EQU   ACBCOMN+1
ACBID    EQU   ACBCOMN
RPLSEQNO EQU   RPLOF60+6
@NM00023 EQU   RPLIBSQ
RPLIINV  EQU   RPLIBSQ
RPLINEG  EQU   RPLIBSQ
RPLIPOS  EQU   RPLIBSQ
RPLIIGN  EQU   RPLIBSQ
RPLIRSET EQU   RPLIBSQ
RPLITST  EQU   RPLIBSQ
RPLISET  EQU   RPLIBSQ
@NM00022 EQU   RPLOBSQ
RPLOINV  EQU   RPLOBSQ
RPLONEG  EQU   RPLOBSQ
RPLOPOS  EQU   RPLOBSQ
RPLOIGN  EQU   RPLOBSQ
RPLORSET EQU   RPLOBSQ
RPLOTST  EQU   RPLOBSQ
RPLOSET  EQU   RPLOBSQ
RPLIBSQV EQU   RPLOF60+2
RPLOBSQV EQU   RPLOF60
@NM00021 EQU   RPLCNTSC
RPLRSHUT EQU   RPLCNTSC
RPLRQR   EQU   RPLCNTSC
RPLSHUTC EQU   RPLCNTSC
RPLSHUTD EQU   RPLCNTSC
RPLSTSN  EQU   RPLCNTSC
RPLCLEAR EQU   RPLCNTSC
RPLSDT   EQU   RPLCNTSC
RPLBIS   EQU   RPLCNTDC
RPLSBI   EQU   RPLCNTDC
RPLTUNBD EQU   RPLCNTDC
RPLTBIND EQU   RPLCNTDC
RPLSIGNL EQU   RPLCNTDC
RPLLUS   EQU   RPLCNTDC
RPLRTR   EQU   RPLCNTDC
RPLBID   EQU   RPLCNTDC
@NM00020 EQU   RPLCNTDF
RPLQI    EQU   RPLCNTDF
RPLRELQ  EQU   RPLCNTDF
RPLCHASE EQU   RPLCNTDF
RPLQEC   EQU   RPLCNTDF
RPLQC    EQU   RPLCNTDF
RPLCNCEL EQU   RPLCNTDF
RPLDATA  EQU   RPLCNTDF
RPLRRN   EQU   RPLRESP
RPLNFME  EQU   RPLRESP
RPLEX    EQU   RPLRESP
RPLQRI   EQU   RPLRESP
@NM00019 EQU   RPLPOSTV
RPLSCHED EQU   RPLPOSTV
@NM00018 EQU   RPLVTFL1
RPLTLGAC EQU   RPLVTFL1
RPLTNDSP EQU   RPLVTFL1
RPLAUTUS EQU   RPLVTFL1
RPLVTUSE EQU   RPLVTFL1
@NM00017 EQU   RPLVTFL1
@NM00016 EQU   RPLCHN
RPLONLY  EQU   RPLCHN
RPLLAST  EQU   RPLCHN
RPLMIDLE EQU   RPLCHN
RPLFIRST EQU   RPLCHN
@NM00015 EQU   RPLRTYPE
RPLDFASY EQU   RPLRTYPE
RPLNFSYN EQU   RPLRTYPE
RPLRRESP EQU   RPLRTYPE
@NM00014 EQU   RPLSTYPE
RPLSRESP EQU   RPLSTYPE
@NM00013 EQU   RPLRH3
RPLCSI   EQU   RPLRH3
RPLCHREQ EQU   RPLRH3
RPLCMD   EQU   RPLRH3
RPLEB    EQU   RPLRH3
RPLBB    EQU   RPLRH3
RPLSIGDA EQU   RPLVTEXT+32
RPLSAV13 EQU   RPLVTEXT+28
RPLUSNSO EQU   RPLOSENS+2
RPLSSMO  EQU   RPLSSNSO+1
@NM00012 EQU   RPLSSEO
RPLRRO   EQU   RPLSSEO
RPLFIO   EQU   RPLSSEO
RPLSTATO EQU   RPLSSEO
RPLCPMO  EQU   RPLSSEO
@NM00011 EQU   RPLSSEO
RPLFMHDR EQU   RPLOPT12
@NM00010 EQU   RPLOPT12
@NM00009 EQU   RPLOPT12
@NM00008 EQU   RPLOPT12
RPLNIBTK EQU   RPLOPT12
RPLTRUNC EQU   RPLOPT12
RPLKEEP  EQU   RPLOPT12
@NM00007 EQU   RPLOPT12
RPLRSVE8 EQU   RPLOPT11
RPLRSVE7 EQU   RPLOPT11
RPLRSVE6 EQU   RPLOPT11
RPLRSVE5 EQU   RPLOPT11
RPLRSVE4 EQU   RPLOPT11
RPLSTOP  EQU   RPLOPT11
RPLSTART EQU   RPLOPT11
RPLQUIES EQU   RPLOPT11
RPLRSVI6 EQU   RPLOPT10
RPLRSVI5 EQU   RPLOPT10
RPLRSVI4 EQU   RPLOPT10
RPLRSVI3 EQU   RPLOPT10
RPLTSKY  EQU   RPLOPT10
RPLSPARM EQU   RPLOPT10
RPLDSPLY EQU   RPLOPT10
RPLBSCID EQU   RPLOPT10
RPLTOPL  EQU   RPLOPT9
RPLCIDE  EQU   RPLOPT9
RPLRNNM  EQU   RPLOPT9
RPLAPPST EQU   RPLOPT9
RPLCOUNT EQU   RPLOPT9
RPLTERMS EQU   RPLOPT9
RPLDEVCH EQU   RPLOPT9
RPLLOGON EQU   RPLOPT9
RPLUSFLD EQU   RPLVTEXT+16
RPLESR2  EQU   RPLUSNSI+1
RPLESR1  EQU   RPLUSNSI
RPLSSMI  EQU   RPLDSB2
@NM00006 EQU   RPLSSEI
RPLRRI   EQU   RPLSSEI
RPLFII   EQU   RPLSSEI
RPLSTATI EQU   RPLSSEI
RPLCPMI  EQU   RPLSSEI
RPLPATHI EQU   RPLSSEI
RPLARCLN EQU   RPLVTEXT+8
RPLAARLN EQU   RPLVTEXT+4
RPLAAREA EQU   RPLVTEXT
RPLERMSA EQU   RPLCOMN+72
RPLEMLEN EQU   RPLCOMN+70
RPLACTIV EQU   RPLCOMN+69
RPLBRANC EQU   RPLEXTD1
RPLNIB   EQU   RPLEXTD1
RPLTCRYP EQU   RPLEXTD1
@NM00005 EQU   RPLEXTD1
RPLEXIT  EQU   RPLEXTD1
RPLNEXIT EQU   RPLEXTD1
RPLEXSCH EQU   RPLEXTD1
RPLDDDD  EQU   RPLRBAR+4
@NM00004 EQU   RPLRBAR+3
@NM00003 EQU   RPLAIXID
RPLAXPKP EQU   RPLAIXID
RPLAIXPC EQU   RPLRBAR
RPLRSV88 EQU   RPLOPT8
RPLUNCON EQU   RPLOPT8
RPLACTV  EQU   RPLOPT8
RPLSESS  EQU   RPLOPT8
RPLPEND  EQU   RPLOPT8
RPLODPRM EQU   RPLOPT8
RPLODACP EQU   RPLOPT8
RPLODACQ EQU   RPLOPT8
RPLRSV78 EQU   RPLOPT7
RPLTCRNO EQU   RPLOPT7
RPLRLSOP EQU   RPLOPT7
RPLTPOST EQU   RPLOPT7
RPLQOPT  EQU   RPLOPT7
RPLCNIMM EQU   RPLCNOPT
RPLCNANY EQU   RPLCNOPT
RPLCNALL EQU   RPLCNOPT
RPLRSV68 EQU   RPLOPT6
RPLRSV67 EQU   RPLOPT6
RPLLOCK  EQU   RPLOPT6
RPLNCOND EQU   RPLOPT6
RPLCOND  EQU   RPLOPT6
RPLEOT   EQU   RPLUNTYP
RPLEOM   EQU   RPLUNTYP
RPLEOB   EQU   RPLUNTYP
RPLWROPT EQU   RPLOPT5
RPLNODE  EQU   RPLOPT5
RPLERACE EQU   RPLWRTYP
RPLEAU   EQU   RPLWRTYP
RPLNERAS EQU   RPLWRTYP
RPLPSOPT EQU   RPLOPT5
@NM00002 EQU   RPLOPT5
RPLDLGIN EQU   RPLOPT5
RPLBUFL  EQU   RPLCOMN+52
RPLRLEN  EQU   RPLCOMN+48
RPLCHAIN EQU   RPLNXTRP
@NM00001 EQU   RPLOPT4
RPLMKFRM EQU   RPLOPT4
RPLENDTR EQU   RPLOPT4
RPLALIGN EQU   RPLOPT3
RPLFMT   EQU   RPLOPT3
RPLFLD   EQU   RPLOPT3
RPLVFY   EQU   RPLOPT3
RPLBLK   EQU   RPLOPT3
RPLSFORM EQU   RPLOPT3
RPLEODS  EQU   RPLOPT3
RPLNSP   EQU   RPLOPT2
RPLUPD   EQU   RPLOPT2
RPLWAITX EQU   RPLOPT2
RPLLRD   EQU   RPLOPT2
RPLBWD   EQU   RPLOPT2
RPLCNV   EQU   RPLOPT2
RPLADD   EQU   RPLADR
RPLKEY   EQU   RPLOPT2
RPLECBIN EQU   RPLECBSW
RPLGEN   EQU   RPLOPT1
RPLKGE   EQU   RPLOPT1
RPLASY   EQU   RPLOPT1
RPLSKP   EQU   RPLOPT1
RPLSEQ   EQU   RPLOPT1
RPLDIR   EQU   RPLOPT1
RPLLOC   EQU   RPLOPT1
RPLDAF   EQU   RPLARG+2
RPLSAF   EQU   RPLARG
RPLTCBPT EQU   RPLCOMN+28
RPLDACB  EQU   RPLCOMN+24
RPLCCHAR EQU   RPLCOMN+20
RPLSTRID EQU   RPLCOMN+18
RPLKEYL  EQU   RPLKEYLE
RPLRDSOH EQU   RPLFDB3
RPLRLG   EQU   RPLFDB3
RPLLGFRC EQU   RPLFDB3
RPLREOT  EQU   RPLFDB3
RPLREOM  EQU   RPLFDB3
RPLREOB  EQU   RPLFDB3
RPLSV32  EQU   RPLFDB3
RPLUINPT EQU   RPLFDB3
RPLSTSAV EQU   RPLFDB2
RPLCUERR EQU   RPLFDB2
RPLDLGFL EQU   RPLFDB2
RPLIOERR EQU   RPLFDB2
RPLDVUNS EQU   RPLFDB2
RPLATND  EQU   RPLFDB2
RPLRVID  EQU   RPLFDB2
RPLERLK  EQU   RPLFDB2
RPLERREG EQU   RPLRTNCD
RPLSTAT  EQU   RPLFDBWD
RPLPOST  EQU   RPLEXITP
RPLWAIT  EQU   RPLEXITP
RPLPLHPT EQU   RPLCOMN+4
RPLLEN2  EQU   RPLLEN
RPLREQ   EQU   RPLIDWD+2
RPLSTYP  EQU   RPLIDWD+1
RPLID    EQU   RPLIDWD
@NM00079 EQU   PSA+3668
PSASTAK  EQU   PSA+3072
@NM00078 EQU   PSA+1048
PSAUSEND EQU   PSA+1048
PSARV062 EQU   PSA+1044
PSACDAL  EQU   PSA+1040
PSAWTCOD EQU   PSA+1036
PSAATCVT EQU   PSA+1032
PSAPCPSW EQU   PSA+1024
PSAPIR2  EQU   PSA+1020
PSARV059 EQU   PSA+1018
PSASVC13 EQU   PSA+1016
PSALSFCC EQU   PSA+1012
PSASFACC EQU   PSA+1008
PSASTOP  EQU   PSA+992
PSASTART EQU   PSA+976
PSARSPSW EQU   PSA+968
PSASRPSW EQU   PSA+960
PSARV045 EQU   PSA+892
PSARV044 EQU   PSA+888
PSARV043 EQU   PSA+884
PSARV042 EQU   PSA+880
PSARV041 EQU   PSA+876
PSARV040 EQU   PSA+872
PSARV025 EQU   PSA+868
PSADSSED EQU   PSA+868
PSADSSPR EQU   PSA+864
PSADSSFW EQU   PSA+860
PSADSS14 EQU   PSA+856
PSADSSPP EQU   PSA+848
PSADSSRP EQU   PSA+840
PSADSS05 EQU   PSADSSF4
PSADSS10 EQU   PSADSSF4
PSADSSVE EQU   PSADSSF4
PSADSSDE EQU   PSADSSF4
PSADSSC0 EQU   PSADSSF4
PSADSSIE EQU   PSADSSF4
PSADSS12 EQU   PSADSSF4
PSADSSRC EQU   PSADSSF4
PSARV057 EQU   PSADSSF3
PSARV056 EQU   PSADSSF3
PSARV055 EQU   PSADSSF3
PSADSSMC EQU   PSADSSF3
PSADSSRW EQU   PSADSSF3
PSADSSNM EQU   PSADSSF3
PSADSSES EQU   PSADSSF3
PSADSSGP EQU   PSADSSF3
PSADSSF2 EQU   PSADSSFL+1
PSADSSPI EQU   PSADSSF1
PSADSSOI EQU   PSADSSF1
PSADSSSP EQU   PSADSSF1
PSADSSTP EQU   PSADSSF1
PSADSSDW EQU   PSADSSF1
PSADSSDD EQU   PSADSSF1
PSADSSDM EQU   PSADSSF1
PSADSSMV EQU   PSADSSF1
PSADSSTS EQU   PSA+816
PSADSSWK EQU   PSA+812
PSADSSR3 EQU   PSA+808
PSADSSR2 EQU   PSA+804
PSADSSRS EQU   PSA+800
PSASTOR  EQU   PSA+796
PSACPUSA EQU   PSA+794
PSAVSTAP EQU   PSA+792
PSAWKVAP EQU   PSA+788
PSAWKRAP EQU   PSA+784
PSAMCHIC EQU   PSA+783
PSARV061 EQU   PSA+782
PSASYMSK EQU   PSA+781
PSAMCHFL EQU   PSA+780
PSACR0   EQU   PSA+776
PSAPSWSV EQU   PSA+768
PSALITA  EQU   PSA+764
PSACLHS  EQU   PSAHLHI
PSALKR15 EQU   PSALKSA+60
PSALKR14 EQU   PSALKSA+56
PSALKR13 EQU   PSALKSA+52
PSALKR12 EQU   PSALKSA+48
PSALKR11 EQU   PSALKSA+44
PSALKR10 EQU   PSALKSA+40
PSALKR9  EQU   PSALKSA+36
PSALKR8  EQU   PSALKSA+32
PSALKR7  EQU   PSALKSA+28
PSALKR6  EQU   PSALKSA+24
PSALKR5  EQU   PSALKSA+20
PSALKR4  EQU   PSALKSA+16
PSALKR3  EQU   PSALKSA+12
PSALKR2  EQU   PSALKSA+8
PSALKR1  EQU   PSALKSA+4
PSALKR0  EQU   PSALKSA
PSARV023 EQU   PSACLHT+52
PSALOCAL EQU   PSACLHT+48
PSACMSL  EQU   PSACLHT+44
PSAOPTL  EQU   PSACLHT+40
PSATPACL EQU   PSACLHT+36
PSATPDNL EQU   PSACLHT+32
PSATPNCL EQU   PSACLHT+28
PSAIOSLL EQU   PSACLHT+24
PSAIOSUL EQU   PSACLHT+20
PSAIOSCL EQU   PSACLHT+16
PSAIOSSL EQU   PSACLHT+12
PSASALCL EQU   PSACLHT+8
PSAASML  EQU   PSACLHT+4
PSADISPL EQU   PSACLHT
PSASRSA  EQU   PSA+636
PSARV050 EQU   PSA+634
PSADSSGO EQU   PSA+633
PSARECUR EQU   PSA+632
PSAHLHIS EQU   PSA+628
PSAIPCSA EQU   PSA+624
@NM00077 EQU   PSA+621
PSAIPCDM EQU   PSA+620
PSAIPCD  EQU   PSA+616
@NM00076 EQU   PSA+613
PSAIPCRM EQU   PSA+612
PSAIPCR  EQU   PSA+608
PSAMCHEX EQU   PSA+600
PSAMPSW  EQU   PSA+592
PSAEXPS2 EQU   PSA+584
PSAEXPS1 EQU   PSA+576
PSAPIREG EQU   PSA+572
PSARSREG EQU   PSA+568
PSAGPREG EQU   PSA+556
PSARV022 EQU   PSASUP4
PSARV021 EQU   PSASUP4
PSARV020 EQU   PSASUP4
PSARV019 EQU   PSASUP4
PSARV018 EQU   PSASUP4
PSARV017 EQU   PSASUP4
PSARV016 EQU   PSASUP4
PSARV015 EQU   PSASUP4
PSARV014 EQU   PSASUP3
PSARV013 EQU   PSASUP3
PSARV012 EQU   PSASUP3
PSARV011 EQU   PSASUP3
PSASPR   EQU   PSASUP3
PSAPSREG EQU   PSASUP3
PSAPI2   EQU   PSASUP3
PSAIOSUP EQU   PSASUP3
PSALCR   EQU   PSASUP2
PSARTM   EQU   PSASUP2
PSAACR   EQU   PSASUP2
PSAIPCE2 EQU   PSASUP2
PSAIPCES EQU   PSASUP2
PSAIPCEC EQU   PSASUP2
PSAGTF   EQU   PSASUP2
PSAIPCRI EQU   PSASUP2
PSARV063 EQU   PSASUP1
PSATCTL  EQU   PSASUP1
PSADISP  EQU   PSASUP1
PSALOCK  EQU   PSASUP1
PSAPI    EQU   PSASUP1
PSAEXT   EQU   PSASUP1
PSASVC   EQU   PSASUP1
PSAIO    EQU   PSASUP1
PSAANEW  EQU   PSA+544
PSATOLD  EQU   PSA+540
PSATNEW  EQU   PSA+536
PSALCCAR EQU   PSA+532
PSALCCAV EQU   PSA+528
PSAPCCAR EQU   PSA+524
PSAPCCAV EQU   PSA+520
PSACPULA EQU   PSA+518
PSACPUPA EQU   PSA+516
PSAPSA   EQU   PSA+512
FLCHDEND EQU   PSA+512
FLCCRSAV EQU   FLCMCLA+280
FLCGRSAV EQU   FLCMCLA+216
FLCFPSAV EQU   FLCMCLA+184
FLCFLA   EQU   FLCMCLA+88
FLCRGNCD EQU   FLCMCLA+84
FLCFSAA  EQU   FLCFSA+1
@NM00075 EQU   FLCFSA
@NM00074 EQU   FLCMCLA+72
FLCMCIC  EQU   FLCMCLA+64
@NM00073 EQU   FLCMCLA+20
FLCIOAA  EQU   FLCIOA+1
@NM00072 EQU   FLCIOA
@NM00071 EQU   FLCMCLA+15
@NM00070 EQU   FLCMCLA+14
@NM00069 EQU   FLCMCLA+12
FLCLCL   EQU   FLCMCLA+8
FLCIOELA EQU   FLCIOEL+1
@NM00068 EQU   FLCIOEL
FLCCHNID EQU   FLCMCLA
@NM00067 EQU   PSA+160
FLCMTRCD EQU   PSA+157
@NM00066 EQU   PSA+156
FLCPERA  EQU   FLCPER+1
@NM00065 EQU   FLCPER
@NM00064 EQU   PSA+151
FLCPERCD EQU   PSA+150
FLCMCNUM EQU   PSA+149
@NM00063 EQU   PSA+148
FLCTEAA  EQU   FLCTEA+1
@NM00062 EQU   FLCTEA
PSAPIPC  EQU   PSAPICOD
PSAPIMC  EQU   PSAPICOD
PSAPIPER EQU   PSAPICOD
PSARV049 EQU   FLCPICOD
FLCPILCB EQU   FLCPIILC
@NM00061 EQU   FLCPIILC
@NM00060 EQU   PSAEPPSW
FLCSVCN  EQU   PSAESPSW+2
FLCSILCB EQU   FLCSVILC
@NM00059 EQU   FLCSVILC
@NM00058 EQU   PSAESPSW
FLCEICOD EQU   PSAEEPSW+2
PSASPAD  EQU   PSAEEPSW
@NM00057 EQU   PSA+128
FLCINPSW EQU   PSA+120
FLCMNPSW EQU   PSA+112
FLCPNPSW EQU   PSA+104
FLCSNPSW EQU   PSA+96
FLCENPSW EQU   PSA+88
FLCTRACE EQU   PSA+84
FLCTIMER EQU   PSA+80
FLCCVT2  EQU   PSA+76
FLCCAW   EQU   PSA+72
FLCCSW   EQU   PSA+64
FLCIOPSW EQU   PSA+56
FLCMOPSW EQU   PSA+48
FLCPOPSW EQU   PSA+40
FLCSOPSW EQU   PSA+32
FLCEOPSW EQU   PSA+24
@NM00056 EQU   FLCICCW2+4
FLCCVT   EQU   FLCICCW2
FLCICCW1 EQU   FLCROPSW
FLCIPPSW EQU   FLCRNPSW
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS
@RC00164 EQU   @RC00141
@ENDDATA EQU   *
         END   IKTIST00,(C'PLS1022',0702,78336)
