         TITLE '***** IGG0CLCA - FIRST CSECT OF INTERFACE MAPPER ***** *
                        '
IGG0CLCA CSECT ,                                                   0001
@MAINENT BALR  @15,0                                               0001
         USING *,@15                                               0001
         B     @PROLOG                                             0001
         DC    AL1(16)                                             0001
         DC    C'IGG0CLCA  78.206'                                 0001
         DROP  @15
@PROLOG  BALR  @11,0                                               0001
@PSTART  LA    @10,4095(,@11)                                      0001
         USING @PSTART,@11                                         0001
         USING @PSTART+4095,@10                                    0001
JSCBDISP EQU 188
JSCBAOS1 EQU  72
JSCBAOS2 EQU 192
RBPRFXLN EQU 64
RBPRFLNA EQU 32
PRBLEN   EQU 136
SIRBLEN  EQU 200
TIRBLEN  EQU 136
IRBLEN   EQU 128
SVRBLEN  EQU 200
*                                                         /*@ZA04937*/
         USING @DATD,12      ESTABLISH ADDRESSABILITY FOR WORKCLCA
         LA    R13,@SA00001   INIT FIRST SAVE AREA ADDR IN R13
*   IF CAMAM0='0'B&CTGPLPTR^=NULL   /* IF TRANS TO VSAM      @Z40CSRC*/
*     THEN                                                         0141
         L     @01,CAMPLPTR                                        0141
         TM    CAMAM0(@01),B'00000001'                             0141
         BNZ   @RF00141                                            0141
         L     @15,CTGPLPTR                                        0141
         LTR   @15,@15                                             0141
         BZ    @RF00141                                            0141
*     DO;                           /*                       @Z40CSRC*/
*                                                                  0142
*       /*************************************************************/
*       /*                                                           */
*       /* ORIGINAL REQUEST WAS OS SO FREE DYNAMIC AREA GOTTEN BY SVC*/
*       /* 26 USED TO BUILD A VSAM REQUEST                           */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0143
*       RFY                                                        0143
*        (R0,                                                      0143
*         R1) RSTD;                                                0143
*       R1=CTGPLPTR;                /* GET ADDRESS TO BE FREED       */
         LR    R1,@15                                              0144
*       R0=PRMLSTSZ;                /* GET LENGTH TO BE FREED        */
         L     R0,PRMLSTSZ                                         0145
*       CTGPLPTR='7FFFFFFF'X;       /* SET AREA FREED INDICATOR      */
         MVC   CTGPLPTR(4),@CF02930                                0146
*       GEN(FREEMAIN R,LV=(0),A=(1));/* FREEMAIN DYNAM AREA          */
         FREEMAIN R,LV=(0),A=(1)
*       RFY                                                        0148
*        (R0,                                                      0148
*         R1) UNRSTD;                                              0148
*     END;                                                         0149
*   ELSE                                                           0150
*     ;                                                            0150
@RF00141 DS    0H                                                  0151
*   VSRC15=ZEROPTR;                 /* INIT RETURN CODE              */
         L     @15,ZEROPTR                                         0151
         ST    @15,VSRC15                                          0151
*   OSRC15=ZEROPTR;                 /* INIT RETURN CODE              */
         ST    @15,OSRC15                                          0152
*   OSRC0=ZEROPTR;                  /* INIT RETURN CODE              */
         ST    @15,OSRC0                                           0153
*   OSRC1=ZEROPTR;                  /* INIT RETURN CODE      @Z40CSRC*/
         ST    @15,OSRC1                                           0154
*   KEYTYPE=OFF;                    /* DITTO                         */
         MVC   KEYTYPE(1),OFF                                      0155
*   INCORESW=OFF;                   /* DITTO                         */
         MVC   INCORESW(1),OFF                                     0156
*   ENQDEQSW=OFF;                   /* DITTO                         */
         MVC   ENQDEQSW(1),OFF                                     0157
*   GEN(STM   R10,R12,SAVER10);     /* SAVE ESTAE PARMS              */
         STM   R10,R12,SAVER10
*   GEN(XC    ESTAELST(16),ESTAELST);/* ZERO ESTAE MAC LIST          */
         XC    ESTAELST(16),ESTAELST
*   GEN;                                                           0160
   ESTAE ESTAEXIT,OV,PARAM=SAVER10,XCTL=NO,RECORD=YES,MF=(E,ESTAELST)
*   RFY                                                            0161
*     R15 RSTD;                                                    0161
*   IF R15^=0                       /* TEST RETURN CODE              */
*     THEN                                                         0162
         LTR   R15,R15                                             0162
         BZ    @RF00162                                            0162
*     IF CAMAM0='0'B                /* RC NOT ZERO,WAS REQ. OS       */
*       THEN                                                       0163
         L     @14,CAMPLPTR                                        0163
         TM    CAMAM0(@14),B'00000001'                             0163
         BNZ   @RF00163                                            0163
*       DO;                         /* REQUEST WAS OS                */
*         IF(CAMOPTNS&OSLOCMSK)=ALLZERO/* TEST FOR LOC               */
*           THEN                                                   0165
         MVC   @TS00001(4),CAMOPTNS(@14)                           0165
         NC    @TS00001(4),OSLOCMSK                                0165
         CLC   @TS00001(4),ALLZERO                                 0165
         BNE   @RF00165                                            0165
*           OSRC15=OS24;            /* LOCATE REQ,SET IO ERROR       */
         L     @14,OS24                                            0166
         ST    @14,OSRC15                                          0166
*         ELSE                                                     0167
*           OSRC15=OS28;            /* NONLOCATE REQ,SET IO ERROR    */
         B     @RC00165                                            0167
@RF00165 L     @14,OS28                                            0167
         ST    @14,OSRC15                                          0167
*         GO TO ENDIT;              /* GET OUT,CANNOT CONTINUE       */
         B     ENDIT                                               0168
*       END;                                                       0169
*     ELSE                                                         0170
*       DO;                         /* REQUEST WAS VSAM              */
@RF00163 DS    0H                                                  0171
*         OSRC15=VS164;             /* SET OUT OF CORE CONDITION     */
         L     @14,VS164                                           0171
         ST    @14,OSRC15                                          0171
*         GO TO ENDIT;              /* CANNOT CONTINUE,GET OUT       */
         B     ENDIT                                               0172
*       END;                                                       0173
*   RFY                                                            0174
*     R15 UNRSTD;                                                  0174
@RF00162 DS    0H                                                  0175
*   CALL IGG0CL1A;                  /* DYN ALLOC CATALOG     @Z40CSRC*/
         LA    @15,IGG0CL1A                                        0175
         BALR  @14,@15                                             0175
*                                                                  0176
*   /*****************************************************************/
*   /*                                                               */
*   /* CVOL DYNAMIC ALLOCATION ROUTINE                       @Z40CSRC*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0176
*IGG0CL1A:                                                         0176
*   PROC OPTIONS(ENTREG);           /*                       @Z40CSRC*/
         B     @PB00002                                            0176
IGG0CL1A STM   @14,@12,@SA00002                                    0176
*   GEN(ENTRY IGG0CL1A);            /* DEFINE AS ENTRY PT    @Z40CSRC*/
*                                                                  0177
         ENTRY IGG0CL1A
*   /*****************************************************************/
*   /*                                                               */
*   /* DECLARE ADDRESSES FOR MODULE BASE REGISTERS           @Z40CSRC*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0178
*   DCL                                                            0178
*     CLCABASE CHAR(8) GEND LOCAL BDY(WORD);/* BASES         @Z40CSRC*/
*                                                                  0178
*   /*****************************************************************/
*   /*                                                               */
*   /* SET UP ADDRESSABILITY                                 @Z40CSRC*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0179
*   RFY                                                            0179
*    (R10,                                                         0179
*     R11,                                                         0179
*     R15) RSTD;                    /*                       @Z40CSRC*/
*   GEN(USING IGG0CL1A,R15);        /* TEMPORARY BASE        @Z40CSRC*/
         USING IGG0CL1A,R15
*   LM(R10,R11,CLCABASE);           /* GET REGULAR BASES     @Z40CSRC*/
         LM    R10,R11,CLCABASE                                    0181
*   GEN(DROP  R15);                 /* DROP R15 AS BASE      @Z40CSRC*/
         DROP  R15
*   RFY                                                            0183
*    (R10,                                                         0183
*     R11,                                                         0183
*     R15) UNRSTD;                  /*                       @Z40CSRC*/
*                                                                  0183
*   /*****************************************************************/
*   /*                                                               */
*   /* SET UP CATALOG NAME IF NONE SUPPLIED BY VSAM CATALOG          */
*   /* MANAGEMENT BECAUSE (1) VSAM CATALOG PROCESSING WAS BYPASSED   */
*   /* BECAUSE A CVOL VOLSER WAS SPECIFIED IN THE OS CAMLST, OR (2)  */
*   /* OS CATALOG MANAGEMENT CHAINED TO THIS CVOL WHILE PROCESSING A */
*   /* REQUEST.                                              @Z40CSRC*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0184
*   RFY                                                            0184
*     R3 RSTD;                      /* RESTRICT REGISTER     @Z40CSRC*/
*   IF WKCVOLVS^=NOVOLSER THEN      /* IF VOLSER PRESENT     @Z40CSRC*/
         CLC   WKCVOLVS(6),@CB02928                                0185
         BE    @RF00185                                            0185
*     DO;                           /*                       @Z40CSRC*/
*       R3=ADDR(WKCATNM);           /* BUILD STD NAME AS OFFICIAL  0187
*                                      CATALOG NAME          @Z40CSRC*/
         LA    R3,WKCATNM                                          0187
*       WKCATANM=WKCATANM&&WKCATANM;/* NO ALIAS NAME         @Z40CSRC*/
         XC    WKCATANM(44),WKCATANM                               0188
*     END;                          /*                       @Z40CSRC*/
*   ELSE                            /* USE NAME FROM VSAM    @Z40CSRC*/
*     R3=ADDR(WKTMPCNM);            /* PUT STD NM IN TEMP    @Z40CSRC*/
         B     @RC00185                                            0190
@RF00185 LA    R3,WKTMPCNM                                         0190
*   WKSTDNM=SYSCNAME;               /* MOVE 'SYSCTLG.V'      @Z40CSRC*/
@RC00185 MVI   WKSTDNM+9(R3),C' '                                  0191
         MVC   WKSTDNM+10(34,R3),WKSTDNM+9(R3)                     0191
         MVC   WKSTDNM(9,R3),@CC02916                              0191
*   WKSTDVS=WKCVOLVS;               /* MV VOLSER (IF ANY)    @Z40CSRC*/
*                                                                  0192
         MVC   WKSTDVS(6,R3),WKCVOLVS                              0192
*   /*****************************************************************/
*   /*                                                               */
*   /* SEARCH PCCB CHAIN TO SEE IF CVOL IS ALREADY ALLOCATED. IF NOT,*/
*   /* CHECK IF ALLOCATION IS ALLOWED BY THE REQUESTOR. IF NOT, SET A*/
*   /* RETURN CODE. OTHERWISE SET UP & CALL THE ALLOCATE CATALOG     */
*   /* INTERFACE MODULE, IEFAB4F5, TO DO THE ACTUAL ALLOCATION.      */
*   /*                                                       @Z40CSRC*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0193
*   CALL SRCHPCCB;                  /* GO FIND A PCCB FOR CATLG      */
         BAL   @14,SRCHPCCB                                        0193
*   IF PCCBPTR^=0 THEN                                             0194
         L     @02,PCCBPTR                                         0194
         LTR   @02,@02                                             0194
         BZ    @RF00194                                            0194
*     WKCVOLVS=PCVOLSER;            /* PCCB FOUND, SAVE VOLSER       */
         MVC   WKCVOLVS(6),PCVOLSER(@02)                           0195
*   ELSE                                                           0196
*     DO;                           /* PCCB NOT FOUND SO ALLOCATE IT
*                                      IF POSSIBLE                   */
         B     @RC00194                                            0196
@RF00194 DS    0H                                                  0197
*       IF CAMAM0='0'B              /* IS REQUEST OS                 */
*         THEN                                                     0197
         L     @02,CAMPLPTR                                        0197
         TM    CAMAM0(@02),B'00000001'                             0197
         BNZ   @RF00197                                            0197
*         IF CAMNOALC='1'B          /* YES,CAN WE ALLOCATE           */
*           THEN                                                   0198
         TM    CAMNOALC(@02),B'10000000'                           0198
         BNO   @RF00198                                            0198
*           IF(CAMOPTNS&OSLOCMSK)=ALLZERO/* NO                       */
*             THEN                                                 0199
         MVC   @TS00001(4),CAMOPTNS(@02)                           0199
         NC    @TS00001(4),OSLOCMSK                                0199
         CLC   @TS00001(4),ALLZERO                                 0199
         BNE   @RF00199                                            0199
*             OSRC15=OS24;          /* LOCATE,SET IO ERROR           */
         L     @02,OS24                                            0200
         ST    @02,OSRC15                                          0200
*           ELSE                                                   0201
*             OSRC15=OS4;           /* NONLOCATE,SET RC OF 4         */
         B     @RC00199                                            0201
@RF00199 L     @02,OS4                                             0201
         ST    @02,OSRC15                                          0201
*         ELSE                                                     0202
*           ;                       /* YES WE CAN ALLOCATE           */
@RF00198 DS    0H                                                  0203
*       ELSE                                                       0203
*         IF CTGDOCAT='1'B          /* VSAM REQUEST,CAN WE ALLOC     */
*           THEN                                                   0203
         B     @RC00197                                            0203
@RF00197 L     @02,CTGPLPTR                                        0203
         TM    CTGDOCAT(@02),B'01000000'                           0203
         BNO   @RF00203                                            0203
*           IF CTGSUPLT='1'B        /* NO,WAS REQUEST SUPERLOC       */
*             THEN                  /* YES                           */
         TM    CTGSUPLT(@02),B'00010000'                           0204
         BNO   @RF00204                                            0204
*             DO;                   /* SUPERLOCATE           #YM03768*/
*               CALL GETUSERK;      /* GET INTO USERKEY      #YM03768*/
         BAL   @14,GETUSERK                                        0206
*               CTGCVDSN=WKCATNM;   /* RETURN CATNAME        #YM03768*/
         L     @02,CTGPLPTR                                        0207
         L     @02,CTGCVOL(,@02)                                   0207
         MVC   CTGCVDSN(44,@02),WKCATNM                            0207
*               CTGCVCC=WKCATANM;   /* RETURN ALIAS          #YM03768*/
         MVC   CTGCVCC(44,@02),WKCATANM                            0208
*               CALL GETSVCK;       /* GET INTO SVC KEY      #YM03768*/
         BAL   @14,GETSVCK                                         0209
*               OSRC15=VS68;        /* EXIT WITH RC OF 68            */
         L     @02,VS68                                            0210
         ST    @02,OSRC15                                          0210
*               CTGSRH='0'B;        /* INITIATE NEW SRCH     @OZ17073*/
         L     @02,CTGPLPTR                                        0211
         NI    CTGSRH(@02),B'11111011'                             0211
*             END;                  /*                       #YM03768*/
*           ELSE                                                   0213
*             OSRC15=VS48;          /* NO,EXIT WITH RC OF 48         */
         B     @RC00204                                            0213
@RF00204 L     @02,VS48                                            0213
         ST    @02,OSRC15                                          0213
*         ELSE                                                     0214
*           ;                       /* YES WE CAN ALLOCATE           */
@RF00203 DS    0H                                                  0215
*       IF OSRC15=0                 /* ANY ERRORS SO FAR             */
*         THEN                                                     0215
@RC00203 DS    0H                                                  0215
@RC00197 SLR   @02,@02                                             0215
         C     @02,OSRC15                                          0215
         BNE   @RF00215                                            0215
*         DO;                       /* NO,SO CONTINUE                */
*           ACCCBP=ADDR(ACCCB);     /* SET CONT.BIT PTR              */
         LA    @15,ACCCB                                           0217
         ST    @15,ACCCBP                                          0217
*           ACCRWP1=ADDR(ACCRWP2);  /* SET RET WORD PTR1             */
         LA    @15,ACCRWP2                                         0218
         ST    @15,ACCRWP1                                         0218
*           ACCJSCBP=ADDR(TCBJSCB); /* SET JSCB PTR                  */
         L     @15,TCBPTR                                          0219
         LA    @14,TCBJSCB(,@15)                                   0219
         ST    @14,ACCJSCBP                                        0219
*           ACCCATP1=ADDR(ACCCATP2);/* SET CAT PTR 1                 */
         LA    @14,ACCCATP2                                        0220
         ST    @14,ACCCATP1                                        0220
*           ACCALSP1=ADDR(ACCALSP2);/* SET ALIAS PTR 1               */
         LA    @14,ACCALSP2                                        0221
         ST    @14,ACCALSP1                                        0221
*           ACCDDNMP=ADDR(ZEROPTR); /* SET DDNAME PTR                */
         LA    @14,ZEROPTR                                         0222
         ST    @14,ACCDDNMP                                        0222
*           ACCRWP2=ADDR(ACCRW);    /* SET RET WORD PTR 2            */
         LA    @14,ACCRW                                           0223
         ST    @14,ACCRWP2                                         0223
*           ACCCATP2=ADDR(WKCATNM); /* POINT TO CATLG.NM             */
         LA    @14,WKCATNM                                         0224
         ST    @14,ACCCATP2                                        0224
*           ACCALSP2=ADDR(WKCATANM);/* POINT TO ALIAS.NM             */
         LA    @14,WKCATANM                                        0225
         ST    @14,ACCALSP2                                        0225
*           ACCRW=ALLZERO;          /* ZERO OUT RETURN WORD          */
         L     @14,ALLZERO                                         0226
         ST    @14,ACCRW                                           0226
*           IF ASCBTSB^=0&PSCBVMNT='0'B/* TSO REQUEST & MOUNTING NOT
*                                      OK?                   @OZ07009*/
*             THEN                                                 0227
         L     @01,PSAAOLD                                         0227
         C     @02,ASCBTSB(,@01)                                   0227
         BE    @RF00227                                            0227
         L     @02,TCBJSCB(,@15)                                   0227
         L     @02,JSCBPSCB(,@02)                                  0227
         TM    PSCBVMNT(@02),B'00010000'                           0227
         BNZ   @RF00227                                            0227
*             ACCCB=ACCOPTN1;       /* NOT OK,SET ACC OPTS   @OZ07009*/
         MVC   ACCCB(2),ACCOPTN1                                   0228
*           ELSE                                                   0229
*             ACCCB=ACCOPTNS;       /* OK, SET ACC OPTNS     @OZ07009*/
         B     @RC00227                                            0229
@RF00227 MVC   ACCCB(2),ACCOPTNS                                   0229
*           IF CAMAM0='1'B THEN     /* CTGPL?                @OZ28096*/
@RC00227 L     @02,CAMPLPTR                                        0230
         TM    CAMAM0(@02),B'00000001'                             0230
         BNO   @RF00230                                            0230
*             IF CTGTIOT='1'B THEN  /* SYSZTIOT ENQED?       @OZ28096*/
         L     @02,CTGPLPTR                                        0231
         TM    CTGTIOT(@02),B'00000100'                            0231
         BNO   @RF00231                                            0231
*               CALL CHEKAUTH;      /* CALLER AUTHORIZED?    @OZ28096*/
         BAL   @14,CHEKAUTH                                        0232
*             ELSE                                                 0233
*               GOTO NOENQ;         /* CALLER NOT ENQED      @OZ28096*/
*           ELSE                                                   0234
*             IF CAMTIOT='1'B THEN  /* SYSZTIOT ENQED?       @OZ28096*/
         B     @RC00230                                            0234
@RF00230 L     @02,CAMPLPTR                                        0234
         TM    CAMTIOT(@02),B'00010000'                            0234
         BNO   @RF00234                                            0234
*               CALL CHEKAUTH;      /* CALLER AUTHORIZED?    @OZ28096*/
         BAL   @14,CHEKAUTH                                        0235
*             ELSE                                                 0236
*               GOTO NOENQ;         /* CALLER NOT ENQED      @OZ28096*/
*           RFY                                                    0237
*            (R1,                                                  0237
*             R15) RSTD;                                           0237
@RC00230 DS    0H                                                  0238
*           IF R15=ALLZERO THEN     /* CALLER AUTHRIZED      @OZ19636*/
         CL    R15,ALLZERO                                         0238
         BNE   @RF00238                                            0238
*             ACAC6='1'B;           /* YES-SET TIOT ENQD     @OZ19636*/
         OI    ACAC6,B'00000010'                                   0239
*           ELSE                                                   0240
*             ;                                                    0240
@RF00238 DS    0H                                                  0241
*NOENQ:                                                            0241
*           R1=ADDR(ACCCBP);        /* SET PARM LIST PTR             */
NOENQ    LA    R1,ACCCBP                                           0241
*           GEN(ST    R13,WKCL1ASV+4);/* SAVE ADDR           @Z40CSRC*/
         ST    R13,WKCL1ASV+4
*           GEN(LA    R13,WKCL1ASV);/* NEW SV AREA           @Z40CSRC*/
         LA    R13,WKCL1ASV
*           GEN(LINK  EP=IEFAB4F5); /* GO TO ACC             @Z40CSRC*/
         LINK  EP=IEFAB4F5
*           GEN(L     R13,WKCL1ASV+4);/* OLD AREA            @Z40CSRC*/
         L     R13,WKCL1ASV+4
*           IF ACCRETCD^=0          /* WAS ALLOC CAT.CONTROL OK      */
*             THEN                                                 0246
         LH    @14,ACCRETCD                                        0246
         N     @14,@CF03065                                        0246
         LTR   @14,@14                                             0246
         BZ    @RF00246                                            0246
*             OSRC15=OS4;           /* NO, EXIT WITH RC OF 4         */
         L     @14,OS4                                             0247
         ST    @14,OSRC15                                          0247
*           ELSE                                                   0248
*             DO;                   /* YES, GO SEARCH FOR PCCB       */
         B     @RC00246                                            0248
@RF00246 DS    0H                                                  0249
*               CALL SRCHPCCB;                                     0249
         BAL   @14,SRCHPCCB                                        0249
*               IF PCCBPTR^=0 THEN  /* PCCB FOUND            @Z40CSRC*/
         L     @14,PCCBPTR                                         0250
         LTR   @14,@14                                             0250
         BZ    @RF00250                                            0250
*                 DO;               /* SYSDSN ENQ GROUP      @Z40CSRC*/
*                   WKCVOLVS=PCVOLSER;/* SAVE CVOL VOLSER    @Z40CSRC*/
*                                                                  0252
         MVC   WKCVOLVS(6),PCVOLSER(@14)                           0252
*                   /*************************************************/
*                   /*                                               */
*                   /* PERFORM AN ENQ WITH MAJOR-NAME=SYSDSN AND     */
*                   /* MINOR-NAME = SYSCTLG.VXXXXXX WHERE XXXXXX IS  */
*                   /* THE VOLSER OF THE CVOL. THIS WILL PREVENT     */
*                   /* SCRATCHING OF THE CVOL DURING SVC 26          */
*                   /* PROCESSING. PRIOR TO THE SYSDSN ENQ, A        */
*                   /* SYSZOPEN ENQ MUST BE DONE TO PREVENT AN       */
*                   /* UNALLOCATION WHICH COULD DEQ THE SYSDSN ENQ.  */
*                   /*                                               */
*                   /*************************************************/
*                                                                  0253
*                   WKSTDVS=WKCVOLVS;/* PUT VOLSER IN NAME   @Z40CSRC*/
         MVC   WKSTDVS(6,R3),WKCVOLVS                              0253
*                   RFY                                            0254
*                    (R1,                                          0254
*                     R4,                                          0254
*                     R15) RSTD;    /* RESTRICT REG.S        @Z40CSRC*/
*                   R4=JSCBTCBP;    /* INIT'S TCB ADDR       @Z40CSRC*/
         L     @14,TCBPTR                                          0255
         L     @14,TCBJSCB(,@14)                                   0255
         L     R4,JSCBTCBP(,@14)                                   0255
*                   ENQDEQPL=ENQSYSDS;/* COPY LIST FORM      @Z40CSRC*/
         MVC   ENQDEQPL(12),ENQSYSDS                               0256
*                   GEN(ENQ (,(R3)),RET=USE,TCB=(R4),MF=(E,ENQDEQPL));
         ENQ (,(R3)),RET=USE,TCB=(R4),MF=(E,ENQDEQPL)
*                                   /*                       @Z40CSRC*/
*                   IF ENQRETCD^=ENQRCOK/* IF ENQ NOT DONE   @Z40CSRC*/
*                       &ENQRETCD^=ENQRCIS THEN/* & DONT ALREADY OWN
*                                                            @Z40CSRC*/
         CLI   ENQRETCD,0                                          0258
         BE    @RF00258                                            0258
         CLI   ENQRETCD,8                                          0258
         BE    @RF00258                                            0258
*                     OSRC15=OS4;   /* SET CVOL UNAVAIL.     @Z40CSRC*/
         L     @14,OS4                                             0259
         ST    @14,OSRC15                                          0259
*                   ELSE            /* SYSZOPEN ENQ'D        @Z40CSRC*/
*                     DO;           /* 2ND ENQ GROUP         @Z40CSRC*/
         B     @RC00258                                            0260
@RF00258 DS    0H                                                  0261
*                       GEN REFS(SYSDSN)                           0261
*(ENQ (SYSDSN,(R3)),RET=USE,TCB=(R4),MF=(E,ENQDEQPL));/*     @Z40CSRC*/
         ENQ (SYSDSN,(R3)),RET=USE,TCB=(R4),MF=(E,ENQDEQPL)
*                       IF ENQRETCD=ENQRCOK/* IF ENQ'D OK    @Z40CSRC*/
*                           ×ENQRETCD=ENQRCIS THEN                 0262
         CLI   ENQRETCD,0                                          0262
         BE    @RT00262                                            0262
         CLI   ENQRETCD,8                                          0262
         BE    @RT00262                                            0262
*                         ;         /* OR ALREADY ENQ'D      @Z40CSRC*/
*                       ELSE        /* SOMEONE ELSE ENQ'D    @Z40CSRC*/
*                         OSRC15=OS4;/* SET CVOL UNAVAIL.    @Z40CSRC*/
         L     @14,OS4                                             0264
         ST    @14,OSRC15                                          0264
*                     END;          /* OF 2ND ENQ GROUP      @Z40CSRC*/
@RT00262 DS    0H                                                  0266
*                   RFY                                            0266
*                    (R1,                                          0266
*                     R4,                                          0266
*                     R15) UNRSTD;  /* UNRESTRICT REG.S      @Z40CSRC*/
@RC00258 DS    0H                                                  0267
*                 END;              /* OF SYSDSN GROUP       @Z40CSRC*/
*               ELSE                                               0268
*                 OSRC15=OS4;       /* PCCB NOT FOUND,EXIT WITH RC OF
*                                      4                             */
         B     @RC00250                                            0268
@RF00250 L     @02,OS4                                             0268
         ST    @02,OSRC15                                          0268
*             END;                                                 0269
@RC00250 DS    0H                                                  0270
*         END;                                                     0270
@RC00246 DS    0H                                                  0271
*     END;                                                         0271
@RF00215 DS    0H                                                  0272
*   RFY                                                            0272
*     R3 UNRSTD;                    /* UNRESTRICT REG.       @Z40CSRC*/
@RC00194 DS    0H                                                  0273
*   RETURN CODE(OSRC15);            /* PUT RET CD IN REG     @Z40CSRC*/
         L     @15,OSRC15                                          0273
         L     @14,@SA00002                                        0273
         LM    @00,@12,@SA00002+8                                  0273
         BR    @14                                                 0273
*   GEN;                                                           0274
*                                     /* GEN BASES          @Z40CSRC*/
CLCABASE DC    A(@PSTART+4095,@PSTART) BASE ADDRESSES        @Z40CSRC
*   END;                            /* OF IGG0CL1A           @Z40CSRC*/
@EL00002 DS    0H                                                  0275
@EF00002 DS    0H                                                  0275
@ER00002 LM    @14,@12,@SA00002                                    0275
         BR    @14                                                 0275
@PB00002 DS    0H                                                  0276
*   IF OSRC15=0 THEN                                               0276
         L     @15,OSRC15                                          0276
         LTR   @15,@15                                             0276
         BNZ   @RF00276                                            0276
*     DO;                           /* CATALOG IS ALLOCATED SO DO  0277
*                                      REQUEST                       */
*       IF CAMAM0='0'B THEN                                        0278
*                                                                  0278
         L     @01,CAMPLPTR                                        0278
         TM    CAMAM0(@01),B'00000001'                             0278
         BNZ   @RF00278                                            0278
*         /***********************************************************/
*         /*                                                         */
*         /* THE ORIGINAL REQUEST WAS OS CAMLST FORMAT. AN INTERNAL  */
*         /* PROCEDURE IS CALLED TO VERIFY AND EXECUTE THE REQUEST.  */
*         /*                                                         */
*         /***********************************************************/
*                                                                  0279
*         CALL OSREQ;               /* CALL OSREQ PROC               */
         BAL   @14,OSREQ                                           0279
*       ELSE                                                       0280
*                                                                  0280
*         /***********************************************************/
*         /*                                                         */
*         /* THE ORIGINAL REQUEST WAS VSAM FORMAT. DECIDE WHICH      */
*         /* GENERAL FORM OF REQUEST IS SPECIFIED AND CALL THE       */
*         /* APPROPRIATE PROCESSING PROC. IF THE REQUEST IS NOT      */
*         /* SUPPORTED SET AN ERROR RETURN CODE AND EXIT.            */
*         /*                                                         */
*         /***********************************************************/
*                                                                  0280
*         DO;                                                      0280
         B     @RC00278                                            0280
@RF00278 DS    0H                                                  0281
*           IF CTGSUPLT='1'B&CTGGENLD='0'B THEN                    0281
*                                                                  0281
         L     @15,CTGPLPTR                                        0281
         TM    CTGSUPLT(@15),B'00010000'                           0281
         BNO   @RF00281                                            0281
         TM    CTGGENLD(@15),B'00000001'                           0281
         BNZ   @RF00281                                            0281
*             /*******************************************************/
*             /*                                                     */
*             /* SUPERLOCATE REQUEST WITHOUT GENERIC LOCATE          */
*             /* SPECIFIED.                                          */
*             /*                                                     */
*             /*******************************************************/
*                                                                  0282
*             CALL SUPERLOC;        /* CALL SUPERLOCATE PROC         */
         BAL   @14,SUPERLOC                                        0282
*           ELSE                                                   0283
*             IF CTGFUNC='001'B THEN                               0283
*                                                                  0283
         B     @RC00281                                            0283
@RF00281 L     @01,CTGPLPTR                                        0283
         TM    CTGFUNC(@01),B'00100000'                            0283
         BNO   @RF00283                                            0283
         TM    CTGFUNC(@01),B'11000000'                            0283
         BNZ   @RF00283                                            0283
*               /*****************************************************/
*               /*                                                   */
*               /* VSAM LOCATE REQUEST SPECIFIED.                    */
*               /*                                                   */
*               /*****************************************************/
*                                                                  0284
*               CALL VLOC;          /* CALL LOCATE PROC              */
         BAL   @14,VLOC                                            0284
*             ELSE                                                 0285
*               IF CTGOPTNS='00011'B THEN                          0285
*                                                                  0285
         B     @RC00283                                            0285
@RF00283 L     @01,CTGPLPTR                                        0285
         TM    CTGOPTNS(@01),B'00011000'                           0285
         BNO   @RF00285                                            0285
         TM    CTGOPTNS(@01),B'11100000'                           0285
         BNZ   @RF00285                                            0285
*                 /***************************************************/
*                 /*                                                 */
*                 /* VSAM DELETE REQUEST SPECIFIED.                  */
*                 /*                                                 */
*                 /***************************************************/
*                                                                  0286
*                 CALL DELETE;      /* CALL DELETE PROC              */
         BAL   @14,DELETE                                          0286
*               ELSE                                               0287
*                 IF CTGSUPLT='1'B&CTGGENLD='1'B THEN              0287
*                                                                  0287
         B     @RC00285                                            0287
@RF00285 L     @15,CTGPLPTR                                        0287
         TM    CTGSUPLT(@15),B'00010000'                           0287
         BNO   @RF00287                                            0287
         TM    CTGGENLD(@15),B'00000001'                           0287
         BNO   @RF00287                                            0287
*                   /*************************************************/
*                   /*                                               */
*                   /* SUPERLOCATE REQUEST WITH GENERIC LOCATE       */
*                   /* SPECIFIED.                                    */
*                   /*                                               */
*                   /*************************************************/
*                                                                  0288
*                   CALL GENLOC;    /* CALL GEN.LOC. PROC            */
         BAL   @14,GENLOC                                          0288
*                 ELSE                                             0289
*                   IF CTGFUNC='100'B&CTGOPTNS='00100'B&CTGGTNXT='0'B
*                     THEN                                         0289
*                                                                  0289
         B     @RC00287                                            0289
@RF00287 L     @15,CTGPLPTR                                        0289
         TM    CTGFUNC(@15),B'10000000'                            0289
         BNO   @RF00289                                            0289
         TM    CTGFUNC(@15),B'01100000'                            0289
         BNZ   @RF00289                                            0289
         TM    CTGOPTNS(@15),B'00100000'                           0289
         BNO   @RF00289                                            0289
         TM    CTGOPTNS(@15),B'11011000'                           0289
         BNZ   @RF00289                                            0289
         TM    CTGGTNXT(@15),B'00010000'                           0289
         BNZ   @RF00289                                            0289
*                     /***********************************************/
*                     /*                                             */
*                     /* AMS LISTCAT SPECIFIED WITHOUT GET NEXT      */
*                     /* OPTION.                                     */
*                     /*                                             */
*                     /***********************************************/
*                                                                  0290
*                     CALL VLOC;    /* USE VLOC PROC                 */
         BAL   @14,VLOC                                            0290
*                   ELSE                                           0291
*                     VSRC15=VS48;  /* REQUEST TYPE NOT SUPPORTED    */
         B     @RC00289                                            0291
@RF00289 L     @15,VS48                                            0291
         ST    @15,VSRC15                                          0291
*           IF OSRC15=OS4           /* IF NO CATALOG ENCOUNTERED   0292
*                                                            @YM06137*/
*             THEN                                                 0292
@RC00289 DS    0H                                                  0292
@RC00287 DS    0H                                                  0292
@RC00285 DS    0H                                                  0292
@RC00283 DS    0H                                                  0292
@RC00281 CLC   OSRC15(4),OS4                                       0292
         BE    @RT00292                                            0292
*             ;                     /* LEAVE RC=4            @YM06137*/
*           ELSE                    /*                       @YM06137*/
*             OSRC15=VSRC15;        /* ELSE SET UP COMMON    @YM06137
*                                      RETURN CODE           @YM06137*/
         L     @15,VSRC15                                          0294
         ST    @15,OSRC15                                          0294
*         END;                                                     0295
*     END;                                                         0296
*   ELSE                                                           0297
*     ;                                                            0297
@RF00276 DS    0H                                                  0298
*ENDIT:                                                            0298
*   GEN(ESTAE 0);                   /* REMOVE ESTAE                  */
@RC00276 DS    0H                                                  0298
ENDIT    ESTAE 0
*   RFY                                                            0299
*    (R0,                                                          0299
*     R1,                                                          0299
*     R2,                                                          0299
*     R3,                                                          0299
*     R4,                                                          0299
*     R14,                                                         0299
*     R15) RSTD;                    /*                       @Z40CSRC*/
*   R2=EXITSAV;                     /* SAVE RETURN ADDRESS           */
         L     R2,EXITSAV                                          0300
*   LM(R3,R4,OSRC150);              /* RET CDS FOR 15 & 0    @Z40CSRC*/
         LM    R3,R4,OSRC150                                       0301
*   R14=OSRC1;                      /* RET CODE FOR R1       @Z40CSRC*/
         L     R14,OSRC1                                           0302
*   GEN(L     R0,@SIZDATD);         /* R0 = LENGTH FOR FREEMAIN      */
         L     R0,@SIZDATD
*   R1=R12;                         /* R1 = ADDRESS FOR FREEMAIN     */
         LR    R1,R12                                              0304
*   GEN(FREEMAIN R,LV=(0),A=(1));   /* FREEMAIN WORKCLCA             */
         FREEMAIN R,LV=(0),A=(1)
*   R15=R3;                         /* RESET R15 RETURN CODE         */
         LR    R15,R3                                              0306
*   R0=R4;                          /* SET R0=REASON CODE    @Z40CSRC*/
         LR    R0,R4                                               0307
*   R1=R14;                         /* SET R1=REASON CODE    @Z40CSRC*/
         LR    R1,R14                                              0308
*   R14=R2;                         /* SET RETURN POINT              */
         LR    R14,R2                                              0309
*   GEN(BR    R14    RETURN TO USER);/* EXIT BACK TO USER            */
         BR    R14    RETURN TO USER
*   RFY                                                            0311
*    (R0,                                                          0311
*     R1,                                                          0311
*     R2,                                                          0311
*     R3,                                                          0311
*     R4,                                                          0311
*     R14,                                                         0311
*     R15) UNRSTD;                  /*                       @Z40CSRC*/
*                                                                  0312
*   /*****************************************************************/
*   /*                                                               */
*   /* SRCHPCCB IS CALLED TO SEARCH THE PCCB CHAIN AND SEE IF A PCCB */
*   /* FOR THE NEEDED CATALOG IS ALREADY ON THE CHAIN. IF IT IS      */
*   /* PCCBPTR WILL POINT TO IT ELSE IT WILL BE ZEROED.              */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0312
*SRCHPCCB:                                                         0312
*   PROC OPTIONS(SAVEAREA(16),SAVE(14));                           0312
         B     @PB00003                                            0312
SRCHPCCB ST    @14,12(,@13)                                        0312
         ST    @13,@SA00003+4                                      0312
         LA    @14,@SA00003                                        0312
         LR    @13,@14                                             0312
*   PCCBSW=OFF;                     /* TURN DO WHILE SWITCH OFF      */
         MVC   PCCBSW(1),OFF                                       0313
*   RFY                                                            0314
*     R1 RSTD;                                                     0314
*   ENQDEQPL=ENQDEQML;              /* COPY ENQ-DEQ LIST MAC FORM    */
         MVC   ENQDEQPL(12),ENQDEQML                               0315
*   R1=ADDR(ENQDEQPL);              /* POINT TO LIST FORM            */
         LA    R1,ENQDEQPL                                         0316
*   GEN(ENQ   MF=(E,(1)));          /* ENQ ON PCCB CHAIN             */
         ENQ   MF=(E,(1))
*   ENQDEQSW=ON;                    /* INDICATE ENQUED               */
         MVC   ENQDEQSW(1),ON                                      0318
*   R1=JSCBACT;                     /* GET ADDR OF ACTIVE JSCB       */
         L     @15,TCBPTR                                          0319
         L     @15,TCBJSCB(,@15)                                   0319
         L     R1,JSCBACT(,@15)                                    0319
*   PCCBPTR=R1->JSCBPCC;            /* GET ADDR OF FIRST PCCB        */
         L     @00,JSCBPCC(,R1)                                    0320
         ST    @00,PCCBPTR                                         0320
*   RFY                                                            0321
*     R1 UNRSTD;                                                   0321
*   DO WHILE(PCCBSW=OFF);           /* SEARCH PCCB CHAIN             */
         B     @DE00322                                            0322
@DL00322 DS    0H                                                  0323
*     IF PCCBPTR=0 THEN                                            0323
         L     @15,PCCBPTR                                         0323
         LTR   @15,@15                                             0323
         BNZ   @RF00323                                            0323
*       PCCBSW=ON;                  /* END OF CHAIN,STOP LOOP        */
         MVC   PCCBSW(1),ON                                        0324
*     ELSE                                                         0325
*       DO;                                                        0325
         B     @RC00323                                            0325
@RF00323 DS    0H                                                  0326
*         IF PCCACTIV='1'B&         /* IS PCCB ACTIVE                */
*             WKCATNM=PCCDSNAM&     /* DOES CATALOG NAME MATCH       */
*             PCOSCVOL='1'B&        /* IS THIS A CVOL PCCB           */
*             PCCACBP=0             /* IS ACB PTR ZERO               */
*           THEN                                                   0326
         L     @15,PCCBPTR                                         0326
         TM    PCCACTIV(@15),B'00100000'                           0326
         BNO   @RF00326                                            0326
         CLC   WKCATNM(44),PCCDSNAM(@15)                           0326
         BNE   @RF00326                                            0326
         TM    PCOSCVOL(@15),B'00010000'                           0326
         BNO   @RF00326                                            0326
         L     @15,PCCACBP(,@15)                                   0326
         LTR   @15,@15                                             0326
         BNZ   @RF00326                                            0326
*           PCCBSW=ON;              /* YES,PCCB FOUND,STOP LOOP      */
         MVC   PCCBSW(1),ON                                        0327
*         ELSE                                                     0328
*           PCCBPTR=PCCNEXTP;       /* NO,GET NEXT PCCB              */
         B     @RC00326                                            0328
@RF00326 L     @01,PCCBPTR                                         0328
         L     @15,PCCNEXTP(,@01)                                  0328
         ST    @15,PCCBPTR                                         0328
*       END;                                                       0329
@RC00326 DS    0H                                                  0330
*   END;                                                           0330
@RC00323 DS    0H                                                  0330
@DE00322 CLC   PCCBSW(1),OFF                                       0330
         BE    @DL00322                                            0330
*   RFY                                                            0331
*     R1 RSTD;                                                     0331
*   R1=ADDR(ENQDEQPL);              /* POINT TO LIST FORM            */
         LA    R1,ENQDEQPL                                         0332
*   GEN(DEQ   MF=(E,(1)));          /* DEQ FROM PCCB CHAIN           */
         DEQ   MF=(E,(1))
*   ENQDEQSW=OFF;                   /* INDICATE NOT ENQUED           */
         MVC   ENQDEQSW(1),OFF                                     0334
*   RFY                                                            0335
*     R1 UNRSTD;                                                   0335
*   END SRCHPCCB;                                                  0336
@EL00003 L     @13,4(,@13)                                         0336
@EF00003 DS    0H                                                  0336
@ER00003 L     @14,12(,@13)                                        0336
         BR    @14                                                 0336
*                                                                  0337
*   /*****************************************************************/
*   /*                                                               */
*   /* OSREQ IS CALLED TO SET UP AND EXECUTE AN ORIGINAL REQUEST THAT*/
*   /* WAS OS CAMLST FORMAT.                                         */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0337
*OSREQ:                                                            0337
*   PROC OPTIONS(SAVEAREA(16),SAVE(14));                           0337
OSREQ    ST    @14,12(,@13)                                        0337
         ST    @13,@SA00004+4                                      0337
         LA    @14,@SA00004                                        0337
         LR    @13,@14                                             0337
*   WKOPTNS=CAMOPTNS;               /* OPTION BITS TO WKAREA         */
         L     @01,CAMPLPTR                                        0338
         MVC   WKOPTNS(4),CAMOPTNS(@01)                            0338
*   IF(WKOPTNS(1:1)&'00100000'B)='00100000'B THEN                  0339
*                                                                  0339
         MVC   @TS00001(1),WKOPTNS                                 0339
         NI    @TS00001,B'00100000'                                0339
         CLI   @TS00001,B'00100000'                                0339
         BNE   @RF00339                                            0339
*     /***************************************************************/
*     /*                                                             */
*     /* IF CAT IS SPECIFIED MAKE SURE IT IS A CATBX                 */
*     /*                                                             */
*     /***************************************************************/
*                                                                  0340
*     WKOPTNS(2:2)=(WKOPTNS(2:2)×'01000000'B);                     0340
         OI    WKOPTNS+1,B'01000000'                               0340
*   ELSE                                                           0341
*     IF(WKOPTNS(1:1)&'00001000'B)='00001000'B THEN                0341
*                                                                  0341
         B     @RC00339                                            0341
@RF00339 MVC   @TS00001(1),WKOPTNS                                 0341
         NI    @TS00001,B'00001000'                                0341
         CLI   @TS00001,B'00001000'                                0341
         BNE   @RF00341                                            0341
*       /*************************************************************/
*       /*                                                           */
*       /* IF UCAT IS SPECIFIED MAKE SURE IT IS A UCATDX             */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0342
*       WKOPTNS(2:2)=(WKOPTNS(2:2)×'00000100'B);                   0342
         OI    WKOPTNS+1,B'00000100'                               0342
*     ELSE                                                         0343
*       ;                                                          0343
@RF00341 DS    0H                                                  0344
*   RFY                                                            0344
*    (R1,                                                          0344
*     R2,                                                          0344
*     R3) RSTD;                     /*                       @YM04805*/
@RC00339 DS    0H                                                  0345
*   R3=CAMPTR1;                     /* GET DSNAME ADDR       @YM04805*/
         L     @15,CAMPLPTR                                        0345
         L     R3,CAMPTR1(,@15)                                    0345
*   IF CAMLTTR=BITON THEN           /* IF LOCATE BY TTR      @Z40CSRC*/
         TM    CAMLTTR(@15),B'00000010'                            0346
         BNO   @RF00346                                            0346
*     R1=LENGTH(WKNXTTTR);          /* GET LENGTH OF TTR     @Z40CSRC*/
         LA    R1,3                                                0347
*   ELSE                            /* IS NOT TTR LOCATE     @Z40CSRC*/
*     IF CAMBLDA=BITON              /* IF BUILDING ALIAS     @Z40CSRC*/
*         ×CAMDLTA=BITON            /* OR DELETING ALIAS     @Z40CSRC*/
*         ×CAMLNKX=BITON            /* OR CONNECTING         @Z40CSRC*/
*         ×CAMDRPX=BITON THEN       /* OR RELEASING          @Z40CSRC*/
         B     @RC00346                                            0348
@RF00346 L     @15,CAMPLPTR                                        0348
         TM    CAMBLDA(@15),B'00011001'                            0348
         BNZ   @RT00348                                            0348
         TM    CAMDRPX(@15),B'10000000'                            0348
         BNO   @RF00348                                            0348
@RT00348 DS    0H                                                  0349
*       R1=LENGTH(CAMIDXNM);        /* GET LEN OF INDEX      @Z40CSRC*/
         LA    R1,8                                                0349
*     ELSE                          /* NOT AN 8-BYTE NAME    @Z40CSRC*/
*       DO;                         /* LONGER NAME MOVE      @Z40CSRC*/
         B     @RC00348                                            0350
@RF00348 DS    0H                                                  0351
*         GEN;                                                     0351
*                                     /*                   @YM04805*/
         XC    TRTABLE(256),TRTABLE  ZERO TRT TABLE        @YM04805
         MVI   TRTABLE+C' ',X'04'    INIT TABLE            @YM04805
         LR    R1,R3                 R1 = ADDR OF DSNAME   @YM04805
         SR    R2,R2                 ZERO R2               @YM04805
         TRT   0(44,R3),TRTABLE      SCAN FOR BLANK        @YM04805
         B     OR0000(R2)            WAS BLANK FOUND       @YM04805
OR0000   LA    R1,43(R3)             NO,SET UP FOR MOVE    @YM04805
         SR    R1,R3                 YES,CALCULATE LENGTH  @YM04805
*         R1=R1+1;                  /* GET LENGTH OF NAME    @Z40CSRC*/
         AL    R1,@CF00064                                         0352
*       END;                        /* OF LONGER NAME MV     @Z40CSRC*/
*   WKDSN=R3->CAMDSN(1:R1);         /* COPY OVER DSNAME OR TTR AND 0354
*                                      BLANK REST            @Z40CSRC*/
@RC00348 DS    0H                                                  0354
@RC00346 MVI   WKDSN+1,C' '                                        0354
         MVC   WKDSN+2(42),WKDSN+1                                 0354
         LR    @07,R1                                              0354
         BCTR  @07,0                                               0354
         EX    @07,@SM03066                                        0354
*   DSNLEN=R1;                      /* SAVE DSNAME LENGTH    @Z40CSRC*/
         LR    DSNLEN,R1                                           0355
*   RFY                                                            0356
*    (R1,                                                          0356
*     R2,                                                          0356
*     R3) UNRSTD;                   /*                       @YM04805*/
*   WKPTR1=ADDR(WKDSN);             /* ADDR OF DSN TO WKAREA         */
         LA    @07,WKDSN                                           0357
         ST    @07,WKPTR1                                          0357
*   WKCVOLP=ZEROPTR;                /* ZERO OUT CVOL POINTER         */
         L     @07,ZEROPTR                                         0358
         ST    @07,WKCVOLP                                         0358
*   WKPTR3=ADDR(WKVOLST);           /* VOLIST ADDR TO WKAREA         */
         LA    @07,WKVOLST                                         0359
         ST    @07,WKPTR3                                          0359
*   IF CAMCAT='1'B×CAMRECAT='1'B THEN                              0360
*                                                                  0360
         L     @15,CAMPLPTR                                        0360
         TM    CAMCAT(@15),B'00110000'                             0360
         BZ    @RF00360                                            0360
*     /***************************************************************/
*     /*                                                             */
*     /* VOLUME LIST IS SPECIFIED BY THE USER FOR CATALOG OR         */
*     /* RECATALOG REQUESTS AND MUST BE MOVED TO THE WORKAREA.       */
*     /*                                                             */
*     /***************************************************************/
*                                                                  0361
*     DO;                                                          0361
*       RFY                                                        0362
*        (R2,                                                      0362
*         R3,                                                      0362
*         R4,                                                      0362
*         R5) RSTD;                                                0362
*       R3=(CAMVOLCT*12)+2;         /* CALC VOLIST SIZE              */
         L     @15,CAMPTR3(,@15)                                   0363
         LH    R3,CAMVOLCT(,@15)                                   0363
         MH    R3,@CH00127                                         0363
         AL    R3,@CF00105                                         0363
*       R5=R3;                      /* SET R5 TO LIST SIZE           */
         LR    R5,R3                                               0364
*       R2=ADDR(WKVOLST);           /* R2 -> WKVOLST                 */
         LR    R2,@07                                              0365
*       R4=ADDR(CAMVOLST);          /* R4 -> CAMVOLST                */
         LR    R4,@15                                              0366
*       GEN(MVCL   R2,R4);          /* MOVE VOLST TO WORKAREA        */
         MVCL   R2,R4
*       RFY                                                        0368
*        (R2,                                                      0368
*         R3,                                                      0368
*         R4,                                                      0368
*         R5) UNRSTD;                                              0368
*     END;                                                         0369
*   ELSE                                                           0370
*     ;                                                            0370
@RF00360 DS    0H                                                  0371
*   IF CAMDTTR='1'B THEN                                           0371
*                                                                  0371
         L     @07,CAMPLPTR                                        0371
         TM    CAMDTTR(@07),B'00000010'                            0371
         BNO   @RF00371                                            0371
*     /***************************************************************/
*     /*                                                             */
*     /* IF DSCBTTR IS BEING PASSED BY THE USER IT MUST BE MOVED TO  */
*     /* THE WORK AREA.                                              */
*     /*                                                             */
*     /***************************************************************/
*                                                                  0372
*     DO;                                                          0372
*       WKDSCBT=CAMDSCBT;           /* DSCBTTR TO WORKAREA           */
         L     @07,CAMDSCBP(,@07)                                  0373
         MVC   WKDSCBT(3),CAMDSCBT(@07)                            0373
*       WKDSCBP=ADDR(WKDSCBT);      /* DSCBPTR TO WORKAREA           */
         LA    @07,WKDSCBT                                         0374
         ST    @07,WKDSCBP                                         0374
*     END;                                                         0375
*   ELSE                                                           0376
*     WKDSCBP=ZEROPTR;              /* ZERO DSCBPTR IN WORKAREA      */
*                                                                  0376
         B     @RC00371                                            0376
@RF00371 L     @07,ZEROPTR                                         0376
         ST    @07,WKDSCBP                                         0376
*   /*****************************************************************/
*   /*                                                               */
*   /* COPY OVER INFORMATION FOR 'INDEX' MACRO REQUEST       @Z40CSRC*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0377
*   IF CAMBLDA=BITON THEN           /* IF BUILDING ALIAS     @Z40CSRC*/
@RC00371 L     @07,CAMPLPTR                                        0377
         TM    CAMBLDA(@07),B'00010000'                            0377
         BNO   @RF00377                                            0377
*     WKALISNM=CAMPTR3->CAMIDXNM;   /* COPY OVER ALIAS       @Z40CSRC*/
         L     @07,CAMPTR3(,@07)                                   0378
         MVC   WKALISNM(8),CAMIDXNM(@07)                           0378
*   ELSE                            /* NOT BLDA              @Z40CSRC*/
*     IF CAMLNKX=BITON THEN         /* IF CONNECTING         @Z40CSRC*/
         B     @RC00377                                            0379
@RF00377 L     @07,CAMPLPTR                                        0379
         TM    CAMLNKX(@07),B'00001000'                            0379
         BNO   @RF00379                                            0379
*       WKNEWCV=CAMNEWVL;           /* COPY NEW VOL INFO     @Z40CSRC*/
         L     @07,CAMPTR3(,@07)                                   0380
         MVC   WKNEWCV(10),CAMNEWVL(@07)                           0380
*     ELSE                                                         0381
*       ;                           /* NOT LNKX              @Z40CSRC*/
@RF00379 DS    0H                                                  0382
*   RFY                                                            0382
*     R1 RSTD;                                                     0382
@RC00377 DS    0H                                                  0383
*   R1=ADDR(WKCAMLST);              /* R1 IS PARAMETER REG           */
         LA    R1,WKCAMLST                                         0383
*   GEN(ST    R13,XSAVAREA+4  POINT TO PREVIOUS SAVEAREA);         0384
         ST    R13,XSAVAREA+4  POINT TO PREVIOUS SAVEAREA
*   GEN(LA    R13,XSAVAREA    R13=NEW SAVE AREA ADDRESS);          0385
         LA    R13,XSAVAREA    R13=NEW SAVE AREA ADDRESS
*   CALL IGG0CLCC;                  /* CALL OS CAT. MANAGEMENT       */
         L     @15,@CV00058                                        0386
         BALR  @14,@15                                             0386
*   GEN(L     R13,XSAVAREA+4  RESET R13 TO PREVIOUS SAVEAREA);     0387
         L     R13,XSAVAREA+4  RESET R13 TO PREVIOUS SAVEAREA
*   RFY                                                            0388
*    (R0,                                                          0388
*     R15) RSTD;                                                   0388
*   GEN(STM   R15,R0,OSRC15 SAVE RETURN CODES);                    0389
         STM   R15,R0,OSRC15 SAVE RETURN CODES
*   OSRC1=R1;                       /* SAVE REG 1 RET CD     @Z40CSRC*/
         ST    R1,OSRC1                                            0390
*   RFY                                                            0391
*    (R0,                                                          0391
*     R15) UNRSTD;                  /*                       @Z40CSRC*/
*                                                                  0391
*   /*****************************************************************/
*   /*                                                               */
*   /* COPY BACK NAME (POSSIBLE ALIAS REPLACED BY TRUE NAME).        */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0392
*   IF CAMLTTR=BITON                /* IF LOCATE BY TTR      @Z40CSRC*/
*       ×CAMBLDA=BITON              /* OR BUILD ALIAS        @Z40CSRC*/
*       ×CAMDLTA=BITON              /* OR DELETE ALIAS       @Z40CSRC*/
*       ×CAMLNKX=BITON              /* OR CONNECT            @Z40CSRC*/
*       ×CAMDRPX=BITON THEN                                        0392
         L     @07,CAMPLPTR                                        0392
         TM    CAMLTTR(@07),B'00000010'                            0392
         BO    @RT00392                                            0392
         TM    CAMBLDA(@07),B'00011001'                            0392
         BNZ   @RT00392                                            0392
         TM    CAMDRPX(@07),B'10000000'                            0392
         BO    @RT00392                                            0392
*     ;                             /* OR DRPX, DONT COPY    @Z40CSRC*/
*   ELSE                            /* SHOULD COPY           @Z40CSRC*/
*     DO;                           /* COPY NAME             @Z40CSRC*/
*       CALL GETUSERK;              /* GET INTO USER KEY     @Z40CSRC*/
         BAL   @14,GETUSERK                                        0395
*       DO R1=1 TO LENGTH(CAMDSN);  /* COPY UP TO 44 CHAR    @Z40CSRC*/
         LA    R1,1                                                0396
@DL00396 DS    0H                                                  0397
*         CAMDSN(R1)=WKDSN(R1);     /* COPY CHARACTER        @Z40CSRC*/
         L     @07,CAMPLPTR                                        0397
         L     @07,CAMPTR1(,@07)                                   0397
         ALR   @07,R1                                              0397
         BCTR  @07,0                                               0397
         LA    @15,WKDSN-1(R1)                                     0397
         MVC   CAMDSN(1,@07),0(@15)                                0397
*         IF WKDSN(R1)=BLANKDLM     /* JUST COPIED A BLNK    @Z40CSRC*/
*             &R1^<DSNLEN THEN      /* & THRU BLANKING OUT A LONGER
*                                      ORIGINAL NAME         @Z40CSRC*/
         LA    @07,WKDSN-1(R1)                                     0398
         CLI   0(@07),C' '                                         0398
         BNE   @RF00398                                            0398
         CR    R1,DSNLEN                                           0398
         BL    @RF00398                                            0398
*           R1=LENGTH(CAMDSN)+1;    /* SET TO EXIT LOOP      @Z40CSRC*/
         LA    R1,45                                               0399
*         ELSE                                                     0400
*           ;                       /* LOOP UNTIL DONE       @Z40CSRC*/
@RF00398 DS    0H                                                  0401
*       END;                        /* OF LOOP               @Z40CSRC*/
         AL    R1,@CF00064                                         0401
         C     R1,@CF00206                                         0401
         BNH   @DL00396                                            0401
*       CALL GETSVCK;               /* GET SYSTEM KEY        @Z40CSRC*/
         BAL   @14,GETSVCK                                         0402
*     END;                          /* OF COPYING NAME       @Z40CSRC*/
*   RFY                                                            0404
*     R1 UNRSTD;                    /*                       @Z40CSRC*/
@RT00392 DS    0H                                                  0405
*   IF(WKOPTNS&OSLOCMSK)=ALLZERO THEN                              0405
*                                                                  0405
         MVC   @TS00001(4),WKOPTNS                                 0405
         NC    @TS00001(4),OSLOCMSK                                0405
         CLC   @TS00001(4),ALLZERO                                 0405
         BNE   @RF00405                                            0405
*     /***************************************************************/
*     /*                                                             */
*     /* IF REQUEST WAS LOCATE THEN THE 265 BYTE             @Z40CSRC*/
*     /* VOLUME LIST AREA MUST BE RETURNED TO THE USER WORKAREA.     */
*     /*                                                             */
*     /***************************************************************/
*                                                                  0406
*     DO;                                                          0406
*       CALL GETUSERK;              /* GET INTO USER KEY             */
         BAL   @14,GETUSERK                                        0407
*       RFY                                                        0408
*        (R2,                                                      0408
*         R3,                                                      0408
*         R4,                                                      0408
*         R5) RSTD;                                                0408
*       R3=265;                     /* R3 = VOLIST SIZE              */
         LA    R3,265                                              0409
*       R5=R3;                      /* R5 = VOLIST SIZE              */
         LR    R5,R3                                               0410
*       R2=ADDR(CAMVOLST);          /* R2 -> CAMVOLST                */
         L     @01,CAMPLPTR                                        0411
         L     R2,CAMPTR3(,@01)                                    0411
*       R4=ADDR(WKVOLST);           /* R4 -> WKVOLST                 */
         LA    R4,WKVOLST                                          0412
*       GEN(MVCL   R2,R4);          /* MOVE VOLST TO USER AREA       */
         MVCL   R2,R4
*       RFY                                                        0414
*        (R2,                                                      0414
*         R3,                                                      0414
*         R4,                                                      0414
*         R5) UNRSTD;                                              0414
*       CALL GETSVCK;               /* GET INTO SVC KEY              */
         BAL   @14,GETSVCK                                         0415
*     END;                                                         0416
*   ELSE                                                           0417
*     ;                                                            0417
@RF00405 DS    0H                                                  0418
*   END OSREQ;                                                     0418
@EL00004 L     @13,4(,@13)                                         0418
@EF00004 DS    0H                                                  0418
@ER00004 L     @14,12(,@13)                                        0418
         BR    @14                                                 0418
*                                                                  0419
*   /*****************************************************************/
*   /*                                                               */
*   /* ESTAEXIT IS CALLED TO PROCESS AN ESTAE INTERCEPTED ABEND      */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0419
*ESTAEXIT:                                                         0419
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);                               0419
ESTAEXIT DS    0H                                                  0420
*   DO;                             /* ENTESTAE (10,11,12)SAVEAREA(XS
*                                      AVAREA)ERREXIT(NORTCA)PARMREG(
*                                      15)                           */
*                                                                  0420
*     /***************************************************************/
*     /*                                                             */
*     /* ENTRY CODE FOR ESTAE ROUTINE. IF RTCA ALLOCATED THEN RESTORE*/
*     /* CODE AND DATA REGS FROM START OF USERS PARM LIST, AND       */
*     /* ESTABLISH ADDR TO ESTAE SAVE AREA IF REQUIRED. IF NO RTCA   */
*     /* AVAILABLE THEN BRANCH TO ERROR CODE AFTER ESTABLISHING      */
*     /* ADDRESSABILITY                                              */
*     /*                                                             */
*     /***************************************************************/
*                                                                  0421
*     GEN(USING *,GPR15P);                                         0421
         USING *,GPR15P
*     GEN(CH    GPR00F,*+30);       /* CHECK IF RTCA ALLOC FAILED    */
         CH    GPR00F,*+30
*     GEN(BNE   *+28);              /* NO,SAVE RTM REGS              */
         BNE   *+28
*     GEN(DROP  GPR15P);            /* DROP LOCAL ADDR               */
         DROP  GPR15P
*     GEN(LR    15,GPR02P);         /* PTR TO USER PARM LIST         */
         LR    15,GPR02P
*     GEN(L     10,00(15));                                        0426
         L     10,00(15)
*     GEN(L     11,04(15));                                        0427
         L     11,04(15)
*     GEN(L     12,08(15));                                        0428
         L     12,08(15)
*     GEN(LA    GPR13P,XSAVAREA);   /* SET PTR TO ESTAE SA           */
         LA    GPR13P,XSAVAREA
*     GEN(B     NORTCA);            /* BRANCH TO ERROR EXIT          */
         B     NORTCA
*     GEN(DC    H'12');             /* NO RTCA AVAIL RC              */
         DC    H'12'
*     GEN(STM   GPR14P,GPR12F,12(GPR13P));/* GOOD R13, SAVE RTM'S  0432
*                                      REGS                          */
         STM   GPR14P,GPR12F,12(GPR13P)
*     GEN(L     15,0(GPR01P));      /* PTR TO USER PARM LIST         */
         L     15,0(GPR01P)
*     GEN(L     10,00(15));                                        0434
         L     10,00(15)
*     GEN(L     11,04(15));                                        0435
         L     11,04(15)
*     GEN(L     12,08(15));                                        0436
         L     12,08(15)
*     GEN(ST    GPR13P,XSAVAREA+4); /* SET PTR TO RTM SA             */
         ST    GPR13P,XSAVAREA+4
*     GEN(LA    GPR13P,XSAVAREA);   /* SET PTR TO ESTAE SA           */
         LA    GPR13P,XSAVAREA
*   END;                            /* ENTESTAE (10,11,12)SAVEAREA(XS
*                                      AVAREA)ERREXIT(NORTCA)PARMREG(
*                                      15)                           */
*   RFY                                                            0440
*    (GPR01P,                                                      0440
*     R14) RSTD;                                                   0440
*   RFY                                                            0441
*     SDWA BASED(GPR01P);                                          0441
*   GEN(ST    R14,12(R13));         /* SAVE RETURN POINT             */
         ST    R14,12(R13)
*   IF SDWAPERC='0'B                /* WERE WE PERCOLLATED TO        */
*     THEN                          /* NO                            */
         TM    SDWAPERC(GPR01P),B'00010000'                        0443
         BNZ   @RF00443                                            0443
*     IF KEYTYPE=USERKEY            /* WERE WE UNDER USER'S KEY      */
*       THEN                        /* YES                           */
         CLC   KEYTYPE(1),USERKEY                                  0444
         BNE   @RF00444                                            0444
*       DO;                         /* SETRP COMPCOD(STCHK,SYSTEM)DUM
*                                      P(YES)RC(0)                   */
*         RESPECIFY                                                0446
*          (GPR00P,                                                0446
*           GPR01P,                                                0446
*           GPR14P,                                                0446
*           GPR15P) RSTD;                                          0446
*         GPR01P->SDWARCDE=0;       /* SAVE RC VALUE                 */
         MVI   SDWARCDE(GPR01P),X'00'                              0447
*         GPR01P->SDWAREQ='1'B;     /* TURN ON DUMP INDICATOR        */
         OI    SDWAREQ(GPR01P),B'10000000'                         0448
*         GPR14P=STCHK;             /* ACCESS COMPLETION CODE        */
         L     GPR14P,STCHK                                        0449
*         GEN(SLL    14,12);        /* SHIFT TO SYSTEM COMPLETION  0450
*                                      CODE                          */
         SLL    14,12
*         GPR01P->SDWACMPC=GPR14P;  /* STORE COMPLETION CODE         */
         STCM  GPR14P,7,SDWACMPC(GPR01P)                           0451
*         RESPECIFY                                                0452
*          (GPR00P,                                                0452
*           GPR01P,                                                0452
*           GPR14P,                                                0452
*           GPR15P) UNRSTD;                                        0452
*       END;                                                       0453
*     ELSE                          /* NOT UNDER USER'S KEY          */
*       DO;                                                        0454
         B     @RC00444                                            0454
@RF00444 DS    0H                                                  0455
*         DO;                       /* SETRP RC(0)RECORD(YES)DUMP(IGN
*                                      ORE)RECPARM(RECORD)           */
*           RESPECIFY                                              0456
*            (GPR00P,                                              0456
*             GPR01P,                                              0456
*             GPR14P,                                              0456
*             GPR15P) RSTD;                                        0456
*           GPR01P->SDWARCDE=0;     /* SAVE RC VALUE                 */
         MVI   SDWARCDE(GPR01P),X'00'                              0457
*           GPR01P->SDWARCRD='1'B;  /* TURN ON RECORD INDICATOR      */
         OI    SDWARCRD(GPR01P),B'10000000'                        0458
*           GPR15P=ADDR(RECORD);    /* ACCESS RECORD PARAMETER LIST  */
         LA    GPR15P,RECORD                                       0459
*           GPR01P->SDWARECP=GPR15P->I256C(1:24);/* COPY RECORD    0460
*                                      PARAMETERS                    */
         MVC   SDWARECP(24,GPR01P),I256C(GPR15P)                   0460
*           RESPECIFY                                              0461
*            (GPR00P,                                              0461
*             GPR01P,                                              0461
*             GPR14P,                                              0461
*             GPR15P) UNRSTD;                                      0461
*         END;                                                     0462
*         RFY                                                      0463
*           R2 RSTD;                                               0463
*         DUMPHDR=SKELHDR;          /* SAVE SDUMP HEADER     @OZ29464*/
         MVC   DUMPHDR(43),SKELHDR                                 0464
*         DUMPLIST=DUMPL;           /* SAVE PARM LIST        @OZ29464*/
         MVC   DUMPLIST(24),DUMPL                                  0465
*         R2=ADDR(DUMPHDR);         /* POINT TO HEADER       @OZ29464*/
         LA    R2,DUMPHDR                                          0466
*         GEN REFS(DUMPLIST,R2) SETS(R0,R1,R15)                    0467
*             (SDUMP HDRAD=(R2),MF=(E,DUMPLIST));/* ISSUE SDUMP    0467
*                                                            @OZ29464*/
         SDUMP HDRAD=(R2),MF=(E,DUMPLIST)
*         RFY                                                      0468
*           R2 UNRSTD;                                             0468
*       END;                                                       0469
*   ELSE                            /* YES,WE WERE PERCOLLATED TO    */
*     DO;                           /* SETRP RECORD(YES)DUMP(IGNORE)R
*                                      C(0)RECPARM(RECORD)           */
         B     @RC00443                                            0470
@RF00443 DS    0H                                                  0471
*       RESPECIFY                                                  0471
*        (GPR00P,                                                  0471
*         GPR01P,                                                  0471
*         GPR14P,                                                  0471
*         GPR15P) RSTD;                                            0471
*       GPR01P->SDWARCDE=0;         /* SAVE RC VALUE                 */
         MVI   SDWARCDE(GPR01P),X'00'                              0472
*       GPR01P->SDWARCRD='1'B;      /* TURN ON RECORD INDICATOR      */
         OI    SDWARCRD(GPR01P),B'10000000'                        0473
*       GPR15P=ADDR(RECORD);        /* ACCESS RECORD PARAMETER LIST  */
         LA    GPR15P,RECORD                                       0474
*       GPR01P->SDWARECP=GPR15P->I256C(1:24);/* COPY RECORD        0475
*                                      PARAMETERS                    */
         MVC   SDWARECP(24,GPR01P),I256C(GPR15P)                   0475
*       RESPECIFY                                                  0476
*        (GPR00P,                                                  0476
*         GPR01P,                                                  0476
*         GPR14P,                                                  0476
*         GPR15P) UNRSTD;                                          0476
*     END;                                                         0477
*   RFY                                                            0478
*    (GPR01P,                                                      0478
*     R14) UNRSTD;                                                 0478
@RC00443 DS    0H                                                  0479
*CKENQ:                                                            0479
*   IF ENQDEQSW=ON                  /* IS ENQUE OUTSTANDING          */
*     THEN                          /* YES                           */
CKENQ    CLC   ENQDEQSW(1),ON                                      0479
         BNE   @RF00479                                            0479
*     DO;                                                          0480
*       RFY                                                        0481
*         R1 RSTD;                                                 0481
*       ENQDEQPL=ENQDEQML;          /* COPY ENQ-DEQ LIST MAC FORM    */
         MVC   ENQDEQPL(12),ENQDEQML                               0482
*       R1=ADDR(ENQDEQPL);          /* POINT TO LIST FORM            */
         LA    R1,ENQDEQPL                                         0483
*       GEN(DEQ   MF=(E,(1)));      /* DEQ FROM PCCB CHAIN           */
         DEQ   MF=(E,(1))
*       ENQDEQSW=OFF;               /* INDICATE DEQUED               */
         MVC   ENQDEQSW(1),OFF                                     0485
*       RFY                                                        0486
*         R1 UNRSTD;                                               0486
*     END;                                                         0487
*   ELSE                                                           0488
*     ;                                                            0488
@RF00479 DS    0H                                                  0489
*   RFY                                                            0489
*    (R0,                                                          0489
*     R1,                                                          0489
*     R2,                                                          0489
*     R14) RSTD;                    /*                       @YM05170*/
*   GEN(L     R0,@SIZDATD);         /* R0 = LENGTH FOR FREEMAIN      */
         L     R0,@SIZDATD
*   R1=R12;                         /* R1 = ADDRESS FOR FREEMAIN     */
         LR    R1,R12                                              0491
*   GEN(L     R2,12(R13));          /* SAVE RETURN POINT     @YM05170*/
         L     R2,12(R13)
*   GEN(FREEMAIN R,LV=(0),A=(1));   /* FREEMAIN WORKAREA             */
         FREEMAIN R,LV=(0),A=(1)
*   GEN(LR    R14,R2);              /* RESET RETURN POINT    @YM05170*/
         LR    R14,R2
*   GEN(SR    R15,R15);             /* SET RETURN CODE TO ZERO       */
         SR    R15,R15
*   GEN(BR    R14);                 /* EXIT BACK TO RTM              */
         BR    R14
*   RFY                                                            0497
*    (R0,                                                          0497
*     R1,                                                          0497
*     R2,                                                          0497
*     R14) UNRSTD;                  /*                       @YM05170*/
*NORTCA:                                                           0498
*   RFY                                                            0498
*     R14 RSTD;                                                    0498
NORTCA   DS    0H                                                  0499
*   GEN(ST    R14,12(R13));         /* SAVE RETURN POINT             */
         ST    R14,12(R13)
*   GO TO CKENQ;                    /* GO FINISH PROCESSING          */
         B     CKENQ                                               0500
*   RFY                                                            0501
*     R14 UNRSTD;                                                  0501
*   DECLARE                         /* GENERAL PURPOSE REGISTERS     */
*     GPR00F FIXED(31) REG(0),                                     0502
*     GPR12F FIXED(31) REG(12),                                    0502
*     GPR00P PTR(31) REG(0),                                       0502
*     GPR01P PTR(31) REG(1),                                       0502
*     GPR02P PTR(31) REG(2),                                       0502
*     GPR13P PTR(31) REG(13),                                      0502
*     GPR14P PTR(31) REG(14),                                      0502
*     GPR15P PTR(31) REG(15);                                      0502
*   DECLARE                         /* COMMON VARIABLES              */
*     I256C CHAR(256) BASED,                                       0503
*     I031F FIXED(31) BASED,                                       0503
*     I031P PTR(31) BASED,                                         0503
*     I015F FIXED(15) BASED,                                       0503
*     I015P PTR(15) BASED,                                         0503
*     I008P PTR(8) BASED,                                          0503
*     I001C CHAR(1) BASED;                                         0503
*   END ESTAEXIT;                                                  0504
*                                                                  0505
*   /*****************************************************************/
*   /*                                                               */
*   /* GETUSERK IS CALLED TO CHANGE STORAGE KEY VIA MODESET MACRO    */
*   /* FROM SVC KEY TO USER KEY.                                     */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0505
*GETUSERK:                                                         0505
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);                               0505
GETUSERK DS    0H                                                  0506
*   RFY                                                            0506
*    (WKREG,                                                       0506
*     R14) RSTD;                                                   0506
*   KEYTYPE=USERKEY;                /* INDICATE CHANGE TO USERKEY    */
*                                                                  0507
         MVC   KEYTYPE(1),USERKEY                                  0507
*   /*****************************************************************/
*   /*                                                               */
*   /* ISSUE MODESET MACRO TO SWITCH FROM SVC TO USER KEY            */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0508
*   DO;                             /* MODESET SAVEKEY(OLDKEY)     0508
*                                      EXTKEY(RBT234) WORKREG(WKREG) */
*     RESPECIFY                                                    0509
*      (GPR02F) RESTRICTED;                                        0509
*     WKREG=GPR02F;                 /* SAVE REGISTER 2               */
         LR    WKREG,GPR02F                                        0510
*     IPK;                          /* SAVE CURRENT PSW KEY          */
         IPK                                                       0511
*     OLDKEY=GPR02F;                                               0512
         STC   GPR02F,OLDKEY                                       0512
*     GPR02F=WKREG;                 /* RESTORE REGISTER 2            */
         LR    GPR02F,WKREG                                        0513
*     WKREG=TCBRBP;                 /* RB PTR FROM TCB               */
         L     @15,TCBPTR                                          0514
         L     WKREG,TCBRBP(,@15)                                  0514
*     WKREG=WKREG->RBLINK;          /* NEXT RB ADDRESS               */
         L     WKREG,RBLINK(,WKREG)                                0515
*     WKREG=WKREG->RBOPSW(2);       /* PSW KEY FROM RB OLD PSW       */
         SLR   @15,@15                                             0516
         IC    @15,RBOPSW+1(,WKREG)                                0516
         LR    WKREG,@15                                           0516
*     SPKA(WKREG);                  /* SET PSW KEY                   */
         SPKA  0(WKREG)                                            0517
*     RESPECIFY                                                    0518
*      (GPR02F) UNRESTRICTED;                                      0518
*   END;                            /* MODESET SAVEKEY(OLDKEY)     0519
*                                      EXTKEY(RBT234) WORKREG(WKREG) */
*   RFY                                                            0520
*    (WKREG,                                                       0520
*     R14) UNRSTD;                                                 0520
*   END GETUSERK;                                                  0521
@EL00006 DS    0H                                                  0521
@EF00006 DS    0H                                                  0521
@ER00006 BR    @14                                                 0521
*                                                                  0522
*   /*****************************************************************/
*   /*                                                               */
*   /* GETSVCK IS CALLED TO CHANGE STORAGE KEY VIA MODESET MACRO FROM*/
*   /* USER KEY TO SVC KEY.                                          */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0522
*GETSVCK:                                                          0522
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);                               0522
GETSVCK  DS    0H                                                  0523
*   RFY                                                            0523
*    (WKREG,                                                       0523
*     R14) RSTD;                                                   0523
*   DO;                             /* MODESET KEYADDR(OLDKEY)     0524
*                                      WORKREG(WKREG)                */
*     WKREG=OLDKEY;                 /* GET KEY FORM SAVE LOCATION    */
         SLR   WKREG,WKREG                                         0525
         IC    WKREG,OLDKEY                                        0525
*     SPKA(WKREG);                  /* SET PSW KEY                   */
         SPKA  0(WKREG)                                            0526
*   END;                            /* MODESET KEYADDR(OLDKEY)     0527
*                                      WORKREG(WKREG)                */
*   KEYTYPE=SVCKEY;                 /* INDICATE CHANGE TO SVC KEY    */
         MVC   KEYTYPE(1),SVCKEY                                   0528
*   RFY                                                            0529
*    (WKREG,                                                       0529
*     R14) UNRSTD;                                                 0529
*   END GETSVCK;                                                   0530
@EL00007 DS    0H                                                  0530
@EF00007 DS    0H                                                  0530
@ER00007 BR    @14                                                 0530
*                                                                  0531
*   /*****************************************************************/
*   /*                                                               */
*   /* SUPERLOC IS CALLED FOR ALL SUPERLOCATE REQUESTS. IT DETERMINES*/
*   /* WHICH TYPE OF SUPERLOCATE IS TO BE DONE AND CALLS THE PROPER  */
*   /* PROCEDURE.                                                    */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0531
*SUPERLOC:                                                         0531
*   PROC OPTIONS(SAVEAREA(16),SAVE(14));                           0531
SUPERLOC ST    @14,12(,@13)                                        0531
         ST    @13,@SA00008+4                                      0531
         LA    @14,@SA00008                                        0531
         LR    @13,@14                                             0531
*   WKDSN=CPLDSN;                   /* SAVE DATASET NAME     @ZA04937*/
         L     @15,CTGPLPTR                                        0532
         L     @01,CTGENT(,@15)                                    0532
         MVC   WKDSN(44),CPLDSN(@01)                               0532
*   WKDSCBP=ADDR(SLAREA);           /* POINTER TO SUPERLOC WKAREA  0533
*                                                            @ZA04937*/
         LA    @14,SLAREA                                          0533
         ST    @14,WKDSCBP                                         0533
*   SLCURSIZ=0;                     /*                       @ZA04937*/
         SLR   @14,@14                                             0534
         STH   @14,SLCURSIZ                                        0534
*   SLFLAGS='00000000'B;            /* INIT FLAGS            @ZA04937*/
         MVI   SLFLAGS,B'00000000'                                 0535
*   IF CTGGDGL='1'B×CTGLBASE='1'B THEN                             0536
         TM    CTGGDGL(@15),B'00001000'                            0536
         BO    @RT00536                                            0536
         TM    CTGLBASE(@15),B'10000000'                           0536
         BNO   @RF00536                                            0536
@RT00536 DS    0H                                                  0537
*     DO;                           /* IF NOT NORMAL SUPLOC EDIT NAME*/
*       RFY                                                        0538
*        (R1,                                                      0538
*         R2) RSTD;                 /*                       @ZA04937*/
*       R1=ADDR(WKDSN)+36;          /* SET UP LIMIT FOR TRANSLATE    */
         LA    R1,WKDSN                                            0539
         AL    R1,@CF02418                                         0539
*       R2=ADDR(TRTABLE);           /*                       @ZA04937*/
         LA    R2,TRTABLE                                          0540
*       GEN(XC    0(256,R2),0(R2) INIT TRT TABLE TO ZERO);/* @ZA04937*/
         XC    0(256,R2),0(R2) INIT TRT TABLE TO ZERO
*       GEN(MVI   C'('(R2),C'(');   /* SET TO STOP ON LEFT PAREN     */
         MVI   C'('(R2),C'('
*       IF CTGGDGL='0'B THEN        /* IF BASE REQUEST ALLOW BLANK   */
         L     @03,CTGPLPTR                                        0543
         TM    CTGGDGL(@03),B'00001000'                            0543
         BNZ   @RF00543                                            0543
*         GEN(MVI   C' '(R2),C' '); /* SET TO STOP ON LEFT BLANK     */
         MVI   C' '(R2),C' '
*       TRT(WKDSN,TRTABLE);         /* SCAN FOR LEFT PAREN   @ZA04937*/
@RF00543 TRT   WKDSN(44),TRTABLE                                   0545
*       R1=R1-ADDR(WKDSN)+1;        /* CALC NUMBER OF BYTES  @ZA04937*/
         LA    @03,WKDSN                                           0546
         LCR   @03,@03                                             0546
         ALR   @03,R1                                              0546
         AL    @03,@CF00064                                        0546
         LR    R1,@03                                              0546
*       IF R1>36 THEN                                              0547
         C     R1,@CF02418                                         0547
         BNH   @RF00547                                            0547
*         VSRC15=VS8;               /* INDICATE DATASET NOT FOUND    */
         L     @03,VS8                                             0548
         ST    @03,VSRC15                                          0548
*       ELSE                        /* # OF BYTES IS LESS THAN 36  0549
*                                                            @ZA04937*/
*         SAVER1=R1;                /* SAVE NUMBER OF BYTES          */
         B     @RC00547                                            0549
@RF00547 ST    R1,SAVER1                                           0549
*       RFY                                                        0550
*        (R1,                                                      0550
*         R2) UNRSTD;               /*                       @ZA04937*/
@RC00547 DS    0H                                                  0551
*     END;                          /*                       @ZA04937*/
*   IF VSRC15=0 THEN                                               0552
@RF00536 L     @15,VSRC15                                          0552
         LTR   @15,@15                                             0552
         BNZ   @RF00552                                            0552
*     DO;                           /*                       @ZA04937*/
*       IF CTGGDGL='1'B THEN                                       0554
*                                                                  0554
         L     @15,CTGPLPTR                                        0554
         TM    CTGGDGL(@15),B'00001000'                            0554
         BNO   @RF00554                                            0554
*         /***********************************************************/
*         /*                                                         */
*         /* PROCESS SUPERLOCATE WITH GDG BASE SUPPLIED              */
*         /*                                                         */
*         /***********************************************************/
*                                                                  0555
*         DO;                                                      0555
*           SLGGGG=GGGG;            /* SET GDG BASE          @OZ10000*/
         L     @01,CTGWKA(,@15)                                    0556
         L     @01,CTGWAGB(,@01)                                   0556
         MVC   SLGGGG(4),GGGG(@01)                                 0556
*           CALL SLGDG;                                            0557
         BAL   @14,SLGDG                                           0557
*         END;                                                     0558
*       ELSE                                                       0559
*         IF CTGLBASE='1'B THEN                                    0559
*                                                                  0559
         B     @RC00554                                            0559
@RF00554 L     @01,CTGPLPTR                                        0559
         TM    CTGLBASE(@01),B'10000000'                           0559
         BNO   @RF00559                                            0559
*           /*********************************************************/
*           /*                                                       */
*           /* PROCESS SUPERLOCATE FOR GDG BASE                      */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0560
*           CALL SLGDGB;                                           0560
         BAL   @14,SLGDGB                                          0560
*         ELSE                                                     0561
*                                                                  0561
*           /*********************************************************/
*           /*                                                       */
*           /* PROCESS NORMAL SUPERLOCATE                            */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0561
*           CALL SLNAME;                                           0561
         B     @RC00559                                            0561
@RF00559 BAL   @14,SLNAME                                          0561
*     END;                          /*                       @ZA04937*/
*   END SUPERLOC;                                                  0563
@EL00008 L     @13,4(,@13)                                         0563
@EF00008 DS    0H                                                  0563
@ER00008 L     @14,12(,@13)                                        0563
         BR    @14                                                 0563
*                                                                  0564
*   /*****************************************************************/
*   /*                                                               */
*   /* SLGDG IS CALLED TO PROCESS A SUPERLOCATE GDG REQUEST WITH BASE*/
*   /* GENERATION NUMBER SUPPLIED                                    */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0564
*SLGDG:                                                            0564
*   PROC OPTIONS(SAVEAREA(16),SAVE(14));                           0564
SLGDG    ST    @14,12(,@13)                                        0564
         ST    @13,@SA00009+4                                      0564
         LA    @14,@SA00009                                        0564
         LR    @13,@14                                             0564
*   HOLDREL=CPLDSN(SAVER1+1:SAVER1+8);                             0565
         L     @01,CTGPLPTR                                        0565
         L     @01,CTGENT(,@01)                                    0565
         AL    @01,SAVER1                                          0565
         MVC   HOLDREL(8),CPLDSN(@01)                              0565
*   RFY                                                            0566
*    (R1,                                                          0566
*     R2,                                                          0566
*     R3,                                                          0566
*     R4) RSTD;                                                    0566
*   R1=ADDR(HOLDREL);                                              0567
*                                                                  0567
         LA    R1,HOLDREL                                          0567
*   /*****************************************************************/
*   /*                                                               */
*   /* CONVERT RELATIVE GEN. NUMBER TO BINARY                        */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0568
*   GEN;                                                           0568
         LA    R3,7         SET LOOP CONTROL TO 7
         LR    R2,R1        R2 = ADDRESS OF HOLDREL
         SR    R4,R4        CLEAR R4 FOR SIGN SWITCH
         CLI   0(R2),C'+'   CHECK FOR PLUS SIGN
         BE    SLGDG50      FOUND,GO SET SIGN SWITCH
         CLI   0(R2),C'-'   CHECK FOR MINUS SIGN
         BE    SLGDG40      FOUND,GO SET SIGN SWITCH
SLGDG0   CLI   0(R2),C')'   CHECK FOR RIGHT PAREN
         BE    SLGDG30      FOUND,GO FINISH UP
         TM    0(R2),X'F0'  CHECK FOR NUMERIC CHARACTER
         BO    SLGDG20      NUMERIC,GO BUMP POINTERS
SLGDG10  MVC   VSRC15(4),VS8 INDICATE DATASET NOT FOUND
         B     SLGDG60        EXIT
SLGDG20  LA    R2,1(R2)     BUMP POINTER BY 1
         BCT   R3,SLGDG0    GO CHECK NEXT IF LIMIT NOT REACHED
         B     SLGDG10      NO RIGHT PAREN FOUND,ERROR
SLGDG30  CR    R1,R2        ANY CHARACTERS PROCESSED
         BE    SLGDG10      NO GO INDICATE ERROR
         BCTR  R2,R0        POINT TO LAST CHARACTER
         BCT   R4,SLGDG60   BRANCH IF PLUS SIGN SWITCH
         NI    0(R2),X'DF'  MAKE VALUE NEGATIVE
         B     SLGDG60      END OF TEST LOOP
SLGDG40  LA    R4,1         SET SIGN SWITCH FOR MINUS
SLGDG50  LA    R1,1(R1)     BUMP PAST SIGN
         LR    R2,R1        BUMP PAST SIGN
         B     SLGDG0       GO PROCESS BYTES
SLGDG60  DS    0H
*   IF VSRC15^=0 THEN                                              0569
         L     @05,VSRC15                                          0569
         LTR   @05,@05                                             0569
         BNZ   @RT00569                                            0569
*     ;                                                            0570
*   ELSE                                                           0571
*                                                                  0571
*     /***************************************************************/
*     /*                                                             */
*     /* NO ERROR YET SO CONTINUE                                    */
*     /*                                                             */
*     /***************************************************************/
*                                                                  0571
*     DO;                                                          0571
*       R2=R2-R1;                   /* CALCULATE NUMBER OF BYTES FOR
*                                      EXECUTE OF PACK INST.         */
         SLR   R2,R1                                               0572
*       GEN;                                                       0573
         EX    R2,SLEXPACK PACK RELATIVE NUM. R1 HAS CORRECT ADDR.
         CVB   R2,HOLDREL  CONVERT RELATIVE NUM TO BINARY
         ST    R2,RELNUM   SAVE RELATIVE NUMBER
         B     SLGDG70     BRANCH AROUND PACK INSTRUCTION
SLEXPACK PACK  HOLDREL(8),0(0,R1)
SLGDG70  DS    0H
*       RFY                                                        0574
*        (R1,                                                      0574
*         R2,                                                      0574
*         R3,                                                      0574
*         R4) UNRSTD;               /*                       @YM05181*/
*                                                                  0574
*       /*************************************************************/
*       /*                                                           */
*       /* CONVERT SUPPLIED BASE TO BINARY                   @YM05181*/
*       /*                                                           */
*       /*************************************************************/
*                                                                  0575
*       RFY                                                        0575
*         R1 RSTD;                  /*                       @YM05181*/
*       R1=ADDR(GGGG);              /* ADDRESS OF S BASE     @YM05181*/
         L     @15,CTGPLPTR                                        0576
         L     @15,CTGWKA(,@15)                                    0576
         L     R1,CTGWAGB(,@15)                                    0576
*       GEN(PACK  HOLDREL(8),0(4,R1));/*                     @YM05181*/
         PACK  HOLDREL(8),0(4,R1)
*       GEN(CVB   R1,HOLDREL);      /*                       @YM05181*/
         CVB   R1,HOLDREL
*       IF RELNUM>0 THEN            /*                       @ZA06684*/
         L     @15,RELNUM                                          0579
         LTR   @15,@15                                             0579
         BNP   @RF00579                                            0579
*         DO;                       /*                       @YM05181*/
*                                                                  0580
*           /*********************************************************/
*           /*                                                       */
*           /* CALC NEW G0000V00                             @YM05181*/
*           /*                                                       */
*           /*********************************************************/
*                                                                  0581
*           R1=R1+RELNUM;           /*                       @ZA04937*/
         ALR   R1,@15                                              0581
*           WKDSN(SAVER1:SAVER1+8)= /*                       @YM05181*/
*               '.G0000V00';        /*                       @YM05181*/
         L     @15,SAVER1                                          0582
         LA    @14,WKDSN-1(@15)                                    0582
         MVC   0(9,@14),@CC02991                                   0582
*           GEN(CVD   R1,HOLDREL);  /*                       @YM05181*/
         CVD   R1,HOLDREL
*           GEN(OI    HOLDREL+7,X'0F');                            0584
         OI    HOLDREL+7,X'0F'
*           R1=ADDR(WKDSN)+SAVER1+1;                               0585
         LA    R1,WKDSN                                            0585
         AL    R1,SAVER1                                           0585
         AL    R1,@CF00064                                         0585
*           GEN(UNPK  0(4,R1),HOLDREL+5(3));                       0586
         UNPK  0(4,R1),HOLDREL+5(3)
*           RFY                                                    0587
*             R1 UNRSTD;            /*                       @YM05181*/
*         END;                      /*                       @YM05181*/
*                                                                  0588
*       /*************************************************************/
*       /*                                                           */
*       /* LOCATE DATASET                                    @YM05181*/
*       /*                                                           */
*       /*************************************************************/
*                                                                  0589
*       CALL LOCNAME;               /*                       @YM05181*/
@RF00579 BAL   @14,LOCNAME                                         0589
*       IF SLGDGF='0'B THEN                                        0590
         TM    SLGDGF,B'10000000'                                  0590
         BNZ   @RF00590                                            0590
*         VSRC15=VS8;               /* NOT A GDG             @ZA04937*/
         L     @15,VS8                                             0591
         ST    @15,VSRC15                                          0591
*       ELSE                                                       0592
*         IF OSRC15=OS8             /*                       @YM05181*/
*           THEN                    /*                       @YM05181*/
         B     @RC00590                                            0592
@RF00590 CLC   OSRC15(4),OS8                                       0592
         BNE   @RF00592                                            0592
*           DO;                     /*                       @YM05181*/
*                                                                  0593
*             /*******************************************************/
*             /*                                                     */
*             /* DATASET NOT FOUND,MUST BE NEW               @YM05181*/
*             /*                                                     */
*             /*******************************************************/
*                                                                  0594
*             OSRC15=0;             /*                       @YM05181*/
         SLR   @15,@15                                             0594
         ST    @15,OSRC15                                          0594
*             CALL GETUSERK;        /*                       @YM05181*/
         BAL   @14,GETUSERK                                        0595
*             CTGNGDSN='1'B;        /*                       @YM05181*/
         L     @01,CTGPLPTR                                        0596
         OI    CTGNGDSN(@01),B'00010000'                           0596
*             CALL GETSVCK;         /*                       @YM05181*/
         BAL   @14,GETSVCK                                         0597
*           END;                    /*                       @YM05181*/
*         ELSE                                                     0599
*           ;                       /*                       @YM05181*/
@RF00592 DS    0H                                                  0600
*       IF OSRC15^=0                /*                       @YM05181*/
*         THEN                      /*                       @YM05181*/
@RC00590 L     @15,OSRC15                                          0600
         LTR   @15,@15                                             0600
         BZ    @RF00600                                            0600
*         DO;                       /*                       @YM05181*/
*           IF OSRC15=VS68 THEN     /* CANT ALLOC NEW CVOL?  @OZ24472*/
         C     @15,VS68                                            0602
         BNE   @RF00602                                            0602
*             VSRC15=OSRC15;        /* SET RC=68             @OZ24472*/
         ST    @15,VSRC15                                          0603
*           ELSE                    /*                       @OZ24472*/
*             IF OSRC15=OS24        /* LOCATE IO ERROR?      @YM05181*/
*               THEN                                               0604
         B     @RC00602                                            0604
@RF00602 L     @15,OS24                                            0604
         C     @15,OSRC15                                          0604
         BNE   @RF00604                                            0604
*               VSRC15=OS24;        /* SET IO ERROR                  */
         ST    @15,VSRC15                                          0605
*             ELSE                                                 0606
*               VSRC15=VS8;         /* SET DSET NOT FOUND            */
         B     @RC00604                                            0606
@RF00604 L     @15,VS8                                             0606
         ST    @15,VSRC15                                          0606
*         END;                      /*                       @YM05181*/
*       ELSE                        /*                       @YM05181*/
*         DO;                       /*                       @YM05181*/
         B     @RC00600                                            0608
@RF00600 DS    0H                                                  0609
*           CALL GETUSERK;          /*                       @YM05181*/
         BAL   @14,GETUSERK                                        0609
*           CPLDSN=LOCDSN;          /*                       @YM05181*/
         L     @15,CTGPLPTR                                        0610
         L     @01,CTGENT(,@15)                                    0610
         MVC   CPLDSN(44,@01),LOCDSN                               0610
*           CTGCVVOL=WKCVOLVS;                                     0611
         L     @01,CTGCVOL(,@15)                                   0611
         MVC   CTGCVVOL(6,@01),WKCVOLVS                            0611
*           CALL GETSVCK;           /*                       @YM05181*/
         BAL   @14,GETSVCK                                         0612
*           CALL SLVOLST;           /*                       @YM05181*/
         BAL   @14,SLVOLST                                         0613
*         END;                      /*                       @YM05181*/
*     END;                          /*                       @YM05181*/
*   END SLGDG;                                                     0616
@EL00009 L     @13,4(,@13)                                         0616
@EF00009 DS    0H                                                  0616
@ER00009 L     @14,12(,@13)                                        0616
         BR    @14                                                 0616
*                                                                  0617
*   /*****************************************************************/
*   /*                                                               */
*   /* SLGDGB IS CALLED TO PROCESS A SUPERLOCATE GDG BASE ONLY       */
*   /* REQUEST.                                                      */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0617
*SLGDGB:                                                           0617
*   PROC OPTIONS(SAVEAREA(16),SAVE(14));                           0617
SLGDGB   ST    @14,12(,@13)                                        0617
         ST    @13,@SA00010+4                                      0617
         LA    @14,@SA00010                                        0617
         LR    @13,@14                                             0617
*   WKDSN(SAVER1:SAVER1+3)='(0) ';  /* SET UP FOR LOCATE             */
         L     @01,SAVER1                                          0618
         LA    @15,WKDSN-1(@01)                                    0618
         MVC   0(4,@15),@CC02996                                   0618
*   CALL LOCNAME;                   /* LOCATE ON (0) LEVEL           */
         BAL   @14,LOCNAME                                         0619
*   IF OSRC15=0 THEN                                               0620
*                                                                  0620
         L     @15,OSRC15                                          0620
         LTR   @15,@15                                             0620
         BNZ   @RF00620                                            0620
*     /***************************************************************/
*     /*                                                             */
*     /* DATASET FOUND SO FINISH REQUEST                             */
*     /*                                                             */
*     /***************************************************************/
*                                                                  0621
*     DO;                                                          0621
*       CALL SLVOLST;               /* GO FILL VOL LIST      @OZ12899*/
         BAL   @14,SLVOLST                                         0622
*       IF VSRC15^=VS40 THEN        /* ENOUGH SPACE?         @OZ12899*/
         CLC   VSRC15(4),VS40                                      0623
         BE    @RF00623                                            0623
*         DO;                       /* YES, THEN DO          @OZ12899*/
*           CALL GETUSERK;          /* GET INTO USER'S KEY           */
         BAL   @14,GETUSERK                                        0625
*           CPLDSN=LOCDSN;          /* DATASET NAME TO USER          */
         L     @01,CTGPLPTR                                        0626
         L     @01,CTGENT(,@01)                                    0626
         MVC   CPLDSN(44,@01),LOCDSN                               0626
*           CALL GETSVCK;           /* GET INTO SVC KEY              */
         BAL   @14,GETSVCK                                         0627
*           IF SLGDGF='0'B THEN                                    0628
         TM    SLGDGF,B'10000000'                                  0628
         BNZ   @RF00628                                            0628
*             VSRC15=VS8;           /* SET NO DATASET        @ZA04937*/
         L     @15,VS8                                             0629
         ST    @15,VSRC15                                          0629
*           ELSE                                                   0630
*             DO;                                                  0630
         B     @RC00628                                            0630
@RF00628 DS    0H                                                  0631
*               CALL GETUSERK;      /* GET INTO USER'S KEY           */
         BAL   @14,GETUSERK                                        0631
*               CTGWAGCT=SLCURSIZ;  /* # GENS TO USR         @ZA04937*/
         L     @01,CTGPLPTR                                        0632
         L     @01,CTGWKA(,@01)                                    0632
         LH    @00,SLCURSIZ                                        0632
         STH   @00,CTGWAGCT(,@01)                                  0632
*               CALL GETSVCK;       /* GET INTO SVC KEY              */
         BAL   @14,GETSVCK                                         0633
*             END;                                                 0634
*         END;                      /*                       @OZ12899*/
*     END;                                                         0636
*   ELSE                                                           0637
*                                                                  0637
*     /***************************************************************/
*     /*                                                             */
*     /* DATASET NOT FOUND CHECK IF A GIPE EXISTS                    */
*     /*                                                             */
*     /***************************************************************/
*                                                                  0637
*     IF OSRC15^=OS8×SLGDGF='0'B THEN/* IF OTHER THAN 'DSET NOT    0637
*                                      FOUND' OR GIPE NOT FOUND    0637
*                                                            @ZA04937*/
         B     @RC00620                                            0637
@RF00620 CLC   OSRC15(4),OS8                                       0637
         BNE   @RT00637                                            0637
         TM    SLGDGF,B'10000000'                                  0637
         BNZ   @RF00637                                            0637
@RT00637 DS    0H                                                  0638
*       IF OSRC15=VS68 THEN         /* AND CANT ALLOC NEXT CVOL    0638
*                                                            @OZ24472*/
         L     @15,OSRC15                                          0638
         C     @15,VS68                                            0638
         BNE   @RF00638                                            0638
*         VSRC15=OSRC15;            /* SET NOT ALLOCATED     @OZ24472*/
         ST    @15,VSRC15                                          0639
*       ELSE                        /*                       @OZ24472*/
*         VSRC15=VS8;               /* SET DSET NOT FOUND    @ZA04937*/
         B     @RC00638                                            0640
@RF00638 L     @15,VS8                                             0640
         ST    @15,VSRC15                                          0640
*     ELSE                                                         0641
*                                                                  0641
*       /*************************************************************/
*       /*                                                           */
*       /* EMPTY GIPE EXISTS SO INDICATE EMPTY BASE                  */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0641
*       DO;                                                        0641
         B     @RC00637                                            0641
@RF00637 DS    0H                                                  0642
*         LOCDSN(SAVER1:SAVER1+8)='.G0000V00';/* SET UP EMPTY GEN  0642
*                                      INDEX                         */
         L     @01,SAVER1                                          0642
         LA    @15,LOCDSN-1(@01)                                   0642
         MVC   0(9,@15),@CC02991                                   0642
*         CALL GETUSERK;            /* GET INTO USER'S KEY           */
         BAL   @14,GETUSERK                                        0643
*         CPLDSN=LOCDSN;            /* GIVE BACK DATASET NM.         */
         L     @15,CTGPLPTR                                        0644
         L     @01,CTGENT(,@15)                                    0644
         MVC   CPLDSN(44,@01),LOCDSN                               0644
*         CTGWAGCT=0;               /* ZERO NUMBER OF GENS           */
         L     @01,CTGWKA(,@15)                                    0645
         SLR   @00,@00                                             0645
         STH   @00,CTGWAGCT(,@01)                                  0645
*         CALL GETSVCK;             /* GET INTO SVC KEY              */
         BAL   @14,GETSVCK                                         0646
*       END;                                                       0647
*   END SLGDGB;                                                    0648
@EL00010 L     @13,4(,@13)                                         0648
@EF00010 DS    0H                                                  0648
@ER00010 L     @14,12(,@13)                                        0648
         BR    @14                                                 0648
*                                                                  0649
*   /*****************************************************************/
*   /*                                                               */
*   /* SLNAME IS CALLED TO PROCESS A NORMAL SUPERLOCATE OR A GDG ALL */
*   /* REQUEST.                                                      */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0649
*SLNAME:                                                           0649
*   PROC OPTIONS(SAVEAREA(16),SAVE(14));                           0649
SLNAME   ST    @14,12(,@13)                                        0649
         ST    @13,@SA00011+4                                      0649
         LA    @14,@SA00011                                        0649
         LR    @13,@14                                             0649
*   CALL LOCNAME;                   /* LOCATE ON SUPPLIED NAME       */
         BAL   @14,LOCNAME                                         0650
*   IF OSRC15=0 THEN                                               0651
*                                                                  0651
         L     @15,OSRC15                                          0651
         LTR   @15,@15                                             0651
         BNZ   @RF00651                                            0651
*     /***************************************************************/
*     /*                                                             */
*     /* DATASET FOUND SO FINISH REQUEST                             */
*     /*                                                             */
*     /***************************************************************/
*                                                                  0652
*     DO;                                                          0652
*       CALL GETUSERK;              /* GET INTO USER'S KEY           */
         BAL   @14,GETUSERK                                        0653
*       CPLDSN=LOCDSN;              /* DATASET NAME TO USER          */
         L     @01,CTGPLPTR                                        0654
         L     @01,CTGENT(,@01)                                    0654
         MVC   CPLDSN(44,@01),LOCDSN                               0654
*       CALL GETSVCK;               /* GET INTO SVC KEY              */
         BAL   @14,GETSVCK                                         0655
*       CALL SLVOLST;               /* GO FILL VOLUME LIST           */
         BAL   @14,SLVOLST                                         0656
*     END;                                                         0657
*   ELSE                                                           0658
*                                                                  0658
*     /***************************************************************/
*     /*                                                             */
*     /* DATASET NOT FOUND CHECK IF A GIPE EXISTS(GDG ALL)           */
*     /*                                                             */
*     /***************************************************************/
*                                                                  0658
*     DO;                                                          0658
         B     @RC00651                                            0658
@RF00651 DS    0H                                                  0659
*       IF OSRC15=OS12&SLGDGF='1'B THEN/* IF NOT RC=12 AND GDG     0659
*                                                            @ZA04937*/
*                                                                  0659
         CLC   OSRC15(4),OS12                                      0659
         BNE   @RF00659                                            0659
         TM    SLGDGF,B'10000000'                                  0659
         BNO   @RF00659                                            0659
*         /***********************************************************/
*         /*                                                         */
*         /* GIPE EXISTS SO PROCESS AS GDG ALL REQUEST               */
*         /*                                                         */
*         /***********************************************************/
*                                                                  0660
*         DO;                                                      0660
*           CALL GETUSERK;          /* GET INTO USER'S KEY           */
         BAL   @14,GETUSERK                                        0661
*           CTGGDGB='1'B;           /* INDICATE BASE LOCATED         */
         L     @15,CTGPLPTR                                        0662
         OI    CTGGDGB(@15),B'00100000'                            0662
*           CTGWAGCT=SLCURSIZ;      /* NUMBER OF GENS TO USER      0663
*                                                            @ZA04937*/
         L     @01,CTGWKA(,@15)                                    0663
         LH    @00,SLCURSIZ                                        0663
         STH   @00,CTGWAGCT(,@01)                                  0663
*           CALL GETSVCK;           /* GET INTO SVC KEY              */
         BAL   @14,GETSVCK                                         0664
*         END;                                                     0665
*       ELSE                                                       0666
*         IF OSRC15=VS68 THEN       /* CANNOT ALLOCATE       @OZ17073*/
         B     @RC00659                                            0666
@RF00659 L     @15,OSRC15                                          0666
         C     @15,VS68                                            0666
         BNE   @RF00666                                            0666
*           VSRC15=OSRC15;          /* CATALOG               @OZ17073*/
         ST    @15,VSRC15                                          0667
*         ELSE                      /*                       @OZ17073*/
*           VSRC15=VS8;             /* SET NOT DATASET       @ZA04937*/
         B     @RC00666                                            0668
@RF00666 L     @15,VS8                                             0668
         ST    @15,VSRC15                                          0668
*     END;                                                         0669
*   END SLNAME;                                                    0670
@EL00011 L     @13,4(,@13)                                         0670
@EF00011 DS    0H                                                  0670
@ER00011 L     @14,12(,@13)                                        0670
         BR    @14                                                 0670
*                                                                  0671
*   /*****************************************************************/
*   /*                                                               */
*   /* GENLOC IS CALLED TO PERFORM A VSAM-LIKE GENERIC LOCATE. MOST  */
*   /* OF THE PROCESSING IS DONE BY THE SECOND CSECT OF THE INTERFACE*/
*   /* MAPPER(IGG0CLCB) WHICH IS COMPOSED OF MODIFIED CODE FROM VS2-1*/
*   /* TSO LISTCAT COMMAND.                                          */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0671
*GENLOC:                                                           0671
*   PROC OPTIONS(SAVEAREA(16),SAVE(14));                           0671
GENLOC   ST    @14,12(,@13)                                        0671
         ST    @13,@SA00012+4                                      0671
         LA    @14,@SA00012                                        0671
         LR    @13,@14                                             0671
*   WKDSN=CPLDSN;                   /* MOVE DATA SET NAME TO WKAREA  */
         L     @15,CTGPLPTR                                        0672
         L     @01,CTGENT(,@15)                                    0672
         MVC   WKDSN(44),CPLDSN(@01)                               0672
*   IF CTGRCATN='1'B THEN                                          0673
*                                                                  0673
         TM    CTGRCATN(@15),B'00100000'                           0673
         BNO   @RF00673                                            0673
*     /***************************************************************/
*     /*                                                             */
*     /* IF RETURN CATALOG NAME SWITCH IS ON RETURN CATALOG NAME TO  */
*     /* USER'S AREA BEFORE INVOKING IGG0CLCB TO RETURN DATASET      */
*     /* NAMES.                                                      */
*     /*                                                             */
*     /***************************************************************/
*                                                                  0674
*     DO;                                                          0674
*       CALL GETUSERK;              /* GET INTO USER'S KEY           */
         BAL   @14,GETUSERK                                        0675
*       RFY                                                        0676
*         R3 RSTD;                                                 0676
*       R3=WALEN2;                  /* GET LENGTH USED VALUE         */
         L     @01,CTGPLPTR                                        0677
         L     @01,CTGWKA(,@01)                                    0677
         LH    R3,WALEN2(,@01)                                     0677
         N     R3,@CF03065                                         0677
*       IF R3=0 THEN                /* IF USED LENGTH IS ZERO        */
         LTR   R3,R3                                               0678
         BNZ   @RF00678                                            0678
*         R3=4;                     /* SET DEFAULT LENGTH TO 4       */
         LA    R3,4                                                0679
*       ELSE                                                       0680
*         ;                                                        0680
@RF00678 DS    0H                                                  0681
*       R3=R3+45;                   /* ADD 45 TO USED LENGTH         */
         AL    R3,@CF03003                                         0681
*       WALEN2=R3;                  /* STORE UPDATED LENGTH          */
         L     @02,CTGPLPTR                                        0682
         L     @02,CTGWKA(,@02)                                    0682
         STH   R3,WALEN2(,@02)                                     0682
*       RFY                                                        0683
*         R3 UNRSTD;                                               0683
*       CALL GETSVCK;               /* GET BACK INTO SVC KEY         */
         BAL   @14,GETSVCK                                         0684
*       IF WALEN2<=WALEN1 THEN                                     0685
*                                                                  0685
         L     @01,CTGPLPTR                                        0685
         L     @15,CTGWKA(,@01)                                    0685
         CLC   WALEN2(2,@15),WALEN1(@15)                           0685
         BH    @RF00685                                            0685
*         /***********************************************************/
*         /*                                                         */
*         /* IF THERE IS ROOM TO FIT THE CATALOG NAME INTO THE USER'S*/
*         /* WORK AREA THEN MOVE IT IN.                              */
*         /*                                                         */
*         /***********************************************************/
*                                                                  0686
*         DO;                                                      0686
*           CALL GETUSERK;          /* GET INTO USER'S KEY           */
         BAL   @14,GETUSERK                                        0687
*           RFY                                                    0688
*             R3 RSTD;                                             0688
*           R3=CTGWKA+(WALEN2-45);  /* CALCULATE ENT.ADDR.           */
         L     @01,CTGPLPTR                                        0689
         L     @15,CTGWKA(,@01)                                    0689
         LH    R3,WALEN2(,@15)                                     0689
         N     R3,@CF03065                                         0689
         SL    R3,@CF03003                                         0689
         ALR   @15,R3                                              0689
         LR    R3,@15                                              0689
*           R3->WATYPE='0';         /* CAT.NAME TYPE IS 'F0'X        */
         MVI   WATYPE(R3),C'0'                                     0690
*           R3->WADSNAME=WKCATNM;   /* MOVE CATALOG NAME             */
         MVC   WADSNAME(44,R3),WKCATNM                             0691
*           RFY                                                    0692
*             R3 UNRSTD;                                           0692
*           CALL GETSVCK;           /* GET BACK INTO SVC KEY         */
         BAL   @14,GETSVCK                                         0693
*         END;                                                     0694
*       ELSE                                                       0695
*         DO;                       /*                       @OZ19727*/
         B     @RC00685                                            0695
@RF00685 DS    0H                                                  0696
*           VSRC15=VS44;            /* WORKAREA TOO SMALL    @OZ08008*/
         L     @15,VS44                                            0696
         ST    @15,VSRC15                                          0696
*           GOTO ENDLOC;            /* RETURN TO USER        @OZ19727*/
         B     ENDLOC                                              0697
*         END;                      /*                       @OZ19727*/
*     END;                                                         0699
*   ELSE                                                           0700
*     ;                                                            0700
@RF00673 DS    0H                                                  0701
*   RFY                                                            0701
*    (R0,                                                          0701
*     R1,                                                          0701
*     R2) RSTD;                                                    0701
@RC00673 DS    0H                                                  0702
*   R0=CTGENT;                      /* PASS ADDRESS OF DSNAME        */
         L     @03,CTGPLPTR                                        0702
         L     R0,CTGENT(,@03)                                     0702
*   R1=CTGWKA;                      /* PASS ADDRESS OF WORKAREA      */
         L     R1,CTGWKA(,@03)                                     0703
*   R2=TCBPTR;                      /* PASS ADDRESS OF TCB           */
         L     R2,TCBPTR                                           0704
*   GEN(ST    R13,XSAVAREA+4);      /* SAVE REG13 ADDR               */
         ST    R13,XSAVAREA+4
*   GEN(LA    R13,XSAVAREA);        /* GET NEW SAVEAREA ADDR         */
         LA    R13,XSAVAREA
*   CALL IGG0CLCB;                  /* GO DO GENERIC LOCATE(S)       */
         L     @15,@CV00057                                        0707
         BALR  @14,@15                                             0707
*   GEN(L     R13,XSAVAREA+4);      /* RESET REG13                   */
         L     R13,XSAVAREA+4
*   IF CTGRCATN='1'B THEN           /* RETURN CAT SWITCH     @OZ32592*/
         L     @03,CTGPLPTR                                        0709
         TM    CTGRCATN(@03),B'00100000'                           0709
         BNO   @RF00709                                            0709
*     DO;                                                          0710
*       CALL GETUSERK;              /* INTO USERS KEY        @OZ32592*/
         BAL   @14,GETUSERK                                        0711
*       RFY                                                        0712
*         R3 RSTD;                                                 0712
*       R3=CTGWKA+4;                /* CTLG NAME SLOT PTR    @OZ32592*/
         LA    R3,4                                                0713
         L     @15,CTGPLPTR                                        0713
         AL    R3,CTGWKA(,@15)                                     0713
*       IF R3->WATYPE='0' THEN      /* CATALOG ENTRY?        @OZ32592*/
         CLI   WATYPE(R3),C'0'                                     0714
         BNE   @RF00714                                            0714
*         R3->WADSNAME=WKCATNM;     /* THEN REVISE IN CASE NEW CVOL
*                                      WAS ACCESSED          @OZ32592*/
         MVC   WADSNAME(44,R3),WKCATNM                             0715
*       ELSE                                                       0716
*         ;                         /*                       @OZ32592*/
@RF00714 DS    0H                                                  0717
*       CALL GETSVCK;               /* BACK TO SYSTEM KEY    @OZ32592*/
         BAL   @14,GETSVCK                                         0717
*     END;                                                         0718
*   RFY                                                            0719
*    (R0,                                                          0719
*     R1,                                                          0719
*     R2,                                                          0719
*     R3) UNRSTD;                                                  0719
@RF00709 DS    0H                                                  0720
*   RFY                                                            0720
*     R15 RSTD;                                                    0720
*   IF R15=GL4 THEN                                                0721
         C     R15,GL4                                             0721
         BNE   @RF00721                                            0721
*     VSRC15=VS8;                   /* SET DATASET NOT FOUND         */
         L     @14,VS8                                             0722
         ST    @14,VSRC15                                          0722
*   ELSE                                                           0723
*     IF R15=GL8 THEN                                              0723
         B     @RC00721                                            0723
@RF00721 C     R15,GL8                                             0723
         BNE   @RF00723                                            0723
*       VSRC15=VS164;               /* SET OUT OF CORE               */
         L     @14,VS164                                           0724
         ST    @14,VSRC15                                          0724
*     ELSE                                                         0725
*       IF R15=GL12 THEN                                           0725
         B     @RC00723                                            0725
@RF00723 C     R15,GL12                                            0725
         BNE   @RF00725                                            0725
*         VSRC15=VS44;              /* WORKAREA TOO SMALL    @OZ08008*/
         L     @14,VS44                                            0726
         ST    @14,VSRC15                                          0726
*       ELSE                                                       0727
*         ;                                                        0727
@RF00725 DS    0H                                                  0728
*ENDLOC:                            /*                       @OZ19727*/
*   RFY                                                            0728
*    (R15) UNRSTD;                                                 0728
*   END GENLOC;                                                    0729
@EL00012 L     @13,4(,@13)                                         0729
@EF00012 DS    0H                                                  0729
@ER00012 L     @14,12(,@13)                                        0729
         BR    @14                                                 0729
*                                                                  0730
*   /*****************************************************************/
*   /*                                                               */
*   /* DELETE IS CALLED TO PERFORM A VSAM-LIKE DELETE REQUEST. THIS  */
*   /* IS ACCOMPLISHED BY ISSUING OS UCATDX REQUEST AND OPTIONALLY   */
*   /* ISSUING SCRATCH SVC.                                          */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0730
*DELETE:                                                           0730
*   PROC OPTIONS(SAVEAREA(16),SAVE(14));                           0730
DELETE   ST    @14,12(,@13)                                        0730
         ST    @13,@SA00013+4                                      0730
         LA    @14,@SA00013                                        0730
         LR    @13,@14                                             0730
*   IF CTGTYPE^='A' THEN                                           0731
         L     @01,CTGPLPTR                                        0731
         CLI   CTGTYPE(@01),C'A'                                   0731
         BE    @RF00731                                            0731
*     VSRC15=VS48;                  /* SET INVALID FUNCTION          */
         L     @15,VS48                                            0732
         ST    @15,VSRC15                                          0732
*   ELSE                                                           0733
*                                                                  0733
*     /***************************************************************/
*     /*                                                             */
*     /* DATASET TYPE CODE IS NON VSAM SO PROCESS IT                 */
*     /*                                                             */
*     /***************************************************************/
*                                                                  0733
*     DO;                                                          0733
         B     @RC00731                                            0733
@RF00731 DS    0H                                                  0734
*       WKDSN=CPLDSN;               /* SAVE DATASET NAME             */
         L     @01,CTGPLPTR                                        0734
         L     @01,CTGENT(,@01)                                    0734
         MVC   WKDSN(44),CPLDSN(@01)                               0734
*       CALL LOCNAME;               /* LOCATE DATASET IN CATALOG     */
         BAL   @14,LOCNAME                                         0735
*       IF OSRC15^=0 THEN                                          0736
         L     @15,OSRC15                                          0736
         LTR   @15,@15                                             0736
         BZ    @RF00736                                            0736
*         DO;                                                      0737
*           IF OSRC15=OS24 THEN                                    0738
         C     @15,OS24                                            0738
         BNE   @RF00738                                            0738
*             VSRC15=VS28;          /* SET NON LOC. IO ERROR         */
         L     @15,VS28                                            0739
         ST    @15,VSRC15                                          0739
*           ELSE                                                   0740
*             VSRC15=VS8;           /* SET NO DATASET                */
         B     @RC00738                                            0740
@RF00738 L     @15,VS8                                             0740
         ST    @15,VSRC15                                          0740
*         END;                                                     0741
*       ELSE                                                       0742
*         DO;                                                      0742
         B     @RC00736                                            0742
@RF00736 DS    0H                                                  0743
*           RFY                                                    0743
*             I RSTD;                                              0743
*           IF CTGSCR='1'B THEN                                    0744
*                                                                  0744
         L     @07,CTGPLPTR                                        0744
         TM    CTGSCR(@07),B'00000010'                             0744
         BNO   @RF00744                                            0744
*             /*******************************************************/
*             /*                                                     */
*             /* SCRATCH BIT IS ON SO SCRATCH DATASETS BEFORE        */
*             /* UNCATALOGING THEM. SCR VOLUMES 20 AT A TIME         */
*             /*                                                     */
*             /*******************************************************/
*                                                                  0745
*             DO;                                                  0745
*               IF CTGPURG='1'B THEN                               0746
         TM    CTGPURG(@07),B'00100000'                            0746
         BNO   @RF00746                                            0746
*                 WKOPTNS=SCRPURGE; /* SCRATCH PURGE                 */
         MVC   WKOPTNS(4),SCRPURGE                                 0747
*               ELSE                                               0748
*                 WKOPTNS=SCRNOPUR; /* SCRATCH-NO PURGE              */
         B     @RC00746                                            0748
@RF00746 MVC   WKOPTNS(4),SCRNOPUR                                 0748
*               IF CTGTIOT='1'B THEN/*                       @OZ28096*/
@RC00746 L     @07,CTGPLPTR                                        0749
         TM    CTGTIOT(@07),B'00000100'                            0749
         BNO   @RF00749                                            0749
*                 DO;               /* SYSZTIOT ALREADY ENQUED       */
*                   CALL CHEKAUTH;  /* CALLER AUTHORIZED?    @OZ28096*/
         BAL   @14,CHEKAUTH                                        0751
*                   RFY                                            0752
*                    (R15) RSTD;                                   0752
*                   IF R15=ALLZERO THEN/* CALLER AUTHRIZED?@OZ19636  */
         CL    R15,ALLZERO                                         0753
         BNE   @RF00753                                            0753
*                     SCRTIOT='1'B; /* YES-SET TIOT ENQD     @OZ19636*/
         OI    SCRTIOT,B'10000000'                                 0754
*                   ELSE                                           0755
*                     ;                                            0755
@RF00753 DS    0H                                                  0756
*                 END;                                             0756
*               ELSE                                               0757
*                 ;                 /*                       @OZ19636*/
@RF00749 DS    0H                                                  0758
*               RFY                                                0758
*                (R15) UNRSTD;                                     0758
*               DO I=WKVOLNUM TO 1 BY-20;/*                  @ZA01269*/
         LH    I,WKVOLNUM                                          0759
         B     @DE00759                                            0759
@DL00759 DS    0H                                                  0760
*                 IF WKVOLNUM<20 THEN                              0760
         LH    @07,WKVOLNUM                                        0760
         C     @07,@CF02082                                        0760
         BL    @RT00760                                            0760
*                   ;               /* NUMBER OF VOLUMES FOR SCRATCH
*                                      OK                            */
*                 ELSE                                             0762
*                   WKVOLNUM=20;    /* SET VOL NUM TO 20             */
         MVC   WKVOLNUM(2),@CH02082                                0762
*                 WKPTR1=ADDR(LOCDSN);/* POINT TO DS NAME            */
@RT00760 LA    @07,LOCDSN                                          0763
         ST    @07,WKPTR1                                          0763
*                 WKCVOLP=ZEROPTR;  /* ZERO CVOL POINTER             */
         L     @07,ZEROPTR                                         0764
         ST    @07,WKCVOLP                                         0764
*                 WKPTR3=ADDR(WKVOLST);/* POINT TO VOL LIST          */
         LA    @15,WKVOLST                                         0765
         ST    @15,WKPTR3                                          0765
*                 RFY                                              0766
*                  (R0,                                            0766
*                   R1) RSTD;       /*                       @ZA03197*/
*                 R0=ZEROPTR;       /* R0 MUST BE 0 FOR SCRATCH    0767
*                                                            @ZA03197*/
         LR    R0,@07                                              0767
*                 R1=ADDR(WKCAMLST);/* POINT TO PARM LIST            */
         LA    R1,WKCAMLST                                         0768
*                 GEN(SCRATCH (1)  ISSUE SCRATCH SVC);             0769
         SCRATCH (1)  ISSUE SCRATCH SVC
*                 RFY                                              0770
*                  (R0,                                            0770
*                   R1) UNRSTD;     /*                       @ZA03197*/
*/********************************************************************/
*/*                                                                  */
*/*       CHECK SCRATCH RETURN CODES FOR EACH VOLUME                 */
*/*             RTN = 2  PASSWORD FAILED                             */
*/*             RTN = 3  EXPIRATION DATE STILL ACTIVE                */
*/*             RTN = 5  UNMATCHED DEV TYPE                          */
*/*             RTN = 7  DATA SET IS OPEN                            */
*/*                                                                  */
*/********************************************************************/
*                                                                  0771
*                 DO WKSCRLP=WKVOLNUM TO 1 BY-1 WHILE VSRC15=ZEROPTR;
         LH    WKSCRLP,WKVOLNUM                                    0771
         B     @DE00771                                            0771
@DL00771 CLC   VSRC15(4),ZEROPTR                                   0771
         BNE   @DC00771                                            0771
*                                   /*                       @ZA01269*/
*                   IF WKSCRSTS(WKSCRLP)^='00'X THEN/* IF RTN CODE 0772
*                                                            @OZ09410*/
         LR    @07,WKSCRLP                                         0772
         MH    @07,@CH00127                                        0772
         LA    @03,WKSCRSTS-12(@07)                                0772
         CLI   0(@03),X'00'                                        0772
         BE    @RF00772                                            0772
*                     IF WKSCRSTS(WKSCRLP)='02'X THEN/* IF PASSWORD
*                                      FAILED                @OZ09410*/
         LA    @03,WKSCRSTS-12(@07)                                0773
         CLI   0(@03),X'02'                                        0773
         BNE   @RF00773                                            0773
*                       VSRC15=VS56;/* SET ERROR CODE        @ZA01269*/
         L     @07,VS56                                            0774
         ST    @07,VSRC15                                          0774
*                     ELSE          /*                       @OZ09410*/
*                       IF WKSCRSTS(WKSCRLP)='03'X THEN/* ACTIVE EXP
*                                      DATE                  @OZ09410*/
         B     @RC00773                                            0775
@RF00773 LR    @07,WKSCRLP                                         0775
         MH    @07,@CH00127                                        0775
         LA    @03,WKSCRSTS-12(@07)                                0775
         CLI   0(@03),X'03'                                        0775
         BNE   @RF00775                                            0775
*                         VSRC15=VS84;/* SET ERROR CODE      @OZ09410*/
         L     @07,VS84                                            0776
         ST    @07,VSRC15                                          0776
*                       ELSE        /*                       @OZ18258*/
*                         IF WKSCRSTS(WKSCRLP)='05'X THEN/* INCRECT
*                                      DEVTYPE               @OZ18258*/
         B     @RC00775                                            0777
@RF00775 LR    @07,WKSCRLP                                         0777
         MH    @07,@CH00127                                        0777
         LA    @03,WKSCRSTS-12(@07)                                0777
         CLI   0(@03),X'05'                                        0777
         BNE   @RF00777                                            0777
*                           VSRC15=VS168;/* SET ERROR CODE   @OZ18258*/
         L     @07,VS168                                           0778
         ST    @07,VSRC15                                          0778
*                         ELSE      /*                       @OZ09410*/
*                           IF WKSCRSTS(WKSCRLP)='07'X THEN/* DATA 0779
*                                      SET OPEN              @OZ09410*/
         B     @RC00777                                            0779
@RF00777 LR    @07,WKSCRLP                                         0779
         MH    @07,@CH00127                                        0779
         LA    @03,WKSCRSTS-12(@07)                                0779
         CLI   0(@03),X'07'                                        0779
         BNE   @RF00779                                            0779
*                             VSRC15=VS184;/* SET ERROR CODE @OZ09410*/
         L     @07,VS184                                           0780
         ST    @07,VSRC15                                          0780
*                           ELSE                                   0781
*                             IF WKSCRSTS(WKSCRLP)='08'X THEN/* RACF
*                                      SECUR CHK             @OZ13519*/
         B     @RC00779                                            0781
@RF00779 LR    @07,WKSCRLP                                         0781
         MH    @07,@CH00127                                        0781
         LA    @03,WKSCRSTS-12(@07)                                0781
         CLI   0(@03),X'08'                                        0781
         BNE   @RF00781                                            0781
*                               VSRC15=VS102;/* SET ERROR CODE     0782
*                                                            @OZ13519*/
         L     @07,VS102                                           0782
         ST    @07,VSRC15                                          0782
*                             ELSE                                 0783
*                               ;   /*                       @OZ09410*/
@RF00781 DS    0H                                                  0784
*                   ELSE                                           0784
*                     ;             /*                       @OZ09410*/
@RF00772 DS    0H                                                  0785
*                 END;              /*                       @ZA01269*/
*                                                                  0785
@RC00772 BCTR  WKSCRLP,0                                           0785
@DE00771 LTR   WKSCRLP,WKSCRLP                                     0785
         BP    @DL00771                                            0785
@DC00771 DS    0H                                                  0786
*                 /***************************************************/
*                 /*                                                 */
*                 /* LOCATE ADDITIONAL VCB'S FOR SCRATCH             */
*                 /*                                                 */
*                 /***************************************************/
*                                                                  0786
*                 IF WKNXTTTR=HEX3ZERO/* IF TTR OF 0         @ZA01269*/
*                     ×WKVOLNUM=1   /* OR SINGLE VOLUME      @ZA01269*/
*                     ×VSRC15^=ZEROPTR/* ERROR CODE THEN     @OZ09410*/
*                   THEN            /* STOP LOOP             @ZA01269*/
         CLC   WKNXTTTR(3),HEX3ZERO                                0786
         BE    @RT00786                                            0786
         CLC   WKVOLNUM(2),@CH00064                                0786
         BE    @RT00786                                            0786
         CLC   VSRC15(4),ZEROPTR                                   0786
         BE    @RF00786                                            0786
@RT00786 DS    0H                                                  0787
*                   I=1;            /* SET I TO STOP LOOP            */
         LA    I,1                                                 0787
*                 ELSE              /* GET NEXT BLOCK                */
*                   DO;                                            0788
         B     @RC00786                                            0788
@RF00786 DS    0H                                                  0789
*                     SAVEI=I;      /* SAVE I AROUND CALL            */
         ST    I,SAVEI                                             0789
*                     CALL LOCTTR;  /* LOCATE NEXT VCB               */
         BAL   @14,LOCTTR                                          0790
*                     IF OSRC15^=0 THEN                            0791
         L     @07,OSRC15                                          0791
         LTR   @07,@07                                             0791
         BZ    @RF00791                                            0791
*                       DO;                                        0792
*                         VSRC15=VS28;/* SET NONLOC IO               */
         L     @07,VS28                                            0793
         ST    @07,VSRC15                                          0793
*                         SAVEI=1;  /* STOP LOOP                     */
         MVC   SAVEI(4),@CF00064                                   0794
*                       END;                                       0795
*                     ELSE                                         0796
*                       ;                                          0796
@RF00791 DS    0H                                                  0797
*                     I=SAVEI;      /* RESET I                       */
         L     I,SAVEI                                             0797
*                   END;                                           0798
*               END;                                               0799
@RC00786 AL    I,@CF03010                                          0799
@DE00759 LTR   I,I                                                 0799
         BP    @DL00759                                            0799
*             END;                                                 0800
*           ELSE                                                   0801
*             ;                                                    0801
@RF00744 DS    0H                                                  0802
*         END;                                                     0802
*       RFY                                                        0803
*         I UNRSTD;                                                0803
@RC00736 DS    0H                                                  0804
*       IF VSRC15^=0 THEN                                          0804
         L     @15,VSRC15                                          0804
         LTR   @15,@15                                             0804
         BNZ   @RT00804                                            0804
*         ;                         /* ERROR HAS OCCURRED.EXIT       */
*       ELSE                                                       0806
*         DO;                                                      0806
*           WKOPTNS=UCATOPTN;       /* INDICATE UCATDX               */
         MVC   WKOPTNS(4),UCATOPTN                                 0807
*           WKPTR1=ADDR(LOCDSN);    /* POINT TO DSNAME               */
         LA    @15,LOCDSN                                          0808
         ST    @15,WKPTR1                                          0808
*           WKCVOLP=ZEROPTR;        /* ZERO CVOL POINTER             */
         L     @15,ZEROPTR                                         0809
         ST    @15,WKCVOLP                                         0809
*           WKBLANK(1:1)=WKDSN;     /* SAVE DSN CHAR         @OZ19136*/
         MVC   WKBLANK(1),WKDSN                                    0810
*           WKDSN(1:1)=' ';         /* SET LOCDSN EOD        @OZ19136*/
         MVI   WKDSN,C' '                                          0811
*           RFY                                                    0812
*             R1 RSTD;                                             0812
*           R1=ADDR(WKCAMLST);      /* POINT TO PARM LIST            */
         LA    R1,WKCAMLST                                         0813
*           GEN(ST    R13,XSAVAREA+4 POINT TO PREVIOUS SA);        0814
         ST    R13,XSAVAREA+4 POINT TO PREVIOUS SA
*           GEN(LA    R13,XSAVAREA   R13=NEW SAVEAREA );           0815
         LA    R13,XSAVAREA   R13=NEW SAVEAREA
*           CALL IGG0CLCC;          /* GO UNCATALOG DS               */
         L     @15,@CV00058                                        0816
         BALR  @14,@15                                             0816
*           GEN(L     R13,XSAVAREA+4 RESET R13 );                  0817
         L     R13,XSAVAREA+4 RESET R13
*           RFY                                                    0818
*            (R0,                                                  0818
*             R15) RSTD;                                           0818
*           GEN(STM   R15,R0,OSRC15 SAVE RETURN CODES);            0819
         STM   R15,R0,OSRC15 SAVE RETURN CODES
*           WKDSN(1:1)=WKBLANK;     /* RESTORE DSN CHAR      @OZ19136*/
         MVC   WKDSN(1),WKBLANK                                    0820
*           WKBLANK(1:1)=' ';       /* RESTORE BLANK         @OZ19136*/
         MVI   WKBLANK,C' '                                        0821
*           RFY                                                    0822
*            (R0,                                                  0822
*             R1,                                                  0822
*             R15) UNRSTD;                                         0822
*           IF OSRC15^=0 THEN                                      0823
         L     @15,OSRC15                                          0823
         LTR   @15,@15                                             0823
         BZ    @RF00823                                            0823
*             DO;                                                  0824
*               IF OSRC15=OS28 THEN                                0825
         C     @15,OS28                                            0825
         BNE   @RF00825                                            0825
*                 VSRC15=VS28;      /* NONLOCATE IO ERR              */
         L     @15,VS28                                            0826
         ST    @15,VSRC15                                          0826
*               ELSE                                               0827
*                 VSRC15=VS8;       /* SET NO DATASET                */
         B     @RC00825                                            0827
@RF00825 L     @15,VS8                                             0827
         ST    @15,VSRC15                                          0827
*               IF OSRC15=VS8&OSRC0=VS56 THEN/*              @Z40CSRC
*                                      IF SECURITY VIOLATION @Z40CSRC*/
@RC00825 CLC   OSRC15(4),VS8                                       0828
         BNE   @RF00828                                            0828
         L     @15,VS56                                            0828
         C     @15,OSRC0                                           0828
         BNE   @RF00828                                            0828
*                 VSRC15=VS56;      /* SET SEC VIOL RC       @Z40CSRC*/
         ST    @15,VSRC15                                          0829
*               ELSE                                               0830
*                 ;                 /* SECURITY OK           @Z40CSRC*/
@RF00828 DS    0H                                                  0831
*             END;                                                 0831
*           ELSE                                                   0832
*             DO;                                                  0832
         B     @RC00823                                            0832
@RF00823 DS    0H                                                  0833
*               CALL GETUSERK;      /* GET INTO USER'S KEY           */
         BAL   @14,GETUSERK                                        0833
*               RFY                                                0834
*                 R3 RSTD;                                         0834
*               R3=WALEN2;          /* GET USED LENGTH               */
         L     @01,CTGPLPTR                                        0835
         L     @01,CTGWKA(,@01)                                    0835
         LH    R3,WALEN2(,@01)                                     0835
         N     R3,@CF03065                                         0835
*               IF R3=0 THEN                                       0836
         LTR   R3,R3                                               0836
         BNZ   @RF00836                                            0836
*                 R3=4;             /* SET DEFAULT LENGTH            */
         LA    R3,4                                                0837
*               ELSE                                               0838
*                 ;                                                0838
@RF00836 DS    0H                                                  0839
*               WALEN2=R3+45;       /* ADD DS NAME LENGTH            */
         L     @02,CTGPLPTR                                        0839
         L     @02,CTGWKA(,@02)                                    0839
         LA    @15,45                                              0839
         ALR   @15,R3                                              0839
         STH   @15,WALEN2(,@02)                                    0839
*               RFY                                                0840
*                 R3 UNRSTD;                                       0840
*               CALL GETSVCK;       /* GET INTO SVC KEY              */
         BAL   @14,GETSVCK                                         0841
*               IF WALEN2<=WALEN1 THEN                             0842
         L     @01,CTGPLPTR                                        0842
         L     @15,CTGWKA(,@01)                                    0842
         CLC   WALEN2(2,@15),WALEN1(@15)                           0842
         BH    @RF00842                                            0842
*                 DO;                                              0843
*                   CALL GETUSERK;  /* GET IN USERKEY                */
         BAL   @14,GETUSERK                                        0844
*                   RFY                                            0845
*                     R3 RSTD;                                     0845
*                   R3=CTGWKA+(WALEN2-45);                         0846
         L     @01,CTGPLPTR                                        0846
         L     @15,CTGWKA(,@01)                                    0846
         LH    R3,WALEN2(,@15)                                     0846
         N     R3,@CF03065                                         0846
         SL    R3,@CF03003                                         0846
         ALR   @15,R3                                              0846
         LR    R3,@15                                              0846
*                   R3->WATYPE='A';                                0847
         MVI   WATYPE(R3),C'A'                                     0847
*                   R3->WADSNAME=WKDSN;                            0848
         MVC   WADSNAME(44,R3),WKDSN                               0848
*                   RFY                                            0849
*                     R3 UNRSTD;                                   0849
*                   CALL GETSVCK;   /* GET INTO SVCKEY               */
         BAL   @14,GETSVCK                                         0850
*                 END;                                             0851
*               ELSE                                               0852
*                 VSRC15=40;        /* SET TOO SMALL ERR             */
         B     @RC00842                                            0852
@RF00842 MVC   VSRC15(4),@CF02833                                  0852
*             END;                                                 0853
*         END;                                                     0854
*     END;                                                         0855
*   END DELETE;                                                    0856
@EL00013 L     @13,4(,@13)                                         0856
@EF00013 DS    0H                                                  0856
@ER00013 L     @14,12(,@13)                                        0856
         BR    @14                                                 0856
*                                                                  0857
*   /*****************************************************************/
*   /*                                                               */
*   /* LOCNAME IS CALLED TO ISSUE AN OS LOCATE BY NAME               */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0857
*LOCNAME:                                                          0857
*   PROC OPTIONS(SAVEAREA(16),SAVE(14));                           0857
LOCNAME  ST    @14,12(,@13)                                        0857
         ST    @13,@SA00014+4                                      0857
         LA    @14,@SA00014                                        0857
         LR    @13,@14                                             0857
*   LOCDSN=WKDSN;                   /* SAVE DATASET NAME             */
         MVC   LOCDSN(44),WKDSN                                    0858
*   IF CTGSUPLT='1'B THEN           /* SUPERLOCATE?          @ZA04937*/
         L     @15,CTGPLPTR                                        0859
         TM    CTGSUPLT(@15),B'00010000'                           0859
         BNO   @RF00859                                            0859
*     IF CTGGDGL='1'B THEN          /* BASE SUPPLIED?        @ZA04937*/
         TM    CTGGDGL(@15),B'00001000'                            0860
         BNO   @RF00860                                            0860
*       WKOPTNS=SLOPTN2;            /* SET SLOC + BASE SUPPLIED    0861
*                                                            @ZA04937*/
         MVC   WKOPTNS(4),SLOPTN2                                  0861
*     ELSE                                                         0862
*       WKOPTNS=SLOPTN1;            /* SET SUPERLOC ONLY     @ZA04937*/
         B     @RC00860                                            0862
@RF00860 MVC   WKOPTNS(4),SLOPTN1                                  0862
*   ELSE                                                           0863
*     WKOPTNS=LOCNMOPT;             /* INDICATE LOCATE BY NAME       */
         B     @RC00859                                            0863
@RF00859 MVC   WKOPTNS(4),LOCNMOPT                                 0863
*   WKPTR1=ADDR(LOCDSN);            /* POINT TO DATASET NAME         */
@RC00859 LA    @15,LOCDSN                                          0864
         ST    @15,WKPTR1                                          0864
*   WKCVOLP=ZEROPTR;                /* ZERO CVOL POINTER             */
         L     @15,ZEROPTR                                         0865
         ST    @15,WKCVOLP                                         0865
*   WKPTR3=ADDR(WKVOLST);           /* POINT TO WORKAREA             */
         LA    @15,WKVOLST                                         0866
         ST    @15,WKPTR3                                          0866
*   WKBLANK(1:1)=WKDSN;             /* SAVE DSN CHAR         @OZ08030*/
         MVC   WKBLANK(1),WKDSN                                    0867
*   WKDSN(1:1)=' ';                 /* SET LOCDSN EOD        @OZ08030*/
         MVI   WKDSN,C' '                                          0868
*   RFY                                                            0869
*     R1 RSTD;                                                     0869
*   R1=ADDR(WKCAMLST);              /* POINT TO PARM LIST            */
         LA    R1,WKCAMLST                                         0870
*   GEN(ST    R13,XSAVAREA+4  POINT TO PREVIOUS SAVEAREA);         0871
         ST    R13,XSAVAREA+4  POINT TO PREVIOUS SAVEAREA
*   GEN(LA    R13,XSAVAREA    R13=NEW SAVEAREA ADDRESS);           0872
         LA    R13,XSAVAREA    R13=NEW SAVEAREA ADDRESS
*   CALL IGG0CLCC;                  /* GO LOCATE BY NAME             */
         L     @15,@CV00058                                        0873
         BALR  @14,@15                                             0873
*   GEN(L     R13,XSAVAREA+4  RESET R13 TO PREVIOUS SAVEAREA);     0874
         L     R13,XSAVAREA+4  RESET R13 TO PREVIOUS SAVEAREA
*   RFY                                                            0875
*    (R0,                                                          0875
*     R15) RSTD;                                                   0875
*   GEN(STM   R15,R0,OSRC15 SAVE RETURN CODES);                    0876
         STM   R15,R0,OSRC15 SAVE RETURN CODES
*   WKDSN(1:1)=WKBLANK;             /* RESTORE DSN CHAR      @OZ08030*/
         MVC   WKDSN(1),WKBLANK                                    0877
*   WKBLANK(1:1)=' ';               /* RESTORE BLANK         @OZ08030*/
         MVI   WKBLANK,C' '                                        0878
*   IF OSRC15=OS8                   /*                       @YM05181*/
*     THEN                                                         0879
         CLC   OSRC15(4),OS8                                       0879
         BNE   @RF00879                                            0879
*     WKVOLNUM=WKVOLNUM&&WKVOLNUM;  /*                       @YM05181*/
         LH    @14,WKVOLNUM                                        0880
         LR    @09,@14                                             0880
         XR    @09,@14                                             0880
         STH   @09,WKVOLNUM                                        0880
*   ELSE                                                           0881
*     ;                             /*                       @YM05181*/
@RF00879 DS    0H                                                  0882
*   RFY                                                            0882
*    (R0,                                                          0882
*     R1,                                                          0882
*     R15) UNRSTD;                                                 0882
*   INCORESW=ON;                    /* INDICATE BLOCK LOCATED BY   0883
*                                      LOCATE-BY-NAME                */
         MVC   INCORESW(1),ON                                      0883
*   END LOCNAME;                                                   0884
@EL00014 L     @13,4(,@13)                                         0884
@EF00014 DS    0H                                                  0884
@ER00014 L     @14,12(,@13)                                        0884
         BR    @14                                                 0884
*                                                                  0885
*   /*****************************************************************/
*   /*                                                               */
*   /* LOCTTR IS CALLED TO ISSUE AN OS LOCATE BY TTR.                */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0885
*LOCTTR:                                                           0885
*   PROC OPTIONS(SAVEAREA(16),SAVE(14));                           0885
LOCTTR   ST    @14,12(,@13)                                        0885
         ST    @13,@SA00015+4                                      0885
         LA    @14,@SA00015                                        0885
         LR    @13,@14                                             0885
*   WKOPTNS=LOCTTROP;               /* INDICATE LOCATE BY TTR        */
         MVC   WKOPTNS(4),LOCTTROP                                 0886
*   WKPTR1=ADDR(WKDSCBT);           /* POINT TO TTR AREA             */
         LA    @15,WKDSCBT                                         0887
         ST    @15,WKPTR1                                          0887
*   WKCVOLP=ZEROPTR;                /* ZERO CVOL POINTER             */
         L     @15,ZEROPTR                                         0888
         ST    @15,WKCVOLP                                         0888
*   WKPTR3=ADDR(WKVOLST);           /* POINT TO WORKAREA             */
         LA    @15,WKVOLST                                         0889
         ST    @15,WKPTR3                                          0889
*   WKDSCBT=WKNXTTTR;               /* MOVE TTR TO WORKAREA          */
         MVC   WKDSCBT(3),WKNXTTTR                                 0890
*   RFY                                                            0891
*     R1 RSTD;                                                     0891
*   R1=ADDR(WKCAMLST);              /* POINT TO PARM LIST            */
         LA    R1,WKCAMLST                                         0892
*   GEN(ST    R13,XSAVAREA+4  POINT TO PREVIOUS SAVEAREA);         0893
         ST    R13,XSAVAREA+4  POINT TO PREVIOUS SAVEAREA
*   GEN(LA    R13,XSAVAREA    R13=NEW SAVEAREA ADDRESS);           0894
         LA    R13,XSAVAREA    R13=NEW SAVEAREA ADDRESS
*   CALL IGG0CLCC;                  /* GO LOCATE BY TTR              */
         L     @15,@CV00058                                        0895
         BALR  @14,@15                                             0895
*   GEN(L     R13,XSAVAREA+4  RESET R13 TO PREVIOUS SAVEAREA);     0896
         L     R13,XSAVAREA+4  RESET R13 TO PREVIOUS SAVEAREA
*   RFY                                                            0897
*    (R0,                                                          0897
*     R15) RSTD;                                                   0897
*   GEN(STM   R15,R0,OSRC15 SAVE RETURN CODES);                    0898
         STM   R15,R0,OSRC15 SAVE RETURN CODES
*   RFY                                                            0899
*    (R0,                                                          0899
*     R1,                                                          0899
*     R15) UNRSTD;                                                 0899
*   INCORESW=OFF;                   /* INDICATE BLOCK LOCATED BY   0900
*                                      LOCATE-BY-TTR                 */
         MVC   INCORESW(1),OFF                                     0900
*   END LOCTTR;                                                    0901
@EL00015 L     @13,4(,@13)                                         0901
@EF00015 DS    0H                                                  0901
@ER00015 L     @14,12(,@13)                                        0901
         BR    @14                                                 0901
*                                                                  0902
*   /*****************************************************************/
*   /*                                                               */
*   /* SLVOLST IS CALLED FROM SUPERLOCATE PROCESSORS TO FILL THE     */
*   /* USER'S VOLUME LIST AREA WITH VOL-SERS, DEVICE TYPES AND FILE  */
*   /* SEQUENCE NUMBERS.                                             */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0902
*SLVOLST:                                                          0902
*   PROC OPTIONS(SAVEAREA(16),SAVE(14));                           0902
SLVOLST  ST    @14,12(,@13)                                        0902
         ST    @13,@SA00016+4                                      0902
         LA    @14,@SA00016                                        0902
         LR    @13,@14                                             0902
*   CALL GETUSERK;                  /* GET INTO USER'S KEY           */
         BAL   @14,GETUSERK                                        0903
*   CTGWAUCT=0;                     /* MINIMUM UNIT COUNT = 0        */
         L     @01,CTGPLPTR                                        0904
         L     @01,CTGWKA(,@01)                                    0904
         SLR   @00,@00                                             0904
         STH   @00,CTGWAUCT(,@01)                                  0904
*   CALL GETSVCK;                   /* GET INTO SVC KEY              */
         BAL   @14,GETSVCK                                         0905
*   IF WKVOLNUM=0 THEN                                             0906
*                                                                  0906
         LH    @15,WKVOLNUM                                        0906
         LTR   @15,@15                                             0906
         BNZ   @RF00906                                            0906
*     /***************************************************************/
*     /*                                                             */
*     /* NUMBER OF VOLUMES CATALOGED IS ZERO,SPECIAL HANDLE          */
*     /*                                                             */
*     /***************************************************************/
*                                                                  0907
*     DO;                                                          0907
*       CALL GETUSERK;              /* GET INTO USER'S KEY           */
         BAL   @14,GETUSERK                                        0908
*       CTGWAVCT=0;                 /* SET NUMBER OF VOLUMES TO 0    */
         L     @01,CTGPLPTR                                        0909
         L     @01,CTGWKA(,@01)                                    0909
         SLR   @00,@00                                             0909
         STH   @00,CTGWAVCT(,@01)                                  0909
*       CALL GETSVCK;               /* GET INTO SVC KEY              */
         BAL   @14,GETSVCK                                         0910
*     END;                                                         0911
*   ELSE                                                           0912
*                                                                  0912
*     /***************************************************************/
*     /*                                                             */
*     /* NUMBER OF VOLUMES CATALOGED IS NOT ZERO                     */
*     /*                                                             */
*     /***************************************************************/
*                                                                  0912
*     DO;                                                          0912
         B     @RC00906                                            0912
@RF00906 DS    0H                                                  0913
*       IF WKVOLNUM=1 THEN                                         0913
         CLC   WKVOLNUM(2),@CH00064                                0913
         BNE   @RF00913                                            0913
*         IF CTGWALV<15 THEN                                       0914
         L     @01,CTGPLPTR                                        0914
         L     @01,CTGWKA(,@01)                                    0914
         LH    @15,CTGWALV(,@01)                                   0914
         C     @15,@CF00188                                        0914
         BNL   @RF00914                                            0914
*           DO;                     /* VOLIST AREA TOO SMALL TO HOLD
*                                      1 ENTRY                       */
*             CALL GETUSERK;        /* GET INTO USER'S KEY           */
         BAL   @14,GETUSERK                                        0916
*             CTGFDBK=15;           /* SET NEEDED SIZE TO 15         */
         L     @15,CTGPLPTR                                        0917
         MVC   CTGFDBK(2,@15),@CH00188                             0917
*             CTGWAVCT=0;           /* SET NUMBER OF VOLUMES=0       */
         L     @01,CTGWKA(,@15)                                    0918
         SLR   @00,@00                                             0918
         STH   @00,CTGWAVCT(,@01)                                  0918
*             CALL GETSVCK;         /* GET INTO SVC KEY              */
         BAL   @14,GETSVCK                                         0919
*             VSRC15=VS40;          /* SET TOOSMALL INDICATOR        */
         L     @15,VS40                                            0920
         ST    @15,VSRC15                                          0920
*           END;                                                   0921
*         ELSE                                                     0922
*           DO;                     /* WORK AREA OK TO HOLD 1 ENTRY  */
         B     @RC00914                                            0922
@RF00914 DS    0H                                                  0923
*             CALL GETUSERK;        /* GET INTO USER'S KEY           */
         BAL   @14,GETUSERK                                        0923
*             CTGWAVCT=1;           /* SET NUMBER OF VOLUMES=1       */
         L     @01,CTGPLPTR                                        0924
         L     @15,CTGWKA(,@01)                                    0924
         MVC   CTGWAVCT(2,@15),@CH00064                            0924
*             RFY                                                  0925
*               K RSTD;                                            0925
*             K=ADDR(WKVOLST)+2;    /* GET ADDRESS OF ENTRY          */
         LA    K,WKVOLST                                           0926
         AL    K,@CF00105                                          0926
*             CTGVLVOL(1)=K->SVOLSER;/* MOVE VOLSER                  */
         L     @09,CTGWAVL(,@15)                                   0927
         MVC   CTGVLVOL(6,@09),SVOLSER(K)                          0927
*             CTGVLDEV(1)=K->SDEVTYPE;/* MOVE DEV.TYPE               */
         MVC   CTGVLDEV(4,@09),SDEVTYPE(K)                         0928
*             CTGVLSEQ(1)=K->SFSEQNO;/* MOVE FILE S.N.               */
         LH    @15,SFSEQNO(,K)                                     0929
         STH   @15,CTGVLSEQ(,@09)                                  0929
*             CTGVLTTR=WKNXTTTR;    /* MOVE DSCB TTR                 */
         MVC   CTGVLTTR(3,@09),WKNXTTTR                            0930
*             RFY                                                  0931
*               K UNRSTD;                                          0931
*             CALL GETSVCK;         /* GET INTO SVC KEY              */
         BAL   @14,GETSVCK                                         0932
*           END;                                                   0933
*       ELSE                                                       0934
*         IF(WKVOLNUM*12)>CTGWALV THEN                             0934
         B     @RC00913                                            0934
@RF00913 LH    @15,WKVOLNUM                                        0934
         MH    @15,@CH00127                                        0934
         L     @01,CTGPLPTR                                        0934
         L     @01,CTGWKA(,@01)                                    0934
         CH    @15,CTGWALV(,@01)                                   0934
         BNH   @RF00934                                            0934
*           DO;                     /* VOLIST TOO SMALL TO HOLD ALL
*                                      ENTRIES                       */
*             CALL GETUSERK;        /* GET INTO USER'S KEY           */
         BAL   @14,GETUSERK                                        0936
*             CTGFDBK=WKVOLNUM*12;  /* SET REQUIRED SIZE             */
         L     @15,CTGPLPTR                                        0937
         LH    @14,WKVOLNUM                                        0937
         MH    @14,@CH00127                                        0937
         STH   @14,CTGFDBK(,@15)                                   0937
*             CTGWAVCT=0;           /* SET NUMBER OF VOLUMES TO 0    */
         L     @01,CTGWKA(,@15)                                    0938
         SLR   @00,@00                                             0938
         STH   @00,CTGWAVCT(,@01)                                  0938
*             CALL GETSVCK;         /* GET INTO SVC KEY              */
         BAL   @14,GETSVCK                                         0939
*             VSRC15=VS40;          /* SET TOO SMALL INDICATOR       */
         L     @15,VS40                                            0940
         ST    @15,VSRC15                                          0940
*           END;                                                   0941
*         ELSE                                                     0942
*           DO;                     /* VOLIST BIG ENOUGH FOR ALL   0942
*                                      ENTRIES                       */
         B     @RC00934                                            0942
@RF00934 DS    0H                                                  0943
*             RFY                                                  0943
*              (I,                                                 0943
*               J,                                                 0943
*               K) RSTD;                                           0943
*             CALL GETUSERK;        /* GET INTO USER'S KEY           */
         BAL   @14,GETUSERK                                        0944
*             CTGWAVCT=WKVOLNUM;    /* SET VOLUME COUNT              */
         L     @09,CTGPLPTR                                        0945
         L     @09,CTGWKA(,@09)                                    0945
         LH    @15,WKVOLNUM                                        0945
         STH   @15,CTGWAVCT(,@09)                                  0945
*             CALL GETSVCK;         /* GET INTO SVC KEY              */
         BAL   @14,GETSVCK                                         0946
*             SAVEI=CTGWAVL;        /* GET ADDRESS OF VOLUMELIST     */
         L     @09,CTGPLPTR                                        0947
         L     @09,CTGWKA(,@09)                                    0947
         L     @09,CTGWAVL(,@09)                                   0947
         ST    @09,SAVEI                                           0947
*             DO WHILE(WKNXTTTR^='FFFFFF'X);                       0948
         B     @DE00948                                            0948
@DL00948 DS    0H                                                  0949
*               IF WKVOLNUM<20 THEN                                0949
         LH    @09,WKVOLNUM                                        0949
         C     @09,@CF02082                                        0949
         BNL   @RF00949                                            0949
*                 LIMIT=WKVOLNUM;                                  0950
         ST    @09,LIMIT                                           0950
*               ELSE                                               0951
*                 LIMIT=20;                                        0951
         B     @RC00949                                            0951
@RF00949 MVC   LIMIT(4),@CF02082                                   0951
*               CALL GETUSERK;      /* GET INTO USER'S KEY           */
@RC00949 BAL   @14,GETUSERK                                        0952
*               I=SAVEI;            /* INIT I FOR DO LOOP            */
         L     I,SAVEI                                             0953
*               K=ADDR(WKVOLST)+2;  /* SET START ADDRESS             */
         LA    K,WKVOLST                                           0954
         AL    K,@CF00105                                          0954
*               DO J=1 TO LIMIT;                                   0955
         LA    J,1                                                 0955
         B     @DE00955                                            0955
@DL00955 DS    0H                                                  0956
*                 I->MVLVOL=K->SVOLSER;/* MOVE VOLSER                */
         MVC   MVLVOL(6,I),SVOLSER(K)                              0956
*                 I->MVLDEV=K->SDEVTYPE;/* MOVE DEV.TP               */
         MVC   MVLDEV(4,I),SDEVTYPE(K)                             0957
*                 I->MVLSEQ=K->SFSEQNO;/* MOVE FILE SN               */
         LH    @09,SFSEQNO(,K)                                     0958
         STH   @09,MVLSEQ(,I)                                      0958
*                 I=I+12;           /* BUMP POINTER                  */
         LA    @09,12                                              0959
         ALR   I,@09                                               0959
*                 K=K+12;           /* BUMP POINTER                  */
         ALR   K,@09                                               0960
*               END;                                               0961
         AL    J,@CF00064                                          0961
@DE00955 C     J,LIMIT                                             0961
         BNH   @DL00955                                            0961
*               CALL GETSVCK;       /* GET INTO SVC KEY              */
         BAL   @14,GETSVCK                                         0962
*               SAVEI=SAVEI+240;    /* INCREMENT SAVEI               */
         LA    @09,240                                             0963
         AL    @09,SAVEI                                           0963
         ST    @09,SAVEI                                           0963
*               IF WKNXTTTR=HEX3ZERO THEN                          0964
         CLC   WKNXTTTR(3),HEX3ZERO                                0964
         BNE   @RF00964                                            0964
*                 WKNXTTTR='FFFFFF'X;/* LAST BLOCK SET DO STOP       */
         MVC   WKNXTTTR(3),@CB03026                                0965
*               ELSE                                               0966
*                 DO;               /* SET UP AND LOCATE NEXT BLOCK  */
         B     @RC00964                                            0966
@RF00964 DS    0H                                                  0967
*                   CALL LOCTTR;    /* LOCATE NEXT BLOCK             */
         BAL   @14,LOCTTR                                          0967
*                   IF OSRC15^=0 THEN                              0968
         L     @09,OSRC15                                          0968
         LTR   @09,@09                                             0968
         BZ    @RF00968                                            0968
*                     DO;                                          0969
*                       VSRC15=VS24;/* SET IO ERROR                  */
         L     @09,VS24                                            0970
         ST    @09,VSRC15                                          0970
*                       WKNXTTTR='FFFFFF'X;/* STOPLOOP               */
         MVC   WKNXTTTR(3),@CB03026                                0971
*                     END;                                         0972
*                   ELSE                                           0973
*                     ;             /* BLOCK FOUND CONTINUE          */
@RF00968 DS    0H                                                  0974
*                 END;                                             0974
*             END;                                                 0975
@RC00964 DS    0H                                                  0975
@DE00948 CLC   WKNXTTTR(3),@CB03026                                0975
         BNE   @DL00948                                            0975
*             RFY                                                  0976
*              (I,                                                 0976
*               J,                                                 0976
*               K) UNRSTD;                                         0976
*           END;                                                   0977
*     END;                                                         0978
*   END SLVOLST;                                                   0979
@EL00016 L     @13,4(,@13)                                         0979
@EF00016 DS    0H                                                  0979
@ER00016 L     @14,12(,@13)                                        0979
         BR    @14                                                 0979
*                                                                  0980
*   /*****************************************************************/
*   /*                                                               */
*   /* VLOC IS CALLED TO PROCESS A VSAM LOCATE OR AMS LISTCAT        */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0980
*VLOC:                                                             0980
*   PROC OPTIONS(SAVEAREA(16),SAVE(14));                           0980
VLOC     ST    @14,12(,@13)                                        0980
         ST    @13,@SA00017+4                                      0980
         LA    @14,@SA00017                                        0980
         LR    @13,@14                                             0980
*   WKDSN=CPLDSN;                   /* SAVE DATASET NAME             */
         L     @15,CTGPLPTR                                        0981
         L     @01,CTGENT(,@15)                                    0981
         MVC   WKDSN(44),CPLDSN(@01)                               0981
*   IF WALEN2=0 THEN                                               0982
         L     @01,CTGWKA(,@15)                                    0982
         LH    @15,WALEN2(,@01)                                    0982
         N     @15,@CF03065                                        0982
         LTR   @15,@15                                             0982
         BNZ   @RF00982                                            0982
*     DO;                           /* SET DEFAULT LENGTH FOR WORK 0983
*                                      AREA                          */
*       CALL GETUSERK;              /* GET INTO USER'S KEY           */
         BAL   @14,GETUSERK                                        0984
*       WALEN2=4;                   /* SET DEFAULT LENGTH            */
         L     @01,CTGPLPTR                                        0985
         L     @01,CTGWKA(,@01)                                    0985
         MVC   WALEN2(2,@01),@CH00180                              0985
*       CALL GETSVCK;               /* GET INTO SVC KEY              */
         BAL   @14,GETSVCK                                         0986
*     END;                                                         0987
*   ELSE                                                           0988
*     ;                                                            0988
@RF00982 DS    0H                                                  0989
*   CALL LOCNAME;                   /* LOCATE BY NAME                */
         BAL   @14,LOCNAME                                         0989
*   IF CTGFUNC='100'B&CTGCNAME='1'B&CPLCATNM(1:1)=' ' THEN/* @OZ32592*/
         L     @15,CTGPLPTR                                        0990
         TM    CTGFUNC(@15),B'10000000'                            0990
         BNO   @RF00990                                            0990
         TM    CTGFUNC(@15),B'01100000'                            0990
         BNZ   @RF00990                                            0990
         TM    CTGCNAME(@15),B'00000010'                           0990
         BNO   @RF00990                                            0990
         L     @01,CTGCAT(,@15)                                    0990
         CLI   CPLCATNM(@01),C' '                                  0990
         BNE   @RF00990                                            0990
*     DO;                           /* AMS LISTCAT SPECIFIED SO    0991
*                                      RETURN CATALOG NAME           */
*       CALL GETUSERK;              /* GET INTO USERS KEY    @OZ32592*/
         BAL   @14,GETUSERK                                        0992
*       CPLCATNM=WKCATNM;           /* CAT. NAME TO USER     @OZ32592*/
         L     @01,CTGPLPTR                                        0993
         L     @01,CTGCAT(,@01)                                    0993
         MVC   CPLCATNM(44,@01),WKCATNM                            0993
*       CALL GETSVCK;               /* GET INTO SVC KEY      @OZ32592*/
         BAL   @14,GETSVCK                                         0994
*     END;                                                         0995
*   ELSE                                                           0996
*     ;                                                            0996
@RF00990 DS    0H                                                  0997
*   RFY                                                            0997
*     I RSTD;                                                      0997
*   IF OSRC15^=0 THEN                                              0998
         L     @07,OSRC15                                          0998
         LTR   @07,@07                                             0998
         BZ    @RF00998                                            0998
*     DO;                           /* BAD LOCATE. SET RETURN CODES  */
*       IF OSRC15=OS24 THEN                                        1000
         C     @07,OS24                                            1000
         BNE   @RF01000                                            1000
*         VSRC15=VS24;              /* SET LOCATE IO ERROR           */
         L     @07,VS24                                            1001
         ST    @07,VSRC15                                          1001
*       ELSE                                                       1002
*         VSRC15=VS8;               /* SET DATASET NOT FOUND         */
         B     @RC01000                                            1002
@RF01000 L     @07,VS8                                             1002
         ST    @07,VSRC15                                          1002
*     END;                                                         1003
*   ELSE                                                           1004
*     DO I=1 TO CTGNOFLD;           /* PROCESS FPLS                  */
         B     @RC00998                                            1004
@RF00998 LA    I,1                                                 1004
         B     @DE01004                                            1004
@DL01004 DS    0H                                                  1005
*       SAVEI=I;                    /* SAVE INDEX VALUE              */
         ST    I,SAVEI                                             1005
*       CTGFLPTR=CTGFIELD(I);       /* SET FPL ADDRESS               */
         LR    @07,I                                               1006
         SLA   @07,2                                               1006
         L     @01,CTGPLPTR                                        1006
         L     @07,CTGFIELD-4(@07,@01)                             1006
         ST    @07,CTGFLPTR                                        1006
*       CALL GETUSERK;              /* GET INTO USER'S KEY           */
         BAL   @14,GETUSERK                                        1007
*       CTGFLNG(1)=ZEROPTR;         /* INIT FIELD LENGTH             */
         L     @07,ZEROPTR                                         1008
         L     @15,CTGFLPTR                                        1008
         ST    @07,CTGFLNG(,@15)                                   1008
*       CTGFLPT(1)=ZEROPTR;         /* INIT FIELD POINTER            */
         ST    @07,CTGFLPT(,@15)                                   1009
*       CALL GETSVCK;               /* GET INTO SVC KEY              */
         BAL   @14,GETSVCK                                         1010
*       IF CTGFLCHN=0 THEN                                         1011
         L     @07,CTGFLPTR                                        1011
         L     @07,CTGFLCHN(,@07)                                  1011
         LTR   @07,@07                                             1011
         BNZ   @RF01011                                            1011
*         DO;                       /* FPL IS NOT CHAINED SO PROCESS */
*           IF INCORESW=OFF THEN                                   1013
         CLC   INCORESW(1),OFF                                     1013
         BNE   @RF01013                                            1013
*             DO;                   /* LOCATE BY NAME NEEDED         */
*               CALL LOCNAME;       /* LOCATE BY NAME                */
         BAL   @14,LOCNAME                                         1015
*               IF OSRC15^=0 THEN                                  1016
         L     @07,OSRC15                                          1016
         LTR   @07,@07                                             1016
         BZ    @RF01016                                            1016
*                 DO;               /* PROCESS BAD LOCATE            */
*                   IF OSRC15=OS24 THEN                            1018
         C     @07,OS24                                            1018
         BNE   @RF01018                                            1018
*                     VSRC15=VS24;                                 1019
         L     @07,VS24                                            1019
         ST    @07,VSRC15                                          1019
*                   ELSE                                           1020
*                     VSRC15=VS8;                                  1020
         B     @RC01018                                            1020
@RF01018 L     @07,VS8                                             1020
         ST    @07,VSRC15                                          1020
*                 END;                                             1021
*               ELSE                                               1022
*                 ;                                                1022
@RF01016 DS    0H                                                  1023
*             END;                                                 1023
*           ELSE                                                   1024
*             ;                                                    1024
@RF01013 DS    0H                                                  1025
*           IF VSRC15=VS24 THEN                                    1025
@RC01013 CLC   VSRC15(4),VS24                                      1025
         BNE   @RF01025                                            1025
*             SAVEI=CTGNOFLD;       /* IO ERROR SO STOP LOOP         */
         L     @07,CTGPLPTR                                        1026
         SLR   @15,@15                                             1026
         IC    @15,CTGNOFLD(,@07)                                  1026
         ST    @15,SAVEI                                           1026
*           ELSE                                                   1027
*             DO;                   /* ALL OK SO PROCESS FPL         */
         B     @RC01025                                            1027
@RF01025 DS    0H                                                  1028
*               HOLDFPLN=FPLNAME;   /* SAVE FPL NAME                 */
         L     @07,CTGFLPTR                                        1028
         L     @07,CTGFLDNM(,@07)                                  1028
         MVC   HOLDFPLN(8),FPLNAME(@07)                            1028
*               RFY                                                1029
*                 R3 RSTD;                                         1029
*               GEN;                                               1030
         LA    R3,FPLTABLE GET ADDRESS OF FPL LOOKUP TABLE
VLOC0001 CLC   0(8,R3),ENDTABLE IS THIS THE END OF THE TABLE
         BE    VLOC0010         YES,EXIT
         CLC   0(8,R3),HOLDFPLN IS THIS A SUPPORTED FPL
         BE    VLOC0010         YES,EXIT
         LA    R3,12(R3)        BUMP TABLE POINTER
         B     VLOC0001
VLOC0010 MVC   ENTCOUNT(4),8(R3) SAVE ENTRY BYTE COUNT
VLOC0020 MVC   HOLDFPLN(8),0(R3) SAVE FPLNAME
*               RFY                                                1031
*                 R3 UNRSTD;                                       1031
*               SAVER4=CTGWKA+WALEN2;/* SAVE DATA PTR                */
         L     @07,CTGPLPTR                                        1032
         L     @07,CTGWKA(,@07)                                    1032
         LH    @15,WALEN2(,@07)                                    1032
         N     @15,@CF03065                                        1032
         ALR   @15,@07                                             1032
         ST    @15,SAVER4                                          1032
*               IF HOLDFPLN=ENDTABLE THEN                          1033
         CLC   HOLDFPLN(8),ENDTABLE                                1033
         BE    @RT01033                                            1033
*                 ;                 /* FPLNAME NOT FOUND,SKIP IT     */
*               ELSE                                               1035
*                 DO;                                              1035
*                   CALL GETUSERK;  /* GET INTO USERKEY              */
         BAL   @14,GETUSERK                                        1036
*                   IF HOLDFPLN='DEVTYP  '×HOLDFPLN='VOLSER  '×HOLDFPLN
*                       ='FILESEQ '×HOLDFPLN='CATVOL  '            1037
*                                                                  1037
*                   /*************************************************/
*                   /*                                               */
*                   /* CALCULATE REPEATING FIELD FPL DATA LENGTH     */
*                   /*                                               */
*                   /*************************************************/
*                                                                  1037
*                     THEN                                         1037
         CLC   HOLDFPLN(8),@CC02864                                1037
         BE    @RT01037                                            1037
         CLC   HOLDFPLN(8),@CC02867                                1037
         BE    @RT01037                                            1037
         CLC   HOLDFPLN(8),@CC02870                                1037
         BE    @RT01037                                            1037
         CLC   HOLDFPLN(8),@CC02876                                1037
         BNE   @RF01037                                            1037
@RT01037 DS    0H                                                  1038
*                     WALEN2=WALEN2+(WKVOLNUM*ENTCOUNT);           1038
*                                                                  1038
         L     @07,CTGPLPTR                                        1038
         L     @07,CTGWKA(,@07)                                    1038
         L     @15,ENTCOUNT                                        1038
         MH    @15,WKVOLNUM                                        1038
         LH    @14,WALEN2(,@07)                                    1038
         N     @14,@CF03065                                        1038
         ALR   @15,@14                                             1038
         STH   @15,WALEN2(,@07)                                    1038
*                   /*************************************************/
*                   /*                                               */
*                   /* CALCULATE SINGLE ENTRY FPL DATA LENGTH        */
*                   /*                                               */
*                   /*************************************************/
*                                                                  1039
*                   ELSE                                           1039
*                     WALEN2=WALEN2+ENTCOUNT;                      1039
         B     @RC01037                                            1039
@RF01037 L     @07,CTGPLPTR                                        1039
         L     @07,CTGWKA(,@07)                                    1039
         LH    @15,WALEN2(,@07)                                    1039
         N     @15,@CF03065                                        1039
         AL    @15,ENTCOUNT                                        1039
         STH   @15,WALEN2(,@07)                                    1039
*                   CALL GETSVCK;   /* GET INTO SVC KEY              */
@RC01037 BAL   @14,GETSVCK                                         1040
*                   IF WALEN2<=WALEN1 THEN                         1041
         L     @07,CTGPLPTR                                        1041
         L     @07,CTGWKA(,@07)                                    1041
         CLC   WALEN2(2,@07),WALEN1(@07)                           1041
         BH    @RF01041                                            1041
*                     DO;           /* WORKAREA SIZE OK              */
*                       CALL GETUSERK;/* GET USERKEY SET DATA ADDR 1043
*                                      AND PTR                       */
         BAL   @14,GETUSERK                                        1043
*                       CTGFLNG(1)=(CTGWKA+WALEN2)-SAVER4;         1044
         L     @07,CTGFLPTR                                        1044
         L     @15,SAVER4                                          1044
         L     @01,CTGPLPTR                                        1044
         L     @14,CTGWKA(,@01)                                    1044
         LH    @09,WALEN2(,@14)                                    1044
         N     @09,@CF03065                                        1044
         ALR   @09,@14                                             1044
         SLR   @09,@15                                             1044
         ST    @09,CTGFLNG(,@07)                                   1044
*                       CTGFLPT(1)=SAVER4;                         1045
         ST    @15,CTGFLPT(,@07)                                   1045
*                       CALL GETSVCK;/* GET SVC KEY                  */
         BAL   @14,GETSVCK                                         1046
*                       IF HOLDFPLN='DEVTYP  '×HOLDFPLN='VOLSER  '×
*                           HOLDFPLN='FILESEQ '×HOLDFPLN='CATVOL  '
*                         THEN                                     1047
         CLC   HOLDFPLN(8),@CC02864                                1047
         BE    @RT01047                                            1047
         CLC   HOLDFPLN(8),@CC02867                                1047
         BE    @RT01047                                            1047
         CLC   HOLDFPLN(8),@CC02870                                1047
         BE    @RT01047                                            1047
         CLC   HOLDFPLN(8),@CC02876                                1047
         BNE   @RF01047                                            1047
@RT01047 DS    0H                                                  1048
*                         CALL FPLMV;                              1048
         BAL   @14,FPLMV                                           1048
*                       ELSE                                       1049
*                         IF HOLDFPLN='ENTYPE  ' THEN              1049
         B     @RC01047                                            1049
@RF01047 CLC   HOLDFPLN(8),@CC02858                                1049
         BNE   @RF01049                                            1049
*                           CALL ENTYPE;                           1050
         BAL   @14,ENTYPE                                          1050
*                         ELSE                                     1051
*                           IF HOLDFPLN='ENTNAME ' THEN            1051
         B     @RC01049                                            1051
@RF01049 CLC   HOLDFPLN(8),@CC02861                                1051
         BNE   @RF01051                                            1051
*                             CALL ENTNAME;                        1052
         BAL   @14,ENTNAME                                         1052
*                           ELSE                                   1053
*                             IF HOLDFPLN='DSCBTTR ' THEN          1053
         B     @RC01051                                            1053
@RF01051 CLC   HOLDFPLN(8),@CC02873                                1053
         BNE   @RF01053                                            1053
*                               CALL DSCBTTR;                      1054
         BAL   @14,DSCBTTR                                         1054
*                             ELSE                                 1055
*                               IF HOLDFPLN='DSTYPNAM' THEN        1055
         B     @RC01053                                            1055
@RF01053 CLC   HOLDFPLN(8),@CC02879                                1055
         BNE   @RF01055                                            1055
*                                 CALL DSTYPNAM;/*           @VS32767*/
         BAL   @14,DSTYPNAM                                        1056
*                               ELSE                               1057
*                                 IF HOLDFPLN='RELCRA  '/*   @VS34653*/
*                                   THEN                           1057
         B     @RC01055                                            1057
@RF01055 CLC   HOLDFPLN(8),@CC02891                                1057
         BNE   @RF01057                                            1057
*                                   CALL RELCRA;/*           @VS34653*/
         BAL   @14,RELCRA                                          1058
*                                 ELSE                             1059
*                                   CALL NSUPPORT;/*         @VS32767*/
         B     @RC01057                                            1059
@RF01057 BAL   @14,NSUPPORT                                        1059
*                     END;                                         1060
*                   ELSE                                           1061
*                     VSRC15=VS40;  /* AREA SMALL                    */
         B     @RC01041                                            1061
@RF01041 L     @07,VS40                                            1061
         ST    @07,VSRC15                                          1061
*                 END;                                             1062
*             END;                                                 1063
*         END;                                                     1064
*       ELSE                                                       1065
*         ;                         /* CHAINED FPLS NOT SUPPORTED SO
*                                      SKIP FPL                      */
@RF01011 DS    0H                                                  1066
*       I=SAVEI;                    /* RESET INDEX                   */
@RC01011 L     I,SAVEI                                             1066
*     END;                                                         1067
         AL    I,@CF00064                                          1067
@DE01004 L     @07,CTGPLPTR                                        1067
         SLR   @15,@15                                             1067
         IC    @15,CTGNOFLD(,@07)                                  1067
         CR    I,@15                                               1067
         BNH   @DL01004                                            1067
*   RFY                                                            1068
*     I UNRSTD;                                                    1068
*   END VLOC;                                                      1069
@EL00017 L     @13,4(,@13)                                         1069
@EF00017 DS    0H                                                  1069
@ER00017 L     @14,12(,@13)                                        1069
         BR    @14                                                 1069
*                                                                  1070
*   /*****************************************************************/
*   /*                                                               */
*   /* ENTYPE IS CALLED TO PROCESS AN 'ENTYPE' FPL                   */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1070
*ENTYPE:                                                           1070
*   PROC OPTIONS(SAVEAREA(16),SAVE(14));                           1070
ENTYPE   ST    @14,12(,@13)                                        1070
         ST    @13,@SA00018+4                                      1070
         LA    @14,@SA00018                                        1070
         LR    @13,@14                                             1070
*   CALL GETUSERK;                  /* GET INTO USER'S KEY           */
         BAL   @14,GETUSERK                                        1071
*   RFY                                                            1072
*     R4 RSTD;                                                     1072
*   R4=SAVER4;                      /* GET ADDRESS FOR ENTRY         */
         L     R4,SAVER4                                           1073
*   GEN(MVI   0(R4),C'A');          /* SET ENTRY TYPE-NON VSAM       */
         MVI   0(R4),C'A'
*   RFY                                                            1075
*     R4 UNRSTD;                                                   1075
*   CALL GETSVCK;                   /* GET INTO SVC KEY              */
         BAL   @14,GETSVCK                                         1076
*   END ENTYPE;                                                    1077
@EL00018 L     @13,4(,@13)                                         1077
@EF00018 DS    0H                                                  1077
@ER00018 L     @14,12(,@13)                                        1077
         BR    @14                                                 1077
*                                                                  1078
*   /*****************************************************************/
*   /*                                                               */
*   /* ENTNAME IS CALLED TO PROCESS AN 'ENTNAME' FPL                 */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1078
*ENTNAME:                                                          1078
*   PROC OPTIONS(SAVEAREA(16),SAVE(14));                           1078
ENTNAME  ST    @14,12(,@13)                                        1078
         ST    @13,@SA00019+4                                      1078
         LA    @14,@SA00019                                        1078
         LR    @13,@14                                             1078
*   CALL GETUSERK;                  /* GET INTO USER'S KEY           */
         BAL   @14,GETUSERK                                        1079
*   RFY                                                            1080
*     R4 RSTD;                                                     1080
*   R4=SAVER4;                      /* GET ADDRESS FOR ENTRY         */
         L     R4,SAVER4                                           1081
*   IF CTGFUNC='100'B THEN                                         1082
         L     @05,CTGPLPTR                                        1082
         TM    CTGFUNC(@05),B'10000000'                            1082
         BNO   @RF01082                                            1082
         TM    CTGFUNC(@05),B'01100000'                            1082
         BNZ   @RF01082                                            1082
*     DO;                           /* LISTCAT REQUEST SO RETURN   1083
*                                      ORIGINAL DSNAME               */
*       GEN(MVC   0(44,R4),WKDSN);  /* RETURN DSNAME                 */
         MVC   0(44,R4),WKDSN
*     END;                                                         1085
*   ELSE                                                           1086
*     DO;                           /* VSAM LOCATE SO RETURN LOCATED
*                                      NAME                          */
         B     @RC01082                                            1086
@RF01082 DS    0H                                                  1087
*       GEN(MVC   0(44,R4),LOCDSN); /* RETURN DSNAME                 */
         MVC   0(44,R4),LOCDSN
*     END;                                                         1088
*   RFY                                                            1089
*     R4 UNRSTD;                                                   1089
@RC01082 DS    0H                                                  1090
*   CALL GETSVCK;                   /* GET INTO SVC KEY              */
         BAL   @14,GETSVCK                                         1090
*   END ENTNAME;                                                   1091
@EL00019 L     @13,4(,@13)                                         1091
@EF00019 DS    0H                                                  1091
@ER00019 L     @14,12(,@13)                                        1091
         BR    @14                                                 1091
*                                                                  1092
*   /*****************************************************************/
*   /*                                                               */
*   /* DSCBTTR IS CALLED TO PROCESS A 'DSCBTTR' FPL                  */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1092
*DSCBTTR:                                                          1092
*   PROC OPTIONS(SAVEAREA(16),SAVE(14));                           1092
DSCBTTR  ST    @14,12(,@13)                                        1092
         ST    @13,@SA00020+4                                      1092
         LA    @14,@SA00020                                        1092
         LR    @13,@14                                             1092
*   CALL GETUSERK;                  /* GET INTO USER'S KEY           */
         BAL   @14,GETUSERK                                        1093
*   RFY                                                            1094
*    (R4,                                                          1094
*     K) RSTD;                                                     1094
*   R4=SAVER4;                      /* GET START ADDRESS             */
         L     R4,SAVER4                                           1095
*   IF WKVOLNUM=1 THEN                                             1096
         CLC   WKVOLNUM(2),@CH00064                                1096
         BNE   @RF01096                                            1096
*     DO;                           /* NUMBER OF VOLUMES IS 1 AND HAS
*                                      A DSCBTTR                     */
*       GEN(MVC   0(3,R4),WKNXTTTR);/* MOVE DSCBTTR                  */
         MVC   0(3,R4),WKNXTTTR
*     END;                                                         1099
*   ELSE                                                           1100
*     DO;                           /* NOT 1 VOLUME SO DSCBTTR NON 1100
*                                      EXISTANT                      */
         B     @RC01096                                            1100
@RF01096 DS    0H                                                  1101
*       GEN(MVC   0(3,R4),HEX3ZERO);/* SET DSCBTTR TO 0              */
         MVC   0(3,R4),HEX3ZERO
*     END;                                                         1102
*   R4=R4+3;                        /* BUMP POINTER                  */
@RC01096 AL    R4,@CF00091                                         1103
*   DO K=(WKVOLNUM-1) TO 1 BY-1;    /* SET REST OF TTRS TO ZEROS     */
         LH    K,WKVOLNUM                                          1104
         BCTR  K,0                                                 1104
         B     @DE01104                                            1104
@DL01104 DS    0H                                                  1105
*     GEN(MVC   0(3,R4),HEX3ZERO);  /* MOVE ZEROS TO TTR             */
         MVC   0(3,R4),HEX3ZERO
*     GEN(LA    R4,3(R4));          /* BUMP POINTER                  */
         LA    R4,3(R4)
*   END;                                                           1107
         BCTR  K,0                                                 1107
@DE01104 LTR   K,K                                                 1107
         BP    @DL01104                                            1107
*   RFY                                                            1108
*    (R4,                                                          1108
*     K) UNRSTD;                                                   1108
*   CALL GETSVCK;                   /* GET INTO SVC KEY              */
         BAL   @14,GETSVCK                                         1109
*   END DSCBTTR;                                                   1110
@EL00020 L     @13,4(,@13)                                         1110
@EF00020 DS    0H                                                  1110
@ER00020 L     @14,12(,@13)                                        1110
         BR    @14                                                 1110
*                                                                  1111
*   /*****************************************************************/
*   /*                                                               */
*   /* FPLMV IS CALLED TO PROCESS THE FOLLOWING REPEATING FIELD      */
*   /* FPL'S. DEVTYP, VOLSER, FILESEQ, AND CATVOL                    */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1111
*FPLMV:                                                            1111
*   PROC OPTIONS(SAVEAREA(16),SAVE(14));                           1111
FPLMV    ST    @14,12(,@13)                                        1111
         ST    @13,@SA00021+4                                      1111
         LA    @14,@SA00021                                        1111
         LR    @13,@14                                             1111
*   RFY                                                            1112
*    (R1,                                                          1112
*     R4,                                                          1112
*     R6,                                                          1112
*     K) RSTD;                                                     1112
*   SAVER1=1;                       /* INIT RELREPNO COUNTER         */
         LA    @09,1                                               1113
         ST    @09,SAVER1                                          1113
*   LIMIT=1;                        /* SET LIMIT TO NON ZERO         */
         ST    @09,LIMIT                                           1114
*   DO WHILE(LIMIT^=0);                                            1115
         B     @DE01115                                            1115
@DL01115 DS    0H                                                  1116
*     IF WKVOLNUM<20 THEN                                          1116
         LH    @09,WKVOLNUM                                        1116
         C     @09,@CF02082                                        1116
         BNL   @RF01116                                            1116
*       LIMIT=WKVOLNUM;                                            1117
         ST    @09,LIMIT                                           1117
*     ELSE                                                         1118
*       LIMIT=20;                                                  1118
         B     @RC01116                                            1118
@RF01116 MVC   LIMIT(4),@CF02082                                   1118
*     CALL GETUSERK;                /* GET INTO USER'S KEY           */
@RC01116 BAL   @14,GETUSERK                                        1119
*     R1=SAVER1;                    /* RESET RELREPNO COUNTER        */
         L     R1,SAVER1                                           1120
*     R4=SAVER4;                    /* RESET R4 POINTER              */
         L     R4,SAVER4                                           1121
*     K=ADDR(WKVOLST)+2;            /* K=ADDR OF VOLIST ENTRY        */
         LA    K,WKVOLST                                           1122
         AL    K,@CF00105                                          1122
*     DO R6=1 TO LIMIT;                                            1123
         LA    R6,1                                                1123
         B     @DE01123                                            1123
@DL01123 DS    0H                                                  1124
*       IF HOLDFPLN='DEVTYP  ' THEN                                1124
         CLC   HOLDFPLN(8),@CC02864                                1124
         BNE   @RF01124                                            1124
*         DO;                                                      1125
*           GEN(MVC   0(4,R4),0(K));/* MOVE DEVICE TYPE              */
         MVC   0(4,R4),0(K)
*         END;                                                     1127
*       ELSE                                                       1128
*         IF HOLDFPLN='VOLSER  ' THEN                              1128
         B     @RC01124                                            1128
@RF01124 CLC   HOLDFPLN(8),@CC02867                                1128
         BNE   @RF01128                                            1128
*           DO;                                                    1129
*             GEN(MVC   0(6,R4),4(K));/* MOVE VOLSER                 */
         MVC   0(6,R4),4(K)
*           END;                                                   1131
*         ELSE                                                     1132
*           IF HOLDFPLN='FILESEQ ' THEN                            1132
         B     @RC01128                                            1132
@RF01128 CLC   HOLDFPLN(8),@CC02870                                1132
         BNE   @RF01132                                            1132
*             DO;                                                  1133
*               GEN(MVC   0(2,R4),10(K));/* MOVE FILE SEQ.NO.        */
         MVC   0(2,R4),10(K)
*             END;                                                 1135
*           ELSE                                                   1136
*             DO;                   /* PROCESS CATVOL                */
         B     @RC01132                                            1136
@RF01132 DS    0H                                                  1137
*               GEN(STH   R1,0(R4));/* MOVE RELREPNO                 */
         STH   R1,0(R4)
*               GEN(MVC   2(4,R4),0(K));/* MOVE DEVICE TYPE          */
         MVC   2(4,R4),0(K)
*               GEN(MVC   6(6,R4),4(K));/* MOVE VOLSER               */
         MVC   6(6,R4),4(K)
*               GEN(MVC   12(2,R4),10(K));/* MOVE FILESEQ NO         */
         MVC   12(2,R4),10(K)
*               GEN(MVI   14(R4),X'FF');/* DEFAULT VOLFLG            */
         MVI   14(R4),X'FF'
*             END;                                                 1142
*       GEN(LA    R1,1(R1));        /* BUMP RELREPNO COUNTER         */
@RC01132 DS    0H                                                  1143
@RC01128 DS    0H                                                  1143
@RC01124 DS    0H                                                  1143
         LA    R1,1(R1)
*       GEN(A     R4,ENTCOUNT);     /* BUMP POINTER SAVE             */
         A     R4,ENTCOUNT
*       GEN(LA    K,12(K));         /* BUMP POINTER                  */
         LA    K,12(K)
*     END;                                                         1146
         AL    R6,@CF00064                                         1146
@DE01123 C     R6,LIMIT                                            1146
         BNH   @DL01123                                            1146
*     CALL GETSVCK;                 /* GET INTO SVC KEY              */
         BAL   @14,GETSVCK                                         1147
*     SAVER1=SAVER1+20;             /* BUMP RELREPNO SAVE            */
         LA    @09,20                                              1148
         L     @07,SAVER1                                          1148
         ALR   @07,@09                                             1148
         ST    @07,SAVER1                                          1148
*     SAVER4=SAVER4+(ENTCOUNT*20);  /* BUMP POINTER                  */
         LR    @03,@09                                             1149
         M     @02,ENTCOUNT                                        1149
         AL    @03,SAVER4                                          1149
         ST    @03,SAVER4                                          1149
*     IF WKNXTTTR=HEX3ZERO×WKVOLNUM=1/*                      @YM07777*/
*       THEN                                                       1150
         CLC   WKNXTTTR(3),HEX3ZERO                                1150
         BE    @RT01150                                            1150
         CLC   WKVOLNUM(2),@CH00064                                1150
         BNE   @RF01150                                            1150
@RT01150 DS    0H                                                  1151
*       LIMIT=0;                    /* NO MORE BLOCKS,STOP LOOP      */
         SLR   @09,@09                                             1151
         ST    @09,LIMIT                                           1151
*     ELSE                                                         1152
*       DO;                                                        1152
         B     @RC01150                                            1152
@RF01150 DS    0H                                                  1153
*         CALL LOCTTR;              /* GO GET NEXT BLOCK             */
         BAL   @14,LOCTTR                                          1153
*         IF OSRC15^=0 THEN                                        1154
         SLR   @09,@09                                             1154
         C     @09,OSRC15                                          1154
         BE    @RF01154                                            1154
*           DO;                     /* IO ERROR,SET RETURN CODE,STOP
*                                      LOOP                          */
*             VSRC15=VS24;          /* SET IO ERROR CODE             */
         L     @07,VS24                                            1156
         ST    @07,VSRC15                                          1156
*             LIMIT=0;              /* STOP LOOP                     */
         ST    @09,LIMIT                                           1157
*           END;                                                   1158
*         ELSE                                                     1159
*           ;                                                      1159
@RF01154 DS    0H                                                  1160
*       END;                                                       1160
*   END;                                                           1161
@RC01150 DS    0H                                                  1161
@DE01115 L     @09,LIMIT                                           1161
         LTR   @09,@09                                             1161
         BNZ   @DL01115                                            1161
*   RFY                                                            1162
*    (R1,                                                          1162
*     R4,                                                          1162
*     R6,                                                          1162
*     K) UNRSTD;                                                   1162
*   END FPLMV;                                                     1163
@EL00021 L     @13,4(,@13)                                         1163
@EF00021 DS    0H                                                  1163
@ER00021 L     @14,12(,@13)                                        1163
         BR    @14                                                 1163
*                                                                  1164
*   /*****************************************************************/
*   /*                                                               */
*   /* DSTYPNAM IS CALLED TO PROCESS AN 'DSTYPNAM' FPL               */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1164
*DSTYPNAM:                                                         1164
*   PROC OPTIONS(SAVEAREA(16),SAVE(14));                           1164
DSTYPNAM ST    @14,12(,@13)                                        1164
         ST    @13,@SA00022+4                                      1164
         LA    @14,@SA00022                                        1164
         LR    @13,@14                                             1164
*   CALL GETUSERK;                  /* GET INTO USER'S KEY           */
         BAL   @14,GETUSERK                                        1165
*   RFY                                                            1166
*     R4 RSTD;                                                     1166
*   R4=SAVER4;                      /* GET START ADDRESS             */
         L     R4,SAVER4                                           1167
*   GEN(MVI   0(R4),C'A');          /* SET ENTRY TYPE-NON VSAM       */
         MVI   0(R4),C'A'
*   GEN(MVC   1(3,R4),EIGHTXFF);    /* DEFAULT ENTIDNO               */
         MVC   1(3,R4),EIGHTXFF
*   RFY                                                            1170
*     R4 UNRSTD;                                                   1170
*   CALL GETSVCK;                   /* GET INTO SVC KEY              */
         BAL   @14,GETSVCK                                         1171
*   END DSTYPNAM;                                                  1172
@EL00022 L     @13,4(,@13)                                         1172
@EF00022 DS    0H                                                  1172
@ER00022 L     @14,12(,@13)                                        1172
         BR    @14                                                 1172
*                                                                  1173
*   /*****************************************************************/
*   /*                                                               */
*   /* RELCRA IS CALLED TO PROCESS THE COMBINATION           @VS34653*/
*   /* FPL 'RELCRA' CONSISTING OF RELEASE INDICATOR,         @VS34653*/
*   /* CATALOG RECOVERY AREA (CRA) VOLUME SERIAL,            @VS34653*/
*   /* CRA CI NUMBER, AND CRA VOLUME DEVICE TYPE.            @VS34653*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1173
*RELCRA:                                                           1173
*   PROC OPTIONS(SAVEAREA(16),SAVE(14));/*                   @VS34653*/
RELCRA   ST    @14,12(,@13)                                        1173
         ST    @13,@SA00023+4                                      1173
         LA    @14,@SA00023                                        1173
         LR    @13,@14                                             1173
*   CALL GETUSERK;                  /* GET INTO USER'S KEY   @VS34653*/
         BAL   @14,GETUSERK                                        1174
*   RFY                                                            1175
*    (R4,                                                          1175
*     R5,                                                          1175
*     R6,                                                          1175
*     R7) RSTD;                     /*                       @VS34653*/
*   R4=SAVER4;                      /* GET START ADDRESS     @VS34653*/
         L     R4,SAVER4                                           1176
*   R5=ENTCOUNT;                    /* OBTAIN LENGTH         @VS34653*/
         L     R5,ENTCOUNT                                         1177
*   R7=0;                           /* PAD CHAR TO CLEAR     @VS34653*/
         SLR   R7,R7                                               1178
*   GEN(MVCL R4,R6);                /* RETURN INFO OF ZEROS  @VS34653*/
         MVCL R4,R6
*   RFY                                                            1180
*    (R4,                                                          1180
*     R5,                                                          1180
*     R6,                                                          1180
*     R7) UNRSTD;                   /*                       @VS34653*/
*   CALL GETSVCK;                   /* GET INTO SVC KEY      @VS34653*/
         BAL   @14,GETSVCK                                         1181
*   END RELCRA;                     /*                       @VS34653*/
@EL00023 L     @13,4(,@13)                                         1182
@EF00023 DS    0H                                                  1182
@ER00023 L     @14,12(,@13)                                        1182
         BR    @14                                                 1182
*                                                                  1183
*   /*****************************************************************/
*   /*                                                               */
*   /* TEST FOR CALLERS AUTHORIZATION                        @OZ28096*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1183
*CHEKAUTH:                          /*                       @OZ28096*/
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);                               1183
CHEKAUTH DS    0H                                                  1184
*   GEN;                                                           1184
         STM   R14,R3,XSAVAREA+12     SAVE REGS              @OZ27009
         TESTAUTH FCTN=1,STATE=YES,KEY=YES,BRANCH=YES,RBLEVEL=2
         L     R14,XSAVAREA+12        RESTORE REG 14         @OZ27009
         LM    R0,R3,XSAVAREA+20      RESTORE REGS           @OZ27009
*   END CHEKAUTH;                                                  1185
@EL00024 DS    0H                                                  1185
@EF00024 DS    0H                                                  1185
@ER00024 BR    @14                                                 1185
*                                                                  1186
*   /*****************************************************************/
*   /*                                                               */
*   /* NSUPPORT IS CALLED TO PROCESS AN UNKNOWN FPL          @VS32767*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1186
*NSUPPORT:                                                         1186
*   PROC OPTIONS(SAVEAREA(16),SAVE(14));/*                   @VS32767*/
NSUPPORT ST    @14,12(,@13)                                        1186
         ST    @13,@SA00025+4                                      1186
         LA    @14,@SA00025                                        1186
         LR    @13,@14                                             1186
*   DCL                                                            1187
*     NSUPMVC CHAR(6) STATIC LOCAL GENERATED;/* EX MVC               */
*   CALL GETUSERK;                  /* GET INTO USER'S KEY   @VS32767*/
         BAL   @14,GETUSERK                                        1188
*   RFY                                                            1189
*     R4 RSTD;                      /*                       @VS32767*/
*   R4=SAVER4;                      /* GET START ADDRESS     @VS32767*/
         L     R4,SAVER4                                           1190
*   GEN;                                                           1191
*                                                         /*@OZ17948*/
        L     R1,ENTCOUNT    /* GET LENGTH                  @OZ17948*/
        LA    R1,0(R1)       /* CLEAR HIGH ORDER BYTE       @OZ17948*/
        LTR   R1,R1          /* LENGTH ZERO?                @OZ17948*/
        BZ    NSUP001        /* YES, BR                     @OZ17948*/
        BCTR  R1,0           /* SET UP FOR MOVE             @OZ17948*/
        EX    R1,NSUPMVC     /* MOVE IN 'FF'S               @OZ17948*/
NSUP001 EQU *                                             /*@OZ17948*/
*   GEN DATA DEFS(NSUPMVC) REFS(EIGHTXFF);                         1192
*   RFY                                                            1193
*     R4 UNRSTD;                    /*                       @VS32767*/
*   CALL GETSVCK;                   /* GET INTO SVC KEY      @VS32767*/
         BAL   @14,GETSVCK                                         1194
*   END NSUPPORT;                   /*                       @VS32767*/
@EL00025 L     @13,4(,@13)                                         1195
@EF00025 DS    0H                                                  1195
@ER00025 L     @14,12(,@13)                                        1195
         BR    @14                                                 1195
*   END IGG0CLCA                    /*                       @OZ00963*/
*                                                                  1196
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */
*/*%INCLUDE SYSLIB  (IEZCTGPL)                                       */
*/*%INCLUDE SYSLIB  (IEZCTGWA)                                       */
*/*%INCLUDE SYSLIB  (IEZCTGVL)                                       */
*/*%INCLUDE SYSLIB  (IEZCTGCV)                                       */
*/*%INCLUDE SYSLIB  (IEZCTGFL)                                       */
*/*%INCLUDE SYSLIB  (IKJTCB  )                                       */
*/*%INCLUDE SYSLIB  (CVT     )                                       */
*/*%INCLUDE SYSLIB  (IEZJSCB )                                       */
*/*%INCLUDE SYSLIB  (IHAPSA  )                                       */
*/*%INCLUDE SYSLIB  (IHAASCB )                                       */
*/*%INCLUDE SYSLIB  (IKJPSCB )                                       */
*/*%INCLUDE SYSLIB  (IEFPCCB )                                       */
*/*%INCLUDE SYSLIB  (IHARB   )                                       */
*/*%INCLUDE SYSLIB  (IKJRB   )                                       */
*/*%INCLUDE SYSLIB  (IHASDWA )                                       */
*/*%INCLUDE SYSLIB  (IEFTIOT1)                                       */
*                                                                  1196
*       ;                                                          1196
@EL00001 L     @13,4(,@13)                                         1196
@EF00001 DS    0H                                                  1196
@ER00001 BR    @14                                                 1196
@DATA    DS    0H
@CH00180 DC    H'4'
@CH00127 DC    H'12'
@SM03066 MVC   WKDSN(0),CAMDSN(R3)
@DATD    DSECT
         DS    0F
@SA00001 DS    4F
@SA00008 DS    4F
@SA00009 DS    4F
@SA00010 DS    4F
@SA00011 DS    4F
@SA00012 DS    4F
@SA00013 DS    4F
@SA00017 DS    4F
@SA00018 DS    4F
@SA00019 DS    4F
@SA00021 DS    4F
@SA00020 DS    4F
@SA00022 DS    4F
@SA00016 DS    4F
@SA00004 DS    4F
@SA00014 DS    4F
@SA00015 DS    4F
@SA00003 DS    4F
@SA00002 DS    15F
@SA00023 DS    4F
@SA00025 DS    4F
IGG0CLCA CSECT
         DS    0F
@CF00064 DC    F'1'
@CH00064 EQU   @CF00064+2
@CF00105 DC    F'2'
@CF00091 DC    F'3'
@CF00188 DC    F'15'
@CH00188 EQU   @CF00188+2
@CF02082 DC    F'20'
@CH02082 EQU   @CF02082+2
@CF02418 DC    F'36'
@CF02833 DC    F'40'
@CF00206 DC    F'44'
@CF03003 DC    F'45'
@CF03010 DC    F'-20'
@CF02930 DC    XL4'7FFFFFFF'
@CF03065 DC    XL4'0000FFFF'
@DATD    DSECT
         DS    0D
OSRC1    DS    F
@TS00001 DS    CL4
IGG0CLCA CSECT
         DS    0F
@SIZDATD DC    AL1(0)
         DC    AL3(@ENDDATD-@DATD)
@CV00057 DC    V(IGG0CLCB)
@CV00058 DC    V(IGG0CLCC)
         DS    0D
ZEROPTR  DC    A(0)
TWELVE   DC    A(12)
STCHK    DC    XL4'0000011A'
GL4      DC    A(4)
VS8      DC    A(8)
VS24     DC    A(24)
VS28     DC    A(28)
VS40     DC    A(40)
VS44     DC    A(44)
VS48     DC    A(48)
VS56     DC    A(56)
VS68     DC    A(68)
VS84     DC    A(84)
VS102    DC    A(102)
VS164    DC    A(164)
VS168    DC    A(168)
VS184    DC    A(184)
@CC02916 DC    C'SYSCTLG.V'
@CC02991 DC    C'.G0000V00'
@CC02858 DC    C'ENTYPE  '
@CC02861 DC    C'ENTNAME '
@CC02864 DC    C'DEVTYP  '
@CC02867 DC    C'VOLSER  '
@CC02870 DC    C'FILESEQ '
@CC02873 DC    C'DSCBTTR '
@CC02876 DC    C'CATVOL  '
@CC02879 DC    C'DSTYPNAM'
@CC02891 DC    C'RELCRA  '
@CC02996 DC    C'(0) '
@CB02928 DC    X'000000000000'
@CB03026 DC    X'FFFFFF'
ON       DC    X'FF'
OFF      DC    X'00'
OSLOCMSK DC    X'387F8000'
HEX3ZERO DC    X'000000'
SCRPURGE DC    X'41005000'
SCRNOPUR DC    X'41004000'
UCATOPTN DC    X'88040000'
LOCNMOPT DC    X'80000000'
SLOPTN1  DC    X'80000200'
SLOPTN2  DC    X'80000600'
LOCTTROP DC    X'82000000'
EIGHTXFF DC    X'FFFFFFFFFFFFFFFF'
PCQNAM   DC    CL8'SYSZPCCB'
PCRNAM   DC    CL4'PCCB'
SYSDSN   DC    CL8'SYSDSN  '
SYSZOP   DC    CL8'SYSZOPEN'
ACCOPTNS DC    B'0001010010101000'
ACCOPTN1 DC    B'0001000000101000'
FPLTABLE DS    CL156
         ORG   FPLTABLE
@NM00156 DC    CL8'ENTYPE  '
@NM00157 DC    F'1'
@NM00158 DC    CL8'ENTNAME '
@NM00159 DC    F'44'
@NM00160 DC    CL8'DEVTYP  '
@NM00161 DC    F'4'
@NM00162 DC    CL8'VOLSER  '
@NM00163 DC    F'6'
@NM00164 DC    CL8'FILESEQ '
@NM00165 DC    F'2'
@NM00166 DC    CL8'DSCBTTR '
@NM00167 DC    F'3'
@NM00168 DC    CL8'CATVOL  '
@NM00169 DC    F'15'
@NM00170 DC    CL8'DSTYPNAM'
@NM00171 DC    F'4'
@NM00172 DC    CL8'DSETCRDT'
@NM00173 DC    F'3'
@NM00174 DC    CL8'DSETEXDT'
@NM00175 DC    F'3'
@NM00176 DC    CL8'OWNERID '
@NM00177 DC    F'8'
@NM00178 DC    CL8'RELCRA  '
@NM00179 DC    F'14'
ENDTABLE DC    CL8'00000000'
@NM00180 DC    F'4'
         ORG   FPLTABLE+156
FIXAREA  DS    CL100
         ORG   FIXAREA
@NM00181 DC    100CL1'Z'
         ORG   FIXAREA+100
RECORD   DS    CL24
         ORG   RECORD
MODNM    DC    CL8'IGG0CLCA'
CSECTN   DC    CL8'IGG0CLCA'
FRRID    DC    8X'00'
         ORG   RECORD+24
SKELHDR  DS    CL43
         ORG   SKELHDR
@NM00182 DC    AL1(42+1)
SKELMSG  DC    CL42'SDUMP - IGG0CLCA - CVOL CATALOG MANAGEMENT'
         ORG   SKELHDR+43
@DATD    DSECT
         ORG   @DATD+496     FORCE ALIGNMENT FOR DCL ON DOUBLEWORD
WORKCLCA DS    CL3600        DEFINE WORKAREA
IGG0CLCA CSECT
*                                     /* MACRO LIST FORMS   @Z40CSRC*/
ENQSYSDS ENQ   (SYSZOP,,S,15,SYSTEM),RET=USE,MF=L ENQ LIST  @Z40CSRC
ENQDEQML ENQ   (PCQNAM,PCRNAM,S,4,SYSTEM),MF=L ENQ-DEQ PARM LIST
IGG0CLCA CSECT
DUMPL    SDUMP SDATA=(PSA,LSQA,RGN,LPA),MF=L
IGG0CLCA CSECT
*                                                         /*@VS32767*/
NSUPMVC  MVC 0(0,R4),EIGHTXFF
@DATD    DSECT
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA
@ENDDATD EQU   *
IGG0CLCA CSECT
@00      EQU   00                      EQUATES FOR REGISTERS 0-15
@01      EQU   01
@02      EQU   02
@03      EQU   03
@04      EQU   04
@05      EQU   05
@06      EQU   06
@07      EQU   07
@08      EQU   08
@09      EQU   09
@10      EQU   10
@11      EQU   11
@12      EQU   12
@13      EQU   13
@14      EQU   14
@15      EQU   15
WKSCRLP  EQU   @02
DSNLEN   EQU   @06
R0       EQU   @00
R1       EQU   @01
R2       EQU   @02
GPR02F   EQU   @02
R3       EQU   @03
WKREG    EQU   @03
R4       EQU   @04
R5       EQU   @05
R6       EQU   @06
I        EQU   @06
R7       EQU   @07
J        EQU   @07
K        EQU   @08
R10      EQU   @10
R11      EQU   @11
R12      EQU   @12
R14      EQU   @14
R15      EQU   @15
GPR01P   EQU   @01
GPR00P   EQU   @00
GPR14P   EQU   @14
GPR15P   EQU   @15
GPR00F   EQU   @00
GPR02P   EQU   @02
GPR12F   EQU   @12
GPR13P   EQU   @13
R13      EQU   @13
R8       EQU   @08
R9       EQU   @09
PSA      EQU   0
FLCRNPSW EQU   PSA
FLCROPSW EQU   PSA+8
FLCICCW2 EQU   PSA+16
PSAEEPSW EQU   PSA+132
PSAESPSW EQU   PSA+136
FLCSVILC EQU   PSAESPSW+1
PSAEPPSW EQU   PSA+140
FLCPIILC EQU   PSAEPPSW+1
FLCPICOD EQU   PSAEPPSW+2
PSAPICOD EQU   FLCPICOD+1
FLCTEA   EQU   PSAEPPSW+4
FLCPER   EQU   PSA+152
FLCMCLA  EQU   PSA+168
FLCIOEL  EQU   FLCMCLA+4
FLCIOA   EQU   FLCMCLA+16
FLCFSA   EQU   FLCMCLA+80
PSAAOLD  EQU   PSA+548
PSASUPER EQU   PSA+552
PSASUP1  EQU   PSASUPER
PSASUP2  EQU   PSASUPER+1
PSASUP3  EQU   PSASUPER+2
PSASUP4  EQU   PSASUPER+3
PSACLHT  EQU   PSA+640
PSALKSA  EQU   PSA+696
PSAHLHI  EQU   PSA+760
PSADSSFL EQU   PSA+836
PSADSSF1 EQU   PSADSSFL
PSADSSF3 EQU   PSADSSFL+2
PSADSSF4 EQU   PSADSSFL+3
PSARSVT  EQU   PSA+896
CTGPL    EQU   0
CTGOPTN1 EQU   CTGPL
CTGCNAME EQU   CTGOPTN1
CTGGENLD EQU   CTGOPTN1
CTGOPTN2 EQU   CTGPL+1
CTGEXT   EQU   CTGOPTN2
CTGERASE EQU   CTGOPTN2
CTGSMF   EQU   CTGERASE
CTGREL   EQU   CTGSMF
CTGPURG  EQU   CTGOPTN2
CTGVMNT  EQU   CTGPURG
CTGRCATN EQU   CTGVMNT
CTGGTNXT EQU   CTGOPTN2
CTGSCR   EQU   CTGOPTN2
CTGOPTN3 EQU   CTGPL+2
CTGFUNC  EQU   CTGOPTN3
CTGSUPLT EQU   CTGOPTN3
CTGGDGL  EQU   CTGOPTN3
CTGSRH   EQU   CTGOPTN3
CTGOPTN4 EQU   CTGPL+3
CTGLBASE EQU   CTGOPTN4
CTGDOCAT EQU   CTGOPTN4
CTGTIOT  EQU   CTGOPTN4
CTGENT   EQU   CTGPL+4
CTGCAT   EQU   CTGPL+8
CTGCVOL  EQU   CTGCAT
CTGWKA   EQU   CTGPL+12
CTGDSORG EQU   CTGPL+16
CTGOPTNS EQU   CTGDSORG
CTGTYPE  EQU   CTGPL+18
CTGNOFLD EQU   CTGPL+19
CTGDDNM  EQU   CTGPL+20
CTGNEWNM EQU   CTGDDNM
CTGFDBK  EQU   CTGNEWNM
CTGFBFLG EQU   CTGNEWNM+2
CTGGDGB  EQU   CTGFBFLG
CTGNGDSN EQU   CTGFBFLG
CTGJSCB  EQU   CTGPL+24
CTGFIELD EQU   CTGPL+28
CTGWA    EQU   0
CTGWAVL  EQU   CTGWA
CTGWALV  EQU   CTGWA+4
CTGWAVCT EQU   CTGWA+6
CTGWAUCT EQU   CTGWA+8
CTGWAGCT EQU   CTGWA+10
CTGWAGB  EQU   CTGWA+12
CTGVL    EQU   0
CTGVLVOL EQU   CTGVL
CTGVLDEV EQU   CTGVL+6
CTGVLSEQ EQU   CTGVL+10
CTGVLX   EQU   0
CTGVLTTR EQU   CTGVLX+12
CTGCV    EQU   0
CTGCVVOL EQU   CTGCV
CTGCVDSN EQU   CTGCV+6
CTGCVCC  EQU   CTGCV+50
CTGFL    EQU   0
CTGFLDRE EQU   CTGFL+3
CTGFLDNM EQU   CTGFL+8
CTGFLCHN EQU   CTGFL+12
CTGFLDAT EQU   CTGFL+16
CTGFLNG  EQU   CTGFLDAT
CTGFLPT  EQU   CTGFLDAT+4
TCBFIX   EQU   0
TCBFRS   EQU   TCBFIX
TCB      EQU   0
TCBRBP   EQU   TCB
TCBPIE   EQU   TCB+4
TCBPMASK EQU   TCBPIE
TCBTIO   EQU   TCB+12
TCBCMP   EQU   TCB+16
TCBCMPF  EQU   TCBCMP
TCBCPP   EQU   TCBCMPF
TCBSTCC  EQU   TCBCMPF
TCBCDBL  EQU   TCBCMPF
TCBCWTO  EQU   TCBCMPF
TCBCIND  EQU   TCBCMPF
TCBCMSG  EQU   TCBCMPF
TCBTRN   EQU   TCB+20
TCBABF   EQU   TCBTRN
TCBMSS   EQU   TCB+24
TCBPKF   EQU   TCB+28
TCBFLGS  EQU   TCB+29
TCBFLGS1 EQU   TCBFLGS
TCBFLGS2 EQU   TCBFLGS+1
TCBFLGS3 EQU   TCBFLGS+2
TCBFLGS4 EQU   TCBFLGS+3
TCBFLGS5 EQU   TCBFLGS+4
TCBABWF  EQU   TCBFLGS5
TCBJPQ   EQU   TCB+44
TCBPURGE EQU   TCBJPQ
TCBGRS   EQU   TCB+48
TCBFSA   EQU   TCB+112
TCBTME   EQU   TCB+120
TCBJSTCB EQU   TCB+124
TCBTSFLG EQU   TCB+148
TCBTSTSK EQU   TCBTSFLG
TCBSTAB  EQU   TCB+160
TCBNSTAE EQU   TCBSTAB
TCBTCT   EQU   TCB+164
TCBTCTGF EQU   TCBTCT
TCBSCNDY EQU   TCB+172
TCBNDSP  EQU   TCBSCNDY
TCBNDSP1 EQU   TCBNDSP+1
TCBNDSP2 EQU   TCBNDSP+2
TCBNDSP3 EQU   TCBNDSP+3
TCBJSCB  EQU   TCB+180
TCBRECDE EQU   TCBJSCB
TCBEXT1  EQU   TCB+196
TCBBITS  EQU   TCB+200
TCBNDSP4 EQU   TCBBITS
TCBNDSP5 EQU   TCBBITS+1
TCBFLGS6 EQU   TCBBITS+2
TCBFLGS7 EQU   TCBBITS+3
TCBDAR   EQU   TCB+204
TCBDARC  EQU   TCBDAR
TCBEXT2  EQU   TCB+208
TCBFOE   EQU   TCB+244
TCBESTAE EQU   TCB+264
TCBESTRM EQU   TCBESTAE+1
TCBFBYT1 EQU   TCB+276
TCBFBYT2 EQU   TCB+277
TCBRV124 EQU   TCB+278
TCBRV133 EQU   TCB+279
TCBXTNT2 EQU   0
TCBGTF   EQU   TCBXTNT2
TCBTFLG  EQU   TCBGTF
TCBRV146 EQU   TCBXTNT2+28
TCBRV155 EQU   TCBXTNT2+29
TCBRV164 EQU   TCBXTNT2+30
TCBRV173 EQU   TCBXTNT2+31
CVTMAP   EQU   0
CVTDAR   EQU   CVTMAP+72
CVTFLGS1 EQU   CVTDAR
CVTDCB   EQU   CVTMAP+116
CVTIOQET EQU   CVTMAP+120
CVTIERLC EQU   CVTMAP+144
CVTHEAD  EQU   CVTMAP+160
CVTSV76C EQU   CVTHEAD
CVTOPTA  EQU   CVTMAP+182
CVTOPTB  EQU   CVTMAP+183
CVTGTF   EQU   CVTMAP+236
CVTGTFST EQU   CVTGTF
CVTGTFS  EQU   CVTGTFST
CVTSTATE EQU   CVTGTFST
CVTTMODE EQU   CVTGTFST
CVTFORM  EQU   CVTGTFST
CVTAQAVT EQU   CVTMAP+240
CVTTCMFG EQU   CVTAQAVT
CVTVOLM2 EQU   CVTMAP+244
CVTTATA  EQU   CVTVOLM2
CVTTSKS  EQU   CVTTATA
CVTVOLF2 EQU   CVTTSKS
CVTTAT   EQU   CVTTATA+1
CVTATER  EQU   CVTMAP+248
CVTEXT1  EQU   CVTMAP+252
CVTPURG  EQU   CVTMAP+260
CVTQMSG  EQU   CVTMAP+268
CVTDMSR  EQU   CVTMAP+272
CVTRSV37 EQU   CVTDMSR
CVTDMSRF EQU   CVTRSV37
CVTERPV  EQU   CVTMAP+316
CVTINTLA EQU   CVTMAP+320
CVTAPF   EQU   CVTMAP+324
CVTEXT2  EQU   CVTMAP+328
CVTHJES  EQU   CVTMAP+332
CVTPGSIA EQU   CVTMAP+348
CVTA1F1  EQU   CVTMAP+356
CVTSYSK  EQU   CVTMAP+357
CVTVOLM1 EQU   CVTMAP+380
CVTVOLF1 EQU   CVTVOLM1
CVTATMCT EQU   CVTMAP+388
CVTXTNT1 EQU   0
CVTXTNT2 EQU   0
CVTDSSV  EQU   CVTXTNT2
CVTFLGBT EQU   CVTXTNT2+5
CVTQID   EQU   CVTXTNT2+24
CVTRV400 EQU   CVTXTNT2+52
CVTRV409 EQU   CVTXTNT2+53
CVTATCVT EQU   CVTXTNT2+64
CVTRV429 EQU   CVTXTNT2+84
CVTRV438 EQU   CVTXTNT2+85
CVTRV457 EQU   CVTXTNT2+112
CVTRV466 EQU   CVTXTNT2+113
CVTFIX   EQU   0
CVTRELNO EQU   CVTFIX+252
IEZJSCB  EQU   0
JSCBSEC1 EQU   IEZJSCB+188
JSCHPCE  EQU   JSCBSEC1+4
JSCBPCC  EQU   JSCBSEC1+16
JSCBTCBP EQU   JSCBSEC1+20
JSCBDCB  EQU   JSCBSEC1+36
JSCBOPTS EQU   JSCBSEC1+48
JSCBSWT1 EQU   JSCBSEC1+55
JSCBWTP  EQU   JSCBSEC1+64
JSCBWTFG EQU   JSCBWTP
JSCBEND1 EQU   IEZJSCB+260
ASCB     EQU   0
ASCBTSB  EQU   ASCB+60
ASCBFW1  EQU   ASCB+100
ASCBRCTF EQU   ASCBFW1+2
ASCBFLG1 EQU   ASCBFW1+3
ASCBDSP1 EQU   ASCB+114
ASCBFLG2 EQU   ASCB+115
PSCB     EQU   0
PSCBATR1 EQU   PSCB+16
PSCBVMNT EQU   PSCBATR1
IEFPCCB  EQU   0
PCCNEXTP EQU   IEFPCCB+4
PCCSTATS EQU   IEFPCCB+12
PCCSTAT1 EQU   PCCSTATS
PCCACTIV EQU   PCCSTAT1
PCOSCVOL EQU   PCCSTAT1
PCCACBP  EQU   IEFPCCB+16
PCCDSNAM EQU   IEFPCCB+28
PCVOLSER EQU   IEFPCCB+116
NONADDR  EQU   0
RBPRFX   EQU   0
RBBASIC  EQU   0
RBEXRTNM EQU   RBBASIC
RBTMFLD  EQU   RBEXRTNM
RBSTAB   EQU   RBBASIC+10
XSTAB    EQU   RBSTAB
RBSTAB1  EQU   XSTAB
XSTAB1   EQU   RBSTAB1
RBFTCKPT EQU   XSTAB1
RBSTAB2  EQU   XSTAB+1
XSTAB2   EQU   RBSTAB2
RBTCBNXT EQU   XSTAB2
RBFACTV  EQU   XSTAB2
RBFDYN   EQU   XSTAB2
RBECBWT  EQU   XSTAB2
RBOPSW   EQU   RBBASIC+16
XRBPSW   EQU   RBOPSW
RBOPSWB2 EQU   XRBPSW+1
RBLINK   EQU   RBBASIC+28
XRBLNK   EQU   RBLINK
RBWCF    EQU   XRBLNK
RBLINKB  EQU   XRBLNK+1
RBGRSAVE EQU   RBBASIC+32
XRBREG   EQU   RBGRSAVE
RBGRS0   EQU   XRBREG
RBGRS1   EQU   XRBREG+4
RBGRS2   EQU   XRBREG+8
RBGRS3   EQU   XRBREG+12
RBGRS4   EQU   XRBREG+16
RBGRS5   EQU   XRBREG+20
RBGRS6   EQU   XRBREG+24
RBGRS7   EQU   XRBREG+28
RBGRS8   EQU   XRBREG+32
RBGRS9   EQU   XRBREG+36
RBGRS10  EQU   XRBREG+40
RBGRS11  EQU   XRBREG+44
RBGRS12  EQU   XRBREG+48
RBGRS13  EQU   XRBREG+52
RBGRS14  EQU   XRBREG+56
RBGRS15  EQU   XRBREG+60
XRBESA   EQU   RBBASIC+96
RBPREFIX EQU   0
RBRSV019 EQU   RBPREFIX+14
RBRSV028 EQU   RBPREFIX+15
RBRSV041 EQU   RBPREFIX+27
RBRSV054 EQU   RBPREFIX+39
RBRTOPSW EQU   RBPREFIX+40
RBRTPSW2 EQU   RBRTOPSW+8
RBRTICIL EQU   RBRTPSW2
RBFLAGS1 EQU   RBPREFIX+56
RBINTCDA EQU   RBPREFIX+61
RBSECT   EQU   0
RBPPSAV  EQU   RBSECT
@NM00058 EQU   RBSECT+10
@NM00059 EQU   @NM00058
RBTRSVRB EQU   @NM00059
@NM00061 EQU   @NM00058+1
RBETXR   EQU   @NM00061
RBEP     EQU   RBSECT+12
RBPGMQ   EQU   RBSECT+24
@NM00068 EQU   RBSECT+28
IRBEND   EQU   RBSECT+96
@NM00072 EQU   RBSECT+96
RBRSV138 EQU   @NM00072+7
RBRSV150 EQU   RBSECT+167
SDWA     EQU   0
SDWAFIOB EQU   SDWA+4
SDWAABCC EQU   SDWAFIOB
SDWACMPF EQU   SDWAABCC
SDWAREQ  EQU   SDWACMPF
SDWACMPC EQU   SDWAABCC+1
SDWACTL1 EQU   SDWA+8
SDWACMKA EQU   SDWACTL1
SDWAMWPA EQU   SDWACTL1+1
SDWAPMKA EQU   SDWACTL1+4
SDWACTL2 EQU   SDWA+16
SDWACMKP EQU   SDWACTL2
SDWAMWPP EQU   SDWACTL2+1
SDWAPMKP EQU   SDWACTL2+4
SDWAGRSV EQU   SDWA+24
SDWANAME EQU   SDWA+88
SDWAEC1  EQU   SDWA+104
SDWAEMK1 EQU   SDWAEC1
SDWAMWP1 EQU   SDWAEC1+1
SDWAINT1 EQU   SDWAEC1+2
SDWANXT1 EQU   SDWAEC1+4
SDWAAEC1 EQU   SDWA+112
SDWAILC1 EQU   SDWAAEC1+1
SDWAINC1 EQU   SDWAAEC1+2
SDWAICD1 EQU   SDWAINC1+1
SDWAEC2  EQU   SDWA+120
SDWAEMK2 EQU   SDWAEC2
SDWAMWP2 EQU   SDWAEC2+1
SDWAINT2 EQU   SDWAEC2+2
SDWANXT2 EQU   SDWAEC2+4
SDWAAEC2 EQU   SDWA+128
SDWAILC2 EQU   SDWAAEC2+1
SDWAINC2 EQU   SDWAAEC2+2
SDWAICD2 EQU   SDWAINC2+1
SDWASRSV EQU   SDWA+136
SDWAIDNT EQU   SDWA+200
SDWAMCH  EQU   SDWA+204
SDWASTCK EQU   SDWAMCH
SDWAMCHI EQU   SDWAMCH+8
SDWAMCHS EQU   SDWAMCHI
SDWAMCHD EQU   SDWAMCHI+1
SDWARSR1 EQU   SDWAMCH+12
SDWARSR2 EQU   SDWAMCH+13
SDWAFLGS EQU   SDWA+232
SDWAERRA EQU   SDWAFLGS
SDWAERRB EQU   SDWAFLGS+1
SDWAERRC EQU   SDWAFLGS+2
SDWAPERC EQU   SDWAERRC
SDWAERRD EQU   SDWAFLGS+3
SDWAIOFS EQU   SDWA+238
SDWACPUA EQU   SDWA+248
SDWAPARQ EQU   SDWA+252
SDWARCDE EQU   SDWAPARQ
SDWAACF2 EQU   SDWAPARQ+1
SDWARCRD EQU   SDWAACF2
SDWAACF3 EQU   SDWAPARQ+2
SDWAACF4 EQU   SDWAPARQ+3
SDWALKWA EQU   SDWA+256
SDWALKWS EQU   SDWALKWA
SDWARECP EQU   SDWA+292
SDWASNPA EQU   SDWA+320
SDWADUMP EQU   SDWASNPA
SDWADPFS EQU   SDWADUMP+1
SDWADDAT EQU   SDWASNPA+4
SDWASDAT EQU   SDWADDAT
SDWAPDAT EQU   SDWADDAT+2
SDWADPSA EQU   SDWA+328
SDWADPSL EQU   SDWADPSA
SDWARA   EQU   SDWA+400
SDWADPVA EQU   SDWARA+2
TIOT1    EQU   0
CAMLSTD  EQU   0
CAMOPTNS EQU   CAMLSTD
CAMOPTN1 EQU   CAMOPTNS
CAMCAT   EQU   CAMOPTN1
CAMRECAT EQU   CAMOPTN1
CAMLTTR  EQU   CAMOPTN1
CAMOPTN2 EQU   CAMOPTNS+1
CAMNOALC EQU   CAMOPTN2
CAMBLDA  EQU   CAMOPTN2
CAMLNKX  EQU   CAMOPTN2
CAMDTTR  EQU   CAMOPTN2
CAMDLTA  EQU   CAMOPTN2
CAMOPTN3 EQU   CAMOPTNS+2
CAMDRPX  EQU   CAMOPTN3
CAMTIOT  EQU   CAMOPTN3
CAMAM0   EQU   CAMOPTN3
CAMPTR1  EQU   CAMLSTD+4
CAMPTR3  EQU   CAMLSTD+12
CAMDSCBP EQU   CAMLSTD+16
CAMDSN   EQU   0
CPLDSN   EQU   0
CAMVOLST EQU   0
CAMVOLCT EQU   CAMVOLST
CAMDSCBT EQU   0
CAMIDXNM EQU   0
CAMNEWVL EQU   0
GLWA     EQU   0
WALEN1   EQU   GLWA
WALEN2   EQU   GLWA+2
GLENTS   EQU   0
WATYPE   EQU   GLENTS
WADSNAME EQU   GLENTS+1
GIPE     EQU   0
CPLCATNM EQU   0
FPLNAME  EQU   0
GGGG     EQU   0
SVOLENTS EQU   0
SDEVTYPE EQU   SVOLENTS
SVOLSER  EQU   SVOLENTS+4
SFSEQNO  EQU   SVOLENTS+10
MVOLENTS EQU   0
MVLVOL   EQU   MVOLENTS
MVLDEV   EQU   MVOLENTS+6
MVLSEQ   EQU   MVOLENTS+10
WKSTDNM  EQU   0
WKUNIQUE EQU   WKSTDNM+8
WKSTDVS  EQU   WKUNIQUE+1
I256C    EQU   0
I001C    EQU   0
I008P    EQU   0
I015F    EQU   0
I015P    EQU   0
I031F    EQU   0
I031P    EQU   0
WKCATNM  EQU   WORKCLCA+4
WKCATANM EQU   WORKCLCA+48
WKCVOLVS EQU   WORKCLCA+92
CVTPTR   EQU   WORKCLCA+100
TCBPTR   EQU   WORKCLCA+104
VSRC15   EQU   WORKCLCA+112
LIMIT    EQU   WORKCLCA+120
EXITSAV  EQU   WORKCLCA+124
CTGPLPTR EQU   WORKCLCA+128
CTGFLPTR EQU   WORKCLCA+132
CAMPLPTR EQU   WORKCLCA+136
PRMLSTSZ EQU   WORKCLCA+140
WKCAMLST EQU   WORKCLCA+216
WKOPTNS  EQU   WKCAMLST
WKPTR1   EQU   WKCAMLST+4
WKCVOLP  EQU   WKCAMLST+8
WKPTR3   EQU   WKCAMLST+12
WKDSCBP  EQU   WKCAMLST+16
GIPEPTR  EQU   WORKCLCA+236
PCCBPTR  EQU   WORKCLCA+240
SAVER1   EQU   WORKCLCA+244
SAVER4   EQU   WORKCLCA+252
SAVEI    EQU   WORKCLCA+276
OSRC150  EQU   WORKCLCA+280
OSRC15   EQU   OSRC150
OSRC0    EQU   OSRC150+4
RELNUM   EQU   WORKCLCA+288
ENTCOUNT EQU   RELNUM
SLAREA   EQU   WORKCLCA+292
SLGGGG   EQU   SLAREA
SLCURSIZ EQU   SLAREA+4
SLFLAGS  EQU   SLAREA+6
SLGDGF   EQU   SLFLAGS
LOCDSN   EQU   WORKCLCA+300
WKDSN    EQU   WORKCLCA+344
WKBLANK  EQU   WORKCLCA+388
WKDSCBT  EQU   WORKCLCA+389
KEYTYPE  EQU   WORKCLCA+392
OLDKEY   EQU   WORKCLCA+393
INCORESW EQU   WORKCLCA+394
PCCBSW   EQU   WORKCLCA+395
ENQDEQSW EQU   WORKCLCA+396
HOLDINDX EQU   WORKCLCA+400
HOLDFPLN EQU   HOLDINDX
HOLDREL  EQU   WORKCLCA+408
WKVOLST  EQU   WORKCLCA+416
WKVOLNUM EQU   WKVOLST
WKVOLS   EQU   WKVOLST+2
WKVOLLST EQU   WKVOLS
WKSCRSTS EQU   WKVOLLST+11
WKNXTTTR EQU   WKVOLST+252
@NM00138 EQU   WORKCLCA+684
TRTABLE  EQU   @NM00138
WKTMPCNM EQU   @NM00138+288
WKCL1ASV EQU   WORKCLCA+3480
WKSHRPRM EQU   WORKCLCA+3552
ACCCBP   EQU   WKSHRPRM
ACCRWP1  EQU   WKSHRPRM+4
ACCJSCBP EQU   WKSHRPRM+8
ACCCATP1 EQU   WKSHRPRM+12
ACCALSP1 EQU   WKSHRPRM+16
ACCDDNMP EQU   WKSHRPRM+20
ACCRWP2  EQU   WKSHRPRM+24
ACCCATP2 EQU   WKSHRPRM+28
ACCALSP2 EQU   WKSHRPRM+32
ACCRW    EQU   WKSHRPRM+36
ACCRETCD EQU   ACCRW
ACCCB    EQU   WKSHRPRM+40
ACAC6    EQU   ACCCB
@NM00005 EQU   CTGDDNM
CTGPROB  EQU   @NM00005
CTGREASN EQU   CTGPROB+2
CVTS01   EQU   CVTPGSIA
CVTLPDIA EQU   CVTS01+12
CVTDIRST EQU   CVTLPDIA
CVTSLIDA EQU   CVTS01+24
CVTCTLFG EQU   CVTS01+50
CVTRV210 EQU   CVTS01+424
CVTRV219 EQU   CVTS01+425
CVTRV228 EQU   CVTS01+426
CVTRV237 EQU   CVTS01+427
CVTMFRTR EQU   CVTS01+452
CVTRV262 EQU   CVTS01+468
CVTRV271 EQU   CVTS01+469
CVTRV280 EQU   CVTS01+470
CVTRV289 EQU   CVTS01+471
CVTGSDA  EQU   CVTS01+600
JSCBSEC2 EQU   JSCBEND1
JSCBSEC3 EQU   JSCBEND1
JSCBJCT  EQU   JSCBSEC3
JSCBJCTA EQU   JSCBJCT+1
JSCBPSCB EQU   JSCBSEC3+4
JSCBASID EQU   JSCBSEC3+8
JSCBFBYT EQU   JSCBSEC3+10
JSCBJNL  EQU   JSCBSEC3+28
JSCBJJSB EQU   JSCBJNL
JSCBSUB  EQU   JSCBSEC3+40
JSCSCT   EQU   JSCBSEC3+68
JSCBACT  EQU   JSCBSEC3+88
JSCRSV45 EQU   JSCBSEC3+112
JSCRSV46 EQU   JSCRSV45
JSCRSV47 EQU   JSCRSV45+2
PSARSVTE EQU   PSARSVT
RBSECS03 EQU   RBEP
RBCDE    EQU   RBSECS03
RBCDFLGS EQU   RBCDE
RBSECS05 EQU   RBPGMQ
RBSQE    EQU   RBSECS05
RBSECS06 EQU   RBPGMQ
RBIQE    EQU   RBSECS06
RBSECS07 EQU   RBPGMQ
RBIQE2   EQU   RBSECS07
RBSECS08 EQU   IRBEND
RBSECS09 EQU   IRBEND
TIOENTRY EQU   TIOT1+24
TIOESTTA EQU   TIOENTRY+1
TIOERLOC EQU   TIOENTRY+2
TIOELINK EQU   TIOERLOC+1
TIOESYOT EQU   TIOELINK
TIOESTTC EQU   TIOENTRY+15
TIOESTTB EQU   TIOENTRY+16
POOLSTAR EQU   TIOENTRY+20
TIOEDEVE EQU   TIOESTTB
TIOSTTB  EQU   TIOEDEVE
ENQPARMA EQU   WKSHRPRM
ENQDEQPL EQU   ENQPARMA+4
ENQRETCD EQU   ENQDEQPL+3
WKNEWCV  EQU   WKVOLST
WKALISNM EQU   WKNEWCV
DUMPLIST EQU   WKSHRPRM
DUMPHDR  EQU   WKCL1ASV
ALLZERO  EQU   ZEROPTR
USERKEY  EQU   ON
SVCKEY   EQU   OFF
SCROPTNS EQU   WKOPTNS
SCRTIOT  EQU   SCROPTNS+2
OS4      EQU   GL4
OS8      EQU   VS8
OS12     EQU   TWELVE
OS24     EQU   VS24
OS28     EQU   VS28
GL8      EQU   VS8
GL12     EQU   TWELVE
FLC      EQU   PSA
VS4      EQU   GL4
*                                      START UNREFERENCED COMPONENTS
@NM00155 EQU   SCROPTNS+2
@NM00154 EQU   SCROPTNS
DMPMSG   EQU   DUMPHDR+1
@NM00149 EQU   DUMPHDR
@NM00148 EQU   ENQDEQPL+4
@NM00147 EQU   ENQDEQPL
@NM00146 EQU   ENQPARMA
TIOUCBP  EQU   TIOEDEVE+1
TIOVERF  EQU   TIOSTTB
TIOUNLD  EQU   TIOSTTB
TIOMNTD  EQU   TIOSTTB
TIOSETU  EQU   TIOSTTB
TIOVLSR  EQU   TIOSTTB
TIOPVIO  EQU   TIOSTTB
TIOREQD  EQU   TIOSTTB
TIOUSED  EQU   TIOSTTB
TIOTFEND EQU   POOLSTAR+16
TIOPSLOT EQU   POOLSTAR+13
TIOPSTTB EQU   POOLSTAR+12
TIOPPOOL EQU   POOLSTAR+4
TIOPNSRT EQU   POOLSTAR+3
@NM00123 EQU   POOLSTAR+2
TIOPNSLT EQU   POOLSTAR+1
@NM00122 EQU   POOLSTAR
TIOEFSRT EQU   TIOENTRY+17
TIOSVERF EQU   TIOESTTB
TIOSUNLD EQU   TIOESTTB
TIOSMNTD EQU   TIOESTTB
TIOSSETU EQU   TIOESTTB
TIOSVLSR EQU   TIOESTTB
TIOSPVIO EQU   TIOESTTB
TIOSREQD EQU   TIOESTTB
TIOSUSED EQU   TIOESTTB
TIOSBALS EQU   TIOESTTC
TIOSBALP EQU   TIOESTTC
TIOSVOLS EQU   TIOESTTC
TIOSVOLP EQU   TIOESTTC
TIOSAFFS EQU   TIOESTTC
TIOSAFFP EQU   TIOESTTC
TIOSDEFR EQU   TIOESTTC
TIOSDKCR EQU   TIOESTTC
TIOEJFCB EQU   TIOENTRY+12
TIOEDDNM EQU   TIOENTRY+4
TIOTREM  EQU   TIOELINK
TIOESSDS EQU   TIOESYOT
TIOESYIN EQU   TIOELINK
TIOEQNAM EQU   TIOELINK
TIOEDYNM EQU   TIOELINK
TIOTTERM EQU   TIOELINK
TIOTRV01 EQU   TIOELINK
TIOSYOUT EQU   TIOELINK
TIOEWTCT EQU   TIOERLOC
TIOSDSP2 EQU   TIOESTTA
TIOSDSP1 EQU   TIOESTTA
TIOSLABL EQU   TIOESTTA
TIOSDADS EQU   TIOESTTA
TIOSJBLB EQU   TIOESTTA
TIOSPLTS EQU   TIOESTTA
TIOSPLTP EQU   TIOESTTA
TIOSLTYP EQU   TIOESTTA
TIOELNGH EQU   TIOENTRY
RBRSV161 EQU   RBSECS09+64
RBSIRBWA EQU   RBSECS09
RBIQEWRK EQU   RBSECS08+4
RBNEXAV  EQU   RBSECS08
RBIQEA   EQU   RBIQE2
RBIQE1   EQU   RBIQE+1
RBUSE    EQU   RBIQE
RBSQEA   EQU   RBSQE+1
@NM00073 EQU   RBSQE
RBCDE1   EQU   RBCDE+1
RBCDLOAD EQU   RBCDFLGS
RBCDXCTL EQU   RBCDFLGS
RBCDSYNC EQU   RBCDFLGS
RBCDNODE EQU   RBCDFLGS
RBCDSAVE EQU   RBCDFLGS
RBCDATCH EQU   RBCDFLGS
RBRSV009 EQU   RBCDFLGS
RBNOCELL EQU   RBCDFLGS
PSARSAV  EQU   PSARSVTE+60
PSARSTK  EQU   PSARSVTE+56
PSAESAV3 EQU   PSARSVTE+52
PSAESTK3 EQU   PSARSVTE+48
PSAESAV2 EQU   PSARSVTE+44
PSAESTK2 EQU   PSARSVTE+40
PSAESAV1 EQU   PSARSVTE+36
PSAESTK1 EQU   PSARSVTE+32
PSAPSAV  EQU   PSARSVTE+28
PSAPSTK  EQU   PSARSVTE+24
PSAMSAV  EQU   PSARSVTE+20
PSAMSTK  EQU   PSARSVTE+16
PSASSAV  EQU   PSARSVTE+12
PSASSTK  EQU   PSARSVTE+8
PSANSTK  EQU   PSARSVTE+4
PSACSTK  EQU   PSARSVTE
JSCBEND3 EQU   JSCBSEC3+120
JSCRSV52 EQU   JSCBSEC3+116
JSCRSV51 EQU   JSCRSV47+1
JSCRSV50 EQU   JSCRSV47
JSCRSV49 EQU   JSCRSV46+1
JSCRSV48 EQU   JSCRSV46
JSCRSV44 EQU   JSCBSEC3+108
JSCRSV43 EQU   JSCBSEC3+104
JSCRSV42 EQU   JSCBSEC3+100
JSCBASWA EQU   JSCBSEC3+96
JSCBUFPT EQU   JSCBSEC3+92
JSCBSWSP EQU   JSCBSEC3+87
JSCRSV33 EQU   JSCBSEC3+86
JSCDDNUM EQU   JSCBSEC3+84
JSCRSV53 EQU   JSCBSEC3+82
JSCDDNNO EQU   JSCBSEC3+80
JSCBVATA EQU   JSCBSEC3+76
JSCTMCOR EQU   JSCBSEC3+72
JSCSCTP  EQU   JSCSCT+1
JSCRSV55 EQU   JSCSCT
JSCRSV54 EQU   JSCBSEC3+64
JSCDSABQ EQU   JSCBSEC3+60
JSCBSSIB EQU   JSCBSEC3+56
JSCBFRBA EQU   JSCBSEC3+48
JSCRSV28 EQU   JSCBSEC3+46
JSCBSONO EQU   JSCBSEC3+44
JSCBSUBA EQU   JSCBSUB+1
JSCRSV31 EQU   JSCBSUB
JSCBSMLR EQU   JSCBSEC3+36
JSCBJNLR EQU   JSCBSEC3+32
JSCBJNLA EQU   JSCBJNL+1
JSCBJSBT EQU   JSCBJJSB
JSCBJSBX EQU   JSCBJJSB
JSCBJSBA EQU   JSCBJJSB
JSCBJSBI EQU   JSCBJJSB
@NM00017 EQU   JSCBJJSB
JSCBJNLE EQU   JSCBJJSB
JSCBJNLF EQU   JSCBJJSB
JSCBJNLN EQU   JSCBJJSB
@NM00016 EQU   JSCBSEC3+24
JSCBJRBA EQU   JSCBSEC3+16
JSCBIECB EQU   JSCBSEC3+12
JSCBRV08 EQU   JSCBSEC3+11
JSCBRV07 EQU   JSCBFBYT
JSCBRV06 EQU   JSCBFBYT
JSCBRV05 EQU   JSCBFBYT
JSCBRV04 EQU   JSCBFBYT
JSCBRV03 EQU   JSCBFBYT
JSCBRV02 EQU   JSCBFBYT
JSCBADSP EQU   JSCBFBYT
JSCBRV01 EQU   JSCBFBYT
JSCBTJID EQU   JSCBASID
JSCJCTP  EQU   JSCBJCTA
JSCRSV24 EQU   JSCBJCT
JSCBEND2 EQU   JSCBSEC2
CVTRV628 EQU   CVTS01+728
CVTRV627 EQU   CVTS01+724
CVTRV626 EQU   CVTS01+720
CVTRV625 EQU   CVTS01+716
CVTRV624 EQU   CVTS01+712
CVTRV623 EQU   CVTS01+708
CVTRV622 EQU   CVTS01+704
CVTRV621 EQU   CVTS01+700
CVTIHASU EQU   CVTS01+696
CVTRV619 EQU   CVTS01+692
CVTRV618 EQU   CVTS01+688
CVTRV617 EQU   CVTS01+684
CVTRV616 EQU   CVTS01+680
CVTRV615 EQU   CVTS01+676
CVTRV614 EQU   CVTS01+672
CVTRV613 EQU   CVTS01+668
CVTTCASP EQU   CVTS01+664
CVT0PT03 EQU   CVTS01+660
CVT0PT0E EQU   CVTS01+656
CVTRV609 EQU   CVTS01+652
CVTCGK   EQU   CVTS01+648
CVTRAC   EQU   CVTS01+644
CVTHSM   EQU   CVTS01+640
CVTRV605 EQU   CVTS01+636
CVTRV604 EQU   CVTS01+632
CVTEFF02 EQU   CVTS01+628
CVTCBBR  EQU   CVTS01+624
CVTSSCR  EQU   CVTS01+620
CVTEVENT EQU   CVTS01+616
CVTCRCA  EQU   CVTS01+612
CVTTPIO  EQU   CVTS01+608
CVTADV   EQU   CVTS01+604
CVTGSDAB EQU   CVTGSDA
CVTQV3   EQU   CVTS01+596
CVTQV2   EQU   CVTS01+592
CVTQV1   EQU   CVTS01+588
CVTRPT   EQU   CVTS01+584
CVTSSRB  EQU   CVTS01+580
CVTCSDRL EQU   CVTS01+576
CVTEXP1  EQU   CVTS01+572
CVTRMPMT EQU   CVTS01+568
CVTRMPTT EQU   CVTS01+564
CVTVPSA  EQU   CVTS01+560
CVTVSTOP EQU   CVTS01+556
CVTGTFR8 EQU   CVTS01+552
CVTQUIT  EQU   CVTS01+548
CVTVACR  EQU   CVTS01+544
CVTWTCB  EQU   CVTS01+540
CVTSTPRS EQU   CVTS01+536
CVT0PT02 EQU   CVTS01+532
CVTDARCM EQU   CVTS01+528
CVTIRECM EQU   CVTS01+524
CVTJRECM EQU   CVTS01+520
CVTVEMS0 EQU   CVTS01+516
CVTSPFRR EQU   CVTS01+512
CVTRLSTG EQU   CVTS01+508
CVT0TC0A EQU   CVTS01+504
CVTGMBR  EQU   CVTS01+500
CVTLFRM  EQU   CVTS01+496
CVTRMBR  EQU   CVTS01+492
CVTVIOP  EQU   CVTS01+488
CVTRV307 EQU   CVTS01+486
CVTRV306 EQU   CVTS01+484
CVTRV305 EQU   CVTS01+482
CVTRV304 EQU   CVTS01+480
CVTRV303 EQU   CVTS01+478
CVTRV302 EQU   CVTS01+476
CVTTRCA  EQU   CVTS01+472
CVTRV297 EQU   CVTRV289
CVTRV296 EQU   CVTRV289
CVTRV295 EQU   CVTRV289
CVTRV294 EQU   CVTRV289
CVTRV293 EQU   CVTRV289
CVTRV292 EQU   CVTRV289
CVTRV291 EQU   CVTRV289
CVTRV290 EQU   CVTRV289
CVTRV288 EQU   CVTRV280
CVTRV287 EQU   CVTRV280
CVTRV286 EQU   CVTRV280
CVTRV285 EQU   CVTRV280
CVTRV284 EQU   CVTRV280
CVTRV283 EQU   CVTRV280
CVTRV282 EQU   CVTRV280
CVTRV281 EQU   CVTRV280
CVTRV279 EQU   CVTRV271
CVTRV278 EQU   CVTRV271
CVTRV277 EQU   CVTRV271
CVTRV276 EQU   CVTRV271
CVTRV275 EQU   CVTRV271
CVTRV274 EQU   CVTRV271
CVTRV273 EQU   CVTRV271
CVTRV272 EQU   CVTRV271
CVTRV270 EQU   CVTRV262
CVTRV269 EQU   CVTRV262
CVTRV268 EQU   CVTRV262
CVTRV267 EQU   CVTRV262
CVTRV266 EQU   CVTRV262
CVTRV265 EQU   CVTRV262
CVTRV264 EQU   CVTRV262
CVTRV263 EQU   CVTRV262
CVTVFP   EQU   CVTS01+464
CVTVSI   EQU   CVTS01+460
CVTVPSIB EQU   CVTS01+456
CVTMFACT EQU   CVTMFRTR
CVTMFCTL EQU   CVTS01+448
CVTPVBP  EQU   CVTS01+444
CVTPWI   EQU   CVTS01+440
CVTRV254 EQU   CVTS01+438
CVTRV253 EQU   CVTS01+436
CVTRV252 EQU   CVTS01+434
CVTRV251 EQU   CVTS01+433
CVTRV250 EQU   CVTS01+432
CVTRV249 EQU   CVTS01+431
CVTRV248 EQU   CVTS01+430
CVTRV247 EQU   CVTS01+429
CVTRV246 EQU   CVTS01+428
CVTRV245 EQU   CVTRV237
CVTRV244 EQU   CVTRV237
CVTRV243 EQU   CVTRV237
CVTRV242 EQU   CVTRV237
CVTRV241 EQU   CVTRV237
CVTRV240 EQU   CVTRV237
CVTRV239 EQU   CVTRV237
CVTRV238 EQU   CVTRV237
CVTRV236 EQU   CVTRV228
CVTRV235 EQU   CVTRV228
CVTRV234 EQU   CVTRV228
CVTRV233 EQU   CVTRV228
CVTRV232 EQU   CVTRV228
CVTRV231 EQU   CVTRV228
CVTRV230 EQU   CVTRV228
CVTRV229 EQU   CVTRV228
CVTRV227 EQU   CVTRV219
CVTRV226 EQU   CVTRV219
CVTRV225 EQU   CVTRV219
CVTRV224 EQU   CVTRV219
CVTRV223 EQU   CVTRV219
CVTRV222 EQU   CVTRV219
CVTRV221 EQU   CVTRV219
CVTRV220 EQU   CVTRV219
CVTRV218 EQU   CVTRV210
CVTRV217 EQU   CVTRV210
CVTRV216 EQU   CVTRV210
CVTRV215 EQU   CVTRV210
CVTRV214 EQU   CVTRV210
CVTRV213 EQU   CVTRV210
CVTRV212 EQU   CVTRV210
CVTRV211 EQU   CVTRV210
CVTLCCAT EQU   CVTS01+420
CVTPCCAT EQU   CVTS01+416
CVTIPCRP EQU   CVTS01+412
CVTIPCRI EQU   CVTS01+408
CVTIPCDS EQU   CVTS01+404
CVTAIDVT EQU   CVTS01+400
CVTSSAP  EQU   CVTS01+396
CVTEHCIR EQU   CVTS01+392
CVTEHDEF EQU   CVTS01+388
CVTDAIR  EQU   CVTS01+384
CVTPERFM EQU   CVTS01+380
CVT044R2 EQU   CVTS01+376
CVTFETCH EQU   CVTS01+372
CVTRSTWD EQU   CVTS01+368
CVTSPOST EQU   CVTS01+364
CVTIOBP  EQU   CVTS01+360
CVTASMVT EQU   CVTS01+356
CVTRECRQ EQU   CVTS01+352
CVTWSAC  EQU   CVTS01+348
CVTRV149 EQU   CVTS01+344
CVTWSAL  EQU   CVTS01+340
CVTSPSA  EQU   CVTS01+336
CVTGLMN  EQU   CVTS01+332
CVTVEAC0 EQU   CVTS01+328
CVT062R1 EQU   CVTS01+324
CVTRPOST EQU   CVTS01+320
CVTDQIQE EQU   CVTS01+316
CVTCSD   EQU   CVTS01+312
CVTLKRMA EQU   CVTS01+308
CVTRSPIE EQU   CVTS01+304
CVTRENQ  EQU   CVTS01+300
CVTLQCB  EQU   CVTS01+296
CVTFQCB  EQU   CVTS01+292
CVTQCS01 EQU   CVTS01+288
CVTAPFT  EQU   CVTS01+284
CVTPARRL EQU   CVTS01+280
CVTVWAIT EQU   CVTS01+276
CVTGSPL  EQU   CVTS01+272
CVTLSMQ  EQU   CVTS01+268
CVTGSMQ  EQU   CVTS01+264
CVTEXPRO EQU   CVTS01+260
CVTOPCTP EQU   CVTS01+256
CVTSIC   EQU   CVTS01+252
CVTTPIOS EQU   CVTS01+248
CVTRTMS  EQU   CVTS01+244
CVTSDBF  EQU   CVTS01+240
CVTSCBP  EQU   CVTS01+236
CVTSDMP  EQU   CVTS01+232
CVTSV60  EQU   CVTS01+228
CVTRTMCT EQU   CVTS01+224
CVTASCBL EQU   CVTS01+220
CVTASCBH EQU   CVTS01+216
CVTGDA   EQU   CVTS01+212
CVTASVT  EQU   CVTS01+208
CVTVVMDI EQU   CVTS01+204
CVTAQTOP EQU   CVTS01+200
CVTIOSCS EQU   CVTS01+196
CVTSDRM  EQU   CVTS01+192
CVTOPTE  EQU   CVTS01+188
CVTSTXU  EQU   CVTS01+184
CVTQUIS  EQU   CVTS01+180
CVTPARS  EQU   CVTS01+176
CVTS1EE  EQU   CVTS01+172
CVTFRAS  EQU   CVTS01+168
CVTQSAS  EQU   CVTS01+164
CVTCRAS  EQU   CVTS01+160
CVTCRMN  EQU   CVTS01+156
CVTDELCP EQU   CVTS01+152
CVTFRECL EQU   CVTS01+148
CVTGETCL EQU   CVTS01+144
CVTBLDCP EQU   CVTS01+140
CVTAUTHL EQU   CVTS01+136
CVTSCAN  EQU   CVTS01+132
CVTRV144 EQU   CVTS01+130
CVTMAXMP EQU   CVTS01+128
CVTSTCK  EQU   CVTS01+124
CVTRV139 EQU   CVTS01+123
CVTDSSAC EQU   CVTS01+122
CVTRV513 EQU   CVTS01+121
CVTIOSPL EQU   CVTS01+120
CVTPTGT  EQU   CVTS01+116
CVTCSPIE EQU   CVTS01+112
CVTSMFEX EQU   CVTS01+108
CVTOLT0A EQU   CVTS01+104
CVTSRBRT EQU   CVTS01+100
CVTPUTL  EQU   CVTS01+96
CVTASCRL EQU   CVTS01+92
CVTASCRF EQU   CVTS01+88
CVTRV326 EQU   CVTS01+84
CVTRV325 EQU   CVTS01+80
CVTRV324 EQU   CVTS01+76
CVT0VL01 EQU   CVTS01+72
CVTSHRVM EQU   CVTS01+68
CVTRV332 EQU   CVTS01+64
CVTTAS   EQU   CVTS01+60
CVTRSCN  EQU   CVTS01+56
CVTTRAC2 EQU   CVTS01+54
CVTTRACE EQU   CVTS01+52
CVTAPG   EQU   CVTS01+51
CVTSDTRC EQU   CVTCTLFG
CVTGTRCE EQU   CVTCTLFG
CVTNOMP  EQU   CVTCTLFG
CVTRSV79 EQU   CVTCTLFG
CVTDSTAT EQU   CVTCTLFG
CVTRSV78 EQU   CVTCTLFG
CVTRV333 EQU   CVTCTLFG
CVTRV323 EQU   CVTCTLFG
CVTSPVLK EQU   CVTS01+49
CVTRSV77 EQU   CVTS01+48
CVTRV331 EQU   CVTS01+44
CVTRV330 EQU   CVTS01+40
CVTRV329 EQU   CVTS01+36
CVTRV328 EQU   CVTS01+32
CVTRV322 EQU   CVTS01+28
CVTSLID  EQU   CVTSLIDA+1
CVTSYLK  EQU   CVTSLIDA
CVTRV321 EQU   CVTS01+20
CVTRV320 EQU   CVTS01+16
CVTLPDIR EQU   CVTLPDIA+1
CVTRSV69 EQU   CVTDIRST
CVTRSV68 EQU   CVTDIRST
CVTRSV67 EQU   CVTDIRST
CVTRSV66 EQU   CVTDIRST
CVTRSV65 EQU   CVTDIRST
CVTRSV64 EQU   CVTDIRST
CVTRSV63 EQU   CVTDIRST
CVTDICOM EQU   CVTDIRST
CVTPVTP  EQU   CVTS01+8
CVTLPDSR EQU   CVTS01+4
CVTGETL  EQU   CVTS01
CTGREAS2 EQU   CTGREASN+1
CTGREAS1 EQU   CTGREASN
CTGMODID EQU   CTGPROB
@NM00145 EQU   WKSHRPRM+42
ACAC12   EQU   ACCCB+1
@NM00144 EQU   ACCCB+1
ACAC10   EQU   ACCCB+1
@NM00143 EQU   ACCCB+1
ACAC8    EQU   ACCCB+1
@NM00142 EQU   ACCCB
ACAC5    EQU   ACCCB
@NM00141 EQU   ACCCB
ACAC3    EQU   ACCCB
@NM00140 EQU   ACCCB
ACCRESCD EQU   ACCRW+2
@NM00139 EQU   WORKCLCA+3478
ESTAELST EQU   @NM00138+272
LKNM     EQU   @NM00138+264
LKDP     EQU   @NM00138+260
LKNP     EQU   @NM00138+256
@NM00137 EQU   WORKCLCA+681
@NM00136 EQU   WKVOLST+255
@NM00135 EQU   WKVOLLST
@NM00134 EQU   WORKCLCA+397
SLEMPTY  EQU   SLFLAGS
@NM00133 EQU   WORKCLCA+272
SAVER12  EQU   WORKCLCA+268
SAVER11  EQU   WORKCLCA+264
SAVER10  EQU   WORKCLCA+260
SAVER6   EQU   WORKCLCA+256
SAVER3   EQU   WORKCLCA+248
XSAVAREA EQU   WORKCLCA+144
REG13SAV EQU   WORKCLCA+116
SVRBSAV  EQU   WORKCLCA+108
@NM00132 EQU   WORKCLCA+98
@NM00131 EQU   WORKCLCA
@NM00153 EQU   WKSTDNM+16
@NM00152 EQU   WKUNIQUE+7
@NM00151 EQU   WKUNIQUE
@NM00150 EQU   WKSTDNM
GENCNT   EQU   GIPE+14
@NM00130 EQU   GIPE+11
GENTTR   EQU   GIPE+8
@NM00129 EQU   GIPE
@NM00128 EQU   CAMVOLST+2
CAMCVOLP EQU   CAMLSTD+8
CAMGEN   EQU   CAMOPTNS+3
CAMSLOC  EQU   CAMOPTN3
CAMSLOCB EQU   CAMOPTN3
CAMEMPTY EQU   CAMOPTN3
@NM00127 EQU   CAMOPTN3
CAMDELET EQU   CAMOPTN3
CAMDLTX  EQU   CAMOPTN2
CAMBLDG  EQU   CAMOPTN2
CAMBLDX  EQU   CAMOPTN2
@NM00126 EQU   CAMOPTN1
@NM00125 EQU   CAMOPTN1
CAMUCAT  EQU   CAMOPTN1
@NM00124 EQU   CAMOPTN1
CAMCVOL  EQU   CAMOPTN1
TIOCSTEP EQU   TIOT1+8
TIOCNJOB EQU   TIOT1
@NM00121 EQU   SDWA+512
SDWAVRA  EQU   SDWARA+4
SDWAURAL EQU   SDWARA+3
@NM00120 EQU   SDWADPVA
SDWAEBC  EQU   SDWADPVA
SDWAHEX  EQU   SDWADPVA
SDWAVRAL EQU   SDWARA
@NM00119 EQU   SDWA+396
SDWACOMP EQU   SDWA+392
SDWARCPL EQU   SDWA+364
@NM00118 EQU   SDWADPSA+32
SDWATO4  EQU   SDWADPSL+28
SDWAFRM4 EQU   SDWADPSL+24
SDWATO3  EQU   SDWADPSL+20
SDWAFRM3 EQU   SDWADPSL+16
SDWATO2  EQU   SDWADPSL+12
SDWAFRM2 EQU   SDWADPSL+8
SDWATO1  EQU   SDWADPSL+4
SDWAFRM1 EQU   SDWADPSL
@NM00117 EQU   SDWADDAT+3
@NM00116 EQU   SDWAPDAT
SDWAUSPL EQU   SDWAPDAT
SDWADPSW EQU   SDWAPDAT
SDWATJPA EQU   SDWAPDAT
SDWATLPA EQU   SDWAPDAT
SDWADREG EQU   SDWAPDAT
SDWADSAH EQU   SDWAPDAT
SDWADSAS EQU   SDWAPDAT
@NM00115 EQU   SDWADDAT+1
@NM00114 EQU   SDWASDAT
SDWAQQS  EQU   SDWASDAT
SDWACBS  EQU   SDWASDAT
SDWAGTF  EQU   SDWASDAT
SDWASWA  EQU   SDWASDAT
SDWALSQA EQU   SDWASDAT
SDWASQA  EQU   SDWASDAT
SDWANUC  EQU   SDWASDAT
@NM00113 EQU   SDWADUMP+2
@NM00112 EQU   SDWADPFS
SDWASLST EQU   SDWADPFS
@NM00111 EQU   SDWADPFS
SDWADLST EQU   SDWADPFS
SDWADPT  EQU   SDWADPFS
SDWADPID EQU   SDWADUMP
SDWADPLA EQU   SDWA+316
SDWAREXN EQU   SDWARECP+16
SDWACSCT EQU   SDWARECP+8
SDWAMODN EQU   SDWARECP
@NM00110 EQU   SDWALKWA+32
SDWATALW EQU   SDWALKWS+28
SDWATDLW EQU   SDWALKWS+24
SDWATNLW EQU   SDWALKWS+20
SDWAAPLW EQU   SDWALKWS+16
SDWAIPLW EQU   SDWALKWS+12
SDWAILLW EQU   SDWALKWS+8
SDWAIULW EQU   SDWALKWS+4
SDWAICLW EQU   SDWALKWS
SDWAFLLK EQU   SDWAACF4
SDWACMS  EQU   SDWAACF4
SDWAOPTM EQU   SDWAACF4
SDWATADB EQU   SDWAACF4
SDWATDNB EQU   SDWAACF4
SDWATNCB EQU   SDWAACF4
SDWAILCH EQU   SDWAACF4
SDWAIUCB EQU   SDWAACF4
SDWAICAT EQU   SDWAACF3
SDWAIPRG EQU   SDWAACF3
SDWASALL EQU   SDWAACF3
SDWAASMP EQU   SDWAACF3
SDWADISP EQU   SDWAACF3
@NM00109 EQU   SDWAACF3
@NM00108 EQU   SDWAACF2
SDWAFREE EQU   SDWAACF2
SDWAUPRG EQU   SDWAACF2
@NM00107 EQU   SDWAACF2
SDWASPIN EQU   SDWAACF2
@NM00106 EQU   SDWAACF2
SDWALCPU EQU   SDWACPUA+2
@NM00105 EQU   SDWACPUA
SDWARECA EQU   SDWA+244
SDWARTYA EQU   SDWA+240
@NM00104 EQU   SDWA+239
@NM00103 EQU   SDWAIOFS
SDWANIOP EQU   SDWAIOFS
SDWANOIO EQU   SDWAIOFS
SDWAIOHT EQU   SDWAIOFS
SDWAIOQR EQU   SDWAIOFS
SDWAFMID EQU   SDWA+236
@NM00102 EQU   SDWAERRD
SDWAMCIV EQU   SDWAERRD
SDWARPIV EQU   SDWAERRD
SDWAMABD EQU   SDWAERRD
SDWACTS  EQU   SDWAERRD
SDWASTAE EQU   SDWAERRD
SDWANRBE EQU   SDWAERRD
SDWACLUP EQU   SDWAERRD
@NM00101 EQU   SDWAERRC
SDWAEAS  EQU   SDWAERRC
SDWAIRB  EQU   SDWAERRC
SDWASTAI EQU   SDWAERRC
SDWASTAF EQU   SDWAERRC
SDWASRBM EQU   SDWAERRB
SDWALDIS EQU   SDWAERRB
SDWAENRB EQU   SDWAERRB
SDWATYP1 EQU   SDWAERRB
@NM00100 EQU   SDWAERRB
SDWAPGIO EQU   SDWAERRA
SDWATEXC EQU   SDWAERRA
SDWASVCE EQU   SDWAERRA
SDWAABTM EQU   SDWAERRA
SDWASVCD EQU   SDWAERRA
SDWARKEY EQU   SDWAERRA
SDWAPCHK EQU   SDWAERRA
SDWAMCHK EQU   SDWAERRA
SDWATIME EQU   SDWAMCH+20
SDWARFSA EQU   SDWAMCH+16
@NM00099 EQU   SDWAMCH+14
SDWAVEQR EQU   SDWARSR2
SDWAPGFX EQU   SDWARSR2
SDWAFLSQ EQU   SDWARSR2
SDWAFSQA EQU   SDWARSR2
SDWANUCL EQU   SDWARSR2
SDWASPER EQU   SDWARSR2
SDWAINTC EQU   SDWARSR2
SDWAOFLN EQU   SDWARSR2
SDWACHNG EQU   SDWARSR1
SDWAMSER EQU   SDWARSR1
@NM00098 EQU   SDWARSR1
SDWACPID EQU   SDWAMCH+10
SDWATERR EQU   SDWAMCHD
SDWAFPRX EQU   SDWAMCHD
SDWAINSF EQU   SDWAMCHD
SDWAACR  EQU   SDWAMCHD
SDWASCK  EQU   SDWAMCHD
SDWAPSWU EQU   SDWAMCHD
SDWAREGU EQU   SDWAMCHD
SDWASKYF EQU   SDWAMCHD
@NM00097 EQU   SDWAMCHS
SDWARSRF EQU   SDWAMCHS
SDWARSRC EQU   SDWAMCHS
SDWAINVP EQU   SDWAMCHS
SDWATSVL EQU   SDWAMCHS
SDWARCDF EQU   SDWAMCHS
SDWASRVL EQU   SDWAMCHS
SDWASCKE EQU   SDWASTCK+4
SDWASCKB EQU   SDWASTCK
SDWALNTH EQU   SDWAIDNT+1
SDWASPID EQU   SDWAIDNT
SDWASR15 EQU   SDWASRSV+60
SDWASR14 EQU   SDWASRSV+56
SDWASR13 EQU   SDWASRSV+52
SDWASR12 EQU   SDWASRSV+48
SDWASR11 EQU   SDWASRSV+44
SDWASR10 EQU   SDWASRSV+40
SDWASR09 EQU   SDWASRSV+36
SDWASR08 EQU   SDWASRSV+32
SDWASR07 EQU   SDWASRSV+28
SDWASR06 EQU   SDWASRSV+24
SDWASR05 EQU   SDWASRSV+20
SDWASR04 EQU   SDWASRSV+16
SDWASR03 EQU   SDWASRSV+12
SDWASR02 EQU   SDWASRSV+8
SDWASR01 EQU   SDWASRSV+4
SDWASR00 EQU   SDWASRSV
SDWATRN2 EQU   SDWAAEC2+4
SDWAIPC2 EQU   SDWAICD2
SDWAIMC2 EQU   SDWAICD2
SDWAIPR2 EQU   SDWAICD2
@NM00096 EQU   SDWAINC2
@NM00095 EQU   SDWAILC2
SDWAIL2  EQU   SDWAILC2
@NM00094 EQU   SDWAILC2
@NM00093 EQU   SDWAAEC2
SDWAADD2 EQU   SDWANXT2+1
@NM00092 EQU   SDWANXT2
@NM00091 EQU   SDWAEC2+3
SDWASGN2 EQU   SDWAINT2
SDWAEXP2 EQU   SDWAINT2
SDWADEC2 EQU   SDWAINT2
SDWAFPO2 EQU   SDWAINT2
SDWACC2  EQU   SDWAINT2
@NM00090 EQU   SDWAINT2
SDWAPGM2 EQU   SDWAMWP2
SDWAWAT2 EQU   SDWAMWP2
SDWAMCK2 EQU   SDWAMWP2
SDWAECT2 EQU   SDWAMWP2
SDWAKEY2 EQU   SDWAMWP2
SDWAEXT2 EQU   SDWAEMK2
SDWAIO2  EQU   SDWAEMK2
SDWATRM2 EQU   SDWAEMK2
@NM00089 EQU   SDWAEMK2
SDWAPER2 EQU   SDWAEMK2
@NM00088 EQU   SDWAEMK2
SDWATRAN EQU   SDWAAEC1+4
SDWAIPC1 EQU   SDWAICD1
SDWAIMC1 EQU   SDWAICD1
SDWAIPR1 EQU   SDWAICD1
@NM00087 EQU   SDWAINC1
@NM00086 EQU   SDWAILC1
SDWAIL1  EQU   SDWAILC1
@NM00085 EQU   SDWAILC1
@NM00084 EQU   SDWAAEC1
SDWAADD1 EQU   SDWANXT1+1
@NM00083 EQU   SDWANXT1
@NM00082 EQU   SDWAEC1+3
SDWASGN1 EQU   SDWAINT1
SDWAEXP1 EQU   SDWAINT1
SDWADEC1 EQU   SDWAINT1
SDWAFPO1 EQU   SDWAINT1
SDWACC1  EQU   SDWAINT1
@NM00081 EQU   SDWAINT1
SDWAPGM1 EQU   SDWAMWP1
SDWAWAT1 EQU   SDWAMWP1
SDWAMCK1 EQU   SDWAMWP1
SDWAECT1 EQU   SDWAMWP1
SDWAKEY1 EQU   SDWAMWP1
SDWAEXT1 EQU   SDWAEMK1
SDWAIO1  EQU   SDWAEMK1
SDWATRM1 EQU   SDWAEMK1
@NM00080 EQU   SDWAEMK1
SDWAPER1 EQU   SDWAEMK1
@NM00079 EQU   SDWAEMK1
SDWAIOBR EQU   SDWA+100
SDWAEPA  EQU   SDWA+96
@NM00078 EQU   SDWANAME+4
SDWARBAD EQU   SDWANAME
SDWAGR15 EQU   SDWAGRSV+60
SDWAGR14 EQU   SDWAGRSV+56
SDWAGR13 EQU   SDWAGRSV+52
SDWAGR12 EQU   SDWAGRSV+48
SDWAGR11 EQU   SDWAGRSV+44
SDWAGR10 EQU   SDWAGRSV+40
SDWAGR09 EQU   SDWAGRSV+36
SDWAGR08 EQU   SDWAGRSV+32
SDWAGR07 EQU   SDWAGRSV+28
SDWAGR06 EQU   SDWAGRSV+24
SDWAGR05 EQU   SDWAGRSV+20
SDWAGR04 EQU   SDWAGRSV+16
SDWAGR03 EQU   SDWAGRSV+12
SDWAGR02 EQU   SDWAGRSV+8
SDWAGR01 EQU   SDWAGRSV+4
SDWAGR00 EQU   SDWAGRSV
SDWANXTP EQU   SDWACTL2+5
SDWASGP  EQU   SDWAPMKP
SDWAEUP  EQU   SDWAPMKP
SDWADOP  EQU   SDWAPMKP
SDWAFPP  EQU   SDWAPMKP
SDWACCP  EQU   SDWAPMKP
SDWAILP  EQU   SDWAPMKP
SDWAINTP EQU   SDWACTL2+2
SDWASPVP EQU   SDWAMWPP
SDWAWATP EQU   SDWAMWPP
SDWAMCKP EQU   SDWAMWPP
@NM00077 EQU   SDWAMWPP
SDWAKEYP EQU   SDWAMWPP
SDWAEXTP EQU   SDWACMKP
SDWAIOP  EQU   SDWACMKP
SDWANXTA EQU   SDWACTL1+5
SDWASGA  EQU   SDWAPMKA
SDWAEUA  EQU   SDWAPMKA
SDWADOA  EQU   SDWAPMKA
SDWAFPA  EQU   SDWAPMKA
SDWACCA  EQU   SDWAPMKA
SDWAILA  EQU   SDWAPMKA
SDWAINTA EQU   SDWACTL1+2
SDWASPVA EQU   SDWAMWPA
SDWAWATA EQU   SDWAMWPA
SDWAMCKA EQU   SDWAMWPA
@NM00076 EQU   SDWAMWPA
SDWAKEYA EQU   SDWAMWPA
SDWAEXTA EQU   SDWACMKA
SDWAIOA  EQU   SDWACMKA
@NM00075 EQU   SDWACMPF
SDWASTCC EQU   SDWACMPF
@NM00074 EQU   SDWACMPF
SDWASTEP EQU   SDWACMPF
SDWAPARM EQU   SDWA
SIRBEND  EQU   RBSECT+168
SVRBEND  EQU   RBSECT+168
RBRSV158 EQU   RBRSV150
RBRSV157 EQU   RBRSV150
RBRSV156 EQU   RBRSV150
RBRSV155 EQU   RBRSV150
RBRSV154 EQU   RBRSV150
RBRSV153 EQU   RBRSV150
RBRSV152 EQU   RBRSV150
RBRSV151 EQU   RBRSV150
RBRSV149 EQU   RBSECT+166
RBRSV148 EQU   RBSECT+164
RBSCBB   EQU   RBSECT+144
TIRBEND  EQU   @NM00072+8
PRBEND   EQU   @NM00072+8
RBRSV146 EQU   RBRSV138
RBRSV145 EQU   RBRSV138
RBRSV144 EQU   RBRSV138
RBRSV143 EQU   RBRSV138
RBRSV142 EQU   RBRSV138
RBRSV141 EQU   RBRSV138
RBRSV140 EQU   RBRSV138
RBRSV139 EQU   RBRSV138
RBRSV137 EQU   @NM00072+6
RBRSV136 EQU   @NM00072+4
RBRSV135 EQU   @NM00072
@NM00071 EQU   RBSECT+32
@NM00070 EQU   @NM00068+1
@NM00069 EQU   @NM00068
RBPGMQ1  EQU   RBPGMQ+1
@NM00067 EQU   RBPGMQ
@NM00066 EQU   RBSECT+16
@NM00065 EQU   @NM00061
@NM00064 EQU   @NM00061
RBIQETP  EQU   @NM00061
RBUSIQE  EQU   RBETXR
RBATTN   EQU   @NM00061
@NM00063 EQU   @NM00061
@NM00062 EQU   @NM00061
RBPMSVRB EQU   @NM00059
RBATNXIT EQU   @NM00059
@NM00060 EQU   @NM00059
RBWAITP  EQU   @NM00059
RBFNSVRB EQU   RBTRSVRB
RBFTP    EQU   @NM00059
RBSIZE   EQU   RBSECT+8
RBABOPSW EQU   RBSECT+4
RBPPSAV1 EQU   RBPPSAV+1
@NM00057 EQU   RBPPSAV
RBPRFXND EQU   RBPREFIX+64
RBINTCOD EQU   RBINTCDA+1
RBINLNTH EQU   RBINTCDA
RBWCSA   EQU   RBPREFIX+60
RBRSV004 EQU   RBPREFIX+57
RBSSSYN  EQU   RBFLAGS1
RBSCB    EQU   RBFLAGS1
RBLONGWT EQU   RBFLAGS1
RBASIR   EQU   RBFLAGS1
RBRSV159 EQU   RBFLAGS1
RBABEND  EQU   RBFLAGS1
RBXWAIT  EQU   RBFLAGS1
RBSLOCK  EQU   RBFLAGS1
RBRTRAN  EQU   RBRTPSW2+4
RBRTINCD EQU   RBRTICIL+2
RBRTILC  EQU   RBRTICIL+1
RBRSV160 EQU   RBRTICIL
RBRTPSW1 EQU   RBRTOPSW
RBRSV062 EQU   RBRSV054
RBRSV061 EQU   RBRSV054
RBRSV060 EQU   RBRSV054
RBRSV059 EQU   RBRSV054
RBRSV058 EQU   RBRSV054
RBRSV057 EQU   RBRSV054
RBRSV056 EQU   RBRSV054
RBRSV055 EQU   RBRSV054
RBRSV053 EQU   RBPREFIX+38
RBRSV052 EQU   RBPREFIX+36
RBRSV051 EQU   RBPREFIX+32
RBPRFXST EQU   RBPREFIX+32
RBRSV050 EQU   RBPREFIX+28
RBRSV049 EQU   RBRSV041
RBRSV048 EQU   RBRSV041
RBRSV047 EQU   RBRSV041
RBRSV046 EQU   RBRSV041
RBRSV045 EQU   RBRSV041
RBRSV044 EQU   RBRSV041
RBRSV043 EQU   RBRSV041
RBRSV042 EQU   RBRSV041
RBRSV040 EQU   RBPREFIX+26
RBRSV039 EQU   RBPREFIX+24
RBRSV038 EQU   RBPREFIX+20
RBRSV037 EQU   RBPREFIX+16
RBRSV036 EQU   RBRSV028
RBRSV035 EQU   RBRSV028
RBRSV034 EQU   RBRSV028
RBRSV033 EQU   RBRSV028
RBRSV032 EQU   RBRSV028
RBRSV031 EQU   RBRSV028
RBRSV030 EQU   RBRSV028
RBRSV029 EQU   RBRSV028
RBRSV027 EQU   RBRSV019
RBRSV026 EQU   RBRSV019
RBRSV025 EQU   RBRSV019
RBRSV024 EQU   RBRSV019
RBRSV023 EQU   RBRSV019
RBRSV022 EQU   RBRSV019
RBRSV021 EQU   RBRSV019
RBRSV020 EQU   RBRSV019
RBRSV018 EQU   RBPREFIX+13
RBRSV017 EQU   RBPREFIX+12
RBSRV016 EQU   RBPREFIX+11
RBRSV015 EQU   RBPREFIX+10
RBRSV014 EQU   RBPREFIX+8
RBRSV013 EQU   RBPREFIX+4
RBRSV012 EQU   RBPREFIX
RBEXSAVE EQU   XRBESA
XRBREG15 EQU   RBGRS15
XRBREG14 EQU   RBGRS14
XRBREG13 EQU   RBGRS13
XRBREG12 EQU   RBGRS12
XRBREG11 EQU   RBGRS11
XRBREG10 EQU   RBGRS10
XRBREG9  EQU   RBGRS9
XRBREG8  EQU   RBGRS8
XRBREG7  EQU   RBGRS7
XRBREG6  EQU   RBGRS6
XRBREG5  EQU   RBGRS5
XRBREG4  EQU   RBGRS4
XRBREG3  EQU   RBGRS3
XRBREG2  EQU   RBGRS2
XRBREG1  EQU   RBGRS1
XRBREG0  EQU   RBGRS0
XRBLNKA  EQU   RBLINKB
XRBWT    EQU   RBWCF
@NM00056 EQU   RBBASIC+24
RBOPSWPS EQU   RBOPSWB2
@NM00055 EQU   RBOPSWB2
@NM00054 EQU   XRBPSW
@NM00053 EQU   RBBASIC+12
XRBWAIT  EQU   RBECBWT
XRBFRRB  EQU   RBFDYN
@NM00052 EQU   XSTAB2
XRBACTV  EQU   RBFACTV
XRBTCBP  EQU   RBTCBNXT
@NM00051 EQU   XSTAB1
XRBCKPT  EQU   RBFTCKPT
@NM00050 EQU   XSTAB1
@NM00049 EQU   RBBASIC+8
@NM00048 EQU   RBEXRTNM+1
RBTMIND3 EQU   RBTMFLD
RBTMIND2 EQU   RBTMFLD
RBTMCMP  EQU   RBTMFLD
RBWLIM   EQU   RBTMFLD
RBRSV005 EQU   RBTMFLD
RBTMTOD  EQU   RBTMFLD
RBTMQUE  EQU   RBTMFLD
@NM00047 EQU   RBPRFX
PCCRSVD2 EQU   IEFPCCB+128
PCCLACBP EQU   IEFPCCB+124
PCCRSVD1 EQU   IEFPCCB+122
PCCTGCON EQU   IEFPCCB+72
PCCDDNAM EQU   IEFPCCB+20
PCCSTAT4 EQU   PCCSTATS+3
PCCSTAT3 EQU   PCCSTATS+2
PCCSTAT2 EQU   PCCSTATS+1
@NM00046 EQU   PCCSTAT1
PCCTCL   EQU   PCCSTAT1
PCCALIAS EQU   PCCSTAT1
PCCSTEPC EQU   PCCSTAT1
PCCPREVP EQU   IEFPCCB+8
PCCACRO  EQU   IEFPCCB
PSCBU    EQU   PSCB+64
PSCBRSZ  EQU   PSCB+60
PSCBLINE EQU   PSCB+59
PSCBCHAR EQU   PSCB+58
PSCBUPTL EQU   PSCB+56
PSCBUPT  EQU   PSCB+52
PSCBRLGB EQU   PSCB+48
PSCBDEST EQU   PSCB+40
@NM00045 EQU   PSCB+36
@NM00044 EQU   PSCB+32
PSCBSOUT EQU   PSCB+31
PSCBSUBM EQU   PSCB+30
PSCBSUBC EQU   PSCB+29
PSCBSUBH EQU   PSCB+28
PSCBLTI2 EQU   PSCB+24
PSCBLTIM EQU   PSCB+20
PSCBATR2 EQU   PSCB+18
@NM00043 EQU   PSCBATR1
@NM00042 EQU   PSCBATR1
PSCBRCVR EQU   PSCBATR1
PSCBATTN EQU   PSCBATR1
PSCBJCL  EQU   PSCBATR1
PSCBACCT EQU   PSCBATR1
PSCBCTRL EQU   PSCBATR1
PSCBGPNM EQU   PSCB+8
PSCBUSRL EQU   PSCB+7
PSCBUSER EQU   PSCB
ASCBEND  EQU   ASCB+208
ASCBSRBT EQU   ASCB+200
ASCBSWTL EQU   ASCB+196
ASCBRS14 EQU   ASCB+195
ASCBSMCT EQU   ASCB+194
ASCBRS12 EQU   ASCB+192
ASCBPCTT EQU   ASCB+188
ASCBVGTT EQU   ASCB+184
ASCBLGCB EQU   ASCB+180
ASCBJBNS EQU   ASCB+176
ASCBJBNI EQU   ASCB+172
ASCBMCC  EQU   ASCB+168
ASCBRTWA EQU   ASCB+164
ASCBIQEA EQU   ASCB+160
ASCBXMPQ EQU   ASCB+156
ASCBRS01 EQU   ASCB+154
ASCBFMCT EQU   ASCB+152
ASCBOUXB EQU   ASCB+148
ASCBOUCB EQU   ASCB+144
ASCBMECB EQU   ASCB+140
ASCBQECB EQU   ASCB+136
ASCBCMSB EQU   ASCB+132
ASCBCMSF EQU   ASCB+128
ASCBTCBS EQU   ASCB+124
ASCBNVSC EQU   ASCB+122
ASCBVSC  EQU   ASCB+120
ASCBSRBS EQU   ASCB+118
ASCBSSRB EQU   ASCB+116
ASCBRV06 EQU   ASCBFLG2
ASCBRV05 EQU   ASCBFLG2
ASCBRV04 EQU   ASCBFLG2
ASCBSNQS EQU   ASCBFLG2
ASCBS2S  EQU   ASCBFLG2
ASCBCEXT EQU   ASCBFLG2
ASCBPXMT EQU   ASCBFLG2
ASCBXMPT EQU   ASCBFLG2
ASCBRF07 EQU   ASCBDSP1
ASCBRF06 EQU   ASCBDSP1
ASCBRF05 EQU   ASCBDSP1
ASCBRF04 EQU   ASCBDSP1
ASCBRF03 EQU   ASCBDSP1
ASCBRF02 EQU   ASCBDSP1
ASCBFAIL EQU   ASCBDSP1
ASCBNOQ  EQU   ASCBDSP1
ASCBSWCT EQU   ASCB+112
ASCBASXB EQU   ASCB+108
ASCBTMCH EQU   ASCB+104
ASCBNSWP EQU   ASCBFLG1
ASCBTYP1 EQU   ASCBFLG1
ASCBSTND EQU   ASCBFLG1
ASCBABNT EQU   ASCBFLG1
ASCBTERM EQU   ASCBFLG1
ASCBS3S  EQU   ASCBFLG1
ASCBCMSH EQU   ASCBFLG1
ASCBTOFF EQU   ASCBFLG1
ASCBRF01 EQU   ASCBRCTF
ASCBTMLW EQU   ASCBRCTF
ASCBOUT  EQU   ASCBRCTF
ASCBWAIT EQU   ASCBRCTF
ASCBRV08 EQU   ASCBRCTF
ASCBFQU  EQU   ASCBRCTF
ASCBFRS  EQU   ASCBRCTF
ASCBTMNO EQU   ASCBRCTF
ASCBAFFN EQU   ASCBFW1
ASCBDUMP EQU   ASCB+96
ASCBQSVC EQU   ASCB+92
ASCBUBET EQU   ASCB+88
ASCBECB  EQU   ASCB+84
ASCBJSTL EQU   ASCB+80
ASCBEWST EQU   ASCB+72
ASCBEJST EQU   ASCB+64
ASCBCSCB EQU   ASCB+56
ASCBRSM  EQU   ASCB+52
ASCBLDA  EQU   ASCB+48
ASCBSTOR EQU   ASCB+44
ASCBDP   EQU   ASCB+43
ASCBRV07 EQU   ASCB+42
ASCBIOSM EQU   ASCB+40
ASCBSEQN EQU   ASCB+38
ASCBASID EQU   ASCB+36
ASCBCPUS EQU   ASCB+32
ASCBSPL  EQU   ASCB+28
ASCBLSLQ EQU   ASCB+24
ASCBFSLQ EQU   ASCB+20
ASCBIOSP EQU   ASCB+16
ASCBLOCK EQU   ASCB+12
ASCBBWDP EQU   ASCB+8
ASCBFWDP EQU   ASCB+4
ASCBASCB EQU   ASCB
ASCBEGIN EQU   ASCB
JSCBCSCB EQU   JSCBSEC1+68
JSCBPMG  EQU   JSCBWTP+2
JSCBWTSP EQU   JSCBWTP+1
JSCRSV23 EQU   JSCBWTFG
JSCRSV22 EQU   JSCBWTFG
JSCRSV21 EQU   JSCBWTFG
JSCRSV20 EQU   JSCBWTFG
JSCRSV19 EQU   JSCBWTFG
JSCRSV18 EQU   JSCBWTFG
JSCBRET  EQU   JSCBWTFG
JSCBIOFG EQU   JSCBWTFG
@NM00015 EQU   JSCBSEC1+60
JSCBQMPI EQU   JSCBSEC1+56
JSCBPMSG EQU   JSCBSWT1
JSCRSV16 EQU   JSCBSWT1
JSCRSV15 EQU   JSCBSWT1
JSCRSV14 EQU   JSCBSWT1
JSCRSV13 EQU   JSCBSWT1
JSCRSV12 EQU   JSCBSWT1
JSCRSV11 EQU   JSCBSWT1
JSCBPASS EQU   JSCBSWT1
JSCBTTTR EQU   JSCBSEC1+52
JSCRSV10 EQU   JSCBSEC1+49
JSCBAUTH EQU   JSCBOPTS
JSCSIOTS EQU   JSCBOPTS
JSCRSV08 EQU   JSCBOPTS
JSCRSV07 EQU   JSCBOPTS
JSCRSV06 EQU   JSCBOPTS
JSCBLONG EQU   JSCBOPTS
JSCRSV05 EQU   JSCBOPTS
JSCRSV04 EQU   JSCBOPTS
JSCBSECB EQU   JSCBSEC1+44
JSCRSV03 EQU   JSCBSEC1+41
JSCBSTEP EQU   JSCBSEC1+40
JSCBDCBA EQU   JSCBDCB+1
JSCRSV02 EQU   JSCBDCB
JSCBID   EQU   JSCBSEC1+32
JSCBDBTB EQU   JSCBSEC1+28
JSCBIJSC EQU   JSCBSEC1+24
JSCBTCP  EQU   JSCBSEC1+12
JSCBSHR  EQU   JSCBSEC1+8
JSCHPCEA EQU   JSCHPCE+1
JSCRSV32 EQU   JSCHPCE
JSCRSV01 EQU   JSCBSEC1
@NM00014 EQU   IEZJSCB
CVTLEVL  EQU   CVTRELNO+2
CVTNUMB  EQU   CVTRELNO
CVTMDL   EQU   CVTFIX+250
@NM00013 EQU   CVTFIX+248
@NM00012 EQU   CVTFIX
CVTRV482 EQU   CVTXTNT2+128
CVTRV481 EQU   CVTXTNT2+124
CVTRV480 EQU   CVTXTNT2+120
CVTRV479 EQU   CVTXTNT2+118
CVTRV478 EQU   CVTXTNT2+117
CVTRV477 EQU   CVTXTNT2+116
CVTRV476 EQU   CVTXTNT2+115
CVTRV475 EQU   CVTXTNT2+114
CVTRV474 EQU   CVTRV466
CVTRV473 EQU   CVTRV466
CVTRV472 EQU   CVTRV466
CVTRV471 EQU   CVTRV466
CVTRV470 EQU   CVTRV466
CVTRV469 EQU   CVTRV466
CVTRV468 EQU   CVTRV466
CVTRV467 EQU   CVTRV466
CVTRV465 EQU   CVTRV457
CVTRV464 EQU   CVTRV457
CVTRV463 EQU   CVTRV457
CVTRV462 EQU   CVTRV457
CVTRV461 EQU   CVTRV457
CVTRV460 EQU   CVTRV457
CVTRV459 EQU   CVTRV457
CVTRV458 EQU   CVTRV457
CVTRV456 EQU   CVTXTNT2+108
CVTRV455 EQU   CVTXTNT2+104
CVTRV454 EQU   CVTXTNT2+100
CVTRV453 EQU   CVTXTNT2+96
CVTRV452 EQU   CVTXTNT2+94
CVTRV451 EQU   CVTXTNT2+92
CVTRV450 EQU   CVTXTNT2+90
CVTRV449 EQU   CVTXTNT2+88
CVTRV448 EQU   CVTXTNT2+87
CVTRV447 EQU   CVTXTNT2+86
CVTRV446 EQU   CVTRV438
CVTRV445 EQU   CVTRV438
CVTRV444 EQU   CVTRV438
CVTRV443 EQU   CVTRV438
CVTRV442 EQU   CVTRV438
CVTRV441 EQU   CVTRV438
CVTRV440 EQU   CVTRV438
CVTRV439 EQU   CVTRV438
CVTRV437 EQU   CVTRV429
CVTRV436 EQU   CVTRV429
CVTRV435 EQU   CVTRV429
CVTRV434 EQU   CVTRV429
CVTRV433 EQU   CVTRV429
CVTRV432 EQU   CVTRV429
CVTRV431 EQU   CVTRV429
CVTRV430 EQU   CVTRV429
CVTRV428 EQU   CVTXTNT2+80
CVTRV427 EQU   CVTXTNT2+76
CVTRV426 EQU   CVTXTNT2+72
CVTRV425 EQU   CVTXTNT2+68
CVTATACT EQU   CVTATCVT
CVTRV423 EQU   CVTXTNT2+62
CVTRV422 EQU   CVTXTNT2+60
CVTRV421 EQU   CVTXTNT2+58
CVTRV420 EQU   CVTXTNT2+56
CVTRV419 EQU   CVTXTNT2+55
CVTRV418 EQU   CVTXTNT2+54
CVTRV417 EQU   CVTRV409
CVTRV416 EQU   CVTRV409
CVTRV415 EQU   CVTRV409
CVTRV414 EQU   CVTRV409
CVTRV413 EQU   CVTRV409
CVTRV412 EQU   CVTRV409
CVTRV411 EQU   CVTRV409
CVTRV410 EQU   CVTRV409
CVTRV408 EQU   CVTRV400
CVTRV407 EQU   CVTRV400
CVTRV406 EQU   CVTRV400
CVTRV405 EQU   CVTRV400
CVTRV404 EQU   CVTRV400
CVTRV403 EQU   CVTRV400
CVTRV402 EQU   CVTRV400
CVTRV401 EQU   CVTRV400
CVTICB   EQU   CVTXTNT2+48
CVTSKTA  EQU   CVTXTNT2+44
CVTCCVT  EQU   CVTXTNT2+40
CVTRSV98 EQU   CVTXTNT2+36
CVTRSV97 EQU   CVTXTNT2+34
CVTRSV96 EQU   CVTXTNT2+32
CVTOLTEP EQU   CVTXTNT2+28
CVTQIDA  EQU   CVTQID+1
CVTRSV95 EQU   CVTQID
CVTRSV94 EQU   CVTXTNT2+20
CVTRSV93 EQU   CVTXTNT2+16
CVTRSV92 EQU   CVTXTNT2+12
CVTDEBVR EQU   CVTXTNT2+8
CVTRSV91 EQU   CVTXTNT2+6
CVTRSV9H EQU   CVTFLGBT
CVTRSV9G EQU   CVTFLGBT
CVTRSV9F EQU   CVTFLGBT
CVTRSV9E EQU   CVTFLGBT
CVTRSV9D EQU   CVTFLGBT
CVTRSV9C EQU   CVTFLGBT
CVTVME   EQU   CVTFLGBT
CVTNPE   EQU   CVTFLGBT
CVTNUCLS EQU   CVTXTNT2+4
CVTDSSVA EQU   CVTDSSV+1
CVTRSV89 EQU   CVTDSSV
CVTRSV88 EQU   CVTXTNT1+8
CVTRSV87 EQU   CVTXTNT1+4
CVTFACHN EQU   CVTXTNT1
CVTRV488 EQU   CVTMAP+412
CVTRV487 EQU   CVTMAP+408
CVTRV486 EQU   CVTMAP+404
CVTRV485 EQU   CVTMAP+400
CVTACTAP EQU   CVTMAP+396
CVTAUTH  EQU   CVTMAP+392
CVTATMCA EQU   CVTATMCT+1
CVTATMST EQU   CVTATMCT
CVTRSV61 EQU   CVTMAP+384
CVTVOLT1 EQU   CVTVOLM1+1
CVTVOLI1 EQU   CVTVOLF1
CVTSTOA  EQU   CVTMAP+376
CVTRSV58 EQU   CVTMAP+374
CVTRSV57 EQU   CVTMAP+372
CVTDDCE  EQU   CVTMAP+368
CVTPNWFR EQU   CVTMAP+364
CVTSMF   EQU   CVTMAP+360
CVTSULK  EQU   CVTMAP+358
CVTSLKO  EQU   CVTSYSK
CVTSLKP  EQU   CVTSYSK
CVTSLKQ  EQU   CVTSYSK
CVTSLKR  EQU   CVTSYSK
CVTRSV56 EQU   CVTSYSK
CVTRSV55 EQU   CVTSYSK
CVTRSV54 EQU   CVTSYSK
CVTRSV53 EQU   CVTSYSK
CVTRSV52 EQU   CVTA1F1
CVTRSV51 EQU   CVTA1F1
CVTRSV50 EQU   CVTA1F1
CVTRSV49 EQU   CVTA1F1
CVTRSV48 EQU   CVTA1F1
CVTRSV47 EQU   CVTA1F1
CVTSRSW  EQU   CVTA1F1
CVTPFSW  EQU   CVTA1F1
CVTPCVT  EQU   CVTMAP+352
CVTRSV46 EQU   CVTMAP+344
CVTRSV45 EQU   CVTMAP+340
CVTRSV44 EQU   CVTMAP+338
CVTRSV43 EQU   CVTMAP+336
CVTHJESA EQU   CVTHJES+1
CVTRSV42 EQU   CVTHJES
CVTEXT2A EQU   CVTEXT2+1
CVTRSV41 EQU   CVTEXT2
CVTAPFA  EQU   CVTAPF+1
CVTRSV40 EQU   CVTAPF
CVTRV518 EQU   CVTINTLA
CVTRV517 EQU   CVTERPV
CVTEORM  EQU   CVTMAP+312
CVTMCHPR EQU   CVTMAP+308
CVTTZ    EQU   CVTMAP+304
CVTJEPS  EQU   CVTMAP+300
CVTJESCT EQU   CVTMAP+296
CVTMODE  EQU   CVTMAP+292
CVTPTRV  EQU   CVTMAP+288
CVTREAL  EQU   CVTMAP+284
CVTRSV39 EQU   CVTMAP+280
CVTRSV38 EQU   CVTMAP+276
CVTDMSRA EQU   CVTDMSR+1
CVTRV634 EQU   CVTDMSRF
CVTRV633 EQU   CVTDMSRF
CVTRV632 EQU   CVTDMSRF
CVTRV631 EQU   CVTDMSRF
CVTRV630 EQU   CVTDMSRF
CVTRV629 EQU   CVTDMSRF
CVTUDUMP EQU   CVTDMSRF
CVTSDUMP EQU   CVTDMSRF
CVTQMSGA EQU   CVTQMSG+1
CVTRSV36 EQU   CVTQMSG
CVTAMFF  EQU   CVTMAP+264
CVTPURGA EQU   CVTPURG+1
CVTRSV35 EQU   CVTPURG
CVTCBSP  EQU   CVTMAP+256
CVTATERA EQU   CVTATER+1
CVTSYST  EQU   CVTATER
CVTVOLT2 EQU   CVTTAT
CVTVOLI2 EQU   CVTVOLF2
CVTAQAVB EQU   CVTAQAVT+1
CVTRSV34 EQU   CVTTCMFG
CVTRSV33 EQU   CVTTCMFG
CVTRSV32 EQU   CVTTCMFG
CVTRSV31 EQU   CVTTCMFG
CVTRSV30 EQU   CVTTCMFG
CVTRSV29 EQU   CVTTCMFG
CVTRSV28 EQU   CVTTCMFG
CVTTCRDY EQU   CVTTCMFG
CVTGTFA  EQU   CVTGTF+1
CVTRSV27 EQU   CVTGTFST
CVTRNIO  EQU   CVTGTFST
CVTUSR   EQU   CVTGTFST
CVTRV318 EQU   CVTFORM
CVTRV317 EQU   CVTTMODE
CVTRV316 EQU   CVTSTATE
CVTRV315 EQU   CVTGTFS
CVTGTFAV EQU   CVTGTFS
CVT0SCR1 EQU   CVTMAP+232
CVTRV515 EQU   CVTMAP+228
CVTRMS   EQU   CVTMAP+224
CVTPATCH EQU   CVTMAP+220
CVTTSCE  EQU   CVTMAP+216
CVTLNKSC EQU   CVTMAP+214
CVTQABST EQU   CVTMAP+212
CVTMDLDS EQU   CVTMAP+208
CVTUSER  EQU   CVTMAP+204
CVTABEND EQU   CVTMAP+200
CVTSMCA  EQU   CVTMAP+196
CVTRSV18 EQU   CVTMAP+192
CVTQLPAQ EQU   CVTMAP+188
CVTQCDSR EQU   CVTMAP+184
CVTRSV17 EQU   CVTOPTB
CVTRSV16 EQU   CVTOPTB
CVTFP    EQU   CVTOPTB
CVTAPTHR EQU   CVTOPTB
CVTNLOG  EQU   CVTOPTB
CVTTOD   EQU   CVTOPTB
CVTCTIMS EQU   CVTOPTB
CVTPROT  EQU   CVTOPTB
CVTXPFP  EQU   CVTOPTA
CVTASCII EQU   CVTOPTA
CVTRSV13 EQU   CVTOPTA
CVTRSV12 EQU   CVTOPTA
CVTNIP   EQU   CVTOPTA
CVTDDR   EQU   CVTOPTA
CVTAPR   EQU   CVTOPTA
CVTCCH   EQU   CVTOPTA
CVTSNCTR EQU   CVTMAP+180
CVTQMWR  EQU   CVTMAP+176
CVTQOCR  EQU   CVTMAP+172
CVT1EF00 EQU   CVTMAP+168
CVTMZ00  EQU   CVTMAP+164
CVTSV76Q EQU   CVTSV76C
CVTRSV11 EQU   CVTMAP+156
CVT0PT01 EQU   CVTMAP+152
CVTMSER  EQU   CVTMAP+148
CVTRV516 EQU   CVTIERLC
CVTILCH  EQU   CVTMAP+140
CVT0DS   EQU   CVTMAP+136
CVTFBOSV EQU   CVTMAP+132
CVTNUCB  EQU   CVTMAP+128
CVTIXAVL EQU   CVTMAP+124
CVTSV76M EQU   CVTIOQET
CVTDCBA  EQU   CVTMAP+117
CVTMVS2  EQU   CVTDCB
CVT6DAT  EQU   CVTDCB
CVT4MPS  EQU   CVTDCB
CVTRSV09 EQU   CVTDCB
CVT4MS1  EQU   CVTDCB
CVT2SPS  EQU   CVTDCB
CVT1SSS  EQU   CVTDCB
CVTRSV08 EQU   CVTDCB
CVTSTB   EQU   CVTMAP+112
CVTQTD00 EQU   CVTMAP+108
CVTQTE00 EQU   CVTMAP+104
CVTCUCB  EQU   CVTMAP+100
CVTSJQ   EQU   CVTMAP+96
CVTPBLDL EQU   CVTMAP+92
CVTTPC   EQU   CVTMAP+88
CVTSVDCB EQU   CVTMAP+84
CVTBRET  EQU   CVTMAP+82
CVTEXIT  EQU   CVTMAP+80
CVT0FN00 EQU   CVTMAP+76
CVTDARA  EQU   CVTDAR+1
CVTRSV07 EQU   CVTFLGS1
CVTRSV06 EQU   CVTFLGS1
CVTRSV05 EQU   CVTFLGS1
CVTRSV04 EQU   CVTFLGS1
CVTRSV03 EQU   CVTFLGS1
CVTRSV02 EQU   CVTFLGS1
CVTRSV01 EQU   CVTFLGS1
CVTDMPLK EQU   CVTFLGS1
CVTXITP  EQU   CVTMAP+68
CVTZDTAB EQU   CVTMAP+64
CVTMSLT  EQU   CVTMAP+60
CVTDATE  EQU   CVTMAP+56
CVTBTERM EQU   CVTMAP+52
CVTSYSAD EQU   CVTMAP+48
CVTXTLER EQU   CVTMAP+44
CVTILK2  EQU   CVTMAP+40
CVTILK1  EQU   CVTMAP+36
CVTPRLTV EQU   CVTMAP+32
CVTPCNVT EQU   CVTMAP+28
CVT0VL00 EQU   CVTMAP+24
CVTXAPG  EQU   CVTMAP+20
CVTBUF   EQU   CVTMAP+16
CVTJOB   EQU   CVTMAP+12
CVTLINK  EQU   CVTMAP+8
CVT0EF00 EQU   CVTMAP+4
CVTTCBP  EQU   CVTMAP
CVT      EQU   CVTMAP
@NM00011 EQU   TCBXTNT2+32
TCBRV181 EQU   TCBRV173
TCBRV180 EQU   TCBRV173
TCBRV179 EQU   TCBRV173
TCBRV178 EQU   TCBRV173
TCBRV177 EQU   TCBRV173
TCBRV176 EQU   TCBRV173
TCBRV175 EQU   TCBRV173
TCBRV174 EQU   TCBRV173
TCBRV172 EQU   TCBRV164
TCBRV171 EQU   TCBRV164
TCBRV170 EQU   TCBRV164
TCBRV169 EQU   TCBRV164
TCBRV168 EQU   TCBRV164
TCBRV167 EQU   TCBRV164
TCBRV166 EQU   TCBRV164
TCBRV165 EQU   TCBRV164
TCBRV163 EQU   TCBRV155
TCBRV162 EQU   TCBRV155
TCBRV161 EQU   TCBRV155
TCBRV160 EQU   TCBRV155
TCBRV159 EQU   TCBRV155
TCBRV158 EQU   TCBRV155
TCBRV157 EQU   TCBRV155
TCBRV156 EQU   TCBRV155
TCBRV154 EQU   TCBRV146
TCBRV153 EQU   TCBRV146
TCBRV152 EQU   TCBRV146
TCBRV151 EQU   TCBRV146
TCBRV150 EQU   TCBRV146
TCBRV149 EQU   TCBRV146
TCBRV148 EQU   TCBRV146
TCBRV147 EQU   TCBRV146
TCBRV145 EQU   TCBXTNT2+26
TCBRV144 EQU   TCBXTNT2+24
TCBCAUF  EQU   TCBXTNT2+20
TCBRV142 EQU   TCBXTNT2+16
TCBRSV49 EQU   TCBXTNT2+12
TCBEVENT EQU   TCBXTNT2+8
TCBRCMP  EQU   TCBXTNT2+5
TCBRSVAB EQU   TCBXTNT2+4
TCBGTFA  EQU   TCBGTF+1
TCBRSV47 EQU   TCBTFLG
TCBRSV46 EQU   TCBTFLG
TCBRSV45 EQU   TCBTFLG
TCBRSV44 EQU   TCBTFLG
TCBRSV43 EQU   TCBTFLG
TCBDSPIT EQU   TCBTFLG
TCBERRTN EQU   TCBTFLG
TCBASYNC EQU   TCBTFLG
@NM00010 EQU   TCB+296
TCBSVCA2 EQU   TCB+292
TCBSWASA EQU   TCB+288
TCBDBTB  EQU   TCB+284
TCBRPT   EQU   TCB+280
TCBRV141 EQU   TCBRV133
TCBRV140 EQU   TCBRV133
TCBRV139 EQU   TCBRV133
TCBRV138 EQU   TCBRV133
TCBRV137 EQU   TCBRV133
TCBRV136 EQU   TCBRV133
TCBRV135 EQU   TCBRV133
TCBRV134 EQU   TCBRV133
TCBRV132 EQU   TCBRV124
TCBRV131 EQU   TCBRV124
TCBRV130 EQU   TCBRV124
TCBRV129 EQU   TCBRV124
TCBRV128 EQU   TCBRV124
TCBRV127 EQU   TCBRV124
TCBRV126 EQU   TCBRV124
TCBRV125 EQU   TCBRV124
TCBRV123 EQU   TCBFBYT2
TCBRV122 EQU   TCBFBYT2
TCBECBNV EQU   TCBFBYT2
TCBSSSYN EQU   TCBFBYT2
TCBFPRAP EQU   TCBFBYT2
TCBFDW   EQU   TCBFBYT2
TCBFMW   EQU   TCBFBYT2
TCBCNCB  EQU   TCBFBYT2
TCBLLH   EQU   TCBFBYT1
TCBRV113 EQU   TCBFBYT1
TCBEOT   EQU   TCBFBYT1
TCBRTM2  EQU   TCBFBYT1
TCBPGNLY EQU   TCBFBYT1
TCBNDIOS EQU   TCBFBYT1
TCBACTIV EQU   TCBFBYT1
TCBEOTFM EQU   TCBFBYT1
TCBAFFN  EQU   TCB+274
TCBCCPVI EQU   TCB+272
TCBUKYSP EQU   TCB+268
TCBMODE  EQU   TCBESTAE+3
TCBERTYP EQU   TCBESTAE+2
TCBRV314 EQU   TCBESTRM
TCBRV313 EQU   TCBESTRM
TCBRV312 EQU   TCBESTRM
TCBRV311 EQU   TCBESTRM
TCBRV310 EQU   TCBESTRM
TCBRV309 EQU   TCBESTRM
TCBRV308 EQU   TCBESTRM
TCBETERM EQU   TCBESTRM
TCBSCBKY EQU   TCBESTAE
TCBRTM12 EQU   TCB+260
TCBTCBID EQU   TCB+256
TCBRSV96 EQU   TCB+252
TCBSWA   EQU   TCB+248
TCBFOEA  EQU   TCBFOE+1
TCBRSV42 EQU   TCBFOE
TCBRV306 EQU   TCB+240
TCBRSV41 EQU   TCB+239
TCBTID   EQU   TCB+238
TCBRSVAA EQU   TCB+237
TCBABCUR EQU   TCB+236
TCBTMSAV EQU   TCB+232
TCBIOTIM EQU   TCB+228
TCBRTWA  EQU   TCB+224
TCBBACK  EQU   TCB+220
TCBTIRB  EQU   TCB+216
TCBAECB  EQU   TCB+212
TCBEXT2A EQU   TCBEXT2+1
TCBRSV39 EQU   TCBEXT2
TCBSTMCT EQU   TCB+207
TCBSYSCT EQU   TCB+206
TCBRSV37 EQU   TCB+205
TCBEXSVC EQU   TCBDAR
TCBDARMS EQU   TCBDAR
TCBDARWT EQU   TCBDAR
TCBDARO  EQU   TCBDAR
TCBDARMC EQU   TCBDARC
TCBDARD  EQU   TCBDAR
TCBDARS  EQU   TCBDAR
TCBDARP  EQU   TCBDAR
TCBGTOFM EQU   TCBFLGS7
TCBADMP  EQU   TCBFLGS7
TCBRSTSK EQU   TCBFLGS7
TCBSVCS  EQU   TCBFLGS7
TCBSTACK EQU   TCBFLGS7
TCBRSV34 EQU   TCBFLGS7
TCBRSV33 EQU   TCBFLGS7
TCBGPECB EQU   TCBFLGS7
TCBNTJS  EQU   TCBFLGS6
TCBAPG   EQU   TCBFLGS6
TCBMIGR  EQU   TCBFLGS6
TCBRV303 EQU   TCBFLGS6
TCBSPVLK EQU   TCBFLGS6
TCBCPU   EQU   TCBFLGS6
TCBPIE17 EQU   TCBFLGS6
TCBRV    EQU   TCBFLGS6
TCBRSV79 EQU   TCBNDSP5
TCBRSV78 EQU   TCBNDSP5
TCBRSV77 EQU   TCBNDSP5
TCBRSV76 EQU   TCBNDSP5
TCBRSV75 EQU   TCBNDSP5
TCBRSV74 EQU   TCBNDSP5
TCBRSV95 EQU   TCBNDSP5
TCBRSV94 EQU   TCBNDSP5
TCBRSV93 EQU   TCBNDSP4
TCBRSV92 EQU   TCBNDSP4
TCBRSV91 EQU   TCBNDSP4
TCBRSV90 EQU   TCBNDSP4
TCBRSV89 EQU   TCBNDSP4
TCBRSV88 EQU   TCBNDSP4
TCBRSV87 EQU   TCBNDSP4
TCBRSV86 EQU   TCBNDSP4
TCBEXT1A EQU   TCBEXT1+1
TCBRSV32 EQU   TCBEXT1
TCBEXCPD EQU   TCB+192
TCBIOBRC EQU   TCB+188
TCBDDWTC EQU   TCB+186
TCBDDEXC EQU   TCB+184
TCBJSCBB EQU   TCBJSCB+1
@NM00009 EQU   TCBRECDE
TCBREC   EQU   TCBRECDE
TCBMDIDS EQU   TCB+176
TCBNDINT EQU   TCBNDSP3
TCBRSV27 EQU   TCBNDSP3
TCBRSV26 EQU   TCBNDSP3
TCBRSV25 EQU   TCBNDSP3
TCBRSV24 EQU   TCBNDSP3
TCBSRBND EQU   TCBNDSP3
TCBRV302 EQU   TCBNDSP3
TCBLJSND EQU   TCBNDSP3
TCBABE   EQU   TCBNDSP2
TCBDSS   EQU   TCBNDSP2
TCBOWAIT EQU   TCBNDSP2
TCBIWAIT EQU   TCBNDSP2
TCBNDTS  EQU   TCBNDSP2
TCBNDSVC EQU   TCBNDSP2
TCBSTPP  EQU   TCBNDSP2
TCBABD   EQU   TCBNDSP2
TCBRSV22 EQU   TCBNDSP1
TCBPIEND EQU   TCBNDSP1
TCBTPSP  EQU   TCBNDSP1
TCBDDRND EQU   TCBNDSP1
TCBRSPND EQU   TCBNDSP1
TCBRSTND EQU   TCBNDSP1
TCBDARPN EQU   TCBNDSP1
TCBDARTN EQU   TCBNDSP1
TCBNDSP0 EQU   TCBNDSP
TCBUSER  EQU   TCB+168
TCBTCTB  EQU   TCBTCT+1
TCBRSV9C EQU   TCBTCTGF
TCBRSV9B EQU   TCBTCTGF
TCBRSV9A EQU   TCBTCTGF
TCBRSV99 EQU   TCBTCTGF
TCBRSV98 EQU   TCBTCTGF
TCBRSV97 EQU   TCBTCTGF
TCBRSV20 EQU   TCBTCTGF
TCBSMFGF EQU   TCBTCTGF
TCBSTABB EQU   TCBSTAB+1
TCBSTCUR EQU   TCBNSTAE
TCBRV301 EQU   TCBNSTAE
TCBSYNCH EQU   TCBNSTAE
TCBHALT  EQU   TCBNSTAE
TCBPPSUP EQU   TCBNSTAE
TCB33E   EQU   TCBNSTAE
TCBQUIES EQU   TCBNSTAE
TCBSTABE EQU   TCBNSTAE
TCBAQE   EQU   TCB+156
TCBPQE   EQU   TCB+152
TCBTSDP  EQU   TCB+151
TCBTSLP  EQU   TCB+150
TCBSTPCT EQU   TCB+149
TCBCPUBN EQU   TCBTSFLG
TCBDYDSP EQU   TCBTSFLG
TCBRSV18 EQU   TCBTSFLG
TCBRSV17 EQU   TCBTSFLG
TCBTIOTG EQU   TCBTSFLG
TCBATT   EQU   TCBTSFLG
TCBSTPPR EQU   TCBTSFLG
TCBRV300 EQU   TCBTSTSK
TCBECB   EQU   TCB+144
TCBIQE   EQU   TCB+140
TCBLTC   EQU   TCB+136
TCBOTC   EQU   TCB+132
TCBNTC   EQU   TCB+128
TCBJSTCA EQU   TCBJSTCB+1
TCBRSV16 EQU   TCBJSTCB
TCBTQET  EQU   TCBTME
TCBTCB   EQU   TCB+116
TCBFSAB  EQU   TCBFSA+1
TCBQEL   EQU   TCBFSA
TCBGRS15 EQU   TCBGRS+60
TCBGRS14 EQU   TCBGRS+56
TCBGRS13 EQU   TCBGRS+52
TCBGRS12 EQU   TCBGRS+48
TCBGRS11 EQU   TCBGRS+44
TCBGRS10 EQU   TCBGRS+40
TCBGRS9  EQU   TCBGRS+36
TCBGRS8  EQU   TCBGRS+32
TCBGRS7  EQU   TCBGRS+28
TCBGRS6  EQU   TCBGRS+24
TCBGRS5  EQU   TCBGRS+20
TCBGRS4  EQU   TCBGRS+16
TCBGRS3  EQU   TCBGRS+12
TCBGRS2  EQU   TCBGRS+8
TCBGRS1  EQU   TCBGRS+4
TCBGRS0  EQU   TCBGRS
TCBJPQB  EQU   TCBJPQ+1
TCBRSV15 EQU   TCBPURGE
TCBRSV14 EQU   TCBPURGE
TCBRSV13 EQU   TCBPURGE
TCBRSV12 EQU   TCBPURGE
TCBRSV11 EQU   TCBPURGE
TCBRSV10 EQU   TCBPURGE
TCBRSV09 EQU   TCBPURGE
TCBJPQF  EQU   TCBPURGE
TCBJLB   EQU   TCB+40
TCBLLS   EQU   TCB+36
TCBDSP   EQU   TCB+35
TCBLMP   EQU   TCB+34
TCBPNDSP EQU   TCBFLGS5
TCBFCD1  EQU   TCBFLGS5
TCBSTP   EQU   TCBFLGS5
TCBSYS   EQU   TCBFLGS5
TCBANDSP EQU   TCBFLGS5
TCBPAGE  EQU   TCBFLGS5
TCBUXNDF EQU   TCBABWF
TCBFC    EQU   TCBFLGS5
TCBONDSP EQU   TCBFLGS4
TCBMPCND EQU   TCBFLGS4
TCBMPCVQ EQU   TCBFLGS4
TCBUXNDV EQU   TCBFLGS4
TCBHNDSP EQU   TCBFLGS4
TCBRQENA EQU   TCBFLGS4
TCBSER   EQU   TCBFLGS4
TCBNDUMP EQU   TCBFLGS4
TCBDWSTA EQU   TCBFLGS3
TCBRSV08 EQU   TCBFLGS3
TCBRSV07 EQU   TCBFLGS3
TCBRSV06 EQU   TCBFLGS3
TCBABGM  EQU   TCBFLGS3
TCBABTRM EQU   TCBFLGS3
TCBADINP EQU   TCBFLGS3
TCBFSM   EQU   TCBFLGS3
TCBFTS   EQU   TCBFLGS2
TCBFETXR EQU   TCBFLGS2
TCBFDSOP EQU   TCBFLGS2
TCBFJMC  EQU   TCBFLGS2
TCBFSMC  EQU   TCBFLGS2
TCBFABOP EQU   TCBFLGS2
TCBFSTI  EQU   TCBFLGS2
TCBFOINP EQU   TCBFLGS2
TCBFX    EQU   TCBFLGS1
TCBFS    EQU   TCBFLGS1
TCBFT    EQU   TCBFLGS1
TCBPDUMP EQU   TCBFLGS1
TCBNONPR EQU   TCBFLGS1
TCBFERA  EQU   TCBFLGS1
TCBFE    EQU   TCBFLGS1
TCBFA    EQU   TCBFLGS1
TCBZERO  EQU   TCBPKF
TCBFLAG  EQU   TCBPKF
TCBMSSB  EQU   TCBMSS+1
TCBRSV03 EQU   TCBMSS
TCBTRNB  EQU   TCBTRN+1
TCBRSV02 EQU   TCBABF
TCBOLTEP EQU   TCBABF
TCBTCP   EQU   TCBABF
TCBTCPP  EQU   TCBABF
TCBRSV01 EQU   TCBABF
TCBGRPH  EQU   TCBABF
TCBNOCHK EQU   TCBABF
TCBMOD91 EQU   TCBABF
TCBCMPC  EQU   TCBCMP+1
TCBRV318 EQU   TCBCMSG
TCBRV317 EQU   TCBCIND
TCBRV316 EQU   TCBCWTO
TCBCASID EQU   TCBCDBL
TCBNOCC  EQU   TCBSTCC
TCBDMPO  EQU   TCBCPP
TCBCSTEP EQU   TCBCMPF
TCBCREQ  EQU   TCBCMPF
TCBDEB   EQU   TCB+8
TCBPIEA  EQU   TCBPIE+1
TCBPM    EQU   TCBPMASK
@NM00008 EQU   TCBPMASK
TCBFRS6  EQU   TCBFRS+24
TCBFRS4  EQU   TCBFRS+16
TCBFRS2  EQU   TCBFRS+8
TCBFRS0  EQU   TCBFRS
CTGFLDWA EQU   CTGFL+4
CTGFLDTS EQU   CTGFLDRE
@NM00007 EQU   CTGFLDRE
CTGFLDGC EQU   CTGFL+2
CTGFLDCD EQU   CTGFL+1
CTGFLDNO EQU   CTGFL
CTGCVDEV EQU   CTGCVDSN
@NM00006 EQU   CTGVLX
CTGPSWD  EQU   CTGJSCB
@NM00004 EQU   CTGFBFLG
CTGKEEP  EQU   CTGFBFLG
CTGPAR   EQU   CTGFBFLG
@NM00003 EQU   CTGDSORG
CTGFVT   EQU   CTGENT
@NM00002 EQU   CTGOPTN4
CTGBYPMT EQU   CTGOPTN4
CTGCOIN  EQU   CTGOPTN4
CTGNPROF EQU   CTGOPTN4
CTGAM0   EQU   CTGOPTN3
CTGNUM   EQU   CTGOPTN3
@NM00001 EQU   CTGOPTN2
CTGOVRID EQU   CTGOPTN2
CTGDISC  EQU   CTGOPTN2
CTGUCRAX EQU   CTGGTNXT
CTGSWAP  EQU   CTGRCATN
CTGGTALL EQU   CTGREL
CTGNSVS  EQU   CTGEXT
CTGNAME  EQU   CTGOPTN1
CTGREAD  EQU   CTGOPTN1
CTGUPD   EQU   CTGOPTN1
CTGCI    EQU   CTGOPTN1
CTGMAST  EQU   CTGOPTN1
CTGBYPSS EQU   CTGOPTN1
@NM00041 EQU   PSA+3668
PSASTAK  EQU   PSA+3072
@NM00040 EQU   PSA+1048
PSAUSEND EQU   PSA+1048
PSARV062 EQU   PSA+1044
PSACDAL  EQU   PSA+1040
PSAWTCOD EQU   PSA+1036
PSAATCVT EQU   PSA+1032
PSAPCPSW EQU   PSA+1024
PSAPIR2  EQU   PSA+1020
PSARV059 EQU   PSA+1018
PSASVC13 EQU   PSA+1016
PSALSFCC EQU   PSA+1012
PSASFACC EQU   PSA+1008
PSASTOP  EQU   PSA+992
PSASTART EQU   PSA+976
PSARSPSW EQU   PSA+968
PSASRPSW EQU   PSA+960
PSARV045 EQU   PSA+892
PSARV044 EQU   PSA+888
PSARV043 EQU   PSA+884
PSARV042 EQU   PSA+880
PSARV041 EQU   PSA+876
PSARV040 EQU   PSA+872
PSARV025 EQU   PSA+868
PSADSSED EQU   PSA+868
PSADSSPR EQU   PSA+864
PSADSSFW EQU   PSA+860
PSADSS14 EQU   PSA+856
PSADSSPP EQU   PSA+848
PSADSSRP EQU   PSA+840
PSADSS05 EQU   PSADSSF4
PSADSS10 EQU   PSADSSF4
PSADSSVE EQU   PSADSSF4
PSADSSDE EQU   PSADSSF4
PSADSSC0 EQU   PSADSSF4
PSADSSIE EQU   PSADSSF4
PSADSS12 EQU   PSADSSF4
PSADSSRC EQU   PSADSSF4
PSARV057 EQU   PSADSSF3
PSARV056 EQU   PSADSSF3
PSARV055 EQU   PSADSSF3
PSADSSMC EQU   PSADSSF3
PSADSSRW EQU   PSADSSF3
PSADSSNM EQU   PSADSSF3
PSADSSES EQU   PSADSSF3
PSADSSGP EQU   PSADSSF3
PSADSSF2 EQU   PSADSSFL+1
PSADSSPI EQU   PSADSSF1
PSADSSOI EQU   PSADSSF1
PSADSSSP EQU   PSADSSF1
PSADSSTP EQU   PSADSSF1
PSADSSDW EQU   PSADSSF1
PSADSSDD EQU   PSADSSF1
PSADSSDM EQU   PSADSSF1
PSADSSMV EQU   PSADSSF1
PSADSSTS EQU   PSA+816
PSADSSWK EQU   PSA+812
PSADSSR3 EQU   PSA+808
PSADSSR2 EQU   PSA+804
PSADSSRS EQU   PSA+800
PSASTOR  EQU   PSA+796
PSACPUSA EQU   PSA+794
PSAVSTAP EQU   PSA+792
PSAWKVAP EQU   PSA+788
PSAWKRAP EQU   PSA+784
PSAMCHIC EQU   PSA+783
PSARV061 EQU   PSA+782
PSASYMSK EQU   PSA+781
PSAMCHFL EQU   PSA+780
PSACR0   EQU   PSA+776
PSAPSWSV EQU   PSA+768
PSALITA  EQU   PSA+764
PSACLHS  EQU   PSAHLHI
PSALKR15 EQU   PSALKSA+60
PSALKR14 EQU   PSALKSA+56
PSALKR13 EQU   PSALKSA+52
PSALKR12 EQU   PSALKSA+48
PSALKR11 EQU   PSALKSA+44
PSALKR10 EQU   PSALKSA+40
PSALKR9  EQU   PSALKSA+36
PSALKR8  EQU   PSALKSA+32
PSALKR7  EQU   PSALKSA+28
PSALKR6  EQU   PSALKSA+24
PSALKR5  EQU   PSALKSA+20
PSALKR4  EQU   PSALKSA+16
PSALKR3  EQU   PSALKSA+12
PSALKR2  EQU   PSALKSA+8
PSALKR1  EQU   PSALKSA+4
PSALKR0  EQU   PSALKSA
PSARV023 EQU   PSACLHT+52
PSALOCAL EQU   PSACLHT+48
PSACMSL  EQU   PSACLHT+44
PSAOPTL  EQU   PSACLHT+40
PSATPACL EQU   PSACLHT+36
PSATPDNL EQU   PSACLHT+32
PSATPNCL EQU   PSACLHT+28
PSAIOSLL EQU   PSACLHT+24
PSAIOSUL EQU   PSACLHT+20
PSAIOSCL EQU   PSACLHT+16
PSAIOSSL EQU   PSACLHT+12
PSASALCL EQU   PSACLHT+8
PSAASML  EQU   PSACLHT+4
PSADISPL EQU   PSACLHT
PSASRSA  EQU   PSA+636
PSARV050 EQU   PSA+634
PSADSSGO EQU   PSA+633
PSARECUR EQU   PSA+632
PSAHLHIS EQU   PSA+628
PSAIPCSA EQU   PSA+624
@NM00039 EQU   PSA+621
PSAIPCDM EQU   PSA+620
PSAIPCD  EQU   PSA+616
@NM00038 EQU   PSA+613
PSAIPCRM EQU   PSA+612
PSAIPCR  EQU   PSA+608
PSAMCHEX EQU   PSA+600
PSAMPSW  EQU   PSA+592
PSAEXPS2 EQU   PSA+584
PSAEXPS1 EQU   PSA+576
PSAPIREG EQU   PSA+572
PSARSREG EQU   PSA+568
PSAGPREG EQU   PSA+556
PSARV022 EQU   PSASUP4
PSARV021 EQU   PSASUP4
PSARV020 EQU   PSASUP4
PSARV019 EQU   PSASUP4
PSARV018 EQU   PSASUP4
PSARV017 EQU   PSASUP4
PSARV016 EQU   PSASUP4
PSARV015 EQU   PSASUP4
PSARV014 EQU   PSASUP3
PSAULCMS EQU   PSASUP3
PSARV012 EQU   PSASUP3
PSAESTA  EQU   PSASUP3
PSASPR   EQU   PSASUP3
PSAPSREG EQU   PSASUP3
PSAPI2   EQU   PSASUP3
PSAIOSUP EQU   PSASUP3
PSALCR   EQU   PSASUP2
PSARTM   EQU   PSASUP2
PSAACR   EQU   PSASUP2
PSAIPCE2 EQU   PSASUP2
PSAIPCES EQU   PSASUP2
PSAIPCEC EQU   PSASUP2
PSAGTF   EQU   PSASUP2
PSAIPCRI EQU   PSASUP2
PSATYPE6 EQU   PSASUP1
PSATCTL  EQU   PSASUP1
PSADISP  EQU   PSASUP1
PSALOCK  EQU   PSASUP1
PSAPI    EQU   PSASUP1
PSAEXT   EQU   PSASUP1
PSASVC   EQU   PSASUP1
PSAIO    EQU   PSASUP1
PSAANEW  EQU   PSA+544
PSATOLD  EQU   PSA+540
PSATNEW  EQU   PSA+536
PSALCCAR EQU   PSA+532
PSALCCAV EQU   PSA+528
PSAPCCAR EQU   PSA+524
PSAPCCAV EQU   PSA+520
PSACPULA EQU   PSA+518
PSACPUPA EQU   PSA+516
PSAPSA   EQU   PSA+512
FLCHDEND EQU   PSA+512
FLCCRSAV EQU   FLCMCLA+280
FLCGRSAV EQU   FLCMCLA+216
FLCFPSAV EQU   FLCMCLA+184
FLCFLA   EQU   FLCMCLA+88
FLCRGNCD EQU   FLCMCLA+84
FLCFSAA  EQU   FLCFSA+1
@NM00037 EQU   FLCFSA
@NM00036 EQU   FLCMCLA+72
FLCMCIC  EQU   FLCMCLA+64
@NM00035 EQU   FLCMCLA+20
FLCIOAA  EQU   FLCIOA+1
@NM00034 EQU   FLCIOA
@NM00033 EQU   FLCMCLA+15
@NM00032 EQU   FLCMCLA+14
@NM00031 EQU   FLCMCLA+12
FLCLCL   EQU   FLCMCLA+8
FLCIOELA EQU   FLCIOEL+1
@NM00030 EQU   FLCIOEL
FLCCHNID EQU   FLCMCLA
@NM00029 EQU   PSA+160
FLCMTRCD EQU   PSA+157
@NM00028 EQU   PSA+156
FLCPERA  EQU   FLCPER+1
@NM00027 EQU   FLCPER
@NM00026 EQU   PSA+151
FLCPERCD EQU   PSA+150
FLCMCNUM EQU   PSA+149
@NM00025 EQU   PSA+148
FLCTEAA  EQU   FLCTEA+1
@NM00024 EQU   FLCTEA
PSAPIPC  EQU   PSAPICOD
PSAPIMC  EQU   PSAPICOD
PSAPIPER EQU   PSAPICOD
PSARV049 EQU   FLCPICOD
FLCPILCB EQU   FLCPIILC
@NM00023 EQU   FLCPIILC
@NM00022 EQU   PSAEPPSW
FLCSVCN  EQU   PSAESPSW+2
FLCSILCB EQU   FLCSVILC
@NM00021 EQU   FLCSVILC
@NM00020 EQU   PSAESPSW
FLCEICOD EQU   PSAEEPSW+2
PSASPAD  EQU   PSAEEPSW
@NM00019 EQU   PSA+128
FLCINPSW EQU   PSA+120
FLCMNPSW EQU   PSA+112
FLCPNPSW EQU   PSA+104
FLCSNPSW EQU   PSA+96
FLCENPSW EQU   PSA+88
FLCTRACE EQU   PSA+84
FLCTIMER EQU   PSA+80
FLCCVT2  EQU   PSA+76
FLCCAW   EQU   PSA+72
FLCCSW   EQU   PSA+64
FLCIOPSW EQU   PSA+56
FLCMOPSW EQU   PSA+48
FLCPOPSW EQU   PSA+40
FLCSOPSW EQU   PSA+32
FLCEOPSW EQU   PSA+24
@NM00018 EQU   FLCICCW2+4
FLCCVT   EQU   FLCICCW2
FLCICCW1 EQU   FLCROPSW
FLCIPPSW EQU   FLCRNPSW
*                                      END UNREFERENCED COMPONENTS
@RC00165 EQU   ENDIT
@RC00198 EQU   @RC00197
@RC00204 EQU   @RC00203
@RF00231 EQU   NOENQ
@RF00234 EQU   NOENQ
@RC00278 EQU   @RC00276
@RT00292 EQU   @RC00276
@RC00444 EQU   @RC00443
@RF00552 EQU   @EL00008
@RC00559 EQU   @EL00008
@RC00554 EQU   @EL00008
@RT00569 EQU   @EL00009
@RC00600 EQU   @EL00009
@RC00637 EQU   @EL00010
@RC00620 EQU   @EL00010
@RC00651 EQU   @EL00011
@RC00666 EQU   @EL00011
@RC00659 EQU   @EL00011
@RC00685 EQU   @RC00673
@RC00723 EQU   @EL00012
@RC00721 EQU   @EL00012
ENDLOC   EQU   @EL00012
@RC00738 EQU   @RC00736
@RC00779 EQU   @RC00772
@RC00777 EQU   @RC00772
@RC00775 EQU   @RC00772
@RC00773 EQU   @RC00772
@RC00731 EQU   @EL00013
@RT00804 EQU   @EL00013
@RC00823 EQU   @EL00013
@RC00842 EQU   @EL00013
@RC00860 EQU   @RC00859
@RC00906 EQU   @EL00016
@RC00934 EQU   @EL00016
@RC00913 EQU   @EL00016
@RC01016 EQU   @RC01013
@RC01025 EQU   @RC01011
@RT01033 EQU   @RC01011
@RC01041 EQU   @RC01011
@RC00998 EQU   @EL00017
@PB00025 EQU   @EL00001
@RC00199 EQU   @RC00198
@RC00604 EQU   @RC00600
@RC00602 EQU   @RC00600
@RF00623 EQU   @RC00620
@RC00628 EQU   @RC00620
@RC00638 EQU   @RC00637
@RC00914 EQU   @RC00913
@RC01000 EQU   @RC00998
@RC01018 EQU   @RC01016
@RC01057 EQU   @RC01041
@RC01055 EQU   @RC01041
@RC01053 EQU   @RC01041
@RC01051 EQU   @RC01041
@RC01049 EQU   @RC01041
@RC01047 EQU   @RC01041
@PB00024 EQU   @PB00025
@PB00023 EQU   @PB00024
@PB00022 EQU   @PB00023
@PB00021 EQU   @PB00022
@PB00020 EQU   @PB00021
@PB00019 EQU   @PB00020
@PB00018 EQU   @PB00019
@PB00017 EQU   @PB00018
@PB00016 EQU   @PB00017
@PB00015 EQU   @PB00016
@PB00014 EQU   @PB00015
@PB00013 EQU   @PB00014
@PB00012 EQU   @PB00013
@PB00011 EQU   @PB00012
@PB00010 EQU   @PB00011
@PB00009 EQU   @PB00010
@PB00008 EQU   @PB00009
@PB00007 EQU   @PB00008
@PB00006 EQU   @PB00007
@PB00005 EQU   @PB00006
@PB00004 EQU   @PB00005
@PB00003 EQU   @PB00004
@ENDDATA EQU   *
         END   IGG0CLCA,(C'PLS1841',0701,78206)
