         MACRO
         TCOMTAB
TCOMTAB  DSECT
         SPACE 1
***********************************************************************
*                                                                     *
*        THIS MACRO MAPS THE TEST COMMAND PROCESSOR COMMUNICATION     *
*        TABLE (TCOMTAB) USED BY ALL SUBCOMMAND PROCESSORS AND        *
*        SERVICE ROUTINES WHICH MAKE UP THE TSO/TEST COMMAND.         *
*                                                                     *
* STATUS -- VERSION NO. 01 - OS/VS2 RELEASE NO. 01                    *
*                                                                     *
* CHANGE LEVEL -- 04 - DATE 04/25/72                                  *
*                                                                     *
***********************************************************************
         SPACE 1
ECBPP    DS    A -            PP DISPATCHABILITY ECB.
         SPACE 1
ECBLIST  EQU   * -            BEGINNING OF ECBLIST FOR WAIT.
ECBTST   DS    A -            PTR TO TEST DISPATCHABILITY ECB.
ECBTERM  DS    A -            PTR TO PP TERMINATION ECB.
ECBTMPS  DS    A -            PTR TO STAI ECB.
ECBTMPA  DS    A -            PTR TO ATTENTION ECB.
         SPACE 1
ECBLOG   DS    A -            PTR TO STOP/MODIFY ECB.
         SPACE 1
TSTTCB   DS    0A -           PTR TO THE TEST TCB.
TSTTCBR  DS    X -            RESERVED.
TSTTCBP  DS    AL3 -          PTR TO THE TEST TCB.
         SPACE 1
PPTCB    DS    0A -           PTR TO THE PROBLEM PROGRAM TCB.
PPTCBR   DS    X -            RESERVED.
PPTCBP   DS    AL3 -          PTR TO THE PROBLEM PROGRAM TCB.
         DS    D -            *** RESERVED SPACE ***
         SPACE 1
OUTBUF   DS    A -            PTR TO GENERAL OUTPUT BUFFER.
OUTBUFRL EQU   256 -          LENGTH OF OUTPUT BUFFER.
BLDLAREA DS    0A -           ADDRESS OF BLDL ENTRY USED BY
*                             IKJEGINT AND IKJEGLDR.
CONAREA  DS    A -            PTR TO OUTPUT AREA USED BY CONVERT RTN.
CONAREAL EQU   72 -           LENGTH OF CONVERT WORK AREA.
WORKAREA DS    A -            PTR TO GENERAL WORK AREA.
REGSAVEL EQU   72*6 -         LENGTH OF 6 REGISTER SAVE AREAS.
REGSAVE1 DS    A -            PTR TO SAVE AREA FOR MAINLINE.
REGSAVE2 DS    A -            PTR TO SAVE AREA FOR COMMANDS.
REGSAVE3 DS    A -            PTR TO SAVE AREA FOR VALIDITY CHECKERS.
REGSAVE4 DS    A -            PTR TO SAVE AREA FOR IKJEGCVT.
REGSAVE5 DS    A -            PTR TO SAVE AREA FOR IKJEGIO.
REGSAVE6 DS    A -            PTR TO SAVE AREA FOR IKJEGSRH.
@TSTPARM DS    A -            *** RESERVED SPACE ***
         SPACE 1
TPLPTR   DS    A -            PTR TO TPL
TMPLL    DS    H -            LINE LENGTH
TSTMTASK DS    X -            BREAKPOINT SYNCHRONIZATION BYTE.
TSTESTRC DS    X -            ESATE ERROR RETURN CODE
TSTWHR   DS    A -            PTR TO COMMAND LIB DCB.
         SPACE 1
PARMLIST DS    0F -           PARM LIST FOR CALLING SERVICE ROUTINES
TSTUPT   DS    A -            PTR TO UPT
TSTECT   DS    A -            PTR TO ECT
TSTCPECB DS    A -            PTR TO CP ECB
         SPACE 1
TSTANSPL DS    A -            ANSWER PLACE FOR PARSE SERVICE ROUTINE.
         SPACE 1
ABENTAB  DS    A -            PTR TO ABEND VECTOR TABLE(RESIDENT).
ABENTAB1 DS    A -            PTR TO ABEND VECTOR TABLE(TRANSIENT).
TSTRETRY DS    0A -           ENTRY POINT OF TRANSIENT RETRY ROUTINE.
TSTRTYCD DS    X -            SUBCOMMAND ID.
TSTRTYPT DS    AL3 -          PTR TO A STAE RETRY ROUTINE WITHIN ANY
*                             TEST MODULE THAT HAS ISSUED A STAE
         SPACE 1
INBUF    DS    A -            PTR TO BUFFER CONTAINING SUBCMD
TSTIODSN DS    A -            HEAD OF DSNAME CHAIN FOR IKJEGIO 'PRINT'.
TSTIO    DS    A -            ENTRY POINT OF GET ROUTINE IKJEGIO.
         DS    A -            RESERVED
         DS    A -            RESERVED
TSTCONVT DS    A -            ENTRY POINT OF IKJEGCVT.
TSTADDR  DS    A -            ENTRY POINT OF ADDRESS BUILD SUBROUTINE.
TSTSTAE  DS    A -            ENTRY POINT OF STAE EXIT RTN. (IKJEGSTA).
         SPACE 2
TSTFLGS1 DS    X -            TEST FLAGS, BYTE 1.
         SPACE 1
PCHLSTVL EQU   B'10000000' -  PATCH LIST SWITCH.
S9GINTSW EQU   B'01000000' -  INTERNAL SW FOR SVC97          @ZA05687
TSTPRINT EQU   B'00100000' -  PRINT SWITCH.
TSTFIRST EQU   B'00010000' -  FIRST TIME SWITCH.
RANGESW  EQU   B'00001000' -  INDICATES PDE IS FOR ADDRESS RANGE.
TSTBUILD EQU   B'00000100' -  'AT' SWITCH FOR DEFER CHECK.
ENDSW    EQU   B'00000010' -  INDICATES 'END' TO MAINLINE.
RUNSW    EQU   B'00000001' -  INDICATES 'RUN' TO MAINLINE.
         SPACE 2
TSTFLGS2 DS    X -            TEST FLAGS, BYTE 2.
         SPACE 1
TSTLDF   EQU   B'10000000' -  IKJEGLDF TASK-SWITCH INDICATOR.
TSTXCTL  EQU   B'01000000' -  STAE XCTL INDICATOR.
TOFFDEF  EQU   B'00100000' -  NO ACTIVE BREAKPOINTS.
TTESTTCB EQU   B'00010000' -  RUNNING UNDER TEST TASK.
TADDROUT EQU   B'00001000' -  LOAD MODULE FOUND UNDER TCB.
TWHRLOAD EQU   B'00000100' -  VALID LOAD MODULE CHECK.
TSTQUAL  EQU   B'00000010' -  QUALIFICATION IS IN PROCESS
TMYIOMSG EQU   B'00000001' -  IKJEGIO MESSAGE SWITCH.
         SPACE 2
TSTFLGS3 DS    X -            TEST FLAGS, BYTE 3.
         SPACE 1
TSTGOSW  EQU   B'10000000' -  SPECIAL BREAKPOINT TYPE SWITCH.
TSTSTAI  EQU   B'01000000' -  PROBLEM PROGRAM ABEND INDICATOR.
SYMMESG  EQU   B'00100000' -  SYM 'NO DIAGNOSTIC' SWITCH.
TCSECTCK EQU   B'00010000' -  CSECT ONLY DEFER QUEUE CLEAR.
TDUPNAME EQU   B'00001000' -  DEFER QUEUE DUPLICATE NAME BIT.
TSTLINK  EQU   B'00000100' -  SUB-CMD 'LINK FAILED' INDICATOR.
TSTHELP  EQU   B'00000010' -  INDICATES THAT 'HELP' IS ATTACHED.
NOPARMS  EQU   B'00000001' -  INDICATES NO PARAMETERS WITH COMMAND.
         SPACE 2
TSTFLGS4 DS    X              TEST FLAGS, BYTE 4.
         SPACE 1
TSTA     EQU   B'10000000' -  TEST'S INPUT IS NOT FROM A STACK.
TSTB     EQU   B'01000000' -  A STACKED TERMINAL ELEM. IS PRESENT.
TSTFLUSH EQU   B'00100000' -  FORCE TCLEARQ AND POSSIBLE STACK FLUSH.
TSTRERTN EQU   B'00010000' -  A RETRY IS IN PROCESS
TSTESTAE EQU   B'00001000' -  ESTAE IS INVOKING I/O FOR MESSAGE
TSTSVCAB EQU   B'00000100' -  SVC ABEND IS IN PROCESS
TSTPERC  EQU   B'00000010' -  THIS RETRY ROUTINE WAS PERCOLLATED TO
TSTVALCK EQU   B'00000001' -  INDICATES PARSE VALIDITY CHECK IN PROCESS
         SPACE 2
BREAKTAB DS    A -            PTR TO FIRST BREAK ELEMENT.
DEFERTAB DS    A -            PTR TO DEFER'ED CMD LIST
PPLOAD   DS    A -            PTR TO CURRENT BASE FOR RELATIVES.
PPTEMP   DS    A -            TEMPORARY BASE FOR RELATIVES.
SUBCHAIN DS    A -            PTR TO BREAKPOINT SUBCOMMAND CHAIN.
         SPACE 1
TSTGO    DS    0X -           RESUME ADDRESS AFTER BREAKPOINT.
TSTGOPSW DS    F -            SECOND WORD OF RBOPSW FIELD.
TSTGOWCF DS    X -            WAIT COUNT FROM RBWCF FIELD.
TSTRSVD2 DS    X -            RESERVED BYTE.
TSTSVC   DS    H -            AN SVC 97 INSTRUCTION (0A61).
PPRB     DS    A -            CURRENT PROBLEM PROGRAM RB ADDRESS.
         SPACE 1
TSTIODCB DS    A -            PTR TO OPEN PRINT DCB.
CALLPARM DS    A -            HEAD OF CHAIN FOR PARMS BUILT BY 'CALL'.
         DS    A -            *** RESERVED SPACE ***
INTSTDDN DS    0CL8           DDNAME FOR DATA SET SPECIFIED ON THE TEST
*                             COMMAND - USED BY IKJEGINT AND IKJEGLDR.
TSTCURLD DS    CL8 -          CURRENTLY QUALIFIED LOAD NAME.
TERMDD   DS    0CL8 -         DDNAME FOR TERMINAL USED BY OS LOADER.
TSTCURCT DS    CL8 -          CURRENTLY QUALIFIED CSECT NAME.
TSTSYMBA DS    A -            CURRENTLY QUALIFIED SYMBOLIC ADDR BASE.
TSTTRN   DS    A -            HEAD OF SAVE INFORMATION CHAIN
SICHAIN  DS    A -            HEAD OF SYMBOL INFORMATION CHAIN
TSTSYMWK DS    A -            PTR TO SYMBOL PROCESSING WORK AREA.
SYMTABLE DS    A -            PTR TO IN-CORE SYMBOL TABLE.
         SPACE 1
PPEXIT   DS    0A -           BREAKPOINT & EXIT SVC'S FOR PP TERM.
PPEXIT1  DS    H -            AN SVC 97 INSTRUCTION (0A61).
PPEXIT2  DS    H -            AN SVC 3 INSTRUCTION (0A03).
TSTDCB   DS    A -            HEAD OF OVLY DCB CHAIN.
OPCODTAB DS    A -            PTR TO TABLE OF VALID OPERATION CODES.
TSTOPCD2 DS    F -            PTR TO TABLE FOR TWO BYTE S/370
*                             OPERATION CODES.
         DS    A -            RESERVED
         DS    A -            RESERVED
TSTHTCB  DS    A -            POINTER TO THE HELP TCB
TSTAQUAL DS    0X -           AUTOMATIC QUALIFICATION CONTROL
TSTAQLDM DS    CL8 -          EBCDIC LOAD MODULE NAME.
TSTAQEP  DS    A -            ENTRY POINT OF LOAD MODULE.
TSTRSTRT DS    A -            RESTART ADDRESS FOR STAE PROCESSING
TSTSRHRT DS    A -            ADDRESS OF RESIDENT ADDRESS VALIDITY
*                             CHECK ROUTINE.
         SPACE 1
TSTSTAX  DS    5F -           STAX PARAMETER LIST.
TSTDSECB DS    F -            TEST DISPATCHABILITY ECB.
TSTMNLWK DS    10F -          WORK AREA FOR EXCULSIVE USE OF MNL
TSTSTAEL DS    4F -           STAE PARAMETER LIST FOR MNL ONLY.
TSTOIPRM DS    0CL84          IO PARAMETER BLOCK
TSTIOPRM DS    CL84           IO PARAMETER BLOCK USE BY SIO
TSTSVCM1 DS    F              SVC FIRST LEVEL MESSAGE NO.
TSTSVCM2 DS    F              SVC SECOND LEVEL MESSAGE NO.
TSTSVCNQ DS    CL6'ECBTST'    CHARACTER CONSTANT FOR SVC ENQUE
R11SAVE  DS    F              SAVE AREA FOR R11 FOR SVC97    @ZA00889
         DS    8D             *** RESERVED SPACE ***
TCOMLEN  EQU   ((*-TCOMTAB+7)/8)*8 - TCOMTAB LENGTH.
         MEND
