         TITLE 'ISTZBFIF/AIF-VS1/MIF-VS2 - TPIOS FID2 LCCW PROCESSOR   *
                        '
ISTZBFIF CSECT ,                                                   0001
@MAINENT DS    0H                                                  0001
         USING *,@15                                               0001
         B     @PROLOG                                             0001
         DC    AL1(16)                                             0001
         DC    C'ISTZBFIF  76.329'                                 0001
         DROP  @15
@PROLOG  DS    0H                                                  0002
         PRINT OFF
         PRINT ON
*                                                            @XM19747*/
         EJECT
*                                                                  0557
*/********************************************************************/
*/*                                                                  */
*/*      ISTZBFIF: FID1 LCCW PROCESSOR                               */
*/*                                                                  */
*/********************************************************************/
*/* TPZSAVE (7,12,14) AC(BCIF)BASE                                   */
*                                                                  0557
*   DO;                                                            0557
*     RFY                                                          0558
*      (GPR01P,                                                    0558
*       GPR12P,                                                    0558
*       GPR13P,                                                    0558
*       GPR14P) RSTD;                                              0558
*     GEN(PRINT OFF);                                              0559
*                                                                  0559
         PRINT OFF
*/* ATBUILD (ISTZSAVE)                                               */
*/* END OF ATBUILD                                                   */
*                                                                  0560
*     GEN(PRINT ON);                                               0560
         PRINT ON
*     RFY                                                          0561
*       ISTZSAVE BASED(GPR13P);                                    0561
*     GEN SETS(ZSAZSVVR)(STM   7,12,ZSAZSVVR+0(13));               0562
         STM   7,12,ZSAZSVVR+0(13)
*     GEN SETS(GPR12P);                                            0563
         BALR  GPR12P,0
@TSTART  DS    0H
         USING @TSTART,GPR12P
*     GEN(PRINT OFF);                                              0564
*                                                                  0564
         PRINT OFF
*/* ATBUILD (ISTZCRR,ISTRPH,ISTCRA) EJECT(NO)                        */
*/* END OF ATBUILD                                                   */
*                                                                  0565
*     GEN(PRINT ON);                                               0565
         PRINT ON
*     GPR01P->RPHCRR->CRACRR->ZCREBCIF='1'B;                       0566
         L     @15,RPHCRR(,GPR01P)                                 0566
         L     @15,CRACRR(,@15)                                    0566
         OI    ZCREBCIF(@15),B'00100000'                           0566
*     ZSAZACTV='1'B;                                               0567
         OI    ZSAZACTV(GPR13P),B'10000000'                        0567
*     ZSAZTRAC='BCIF';                                             0568
         MVC   ZSAZTRAC(4,GPR13P),@CC03718                         0568
*     ZSAZSVRR=GPR14P;                                             0569
         ST    GPR14P,ZSAZSVRR(,GPR13P)                            0569
*     GPR13P=ZSAZSVFC;                                             0570
         L     GPR13P,ZSAZSVFC(,GPR13P)                            0570
*     RFY                                                          0571
*      (GPR01P) UNRSTD;                                            0571
*     RFY                                                          0572
*      (GPR14P) UNRSTD;                                            0572
*   END;                                                           0573
*                                                                  0573
*/* END TPZSAVE                                                      */
*                                                                  0574
*   LSCBPTR=LCPBPTR;                /* ADDRESS LSCB                  */
         LR    LSCBPTR,LCPBPTR                                     0574
*   IF LCPTYPE=LSTYPE THEN          /* IF ELEMENT A LSCB             */
         CLI   LCPTYPE(LCPBPTR),X'DF'                              0575
         BNE   @RF00575                                            0575
*     LCPBPTR=LSCLCPBA;             /* ADDRESS LCPB                  */
         L     LCPBPTR,LSCLCPBA(,LSCBPTR)                          0576
*   ELSE                                                           0577
*     ;                             /* LCPB ALREADY ADDRESSED        */
@RF00575 DS    0H                                                  0578
*   LCCWPTR=LCPNXLCW;               /* SAVE PTR(FIRST LCCW)          */
         L     @09,RPHCRR(,RPHPTR)                                 0578
         L     @09,CRACRR(,@09)                                    0578
         L     @15,LCPNXLCW(,LCPBPTR)                              0578
         ST    @15,LCCWPTR(,@09)                                   0578
*   IF LCCWOP=LCLEAR                /* IF LCCWOP=CLEAR       @XM19747*/
*       ×LCCWOP=LCLRNFY THEN                                       0579
         CLI   LCCWOP(@15),X'F2'                                   0579
         BE    @RT00579                                            0579
         CLI   LCCWOP(@15),X'F8'                                   0579
         BNE   @RF00579                                            0579
@RT00579 DS    0H                                                  0580
*     DO;                           /* × LCCWOP=CLEAR/NFY    @XM19747*/
*       LCPRUCNT=LCPMNRCD;          /* SAVE THE MINOR RETURN CODE    */
         IC    @09,LCPMNRCD(,LCPBPTR)                              0581
         STC   @09,LCPRUCNT(,LCPBPTR)                              0581
*       CALL BFIF0CLR;              /* PURGE THE QUEUES              */
         BAL   @14,BFIF0CLR                                        0582
*       IF LCCWOP=LCLRNFY THEN      /* IF CLEAR/NOTIFY       @XM19747*/
         L     @09,RPHCRR(,RPHPTR)                                 0583
         L     @09,CRACRR(,@09)                                    0583
         L     @09,LCCWPTR(,@09)                                   0583
         CLI   LCCWOP(@09),X'F8'                                   0583
         BNE   @RF00583                                            0583
*         CALL NOTIFY;              /* PROCESS THE NOTIFY    @XM19747*/
         BAL   @14,NOTIFY                                          0584
*       ELSE                                                       0585
*         ;                         /* NOT CLEAR/NOTIFY      @XM19747*/
@RF00583 DS    0H                                                  0586
*     END;                          /* END CLEAR PROCESSING          */
*   ELSE                                                           0587
*     ;                             /* NOT A CLEAR                   */
@RF00579 DS    0H                                                  0588
*/********************************************************************/
*/* THE PURPOSE OF THE CODE PRIOR TO THE CALL TO MODULE ISTZDFC0 IS  */
*/* SO THAT WHEN OR IF ISTZDFC0 CALLS BUFFER TRACE A FID1 FORMAT WILL*/
*/* BE TRACED. THESE MEANS WE WILL BE TRACING FID1 INBOUND AND OUT-  */
*/* BOUND.                               THIS CODE ADDED BY  @XM18660*/
*/********************************************************************/
*                                                                  0588
*   THFID=THFID1;                   /* SET FID VALUE         @XM18660*/
         LA    @09,28                                              0588
         ALR   @09,FDBPTR                                          0588
         NI    THFID(@09),B'00011111'                              0588
         OI    THFID(@09),B'00010000'                              0588
*   THMPF=MAPVAL;                   /* SET MAP FIELD         @XM18660*/
         OI    THMPF(@09),B'00001100'                              0589
*   THPYF=THCNOPYF;                 /* SET PRIORITY FIELD    @XM18660*/
         NI    THPYF(@09),B'00001111'                              0590
*   THSEF=THCNOSEF;                 /* SET SECURITY FIELD    @XM18660*/
         NI    THSEF(@09),B'11110011'                              0591
*   THCDF=THCNOCDF;                 /* SET CODE FIELD        @XM18660*/
         NI    THCDF(@09),B'11111100'                              0592
*   THDAF=NCBSWDAF;                 /* SET TH DAF            @XM18660*/
         MVC   THDAF(2,@09),NCBSWDAF(LUNCBPTR)                     0593
*   THOAF=FMCSAF;                   /* SET TH OAF            @XM18660*/
         MVC   THOAF(2,@09),FMCSAF(FMCBPTR)                        0594
*   FDBDATCT=LENGTH(ISTTH);         /* SET DATA COUNT        @XM18660*/
         MVC   FDBDATCT(2,FDBPTR),@CH02545                         0595
*   FDBDATAA=ADDR(ZOBTEXT);         /* SET DATA ADDRESS      @XM18660*/
         LA    @09,ZOBTEXT(,FDBPTR)                                0596
         ST    @09,FDBDATAA(,FDBPTR)                               0596
*   LCPLCCW1=LCPNXLCW;              /* SAV FIRST LCCW ADDR   @XM18660*/
         L     @09,LCPNXLCW(,LCPBPTR)                              0597
         ST    @09,LCPLCCW1(,LCPBPTR)                              0597
*   CALL ISTZDFC0;                  /* CALL ROUTINE TO MOVE LH, RH,
*                                      RU TO BUFFER                  */
         L     @09,ATCZPSVT(,ATCVTPTR)                             0598
         L     @15,ZPSZDFC0(,@09)                                  0598
         BALR  @14,@15                                             0598
*   RFY                                                            0599
*     R15 RSTD;                     /*                       @XM18669*/
*   IF R15=0 THEN                   /* TEST MOVE RETURN CODE @XM18660*/
         SLR   @14,@14                                             0600
         CR    R15,@14                                             0600
         BNE   @RF00600                                            0600
*     DO;                           /* CONTINUE ONLY IF MOVE       0601
*                                      SUCCESSFUL                    */
*       RFY                                                        0602
*         R15 UNRSTD;                                              0602
*       ISTLH=0;                    /* ZERO LINK HEADER      @XM18660*/
         ST    @14,ISTLH+28(,FDBPTR)                               0603
*       TH2FID=THFID2;              /* SET FID VALUE                 */
         LA    @09,32                                              0604
         ALR   @09,FDBPTR                                          0604
         NI    TH2FID(@09),B'00101111'                             0604
         OI    TH2FID(@09),B'00100000'                             0604
*       TH2MPF=MAPVAL;              /* SET TH MAP FIELD              */
         OI    TH2MPF(@09),B'00001100'                             0605
*       TH2PYF=THCNOPYF;            /* SET TH PRIORITY FIELD         */
         NI    TH2PYF(@09),B'00001111'                             0606
*       TH2SEF=THCNOSEF;            /* SET TH SECURITY FIELD         */
         NI    TH2SEF(@09),B'11110011'                             0607
*       TH2CDF=THCNOCDF;            /* SET TH CODE FIELD             */
         NI    TH2CDF(@09),B'11111100'                             0608
*       TH2DAF=(LUNCBPTR->NCBDAF)-(ICNCBPTR->NCBNCBA);             0609
         LH    @15,NCBDAF(,LUNCBPTR)                               0609
         N     @15,@CF03829                                        0609
         LH    @14,NCBNCBA(,ICNCBPTR)                              0609
         N     @14,@CF03829                                        0609
         SLR   @15,@14                                             0609
         STC   @15,TH2DAF(,@09)                                    0609
*       ;                           /* CALCULATE LOCAL DAF           */
*       TH2OAF=FMCSAF-ATCVTMID;     /* CALCULATE LOCAL SAF           */
         LH    @15,FMCSAF(,FMCBPTR)                                0611
         N     @15,@CF03829                                        0611
         LH    @14,ATCVTMID(,ATCVTPTR)                             0611
         N     @14,@CF03829                                        0611
         SLR   @15,@14                                             0611
         STC   @15,TH2OAF(,@09)                                    0611
*       RFY                                                        0612
*         RHPTR RSTD;                                              0612
*       RFY                                                        0613
*         ISTRH BASED(RHPTR);                                      0613
*       IF LCCWIDAT='1'B THEN       /* IMMEDIATE DATA IN LCCW        */
         L     @11,RPHCRR(,RPHPTR)                                 0614
         L     @11,CRACRR(,@11)                                    0614
         L     @11,LCCWPTR(,@11)                                   0614
         TM    LCCWIDAT(@11),B'00001000'                           0614
         BNO   @RF00614                                            0614
*         RHPTR=ADDR(LCCWDATA);     /* THE RH IS IN THE LCCW         */
         LA    RHPTR,LCCWDATA(,@11)                                0615
*       ELSE                                                       0616
*         RHPTR=LCCWDATA;           /* OTHERWISE THE LCCW POINTS TO
*                                      RH                            */
         B     @RC00614                                            0616
@RF00614 L     @09,RPHCRR(,RPHPTR)                                 0616
         L     @09,CRACRR(,@09)                                    0616
         L     @09,LCCWPTR(,@09)                                   0616
         L     RHPTR,LCCWDATA(,@09)                                0616
*       IF RHQS='1'B THEN           /* LCPB FOR A RESPONSE?          */
@RC00614 TM    RHQS(RHPTR),B'10000000'                             0617
         BNO   @RF00617                                            0617
*         DO;                       /* ASSGN SEQN PER LCPB           */
*           IF LCPASYN='1'B THEN    /* LCPB ASYN?                    */
         TM    LCPASYN(LCPBPTR),B'01000000'                        0619
         BNO   @RF00619                                            0619
*             TH2AFI='1'B;          /* THEN TH ASYN                  */
         OI    TH2AFI+32(FDBPTR),B'00000001'                       0620
*           ELSE                                                   0621
*             TH2AFI='0'B;          /* ELSE TH SYNCH                 */
         B     @RC00619                                            0621
@RF00619 NI    TH2AFI+32(FDBPTR),B'11111110'                       0621
*           TH2PSI='0'B;            /* SECONDARY TO PRIMARY FLOW     */
@RC00619 LA    @11,32                                              0622
         ALR   @11,FDBPTR                                          0622
         NI    TH2PSI(@11),B'11111101'                             0622
*           TH2SNF=LCPFOSN;         /* ASSGN SEQN PER LCPB           */
         LH    @09,LCPFOSN(,LCPBPTR)                               0623
         N     @09,@CF03829                                        0623
         STH   @09,TH2SNF(,@11)                                    0623
*         END;                                                     0624
*       ELSE                                                       0625
*         DO;                                                      0625
         B     @RC00617                                            0625
@RF00617 DS    0H                                                  0626
*           TH2PSI='1'B;            /* FLOW = PRIM. TO SEC.          */
         LA    @11,32                                              0626
         ALR   @11,FDBPTR                                          0626
         OI    TH2PSI(@11),B'00000010'                             0626
*           IF LCPASYN='1'B THEN    /* ASYNCH FLOW?                  */
         TM    LCPASYN(LCPBPTR),B'01000000'                        0627
         BNO   @RF00627                                            0627
*             DO;                   /* YES,DO...                     */
*               TH2AFI='1'B;        /* SET FLOW=ASYNCH               */
         OI    TH2AFI(@11),B'00000001'                             0629
*               FMCOASN=FMCOASN+1;  /* UPDATE FMCB ASYN SEQN         */
         LA    @11,1                                               0630
         LH    @09,FMCOASN(,FMCBPTR)                               0630
         N     @09,@CF03829                                        0630
         ALR   @09,@11                                             0630
         STH   @09,FMCOASN(,FMCBPTR)                               0630
*               IF FMCOASN=0 THEN   /* ZERO SEQ. NO NOT USED HERE    */
         LTR   @09,@09                                             0631
         BNZ   @RF00631                                            0631
*                 FMCOASN=1;                                       0632
         STH   @11,FMCOASN(,FMCBPTR)                               0632
*               ELSE                                               0633
*                 ;                                                0633
@RF00631 DS    0H                                                  0634
*               TH2SNF=FMCOASN;     /* ASSIGN TH ASYNCH SEQ #        */
         LH    @11,FMCOASN(,FMCBPTR)                               0634
         N     @11,@CF03829                                        0634
         STH   @11,TH2SNF+32(,FDBPTR)                              0634
*             END;                                                 0635
*           ELSE                                                   0636
*             DO;                   /* NO, DO...                     */
         B     @RC00627                                            0636
@RF00627 DS    0H                                                  0637
*               TH2AFI='0'B;        /* RESET SYNCH/ASYNCH FLOW       */
         NI    TH2AFI+32(FDBPTR),B'11111110'                       0637
*               FMCOSSN=FMCOSSN+1;  /* UPDATE FMCB SYN SEQN          */
         LA    @11,1                                               0638
         LH    @09,FMCOSSN(,FMCBPTR)                               0638
         N     @09,@CF03829                                        0638
         ALR   @11,@09                                             0638
         STH   @11,FMCOSSN(,FMCBPTR)                               0638
*               IF RHCHAIN='10'B×   /* FIRST OR ONLY IN CHAIN        */
*                   RHCHAIN='11'B THEN/*                             */
         TM    RHCHAIN(RHPTR),B'00000010'                          0639
         BNO   @GL00002                                            0639
         TM    RHCHAIN(RHPTR),B'00000001'                          0639
         BZ    @RT00639                                            0639
@GL00002 TM    RHCHAIN(RHPTR),B'00000011'                          0639
         BNO   @RF00639                                            0639
@RT00639 DS    0H                                                  0640
*                 DO;                                              0640
*                   FMCPURCH='0'B;  /* RESET PURGING CHAIN STATE     */
         NI    FMCPURCH(FMCBPTR),B'11111101'                       0641
*                   FMCZFCSQ=FMCOSSN;/* SAVE SEQ. NO.                */
         LH    @11,FMCOSSN(,FMCBPTR)                               0642
         N     @11,@CF03829                                        0642
         STH   @11,FMCZFCSQ(,FMCBPTR)                              0642
*                 END;                                             0643
*               ELSE                                               0644
*                 ;                                                0644
@RF00639 DS    0H                                                  0645
*               LCPFSNCH=FMCZFCSQ;  /* SEQ NO. IN ELEMENT            */
         LH    @11,FMCZFCSQ(,FMCBPTR)                              0645
         N     @11,@CF03829                                        0645
         STH   @11,LCPFSNCH(,LCPBPTR)                              0645
*               TH2SNF=FMCOSSN;     /* ASSIGN TH SYNCH SEQ #         */
         LH    @11,FMCOSSN(,FMCBPTR)                               0646
         N     @11,@CF03829                                        0646
         STH   @11,TH2SNF+32(,FDBPTR)                              0646
*             END;                                                 0647
*         END;                                                     0648
@RC00627 DS    0H                                                  0649
*       RFY                                                        0649
*         RHPTR UNRSTD;                                            0649
@RC00617 DS    0H                                                  0650
*       RFY                                                        0650
*         ISTRH BASED(ADDR(ZOBTEXT)+LENGTH(ISTTH2)+LENGTH(ISTLH)); 0650
*       LSCREQTG=TH2SNF;            /* SET SEQ. NUMBER               */
         LH    @09,TH2SNF+32(,FDBPTR)                              0651
         N     @09,@CF03829                                        0651
         STH   @09,LSCREQTG(,LSCBPTR)                              0651
*       FMCZF001='1'B;              /* SET ALLOC REQ'D FLAG IN FMCB  */
         OI    FMCZF001(FMCBPTR),B'10000000'                       0652
*       LHLEN=0;                    /* INIT. LH DATA CNT. FLD        */
         SLR   @09,@09                                             0653
         STH   @09,LHLEN+28(,FDBPTR)                               0653
*       RFY                                                        0654
*         HOLDPTR RSTD;                                            0654
*       HOLDPTR=FDBPTR;             /* SAVE FDB POINTER              */
         LR    HOLDPTR,FDBPTR                                      0655
*       DO WHILE HOLDPTR^=0;        /* ROUTINE TO SUM UP THE FDB DATA
*                                      COUNT                         */
         B     @DE00656                                            0656
@DL00656 DS    0H                                                  0657
*         LHLEN=LHLEN+HOLDPTR->FDBDATCT;                           0657
         LA    @15,28                                              0657
         ALR   @15,FDBPTR                                          0657
         LH    @14,LHLEN(,@15)                                     0657
         N     @14,@CF03829                                        0657
         AH    @14,FDBDATCT(,HOLDPTR)                              0657
         STH   @14,LHLEN(,@15)                                     0657
*         HOLDPTR=HOLDPTR->FDBFDBA&ZAPBIT;                         0658
         L     @15,FDBFDBA(,HOLDPTR)                               0658
         N     @15,@CF00491                                        0658
         LR    HOLDPTR,@15                                         0658
*       END;                                                       0659
@DE00656 LTR   HOLDPTR,HOLDPTR                                     0659
         BNZ   @DL00656                                            0659
*       RFY                                                        0660
*         HOLDPTR UNRSTD;                                          0660
*       IF FMCCIPI='1'B×            /* CLEAR OR UNBIND IN PROGRESS ? */
*           FMCUIPI='1'B THEN       /* YES, SHIP OUT THE CLEAR       */
         TM    FMCCIPI(FMCBPTR),B'01100000'                        0661
         BZ    @RF00661                                            0661
*         CALL BFIF0SHP;                                           0662
         BAL   @14,BFIF0SHP                                        0662
*       ELSE                                                       0663
*         ;                                                        0663
@RF00661 DS    0H                                                  0664
*     END;                                                         0664
*   ELSE                                                           0665
*     DO;                           /* DFC0 MOVE UNSUCCESSFUL        */
         B     @RC00600                                            0665
@RF00600 DS    0H                                                  0666
*/***********************************************************@XM10446*/
*/*                                                          @XM10446*/
*/*      HANDLE INVALID DATA ADDRESS OR LENGTH               @XM10446*/
*/*                                                          @XM10446*/
*/***********************************************************@XM10446*/
*                                                                  0666
*       LCPMNRCD=FRMINDTR;          /* INVALID DATA ADDRESS          */
         MVI   LCPMNRCD(LCPBPTR),X'17'                             0666
*       CALL ISTZBFZ0;              /* ERROR RECOVERY                */
         L     @09,ATCZPSVT(,ATCVTPTR)                             0667
         L     @15,ZPSZBFZ0(,@09)                                  0667
         BALR  @14,@15                                             0667
*       FMCSHEDQ=0;                 /* CLEAR SCHED QUEUE     @XM10446*/
         SLR   @09,@09                                             0668
         ST    @09,FMCSHEDQ(,FMCBPTR)                              0668
*       FSBMJRCD=FRCBLKE;           /* MAJOR=CB ERROR        @XM10446*/
         LA    @15,16                                              0669
         ALR   @15,FDBPTR                                          0669
         MVI   FSBMJRCD(@15),X'04'                                 0669
*       FSBMNRCD=FRMINDTR;          /* MINOR=INVALID DATA    @XM10446*/
         MVI   FSBMNRCD(@15),X'17'                                 0670
*       FSBTHFLD=0;                 /* CLEAR TH FIELD        @XM10446*/
         STH   @09,FSBTHFLD(,@15)                                  0671
*       FSBRHFLD=0;                 /* CLEAR RH FIELD        @XM10446*/
         STCM  @09,7,FSBRHFLD(@15)                                 0672
*       FSBRQTAG=LCPFOSN;           /* SET SEQUENCE ID       @XM10446*/
         MVC   FSBRQTAG(2,@15),LCPFOSN(LCPBPTR)                    0673
*       FSBCID=LCPCID;              /* COPY CID FROM LCPB    @XM10446*/
         MVC   FSBCID(4,@15),LCPCID(LCPBPTR)                       0674
*       FSBLCPB=LCPBPTR;            /* SET FSB LCPB PTR      @XM10446*/
         ST    LCPBPTR,FSBLCPB(,@15)                               0675
*       FSBLCCWA=LCPNXLCW;          /* SET FSB LCCW PTR      @XM10446*/
         L     @09,LCPNXLCW(,LCPBPTR)                              0676
         ST    @09,FSBLCCWA(,@15)                                  0676
*       ZIBFDBS=ZIBFDBZ;            /* SET SYSTEM FDB        @XM10446*/
         MVC   ZIBFDBS(12,FDBPTR),ZIBFDBZ(FDBPTR)                  0677
*       ADDR(ZIBFDBS)->FDBOFSET=DISFDBS;/* SET FDB DISPLACEMENT    0678
*                                                            @XM10446*/
         L     @09,DISFDBS                                         0678
         STH   @09,FDBOFSET+48(,FDBPTR)                            0678
*/*  TPQUE (ADDR(ZIBFSB),FMCPAB2) NORM                               */
*                                                                  0679
*       DO;                                                        0679
*         RFY                                                      0680
*          (GPR00P,                                                0680
*           GPR01P,                                                0680
*           GPR04P,                                                0680
*           GPR05P,                                                0680
*           GPR15P) RSTD;                                          0680
*         GEN REFS(GPR01P) SETS(RPHWORK)                           0681
*             (STM GPR02P,GPR08P,RPHWORK(GPR01P));                 0681
         STM GPR02P,GPR08P,RPHWORK(GPR01P)
*         GPR00P=0;                                                0682
         SLR   GPR00P,GPR00P                                       0682
*         GPR15P=ADDR(FMCPAB2);     /* HOLD PAB PTR                  */
         LA    GPR15P,FMCPAB2(,FMCBPTR)                            0683
*         GPR04P=ADDR(ZIBFSB);      /* WORK ELE PTR                  */
         LA    GPR04P,ZIBFSB(,FDBPTR)                              0684
*         GPR05P=GPR15P;            /* PASS PAB PTR                  */
         LR    GPR05P,GPR15P                                       0685
*         CALL ATCLCPTR->ATCAP37->ISTAPC37;                        0686
         L     @09,ATCLCPTR                                        0686
         L     @15,ATCAP37(,@09)                                   0686
         BALR  @14,@15                                             0686
*         GEN(NOPR  0)                                             0687
*         NOSETS NOREFS;                                           0687
         NOPR  0
*         RFY                                                      0688
*          (GPR00P,                                                0688
*           GPR01P,                                                0688
*           GPR04P,                                                0688
*           GPR05P,                                                0688
*           GPR15P) UNRSTD;                                        0688
*       END;                        /* *** END OF TPQUE GENERATION 0689
*                                      QUEUE FSB TO CLIP     @XM10446*/
*     END;                          /* END MOVE FAILURE      @XM10446*/
*/* TPZRETN                                                          */
*                                                                  0691
*   DO;                                                            0691
@RC00600 DS    0H                                                  0692
*     RFY                                                          0692
*      (GPR07P,                                                    0692
*       GPR14P,                                                    0692
*       GPR15P) RSTD;                                              0692
*     GPR13P=ZSAZSVBC;                                             0693
         L     GPR13P,ZSAZSVBC(,GPR13P)                            0693
*     IF GPR13P=0 THEN                                             0694
         LTR   GPR13P,GPR13P                                       0694
         BZ    @RT00694                                            0694
*       ;                           /* TPDVTS ISTZFARR               */
*     ELSE                                                         0696
*       GPR14P=ZSAZSVRR;                                           0696
         L     GPR14P,ZSAZSVRR(,GPR13P)                            0696
*     GEN REFS(ZSAZSVVR)(LM    7,12,ZSAZSVVR+0(13));               0697
@RT00694 DS    0H                                                  0697
         LM    7,12,ZSAZSVVR+0(13)
*     GEN REFS(GPR14P) EXIT NOSEQFLOW(BR    GPR14P);               0698
         BR    GPR14P
*     RFY                                                          0699
*      (GPR07P,                                                    0699
*       GPR14P,                                                    0699
*       GPR15P) UNRSTD;                                            0699
*   END;                                                           0700
*                                                                  0700
*/* END TPZRETN                                                      */
*                                                                  0701
*                                   /* RETURN TO CALLER              */
         EJECT
*                                                                  0701
*/********************************************************************/
*/*                                                                  */
*/* SUBROUTINE-                                                      */
*/*      BFIF0CLR                                                    */
*/*                                                                  */
*/* FUNCTION-                                                        */
*/*      CLEAR WAIT AND AWAIT QUEUE.                                 */
*/*                                                                  */
*/********************************************************************/
*                                                                  0701
*BFIF0CLR:                                                         0701
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0701
BFIF0CLR DS    0H                                                  0702
*   RFY                                                            0702
*     R14 RSTD;                                                    0702
*   ZCRSVF4=R14;                    /* SAVE REG 14                   */
         L     @15,RPHCRR(,RPHPTR)                                 0703
         L     @15,CRACRR(,@15)                                    0703
         ST    R14,ZCRSVF4(,@15)                                   0703
*   ZCRSVF6=LCPBPTR;                /*                       @XM09587*/
         ST    LCPBPTR,ZCRSVF6(,@15)                               0704
*   RFY                                                            0705
*     R14 UNRSTD;                                                  0705
*   RFY                                                            0706
*     WQEPTR RSTD;                                                 0706
         EJECT
*                                                                  0707
*/********************************************************************/
*/*      CLEAR WAIT QUEUE                                            */
*/********************************************************************/
*                                                                  0707
*   DO UNTIL(WQEPTR=0);             /* CLEAR WAIT QUEUE              */
@DL00707 DS    0H                                                  0708
*/* TPDEQ (,FMCLCPBQ) RETPTR(WQEPTR)                                 */
*                                                                  0708
*     DO;                           /* BEGIN TPDEQ CODE GENERATION   */
*       DCL                                                        0709
*         FMZCA026 BIT(32) CONSTANT('80000000'X);                  0709
*       DCL                                                        0710
*         FMZCB026 BIT(32) CONSTANT('7FFFFFFF'X);                  0710
*       RFY                                                        0711
*        (GPR00P,                                                  0711
*         GPR01P,                                                  0711
*         GPR14P,                                                  0711
*         GPR15P) RSTD;                                            0711
*       GPR15P=ADDR(FMCLCPBQ);      /* ADDRESS QUEUE POINTER         */
         LA    GPR15P,FMCLCPBQ(,FMCBPTR)                           0712
*       GPR14P=GPR15P->PABWEQA×FMZCA026;                           0713
         L     @11,@CF00493                                        0713
         L     GPR14P,PABWEQA(,GPR15P)                             0713
         OR    GPR14P,@11                                          0713
*       IF GPR14P=FMZCA026 THEN                                    0714
         CLR   GPR14P,@11                                          0714
         BE    @RT00714                                            0714
*         ;                                                        0715
*       ELSE                                                       0716
*         DO;                                                      0716
*FMZL1026:                                                         0717
*           ;                                                      0717
FMZL1026 DS    0H                                                  0718
*           DO WHILE(GPR14P->WKECHAIN^=FMZCA026);                  0718
         B     @DE00718                                            0718
@DL00718 DS    0H                                                  0719
*             GPR15P=ADDR(GPR14P->WKECHAIN);                       0719
         LA    GPR15P,WKECHAIN(,GPR14P)                            0719
*             GPR14P=GPR15P->PABWEQA;                              0720
         L     GPR14P,PABWEQA(,GPR15P)                             0720
*           END;                                                   0721
@DE00718 L     @11,@CF00493                                        0721
         CL    @11,WKECHAIN(,GPR14P)                               0721
         BNE   @DL00718                                            0721
*           GPR00P=FMZCA026;                                       0722
         LR    GPR00P,@11                                          0722
*           CS(GPR14P,GPR00P,GPR15P->PABWEQA);                     0723
         CS    GPR14P,@00,PABWEQA(GPR15P)                          0723
*           BC(7,FMZL1026);                                        0724
         BC    7,FMZL1026                                          0724
*           GPR14P->WKECHAIN=0;                                    0725
         SLR   @11,@11                                             0725
         ST    @11,WKECHAIN(,GPR14P)                               0725
*         END;                                                     0726
*ISTA0026:                                                         0727
*       ;                                                          0727
@RT00714 DS    0H                                                  0727
ISTA0026 DS    0H                                                  0728
*       GPR14P=GPR14P&FMZCB026;                                    0728
         N     GPR14P,@CF00491                                     0728
*       WQEPTR=GPR14P;                                             0729
         LR    WQEPTR,GPR14P                                       0729
*       RFY                                                        0730
*        (GPR00P,                                                  0730
*         GPR01P,                                                  0730
*         GPR14P,                                                  0730
*         GPR15P) UNRSTD;                                          0730
*     END;                          /* END TPDEQ GENERATION GET NEXT
*                                      WAIT QUEUE ELEMENT            */
*     IF WQEPTR^=0 THEN                                            0732
         LTR   WQEPTR,WQEPTR                                       0732
         BZ    @RF00732                                            0732
*       DO;                         /* ANYTHING ON WAIT QUEUE        */
*         LCPBPTR=ZCRSVF6;          /* RESTORE LCPB POINTER  @XM19013*/
         L     @11,RPHCRR(,RPHPTR)                                 0734
         L     @11,CRACRR(,@11)                                    0734
         L     LCPBPTR,ZCRSVF6(,@11)                               0734
*         CALL BFIF1CLR;            /* PURGE WAIT QUEUE      @XM08862*/
         BAL   @14,BFIF1CLR                                        0735
*       END;                        /* END ELEMENT ON WAIT QUEUE     */
*     ELSE                                                         0737
*       ;                           /* NO ELEMENT ON WAIT QUEUE      */
@RF00732 DS    0H                                                  0738
*   END;                            /* WAIT QUEUE CLEARED    @XM19747*/
@DE00707 LTR   WQEPTR,WQEPTR                                       0738
         BNZ   @DL00707                                            0738
         EJECT
*                                                                  0739
*/********************************************************************/
*/*      CLEAR AWAIT QUEUE                                           */
*/********************************************************************/
*                                                                  0739
*   DO UNTIL(WQEPTR=0);             /* CLEAR AWAIT QUEUE             */
@DL00739 DS    0H                                                  0740
*/* TPDEQ (,FMCLCPAQ) RETPTR(WQEPTR)                                 */
*                                                                  0740
*     DO;                           /* BEGIN TPDEQ CODE GENERATION   */
*       RFY                                                        0741
*        (GPR00P,                                                  0741
*         GPR01P,                                                  0741
*         GPR14P,                                                  0741
*         GPR15P) RSTD;                                            0741
*       GPR15P=ADDR(FMCLCPAQ);      /* ADDRESS QUEUE POINTER         */
         LA    GPR15P,FMCLCPAQ(,FMCBPTR)                           0742
*       GPR14P=GPR15P->PABWEQA×FMZCA026;                           0743
         L     @11,@CF00493                                        0743
         L     GPR14P,PABWEQA(,GPR15P)                             0743
         OR    GPR14P,@11                                          0743
*       IF GPR14P=FMZCA026 THEN                                    0744
         CLR   GPR14P,@11                                          0744
         BE    @RT00744                                            0744
*         ;                                                        0745
*       ELSE                                                       0746
*         DO;                                                      0746
*FMZL1030:                                                         0747
*           ;                                                      0747
FMZL1030 DS    0H                                                  0748
*           DO WHILE(GPR14P->WKECHAIN^=FMZCA026);                  0748
         B     @DE00748                                            0748
@DL00748 DS    0H                                                  0749
*             GPR15P=ADDR(GPR14P->WKECHAIN);                       0749
         LA    GPR15P,WKECHAIN(,GPR14P)                            0749
*             GPR14P=GPR15P->PABWEQA;                              0750
         L     GPR14P,PABWEQA(,GPR15P)                             0750
*           END;                                                   0751
@DE00748 L     @11,@CF00493                                        0751
         CL    @11,WKECHAIN(,GPR14P)                               0751
         BNE   @DL00748                                            0751
*           GPR00P=FMZCA026;                                       0752
         LR    GPR00P,@11                                          0752
*           CS(GPR14P,GPR00P,GPR15P->PABWEQA);                     0753
         CS    GPR14P,@00,PABWEQA(GPR15P)                          0753
*           BC(7,FMZL1030);                                        0754
         BC    7,FMZL1030                                          0754
*           GPR14P->WKECHAIN=0;                                    0755
         SLR   @11,@11                                             0755
         ST    @11,WKECHAIN(,GPR14P)                               0755
*         END;                                                     0756
*ISTA0030:                                                         0757
*       ;                                                          0757
@RT00744 DS    0H                                                  0757
ISTA0030 DS    0H                                                  0758
*       GPR14P=GPR14P&FMZCB026;                                    0758
         N     GPR14P,@CF00491                                     0758
*       WQEPTR=GPR14P;                                             0759
         LR    WQEPTR,GPR14P                                       0759
*       RFY                                                        0760
*        (GPR00P,                                                  0760
*         GPR01P,                                                  0760
*         GPR14P,                                                  0760
*         GPR15P) UNRSTD;                                          0760
*     END;                          /* END TPDEQ GENERATION GET NEXT
*                                      AWAIT QUEUE ELEMENT   @XM08862*/
*     IF WQEPTR^=0 THEN                                            0762
         LTR   WQEPTR,WQEPTR                                       0762
         BZ    @RF00762                                            0762
*       DO;                         /* IF ANYTHING ON AWAIT QUEUE    */
*         LCPBPTR=ZCRSVF6;          /* RESTORE LCPB POINTER  @XM19013*/
         L     @11,RPHCRR(,RPHPTR)                                 0764
         L     @11,CRACRR(,@11)                                    0764
         L     LCPBPTR,ZCRSVF6(,@11)                               0764
*         CALL BFIF1CLR;            /* PURGE AWAIT QUEUE             */
         BAL   @14,BFIF1CLR                                        0765
*       END;                        /* END ELEMENT ON AWAIT QUEUE    */
*     ELSE                                                         0767
*       ;                           /* NO ELEMENT ON AWAIT QUEUE     */
@RF00762 DS    0H                                                  0768
*   END;                            /* AWAIT QUEUE CLEARED   @XM19747*/
@DE00739 LTR   WQEPTR,WQEPTR                                       0768
         BNZ   @DL00739                                            0768
         EJECT
*                                                                  0769
*/********************************************************************/
*/*      CLEAR SCHEDULE QUEUE                                        */
*/********************************************************************/
*                                                                  0769
*   DO UNTIL(WQEPTR=0);             /* CLEAR SCHEDULE QUEUE  @XM19747*/
@DL00769 DS    0H                                                  0770
*/* TPDEQ (,FMCSHEDQ) RETPTR(WQEPTR)                                 */
*                                                                  0770
*     DO;                           /* BEGIN TPDEQ CODE GENERATION   */
*       RFY                                                        0771
*        (GPR00P,                                                  0771
*         GPR01P,                                                  0771
*         GPR14P,                                                  0771
*         GPR15P) RSTD;                                            0771
*       GPR15P=ADDR(FMCSHEDQ);      /* ADDRESS QUEUE POINTER         */
         LA    GPR15P,FMCSHEDQ(,FMCBPTR)                           0772
*       GPR14P=GPR15P->PABWEQA×FMZCA026;                           0773
         L     @11,@CF00493                                        0773
         L     GPR14P,PABWEQA(,GPR15P)                             0773
         OR    GPR14P,@11                                          0773
*       IF GPR14P=FMZCA026 THEN                                    0774
         CLR   GPR14P,@11                                          0774
         BE    @RT00774                                            0774
*         ;                                                        0775
*       ELSE                                                       0776
*         DO;                                                      0776
*FMZL1034:                                                         0777
*           ;                                                      0777
FMZL1034 DS    0H                                                  0778
*           DO WHILE(GPR14P->WKECHAIN^=FMZCA026);                  0778
         B     @DE00778                                            0778
@DL00778 DS    0H                                                  0779
*             GPR15P=ADDR(GPR14P->WKECHAIN);                       0779
         LA    GPR15P,WKECHAIN(,GPR14P)                            0779
*             GPR14P=GPR15P->PABWEQA;                              0780
         L     GPR14P,PABWEQA(,GPR15P)                             0780
*           END;                                                   0781
@DE00778 L     @11,@CF00493                                        0781
         CL    @11,WKECHAIN(,GPR14P)                               0781
         BNE   @DL00778                                            0781
*           GPR00P=FMZCA026;                                       0782
         LR    GPR00P,@11                                          0782
*           CS(GPR14P,GPR00P,GPR15P->PABWEQA);                     0783
         CS    GPR14P,@00,PABWEQA(GPR15P)                          0783
*           BC(7,FMZL1034);                                        0784
         BC    7,FMZL1034                                          0784
*           GPR14P->WKECHAIN=0;                                    0785
         SLR   @11,@11                                             0785
         ST    @11,WKECHAIN(,GPR14P)                               0785
*         END;                                                     0786
*ISTA0034:                                                         0787
*       ;                                                          0787
@RT00774 DS    0H                                                  0787
ISTA0034 DS    0H                                                  0788
*       GPR14P=GPR14P&FMZCB026;                                    0788
         N     GPR14P,@CF00491                                     0788
*       WQEPTR=GPR14P;                                             0789
         LR    WQEPTR,GPR14P                                       0789
*       RFY                                                        0790
*        (GPR00P,                                                  0790
*         GPR01P,                                                  0790
*         GPR14P,                                                  0790
*         GPR15P) UNRSTD;                                          0790
*     END;                          /* END TPDEQ GENERATION REMOVE 0791
*                                      ELEMENT FROM SCHEDULE QUEUE 0791
*                                                            @XM19747*/
*     IF WQEPTR^=0 THEN                                            0792
         LTR   WQEPTR,WQEPTR                                       0792
         BZ    @RF00792                                            0792
*       DO;                         /* IF ANY ELEMENT ON QUEUE     0793
*                                                            @XM19747*/
*         ZCRPCOD1=ZCPBUF;          /* ZDFB0 PARAMETER       @XM19747*/
         L     @11,RPHCRR(,RPHPTR)                                 0794
         L     @11,CRACRR(,@11)                                    0794
         MVI   ZCRPCOD1(@11),X'04'                                 0794
*         LCPBPTR=WQEPTR->LSCFDBA;  /* ZDFB0 PARAMETER       @XM19747*/
         L     LCPBPTR,LSCFDBA(,WQEPTR)                            0795
*         CALL ISTZDFB0;            /* BUFFER RELEASE UTILITY      0796
*                                                            @XM19747*/
         L     @11,ATCZPSVT(,ATCVTPTR)                             0796
         L     @15,ZPSZDFB0(,@11)                                  0796
         BALR  @14,@15                                             0796
*         WQEPTR->LSCFDBA=0;        /* CLEAR BUFFER POINTER  @XM19747*/
         SLR   @11,@11                                             0797
         ST    @11,LSCFDBA(,WQEPTR)                                0797
*         LCPBPTR=ZCRSVF6;          /* RESTORE LCPB POINTER  @XM19747*/
         L     @11,RPHCRR(,RPHPTR)                                 0798
         L     @11,CRACRR(,@11)                                    0798
         L     LCPBPTR,ZCRSVF6(,@11)                               0798
*         CALL BFIF1CLR;            /* PURGE SCHEDULE QUEUE  @XM19747*/
         BAL   @14,BFIF1CLR                                        0799
*       END;                        /* END ELEMENT ON SCHEDULE QUEUE
*                                                            @XM19747*/
*     ELSE                                                         0801
*       ;                           /* NO ELEMENT ON SCHEDULE QUEUE
*                                                            @XM19747*/
@RF00792 DS    0H                                                  0802
*   END;                            /* SCHEDULE QUEUE CLEARED      0802
*                                                            @XM19747*/
@DE00769 LTR   WQEPTR,WQEPTR                                       0802
         BNZ   @DL00769                                            0802
         EJECT
*                                                                  0803
*/********************************************************************/
*/*      CLEAR FMCB TOP                                              */
*/********************************************************************/
*                                                                  0803
*   DO UNTIL(WQEPTR=0);             /* FMCB TOP              @XM19747*/
@DL00803 DS    0H                                                  0804
*/* TPDEQ (,FMCPAB3) RETPTR(WQEPTR)                                  */
*                                                                  0804
*     DO;                           /* BEGIN TPDEQ CODE GENERATION   */
*       RFY                                                        0805
*        (GPR00P,                                                  0805
*         GPR01P,                                                  0805
*         GPR14P,                                                  0805
*         GPR15P) RSTD;                                            0805
*       GPR15P=ADDR(FMCPAB3);       /* ADDRESS QUEUE POINTER         */
         LA    GPR15P,FMCPAB3(,FMCBPTR)                            0806
*       GPR14P=GPR15P->PABWEQA×FMZCA026;                           0807
         L     @11,@CF00493                                        0807
         L     GPR14P,PABWEQA(,GPR15P)                             0807
         OR    GPR14P,@11                                          0807
*       IF GPR14P=FMZCA026 THEN                                    0808
         CLR   GPR14P,@11                                          0808
         BE    @RT00808                                            0808
*         ;                                                        0809
*       ELSE                                                       0810
*         DO;                                                      0810
*FMZL1038:                                                         0811
*           ;                                                      0811
FMZL1038 DS    0H                                                  0812
*           DO WHILE(GPR14P->WKECHAIN^=FMZCA026);                  0812
         B     @DE00812                                            0812
@DL00812 DS    0H                                                  0813
*             GPR15P=ADDR(GPR14P->WKECHAIN);                       0813
         LA    GPR15P,WKECHAIN(,GPR14P)                            0813
*             GPR14P=GPR15P->PABWEQA;                              0814
         L     GPR14P,PABWEQA(,GPR15P)                             0814
*           END;                                                   0815
@DE00812 L     @11,@CF00493                                        0815
         CL    @11,WKECHAIN(,GPR14P)                               0815
         BNE   @DL00812                                            0815
*           GPR00P=FMZCA026;                                       0816
         LR    GPR00P,@11                                          0816
*           CS(GPR14P,GPR00P,GPR15P->PABWEQA);                     0817
         CS    GPR14P,@00,PABWEQA(GPR15P)                          0817
*           BC(7,FMZL1038);                                        0818
         BC    7,FMZL1038                                          0818
*           GPR14P->WKECHAIN=0;                                    0819
         SLR   @11,@11                                             0819
         ST    @11,WKECHAIN(,GPR14P)                               0819
*         END;                                                     0820
*ISTA0038:                                                         0821
*       ;                                                          0821
@RT00808 DS    0H                                                  0821
ISTA0038 DS    0H                                                  0822
*       GPR14P=GPR14P&FMZCB026;                                    0822
         N     GPR14P,@CF00491                                     0822
*       WQEPTR=GPR14P;                                             0823
         LR    WQEPTR,GPR14P                                       0823
*       RFY                                                        0824
*        (GPR00P,                                                  0824
*         GPR01P,                                                  0824
*         GPR14P,                                                  0824
*         GPR15P) UNRSTD;                                          0824
*     END;                          /* END TPDEQ GENERATION REMOVE 0825
*                                      ELEMENT FROM FMCB TOP @XM19747*/
*     IF WQEPTR^=0 THEN                                            0826
         LTR   WQEPTR,WQEPTR                                       0826
         BZ    @RF00826                                            0826
*       DO;                         /* IF ANY ELEMENT FMCB TOP     0827
*                                                            @XM19747*/
*         LCPBPTR=ZCRSVF6;          /* RESTORE LCPB POINTER  @XM19747*/
         L     @11,RPHCRR(,RPHPTR)                                 0828
         L     @11,CRACRR(,@11)                                    0828
         L     LCPBPTR,ZCRSVF6(,@11)                               0828
*         CALL BFIF1CLR;            /* PURGE FMCB TOP        @XM19747*/
         BAL   @14,BFIF1CLR                                        0829
*       END;                        /* END ELEMENT ON FMCB TOP     0830
*                                                            @XM19747*/
*     ELSE                                                         0831
*       ;                           /* NO ELEMENT ON FMCB TOP      0831
*                                                            @XM19747*/
@RF00826 DS    0H                                                  0832
*   END;                            /* FMCB TOP CLEARED      @XM19747*/
@DE00803 LTR   WQEPTR,WQEPTR                                       0832
         BNZ   @DL00803                                            0832
         EJECT
*                                                                  0833
*/********************************************************************/
*/*      CLEAR ASYNCHRONOUS SCHEDULE QUEUE                           */
*/********************************************************************/
*                                                                  0833
*   DO UNTIL(WQEPTR=0);             /* CLEAR ASYNCHRONOUS SCHEDULE 0833
*                                      QUEUE                 @XM19747*/
@DL00833 DS    0H                                                  0834
*/* TPDEQ (,FMCSHEAQ) RETPTR(WQEPTR)                                 */
*                                                                  0834
*     DO;                           /* BEGIN TPDEQ CODE GENERATION   */
*       RFY                                                        0835
*        (GPR00P,                                                  0835
*         GPR01P,                                                  0835
*         GPR14P,                                                  0835
*         GPR15P) RSTD;                                            0835
*       GPR15P=ADDR(FMCSHEAQ);      /* ADDRESS QUEUE POINTER         */
         LA    GPR15P,FMCSHEAQ(,FMCBPTR)                           0836
*       GPR14P=GPR15P->PABWEQA×FMZCA026;                           0837
         L     @11,@CF00493                                        0837
         L     GPR14P,PABWEQA(,GPR15P)                             0837
         OR    GPR14P,@11                                          0837
*       IF GPR14P=FMZCA026 THEN                                    0838
         CLR   GPR14P,@11                                          0838
         BE    @RT00838                                            0838
*         ;                                                        0839
*       ELSE                                                       0840
*         DO;                                                      0840
*FMZL1042:                                                         0841
*           ;                                                      0841
FMZL1042 DS    0H                                                  0842
*           DO WHILE(GPR14P->WKECHAIN^=FMZCA026);                  0842
         B     @DE00842                                            0842
@DL00842 DS    0H                                                  0843
*             GPR15P=ADDR(GPR14P->WKECHAIN);                       0843
         LA    GPR15P,WKECHAIN(,GPR14P)                            0843
*             GPR14P=GPR15P->PABWEQA;                              0844
         L     GPR14P,PABWEQA(,GPR15P)                             0844
*           END;                                                   0845
@DE00842 L     @11,@CF00493                                        0845
         CL    @11,WKECHAIN(,GPR14P)                               0845
         BNE   @DL00842                                            0845
*           GPR00P=FMZCA026;                                       0846
         LR    GPR00P,@11                                          0846
*           CS(GPR14P,GPR00P,GPR15P->PABWEQA);                     0847
         CS    GPR14P,@00,PABWEQA(GPR15P)                          0847
*           BC(7,FMZL1042);                                        0848
         BC    7,FMZL1042                                          0848
*           GPR14P->WKECHAIN=0;                                    0849
         SLR   @11,@11                                             0849
         ST    @11,WKECHAIN(,GPR14P)                               0849
*         END;                                                     0850
*ISTA0042:                                                         0851
*       ;                                                          0851
@RT00838 DS    0H                                                  0851
ISTA0042 DS    0H                                                  0852
*       GPR14P=GPR14P&FMZCB026;                                    0852
         N     GPR14P,@CF00491                                     0852
*       WQEPTR=GPR14P;                                             0853
         LR    WQEPTR,GPR14P                                       0853
*       RFY                                                        0854
*        (GPR00P,                                                  0854
*         GPR01P,                                                  0854
*         GPR14P,                                                  0854
*         GPR15P) UNRSTD;                                          0854
*     END;                          /* END TPDEQ GENERATION REMOVE 0855
*                                      ELEMENT FROM ASCHED QUEUE   0855
*                                                            @XM19747*/
*     IF WQEPTR^=0 THEN                                            0856
         LTR   WQEPTR,WQEPTR                                       0856
         BZ    @RF00856                                            0856
*       DO;                         /* IF ANY ELEMENT ON QUEUE     0857
*                                                            @XM19747*/
*         LCPBPTR=ZCRSVF6;          /* RESTORE LCPB POINTER  @XM19747*/
         L     @11,RPHCRR(,RPHPTR)                                 0858
         L     @11,CRACRR(,@11)                                    0858
         L     LCPBPTR,ZCRSVF6(,@11)                               0858
*         CALL BFIF1CLR;            /* PURGE ASYNCHRONOUS SCHEDULE 0859
*                                      QUEUE                 @XM19747*/
         BAL   @14,BFIF1CLR                                        0859
*       END;                        /* END ELEMENT ON ASYNCHRONOUS 0860
*                                      SCHEDULE QUEUE        @XM19747*/
*     ELSE                                                         0861
*       ;                           /* NO ELEMENT ON ASYNCHRONOUS  0861
*                                      SCHEDULE QUEUE        @XM19747*/
@RF00856 DS    0H                                                  0862
*   END;                            /* ASYNCHRONOUS SCHEDULE QUEUE 0862
*                                      CLEARED               @XM19747*/
@DE00833 LTR   WQEPTR,WQEPTR                                       0862
         BNZ   @DL00833                                            0862
         EJECT
*                                                                  0863
*/********************************************************************/
*/*      CLEAR ATOP SIDE QUEUE                                       */
*/********************************************************************/
*                                                                  0863
*   DO UNTIL(WQEPTR=0);             /* CLEAR ATOP SIDE QUEUE @XM19747*/
@DL00863 DS    0H                                                  0864
*     LCPBPTR=ZCRSVF6;              /* RESTORE LCPB POINTER  @XM19747*/
         L     @11,RPHCRR(,RPHPTR)                                 0864
         L     @11,CRACRR(,@11)                                    0864
         L     LCPBPTR,ZCRSVF6(,@11)                               0864
*/* TPDEQ (,LCPRSTQH) RETPTR(WQEPTR)RESET(YES)                       */
*                                                                  0865
*     DO;                           /* BEGIN TPDEQ CODE GENERATION   */
*       RFY                                                        0866
*        (GPR00P,                                                  0866
*         GPR01P,                                                  0866
*         GPR14P,                                                  0866
*         GPR15P) RSTD;                                            0866
*       GPR15P=ADDR(LCPRSTQH);      /* ADDRESS QUEUE POINTER         */
         LA    GPR15P,LCPRSTQH(,LCPBPTR)                           0867
*       RFY                                                        0868
*        (GPR02P,                                                  0868
*         GPR03P) RSTD;                                            0868
*       STM(GPR02P,GPR03P,GPR01P->RPHWORK(5:12));                  0869
         STM   GPR02P,GPR03P,RPHWORK+4(GPR01P)                     0869
*       IF GPR15P->PABWEQA=PABWEQG1×GPR15P->PABWEQA=0 THEN         0870
         L     @11,PABWEQA(,GPR15P)                                0870
         CL    @11,@CF00493                                        0870
         BE    @RT00870                                            0870
         LTR   @11,@11                                             0870
         BNZ   @RF00870                                            0870
@RT00870 DS    0H                                                  0871
*         GPR14P=PABWEQG1;                                         0871
         L     GPR14P,@CF00493                                     0871
*       ELSE                                                       0872
*         DO;                                                      0872
         B     @RC00870                                            0872
@RF00870 DS    0H                                                  0873
*FMZL1046:                                                         0873
*           ;                                                      0873
FMZL1046 DS    0H                                                  0874
*           GPR14P=GPR15P->PABWEQA;                                0874
         L     GPR14P,PABWEQA(,GPR15P)                             0874
*           IF GPR14P->WKECHAIN=PABWEQG1 THEN                      0875
         L     @11,@CF00493                                        0875
         CL    @11,WKECHAIN(,GPR14P)                               0875
         BNE   @RF00875                                            0875
*             DO;                                                  0876
*               IF GPR14P->FSBTYPE=FSTYPE×GPR14P->LCPRESET='0'B×GPR14P
*                   ->LCPRSTQH=PABWEQG1 THEN                       0877
         CLI   FSBTYPE(GPR14P),X'02'                               0877
         BE    @RT00877                                            0877
         TM    LCPRESET(GPR14P),B'10000000'                        0877
         BZ    @RT00877                                            0877
         CL    @11,LCPRSTQH(,GPR14P)                               0877
         BNE   @RF00877                                            0877
@RT00877 DS    0H                                                  0878
*                 DO;                                              0878
*                   GPR02P=PABWEQG1;                               0879
         L     GPR02P,@CF00493                                     0879
*                   CS(GPR14P,GPR02P,GPR15P->PABWEQA);             0880
         CS    GPR14P,@02,PABWEQA(GPR15P)                          0880
*                   BC(7,FMZL1046);                                0881
         BC    7,FMZL1046                                          0881
*                   GPR14P->WKECHAIN=0;                            0882
         SLR   @11,@11                                             0882
         ST    @11,WKECHAIN(,GPR14P)                               0882
*                 END;                                             0883
*               ELSE                                               0884
*                 DO;                                              0884
         B     @RC00877                                            0884
@RF00877 DS    0H                                                  0885
*                   GPR15P=ADDR(GPR14P->LCPRSTQH);                 0885
         LA    GPR15P,LCPRSTQH(,GPR14P)                            0885
*                   GOTO FMZL1046;                                 0886
         B     FMZL1046                                            0886
*                 END;                                             0887
*             END;                                                 0888
*           ELSE                                                   0889
*             DO;                                                  0889
         B     @RC00875                                            0889
@RF00875 DS    0H                                                  0890
*               GPR15P=ADDR(GPR14P->WKECHAIN);                     0890
         LA    GPR15P,WKECHAIN(,GPR14P)                            0890
*               GOTO FMZL1046;                                     0891
         B     FMZL1046                                            0891
*             END;                                                 0892
*         END;                                                     0893
@RC00875 DS    0H                                                  0894
*ISTA0046:                                                         0894
*       ;                                                          0894
@RC00870 DS    0H                                                  0894
ISTA0046 DS    0H                                                  0895
*       LM(GPR02P,GPR03P,GPR01P->RPHWORK(5:12));                   0895
         LM    GPR02P,GPR03P,RPHWORK+4(GPR01P)                     0895
*       RFY                                                        0896
*        (GPR02P,                                                  0896
*         GPR03P) UNRSTD;                                          0896
*       GPR14P=GPR14P&FMZCB026;                                    0897
         N     GPR14P,@CF00491                                     0897
*       WQEPTR=GPR14P;                                             0898
         LR    WQEPTR,GPR14P                                       0898
*       RFY                                                        0899
*        (GPR00P,                                                  0899
*         GPR01P,                                                  0899
*         GPR14P,                                                  0899
*         GPR15P) UNRSTD;                                          0899
*     END;                          /* END TPDEQ GENERATION REMOVE 0900
*                                      ELEMENT FROM ELEMENT SIDEQ  0900
*                                                            @XM19747*/
*     IF WQEPTR^=0 THEN             /* IF ANY ELEMENT ON FMCB ATOP 0901
*                                      SIDE QUEUE            @XM19747*/
         LTR   WQEPTR,WQEPTR                                       0901
         BZ    @RF00901                                            0901
*       IF WQEPTR->LCPTYPE=FSTYPE THEN                             0902
         CLI   LCPTYPE(WQEPTR),X'02'                               0902
         BNE   @RF00902                                            0902
*         DO;                       /* IF ELEMENT IS A FSB   @XM19747*/
*           LCPBPTR=WQEPTR;         /* ADDRESS FSB           @XM19747*/
         LR    LCPBPTR,WQEPTR                                      0904
*           CALL ISTZBFSC;          /* PROCESS FSB           @XM19747*/
         L     @11,PABDVTA+95(,FMCBPTR)                            0905
         L     @15,ZLBZBFSC(,@11)                                  0905
         BALR  @14,@15                                             0905
*         END;                      /* END ELEMENT A FSB     @XM19747*/
*       ELSE                        /* ELEMENT IS A LCPB     @XM19747*/
*         CALL BFIF1CLR;            /* PURGE SIDE QUEUE ELEMENT    0907
*                                                            @XM19747*/
         B     @RC00902                                            0907
@RF00902 BAL   @14,BFIF1CLR                                        0907
*     ELSE                                                         0908
*       ;                           /* NO ELEMENT ON FMCB ATOP SIDE
*                                      QUEUE                 @XM19747*/
@RF00901 DS    0H                                                  0909
*   END;                            /* ATOP SIDE QUEUE CLEARED     0909
*                                                            @XM19747*/
@RC00901 DS    0H                                                  0909
@DE00863 LTR   WQEPTR,WQEPTR                                       0909
         BNZ   @DL00863                                            0909
*   RFY                                                            0910
*     WQEPTR UNRSTD;                                               0910
*   RFY                                                            0911
*     R14 RSTD;                                                    0911
*   LCPBPTR=ZCRSVF6;                /* RESTORE PTR(LCPB)     @XM09587*/
         L     @15,RPHCRR(,RPHPTR)                                 0912
         L     @15,CRACRR(,@15)                                    0912
         L     LCPBPTR,ZCRSVF6(,@15)                               0912
*   R14=ZCRSVF4;                                                   0913
         L     R14,ZCRSVF4(,@15)                                   0913
*   RFY                                                            0914
*     R14 UNRSTD;                                                  0914
*   END BFIF0CLR;                                                  0915
@EL00002 DS    0H                                                  0915
@EF00002 DS    0H                                                  0915
@ER00002 BR    @14                                                 0915
         EJECT
*                                                                  0916
*/********************************************************************/
*/*                                                                  */
*/* SUBROUTINE-                                                      */
*/*      BFIF1CLR                                                    */
*/*                                                                  */
*/* FUNCTION-                                                        */
*/*      POST BACK THE COMPLETION FOR A CLEARED REQUEST.             */
*/*                                                                  */
*/********************************************************************/
*                                                                  0916
*BFIF1CLR:                                                         0916
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0916
BFIF1CLR DS    0H                                                  0917
*   RFY                                                            0917
*     R14 RSTD;                                                    0917
*   RFY                                                            0918
*     WQEPTR RSTD;                                                 0918
*   ZCRSVF5=R14;                    /* SAVE RETURN REG               */
         L     @15,RPHCRR(,RPHPTR)                                 0919
         L     @15,CRACRR(,@15)                                    0919
         ST    R14,ZCRSVF5(,@15)                                   0919
*   RFY                                                            0920
*     R14 UNRSTD;                                                  0920
*   RFY                                                            0921
*     ISTLSCB BASED(WQEPTR);                                       0921
*   IF LSCFDBA=0 THEN                                              0922
         L     @11,LSCFDBA(,WQEPTR)                                0922
         LTR   @11,@11                                             0922
         BNZ   @RF00922                                            0922
*     DO;                           /* IF NO FSB                     */
*       ZCRPCOD1=0;                 /* ZDFA0 PARAMETER               */
         MVI   ZCRPCOD1(@15),X'00'                                 0924
*       ZCRPFSB='1'B;               /* ZDFA0 PARAMETER               */
         OI    ZCRPFSB(@15),B'00100000'                            0925
*       CALL ISTZDFA0;              /* BUFFER ALLOCATION UTIKITY     */
         L     @11,ATCZPSVT(,ATCVTPTR)                             0926
         L     @15,ZPSZDFA0(,@11)                                  0926
         BALR  @14,@15                                             0926
*       LSCFDBA=NEWFSB;             /* ATTACH FSB TO ELEMENT @XM19013*/
         L     @11,NEWFSB(,RPHPTR)                                 0927
         ST    @11,LSCFDBA(,WQEPTR)                                0927
*       RFY                                                        0928
*         ISTFSB BASED(LSCFDBA);    /* BASE FSB FROM LCPB    @XM19013*/
*     END;                          /* END FSB ALLOCATION    @XM19013*/
*   ELSE                            /* IF ALREADY ATTACHED   @XM19013*/
*     ADDR(FSBFDB)->FDBOFSET=DISFDBS;/* SET FDB OFFSET FOR CONTROL 0930
*                                      LAYER                 @XM19013*/
*                                                                  0930
         B     @RC00922                                            0930
@RF00922 L     @11,LSCFDBA(,WQEPTR)                                0930
         L     @09,DISFDBS                                         0930
         STH   @09,FDBOFSET+32(,@11)                               0930
*   /*****************************************************************/
*   /*                                                               */
*   /* LOGIC FOR INITIALIZING THE FSB MADE COMMON WHETHER OR NOT THE */
*   /* FSB WAS ALLOCATED BY ZBFIF                            @XM19013*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0931
*   IF LSCTYPE=LSTYPE THEN                                         0931
@RC00922 CLI   LSCTYPE(WQEPTR),X'DF'                               0931
         BNE   @RF00931                                            0931
*     DO;                           /* IF INPUT A LSCB       @XM19013*/
*       FSBLCPB=LSCLCPBA;           /* ADDRESS LCPB FROM LSCB      0933
*                                                            @XM19013*/
         L     @11,LSCFDBA(,WQEPTR)                                0933
         L     @09,LSCLCPBA(,WQEPTR)                               0933
         ST    @09,FSBLCPB(,@11)                                   0933
*       FSBCID=LSCLCPBA->LCPCID;    /* SET CID IN FSB                */
         MVC   FSBCID(4,@11),LCPCID(@09)                           0934
*     END;                          /* END LSCB PROCESS              */
*   ELSE                                                           0936
*     DO;                           /* NOT LSCB - IS LCPB            */
         B     @RC00931                                            0936
@RF00931 DS    0H                                                  0937
*       FSBLCPB=WQEPTR;             /* SET LCPB PTR IN FSB           */
         L     @11,LSCFDBA(,WQEPTR)                                0937
         ST    WQEPTR,FSBLCPB(,@11)                                0937
*       FSBCID=WQEPTR->LCPCID;      /* SET CID IN FSB                */
         MVC   FSBCID(4,@11),LCPCID(WQEPTR)                        0938
*     END;                          /* END LCPB PROCESSING           */
*   FSBLCCWA=LSCLCCWA;              /* SET LCCW PTR IN FSB           */
@RC00931 L     @11,LSCFDBA(,WQEPTR)                                0940
         L     @09,LSCLCCWA(,WQEPTR)                               0940
         ST    @09,FSBLCCWA(,@11)                                  0940
*   ADDR(FSBFDB)->FDBFDBA=0;        /* CLEAR CHAIN POINTER   @XM19013*/
         SLR   @09,@09                                             0941
         LA    @15,32                                              0941
         ALR   @15,@11                                             0941
         ST    @09,FDBFDBA(,@15)                                   0941
*   ADDR(FSBFDB)->FDBDATAA=0;       /* CLEAR DATA POINTER    @XM19013*/
         ST    @09,FDBDATAA(,@15)                                  0942
*   ADDR(FSBFDB)->FDBDATCT=0;       /* CLEAR DATA COUNT      @XM19013*/
         STH   @09,FDBDATCT(,@15)                                  0943
*   FSBMJRCD=FRPURGE;               /* INDICATE OPERATION PURGED     */
         MVI   FSBMJRCD(@11),X'1C'                                 0944
*   FSBMNRCD=LCPRUCNT;              /* REASON CODE                   */
         IC    @09,LCPRUCNT(,LCPBPTR)                              0945
         STC   @09,FSBMNRCD(,@11)                                  0945
*   LCPBPTR=FSBLCPB;                /* ADDRESS LCPB          @XM19013*/
         L     LCPBPTR,FSBLCPB(,@11)                               0946
*   IF LCPTYPE=LCPETYPE THEN                                       0947
         CLI   LCPTYPE(LCPBPTR),X'40'                              0947
         BNE   @RF00947                                            0947
*     DO;                           /* IF SESSION CONTROL    @XM19013*/
*       FMCUIPI='0'B;               /* CLEAR UNBIND IN PROGRESS FLAG
*                                                            @XM19475*/
         NI    FMCUIPI(FMCBPTR),B'11011111'                        0949
*       ZCRSVF8=LCPBPTR;            /* SAVE LCPB POINTER     @XM19013*/
         L     @11,RPHCRR(,RPHPTR)                                 0950
         L     @11,CRACRR(,@11)                                    0950
         ST    LCPBPTR,ZCRSVF8(,@11)                               0950
*       IF LSCTYPE=LSTYPE THEN                                     0951
         CLI   LSCTYPE(WQEPTR),X'DF'                               0951
         BNE   @RF00951                                            0951
*         DO;                       /* IF CLEAR/UNBIND CLEAR SEQUENCE
*                                                            @XM19013*/
*/* TPDEQ (LCPBPTR,FMCPAB5) RESET(RECON)                             */
*                                                                  0953
*           DO;                     /* BEGIN TPDEQ CODE GENERATION   */
*             RFY                                                  0954
*              (GPR00P,                                            0954
*               GPR01P,                                            0954
*               GPR14P,                                            0954
*               GPR15P) RSTD;                                      0954
*             GPR15P=ADDR(FMCPAB5); /* ADDRESS QUEUE POINTER         */
         LA    GPR15P,FMCPAB5(,FMCBPTR)                            0955
*             RFY                                                  0956
*              (GPR02P,                                            0956
*               GPR03P) RSTD;                                      0956
*             STM(GPR02P,GPR03P,GPR01P->RPHWORK(5:12));            0957
         STM   GPR02P,GPR03P,RPHWORK+4(GPR01P)                     0957
*             GPR03P=LCPBPTR×FMZCA026;                             0958
         L     @11,@CF00493                                        0958
         LR    GPR03P,LCPBPTR                                      0958
         OR    GPR03P,@11                                          0958
*             GPR14P=FMZCA026;                                     0959
         LR    GPR14P,@11                                          0959
*             GPR15P=ADDR(GPR15P->PABWEQA);                        0960
*FMZL1053:                                                         0961
*             ;                                                    0961
FMZL1053 DS    0H                                                  0962
*             GPR02P=GPR15P->PABWEQA×FMZCA026;                     0962
         L     GPR02P,PABWEQA(,GPR15P)                             0962
         O     GPR02P,@CF00493                                     0962
*             DO WHILE(GPR02P^=GPR14P);                            0963
         B     @DE00963                                            0963
@DL00963 DS    0H                                                  0964
*               DO WHILE((GPR02P->WKECHAIN)^=GPR14P);              0964
         B     @DE00964                                            0964
@DL00964 DS    0H                                                  0965
*                 GPR15P=ADDR(GPR02P->WKECHAIN);                   0965
         LA    GPR15P,WKECHAIN(,GPR02P)                            0965
*                 GPR02P=GPR02P->WKECHAIN;                         0966
         L     GPR02P,WKECHAIN(,GPR02P)                            0966
*               END;                                               0967
@DE00964 C     GPR14P,WKECHAIN(,GPR02P)                            0967
         BNE   @DL00964                                            0967
*               IF GPR02P=GPR03P THEN                              0968
         CR    GPR02P,GPR03P                                       0968
         BNE   @RF00968                                            0968
*                 DO;                                              0969
*                   GPR00P=GPR02P->LCPRSTQH;                       0970
         L     GPR00P,LCPRSTQH(,GPR02P)                            0970
*                   CS(GPR02P,GPR00P,GPR15P->PABWEQA);             0971
         CS    GPR02P,@00,PABWEQA(GPR15P)                          0971
*                   BC(7,FMZL3053);                                0972
         BC    7,FMZL3053                                          0972
*                   GPR02P->LCPRSTQH='80000000'X;                  0973
         MVC   LCPRSTQH(4,GPR02P),@CF00493                         0973
*                   GPR14P=GPR02P;                                 0974
         LR    GPR14P,GPR02P                                       0974
*                   GPR14P->WKECHAIN=0;                            0975
         SLR   @11,@11                                             0975
         ST    @11,WKECHAIN(,GPR14P)                               0975
*                 END;                                             0976
*               ELSE                                               0977
*                 DO;                                              0977
         B     @RC00968                                            0977
@RF00968 DS    0H                                                  0978
*                   IF GPR02P->FSBTYPE=FSTYPE THEN                 0978
         CLI   FSBTYPE(GPR02P),X'02'                               0978
         BNE   @RF00978                                            0978
*                     DO;                                          0979
*                       GPR02P=GPR14P;                             0980
         LR    GPR02P,GPR14P                                       0980
*                       GOTO FMZL3053;                             0981
         B     FMZL3053                                            0981
*                     END;                                         0982
*                   GPR15P=ADDR(GPR02P->LCPRSTQH);                 0983
@RF00978 LA    GPR15P,LCPRSTQH(,GPR02P)                            0983
*                   GOTO FMZL1053;                                 0984
         B     FMZL1053                                            0984
*                 END;                                             0985
*FMZL3053:                                                         0986
*               ;                                                  0986
@RC00968 DS    0H                                                  0986
FMZL3053 DS    0H                                                  0987
*             END;                                                 0987
@DE00963 CR    GPR02P,GPR14P                                       0987
         BNE   @DL00963                                            0987
*ISTA0053:                                                         0988
*             ;                                                    0988
ISTA0053 DS    0H                                                  0989
*             LM(GPR02P,GPR03P,GPR01P->RPHWORK(5:12));             0989
         LM    GPR02P,GPR03P,RPHWORK+4(GPR01P)                     0989
*             RFY                                                  0990
*              (GPR02P,                                            0990
*               GPR03P) UNRSTD;                                    0990
*             GPR14P=GPR14P&FMZCB026;                              0991
         N     GPR14P,@CF00491                                     0991
*             GPR01P->RPHWEA=GPR14P;                               0992
         ST    GPR14P,RPHWEA(,GPR01P)                              0992
*             RFY                                                  0993
*              (GPR00P,                                            0993
*               GPR01P,                                            0993
*               GPR14P,                                            0993
*               GPR15P) UNRSTD;                                    0993
*           END;                    /* END TPDEQ GENERATION REMOVE 0994
*                                      CLEAR/UNBIND LCPB FROM ATOP 0994
*                                      ELEMENT SIDE QUEUE    @XM19013*/
*           LCPFDBA=LSCFDBA;        /* COPY FSB TO LCPB      @XM19013*/
         L     @11,LSCFDBA(,WQEPTR)                                0995
         ST    @11,LCPFDBA(,LCPBPTR)                               0995
*           LSCFDBA=0;              /* CLEAR FSB POINTER IN LSCB   0996
*                                                            @XM19013*/
         SLR   @11,@11                                             0996
         ST    @11,LSCFDBA(,WQEPTR)                                0996
*           ZCRPCOD1=ZCPLSCB;       /* ZDFB0 PARAMETER       @XM19013*/
         L     @11,RPHCRR(,RPHPTR)                                 0997
         L     @11,CRACRR(,@11)                                    0997
         MVI   ZCRPCOD1(@11),X'08'                                 0997
*           LCPBPTR=WQEPTR;         /* ZDFB0 PARAMETER       @XM19013*/
         LR    LCPBPTR,WQEPTR                                      0998
*           CALL ISTZDFB0;          /* BUFFER RELEASE UTILITY      0999
*                                                            @XM19013*/
         L     @11,ATCZPSVT(,ATCVTPTR)                             0999
         L     @15,ZPSZDFB0(,@11)                                  0999
         BALR  @14,@15                                             0999
*           LCPBPTR=ZCRSVF8;        /* RESTORE LCPB POINTER  @XM19013*/
         L     @11,RPHCRR(,RPHPTR)                                 1000
         L     @11,CRACRR(,@11)                                    1000
         L     LCPBPTR,ZCRSVF8(,@11)                               1000
*         END;                      /* END CLEAR OF CLEAR    @XM19013*/
*       ELSE                                                       1002
*         ;                         /* NOT CLEAR OF CLEAR    @XM19013*/
@RF00951 DS    0H                                                  1003
*       IF LCPTLBPI='1'B THEN                                      1003
         TM    LCPTLBPI(LCPBPTR),B'00010000'                       1003
         BNO   @RF01003                                            1003
*         DO;                       /* IF TLB PRESENT        @XM19013*/
*           IF LCPTLBAD->TLBFSBA^=0 THEN                           1005
         L     @11,LCPTLBAD(,LCPBPTR)                              1005
         L     @11,TLBFSBA(,@11)                                   1005
         LTR   @11,@11                                             1005
         BZ    @RF01005                                            1005
*             DO;                   /* IF TLB FSB PRESENT    @XM19013*/
*               ZCRPCOD1=ZCPBUF;    /* ZDFB0 PARAMETER       @XM19013*/
         L     @09,RPHCRR(,RPHPTR)                                 1007
         L     @09,CRACRR(,@09)                                    1007
         MVI   ZCRPCOD1(@09),X'04'                                 1007
*               LCPBPTR=LCPTLBAD->TLBFSBA-DISFSB;/* ZDFB0 PARAMETER
*                                                            @XM19013*/
         SL    @11,DISFSB                                          1008
         LR    LCPBPTR,@11                                         1008
*               CALL ISTZDFB0;      /* RELEASE TLB FSB       @XM19013*/
         L     @11,ATCZPSVT(,ATCVTPTR)                             1009
         L     @15,ZPSZDFB0(,@11)                                  1009
         BALR  @14,@15                                             1009
*               LCPBPTR=ZCRSVF8;    /* RESTORE LCPB PTR      @XM19013*/
         L     @11,RPHCRR(,RPHPTR)                                 1010
         L     @11,CRACRR(,@11)                                    1010
         L     LCPBPTR,ZCRSVF8(,@11)                               1010
*             END;                  /* END TLB FSB RELEASE   @XM19013*/
*           ELSE                                                   1012
*             ;                     /* NO TLB FSB PRESENT    @XM19013*/
@RF01005 DS    0H                                                  1013
*           LCPBPTR=LCPTLBAD-LENGTH(ISTBFHDR);/* ADDRESS TLB TO BE 1013
*                                      RELEASED              @XM19013*/
*                                                                  1013
         L     @11,LCPTLBAD(,LCPBPTR)                              1013
         SL    @11,@CF00071                                        1013
         LR    LCPBPTR,@11                                         1013
*           /*********************************************************/
*           /*                                                       */
*           /* RELSTORE BUFADDR(LCPBPTR)                             */
*           /*                                                       */
*           /*********************************************************/
*                                                                  1014
*           DO;                                                    1014
*                                                                  1014
*/* ATBUILD (ISTATCVT,ISTRPH)                                        */
*/* END OF ATBUILD                                                   */
*                                                                  1015
*             RFY                                                  1015
*              (GPR02P,                                            1015
*               GPR03P,                                            1015
*               GPR04P,                                            1015
*               GPR15P) RSTD;                                      1015
*             RFY                                                  1016
*              (GPR01P,                                            1016
*               GPR13P) RSTD;                                      1016
*             GENERATE REFS(GPR01P,GPR02P,GPR13P) SETS(RPHWORK);   1017
          STM GPR02P,GPR13P,RPHWORK(GPR01P)
*             RFY                                                  1018
*               GPR13P UNRSTD;                                     1018
*             GPR04P=LCPBPTR;                                      1019
         LR    GPR04P,LCPBPTR                                      1019
*             DCL                                                  1020
*               1 FMZA0060 FIXED(31) STATIC LOCAL,                 1020
*                2 * FIXED(8) INIT(64),                            1020
*                2 * PTR(24) INIT(0);                              1020
*             GPR03F=FMZA0060;                                     1021
         L     GPR03F,FMZA0060                                     1021
*             DO;                   /* LISATCVT                    1022
*                                      CVTBASE(PAGEABLE,(GPR15P))    */
*               GPR15P=ATCLCPTR;    /* SET UP ATCVT POINTER          */
         L     GPR15P,ATCLCPTR                                     1023
*             END;                  /* LISATCVT                      */
*             GPR02P=GPR15P->ATCBPDA;                              1025
         L     GPR02P,ATCBPDA(,GPR15P)                             1025
*             GPR15P=GPR15P->ATCSMRS;                              1026
         L     GPR15P,ATCSMRS(,GPR15P)                             1026
*             DCL                                                  1027
*               FMZL0060 BASED(GPR15P) LABEL VALUERANGE(*);        1027
*             CALL FMZL0060;                                       1028
         BALR  @14,@15                                             1028
*             RFY                                                  1029
*               GPR13P RSTD;                                       1029
*             GENERATE REFS(GPR01P,RPHWORK) SETS(GPR02P,GPR13P);   1030
          LM GPR02P,GPR13P,RPHWORK(GPR01P)
*             RFY                                                  1031
*              (GPR01P,                                            1031
*               GPR13P) UNRSTD;                                    1031
*             RFY                                                  1032
*              (GPR02P,                                            1032
*               GPR03P,                                            1032
*               GPR04P,                                            1032
*               GPR15P) UNRSTD;                                    1032
*           END;                    /* *********END OF RELSTORE    1033
*                                      EXPANSION********* RELEASE THE
*                                      TLB                   @XM19013*/
*           LCPBPTR=ZCRSVF8;        /* RESTORE LCPB PTR      @XM19013*/
         L     @11,RPHCRR(,RPHPTR)                                 1034
         L     @11,CRACRR(,@11)                                    1034
         L     LCPBPTR,ZCRSVF8(,@11)                               1034
*           LCPTLBPI='0'B;          /* INDICATE TLB GONE     @XM19013*/
         NI    LCPTLBPI(LCPBPTR),B'11101111'                       1035
*           LCPTLBAD=0;             /* CLEAR TLB POINTER     @XM19013*/
         SLR   @11,@11                                             1036
         ST    @11,LCPTLBAD(,LCPBPTR)                              1036
*         END;                      /* END TLB PRESENT       @XM19013*/
*       ELSE                                                       1038
*         ;                         /* TLB NOT PRESENT       @XM19013*/
@RF01003 DS    0H                                                  1039
*       IF LCPFTYPE=LCRPHFT THEN                                   1039
         TM    LCPFTYPE(LCPBPTR),B'10000000'                       1039
         BNO   @RF01039                                            1039
*         DO;                       /* IF POST ANSWER        @XM19013*/
*           LCPRPHA->RPHWEA=LCPFDBA;/* SET FSB IN RPH        @XM19013*/
         L     @11,LCPRPHA(,LCPBPTR)                               1041
         L     @09,LCPFDBA(,LCPBPTR)                               1041
         ST    @09,RPHWEA(,@11)                                    1041
*           LCPFDBA=0;              /* CLEAR BUFFER PTR      @XM19013*/
         SLR   @11,@11                                             1042
         ST    @11,LCPFDBA(,LCPBPTR)                               1042
*/*TPPOST  (LCPRPHA)                                                 */
*                                                                  1043
*           DO;                     /* DECLARE AND RESTRICT REGS     */
*             RESPECIFY                                            1044
*              (GPR00F,                                            1044
*               GPR01F,                                            1044
*               GPR04F,                                            1044
*               GPR05F,                                            1044
*               GPR06F,                                            1044
*               GPR14F,                                            1044
*               GPR15F) RSTD;       /* 0,1,4,5,6,14, AND 15          */
*/* ATBUILD (ISTPAB,ISTDYPAB,ISTRPH)                                 */
*/* END OF ATBUILD                                                   */
*                                                                  1045
*             GEN REFS(GPR01P,GPR02F,GPR06F) SETS(RPHWORK);        1045
        STM GPR02F,GPR06F,RPHWORK(GPR01P)
*             GPR04F=LCPRPHA;       /* LOAD RPH PNTR INTO REG 4      */
         L     GPR04F,LCPRPHA(,LCPBPTR)                            1046
*             RFY                                                  1047
*               GPR03F RSTD;                                       1047
*             GPR03F=0;                                            1048
         SLR   GPR03F,GPR03F                                       1048
*             DO;                   /* MODESET SAVEKEY(GPR06F)     1049
*                                      KEYADDR(GPR03F)             1049
*                                      WORKREG(GPR05F)               */
*               RESPECIFY                                          1050
*                (GPR02F) RESTRICTED;                              1050
*               GPR05F=GPR02F;      /* SAVE REGISTER 2               */
         LR    GPR05F,GPR02F                                       1051
*               IPK;                /* SAVE CURRENT PSW KEY          */
         IPK                                                       1052
*               GPR06F=GPR02F;                                     1053
         LR    GPR06F,GPR02F                                       1053
*               GPR02F=GPR05F;      /* RESTORE REGISTER 2            */
         LR    GPR02F,GPR05F                                       1054
*               SPKA(GPR03F);       /* SET PSW KEY                   */
         SPKA  0(GPR03F)                                           1055
*               RESPECIFY                                          1056
*                (GPR02F) UNRESTRICTED;                            1056
*             END;                  /* MODESET SAVEKEY(GPR06F)     1057
*                                      KEYADDR(GPR03F)             1057
*                                      WORKREG(GPR05F)               */
*             RFY                                                  1058
*               GPR03F UNRSTD;                                     1058
*             GPR05P=GPR04P->RPHMAJCB+GPR04P->RPHPABOF;/* LOAD REG 5
*                                      WITH ADDR OF MAJOR CONTROL  1059
*                                      BLOCK PLUS OFFSET OF PAB IN 1059
*                                      BLOCK                         */
         L     GPR05P,RPHMAJCB-1(,GPR04P)                          1059
         LA    GPR05P,0(,GPR05P)                                   1059
         SLR   @11,@11                                             1059
         IC    @11,RPHPABOF(,GPR04P)                               1059
         ALR   GPR05P,@11                                          1059
*             GPR14P=0;             /* LOAD 0 INTO REG 14            */
         SLR   GPR14P,GPR14P                                       1060
*             GPR15P='FFFFFFFF'X;   /* LOAD REG 15 WITH DUMMY ADDRESS*/
         SLR   GPR15P,GPR15P                                       1061
         BCTR  GPR15P,0                                            1061
*             CS(GPR14P,GPR15P,GPR04P->RPHRESMA);/* COMPARE RESUME 1062
*                                      ADDRESS WITH 0 AND,IF EQUAL,
*                                      PUT DUMMY ADDRESS IN CONTROL
*                                      BLOCK RESUME ADDRESS          */
         CS    GPR14P,@15,RPHRESMA(GPR04P)                         1062
*             BC(8,FMZT0076);       /* IF EQUAL, BYPASS REMAINDER OF
*                                      EXPANSION                     */
         BC    8,FMZT0076                                          1063
*FMZL0076:                                                         1064
*             IF GPR04P->RPHWT='1'B THEN/* WT/EXT CONTENTION FLAG ON */
FMZL0076 TM    RPHWT(GPR04P),B'00001000'                           1064
         BNO   @RF01064                                            1064
*               DO;                 /* IN RPH                        */
*                 GPR14P=GPR04P->RPHRESMA×RPHWT1;/* LOAD REG 14 WITH
*                                      FLAG FIELD AND MAKE CERTAIN 1066
*                                      WT/EXT CONTENTION FLAG STILL
*                                      ON                            */
         L     GPR14P,RPHRESMA(,GPR04P)                            1066
         O     GPR14P,@CF00517                                     1066
*                 GPR15P=GPR14P×RPHPT1;/* LOAD REG 15 WITH FLAG FIELD
*                                      AND TURN POST FLAG ON         */
         LR    GPR15P,GPR14P                                       1067
         O     GPR15P,@CF00507                                     1067
*                 CS(GPR14P,GPR15P,GPR04P->RPHRESMA);/* COMPARE REG
*                                      14 WITH FLAG FIELD--IF WT/EXT
*                                      BIT ON, TURN ON POST FLAG     */
         CS    GPR14P,@15,RPHRESMA(GPR04P)                         1068
*                 BC(4,FMZL0076);   /* IF WT/EXT BIT WAS OFF, LOOP TO
*                                      TEST CONTENTION FLAG          */
         BC    4,FMZL0076                                          1069
*                 BC(8,FMZT0076);   /* IF WT/EXT BIT WAS OFF, BRANCH
*                                      TO BYPASS CODE GEN            */
         BC    8,FMZT0076                                          1070
*               END;                /* IF POST FLAG IS ON, FALL THRU
*                                      BOTTOM OF LOOP                */
*             ELSE                                                 1072
*               ;                   /* WT/EXT CONTENTION FLAG OFF    */
@RF01064 DS    0H                                                  1073
*             IF GPR04P->RPHTSKID=GPR01P->RPHTSKID THEN            1073
         CLC   RPHTSKID(4,GPR04P),RPHTSKID(GPR01P)                 1073
         BNE   @RF01073                                            1073
*               DO;                                                1074
*                 GPR05P->PABCHNGP=GPR01P->RPHPABQP;/* PUT PAB QUEUE
*                                      ADDRESS IN SECOND WORD OF PAB */
         MVC   PABCHNGP(3,GPR05P),RPHPABQP(GPR01P)                 1075
*                 GPR01P->RPHPABQP=GPR05P;/* PUT PAB ADDRESS (IN   1076
*                                      MAJOR CONTROL BLOCK) IN PAB 1076
*                                      QUEUE ADRESS IN RPH           */
         STCM  GPR05P,7,RPHPABQP(GPR01P)                           1076
*               END;                                               1077
*             ELSE                                                 1078
*               DO;                                                1078
         B     @RC01073                                            1078
@RF01073 DS    0H                                                  1079
*                 GPR00F=0;         /* SET REG 0 TO INDICATE ENA     */
         SLR   GPR00F,GPR00F                                       1079
*                 DO;               /* LISATCVT                    1080
*                                      CVTBASE(PAGEABLE,(GPR15P))    */
*                   GPR15P=ATCLCPTR;/* SET UP ATCVT POINTER          */
         L     GPR15P,ATCLCPTR                                     1081
*                 END;              /* LISATCVT PUT POINTER TO ATCVT
*                                      IN IN REG 15                  */
*                 CALL GPR15P->ATCAP32;/* CALL ISTAPC32: TPSCHED     */
         L     @11,ATCAP32(,GPR15P)                                1083
         LR    @15,@11                                             1083
         BALR  @14,@15                                             1083
*               END;                                               1084
*FMZT0076:                                                         1085
*             DO;                   /* MODESET KEYADDR(GPR06F)     1085
*                                      WORKREG(GPR05F)               */
@RC01073 DS    0H                                                  1085
FMZT0076 DS    0H                                                  1086
*               GPR05F=GPR06F;      /* GET KEY FORM SAVE LOCATION    */
         LR    GPR05F,GPR06F                                       1086
*               SPKA(GPR05F);       /* SET PSW KEY                   */
         SPKA  0(GPR05F)                                           1087
*             END;                  /* MODESET KEYADDR(GPR06F)     1088
*                                      WORKREG(GPR05F)               */
*             GEN REFS(GPR04P,RPHWORK) SETS(GPR02F,GPR03F,GPR04F,GPR05F
*                 ,GPR06F);                                        1089
        LM GPR02F,GPR06F,RPHWORK(GPR01P)
*             RESPECIFY                                            1090
*              (GPR00F,                                            1090
*               GPR01F,                                            1090
*               GPR04F,                                            1090
*               GPR05F,                                            1090
*               GPR06F,                                            1090
*               GPR14F,                                            1090
*               GPR15F) UNRSTD;     /* UNRESTRICT REGS 0,1, 4,5,14,
*                                      AND 15                        */
*           END;                    /* ***END OF TPPOST GENERATION***
*                                      POST REQUESTOR        @XM19013*/
*           PABPTR=0;               /* INDICATE POST DONE    @XM19013*/
         L     @11,RPHCRR(,RPHPTR)                                 1092
         L     @11,CRACRR(,@11)                                    1092
         SLR   @09,@09                                             1092
         ST    @09,PABPTR(,@11)                                    1092
*         END;                      /* END POST ANSWER       @XM19013*/
*       ELSE                        /* IF QUEUE ANSWER       @XM19013*/
*         PABPTR=LCPPABA;           /* ADDRESS ANSWER PAB    @XM19013*/
         B     @RC01039                                            1094
@RF01039 L     @11,RPHCRR(,RPHPTR)                                 1094
         L     @11,CRACRR(,@11)                                    1094
         L     @09,LCPPABA(,LCPBPTR)                               1094
         ST    @09,PABPTR(,@11)                                    1094
*     END;                          /* END SESSION CTL       @XM19013*/
*   ELSE                            /* NOT SESSION CTL       @XM19013*/
*     PABPTR=ADDR(FMCPAB2);         /* ANSWER PAB=CLIP       @XM19013*/
         B     @RC00947                                            1096
@RF00947 L     @11,RPHCRR(,RPHPTR)                                 1096
         L     @11,CRACRR(,@11)                                    1096
         LA    @09,FMCPAB2(,FMCBPTR)                               1096
         ST    @09,PABPTR(,@11)                                    1096
*   IF PABPTR^=0 THEN               /* IF POST REQUIRED      @XM19013*/
@RC00947 L     @11,RPHCRR(,RPHPTR)                                 1097
         L     @11,CRACRR(,@11)                                    1097
         L     @11,PABPTR(,@11)                                    1097
         LTR   @11,@11                                             1097
         BZ    @RF01097                                            1097
*/*  TPQUE (LCPFDBA,PABPTR->PABWEQA) NORM                            */
*                                                                  1098
*     DO;                                                          1098
*       RFY                                                        1099
*        (GPR00P,                                                  1099
*         GPR01P,                                                  1099
*         GPR04P,                                                  1099
*         GPR05P,                                                  1099
*         GPR15P) RSTD;                                            1099
*       GEN REFS(GPR01P) SETS(RPHWORK)                             1100
*           (STM GPR02P,GPR08P,RPHWORK(GPR01P));                   1100
         STM GPR02P,GPR08P,RPHWORK(GPR01P)
*       GPR00P=0;                                                  1101
         SLR   GPR00P,GPR00P                                       1101
*       GPR15P=ADDR(PABPTR->PABWEQA);/* HOLD PAB PTR                 */
         L     @11,RPHCRR(,RPHPTR)                                 1102
         L     @11,CRACRR(,@11)                                    1102
         L     GPR15P,PABPTR(,@11)                                 1102
*       GPR04P=LCPFDBA;             /* WORK ELE PTR                  */
         L     GPR04P,LCPFDBA(,LCPBPTR)                            1103
*       GPR05P=GPR15P;              /* PASS PAB PTR                  */
         LR    GPR05P,GPR15P                                       1104
*       CALL ATCLCPTR->ATCAP37->ISTAPC37;                          1105
         L     @11,ATCLCPTR                                        1105
         L     @15,ATCAP37(,@11)                                   1105
         BALR  @14,@15                                             1105
*       GEN(NOPR  0)                                               1106
*       NOSETS NOREFS;                                             1106
         NOPR  0
*       RFY                                                        1107
*        (GPR00P,                                                  1107
*         GPR01P,                                                  1107
*         GPR04P,                                                  1107
*         GPR05P,                                                  1107
*         GPR15P) UNRSTD;                                          1107
*     END;                          /* *** END OF TPQUE GENERATION 1108
*                                      POST ANSWER PAB       @XM19013*/
*   ELSE                                                           1109
*     ;                             /* RPH POSTING USED      @XM19013*/
@RF01097 DS    0H                                                  1110
*   RFY                                                            1110
*     ISTFSB;                       /* DEBASE FSB            @XM19013*/
*   RFY                                                            1111
*     WQEPTR UNRSTD;                                               1111
*   RFY                                                            1112
*     R14 RSTD;                                                    1112
*   R14=ZCRSVF5;                    /* RESTORE RETURN ADDRESS        */
         L     @09,RPHCRR(,RPHPTR)                                 1113
         L     @09,CRACRR(,@09)                                    1113
         L     R14,ZCRSVF5(,@09)                                   1113
*   RFY                                                            1114
*     R14 UNRSTD;                                                  1114
*   END BFIF1CLR;                                                  1115
@EL00003 DS    0H                                                  1115
@EF00003 DS    0H                                                  1115
@ER00003 BR    @14                                                 1115
         EJECT
*                                                                  1116
*/***********************************************************@XM19747*/
*/*                                                          @XM19747*/
*/* SUBROUTINE-                                              @XM19747*/
*/*      NOTIFY                                              @XM19747*/
*/*                                                          @XM19747*/
*/* FUNCTION-                                                @XM19747*/
*/*      PROCESS NOTIFY FUNCTION OF LCCW.                    @XM19747*/
*/*                                                          @XM19747*/
*/***********************************************************@XM19747*/
*                                                                  1116
*   RFY                                                            1116
*     R14 RSTD;                     /* TO SAVE RETURN REG    @XM19747*/
*NOTIFY:                                                           1117
*   PROCEDURE OPTIONS(NOSAVE,NOSAVEAREA);/* NOTIFY: SUBROUTINE     1117
*                                                            @XM19747*/
NOTIFY   DS    0H                                                  1118
*   ZCRSVF4=R14;                    /* SAVE RETURN REG       @XM19747*/
         L     @15,RPHCRR(,RPHPTR)                                 1118
         L     @15,CRACRR(,@15)                                    1118
         ST    R14,ZCRSVF4(,@15)                                   1118
*   RFY                                                            1119
*     R14 UNRSTD;                   /* SAVED                 @XM19747*/
*   ZCRPCOD1=0;                     /* ZDFA0 PARAMETER       @XM19747*/
         MVI   ZCRPCOD1(@15),X'00'                                 1120
*   ZCRPFSB='1'B;                   /* ZDFA0 PARAMETER       @XM19747*/
         OI    ZCRPFSB(@15),B'00100000'                            1121
*   CALL ISTZDFA0;                  /* BUFFER ALLOCATION UTILITY   1122
*                                                            @XM19747*/
         L     @09,ATCZPSVT(,ATCVTPTR)                             1122
         L     @15,ZPSZDFA0(,@09)                                  1122
         BALR  @14,@15                                             1122
*   RPHSRPRM->FSBSAF=FMCSAF;        /* SET SOURCE ADDRESS IN FSB   1123
*                                                            @XM19747*/
         L     @09,RPHSRPRM(,RPHPTR)                               1123
         MVC   FSBSAF(2,@09),FMCSAF(FMCBPTR)                       1123
*   RPHSRPRM->FSBDAF=ADDR(FMCDNCBA->LUNCB)->NCBDAF;/* SET DESCINATION
*                                      ADDR IN FSB           @XM19747*/
         L     @15,FMCDNCBA(,FMCBPTR)                              1124
         MVC   FSBDAF(2,@09),NCBDAF(@15)                           1124
*   RPHSRPRM->FSBMJRCD=FRNOTIFY;    /* MAJOR=NOTIFY          @XM19747*/
         MVI   FSBMJRCD(@09),X'30'                                 1125
*   RPHSRPRM->FSBMNRCD=LCPRUCNT;    /* MINOR=LCPB CODE       @XM19747*/
         IC    @15,LCPRUCNT(,LCPBPTR)                              1126
         STC   @15,FSBMNRCD(,@09)                                  1126
*/*  TPQUE (RPHSRPRM,FMCSIPA->PABWEQA) NORM                          */
*                                                                  1127
*   DO;                                                            1127
*     RFY                                                          1128
*      (GPR00P,                                                    1128
*       GPR01P,                                                    1128
*       GPR04P,                                                    1128
*       GPR05P,                                                    1128
*       GPR15P) RSTD;                                              1128
*     GEN REFS(GPR01P) SETS(RPHWORK)(STM GPR02P,GPR08P,RPHWORK(GPR01P))
*         ;                                                        1129
         STM GPR02P,GPR08P,RPHWORK(GPR01P)
*     GPR00P=0;                                                    1130
         SLR   GPR00P,GPR00P                                       1130
*     GPR15P=ADDR(FMCSIPA->PABWEQA);/* HOLD PAB PTR                  */
         L     GPR15P,FMCSIPA(,FMCBPTR)                            1131
*     GPR04P=RPHSRPRM;              /* WORK ELE PTR                  */
         L     GPR04P,RPHSRPRM(,RPHPTR)                            1132
*     GPR05P=GPR15P;                /* PASS PAB PTR                  */
         LR    GPR05P,GPR15P                                       1133
*     CALL ATCLCPTR->ATCAP37->ISTAPC37;                            1134
         L     @09,ATCLCPTR                                        1134
         L     @15,ATCAP37(,@09)                                   1134
         BALR  @14,@15                                             1134
*     GEN(NOPR  0)                                                 1135
*     NOSETS NOREFS;                                               1135
         NOPR  0
*     RFY                                                          1136
*      (GPR00P,                                                    1136
*       GPR01P,                                                    1136
*       GPR04P,                                                    1136
*       GPR05P,                                                    1136
*       GPR15P) UNRSTD;                                            1136
*   END;                            /* *** END OF TPQUE GENERATION 1137
*                                      QUEUE FSB TO SSCP PAB @XM19747*/
*   RFY                                                            1138
*     R14 RSTD;                     /* TO RESTORE RETURN REG @XM19747*/
*   R14=ZCRSVF4;                    /* RESTORE RETURN REG    @XM19747*/
         L     @09,RPHCRR(,RPHPTR)                                 1139
         L     @09,CRACRR(,@09)                                    1139
         L     R14,ZCRSVF4(,@09)                                   1139
*   RFY                                                            1140
*     R14 UNRSTD;                   /* RESTORED              @XM19747*/
*   END NOTIFY;                     /* END NOTIFY            @XM19747*/
@EL00004 DS    0H                                                  1141
@EF00004 DS    0H                                                  1141
@ER00004 BR    @14                                                 1141
         EJECT
*                                                                  1142
*/********************************************************************/
*/*                                                                  */
*/* SUBROUTINE-                                                      */
*/*      BFIF0SHP                                                    */
*/*                                                                  */
*/* FUNCTION-                                                        */
*/*      SHIP OUT A CLEAR OR UNBIND REQUEST.                         */
*/*      (OR INSURE THAT A RESPONSE IS GENERATED IF UNSHIPPABLE.)    */
*/*                                                                  */
*/********************************************************************/
*                                                                  1142
*BFIF0SHP:                                                         1142
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               1142
BFIF0SHP DS    0H                                                  1143
*   RFY                                                            1143
*     R14 RSTD;                                                    1143
*   ZCRSVF4=R14;                    /* SAVE RETURN ADDRESS           */
         L     @15,RPHCRR(,RPHPTR)                                 1144
         L     @15,CRACRR(,@15)                                    1144
         ST    R14,ZCRSVF4(,@15)                                   1144
*   RFY                                                            1145
*     R14 UNRSTD;                                                  1145
*   RFY                                                            1146
*     ISTZOBUF BASED(FDBPTR);                                      1146
*   RFY                                                            1147
*     ISTZIBUF BASED(FDBPTR);       /* INPUT BUFFER          @ZA04074*/
*   RFY                                                            1148
*     ISTFSB BASED(ADDR(ZIBFSB));                                  1148
*   RFY                                                            1149
*     ISTLCPB BASED(LCPBPTR);                                      1149
*   RFY                                                            1150
*     ISTLSCB BASED(LSCBPTR);                                      1150
*   IF LSCTYPE^=LSTYPE THEN                                        1151
         CLI   LSCTYPE(LSCBPTR),X'DF'                              1151
         BE    @RF01151                                            1151
*     DO;                           /* IF INPUT A LCPB               */
*/* TPDEQ (LCPBPTR,FMCPAB5) RESET(YES)                               */
*                                                                  1153
*       DO;                         /* BEGIN TPDEQ CODE GENERATION   */
*         RFY                                                      1154
*          (GPR00P,                                                1154
*           GPR01P,                                                1154
*           GPR14P,                                                1154
*           GPR15P) RSTD;                                          1154
*         GPR15P=ADDR(FMCPAB5);     /* ADDRESS QUEUE POINTER         */
         LA    GPR15P,FMCPAB5(,FMCBPTR)                            1155
*         RFY                                                      1156
*          (GPR02P,                                                1156
*           GPR03P) RSTD;                                          1156
*         STM(GPR02P,GPR03P,GPR01P->RPHWORK(5:12));                1157
         STM   GPR02P,GPR03P,RPHWORK+4(GPR01P)                     1157
*         GPR03P=LCPBPTR×FMZCA026;                                 1158
         L     @09,@CF00493                                        1158
         LR    GPR03P,LCPBPTR                                      1158
         OR    GPR03P,@09                                          1158
*         GPR14P=FMZCA026;                                         1159
         LR    GPR14P,@09                                          1159
*         GPR15P=ADDR(GPR15P->PABWEQA);                            1160
*FMZL1100:                                                         1161
*         ;                                                        1161
FMZL1100 DS    0H                                                  1162
*         GPR02P=GPR15P->PABWEQA×FMZCA026;                         1162
         L     GPR02P,PABWEQA(,GPR15P)                             1162
         O     GPR02P,@CF00493                                     1162
*         DO WHILE(GPR02P^=GPR14P);                                1163
         B     @DE01163                                            1163
@DL01163 DS    0H                                                  1164
*FMZL2100:                                                         1164
*           ;                                                      1164
FMZL2100 DS    0H                                                  1165
*           IF GPR02P=GPR03P THEN                                  1165
         CR    GPR02P,GPR03P                                       1165
         BNE   @RF01165                                            1165
*             DO;                                                  1166
*               GPR00P=GPR02P->WKECHAIN;                           1167
         L     GPR00P,WKECHAIN(,GPR02P)                            1167
*               CS(GPR02P,GPR00P,GPR15P->PABWEQA);                 1168
         CS    GPR02P,@00,PABWEQA(GPR15P)                          1168
*               BC(7,FMZL3100);                                    1169
         BC    7,FMZL3100                                          1169
*               GPR14P=GPR02P;                                     1170
         LR    GPR14P,GPR02P                                       1170
*               GPR14P->WKECHAIN=0;                                1171
         SLR   @09,@09                                             1171
         ST    @09,WKECHAIN(,GPR14P)                               1171
*             END;                                                 1172
*           ELSE                                                   1173
*             DO;                                                  1173
         B     @RC01165                                            1173
@RF01165 DS    0H                                                  1174
*               IF(GPR02P->WKECHAIN)=GPR14P THEN                   1174
         C     GPR14P,WKECHAIN(,GPR02P)                            1174
         BNE   @RF01174                                            1174
*                 DO;                                              1175
*                   IF GPR02P->FSBTYPE=FSTYPE THEN                 1176
         CLI   FSBTYPE(GPR02P),X'02'                               1176
         BNE   @RF01176                                            1176
*                     DO;                                          1177
*                       GPR02P=GPR14P;                             1178
         LR    GPR02P,GPR14P                                       1178
*                       GOTO FMZL3100;                             1179
         B     FMZL3100                                            1179
*                     END;                                         1180
*                   GPR15P=ADDR(GPR02P->LCPRSTQH);                 1181
@RF01176 LA    GPR15P,LCPRSTQH(,GPR02P)                            1181
*                   GOTO FMZL1100;                                 1182
         B     FMZL1100                                            1182
*                 END;                                             1183
*               ELSE                                               1184
*                 DO;                                              1184
@RF01174 DS    0H                                                  1185
*                   GPR15P=ADDR(GPR02P->WKECHAIN);                 1185
         LA    GPR15P,WKECHAIN(,GPR02P)                            1185
*                   GPR02P=GPR02P->WKECHAIN;                       1186
         L     GPR02P,WKECHAIN(,GPR02P)                            1186
*                   GOTO FMZL2100;                                 1187
         B     FMZL2100                                            1187
*                 END;                                             1188
*             END;                                                 1189
*FMZL3100:                                                         1190
*           ;                                                      1190
@RC01165 DS    0H                                                  1190
FMZL3100 DS    0H                                                  1191
*         END;                                                     1191
@DE01163 CR    GPR02P,GPR14P                                       1191
         BNE   @DL01163                                            1191
*ISTA0100:                                                         1192
*         ;                                                        1192
ISTA0100 DS    0H                                                  1193
*         LM(GPR02P,GPR03P,GPR01P->RPHWORK(5:12));                 1193
         LM    GPR02P,GPR03P,RPHWORK+4(GPR01P)                     1193
*         RFY                                                      1194
*          (GPR02P,                                                1194
*           GPR03P) UNRSTD;                                        1194
*         GPR14P=GPR14P&FMZCB026;                                  1195
         N     GPR14P,@CF00491                                     1195
*         GPR01P->RPHWEA=GPR14P;                                   1196
         ST    GPR14P,RPHWEA(,GPR01P)                              1196
*         RFY                                                      1197
*          (GPR00P,                                                1197
*           GPR01P,                                                1197
*           GPR14P,                                                1197
*           GPR15P) UNRSTD;                                        1197
*       END;                        /* END TPDEQ GENERATION DEQUEUE
*                                      LCPB FROM ATOP WITH RESET   1198
*                                      OPTION IN CASE OF A CLEAR OF A
*                                      CLEAR SIUATION        @ZA13688*/
*       ZCRENDSH='1'B;              /* SET ISTZAF1B EXIT SWITCH      */
         L     @09,RPHCRR(,RPHPTR)                                 1199
         L     @09,CRACRR(,@09)                                    1199
         OI    ZCRENDSH(@09),B'10000000'                           1199
*     END;                          /* END LCPB PROCESSING           */
*   ELSE                                                           1201
*     ;                             /* INPUT IS A LSCB               */
@RF01151 DS    0H                                                  1202
*   LSCFDBA=0;                      /* NO BUFFER THIS ELEMENT        */
         SLR   @09,@09                                             1202
         ST    @09,LSCFDBA(,LSCBPTR)                               1202
*/*  TPQUE (LSCBPTR,FMCLCPAQ)                                        */
*                                                                  1203
*   DO;                                                            1203
*     RFY                                                          1204
*      (GPR00P,                                                    1204
*       GPR01P,                                                    1204
*       GPR02P,                                                    1204
*       GPR14P,                                                    1204
*       GPR15P) RSTD;                                              1204
*     GEN REFS(GPR01P) SETS(RPHWORK)(STM GPR02P,GPR08P,RPHWORK(GPR01P))
*         ;                                                        1205
         STM GPR02P,GPR08P,RPHWORK(GPR01P)
*     GPR15P=LSCBPTR;               /* GET WORK ELEM POINTER         */
         LR    GPR15P,LSCBPTR                                      1206
*     GPR14P=ADDR(FMCLCPAQ);        /* ADDRESS PAB/QUEUE POINTER     */
         LA    GPR14P,FMCLCPAQ(,FMCBPTR)                           1207
*     GPR15P=GPR15P×PABWEQG1;                                      1208
         O     GPR15P,@CF00493                                     1208
*     GPR02P=GPR14P->PABWEQA;       /* INITIALIZE WITH QUEUE HEADER  */
         L     GPR02P,PABWEQA(,GPR14P)                             1209
*CMZA0107:                                                         1210
*     ;                             /* CS FAIL TARGET                */
CMZA0107 DS    0H                                                  1211
*     GPR00P=GPR02P;                /* SAVE QUEUE CONTENTS           */
         LR    GPR00P,GPR02P                                       1211
*     GPR15P->PABCHAIN=GPR02P×PABWEQG1;/* FORWARD CHAIN WORK ELEMENT */
         LR    @09,GPR02P                                          1212
         O     @09,@CF00493                                        1212
         ST    @09,PABCHAIN(,GPR15P)                               1212
*     CS(GPR02P,GPR15P,GPR14P->PABWEQA);/* CHECK FOR END OF QUEUE    */
         CS    GPR02P,@15,PABWEQA(GPR14P)                          1213
*     BC(7,CMZA0107);                                              1214
         BC    7,CMZA0107                                          1214
*     GEN REFS(RPHWORK,GPR01P) NOSETS                              1215
*         (LM    GPR02P,GPR08P,RPHWORK(GPR01P));                   1215
         LM    GPR02P,GPR08P,RPHWORK(GPR01P)
*     RFY                                                          1216
*      (GPR00P,                                                    1216
*       GPR01P,                                                    1216
*       GPR02P,                                                    1216
*       GPR14P,                                                    1216
*       GPR15P) UNRSTD;                                            1216
*   END;                            /* *** END OF TPQUE GENERATION 1217
*                                      QUEUE LCPB TO AWAIT QUEUE     */
*/*   IF INTERNAL CLEAR ONLY OVERLAY THE OUTPUT BUFFER TO MAKE IT  1218
*     LOOK LIKE AN INPUT BUFFER TO ACTIVATE THE INBOUD PROCESSING  1218
*     FOR THE CLEAR REQUEST                                          */
*                                                                  1218
*   RFY                                                            1218
*     NCBPTR RSTD;                                                 1218
*   NCBPTR=ICNCBPTR;                /* START WITH THE ICNCB          */
         LR    NCBPTR,ICNCBPTR                                     1219
*   RFY                                                            1220
*    (ISTICNCB,                                                    1220
*     ISTNCB) BASED(NCBPTR);        /*                               */
*   DO WHILE(NCBNSNA^=0);           /* LOCATE LOCAL CONTROLLER       */
         B     @DE01221                                            1221
@DL01221 DS    0H                                                  1222
*     NCBPTR=NCBNSNA;               /* GET ADDRESS NEXT NODE         */
         L     NCBPTR,NCBNSNA(,NCBPTR)                             1222
*   END;                            /*                               */
@DE01221 L     @11,NCBNSNA(,NCBPTR)                                1223
         LTR   @11,@11                                             1223
         BNZ   @DL01221                                            1223
*   IF LCPINTER='1'B                /* IF INTERNAL OPERATION         */
*       ×NCBCONF='1'B               /* × DEVICE DOWN                 */
*       ×(FMCSNBI='1'B&FMCBIP='0'B) /* × (SESSION NOT BOUND & BIND 1224
*                                      NOT IN PROGRESS)            1224
*                                      @ZM11715,@XA09510             */
*       ×(FMCCONF='1'B&LCPRSTRT='0'B) THEN/* × (OFFLINE DEVICE & NOT
*                                      RESTART               @XM09478*/
         TM    LCPINTER(LCPBPTR),B'01000000'                       1224
         BO    @RT01224                                            1224
         TM    NCBCONF(NCBPTR),B'01000000'                         1224
         BO    @RT01224                                            1224
         TM    FMCSNBI(FMCBPTR),B'10000000'                        1224
         BNO   @GL00006                                            1224
         TM    FMCBIP(FMCBPTR),B'00001000'                         1224
         BZ    @RT01224                                            1224
@GL00006 TM    FMCCONF(FMCBPTR),B'00000001'                        1224
         BNO   @RF01224                                            1224
         TM    LCPRSTRT(LCPBPTR),B'00100000'                       1224
         BNZ   @RF01224                                            1224
@RT01224 DS    0H                                                  1225
*     DO;                                                          1225
*       RFY                                                        1226
*         NCBPTR UNRSTD;            /*                               */
*       ZIBBTU=ZOBBTU;              /* MOVE LH,TH,RH,RU TO ZIB     1227
*                                                            @ZA04074*/
         MVC   ZIBBTU(20,FDBPTR),ZOBBTU(FDBPTR)                    1227
*       RFY                                                        1228
*         ISTTH BASED(ADDR(ZIBBTU));/* ADDRESS TH            @ZA04074*/
*       RFY                                                        1229
*         ISTRH BASED(ADDR(ISTTH)+LENGTH(ISTTH));/* ADDRESS RH     1229
*                                                            @ZA04074*/
*       ISTTH=ISTTH&&ISTTH;         /* CLEAR THE TH AREA     @ZA04074*/
         LA    @09,48                                              1230
         ALR   @09,FDBPTR                                          1230
         XC    ISTTH(10,@09),ISTTH(@09)                            1230
*       THFID=THFID1;               /* FLAG AS FID 1         @ZA04074*/
         NI    THFID(@09),B'00011111'                              1231
         OI    THFID(@09),B'00010000'                              1231
*       THFLAG1=TH2FLAG1;           /* COPY FLAG FIELD       @ZA04074*/
         LA    @15,32                                              1232
         ALR   @15,FDBPTR                                          1232
         MVC   THFLAG1(2,@09),TH2FLAG1(@15)                        1232
*       THDAF=FMCSAF;               /* SET TRANSMISSION DAF  @ZA04074*/
         MVC   THDAF(2,@09),FMCSAF(FMCBPTR)                        1233
*       THOAF=LUNCBPTR->NCBDAF;     /* SET TRANSMISSION OAF  @ZA04074*/
         MVC   THOAF(2,@09),NCBDAF(LUNCBPTR)                       1234
*       THSNF=TH2SNF;               /* COPY SEQUENCE NUMBER  @ZA04074*/
         LH    @15,TH2SNF(,@15)                                    1235
         N     @15,@CF03829                                        1235
         STH   @15,THSNF(,@09)                                     1235
*       THDCF=LHLEN-(LENGTH(ISTLH)+LENGTH(ISTTH2));/* COMPUTE DATA 1236
*                                      COUNT FIELD           @ZA04074*/
         LH    @15,LHLEN+28(,FDBPTR)                               1236
         N     @15,@CF03829                                        1236
         SL    @15,@CF02545                                        1236
         STH   @15,THDCF(,@09)                                     1236
*       RHQS='1'B;                  /* FLAG AS RESPONSE      @ZA04074*/
         OI    RHQS+58(FDBPTR),B'10000000'                         1237
*       FDBDATAA=ADDR(ISTTH)+LENGTH(ISTTH)+LENGTH(ISTRH);/* POINT TO
*                                      THE RU                @ZA04074*/
         LA    @14,61                                              1238
         ALR   @14,FDBPTR                                          1238
         ST    @14,FDBDATAA(,FDBPTR)                               1238
*/***********************************************************@ZA04074*/
*/*                                                          @ZA04074*/
*/*      INITIALIZE THE FSB                                  @ZA04074*/
*/*                                                          @ZA04074*/
*/***********************************************************@ZA04074*/
*                                                                  1239
*       FSBFSB=FSBFSB&&FSBFSB;      /* CLEAR THE FSB         @ZA04074*/
         LA    @14,16                                              1239
         ALR   @14,FDBPTR                                          1239
         XC    FSBFSB(32,@14),FSBFSB(@14)                          1239
*       FSBTYPE=FSTYPE;             /* SET FSB TYPE FIELD    @ZA04074*/
         MVI   FSBTYPE(@14),X'02'                                  1240
*       FSBLNGTH=LENGTH(ISTFSB);    /* SET FSB LENGTH FIELD  @ZA04074*/
         MVI   FSBLNGTH(@14),X'2C'                                 1241
*       FSBTHCNT=THDCF;             /* SET DATA COUNT FIELD  @ZA04074*/
         STH   @15,FSBTHCNT(,@14)                                  1242
*       FSBRQTAG=THSNF;             /* SET SEQUENCE ID FIELD @ZA04074*/
         MVC   FSBRQTAG(2,@14),THSNF(@09)                          1243
*       FSBSAF=THDAF;               /* SET HOST SOURCE       @ZA04074*/
         MVC   FSBSAF(2,@14),THDAF(@09)                            1244
*       FSBDAF=THOAF;               /* SET HOST DESTINATION  @ZA04074*/
         MVC   FSBDAF(2,@14),THOAF(@09)                            1245
*       FSBMJRCD=FRMOK;             /* SET MAJOR = NORMAL    @ZA04074*/
         MVI   FSBMJRCD(@14),X'00'                                 1246
*       FSBMNRCD=FRMOK;             /* SET MINOR = NORMAL    @ZA04074*/
         MVI   FSBMNRCD(@14),X'00'                                 1247
*/*  TPQUE (ADDR(ZIBFSB),FMCPAB4) NORM                               */
*                                                                  1248
*       DO;                                                        1248
*         RFY                                                      1249
*          (GPR00P,                                                1249
*           GPR01P,                                                1249
*           GPR04P,                                                1249
*           GPR05P,                                                1249
*           GPR15P) RSTD;                                          1249
*         GEN REFS(GPR01P) SETS(RPHWORK)                           1250
*             (STM GPR02P,GPR08P,RPHWORK(GPR01P));                 1250
         STM GPR02P,GPR08P,RPHWORK(GPR01P)
*         GPR00P=0;                                                1251
         SLR   GPR00P,GPR00P                                       1251
*         GPR15P=ADDR(FMCPAB4);     /* HOLD PAB PTR                  */
         LA    GPR15P,FMCPAB4(,FMCBPTR)                            1252
*         GPR04P=ADDR(ZIBFSB);      /* WORK ELE PTR                  */
         LA    GPR04P,ZIBFSB(,FDBPTR)                              1253
*         GPR05P=GPR15P;            /* PASS PAB PTR                  */
         LR    GPR05P,GPR15P                                       1254
*         CALL ATCLCPTR->ATCAP37->ISTAPC37;                        1255
         L     @09,ATCLCPTR                                        1255
         L     @15,ATCAP37(,@09)                                   1255
         BALR  @14,@15                                             1255
*         GEN(NOPR  0)                                             1256
*         NOSETS NOREFS;                                           1256
         NOPR  0
*         RFY                                                      1257
*          (GPR00P,                                                1257
*           GPR01P,                                                1257
*           GPR04P,                                                1257
*           GPR05P,                                                1257
*           GPR15P) UNRSTD;                                        1257
*       END;                        /* *** END OF TPQUE GENERATION 1258
*                                      QUEUE FSB TO CLIP     @ZA04074*/
*       RFY                                                        1259
*         ISTTH;                    /* DEBASE ISTTH          @ZA04074*/
*       RFY                                                        1260
*         ISTRH;                    /* DEBASE ISTRH          @ZA04074*/
*     END;                          /* END INTERNAL OPERATION      1261
*                                                            @ZA04074*/
*   ELSE                                                           1262
*     DO;                           /* IF SHIPOUT REQ'D      @XM10417*/
         B     @RC01224                                            1262
@RF01224 DS    0H                                                  1263
*       IF ADDR(LUNCB)->NCBFTRIO='1'B THEN/* IF I/O TRACE    @XM10417*/
         CLI   NCBFTRIO(LUNCBPTR),1                                1263
         BNE   @RF01263                                            1263
*         ZOBRT08='1'B;             /* SET I/O TRACE FLAG    @XM10417*/
         OI    ZOBRT08(FDBPTR),B'01000000'                         1264
*       ELSE                                                       1265
*         ;                         /* NOT I/O TRACE         @XM10417*/
@RF01263 DS    0H                                                  1266
*       IF ADDR(FMCPROCD)->PROCFTX='1'B THEN/* IF CONFIDENTIAL     1266
*                                                            @XM10417*/
         TM    PROCFTX+48(FMCBPTR),B'00000001'                     1266
         BNO   @RF01266                                            1266
*         ZOBRT06='1'B;             /* FLAG CONF TEXT        @XM10417*/
         OI    ZOBRT06(FDBPTR),B'10000000'                         1267
*       ELSE                                                       1268
*         ;                         /* NOT CONFIDENTIAL      @XM10417*/
@RF01266 DS    0H                                                  1269
*       CALL ISTZEFBB;              /* WRITE OUT BUFFER      @XM10417*/
         L     @09,ATCZFSVT(,ATCVTPTR)                             1269
         L     @15,ZFSZEFBB(,@09)                                  1269
         BALR  @14,@15                                             1269
*     END;                          /* END SHIPOUT REQ'D     @XM10417*/
*   RFY                                                            1271
*     R14 RSTD;                                                    1271
@RC01224 DS    0H                                                  1272
*   RFY                                                            1272
*     R14 RSTD;                                                    1272
*   R14=ZCRSVF4;                    /* RESTORE RETURN REGISTER       */
         L     @09,RPHCRR(,RPHPTR)                                 1273
         L     @09,CRACRR(,@09)                                    1273
         L     R14,ZCRSVF4(,@09)                                   1273
*   RFY                                                            1274
*     R14 UNRSTD;                                                  1274
*   RFY                                                            1275
*     INBDPTR UNRSTD;                                              1275
*   RFY                                                            1276
*     ISTZIBUF BASED;                                              1276
*   END BFIF0SHP;                                                  1277
*                                                                  1277
@EL00005 DS    0H                                                  1277
@EF00005 DS    0H                                                  1277
@ER00005 BR    @14                                                 1277
*/* TPEPILOG                                                         */
*                                                                  1278
*   GEN(PRINT OFF);                                                1278
         PRINT OFF
*   DCL                                                            1279
*     ISTAPC34 ENTRY BASED(ATCAP34) VALRG(*);/* RESET ROUTINE        */
*   DCL                                                            1280
*     ISTAPC37 ENTRY BASED(ATCAP37) VALRG(*);/* TPQUE ROUTINE        */
*   GEN(PRINT ON);                                                 1281
*                                                                  1281
         PRINT ON
*/* END OF TPEPILOG                                                  */
*                                                                  1282
*   END ISTZBFIF                                                   1282
*                                                                  1282
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */
*/*%INCLUDE SYSLIB  (IECDIOSB)                                       */
*/*%INCLUDE SYSLIB  (IHASRB  )                                       */
*                                                                  1282
*       ;                                                          1282
@EL00001 DS    0H                                                  1282
@EF00001 DS    0H                                                  1282
@ER00001 BR    @14                                                 1282
@DATA    DS    0H
@DATD    DSECT
         DS    0F
ISTZBFIF CSECT
         DS    0F
@CF00071 DC    F'8'
@CF02545 DC    F'10'
@CH02545 EQU   @CF02545+2
@CF00491 DC    XL4'7FFFFFFF'
@CF00493 DC    XL4'80000000'
@CF00507 DC    XL4'04000000'
@CF00517 DC    XL4'08000000'
@CF03829 DC    XL4'0000FFFF'
@DATD    DSECT
         DS    0D
IOSBPTR  DS    A
SRBPTR   DS    A
BFHDRPTR DS    A
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA
@ENDDATD EQU   *
ISTZBFIF CSECT
         DS    0F
@SIZDATD DC    AL1(0)
         DC    AL3(@ENDDATD-@DATD)
         DS    0D
DISFDBS  DC    AL4(ZIBFDBS-ISTZIBUF)
DISFSB   DC    AL4(ZIBFSB-ISTZIBUF)
FMZA0060 DS    FL4
         ORG   FMZA0060
@NM00073 DC    AL1(64)
@NM00074 DC    AL3(0)
         ORG   FMZA0060+4
@CC03718 DC    C'BCIF'
@00      EQU   00                      EQUATES FOR REGISTERS 0-15
@01      EQU   01
@02      EQU   02
@03      EQU   03
@04      EQU   04
@05      EQU   05
@06      EQU   06
@07      EQU   07
@08      EQU   08
@09      EQU   09
@10      EQU   10
@11      EQU   11
@12      EQU   12
@13      EQU   13
@14      EQU   14
@15      EQU   15
RPHPTR   EQU   @01
FMCBPTR  EQU   @05
LCPBPTR  EQU   @07
R0       EQU   @00
R1       EQU   @01
ATCVTPTR EQU   @02
ICNCBPTR EQU   @03
LUNCBPTR EQU   @04
FDBPTR   EQU   @06
LSCBPTR  EQU   @08
INBDPTR  EQU   @09
HOLDPTR  EQU   @09
WQEPTR   EQU   @10
NCBPTR   EQU   @10
RHPTR    EQU   @10
R12      EQU   @12
R13      EQU   @13
R14      EQU   @14
R15      EQU   @15
GPR00F   EQU   @00
GPR00P   EQU   @00
GPR01F   EQU   @01
GPR01P   EQU   @01
GPR02F   EQU   @02
GPR02P   EQU   @02
GPR03F   EQU   @03
GPR03P   EQU   @03
GPR04F   EQU   @04
GPR04P   EQU   @04
GPR05F   EQU   @05
GPR05P   EQU   @05
GPR06F   EQU   @06
GPR07P   EQU   @07
GPR12P   EQU   @12
GPR13P   EQU   @13
GPR14F   EQU   @14
GPR14P   EQU   @14
GPR15F   EQU   @15
GPR15P   EQU   @15
GPR06P   EQU   @06
GPR07F   EQU   @07
GPR08F   EQU   @08
GPR08P   EQU   @08
GPR09F   EQU   @09
GPR09P   EQU   @09
GPR10F   EQU   @10
GPR10P   EQU   @10
GPR11F   EQU   @11
GPR11P   EQU   @11
GPR12F   EQU   @12
GPR13F   EQU   @13
ATCLCPTR EQU   1032
IOSB     EQU   0
IOSFLA   EQU   IOSB
IOSACHN  EQU   IOSFLA
IOSFLB   EQU   IOSB+1
IOSFLC   EQU   IOSB+2
IOSDVALT EQU   IOSFLC
IOSPKEY  EQU   IOSB+12
IOSOPT   EQU   IOSB+14
IOSOPT2  EQU   IOSB+15
@NM00002 EQU   IOSB+20
IOSCSW   EQU   @NM00002+1
IOSTATUS EQU   IOSCSW+3
IOSIPIB  EQU   IOSB+44
IOSPATH  EQU   IOSB+86
IOSCHN   EQU   IOSPATH
IOSCKEY  EQU   IOSB+89
IOSEEKA  EQU   IOSB+100
IOSCCHH  EQU   IOSEEKA+3
IOSSKHH  EQU   IOSCCHH+2
SRBSECT  EQU   0
SRBFLC   EQU   SRBSECT+12
ISTDEVCH EQU   0
DEVSHCH  EQU   ISTDEVCH
DEVCHAR  EQU   DEVSHCH
DEVTCODE EQU   ISTDEVCH+1
DEVFLAGS EQU   ISTDEVCH+3
DEVFCCTL EQU   DEVFLAGS
DEVCHAR3 EQU   DEVFLAGS
ISTNCB   EQU   0
NCBDAF   EQU   ISTNCB+2
NCBNSNA  EQU   ISTNCB+12
NCBNCBA  EQU   ISTNCB+20
NCBFLAGS EQU   ISTNCB+24
NCBFRAS  EQU   NCBFLAGS+1
NCBFTRIO EQU   NCBFRAS
NCBFLAG1 EQU   NCBFLAGS+2
NCBCONF  EQU   NCBFLAG1
NCBSWDAF EQU   ISTNCB+44
ISTZPSVT EQU   0
ZPSZDFA0 EQU   ISTZPSVT
ZPSZDFC0 EQU   ISTZPSVT+4
ZPSZDFB0 EQU   ISTZPSVT+16
ZPSZBFZ0 EQU   ISTZPSVT+28
ISTPAB   EQU   0
PABWQCHN EQU   ISTPAB
PABWEQA  EQU   PABWQCHN
PABCHAIN EQU   PABWQCHN+4
PABCHNGP EQU   PABCHAIN+1
PABDVTA  EQU   ISTPAB+9
PABRPHFG EQU   ISTPAB+12
PABFLAGS EQU   PABRPHFG
PABERLCK EQU   PABFLAGS
PABERRLK EQU   PABERLCK
ISTLOK   EQU   0
LOKCHN   EQU   ISTLOK+1
LOKCHNG  EQU   LOKCHN
@NM00013 EQU   LOKCHNG+2
ISTDYPAB EQU   0
ISTRPH   EQU   0
RPHCNTL  EQU   ISTRPH
RPHFLAGS EQU   RPHCNTL+2
RPHAPTYP EQU   RPHFLAGS
RPHFSTLC EQU   RPHFLAGS
RPHFLGB  EQU   RPHCNTL+3
RPHRPHA  EQU   ISTRPH+4
RPHTSKID EQU   ISTRPH+8
RPHRESMA EQU   ISTRPH+16
RPHWPFLG EQU   RPHRESMA
RPHWT    EQU   RPHWPFLG
RPHPABOF EQU   ISTRPH+20
RPHMAJCB EQU   ISTRPH+21
RPHWEA   EQU   ISTRPH+24
RPHCSPA  EQU   RPHWEA
RPHSRPRM EQU   ISTRPH+28
RPHCRR   EQU   ISTRPH+32
RPHPABQA EQU   ISTRPH+36
RPHPABQP EQU   RPHPABQA+1
RPHWORK  EQU   ISTRPH+40
RPHSAVE1 EQU   RPHWORK
RPHSBITS EQU   RPHSAVE1+1
ISTATCVT EQU   0
ATCCOM   EQU   ISTATCVT
ATCSTAT  EQU   ATCCOM
ATCSTAT1 EQU   ATCSTAT
ATCSTFLG EQU   ATCSTAT+1
ATCPOFLG EQU   ATCSTAT+2
ATCSTAT4 EQU   ATCSTAT+3
ATCBPDA  EQU   ATCCOM+128
ATCIOTRC EQU   ATCCOM+140
ATCTHTRC EQU   ATCIOTRC
ATCSMRS  EQU   ATCCOM+188
ATCVTMID EQU   ATCCOM+240
ATCCSMR  EQU   ISTATCVT+296
ATCSHRFG EQU   ISTATCVT+316
ATCHPGM  EQU   ISTATCVT+384
ATCVLCNT EQU   ISTATCVT+772
ATCRNO   EQU   ISTATCVT+788
ATCSOPD  EQU   ISTATCVT+792
ATCSIPD  EQU   ISTATCVT+800
ATCSECST EQU   ISTATCVT+812
ATCSTAT2 EQU   ISTATCVT+818
ATCVTBAM EQU   ISTATCVT+908
@NM00024 EQU   ATCVTBAM+3
ATCAOSM  EQU   ISTATCVT+912
ATCGSRBQ EQU   ATCAOSM+4
ATCGSRBG EQU   ATCGSRBQ
ATCAP32  EQU   ATCAOSM+28
ATCAP34  EQU   ATCAOSM+32
ATCZFSVT EQU   ATCAOSM+68
ATCZPSVT EQU   ATCAOSM+72
ATCICAPP EQU   ATCAOSM+100
ATCLDAPP EQU   ATCAOSM+120
ATCDAPVT EQU   ATCAOSM+140
ATCAP37  EQU   ATCAOSM+264
ATCCRA   EQU   ATCAOSM+280
ATCCRACN EQU   ATCCRA+4
ATCSRB   EQU   ATCAOSM+288
ATCSRBCN EQU   ATCSRB+4
ATCCRPL  EQU   ATCAOSM+296
ATCRPLCN EQU   ATCCRPL+4
ATCVTFLG EQU   ATCAOSM+392
ATCZFLAG EQU   ATCAOSM+588
ISTLSCB  EQU   0
LSC1WORD EQU   ISTLSCB
LSCTYPE  EQU   LSC1WORD
LSCREQTG EQU   LSC1WORD+2
LSCZRT02 EQU   LSCREQTG
LSCZRT03 EQU   LSCREQTG
LSCZRT04 EQU   LSCREQTG
LSCZRT05 EQU   LSCREQTG
LSCZRT06 EQU   LSCREQTG
LSCZRT07 EQU   LSCREQTG
LSCZMNRC EQU   LSCREQTG+1
LSCZRT08 EQU   LSCZMNRC
LSCZRT09 EQU   LSCZMNRC
LSCCHAIN EQU   ISTLSCB+4
LSCCHAI1 EQU   LSCCHAIN
LSCRUCNT EQU   ISTLSCB+8
LSCFLGS  EQU   ISTLSCB+9
LSCSEQ   EQU   ISTLSCB+10
LSCLCPBA EQU   ISTLSCB+16
LSCLCCWA EQU   ISTLSCB+20
LSCFDBA  EQU   ISTLSCB+24
ISTBDU   EQU   0
BDUMODIF EQU   ISTBDU+1
BDUMOD1  EQU   BDUMODIF
BDUDAF   EQU   ISTBDU+2
BDUFUNC  EQU   BDUDAF
BDUCHECK EQU   BDUFUNC
BDUFLAGS EQU   BDUDAF+1
ISTLH    EQU   0
LHLEN    EQU   ISTLH
ISTTH    EQU   0
THFLAG1  EQU   ISTTH
THFID    EQU   THFLAG1
THFLGA   EQU   THFLAG1
THMPF    EQU   THFLGA
THFLGB   EQU   THFLAG1+1
THPYF    EQU   THFLGB
THSEF    EQU   THFLGB
THCDF    EQU   THFLGB
THDAF    EQU   ISTTH+2
THOAF    EQU   ISTTH+4
THSNF    EQU   ISTTH+6
THDCF    EQU   ISTTH+8
ISTTH2   EQU   0
TH2FLAG1 EQU   ISTTH2
TH2FID   EQU   TH2FLAG1
TH2MPF   EQU   TH2FLAG1
TH2PSI   EQU   TH2FLAG1
TH2AFI   EQU   TH2FLAG1
TH2PYF   EQU   TH2FLAG1+1
TH2SEF   EQU   TH2FLAG1+1
TH2CDF   EQU   TH2FLAG1+1
TH2DAF   EQU   ISTTH2+2
TH2OAF   EQU   ISTTH2+3
TH2SNF   EQU   ISTTH2+4
ISTFDB   EQU   0
FDBFDBA  EQU   ISTFDB
FDBDATAA EQU   ISTFDB+4
FDBDATCT EQU   ISTFDB+8
FDBOFSET EQU   ISTFDB+10
ISTBTU   EQU   0
BTUBTH   EQU   ISTBTU
BTUFID   EQU   BTUBTH
BTUREQ   EQU   BTUBTH+6
BTURQFLG EQU   BTUREQ
BTURH    EQU   BTUBTH+10
BTUSYSTR EQU   ISTBTU+18
ISTZOBUF EQU   0
ZOBFSM   EQU   ISTZOBUF+4
ISTPROCD EQU   0
PROPROC  EQU   ISTPROCD
PROPROC1 EQU   PROPROC
PROPROC2 EQU   PROPROC+1
PROCFTX  EQU   PROPROC2
PROPROC3 EQU   PROPROC+2
PROPROC4 EQU   PROPROC+3
PROPROCS EQU   0
PROSETMS EQU   PROPROCS+1
PROSETM2 EQU   PROSETMS
PROSETM3 EQU   PROSETMS+1
PROSETM4 EQU   PROSETMS+2
ISTFMCB  EQU   0
FMCSAF   EQU   ISTFMCB+2
FMCDNCBA EQU   ISTFMCB+16
FMCSTAT  EQU   ISTFMCB+28
FMCSTAT1 EQU   ISTFMCB+29
FMCCMDFL EQU   ISTFMCB+31
FMCCMPS1 EQU   ISTFMCB+36
FMCPROCD EQU   ISTFMCB+48
FMCPAB2  EQU   ISTFMCB+80
FMCPAB3  EQU   ISTFMCB+96
FMCPAB4  EQU   ISTFMCB+112
FMCPAB5  EQU   ISTFMCB+128
FMCSIPA  EQU   ISTFMCB+148
FMCNXOSQ EQU   ISTFMCB+152
FMCNXCFM EQU   FMCNXOSQ
FMCOSSN  EQU   FMCNXCFM
FMCNXOSC EQU   FMCNXOSQ+2
FMCOASN  EQU   FMCNXOSC
FMCSSTAT EQU   ISTFMCB+159
FMCSNBI  EQU   FMCSSTAT
FMCCIPI  EQU   FMCSSTAT
FMCUIPI  EQU   FMCSSTAT
FMCBIP   EQU   FMCSSTAT
FMCPURCH EQU   FMCSSTAT
FMCCONF  EQU   FMCSSTAT
FMCPACE  EQU   ISTFMCB+160
FMCPACEN EQU   FMCPACE
FMCPACEM EQU   FMCPACE+1
FMCPACPC EQU   FMCPACE+2
FMCCVAL  EQU   FMCPACE+3
FMCOBCE  EQU   FMCCVAL
FMCCLEXT EQU   ISTFMCB+164
FMCRPLA  EQU   FMCCLEXT
FMCFBA   EQU   FMCCLEXT+4
FMCCMPS2 EQU   FMCCLEXT+16
FMCFLGA  EQU   FMCCMPS2
FMCFLGCL EQU   FMCCMPS2+1
FMCPSCMD EQU   FMCCMPS2+2
FMCPSTAT EQU   FMCCMPS2+3
FMCSTAT2 EQU   ISTFMCB+186
FMCMODEB EQU   ISTFMCB+189
FMCCLSEQ EQU   ISTFMCB+190
FMCRRESP EQU   ISTFMCB+195
FMCSSEGQ EQU   ISTFMCB+200
FMCFBAS  EQU   ISTFMCB+216
FMCZV002 EQU   FMCFBAS
FMCSNCTL EQU   ISTFMCB+224
FMCSCFLG EQU   FMCSNCTL
FMCVS1   EQU   ISTFMCB+232
FMCZFLAG EQU   FMCVS1
FMCZF001 EQU   FMCZFLAG
FMCZF006 EQU   FMCZFLAG
FMCZFCSQ EQU   FMCVS1+6
FMCSHEDQ EQU   FMCVS1+8
FMCLBXM  EQU   FMCVS1+12
FMCSHEAQ EQU   FMCLBXM
FMCLCPBQ EQU   FMCVS1+16
FMCLCPAQ EQU   FMCVS1+20
FMCSEQ1  EQU   FMCVS1+34
FMCZFLG2 EQU   FMCVS1+35
FMCCVFLG EQU   FMCVS1+44
FMCFLAG  EQU   0
FMCFLGB  EQU   FMCFLAG
ISTLCCW  EQU   0
LCCWOP   EQU   ISTLCCW
LCCWRWOP EQU   LCCWOP
LCCWCTL  EQU   LCCWRWOP
LCCWFLAG EQU   ISTLCCW+1
LCCWIDAT EQU   LCCWFLAG
LCCWLSI  EQU   LCCWFLAG
LCCWDATA EQU   ISTLCCW+4
ISTLCPB  EQU   0
LCPTYPE  EQU   ISTLCPB
LCPREQTG EQU   ISTLCPB+2
LCPFLAGS EQU   LCPREQTG
LCPZF001 EQU   LCPFLAGS
LCPZRT02 EQU   LCPZF001
LCPZF002 EQU   LCPFLAGS
LCPZRT03 EQU   LCPZF002
LCPZF003 EQU   LCPFLAGS
LCPZRT04 EQU   LCPZF003
LCPZF004 EQU   LCPFLAGS
LCPZRT05 EQU   LCPZF004
LCPZRT06 EQU   LCPFLAGS
LCPZRT07 EQU   LCPFLAGS
LCPMNRCD EQU   LCPREQTG+1
LCPZRT08 EQU   LCPMNRCD
LCPZRT09 EQU   LCPMNRCD
LCPCHAIN EQU   ISTLCPB+4
LCPCHAI1 EQU   LCPCHAIN
LCPRUCNT EQU   ISTLCPB+8
LCPFLAG2 EQU   ISTLCPB+9
LCPASYN  EQU   LCPFLAG2
LCPRSTRT EQU   LCPFLAG2
LCPTLBPI EQU   LCPFLAG2
LCPFID0  EQU   LCPFLAG2
LCPSEQ   EQU   ISTLCPB+10
LCPLCCW1 EQU   ISTLCPB+12
LCPCID   EQU   ISTLCPB+16
LCPNXLCW EQU   ISTLCPB+20
LCPFDBA  EQU   ISTLCPB+24
LCPTLBAD EQU   ISTLCPB+28
LCPFOSN  EQU   ISTLCPB+32
LCPFSNCH EQU   ISTLCPB+34
LCPFLG1  EQU   ISTLCPB+37
LCPRESET EQU   LCPFLG1
LCPINTER EQU   LCPFLG1
LCPFLCCW EQU   ISTLCPB+40
LCPLCCW  EQU   ISTLCPB+48
LCPRSTQH EQU   LCPLCCW
LCPPABA  EQU   LCPLCCW+4
LCPRPHA  EQU   LCPPABA
LCPFTYPE EQU   LCPRPHA
ISTRH    EQU   0
RHFLAGS  EQU   ISTRH
RH1      EQU   RHFLAGS
RHQS     EQU   RH1
RHCHAIN  EQU   RH1
RH2      EQU   RHFLAGS+1
RHRETRY  EQU   RH2
RHRSVD1  EQU   RH2
RH3      EQU   RHFLAGS+2
ISTFSB   EQU   0
FSBFSB   EQU   ISTFSB
FSBTYPE  EQU   FSBFSB
FSBLNGTH EQU   FSBFSB+1
FSBMNRCD EQU   FSBFSB+2
FSBSFLGS EQU   FSBFSB+3
FSBFSBA  EQU   FSBFSB+4
FSBBTH   EQU   FSBFSB+8
FSBCID   EQU   FSBBTH
FSBSAF   EQU   FSBCID
FSBDAF   EQU   FSBCID+2
FSBRQTAG EQU   FSBBTH+4
FSBSEQID EQU   FSBRQTAG
FSBFLAGS EQU   FSBSEQID
FSBSEQ   EQU   FSBSEQID+1
FSBCSWST EQU   FSBBTH+6
FSBTHFLD EQU   FSBCSWST
FSBTH1   EQU   FSBTHFLD
FSBSYSRS EQU   FSBTH1
FSBTH2   EQU   FSBTHFLD+1
FSBEXTRS EQU   FSBTH2
FSBXFSTS EQU   FSBEXTRS
FSBXCODE EQU   FSBEXTRS
FSBNETRS EQU   FSBFSB+16
FSBSRCAT EQU   FSBNETRS
FSBMJRCD EQU   FSBSRCAT
FSBERC   EQU   FSBNETRS+1
FSBFBMI  EQU   FSBERC
FSBDMGRS EQU   FSBFSB+18
FSBSS1   EQU   FSBDMGRS
FSBSS2   EQU   FSBDMGRS+1
FSBLCPB  EQU   FSBFSB+20
FSBMSGID EQU   FSBLCPB
FSBLCCWA EQU   FSBFSB+24
FSBRLSTS EQU   FSBLCCWA
FSBTHCNT EQU   FSBFSB+28
FSBFDB   EQU   ISTFSB+32
ISTZIBUF EQU   0
ZIBFSM   EQU   ISTZIBUF+4
ISTICNCB EQU   0
@NM00050 EQU   ISTICNCB+53
ICNCKFLD EQU   ISTICNCB+96
ICNFLAG  EQU   ISTICNCB+100
ICNZF006 EQU   ICNFLAG
ICNFFLAG EQU   ISTICNCB+101
ICNZSWS  EQU   ISTICNCB+102
ICNFLAG2 EQU   ISTICNCB+236
ICNZD001 EQU   ISTICNCB+288
ICNWSCCW EQU   ICNZD001
ICNZD002 EQU   ISTICNCB+296
ICNZD003 EQU   ISTICNCB+320
ICNRSCCW EQU   ICNZD003
ICNZD004 EQU   ISTICNCB+328
ICNZS1VR EQU   ISTICNCB+348
ICNSRV02 EQU   ICNZS1VR
ICNDIEWA EQU   ICNSRV02
ICNDCDEB EQU   ISTICNCB+480
ICNDIDEB EQU   ICNDCDEB+12
ICNZFLAG EQU   ISTICNCB+508
ICNZH002 EQU   ISTICNCB+509
ICNZS002 EQU   ICNZH002
ICNZS003 EQU   ICNZH002
ICNZS004 EQU   ICNZH002
ICNZS006 EQU   ICNZH002
ICNZS007 EQU   ICNZH002
ICNZS008 EQU   ICNZH002
ICNZS009 EQU   ICNZH002+1
ICNZS00A EQU   ICNZH002+1
ICNZCONS EQU   ISTICNCB+680
ISTZSAVE EQU   0
ZSAZSVBC EQU   ISTZSAVE
ZSAZSVMS EQU   ZSAZSVBC
ZSAZACTV EQU   ZSAZSVMS
ZSAZSVFC EQU   ISTZSAVE+4
ZSAZSVRR EQU   ISTZSAVE+8
ZSAZSVVR EQU   ISTZSAVE+12
ZSAZTRAC EQU   ISTZSAVE+36
ISTZFSVT EQU   0
ZFSZEFBB EQU   ISTZFSVT
ZFSZEABB EQU   ZFSZEFBB
ZFSZEFAB EQU   ISTZFSVT+4
ZFSZEAAB EQU   ZFSZEFAB
ISTSRU   EQU   0
SRUTYPE  EQU   ISTSRU+1
SRULDID  EQU   ISTSRU+2
SRUSPSN  EQU   SRULDID
ISTWKE   EQU   0
WKECHAIN EQU   ISTWKE+4
WKEFLAGS EQU   WKECHAIN
ISTLUNCB EQU   0
LUNCB    EQU   ISTLUNCB
LUNZOS   EQU   ISTLUNCB+48
ISTPFCRR EQU   0
PFCCRR   EQU   ISTPFCRR
PFCCRRID EQU   PFCCRR
PFCCRRLN EQU   PFCCRR+2
PFCHDR   EQU   ISTPFCRR+4
PFCCRRO  EQU   PFCHDR
PFCFRRO  EQU   PFCHDR+4
ISTCFCRR EQU   0
CFCAUDIT EQU   ISTCFCRR
CFCNTRD  EQU   CFCAUDIT
CFCCRT   EQU   CFCAUDIT+1
ISTZCRR  EQU   0
ZCRCRR   EQU   ISTZCRR
ZCRFLGS1 EQU   ISTZCRR+12
ZCRFLGS2 EQU   ISTZCRR+13
ZCRSWFLD EQU   ISTZCRR+14
ZCRENDSH EQU   ZCRSWFLD
ZCRNDLCP EQU   ZCRSWFLD
ZCRRESET EQU   ZCRSWFLD
ZCRFLGS3 EQU   ISTZCRR+15
ZCRGENSW EQU   ISTZCRR+16
ZCRPFLGS EQU   ISTZCRR+17
ZCRIBPR  EQU   ISTZCRR+18
ZCRSCPSW EQU   ISTZCRR+19
ZCRPARMS EQU   ISTZCRR+24
ZCRFBPTR EQU   ZCRPARMS
ZCRDFRDA EQU   ZCRPARMS+10
ZCRPCOD1 EQU   ZCRPARMS+12
ZCRPFSB  EQU   ZCRPCOD1
ZCRPLSBF EQU   ZCRPCOD1
ZCRPCOD2 EQU   ZCRPARMS+13
ZCRSVRTN EQU   ISTZCRR+56
ZCRSVF3  EQU   ZCRSVRTN+8
ZCRSVF4  EQU   ZCRSVRTN+12
ZCRSVF5  EQU   ZCRSVRTN+16
ZCRSVF6  EQU   ZCRSVRTN+20
ZCRSVF7  EQU   ZCRSVRTN+24
ZCRSVF8  EQU   ZCRSVRTN+28
ZCRWKARA EQU   ISTZCRR+156
ZCRCIDSV EQU   ISTZCRR+192
ZCRAUDIT EQU   ISTZCRR+440
ZCRENTER EQU   ZCRAUDIT+5
ZCREBCIF EQU   ZCRENTER+18
ZCRLCPB  EQU   ISTZCRR+480
ZCRRHRU  EQU   ZCRLCPB
ISTASCRR EQU   0
ASCFLAGS EQU   ISTASCRR+16
ASCFLG1  EQU   ASCFLAGS
ASCFLG2  EQU   ASCFLAGS+2
ASCFLG3  EQU   ASCFLAGS+4
ASCUSRGS EQU   ISTASCRR+28
ISTAPCRR EQU   0
APCATFLG EQU   ISTAPCRR+16
APCRFLG  EQU   ISTAPCRR+18
APCSAVE  EQU   ISTAPCRR+44
APCCOMF  EQU   ISTAPCRR+116
APCCOMF1 EQU   APCCOMF
APC31FLG EQU   ISTAPCRR+132
APC52FLG EQU   ISTAPCRR+133
APC53FLG EQU   ISTAPCRR+134
APC54FLG EQU   ISTAPCRR+135
APC57FLG EQU   ISTAPCRR+136
ISTCRA   EQU   0
CRABASIC EQU   ISTCRA
CRAHDR   EQU   CRABASIC
CRACRR   EQU   CRAHDR
CRALKACT EQU   CRABASIC+8
CRASVC   EQU   ISTCRA+848
CRABUFA  EQU   CRASVC+68
ISTBFHDR EQU   0
ISTTLB   EQU   0
TLBFSBA  EQU   ISTTLB+4
ISTZLBVT EQU   0
ZLBZBFSC EQU   ISTZLBVT+88
ISTZDFC0 EQU   0
ISTZDFA0 EQU   0
ISTZDFB0 EQU   0
ISTZEFBB EQU   0
ISTZBFZ0 EQU   0
ISTZBFSC EQU   0
ISTAPC37 EQU   0
FMZL0060 EQU   0
ISTAPC34 EQU   0
ZIBSRB   EQU   0
IOSATTSC EQU   IOSIPIB
IOSWTOWA EQU   IOSIPIB
IOSPCISC EQU   IOSIPIB
ZOBDLBT  EQU   ISTZOBUF
ZOBDLBCM EQU   ZOBDLBT
@NM00028 EQU   ZOBDLBCM+25
ZOBBTU   EQU   ZOBDLBT+28
ZOBWCC   EQU   ZOBDLBT+48
ZOBECCC  EQU   ZOBDLBT+50
ZOBTEXT  EQU   ZOBBTU
ZOBDIO   EQU   ZOBFSM
ZOBCCW2  EQU   ZOBDIO+8
ZOBCPTCC EQU   ZOBCCW2
ZOBFLAGS EQU   ZOBCCW2+5
ZOBRT06  EQU   ZOBFLAGS
ZOBRT08  EQU   ZOBFLAGS
ZOBCCW3  EQU   ZOBDIO+16
ZOBCPTRC EQU   ZOBCCW3
ZOBCPN2C EQU   ZOBCPTRC
ZOBCPTRA EQU   ZOBCCW3+1
@NM00032 EQU   ZOBBTU
ZOBTH2   EQU   @NM00032+4
LCPZTIE  EQU   LCPCID
LCPZSNAM EQU   LCPZTIE+8
FSBCOMBN EQU   FSBNETRS
FSBRHFLD EQU   FSBCOMBN+1
FSBRH3   EQU   FSBRHFLD+2
FSBLDFLG EQU   FSBRH3
@NM00044 EQU   FSBRQTAG
ZIBDIO   EQU   ZIBFSM
ZIBCCW2  EQU   ZIBDIO+8
ZIBCPTCC EQU   ZIBCCW2
ZIBAIO   EQU   ISTZIBUF
ZIBAIOCM EQU   ZIBAIO
ZIBFDBZ  EQU   ZIBAIOCM
ZIBFIB   EQU   ZIBAIO+16
ZIBFSB   EQU   ZIBFIB
ZIBMDREC EQU   ZIBFSB+4
ZIBMDRIN EQU   ZIBFSB+28
ZIBBTU   EQU   ZIBFIB+32
ZIBFDBS  EQU   ZIBBTU
@NM00047 EQU   ZIBBTU+12
ZIBFID1  EQU   @NM00047+1
ZIBFITXT EQU   ZIBFID1
ZIBSIB   EQU   ZIBFIB
ZIBREC   EQU   ZIBMDRIN
ZIBRECPL EQU   ZIBREC
ZIBRECHD EQU   ZIBRECPL
ZIBRECRS EQU   ZIBREC+8
ZIBRECDT EQU   ZIBREC+10
ZIBMDRRC EQU   ZIBMDREC
ZIBRCPL  EQU   ZIBMDRRC
ZIBRCDT  EQU   ZIBMDRRC+24
@NM00049 EQU   ZIBBTU
SRUSENSE EQU   ISTSRU
SRURMS   EQU   ISTSRU
SRUZIB   EQU   ISTSRU
SRUNETS  EQU   SRUZIB
ISTUNBRU EQU   SRUTYPE
LCCWPTR  EQU   ZCRSVF3
PABPTR   EQU   ZCRSVF7
NEWFSB   EQU   RPHSRPRM
NEWBUF   EQU   RPHSRPRM
SRB      EQU   SRBSECT
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS
UNBTYPE  EQU   ISTUNBRU
SRUNAF   EQU   SRUZIB+3
SRUNSREQ EQU   SRUNETS+2
SRUNSUBC EQU   SRUNETS+1
SRUNSCAT EQU   SRUNETS
SRUREQRE EQU   SRURMS+2
SRUPFX2  EQU   SRURMS+1
SRUPFX1  EQU   SRURMS
SRUSENS2 EQU   SRUSENSE+2
SRUSNS2  EQU   SRUSENSE+1
SRUSNS1  EQU   SRUSENSE
ZIBTH2   EQU   @NM00049+4
ZIBLH    EQU   @NM00049
ZIBRCTXT EQU   ZIBMDRRC+36
ZIBRCRID EQU   ZIBRCDT+10
ZIBRCNAM EQU   ZIBRCDT+2
ZIBRCUA  EQU   ZIBRCDT
ZIBRCPUI EQU   ZIBRCPL+20
ZIBRCPUN EQU   ZIBRCPL+16
ZIBRCTIM EQU   ZIBRCPL+12
ZIBRCDAT EQU   ZIBRCPL+8
ZIBRCRS1 EQU   ZIBRCPL+6
ZIBRCSID EQU   ZIBRCPL+5
ZIBRCID  EQU   ZIBRCPL+4
ZIBRCSW  EQU   ZIBRCPL+2
ZIBRCSYR EQU   ZIBRCPL+1
ZIBRCL   EQU   ZIBRCPL
ZIBRECTX EQU   ZIBREC+22
ZIBRECID EQU   ZIBRECDT+10
ZIBRECNA EQU   ZIBRECDT+2
ZIBRECUA EQU   ZIBRECDT
ZIBRECSV EQU   ZIBRECRS
ZIBRECDA EQU   ZIBRECPL+4
ZIBRECSI EQU   ZIBRECHD+3
ZIBRECDV EQU   ZIBRECHD+2
ZIBRECFL EQU   ZIBRECHD+1
ZIBRECTY EQU   ZIBRECHD
ZIBTEXT  EQU   ZIBSIB+4
ZIBRSV04 EQU   ZIBSIB
ZIBTEXT2 EQU   ZIBFITXT
ZIBTEXT1 EQU   ZIBFIB+52
@NM00048 EQU   @NM00047
@NM00046 EQU   ZIBMDREC
@NM00045 EQU   ZIBFSB
ZIBLNG2  EQU   ZIBAIOCM+14
ZIBRSV03 EQU   ZIBAIOCM+13
ZIBWKBYT EQU   ZIBAIOCM+12
ZIBCPNPK EQU   ZIBCCW2+6
ZIBRSV02 EQU   ZIBCCW2+5
ZIBCPTPF EQU   ZIBCCW2+4
ZIBCPTCA EQU   ZIBCCW2+1
ZIBCPNPC EQU   ZIBCPTCC
ZIBCPRDK EQU   ZIBDIO+6
ZIBRSV01 EQU   ZIBDIO+5
ZIBCPRDF EQU   ZIBDIO+4
ZIBCPTXA EQU   ZIBDIO+1
ZIBCPRDC EQU   ZIBDIO
FSBRT0B  EQU   @NM00044+1
FSBRT0A  EQU   @NM00044+1
FSBRT09  EQU   @NM00044+1
FSBRT08  EQU   @NM00044+1
FSBRT07  EQU   @NM00044
FSBRT06  EQU   @NM00044
FSBRT05  EQU   @NM00044
FSBRT04  EQU   @NM00044
FSBRT03  EQU   @NM00044
FSBRT02  EQU   @NM00044
FSBRT01  EQU   @NM00044
FSBRT00  EQU   @NM00044
FSBLDCUF EQU   FSBLDFLG
FSBLDSIF EQU   FSBLDFLG
FSBLDSOF EQU   FSBLDFLG
FSBLDEBF EQU   FSBLDFLG
FSBLDBBF EQU   FSBLDFLG
FSBLDFME EQU   FSBLDFLG
FSBLDSCF EQU   FSBLDFLG
FSBLDRMF EQU   FSBLDFLG
FSBRH2   EQU   FSBRHFLD+1
FSBRH1   EQU   FSBRHFLD
FSBALIGN EQU   FSBCOMBN
LCPZTRV4 EQU   LCPZSNAM+4
LCPZTRV1 EQU   LCPZSNAM
LCPZSNA  EQU   LCPZTIE+4
LCPZFMCA EQU   LCPZTIE
ZOBLH    EQU   @NM00032
ZOBCPN2K EQU   ZOBCCW3+6
ZOBRSV99 EQU   ZOBCCW3+5
ZOBCPN2F EQU   ZOBCCW3+4
ZOBCPTC2 EQU   ZOBCPTRA
ZOBCPTC1 EQU   ZOBCPN2C
ZOBCPNPK EQU   ZOBCCW2+6
ZOBRSV03 EQU   ZOBFLAGS
ZOBCPNPF EQU   ZOBCCW2+4
ZOBCPTCA EQU   ZOBCCW2+1
ZOBCPNPC EQU   ZOBCPTCC
ZOBCPWTK EQU   ZOBDIO+6
ZOBRSV02 EQU   ZOBDIO+5
ZOBCPWTF EQU   ZOBDIO+4
ZOBCPTXA EQU   ZOBDIO+1
ZOBCPWTC EQU   ZOBDIO
ZOBRSV09 EQU   ZOBECCC
ZOBECSP  EQU   ZOBECCC
ZOBRSV08 EQU   ZOBECCC
ZOBRSV07 EQU   ZOBDLBT+49
ZOBRSV06 EQU   ZOBWCC
ZOBWCSP  EQU   ZOBWCC
ZOBRSV05 EQU   ZOBWCC
ZOBRSV10 EQU   ZOBDLBCM+26
@NM00031 EQU   @NM00028
@NM00030 EQU   @NM00028
@NM00029 EQU   @NM00028
ZOBRSV04 EQU   ZOBDLBCM+16
ZOBLNG2  EQU   ZOBDLBCM+14
ZOBRSV01 EQU   ZOBDLBCM+12
ZOBFDB   EQU   ZOBDLBCM
IOSPCIWA EQU   IOSPCISC+44
IOSPCIRS EQU   IOSPCISC+8
@NM00007 EQU   IOSPCISC+4
@NM00006 EQU   IOSPCISC
IOSWRNDR EQU   IOSWTOWA+4
IOSWTOPT EQU   IOSWTOWA+3
IOSWTOCP EQU   IOSWTOWA+2
IOSWTOCH EQU   IOSWTOWA
IOSATTWA EQU   IOSATTSC+40
@NM00005 EQU   IOSATTSC+24
IOSATTSN EQU   IOSATTSC
ZLBZIFVB EQU   ISTZLBVT+84
ZLBZIFUB EQU   ISTZLBVT+80
ZLBZIFSB EQU   ISTZLBVT+76
ZLBRSV22 EQU   ISTZLBVT+72
ZLBZBFID EQU   ISTZLBVT+68
ZLBZBFX0 EQU   ISTZLBVT+64
ZLBRSV02 EQU   ISTZLBVT+60
ZLBRSV21 EQU   ISTZLBVT+56
ZLBZBFJB EQU   ISTZLBVT+52
ZLBZBFIB EQU   ISTZLBVT+48
ZLBZBFHB EQU   ISTZLBVT+44
ZLBZBFGB EQU   ISTZLBVT+40
ZLBZBFFB EQU   ISTZLBVT+36
ZLBZBFEB EQU   ISTZLBVT+32
ZLBZBFDB EQU   ISTZLBVT+28
ZLBZBFCB EQU   ISTZLBVT+24
ZLBZBFBB EQU   ISTZLBVT+20
ZLBZBFAB EQU   ISTZLBVT+16
ZLBZBFNB EQU   ISTZLBVT+12
ZLBZCFAI EQU   ISTZLBVT+8
ZLBZBF0B EQU   ISTZLBVT+4
ZLBZAF0B EQU   ISTZLBVT
TLBLCCWS EQU   ISTTLB+8
TLBLCPA  EQU   ISTTLB
BFHDATA  EQU   ISTBFHDR+8
BFHUSED  EQU   ISTBFHDR+6
BFHSIZE  EQU   ISTBFHDR+4
BFHNXCHN EQU   ISTBFHDR
CRACHAIN EQU   ISTCRA+928
CRARSV02 EQU   ISTCRA+924
CRARSV01 EQU   ISTCRA+920
CRABFTBA EQU   CRABUFA
CRAMASK  EQU   CRASVC+64
CRAHSIZ  EQU   CRASVC+60
CRAASCRR EQU   CRASVC
CRAPROCR EQU   ISTCRA+312
CRAPSS   EQU   ISTCRA+160
CRARPH   EQU   ISTCRA+52
CRALAPTR EQU   CRABASIC+48
CRAL9PTR EQU   CRABASIC+44
CRAL8PTR EQU   CRABASIC+40
CRAL7PTR EQU   CRABASIC+36
CRAL6PTR EQU   CRABASIC+32
CRAL5PTR EQU   CRABASIC+28
CRAL4PTR EQU   CRABASIC+24
CRAL3PTR EQU   CRABASIC+20
CRAL2PTR EQU   CRABASIC+16
CRAL1PTR EQU   CRABASIC+12
CRALEV01 EQU   CRALKACT+3
CRALEV02 EQU   CRALKACT+3
CRALEV03 EQU   CRALKACT+3
CRALEV04 EQU   CRALKACT+3
CRALEV05 EQU   CRALKACT+3
CRALEV06 EQU   CRALKACT+3
CRALEV07 EQU   CRALKACT+3
CRALEV08 EQU   CRALKACT+3
CRALEV09 EQU   CRALKACT+2
CRALEV10 EQU   CRALKACT+2
CRALEV11 EQU   CRALKACT+2
CRALEV12 EQU   CRALKACT+2
CRALEV13 EQU   CRALKACT+2
CRALEV14 EQU   CRALKACT+2
CRALEV15 EQU   CRALKACT+2
CRALEV16 EQU   CRALKACT+2
CRALEV17 EQU   CRALKACT+1
CRALEV18 EQU   CRALKACT+1
CRALEV19 EQU   CRALKACT+1
CRALEV20 EQU   CRALKACT+1
CRALEV21 EQU   CRALKACT+1
CRALEV22 EQU   CRALKACT+1
CRALEV23 EQU   CRALKACT+1
CRALEV24 EQU   CRALKACT+1
CRALEV25 EQU   CRALKACT
CRALEV26 EQU   CRALKACT
CRALEV27 EQU   CRALKACT
CRALEV28 EQU   CRALKACT
CRALEV29 EQU   CRALKACT
CRALEV30 EQU   CRALKACT
CRALEV31 EQU   CRALKACT
CRALEV32 EQU   CRALKACT
CRAFRR   EQU   CRAHDR+4
@NM00072 EQU   ISTAPCRR+137
@NM00071 EQU   APC57FLG
APCNREL  EQU   APC57FLG
APCRECRA EQU   APC57FLG
@NM00070 EQU   APC54FLG
APCRLST  EQU   APC54FLG
APCPR153 EQU   APC53FLG
@NM00069 EQU   APC52FLG
APCWKF   EQU   APC52FLG
APCNWF   EQU   APC52FLG
APCRDQ   EQU   APC52FLG
APCQENQ  EQU   APC52FLG
APCSMSR  EQU   APC52FLG
APCCKRQ  EQU   APC52FLG
@NM00068 EQU   APC31FLG
APCSORT  EQU   APC31FLG
APCRESCH EQU   APC31FLG
APCTPXIT EQU   APC31FLG
APCSWTWD EQU   ISTAPCRR+128
APCSAV2  EQU   ISTAPCRR+124
APCSAV1  EQU   ISTAPCRR+120
APCRETCD EQU   APCCOMF+2
@NM00067 EQU   APCCOMF1+1
APCZLBER EQU   APCCOMF1
APCEXIT  EQU   APCCOMF1
APCRELR  EQU   APCCOMF1
APCIRB2  EQU   APCCOMF1
APCIRB1  EQU   APCCOMF1
APCSMCR  EQU   APCCOMF1
APCUETSK EQU   APCCOMF1
APCSSTSK EQU   APCCOMF1
APCESTAL EQU   APCSAVE
APCFRRPM EQU   ISTAPCRR+40
APCQWFO  EQU   ISTAPCRR+36
APCPABSV EQU   ISTAPCRR+32
APCRTRN  EQU   ISTAPCRR+28
APCTCBA  EQU   ISTAPCRR+24
APCPSTA  EQU   ISTAPCRR+20
@NM00066 EQU   APCRFLG+1
APC31R   EQU   APCRFLG
APC58R   EQU   APCRFLG
APC57R   EQU   APCRFLG
APC56R   EQU   APCRFLG
APC54R   EQU   APCRFLG
APC53R   EQU   APCRFLG
APC52R   EQU   APCRFLG
APC51R   EQU   APCRFLG
@NM00065 EQU   APCATFLG+1
APC31E   EQU   APCATFLG
APC58E   EQU   APCATFLG
APC57E   EQU   APCATFLG
APC56E   EQU   APCATFLG
APC54E   EQU   APCATFLG
APC53E   EQU   APCATFLG
APC52E   EQU   APCATFLG
APC51E   EQU   APCATFLG
APCHDRSV EQU   ISTAPCRR
ASCPSREG EQU   ISTASCRR+44
ASCUSR01 EQU   ASCUSRGS+12
ASCUSR00 EQU   ASCUSRGS+8
ASCUSR15 EQU   ASCUSRGS+4
ASCUSR14 EQU   ASCUSRGS
ASCETRYA EQU   ISTASCRR+24
ASCKEY   EQU   ISTASCRR+23
ASCAUDIT EQU   ASCFLG3
ASCFBDUD EQU   ASCFLG3
ASCLLKF  EQU   ASCFLG3
ASCKEYF  EQU   ASCFLG3
ASCFBDAL EQU   ASCFLG3
ASCFSRGT EQU   ASCFLG3
ASCICR   EQU   ASCFLG2
ASCFSRIC EQU   ASCFLG2
ASCFBDIC EQU   ASCFLG2
ASCFBAIC EQU   ASCFLG2
ASCPASTR EQU   ASCFLG1
ASCFSR   EQU   ASCFLG1
ASCFBD   EQU   ASCFLG1
ASCFBA   EQU   ASCFLG1
ASCPFCRR EQU   ISTASCRR
ZCRRU    EQU   ZCRRHRU+3
ZCRRH    EQU   ZCRRHRU
ZCRWORDA EQU   ISTZCRR+477
ZCRCMNRC EQU   ISTZCRR+476
ZCRRSV97 EQU   ZCRENTER+18
ZCREIC2B EQU   ZCRENTER+18
ZCREAC2B EQU   ZCRENTER+18
ZCRELCAB EQU   ZCRENTER+18
ZCREDCMF EQU   ZCRENTER+18
ZCREICSG EQU   ZCRENTER+18
ZCREDCK0 EQU   ZCRENTER+18
ZCRECFY0 EQU   ZCRENTER+17
ZCREKCCB EQU   ZCRENTER+17
ZCREDCNB EQU   ZCRENTER+17
ZCREICOE EQU   ZCRENTER+17
ZCREBCNB EQU   ZCRENTER+17
ZCREBC0L EQU   ZCRENTER+17
ZCREBCAL EQU   ZCRENTER+17
ZCREDCQR EQU   ZCRENTER+17
ZCREDCPR EQU   ZCRENTER+16
ZCREBCSB EQU   ZCRENTER+16
ZCREAC1R EQU   ZCRENTER+16
ZCRECCCI EQU   ZCRENTER+16
ZCRECCAI EQU   ZCRENTER+16
ZCRECCBI EQU   ZCRENTER+16
ZCREBCAR EQU   ZCRENTER+16
ZCREBCDR EQU   ZCRENTER+16
ZCREBCBR EQU   ZCRENTER+15
ZCREDCXR EQU   ZCRENTER+15
ZCREDCWB EQU   ZCRENTER+15
ZCREDCWR EQU   ZCRENTER+15
ZCREKCCN EQU   ZCRENTER+15
ZCREKCBN EQU   ZCRENTER+15
ZCREKCBB EQU   ZCRENTER+15
ZCREJC0B EQU   ZCRENTER+15
ZCREJCDB EQU   ZCRENTER+14
ZCREJCCB EQU   ZCRENTER+14
ZCREJCBB EQU   ZCRENTER+14
ZCREJCAB EQU   ZCRENTER+14
ZCREIC1B EQU   ZCRENTER+14
ZCREIC0B EQU   ZCRENTER+14
ZCREICX0 EQU   ZCRENTER+14
ZCREICWB EQU   ZCRENTER+14
ZCREICVB EQU   ZCRENTER+13
ZCREICUB EQU   ZCRENTER+13
ZCREICTB EQU   ZCRENTER+13
ZCREICSC EQU   ZCRENTER+13
ZCREICSB EQU   ZCRENTER+13
ZCREICRB EQU   ZCRENTER+13
ZCREICQB EQU   ZCRENTER+13
ZCREICQA EQU   ZCRENTER+13
ZCREICOB EQU   ZCRENTER+12
ZCREICOA EQU   ZCRENTER+12
ZCREICNB EQU   ZCRENTER+12
ZCREICNA EQU   ZCRENTER+12
ZCREICMB EQU   ZCRENTER+12
ZCREICLB EQU   ZCRENTER+12
ZCREICKG EQU   ZCRENTER+12
ZCREICKE EQU   ZCRENTER+12
ZCREICKB EQU   ZCRENTER+11
ZCREICJB EQU   ZCRENTER+11
ZCREICID EQU   ZCRENTER+11
ZCREICIB EQU   ZCRENTER+11
ZCREICHB EQU   ZCRENTER+11
ZCREICGB EQU   ZCRENTER+11
ZCREICEB EQU   ZCRENTER+11
ZCREICDB EQU   ZCRENTER+11
ZCREICCI EQU   ZCRENTER+10
ZCREICCB EQU   ZCRENTER+10
ZCREICBI EQU   ZCRENTER+10
ZCREICBB EQU   ZCRENTER+10
ZCREICAB EQU   ZCRENTER+10
ZCREICAA EQU   ZCRENTER+10
ZCREHCAN EQU   ZCRENTER+10
ZCREGC0B EQU   ZCRENTER+10
ZCREGC0A EQU   ZCRENTER+9
ZCREGCLA EQU   ZCRENTER+9
ZCREGCEB EQU   ZCRENTER+9
ZCREGCDB EQU   ZCRENTER+9
@NM00064 EQU   ZCRENTER+9
ZCREGCBB EQU   ZCRENTER+9
ZCREGCAB EQU   ZCRENTER+9
ZCREFCEB EQU   ZCRENTER+9
ZCREFCEA EQU   ZCRENTER+8
ZCREECTA EQU   ZCRENTER+8
ZCREECEA EQU   ZCRENTER+8
ZCREECDA EQU   ZCRENTER+8
ZCREECCB EQU   ZCRENTER+8
ZCREECCA EQU   ZCRENTER+8
ZCREECBB EQU   ZCRENTER+8
ZCREECBA EQU   ZCRENTER+8
ZCREDCMB EQU   ZCRENTER+7
ZCREDCL0 EQU   ZCRENTER+7
ZCREDCKB EQU   ZCRENTER+7
ZCREDCKA EQU   ZCRENTER+7
ZCREDCJ0 EQU   ZCRENTER+7
ZCREDCI0 EQU   ZCRENTER+7
ZCREDCH0 EQU   ZCRENTER+7
ZCREDCF0 EQU   ZCRENTER+7
ZCREDCE0 EQU   ZCRENTER+6
ZCREDCD0 EQU   ZCRENTER+6
ZCREDCC0 EQU   ZCRENTER+6
ZCREDCB0 EQU   ZCRENTER+6
ZCREDCA0 EQU   ZCRENTER+6
ZCRECC2B EQU   ZCRENTER+6
ZCRECC1B EQU   ZCRENTER+6
ZCRECC1A EQU   ZCRENTER+6
ZCRECC0B EQU   ZCRENTER+5
ZCRECC0A EQU   ZCRENTER+5
ZCREBC0B EQU   ZCRENTER+5
ZCREBC0A EQU   ZCRENTER+5
ZCREBCZ0 EQU   ZCRENTER+5
ZCREBCY0 EQU   ZCRENTER+5
ZCREBCX0 EQU   ZCRENTER+5
ZCREBCXA EQU   ZCRENTER+5
ZCREBCSC EQU   ZCRENTER+4
ZCREBCRB EQU   ZCRENTER+4
ZCREBCRA EQU   ZCRENTER+4
ZCREBCQB EQU   ZCRENTER+4
ZCREBCPB EQU   ZCRENTER+4
ZCREBCOB EQU   ZCRENTER+4
ZCREBCNE EQU   ZCRENTER+4
ZCREBCND EQU   ZCRENTER+4
ZCREBCMB EQU   ZCRENTER+3
ZCREBCLB EQU   ZCRENTER+3
ZCREBCLA EQU   ZCRENTER+3
ZCREBCKB EQU   ZCRENTER+3
ZCREBCKA EQU   ZCRENTER+3
ZCREBCJB EQU   ZCRENTER+3
ZCREBCJA EQU   ZCRENTER+3
ZCREBCID EQU   ZCRENTER+3
ZCREBCIB EQU   ZCRENTER+2
ZCREBCIA EQU   ZCRENTER+2
ZCREBCHB EQU   ZCRENTER+2
ZCREBCHA EQU   ZCRENTER+2
ZCREBCGB EQU   ZCRENTER+2
ZCREBCGA EQU   ZCRENTER+2
ZCREBCFB EQU   ZCRENTER+2
ZCREBCFA EQU   ZCRENTER+2
ZCREBCEB EQU   ZCRENTER+1
ZCREBCDI EQU   ZCRENTER+1
ZCREBCCB EQU   ZCRENTER+1
ZCREBCBI EQU   ZCRENTER+1
ZCREBCBB EQU   ZCRENTER+1
ZCREBCBA EQU   ZCRENTER+1
ZCREBCAM EQU   ZCRENTER+1
ZCREBCAI EQU   ZCRENTER+1
ZCREBCAG EQU   ZCRENTER
ZCREBCAE EQU   ZCRENTER
ZCREBCAB EQU   ZCRENTER
ZCREBCAA EQU   ZCRENTER
ZCREAC1B EQU   ZCRENTER
ZCREAC0B EQU   ZCRENTER
ZCREAC0A EQU   ZCRENTER
ZCREAC1A EQU   ZCRENTER
ZCRTNAME EQU   ZCRAUDIT+1
ZCRTID   EQU   ZCRAUDIT
ZCRREMIC EQU   ISTZCRR+436
ZCRSAVEZ EQU   ISTZCRR+196
ZCRDAFSV EQU   ZCRCIDSV+2
ZCRSAFSV EQU   ZCRCIDSV
ZCRR13SV EQU   ISTZCRR+188
ZCRR2SV  EQU   ISTZCRR+184
ZCROPCDE EQU   ISTZCRR+183
ZCRPRMTC EQU   ISTZCRR+182
ZCRRCDSV EQU   ISTZCRR+181
ZCRAWQSW EQU   ISTZCRR+180
ZCRTOPQ  EQU   ISTZCRR+180
ZCRLSTFB EQU   ISTZCRR+180
ZCRXSCHD EQU   ISTZCRR+180
ZCRNXTEL EQU   ISTZCRR+180
ZCRSCANQ EQU   ISTZCRR+180
ZCRMOREL EQU   ISTZCRR+180
ZCRFBPRC EQU   ISTZCRR+180
ZCRFSBSV EQU   ISTZCRR+176
ZCRSVWK5 EQU   ZCRWKARA+16
ZCRSVWK4 EQU   ZCRWKARA+12
ZCRSVWK3 EQU   ZCRWKARA+8
ZCRSVWK2 EQU   ZCRWKARA+4
ZCRSVWK1 EQU   ZCRWKARA
ZCRSVF25 EQU   ZCRSVRTN+96
ZCRSVF24 EQU   ZCRSVRTN+92
ZCRSVF23 EQU   ZCRSVRTN+88
ZCRSVF22 EQU   ZCRSVRTN+84
ZCRSVF21 EQU   ZCRSVRTN+80
ZCRSVF20 EQU   ZCRSVRTN+76
ZCRSVF19 EQU   ZCRSVRTN+72
ZCRSVF18 EQU   ZCRSVRTN+68
ZCRSVF17 EQU   ZCRSVRTN+64
ZCRSVF16 EQU   ZCRSVRTN+60
ZCRSVF15 EQU   ZCRSVRTN+56
ZCRSVF14 EQU   ZCRSVRTN+52
ZCRSVF13 EQU   ZCRSVRTN+48
ZCRSVF12 EQU   ZCRSVRTN+44
ZCRSVF11 EQU   ZCRSVRTN+40
ZCRSVF10 EQU   ZCRSVRTN+36
ZCRSVF9  EQU   ZCRSVRTN+32
ZCRSVF2  EQU   ZCRSVRTN+4
ZCRSVF1  EQU   ZCRSVRTN
ZCRPVZB  EQU   ISTZCRR+52
ZCRZLB   EQU   ISTZCRR+48
ZCRBFPTR EQU   ISTZCRR+44
ZCRCCWA  EQU   ISTZCRR+40
ZCRPSW   EQU   ZCRPARMS+15
ZCRPCHAR EQU   ZCRPARMS+14
ZCRPRES2 EQU   ZCRPCOD2
ZCRPMFGF EQU   ZCRPCOD2
ZCRPFHDR EQU   ZCRPCOD2
ZCRPPG2  EQU   ZCRPCOD2
ZCRPRES  EQU   ZCRPCOD1
ZCRPCFTX EQU   ZCRPCOD1
ZCRPBUF  EQU   ZCRPCOD1
ZCRPLSCB EQU   ZCRPCOD1
ZCRPLSBQ EQU   ZCRPLSBF
ZCRPLNG  EQU   ZCRPCOD1
ZCRPPG   EQU   ZCRPCOD1
ZCRDTODA EQU   ZCRDFRDA
ZCRMLNG  EQU   ZCRPARMS+8
ZCRTBPTR EQU   ZCRPARMS+4
ZCRCBPTR EQU   ZCRFBPTR
ZCRCRLCP EQU   ISTZCRR+20
@NM00063 EQU   ZCRSCPSW
ZCRSKIPT EQU   ZCRSCPSW
ZCRFSBWE EQU   ZCRSCPSW
ZCRPRCMP EQU   ZCRSCPSW
ZCRLREQ  EQU   ZCRSCPSW
ZCRRJLCP EQU   ZCRSCPSW
ZCRTPINV EQU   ZCRSCPSW
ZCRTPEX  EQU   ZCRSCPSW
@NM00062 EQU   ZCRIBPR
ZCR3270R EQU   ZCRIBPR
ZCR3270  EQU   ZCRIBPR
ZCRLCPFD EQU   ZCRIBPR
ZCRLCPFR EQU   ZCRIBPR
ZCRRELK  EQU   ZCRIBPR
ZCRERR   EQU   ZCRIBPR
ZCRNOBUF EQU   ZCRIBPR
@NM00061 EQU   ZCRPFLGS
ZCRQAHED EQU   ZCRPFLGS
ZCRF1RES EQU   ZCRGENSW
ZCRBRIS  EQU   ZCRGENSW
ZCRCLRBD EQU   ZCRGENSW
ZCREXRES EQU   ZCRGENSW
ZCRLCSYN EQU   ZCRGENSW
ZCRRT06  EQU   ZCRGENSW
ZCRTSW2  EQU   ZCRGENSW
ZCRTSW1  EQU   ZCRGENSW
ZCRINLCP EQU   ZCRFLGS3
ZCRWRPTR EQU   ZCRFLGS3
ZCRNOFRE EQU   ZCRFLGS3
ZCREDRIV EQU   ZCRFLGS3
ZCRDISC  EQU   ZCRFLGS3
ZCRTPDIS EQU   ZCRFLGS3
ZCRTPCON EQU   ZCRFLGS3
ZCRTIC   EQU   ZCRFLGS3
ZCRCNLXL EQU   ZCRRESET
ZCRENDAN EQU   ZCRSWFLD
ZCRENDXL EQU   ZCRSWFLD
ZCRENDX  EQU   ZCRSWFLD
ZCROB1   EQU   ZCRNDLCP
ZCRENDPR EQU   ZCRSWFLD
ZCREXTYP EQU   ZCRSWFLD
ZCRSLCP  EQU   ZCRENDSH
ZCRIF0E3 EQU   ZCRFLGS2
ZCRIF0E2 EQU   ZCRFLGS2
ZCRIF0E1 EQU   ZCRFLGS2
ZCROB    EQU   ZCRFLGS2
ZCRFMSED EQU   ZCRFLGS2
ZCRSHEDI EQU   ZCRFLGS2
ZCRLOCAL EQU   ZCRFLGS2
ZCRFEXIT EQU   ZCRFLGS1
ZCRUNSOL EQU   ZCRFLGS1
ZCRENDLP EQU   ZCRFLGS1
ZCRNRMEX EQU   ZCRFLGS1
ZCRWAIT  EQU   ZCRFLGS1
ZCRDEQSW EQU   ZCRFLGS1
ZCRQUESW EQU   ZCRFLGS1
ZCREXSW  EQU   ZCRFLGS1
ZCRFRRA  EQU   ISTZCRR+8
ZCRCHAIN EQU   ISTZCRR+4
ZCRFLAG  EQU   ZCRCRR+3
ZCRLEN   EQU   ZCRCRR+1
ZCRID    EQU   ZCRCRR
CCFRSVD1 EQU   CFCCRT
CCFCR2   EQU   CFCCRT
CCFCRP   EQU   CFCCRT
CCFCR1   EQU   CFCCRT
CCFCS2   EQU   CFCCRT
CCFCS1   EQU   CFCCRT
NCFRSVD  EQU   CFCNTRD
NCFCR2   EQU   CFCNTRD
NCFCRP   EQU   CFCNTRD
NCFCR1   EQU   CFCNTRD
NCFCS2   EQU   CFCNTRD
NCFCS1   EQU   CFCNTRD
PFCRSV01 EQU   ISTPFCRR+13
PFCFTA   EQU   ISTPFCRR+12
CRRFRR   EQU   PFCFRRO
CRRCHAIN EQU   PFCCRRO
CRRLEN   EQU   PFCCRRLN
PFCRSV10 EQU   PFCCRR+1
CRRID    EQU   PFCCRRID
LUNZC001 EQU   LUNZOS+8
LUNLOCK  EQU   LUNZOS
WKECHNGP EQU   WKECHAIN+1
@NM00060 EQU   WKEFLAGS
WKEGATE  EQU   WKEFLAGS
@NM00059 EQU   ISTWKE
SRURSV01 EQU   SRULDID+4
SRUPSSN  EQU   SRULDID+2
SRUDFCLV EQU   SRUSPSN
@NM00058 EQU   SRUTYPE
SRUPSAC  EQU   SRUTYPE
SRUSPAC  EQU   SRUTYPE
SRUQSREQ EQU   ISTSRU
ZFSZWRD4 EQU   ISTZFSVT+36
ZFSZWRD3 EQU   ISTZFSVT+32
ZFSZEFCB EQU   ISTZFSVT+28
ZFSZFFEB EQU   ISTZFSVT+24
ZFSZDFJ0 EQU   ISTZFSVT+20
ZFSZFFFB EQU   ISTZFSVT+16
ZFSZFFDB EQU   ISTZFSVT+12
ZFSZFFCB EQU   ISTZFSVT+8
ZFSZEMAB EQU   ZFSZEAAB
ZFSZEMBB EQU   ZFSZEABB
ICNZCON6 EQU   ICNZCONS+10
ICNZCON5 EQU   ICNZCONS+8
ICNZCON4 EQU   ICNZCONS+6
ICNZCON3 EQU   ICNZCONS+4
ICNZCON2 EQU   ICNZCONS+2
ICNZCON1 EQU   ICNZCONS
ICNZATSA EQU   ISTICNCB+676
ICNZX012 EQU   ISTICNCB+675
ICNZX011 EQU   ISTICNCB+674
ICNZX010 EQU   ISTICNCB+672
ICNSRB   EQU   ISTICNCB+628
ICNIOSB  EQU   ISTICNCB+520
ICNZC001 EQU   ISTICNCB+512
ICNZX013 EQU   ISTICNCB+511
ICNZS010 EQU   ICNZH002+1
ICNZS00F EQU   ICNZH002+1
ICNZS00E EQU   ICNZH002+1
ICNZS00D EQU   ICNZH002+1
ICNZS00C EQU   ICNZH002+1
ICNZS00B EQU   ICNZH002+1
ICNZS01A EQU   ICNZS00A
ICNZS019 EQU   ICNZS009
ICNZS018 EQU   ICNZS008
ICNZS017 EQU   ICNZS007
ICNZS016 EQU   ICNZS006
ICNZS005 EQU   ICNZH002
ICNZS014 EQU   ICNZS004
ICNZS013 EQU   ICNZS003
ICNZS012 EQU   ICNZS002
ICNZS001 EQU   ICNZH002
ICNZF028 EQU   ICNZFLAG
ICNZF027 EQU   ICNZFLAG
ICNZF026 EQU   ICNZFLAG
ICNZF025 EQU   ICNZFLAG
ICNZF024 EQU   ICNZFLAG
ICNZF023 EQU   ICNZFLAG
ICNZF022 EQU   ICNZFLAG
ICNZF021 EQU   ICNZFLAG
ICNWORD5 EQU   ISTICNCB+504
ICNMSIZE EQU   ISTICNCB+500
ICNLCVTA EQU   ISTICNCB+496
ICNDEBAD EQU   ICNDIDEB+1
ICNDCBIF EQU   ICNDIDEB
ICNUCBAD EQU   ICNDCDEB+8
ICNAPPAD EQU   ICNDCDEB+5
ICNEXSCL EQU   ICNDCDEB+4
ICNDCBAD EQU   ICNDCDEB+1
ICNDEBID EQU   ICNDCDEB
@NM00057 EQU   ISTICNCB+477
ICNERCNT EQU   ISTICNCB+476
ICNZX002 EQU   ISTICNCB+475
ICNZX001 EQU   ISTICNCB+474
ICNZH001 EQU   ISTICNCB+472
ICNZSW3R EQU   ISTICNCB+468
ICNZSW2R EQU   ISTICNCB+464
ICNZSW1R EQU   ISTICNCB+460
ICNZS4VR EQU   ISTICNCB+436
ICNZS4RR EQU   ISTICNCB+432
ICNZS4FC EQU   ISTICNCB+428
ICNZS4BC EQU   ISTICNCB+424
ICNZS3VR EQU   ISTICNCB+400
ICNZS3RR EQU   ISTICNCB+396
ICNZS3FC EQU   ISTICNCB+392
ICNZS3BC EQU   ISTICNCB+388
ICNZS1RC EQU   ICNZS1VR+36
ICNDIEW3 EQU   ICNDIEWA+8
ICNDIEW2 EQU   ICNDIEWA+4
ICNDIEW1 EQU   ICNDIEWA
ICNZS1RR EQU   ISTICNCB+344
ICNZS1FC EQU   ISTICNCB+340
ICNZS1BC EQU   ISTICNCB+336
ICNRSTIC EQU   ICNZD004
ICNRDCOD EQU   ICNRSCCW
ICNZD006 EQU   ISTICNCB+312
ICNZD005 EQU   ISTICNCB+304
ICNWSTIC EQU   ICNZD002
ICNWRCOD EQU   ICNWSCCW
ICNZV008 EQU   ISTICNCB+284
ICNZV007 EQU   ISTICNCB+280
ICNZV006 EQU   ISTICNCB+276
ICNZV005 EQU   ISTICNCB+272
ICNZV004 EQU   ISTICNCB+268
ICNLSTIT EQU   ISTICNCB+264
ICNLSTIF EQU   ISTICNCB+260
ICNZV002 EQU   ISTICNCB+256
ICNZV001 EQU   ISTICNCB+252
ICNZV00A EQU   ISTICNCB+249
ICNBUFF  EQU   ISTICNCB+248
ICNCPQ   EQU   ISTICNCB+244
ICNNICNA EQU   ISTICNCB+240
@NM00056 EQU   ICNFLAG2+2
ICNZF019 EQU   ICNFLAG2+2
ICNZF018 EQU   ICNFLAG2+2
ICNZF017 EQU   ICNFLAG2+2
ICNZF016 EQU   ICNFLAG2+2
ICNZF015 EQU   ICNFLAG2+2
ICNMSG   EQU   ICNFLAG2+1
ICNCLOSE EQU   ICNFLAG2+1
ICNZF014 EQU   ICNFLAG2+1
ICNZF013 EQU   ICNFLAG2+1
ICNZF012 EQU   ICNFLAG2+1
ICNZF011 EQU   ICNFLAG2+1
ICNZF00D EQU   ICNFLAG2+1
ICNZF00B EQU   ICNFLAG2+1
ICNZF00A EQU   ICNFLAG2
ICNZF008 EQU   ICNFLAG2
ICNZF007 EQU   ICNFLAG2
ICNZF005 EQU   ICNFLAG2
ICNZF004 EQU   ICNFLAG2
ICNZF003 EQU   ICNFLAG2
ICNZF002 EQU   ICNFLAG2
ICNZF001 EQU   ICNFLAG2
ICNLOCK  EQU   ISTICNCB+232
ICNLICNA EQU   ISTICNCB+228
ICNRPH   EQU   ISTICNCB+120
ICNZV003 EQU   ISTICNCB+116
ICNLAST  EQU   ISTICNCB+112
ICNLSTBT EQU   ISTICNCB+108
ICNSIOQ  EQU   ISTICNCB+104
ICNFLAG1 EQU   ISTICNCB+103
ICNZSW08 EQU   ICNZSWS
ICNZSW07 EQU   ICNZSWS
ICNZSW06 EQU   ICNZSWS
ICNZSW05 EQU   ICNZSWS
ICNZSW04 EQU   ICNZSWS
ICNZSW03 EQU   ICNZSWS
ICNZSW02 EQU   ICNZSWS
ICNZSW01 EQU   ICNZSWS
ICNZFF69 EQU   ICNFFLAG
@NM00055 EQU   ICNFFLAG
ICNZFF05 EQU   ICNFFLAG
ICNZFF04 EQU   ICNFFLAG
ICNZFF03 EQU   ICNFFLAG
ICNZFF02 EQU   ICNFFLAG
ICNZFF01 EQU   ICNFFLAG
ICNZFF00 EQU   ICNFFLAG
@NM00054 EQU   ICNFLAG
ICNZCRIT EQU   ICNFLAG
ICNSTART EQU   ICNFLAG
ICNSLOW  EQU   ICNFLAG
ICNZF010 EQU   ICNFLAG
ICNZF00F EQU   ICNFLAG
ICNZF00E EQU   ICNFLAG
ICNCONF  EQU   ICNZF006
ICNCKPAB EQU   ICNCKFLD+1
ICNRSV07 EQU   ICNCKFLD
ICNCKBIT EQU   ICNCKFLD
ICNZPAB4 EQU   ISTICNCB+80
ICNZPAB1 EQU   ISTICNCB+64
ICNRSV01 EQU   ISTICNCB+60
@NM00053 EQU   ISTICNCB+56
@NM00052 EQU   ISTICNCB+54
@NM00051 EQU   @NM00050
ICNRRY   EQU   @NM00050
ICNLCLUS EQU   @NM00050
ICNROLN  EQU   @NM00050
ICNRNRY  EQU   @NM00050
ICNLNKMD EQU   ISTICNCB+52
ICNCUUA  EQU   ISTICNCB+48
ICNCB    EQU   ISTICNCB
ZIBLNG1  EQU   ZIBFSM
ZIBCHAIN EQU   ISTZIBUF
FSBRSV01 EQU   FSBFSB+30
FSBRLRSV EQU   FSBRLSTS
FSBCFTX  EQU   FSBRLSTS
FSBICNCB EQU   FSBMSGID
FSBSSOC  EQU   FSBSS2
FSBSSCC  EQU   FSBSS2
FSBSSDC  EQU   FSBSS2
FSBSSEC  EQU   FSBSS2
FSBSSIR  EQU   FSBSS2
FSBSSCR  EQU   FSBSS2
@NM00043 EQU   FSBSS2
@NM00042 EQU   FSBSS1
FSBSSDE  EQU   FSBSS1
FSBSSUS  EQU   FSBSS1
@NM00041 EQU   FSBSS1
FSBSOHI  EQU   FSBERC
FSBLGI   EQU   FSBERC
FSBLMRI  EQU   FSBFBMI
FSBETI   EQU   FSBERC
FSBEMI   EQU   FSBERC
FSBEBI   EQU   FSBERC
FSBECI   EQU   FSBERC
FSBELI   EQU   FSBERC
FSBXLCI  EQU   FSBXCODE
FSBXFINS EQU   FSBXCODE
FSBXNORM EQU   FSBXFSTS
FSBSCODE EQU   FSBSYSRS
FSBSPHSE EQU   FSBSYSRS
FSBSERR  EQU   FSBSYSRS
FSBCMD   EQU   FSBSEQ
FSBDTRCE EQU   FSBFLAGS
FSBASBTU EQU   FSBFLAGS
FSBINPET EQU   FSBFLAGS
FSBNONCB EQU   FSBFLAGS
FSBLBIND EQU   FSBFLAGS
FSBFFIND EQU   FSBFLAGS
FSBACIND EQU   FSBFLAGS
FSBRFIND EQU   FSBFLAGS
FSBGATE  EQU   FSBFSBA
FSBRSV02 EQU   FSBSFLGS
FSBPGBUF EQU   FSBSFLGS
FSBMNSDA EQU   FSBMNRCD
FSBMNOA  EQU   FSBMNRCD
FSBMNDIF EQU   FSBMNRCD
FSBMNEOP EQU   FSBMNRCD
FSBMNDNU EQU   FSBMNRCD
FSBMNATN EQU   FSBMNRCD
FSBMNRVI EQU   FSBMNRCD
FSBMNELI EQU   FSBMNRCD
RHRSVD5  EQU   RH3
RHRSVD4  EQU   RH3
RHLOG    EQU   RH3
RHRSVD3  EQU   RH3
RHRCDIR  EQU   RH3
RHCDIR   EQU   RH3
RHEB     EQU   RH3
RHBB     EQU   RH3
RHPACE   EQU   RH2
RHRSVD2  EQU   RH2
RHINOP   EQU   RHRSVD1
RHBUSY   EQU   RHRETRY
RHEXCEPT EQU   RH2
RHRRN    EQU   RH2
RHPE     EQU   RH2
RHFME    EQU   RH2
RHSENSE  EQU   RH1
RHFORMAT EQU   RH1
RHDIRI   EQU   RH1
RHSCI    EQU   RH1
RHTYPE   EQU   RH1
LCPCLREP EQU   ISTLCPB+44
LCPUBFSB EQU   LCPFLCCW
LCPRSV77 EQU   ISTLCPB+39
LCPLCCWC EQU   ISTLCPB+38
LCPRSV78 EQU   LCPFLG1
LCPTRANS EQU   LCPFLG1
LCPSTLB  EQU   LCPFLG1
LCPREDRV EQU   LCPFLG1
LCPDIRPT EQU   LCPFLG1
LCPSTYPE EQU   ISTLCPB+36
LCPFDB2  EQU   LCPFDBA+1
LCPFDB1  EQU   LCPFDBA
LCPDAF   EQU   LCPCID+2
LCPSAF   EQU   LCPCID
LCPRRCNT EQU   LCPSEQ+1
LCPRRCCT EQU   LCPSEQ
LCPATOP  EQU   LCPFLAG2
LCPFREE  EQU   LCPFLAG2
LCPDSTAT EQU   LCPFLAG2
LCPEXRES EQU   LCPFID0
LCPZRIMM EQU   LCPTLBPI
LCPPRFLG EQU   LCPFLAG2
LCPZMIRC EQU   LCPRUCNT
LCPCHAI2 EQU   LCPCHAIN+1
LCPCHNG  EQU   LCPCHAI1
LCPZRT0B EQU   LCPMNRCD
LCPZRT0A EQU   LCPMNRCD
LCPZRTL9 EQU   LCPZRT09
LCPZRTL8 EQU   LCPZRT08
LCPZRTL7 EQU   LCPZRT07
LCPZRTL6 EQU   LCPZRT06
LCPZRTL5 EQU   LCPZRT05
LCPZRTL4 EQU   LCPZRT04
LCPZRTL3 EQU   LCPZRT03
LCPZRTL2 EQU   LCPZRT02
LCPZRT01 EQU   LCPFLAGS
LCPZRT00 EQU   LCPFLAGS
LCPLNGTH EQU   ISTLCPB+1
LCCWCNT  EQU   ISTLCCW+2
LCCWACI  EQU   LCCWFLAG
LCCWRFI  EQU   LCCWFLAG
LCCWPER  EQU   LCCWLSI
LCCWNTVC EQU   LCCWFLAG
LCCWCKPT EQU   LCCWFLAG
LCCWCC   EQU   LCCWFLAG
LCCWCD   EQU   LCCWFLAG
LCCWTYPE EQU   LCCWCTL
LCCWMODE EQU   LCCWCTL
LCCWSOP  EQU   LCCWRWOP
@NM00040 EQU   LCCWRWOP
LCCWSD   EQU   LCCWOP
LCCWSI   EQU   LCCWOP
FMCFLRSV EQU   FMCFLGB
FMCFLGA8 EQU   FMCFLGB
FMCCLRPH EQU   FMCVS1+45
FMCRSV0X EQU   FMCCVFLG
FMCVYRPH EQU   FMCCVFLG
FMCZV004 EQU   FMCVS1+40
FMCLOCK2 EQU   FMCVS1+36
@NM00039 EQU   FMCZFLG2
FMCZF027 EQU   FMCZFLG2
FMCZF026 EQU   FMCZFLG2
FMCSEQ1B EQU   FMCSEQ1
FMCSEQ1T EQU   FMCSEQ1
FMCZX006 EQU   FMCVS1+33
FMCZX005 EQU   FMCVS1+32
FMCZX004 EQU   FMCVS1+31
FMCZX003 EQU   FMCVS1+30
FMCZX002 EQU   FMCVS1+29
FMCZX001 EQU   FMCVS1+28
FMCZV001 EQU   FMCVS1+24
FMCAWATQ EQU   FMCLCPAQ+1
@NM00038 EQU   FMCLCPAQ
FMCLCPB2 EQU   FMCLCPBQ+1
FMCLCPB1 EQU   FMCLCPBQ
FMCASCDQ EQU   FMCSHEAQ+1
@NM00037 EQU   FMCSHEAQ
FMCZH001 EQU   FMCVS1+4
FMCZF025 EQU   FMCZFLAG+3
FMCZF024 EQU   FMCZFLAG+3
FMCZF023 EQU   FMCZFLAG+3
FMCZF022 EQU   FMCZFLAG+3
FMCZF021 EQU   FMCZFLAG+3
FMCZF020 EQU   FMCZFLAG+3
FMCZF019 EQU   FMCZFLAG+3
FMCZF018 EQU   FMCZFLAG+3
FMCZF017 EQU   FMCZFLAG+2
FMCZF016 EQU   FMCZFLAG+2
FMCZF015 EQU   FMCZFLAG+2
FMCZF014 EQU   FMCZFLAG+2
FMCZF013 EQU   FMCZFLAG+2
FMCZF012 EQU   FMCZFLAG+2
FMCZF011 EQU   FMCZFLAG+2
FMCZF010 EQU   FMCZFLAG+2
FMCZF00F EQU   FMCZFLAG+1
FMCZF00E EQU   FMCZFLAG+1
FMCZF00D EQU   FMCZFLAG+1
FMCZF00C EQU   FMCZFLAG+1
FMCZF00B EQU   FMCZFLAG+1
FMCRSV10 EQU   FMCZFLAG+1
FMCZF009 EQU   FMCZFLAG+1
FMCZFD06 EQU   FMCZF006+1
FMCZFC06 EQU   FMCZF006
FMCZFB06 EQU   FMCZF006
FMCZFA06 EQU   FMCZF006
FMCZF005 EQU   FMCZFLAG
FMCZF004 EQU   FMCZFLAG
FMCZF003 EQU   FMCZFLAG
FMCZF002 EQU   FMCZFLAG
FMCFRESA EQU   ISTFMCB+228
FMCSCSQN EQU   FMCSNCTL+2
FMCSCCTL EQU   FMCSNCTL+1
FMCSTCTL EQU   FMCSCFLG
FMCSCCLO EQU   FMCSCFLG
FMCAPRO  EQU   FMCSCFLG
FMCLURO  EQU   FMCSCFLG
FMCOBSAC EQU   FMCSCFLG
FMCIBSAC EQU   FMCSCFLG
FMCFBRE  EQU   ISTFMCB+220
FMCFBXM  EQU   FMCZV002
FMCASEGQ EQU   ISTFMCB+212
FMCRDTPT EQU   ISTFMCB+208
FMCLOCK  EQU   ISTFMCB+204
FMCSEGD  EQU   FMCSSEGQ
FMCRSPLM EQU   ISTFMCB+198
FMCPSTRS EQU   ISTFMCB+196
@NM00036 EQU   FMCRRESP
FMCTSLHA EQU   FMCRRESP
FMCFRRN  EQU   FMCRRESP
FMCFME   EQU   FMCRRESP
FMCFEX   EQU   FMCRRESP
FMCFPE   EQU   FMCRRESP
FMCCTLB  EQU   ISTFMCB+194
FMCBSQNO EQU   FMCCLSEQ+2
FMCTSQNO EQU   FMCCLSEQ
FMCOBPRG EQU   FMCMODEB
FMCIBPRG EQU   FMCMODEB
FMCRESOT EQU   FMCMODEB
FMCRSTSR EQU   FMCMODEB
FMCLUQ   EQU   FMCMODEB
FMCAPQ   EQU   FMCMODEB
FMCCLEAR EQU   FMCMODEB
FMCHOLD  EQU   FMCMODEB
FMCIPSEQ EQU   ISTFMCB+188
FMCLUSTR EQU   ISTFMCB+187
FMCRSV87 EQU   FMCSTAT2
FMCSEQI  EQU   FMCSTAT2
FMCCPIP  EQU   FMCSTAT2
FMCALIPR EQU   FMCSTAT2
FMCIAIO  EQU   FMCSTAT2
FMCZF00A EQU   FMCSTAT2
FMCVPIP  EQU   FMCSTAT2
FMCBHSET EQU   ISTFMCB+185
FMCPRMRC EQU   FMCCLEXT+20
FMCRSV89 EQU   FMCPSTAT
FMCPCLSD EQU   FMCPSTAT
FMCDDOCD EQU   FMCPSTAT
FMCIDVFD EQU   FMCPSTAT
FMCELKST EQU   FMCPSTAT
FMCRSV88 EQU   FMCPSCMD
FMCRDBLK EQU   FMCPSCMD
FMCDSEOC EQU   FMCPSCMD
FMCPURGE EQU   FMCPSCMD
FMCRESTI EQU   FMCPSCMD
FMCCNTCT EQU   FMCPSCMD
FMCINVT  EQU   FMCPSCMD
FMCFLGB7 EQU   FMCFLGCL
FMCFLGB6 EQU   FMCFLGCL
FMCFLGB5 EQU   FMCFLGCL
FMCFLGB4 EQU   FMCFLGCL
FMCFLGB3 EQU   FMCFLGCL
FMCFLGB2 EQU   FMCFLGCL
FMCFLGB1 EQU   FMCFLGCL
FMCFLGB0 EQU   FMCFLGCL
FMCFLGA7 EQU   FMCFLGA
FMCFLGA6 EQU   FMCFLGA
FMCFLGA5 EQU   FMCFLGA
FMCFLGA4 EQU   FMCFLGA
FMCFLGA3 EQU   FMCFLGA
FMCFLGA2 EQU   FMCFLGA
FMCFLGA1 EQU   FMCFLGA
FMCFLGA0 EQU   FMCFLGA
FMCDCLOK EQU   FMCCLEXT+12
FMCRAFM  EQU   FMCCLEXT+8
FMCFBPTR EQU   FMCFBA+1
FMCFBRSV EQU   FMCFBA
FMCRPLPT EQU   FMCRPLA+1
FMCRPLRS EQU   FMCRPLA
FMCPRCLS EQU   FMCCVAL
FMCIBCE  EQU   FMCCVAL
FMCONLY  EQU   FMCOBCE
FMCLAST  EQU   FMCOBCE
FMCMIDLE EQU   FMCOBCE
FMCFIRST EQU   FMCOBCE
FMCCPCNT EQU   FMCPACPC
FMCMPCNT EQU   FMCPACEM
FMCNPCNT EQU   FMCPACEN
FMCNSALU EQU   FMCSSTAT
FMCSDTR  EQU   FMCSSTAT
FMCRVD01 EQU   ISTFMCB+158
FMCISSN  EQU   ISTFMCB+156
FMCSIP   EQU   FMCSIPA
FMCEXLST EQU   ISTFMCB+144
FMCPAB1  EQU   ISTFMCB+64
FMCFASYA EQU   ISTFMCB+60
FMCMODE  EQU   ISTFMCB+52
FMCVWT   EQU   ISTFMCB+44
FMCRPLH  EQU   ISTFMCB+40
FMCBUFNB EQU   FMCCMPS1+2
FMCBUFLM EQU   FMCCMPS1
FMCDEBA  EQU   ISTFMCB+32
@NM00035 EQU   FMCCMDFL
FMCSNA   EQU   FMCCMDFL
FMCVSNA  EQU   FMCCMDFL
FMCCMDR  EQU   FMCCMDFL
@NM00034 EQU   ISTFMCB+30
@NM00033 EQU   FMCSTAT1
FMCLTCLS EQU   FMCSTAT1
FMCHPURG EQU   FMCSTAT1
FMCVSP2  EQU   FMCSTAT1
FMCVSP1  EQU   FMCSTAT
FMCLTEAS EQU   FMCSTAT
FMCZF007 EQU   FMCSTAT
FMCDEDSC EQU   FMCSTAT
FMCDEVOF EQU   FMCSTAT
FMCDAPT  EQU   FMCSTAT
FMCPRMTE EQU   FMCSTAT
FMCPRMTR EQU   FMCSTAT
FMCUSFLD EQU   ISTFMCB+24
FMCFMCBA EQU   ISTFMCB+20
FMCDVTA  EQU   ISTFMCB+12
FMCTSKID EQU   ISTFMCB+8
FMCNXTCB EQU   ISTFMCB+4
FMCLNGTH EQU   ISTFMCB+1
FMCTYPE  EQU   ISTFMCB
PROSRDEF EQU   PROSETM4
PRORSV47 EQU   PROSETM4
PROSCON  EQU   PROSETM4
PRORSV46 EQU   PROSETM3
PROSMONT EQU   PROSETM3
PRORSV45 EQU   PROSETM3
PROSNTO  EQU   PROSETM3
PRORSV44 EQU   PROSETM3
PRORSV43 EQU   PROSETM2
PROSNTFL EQU   PROSETM2
PRORSV42 EQU   PROSETM2
PRORSV41 EQU   PROPROCS
PROMODC  EQU   PROPROC4
PROMODT  EQU   PROPROC4
PROMODM  EQU   PROPROC4
PROMODB  EQU   PROPROC4
PRORSV14 EQU   PROPROC4
PRORSV13 EQU   PROPROC4
PRORSV12 EQU   PROPROC4
PROEIB   EQU   PROPROC4
PRORSV11 EQU   PROPROC3
PROMONT2 EQU   PROPROC3
PROMONIT EQU   PROPROC3
PROSUBLK EQU   PROPROC3
PRONTO   EQU   PROPROC3
PROLGIN  EQU   PROPROC3
PROERPI  EQU   PROPROC3
PRORSV07 EQU   PROPROC3
PROEMLC  EQU   PROPROC2
PRONTFL  EQU   PROPROC2
PRORSV05 EQU   PROPROC2
PRORSV04 EQU   PROPROC2
PROLGOT  EQU   PROPROC2
PROERPO  EQU   PROPROC2
PRORSV03 EQU   PROPROC2
PRORPLC  EQU   PROPROC1
PROCS    EQU   PROPROC1
PROCA    EQU   PROPROC1
PRORESPX EQU   PROPROC1
PRODFASY EQU   PROPROC1
PROXPOPT EQU   PROPROC1
PROTRUNC EQU   PROPROC1
PROASYIP EQU   PROPROC1
ZOBLNG1  EQU   ZOBFSM
ZOBCHAIN EQU   ISTZOBUF
BTUTEXT  EQU   ISTBTU+20
BTUEXTR  EQU   ISTBTU+19
BTURSV02 EQU   BTUSYSTR
BTUPHASE EQU   BTUSYSTR
BTURSV01 EQU   BTUSYSTR
BTUBDU   EQU   ISTBTU+14
BTUPAD   EQU   BTURH+3
BTURH3   EQU   BTURH+2
BTURH2   EQU   BTURH+1
BTURH1   EQU   BTURH
BTUDCF   EQU   BTUBTH+8
BTUZRTSC EQU   BTURQFLG+1
BTUZRT0B EQU   BTURQFLG+1
BTUZRT0A EQU   BTURQFLG+1
BTUZRT09 EQU   BTURQFLG+1
BTUZRT08 EQU   BTURQFLG+1
BTUZRT07 EQU   BTURQFLG
BTUZRT06 EQU   BTURQFLG
BTUZRT05 EQU   BTURQFLG
BTUZRT04 EQU   BTURQFLG
BTUZRT03 EQU   BTURQFLG
BTUZRT02 EQU   BTURQFLG
BTUZRT01 EQU   BTURQFLG
BTUZRT00 EQU   BTURQFLG
BTUSORCE EQU   BTUBTH+4
BTUDEST  EQU   BTUBTH+2
BTUCDF   EQU   BTUFID+1
BTUSCF   EQU   BTUFID+1
BTUPRY   EQU   BTUFID+1
BTUASFL  EQU   BTUFID
BTUPSFL  EQU   BTUFID
BTUMPF   EQU   BTUFID
BTUFIDNO EQU   BTUFID
TH2CMPLI EQU   TH2MPF
TH2RHI   EQU   TH2MPF
THAFI    EQU   THFLGA
THPSI    EQU   THFLGA
THCMPLI  EQU   THMPF
THRHI    EQU   THMPF
LHVDATA  EQU   ISTLH+4
LHFUNCT  EQU   ISTLH+3
@NM00027 EQU   ISTLH+2
BDURSV04 EQU   BDUFLAGS
BDURTOE  EQU   BDUFLAGS
BDUSTPR  EQU   BDUFLAGS
BDURSV03 EQU   BDUFLAGS
BDUALT   EQU   BDUFUNC
BDUNACK  EQU   BDUFUNC
BDUACK   EQU   BDUFUNC
BDUTRPM  EQU   BDUFUNC
BDUFBMI  EQU   BDUFUNC
BDULDGPH EQU   BDUFUNC
BDUHEADP EQU   BDUFUNC
BDUSOH   EQU   BDUCHECK
BDURSV01 EQU   BDUMODIF
BDUMOD0  EQU   BDUMOD1
BDUCOMND EQU   ISTBDU
LSCTLBAD EQU   ISTLSCB+28
LSCFDB2  EQU   LSCFDBA+1
LSCFDB1  EQU   LSCFDBA
LSCLCCW1 EQU   ISTLSCB+12
LSCRRCNT EQU   LSCSEQ+1
LSCRRCCT EQU   LSCSEQ
LSCATOP  EQU   LSCFLGS
LSCFREE  EQU   LSCFLGS
LSCDSTAT EQU   LSCFLGS
LSCEXRES EQU   LSCFLGS
LSCZRIMM EQU   LSCFLGS
LSCRSV01 EQU   LSCFLGS
LSCSMODE EQU   LSCFLGS
LSCZMIRC EQU   LSCRUCNT
LSCCHAI2 EQU   LSCCHAIN+1
LSCCHNG  EQU   LSCCHAI1
LSCZRTSC EQU   LSCZMNRC
LSCZRT0B EQU   LSCZMNRC
LSCZRT0A EQU   LSCZMNRC
LSCZRTL9 EQU   LSCZRT09
LSCZRTL8 EQU   LSCZRT08
LSCZRTL7 EQU   LSCZRT07
LSCZRTL6 EQU   LSCZRT06
LSCZRTL5 EQU   LSCZRT05
LSCZRTL4 EQU   LSCZRT04
LSCZRTL3 EQU   LSCZRT03
LSCZRTL2 EQU   LSCZRT02
LSCZRT01 EQU   LSCREQTG
LSCZRT00 EQU   LSCREQTG
LSCLNGTH EQU   LSC1WORD+1
ATCAOS   EQU   ISTATCVT+1584
ATCPOPAB EQU   ATCAOSM+640
ATCVIOPM EQU   ATCAOSM+636
ATCTPMMI EQU   ATCAOSM+632
ATCTPMPB EQU   ATCAOSM+600
ATCRSV88 EQU   ATCAOSM+596
ATCRPLCT EQU   ATCAOSM+594
ATCCRACT EQU   ATCAOSM+592
ATCSRBCT EQU   ATCAOSM+590
ATCRSV75 EQU   ATCAOSM+589
ATCRSV66 EQU   ATCZFLAG
ATCZF001 EQU   ATCZFLAG
ATCTPCP1 EQU   ATCAOSM+584
ATCTPCP0 EQU   ATCAOSM+580
ATCAICTN EQU   ATCAOSM+576
ATCZR01  EQU   ATCAOSM+572
ATCMPLTA EQU   ATCAOSM+568
ATCASCB  EQU   ATCAOSM+564
ATCAP86  EQU   ATCAOSM+560
ATCAP85  EQU   ATCAOSM+556
ATCAP84  EQU   ATCAOSM+552
ATCAP83  EQU   ATCAOSM+548
ATCAP82  EQU   ATCAOSM+544
ATCAP69  EQU   ATCAOSM+540
ATCAP66  EQU   ATCAOSM+536
ATCAP62  EQU   ATCAOSM+532
ATCAPC59 EQU   ATCAOSM+528
ATCAP56  EQU   ATCAOSM+524
ATCAP55  EQU   ATCAOSM+520
ATCRCFY0 EQU   ATCAOSM+516
ATCAP41  EQU   ATCAOSM+512
ATCAPC25 EQU   ATCAOSM+508
ATCAP23  EQU   ATCAOSM+504
ATCTPSPB EQU   ATCAOSM+472
ATCTRMPB EQU   ATCAOSM+440
ATCAPBE  EQU   ATCAOSM+436
ATCPSTA  EQU   ATCAOSM+432
ATCSMABF EQU   ATCAOSM+428
ATCSMAPR EQU   ATCAOSM+424
ATCTPWQA EQU   ATCAOSM+420
ATCSMAID EQU   ATCAOSM+416
ATCSMARA EQU   ATCAOSM+412
ATCCACXA EQU   ATCAOSM+408
ATCZLAAB EQU   ATCAOSM+404
ATCATA10 EQU   ATCAOSM+400
ATCHLTCB EQU   ATCAOSM+396
@NM00026 EQU   ATCVTFLG
ATCVTACT EQU   ATCVTFLG
ATCRPT40 EQU   ATCAOSM+388
ATCRPT39 EQU   ATCAOSM+384
ATCRPT38 EQU   ATCAOSM+380
ATCRPT37 EQU   ATCAOSM+376
ATCRPT36 EQU   ATCAOSM+372
ATCRPT35 EQU   ATCAOSM+368
ATCRPT34 EQU   ATCAOSM+364
ATCRPT33 EQU   ATCAOSM+360
ATCRPT32 EQU   ATCAOSM+356
ATCRPT31 EQU   ATCAOSM+352
ATCRPT30 EQU   ATCAOSM+348
ATCRPT29 EQU   ATCAOSM+344
ATCRPT28 EQU   ATCAOSM+340
ATCRPT27 EQU   ATCAOSM+336
ATCRPT26 EQU   ATCAOSM+332
ATCRPT25 EQU   ATCAOSM+328
ATCRPT24 EQU   ATCAOSM+324
ATCRPT23 EQU   ATCAOSM+320
ATCRPT22 EQU   ATCAOSM+316
ATCRPT21 EQU   ATCAOSM+312
ATCRPT20 EQU   ATCAOSM+308
ATCRPT19 EQU   ATCAOSM+304
ATCRPLAC EQU   ATCRPLCN+2
ATCRPLRC EQU   ATCRPLCN
ATCCRPLQ EQU   ATCCRPL
ATCSRBAC EQU   ATCSRBCN+2
ATCSRBRC EQU   ATCSRBCN
ATCSRBQ  EQU   ATCSRB
ATCCRAAC EQU   ATCCRACN+2
ATCCRARC EQU   ATCCRACN
ATCCRAQ  EQU   ATCCRA
ATCRPT12 EQU   ATCAOSM+276
ATCDMAPP EQU   ATCAOSM+272
ATCAP38  EQU   ATCAOSM+268
ATCZDFJ0 EQU   ATCAOSM+260
ATCAP51  EQU   ATCAOSM+256
ATCZPAB2 EQU   ATCAOSM+224
ATCZPAB1 EQU   ATCAOSM+192
ATCZLFVT EQU   ATCAOSM+188
ATCZLPVT EQU   ATCAOSM+184
ATCZDVTX EQU   ATCAOSM+180
ATCZDVTA EQU   ATCAOSM+176
ATCZDVT9 EQU   ATCAOSM+172
ATCZDVT8 EQU   ATCAOSM+168
ATCZDVT7 EQU   ATCAOSM+164
ATCRSV56 EQU   ATCDAPVT+22
ATCDAPDG EQU   ATCDAPVT+20
ATCDXCEA EQU   ATCDAPVT+16
ATCDCEA  EQU   ATCDAPVT+12
ATCDPCIA EQU   ATCDAPVT+8
ATCDSIOA EQU   ATCDAPVT+4
ATCDEOEA EQU   ATCDAPVT
ATCZLAEA EQU   ATCLDAPP+16
ATCZLCEA EQU   ATCLDAPP+12
ATCRSV17 EQU   ATCLDAPP+8
ATCSMFRR EQU   ATCLDAPP+4
ATCCDTID EQU   ATCLDAPP
ATCZAEA  EQU   ATCICAPP+16
ATCZCEA  EQU   ATCICAPP+12
ATCCDTCB EQU   ATCICAPP+8
ATCZSIOA EQU   ATCICAPP+4
ATCCDRPH EQU   ATCICAPP
ATCAP65  EQU   ATCAOSM+96
ATCZDVT6 EQU   ATCAOSM+92
ATCZDVT4 EQU   ATCAOSM+88
ATCZDVT3 EQU   ATCAOSM+84
ATCZDVT1 EQU   ATCAOSM+80
ATCICNCB EQU   ATCAOSM+76
ATCAP64  EQU   ATCAOSM+64
ATCAP63  EQU   ATCAOSM+60
ATCAP61  EQU   ATCAOSM+56
ATCAP58  EQU   ATCAOSM+52
ATCAP57  EQU   ATCAOSM+48
ATCAP54  EQU   ATCAOSM+44
ATCAP53  EQU   ATCAOSM+40
ATCAP52  EQU   ATCAOSM+36
ATCAP31  EQU   ATCAOSM+24
ATCAP12  EQU   ATCAOSM+20
ATCAP11  EQU   ATCAOSM+16
ATCCMTCB EQU   ATCAOSM+12
ATCPRPH  EQU   ATCAOSM+8
ATCGSRBF EQU   ATCGSRBG
ATCSRBRT EQU   ATCAOSM
@NM00025 EQU   @NM00024
ATCVTMAB EQU   @NM00024
@NM00023 EQU   ATCVTBAM
ATCVDLOK EQU   ISTATCVT+904
ATCVFPAB EQU   ISTATCVT+872
ATCVDPAB EQU   ISTATCVT+840
ATCIOECB EQU   ISTATCVT+836
ATCINCW3 EQU   ISTATCVT+832
ATCMODTB EQU   ISTATCVT+828
ATCUSSPT EQU   ISTATCVT+824
ATCSRTAB EQU   ISTATCVT+820
@NM00022 EQU   ISTATCVT+819
@NM00021 EQU   ATCSTAT2
ATCTRSMS EQU   ATCSTAT2
ATCTRLOK EQU   ATCSTAT2
ATCTRPSS EQU   ATCSTAT2
ATCTRESC EQU   ATCSTAT2
ATCTRAPI EQU   ATCSTAT2
ATCNMCTR EQU   ISTATCVT+816
ATCSEC51 EQU   ATCSECST
ATCSEC40 EQU   ATCSIPD+8
ATCSEC30 EQU   ATCSIPD+4
ATCSEC21 EQU   ATCSIPD
ATCSEC10 EQU   ATCSOPD+4
ATCSEC01 EQU   ATCSOPD
ATCPOIA  EQU   ATCRNO+1
@NM00020 EQU   ATCRNO
ATCPODVT EQU   ISTATCVT+784
ATCS49XL EQU   ISTATCVT+780
ATCS49XI EQU   ISTATCVT+776
ATCLCLCT EQU   ATCVLCNT+2
ATCRNCNT EQU   ATCVLCNT
ATCCFEAD EQU   ISTATCVT+768
ATCPTR00 EQU   ISTATCVT+736
ATCRSV10 EQU   ISTATCVT+704
ATCTACB  EQU   ISTATCVT+700
ATCVTINM EQU   ISTATCVT+696
ATCTCLIM EQU   ISTATCVT+692
ATCTCLOM EQU   ISTATCVT+688
ATCVTIPB EQU   ISTATCVT+656
ATCTCIPB EQU   ISTATCVT+624
ATCTIPAB EQU   ISTATCVT+592
ATCOCCCB EQU   ISTATCVT+588
ATCOCCOB EQU   ISTATCVT+584
ATCCDLAD EQU   ISTATCVT+580
ATCCCLAD EQU   ISTATCVT+576
ATCDLRPB EQU   ISTATCVT+544
ATCPGPAB EQU   ISTATCVT+512
ATCVPAB1 EQU   ISTATCVT+480
ATCRSV97 EQU   ISTATCVT+476
ATCRDTLK EQU   ISTATCVT+472
ATCVOCLK EQU   ISTATCVT+468
ATCCDFDN EQU   ISTATCVT+464
ATCCDFIN EQU   ISTATCVT+460
ATCDVTLK EQU   ISTATCVT+456
ATCAP36  EQU   ISTATCVT+452
ATCAP35  EQU   ISTATCVT+448
ATCAP33  EQU   ISTATCVT+444
ATCRSV99 EQU   ISTATCVT+440
ATCONFIG EQU   ISTATCVT+432
ATCNODDS EQU   ISTATCVT+428
ATCNODEL EQU   ISTATCVT+420
ATCRSV69 EQU   ISTATCVT+416
ATCAPCR5 EQU   ISTATCVT+412
ATCLDECB EQU   ISTATCVT+408
ATCLDNCS EQU   ISTATCVT+404
ATCCDPTR EQU   ISTATCVT+400
ATCADEL  EQU   ISTATCVT+396
ATCTODVT EQU   ISTATCVT+392
ATCDEBCH EQU   ISTATCVT+388
ATCHBSIZ EQU   ATCHPGM+2
ATCHBFNO EQU   ATCHPGM
ATCCRME  EQU   ISTATCVT+380
ATCRVCHS EQU   ISTATCVT+372
ATCECTLP EQU   ISTATCVT+368
ATCZDVTB EQU   ISTATCVT+364
ATCECPRT EQU   ISTATCVT+360
ATCVTLOD EQU   ISTATCVT+356
ATCTRPAB EQU   ISTATCVT+352
ATCMSGM  EQU   ISTATCVT+348
ATCMSGP  EQU   ISTATCVT+344
ATCEPT   EQU   ISTATCVT+340
ATCDVT   EQU   ISTATCVT+336
ATCTRCPT EQU   ISTATCVT+332
ATCDVLOD EQU   ISTATCVT+328
ATCALERT EQU   ISTATCVT+324
ATCEPA   EQU   ISTATCVT+320
ATCSAF   EQU   ISTATCVT+318
ATCXRANG EQU   ISTATCVT+317
ATCLAST  EQU   ATCSHRFG
ATCSHRTN EQU   ISTATCVT+308
ATCUEP   EQU   ISTATCVT+304
ATCOCRT  EQU   ISTATCVT+300
ATCCSMA  EQU   ATCCSMR
ATCESC02 EQU   ISTATCVT+292
ATCESC01 EQU   ISTATCVT+288
ATCCDFND EQU   ISTATCVT+284
ATCCDDEL EQU   ISTATCVT+280
ATCCDADD EQU   ISTATCVT+276
ATCMNT   EQU   ISTATCVT+272
ATCRSV16 EQU   ISTATCVT+270
ATCMAXID EQU   ISTATCVT+269
ATCMSGSP EQU   ATCCOM+268
ATCCIDM  EQU   ATCCOM+266
ATCACTRM EQU   ATCCOM+264
ATCNERAP EQU   ATCCOM+260
ATCNESAL EQU   ATCCOM+256
ATCRCC65 EQU   ATCCOM+252
ATCRCC26 EQU   ATCCOM+248
ATCRCC63 EQU   ATCCOM+244
ATCRSV11 EQU   ATCCOM+242
ATCAPOST EQU   ATCCOM+236
ATCNERFN EQU   ATCCOM+232
ATCNERNE EQU   ATCCOM+228
ATCNERCV EQU   ATCCOM+224
ATCNERST EQU   ATCCOM+220
ATCDCC61 EQU   ATCCOM+216
ATCDCC60 EQU   ATCCOM+212
ATCSRTDF EQU   ATCCOM+208
ATCSRTAD EQU   ATCCOM+204
ATCFIRA  EQU   ATCCOM+200
ATCSMBQ  EQU   ATCCOM+196
ATCSMRC  EQU   ATCCOM+192
ATCSMQU  EQU   ATCCOM+184
ATCSMRQ  EQU   ATCCOM+180
ATCACDA  EQU   ATCCOM+176
ATCSTMA  EQU   ATCCOM+172
ATCFRSTR EQU   ATCCOM+168
ATCGTSTR EQU   ATCCOM+164
ATCREADA EQU   ATCCOM+160
ATCALOAD EQU   ATCCOM+156
ATCBLDLA EQU   ATCCOM+152
ATCFBRPH EQU   ATCCOM+148
ATCBFTRC EQU   ATCCOM+144
ATCTPBUF EQU   ATCTHTRC
ATCREMOV EQU   ATCCOM+136
ATCADD   EQU   ATCCOM+132
ATCDVTPT EQU   ATCCOM+124
ATCFEPT  EQU   ATCCOM+120
ATCFDVT  EQU   ATCCOM+116
ATCCONFT EQU   ATCCOM+112
ATCPTCHA EQU   ATCCOM+108
ATCAUTHA EQU   ATCCOM+104
ATCACCTA EQU   ATCCOM+100
ATCRDTH  EQU   ATCCOM+96
ATCFRSCH EQU   ATCCOM+92
ATCFSB   EQU   ATCCOM+88
ATCHLTMS EQU   ATCCOM+84
ATCECPRM EQU   ATCCOM+80
ATCECNET EQU   ATCCOM+76
ATCECOPC EQU   ATCCOM+72
ATCVPARM EQU   ATCCOM+68
ATCECVRQ EQU   ATCCOM+64
ATCECSES EQU   ATCCOM+60
ATCOCHA  EQU   ATCCOM+56
ATCDSPLQ EQU   ATCCOM+52
ATCECDSP EQU   ATCCOM+48
ATCVARYQ EQU   ATCCOM+44
ATCECVRY EQU   ATCCOM+40
ATCHALTQ EQU   ATCCOM+36
ATCECHLT EQU   ATCCOM+32
ATCMODQ  EQU   ATCCOM+28
ATCECMOD EQU   ATCCOM+24
ATCASCHD EQU   ATCCOM+20
ATCSRT   EQU   ATCCOM+16
ATCRDT   EQU   ATCCOM+12
ATCDCFRR EQU   ATCCOM+8
ATCAPI   EQU   ATCCOM+4
ATCRSV04 EQU   ATCSTAT4
ATCVTTRC EQU   ATCSTAT4
ATCNCSD  EQU   ATCSTAT4
ATCMTST  EQU   ATCSTAT4
ATCTPRT  EQU   ATCSTAT4
ATCPRTAT EQU   ATCSTAT4
@NM00019 EQU   ATCPOFLG
ATCPOUNS EQU   ATCPOFLG
ATCHSDMF EQU   ATCSTFLG
@NM00018 EQU   ATCSTAT1
ATCMDHLT EQU   ATCSTAT1
ATCINHLT EQU   ATCSTAT1
ATCNETSL EQU   ATCSTAT1
ATCQKHLT EQU   ATCSTAT1
ATCSNHLT EQU   ATCSTAT1
ATCACTIV EQU   ATCSTAT1
ATCSTART EQU   ATCSTAT1
RPHNEXPO EQU   ISTRPH+104
RPHSAV16 EQU   RPHWORK+60
RPHSAV15 EQU   RPHWORK+56
RPHSAV14 EQU   RPHWORK+52
RPHSAV13 EQU   RPHWORK+48
RPHSAV12 EQU   RPHWORK+44
RPHSAV11 EQU   RPHWORK+40
RPHSAV10 EQU   RPHWORK+36
RPHSAVE9 EQU   RPHWORK+32
RPHSAVE8 EQU   RPHWORK+28
RPHSAVE7 EQU   RPHWORK+24
RPHSAVE6 EQU   RPHWORK+20
RPHSAVE5 EQU   RPHWORK+16
RPHSAVE4 EQU   RPHWORK+12
RPHSAVE3 EQU   RPHWORK+8
RPHSAVE2 EQU   RPHWORK+4
RPHSHALF EQU   RPHSAVE1+2
RPHSBIT8 EQU   RPHSBITS
RPHSBIT7 EQU   RPHSBITS
RPHSBIT6 EQU   RPHSBITS
RPHSBIT5 EQU   RPHSBITS
RPHSBIT4 EQU   RPHSBITS
RPHSBIT3 EQU   RPHSBITS
RPHSBIT2 EQU   RPHSBITS
RPHSBIT1 EQU   RPHSBITS
RPHSBYTE EQU   RPHSAVE1
RPHPABFG EQU   RPHPABQA
RPHSRP34 EQU   RPHSRPRM+2
RPHSRP12 EQU   RPHSRPRM
RPHWEGT  EQU   RPHCSPA
RPHRESUM EQU   RPHRESMA+1
RPHRSV01 EQU   RPHWPFLG
RPHPURGE EQU   RPHWPFLG
RPHPT    EQU   RPHWPFLG
RPHRSKEY EQU   RPHWPFLG
RPHDVTA  EQU   ISTRPH+12
RPHTIK   EQU   RPHTSKID+3
@NM00017 EQU   RPHTSKID
RPHRPHAP EQU   RPHRPHA+1
@NM00016 EQU   RPHRPHA
RPHGATE  EQU   RPHRPHA
@NM00015 EQU   RPHFLGB
RPHRLCRA EQU   RPHFLGB
RPHNRSAV EQU   RPHFLGB
RPHPGCMP EQU   RPHFLGB
RPHFBAPS EQU   RPHFLGB
RPHBSSP  EQU   RPHFLGB
RPHLOCK  EQU   RPHFLGB
RPHFNFLG EQU   RPHFSTLC
RPHMLTCP EQU   RPHFLAGS
RPHSMCLR EQU   RPHFLAGS
RPHSMTYP EQU   RPHFLAGS
RPHSMQ   EQU   RPHFLAGS
RPHAUTEX EQU   RPHAPTYP
RPHSPGIN EQU   RPHFLAGS
RPHOGIND EQU   RPHFLAGS
RPHLNGTH EQU   RPHCNTL+1
RPHTYPE  EQU   RPHCNTL
DYPPAB   EQU   ISTDYPAB+16
DYPRSV01 EQU   ISTDYPAB+12
DYPTSKID EQU   ISTDYPAB+8
DYPCHAIN EQU   ISTDYPAB+4
DYPFLGS  EQU   ISTDYPAB+2
DYPLNGTH EQU   ISTDYPAB+1
DYPTYPE  EQU   ISTDYPAB
LOKXCL   EQU   @NM00013
LOKPRY   EQU   @NM00013
@NM00014 EQU   @NM00013
@NM00012 EQU   LOKCHNG
LOKCT    EQU   ISTLOK
PABRPHA  EQU   PABRPHFG+1
PABNODQ  EQU   PABFLAGS
PABINHBT EQU   PABFLAGS
PABERLOK EQU   PABERRLK
PABSSN   EQU   PABFLAGS
PABDYNAM EQU   PABFLAGS
PABNORPR EQU   PABFLAGS
PABPRIOR EQU   PABFLAGS
PABAPYP  EQU   PABFLAGS
PABOFFST EQU   ISTPAB+8
PABRSV02 EQU   PABCHAIN
PABDELAY EQU   PABCHAIN
PABRUNNG EQU   PABCHAIN
PABRESET EQU   PABCHAIN
PABUNCON EQU   PABCHAIN
PABCDP   EQU   PABCHAIN
PABRESCH EQU   PABCHAIN
PABCHNG  EQU   PABCHAIN
PABWEQP  EQU   PABWEQA+1
PABRSV01 EQU   PABWEQA
PABWEQG  EQU   PABWEQA
ZPSZDFQR EQU   ISTZPSVT+80
ZPSZDFPR EQU   ISTZPSVT+76
ZPSZDFXR EQU   ISTZPSVT+72
ZPSZWRD5 EQU   ISTZPSVT+68
ZPSZWRD4 EQU   ISTZPSVT+64
ZPSZDFMB EQU   ISTZPSVT+60
ZPSZDFMF EQU   ISTZPSVT+56
ZPSZDFNB EQU   ISTZPSVT+52
@NM00011 EQU   ISTZPSVT+48
ZPSZDFF0 EQU   ISTZPSVT+44
ZPSZTRTT EQU   ISTZPSVT+40
ZPSZBFOB EQU   ISTZPSVT+36
ZPSZBFMB EQU   ISTZPSVT+32
ZPSZBFY0 EQU   ISTZPSVT+24
ZPSZDFI0 EQU   ISTZPSVT+20
ZPSZDFH0 EQU   ISTZPSVT+12
ZPSZDFD0 EQU   ISTZPSVT+8
NCBRSV01 EQU   ISTNCB+46
NCBDEVCH EQU   ISTNCB+36
NCBFMCBP EQU   ISTNCB+32
NCBLTRC  EQU   ISTNCB+30
NCBRVPT1 EQU   ISTNCB+28
NCBNMLLN EQU   NCBFLAGS+3
@NM00010 EQU   NCBFLAG1
NCBFORCE EQU   NCBFLAG1
NCBTTF   EQU   NCBFLAG1
NCBRSYNC EQU   NCBFLAG1
NCBRSTRT EQU   NCBFLAG1
NCBSNAI  EQU   NCBFLAG1
NCBFLTIO EQU   NCBFTRIO
NCBCSTAT EQU   NCBFLAGS
NCBNCSL  EQU   ISTNCB+22
NCBFMCBA EQU   ISTNCB+16
NCBTSKID EQU   ISTNCB+8
NCBRDTE  EQU   ISTNCB+4
NCBLNGTH EQU   ISTNCB+1
NCBTYPE  EQU   ISTNCB
DEVRSV03 EQU   ISTDEVCH+5
DEVPHYSA EQU   ISTDEVCH+4
DEVCSLPN EQU   DEVCHAR3
DEVCSTCL EQU   DEVCHAR3
DEVCCHEK EQU   DEVCHAR3
DEVCATTN EQU   DEVCHAR3
DEVCSWL  EQU   DEVFCCTL
DEVCRVB  EQU   DEVFCCTL
DEVCSSL  EQU   DEVFCCTL
DEVCBSC  EQU   DEVFCCTL
DEVMCODE EQU   ISTDEVCH+2
DEVCHAR2 EQU   DEVTCODE
DEVRSV01 EQU   DEVCHAR
DEVCCTL  EQU   DEVCHAR
DEVNNSPT EQU   DEVCHAR
DEVSPS   EQU   DEVCHAR
DEVSUBND EQU   DEVCHAR
DEVCONVR EQU   DEVCHAR
DEVOTPUT EQU   DEVCHAR
DEVINPUT EQU   DEVCHAR
@NM00009 EQU   SRBSECT+40
@NM00008 EQU   SRBSECT+38
SRBPRIOR EQU   SRBSECT+37
SRBPKF   EQU   SRBSECT+36
SRBSAVE  EQU   SRBSECT+32
SRBPARM  EQU   SRBSECT+28
SRBRMTR  EQU   SRBSECT+24
SRBEP    EQU   SRBSECT+20
SRBPTCB  EQU   SRBFLC+4
SRBPASID EQU   SRBFLC+2
SRBCPAFF EQU   SRBFLC
SRBASCB  EQU   SRBSECT+8
SRBFLNK  EQU   SRBSECT+4
SRBID    EQU   SRBSECT
IOSEND   EQU   IOSB+108
IOSSKR   EQU   IOSEEKA+7
IOSSKH2  EQU   IOSSKHH+1
IOSSKH1  EQU   IOSSKHH
IOSSKCC  EQU   IOSCCHH
IOSSKBB  EQU   IOSEEKA+1
IOSSKM   EQU   IOSEEKA
IOSEEK   EQU   IOSB+92
IOSMDM   EQU   IOSB+91
IOSMDB   EQU   IOSB+90
IOSCKEY7 EQU   IOSCKEY
IOSCKEY6 EQU   IOSCKEY
IOSCKEY5 EQU   IOSCKEY
IOSCKEY4 EQU   IOSCKEY
@NM00004 EQU   IOSCKEY
IOSFMSK  EQU   IOSB+88
IOSCUDEV EQU   IOSPATH+1
@NM00003 EQU   IOSCHN
IOSPATH3 EQU   IOSCHN
IOSPATH2 EQU   IOSCHN
IOSEXP   EQU   IOSCHN
IOSGDP   EQU   IOSCHN
IOSAFF   EQU   IOSB+85
IOSRSS1B EQU   IOSB+84
IOSDSID  EQU   IOSB+80
IOSVST   EQU   IOSB+76
IOSRST   EQU   IOSB+72
IOSDIE   EQU   IOSB+68
IOSABN   EQU   IOSB+64
IOSNRM   EQU   IOSB+60
IOSPCI   EQU   IOSB+56
IOSERP   EQU   IOSB+52
IOSPCHN  EQU   IOSB+48
IOSSNS   EQU   IOSB+42
IOSAPMSK EQU   IOSB+40
IOSRES4A EQU   IOSB+36
IOSUSE   EQU   IOSB+32
IOSSRB   EQU   IOSB+28
IOSCSWRC EQU   IOSCSW+5
IOSTSB   EQU   IOSTATUS+1
IOSTSA   EQU   IOSTATUS
IOSCSWCA EQU   IOSCSW
IOSCC    EQU   @NM00002
IOSUCB   EQU   IOSB+16
IOSOPT2X EQU   IOSOPT2
IOSHTP   EQU   IOSOPT2
IOSRELSE EQU   IOSOPT
IOSAPR   EQU   IOSOPT
IOSTSLL  EQU   IOSOPT
IOSNERP  EQU   IOSOPT
IOSPSLL  EQU   IOSOPT
IOSQISCE EQU   IOSOPT
IOSDEP   EQU   IOSOPT
IOSBYP   EQU   IOSOPT
IOSCOD   EQU   IOSB+13
IOSPKY7  EQU   IOSPKEY
IOSPGDPX EQU   IOSPKEY
IOSIDR   EQU   IOSPKEY
IOSLCL   EQU   IOSPKEY
@NM00001 EQU   IOSPKEY
IOSPGAD  EQU   IOSB+8
IOSASID  EQU   IOSB+6
IOSPRLVL EQU   IOSB+5
IOSDVRID EQU   IOSB+4
IOSPROC  EQU   IOSB+3
IOSFLC7  EQU   IOSFLC
IOSFLC6  EQU   IOSFLC
IOSRWAIT EQU   IOSFLC
IOSTP    EQU   IOSFLC
IOSCC3WE EQU   IOSFLC
IOSVERIF EQU   IOSDVALT
IOSDVMNT EQU   IOSFLC
IOSLOG   EQU   IOSFLB
IOSBDCST EQU   IOSFLB
IOSMSG   EQU   IOSFLB
IOSFLB4  EQU   IOSFLB
IOSFLB3  EQU   IOSFLB
IOSFLB2  EQU   IOSFLB
IOSSDR   EQU   IOSFLB
IOSDIESE EQU   IOSFLB
IOSIOSB  EQU   IOSFLA
IOSDOM   EQU   IOSFLA
IOSEX    EQU   IOSFLA
IOSSMDB  EQU   IOSFLA
IOSSMDA  EQU   IOSFLA
IOSERR   EQU   IOSFLA
IOSCCHN  EQU   IOSACHN
IOSDCHN  EQU   IOSACHN
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS
@RC00877 EQU   @RC00875
@RC00902 EQU   @RC00901
@RC01039 EQU   @RC00947
@ENDDATA EQU   *
         END   ISTZBFIF,(C'PLS0515',0701,76329)
