//TS02RACF JOB (TS02,TS,0,0,0),'RACF TLMS MODS',
//       NOTIFY=TS02,
//       PASSWORD=,
//       TIME=(,5),MSGLEVEL=1,MSGCLASS=A
/*JOBPARM FORMS=LOC1,Q=TSO
//S1 EXEC  PGM=TSPRTPDS
//SYSPRINT DD SYSOUT=F,DCB=BLKSIZE=133
//SYSLIB   DD DSN=TS02.TLMSLIB,DISP=SHR
