SVTM     TITLE 'ISTOCCFB - FMCB BUILDER                                *
                        '
         ISEQ  73,80                                       /*@D31KKMP*/
ISTOCCFB CSECT ,                                                   0002
@MAINENT DS    0H                                                  0002
         USING *,@15                                               0002
         B     @PROLOG                                             0002
         DC    AL1(16)                                             0002
         DC    C'ISTOCCFB  78.081'                                 0002
         DROP  @15
@PROLOG  STM   @14,@12,12(@13)                                     0002
         BALR  @11,0                                               0002
@PSTART  LA    @12,4095(,@11)                                      0002
         USING @PSTART,@11                                         0002
         USING @PSTART+4095,@12                                    0002
*/*********************************************************************
*/*       INITIALIZE                                                  *
*/*               1. COMPONENT RECOVERY RECORD                        *
*/*               2. PTR TO NEXT AVAILABLE REG. SAVE AREA             *
*/*               3. INTERNAL CODES, & WORK AREAS                     *
*/*********************************************************************
* DO;                                                              0449
*/***  CRRMAINT  PROCNM(ISTOCCFB)COMP(OC)FUNC(SUB)  ***/           0450
* DCL CMZK0010 PTR(31) REG(1);                                     0450
* RFY (CMZK0010) RSTD;                                             0451
*                                                                  0451
*/* ATBUILD (ISTRPH,ISTCRA,ISTPFCRR,ISTOCCRR)  */                  0452
* RFY ISTLCCW ;                                                    0452
* RFY ISTLCPB ;                                                    0453
* RFY ISTZSAVE;                                                    0454
* RFY ISTPFCRR;                                                    0455
* RFY ISTCFCRR;                                                    0456
* RFY ISTZCRR ;                                                    0457
* RFY ISTASCRR;                                                    0458
* RFY ISTAPCRR;                                                    0459
* RFY ISTCRA  ;                                                    0460
* RFY ISTCNSTA;                                                    0461
* RFY ISTOCCRR;                                                    0462
*/* END OF ATBUILD */                                              0463
* /*** SET ENTERED BIT FOR THIS PROCEDURE ***/                     0463
*CMZK0010->RPHCRR->CRACRR->NOCCFB = '1'B;                          0463
         L     @10,RPHCRR(,CMZK0010)                               0463
         L     @10,CRACRR(,@10)                                    0463
         OI    NOCCFB(@10),B'00000010'                             0463
* /*** CLEAR AND SET CURRENT PROCEDURE BIT ***/                    0464
*CMZK0010->RPHCRR->CRACRR->OCCCRT = '0'B;                          0464
         XC    OCCCRT+1(2,@10),OCCCRT+1(@10)                       0464
         MVI   OCCCRT(@10),B'00000000'                             0464
*CMZK0010->RPHCRR->CRACRR->COCCFB = '1'B;                          0465
         OI    COCCFB(@10),B'00000010'                             0465
* END;                                                             0466
*CREG13 = CREG13 + OCWSLEN;  /* PTR NXT O/C SAVE AREA */           0467
         SLR   @10,@10                                             0467
         IC    @10,OCWSLEN(,COCWPTR)                               0467
         ALR   CREG13,@10                                          0467
*CINTCODE = 0;  /* INIT INTRNL CODE = SUCCESSFUL */                0468
         SLR   CINTCODE,CINTCODE                                   0468
*OCWCID = '00000000'X;   /* CLEAR CID WORK AREA */                 0469
         SLR   @10,@10                                             0469
         ST    @10,OCWCID(,COCWPTR)                                0469
*OCWSCPAD = OCWSCPAD&&OCWSCPAD;  /* INIT SCRTCH PAD FOR W.A. */    0470
         XC    OCWSCPAD(28,COCWPTR),OCWSCPAD(COCWPTR)              0470
*/*********************************************************************
*/*  GET CORE FOR & INITIALIZE THE FMCB                               *
*/*  IF IT IS THE FIRST OPEN FOR THE DESTINATION                      *
*/*    THEN GET CORE FOR THE APPROPRIATE NCB TYPE                     *
*/*         AND INITIALIZE THE NCB TYPE DEPENDENT FIELDS              *
*/*    ELSE DO NOT BUILD AN NCB SINCE ONE ALREADT EXISTS              *
*/*  INITIALIZE DATA COMMON TO ALL NCB'S & CHAIN THE FMCB-NCB PAIR    *
*/*********************************************************************
* DO;                                                              0471
*/***  CRRMAINT  PROCNM(ISTOCCFB)COMP(OC)FUNC(SUB)  ***/           0472
* DCL CMZK0012 PTR(31) REG(1);                                     0472
* RFY (CMZK0012) RSTD;                                             0473
*                                                                  0473
*/* ATBUILD (ISTRPH,ISTCRA,ISTPFCRR,ISTOCCRR)  */                  0474
*/* END OF ATBUILD */                                              0474
* /*** SET ENTERED BIT FOR THIS PROCEDURE ***/                     0474
*CMZK0012->RPHCRR->CRACRR->NOCCFB = '1'B;                          0474
         L     @10,RPHCRR(,CMZK0012)                               0474
         L     @10,CRACRR(,@10)                                    0474
         OI    NOCCFB(@10),B'00000010'                             0474
* /*** CLEAR AND SET CURRENT PROCEDURE BIT ***/                    0475
*CMZK0012->RPHCRR->CRACRR->OCCCRT = '0'B;                          0475
         XC    OCCCRT+1(2,@10),OCCCRT+1(@10)                       0475
         MVI   OCCCRT(@10),B'00000000'                             0475
*CMZK0012->RPHCRR->CRACRR->COCCFB = '1'B;                          0476
         OI    COCCFB(@10),B'00000010'                             0476
* END;                                                             0477
*  /*SEGMENT(DOFMCB)REQUEST*/DO;GOTO DOFMCB;DOFMCB#:END;  /* INIT FMCB
*ORE */                                                            0478
         B     DOFMCB                                              0479
DOFMCB#  DS    0H                                                  0481
*IF OCWNCB = 0   /* IF FIRST FOR DEST */                           0481
*  THEN DO;                                                        0481
         ICM   @10,15,OCWNCB(COCWPTR)                              0481
         BNZ   @RF00481                                            0481
*          /*SEGMENT(DOXNCB)REQUEST*/DO;GOTO DOXNCB;DOXNCB#:END;  /* IN
*T NCB DPNDNT FIELDS */                                            0483
         B     DOXNCB                                              0484
DOXNCB#  DS    0H                                                  0486
*       END;                                                       0486
*  ELSE;                                                           0487
@RF00481 DS    0H                                                  0488
*  /*SEGMENT(DONCB)REQUEST*/DO;GOTO DONCB;DONCB#:END;  /* INIT COMMON N
*B FIELDS */                                                       0488
         B     DONCB                                               0489
DONCB#   DS    0H                                                  0491
*  /*SEGMENT(DOCHAIN)REQUEST*/DO;GOTO DOCHAIN;DOCHAIN#:END;  /* CHAIN F
*CB & NCB */                                                       0491
         B     DOCHAIN                                             0492
DOCHAIN# DS    0H                                                  0494
*/*********************************************************************
*/*  IF AN ERROR OCCURRED DURING FMCB/NCB BUILDING OR CHAINING        *
*/*    THEN RELEASE THE DAF LOCK FOR THE DESTINATION IF IT IS HELD    *
*/*         SET ERROR RETURN CODES                                    *
*/*         FREE ANY FMCB/NCB CORE THAT IS HELD                       *
*/*    ELSE JUST PREPARE TO RETURN TO CALLER                          *
*/*********************************************************************
*IF CINTCODE ^= 0                                                  0494
*  THEN   /*SEGMENT(DOUNDO)REQUEST*/DO;GOTO DOUNDO;DOUNDO#:END;  /* CLE
*N-UP AFTER ERRORS */                                              0494
         LTR   CINTCODE,CINTCODE                                   0494
         BZ    @RF00494                                            0494
         B     DOUNDO                                              0496
*  ELSE;                                                           0498
@RF00494 DS    0H                                                  0499
*/*********************************************************************
*/*  CLEAN UP AND RETURN TO CALLER                                    *
*/*    LOGIC REMOVED FOR CLEAR OCW CID AREA TO ZERO           @DM09566*
*/*    DECREMENT REG. SAVE AREA PTR                                   *
*/*    RETURN TO CALLER WITH RETURN CODE IN REG.15                    *
*/*********************************************************************
*/* OCWCID = 0    CLEAR OCW CID AREA                          @DM09566*
*CREG13 = CREG13 - OCWSLEN;  /*FB REG SAVE AREA PTR */             0499
@RC00494 SLR   @10,@10                                             0499
         IC    @10,OCWSLEN(,COCWPTR)                               0499
         SLR   CREG13,@10                                          0499
*RETURN CODE(OCWRC);   /* RETURN TO CALLER */                      0500
         SLR   @15,@15                                             0500
         IC    @15,OCWRC(,COCWPTR)                                 0500
         L     @14,12(,@13)                                        0500
         LM    @00,@12,20(@13)                                     0500
         BR    @14                                                 0500
*  /*SEGMENT(DOFMCB)START*/DO;GOTO DOFMCB@;DOFMCB:END;             0501
DOFMCB   DS    0H                                                  0504
*/*********************************************************************
*/* IF AN FMCB FOR THIS DEST DOES NOT ALREADY EXIST                   *
*/*   THEN GET CORE FOR AN FMCB                                       *
*/*        STORE THE ADDR OF THE FMCB IN OCW                          *
*/*        STORE FMCB LNGTH(DBL WRDS) & ID IN THE FMCB                *
*/*        SET 'FMCB CORE OBTAINED' FLAG                              *
*/*   IF CORE NOT AVAILABLE OR BUFFER THRESHOLD EXCEEDED              *
*/*     THEN SET INTERNAL FLAG TO INDICATE NO CORE,SO THE OPEN        *
*/*          DEST WILL FAIL                                           *
*/*********************************************************************
*IF CINTCODE = 0   /* IF NO ERRORS OCCURRED */                     0504
*  THEN IF OCWFMCB = 0  /* IF NO PRIOR FMCB EXISTS */              0504
         SLR   @10,@10                                             0504
         CR    CINTCODE,@10                                        0504
         BNE   @RF00504                                            0504
*         THEN DO;      /* GET CORE FOR FMCB */                    0505
*                                                                  0505
         C     @10,OCWFMCB(,COCWPTR)                               0505
         BNE   @RF00505                                            0505
*               /*------------------------------------------ @D31KKMP*/
*               /* THESE MODIFICATIONS WERE FOR DCR-3398.0   @D31KKMP*/
*               /*------------------------------------------ @D31KKMP*/
*               IF NIBMODE=CONTMODE ×  /*IF VARY CTL NODE OR @D31KKMP*/
*                  NIBMODE=CLUSMODE ×  /*CLUSTER CTL NODE OR @D31KKMP*/
*                  NIBMODE=PSOLMODE ×  /*PORT SOLICT NODE OR @D31KKMP*/
*                  NIBMODE=TCM2MODE ×  /*TCAM CTL NODE OR    @XL03HMP*/
*                  NIBMODE=SSCPMODE    /*SESSION CTL NODE    @D31KKMP*/
*                 THEN                 /*SPECIAL NODE, SO:   @D31KKMP*/
         LA    @10,112                                             0507
         ALR   @10,COCWPTR                                         0507
         CLC   NIBMODE(8,@10),@CC04265                             0507
         BE    @RT00507                                            0507
         CLC   NIBMODE(8,@10),@CC04267                             0507
         BE    @RT00507                                            0507
         CLC   NIBMODE(8,@10),@CC03601                             0507
         BE    @RT00507                                            0507
         CLC   NIBMODE(8,@10),@CC04271                             0507
         BE    @RT00507                                            0507
         CLC   NIBMODE(8,@10),@CC04269                             0507
         BNE   @RF00507                                            0507
@RT00507 DS    0H                                                  0508
*                  /*REQSTORE CBID(FMLB)CLEAR(YES)*/               0508
*                   DO;                                            0508
*/* ATBUILD (ISTDYPAB,ISTATCVT,ISTRPH)  */                         0509
*/* END OF ATBUILD */                                              0509
*                  DCL GPR01F FIXED(31) REG(01);                   0509
*                  DCL GPR01P PTR(31)   REG(01);                   0510
*                  DCL GPR02F FIXED(31) REG(02);                   0511
*                  DCL GPR02P PTR(31)   REG(02);                   0512
*                  DCL GPR03F FIXED(31) REG(03);                   0513
*                  DCL GPR03P PTR(31)   REG(03);                   0514
*                  DCL GPR04F FIXED(31) REG(04);                   0515
*                  DCL GPR04P PTR(31)   REG(04);                   0516
*                  DCL GPR05F FIXED(31) REG(05);                   0517
*                  DCL GPR05P PTR(31)   REG(05);                   0518
*                  DCL GPR06F FIXED(31) REG(06);                   0519
*                  DCL GPR06P PTR(31)   REG(06);                   0520
*                  DCL GPR07F FIXED(31) REG(07);                   0521
*                  DCL GPR07P PTR(31)   REG(07);                   0522
*                  DCL GPR08F FIXED(31) REG(08);                   0523
*                  DCL GPR08P PTR(31)   REG(08);                   0524
*                  DCL GPR09F FIXED(31) REG(09);                   0525
*                  DCL GPR09P PTR(31)   REG(09);                   0526
*                  DCL GPR10F FIXED(31) REG(10);                   0527
*                  DCL GPR10P PTR(31)   REG(10);                   0528
*                  DCL GPR11F FIXED(31) REG(11);                   0529
*                  DCL GPR11P PTR(31)   REG(11);                   0530
*                  DCL GPR12F FIXED(31) REG(12);                   0531
*                  DCL GPR12P PTR(31)   REG(12);                   0532
*                  DCL GPR13F FIXED(31) REG(13);                   0533
*                  DCL GPR13P PTR(31)   REG(13);                   0534
*                  DCL GPR15F FIXED(31) REG(15);                   0535
*                  DCL GPR15P PTR(31)   REG(15);                   0536
*                  RFY (GPR02P,GPR03P,GPR04P,GPR15P) RSTD;         0537
*                  RFY (GPR01P,GPR13P) RSTD;                       0538
*          GENERATE REFS(GPR01P,GPR02P,GPR13P) SETS(RPHWORK);      0539
*                                                                  0539
           STM GPR02P,GPR13P,RPHWORK(GPR01P)
*                  RFY (GPR01P,GPR13P) UNRSTD;                     0540
*                                                                  0540
*                  DO; /* LISATCVT CVTBASE(PAGEABLE,(GPR15P)) */   0541
*                    GPR15P = ATCLCPTR; /*SET UP ATCVT POINTER*/   0542
         L     GPR15P,ATCLCPTR                                     0542
*                  END; /*LISATCVT*/                               0543
*          GPR02P=GPR15P->ATCBPDA × '80000000'X;                   0544
         L     GPR02P,ATCBPDA(,GPR15P)                             0544
         O     GPR02P,@CF02254                                     0544
*          DCL 1 FMZA0020 FIXED(31) STATIC LOCAL,                  0545
*              2 *        FIXED(8) INIT(152),                      0545
*              2 *        PTR(24) INIT(0);                         0545
*          GPR03F=FMZA0020;                                        0546
         L     GPR03F,FMZA0020                                     0546
*          GPR04F=35;                                              0547
         LA    GPR04F,35                                           0547
*          GPR15P=GPR15P->ATCSMRQ;                                 0548
         L     GPR15P,ATCSMRQ(,GPR15P)                             0548
*          DCL FMZL0020 BASED(GPR15P) LABEL VALUERANGE(*);         0549
*          CALL FMZL0020;                                          0550
         BALR  @14,@15                                             0550
*                  RFY (GPR13P) RSTD;                              0551
*          GENERATE REFS(GPR01P,RPHWORK) SETS(GPR02P,GPR13P);      0552
*                                                                  0552
           LM GPR02P,GPR13P,RPHWORK(GPR01P)
*                  RFY (GPR13P) UNRSTD;                            0553
*                  RFY (GPR02P,GPR03P,GPR04P,GPR15P) UNRSTD;       0554
*                  END ;                                           0555
*          /********* END OF REQSTORE EXPANSION **********/         /*@
*31KKMP*/                                                          0556
*                 ELSE                 /*NOT SPECIAL NODE    @D31KKMP*/
*                  /*REQSTORE CBID(FMCB)CLEAR(YES)*/               0556
*                   DO;                                            0556
         B     @RC00507                                            0556
@RF00507 DS    0H                                                  0557
*/* ATBUILD (ISTDYPAB,ISTATCVT,ISTRPH)  */                         0557
*/* END OF ATBUILD */                                              0557
*                  RFY (GPR02P,GPR03P,GPR04P,GPR15P) RSTD;         0557
*                  RFY (GPR01P,GPR13P) RSTD;                       0558
*          GENERATE REFS(GPR01P,GPR02P,GPR13P) SETS(RPHWORK);      0559
*                                                                  0559
           STM GPR02P,GPR13P,RPHWORK(GPR01P)
*                  RFY (GPR01P,GPR13P) UNRSTD;                     0560
*                                                                  0560
*                  DO; /* LISATCVT CVTBASE(PAGEABLE,(GPR15P)) */   0561
*                    GPR15P = ATCLCPTR; /*SET UP ATCVT POINTER*/   0562
         L     GPR15P,ATCLCPTR                                     0562
*                  END; /*LISATCVT*/                               0563
*          GPR02P=GPR15P->ATCBPDA × '80000000'X;                   0564
         L     GPR02P,ATCBPDA(,GPR15P)                             0564
         O     GPR02P,@CF02254                                     0564
*          DCL 1 FMZA0039 FIXED(31) STATIC LOCAL,                  0565
*              2 *        FIXED(8) INIT(152),                      0565
*              2 *        PTR(24) INIT(0);                         0565
*          GPR03F=FMZA0039;                                        0566
         L     GPR03F,FMZA0039                                     0566
*          GPR04F=25;                                              0567
         LA    GPR04F,25                                           0567
*          GPR15P=GPR15P->ATCSMRQ;                                 0568
         L     GPR15P,ATCSMRQ(,GPR15P)                             0568
*          DCL FMZL0039 BASED(GPR15P) LABEL VALUERANGE(*);         0569
*          CALL FMZL0039;                                          0570
         BALR  @14,@15                                             0570
*                  RFY (GPR13P) RSTD;                              0571
*          GENERATE REFS(GPR01P,RPHWORK) SETS(GPR02P,GPR13P);      0572
*                                                                  0572
           LM GPR02P,GPR13P,RPHWORK(GPR01P)
*                  RFY (GPR13P) UNRSTD;                            0573
*                  RFY (GPR02P,GPR03P,GPR04P,GPR15P) UNRSTD;       0574
*                  END ;                                           0575
*          /********* END OF REQSTORE EXPANSION **********/         /*@
*31KKMP*/                                                          0576
*                                                                  0576
*               RFY CREG15 RSTD;                           /*@D31KKMP*/
@RC00507 DS    0H                                                  0577
*               IF CREG15 = 0    /* IF CORE OBTAINED */            0577
*                 THEN DO;                                         0577
         LTR   CREG15,CREG15                                       0577
         BNZ   @RF00577                                            0577
*                       OCWFMCB = RPHSRPRM;  /* SAVE FMCB PTR */   0579
         L     @14,RPHSRPRM(,RPHPTR)                               0579
         ST    @14,OCWFMCB(,COCWPTR)                               0579
*             /*                                                   0580
*              FMCB LNGTH ROUNDED-UP TO NXT MULTIPLE OF 8          0580
*              STORE NUMBER OF DOUBLE WORDS                        0580
*             */                                                   0580
*                       FMCLNGTH =  (((LENGTH(ISTFMCB)+7)×7)&&7)/8;
         MVI   FMCLNGTH(@14),X'23'                                 0580
*                       FMCTYPE = FMTYPE;   /* STORE FMCB ID */    0581
         MVI   FMCTYPE(@14),X'03'                                  0581
*                       CFMCORE = '1'B;      /* SET FMCB CORE FLAG */
         OI    CFMCORE(COCWPTR),B'10000000'                        0582
*                      END;                                        0583
*                 ELSE DO;                                         0584
         B     @RC00577                                            0584
@RF00577 DS    0H                                                  0585
*                       IF CREG15 = 4                              0585
*                         THEN  /*RELSTORE BUFADDR(RPHSRPRM)*/     0585
         CH    CREG15,@CH00055                                     0585
         BNE   @RF00585                                            0585
*                                DO;                               0586
*/* ATBUILD (ISTATCVT,ISTRPH)  */                                  0587
*/* END OF ATBUILD */           DCL GPR00F FIXED(31) REG(00);      0587
*                               DCL GPR00P PTR(31)   REG(00);      0588
*                               DCL GPR14F FIXED(31) REG(14);      0589
*                               DCL GPR14P PTR(31)   REG(14);      0590
*                               RFY (GPR02P,GPR03P,GPR04P,GPR15P) RSTD;
*         RFY (GPR01P,GPR13P) RSTD;                                0592
*         GENERATE REFS(GPR01P,GPR02P,GPR13P) SETS(RPHWORK);       0593
*                                                                  0593
          STM GPR02P,GPR13P,RPHWORK(GPR01P)
*         RFY GPR13P UNRSTD;                                       0594
*         GPR04P=RPHSRPRM;                                         0595
         L     GPR04P,RPHSRPRM(,RPHPTR)                            0595
*         DCL 1 FMZA0058 FIXED(31) STATIC LOCAL,                   0596
*             2 * FIXED(8) INIT(64),                               0596
*             2 * PTR(24) INIT(0);                                 0596
*         GPR03F = FMZA0058;                                       0597
*                                                                  0597
         L     GPR03F,FMZA0058                                     0597
*                               DO; /* LISATCVT CVTBASE(PAGEABLE,(GPR15
*)) */                            GPR15P = ATCLCPTR; /*SET UP ATCVT POI
*TER*/                          END; /*LISATCVT*/                  0598
         L     GPR15P,ATCLCPTR                                     0599
*         GPR02P = GPR15P->ATCBPDA;                                0601
         L     GPR02P,ATCBPDA(,GPR15P)                             0601
*         GPR15P=GPR15P->ATCSMRS;                                  0602
         L     GPR15P,ATCSMRS(,GPR15P)                             0602
*         DCL FMZL0058 BASED(GPR15P) LABEL VALUERANGE(*);          0603
*         CALL FMZL0058;                                           0604
         BALR  @14,@15                                             0604
*         RFY GPR13P RSTD;                                         0605
*         GENERATE REFS(GPR01P,RPHWORK) SETS(GPR02P,GPR13P);       0606
*                                                                  0606
          LM GPR02P,GPR13P,RPHWORK(GPR01P)
*         RFY (GPR01P,GPR13P) UNRSTD;                              0607
*                               RFY (GPR02P,GPR03P,GPR04P,GPR15P) UNRST
*;                                                                 0608
*                               END ;/**********END OF RELSTORE EXPANSI
*N**********/                                                      0609
*                         ELSE;                                    0610
@RF00585 DS    0H                                                  0611
*                       CINTCODE = 4; /* SET INTRNL FLAG = NO CORE */
         LA    CINTCODE,4                                          0611
*                      END;                                        0612
*               RFY CREG15 UNRSTD;                         /*@D31KKMP*/
@RC00577 DS    0H                                                  0614
*              END;                                                0614
*         ELSE;                                                    0615
@RF00505 DS    0H                                                  0616
*  ELSE;                                                           0616
@RF00504 DS    0H                                                  0617
*/*********************************************************************
*/*  IF NO ERROR OCCURRED                                             *
*/*    THEN 1. GET THE DAF FOR THE DEST. & DETERMINE VIA CIDCTL       *
*/*            IF AN NCB ALREADY EXISTS FOR THE DEST                  *
*/*         2. IF AN NCB DOES EXIST THE DAF LOCK WILL BE HELD         *
*/*              THEN SET 'DAF LOCK HELD' FLAG IN OCW                 *
*/*         3. INITIALIZE THE FMCB                                    *
*/*    ELSE  OPEN DEST HAS FAILED THEREFORE NO MORE FMCB-NCB BUILDING *
*/*********************************************************************
*IF CINTCODE = 0  /* IF NO ERRORS OCCURRED */                      0617
*  THEN DO;                                                        0617
         LTR   CINTCODE,CINTCODE                                   0617
         BNZ   @RF00617                                            0617
*        OCWDAF = RPRDAF;       /* FILL DAF PORTION OF CID */      0619
         L     @10,OCWDRDTE(,COCWPTR)                              0619
         MVC   OCWDAF(2,COCWPTR),RPRDAF(@10)                       0619
*        RFY CREG2 RSTD;   /* RSTRCT REG.2 FOR CID */              0620
*        CREG2 = OCWCID;        /* PUT CID IN REG.1 */             0621
*                                                                  0621
         L     CREG2,OCWCID(,COCWPTR)                              0621
*          DO; /* CIDCTL(FIND) LOCK(XCLUSIVE) */                   0622
*                                                                  0622
*          RFY (EMCR2,EMCR3) RSTD;                                 0623
*            GEN SETS(RPHWORK)                                     0624
*        (STM EMCR0,EMCR15,RPHWORK(RPHPTR) SAVE REGS IN RPH);      0624
         STM EMCR0,EMCR15,RPHWORK(RPHPTR) SAVE REGS IN RPH
*            EMCR3 = '00'X; /*CLEAR EXTRA BITS*/                   0625
         SLR   EMCR3,EMCR3                                         0625
*            EMCR3 = '02'X; /*INDICATE EXCLUSIVE LOCK*/            0626
         LA    EMCR3,2                                             0626
*            CALL ATCLCPTR->ATCCDFND->ISTSDCCF; /*PROCESS REQUEST*/
*                                                                  0627
         L     @10,ATCLCPTR                                        0627
         L     @15,ATCCDFND(,@10)                                  0627
         BALR  @14,@15                                             0627
*          RFY (EMCR2,EMCR3) UNRSTD;                               0628
*          END; /*CIDCTL*/ /* FIND NCB PTR FOR                     0629
*                                   ANY PRIOR OPEN                 0629
*                                   & LOCK DAF */                  0629
*        RFY CREG0 RSTD;   /* RSTRCT REG.0 FOR NCB PTR */          0630
*        RFY CREG15 RSTD;                                  /*@D31KKMP*/
*        IF CREG15 = 0          /* IF NCB PTR FOUND */             0632
*          THEN DO;                                                0632
         LTR   CREG15,CREG15                                       0632
         BNZ   @RF00632                                            0632
*                OCWNCB = CREG0;      /* SAVE PRIOR OPEN NCB PTR */
         ST    CREG0,OCWNCB(,COCWPTR)                              0634
*                RFY CREG0 UNRSTD;   /* RELEASE REG.0 */           0635
*                OCWCLOCK = '1'B;   /* SET DAF LOCK HELD FLAG */   0636
         OI    OCWCLOCK(COCWPTR),B'00010000'                       0636
*               END;                                               0637
*          ELSE;                                                   0638
@RF00632 DS    0H                                                  0639
*          /*SEGMENT(DOFINIT)REQUEST*/DO;GOTO DOFINIT;DOFINIT#:END;  /*
*INIT FMCB */                                                      0639
         B     DOFINIT                                             0640
DOFINIT# DS    0H                                                  0642
*        RFY CREG15 UNRSTD;                                /*@D31KKMP*/
*        RFY CREG2 UNRSTD;  /* RELEASE REG.2 */                    0643
*       END;                                                       0644
*  ELSE;                                                           0645
@RF00617 DS    0H                                                  0646
*  /*SEGMENT(DOFMCB)FINISH*/DO;GOTO DOFMCB#;DOFMCB@:END;           0646
         B     DOFMCB#                                             0647
DOFMCB@  DS    0H                                                  0649
*  /*SEGMENT(DOFINIT)START*/DO;GOTO DOFINIT@;DOFINIT:END;          0649
         B     DOFINIT@                                            0650
DOFINIT  DS    0H                                                  0652
*/*********************************************************************
*/*                          INITIALIZE FMCB                          *
*/*********************************************************************
*RFY CDVTSVAD RSTD;  /* RSTRCT REG.2 FOR PTR DVT PTR SAVE AREA */  0652
*RFY CLISTPTR RSTD;  /* RSTRCT REG.5 FOR PTR DVT NAME LIST */      0653
*CDVTSVAD = ADDR(OCWSCPAD);  /* INIT PTR DVT PTR SAVE AREA */      0654
         LA    CDVTSVAD,OCWSCPAD(,COCWPTR)                         0654
*CLISTPTR = ADDR(CDVTLIST);  /* INIT DVT NAME LIST PTR */          0655
         LA    CLISTPTR,CDVTLIST                                   0655
*/*********************************************************************
*/* RESOLVE REQUIRED TPIOS,CTRL LAYER & SESSION CTRL PAB DVT NAMES    *
*/* INTO DVT ADRESSES AND SAVE DVT ADDRESSES IN OCW SCRATCH PAD       *
*/* IF A DVT NAME CANNOT BE RESOLVED & THE APPL IS PRIVELEGED         *
*/*   THEN JUST IGNORE THE UNRESOLVED NAME & GET THE NEXT NAME        *
*/*   ELSE SET THE INTRNL CODE INDICATING 'INVALID MODE NAME'         *
*/*        AND TERMINATE NAME RESOLUTION AS OPEN DST HAS FAILED       *
*/*********************************************************************
*DO WHILE CLISTPTR <= ADDR(CDVTEND);  /*RSLVE DVT NAME LIST        0656
*                                                      TO DVT PTRS */
*                                                                  0656
         B     @DE00656                                            0656
@DL00656 DS    0H                                                  0657
*/*  TPDVTS NAMEPTR(CLISTPTR)RETRN EPTPTR(OCWEPTAB) */             0657
*  DO;                                                             0657
*                                                                  0657
*/* ATBUILD (ISTRPH,ISTPAB,ISTDYPAB,ISTATCVT)  */                  0658
*/* END OF ATBUILD */                                              0658
*  RFY (GPR01P,GPR02P,GPR06P,GPR08P) RSTD;                         0658
*  GEN REFS(GPR01P,GPR02P,GPR08P) SETS(RPHWORK)                    0659
*  (STM   GPR02P,GPR08P,RPHWORK(GPR01P));                          0659
         STM   GPR02P,GPR08P,RPHWORK(GPR01P)
*  RFY (GPR02P,GPR08P) UNRSTD;                                     0660
*  RFY GPR00P RSTD;                                                0661
*  GPR00P = CLISTPTR;                                              0662
         LR    GPR00P,CLISTPTR                                     0662
*  GEN SETS(GPR00P) (LNR   GPR00P,GPR00P);                         0663
         LNR   GPR00P,GPR00P
*  GPR01P -> RPHSRPRM = OCWEPTAB;                                  0664
         MVC   RPHSRPRM(4,GPR01P),OCWEPTAB(COCWPTR)                0664
*  RFY GPR15P RSTD;                                                0665
*                                                                  0665
*  DO; /* LISATCVT CVTBASE(PAGEABLE,(GPR15P)) */                   0666
*    GPR15P = ATCLCPTR; /*SET UP ATCVT POINTER*/                   0667
         L     GPR15P,ATCLCPTR                                     0667
*  END; /*LISATCVT*/                                               0668
*  GPR15P=GPR15P -> ATCESC02;                                      0669
         L     GPR15P,ATCESC02(,GPR15P)                            0669
*  DCL FMZL0081 BASED(GPR15P) LABEL VALUERANGE(*);                 0670
*  CALL FMZL0081;                                                  0671
         BALR  @14,@15                                             0671
*  RFY (GPR00P,GPR15P) UNRSTD;                                     0672
*  RFY (GPR02P,GPR08P) RSTD;                                       0673
*  GEN REFS(RPHWORK) SETS(GPR02P,GPR08P)                           0674
*  (LM    GPR02P,GPR08P,RPHWORK(GPR01P));                          0674
         LM    GPR02P,GPR08P,RPHWORK(GPR01P)
*  RFY (GPR01P,GPR02P,GPR06P,GPR08P) UNRSTD;                       0675
*  END;                                                            0676
*/***** END OF TPDVTS GENERATION *****/                            0677
* RFY CREG15 RSTD;                                         /*@D31KKMP*/
* IF CREG15 = 0   /* IF DVT PTR RETRND */                          0678
*   THEN DO;                                                       0678
         LTR   CREG15,CREG15                                       0678
         BNZ   @RF00678                                            0678
*         CDVTPTR = RPHDVTA;  /* SAVE DVT PTR */                   0680
         MVC   CDVTPTR(4,CDVTSVAD),RPHDVTA(RPHPTR)                 0680
*         CDVTSVAD = CDVTSVAD+4;   /* PTR NXT DVT PTR SAVE AREA */ 0681
         AH    CDVTSVAD,@CH00055                                   0681
*        END;                                                      0682
*   ELSE DO;                                                       0683
         B     @RC00678                                            0683
@RF00678 DS    0H                                                  0684
*         IF RAPALLF = '1'B   /* IF APPL IS PRIVELEGED */          0684
*           THEN CDVTSVAD = CDVTSVAD+4;   /* PTR NXT DVT PTR SAV AREA *
         L     @14,OCWARDTE(,COCWPTR)                              0684
         TM    RAPALLF(@14),B'10000000'                            0684
         BNO   @RF00684                                            0684
         AH    CDVTSVAD,@CH00055                                   0685
*           ELSE DO;                                               0686
         B     @RC00684                                            0686
@RF00684 DS    0H                                                  0687
*                 CINTCODE = 8;  /* SET INTRNL CODE = DVT ERROR */ 0687
         LA    CINTCODE,8                                          0687
*                 CLISTPTR = ADDR(CDVTEND);  /* POINT TO END DVT LIST *
         LA    CLISTPTR,CDVTEND                                    0688
*                END;                                              0689
*        END;                                                      0690
@RC00684 DS    0H                                                  0691
* RFY CREG15 UNRSTD;                                       /*@D31KKMP*/
@RC00678 DS    0H                                                  0692
* CLISTPTR = CLISTPTR+8;   /* POINT TO NXT LIST ENTRY */           0692
         AH    CLISTPTR,@CH00061                                   0692
*END;                                                              0693
@DE00656 LA    @10,CDVTEND                                         0693
         CR    CLISTPTR,@10                                        0693
         BNH   @DL00656                                            0693
*RFY CLISTPTR UNRSTD;   /* RELEASE REG.5 */                        0694
*/*********************************************************************
*/*  IF NO ERROR OCCURRED                                             *
*/*    THEN CONTINUE INITIALIZING FMCB                                *
*/*    ELSE BYPASS FURTHER INITIALIZATION - OPEN DEST HAS FAILED      *
*/*********************************************************************
*IF CINTCODE = 0   /* IF NO ERRORS OCCURRDE */                     0695
*  THEN DO;        /* PUT DVT PTRS IN FMCB-PABS,CALC PAB OFFSETS */
         LTR   CINTCODE,CINTCODE                                   0695
         BNZ   @RF00695                                            0695
*        RFY CPABPTR RSTD;   /* RSTRCT REG.5 FOR FMCB-PAB PTR */   0697
*        RFY ISTPAB BASED(CPABPTR);  /* ESTABL PAB BASE REG */     0698
*        CDVTSVAD = ADDR(OCWSCPAD);  /* INIT PTR DVT SAVE AREA */  0699
         LA    CDVTSVAD,OCWSCPAD(,COCWPTR)                         0699
*                                    /* TO GET PAB DVT PTRS */     0700
*        CPABPTR = ADDR(FMCPAB1);   /* INIT PTR FIRST FMCB-PAB */  0700
         L     CPABPTR,OCWFMCB(,COCWPTR)                           0700
         LA    CPABPTR,FMCPAB1(,CPABPTR)                           0700
*/*********************************************************************
*/*  1. STORE THE TPIOS,CTRL LAYER & SESSION CTRL DVTADDR'S INTO      *
*/*  THEIR RESPECTIVE PABS                                            *
*/*  2. CALCULATE THE PAB OFFSET FROM THE BEGINNING OF THE FMCB       *
*/*  FOR EACH PAB STORE IT IN THE PAB                                 *
*/*  3.  PUT THE ENTRY POINT TABLE ADDR INTO THE FMCB                 *
*/*********************************************************************
*        DO WHILE CPABPTR  <= ADDR(FMCPAB5);   /* FILL FMCB-PABS */
         B     @DE00701                                            0701
@DL00701 DS    0H                                                  0702
*         PABDVTA = CDVTPTR;   /* STORE DVT PTR IN FMCB-PAB */     0702
         MVC   PABDVTA(3,CPABPTR),CDVTPTR+1(CDVTSVAD)              0702
*         PABOFFST = CPABPTR - OCWFMCB;  /* STORE PAB OFFSET */    0703
         LR    @10,CPABPTR                                         0703
         SL    @10,OCWFMCB(,COCWPTR)                               0703
         STC   @10,PABOFFST(,CPABPTR)                              0703
*         CDVTSVAD = CDVTSVAD+4;     /* POINT TO NXT DVT PTR */    0704
         AH    CDVTSVAD,@CH00055                                   0704
*         CPABPTR = CPABPTR+LENGTH(ISTPAB);  /* POINT TO NXT FMCB-PAB *
         AH    CPABPTR,@CH00802                                    0705
*        END;                                                      0706
@DE00701 L     @10,OCWFMCB(,COCWPTR)                               0706
         LA    @07,FMCPAB5(,@10)                                   0706
         CR    CPABPTR,@07                                         0706
         BNH   @DL00701                                            0706
*        RFY CPABPTR UNRSTD;   /* RELEASE REG.5 */                 0707
*        RFY CDVTSVAD UNRSTD;   /* RELEASE REG.2 */                0708
*       FMCDVTA = OCWEPTAB;   /* PUT EPT PTR IN FMCB */            0709
         MVC   FMCDVTA(4,@10),OCWEPTAB(COCWPTR)                    0709
*       FMCSEQ1 = 1;                                               0710
         MVI   FMCSEQ1(@10),X'01'                                  0710
*       FMCZF001 = '1'B;                                           0711
         OI    FMCZF001(@10),B'10000000'                           0711
*       FMCZF00C = '1'B;                  /*1ST BLK OF DATA  @ZA12780*/
         OI    FMCZF00C(@10),B'00001000'                           0712
*       RFY ISTPAB BASED(ADDR(FMCPAB3));  /* PAB BASE */;          0713
*       PABNODQ = '1'B;   /* DO NOT DEQ WORK ELMT */;              0715
         OI    PABNODQ+96(@10),B'00000001'                         0715
*       RFY ISTPAB BASED(ADDR(FMCPAB4));  /* PAB BASE */;          0717
*       PABNODQ = '1'B;  /* DO NOT DEQ WORK ELMT */;               0719
         OI    PABNODQ+112(@10),B'00000001'                        0719
*       RFY ISTPAB BASED(ADDR(FMCPAB5)); /* SESSION CTL PAB  @XM06768
*                                           BASE             @XM06768*/
*       PABNODQ = '1'B;  /* DO NOT DEQ WORK ELMNT            @XM06768*/
         OI    PABNODQ+128(@10),B'00000001'                        0722
*/*********************************************************************
*/*  1.COPY THE DEVICE CHARACTERISTICS FROM THE RDTE                  *
*/*  2. COPY BHSET ID,PROCESS OPTNS, & SETMODE BYTES FROM OCW         *
*/*  3. COPY TASK ID & ADDR OF THE SESSSION PAB PTR FROM ACB DEB      *
*/*  4. COPY MODE NAME,RESPONSE LIMIT, & THE EXIT LIST PTR FROM NIB   *
*/*  5. COPY DIALOGUE INDICATOR FROM THE RPL                          *
*/*  6. SET INHIBIT TRAFFIC FLAG IN TPIOS & SESSION OUTBOUND PABS     *
*/*     AND CTRL LAYER INBOUND PAB                                    *
*/*  7. INIT FMCB CURRENT INBOUND & OUTBOUND FLAGS FOR ISTRCC22       *
*/* IF THE DEST IS A TERMINAL OR COMPONENT                            *
*/*   THEN CALCULATE FMCB BUFFER LIMIT                                *
*/* IF THE DEST IS A LOGICAL UNIT COPY THE PACING COUNTS FROM RDTE    *
*/*********************************************************************
*                                                                  0723
*       /*-------------------------------------------------- @D31KKMP*/
*       /* THESE MODIFICATIONS WERE FOR DCR-3293.0           @D31KKMP*/
*       /*-------------------------------------------------- @D31KKMP*/
*       FMCIBCE = FMCIBCEI;     /* CURRENT INBOUND           @D31KKMP*/
         OI    FMCIBCE(@10),B'00001100'                            0723
*       FMCOBCE = FMCOBCEI;     /* CURRENT OUTBOUND          @D31KKMP*/
*                                                                  0724
         NI    FMCOBCE(@10),B'00011111'                            0724
         OI    FMCOBCE(@10),B'00010000'                            0724
*       RFY ISTDEVCH BASED(ADDR(RPRDEVCH)); /* DCR 3884.10   @D32CKXY*/
*       IF RPRENTRY = RPRENTTR × /* IF DEST IS A TERMINAL OR @DM08494*/
*          RPRENTRY = RPRENTUT × /* A UTERM OR               @DM08494*/
*          RPRENTRY = RPRENTCM × /* A COMPONENT OR           @DM08494*/
*          RPRENTRY = RPRENTLU   /* A LOGICAL UNIT           @DM09009*/
*         THEN IF DEVSUBND = '0'B   /* WITH NO SCHED SUB NODES */  0726
         L     @10,OCWDRDTE(,COCWPTR)                              0726
         CLI   RPRENTRY(@10),X'80'                                 0726
         BE    @RT00726                                            0726
         CLI   RPRENTRY(@10),X'75'                                 0726
         BE    @RT00726                                            0726
         CLI   RPRENTRY(@10),X'90'                                 0726
         BE    @RT00726                                            0726
         CLI   RPRENTRY(@10),X'81'                                 0726
         BNE   @RF00726                                            0726
@RT00726 DS    0H                                                  0727
*             THEN FMCBUFLM = RAPBFACT*RCPBFLIM;  /* CALC FMCB BUFFER
*                                                    LIMIT   @DM03298*/
         L     @10,OCWDRDTE(,COCWPTR)                              0727
         TM    DEVSUBND+44(@10),B'00010000'                        0727
         BNZ   @RF00727                                            0727
         L     @07,OCWFMCB(,COCWPTR)                               0728
         L     @05,OCWARDTE(,COCWPTR)                              0728
         SLR   @03,@03                                             0728
         IC    @03,RCPBFLIM(,@10)                                  0728
         SLR   @10,@10                                             0728
         IC    @10,RAPBFACT(,@05)                                  0728
         MR    @02,@10                                             0728
         STH   @03,FMCBUFLM(,@07)                                  0728
*             ELSE;                                                0729
@RF00727 DS    0H                                                  0730
*         ELSE;                                                    0730
@RF00726 DS    0H                                                  0731
*       FMCBHSET = OCWBHSID;  /* COPY BHSET ID FROM OCW W.A. TO FMCB */
         L     @10,OCWFMCB(,COCWPTR)                               0731
         MVC   FMCBHSET(1,@10),OCWBHSID(COCWPTR)                   0731
*       FMCDEBA = OCWACDEB;   /* COPY ACDEB ADDR FROM OCW    @ZA25571*/
*                                                                  0732
         MVC   FMCDEBA(4,@10),OCWACDEB(COCWPTR)                    0732
*       /*-------------------------------------------------- @D31KKMP*/
*       /* THESE MODIFICATIONS WERE FOR DCR-3337.0           @D31KKMP*/
*       /*-------------------------------------------------- @D31KKMP*/
*       RFY ISTPAB BASED(ADDR(FMCPAB2)); /* CLIP BASE        @D31KKMP*/
*       PABINHBT = '1'B;  /* SET INHIBIT TRAFFIC FLAG        @D31KKMP*/
*                                                                  0734
         L     @07,PABINHBT+80(,@10)                               0734
@GL00008 LR    @05,@07                                             0734
         O     @05,@CF05572                                        0734
         CS    @07,@05,PABINHBT+80(@10)                            0734
         BNE   @GL00008                                            0734
*       RFY ISTPAB BASED(ADDR(FMCPAB3));  /* GET CORRECT PAB BASE */
*       PABINHBT = '1'B;  /* SET INHIBIT TRAFFIC FLAG */           0736
         L     @05,OCWFMCB(,COCWPTR)                               0736
         L     @10,PABINHBT+96(,@05)                               0736
@GL00009 LR    @07,@10                                             0736
         O     @07,@CF05572                                        0736
         CS    @10,@07,PABINHBT+96(@05)                            0736
         BNE   @GL00009                                            0736
*       RFY ISTPAB BASED(ADDR(FMCPAB5));  /* GET CORRECT PAB BASE */
*       PABINHBT = '1'B;  /* SET INHIBIT TRAFFIC FLAG */           0738
         L     @05,OCWFMCB(,COCWPTR)                               0738
         L     @10,PABINHBT+128(,@05)                              0738
@GL00010 LR    @07,@10                                             0738
         O     @07,@CF05572                                        0738
         CS    @10,@07,PABINHBT+128(@05)                           0738
         BNE   @GL00010                                            0738
*       FMCRDTPT = OCWDRDTE & '00FFFFFF'X;  /* POINT FMCB TO RDTE */
         L     @10,OCWFMCB(,COCWPTR)                               0739
         L     @07,OCWDRDTE(,COCWPTR)                              0739
         N     @07,@CF04415                                        0739
         ST    @07,FMCRDTPT(,@10)                                  0739
*       RFY CADEBPTR RSTD;  /* RSTRCT REG.7 FOR ACB DEB PTR */     0740
*       CADEBPTR = RAPACDEB;  /* INIT PTR TO ACB DEB */            0741
         L     @05,OCWARDTE(,COCWPTR)                              0741
         L     CADEBPTR,RAPACDEB(,@05)                             0741
*       FMCTSKID = ACDTSKID;  /* PUT TASK ID IN FMCB */            0742
*                                                                  0742
         MVC   FMCTSKID(4,@10),ACDTSKID(CADEBPTR)                  0742
*       /*-------------------------------------------------- @D31KKMP*/
*       /* THIS MODIFICATION WAS FOR DCR-3337.0              @D31KKMP*/
*       /*-------------------------------------------------- @D31KKMP*/
*       FMCSIPA = ADDR(ACDSIP);   /* ADDR OF SESSION PAB PTR @D31KKMP*/
*                                                                  0743
         LA    @05,ACDSIP(,CADEBPTR)                               0743
         ST    @05,FMCSIPA(,@10)                                   0743
*       RFY CADEBPTR UNRSTD;  /* RELEASE REG.7 */                  0744
*       FMCMODE = NIBMODE;  /* PUT MODE NAME IN FMCB */            0745
         LA    @07,112                                             0745
         ALR   @07,COCWPTR                                         0745
         MVC   FMCMODE(8,@10),NIBMODE(@07)                         0745
*       FMCUSFLD = NIBUSER;  /* STORE USER DATA */                 0746
         MVC   FMCUSFLD(4,@10),NIBUSER(@07)                        0746
*       FMCPROCD = OCWPROCD;  /* COPY PROC OPTNS & SETMODE BYTES */
         MVC   FMCPROCD(4,@10),OCWPROCD(COCWPTR)                   0747
*       FMCRSPLM = NIBLIMIT;   /* COPY RESPONSE LIMIT */           0748
         MVC   FMCRSPLM(2,@10),NIBLIMIT(@07)                       0748
*       FMCEXLST = NIBEXLST;   /* COPY EXIT LIST PTR */            0749
*                                                                  0749
         MVC   FMCEXLST(4,@10),NIBEXLST(@07)                       0749
*       /*-------------------------------------------------- @D31KKMP*/
*       /* THIS MODIFICATION WAS FOR DCR-3337.1              @D31KKMP*/
*       /*-------------------------------------------------- @D31KKMP*/
*       FMCSNBI  = '1'B;       /* SET SESSION NOT BND FLAG   #DL31HMP*/
*                                                                  0750
         OI    FMCSNBI(@10),B'10000000'                            0750
*       /*-------------------------------------------------- @D31KKMP*/
*       /* THESE MODIFICATIONS WERE FOR DCR-1363.0           @D31KKMP*/
*       /*-------------------------------------------------- @D31KKMP*/
*       IF RPLDLGIN = '0'B   /* COPY DIALOG INDICATOR        @D31KKMP*/
*         THEN DO;                                         /*@D31KKMP*/
         L     @07,OCWRPL(,COCWPTR)                                0751
         TM    RPLDLGIN(@07),B'10000000'                           0751
         BNZ   @RF00751                                            0751
*               FMCFLGA1 = '0'B;                           /*@D31KKMP*/
         NI    FMCFLGA1(@10),B'10111111'                           0753
*               FMCFLGB2 = '0'B;                           /*@DM08419*/
*               FMCFLGB3 = '0'B;                           /*@DM08419*/
         NI    FMCFLGB2(@10),B'11001111'                           0755
*             END;                                         /*@D31KKMP*/
*       ELSE DO;                                           /*@D31KKMP*/
         B     @RC00751                                            0757
@RF00751 DS    0H                                                  0758
*             FMCFLGA1 = '1'B;                             /*@D31KKMP*/
         L     @10,OCWFMCB(,COCWPTR)                               0758
         OI    FMCFLGA1(@10),B'01000000'                           0758
*             FMCFLGB2 = '1'B;                             /*@DM08419*/
*             FMCFLGB3 = '1'B;                             /*@DM08419*/
         OI    FMCFLGB2(@10),B'00110000'                           0760
*            END;                                          /*@D31KKMP*/
*                                                                  0761
*       /*-------------------------------------------------- @D31KKMP*/
*       /* THESE MODIFCATIONS WERE FOR DCR-3337.0            @D31KKMP*/
*       /*-------------------------------------------------- @D31KKMP*/
*       IF RPRENTRY = RPRENTLU   /* IF DEST = LOGICAL UNIT   @D31KKMP*/
*         THEN DO;               /* COPY LU PACING COUNTS    @D31KKMP*/
@RC00751 L     @10,OCWDRDTE(,COCWPTR)                              0762
         CLI   RPRENTRY(@10),X'81'                                 0762
         BNE   @RF00762                                            0762
*               FMCPACEN = RLUPACEN;                       /*@D31KKMP*/
         L     @07,OCWFMCB(,COCWPTR)                               0764
         MVC   FMCPACEN(1,@07),RLUPACEN(@10)                       0764
*               FMCPACEM = RLUPACEM;                       /*@D31KKMP*/
         MVC   FMCPACEM(1,@07),RLUPACEM(@10)                       0765
*               IF RPRHDTYP ^= RPRENTDA  /* IF REMOTE LU AND @Z40GKMP*/
*                & RAPANVPC  = CBITON    /* UPACE FLAG ON    @Z40GKMP*/
*                THEN                                      /*@Z40GKMP*/
         CLI   RPRHDTYP(@10),X'51'                                 0766
         BE    @RF00766                                            0766
         L     @10,OCWARDTE(,COCWPTR)                              0766
         TM    RAPANVPC(@10),B'00000001'                           0766
         BNO   @RF00766                                            0766
*                 DO;                                      /*@Z40GKMP*/
*                  FMCPACEN = '00'X;     /* CLEAR PACE N FLD @Z40GKMP*/
         MVI   FMCPACEN(@07),X'00'                                 0768
*                  FMCPACEM = '00'X;     /* CLEAR PACE M FLD @Z40GKMP*/
         MVI   FMCPACEM(@07),X'00'                                 0769
*                 END;                                     /*@Z40GKMP*/
*                ELSE;                                     /*@Z40GKMP*/
@RF00766 DS    0H                                                  0772
*/* REM FILL IN OF FMCB MAXDATA FIELD FROM PU RDTE   DCR3902 @D32CKXY*/
*              END;                                        /*@D31KKMP*/
*         ELSE;  /* DO IF DEST IS SNA2 CLUSTER-DCR 3902      @D32CKXY*/
@RF00762 DS    0H                                                  0774
*      END;                                                        0774
*  ELSE;                                                           0775
@RF00695 DS    0H                                                  0776
*  /*SEGMENT(DOFINIT)FINISH*/DO;GOTO DOFINIT#;DOFINIT@:END;        0776
         B     DOFINIT#                                            0777
DOFINIT@ DS    0H                                                  0779
*  /*SEGMENT(DOXNCB)START*/DO;GOTO DOXNCB@;DOXNCB:END;             0779
         B     DOXNCB@                                             0780
DOXNCB   DS    0H                                                  0782
*/*********************************************************************
*/*  IF NO ERROR OCCURED PREVIOUSLY                                   *
*/*    THEN DETERMINE DEST TYPE & BUILD THE APPRPRIATE NCB            *
*/*        1. DNCB - TERMINAL,LINE ,COMPONENT                         *
*/*        2. HCNCB - CLUSTER CTRL UNIT                               *
*/*        3. LDNCB - LOCAL CTRL UNIT                                 *
*/*        4. ICNCB - 370X                                            *
*/*        5. LUNCB - LOGICAL UNIT                                    *
*/*        6. CCNCB - SNA CLUSTER CTRL UNIT                           *
*/*    ELSE DO NOT BUILD AN NCB AS OPEN DST HAS FAILED                *
*/*  IF NO ERROR OCCURED DURING NCB BUILDING                          *
*/*    THEN SET 'NCB CORE OBTAINED'FLAG                               *
*/*    ELSE LEAVE IT ALONE AS OPEN DST HAS FAILED                     *
*/*********************************************************************
*IF CINTCODE = 0  /* IF NO ERRORS OCCURRED */                      0782
*  THEN DO;                                                        0782
         LTR   CINTCODE,CINTCODE                                   0782
         BNZ   @RF00782                                            0782
*        IF RPRENTRY = RPRENTTR  /* IF DEST RDTE IS FOR TRMNL */   0784
*          × RPRENTRY=RPRENTLN  /* OR LINE RDTE*/                  0784
*          × RPRENTRY=RPRENTCM  /*OR COMPN RDTE*/                  0784
*          THEN   /*SEGMENT(DODNCB)REQUEST*/DO;GOTO DODNCB;DODNCB#:END;
         L     @10,OCWDRDTE(,COCWPTR)                              0784
         CLI   RPRENTRY(@10),X'80'                                 0784
         BE    @RT00784                                            0784
         CLI   RPRENTRY(@10),X'50'                                 0784
         BE    @RT00784                                            0784
         CLI   RPRENTRY(@10),X'90'                                 0784
         BNE   @RF00784                                            0784
@RT00784 DS    0H                                                  0785
         B     DODNCB                                              0786
* /* BUILD A DNCB */                                               0788
*          ELSE IF RPRENTRY=RPRENTCL   /* IF DEST RDTE IS FOR CLUSTER *
*                 THEN   /*SEGMENT(DOHCNCB)REQUEST*/DO;GOTO DOHCNCB;DOH
*NCB#:END;  /* BUILD HCNCB */                                      0788
         B     @RC00784                                            0788
@RF00784 L     @10,OCWDRDTE(,COCWPTR)                              0788
         CLI   RPRENTRY(@10),X'70'                                 0788
         BNE   @RF00788                                            0788
         B     DOHCNCB                                             0790
*                 ELSE IF RPRENTRY=RPRENTLC  /* IF DEST IS LOCAL */
*                        THEN  /*SEGMENT(DOLDNCB)REQUEST*/DO;GOTO DOLDN
*B;DOLDNCB#:END; /*BUILD LDNCB*/                                   0792
         B     @RC00788                                            0792
@RF00788 L     @10,OCWDRDTE(,COCWPTR)                              0792
         CLI   RPRENTRY(@10),X'45'                                 0792
         BNE   @RF00792                                            0792
         B     DOLDNCB                                             0794
*/* CHECK ADDED FOR DANE ENTRY                               @D32CKXY*/
*                        ELSE IF RPRENTRY=RPRENTRN × /* 370X @D32CKXY*/
*                               RPRENTRY=RPRENTDA /* OR DANE @D32CKXY*/
*                              THEN  /*SEGMENT(DOICNCB)REQUEST*/DO;GOTO
         B     @RC00792                                            0796
@RF00792 L     @10,OCWDRDTE(,COCWPTR)                              0796
         CLI   RPRENTRY(@10),X'01'                                 0796
         BE    @RT00796                                            0796
         CLI   RPRENTRY(@10),X'51'                                 0796
         BNE   @RF00796                                            0796
@RT00796 DS    0H                                                  0797
*DOICNCB;DOICNCB#:END;                                             0798
         B     DOICNCB                                             0798
*                              ELSE IF RPRENTRY=RPRENTLU           0800
*                                   THEN  /*SEGMENT(DOLUNCB)REQUEST*/DO
         B     @RC00796                                            0800
@RF00796 L     @10,OCWDRDTE(,COCWPTR)                              0800
         CLI   RPRENTRY(@10),X'81'                                 0800
         BNE   @RF00800                                            0800
*GOTO DOLUNCB;DOLUNCB#:END;                                        0802
         B     DOLUNCB                                             0802
*                                   ELSE IF RPRENTRY=RPRENTCC      0804
*                                        THEN  /*SEGMENT(DOCCNCB)REQUES
**/DO;GOTO DOCCNCB;DOCCNCB#:END;                                   0804
         B     @RC00800                                            0804
@RF00800 L     @10,OCWDRDTE(,COCWPTR)                              0804
         CLI   RPRENTRY(@10),X'71'                                 0804
         BNE   @RF00804                                            0804
         B     DOCCNCB                                             0806
*ELSE CINTCODE = 24;                                               0808
         B     @RC00804                                            0808
@RF00804 LA    CINTCODE,24                                         0808
*        IF CINTCODE = 0                                           0809
*          THEN  CNCBCORE = '1'B;   /* SET NCB CORE OBTAINED FLAG */
@RC00804 DS    0H                                                  0809
@RC00800 DS    0H                                                  0809
@RC00796 DS    0H                                                  0809
@RC00792 DS    0H                                                  0809
@RC00788 DS    0H                                                  0809
@RC00784 LTR   CINTCODE,CINTCODE                                   0809
         BNZ   @RF00809                                            0809
         OI    CNCBCORE(COCWPTR),B'01000000'                       0810
*          ELSE;                                                   0811
@RF00809 DS    0H                                                  0812
*       END;                                                       0812
*  ELSE;   /* DO NOT BUILD ANY NCB'S */                            0813
@RF00782 DS    0H                                                  0814
*  /*SEGMENT(DOXNCB)FINISH*/DO;GOTO DOXNCB#;DOXNCB@:END;           0814
         B     DOXNCB#                                             0815
DOXNCB@  DS    0H                                                  0817
*  /*SEGMENT(DOICNCB)START*/DO;GOTO DOICNCB@;DOICNCB:END;          0817
         B     DOICNCB@                                            0818
DOICNCB  DS    0H                                                  0820
*/*********************************************************************
*/*  GET ICNCB CORE & INIT ICNCB DEPENDENT FIELDS                     *
*/*  SAVE ICNCB ADDR IN OCW                                           *
*/*  STORE ICNCB LENGTH(DBL WRDS) & ID IN THE ICNCB                   *
*/*  COPY UCB/PUB ADDR FROM RDTE                                      *
*/*  SET ICNCB SICK FLAG  & ICN START IN PROGRESS FLAG                *
*/*   IF CORE WAS NOT OBTAINED                                        *
*/*     THEN SET INTERNAL CODE TO INDICATE FMCB/NCB CORE              *
*/*          SO THAT OPEN WILL FAIL                                   *
*/*********************************************************************
*CBSIZE = ((LENGTH(ISTICNCB)+7)×7)&&7;   /* ICNCB SIZE ( MLTPLE OF 8 )*
         MVC   CBSIZE(2,COCWPTR),@CH05547                          0820
* /*GETSTOR SIZE(CBSIZE)TYPE(FIXED)SAVE(YES)CLEAR(YES)*/           0821
*  DO;                                                             0821
*/* ATBUILD (ISTPAB,ISTDYPAB,ISTATCVT,ISTRPH)  */                  0822
*/* END OF ATBUILD */                                              0822
* RFY (GPR00P,GPR01P,GPR02P,GPR03P) RSTD;                          0822
* RFY ISTRPH BASED(GPR01P);                                        0823
* GEN REFS(GPR02P,GPR03P,GPR04P,GPR05P,                            0824
*          GPR06P,GPR07P,GPR08P,GPR09P,                            0824
*          GPR10P,GPR11P,GPR12P,GPR13P)                            0824
*     SETS(RPHWORK);                                               0824
*                                                                  0824
         STM   GPR02P,GPR13P,RPHWORK(GPR01P)        SAVE REGISTERS
* GPR00F = CBSIZE;                                     /*SIZE IN REG0*/
         LH    GPR00F,CBSIZE(,COCWPTR)                             0825
* DCL 1 CMZA0099 FIXED(31) STATIC LOCAL,                           0826
*       2 * FIXED(8) INIT(96),                       /* OPTION FLAGS */
*       2 * FIXED(8) INIT(96),                        /* STORAGE KEY */
*       2 * FIXED(8) INIT(227),                    /* SUBPOOL NUMBER */
*       2 * FIXED(8) INIT('00'X);                    /* REQUEST TYPE */
* GPR03F = CMZA0099;                                               0827
*                                                                  0827
         L     GPR03F,CMZA0099                                     0827
* DO; /* LISATCVT CVTBASE(PAGEABLE,(GPR02P)) */                    0828
*   GPR02P = ATCLCPTR; /*SET UP ATCVT POINTER*/                    0829
         L     GPR02P,ATCLCPTR                                     0829
* END; /*LISATCVT*/                                                0830
* CALL GPR02P -> ATCGTSTR;                            /*CALL ISTORFSR*/
         L     @15,ATCGTSTR(,GPR02P)                               0831
         BALR  @14,@15                                             0831
* RFY (GPR00P,GPR01P,GPR02P,GPR03P) UNRSTD;                        0832
* END ;                                              /*END OF GETSTOR*/
* /* GET CORE                                                      0834
*   FOR ICNCB */                                                   0834
*RFY CREG15 RSTD;                                          /*@D31KKMP*/
*IF CREG15 =0   /* IF CORE OBTAINED */                             0835
*  THEN DO;                                                        0835
         LTR   CREG15,CREG15                                       0835
         BNZ   @RF00835                                            0835
*        OCWNCB = RPHSRPRM;  /* SAVE ICNCB PTR */                  0837
         L     @14,RPHSRPRM(,GPR01P)                               0837
         ST    @14,OCWNCB(,COCWPTR)                                0837
*        NCBTYPE = ICTYPE;   /* STORE  ICNCB ID */                 0838
         MVI   NCBTYPE(@14),X'06'                                  0838
*        NCBLNGTH = CBSIZE/8;   /* STORE ICNCB LENGTH IN DBLE WORDS */
*                                                                  0839
         LH    @10,CBSIZE(,COCWPTR)                                0839
         SRL   @10,3                                               0839
         STC   @10,NCBLNGTH(,@14)                                  0839
*        /*------------------------------------------------- @D31KKMP*/
*        /* THIS MODIFICATION WAS FOR DCR-3412.2             @D31KKMP*/
*        /*------------------------------------------------- @D31KKMP*/
*        NCBCONF = '1'B;      /* SET CONFIG SICK FLAG        @D31KKMP*/
         OI    NCBCONF(@14),B'01000000'                            0840
*/* COPY DEST CUA FROM DANE FIELD IF DANE ENTRY              @D32CKXY*/
*      IF RPRENTRY=RPRENTDA                                        0841
*        THEN DO;                                          /*@D32CKXY*/
         L     @10,OCWDRDTE(,COCWPTR)                              0841
         CLI   RPRENTRY(@10),X'51'                                 0841
         BNE   @RF00841                                            0841
*        ICNCUUA=RDADACUA;                                 /*@D32CKXY*/
         SLR   @07,@07                                             0843
         ICM   @07,7,RDADACUA(@10)                                 0843
         ST    @07,ICNCUUA(,@14)                                   0843
*        ICNLCLUS='1'B;       /* SET LCL CLUSTER BIT-DCR3847 @D32CKXY*/
         L     @10,ICNLCLUS-1(,@14)                                0844
@GL00015 LR    @07,@10                                             0844
         O     @07,@CF05577                                        0844
         CS    @10,@07,ICNLCLUS-1(@14)                             0844
         BNE   @GL00015                                            0844
*        END;                                              /*@D32CKXY*/
*        ELSE                                              /*@D32CKXY*/
*        ICNCUUA = RRNRNCUA;  /* COPY CUA FROM RDTE(RN) TO ICNCB */
*                                                                  0846
         B     @RC00841                                            0846
@RF00841 L     @14,OCWNCB(,COCWPTR)                                0846
         L     @10,OCWDRDTE(,COCWPTR)                              0846
         SLR   @07,@07                                             0846
         ICM   @07,7,RRNRNCUA(@10)                                 0846
         ST    @07,ICNCUUA(,@14)                                   0846
*        /*------------------------------------------------- @D31KKMP*/
*        /* THIS MODIFICATION WAS FOR DCR-3337.0             @D31KKMP*/
*        /*------------------------------------------------- @D31KKMP*/
*        ICNSTART = '1'B;   /* ICN START IN PROGRESS         @D31KKMP*/
*                                                                  0847
@RC00841 L     @07,OCWNCB(,COCWPTR)                                0847
         L     @14,ICNSTART(,@07)                                  0847
@GL00016 LR    @10,@14                                             0847
         O     @10,@CF05580                                        0847
         CS    @14,@10,ICNSTART(@07)                               0847
         BNE   @GL00016                                            0847
*       END;                                                       0848
*  ELSE CINTCODE = 4;  /* SET INTRNL CODE = NO ICNCB CORE */       0849
         B     @RC00835                                            0849
@RF00835 LA    CINTCODE,4                                          0849
*RFY CREG15 UNRSTD;                                        /*@D31KKMP*/
@RC00835 DS    0H                                                  0851
*  /*SEGMENT(DOICNCB)FINISH*/DO;GOTO DOICNCB#;DOICNCB@:END;        0851
         B     DOICNCB#                                            0852
DOICNCB@ DS    0H                                                  0854
*  /*SEGMENT(DOHCNCB)START*/DO;GOTO DOHCNCB@;DOHCNCB:END;          0854
         B     DOHCNCB@                                            0855
DOHCNCB  DS    0H                                                  0857
*/*********************************************************************
*/* GET HCNCB CORE & INIT HCNCB DEPENDENT FIELDS                      *
*/* SAVE HCNCB ADDR IN OCW                                            *
*/* STORE HCNCB LENGTH(DBL WRDS) & ID IN HCNCB                        *
*/*********************************************************************
*CBSIZE = ((LENGTH(ISTHCNCB)+7)×7)&&7;      /* HCNCB SIZE    @ZM32229*/
         MVC   CBSIZE(2,COCWPTR),@CH05551                          0857
* /*GETSTOR SIZE(CBSIZE)TYPE(FIXED)CLEAR(YES)SAVE(YES)*/           0858
*  DO;                                                             0858
*/* ATBUILD (ISTPAB,ISTDYPAB,ISTATCVT,ISTRPH)  */                  0859
*/* END OF ATBUILD */                                              0859
* RFY (GPR00P,GPR01P,GPR02P,GPR03P) RSTD;                          0859
* RFY ISTRPH BASED(GPR01P);                                        0860
* GEN REFS(GPR02P,GPR03P,GPR04P,GPR05P,                            0861
*          GPR06P,GPR07P,GPR08P,GPR09P,                            0861
*          GPR10P,GPR11P,GPR12P,GPR13P)                            0861
*     SETS(RPHWORK);                                               0861
*                                                                  0861
         STM   GPR02P,GPR13P,RPHWORK(GPR01P)        SAVE REGISTERS
* GPR00F = CBSIZE;                                     /*SIZE IN REG0*/
         LH    GPR00F,CBSIZE(,COCWPTR)                             0862
* DCL 1 CMZA0119 FIXED(31) STATIC LOCAL,                           0863
*       2 * FIXED(8) INIT(96),                       /* OPTION FLAGS */
*       2 * FIXED(8) INIT(96),                        /* STORAGE KEY */
*       2 * FIXED(8) INIT(227),                    /* SUBPOOL NUMBER */
*       2 * FIXED(8) INIT('00'X);                    /* REQUEST TYPE */
* GPR03F = CMZA0119;                                               0864
*                                                                  0864
         L     GPR03F,CMZA0119                                     0864
* DO; /* LISATCVT CVTBASE(PAGEABLE,(GPR02P)) */                    0865
*   GPR02P = ATCLCPTR; /*SET UP ATCVT POINTER*/                    0866
         L     GPR02P,ATCLCPTR                                     0866
* END; /*LISATCVT*/                                                0867
* CALL GPR02P -> ATCGTSTR;                            /*CALL ISTORFSR*/
         L     @15,ATCGTSTR(,GPR02P)                               0868
         BALR  @14,@15                                             0868
* RFY (GPR00P,GPR01P,GPR02P,GPR03P) UNRSTD;                        0869
* END ;                                              /*END OF GETSTOR*/
*RFY CREG15 RSTD;                                          /*@D31KKMP*/
*IF CREG15 = 0   /* IF CORE OBTAINED */                            0872
*  THEN DO;                                                        0872
         LTR   CREG15,CREG15                                       0872
         BNZ   @RF00872                                            0872
*        OCWNCB = RPHSRPRM;  /* SAVE HCNCB PTR */                  0874
         L     @14,RPHSRPRM(,GPR01P)                               0874
         ST    @14,OCWNCB(,COCWPTR)                                0874
*        NCBLNGTH = (((LENGTH(ISTHCNCB)+7)×7)&&7)/8;   /* STORE HCNCB
*                                                  SIZE IN DBLE WORDS *
         MVI   NCBLNGTH(@14),X'0F'                                 0875
*        NCBTYPE = HCTYPE;              /* STORE HCNCB ID */       0876
         MVI   NCBTYPE(@14),X'14'                                  0876
*        DNCLICP = CDEVCLIM;   /* DEVC SCHED LIM */                0877
         MVI   DNCLICP(@14),X'02'                                  0877
*        RFY ISTPAB BASED(ADDR(DNCZC001));  /* GET PAB BASE  @XM06744*/
*        PABNODQ = '1'B;  /* DO NOT DEQ PAB WORK ELMNT       @XM06744*/
         LA    @10,96                                              0879
         ALR   @10,@14                                             0879
         OI    PABNODQ(@10),B'00000001'                            0879
*        PABOFFST = ADDR(DNCZC001) - OCWNCB;   /* CALC PAB OFFSET */
         LA    @07,DNCZC001(,@14)                                  0880
         SLR   @07,@14                                             0880
         STC   @07,PABOFFST(,@10)                                  0880
*        PABDVTA = ADDR(ATCZDVT6);   /* ADDR DVT PTR IN VTAM CVT */
         L     @07,OCWACVT(,COCWPTR)                               0881
         LA    @07,ATCZDVT6(,@07)                                  0881
         STCM  @07,7,PABDVTA(@10)                                  0881
*        DNCZV004 = ADDR(ATCZDVT6);                                0882
         ST    @07,DNCZV004(,@14)                                  0882
*       END;                                                       0883
*  ELSE DO;                                                        0884
         B     @RC00872                                            0884
@RF00872 DS    0H                                                  0885
*        CINTCODE = 4;  /* SET INTRNL FLAG = NO CORE AVAILABLE */  0885
         LA    CINTCODE,4                                          0885
*       END;                                                       0886
*RFY CREG15 UNRSTD;                                        /*@D31KKMP*/
@RC00872 DS    0H                                                  0888
*  /*SEGMENT(DOHCNCB)FINISH*/DO;GOTO DOHCNCB#;DOHCNCB@:END;        0888
         B     DOHCNCB#                                            0889
DOHCNCB@ DS    0H                                                  0891
*  /*SEGMENT(DOLDNCB)START*/DO;GOTO DOLDNCB@;DOLDNCB:END;          0891
         B     DOLDNCB@                                            0892
DOLDNCB  DS    0H                                                  0894
*/*********************************************************************
*/* GET LDNCB CORE & INIT LDNCB DEPENDENT FIELDS                      *
*/* SAVE LDNCB ADDR IN OCW                                            *
*/* STORE LDNCB LENGTH(DBL WRDS) & ID IN LDNCB                        *
*/* COPY UCB/PUB ADDR FROM RDTE                                       *
*/*  IF NO CORE WAS OBTAINED OR BUFFER THRESHOLD EXCEEDED             *
*/*    THEN SET INTERNAL CODE TO INDICATE NO FMCB/NCB CORE            *
*/*         SO THAT OPEN DEST WILL FAIL                               *
*/*********************************************************************
*                                                                  0894
*/*--------------------------------------------------------- @D31KKMP*/
*/* THIS MODIFICATION WAS FOR DCR-3615.0                     @D31KKMP*/
*/*--------------------------------------------------------- @D31KKMP*/
*CBSIZE = ((LENGTH(ISTLDNCB)+7)×7)&&7; /* ICNCB - MUL OF 8   @D31KKMP*/
         MVC   CBSIZE(2,COCWPTR),@CH05555                          0894
* /*GETSTOR SIZE(CBSIZE)TYPE(FIXED)CLEAR(YES)SAVE(YES)*/           0895
*  DO;                                                             0895
*/* ATBUILD (ISTPAB,ISTDYPAB,ISTATCVT,ISTRPH)  */                  0896
*/* END OF ATBUILD */                                              0896
* RFY (GPR00P,GPR01P,GPR02P,GPR03P) RSTD;                          0896
* RFY ISTRPH BASED(GPR01P);                                        0897
* GEN REFS(GPR02P,GPR03P,GPR04P,GPR05P,                            0898
*          GPR06P,GPR07P,GPR08P,GPR09P,                            0898
*          GPR10P,GPR11P,GPR12P,GPR13P)                            0898
*     SETS(RPHWORK);                                               0898
*                                                                  0898
         STM   GPR02P,GPR13P,RPHWORK(GPR01P)        SAVE REGISTERS
* GPR00F = CBSIZE;                                     /*SIZE IN REG0*/
         LH    GPR00F,CBSIZE(,COCWPTR)                             0899
* DCL 1 CMZA0139 FIXED(31) STATIC LOCAL,                           0900
*       2 * FIXED(8) INIT(96),                       /* OPTION FLAGS */
*       2 * FIXED(8) INIT(96),                        /* STORAGE KEY */
*       2 * FIXED(8) INIT(227),                    /* SUBPOOL NUMBER */
*       2 * FIXED(8) INIT('00'X);                    /* REQUEST TYPE */
* GPR03F = CMZA0139;                                               0901
*                                                                  0901
         L     GPR03F,CMZA0139                                     0901
* DO; /* LISATCVT CVTBASE(PAGEABLE,(GPR02P)) */                    0902
*   GPR02P = ATCLCPTR; /*SET UP ATCVT POINTER*/                    0903
         L     GPR02P,ATCLCPTR                                     0903
* END; /*LISATCVT*/                                                0904
* CALL GPR02P -> ATCGTSTR;                            /*CALL ISTORFSR*/
         L     @15,ATCGTSTR(,GPR02P)                               0905
         BALR  @14,@15                                             0905
* RFY (GPR00P,GPR01P,GPR02P,GPR03P) UNRSTD;                        0906
* END ;                                              /*END OF GETSTOR*/
*  /*@DM09359*/                                                    0908
*                                                                  0908
*RFY CREG15 RSTD;                                          /*@D31KKMP*/
*IF CREG15 = 0   /* IF CORE OBTAINED */                            0909
*  THEN DO;                                                        0909
         LTR   CREG15,CREG15                                       0909
         BNZ   @RF00909                                            0909
*        OCWNCB = RPHSRPRM;   /* SAVE LDNCB PTR */                 0911
         L     @14,RPHSRPRM(,GPR01P)                               0911
         ST    @14,OCWNCB(,COCWPTR)                                0911
*        NCBLNGTH = (((LENGTH(ISTLDNCB)+7)×7)&&7)/8;  /* STORE LDNCB
*                                                  SIZE IN DBLE WORDS *
         MVI   NCBLNGTH(@14),X'49'                                 0912
*        NCBTYPE = LDTYPE;              /* STORE LDNCB ID */       0913
         MVI   NCBTYPE(@14),X'07'                                  0913
*        NCBCONF = '1'B;          /*SET SICK FLAG-DCR 3844.1 @D31KKQM*/
         OI    NCBCONF(@14),B'01000000'                            0914
*        LDNCUUA = RLCLCCUA;    /* COPY CUA FROM RDTE(LOCAL) TO LDNCB *
         L     @10,OCWDRDTE(,COCWPTR)                              0915
         SLR   @07,@07                                             0915
         ICM   @07,7,RLCLCCUA(@10)                                 0915
         ST    @07,LDNCUUA(,@14)                                   0915
*       END;                                                       0916
*  ELSE CINTCODE = 4;   /* SET INTRNL FLAG = NO CORE AVAILABLE */  0917
         B     @RC00909                                            0917
@RF00909 LA    CINTCODE,4                                          0917
*RFY CREG15 UNRSTD;                                        /*@D31KKMP*/
@RC00909 DS    0H                                                  0919
*  /*SEGMENT(DOLDNCB)FINISH*/DO;GOTO DOLDNCB#;DOLDNCB@:END;        0919
         B     DOLDNCB#                                            0920
DOLDNCB@ DS    0H                                                  0922
*  /*SEGMENT(DODNCB)START*/DO;GOTO DODNCB@;DODNCB:END;             0922
         B     DODNCB@                                             0923
DODNCB   DS    0H                                                  0925
*/*********************************************************************
*/* GET DNCB CORE & INIT DNCB DEPENDENT FIELDS                        *
*/* SAVE DNCB ADDR IN OCW                                             *
*/* STORE DNCB LENGTH(DBL WRDS) & ID IN DNCB                          *
*/*********************************************************************
* /*REQSTORE CBID(DNCB)CLEAR(YES)SAVE(YES)*/                       0925
*  DO;                                                             0925
*/* ATBUILD (ISTDYPAB,ISTATCVT,ISTRPH)  */                         0926
*/* END OF ATBUILD */                                              0926
*                                                                  0926
* RFY (GPR02P,GPR03P,GPR04P,GPR15P) RSTD;                          0926
*                                                                  0926
* RFY (GPR01P,GPR13P) RSTD;                                        0927
*          GENERATE REFS(GPR01P,GPR02P,GPR13P) SETS(RPHWORK);      0928
*                                                                  0928
           STM GPR02P,GPR13P,RPHWORK(GPR01P)
* RFY (GPR01P,GPR13P) UNRSTD;                                      0929
*                                                                  0929
* DO; /* LISATCVT CVTBASE(PAGEABLE,(GPR15P)) */                    0930
*   GPR15P = ATCLCPTR; /*SET UP ATCVT POINTER*/                    0931
         L     GPR15P,ATCLCPTR                                     0931
* END; /*LISATCVT*/                                                0932
*          GPR02P=GPR15P->ATCBPDA × '80000000'X;                   0933
         L     GPR02P,ATCBPDA(,GPR15P)                             0933
         O     GPR02P,@CF02254                                     0933
*          DCL 1 FMZA0159 FIXED(31) STATIC LOCAL,                  0934
*              2 *        FIXED(8) INIT(152),                      0934
*              2 *        PTR(24) INIT(0);                         0934
*          GPR03F=FMZA0159;                                        0935
         L     GPR03F,FMZA0159                                     0935
*          GPR04F=26;                                              0936
         LA    GPR04F,26                                           0936
*          GPR15P=GPR15P->ATCSMRQ;                                 0937
         L     GPR15P,ATCSMRQ(,GPR15P)                             0937
*          DCL FMZL0159 BASED(GPR15P) LABEL VALUERANGE(*);         0938
*          CALL FMZL0159;                                          0939
*                                                                  0939
         BALR  @14,@15                                             0939
* RFY (GPR13P) RSTD;                                               0940
*          GENERATE REFS(GPR01P,RPHWORK) SETS(GPR02P,GPR13P);      0941
*                                                                  0941
           LM GPR02P,GPR13P,RPHWORK(GPR01P)
* RFY (GPR13P) UNRSTD;                                             0942
*                                                                  0942
* RFY (GPR02P,GPR03P,GPR04P,GPR15P) UNRSTD;                        0943
* END ;    /********* END OF REQSTORE EXPANSION **********/    /* GET D
*CB CORE */                                                        0944
*RFY CREG15 RSTD;                                          /*@D31KKMP*/
*IF CREG15 = 0   /* IF CORE OBTAINED */                            0946
*  THEN DO;                                                        0946
         LTR   CREG15,CREG15                                       0946
         BNZ   @RF00946                                            0946
*        OCWNCB = RPHSRPRM;  /* SAVE DNCB PTR */                   0948
         L     @14,RPHSRPRM(,GPR01P)                               0948
         ST    @14,OCWNCB(,COCWPTR)                                0948
*        NCBLNGTH = (((LENGTH(ISTDNCB)+7)×7)&&7)/8;  /* STORE DNCB 0949
*                                                  SIZE IN DBLE WORDS *
         MVI   NCBLNGTH(@14),X'0E'                                 0949
*        NCBTYPE = DNTYPE;              /* STORE DNCB ID */        0950
         MVI   NCBTYPE(@14),X'05'                                  0950
*        DNCLICP = CDEVCLIM;   /* DEVC SCHED LIM */                0951
         MVI   DNCLICP(@14),X'02'                                  0951
*        RFY ISTPAB BASED(ADDR(DNCZC001));   /* ESTABL PAB BASE */ 0952
*        PABNODQ = '1'B;   /* DO NOT DEQ PAB WORK ELEMENT */       0953
         LA    @10,96                                              0953
         ALR   @10,@14                                             0953
         OI    PABNODQ(@10),B'00000001'                            0953
*        PABOFFST = ADDR(DNCZC001) - OCWNCB;  /* CALC PAB OFFSET */
         LA    @07,DNCZC001(,@14)                                  0954
         SLR   @07,@14                                             0954
         STC   @07,PABOFFST(,@10)                                  0954
*        IF RPRNSNEA->RPRENTRY = RPRENTLC   /* IF DEST IS LOCAL 3270 */
*          THEN DO;                                                0955
         L     @07,OCWDRDTE(,COCWPTR)                              0955
         L     @07,RPRNSNEA(,@07)                                  0955
         CLI   RPRENTRY(@07),X'45'                                 0955
         BNE   @RF00955                                            0955
*                PABDVTA = ADDR(ATCZDVTA);  /*ADDR DVT PTR IN VTAM CVT*
         L     @07,OCWACVT(,COCWPTR)                               0957
         LA    @07,ATCZDVTA(,@07)                                  0957
         STCM  @07,7,PABDVTA(@10)                                  0957
*                DNCZV004 = ADDR(ATCZDVTA);                        0958
         ST    @07,DNCZV004(,@14)                                  0958
*               END;                                               0959
*                                                                  0959
*          ELSE DO;                                        /*@D31KKMP*/
         B     @RC00955                                            0960
@RF00955 DS    0H                                                  0961
*                /*----------------------------------------- @D31KKMP*/
*                /* THESE MODIFICATIONS WERE FOR 3270 S/R    @D31KKMP*/
*                /*----------------------------------------- @D31KKMP*/
*                IF RCPRBASC='1'B &  /* IF BASIC AS1-7428-K  @D31KKMP*/
*                   RCPRRECD='1'B    /* RECORD MODE          @D31KKMP*/
*                  THEN DO;          /*                      @D31KKMP*/
         L     @14,OCWDRDTE(,COCWPTR)                              0961
         TM    RCPRBASC(@14),B'11000000'                           0961
         BNO   @RF00961                                            0961
*                        /* ADDR OF DVT PTR IN VTAM CVT      @D31KKMP*/
*                        PABDVTA =ADDR(ATCZDVTB);        /* @D31KKMP*/
         L     @14,OCWNCB(,COCWPTR)                                0963
         L     @10,OCWACVT(,COCWPTR)                               0963
         LA    @10,ATCZDVTB(,@10)                                  0963
         STCM  @10,7,PABDVTA+96(@14)                               0963
*                        DNCZV004=ADDR(ATCZDVTB);        /* @D31KKMP*/
         ST    @10,DNCZV004(,@14)                                  0964
*                       END;                             /* @D31KKMP*/
*                  ELSE DO;                              /* @D31KKMP*/
         B     @RC00961                                            0966
@RF00961 DS    0H                                                  0967
*                        /* ADDR OF DVT PTR IN VTAM CVT */         0967
*                        PABDVTA=ADDR(ATCZDVT6);                   0967
         L     @14,OCWNCB(,COCWPTR)                                0967
         L     @10,OCWACVT(,COCWPTR)                               0967
         LA    @10,ATCZDVT6(,@10)                                  0967
         STCM  @10,7,PABDVTA+96(@14)                               0967
*                        DNCZV004=ADDR(ATCZDVT6);                  0968
         ST    @10,DNCZV004(,@14)                                  0968
*                       END;                              /* @D31KKMP*/
*                                                                  0969
*               END;                                               0970
@RC00961 DS    0H                                                  0971
*/********************************************************************/
*/*   IF RDTE MARKED ALLOCATABLE                             @DM09425*/
*/*     THEN COPY BHSET ID FROM RDTE TO DNCB                 @DM09425*/
*/*     ELSE SET NULL BHSET ID INTO DNCB                     @DM09425*/
*/*   IF DIAL-IN PORT SOLICITOR BEING OPENED                         */
*/*     THEN 1. SET DIAL-IN PORT FLAG                                */
*/*          2. COPY THE PORT SOL'S FMCB PTR                         */
*/********************************************************************/
*        IF RPRAOPN = '1'B            /* IF ALLOCATABLE      @DM09425*/
*          THEN                       /*                     @DM09425*/
@RC00955 L     @14,OCWDRDTE(,COCWPTR)                              0971
         TM    RPRAOPN(@14),B'00100000'                            0971
         BNO   @RF00971                                            0971
*          DNCBHSET=RCPBHSI2;         /* COPY BHSET ID       @DM09425*/
         L     @10,OCWNCB(,COCWPTR)                                0972
         MVC   DNCBHSET(1,@10),RCPBHSI2(@14)                       0972
*          ELSE                       /* SET NULL BHSET ID   @DM09425*/
*          DNCBHSET='00'X;            /*                     @DM09425*/
         B     @RC00971                                            0973
@RF00971 L     @14,OCWNCB(,COCWPTR)                                0973
         MVI   DNCBHSET(@14),X'00'                                 0973
*        IF NIBMODE = PSOLMODE   /* IF PORT SOL BEING OPND   @XM06663*/
*          THEN DO;                                        /*@XM06663*/
@RC00971 CLC   NIBMODE+112(8,COCWPTR),@CC03601                     0974
         BNE   @RF00974                                            0974
*                DNCPSOL = '1'B;  /* SET DIAL-IN PORT        @XM06663*/
         L     @14,OCWNCB(,COCWPTR)                                0976
         OI    DNCPSOL(@14),B'00001000'                            0976
*                NCBFMCBP = OCWFMCB; /* COPY PORT SOL FMCB@  @XM06663*/
         MVC   NCBFMCBP(4,@14),OCWFMCB(COCWPTR)                    0977
*               END;                                       /*@XM06663*/
*          ELSE;                                           /*@XM06663*/
@RF00974 DS    0H                                                  0980
*       END;                                                       0980
*/*********************************************************************
*/*  IF CORE NOT OBTAINED OR BUFFER THRESHOLD EXCEEDED                *
*/*     THEN SET INTERNAL CODE TO INDICATE NO FMCB/NCB CORE           *
*/*          SO THAT OPEN DEST WILL FAIL                              *
*/*********************************************************************
*  ELSE DO;                                                        0981
         B     @RC00946                                            0981
@RF00946 DS    0H                                                  0982
*        IF CREG15 = 4                                             0982
*          THEN  /*RELSTORE BUFADDR(RPHSRPRM)*/                    0982
         CH    CREG15,@CH00055                                     0982
         BNE   @RF00982                                            0982
*                 DO;                                              0983
*/* ATBUILD (ISTATCVT,ISTRPH)  */                                  0984
*/* END OF ATBUILD */                                              0984
*                RFY (GPR02P,GPR03P,GPR04P,GPR15P) RSTD;           0984
*         RFY (GPR01P,GPR13P) RSTD;                                0985
*         GENERATE REFS(GPR01P,GPR02P,GPR13P) SETS(RPHWORK);       0986
*                                                                  0986
          STM GPR02P,GPR13P,RPHWORK(GPR01P)
*         RFY GPR13P UNRSTD;                                       0987
*         GPR04P=RPHSRPRM;                                         0988
         L     GPR04P,RPHSRPRM(,GPR01P)                            0988
*         DCL 1 FMZA0178 FIXED(31) STATIC LOCAL,                   0989
*             2 * FIXED(8) INIT(64),                               0989
*             2 * PTR(24) INIT(0);                                 0989
*         GPR03F = FMZA0178;                                       0990
*                                                                  0990
         L     GPR03F,FMZA0178                                     0990
*                DO; /* LISATCVT CVTBASE(PAGEABLE,(GPR15P)) */     0991
*                  GPR15P = ATCLCPTR; /*SET UP ATCVT POINTER*/     0992
         L     GPR15P,ATCLCPTR                                     0992
*                END; /*LISATCVT*/                                 0993
*         GPR02P = GPR15P->ATCBPDA;                                0994
         L     GPR02P,ATCBPDA(,GPR15P)                             0994
*         GPR15P=GPR15P->ATCSMRS;                                  0995
         L     GPR15P,ATCSMRS(,GPR15P)                             0995
*         DCL FMZL0178 BASED(GPR15P) LABEL VALUERANGE(*);          0996
*         CALL FMZL0178;                                           0997
         BALR  @14,@15                                             0997
*         RFY GPR13P RSTD;                                         0998
*         GENERATE REFS(GPR01P,RPHWORK) SETS(GPR02P,GPR13P);       0999
*                                                                  0999
          LM GPR02P,GPR13P,RPHWORK(GPR01P)
*         RFY (GPR01P,GPR13P) UNRSTD;                              1000
*                RFY (GPR02P,GPR03P,GPR04P,GPR15P) UNRSTD;         1001
*                END ;/**********END OF RELSTORE EXPANSION**********/
*          ELSE;                                                   1003
@RF00982 DS    0H                                                  1004
*        CINTCODE = 4;   /* SET INTRNL FLAG = NO CORE AVAILABLE */ 1004
         LA    CINTCODE,4                                          1004
*       END;                                                       1005
*RFY CREG15 UNRSTD;                                        /*@D31KKMP*/
@RC00946 DS    0H                                                  1007
*  /*SEGMENT(DODNCB)FINISH*/DO;GOTO DODNCB#;DODNCB@:END;           1007
         B     DODNCB#                                             1008
DODNCB@  DS    0H                                                  1010
*  /*SEGMENT(DONCB)START*/DO;GOTO DONCB@;DONCB:END;                1010
         B     DONCB@                                              1011
DONCB    DS    0H                                                  1013
*/*********************************************************************
*/*   IF NO ERROR OCCURRED PREVIOUSLY                                 *
*/*     THEN INIT  FIELDS COMMON TO ALL NCB'S                         *
*/*     ELSE NO INITIALIZATION IS DONE BECAUSE OPEN DEST FAILED       *
*/*********************************************************************
*IF CINTCODE = 0   /* IF NO ERRORS OCCURRED */                     1013
*  THEN DO;                                                        1013
         LTR   CINTCODE,CINTCODE                                   1013
         BNZ   @RF01013                                            1013
*/*********************************************************************
*/*   COPY DEVICE CHARACTERISTICS & I/O TRACE FLAG FROM RDTE          *
*/*  IF THE DAF IS ZERO                                               *
*/*    THEN COPY THE DAF FROM RDTE                                    *
*/*    ELSE LEAVE IT ALONE                                            *
*/*********************************************************************
*        NCBDEVCH = RPRDEVCH;                                      1015
         L     @10,OCWNCB(,COCWPTR)                                1015
         L     @07,OCWDRDTE(,COCWPTR)                              1015
         MVC   NCBDEVCH(8,@10),RPRDEVCH(@07)                       1015
*        IF RPRENTIO = '1'B      /* COPY I/O TRACE BIT FROM RDTE */
*          THEN NCBFTRIO = '1'B;                                   1016
         TM    RPRENTIO(@07),B'00001000'                           1016
         BNO   @RF01016                                            1016
         MVI   NCBFTRIO(@10),X'01'                                 1017
*          ELSE NCBFTRIO = '0'B;                                   1018
         B     @RC01016                                            1018
@RF01016 L     @10,OCWNCB(,COCWPTR)                                1018
         MVI   NCBFTRIO(@10),X'00'                                 1018
*/* MOVE REAL NETWORK ADDR FROM RDTE TO NCB                  @D32CKXY*/
*      NCBSWDAF=RPRSWDAF;                                  /*@D32CKXY*/
@RC01016 L     @10,OCWNCB(,COCWPTR)                                1019
         L     @07,OCWDRDTE(,COCWPTR)                              1019
         MVC   NCBSWDAF(2,@10),RPRSWDAF(@07)                       1019
*        IF NCBDAF = '0000'X   /* IF NCB DAF = 0 */                1020
*          THEN DO;                                                1020
         CLC   NCBDAF(2,@10),@CB03582                              1020
         BNE   @RF01020                                            1020
*                NCBDAF = RPRDAF;   /* COPY DEST ADDR FIELD FROM RDTE *
         MVC   NCBDAF(2,@10),RPRDAF(@07)                           1022
*                NCBTSKID = ATCCDTID; /*COPY VTAM TASKID           1023
*                                      FROM VTAM CVT         @DM03693*/
         L     @07,OCWACVT(,COCWPTR)                               1023
         MVC   NCBTSKID(4,@10),ATCCDTID(@07)                       1023
*               END;                                       /*@DM03693*/
*          ELSE IF NCBTYPE = LUTYPE /*IF LU NCB FOUND        @DM03693*/
*                 THEN NCBTSKID = RAPACDEB->ACDTSKID; /*COPY       1025
*                                     DEB TASKID TO NCB      @DM03693*/
         B     @RC01020                                            1025
@RF01020 L     @10,OCWNCB(,COCWPTR)                                1025
         CLI   NCBTYPE(@10),X'25'                                  1025
         BNE   @RF01025                                            1025
         L     @07,OCWARDTE(,COCWPTR)                              1026
         L     @07,RAPACDEB(,@07)                                  1026
         MVC   NCBTSKID(4,@10),ACDTSKID(@07)                       1026
*       END;                                                       1027
*  ELSE;                                                           1028
@RF01013 DS    0H                                                  1029
*  /*SEGMENT(DONCB)FINISH*/DO;GOTO DONCB#;DONCB@:END;              1029
@RC01013 DS    0H                                                  1030
         B     DONCB#                                              1030
DONCB@   DS    0H                                                  1032
*  /*SEGMENT(DOCHAIN)START*/DO;GOTO DOCHAIN@;DOCHAIN:END;          1032
         B     DOCHAIN@                                            1033
DOCHAIN  DS    0H                                                  1035
*/*********************************************************************
*/*  IF NO ERROR OCCURRED PREVIOUSLY                                  *
*/*    THEN 1. CHAIN THE FMCB JUST BUILT TO THE NCBFOR THE DEST       *
*/*         2. ADD THE NCB FOR THE DEST TO VTAM C.B. STRUCTURE        *
*/*         3. CHAIN THE FMCB TO THE ACB DEB                          *
*/*    ELSE NO CHAINING IS DONE BECAUSE OPEN DEST HAS FAILED          *
*/*********************************************************************
*IF CINTCODE = 0  /* IF NO ERRORS OCCURRED */                      1035
*  THEN DO;                                                        1035
         SLR   @10,@10                                             1035
         CR    CINTCODE,@10                                        1035
         BNE   @RF01035                                            1035
*/*********************************************************************
*/*  IF THE FMCB IS NOT ALREADY CHAINED TO THE NCB                    *
*/*    THEN PUT THE FMCB ON TOP OF THE NCB-FMCB CHAIN                 *
*/*         & TEST TO SEE IF IT BELONGS TO VARY                       *
*/*    ELSE DO NOT CHAIN THE FMCB TO THE NCB                          *
*/*********************************************************************
*       IF FMCDNCBA =0   /* IF FMCB NOT ON NCB-FMCB CHAIN */       1037
*         THEN DO;                                                 1037
         L     @07,OCWFMCB(,COCWPTR)                               1037
         C     @10,FMCDNCBA(,@07)                                  1037
         BNE   @RF01037                                            1037
*               FMCDNCBA = OCWNCB;   /* POINT FMCB TO NCB */       1039
         MVC   FMCDNCBA(4,@07),OCWNCB(COCWPTR)                     1039
*LOOP1:         CS(FMCFMCBA,OCWFMCB,NCBFMCBA);  /* PUT NEW FMCB ON TOP*
LOOP1    L     @10,OCWFMCB(,COCWPTR)                               1040
         L     @07,FMCFMCBA(,@10)                                  1040
         LR    @05,@10                                             1040
         L     @15,OCWNCB(,COCWPTR)                                1040
         CS    @07,@05,NCBFMCBA(@15)                               1040
         BZ    @BC01040                                            1040
         ST    @07,FMCFMCBA(,@10)                                  1040
@BC01040 DS    0H                                                  1041
*               BC(7,LOOP1);                    /* OF NCB-FMCB CHAIN */
         BC    7,LOOP1                                             1041
*               IF RPLVTUSE ='1'B & RAPALLF='1'B   /* IS CALLER=VARY */
*               THEN DO;                                           1042
         L     @10,OCWRPL(,COCWPTR)                                1042
         TM    RPLVTUSE+16(@10),B'01000000'                        1042
         BNO   @RF01042                                            1042
         L     @10,OCWARDTE(,COCWPTR)                              1042
         TM    RAPALLF(@10),B'10000000'                            1042
         BNO   @RF01042                                            1042
*/*********************************************************************
*/*  THE FMCB BELONGS TO VARY                                         *
*/*   1. COMBINE AN RID OF ZERO W/THE HOST MAJOR NODE ID              *
*/*      TO FORM THE SAF                                              *
*/*   2. RE-QUEUE THE FMCB FOR VARY TO THE BOTTOM OF THE FMCB CHAIN   *
*/*********************************************************************
*                    FMCSAF = ATCVTMID;   /* INIT SAF WITH HOST MAJOR
*                                          NODE ID & RID = 0 */    1044
         L     @10,OCWFMCB(,COCWPTR)                               1044
         L     @07,OCWACVT(,COCWPTR)                               1044
         MVC   FMCSAF(2,@10),ATCVTMID(@07)                         1044
*                    RFY CP RSTD;   /* RSTRCT R.5 FOR FMCB PTR */  1045
*                    CP = NCBFMCBA;  /* PTR TO 1ST/NEXT  FMCB */   1046
         L     @10,OCWNCB(,COCWPTR)                                1046
         L     CP,NCBFMCBA(,@10)                                   1046
*                    DO WHILE CP->FMCFMCBA ^= 0; /*FIND LAST FMCB ON Q*
         B     @DE01047                                            1047
@DL01047 DS    0H                                                  1048
*                     CP = CP->FMCFMCBA;   /* GET NXT FMCB PTR */  1048
         L     CP,FMCFMCBA(,CP)                                    1048
*                    END;                                          1049
@DE01047 ICM   @10,15,FMCFMCBA(CP)                                 1049
         BNZ   @DL01047                                            1049
*                    IF CP = OCWFMCB                               1050
*                     THEN;        /* FIRST & LAST ARE SAME */     1050
         C     CP,OCWFMCB(,COCWPTR)                                1050
         BE    @RT01050                                            1050
*                     ELSE DO;     /* PUT VARY FMCB AT END */      1052
*                           NCBFMCBA = FMCFMCBA;                   1053
         L     @10,OCWNCB(,COCWPTR)                                1053
         L     @07,OCWFMCB(,COCWPTR)                               1053
         MVC   NCBFMCBA(4,@10),FMCFMCBA(@07)                       1053
*                           CP->FMCFMCBA = OCWFMCB;                1054
         ST    @07,FMCFMCBA(,CP)                                   1054
*                           FMCFMCBA = 0;                          1055
         SLR   @10,@10                                             1055
         ST    @10,FMCFMCBA(,@07)                                  1055
*                           RFY CP UNRSTD;   /* RLSE REG.5 */      1056
*                          END;                                    1057
*                    END;                                          1058
*/*********************************************************************
*/*   THE FMCB DOES NOT BELONG TO VARY                                *
*/*   IF THE FMCB IS FIRST ON THE CHAIN                               *
*/*     THEN COMBINE AN RID=1 W/ HOST MAJOR NODE ID                   *
*/*          TO FORM THE SAF                                          *
*/*     ELSE JUST INCREMENT THE SAF BY 1                              *
*/*********************************************************************
*               ELSE IF FMCFMCBA = 0                               1059
*                 THEN FMCSAF = ATCVTMID × '0001'X;                1059
         B     @RC01042                                            1059
@RF01042 L     @10,OCWFMCB(,COCWPTR)                               1059
         ICM   @07,15,FMCFMCBA(@10)                                1059
         BNZ   @RF01059                                            1059
         L     @07,OCWACVT(,COCWPTR)                               1060
         MVC   FMCSAF(2,@10),ATCVTMID(@07)                         1060
         OC    FMCSAF(2,@10),@CB04492                              1060
*                 ELSE FMCSAF = FMCFMCBA->FMCSAF+1;     /* INCR SAF */
         B     @RC01059                                            1061
@RF01059 L     @10,OCWFMCB(,COCWPTR)                               1061
         L     @07,FMCFMCBA(,@10)                                  1061
         LA    @05,1                                               1061
         SLR   @00,@00                                             1061
         ICM   @00,3,FMCSAF(@07)                                   1061
         ALR   @05,@00                                             1061
         STH   @05,FMCSAF(,@10)                                    1061
*              END;                                                1062
*         ELSE;                                                    1063
@RF01037 DS    0H                                                  1064
*/*********************************************************************
*/*  IF THE NCB  IS NOT ALREADY IN THE VTAM C.B. STRUCTURE            *
*/*    THEN PUT IT IN THE VTAM C.B. STRUCTURE                         *
*/*    ELSE LEAVE IT ALONE                                            *
*/*********************************************************************
*       IF NCBRDTE = 0  /* IF NCB NOTIN VTAM STRUCTURE */          1064
*         THEN   /*SEGMENT(DOADD)REQUEST*/DO;GOTO DOADD;DOADD#:END;   /
* CHAIN NCB */                                                     1064
@RC01037 L     @10,OCWNCB(,COCWPTR)                                1064
         ICM   @07,15,NCBRDTE(@10)                                 1064
         BNZ   @RF01064                                            1064
         B     DOADD                                               1066
*         ELSE;                                                    1068
@RF01064 DS    0H                                                  1069
*       END;                                                       1069
*  ELSE;                                                           1070
@RF01035 DS    0H                                                  1071
*/*********************************************************************
*/*  IF NO ERROR OCCURRED PREVIOUSLY DURING FMCB/NCB BUILDING         *
*/*  OR CHAINING                                                      *
*/*    THEN RELEASE THE DAF LOCK IF IT IS HELD                        *
*/*         IF  THE FMCB IS NOT CHAINED TO ACB DEB                    *
*/*           THEN 1. LOCK THE DEB                                    *
*/*                2. COPY THE BUFFFER TRACE FLAG FROM THE RDTE       *
*/*                   INTO THE FMCB                                   *
*/*                3. CHAIN THE FMCB TO ACBDEB                        *
*/*                4. UNLOCK THE DEB                                  *
*/*         IF THE DEB CAN'T BE LOCKED                                *
*/*           THEN SET INTERNAL CODE TO INDICATE SYSTEM ERROR         *
*/*                SO THAT OPEN DEST WILL FAIL                        *
*/*    ELSE DO NOT CHAIN FMCB TO ACB DEB AS OPEN HAS FAILED           *
*/*********************************************************************
*IF CINTCODE = 0   /* IF NO ERRORS OCCURRED */                     1071
*  THEN DO;                                                        1071
@RC01035 LTR   CINTCODE,CINTCODE                                   1071
         BNZ   @RF01071                                            1071
*        IF OCWCLOCK = '1'B   /* IF DAF LOCK HELD */               1073
*          THEN DO;                                                1073
         TM    OCWCLOCK(COCWPTR),B'00010000'                       1073
         BNO   @RF01073                                            1073
*        OCWDAF = RPRDAF;    /* COPY DAF FROM RDTE TO CID W.A. */  1075
         L     @10,OCWDRDTE(,COCWPTR)                              1075
         MVC   OCWDAF(2,COCWPTR),RPRDAF(@10)                       1075
*        RFY CREG2 RSTD;  /* RSTRCT REG.2 FOR CID */               1076
*        CREG2 = OCWCID;   /* PUT CID FROM W.A. INTO REG.2 */      1077
*                                                                  1077
         L     CREG2,OCWCID(,COCWPTR)                              1077
*        DO; /* CIDCTL(FINISH)  */                                 1078
*                                                                  1078
*        RFY (EMCR2,EMCR3) RSTD;                                   1079
*          GEN SETS(RPHWORK)                                       1080
*        (STM EMCR0,EMCR15,RPHWORK(RPHPTR) SAVE REGS IN RPH);      1080
         STM EMCR0,EMCR15,RPHWORK(RPHPTR) SAVE REGS IN RPH
*          EMCR3 = '00'X; /*CLEAR EXTRA BITS*/                     1081
         SLR   EMCR3,EMCR3                                         1081
*          CALL ATCLCPTR->ATCCDFIN->ISTSDCCR; /*PROCESS REQUEST*/  1082
*                                                                  1082
         L     @10,ATCLCPTR                                        1082
         L     @15,ATCCDFIN(,@10)                                  1082
         BALR  @14,@15                                             1082
*        RFY (EMCR2,EMCR3) UNRSTD;                                 1083
*        END; /*CIDCTL*/   /* RELEASE DAF LOCK */                  1084
*        RFY CREG2 UNRSTD;   /* RELEASE REG.2 */                   1085
*        OCWCLOCK = '0'B;   /* RESET DAF LOCK HELD FLAG */         1086
         NI    OCWCLOCK(COCWPTR),B'11101111'                       1086
*               END;                                               1087
*          ELSE;                                                   1088
@RF01073 DS    0H                                                  1089
*        IF RPLREQ ^= '19'X    /* IF THIS IS NOT A CHANGE REQUEST  1089
*                                                            @ZA25571*/
*          THEN DO;                                                1089
         L     @10,OCWRPL(,COCWPTR)                                1089
         CLI   RPLREQ(@10),25                                      1089
         BE    @RF01089                                            1089
*                RFY CADEBPTR RSTD;  /* RSTRCT REG.7 FOR ACBDEB PTR */
*                CADEBPTR = RAPACDEB;  /* INIT ACB DEB PTR */      1092
*                                                                  1092
         L     @10,OCWARDTE(,COCWPTR)                              1092
         L     CADEBPTR,RAPACDEB(,@10)                             1092
*/*** START -TPLOCK (DEBLOCK)TYPE(XCLSIVE)- ***/                   1093
*                 DO;                                              1093
*                 RFY (GPR00P,GPR01P,GPR02P,GPR03P,GPR04P,GPR15P) RSTD;
*        GENERATE REFS(GPR00P,GPR01P,GPR15P,RPHWORK) SETS(RPHWORK);
         STM GPR00P,GPR14P,RPHWORK(GPR01P)
*        GPR02P = ADDR(ACDLOCK);        /*SET PARAM - LOCKWORD PTR*/
         LA    GPR02P,ACDLOCK(,CADEBPTR)                           1096
*        GPR04P = GPR01P->RPHCRR;       /*SET PARAM - ISTCRA PTR*/ 1097
         L     GPR04P,RPHCRR(,GPR01P)                              1097
*        GPR00P = CRALMS05;             /*SET PARAM - LOCK LEVEL FLAG*/
         LA    GPR00P,16                                           1098
*        GPR03P = ADDR(GPR04P->CRAL5PTR);                          1099
         LA    GPR03P,CRAL5PTR(,GPR04P)                            1099
*                                       /*SET PARAM - LOCK LEVEL PTR*/
*        GPR15P=ATCLCPTR->ATCAP36;      /*ADDRESS OF LOCK ROUTINE*/
         L     @10,ATCLCPTR                                        1100
         L     GPR15P,ATCAP36(,@10)                                1100
*        DCL FMZL0203 BASED(GPR15P) LABEL VALUERANGE(*);           1101
*        CALL FMZL0203;                                            1102
         BALR  @14,@15                                             1102
*        GENERATE REFS(GPR00P,GPR01P,GPR14P,RPHWORK) SETS(GPR00P,GPR01P
*GPR02P,GPR03P,GPR04P,GPR05P,GPR06P,GPR07P,GPR08P,GPR09P,GPR10P,GPR11P,
*PR12P,GPR13P,GPR14P,GPR15P);                                      1103
         LM GPR00P,GPR15P,RPHWORK(GPR01P)
*                 RFY (GPR00P,GPR01P,GPR02P,GPR03P,GPR04P,GPR15P) UNRST
*;       END;                                                      1104
*/*** END -TPLOCK (DEBLOCK)TYPE(XCLSIVE)- ***/  /* LOCK ACB DEB */ 1106
*                RFY CREG15 RSTD;                                  1106
*                IF CREG15 = 0                                     1107
*                  THEN DO;                                        1107
         LTR   CREG15,CREG15                                       1107
         BNZ   @RF01107                                            1107
*                FMCDEBA = CADEBPTR;  /* POINT FMCB TO ACBDEB */   1109
         L     @14,OCWFMCB(,COCWPTR)                               1109
         ST    CADEBPTR,FMCDEBA(,@14)                              1109
*                IF RPRENTBF = '1'B              /*COPY BUFFER TR FLAG*
*                  THEN FMCZF007 = '1'B;                           1110
         L     @10,OCWDRDTE(,COCWPTR)                              1110
         TM    RPRENTBF(@10),B'00010000'                           1110
         BNO   @RF01110                                            1110
         OI    FMCZF007(@14),B'00000100'                           1111
*                  ELSE FMCZF007 = '0'B;                           1112
         B     @RC01110                                            1112
@RF01110 L     @14,OCWFMCB(,COCWPTR)                               1112
         NI    FMCZF007(@14),B'11111011'                           1112
*                  FMCNXTCB=0;         /* ZERO NEXT FMCB FIELD@ZA29461*
@RC01110 L     @14,OCWFMCB(,COCWPTR)                               1113
         SLR   @10,@10                                             1113
         ST    @10,FMCNXTCB(,@14)                                  1113
*          LOOP2:CS(FMCNXTCB,OCWFMCB,ACDFMCB);  /* PUT NEW FMCB ON TOP*
LOOP2    L     @14,OCWFMCB(,COCWPTR)                               1114
         L     @10,FMCNXTCB(,@14)                                  1114
         LR    @05,@14                                             1114
         CS    @10,@05,ACDFMCB(CADEBPTR)                           1114
         BZ    @BC01114                                            1114
         ST    @10,FMCNXTCB(,@14)                                  1114
@BC01114 DS    0H                                                  1115
*                BC(7,LOOP2);                   /* OF ACDEB-FMCB CHAIN*
*                                                                  1115
         BC    7,LOOP2                                             1115
*/*** START -TPUNLOCK (DEBLOCK)- ***/                              1116
*                 DO;                                              1116
*                                                                  1116
*/* ATBUILD (ISTRPH,ISTLOK,ISTCRA)  */                             1117
*/* END OF ATBUILD */                                              1117
*                 RFY (GPR00P,GPR01P,GPR02P,GPR03P,GPR04P,GPR15P) RSTD;
*        GENERATE REFS(GPR00P,GPR01P,GPR15P,RPHWORK) SETS(RPHWORK);
         STM GPR00P,GPR15P,RPHWORK(GPR01P)
*        GPR02P = ADDR(ACDLOCK);        /*SET PARAM - LOCKWORD PTR*/
         LA    GPR02P,ACDLOCK(,CADEBPTR)                           1119
*        GPR04P = GPR01P->RPHCRR;       /*SET PARAM - ISTCRA PTR*/ 1120
         L     GPR04P,RPHCRR(,GPR01P)                              1120
*        GPR00P = CRALMS05;             /*SET PARAM - LOCK LEVEL FLAG*/
         LA    GPR00P,16                                           1121
*        GPR03P = ADDR(GPR04P->CRAL5PTR);                          1122
         LA    GPR03P,CRAL5PTR(,GPR04P)                            1122
*                                       /*SET PARAM - LOCK LEVEL PTR*/
*                                                                  1123
*                 DO; /* LISATCVT CVTBASE(PAGEABLE,(GPR15P)) */    1123
*                   GPR15P = ATCLCPTR; /*SET UP ATCVT POINTER*/    1124
         L     GPR15P,ATCLCPTR                                     1124
*                 END; /*LISATCVT*/                                1125
*        GPR15P=GPR15P->ATCAP33;                                   1126
         L     GPR15P,ATCAP33(,GPR15P)                             1126
*        DCL FMZL0208 BASED(GPR15P) LABEL VALUERANGE(*);           1127
*        CALL FMZL0208;                                            1128
         BALR  @14,@15                                             1128
*        GENERATE REFS(GPR00P,GPR01P,GPR15P,RPHWORK) SETS(GPR00P,GPR01P
*GPR02P,GPR03P,GPR04P,GPR05P,GPR06P,GPR07P,GPR08P,GPR09P,GPR10P,GPR11P,
*PR12P,GPR13P,GPR14P,GPR15P);                                      1129
         LM GPR00P,GPR15P,RPHWORK(GPR01P)
*                 RFY (GPR00P,GPR01P,GPR02P,GPR03P,GPR04P,GPR15P) UNRST
*;       END;                                                      1130
*/*** END -TPUNLOCK (DEBLOCK)- ***/  /* UNLOCK ACB DEB */          1132
*                RFY CADEBPTR UNRSTD;  /* RELEASE REG.7 */         1132
*                       END;                                       1133
*                  ELSE CINTCODE = 24;  /* SYST ERR - NO DEB LOCK */
         B     @RC01107                                            1134
@RF01107 LA    CINTCODE,24                                         1134
*               END;                                               1135
*          ELSE;                                                   1136
@RF01089 DS    0H                                                  1137
*                RFY CREG15 UNRSTD;                                1137
@RC01089 DS    0H                                                  1138
*       END;                                                       1138
*  ELSE;                                                           1139
@RF01071 DS    0H                                                  1140
*  /*SEGMENT(DOCHAIN)FINISH*/DO;GOTO DOCHAIN#;DOCHAIN@:END;        1140
         B     DOCHAIN#                                            1141
DOCHAIN@ DS    0H                                                  1143
*  /*SEGMENT(DOADD)START*/DO;GOTO DOADD@;DOADD:END;                1143
         B     DOADD@                                              1144
DOADD    DS    0H                                                  1146
*/*********************************************************************
*/*   ADD THE NCB TO THE VTAM CTRL BLOCK STRUCTURE                    *
*/* IF THE DEST HAS A LOGICALLY HIGHER NODE                           *
*/*   THEN SEARCH THE LOGICALLY HIGHER RDTE'S UNTIL ONE IS FOUND      *
*/*        THAT HAS SCHEDULEABLE SUB-NODES                            *
*/*         RDTE'S THAT CAN HAVE SCHEDULEABLE SUB-NODES ARE           *
*/*          1. RN                                                    *
*/*          2. LOCAL C.U.                                            *
*/*          3. CLUSTER C.U.                                          *
*/*          4. DIAL-IN-LINE                                          *
*/*          5. DUMMY TERMINAL                                        *
*/*   ELSE JUST ADD THE NCB PTR TO THE SNT                            *
*/*********************************************************************
*IF RPRNSNEA ^= 0                                                  1146
*  THEN DO;                                                        1146
         L     @10,OCWDRDTE(,COCWPTR)                              1146
         L     @10,RPRNSNEA(,@10)                                  1146
         LTR   @10,@10                                             1146
         BZ    @RF01146                                            1146
*        CLOOPSW = '00'X;   /* INIT LOOP CTRL SW */                1148
         MVI   CLOOPSW(COCWPTR),X'00'                              1148
*        RFY CNSNPTR RSTD;   /* RSTRCT REG.9 FOR NXT SCHED NODE PTR */
*        CNSNPTR = RPRNSNEA;  /* INIT PTR TO NXT SCHED NODE */     1150
         LR    CNSNPTR,@10                                         1150
*        DO WHILE CLOOPSW = '00'X;   /* LOOK SCHED SUB NODES       1151
*                                       OF NXT SCHED NODE */       1151
         B     @DE01151                                            1151
@DL01151 DS    0H                                                  1152
*         RFY DEVCHPTR RSTD;   /* RSTRCT REG.5 FOR DEV CHAR PTR */ 1152
*         DEVCHPTR = ADDR(CNSNPTR->RPRDEVCH);  /* INIT DEV CHAR'STICS
*                                                 PTR FOR NSN */   1153
         LA    DEVCHPTR,RPRDEVCH(,CNSNPTR)                         1153
*         IF DEVCHPTR->DEVSUBND = '1'B  /* IF NSN HAS SCHED SUB NODES *
*           THEN CLOOPSW = '01'X;    /* END SEARCH */              1154
         TM    DEVSUBND(DEVCHPTR),B'00010000'                      1154
         BNO   @RF01154                                            1154
         MVI   CLOOPSW(COCWPTR),X'01'                              1155
*           ELSE DO;                                               1156
         B     @RC01154                                            1156
@RF01154 DS    0H                                                  1157
*                 CNSNPTR = CNSNPTR->RPRNSNEA;  /* UPDATE NSN PTR */
         L     CNSNPTR,RPRNSNEA(,CNSNPTR)                          1157
*                 IF CNSNPTR = 0   /* IF CHAIN EXHAUSTED */        1158
*                   THEN CLOOPSW = '02'X;     /* END SEARCH */     1158
         LTR   CNSNPTR,CNSNPTR                                     1158
         BNZ   @RF01158                                            1158
         MVI   CLOOPSW(COCWPTR),X'02'                              1159
*                   ELSE;    /* GO TEST FOR SCHED SUB NODES */     1160
@RF01158 DS    0H                                                  1161
*                END;                                              1161
*         RFY DEVCHPTR UNRSTD;   /* RELEASE REG.5 */               1162
@RC01154 DS    0H                                                  1163
*        END;                                                      1163
@DE01151 CLI   CLOOPSW(COCWPTR),X'00'                              1163
         BE    @DL01151                                            1163
*       END;                                                       1164
*  ELSE;                                                           1165
@RF01146 DS    0H                                                  1166
*/*********************************************************************
*/* IF A LOGICALLY HIGHER NODE W/SCHEDULEABLE SUB-NODES WAS FOUND     *
*/*   THEN 1. LOCK THE DAF FOR THAT NODE AND FIND ITS NCB PTR         *
*/*        2. CHAIN THE NEW NCB TO THE LOCKED HIGHER NODE             *
*/*        3. ADD THE NCB PTR TO THE SNT                              *
*/*        4. RELEASE THE DAF LOCK                                    *
*/*        IF THE DAF FOR THE HIGHER NODE COULD NOT BE LOCKED         *
*/*          THEN SET INTERNAL CODE TO INDICATE THAT                  *
*/*               THEIR IS NO PATH AVAILABLE TO THAT NODE             *
*/*               SO THAT OPEN DEST WILL FAIL                         *
*/*   ELSE JUST ADD THE NCB PTR TO THE SNT                            *
*/*********************************************************************
*IF RPRNSNEA ^= 0    /* IF DEST RDTE HAS NXT SCHED NODE */         1166
*  THEN IF CLOOPSW = '01'X   /* AND IF SCHED SUB-NODES WERE        1166
*                               FOUND FOR A NXT SCHED NODE */      1166
         L     @10,OCWDRDTE(,COCWPTR)                              1166
         ICM   @08,15,RPRNSNEA(@10)                                1166
         BZ    @RF01166                                            1166
*         THEN DO;                                                 1167
         CLI   CLOOPSW(COCWPTR),X'01'                              1167
         BNE   @RF01167                                            1167
*               OCWDAF = CNSNPTR->RPRDAF;  /* PUT DAF IN CID */    1169
         MVC   OCWDAF(2,COCWPTR),RPRDAF(CNSNPTR)                   1169
*               RFY CREG2 RSTD;     /* RSTRCT REG.2 FOR CID */     1170
*               CREG2 = OCWCID;     /* INIT REG.2 WITH CID */      1171
*                                                                  1171
         L     CREG2,OCWCID(,COCWPTR)                              1171
*                DO; /* CIDCTL(FIND) LOCK(XCLUSIVE) */             1172
*                                                                  1172
*                RFY (EMCR2,EMCR3) RSTD;                           1173
*                  GEN SETS(RPHWORK)                               1174
*        (STM EMCR0,EMCR15,RPHWORK(RPHPTR) SAVE REGS IN RPH);      1174
         STM EMCR0,EMCR15,RPHWORK(RPHPTR) SAVE REGS IN RPH
*                  EMCR3 = '00'X; /*CLEAR EXTRA BITS*/             1175
         SLR   EMCR3,EMCR3                                         1175
*                  EMCR3 = '02'X; /*INDICATE EXCLUSIVE LOCK*/      1176
         LA    EMCR3,2                                             1176
*                  CALL ATCLCPTR->ATCCDFND->ISTSDCCF; /*PROCESS REQUEST
*/                                                                 1177
         L     @10,ATCLCPTR                                        1177
         L     @15,ATCCDFND(,@10)                                  1177
         BALR  @14,@15                                             1177
*                RFY (EMCR2,EMCR3) UNRSTD;                         1178
*                END; /*CIDCTL*/ /* LOCK DAF                       1179
*                                         FOR NSN */               1179
*               RFY CREG0 RSTD;  /* RSTRCT REG.0 FOR NCB PTR */    1180
*               RFY CREG15 RSTD;                                   1181
*               IF CREG15 = 0    /* IF NCB PTR FOUND */            1182
*                 THEN                                             1182
         SLR   @14,@14                                             1182
         CR    CREG15,@14                                          1182
         BNE   @RF01182                                            1182
*                  DO;                                             1183
*                   IF OCWNCB->NCBNSNA = 0  /*IF NCB NOT YET ON CHAIN *
*                     THEN                                         1184
         L     @10,OCWNCB(,COCWPTR)                                1184
         C     @14,NCBNSNA(,@10)                                   1184
         BNE   @RF01184                                            1184
*                      DO;                                         1185
*                       OCWNCB->NCBNSNA = CREG0;                   1186
         ST    CREG0,NCBNSNA(,@10)                                 1186
*                       OCWNCB->NCBNCBA = OCWNCB->NCBNSNA->NCBNCBA;
         L     @14,OCWNCB(,COCWPTR)                                1187
         L     @14,NCBNSNA(,@14)                                   1187
         MVC   NCBNCBA(2,@10),NCBNCBA(@14)                         1187
*                       OCWNCB->NCBNSNA->NCBNCBA = OCWNCB->NCBDAF; 1188
         MVC   NCBNCBA(2,@14),NCBDAF(@10)                          1188
*                       OCWDAF = OCWNCB->NCBNCBA;                  1189
*                                                                  1189
         MVC   OCWDAF(2,COCWPTR),NCBNCBA(@10)                      1189
*/*--------------------------------------------------------- @D31KKMP*/
*/* THESE MODIFICATIONS WERE FOR THE REMOTE 370X DELTA       @D31KKMP*/
*/*--------------------------------------------------------- @D31KKMP*/
*RRNDELTA:                                                         1190
*   DO;                                                    /*@D31KKMP*/
RRNDELTA DS    0H                                                  1191
*     IF OCWDRDTE->RPRENTRY=RPRENTRN & /* IF DEST IS THE RN  @D31KKMP*/
*        OCWDRDTE->RPRNSNEA^=CNONSNEA  /* & HAS AN NSNEA PTR @D31KKMP*/
*       THEN                                               /*@D31KKMP*/
         L     @14,OCWDRDTE(,COCWPTR)                              1191
         CLI   RPRENTRY(@14),X'01'                                 1191
         BNE   @RF01191                                            1191
         ICM   @10,15,RPRNSNEA(@14)                                1191
         BZ    @RF01191                                            1191
*RRNLOGIC:                                                         1192
*       DO;                                                /*@D31KKMP*/
RRNLOGIC DS    0H                                                  1193
*         RFY BASERDTE RSTD;                               /*@D31KKMP*/
*         BASERDTE=OCWDRDTE; /* SET BASE RDTE PTR            @D31KKMP*/
         L     BASERDTE,OCWDRDTE(,COCWPTR)                         1194
*         DO WHILE (BASERDTE->RPRNSNEA^=CNONSNEA); /* LOOP   @D31KKMP*/
         B     @DE01195                                            1195
@DL01195 DS    0H                                                  1196
*            BASERDTE=BASERDTE->RPRNSNEA; /* FIND LOCAL SEG  @D31KKMP*/
         L     BASERDTE,RPRNSNEA(,BASERDTE)                        1196
*         END;                                             /*@D31KKMP*/
@DE01195 ICM   @14,15,RPRNSNEA(BASERDTE)                           1197
         BNZ   @DL01195                                            1197
*         RFY SDLCRDTE RSTD;                               /*@D31KKMP*/
*         SDLCRDTE=OCWDRDTE->RRNTRENT->RPRNSNEA; /* FIND           1199
*                                            SDLC TRUNK RDTE @XM09030*/
         L     @14,OCWDRDTE(,COCWPTR)                              1199
         L     @14,RRNTRENT(,@14)                                  1199
         L     SDLCRDTE,RPRNSNEA(,@14)                             1199
*RRNCTOSB:                                                         1200
*         DO;                                              /*@D31KKMP*/
RRNCTOSB DS    0H                                                  1201
*           SUBNDCNT=CNOSUBND; /* CLEAR OPEN SUBNODE CTR     @D31KKMP*/
         SLR   @14,@14                                             1201
         STH   @14,SUBNDCNT(,COCWPTR)                              1201
*           SBNDRDTE=SDLCRDTE+SDLCRDTE->RPRELEN; /* SET SUBNODE BASE
*                                                   RDTE PTR @ZA08936*/
         LR    @14,SDLCRDTE                                        1202
         AH    @14,RPRELEN(,SDLCRDTE)                              1202
         ST    @14,SBNDRDTE(,COCWPTR)                              1202
*           DO WHILE (SBNDRDTE->RPRENTRY>RPRENTLN &                1203
*                     SBNDRDTE->RPRENTED  ^= CBITON &      /*@ZA18908*/
*                     SUBNDCNT<=C1OSUBND);                 /*@D31KKMP*/
         B     @DE01203                                            1203
@DL01203 DS    0H                                                  1204
*              IF SBNDRDTE->RPRACT=CBITON /* IF SUBNODE ACTV @D31KKMP*/
*                THEN                                      /*@D31KKMP*/
         L     @14,SBNDRDTE(,COCWPTR)                              1204
         TM    RPRACT(@14),B'10000000'                             1204
         BNO   @RF01204                                            1204
*                SUBNDCNT=SUBNDCNT+C1OSUBND; /* BUMP CTR     @D31KKMP*/
         LA    @14,1                                               1205
         AH    @14,SUBNDCNT(,COCWPTR)                              1205
         STH   @14,SUBNDCNT(,COCWPTR)                              1205
*                ELSE;                                     /*@D31KKMP*/
@RF01204 DS    0H                                                  1207
*              SBNDRDTE=SBNDRDTE+SBNDRDTE->RPRELEN;                1207
         L     @14,SBNDRDTE(,COCWPTR)                              1207
         LH    @07,RPRELEN(,@14)                                   1207
         ALR   @07,@14                                             1207
         ST    @07,SBNDRDTE(,COCWPTR)                              1207
*                                            /* BUMP BASE    @ZA08936*/
*           END;                                           /*@D31KKMP*/
@DE01203 L     @14,SBNDRDTE(,COCWPTR)                              1208
         CLI   RPRENTRY(@14),X'50'                                 1208
         BNH   @DC01203                                            1208
         TM    RPRENTED(@14),B'00000100'                           1208
         BO    @DC01203                                            1208
         LH    @14,SUBNDCNT(,COCWPTR)                              1208
         CH    @14,@CH00063                                        1208
         BNH   @DL01203                                            1208
@DC01203 DS    0H                                                  1209
*         END;                                             /*@D31KKMP*/
*         IF SUBNDCNT>C1OSUBND /* IF COUNT IS .GT. ONE       @D31KKMP*/
*           THEN               /* MORE THAN ONE IS OPEN      @D31KKMP*/
         LH    @14,SUBNDCNT(,COCWPTR)                              1210
         CH    @14,@CH00063                                        1210
         BNH   @RF01210                                            1210
*RRNCTGT1:                                                         1211
*           DO;                                            /*@D31KKMP*/
RRNCTGT1 DS    0H                                                  1212
*             RRNCTLSW=CONTLOOP; /* SET LOOP CONT SWITCH     @D31KKMP*/
         OI    RRNCTLSW(COCWPTR),B'10000000'                       1212
*             RFY (CREG0,CREG2) RSTD;                      /*@D31KKMP*/
*             CREG0=BASERDTE->RPRNCBA; /* GET PTR TO NCB     @D31KKMP*/
         L     CREG0,RPRNCBA(,BASERDTE)                            1214
*             DO WHILE (RRNCTLSW=CONTLOOP); /* LOOP          @D31KKMP*/
         B     @DE01215                                            1215
@DL01215 DS    0H                                                  1216
*                CREG2=CREG0->NCBNCBA; /* GET CID OF NEXT          1216
*                                         SAME LEVEL NODE    @D31KKMP*/
*                                                                  1216
         LR    @14,CREG0                                           1216
         SLR   CREG2,CREG2                                         1216
         ICM   CREG2,3,NCBNCBA(@14)                                1216
*                 DO; /* CIDCTL(FINDNCB)  */                       1217
*                                                                  1217
*                 RFY (EMCR2,EMCR3) RSTD;                          1218
*                   GEN SETS(RPHWORK)                              1219
*        (STM EMCR0,EMCR15,RPHWORK(RPHPTR) SAVE REGS IN RPH);      1219
         STM EMCR0,EMCR15,RPHWORK(RPHPTR) SAVE REGS IN RPH
*                   EMCR3 = '00'X; /*CLEAR EXTRA BITS*/            1220
         SLR   EMCR3,EMCR3                                         1220
*                   CALL ATCLCPTR->ATCCDFDN->ISTSDCCN; /*PROCESS REQUES
**/                                                                1221
         L     @07,ATCLCPTR                                        1221
         L     @15,ATCCDFDN(,@07)                                  1221
         BALR  @14,@15                                             1221
*                 RFY (EMCR2,EMCR3) UNRSTD;                        1222
*                 END; /*CIDCTL*/ /* FIND NEXT/SAME LEVEL  @D31KKMP*/
*                IF CREG0->NCBRDTE->RPRNSNEA->RPRENTRY=            1224
*                   RPRENTTR /* IF NEXT/SAME LEVEL NODE PTS        1224
*                               BACK TO A TERMINAL ENTRY     @D31KKMP*/
*                  THEN                                    /*@D31KKMP*/
         LR    @14,CREG0                                           1224
         L     @14,NCBRDTE(,@14)                                   1224
         L     @14,RPRNSNEA(,@14)                                  1224
         CLI   RPRENTRY(@14),X'80'                                 1224
         BNE   @RF01224                                            1224
*                  IF CREG0->NCBRDTE->RPRNSNEA->RPRNSNEA=          1225
*                     SDLCRDTE /* IF NEXT/SAME LEVEL NODE          1225
*                                 PTS BACK TO SDLC ENTRY           1225
*                                 OF DESTINATION             @D31KKMP*/
*                    THEN                                  /*@D31KKMP*/
         C     SDLCRDTE,RPRNSNEA(,@14)                             1225
         BNE   @RF01225                                            1225
*                    DO;                                   /*@D31KKMP*/
*                      OCWNCB->NCBNCSL=CREG0->NCBDAF;      /*@DM12447*/
         L     @14,OCWNCB(,COCWPTR)                                1227
         LR    @07,CREG0                                           1227
         MVC   NCBNCSL(2,@14),NCBDAF(@07)                          1227
*                      RRNCTLSW       =FNSHLOOP;           /*@D31KKMP*/
         NI    RRNCTLSW(COCWPTR),B'01111111'                       1228
*                    END;                                  /*@D31KKMP*/
*                    ELSE;                                 /*@D31KKMP*/
@RF01225 DS    0H                                                  1231
*                  ELSE;                                   /*@D31KKMP*/
@RF01224 DS    0H                                                  1232
*             END;                                         /*@D31KKMP*/
@DE01215 TM    RRNCTLSW(COCWPTR),B'10000000'                       1232
         BO    @DL01215                                            1232
*             RFY (CREG0,CREG2) UNRSTD;                    /*@D31KKMP*/
*           END;                                           /*@D31KKMP*/
*           ELSE               /* LESS THAN TWO ARE OPEN     @D31KKMP*/
*           OCWNCB->NCBNCSL=CNONCBA; /* CLEAR OUR NEXT/SAME        1235
*                                       LEVEL NODE PTR       @D31KKMP*/
         B     @RC01210                                            1235
@RF01210 L     @14,OCWNCB(,COCWPTR)                                1235
         SLR   @07,@07                                             1235
         STH   @07,NCBNCSL(,@14)                                   1235
*         RFY (SDLCRDTE,BASERDTE) UNRSTD;                  /*@D31KKMP*/
@RC01210 DS    0H                                                  1237
*       END;                                               /*@D31KKMP*/
*       ELSE                                               /*@D31KKMP*/
*       IF OCWNCB->NCBNCBA^=CNONCBA /* IF NO CID IS PRESENT  @D31KKMP*/
*         THEN                                             /*@D31KKMP*/
         B     @RC01191                                            1238
@RF01191 L     @14,OCWNCB(,COCWPTR)                                1238
         SLR   @10,@10                                             1238
         ICM   @10,3,NCBNCBA(@14)                                  1238
         LTR   @10,@10                                             1238
         BZ    @RF01238                                            1238
*         DO;                                              /*@D31KKMP*/
*           RFY CREG2 RSTD;                                /*@D31KKMP*/
*           CREG2=OCWNCB->NCBNCBA; /* GET CID OF NEXT/SAME         1241
*                                     LEVEL NODE OFF OF OUR        1241
*                                     NCB                    @D31KKMP*/
*                                                                  1241
         LR    CREG2,@10                                           1241
*            DO; /* CIDCTL(FINDNCB)  */                            1242
*                                                                  1242
*            RFY (EMCR2,EMCR3) RSTD;                               1243
*              GEN SETS(RPHWORK)                                   1244
*        (STM EMCR0,EMCR15,RPHWORK(RPHPTR) SAVE REGS IN RPH);      1244
         STM EMCR0,EMCR15,RPHWORK(RPHPTR) SAVE REGS IN RPH
*              EMCR3 = '00'X; /*CLEAR EXTRA BITS*/                 1245
         SLR   EMCR3,EMCR3                                         1245
*              CALL ATCLCPTR->ATCCDFDN->ISTSDCCN; /*PROCESS REQUEST*/
*                                                                  1246
         L     @10,ATCLCPTR                                        1246
         L     @15,ATCCDFDN(,@10)                                  1246
         BALR  @14,@15                                             1246
*            RFY (EMCR2,EMCR3) UNRSTD;                             1247
*            END; /*CIDCTL*/ /* FIND NEXT/SAME LEVEL NODE  @D31KKMP*/
*           RFY CREG0 RSTD;                                /*@D31KKMP*/
*           IF CREG0->NCBNSNA=OCWNCB->NCBNSNA /* IF FND=OUR  @D31KKMP*/
*             THEN                            /* NCB         @D31KKMP*/
         L     @14,OCWNCB(,COCWPTR)                                1250
         LR    @10,CREG0                                           1250
         CLC   NCBNSNA(4,@10),NCBNSNA(@14)                         1250
         BNE   @RF01250                                            1250
*             IF ((OCWDRDTE->RPRENTRY=RPRENTLN & /* IF DEST  @D31KKMP*/
*                  OCWDRDTE->RLNPORT=CBITON)   × /* PORTLINE @D31KKMP*/
*                  OCWDRDTE->RPRENTRY=RPRENTDS) /* × DIALSET @D31KKMP*/
*               THEN                                       /*@D31KKMP*/
         L     @14,OCWDRDTE(,COCWPTR)                              1251
         CLI   RPRENTRY(@14),X'50'                                 1251
         BNE   @GL00021                                            1251
         TM    RLNPORT(@14),B'00010000'                            1251
         BO    @RT01251                                            1251
@GL00021 L     @14,OCWDRDTE(,COCWPTR)                              1251
         CLI   RPRENTRY(@14),X'20'                                 1251
         BNE   @RF01251                                            1251
@RT01251 DS    0H                                                  1252
*               OCWNCB->NCBNCSL=CNONCBA; /* CLR OUR NXT/SAME       1252
*                                           LEVEL NODE PTR   @D31KKMP*/
         L     @14,OCWNCB(,COCWPTR)                                1252
         SLR   @10,@10                                             1252
         STH   @10,NCBNCSL(,@14)                                   1252
*               ELSE                                       /*@D31KKMP*/
*               OCWNCB->NCBNCSL=CREG0->NCBDAF; /* POINT OUR        1253
*                                           NEXT/SAME LEVEL        1253
*                                           NODE PTR AT THE        1253
*                                           FOUND NCB        @DM12447*/
         B     @RC01251                                            1253
@RF01251 L     @14,OCWNCB(,COCWPTR)                                1253
         LR    @10,CREG0                                           1253
         MVC   NCBNCSL(2,@14),NCBDAF(@10)                          1253
*             ELSE;                                        /*@D31KKMP*/
@RF01250 DS    0H                                                  1255
*           RFY (CREG0,CREG2) UNRSTD;                      /*@D31KKMP*/
@RC01250 DS    0H                                                  1256
*         END;                                             /*@D31KKMP*/
*         ELSE;                                            /*@D31KKMP*/
@RF01238 DS    0H                                                  1258
*   END;                                                   /*@D31KKMP*/
@RC01191 DS    0H                                                  1259
*/*--------------------------------------------------------- @D31KKMP*/
*/* THE PREVIOUS MODIFICATIONS WERE FOR REMOTE 370X DELTA    @D31KKMP*/
*/*--------------------------------------------------------- @D31KKMP*/
*                                                                  1259
*                        CNSNPTR->RPRNCBA->NCBNMLLN =              1259
*                             CNSNPTR->RPRNCBA->NCBNMLLN+1;/*@XM06731*/
         L     @14,RPRNCBA(,CNSNPTR)                               1259
         LA    @10,1                                               1259
         SLR   @08,@08                                             1259
         IC    @08,NCBNMLLN(,@14)                                  1259
         ALR   @10,@08                                             1259
         STC   @10,NCBNMLLN(,@14)                                  1259
*                       OCWDAF = OCWDRDTE->RPRDAF;                 1260
         L     @14,OCWDRDTE(,COCWPTR)                              1260
         MVC   OCWDAF(2,COCWPTR),RPRDAF(@14)                       1260
*                       CREG2 = OCWCID;                            1261
         L     CREG2,OCWCID(,COCWPTR)                              1261
*                       CREG0 = OCWNCB;                            1262
*                                                                  1262
         L     CREG0,OCWNCB(,COCWPTR)                              1262
*                        DO; /* CIDCTL(ADD)  */                    1263
*                                                                  1263
*                        RFY (EMCR2,EMCR3) RSTD;                   1264
*                          GEN SETS(RPHWORK)                       1265
*        (STM EMCR0,EMCR15,RPHWORK(RPHPTR) SAVE REGS IN RPH);      1265
         STM EMCR0,EMCR15,RPHWORK(RPHPTR) SAVE REGS IN RPH
*                          EMCR3 = '00'X; /*CLEAR EXTRA BITS*/     1266
         SLR   EMCR3,EMCR3                                         1266
*                          CALL ATCLCPTR->ATCCDADD->ISTSDCCA; /*PROCESS
*REQUEST*/                                                         1267
         L     @10,ATCLCPTR                                        1267
         L     @15,ATCCDADD(,@10)                                  1267
         BALR  @14,@15                                             1267
*                        RFY (EMCR2,EMCR3) UNRSTD;                 1268
*                        END; /*CIDCTL*/                           1269
*                      END;                                        1270
*                     ELSE;                                        1271
@RF01184 DS    0H                                                  1272
*                  OCWDAF = CNSNPTR->RPRDAF;                       1272
         MVC   OCWDAF(2,COCWPTR),RPRDAF(CNSNPTR)                   1272
*                  CREG2 = OCWCID;                                 1273
*                                                                  1273
         L     CREG2,OCWCID(,COCWPTR)                              1273
*                   DO; /* CIDCTL(FINISH)  */                      1274
*                                                                  1274
*                   RFY (EMCR2,EMCR3) RSTD;                        1275
*                     GEN SETS(RPHWORK)                            1276
*        (STM EMCR0,EMCR15,RPHWORK(RPHPTR) SAVE REGS IN RPH);      1276
         STM EMCR0,EMCR15,RPHWORK(RPHPTR) SAVE REGS IN RPH
*                     EMCR3 = '00'X; /*CLEAR EXTRA BITS*/          1277
         SLR   EMCR3,EMCR3                                         1277
*                     CALL ATCLCPTR->ATCCDFIN->ISTSDCCR; /*PROCESS REQU
*ST*/                                                              1278
         L     @10,ATCLCPTR                                        1278
         L     @15,ATCCDFIN(,@10)                                  1278
         BALR  @14,@15                                             1278
*                   RFY (EMCR2,EMCR3) UNRSTD;                      1279
*                   END; /*CIDCTL*/                                1280
*                 END;                                             1281
*                ELSE CINTCODE = 12;  /*SET INTRNL CODE = NO NXT NODE*/
         B     @RC01182                                            1282
@RF01182 LA    CINTCODE,12                                         1282
*               RFY CREG15 UNRSTD;                                 1283
@RC01182 DS    0H                                                  1284
*              END;                                                1284
*/*********************************************************************
*/*  ADD THE NCB PTR TO THE SNT WHEN NO LOGICALLY HIGHER NODE         *
*/*  HAS SCHEDULEABLE SUB-NODES                                       *
*/*********************************************************************
*         ELSE DO;      /* ADD NEW NCB PTR TO SNT */               1285
         B     @RC01167                                            1285
@RF01167 DS    0H                                                  1286
*               OCWDAF = OCWDRDTE->RPRDAF;  /* PUT DEST DAF IN CID */
         L     @10,OCWDRDTE(,COCWPTR)                              1286
         MVC   OCWDAF(2,COCWPTR),RPRDAF(@10)                       1286
*               CREG2 = OCWCID;   /* PUT CID IN REG.2 */           1287
         L     CREG2,OCWCID(,COCWPTR)                              1287
*               CREG0 = OCWNCB;   /* PUT NEW NCB PTR IN REG.0 */   1288
*                                                                  1288
         L     CREG0,OCWNCB(,COCWPTR)                              1288
*                DO; /* CIDCTL(ADD)  */                            1289
*                                                                  1289
*                RFY (EMCR2,EMCR3) RSTD;                           1290
*                  GEN SETS(RPHWORK)                               1291
*        (STM EMCR0,EMCR15,RPHWORK(RPHPTR) SAVE REGS IN RPH);      1291
         STM EMCR0,EMCR15,RPHWORK(RPHPTR) SAVE REGS IN RPH
*                  EMCR3 = '00'X; /*CLEAR EXTRA BITS*/             1292
         SLR   EMCR3,EMCR3                                         1292
*                  CALL ATCLCPTR->ATCCDADD->ISTSDCCA; /*PROCESS REQUEST
*/                                                                 1293
         L     @10,ATCLCPTR                                        1293
         L     @15,ATCCDADD(,@10)                                  1293
         BALR  @14,@15                                             1293
*                RFY (EMCR2,EMCR3) UNRSTD;                         1294
*                END; /*CIDCTL*/                                   1295
*              END;                                                1296
*/*********************************************************************
*/*  ADD THE NCB PTR TO THE SNT WHEN THE NCB FOR THE DEST             *
*/*  DOES NOT POINT TO A LOGICALLY HIGHER NODE                        *
*/*********************************************************************
*  ELSE DO;    /* ADD NEW NCB PTR TO SNT */                        1297
         B     @RC01166                                            1297
@RF01166 DS    0H                                                  1298
*        OCWDAF = OCWDRDTE->RPRDAF;  /* PUT DAF INTO CID */        1298
         L     @10,OCWDRDTE(,COCWPTR)                              1298
         MVC   OCWDAF(2,COCWPTR),RPRDAF(@10)                       1298
*        CREG2 = OCWCID;     /* PUT CID INTO REG.2 FOR CIDCTL */   1299
         L     CREG2,OCWCID(,COCWPTR)                              1299
*        CREG0 = OCWNCB;     /* PUT NCB PTR INT REG.0 */           1300
*                                                                  1300
         L     CREG0,OCWNCB(,COCWPTR)                              1300
*         DO; /* CIDCTL(ADD)  */                                   1301
*                                                                  1301
*         RFY (EMCR2,EMCR3) RSTD;                                  1302
*           GEN SETS(RPHWORK)                                      1303
*        (STM EMCR0,EMCR15,RPHWORK(RPHPTR) SAVE REGS IN RPH);      1303
         STM EMCR0,EMCR15,RPHWORK(RPHPTR) SAVE REGS IN RPH
*           EMCR3 = '00'X; /*CLEAR EXTRA BITS*/                    1304
         SLR   EMCR3,EMCR3                                         1304
*           CALL ATCLCPTR->ATCCDADD->ISTSDCCA; /*PROCESS REQUEST*/ 1305
*                                                                  1305
         L     @10,ATCLCPTR                                        1305
         L     @15,ATCCDADD(,@10)                                  1305
         BALR  @14,@15                                             1305
*         RFY (EMCR2,EMCR3) UNRSTD;                                1306
*         END; /*CIDCTL*/                                          1307
*       END;                                                       1308
*  RFY CREG2 UNRSTD;   /* RELEASE REG.2 */                         1309
@RC01166 DS    0H                                                  1310
*  RFY CREG0 UNRSTD;   /* RELEASE REG.0 */                         1310
*RFY CNSNPTR UNRSTD;  /* RELEASE REG.9 */                          1311
*/*********************************************************************
*/*   IF NO ERROR HAS OCCURRED WHEN ADDING THE NCB TO THE VTAM        *
*/*   CTRL BLOCK STRUCTURE                                            *
*/*     THEN POINT THE DEST RDTE TO THE NCB                           *
*/*********************************************************************
*IF CINTCODE = 0   /* IF NO ERRORS OCCURRED */                     1312
*  THEN IF RPRVRYPD='1'B      /* IF TERMINAL IS VARY-PENDING @ZA30053*/
         LTR   CINTCODE,CINTCODE                                   1312
         BNZ   @RF01312                                            1312
*          × RPRHLVPD='1'B    /* OR HIGHER NODE IS VARY-PEND @ZA30053*/
*          THEN CINTCODE = 8;          /* THEN FAIL THE OPEN @ZA30053*/
         L     @10,OCWDRDTE(,COCWPTR)                              1313
         TM    RPRVRYPD(@10),B'00000010'                           1313
         BO    @RT01313                                            1313
         TM    RPRHLVPD(@10),B'00000100'                           1313
         BNO   @RF01313                                            1313
@RT01313 DS    0H                                                  1314
         LA    CINTCODE,8                                          1314
*          ELSE DO;                    /* OTHERWISE CONTINUE @ZA30053*/
         B     @RC01313                                            1315
@RF01313 DS    0H                                                  1316
*          RPRNCBA = OCWNCB;   /* POINT DEST RDTE AT NCB */        1316
         L     @10,OCWDRDTE(,COCWPTR)                              1316
         L     @07,OCWNCB(,COCWPTR)                                1316
         ST    @07,RPRNCBA(,@10)                                   1316
*          NCBRDTE = OCWDRDTE & '00FFFFFF'X;  /*POINT NCB AT DEST RDTE*
         N     @10,@CF04415                                        1317
         ST    @10,NCBRDTE(,@07)                                   1317
*          END;                                                    1318
*  ELSE;                                                           1319
@RF01312 DS    0H                                                  1320
*  /*SEGMENT(DOADD)FINISH*/DO;GOTO DOADD#;DOADD@:END;              1320
@RC01312 DS    0H                                                  1321
         B     DOADD#                                              1321
DOADD@   DS    0H                                                  1323
*  /*SEGMENT(DOUNDO)START*/DO;GOTO DOUNDO@;DOUNDO:END;             1323
         B     DOUNDO@                                             1324
DOUNDO   DS    0H                                                  1326
*/*********************************************************************
*/*  1. INIT OCW RTRN CODES  = TEMP ERROR,NO STORAGE AVAILABLE        *
*/*  2. RELEASE THE DAF LOCK FOR THE NEW DEST IF IT IS HELD           *
*/*  3.RESOLVE THE INTERNAL CODE TO RPL RTRN CODE                     *
*/*    INTRNL CODE = 4 - TEMP ERROR, NO FMCB/NCB CORE                 *
*/*                  8 - LOGICAL ERROR,PAB DVT NAME NOT RESOLVED      *
*/*                                    (INVALID MODE NAME)            *
*/*                 12 - LOGICAL ERROR,NO PATH AVAILABLE TO NODE      *
*/*                 24 - SYSTEM ERROR,UNEXPECTED RC(NO DEB LOCK)      *
*/*   IF THE RTRN CODE IS A LOGICAL OR TEMPORARY ERROR                *
*/*     THEN FREE ANY FMCB/NCB CORE THAT IS HELD                      *
*/*     ELSE A SYSTEM ERROR OCCURRED & NOTHING MORE CAN BE DONE       *
*/*********************************************************************
*OCWRC = '14'X;     /* SET RC = TEMPORARY ERROR */                 1326
         MVI   OCWRC(COCWPTR),X'14'                                1326
*OCWEC = '01'X;     /* ERROR CODE = STORAGE UNAVAILABLE */         1327
         MVI   OCWEC(COCWPTR),X'01'                                1327
*IF CINTCODE = 8  /* IF FMCB-DVT ERROR OCCURRED */                 1328
*  THEN DO;                                                        1328
         CH    CINTCODE,@CH00061                                   1328
         BNE   @RF01328                                            1328
*        IF OCWCLOCK = '0'B      /* TEST FOR DAF LOCK HELD */      1330
*          THEN;                                                   1330
         TM    OCWCLOCK(COCWPTR),B'00010000'                       1330
         BZ    @RT01330                                            1330
*          ELSE DO;              /* DAF LOCK STILL HELD */         1332
*                OCWDAF = RPRDAF;       /* FILL DAF PORTION OF CID */
         L     @10,OCWDRDTE(,COCWPTR)                              1333
         MVC   OCWDAF(2,COCWPTR),RPRDAF(@10)                       1333
*                RFY CREG2 RSTD;  /* RSTRCT REG.2 FOR CID */       1334
*                CREG2 = OCWCID;        /* PUT CID IN REG.2 */     1335
*                                                                  1335
         L     CREG2,OCWCID(,COCWPTR)                              1335
*                 DO; /* CIDCTL(FINISH)  */                        1336
*                                                                  1336
*                 RFY (EMCR2,EMCR3) RSTD;                          1337
*                   GEN SETS(RPHWORK)                              1338
*        (STM EMCR0,EMCR15,RPHWORK(RPHPTR) SAVE REGS IN RPH);      1338
         STM EMCR0,EMCR15,RPHWORK(RPHPTR) SAVE REGS IN RPH
*                   EMCR3 = '00'X; /*CLEAR EXTRA BITS*/            1339
         SLR   EMCR3,EMCR3                                         1339
*                   CALL ATCLCPTR->ATCCDFIN->ISTSDCCR; /*PROCESS REQUES
**/                                                                1340
         L     @10,ATCLCPTR                                        1340
         L     @15,ATCCDFIN(,@10)                                  1340
         BALR  @14,@15                                             1340
*                 RFY (EMCR2,EMCR3) UNRSTD;                        1341
*                 END; /*CIDCTL*/  /* RELEASE DAF LOCK */          1342
*                OCWCLOCK = '0'B;  /* RESET DAF LOCK HELD FLAG */  1343
         NI    OCWCLOCK(COCWPTR),B'11101111'                       1343
*               END;                                               1344
*        OCWRC = '08'X;       /* R.C. = LOGICAL ERROR     */       1345
@RT01330 MVI   OCWRC(COCWPTR),X'08'                                1345
*        OCWEC = '4F'X;           /* E.C. = INVALID DVT       */   1346
         MVI   OCWEC(COCWPTR),X'4F'                                1346
*       END;                                                       1347
*  ELSE DO;                                                        1348
         B     @RC01328                                            1348
@RF01328 DS    0H                                                  1349
*        IF CINTCODE = 4   /* IF FMCB AND/OR NCB CORE ERROR */     1349
*          THEN;       /* GO DETERMINE WHICH */                    1349
         CH    CINTCODE,@CH00055                                   1349
         BE    @RT01349                                            1349
*          ELSE DO;                                                1351
*                IF CINTCODE = 12   /* IF ERROR WAS NO NXT NODE OPEN */
*                  THEN DO;                                        1352
         CH    CINTCODE,@CH00034                                   1352
         BNE   @RF01352                                            1352
*                        OCWRC = '08'X;      /* R.C. = SYSTEM ERR */
         MVI   OCWRC(COCWPTR),X'08'                                1354
*                        OCWEC = '4A'X;      /*  NO PATH AVAILABLE */
         MVI   OCWEC(COCWPTR),X'4A'                                1355
*                        END;                                      1356
*                  ELSE DO;                                        1357
         B     @RC01352                                            1357
@RF01352 DS    0H                                                  1358
*                        OCWRC = '24'X;     /* R.C. = SYSTEM ERR  */
         MVI   OCWRC(COCWPTR),X'24'                                1358
*                        OCWEC = '01'X;     /* E.C. = CONDIT SHOULD NOT
*                                                     OCCUR      */
         MVI   OCWEC(COCWPTR),X'01'                                1359
*                       END;                                       1360
*               END;                                               1361
@RC01352 DS    0H                                                  1362
*       END;                                                       1362
@RT01349 DS    0H                                                  1363
*IF OCWRC = '24'X        /* IF A SYST ERR OCCURRED  */             1363
*  THEN;                 /* RETURN TO CALLER */                    1363
@RC01328 CLI   OCWRC(COCWPTR),X'24'                                1363
         BE    @RT01363                                            1363
*  ELSE DO;              /* RELEASE FMCB - NCB CORE */             1365
*IF CFMCORE = '1'B   /* IF FMCB CORE OBTAINED */                   1366
*  THEN DO;                                                        1366
         TM    CFMCORE(COCWPTR),B'10000000'                        1366
         BNO   @RF01366                                            1366
*        IF FMCDNCBA ^= 0                                          1368
*          THEN                                                    1368
         L     @10,OCWFMCB(,COCWPTR)                               1368
         ICM   @07,15,FMCDNCBA(@10)                                1368
         BZ    @RF01368                                            1368
*            NCBFMCBA = FMCFMCBA; /*DEQ FMCB FROM FMCB-NCB         1369
*                                   CHAIN                    @DM07307*/
         L     @07,OCWNCB(,COCWPTR)                                1369
         MVC   NCBFMCBA(4,@07),FMCFMCBA(@10)                       1369
*          ELSE;                                           /*@DM07307*/
@RF01368 DS    0H                                                  1371
*        /*RELSTORE BUFADDR(OCWFMCB)*/                             1371
*         DO;                                                      1371
*/* ATBUILD (ISTATCVT,ISTRPH)  */                                  1372
*/* END OF ATBUILD */                                              1372
*        RFY (GPR02P,GPR03P,GPR04P,GPR15P) RSTD;                   1372
*         RFY (GPR01P,GPR13P) RSTD;                                1373
*         GENERATE REFS(GPR01P,GPR02P,GPR13P) SETS(RPHWORK);       1374
          STM GPR02P,GPR13P,RPHWORK(GPR01P)
*         RFY GPR13P UNRSTD;                                       1375
*         GPR04P=OCWFMCB;                                          1376
         L     GPR04P,OCWFMCB(,COCWPTR)                            1376
*         DCL 1 FMZA0254 FIXED(31) STATIC LOCAL,                   1377
*             2 * FIXED(8) INIT(64),                               1377
*             2 * PTR(24) INIT(0);                                 1377
*         GPR03F = FMZA0254;                                       1378
*                                                                  1378
         L     GPR03F,FMZA0254                                     1378
*        DO; /* LISATCVT CVTBASE(PAGEABLE,(GPR15P)) */             1379
*          GPR15P = ATCLCPTR; /*SET UP ATCVT POINTER*/             1380
         L     GPR15P,ATCLCPTR                                     1380
*        END; /*LISATCVT*/                                         1381
*         GPR02P = GPR15P->ATCBPDA;                                1382
         L     GPR02P,ATCBPDA(,GPR15P)                             1382
*         GPR15P=GPR15P->ATCSMRS;                                  1383
         L     GPR15P,ATCSMRS(,GPR15P)                             1383
*         DCL FMZL0254 BASED(GPR15P) LABEL VALUERANGE(*);          1384
*         CALL FMZL0254;                                           1385
         BALR  @14,@15                                             1385
*         RFY GPR13P RSTD;                                         1386
*         GENERATE REFS(GPR01P,RPHWORK) SETS(GPR02P,GPR13P);       1387
          LM GPR02P,GPR13P,RPHWORK(GPR01P)
*         RFY (GPR01P,GPR13P) UNRSTD;                              1388
*        RFY (GPR02P,GPR03P,GPR04P,GPR15P) UNRSTD;                 1389
*        END ;/**********END OF RELSTORE EXPANSION**********/   /* RELE
*SE FMCB CORE */                                                   1390
*       END;                                                       1391
*  ELSE;                                                   /*@DM07307*/
@RF01366 DS    0H                                                  1393
*        IF CNCBCORE = '1'B   /* IF NCB CORE OBTAINED */           1393
*          THEN DO;                                                1393
*                                                                  1393
         TM    CNCBCORE(COCWPTR),B'01000000'                       1393
         BNO   @RF01393                                            1393
*                /*----------------------------------------- @D31KKMP*/
*                /* THIS MODIFICATION WAS FOR DCR-3615.0     @D31KKMP*/
*                /*----------------------------------------- @D31KKMP*/
*                IF NCBTYPE = ICTYPE × /* IF NCB IS ICNCB OR @D31KKMP*/
*                   NCBTYPE = HCTYPE × /*    NCB IS HCNCB    @ZM32229*/
*                   NCBTYPE = LDTYPE   /*    NCB IS LDNCB    @D31KKMP*/
*                                                                  1395
*                  THEN DO;    /* FREESTOR ICNCB CORE  */          1395
         L     @10,OCWNCB(,COCWPTR)                                1395
         CLI   NCBTYPE(@10),X'06'                                  1395
         BE    @RT01395                                            1395
         CLI   NCBTYPE(@10),X'14'                                  1395
         BE    @RT01395                                            1395
         CLI   NCBTYPE(@10),X'07'                                  1395
         BNE   @RF01395                                            1395
@RT01395 DS    0H                                                  1396
*                        CBSIZE=NCBLNGTH*8; /* LNTH IN BYTES @XM00620*/
         L     @10,OCWNCB(,COCWPTR)                                1397
         SLR   @07,@07                                             1397
         IC    @07,NCBLNGTH(,@10)                                  1397
         SLA   @07,3                                               1397
         STH   @07,CBSIZE(,COCWPTR)                                1397
*                         /*FREESTOR AREA(OCWNCB)SIZE(CBSIZE)SAVE(YES)T
*PE(FIXED)*/                                                       1398
*                          DO;                                     1398
*/* ATBUILD (ISTPAB,ISTDYPAB,ISTATCVT,ISTRPH)  */                  1399
*/* END OF ATBUILD */     RFY (GPR00P,GPR01P,GPR02P,GPR03P) RSTD;  1399
*                         RFY ISTRPH BASED(GPR01P);                1400
*                         GEN REFS(GPR02P,GPR03P,GPR04P,GPR05P,    1401
*                                  GPR06P,GPR07P,GPR08P,GPR09P,    1401
*                                  GPR10P,GPR11P,GPR12P,GPR13P)    1401
*                             SETS(RPHWORK);                       1401
*                                                                  1401
         STM   GPR02P,GPR13P,RPHWORK(GPR01P)        SAVE REGISTERS
*                         GPR00F = CBSIZE;             /*SIZE IN REG0*/
         LH    GPR00F,CBSIZE(,COCWPTR)                             1402
*                         DCL 1 CMZA0270 FIXED(31) STATIC LOCAL,   1403
*                               2 * FIXED(8) INIT(64),             1403
*                                                    /* OPTION FLAGS */
*                               2 * FIXED(8) INIT(96),/* STORAGE KEY */
*                               2 * FIXED(8) INIT(227),            1403
*                                                  /* SUBPOOL NUMBER */
*                               2 * FIXED(8) INIT('01'X);          1403
*                                                    /* REQUEST TYPE */
*                         GPR03F = CMZA0270;                       1404
         L     GPR03F,CMZA0270                                     1404
*                         RFY (GPR04P) RSTD;                       1405
*                         GPR04P = OCWNCB;/*PUT FREEMAIN ADDR IN REG4*/
*                                                                  1406
         L     GPR04P,OCWNCB(,COCWPTR)                             1406
*                         DO; /* LISATCVT CVTBASE(PAGEABLE,(GPR02P)) */
*                           GPR02P = ATCLCPTR; /*SET UP ATCVT POINTER*/
         L     GPR02P,ATCLCPTR                                     1408
*                         END; /*LISATCVT*/                        1409
*                         CALL GPR02P -> ATCGTSTR;    /*CALL ISTORFSR*/
         L     @15,ATCGTSTR(,GPR02P)                               1410
         BALR  @14,@15                                             1410
*                         RFY (GPR00P,GPR01P,GPR02P,GPR03P,GPR04P) UNRS
*D;                                                                1411
*                         END ;                     /*END OF FREESTOR*/
*                       END;                                       1413
*                  ELSE DO;                                        1414
         B     @RC01395                                            1414
@RF01395 DS    0H                                                  1415
*                /*RELSTORE BUFADDR(OCWNCB)*/                      1415
*                 DO;                                              1415
*/* ATBUILD (ISTATCVT,ISTRPH)  */                                  1416
*/* END OF ATBUILD */                                              1416
*                RFY (GPR02P,GPR03P,GPR04P,GPR15P) RSTD;           1416
*         RFY (GPR01P,GPR13P) RSTD;                                1417
*         GENERATE REFS(GPR01P,GPR02P,GPR13P) SETS(RPHWORK);       1418
*                                                                  1418
          STM GPR02P,GPR13P,RPHWORK(GPR01P)
*         RFY GPR13P UNRSTD;                                       1419
*         GPR04P=OCWNCB;                                           1420
         L     GPR04P,OCWNCB(,COCWPTR)                             1420
*         DCL 1 FMZA0289 FIXED(31) STATIC LOCAL,                   1421
*             2 * FIXED(8) INIT(64),                               1421
*             2 * PTR(24) INIT(0);                                 1421
*         GPR03F = FMZA0289;                                       1422
*                                                                  1422
         L     GPR03F,FMZA0289                                     1422
*                DO; /* LISATCVT CVTBASE(PAGEABLE,(GPR15P)) */     1423
*                  GPR15P = ATCLCPTR; /*SET UP ATCVT POINTER*/     1424
         L     GPR15P,ATCLCPTR                                     1424
*                END; /*LISATCVT*/                                 1425
*         GPR02P = GPR15P->ATCBPDA;                                1426
         L     GPR02P,ATCBPDA(,GPR15P)                             1426
*         GPR15P=GPR15P->ATCSMRS;                                  1427
         L     GPR15P,ATCSMRS(,GPR15P)                             1427
*         DCL FMZL0289 BASED(GPR15P) LABEL VALUERANGE(*);          1428
*         CALL FMZL0289;                                           1429
         BALR  @14,@15                                             1429
*         RFY GPR13P RSTD;                                         1430
*         GENERATE REFS(GPR01P,RPHWORK) SETS(GPR02P,GPR13P);       1431
*                                                                  1431
          LM GPR02P,GPR13P,RPHWORK(GPR01P)
*         RFY (GPR01P,GPR13P) UNRSTD;                              1432
*                RFY (GPR02P,GPR03P,GPR04P,GPR15P) UNRSTD;         1433
*                END ;/**********END OF RELSTORE EXPANSION**********/
* /* RELSTORE NCB CORE */                                          1435
*                       END;                                       1435
*               END;                                               1436
*          ELSE;                                                   1437
@RF01393 DS    0H                                                  1438
*END;                                                              1438
@RC01393 DS    0H                                                  1439
*  /*SEGMENT(DOUNDO)FINISH*/DO;GOTO DOUNDO#;DOUNDO@:END;           1439
@RT01363 DS    0H                                                  1440
         B     DOUNDO#                                             1440
DOUNDO@  DS    0H                                                  1442
*  /*SEGMENT(DOLUNCB)START*/DO;GOTO DOLUNCB@;DOLUNCB:END;          1442
         B     DOLUNCB@                                            1443
DOLUNCB  DS    0H                                                  1445
*/*********************************************************************
*/*  GET CORE FOR THE LUNCB                                           *
*/*  IF CORE OBTAINED                                                 *
*/*    THEN 1. SAVE LUNCB ADDR IN OCW                                 *
*/*         2. STORE LUNCB LENGTH(DBL WRDS) & ID IN LUNCB             *
*/*  IF NO CORE WAS OBTAINED                                          *
*/*    SET INTERNAL CODE SO THAT OPEN DEST WILL FAIL                  *
*/*********************************************************************
* /*REQSTORE CBID(LUNCB)CLEAR(YES)SAVE(YES)*/                      1445
*  DO;                                                             1445
*/* ATBUILD (ISTDYPAB,ISTATCVT,ISTRPH)  */                         1446
*/* END OF ATBUILD */                                              1446
*                                                                  1446
* RFY (GPR02P,GPR03P,GPR04P,GPR15P) RSTD;                          1446
*                                                                  1446
* RFY (GPR01P,GPR13P) RSTD;                                        1447
*          GENERATE REFS(GPR01P,GPR02P,GPR13P) SETS(RPHWORK);      1448
*                                                                  1448
           STM GPR02P,GPR13P,RPHWORK(GPR01P)
* RFY (GPR01P,GPR13P) UNRSTD;                                      1449
*                                                                  1449
* DO; /* LISATCVT CVTBASE(PAGEABLE,(GPR15P)) */                    1450
*   GPR15P = ATCLCPTR; /*SET UP ATCVT POINTER*/                    1451
         L     GPR15P,ATCLCPTR                                     1451
* END; /*LISATCVT*/                                                1452
*          GPR02P=GPR15P->ATCBPDA × '80000000'X;                   1453
         L     GPR02P,ATCBPDA(,GPR15P)                             1453
         O     GPR02P,@CF02254                                     1453
*          DCL 1 FMZA0307 FIXED(31) STATIC LOCAL,                  1454
*              2 *        FIXED(8) INIT(152),                      1454
*              2 *        PTR(24) INIT(0);                         1454
*          GPR03F=FMZA0307;                                        1455
         L     GPR03F,FMZA0307                                     1455
*          GPR04F=31;                                              1456
         LA    GPR04F,31                                           1456
*          GPR15P=GPR15P->ATCSMRQ;                                 1457
         L     GPR15P,ATCSMRQ(,GPR15P)                             1457
*          DCL FMZL0307 BASED(GPR15P) LABEL VALUERANGE(*);         1458
*          CALL FMZL0307;                                          1459
*                                                                  1459
         BALR  @14,@15                                             1459
* RFY (GPR13P) RSTD;                                               1460
*          GENERATE REFS(GPR01P,RPHWORK) SETS(GPR02P,GPR13P);      1461
*                                                                  1461
           LM GPR02P,GPR13P,RPHWORK(GPR01P)
* RFY (GPR13P) UNRSTD;                                             1462
*                                                                  1462
* RFY (GPR02P,GPR03P,GPR04P,GPR15P) UNRSTD;                        1463
* END ;    /********* END OF REQSTORE EXPANSION **********/ /*GET LUNCB
*    @DM08415*/                                                    1464
*RFY CREG15 RSTD;                                                  1465
*IF CREG15 = 0       /* IF CORE OBTAINED */                        1466
*  THEN DO;                                                        1466
         LTR   CREG15,CREG15                                       1466
         BNZ   @RF01466                                            1466
*        OCWNCB = RPHSRPRM;     /* SAVE LUNCB ADDR */              1468
         L     @14,RPHSRPRM(,GPR01P)                               1468
         ST    @14,OCWNCB(,COCWPTR)                                1468
*        NCBLNGTH = (((LENGTH(ISTLUNCB)+7)×7)&&7)/8;   /* LUNCB LENGTH
*                                                       IN DBL WORDS */
         MVI   NCBLNGTH(@14),X'09'                                 1469
*        NCBTYPE = LUTYPE;     /* STORE NCB TYPE ID */             1470
*                                                                  1470
         MVI   NCBTYPE(@14),X'25'                                  1470
*        /*------------------------------------------------- @XL03HMP*/
*        /* THESE MODIFICATIONS WERE FOR DCR-3337.0          @XL03HMP*/
*        /*------------------------------------------------- @XL03HMP*/
*        RFY CPABPTR RSTD;  /* RSTRCT R.5 FOR TIP ADDR       @XL03HMP*/
*        RFY ISTPAB BASED(ADDR(LUNZC001));  /* LUNCB PAB BAZ @XL03HMP*/
*        CPABPTR = ADDR(FMCPAB4);   /* ADDR OF TIP           @XM07277*/
         L     CPABPTR,OCWFMCB(,COCWPTR)                           1473
         LA    CPABPTR,FMCPAB4(,CPABPTR)                           1473
*        PABDVTA = CPABPTR->PABDVTA;  /* COPY DVT @ FROM TIP @XM07277*/
         LA    @10,56                                              1474
         ALR   @10,@14                                             1474
         MVC   PABDVTA(3,@10),PABDVTA(CPABPTR)                     1474
*        PABOFFST = ADDR(LUNZC001) - OCWNCB;   /* CALC PAB   @XM07277
*                                                 OFFSET     @XM07277*/
         LA    @07,LUNZC001(,@14)                                  1475
         SLR   @07,@14                                             1475
         STC   @07,PABOFFST(,@10)                                  1475
*        PABNODQ = '1'B;  /* DO NOT DEQ WRK ELMNT            @XM07277*/
         OI    PABNODQ(@10),B'00000001'                            1476
*        RFY CPABPTR UNRSTD;   /* RLSE REG.5                 @XM07277*/
*       END;                                                       1478
*  ELSE DO;                /* LUNCB CORE PROBLEM, SO:        @DM08328*/
         B     @RC01466                                            1479
@RF01466 DS    0H                                                  1480
*        IF CREG15 = 4     /* IF SMS THRESHOLD ERROR         @DM08328*/
*          THEN            /*                                @DM08328*/
         CH    CREG15,@CH00055                                     1480
         BNE   @RF01480                                            1480
*           /*RELSTORE BUFADDR(RPHSRPRM)*/                         1481
*            DO;                                                   1481
*/* ATBUILD (ISTATCVT,ISTRPH)  */                                  1482
*/* END OF ATBUILD */                                              1482
*           RFY (GPR02P,GPR03P,GPR04P,GPR15P) RSTD;                1482
*         RFY (GPR01P,GPR13P) RSTD;                                1483
*         GENERATE REFS(GPR01P,GPR02P,GPR13P) SETS(RPHWORK);       1484
*                                                                  1484
          STM GPR02P,GPR13P,RPHWORK(GPR01P)
*         RFY GPR13P UNRSTD;                                       1485
*         GPR04P=RPHSRPRM;                                         1486
         L     GPR04P,RPHSRPRM(,GPR01P)                            1486
*         DCL 1 FMZA0326 FIXED(31) STATIC LOCAL,                   1487
*             2 * FIXED(8) INIT(64),                               1487
*             2 * PTR(24) INIT(0);                                 1487
*         GPR03F = FMZA0326;                                       1488
*                                                                  1488
         L     GPR03F,FMZA0326                                     1488
*           DO; /* LISATCVT CVTBASE(PAGEABLE,(GPR15P)) */          1489
*             GPR15P = ATCLCPTR; /*SET UP ATCVT POINTER*/          1490
         L     GPR15P,ATCLCPTR                                     1490
*           END; /*LISATCVT*/                                      1491
*         GPR02P = GPR15P->ATCBPDA;                                1492
         L     GPR02P,ATCBPDA(,GPR15P)                             1492
*         GPR15P=GPR15P->ATCSMRS;                                  1493
         L     GPR15P,ATCSMRS(,GPR15P)                             1493
*         DCL FMZL0326 BASED(GPR15P) LABEL VALUERANGE(*);          1494
*         CALL FMZL0326;                                           1495
         BALR  @14,@15                                             1495
*         RFY GPR13P RSTD;                                         1496
*         GENERATE REFS(GPR01P,RPHWORK) SETS(GPR02P,GPR13P);       1497
*                                                                  1497
          LM GPR02P,GPR13P,RPHWORK(GPR01P)
*         RFY (GPR01P,GPR13P) UNRSTD;                              1498
*           RFY (GPR02P,GPR03P,GPR04P,GPR15P) UNRSTD;              1499
*           END ;/**********END OF RELSTORE EXPANSION**********/ /*
*              @DM08328*/                                          1500
*        CINTCODE = 4;     /* SET INTERNAL CODE FOR NO CORE  @DM08328*/
@RF01480 LA    CINTCODE,4                                          1501
*       END;               /*                                @DM08328*/
*RFY CREG15 UNRSTD;                                                1503
@RC01466 DS    0H                                                  1504
*  /*SEGMENT(DOLUNCB)FINISH*/DO;GOTO DOLUNCB#;DOLUNCB@:END;        1504
         B     DOLUNCB#                                            1505
DOLUNCB@ DS    0H                                                  1507
*  /*SEGMENT(DOCCNCB)START*/DO;GOTO DOCCNCB@;DOCCNCB:END;          1507
         B     DOCCNCB@                                            1508
DOCCNCB  DS    0H                                                  1510
*/*********************************************************************
*/*  GET CORE FOR CCNCB                                               *
*/*  IF CORE WAS OBTAINED                                             *
*/*    THEN 1. SAVE CCNCB ADDR IN OCW                                 *
*/*         2. STORE CCNCB LENGTH(DBL WRDS) & ID IN CCNCB             *
*/*         3. SET 'CONFIG SICK' & 'CLUSTER START IN PROGRESS' FLAGS  *
*/*  IF NO CORE WAS OBTAINED                                          *
*/*    THEN SET INTERNAL CODE SO OPEN DEST WILL FAIL                  *
*/*********************************************************************
* /*REQSTORE CBID(CCNCB)CLEAR(YES)SAVE(YES)*/                      1510
*  DO;                                                             1510
*/* ATBUILD (ISTDYPAB,ISTATCVT,ISTRPH)  */                         1511
*/* END OF ATBUILD */                                              1511
*                                                                  1511
* RFY (GPR02P,GPR03P,GPR04P,GPR15P) RSTD;                          1511
*                                                                  1511
* RFY (GPR01P,GPR13P) RSTD;                                        1512
*          GENERATE REFS(GPR01P,GPR02P,GPR13P) SETS(RPHWORK);      1513
*                                                                  1513
           STM GPR02P,GPR13P,RPHWORK(GPR01P)
* RFY (GPR01P,GPR13P) UNRSTD;                                      1514
*                                                                  1514
* DO; /* LISATCVT CVTBASE(PAGEABLE,(GPR15P)) */                    1515
*   GPR15P = ATCLCPTR; /*SET UP ATCVT POINTER*/                    1516
         L     GPR15P,ATCLCPTR                                     1516
* END; /*LISATCVT*/                                                1517
*          GPR02P=GPR15P->ATCBPDA × '80000000'X;                   1518
         L     GPR02P,ATCBPDA(,GPR15P)                             1518
         O     GPR02P,@CF02254                                     1518
*          DCL 1 FMZA0344 FIXED(31) STATIC LOCAL,                  1519
*              2 *        FIXED(8) INIT(152),                      1519
*              2 *        PTR(24) INIT(0);                         1519
*          GPR03F=FMZA0344;                                        1520
         L     GPR03F,FMZA0344                                     1520
*          GPR04F=32;                                              1521
         LA    GPR04F,32                                           1521
*          GPR15P=GPR15P->ATCSMRQ;                                 1522
         L     GPR15P,ATCSMRQ(,GPR15P)                             1522
*          DCL FMZL0344 BASED(GPR15P) LABEL VALUERANGE(*);         1523
*          CALL FMZL0344;                                          1524
*                                                                  1524
         BALR  @14,@15                                             1524
* RFY (GPR13P) RSTD;                                               1525
*          GENERATE REFS(GPR01P,RPHWORK) SETS(GPR02P,GPR13P);      1526
*                                                                  1526
           LM GPR02P,GPR13P,RPHWORK(GPR01P)
* RFY (GPR13P) UNRSTD;                                             1527
*                                                                  1527
* RFY (GPR02P,GPR03P,GPR04P,GPR15P) UNRSTD;                        1528
* END ;    /********* END OF REQSTORE EXPANSION **********/  /* GET CCN
*B   @DM09359*/                                                    1529
*RFY CREG15 RSTD;                                                  1530
*IF CREG15 = 0     /* IF CORE OBTAINED */                          1531
*  THEN DO;                                                        1531
         LTR   CREG15,CREG15                                       1531
         BNZ   @RF01531                                            1531
*        OCWNCB = RPHSRPRM;    /* SAVE CCNCB ADDR */               1533
         L     @14,RPHSRPRM(,GPR01P)                               1533
         ST    @14,OCWNCB(,COCWPTR)                                1533
*        NCBLNGTH = (((LENGTH(ISTCCNCB)+7)×7)&&7)/8;   /* CCNCB LENGTH
*                                                       IN DBL WORDS */
         MVI   NCBLNGTH(@14),X'07'                                 1534
*        NCBTYPE = CCTYPE;    /* STORE CCNCB ID */                 1535
*                                                                  1535
         MVI   NCBTYPE(@14),X'15'                                  1535
*        /*------------------------------------------------- @D31KKMP*/
*        /* THIS MODIFICATION WAS FOR DCR-3412.2             @D31KKMP*/
*        /*------------------------------------------------- @D31KKMP*/
*        NCBCONF = '1'B;      /* SET CONFIG SICK FLAG        @D31KKMP*/
*                                                                  1536
         OI    NCBCONF(@14),B'01000000'                            1536
*        /*------------------------------------------------- @D31KKMP*/
*        /* THIS MODIFICATION WAS FOR DCR-3337.0             @D31KKMP*/
*        /*------------------------------------------------- @D31KKMP*/
*        CCNSTART = '1'B;  /* CLSTR START IN PROGRESS        @D31KKMP*/
*                                                                  1537
         OI    CCNSTART(@14),B'01000000'                           1537
*       END;                                                       1538
*  ELSE DO;                /* CCNCB CORE PROBLEM, SO:        @DM08328*/
         B     @RC01531                                            1539
@RF01531 DS    0H                                                  1540
*        IF CREG15=4       /* IF SMS THRESHOLD ERROR         @DM08328*/
*          THEN            /*                                @DM08328*/
         CH    CREG15,@CH00055                                     1540
         BNE   @RF01540                                            1540
*           /*RELSTORE BUFADDR(RPHSRPRM)*/                         1541
*            DO;                                                   1541
*/* ATBUILD (ISTATCVT,ISTRPH)  */                                  1542
*/* END OF ATBUILD */                                              1542
*           RFY (GPR02P,GPR03P,GPR04P,GPR15P) RSTD;                1542
*         RFY (GPR01P,GPR13P) RSTD;                                1543
*         GENERATE REFS(GPR01P,GPR02P,GPR13P) SETS(RPHWORK);       1544
*                                                                  1544
          STM GPR02P,GPR13P,RPHWORK(GPR01P)
*         RFY GPR13P UNRSTD;                                       1545
*         GPR04P=RPHSRPRM;                                         1546
         L     GPR04P,RPHSRPRM(,GPR01P)                            1546
*         DCL 1 FMZA0363 FIXED(31) STATIC LOCAL,                   1547
*             2 * FIXED(8) INIT(64),                               1547
*             2 * PTR(24) INIT(0);                                 1547
*         GPR03F = FMZA0363;                                       1548
*                                                                  1548
         L     GPR03F,FMZA0363                                     1548
*           DO; /* LISATCVT CVTBASE(PAGEABLE,(GPR15P)) */          1549
*             GPR15P = ATCLCPTR; /*SET UP ATCVT POINTER*/          1550
         L     GPR15P,ATCLCPTR                                     1550
*           END; /*LISATCVT*/                                      1551
*         GPR02P = GPR15P->ATCBPDA;                                1552
         L     GPR02P,ATCBPDA(,GPR15P)                             1552
*         GPR15P=GPR15P->ATCSMRS;                                  1553
         L     GPR15P,ATCSMRS(,GPR15P)                             1553
*         DCL FMZL0363 BASED(GPR15P) LABEL VALUERANGE(*);          1554
*         CALL FMZL0363;                                           1555
         BALR  @14,@15                                             1555
*         RFY GPR13P RSTD;                                         1556
*         GENERATE REFS(GPR01P,RPHWORK) SETS(GPR02P,GPR13P);       1557
*                                                                  1557
          LM GPR02P,GPR13P,RPHWORK(GPR01P)
*         RFY (GPR01P,GPR13P) UNRSTD;                              1558
*           RFY (GPR02P,GPR03P,GPR04P,GPR15P) UNRSTD;              1559
*           END ;/**********END OF RELSTORE EXPANSION**********/ /*
*              @DM08328*/                                          1560
*        CINTCODE = 4;     /* SET INTERNAL CODE FOR NO CORE  @DM08328*/
@RF01540 LA    CINTCODE,4                                          1561
*       END;               /*                                @DM08328*/
*RFY CREG15 UNRSTD;                                                1563
@RC01531 DS    0H                                                  1564
*  /*SEGMENT(DOCCNCB)FINISH*/DO;GOTO DOCCNCB#;DOCCNCB@:END;        1564
*                                                                  1564
*                                                                  1564
         B     DOCCNCB#                                            1565
DOCCNCB@ DS    0H                                                  1567
*/* TPEPILOG   */                                                  1567
* GEN (PRINT OFF);                                                 1567
*                                                                  1567
         PRINT OFF
*/* LOGICAL CHANNEL COMMAND WORD                                      *
*/* ADD A DECLARE                                      003 10/18/74   *
*DCL  1  ISTLCCW BDY(WORD) BASED,                                  1568
*        2  LCCWOP    CHAR(1),         /* OPERATION CODE -CONTROL     *
*           3  LCCWSI BIT(1),          /* SESS INIT / START DIALOG FLG*
*           3  LCCWSD BIT(1),          /* SESS DISCON/END DIALOG FLG  *
*           3  LCCWRWOP BIT(6),        /* READ/WRITE OPERATION CODE   *
*              4  * BIT(1),            /* RESERVED                    *
*              4  LCCWSOP BIT(1),      /* SPECIAL OPERATION LIKE   1568
*                                         ERASE OR READ CONT          *
*              4  LCCWCTL BIT(4),      /* CONTROL TYPE                *
*                 5  LCCWMODE BIT(2),  /* MODE TYPE                   *
*                 5  LCCWTYPE BIT(2),  /* OPERATION TYPE              *
*        2  LCCWFLAG  CHAR(1),         /* FLAG BYTE                   *
*           3  LCCWCD BIT(1),          /* CHAIN DATA                  *
*           3  LCCWCC BIT(1),          /* CHAIN COMMAND               *
*           3  LCCWCKPT BIT(1),        /* SUPPRESS 3705 CHECK POINT
*                                         RECORD                      *
*           3  LCCWNTVC BIT(1),        /* DO NOT PERFORM VALCHEK      *
*           3  LCCWIDAT BIT(1),        /* LCCWDATA CONTAINS DATA      *
*           3  LCCWLSI BIT(1),         /* LCCW SYNCH INDICATOR        *
*              4  LCCWPER BIT(1),      /* POST=RESP                   *
*           3  LCCWRFI BIT(1),         /* REQUEST FEEDBACK INDICATOR  *
*           3  LCCWACI BIT(1),         /* ADDITION COMMAND INDICATOR  *
*        2  LCCWCNT FIXED(16),         /* DATA COUNT                  *
*        2  LCCWDATA PTR(31);          /* DATA ADDRESS OR IMMED. DATA *
*/* LOGICAL COMMAND CODES */                                       1569
*DCL  LXDQ     BIT(8) CONSTANT('3B'X), /* RESET DEVICE QUEUE          *
*     LXEC     BIT(8) CONSTANT('4B'X), /* RESET AT END OF COMMAND     *
*     LXO      BIT(8) CONSTANT('5B'X), /* RESET ORDERLY               *
*     LCCWPRGE BIT(8) CONSTANT('6B'X), /* PURGE                       *
*     LWH      BIT(8) CONSTANT('0F'X), /* WRITE HEADER INDI. 1ST BLOCK*
*     LWRVI    BIT(8) CONSTANT('1F'X), /* WRITE RVI                   *
*     LWNA     BIT(8) CONSTANT('2F'X), /* WRITE NEGATIVE ACK          *
*     LWAA     BIT(8) CONSTANT('3F'X), /* WRITE ALTERNATE ACK         *
*     LWPLG    BIT(8) CONSTANT('5F'X), /* WRITE ACK LEADING GRAPHICS  *
*     LWNLG    BIT(8) CONSTANT('6F'X), /* WRITE NACK LEADING GRAPHICS *
*     LSMDE    BIT(8) CONSTANT('4F'X), /* SET MODE                    *
*     LIFBM    BIT(8) CONSTANT('7F'X), /* INDIC 1ST BLOCK OF MESSAGE  *
*     LTEST    BIT(8) CONSTANT('FE'X), /* TEST LCCW                   *
*     LPRMPT   BIT(8) CONSTANT('13'X), /* PREEMPT LCCW                *
*     LRSTR    BIT(8) CONSTANT('43'X), /* RESTORE LCCW                *
*     LEXEC    BIT(8) CONSTANT('FF'X), /* SPECIAL CONTROL OPERATION   *
*     LREAD    BIT(2) CONSTANT('10'B),  /* READ TYPE LCCW             *
*     LWRITE   BIT(2) CONSTANT('01'B),  /* WRITE TYPE LCCW            *
*     LCNTRL   BIT(2) CONSTANT('11'B),  /* CONTROL TYPE LCCW          *
*     LRESET   BIT(4) CONSTANT('1011'B),/* RESET COMMANDS             *
*     LTIC     BIT(8) CONSTANT('08'X),  /* LOGICAL TIC                *
*     LWR      BIT(6) CONSTANT('000001'B),  /* WRITE CONVERSATIONAL   *
*     LWB      BIT(6) CONSTANT('000101'B),  /* WRITE BLOCK            *
*     LWM      BIT(6) CONSTANT('001001'B),  /* WRITE MESSAGE          *
*     LWT      BIT(6) CONSTANT('001101'B),  /* WRITE TRANSMISSION     *
*     LEWM     BIT(6) CONSTANT('011001'B),  /* ERASE/WRITE MESSAGE    *
*     LEWT     BIT(6) CONSTANT('011101'B),  /* ERASE/WRITE TRNSMSSN   *
*     LEAU     BIT(6) CONSTANT('010001'B),  /* ERASE ALL UNPROTECTED  *
*     LRB      BIT(6) CONSTANT('000110'B),  /* READ BLOCK             *
*     LRM      BIT(6) CONSTANT('001010'B),  /* READ MESSAGE           *
*     LRT      BIT(6) CONSTANT('001110'B),  /* READ TRANSMISSION      *
*     LRMOD    BIT(6) CONSTANT('010010'B),  /* READ MODIFIED          *
*     LRBUF    BIT(6) CONSTANT('010110'B),  /* READ BUFFER            *
*     LRCONT   BIT(6) CONSTANT('011010'B),  /* READ CONTINUOUS        *
*     LRPEP    BIT(6) CONSTANT('011110'B),  /* READ PERPETUAL         *
*     LCPYM    BIT(6) CONSTANT('101001'B),  /* COPY MESSAGE           *
*     LCPYT    BIT(6) CONSTANT('101101'B),  /* COPY TRANSMISSION      *
*     LD       BIT(8) CONSTANT('23'X),  /* DISCONNECT                 *
*     LDEC     BIT(8) CONSTANT('33'X),  /* DISCONNECT WITH END OF CALL*
*     LEOC     BIT(8) CONSTANT('53'X),  /* END OF CALL COMMAND        *
*     LXEL     BIT(8) CONSTANT('0B'X),  /* RESET ERROR LOCK           *
*     LXC      BIT(8) CONSTANT('1B'X),  /* RESET CONDITIONAL          *
*     LXI      BIT(8) CONSTANT('2B'X),  /* RESET IMMEDIATE            *
*     LC       BIT(8) CONSTANT('03'X),  /* CONTACT                    *
*     LWPA     BIT(8) CONSTANT('FD'X); /* WRITE POSITIVE ACK          *
*DCL  LMT      BIT(2) CONSTANT('11'B), /* TRANSMISSION MODE           *
*     LMS      BIT(2) CONSTANT('00'B), /* SPECIAL MODE LIKE CONV, EAU *
*     LMB      BIT(2) CONSTANT('01'B), /* BLOCK MODE                  *
*     LMM      BIT(2) CONSTANT('10'B); /* MSG OR CONTINUOUS MODE      *
*/* FOLLOWING EQUATES FOR  - PORT SOLICITOR (DIAL)                    *
*/* PORT SOLICITOR COMMAND CODES                                      *
*DCL PSOL    BIT(8) CONSTANT('FE'X), /* SPECIAL PORT SOLICITOR     1571
*                                       COMMAND                       *
*    STCTL    BIT(8) CONSTANT('01'X), /* START CONTROL                *
*    RESTCTL  BIT(8) CONSTANT('02'X), /* RESET & CONTROL - REDRIVE    *
*    STIPUT   BIT(8) CONSTANT('03'X); /* START INPUT                  *
*/*   FOLLOWING EQUATES FOR SDLC SUPPORT                              *
*DCL  LCCHOLD  BIT(8) CONSTANT('01'X),  /* HOLD                       *
*     LCCRHOLD BIT(8) CONSTANT('02'X),  /* RELEASE HOLD               *
*     LSEND    BIT(8) CONSTANT ('F1'X), /* SEND                       *
*     LCLEAR   BIT(8) CONSTANT ('F2'X), /* CLEAR                      *
*     LCRUD    BIT(8) CONSTANT ('F3'X), /* CLEAR, UNBIND              *
*     LCRUDNFY BIT(8) CONSTANT ('F4'X), /* CLEAR, UNBIND, NOTIFY      *
*     LNFY     BIT(8) CONSTANT ('F5'X), /* NOTIFY                     *
*     LRELCB   BIT(8) CONSTANT ('F6'X), /* RELEASE CB                 *
*     LRESTSR  BIT(8) CONSTANT ('F7'X), /* RESETSR                    *
*     LCLRNFY  BIT(8) CONSTANT('F8'X),  /* CLEAR/NOTIFY               *
*     LCHPUR   BIT(8) CONSTANT('F9'X);  /* PURGE                      *
*DCL  LCCWSIZE FIXED(8) CONSTANT(8);    /* LCCW SIZE                  *
*DCL  LRDS     BIT(8) CONSTANT('FF'X);  /* RECORD DEV STATS COMMAND   *
*DCL  LQUIS    BIT(8) CONSTANT('FE'X);  /* QUIESCE COMMAND            *
*/*              LOGICAL CHANNEL PROGRAM BLOCK                       */
*/*                                                                  */
*/*  REVISIONS                                         007 05/19/75  */
*/*                                                                  */
*DCL  1  ISTLCPB BDY(WORD) BASED(LCPBPTR),                         1576
*        2 LCPTYPE CHAR(1),            /* TYPE CODE                  */
*        2 LCPLNGTH  PTR(8),           /* LENGTH IN BYTES            */
*        2 LCPREQTG CHAR(2),           /* LCPB REQ. TAG FIELD        */
*          3 LCPFLAGS BIT(8),          /* FLAG BYTE                  */
*            4 LCPZRT00 BIT(1),        /* LOGICAL ERROR FLAG         */
*            4 LCPZRT01 BIT(1),        /* CONTROL BLOCK ERROR        */
*            4 LCPZF001 BIT(1),        /* LCP START PROCESS FLAG     */
*              5 LCPZRT02 BIT(1),      /* I/O INITIATION DISABLED    */
*                6 LCPZRTL2 BIT(1),    /* END OF SCHEDULABLE BLOCK   */
*            4 LCPZF002 BIT(1),        /* LCP IN PROCESSING FLAG     */
*              5 LCPZRT03 BIT(1),      /* GO LOOK AT FMCB LINE STATE */
*                                      /* FIELD (REQ. TAG OVERLAY)   */
*                6 LCPZRTL3 BIT(1),    /* WRITE/READ REQUEST         */
*            4 LCPZF003 BIT(1),        /* LCP PROCESSING COMPLETE FLAG*
*              5 LCPZRT04 BIT(1),      /* STPR SET IN BDU FLAG       */
*                                      /* (REQ. TAG OVERLAY)         */
*                6 LCPZRTL4 BIT(1),    /* FEEDBACK REQUESTED         */
*            4 LCPZF004 BIT(1),        /* SINGLE LCCW/LCP FLAG       */
*              5 LCPZRT05 BIT(1),      /* FEEDBACK TO BE ROUTED TO   */
*                                      /* ICNCB FMCB (REQ. TAG       */
*                                      /* OVERLAY)                   */
*                6 LCPZRTL5 BIT(1),    /* DECREMENT SCHED COUNT ON DEQ*
*            4 LCPZRT06 BIT(1),        /* CRITICAL TEXT BLOCK        */
*                                      /* FLAG (REQ. TAG OVERLAY)    */
*              5 LCPZRTL6 BIT(1),      /* WRITE REQUEST              */
*            4 LCPZRT07 BIT(1),        /* BUFFER TRACE ACTIVE        */
*                                      /* FLAG (REQ. TAG OVERLAY)    */
*              5 LCPZRTL7 BIT(1),      /* SCHEDULING FLAG            */
*          3 LCPMNRCD CHAR(1),         /* LCP MINOR REJECTION CODE   */
*            4 LCPZRT08 BIT(1),        /* I/O TRACE ACTIVE FLAG      */
*                                      /* (REQ. TAG OVERLAY)         */
*              5 LCPZRTL8 BIT(1),      /* DEVICE END NOTIFICATION    */
*            4 LCPZRT09 BIT(1),        /* DIALOGUE SCHED DISABLED    */
*              5 LCPZRTL9 BIT(1),      /* CRITICAL TEXT FLAG         */
*            4 LCPZRT0A BIT(1),        /* SIMULATED CONTACT FLAG     */
*            4 LCPZRT0B BIT(1),        /* SIMULATED DISCONNECT FLAG  */
*        2 LCPCHAIN PTR(31),           /* APS CHAIN                  */
*          3 LCPCHAI1 PTR(8),                                      1576
*            4 LCPCHNG BIT(1),         /* GATE BIT                   */
*          3 LCPCHAI2 PTR(24),         /* ADDRESS FIELD              */
*        2 LCPRUCNT PTR(8),            /* NUMBER OF RU FOR THIS LCPB */
*          3 LCPZMIRC CHAR(1),         /* MINOR RETURN CODE          */
*        2 LCPFLAG2 CHAR(1),           /* SECOND FLAG BYTE           */
*          3 LCPPRFLG BIT(1),          /* PACING REQUIRED            */
*          3 LCPASYN  BIT(1),          /* ASYNCHRONOUS LCPB          */
*          3 LCPRSTRT BIT(1),          /* RESTART LCPB               */
*          3 LCPTLBPI BIT(1),          /* TPIOS BLOCK LCCW           */
*            4 LCPZRIMM BIT(1),        /* RESET IMMED REQUIRED ON ERR*/
*          3 LCPFID0  BIT(1),          /* FID0 TH INDICATOR FOR RECORD*
*            4 LCPEXRES BIT(1),        /* EXCEP. RESPONSE SPEC. 3270R*/
*          3 LCPDSTAT BIT(1),          /* DIALOGUE STATE BIT, 3270R  */
*                                      /* 0=REQ. REJECT,1=STATE ERROR*/
*          3 LCPFREE  BIT(1),          /* DEALLOCATE LCPB 3270R      */
*          3 LCPATOP  BIT(1),          /* ATOP LCPB  3270R           */
*        2 LCPSEQ   FIXED(16),         /* OUTBOUND SEQUENCE NUMBER   */
*          3 LCPRRCCT PTR(8),          /* COUNT OF RESPONSES RECEIVED*/
*          3 LCPRRCNT PTR(8),          /* COUNT OF RESPONSES REQUESTED*
*        2 LCPLCCW1 PTR(31),           /* ADDR FIRST LCCW FOR FID1   */
*        2 LCPCID CHAR(4) BDY(WORD),   /* COMMUNICATION ID           */
*          3 LCPSAF BIT(16),           /* SOURCE IDENTIFICATION      */
*          3 LCPDAF BIT(16),           /* DESTINATION IDENTIFICATION */
*        2 LCPNXLCW PTR(31),           /* ADDR NEXT LCCW             */
*        2 LCPFDBA PTR(31),            /* BTU ADDRESS                */
*          3 LCPFDB1 PTR(8),                                       1576
*          3 LCPFDB2 PTR(24),          /* ADDRESS FIELD              */
*        2 LCPTLBAD PTR(31),           /* ADDRESS OF TLB             */
*        2 LCPFOSN  BIT(16),           /* SEQUENCE NUMBER FIRST RU   */
*        2 LCPFSNCH FIXED(16),         /* 1ST SEQ NUMBER IN RU CHAIN */
*        2 LCPSTYPE FIXED(8),          /* LCPB SUB-TYPE X'FF' = RESET,*
*                                      /* X'00' = NON-RESET          */
*        2 LCPFLG1 CHAR(1),            /* FLAGS                      */
*          3 LCPRESET BIT(1),          /* A TPQUE WITH RESET QUEUED  */
*                                      /* THIS ELEMENT               */
*          3 LCPINTER BIT(1),          /* INTERNAL LCPB              */
*          3 LCPDIRPT BIT(1),          /* NOT SEND W/POST=SCHED=0    */
*          3 LCPREDRV BIT(1),          /* LCPB IS FOR REDRIVE        */
*          3 LCPSTLB  BIT(1),          /* TLB NOT TO BE FREED        */
*          3 LCPTRANS BIT(1),          /* DATA INCLUDES CONTROL CHARS*/
*          3 LCPRSV78 BIT(2),          /* RESERVED                   */
*        2 LCPLCCWC BIT(8),            /* COUNT OF LCCWS             */
*        2 LCPRSV77 CHAR(1),           /* RESERVED                   */
*        2 LCPFLCCW PTR(31),           /* ADDR OF FIRST LCCW         */
*          3 LCPUBFSB PTR(31),         /* UNBIND FSB ADDRESS         */
*        2 LCPCLREP PTR(31),           /* PTR TO CLEAR LCPB IN UCB   */
*/*  NOTE:  THE FOLLOWING FIELD - LCPLCCW MUST BE THE LAST FIELD     */
*/*         IN THIS CONTROL BLOCK.  THE CONTROL BLOCK ISTDCLCP HAS   */
*/*         FIELDS IN IT WHICH MUST BE CONTIGUOUS WITH LCPLCCW       */
*        2 LCPLCCW  CHAR(LENGTH(ISTLCCW)) BDY(WORD), /* FIRST LCCW   */
*          3 LCPRSTQH PTR(31),         /* RESET LCPB QUEUE HEADER    */
*          3 LCPPABA  PTR(31),         /* PAB POINTER                */
*            4 LCPRPHA  PTR(31),       /* RPH POINTER                */
*              5 LCPFTYPE BIT(1);      /* FEEDBACK TYPE              */
*/*     CONSTANTS FOR LCPTYPE                                         *
*DCL  LCRPHFT  BIT(1) CONSTANT('1'B);                              1577
*DCL  LCPABFT  BIT(1) CONSTANT('0'B);                              1578
*DCL LCPBFIRM BIT(8) CONSTANT('10'X);  /* LU FAILED, CLSDST, SCHED LOST
*                                         TERM, OPNDST MAY BE TRIED   *
*DCL LCPBTERM BIT(8) CONSTANT('11'X);  /* TERM RECEIVED,CLSDST,    1580
*                                         SCHED LOST TERM             *
*/*                                                                   *
*                                                                  1581
*DCL 1 LCPZTIE BDY(WORD) DEFINED(LCPCID), /* TOLTEP INTERFACE      1581
*                                         ELEMENT OVERLAY            */
*       2  LCPZFMCA PTR(31),           /* ACTIVE FMCB ADDRESS        */
*       2  LCPZSNA PTR(31),            /* SYMBOLIC NAME ADDRESS      */
*       2  LCPZSNAM CHAR(8) BDY(WORD), /* SYMBOLIC NAME              */
*          3  LCPZTRV1 PTR(31),        /* RESERVED FOR RESTORE LCP   */
*          3  LCPZTRV4 PTR(31);        /* RESERVED FOR RESTORE LCP   */
*DCL LCTYPE BIT(8) CONSTANT('04'X);                                1582
*DCL PLCPTYPE BIT(8) CONSTANT('28'X);  /* PURGE LCPB TYPE ID         */
*DCL LCPCLACB BIT(8) CONSTANT('04'X);  /* LCPB FROM CLOSE ACB        */
*DCL LSRSTYPE BIT(8) CONSTANT('FF'X);  /* RESET SUBTYPE              */
*DCL LCPETYPE BIT(8) CONSTANT('40'X);  /* EXTENDED LCPB TYPE ID      */
*/*                                                                  */
*/*  MINOR RETURN CODES                                              */
*/*                                                                  */
*DCL LCMCRSTR BIT(8) CONSTANT('F7'X),  /* MINOR RC FOR RESETSR       */
*    LCPMNEW  BIT(8) CONSTANT('02'X),  /* EARLY WARNING,             */
*                                      /* RECOVERY IN PROGRESS       */
*    LCPMNPF  BIT(8) CONSTANT('03'X),  /* PERM. I/O FAILURE          */
*    LCPMNAS  BIT(8) CONSTANT('04'X),  /* AUTO NETWORK SHUTDOWN      */
*    LCPMNCL  BIT(8) CONSTANT('06'X),  /* CLOSE/CLSDST OCCURED       */
*    LCPMNVD  BIT(8) CONSTANT('07'X),  /* VARY DEACTIVATE            */
*    LCPMNTF  BIT(8) CONSTANT('10'X),  /* TEMP RECORD DEVICE FAILURE */
*    LCPMNSF  BIT(8) CONSTANT('01'X),  /* TEMP BASIC FAILURE /       */
*    LCPMNTS  BIT(8) CONSTANT('11'X),  /* TERMINATE SELF             */
*    LCPMNAP  BIT(8) CONSTANT('0A'X),  /* APPL. ISSUED CLEAR         */
*    LCPMNPR  BIT(8) CONSTANT('0B'X),  /* PREEMPT                    */
*    LCPMNRE  BIT(8) CONSTANT('0C'X);  /* RESTORE                    */
*/* VS1, VS2 TPIOS SAVEAREA FORMAT */                              1588
*DCL  1  ISTZSAVE BDY(WORD) BASED,                                 1588
*        2   ZSAZSVBC PTR(31),         /* SAVEAREA BACK CHAIN        */
*            3   ZSAZSVMS CHAR(1),     /* MODULE TRACE CODE          */
*                4 ZSAZACTV BIT(1),    /* ACTIVE SAVE AREA FLAG      */
*        2   ZSAZSVFC PTR(31),         /* SAVEAREA FORWARD CHAIN     */
*        2   ZSAZSVRR PTR(31),         /* RETURN REGISTER            */
*        2   ZSAZSVVR (6) PTR(31),    /* VARIABLE REGS (7-12) SVEAREA*/
*        2   ZSAZTRAC CHAR(4);        /* EBCDIC NAME OF OWNER        */
*/*                                                                1589
*THE FOLLOWING EQUATES SHOULD READ ''FIXED(8) CONSTANT(LENGTH(X))'',
*WHERE X IS THE NAME OF THE VARIABLE CONTROL BLOCK OR FIELD OF WHICH
*LENGTH IS THE VALUE BEING EQUATED, SHOULD THE PLS COMPILER BE     1589
*BE ABLE TO TAKE IT.                                               1589
*                                                                    */
*DCL ZSAZSVVA FIXED(8) CONSTANT(8);  /* DISPLACEMENT TO VARIABLE REGS*/
*DCL ZSAZSVSZ FIXED(8) CONSTANT(40); /* LENGTH OF ISTZSAVE           */
*/* PREFIX FOR CRR                                                   */
*/*                                                                  */
*/* RELEASE 1 - JUNE 28, 1973                                        */
*/*                                                                  */
*DCL 1 ISTPFCRR BASED BDY(WORD),        /* PREFIX FOR CRR            */
*     2  PFCCRR   CHAR(4),              /* CRR HEADER                */
*        3  PFCCRRID CHAR(1),           /* CRR ID FIELD              */
*           4  CRRID CHAR(1),           /* BASIC CTL LAYER DEFINITION*/
*        3  PFCRSV10 CHAR(1),           /* RESERVED FOR ALIGNMENT    */
*        3  PFCCRRLN CHAR(2),           /* CRR LENGTH                */
*           4  CRRLEN CHAR(2),          /* BASIC CTL LAYER DEF       */
*     2  PFCHDR CHAR(8) BDY(WORD),      /* SAVE AREA FOR OLD CRR FRR */
*        3  PFCCRRO  PTR(31),           /* PTR TO OLD CRR            */
*           4  CRRCHAIN PTR(31),        /* BASIC CTL LAYER DEFINITION
*                                          FOR OLD CRR PTR           */
*        3  PFCFRRO  PTR(31),           /* PTR TO OLD FRR            */
*           4  CRRFRR   PTR(31),        /* BASIC CTL LAYER         1591
*                                          DEFINITION OF OLD FRR PTR */
*     2  PFCFTA BIT(8),                 /* ID OF LAST FUNCTION TRACED*/
*     2  PFCRSV01 CHAR(3);              /* ALIGNMENT                 */
*DCL PFIDPIE BIT(8) CONSTANT('80'X);    /* DOS/VS TPIOS              */
*DCL PFIDORE BIT(8) CONSTANT('81'X);    /* DOS/VS BMS                */
*DCL PFIDAPE BIT(8) CONSTANT('82'X);    /* DOS/VS PSS                */
*DCL PFCIDPSV BIT(8) CONSTANT('38'X); /* COMPONENT ID              1595
*                                          PSS - VS1 AND 2           */
*DCL PFCIDTPV BIT(8) CONSTANT('3C'X); /* COMPONENT ID              1596
*                                          TPIOS VS1 AND 2           */
*DCL PFCIDSME BIT(8) CONSTANT('3D'X); /* COMPONENT ID              1597
*                                          STORAGE MANAGEMENT DOS    */
*DCL PFCIDOC BIT(8) CONSTANT('31'X);    /* COMPONENT ID OPEN/CLOSE   */
*DCL PFCIDPS BIT(8) CONSTANT('32'X);    /* PORT SOLICITOR            */
*DCL PFCIDCS BIT(8) CONSTANT('34'X);    /* CLUSTER SOLICITOR         */
*DCL PFCIDIT BIT(8) CONSTANT('35'X);    /* INIT/TERM                 */
*DCL PFCIDVY BIT(8) CONSTANT('36'X);    /* VARY                      */
*DCL PFCIDNS  BIT(8) CONSTANT('37'X);   /* NET. STAT.SRV.            */
*DCL PFCIDTPE BIT(8) CONSTANT('38'X);   /* COMPONENT ID            1604
*                                          TPIOS - DOS               */
*DCL PFCIDCL BIT(8) CONSTANT('39'X);    /* COMPONENT ID            1605
*                                          CONTROL LAYER             */
*DCL PFCIDPSE BIT(8) CONSTANT('3A'X);   /* COMPONENT ID            1606
*                                          PSS - DOS                 */
*DCL PFCIDSMV BIT(8) CONSTANT('3F'X);   /* COMPONENT ID            1607
*                                          STORAGE MANAGEMENT        */
*DCL PFCIDTIO BIT(8) CONSTANT('40'X);   /* COMPONENT ID TIIO       1608
*                                          PROCESSING (VS2)          */
*DCL PFCIDRS  BIT(8) CONSTANT('41'X);   /* ID FOR REMOTE SOLICITOR   */
*/* CRR FOR COMMAND FACILITIES                                      */
*/*  REVISIONS                                         001 06/02/75 */
*DCL  1  ISTCFCRR BDY(WORD) BASED, /* CRR FOR COMMAND FACILITIES    */
*        2 CFCAUDIT,               /* AUDIT TRAIL FOR CMD FACILITIES*/
*          3 CFCNTRD  CHAR(1),     /* LIST OF MODULES IN COMMAND    */
*                                  /* FACILITIES ENTERED            */
*            4 NCFCS1   BIT(1),    /* IND MODULE ISTCFCS1 ENTERED   */
*            4 NCFCS2   BIT(1),    /* IND MODULE ISTCFCS2 ENTERED   */
*            4 NCFCR1   BIT(1),    /* IND MODULE ISTCFCR1 ENTERED   */
*            4 NCFCRP   BIT(1),    /* IND MODULE ISTCFCRP ENTERED   */
*            4 NCFCR2   BIT(1),    /* IND MODULE ISTCFCR2 ENTERED   */
*            4 NCFRSVD  BIT(3),    /* RESERVED                      */
*          3 CFCCRT   CHAR(1),     /* LIST OF MODULES IN COMMAND    */
*                                  /* FACILITIES RUNNING            */
*            4 CCFCS1   BIT(1),    /* IND MODULE ISTCFCS1 RUNNING   */
*            4 CCFCS2   BIT(1),    /* IND MODULE ISTCFCS2 RUNNING   */
*            4 CCFCR1   BIT(1),    /* IND MODULE ISTCFCR1 RUNNING   */
*            4 CCFCRP   BIT(1),    /* IND MODULE ISTCFCRP RUNNING   */
*            4 CCFCR2   BIT(1),    /* IND MODULE ISTCFCR2 RUNNING   */
*            4 CCFRSVD1 BIT(3);    /* RESERVED                      */
*DCL TIDCFCS1 BIT(8) CONSTANT('00'X); /* THREAD ID FOR ISTCFCS1     */
*DCL TIDCFCR1 BIT(8) CONSTANT('01'X); /* THREAD ID FOR ISTCFCR1     */
*DCL TIDCFCR2 BIT(8) CONSTANT('02'X); /* THREAD ID FOR ISTCFCR2     */
*/* COMPONENT RECOVERY RECORD FOR TPIOS */                         1614
*/*  DELTA                                             006 02/10/75  */
*DCL                                                               1614
*1  ISTZCRR BDY(WORD) BASED,     /* CONTROL WORD                     */
*   2  ZCRCRR CHAR(4),           /* CONTROL WORD                     */
*      3  ZCRID CHAR(1),         /* CONTROL BLOCK ID                 */
*      3  ZCRLEN CHAR(2),        /* LENGTH OF ZCR                    */
*      3  ZCRFLAG CHAR(1),       /* FLAGS                            */
*   2  ZCRCHAIN PTR(31),         /* POINTER TO PREVIOUS ZCR          */
*   2  ZCRFRRA PTR(31),          /* PTR TO FRR                       */
*   2  ZCRFLGS1 CHAR(1),         /* FLGS USED BY REQUEST COMPLETION  */
*      3  ZCREXSW BIT(1),        /* EXIT SWITCH                      */
*      3  ZCRQUESW BIT(1),       /* QUEUE SWITCH                     */
*      3  ZCRDEQSW BIT(1),       /* DEQUEUE SWITCH                   */
*      3  ZCRWAIT BIT(1),        /* WAIT Q ANALYSIS COMPLETE         */
*      3  ZCRNRMEX BIT(1),       /* NORMAL EXIT TO BE TAKEN          */
*      3  ZCRENDLP BIT(1),       /* END OF LOOP SWITCH               */
*      3  ZCRUNSOL BIT(1),       /* UNSOLICITED DATA                 */
*      3  ZCRFEXIT BIT(1),       /* FORCE EXIT SWITCH                */
*   2  ZCRFLGS2 CHAR(1),         /* FLAGS USED WITHIN TPIOS          */
*      3  ZCRLOCAL BIT(1),       /* LOCAL SUPPORT                    */
*      3  ZCRSHEDI BIT(1),       /* IMMEDIATE SCHEDULE               */
*      3  ZCRFMSED BIT(1),       /* FMCB SEARCH ENDED                */
*      3  ZCROB    BIT(1),       /* OUTBOUND PROC IN PROGRESS        */
*      3  ZCRIF0E1 BIT(1),       /* SWITCH FOR STRUCTURED PGM USED BY
*                                   INBOUND PROCESSING               */
*      3  ZCRIF0E2 BIT(1),       /* SWITCH FOR STRUCTURED PGM USED BY
*                                   INBOUND PROCESSING               */
*      3  ZCRIF0E3 BIT(1),       /* SWITCH FOR STRUCTURED PGM USED BY
*                                   INBOUND PROCESSING               */
*   2  ZCRSWFLD CHAR(1),         /* SWITCHES FOR TPIOS OUTBOUND      */
*      3  ZCRENDSH BIT(1),       /* EXIT FROM REMOTE DEV SCHEDULER   */
*         4  ZCRSLCP BIT(1),     /* SCHEDULE LCPB                    */
*      3  ZCREXTYP BIT(1),       /* TPEXIT TYPE                      */
*      3  ZCRENDPR BIT(1),       /* EXIT FROM INNER PROCESS          */
*      3  ZCRNDLCP BIT(1),       /* EXIT FROM LCPB PROCESSING        */
*         4  ZCROB1 BIT(1),      /* REMOTE DEV SCHED 1ST TIME SWITCH */
*      3  ZCRENDX BIT(1),        /* EXIT FROM LCCW/BTU XLATION       */
*      3  ZCRENDXL BIT(1),       /* EXIT FROM LCCW PROC              */
*      3  ZCRENDAN BIT(1),       /* EXIT FROM LCPB ANALYSIS          */
*      3  ZCRRESET BIT(1),                                         1614
*         4  ZCRCNLXL BIT(1),    /* CANCEL FURTHER XLATE             */
*   2  ZCRFLGS3 CHAR(1),         /* FLAGS FOR OUTBOUND PROCESSING    */
*      3  ZCRTIC BIT(1),         /* SELECT NOT TO BE SENT            */
*      3  ZCRTPCON BIT(1),       /* TPIOS CONTACT SENT               */
*      3  ZCRTPDIS BIT(1),       /* TPIOS DISCONNECT TO BE SENT      */
*      3  ZCRDISC  BIT(1),       /* DISCONNECT IN PROCESS            */
*      3  ZCREDRIV BIT(1),       /* DO DERIVE                        */
*      3  ZCRNOFRE BIT(1),       /* NO FREEING OF SIO QUEUE          */
*      3  ZCRWRPTR BIT(1),       /* WRITE TO PRINTER REQUEST         */
*      3  ZCRINLCP BIT(1),       /* ERROR OCCURED DURING OUTBND PROC */
*   2  ZCRGENSW CHAR(1),         /* GENERAL SWITCHES                 */
*      3  ZCRTSW1  BIT(1),       /* TEMP SW FOR STRUCTURED PGM       */
*      3  ZCRTSW2  BIT(1),       /* TEMP SW FOR STRUCTURED PGM       */
*      3  ZCRRT06  BIT(1),       /* CRITICAL TEXT OPTION             */
*      3  ZCRLCSYN BIT(1),       /* LCCW SYNC SPECIFIED              */
*      3  ZCREXRES BIT(1),       /* EXCEPTION RESPONSE SPECIFIED     */
*      3  ZCRCLRBD BIT(1),       /* FLAG INDICATING BIND WAS CLEARED */
*      3  ZCRBRIS  BIT(1),       /* BRACKET REJECTED DUE TO IN BRAC. */
*      3  ZCRF1RES BIT(1),       /* FID1 RESPONSE TO BE GENERATED    */
*   2  ZCRPFLGS CHAR(1),         /* UTILITIES PROC OPTION FLAGS      */
*      3  ZCRQAHED BIT(1),      /* QXFR RTN TO USE INSERT OPT'N ON TPQ*
*      3  *        BIT(7),      /* RESERVED                          */
*   2  ZCRIBPR CHAR(1),          /* INBOUND PROCESSING FLAGS         */
*         3  ZCRNOBUF BIT(1),    /* FSB WITH NO BUFFER               */
*         3  ZCRERR   BIT(1),    /* ERROR INDICATOR                  */
*         3  ZCRRELK  BIT(1),    /* RESET ERROR LOCK FUNCTION REQ.   */
*         3  ZCRLCPFR BIT(1),    /* FLAG IND. DEALLOCATE ATOP LCPB   */
*         3  ZCRLCPFD BIT(1),    /* FLAG IND. LCPB FOUND ON WAITQ    */
*         3  ZCR3270  BIT(1),    /* 3270 DEVICE                      */
*         3  ZCR3270R BIT(1),    /* 3270 DEVICE IN RECORD MODE       */
*         3  *        BIT(1),    /* RESERVED                         */
*   2  ZCRSCPSW CHAR(1),         /* SESSION CONTROL FLAGS            */
*         3  ZCRTPEX BIT(1),     /* TP EXIT                          */
*         3  ZCRTPINV BIT(1),    /* INVOKE TPIOS                     */
*         3  ZCRRJLCP BIT(1),    /* LCPB REJECTED                    */
*         3  ZCRLREQ BIT(1),     /* REQUEST                          */
*         3  ZCRPRCMP BIT(1),    /* PROCESSING COMPLETE              */
*         3  ZCRFSBWE BIT(1),    /* FSB IS WORK ELEMENT              */
*         3  ZCRSKIPT BIT(1),    /* SKIP TRACE FLAG                  */
*         3  *       BIT(1),     /* RESERVED                         */
*   2  ZCRCRLCP PTR(31),         /* CURRENT LCPB PTR                 */
*   2  ZCRPARMS BDY(WORD),       /* PARAMETERS PASSED TO UTILITIES */
*      3  ZCRFBPTR PTR(31),      /* PTR TO FROM BUFFER               */
*         4  ZCRCBPTR PTR(31),   /* PTR TO CURRENT BUFFER            */
*      3  ZCRTBPTR PTR(31),      /* PTR TO TO-OR-TRANSLATE BUFFER    */
*      3  ZCRMLNG FIXED(15),     /* LENGTH TO MOVE                   */
*      3  ZCRDFRDA FIXED(15),    /* OFFSET FROM DATA ADDR IN FROM BUF*/
*         4  ZCRDTODA FIXED(15), /* OFFSET FROM DATA ADDR XLATE BUF  */
*      3  ZCRPCOD1 CHAR(1),      /* CODE BYTE FOR ALLOC/DISALLOC     */
*         4  ZCRPPG BIT(1),      /* GET PAGEABLE BUFF                */
*         4  ZCRPLNG BIT(1),     /* LENGTH OF BUFFER SPECIFIED       */
*         4  ZCRPFSB BIT(1),     /* GET FSB                          */
*         4  ZCRPLSBF BIT(1),    /* GET LSCB AND BUFFER              */
*            5 ZCRPLSBQ BIT(1),  /* PURGE LSCB QUEUE                 */
*         4  ZCRPLSCB BIT(1),    /* GET OR RELEASE LSCB              */
*         4  ZCRPBUF BIT(1),     /* GET OR RELEASE BUFFER            */
*         4  ZCRPCFTX BIT(1),    /* CONFIDENTIAL TEXT                */
*         4  ZCRPRES BIT(1),     /* RESERVED                         */
*      3  ZCRPCOD2 CHAR(1),      /* CODE BYTE FOR MOVE               */
*         4  ZCRPPG2 BIT(1),     /* GET PAGEABLE BUFFER              */
*         4  ZCRPFHDR BIT(1),    /* FROM BUFFER FDB TO BE USED       */
*         4  ZCRPMFGF BIT(1),    /* MOVE STARTS WIHT 1ST BUFF IN BLOCK*
*         4  ZCRPRES2 BIT(5),    /* RESERVED                         */
*      3  ZCRPCHAR CHAR(1),      /* TRANSLATE & TEST SEARCH CHARACTER*/
*      3  ZCRPSW   CHAR(1),      /* SWITCH FIELD                     */
*   2  ZCRCCWA PTR(31),          /* PTR TO CURRENT CCW (CCW 1 OR 2)  */
*   2  ZCRBFPTR PTR(31),         /* SAVE 1ST BUFF PTR IN TO-BUFF CHN
*                                   OR LAST BUFFER IN CHANNEL PGM    */
*   2  ZCRZLB PTR(31),           /* PTR TO CURR BUFF IN CHANNEL PGM  */
*   2  ZCRPVZB PTR(31),          /* PTR TO PREVIOUS BUFF IN CHAN PGM */
*   2  ZCRSVRTN BDY(WORD),       /* REG 14 SAVE AREAS                */
*      3  ZCRSVF1 PTR(31),       /* SAVE REQUIRED REGISTER           */
*      3  ZCRSVF2 PTR(31),       /* SAVE REQUIRED REGISTER           */
*      3  ZCRSVF3 PTR(31),       /* SAVE REQUIRED REGISTER           */
*      3  ZCRSVF4 PTR(31),       /* SAVE REQUIRED REGISTER           */
*      3  ZCRSVF5 PTR(31),       /* SAVE REQUIRED REGISTER           */
*      3  ZCRSVF6 PTR(31),       /* SAVE REQUIRED REGISTER           */
*      3  ZCRSVF7 PTR(31),       /* SAVE REQUIRED REGISTER           */
*      3  ZCRSVF8 PTR(31),       /* SAVE REQUIRED REGISTER           */
*      3  ZCRSVF9 PTR(31),       /* SAVE REQUIRED REGISTER           */
*      3  ZCRSVF10 PTR(31),      /* SAVE REQUIRED REGISTER           */
*      3  ZCRSVF11 PTR(31),      /* SAVE REQUIRED REGISTER           */
*      3  ZCRSVF12 PTR(31),      /* SAVE REQUIRED REGISTER           */
*      3  ZCRSVF13 PTR(31),      /* SAVE REQUIRED REGISTER           */
*      3  ZCRSVF14 PTR(31),      /* SAVE REQUIRED REGISTER           */
*      3  ZCRSVF15 PTR(31),      /* SAVE REQUIRED REGISTER           */
*      3  ZCRSVF16 PTR(31),      /* SAVE REQUIRED REGISTER           */
*      3  ZCRSVF17 PTR(31),      /* SAVE REQUIRED REGISTER           */
*      3  ZCRSVF18 PTR(31),      /* SAVE REQUIRED REGISTER           */
*      3  ZCRSVF19 PTR(31),      /* SAVE REQUIRED REGISTER           */
*      3  ZCRSVF20 PTR(31),      /* SAVE REQUIRED REGISTER           */
*      3  ZCRSVF21 PTR(31),      /* SAVE REQUIRED REGISTER           */
*      3  ZCRSVF22 PTR(31),      /* SAVE REQUIRED REGISTER           */
*      3  ZCRSVF23 PTR(31),      /* SAVE REQUIRED REGISTER           */
*      3  ZCRSVF24 PTR(31),      /* SAVE REQUIRED REGISTER           */
*      3  ZCRSVF25 PTR(31),      /* SAVE REQUIRED REGISTER           */
*   2  ZCRWKARA BDY(WORD),       /* TEMPORARY REG SAVE AREA          */
*      3  ZCRSVWK1 PTR(31),      /* SAVE REQUIRED REG                */
*      3  ZCRSVWK2 PTR(31),      /* SAVE REQUIRED REG                */
*      3  ZCRSVWK3 PTR(31),      /* SAVE REQUIRED REG                */
*      3  ZCRSVWK4 PTR(31),      /* SAVE REQUIRED REG                */
*      3  ZCRSVWK5 PTR(31),      /* SAVE REQUIRED REG                */
*   2  ZCRFSBSV PTR(31),         /* FSB CHAIN PTR SAVEAREA           */
*   2  ZCRFBPRC BIT(1),          /* FSB PROCESS SW                   */
*   2  ZCRMOREL BIT(1),          /* MORE ELEMENTS SW                 */
*   2  ZCRSCANQ BIT(1),          /* SCAN QUEUE SW                    */
*   2  ZCRNXTEL BIT(1),          /* NEXT ELEMENT SW                  */
*   2  ZCRXSCHD BIT(1),          /* EXIT SCHEDULE SW                 */
*   2  ZCRLSTFB BIT(1),          /* INBOUND PROC LAST FSB FOR ELEM SW*/
*   2  ZCRTOPQ  BIT(1),          /* QUEUE ELEMENT TO TOP SW          */
*   2  ZCRAWQSW BIT(1),          /* CHECK AWAITQ FOR MORE WORK =1    */
*                                /* CHECK WAITQ =0                   */
*   2  ZCRRCDSV CHAR(1),         /* RETURN CODE SAVEAREA             */
*   2  ZCRPRMTC CHAR(1),         /* PREEMPT COMPLETION PARAMETER BYTE*/
*   2  ZCROPCDE CHAR(1),         /* OP CODE TO BE TRANSFORMED         *
*   2  ZCRR2SV PTR(31),          /* ISTZBFDI REG 2 SAVE EREA         */
*   2  ZCRR13SV PTR(31),         /* ISTSBFDI REG 13 SAVE EREA        */
*   2  ZCRCIDSV BDY(WORD),       /* ISTZBFDI CID SAVE AREA           */
*      3  ZCRSAFSV CHAR(2),      /* ISTZBFDI SAF SAVE AREA           */
*      3  ZCRDAFSV CHAR(2),      /* ISTZBFDI DAF SAVE AREA           */
*   2  ZCRSAVEZ (6) BDY(WORD) CHAR(LENGTH(ISTZSAVE)),              1614
*                                /* SAVE/TRACE AREAS FOR TPIOS MODS  */
*   2  ZCRREMIC PTR(31),        /* POINTER TO REMOTE RN ICNCB        */
*   2  ZCRAUDIT CHAR(36),        /* TPIOS AUDIT TRAIL AREA           */
*      3  ZCRTID CHAR(1),        /* THREAD I.D.                      */
*      3  ZCRTNAME CHAR(4),      /* LAST 4 CHARS OF THREAD NAME      */
*      3  ZCRENTER BIT(248),     /* BIT ARRAY FOR MODULES ENTERED    */
*         4  ZCREAC1A BIT(1),    /* ISTZAC1A ENTERED                 */
*         4  ZCREAC0A BIT(1),    /* ISTZAC0A ENTERED                 */
*         4  ZCREAC0B BIT(1),    /* ISTZAC0B ENTERED                 */
*         4  ZCREAC1B BIT(1),    /* ISTZAC1B ENTERED                 */
*         4  ZCREBCAA BIT(1),    /* ISTZBCAA ENTERED                 */
*         4  ZCREBCAB BIT(1),    /* ISTZBCAB ENTERED                 */
*         4  ZCREBCAE BIT(1),    /* ISTZBCAE ENTERED                 */
*         4  ZCREBCAG BIT(1),    /* ISTZBCAG ENTERED                 */
*         4  ZCREBCAI BIT(1),    /* ISTZBCAI ENTERED                 */
*         4  ZCREBCAM BIT(1),    /* ISTZBCAM ENTERED                 */
*         4  ZCREBCBA BIT(1),    /* ISTZBCBA ENTERED                 */
*         4  ZCREBCBB BIT(1),    /* ISTZBCBB ENTERED                 */
*         4  ZCREBCBI BIT(1),    /* ISTZBCBI ENTERED                 */
*         4  ZCREBCCB BIT(1),    /* ISTZBCCB ENTERED                 */
*         4  ZCREBCDI BIT(1),    /* ISTZBCDI ENTERED                 */
*         4  ZCREBCEB BIT(1),    /* ISTZBCEB ENTERED                 */
*         4  ZCREBCFA BIT(1),    /* ISTZBCFA ENTERED                 */
*         4  ZCREBCFB BIT(1),    /* ISTZBCFB ENTERED                 */
*         4  ZCREBCGA BIT(1),    /* ISTZBCGA ENTERED                 */
*         4  ZCREBCGB BIT(1),    /* ISTZBCGB ENTERED                 */
*         4  ZCREBCHA BIT(1),    /* ISTZBCHA ENTERED                 */
*         4  ZCREBCHB BIT(1),    /* ISTZBCHB ENTERED                 */
*         4  ZCREBCIA BIT(1),    /* ISTZBCIA ENTERED                 */
*         4  ZCREBCIB BIT(1),    /* ISTZBCIB ENTERED                 */
*         4  ZCREBCID BIT(1),    /* ISTZBCID ENTERED                 */
*         4  ZCREBCJA BIT(1),    /* ISTZBCJA ENTERED                 */
*         4  ZCREBCJB BIT(1),    /* ISTZBCJB ENTERED                 */
*         4  ZCREBCKA BIT(1),    /* ISTZBCKA ENTERED                 */
*         4  ZCREBCKB BIT(1),    /* ISTZBCKB ENTERED                 */
*         4  ZCREBCLA BIT(1),    /* ISTZBCLA ENTERED                 */
*         4  ZCREBCLB BIT(1),    /* ISTZBCLB ENTERED                 */
*         4  ZCREBCMB BIT(1),    /* ISTZBCMB ENTERED                 */
*         4  ZCREBCND BIT(1),    /* ISTZBCND ENTERED                 */
*         4  ZCREBCNE BIT(1),    /* ISTZBCNE ENTERED                 */
*         4  ZCREBCOB BIT(1),    /* ISTZBCOB ENTERED                 */
*         4  ZCREBCPB BIT(1),    /* ISTZBCPB ENTERED                 */
*         4  ZCREBCQB BIT(1),    /* ISTZBCQB ENTERED                 */
*         4  ZCREBCRA BIT(1),    /* ISTZBCRA ENTERED                 */
*         4  ZCREBCRB BIT(1),    /* ISTZBCRB ENTERED                 */
*         4  ZCREBCSC BIT(1),    /* ISTZBCSC ENTERED                 */
*         4  ZCREBCXA BIT(1),    /* ISTZBCXA ENTERED                 */
*         4  ZCREBCX0 BIT(1),    /* ISTZBCX0 ENTERED                 */
*         4  ZCREBCY0 BIT(1),    /* ISTZBCY0 ENTERED                 */
*         4  ZCREBCZ0 BIT(1),    /* ISTZBCZ0 ENTERED                 */
*         4  ZCREBC0A BIT(1),    /* ISTZBC0A ENTERED                 */
*         4  ZCREBC0B BIT(1),    /* ISTZBC0B ENTERED                 */
*         4  ZCRECC0A BIT(1),    /* ISTZCC0A ENTERED                 */
*         4  ZCRECC0B BIT(1),    /* ISTZCC0B ENTERED                 */
*         4  ZCRECC1A BIT(1),    /* ISTZCC1A ENTERED                 */
*         4  ZCRECC1B BIT(1),    /* ISTZCC1B ENTERED                 */
*         4  ZCRECC2B BIT(1),    /* ISTZCC2B ENTERED                 */
*         4  ZCREDCA0 BIT(1),    /* ISTZDCA0 ENTERED                 */
*         4  ZCREDCB0 BIT(1),    /* ISTZDCB0 ENTERED                 */
*         4  ZCREDCC0 BIT(1),    /* ISTZDCC0 ENTERED                 */
*         4  ZCREDCD0 BIT(1),    /* ISTZDCD0 ENTERED                 */
*         4  ZCREDCE0 BIT(1),    /* ISTZDCE0 ENTERED                 */
*         4  ZCREDCF0 BIT(1),    /* ISTZDCF0 ENTERED                 */
*         4  ZCREDCH0 BIT(1),    /* ISTZDCH0 ENTERED                 */
*         4  ZCREDCI0 BIT(1),    /* ISTZDCI0 ENTERED                 */
*         4  ZCREDCJ0 BIT(1),    /* ISTZDCJ0 ENTERED                 */
*         4  ZCREDCKA BIT(1),    /* ISTZDCKA ENTERED                 */
*         4  ZCREDCKB BIT(1),    /* ISTZDCKB ENTERED                 */
*         4  ZCREDCL0 BIT(1),    /* ISTZDCL0 ENTERED                 */
*         4  ZCREDCMB BIT(1),    /* ISTZDCMB ENTERED                 */
*         4  ZCREECBA BIT(1),    /* ISTZECBA ENTERED                 */
*         4  ZCREECBB BIT(1),    /* ISTZECBB ENTERED                 */
*         4  ZCREECCA BIT(1),    /* ISTZECCA ENTERED                 */
*         4  ZCREECCB BIT(1),    /* ISTZECCB ENTERED                 */
*         4  ZCREECDA BIT(1),    /* ISTZECDA ENTERED                 */
*         4  ZCREECEA BIT(1),    /* ISTZECEA ENTERED                 */
*         4  ZCREECTA BIT(1),    /* ISTZECTA ENTERED                 */
*         4  ZCREFCEA BIT(1),    /* ISTZFCEA ENTERED                 */
*         4  ZCREFCEB BIT(1),    /* ISTZFCEB ENTERED                 */
*         4  ZCREGCAB BIT(1),    /* ISTZGCAB ENTERED                 */
*         4  ZCREGCBB BIT(1),    /* ISTZGCBB ENTERED                 */
*         4  *        BIT(1),    /* NOT USED                         */
*         4  ZCREGCDB BIT(1),    /* ISTZGCDB ENTERED                 */
*         4  ZCREGCEB BIT(1),    /* ISTZGCEB ENTERED                 */
*         4  ZCREGCLA BIT(1),    /* ISTZGCLA ENTERED                 */
*         4  ZCREGC0A BIT(1),    /* ISTZGC0A ENTERED                 */
*         4  ZCREGC0B BIT(1),    /* ISTZGC0B ENTERED                 */
*         4  ZCREHCAN BIT(1),    /* ISTZHCAN ENTERED                 */
*         4  ZCREICAA BIT(1),    /* ISTZICAA ENTERED                 */
*         4  ZCREICAB BIT(1),    /* ISTZICAB ENTERED                 */
*         4  ZCREICBB BIT(1),    /* ISTZICBB ENTERED                 */
*         4  ZCREICBI BIT(1),    /* ISTZICBI ENTERED                 */
*         4  ZCREICCB BIT(1),    /* ISTZICCB ENTERED                 */
*         4  ZCREICCI BIT(1),    /* ISTZICCI ENTERED                 */
*         4  ZCREICDB BIT(1),    /* ISTZICDB ENTERED                 */
*         4  ZCREICEB BIT(1),    /* ISTZICEB ENTERED                 */
*         4  ZCREICGB BIT(1),    /* ISTZICGB ENTERED                 */
*         4  ZCREICHB BIT(1),    /* ISTZICHB ENTERED                 */
*         4  ZCREICIB BIT(1),    /* ISTZICIB ENTERED                 */
*         4  ZCREICID BIT(1),    /* ISTZICID ENTERED                 */
*         4  ZCREICJB BIT(1),    /* ISTZICJB ENTERED                 */
*         4  ZCREICKB BIT(1),    /* ISTZICKB ENTERED                 */
*         4  ZCREICKE BIT(1),    /* ISTZICKE ENTERED                 */
*         4  ZCREICKG BIT(1),    /* ISTZICKG ENTERED                 */
*         4  ZCREICLB BIT(1),    /* ISTZICLB ENTERED                 */
*         4  ZCREICMB BIT(1),    /* ISTZICMB ENTERED                 */
*         4  ZCREICNA BIT(1),    /* ISTZICNA ENTERED                 */
*         4  ZCREICNB BIT(1),    /* ISTZICNB ENTERED                 */
*         4  ZCREICOA BIT(1),    /* ISTZICOA ENTERED                 */
*         4  ZCREICOB BIT(1),    /* ISTZICOB ENTERED                 */
*         4  ZCREICQA BIT(1),    /* ISTZICQA ENTERED                 */
*         4  ZCREICQB BIT(1),    /* ISTZICQB ENTERED                 */
*         4  ZCREICRB BIT(1),    /* ISTZICRB ENTERED                 */
*         4  ZCREICSB BIT(1),    /* ISTZICSB ENTERED                 */
*         4  ZCREICSC BIT(1),    /* ISTZICSC ENTERED                 */
*         4  ZCREICTB BIT(1),    /* ISTZICTB ENTERED                 */
*         4  ZCREICUB BIT(1),    /* ISTZICUB ENTERED                 */
*         4  ZCREICVB BIT(1),    /* ISTZICVB ENTERED                 */
*         4  ZCREICWB BIT(1),    /* ISTZICWB ENTERED                 */
*         4  ZCREICX0 BIT(1),    /* ISTZICX0 ENTERED                 */
*         4  ZCREIC0B BIT(1),    /* ISTZIC0B ENTERED                 */
*         4  ZCREIC1B BIT(1),    /* ISTZIC1B ENTERED                 */
*         4  ZCREJCAB BIT(1),    /* ISTZJCAB ENTERED                 */
*         4  ZCREJCBB BIT(1),    /* ISTZJCBB ENTERED                 */
*         4  ZCREJCCB BIT(1),    /* ISTZJCCB ENTERED                 */
*         4  ZCREJCDB BIT(1),    /* ISTZJCDB ENTERED                 */
*         4  ZCREJC0B BIT(1),    /* ISTZJC0B ENTERED                 */
*         4  ZCREKCBB BIT(1),    /* ISTZKCBB ENTERED                 */
*         4  ZCREKCBN BIT(1),    /* ISTZKCBN ENTERED                 */
*         4  ZCREKCCN BIT(1),    /* ISTZKCCN ENTERED                 */
*         4  ZCREDCWR BIT(1),    /* ISTZDCWR ENTERED                 */
*         4  ZCREDCWB BIT(1),    /* ISTZDCWB ENTERED                 */
*         4  ZCREDCXR BIT(1),    /* ISTZDCXR ENTERED                 */
*         4  ZCREBCBR BIT(1),    /* ISTZBCBR ENTERED                 */
*         4  ZCREBCDR BIT(1),    /* ISTZBCDR ENTERED                 */
*         4  ZCREBCAR BIT(1),    /* ISTZBCAR ENTERED                 */
*         4  ZCRECCBI BIT(1),    /* ISTZCCBI ENTERED                 */
*         4  ZCRECCAI BIT(1),    /* ISTZCCAI ENTERED                 */
*         4  ZCRECCCI BIT(1),    /* ISTZCCCI ENTERED                 */
*         4  ZCREAC1R BIT(1),    /* ISTZAC1R ENTERED                 */
*         4  ZCREBCSB BIT(1),    /* ISTZBCSB ENTERED                 */
*         4  ZCREDCPR BIT(1),    /* ISTZDCPR ENTERED                 */
*         4  ZCREDCQR BIT(1),    /* ISTZDCQR ENTERED                 */
*         4  ZCREBCAL BIT(1),    /* ISTZBCAL ENTERED                 */
*         4  ZCREBC0L BIT(1),    /* ISTZBC0L ENTERED                 */
*         4  ZCREBCNB BIT(1),    /* ISTZBCNB ENTERED                 */
*         4  ZCREICOE BIT(1),    /* ISTZICOE ENTERED                 */
*         4  ZCREDCNB BIT(1),    /* ISTZDCNB ENTERED                 */
*         4  ZCREKCCB BIT(1),    /* ISTZKCCB ENTERED                 */
*         4  ZCRECFY0 BIT(1),    /* ISTZCFY0 ENTERED                 */
*         4  ZCREDCK0 BIT(1),    /* ISTZDFK0 ENTERED                 */
*         4  ZCREICSG BIT(1),    /* ISTZICSG ENTERED                 */
*         4  ZCREBCIF BIT(1),    /* ISTZBCIF ENTERED                 */
*         4  ZCREDCMF BIT(1),    /* ISTZDCMF ENTERED                 */
*         4  ZCRELCAB BIT(1),    /* ISTZLCAB ENTERED                 */
*         4  ZCREAC2B BIT(1),    /* ISTZAC2B ENTERED                 */
*         4  ZCREIC2B BIT(1),    /* ISTZIC2B ENTERED                 */
*         4  ZCRRSV97 BIT(97),   /* RESERVED                         */
*   2  ZCRCMNRC CHAR(1),                /* PURGE MWOR RETURN CODE    */
*   2  ZCRWORDA CHAR(3),                /* RESERVED FOR LATER USE    */
*   2  ZCRLCPB  CHAR(LENGTH(ISTLCPB)),  /* 3270 S/R LCPB             */
*      3 ZCRRHRU,                       /* SAVEAREA FOR RH AND RU    */
*        4 ZCRRH    CHAR(3),            /* RH                        */
*        4 ZCRRU    CHAR(*);            /* RU                        */
*DCL ZCTYPE BIT(8) CONSTANT('00'X);   /* ZCR TYPE                   */
*DCL ZCLNG FIXED(15) CONSTANT(172);   /* ZCRR LENGTH                */
*DCL ZCRSAVNO BIT(8) CONSTANT('06'X); /* NUMBER OF SAVEAREAS IN ZCRR */
*DCL ZCRLSVNO BIT(8) CONSTANT('04'X); /* NUMBER OF SAVE AREAS IN   1618
*                                         LOCAL SUPPORT              */
*/* *** EQUATES FOR ZCRRCDSV *** */                                1619
*                                                                  1619
*DCL ZCRMRFSB BIT(8) CONSTANT('0C'X);  /* REQUEST COMPLETION MOVE FSB
*                                         TO PROCESS                 */
*DCL ZCRSRCHQ BIT(8) CONSTANT('10'X);  /* REQUEST COMPLETION SEARCH
*                                         REQUEST QUEUE              */
*DCL ZCREXIT  BIT(8) CONSTANT('14'X);  /* REQUEST COMPLETION EXIT    */
*DCL ZCRSFSB  BIT(8) CONSTANT('18'X);  /* REQUEST COMPLETION SINGLE
*                                         FSB                        */
*DCL ZCRDLFSB BIT(8) CONSTANT('1C'X);  /* REQUEST COMPLETION DUAL FSB *
*DCL ZCRNOSCH BIT (8) CONSTANT('20'X); /* REQUEST COMPLETION, EXIT WITH
*                                         SCHED NONE                 */
*DCL ZCRNRSCH BIT (8) CONSTANT('24'X); /* REQUEST COMPLETION, EXIT WITH
*                                         SCHED NORM                 */
*DCL ZCRLGERR FIXED(8) CONSTANT(8);    /* LOGICAL ERROR              */
*DCL ZCPLSCB BIT(8) CONSTANT('08'X);   /* GET A RELEASE LSCB         */
*DCL ZCPBUF  BIT(8) CONSTANT('04'X);   /* GET A RELEASE BUFFER       */
*DCL ZCRTAC0A FIXED(8) CONSTANT(01);   /* LOCAL DEVICE SCHEDULER(OUT)*/
*DCL ZCRTAC0B FIXED(8) CONSTANT(02);   /* REMOTE DEVICE SCHEDLER(OUT)*/
*DCL ZCRTCC1A FIXED(8) CONSTANT(03);   /* LOCAL DIALOG SCHEDLER(IN)  */
*DCL ZCRTCC1B FIXED(8) CONSTANT(04);   /* REMOTE DIALOG SCHEDLER(IN) */
*DCL ZCRTDCE0 FIXED(8) CONSTANT(05);   /* NCP SLOWDOWN RECOVERY      */
*DCL ZCRTDCKA FIXED(8) CONSTANT(06);   /* LOCAL GENERAL FUNCTIONS    */
*DCL ZCRTDCKB FIXED(8) CONSTANT(07);   /* REMOTE GENERAL FUNCTIONS   */
*DCL ZCRTFCEB FIXED(8) CONSTANT(08);   /* REMOTE READ BUFFER ALLOC.  */
*DCL ZCRTGCLA FIXED(8) CONSTANT(09);   /* LCAL CTL & TEST FEEDBACK(IN)*
*DCL ZCRTGC0A FIXED(8) CONSTANT(10);   /* LOCAL REQ. COMPLETION(IN)  */
*DCL ZCRTGC0B FIXED(8) CONSTANT(11);   /* REMOTE REQ. COMPLETION(IN) */
*DCL ZCRTICWB FIXED(8) CONSTANT(12);   /* RESET CLEANUP (PHASE 5)    */
*DCL ZCRTIC0B FIXED(8) CONSTANT(13);   /* REMOTE REQ COMPLTION CTL(IN)*
*DCL ZCRTAC1B FIXED(8) CONSTANT(14);   /* ISTZAC1B THREAD ID         */
*DCL ZCRTIC1B FIXED(8) CONSTANT(15);   /* ISTZIC1B THREAD ID         */
*DCL ZCRTCCBI FIXED(8) CONSTANT(16);   /* ISTZCCBI THREAD ID         */
*DCL ZCRTAC1R FIXED(8) CONSTANT(17);   /* ISTZAC1R THREAD ID         */
*DCL ZCRTAC1A FIXED(8) CONSTANT(18);   /* ISTZAC1A THREAD ID         */
*DCL ZCRTLCAB FIXED(8) CONSTANT(19);   /* ISTZLCAB THREAD ID         */
*/* COMPONENT RECOVERY                                               */
*/*                                                                  */
*DCL 1 ISTASCRR BDY(WORD) BASED,        /* CRR FOR SMS               */
*     2  ASCPFCRR CHAR(LENGTH(ISTPFCRR)),                          1648
*     2  ASCFLAGS CHAR(7),              /* FLAGS                     */
*        3  ASCFLG1 CHAR(2),            /* MODULE TRACE FLAGS        */
*           4  ASCFBA BIT(1),           /* ALLOCATION IN PATH        */
*           4  ASCFBD BIT(1),           /* DE-ALLOCATION IN PATH     */
*           4  ASCFSR BIT(1),           /* FSR IN PATH               */
*           4  ASCPASTR BIT(13),        /* RESERVED PATH FLAGS       */
*        3  ASCFLG2 CHAR(2),            /* MODULE IN CONTROL FLAGS   */
*           4  ASCFBAIC BIT(1),         /* ALLOCATION IN CONTROL     */
*           4  ASCFBDIC BIT(1),         /* DE-ALLOCATION IN CONTROL  */
*           4  ASCFSRIC BIT(1),         /* FSR IN CONTROL            */
*           4  ASCICR BIT(13),          /* RESERVED IN CONTROL FLAGS */
*        3  ASCFLG3 CHAR(3),            /* AUDIT FLAGS               */
*           4  ASCFSRGT BIT(1),         /* FSR DOING GET PROCESSING  */
*           4  ASCFBDAL BIT(1),         /* FBD DOING ALLOCATION      */
*           4  ASCKEYF BIT(1),          /* KEY HAS BEEN ALTERED      */
*           4  ASCLLKF BIT(1),          /* LOCAL LOCK HELD           */
*           4  ASCFBDUD BIT(1),         /* FBD USING USER DATA       */
*           4  ASCAUDIT BIT(19),        /* RESERVED AUDIT BITS       */
*     2  ASCKEY CHAR(1),                /* ORIGINAL KEY              */
*     2  ASCETRYA PTR(31),              /* RETRY ADRS FOR CONTINUE 1648
*                                          OPTION                    */
*     2  ASCUSRGS CHAR(16),             /* SAVE AREA FOR USER REGS 1648
*                                          14 - 1                    */
*        3  ASCUSR14 CHAR(4),           /* REGISTER 14               */
*        3  ASCUSR15 CHAR(4),           /* REGISTER 15               */
*        3  ASCUSR00 CHAR(4),           /* REGISTER 0                */
*        3  ASCUSR01 CHAR(4),           /* REGISTER 1                */
*     2  ASCPSREG CHAR(16);             /* SAVE AREA FOR PSS       1648
*                                          REGS 1 - 4                */
*/*  INITIAL LEVEL                                      001 04/09/75 */
*DCL 1 ISTAPCRR BDY(WORD) BASED,                                   1649
*     2 APCHDRSV CHAR(LENGTH(ISTPFCRR)),  /* HEADER                  */
*     2  APCATFLG CHAR(2),              /* AUDIT TRACE FLAGS         */
*        3  APC51E BIT(1),              /* ISTAPC51 WAS ENTERED      */
*        3  APC52E BIT(1),              /* ISTAPC52  '     '         */
*        3  APC53E BIT(1),              /* ISTAPC53                  */
*        3  APC54E BIT(1),                                         1649
*        3  APC56E BIT(1),                                         1649
*        3  APC57E BIT(1),                                         1649
*        3  APC58E BIT(1),                                         1649
*        3  APC31E BIT(1),                                         1649
*        3 * BIT(8),                    /* RESERVED                  */
*     2  APCRFLG CHAR(2),               /* AUDIT TRACE FLAGS         */
*        3  APC51R BIT(1),              /* ISTAPCR1 IS RUNNING       */
*        3  APC52R BIT(1),              /* ISTAPC52 IS RUNNING       */
*        3  APC53R BIT(1),                                         1649
*        3  APC54R BIT(1),                                         1649
*        3  APC56R BIT(1),                                         1649
*        3  APC57R BIT(1),                                         1649
*        3  APC58R BIT(1),                                         1649
*        3  APC31R BIT(1),                                         1649
*        3  *      BIT(8),              /* RESERVED                  */
*     2  APCPSTA PTR(31),               /* PST@                      */
*     2  APCTCBA PTR(31),               /* TCB@                      */
*     2  APCRTRN PTR(31),               /*@ TO BR14 TO RTN TO SYSTEM */
*     2  APCPABSV PTR(31),              /*SAVED PAB@ TO REDISPATCH   */
*     2  APCQWFO PTR(31),               /* Q@ IN PST WORK AREA ON    */
*     2  APCFRRPM PTR(31),              /* WORKAREA@ RTN'D FROM SETFR*/
*     2  APCSAVE CHAR(72),                                         1649
*        3  APCESTAL CHAR(72),          /* ESTAE PARAMETER LIST AREA */
*     2  APCCOMF CHAR(4) BDY(HWORD),    /* FLAGS USED BY ALL PSS RTN */
*        3  APCCOMF1 CHAR(2),                                      1649
*           4  APCSSTSK BIT(1),         /* IRB TYPE WORK             */
*           4  APCUETSK BIT(1),         /* USER EXIT RUNNING UNDER IRB*
*           4  APCSMCR BIT(1),          /* SMA CRA BEING USED        */
*           4  APCIRB1 BIT(1),          /* IRB1 BEING USED           */
*           4  APCIRB2 BIT(1),          /* IRB2 BEING USED           */
*           4  APCRELR BIT(1),          /*CALL ISTAPC58 TO RLEASE CRA*/
*           4  APCEXIT BIT(1),          /* TELLS ISTAPC58 TO EXIT SYS*/
*           4  APCZLBER BIT(1),         /* ERR WHILE RUNNING ZLFAB PAB*
*           4  * BIT(8),                /* RESERVED                  */
*        3  APCRETCD FIXED(15),         /* RTN CODE FOR R15 FOR SYS  */
*     2  APCSAV1 PTR(31),               /* 1ST SAVE WORD             */
*     2  APCSAV2 PTR(31),               /* 2ND SAVE WORD             */
*     2  APCSWTWD CHAR(4),              /* SWITCH AREA FOR PSS RTN   */
*     2  APC31FLG CHAR(1),              /* ISTAPC31 FLAGS            */
*        3  APCTPXIT BIT(1),            /* TPEXIT IN PROGRESS        */
*        3  APCRESCH BIT(1),            /*PAB TPEXIT OCCURED  RESCHED*/
*        3  APCSORT BIT(1),       /* PAB SORTED TO PROPER PST/MPST   */
*        3  *       BIT(5),       /* RESERVED                        */
*     2  APC52FLG CHAR(1),        /* ISTAPC52 FLAGS                  */
*        3  APCCKRQ BIT(1),       /* CHECK RDY Q FOR WORK            */
*        3  APCSMSR BIT(1),       /* RETURNING SMS RPH               */
*        3  APCQENQ BIT(1),       /* ENQUEUEING PAB'S ON PST Q'S     */
*        3  APCRDQ BIT(1),        /* DEQUEING PAB'S FROM PST RDY Q   */
*        3  APCNWF BIT(1),        /* NO WORK FOUND                   */
*        3  APCWKF   BIT(1),      /* WORK FOUND                      */
*        3    *      BIT(2),      /* RESERVED                        */
*     2  APC53FLG CHAR(1),        /* ISTAPC53 FLAGS                  */
*        3  APCPR153 BIT(1),      /* USED PREALLOCATED CRA           */
*     2  APC54FLG CHAR(1),        /* ISTAPC54 FLAGS                  */
*        3  APCRLST BIT(1),       /* SMS BEING CALLED TO RELEASE UECB*/
*        3  * BIT(7),             /* RESERVED                        */
*     2  APC57FLG CHAR(1),        /* ISTAPC57 FLAGS                  */
*        3  APCRECRA BIT(1),      /* RELEASE CRA BEING DONE          */
*        3  APCNREL BIT(1),       /* DID NOT RELEASE CRA             */
*        3  *   BIT(6),           /* RESERVED                        */
*     2  * CHAR(15);              /* RESERVED                        */
*/*               COMPONENT RECOVERY AREA                            */
*/*  REVISIONS                                         005 04/09/75  */
*DCL 1  ISTCRA BASED BDY(DWORD),        /* COMPONENT RECOVERY AREA   */
*     2  CRABASIC BDY(WORD),            /* CRA WITHOUT PROCESS CRR   */
*      3 CRAHDR CHAR(8) BDY(WORD),      /* CRA HEADER                */
*        4  CRACRR PTR(31),             /* PTR TO ACTIVE CRR         */
*        4  CRAFRR PTR(31),             /* PTR TO ACTIVE FRR         */
*      3 CRALKACT BIT(32),              /* LOCK LEVEL AND          1650
*                                          OWNERSHIP FLAGS           */
*        4  CRALEV32 BIT(1),            /* 1 = LEVEL 32 LOCK HELD    */
*        4  CRALEV31 BIT(1),            /* 1 = LEVEL 31 LOCK HELD    */
*        4  CRALEV30 BIT(1),            /* 1 = LEVEL 30 LOCK HELD    */
*        4  CRALEV29 BIT(1),            /* 1 = LEVEL 29 LOCK HELD    */
*        4  CRALEV28 BIT(1),            /* 1 = LEVEL 28 LOCK HELD    */
*        4  CRALEV27 BIT(1),            /* 1 = LEVEL 27 LOCK HELD    */
*        4  CRALEV26 BIT(1),            /* 1 = LEVEL 26 LOCK HELD    */
*        4  CRALEV25 BIT(1),            /* 1 = LEVEL 25 LOCK HELD    */
*        4  CRALEV24 BIT(1),            /* 1 = LEVEL 24 LOCK HELD    */
*        4  CRALEV23 BIT(1),            /* 1 = LEVEL 23 LOCK HELD    */
*        4  CRALEV22 BIT(1),            /* 1 = LEVEL 22 LOCK HELD    */
*        4  CRALEV21 BIT(1),            /* 1 = LEVEL 21 LOCK HELD    */
*        4  CRALEV20 BIT(1),            /* 1 = LEVEL 20 LOCK HELD    */
*        4  CRALEV19 BIT(1),            /* 1 = LEVEL 19 LOCK HELD    */
*        4  CRALEV18 BIT(1),            /* 1 = LEVEL 18 LOCK HELD    */
*        4  CRALEV17 BIT(1),            /* 1 = LEVEL 17 LOCK HELD    */
*        4  CRALEV16 BIT(1),            /* 1 = LEVEL 16 LOCK HELD    */
*        4  CRALEV15 BIT(1),            /* 1 = LEVEL 15 LOCK HELD    */
*        4  CRALEV14 BIT(1),            /* 1 = LEVEL 14 LOCK HELD    */
*        4  CRALEV13 BIT(1),            /* 1 = LEVEL 13 LOCK HELD    */
*        4  CRALEV12 BIT(1),            /* 1 = LEVEL 12 LOCK HELD    */
*        4  CRALEV11 BIT(1),            /* 1 = LEVEL 11 LOCK HELD    */
*        4  CRALEV10 BIT(1),            /* 1 = LEVEL 10 LOCK HELD    */
*        4  CRALEV09 BIT(1),            /* 1 = LEVEL 9 LOCK HELD     */
*        4  CRALEV08 BIT(1),            /* 1 = LEVEL 8 LOCK HELD     */
*        4  CRALEV07 BIT(1),            /* 1 = LEVEL 7 LOCK HELD     */
*        4  CRALEV06 BIT(1),            /* 1 = LEVEL 6 LOCK HELD     */
*        4  CRALEV05 BIT(1),            /* 1 = LEVEL 5 LOCK HELD     */
*        4  CRALEV04 BIT(1),            /* 1 = LEVEL 4 LOCK HELD     */
*        4  CRALEV03 BIT(1),            /* 1 = LEVEL 3 LOCK HELD     */
*        4  CRALEV02 BIT(1),            /* 1 = LEVEL 2 LOCK HELD     */
*        4  CRALEV01 BIT(1),            /* 1 = LEVEL 1 LOCK HELD     */
*      3 CRAL1PTR PTR(31),              /* PTR TO LEVEL 1 LOCK       */
*      3 CRAL2PTR PTR(31),              /* PTR TO LEVEL 2 LOCK       */
*      3 CRAL3PTR PTR(31),              /* PTR TO LEVEL 3 LOCK       */
*      3 CRAL4PTR PTR(31),              /* PTR TO LEVEL 4 LOCK       */
*      3 CRAL5PTR PTR(31),              /* PTR TO LEVEL 5 LOCK       */
*      3 CRAL6PTR PTR(31),              /* PTR TO LEVEL 6 LOCK       */
*      3 CRAL7PTR PTR(31),              /* PTR TO LEVEL 7 LOCK       */
*      3 CRAL8PTR PTR(31),              /* PTR TO LEVEL 8 LOCK       */
*      3 CRAL9PTR PTR(31),              /* PTR TO LEVEL 9 LOCK       */
*      3 CRALAPTR PTR(31),              /* RESERVED                  */
*/*                                                                  */
*/*   VS1/VS2 EXTENSION                                              */
*/*                                                                  */
*     2  CRARPH CHAR(LENGTH(ISTRPH)),   /* RPH ASSOCIATED WITH     1650
*                                          THIS CRH                  */
*     2  CRAPSS CHAR(LENGTH(ISTAPCRR)), /* PSS CRR                   */
*     2  CRAPROCR CHAR(LENGTH(ISTZCRR)) BDY(DWORD), /* PROCESS CRR   */
*     2  CRASVC CHAR(72) BDY(WORD),     /* SERVICE RTN CRA           */
*        3  CRAASCRR CHAR(LENGTH(ISTASCRR)), /* CRR FOR SMS          */
*        3  CRAHSIZ  PTR(31),           /* HEADER SIZE QUED SMS REQ  */
*        3  CRAMASK  PTR(31),           /* PREFIX MASK QUED SMS REQ  */
*        3  CRABUFA  FIXED(31),         /* BUFF QUE FOR FBQ ALLOCATION*
*           4 CRABFTBA BIT(1),          /* NO BUFFERS ALLOCATED YET   *
*     2  CRARSV01 PTR(31),              /* RESERVED                  */
*     2  CRARSV02 PTR(31),              /* RESERVED                  */
*     2  CRACHAIN PTR(31);              /* CHAIN FIELD USED TO QUEUE
*                                          CRA TO PREALLOCATE QUEUE
*                                          WHEN NOT IN USE           */
*DCL CRALMS32 BIT(32) CONSTANT('80000000'X); /* 32ND LEVEL LOCK MASK */
*DCL CRALMS31 BIT(32) CONSTANT('40000000'X); /* 31ST LEVEL LOCK MASK */
*DCL CRALMS30 BIT(32) CONSTANT('20000000'X); /* 30TH LEVEL LOCK MASK */
*DCL CRALMS29 BIT(32) CONSTANT('10000000'X); /* 29TH LEVEL LOCK MASK */
*DCL CRALMS28 BIT(32) CONSTANT('08000000'X); /* 28TH LEVEL LOCK MASK */
*DCL CRALMS27 BIT(32) CONSTANT('04000000'X); /* 27TH LEVEL LOCK MASK */
*DCL CRALMS26 BIT(32) CONSTANT('02000000'X); /* 26TH LEVEL LOCK MASK */
*DCL CRALMS25 BIT(32) CONSTANT('01000000'X); /* 25TH LEVEL LOCK MASK */
*DCL CRALMS24 BIT(32) CONSTANT('00800000'X); /* 24TH LEVEL LOCK MASK */
*DCL CRALMS23 BIT(32) CONSTANT('00400000'X); /* 23RD LEVEL LOCK MASK */
*DCL CRALMS22 BIT(32) CONSTANT('00200000'X); /* 22ND LEVEL LOCK MASK */
*DCL CRALMS21 BIT(32) CONSTANT('00100000'X); /* 21ST LEVEL LOCK MASK */
*DCL CRALMS20 BIT(32) CONSTANT('00080000'X); /* 20TH LEVEL LOCK MASK */
*DCL CRALMS19 BIT(32) CONSTANT('00040000'X); /* 19TH LEVEL LOCK MASK */
*DCL CRALMS18 BIT(32) CONSTANT('00020000'X); /* 18TH LEVEL LOCK MASK */
*DCL CRALMS17 BIT(32) CONSTANT('00010000'X); /* 17TH LEVEL LOCK MASK */
*DCL CRALMS16 BIT(32) CONSTANT('00008000'X); /* 16TH LEVEL LOCK MASK */
*DCL CRALMS15 BIT(32) CONSTANT('00004000'X); /* 15TH LEVEL LOCK MASK */
*DCL CRALMS14 BIT(32) CONSTANT('00002000'X); /* 14TH LEVEL LOCK MASK */
*DCL CRALMS13 BIT(32) CONSTANT('00001000'X); /* 13TH LEVEL LOCK MASK */
*DCL CRALMS12 BIT(32) CONSTANT('00000800'X); /* 12TH LEVEL LOCK MASK */
*DCL CRALMS11 BIT(32) CONSTANT('00000400'X); /* 11TH LEVEL LOCK MASK */
*DCL CRALMS10 BIT(32) CONSTANT('00000200'X); /* 10TH LEVEL LOCK MASK */
*DCL CRALMS09 BIT(32) CONSTANT('00000100'X); /* 9TH LEVEL LOCK MASK  */
*DCL CRALMS08 BIT(32) CONSTANT('00000080'X); /* 8TH LEVEL LOCK MASK  */
*DCL CRALMS07 BIT(32) CONSTANT('00000040'X); /* 7TH LEVEL LOCK MASK  */
*DCL CRALMS06 BIT(32) CONSTANT('00000020'X); /* 6TH LEVEL LOCK MASK  */
*DCL CRALMS05 BIT(32) CONSTANT('00000010'X); /* 5TH LEVEL LOCK MASK  */
*DCL CRALMS04 BIT(32) CONSTANT('00000008'X); /* 4TH LEVEL LOCK MASK  */
*DCL CRALMS03 BIT(32) CONSTANT('00000004'X); /* 3RD LEVEL LOCK MASK  */
*DCL CRALMS02 BIT(32) CONSTANT('00000002'X); /* 2ND LEVEL LOCK MASK  */
*DCL CRALMS01 BIT(32) CONSTANT('00000001'X); /* 1ST LEVEL LOCK MASK  */
*DCL CRACRA   CHAR(4) CONSTANT('CRA ');      /* CHARACTER C.B. ID    */
* /*  CONNECTION SERVICES COMPONENT RECOVERY RECORD                  */
* /* COMPLETED DCR SOLUTIONS                                         */
* /* 1H0540 APRIL 28, 1973 MB                                        */
*/* ZTR4417 JUNE 20, 73 DNM */                                     1684
* DCL 1 ISTCNSTA BDY(WORD) BASED,       /* CONNECTION SERVICES     1684
*                                          COMPONENT RECOVERY RECORD */
*     2  CNSTPFX CHAR(LENGTH(ISTPFCRR)), /* STANDARD PREFIX        1684
*                                          FOR CRR                   */
*     2  CNSTFLDA CHAR(3),              /* TRACE FIELD A - HISTORY   */
*        3  CNSMRINA BIT(1),            /* MASTER ENTERED            */
*        3  CNSAUTHA BIT(1),            /* ABOUT TO CALL AUTHORI-  1684
*                                          SATION EXIT       ZTR4417 */
*        3  CNSAQINA BIT(1),            /* ACQUIRE ENTERED           */
*        3  CNSXREQA BIT(1),            /* ACQUIRE SATISFIED         */
*        3  CNSQREQA BIT(1),            /* ACQUIRE QUEUED            */
*        3  CNSRLINA BIT(1),            /* RELEASE ENTERED           */
*        3  CNSDORLA BIT(1),            /* DOREL REALLOCATION      1684
*                                          ENTERED                   */
*        3  CNSTRRLA BIT(1),            /* RELEASE OF ACTIVE       1684
*                                          CONNECTION                */
*        3  CNSRQRLA BIT(1),            /* RELEASE QUEUED REQUEST    */
*        3  CNSPSINA BIT(1),            /* PASS ENTERED              */
*        3  CNSACINA BIT(1),            /* ACCEPT ENTERED            */
*        3  CNSLGINA BIT(1),            /* LOGON ENTERED             */
*        3  CNSGBINA BIT(1),            /* PREEMPT ENTERED           */
*        3  CNSCLINA BIT(1),            /* CANCEL ENTERED            */
*        3  CNSCLAQA BIT(1),            /* CANCEL ACQUIRES           */
*        3  CNSTCONA BIT(1),            /* TCONNECT                  */
*        3  CNSACONA BIT(1),            /* ACONNECT                  */
*        3  CNSQUEUA BIT(1),            /* QUEUE                     */
*        3  CNSSEARA BIT(1),            /* SEARCH Q                  */
*        3  CNSGETSA BIT(1),            /* CONNECTION SERVICES     1684
*                                          GETSTORE                  */
*        3  CNSFREEA BIT(1),            /* CONNECTION SERVICES     1684
*                                          FREESTORE                 */
*        3  CNSACCTA BIT(1),            /* ABOUT TO CALL           1684
*                                          ACCOUNTING EXIT           */
*        3  CNSLOG0A BIT(1),            /* LOGON 0                   */
*        3  CNSRSV01 BIT(1),            /* RESERVED                  */
*     2  CNSTFLDB CHAR(3),              /* TRACE FIELD B -         1684
*                                          CURRENT ACTIVITY          */
*        3  CNSMRINB BIT(1),                                       1684
*        3  CNSAUTHB BIT(1),                                       1684
*        3  CNSAQINB BIT(1),                                       1684
*        3  CNSXREQB BIT(1),                                       1684
*        3  CNSQREQB BIT(1),                                       1684
*        3  CNSRLINB BIT(1),                                       1684
*        3  CNSDORLB BIT(1),                                       1684
*        3  CNSTRRLB BIT(1),                                       1684
*        3  CNSRQRLB BIT(1),                                       1684
*        3  CNSPSINB BIT(1),                                       1684
*        3  CNSACINB BIT(1),                                       1684
*        3  CNSLGINB BIT(1),                                       1684
*        3  CNSGBINB BIT(1),                                       1684
*        3  CNSCLINB BIT(1),                                       1684
*        3  CNSCLAQB BIT(1),                                       1684
*        3  CNSTCONB BIT(1),                                       1684
*        3  CNSACONB BIT(1),                                       1684
*        3  CNSQUEUB BIT(1),                                       1684
*        3  CNSSEARB BIT(1),                                       1684
*        3  CNSGETSB BIT(1),                                       1684
*        3  CNSFREEB BIT(1),                                       1684
*        3  CNSACCTB BIT(1),                                       1684
*        3  CNSLOG0B BIT(1),                                       1684
*        3  CNSRSV05 BIT(1);                                       1684
* /*     CRR FOR OPEN/CLOSE                                          */
*/*  REVISIONS                                         002 03/27/75  */
* DCL 1 ISTOCCRR BDY(WORD) BASED,       /* CRR FOR OPEN/CLOSE        */
*     2  OCCCNS   CHAR(LENGTH(ISTCNSTA)), /* RESERVE SPACE FOR     1685
*                                          CONN. SVC'S AUDIT         */
*     2  OCCAUDIT,                      /* AUDIT TRAIL FOR OPEN/CLOSE*/
*        3  OCCNTRD CHAR(3),            /* LIST OF MODULES IN OPEN/
*                                          CLOSE ENTERED             */
*           4  NOCCOC BIT(1),           /* INDICATES MODULE ISTOCCOC
*                                          ENTERED                   */
*           4  NOCCCL BIT(1),           /* INDICATES MODULE ISTOCCCL
*                                          ENTERED                   */
*           4  NOCCCH BIT(1),           /* INDICATES MODULE ISTOCCCH
*                                          ENTERED                   */
*           4  NOCCSL BIT(1),           /* INDICATES MODULE ISTOCCSL
*                                          ENTERED                   */
*           4  NOCCFO BIT(1),           /* INDICATES MODULE ISTOCCFO
*                                          ENTERED                   */
*           4  NOCCFR BIT(1),           /* INDICATES MODULE ISTOCCFR
*                                          ENTERED                   */
*           4  NOCCMD BIT(1),           /* INDICATES MODULE ISTOCCMD
*                                          ENTERED                   */
*           4  NOCCFD BIT(1),           /* INDICATES MODULE ISTOCCFD
*                                          ENTERED                   */
*           4  NOCCRD BIT(1),           /* INDICATES MODULE ISTOCCRD
*                                          ENTERED                   */
*           4  NOCCSD BIT(1),           /* INDICATES MODULE ISTOCCSD
*                                          ENTERED                   */
*           4  NOCCOD BIT(1),           /* INDICATES MODULE ISTOCCOD
*                                          ENTERED                   */
*           4  NOCCOE BIT(1),           /* INDICATES MODULE ISTOCCOE
*                                          ENTERED                   */
*           4  NOCCLD BIT(1),           /* INDICATES MODULE ISTOCCLD
*                                          ENTERED                   */
*           4  NOCCOF BIT(1),           /* INDICATES MODULE ISTOCCOF
*                                          ENTERED                   */
*           4  NOCCFB BIT(1),           /* INDICATES MODULE ISTOCCFB
*                                          ENTERED                   */
*           4  NOCCRT BIT(1),           /* INDICATES MODULE ISTOCCRT
*                                          ENTERED                   */
*           4  NOCCQU BIT(1),           /* INDICATES MODULE ISTOCCQU
*                                          ENTERED                   */
*           4  NOCCRL BIT(1),           /* INDICATES MODULE ISTOCCRL
*                                          ENTERED                   */
*           4  NOCCCC   BIT(1),         /* INDICATES MODULE ISTOCCCC
*                                          ENTERED                   */
*           4  NOCCNV BIT(1),           /* INDICATES MODULE ISTOCCNV
*                                          ENTERED                   */
*           4  NOCCCM BIT(1),           /* ISTOCCCM ENTERED          */
*           4  NOCCCN BIT(1),           /* ISTOCCCN ENTERED          */
*           4  NOCACX   BIT(1),                                    1685
*           4  NOCPOI BIT(1),           /* ISTCFCPO ENTERED OR       */
*                                       /* ISTCFCPC ENTERED          */
*        3  OCCCRT CHAR(3),             /* LIST OF OPEN/CLOSE      1685
*                                          MODULES RUNNING           */
*           4  COCCOC BIT(1),           /* INDICATES MODULE ISTOCCOC
*                                          RUNNING                   */
*           4  COCCCL BIT(1),           /* INDICATES MODULE ISTOCCCL
*                                          RUNNING                   */
*           4  COCCCH BIT(1),           /* INDICATES MODULE ISTOCCCH
*                                          RUNNING                   */
*           4  COCCSL BIT(1),           /* INDICATES MODULE ISTOCCSL
*                                          RUNNING                   */
*           4  COCCFO BIT(1),           /* INDICATES MODULE ISTOCCFO
*                                          RUNNING                   */
*           4  COCCFR BIT(1),           /* INDICATES MODULE ISTOCCFR
*                                          RUNNING                   */
*           4  COCCMD BIT(1),           /* INDICATES MODULE ISTOCCMD
*                                          RUNNING                   */
*           4  COCCFD BIT(1),           /* INDICATES  MODULE ISTOCCFD
*                                          RUNNING                   */
*           4  COCCRD BIT(1),           /* INDICATES MODULE ISTOCCRD
*                                          RUNNING                   */
*           4  COCCSD BIT(1),           /* INDICATES MODULE ISTOCCSD
*                                          RUNNING                   */
*           4  COCCOD BIT(1),           /* INDICATES MODULE ISTOCCOD
*                                          RUNNING                   */
*           4  COCCOE BIT(1),           /* INDICATES MODULE ISTOCCOE
*                                          RUNNING                   */
*           4  COCCLD BIT(1),           /* INDICATES MODULE ISTOCCLD
*                                          RUNNING                   */
*           4  COCCOF BIT(1),           /* INDICATES MODULE ISTOCCOF
*                                          RUNNING                   */
*           4  COCCFB BIT(1),           /* INDICATES MODULE ISTOCCFB
*                                          RUNNING                   */
*           4  COCCRT BIT(1),           /* INDICATES MODULE ISTOCCRT
*                                          RUNNING                   */
*           4  COCCQU BIT(1),           /* INDICATES MODULE ISTOCCQU
*                                          RUNNING                   */
*           4  COCCRL BIT(1),           /* INDICATES MODULE ISTOCCRL
*                                          RUNNING                   */
*           4  COCCCC   BIT(1),         /* INDICATES MOD ISTOCCCC  1685
*                                          RUNNING                   */
*           4  COCCNV BIT(1),           /* INDICATES MODULE ISTOCCNV
*                                          RUNNING                   */
*           4  COCCCM BIT(1),           /* ISTOCCCM RUNNING          */
*           4  COCCCN BIT(1),           /* ISTOCCCN RUNNING          */
*           4  COCACX   BIT(1),                                    1685
*           4  COCPOI BIT(1);           /* ISTCFCPO RUNNING OR       */
*                                       /* ISTCFCPC RUNNING          */
*DCL TIDOCCCC BIT(8) CONSTANT('00'X);   /* THREAD ID FOR           1686
*                                          ISTOCCCC                  */
*DCL TIDOCCCH BIT(8) CONSTANT('01'X);   /* THREAD ID FOR           1687
*                                          ISTOCCCH                  */
*DCL TIDOCCOD BIT(8) CONSTANT('02'X);   /* THREAD ID FOR           1688
*                                          ISTOCCOD                  */
*DCL TIDOCCCL BIT(8) CONSTANT('04'X);   /* THREAD ID FOR           1689
*                                          ISTOCCCL                  */
*DCL TIDOCCOC BIT(8) CONSTANT('08'X);   /* THREAD ID FOR           1690
*                                          ISTOCCOC                  */
*DCL TIDOCCRT BIT(8) CONSTANT('10'X);   /* THREAD ID FOR           1691
*                                          ISTOCCRT                  */
*DCL TIDOCCQU BIT(8) CONSTANT('20'X);   /* THREAD ID FOR           1692
*                                          ISTOCCQU                  */
*DCL TIDOCACX BIT(8) CONSTANT('30'X);   /* THREAD ID FOR           1693
*                                          ISTOCACX                  */
*                                                                  1694
* DECLARE                                                          1694
*   EMCR0 PTR REG(0),                                              1694
*   EMCR1 PTR REG(1),                                              1694
*   EMCR2 PTR REG(2),                                              1694
*   EMCR3 PTR REG(3),                                              1694
*   EMCR4 PTR REG(4),                                              1694
*   EMCR5 PTR REG(5),                                              1694
*   EMCR6 PTR REG(6),                                              1694
*   EMCR7 PTR REG(7),                                              1694
*   EMCR8 PTR REG(8),                                              1694
*   EMCR9 PTR REG(9),                                              1694
*   EMCR10 PTR REG(10),                                            1694
*   EMCR11 PTR REG(11),                                            1694
*   EMCR12 PTR REG(12),                                            1694
*   EMCR13 PTR REG(13),                                            1694
*   EMCR14 PTR REG(14),                                            1694
*   EMCR15 PTR REG(15);                                            1694
*                                                                  1694
* DECLARE                                                          1695
*   ISTSDCCA ENTRY BASED(ATCCDADD) VALRG(*), /*CIDCTL ADD ROUTINE*/
*   ISTSDCCD ENTRY BASED(ATCCDDEL) VALRG(*), /*CIDCTL DELETE ROUTINE*/
*   ISTSDCCF ENTRY BASED(ATCCDFND) VALRG(*), /*CIDCTL FIND ROUTINE*/
*   ISTSDCCN ENTRY BASED(ATCCDFDN) VALRG(*), /*CIDCTL FIND NCB ROUTINE*
*   ISTSDCCR ENTRY BASED(ATCCDFIN) VALRG(*); /*CIDCTL FINISH ROUTINE*/
*   DCL CMZCIDM FIXED(15) DEFINED(ATCCIDM); /*CIDMASK ALIAS*/      1696
* GEN (PRINT ON);                                                  1697
         PRINT ON
*/* END OF TPEPILOG */                                                /
*@D31KKMP*/                                                        1698
*/* ATDSPLY   INVOKED. */                                          1698
*/********************************************************************/
*/* THE FOLLOWING ATBUILD INCLUSIONS HAVE BEEN MADE IN THIS          */
*/* COMPILATION:                                                     */
*/*             ISTRPH                                               */
*/*             ISTDEVCH                                             */
*/*             ISTPROCD                                             */
*/*             ISTNIB                                               */
*/*             ISTCSP                                               */
*/*             ISTBIND                                              */
*/*             ISTCSL                                               */
*/*             ISTOCW                                               */
*/*             ISTPAB                                               */
*/*             ISTLOK                                               */
*/*             ISTACDEB                                             */
*/*             ISTRDT                                               */
*/*             ISTNCB                                               */
*/*             ISTDNCB                                              */
*/*             ISTLDNCB                                             */
*/*             ISTFMCB                                              */
*/*             ISTHCNCB                                             */
*/*             ISTICNCB                                             */
*/*             ISTLUNCB                                             */
*/*             ISTCCNCB                                             */
*/*             ISTDYPAB                                             */
*/*             ISTATCVT                                             */
*/*             ISTLCCW                                              */
*/*             ISTLCPB                                              */
*/*             ISTZSAVE                                             */
*/*             ISTPFCRR                                             */
*/*             ISTCFCRR                                             */
*/*             ISTZCRR                                              */
*/*             ISTASCRR                                             */
*/*             ISTAPCRR                                             */
*/*             ISTCRA                                               */
*/*             ISTCNSTA                                             */
*/*             ISTOCCRR                                             */
*/********************************************************************/
*/* END OF ATDSPLY. */                                             1698
**@D31KKMP*/                                                       1698
*END ISTOCCFB                                                      1698
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.      *
*/*%INCLUDE SYSLIB  (CVT     )                                        *
*/*%INCLUDE SYSLIB  (IEZIOB  )                                        *
*/*%INCLUDE SYSLIB  (IECDIOSB)                                        *
*/*%INCLUDE SYSLIB  (IHASRB  )                                        *
*/*%INCLUDE SYSLIB  (IFGRPL  )                                        *
*/*%INCLUDE SYSLIB  (IFGRPLVT)                                        *
*/*%INCLUDE SYSLIB  (ISTRPLFB)                                        *
*/*%INCLUDE SYSUT5  (RRNDELTA)                                        *
*/*%INCLUDE SYSUT5  (RRNLOGIC)                                        *
*/*%INCLUDE SYSUT5  (RRNCTOSB)                                        *
*/*%INCLUDE SYSUT5  (RRNCTGT1)                                        *
*;                                                                 1698
@EL00001 DS    0H                                                  1698
@EF00001 DS    0H                                                  1698
@ER00001 LM    @14,@12,12(@13)                                     1698
         BR    @14                                                 1698
@DATA    DS    0H
@CH00063 DC    H'1'
@CH00055 DC    H'4'
@CH00061 DC    H'8'
@CH00034 DC    H'12'
@CH00802 DC    H'16'
@CH05551 DC    H'120'
@CH05555 DC    H'584'
@CH05547 DC    H'696'
@DATD    DSECT
         DS    0F
ISTOCCFB CSECT
         DS    0F
@CF02254 DC    XL4'80000000'
@CF04415 DC    XL4'00FFFFFF'
@CF05572 DC    BL4'00000010000000000000000000000000'
@CF05577 DC    BL4'00000000001000000000000000000000'
@CF05580 DC    BL4'00000100000000000000000000000000'
@DATD    DSECT
         DS    0D
CVTPTR   DS    A
IOBPRPTR DS    A
IOBSTPTR DS    A
IOSBPTR  DS    A
SRBPTR   DS    A
DNCBPTR  DS    A
LDNCBPTR DS    A
FMCBPTR  DS    A
LCPBPTR  DS    A
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA
@ENDDATD EQU   *
ISTOCCFB CSECT
         DS    0F
@SIZDATD DC    AL1(0)
         DC    AL3(@ENDDATD-@DATD)
         DS    0D
FMZA0020 DS    FL4
         ORG   FMZA0020
@NM00095 DC    AL1(152)
@NM00096 DC    AL3(0)
         ORG   FMZA0020+4
FMZA0039 DS    FL4
         ORG   FMZA0039
@NM00097 DC    AL1(152)
@NM00098 DC    AL3(0)
         ORG   FMZA0039+4
FMZA0058 DS    FL4
         ORG   FMZA0058
@NM00099 DC    AL1(64)
@NM00100 DC    AL3(0)
         ORG   FMZA0058+4
CMZA0099 DS    FL4
         ORG   CMZA0099
@NM00101 DC    AL1(96)
@NM00102 DC    AL1(96)
@NM00103 DC    AL1(227)
@NM00104 DC    XL1'00'
         ORG   CMZA0099+4
CMZA0119 DS    FL4
         ORG   CMZA0119
@NM00105 DC    AL1(96)
@NM00106 DC    AL1(96)
@NM00107 DC    AL1(227)
@NM00108 DC    XL1'00'
         ORG   CMZA0119+4
CMZA0139 DS    FL4
         ORG   CMZA0139
@NM00109 DC    AL1(96)
@NM00110 DC    AL1(96)
@NM00111 DC    AL1(227)
@NM00112 DC    XL1'00'
         ORG   CMZA0139+4
FMZA0159 DS    FL4
         ORG   FMZA0159
@NM00113 DC    AL1(152)
@NM00114 DC    AL3(0)
         ORG   FMZA0159+4
FMZA0178 DS    FL4
         ORG   FMZA0178
@NM00115 DC    AL1(64)
@NM00116 DC    AL3(0)
         ORG   FMZA0178+4
FMZA0254 DS    FL4
         ORG   FMZA0254
@NM00117 DC    AL1(64)
@NM00118 DC    AL3(0)
         ORG   FMZA0254+4
CMZA0270 DS    FL4
         ORG   CMZA0270
@NM00119 DC    AL1(64)
@NM00120 DC    AL1(96)
@NM00121 DC    AL1(227)
@NM00122 DC    XL1'01'
         ORG   CMZA0270+4
FMZA0289 DS    FL4
         ORG   FMZA0289
@NM00123 DC    AL1(64)
@NM00124 DC    AL3(0)
         ORG   FMZA0289+4
FMZA0307 DS    FL4
         ORG   FMZA0307
@NM00125 DC    AL1(152)
@NM00126 DC    AL3(0)
         ORG   FMZA0307+4
FMZA0326 DS    FL4
         ORG   FMZA0326
@NM00127 DC    AL1(64)
@NM00128 DC    AL3(0)
         ORG   FMZA0326+4
FMZA0344 DS    FL4
         ORG   FMZA0344
@NM00129 DC    AL1(152)
@NM00130 DC    AL3(0)
         ORG   FMZA0344+4
FMZA0363 DS    FL4
         ORG   FMZA0363
@NM00131 DC    AL1(64)
@NM00132 DC    AL3(0)
         ORG   FMZA0363+4
@CC03601 DC    C'ISTYPSOL'
@CC04265 DC    C'ISTYCONT'
@CC04267 DC    C'ISTYCLUS'
@CC04269 DC    C'ISTYSSCP'
@CC04271 DC    C'ISTYTCM2'
@CB03582 DC    X'0000'
@CB04492 DC    X'0001'
CDVTLIST DS    CL40
         ORG   CDVTLIST
CDVTCLOB DC    CL8'ISTCLOBP'
CDVTCLIB DC    CL8'ISTCLIBP'
CDVTTPOB DC    CL8'ISTTPOBP'
CDVTTPIB DC    CL8'ISTTPIBP'
CDVTEND  DS    CL8
         ORG   CDVTEND
CDVTATOB DC    CL8'ISTATOBP'
         ORG   CDVTLIST+40
@00      EQU   00                      EQUATES FOR REGISTERS 0-15
@01      EQU   01
@02      EQU   02
@03      EQU   03
@04      EQU   04
@05      EQU   05
@06      EQU   06
@07      EQU   07
@08      EQU   08
@09      EQU   09
@10      EQU   10
@11      EQU   11
@12      EQU   12
@13      EQU   13
@14      EQU   14
@15      EQU   15
RPHPTR   EQU   @01
CREG0    EQU   @00
CREG1    EQU   @01
CREG2    EQU   @02
CDVTSVAD EQU   @02
COCWPTR  EQU   @04
CP       EQU   @05
CLISTPTR EQU   @05
CPABPTR  EQU   @05
DEVCHPTR EQU   @05
CINTCODE EQU   @06
CADEBPTR EQU   @07
BASERDTE EQU   @08
CNSNPTR  EQU   @09
SDLCRDTE EQU   @10
CREG13   EQU   @13
CREG15   EQU   @15
CMZK0010 EQU   @01
CMZK0012 EQU   @01
GPR01P   EQU   @01
GPR02P   EQU   @02
GPR03F   EQU   @03
GPR03P   EQU   @03
GPR04F   EQU   @04
GPR04P   EQU   @04
GPR05P   EQU   @05
GPR06P   EQU   @06
GPR07P   EQU   @07
GPR08P   EQU   @08
GPR09P   EQU   @09
GPR10P   EQU   @10
GPR11P   EQU   @11
GPR12P   EQU   @12
GPR13P   EQU   @13
GPR15P   EQU   @15
GPR00F   EQU   @00
GPR00P   EQU   @00
GPR14P   EQU   @14
EMCR2    EQU   @02
EMCR3    EQU   @03
CNIBPTR  EQU   @03
CREG11   EQU   @11
CREG12   EQU   @12
CREG14   EQU   @14
EMCR0    EQU   @00
EMCR1    EQU   @01
EMCR10   EQU   @10
EMCR11   EQU   @11
EMCR12   EQU   @12
EMCR13   EQU   @13
EMCR14   EQU   @14
EMCR15   EQU   @15
EMCR4    EQU   @04
EMCR5    EQU   @05
EMCR6    EQU   @06
EMCR7    EQU   @07
EMCR8    EQU   @08
EMCR9    EQU   @09
GPR01F   EQU   @01
GPR02F   EQU   @02
GPR05F   EQU   @05
GPR06F   EQU   @06
GPR07F   EQU   @07
GPR08F   EQU   @08
GPR09F   EQU   @09
GPR10F   EQU   @10
GPR11F   EQU   @11
GPR12F   EQU   @12
GPR13F   EQU   @13
GPR14F   EQU   @14
GPR15F   EQU   @15
ATCLCPTR EQU   1032
CVTMAP   EQU   0
CVTDAR   EQU   CVTMAP+72
CVTFLGS1 EQU   CVTDAR
CVTDCB   EQU   CVTMAP+116
CVTIERLC EQU   CVTMAP+144
CVTOPTA  EQU   CVTMAP+182
CVTOPTB  EQU   CVTMAP+183
CVTGTF   EQU   CVTMAP+236
CVTGTFST EQU   CVTGTF
CVTGTFS  EQU   CVTGTFST
CVTSTATE EQU   CVTGTFST
CVTTMODE EQU   CVTGTFST
CVTFORM  EQU   CVTGTFST
CVTAQAVT EQU   CVTMAP+240
CVTTCMFG EQU   CVTAQAVT
CVTVOLM2 EQU   CVTMAP+244
CVTTATA  EQU   CVTVOLM2
CVTTSKS  EQU   CVTTATA
CVTVOLF2 EQU   CVTTSKS
CVTTAT   EQU   CVTTATA+1
CVTATER  EQU   CVTMAP+248
CVTEXT1  EQU   CVTMAP+252
CVTPURG  EQU   CVTMAP+260
CVTQMSG  EQU   CVTMAP+268
CVTDMSR  EQU   CVTMAP+272
CVTRSV37 EQU   CVTDMSR
CVTDMSRF EQU   CVTRSV37
CVTERPV  EQU   CVTMAP+316
CVTINTLA EQU   CVTMAP+320
CVTAPF   EQU   CVTMAP+324
CVTEXT2  EQU   CVTMAP+328
CVTHJES  EQU   CVTMAP+332
CVTPGSIA EQU   CVTMAP+348
CVTA1F1  EQU   CVTMAP+356
CVTSYSK  EQU   CVTMAP+357
CVTVOLM1 EQU   CVTMAP+380
CVTVOLF1 EQU   CVTVOLM1
CVTATMCT EQU   CVTMAP+388
CVTXTNT1 EQU   0
CVTXTNT2 EQU   0
CVTDSSV  EQU   CVTXTNT2
CVTFLGBT EQU   CVTXTNT2+5
CVTQID   EQU   CVTXTNT2+24
CVTSHS   EQU   CVTXTNT2+40
CVTRV400 EQU   CVTXTNT2+52
CVTRV409 EQU   CVTXTNT2+53
CVTATCVT EQU   CVTXTNT2+64
CVTRV429 EQU   CVTXTNT2+84
CVTRV438 EQU   CVTXTNT2+85
CVTRV457 EQU   CVTXTNT2+112
CVTRV466 EQU   CVTXTNT2+113
CVTFIX   EQU   0
CVTRELNO EQU   CVTFIX+252
IOBPREFX EQU   0
IOBCFLG1 EQU   IOBPREFX
IOBSTDRD EQU   0
IOBFLAG1 EQU   IOBSTDRD
IOBCYCCK EQU   IOBFLAG1
IOBRSTRT EQU   IOBFLAG1
IOBFLAG2 EQU   IOBSTDRD+1
IOBPURGE EQU   IOBFLAG2
IOBRDHA0 EQU   IOBFLAG2
IOBSENS0 EQU   IOBSTDRD+2
IOBS0B7  EQU   IOBSENS0
IOBSENS1 EQU   IOBSTDRD+3
IOBECBPT EQU   IOBSTDRD+4
IOBFLAG3 EQU   IOBSTDRD+8
IOBFL3   EQU   IOBFLAG3
IOBCNC   EQU   IOBFL3
IOBICL   EQU   IOBFL3
IOBCSW   EQU   IOBSTDRD+9
IOBIOCSW EQU   IOBCSW
IOBSTBYT EQU   IOBIOCSW+3
IOBUSTAT EQU   IOBSTBYT
IOBCSTAT EQU   IOBSTBYT+1
IOBSTART EQU   IOBSTDRD+16
IOBDCBPT EQU   IOBSTDRD+20
IOBFLAG4 EQU   IOBDCBPT
IOBRESTR EQU   IOBSTDRD+24
IOBINCAM EQU   IOBSTDRD+28
IOBBTAMF EQU   IOBINCAM
IOSB     EQU   0
IOSFLA   EQU   IOSB
IOSACHN  EQU   IOSFLA
IOSFLB   EQU   IOSB+1
IOSFLC   EQU   IOSB+2
IOSDVALT EQU   IOSFLC
IOSPKEY  EQU   IOSB+12
IOSOPT   EQU   IOSB+14
IOSOPT2  EQU   IOSB+15
@NM00004 EQU   IOSB+20
IOSCSW   EQU   @NM00004+1
IOSTATUS EQU   IOSCSW+3
IOSIPIB  EQU   IOSB+44
IOSPATH  EQU   IOSB+86
IOSCHN   EQU   IOSPATH
IOSCKEY  EQU   IOSB+89
IOSEEKA  EQU   IOSB+100
IOSCCHH  EQU   IOSEEKA+3
IOSSKHH  EQU   IOSCCHH+2
SRBSECT  EQU   0
SRBFLC   EQU   SRBSECT+12
IFGRPL   EQU   0
RPLCOMN  EQU   IFGRPL
RPLIDWD  EQU   RPLCOMN
RPLREQ   EQU   RPLIDWD+2
RPLLEN   EQU   RPLIDWD+3
RPLECB   EQU   RPLCOMN+8
RPLFDBWD EQU   RPLCOMN+12
RPLFDBK  EQU   RPLFDBWD+1
RPLRTNCD EQU   RPLFDBK
RPLCNDCD EQU   RPLFDBK+1
RPLCMPON EQU   RPLCNDCD
RPLFDB2  EQU   RPLCMPON
RPLERRCD EQU   RPLCNDCD+1
RPLFDB3  EQU   RPLERRCD
RPLKEYLE EQU   RPLCOMN+16
RPLARG   EQU   RPLCOMN+36
RPLOPTCD EQU   RPLCOMN+40
RPLOPT1  EQU   RPLOPTCD
RPLECBSW EQU   RPLOPT1
RPLOPT2  EQU   RPLOPTCD+1
RPLADR   EQU   RPLOPT2
RPLOPT3  EQU   RPLOPTCD+2
RPLOPT4  EQU   RPLOPTCD+3
RPLNXTRP EQU   RPLCOMN+44
RPLOPTC2 EQU   RPLCOMN+56
RPLOPT5  EQU   RPLOPTC2
RPLDLGIN EQU   RPLOPT5
RPLWRTYP EQU   RPLOPT5
RPLOPT6  EQU   RPLOPTC2+1
RPLUNTYP EQU   RPLOPT6
RPLOPT7  EQU   RPLOPTC2+2
RPLCNOPT EQU   RPLOPT7
RPLOPT8  EQU   RPLOPTC2+3
RPLRBAR  EQU   RPLCOMN+60
RPLAIXID EQU   RPLRBAR+2
RPLEXTDS EQU   RPLCOMN+68
RPLEXTD1 EQU   RPLEXTDS
RPLVTEXT EQU   IFGRPL+76
RPLFDBK2 EQU   RPLVTEXT+12
RPLSSNSI EQU   RPLFDBK2
RPLDSB   EQU   RPLSSNSI
RPLDSB1  EQU   RPLDSB
RPLSSEI  EQU   RPLDSB1
RPLDSB2  EQU   RPLDSB+1
RPLUSNSI EQU   RPLFDBK2+2
RPLOPTC3 EQU   RPLVTEXT+20
RPLOPT9  EQU   RPLOPTC3
RPLOPT10 EQU   RPLOPTC3+1
RPLOPT11 EQU   RPLOPTC3+2
RPLOPT12 EQU   RPLOPTC3+3
RPLOSENS EQU   RPLVTEXT+24
RPLSSNSO EQU   RPLOSENS
RPLSSEO  EQU   RPLSSNSO
RPLOF16  EQU   0
RPLRH3   EQU   RPLOF16
RPLSRTYP EQU   RPLOF16+1
RPLSTYPE EQU   RPLSRTYP
RPLRTYPE EQU   RPLSRTYP
RPLCHN   EQU   RPLOF16+2
RPLVTFL1 EQU   RPLOF16+3
RPLVTUSE EQU   RPLVTFL1
RPLVTFL2 EQU   RPLOF16+4
RPLPOSTV EQU   RPLVTFL2
RPLRESP  EQU   RPLVTFL2
RPLCNTRL EQU   RPLOF16+5
RPLCNTDF EQU   RPLCNTRL
RPLCNTDC EQU   RPLCNTRL+1
RPLCNTSC EQU   RPLCNTRL+2
RPLOF60  EQU   0
RPLOBSQ  EQU   RPLOF60+4
RPLIBSQ  EQU   RPLOF60+5
ISTRPH   EQU   0
RPHCNTL  EQU   ISTRPH
RPHFLAGS EQU   RPHCNTL+2
RPHAPTYP EQU   RPHFLAGS
RPHFSTLC EQU   RPHFLAGS
RPHFLGB  EQU   RPHCNTL+3
RPHRPHA  EQU   ISTRPH+4
RPHTSKID EQU   ISTRPH+8
RPHDVTA  EQU   ISTRPH+12
RPHRESMA EQU   ISTRPH+16
RPHWPFLG EQU   RPHRESMA
RPHWEA   EQU   ISTRPH+24
RPHCSPA  EQU   RPHWEA
RPHSRPRM EQU   ISTRPH+28
RPHCRR   EQU   ISTRPH+32
RPHPABQA EQU   ISTRPH+36
RPHWORK  EQU   ISTRPH+40
RPHSAVE1 EQU   RPHWORK
RPHSBITS EQU   RPHSAVE1+1
ISTDEVCH EQU   0
DEVSHCH  EQU   ISTDEVCH
DEVCHAR  EQU   DEVSHCH
DEVSUBND EQU   DEVCHAR
DEVTCODE EQU   ISTDEVCH+1
DEVFLAGS EQU   ISTDEVCH+3
DEVFCCTL EQU   DEVFLAGS
DEVCHAR3 EQU   DEVFLAGS
ISTPROCD EQU   0
PROPROC  EQU   ISTPROCD
PROPROC1 EQU   PROPROC
PROPROC2 EQU   PROPROC+1
PROPROC3 EQU   PROPROC+2
PROPROC4 EQU   PROPROC+3
PROPROCS EQU   0
PROSETMS EQU   PROPROCS+1
PROSETM2 EQU   PROSETMS
PROSETM3 EQU   PROSETMS+1
PROSETM4 EQU   PROSETMS+2
ISTNIB   EQU   0
NIBUSER  EQU   ISTNIB+8
NIBMODE  EQU   ISTNIB+20
NIBFLGS  EQU   ISTNIB+40
NIBFLG1  EQU   NIBFLGS
NIBLIMIT EQU   ISTNIB+42
NIBEXLST EQU   ISTNIB+44
ISTCSP   EQU   0
CSPOPT   EQU   ISTCSP+2
CSPOPT1  EQU   CSPOPT
CSPOPT2  EQU   CSPOPT+1
CSPRSC2B EQU   ISTCSP+32
ISTBIND  EQU   0
BINFMTY  EQU   ISTBIND
BINPRIP  EQU   ISTBIND+3
BINSECP  EQU   ISTBIND+4
BINCMNP  EQU   ISTBIND+5
BINCMNP2 EQU   ISTBIND+6
BINTSU   EQU   ISTBIND+7
BINRPACE EQU   BINTSU+1
BINRUSZ  EQU   BINTSU+2
BINSRUSZ EQU   BINRUSZ
BINPRUSZ EQU   BINRUSZ+1
BINPRSVC EQU   ISTBIND+13
BINLUP   EQU   BINPRSVC
BINPSCHR EQU   BINPRSVC+1
ISTCSL   EQU   0
CSLRDEF  EQU   ISTCSL
CSLRDTE  EQU   CSLRDEF
CSLNDEF  EQU   ISTCSL+4
CSLNIB   EQU   CSLNDEF
CSLDDEF  EQU   ISTCSL+8
CSLDATA  EQU   CSLDDEF
ISTOCW   EQU   0
OCWSLEN  EQU   ISTOCW+1
OCWRPL   EQU   ISTOCW+12
OCWACVT  EQU   ISTOCW+24
OCWLRDTE EQU   ISTOCW+40
OCWDRDTE EQU   OCWLRDTE
OCWARDTE EQU   ISTOCW+48
OCWEPTAB EQU   ISTOCW+52
OCWFMCB  EQU   ISTOCW+56
OCWNCB   EQU   ISTOCW+60
OCWACDEB EQU   ISTOCW+64
OCWODRC  EQU   ISTOCW+92
OCWRC    EQU   OCWODRC
OCWEC    EQU   OCWODRC+1
OCWSVCOD EQU   ISTOCW+94
OCWDNIB  EQU   ISTOCW+112
OCWSCPAD EQU   ISTOCW+176
OCWSWTA  EQU   ISTOCW+204
OCWSWTB  EQU   ISTOCW+205
OCWSWTC  EQU   ISTOCW+206
OCWSWTD  EQU   ISTOCW+207
OCWSWTRD EQU   ISTOCW+730
OCWSWTE  EQU   ISTOCW+731
OCWBHSID EQU   ISTOCW+733
OCWLOCKS EQU   ISTOCW+740
OCWCLOCK EQU   OCWLOCKS
OCWCID   EQU   ISTOCW+744
OCWDAF   EQU   OCWCID+2
OCWPROCD EQU   ISTOCW+756
OCWIOCNT EQU   ISTOCW+760
OCWSHPL  EQU   ISTOCW+784
OCWBIND  EQU   ISTOCW+796
OCWFLG1  EQU   ISTOCW+847
ISTPAB   EQU   0
PABWQCHN EQU   ISTPAB
PABWEQA  EQU   PABWQCHN
PABCHAIN EQU   PABWQCHN+4
PABOFFST EQU   ISTPAB+8
PABDVTA  EQU   ISTPAB+9
PABRPHFG EQU   ISTPAB+12
PABFLAGS EQU   PABRPHFG
PABERLCK EQU   PABFLAGS
PABERRLK EQU   PABERLCK
PABINHBT EQU   PABFLAGS
PABNODQ  EQU   PABFLAGS
ISTLOK   EQU   0
LOKCHN   EQU   ISTLOK+1
LOKCHNG  EQU   LOKCHN
@NM00050 EQU   LOKCHNG+2
ISTACDEB EQU   0
ACDVTPRX EQU   ISTACDEB
ACDTSKID EQU   ACDVTPRX+8
ACDDBPFX EQU   ISTACDEB+16
ACDTBLOF EQU   ACDDBPFX+6
ACDBASIC EQU   ISTACDEB+24
ACDTCBAD EQU   ACDBASIC
ACDNMSUB EQU   ACDTCBAD
ACDDEBAD EQU   ACDBASIC+4
ACDUSRPG EQU   ACDBASIC+16
ACDACBAD EQU   ACDBASIC+24
ACDAPPAD EQU   ACDBASIC+28
ACDVTAM  EQU   ISTACDEB+56
ACDLOCK  EQU   ACDVTAM
ACDFMCB  EQU   ACDVTAM+8
ACDSSFLG EQU   ACDVTAM+80
ACDAPDAT EQU   ACDVTAM+83
ACDSIP   EQU   ISTACDEB+168
ISTRPRE  EQU   0
RPRCOMID EQU   ISTRPRE+8
RPRDAF   EQU   RPRCOMID+2
RPRELEN  EQU   ISTRPRE+16
RPRENTRY EQU   ISTRPRE+20
RPRFLAGA EQU   ISTRPRE+21
RPRACT   EQU   RPRFLAGA
RPRENTBF EQU   RPRFLAGA
RPRENTIO EQU   RPRFLAGA
RPRENTED EQU   RPRFLAGA
RPRVRYPD EQU   RPRFLAGA
RPRFLAGB EQU   ISTRPRE+22
RPRAOPN  EQU   RPRFLAGB
RPRHLVPD EQU   RPRFLAGB
RPRCAUSE EQU   ISTRPRE+23
RPRHDTYP EQU   ISTRPRE+27
RPRNSNEA EQU   ISTRPRE+36
RPRNCBA  EQU   ISTRPRE+40
RPRDEVCH EQU   ISTRPRE+44
RPRSWDAF EQU   ISTRPRE+58
RPRFLAGD EQU   ISTRPRE+61
RPRFLAGC EQU   ISTRPRE+62
ISTRCPRE EQU   0
RCPBHSI2 EQU   ISTRCPRE+89
RCPBFLIM EQU   ISTRCPRE+90
RCPPMODE EQU   ISTRCPRE+91
RCPRBASC EQU   RCPPMODE
RCPRRECD EQU   RCPPMODE
RCPLGNIN EQU   ISTRCPRE+92
ISTRDT   EQU   0
RDTPLEN  EQU   ISTRDT+72
RDTPRIOR EQU   RDTPLEN
RDTFLAGB EQU   ISTRDT+91
RDTVYRPH EQU   ISTRDT+108
RDTSTCNT EQU   ISTRDT+112
ISTRAP   EQU   0
RAPACDEB EQU   ISTRAP+76
RAPFLG   EQU   ISTRAP+108
RAPFLGB  EQU   ISTRAP+109
RAPALLF  EQU   RAPFLGB
RAPANVPC EQU   RAPFLGB
RAPFLGC  EQU   ISTRAP+110
RAPBFACT EQU   ISTRAP+111
ISTRLC   EQU   0
RLCADR   EQU   ISTRLC+72
RLCFLAG  EQU   RLCADR
RLCLCCUA EQU   ISTRLC+76
ISTRRN   EQU   0
RRNADR   EQU   ISTRRN+136
RRNFLAG  EQU   RRNADR
RRNUCBAD EQU   RRNADR+1
RRNRNCUA EQU   ISTRRN+144
RRNTRENT EQU   ISTRRN+148
RRNRDF   EQU   ISTRRN+172
RRNRDFA  EQU   RRNRDF
RRNRDFB  EQU   RRNRDF+1
RRNCMF   EQU   ISTRRN+176
RRNCMFA  EQU   RRNCMF
RRNCMFB  EQU   RRNCMF+1
RRNCMFC  EQU   RRNCMF+2
RRNCMFD  EQU   RRNCMF+3
RRNNMDPD EQU   ISTRRN+192
RRNHPRE  EQU   ISTRRN+216
ISTRGP   EQU   0
RGPFLG   EQU   ISTRGP+72
ISTRLN   EQU   0
RLNADR   EQU   ISTRLN+72
RLNFLAG  EQU   RLNADR
RLNUCBAD EQU   RLNADR+1
RLNSTAT1 EQU   ISTRLN+86
RLNSTAT2 EQU   ISTRLN+87
RLNRDF   EQU   ISTRLN+88
RLNRDFA  EQU   RLNRDF
RLNRACNT EQU   RLNRDFA
RLNPORT  EQU   RLNRDFA
RLNRDFB  EQU   RLNRDF+1
RLNCRFLG EQU   ISTRLN+102
RLNLSCMD EQU   RLNCRFLG
ISTRPT   EQU   0
RPTLNCID EQU   ISTRPT+116
RPTDITT  EQU   ISTRPT+128
RPTFLAG1 EQU   ISTRPT+140
ISTRCL   EQU   0
RCLADR   EQU   ISTRCL+72
RCLFLAG  EQU   RCLADR
ISTRTR   EQU   0
RTRADR   EQU   ISTRTR+124
RTRFLAG  EQU   RTRADR
RTRRDFA  EQU   ISTRTR+136
RTRRAALL EQU   RTRRDFA
RTRRDFB  EQU   ISTRTR+137
RTRRDFC  EQU   ISTRTR+138
RTRRDFD  EQU   ISTRTR+139
RTRRDFE  EQU   ISTRTR+140
RTRRDFF  EQU   ISTRTR+141
RTRCRFLG EQU   ISTRTR+143
RTRLSCMD EQU   RTRCRFLG
RTRBSCID EQU   ISTRTR+188
ISTRIN   EQU   0
RINDFD   EQU   ISTRIN+124
RINREMPO EQU   RINDFD
RINNODEF EQU   RINDFD
RINLDISC EQU   RINDFD
RINNODID EQU   ISTRIN+125
RINRLDAF EQU   ISTRIN+126
RINREMOT EQU   ISTRIN+128
RINVPAB  EQU   ISTRIN+132
RINRPHCN EQU   ISTRIN+136
RINNCSPL EQU   ISTRIN+140
RINCNCNT EQU   ISTRIN+144
ISTRDS   EQU   0
ISTDOT   EQU   0
ISTRCC   EQU   0
RCCFLAG  EQU   ISTRCC+73
RCCFLAGB EQU   ISTRCC+74
RCCSTAID EQU   ISTRCC+78
RCCID48  EQU   RCCSTAID+2
RCCCRFLG EQU   ISTRCC+108
ISTRLU   EQU   0
RLUFLAG  EQU   ISTRLU+125
RLUCRFLG EQU   ISTRLU+126
RLUPACE  EQU   ISTRLU+132
RLUPACEN EQU   RLUPACE
RLUPACEM EQU   RLUPACE+1
RLUNCPPC EQU   ISTRLU+134
RLUUSSTB EQU   ISTRLU+140
RLUMODET EQU   ISTRLU+152
ISTRPX   EQU   0
ISTRLX   EQU   0
RLXFLAGA EQU   ISTRLX+76
ISTRSW   EQU   0
ISTRDA   EQU   0
RDAADR   EQU   ISTRDA+72
RDAFLAG  EQU   RDAADR
RDAUCBAD EQU   RDAADR+1
RDADACUA EQU   ISTRDA+76
ISTRLS   EQU   0
ISTDNT   EQU   0
ISTGNT   EQU   0
ISTPAT   EQU   0
PATFLAGA EQU   ISTPAT+7
ISTNCB   EQU   0
NCBTYPE  EQU   ISTNCB
NCBLNGTH EQU   ISTNCB+1
NCBDAF   EQU   ISTNCB+2
NCBRDTE  EQU   ISTNCB+4
NCBTSKID EQU   ISTNCB+8
NCBNSNA  EQU   ISTNCB+12
NCBFMCBA EQU   ISTNCB+16
NCBNCBA  EQU   ISTNCB+20
NCBNCSL  EQU   ISTNCB+22
NCBFLAGS EQU   ISTNCB+24
NCBFRAS  EQU   NCBFLAGS+1
NCBFTRIO EQU   NCBFRAS
NCBFLAG1 EQU   NCBFLAGS+2
NCBCONF  EQU   NCBFLAG1
NCBNMLLN EQU   NCBFLAGS+3
NCBFMCBP EQU   ISTNCB+32
NCBDEVCH EQU   ISTNCB+36
NCBSWDAF EQU   ISTNCB+44
ISTDNCB  EQU   0
DNCBHSET EQU   ISTDNCB+48
DNCOS    EQU   ISTDNCB+56
DNCZFLGS EQU   DNCOS
DNCPSOL  EQU   DNCZFLGS+1
DNCBSCED EQU   DNCOS+2
DNCLICP  EQU   DNCBSCED
DNCZV004 EQU   DNCOS+28
DNCZC001 EQU   DNCOS+40
ISTLDNCB EQU   0
LDNCUUA  EQU   ISTLDNCB+48
LDNCFLAG EQU   ISTLDNCB+54
LDNFLAGS EQU   ISTLDNCB+107
LDNFLAG2 EQU   ISTLDNCB+110
LDNZIOLK EQU   ISTLDNCB+184
LDNZERPF EQU   ISTLDNCB+185
LDNZCPAN EQU   LDNZERPF
LDNZEPIN EQU   LDNZERPF
LDNZLPC  EQU   ISTLDNCB+186
LDNDCDEB EQU   ISTLDNCB+304
LDNZSAV3 EQU   ISTLDNCB+376
LDNZSAV4 EQU   LDNZSAV3+8
LDNZH003 EQU   ISTLDNCB+577
ISTFMCB  EQU   0
FMCTYPE  EQU   ISTFMCB
FMCLNGTH EQU   ISTFMCB+1
FMCSAF   EQU   ISTFMCB+2
FMCNXTCB EQU   ISTFMCB+4
FMCTSKID EQU   ISTFMCB+8
FMCDVTA  EQU   ISTFMCB+12
FMCDNCBA EQU   ISTFMCB+16
FMCFMCBA EQU   ISTFMCB+20
FMCUSFLD EQU   ISTFMCB+24
FMCSTAT  EQU   ISTFMCB+28
FMCZF007 EQU   FMCSTAT
FMCSTAT1 EQU   ISTFMCB+29
FMCCMDFL EQU   ISTFMCB+31
FMCDEBA  EQU   ISTFMCB+32
FMCCMPS1 EQU   ISTFMCB+36
FMCBUFLM EQU   FMCCMPS1
FMCPROCD EQU   ISTFMCB+48
FMCMODE  EQU   ISTFMCB+52
FMCPAB1  EQU   ISTFMCB+64
FMCPAB2  EQU   ISTFMCB+80
FMCPAB3  EQU   ISTFMCB+96
FMCPAB4  EQU   ISTFMCB+112
FMCPAB5  EQU   ISTFMCB+128
FMCEXLST EQU   ISTFMCB+144
FMCSIPA  EQU   ISTFMCB+148
FMCNXOSQ EQU   ISTFMCB+152
FMCNXCFM EQU   FMCNXOSQ
FMCNXOSC EQU   FMCNXOSQ+2
FMCSSTAT EQU   ISTFMCB+159
FMCSNBI  EQU   FMCSSTAT
FMCPACE  EQU   ISTFMCB+160
FMCPACEN EQU   FMCPACE
FMCPACEM EQU   FMCPACE+1
FMCPACPC EQU   FMCPACE+2
FMCCVAL  EQU   FMCPACE+3
FMCOBCE  EQU   FMCCVAL
FMCIBCE  EQU   FMCCVAL
FMCCLEXT EQU   ISTFMCB+164
FMCRPLA  EQU   FMCCLEXT
FMCFBA   EQU   FMCCLEXT+4
FMCCMPS2 EQU   FMCCLEXT+16
FMCFLGA  EQU   FMCCMPS2
FMCFLGA1 EQU   FMCFLGA
FMCFLGCL EQU   FMCCMPS2+1
FMCFLGB2 EQU   FMCFLGCL
FMCFLGB3 EQU   FMCFLGCL
FMCPSCMD EQU   FMCCMPS2+2
FMCPSTAT EQU   FMCCMPS2+3
FMCBHSET EQU   ISTFMCB+185
FMCSTAT2 EQU   ISTFMCB+186
FMCMODEB EQU   ISTFMCB+189
FMCCLSEQ EQU   ISTFMCB+190
FMCRRESP EQU   ISTFMCB+195
FMCRSPLM EQU   ISTFMCB+198
FMCSSEGQ EQU   ISTFMCB+200
FMCRDTPT EQU   ISTFMCB+208
FMCFBAS  EQU   ISTFMCB+216
FMCZV002 EQU   FMCFBAS
FMCSNCTL EQU   ISTFMCB+224
FMCSCFLG EQU   FMCSNCTL
FMCVS1   EQU   ISTFMCB+232
FMCZFLAG EQU   FMCVS1
FMCZF001 EQU   FMCZFLAG
FMCZF006 EQU   FMCZFLAG
FMCZF00C EQU   FMCZFLAG+1
FMCLBXM  EQU   FMCVS1+12
FMCSHEAQ EQU   FMCLBXM
FMCLCPBQ EQU   FMCVS1+16
FMCLCPAQ EQU   FMCVS1+20
FMCSEQ1  EQU   FMCVS1+34
FMCZFLG2 EQU   FMCVS1+35
FMCCVFLG EQU   FMCVS1+44
FMCFLAG  EQU   0
FMCFLGB  EQU   FMCFLAG
ISTHCNCB EQU   0
ISTICNCB EQU   0
ICNCUUA  EQU   ISTICNCB+48
@NM00069 EQU   ISTICNCB+53
ICNLCLUS EQU   @NM00069
ICNCKFLD EQU   ISTICNCB+96
ICNFLAG  EQU   ISTICNCB+100
ICNZF006 EQU   ICNFLAG
ICNSTART EQU   ICNFLAG
ICNFFLAG EQU   ISTICNCB+101
ICNZSWS  EQU   ISTICNCB+102
ICNFLAG2 EQU   ISTICNCB+236
ICNZD001 EQU   ISTICNCB+288
ICNWSCCW EQU   ICNZD001
ICNZD002 EQU   ISTICNCB+296
ICNZD003 EQU   ISTICNCB+320
ICNRSCCW EQU   ICNZD003
ICNZD004 EQU   ISTICNCB+328
ICNZS1VR EQU   ISTICNCB+348
ICNSRV02 EQU   ICNZS1VR
ICNDIEWA EQU   ICNSRV02
ICNDCDEB EQU   ISTICNCB+480
ICNDIDEB EQU   ICNDCDEB+12
ICNZFLAG EQU   ISTICNCB+508
ICNZH002 EQU   ISTICNCB+509
ICNZS002 EQU   ICNZH002
ICNZS003 EQU   ICNZH002
ICNZS004 EQU   ICNZH002
ICNZS006 EQU   ICNZH002
ICNZS007 EQU   ICNZH002
ICNZS008 EQU   ICNZH002
ICNZS009 EQU   ICNZH002+1
ICNZS00A EQU   ICNZH002+1
ICNZCONS EQU   ISTICNCB+680
ISTLUNCB EQU   0
LUNZOS   EQU   ISTLUNCB+48
LUNZC001 EQU   LUNZOS+8
ISTCCNCB EQU   0
CCNFLGA  EQU   ISTCCNCB+48
CCNSTART EQU   CCNFLGA
ISTDYPAB EQU   0
ISTATCVT EQU   0
ATCCOM   EQU   ISTATCVT
ATCSTAT  EQU   ATCCOM
ATCSTAT1 EQU   ATCSTAT
ATCSTFLG EQU   ATCSTAT+1
ATCPOFLG EQU   ATCSTAT+2
ATCSTAT4 EQU   ATCSTAT+3
ATCBPDA  EQU   ATCCOM+128
ATCIOTRC EQU   ATCCOM+140
ATCTHTRC EQU   ATCIOTRC
ATCGTSTR EQU   ATCCOM+164
ATCSMRQ  EQU   ATCCOM+180
ATCSMRS  EQU   ATCCOM+188
ATCVTMID EQU   ATCCOM+240
ATCCIDM  EQU   ATCCOM+266
ATCCDADD EQU   ISTATCVT+276
ATCCDDEL EQU   ISTATCVT+280
ATCCDFND EQU   ISTATCVT+284
ATCESC02 EQU   ISTATCVT+292
ATCCSMR  EQU   ISTATCVT+296
ATCSHRFG EQU   ISTATCVT+316
ATCZDVTB EQU   ISTATCVT+364
ATCHPGM  EQU   ISTATCVT+384
ATCAP33  EQU   ISTATCVT+444
ATCAP36  EQU   ISTATCVT+452
ATCCDFIN EQU   ISTATCVT+460
ATCCDFDN EQU   ISTATCVT+464
ATCVLCNT EQU   ISTATCVT+772
ATCRNO   EQU   ISTATCVT+788
ATCSOPD  EQU   ISTATCVT+792
ATCSIPD  EQU   ISTATCVT+800
ATCSECST EQU   ISTATCVT+812
ATCSTAT2 EQU   ISTATCVT+818
ATCVTBAM EQU   ISTATCVT+908
@NM00085 EQU   ATCVTBAM+3
ATCAOSM  EQU   ISTATCVT+912
ATCGSRBQ EQU   ATCAOSM+4
ATCGSRBG EQU   ATCGSRBQ
ATCZDVT6 EQU   ATCAOSM+92
ATCICAPP EQU   ATCAOSM+100
ATCLDAPP EQU   ATCAOSM+120
ATCCDTID EQU   ATCLDAPP
ATCDAPVT EQU   ATCAOSM+140
ATCZDVTA EQU   ATCAOSM+176
ATCCRA   EQU   ATCAOSM+280
ATCCRACN EQU   ATCCRA+4
ATCSRB   EQU   ATCAOSM+288
ATCSRBCN EQU   ATCSRB+4
ATCCRPL  EQU   ATCAOSM+296
ATCRPLCN EQU   ATCCRPL+4
ATCSQAFR EQU   ATCAOSM+304
ATCORTBC EQU   ATCSQAFR+4
ATCORSRB EQU   ATCORTBC
@NM00087 EQU   ATCAOSM+332
ATCVTFLG EQU   ATCAOSM+392
ATCZFLAG EQU   ATCAOSM+588
CDVTPTR  EQU   0
ISTLCCW  EQU   0
LCCWOP   EQU   ISTLCCW
LCCWRWOP EQU   LCCWOP
LCCWCTL  EQU   LCCWRWOP
LCCWFLAG EQU   ISTLCCW+1
LCCWLSI  EQU   LCCWFLAG
ISTLCPB  EQU   0
LCPREQTG EQU   ISTLCPB+2
LCPFLAGS EQU   LCPREQTG
LCPZF001 EQU   LCPFLAGS
LCPZRT02 EQU   LCPZF001
LCPZF002 EQU   LCPFLAGS
LCPZRT03 EQU   LCPZF002
LCPZF003 EQU   LCPFLAGS
LCPZRT04 EQU   LCPZF003
LCPZF004 EQU   LCPFLAGS
LCPZRT05 EQU   LCPZF004
LCPZRT06 EQU   LCPFLAGS
LCPZRT07 EQU   LCPFLAGS
LCPMNRCD EQU   LCPREQTG+1
LCPZRT08 EQU   LCPMNRCD
LCPZRT09 EQU   LCPMNRCD
LCPCHAIN EQU   ISTLCPB+4
LCPCHAI1 EQU   LCPCHAIN
LCPRUCNT EQU   ISTLCPB+8
LCPFLAG2 EQU   ISTLCPB+9
LCPTLBPI EQU   LCPFLAG2
LCPFID0  EQU   LCPFLAG2
LCPSEQ   EQU   ISTLCPB+10
LCPCID   EQU   ISTLCPB+16
LCPFDBA  EQU   ISTLCPB+24
LCPFLG1  EQU   ISTLCPB+37
LCPFLCCW EQU   ISTLCPB+40
LCPLCCW  EQU   ISTLCPB+48
LCPPABA  EQU   LCPLCCW+4
LCPRPHA  EQU   LCPPABA
ISTZSAVE EQU   0
ZSAZSVBC EQU   ISTZSAVE
ZSAZSVMS EQU   ZSAZSVBC
ISTPFCRR EQU   0
PFCCRR   EQU   ISTPFCRR
PFCCRRID EQU   PFCCRR
PFCCRRLN EQU   PFCCRR+2
PFCHDR   EQU   ISTPFCRR+4
PFCCRRO  EQU   PFCHDR
PFCFRRO  EQU   PFCHDR+4
ISTCFCRR EQU   0
CFCAUDIT EQU   ISTCFCRR
CFCNTRD  EQU   CFCAUDIT
CFCCRT   EQU   CFCAUDIT+1
ISTZCRR  EQU   0
ZCRCRR   EQU   ISTZCRR
ZCRFLGS1 EQU   ISTZCRR+12
ZCRFLGS2 EQU   ISTZCRR+13
ZCRSWFLD EQU   ISTZCRR+14
ZCRENDSH EQU   ZCRSWFLD
ZCRNDLCP EQU   ZCRSWFLD
ZCRRESET EQU   ZCRSWFLD
ZCRFLGS3 EQU   ISTZCRR+15
ZCRGENSW EQU   ISTZCRR+16
ZCRPFLGS EQU   ISTZCRR+17
ZCRIBPR  EQU   ISTZCRR+18
ZCRSCPSW EQU   ISTZCRR+19
ZCRPARMS EQU   ISTZCRR+24
ZCRFBPTR EQU   ZCRPARMS
ZCRDFRDA EQU   ZCRPARMS+10
ZCRPCOD1 EQU   ZCRPARMS+12
ZCRPLSBF EQU   ZCRPCOD1
ZCRPCOD2 EQU   ZCRPARMS+13
ZCRSVRTN EQU   ISTZCRR+56
ZCRWKARA EQU   ISTZCRR+156
ZCRCIDSV EQU   ISTZCRR+192
ZCRAUDIT EQU   ISTZCRR+440
ZCRENTER EQU   ZCRAUDIT+5
ZCRLCPB  EQU   ISTZCRR+480
ZCRRHRU  EQU   ZCRLCPB
ISTASCRR EQU   0
ASCFLAGS EQU   ISTASCRR+16
ASCFLG1  EQU   ASCFLAGS
ASCFLG2  EQU   ASCFLAGS+2
ASCFLG3  EQU   ASCFLAGS+4
ASCUSRGS EQU   ISTASCRR+28
ISTAPCRR EQU   0
APCATFLG EQU   ISTAPCRR+16
APCRFLG  EQU   ISTAPCRR+18
APCSAVE  EQU   ISTAPCRR+44
APCCOMF  EQU   ISTAPCRR+116
APCCOMF1 EQU   APCCOMF
APC31FLG EQU   ISTAPCRR+132
APC52FLG EQU   ISTAPCRR+133
APC53FLG EQU   ISTAPCRR+134
APC54FLG EQU   ISTAPCRR+135
APC57FLG EQU   ISTAPCRR+136
ISTCRA   EQU   0
CRABASIC EQU   ISTCRA
CRAHDR   EQU   CRABASIC
CRACRR   EQU   CRAHDR
CRALKACT EQU   CRABASIC+8
CRAL5PTR EQU   CRABASIC+28
CRASVC   EQU   ISTCRA+848
CRABUFA  EQU   CRASVC+68
ISTCNSTA EQU   0
CNSTFLDA EQU   ISTCNSTA+16
CNSTFLDB EQU   ISTCNSTA+19
ISTOCCRR EQU   0
OCCAUDIT EQU   ISTOCCRR+22
OCCNTRD  EQU   OCCAUDIT
NOCCFB   EQU   OCCNTRD+1
OCCCRT   EQU   OCCAUDIT+3
COCCFB   EQU   OCCCRT+1
FMZL0020 EQU   0
FMZL0039 EQU   0
FMZL0058 EQU   0
ISTSDCCF EQU   0
FMZL0081 EQU   0
FMZL0159 EQU   0
FMZL0178 EQU   0
ISTSDCCR EQU   0
FMZL0203 EQU   0
FMZL0208 EQU   0
ISTSDCCN EQU   0
ISTSDCCA EQU   0
FMZL0254 EQU   0
FMZL0289 EQU   0
FMZL0307 EQU   0
FMZL0326 EQU   0
FMZL0344 EQU   0
FMZL0363 EQU   0
ISTRPL   EQU   0
ISTSDCCD EQU   0
CVTS01   EQU   CVTPGSIA
CVTLPDIA EQU   CVTS01+12
CVTDIRST EQU   CVTLPDIA
CVTSLIDA EQU   CVTS01+24
CVTCTLFG EQU   CVTS01+50
CVTRV210 EQU   CVTS01+424
CVTRV219 EQU   CVTS01+425
CVTRV228 EQU   CVTS01+426
CVTRV237 EQU   CVTS01+427
CVTMFRTR EQU   CVTS01+452
CVTRV262 EQU   CVTS01+468
CVTRV271 EQU   CVTS01+469
CVTRV280 EQU   CVTS01+470
CVTRV289 EQU   CVTS01+471
CVTGSDA  EQU   CVTS01+600
IOBORG01 EQU   IOBPREFX+8
IOBNIOBA EQU   IOBORG01
IOBNFLG1 EQU   IOBNIOBA
IOBPRTOV EQU   IOBNFLG1
IOBORG02 EQU   IOBPREFX+8
IOBDQADA EQU   IOBORG02
IOBDEQIN EQU   IOBDQADA
IOBORG03 EQU   IOBPREFX+12
IOBORG04 EQU   IOBINCAM
IOBORG12 EQU   IOBINCAM
IOBFL4   EQU   IOBORG12
IOBEXTEN EQU   IOBSTDRD+32
IOBSEEK  EQU   IOBEXTEN
IOBBB    EQU   IOBSEEK+1
IOBCC    EQU   IOBSEEK+3
IOBHH    EQU   IOBSEEK+5
IOBORG05 EQU   IOBEXTEN
IOBORG06 EQU   IOBEXTEN
IOBNXTPT EQU   IOBORG06+4
IOBSTATA EQU   IOBNXTPT
IOBORG07 EQU   IOBEXTEN+8
W1IEXTEN EQU   IOBORG07
IOBORG08 EQU   IOBEXTEN+8
IOBINDCT EQU   IOBORG08+4
IOBUNSQR EQU   IOBORG08+5
IOBFCHAD EQU   IOBORG08+8
IOBORG09 EQU   IOBEXTEN+8
IOBDPLAD EQU   IOBORG09+4
IOBDTYPE EQU   IOBORG09+8
IOBDTYP2 EQU   IOBORG09+9
IOBDSTAT EQU   IOBORG09+10
IOBSTAT1 EQU   IOBDSTAT
IOBORG10 EQU   IOBEXTEN+8
IOBSEEK2 EQU   IOBORG10
IOBORG11 EQU   IOBEXTEN
IOBERCT  EQU   IOBORG11
IOBUCBXV EQU   IOBERCT
IOBNAME  EQU   IOBORG11+4
IOBORG13 EQU   IOBEXTEN
IOBSKADR EQU   IOBORG13
IOSATTSC EQU   IOSIPIB
IOSWTOWA EQU   IOSIPIB
IOSPCISC EQU   IOSIPIB
BINLUP1  EQU   BINPSCHR
BINLUS   EQU   BINPSCHR
BINFMF1  EQU   BINLUS
BINRSV09 EQU   BINFMF1
BINDSPF1 EQU   BINLUS+2
BINMEDIA EQU   BINLUS+4
BINLUP2  EQU   BINPSCHR
BINLUP3  EQU   BINPSCHR
CFBWORKA EQU   OCWSCPAD
CBSIZE   EQU   CFBWORKA
CLOOPSW  EQU   CFBWORKA+2
RRNWORKA EQU   CFBWORKA+4
SBNDRDTE EQU   RRNWORKA
SUBNDCNT EQU   RRNWORKA+4
@NM00093 EQU   RRNWORKA+8
RRNCTLSW EQU   @NM00093
CFBFLAGS EQU   CFBWORKA+27
CFMCORE  EQU   CFBFLAGS
CNCBCORE EQU   CFBFLAGS
LCPZTIE  EQU   LCPCID
LCPZSNAM EQU   LCPZTIE+8
CMZCIDM  EQU   ATCCIDM
RTRDNCBA EQU   ISTRTR+40
SRB      EQU   SRBSECT
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS
LCPZTRV4 EQU   LCPZSNAM+4
LCPZTRV1 EQU   LCPZSNAM
LCPZSNA  EQU   LCPZTIE+4
LCPZFMCA EQU   LCPZTIE
@NM00094 EQU   CFBWORKA+13
@NM00092 EQU   RRNWORKA+6
@NM00091 EQU   CFBWORKA+3
BINRSV26 EQU   BINLUP3
BINRSV15 EQU   BINLUP2+10
BINPRESZ EQU   BINLUP2+9
BINRSV14 EQU   BINLUP2
BINRSV13 EQU   BINMEDIA
BINDISK  EQU   BINMEDIA
BINXCHNG EQU   BINMEDIA
BINCARD  EQU   BINMEDIA
BINDOCMT EQU   BINMEDIA
BINRSV17 EQU   BINDSPF1+1
BINTRNDS EQU   BINDSPF1
BINRSV12 EQU   BINDSPF1
BINVSDS  EQU   BINDSPF1
BINVTDS  EQU   BINDSPF1
BINHFDS  EQU   BINDSPF1
BININTR  EQU   BINDSPF1
BINRSV11 EQU   BINRSV09+1
BINXFPD  EQU   BINRSV09+1
BINCSDS  EQU   BINRSV09+1
BINQDSI  EQU   BINRSV09+1
BINRSV16 EQU   BINRSV09+1
BINARRR  EQU   BINRSV09
BINSIDS  EQU   BINRSV09
BINSAI   EQU   BINRSV09
BINSDSI  EQU   BINRSV09
BINKDDSI EQU   BINRSV09
BINPDIR  EQU   BINFMF1
BINCMPCT EQU   BINFMF1
BINDESTS EQU   BINFMF1
BINSLUS1 EQU   BINLUP1+6
BINPLUS1 EQU   BINLUP1+1
BINDSP1  EQU   BINLUP1
BINFMHS1 EQU   BINLUP1
IOSPCIWA EQU   IOSPCISC+44
IOSPCIRS EQU   IOSPCISC+8
@NM00009 EQU   IOSPCISC+4
@NM00008 EQU   IOSPCISC
IOSWRNDR EQU   IOSWTOWA+4
IOSWTOPT EQU   IOSWTOWA+3
IOSWTOCP EQU   IOSWTOWA+2
IOSWTOCH EQU   IOSWTOWA
IOSATTWA EQU   IOSATTSC+40
@NM00007 EQU   IOSATTSC+24
IOSATTSN EQU   IOSATTSC
IOBSKSS  EQU   IOBSKADR+3
IOBSK0   EQU   IOBSKADR+2
IOBSKTT  EQU   IOBSKADR+1
IOBSKRV  EQU   IOBSKADR
IOBCSWSV EQU   IOBORG11+17
IOBSENSV EQU   IOBORG11+16
IOBRCD   EQU   IOBORG11+12
IOBMDREC EQU   IOBORG11+8
IOBNAMEA EQU   IOBNAME+1
IOBNAMSZ EQU   IOBNAME
IOBERCTA EQU   IOBERCT+1
IOBRTYPE EQU   IOBUCBXV
IOBRDCHP EQU   IOBORG10+20
IOBNEXTA EQU   IOBORG10+16
IOBREADA EQU   IOBORG10+12
IOBBUFC  EQU   IOBORG10+8
IOBSK2R  EQU   IOBSEEK2+7
IOBSK2HH EQU   IOBSEEK2+5
IOBSK2CC EQU   IOBSEEK2+3
IOBSK2BB EQU   IOBSEEK2+1
IOBSK2M  EQU   IOBSEEK2
IOBCHNPR EQU   IOBORG09+40
IOBDNCRF EQU   IOBORG09+32
IOBRSV35 EQU   IOBORG09+24
IOBDQPTR EQU   IOBORG09+20
IOBRSV34 EQU   IOBORG09+18
IOBDBYTN EQU   IOBORG09+16
IOBDCPND EQU   IOBORG09+12
IOBSTAT2 EQU   IOBDSTAT+1
IOBSIORT EQU   IOBSTAT1
IOBADDVU EQU   IOBSTAT1
IOBBUFF  EQU   IOBSTAT1
IOBENQUE EQU   IOBSTAT1
IOBPASS2 EQU   IOBSTAT1
IOBSYNCH EQU   IOBSTAT1
IOBNEWVL EQU   IOBSTAT1
IOBABNRM EQU   IOBSTAT1
IOBRELEX EQU   IOBDTYP2
IOBADDTY EQU   IOBDTYP2
IOBTYPE  EQU   IOBDTYP2
IOBRQUST EQU   IOBDTYP2
IOBSUFFX EQU   IOBDTYP2
IOBSBLKL EQU   IOBDTYP2
IOBSKEY  EQU   IOBDTYP2
IOBRELBL EQU   IOBDTYPE
IOBRDEXC EQU   IOBDTYPE
IOBDYNBF EQU   IOBDTYPE
IOBACTAD EQU   IOBDTYPE
IOBFDBCK EQU   IOBDTYPE
IOBEXTSC EQU   IOBDTYPE
IOBOVFLO EQU   IOBDTYPE
IOBVERFY EQU   IOBDTYPE
IOBDPLB  EQU   IOBDPLAD+1
IOBDAYLI EQU   IOBDPLAD
IOBDIOBS EQU   IOBORG09+2
IOBDBYTR EQU   IOBORG09
IOBBCHAD EQU   IOBORG08+12
IOBFCHNB EQU   IOBFCHAD+1
IOBCOUNT EQU   IOBFCHAD
IOBASYN  EQU   IOBORG08+7
IOBAPP   EQU   IOBORG08+6
IOBRSV32 EQU   IOBUNSQR
IOBRSV31 EQU   IOBUNSQR
IOBRSV30 EQU   IOBUNSQR
IOBKNRWR EQU   IOBUNSQR
IOBKNWR  EQU   IOBUNSQR
IOBNTAV2 EQU   IOBUNSQR
IOBNTAV1 EQU   IOBUNSQR
IOBCPBSY EQU   IOBUNSQR
IOBCHNNL EQU   IOBINDCT
IOBRSV29 EQU   IOBINDCT
IOBRSV28 EQU   IOBINDCT
IOBRSV27 EQU   IOBINDCT
IOBKEYAD EQU   IOBINDCT
IOBOVPTR EQU   IOBINDCT
IOBUNSCH EQU   IOBINDCT
IOBDEQCP EQU   IOBINDCT
IOBCCWAD EQU   IOBORG08
W1OEXTEN EQU   W1IEXTEN
IOBCCW   EQU   IOBORG06+8
IOBNXTPB EQU   IOBNXTPT+1
IOBRSV26 EQU   IOBSTATA
IOBRSV25 EQU   IOBSTATA
IOBRSV24 EQU   IOBSTATA
IOBRSV23 EQU   IOBSTATA
IOBRSV22 EQU   IOBSTATA
IOBRSV21 EQU   IOBSTATA
IOBRSV20 EQU   IOBSTATA
IOBAVLFL EQU   IOBSTATA
IOBRSV37 EQU   IOBORG06+1
IOBUCBXG EQU   IOBORG06
IOBCPA   EQU   IOBORG05+32
IOBERINF EQU   IOBORG05+16
IOBERCCW EQU   IOBORG05+8
IOBSNDPT EQU   IOBORG05+7
IOBRCVPT EQU   IOBORG05+6
IOBWORK  EQU   IOBORG05+1
IOBUCBX  EQU   IOBORG05
IOBR     EQU   IOBSEEK+7
IOBHH2   EQU   IOBHH+1
IOBHH1   EQU   IOBHH
IOBCC2   EQU   IOBCC+1
IOBCC1   EQU   IOBCC
IOBBB2   EQU   IOBBB+1
IOBBB1   EQU   IOBBB
IOBM     EQU   IOBSEEK
IOBRSV46 EQU   IOBFL4
IOBRSV47 EQU   IOBFL4
IOBENT   EQU   IOBFL4
IOBEQP   EQU   IOBFL4
IOBBUS   EQU   IOBFL4
IOBDCK   EQU   IOBFL4
IOBREJ   EQU   IOBFL4
IOBOVR   EQU   IOBFL4
IOBCRILC EQU   IOBORG04+1
IOBCRDCC EQU   IOBORG04
IOBGQECB EQU   IOBORG03
IOBSWAP  EQU   IOBORG02+4
IOBDQADB EQU   IOBDQADA+1
IOBRSV13 EQU   IOBDEQIN
IOBRSV12 EQU   IOBDEQIN
IOBRSV11 EQU   IOBDEQIN
IOBRSV10 EQU   IOBDEQIN
IOBRSV09 EQU   IOBDEQIN
IOBRSV08 EQU   IOBDEQIN
IOBRSV07 EQU   IOBDEQIN
IOBDEQ   EQU   IOBDEQIN
IOBNECB  EQU   IOBORG01+4
IOBNIOBB EQU   IOBNIOBA+1
IOBFIRST EQU   IOBNFLG1
IOBUPERR EQU   IOBNFLG1
IOBSPAN  EQU   IOBNFLG1
IOBBKSPC EQU   IOBNFLG1
IOBUPDAT EQU   IOBNFLG1
IOBREAD  EQU   IOBNFLG1
IOBWRITE EQU   IOBNFLG1
IOBSEGMT EQU   IOBPRTOV
CVTRV628 EQU   CVTS01+728
CVTRV627 EQU   CVTS01+724
CVTRV626 EQU   CVTS01+720
CVTRV625 EQU   CVTS01+716
CVTRV624 EQU   CVTS01+712
CVTRV623 EQU   CVTS01+708
CVTRV622 EQU   CVTS01+704
CVTRV621 EQU   CVTS01+700
CVTRV620 EQU   CVTS01+696
CVTRV619 EQU   CVTS01+692
CVTRV618 EQU   CVTS01+688
CVTRV617 EQU   CVTS01+684
CVTRV616 EQU   CVTS01+680
CVTRV615 EQU   CVTS01+676
CVTRV614 EQU   CVTS01+672
CVTRV613 EQU   CVTS01+668
CVTTCASP EQU   CVTS01+664
CVT0PT03 EQU   CVTS01+660
CVT0PT0E EQU   CVTS01+656
CVTIRM   EQU   CVTS01+652
CVTCGK   EQU   CVTS01+648
CVTRV607 EQU   CVTS01+644
CVTRV606 EQU   CVTS01+640
CVTRV605 EQU   CVTS01+636
CVTRV604 EQU   CVTS01+632
CVTEFF02 EQU   CVTS01+628
CVTCBBR  EQU   CVTS01+624
CVTSSCR  EQU   CVTS01+620
CVTEVENT EQU   CVTS01+616
CVTCRCA  EQU   CVTS01+612
CVTTPIO  EQU   CVTS01+608
CVTADV   EQU   CVTS01+604
CVTGSDAB EQU   CVTGSDA
CVTQV3   EQU   CVTS01+596
CVTQV2   EQU   CVTS01+592
CVTQV1   EQU   CVTS01+588
CVTRPT   EQU   CVTS01+584
CVTSSRB  EQU   CVTS01+580
CVTCSDRL EQU   CVTS01+576
CVTEXP1  EQU   CVTS01+572
CVTRMPMT EQU   CVTS01+568
CVTRMPTT EQU   CVTS01+564
CVTVPSA  EQU   CVTS01+560
CVTVSTOP EQU   CVTS01+556
CVTGTFR8 EQU   CVTS01+552
CVTQUIT  EQU   CVTS01+548
CVTVACR  EQU   CVTS01+544
CVTWTCB  EQU   CVTS01+540
CVTSTPRS EQU   CVTS01+536
CVT0PT02 EQU   CVTS01+532
CVTDARCM EQU   CVTS01+528
CVTIRECM EQU   CVTS01+524
CVTJRECM EQU   CVTS01+520
CVTVEMS0 EQU   CVTS01+516
CVTSPFRR EQU   CVTS01+512
CVTRLSTG EQU   CVTS01+508
CVT0TC0A EQU   CVTS01+504
CVTGMBR  EQU   CVTS01+500
CVTLFRM  EQU   CVTS01+496
CVTRMBR  EQU   CVTS01+492
CVTVIOP  EQU   CVTS01+488
CVTRV307 EQU   CVTS01+486
CVTRV306 EQU   CVTS01+484
CVTRV305 EQU   CVTS01+482
CVTRV304 EQU   CVTS01+480
CVTRV303 EQU   CVTS01+478
CVTRV302 EQU   CVTS01+476
CVTTRCA  EQU   CVTS01+472
CVTRV297 EQU   CVTRV289
CVTRV296 EQU   CVTRV289
CVTRV295 EQU   CVTRV289
CVTRV294 EQU   CVTRV289
CVTRV293 EQU   CVTRV289
CVTRV292 EQU   CVTRV289
CVTRV291 EQU   CVTRV289
CVTRV290 EQU   CVTRV289
CVTRV288 EQU   CVTRV280
CVTRV287 EQU   CVTRV280
CVTRV286 EQU   CVTRV280
CVTRV285 EQU   CVTRV280
CVTRV284 EQU   CVTRV280
CVTRV283 EQU   CVTRV280
CVTRV282 EQU   CVTRV280
CVTRV281 EQU   CVTRV280
CVTRV279 EQU   CVTRV271
CVTRV278 EQU   CVTRV271
CVTRV277 EQU   CVTRV271
CVTRV276 EQU   CVTRV271
CVTRV275 EQU   CVTRV271
CVTRV274 EQU   CVTRV271
CVTRV273 EQU   CVTRV271
CVTRV272 EQU   CVTRV271
CVTRV270 EQU   CVTRV262
CVTRV269 EQU   CVTRV262
CVTRV268 EQU   CVTRV262
CVTRV267 EQU   CVTRV262
CVTRV266 EQU   CVTRV262
CVTRV265 EQU   CVTRV262
CVTRV264 EQU   CVTRV262
CVTRV263 EQU   CVTRV262
CVTVFP   EQU   CVTS01+464
CVTVSI   EQU   CVTS01+460
CVTVPSIB EQU   CVTS01+456
CVTMFACT EQU   CVTMFRTR
CVTMFCTL EQU   CVTS01+448
CVTPVBP  EQU   CVTS01+444
CVTPWI   EQU   CVTS01+440
CVTRV254 EQU   CVTS01+438
CVTRV253 EQU   CVTS01+436
CVTRV252 EQU   CVTS01+434
CVTRV251 EQU   CVTS01+433
CVTRV250 EQU   CVTS01+432
CVTRV249 EQU   CVTS01+431
CVTRV248 EQU   CVTS01+430
CVTRV247 EQU   CVTS01+429
CVTRV246 EQU   CVTS01+428
CVTRV245 EQU   CVTRV237
CVTRV244 EQU   CVTRV237
CVTRV243 EQU   CVTRV237
CVTRV242 EQU   CVTRV237
CVTRV241 EQU   CVTRV237
CVTRV240 EQU   CVTRV237
CVTRV239 EQU   CVTRV237
CVTRV238 EQU   CVTRV237
CVTRV236 EQU   CVTRV228
CVTRV235 EQU   CVTRV228
CVTRV234 EQU   CVTRV228
CVTRV233 EQU   CVTRV228
CVTRV232 EQU   CVTRV228
CVTRV231 EQU   CVTRV228
CVTRV230 EQU   CVTRV228
CVTRV229 EQU   CVTRV228
CVTRV227 EQU   CVTRV219
CVTRV226 EQU   CVTRV219
CVTRV225 EQU   CVTRV219
CVTRV224 EQU   CVTRV219
CVTRV223 EQU   CVTRV219
CVTRV222 EQU   CVTRV219
CVTRV221 EQU   CVTRV219
CVTRV220 EQU   CVTRV219
CVTRV218 EQU   CVTRV210
CVTRV217 EQU   CVTRV210
CVTRV216 EQU   CVTRV210
CVTRV215 EQU   CVTRV210
CVTRV214 EQU   CVTRV210
CVTRV213 EQU   CVTRV210
CVTRV212 EQU   CVTRV210
CVTRV211 EQU   CVTRV210
CVTLCCAT EQU   CVTS01+420
CVTPCCAT EQU   CVTS01+416
CVTIPCRP EQU   CVTS01+412
CVTIPCRI EQU   CVTS01+408
CVTIPCDS EQU   CVTS01+404
CVTAIDVT EQU   CVTS01+400
CVTSSAP  EQU   CVTS01+396
CVTEHCIR EQU   CVTS01+392
CVTEHDEF EQU   CVTS01+388
CVTDAIR  EQU   CVTS01+384
CVTPERFM EQU   CVTS01+380
CVT044R2 EQU   CVTS01+376
CVTFETCH EQU   CVTS01+372
CVTRSTWD EQU   CVTS01+368
CVTSPOST EQU   CVTS01+364
CVTIOBP  EQU   CVTS01+360
CVTASMVT EQU   CVTS01+356
CVTRECRQ EQU   CVTS01+352
CVTWSAC  EQU   CVTS01+348
CVTRV149 EQU   CVTS01+344
CVTWSAL  EQU   CVTS01+340
CVTSPSA  EQU   CVTS01+336
CVTGLMN  EQU   CVTS01+332
CVTVEAC0 EQU   CVTS01+328
CVT062R1 EQU   CVTS01+324
CVTRPOST EQU   CVTS01+320
CVTDQIQE EQU   CVTS01+316
CVTCSD   EQU   CVTS01+312
CVTLKRMA EQU   CVTS01+308
CVTRSPIE EQU   CVTS01+304
CVTRENQ  EQU   CVTS01+300
CVTLQCB  EQU   CVTS01+296
CVTFQCB  EQU   CVTS01+292
CVTQCS01 EQU   CVTS01+288
CVTAPFT  EQU   CVTS01+284
CVTPARRL EQU   CVTS01+280
CVTVWAIT EQU   CVTS01+276
CVTGSPL  EQU   CVTS01+272
CVTLSMQ  EQU   CVTS01+268
CVTGSMQ  EQU   CVTS01+264
CVTEXPRO EQU   CVTS01+260
CVTOPCTP EQU   CVTS01+256
CVTSIC   EQU   CVTS01+252
CVTTPIOS EQU   CVTS01+248
CVTRTMS  EQU   CVTS01+244
CVTSDBF  EQU   CVTS01+240
CVTSCBP  EQU   CVTS01+236
CVTSDMP  EQU   CVTS01+232
CVTSV60  EQU   CVTS01+228
CVTRTMCT EQU   CVTS01+224
CVTASCBL EQU   CVTS01+220
CVTASCBH EQU   CVTS01+216
CVTGDA   EQU   CVTS01+212
CVTASVT  EQU   CVTS01+208
CVTVVMDI EQU   CVTS01+204
CVTAQTOP EQU   CVTS01+200
CVTIOSCS EQU   CVTS01+196
CVTSDRM  EQU   CVTS01+192
CVTOPTE  EQU   CVTS01+188
CVTSTXU  EQU   CVTS01+184
CVTQUIS  EQU   CVTS01+180
CVTPARS  EQU   CVTS01+176
CVTS1EE  EQU   CVTS01+172
CVTFRAS  EQU   CVTS01+168
CVTQSAS  EQU   CVTS01+164
CVTCRAS  EQU   CVTS01+160
CVTCRMN  EQU   CVTS01+156
CVTDELCP EQU   CVTS01+152
CVTFRECL EQU   CVTS01+148
CVTGETCL EQU   CVTS01+144
CVTBLDCP EQU   CVTS01+140
CVTAUTHL EQU   CVTS01+136
CVTSCAN  EQU   CVTS01+132
CVTRV144 EQU   CVTS01+130
CVTMAXMP EQU   CVTS01+128
CVTSTCK  EQU   CVTS01+124
CVTRV139 EQU   CVTS01+123
CVTDSSAC EQU   CVTS01+122
CVTRV513 EQU   CVTS01+121
CVTIOSPL EQU   CVTS01+120
CVTPTGT  EQU   CVTS01+116
CVTCSPIE EQU   CVTS01+112
CVTSMFEX EQU   CVTS01+108
CVTOLT0A EQU   CVTS01+104
CVTSRBRT EQU   CVTS01+100
CVTPUTL  EQU   CVTS01+96
CVTASCRL EQU   CVTS01+92
CVTASCRF EQU   CVTS01+88
CVTRV326 EQU   CVTS01+84
CVTRV325 EQU   CVTS01+80
CVTRV324 EQU   CVTS01+76
CVT0VL01 EQU   CVTS01+72
CVTSHRVM EQU   CVTS01+68
CVTRV332 EQU   CVTS01+64
CVTTAS   EQU   CVTS01+60
CVTRSCN  EQU   CVTS01+56
CVTTRAC2 EQU   CVTS01+54
CVTTRACE EQU   CVTS01+52
CVTAPG   EQU   CVTS01+51
CVTSDTRC EQU   CVTCTLFG
CVTGTRCE EQU   CVTCTLFG
CVTNOMP  EQU   CVTCTLFG
CVTRSV79 EQU   CVTCTLFG
CVTDSTAT EQU   CVTCTLFG
CVTRSV78 EQU   CVTCTLFG
CVTRV333 EQU   CVTCTLFG
CVTRV323 EQU   CVTCTLFG
CVTSPVLK EQU   CVTS01+49
CVTRSV77 EQU   CVTS01+48
CVTRV331 EQU   CVTS01+44
CVTRV330 EQU   CVTS01+40
CVTRV329 EQU   CVTS01+36
CVTRV328 EQU   CVTS01+32
CVTRV322 EQU   CVTS01+28
CVTSLID  EQU   CVTSLIDA+1
CVTSYLK  EQU   CVTSLIDA
CVTRV321 EQU   CVTS01+20
CVTRV320 EQU   CVTS01+16
CVTLPDIR EQU   CVTLPDIA+1
CVTRSV69 EQU   CVTDIRST
CVTRSV68 EQU   CVTDIRST
CVTRSV67 EQU   CVTDIRST
CVTRSV66 EQU   CVTDIRST
CVTRSV65 EQU   CVTDIRST
CVTRSV64 EQU   CVTDIRST
CVTRSV63 EQU   CVTDIRST
CVTDICOM EQU   CVTDIRST
CVTPVTP  EQU   CVTS01+8
CVTLPDSR EQU   CVTS01+4
CVTGETL  EQU   CVTS01
COCPOI   EQU   OCCCRT+2
COCACX   EQU   OCCCRT+2
COCCCN   EQU   OCCCRT+2
COCCCM   EQU   OCCCRT+2
COCCNV   EQU   OCCCRT+2
COCCCC   EQU   OCCCRT+2
COCCRL   EQU   OCCCRT+2
COCCQU   EQU   OCCCRT+2
COCCRT   EQU   OCCCRT+1
COCCOF   EQU   OCCCRT+1
COCCLD   EQU   OCCCRT+1
COCCOE   EQU   OCCCRT+1
COCCOD   EQU   OCCCRT+1
COCCSD   EQU   OCCCRT+1
COCCRD   EQU   OCCCRT+1
COCCFD   EQU   OCCCRT
COCCMD   EQU   OCCCRT
COCCFR   EQU   OCCCRT
COCCFO   EQU   OCCCRT
COCCSL   EQU   OCCCRT
COCCCH   EQU   OCCCRT
COCCCL   EQU   OCCCRT
COCCOC   EQU   OCCCRT
NOCPOI   EQU   OCCNTRD+2
NOCACX   EQU   OCCNTRD+2
NOCCCN   EQU   OCCNTRD+2
NOCCCM   EQU   OCCNTRD+2
NOCCNV   EQU   OCCNTRD+2
NOCCCC   EQU   OCCNTRD+2
NOCCRL   EQU   OCCNTRD+2
NOCCQU   EQU   OCCNTRD+2
NOCCRT   EQU   OCCNTRD+1
NOCCOF   EQU   OCCNTRD+1
NOCCLD   EQU   OCCNTRD+1
NOCCOE   EQU   OCCNTRD+1
NOCCOD   EQU   OCCNTRD+1
NOCCSD   EQU   OCCNTRD+1
NOCCRD   EQU   OCCNTRD+1
NOCCFD   EQU   OCCNTRD
NOCCMD   EQU   OCCNTRD
NOCCFR   EQU   OCCNTRD
NOCCFO   EQU   OCCNTRD
NOCCSL   EQU   OCCNTRD
NOCCCH   EQU   OCCNTRD
NOCCCL   EQU   OCCNTRD
NOCCOC   EQU   OCCNTRD
OCCCNS   EQU   ISTOCCRR
CNSRSV05 EQU   CNSTFLDB+2
CNSLOG0B EQU   CNSTFLDB+2
CNSACCTB EQU   CNSTFLDB+2
CNSFREEB EQU   CNSTFLDB+2
CNSGETSB EQU   CNSTFLDB+2
CNSSEARB EQU   CNSTFLDB+2
CNSQUEUB EQU   CNSTFLDB+2
CNSACONB EQU   CNSTFLDB+2
CNSTCONB EQU   CNSTFLDB+1
CNSCLAQB EQU   CNSTFLDB+1
CNSCLINB EQU   CNSTFLDB+1
CNSGBINB EQU   CNSTFLDB+1
CNSLGINB EQU   CNSTFLDB+1
CNSACINB EQU   CNSTFLDB+1
CNSPSINB EQU   CNSTFLDB+1
CNSRQRLB EQU   CNSTFLDB+1
CNSTRRLB EQU   CNSTFLDB
CNSDORLB EQU   CNSTFLDB
CNSRLINB EQU   CNSTFLDB
CNSQREQB EQU   CNSTFLDB
CNSXREQB EQU   CNSTFLDB
CNSAQINB EQU   CNSTFLDB
CNSAUTHB EQU   CNSTFLDB
CNSMRINB EQU   CNSTFLDB
CNSRSV01 EQU   CNSTFLDA+2
CNSLOG0A EQU   CNSTFLDA+2
CNSACCTA EQU   CNSTFLDA+2
CNSFREEA EQU   CNSTFLDA+2
CNSGETSA EQU   CNSTFLDA+2
CNSSEARA EQU   CNSTFLDA+2
CNSQUEUA EQU   CNSTFLDA+2
CNSACONA EQU   CNSTFLDA+2
CNSTCONA EQU   CNSTFLDA+1
CNSCLAQA EQU   CNSTFLDA+1
CNSCLINA EQU   CNSTFLDA+1
CNSGBINA EQU   CNSTFLDA+1
CNSLGINA EQU   CNSTFLDA+1
CNSACINA EQU   CNSTFLDA+1
CNSPSINA EQU   CNSTFLDA+1
CNSRQRLA EQU   CNSTFLDA+1
CNSTRRLA EQU   CNSTFLDA
CNSDORLA EQU   CNSTFLDA
CNSRLINA EQU   CNSTFLDA
CNSQREQA EQU   CNSTFLDA
CNSXREQA EQU   CNSTFLDA
CNSAQINA EQU   CNSTFLDA
CNSAUTHA EQU   CNSTFLDA
CNSMRINA EQU   CNSTFLDA
CNSTPFX  EQU   ISTCNSTA
CRACHAIN EQU   ISTCRA+928
CRARSV02 EQU   ISTCRA+924
CRARSV01 EQU   ISTCRA+920
CRABFTBA EQU   CRABUFA
CRAMASK  EQU   CRASVC+64
CRAHSIZ  EQU   CRASVC+60
CRAASCRR EQU   CRASVC
CRAPROCR EQU   ISTCRA+312
CRAPSS   EQU   ISTCRA+160
CRARPH   EQU   ISTCRA+52
CRALAPTR EQU   CRABASIC+48
CRAL9PTR EQU   CRABASIC+44
CRAL8PTR EQU   CRABASIC+40
CRAL7PTR EQU   CRABASIC+36
CRAL6PTR EQU   CRABASIC+32
CRAL4PTR EQU   CRABASIC+24
CRAL3PTR EQU   CRABASIC+20
CRAL2PTR EQU   CRABASIC+16
CRAL1PTR EQU   CRABASIC+12
CRALEV01 EQU   CRALKACT+3
CRALEV02 EQU   CRALKACT+3
CRALEV03 EQU   CRALKACT+3
CRALEV04 EQU   CRALKACT+3
CRALEV05 EQU   CRALKACT+3
CRALEV06 EQU   CRALKACT+3
CRALEV07 EQU   CRALKACT+3
CRALEV08 EQU   CRALKACT+3
CRALEV09 EQU   CRALKACT+2
CRALEV10 EQU   CRALKACT+2
CRALEV11 EQU   CRALKACT+2
CRALEV12 EQU   CRALKACT+2
CRALEV13 EQU   CRALKACT+2
CRALEV14 EQU   CRALKACT+2
CRALEV15 EQU   CRALKACT+2
CRALEV16 EQU   CRALKACT+2
CRALEV17 EQU   CRALKACT+1
CRALEV18 EQU   CRALKACT+1
CRALEV19 EQU   CRALKACT+1
CRALEV20 EQU   CRALKACT+1
CRALEV21 EQU   CRALKACT+1
CRALEV22 EQU   CRALKACT+1
CRALEV23 EQU   CRALKACT+1
CRALEV24 EQU   CRALKACT+1
CRALEV25 EQU   CRALKACT
CRALEV26 EQU   CRALKACT
CRALEV27 EQU   CRALKACT
CRALEV28 EQU   CRALKACT
CRALEV29 EQU   CRALKACT
CRALEV30 EQU   CRALKACT
CRALEV31 EQU   CRALKACT
CRALEV32 EQU   CRALKACT
CRAFRR   EQU   CRAHDR+4
@NM00145 EQU   ISTAPCRR+137
@NM00144 EQU   APC57FLG
APCNREL  EQU   APC57FLG
APCRECRA EQU   APC57FLG
@NM00143 EQU   APC54FLG
APCRLST  EQU   APC54FLG
APCPR153 EQU   APC53FLG
@NM00142 EQU   APC52FLG
APCWKF   EQU   APC52FLG
APCNWF   EQU   APC52FLG
APCRDQ   EQU   APC52FLG
APCQENQ  EQU   APC52FLG
APCSMSR  EQU   APC52FLG
APCCKRQ  EQU   APC52FLG
@NM00141 EQU   APC31FLG
APCSORT  EQU   APC31FLG
APCRESCH EQU   APC31FLG
APCTPXIT EQU   APC31FLG
APCSWTWD EQU   ISTAPCRR+128
APCSAV2  EQU   ISTAPCRR+124
APCSAV1  EQU   ISTAPCRR+120
APCRETCD EQU   APCCOMF+2
@NM00140 EQU   APCCOMF1+1
APCZLBER EQU   APCCOMF1
APCEXIT  EQU   APCCOMF1
APCRELR  EQU   APCCOMF1
APCIRB2  EQU   APCCOMF1
APCIRB1  EQU   APCCOMF1
APCSMCR  EQU   APCCOMF1
APCUETSK EQU   APCCOMF1
APCSSTSK EQU   APCCOMF1
APCESTAL EQU   APCSAVE
APCFRRPM EQU   ISTAPCRR+40
APCQWFO  EQU   ISTAPCRR+36
APCPABSV EQU   ISTAPCRR+32
APCRTRN  EQU   ISTAPCRR+28
APCTCBA  EQU   ISTAPCRR+24
APCPSTA  EQU   ISTAPCRR+20
@NM00139 EQU   APCRFLG+1
APC31R   EQU   APCRFLG
APC58R   EQU   APCRFLG
APC57R   EQU   APCRFLG
APC56R   EQU   APCRFLG
APC54R   EQU   APCRFLG
APC53R   EQU   APCRFLG
APC52R   EQU   APCRFLG
APC51R   EQU   APCRFLG
@NM00138 EQU   APCATFLG+1
APC31E   EQU   APCATFLG
APC58E   EQU   APCATFLG
APC57E   EQU   APCATFLG
APC56E   EQU   APCATFLG
APC54E   EQU   APCATFLG
APC53E   EQU   APCATFLG
APC52E   EQU   APCATFLG
APC51E   EQU   APCATFLG
APCHDRSV EQU   ISTAPCRR
ASCPSREG EQU   ISTASCRR+44
ASCUSR01 EQU   ASCUSRGS+12
ASCUSR00 EQU   ASCUSRGS+8
ASCUSR15 EQU   ASCUSRGS+4
ASCUSR14 EQU   ASCUSRGS
ASCETRYA EQU   ISTASCRR+24
ASCKEY   EQU   ISTASCRR+23
ASCAUDIT EQU   ASCFLG3
ASCFBDUD EQU   ASCFLG3
ASCLLKF  EQU   ASCFLG3
ASCKEYF  EQU   ASCFLG3
ASCFBDAL EQU   ASCFLG3
ASCFSRGT EQU   ASCFLG3
ASCICR   EQU   ASCFLG2
ASCFSRIC EQU   ASCFLG2
ASCFBDIC EQU   ASCFLG2
ASCFBAIC EQU   ASCFLG2
ASCPASTR EQU   ASCFLG1
ASCFSR   EQU   ASCFLG1
ASCFBD   EQU   ASCFLG1
ASCFBA   EQU   ASCFLG1
ASCPFCRR EQU   ISTASCRR
ZCRRU    EQU   ZCRRHRU+3
ZCRRH    EQU   ZCRRHRU
ZCRWORDA EQU   ISTZCRR+477
ZCRCMNRC EQU   ISTZCRR+476
ZCRRSV97 EQU   ZCRENTER+18
ZCREIC2B EQU   ZCRENTER+18
ZCREAC2B EQU   ZCRENTER+18
ZCRELCAB EQU   ZCRENTER+18
ZCREDCMF EQU   ZCRENTER+18
ZCREBCIF EQU   ZCRENTER+18
ZCREICSG EQU   ZCRENTER+18
ZCREDCK0 EQU   ZCRENTER+18
ZCRECFY0 EQU   ZCRENTER+17
ZCREKCCB EQU   ZCRENTER+17
ZCREDCNB EQU   ZCRENTER+17
ZCREICOE EQU   ZCRENTER+17
ZCREBCNB EQU   ZCRENTER+17
ZCREBC0L EQU   ZCRENTER+17
ZCREBCAL EQU   ZCRENTER+17
ZCREDCQR EQU   ZCRENTER+17
ZCREDCPR EQU   ZCRENTER+16
ZCREBCSB EQU   ZCRENTER+16
ZCREAC1R EQU   ZCRENTER+16
ZCRECCCI EQU   ZCRENTER+16
ZCRECCAI EQU   ZCRENTER+16
ZCRECCBI EQU   ZCRENTER+16
ZCREBCAR EQU   ZCRENTER+16
ZCREBCDR EQU   ZCRENTER+16
ZCREBCBR EQU   ZCRENTER+15
ZCREDCXR EQU   ZCRENTER+15
ZCREDCWB EQU   ZCRENTER+15
ZCREDCWR EQU   ZCRENTER+15
ZCREKCCN EQU   ZCRENTER+15
ZCREKCBN EQU   ZCRENTER+15
ZCREKCBB EQU   ZCRENTER+15
ZCREJC0B EQU   ZCRENTER+15
ZCREJCDB EQU   ZCRENTER+14
ZCREJCCB EQU   ZCRENTER+14
ZCREJCBB EQU   ZCRENTER+14
ZCREJCAB EQU   ZCRENTER+14
ZCREIC1B EQU   ZCRENTER+14
ZCREIC0B EQU   ZCRENTER+14
ZCREICX0 EQU   ZCRENTER+14
ZCREICWB EQU   ZCRENTER+14
ZCREICVB EQU   ZCRENTER+13
ZCREICUB EQU   ZCRENTER+13
ZCREICTB EQU   ZCRENTER+13
ZCREICSC EQU   ZCRENTER+13
ZCREICSB EQU   ZCRENTER+13
ZCREICRB EQU   ZCRENTER+13
ZCREICQB EQU   ZCRENTER+13
ZCREICQA EQU   ZCRENTER+13
ZCREICOB EQU   ZCRENTER+12
ZCREICOA EQU   ZCRENTER+12
ZCREICNB EQU   ZCRENTER+12
ZCREICNA EQU   ZCRENTER+12
ZCREICMB EQU   ZCRENTER+12
ZCREICLB EQU   ZCRENTER+12
ZCREICKG EQU   ZCRENTER+12
ZCREICKE EQU   ZCRENTER+12
ZCREICKB EQU   ZCRENTER+11
ZCREICJB EQU   ZCRENTER+11
ZCREICID EQU   ZCRENTER+11
ZCREICIB EQU   ZCRENTER+11
ZCREICHB EQU   ZCRENTER+11
ZCREICGB EQU   ZCRENTER+11
ZCREICEB EQU   ZCRENTER+11
ZCREICDB EQU   ZCRENTER+11
ZCREICCI EQU   ZCRENTER+10
ZCREICCB EQU   ZCRENTER+10
ZCREICBI EQU   ZCRENTER+10
ZCREICBB EQU   ZCRENTER+10
ZCREICAB EQU   ZCRENTER+10
ZCREICAA EQU   ZCRENTER+10
ZCREHCAN EQU   ZCRENTER+10
ZCREGC0B EQU   ZCRENTER+10
ZCREGC0A EQU   ZCRENTER+9
ZCREGCLA EQU   ZCRENTER+9
ZCREGCEB EQU   ZCRENTER+9
ZCREGCDB EQU   ZCRENTER+9
@NM00137 EQU   ZCRENTER+9
ZCREGCBB EQU   ZCRENTER+9
ZCREGCAB EQU   ZCRENTER+9
ZCREFCEB EQU   ZCRENTER+9
ZCREFCEA EQU   ZCRENTER+8
ZCREECTA EQU   ZCRENTER+8
ZCREECEA EQU   ZCRENTER+8
ZCREECDA EQU   ZCRENTER+8
ZCREECCB EQU   ZCRENTER+8
ZCREECCA EQU   ZCRENTER+8
ZCREECBB EQU   ZCRENTER+8
ZCREECBA EQU   ZCRENTER+8
ZCREDCMB EQU   ZCRENTER+7
ZCREDCL0 EQU   ZCRENTER+7
ZCREDCKB EQU   ZCRENTER+7
ZCREDCKA EQU   ZCRENTER+7
ZCREDCJ0 EQU   ZCRENTER+7
ZCREDCI0 EQU   ZCRENTER+7
ZCREDCH0 EQU   ZCRENTER+7
ZCREDCF0 EQU   ZCRENTER+7
ZCREDCE0 EQU   ZCRENTER+6
ZCREDCD0 EQU   ZCRENTER+6
ZCREDCC0 EQU   ZCRENTER+6
ZCREDCB0 EQU   ZCRENTER+6
ZCREDCA0 EQU   ZCRENTER+6
ZCRECC2B EQU   ZCRENTER+6
ZCRECC1B EQU   ZCRENTER+6
ZCRECC1A EQU   ZCRENTER+6
ZCRECC0B EQU   ZCRENTER+5
ZCRECC0A EQU   ZCRENTER+5
ZCREBC0B EQU   ZCRENTER+5
ZCREBC0A EQU   ZCRENTER+5
ZCREBCZ0 EQU   ZCRENTER+5
ZCREBCY0 EQU   ZCRENTER+5
ZCREBCX0 EQU   ZCRENTER+5
ZCREBCXA EQU   ZCRENTER+5
ZCREBCSC EQU   ZCRENTER+4
ZCREBCRB EQU   ZCRENTER+4
ZCREBCRA EQU   ZCRENTER+4
ZCREBCQB EQU   ZCRENTER+4
ZCREBCPB EQU   ZCRENTER+4
ZCREBCOB EQU   ZCRENTER+4
ZCREBCNE EQU   ZCRENTER+4
ZCREBCND EQU   ZCRENTER+4
ZCREBCMB EQU   ZCRENTER+3
ZCREBCLB EQU   ZCRENTER+3
ZCREBCLA EQU   ZCRENTER+3
ZCREBCKB EQU   ZCRENTER+3
ZCREBCKA EQU   ZCRENTER+3
ZCREBCJB EQU   ZCRENTER+3
ZCREBCJA EQU   ZCRENTER+3
ZCREBCID EQU   ZCRENTER+3
ZCREBCIB EQU   ZCRENTER+2
ZCREBCIA EQU   ZCRENTER+2
ZCREBCHB EQU   ZCRENTER+2
ZCREBCHA EQU   ZCRENTER+2
ZCREBCGB EQU   ZCRENTER+2
ZCREBCGA EQU   ZCRENTER+2
ZCREBCFB EQU   ZCRENTER+2
ZCREBCFA EQU   ZCRENTER+2
ZCREBCEB EQU   ZCRENTER+1
ZCREBCDI EQU   ZCRENTER+1
ZCREBCCB EQU   ZCRENTER+1
ZCREBCBI EQU   ZCRENTER+1
ZCREBCBB EQU   ZCRENTER+1
ZCREBCBA EQU   ZCRENTER+1
ZCREBCAM EQU   ZCRENTER+1
ZCREBCAI EQU   ZCRENTER+1
ZCREBCAG EQU   ZCRENTER
ZCREBCAE EQU   ZCRENTER
ZCREBCAB EQU   ZCRENTER
ZCREBCAA EQU   ZCRENTER
ZCREAC1B EQU   ZCRENTER
ZCREAC0B EQU   ZCRENTER
ZCREAC0A EQU   ZCRENTER
ZCREAC1A EQU   ZCRENTER
ZCRTNAME EQU   ZCRAUDIT+1
ZCRTID   EQU   ZCRAUDIT
ZCRREMIC EQU   ISTZCRR+436
ZCRSAVEZ EQU   ISTZCRR+196
ZCRDAFSV EQU   ZCRCIDSV+2
ZCRSAFSV EQU   ZCRCIDSV
ZCRR13SV EQU   ISTZCRR+188
ZCRR2SV  EQU   ISTZCRR+184
ZCROPCDE EQU   ISTZCRR+183
ZCRPRMTC EQU   ISTZCRR+182
ZCRRCDSV EQU   ISTZCRR+181
ZCRAWQSW EQU   ISTZCRR+180
ZCRTOPQ  EQU   ISTZCRR+180
ZCRLSTFB EQU   ISTZCRR+180
ZCRXSCHD EQU   ISTZCRR+180
ZCRNXTEL EQU   ISTZCRR+180
ZCRSCANQ EQU   ISTZCRR+180
ZCRMOREL EQU   ISTZCRR+180
ZCRFBPRC EQU   ISTZCRR+180
ZCRFSBSV EQU   ISTZCRR+176
ZCRSVWK5 EQU   ZCRWKARA+16
ZCRSVWK4 EQU   ZCRWKARA+12
ZCRSVWK3 EQU   ZCRWKARA+8
ZCRSVWK2 EQU   ZCRWKARA+4
ZCRSVWK1 EQU   ZCRWKARA
ZCRSVF25 EQU   ZCRSVRTN+96
ZCRSVF24 EQU   ZCRSVRTN+92
ZCRSVF23 EQU   ZCRSVRTN+88
ZCRSVF22 EQU   ZCRSVRTN+84
ZCRSVF21 EQU   ZCRSVRTN+80
ZCRSVF20 EQU   ZCRSVRTN+76
ZCRSVF19 EQU   ZCRSVRTN+72
ZCRSVF18 EQU   ZCRSVRTN+68
ZCRSVF17 EQU   ZCRSVRTN+64
ZCRSVF16 EQU   ZCRSVRTN+60
ZCRSVF15 EQU   ZCRSVRTN+56
ZCRSVF14 EQU   ZCRSVRTN+52
ZCRSVF13 EQU   ZCRSVRTN+48
ZCRSVF12 EQU   ZCRSVRTN+44
ZCRSVF11 EQU   ZCRSVRTN+40
ZCRSVF10 EQU   ZCRSVRTN+36
ZCRSVF9  EQU   ZCRSVRTN+32
ZCRSVF8  EQU   ZCRSVRTN+28
ZCRSVF7  EQU   ZCRSVRTN+24
ZCRSVF6  EQU   ZCRSVRTN+20
ZCRSVF5  EQU   ZCRSVRTN+16
ZCRSVF4  EQU   ZCRSVRTN+12
ZCRSVF3  EQU   ZCRSVRTN+8
ZCRSVF2  EQU   ZCRSVRTN+4
ZCRSVF1  EQU   ZCRSVRTN
ZCRPVZB  EQU   ISTZCRR+52
ZCRZLB   EQU   ISTZCRR+48
ZCRBFPTR EQU   ISTZCRR+44
ZCRCCWA  EQU   ISTZCRR+40
ZCRPSW   EQU   ZCRPARMS+15
ZCRPCHAR EQU   ZCRPARMS+14
ZCRPRES2 EQU   ZCRPCOD2
ZCRPMFGF EQU   ZCRPCOD2
ZCRPFHDR EQU   ZCRPCOD2
ZCRPPG2  EQU   ZCRPCOD2
ZCRPRES  EQU   ZCRPCOD1
ZCRPCFTX EQU   ZCRPCOD1
ZCRPBUF  EQU   ZCRPCOD1
ZCRPLSCB EQU   ZCRPCOD1
ZCRPLSBQ EQU   ZCRPLSBF
ZCRPFSB  EQU   ZCRPCOD1
ZCRPLNG  EQU   ZCRPCOD1
ZCRPPG   EQU   ZCRPCOD1
ZCRDTODA EQU   ZCRDFRDA
ZCRMLNG  EQU   ZCRPARMS+8
ZCRTBPTR EQU   ZCRPARMS+4
ZCRCBPTR EQU   ZCRFBPTR
ZCRCRLCP EQU   ISTZCRR+20
@NM00136 EQU   ZCRSCPSW
ZCRSKIPT EQU   ZCRSCPSW
ZCRFSBWE EQU   ZCRSCPSW
ZCRPRCMP EQU   ZCRSCPSW
ZCRLREQ  EQU   ZCRSCPSW
ZCRRJLCP EQU   ZCRSCPSW
ZCRTPINV EQU   ZCRSCPSW
ZCRTPEX  EQU   ZCRSCPSW
@NM00135 EQU   ZCRIBPR
ZCR3270R EQU   ZCRIBPR
ZCR3270  EQU   ZCRIBPR
ZCRLCPFD EQU   ZCRIBPR
ZCRLCPFR EQU   ZCRIBPR
ZCRRELK  EQU   ZCRIBPR
ZCRERR   EQU   ZCRIBPR
ZCRNOBUF EQU   ZCRIBPR
@NM00134 EQU   ZCRPFLGS
ZCRQAHED EQU   ZCRPFLGS
ZCRF1RES EQU   ZCRGENSW
ZCRBRIS  EQU   ZCRGENSW
ZCRCLRBD EQU   ZCRGENSW
ZCREXRES EQU   ZCRGENSW
ZCRLCSYN EQU   ZCRGENSW
ZCRRT06  EQU   ZCRGENSW
ZCRTSW2  EQU   ZCRGENSW
ZCRTSW1  EQU   ZCRGENSW
ZCRINLCP EQU   ZCRFLGS3
ZCRWRPTR EQU   ZCRFLGS3
ZCRNOFRE EQU   ZCRFLGS3
ZCREDRIV EQU   ZCRFLGS3
ZCRDISC  EQU   ZCRFLGS3
ZCRTPDIS EQU   ZCRFLGS3
ZCRTPCON EQU   ZCRFLGS3
ZCRTIC   EQU   ZCRFLGS3
ZCRCNLXL EQU   ZCRRESET
ZCRENDAN EQU   ZCRSWFLD
ZCRENDXL EQU   ZCRSWFLD
ZCRENDX  EQU   ZCRSWFLD
ZCROB1   EQU   ZCRNDLCP
ZCRENDPR EQU   ZCRSWFLD
ZCREXTYP EQU   ZCRSWFLD
ZCRSLCP  EQU   ZCRENDSH
ZCRIF0E3 EQU   ZCRFLGS2
ZCRIF0E2 EQU   ZCRFLGS2
ZCRIF0E1 EQU   ZCRFLGS2
ZCROB    EQU   ZCRFLGS2
ZCRFMSED EQU   ZCRFLGS2
ZCRSHEDI EQU   ZCRFLGS2
ZCRLOCAL EQU   ZCRFLGS2
ZCRFEXIT EQU   ZCRFLGS1
ZCRUNSOL EQU   ZCRFLGS1
ZCRENDLP EQU   ZCRFLGS1
ZCRNRMEX EQU   ZCRFLGS1
ZCRWAIT  EQU   ZCRFLGS1
ZCRDEQSW EQU   ZCRFLGS1
ZCRQUESW EQU   ZCRFLGS1
ZCREXSW  EQU   ZCRFLGS1
ZCRFRRA  EQU   ISTZCRR+8
ZCRCHAIN EQU   ISTZCRR+4
ZCRFLAG  EQU   ZCRCRR+3
ZCRLEN   EQU   ZCRCRR+1
ZCRID    EQU   ZCRCRR
CCFRSVD1 EQU   CFCCRT
CCFCR2   EQU   CFCCRT
CCFCRP   EQU   CFCCRT
CCFCR1   EQU   CFCCRT
CCFCS2   EQU   CFCCRT
CCFCS1   EQU   CFCCRT
NCFRSVD  EQU   CFCNTRD
NCFCR2   EQU   CFCNTRD
NCFCRP   EQU   CFCNTRD
NCFCR1   EQU   CFCNTRD
NCFCS2   EQU   CFCNTRD
NCFCS1   EQU   CFCNTRD
PFCRSV01 EQU   ISTPFCRR+13
PFCFTA   EQU   ISTPFCRR+12
CRRFRR   EQU   PFCFRRO
CRRCHAIN EQU   PFCCRRO
CRRLEN   EQU   PFCCRRLN
PFCRSV10 EQU   PFCCRR+1
CRRID    EQU   PFCCRRID
ZSAZTRAC EQU   ISTZSAVE+36
ZSAZSVVR EQU   ISTZSAVE+12
ZSAZSVRR EQU   ISTZSAVE+8
ZSAZSVFC EQU   ISTZSAVE+4
ZSAZACTV EQU   ZSAZSVMS
LCPFTYPE EQU   LCPRPHA
LCPRSTQH EQU   LCPLCCW
LCPCLREP EQU   ISTLCPB+44
LCPUBFSB EQU   LCPFLCCW
LCPRSV77 EQU   ISTLCPB+39
LCPLCCWC EQU   ISTLCPB+38
LCPRSV78 EQU   LCPFLG1
LCPTRANS EQU   LCPFLG1
LCPSTLB  EQU   LCPFLG1
LCPREDRV EQU   LCPFLG1
LCPDIRPT EQU   LCPFLG1
LCPINTER EQU   LCPFLG1
LCPRESET EQU   LCPFLG1
LCPSTYPE EQU   ISTLCPB+36
LCPFSNCH EQU   ISTLCPB+34
LCPFOSN  EQU   ISTLCPB+32
LCPTLBAD EQU   ISTLCPB+28
LCPFDB2  EQU   LCPFDBA+1
LCPFDB1  EQU   LCPFDBA
LCPNXLCW EQU   ISTLCPB+20
LCPDAF   EQU   LCPCID+2
LCPSAF   EQU   LCPCID
LCPLCCW1 EQU   ISTLCPB+12
LCPRRCNT EQU   LCPSEQ+1
LCPRRCCT EQU   LCPSEQ
LCPATOP  EQU   LCPFLAG2
LCPFREE  EQU   LCPFLAG2
LCPDSTAT EQU   LCPFLAG2
LCPEXRES EQU   LCPFID0
LCPZRIMM EQU   LCPTLBPI
LCPRSTRT EQU   LCPFLAG2
LCPASYN  EQU   LCPFLAG2
LCPPRFLG EQU   LCPFLAG2
LCPZMIRC EQU   LCPRUCNT
LCPCHAI2 EQU   LCPCHAIN+1
LCPCHNG  EQU   LCPCHAI1
LCPZRT0B EQU   LCPMNRCD
LCPZRT0A EQU   LCPMNRCD
LCPZRTL9 EQU   LCPZRT09
LCPZRTL8 EQU   LCPZRT08
LCPZRTL7 EQU   LCPZRT07
LCPZRTL6 EQU   LCPZRT06
LCPZRTL5 EQU   LCPZRT05
LCPZRTL4 EQU   LCPZRT04
LCPZRTL3 EQU   LCPZRT03
LCPZRTL2 EQU   LCPZRT02
LCPZRT01 EQU   LCPFLAGS
LCPZRT00 EQU   LCPFLAGS
LCPLNGTH EQU   ISTLCPB+1
LCPTYPE  EQU   ISTLCPB
LCCWDATA EQU   ISTLCCW+4
LCCWCNT  EQU   ISTLCCW+2
LCCWACI  EQU   LCCWFLAG
LCCWRFI  EQU   LCCWFLAG
LCCWPER  EQU   LCCWLSI
LCCWIDAT EQU   LCCWFLAG
LCCWNTVC EQU   LCCWFLAG
LCCWCKPT EQU   LCCWFLAG
LCCWCC   EQU   LCCWFLAG
LCCWCD   EQU   LCCWFLAG
LCCWTYPE EQU   LCCWCTL
LCCWMODE EQU   LCCWCTL
LCCWSOP  EQU   LCCWRWOP
@NM00133 EQU   LCCWRWOP
LCCWSD   EQU   LCCWOP
LCCWSI   EQU   LCCWOP
ATCAOS   EQU   ISTATCVT+1584
ATCPOPAB EQU   ATCAOSM+640
ATCVIOPM EQU   ATCAOSM+636
ATCTPMMI EQU   ATCAOSM+632
ATCTPMPB EQU   ATCAOSM+600
ATCRSV88 EQU   ATCAOSM+596
ATCRPLCT EQU   ATCAOSM+594
ATCCRACT EQU   ATCAOSM+592
ATCSRBCT EQU   ATCAOSM+590
ATCRSV75 EQU   ATCAOSM+589
ATCRSV66 EQU   ATCZFLAG
ATCZF001 EQU   ATCZFLAG
ATCTPCP1 EQU   ATCAOSM+584
ATCTPCP0 EQU   ATCAOSM+580
ATCAICTN EQU   ATCAOSM+576
ATCZR01  EQU   ATCAOSM+572
ATCMPLTA EQU   ATCAOSM+568
ATCASCB  EQU   ATCAOSM+564
ATCAP86  EQU   ATCAOSM+560
ATCAP85  EQU   ATCAOSM+556
ATCAP84  EQU   ATCAOSM+552
ATCAP83  EQU   ATCAOSM+548
ATCAP82  EQU   ATCAOSM+544
ATCAP69  EQU   ATCAOSM+540
ATCAP66  EQU   ATCAOSM+536
ATCAP62  EQU   ATCAOSM+532
ATCAPC59 EQU   ATCAOSM+528
ATCAP56  EQU   ATCAOSM+524
ATCAP55  EQU   ATCAOSM+520
ATCRCFY0 EQU   ATCAOSM+516
ATCAP41  EQU   ATCAOSM+512
ATCAPC25 EQU   ATCAOSM+508
ATCAP23  EQU   ATCAOSM+504
ATCTPSPB EQU   ATCAOSM+472
ATCTRMPB EQU   ATCAOSM+440
ATCAPBE  EQU   ATCAOSM+436
ATCPSTA  EQU   ATCAOSM+432
ATCSMABF EQU   ATCAOSM+428
ATCSMAPR EQU   ATCAOSM+424
ATCTPWQA EQU   ATCAOSM+420
ATCSMAID EQU   ATCAOSM+416
ATCSMARA EQU   ATCAOSM+412
ATCCACXA EQU   ATCAOSM+408
ATCZLAAB EQU   ATCAOSM+404
ATCATA10 EQU   ATCAOSM+400
ATCHLTCB EQU   ATCAOSM+396
@NM00090 EQU   ATCVTFLG
ATCVTACT EQU   ATCVTFLG
ATCRPT40 EQU   ATCAOSM+388
ATCRPT39 EQU   ATCAOSM+384
ATCRPT38 EQU   ATCAOSM+380
ATCRPT37 EQU   ATCAOSM+376
ATCRPT36 EQU   ATCAOSM+372
ATCRPT35 EQU   ATCAOSM+368
ATCRPT34 EQU   ATCAOSM+364
ATCRPT33 EQU   ATCAOSM+360
ATCRPT32 EQU   ATCAOSM+356
ATCRPT31 EQU   ATCAOSM+352
ATCRPT30 EQU   ATCAOSM+348
ATCRPT29 EQU   ATCAOSM+344
ATCRPT28 EQU   ATCAOSM+340
ATCRPT27 EQU   ATCAOSM+336
@NM00089 EQU   ATCAOSM+333
@NM00088 EQU   @NM00087
ATCSNUF  EQU   @NM00087
ATCOPKL  EQU   @NM00087
ATCABEN  EQU   @NM00087
ATCAIWT  EQU   ATCAOSM+328
ATCINFDD EQU   ATCAOSM+324
ATCORFMG EQU   ATCAOSM+320
ATCORFRL EQU   ATCAOSM+316
ATCOROBT EQU   ATCAOSM+312
ATCORQG  EQU   ATCORSRB
ATCORTBF EQU   ATCSQAFR
ATCRPLAC EQU   ATCRPLCN+2
ATCRPLRC EQU   ATCRPLCN
ATCCRPLQ EQU   ATCCRPL
ATCSRBAC EQU   ATCSRBCN+2
ATCSRBRC EQU   ATCSRBCN
ATCSRBQ  EQU   ATCSRB
ATCCRAAC EQU   ATCCRACN+2
ATCCRARC EQU   ATCCRACN
ATCCRAQ  EQU   ATCCRA
ATCRPT12 EQU   ATCAOSM+276
ATCDMAPP EQU   ATCAOSM+272
ATCAP38  EQU   ATCAOSM+268
ATCAP37  EQU   ATCAOSM+264
ATCZDFJ0 EQU   ATCAOSM+260
ATCAP51  EQU   ATCAOSM+256
ATCZPAB2 EQU   ATCAOSM+224
ATCZPAB1 EQU   ATCAOSM+192
ATCZLFVT EQU   ATCAOSM+188
ATCZLPVT EQU   ATCAOSM+184
ATCZDVTX EQU   ATCAOSM+180
ATCZDVT9 EQU   ATCAOSM+172
ATCZDVT8 EQU   ATCAOSM+168
ATCZDVT7 EQU   ATCAOSM+164
ATCRSV56 EQU   ATCDAPVT+22
ATCDAPDG EQU   ATCDAPVT+20
ATCDXCEA EQU   ATCDAPVT+16
ATCDCEA  EQU   ATCDAPVT+12
ATCDPCIA EQU   ATCDAPVT+8
ATCDSIOA EQU   ATCDAPVT+4
ATCDEOEA EQU   ATCDAPVT
ATCZLAEA EQU   ATCLDAPP+16
ATCZLCEA EQU   ATCLDAPP+12
ATCRSV17 EQU   ATCLDAPP+8
ATCSMFRR EQU   ATCLDAPP+4
ATCZAEA  EQU   ATCICAPP+16
ATCZCEA  EQU   ATCICAPP+12
ATCCDTCB EQU   ATCICAPP+8
ATCZSIOA EQU   ATCICAPP+4
ATCCDRPH EQU   ATCICAPP
ATCAP65  EQU   ATCAOSM+96
ATCZDVT4 EQU   ATCAOSM+88
ATCZDVT3 EQU   ATCAOSM+84
ATCZDVT1 EQU   ATCAOSM+80
ATCICNCB EQU   ATCAOSM+76
ATCZPSVT EQU   ATCAOSM+72
ATCZFSVT EQU   ATCAOSM+68
ATCAP64  EQU   ATCAOSM+64
ATCAP63  EQU   ATCAOSM+60
ATCAP61  EQU   ATCAOSM+56
ATCAP58  EQU   ATCAOSM+52
ATCAP57  EQU   ATCAOSM+48
ATCAP54  EQU   ATCAOSM+44
ATCAP53  EQU   ATCAOSM+40
ATCAP52  EQU   ATCAOSM+36
ATCAP34  EQU   ATCAOSM+32
ATCAP32  EQU   ATCAOSM+28
ATCAP31  EQU   ATCAOSM+24
ATCAP12  EQU   ATCAOSM+20
ATCAP11  EQU   ATCAOSM+16
ATCCMTCB EQU   ATCAOSM+12
ATCPRPH  EQU   ATCAOSM+8
ATCGSRBF EQU   ATCGSRBG
ATCSRBRT EQU   ATCAOSM
@NM00086 EQU   @NM00085
ATCVTMAB EQU   @NM00085
@NM00084 EQU   ATCVTBAM
ATCVDLOK EQU   ISTATCVT+904
ATCVFPAB EQU   ISTATCVT+872
ATCVDPAB EQU   ISTATCVT+840
ATCIOECB EQU   ISTATCVT+836
ATCINCW3 EQU   ISTATCVT+832
ATCMODTB EQU   ISTATCVT+828
ATCUSSPT EQU   ISTATCVT+824
ATCSRTAB EQU   ISTATCVT+820
@NM00083 EQU   ISTATCVT+819
@NM00082 EQU   ATCSTAT2
ATCTRSMS EQU   ATCSTAT2
ATCTRLOK EQU   ATCSTAT2
ATCTRPSS EQU   ATCSTAT2
ATCTRESC EQU   ATCSTAT2
ATCTRAPI EQU   ATCSTAT2
ATCNMCTR EQU   ISTATCVT+816
ATCSEC51 EQU   ATCSECST
ATCSEC40 EQU   ATCSIPD+8
ATCSEC30 EQU   ATCSIPD+4
ATCSEC21 EQU   ATCSIPD
ATCSEC10 EQU   ATCSOPD+4
ATCSEC01 EQU   ATCSOPD
ATCPOIA  EQU   ATCRNO+1
@NM00081 EQU   ATCRNO
ATCPODVT EQU   ISTATCVT+784
ATCS49XL EQU   ISTATCVT+780
ATCS49XI EQU   ISTATCVT+776
ATCLCLCT EQU   ATCVLCNT+2
ATCRNCNT EQU   ATCVLCNT
ATCCFEAD EQU   ISTATCVT+768
ATCPTR00 EQU   ISTATCVT+736
ATCRSV10 EQU   ISTATCVT+704
ATCTACB  EQU   ISTATCVT+700
ATCVTINM EQU   ISTATCVT+696
ATCTCLIM EQU   ISTATCVT+692
ATCTCLOM EQU   ISTATCVT+688
ATCVTIPB EQU   ISTATCVT+656
ATCTCIPB EQU   ISTATCVT+624
ATCTIPAB EQU   ISTATCVT+592
ATCOCCCB EQU   ISTATCVT+588
ATCOCCOB EQU   ISTATCVT+584
ATCCDLAD EQU   ISTATCVT+580
ATCCCLAD EQU   ISTATCVT+576
ATCDLRPB EQU   ISTATCVT+544
ATCPGPAB EQU   ISTATCVT+512
ATCVPAB1 EQU   ISTATCVT+480
ATCRSV97 EQU   ISTATCVT+476
ATCRDTLK EQU   ISTATCVT+472
ATCVOCLK EQU   ISTATCVT+468
ATCDVTLK EQU   ISTATCVT+456
ATCAP35  EQU   ISTATCVT+448
ATCRSV99 EQU   ISTATCVT+440
ATCONFIG EQU   ISTATCVT+432
ATCNODDS EQU   ISTATCVT+428
ATCNODEL EQU   ISTATCVT+420
ATCRSV69 EQU   ISTATCVT+416
ATCAPCR5 EQU   ISTATCVT+412
ATCLDECB EQU   ISTATCVT+408
ATCLDNCS EQU   ISTATCVT+404
ATCCDPTR EQU   ISTATCVT+400
ATCADEL  EQU   ISTATCVT+396
ATCTODVT EQU   ISTATCVT+392
ATCDEBCH EQU   ISTATCVT+388
ATCHBSIZ EQU   ATCHPGM+2
ATCHBFNO EQU   ATCHPGM
ATCCRME  EQU   ISTATCVT+380
ATCRVCHS EQU   ISTATCVT+372
ATCECTLP EQU   ISTATCVT+368
ATCECPRT EQU   ISTATCVT+360
ATCVTLOD EQU   ISTATCVT+356
ATCTRPAB EQU   ISTATCVT+352
ATCMSGM  EQU   ISTATCVT+348
ATCMSGP  EQU   ISTATCVT+344
ATCEPT   EQU   ISTATCVT+340
ATCDVT   EQU   ISTATCVT+336
ATCTRCPT EQU   ISTATCVT+332
ATCDVLOD EQU   ISTATCVT+328
ATCALERT EQU   ISTATCVT+324
ATCEPA   EQU   ISTATCVT+320
ATCSAF   EQU   ISTATCVT+318
ATCXRANG EQU   ISTATCVT+317
ATCLAST  EQU   ATCSHRFG
ATCSHRTN EQU   ISTATCVT+308
ATCUEP   EQU   ISTATCVT+304
ATCOCRT  EQU   ISTATCVT+300
ATCCSMA  EQU   ATCCSMR
ATCESC01 EQU   ISTATCVT+288
ATCMNT   EQU   ISTATCVT+272
ATCRSV16 EQU   ISTATCVT+270
ATCMAXID EQU   ISTATCVT+269
ATCMSGSP EQU   ATCCOM+268
ATCACTRM EQU   ATCCOM+264
ATCNERAP EQU   ATCCOM+260
ATCNESAL EQU   ATCCOM+256
ATCRCC65 EQU   ATCCOM+252
ATCRCC26 EQU   ATCCOM+248
ATCRCC63 EQU   ATCCOM+244
ATCRSV11 EQU   ATCCOM+242
ATCAPOST EQU   ATCCOM+236
ATCNERFN EQU   ATCCOM+232
ATCNERNE EQU   ATCCOM+228
ATCNERCV EQU   ATCCOM+224
ATCNERST EQU   ATCCOM+220
ATCDCC61 EQU   ATCCOM+216
ATCDCC60 EQU   ATCCOM+212
ATCSRTDF EQU   ATCCOM+208
ATCSRTAD EQU   ATCCOM+204
ATCFIRA  EQU   ATCCOM+200
ATCSMBQ  EQU   ATCCOM+196
ATCSMRC  EQU   ATCCOM+192
ATCSMQU  EQU   ATCCOM+184
ATCACDA  EQU   ATCCOM+176
ATCSTMA  EQU   ATCCOM+172
ATCFRSTR EQU   ATCCOM+168
ATCREADA EQU   ATCCOM+160
ATCALOAD EQU   ATCCOM+156
ATCBLDLA EQU   ATCCOM+152
ATCFBRPH EQU   ATCCOM+148
ATCBFTRC EQU   ATCCOM+144
ATCTPBUF EQU   ATCTHTRC
ATCREMOV EQU   ATCCOM+136
ATCADD   EQU   ATCCOM+132
ATCDVTPT EQU   ATCCOM+124
ATCFEPT  EQU   ATCCOM+120
ATCFDVT  EQU   ATCCOM+116
ATCCONFT EQU   ATCCOM+112
ATCPTCHA EQU   ATCCOM+108
ATCAUTHA EQU   ATCCOM+104
ATCACCTA EQU   ATCCOM+100
ATCRDTH  EQU   ATCCOM+96
ATCFRSCH EQU   ATCCOM+92
ATCFSB   EQU   ATCCOM+88
ATCHLTMS EQU   ATCCOM+84
ATCECPRM EQU   ATCCOM+80
ATCECNET EQU   ATCCOM+76
ATCECOPC EQU   ATCCOM+72
ATCVPARM EQU   ATCCOM+68
ATCECVRQ EQU   ATCCOM+64
ATCECSES EQU   ATCCOM+60
ATCOCHA  EQU   ATCCOM+56
ATCDSPLQ EQU   ATCCOM+52
ATCECDSP EQU   ATCCOM+48
ATCVARYQ EQU   ATCCOM+44
ATCECVRY EQU   ATCCOM+40
ATCHALTQ EQU   ATCCOM+36
ATCECHLT EQU   ATCCOM+32
ATCMODQ  EQU   ATCCOM+28
ATCECMOD EQU   ATCCOM+24
ATCASCHD EQU   ATCCOM+20
ATCSRT   EQU   ATCCOM+16
ATCRDT   EQU   ATCCOM+12
ATCDCFRR EQU   ATCCOM+8
ATCAPI   EQU   ATCCOM+4
ATCRSV04 EQU   ATCSTAT4
ATCVTTRC EQU   ATCSTAT4
ATCNCSD  EQU   ATCSTAT4
ATCMTST  EQU   ATCSTAT4
ATCTPRT  EQU   ATCSTAT4
ATCPRTAT EQU   ATCSTAT4
@NM00080 EQU   ATCPOFLG
ATCPOUNS EQU   ATCPOFLG
ATCHSDMF EQU   ATCSTFLG
@NM00079 EQU   ATCSTAT1
ATCMDHLT EQU   ATCSTAT1
ATCINHLT EQU   ATCSTAT1
ATCNETSL EQU   ATCSTAT1
ATCQKHLT EQU   ATCSTAT1
ATCSNHLT EQU   ATCSTAT1
ATCACTIV EQU   ATCSTAT1
ATCSTART EQU   ATCSTAT1
DYPPAB   EQU   ISTDYPAB+16
DYPRSV01 EQU   ISTDYPAB+12
DYPTSKID EQU   ISTDYPAB+8
DYPCHAIN EQU   ISTDYPAB+4
DYPFLGS  EQU   ISTDYPAB+2
DYPLNGTH EQU   ISTDYPAB+1
DYPTYPE  EQU   ISTDYPAB
@NM00078 EQU   CCNFLGA
@NM00077 EQU   CCNFLGA
CCNCB    EQU   ISTCCNCB
LUNLOCK  EQU   LUNZOS
LUNCB    EQU   ISTLUNCB
ICNZCON6 EQU   ICNZCONS+10
ICNZCON5 EQU   ICNZCONS+8
ICNZCON4 EQU   ICNZCONS+6
ICNZCON3 EQU   ICNZCONS+4
ICNZCON2 EQU   ICNZCONS+2
ICNZCON1 EQU   ICNZCONS
ICNZATSA EQU   ISTICNCB+676
ICNZX012 EQU   ISTICNCB+675
ICNZX011 EQU   ISTICNCB+674
ICNZX010 EQU   ISTICNCB+672
ICNSRB   EQU   ISTICNCB+628
ICNIOSB  EQU   ISTICNCB+520
ICNZC001 EQU   ISTICNCB+512
ICNZX013 EQU   ISTICNCB+511
ICNZS010 EQU   ICNZH002+1
ICNZS00F EQU   ICNZH002+1
ICNZS00E EQU   ICNZH002+1
ICNZS00D EQU   ICNZH002+1
ICNZS00C EQU   ICNZH002+1
ICNZS00B EQU   ICNZH002+1
ICNZS01A EQU   ICNZS00A
ICNZS019 EQU   ICNZS009
ICNZS018 EQU   ICNZS008
ICNZS017 EQU   ICNZS007
ICNZS016 EQU   ICNZS006
ICNZS005 EQU   ICNZH002
ICNZS014 EQU   ICNZS004
ICNZS013 EQU   ICNZS003
ICNZS012 EQU   ICNZS002
ICNZS001 EQU   ICNZH002
ICNZF028 EQU   ICNZFLAG
ICNZF027 EQU   ICNZFLAG
ICNZF026 EQU   ICNZFLAG
ICNZF025 EQU   ICNZFLAG
ICNZF024 EQU   ICNZFLAG
ICNZF023 EQU   ICNZFLAG
ICNZF022 EQU   ICNZFLAG
ICNZF021 EQU   ICNZFLAG
ICNWORD5 EQU   ISTICNCB+504
ICNMSIZE EQU   ISTICNCB+500
ICNLCVTA EQU   ISTICNCB+496
ICNDEBAD EQU   ICNDIDEB+1
ICNDCBIF EQU   ICNDIDEB
ICNUCBAD EQU   ICNDCDEB+8
ICNAPPAD EQU   ICNDCDEB+5
ICNEXSCL EQU   ICNDCDEB+4
ICNDCBAD EQU   ICNDCDEB+1
ICNDEBID EQU   ICNDCDEB
@NM00076 EQU   ISTICNCB+477
ICNERCNT EQU   ISTICNCB+476
ICNZX002 EQU   ISTICNCB+475
ICNZX001 EQU   ISTICNCB+474
ICNZH001 EQU   ISTICNCB+472
ICNZSW3R EQU   ISTICNCB+468
ICNZSW2R EQU   ISTICNCB+464
ICNZSW1R EQU   ISTICNCB+460
ICNZS4VR EQU   ISTICNCB+436
ICNZS4RR EQU   ISTICNCB+432
ICNZS4FC EQU   ISTICNCB+428
ICNZS4BC EQU   ISTICNCB+424
ICNZS3VR EQU   ISTICNCB+400
ICNZS3RR EQU   ISTICNCB+396
ICNZS3FC EQU   ISTICNCB+392
ICNZS3BC EQU   ISTICNCB+388
ICNZS1RC EQU   ICNZS1VR+36
ICNDIEW3 EQU   ICNDIEWA+8
ICNDIEW2 EQU   ICNDIEWA+4
ICNDIEW1 EQU   ICNDIEWA
ICNZS1RR EQU   ISTICNCB+344
ICNZS1FC EQU   ISTICNCB+340
ICNZS1BC EQU   ISTICNCB+336
ICNRSTIC EQU   ICNZD004
ICNRDCOD EQU   ICNRSCCW
ICNZD006 EQU   ISTICNCB+312
ICNZD005 EQU   ISTICNCB+304
ICNWSTIC EQU   ICNZD002
ICNWRCOD EQU   ICNWSCCW
ICNZV008 EQU   ISTICNCB+284
ICNZV007 EQU   ISTICNCB+280
ICNZV006 EQU   ISTICNCB+276
ICNZV005 EQU   ISTICNCB+272
ICNZV004 EQU   ISTICNCB+268
ICNLSTIT EQU   ISTICNCB+264
ICNLSTIF EQU   ISTICNCB+260
ICNZV002 EQU   ISTICNCB+256
ICNZV001 EQU   ISTICNCB+252
ICNZV00A EQU   ISTICNCB+249
ICNBUFF  EQU   ISTICNCB+248
ICNCPQ   EQU   ISTICNCB+244
ICNNICNA EQU   ISTICNCB+240
@NM00075 EQU   ICNFLAG2+2
ICNZF019 EQU   ICNFLAG2+2
ICNZF018 EQU   ICNFLAG2+2
ICNZF017 EQU   ICNFLAG2+2
ICNZF016 EQU   ICNFLAG2+2
ICNZF015 EQU   ICNFLAG2+2
ICNMSG   EQU   ICNFLAG2+1
ICNCLOSE EQU   ICNFLAG2+1
ICNZF014 EQU   ICNFLAG2+1
ICNZF013 EQU   ICNFLAG2+1
ICNZF012 EQU   ICNFLAG2+1
ICNZF011 EQU   ICNFLAG2+1
ICNZF00D EQU   ICNFLAG2+1
ICNZF00B EQU   ICNFLAG2+1
ICNZF00A EQU   ICNFLAG2
ICNZF008 EQU   ICNFLAG2
ICNZF007 EQU   ICNFLAG2
ICNZF005 EQU   ICNFLAG2
ICNZF004 EQU   ICNFLAG2
ICNZF003 EQU   ICNFLAG2
ICNZF002 EQU   ICNFLAG2
ICNZF001 EQU   ICNFLAG2
ICNLOCK  EQU   ISTICNCB+232
ICNLICNA EQU   ISTICNCB+228
ICNRPH   EQU   ISTICNCB+120
ICNZV003 EQU   ISTICNCB+116
ICNLAST  EQU   ISTICNCB+112
ICNLSTBT EQU   ISTICNCB+108
ICNSIOQ  EQU   ISTICNCB+104
ICNFLAG1 EQU   ISTICNCB+103
ICNZSW08 EQU   ICNZSWS
ICNZSW07 EQU   ICNZSWS
ICNZSW06 EQU   ICNZSWS
ICNZSW05 EQU   ICNZSWS
ICNZSW04 EQU   ICNZSWS
ICNZSW03 EQU   ICNZSWS
ICNZSW02 EQU   ICNZSWS
ICNZSW01 EQU   ICNZSWS
ICNZFF69 EQU   ICNFFLAG
@NM00074 EQU   ICNFFLAG
ICNZFF05 EQU   ICNFFLAG
ICNZFF04 EQU   ICNFFLAG
ICNZFF03 EQU   ICNFFLAG
ICNZFF02 EQU   ICNFFLAG
ICNZFF01 EQU   ICNFFLAG
ICNZFF00 EQU   ICNFFLAG
@NM00073 EQU   ICNFLAG
ICNZCRIT EQU   ICNFLAG
ICNSLOW  EQU   ICNFLAG
ICNZF010 EQU   ICNFLAG
ICNZF00F EQU   ICNFLAG
ICNZF00E EQU   ICNFLAG
ICNCONF  EQU   ICNZF006
ICNCKPAB EQU   ICNCKFLD+1
ICNRSV07 EQU   ICNCKFLD
ICNCKBIT EQU   ICNCKFLD
ICNZPAB4 EQU   ISTICNCB+80
ICNZPAB1 EQU   ISTICNCB+64
ICNRSV01 EQU   ISTICNCB+60
@NM00072 EQU   ISTICNCB+56
@NM00071 EQU   ISTICNCB+54
@NM00070 EQU   @NM00069
ICNRRY   EQU   @NM00069
ICNROLN  EQU   @NM00069
ICNRNRY  EQU   @NM00069
ICNLNKMD EQU   ISTICNCB+52
ICNCB    EQU   ISTICNCB
HCNRSV01 EQU   ISTHCNCB+113
HCNSVCR  EQU   ISTHCNCB+112
HCNNCB   EQU   ISTHCNCB
FMCFLRSV EQU   FMCFLGB
FMCFLGA8 EQU   FMCFLGB
FMCCLRPH EQU   FMCVS1+45
FMCRSV0X EQU   FMCCVFLG
FMCVYRPH EQU   FMCCVFLG
FMCZV004 EQU   FMCVS1+40
FMCLOCK2 EQU   FMCVS1+36
@NM00068 EQU   FMCZFLG2
FMCZF027 EQU   FMCZFLG2
FMCZF026 EQU   FMCZFLG2
FMCSEQ1B EQU   FMCSEQ1
FMCSEQ1T EQU   FMCSEQ1
FMCZX006 EQU   FMCVS1+33
FMCZX005 EQU   FMCVS1+32
FMCZX004 EQU   FMCVS1+31
FMCZX003 EQU   FMCVS1+30
FMCZX002 EQU   FMCVS1+29
FMCZX001 EQU   FMCVS1+28
FMCZV001 EQU   FMCVS1+24
FMCAWATQ EQU   FMCLCPAQ+1
@NM00067 EQU   FMCLCPAQ
FMCLCPB2 EQU   FMCLCPBQ+1
FMCLCPB1 EQU   FMCLCPBQ
FMCASCDQ EQU   FMCSHEAQ+1
@NM00066 EQU   FMCSHEAQ
FMCSHEDQ EQU   FMCVS1+8
FMCZFCSQ EQU   FMCVS1+6
FMCZH001 EQU   FMCVS1+4
FMCZF025 EQU   FMCZFLAG+3
FMCZF024 EQU   FMCZFLAG+3
FMCZF023 EQU   FMCZFLAG+3
FMCZF022 EQU   FMCZFLAG+3
FMCZF021 EQU   FMCZFLAG+3
FMCZF020 EQU   FMCZFLAG+3
FMCZF019 EQU   FMCZFLAG+3
FMCZF018 EQU   FMCZFLAG+3
FMCZF017 EQU   FMCZFLAG+2
FMCZF016 EQU   FMCZFLAG+2
FMCZF015 EQU   FMCZFLAG+2
FMCZF014 EQU   FMCZFLAG+2
FMCZF013 EQU   FMCZFLAG+2
FMCZF012 EQU   FMCZFLAG+2
FMCZF011 EQU   FMCZFLAG+2
FMCZF010 EQU   FMCZFLAG+2
FMCZF00F EQU   FMCZFLAG+1
FMCZF00E EQU   FMCZFLAG+1
FMCZF00D EQU   FMCZFLAG+1
FMCZF00B EQU   FMCZFLAG+1
FMCRSV10 EQU   FMCZFLAG+1
FMCZF009 EQU   FMCZFLAG+1
FMCZFD06 EQU   FMCZF006+1
FMCZFC06 EQU   FMCZF006
FMCZFB06 EQU   FMCZF006
FMCZFA06 EQU   FMCZF006
FMCZF005 EQU   FMCZFLAG
FMCZF004 EQU   FMCZFLAG
FMCZF003 EQU   FMCZFLAG
FMCZF002 EQU   FMCZFLAG
FMCFRESA EQU   ISTFMCB+228
FMCSCSQN EQU   FMCSNCTL+2
FMCSCCTL EQU   FMCSNCTL+1
FMCSTCTL EQU   FMCSCFLG
FMCSCCLO EQU   FMCSCFLG
FMCAPRO  EQU   FMCSCFLG
FMCLURO  EQU   FMCSCFLG
FMCOBSAC EQU   FMCSCFLG
FMCIBSAC EQU   FMCSCFLG
FMCFBRE  EQU   ISTFMCB+220
FMCFBXM  EQU   FMCZV002
FMCASEGQ EQU   ISTFMCB+212
FMCLOCK  EQU   ISTFMCB+204
FMCSEGD  EQU   FMCSSEGQ
FMCPSTRS EQU   ISTFMCB+196
@NM00065 EQU   FMCRRESP
FMCTSLHA EQU   FMCRRESP
FMCFRRN  EQU   FMCRRESP
FMCFME   EQU   FMCRRESP
FMCFEX   EQU   FMCRRESP
FMCFPE   EQU   FMCRRESP
FMCCTLB  EQU   ISTFMCB+194
FMCBSQNO EQU   FMCCLSEQ+2
FMCTSQNO EQU   FMCCLSEQ
FMCOBPRG EQU   FMCMODEB
FMCIBPRG EQU   FMCMODEB
FMCRESOT EQU   FMCMODEB
FMCRSTSR EQU   FMCMODEB
FMCLUQ   EQU   FMCMODEB
FMCAPQ   EQU   FMCMODEB
FMCCLEAR EQU   FMCMODEB
FMCHOLD  EQU   FMCMODEB
FMCIPSEQ EQU   ISTFMCB+188
FMCLUSTR EQU   ISTFMCB+187
FMCRSV87 EQU   FMCSTAT2
FMCSEQI  EQU   FMCSTAT2
FMCCPIP  EQU   FMCSTAT2
FMCALIPR EQU   FMCSTAT2
FMCIAIO  EQU   FMCSTAT2
FMCZF00A EQU   FMCSTAT2
FMCVPIP  EQU   FMCSTAT2
FMCPRMRC EQU   FMCCLEXT+20
FMCRSV89 EQU   FMCPSTAT
FMCPCLSD EQU   FMCPSTAT
FMCDDOCD EQU   FMCPSTAT
FMCIDVFD EQU   FMCPSTAT
FMCELKST EQU   FMCPSTAT
FMCRSV88 EQU   FMCPSCMD
FMCRDBLK EQU   FMCPSCMD
FMCDSEOC EQU   FMCPSCMD
FMCPURGE EQU   FMCPSCMD
FMCRESTI EQU   FMCPSCMD
FMCCNTCT EQU   FMCPSCMD
FMCINVT  EQU   FMCPSCMD
FMCFLGB7 EQU   FMCFLGCL
FMCFLGB6 EQU   FMCFLGCL
FMCFLGB5 EQU   FMCFLGCL
FMCFLGB4 EQU   FMCFLGCL
FMCFLGB1 EQU   FMCFLGCL
FMCFLGB0 EQU   FMCFLGCL
FMCFLGA7 EQU   FMCFLGA
FMCFLGA6 EQU   FMCFLGA
FMCFLGA5 EQU   FMCFLGA
FMCFLGA4 EQU   FMCFLGA
FMCFLGA3 EQU   FMCFLGA
FMCFLGA2 EQU   FMCFLGA
FMCFLGA0 EQU   FMCFLGA
FMCDCLOK EQU   FMCCLEXT+12
FMCRAFM  EQU   FMCCLEXT+8
FMCFBPTR EQU   FMCFBA+1
FMCFBRSV EQU   FMCFBA
FMCRPLPT EQU   FMCRPLA+1
FMCRPLRS EQU   FMCRPLA
FMCPRCLS EQU   FMCCVAL
FMCONLY  EQU   FMCOBCE
FMCLAST  EQU   FMCOBCE
FMCMIDLE EQU   FMCOBCE
FMCFIRST EQU   FMCOBCE
FMCCPCNT EQU   FMCPACPC
FMCMPCNT EQU   FMCPACEM
FMCNPCNT EQU   FMCPACEN
FMCCONF  EQU   FMCSSTAT
FMCPURCH EQU   FMCSSTAT
FMCNSALU EQU   FMCSSTAT
FMCBIP   EQU   FMCSSTAT
FMCSDTR  EQU   FMCSSTAT
FMCUIPI  EQU   FMCSSTAT
FMCCIPI  EQU   FMCSSTAT
FMCRVD01 EQU   ISTFMCB+158
FMCISSN  EQU   ISTFMCB+156
FMCOASN  EQU   FMCNXOSC
FMCOSSN  EQU   FMCNXCFM
FMCSIP   EQU   FMCSIPA
FMCFASYA EQU   ISTFMCB+60
FMCVWT   EQU   ISTFMCB+44
FMCRPLH  EQU   ISTFMCB+40
FMCBUFNB EQU   FMCCMPS1+2
@NM00064 EQU   FMCCMDFL
FMCSNA   EQU   FMCCMDFL
FMCVSNA  EQU   FMCCMDFL
FMCCMDR  EQU   FMCCMDFL
@NM00063 EQU   ISTFMCB+30
@NM00062 EQU   FMCSTAT1
FMCLTCLS EQU   FMCSTAT1
FMCHPURG EQU   FMCSTAT1
FMCVSP2  EQU   FMCSTAT1
FMCVSP1  EQU   FMCSTAT
FMCLTEAS EQU   FMCSTAT
FMCDEDSC EQU   FMCSTAT
FMCDEVOF EQU   FMCSTAT
FMCDAPT  EQU   FMCSTAT
FMCPRMTE EQU   FMCSTAT
FMCPRMTR EQU   FMCSTAT
LDNZS00F EQU   LDNZH003+1
LDNZS00E EQU   LDNZH003+1
LDNZS00D EQU   LDNZH003+1
LDNZS00C EQU   LDNZH003+1
LDNZS00B EQU   LDNZH003+1
LDNZS007 EQU   LDNZH003
LDNZS006 EQU   LDNZH003
LDNZS005 EQU   LDNZH003
LDNZS004 EQU   LDNZH003
LDNZS003 EQU   LDNZH003
LDNZS002 EQU   LDNZH003
LDNZS001 EQU   LDNZH003
LDNZS000 EQU   LDNZH003
LDNZX006 EQU   ISTLDNCB+576
LDNZC001 EQU   ISTLDNCB+569
LDNZX005 EQU   ISTLDNCB+568
LDNZV006 EQU   ISTLDNCB+564
LDNSRB   EQU   ISTLDNCB+520
LDNIOSB  EQU   ISTLDNCB+412
@NM00061 EQU   LDNZSAV3+28
LDNRSV06 EQU   LDNZSAV4+16
LDNZSAV6 EQU   LDNZSAV4+12
LDNZSAV5 EQU   LDNZSAV4
LDNZSAVE EQU   LDNZSAV3
LDNZSAV2 EQU   ISTLDNCB+368
LDNZSAV1 EQU   ISTLDNCB+352
LDNZ3RR  EQU   ISTLDNCB+348
LDNZ2RR  EQU   ISTLDNCB+344
LDNZ1RR  EQU   ISTLDNCB+340
LDNRSV0B EQU   ISTLDNCB+336
LDNRSV0A EQU   ISTLDNCB+332
LDNRSV09 EQU   ISTLDNCB+328
LDNRSV08 EQU   ISTLDNCB+324
LDNRSV07 EQU   ISTLDNCB+320
LDNDEAD  EQU   LDNDCDEB+12
LDNUCBAD EQU   LDNDCDEB+8
LDNAPPAD EQU   LDNDCDEB+5
LDNEXSCL EQU   LDNDCDEB+4
LDNDCBAD EQU   LDNDCDEB+1
LDNDEBID EQU   LDNDCDEB
LDNZRIND EQU   ISTLDNCB+300
LDNRPH   EQU   ISTLDNCB+192
LDNZTCP  EQU   ISTLDNCB+188
LDNZCHNC EQU   ISTLDNCB+187
LDNZLPC7 EQU   LDNZLPC
LDNZLPC6 EQU   LDNZLPC
LDNZLPC5 EQU   LDNZLPC
LDNZLPC4 EQU   LDNZLPC
LDNZLPC3 EQU   LDNZLPC
LDNZLPC2 EQU   LDNZLPC
LDNZLPC1 EQU   LDNZLPC
LDNZLPC0 EQU   LDNZLPC
LDNRSV05 EQU   LDNZERPF
LDNZCTOV EQU   LDNZEPIN
LDNZF001 EQU   LDNZEPIN
LDNZFRDW EQU   LDNZCPAN
LDNZFRD  EQU   LDNZCPAN
LDNZNARD EQU   LDNZCPAN
LDNRSV04 EQU   LDNZIOLK
LDNZATBF EQU   LDNZIOLK
LDNZERLK EQU   LDNZIOLK
LDNZDSIC EQU   LDNZIOLK
LDNZPAB1 EQU   ISTLDNCB+168
LDNZV005 EQU   ISTLDNCB+160
LDNZS1VR EQU   ISTLDNCB+136
LDNZS1RR EQU   ISTLDNCB+132
LDNZS1FC EQU   ISTLDNCB+128
LDNZS1BC EQU   ISTLDNCB+124
LDNZLOCK EQU   ISTLDNCB+120
LDNZFBUF EQU   ISTLDNCB+116
LDNZLAST EQU   ISTLDNCB+112
LDNRSV02 EQU   LDNFLAG2
LDNZFF04 EQU   LDNFLAG2
LDNZFF69 EQU   LDNFLAGS+2
LDNTPBIO EQU   LDNFLAGS+2
LDNZFF03 EQU   LDNFLAGS+2
LDNZFF02 EQU   LDNFLAGS+2
LDNZFF01 EQU   LDNFLAGS+2
LDNZFF00 EQU   LDNFLAGS+2
LDNCLOSD EQU   LDNFLAGS+2
LDNZENTR EQU   LDNFLAGS+2
LDNZICCW EQU   LDNFLAGS+1
LDNZREC  EQU   LDNFLAGS+1
LDNZCTXT EQU   LDNFLAGS+1
LDNZATLK EQU   LDNFLAGS+1
LDNZCHNE EQU   LDNFLAGS+1
LDNZATTP EQU   LDNFLAGS+1
LDNZIOBY EQU   LDNFLAGS+1
LDNZF00A EQU   LDNFLAGS+1
LDNZF009 EQU   LDNFLAGS
LDNZF008 EQU   LDNFLAGS
LDNZF007 EQU   LDNFLAGS
LDNZF006 EQU   LDNFLAGS
LDNZF005 EQU   LDNFLAGS
LDNZF004 EQU   LDNFLAGS
LDNZF003 EQU   LDNFLAGS
LDNZF002 EQU   LDNFLAGS
LDNZHDCC EQU   ISTLDNCB+106
LDNZARM  EQU   ISTLDNCB+104
LDNZRM   EQU   ISTLDNCB+102
LDNZRB   EQU   ISTLDNCB+100
LDNCPQ   EQU   ISTLDNCB+96
LDNSIOQ  EQU   ISTLDNCB+92
LDNZX002 EQU   ISTLDNCB+91
LDNZX001 EQU   ISTLDNCB+90
LDNZH002 EQU   ISTLDNCB+88
LDNZV001 EQU   ISTLDNCB+84
LDNZACSW EQU   ISTLDNCB+76
LDNZC002 EQU   ISTLDNCB+68
LDNCSWSV EQU   ISTLDNCB+60
LDNCHFLD EQU   ISTLDNCB+56
LDNRESRV EQU   ISTLDNCB+55
@NM00060 EQU   LDNCFLAG
LDNRMF   EQU   LDNCFLAG
LDNIBI   EQU   LDNCFLAG
LDNTSAF  EQU   ISTLDNCB+52
LDNCB    EQU   ISTLDNCB
DNCLOCK  EQU   DNCOS+36
DNCZV005 EQU   DNCOS+32
DNCZV003 EQU   DNCOS+24
DNCZV002 EQU   DNCOS+21
DNCZX001 EQU   DNCOS+20
DNCZV001 EQU   DNCOS+17
DNCZX003 EQU   DNCOS+16
DNCZV000 EQU   DNCOS+12
DNCSESCQ EQU   DNCOS+8
DNCSESIQ EQU   DNCOS+4
DNCACIP  EQU   DNCBSCED+1
DNCZF008 EQU   DNCZFLGS+1
DNCZPSRD EQU   DNCZFLGS+1
DNCZF007 EQU   DNCZFLGS+1
DNCZF006 EQU   DNCZFLGS+1
DNCZF005 EQU   DNCZFLGS+1
DNCZF004 EQU   DNCZFLGS+1
DNCZF003 EQU   DNCZFLGS
DNCZF002 EQU   DNCZFLGS
DNCZRSCH EQU   DNCZFLGS
DNCDISC  EQU   DNCZFLGS
DNCCONT  EQU   DNCZFLGS
DNCINVIT EQU   DNCZFLGS
DNCSESS  EQU   DNCZFLGS
DNCZF001 EQU   DNCZFLGS
DNCMODE  EQU   ISTDNCB+49
DNCNCB   EQU   ISTDNCB
NCBRSV01 EQU   ISTNCB+46
NCBLTRC  EQU   ISTNCB+30
NCBRVPT1 EQU   ISTNCB+28
@NM00059 EQU   NCBFLAG1
NCBFORCE EQU   NCBFLAG1
NCBTTF   EQU   NCBFLAG1
NCBRSYNC EQU   NCBFLAG1
NCBRSTRT EQU   NCBFLAG1
NCBSNAI  EQU   NCBFLAG1
NCBFLTIO EQU   NCBFTRIO
NCBCSTAT EQU   NCBFLAGS
PATRSV01 EQU   PATFLAGA
PATUSEFG EQU   PATFLAGA
PATRDCNT EQU   ISTPAT+6
PATGRPID EQU   ISTPAT+5
PATPTHID EQU   ISTPAT+4
PATDINDX EQU   ISTPAT+2
PATGINDX EQU   ISTPAT
GNTGRPNM EQU   ISTGNT
DNTTELNO EQU   ISTDNT+1
DNTCTDIG EQU   ISTDNT
RLSRSV02 EQU   ISTRLS+140
RLSRSV01 EQU   ISTRLS+138
RLSCTELU EQU   ISTRLS+136
RLSPRE   EQU   ISTRLS
RDARSVPT EQU   ISTRDA+84
RDAPUBI  EQU   ISTRDA+83
RDADFCUA EQU   ISTRDA+80
RDACTPCC EQU   ISTRDA+79
RDALUBA  EQU   RDAUCBAD+1
RDACHQI  EQU   RDAUCBAD
RDARSV01 EQU   RDAFLAG
RDARBISA EQU   RDAFLAG
RDAPRE   EQU   ISTRDA
RSWRSV01 EQU   ISTRSW+152
RSWRSV02 EQU   ISTRSW+150
RSWCTELU EQU   ISTRSW+148
RSWGRUPZ EQU   ISTRSW+146
RSWDIALZ EQU   ISTRSW+144
RSWGRUPT EQU   ISTRSW+140
RSWDIALT EQU   ISTRSW+136
RSWPRE   EQU   ISTRSW
RLXRSV03 EQU   ISTRLX+80
RLXRSV02 EQU   ISTRLX+77
RLXRSV01 EQU   RLXFLAGA
RLXINUSE EQU   RLXFLAGA
RLXNLUX  EQU   ISTRLX+72
RLXPRE   EQU   ISTRLX
RPXRSV01 EQU   ISTRPX+80
RPXRSV02 EQU   ISTRPX+77
RPXMAXLU EQU   ISTRPX+76
RPXFLUX  EQU   ISTRPX+72
RPXPRE   EQU   ISTRPX
RLURSV02 EQU   ISTRLU+172
RLULGMOD EQU   ISTRLU+164
RLUMODEP EQU   RLUMODET+8
RLUMODEN EQU   RLUMODET
RLUUSSPT EQU   RLUUSSTB+8
RLUUSSNM EQU   RLUUSSTB
RLURSV01 EQU   ISTRLU+137
RLULOCAD EQU   ISTRLU+136
RLUNCPPM EQU   RLUNCPPC+1
RLUNCPPN EQU   RLUNCPPC
RLUINTA  EQU   ISTRLU+128
RLUSSCFM EQU   ISTRLU+127
RLUCRRSV EQU   RLUCRFLG
RLUACTLU EQU   RLUCRFLG
RLURSV00 EQU   RLUFLAG
RLUNDSES EQU   RLUFLAG
RLUGSTAT EQU   RLUFLAG
RLUBATCH EQU   RLUFLAG
RLURBISA EQU   RLUFLAG
RLUTYPE  EQU   ISTRLU+124
RLUCRPR  EQU   ISTRLU
RCCRVPT2 EQU   ISTRCC+144
RCCXTOSW EQU   ISTRCC+140
RCCSWTOX EQU   ISTRCC+136
RCCRSPT2 EQU   ISTRCC+133
RCCADDR  EQU   ISTRCC+132
RCCPASSL EQU   ISTRCC+131
RCCMXOUT EQU   ISTRCC+130
RCCMXDAT EQU   ISTRCC+128
RCCINDEX EQU   ISTRCC+126
RCCPATHZ EQU   ISTRCC+124
RCCPATHT EQU   ISTRCC+120
RCCDPQ   EQU   ISTRCC+116
RCCTPAB  EQU   ISTRCC+112
RCCRSV02 EQU   ISTRCC+109
RCCCRRSV EQU   RCCCRFLG
RCCCTCFL EQU   RCCCRFLG
RCCACTPU EQU   RCCCRFLG
RCCNCSPL EQU   ISTRCC+104
RCCRPHCN EQU   ISTRCC+100
RCCEPAB  EQU   ISTRCC+96
RCCDPAB  EQU   ISTRCC+92
RCCVPAB  EQU   ISTRCC+88
@NM00058 EQU   ISTRCC+87
RCCSESCT EQU   ISTRCC+86
RCCIDNUM EQU   RCCID48+3
RCCIDBLK EQU   RCCID48+2
RCCIDPA2 EQU   RCCID48+1
RCCIDPUT EQU   RCCID48
RCCIDPA1 EQU   RCCSTAID
RCCCTELU EQU   ISTRCC+76
RCCCNCNT EQU   ISTRCC+75
RCCRTGOH EQU   RCCFLAGB
RCCBRKCN EQU   RCCFLAGB
RCCRESET EQU   RCCFLAGB
RCCFINAL EQU   RCCFLAGB
RCCBNNSP EQU   RCCFLAGB
RCCIRETR EQU   RCCFLAGB
RCCDIALP EQU   RCCFLAGB
RCCDSTCT EQU   RCCFLAGB
RCCCTPGD EQU   RCCFLAG
RCCPRGDN EQU   RCCFLAG
RCCOUERP EQU   RCCFLAG
RCCOHIMM EQU   RCCFLAG
RCCLDISC EQU   RCCFLAG
RCCERPIP EQU   RCCFLAG
RCCCUDIE EQU   RCCFLAG
RCCRBISA EQU   RCCFLAG
RCCTYPE  EQU   ISTRCC+72
RCCPRE   EQU   ISTRCC
DOTADTRM EQU   ISTDOT
RDSADDOT EQU   ISTRDS+76
RDSCTATR EQU   ISTRDS+74
RDSCTTRM EQU   ISTRDS+72
RDSPRE   EQU   ISTRDS
RINRSV05 EQU   ISTRIN+156
RINRSV04 EQU   ISTRIN+152
RINLOCRN EQU   ISTRIN+148
RINRSV02 EQU   ISTRIN+145
RTRCNCNT EQU   RINCNCNT
RTRNCSPL EQU   RINNCSPL
RTRRPHCN EQU   RINRPHCN
RTRVPAB  EQU   RINVPAB
RTRREMOT EQU   RINREMOT
RTRRLDAF EQU   RINRLDAF
RTRNODID EQU   RINNODID
RINRSV01 EQU   RINDFD
RTRLDISC EQU   RINLDISC
RTRNODEF EQU   RINNODEF
RTRREMPO EQU   RINREMPO
RINCRPRE EQU   ISTRIN
RTRRSV04 EQU   ISTRTR+210
RTRLCTI  EQU   ISTRTR+209
RTRIDCAS EQU   RTRBSCID+1
RTRIDLEN EQU   RTRBSCID
RTRRSVDD EQU   ISTRTR+181
RTRRDFG  EQU   ISTRTR+180
RTRDIAA  EQU   ISTRTR+176
RTRPOLA  EQU   ISTRTR+172
RTRCADDR EQU   ISTRTR+164
RTRCTADR EQU   ISTRTR+162
RTRCTPOL EQU   ISTRTR+160
RTRCTDIA EQU   ISTRTR+158
RTRRSV03 EQU   ISTRTR+156
RTRRVPT1 EQU   ISTRTR+152
RTRBHSN1 EQU   ISTRTR+144
RTRCRSV2 EQU   RTRCRFLG
RTRDTRLM EQU   RTRLSCMD
RTRCRSV1 EQU   RTRCRFLG
RTRTRMAX EQU   ISTRTR+142
RTRRSV24 EQU   RTRRDFF
RTRRFDEK EQU   RTRRDFF
RTRRFANK EQU   RTRRDFF
RTRRFPFK EQU   RTRRDFF
RTRRFPEN EQU   RTRRDFF
RTRRFXCT EQU   RTRRDFF
RTRRESCT EQU   RTRRDFE
RTRRESUP EQU   RTRRDFE
RTRREATT EQU   RTRRDFE
RTRRECHK EQU   RTRRDFE
RTRREACR EQU   RTRRDFE
RTRRSV0A EQU   RTRRDFE
RTRREBRK EQU   RTRRDFE
RTRRSV11 EQU   RTRRDFD
RTRRSV10 EQU   RTRRDFD
RTRRDBHI EQU   RTRRDFD
RTRRDBHD EQU   RTRRDFD
RTRRDBHN EQU   RTRRDFD
RTRRSV23 EQU   RTRRDFC
RTRRCXMS EQU   RTRRDFC
RTRRCMSG EQU   RTRRDFC
RTRRCBLK EQU   RTRRDFC
RTRRCPT3 EQU   RTRRDFC
RTRRCIT2 EQU   RTRRDFC
RTRRCIT1 EQU   RTRRDFC
RTRRSV32 EQU   RTRRDFB
RTRRBEND EQU   RTRRDFB
RTRRBECT EQU   RTRRDFB
RTRRSV02 EQU   RTRRDFA
RTRRACTR EQU   RTRRDFA
RTRRSV60 EQU   RTRRDFA
RTRRACDT EQU   RTRRDFA
RTRRAPT3 EQU   RTRRAALL
RTRRAPT2 EQU   RTRRAALL
RTRRAPT1 EQU   RTRRAALL
RTRRAATN EQU   RTRRDFA
RTRRSV45 EQU   ISTRTR+132
RTRRSV01 EQU   ISTRTR+130
RTRCTECM EQU   ISTRTR+128
RTRADRPT EQU   RTRADR+1
RTRRSV22 EQU   RTRFLAG
RTRVTERM EQU   RTRFLAG
RTRRSV51 EQU   RTRFLAG
RTRRBISA EQU   RTRFLAG
RTRRSV21 EQU   RTRFLAG
RTRCRPR  EQU   ISTRTR
RCLRVPT2 EQU   ISTRCL+92
RCLRVPT1 EQU   ISTRCL+88
RCLGPOLA EQU   ISTRCL+84
RCLCTNGP EQU   ISTRCL+82
RCLRSV01 EQU   ISTRCL+80
RCLCTECM EQU   ISTRCL+78
RCLCTETR EQU   ISTRCL+76
RCLGPADR EQU   RCLADR+1
RCLRSV33 EQU   RCLFLAG
RCLBATCH EQU   RCLFLAG
RCLRBISA EQU   RCLFLAG
RCLRSV22 EQU   RCLFLAG
RCLPRE   EQU   ISTRCL
RPTRSV03 EQU   ISTRPT+156
RPTRSV02 EQU   ISTRPT+152
RPTNSNSV EQU   ISTRPT+148
RPTPTHCT EQU   ISTRPT+146
RPTPEPCT EQU   ISTRPT+144
RPTDAFSV EQU   ISTRPT+142
RPTRSV01 EQU   ISTRPT+141
RPTISTAT EQU   RPTFLAG1
RPTDYNAM EQU   RPTFLAG1
RPTVYIMM EQU   RPTFLAG1
RPTVIODN EQU   RPTFLAG1
RPTONLIN EQU   RPTFLAG1
RPTHLVPD EQU   RPTFLAG1
RPTVRYPD EQU   RPTFLAG1
RPTASLEP EQU   RPTFLAG1
RPTUTERM EQU   ISTRPT+136
RPTATERM EQU   ISTRPT+132
RPTDIVT  EQU   RPTDITT
RPTCTNM  EQU   ISTRPT+120
RPTLNDAF EQU   RPTLNCID+2
RPTLNSAF EQU   RPTLNCID
RPTLN    EQU   ISTRPT
RLNRVPT2 EQU   ISTRLN+112
RLNNCSPL EQU   ISTRLN+108
RLNX2SW  EQU   ISTRLN+104
@NM00057 EQU   ISTRLN+103
RLNCRRSV EQU   RLNCRFLG
RLNSWEP  EQU   RLNCRFLG
RLNSVSKP EQU   RLNLSCMD
RLNSESLM EQU   RLNLSCMD
RLNNPRLM EQU   RLNLSCMD
RLNSWNCP EQU   RLNCRFLG
RLNACTLN EQU   RLNCRFLG
RLNPAUSE EQU   ISTRLN+101
RLNPOLMT EQU   ISTRLN+100
RLNACTSN EQU   ISTRLN+98
RLNRESV1 EQU   ISTRLN+97
RLNACTRM EQU   ISTRLN+96
RLNCTSES EQU   ISTRLN+95
RLNRDSLM EQU   ISTRLN+94
RLNAUTOA EQU   ISTRLN+92
RLNRDFD  EQU   RLNRDF+3
RLNRDFC  EQU   RLNRDF+2
RLNMULTP EQU   RLNRDFB
RLNRATRN EQU   RLNRDFB
RLNRAPOL EQU   RLNRDFB
RLNTTV   EQU   RLNRDFB
RLNRSV0B EQU   RLNRDFB
RLNAUTOD EQU   RLNRDFB
RLNANSWR EQU   RLNRDFB
RLNRBUSE EQU   RLNRDFB
RLNRAPEP EQU   RLNRDFA
RLNRANCP EQU   RLNRDFA
RLNRAEP  EQU   RLNRDFA
RLNIDV   EQU   RLNRDFA
RLNGANSW EQU   RLNRDFA
RLNRACAN EQU   RLNRACNT
RLNRACAT EQU   RLNRACNT
RLNRSV04 EQU   RLNSTAT2
RLNINUSE EQU   RLNSTAT2
RLNOHIN  EQU   RLNSTAT2
RLNRSV03 EQU   RLNSTAT1
RLNVD    EQU   RLNSTAT1
RLNINOPP EQU   RLNSTAT1
RLNINOPL EQU   RLNSTAT1
RLNLRST  EQU   RLNSTAT1
RLNTRAP  EQU   RLNSTAT1
RLNACTCT EQU   ISTRLN+84
RLNCTECM EQU   ISTRLN+82
RLNCTEIN EQU   ISTRLN+80
RLNCTETR EQU   ISTRLN+78
RLNCTECL EQU   ISTRLN+76
RLNCUA   EQU   RLNUCBAD
RLNRSV01 EQU   RLNFLAG
RLNRBISA EQU   RLNFLAG
RLNEAM   EQU   RLNFLAG
RLNPRE   EQU   ISTRLN
RGPRVPT2 EQU   ISTRGP+88
RGPRVPT1 EQU   ISTRGP+84
RGPCTECM EQU   ISTRGP+82
RGPCTEIN EQU   ISTRGP+80
RGPCTETR EQU   ISTRGP+78
RGPCTECL EQU   ISTRGP+76
RGPCTELN EQU   ISTRGP+74
RGPRSV03 EQU   ISTRGP+73
RGPRSV02 EQU   RGPFLG
RGPASDLC EQU   RGPFLG
RGPABSC  EQU   RGPFLG
RGPASS   EQU   RGPFLG
RGPADIL  EQU   RGPFLG
RGPPRE   EQU   ISTRGP
RRNRINNM EQU   ISTRRN+248
@NM00056 EQU   ISTRRN+247
RRNRDCUA EQU   ISTRRN+244
RRNLASTE EQU   ISTRRN+240
RRNNCSPL EQU   ISTRRN+236
RRNRPLPT EQU   ISTRRN+232
RRNMSIZE EQU   ISTRRN+228
RRNNCPNM EQU   ISTRRN+221
RRNCTPCC EQU   ISTRRN+220
RRNHBUFS EQU   ISTRRN+218
RRNHLENT EQU   RRNHPRE+1
RRNHLENH EQU   RRNHPRE
RRNNMNCP EQU   ISTRRN+208
RRNDELAY EQU   ISTRRN+206
RRNRSV04 EQU   ISTRRN+200
RRNRSV88 EQU   RRNNMDPD+7
RRNPUBI  EQU   RRNNMDPD+6
RRNDPLUB EQU   RRNNMDPD
RRNEPADR EQU   ISTRRN+190
RRNCPLUB EQU   ISTRRN+184
RRNFLUX  EQU   ISTRRN+180
RRNRSV05 EQU   RRNCMFD
RRNREMPO EQU   RRNCMFD
RRNCDREC EQU   RRNCMFD
RRNCDDSI EQU   RRNCMFD
RRNCDBCK EQU   RRNCMFD
RRNCDDTL EQU   RRNCMFD
RRNCDSTD EQU   RRNCMFD
RRNCDCSP EQU   RRNCMFD
RRNCCCSL EQU   RRNCMFC
RRNCCSIM EQU   RRNCMFC
RRNCCRCM EQU   RRNCMFC
RRNCCRIM EQU   RRNCMFC
RRNCCCRC EQU   RRNCMFC
RRNCCRST EQU   RRNCMFC
RRNCCRDQ EQU   RRNCMFC
RRNCCRCN EQU   RRNCMFC
RRNCBALT EQU   RRNCMFB
RRNCBMOD EQU   RRNCMFB
RRNCBNPL EQU   RRNCMFB
RRNCBRLS EQU   RRNCMFB
RRNCBRDS EQU   RRNCMFB
RRNCBDLR EQU   RRNCMFB
RRNCBDLH EQU   RRNCMFB
RRNCBDLO EQU   RRNCMFB
RRNCADGO EQU   RRNCMFA
RRNCADTD EQU   RRNCMFA
RRNCACDT EQU   RRNCMFA
RRNCAMBH EQU   RRNCMFA
RRNCAATI EQU   RRNCMFA
RRNCAATG EQU   RRNCMFA
RRNCAATD EQU   RRNCMFA
RRNCAALL EQU   RRNCMFA
RRNRSV55 EQU   RRNRDF+3
RRNPTASL EQU   RRNRDFB+1
RRNRSV01 EQU   RRNRDFB+1
RRNVYDON EQU   RRNRDFB+1
RRNRBBUP EQU   RRNRDFB+1
RRNRSV03 EQU   RRNRDFB
RRNRBCT2 EQU   RRNRDFB
RRNRBCT1 EQU   RRNRDFB
RRNRBSEC EQU   RRNRDFB
RRNRBCCT EQU   RRNRDFB
RRNRBCCL EQU   RRNRDFB
RRNRSV02 EQU   RRNRDFB
RRNRBMDL EQU   RRNRDFB
RRNRAPEP EQU   RRNRDFA
RRNRANCP EQU   RRNRDFA
RRNRBREM EQU   RRNRDFA
RRNRAOLT EQU   RRNRDFA
RRNRASYN EQU   RRNRDFA
RRNRADMP EQU   RRNRDFA
RRNRAIPL EQU   RRNRDFA
RRNRASHT EQU   RRNRDFA
RRNCTENT EQU   ISTRRN+170
RRNCTECM EQU   ISTRRN+168
RRNCTEIN EQU   ISTRRN+166
RRNCTETR EQU   ISTRRN+164
RRNCTECL EQU   ISTRRN+162
RRNCTELI EQU   ISTRRN+160
RRNCTEGP EQU   ISTRRN+158
RRNCTBHS EQU   ISTRRN+156
RRNBHSET EQU   ISTRRN+152
RRNRLDIP EQU   ISTRRN+147
RRNGRPA  EQU   ISTRRN+140
RRNLUBA  EQU   RRNUCBAD+1
RRNCHQI  EQU   RRNUCBAD
RRNRSV11 EQU   RRNFLAG
RRNDSTCT EQU   RRNFLAG
RRNERPIP EQU   RRNFLAG
RRNLCDIP EQU   RRNFLAG
RRNLCDIE EQU   RRNFLAG
RRNLCSIP EQU   RRNFLAG
RRNRBISA EQU   RRNFLAG
RRNRSV89 EQU   RRNFLAG
RRNPRE   EQU   ISTRRN
RLCRVPT2 EQU   ISTRLC+80
RLCRVPT1 EQU   ISTRLC+79
RLCUCBAD EQU   RLCADR+1
RLCRSVDE EQU   RLCFLAG
RLCACNT  EQU   RLCFLAG
RLCRSV14 EQU   RLCFLAG
RLCRBISA EQU   RLCFLAG
RLCRSV22 EQU   RLCFLAG
RLCPRE   EQU   ISTRLC
RAPRVPT2 EQU   ISTRAP+116
RAPRVPT1 EQU   ISTRAP+112
RAPRSV17 EQU   RAPFLGC
RAPRSV16 EQU   RAPFLGC
RAPRSV15 EQU   RAPFLGC
RAPRSV14 EQU   RAPFLGC
RAPRSV13 EQU   RAPFLGC
RAPRSV12 EQU   RAPFLGC
RAPRSV11 EQU   RAPFLGC
RAPRSV10 EQU   RAPFLGC
RAPASPO  EQU   RAPFLGB
RAPAPPO  EQU   RAPFLGB
RAPAACQ  EQU   RAPFLGB
RAPAPRMT EQU   RAPFLGB
RAPAPASS EQU   RAPFLGB
RAPABLCK EQU   RAPFLGB
RAPRSV06 EQU   RAPFLG
RAPRSV05 EQU   RAPFLG
RAPRSV04 EQU   RAPFLG
RAPRSV03 EQU   RAPFLG
RAPATLGN EQU   RAPFLG
RAPASLGI EQU   RAPFLG
RAPAQUI  EQU   RAPFLG
RAPABLGN EQU   RAPFLG
RAPACEQD EQU   ISTRAP+106
RAPTRPRE EQU   ISTRAP+104
RAPACEAP EQU   ISTRAP+100
RAPICEAQ EQU   ISTRAP+96
RAPICEAC EQU   ISTRAP+92
RAPICELG EQU   ISTRAP+88
RAPAPPWD EQU   ISTRAP+80
RAPACBA  EQU   ISTRAP+72
RAPPRE   EQU   ISTRAP
RDTVSRPL EQU   ISTRDT+132
RDTCRSPW EQU   ISTRDT+124
RDTCRSDS EQU   ISTRDT+116
@NM00055 EQU   ISTRDT+113
RRNSTCNT EQU   RDTSTCNT
RRNVYRPH EQU   RDTVYRPH
RDTTPAB  EQU   ISTRDT+104
RDTDPAB  EQU   ISTRDT+100
RDTEPAB  EQU   ISTRDT+96
RDTVPAB  EQU   ISTRDT+92
RDTRSV01 EQU   RDTFLAGB
RDTBHSET EQU   RDTFLAGB
RDTCTCFL EQU   RDTFLAGB
RDTCTPGD EQU   RDTFLAGB
RDTPRGDN EQU   RDTFLAGB
RDTOUERP EQU   RDTFLAGB
RDTLGCT  EQU   ISTRDT+90
RDTNODID EQU   ISTRDT+89
RDTMAXID EQU   ISTRDT+88
RDTCTSNT EQU   ISTRDT+86
RDTFLAGS EQU   ISTRDT+84
RDTBACK  EQU   ISTRDT+80
RDTFORW  EQU   ISTRDT+76
RDTLEN   EQU   RDTPLEN+1
RDTPRILS EQU   RDTPRIOR
RDTPRISW EQU   RDTPRIOR
RDTPRIRN EQU   RDTPRIOR
RDTPRILC EQU   RDTPRIOR
RDTPRIAP EQU   RDTPRIOR
@NM00054 EQU   RDTPRIOR
RDTPRE   EQU   ISTRDT
RCPRSV05 EQU   ISTRCPRE+120
RCPRSV04 EQU   ISTRCPRE+116
RCPRSV03 EQU   ISTRCPRE+112
RCPINTA  EQU   RCPLGNIN+16
RCPLGNCT EQU   RCPLGNIN+8
RCPLGNAP EQU   RCPLGNIN
@NM00053 EQU   RCPPMODE
RCPBHSI1 EQU   ISTRCPRE+88
RCPACETR EQU   ISTRCPRE+84
RCPICEAQ EQU   ISTRCPRE+80
RCPLNAPA EQU   ISTRCPRE+76
RCPICELN EQU   ISTRCPRE+72
RCPPRE   EQU   ISTRCPRE
RPRCONID EQU   ISTRPRE+63
RPRCLVPD EQU   RPRFLAGC
RPRINIMM EQU   RPRFLAGD
RPRRSV05 EQU   RPRFLAGD
RPRCONP  EQU   RPRFLAGD
RPRACTP  EQU   RPRFLAGD
RPRRSON  EQU   RPRFLAGD
RPRCONCT EQU   RPRFLAGD
RPRLTASN EQU   RPRFLAGD
RPRPTHCT EQU   ISTRPRE+60
RPRSTPCT EQU   ISTRPRE+56
RPRRVPT1 EQU   ISTRPRE+52
RPRLGONB EQU   ISTRPRE+32
RPRLGONF EQU   ISTRPRE+28
RPRTIOCT EQU   ISTRPRE+26
RPRPEPCT EQU   ISTRPRE+24
RPRRSV03 EQU   RPRCAUSE
RPRRSYNC EQU   RPRCAUSE
RPRCRCPT EQU   RPRCAUSE
RPRNOSRT EQU   RPRCAUSE
RPRINTST EQU   RPRFLAGB
RPRVYIMM EQU   RPRFLAGB
RPRONLIN EQU   RPRFLAGB
RPRVIODN EQU   RPRFLAGB
RPRENTVT EQU   RPRFLAGB
RPRENTVH EQU   RPRFLAGB
RPRLIVE  EQU   RPRFLAGA
RPRTIED  EQU   RPRFLAGA
RPRINV   EQU   RPRFLAGA
RPRPELEN EQU   ISTRPRE+18
RPRRLOCK EQU   ISTRPRE+12
RPRSAF   EQU   RPRCOMID
RPRNAME  EQU   ISTRPRE
ACDREFQ  EQU   ISTACDEB+204
ACDASFQ  EQU   ISTACDEB+200
ACDSOP   EQU   ISTACDEB+184
ACDRSV24 EQU   ACDVTAM+108
ACDRSV23 EQU   ACDVTAM+104
ACDRSV22 EQU   ACDVTAM+100
ACDOCWAD EQU   ACDVTAM+96
ACDRSV10 EQU   ACDVTAM+92
ACDAPDDT EQU   ACDAPDAT+1
ACDAPDLN EQU   ACDAPDAT
ACDRSV07 EQU   ACDVTAM+82
ACDRSV06 EQU   ACDVTAM+81
@NM00052 EQU   ACDSSFLG
ACDTSO   EQU   ACDSSFLG
ACDTPEND EQU   ACDSSFLG
ACDAICLS EQU   ACDSSFLG
ACDABEND EQU   ACDSSFLG
ACDCACB  EQU   ACDSSFLG
ACDRSV21 EQU   ACDVTAM+64
ACDSSPAB EQU   ACDVTAM+48
ACDNEPAB EQU   ACDVTAM+32
ACDRSV20 EQU   ACDVTAM+20
ACDRARQ  EQU   ACDVTAM+16
ACDRAFQ  EQU   ACDVTAM+12
ACDRDTE  EQU   ACDVTAM+4
ACDAPP   EQU   ACDAPPAD+1
ACDEXSCL EQU   ACDAPPAD
ACDACB   EQU   ACDACBAD+1
ACDDEBID EQU   ACDACBAD
ACDPROTG EQU   ACDACBAD
ACDECBAD EQU   ACDBASIC+20
ACDUSRPB EQU   ACDUSRPG+1
ACDNMEXT EQU   ACDUSRPG
ACDPRLEN EQU   ACDBASIC+15
ACDFLGS1 EQU   ACDBASIC+14
ACDQSCNT EQU   ACDBASIC+13
ACDOPATB EQU   ACDBASIC+12
ACDIRBAD EQU   ACDBASIC+8
ACDDEB   EQU   ACDDEBAD+1
ACDAMLNG EQU   ACDDEBAD
ACDTCB   EQU   ACDTCBAD+1
ACDOPNAD EQU   ACDNMSUB
ACDRSV03 EQU   ACDTBLOF+1
ACDRSV02 EQU   ACDTBLOF
ACDAMTYP EQU   ACDDBPFX+5
ACDLENG  EQU   ACDDBPFX+4
ACDDEBX  EQU   ACDDBPFX
ACDRSV08 EQU   ACDVTPRX+12
ACDCHN   EQU   ACDVTPRX+4
ACDSAF   EQU   ACDVTPRX+2
ACDLNGTH EQU   ACDVTPRX+1
ACDTYPE  EQU   ACDVTPRX
LOKXCL   EQU   @NM00050
LOKPRY   EQU   @NM00050
@NM00051 EQU   @NM00050
@NM00049 EQU   LOKCHNG
LOKCT    EQU   ISTLOK
PABRPHA  EQU   PABRPHFG+1
PABERLOK EQU   PABERRLK
PABSSN   EQU   PABFLAGS
PABDYNAM EQU   PABFLAGS
PABNORPR EQU   PABFLAGS
PABPRIOR EQU   PABFLAGS
PABAPYP  EQU   PABFLAGS
PABCHNGP EQU   PABCHAIN+1
PABRSV02 EQU   PABCHAIN
PABDELAY EQU   PABCHAIN
PABRUNNG EQU   PABCHAIN
PABRESET EQU   PABCHAIN
PABUNCON EQU   PABCHAIN
PABCDP   EQU   PABCHAIN
PABRESCH EQU   PABCHAIN
PABCHNG  EQU   PABCHAIN
PABWEQP  EQU   PABWEQA+1
PABRSV01 EQU   PABWEQA
PABWEQG  EQU   PABWEQA
OCWEND   EQU   ISTOCW+848
@NM00048 EQU   OCWFLG1
OCWEXIT  EQU   OCWFLG1
OCWSENSE EQU   ISTOCW+843
OCWBNDSZ EQU   ISTOCW+841
OCWBINDD EQU   OCWBIND+37
OCWBINDA EQU   OCWBIND+1
OCWBINDC EQU   OCWBIND
OCWSHPLC EQU   OCWSHPL+8
OCWSHPLB EQU   OCWSHPL+4
OCWSHPLA EQU   OCWSHPL
OCWBNDRU EQU   ISTOCW+780
OCWELCP  EQU   ISTOCW+776
OCWRSV12 EQU   ISTOCW+772
OCWRSV11 EQU   ISTOCW+768
OCWODOA  EQU   ISTOCW+764
OCWSCHIO EQU   OCWIOCNT
OCWCCRPH EQU   ISTOCW+752
OCWPABCT EQU   ISTOCW+748
OCWSAF   EQU   OCWCID
OCWNMLLN EQU   ISTOCW+742
OCWRSV0A EQU   ISTOCW+741
OCWRSV82 EQU   OCWLOCKS
OCWMLOCK EQU   OCWLOCKS
OCWALOCK EQU   OCWLOCKS
OCWDLOCK EQU   OCWLOCKS
OCWELOCK EQU   OCWLOCKS
OCWRLOCK EQU   OCWLOCKS
OCWVLOCK EQU   OCWLOCKS
OCWACE   EQU   ISTOCW+736
OCWIOMIN EQU   ISTOCW+735
OCWIOMAJ EQU   ISTOCW+734
OCWRSV03 EQU   ISTOCW+732
OCWSWTE7 EQU   OCWSWTE
OCWSWTE6 EQU   OCWSWTE
OCWSWTE5 EQU   OCWSWTE
OCWSWTE4 EQU   OCWSWTE
OCWSWTE3 EQU   OCWSWTE
OCWSWTE2 EQU   OCWSWTE
OCWLCPBC EQU   OCWSWTE
OCWSKEL  EQU   OCWSWTE
OCWSWTR7 EQU   OCWSWTRD
OCWSWTR6 EQU   OCWSWTRD
OCWSWTR5 EQU   OCWSWTRD
OCWDPDVT EQU   OCWSWTRD
OCWEPTLP EQU   OCWSWTRD
OCWCPARE EQU   OCWSWTRD
OCWCLEN  EQU   OCWSWTRD
OCWSRDVT EQU   OCWSWTRD
OCWCLCD2 EQU   ISTOCW+728
OCWCLCD1 EQU   ISTOCW+726
OCWLALEN EQU   ISTOCW+724
OCWSDVTA EQU   ISTOCW+720
OCWOENIB EQU   ISTOCW+716
OCWSORTP EQU   ISTOCW+712
OCWMDVT  EQU   ISTOCW+708
OCWSDVT  EQU   ISTOCW+704
OCWPREV  EQU   ISTOCW+700
OCWLCPBA EQU   ISTOCW+696
OCWR14SV EQU   ISTOCW+624
OCWSAVE5 EQU   ISTOCW+552
OCWSAVE4 EQU   ISTOCW+480
OCWSAVE3 EQU   ISTOCW+408
OCWSAVE2 EQU   ISTOCW+336
OCWSAVE1 EQU   ISTOCW+264
OCWCSPL  EQU   ISTOCW+224
OCWRSVD  EQU   ISTOCW+212
OCWVPAB  EQU   ISTOCW+208
OCWSWTD7 EQU   OCWSWTD
OCWSWTD6 EQU   OCWSWTD
OCWSWTD5 EQU   OCWSWTD
OCWSWTD4 EQU   OCWSWTD
OCWPGDON EQU   OCWSWTD
OCWSTCTL EQU   OCWSWTD
OCWNPOST EQU   OCWSWTD
OCWCLDEB EQU   OCWSWTD
OCWVARY  EQU   OCWSWTC
OCWPRMTR EQU   OCWSWTC
OCWPBH   EQU   OCWSWTC
OCWRBH   EQU   OCWSWTC
OCWCKACE EQU   OCWSWTC
OCWODCLS EQU   OCWSWTC
OCWSWTC1 EQU   OCWSWTC
OCWSPCLS EQU   OCWSWTC
OCWCSCAL EQU   OCWSWTB
OCWPSREQ EQU   OCWSWTB
OCWOLOCK EQU   OCWSWTB
OCWCOREQ EQU   OCWSWTB
OCWDOPHY EQU   OCWSWTB
OCWCLOOP EQU   OCWSWTB
OCWRECL  EQU   OCWSWTB
OCWGOFUN EQU   OCWSWTB
OCWNODLT EQU   OCWSWTA
OCWODCL  EQU   OCWSWTA
OCWGODST EQU   OCWSWTA
OCWSORT  EQU   OCWSWTA
OCWGOCNT EQU   OCWSWTA
OCWNOCON EQU   OCWSWTA
OCWSRT   EQU   OCWSWTA
OCWGTLST EQU   OCWSWTA
OCWBADNO EQU   ISTOCW+110
OCWDSTNO EQU   ISTOCW+108
OCWODCT2 EQU   ISTOCW+106
OCWODCT1 EQU   ISTOCW+104
OCWRSV02 EQU   ISTOCW+100
OCWRSV01 EQU   ISTOCW+96
OCWSVEC  EQU   OCWSVCOD+1
OCWSVRC  EQU   OCWSVCOD
OCWODFST EQU   ISTOCW+88
OCWODNAS EQU   ISTOCW+84
OCWODLST EQU   ISTOCW+80
OCWLPOST EQU   ISTOCW+76
OCWCPOST EQU   ISTOCW+72
OCWFPOST EQU   ISTOCW+68
OCWNIB   EQU   ISTOCW+44
OCWDRHOB EQU   OCWDRDTE
OCWCSL   EQU   ISTOCW+28
OCWPAB   EQU   ISTOCW+20
OCWRPH   EQU   ISTOCW+16
OCWCHAIN EQU   ISTOCW+8
OCWPBCHN EQU   ISTOCW+4
OCWTLEN  EQU   ISTOCW+2
OCWID    EQU   ISTOCW
CSLDATAF EQU   CSLDATA
CSLNIBF  EQU   CSLNIB
CSLRDTEF EQU   CSLRDTE
BINUSE   EQU   ISTBIND+36
BINUSEL  EQU   ISTBIND+35
BINPRIM  EQU   ISTBIND+27
BINPRIML EQU   ISTBIND+26
BINRSV05 EQU   ISTBIND+25
BINLUTYP EQU   BINLUP
BINRSV27 EQU   BINLUP
BINRSV08 EQU   BINTSU+4
BINPRUSE EQU   BINPRUSZ
BINPRUSM EQU   BINPRUSZ
BINSRUSE EQU   BINSRUSZ
BINSRUSM EQU   BINSRUSZ
BINRPACM EQU   BINRPACE
BINRSV07 EQU   BINRPACE
BINRSV06 EQU   BINTSU
BINCONR  EQU   BINCMNP2
BINRCHN  EQU   BINCMNP2
BINMDIBK EQU   BINCMNP2
BINBKFS  EQU   BINCMNP2
BINRCVR  EQU   BINCMNP2
BINFMTRM EQU   BINCMNP2
BINRSV04 EQU   BINCMNP
BINALT   EQU   BINCMNP
BINBKTR  EQU   BINCMNP
BINBRAK  EQU   BINCMNP
BINFMHD  EQU   BINCMNP
BINRSV03 EQU   BINCMNP
BINSSEB  EQU   BINSECP
BINSCMP  EQU   BINSECP
BINRSV02 EQU   BINSECP
BINSCHNR EQU   BINSECP
BINSMCH  EQU   BINSECP
BINSCHN  EQU   BINSECP
BINPSEB  EQU   BINPRIP
BINPCMP  EQU   BINPRIP
BINRSV01 EQU   BINPRIP
BINPCHNR EQU   BINPRIP
BINPMCH  EQU   BINPRIP
BINPCHN  EQU   BINPRIP
BINTS    EQU   ISTBIND+2
BINFM    EQU   ISTBIND+1
BINTYPE  EQU   BINFMTY
BINFMT   EQU   BINFMTY
CSPUNUSD EQU   CSPRSC2B+4
CSPUECBA EQU   CSPRSC2B
CSPTRDTE EQU   ISTCSP+28
CSPRLRPH EQU   ISTCSP+24
CSPNO    EQU   ISTCSP+22
CSPCC    EQU   ISTCSP+20
CSPDATA  EQU   ISTCSP+16
CSPRSCE  EQU   ISTCSP+12
CSPDEST  EQU   ISTCSP+8
CSPSRC   EQU   ISTCSP+4
@NM00047 EQU   CSPOPT2
CSPRSC2F EQU   CSPOPT2
CSPWASQD EQU   CSPOPT2
CSPACQS  EQU   CSPOPT2
CSPACES  EQU   CSPOPT2
CSPNOREL EQU   CSPOPT2
CSPCOREQ EQU   CSPOPT2
CSPSTAP  EQU   CSPOPT2
@NM00046 EQU   CSPOPT1
CSPANY   EQU   CSPOPT1
CSPACT   EQU   CSPOPT1
CSPSESS  EQU   CSPOPT1
CSPPND   EQU   CSPOPT1
CSPLOGI  EQU   CSPOPT1
CSPQ     EQU   CSPOPT1
CSPRSC   EQU   CSPOPT1
CSPIDX   EQU   ISTCSP
NIBRESV  EQU   ISTNIB+60
NIBNDAR  EQU   ISTNIB+56
NIBLMODE EQU   ISTNIB+48
@NM00045 EQU   ISTNIB+41
@NM00044 EQU   NIBFLG1
@NM00043 EQU   NIBFLG1
@NM00042 EQU   NIBFLG1
@NM00041 EQU   NIBFLG1
NIBSHLTP EQU   NIBFLG1
NIBSDAPP EQU   NIBFLG1
NIBCON   EQU   NIBFLG1
NIBLAST  EQU   NIBFLG1
NIBPROCD EQU   ISTNIB+36
NIBDEVCH EQU   ISTNIB+28
NIBSYM   EQU   ISTNIB+12
NIBCID   EQU   ISTNIB+4
NIBLEN   EQU   ISTNIB+3
NIBCONDN EQU   ISTNIB+2
NIBRSV01 EQU   ISTNIB+1
NIBID    EQU   ISTNIB
PROSRDEF EQU   PROSETM4
PRORSV47 EQU   PROSETM4
PROSCON  EQU   PROSETM4
PRORSV46 EQU   PROSETM3
PROSMONT EQU   PROSETM3
PRORSV45 EQU   PROSETM3
PROSNTO  EQU   PROSETM3
PRORSV44 EQU   PROSETM3
PRORSV43 EQU   PROSETM2
PROSNTFL EQU   PROSETM2
PRORSV42 EQU   PROSETM2
PRORSV41 EQU   PROPROCS
PROMODC  EQU   PROPROC4
PROMODT  EQU   PROPROC4
PROMODM  EQU   PROPROC4
PROMODB  EQU   PROPROC4
PRORSV14 EQU   PROPROC4
PRORSV13 EQU   PROPROC4
PRORSV12 EQU   PROPROC4
PROEIB   EQU   PROPROC4
PROMONT3 EQU   PROPROC3
PROMONT2 EQU   PROPROC3
PROMONIT EQU   PROPROC3
PROSUBLK EQU   PROPROC3
PRONTO   EQU   PROPROC3
PROLGIN  EQU   PROPROC3
PROERPI  EQU   PROPROC3
PRORSV07 EQU   PROPROC3
PROCFTX  EQU   PROPROC2
PROEMLC  EQU   PROPROC2
PRONTFL  EQU   PROPROC2
PRORSV05 EQU   PROPROC2
PRORSV04 EQU   PROPROC2
PROLGOT  EQU   PROPROC2
PROERPO  EQU   PROPROC2
PRORSV03 EQU   PROPROC2
PRORPLC  EQU   PROPROC1
PROCS    EQU   PROPROC1
PROCA    EQU   PROPROC1
PRORESPX EQU   PROPROC1
PRODFASY EQU   PROPROC1
PROXPOPT EQU   PROPROC1
PROTRUNC EQU   PROPROC1
PROASYIP EQU   PROPROC1
DEVRSV03 EQU   ISTDEVCH+5
DEVPHYSA EQU   ISTDEVCH+4
DEVCSLPN EQU   DEVCHAR3
DEVCSTCL EQU   DEVCHAR3
DEVCCHEK EQU   DEVCHAR3
DEVCATTN EQU   DEVCHAR3
DEVCSWL  EQU   DEVFCCTL
DEVCRVB  EQU   DEVFCCTL
DEVCSSL  EQU   DEVFCCTL
DEVCBSC  EQU   DEVFCCTL
DEVMCODE EQU   ISTDEVCH+2
DEVCHAR2 EQU   DEVTCODE
DEVRSV01 EQU   DEVCHAR
DEVCCTL  EQU   DEVCHAR
DEVNNSPT EQU   DEVCHAR
DEVSPS   EQU   DEVCHAR
DEVCONVR EQU   DEVCHAR
DEVOTPUT EQU   DEVCHAR
DEVINPUT EQU   DEVCHAR
RPHNEXPO EQU   ISTRPH+104
RPHSAV16 EQU   RPHWORK+60
RPHSAV15 EQU   RPHWORK+56
RPHSAV14 EQU   RPHWORK+52
RPHSAV13 EQU   RPHWORK+48
RPHSAV12 EQU   RPHWORK+44
RPHSAV11 EQU   RPHWORK+40
RPHSAV10 EQU   RPHWORK+36
RPHSAVE9 EQU   RPHWORK+32
RPHSAVE8 EQU   RPHWORK+28
RPHSAVE7 EQU   RPHWORK+24
RPHSAVE6 EQU   RPHWORK+20
RPHSAVE5 EQU   RPHWORK+16
RPHSAVE4 EQU   RPHWORK+12
RPHSAVE3 EQU   RPHWORK+8
RPHSAVE2 EQU   RPHWORK+4
RPHSHALF EQU   RPHSAVE1+2
RPHSBIT8 EQU   RPHSBITS
RPHSBIT7 EQU   RPHSBITS
RPHSBIT6 EQU   RPHSBITS
RPHSBIT5 EQU   RPHSBITS
RPHSBIT4 EQU   RPHSBITS
RPHSBIT3 EQU   RPHSBITS
RPHSBIT2 EQU   RPHSBITS
RPHSBIT1 EQU   RPHSBITS
RPHSBYTE EQU   RPHSAVE1
RPHPABQP EQU   RPHPABQA+1
RPHPABFG EQU   RPHPABQA
RPHSRP34 EQU   RPHSRPRM+2
RPHSRP12 EQU   RPHSRPRM
RPHWEGT  EQU   RPHCSPA
RPHMAJCB EQU   ISTRPH+21
RPHPABOF EQU   ISTRPH+20
RPHRESUM EQU   RPHRESMA+1
RPHRSV01 EQU   RPHWPFLG
RPHPURGE EQU   RPHWPFLG
RPHPT    EQU   RPHWPFLG
RPHWT    EQU   RPHWPFLG
RPHRSKEY EQU   RPHWPFLG
RPHTIK   EQU   RPHTSKID+3
@NM00040 EQU   RPHTSKID
RPHRPHAP EQU   RPHRPHA+1
@NM00039 EQU   RPHRPHA
RPHGATE  EQU   RPHRPHA
@NM00038 EQU   RPHFLGB
RPHRLCRA EQU   RPHFLGB
RPHNRSAV EQU   RPHFLGB
RPHPGCMP EQU   RPHFLGB
RPHFBAPS EQU   RPHFLGB
RPHBSSP  EQU   RPHFLGB
RPHLOCK  EQU   RPHFLGB
RPHFNFLG EQU   RPHFSTLC
RPHMLTCP EQU   RPHFLAGS
RPHSMCLR EQU   RPHFLAGS
RPHSMTYP EQU   RPHFLAGS
RPHSMQ   EQU   RPHFLAGS
RPHAUTEX EQU   RPHAPTYP
RPHSPGIN EQU   RPHFLAGS
RPHOGIND EQU   RPHFLAGS
RPHLNGTH EQU   RPHCNTL+1
RPHTYPE  EQU   RPHCNTL
RPLSEQNO EQU   RPLOF60+6
@NM00037 EQU   RPLIBSQ
RPLIINV  EQU   RPLIBSQ
RPLINEG  EQU   RPLIBSQ
RPLIPOS  EQU   RPLIBSQ
RPLIIGN  EQU   RPLIBSQ
RPLIRSET EQU   RPLIBSQ
RPLITST  EQU   RPLIBSQ
RPLISET  EQU   RPLIBSQ
@NM00036 EQU   RPLOBSQ
RPLOINV  EQU   RPLOBSQ
RPLONEG  EQU   RPLOBSQ
RPLOPOS  EQU   RPLOBSQ
RPLOIGN  EQU   RPLOBSQ
RPLORSET EQU   RPLOBSQ
RPLOTST  EQU   RPLOBSQ
RPLOSET  EQU   RPLOBSQ
RPLIBSQV EQU   RPLOF60+2
RPLOBSQV EQU   RPLOF60
@NM00035 EQU   RPLCNTSC
RPLRSHUT EQU   RPLCNTSC
RPLRQR   EQU   RPLCNTSC
RPLSHUTC EQU   RPLCNTSC
RPLSHUTD EQU   RPLCNTSC
RPLSTSN  EQU   RPLCNTSC
RPLCLEAR EQU   RPLCNTSC
RPLSDT   EQU   RPLCNTSC
@NM00034 EQU   RPLCNTDC
RPLSIGNL EQU   RPLCNTDC
RPLLUS   EQU   RPLCNTDC
RPLRTR   EQU   RPLCNTDC
RPLBID   EQU   RPLCNTDC
@NM00033 EQU   RPLCNTDF
RPLQI    EQU   RPLCNTDF
RPLRELQ  EQU   RPLCNTDF
RPLCHASE EQU   RPLCNTDF
RPLQEC   EQU   RPLCNTDF
RPLQC    EQU   RPLCNTDF
RPLCNCEL EQU   RPLCNTDF
RPLDATA  EQU   RPLCNTDF
RPLRRN   EQU   RPLRESP
RPLNFME  EQU   RPLRESP
RPLEX    EQU   RPLRESP
@NM00032 EQU   RPLRESP
@NM00031 EQU   RPLPOSTV
RPLSCHED EQU   RPLPOSTV
@NM00030 EQU   RPLVTFL1
RPLAUTUS EQU   RPLVTFL1
@NM00029 EQU   RPLVTFL1
@NM00028 EQU   RPLCHN
RPLONLY  EQU   RPLCHN
RPLLAST  EQU   RPLCHN
RPLMIDLE EQU   RPLCHN
RPLFIRST EQU   RPLCHN
@NM00027 EQU   RPLRTYPE
RPLDFASY EQU   RPLRTYPE
RPLNFSYN EQU   RPLRTYPE
RPLRRESP EQU   RPLRTYPE
@NM00026 EQU   RPLSTYPE
RPLSRESP EQU   RPLSTYPE
@NM00025 EQU   RPLRH3
RPLCSI   EQU   RPLRH3
RPLCHREQ EQU   RPLRH3
RPLCMD   EQU   RPLRH3
RPLEB    EQU   RPLRH3
RPLBB    EQU   RPLRH3
RPLSIGDA EQU   RPLVTEXT+32
RPLSAV13 EQU   RPLVTEXT+28
RPLUSNSO EQU   RPLOSENS+2
RPLSSMO  EQU   RPLSSNSO+1
@NM00024 EQU   RPLSSEO
RPLRRO   EQU   RPLSSEO
RPLFIO   EQU   RPLSSEO
RPLSTATO EQU   RPLSSEO
RPLCPMO  EQU   RPLSSEO
@NM00023 EQU   RPLSSEO
RPLFMHDR EQU   RPLOPT12
@NM00022 EQU   RPLOPT12
@NM00021 EQU   RPLOPT12
@NM00020 EQU   RPLOPT12
RPLNIBTK EQU   RPLOPT12
RPLTRUNC EQU   RPLOPT12
RPLKEEP  EQU   RPLOPT12
@NM00019 EQU   RPLOPT12
RPLRSVE8 EQU   RPLOPT11
RPLRSVE7 EQU   RPLOPT11
RPLRSVE6 EQU   RPLOPT11
RPLRSVE5 EQU   RPLOPT11
RPLRSVE4 EQU   RPLOPT11
RPLSTOP  EQU   RPLOPT11
RPLSTART EQU   RPLOPT11
RPLQUIES EQU   RPLOPT11
RPLRSVI6 EQU   RPLOPT10
RPLRSVI5 EQU   RPLOPT10
RPLRSVI4 EQU   RPLOPT10
RPLRSVI3 EQU   RPLOPT10
RPLRSVI2 EQU   RPLOPT10
RPLSPARM EQU   RPLOPT10
RPLDSPLY EQU   RPLOPT10
RPLBSCID EQU   RPLOPT10
RPLTOPL  EQU   RPLOPT9
RPLCIDE  EQU   RPLOPT9
RPLRNNM  EQU   RPLOPT9
RPLAPPST EQU   RPLOPT9
RPLCOUNT EQU   RPLOPT9
RPLTERMS EQU   RPLOPT9
RPLDEVCH EQU   RPLOPT9
RPLLOGON EQU   RPLOPT9
RPLUSFLD EQU   RPLVTEXT+16
RPLESR2  EQU   RPLUSNSI+1
RPLESR1  EQU   RPLUSNSI
RPLSSMI  EQU   RPLDSB2
@NM00018 EQU   RPLSSEI
RPLRRI   EQU   RPLSSEI
RPLFII   EQU   RPLSSEI
RPLSTATI EQU   RPLSSEI
RPLCPMI  EQU   RPLSSEI
RPLPATHI EQU   RPLSSEI
RPLARCLN EQU   RPLVTEXT+8
RPLAARLN EQU   RPLVTEXT+4
RPLAAREA EQU   RPLVTEXT
RPLERMSA EQU   RPLCOMN+72
RPLEMLEN EQU   RPLCOMN+70
RPLACTIV EQU   RPLCOMN+69
RPLBRANC EQU   RPLEXTD1
RPLNIB   EQU   RPLEXTD1
@NM00017 EQU   RPLEXTD1
RPLEXIT  EQU   RPLEXTD1
RPLNEXIT EQU   RPLEXTD1
RPLEXSCH EQU   RPLEXTD1
RPLDDDD  EQU   RPLRBAR+4
@NM00016 EQU   RPLRBAR+3
@NM00015 EQU   RPLAIXID
RPLAXPKP EQU   RPLAIXID
RPLAIXPC EQU   RPLRBAR
RPLRSV88 EQU   RPLOPT8
RPLUNCON EQU   RPLOPT8
RPLACTV  EQU   RPLOPT8
RPLSESS  EQU   RPLOPT8
RPLPEND  EQU   RPLOPT8
RPLODPRM EQU   RPLOPT8
RPLODACP EQU   RPLOPT8
RPLODACQ EQU   RPLOPT8
RPLRSV78 EQU   RPLOPT7
RPLTCRNO EQU   RPLOPT7
RPLRLSOP EQU   RPLOPT7
RPLTPOST EQU   RPLOPT7
RPLQOPT  EQU   RPLOPT7
RPLCNIMM EQU   RPLCNOPT
RPLCNANY EQU   RPLCNOPT
RPLCNALL EQU   RPLCNOPT
RPLRSV68 EQU   RPLOPT6
RPLRSV67 EQU   RPLOPT6
RPLLOCK  EQU   RPLOPT6
RPLNCOND EQU   RPLOPT6
RPLCOND  EQU   RPLOPT6
RPLEOT   EQU   RPLUNTYP
RPLEOM   EQU   RPLUNTYP
RPLEOB   EQU   RPLUNTYP
RPLWROPT EQU   RPLOPT5
RPLNODE  EQU   RPLOPT5
RPLERACE EQU   RPLWRTYP
RPLEAU   EQU   RPLWRTYP
RPLNERAS EQU   RPLWRTYP
RPLPSOPT EQU   RPLOPT5
@NM00014 EQU   RPLOPT5
RPLBUFL  EQU   RPLCOMN+52
RPLRLEN  EQU   RPLCOMN+48
RPLCHAIN EQU   RPLNXTRP
RPLBOP   EQU   RPLOPT4
@NM00013 EQU   RPLOPT4
RPLMKFRM EQU   RPLOPT4
RPLENDTR EQU   RPLOPT4
RPLALIGN EQU   RPLOPT3
RPLFMT   EQU   RPLOPT3
RPLFLD   EQU   RPLOPT3
RPLVFY   EQU   RPLOPT3
RPLBLK   EQU   RPLOPT3
RPLSFORM EQU   RPLOPT3
RPLEODS  EQU   RPLOPT3
RPLNSP   EQU   RPLOPT2
RPLUPD   EQU   RPLOPT2
@NM00012 EQU   RPLOPT2
RPLLRD   EQU   RPLOPT2
RPLBWD   EQU   RPLOPT2
RPLCNV   EQU   RPLOPT2
RPLADD   EQU   RPLADR
RPLKEY   EQU   RPLOPT2
RPLECBIN EQU   RPLECBSW
RPLGEN   EQU   RPLOPT1
RPLKGE   EQU   RPLOPT1
RPLASY   EQU   RPLOPT1
RPLSKP   EQU   RPLOPT1
RPLSEQ   EQU   RPLOPT1
RPLDIR   EQU   RPLOPT1
RPLLOC   EQU   RPLOPT1
RPLDAF   EQU   RPLARG+2
RPLSAF   EQU   RPLARG
RPLAREA  EQU   RPLCOMN+32
RPLTCBPT EQU   RPLCOMN+28
RPLDACB  EQU   RPLCOMN+24
RPLCCHAR EQU   RPLCOMN+20
RPLSTRID EQU   RPLCOMN+18
RPLKEYL  EQU   RPLKEYLE
RPLRDSOH EQU   RPLFDB3
RPLRLG   EQU   RPLFDB3
RPLLGFRC EQU   RPLFDB3
RPLREOT  EQU   RPLFDB3
RPLREOM  EQU   RPLFDB3
RPLREOB  EQU   RPLFDB3
RPLSV32  EQU   RPLFDB3
RPLUINPT EQU   RPLFDB3
RPLSTSAV EQU   RPLFDB2
RPLCUERR EQU   RPLFDB2
RPLDLGFL EQU   RPLFDB2
RPLIOERR EQU   RPLFDB2
RPLDVUNS EQU   RPLFDB2
RPLATND  EQU   RPLFDB2
RPLRVID  EQU   RPLFDB2
RPLERLK  EQU   RPLFDB2
RPLERREG EQU   RPLRTNCD
RPLSTAT  EQU   RPLFDBWD
RPLPOST  EQU   RPLECB
RPLWAIT  EQU   RPLECB
RPLPLHPT EQU   RPLCOMN+4
RPLLEN2  EQU   RPLLEN
RPLSTYP  EQU   RPLIDWD+1
RPLID    EQU   RPLIDWD
@NM00011 EQU   SRBSECT+40
@NM00010 EQU   SRBSECT+38
SRBPRIOR EQU   SRBSECT+37
SRBPKF   EQU   SRBSECT+36
SRBSAVE  EQU   SRBSECT+32
SRBPARM  EQU   SRBSECT+28
SRBRMTR  EQU   SRBSECT+24
SRBEP    EQU   SRBSECT+20
SRBPTCB  EQU   SRBFLC+4
SRBPASID EQU   SRBFLC+2
SRBCPAFF EQU   SRBFLC
SRBASCB  EQU   SRBSECT+8
SRBFLNK  EQU   SRBSECT+4
SRBID    EQU   SRBSECT
IOSEND   EQU   IOSB+108
IOSSKR   EQU   IOSEEKA+7
IOSSKH2  EQU   IOSSKHH+1
IOSSKH1  EQU   IOSSKHH
IOSSKCC  EQU   IOSCCHH
IOSSKBB  EQU   IOSEEKA+1
IOSSKM   EQU   IOSEEKA
IOSEEK   EQU   IOSB+92
IOSMDM   EQU   IOSB+91
IOSMDB   EQU   IOSB+90
IOSCKEY7 EQU   IOSCKEY
IOSCKEY6 EQU   IOSCKEY
IOSCKEY5 EQU   IOSCKEY
IOSCKEY4 EQU   IOSCKEY
@NM00006 EQU   IOSCKEY
IOSFMSK  EQU   IOSB+88
IOSCUDEV EQU   IOSPATH+1
@NM00005 EQU   IOSCHN
IOSPATH3 EQU   IOSCHN
IOSPATH2 EQU   IOSCHN
IOSEXP   EQU   IOSCHN
IOSGDP   EQU   IOSCHN
IOSAFF   EQU   IOSB+85
IOSRSS1B EQU   IOSB+84
IOSDSID  EQU   IOSB+80
IOSVST   EQU   IOSB+76
IOSRST   EQU   IOSB+72
IOSDIE   EQU   IOSB+68
IOSABN   EQU   IOSB+64
IOSNRM   EQU   IOSB+60
IOSPCI   EQU   IOSB+56
IOSERP   EQU   IOSB+52
IOSPCHN  EQU   IOSB+48
IOSSNS   EQU   IOSB+42
IOSAPMSK EQU   IOSB+40
IOSRES4A EQU   IOSB+36
IOSUSE   EQU   IOSB+32
IOSSRB   EQU   IOSB+28
IOSCSWRC EQU   IOSCSW+5
IOSTSB   EQU   IOSTATUS+1
IOSTSA   EQU   IOSTATUS
IOSCSWCA EQU   IOSCSW
IOSCC    EQU   @NM00004
IOSUCB   EQU   IOSB+16
IOSOPT2X EQU   IOSOPT2
IOSHTP   EQU   IOSOPT2
IOSRELSE EQU   IOSOPT
IOSAPR   EQU   IOSOPT
IOSTSLL  EQU   IOSOPT
IOSNERP  EQU   IOSOPT
IOSPSLL  EQU   IOSOPT
IOSQISCE EQU   IOSOPT
IOSDEP   EQU   IOSOPT
IOSBYP   EQU   IOSOPT
IOSCOD   EQU   IOSB+13
IOSPKY7  EQU   IOSPKEY
IOSPGDPX EQU   IOSPKEY
IOSIDR   EQU   IOSPKEY
IOSLCL   EQU   IOSPKEY
@NM00003 EQU   IOSPKEY
IOSPGAD  EQU   IOSB+8
IOSASID  EQU   IOSB+6
IOSPRLVL EQU   IOSB+5
IOSDVRID EQU   IOSB+4
IOSPROC  EQU   IOSB+3
IOSFLC7  EQU   IOSFLC
IOSFLC6  EQU   IOSFLC
IOSRWAIT EQU   IOSFLC
IOSTP    EQU   IOSFLC
IOSCC3WE EQU   IOSFLC
IOSVERIF EQU   IOSDVALT
IOSDVMNT EQU   IOSFLC
IOSLOG   EQU   IOSFLB
IOSBDCST EQU   IOSFLB
IOSMSG   EQU   IOSFLB
IOSFLB4  EQU   IOSFLB
IOSFLB3  EQU   IOSFLB
IOSFLB2  EQU   IOSFLB
IOSSDR   EQU   IOSFLB
IOSDIESE EQU   IOSFLB
IOSIOSB  EQU   IOSFLA
IOSDOM   EQU   IOSFLA
IOSEX    EQU   IOSFLA
IOSSMDB  EQU   IOSFLA
IOSSMDA  EQU   IOSFLA
IOSERR   EQU   IOSFLA
IOSCCHN  EQU   IOSACHN
IOSDCHN  EQU   IOSACHN
IOBERRCT EQU   IOBSTDRD+30
IOBRSV19 EQU   IOBINCAM+1
IOBOLTST EQU   IOBBTAMF
IOBRFTMG EQU   IOBBTAMF
IOBRSV17 EQU   IOBBTAMF
IOBRSV16 EQU   IOBBTAMF
IOBRSV15 EQU   IOBBTAMF
IOBRSV14 EQU   IOBBTAMF
IOBINUSE EQU   IOBBTAMF
IOBPRMER EQU   IOBBTAMF
IOBRSTRB EQU   IOBRESTR+1
IOBREPOS EQU   IOBRESTR
IOBDCBPB EQU   IOBDCBPT+1
IOBRSV44 EQU   IOBFLAG4
IOBJES3I EQU   IOBFLAG4
IOBRSV42 EQU   IOBFLAG4
IOBRSV41 EQU   IOBFLAG4
IOBRSV40 EQU   IOBFLAG4
IOBPMERR EQU   IOBFLAG4
IOBCC3WE EQU   IOBFLAG4
IOBGDPOL EQU   IOBFLAG4
IOBSTRTB EQU   IOBSTART+1
IOBSIOCC EQU   IOBSTART
IOBCSB7  EQU   IOBCSTAT
IOBCSB6  EQU   IOBCSTAT
IOBCSB5  EQU   IOBCSTAT
IOBCSB4  EQU   IOBCSTAT
IOBCSB3  EQU   IOBCSTAT
IOBCSB2  EQU   IOBCSTAT
IOBCSB1  EQU   IOBCSTAT
IOBCSB0  EQU   IOBCSTAT
IOBUSB7  EQU   IOBUSTAT
IOBUSB6  EQU   IOBUSTAT
IOBUSB5  EQU   IOBUSTAT
IOBUSB4  EQU   IOBUSTAT
IOBUSB3  EQU   IOBUSTAT
IOBUSB2  EQU   IOBUSTAT
IOBUSB1  EQU   IOBUSTAT
IOBUSB0  EQU   IOBUSTAT
IOBCMDA  EQU   IOBIOCSW
IOBLOG   EQU   IOBFL3
IOBJAM   EQU   IOBICL
IOBMSG   EQU   IOBFL3
IOBSDR   EQU   IOBCNC
IOBACU   EQU   IOBFL3
IOBCDC   EQU   IOBFL3
IOBICC   EQU   IOBFL3
IOBCCC   EQU   IOBFL3
IOBECBPB EQU   IOBECBPT+1
IOBECBCC EQU   IOBECBPT
IOBS1B7  EQU   IOBSENS1
IOBS1B6  EQU   IOBSENS1
IOBS1B5  EQU   IOBSENS1
IOBS1B4  EQU   IOBSENS1
IOBS1B3  EQU   IOBSENS1
IOBS1B2  EQU   IOBSENS1
IOBS1B1  EQU   IOBSENS1
IOBS1B0  EQU   IOBSENS1
IOBSNSC9 EQU   IOBS0B7
IOBS0B6  EQU   IOBSENS0
IOBS0B5  EQU   IOBSENS0
IOBS0B4  EQU   IOBSENS0
IOBS0B3  EQU   IOBSENS0
IOBS0B2  EQU   IOBSENS0
IOBS0B1  EQU   IOBSENS0
IOBS0B0  EQU   IOBSENS0
IOBPNCH  EQU   IOBFLAG2
IOBSTATO EQU   IOBFLAG2
IOBSKUPD EQU   IOBFLAG2
IOBALTTR EQU   IOBFLAG2
IOBRRT2  EQU   IOBRDHA0
IOBRRT3  EQU   IOBPURGE
IOBSENSE EQU   IOBFLAG2
IOBHALT  EQU   IOBFLAG2
IOBSPSVC EQU   IOBRSTRT
IOBUNREL EQU   IOBFLAG1
IOBIOERR EQU   IOBFLAG1
IOBFCREX EQU   IOBCYCCK
IOBRPSTN EQU   IOBFLAG1
IOBERRTN EQU   IOBFLAG1
IOBCMDCH EQU   IOBFLAG1
IOBDATCH EQU   IOBFLAG1
IOBCNOPA EQU   IOBPREFX+12
IOBCICB  EQU   IOBPREFX+8
IOBCECB  EQU   IOBPREFX+4
IOBCONOP EQU   IOBPREFX+3
IOBCINOP EQU   IOBPREFX+2
IOBRSV05 EQU   IOBPREFX+1
IOBPCI   EQU   IOBCFLG1
IOBRSTCH EQU   IOBCFLG1
IOBABAPP EQU   IOBCFLG1
IOBPTST  EQU   IOBCFLG1
IOBRSV04 EQU   IOBCFLG1
IOBRSV03 EQU   IOBCFLG1
IOBRSV02 EQU   IOBCFLG1
IOBRSV01 EQU   IOBCFLG1
CVTLEVL  EQU   CVTRELNO+2
CVTNUMB  EQU   CVTRELNO
CVTMDL   EQU   CVTFIX+250
@NM00002 EQU   CVTFIX+248
@NM00001 EQU   CVTFIX
CVTRV482 EQU   CVTXTNT2+128
CVTRV481 EQU   CVTXTNT2+124
CVTRV480 EQU   CVTXTNT2+120
CVTRV479 EQU   CVTXTNT2+118
CVTRV478 EQU   CVTXTNT2+117
CVTRV477 EQU   CVTXTNT2+116
CVTRV476 EQU   CVTXTNT2+115
CVTRV475 EQU   CVTXTNT2+114
CVTRV474 EQU   CVTRV466
CVTRV473 EQU   CVTRV466
CVTRV472 EQU   CVTRV466
CVTRV471 EQU   CVTRV466
CVTRV470 EQU   CVTRV466
CVTRV469 EQU   CVTRV466
CVTRV468 EQU   CVTRV466
CVTRV467 EQU   CVTRV466
CVTRV465 EQU   CVTRV457
CVTRV464 EQU   CVTRV457
CVTRV463 EQU   CVTRV457
CVTRV462 EQU   CVTRV457
CVTRV461 EQU   CVTRV457
CVTRV460 EQU   CVTRV457
CVTRV459 EQU   CVTRV457
CVTRV458 EQU   CVTRV457
CVTRV456 EQU   CVTXTNT2+108
CVTRV455 EQU   CVTXTNT2+104
CVTRV454 EQU   CVTXTNT2+100
CVTRV453 EQU   CVTXTNT2+96
CVTRV452 EQU   CVTXTNT2+94
CVTRV451 EQU   CVTXTNT2+92
CVTRV450 EQU   CVTXTNT2+90
CVTRV449 EQU   CVTXTNT2+88
CVTRV448 EQU   CVTXTNT2+87
CVTRV447 EQU   CVTXTNT2+86
CVTRV446 EQU   CVTRV438
CVTRV445 EQU   CVTRV438
CVTRV444 EQU   CVTRV438
CVTRV443 EQU   CVTRV438
CVTRV442 EQU   CVTRV438
CVTRV441 EQU   CVTRV438
CVTRV440 EQU   CVTRV438
CVTRV439 EQU   CVTRV438
CVTRV437 EQU   CVTRV429
CVTRV436 EQU   CVTRV429
CVTRV435 EQU   CVTRV429
CVTRV434 EQU   CVTRV429
CVTRV433 EQU   CVTRV429
CVTRV432 EQU   CVTRV429
CVTRV431 EQU   CVTRV429
CVTRV430 EQU   CVTRV429
CVTRV428 EQU   CVTXTNT2+80
CVTRV427 EQU   CVTXTNT2+76
CVTRV426 EQU   CVTXTNT2+72
CVTRV425 EQU   CVTXTNT2+68
CVTATACT EQU   CVTATCVT
CVTRV423 EQU   CVTXTNT2+62
CVTRV422 EQU   CVTXTNT2+60
CVTRV421 EQU   CVTXTNT2+58
CVTRV420 EQU   CVTXTNT2+56
CVTRV419 EQU   CVTXTNT2+55
CVTRV418 EQU   CVTXTNT2+54
CVTRV417 EQU   CVTRV409
CVTRV416 EQU   CVTRV409
CVTRV415 EQU   CVTRV409
CVTRV414 EQU   CVTRV409
CVTRV413 EQU   CVTRV409
CVTRV412 EQU   CVTRV409
CVTRV411 EQU   CVTRV409
CVTRV410 EQU   CVTRV409
CVTRV408 EQU   CVTRV400
CVTRV407 EQU   CVTRV400
CVTRV406 EQU   CVTRV400
CVTRV405 EQU   CVTRV400
CVTRV404 EQU   CVTRV400
CVTRV403 EQU   CVTRV400
CVTRV402 EQU   CVTRV400
CVTRV401 EQU   CVTRV400
CVTICB   EQU   CVTXTNT2+48
CVTSKTA  EQU   CVTXTNT2+44
CVTSHSB  EQU   CVTSHS
CVTRSV98 EQU   CVTXTNT2+36
CVTRSV97 EQU   CVTXTNT2+34
CVTRSV96 EQU   CVTXTNT2+32
CVTOLTEP EQU   CVTXTNT2+28
CVTQIDA  EQU   CVTQID+1
CVTRSV95 EQU   CVTQID
CVTRSV94 EQU   CVTXTNT2+20
CVTRSV93 EQU   CVTXTNT2+16
CVTRSV92 EQU   CVTXTNT2+12
CVTDEBVR EQU   CVTXTNT2+8
CVTRSV91 EQU   CVTXTNT2+6
CVTRSV9H EQU   CVTFLGBT
CVTRSV9G EQU   CVTFLGBT
CVTRSV9F EQU   CVTFLGBT
CVTRSV9E EQU   CVTFLGBT
CVTRSV9D EQU   CVTFLGBT
CVTRSV9C EQU   CVTFLGBT
CVTVME   EQU   CVTFLGBT
CVTNPE   EQU   CVTFLGBT
CVTNUCLS EQU   CVTXTNT2+4
CVTDSSVA EQU   CVTDSSV+1
CVTRSV89 EQU   CVTDSSV
CVTRSV88 EQU   CVTXTNT1+8
CVTRSV87 EQU   CVTXTNT1+4
CVTFACHN EQU   CVTXTNT1
CVTRV488 EQU   CVTMAP+412
CVTRV487 EQU   CVTMAP+408
CVTRV486 EQU   CVTMAP+404
CVTRV485 EQU   CVTMAP+400
CVTACTAP EQU   CVTMAP+396
CVTAUTH  EQU   CVTMAP+392
CVTATMCA EQU   CVTATMCT+1
CVTATMST EQU   CVTATMCT
CVTRSV61 EQU   CVTMAP+384
CVTVOLT1 EQU   CVTVOLM1+1
CVTVOLI1 EQU   CVTVOLF1
CVTSTOA  EQU   CVTMAP+376
CVTRSV58 EQU   CVTMAP+374
CVTRSV57 EQU   CVTMAP+372
CVTDDCE  EQU   CVTMAP+368
CVTPNWFR EQU   CVTMAP+364
CVTSMF   EQU   CVTMAP+360
CVTSULK  EQU   CVTMAP+358
CVTSLKO  EQU   CVTSYSK
CVTSLKP  EQU   CVTSYSK
CVTSLKQ  EQU   CVTSYSK
CVTSLKR  EQU   CVTSYSK
CVTRSV56 EQU   CVTSYSK
CVTRSV55 EQU   CVTSYSK
CVTRSV54 EQU   CVTSYSK
CVTRSV53 EQU   CVTSYSK
CVTRSV52 EQU   CVTA1F1
CVTRSV51 EQU   CVTA1F1
CVTRSV50 EQU   CVTA1F1
CVTRSV49 EQU   CVTA1F1
CVTRSV48 EQU   CVTA1F1
CVTRSV47 EQU   CVTA1F1
CVTSRSW  EQU   CVTA1F1
CVTPFSW  EQU   CVTA1F1
CVTPCVT  EQU   CVTMAP+352
CVTRSV46 EQU   CVTMAP+344
CVTRSV45 EQU   CVTMAP+340
CVTRSV44 EQU   CVTMAP+338
CVTRSV43 EQU   CVTMAP+336
CVTHJESA EQU   CVTHJES+1
CVTRSV42 EQU   CVTHJES
CVTEXT2A EQU   CVTEXT2+1
CVTRSV41 EQU   CVTEXT2
CVTAPFA  EQU   CVTAPF+1
CVTRSV40 EQU   CVTAPF
CVTRV518 EQU   CVTINTLA
CVTRV517 EQU   CVTERPV
CVTEORM  EQU   CVTMAP+312
CVTMCHPR EQU   CVTMAP+308
CVTTZ    EQU   CVTMAP+304
CVTJEPS  EQU   CVTMAP+300
CVTJESCT EQU   CVTMAP+296
CVTMODE  EQU   CVTMAP+292
CVTPTRV  EQU   CVTMAP+288
CVTREAL  EQU   CVTMAP+284
CVTRSV39 EQU   CVTMAP+280
CVTRSV38 EQU   CVTMAP+276
CVTDMSRA EQU   CVTDMSR+1
CVTRV634 EQU   CVTDMSRF
CVTRV633 EQU   CVTDMSRF
CVTRV632 EQU   CVTDMSRF
CVTRV631 EQU   CVTDMSRF
CVTRV630 EQU   CVTDMSRF
CVTRV629 EQU   CVTDMSRF
CVTUDUMP EQU   CVTDMSRF
CVTSDUMP EQU   CVTDMSRF
CVTQMSGA EQU   CVTQMSG+1
CVTRSV36 EQU   CVTQMSG
CVTAMFF  EQU   CVTMAP+264
CVTPURGA EQU   CVTPURG+1
CVTRSV35 EQU   CVTPURG
CVTCBSP  EQU   CVTMAP+256
CVTATERA EQU   CVTATER+1
CVTSYST  EQU   CVTATER
CVTVOLT2 EQU   CVTTAT
CVTVOLI2 EQU   CVTVOLF2
CVTAQAVB EQU   CVTAQAVT+1
CVTRSV34 EQU   CVTTCMFG
CVTRSV33 EQU   CVTTCMFG
CVTRSV32 EQU   CVTTCMFG
CVTRSV31 EQU   CVTTCMFG
CVTRSV30 EQU   CVTTCMFG
CVTRSV29 EQU   CVTTCMFG
CVTRSV28 EQU   CVTTCMFG
CVTTCRDY EQU   CVTTCMFG
CVTGTFA  EQU   CVTGTF+1
CVTRSV27 EQU   CVTGTFST
CVTRNIO  EQU   CVTGTFST
CVTUSR   EQU   CVTGTFST
CVTRV318 EQU   CVTFORM
CVTRV317 EQU   CVTTMODE
CVTRV316 EQU   CVTSTATE
CVTRV315 EQU   CVTGTFS
CVTGTFAV EQU   CVTGTFS
CVT0SCR1 EQU   CVTMAP+232
CVTRV515 EQU   CVTMAP+228
CVTRMS   EQU   CVTMAP+224
CVTPATCH EQU   CVTMAP+220
CVTTSCE  EQU   CVTMAP+216
CVTLNKSC EQU   CVTMAP+214
CVTQABST EQU   CVTMAP+212
CVTMDLDS EQU   CVTMAP+208
CVTUSER  EQU   CVTMAP+204
CVTABEND EQU   CVTMAP+200
CVTSMCA  EQU   CVTMAP+196
CVTRSV18 EQU   CVTMAP+192
CVTQLPAQ EQU   CVTMAP+188
CVTQCDSR EQU   CVTMAP+184
CVTRSV17 EQU   CVTOPTB
CVTRSV16 EQU   CVTOPTB
CVTFP    EQU   CVTOPTB
CVTAPTHR EQU   CVTOPTB
CVTNLOG  EQU   CVTOPTB
CVTTOD   EQU   CVTOPTB
CVTCTIMS EQU   CVTOPTB
CVTPROT  EQU   CVTOPTB
CVTXPFP  EQU   CVTOPTA
CVTASCII EQU   CVTOPTA
CVTRSV13 EQU   CVTOPTA
CVTRSV12 EQU   CVTOPTA
CVTNIP   EQU   CVTOPTA
CVTDDR   EQU   CVTOPTA
CVTAPR   EQU   CVTOPTA
CVTCCH   EQU   CVTOPTA
CVTSNCTR EQU   CVTMAP+180
CVTQMWR  EQU   CVTMAP+176
CVTQOCR  EQU   CVTMAP+172
CVT1EF00 EQU   CVTMAP+168
CVTMZ00  EQU   CVTMAP+164
CVTHEAD  EQU   CVTMAP+160
CVTRSV11 EQU   CVTMAP+156
CVT0PT01 EQU   CVTMAP+152
CVTMSER  EQU   CVTMAP+148
CVTRV516 EQU   CVTIERLC
CVTILCH  EQU   CVTMAP+140
CVT0DS   EQU   CVTMAP+136
CVTFBOSV EQU   CVTMAP+132
CVTNUCB  EQU   CVTMAP+128
CVTIXAVL EQU   CVTMAP+124
CVTIOQET EQU   CVTMAP+120
CVTDCBA  EQU   CVTMAP+117
CVTMVS2  EQU   CVTDCB
CVT6DAT  EQU   CVTDCB
CVT4MPS  EQU   CVTDCB
CVTRSV09 EQU   CVTDCB
CVT4MS1  EQU   CVTDCB
CVT2SPS  EQU   CVTDCB
CVT1SSS  EQU   CVTDCB
CVTRSV08 EQU   CVTDCB
CVTSTB   EQU   CVTMAP+112
CVTQTD00 EQU   CVTMAP+108
CVTQTE00 EQU   CVTMAP+104
CVTCUCB  EQU   CVTMAP+100
CVTSJQ   EQU   CVTMAP+96
CVTPBLDL EQU   CVTMAP+92
CVTTPC   EQU   CVTMAP+88
CVTSVDCB EQU   CVTMAP+84
CVTBRET  EQU   CVTMAP+82
CVTEXIT  EQU   CVTMAP+80
CVT0FN00 EQU   CVTMAP+76
CVTDARA  EQU   CVTDAR+1
CVTRSV07 EQU   CVTFLGS1
CVTRSV06 EQU   CVTFLGS1
CVTRSV05 EQU   CVTFLGS1
CVTRSV04 EQU   CVTFLGS1
CVTRSV03 EQU   CVTFLGS1
CVTRSV02 EQU   CVTFLGS1
CVTRSV01 EQU   CVTFLGS1
CVTDMPLK EQU   CVTFLGS1
CVTXITP  EQU   CVTMAP+68
CVTZDTAB EQU   CVTMAP+64
CVTMSLT  EQU   CVTMAP+60
CVTDATE  EQU   CVTMAP+56
CVTBTERM EQU   CVTMAP+52
CVTSYSAD EQU   CVTMAP+48
CVTXTLER EQU   CVTMAP+44
CVTILK2  EQU   CVTMAP+40
CVTILK1  EQU   CVTMAP+36
CVTPRLTV EQU   CVTMAP+32
CVTPCNVT EQU   CVTMAP+28
CVT0VL00 EQU   CVTMAP+24
CVTXAPG  EQU   CVTMAP+20
CVTBUF   EQU   CVTMAP+16
CVTJOB   EQU   CVTMAP+12
CVTLINK  EQU   CVTMAP+8
CVT0EF00 EQU   CVTMAP+4
CVTTCBP  EQU   CVTMAP
CVT      EQU   CVTMAP
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS
DOUNDO#  EQU   @RC00494
DODNCB#  EQU   @RC00784
DOHCNCB# EQU   @RC00788
DOLDNCB# EQU   @RC00792
DOICNCB# EQU   @RC00796
DOLUNCB# EQU   @RC00800
DOCCNCB# EQU   @RC00804
@RF01025 EQU   @RC01013
@RC01020 EQU   @RC01013
@RC01059 EQU   @RC01037
@RC01042 EQU   @RC01037
@RC01064 EQU   @RC01035
@RC01107 EQU   @RC01089
@RC01251 EQU   @RC01250
@RC01167 EQU   @RC01166
@RC01313 EQU   @RC01312
@RC01395 EQU   @RC01393
@RT01050 EQU   @RC01042
DOADD#   EQU   @RC01064
@ENDDATA EQU   *
         END   ISTOCCFB,(C'PLS0153',0603,78081)
