      DESCRIPTION OF PROGRAMS SMPHOFF AND SMPHDEL.

 SMPHOFF MAKES LIFE EASIER WHEN DETERMINING PTFS TO BE HELD OFF DURING
  APPLY OR ACCEPT PROCESSING.  IT READS AN APPLY CHECK LISTING ON DISK.
                                                       -------
  OUTPUT IS AN UNSORTED LIST OF PTFS WHICH WERE FLAGGED BY THE LISTING
  AS NOT TO GO ON, OR TO GO ON ONLY AFTER BYPASS.  SINCE THIS LISTING
  IS IN IBM'S EXCLUDE LIST FORMAT, IT MAY BE SORT-MERGED WITH IBM
  EXCLUDE LISTS TO PRODUCE A NEW EXCLUDE LIST FOR THE NEXT ITERATION
  OF THE APPLY OR ACCEPT CHECK.


 YOU OBTAIN THE APPLY CHECK LISTING BY BYPASSING EVERYTHING.  THE
  PROGRAM SCANS THE LISTING FOR *U, *A, -U, -A, -B, AND THE LIKE.
  (IT ONLY OPERATES ON THE "SYSMOD" PART OF THE LISTING.)
  WHEN IT GETS A HIT, IT PUTS OUT A RECORD FOR THE HIT PTF NUMBER,
  AND ALSO FOR THE PTF NUMBER BEING HELD OFF.

 YOU CAN SORT THESE 80-BYTE RECORDS WITH THE PTF NUMBER IN COLUMN 7.
  YOU CAN THEN INPUT THE SORTED FILE INTO THE PROGRAM SMPHDEL,
  WHICH WILL ELIMINATE REPEATED NUMBERS.

INPUT DDNAME TO BOTH PROGRAMS IS SYSUT1.
OUTPUT DDNAME TO BOTH PROGRAMS IS SYSUT2.

  SAMPLE JCL TO USE THE PROGRAMS FOLLOWS:

//TST2HSGO JOB ,'TECH.SUPP-SAM.GOLOB',CLASS=M,NOTIFY=TST2SSG,
//        MSGLEVEL=(1,1),MSGCLASS=X TYPRUN=HOLD
//*
//******************************************************************//
//*   SMP4  -  PRODUCTION PUT MAINTENANCE  -  PUT 8406             *//
//*       PTF HELDOFF PROCESSING FOR APPLYCHECK                    *//
//*                                                                *//
//*                                      DATE ====> 12/12/84       *//
//******************************************************************//
//*
//S01HGET  EXEC PGM=SMPHOFF
//STEPLIB DD DISP=SHR,DSN=TST2SSG.LOAD
//SYSPRINT DD SYSOUT=*
//SYSUT1   DD DISP=SHR,DSN=TST2SSG.APCK07.OUTLIST
//SYSUT2   DD DISP=SHR,DSN=TST2SSG.A.DATA(HELDOFF)
//SYSABEND DD SYSOUT=A,HOLD=YES
//*
//S02SORT  EXEC  PGM=ICEMAN,REGION=1000K
//STEPLIB  DD DSN=SYS1.LINK2,DISP=SHR
//SYSOUT   DD SYSOUT=*
//SORTIN   DD  DSN=TST2SSG.A.DATA(HELDOFF),DISP=SHR
//SORTOUT  DD  DSN=TST2SSG.A.DATA(HELDOFF),DISP=SHR
//SORTWK01 DD  UNIT=SYSDA,SPACE=(CYL,(1))
//SYSIN    DD  *
   SORT FIELDS=(7,7,CH,A)
   RECORD TYPE=F,LENGTH=80
   END
/*
//*    =====> END OF JCLSORT <=====
//S03HDEL  EXEC PGM=SMPHDEL
//STEPLIB DD DISP=SHR,DSN=TST2SSG.LOAD
//SYSPRINT DD SYSOUT=*
//SYSUT1   DD DISP=SHR,DSN=TST2SSG.A.DATA(HELDOFF)
//SYSUT2   DD DISP=SHR,DSN=TST.VSGEN.T8406.PUTPDS(HELDOFF)
//SYSABEND DD SYSOUT=A,HOLD=YES
//*


