/*JOBPARM K=0,N=3
//* ********************************************************
//* *  INSTALL THE 'RACHECK' SVC                           *
//* ********************************************************
//ASSEMH EXEC ASFIASML,BANNER=RACHECK,
//             PARM.ASM='OBJECT,NODECK,TERM,XREF(SHORT)',
//             PARM.LKED='LIST,MAP,RENT,REUS,REFR'
//ASM.SYSIN DD DSN=ASFI99U.FI110.SOURCE(RACHECK),DISP=SHR
//ASM.SYSTERM DD SYSOUT=A,HOLD=YES
//LKED.SYSLMOD DD DSN=SYS1.LPALIB,UNIT=,DISP=SHR,SPACE=
//LKED.SYSIN DD *
 ALIAS IGC00130,IGC0013A,IGC0013B,IGC0013C
 NAME IGC0013{(R)
/*
