//ZTSECURE EXEC ASMHCL,PARM.LKED='XREF,LIST,AC=1'
//SYSIN    DD DSN=SYS1.SOURCE(ZTSECURE),DISP=SHR
//LKED.SYSLMOD DD DSN=SYS2.LINKLIB(ZTSECURE),DISP=SHR
//LKED.SYSLIB  DD DSN=SYS2.LINKLIB,DISP=SHR
//
