FMOD     TITLE 'BLSRFMOD--IPCS FINDMOD SUBCOMMAND                      *
                        '
*/* CHANGE ACTIVITY -------------------------------------------------*/
*/*   THIS MODULE WAS WRITTEN FOR @G57LPGW                           */
*/*------------------------------------------------------------------*/
BLSRFMOD CSECT ,                                                   0002
@MAINENT DS    0H                                                  0002
         USING *,@15                                               0002
         B     @PROLOG                                             0002
         DC    AL1(16)                                             0002
         DC    C'BLSRFMOD  78.057'                                 0002
         DROP  @15
@PROLOG  STM   @14,@12,12(@13)                                     0002
         BALR  @12,0                                               0002
@PSTART  DS    0H                                                  0002
         USING @PSTART,@12                                         0002
         L     @00,@SIZDATD                                        0002
         BLSUALLR R,LV=(0)
         LR    @11,@01                                             0002
         USING @DATD,@11                                           0002
         ST    @13,@SA00001+4                                      0002
         LM    @00,@01,20(@13)                                     0002
         ST    @11,8(,@13)                                         0002
         LR    @13,@11                                             0002
*   FLAG='00'X;                     /* PROCESSING CONTROL FLAGS      */
         MVI   FLAG,X'00'                                          0241
*   RETC=0;                         /* RETURN CODE                   */
         SLR   RETC,RETC                                           0242
*   RF=0;                           /* RETURN CODE                   */
         SLR   RF,RF                                               0243
*   BUFP=ADDR(BUFA);                /* ->BUFB (ALIAS FOR BUFA)       */
         LA    BUFP,BUFA                                           0244
*   MINRENTP=0;                     /* NO MINOR ENTRY POINT          */
         SLR   MINRENTP,MINRENTP                                   0245
*   ESAU(1:LENGTH(ESCO))=ESCO;      /* INIT SYMBOL RECORD            */
         MVC   ESAU(182),ESCO                                      0246
*                                                                  0247
*   /*****************************************************************/
*   /*                                                               */
*   /* CALL IKJPARS AND INSPECT OPERANDS                             */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0247
*   DO;                             /* BLSRPARS DISPLAY VERIFICATION
*                                      MF(E,PX)                      */
*     DO;                           /* BLSRPARD CSECT()DSECT(PD)EQUAT
*                                      E(ESAU)EXIT(EXITRLSA,)MF(EXECU
*                                      TE,PX)FLAG ROUTING            */
*       DO;                         /* BLSUPARS CSECT(PC)DSECT(PD)EXI
*                                      T(EXITRLSA,)MF(EXECUTE,PX)FLAG
*                                      ROUTING                       */
*         CALL BLSUPARI(ZZ2,PCCSECT,PDAPTR);/* PARSE OPERANDS        */
         ST    R9,@AL00001                                         0250
         L     @14,PCPTR                                           0250
         ST    @14,@AL00001+4                                      0250
         LA    @14,PDAPTR                                          0250
         ST    @14,@AL00001+8                                      0250
         L     @10,ZZ2BVTP(,R9)                                    0250
         L     @15,BVTPARIP(,@10)                                  0250
         LA    @01,@AL00001                                        0250
         BALR  @14,@15                                             0250
*         RESPECIFY                                                0251
*          (GPR15F) RESTRICTED;                                    0251
*         IF GPR15F^=ZZZFLAGI THEN                                 0252
*                                                                  0252
         LTR   GPR15F,GPR15F                                       0252
         BZ    @RF00252                                            0252
*           /*********************************************************/
*           /*                                                       */
*           /* UNABLE TO PARSE                                       */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0253
*           DO;                     /* UNABLE TO PARSE               */
*             RETC=GPR15F;          /* RETURN CODE                   */
         LR    RETC,GPR15F                                         0254
*             GO TO EXITNORL;       /* EXIT WITHOUT PDL              */
         B     EXITNORL                                            0255
*           END;                                                   0256
*         RESPECIFY                                                0257
*          (GPR15F) UNRESTRICTED;                                  0257
@RF00252 DS    0H                                                  0258
*         RESPECIFY                                                0258
*          (PDRPTR) RESTRICTED;                                    0258
*         PDRPTR=PDAPTR;            /* ->PDL                         */
         L     PDRPTR,PDAPTR                                       0259
*         GENERATE REFS(PD,PDRPTR) CODE(USING PD,PDRPTR);          0260
         USING PD,PDRPTR
*         IF PXTEST=PXTEST1 THEN                                   0261
         CLC   PXTEST(2),@CH00043                                  0261
         BNE   @RF00261                                            0261
*           ZZ2AFX=ZZZ1;            /* TEST                          */
         OI    ZZ2AFX(R9),B'10000000'                              0262
*         ELSE                                                     0263
*           IF PXTEST=PXTEST0 THEN                                 0263
         B     @RC00261                                            0263
@RF00261 CLC   PXTEST(2),@CH00068                                  0263
         BNE   @RF00263                                            0263
*             ZZ2AFX=ZZZ0;          /* NOTEST                        */
         NI    ZZ2AFX(R9),B'01111111'                              0264
*         CALL BLSUPARU(ZZ2,PDDSECT,PXRO);/* SET ROUTING OPTIONS     */
@RF00263 DS    0H                                                  0265
@RC00261 ST    R9,@AL00001                                         0265
         ST    PDRPTR,@AL00001+4                                   0265
         LA    @14,PXRO                                            0265
         ST    @14,@AL00001+8                                      0265
         L     @08,ZZ2BVTP(,R9)                                    0265
         L     @15,BVTPARUP(,@08)                                  0265
         LA    @01,@AL00001                                        0265
         BALR  @14,@15                                             0265
*         RESPECIFY                                                0266
*          (GPR15F) RESTRICTED;                                    0266
*         RETC=MAX(RETC,GPR15F);    /* RETURN CODE                   */
         CR    RETC,GPR15F                                         0267
         BNL   *+6
         LR    RETC,GPR15F                                         0267
*         RESPECIFY                                                0268
*          (GPR15F) UNRESTRICTED;                                  0268
*         IF RETC>ZZZFLAGE THEN     /* SERIOUS ERROR                 */
         C     RETC,@CF00051                                       0269
         BH    @RT00269                                            0269
*           GO TO EXITRLSA;         /* EXIT WITH PDL                 */
*       END;                        /* BLSUPARS CSECT(PC)DSECT(PD)EXI
*                                      T(EXITRLSA,)MF(EXECUTE,PX)FLAG
*                                      ROUTING                       */
*     END;                          /* BLSRPARD CSECT()DSECT(PD)EQUAT
*                                      E(ESAU)EXIT(EXITRLSA,)MF(EXECU
*                                      TE,PX)FLAG ROUTING            */
*     CALL BLSRPADS(ZZ2,PDDSECT,PXDO);/* SET DISPLAY OPTIONS         */
         ST    R9,@AL00001                                         0273
         ST    PDRPTR,@AL00001+4                                   0273
         LA    @14,PXDO                                            0273
         ST    @14,@AL00001+8                                      0273
         L     @08,ZZ2RVTP(,R9)                                    0273
         L     @15,RVTPADSP(,@08)                                  0273
         LA    @01,@AL00001                                        0273
         BALR  @14,@15                                             0273
*     IF PXVER=PXVER1 THEN                                         0274
         CLC   PXVER(2),@CH00043                                   0274
         BNE   @RF00274                                            0274
*       ZZ2AFV=ZZZ1;                /* VERIFY                        */
         OI    ZZ2AFV(R9),B'00001000'                              0275
*     ELSE                                                         0276
*       IF PXVER=PXVER0 THEN                                       0276
         B     @RC00274                                            0276
@RF00274 CLC   PXVER(2),@CH00068                                   0276
         BNE   @RF00276                                            0276
*         ZZ2AFV=ZZZ0;              /* NOVERIFY                      */
         NI    ZZ2AFV(R9),B'11110111'                              0277
*   END;                            /* BLSRPARS DISPLAY VERIFICATION
*                                      MF(E,PX)                      */
@RF00276 DS    0H                                                  0278
@RC00274 DS    0H                                                  0279
*                                                                  0279
*   /*****************************************************************/
*   /*                                                               */
*   /* SAVE REQUESTED MODULE NAME                                    */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0279
*   OK='1'B;                        /* INIT FLAG                     */
         OI    OK,B'01000000'                                      0279
*   IF HEXCHAR=NHEX THEN                                           0280
         CLC   HEXCHAR(2),@CH00068                                 0280
         BNE   @RF00280                                            0280
*     DO;                           /* IF HEX SPECIFIED              */
*       IF PMODIL//2^=0 THEN                                       0282
         LH    @00,PMODIL                                          0282
         SRDA  @00,32                                              0282
         D     @00,@CF00068                                        0282
         LTR   @00,@00                                             0282
         BZ    @RF00282                                            0282
*         OK='0'B;                  /* ODD NUMBER OF DIGITS          */
         NI    OK,B'10111111'                                      0283
*       ELSE                                                       0284
*         DO;                       /* ELSE TEST FOR VALID           */
         B     @RC00282                                            0284
@RF00282 DS    0H                                                  0285
*           BUFTEST='0000000000000000';/* INIT TEST BUFFER           */
         MVC   BUFTEST(16),@CC01930                                0285
*           BUFTEST(17-PMODIL:16)=PMODI(1:PMODIL);/* MOVE DATA INTO
*                                      BUFFER                        */
         LA    @14,17                                              0286
         SH    @14,PMODIL                                          0286
         LA    @08,BUFTEST-1(@14)                                  0286
         LCR   @14,@14                                             0286
         AL    @14,@CF00054                                        0286
         L     @04,PMODIP                                          0286
         EX    @14,@SM01980                                        0286
*           BUFTES2=BUFTEST;        /* SECOND BUFFER                 */
         MVC   BUFTES2(16),BUFTEST                                 0287
*           TR(BUFTEST,ZZ1TRCTX);   /* TRANSLATE EBCDIC TO ZONED HEX */
         L     @14,ZZ2ZZ1P(,R9)                                    0288
         TR    BUFTEST(16),ZZ1TRCTX(@14)                           0288
*           TR(BUFTEST,ZZ1TRHEX);   /* TRANSLATE ZONED HEX TO EBCDIC */
         TR    BUFTEST(16),ZZ1TRHEX(@14)                           0289
*           IF BUFTEST^=BUFTES2 THEN                               0290
         CLC   BUFTEST(16),BUFTES2                                 0290
         BE    @RF00290                                            0290
*             OK='0'B;              /* IF INVALID CHARACTERS,      0291
*                                      INDICATE                      */
         NI    OK,B'10111111'                                      0291
*         END;                                                     0292
@RF00290 DS    0H                                                  0293
*     END;                                                         0293
@RC00282 DS    0H                                                  0294
*   IF OK='0'B×(HEXCHAR=NCHAR&PMODIL>8) THEN                       0294
@RF00280 TM    OK,B'01000000'                                      0294
         BZ    @RT00294                                            0294
         CLC   HEXCHAR(2),@CH00043                                 0294
         BNE   @RF00294                                            0294
         CLC   PMODIL(2),@CH00051                                  0294
         BNH   @RF00294                                            0294
@RT00294 DS    0H                                                  0295
*     DO;                           /* CHARACTER TYPE AND TOO LARGE  */
*       CALL BLSUPUTV(ZZ2,M095);    /* PUT OUT ERROR MESSAGE         */
         ST    R9,@AL00001                                         0296
         LA    @14,M095                                            0296
         ST    @14,@AL00001+4                                      0296
         L     @08,ZZ2BVTP(,R9)                                    0296
         L     @15,BVTPUTVP(,@08)                                  0296
         LA    @01,@AL00001                                        0296
         BALR  @14,@15                                             0296
*       RETC=ZZZFLAGS;              /* SEVERE ERROR                  */
         LA    RETC,12                                             0297
*       GO TO EXITRLSA;             /* EXIT                          */
         B     EXITRLSA                                            0298
*     END;                                                         0299
*   PGMNAME='';                                                    0300
@RF00294 MVI   PGMNAME,C' '                                        0300
         MVC   PGMNAME+1(7),PGMNAME                                0300
*   IF HEXCHAR=NCHAR THEN           /* CHARACTER NAME ENTERED        */
         CLC   HEXCHAR(2),@CH00043                                 0301
         BNE   @RF00301                                            0301
*     PGMNAME(1:PMODIL)=PMODI(1:PMODIL);/* MOVE NAME                 */
         LH    @14,PMODIL                                          0302
         BCTR  @14,0                                               0302
         L     @08,PMODIP                                          0302
         EX    @14,@SM01982                                        0302
*   ELSE                                                           0303
*     DO;                           /* CONVERT HEX NAME ENTERED      */
         B     @RC00301                                            0303
@RF00301 DS    0H                                                  0304
*       BUFTEST='0000000000000000'; /* INIT BUFFER                   */
         MVC   BUFTEST(16),@CC01930                                0304
*       BUFTEST(1:PMODIL)=PMODI(1:PMODIL);/* MOVE NAME INTO BUFFER   */
         LH    @14,PMODIL                                          0305
         LR    @08,@14                                             0305
         BCTR  @08,0                                               0305
         L     @04,PMODIP                                          0305
         EX    @08,@SM01984                                        0305
*       DO;                         /* BLRCNVCX(BUFTEST) FROM(CHARACT
*                                      ER)TO(BS)SET(BUFTES8)TR(ZZ1TRC
*                                      TX)                           */
*         ZONED='0000000000000000'; /* PAD INTERMEDIATE              */
         MVC   ZONED(16),@CC01930                                  0307
*         ZONED(1:+LENGTH(BUFTEST))=BUFTEST;/* LEFT ALIGN EBCDIC   0308
*                                      DIGITS                        */
         MVC   ZONED(16),BUFTEST                                   0308
*         TR(ZONED,ZZ1TRCTX);       /* EBCDIC=>ZONED HEXADECIMAL     */
         L     @08,ZZ2ZZ1P(,R9)                                    0309
         TR    ZONED(16),ZZ1TRCTX(@08)                             0309
*         PACK(CNVCH,ZONED(1:15));  /* ZONED HEXADECIMAL=>BIT        */
         PACK  CNVCH(8),ZONED(15)                                  0310
*         MVN(CNVCH(8:8),ZONED(16:16));/* FINAL FOUR BITS            */
         MVN   CNVCH+7(1),ZONED+15                                 0311
*         BUFTES8=CNVCH(1:+LENGTH(BUFTES8));/* BIT RESULT            */
         MVC   BUFTES8(8),CNVCH                                    0312
*       END;                        /* BLRCNVCX(BUFTEST) FROM(CHARACT
*                                      ER)TO(BS)SET(BUFTES8)TR(ZZ1TRC
*                                      TX)                           */
*       PGMNAME(1:PMODIL/2)=BUFTES8(1:PMODIL/2);/* MOVE NAME         */
         SRL   @14,1                                               0314
         BCTR  @14,0                                               0314
         EX    @14,@SM01986                                        0314
*     END;                                                         0315
*                                                                  0315
*   /*****************************************************************/
*   /*                                                               */
*   /* FIRST SEE IF THE MODULE IS ALREADY IN THE SYMBOL TABLE        */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0316
*   ESAUSYM=PGMNAME;                /* PROGRAM NAME                  */
@RC00301 MVI   ESAUSYM+8,C' '                                      0316
         MVC   ESAUSYM+9(22),ESAUSYM+8                             0316
         MVC   ESAUSYM(8),PGMNAME                                  0316
*   CALL BLSRESGE(ZZ2,ESAU);        /* SEARCH FOR EQUATE RECORD      */
         ST    R9,@AL00001                                         0317
         LA    @14,ESAU                                            0317
         ST    @14,@AL00001+4                                      0317
         L     @08,ZZ2RVTP(,R9)                                    0317
         L     @15,RVTESGEP(,@08)                                  0317
         LA    @01,@AL00001                                        0317
         BALR  @14,@15                                             0317
*   IF RF=0&ESAUDTY='L' THEN        /* MODULE FOUND PREVIOUSLY       */
*                                                                  0318
         LTR   RF,RF                                               0318
         BNZ   @RF00318                                            0318
         CLI   ESAUDTY,C'L'                                        0318
         BNE   @RF00318                                            0318
*     /***************************************************************/
*     /*                                                             */
*     /* MODULE FOUND PREVIOUSLY                                     */
*     /*                                                             */
*     /***************************************************************/
*                                                                  0319
*     DO;                           /* MODULE FOUND PREVIOUSLY       */
*       IF ZZ2AFV='1'B THEN         /* VERIFY                        */
         TM    ZZ2AFV(R9),B'00001000'                              0320
         BNO   @RF00320                                            0320
*         CALL BLST01(ZZ2,ESAU);    /* FORMAT IF REQUIRED            */
         ST    R9,@AL00001                                         0321
         LA    @14,ESAU                                            0321
         ST    @14,@AL00001+4                                      0321
         L     @08,ZZ2RVTP(,R9)                                    0321
         L     @15,RVTT01P(,@08)                                   0321
         LA    @01,@AL00001                                        0321
         BALR  @14,@15                                             0321
*       GO TO EXITRLSA;             /* EXIT WITH PDL                 */
         B     EXITRLSA                                            0322
*     END;                                                         0323
*   ESAUSYM='CVT';                  /* SYMBOL                        */
@RF00318 MVI   ESAUSYM+3,C' '                                      0324
         MVC   ESAUSYM+4(27),ESAUSYM+3                             0324
         MVC   ESAUSYM(3),@CC01725                                 0324
*   ESAUDT=DTCVT;                   /* DATA TYPE                     */
         MVC   ESAUDT(34),DTCVT                                    0325
*   CALL BLSRESGU(ZZ2,ESAU);        /* DEFINE THE SYSTEM CVT         */
         ST    R9,@AL00001                                         0326
         LA    @14,ESAU                                            0326
         ST    @14,@AL00001+4                                      0326
         L     @08,ZZ2RVTP(,R9)                                    0326
         L     @15,RVTESGUP(,@08)                                  0326
         LA    @01,@AL00001                                        0326
         BALR  @14,@15                                             0326
*   IF RF>ZZZFLAGS THEN             /* CVT NOT DEFINED               */
         C     RF,@CF00033                                         0327
         BH    @RT00327                                            0327
*     GO TO NOTFOUND;               /* EXIT WITH PDL                 */
*   ESAUAS=ZZ6DQA;                  /* ADDRESS SPACE                 */
         L     @14,ZZ2AZZ6P(,R9)                                   0329
         MVC   ESAUAS(16),ZZ6DQA(@14)                              0329
*   ESAURL=0;                       /* NO REMARK                     */
         SLR   @14,@14                                             0330
         STH   @14,ESAURL                                          0330
*   THECVTPT=ESAULAD;               /* ->CVT                         */
*                                                                  0331
         L     THECVTPT,ESAULAD                                    0331
*   /*****************************************************************/
*   /*                                                               */
*   /* SEARCH CDES                                                   */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0332
*   ESAUSYM='CVTQLPAQ';             /* SYMBOL                        */
         MVI   ESAUSYM+8,C' '                                      0332
         MVC   ESAUSYM+9(22),ESAUSYM+8                             0332
         MVC   ESAUSYM(8),@CC01939                                 0332
*   ESAUDT=ESCODT;                  /* DATA TYPE                     */
         MVC   ESAUDT(34),ESCODT                                   0333
*   ESAUDTY='A';                    /* POINTER DATA TYPE             */
         MVI   ESAUDTY,C'A'                                        0334
*   ESAUDOF=ADDR(CVTQLPAQ)-ADDR(CVT);/* OFFSET                       */
         MVC   ESAUDOF(4),@CF01970                                 0335
*   ESAUDLE=4;                      /* WORD                          */
         MVC   ESAUDLE(4),@CF00040                                 0336
*   CALL BLSRACC(ZZ2,ESAU,ESAULAD); /* RETRIEVE CVT.CVTQLPAQ         */
         ST    R9,@AL00001                                         0337
         LA    @14,ESAU                                            0337
         ST    @14,@AL00001+4                                      0337
         LA    @14,ESAULAD                                         0337
         ST    @14,@AL00001+8                                      0337
         L     @08,ZZ2RVTP(,R9)                                    0337
         L     @15,RVTRACCP(,@08)                                  0337
         LA    @01,@AL00001                                        0337
         BALR  @14,@15                                             0337
*   IF RF^=0 THEN                   /* ERROR DURING RETRIEVAL        */
         SLR   @14,@14                                             0338
         CR    RF,@14                                              0338
         BNE   @RT00338                                            0338
*     GO TO NOTFOUND;               /* EXIT WITH PDL                 */
*   ESAUSYM='CDEPTR';               /* SYMBOL                        */
         MVI   ESAUSYM+6,C' '                                      0340
         MVC   ESAUSYM+7(24),ESAUSYM+6                             0340
         MVC   ESAUSYM(6),@CC01940                                 0340
*   ESAUDOF=0;                      /* OFFSET                        */
         ST    @14,ESAUDOF                                         0341
*   CALL BLSRACC(ZZ2,ESAU,ESAULAD); /* RETRIEVE ADDRESS OF FIRST CDE */
         ST    R9,@AL00001                                         0342
         LA    @14,ESAU                                            0342
         ST    @14,@AL00001+4                                      0342
         LA    @14,ESAULAD                                         0342
         ST    @14,@AL00001+8                                      0342
         L     @08,ZZ2RVTP(,R9)                                    0342
         L     @15,RVTRACCP(,@08)                                  0342
         LA    @01,@AL00001                                        0342
         BALR  @14,@15                                             0342
*   IF RF^=0 THEN                   /* ERROR DURING RETRIEVAL        */
         LTR   RF,RF                                               0343
         BNZ   @RT00343                                            0343
*     GO TO NOTFOUND;               /* EXIT WITH PDL                 */
*   ESAUSYM='CDE';                  /* SYMBOL                        */
         MVI   ESAUSYM+3,C' '                                      0345
         MVC   ESAUSYM+4(27),ESAUSYM+3                             0345
         MVC   ESAUSYM(3),@CC01941                                 0345
*   ESAUDLE=LENGTH(CDENTRY);        /* LENGTH                        */
         MVC   ESAUDLE(4),@CF00062                                 0346
*   DO WHILE(ESAULAD^=0);           /* SEARCH CDE CHAIN              */
         B     @DE00347                                            0347
@DL00347 DS    0H                                                  0348
*     CALL BLSRACC(ZZ2,ESAU,BUFB);  /* RETRIEVE IMAGE OF CDE         */
         ST    R9,@AL00001                                         0348
         LA    @14,ESAU                                            0348
         ST    @14,@AL00001+4                                      0348
         ST    BUFP,@AL00001+8                                     0348
         L     @08,ZZ2RVTP(,R9)                                    0348
         L     @15,RVTRACCP(,@08)                                  0348
         LA    @01,@AL00001                                        0348
         BALR  @14,@15                                             0348
*     IF RF^=0 THEN                 /* ERROR DURING RETRIEVAL        */
         LTR   RF,RF                                               0349
         BNZ   @RT00349                                            0349
*       GO TO NOTFOUND;             /* EXIT WITH PDL                 */
*     IF CDNAME=PGMNAME THEN        /* CDE FOR REQUESTED PROGRAM     */
         CLC   CDNAME(8,BUFP),PGMNAME                              0351
         BE    @RT00351                                            0351
*       GO TO OUTLOOP;              /* PROCESS THE CDE               */
*     ESAULAD=CDCHAIN;              /* ->NEXT CDE                    */
         L     @14,CDCHAIN(,BUFP)                                  0353
         ST    @14,ESAULAD                                         0353
*   END;                                                           0354
*                                                                  0354
@DE00347 L     @14,ESAULAD                                         0354
         LTR   @14,@14                                             0354
         BNZ   @DL00347                                            0354
*   /*****************************************************************/
*   /*                                                               */
*   /* IF NOT FOUND IN CDES, SEARCH LPDES                            */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0355
*REHASH:                                                           0355
*   HASHED=PGMNAME(1:4)&&PGMNAME(5:8);/* EXLUSIVE OR HALVES          */
REHASH   ICM   @14,15,PGMNAME                                      0355
         ICM   @08,15,PGMNAME+4                                    0355
         XR    @14,@08                                             0355
         ST    @14,HASHED                                          0355
*   ESAUSYM='CVTVVMDI';             /* SYMBOL                        */
         MVI   ESAUSYM+8,C' '                                      0356
         MVC   ESAUSYM+9(22),ESAUSYM+8                             0356
         MVC   ESAUSYM(8),@CC01945                                 0356
*   ESAUDT=ESCODT;                  /* DATA TYPE                     */
         MVC   ESAUDT(34),ESCODT                                   0357
*   ESAUDTY='A';                    /* POINTER DATA TYPE             */
         MVI   ESAUDTY,C'A'                                        0358
*   ESAULAD=THECVTPT;               /* ->CVT                         */
         ST    THECVTPT,ESAULAD                                    0359
*   ESAUDLE=4;                      /* WORD                          */
         MVC   ESAUDLE(4),@CF00040                                 0360
*   ESAUDOF=ADDR(CVTVVMDI)-ADDR(CVT);/* OFFSET                       */
         MVC   ESAUDOF(4),@CF01971                                 0361
*   CALL BLSRACC(ZZ2,ESAU,BUFB);    /* RETRIEVE CVT.CVTVVMDI         */
         ST    R9,@AL00001                                         0362
         LA    @14,ESAU                                            0362
         ST    @14,@AL00001+4                                      0362
         ST    BUFP,@AL00001+8                                     0362
         L     @08,ZZ2RVTP(,R9)                                    0362
         L     @15,RVTRACCP(,@08)                                  0362
         LA    @01,@AL00001                                        0362
         BALR  @14,@15                                             0362
*   IF RF^=0 THEN                   /* ERROR DURING RETRIEVAL        */
         LTR   RF,RF                                               0363
         BNZ   @RT00363                                            0363
*     GO TO NOTFOUND;               /* EXIT WITH PDL                 */
*   SAVEVMDI=FIRSTWRD;              /* SAVE CVTVVMDI                 */
         L     @14,FIRSTWRD(,BUFP)                                 0365
         ST    @14,SAVEVMDI                                        0365
*   ESAUDOF=ADDR(CVTDIRST)-ADDR(CVT);/* OFFSET                       */
         MVC   ESAUDOF(4),@CF01972                                 0366
*   ESAUSYM='CVTDIRST';             /* SYMBOL                        */
         MVI   ESAUSYM+8,C' '                                      0367
         MVC   ESAUSYM+9(22),ESAUSYM+8                             0367
         MVC   ESAUSYM(8),@CC01946                                 0367
*   CALL BLSRACC(ZZ2,ESAU,BUFB);    /* RETRIEVE CVT.CVTDIRST         */
         ST    R9,@AL00001                                         0368
         LA    @14,ESAU                                            0368
         ST    @14,@AL00001+4                                      0368
         ST    BUFP,@AL00001+8                                     0368
         L     @08,ZZ2RVTP(,R9)                                    0368
         L     @15,RVTRACCP(,@08)                                  0368
         LA    @01,@AL00001                                        0368
         BALR  @14,@15                                             0368
*   IF RF^=0 THEN                   /* ERROR DURING RETRIEVAL        */
         LTR   RF,RF                                               0369
         BNZ   @RT00369                                            0369
*     GO TO NOTFOUND;               /* EXIT WITH PDL                 */
*   RESPECIFY                                                      0371
*    (R2,                                                          0371
*     R3) RESTRICTED;                                              0371
*   R2=0;                           /* ZERO LOW REG                  */
         SLR   R2,R2                                               0372
*   R3=HASHED;                      /* PUT HASHED NAME IN HI REG     */
         L     R3,HASHED                                           0373
*   GENERATE REFS(HASHED,SAVEVMDI) SETS(R2,R3) CODE(D     R2,SAVEVMDI);
         D     R2,SAVEVMDI
*   ESAULAD=((R2*(LENGTH(LPDE)))+(FIRSTWRD&ZEROFOXS))&ZEROFOXS;/* SET
*                                      ADDRESS                       */
         L     @14,@CF01906                                        0375
         LA    @08,40                                              0375
         LR    @01,R2                                              0375
         MR    @00,@08                                             0375
         L     @04,FIRSTWRD(,BUFP)                                 0375
         NR    @04,@14                                             0375
         ALR   @01,@04                                             0375
         NR    @01,@14                                             0375
         ST    @01,ESAULAD                                         0375
*   RESPECIFY                                                      0376
*    (R2,                                                          0376
*     R3) UNRESTRICTED;                                            0376
*   ESAUDOF=0;                      /* OFFSET                        */
         SLR   @14,@14                                             0377
         ST    @14,ESAUDOF                                         0377
*   ESAUDLE=LENGTH(LPDE);           /* LENGTH                        */
         ST    @08,ESAUDLE                                         0378
*   ESAUSYM='LPDE';                 /* NAME                          */
         MVI   ESAUSYM+4,C' '                                      0379
         MVC   ESAUSYM+5(26),ESAUSYM+4                             0379
         MVC   ESAUSYM(4),@CC01947                                 0379
*   DO WHILE(ESAULAD^=0);           /* SEARCH LPDE CHAIN             */
         B     @DE00380                                            0380
@DL00380 DS    0H                                                  0381
*     CALL BLSRACC(ZZ2,ESAU,BUFB);  /* RETRIEVE IMAGE OF LPDE        */
         ST    R9,@AL00001                                         0381
         LA    @14,ESAU                                            0381
         ST    @14,@AL00001+4                                      0381
         ST    BUFP,@AL00001+8                                     0381
         L     @08,ZZ2RVTP(,R9)                                    0381
         L     @15,RVTRACCP(,@08)                                  0381
         LA    @01,@AL00001                                        0381
         BALR  @14,@15                                             0381
*     IF RF^=0 THEN                 /* ERROR DURING RETRIEVAL        */
         LTR   RF,RF                                               0382
         BNZ   @RT00382                                            0382
*       GO TO NOTFOUND;             /* EXIT WITH PDL                 */
*     IF LPDENAME=PGMNAME THEN      /* REQUESTED PROGRAM NAME        */
         CLC   LPDENAME(8,BUFP),PGMNAME                            0384
         BE    @RT00384                                            0384
*       GO TO FONDLPDE;             /* PROCESS LPDE FOR PROGRAM      */
*     ESAULAD=LPDECHN;              /* ->NEXT LPDE                   */
         L     @14,LPDECHN(,BUFP)                                  0386
         ST    @14,ESAULAD                                         0386
*   END;                                                           0387
@DE00380 L     @14,ESAULAD                                         0387
         LTR   @14,@14                                             0387
         BNZ   @DL00380                                            0387
*   GO TO NOTFOUND;                 /* NOT FOUND                     */
         B     NOTFOUND                                            0388
*                                                                  0389
*   /*****************************************************************/
*   /*                                                               */
*   /* MATCHING LPDE FOUND                                           */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0389
*FONDLPDE:                                                         0389
*   ESAUSYM=ESCOSYM;                /* INIT SYMBOL RECORD            */
FONDLPDE MVC   ESAUSYM(31),ESCOSYM                                 0389
*   ESAUSYM(1:4)='LPDE';            /* SYMBOL                        */
         MVC   ESAUSYM(4),@CC01947                                 0390
*   ESAUSYM(5:12)=LPDENAME;         /* MOVE NAME                     */
         MVC   ESAUSYM+4(8),LPDENAME(BUFP)                         0391
*   ESAUDTY='M';                    /* STRUCTURE                     */
         MVI   ESAUDTY,C'M'                                        0392
*   ESAUDTD='LPDE';                 /* DICT NAME                     */
         MVI   ESAUDTD+4,C' '                                      0393
         MVC   ESAUDTD+5(26),ESAUDTD+4                             0393
         MVC   ESAUDTD(4),@CC01947                                 0393
*   CALL BLSRESAR(ZZ2,ESAU);        /* ADD/REPLACE ES RECORD         */
         ST    R9,@AL00001                                         0394
         LA    @14,ESAU                                            0394
         ST    @14,@AL00001+4                                      0394
         L     @08,ZZ2RVTP(,R9)                                    0394
         L     @15,RVTESARP(,@08)                                  0394
         LA    @01,@AL00001                                        0394
         BALR  @14,@15                                             0394
*   IF LPDEMIN='1'B THEN            /* MINOR LPDE                    */
*                                                                  0395
         TM    LPDEMIN(BUFP),B'00000100'                           0395
         BNO   @RF00395                                            0395
*     /***************************************************************/
*     /*                                                             */
*     /* MINOR LPDE                                                  */
*     /*                                                             */
*     /***************************************************************/
*                                                                  0396
*     DO;                           /* MINOR LPDE                    */
*       FLAGMINR='1'B;              /* INDICATE MINOR                */
         OI    FLAGMINR,B'10000000'                                0397
*       MINRENTP=LPDENTP;           /* ->MINOR ENTRY POINT           */
         L     MINRENTP,LPDENTP(,BUFP)                             0398
*       MINRNAME=LPDENAME;          /* MINOR NAME                    */
         MVC   MINRNAME(8),LPDENAME(BUFP)                          0399
*       PGMNAME=LPDEMJNM;           /* REPLACE WITH MAJOR NAME       */
         MVC   PGMNAME(8),LPDEMJNM(BUFP)                           0400
*       IN81L=12;                   /* LENGTH OF INSERT              */
         MVC   IN81L(2),@CH00033                                   0401
*       IN81O=ADDR(M016T2)-ADDR(M016T);/* SET SEGMENT OFFSET         */
         MVC   IN81O(2),@CH01973                                   0402
*       IN81T1=LPDEMJNM;            /* NEW NAME                      */
         MVC   IN81T1(8),LPDEMJNM(BUFP)                            0403
*       OLDN=2;                     /* NUMBER OF SEGMENTS            */
         MVC   OLDN(4),@CF00068                                    0404
*       OLDP(1)=ADDR(M016);         /* 1ST SEG                       */
         LA    @14,M016                                            0405
         ST    @14,OLDP                                            0405
*       OLDP(2)=ADDR(IN81);         /* 2ND SEG                       */
         LA    @14,IN81                                            0406
         ST    @14,OLDP+4                                          0406
*       CALL BLSUPUTO(ZZ2,OLD);                                    0407
         ST    R9,@AL00001                                         0407
         LA    @14,OLD                                             0407
         ST    @14,@AL00001+4                                      0407
         L     @08,ZZ2BVTP(,R9)                                    0407
         L     @15,BVTPUTOP(,@08)                                  0407
         LA    @01,@AL00001                                        0407
         BALR  @14,@15                                             0407
*       GO TO REHASH;               /* CONTINUE WITH MAJOR NAME      */
         B     REHASH                                              0408
*     END;                                                         0409
*                                                                  0410
*   /*****************************************************************/
*   /*                                                               */
*   /* MAJOR LPDE FOUND                                              */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0410
*   ESAUSYM=PGMNAME;                /* SYMBOL                        */
@RF00395 MVI   ESAUSYM+8,C' '                                      0410
         MVC   ESAUSYM+9(22),ESAUSYM+8                             0410
         MVC   ESAUSYM(8),PGMNAME                                  0410
*   ESAUDTY='L';                    /* MODULE                        */
         MVI   ESAUDTY,C'L'                                        0411
*   ESAUDTD=PGMNAME;                /* DICT                          */
         MVI   ESAUDTD+8,C' '                                      0412
         MVC   ESAUDTD+9(22),ESAUDTD+8                             0412
         MVC   ESAUDTD(8),PGMNAME                                  0412
*   ESAUDOF=0;                                                     0413
         SLR   @14,@14                                             0413
         ST    @14,ESAUDOF                                         0413
*   LPDEXTLN=LPDEXTLN&ZEROFOXS;     /* LENGTH                        */
         L     @14,LPDEXTLN(,BUFP)                                 0414
         N     @14,@CF01906                                        0414
         ST    @14,LPDEXTLN(,BUFP)                                 0414
*   ESAUDLE=LPDEXTLN-(LPDENTP-LPDEXTAD);/* LENGTH IS FROM EP TO END  */
         L     @08,LPDENTP(,BUFP)                                  0415
         LR    @06,@08                                             0415
         SL    @06,LPDEXTAD(,BUFP)                                 0415
         SLR   @14,@06                                             0415
         ST    @14,ESAUDLE                                         0415
*   ESAULAD=LPDENTP;                /* ADDRESS                       */
         ST    @08,ESAULAD                                         0416
*   CALL BLSRESAR(ZZ2,ESAU);        /* ADD/REPLACE ES RECORD         */
         ST    R9,@AL00001                                         0417
         LA    @14,ESAU                                            0417
         ST    @14,@AL00001+4                                      0417
         L     @08,ZZ2RVTP(,R9)                                    0417
         L     @15,RVTESARP(,@08)                                  0417
         LA    @01,@AL00001                                        0417
         BALR  @14,@15                                             0417
*   IF FLAGMINR='1'B THEN           /* MINOR LPDE                    */
*                                                                  0418
         TM    FLAGMINR,B'10000000'                                0418
         BNO   @RF00418                                            0418
*     /***************************************************************/
*     /*                                                             */
*     /* MINOR LPDE                                                  */
*     /*                                                             */
*     /***************************************************************/
*                                                                  0419
*     DO;                           /* MINOR LPDE                    */
*       ESAUSYM=MINRNAME;           /* MINOR NAME                    */
         MVI   ESAUSYM+8,C' '                                      0420
         MVC   ESAUSYM+9(22),ESAUSYM+8                             0420
         MVC   ESAUSYM(8),MINRNAME                                 0420
*       ESAUDTD=ESAUSYM;            /* DICT                          */
         MVC   ESAUDTD(31),ESAUSYM                                 0421
*       ESAULAD=MINRENTP;           /* ->MINOR ENTRY POINT           */
         ST    MINRENTP,ESAULAD                                    0422
*       ESAUDLE=LPDEXTLN-(ESAULAD-LPDEXTAD);/* LENGTH                */
         L     @14,ESAULAD                                         0423
         SL    @14,LPDEXTAD(,BUFP)                                 0423
         LCR   @14,@14                                             0423
         AL    @14,LPDEXTLN(,BUFP)                                 0423
         ST    @14,ESAUDLE                                         0423
*       CALL BLSRESAR(ZZ2,ESAU);    /* ADD/REPLACE ES RECORD         */
         ST    R9,@AL00001                                         0424
         LA    @14,ESAU                                            0424
         ST    @14,@AL00001+4                                      0424
         L     @08,ZZ2RVTP(,R9)                                    0424
         L     @15,RVTESARP(,@08)                                  0424
         LA    @01,@AL00001                                        0424
         BALR  @14,@15                                             0424
*     END;                                                         0425
*   IF ZZ2AFV='1'B THEN             /* VERIFY                        */
@RF00418 TM    ZZ2AFV(R9),B'00001000'                              0426
         BNO   @RF00426                                            0426
*     CALL BLST01(ZZ2,ESAU);        /* DUMP BLOCK                    */
         ST    R9,@AL00001                                         0427
         LA    @14,ESAU                                            0427
         ST    @14,@AL00001+4                                      0427
         L     @08,ZZ2RVTP(,R9)                                    0427
         L     @15,RVTT01P(,@08)                                   0427
         LA    @01,@AL00001                                        0427
         BALR  @14,@15                                             0427
*   RETC=0;                         /* SUCCESSFUL                    */
@RF00426 SLR   RETC,RETC                                           0428
*   RF=0;                                                          0429
         SLR   RF,RF                                               0429
*   GO TO EXITRLSA;                 /* EXIT WITH PDL                 */
         B     EXITRLSA                                            0430
*                                                                  0431
*   /*****************************************************************/
*   /*                                                               */
*   /* MODULE NOT FOUND                                              */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0431
*NOTFOUND:                                                         0431
*   CALL BLSUPUTV(ZZ2,M015);        /* TRANSMIT NOT FOUND MESSAGE    */
NOTFOUND ST    R9,@AL00001                                         0431
         LA    @14,M015                                            0431
         ST    @14,@AL00001+4                                      0431
         L     @08,ZZ2BVTP(,R9)                                    0431
         L     @15,BVTPUTVP(,@08)                                  0431
         LA    @01,@AL00001                                        0431
         BALR  @14,@15                                             0431
*   RETC=ZZZFLAGW;                  /* UNSUCCESSFUL SEARCH           */
         LA    RETC,4                                              0432
*   GO TO EXITRLSA;                                                0433
         B     EXITRLSA                                            0433
*                                                                  0434
*   /*****************************************************************/
*   /*                                                               */
*   /* MODULE FOUND VIA CDE                                          */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0434
*OUTLOOP:                                                          0434
*   MAJRENTP=CDENTPT;               /* ->MAJOR ENTRY POINT           */
OUTLOOP  L     MAJRENTP,CDENTPT(,BUFP)                             0434
*   MAJRNAME=CDNAME;                /* MAJOR NAME                    */
         MVC   MAJRNAME(8),CDNAME(BUFP)                            0435
*   IF CDMIN='1'B THEN              /* MINOR CDE                     */
*                                                                  0436
         TM    CDMIN(BUFP),B'00000100'                             0436
         BNO   @RF00436                                            0436
*     /***************************************************************/
*     /*                                                             */
*     /* MINOR CDE                                                   */
*     /*                                                             */
*     /***************************************************************/
*                                                                  0437
*     DO;                           /* MINOR CDE                     */
*       FLAGMINR='1'B;              /* MINOR CDE                     */
         OI    FLAGMINR,B'10000000'                                0438
*       ESAUSYM=ESCOSYM;            /* SYMBOL                        */
         MVC   ESAUSYM(31),ESCOSYM                                 0439
*       ESAUSYM(1:3)='CDE';                                        0440
         MVC   ESAUSYM(3),@CC01941                                 0440
*       ESAUSYM(4:11)=CDNAME;                                      0441
         MVC   ESAUSYM+3(8),CDNAME(BUFP)                           0441
*       ESAUDTY='M';                /* STRUCTURE                     */
         MVI   ESAUDTY,C'M'                                        0442
*       ESAUDTD='CDE';              /* DICT NAME                     */
         MVI   ESAUDTD+3,C' '                                      0443
         MVC   ESAUDTD+4(27),ESAUDTD+3                             0443
         MVC   ESAUDTD(3),@CC01941                                 0443
*       CALL BLSRESAR(ZZ2,ESAU);    /* ADD/REPLACE ES RECORD         */
         ST    R9,@AL00001                                         0444
         LA    @14,ESAU                                            0444
         ST    @14,@AL00001+4                                      0444
         L     @08,ZZ2RVTP(,R9)                                    0444
         L     @15,RVTESARP(,@08)                                  0444
         LA    @01,@AL00001                                        0444
         BALR  @14,@15                                             0444
*       MINRENTP=CDENTPT;           /* ->MINOR ENTRY POINT           */
         L     MINRENTP,CDENTPT(,BUFP)                             0445
*       MINRNAME=CDNAME;            /* MINOR NAME                    */
         MVC   MINRNAME(8),CDNAME(BUFP)                            0446
*       ESAULAD=CDXLMJP;            /* ->MAJOR CDE                   */
         L     @14,CDXLMJP(,BUFP)                                  0447
         ST    @14,ESAULAD                                         0447
*       ESAUSYM='MAJOR CDE';        /* SYMBOL                        */
         MVI   ESAUSYM+9,C' '                                      0448
         MVC   ESAUSYM+10(21),ESAUSYM+9                            0448
         MVC   ESAUSYM(9),@CC01952                                 0448
*       CALL BLSRACC(ZZ2,ESAU,BUFB);/* RETRIEVE IMAGE OF CDE         */
         ST    R9,@AL00001                                         0449
         LA    @14,ESAU                                            0449
         ST    @14,@AL00001+4                                      0449
         ST    BUFP,@AL00001+8                                     0449
         L     @08,ZZ2RVTP(,R9)                                    0449
         L     @15,RVTRACCP(,@08)                                  0449
         LA    @01,@AL00001                                        0449
         BALR  @14,@15                                             0449
*       IF RF^=0 THEN               /* ERROR DURING RETRIEVAL        */
         LTR   RF,RF                                               0450
         BNZ   @RT00450                                            0450
*         GO TO NOTFOUND;           /* EXIT WITH PDL                 */
*       MAJRENTP=CDENTPT;           /* ->MAJOR ENTRY POINT           */
         L     MAJRENTP,CDENTPT(,BUFP)                             0452
*       MAJRNAME=CDNAME;            /* MAJOR NAME                    */
         MVC   MAJRNAME(8),CDNAME(BUFP)                            0453
*       IN81L=12;                   /* LENGTH OF INSERT              */
         MVC   IN81L(2),@CH00033                                   0454
*       IN81O=ADDR(M016T2)-ADDR(M016T);                            0455
         MVC   IN81O(2),@CH01973                                   0455
*       IN81T1=MAJRNAME;            /* MAJOR NAME                    */
         MVC   IN81T1(8),MAJRNAME                                  0456
*       OLDN=2;                                                    0457
         MVC   OLDN(4),@CF00068                                    0457
*       OLDP(1)=ADDR(M016);         /* 1ST SEG                       */
         LA    @14,M016                                            0458
         ST    @14,OLDP                                            0458
*       OLDP(2)=ADDR(IN81);         /* 2ND SEG                       */
         LA    @14,IN81                                            0459
         ST    @14,OLDP+4                                          0459
*       CALL BLSUPUTO(ZZ2,OLD);     /* TRANSMIT MESSAGE M016         */
         ST    R9,@AL00001                                         0460
         LA    @14,OLD                                             0460
         ST    @14,@AL00001+4                                      0460
         L     @08,ZZ2BVTP(,R9)                                    0460
         L     @15,BVTPUTOP(,@08)                                  0460
         LA    @01,@AL00001                                        0460
         BALR  @14,@15                                             0460
*     END;                                                         0461
*   ESAUSYM=ESCOSYM;                /* SYMBOL                        */
@RF00436 MVC   ESAUSYM(31),ESCOSYM                                 0462
*   ESAUSYM(1:3)='CDE';                                            0463
         MVC   ESAUSYM(3),@CC01941                                 0463
*   ESAUSYM(4:11)=CDNAME;                                          0464
         MVC   ESAUSYM+3(8),CDNAME(BUFP)                           0464
*   ESAUDTY='M';                    /* STRUCTURE                     */
         MVI   ESAUDTY,C'M'                                        0465
*   ESAUDTD='CDE';                  /* DICT NAME                     */
         MVI   ESAUDTD+3,C' '                                      0466
         MVC   ESAUDTD+4(27),ESAUDTD+3                             0466
         MVC   ESAUDTD(3),@CC01941                                 0466
*   CALL BLSRESAR(ZZ2,ESAU);        /* ADD/REPLACE ES RECORD         */
         ST    R9,@AL00001                                         0467
         LA    @14,ESAU                                            0467
         ST    @14,@AL00001+4                                      0467
         L     @08,ZZ2RVTP(,R9)                                    0467
         L     @15,RVTESARP(,@08)                                  0467
         LA    @01,@AL00001                                        0467
         BALR  @14,@15                                             0467
*                                                                  0468
*   /*****************************************************************/
*   /*                                                               */
*   /* GIVEN MAJOR CDE, GET EXTENT LIST                              */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0468
*   ESAUSYM=ESCOSYM;                /* SYMBOL                        */
         MVC   ESAUSYM(31),ESCOSYM                                 0468
*   ESAUSYM(1:2)='XL';                                             0469
         MVC   ESAUSYM(2),@CC01954                                 0469
*   ESAUSYM(3:10)=CDNAME;                                          0470
         MVC   ESAUSYM+2(8),CDNAME(BUFP)                           0470
*   ESAUDTD='XTLST';                /* DICT NAME                     */
         MVI   ESAUDTD+5,C' '                                      0471
         MVC   ESAUDTD+6(25),ESAUDTD+5                             0471
         MVC   ESAUDTD(5),@CC01955                                 0471
*   ESAULAD=CDXLMJP;                /* EXTENT LIST ADDRESS           */
         L     @14,CDXLMJP(,BUFP)                                  0472
         ST    @14,ESAULAD                                         0472
*   ESAUDLE=LENGTH(XTLST);          /* LENGTH OF EXTENT LIST         */
         MVC   ESAUDLE(4),@CF00054                                 0473
*   CALL BLSRESAR(ZZ2,ESAU);        /* ADD/REPLACE ES RECORD         */
         ST    R9,@AL00001                                         0474
         LA    @14,ESAU                                            0474
         ST    @14,@AL00001+4                                      0474
         L     @08,ZZ2RVTP(,R9)                                    0474
         L     @15,RVTESARP(,@08)                                  0474
         LA    @01,@AL00001                                        0474
         BALR  @14,@15                                             0474
*   CALL BLSRACC(ZZ2,ESAU,BUFB);    /* RETRIEVE IMAGE OF EXTENT LIST */
         ST    R9,@AL00001                                         0475
         LA    @14,ESAU                                            0475
         ST    @14,@AL00001+4                                      0475
         ST    BUFP,@AL00001+8                                     0475
         L     @08,ZZ2RVTP(,R9)                                    0475
         L     @15,RVTRACCP(,@08)                                  0475
         LA    @01,@AL00001                                        0475
         BALR  @14,@15                                             0475
*   IF RF^=0 THEN                   /* ERROR DURING RETRIEVAL        */
         LTR   RF,RF                                               0476
         BNZ   @RT00476                                            0476
*     GO TO NOTFOUND;               /* EXIT WITH PDL                 */
*   ESAUSYM=MAJRNAME;               /* MAJOR NAME                    */
         MVI   ESAUSYM+8,C' '                                      0478
         MVC   ESAUSYM+9(22),ESAUSYM+8                             0478
         MVC   ESAUSYM(8),MAJRNAME                                 0478
*   ESAULAD=MAJRENTP;               /* ->MAJOR ENTRY POINT           */
         ST    MAJRENTP,ESAULAD                                    0479
*   ESAUDTY='L';                    /* MODULE DATA TYPE              */
         MVI   ESAUDTY,C'L'                                        0480
*   ESAUDTD=ESAUSYM;                /* DICTIONARY                    */
         MVC   ESAUDTD(31),ESAUSYM                                 0481
*   XTLMSBLN=XTLMSBLN&ZEROFOXS;     /* LENGTH OF MODULE              */
         L     @14,XTLMSBLN-1(,BUFP)                               0482
         LA    @14,0(,@14)                                         0482
         N     @14,@CF01906                                        0482
         STCM  @14,7,XTLMSBLN(BUFP)                                0482
*   ESAUDLE=XTLMSBLN-(MAJRENTP-XTLMSBAD);/* LENGTH                   */
         LR    @08,MAJRENTP                                        0483
         L     @06,XTLMSBAD-1(,BUFP)                               0483
         LA    @06,0(,@06)                                         0483
         SLR   @08,@06                                             0483
         SLR   @14,@08                                             0483
         ST    @14,ESAUDLE                                         0483
*   CALL BLSRESAR(ZZ2,ESAU);        /* ADD/REPLACE ES RECORD         */
         ST    R9,@AL00001                                         0484
         LA    @14,ESAU                                            0484
         ST    @14,@AL00001+4                                      0484
         L     @08,ZZ2RVTP(,R9)                                    0484
         L     @15,RVTESARP(,@08)                                  0484
         LA    @01,@AL00001                                        0484
         BALR  @14,@15                                             0484
*   IF FLAGMINR='1'B THEN           /* MINOR ENTRY POINT             */
*                                                                  0485
         TM    FLAGMINR,B'10000000'                                0485
         BNO   @RF00485                                            0485
*     /***************************************************************/
*     /*                                                             */
*     /* MINOR ENTRY POINT                                           */
*     /*                                                             */
*     /***************************************************************/
*                                                                  0486
*     DO;                           /* MINOR ENTRY POINT             */
*       ESAUSYM=MINRNAME;           /* MINOR NAME                    */
         MVI   ESAUSYM+8,C' '                                      0487
         MVC   ESAUSYM+9(22),ESAUSYM+8                             0487
         MVC   ESAUSYM(8),MINRNAME                                 0487
*       ESAULAD=MINRENTP;           /* ->MINOR ENTRY POINT           */
         ST    MINRENTP,ESAULAD                                    0488
*       ESAUDTD=ESAUSYM;            /* DICTIONARY                    */
         MVC   ESAUDTD(31),ESAUSYM                                 0489
*       ESAUDLE=XTLMSBLN-(MINRENTP-XTLMSBAD);/* LENGTH               */
         LR    @14,MINRENTP                                        0490
         L     @08,XTLMSBAD-1(,BUFP)                               0490
         LA    @08,0(,@08)                                         0490
         SLR   @14,@08                                             0490
         LCR   @14,@14                                             0490
         L     @08,XTLMSBLN-1(,BUFP)                               0490
         LA    @08,0(,@08)                                         0490
         ALR   @14,@08                                             0490
         ST    @14,ESAUDLE                                         0490
*       CALL BLSRESAR(ZZ2,ESAU);    /* ADD/REPLACE ES RECORD         */
         ST    R9,@AL00001                                         0491
         LA    @14,ESAU                                            0491
         ST    @14,@AL00001+4                                      0491
         L     @08,ZZ2RVTP(,R9)                                    0491
         L     @15,RVTESARP(,@08)                                  0491
         LA    @01,@AL00001                                        0491
         BALR  @14,@15                                             0491
*     END;                                                         0492
*   IF ZZ2AFV='1'B THEN             /* VERIFY                        */
@RF00485 TM    ZZ2AFV(R9),B'00001000'                              0493
         BNO   @RF00493                                            0493
*     CALL BLST01(ZZ2,ESAU);        /* DUMP BLOCK                    */
         ST    R9,@AL00001                                         0494
         LA    @14,ESAU                                            0494
         ST    @14,@AL00001+4                                      0494
         L     @08,ZZ2RVTP(,R9)                                    0494
         L     @15,RVTT01P(,@08)                                   0494
         LA    @01,@AL00001                                        0494
         BALR  @14,@15                                             0494
*   RETC=0;                         /* SUCCESSFUL                    */
@RF00493 SLR   RETC,RETC                                           0495
*   RF=0;                           /* SUCCESS                       */
         SLR   RF,RF                                               0496
*                                                                  0497
*   /*****************************************************************/
*   /*                                                               */
*   /* PROGRAM EXIT                                                  */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0497
*EXITRLSA:                          /* EXIT WITH PDL                 */
*   RETC=MIN(MAX(RF,RETC),ZZZFLAGT);/* SET MAX RETURN CODE           */
EXITRLSA LR    @14,RETC                                            0497
         CR    @14,RF                                              0497
         BNL   *+6
         LR    @14,RF                                              0497
         LA    @08,16                                              0497
         CR    @14,@08                                             0497
         BNH   *+6
         LR    @14,@08                                             0497
         LR    RETC,@14                                            0497
*   IF RETC=0 THEN                  /* NORMAL RETURN                 */
*                                                                  0498
         LTR   RETC,RETC                                           0498
         BNZ   @RF00498                                            0498
*     /***************************************************************/
*     /*                                                             */
*     /* NORMAL RETURN                                               */
*     /*                                                             */
*     /***************************************************************/
*                                                                  0499
*     DO;                           /* NORMAL RETURN                 */
*       ESAUSYM='X';                /* CHANGE SYMBOL TO X            */
         MVI   ESAUSYM+1,C' '                                      0500
         MVC   ESAUSYM+2(29),ESAUSYM+1                             0500
         MVI   ESAUSYM,C'X'                                        0500
*       CALL BLSRESAR(ZZ2,ESAU);    /* ADD/REPLACE ES RECORD         */
         ST    R9,@AL00001                                         0501
         LA    @14,ESAU                                            0501
         ST    @14,@AL00001+4                                      0501
         L     @08,ZZ2RVTP(,R9)                                    0501
         L     @15,RVTESARP(,@08)                                  0501
         LA    @01,@AL00001                                        0501
         BALR  @14,@15                                             0501
*     END;                                                         0502
*   DO WHILE(PDAPTR^=0);            /* BLRRLSA MF(E,PD)              */
@RF00498 B     @DE00503                                            0503
@DL00503 DS    0H                                                  0504
*     PDRPTR=PDAPTR;                                               0504
         L     PDRPTR,PDAPTR                                       0504
*     PDAPTR=PDXP;                                                 0505
         L     @14,PDXP-1(,PDRPTR)                                 0505
         LA    @14,0(,@14)                                         0505
         ST    @14,PDAPTR                                          0505
*     DO;                           /* FREEMAIN(R)                 0506
*                                      LV(PDL)SP(1)A(PDDSECT)        */
*       RESPECIFY                                                  0507
*        (GPR01F,                                                  0507
*         GPR00F) RESTRICTED;                                      0507
*       GPR00F=PDL;                 /* LENGTH REQUESTED              */
         L     GPR00F,PDL-1(,PDRPTR)                               0508
         ICM   GPR00F,8,@CB01723                                   0508
*       GPR01F=1;                   /* SP IN REG 1                   */
         LA    GPR01F,1                                            0509
*       GEN(SLL   GPR01F,24)                                       0510
*       NODEFS NOREFS NOSETS NOEXIT NOFLOWS SEQFLOW;               0510
         SLL   GPR01F,24
*       GPR00F=GPR00F×GPR01F;       /* SP IN HI BYTE                 */
         OR    GPR00F,GPR01F                                       0511
*       GPR01F=ADDR(PDDSECT);       /* SET REGISTER ONE              */
         LR    GPR01F,PDRPTR                                       0512
*       SVC(10);                    /* R-FORM OF GETMAIN             */
         SVC   10                                                  0513
*       RESPECIFY                                                  0514
*        (GPR01F,                                                  0514
*         GPR00F) UNRESTRICTED;                                    0514
*     END;                          /* FREEMAIN(R)                 0515
*                                      LV(PDL)SP(1)A(PDDSECT)        */
*   END;                            /* BLRRLSA MF(E,PD)              */
@DE00503 L     @14,PDAPTR                                          0516
         LTR   @14,@14                                             0516
         BNZ   @DL00503                                            0516
*EXITNORL:                                                         0517
*   RETURN CODE(RETC);              /* MODULE EXIT                   */
EXITNORL L     @13,4(,@13)                                         0517
         L     @00,@SIZDATD                                        0517
         LR    @01,@11                                             0517
         BLSUFRER R,LV=(0),A=(1)
         LR    @15,@06                                             0517
         L     @14,12(,@13)                                        0517
         LM    @00,@12,20(@13)                                     0517
         BR    @14                                                 0517
*                                                                  0518
*/*BLSRPEND--DEBUGGING MODULE                                        */
*/*BLSUPEND--MVS IPCS MODULE                                         */
*                                                                  0518
*   DECLARE                         /* DATA FOR AHB MACROS           */
*     CNVCH CHARACTER(8) BOUNDARY(DWORD),/* DATA CONVERSION WORK AREA
*                                      FOR CHARACTER DATA            */
*     ZONED CHARACTER(16) BOUNDARY(DWORD);/* DATA CONVERSION WORK  0518
*                                      AREA                          */
*   DECLARE                         /* GENERAL PURPOSE REGISTERS     */
*     GPR00F FIXED(31) REG(0),                                     0519
*     GPR01F FIXED(31) REG(1),                                     0519
*     GPR15F FIXED(31) REG(15);                                    0519
*   DECLARE                         /* COMMON VARIABLES              */
*     I256C CHAR(256) BASED,                                       0520
*     I031F FIXED(31) BASED,                                       0520
*     I031P PTR(31) BASED,                                         0520
*     I015F FIXED(15) BASED,                                       0520
*     I015P PTR(15) BASED,                                         0520
*     I008P PTR(8) BASED,                                          0520
*     I001C CHAR(1) BASED;                                         0520
*   GENERATE NODEFS NOREFS DATA;                                   0521
*   END BLSRFMOD                    /* BLRPEND(BLSRFMOD)             */
*                                                                  0522
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */
*/*%INCLUDE SYSLIB  (BLSRZZZ )                                       */
*/*%INCLUDE SYSLIB  (BLSUZZZ )                                       */
*/*%INCLUDE SYSLIB  (BLRFULL )                                       */
*/*%INCLUDE SYSLIB  (IKJCPPL )                                       */
*/*%INCLUDE SYSLIB  (IKJPSCB )                                       */
*/*%INCLUDE SYSLIB  (IKJECT  )                                       */
*/*%INCLUDE SYSLIB  (IKJUPT  )                                       */
*/*%INCLUDE SYSLIB  (BLSUSERV)                                       */
*/*%INCLUDE SYSLIB  (BLRSERV )                                       */
*/*%INCLUDE SYSLIB  (BLRSERVD)                                       */
*/*%INCLUDE SYSLIB  (BLSRSERV)                                       */
*/*%INCLUDE SYSLIB  (CVT     )                                       */
*/*%INCLUDE SYSLIB  (IHACDE  )                                       */
*/*%INCLUDE SYSLIB  (IHAXTLST)                                       */
*/*%INCLUDE SYSLIB  (IHALPDE )                                       */
*                                                                  0522
*       ;                                                          0522
@EL00001 L     @13,4(,@13)                                         0522
@EF00001 L     @00,@SIZDATD                                        0522
         LR    @01,@11                                             0522
         BLSUFRER R,LV=(0),A=(1)
@ER00001 LM    @14,@12,12(@13)                                     0522
         BR    @14                                                 0522
@DATA    DS    0H
@CH00043 DC    H'1'
@CH01973 DC    H'40'
@SM01980 MVC   0(0,@08),PMODI(@04)
@SM01982 MVC   PGMNAME(0),PMODI(@08)
@SM01984 MVC   BUFTEST(0),PMODI(@04)
@SM01986 MVC   PGMNAME(0),BUFTES8
@DATD    DSECT
         DS    0F
@SA00001 DS    18F
@AL00001 DS    3A
BLSRFMOD CSECT
         DS    0F
@CF00068 DC    F'2'
@CH00068 EQU   @CF00068+2
@CF00040 DC    F'4'
@CF00051 DC    F'8'
@CH00051 EQU   @CF00051+2
@CF00033 DC    F'12'
@CH00033 EQU   @CF00033+2
@CF00054 DC    F'16'
@CF00062 DC    F'32'
@CF01970 DC    F'188'
@CF01972 DC    F'360'
@CF01971 DC    F'552'
@CF01906 DC    XL4'00FFFFFF'
@DATD    DSECT
         DS    0D
PDAPTR   DS    A
SAVEVMDI DS    A
HASHED   DS    F
         DS    CL4
ESAU     DS    CL694
         ORG   ESAU
ESAURID  DS    CL2
@NM00094 DS    BL6
@NM00095 DS    CL8
@NM00096 DS    BL8
ESAURDX  DS    FL4
ESAUSYM  DS    CL31
ESAUELK  DS    0C
ESAURV1  DS    CL1
ESAUAS   DS    CL16
         ORG   ESAUAS
ESAUAS0  DS    0C
ESAUAST  DS    CL2
@NM00097 DS    BL2
ESAUAS1  DS    FL4
ESAUAS2  DS    FL4
@NM00098 DS    BL4
ESAUAS9  DS    0C
         ORG   ESAU+76
ESAULAD  DS    AL4
ESAUD    DS    CL60
         ORG   ESAUD
ESAUD00  DS    0C
ESAUDOF  DS    FL4
ESAUDLE  DS    FL4
ESAUDOB  DS    FL1
ESAUDLB  DS    FL1
ESAUDT   DS    CL34
         ORG   ESAUDT
ESAUDT0  DS    0C
ESAUDTY  DS    CL1
@NM00099 DS    BL1
ESAUDTD  DS    CL31
ESAUDTE  DS    CL1
ESAUDT9  DS    0C
         ORG   ESAUD+44
ESAUDIM  DS    FL4
ESAUDIL  DS    FL4
ESAUDF   DS    BL4
         ORG   ESAUDF
ESAUDFA  DS    BL1
@NM00100 EQU   ESAUDF+0
         ORG   ESAUD+56
@NM00101 DS    BL4
ESAUD99  DS    0C
         ORG   ESAU+140
ESAUMAD  DS    AL4
@NM00102 DS    BL16
ESAUKEY  DS    BL1
ESAUF    DS    BL3
         ORG   ESAUF
ESAUFS   DS    BL1
         ORG   ESAUFS
ESAUFSC  DS    BL1
ESAUFS2  EQU   ESAUFS+0
ESAUFSM  EQU   ESAUFS+0
ESAUFSA  EQU   ESAUFS+0
ESAUFSP  EQU   ESAUFS+0
ESAUFSR  EQU   ESAUFS+0
ESAUFSX  EQU   ESAUFS+0
ESAUFSS  EQU   ESAUFS+0
         ORG   ESAUF+1
ESAUFC   DS    BL1
         ORG   ESAUFC
ESAUFCD  DS    BL1
@NM00103 EQU   ESAUFC+0
         ORG   ESAUF+2
@NM00104 DS    BL1
         ORG   ESAU+164
ESAUABS  DS    FL4
@NM00105 DS    BL12
ESAUR    DS    CL514
         ORG   ESAUR
ESAURL   DS    FL2
ESAURT   DS    CL512
         ORG   ESAURT
ESAURT1  DS    CL512
         ORG   ESAU+694
ESAU999  DS    0C
         ORG   ESAU+694
         DS    CL2
OLD      DS    CL12
         ORG   OLD
OLDN     DS    FL4
OLDP     DS    2A
         ORG   OLD+12
IN81     DS    CL12
         ORG   IN81
IN81L    DS    FL2
IN81O    DS    FL2
IN81T    DS    CL8
         ORG   IN81T
IN81T1   DS    CL8
         ORG   IN81+12
FLAG     DS    BL1
         ORG   FLAG
FLAGMINR DS    BL1
OK       EQU   FLAG+0
@NM00120 EQU   FLAG+0
         ORG   FLAG+1
BUFTEST  DS    CL16
BUFTES2  DS    CL16
         DS    CL7
BUFA     DS    CL256
MAJRNAME DS    CL8
MINRNAME DS    CL8
PGMNAME  DS    CL8
ZONED    DS    CL16
CNVCH    DS    CL8
BLSRFMOD CSECT
         DS    0F
@SIZDATD DC    AL1(0)
         DC    AL3(@ENDDATD-@DATD)
         DS    0D
PCPTR    DC    AL4(PC)
@CC01930 DC    C'0000000000000000'
@CC01952 DC    C'MAJOR CDE'
@CC01939 DC    C'CVTQLPAQ'
@CC01945 DC    C'CVTVVMDI'
@CC01946 DC    C'CVTDIRST'
@CC01940 DC    C'CDEPTR'
@CC01955 DC    C'XTLST'
@CC01947 DC    C'LPDE'
@CC01725 EQU   @CC01939
@CC01941 EQU   @CC01940
@CC01954 DC    C'XL'
@CB01723 DC    X'00'
         DS    CL1
DTCVT    DS    CL34
         ORG   DTCVT
DTCVT0   DS    0C
DTCVTY   DC    CL1'M'
@NM00093 DC    X'00'
DTCVTD   DC    CL31'CVT'
DTCVTE   DC    CL1' '
DTCVT9   DS    0C
         ORG   DTCVT+34
         DS    CL6
ESCO     DS    CL182
         ORG   ESCO
ESCORID  DC    CL2'ES'
@NM00106 DC    X'000000000000'
@NM00107 DC    CL8' '
@NM00108 DC    X'00'
         DC    XL7'0'
ESCORDX  DC    A(0)
ESCOSYM  DC    CL31' '
ESCOELK  DS    0C
ESCORV1  DC    CL1' '
ESCOAS   DS    CL16
         ORG   ESCOAS
ESCOAS0  DS    0C
ESCOAST  DC    CL2'  '
@NM00109 DC    X'0000'
ESCOAS1  DC    A(0)
ESCOAS2  DC    A(0)
@NM00110 DC    X'00'
         DC    XL3'0'
ESCOAS9  DS    0C
         ORG   ESCO+76
ESCOLAD  DC    A(0)
ESCOD    DS    CL60
         ORG   ESCOD
ESCOD00  DS    0C
ESCODOF  DC    F'0'
ESCODLE  DC    A(4)
ESCODOB  DC    AL1(0)
ESCODLB  DC    AL1(0)
ESCODT   DS    CL34
         ORG   ESCODT
ESCODT0  DS    0C
ESCODTY  DC    CL1'U'
@NM00111 DC    X'00'
ESCODTD  DC    CL31'                               '
ESCODTE  DC    CL1' '
ESCODT9  DS    0C
         ORG   ESCOD+44
ESCODIM  DC    A(0)
ESCODIL  DC    F'0'
ESCODF   DC    X'00000000'
         ORG   ESCODF
ESCODFA  DS    BL1
@NM00112 EQU   ESCODF+0
         ORG   ESCOD+56
@NM00113 DC    X'00'
         DC    XL3'0'
ESCOD99  DS    0C
         ORG   ESCO+140
ESCOMAD  DC    A(0)
@NM00114 DC    X'00'
         DC    XL15'0'
ESCOKEY  DS    BL1
ESCOF    DC    X'00'
         DC    XL2'0'
         ORG   ESCOF
ESCOFS   DS    BL1
         ORG   ESCOFS
ESCOFSC  DS    BL1
ESCOFS2  EQU   ESCOFS+0
ESCOFSM  EQU   ESCOFS+0
ESCOFSA  EQU   ESCOFS+0
ESCOFSP  EQU   ESCOFS+0
ESCOFSR  EQU   ESCOFS+0
ESCOFSX  EQU   ESCOFS+0
ESCOFSS  EQU   ESCOFS+0
         ORG   ESCOF+1
ESCOFC   DS    BL1
         ORG   ESCOFC
ESCOFCD  DS    BL1
@NM00115 EQU   ESCOFC+0
         ORG   ESCOF+2
@NM00116 DS    BL1
         ORG   ESCO+164
ESCOABS  DC    A(0)
@NM00117 DC    X'00'
         DC    XL11'0'
ESCOR    DS    CL2
         ORG   ESCOR
ESCORL   DC    AL2(0)
ESCORT   DS    0C
         ORG   ESCORT
ESCORT1  DS    0C
         ORG   ESCO+182
ESCO999  DS    0C
         ORG   ESCO+182
M015     DS    CL40
         ORG   M015
M015L    DC    AL2(40)
@NM00118 DC    X'0000'
M015T    DS    CL36
         ORG   M015T
M015TA   DC    CL36'BLS18015I REQUESTED MODULE NOT FOUND'
         ORG   M015+40
M016     DS    CL44
         ORG   M016
M016L    DC    AL2(44)
M016O    DC    AL2(0)
M016T    DS    CL40
         ORG   M016T
M016T1   DC    CL40'BLS18016I MAJOR NAME FOR THIS MODULE IS '
M016T2   DS    0C
         ORG   M016+44
M095     DS    CL33
         ORG   M095
M095L    DC    AL2(33)
@NM00119 DC    X'0000'
M095T    DS    CL29
         ORG   M095T
M095TA   DC    CL29'BLS18095I INVALID MODULE NAME'
         ORG   M095+33
         DS    CL1
PXDO     DC    AL2(PXDSPL-PD)
         DC    2AL2(0)
         DC    AL2(PXDRMK-PD)
         DC    AL2(PXDREQ-PD)
         DC    AL2(PXDSTG-PD)
         DC    AL2(PXDSYM-PD)
         DC    AL2(PXDMCH-PD)
         DC    3AL2(0)
PXRO     DC    AL2(PXPRINT-PD)
         DC    AL2(PXTERM-PD)
         DC    AL2(PXDFLG-PD)
         DC    AL2(PXDFLV-PD)
@DATD    DSECT
         SPACE 2
***********************************************************************
* THE FOLLOWING AREA, BLRPATCH, IS RESERVED FOR PATCH APPLICATION     *
* TO OBTAIN PATCH ROOM IN THE @DATD AUTOMATIC STORAGE AREA, MODIFY    *
* CONSTANT @SIZDATD TO REFLECT THE DESIRED @DATD SIZE                 *
***********************************************************************
         SPACE
BLSRFMOD CSECT
         ORG
         DS    0D
BLRPATCH DC    CL8'ZAPAREA',(((*-BLSRFMOD+19)/20+7)/8)CL8'BLSRFMOD'
@DATD    DSECT
         DS    0H
@DATD    DSECT
         SPACE 2
***********************************************************************
* IKJPARM--BEGIN MACROS SPECIFYING COMMAND SYNTAX                     *
***********************************************************************
         SPACE
BLSRFMOD CSECT
PC       IKJPARM DSECT=PD
@DATD    DSECT
BLSRFMOD CSECT
PMOD     IKJIDENT 'MODULE NAME',FIRST=ALPHA,MAXLNTH=16,OTHER=ALPHANUM, *
               PROMPT='MODULE NAME'
@DATD    DSECT
BLSRFMOD CSECT
HEXCHAR  IKJKEYWD DEFAULT='CHARACTER'
@DATD    DSECT
BLSRFMOD CSECT
         IKJNAME 'CHARACTER'
@DATD    DSECT
BLSRFMOD CSECT
         IKJNAME 'HEXADECIMAL'
@DATD    DSECT
BLSRFMOD CSECT
PXDSPL   IKJKEYWD
@DATD    DSECT
BLSRFMOD CSECT
         IKJNAME 'DISPLAY',SUBFLD=PXSUBFD
@DATD    DSECT
BLSRFMOD CSECT
         IKJNAME 'NODISPLAY',SUBFLD=PXSUBFD
@DATD    DSECT
BLSRFMOD CSECT
PXVER    IKJKEYWD
@DATD    DSECT
BLSRFMOD CSECT
         IKJNAME 'VERIFY'
@DATD    DSECT
BLSRFMOD CSECT
         IKJNAME 'NOVERIFY'
@DATD    DSECT
BLSRFMOD CSECT
PXPRINT  IKJKEYWD
@DATD    DSECT
BLSRFMOD CSECT
         IKJNAME 'PRINT'
@DATD    DSECT
BLSRFMOD CSECT
         IKJNAME 'NOPRINT'
@DATD    DSECT
BLSRFMOD CSECT
PXTERM   IKJKEYWD
@DATD    DSECT
BLSRFMOD CSECT
         IKJNAME 'TERMINAL'
@DATD    DSECT
BLSRFMOD CSECT
         IKJNAME 'NOTERMINAL'
@DATD    DSECT
BLSRFMOD CSECT
PXDFLG   IKJKEYWD
@DATD    DSECT
BLSRFMOD CSECT
         IKJNAME 'FLAG',SUBFLD=PXSUBFM
@DATD    DSECT
BLSRFMOD CSECT
PXTEST   IKJKEYWD
@DATD    DSECT
BLSRFMOD CSECT
         IKJNAME 'TEST'
@DATD    DSECT
BLSRFMOD CSECT
         IKJNAME 'NOTEST'
@DATD    DSECT
BLSRFMOD CSECT
         SPACE
PXSUBFM  IKJSUBF
@DATD    DSECT
BLSRFMOD CSECT
PXDFLV   IKJKEYWD
@DATD    DSECT
BLSRFMOD CSECT
         IKJNAME 'INFORMATIONAL'
@DATD    DSECT
BLSRFMOD CSECT
         IKJNAME 'WARNING'
@DATD    DSECT
BLSRFMOD CSECT
         IKJNAME 'ERROR'
@DATD    DSECT
BLSRFMOD CSECT
         IKJNAME 'SERIOUS',ALIAS=('SEVERE')
@DATD    DSECT
BLSRFMOD CSECT
         IKJNAME 'TERMINATING'
@DATD    DSECT
BLSRFMOD CSECT
         SPACE
PXSUBFD  IKJSUBF
@DATD    DSECT
BLSRFMOD CSECT
PXDRMK   IKJKEYWD
@DATD    DSECT
BLSRFMOD CSECT
         IKJNAME 'REMARK'
@DATD    DSECT
BLSRFMOD CSECT
         IKJNAME 'NOREMARK'
@DATD    DSECT
BLSRFMOD CSECT
PXDREQ   IKJKEYWD
@DATD    DSECT
BLSRFMOD CSECT
         IKJNAME 'REQUEST'
@DATD    DSECT
BLSRFMOD CSECT
         IKJNAME 'NOREQUEST'
@DATD    DSECT
BLSRFMOD CSECT
PXDSTG   IKJKEYWD
@DATD    DSECT
BLSRFMOD CSECT
         IKJNAME 'STORAGE'
@DATD    DSECT
BLSRFMOD CSECT
         IKJNAME 'NOSTORAGE'
@DATD    DSECT
BLSRFMOD CSECT
PXDSYM   IKJKEYWD
@DATD    DSECT
BLSRFMOD CSECT
         IKJNAME 'SYMBOL'
@DATD    DSECT
BLSRFMOD CSECT
         IKJNAME 'NOSYMBOL'
@DATD    DSECT
BLSRFMOD CSECT
PXDMCH   IKJKEYWD
@DATD    DSECT
BLSRFMOD CSECT
         IKJNAME 'MACHINE'
@DATD    DSECT
BLSRFMOD CSECT
         IKJNAME 'NOMACHINE'
@DATD    DSECT
PD       DSECT
PD99     DS    0C
BLSRFMOD CSECT
         IKJENDP
         SPACE 2
***********************************************************************
* IKJENDP--END SYNTAX DESCRIPTION                                     *
***********************************************************************
         SPACE
@DATD    DSECT
         SPACE 2
***********************************************************************
* ALIGN END OF DATA ON A DOUBLEWORD BOUNDARY                          *
***********************************************************************
         SPACE
         DS    0D
@DATD    DSECT
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA
@ENDDATD EQU   *
BLSRFMOD CSECT
@00      EQU   00                      EQUATES FOR REGISTERS 0-15
@01      EQU   01
@02      EQU   02
@03      EQU   03
@04      EQU   04
@05      EQU   05
@06      EQU   06
@07      EQU   07
@08      EQU   08
@09      EQU   09
@10      EQU   10
@11      EQU   11
@12      EQU   12
@13      EQU   13
@14      EQU   14
@15      EQU   15
RETC     EQU   @06
THECVTPT EQU   @06
MINRENTP EQU   @07
MAJRENTP EQU   @02
BUFP     EQU   @05
R9       EQU   @09
R0       EQU   @00
R1       EQU   @01
R2       EQU   @02
R3       EQU   @03
R4       EQU   @04
R5       EQU   @05
RB       EQU   @11
RD       EQU   @13
RE       EQU   @14
RF       EQU   @15
PDRPTR   EQU   @10
GPR15F   EQU   @15
GPR01F   EQU   @01
GPR00F   EQU   @00
RA       EQU   @10
RC       EQU   @12
R6       EQU   @06
R7       EQU   @07
R8       EQU   @08
ZZ1      EQU   0
ZZ1ATTN  EQU   ZZ1+360
ZZ1EVE   EQU   ZZ1ATTN+4
ZZ1F     EQU   ZZ1+368
ZZ1TRHEX EQU   ZZ1+568
ZZ1N     EQU   ZZ1+1116
ZZ1TRCTX EQU   ZZ1+1392
ZZ2      EQU   0
ZZ2AMD   EQU   ZZ2
@NM00013 EQU   ZZ2AMD+7
ZZ2PRT   EQU   ZZ2+138
ZZ2PRTT  EQU   ZZ2PRT+4
ZZ2PRTT1 EQU   ZZ2PRTT+1
ZZ2A     EQU   ZZ2+272
ZZ2AF    EQU   ZZ2A+16
ZZ2AFV   EQU   ZZ2AF+1
ZZ2AFX   EQU   ZZ2AF+5
ZZ2APID  EQU   ZZ2A+64
ZZ2AD    EQU   ZZ2A+74
ZZ2ADD   EQU   ZZ2AD
ZZ2ADDT  EQU   ZZ2ADD+2
ZZ2ADM   EQU   ZZ2AD+46
ZZ2ADMT  EQU   ZZ2ADM+2
ZZ2ADP   EQU   ZZ2AD+56
ZZ2ADPT  EQU   ZZ2ADP+2
ZZ2AZZ6P EQU   ZZ2A+140
ZZ2AQAS  EQU   ZZ2A+144
ZZ2AQD   EQU   ZZ2A+160
ZZ2AQDT  EQU   ZZ2AQD+10
ZZ2AQDF  EQU   ZZ2AQD+52
ZZ2STG   EQU   ZZ2+960
ZZ2ALLOP EQU   ZZ2+992
ZZ2FREEP EQU   ZZ2+996
ZZ2FF19P EQU   ZZ2+1000
ZZ2FRE1P EQU   ZZ2+1004
ZZ2FF18P EQU   ZZ2+1008
ZZ2DYNAP EQU   ZZ2+1012
ZZ2ZZ2CP EQU   ZZ2+1016
ZZ2ZZ2DP EQU   ZZ2+1020
ZZ2STAIP EQU   ZZ2+1024
ZZ2FF02P EQU   ZZ2+1028
ZZ2GETLP EQU   ZZ2+1032
ZZ2PARSP EQU   ZZ2+1036
ZZ2PTGTP EQU   ZZ2+1040
ZZ2PUTLP EQU   ZZ2+1044
ZZ2SCANP EQU   ZZ2+1048
ZZ2STCKP EQU   ZZ2+1052
ZZ2TRMOP EQU   ZZ2+1064
ZZ2TRMVP EQU   ZZ2+1068
ZZ2PUTNP EQU   ZZ2+1084
ZZ2TRMNP EQU   ZZ2+1088
ZZ2ZZ1P  EQU   ZZ2+1264
ZZ2BVTP  EQU   ZZ2+1280
ZZ2RVTP  EQU   ZZ2+1284
ZZ2CPPL  EQU   ZZ2+1292
ZZ2CPPLC EQU   ZZ2CPPL
ZZ2ITR   EQU   ZZ2+2840
ZZ2ITRE  EQU   ZZ2ITR+16
ZZ2ITSE  EQU   ZZ2+2864
ZZ2ES    EQU   ZZ2+2872
ZZ2AMDX  EQU   ZZ2+7160
ZZ2AXO   EQU   ZZ2+7934
ZZ2AXOT  EQU   ZZ2AXO+2
CMD      EQU   0
CMDT     EQU   CMD+4
PSCB     EQU   0
PSCBATR1 EQU   PSCB+16
ECT      EQU   0
ECTSWS   EQU   ECT+28
ECTSWS2  EQU   ECT+40
ECTSWS21 EQU   ECTSWS2
UPT      EQU   0
UPTSWS   EQU   UPT+12
SA       EQU   0
SA1      EQU   SA
SAR      EQU   SA+12
SAR1     EQU   SAR+12
BLSUPARI EQU   0
BLSUPARU EQU   0
BLSUPUTO EQU   0
BLSUPUTV EQU   0
BVT      EQU   0
BVTPUTLP EQU   BVT+4
BVTPUTOP EQU   BVT+12
BVTPUTTP EQU   BVT+16
BVTPUTVP EQU   BVT+20
BVTPUTAP EQU   BVT+24
BVTPRTTP EQU   BVT+28
BVTPRTAP EQU   BVT+32
BVTPUTDP EQU   BVT+36
BVTMONP  EQU   BVT+40
BVTMON2P EQU   BVT+44
BVTVSARP EQU   BVT+48
BVTVSENP EQU   BVT+64
BVTVSERP EQU   BVT+68
BVTVSGEP EQU   BVT+72
BVTVSGUP EQU   BVT+76
BVTVSPOP EQU   BVT+80
BVTVSPUP EQU   BVT+84
BVTMPKNP EQU   BVT+104
BVTMONLP EQU   BVT+108
BVTPUTCP EQU   BVT+132
BVTMPK1P EQU   BVT+136
BVTZZ2RP EQU   BVT+140
BVTPGMRP EQU   BVT+144
BVTMONAP EQU   BVT+148
BVTBLDDP EQU   BVT+152
BVTBLDLP EQU   BVT+156
BVTPGMCP EQU   BVT+160
BVTPGMDP EQU   BVT+164
BVTPGMLP EQU   BVT+168
BVTMONCP EQU   BVT+180
BVTMONDP EQU   BVT+184
BVTMONTP EQU   BVT+188
BVTPARIP EQU   BVT+192
BVTPARUP EQU   BVT+196
BVTPRTNP EQU   BVT+204
BVTVSCRP EQU   BVT+208
BVTVSMRP EQU   BVT+212
BVTMONXP EQU   BVT+216
BVTTRMAP EQU   BVT+228
ZZ6      EQU   0
ZZ6D     EQU   ZZ6+128
ZZ6DD    EQU   ZZ6D+8
ZZ6DDT   EQU   ZZ6DD+4
ZZ6DQA   EQU   ZZ6D+68
ZZ6DF    EQU   ZZ6D+92
ZZ6B     EQU   ZZ6+768
BLSRACC  EQU   0
BLSRESAR EQU   0
BLSRESGE EQU   0
BLSRESGU EQU   0
BLST01   EQU   0
BLSRPADS EQU   0
RVT      EQU   0
RVTADDRP EQU   RVT
RVTT01P  EQU   RVT+4
RVTTAP   EQU   RVT+8
RVTTBP   EQU   RVT+12
RVTTCP   EQU   RVT+16
RVTTFP   EQU   RVT+24
RVTTYP   EQU   RVT+40
RVTT02P  EQU   RVT+48
RVTT03P  EQU   RVT+52
RVTT04P  EQU   RVT+56
RVTACCLP EQU   RVT+60
RVTRACCP EQU   RVT+64
RVTTLP   EQU   RVT+68
RVTTMP   EQU   RVT+72
RVTTUP   EQU   RVT+80
RVTESGEP EQU   RVT+84
RVTESGUP EQU   RVT+88
RVTESARP EQU   RVT+92
RVTRAARP EQU   RVT+96
RVTRAGEP EQU   RVT+100
RVTADDPP EQU   RVT+104
RVTACCQP EQU   RVT+108
RVTSAGUP EQU   RVT+124
RVTSAGEP EQU   RVT+128
RVTESCKP EQU   RVT+132
RVTMSGAP EQU   RVT+136
RVTMSGDP EQU   RVT+140
RVTADDTP EQU   RVT+160
RVTADDUP EQU   RVT+164
RVTADD1P EQU   RVT+176
RVTADD2P EQU   RVT+180
RVTRSAGP EQU   RVT+184
RVTMSGBP EQU   RVT+188
RVTADDSP EQU   RVT+192
RVTADD3P EQU   RVT+196
RVTT05P  EQU   RVT+200
RVTPADSP EQU   RVT+204
RVTTRP   EQU   RVT+228
RVTADD4P EQU   RVT+232
RVTSAPCP EQU   RVT+236
RVTSAARP EQU   RVT+240
RVTSAGNP EQU   RVT+244
RVTT06P  EQU   RVT+248
RVTSAGCP EQU   RVT+252
RVTSAGQP EQU   RVT+256
RVTESGCP EQU   RVT+260
RVTESGQP EQU   RVT+264
RVTDUCKP EQU   RVT+276
RVTDUCCP EQU   RVT+280
CVTMAP   EQU   0
CVT      EQU   CVTMAP
CVTDAR   EQU   CVTMAP+72
CVTFLGS1 EQU   CVTDAR
CVTDCB   EQU   CVTMAP+116
CVTIOQET EQU   CVTMAP+120
CVTIERLC EQU   CVTMAP+144
CVTHEAD  EQU   CVTMAP+160
CVTSV76C EQU   CVTHEAD
CVTOPTA  EQU   CVTMAP+182
CVTOPTB  EQU   CVTMAP+183
CVTQLPAQ EQU   CVTMAP+188
CVTGTF   EQU   CVTMAP+236
CVTGTFST EQU   CVTGTF
CVTGTFS  EQU   CVTGTFST
CVTSTATE EQU   CVTGTFST
CVTTMODE EQU   CVTGTFST
CVTFORM  EQU   CVTGTFST
CVTAQAVT EQU   CVTMAP+240
CVTTCMFG EQU   CVTAQAVT
CVTVOLM2 EQU   CVTMAP+244
CVTTATA  EQU   CVTVOLM2
CVTTSKS  EQU   CVTTATA
CVTVOLF2 EQU   CVTTSKS
CVTTAT   EQU   CVTTATA+1
CVTATER  EQU   CVTMAP+248
CVTEXT1  EQU   CVTMAP+252
CVTPURG  EQU   CVTMAP+260
CVTQMSG  EQU   CVTMAP+268
CVTDMSR  EQU   CVTMAP+272
CVTRSV37 EQU   CVTDMSR
CVTDMSRF EQU   CVTRSV37
CVTERPV  EQU   CVTMAP+316
CVTINTLA EQU   CVTMAP+320
CVTAPF   EQU   CVTMAP+324
CVTEXT2  EQU   CVTMAP+328
CVTHJES  EQU   CVTMAP+332
CVTPGSIA EQU   CVTMAP+348
CVTA1F1  EQU   CVTMAP+356
CVTSYSK  EQU   CVTMAP+357
CVTVOLM1 EQU   CVTMAP+380
CVTVOLF1 EQU   CVTVOLM1
CVTATMCT EQU   CVTMAP+388
CVTXTNT1 EQU   0
CVTXTNT2 EQU   0
CVTDSSV  EQU   CVTXTNT2
CVTFLGBT EQU   CVTXTNT2+5
CVTQID   EQU   CVTXTNT2+24
CVTRV400 EQU   CVTXTNT2+52
CVTRV409 EQU   CVTXTNT2+53
CVTATCVT EQU   CVTXTNT2+64
CVTRV429 EQU   CVTXTNT2+84
CVTRV438 EQU   CVTXTNT2+85
CVTRV457 EQU   CVTXTNT2+112
CVTRV466 EQU   CVTXTNT2+113
CVTFIX   EQU   0
CVTRELNO EQU   CVTFIX+252
CDENTRY  EQU   0
CDCHAIN  EQU   CDENTRY
CDNAME   EQU   CDENTRY+8
CDENTPT  EQU   CDENTRY+16
CDXLMJP  EQU   CDENTRY+20
CDATTR   EQU   CDENTRY+28
CDMIN    EQU   CDATTR
CDATTR2  EQU   CDENTRY+29
XTLST    EQU   0
XTLMSBLA EQU   XTLST+8
XTLMSBLN EQU   XTLMSBLA+1
XTLMSBAA EQU   XTLST+12
XTLMSBAD EQU   XTLMSBAA+1
LPDE     EQU   0
LPDECHN  EQU   LPDE
LPDENAME EQU   LPDE+8
LPDENTP  EQU   LPDE+16
LPDEATTR EQU   LPDE+28
LPDEMIN  EQU   LPDEATTR
LPDEATT2 EQU   LPDE+29
LPDEMJNM EQU   LPDE+32
LPDEXTLN EQU   LPDEMJNM
LPDEXTAD EQU   LPDEMJNM+4
PCCSECT  EQU   0
PDDSECT  EQU   0
PDXP     EQU   PDDSECT+1
PDL      EQU   PDDSECT+5
PMODI    EQU   0
BUFB     EQU   0
BLSRACCL EQU   0
BLSRACCQ EQU   0
BLSRADDP EQU   0
BLSRADDR EQU   0
BLSRADDS EQU   0
BLSRADDT EQU   0
BLSRADDU EQU   0
BLSRADD1 EQU   0
BLSRADD2 EQU   0
BLSRADD3 EQU   0
BLSRADD4 EQU   0
BLSRDUCC EQU   0
BLSRDUCK EQU   0
BLSRESCK EQU   0
BLSRESGC EQU   0
BLSRESGQ EQU   0
BLSRMSGA EQU   0
BLSRMSGB EQU   0
BLSRMSGD EQU   0
BLSRRAAR EQU   0
BLSRRAGE EQU   0
BLSRSAAR EQU   0
BLSRSAG  EQU   0
BLSRSAGC EQU   0
BLSRSAGE EQU   0
BLSRSAGN EQU   0
BLSRSAGQ EQU   0
BLSRSAGU EQU   0
BLSRSAPC EQU   0
BLSTA    EQU   0
BLSTB    EQU   0
BLSTC    EQU   0
BLSTF    EQU   0
BLSTL    EQU   0
BLSTM    EQU   0
BLSTR    EQU   0
BLSTU    EQU   0
BLSTY    EQU   0
BLST02   EQU   0
BLST03   EQU   0
BLST04   EQU   0
BLST05   EQU   0
BLST06   EQU   0
BLSUALLO EQU   0
BLSUBLDD EQU   0
BLSUBLDL EQU   0
BLSUDYNA EQU   0
BLSUFREE EQU   0
BLSUFRE1 EQU   0
BLSUMON  EQU   0
BLSUMONA EQU   0
BLSUMONC EQU   0
BLSUMOND EQU   0
BLSUMONL EQU   0
BLSUMONT EQU   0
BLSUMONX EQU   0
BLSUMON2 EQU   0
BLSUMPKN EQU   0
BLSUMPK1 EQU   0
BLSUPGMC EQU   0
BLSUPGMD EQU   0
BLSUPGML EQU   0
BLSUPGMR EQU   0
BLSUPRTA EQU   0
BLSUPRTN EQU   0
BLSUPRTT EQU   0
BLSUPUTA EQU   0
BLSUPUTC EQU   0
BLSUPUTD EQU   0
BLSUPUTL EQU   0
BLSUPUTN EQU   0
BLSUPUTT EQU   0
BLSUSTAI EQU   0
BLSUTRMA EQU   0
BLSUTRMN EQU   0
BLSUTRMO EQU   0
BLSUTRMV EQU   0
BLSUVSAR EQU   0
BLSUVSCR EQU   0
BLSUVSEN EQU   0
BLSUVSER EQU   0
BLSUVSGE EQU   0
BLSUVSGU EQU   0
BLSUVSMR EQU   0
BLSUVSPO EQU   0
BLSUVSPU EQU   0
BLSUZZ2C EQU   0
BLSUZZ2D EQU   0
BLSUZZ2R EQU   0
IKJEFF02 EQU   0
IKJEFF18 EQU   0
IKJEFF19 EQU   0
IKJGETL  EQU   0
IKJPARS  EQU   0
IKJPTGT  EQU   0
IKJPUTL  EQU   0
IKJSCAN  EQU   0
IKJSTCK  EQU   0
I001C    EQU   0
I008P    EQU   0
I015F    EQU   0
I015P    EQU   0
I031F    EQU   0
I031P    EQU   0
I256C    EQU   0
PMODIP   EQU   PMOD
PMODIL   EQU   PMOD+4
PMODIF   EQU   PMOD+6
CPPL     EQU   ZZ2CPPL
CPPLUPT  EQU   CPPL+4
CPPLPSCB EQU   CPPL+8
CPPLECT  EQU   CPPL+12
CVTS01   EQU   CVTPGSIA
CVTLPDIA EQU   CVTS01+12
CVTDIRST EQU   CVTLPDIA
CVTSLIDA EQU   CVTS01+24
CVTCTLFG EQU   CVTS01+50
CVTVVMDI EQU   CVTS01+204
CVTRV210 EQU   CVTS01+424
CVTRV219 EQU   CVTS01+425
CVTRV228 EQU   CVTS01+426
CVTRV237 EQU   CVTS01+427
CVTMFRTR EQU   CVTS01+452
CVTRV262 EQU   CVTS01+468
CVTRV271 EQU   CVTS01+469
CVTRV280 EQU   CVTS01+470
CVTRV289 EQU   CVTS01+471
CVTGSDA  EQU   CVTS01+600
BUFTES8  EQU   BUFTES2
FIRSTWRD EQU   BUFB
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS
CVTRV628 EQU   CVTS01+728
CVTRV627 EQU   CVTS01+724
CVTRV626 EQU   CVTS01+720
CVTRV625 EQU   CVTS01+716
CVTRV624 EQU   CVTS01+712
CVTRV623 EQU   CVTS01+708
CVTRV622 EQU   CVTS01+704
CVTRV621 EQU   CVTS01+700
CVTIHASU EQU   CVTS01+696
CVTSUSP  EQU   CVTS01+692
CVTT6SVC EQU   CVTS01+688
CVTCDAL  EQU   CVTS01+684
CVTTCTL  EQU   CVTS01+680
CVTRSUME EQU   CVTS01+676
CVTJTERM EQU   CVTS01+672
CVTASMRM EQU   CVTS01+668
CVTTCASP EQU   CVTS01+664
CVT0PT03 EQU   CVTS01+660
CVT0PT0E EQU   CVTS01+656
CVTRV609 EQU   CVTS01+652
CVTCGK   EQU   CVTS01+648
CVTRAC   EQU   CVTS01+644
CVTRV606 EQU   CVTS01+640
CVTRV605 EQU   CVTS01+636
CVTRV604 EQU   CVTS01+632
CVTEFF02 EQU   CVTS01+628
CVTCBBR  EQU   CVTS01+624
CVTSSCR  EQU   CVTS01+620
CVTEVENT EQU   CVTS01+616
CVTCRCA  EQU   CVTS01+612
CVTTPIO  EQU   CVTS01+608
CVTADV   EQU   CVTS01+604
CVTGSDAB EQU   CVTGSDA
CVTQV3   EQU   CVTS01+596
CVTQV2   EQU   CVTS01+592
CVTQV1   EQU   CVTS01+588
CVTRPT   EQU   CVTS01+584
CVTSSRB  EQU   CVTS01+580
CVTCSDRL EQU   CVTS01+576
CVTEXP1  EQU   CVTS01+572
CVTRMPMT EQU   CVTS01+568
CVTRMPTT EQU   CVTS01+564
CVTVPSA  EQU   CVTS01+560
CVTVSTOP EQU   CVTS01+556
CVTGTFR8 EQU   CVTS01+552
CVTQUIT  EQU   CVTS01+548
CVTVACR  EQU   CVTS01+544
CVTWTCB  EQU   CVTS01+540
CVTSTPRS EQU   CVTS01+536
CVT0PT02 EQU   CVTS01+532
CVTDARCM EQU   CVTS01+528
CVTIRECM EQU   CVTS01+524
CVTJRECM EQU   CVTS01+520
CVTVEMS0 EQU   CVTS01+516
CVTSPFRR EQU   CVTS01+512
CVTRLSTG EQU   CVTS01+508
CVT0TC0A EQU   CVTS01+504
CVTGMBR  EQU   CVTS01+500
CVTLFRM  EQU   CVTS01+496
CVTRMBR  EQU   CVTS01+492
CVTVIOP  EQU   CVTS01+488
CVTRV307 EQU   CVTS01+486
CVTRV306 EQU   CVTS01+484
CVTRV305 EQU   CVTS01+482
CVTRV304 EQU   CVTS01+480
CVTRV303 EQU   CVTS01+478
CVTRV302 EQU   CVTS01+476
CVTTRCA  EQU   CVTS01+472
CVTRV297 EQU   CVTRV289
CVTRV296 EQU   CVTRV289
CVTRV295 EQU   CVTRV289
CVTRV294 EQU   CVTRV289
CVTRV293 EQU   CVTRV289
CVTRV292 EQU   CVTRV289
CVTRV291 EQU   CVTRV289
CVTRV290 EQU   CVTRV289
CVTRV288 EQU   CVTRV280
CVTRV287 EQU   CVTRV280
CVTRV286 EQU   CVTRV280
CVTRV285 EQU   CVTRV280
CVTRV284 EQU   CVTRV280
CVTRV283 EQU   CVTRV280
CVTRV282 EQU   CVTRV280
CVTRV281 EQU   CVTRV280
CVTRV279 EQU   CVTRV271
CVTRV278 EQU   CVTRV271
CVTRV277 EQU   CVTRV271
CVTRV276 EQU   CVTRV271
CVTRV275 EQU   CVTRV271
CVTRV274 EQU   CVTRV271
CVTRV273 EQU   CVTRV271
CVTRV272 EQU   CVTRV271
CVTRV270 EQU   CVTRV262
CVTRV269 EQU   CVTRV262
CVTRV268 EQU   CVTRV262
CVTRV267 EQU   CVTRV262
CVTRV266 EQU   CVTRV262
CVTRV265 EQU   CVTRV262
CVTRV264 EQU   CVTRV262
CVTRV263 EQU   CVTRV262
CVTVFP   EQU   CVTS01+464
CVTVSI   EQU   CVTS01+460
CVTVPSIB EQU   CVTS01+456
CVTMFACT EQU   CVTMFRTR
CVTMFCTL EQU   CVTS01+448
CVTPVBP  EQU   CVTS01+444
CVTPWI   EQU   CVTS01+440
CVTRV254 EQU   CVTS01+438
CVTRV253 EQU   CVTS01+436
CVTRV252 EQU   CVTS01+434
CVTRV251 EQU   CVTS01+433
CVTRV250 EQU   CVTS01+432
CVTRV249 EQU   CVTS01+431
CVTRV248 EQU   CVTS01+430
CVTRV247 EQU   CVTS01+429
CVTRV246 EQU   CVTS01+428
CVTRV245 EQU   CVTRV237
CVTRV244 EQU   CVTRV237
CVTRV243 EQU   CVTRV237
CVTRV242 EQU   CVTRV237
CVTRV241 EQU   CVTRV237
CVTRV240 EQU   CVTRV237
CVTRV239 EQU   CVTRV237
CVTRV238 EQU   CVTRV237
CVTRV236 EQU   CVTRV228
CVTRV235 EQU   CVTRV228
CVTRV234 EQU   CVTRV228
CVTRV233 EQU   CVTRV228
CVTRV232 EQU   CVTRV228
CVTRV231 EQU   CVTRV228
CVTRV230 EQU   CVTRV228
CVTRV229 EQU   CVTRV228
CVTRV227 EQU   CVTRV219
CVTRV226 EQU   CVTRV219
CVTRV225 EQU   CVTRV219
CVTRV224 EQU   CVTRV219
CVTRV223 EQU   CVTRV219
CVTRV222 EQU   CVTRV219
CVTRV221 EQU   CVTRV219
CVTRV220 EQU   CVTRV219
CVTRV218 EQU   CVTRV210
CVTRV217 EQU   CVTRV210
CVTRV216 EQU   CVTRV210
CVTRV215 EQU   CVTRV210
CVTRV214 EQU   CVTRV210
CVTRV213 EQU   CVTRV210
CVTRV212 EQU   CVTRV210
CVTRV211 EQU   CVTRV210
CVTLCCAT EQU   CVTS01+420
CVTPCCAT EQU   CVTS01+416
CVTIPCRP EQU   CVTS01+412
CVTIPCRI EQU   CVTS01+408
CVTIPCDS EQU   CVTS01+404
CVTAIDVT EQU   CVTS01+400
CVTSSAP  EQU   CVTS01+396
CVTEHCIR EQU   CVTS01+392
CVTEHDEF EQU   CVTS01+388
CVTDAIR  EQU   CVTS01+384
CVTPERFM EQU   CVTS01+380
CVT044R2 EQU   CVTS01+376
CVTFETCH EQU   CVTS01+372
CVTRSTWD EQU   CVTS01+368
CVTSPOST EQU   CVTS01+364
CVTIOBP  EQU   CVTS01+360
CVTASMVT EQU   CVTS01+356
CVTRECRQ EQU   CVTS01+352
CVTWSAC  EQU   CVTS01+348
CVTRV149 EQU   CVTS01+344
CVTWSAL  EQU   CVTS01+340
CVTSPSA  EQU   CVTS01+336
CVTGLMN  EQU   CVTS01+332
CVTVEAC0 EQU   CVTS01+328
CVT062R1 EQU   CVTS01+324
CVTRPOST EQU   CVTS01+320
CVTDQIQE EQU   CVTS01+316
CVTCSD   EQU   CVTS01+312
CVTLKRMA EQU   CVTS01+308
CVTRSPIE EQU   CVTS01+304
CVTRENQ  EQU   CVTS01+300
CVTLQCB  EQU   CVTS01+296
CVTFQCB  EQU   CVTS01+292
CVTQCS01 EQU   CVTS01+288
CVTAPFT  EQU   CVTS01+284
CVTPARRL EQU   CVTS01+280
CVTVWAIT EQU   CVTS01+276
CVTGSPL  EQU   CVTS01+272
CVTLSMQ  EQU   CVTS01+268
CVTGSMQ  EQU   CVTS01+264
CVTEXPRO EQU   CVTS01+260
CVTOPCTP EQU   CVTS01+256
CVTSIC   EQU   CVTS01+252
CVTTPIOS EQU   CVTS01+248
CVTRTMS  EQU   CVTS01+244
CVTSDBF  EQU   CVTS01+240
CVTSCBP  EQU   CVTS01+236
CVTSDMP  EQU   CVTS01+232
CVTSV60  EQU   CVTS01+228
CVTRTMCT EQU   CVTS01+224
CVTASCBL EQU   CVTS01+220
CVTASCBH EQU   CVTS01+216
CVTGDA   EQU   CVTS01+212
CVTASVT  EQU   CVTS01+208
CVTAQTOP EQU   CVTS01+200
CVTIOSCS EQU   CVTS01+196
CVTSDRM  EQU   CVTS01+192
CVTOPTE  EQU   CVTS01+188
CVTSTXU  EQU   CVTS01+184
CVTQUIS  EQU   CVTS01+180
CVTPARS  EQU   CVTS01+176
CVTS1EE  EQU   CVTS01+172
CVTFRAS  EQU   CVTS01+168
CVTQSAS  EQU   CVTS01+164
CVTCRAS  EQU   CVTS01+160
CVTCRMN  EQU   CVTS01+156
CVTDELCP EQU   CVTS01+152
CVTFRECL EQU   CVTS01+148
CVTGETCL EQU   CVTS01+144
CVTBLDCP EQU   CVTS01+140
CVTAUTHL EQU   CVTS01+136
CVTSCAN  EQU   CVTS01+132
CVTRV144 EQU   CVTS01+130
CVTMAXMP EQU   CVTS01+128
CVTSTCK  EQU   CVTS01+124
CVTRV139 EQU   CVTS01+123
CVTDSSAC EQU   CVTS01+122
CVTRV513 EQU   CVTS01+121
CVTIOSPL EQU   CVTS01+120
CVTPTGT  EQU   CVTS01+116
CVTCSPIE EQU   CVTS01+112
CVTSMFEX EQU   CVTS01+108
CVTOLT0A EQU   CVTS01+104
CVTSRBRT EQU   CVTS01+100
CVTPUTL  EQU   CVTS01+96
CVTASCRL EQU   CVTS01+92
CVTASCRF EQU   CVTS01+88
CVTRV326 EQU   CVTS01+84
CVTRV325 EQU   CVTS01+80
CVTRV324 EQU   CVTS01+76
CVT0VL01 EQU   CVTS01+72
CVTSHRVM EQU   CVTS01+68
CVTRV332 EQU   CVTS01+64
CVTTAS   EQU   CVTS01+60
CVTRSCN  EQU   CVTS01+56
CVTTRAC2 EQU   CVTS01+54
CVTTRACE EQU   CVTS01+52
CVTAPG   EQU   CVTS01+51
CVTSDTRC EQU   CVTCTLFG
CVTGTRCE EQU   CVTCTLFG
CVTNOMP  EQU   CVTCTLFG
CVTRSV79 EQU   CVTCTLFG
CVTDSTAT EQU   CVTCTLFG
CVTRSV78 EQU   CVTCTLFG
CVTRV333 EQU   CVTCTLFG
CVTRV323 EQU   CVTCTLFG
CVTSPVLK EQU   CVTS01+49
CVTRSV77 EQU   CVTS01+48
CVTRV331 EQU   CVTS01+44
CVTRV330 EQU   CVTS01+40
CVTRV329 EQU   CVTS01+36
CVTRV328 EQU   CVTS01+32
CVTRV322 EQU   CVTS01+28
CVTSLID  EQU   CVTSLIDA+1
CVTSYLK  EQU   CVTSLIDA
CVTRV321 EQU   CVTS01+20
CVTRV320 EQU   CVTS01+16
CVTLPDIR EQU   CVTLPDIA+1
CVTRSV69 EQU   CVTDIRST
CVTRSV68 EQU   CVTDIRST
CVTRSV67 EQU   CVTDIRST
CVTRSV66 EQU   CVTDIRST
CVTRSV65 EQU   CVTDIRST
CVTRSV64 EQU   CVTDIRST
CVTRSV63 EQU   CVTDIRST
CVTDICOM EQU   CVTDIRST
CVTPVTP  EQU   CVTS01+8
CVTLPDSR EQU   CVTS01+4
CVTGETL  EQU   CVTS01
CPPLCBUF EQU   CPPL
@NM00092 EQU   PMOD+8
@NM00091 EQU   PMOD+7
PMODIF8  EQU   PMODIF
PMODIF7  EQU   PMODIF
PMODIF6  EQU   PMODIF
PMODIF5  EQU   PMODIF
PMODIF4  EQU   PMODIF
PMODIF3  EQU   PMODIF
PMODIF2  EQU   PMODIF
PMODIFP  EQU   PMODIF
PDSP     EQU   PDDSECT+4
@NM00090 EQU   PDDSECT
LPDEATT3 EQU   LPDE+30
LPDEAUTH EQU   LPDEATT2
LPDESYSL EQU   LPDEATT2
@NM00089 EQU   LPDEATT2
@NM00088 EQU   LPDEATT2
LPDERLC  EQU   LPDEATT2
LPDEXLE  EQU   LPDEATT2
@NM00087 EQU   LPDEATT2
LPDENLR  EQU   LPDEATTR
@NM00086 EQU   LPDEATTR
@NM00085 EQU   LPDEATTR
LPDESER  EQU   LPDEATTR
LPDEREN  EQU   LPDEATTR
@NM00084 EQU   LPDEATTR
LPDENIP  EQU   LPDEATTR
@NM00083 EQU   LPDE+26
LPDEUSE  EQU   LPDE+24
LPDEXLP  EQU   LPDE+20
LPDERBP  EQU   LPDE+4
@NM00082 EQU   XTLMSBAA
@NM00081 EQU   XTLMSBLA
XTLNRFAC EQU   XTLST+4
XTLLNTH  EQU   XTLST
CDATTR3  EQU   CDENTRY+30
CDAUTH   EQU   CDATTR2
CDSYSLIB EQU   CDATTR2
CDOLY    EQU   CDATTR2
@NM00080 EQU   CDATTR2
CDRLC    EQU   CDATTR2
CDXLE    EQU   CDATTR2
CDREL    EQU   CDATTR2
CDSPZ    EQU   CDATTR2
CDNLR    EQU   CDATTR
CDJPA    EQU   CDATTR
CDNFN    EQU   CDATTR
CDSER    EQU   CDATTR
CDREN    EQU   CDATTR
CDNIC    EQU   CDATTR
CDNIP    EQU   CDATTR
@NM00079 EQU   CDENTRY+26
CDUSE    EQU   CDENTRY+24
CDRRBP   EQU   CDENTRY+4
CVTLEVL  EQU   CVTRELNO+2
CVTNUMB  EQU   CVTRELNO
CVTMDL   EQU   CVTFIX+250
@NM00078 EQU   CVTFIX+248
@NM00077 EQU   CVTFIX
CVTRV482 EQU   CVTXTNT2+128
CVTRV481 EQU   CVTXTNT2+124
CVTRV480 EQU   CVTXTNT2+120
CVTRV479 EQU   CVTXTNT2+118
CVTRV478 EQU   CVTXTNT2+117
CVTRV477 EQU   CVTXTNT2+116
CVTRV476 EQU   CVTXTNT2+115
CVTRV475 EQU   CVTXTNT2+114
CVTRV474 EQU   CVTRV466
CVTRV473 EQU   CVTRV466
CVTRV472 EQU   CVTRV466
CVTRV471 EQU   CVTRV466
CVTRV470 EQU   CVTRV466
CVTRV469 EQU   CVTRV466
CVTRV468 EQU   CVTRV466
CVTRV467 EQU   CVTRV466
CVTRV465 EQU   CVTRV457
CVTRV464 EQU   CVTRV457
CVTRV463 EQU   CVTRV457
CVTRV462 EQU   CVTRV457
CVTRV461 EQU   CVTRV457
CVTRV460 EQU   CVTRV457
CVTRV459 EQU   CVTRV457
CVTRV458 EQU   CVTRV457
CVTRV456 EQU   CVTXTNT2+108
CVTRV455 EQU   CVTXTNT2+104
CVTRV454 EQU   CVTXTNT2+100
CVTRV453 EQU   CVTXTNT2+96
CVTRV452 EQU   CVTXTNT2+94
CVTRV451 EQU   CVTXTNT2+92
CVTRV450 EQU   CVTXTNT2+90
CVTRV449 EQU   CVTXTNT2+88
CVTRV448 EQU   CVTXTNT2+87
CVTRV447 EQU   CVTXTNT2+86
CVTRV446 EQU   CVTRV438
CVTRV445 EQU   CVTRV438
CVTRV444 EQU   CVTRV438
CVTRV443 EQU   CVTRV438
CVTRV442 EQU   CVTRV438
CVTRV441 EQU   CVTRV438
CVTRV440 EQU   CVTRV438
CVTRV439 EQU   CVTRV438
CVTRV437 EQU   CVTRV429
CVTRV436 EQU   CVTRV429
CVTRV435 EQU   CVTRV429
CVTRV434 EQU   CVTRV429
CVTRV433 EQU   CVTRV429
CVTRV432 EQU   CVTRV429
CVTRV431 EQU   CVTRV429
CVTRV430 EQU   CVTRV429
CVTRV428 EQU   CVTXTNT2+80
CVTRV427 EQU   CVTXTNT2+76
CVTRV426 EQU   CVTXTNT2+72
CVTRV425 EQU   CVTXTNT2+68
CVTATACT EQU   CVTATCVT
CVTRV423 EQU   CVTXTNT2+62
CVTRV422 EQU   CVTXTNT2+60
CVTRV421 EQU   CVTXTNT2+58
CVTRV420 EQU   CVTXTNT2+56
CVTRV419 EQU   CVTXTNT2+55
CVTRV418 EQU   CVTXTNT2+54
CVTRV417 EQU   CVTRV409
CVTRV416 EQU   CVTRV409
CVTRV415 EQU   CVTRV409
CVTRV414 EQU   CVTRV409
CVTRV413 EQU   CVTRV409
CVTRV412 EQU   CVTRV409
CVTRV411 EQU   CVTRV409
CVTRV410 EQU   CVTRV409
CVTRV408 EQU   CVTRV400
CVTRV407 EQU   CVTRV400
CVTRV406 EQU   CVTRV400
CVTRV405 EQU   CVTRV400
CVTRV404 EQU   CVTRV400
CVTRV403 EQU   CVTRV400
CVTRV402 EQU   CVTRV400
CVTRV401 EQU   CVTRV400
CVTICB   EQU   CVTXTNT2+48
CVTSKTA  EQU   CVTXTNT2+44
CVTRSV99 EQU   CVTXTNT2+40
CVTRSV98 EQU   CVTXTNT2+36
CVTRSV97 EQU   CVTXTNT2+34
CVTRSV96 EQU   CVTXTNT2+32
CVTOLTEP EQU   CVTXTNT2+28
CVTQIDA  EQU   CVTQID+1
CVTRSV95 EQU   CVTQID
CVTRSV94 EQU   CVTXTNT2+20
CVTRSV93 EQU   CVTXTNT2+16
CVTRSV92 EQU   CVTXTNT2+12
CVTDEBVR EQU   CVTXTNT2+8
CVTRSV91 EQU   CVTXTNT2+6
CVTRSV9H EQU   CVTFLGBT
CVTRSV9G EQU   CVTFLGBT
CVTRSV9F EQU   CVTFLGBT
CVTRSV9E EQU   CVTFLGBT
CVTRSV9D EQU   CVTFLGBT
CVTRSV9C EQU   CVTFLGBT
CVTVME   EQU   CVTFLGBT
CVTNPE   EQU   CVTFLGBT
CVTNUCLS EQU   CVTXTNT2+4
CVTDSSVA EQU   CVTDSSV+1
CVTRSV89 EQU   CVTDSSV
CVTRSV88 EQU   CVTXTNT1+8
CVTRSV87 EQU   CVTXTNT1+4
CVTFACHN EQU   CVTXTNT1
CVTRV488 EQU   CVTMAP+412
CVTRV487 EQU   CVTMAP+408
CVTRV486 EQU   CVTMAP+404
CVTRV485 EQU   CVTMAP+400
CVTACTAP EQU   CVTMAP+396
CVTAUTH  EQU   CVTMAP+392
CVTATMCA EQU   CVTATMCT+1
CVTATMST EQU   CVTATMCT
CVTRSV61 EQU   CVTMAP+384
CVTVOLT1 EQU   CVTVOLM1+1
CVTVOLI1 EQU   CVTVOLF1
CVTSTOA  EQU   CVTMAP+376
CVTRSV58 EQU   CVTMAP+374
CVTRSV57 EQU   CVTMAP+372
CVTDDCE  EQU   CVTMAP+368
CVTPNWFR EQU   CVTMAP+364
CVTSMF   EQU   CVTMAP+360
CVTSULK  EQU   CVTMAP+358
CVTSLKO  EQU   CVTSYSK
CVTSLKP  EQU   CVTSYSK
CVTSLKQ  EQU   CVTSYSK
CVTSLKR  EQU   CVTSYSK
CVTRSV56 EQU   CVTSYSK
CVTRSV55 EQU   CVTSYSK
CVTRSV54 EQU   CVTSYSK
CVTRSV53 EQU   CVTSYSK
CVTRSV52 EQU   CVTA1F1
CVTRSV51 EQU   CVTA1F1
CVTRSV50 EQU   CVTA1F1
CVTRSV49 EQU   CVTA1F1
CVTRSV48 EQU   CVTA1F1
CVTRSV47 EQU   CVTA1F1
CVTSRSW  EQU   CVTA1F1
CVTPFSW  EQU   CVTA1F1
CVTPCVT  EQU   CVTMAP+352
CVTRSV46 EQU   CVTMAP+344
CVTRSV45 EQU   CVTMAP+340
CVTRSV44 EQU   CVTMAP+338
CVTRSV43 EQU   CVTMAP+336
CVTHJESA EQU   CVTHJES+1
CVTRSV42 EQU   CVTHJES
CVTEXT2A EQU   CVTEXT2+1
CVTRSV41 EQU   CVTEXT2
CVTAPFA  EQU   CVTAPF+1
CVTRSV40 EQU   CVTAPF
CVTRV518 EQU   CVTINTLA
CVTRV517 EQU   CVTERPV
CVTEORM  EQU   CVTMAP+312
CVTMCHPR EQU   CVTMAP+308
CVTTZ    EQU   CVTMAP+304
CVTJEPS  EQU   CVTMAP+300
CVTJESCT EQU   CVTMAP+296
CVTMODE  EQU   CVTMAP+292
CVTPTRV  EQU   CVTMAP+288
CVTREAL  EQU   CVTMAP+284
CVTRSV39 EQU   CVTMAP+280
CVTRSV38 EQU   CVTMAP+276
CVTDMSRA EQU   CVTDMSR+1
CVTRV634 EQU   CVTDMSRF
CVTRV633 EQU   CVTDMSRF
CVTRV632 EQU   CVTDMSRF
CVTRV631 EQU   CVTDMSRF
CVTRV630 EQU   CVTDMSRF
CVTRV629 EQU   CVTDMSRF
CVTUDUMP EQU   CVTDMSRF
CVTSDUMP EQU   CVTDMSRF
CVTQMSGA EQU   CVTQMSG+1
CVTRSV36 EQU   CVTQMSG
CVTAMFF  EQU   CVTMAP+264
CVTPURGA EQU   CVTPURG+1
CVTRSV35 EQU   CVTPURG
CVTCBSP  EQU   CVTMAP+256
CVTATERA EQU   CVTATER+1
CVTSYST  EQU   CVTATER
CVTVOLT2 EQU   CVTTAT
CVTVOLI2 EQU   CVTVOLF2
CVTAQAVB EQU   CVTAQAVT+1
CVTRSV34 EQU   CVTTCMFG
CVTRSV33 EQU   CVTTCMFG
CVTRSV32 EQU   CVTTCMFG
CVTRSV31 EQU   CVTTCMFG
CVTRSV30 EQU   CVTTCMFG
CVTRSV29 EQU   CVTTCMFG
CVTLDEV  EQU   CVTTCMFG
CVTTCRDY EQU   CVTTCMFG
CVTGTFA  EQU   CVTGTF+1
CVTRSV27 EQU   CVTGTFST
CVTRNIO  EQU   CVTGTFST
CVTUSR   EQU   CVTGTFST
CVTRV318 EQU   CVTFORM
CVTRV317 EQU   CVTTMODE
CVTRV316 EQU   CVTSTATE
CVTRV315 EQU   CVTGTFS
CVTGTFAV EQU   CVTGTFS
CVT0SCR1 EQU   CVTMAP+232
CVTRV515 EQU   CVTMAP+228
CVTRMS   EQU   CVTMAP+224
CVTPATCH EQU   CVTMAP+220
CVTTSCE  EQU   CVTMAP+216
CVTLNKSC EQU   CVTMAP+214
CVTQABST EQU   CVTMAP+212
CVTMDLDS EQU   CVTMAP+208
CVTUSER  EQU   CVTMAP+204
CVTABEND EQU   CVTMAP+200
CVTSMCA  EQU   CVTMAP+196
CVTRSV18 EQU   CVTMAP+192
CVTQCDSR EQU   CVTMAP+184
CVTRSV17 EQU   CVTOPTB
CVTRSV16 EQU   CVTOPTB
CVTFP    EQU   CVTOPTB
CVTAPTHR EQU   CVTOPTB
CVTNLOG  EQU   CVTOPTB
CVTTOD   EQU   CVTOPTB
CVTCTIMS EQU   CVTOPTB
CVTPROT  EQU   CVTOPTB
CVTXPFP  EQU   CVTOPTA
CVTASCII EQU   CVTOPTA
CVTRSV13 EQU   CVTOPTA
CVTRSV12 EQU   CVTOPTA
CVTNIP   EQU   CVTOPTA
CVTDDR   EQU   CVTOPTA
CVTAPR   EQU   CVTOPTA
CVTCCH   EQU   CVTOPTA
CVTSNCTR EQU   CVTMAP+180
CVTQMWR  EQU   CVTMAP+176
CVTQOCR  EQU   CVTMAP+172
CVT1EF00 EQU   CVTMAP+168
CVTMZ00  EQU   CVTMAP+164
CVTSV76Q EQU   CVTSV76C
CVTRSV11 EQU   CVTMAP+156
CVT0PT01 EQU   CVTMAP+152
CVTMSER  EQU   CVTMAP+148
CVTRV516 EQU   CVTIERLC
CVTILCH  EQU   CVTMAP+140
CVT0DS   EQU   CVTMAP+136
CVTFBOSV EQU   CVTMAP+132
CVTNUCB  EQU   CVTMAP+128
CVTIXAVL EQU   CVTMAP+124
CVTSV76M EQU   CVTIOQET
CVTDCBA  EQU   CVTMAP+117
CVTMVS2  EQU   CVTDCB
CVT6DAT  EQU   CVTDCB
CVT4MPS  EQU   CVTDCB
CVTRSV09 EQU   CVTDCB
CVT4MS1  EQU   CVTDCB
CVT2SPS  EQU   CVTDCB
CVT1SSS  EQU   CVTDCB
CVTRSV08 EQU   CVTDCB
CVTSTB   EQU   CVTMAP+112
CVTQTD00 EQU   CVTMAP+108
CVTQTE00 EQU   CVTMAP+104
CVTCUCB  EQU   CVTMAP+100
CVTSJQ   EQU   CVTMAP+96
CVTPBLDL EQU   CVTMAP+92
CVTTPC   EQU   CVTMAP+88
CVTSVDCB EQU   CVTMAP+84
CVTBRET  EQU   CVTMAP+82
CVTEXIT  EQU   CVTMAP+80
CVT0FN00 EQU   CVTMAP+76
CVTDARA  EQU   CVTDAR+1
CVTRSV07 EQU   CVTFLGS1
CVTRSV06 EQU   CVTFLGS1
CVTRSV05 EQU   CVTFLGS1
CVTRSV04 EQU   CVTFLGS1
CVTRSV03 EQU   CVTFLGS1
CVTRSV02 EQU   CVTFLGS1
CVTRSV01 EQU   CVTFLGS1
CVTDMPLK EQU   CVTFLGS1
CVTXITP  EQU   CVTMAP+68
CVTZDTAB EQU   CVTMAP+64
CVTMSLT  EQU   CVTMAP+60
CVTDATE  EQU   CVTMAP+56
CVTBTERM EQU   CVTMAP+52
CVTSYSAD EQU   CVTMAP+48
CVTXTLER EQU   CVTMAP+44
CVTILK2  EQU   CVTMAP+40
CVTILK1  EQU   CVTMAP+36
CVTPRLTV EQU   CVTMAP+32
CVTPCNVT EQU   CVTMAP+28
CVT0VL00 EQU   CVTMAP+24
CVTXAPG  EQU   CVTMAP+20
CVTBUF   EQU   CVTMAP+16
CVTJOB   EQU   CVTMAP+12
CVTLINK  EQU   CVTMAP+8
CVT0EF00 EQU   CVTMAP+4
CVTTCBP  EQU   CVTMAP
RVT99999 EQU   RVT+384
RVT0096P EQU   RVT+380
RVT0095P EQU   RVT+376
RVT0094P EQU   RVT+372
RVT0093P EQU   RVT+368
RVT0092P EQU   RVT+364
RVT0091P EQU   RVT+360
RVT0090P EQU   RVT+356
RVT0089P EQU   RVT+352
RVT0088P EQU   RVT+348
RVT0087P EQU   RVT+344
RVT0086P EQU   RVT+340
RVT0085P EQU   RVT+336
RVT0084P EQU   RVT+332
RVT0083P EQU   RVT+328
RVT0082P EQU   RVT+324
RVT0081P EQU   RVT+320
RVT0080P EQU   RVT+316
RVT0079P EQU   RVT+312
RVT0078P EQU   RVT+308
RVT0077P EQU   RVT+304
RVT0076P EQU   RVT+300
RVT0075P EQU   RVT+296
RVT0074P EQU   RVT+292
RVT0073P EQU   RVT+288
RVT0072P EQU   RVT+284
RVTDTUTP EQU   RVT+272
RVTDTMTP EQU   RVT+268
RVT0057P EQU   RVT+224
RVT0056P EQU   RVT+220
RVT0055P EQU   RVT+216
RVT0054P EQU   RVT+212
RVT0053P EQU   RVT+208
RVT0044P EQU   RVT+172
RVT0043P EQU   RVT+168
RVT0040P EQU   RVT+156
RVT0039P EQU   RVT+152
RVT0038P EQU   RVT+148
RVT0037P EQU   RVT+144
RVT0031P EQU   RVT+120
RVT0030P EQU   RVT+116
RVT0029P EQU   RVT+112
RVT0020P EQU   RVT+76
RVT0012P EQU   RVT+44
RVT0010P EQU   RVT+36
RVT0009P EQU   RVT+32
RVT0008P EQU   RVT+28
RVT0006P EQU   RVT+20
ZZ69999  EQU   ZZ6+1792
ZZ6BRB   EQU   ZZ6B+12
ZZ6BRC   EQU   ZZ6B+8
@NM00076 EQU   ZZ6B+6
ZZ6BFL   EQU   ZZ6B+4
ZZ6BDA   EQU   ZZ6B
@NM00075 EQU   ZZ6+540
ZZ6BUFI  EQU   ZZ6+536
ZZ6BUFP  EQU   ZZ6+532
ZZ6FILE  EQU   ZZ6+524
ZZ6BUFB  EQU   ZZ6+520
ZZ6BUFL  EQU   ZZ6+518
ZZ6BUFN  EQU   ZZ6+516
ZZ6ZZ6P  EQU   ZZ6+512
@NM00074 EQU   ZZ6+256
ZZ6D999  EQU   ZZ6D+128
@NM00073 EQU   ZZ6D+116
ZZ6DCAP  EQU   ZZ6D+112
ZZ6DPRP  EQU   ZZ6D+108
ZZ6DDA2  EQU   ZZ6D+104
ZZ6DDA1  EQU   ZZ6D+100
@NM00072 EQU   ZZ6DF
ZZ6DFSU  EQU   ZZ6DF
ZZ6DFST  EQU   ZZ6DF
ZZ6DFAB  EQU   ZZ6DF
ZZ6DFMP  EQU   ZZ6DF
ZZ6DFDU  EQU   ZZ6DF
ZZ6DFBS  EQU   ZZ6DF
ZZ6DQ2   EQU   ZZ6D+88
ZZ6DQ1   EQU   ZZ6D+84
ZZ6DQA9  EQU   ZZ6DQA+16
@NM00071 EQU   ZZ6DQA+12
ZZ6DQA2  EQU   ZZ6DQA+8
ZZ6DQA1  EQU   ZZ6DQA+4
@NM00070 EQU   ZZ6DQA+2
ZZ6DQAT  EQU   ZZ6DQA
ZZ6DQA0  EQU   ZZ6DQA
ZZ6DRDX  EQU   ZZ6D+64
ZZ6DELK  EQU   ZZ6D+64
ZZ6DMEM  EQU   ZZ6D+56
ZZ6DDT1  EQU   ZZ6DDT
ZZ6DDO   EQU   ZZ6DD+2
ZZ6DDL   EQU   ZZ6DD
@NM00069 EQU   ZZ6D+2
ZZ6DRID  EQU   ZZ6D
ZZ6RDCB  EQU   ZZ6
ZZ60000  EQU   ZZ6
BVT99999 EQU   BVT+256
BVT0064P EQU   BVT+252
BVT0063P EQU   BVT+248
BVT0062P EQU   BVT+244
BVT0061P EQU   BVT+240
BVT0060P EQU   BVT+236
BVT0059P EQU   BVT+232
BVT0057P EQU   BVT+224
BVT0056P EQU   BVT+220
BVTSTBLP EQU   BVT+200
BVT0045P EQU   BVT+176
BVT0044P EQU   BVT+172
BVT0033P EQU   BVT+128
BVT0032P EQU   BVT+124
BVT0031P EQU   BVT+120
BVT0030P EQU   BVT+116
BVT0029P EQU   BVT+112
BVT0026P EQU   BVT+100
BVT0025P EQU   BVT+96
BVT0024P EQU   BVT+92
BVT0023P EQU   BVT+88
BVT0016P EQU   BVT+60
BVT0015P EQU   BVT+56
BVT0014P EQU   BVT+52
BVT0003P EQU   BVT+8
BVT0001P EQU   BVT
SA99     EQU   SA+72
SARC     EQU   SAR+56
SARB     EQU   SAR+52
SARA     EQU   SAR+48
SAR9     EQU   SAR+44
SAR8     EQU   SAR+40
SAR7     EQU   SAR+36
SAR6     EQU   SAR+32
SAR5     EQU   SAR+28
SAR4     EQU   SAR+24
SAR3     EQU   SAR+20
SAR2     EQU   SAR+16
SAR0     EQU   SAR+8
SARF     EQU   SAR+4
SARE     EQU   SAR
SAFWD    EQU   SA+8
SABAK    EQU   SA+4
SA1L     EQU   SA1+1
SA1P     EQU   SA1
UPTPREFL EQU   UPT+23
UPTPREFX EQU   UPT+16
@NM00068 EQU   UPT+15
UPTLDEL  EQU   UPT+14
UPTCDEL  EQU   UPT+13
UPTWTP   EQU   UPTSWS
UPTMODE  EQU   UPTSWS
UPTALD   EQU   UPTSWS
UPTPAUS  EQU   UPTSWS
UPTNCOM  EQU   UPTSWS
UPTMID   EQU   UPTSWS
UPTNPRM  EQU   UPTSWS
UPTRCVR  EQU   UPTSWS
UPTUSER  EQU   UPT+2
@NM00067 EQU   UPT
@NM00066 EQU   ECT+52
@NM00065 EQU   ECT+48
@NM00064 EQU   ECT+44
@NM00063 EQU   ECTSWS2+1
@NM00062 EQU   ECTSWS21
ECTTABND EQU   ECTSWS21
ECTDEFCS EQU   ECTSWS21
ECTBKPB  EQU   ECT+36
ECTUSER  EQU   ECT+32
ECTDDNUM EQU   ECT+29
ECTATTN  EQU   ECTSWS
ECTBKGRD EQU   ECTSWS
ECTNNOT  EQU   ECTSWS
ECTNMAL  EQU   ECTSWS
ECTLOGF  EQU   ECTSWS
ECTATRM  EQU   ECTSWS
@NM00061 EQU   ECTSWS
ECTNOPD  EQU   ECTSWS
ECTSCMD  EQU   ECT+20
ECTPCMD  EQU   ECT+12
ECTSMSG  EQU   ECT+9
ECTMSGF  EQU   ECT+8
ECTIOWA  EQU   ECT+4
ECTRTCD  EQU   ECT+1
ECTRCDF  EQU   ECT
PSCBU    EQU   PSCB+64
PSCBRSZ  EQU   PSCB+60
PSCBLINE EQU   PSCB+59
PSCBCHAR EQU   PSCB+58
PSCBUPTL EQU   PSCB+56
PSCBUPT  EQU   PSCB+52
PSCBRLGB EQU   PSCB+48
PSCBDEST EQU   PSCB+40
@NM00060 EQU   PSCB+36
@NM00059 EQU   PSCB+32
@NM00058 EQU   PSCB+28
PSCBLTI2 EQU   PSCB+24
PSCBLTIM EQU   PSCB+20
PSCBATR2 EQU   PSCB+18
@NM00057 EQU   PSCBATR1
@NM00056 EQU   PSCBATR1
@NM00055 EQU   PSCBATR1
PSCBATTN EQU   PSCBATR1
PSCBVMNT EQU   PSCBATR1
PSCBJCL  EQU   PSCBATR1
PSCBACCT EQU   PSCBATR1
PSCBCTRL EQU   PSCBATR1
PSCBGPNM EQU   PSCB+8
PSCBUSRL EQU   PSCB+7
PSCBUSER EQU   PSCB
CMDT1    EQU   CMDT
CMDO     EQU   CMD+2
CMDL     EQU   CMD
ZZ299999 EQU   ZZ2+8192
ZZ2AXOT1 EQU   ZZ2AXOT
ZZ2AXOL  EQU   ZZ2AXO
@NM00054 EQU   ZZ2+7288
@NM00053 EQU   ZZ2AMDX+4
ZZ2AMDXC EQU   ZZ2AMDX
ZZ2HSD   EQU   ZZ2+3056
@NM00052 EQU   ZZ2ES
@NM00051 EQU   ZZ2+2868
ZZ2ITSEC EQU   ZZ2ITSE+1
@NM00050 EQU   ZZ2ITSE
ZZ2ITSEP EQU   ZZ2ITSE
ZZ2ITSEW EQU   ZZ2ITSE
@NM00049 EQU   ZZ2ITR+20
ZZ2ITREC EQU   ZZ2ITRE+1
@NM00048 EQU   ZZ2ITRE
ZZ2ITREP EQU   ZZ2ITRE
ZZ2ITREW EQU   ZZ2ITRE
@NM00047 EQU   ZZ2ITR+9
ZZ2ITRRC EQU   ZZ2ITR+8
ZZ2ITR2P EQU   ZZ2ITR+4
ZZ2ITRPP EQU   ZZ2ITR
@NM00046 EQU   ZZ2+1544
ZZ2PGM   EQU   ZZ2+1536
@NM00045 EQU   ZZ2+1526
ZZ2CW    EQU   ZZ2+1524
@NM00044 EQU   ZZ2+1504
@NM00043 EQU   ZZ2+1352
ZZ2FFSYP EQU   ZZ2+1348
ZZ2SASYP EQU   ZZ2+1344
ZZ2RDSYP EQU   ZZ2+1340
ZZ2RASYP EQU   ZZ2+1336
ZZ2PHSYP EQU   ZZ2+1332
ZZ2ESSYP EQU   ZZ2+1328
ZZ200SYP EQU   ZZ2+1324
ZZ2SCWP  EQU   ZZ2+1320
ZZ2TTLP  EQU   ZZ2+1316
ZZ2LOADP EQU   ZZ2+1312
ZZ2VRESP EQU   ZZ2+1308
ZZ2CPPLE EQU   ZZ2CPPL+12
ZZ2CPPLP EQU   ZZ2CPPL+8
ZZ2CPPLU EQU   ZZ2CPPL+4
ZZ2VRSAP EQU   ZZ2+1288
ZZ2DVTP  EQU   ZZ2+1276
@NM00042 EQU   ZZ2+1272
@NM00041 EQU   ZZ2+1268
ZZ2RPLP  EQU   ZZ2+1260
ZZ2TCBP  EQU   ZZ2+1256
@NM00040 EQU   ZZ2+1252
ZZ2ZZ2P  EQU   ZZ2+1248
@NM00039 EQU   ZZ2+1112
ZZ2FPDRP EQU   ZZ2+1108
ZZ2FDSDP EQU   ZZ2+1104
ZZ2APDRP EQU   ZZ2+1100
ZZ2ADSDP EQU   ZZ2+1096
ZZ2ENQ0P EQU   ZZ2+1092
@NM00038 EQU   ZZ2+1080
ZZ2MSG0P EQU   ZZ2+1076
ZZ2FT25P EQU   ZZ2+1072
ZZ2MSGSP EQU   ZZ2+1060
ZZ2ALOCP EQU   ZZ2+1056
@NM00037 EQU   ZZ2+976
ZZ2TOD   EQU   ZZ2+968
ZZ2STGN  EQU   ZZ2STG+4
ZZ2STGP  EQU   ZZ2STG
@NM00036 EQU   ZZ2+952
ZZ2SCMDE EQU   ZZ2+944
ZZ2SCMDN EQU   ZZ2+936
ZZ2IDENT EQU   ZZ2+928
ZZ2A9999 EQU   ZZ2A+656
@NM00035 EQU   ZZ2A+224
@NM00034 EQU   ZZ2A+220
ZZ2AQD99 EQU   ZZ2AQD+60
@NM00033 EQU   ZZ2AQD+56
@NM00032 EQU   ZZ2AQDF
ZZ2AQDFA EQU   ZZ2AQDF
ZZ2AQDIL EQU   ZZ2AQD+48
ZZ2AQDIM EQU   ZZ2AQD+44
ZZ2AQDT9 EQU   ZZ2AQDT+34
ZZ2AQDTE EQU   ZZ2AQDT+33
ZZ2AQDTD EQU   ZZ2AQDT+2
@NM00031 EQU   ZZ2AQDT+1
ZZ2AQDTY EQU   ZZ2AQDT
ZZ2AQDT0 EQU   ZZ2AQDT
ZZ2AQDLB EQU   ZZ2AQD+9
ZZ2AQDOB EQU   ZZ2AQD+8
ZZ2AQDLE EQU   ZZ2AQD+4
ZZ2AQDOF EQU   ZZ2AQD
ZZ2AQD00 EQU   ZZ2AQD
ZZ2AQAS9 EQU   ZZ2AQAS+16
@NM00030 EQU   ZZ2AQAS+12
ZZ2AQAS2 EQU   ZZ2AQAS+8
ZZ2AQAS1 EQU   ZZ2AQAS+4
@NM00029 EQU   ZZ2AQAS+2
ZZ2AQAST EQU   ZZ2AQAS
ZZ2AQAS0 EQU   ZZ2AQAS
ZZ2ADPTA EQU   ZZ2ADPT
ZZ2ADPL  EQU   ZZ2ADP
ZZ2ADMTA EQU   ZZ2ADMT
ZZ2ADML  EQU   ZZ2ADM
ZZ2ADDTA EQU   ZZ2ADDT
ZZ2ADDL  EQU   ZZ2ADD
@NM00028 EQU   ZZ2A+72
ZZ2APIDB EQU   ZZ2APID+3
ZZ2APIDA EQU   ZZ2APID
@NM00027 EQU   ZZ2A+24
@NM00026 EQU   ZZ2AF+5
@NM00025 EQU   ZZ2AF+3
ZZ2AFS   EQU   ZZ2AF+2
ZZ2AFD   EQU   ZZ2AF+2
ZZ2AFQ   EQU   ZZ2AF+2
ZZ2AF$   EQU   ZZ2AF+2
@NM00024 EQU   ZZ2AF+2
ZZ2AFM   EQU   ZZ2AF+2
@NM00023 EQU   ZZ2AF+2
@NM00022 EQU   ZZ2AF+1
@NM00021 EQU   ZZ2AF+1
ZZ2AFC   EQU   ZZ2AF+1
@NM00020 EQU   ZZ2AF
ZZ2AFFS  EQU   ZZ2AF
ZZ2AFT   EQU   ZZ2AF
ZZ2AFP   EQU   ZZ2AF
@NM00019 EQU   ZZ2A+8
ZZ2ALINE EQU   ZZ2A+4
@NM00018 EQU   ZZ2A+3
ZZ2ASE   EQU   ZZ2A+2
ZZ2ACH   EQU   ZZ2A
@NM00017 EQU   ZZ2+264
@NM00016 EQU   ZZ2+263
ZZ2PRTT0 EQU   ZZ2PRTT
ZZ2PRTO  EQU   ZZ2PRT+2
ZZ2PRTL  EQU   ZZ2PRT
@NM00015 EQU   ZZ2AMD+56
ZZ2AMDXP EQU   ZZ2AMD+52
ZZ2AMDD  EQU   ZZ2AMD+48
ZZ2AMDL  EQU   ZZ2AMD+44
ZZ2AMDU  EQU   ZZ2AMD+28
ZZ2AMDF  EQU   ZZ2AMD+24
ZZ2AMDS  EQU   ZZ2AMD+20
ZZ2AMDC  EQU   ZZ2AMD+16
ZZ2AMDP  EQU   ZZ2AMD+12
ZZ2AMDB  EQU   ZZ2AMD+8
@NM00014 EQU   @NM00013
ZZ2AMD2  EQU   @NM00013
ZZ2AMD1  EQU   @NM00013
ZZ2AMD0  EQU   ZZ2AMD+6
ZZ2AMDA  EQU   ZZ2AMD+4
ZZ2AMDT  EQU   ZZ2AMD
ZZ199999 EQU   ZZ1+3072
@NM00012 EQU   ZZ1+2160
ZZ1TRTAS EQU   ZZ1+1904
ZZ1TRUPC EQU   ZZ1+1648
ZZ1NASID EQU   ZZ1N+274
ZZ1NSTRL EQU   ZZ1N+272
ZZ1NOFF  EQU   ZZ1N+268
ZZ1NBDY  EQU   ZZ1N+264
ZZ1NADE  EQU   ZZ1N+260
ZZ1NADB  EQU   ZZ1N+256
ZZ1NSTR  EQU   ZZ1N
@NM00011 EQU   ZZ1+1080
ZZ1TREBC EQU   ZZ1+824
@NM00010 EQU   ZZ1+377
ZZ1USTAE EQU   ZZ1+376
@NM00009 EQU   ZZ1F+1
@NM00008 EQU   ZZ1F
ZZ1FM    EQU   ZZ1F
ZZ1FX    EQU   ZZ1F
ZZ1FU    EQU   ZZ1F
ZZ1EVEC  EQU   ZZ1EVE+1
@NM00007 EQU   ZZ1EVE
ZZ1EVEP  EQU   ZZ1EVE
ZZ1EVEW  EQU   ZZ1EVE
ZZ1ACMP  EQU   ZZ1ATTN
@NM00006 EQU   ZZ1+144
ZZ1FPP   EQU   ZZ1+140
ZZ1ZZ6P  EQU   ZZ1+136
@NM00005 EQU   ZZ1+84
ZZ1PLINE EQU   ZZ1+80
ZZ1PGSZ  EQU   ZZ1+76
ZZ1PCNT  EQU   ZZ1+72
@NM00004 EQU   ZZ1+68
ZZ1TPAGE EQU   ZZ1+64
ZZ1TLINE EQU   ZZ1+60
@NM00003 EQU   ZZ1+48
ZZ1DSDP  EQU   ZZ1+44
ZZ1PDRP  EQU   ZZ1+40
ZZ1ZZ2P  EQU   ZZ1+36
ZZ1327WP EQU   ZZ1+32
ZZ1ACBP  EQU   ZZ1+28
@NM00002 EQU   ZZ1+24
ZZ1PDCBP EQU   ZZ1+20
ZZ1BLRBL EQU   ZZ1+16
@NM00001 EQU   ZZ1+12
ZZ1PNULL EQU   ZZ1+8
ZZ1NULL  EQU   ZZ1+4
ZZ1IDE   EQU   ZZ1
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS
@RT00269 EQU   EXITRLSA
@RF00320 EQU   EXITRLSA
@RT00327 EQU   NOTFOUND
@RT00338 EQU   NOTFOUND
@RT00343 EQU   NOTFOUND
@RT00349 EQU   NOTFOUND
@RT00351 EQU   OUTLOOP
@RT00363 EQU   NOTFOUND
@RT00369 EQU   NOTFOUND
@RT00382 EQU   NOTFOUND
@RT00384 EQU   FONDLPDE
@RT00450 EQU   NOTFOUND
@RT00476 EQU   NOTFOUND
@ENDDATA EQU   *
         END   BLSRFMOD,(C'PLS1825',0701,78057)
