DULS     TITLE 'BLSRDULS--IPCS LISTDUMP SUBCOMMAND                     *
                        '
*/* CHANGE ACTIVITY -------------------------------------------------*/
*/*   THIS MODULE WAS WRITTEN FOR @G57LPGW                           */
*/*------------------------------------------------------------------*/
BLSRDULS CSECT ,                                                   0002
@MAINENT DS    0H                                                  0002
         USING *,@15                                               0002
         B     @PROLOG                                             0002
         DC    AL1(16)                                             0002
         DC    C'BLSRDULS  78.057'                                 0002
         DROP  @15
@PROLOG  STM   @14,@12,12(@13)                                     0002
         BALR  @12,0                                               0002
@PSTART  DS    0H                                                  0002
         USING @PSTART,@12                                         0002
         L     @00,@SIZDATD                                        0002
         BLSUALLR R,LV=(0)
         LR    @11,@01                                             0002
         USING @DATD,@11                                           0002
         ST    @13,@SA00001+4                                      0002
         LM    @00,@01,20(@13)                                     0002
         ST    @11,8(,@13)                                         0002
         LR    @13,@11                                             0002
*   FLAG='00'X;                     /* INITIALIZE PROCESSING FLAGS   */
         MVI   FLAG,X'00'                                          0188
*   RETC=ZZZFLAGI;                  /* ANTICIPATE NORMAL COMPLETION  */
*                                                                  0189
         SLR   RETC,RETC                                           0189
*   /*****************************************************************/
*   /*                                                               */
*   /* PARSE COMMAND                                                 */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0190
*   DO;                             /* BLSRPARS ROUTING FLAG       0190
*                                      MF(EXECUTE,PX)                */
*     DO;                           /* BLSRPARD CSECT()DSECT(PD)EQUAT
*                                      E(ESAU)EXIT(EXITRLSA,)MF(EXECU
*                                      TE,PX)ROUTING FLAG            */
*       DO;                         /* BLSUPARS CSECT(PC)DSECT(PD)EXI
*                                      T(EXITRLSA,)MF(EXECUTE,PX)FLAG
*                                      ROUTING                       */
*         CALL BLSUPARI(ZZ2,PCCSECT,PDAPTR);/* PARSE OPERANDS        */
         ST    R9,@AL00001                                         0193
         L     @14,PCPTR                                           0193
         ST    @14,@AL00001+4                                      0193
         LA    @14,PDAPTR                                          0193
         ST    @14,@AL00001+8                                      0193
         L     @10,ZZ2BVTP(,R9)                                    0193
         L     @15,BVTPARIP(,@10)                                  0193
         LA    @01,@AL00001                                        0193
         BALR  @14,@15                                             0193
*         RESPECIFY                                                0194
*          (GPR15F) RESTRICTED;                                    0194
*         IF GPR15F^=ZZZFLAGI THEN                                 0195
*                                                                  0195
         LTR   GPR15F,GPR15F                                       0195
         BZ    @RF00195                                            0195
*           /*********************************************************/
*           /*                                                       */
*           /* UNABLE TO PARSE                                       */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0196
*           DO;                     /* UNABLE TO PARSE               */
*             RETC=GPR15F;          /* RETURN CODE                   */
         LR    RETC,GPR15F                                         0197
*             GO TO EXITNORL;       /* EXIT WITHOUT PDL              */
         B     EXITNORL                                            0198
*           END;                                                   0199
*         RESPECIFY                                                0200
*          (GPR15F) UNRESTRICTED;                                  0200
@RF00195 DS    0H                                                  0201
*         RESPECIFY                                                0201
*          (PDRPTR) RESTRICTED;                                    0201
*         PDRPTR=PDAPTR;            /* ->PDL                         */
         L     PDRPTR,PDAPTR                                       0202
*         GENERATE REFS(PD,PDRPTR) CODE(USING PD,PDRPTR);          0203
         USING PD,PDRPTR
*         IF PXTEST=PXTEST1 THEN                                   0204
         CLC   PXTEST(2),@CH00043                                  0204
         BNE   @RF00204                                            0204
*           ZZ2AFX=ZZZ1;            /* TEST                          */
         OI    ZZ2AFX(R9),B'10000000'                              0205
*         ELSE                                                     0206
*           IF PXTEST=PXTEST0 THEN                                 0206
         B     @RC00204                                            0206
@RF00204 CLC   PXTEST(2),@CH00068                                  0206
         BNE   @RF00206                                            0206
*             ZZ2AFX=ZZZ0;          /* NOTEST                        */
         NI    ZZ2AFX(R9),B'01111111'                              0207
*         CALL BLSUPARU(ZZ2,PDDSECT,PXRO);/* SET ROUTING OPTIONS     */
@RF00206 DS    0H                                                  0208
@RC00204 ST    R9,@AL00001                                         0208
         ST    PDRPTR,@AL00001+4                                   0208
         LA    @14,PXRO                                            0208
         ST    @14,@AL00001+8                                      0208
         L     @08,ZZ2BVTP(,R9)                                    0208
         L     @15,BVTPARUP(,@08)                                  0208
         LA    @01,@AL00001                                        0208
         BALR  @14,@15                                             0208
*         RESPECIFY                                                0209
*          (GPR15F) RESTRICTED;                                    0209
*         RETC=MAX(RETC,GPR15F);    /* RETURN CODE                   */
         CR    RETC,GPR15F                                         0210
         BNL   *+6
         LR    RETC,GPR15F                                         0210
*         RESPECIFY                                                0211
*          (GPR15F) UNRESTRICTED;                                  0211
*         IF RETC>ZZZFLAGE THEN     /* SERIOUS ERROR                 */
         C     RETC,@CF00051                                       0212
         BH    @RT00212                                            0212
*           GO TO EXITRLSA;         /* EXIT WITH PDL                 */
*       END;                        /* BLSUPARS CSECT(PC)DSECT(PD)EXI
*                                      T(EXITRLSA,)MF(EXECUTE,PX)FLAG
*                                      ROUTING                       */
*     END;                          /* BLSRPARD CSECT()DSECT(PD)EQUAT
*                                      E(ESAU)EXIT(EXITRLSA,)MF(EXECU
*                                      TE,PX)ROUTING FLAG            */
*   END;                            /* BLSRPARS ROUTING FLAG       0216
*                                      MF(EXECUTE,PX)                */
*                                                                  0217
*   /*****************************************************************/
*   /*                                                               */
*   /* GENERATE AN RPL TO PROCESS RD RECORDS                         */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0217
*   RDAURID=ZZZRIDRD;               /* INITIALIZE KEY FOR POINT      */
         MVC   RDAURID(2),@CC00134                                 0217
*   RESPECIFY                                                      0218
*    (R3,                           /* ->ACB                         */
*     R6,                           /* LENGTH OF LOGICAL KEY         */
*     R7) RESTRICTED;               /* LENGTH OF INPUT BUFFER        */
*   R3=ZZ1ACBP;                     /* ->ACB                         */
         L     @14,ZZ2ZZ1P(,R9)                                    0219
         L     R3,ZZ1ACBP(,@14)                                    0219
*   R6=LENGTH(RDAURID);             /* LOGICAL KEY LENGTH            */
         LA    R6,2                                                0220
*   R7=ZZZVSHRL;                    /* LENGTH OF INPUT BUFFER        */
         LA    R7,3072                                             0221
*   GENERATE CODE;                                                 0222
         SPACE 2
*---------------------------------------------------------------------*
*/*CREATE A REQUEST PARAMETER LIST TO PROCESS EQUATE SYMBOL RECORDS   *
*---------------------------------------------------------------------*
         SPACE
         GENCB BLK=RPL,WAREA=(S,MYRPL),ACB=(R3),AREA=(S,VSAMBUFR),     *
               AREALEN=(R7),ARG=(S,RDAU),KEYLEN=(R6),                  *
               OPTCD=(GEN,SEQ,NSP,KGE,MVE),LENGTH=256,                 *
               MF=(L,GENPARM,GENPARML)
***/
*   GENERATE DEFS(GENPARM) REFS(GENPARML) DATA;                    0223
*   RESPECIFY                                                      0224
*    (R3,                           /* ->ACB                         */
*     R6,                           /* LENGTH OF LOGICAL KEY         */
*     R7) UNRESTRICTED;             /* LENGTH OF INPUT BUFFER        */
*   CALL BLSUVSCR(ZZ2,GENPARM);     /* DO GENCB                      */
         ST    R9,@AL00001                                         0225
         LA    @14,GENPARM                                         0225
         ST    @14,@AL00001+4                                      0225
         L     @08,ZZ2BVTP(,R9)                                    0225
         L     @15,BVTVSCRP(,@08)                                  0225
         LA    @01,@AL00001                                        0225
         BALR  @14,@15                                             0225
*   IF RF^=0 THEN                   /* GENCB ERROR                   */
         LTR   RF,RF                                               0226
         BNZ   @RT00226                                            0226
*     GO TO EXITRLSA;               /* EXIT WITH PDL                 */
*                                                                  0227
*   /*****************************************************************/
*   /*                                                               */
*   /* POINT TO RECORD                                               */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0228
*   CALL BLSUVSPO(ZZ2,MYRPL);       /* POINT TO RECORD               */
         ST    R9,@AL00001                                         0228
         LA    @14,MYRPL                                           0228
         ST    @14,@AL00001+4                                      0228
         L     @08,ZZ2BVTP(,R9)                                    0228
         L     @15,BVTVSPOP(,@08)                                  0228
         LA    @01,@AL00001                                        0228
         BALR  @14,@15                                             0228
*   IF RF^=ZZZFLAGI THEN                                           0229
*                                                                  0229
         LTR   RF,RF                                               0229
         BZ    @RF00229                                            0229
*     /***************************************************************/
*     /*                                                             */
*     /* POINT ERROR                                                 */
*     /*                                                             */
*     /***************************************************************/
*                                                                  0230
*     DO;                           /* POINT ERROR                   */
*       RETC=MAX(RF,ZZZFLAGT);      /* RETURN CODE(MSG BY BLSUVSPO)  */
         LA    RETC,16                                             0231
         CR    RETC,RF                                             0231
         BNL   *+6
         LR    RETC,RF                                             0231
*       GO TO EXITRLSA;             /* EXIT WITH PDL                 */
         B     EXITRLSA                                            0232
*     END;                                                         0233
*                                                                  0234
*   /*****************************************************************/
*   /*                                                               */
*   /* PROCESS THE RD SPACE RECORDS IN THE DEBUG FILE                */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0234
*   DO WHILE(FLAGEND='0'B);         /* LOOP THROUGH RD RECORDS       */
@RF00229 B     @DE00234                                            0234
@DL00234 DS    0H                                                  0235
*     CALL BLSUVSGE(ZZ2,MYRPL);     /* RETRIEVE RECORD               */
         ST    R9,@AL00001                                         0235
         LA    @14,MYRPL                                           0235
         ST    @14,@AL00001+4                                      0235
         L     @08,ZZ2BVTP(,R9)                                    0235
         L     @15,BVTVSGEP(,@08)                                  0235
         LA    @01,@AL00001                                        0235
         BALR  @14,@15                                             0235
*     RETC=MAX(RETC,RF);            /* RETURN CODE                   */
         CR    RETC,RF                                             0236
         BNL   *+6
         LR    RETC,RF                                             0236
*     IF RF^=ZZZFLAGI×              /* END                           */
*         RDAURID^=ZZZRIDRD         /* PAST LAST RD RECORD           */
*       THEN                                                       0237
         LTR   RF,RF                                               0237
         BNZ   @RT00237                                            0237
         CLC   RDAURID(2),@CC00134                                 0237
         BE    @RF00237                                            0237
@RT00237 DS    0H                                                  0238
*       FLAGEND='1'B;               /* END PROCESSING LOOP           */
         OI    FLAGEND,B'10000000'                                 0238
*     ELSE                                                         0239
*       CALL BLSUPUTD(ZZ2,RDAUD);   /* OUTPUT DSNAME                 */
         B     @RC00237                                            0239
@RF00237 ST    R9,@AL00001                                         0239
         LA    @14,RDAUD                                           0239
         ST    @14,@AL00001+4                                      0239
         L     @08,ZZ2BVTP(,R9)                                    0239
         L     @15,BVTPUTDP(,@08)                                  0239
         LA    @01,@AL00001                                        0239
         BALR  @14,@15                                             0239
*   END;                                                           0240
@RC00237 DS    0H                                                  0240
@DE00234 TM    FLAGEND,B'10000000'                                 0240
         BZ    @DL00234                                            0240
*                                                                  0241
*   /*****************************************************************/
*   /*                                                               */
*   /* PROGRAM EXIT                                                  */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0241
*   CALL BLSUVSEN(ZZ2,MYRPL);       /* TERMINATE VSAM STRING         */
         ST    R9,@AL00001                                         0241
         LA    @14,MYRPL                                           0241
         ST    @14,@AL00001+4                                      0241
         L     @08,ZZ2BVTP(,R9)                                    0241
         L     @15,BVTVSENP(,@08)                                  0241
         LA    @01,@AL00001                                        0241
         BALR  @14,@15                                             0241
*   RETC=MAX(RETC,RF);              /* RETURN CODE                   */
         CR    RETC,RF                                             0242
         BNL   *+6
         LR    RETC,RF                                             0242
*EXITRLSA:                          /* EXIT WITH PDL                 */
*   RETC=MIN(MAX(RF,RETC),ZZZFLAGT);/* SET RETURN CODE               */
EXITRLSA LR    @14,RETC                                            0243
         CR    @14,RF                                              0243
         BNL   *+6
         LR    @14,RF                                              0243
         LA    @08,16                                              0243
         CR    @14,@08                                             0243
         BNH   *+6
         LR    @14,@08                                             0243
         LR    RETC,@14                                            0243
*   DO WHILE(PDAPTR^=0);            /* BLRRLSA MF(EXECUTE,PD)        */
         B     @DE00244                                            0244
@DL00244 DS    0H                                                  0245
*     PDRPTR=PDAPTR;                                               0245
         L     PDRPTR,PDAPTR                                       0245
*     PDAPTR=PDXP;                                                 0246
         L     @14,PDXP-1(,PDRPTR)                                 0246
         LA    @14,0(,@14)                                         0246
         ST    @14,PDAPTR                                          0246
*     DO;                           /* FREEMAIN(R)                 0247
*                                      LV(PDL)SP(1)A(PDDSECT)        */
*       RESPECIFY                                                  0248
*        (GPR01F,                                                  0248
*         GPR00F) RESTRICTED;                                      0248
*       GPR00F=PDL;                 /* LENGTH REQUESTED              */
         L     GPR00F,PDL-1(,PDRPTR)                               0249
         ICM   GPR00F,8,@CB01158                                   0249
*       GPR01F=1;                   /* SP IN REG 1                   */
         LA    GPR01F,1                                            0250
*       GEN(SLL   GPR01F,24)                                       0251
*       NODEFS NOREFS NOSETS NOEXIT NOFLOWS SEQFLOW;               0251
         SLL   GPR01F,24
*       GPR00F=GPR00F×GPR01F;       /* SP IN HI BYTE                 */
         OR    GPR00F,GPR01F                                       0252
*       GPR01F=ADDR(PDDSECT);       /* SET REGISTER ONE              */
         LR    GPR01F,PDRPTR                                       0253
*       SVC(10);                    /* R-FORM OF GETMAIN             */
         SVC   10                                                  0254
*       RESPECIFY                                                  0255
*        (GPR01F,                                                  0255
*         GPR00F) UNRESTRICTED;                                    0255
*     END;                          /* FREEMAIN(R)                 0256
*                                      LV(PDL)SP(1)A(PDDSECT)        */
*   END;                            /* BLRRLSA MF(EXECUTE,PD)        */
@DE00244 L     @14,PDAPTR                                          0257
         LTR   @14,@14                                             0257
         BNZ   @DL00244                                            0257
*EXITNORL:                          /* EXIT WITH NO PDL              */
*   RETURN CODE(RETC);                                             0258
*                                                                  0258
EXITNORL L     @13,4(,@13)                                         0258
         L     @00,@SIZDATD                                        0258
         LR    @01,@11                                             0258
         BLSUFRER R,LV=(0),A=(1)
         LR    @15,@05                                             0258
         L     @14,12(,@13)                                        0258
         LM    @00,@12,20(@13)                                     0258
         BR    @14                                                 0258
*/*BLSRPEND--DEBUGGING MODULE                                        */
*/*BLSUPEND--MVS IPCS MODULE                                         */
*                                                                  0259
*   DECLARE                         /* GENERAL PURPOSE REGISTERS     */
*     GPR00F FIXED(31) REG(0),                                     0259
*     GPR01F FIXED(31) REG(1),                                     0259
*     GPR15F FIXED(31) REG(15);                                    0259
*   DECLARE                         /* COMMON VARIABLES              */
*     I256C CHAR(256) BASED,                                       0260
*     I031F FIXED(31) BASED,                                       0260
*     I031P PTR(31) BASED,                                         0260
*     I015F FIXED(15) BASED,                                       0260
*     I015P PTR(15) BASED,                                         0260
*     I008P PTR(8) BASED,                                          0260
*     I001C CHAR(1) BASED;                                         0260
*   GENERATE NODEFS NOREFS DATA;                                   0261
*   END BLSRDULS                    /* BLRPEND(BLSRDULS)             */
*                                                                  0262
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */
*/*%INCLUDE SYSLIB  (BLSRZZZ )                                       */
*/*%INCLUDE SYSLIB  (BLSUZZZ )                                       */
*/*%INCLUDE SYSLIB  (BLRFULL )                                       */
*/*%INCLUDE SYSLIB  (IKJCPPL )                                       */
*/*%INCLUDE SYSLIB  (IKJPSCB )                                       */
*/*%INCLUDE SYSLIB  (IKJECT  )                                       */
*/*%INCLUDE SYSLIB  (IKJUPT  )                                       */
*/*%INCLUDE SYSLIB  (BLSUSERV)                                       */
*/*%INCLUDE SYSLIB  (BLRSERV )                                       */
*/*%INCLUDE SYSLIB  (BLRSERVD)                                       */
*/*%INCLUDE SYSLIB  (BLSRSERV)                                       */
*/*%INCLUDE SYSLIB  (IFGRPL  )                                       */
*                                                                  0262
*       ;                                                          0262
@EL00001 L     @13,4(,@13)                                         0262
@EF00001 L     @00,@SIZDATD                                        0262
         LR    @01,@11                                             0262
         BLSUFRER R,LV=(0),A=(1)
@ER00001 LM    @14,@12,12(@13)                                     0262
         BR    @14                                                 0262
@DATA    DS    0H
@CH00043 DC    H'1'
@CH00068 DC    H'2'
@DATD    DSECT
         DS    0F
@SA00001 DS    18F
@AL00001 DS    3A
BLSRDULS CSECT
         DS    0F
@CF00051 DC    F'8'
@DATD    DSECT
         DS    0D
PDAPTR   DS    A
         DS    CL4
VSAMBUFR DS    CL3072
FLAG     DS    BL1
         ORG   FLAG
FLAGEND  DS    BL1
@NM00087 EQU   FLAG+0
         ORG   FLAG+1
         DS    CL3
MYRPL    DS    CL256
BLSRDULS CSECT
         DS    0F
@SIZDATD DC    AL1(0)
         DC    AL3(@ENDDATD-@DATD)
         DS    0D
PCPTR    DC    AL4(PC)
@CC00134 DC    C'RD'
@CB01158 DC    X'00'
         DS    CL1
PXRO     DC    AL2(PXPRINT-PD)
         DC    AL2(PXTERM-PD)
         DC    AL2(PXDFLG-PD)
         DC    AL2(PXDFLV-PD)
@DATD    DSECT
         SPACE 2
***********************************************************************
* THE FOLLOWING AREA, BLRPATCH, IS RESERVED FOR PATCH APPLICATION     *
* TO OBTAIN PATCH ROOM IN THE @DATD AUTOMATIC STORAGE AREA, MODIFY    *
* CONSTANT @SIZDATD TO REFLECT THE DESIRED @DATD SIZE                 *
***********************************************************************
         SPACE
BLSRDULS CSECT
         ORG
         DS    0D
BLRPATCH DC    CL8'ZAPAREA',(((*-BLSRDULS+19)/20+7)/8)CL8'BLSRDULS'
@DATD    DSECT
         DS    0H
@DATD    DSECT
         SPACE 2
***********************************************************************
* IKJPARM--BEGIN MACROS SPECIFYING COMMAND SYNTAX                     *
***********************************************************************
         SPACE
BLSRDULS CSECT
PC       IKJPARM DSECT=PD
@DATD    DSECT
BLSRDULS CSECT
PXPRINT  IKJKEYWD
@DATD    DSECT
BLSRDULS CSECT
         IKJNAME 'PRINT'
@DATD    DSECT
BLSRDULS CSECT
         IKJNAME 'NOPRINT'
@DATD    DSECT
BLSRDULS CSECT
PXTERM   IKJKEYWD
@DATD    DSECT
BLSRDULS CSECT
         IKJNAME 'TERMINAL'
@DATD    DSECT
BLSRDULS CSECT
         IKJNAME 'NOTERMINAL'
@DATD    DSECT
BLSRDULS CSECT
PXDFLG   IKJKEYWD
@DATD    DSECT
BLSRDULS CSECT
         IKJNAME 'FLAG',SUBFLD=PXSUBFM
@DATD    DSECT
BLSRDULS CSECT
PXTEST   IKJKEYWD
@DATD    DSECT
BLSRDULS CSECT
         IKJNAME 'TEST'
@DATD    DSECT
BLSRDULS CSECT
         IKJNAME 'NOTEST'
@DATD    DSECT
BLSRDULS CSECT
         SPACE
PXSUBFM  IKJSUBF
@DATD    DSECT
BLSRDULS CSECT
PXDFLV   IKJKEYWD
@DATD    DSECT
BLSRDULS CSECT
         IKJNAME 'INFORMATIONAL'
@DATD    DSECT
BLSRDULS CSECT
         IKJNAME 'WARNING'
@DATD    DSECT
BLSRDULS CSECT
         IKJNAME 'ERROR'
@DATD    DSECT
BLSRDULS CSECT
         IKJNAME 'SERIOUS',ALIAS=('SEVERE')
@DATD    DSECT
BLSRDULS CSECT
         IKJNAME 'TERMINATING'
@DATD    DSECT
PD       DSECT
PD99     DS    0C
BLSRDULS CSECT
         IKJENDP
         SPACE 2
***********************************************************************
* IKJENDP--END SYNTAX DESCRIPTION                                     *
***********************************************************************
         SPACE
@DATD    DSECT
         SPACE 2
*---------------------------------------------------------------------*
*/*RESERVE STORAGE FOR THE GENCB PARAMETER LIST                       *
*---------------------------------------------------------------------*
         SPACE
GENPARM  DS    (GENPARML)CL1        GENCB PARAMETER LIST
***/
@DATD    DSECT
         SPACE 2
***********************************************************************
* ALIGN END OF DATA ON A DOUBLEWORD BOUNDARY                          *
***********************************************************************
         SPACE
         DS    0D
@DATD    DSECT
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA
@ENDDATD EQU   *
BLSRDULS CSECT
@00      EQU   00                      EQUATES FOR REGISTERS 0-15
@01      EQU   01
@02      EQU   02
@03      EQU   03
@04      EQU   04
@05      EQU   05
@06      EQU   06
@07      EQU   07
@08      EQU   08
@09      EQU   09
@10      EQU   10
@11      EQU   11
@12      EQU   12
@13      EQU   13
@14      EQU   14
@15      EQU   15
RETC     EQU   @05
R9       EQU   @09
R0       EQU   @00
R1       EQU   @01
R2       EQU   @02
R3       EQU   @03
R4       EQU   @04
R5       EQU   @05
R6       EQU   @06
R7       EQU   @07
RB       EQU   @11
RD       EQU   @13
RE       EQU   @14
RF       EQU   @15
PDRPTR   EQU   @10
GPR15F   EQU   @15
GPR01F   EQU   @01
GPR00F   EQU   @00
RA       EQU   @10
RC       EQU   @12
R8       EQU   @08
ZZ1      EQU   0
ZZ1ACBP  EQU   ZZ1+28
ZZ1ATTN  EQU   ZZ1+360
ZZ1EVE   EQU   ZZ1ATTN+4
ZZ1F     EQU   ZZ1+368
ZZ1N     EQU   ZZ1+1116
ZZ2      EQU   0
ZZ2AMD   EQU   ZZ2
@NM00013 EQU   ZZ2AMD+7
ZZ2PRT   EQU   ZZ2+138
ZZ2PRTT  EQU   ZZ2PRT+4
ZZ2PRTT1 EQU   ZZ2PRTT+1
ZZ2A     EQU   ZZ2+272
ZZ2AF    EQU   ZZ2A+16
ZZ2AFX   EQU   ZZ2AF+5
ZZ2APID  EQU   ZZ2A+64
ZZ2AD    EQU   ZZ2A+74
ZZ2ADD   EQU   ZZ2AD
ZZ2ADDT  EQU   ZZ2ADD+2
ZZ2ADM   EQU   ZZ2AD+46
ZZ2ADMT  EQU   ZZ2ADM+2
ZZ2ADP   EQU   ZZ2AD+56
ZZ2ADPT  EQU   ZZ2ADP+2
ZZ2AZZ6P EQU   ZZ2A+140
ZZ2AQAS  EQU   ZZ2A+144
ZZ2AQD   EQU   ZZ2A+160
ZZ2AQDT  EQU   ZZ2AQD+10
ZZ2AQDF  EQU   ZZ2AQD+52
ZZ2STG   EQU   ZZ2+960
ZZ2ALLOP EQU   ZZ2+992
ZZ2FREEP EQU   ZZ2+996
ZZ2FF19P EQU   ZZ2+1000
ZZ2FRE1P EQU   ZZ2+1004
ZZ2FF18P EQU   ZZ2+1008
ZZ2DYNAP EQU   ZZ2+1012
ZZ2ZZ2CP EQU   ZZ2+1016
ZZ2ZZ2DP EQU   ZZ2+1020
ZZ2STAIP EQU   ZZ2+1024
ZZ2FF02P EQU   ZZ2+1028
ZZ2GETLP EQU   ZZ2+1032
ZZ2PARSP EQU   ZZ2+1036
ZZ2PTGTP EQU   ZZ2+1040
ZZ2PUTLP EQU   ZZ2+1044
ZZ2SCANP EQU   ZZ2+1048
ZZ2STCKP EQU   ZZ2+1052
ZZ2TRMOP EQU   ZZ2+1064
ZZ2TRMVP EQU   ZZ2+1068
ZZ2PUTNP EQU   ZZ2+1084
ZZ2TRMNP EQU   ZZ2+1088
ZZ2ZZ1P  EQU   ZZ2+1264
ZZ2BVTP  EQU   ZZ2+1280
ZZ2RVTP  EQU   ZZ2+1284
ZZ2CPPL  EQU   ZZ2+1292
ZZ2CPPLC EQU   ZZ2CPPL
ZZ2ITR   EQU   ZZ2+2840
ZZ2ITRE  EQU   ZZ2ITR+16
ZZ2ITSE  EQU   ZZ2+2864
ZZ2ES    EQU   ZZ2+2872
ZZ2AMDX  EQU   ZZ2+7160
ZZ2AXO   EQU   ZZ2+7934
ZZ2AXOT  EQU   ZZ2AXO+2
CMD      EQU   0
CMDT     EQU   CMD+4
PSCB     EQU   0
PSCBATR1 EQU   PSCB+16
ECT      EQU   0
ECTSWS   EQU   ECT+28
ECTSWS2  EQU   ECT+40
ECTSWS21 EQU   ECTSWS2
UPT      EQU   0
UPTSWS   EQU   UPT+12
SA       EQU   0
SA1      EQU   SA
SAR      EQU   SA+12
SAR1     EQU   SAR+12
BLSUPARI EQU   0
BLSUPARU EQU   0
BLSUPUTD EQU   0
BLSUVSCR EQU   0
BLSUVSEN EQU   0
BLSUVSGE EQU   0
BLSUVSPO EQU   0
BVT      EQU   0
BVTPUTLP EQU   BVT+4
BVTPUTOP EQU   BVT+12
BVTPUTTP EQU   BVT+16
BVTPUTVP EQU   BVT+20
BVTPUTAP EQU   BVT+24
BVTPRTTP EQU   BVT+28
BVTPRTAP EQU   BVT+32
BVTPUTDP EQU   BVT+36
BVTMONP  EQU   BVT+40
BVTMON2P EQU   BVT+44
BVTVSARP EQU   BVT+48
BVTVSENP EQU   BVT+64
BVTVSERP EQU   BVT+68
BVTVSGEP EQU   BVT+72
BVTVSGUP EQU   BVT+76
BVTVSPOP EQU   BVT+80
BVTVSPUP EQU   BVT+84
BVTMPKNP EQU   BVT+104
BVTMONLP EQU   BVT+108
BVTPUTCP EQU   BVT+132
BVTMPK1P EQU   BVT+136
BVTZZ2RP EQU   BVT+140
BVTPGMRP EQU   BVT+144
BVTMONAP EQU   BVT+148
BVTBLDDP EQU   BVT+152
BVTBLDLP EQU   BVT+156
BVTPGMCP EQU   BVT+160
BVTPGMDP EQU   BVT+164
BVTPGMLP EQU   BVT+168
BVTMONCP EQU   BVT+180
BVTMONDP EQU   BVT+184
BVTMONTP EQU   BVT+188
BVTPARIP EQU   BVT+192
BVTPARUP EQU   BVT+196
BVTPRTNP EQU   BVT+204
BVTVSCRP EQU   BVT+208
BVTVSMRP EQU   BVT+212
BVTMONXP EQU   BVT+216
BVTTRMAP EQU   BVT+228
ZZ6      EQU   0
ZZ6D     EQU   ZZ6+128
ZZ6DD    EQU   ZZ6D+8
ZZ6DDT   EQU   ZZ6DD+4
ZZ6DQA   EQU   ZZ6D+68
ZZ6DF    EQU   ZZ6D+92
ZZ6B     EQU   ZZ6+768
RVT      EQU   0
RVTADDRP EQU   RVT
RVTT01P  EQU   RVT+4
RVTTAP   EQU   RVT+8
RVTTBP   EQU   RVT+12
RVTTCP   EQU   RVT+16
RVTTFP   EQU   RVT+24
RVTTYP   EQU   RVT+40
RVTT02P  EQU   RVT+48
RVTT03P  EQU   RVT+52
RVTT04P  EQU   RVT+56
RVTACCLP EQU   RVT+60
RVTRACCP EQU   RVT+64
RVTTLP   EQU   RVT+68
RVTTMP   EQU   RVT+72
RVTTUP   EQU   RVT+80
RVTESGEP EQU   RVT+84
RVTESGUP EQU   RVT+88
RVTESARP EQU   RVT+92
RVTRAARP EQU   RVT+96
RVTRAGEP EQU   RVT+100
RVTADDPP EQU   RVT+104
RVTACCQP EQU   RVT+108
RVTSAGUP EQU   RVT+124
RVTSAGEP EQU   RVT+128
RVTESCKP EQU   RVT+132
RVTMSGAP EQU   RVT+136
RVTMSGDP EQU   RVT+140
RVTADDTP EQU   RVT+160
RVTADDUP EQU   RVT+164
RVTADD1P EQU   RVT+176
RVTADD2P EQU   RVT+180
RVTRSAGP EQU   RVT+184
RVTMSGBP EQU   RVT+188
RVTADDSP EQU   RVT+192
RVTADD3P EQU   RVT+196
RVTT05P  EQU   RVT+200
RVTPADSP EQU   RVT+204
RVTTRP   EQU   RVT+228
RVTADD4P EQU   RVT+232
RVTSAPCP EQU   RVT+236
RVTSAARP EQU   RVT+240
RVTSAGNP EQU   RVT+244
RVTT06P  EQU   RVT+248
RVTSAGCP EQU   RVT+252
RVTSAGQP EQU   RVT+256
RVTESGCP EQU   RVT+260
RVTESGQP EQU   RVT+264
RVTDUCKP EQU   RVT+276
RVTDUCCP EQU   RVT+280
IFGRPL   EQU   0
RPLCOMN  EQU   IFGRPL
RPLIDWD  EQU   RPLCOMN
RPLLEN   EQU   RPLIDWD+3
RPLECB   EQU   RPLCOMN+8
RPLFDBWD EQU   RPLCOMN+12
RPLFDBK  EQU   RPLFDBWD+1
RPLRTNCD EQU   RPLFDBK
RPLCNDCD EQU   RPLFDBK+1
RPLCMPON EQU   RPLCNDCD
RPLFDB2  EQU   RPLCMPON
RPLERRCD EQU   RPLCNDCD+1
RPLFDB3  EQU   RPLERRCD
RPLKEYLE EQU   RPLCOMN+16
RPLARG   EQU   RPLCOMN+36
RPLOPTCD EQU   RPLCOMN+40
RPLOPT1  EQU   RPLOPTCD
RPLECBSW EQU   RPLOPT1
RPLOPT2  EQU   RPLOPTCD+1
RPLADR   EQU   RPLOPT2
RPLOPT3  EQU   RPLOPTCD+2
RPLNXTRP EQU   RPLCOMN+44
RPLOPTC2 EQU   RPLCOMN+56
RPLOPT5  EQU   RPLOPTC2
RPLWRTYP EQU   RPLOPT5
RPLOPT6  EQU   RPLOPTC2+1
RPLUNTYP EQU   RPLOPT6
RPLOPT7  EQU   RPLOPTC2+2
RPLCNOPT EQU   RPLOPT7
RPLOPT8  EQU   RPLOPTC2+3
RPLRBAR  EQU   RPLCOMN+60
RPLAIXID EQU   RPLRBAR+2
RPLEXTDS EQU   RPLCOMN+68
RPLEXTD1 EQU   RPLEXTDS
PCCSECT  EQU   0
PDDSECT  EQU   0
PDXP     EQU   PDDSECT+1
PDL      EQU   PDDSECT+5
BLSRACC  EQU   0
BLSRACCL EQU   0
BLSRACCQ EQU   0
BLSRADDP EQU   0
BLSRADDR EQU   0
BLSRADDS EQU   0
BLSRADDT EQU   0
BLSRADDU EQU   0
BLSRADD1 EQU   0
BLSRADD2 EQU   0
BLSRADD3 EQU   0
BLSRADD4 EQU   0
BLSRDUCC EQU   0
BLSRDUCK EQU   0
BLSRESAR EQU   0
BLSRESCK EQU   0
BLSRESGC EQU   0
BLSRESGE EQU   0
BLSRESGQ EQU   0
BLSRESGU EQU   0
BLSRMSGA EQU   0
BLSRMSGB EQU   0
BLSRMSGD EQU   0
BLSRPADS EQU   0
BLSRRAAR EQU   0
BLSRRAGE EQU   0
BLSRSAAR EQU   0
BLSRSAG  EQU   0
BLSRSAGC EQU   0
BLSRSAGE EQU   0
BLSRSAGN EQU   0
BLSRSAGQ EQU   0
BLSRSAGU EQU   0
BLSRSAPC EQU   0
BLSTA    EQU   0
BLSTB    EQU   0
BLSTC    EQU   0
BLSTF    EQU   0
BLSTL    EQU   0
BLSTM    EQU   0
BLSTR    EQU   0
BLSTU    EQU   0
BLSTY    EQU   0
BLST01   EQU   0
BLST02   EQU   0
BLST03   EQU   0
BLST04   EQU   0
BLST05   EQU   0
BLST06   EQU   0
BLSUALLO EQU   0
BLSUBLDD EQU   0
BLSUBLDL EQU   0
BLSUDYNA EQU   0
BLSUFREE EQU   0
BLSUFRE1 EQU   0
BLSUMON  EQU   0
BLSUMONA EQU   0
BLSUMONC EQU   0
BLSUMOND EQU   0
BLSUMONL EQU   0
BLSUMONT EQU   0
BLSUMONX EQU   0
BLSUMON2 EQU   0
BLSUMPKN EQU   0
BLSUMPK1 EQU   0
BLSUPGMC EQU   0
BLSUPGMD EQU   0
BLSUPGML EQU   0
BLSUPGMR EQU   0
BLSUPRTA EQU   0
BLSUPRTN EQU   0
BLSUPRTT EQU   0
BLSUPUTA EQU   0
BLSUPUTC EQU   0
BLSUPUTL EQU   0
BLSUPUTN EQU   0
BLSUPUTO EQU   0
BLSUPUTT EQU   0
BLSUPUTV EQU   0
BLSUSTAI EQU   0
BLSUTRMA EQU   0
BLSUTRMN EQU   0
BLSUTRMO EQU   0
BLSUTRMV EQU   0
BLSUVSAR EQU   0
BLSUVSER EQU   0
BLSUVSGU EQU   0
BLSUVSMR EQU   0
BLSUVSPU EQU   0
BLSUZZ2C EQU   0
BLSUZZ2D EQU   0
BLSUZZ2R EQU   0
IKJEFF02 EQU   0
IKJEFF18 EQU   0
IKJEFF19 EQU   0
IKJGETL  EQU   0
IKJPARS  EQU   0
IKJPTGT  EQU   0
IKJPUTL  EQU   0
IKJSCAN  EQU   0
IKJSTCK  EQU   0
I001C    EQU   0
I008P    EQU   0
I015F    EQU   0
I015P    EQU   0
I031F    EQU   0
I031P    EQU   0
I256C    EQU   0
CPPL     EQU   ZZ2CPPL
CPPLUPT  EQU   CPPL+4
CPPLPSCB EQU   CPPL+8
CPPLECT  EQU   CPPL+12
RDAU     EQU   VSAMBUFR
RDAURID  EQU   RDAU
RDAUD    EQU   RDAU+8
RDAUDT   EQU   RDAUD+4
RDAUQA   EQU   RDAU+68
RDAUF    EQU   RDAU+92
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS
RDAU999  EQU   RDAU+128
@NM00086 EQU   RDAU+116
RDAUCAP  EQU   RDAU+112
RDAUPRP  EQU   RDAU+108
RDAUDA2  EQU   RDAU+104
RDAUDA1  EQU   RDAU+100
@NM00085 EQU   RDAUF
RDAUFSU  EQU   RDAUF
RDAUFST  EQU   RDAUF
RDAUFAB  EQU   RDAUF
RDAUFMP  EQU   RDAUF
RDAUFDU  EQU   RDAUF
RDAUFBS  EQU   RDAUF
RDAUQ2   EQU   RDAU+88
RDAUQ1   EQU   RDAU+84
RDAUQA9  EQU   RDAUQA+16
@NM00084 EQU   RDAUQA+12
RDAUQA2  EQU   RDAUQA+8
RDAUQA1  EQU   RDAUQA+4
@NM00083 EQU   RDAUQA+2
RDAUQAT  EQU   RDAUQA
RDAUQA0  EQU   RDAUQA
RDAURDX  EQU   RDAU+64
RDAUELK  EQU   RDAU+64
RDAUMEM  EQU   RDAU+56
RDAUDT1  EQU   RDAUDT
RDAUDO   EQU   RDAUD+2
RDAUDL   EQU   RDAUD
@NM00082 EQU   RDAU+2
CPPLCBUF EQU   CPPL
PDSP     EQU   PDDSECT+4
@NM00081 EQU   PDDSECT
RPLERMSA EQU   RPLCOMN+72
RPLEMLEN EQU   RPLCOMN+70
RPLACTIV EQU   RPLCOMN+69
RPLBRANC EQU   RPLEXTD1
RPLNIB   EQU   RPLEXTD1
@NM00080 EQU   RPLEXTD1
RPLEXIT  EQU   RPLEXTD1
RPLNEXIT EQU   RPLEXTD1
RPLEXSCH EQU   RPLEXTD1
RPLDDDD  EQU   RPLRBAR+4
@NM00079 EQU   RPLRBAR+3
@NM00078 EQU   RPLAIXID
RPLAXPKP EQU   RPLAIXID
RPLAIXPC EQU   RPLRBAR
RPLRSV88 EQU   RPLOPT8
RPLUNCON EQU   RPLOPT8
RPLACTV  EQU   RPLOPT8
RPLSESS  EQU   RPLOPT8
RPLPEND  EQU   RPLOPT8
RPLODPRM EQU   RPLOPT8
RPLODACP EQU   RPLOPT8
RPLODACQ EQU   RPLOPT8
RPLRSV78 EQU   RPLOPT7
RPLRSV77 EQU   RPLOPT7
RPLRLSOP EQU   RPLOPT7
RPLTPOST EQU   RPLOPT7
RPLQOPT  EQU   RPLOPT7
RPLCNIMM EQU   RPLCNOPT
RPLCNANY EQU   RPLCNOPT
RPLCNALL EQU   RPLCNOPT
RPLRSV68 EQU   RPLOPT6
RPLRSV67 EQU   RPLOPT6
RPLLOCK  EQU   RPLOPT6
RPLNCOND EQU   RPLOPT6
RPLCOND  EQU   RPLOPT6
RPLEOT   EQU   RPLUNTYP
RPLEOM   EQU   RPLUNTYP
RPLEOB   EQU   RPLUNTYP
RPLWROPT EQU   RPLOPT5
RPLNODE  EQU   RPLOPT5
RPLERACE EQU   RPLWRTYP
RPLEAU   EQU   RPLWRTYP
RPLNERAS EQU   RPLWRTYP
RPLPSOPT EQU   RPLOPT5
RPLSSNIN EQU   RPLOPT5
RPLDLGIN EQU   RPLOPT5
RPLBUFL  EQU   RPLCOMN+52
RPLRLEN  EQU   RPLCOMN+48
RPLCHAIN EQU   RPLNXTRP
RPLOPT4  EQU   RPLOPTCD+3
RPLALIGN EQU   RPLOPT3
RPLFMT   EQU   RPLOPT3
RPLFLD   EQU   RPLOPT3
RPLVFY   EQU   RPLOPT3
RPLBLK   EQU   RPLOPT3
RPLSFORM EQU   RPLOPT3
RPLEODS  EQU   RPLOPT3
RPLNSP   EQU   RPLOPT2
RPLUPD   EQU   RPLOPT2
@NM00077 EQU   RPLOPT2
RPLLRD   EQU   RPLOPT2
RPLBWD   EQU   RPLOPT2
RPLCNV   EQU   RPLOPT2
RPLADD   EQU   RPLADR
RPLKEY   EQU   RPLOPT2
RPLECBIN EQU   RPLECBSW
RPLGEN   EQU   RPLOPT1
RPLKGE   EQU   RPLOPT1
RPLASY   EQU   RPLOPT1
RPLSKP   EQU   RPLOPT1
RPLSEQ   EQU   RPLOPT1
RPLDIR   EQU   RPLOPT1
RPLLOC   EQU   RPLOPT1
RPLDAF   EQU   RPLARG+2
RPLSAF   EQU   RPLARG
RPLAREA  EQU   RPLCOMN+32
RPLTCBPT EQU   RPLCOMN+28
RPLDACB  EQU   RPLCOMN+24
RPLCCHAR EQU   RPLCOMN+20
RPLSTRID EQU   RPLCOMN+18
RPLKEYL  EQU   RPLKEYLE
RPLRDSOH EQU   RPLFDB3
RPLRLG   EQU   RPLFDB3
RPLLGFRC EQU   RPLFDB3
RPLREOT  EQU   RPLFDB3
RPLREOM  EQU   RPLFDB3
RPLREOB  EQU   RPLFDB3
RPLSV32  EQU   RPLFDB3
RPLUINPT EQU   RPLFDB3
RPLSTSAV EQU   RPLFDB2
RPLCUERR EQU   RPLFDB2
RPLDLGFL EQU   RPLFDB2
RPLIOERR EQU   RPLFDB2
RPLDVUNS EQU   RPLFDB2
RPLATND  EQU   RPLFDB2
RPLRVID  EQU   RPLFDB2
RPLERLK  EQU   RPLFDB2
RPLERREG EQU   RPLRTNCD
RPLSTAT  EQU   RPLFDBWD
RPLPOST  EQU   RPLECB
RPLWAIT  EQU   RPLECB
RPLPLHPT EQU   RPLCOMN+4
RPLLEN2  EQU   RPLLEN
RPLREQ   EQU   RPLIDWD+2
RPLSTYP  EQU   RPLIDWD+1
RPLID    EQU   RPLIDWD
RVT99999 EQU   RVT+384
RVT0096P EQU   RVT+380
RVT0095P EQU   RVT+376
RVT0094P EQU   RVT+372
RVT0093P EQU   RVT+368
RVT0092P EQU   RVT+364
RVT0091P EQU   RVT+360
RVT0090P EQU   RVT+356
RVT0089P EQU   RVT+352
RVT0088P EQU   RVT+348
RVT0087P EQU   RVT+344
RVT0086P EQU   RVT+340
RVT0085P EQU   RVT+336
RVT0084P EQU   RVT+332
RVT0083P EQU   RVT+328
RVT0082P EQU   RVT+324
RVT0081P EQU   RVT+320
RVT0080P EQU   RVT+316
RVT0079P EQU   RVT+312
RVT0078P EQU   RVT+308
RVT0077P EQU   RVT+304
RVT0076P EQU   RVT+300
RVT0075P EQU   RVT+296
RVT0074P EQU   RVT+292
RVT0073P EQU   RVT+288
RVT0072P EQU   RVT+284
RVTDTUTP EQU   RVT+272
RVTDTMTP EQU   RVT+268
RVT0057P EQU   RVT+224
RVT0056P EQU   RVT+220
RVT0055P EQU   RVT+216
RVT0054P EQU   RVT+212
RVT0053P EQU   RVT+208
RVT0044P EQU   RVT+172
RVT0043P EQU   RVT+168
RVT0040P EQU   RVT+156
RVT0039P EQU   RVT+152
RVT0038P EQU   RVT+148
RVT0037P EQU   RVT+144
RVT0031P EQU   RVT+120
RVT0030P EQU   RVT+116
RVT0029P EQU   RVT+112
RVT0020P EQU   RVT+76
RVT0012P EQU   RVT+44
RVT0010P EQU   RVT+36
RVT0009P EQU   RVT+32
RVT0008P EQU   RVT+28
RVT0006P EQU   RVT+20
ZZ69999  EQU   ZZ6+1792
ZZ6BRB   EQU   ZZ6B+12
ZZ6BRC   EQU   ZZ6B+8
@NM00076 EQU   ZZ6B+6
ZZ6BFL   EQU   ZZ6B+4
ZZ6BDA   EQU   ZZ6B
@NM00075 EQU   ZZ6+540
ZZ6BUFI  EQU   ZZ6+536
ZZ6BUFP  EQU   ZZ6+532
ZZ6FILE  EQU   ZZ6+524
ZZ6BUFB  EQU   ZZ6+520
ZZ6BUFL  EQU   ZZ6+518
ZZ6BUFN  EQU   ZZ6+516
ZZ6ZZ6P  EQU   ZZ6+512
@NM00074 EQU   ZZ6+256
ZZ6D999  EQU   ZZ6D+128
@NM00073 EQU   ZZ6D+116
ZZ6DCAP  EQU   ZZ6D+112
ZZ6DPRP  EQU   ZZ6D+108
ZZ6DDA2  EQU   ZZ6D+104
ZZ6DDA1  EQU   ZZ6D+100
@NM00072 EQU   ZZ6DF
ZZ6DFSU  EQU   ZZ6DF
ZZ6DFST  EQU   ZZ6DF
ZZ6DFAB  EQU   ZZ6DF
ZZ6DFMP  EQU   ZZ6DF
ZZ6DFDU  EQU   ZZ6DF
ZZ6DFBS  EQU   ZZ6DF
ZZ6DQ2   EQU   ZZ6D+88
ZZ6DQ1   EQU   ZZ6D+84
ZZ6DQA9  EQU   ZZ6DQA+16
@NM00071 EQU   ZZ6DQA+12
ZZ6DQA2  EQU   ZZ6DQA+8
ZZ6DQA1  EQU   ZZ6DQA+4
@NM00070 EQU   ZZ6DQA+2
ZZ6DQAT  EQU   ZZ6DQA
ZZ6DQA0  EQU   ZZ6DQA
ZZ6DRDX  EQU   ZZ6D+64
ZZ6DELK  EQU   ZZ6D+64
ZZ6DMEM  EQU   ZZ6D+56
ZZ6DDT1  EQU   ZZ6DDT
ZZ6DDO   EQU   ZZ6DD+2
ZZ6DDL   EQU   ZZ6DD
@NM00069 EQU   ZZ6D+2
ZZ6DRID  EQU   ZZ6D
ZZ6RDCB  EQU   ZZ6
ZZ60000  EQU   ZZ6
BVT99999 EQU   BVT+256
BVT0064P EQU   BVT+252
BVT0063P EQU   BVT+248
BVT0062P EQU   BVT+244
BVT0061P EQU   BVT+240
BVT0060P EQU   BVT+236
BVT0059P EQU   BVT+232
BVT0057P EQU   BVT+224
BVT0056P EQU   BVT+220
BVTSTBLP EQU   BVT+200
BVT0045P EQU   BVT+176
BVT0044P EQU   BVT+172
BVT0033P EQU   BVT+128
BVT0032P EQU   BVT+124
BVT0031P EQU   BVT+120
BVT0030P EQU   BVT+116
BVT0029P EQU   BVT+112
BVT0026P EQU   BVT+100
BVT0025P EQU   BVT+96
BVT0024P EQU   BVT+92
BVT0023P EQU   BVT+88
BVT0016P EQU   BVT+60
BVT0015P EQU   BVT+56
BVT0014P EQU   BVT+52
BVT0003P EQU   BVT+8
BVT0001P EQU   BVT
SA99     EQU   SA+72
SARC     EQU   SAR+56
SARB     EQU   SAR+52
SARA     EQU   SAR+48
SAR9     EQU   SAR+44
SAR8     EQU   SAR+40
SAR7     EQU   SAR+36
SAR6     EQU   SAR+32
SAR5     EQU   SAR+28
SAR4     EQU   SAR+24
SAR3     EQU   SAR+20
SAR2     EQU   SAR+16
SAR0     EQU   SAR+8
SARF     EQU   SAR+4
SARE     EQU   SAR
SAFWD    EQU   SA+8
SABAK    EQU   SA+4
SA1L     EQU   SA1+1
SA1P     EQU   SA1
UPTPREFL EQU   UPT+23
UPTPREFX EQU   UPT+16
@NM00068 EQU   UPT+15
UPTLDEL  EQU   UPT+14
UPTCDEL  EQU   UPT+13
UPTWTP   EQU   UPTSWS
UPTMODE  EQU   UPTSWS
UPTALD   EQU   UPTSWS
UPTPAUS  EQU   UPTSWS
UPTNCOM  EQU   UPTSWS
UPTMID   EQU   UPTSWS
UPTNPRM  EQU   UPTSWS
UPTRCVR  EQU   UPTSWS
UPTUSER  EQU   UPT+2
@NM00067 EQU   UPT
@NM00066 EQU   ECT+52
@NM00065 EQU   ECT+48
@NM00064 EQU   ECT+44
@NM00063 EQU   ECTSWS2+1
@NM00062 EQU   ECTSWS21
ECTTABND EQU   ECTSWS21
ECTDEFCS EQU   ECTSWS21
ECTBKPB  EQU   ECT+36
ECTUSER  EQU   ECT+32
ECTDDNUM EQU   ECT+29
ECTATTN  EQU   ECTSWS
ECTBKGRD EQU   ECTSWS
ECTNNOT  EQU   ECTSWS
ECTNMAL  EQU   ECTSWS
ECTLOGF  EQU   ECTSWS
ECTATRM  EQU   ECTSWS
@NM00061 EQU   ECTSWS
ECTNOPD  EQU   ECTSWS
ECTSCMD  EQU   ECT+20
ECTPCMD  EQU   ECT+12
ECTSMSG  EQU   ECT+9
ECTMSGF  EQU   ECT+8
ECTIOWA  EQU   ECT+4
ECTRTCD  EQU   ECT+1
ECTRCDF  EQU   ECT
PSCBU    EQU   PSCB+64
PSCBRSZ  EQU   PSCB+60
PSCBLINE EQU   PSCB+59
PSCBCHAR EQU   PSCB+58
PSCBUPTL EQU   PSCB+56
PSCBUPT  EQU   PSCB+52
PSCBRLGB EQU   PSCB+48
PSCBDEST EQU   PSCB+40
@NM00060 EQU   PSCB+36
@NM00059 EQU   PSCB+32
@NM00058 EQU   PSCB+28
PSCBLTI2 EQU   PSCB+24
PSCBLTIM EQU   PSCB+20
PSCBATR2 EQU   PSCB+18
@NM00057 EQU   PSCBATR1
@NM00056 EQU   PSCBATR1
@NM00055 EQU   PSCBATR1
PSCBATTN EQU   PSCBATR1
PSCBVMNT EQU   PSCBATR1
PSCBJCL  EQU   PSCBATR1
PSCBACCT EQU   PSCBATR1
PSCBCTRL EQU   PSCBATR1
PSCBGPNM EQU   PSCB+8
PSCBUSRL EQU   PSCB+7
PSCBUSER EQU   PSCB
CMDT1    EQU   CMDT
CMDO     EQU   CMD+2
CMDL     EQU   CMD
ZZ299999 EQU   ZZ2+8192
ZZ2AXOT1 EQU   ZZ2AXOT
ZZ2AXOL  EQU   ZZ2AXO
@NM00054 EQU   ZZ2+7288
@NM00053 EQU   ZZ2AMDX+4
ZZ2AMDXC EQU   ZZ2AMDX
ZZ2HSD   EQU   ZZ2+3056
@NM00052 EQU   ZZ2ES
@NM00051 EQU   ZZ2+2868
ZZ2ITSEC EQU   ZZ2ITSE+1
@NM00050 EQU   ZZ2ITSE
ZZ2ITSEP EQU   ZZ2ITSE
ZZ2ITSEW EQU   ZZ2ITSE
@NM00049 EQU   ZZ2ITR+20
ZZ2ITREC EQU   ZZ2ITRE+1
@NM00048 EQU   ZZ2ITRE
ZZ2ITREP EQU   ZZ2ITRE
ZZ2ITREW EQU   ZZ2ITRE
@NM00047 EQU   ZZ2ITR+9
ZZ2ITRRC EQU   ZZ2ITR+8
ZZ2ITR2P EQU   ZZ2ITR+4
ZZ2ITRPP EQU   ZZ2ITR
@NM00046 EQU   ZZ2+1544
ZZ2PGM   EQU   ZZ2+1536
@NM00045 EQU   ZZ2+1526
ZZ2CW    EQU   ZZ2+1524
@NM00044 EQU   ZZ2+1504
@NM00043 EQU   ZZ2+1352
ZZ2FFSYP EQU   ZZ2+1348
ZZ2SASYP EQU   ZZ2+1344
ZZ2RDSYP EQU   ZZ2+1340
ZZ2RASYP EQU   ZZ2+1336
ZZ2PHSYP EQU   ZZ2+1332
ZZ2ESSYP EQU   ZZ2+1328
ZZ200SYP EQU   ZZ2+1324
ZZ2SCWP  EQU   ZZ2+1320
ZZ2TTLP  EQU   ZZ2+1316
ZZ2LOADP EQU   ZZ2+1312
ZZ2VRESP EQU   ZZ2+1308
ZZ2CPPLE EQU   ZZ2CPPL+12
ZZ2CPPLP EQU   ZZ2CPPL+8
ZZ2CPPLU EQU   ZZ2CPPL+4
ZZ2VRSAP EQU   ZZ2+1288
ZZ2DVTP  EQU   ZZ2+1276
@NM00042 EQU   ZZ2+1272
@NM00041 EQU   ZZ2+1268
ZZ2RPLP  EQU   ZZ2+1260
ZZ2TCBP  EQU   ZZ2+1256
@NM00040 EQU   ZZ2+1252
ZZ2ZZ2P  EQU   ZZ2+1248
@NM00039 EQU   ZZ2+1112
ZZ2FPDRP EQU   ZZ2+1108
ZZ2FDSDP EQU   ZZ2+1104
ZZ2APDRP EQU   ZZ2+1100
ZZ2ADSDP EQU   ZZ2+1096
ZZ2ENQ0P EQU   ZZ2+1092
@NM00038 EQU   ZZ2+1080
ZZ2MSG0P EQU   ZZ2+1076
ZZ2FT25P EQU   ZZ2+1072
ZZ2MSGSP EQU   ZZ2+1060
ZZ2ALOCP EQU   ZZ2+1056
@NM00037 EQU   ZZ2+976
ZZ2TOD   EQU   ZZ2+968
ZZ2STGN  EQU   ZZ2STG+4
ZZ2STGP  EQU   ZZ2STG
@NM00036 EQU   ZZ2+952
ZZ2SCMDE EQU   ZZ2+944
ZZ2SCMDN EQU   ZZ2+936
ZZ2IDENT EQU   ZZ2+928
ZZ2A9999 EQU   ZZ2A+656
@NM00035 EQU   ZZ2A+224
@NM00034 EQU   ZZ2A+220
ZZ2AQD99 EQU   ZZ2AQD+60
@NM00033 EQU   ZZ2AQD+56
@NM00032 EQU   ZZ2AQDF
ZZ2AQDFA EQU   ZZ2AQDF
ZZ2AQDIL EQU   ZZ2AQD+48
ZZ2AQDIM EQU   ZZ2AQD+44
ZZ2AQDT9 EQU   ZZ2AQDT+34
ZZ2AQDTE EQU   ZZ2AQDT+33
ZZ2AQDTD EQU   ZZ2AQDT+2
@NM00031 EQU   ZZ2AQDT+1
ZZ2AQDTY EQU   ZZ2AQDT
ZZ2AQDT0 EQU   ZZ2AQDT
ZZ2AQDLB EQU   ZZ2AQD+9
ZZ2AQDOB EQU   ZZ2AQD+8
ZZ2AQDLE EQU   ZZ2AQD+4
ZZ2AQDOF EQU   ZZ2AQD
ZZ2AQD00 EQU   ZZ2AQD
ZZ2AQAS9 EQU   ZZ2AQAS+16
@NM00030 EQU   ZZ2AQAS+12
ZZ2AQAS2 EQU   ZZ2AQAS+8
ZZ2AQAS1 EQU   ZZ2AQAS+4
@NM00029 EQU   ZZ2AQAS+2
ZZ2AQAST EQU   ZZ2AQAS
ZZ2AQAS0 EQU   ZZ2AQAS
ZZ2ADPTA EQU   ZZ2ADPT
ZZ2ADPL  EQU   ZZ2ADP
ZZ2ADMTA EQU   ZZ2ADMT
ZZ2ADML  EQU   ZZ2ADM
ZZ2ADDTA EQU   ZZ2ADDT
ZZ2ADDL  EQU   ZZ2ADD
@NM00028 EQU   ZZ2A+72
ZZ2APIDB EQU   ZZ2APID+3
ZZ2APIDA EQU   ZZ2APID
@NM00027 EQU   ZZ2A+24
@NM00026 EQU   ZZ2AF+5
@NM00025 EQU   ZZ2AF+3
ZZ2AFS   EQU   ZZ2AF+2
ZZ2AFD   EQU   ZZ2AF+2
ZZ2AFQ   EQU   ZZ2AF+2
ZZ2AF$   EQU   ZZ2AF+2
@NM00024 EQU   ZZ2AF+2
ZZ2AFM   EQU   ZZ2AF+2
@NM00023 EQU   ZZ2AF+2
@NM00022 EQU   ZZ2AF+1
ZZ2AFV   EQU   ZZ2AF+1
@NM00021 EQU   ZZ2AF+1
ZZ2AFC   EQU   ZZ2AF+1
@NM00020 EQU   ZZ2AF
ZZ2AFFS  EQU   ZZ2AF
ZZ2AFT   EQU   ZZ2AF
ZZ2AFP   EQU   ZZ2AF
@NM00019 EQU   ZZ2A+8
ZZ2ALINE EQU   ZZ2A+4
@NM00018 EQU   ZZ2A+3
ZZ2ASE   EQU   ZZ2A+2
ZZ2ACH   EQU   ZZ2A
@NM00017 EQU   ZZ2+264
@NM00016 EQU   ZZ2+263
ZZ2PRTT0 EQU   ZZ2PRTT
ZZ2PRTO  EQU   ZZ2PRT+2
ZZ2PRTL  EQU   ZZ2PRT
@NM00015 EQU   ZZ2AMD+56
ZZ2AMDXP EQU   ZZ2AMD+52
ZZ2AMDD  EQU   ZZ2AMD+48
ZZ2AMDL  EQU   ZZ2AMD+44
ZZ2AMDU  EQU   ZZ2AMD+28
ZZ2AMDF  EQU   ZZ2AMD+24
ZZ2AMDS  EQU   ZZ2AMD+20
ZZ2AMDC  EQU   ZZ2AMD+16
ZZ2AMDP  EQU   ZZ2AMD+12
ZZ2AMDB  EQU   ZZ2AMD+8
@NM00014 EQU   @NM00013
ZZ2AMD2  EQU   @NM00013
ZZ2AMD1  EQU   @NM00013
ZZ2AMD0  EQU   ZZ2AMD+6
ZZ2AMDA  EQU   ZZ2AMD+4
ZZ2AMDT  EQU   ZZ2AMD
ZZ199999 EQU   ZZ1+3072
@NM00012 EQU   ZZ1+2160
ZZ1TRTAS EQU   ZZ1+1904
ZZ1TRUPC EQU   ZZ1+1648
ZZ1TRCTX EQU   ZZ1+1392
ZZ1NASID EQU   ZZ1N+274
ZZ1NSTRL EQU   ZZ1N+272
ZZ1NOFF  EQU   ZZ1N+268
ZZ1NBDY  EQU   ZZ1N+264
ZZ1NADE  EQU   ZZ1N+260
ZZ1NADB  EQU   ZZ1N+256
ZZ1NSTR  EQU   ZZ1N
@NM00011 EQU   ZZ1+1080
ZZ1TREBC EQU   ZZ1+824
ZZ1TRHEX EQU   ZZ1+568
@NM00010 EQU   ZZ1+377
ZZ1USTAE EQU   ZZ1+376
@NM00009 EQU   ZZ1F+1
@NM00008 EQU   ZZ1F
ZZ1FM    EQU   ZZ1F
ZZ1FX    EQU   ZZ1F
ZZ1FU    EQU   ZZ1F
ZZ1EVEC  EQU   ZZ1EVE+1
@NM00007 EQU   ZZ1EVE
ZZ1EVEP  EQU   ZZ1EVE
ZZ1EVEW  EQU   ZZ1EVE
ZZ1ACMP  EQU   ZZ1ATTN
@NM00006 EQU   ZZ1+144
ZZ1FPP   EQU   ZZ1+140
ZZ1ZZ6P  EQU   ZZ1+136
@NM00005 EQU   ZZ1+84
ZZ1PLINE EQU   ZZ1+80
ZZ1PGSZ  EQU   ZZ1+76
ZZ1PCNT  EQU   ZZ1+72
@NM00004 EQU   ZZ1+68
ZZ1TPAGE EQU   ZZ1+64
ZZ1TLINE EQU   ZZ1+60
@NM00003 EQU   ZZ1+48
ZZ1DSDP  EQU   ZZ1+44
ZZ1PDRP  EQU   ZZ1+40
ZZ1ZZ2P  EQU   ZZ1+36
ZZ1327WP EQU   ZZ1+32
@NM00002 EQU   ZZ1+24
ZZ1PDCBP EQU   ZZ1+20
ZZ1BLRBL EQU   ZZ1+16
@NM00001 EQU   ZZ1+12
ZZ1PNULL EQU   ZZ1+8
ZZ1NULL  EQU   ZZ1+4
ZZ1IDE   EQU   ZZ1
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS
@RT00212 EQU   EXITRLSA
@RT00226 EQU   EXITRLSA
@ENDDATA EQU   *
         END   BLSRDULS,(C'PLS1651',0701,78057)
