//ALLOC    JOB (U00000),SOFTWARE,CLASS=A,MSGCLASS=A
/*
/*          *** ALLOCATE PAN FILE FOR DAILY STORAGE ***
/*
//STEP1    EXEC  PGM=PAN#4
//STEPLIB  DD DSNAME=SYS1.PANLIB,DISP=SHR
//SYSPRINT DD  SYSOUT=*
//PANDD1   DD  DSN=PAN.SPOOL,DCB=(DSORG=DA,BLKSIZE=6356),
//         DISP=(,CATLG),SPACE=(CYL,100),UNIT=SYSDA
++CLEAR  RECORDS=3
/*
/*          *** ALLOCATE PAN FILE FOR DAILY RETRIEVALS ***
/*
//STEP1    EXEC  PGM=PAN#4
//STEPLIB  DD DSNAME=SYS1.PANLIB,DISP=SHR
//SYSPRINT DD  SYSOUT=*
//PANDD1   DD  DSN=PAN.TAPELIST,DCB=(DSORG=DA,BLKSIZE=6356),
//         DISP=(,CATLG),SPACE=(CYL,10),UNIT=SYSDA
++CLEAR  RECORDS=3
/*
/*          *** MONTLY FILE FOR CHARGE DATA STORAGE    ***
/*
//STEP1    EXEC  PGM=IEFBR14
//SYSPRINT DD  SYSOUT=*
//DD1      DD  DSN=PAN.ECGCOUNT,DCB=(RECFM=FB,LRECL=80,BLKSIZE=3120),
//         DISP=(,CATLG),SPACE=(CYL,5),UNIT=DISK
/*
/*          *** AT THIS POINT  CREATE 2 TAPE GENERATION
/*          *** DATA SETS:
/*
/*                  1.  PAN.SARCHIVE (3 GENS)
/*                  2.  PAN.SDIRECT  (3 GENS) (NOT USED AT BFG)
/*
/*
//INDXBLD1   EXEC PGM=IEHPROGM
//SYSPRINT   DD  SYSOUT=*
//DD1        DD  DSN=PAN.SARCHIVE,DISP=(,KEEP),UNIT=TAPE,
//           DCB=(LRECL=80,BLKSIZE=1600,RECFM=FB)
//SYSIN  DD *
  BLDG INDEX=PAN.SARCHIVE,ENTRIES=3
/*
//INDXBLD2   EXEC PGM=IEHPROGM
//SYSPRINT   DD  SYSOUT=*
//DD1        DD  DSN=PAN.SDIRECT,DISP=(,KEEP),
//           DCB=(LRECL=80,BLKSIZE=1600,RECFM=FB)
//SYSIN  DD *
  BLDG INDEX=PAN.SDIRECT,ENTRIES=3
