         MACRO
         ACT
*  THIS IS AN ABBREVIATED DSECT FOR THE ACCOUNT CONTROL TABLE,
*  WHICH WAS NECESSITATED BECAUSE OF INACCURACIES IN THE IBM DSECT.
ACT      DSECT
         DS    CL12
ACTNAME  DS    CL4                 'ACT'
ACTDSKAD DS    AL3                 DISK ADDRESS OF THIS ACT
ACTIDENT DS    CL1                 TABLE ID  ACT = 16
ACTNEXT  DS    CL4                 DISK ADDRESS OF NEXT ACT
ACTPRGNM DS    CL20                PROGRAMMERS NAME
ACTJTIME DS    CL3                 JOB RUNNING TIME
ACTJNFLD DS    XL1                 NBR OF JOB ACCOUNTING FIELDS
ACTFLDL  DS    XL1                 FIELD LENGTH
ACTFIELD DS    CL1                 VARIABLE LENGTH ACCOUNTING FIELD
         MEND
