         PRINT NOGEN
GENLOC1 PLIXSET
GENLOC PLIXDENT
*JOSH AUERBACH OCTOBER 18, 1977
         LM 2,4,0(1)
         L 2,0(2)  GET ADDRESS OF VAR STRING CONT. LEVEL
         LA 2,1(2) ARTIFICE TO CONVERT LEN HALFWD TO LEN BYTE
         ST 2,LEVADDR  STORE IN PARMLIST
         MVC WKADDR(4),0(3) DITTO FOR WORKAREA ADDRESS
         LA    1,PARMLIST
         SVC 26
         STH 15,0(4)
         PLIXEXT
PARMLIST DS 0F
         DC X'05001100'
LEVADDR  DC 2F'0'
WKADDR DC 4F'0'
         END
