         PRINT NOGEN
PLMAIN   XSAVE TR=NO,OPT=CSECT
* THIS IS AN ALTERNATE ENTRY POINT FOR A PGM WRITTEN IN PL/IX
*    THE USER CAN SPECIFY THE SIZE OF THE INITIAL STORAGE GETMAIN
*    BY THE FIXED BIN(31) EXT VARIABLE ISASIZE.
* FOR REFERENCE SEE PLIX PROGRAMMERS GUIDE CHAPTER 12 FIG 12.5
         EQUREGS
         ST    R1,PLIARGS
         WXTRN PLIOPTS             DCL PLIOPTS BIT EXT INITIAL( )
         L     R2,=V(PLIOPTS)      ALLOWS SETTING OF THE 'REPORT'
         MVC   OPTIONS(1),0(R2)    BIT FOR STORAGE INFO IN PLIDUMP
         LA    R1,PLIARGS
         CALL  PLICALLB
         XRETURN TR=NO,SA=*,T=*
PLIARGS  DC    A(0)               ADDRESS OF OS PARM FIELD
         DC    V(ISASIZE)          ADDR OF ISA AMOUNT
         DC    3A(0)               ADDR OF ISA+TASKING OPTIONS
         DC    X'80'
         DC    AL3(OPTIONS)        ADDRESS OF OPTIONS WORD
OPTIONS  DC    X'00000000'         REPORT/STAE/SPIE OPTIONS
         END   PLMAIN
         REPRO
 ENTRY PLMAIN
         END
