*        %GOTO PLSPRI;     /*
         MACRO
         TPRIOR
.*A000000-999999                                               @X31X8X0
.* C281000,286000,290000,294000,309000,686000,693000,699000,   @Y17XAXF
.* C704000,723000                                              @Y17XAXF
.* D094000,282000-284000,287000-288000,291000-292000,295000-   @Y17XAXF
.* D296000,310000,454000,687000-690000,694000-696000,700000-   @Y17XAXF
.* D701000,705000-707000,724000-725000                         @Y17XAXF
         SPACE
.*A825000-826000                                                 S22025
.*A696500-699000                                                 S22026
.*C884700                                                        S22026
.*C412000                                                       SA50190
.*C020000,892600                                               @Z30X8XE
.*C864000,982300-982600                                        @OS76497
*
*        TPRIOR DSECT UPDATED  6/7/74                          @Z30X8XE
.* TPRIOR DSECT CONVERTED TO BILINGUAL BY LEVEL 5 - 9/18/72      S22024
.*A887040-887160,990200-995200                                   Y05330
.*C601600-603000                                             @OX21052
*
*                       ERB
*
PRIINTRQ EQU   X'E4' .                  TO REQUEST FULL BUFFERS
*                                         FROM DISK I/O
*                                       TO REQUEST EMPTY BUFFERS
*                                         FROM BUFFER REQUEST QCB
*                                       USED BY SEND SCHEDULER
*                                       USED BY RECEIVE SCHEDULER
*                                       USED BY GET SCHEDULER
*                                       USED BY PUT SCHEDULER
*
PRIFSPCI EQU   X'E8' .                  TO REQUEST EMPTY BUFFERS
*                                         FROM BUFFER REQUEST QCB
*                                       TO REQUEST FULL BUFFERS
*                                         FROM DISK I/O
*                                       USED BY PCI APPENDAGE
*                                         (FIRST TIME)
*
PRITOTCL EQU   X'E8' .                  POST OF CLEANUP ELEM TO TOTE TO
*                                       INITIATE TEST CLEANUP  @Y17XAXF
*
PRISBPCI EQU   X'E0' .                  SAME AS ABOVE, EXCEPT ALL
*                                         BUT FIRST TIME
*
PRIDSKRQ EQU   X'EC' .                  TO REQUEST AN EMPTY UNIT BY
*                                         CHAINING THE ERB ON THE
*                                         BUFFER RETURN QCB
*                                       USED BY CPB CLEANUP
*
PRISBT   EQU   X'EC' .                  PRIORITY FOR ELEMENT POSTED
*                                       TO IEDQSBT             @YM07020
PRIACTIV EQU   X'E4' .                  IN POSTING ERB TO ACTIVATE
*                                         QCB TO REQUEST BUILDING
*                                         OF AN INITIAL CONTACT PGM
*                                         AND EXCP FOR LINE
*                                       USED BY CPB CLEANUP
*                                       USED BY BUFFER REQUEST
*                                       USED BY BUFFER RETURN
*
PRIDKEOB EQU   X'E0' .                  TO ENABLE EOB TO RECALL
*                                       TO POST TO EOBCHECK AFTER
*                                         EOB ERROR
*                                       USED BY CPB CLEANUP
*                                       USED BY CPB INITIALIZATION
*                                       MUST BE LOWER PRIORITY THAN
*                                         PRIMHBFR
*
PRIRECAL EQU   X'E0' .                  TO REQUEST FROM DISK I/O A
*                                         COPY OF HEADER
*                                       USED BY ALL ROUTINES
*                                         REQUESTING RECALLED
*                                         HEADERS
*
PRIRCQCB EQU   X'E0' .                  TO RETURN THE ERB TO ANY
*                                         ROUTINE SPECIFIED IN
*                                         LCBRCQCB
*                                       USED BY MH TO RETURN TO
*                                         BUFFER DISPOSITION
*                                       USED BY CPB CLEANUP AFTER
*                                         RECALL
*
PRIAPERB EQU   X'D0' .                  TO REQUEST FULL BUFFERS
*                                         USED BY APPLICATION PROG
*
*                       BUFFER
*
PRIEDISP EQU   X'E0' .                  TO POST ERB TO ITSELF ON SEND
*                                         OPERATIONS WHEN AN ERROR
*                                         OCCURS BEFORE EOM
*                                       USED BY DISPOSITION
*                                         MUST BE LOWER THAN PRIMHBFR
*
PRIMHBFR EQU   X'E4' .                  TO HAVE A BUFFER PROCESSED
*                                         BY MH
*                                       USED BY PCI APPENDAGE
*                                       USED BY CPB CLEANUP
*                                       USED BY LINE END APPENDAGE
*                                         AFTER POSITIVE RESPONSE
*                                         TO ADDRESSING
*
PRIERBFR EQU   X'E3'                    TO HAVE AN ERROR BUFFER  X03039
*                                         PROCESSED BY MH        X03039
*                                                                X03039
PRIUREQ  EQU   X'E8' .                  TO REQUEST AN EMPTY
*                                         UNIT FOR INSERT
*                                         FUNCTION IN MH
*                                       USED BY UNIT REQUEST
*                                       MUST BE HIGHER THAN PRIMHBFR
*
PRIAPBFR EQU   X'DC' .                  TO POST A BUFFER TO AN
*                                         APPLICATION PROGRAM
*                                       USED BY MBH
*
PRILNEND EQU   X'E4' .                  TO HAVE DISPOSITION FINISH
*                                         PROCESSING MACROS AND
*                                         CLEANUP THE LINE
*                                       USED BY LINE END APPENDAGE
*                                         (SEND-LAST BUFFER ONLY)
*
PRIRCBFR EQU   X'E0' .                  TO RETURN A DUPLICATE HEADER
*                                         TO A SPECIFIED ROUTINE
*                                       USED BY CPB CLEANUP
*                                       USED BY DESTINATION SCHEDULER
*
PRIBFRTB EQU   X'E0' .                  TO RETURN A BUFFER OR UNIT
*                                                               SA50190
*                                         TO AVAILABLE BUFFER POOL
*                                       USED BY PCI APPENDAGE
*                                       USED BY CPB CLEANUP
*                                       USED BY CPB INITIALIZATION
*                                       USED BY DESTINATION SCHEDULER
*                                       USED BY MH
*
PRIDSKBF EQU   X'EC' .                  TO GIVE A UNIT TO CPB CLEANUP
*                                       USED BY BUFFER RETURN
*
PRICOPY  EQU   X'E0' .                  TO HAVE A MESSAGE COPIED TO
*                                         A DIFFERENT DATA SET
*                                       USED BY DESTINATION SCHEDULER
*
PRIDESTQ EQU   X'E4' .                  TO PUT A BUFFER ON A MESSAGE
*                                         QUEUE
*                                       USED BY MH
*                                       USED BY DESTINATION SCHEDULER
*
PRIDKWRT EQU   X'E4' .                  TO HAVE A FULL BUFFER WRITTEN
*                                         ON DISK
*                                       USED BY DESTINATION SCHEDULER
*
PRIDKSRV EQU   X'EC' .                  TO HAVE A MESSAGE FLAGGED
*                                         SERVICED
*                                       USED BY BUFFER CLEANUP
*
PRIDKCNC EQU   X'E0' .                  TO HAVE A MESSAGE CANCELED
*                                         IN THE MESSAGE QUEUE
*                                       USED BY CANCEL MESSAGE
*
PRIDKINT EQU   X'E0' .                  TO HAVE A MESSAGE INTERCEPTED
*                                       USED BY INTERCEPT
*
PRICKPLN EQU   X'EC' .                  TO POST THE LCB TO CHECKPOINT
*                                         REQUESTING A CHECKPOINT
*                                       USED BY BUFFER DISPOSITION
*
PRIMULTR EQU   X'E0' .                  TO POST THE LCB TO THE
*                                         MULTIPLE ROUTE ROUTINE
*                                         TO CONTINUE
*                                       USED BY BUFFER DISPOSITION
*                                       USED BY TLIST SUBTASK
*
PRIOPCTL EQU   X'DC' .                  TO POST AN OPERATOR CONTROL
*                                         BUFFER
*                                       USED BY MH
*                                       USED TO POST FROM OPCTL@Y17XAXF
*                                        TO NSL                @Y17XAXF
*
PRIDSPLB EQU   X'DF' .                  TO POST LAST BUFFER OF
*                                         MESSAGE TO DISPOSITION
*                                       USED BY MH
*                                       USED BY OPNDST/CLSDST    X03039
*                                       MUST BE LOWER THAN ANY PCI
*                                         POST OF AN ERB
*
PRIONLT  EQU   X'DC' .                  TO REQUEST ON LINE TEST
*                                       USED BY MH
*
PRIPIUCP  EQU  X'00' .                  PACKED RU TO IEDPMD USED FOR
*                                       IDENTIFICATION PURPOSES ONLY -
*                                       WILL NEVER BE POSTED
*                                                              @Y17XAXF
PRILUSR   EQU  X'DA' .                  DEACTIVATE TO LUS TO TERMINATE
*                                       A SESSION              @Y17XAXF
PRIAIPL   EQU  X'DE' .                  TO INDICATE TO IPL/DUMP@Y17XAXF
*                                       THAT AN LCB HAS BEEN   @Y17XAXF
*                                       POSTED TO REQUEST IPL  @Y17XAXF
*                                       AND OR ACTIVATE        @Y17XAXF
*                                                              @Y17XAXF
PRIFIDIN EQU  X'E4' .                   FID POST PRIORITY FROM @Y17XAXF
*                                       PATH CONTROL INBOUND   @Y17XAXF
*                                                              @Y17XAXF
PRISCPIN EQU  PRIFIDIN+1 .              SSCP INPUT-MUST BE     @Y17XAXF
*                                       HIGHER THAN FID POST   @Y17XAXF
*                                       PRIORITY               @Y17XAXF
*                                                              @Y17XAXF
PRIFLDH  EQU  PRIMHBFR                  BTU PRIORITY TO FLDH   @Y17XAXF
*                                       QCB                    @Y17XAXF
*                                                              @Y17XAXF
PRICHKPT EQU   X'EC' .                  PRIORITY USED BY       @Y17XAXF
*                                         CHECKPOINT TO POST   @Y17XAXF
*                                         AVTCCELE             @Y17XAXF
*                                                              @Y17XAXF
PRIHIFLG EQU   X'E9' .                  HIGHEST PRIORITY THAT  @Y17XAXF
*                                         HAS ASSOCIATED FLAG  @Y17XAXF
*                                         BYTE                 @Y17XAXF
*                                                              @Y17XAXF
PRIPLCB  EQU   X'E8' .                  PLCB/LC/ POST TO VE,   @Y17XAXF
*                                         Z1,V1                @Y17XAXF
*                                                              @Y17XAXF
PRIFRCDC EQU   X'C4' .                  FORCE DEACTIVATE REQUEST OPCE
*                                        IN 3705 CLEANUP       @Y17XAXF
*                                                              @Y17XAXF
PRISSBUF EQU   X'E2' .                  PRIORITY THAT BUFFERS  @PI03742
*                                         TPOSTED TO SSCP      @Y17XAXF
*                                                              @Y17XAXF
PRISIBRQ EQU   X'E5' .                  GET AND FREE SIB       @Y17XAXF
*                                         REQUEST ELEMENTS     @Y17XAXF
*                                                              @Y17XAXF
PRISSPIU EQU   X'E5' .                  PRIORITY THAT PIU'S    @Y17XAXF
*                                         ARE TPOSTED TO SSCP  @Y17XAXF
*                                                              @Y17XAXF
PRIMH01  EQU   X'E4' .                  PRIORITY POST FROM MH  @Y17XAXF
*                                         TO 01                @Y17XAXF
*                                                              @Y17XAXF
PRILNSCL EQU   PRIDESTQ-1 .             USED BY IEDUNBND TO POST PLCB
*                                       TO IEDSCLU TO CONTINUE CLEAR
*                                       UNBIND PROCESSING      @Y17XAXF
*
PRIRESPB EQU   X'EA'                    RESPONSE BUFFER TO 02  @OX21052
*                                                              @OX21052
PRIOLD1  EQU   X'E0' .                  OLD PRIORITY POST TO VA@Y17XAXF
*                                                              @Y17XAXF
PRIMEDFG EQU   X'DF' .                  MEDIUM PRIOITY THAT    @Y17XAXF
*                                         ASSOCIATED FLAG BYTE @Y17XAXF
*                                                              @Y17XAXF
PRITOTE0 EQU   X'DC' .                  OLD PRIOITY POST FROM  @Y17XAXF
*                                         TOTE TO 00           @Y17XAXF
*                                                              @Y17XAXF
PRIPCOUT EQU   X'E4' .                  TO POST TO PATH CONTROL@Y17XAXF
*                                         OUTBOUND             @Y17XAXF
*                                                              @Y17XAXF
PRIASYNC EQU   X'E6' .                  TO POST AN ASYNCHROUS  @Y17XAXF
*                                         REQUEST BUFFER TO    @Y17XAXF
*                                         IEDNKA               @Y17XAXF
*                                       PRE-SNA - FOR RESET    @Y17XAXF
*                                         ERROR LOCK           @Y17XAXF
*                                       SNA - FOR NEGATIVE     @Y17XAXF
*                                         RESPONSE TO RTR      @Y17XAXF
*                                                              @Y17XAXF
PRIOUTQ  EQU   X'E0' .                  TO TPOST PIUS TO THE   @Y17XAXF
*                                         3705 OUTPUT CORE     @Y17XAXF
*                                         QUEUE                @Y17XAXF
*                                                              @Y17XAXF
PRIOUTBD EQU   X'E4' .                  NORMAL POST TO         @Y17XAXF
*                                         OUTBOUND PROCESSING  @Y17XAXF
*                                                              @Y17XAXF
PRILUSQB EQU   X'E2' .                  TPOST A QCB TO LUS TO  @Y17XAXF
*                                         REQUEST AN LU-LU     @Y17XAXF
*                                         SESSION              @Y17XAXF
*                                                              @Y17XAXF
PRILOFLG EQU   X'D0' .                  PRIORITY POST OF A/D   @Y17XAXF
*                                         REDRIVE ELEMENT      @Y17XAXF
*                                                              @Y17XAXF
PRIPRIME EQU   X'DD' .                  POST TO NSL FOR        @Y17XAXF
*                                         PRIMING              @Y17XAXF
*                                                              @Y17XAXF
PRICULCB EQU   X'C0'                    CLEANUP SYN AND ROUTING .
*                                                              @Y17XAXF
PRICUREQ EQU   X'C4'                    CLEANUP REQUEST        @Y17XAXF
*                                         ELEMENT              @Y17XAXF
*                                                              @Y17XAXF
PRILAEND EQU   X'E4' .                  TO START ERROR PROCESSING
*                                       USED BY LINE END APPENDAGE
*
PRIMHUNT EQU   X'E8' .                  TO POST A UNIT TO MH
*                                       USED BY IEDQBW
*                                       MUST BE GREATER THAN PRIMHBFR
*
PRIRELSE EQU   X'E0' .                  TO RELEASE SUBTASK FROM
*                                         TIME DELAY OR OP. CONTROL
*                                       USED BY HOLD
*                                       USED BY OPERATOR CONTROL
*
PRIFEFO  EQU   X'EE' .                  TO UPDATE DISK FEFO POINTER
*                                       CHECKED BY IEDQFA
*                                       SET BY IGG019RP, REUS/COPY
*
*
*                       OTHER
*
PRIRLCB  EQU   X'EB' .                  USED BY IEDQBD TO        S22026
*                                         RETURN LCB             S22026
*                                                                S22026
PRILCB   EQU   X'E7' .                  TO POST LCB FOR CLEANUP  S22026
*                                         USED BY LINEEND        S22026
*                                                                S22026
PRICPBCL EQU   X'E8' .                  TO POST CPB CLEANUP COMPLETE
*                                       USED BY DISK END APPENDAGE
*
PRICKPT  EQU   X'EC' .                  TO REQUEST COMPLETE CHECKPOINT
*                                       USED BY REUS
*                                       USED BY MCPCLOSE
*                                       USED BY TIME DELAY
*
PRILNFRE EQU   X'E0' .                  TO FREE A LINE
*                                       USED BY DISPOSITION
*                                       USED BY SEND SCHEDULER
*                                       USED BY PUT SCHEDULER(UNLOCK)
*                                       MUST GET TO DESTINATION
*                                         SCHEDULER BEFORE LINE
*                                         IS FREE
*
PRILCBRQ EQU   PRIINTRQ                 UNUSED                 @Y17XAXF
*                                                                X03039
PRIOPDST EQU   PRILCBRQ                 UNUSED                 @Y17XAXF
*                                                                X03039
PRIOPCMP EQU   X'E5'                    UNUSED                 @Y17XAXF
*
PRICLDST EQU   PRILCBRQ                 UNUSED                 @Y17XAXF
*                                                                X03039
PRIRESUM EQU   X'E5'                    TO POST RESPONSE BUFFER@Y17XAXF
*                                         FROM DEBLOCK BACK TO @Y17XAXF
*                                         NIR GENERATOR MODULES@Y17XAXF
*                                         TO REQUEST RESUMPTION@Y17XAXF
*                                         OF AN OPERATION BEGUN@Y17XAXF
*                                         BY NIR GENERATOR     @Y17XAXF
*                                         MODULES
*                                                                X03039
PRISTOPD EQU   X'E8' .                  USED TO RETURN AN        X03039
*                                       ELEMENT TO NSL           X03039
*
PRIATTNH EQU   X'E6' .                  UNUSED                 @Y17XAXF
*
PRICLSDN EQU   X'10' .                  TO REQUEST CLOSEDOWN
*                                       USED BY -----
*                                       MUST BE LOWEST PRIORITY
*
PRIAPCKP EQU   X'EC' .                  TO REQUEST INCIDENT CHECKPOINT
*                                       USED BY APPLICATION PROGRAM
*
PRIOPCKP EQU   X'EC' .                  TO REQUEST INCIDENT CHECKPOINT
*                                       USED BY OPERATOR CONTROL
*
PRILNCL  EQU   X'EC' .                  TO CLEAN UP BUFFERS AND TO
*                                         FREE LINE
*                                       USED BY LINE END
*                                       TO POST LINE TO DISPOSITION
*                                       USED BY IN END
*                                       USED BY OUT END
*
PRILCBAT EQU   X'E9' .                  TO POST LCB TO STOPLINE  S22025
*                                       SUBTASK USED BY LINE END S22025
*
PRILOGLB EQU   X'E0' .                  TO POST THE LOG LCB TO ITSELF
*                                       USED BY LOG SCHEDULER
*
PRISSOLT EQU   X'DC' .                  POSTED TO OPERATOR CONTROL
*                                       TO REQUEST START LINE/STOPLINE
*                                       USED BY ON LINE TEST
*
PRITRACE EQU   X'F0' .                  DSPTRACE PRIORITY IGCM610D
*                                        POSTS UNIT TO ALTER IGG019RO
*                                        TO START OR STOP TRACE(S)
*                                        AFTER MODIFY TCAM, SUBT=
*                                        COMAND                @Y17XAXF
*
PRITIME  EQU   X'F0' .                  TO RETURN ELE FROM TIME Q
*                                       USED BY TIME DELAY
*
PRIREUSX EQU   X'EE' .                  TO ACTIVATE REUSABILITY@OS76497
*                                       ASSEM IN PLACE BY IGG019RP
*
PRIATTN  EQU   X'DC' .                  POST ATTENTION ELEMENT
*                                         USED BY ATTENTION HANDLER
*
PRIATN05 EQU PRIATTN+1                  3705 ATTENTION ELEMENT PRIORITY
*                                                              @YM08074
*
PRISYSDL EQU   X'DC' .                  TO INITIATE SYSTEM DELAY
*                                         USED BY OPERATOR CONTROL
*                                         CHECKED BY SYS DELAY
*
PRISYSDT EQU   X'D8' .                  POST SYSTEM DELAY QCB TO TIME
*                                         DELAY
*                                         USED BY SYSTEM DELAY
*
PRILCBDL EQU   X'20' .                  TO INDICATE AN LCB ON
*                                         SYSTEM DELAY QUEUE
*                                         SET BY SYSTEM DELAY, IEDQHI
*                                         CHECKED BY CHECKPOINT
*
PRIPOSTS EQU   X'FE'                    POST TO  SYNC QUEUE    @Y17XAXA
*
PRIPOSTA EQU   X'FF'                    POST TO ASYNC QUEUE    @Y17XAXA
         SPACE 2
         MEND  ,  */
*  %PLSPRI:  ;
*/*      TPRIOR DSECT UPDATED  6/7/74                         Y30X8XE*/
*/*                                                                  */
*/*                          ERB                                     */
*DCL PRIINTRQ BIT(8) CONSTANT('E4'X);   /* TO REQUEST FULL BUFFERS   */
*                                       /* FROM DISK I/O             */
*                                       /* TO REQUEST EMPTY BUFFERS  */
*                                       /* FROM BUFFER REQUEST QCB   */
*                                       /* USED BY SEND SCHEDULER    */
*                                       /* USED BY RECEIVE SCHEDULER */
*                                       /* USED BY GET SCHEDULER     */
*                                       /* USED BY PUT SCHEDULER     */
*/*                                                                  */
*DCL PRIFSPCI BIT(8) CONSTANT('E8'X);   /* TO REQUEST EMPTY BUFFERS  */
*                                       /* FROM BUFFER REQUEST QCB   */
*                                       /* TO REQUEST FULL BUFFERS   */
*                                       /* FROM DISK I/O             */
*                                       /* USED BY PCI APPENDAGE     */
*                                       /* FOR FIRST REQUEST         */
*/*                                                                  */
*DCL PRITOTCL BIT(8) CONSTANT('E8'X);   /* POST OF CLEANUP ELEM TO   */
*                                       /* TOTE (TEST C-UP) @Y17XAXF */
*/*                                                                  */
*DCL PRISBPCI BIT(8) CONSTANT('E0'X);   /* SAME AS ABOVE EXCEPT ALL  */
*                                       /* BUT FIRST TIME            */
*/*                                                                  */
*DCL PRIDSKRQ BIT(8) CONSTANT('EC'X);   /* TO REQUEST AN EMPTY UNIT  */
*                                       /* BY CHAINING THE ERB ON THE*/
*                                       /* BUFFER RETURN QCB         */
*                                       /* USED BY CPB CLEANUP       */
*/*                                                                  */
*DCL PRISBT   BIT(8) CONSTANT('EC'X);   /* PRIORITY FOR ELEMENT POST */
*                                       /* TO IEDQSBT        @YM07020*/
*/*                                                                  */
*DCL PRIACTIV BIT(8) CONSTANT('E4'X);   /* IN POSTING ERB TO ACTIVATE*/
*                                       /* QCB TO REQUEST BUILDING   */
*                                       /* OF AN INITIAL CONTACT PGM */
*                                       /* AND EXCP FOR LINE         */
*                                       /* USED BY CPB CLEANUP       */
*                                       /* USED BY BUFFER REQUEST    */
*                                       /* USED BY BUFFER RETURN     */
*/*                                                                  */
*DCL PRIDKEOB BIT(8) CONSTANT('E0'X);   /* TO ENABLE EOB TO RECALL   */
*                                       /* TO POST TO EOB CHECK AFTER*/
*                                       /* EOB ERROR                 */
*                                       /* USED BY CPB CLEANUP       */
*                                       /* USED BY CPB INITIALIZATION*/
*                                       /* MUST BE LOWER PRIORITY    */
*                                       /* THAN PRIMHBFR             */
*/*                                                                  */
*DCL PRIRECAL BIT(8) CONSTANT('E0'X);   /* TO REQUEST FROM DISK I/O  */
*                                       /* A COPY OF HEADER USED BY  */
*                                       /* ALL ROUTINES REQUESTING   */
*                                       /* RECALLED HEADERS          */
*/*                                                                  */
*DCL PRIRCQCB BIT(8) CONSTANT('E0'X);   /* TO RETURN THE ERB TO ANY  */
*                                       /* ROUTINE SPECIFIED IN      */
*                                       /* LCBRCQCB                  */
*                                       /* USED BY MH TO RETURN TO   */
*                                       /* BUFFER DISPOSITION        */
*                                       /* USED BY CPB CLEANUP AFTER */
*                                       /* RECALL                    */
*/*                                                                  */
*DCL PRIAPERB BIT(8) CONSTANT('D0'X);   /* TO REQUEST FULL BUFFERS   */
*                                       /* USED BY APPLICATION PROG  */
*/*                                                                  */
*/*                          BUFFER                                  */
*DCL PRIEDISP BIT(8) CONSTANT('E0'X);   /* TO POST ERB TO ITSELF ON  */
*                                       /* SEND OPERATIONS WHEN AN   */
*                                       /* ERROR OCCURS BEFORE EOM   */
*                                       /* USED BY DISPOSITION       */
*                                       /* MUST BE LOWER THAN        */
*                                       /* PRIMHBFR                  */
*/*                                                                  */
*DCL PRIMHBFR BIT(8) CONSTANT('E4'X);   /* TO HAVE A BUFFER PROCESSED*/
*                                       /* BY MH                     */
*                                       /* USED BY PCI APPENDAGE     */
*                                       /* USED BY CPB CLEANUP       */
*                                       /* USED BY LINE END APPENDAGE*/
*                                       /* AFTER POSITIVE RESPONSE TO*/
*                                       /* ADDRESSING                */
*                                       /* USED BY DEBLOCK AFTER     */
*                                       /* DATA RECEIVED             */
*/*                                                                  */
*DCL PRIERBFR BIT(8) CONSTANT('E3'X);   /* TO HAVE AN ERROR BFRX03039*/
*                                       /* PROCESSED BY MH     X03039*/
*/*                                                            X03039*/
*DCL PRIUREQ BIT(8) CONSTANT('E8'X);    /* TO REQUEST AN EMPTY UNIT  */
*                                       /* FOR INSERT FUNCTION IN MH */
*                                       /* USED BY UNIT REQUEST      */
*                                       /* MUST BE HIGHER THAN       */
*                                       /* PRIMHBFR                  */
*/*                                                                  */
*DCL PRIAPBFR BIT(8) CONSTANT('DC'X);   /* TO POST A BUFFER TO AN    */
*                                       /* APPLICATION PROGRAM       */
*                                       /* USED BY MBH               */
*/*                                                                  */
*DCL PRILNEND BIT(8) CONSTANT('E4'X);   /* TO HAVE DISPOSITION       */
*                                       /* FINISH PROCESSING MACROS  */
*                                       /* AND CLEANUP THE LINE      */
*                                       /* USED BY LINE END          */
*                                       /* APPENDAGE                 */
*                                       /* LAST BUFFER ONLY          */
*/*                                                                  */
*DCL PRIRCBFR BIT(8) CONSTANT('E0'X);   /* TO RETURN DUPLICATE       */
*                                       /* HEADER TO A SPECIFIED     */
*                                       /* ROUTINE                   */
*                                       /* USED BY CPB CLEANUP       */
*                                       /* USED BY DESTINATION       */
*                                       /* SCHEDULER                 */
*/*                                                                  */
*DCL PRIBFRTB BIT(8) CONSTANT('E0'X);   /* TO RETURN A BUFFER OR A   */
*                                       /* UNIT TO BUFFER POOL       */
*                                       /* USED BY PCI APPENDAGE     */
*                                       /* USED BY CPB CLEANUP       */
*                                       /* USED BY CPB INITIALIZATION*/
*                                       /* USED BY DESTINATION SCH   */
*                                       /* USED BY MH                */
*/*                                                                  */
*DCL PRIDSKBF BIT(8) CONSTANT('EC'X);   /* TO GIVE A UNIT TO CPB     */
*                                       /* CLEANUP                   */
*                                       /* USED BY BUFFER RETURN     */
*/*                                                                  */
*DCL PRICOPY BIT(8) CONSTANT('E0'X);    /* TO HAVE A MESSAGE COPIED  */
*                                       /* TO A DIFFERENT DATA SET   */
*                                       /* USED BY DESTINATION SCH   */
*DCL PRIDESTQ BIT(8) CONSTANT('E4'X);   /* TO PUT A BUFFER ON A      */
*                                       /* MESSAGE QUEUE             */
*                                       /* USED BY MH                */
*                                       /* USED BY DESTINATION SCHED */
*/*                                                                  */
*DCL PRIDKWRT BIT(8) CONSTANT('E4'X);   /* TO HAVE A FULL BUFFER     */
*                                       /* WRITTEN ON DISK           */
*                                       /* USED BY DESTINATION SCH   */
*/*                                                                  */
*DCL PRIDKSRV BIT(8) CONSTANT('EC'X);   /* TO HAVE A MESSAGE FLAGGED */
*                                       /* SERVICED                  */
*                                       /* USED BY BUFFER CLEANUP    */
*/*                                                                  */
*DCL PRIDKCNC BIT(8) CONSTANT('E0'X);   /* TO HAVE A MESSAGE CANCELED*/
*                                       /* IN THE MESSAGE QUEUE      */
*                                       /* USED BY CANCEL MESSAGE    */
*/*                                                                  */
*DCL PRIDKINT BIT(8) CONSTANT('E0'X);   /* TO HAVE A MESSAGE INTER-  */
*                                       /* CEPTED-USED BY INTERCEPT  */
*/*                                                                  */
*DCL PRICKPLN BIT(8) CONSTANT('EC'X);   /* TO POST THE LCB TO        */
*                                       /* CHECKPOINT REQUESTING A   */
*                                       /* CHECKPOINT                */
*                                       /* USED BY BUFFER DISPOSITION*/
*/*                                                                  */
*DCL PRIMULTR BIT(8) CONSTANT('E0'X);   /* TO POST THE LCB TO THE    */
*                                       /* MULTIPLE ROUTE ROUTINE    */
*                                       /* TO CONTINUE               */
*                                       /* USED BY BUFFER DISPOSITION*/
*                                       /* USED BY TLIST SUBTASK     */
*/*                                                                  */
*DCL PRIOPCTL BIT(8) CONSTANT('DC'X);   /* TO POST AN OPERATOR       */
*                                       /* CONTROL BUFFER            */
*                                       /* USED BY MH                */
*                                       /* USED TO POST FROM @Y17XAXF*/
*                                       /*  OPCTL TO NSL     @Y17XAXF*/
*/*                                                                  */
*DCL PRIDSPLB BIT(8) CONSTANT('DF'X);   /* TO POST LAST BUFFER OF    */
*                                       /* MESSAGE TO DISPOSITION    */
*                                       /* USED BY MH                */
*                                       /* USED BY OPN/CLSDST  X03039*/
*                                       /* MUST BE LOWER THAN ANY PCI*/
*                                       /* POST OF AN ERB            */
*/*                                                                  */
*DCL PRIPIUCP BIT(8) CONSTANT('00'X);   /* PACKED RU TO IEDPMD USED FOR
*                                          IDENT PUTPOSES ONLY - WILL
*                                          NEVER BE POSTED   @Y17XAXF*/
*DCL PRILUSR BIT(8) CONSTANT('DA'X);    /* DEACTIVATE TO LUS REQUEST
*                                          FOR TERMINATION OF SESSION
*                                                            @Y17XAXF*/
*DCL PRIONLT BIT(8) CONSTANT('DC'X);    /* TO REQUEST ON LINE TEST   */
*                                       /* USED BY MH                */
*/*                                                                  */
* DCL PRIAIPL  BIT(8) CONSTANT('DE'X);  /* TO INDICAT TO IPL @Y17XAXF*/
*                                       /* /DUMP THAT AN LCB @Y17XAXF*/
*                                       /* HAS BEEN POSTED TO@Y17XAXF*/
*                                       /* REQUEST IPL AND/OR@Y17XAXF*/
*                                       /* ACTIVATE          @Y17XAXF*/
*
* DCL PRIFIDIN BIT(8) CONSTANT('E4'X);  /* FID POST PRIORITY @Y17XAXF*/
*                                       /* FROM PATH CONTROL @Y17XAXF*/
*                                       /* INBOUND           @Y17XAXF*/
*
* DCL PRISCPIN BIT(8) CONSTANT('E5'X);  /* SSCP INPUT-MUST BE@Y17XAXF*/
*                                       /* HIGHER THAN FID   @Y17XAXF*/
*                                       /* POST PRIORITY     @Y17XAXF*/
*
* DCL PRIFLDH  BIT(8) CONSTANT('E4'X);  /* BTU PRIORITY TO   @Y17XAXF*/
*                                       /* FLDH QCB          @Y17XAXF*/
*
* DCL PRICHKPT BIT(8) CONSTANT('EC'X);  /* PRIORITY USED BY  @Y17XAXF*/
*                                       /*  CKECKPOINT TO    @Y17XAXF*/
*                                       /*  POST AVTCCELE    @Y17XAXF*/
*                                       /*                   @Y17XAXF*/
* DCL PRIHIFLG BIT(8) CONSTANT('E9'X);  /* HIGHEST PRIORITY  @Y17XAXF*/
*                                       /*  THAT HAS         @Y17XAXF*/
*                                       /*  ASSOCIATED FLAG  @Y17XAXF*/
*                                       /*  BYTE             @Y17XAXF*/
*                                       /*                   @Y17XAXF*/
* DCL PRIPLCB  BIT(8) CONSTANT('E8'X);  /* PLCB/LCB POST TO  @Y17XAXF*/
*                                       /*  VE,Z1,V1         @Y17XAXF*/
*                                       /*                   @Y17XAXF*/
* DCL PRIFRCDC BIT(8) CONSTANT('C4'X);  /* FORCE DEACTIVATE REQUEST
*                                           OPCE IN 3705 CLEANUP
*                                                            @Y17XAXF*/
* DCL PRISSBUF BIT(8) CONSTANT('E2'X);  /* PRIORITY THAT     @PI03742*/
*                                       /*  BUFFERS ARE      @Y17XAXF*/
*                                       /*  TPOSTED TO SSCP  @Y17XAXF*/
*                                       /*                   @Y17XAXF*/
* DCL PRISIBRQ BIT(8) CONSTANT('E5'X);  /* GET AND FREE SIB  @Y17XAXF*/
*                                       /*  REQUEST ELEMENTS @Y17XAXF*/
*                                       /*                   @Y17XAXF*/
* DCL PRISSPIU BIT(8) CONSTANT('E5'X);  /* PRIORITY THAT     @Y17XAXF*/
*                                       /*  PIU'S ARE TPOSTED@Y17XAXF*/
*                                       /*  TO SSCP          @Y17XAXF*/
*                                       /*                   @Y17XAXF*/
* DCL PRIMH01  BIT(8) CONSTANT('E4'X);  /* PRIORITY POST FROM@Y17XAXF*/
*                                       /*  MH TO 01         @Y17XAXF*/
*                                       /*                   @Y17XAXF*/
* DCL PRILNSCL BIT(8) CONSTANT('E3'X);  /* USED BY IEDUNBND TO POST
*                                          PLCB TO IEDSCLU TO CONTINUE
*                                          CLEAR UNBIND PROCESSING -
*                                          MUST BE LOWER THAN PRIDESTQ
*                                                            @Y17XAXF*/
*
* DCL PRIRESPB BIT(8) CONSTANT('EA'X);  /* RESPONSE BUFFER   @OX21052*/
*                                       /*  TO 02            @OX21052*/
*                                       /*                   @OX21052*/
* DCL PRIOLD1  BIT(8) CONSTANT('E0'X);  /* OLD PRIORITY POST @Y17XAXF*/
*                                       /*  TO VA            @Y17XAXF*/
*                                       /*                   @Y17XAXF*/
* DCL PRIMEDFG BIT(8) CONSTANT('DF'X);  /* MEDIUM PRIORITY   @Y17XAXF*/
*                                       /*  THAT HAS         @Y17XAXF*/
*                                       /*  ASSOCIATED FLAG  @Y17XAXF*/
*                                       /*  BYTE             @Y17XAXF*/
*                                       /*                   @Y17XAXF*/
* DCL PRITOTE0 BIT(8) CONSTANT('DC'X);  /* OLD PRIORITY POST @Y17XAXF*/
*                                       /*  FROM TOTE TO 00  @Y17XAXF*/
*                                       /*                   @Y17XAXF*/
* DCL PRIPCOUT BIT(8) CONSTANT('E4'X);  /* POST TO PATH CTL  @Y17XAXF*/
*                                       /*  OUTBOUND         @Y17XAXF*/
*                                       /*                   @Y17XAXF*/
* DCL PRIASYNC BIT(8) CONSTANT('E6'X);  /* TO POST AN ASYNCH @Y17XAXF*/
*                                       /*  REQUEST BUFFER   @Y17XAXF*/
*                                       /*  TO IEDNKA        @Y17XAXF*/
*                                       /* PRE-SNA - FOR     @Y17XAXF*/
*                                       /*  RESET ERROR LOCK @Y17XAXF*/
*                                       /* SNA - FOR NEGATVE @Y17XAXF*/
*                                       /*  RESPONSE TO RTR  @Y17XAXF*/
*                                       /*                   @Y17XAXF*/
* DCL PRIOUTQ  BIT(8) CONSTANT('E0'X);  /* TO TPOST PIUS TO  @Y17XAXF*/
*                                       /*  THE 3705 OUTPUT  @Y17XAXF*/
*                                       /*  QUEUE            @Y17XAXF*/
*                                       /*                   @Y17XAXF*/
* DCL PRIOUTBD BIT(8) CONSTANT('E4'X);  /* NORMAL POST TO    @Y17XAXF*/
*                                       /*  OUTBOUND PRO-    @Y17XAXF*/
*                                       /*  CESSING          @Y17XAXF*/
*                                       /*                   @Y17XAXF*/
* DCL PRILUSQB BIT(8) CONSTANT('E2'X);  /* TPOST A QCB TO    @Y17XAXF*/
*                                       /*  LUS TO REQUEST   @Y17XAXF*/
*                                       /*  AN LU-LU SESSION @Y17XAXF*/
*                                       /*                   @Y17XAXF*/
*DCL PRILOFLG BIT(8) CONSTANT('D0'X);   /* PRIORITY POST OF  @Y17XAXF*/
*                                       /*  A/D REDRIVE      @Y17XAXF*/
*                                       /*  ELEMENT          @Y17XAXF*/
*                                       /*                   @Y17XAXF*/
*DCL PRICULCB BIT(8) CONSTANT('C0'X);   /* CLEANUP SYNC AND ROUTING
*                                                            @Y17XAXF*/
*DCL PRICUREQ BIT(8) CONSTANT('C4'X);   /* CLEANUP REQUEST   @Y17XAXF*/
*                                       /*  ELEMENT          @Y17XAXF*/
*                                       /*                   @Y17XAXF*/
*DCL PRIPRIME BIT(8) CONSTANT('DD'X);   /* POST TO NSL FOR   @Y17XAXF*/
*                                       /*  PRIMING          @Y17XAXF*/
*                                       /*                   @Y17XAXF*/
*DCL PRILAEND BIT(8) CONSTANT('E4'X);   /* TO START ERROR PROCESSING */
*                                       /* USED BY LINE END APPENDAGE*/
*/*                                                                  */
*DCL PRIMHUNT BIT(8) CONSTANT('E8'X);   /* TO POST A UNIT TO MH      */
*                                       /* USED BY IEDQBW            */
*                                       /* MUST BE GREATER THAN      */
*                                       /* PRIMHBFR                  */
*/*                                                                  */
*DCL PRIRELSE BIT(8) CONSTANT('E0'X);   /* TO RELEASE SUBTASK FROM   */
*                                       /* TIME DELAY OR OP. CONTROL */
*                                       /* USED BY HOLD              */
*                                       /* USED BY OPERATOR CONTROL  */
*/*                                                                  */
*DCL PRIFEFO BIT(8) CONSTANT('EE'X);    /* TO UPDATE DISK FEFO       */
*                                       /* POINTER                   */
*                                       /* CHECKED BY IEDQFA         */
*                                       /* SET BY IGG019RP,REUS/COPY */
*/*                                                                  */
*/*                                                                  */
*/*                      OTHER                                       */
*/*                                                                  */
*DCL PRIRLCB BIT(8) CONSTANT('EB'X);    /* USED BY IEDQBD TO   S22026*/
*                                       /* RETURN LCB          S22026*/
*/*                                                                  */
*DCL PRILCB BIT(8) CONSTANT('E7'X);     /* TO POST LCB FOR CLEANUP   */
*                                       /* USED BY LINEEND     S22026*/
*/*                                                                  */
*DCL PRICPBCL BIT(8) CONSTANT('E8'X);   /* TO POST CPB CLEANUP       */
*                                       /* COMPLETE                  */
*                                       /* USED BY DISK END APPENAGE */
*/*                                                                  */
*DCL PRICKPT BIT(8) CONSTANT('EC'X);    /* TO REQUEST COMPLETE       */
*                                       /* CHECKPOINT                */
*                                       /* USED BY REUS              */
*                                       /* USED BY MCPCLOSE          */
*                                       /* USED BY TIME DELAY        */
*/*                                                                  */
*DCL PRILNFRE BIT(8) CONSTANT('E0'X);   /* TO FREE A LINE            */
*                                       /* USED BY DISPOSITION       */
*                                       /* USED BY SEND SCHEDULER    */
*                                       /* USED BY PUT SCHEDULER     */
*                                       /*         (UNLOCK)          */
*                                       /* MUST GET TO DESTINATION   */
*                                       /* SCHEDULER BEFORE LINE     */
*                                       /* IS FREE                   */
*/*                                                                  */
*DCL PRILCBRQ BIT(8) CONSTANT('E4'X);   /* UNUSED            @Y17XAXF*/
*/*                                                            X03039*/
*DCL PRIOPDST BIT(8) CONSTANT('E4'X);   /* UNUSED            @Y17XAXF*/
*/*                                                            X03039*/
*DCL PRIOPCMP BIT(8) CONSTANT('E5'X);   /* UNUSED            @Y17XAXF*/
*                                       /*                     X03039*/
*DCL PRICLDST BIT(8) CONSTANT('E4'X);   /* UNUSED            @Y17XAXF*/
*/*                                                            X03039*/
*DCL PRIRESUM BIT(8) CONSTANT('E5'X);   /* TO POST RESPONSE  @Y17XAXF*/
*                                       /*  FROM DEBLOCK     @Y17XAXF*/
*                                       /*  BACK TO NIR GEN  @Y17XAXF*/
*                                       /*  MODULES TO REQ   @Y17XAXF*/
*                                       /*  RESUMPTION OF AN @Y17XAXF*/
*                                       /*  OPERATION BEGUN  @Y17XAXF*/
*                                       /*  BY NIR GENERATOR @Y17XAXF*/
*                                       /*  MODULES          @Y17XAXF*/
*/*                                                            X03039*/
*DCL PRISTOPD BIT(8) CONSTANT('E8'X);   /* USED TO RETURN AN   X03039*/
*                                       /* ELEMENT TO NSL      X03039*/
*/*                                                            X03039*/
*DCL PRIATTNH BIT(8) CONSTANT('E6'X);   /* UNUSED            @Y17XAXF*/
*/*                                                            X03039*/
*DCL PRICLSDN BIT(8) CONSTANT('10'X);   /* TO REQUEST CLOSEDOWN      */
*                                       /* USED BY -----             */
*                                       /* MUST BE LOWEST PRIORITY   */
*/*                                                                  */
*DCL PRIAPCKP BIT(8) CONSTANT('EC'X);   /* TO REQUEST INCIDENT       */
*                                       /* CHECKPOINT                */
*                                       /* USED BY APPLICATION       */
*                                       /* PROGRAM                   */
*/*                                                                  */
*DCL PRIOPCKP BIT(8) CONSTANT('EC'X);   /* TO REQUEST INCIDENT       */
*                                       /* CHECKPOINT                */
*                                       /* USED BY OPERATOR CONTROL  */
*/*                                                                  */
*DCL PRILNCL BIT(8) CONSTANT('EC'X);    /* TO CLEAN UP BUFFERS AND TO*/
*                                       /* FREE LINE                 */
*                                       /* USED BY LINE END TO POST  */
*                                       /* LINE TO DISPOSITION       */
*                                       /* USED BY IN END            */
*                                       /* USED BY OUT END           */
*/*                                                                  */
*DCL PRILCBAT BIT(8) CONSTANT('E9'X);   /* TO POST LCB TO STOPLINE   */
*                                       /* USED BY LINENED     S22025*/
*/*                                                                  */
*DCL PRILOGLB BIT(8) CONSTANT('E0'X);   /* TO POST THE LOG LCB TO    */
*                                       /* ITSELF                    */
*                                       /* USED BY LOG SCHEDULER     */
*/*                                                                  */
*DCL PRISSOLT BIT(8) CONSTANT('DC'X);   /* POSTED TO OPERATOR CONTROL*/
*                                       /* TO REQUEST START LINE /   */
*                                       /* STOPLINE                  */
*                                       /* USED BY ON LINE TEST      */
*/*                                                                  */
*DCL PRITRACE BIT(8) CONSTANT('F0'X);   /* DSPTRACE PRIORITY IGCM610D
*                                           POSTS UNIT TO ALTER
*                                           IGG019RO TO START OR STOP
*                                           TRACE(S) AFTER MODIFY
*                                           TCAM, SUBT= COMMAND
*                                                            @Y17XAXF*/
*DCL PRITIME BIT(8) CONSTANT('F0'X);    /* TO RETURN ELE FROM TIME Q */
*                                       /* USED BY TIME DELAY        */
*/*                                                                  */
*DCL PRIREUSX BIT(8) CONSTANT('EE'X);   /* TO ACTIVATE REUS  @OS76497*/
*                                       /* ASSEM IN PLACE BY IGG019RP*/
*/*                                                                  */
*DCL PRIATTN BIT(8) CONSTANT('DC'X);    /* POST ATTENTION ELEMENT    */
*                                       /* USED BY ATTENTION HANDLER */
*/*                                                                  */
*DCL PRIATN05 BIT(8) CONSTANT('DD'X);   /* 3705 ATTENTION ELEMENT
*                                          PRIORITY          @YM08074*/
*/*                                                                  */
*DCL PRISYSDL BIT(8) CONSTANT('DC'X);   /* TO INITIATE SYSTEM DELAY  */
*                                       /* USED BY OPERATOR CONTROL  */
*                                       /* CHECKED BY SYS DELAY      */
*/*                                                                  */
*DCL PRISYSDT BIT(8) CONSTANT('D8'X);   /* POST SYSTEM DELAY QCB     */
*                                       /* TO TIME DELAY             */
*                                       /* USED BY SYSTEM DELAY      */
*/*                                                                  */
*DCL PRILCBDL BIT(8) CONSTANT('20'X);   /* TO INDICATE AN LCB ON     */
*                                       /* SYSTEM DELAY QUEUE        */
*                                       /* SET BY SYSTEM DELAY,IEDQHI*/
*                                       /* CHECKED BY CHECKPOINT     */
*/*                                                                  */
*DCL PRIPOSTS BIT(8) CONSTANT('FE'X);   /* POST  SYNC QUEUE          */
*/*                                                                  */
*DCL PRIPOSTA BIT(8) CONSTANT('FF'X);   /* POST ASYNC QUEUE          */
*/*                                                                  */
