         MACRO
         APEMCT
*                                 INVOKE THE STANDARD IRAMCT MACRO
         IRAMCT
*                                 ADDITIONAL DEFINITIONS FOR APEMAN
MCCLEN0  EQU   MCCPLUS-MCT
MCCLEN   EQU   MCCEND-MCT
MCCLEN1  EQU   MCCLEN-MCCLEN0
MCTLEN1  EQU   MCCMS103-MCT
MCTLEN2  EQU   MCTLEN1-MCCLEN
MCCLEN3  EQU   MCTLEN-MCTLEN1
         MEND
