         TITLE '***** IDCTSLV0 - COMMON STATIC TEXT *****'     @Y30LB33
* /* START OF SPECIFICATIONS****                               @Y30LB33
*01* PROCESSOR = ASSEM                                         @Y30LB33
**** END OF SPECIFICATIONS **                                  @Y30LB33
************************************************************   @Y30LB33
*                                                          *   @Y30LB33
* MODULE NAME -  IDCTSLV0                                  *   @Y30LB33
*                                                          *   @Y30LB33
*                                                          *   @Y30LB33
* DESCRIPTIVE NAME - STATIC TEXT MODULE FOR LISTMSVI       *   @Y30LB33
*                                                          *   @Y30LB33
*                                                          *   @Y30LB33
* COPYRIGHT - NONE                                         *   @Y30LB33
*                                                          *   @Y30LB33
* STATUS - MVS                                             *   @G24LB37
*                                                          *   @Y30LB33
* FUNCTION - CONTAINS NO EXECTABLE CODE, ONLY STATIC TEXT  *   @Y30LB33
*        ENTRIES FOR THE FUNCTION LISTMSVI                 *   @Y30LB33
*        THIS MODULE IS LOADED BY IDCTP05 WHEN A STATIC    *   @Y30LB33
*        TEXT REQUEST IS MADE.                             *   @Y30LB33
*                                                          *   @Y30LB33
* NOTES - NONE                                             *   @Y30LB33
*                                                          *   @Y30LB33
*        DEPENDENCIES - NONE                               *   @Y30LB33
*        RESTRICTIONS - NONE                               *   @Y30LB33
*        REGISTER CONVENTIONS - NA                         *   @Y30LB33
*        PATCH AREA - NA                                   *   @Y30LB33
*                                                          *   @Y30LB33
* MODULE TYPE - TABLES                                     *   @Y30LB33
*                                                          *   @Y30LB33
*        PROCESSOR - ASSEMBLER                             *   @Y30LB33
*        MODULE SIZE - 11900 DECIMAL BYTES                 *   @G24LB37
*        ATTRIBUTES - READ-ONLY                            *   @Y30LB33
*                                                          *   @Y30LB33
* ENTRY POINT - NA                                         *   @Y30LB33
*                                                          *   @Y30LB33
* EXIT NORMAL - NA                                         *   @Y30LB33
*                                                          *   @Y30LB33
* EXIT ERROR - NA                                          *   @Y30LB33
*                                                          *   @Y30LB33
* EXTERNAL REFERENCES - NA                                 *   @Y30LB33
*                                                          *   @Y30LB33
* TABLES - NA                                              *   @Y30LB33
*                                                          *   @Y30LB33
* MACROS - NA                                              *   @Y30LB33
*                                                          *   @Y30LB33
* CHANGE ACTIVITY - AS FOLLOWS:                            *   @Y30LB33
*  CHANGE 01  1/7/75  FREE SPACE THOLD FIELD CHANGE        *   @YM04311
*  CHANGE 02  2/4/75  CHANGE WORDING OF NOTES              *   @ZM04314
*  CHANGE 03  4/16/75  CHANGE STATUS LEGEND                *   @ZM01010
*  CHANGE 04  9/02/75  ALLGROUPS COLUMN ALIGNMT AND        *   @ZA00683
*                      SINGLE SPACE ON MSG IDC2831I.       *   @ZA00683
*  CHANGE 05  4/20/75  ADD TEXT FOR CARTRIDGE REPORTS      *   @Z40LB66
*  CHANGE 06  7/4/76  DCRR - LIST MSVC PLACE HOLDER RECORDS*   @ZDR2056
*  CHANGE 07  7/12/76 EXTEND MSG IDC0832I                  *   @ZA11679
*  CHANGE 08  9/08/76 MSG IDC3835I                         *   @ZA13476
*  CHANGE 09  9/23/76 SUPPORT OF CONCURRENT USERS AND      *   @G24LB37
*                     AND STATUS CHANGED TO FIX THOLD.     *   @ZA16116
*  CHANGE 10 12/14/76 GRP DATA LINE INSERT REFS FOR USAGE  *   @ZA16116
*                     RESERVED SPACE FOR ALLOC MTD VOLS    *   @G24LB37
*                                                          *   #Y30LB33
*                                                          *   #Y30LB33
************************************************************   @Y30LB33
         EJECT                                                 @Y30LB33
************************************************************   @Y30LB33
*                                                          *   @Y30LB33
* THIS MODULE IS THE FIRST MODULE OF STATIC TEXT REQUIRED  *   @Y30LB33
* BY THE LISTMSVI FUNCTIONAL SERVICE ROUTINE               *   @Y30LB33
*                                                          *   @Y30LB33
************************************************************   @Y30LB33
*                                                              @Y30LB33
IDCTSLV0 CSECT                                                 @Y30LB33
*                                                              @Y30LB33
*********************************************************      @Y30LB33
*                                                              @Y30LB33
*        THIS SECTION CONTAINS THE INDICES TO REACH AN ENTRY.  @Y30LB33
*                                                              @Y30LB33
*                                                          *   @Y30LB33
************************************************************   @Y30LB33
INDEX    DC    Y((INDEXEND-INDEX1)/2)  COUNT OF ENTRIES        @Y30LB33
INDEX1   DC    Y(TXT01-INDEX)                                  @Y30LB33
INDEX2   DC    Y(TXT02-INDEX)                                  @Y30LB33
INDEX3   DC    Y(TXT03-INDEX)                                  @Y30LB33
INDEX4   DC    Y(TXT04-INDEX)                                  @Y30LB33
INDEX5   DC    Y(TXT05-INDEX)                                  @Y30LB33
INDEX6   DC    Y(TXT06-INDEX)                                  @Y30LB33
INDEX7   DC    Y(TXT07-INDEX)                                  @Y30LB33
INDEX8   DC    Y(TXT08-INDEX)                                  @Y30LB33
INDEX9   DC    Y(TXT09-INDEX)                                  @Y30LB33
INDEX10  DC    Y(TXT10-INDEX)                                  @Y30LB33
INDEX11  DC    Y(TXT11-INDEX)                                  @Y30LB33
INDEX12  DC    Y(TXT12-INDEX)                                  @Y30LB33
INDEX13  DC    Y(TXT13-INDEX)                                  @Y30LB33
INDEX14  DC    Y(TXT14-INDEX)                                  @Y30LB33
INDEX15  DC    Y(TXT15-INDEX)                                  @Y30LB33
INDEX16  DC    Y(TXT16-INDEX)                                  @Y30LB33
INDEX17  DC    Y(TXT17-INDEX)                                  @Y30LB33
INDEX18  DC    Y(TXT18-INDEX)                                  @Y30LB33
INDEX19  DC    Y(TXT19-INDEX)                                  @Y30LB33
INDEX20  DC    Y(TXT20-INDEX)                                  @Y30LB33
INDEX21  DC    Y(TXT21-INDEX)                                  @Y30LB33
INDEX22  DC    Y(TXT22-INDEX)                                  @Y30LB33
INDEX23  DC    Y(TXT23-INDEX)                                  @Y30LB33
INDEX24  DC    Y(TXT24-INDEX)                                  @Y30LB33
INDEX25  DC    Y(TXT25-INDEX)                                  @Y30LB33
INDEX26  DC    Y(TXT26-INDEX)                                  @Y30LB33
INDEX27  DC    Y(TXT27-INDEX)                                  @Y30LB33
INDEX28  DC    Y(TXT28-INDEX)                                  @Y30LB33
INDEX29  DC    Y(TXT29-INDEX)                                  @Y30LB33
INDEX30  DC    Y(TXT30-INDEX)                                  @Y30LB33
INDEX31  DC    Y(TXT31-INDEX)                                  @Y30LB33
INDEX32  DC    Y(TXT32-INDEX)                                  @ZA00683
INDEX33  DC    Y(TXT33-INDEX)                                  @Z40LB66
INDEX34  DC    Y(TXT34-INDEX)                                  @Z40LB66
INDEX35  DC    Y(TXT35-INDEX)                                  @Z40LB66
INDEX36  DC    Y(TXT36-INDEX)                                  @Z40LB66
INDEX37  DC    Y(TXT37-INDEX)                                  @Z40LB66
INDEX38  DC    Y(TXT38-INDEX)                                  @Z40LB66
INDEX39  DC    Y(TXT39-INDEX)                                  @ZA11679
INDEX40  DC    Y(TXT40-INDEX)                                  @ZA11679
INDEX41  DC    Y(TXT41-INDEX)                                  @ZA11679
INDEX42  DC    Y(TXT42-INDEX)                                  @ZA11679
INDEX43  DC    Y(TXT43-INDEX)                                  @ZA13476
INDEXEND DS    0H                                              #Y30LB33
         EJECT                                                 @Y30LB33
**********************************************************     @Y30LB33
*                                                        *     @Y30LB33
* THIS SECTION CONTAINS THE ENTRIES.                     *     @Y30LB33
*                                                        *     @Y30LB33
**********************************************************     @Y30LB33
*                                                              @Y30LB33
************************************************************   @Y30LB33
*                                                          *   @Y30LB33
* DUPLICATE VOLUME DATA LINE - STATUS REPORT                   @Y30LB33
*                                                              @Y30LB33
*                                                          *   @Y30LB33
************************************************************   @Y30LB33
TXT01    DC    Y(TXT01B-TXT01A)        ENTRY LENGTH            @Y30LB33
         DC    X'0000'                 FLAG                    @Y30LB33
         SPACE 1                                               @Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                @Y30LB33
TXT01A   DC    X'4000'                 SPACE CONTROL FLAG      @Y30LB33
         DC    H'1'                    SPACING FACTOR          @Y30LB33
         DC    C'R '                   SPACING TYPE            @Y30LB33
*                                                              @Y30LB33
*    VOLUME SERIAL NUMBER                                      @Y30LB33
*                                                              @Y30LB33
* BLOCK DATA SUB-STRUCTURE                                     @Y30LB33
         DC    X'1000'                                         @Y30LB33
         DC    H'6,25,1,6'             ILEN,IPOS,OCOL,OLEN     @Y30LB33
         DC    H'0'                    CONVERSION              @Y30LB33
*                                                              @Y30LB33
*        CART 1 SERIAL                                         @Y30LB33
*                                                              @Y30LB33
* BLOCK DATA SUB-STRUCTURE                                     @Y30LB33
         DC    X'1000'                                         @Y30LB33
         DC    H'12,44,82,12'          ILEN,IPOS,OCOL,OLEN     @Y30LB33
         DC    H'0'                    CONVERSION              @Y30LB33
*                                                              @Y30LB33
*        LOCATION FIELD 1                                      @Y30LB33
*                                                              @Y30LB33
* BLOCK DATA SUB-STRUCTURE                                     @Y30LB33
         DC    X'1000'                                         @Y30LB33
         DC    H'15,164,96,15'          ILEN,IPOS,OCOL,OLEN    @Y30LB33
         DC    H'0'                    CONVERSION              @Y30LB33
*                                                              @Y30LB33
*        SECOND LINE                                           @Y30LB33
*                                                              @Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                @Y30LB33
         DC    X'4000'                 SPACE CONTROL FLAG      @Y30LB33
         DC    H'1'                    SPACING FACTOR          @Y30LB33
         DC    C'R '                   SPACING TYPE            @Y30LB33
*                                                              @Y30LB33
*        CART 2 SERIAL                                         @Y30LB33
*                                                              @Y30LB33
* BLOCK DATA SUB-STRUCTURE                                     @Y30LB33
         DC    X'1000'                                         @Y30LB33
         DC    H'12,57,82,12'          ILEN,IPOS,OCOL,OLEN     @Y30LB33
         DC    H'0'                    CONVERSION              @Y30LB33
*                                                              @Y30LB33
*        LOCATION FIELD 2                                      @Y30LB33
*                                                              @Y30LB33
* BLOCK DATA SUB-STRUCTURE                                     @Y30LB33
         DC    X'9000'                 FLAGS                   @Y30LB33
         DC    H'15,179,96,15'         ILEN,IPOS,OCOL,OLEN     @Y30LB33
         DC    H'0'                    CONVERSION              @Y30LB33
TXT01B   EQU   *                                               @Y30LB33
         EJECT                                                 @Y30LB33
************************************************************   @Y30LB33
*                                                              @Y30LB33
*        DUPLICATE VOLUME TOTAL LINE                           @Y30LB33
*                                                              @Y30LB33
************************************************************   @Y30LB33
TXT02    DC    Y(TXT02B-TXT02A)        ENTRY LENGTH            @Y30LB33
         DC    X'0000'                 FLAG                    @Y30LB33
         SPACE 1                                               @Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                @Y30LB33
TXT02A   DC    X'4000'                 SPACE CONTROL FLAG      @Y30LB33
         DC    H'1'                    SPACING FACTOR          @Y30LB33
         DC    C'R '                   SPACING TYPE            @Y30LB33
         SPACE 1                                               @Y30LB33
* BLOCK DATA SUB-STRUCTURE                                     @Y30LB33
         DC    X'1000'                                         @Y30LB33
         DC    H'04,20,35,4'           ILEN,IPOS,OCOL,OLEN     @ZA00683
         DC    X'10A0'                 CONVERSION              @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT SUB-STRUCTURE                                    @Y30LB33
         DC    X'8400'                 STATIC TEXT FLAG        @Y30LB33
         DC    Y(STE021B-STE021A)      TEXT LENGTH             @Y30LB33
         DC    Y(STE021A-TXT02A)       TEXT OFFSET             @Y30LB33
         DC    H'1'                    PRINT COLUMN            @YD11111
         DC    Y(STE021B-STE021A)      PRINT FIELD LENGTH      @Y30LB33
         DC    H'0'                    CONVERSION FLAGS        @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT ENTRIES                                          @Y30LB33
STE021A  DC    C'DUPLICATES LISTED:'                           @YM02885
STE021B  EQU   *                                               @Y30LB33
TXT02B   EQU   *                                               @Y30LB33
         EJECT                                                 @Y30LB33
************************************************************   @Y30LB33
*                                                              @Y30LB33
*        INCOMPLETE COPY VOLUME COPY OPERATION                 @Y30LB33
*                                                              @Y30LB33
************************************************************   @Y30LB33
TXT03    DC    Y(TXT03B-TXT03A)        ENTRY LENGTH            @Y30LB33
         DC    X'0000'                 FLAG                    @Y30LB33
         SPACE 1                                               @Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                @Y30LB33
TXT03A   DC    X'4000'                 SPACE CONTROL FLAG      @Y30LB33
         DC    H'1'                    SPACING FACTOR          @Y30LB33
         DC    C'R '                   SPACING TYPE            @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT SUB-STRUCTURE                                    @Y30LB33
         DC    X'8400'                 STATIC TEXT FLAG        @Y30LB33
         DC    Y(STE031B-STE031A)      TEXT LENGTH             @Y30LB33
         DC    Y(STE031A-TXT03A)       TEXT OFFSET             @Y30LB33
         DC    H'1'                    PRINT COLUMN            @Y30LB33
         DC    Y(STE031B-STE031A)      PRINT FIELD LENGTH      @Y30LB33
         DC    H'0'                    CONVERSION FLAGS        @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT ENTRIES                                          @Y30LB33
STE031A  DC    C'NOTE:  '                                      @YM02885
         DC    C'A PRIOR COPY OPERATION FAILED FOR ABOVE COPY' @ZM04314
STE031B  EQU   *                                               @Y30LB33
TXT03B   EQU   *                                               @Y30LB33
         EJECT                                                 @Y30LB33
************************************************************   @Y30LB33
*                                                              @Y30LB33
* VOLUME AND GROUP HEADER - USAGE REPORT                       @Y30LB33
*                                                              @Y30LB33
************************************************************   @Y30LB33
TXT04    DC    Y(TXT04B-TXT04A)        ENTRY LENGTH            @Y30LB33
         DC    X'0000'                 FLAG                    @Y30LB33
         SPACE 1                                               @Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                @Y30LB33
TXT04A   DC    X'4000'                 SPACE CONTROL FLAG      @Y30LB33
         DC    H'1'                    SPACING FACTOR          @Y30LB33
         DC    C'E '                   SPACING TYPE            @Y30LB33
*                                                              @Y30LB33
*        REPORT TYPE HEADER LINE                               @Y30LB33
*                                                              @Y30LB33
* STATIC TEXT SUB-STRUCTURE                                    @Y30LB33
         DC    X'0400'                 STATIC TEXT FLAG        @Y30LB33
         DC    Y(STE041B-STE041A)      TEXT LENGTH             @Y30LB33
         DC    Y(STE041A-TXT04A)       TEXT OFFSET             @Y30LB33
         DC    H'42'                   PRINT COLUMN            @Y30LB33
         DC    Y(STE041B-STE041A)      PRINT FIELD LENGTH      @Y30LB33
         DC    H'0'                    CONVERSION              @Y30LB33
         SPACE 1                                               @Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                @Y30LB33
         DC    X'4000'                 SPACE CONTROL FLAG      @Y30LB33
         DC    H'2'                    SPACING FACTOR          @Y30LB33
         DC    C'R '                   SPACING TYPE            @Y30LB33
*                                                              @Y30LB33
*        OWNER LINE                                            @Y30LB33
*                                                              @Y30LB33
* STATIC TEXT SUB-STRUCTURE                                    @Y30LB33
         DC    X'0400'                 STATIC TEXT FLAG        @Y30LB33
         DC    Y(STE042B-STE042A)      TEXT LENGTH             @Y30LB33
         DC    Y(STE042A-TXT04A)       TEXT OFFSET             @Y30LB33
         DC    H'1'                    PRINT COLUMN            @Y30LB33
         DC    Y(STE042B-STE042A)      PRINT FIELD LENGTH      @Y30LB33
         DC    H'0'                    CONVERSION              @Y30LB33
*                                                              @Y30LB33
*        OWNER NAME                                            @Y30LB33
*                                                              @Y30LB33
* BLOCK DATA SUB-STRUCTURE                                     @Y30LB33
         DC    X'1000'                                         @Y30LB33
         DC    H'10,116,09,10'         ILEN,IPOS,OCOL,OLEN     @Y30LB33
         DC    H'0'                    CONVERSION              @Y30LB33
         SPACE 1                                               @Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                @Y30LB33
         DC    X'4000'                 SPACE CONTROL FLAG      @Y30LB33
         DC    H'2'                    SPACING FACTOR          @Y30LB33
         DC    C'R '                   SPACING TYPE            @Y30LB33
*                                                              @Y30LB33
*        ADDRESS LINE                                          @Y30LB33
*                                                              @Y30LB33
* STATIC TEXT SUB-STRUCTURE                                    @Y30LB33
         DC    X'0400'                 STATIC TEXT FLAG        @Y30LB33
         DC    Y(STE043B-STE043A)      TEXT LENGTH             @Y30LB33
         DC    Y(STE043A-TXT04A)       TEXT OFFSET             @Y30LB33
         DC    H'1'                    PRINT COLUMN            @Y30LB33
         DC    Y(STE043B-STE043A)      PRINT FIELD LENGTH      @Y30LB33
         DC    H'0'                    CONVERSION              @Y30LB33
*                                                              @Y30LB33
*        ADDRESS                                               @Y30LB33
*                                                              @Y30LB33
* BLOCK DATA SUB-STRUCTURE                                     @Y30LB33
         DC    X'1000'                                         @Y30LB33
         DC    H'30,126,10,30'         ILEN,IPOS,OCOL,OLEN     @Y30LB33
         DC    H'0'                    CONVERSION              @Y30LB33
         SPACE 1                                               @Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                @Y30LB33
         DC    X'4000'                 SPACE CONTROL FLAG      @Y30LB33
         DC    H'2'                    SPACING FACTOR          @Y30LB33
         DC    C'R '                   SPACING TYPE            @Y30LB33
*                                                              @Y30LB33
*        FIRST LINE GROUP SUBTITLES                            @Y30LB33
*                                                              @Y30LB33
* STATIC TEXT SUB-STRUCTURE                                    @Y30LB33
         DC    X'0400'                 STATIC TEXT FLAG        @Y30LB33
         DC    Y(STE044B-STE044A)      TEXT LENGTH             @Y30LB33
         DC    Y(STE044A-TXT04A)       TEXT OFFSET             @Y30LB33
         DC    H'11'                   PRINT COLUMN            @Y30LB33
         DC    Y(STE044B-STE044A)      PRINT FIELD LENGTH      @Y30LB33
         DC    H'0'                    CONVERSION              @Y30LB33
         SPACE 1                                               @Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                @Y30LB33
         DC    X'4000'                 SPACE CONTROL FLAG      @Y30LB33
         DC    H'1'                    SPACING FACTOR          @Y30LB33
         DC    C'R '                   SPACING TYPE            @Y30LB33
*                                                              @Y30LB33
*        SECOND LINE - GROUP SUBTITLES                         @Y30LB33
*                                                              @Y30LB33
* STATIC TEXT SUB-STRUCTURE                                    @Y30LB33
         DC    X'0400'                 STATIC TEXT FLAG        @Y30LB33
         DC    Y(STE045B-STE045A)      TEXT LENGTH             @Y30LB33
         DC    Y(STE045A-TXT04A)       TEXT OFFSET             @Y30LB33
         DC    H'11'                   PRINT COLUMN            @Y30LB33
         DC    Y(STE045B-STE045A)      PRINT FIELD LENGTH      @Y30LB33
         DC    H'0'                    CONVERSION              @Y30LB33
         SPACE 1                                               @Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                @Y30LB33
         DC    X'4000'                 SPACE CONTROL FLAG      @Y30LB33
         DC    H'1'                    SPACING FACTOR          @Y30LB33
         DC    C'R '                   SPACING TYPE            @Y30LB33
*                                                              @Y30LB33
* THIRD LINE - GROUP SUBTITLES                                 @Y30LB33
*                                                              @Y30LB33
* STATIC TEXT SUB-STRUCTURE                                    @Y30LB33
         DC    X'0400'                 STATIC TEXT FLAG        @Y30LB33
         DC    Y(STE046B-STE046A)      TEXT LENGTH             @Y30LB33
         DC    Y(STE046A-TXT04A)       TEXT OFFSET             @Y30LB33
         DC    H'1'                    PRINT COLUMN            @Y30LB33
         DC    Y(STE046B-STE046A)      PRINT FIELD LENGTH      @Y30LB33
         DC    H'0'                    CONVERSION              @Y30LB33
*                                                              @Y30LB33
*        GROUP DATA LINE                                       @Y30LB33
*                                                              @Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                @Y30LB33
         DC    X'4000'                 SPACE CONTROL FLAG      @Y30LB33
         DC    H'2'                    SPACING FACTOR          @Y30LB33
         DC    C'R '                   SPACING TYPE            @Y30LB33
*                                                              @Y30LB33
*        GROUP NAME FIELD                                      @Y30LB33
*                                                              @Y30LB33
* BLOCK DATA SUB-STRUCTURE                                     @Y30LB33
         DC    X'1000'                                         @Y30LB33
         DC    H'8,23,1,8'             ILEN,IPOS,OCOL,OLEN     @Y30LB33
         DC    H'0'                    CONVERSION              @Y30LB33
*                                                              @Y30LB33
*        PRIMARY ALLOCATION DEFAULT FIELD                      @Y30LB33
*                                                              @Y30LB33
* BLOCK DATA SUB-STRUCTURE                                     @Y30LB33
         DC    X'1000'                                         @Y30LB33
         DC    H'02,56,11,3'           ILEN,IPOS,OCOL,OLEN     @Y30LB33
         DC    X'10A0'                 CONVERSION              @Y30LB33
*                                                              @Y30LB33
*        SECONDARY ALLOCATION DEFAULT FIELD                    @Y30LB33
*                                                              @Y30LB33
* BLOCK DATA SUB-STRUCTURE                                     @Y30LB33
         DC    X'1000'                                         @Y30LB33
         DC    H'02,58,15,3'           ILEN,IPOS,OCOL,OLEN     @Y30LB33
         DC    X'10A0'                 CONVERSION              @Y30LB33
*                                                              @Y30LB33
*        SPACE DISPOSITION FIELD                               @Y30LB33
*                                                              @Y30LB33
* BLOCK DATA SUB-STRUCTURE                                     @Y30LB33
         DC    X'1000'                                         @Y30LB33
         DC    H'5,4,20,5,0'           ILEN,IPOS,OCOL,OLEN     @Y30LB33
*                                      CONVERSION              @Y30LB33
*                                                              @Y30LB33
*        FREE SPACE THRESHOLD PERCENT FIELD                    @Y30LB33
*                                                              @Y30LB33
* INSERT DATA SUB-STRUCTURE                                    @ZA16116
         DC    X'2000'                                         @ZA16116
         DC    H'1,00,29,2'            REF,00,OCOL,OLEN        @ZA16116
         DC    X'10A0'                 CONVERSION              @Y30LB33
*                                                              @G24LB37
*        CONCURRENT USERS FIELD                                @G24LB37
*                                                              @G24LB37
* BLOCK DATA SUB-STRUCTURE                                     @G24LB37
         DC    X'1000'                                         @G24LB37
         DC    H'1,114,38,3'           ILEN,IPOS,OCOL,OLEN     @G24LB37
         DC    X'10A0'                 CONVERSION              @G24LB37
*                                                              @G24LB37
*        RESERVED SPACE FIELD                                  @G24LB37
*                                                              @G24LB37
* BLOCK DATA SUB-STRUCTURE                                     @G24LB37
         DC    X'1000'                                         @G24LB37
         DC    H'1,115,48,2'           ILEN,IPOS,OCOL,OLEN     @G24LB37
         DC    X'10A0'                 CONVERSION              @G24LB37
*                                                              @Y30LB33
*        TOTAL SPACE FIELD                                     @Y30LB33
*                                                              @Y30LB33
* BLOCK DATA SUB-STRUCTURE                                     @Y30LB33
         DC    X'1000'                                         @Y30LB33
         DC    H'4,12,56,6'            ILEN,IPOS,OCOL,OLEN     @G24LB37
         DC    X'10A0'                 CONVERSION              @Y30LB33
*                                                              @Y30LB33
*        FREE SPACE FIELD                                      @Y30LB33
*                                                              @Y30LB33
* BLOCK DATA SUB-STRUCTURE                                     @Y30LB33
         DC    X'1000'                                         @Y30LB33
         DC    H'4,64,65,6'            ILEN,IPOS,OCOL,OLEN     @G24LB37
         DC    X'10A0'                 CONVERSION              @Y30LB33
*                                                              @Y30LB33
*        NUMBER OF FREE EXTENTS FIELD                          @Y30LB33
*                                                              @Y30LB33
* BLOCK DATA SUB-STRUCTURE                                     @Y30LB33
         DC    X'1000'                                         @Y30LB33
         DC    H'4,68,73,5'            ILEN,IPOS,OCOL,OLEN     @G24LB37
         DC    X'10A0'                 CONVERSION              @Y30LB33
*                                                              @Y30LB33
*        AVERAGE FREE EXTENT FIELD                             @Y30LB33
*                                                              @Y30LB33
* INSERT DATA SUB-STRUCTURE                                    @Y30LB33
         DC    X'2000'                 INSERT FLAG             @Y30LB33
         DC    H'1,00,79,3'            REF,00,OCOL,OLEN        @G24LB37
         DC    X'10A0'                 CONVERSION              @Y30LB33
*                                                              @Y30LB33
*        RETENTION PERIOD FIELD                                @Y30LB33
*                                                              @Y30LB33
* INSERT DATA SUB-STRUCTURE                                    @Y30LB33
         DC    X'2000'                 INSERT FLAG             @Y30LB33
         DC    H'02,00,84,05'          REF,00,OCOL,OLEN        @G24LB37
         DC    X'10A0'                 CONVERSION FLAGS        @Y30LB33
         SPACE 1                                               @Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                @Y30LB33
         DC    X'D000'                 SPACE CONTROL FLAG      @Y30LB33
         DC    H'2'                    SPACING FACTOR          @Y30LB33
         DC    C'R '                   SPACING TYPE            @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT ENTRIES                                          @Y30LB33
STE041A  DC    C' '                                            @Y30LB33
STE041B  EQU   *                                               @Y30LB33
STE042A  DC    C'OWNER:'                                       @Y30LB33
STE042B  EQU   *                                               @Y30LB33
STE043A  DC    C'ADDRESS:'                                     @Y30LB33
STE043B  EQU   *                                               @Y30LB33
STE044A  DC    C'ALLOCN          FREE                    '     @G24LB37
         DC    C'                        FREE   '              @G24LB37
STE044B  EQU   *                                               #Y30LB33
STE045A  DC    C'DEFAULT  SPACE  SPACE     CONCUR   RESER'     @G24LB37
         DC    C'VED   TOTAL    FREE     EXTENTS  '            @G24LB37
STE045B  EQU   *                                               #Y30LB33
STE046A  DC    C'GROUP     PRI SEC  DISP   THOLD %   USERS   ' @G24LB37
         DC    C' SPACE %    SPACE    SPACE    NUM AVG  RETPD' @G24LB37
STE046B  EQU   *                                               #Y30LB33
TXT04B   EQU   *                                               @Y30LB33
         EJECT                                                 @Y30LB33
************************************************************   @Y30LB33
*                                                              @Y30LB33
*        MISC TEXT                                             @Y30LB33
*                                                              @Y30LB33
************************************************************   @Y30LB33
TXT05    DC    Y(TXT05B-TXT05A)        ENTRY LENGTH            @Y30LB33
         DC    X'0000'                 FLAG                    @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT SUB-STRUCTURE                                    @Y30LB33
TXT05A   DC    X'8400'                 STATIC TEXT FLAG        @Y30LB33
         DC    Y(STE051B-STE051A)      TEXT LENGTH             @Y30LB33
         DC    Y(STE051A-TXT05A)       TEXT OFFSET             @Y30LB33
         DC    H'1'                    PRINT COLUMN            @Y30LB33
         DC    Y(STE051B-STE051A)      PRINT FIELD LENGTH      @Y30LB33
         DC    H'0'                    CONVERSION              @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT ENTRIES                                          @Y30LB33
STE051A  DC    C'BRDENOT IN MSF     REASSIGNED'                @Y30LB33
         DC    C'     MSF 0          MSF 1          '          @Y30LB33
         DC    C'NRLSERLSE ACTIVINACTPHOLD     GEN RSTR'       @ZDR2056
         DC    C'COPYBKUPBASEYESDUP'                           @ZDR2056
STE051B  EQU   *                                               @Y30LB33
TXT05B   EQU   *                                               @Y30LB33
         EJECT                                                 @Y30LB33
************************************************************   @Y30LB33
*                                                              @Y30LB33
*        USAGE REPORT MAIN TITLE LINE                          @Y30LB33
*                                                              @Y30LB33
************************************************************   @Y30LB33
TXT06    DC    Y(TXT06B-TXT06A)        ENTRY LENGTH            @Y30LB33
         DC    X'0000'                 FLAG                    @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT SUB-STRUCTURE                                    @Y30LB33
TXT06A   DC    X'8400'                 STATIC TEXT FLAG        @Y30LB33
         DC    Y(STE061B-STE061A)      TEXT LENGTH             @Y30LB33
         DC    Y(STE061A-TXT06A)       TEXT OFFSET             @Y30LB33
         DC    H'1'                    PRINT COLUMN            @Y30LB33
         DC    Y(STE061B-STE061A)      PRINT FIELD LENGTH      @Y30LB33
         DC    H'0'                    CONVERSION              @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT ENTRIES                                          @Y30LB33
STE061A  DC    C' '                                            @Y30LB33
         DC    C'IDCAMS  SYSTEM SERVICES         SPACE US'     @G24LB37
         DC    C'AGE REPORT                TIME:         '     @G24LB37
         DC    C'                     PAGE               '     @Y30LB33
STE061B  EQU   *                                               @Y30LB33
TXT06B   EQU   *                                               @Y30LB33
         EJECT                                                 @Y30LB33
************************************************************   @Y30LB33
*                                                              @Y30LB33
*        STATUS REPORT MAIN TITLE LINE                         @Y30LB33
*                                                              @Y30LB33
************************************************************   @Y30LB33
TXT07    DC    Y(TXT07B-TXT07A)        ENTRY LENGTH            @Y30LB33
         DC    X'0000'                 FLAG                    @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT SUB-STRUCTURE                                    @Y30LB33
TXT07A   DC    X'8400'                 STATIC TEXT FLAG        @Y30LB33
         DC    Y(STE071B-STE071A)      TEXT LENGTH             @Y30LB33
         DC    Y(STE071A-TXT07A)       TEXT OFFSET             @Y30LB33
         DC    H'1'                    PRINT COLUMN            @Y30LB33
         DC    Y(STE071B-STE071A)      PRINT FIELD LENGTH      @Y30LB33
         DC    H'0'                    CONVERSION              @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT ENTRIES                                          @Y30LB33
STE071A  DC    C' '                                            @Y30LB33
         DC    C'IDCAMS  SYSTEM SERVICES         INVENTOR'     @G24LB37
         DC    C'Y STATUS REPORT           TIME:         '     @G24LB37
         DC    C'                     PAGE               '     @Y30LB33
STE071B  EQU   *                                               @Y30LB33
TXT07B   EQU   *                                               @Y30LB33
         EJECT                                                 @Y30LB33
************************************************************   @Y30LB33
*                                                              @Y30LB33
*        COPY RECORD DATA LINE FORMAT                          @Y30LB33
*                                                              @Y30LB33
************************************************************   @Y30LB33
TXT08    DC    Y(TXT08B-TXT08A)        ENTRY LENGTH            @Y30LB33
         DC    X'0000'                 FLAG                    @Y30LB33
         SPACE 1                                               @Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                @Y30LB33
TXT08A   DC    X'4000'                 SPACE CONTROL FLAG      @Y30LB33
         DC    H'1'                    SPACING FACTOR          @Y30LB33
         DC    C'R '                   SPACING TYPE            @Y30LB33
*                                                              @ZDR2056
*        VOLUME FIELD                                          @ZDR2056
*                                                              @ZDR2056
* BLOCK DATA SUB-STRUCTURE                                     @ZDR2056
         DC    X'1000'                                         @ZDR2056
         DC    H'6,23,1,6,0'           ILN,IP,OC,OL,CV         @ZDR2056
*                                                              @ZDR2056
*        STATE FIELD                                           @ZDR2056
*                                                              @ZDR2056
* BLOCK DATA SUB-STRUCTURE                                     @ZDR2056
         DC    X'1000'                                         @ZDR2056
         DC    H'5,00,19,8,0'          ILN,IP,OC,OL,CV         @ZDR2056
*                                                              @Y30LB33
*        COPY DATE                                             @Y30LB33
*                                                              @Y30LB33
* BLOCK DATA SUB-STRUCTURE                                     @Y30LB33
         DC    X'1000'                                         @Y30LB33
         DC    H'04,68,50,05'          ILEN,IPOS,OCOL,OLEN     @ZDR2056
         DC    X'0820'                 CONVERSION              @Y30LB33
*                                                              @Y30LB33
*        A COMMA                                               @Y30LB33
*                                                              @Y30LB33
* STATIC TEXT SUB-STRUCTURE                                    @Y30LB33
         DC    X'0400'                 STATIC TEXT FLAG        @Y30LB33
         DC    Y(STE081B-STE081A)      TEXT LENGTH             @Y30LB33
         DC    Y(STE081A-TXT08A)       TEXT OFFSET             @Y30LB33
         DC    H'55'                   PRINT COLUMN            @Y30LB33
         DC    Y(STE081B-STE081A)      PRINT FIELD LENGTH      @Y30LB33
         DC    H'0'                    CONVERSION              @Y30LB33
*                                                              @Y30LB33
*        COPY SEQUENCE NUMBER                                  @Y30LB33
*                                                              @Y30LB33
* BLOCK DATA SUB-STRUCTURE                                     @Y30LB33
         DC    X'1000'                                         @Y30LB33
         DC    H'2,16,56,1'            ILEN,IPOS,OCOL,OLEN     @ZDR2056
         DC    X'10A0'                 CONVERSION              @Y30LB33
*                                                              @Y30LB33
*        VOLUME TYPE FIELD                                     @Y30LB33
*                                                              @Y30LB33
* BLOCK DATA SUB-STRUCTURE                                     @Y30LB33
         DC    X'1000'                                         @Y30LB33
         DC    H'4,09,59,04'           ILEN,IPOS,OCOL,OLEN     @ZDR2056
         DC    H'0'                    CONVERSION              @Y30LB33
*                                                              @Y30LB33
*        DESCRIPTION FIELD                                     @Y30LB33
*                                                              @Y30LB33
* BLOCK DATA SUB-STRUCTURE                                     @Y30LB33
         DC    X'1000'                                         @Y30LB33
         DC    H'15,76,65,15'          ILEN,IPOS,OCOL,OLEN     @ZDR2056
         DC    H'0'                    CONVERSION              @Y30LB33
*                                                              @Y30LB33
*        CART 1 FIELD                                          @Y30LB33
*                                                              @Y30LB33
* BLOCK DATA SUB-STRUCTURE                                     @Y30LB33
         DC    X'1000'                                         @Y30LB33
         DC    H'12,42,82,12'          ILEN,IPOS,OCOL,OLEN     @ZDR2056
         DC    H'0'                    CONVERSION              @Y30LB33
*                                                              @Y30LB33
*        LOCATION 1 FIELD                                      @Y30LB33
*                                                              @Y30LB33
* BLOCK DATA SUB-STRUCTURE                                     @Y30LB33
         DC    X'1000'                                         @Y30LB33
         DC    H'15,106,96,15'         ILEN,IPOS,OCOL,OLEN     @ZDR2056
         DC    H'0'                    CONVERSION              @Y30LB33
*                                                              @Y30LB33
*        EJECT DATE FIELD                                      @Y30LB33
*                                                              @Y30LB33
* INSERT DATA SUB-STRUCTURE                                    @Y30LB33
         DC    X'2000'                 INSERT FLAG             @Y30LB33
         DC    H'01,05,113,5'          REF,00,OCOL,OLEN        @ZDR2056
         DC    X'0820'                 CONVERSION FLAGS        @Y30LB33
         SPACE 1                                               @Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                @Y30LB33
         DC    X'4000'                 SPACE CONTROL FLAG      @Y30LB33
         DC    H'1'                    SPACING FACTOR          @Y30LB33
         DC    C'R '                   SPACING TYPE            @Y30LB33
*                                                              @Y30LB33
*        DESCRIPTION 2 FIELD                                   @Y30LB33
*                                                              @Y30LB33
* BLOCK DATA SUB-STRUCTURE                                     @Y30LB33
         DC    X'1000'                                         @Y30LB33
         DC    H'15,91,65,15'          ILEN,IPOS,OCOL,OLEN     @ZDR2056
         DC    H'0'                    CONVERSION              @Y30LB33
*                                                              @Y30LB33
*        CART 2 FIELD                                          @Y30LB33
*                                                              @Y30LB33
* BLOCK DATA SUB-STRUCTURE                                     @Y30LB33
         DC    X'1000'                                         @Y30LB33
         DC    H'12,55,82,12'          ILEN,IPOS,OCOL,OLEN     @ZDR2056
         DC    H'0'                    CONVERSION              @Y30LB33
*                                                              @Y30LB33
*        LOCATION 2 FIELD                                      @Y30LB33
*                                                              @Y30LB33
* BLOCK DATA SUB-STRUCTURE                                     @Y30LB33
         DC    X'9000'                                         @Y30LB33
         DC    H'15,121,96,15'         ILEN,IPOS,OCOL,OLEN     @ZDR2056
         DC    H'0'                    CONVERSION              @Y30LB33
STE081A  DC    C','                                            @Y30LB33
STE081B  EQU   *                                               @Y30LB33
TXT08B   EQU   *                                               @Y30LB33
         EJECT                                                 @Y30LB33
************************************************************   @Y30LB33
*                                                              @Y30LB33
*        STATUS REPORT LEGEND                                  @Y30LB33
*                                                              @Y30LB33
************************************************************   @Y30LB33
TXT09    DC    Y(TXT09B-TXT09A)        ENTRY LENGTH            @Y30LB33
         DC    X'0000'                 FLAG                    @Y30LB33
         SPACE 1                                               @Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                @Y30LB33
TXT09A   DC    X'4000'                 SPACE CONTROL FLAG      @Y30LB33
         DC    H'1'                    SPACING FACTOR          @Y30LB33
         DC    C'E '                   SPACING TYPE            @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT SUB-STRUCTURE                                    @Y30LB33
         DC    X'0400'                 STATIC TEXT FLAG        @Y30LB33
         DC    Y(STE091B-STE091A)      TEXT LENGTH             @Y30LB33
         DC    Y(STE091A-TXT09A)       TEXT OFFSET             @Y30LB33
         DC    H'48'                   PRINT COLUMN            @Y30LB33
         DC    Y(STE091B-STE091A)      PRINT FIELD LENGTH      @Y30LB33
         DC    H'0'                    CONVERSION              @Y30LB33
*                                                              @Y30LB33
*        COLUMN DESCRIPTIONS                                   @Y30LB33
*                                                              @Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                @Y30LB33
         DC    X'4000'                 SPACE CONTROL FLAG      @Y30LB33
         DC    H'1'                    SPACING FACTOR          @ZM01010
         DC    C'R '                   SPACING TYPE            @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT SUB-STRUCTURE                                    @Y30LB33
         DC    X'0400'                 STATIC TEXT FLAG        @Y30LB33
         DC    Y(STE092B-STE092A)      TEXT LENGTH             @Y30LB33
         DC    Y(STE092A-TXT09A)       TEXT OFFSET             @Y30LB33
         DC    H'1'                    PRINT COLUMN            @Y30LB33
         DC    Y(STE092B-STE092A)      PRINT FIELD LENGTH      @Y30LB33
         DC    H'0'                    CONVERSION              @Y30LB33
*                                                              @Y30LB33
*        ADDRESS LINE                                          @Y30LB33
*                                                              @Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                @Y30LB33
         DC    X'4000'                 SPACE CONTROL FLAG      @Y30LB33
         DC    H'2'                    SPACING FACTOR          @Y30LB33
         DC    C'R '                   SPACING TYPE            @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT SUB-STRUCTURE                                    @Y30LB33
         DC    X'0400'                 STATIC TEXT FLAG        @Y30LB33
         DC    Y(STE093B-STE093A)      TEXT LENGTH             @Y30LB33
         DC    Y(STE093A-TXT09A)       TEXT OFFSET             @Y30LB33
         DC    H'1'                    PRINT COLUMN            @Y30LB33
         DC    Y(STE093B-STE093A)      PRINT FIELD LENGTH      @Y30LB33
         DC    H'0'                    CONVERSION              @Y30LB33
*                                                              @Y30LB33
*        ALLOCATION DEFAULT LINE                               @Y30LB33
*                                                              @Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                @Y30LB33
         DC    X'4000'                 SPACE CONTROL FLAG      @Y30LB33
         DC    H'2'                    SPACING FACTOR          @Y30LB33
         DC    C'R '                   SPACING TYPE            @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT SUB-STRUCTURE                                    @Y30LB33
         DC    X'0400'                 STATIC TEXT FLAG        @Y30LB33
         DC    Y(STE094B-STE094A)      TEXT LENGTH             @Y30LB33
         DC    Y(STE094A-TXT09A)       TEXT OFFSET             @Y30LB33
         DC    H'1'                    PRINT COLUMN            @Y30LB33
         DC    Y(STE094B-STE094A)      PRINT FIELD LENGTH      @Y30LB33
         DC    H'0'                    CONVERSION FLAGS        @Y30LB33
         SPACE 1                                               @Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                @Y30LB33
         DC    X'4000'                 SPACE CONTROL FLAG      @Y30LB33
         DC    H'1'                    SPACING FACTOR          @Y30LB33
         DC    C'R '                   SPACING TYPE            @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT SUB-STRUCTURE                                    @Y30LB33
         DC    X'0400'                 STATIC TEXT FLAG        @Y30LB33
         DC    Y(STE094D-STE094C)      TEXT LENGTH             @Y30LB33
         DC    Y(STE094C-TXT09A)       TEXT OFFSET             @Y30LB33
         DC    H'24'                   PRINT COLUMN            @Y30LB33
         DC    Y(STE094D-STE094C)      PRINT FIELD LENGTH      @Y30LB33
         DC    H'0'                    CONVERSION FLAGS        @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT SUB-STRUCTURE                                    @Y30LB33
         DC    X'0400'                 STATIC TEXT FLAG        @Y30LB33
         DC    Y(STE094F-STE094E)      TEXT LENGTH             @Y30LB33
         DC    Y(STE094E-TXT09A)       TEXT OFFSET             @Y30LB33
         DC    H'61'                   PRINT COLUMN            @G24LB37
         DC    Y(STE094F-STE094E)      PRINT FIELD LENGTH      @Y30LB33
         DC    H'0'                    CONVERSION FLAGS        @Y30LB33
*                                                              @Y30LB33
*        ATTRIBUTE LINE                                        @Y30LB33
*                                                              @Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                @Y30LB33
         DC    X'4000'                 SPACE CONTROL FLAG      @Y30LB33
         DC    H'2'                    SPACING FACTOR          @Y30LB33
         DC    C'R '                   SPACING TYPE            @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT SUB-STRUCTURE                                    @Y30LB33
         DC    X'0400'                 STATIC TEXT FLAG        @Y30LB33
         DC    Y(STE095B-STE095A)      TEXT LENGTH             @Y30LB33
         DC    Y(STE095A-TXT09A)       TEXT OFFSET             @Y30LB33
         DC    H'1'                    PRINT COLUMN            @Y30LB33
         DC    Y(STE095B-STE095A)      PRINT FIELD LENGTH      @Y30LB33
         DC    H'0'                    CONVERSION FLAGS        @Y30LB33
         SPACE 1                                               @Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                @Y30LB33
         DC    X'4000'                 SPACE CONTROL FLAG      @Y30LB33
         DC    H'1'                    SPACING FACTOR          @Y30LB33
         DC    C'R '                   SPACING TYPE            @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT SUB-STRUCTURE                                    @Y30LB33
         DC    X'0400'                 STATIC TEXT FLAG        @Y30LB33
         DC    Y(STE095D-STE095C)      TEXT LENGTH             @Y30LB33
         DC    Y(STE095C-TXT09A)       TEXT OFFSET             @Y30LB33
         DC    H'24'                   PRINT COLUMN            @Y30LB33
         DC    Y(STE095D-STE095C)      PRINT FIELD LENGTH      @Y30LB33
         DC    H'0'                    CONVERSION FLAGS        @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT SUB-STRUCTURE                                    @Y30LB33
         DC    X'0400'                 STATIC TEXT FLAG        @Y30LB33
         DC    Y(STE095H-STE095G)      TEXT LENGTH             @G24LB37
         DC    Y(STE095G-TXT09A)       TEXT OFFSET             @G24LB37
         DC    H'61'                   PRINT COLUMN            @G24LB37
         DC    Y(STE095H-STE095G)      PRINT FIELD LENGTH      @G24LB37
         DC    H'0'                    CONVERSION FLAGS        @Y30LB33
         SPACE 1                                               @Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                @Y30LB33
         DC    X'4000'                 SPACE CONTROL FLAG      @Y30LB33
         DC    H'1'                    SPACING FACTOR          @Y30LB33
         DC    C'R '                   SPACING TYPE            @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT SUB-STRUCTURE                                    @Y30LB33
         DC    X'0400'                 STATIC TEXT FLAG        @Y30LB33
         DC    Y(STE095F-STE095E)      TEXT LENGTH             @G24LB37
         DC    Y(STE095E-TXT09A)       TEXT OFFSET             @G24LB37
         DC    H'24'                   PRINT COLUMN            @Y30LB33
         DC    Y(STE095F-STE095E)      PRINT FIELD LENGTH      @G24LB37
         DC    H'0'                    CONVERSION FLAGS        @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT SUB-STRUCTURE                                    @Y30LB33
         DC    X'0400'                 STATIC TEXT FLAG        @Y30LB33
         DC    Y(STE095J-STE095I)      TEXT LENGTH             @Y30LB33
         DC    Y(STE095I-TXT09A)       TEXT OFFSET             @Y30LB33
         DC    H'61'                   PRINT COLUMN            @G24LB37
         DC    Y(STE095J-STE095I)      PRINT FIELD LENGTH      @Y30LB33
         DC    H'0'                    CONVERSION FLAGS        @Y30LB33
*                                                              @Y30LB33
*        CARTRIDGE 1 LINE                                      @Y30LB33
*                                                              @Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                @Y30LB33
         DC    X'4000'                 SPACE CONTROL FLAG      @Y30LB33
         DC    H'2'                    SPACING FACTOR          @Y30LB33
         DC    C'R '                   SPACING TYPE            @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT SUB-STRUCTURE                                    @Y30LB33
         DC    X'0400'                 STATIC TEXT FLAG        @Y30LB33
         DC    Y(STE096B-STE096A)      TEXT LENGTH             @Y30LB33
         DC    Y(STE096A-TXT09A)       TEXT OFFSET             @Y30LB33
         DC    H'1'                    PRINT COLUMN            @Y30LB33
         DC    Y(STE096B-STE096A)      PRINT FIELD LENGTH      @Y30LB33
         DC    H'0'                    CONVERSION FLAGS        @Y30LB33
*                                                              @Y30LB33
*        CARTRIDGE 2 LINE                                      @Y30LB33
*                                                              @Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                @Y30LB33
         DC    X'4000'                 SPACE CONTROL FLAG      @Y30LB33
         DC    H'2'                    SPACING FACTOR          @Y30LB33
         DC    C'R '                   SPACING TYPE            @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT SUB-STRUCTURE                                    @Y30LB33
         DC    X'0400'                 STATIC TEXT FLAG        @Y30LB33
         DC    Y(STE097B-STE097A)      TEXT LENGTH             @Y30LB33
         DC    Y(STE097A-TXT09A)       TEXT OFFSET             @Y30LB33
         DC    H'1'                    PRINT COLUMN            @Y30LB33
         DC    Y(STE097B-STE097A)      PRINT FIELD LENGTH      @Y30LB33
         DC    H'0'                    CONVERSION FLAGS        @Y30LB33
*                                                              @G24LB37
*        CONCURRENT USERS LINE                                 @G24LB37
*                                                              @G24LB37
* SPACING CONTROL SUB-STRUCTURE                                @G24LB37
         DC    X'4000'                 SPACE CONTROL FLAG      @G24LB37
         DC    H'2'                    SPACING FACTOR          @G24LB37
         DC    C'R '                   SPACING TYPE            @G24LB37
         SPACE 1                                               @G24LB37
* STATIC TEXT SUB-STRUCTURE                                    @G24LB37
         DC    X'0400'                 STATIC TEXT FLAG        @G24LB37
         DC    Y(STE097D-STE097C)      TEXT LENGTH             @G24LB37
         DC    Y(STE097C-TXT09A)       TEXT OFFSET             @G24LB37
         DC    H'1'                    PRINT COLUMN            @G24LB37
         DC    Y(STE097D-STE097C)      PRINT FIELD LENGTH      @G24LB37
         DC    H'0'                    CONVERSION FLAGS        @G24LB37
*                                                              #Y30LB33
*        COPY DATE LINE                                        #Y30LB33
*                                                              #Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                #Y30LB33
         DC    X'4000'                 SPACE CONTROL FLAG      #Y30LB33
         DC    H'2'                    SPACING FACTOR          #Y30LB33
         DC    C'R '                   SPACING TYPE            #Y30LB33
         SPACE 1                                               #Y30LB33
* STATIC TEXT SUB-STRUCTURE                                    #Y30LB33
         DC    X'0400'                 STATIC TEXT FLAG        #Y30LB33
         DC    Y(STE098B-STE098A)      TEXT LENGTH             #Y30LB33
         DC    Y(STE098A-TXT09A)       TEXT OFFSET             #Y30LB33
         DC    H'1'                    PRINT COLUMN            #Y30LB33
         DC    Y(STE098B-STE098A)      PRINT FIELD LENGTH      #Y30LB33
         DC    H'0'                    CONVERSION FLAGS        #Y30LB33
*                                                              #Y30LB33
*        DESCRIPTION LINE                                      #Y30LB33
*                                                              #Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                #Y30LB33
         DC    X'4000'                 SPACE CONTROL FLAG      #Y30LB33
         DC    H'2'                    SPACING FACTOR          #Y30LB33
         DC    C'R '                   SPACING TYPE            #Y30LB33
         SPACE 1                                               #Y30LB33
* STATIC TEXT SUB-STRUCTURE                                    @Y30LB33
         DC    X'0400'                 STATIC TEXT FLAG        @Y30LB33
         DC    Y(STE099B-STE099A)      TEXT LENGTH             @Y30LB33
         DC    Y(STE099A-TXT09A)       TEXT OFFSET             @Y30LB33
         DC    H'1'                    PRINT COLUMN            @Y30LB33
         DC    Y(STE099B-STE099A)      PRINT FIELD LENGTH      @Y30LB33
         DC    H'0'                    CONVERSION FLAGS        @Y30LB33
*                                                              @Y30LB33
*        EJECT DATE LINE                                       @Y30LB33
*                                                              @Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                @Y30LB33
         DC    X'4000'                 SPACE CONTROL FLAG      @Y30LB33
         DC    H'2'                    SPACING FACTOR          @Y30LB33
         DC    C'R '                   SPACING TYPE            @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT SUB-STRUCTURE                                    @Y30LB33
         DC    X'0400'                 STATIC TEXT FLAG        @Y30LB33
         DC    Y(STE0910B-STE0910A)    TEXT LENGTH             @Y30LB33
         DC    Y(STE0910A-TXT09A)      TEXT OFFSET             @Y30LB33
         DC    H'1'                    PRINT COLUMN            @Y30LB33
         DC    Y(STE0910B-STE0910A)    PRINT FIELD LENGTH      @Y30LB33
         DC    H'0'                    CONVERSION FLAGS        @Y30LB33
*                                                              @Y30LB33
*        FREE SPACE THOLD %                                    @Y30LB33
*                                                              @Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                @Y30LB33
         DC    X'4000'                 SPACE CONTROL FLAG      @Y30LB33
         DC    H'2'                    SPACING FACTOR          @Y30LB33
         DC    C'R '                   SPACING TYPE            @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT SUB-STRUCTURE                                    @Y30LB33
         DC    X'0400'                 STATIC TEXT FLAG        @Y30LB33
         DC    Y(STE0911B-STE0911A)    TEXT LENGTH             @Y30LB33
         DC    Y(STE0911A-TXT09A)      TEXT OFFSET             @Y30LB33
         DC    H'1'                    PRINT COLUMN            @Y30LB33
         DC    Y(STE0911B-STE0911A)    PRINT FIELD LENGTH      @Y30LB33
         DC    H'0'                    CONVERSION FLAGS        @Y30LB33
         SPACE 1                                               @Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                @Y30LB33
         DC    X'4000'                 SPACE CONTROL FLAG      @Y30LB33
         DC    H'1'                    SPACING FACTOR          @Y30LB33
         DC    C'R '                   SPACING TYPE            @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT SUB-STRUCTURE                                    @Y30LB33
         DC    X'0400'                 STATIC TEXT FLAG        @Y30LB33
         DC    Y(STE0911D-STE0911C)    TEXT LENGTH             @Y30LB33
         DC    Y(STE0911C-TXT09A)      TEXT OFFSET             @Y30LB33
         DC    H'21'                   PRINT COLUMN            @Y30LB33
         DC    Y(STE0911D-STE0911C)    PRINT FIELD LENGTH      @Y30LB33
         DC    H'0'                    CONVERSION FLAGS        @Y30LB33
*                                                              @Y30LB33
*        GROUP LINE                                            @Y30LB33
*                                                              @Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                @Y30LB33
         DC    X'4000'                 SPACE CONTROL FLAG      @Y30LB33
         DC    H'2'                    SPACING FACTOR          @Y30LB33
         DC    C'R '                   SPACING TYPE            @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT SUB-STRUCTURE                                    @Y30LB33
         DC    X'0400'                 STATIC TEXT FLAG        @Y30LB33
         DC    Y(STE0913B-STE0913A)    TEXT LENGTH             @Y30LB33
         DC    Y(STE0913A-TXT09A)      TEXT OFFSET             @Y30LB33
         DC    H'1'                    PRINT COLUMN            @Y30LB33
         DC    Y(STE0913B-STE0913A)    PRINT FIELD LENGTH      @Y30LB33
         DC    H'0'                    CONVERSION FLAGS        @Y30LB33
*                                                              @Y30LB33
*        LOCATION LINE                                         @Y30LB33
*                                                              @Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                @Y30LB33
         DC    X'4000'                 SPACE CONTROL FLAG      @Y30LB33
         DC    H'2'                    SPACING FACTOR          @Y30LB33
         DC    C'R '                   SPACING TYPE            @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT SUB-STRUCTURE                                    @Y30LB33
         DC    X'0400'                 STATIC TEXT FLAG        @Y30LB33
         DC    Y(STE0914B-STE0914A)    TEXT LENGTH             @Y30LB33
         DC    Y(STE0914A-TXT09A)      TEXT OFFSET             @Y30LB33
         DC    H'1'                    PRINT COLUMN            @Y30LB33
         DC    Y(STE0914B-STE0914A)    PRINT FIELD LENGTH      @Y30LB33
         DC    H'0'                    CONVERSION FLAGS        @Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                @ZM01010
         DC    X'4000'                 SPACE CONTROL FLAG      @ZM01010
         DC    H'1'                    SPACING FACTOR          @ZM01010
         DC    C'R '                   SPACING TYPE            @ZM01010
         SPACE 1                                               @ZM01010
* STATIC TEXT SUB-STRUCTURE                                    @ZM01010
         DC    X'0400'                 STATIC TEXT FLAG        @ZM01010
         DC    Y(STE0999B-STE0999A)    TEXT LENGTH             @ZM01010
         DC    Y(STE0999A-TXT09A)      TEXT OFFSET             @ZM01010
         DC    H'1'                    PRINT COLUMN            @ZM01010
         DC    Y(STE0999B-STE0999A)    PRINT FIELD LENGTH      @ZM01010
         DC    H'0'                    CONVERSION FLAGS        @ZM01010
* SPACING CONTROL SUB-STRUCTURE                                @ZM01010
         DC    X'4000'                 SPACE CONTROL FLAG      @ZM01010
         DC    H'1'                    SPACING FACTOR          @ZM01010
         DC    C'R '                   SPACING TYPE            @ZM01010
         SPACE 1                                               @ZM01010
* STATIC TEXT SUB-STRUCTURE                                    @ZM01010
         DC    X'0400'                 STATIC TEXT FLAG        @ZM01010
         DC    Y(STE0998B-STE0998A)    TEXT LENGTH             @ZM01010
         DC    Y(STE0998A-TXT09A)      TEXT OFFSET             @ZM01010
         DC    H'1'                    PRINT COLUMN            @ZM01010
         DC    Y(STE0998B-STE0998A)    PRINT FIELD LENGTH      @ZM01010
         DC    H'0'                    CONVERSION FLAGS        @ZM01010
*                                                              #Y30LB33
*        MAXIMUM BACKUP LINE                                   #Y30LB33
*                                                              #Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                #Y30LB33
         DC    X'4000'                 SPACE CONTROL FLAG      #Y30LB33
         DC    H'2'                    SPACING FACTOR          @Y30LB33
         DC    C'R '                   SPACING TYPE            @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT SUB-STRUCTURE                                    @Y30LB33
         DC    X'0400'                 STATIC TEXT FLAG        @Y30LB33
         DC    Y(STE0915B-STE0915A)    TEXT LENGTH             @Y30LB33
         DC    Y(STE0915A-TXT09A)      TEXT OFFSET             @Y30LB33
         DC    H'1'                    PRINT COLUMN            @Y30LB33
         DC    Y(STE0915B-STE0915A)     PRINT FIELD LENGTH     @Y30LB33
         DC    H'0'                    CONVERSION FLAGS        @Y30LB33
*                                                              @Y30LB33
*        OWNER LINE                                            @Y30LB33
*                                                              @Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                @Y30LB33
         DC    X'4000'                 SPACE CONTROL FLAG      @Y30LB33
         DC    H'2'                    SPACING FACTOR          @Y30LB33
         DC    C'R '                   SPACING TYPE            @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT SUB-STRUCTURE                                    @Y30LB33
         DC    X'0400'                 STATIC TEXT FLAG        @Y30LB33
         DC    Y(STE0916B-STE0916A)    TEXT LENGTH             @Y30LB33
         DC    Y(STE0916A-TXT09A)      TEXT OFFSET             @Y30LB33
         DC    H'1'                    PRINT COLUMN            @Y30LB33
         DC    Y(STE0916B-STE0916A)    PRINT FIELD LENGTH      @Y30LB33
         DC    H'0'                    CONVERSION FLAGS        @Y30LB33
*                                                              @G24LB37
*        RESERVED SPACE %                                      @G24LB37
*                                                              @G24LB37
* SPACING CONTROL SUB-STRUCTURE                                @G24LB37
         DC    X'4000'                 SPACE CONTROL FLAG      @G24LB37
         DC    H'2'                    SPACING FACTOR          @G24LB37
         DC    C'R '                   SPACING TYPE            @G24LB37
         SPACE 1                                               @G24LB37
* STATIC TEXT SUB-STRUCTURE                                    @G24LB37
         DC    X'0400'                 STATIC TEXT FLAG        @G24LB37
         DC    Y(STE0916D-STE0916C)    TEXT LENGTH             @G24LB37
         DC    Y(STE0916C-TXT09A)      TEXT OFFSET             @G24LB37
         DC    H'1'                    PRINT COLUMN            @G24LB37
         DC    Y(STE0916D-STE0916C)    PRINT FIELD LENGTH      @G24LB37
         DC    H'0'                    CONVERSION FLAGS        @G24LB37
         SPACE 1                                               @G24LB37
* SPACING CONTROL SUB-STRUCTURE                                @G24LB37
         DC    X'4000'                 SPACE CONTROL FLAG      @G24LB37
         DC    H'1'                    SPACING FACTOR          @G24LB37
         DC    C'R '                   SPACING TYPE            @G24LB37
         SPACE 1                                               @G24LB37
* STATIC TEXT SUB-STRUCTURE                                    @G24LB37
         DC    X'0400'                 STATIC TEXT FLAG        @G24LB37
         DC    Y(STE0916F-STE0916E)    TEXT LENGTH             @G24LB37
         DC    Y(STE0916E-TXT09A)      TEXT OFFSET             @G24LB37
         DC    H'21'                   PRINT COLUMN            @G24LB37
         DC    Y(STE0916F-STE0916E)    PRINT FIELD LENGTH      @G24LB37
         DC    H'0'                    CONVERSION FLAGS        @G24LB37
*                                                              #Y30LB33
*        RETENTION PERIOD                                      #Y30LB33
*                                                              #Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                #Y30LB33
         DC    X'4000'                 SPACE CONTROL FLAG      #Y30LB33
         DC    H'2'                    SPACING FACTOR          @Y30LB33
         DC    C'R '                   SPACING TYPE            @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT SUB-STRUCTURE                                    @Y30LB33
         DC    X'0400'                 STATIC TEXT FLAG        @Y30LB33
         DC    Y(STE0917B-STE0917A)    TEXT LENGTH             @Y30LB33
         DC    Y(STE0917A-TXT09A)      TEXT OFFSET             @Y30LB33
         DC    H'1'                    PRINT COLUMN            @Y30LB33
         DC    Y(STE0917B-STE0917A)    PRINT FIELD LENGTH      @Y30LB33
         DC    H'0'                    CONVERSION FLAGS        @Y30LB33
*                                                              @Y30LB33
*        SPACE DISPOSITION LINE                                @Y30LB33
*                                                              @Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                @Y30LB33
         DC    X'4000'                 SPACE CONTROL FLAG      @Y30LB33
         DC    H'2'                    SPACING FACTOR          @Y30LB33
         DC    C'R '                   SPACING TYPE            @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT SUB-STRUCTURE                                    @Y30LB33
         DC    X'0400'                 STATIC TEXT FLAG        @Y30LB33
         DC    Y(STE0918B-STE0918A)    TEXT LENGTH             @Y30LB33
         DC    Y(STE0918A-TXT09A)      TEXT OFFSET             @Y30LB33
         DC    H'1'                    PRINT COLUMN            @Y30LB33
         DC    Y(STE0918B-STE0918A)    PRINT FIELD LENGTH      @Y30LB33
         DC    H'0'                    CONVERSION FLAGS        @Y30LB33
         SPACE 1                                               @Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                @Y30LB33
         DC    X'4000'                 SPACE CONTROL FLAG      @Y30LB33
         DC    H'1'                    SPACING FACTOR          @Y30LB33
         DC    C'R '                   SPACING TYPE            @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT SUB-STRUCTURE                                    @Y30LB33
         DC    X'0400'                 STATIC TEXT FLAG        @Y30LB33
         DC    Y(STE0918D-STE0918C)    TEXT LENGTH             @Y30LB33
         DC    Y(STE0918C-TXT09A)      TEXT OFFSET             @Y30LB33
         DC    H'24'                   PRINT COLUMN            @Y30LB33
         DC    Y(STE0918D-STE0918C)    PRINT FIELD LENGTH      @Y30LB33
         DC    H'0'                    CONVERSION FLAGS        @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT SUB-STRUCTURE                                    @Y30LB33
         DC    X'0400'                 STATIC TEXT FLAG        @Y30LB33
         DC    Y(STE0918F-STE0918E)    TEXT LENGTH             @Y30LB33
         DC    Y(STE0918E-TXT09A)      TEXT OFFSET             @Y30LB33
         DC    H'61'                   PRINT COLUMN            @Y30LB33
         DC    Y(STE0918F-STE0918E)    PRINT FIELD LENGTH      @Y30LB33
         DC    H'0'                    CONVERSION FLAGS        @Y30LB33
*                                                              @Y30LB33
*        STATE LINE                                            @Y30LB33
*                                                              @Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                @Y30LB33
         DC    X'4000'                 SPACE CONTROL FLAG      @Y30LB33
         DC    H'2'                    SPACING FACTOR          @Y30LB33
         DC    C'R '                   SPACING TYPE            @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT SUB-STRUCTURE                                    @Y30LB33
         DC    X'0400'                 STATIC TEXT FLAG        @Y30LB33
         DC    Y(STE0919B-STE0919A)    TEXT LENGTH             @Y30LB33
         DC    Y(STE0919A-TXT09A)      TEXT OFFSET             @Y30LB33
         DC    H'1'                    PRINT COLUMN            @Y30LB33
         DC    Y(STE0919B-STE0919A)    PRINT FIELD LENGTH      @Y30LB33
         DC    H'0'                    CONVERSION FLAGS        @Y30LB33
         SPACE 1                                               @Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                @Y30LB33
         DC    X'4000'                 SPACE CONTROL FLAG      @Y30LB33
         DC    H'1'                    SPACING FACTOR          @Y30LB33
         DC    C'R '                   SPACING TYPE            @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT SUB-STRUCTURE                                    @Y30LB33
         DC    X'0400'                 STATIC TEXT FLAG        @Y30LB33
         DC    Y(STE0919D-STE0919C)    TEXT LENGTH             @Y30LB33
         DC    Y(STE0919C-TXT09A)      TEXT OFFSET             @Y30LB33
         DC    H'24'                   PRINT COLUMN            @Y30LB33
         DC    Y(STE0919D-STE0919C)    PRINT FIELD LENGTH      @Y30LB33
         DC    H'0'                    CONVERSION FLAGS        @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT SUB-STRUCTURE                                    @Y30LB33
         DC    X'0400'                 STATIC TEXT FLAG        @Y30LB33
         DC    Y(STE0919F-STE0919E)    TEXT LENGTH             @Y30LB33
         DC    Y(STE0919E-TXT09A)      TEXT OFFSET             @Y30LB33
         DC    H'61'                   PRINT COLUMN            @Y30LB33
         DC    Y(STE0919F-STE0919E)    PRINT FIELD LENGTH      @Y30LB33
         DC    H'0'                    CONVERSION FLAGS        @Y30LB33
         SPACE 1                                               @ZDR2056
* SPACING CONTROL SUB-STRUCTURE                                @ZDR2056
         DC    X'4000'                 SPACE CONTROL FLAG      @ZDR2056
         DC    H'1'                    SPACING FACTOR          @ZDR2056
         DC    C'R '                   SPACING TYPE            @ZDR2056
         SPACE 1                                               @ZDR2056
* STATIC TEXT SUB-STRUCTURE                                    @ZDR2056
         DC    X'0400'                 STATIC TEXT FLAG        @ZDR2056
         DC    Y(STE0919H-STE0919G)    TEXT LENGTH             @ZDR2056
         DC    Y(STE0919G-TXT09A)      TEXT OFFSET             @ZDR2056
         DC    H'24'                   PRINT COLUMN            @ZDR2056
         DC    Y(STE0919H-STE0919G)    PRINT FIELD LENGTH      @ZDR2056
         DC    H'0'                    CONVERSION FLAGS        @ZDR2056
* SPACING CONTROL SUB-STRUCTURE                                @ZDR2056
         DC    X'4000'                 SPACE CONTROL FLAG      @ZDR2056
         DC    H'1'                    SPACING FACTOR          @ZDR2056
         DC    C'E '                   SPACING TYPE            @ZDR2056
         SPACE 1                                               @ZDR2056
* STATIC TEXT SUB-STRUCTURE                                    @ZDR2056
         DC    X'0400'                 STATIC TEXT FLAG        @ZDR2056
         DC    Y(STE091B-STE091A)      TEXT LENGTH             @ZDR2056
         DC    Y(STE091A-TXT09A)       TEXT OFFSET             @ZDR2056
         DC    H'48'                   PRINT COLUMN            @ZDR2056
         DC    Y(STE091B-STE091A)      PRINT FIELD LENGTH      @ZDR2056
         DC    H'0'                    CONVERSION              @ZDR2056
*                                                              @ZDR2056
*        COLUMN DESCRIPTIONS                                   @ZDR2056
*                                                              @ZDR2056
* SPACING CONTROL SUB-STRUCTURE                                @ZDR2056
         DC    X'4000'                 SPACE CONTROL FLAG      @ZDR2056
         DC    H'1'                    SPACING FACTOR          @ZDR2056
         DC    C'R '                   SPACING TYPE            @ZDR2056
         SPACE 1                                               @ZDR2056
* STATIC TEXT SUB-STRUCTURE                                    @ZDR2056
         DC    X'0400'                 STATIC TEXT FLAG        @ZDR2056
         DC    Y(STE092B-STE092A)      TEXT LENGTH             @ZDR2056
         DC    Y(STE092A-TXT09A)       TEXT OFFSET             @ZDR2056
         DC    H'1'                    PRINT COLUMN            @ZDR2056
         DC    Y(STE092B-STE092A)      PRINT FIELD LENGTH      @ZDR2056
         DC    H'0'                    CONVERSION              @ZDR2056
*                                                              #Y30LB33
*        VOLUME TYPE LINE                                      #Y30LB33
*                                                              #Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                #Y30LB33
         DC    X'4000'                 SPACE CONTROL FLAG      #Y30LB33
         DC    H'2'                    SPACING FACTOR          #Y30LB33
         DC    C'R '                   SPACING TYPE            #Y30LB33
         SPACE 1                                               #Y30LB33
* STATIC TEXT SUB-STRUCTURE                                    #Y30LB33
         DC    X'0400'                 STATIC TEXT FLAG        @Y30LB33
         DC    Y(STE0920B-STE0920A)    TEXT LENGTH             @Y30LB33
         DC    Y(STE0920A-TXT09A)      TEXT OFFSET             @Y30LB33
         DC    H'1'                    PRINT COLUMN            @Y30LB33
         DC    Y(STE0920B-STE0920A)    PRINT FIELD LENGTH      @Y30LB33
         DC    H'0'                    CONVERSION FLAGS        @Y30LB33
         SPACE 1                                               @Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                @Y30LB33
         DC    X'4000'                 SPACE CONTROL FLAG      @Y30LB33
         DC    H'1'                    SPACING FACTOR          @Y30LB33
         DC    C'R '                   SPACING TYPE            @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT SUB-STRUCTURE                                    @Y30LB33
         DC    X'0400'                 STATIC TEXT FLAG        @Y30LB33
         DC    Y(STE0921B-STE0921A)    TEXT LENGTH             @Y30LB33
         DC    Y(STE0921A-TXT09A)      TEXT OFFSET             @Y30LB33
         DC    H'24'                   PRINT COLUMN            @Y30LB33
         DC    Y(STE0921B-STE0921A)    PRINT FIELD LENGTH      @Y30LB33
         DC    H'0'                    CONVERSION FLAGS        @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT SUB-STRUCTURE                                    @Y30LB33
         DC    X'0400'                 STATIC TEXT FLAG        @Y30LB33
         DC    Y(STE0921F-STE0921E)    TEXT LENGTH             @Y30LB33
         DC    Y(STE0921E-TXT09A)      TEXT OFFSET             @Y30LB33
         DC    H'61'                   PRINT COLUMN            @Y30LB33
         DC    Y(STE0921F-STE0921E)    PRINT FIELD LENGTH      @Y30LB33
         DC    H'0'                    CONVERSION FLAGS        @Y30LB33
         SPACE 1                                               @Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                @Y30LB33
         DC    X'4000'                 SPACE CONTROL FLAG      @Y30LB33
         DC    H'1'                    SPACING FACTOR          @Y30LB33
         DC    C'R '                   SPACING TYPE            @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT SUB-STRUCTURE                                    @Y30LB33
         DC    X'0400'                 STATIC TEXT FLAG        @Y30LB33
         DC    Y(STE0921D-STE0921C)    TEXT LENGTH             @Y30LB33
         DC    Y(STE0921C-TXT09A)      TEXT OFFSET             @Y30LB33
         DC    H'24'                   PRINT COLUMN            @Y30LB33
         DC    Y(STE0921D-STE0921C)    PRINT FIELD LENGTH      @Y30LB33
         DC    H'0'                    CONVERSION FLAGS        @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT SUB-STRUCTURE                                    @Y30LB33
         DC    X'0400'                 STATIC TEXT FLAG        @Y30LB33
         DC    Y(STE0921H-STE0921G)    TEXT LENGTH             @Y30LB33
         DC    Y(STE0921G-TXT09A)      TEXT OFFSET             @Y30LB33
         DC    H'61'                   PRINT COLUMN            @Y30LB33
         DC    Y(STE0921H-STE0921G)    PRINT FIELD LENGTH      @Y30LB33
         DC    H'0'                    CONVERSION FLAGS        @Y30LB33
         SPACE 1                                               @ZDR2056
* SPACING CONTROL SUB-STRUCTURE                                @ZDR2056
         DC    X'4000'                 SPACE CONTROL FLAG      @ZDR2056
         DC    H'1'                    SPACING FACTOR          @ZDR2056
         DC    C'R '                   SPACING TYPE            @ZDR2056
         SPACE 1                                               @ZDR2056
* STATIC TEXT SUB-STRUCTURE                                    @ZDR2056
         DC    X'0400'                 STATIC TEXT FLAG        @ZDR2056
         DC    Y(STE0921L-STE0921K)    TEXT LENGTH             @ZDR2056
         DC    Y(STE0921K-TXT09A)      TEXT OFFSET             @ZDR2056
         DC    H'31'                   PRINT COLUMN            @ZDR2056
         DC    Y(STE0921L-STE0921K)    PRINT FIELD LENGTH      @ZDR2056
         DC    H'0'                    CONVERSION FLAGS        @ZDR2056
         SPACE 1                                               @ZDR2056
* SPACING CONTROL SUB-STRUCTURE                                @ZDR2056
         DC    X'4000'                 SPACE CONTROL FLAG      @ZDR2056
         DC    H'1'                    SPACING FACTOR          @ZDR2056
         DC    C'R '                   SPACING TYPE            @ZDR2056
         SPACE 1                                               @ZDR2056
* STATIC TEXT SUB-STRUCTURE                                    @ZDR2056
         DC    X'0400'                 STATIC TEXT FLAG        @ZDR2056
         DC    Y(STE0921J-STE0921I)    TEXT LENGTH             @ZDR2056
         DC    Y(STE0921I-TXT09A)      TEXT OFFSET             @ZDR2056
         DC    H'24'                   PRINT COLUMN            @ZDR2056
         DC    Y(STE0921J-STE0921I)    PRINT FIELD LENGTH      @ZDR2056
         DC    H'0'                    CONVERSION FLAGS        @ZDR2056
*                                                              #Y30LB33
*        VOLUME LINE                                           #Y30LB33
*                                                              #Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                #Y30LB33
         DC    X'4000'                 SPACE CONTROL FLAG      #Y30LB33
         DC    H'2'                    SPACING FACTOR          #Y30LB33
         DC    C'R '                   SPACING TYPE            #Y30LB33
         SPACE 1                                               #Y30LB33
* STATIC TEXT SUB-STRUCTURE                                    #Y30LB33
         DC    X'8400'                 STATIC TEXT FLAG        #Y30LB33
         DC    Y(STE0922B-STE0922A)    TEXT LENGTH             #Y30LB33
         DC    Y(STE0922A-TXT09A)      TEXT OFFSET             #Y30LB33
         DC    H'1'                    PRINT COLUMN            #Y30LB33
         DC    Y(STE0922B-STE0922A)    PRINT FIELD LENGTH      #Y30LB33
         DC    H'0'                    CONVERSION FLAGS        #Y30LB33
         SPACE 1                                               #Y30LB33
* STATIC TEXT ENTRIES                                          #Y30LB33
STE091A  DC    C'LEGEND'                                       #Y30LB33
STE091B  EQU   *                                               @Y30LB33
STE092A  DC    C'-FIELD-             -DESCRIPTION-'            @Y30LB33
STE092B  EQU   *                                               @Y30LB33
STE093A  DC    C'ADDRESS             '                         @Y30LB33
         DC    C'ADDRESS OF THE GROUP OWNER'                   @Y30LB33
STE093B  EQU   *                                               @Y30LB33
STE094A  DC    C'ALLOCN DEFAULT      '                         @Y30LB33
         DC    C'SPACE ALLOCATION DEFAULTS FOR DATA SETS'      @Y30LB33
         DC    C' IN CYLINDERS'                                @G24LB37
STE094B  EQU   *                                               @Y30LB33
STE094C  DC    C'PRI - PRIMARY ALLOCATION'                     @G24LB37
STE094D  EQU   *                                               @Y30LB33
STE094E  DC    C'SEC - SECONDARY ALLOCATION'                   @G24LB37
STE094F  EQU   *                                               @Y30LB33
STE095A  DC    C'ATTR                '                         @Y30LB33
         DC    C'ATTRIBUTES OF THE VOLUME INDICATED BY '       @Y30LB33
         DC    C'EITHER A CHARACTER IDENTIFIER IN THE COLUMN ' @Y30LB33
         DC    C'OR A BLANK'                                   @Y30LB33
STE095B  EQU   *                                               @Y30LB33
STE095C  DC    C'B - BIND, BLANK FOR NOBIND'                   @Y30LB33
STE095D  EQU   *                                               @Y30LB33
STE095E  DC    C'R - READONLY, BLANK FOR READWRITE'            @Y30LB33
STE095F  EQU   *                                               @Y30LB33
STE095G  DC    C'D - DASDERASE, BLANK FOR NODASDERASE'         @Y30LB33
STE095H  EQU   *                                               @Y30LB33
STE095I  DC    C'E - EXCLUSIVE, BLANK FOR SHARED'              @Y30LB33
STE095J  EQU   *                                               @Y30LB33
STE096A  DC    C'CARTRIDGE 1         '                         @Y30LB33
         DC    C'SERIAL NUMBER OF THE FIRST CARTRIDGE OF '     @Y30LB33
         DC    C'THE VOLUME OR COPY'                           @Y30LB33
STE096B  EQU   *                                               @Y30LB33
STE097A  DC    C'CARTRIDGE 2         '                         @Y30LB33
         DC    C'SERIAL NUMBER OF THE SECOND CARTRIDGE OF '    @Y30LB33
         DC    C'THE VOLUME OR COPY'                           @Y30LB33
STE097B  EQU   *                                               @Y30LB33
STE097C  DC    C'CONCUR USERS        '                         @G24LB37
         DC    C'MAXIMUM DESIRED CONCURRENT ALLOCATIONS PE'    @G24LB37
         DC    C'R HOST TO A VOLUME WITHIN A GROUP'            @G24LB37
STE097D  EQU   *                                               @G24LB37
STE098A  DC    C'COPY DATE           '                         #Y30LB33
         DC    C'CREATION DATE OF THE COPY AND ITS COPY '      #Y30LB33
         DC    C'NUMBER FOR THAT DATE'                         #Y30LB33
STE098B  EQU   *                                               #Y30LB33
STE099A  DC    C'DESCRIPTION         '                         #Y30LB33
         DC    C'DESCRIPTION OF THE GROUP, VOLUME, OR COPY'    #Y30LB33
STE099B  EQU   *                                               #Y30LB33
STE0910A DC    C'EJECT DATE          '                         #Y30LB33
         DC    C'DATE THE VOLUME OR COPY WAS EJECTED'          #Y30LB33
         DC    C' FROM THE MASS STORAGE FACILITY'              #Y30LB33
STE0910B EQU   *                                               #Y30LB33
STE0911A DC    C'FREE SPACE THOLD %  '                         #Y30LB33
         DC    C'THE NUMBER OF CYLINDERS TO REMAIN UNUSED IN ' #Y30LB33
         DC    C'THE GROUP,'                                   #Y30LB33
STE0911B EQU   *                                               #Y30LB33
STE0911C DC    C'EXPRESSED AS A PERCENTAGE OF THE '            #Y30LB33
         DC    C'TOTAL NUMBER OF CYLINDERS ON THE ACTIVE '     #Y30LB33
         DC    C'GENERAL VOLUMES'                              #Y30LB33
STE0911D EQU   *                                               #Y30LB33
STE0913A DC    C'GROUP               '                         #Y30LB33
         DC    C'GROUP NAME'                                   #Y30LB33
STE0913B EQU   *                                               #Y30LB33
STE0914A DC    C'LOCATION            '                         #Y30LB33
         DC    C'LOCATION OF THE VOLUME OR COPY IF EJECTED;'   #Y30LB33
         DC    C' MSF ID OF EACH CARTRIDGE IF NOT EJECTED'     #Y30LB33
STE0914B EQU   *                                               #Y30LB33
STE0999A DC    C'                    '                         @ZM01010
         DC    C'   REASSIGNED - CARTRIDGE IS NO LONGER ASSIG' @ZM01010
         DC    C'NED TO THE VOLUME'                            @ZM01010
STE0999B EQU   *                                               @ZM01010
STE0998A DC    C'                    '                         @ZM01010
         DC    C'   NOT IN MSF - CARTRIDGE HAS NOT BEEN REENT' @ZM01010
         DC    C'ERED INTO MSF'                                @ZM01010
STE0998B EQU   *                                               @ZM01010
STE0915A DC    C'MAX BKUP            '                         #Y30LB33
         DC    C'MAXIMUM NUMBER OF BACKUP COPIES ALLOWED'      #Y30LB33
         DC    C' FOR THE VOLUME'                              #Y30LB33
STE0915B EQU   *                                               #Y30LB33
STE0916A DC    C'OWNER               '                         #Y30LB33
         DC    C'OWNER NAME OF THE GROUP OR VOLUME'            #Y30LB33
STE0916B EQU   *                                               #Y30LB33
STE0916C DC    C'RESERVED SPACE %    '                         @G24LB37
         DC    C'THE NUMBER OF CYLINDERS TO REMAIN UNUSED ON ' @G24LB37
         DC    C'EACH VOLUME,'                                 @G24LB37
STE0916D EQU   *                                               @G24LB37
STE0916E DC    C'EXPRESSED AS A PERCENTAGE OF THE '            @G24LB37
         DC    C'TOTAL NUMBER OF CYLINDERS ON EACH ACTIVE '    @G24LB37
         DC    C'GENERAL VOLUME'                               @G24LB37
STE0916F EQU   *                                               @G24LB37
STE0917A DC    C'RETPD               '                         #Y30LB33
         DC    C'RETENTION PERIOD, IN NUMBER OF DAYS,'         #YM02885
         DC    C' FOR ACTIVE GENERAL VOLUMES'                  #YM02885
STE0917B EQU   *                                               #Y30LB33
STE0918A DC    C'SPACE DISP          '                         #Y30LB33
         DC    C'SPACE DISPOSITION DEFAULTS FOR DATA SETS'     #Y30LB33
STE0918B EQU   *                                               #Y30LB33
STE0918C DC    C'RLSE  - RELEASE'                              #Y30LB33
STE0918D EQU   *                                               #Y30LB33
STE0918E DC    C'NRLSE - NORELEASE'                            #Y30LB33
STE0918F EQU   *                                               #Y30LB33
STE0919A DC    C'STATE               '                         #Y30LB33
         DC    C'STATUS OF THE VOLUME'                         #Y30LB33
STE0919B EQU   *                                               #Y30LB33
STE0919C DC    C'ACTIV - ACTIVE, MOUNTABLE'                    #Y30LB33
STE0919D EQU   *                                               #Y30LB33
STE0919E DC    C'INACT - INACTIVE, NONMOUNTABLE'               #Y30LB33
STE0919F EQU   *                                               #Y30LB33
STE0919G DC    C'PHOLD - PLACE HOLDER'                         @ZDR2056
STE0919H EQU   *                                               @ZDR2056
STE0920A DC    C'VOL TYPE            '                         #Y30LB33
         DC    C'TYPE OF VOLUME OR ITS COPIES;'                @ZM01010
         DC    C' BLANK IF NON-GROUPED BASE VOLUME'            @ZM01010
STE0920B EQU   *                                               #Y30LB33
STE0921A DC    C'BKUP - COPY, BACKUP'                          #Y30LB33
STE0921B EQU   *                                               #Y30LB33
STE0921C DC    C'COPY - COPY, NON-BACKUP,'                     @ZDR2056
STE0921D EQU   *                                               #Y30LB33
STE0921E DC    C'GEN  - GENERAL'                               #Y30LB33
STE0921F EQU   *                                               #Y30LB33
STE0921G DC    C'RSTR - RESTRICTED'                            #Y30LB33
STE0921H EQU   *                                               #Y30LB33
STE0921I DC    C'BASE - BASE, PLACE HOLDER'                    @ZDR2056
STE0921J EQU   *                                               @ZDR2056
STE0921K DC    C'PLACE HOLDER'                                 @ZDR2056
STE0921L EQU   *                                               @ZDR2056
STE0922A DC    C'VOLUME              '                         #Y30LB33
         DC    C'VOLUME SERIAL NUMBER'                         #Y30LB33
STE0922B EQU   *                                               #Y30LB33
TXT09B   EQU   *                                               #Y30LB33
         EJECT                                                 #Y30LB33
************************************************************   #Y30LB33
*                                                              #Y30LB33
*        INCOMPLETE COPY OPERATION LINE                        #Y30LB33
*                                                              #Y30LB33
************************************************************   #Y30LB33
TXT10    DC    Y(TXT10B-TXT10A)        ENTRY LENGTH            #Y30LB33
         DC    X'0000'                 FLAG                    #Y30LB33
         SPACE 1                                               #Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                #Y30LB33
TXT10A   DC    X'4000'                 SPACE CONTROL FLAG      #Y30LB33
         DC    H'1'                    SPACING FACTOR          #Y30LB33
         DC    C'R '                   SPACING TYPE            #Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT SUB-STRUCTURE                                    @Y30LB33
         DC    X'8400'                 STATIC TEXT FLAG        @Y30LB33
         DC    Y(STE101B-STE101A)      TEXT LENGTH             @Y30LB33
         DC    Y(STE101A-TXT10A)       TEXT OFFSET             @Y30LB33
         DC    H'1'                    PRINT COLUMN            @Y30LB33
         DC    Y(STE101B-STE101A)      PRINT FIELD LENGTH      @Y30LB33
         DC    H'0'                    CONVERSION FLAGS        @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT ENTRIES                                          @Y30LB33
STE101A  DC    C'NOTE:  '                                      @YM02885
         DC    C'A PRIOR COPY OPERATION FAILED FOR ABOVE'      @ZM04314
         DC    C' VOLUME'                                      @ZM04314
STE101B  EQU   *                                               @Y30LB33
TXT10B   EQU   *                                               @Y30LB33
         EJECT                                                 @Y30LB33
************************************************************   @Y30LB33
*                                                              @Y30LB33
*        INCOMPLETE CREATE OPERATION LINE                      @Y30LB33
*                                                              @Y30LB33
************************************************************   @Y30LB33
TXT11    DC    Y(TXT11B-TXT11A)        ENTRY LENGTH            @Y30LB33
         DC    X'0000'                 FLAG                    @Y30LB33
         SPACE 1                                               @Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                @Y30LB33
TXT11A   DC    X'4000'                 SPACE CONTROL FLAG      @Y30LB33
         DC    H'1'                    SPACING FACTOR          @Y30LB33
         DC    C'R '                   SPACING TYPE            @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT SUB-STRUCTURE                                    @Y30LB33
         DC    X'8400'                 STATIC TEXT FLAG        @Y30LB33
         DC    Y(STE111B-STE111A)      TEXT LENGTH             @Y30LB33
         DC    Y(STE111A-TXT11A)       TEXT OFFSET             @Y30LB33
         DC    H'1'                    PRINT COLUMN            @Y30LB33
         DC    Y(STE111B-STE111A)      PRINT FIELD LENGTH      @Y30LB33
         DC    H'0'                    CONVERSION FLAGS        @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT ENTRIES                                          @Y30LB33
STE111A  DC    C'NOTE:  '                                      @YM02885
         DC    C'A PRIOR CREATE OPERATION FAILED FOR ABOVE'    @ZM04314
         DC    C' VOLUME'                                      @Y30LB33
STE111B  EQU   *                                               @Y30LB33
TXT11B   EQU   *                                               @Y30LB33
         EJECT                                                 @Y30LB33
************************************************************   @Y30LB33
*                                                              @Y30LB33
*        LABEL MISMATCH LINE                                   @Y30LB33
*                                                              @Y30LB33
************************************************************   @Y30LB33
TXT12    DC    Y(TXT12B-TXT12A)        ENTRY LENGTH            @Y30LB33
         DC    X'0000'                 FLAG                    @Y30LB33
         SPACE 1                                               @Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                @Y30LB33
TXT12A   DC    X'4000'                 SPACE CONTROL FLAG      @Y30LB33
         DC    H'1'                    SPACING FACTOR          @Y30LB33
         DC    C'R '                   SPACING TYPE            @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT SUB-STRUCTURE                                    @Y30LB33
         DC    X'0400'                 STATIC TEXT FLAG        @Y30LB33
         DC    Y(STE121B-STE121A)      TEXT LENGTH             @Y30LB33
         DC    Y(STE121A-TXT12A)       TEXT OFFSET             @Y30LB33
         DC    H'1'                    PRINT COLUMN            @Y30LB33
         DC    Y(STE121B-STE121A)      PRINT FIELD LENGTH      @Y30LB33
         DC    H'0'                    CONVERSION FLAGS        @Y30LB33
*                                                              @Y30LB33
*        VOLUME FIELD                                          @Y30LB33
*                                                              @Y30LB33
* BLOCK DATA SUB-STRUCTURE                                     @Y30LB33
         DC    X'9000'                                         @Y30LB33
         DC    H'06,00,53,06,00'       ILN,IP,OC,OL,CV         @XM04314
*                                                              @Y30LB33
* STATIC TEXT ENTRIES                                          @Y30LB33
STE121A  DC    C'NOTE:  '                                      @YM02885
         DC    C'PRIOR RENAME FAILED FOR ABOVE VOLUME;'        @ZM04314
         DC    C' SERIAL        RECORDED IN VOL LABEL'         @YM02885
STE121B  EQU   *                                               @Y30LB33
TXT12B   EQU   *                                               @Y30LB33
         EJECT                                                 @Y30LB33
************************************************************   @Y30LB33
*                                                              @Y30LB33
*        USAGE LEGEND PAGE LAYOUT                              @Y30LB33
*                                                              @Y30LB33
************************************************************   @Y30LB33
TXT13    DC    Y(TXT13B-TXT13A)        ENTRY LENGTH            @Y30LB33
         DC    X'0000'                 FLAG                    @Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                @Y30LB33
TXT13A   DC    X'4000'                 SPACE CONTROL FLAG      @Y30LB33
         DC    H'1'                    SPACING FACTOR          @Y30LB33
         DC    C'E '                   SPACING TYPE            @Y30LB33
*                                                              @Y30LB33
*        TITLE LINE                                            @Y30LB33
*                                                              @Y30LB33
* STATIC TEXT SUB-STRUCTURE                                    @Y30LB33
         DC    X'0400'                 STATIC TEXT FLAG        @Y30LB33
         DC    Y(STE131B-STE131A)      TEXT LENGTH             @Y30LB33
         DC    Y(STE131A-TXT13A)       TEXT OFFSET             @Y30LB33
         DC    H'48'                   PRINT COLUMN            @Y30LB33
         DC    Y(STE131B-STE131A)      PRINT FIELD LENGTH      @Y30LB33
         DC    H'0'                    CONVERSION FLAGS        @Y30LB33
*                                                              @Y30LB33
*        COLUMN DESCRIPTIONS                                   @Y30LB33
*                                                              @Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                @Y30LB33
         DC    X'4000'                 SPACE CONTROL FLAG      @Y30LB33
         DC    H'2'                    SPACING FACTOR          @Y30LB33
         DC    C'R '                   SPACING TYPE            @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT SUB-STRUCTURE                                    @Y30LB33
         DC    X'0400'                 STATIC TEXT FLAG        @Y30LB33
         DC    Y(STE132B-STE132A)      TEXT LENGTH             @Y30LB33
         DC    Y(STE132A-TXT13A)       TEXT OFFSET             @Y30LB33
         DC    H'1'                    PRINT COLUMN            @Y30LB33
         DC    Y(STE132B-STE132A)      PRINT FIELD LENGTH      @Y30LB33
         DC    H'0'                    CONVERSION FLAGS        @Y30LB33
*                                                              @Y30LB33
*        ALLOCATION DEFAULT LINES                              @Y30LB33
*                                                              @Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                @Y30LB33
         DC    X'4000'                 SPACE CONTROL FLAG      @Y30LB33
         DC    H'2'                    SPACING FACTOR          @Y30LB33
         DC    C'R '                   SPACING TYPE            @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT SUB-STRUCTURE                                    @Y30LB33
         DC    X'0400'                 STATIC TEXT FLAG        @Y30LB33
         DC    Y(STE133B-STE133A)      TEXT LENGTH             @Y30LB33
         DC    Y(STE133A-TXT13A)       TEXT OFFSET             @Y30LB33
         DC    H'1'                    PRINT COLUMN            @Y30LB33
         DC    Y(STE133B-STE133A)      PRINT FIELD LENGTH      @Y30LB33
         DC    H'0'                    CONVERSION FLAGS        @Y30LB33
         SPACE 1                                               @Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                @Y30LB33
         DC    X'4000'                 SPACE CONTROL FLAG      @Y30LB33
         DC    H'1'                    SPACING FACTOR          @Y30LB33
         DC    C'R '                   SPACING TYPE            @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT SUB-STRUCTURE                                    @Y30LB33
         DC    X'0400'                 STATIC TEXT FLAG        @Y30LB33
         DC    Y(STE133D-STE133C)      TEXT LENGTH             @Y30LB33
         DC    Y(STE133C-TXT13A)       TEXT OFFSET             @Y30LB33
         DC    H'24'                   PRINT COLUMN            @Y30LB33
         DC    Y(STE133D-STE133C)      PRINT FIELD LENGTH      @Y30LB33
         DC    H'0'                    CONVERSION FLAGS        @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT SUB-STRUCTURE                                    @Y30LB33
         DC    X'0400'                 STATIC TEXT FLAG        @Y30LB33
         DC    Y(STE133F-STE133E)      TEXT LENGTH             @Y30LB33
         DC    Y(STE133E-TXT13A)       TEXT OFFSET             @Y30LB33
         DC    H'61'                   PRINT COLUMN            @G24LB37
         DC    Y(STE133F-STE133E)      PRINT FIELD LENGTH      @Y30LB33
         DC    H'0'                    CONVERSION FLAGS        @Y30LB33
*                                                              @G24LB37
*        CONCURRENT USERS LINE                                 @G24LB37
*                                                              @G24LB37
* SPACING CONTROL SUB-STRUCTURE                                @G24LB37
         DC    X'4000'                 SPACE CONTROL FLAG      @G24LB37
         DC    H'2'                    SPACING FACTOR          @G24LB37
         DC    C'R '                   SPACING TYPE            @G24LB37
         SPACE 1                                               @G24LB37
* STATIC TEXT SUB-STRUCTURE                                    @G24LB37
         DC    X'0400'                 STATIC TEXT FLAG        @G24LB37
         DC    Y(STE133H-STE133G)      TEXT LENGTH             @G24LB37
         DC    Y(STE133G-TXT13A)       TEXT OFFSET             @G24LB37
         DC    H'1'                    PRINT COLUMN            @G24LB37
         DC    Y(STE133H-STE133G)      PRINT FIELD LENGTH      @G24LB37
         DC    H'0'                    CONVERSION FLAGS        @G24LB37
*                                                              #Y30LB33
*        EXPIRATION DATE LINE                                  #Y30LB33
*                                                              #Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                #Y30LB33
         DC    X'4000'                 SPACE CONTROL FLAG      #Y30LB33
         DC    H'2'                    SPACING FACTOR          #Y30LB33
         DC    C'R '                   SPACING TYPE            @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT SUB-STRUCTURE                                    @Y30LB33
         DC    X'0400'                 STATIC TEXT FLAG        @Y30LB33
         DC    Y(STE134B-STE134A)      TEXT LENGTH             @Y30LB33
         DC    Y(STE134A-TXT13A)       TEXT OFFSET             @Y30LB33
         DC    H'1'                    PRINT COLUMN            @Y30LB33
         DC    Y(STE134B-STE134A)      PRINT FIELD LENGTH      @Y30LB33
         DC    H'0'                    CONVERSION FLAGS        @Y30LB33
*                                                              @Y30LB33
*        FREE EXTENTS LINE                                     @Y30LB33
*                                                              @Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                @Y30LB33
         DC    X'4000'                 SPACE CONTROL FLAG      @Y30LB33
         DC    H'2'                    SPACING FACTOR          @Y30LB33
         DC    C'R '                   SPACING TYPE            @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT SUB-STRUCTURE                                    @Y30LB33
         DC    X'0400'                 STATIC TEXT FLAG        @Y30LB33
         DC    Y(STE135B-STE135A)      TEXT LENGTH             @Y30LB33
         DC    Y(STE135A-TXT13A)       TEXT OFFSET             @Y30LB33
         DC    H'1'                    PRINT COLUMN            @Y30LB33
         DC    Y(STE135B-STE135A)      PRINT FIELD LENGTH      @Y30LB33
         DC    H'0'                    CONVERSION FLAGS        @Y30LB33
         SPACE 1                                               @Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                @Y30LB33
         DC    X'4000'                 SPACE CONTROL FLAG      @Y30LB33
         DC    H'1'                    SPACING FACTOR          @Y30LB33
         DC    C'R '                   SPACING TYPE            @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT SUB-STRUCTURE                                    @Y30LB33
         DC    X'0400'                 STATIC TEXT FLAG        @Y30LB33
         DC    Y(STE135D-STE135C)      TEXT LENGTH             @Y30LB33
         DC    Y(STE135C-TXT13A)       TEXT OFFSET             @Y30LB33
         DC    H'24'                   PRINT COLUMN            @Y30LB33
         DC    Y(STE135D-STE135C)      PRINT FIELD LENGTH      @Y30LB33
         DC    H'0'                    CONVERSION FLAGS        @Y30LB33
         SPACE 1                                               @Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                @Y30LB33
         DC    X'4000'                 SPACE CONTROL FLAG      @Y30LB33
         DC    H'1'                    SPACING FACTOR          @Y30LB33
         DC    C'R '                   SPACING TYPE            @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT SUB-STRUCTURE                                    @Y30LB33
         DC    X'0400'                 STATIC TEXT FLAG        @Y30LB33
         DC    Y(STE135F-STE135E)      TEXT LENGTH             @Y30LB33
         DC    Y(STE135E-TXT13A)       TEXT OFFSET             @Y30LB33
         DC    H'24'                   PRINT COLUMN            @Y30LB33
         DC    Y(STE135F-STE135E)      PRINT FIELD LENGTH      @Y30LB33
         DC    H'0'                    CONVERSION FLAGS        @Y30LB33
         SPACE 1                                               @Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                @Y30LB33
         DC    X'4000'                 SPACE CONTROL FLAG      @Y30LB33
         DC    H'1'                    SPACING FACTOR          @Y30LB33
         DC    C'R '                   SPACING TYPE            @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT SUB-STRUCTURE                                    @Y30LB33
         DC    X'0400'                 STATIC TEXT FLAG        @Y30LB33
         DC    Y(STE135H-STE135G)      TEXT LENGTH             @Y30LB33
         DC    Y(STE135G-TXT13A)       TEXT OFFSET             @Y30LB33
         DC    H'24'                   PRINT COLUMN            @Y30LB33
         DC    Y(STE135H-STE135G)      PRINT FIELD LENGTH      @Y30LB33
         DC    H'0'                    CONVERSION FLAGS        @Y30LB33
*                                                              #Y30LB33
*        FREE SPACE LINE                                       #Y30LB33
*                                                              #Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                #Y30LB33
         DC    X'4000'                 SPACE CONTROL FLAG      #Y30LB33
         DC    H'2'                    SPACING FACTOR          @Y30LB33
         DC    C'R '                   SPACING TYPE            @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT SUB-STRUCTURE                                    @Y30LB33
         DC    X'0400'                 STATIC TEXT FLAG        @Y30LB33
         DC    Y(STE137B-STE137A)      TEXT LENGTH             @Y30LB33
         DC    Y(STE137A-TXT13A)       TEXT OFFSET             @Y30LB33
         DC    H'1'                    PRINT COLUMN            @Y30LB33
         DC    Y(STE137B-STE137A)      PRINT FIELD LENGTH      @Y30LB33
         DC    H'0'                    CONVERSION FLAGS        @Y30LB33
*                                                              @Y30LB33
*        FREE SPACE LINE 2                                     @Y30LB33
*                                                              @Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                @Y30LB33
         DC    X'4000'                 SPACE CONTROL FLAG      @Y30LB33
         DC    H'1'                    SPACING FACTOR          @Y30LB33
         DC    C'R '                   SPACING TYPE            @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT SUB-STRUCTURE                                    @Y30LB33
         DC    X'0400'                 STATIC TEXT FLAG        @Y30LB33
         DC    Y(STE137D-STE137C)      TEXT LENGTH             @Y30LB33
         DC    Y(STE137C-TXT13A)       TEXT OFFSET             @Y30LB33
         DC    H'21'                   PRINT COLUMN            @Y30LB33
         DC    Y(STE137D-STE137C)      PRINT FIELD LENGTH      @Y30LB33
         DC    H'0'                    CONVERSION FLAGS        @Y30LB33
*                                                              @Y30LB33
*        FREE SPACE THOLD % LINE 1                             @Y30LB33
*                                                              @Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                @Y30LB33
         DC    X'4000'                 SPACE CONTROL FLAG      @Y30LB33
         DC    H'2'                    SPACING FACTOR          @Y30LB33
         DC    C'R '                   SPACING TYPE            @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT SUB-STRUCTURE                                    @Y30LB33
         DC    X'0400'                 STATIC TEXT FLAG        @Y30LB33
         DC    Y(STE138B-STE138A)      TEXT LENGTH             @Y30LB33
         DC    Y(STE138A-TXT13A)       TEXT OFFSET             @Y30LB33
         DC    H'1'                    PRINT COLUMN            @Y30LB33
         DC    Y(STE138B-STE138A)      PRINT FIELD LENGTH      @Y30LB33
         DC    H'0'                    CONVERSION FLAGS        @Y30LB33
         SPACE 1                                               @Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                @Y30LB33
         DC    X'4000'                 SPACE CONTROL FLAG      @Y30LB33
         DC    H'1'                    SPACING FACTOR          @Y30LB33
         DC    C'R '                   SPACING TYPE            @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT SUB-STRUCTURE                                    @Y30LB33
         DC    X'0400'                 STATIC TEXT FLAG        @Y30LB33
         DC    Y(STE138D-STE138C)      TEXT LENGTH             @Y30LB33
         DC    Y(STE138C-TXT13A)       TEXT OFFSET             @Y30LB33
         DC    H'21'                   PRINT COLUMN            @Y30LB33
         DC    Y(STE138D-STE138C)      PRINT FIELD LENGTH      @Y30LB33
         DC    H'0'                    CONVERSION FLAGS        @Y30LB33
*                                                              @Y30LB33
*        GROUP LINE                                            @Y30LB33
*                                                              @Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                @Y30LB33
         DC    X'4000'                 SPACE CONTROL FLAG      @Y30LB33
         DC    H'2'                    SPACING FACTOR          @Y30LB33
         DC    C'R '                   SPACING TYPE            @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT SUB-STRUCTURE                                    @Y30LB33
         DC    X'0400'                 STATIC TEXT FLAG        @Y30LB33
         DC    Y(STE1310B-STE1310A)    TEXT LENGTH             @Y30LB33
         DC    Y(STE1310A-TXT13A)      TEXT OFFSET             @Y30LB33
         DC    H'1'                    PRINT COLUMN            @Y30LB33
         DC    Y(STE1310B-STE1310A)    PRINT FIELD LENGTH      @Y30LB33
         DC    H'0'                    CONVERSION FLAGS        @Y30LB33
*                                                              @Y30LB33
*        LAST MOUNT DATE LINE                                  @Y30LB33
*                                                              @Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                @Y30LB33
         DC    X'4000'                 SPACE CONTROL FLAG      @Y30LB33
         DC    H'2'                    SPACING FACTOR          @Y30LB33
         DC    C'R '                   SPACING TYPE            @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT SUB-STRUCTURE                                    @Y30LB33
         DC    X'0400'                 STATIC TEXT FLAG        @Y30LB33
         DC    Y(STE1311B-STE1311A)    TEXT LENGTH             @Y30LB33
         DC    Y(STE1311A-TXT13A)      TEXT OFFSET             @Y30LB33
         DC    H'1'                    PRINT COLUMN            @Y30LB33
         DC    Y(STE1311B-STE1311A)    PRINT FIELD LENGTH      @Y30LB33
         DC    H'0'                    CONVERSION FLAGS        @Y30LB33
*                                                              @G24LB37
*        MOUNTED LINE                                          @G24LB37
*                                                              @G24LB37
* SPACING CONTROL SUB-STRUCTURE                                @G24LB37
         DC    X'4000'                 SPACE CONTROL FLAG      @G24LB37
         DC    H'2'                    SPACING FACTOR          @G24LB37
         DC    C'R '                   SPACING TYPE            @G24LB37
         SPACE 1                                               @G24LB37
* STATIC TEXT SUB-STRUCTURE                                    @G24LB37
         DC    X'0400'                 STATIC TEXT FLAG        @G24LB37
         DC    Y(STE1311D-STE1311C)    TEXT LENGTH             @G24LB37
         DC    Y(STE1311C-TXT13A)      TEXT OFFSET             @G24LB37
         DC    H'1'                    PRINT COLUMN            @G24LB37
         DC    Y(STE1311D-STE1311C)    PRINT FIELD LENGTH      @G24LB37
         DC    H'0'                    CONVERSION FLAGS        @G24LB37
*                                                              @G24LB37
*        RESERVED SPACE %                                      @G24LB37
*                                                              @G24LB37
* SPACING CONTROL SUB-STRUCTURE                                @G24LB37
         DC    X'4000'                 SPACE CONTROL FLAG      @G24LB37
         DC    H'2'                    SPACING FACTOR          @G24LB37
         DC    C'R '                   SPACING TYPE            @G24LB37
         SPACE 1                                               @G24LB37
* STATIC TEXT SUB-STRUCTURE                                    @G24LB37
         DC    X'0400'                 STATIC TEXT FLAG        @G24LB37
         DC    Y(STE1311F-STE1311E)    TEXT LENGTH             @G24LB37
         DC    Y(STE1311E-TXT13A)      TEXT OFFSET             @G24LB37
         DC    H'1'                    PRINT COLUMN            @G24LB37
         DC    Y(STE1311F-STE1311E)    PRINT FIELD LENGTH      @G24LB37
         DC    H'0'                    CONVERSION FLAGS        @G24LB37
         SPACE 1                                               @G24LB37
* SPACING CONTROL SUB-STRUCTURE                                @G24LB37
         DC    X'4000'                 SPACE CONTROL FLAG      @G24LB37
         DC    H'1'                    SPACING FACTOR          @G24LB37
         DC    C'R '                   SPACING TYPE            @G24LB37
         SPACE 1                                               @G24LB37
* STATIC TEXT SUB-STRUCTURE                                    @G24LB37
         DC    X'0400'                 STATIC TEXT FLAG        @G24LB37
         DC    Y(STE1311H-STE1311G)    TEXT LENGTH             @G24LB37
         DC    Y(STE1311G-TXT13A)      TEXT OFFSET             @G24LB37
         DC    H'21'                   PRINT COLUMN            @G24LB37
         DC    Y(STE1311H-STE1311G)    PRINT FIELD LENGTH      @G24LB37
         DC    H'0'                    CONVERSION FLAGS        @G24LB37
*                                                              #Y30LB33
*        RETPD LINE                                            #Y30LB33
*                                                              #Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                #Y30LB33
         DC    X'4000'                 SPACE CONTROL FLAG      #Y30LB33
         DC    H'2'                    SPACING FACTOR          @Y30LB33
         DC    C'R '                   SPACING TYPE            @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT SUB-STRUCTURE                                    @Y30LB33
         DC    X'0400'                 STATIC TEXT FLAG        @Y30LB33
         DC    Y(STE1312B-STE1312A)    TEXT LENGTH             @Y30LB33
         DC    Y(STE1312A-TXT13A)      TEXT OFFSET             @Y30LB33
         DC    H'1'                    PRINT COLUMN            @Y30LB33
         DC    Y(STE1312B-STE1312A)     PRINT FIELD LENGTH     @Y30LB33
         DC    H'0'                    CONVERSION FLAGS        @Y30LB33
*                                                              @Y30LB33
*        SPACE DISP LINE                                       @Y30LB33
*                                                              @Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                @Y30LB33
         DC    X'4000'                 SPACE CONTROL FLAG      @Y30LB33
         DC    H'2'                    SPACING FACTOR          @Y30LB33
         DC    C'R '                   SPACING TYPE            @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT SUB-STRUCTURE                                    @Y30LB33
         DC    X'0400'                 STATIC TEXT FLAG        @Y30LB33
         DC    Y(STE1313B-STE1313A)    TEXT LENGTH             @Y30LB33
         DC    Y(STE1313A-TXT13A)      TEXT OFFSET             @Y30LB33
         DC    H'1'                    PRINT COLUMN            @Y30LB33
         DC    Y(STE1313B-STE1313A)    PRINT FIELD LENGTH      @Y30LB33
         DC    H'0'                    CONVERSION FLAGS        @Y30LB33
         SPACE 1                                               @Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                @Y30LB33
         DC    X'4000'                 SPACE CONTROL FLAG      @Y30LB33
         DC    H'1'                    SPACING FACTOR          @Y30LB33
         DC    C'R '                   SPACING TYPE            @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT SUB-STRUCTURE                                    @Y30LB33
         DC    X'0400'                 STATIC TEXT FLAG        @Y30LB33
         DC    Y(STE1313D-STE1313C)    TEXT LENGTH             @Y30LB33
         DC    Y(STE1313C-TXT13A)      TEXT OFFSET             @Y30LB33
         DC    H'24'                   PRINT COLUMN            @Y30LB33
         DC    Y(STE1313D-STE1313C)    PRINT FIELD LENGTH      @Y30LB33
         DC    H'0'                    CONVERSION FLAGS        @Y30LB33
         SPACE 1                                               @Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                @Y30LB33
         DC    X'4000'                 SPACE CONTROL FLAG      @Y30LB33
         DC    H'1'                    SPACING FACTOR          @Y30LB33
         DC    C'R '                   SPACING TYPE            @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT SUB-STRUCTURE                                    @Y30LB33
         DC    X'0400'                 STATIC TEXT FLAG        @Y30LB33
         DC    Y(STE1313F-STE1313E)    TEXT LENGTH             @Y30LB33
         DC    Y(STE1313E-TXT13A)      TEXT OFFSET             @Y30LB33
         DC    H'24'                   PRINT COLUMN            @Y30LB33
         DC    Y(STE1313F-STE1313E)    PRINT FIELD LENGTH      @Y30LB33
         DC    H'0'                    CONVERSION FLAGS        @Y30LB33
*                                                              #Y30LB33
*        SPACE DOWN LEVEL LINE                                 #Y30LB33
*                                                              #Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                #Y30LB33
         DC    X'4000'                 SPACE CONTROL FLAG      #Y30LB33
         DC    H'2'                    SPACING FACTOR          @Y30LB33
         DC    C'R '                   SPACING TYPE            @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT SUB-STRUCTURE                                    @Y30LB33
         DC    X'0400'                 STATIC TEXT FLAG        @Y30LB33
         DC    Y(STE1314B-STE1314A)    TEXT LENGTH             @Y30LB33
         DC    Y(STE1314A-TXT13A)      TEXT OFFSET             @Y30LB33
         DC    H'1'                    PRINT COLUMN            @Y30LB33
         DC    Y(STE1314B-STE1314A)    PRINT FIELD LENGTH      @Y30LB33
         DC    H'0'                    CONVERSION FLAGS        @Y30LB33
*                                                              @Y30LB33
*        TOTAL SPACE                                           @Y30LB33
*                                                              @Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                @Y30LB33
         DC    X'4000'                 SPACE CONTROL FLAG      @Y30LB33
         DC    H'2'                    SPACING FACTOR          @Y30LB33
         DC    C'R '                   SPACING TYPE            @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT SUB-STRUCTURE                                    @Y30LB33
         DC    X'0400'                 STATIC TEXT FLAG        @Y30LB33
         DC    Y(STE1315B-STE1315A)    TEXT LENGTH             @Y30LB33
         DC    Y(STE1315A-TXT13A)      TEXT OFFSET             @Y30LB33
         DC    H'1'                    PRINT COLUMN            @Y30LB33
         DC    Y(STE1315B-STE1315A)    PRINT FIELD LENGTH      @Y30LB33
         DC    H'0'                    CONVERSION FLAGS        @Y30LB33
*                                                              @Y30LB33
*        VOLUME LINE                                           @Y30LB33
*                                                              @Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                @Y30LB33
         DC    X'4000'                 SPACE CONTROL FLAG      @Y30LB33
         DC    H'2'                    SPACING FACTOR          @Y30LB33
         DC    C'R '                   SPACING TYPE            @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT SUB-STRUCTURE                                    @Y30LB33
         DC    X'8400'                 STATIC TEXT FLAG        @Y30LB33
         DC    Y(STE1317B-STE1317A)    TEXT LENGTH             @Y30LB33
         DC    Y(STE1317A-TXT13A)      TEXT OFFSET             @Y30LB33
         DC    H'1'                    PRINT COLUMN            @Y30LB33
         DC    Y(STE1317B-STE1317A)    PRINT FIELD LENGTH      @Y30LB33
         DC    H'0'                    CONVERSION FLAGS        @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT ENTRIES                                          @Y30LB33
STE131A  DC    C'LEGEND'                                       @Y30LB33
STE131B  EQU   *                                               @Y30LB33
STE132A  DC    C'-FIELD-             -DESCRIPTION-'            @Y30LB33
STE132B  EQU   *                                               @Y30LB33
STE133A  DC    C'ALLOCN DEFAULT      '                         @Y30LB33
         DC    C'SPACE ALLOCATION DEFAULTS FOR DATA SETS'      @Y30LB33
         DC    C' IN CYLINDERS'                                @G24LB37
STE133B  EQU   *                                               @Y30LB33
STE133C  DC    C'PRI - PRIMARY ALLOCATION'                     @G24LB37
STE133D  EQU   *                                               @Y30LB33
STE133E  DC    C'SEC - SECONDARY ALLOCATION'                   @G24LB37
STE133F  EQU   *                                               @Y30LB33
STE133G  DC    C'CONCUR USERS        '                         @G24LB37
         DC    C'MAXIMUM DESIRED CONCURRENT ALLOCATIONS PE'    @G24LB37
         DC    C'R HOST TO A VOLUME WITHIN A GROUP'            @G24LB37
STE133H  EQU   *                                               @G24LB37
STE134A  DC    C'EXPIRATION DATE     '                         @Y30LB33
         DC    C'EXPIRATION DATE OF THE VOLUME'                @Y30LB33
STE134B  EQU   *                                               @Y30LB33
STE135A  DC    C'FREE EXTENTS        '                         @Y30LB33
         DC    C'EXTENT INFORMATION FOR THE ACTIVE GENERAL '   @Y30LB33
         DC    C'VOLUMES IN THE GROUP OR FOR THE VOLUME '      @Y30LB33
         DC    C'LISTED'                                       @Y30LB33
STE135B  EQU   *                                               @Y30LB33
STE135C  DC    C'LRG - LARGEST FREE EXTENT IN CYLINDERS'       @Y30LB33
STE135D  EQU   *                                               @Y30LB33
STE135E  DC    C'NUM - NUMBER OF FREE EXTENTS'                 @Y30LB33
STE135F  EQU   *                                               @Y30LB33
STE135G  DC    C'AVG - AVERAGE SIZE OF FREE EXTENTS IN '       @Y30LB33
         DC    C'CYLINDERS'                                    @Y30LB33
STE135H  EQU   *                                               @Y30LB33
STE137A  DC    C'FREE SPACE          '                         @Y30LB33
         DC    C'TOTAL NUMBER OF UNUSED CYLINDERS REMAINING '  @Y30LB33
         DC    C'ON THE ACTIVE GENERAL VOLUMES IN THE GROUP '  @Y30LB33
STE137B  EQU   *                                               @Y30LB33
STE137C  DC    C'OR ON THE VOLUME LISTED'                      @Y30LB33
STE137D  EQU   *                                               @Y30LB33
STE138A  DC    C'FREE SPACE THOLD %  '                         @Y30LB33
         DC    C'THE NUMBER OF CYLINDERS TO REMAIN UNUSED IN ' @Y30LB33
         DC    C'THE GROUP,'                                   @Y30LB33
STE138B  EQU   *                                               @Y30LB33
STE138C  DC    C'EXPRESSED AS A PERCENTAGE OF THE TOTAL '      @Y30LB33
         DC    C'NUMBER OF CYLINDERS ON THE ACTIVE GENERAL '   @Y30LB33
         DC    C'VOLUMES'                                      @Y30LB33
STE138D  EQU   *                                               @Y30LB33
STE1310A DC    C'GROUP               '                         @Y30LB33
         DC    C'GROUP NAME'                                   @Y30LB33
STE1310B EQU   *                                               @Y30LB33
STE1311A DC    C'LAST MOUNT DATE     '                         @Y30LB33
         DC    C'DATE THE VOLUME WAS LAST MOUNTED'             @Y30LB33
STE1311B EQU   *                                               @Y30LB33
STE1311C DC    C'MOUNTED             '                         @G24LB37
         DC    C'INDICATES THE NUMBER OF CPU''S TO WHICH '     @G24LB37
         DC    C'THE VOLUME IS MOUNTED'                        @G24LB37
STE1311D EQU   *                                               @G24LB37
STE1311E DC    C'RESERVED SPACE %    '                         @G24LB37
         DC    C'THE NUMBER OF CYLINDERS TO REMAIN UNUSED ON ' @G24LB37
         DC    C'EACH VOLUME,'                                 @G24LB37
STE1311F EQU   *                                               @G24LB37
STE1311G DC    C'EXPRESSED AS A PERCENTAGE OF THE '            @G24LB37
         DC    C'TOTAL NUMBER OF CYLINDERS ON EACH ACTIVE '    @G24LB37
         DC    C'GENERAL VOLUME'                               @G24LB37
STE1311H EQU   *                                               @G24LB37
STE1312A DC    C'RETPD               '                         @Y30LB33
         DC    C'RETENTION PERIOD, IN NUMBER OF DAYS, '        @Y30LB33
         DC    C'FOR ACTIVE GENERAL VOLUMES'                   @Y30LB33
STE1312B EQU   *                                               @Y30LB33
STE1313A DC    C'SPACE DISP          '                         @Y30LB33
         DC    C'SPACE DISPOSITION DEFAULTS FOR DATA SETS'     @Y30LB33
STE1313B EQU   *                                               @Y30LB33
STE1313C DC    C'RLSE  - RELEASE'                              @Y30LB33
STE1313D EQU   *                                               @Y30LB33
STE1313E DC    C'NRLSE - NORELEASE'                            @Y30LB33
STE1313F EQU   *                                               @Y30LB33
STE1314A DC    C'SPACE DOWN LEVEL    '                         @Y30LB33
         DC    C'YES INDICATES SPACE INFORMATION FOR THE'      @Y30LB33
         DC    C' VOLUME MAY NOT BE ACCURATE'                  @G24LB37
STE1314B EQU   *                                               @Y30LB33
STE1315A DC    C'TOTAL SPACE         '                         @Y30LB33
         DC    C'TOTAL NUMBER OF CYLINDERS, USED AND UNUSED, ' @Y30LB33
         DC    C'ON THE ACTIVE GENERAL VOLUMES IN THE GROUP'   @Y30LB33
STE1315B EQU   *                                               @Y30LB33
STE1317A DC    C'VOLUME              '                         @Y30LB33
         DC    C'VOLUME SERIAL NUMBER'                         @Y30LB33
STE1317B EQU   *                                               @Y30LB33
TXT13B   EQU   *                                               @Y30LB33
         EJECT                                                 @Y30LB33
************************************************************   @Y30LB33
*                                                              @Y30LB33
*        ACTIVE GENERAL VOLUME LINE                            @Y30LB33
*                                                              @Y30LB33
************************************************************   @Y30LB33
TXT14    DC    Y(TXT14B-TXT14A)        ENTRY LENGTH            @Y30LB33
         DC    X'0000'                 FLAG                    @Y30LB33
         SPACE 1                                               @Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                @Y30LB33
TXT14A   DC    X'4000'                 SPACE CONTROL FLAG      @Y30LB33
         DC    H'2'                    SPACING FACTOR          @Y30LB33
         DC    C'R '                   SPACING TYPE            @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT SUB-STRUCTURE                                    @Y30LB33
         DC    X'0400'                 STATIC TEXT FLAG        @Y30LB33
         DC    Y(STE141B-STE141A)      TEXT LENGTH             @Y30LB33
         DC    Y(STE141A-TXT14A)       TEXT OFFSET             @Y30LB33
         DC    H'1'                    PRINT COLUMN            @Y30LB33
         DC    Y(STE141B-STE141A)      PRINT FIELD LENGTH      @Y30LB33
         DC    H'0'                    CONVERSION FLAGS        @Y30LB33
         SPACE 1                                               @Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                @Y30LB33
         DC    X'D000'                 SPACE CONTROL FLAG      @Y30LB33
         DC    H'1'                    SPACING FACTOR          @Y30LB33
         DC    C'R '                   SPACING TYPE            @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT ENTRIES                                          @Y30LB33
STE141A  DC    C'ACTIVE GENERAL VOLUMES'                       @Y30LB33
STE141B  EQU   *                                               @Y30LB33
TXT14B   EQU   *                                               @Y30LB33
         EJECT                                                 @Y30LB33
************************************************************   @Y30LB33
*                                                              @Y30LB33
*        ACTIVE RESTRICTED LINE                                @Y30LB33
*                                                              @Y30LB33
************************************************************   @Y30LB33
TXT15    DC    Y(TXT15B-TXT15A)        ENTRY LENGTH            @Y30LB33
         DC    H'0000'                 FLAG                    @Y30LB33
         SPACE 1                                               @Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                @Y30LB33
TXT15A   DC    X'4000'                 SPACE CONTROL FLAG      @Y30LB33
         DC    H'2'                    SPACING FACTOR          @Y30LB33
         DC    C'R '                   SPACING TYPE            @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT SUB-STRUCTURE                                    @Y30LB33
         DC    X'0400'                 STATIC TEXT FLAG        @Y30LB33
         DC    Y(STE151B-STE151A)      TEXT LENGTH             @Y30LB33
         DC    Y(STE151A-TXT15A)       TEXT OFFSET             @Y30LB33
         DC    H'1'                    PRINT COLUMN            @Y30LB33
         DC    Y(STE151B-STE151A)      PRINT FIELD LENGTH      @Y30LB33
         DC    H'0'                    CONVERSION FLAGS        @Y30LB33
         SPACE 1                                               @Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                @Y30LB33
         DC    X'D000'                 SPACE CONTROL FLAG      @Y30LB33
         DC    H'1'                    SPACING FACTOR          @Y30LB33
         DC    C'R '                   SPACING TYPE            @Y30LB33
* STATIC TEXT ENTRIES                                          @Y30LB33
STE151A  DC    C'ACTIVE RESTRICTED VOLUMES'                    @Y30LB33
STE151B  EQU   *                                               @Y30LB33
TXT15B   EQU   *                                               @Y30LB33
         EJECT                                                 @Y30LB33
************************************************************   @Y30LB33
*                                                              @Y30LB33
*        INACTIVE VOLUMES LINE                                 @Y30LB33
*                                                              @Y30LB33
************************************************************   @Y30LB33
TXT16    DC    Y(TXT16B-TXT16A)        ENTRY LENGTH            @Y30LB33
         DC    X'0000'                 FLAG                    @Y30LB33
         SPACE 1                                               @Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                @Y30LB33
TXT16A   DC    X'4000'                 SPACE CONTROL FLAG      @Y30LB33
         DC    H'2'                    SPACING FACTOR          @Y30LB33
         DC    C'R '                   SPACING TYPE            @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT SUB-STRUCTURE                                    @Y30LB33
         DC    X'0400'                 STATIC TEXT FLAG        @Y30LB33
         DC    Y(STE161B-STE161A)      TEXT LENGTH             @Y30LB33
         DC    Y(STE161A-TXT16A)       TEXT OFFSET             @Y30LB33
         DC    H'1'                    PRINT COLUMN            @Y30LB33
         DC    Y(STE161B-STE161A)      PRINT FIELD LENGTH      @Y30LB33
         DC    H'0'                    CONVERSION FLAGS        @Y30LB33
         SPACE 1                                               @Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                @Y30LB33
         DC    X'D000'                 SPACE CONTROL FLAG      @Y30LB33
         DC    H'1'                    SPACING FACTOR          @Y30LB33
         DC    C'R '                   SPACING TYPE            @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT ENTRIES                                          @Y30LB33
STE161A  DC    C'INACTIVE VOLUMES'                             @Y30LB33
STE161B  EQU   *                                               @Y30LB33
TXT16B   EQU   *                                               @Y30LB33
         EJECT                                                 @Y30LB33
************************************************************   @Y30LB33
*                                                              @Y30LB33
*        DUPLICATES LINE                                       @Y30LB33
*                                                              @Y30LB33
************************************************************   @Y30LB33
TXT17    DC    Y(TXT17B-TXT17A)        ENTRY LENGTH            @Y30LB33
         DC    X'0000'                 FLAG                    @Y30LB33
         SPACE 1                                               @Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                @Y30LB33
TXT17A   DC    X'4000'                 SPACE CONTROL FLAG      @Y30LB33
         DC    H'2'                    SPACING FACTOR          @Y30LB33
         DC    C'R '                   SPACING TYPE            @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT SUB-STRUCTURE                                    @Y30LB33
         DC    X'0400'                 STATIC TEXT FLAG        @Y30LB33
         DC    Y(STE171B-STE171A)      TEXT LENGTH             @Y30LB33
         DC    Y(STE171A-TXT17A)       TEXT OFFSET             @Y30LB33
         DC    H'1'                    PRINT COLUMN            @Y30LB33
         DC    Y(STE171B-STE171A)      PRINT FIELD LENGTH      @Y30LB33
         DC    H'0'                    CONVERSION FLAGS        @Y30LB33
         SPACE 1                                               @Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                @Y30LB33
         DC    X'D000'                 SPACE CONTROL FLAG      @Y30LB33
         DC    H'1'                    SPACING FACTOR          @Y30LB33
         DC    C'R '                   SPACING TYPE            @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT ENTRIES                                          @Y30LB33
STE171A  DC    C'DUPLICATE VOLUMES'                            @Y30LB33
STE171B  EQU   *                                               @Y30LB33
TXT17B   EQU   *                                               @Y30LB33
         EJECT                                                 @Y30LB33
************************************************************   @Y30LB33
*                                                              @Y30LB33
*        VOLUME USAGE REPORT SUBTITLES                         @Y30LB33
*                                                              @Y30LB33
************************************************************   @Y30LB33
TXT18    DC    Y(TXT18B-TXT18A)        ENTRY LENGTH            @Y30LB33
         DC    X'0000'                 FLAG                    @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT SUB-STRUCTURE                                    @Y30LB33
TXT18A   DC    X'8400'                 STATIC TEXT FLAG        @Y30LB33
         DC    Y(STE181B-STE181A)      TEXT LENGTH             @Y30LB33
         DC    Y(STE181A-TXT18A)       TEXT OFFSET             @Y30LB33
         DC    H'1'                    PRINT COLUMN            @Y30LB33
         DC    Y(STE181B-STE181A)      PRINT FIELD LENGTH      @Y30LB33
         DC    H'0'                    CONVERSION FLAGS        @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT ENTRIES                                          @Y30LB33
STE181A  DC    C'0'                                            @Y30LB33
         DC    C'                     FREE               '     @G24LB37
         DC    C'SPACE  LAST                             '     @G24LB37
         DC    C'                                        '     @Y30LB33
         DC    C' '                                            @Y30LB33
         DC    C'          FREE      EXTENTS             '     @G24LB37
         DC    C'DOWN   MOUNT  EXPIRATION                '     @G24LB37
         DC    C'                                        '     @Y30LB33
         DC    C' '                                            @Y30LB33
         DC    C'VOLUME    SPACE   LRG NUM AVG  MOUNTED  '     @G24LB37
         DC    C'LEVEL  DATE   DATE                      '     @G24LB37
         DC    C'                                        '     @Y30LB33
STE181B  EQU   *                                               @Y30LB33
TXT18B   EQU   *                                               @Y30LB33
         EJECT                                                 @Y30LB33
************************************************************   @Y30LB33
*                                                              @Y30LB33
*        VOLUME DATA LINES - USAGE REPORT                      @Y30LB33
*                                                              @Y30LB33
************************************************************   @Y30LB33
TXT19    DC    Y(TXT19B-TXT19A)        ENTRY LENGTH            @Y30LB33
         DC    X'0000'                 FLAG                    @Y30LB33
         SPACE 1                                               @Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                @Y30LB33
TXT19A   DC    X'4000'                 SPACE CONTROL FLAG      @Y30LB33
         DC    H'1'                    SPACING FACTOR          @Y30LB33
         DC    C'R '                   SPACING TYPE            @Y30LB33
*                                                              @Y30LB33
*        VOLUME FIELD                                          @Y30LB33
*                                                              @Y30LB33
* BLOCK DATA SUB-STRUCTURE                                     @Y30LB33
         DC    X'1000'                                         @Y30LB33
         DC    H'06,25,01,06,00'       ILN,IP,OC,OL,CV         @Y30LB33
*                                                              @Y30LB33
*        FREE SPACE FIELD                                      @Y30LB33
*                                                              @Y30LB33
* INSERT DATA SUB-STRUCTURE                                    @Y30LB33
         DC    X'2000'                 INSERT FLAG             @Y30LB33
         DC    H'01,00,11,03'          REF,00,OCOL,OLEN        @G24LB37
         DC    X'10A0'                 CONVERSION FLAGS        @Y30LB33
*                                                              @Y30LB33
*        LARGEST FREE EXTENT FIELD                             @Y30LB33
*                                                              @Y30LB33
* INSERT DATA SUB-STRUCTURE                                    @Y30LB33
         DC    X'2000'                 INSERT FLAG             @Y30LB33
         DC    H'02,00,19,03'          REF,00,OCOL,OLEN        @G24LB37
         DC    X'10A0'                 CONVERSION FLAGS        @Y30LB33
*                                                              @Y30LB33
*        NUMBER FREE EXTENTS FIELD                             @Y30LB33
*                                                              @Y30LB33
* INSERT DATA SUB-STRUCTURE                                    @Y30LB33
         DC    X'2000'                 INSERT FLAG             @Y30LB33
         DC    H'03,00,23,03'          REF,00,OCOL,OLEN        @G24LB37
         DC    X'10A0'                 CONVERSION FLAGS        @Y30LB33
*                                                              @Y30LB33
*        AVERAGE FREE EXTENT FIELD                             @Y30LB33
*                                                              @Y30LB33
* INSERT DATA SUB-STRUCTURE                                    @Y30LB33
         DC    X'2000'                 INSERT FLAG             @Y30LB33
         DC    H'04,00,27,03'          REF,00,OCOL,OLEN        @G24LB37
         DC    X'10A0'                 CONVERSION FLAGS        @Y30LB33
*                                                              @Y30LB33
*        MOUNTED FIELD                                         @G24LB37
*                                                              @Y30LB33
* BLOCK DATA SUB-STRUCTURE                                     @Y30LB33
         DC    X'1000'                                         @Y30LB33
         DC    H'02,03,34,02'          ILN,IP,OC,OL            @G24LB37
         DC    X'10A0'                 CONVERSION FLAGS        @G24LB37
*                                                              @G24LB37
*        SPACE DOWN LEVEL FIELD                                @G24LB37
*                                                              @G24LB37
* BLOCK DATA SUB-STRUCTURE                                     @G24LB37
         DC    X'1000'                                         @G24LB37
         DC    H'03,00,42,03,00'       ILN,IP,OC,OL,CV         @G24LB37
*                                                              @Y30LB33
*        LAST MOUNTED DATE FIELD                               @Y30LB33
*                                                              @Y30LB33
* INSERT DATA SUB-STRUCTURE                                    @Y30LB33
         DC    X'2000'                 INSERT FLAG             @Y30LB33
         DC    H'05,00,48,05'          REF,00,OCOL,OLEN        @G24LB37
         DC    X'0820'                 CONVERSION FLAGS        @Y30LB33
*                                                              @Y30LB33
*        EXPIRATION DATE FIELD                                 @Y30LB33
*                                                              @Y30LB33
* INSERT DATA SUB-STRUCTURE                                    @Y30LB33
         DC    X'A000'                 INSERT FLAG             @Y30LB33
         DC    H'06,00,55,05'          REF,00,OCOL,OLEN        @G24LB37
         DC    X'0820'                 CONVERSION FLAGS        @Y30LB33
TXT19B   EQU   *                                               @Y30LB33
         EJECT                                                 @Y30LB33
************************************************************   @Y30LB33
*                                                              @Y30LB33
*        GROUP AND VOLUME SUMMARY LINES                        @Y30LB33
*                                                              @Y30LB33
************************************************************   @Y30LB33
TXT20    DC    Y(TXT20B-TXT20A)        ENTRY LENGTH            @Y30LB33
         DC    X'0000'                 FLAG                    @Y30LB33
         SPACE 1                                               @Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                @Y30LB33
TXT20A   DC    X'4000'                 SPACE CONTROL FLAG      @Y30LB33
         DC    H'2'                    SPACING FACTOR          @Y30LB33
         DC    C'R '                   SPACING TYPE            @Y30LB33
*                                                              @Y30LB33
*        GENERAL VOLUMES TOTAL                                 @Y30LB33
*                                                              @Y30LB33
* BLOCK DATA SUB-STRUCTURE                                     @Y30LB33
         DC    X'1000'                                         @Y30LB33
         DC    H'04,00,35,04'          ILEN,IPOS,OCOL,OLEN     @YM02885
         DC    X'10A0'                 CONVERSION              @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT SUB-STRUCTURE                                    @Y30LB33
         DC    X'0400'                 STATIC TEXT FLAG        @Y30LB33
         DC    Y(STE201B-STE201A)      TEXT LENGTH             @Y30LB33
         DC    Y(STE201A-TXT20A)       TEXT OFFSET             @Y30LB33
         DC    H'1'                    PRINT COLUMN            @YM02885
         DC    Y(STE201B-STE201A)      PRINT FIELD LENGTH      @Y30LB33
         DC    H'0'                    CONVERSION FLAGS        @Y30LB33
         SPACE 1                                               @Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                @Y30LB33
         DC    X'4000'                 SPACE CONTROL FLAG      @Y30LB33
         DC    H'1'                    SPACING FACTOR          @Y30LB33
         DC    C'R '                   SPACING TYPE            @Y30LB33
*                                                              @Y30LB33
*        RESTRICTED VOLUMES TOTAL                              @Y30LB33
*                                                              @Y30LB33
* BLOCK DATA SUB-STRUCTURE                                     @Y30LB33
         DC    X'1000'                                         @Y30LB33
         DC    H'04,04,35,04'          ILEN,IPOS,OCOL,OLEN     @YM02885
         DC    X'10A0'                 CONVERSION              @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT SUB-STRUCTURE                                    @Y30LB33
         DC    X'0400'                 STATIC TEXT FLAG        @Y30LB33
         DC    Y(STE202B-STE202A)      TEXT LENGTH             @Y30LB33
         DC    Y(STE202A-TXT20A)       TEXT OFFSET             @Y30LB33
         DC    H'1'                    PRINT COLUMN            @YM02885
         DC    Y(STE202B-STE202A)      PRINT FIELD LENGTH      @Y30LB33
         DC    H'0'                    CONVERSION FLAGS        @Y30LB33
         SPACE 1                                               @Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                @Y30LB33
         DC    X'4000'                 SPACE CONTROL FLAG      @Y30LB33
         DC    H'1'                    SPACING FACTOR          @Y30LB33
         DC    C'R '                   SPACING TYPE            @Y30LB33
*                                                              @Y30LB33
*        INACTIVE VOLUMES TOTAL                                @Y30LB33
*                                                              @Y30LB33
* BLOCK DATA SUB-STRUCTURE                                     @Y30LB33
         DC    X'1000'                                         @Y30LB33
         DC    H'04,08,35,04'          ILEN,IPOS,OCOL,OLEN     @YM02885
         DC    X'10A0'                 CONVERSION              @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT SUB-STRUCTURE                                    @Y30LB33
         DC    X'8400'                 STATIC TEXT FLAG        @Y30LB33
         DC    Y(STE203B-STE203A)      TEXT LENGTH             @Y30LB33
         DC    Y(STE203A-TXT20A)       TEXT OFFSET             @Y30LB33
         DC    H'1'                    PRINT COLUMN            @YM02885
         DC    Y(STE203B-STE203A)      PRINT FIELD LENGTH      @Y30LB33
         DC    X'1'                    CONVERSION FLAGS        @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT ENTRIES                                          @Y30LB33
STE201A  DC    C'ACTIVE GENERAL VOLUMES LISTED:'               @YM02885
STE201B  EQU   *                                               @Y30LB33
STE202A  DC    C'ACTIVE RESTRICTED VOLUMES LISTED:'            @YM02885
STE202B  EQU   *                                               @Y30LB33
STE203A  DC    C'INACTIVE VOLUMES LISTED:'                     @YM02885
STE203B  EQU   *                                               @Y30LB33
TXT20B   EQU   *                                               @Y30LB33
         EJECT                                                 @Y30LB33
************************************************************   @Y30LB33
*                                                              @Y30LB33
*        GROUP SUMMARY TOTAL                                   @Y30LB33
*                                                              @Y30LB33
************************************************************   @Y30LB33
TXT21    DC    Y(TXT21B-TXT21A)        ENTRY LENGTH            @Y30LB33
         DC    X'0000'                 FLAG                    @Y30LB33
         SPACE 1                                               @Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                @Y30LB33
TXT21A   DC    X'4000'                 SPACE CONTROL FLAG      @Y30LB33
         DC    H'2'                    SPACING FACTOR          @Y30LB33
         DC    C'R '                   SPACING TYPE            @Y30LB33
         SPACE 1                                               @Y30LB33
* BLOCK DATA SUB-STRUCTURE                                     @Y30LB33
         DC    X'1000'                                         @Y30LB33
         DC    H'04,16,16,4'           ILEN,IPOS,OCOL,OLEN     @YM02885
         DC    X'10A0'                 CONVERSION              @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT SUB-STRUCTURE                                    @Y30LB33
         DC    X'8400'                 STATIC TEXT FLAG        @Y30LB33
         DC    Y(STE211B-STE211A)      TEXT LENGTH             @Y30LB33
         DC    Y(STE211A-TXT21A)       TEXT OFFSET             @Y30LB33
         DC    H'1'                    PRINT COLUMN            @YM02885
         DC    Y(STE211B-STE211A)      PRINT FIELD LENGTH      @Y30LB33
         DC    H'0'                    CONVERSION FLAGS        @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT ENTRIES                                          @Y30LB33
STE211A  DC    C'GROUPS LISTED:'                               @YM02885
STE211B  EQU   *                                               @Y30LB33
TXT21B   EQU   *                                               @Y30LB33
         EJECT                                                 @Y30LB33
************************************************************   @Y30LB33
*                                                              @Y30LB33
*        VOLUME SUMMARY TOTALS                                 @Y30LB33
*                                                              @Y30LB33
************************************************************   @Y30LB33
TXT22    DC    Y(TXT22B-TXT22A)        ENTRY LENGTH            @Y30LB33
         DC    X'0000'                 FLAG                    @Y30LB33
         SPACE 1                                               @Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                @Y30LB33
TXT22A   DC    X'4000'                 SPACE CONTROL FLAG      @Y30LB33
         DC    H'2'                    SPACING FACTOR          @Y30LB33
         DC    C'R '                   SPACING TYPE            @Y30LB33
*                                                              @Y30LB33
*        TOTAL VOLUMES                                         @Y30LB33
*                                                              @Y30LB33
* BLOCK DATA SUB-STRUCTURE                                     @Y30LB33
         DC    X'1000'                                         @Y30LB33
         DC    H'04,24,35,4'           ILEN,IPOS,OCOL,OLEN     @ZA00683
         DC    X'10A0'                 CONVERSION              @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT SUB-STRUCTURE                                    @Y30LB33
         DC    X'8400'                 STATIC TEXT FLAG        @Y30LB33
         DC    Y(STE221B-STE221A)      TEXT LENGTH             @Y30LB33
         DC    Y(STE221A-TXT22A)       TEXT OFFSET             @Y30LB33
         DC    H'1'                    PRINT COLUMN            @YM02885
         DC    Y(STE221B-STE221A)      PRINT FIELD LENGTH      @Y30LB33
         DC    H'0'                    CONVERSION FLAGS        @Y30LB33
         SPACE 1                                               @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT ENTRIES                                          @Y30LB33
STE221A  DC    C'BASE VOLUMES LISTED:'                         @YM02885
STE221B  EQU   *                                               @Y30LB33
TXT22B   EQU   *                                               @Y30LB33
         EJECT                                                 @Y30LB33
************************************************************   @Y30LB33
*                                                              @Y30LB33
*        GROUP REPORT SUBTITLES - USAGE REPORT                 @Y30LB33
*                                                              @Y30LB33
************************************************************   @Y30LB33
TXT23    DC    Y(TXT23B-TXT23A)        ENTRY LENGTH            @Y30LB33
         DC    X'0000'                 FLAG                    @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT SUB-STRUCTURE                                    @Y30LB33
TXT23A   DC    X'8400'                 STATIC TEXT FLAG        @Y30LB33
         DC    Y(STE231B-STE231A)      TEXT LENGTH             @Y30LB33
         DC    Y(STE231A-TXT23A)       TEXT OFFSET             @Y30LB33
         DC    H'1'                    PRINT COLUMN            @Y30LB33
         DC    Y(STE231B-STE231A)      PRINT FIELD LENGTH      @Y30LB33
         DC    H'0'                    CONVERSION FLAGS        @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT ENTRIES                                          @Y30LB33
STE231A  DC    C'0'                                            @Y30LB33
         DC    C'          ALLOCN          FREE          '     @Y30LB33
         DC    C'                                  FREE  '     @G24LB37
         DC    C'                                        '     @Y30LB33
         DC    C' '                                            @Y30LB33
         DC    C'          DEFAULT  SPACE  SPACE     CONC'     @G24LB37
         DC    C'UR   RESERVED   TOTAL    FREE     EXTENT'     @G24LB37
         DC    C'S                                       '     @G24LB37
         DC    C' '                                            @Y30LB33
         DC    C'GROUP     PRI SEC  DISP   THOLD %   USER'     @G24LB37
         DC    C'S    SPACE %    SPACE    SPACE    NUM AV'     @G24LB37
         DC    C'G  RETPD                                '     @G24LB37
STE231B  EQU   *                                               @Y30LB33
TXT23B   EQU   *                                               @Y30LB33
         EJECT                                                 @Y30LB33
************************************************************   @Y30LB33
*                                                              @Y30LB33
*        GROUP DATA LINE - USAGE REPORT                        @Y30LB33
*                                                              @Y30LB33
************************************************************   @Y30LB33
TXT24    DC    Y(TXT24B-TXT24A)        ENTRY LENGTH            @Y30LB33
         DC    X'0000'                 FLAG                    @Y30LB33
         SPACE 1                                               @Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                @Y30LB33
TXT24A   DC    X'4000'                 SPACE CONTROL FLAG      @Y30LB33
         DC    H'1'                    SPACING FACTOR          @Y30LB33
         DC    C'R '                   SPACING TYPE            @Y30LB33
*                                                              @Y30LB33
*        GROUP NAME FIELD                                      @Y30LB33
*                                                              @Y30LB33
* BLOCK DATA SUB-STRUCTURE                                     @Y30LB33
         DC    X'1000'                                         @Y30LB33
         DC    H'8,23,1,8,0'           ILN,IP,OC,OL,CV         @Y30LB33
*                                                              @Y30LB33
*        PRIMARY ALLOCATION FIELD                              @Y30LB33
*                                                              @Y30LB33
* BLOCK DATA SUB-STRUCTURE                                     @Y30LB33
         DC    X'1000'                                         @Y30LB33
         DC    H'02,56,11,3'           ILEN,IPOS,OCOL,OLEN     @Y30LB33
         DC    X'10A0'                 CONVERSION              @Y30LB33
*                                                              @Y30LB33
*        SECONDARY ALLOCATION FIELD                            @Y30LB33
*                                                              @Y30LB33
* BLOCK DATA SUB-STRUCTURE                                     @Y30LB33
         DC    X'1000'                                         @Y30LB33
         DC    H'02,58,15,3'           ILEN,IPOS,OCOL,OLEN     @Y30LB33
         DC    X'10A0'                 CONVERSION              @Y30LB33
*                                                              @Y30LB33
*        SPACE DISPOSITION FIELD                               @Y30LB33
*                                                              @Y30LB33
* BLOCK DATA SUB-STRUCTURE                                     @Y30LB33
         DC    X'1000'                                         @Y30LB33
         DC    H'5,04,20,5,0'          ILN,IP,OC,OL,CV         @Y30LB33
*                                                              @Y30LB33
*        FREE SPACE THOLD % FIELD                              @Y30LB33
*                                                              @Y30LB33
* INSERT DATA SUB-STRUCTURE                                    @Y30LB33
         DC    X'2000'                 INSERT FLAG             @Y30LB33
         DC    H'01,00,29,02'          REF,00,OCOL,OLEN        @ZA16116
         DC    X'10A0'                 CONVERSION FLAGS        @Y30LB33
*                                                              @G24LB37
*        CONCURRENT USERS FIELD                                @G24LB37
*                                                              @G24LB37
* BLOCK DATA SUB-STRUCTURE                                     @G24LB37
         DC    X'1000'                                         @G24LB37
         DC    H'1,114,38,3'           ILEN,IPOS,OCOL,OLEN     @G24LB37
         DC    X'10A0'                 CONVERSION              @G24LB37
*                                                              @G24LB37
*        RESERVED SPACE FIELD                                  @G24LB37
*                                                              @G24LB37
* BLOCK DATA SUB-STRUCTURE                                     @G24LB37
         DC    X'1000'                                         @G24LB37
         DC    H'1,115,48,2'           ILEN,IPOS,OCOL,OLEN     @G24LB37
         DC    X'10A0'                 CONVERSION              @G24LB37
*                                                              #Y30LB33
*        TOTAL SPACE FIELD                                     #Y30LB33
*                                                              #Y30LB33
* BLOCK DATA SUB-STRUCTURE                                     #Y30LB33
         DC    X'1000'                                         @Y30LB33
         DC    H'04,12,56,6'           ILEN,IPOS,OCOL,OLEN     @G24LB37
         DC    X'10A0'                 CONVERSION              @Y30LB33
*                                                              @Y30LB33
*        FREE SPACE FIELD                                      @Y30LB33
*                                                              @Y30LB33
* BLOCK DATA SUB-STRUCTURE                                     @Y30LB33
         DC    X'1000'                                         @Y30LB33
         DC    H'4,64,65,6'            ILEN,IPOS,OCOL,OLEN     @G24LB37
         DC    X'10A0'                 CONVERSION              @Y30LB33
*                                                              @Y30LB33
*        NUMBER FREE EXTENTS FIELD                             @Y30LB33
*                                                              @Y30LB33
* BLOCK DATA SUB-STRUCTURE                                     @Y30LB33
         DC    X'1000'                                         @Y30LB33
         DC    H'04,68,73,5'           ILEN,IPOS,OCOL,OLEN     @G24LB37
         DC    X'10A0'                 CONVERSION              @Y30LB33
*                                                              @Y30LB33
*        AVERAGE FREE EXTENT FIELD                             @Y30LB33
*                                                              @Y30LB33
* INSERT DATA SUB-STRUCTURE                                    @Y30LB33
         DC    X'2000'                 INSERT FLAG             @Y30LB33
         DC    H'01,00,79,03'          REF,00,OCOL,OLEN        @G24LB37
         DC    X'10A0'                 CONVERSION FLAGS        @Y30LB33
*                                                              @Y30LB33
*        RETENTION PERIOD FIELD                                @Y30LB33
*                                                              @Y30LB33
* INSERT DATA SUB-STRUCTURE                                    @Y30LB33
         DC    X'A000'                 INSERT FLAG             @Y30LB33
         DC    H'02,00,84,05'          REF,00,OCOL,OLEN        @G24LB37
         DC    X'10A0'                 CONVERSION FLAGS        @Y30LB33
TXT24B   EQU   *                                               @Y30LB33
         EJECT                                                 @Y30LB33
************************************************************   @Y30LB33
*                                                              @Y30LB33
*        GROUP SUBTITLE - STATUS REPORT                        @Y30LB33
*                                                              @Y30LB33
************************************************************   @Y30LB33
TXT25    DC    Y(TXT25B-TXT25A)        ENTRY LENGTH            @Y30LB33
         DC    X'0000'                 FLAG                    @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT SUB-STRUCTURE                                    @Y30LB33
TXT25A   DC    X'8400'                 STATIC TEXT FLAG        @Y30LB33
         DC    Y(STE251B-STE251A)      TEXT LENGTH             @Y30LB33
         DC    Y(STE251A-TXT25A)       TEXT OFFSET             @Y30LB33
         DC    H'1'                    PRINT COLUMN            @Y30LB33
         DC    Y(STE251B-STE251A)      PRINT FIELD LENGTH      @Y30LB33
         DC    H'0'                    CONVERSION FLAGS        @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT ENTRIES                                          @Y30LB33
STE251A  DC    C'0'                                            @Y30LB33
         DC    C'          ALLOCN          FREE          '     @Y30LB33
         DC    C'                                        '     @Y30LB33
         DC    C'                                        '     @Y30LB33
         DC    C' '                                            @Y30LB33
         DC    C'          DEFAULT  SPACE  SPACE    CONCU'     @G24LB37
         DC    C'R  RESERVED         ATTR                '     @G24LB37
         DC    C'                                        '     @Y30LB33
         DC    C' '                                            @Y30LB33
         DC    C'GROUP     PRI SEC  DISP   THOLD %  USERS'     @G24LB37
         DC    C'   SPACE %   RETPD  BRDE  OWNER       AD'     @G24LB37
         DC    C'DRESS          DESCRIPTION              '     @G24LB37
STE251B  EQU   *                                               @Y30LB33
TXT25B   EQU   *                                               @Y30LB33
         EJECT                                                 @Y30LB33
************************************************************   @Y30LB33
*                                                              @Y30LB33
*        GROUP DATA LINE - STATUS REPORT                       @Y30LB33
*                                                              @Y30LB33
************************************************************   @Y30LB33
TXT26    DC    Y(TXT26B-TXT26A)        ENTRY LENGTH            @Y30LB33
         DC    X'0000'                 FLAG                    @Y30LB33
         SPACE 1                                               @Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                @Y30LB33
TXT26A   DC    X'4000'                 SPACE CONTROL FLAG      @Y30LB33
         DC    H'1'                    SPACING FACTOR          @Y30LB33
         DC    C'R '                   SPACING TYPE            @Y30LB33
*                                                              @Y30LB33
*        GROUP NAME FIELD                                      @Y30LB33
*                                                              @Y30LB33
* BLOCK DATA SUB-STRUCTURE                                     @Y30LB33
         DC    X'1000'                                         @Y30LB33
         DC    H'8,23,1,8,0'           ILN,IP,OC,OL,CV         @Y30LB33
*                                                              @Y30LB33
*        PRIMARY SPACE FIELD                                   @Y30LB33
*                                                              @Y30LB33
* BLOCK DATA SUB-STRUCTURE                                     @Y30LB33
         DC    X'1000'                                         @Y30LB33
         DC    H'02,56,11,3'           ILEN,IPOS,OCOL,OLEN     @Y30LB33
         DC    X'10A0'                 CONVERSION              @Y30LB33
*                                                              @Y30LB33
*        SECONDARY ALLOCATION FIELD                            @Y30LB33
*                                                              @Y30LB33
* BLOCK DATA SUB-STRUCTURE                                     @Y30LB33
         DC    X'1000'                                         @Y30LB33
         DC    H'02,58,15,3'           ILEN,IPOS,OCOL,OLEN     @Y30LB33
         DC    X'10A0'                 CONVERSION              @Y30LB33
*                                                              @Y30LB33
*        SPACE DISPOSITION FIELD                               @Y30LB33
*                                                              @Y30LB33
* BLOCK DATA SUB-STRUCTURE                                     @Y30LB33
         DC    X'1000'                                         @Y30LB33
         DC    H'5,04,20,5,0'          ILN,IP,OC,OL,CV         @Y30LB33
*                                                              @Y30LB33
*        FREE SPACE THOLD % FIELD                              @Y30LB33
*                                                              @Y30LB33
* INSERT DATA SUB-STRUCTURE                                    @Y30LB33
         DC    X'2000'                 INSERT FLAG             @Y30LB33
         DC    H'01,00,29,02'          REF,00,OCOL,OLEN        @ZA16116
         DC    X'10A0'                 CONVERSION FLAGS        @Y30LB33
*                                                              @G24LB37
*        CONCURRENT USERS FIELD                                @G24LB37
*                                                              @G24LB37
* BLOCK DATA SUB-STRUCTURE                                     @G24LB37
         DC    X'1000'                                         @G24LB37
         DC    H'1,114,37,3'           ILEN,IPOS,OCOL,OLEN     @G24LB37
         DC    X'10A0'                 CONVERSION              @G24LB37
*                                                              @G24LB37
*        RESERVED SPACE FIELD                                  @G24LB37
*                                                              @G24LB37
* BLOCK DATA SUB-STRUCTURE                                     @G24LB37
         DC    X'1000'                                         @G24LB37
         DC    H'1,115,47,2'           ILEN,IPOS,OCOL,OLEN     @G24LB37
         DC    X'10A0'                 CONVERSION              @G24LB37
*                                                              #Y30LB33
*        RETENTION PERIOD FIELD                                #Y30LB33
*                                                              #Y30LB33
* INSERT DATA SUB-STRUCTURE                                    #Y30LB33
         DC    X'2000'                 INSERT FLAG             @Y30LB33
         DC    H'01,00,54,05'          REF,00,OCOL,OLEN        @G24LB37
         DC    X'10A0'                 CONVERSION FLAGS        @Y30LB33
*                                                              @Y30LB33
*        ATTRIBUTE FIELD                                       @Y30LB33
*                                                              @Y30LB33
* BLOCK DATA SUB-STRUCTURE                                     @Y30LB33
         DC    X'1000'                                         @Y30LB33
         DC    H'4,00,61,4,0'          ILN,IP,OC,OL,CV         @G24LB37
*                                                              @Y30LB33
*        OWNER FIELD                                           @Y30LB33
*                                                              @Y30LB33
* BLOCK DATA SUB-STRUCTURE                                     @Y30LB33
         DC    X'1000'                                         @Y30LB33
         DC    H'10,116,67,10,0'       ILN,IP,OC,OL,CV         @G24LB37
*                                                              @Y30LB33
*        ADDRESS FIELD                                         @Y30LB33
*                                                              @Y30LB33
* BLOCK DATA SUB-STRUCTURE                                     @Y30LB33
         DC    X'1000'                                         @Y30LB33
         DC    H'15,126,79,15,0'       ILN,IP,OC,OL,CV         @G24LB37
*                                                              @Y30LB33
*        DESCRIPTION FIELD 1                                   @Y30LB33
*                                                              @Y30LB33
* BLOCK DATA SUB-STRUCTURE                                     @Y30LB33
         DC    X'1000'                                         @Y30LB33
         DC    H'15,84,96,15,0'        ILN,IP,OC,OL,CV         @G24LB37
*                                                              @Y30LB33
*        SECOND LINE                                           @Y30LB33
*                                                              @Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                @Y30LB33
         DC    X'4000'                 SPACE CONTROL FLAG      @Y30LB33
         DC    H'1'                    SPACING FACTOR          @Y30LB33
         DC    C'R '                   SPACING TYPE            @Y30LB33
*                                                              @Y30LB33
*        ADDRESS FIELD                                         @Y30LB33
*                                                              @Y30LB33
* BLOCK DATA SUB-STRUCTURE                                     @Y30LB33
         DC    X'1000'                                         @G24LB37
         DC    H'15,141,79,15,0'       ILN,IP,OC,OL,CV         @G24LB37
*                                                              @G24LB37
*        DESCRIPTION FIELD 2                                   @G24LB37
*                                                              @G24LB37
* BLOCK DATA SUB-STRUCTURE                                     @G24LB37
         DC    X'9000'                                         @G24LB37
         DC    H'15,99,96,15,0'        ILN,IP,OC,OL,CV         @G24LB37
*                                                              #Y30LB33
TXT26B   EQU   *                                               @Y30LB33
         EJECT                                                 @Y30LB33
************************************************************   @Y30LB33
*                                                              #Y30LB33
*        VOLUME SUBTITLES - STATUS REPORT                      #Y30LB33
*                                                              #Y30LB33
************************************************************   #Y30LB33
TXT27    DC    Y(TXT27B-TXT27A)        ENTRY LENGTH            #Y30LB33
         DC    X'0100'                 FLAG                    @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT SUB-STRUCTURE                                    @Y30LB33
TXT27A   DC    X'8400'                 STATIC TEXT FLAG        @Y30LB33
         DC    Y(STE271B-STE271A)      TEXT LENGTH             @Y30LB33
         DC    Y(STE271A-TXT27A)       TEXT OFFSET             @Y30LB33
         DC    H'1'                    PRINT COLUMN            @Y30LB33
         DC    Y(STE271B-STE271A)      PRINT FIELD LENGTH      @Y30LB33
         DC    H'0'                    CONVERSION FLAGS        @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT ENTRIES                                          @Y30LB33
STE271A  DC    C'0'                                            @Y30LB33
         DC    C'                         ATTR  MAX      '     @Y30LB33
         DC    C'         COPY     VOL                   '     @Y30LB33
         DC    C' CARTRIDGE 1                    EJECT   '     @Y30LB33
         DC    C' '                                            @Y30LB33
         DC    C'VOLUME  GROUP     STATE  BRDE  BKUP  OWN'     @Y30LB33
         DC    C'ER       DATE     TYPE  DESCRIPTION     '     @Y30LB33
         DC    C' CARTRIDGE 2   LOCATION         DATE    '     @Y30LB33
STE271B  EQU   *                                               @Y30LB33
TXT27B   EQU   *                                               @Y30LB33
         EJECT                                                 @Y30LB33
************************************************************   @Y30LB33
*                                                              @Y30LB33
*        VOLUME DATA LINE - STATUS REPORT                      @Y30LB33
*                                                              @Y30LB33
************************************************************   @Y30LB33
TXT28    DC    Y(TXT28B-TXT28A)        ENTRY LENGTH            @Y30LB33
         DC    X'0000'                 FLAG                    @Y30LB33
         SPACE 1                                               @Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                @Y30LB33
TXT28A   DC    X'4000'                 SPACE CONTROL FLAG      @Y30LB33
         DC    H'1'                    SPACING FACTOR          @Y30LB33
         DC    C'R '                   SPACING TYPE            @Y30LB33
*                                                              @Y30LB33
*        VOLUME FIELD                                          @Y30LB33
*                                                              @Y30LB33
* BLOCK DATA SUB-STRUCTURE                                     @Y30LB33
         DC    X'1000'                                         @Y30LB33
         DC    H'6,25,1,6,0'           ILN,IP,OC,OL,CV         @Y30LB33
*                                                              @Y30LB33
*        GROUP FIELD                                           @Y30LB33
*                                                              @Y30LB33
* BLOCK DATA SUB-STRUCTURE                                     @Y30LB33
         DC    X'1000'                                         @Y30LB33
         DC    H'8,200,9,8,0'          ILN,IP,OC,OL,CV         @Y30LB33
*                                                              @Y30LB33
*        STATE FIELD                                           @Y30LB33
*                                                              @Y30LB33
* BLOCK DATA SUB-STRUCTURE                                     @Y30LB33
         DC    X'1000'                                         @Y30LB33
         DC    H'5,00,19,8,0'          ILN,IP,OC,OL,CV         @Y30LB33
*                                                              @Y30LB33
*        ATTRIBUTE FIELD                                       @Y30LB33
*                                                              @Y30LB33
* BLOCK DATA SUB-STRUCTURE                                     @Y30LB33
         DC    X'1000'                                         @Y30LB33
         DC    H'4,05,26,4,0'          ILN,IP,OC,OL,CV         @Y30LB33
*                                                              @Y30LB33
*        MAX BACKUP FIELD                                      @Y30LB33
*                                                              @Y30LB33
* BLOCK DATA SUB-STRUCTURE                                     @Y30LB33
         DC    X'1000'                                         @Y30LB33
         DC    H'01,084,33,3'          ILEN,IPOS,OCOL,OLEN     @Y30LB33
         DC    X'10A0'                 CONVERSION              @Y30LB33
*                                                              @Y30LB33
*        OWNER FIELD                                           @Y30LB33
*                                                              @Y30LB33
* BLOCK DATA SUB-STRUCTURE                                     @Y30LB33
         DC    X'1000'                                         @Y30LB33
         DC    H'10,154,38,10,0'       ILN,IP,OC,OL,CV         @Y30LB33
*                                                              @Y30LB33
*        VOLUME TYPE FIELD                                     @Y30LB33
*                                                              @Y30LB33
* BLOCK DATA SUB-STRUCTURE                                     @Y30LB33
         DC    X'1000'                                         @Y30LB33
         DC    H'4,09,59,4,0'          ILN,IP,OC,OL,CV         @Y30LB33
*                                                              @Y30LB33
*        DESCRIPTION FIELD                                     @Y30LB33
*                                                              @Y30LB33
* BLOCK DATA SUB-STRUCTURE                                     @Y30LB33
         DC    X'1000'                                         @Y30LB33
         DC    H'15,124,65,15,0'       ILN,IP,OC,OL,CV         @Y30LB33
*                                                              @Y30LB33
*        CARTRIDGE 1 FIELD                                     @Y30LB33
*                                                              @Y30LB33
* BLOCK DATA SUB-STRUCTURE                                     @Y30LB33
         DC    X'1000'                                         @Y30LB33
         DC    H'12,44,82,12,0'        ILN,IP,OC,OL,CV         @Y30LB33
*                                                              @Y30LB33
*        LOCATION FIELD                                        @Y30LB33
*                                                              @Y30LB33
* BLOCK DATA SUB-STRUCTURE                                     @Y30LB33
         DC    X'1000'                                         @Y30LB33
         DC    H'15,164,96,15,0'       ILN,IP,OC,OL,CV         @Y30LB33
*                                                              @Y30LB33
*        EJECT DATE FIELD                                      @Y30LB33
*                                                              @Y30LB33
* INSERT DATA SUB-STRUCTURE                                    @Y30LB33
         DC    X'2000'                 INSERT FLAG             @Y30LB33
         DC    H'01,00,113,5'          REF,00,OCOL,OLEN        @Y30LB33
         DC    X'0820'                 CONVERSION FLAGS        @Y30LB33
*                                                              @Y30LB33
*        SECOND LINE                                           @Y30LB33
*                                                              @Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                @Y30LB33
         DC    X'4000'                 SPACE CONTROL FLAG      @Y30LB33
         DC    H'1'                    SPACING FACTOR          @Y30LB33
         DC    C'R '                   SPACING TYPE            @Y30LB33
*                                                              @Y30LB33
*        DESCRIPTION FIELD                                     @Y30LB33
*                                                              @Y30LB33
* BLOCK DATA SUB-STRUCTURE                                     @Y30LB33
         DC    X'1000'                                         @Y30LB33
         DC    H'15,139,65,15,0'       ILN,IP,OC,OL,CV         @Y30LB33
*                                                              @Y30LB33
*        CARTRIDGE 2 FIELD                                     @Y30LB33
*                                                              @Y30LB33
* BLOCK DATA SUB-STRUCTURE                                     @Y30LB33
         DC    X'1000'                                         @Y30LB33
         DC    H'12,57,82,12,0'        ILN,IP,OC,OL,CV         @Y30LB33
*                                                              @Y30LB33
*        LOCATION FIELD 2                                      @G24LB37
*                                                              @Y30LB33
* BLOCK DATA SUB-STRUCTURE                                     @Y30LB33
         DC    X'9000'                                         @Y30LB33
         DC    H'15,179,96,15,0'       ILN,IP,OC,OL,CV         @Y30LB33
*                                                              @Y30LB33
TXT28B   EQU   *                                               @Y30LB33
         EJECT                                                 @Y30LB33
************************************************************   @Y30LB33
*                                                              @Y30LB33
*        GROUP AND VOLUME HEADER - STATUS REPORT               @Y30LB33
*                                                              @Y30LB33
************************************************************   @Y30LB33
TXT29    DC    Y(TXT29B-TXT29A)        ENTRY LENGTH            @Y30LB33
         DC    X'0000'                 MESSAGE FLAG            @Y30LB33
*                                                              @Y30LB33
*        REPORT-TYPE LINE                                      @Y30LB33
*                                                              @Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                @Y30LB33
TXT29A   DC    X'4000'                 SPACE CONTROL FLAG      @Y30LB33
         DC    H'1'                    SPACING FACTOR          @Y30LB33
         DC    C'E '                   SPACING TYPE            @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT SUB-STRUCTURE                                    @Y30LB33
         DC    X'0400'                 STATIC TEXT FLAG        @Y30LB33
         DC    Y(STE291B-STE291A)      TEXT LENGTH             @Y30LB33
         DC    Y(STE291A-TXT29A)       TEXT OFFSET             @Y30LB33
         DC    H'47'                   PRINT COLUMN            @Y30LB33
         DC    Y(STE291B-STE291A)      PRINT FIELD LENGTH      @Y30LB33
         DC    H'0'                    CONVERSION FLAGS        @Y30LB33
         SPACE 1                                               @Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                @Y30LB33
         DC    X'4000'                 SPACE CONTROL FLAG      @Y30LB33
         DC    H'2'                    SPACING FACTOR          @Y30LB33
         DC    C'R '                   SPACING TYPE            @Y30LB33
*                                                              @Y30LB33
*        OWNER LINE                                            @Y30LB33
*                                                              @Y30LB33
* STATIC TEXT SUB-STRUCTURE                                    @Y30LB33
         DC    X'0400'                 STATIC TEXT FLAG        @Y30LB33
         DC    Y(STE292B-STE292A)      TEXT LENGTH             @Y30LB33
         DC    Y(STE292A-TXT29A)       TEXT OFFSET             @Y30LB33
         DC    H'1'                    PRINT COLUMN            @Y30LB33
         DC    Y(STE292B-STE292A)      PRINT FIELD LENGTH      @Y30LB33
         DC    H'0'                    CONVERSION FLAGS        @Y30LB33
         SPACE 1                                               @Y30LB33
* BLOCK DATA SUB-STRUCTURE                                     @Y30LB33
         DC    X'1000'                                         @Y30LB33
         DC    H'10,116,8,10,0'        ILN,IP,OC,OL,CV         @Y30LB33
*                                                              @Y30LB33
*        ADDRESS LINE                                          @Y30LB33
*                                                              @Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                @Y30LB33
         DC    X'4000'                 SPACE CONTROL FLAG      @Y30LB33
         DC    H'2'                    SPACING FACTOR          @Y30LB33
         DC    C'R '                   SPACING TYPE            @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT SUB-STRUCTURE                                    @Y30LB33
         DC    X'0400'                 STATIC TEXT FLAG        @Y30LB33
         DC    Y(STE293B-STE293A)      TEXT LENGTH             @Y30LB33
         DC    Y(STE293A-TXT29A)       TEXT OFFSET             @Y30LB33
         DC    H'1'                    PRINT COLUMN            @Y30LB33
         DC    Y(STE293B-STE293A)      PRINT FIELD LENGTH      @Y30LB33
         DC    H'0'                    CONVERSION FLAGS        @Y30LB33
         SPACE 1                                               @Y30LB33
* BLOCK DATA SUB-STRUCTURE                                     @Y30LB33
         DC    X'1000'                                         @Y30LB33
         DC    H'30,126,10,30,0'       ILN,IP,OC,OL,CV         @Y30LB33
*                                                              @Y30LB33
*        FIRST SUBTITLE LINE                                   @Y30LB33
*                                                              @Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                @Y30LB33
         DC    X'4000'                 SPACE CONTROL FLAG      @Y30LB33
         DC    H'2'                    SPACING FACTOR          @Y30LB33
         DC    C'R '                   SPACING TYPE            @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT SUB-STRUCTURE                                    @Y30LB33
         DC    X'0400'                 STATIC TEXT FLAG        @Y30LB33
         DC    Y(STE294B-STE294A)      TEXT LENGTH             @Y30LB33
         DC    Y(STE294A-TXT29A)       TEXT OFFSET             @Y30LB33
         DC    H'11'                   PRINT COLUMN            @Y30LB33
         DC    Y(STE294B-STE294A)      PRINT FIELD LENGTH      @Y30LB33
         DC    H'0'                    CONVERSION FLAGS        @Y30LB33
*                                                              @Y30LB33
*        SECOND SUBTITLE LINE                                  @Y30LB33
*                                                              @Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                @Y30LB33
         DC    X'4000'                 SPACE CONTROL FLAG      @Y30LB33
         DC    H'1'                    SPACING FACTOR          @Y30LB33
         DC    C'R '                   SPACING TYPE            @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT SUB-STRUCTURE                                    @Y30LB33
         DC    X'0400'                 STATIC TEXT FLAG        @Y30LB33
         DC    Y(STE295B-STE295A)      TEXT LENGTH             @Y30LB33
         DC    Y(STE295A-TXT29A)       TEXT OFFSET             @Y30LB33
         DC    H'11'                   PRINT COLUMN            @Y30LB33
         DC    Y(STE295B-STE295A)      PRINT FIELD LENGTH      @Y30LB33
         DC    H'0'                    CONVERSION FLAGS        @Y30LB33
*                                                              @Y30LB33
*        THIRD SUBTITLE LINE                                   @Y30LB33
*                                                              @Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                @Y30LB33
         DC    X'4000'                 SPACE CONTROL FLAG      @Y30LB33
         DC    H'1'                    SPACING FACTOR          @Y30LB33
         DC    C'R '                   SPACING TYPE            @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT SUB-STRUCTURE                                    @Y30LB33
         DC    X'0400'                 STATIC TEXT FLAG        @Y30LB33
         DC    Y(STE296B-STE296A)      TEXT LENGTH             @Y30LB33
         DC    Y(STE296A-TXT29A)       TEXT OFFSET             @Y30LB33
         DC    H'1'                    PRINT COLUMN            @Y30LB33
         DC    Y(STE296B-STE296A)      PRINT FIELD LENGTH      @Y30LB33
         DC    H'0'                    CONVERSION FLAGS        @Y30LB33
*                                                              @Y30LB33
*        GROUP DATA LINE                                       @Y30LB33
*                                                              @Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                @Y30LB33
         DC    X'4000'                 SPACE CONTROL FLAG      @Y30LB33
         DC    H'2'                    SPACING FACTOR          @Y30LB33
         DC    C'R '                   SPACING TYPE            @Y30LB33
*                                                              @Y30LB33
*        GROUP NAME FIELD                                      @Y30LB33
*                                                              @Y30LB33
* BLOCK DATA SUB-STRUCTURE                                     @Y30LB33
         DC    X'1000'                                         @Y30LB33
         DC    H'8,23,1,8,0'           ILN,IP,OC,OL,CV         @Y30LB33
*                                                              @Y30LB33
*        PRIMARY SPACE FIELD                                   @Y30LB33
*                                                              @Y30LB33
* BLOCK DATA SUB-STRUCTURE                                     @Y30LB33
         DC    X'1000'                                         @Y30LB33
         DC    H'02,56,11,3'           ILEN,IPOS,OCOL,OLEN     @Y30LB33
         DC    X'10A0'                 CONVERSION              @Y30LB33
*                                                              @Y30LB33
*        SECONDARY ALLOCATION FIELD                            @Y30LB33
*                                                              @Y30LB33
* BLOCK DATA SUB-STRUCTURE                                     @Y30LB33
         DC    X'1000'                                         @Y30LB33
         DC    H'02,58,15,3'           ILEN,IPOS,OCOL,OLEN     @Y30LB33
         DC    X'10A0'                 CONVERSION              @Y30LB33
*                                                              @Y30LB33
*        SPACE DISPOSITION FIELD                               @Y30LB33
*                                                              @Y30LB33
* BLOCK DATA SUB-STRUCTURE                                     @Y30LB33
         DC    X'1000'                                         @Y30LB33
         DC    H'5,04,20,5,0'          ILN,IP,OC,OL,CV         @Y30LB33
*                                                              @Y30LB33
*        FREE SPACE THOLD % FIELD                              @Y30LB33
*                                                              @Y30LB33
* INSERT DATA SUB-STRUCTURE                                    @ZA16116
         DC    X'2000'                                         @ZA16116
         DC    H'01,00,29,2'           REF,00,OCOL,OLEN        @ZA16116
         DC    X'10A0'                 CONVERSION              @Y30LB33
*                                                              @G24LB37
*        CONCURRENT USERS FIELD                                @G24LB37
*                                                              @G24LB37
* BLOCK DATA SUB-STRUCTURE                                     @G24LB37
         DC    X'1000'                                         @G24LB37
         DC    H'1,114,37,3'           ILEN,IPOS,OCOL,OLEN     @G24LB37
         DC    X'10A0'                 CONVERSION              @G24LB37
*                                                              @G24LB37
*        RESERVED SPACE FIELD                                  @G24LB37
*                                                              @G24LB37
* BLOCK DATA SUB-STRUCTURE                                     @G24LB37
         DC    X'1000'                                         @G24LB37
         DC    H'1,115,47,2'           ILEN,IPOS,OCOL,OLEN     @G24LB37
         DC    X'10A0'                 CONVERSION              @G24LB37
*                                                              #Y30LB33
*        RETENTION PERIOD FIELD                                @Y30LB33
*                                                              @Y30LB33
* INSERT DATA SUB-STRUCTURE                                    @Y30LB33
         DC    X'2000'                 INSERT FLAG             @Y30LB33
         DC    H'01,00,54,05'          REF,00,OCOL,OLEN        @G24LB37
         DC    X'10A0'                 CONVERSION FLAGS        @Y30LB33
*                                                              @Y30LB33
*        ATTRIBUTE FIELD                                       @Y30LB33
*                                                              @Y30LB33
* BLOCK DATA SUB-STRUCTURE                                     @Y30LB33
         DC    X'1000'                                         @Y30LB33
         DC    H'4,00,61,4,0'          ILN,IP,OC,OL,CV         @G24LB37
*                                                              @Y30LB33
*        OWNER FIELD                                           @Y30LB33
*                                                              @Y30LB33
* BLOCK DATA SUB-STRUCTURE                                     @Y30LB33
         DC    X'1000'                                         @Y30LB33
         DC    H'10,116,67,10,0'       ILN,IP,OC,OL,CV         @G24LB37
*                                                              @Y30LB33
*        ADDRESS FIELD                                         @Y30LB33
*                                                              @Y30LB33
* BLOCK DATA SUB-STRUCTURE                                     @Y30LB33
         DC    X'1000'                                         @Y30LB33
         DC    H'15,126,79,15,0'       ILN,IP,OC,OL,CV         @G24LB37
*                                                              @Y30LB33
*        DESCRIPTION FIELD 1                                   @Y30LB33
*                                                              @Y30LB33
* BLOCK DATA SUB-STRUCTURE                                     @Y30LB33
         DC    X'1000'                                         @Y30LB33
         DC    H'15,84,96,15,0'        ILN,IP,OC,OL,CV         @G24LB37
*                                                              @Y30LB33
*        SECOND LINE                                           @Y30LB33
*                                                              @Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                @Y30LB33
         DC    X'4000'                 SPACE CONTROL FLAG      @Y30LB33
         DC    H'1'                    SPACING FACTOR          @Y30LB33
         DC    C'R '                   SPACING TYPE            @Y30LB33
*                                                              @Y30LB33
*        ADDRESS FIELD                                         @Y30LB33
*                                                              @Y30LB33
* BLOCK DATA SUB-STRUCTURE                                     @Y30LB33
         DC    X'1000'                                         @Y30LB33
         DC    H'15,141,79,15,0'       ILN,IP,OC,OL,CV         @G24LB37
*                                                              @G24LB37
*        DESCRIPTION FIELD 2                                   @G24LB37
*                                                              @G24LB37
* BLOCK DATA SUB-STRUCTURE                                     @G24LB37
         DC    X'1000'                                         @G24LB37
         DC    H'15,99,96,15,0'        ILN,IP,OC,OL,CV         @G24LB37
         SPACE 1                                               @Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                @Y30LB33
         DC    X'D000'                 SPACE CONTROL FLAG      @Y30LB33
         DC    H'2'                    SPACING FACTOR          @Y30LB33
         DC    C'R '                   SPACING TYPE            @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT ENTRIES                                          @Y30LB33
STE291A  DC    C' '                                            @Y30LB33
STE291B  EQU   *                                               @Y30LB33
STE292A  DC    C'OWNER:'                                       @Y30LB33
STE292B  EQU   *                                               @Y30LB33
STE293A  DC    C'ADDRESS:'                                     @Y30LB33
STE293B  EQU   *                                               @Y30LB33
STE294A  DC    C'ALLOCN          FREE'                         @Y30LB33
STE294B  EQU   *                                               @Y30LB33
STE295A  DC    C'DEFAULT  SPACE  SPACE    CONCUR  RES'         @G24LB37
         DC    C'ERVED         ATTR'                           @G24LB37
STE295B  EQU   *                                               @Y30LB33
STE296A  DC    C'GROUP     PRI SEC  DISP   THOLD %'            @Y30LB33
         DC    C'  USERS   SPACE %   RETPD  BRDE  '            @G24LB37
         DC    C'OWNER       ADDRESS'                          @G24LB37
         DC    C'          DESCRIPTION'                        @Y30LB33
STE296B  EQU   *                                               @Y30LB33
TXT29B   EQU   *                                               @Y30LB33
         EJECT                                                 @Y30LB33
************************************************************   @Y30LB33
*                                                              @Y30LB33
*        COPY VOLUME TOTAL LINE                                @Y30LB33
*                                                              @Y30LB33
************************************************************   @Y30LB33
TXT30    DC    Y(TXT30B-TXT30A)        ENTRY LENGTH            @Y30LB33
         DC    X'0000'                 FLAG                    @Y30LB33
         SPACE 1                                               @Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                @Y30LB33
TXT30A   DC    X'4000'                 SPACE CONTROL FLAG      @Y30LB33
         DC    H'1'                    SPACING FACTOR          @Y30LB33
         DC    C'R '                   SPACING TYPE            @Y30LB33
         SPACE 1                                               @Y30LB33
* BLOCK DATA SUB-STRUCTURE                                     @Y30LB33
         DC    X'1000'                                         @Y30LB33
         DC    H'04,00,35,4'           ILEN,IPOS,OCOL,OLEN     @ZA00683
         DC    X'10A0'                 CONVERSION              @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT SUB-STRUCTURE                                    @Y30LB33
         DC    X'8400'                 STATIC TEXT FLAG        @Y30LB33
         DC    Y(STE301B-STE301A)      TEXT LENGTH             @Y30LB33
         DC    Y(STE301A-TXT30A)       TEXT OFFSET             @Y30LB33
         DC    H'1'                    PRINT COLUMN            @YM02885
         DC    Y(STE301B-STE301A)      PRINT FIELD LENGTH      @Y30LB33
         DC    H'0'                    CONVERSION FLAGS        @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT ENTRIES                                          @Y30LB33
STE301A  DC    C'COPIES LISTED:'                               @YM02885
STE301B  EQU   *                                               @Y30LB33
TXT30B   EQU   *                                               @Y30LB33
         EJECT
************************************************************** @Y30LB33
*                                                              @Y30LB33
* IDC2831I ** RECORD CHAIN BROKEN, REST OF CHAIN NOT LISTED    @Y30LB33
*                                                              @Y30LB33
************************************************************** @Y30LB33
TXT31    DC    Y(TXT31B-TXT31A)        ENTRY LENGTH            @Y30LB33
         DC    X'8000'                 FLAG                    @ZA00683
         SPACE 1                                               @Y30LB33
* SPACING CONTROL SUB-STRUCTURE                                @Y30LB33
TXT31A   DC    X'4000'                 SPACE CONTROL FLAG      @Y30LB33
         DC    H'1'                    SPACING FACTOR          @Y30LB33
         DC    C'R '                   SPACING TYPE            @Y30LB33
*                                                              @Y30LB33
*        MESSAGE TEXT                                          @Y30LB33
*                                                              @Y30LB33
* STATIC TEXT SUB-STRUCTURE                                    @Y30LB33
         DC    X'8400'                 STATIC TEXT FLAG        @Y30LB33
         DC    Y(STE311B-STE311A)      TEXT LENGTH             @Y30LB33
         DC    Y(STE311A-TXT31A)       TEXT OFFSET             @Y30LB33
         DC    H'1'                    PRINT COLUMN            @Y30LB33
         DC    Y(STE311B-STE311A)      PRINT FIELD LENGTH      @Y30LB33
         DC    H'0'                    CONVERSION FLAGS        @Y30LB33
         SPACE 1                                               @Y30LB33
* STATIC TEXT ENTRIES                                          @Y30LB33
STE311A  DC    C'IDC2831I ** RECORD CHAIN BROKEN, REST OF'     @Y30LB33
         DC    C' CHAIN NOT LISTED'                            @Y30LB33
STE311B  EQU   *                                               @Y30LB33
TXT31B   EQU   *                                               @Y30LB33
         EJECT
************************************************************** @ZA00683
*                                                              @ZA00683
* IDC0832I NO NON-GROUPED VOLUME RECORDS EXIST IN THE          @ZA00683
*          INVENTORY                                           @ZA00683
*                                                              @ZA00683
************************************************************** @ZA00683
TXT32    DC    Y(TXT32B-TXT32A)        ENTRY LENGTH            @ZA00683
         DC    X'8000'                 FLAG                    @ZA00683
         SPACE 1                                               @ZA00683
* SPACING CONTROL SUB-STRUCTURE                                @ZA00683
TXT32A   DC    X'4000'                 SPACE CONTROL FLAG      @ZA00683
         DC    H'2'                    SPACING FACTOR          @ZA00683
         DC    C'R '                   SPACING TYPE            @ZA00683
*                                                              @ZA00683
*        MESSAGE TEXT                                          @ZA00683
*                                                              @ZA00683
* STATIC TEXT SUB-STRUCTURE                                    @ZA00683
         DC    X'8400'                 STATIC TEXT FLAG        @ZA00683
         DC    Y(STE321B-STE321A)      TEXT LENGTH             @ZA00683
         DC    Y(STE321A-TXT32A)       TEXT OFFSET             @ZA00683
         DC    H'1'                    PRINT COLUMN            @ZA00683
         DC    Y(STE321B-STE321A)      PRINT FIELD LENGTH      @ZA00683
         DC    H'0'                    CONVERSION FLAGS        @ZA00683
         SPACE 1                                               @ZA00683
* STATIC TEXT ENTRIES                                          @ZA00683
STE321A  DC    C'IDC0832I NO NON-GROUPED VOLUME RECORDS EXIST' @ZA00683
         DC    C' IN THE INVENTORY'                            @ZA00683
STE321B  EQU   *                                               @ZA00683
TXT32B   EQU   *                                               @ZA00683
         EJECT                                                 @Z40LB66
************************************************************** @Z40LB66
*                                                              @Z40LB66
*        CARTRIDGE DATA LINE - STATUS REPORT                   @Z40LB66
*                                                              @Z40LB66
************************************************************** @Z40LB66
TXT33    DC    Y(TXT33B-TXT33A)        ENTRY LENGTH            @Z40LB66
         DC    X'0000'                 ENTRY FLAG              @Z40LB66
         SPACE 1                                               @Z40LB66
* SPACING CONTROL SUB-STRUCTURE                                @Z40LB66
TXT33A   DC    X'4000'                 SPACING CONTROL FLAG    @Z40LB66
         DC    H'1'                    SINGLE SPACE            @Z40LB66
         DC    C'R '                   RELATIVE SPACING TYPE   @Z40LB66
*                                                              @Z40LB66
*        CARTRIDGE SERIAL NUMBER FIELD                         @Z40LB66
*                                                              @Z40LB66
* BLOCK DATA SUB-STRUCTURE                                     @Z40LB66
         DC    X'1000'                 BLOCK DATA FLAG         @Z40LB66
         DC    H'12'                   DATA LENGTH             @Z40LB66
         DC    H'44'                   DATA OFFSET             @Z40LB66
         DC    H'1'                    PRINT COLUMN            @Z40LB66
         DC    H'12'                   PRINT FIELD LENGTH      @Z40LB66
         DC    H'0'                    CONVERSION (NONE)       @Z40LB66
*                                                              @Z40LB66
*        VOLUME FIELD                                          @Z40LB66
*                                                              @Z40LB66
* BLOCK DATA SUB-STRUCTURE                                     @Z40LB66
         DC    X'1000'                 BLOCK DATA FLAG         @Z40LB66
         DC    H'6'                    DATA LENGTH             @Z40LB66
         DC    H'25'                   DATA OFFSET             @Z40LB66
         DC    H'16'                   PRINT COLUMN            @Z40LB66
         DC    H'6'                    PRINT FIELD LENGTH      @Z40LB66
         DC    H'0'                    CONVERSION (NONE)       @Z40LB66
*                                                              @Z40LB66
*        MSF ID FIELD                                          @Z40LB66
*                                                              @Z40LB66
* BLOCK DATA SUB-STRUCTURE                                     @Z40LB66
         DC    X'1000'                 BLOCK DATA FLAG         @Z40LB66
         DC    H'5'                    DATA LENGTH             @Z40LB66
         DC    H'164'                  DATA OFFSET             @Z40LB66
         DC    H'25'                   PRINT COLUMN            @Z40LB66
         DC    H'5'                    PRINT FIELD LENGTH      @Z40LB66
         DC    H'0'                    CONVERSION (NONE)       @Z40LB66
*                                                              @Z40LB66
*        STATE FIELD                                           @Z40LB66
*                                                              @Z40LB66
* BLOCK DATA SUB-STRUCTURE                                     @Z40LB66
         DC    X'1000'                 BLOCK DATA FLAG         @Z40LB66
         DC    H'5'                    DATA LENGTH             @Z40LB66
         DC    H'0'                    DATA OFFSET             @Z40LB66
         DC    H'33'                   PRINT COLUMN            @Z40LB66
         DC    H'5'                    PRINT FIELD LENGTH      @Z40LB66
         DC    H'0'                    CONVERSION (NONE)       @Z40LB66
*                                                              @Z40LB66
*        ATTRIBUTE FIELD                                       @Z40LB66
*                                                              @Z40LB66
* BLOCK DATA SUB-STRUCTURE                                     @Z40LB66
         DC    X'1000'                 BLOCK DATA FLAG         @Z40LB66
         DC    H'4'                    DATA LENGTH             @Z40LB66
         DC    H'5'                    DATA OFFSET             @Z40LB66
         DC    H'41'                   PRINT COLUMN            @Z40LB66
         DC    H'4'                    PRINT FIELD LENGTH      @Z40LB66
         DC    H'0'                    CONVERSION (NONE)       @Z40LB66
*                                                              @Z40LB66
*        OWNER FIELD                                           @Z40LB66
*                                                              @Z40LB66
* BLOCK DATA SUB-STRUCTURE                                     @Z40LB66
         DC    X'1000'                 BLOCK DATA FLAG         @Z40LB66
         DC    H'10'                   DATA LENGTH             @Z40LB66
         DC    H'154'                  DATA OFFSET             @Z40LB66
         DC    H'48'                   PRINT COLUMN            @Z40LB66
         DC    H'10'                   PRINT FIELD LENGTH      @Z40LB66
         DC    H'0'                    CONVERSION (NONE)       @Z40LB66
*                                                              @Z40LB66
*        VOLUME TYPE FIELD                                     @Z40LB66
*                                                              @Z40LB66
* BLOCK DATA SUB-STRUCTURE                                     @Z40LB66
         DC    X'1000'                 BLOCK DATA FLAG         @Z40LB66
         DC    H'4'                    DATA LENGTH             @Z40LB66
         DC    H'9'                    DATA OFFSET             @Z40LB66
         DC    H'61'                   PRINT COLUMN            @Z40LB66
         DC    H'4'                    PRINT FIELD LENGTH      @Z40LB66
         DC    H'0'                    CONVERSION (NONE)       @Z40LB66
*                                                              @Z40LB66
*        OTHER CARTRIDGE FIELD                                 @Z40LB66
*                                                              @Z40LB66
* BLOCK DATA SUB-STRUCTURE                                     @Z40LB66
         DC    X'9000'                 DATA BLOCK FLAG         @Z40LB66
         DC    H'12'                   DATA LENGTH             @Z40LB66
         DC    H'57'                   DATA OFFSET             @Z40LB66
         DC    H'68'                   PRINT COLUMN            @Z40LB66
         DC    H'12'                   PRINT FIELD LENGTH      @Z40LB66
         DC    H'0'                    CONVERSION (NONE)       @Z40LB66
TXT33B   EQU   *                                               @Z40LB66
         EJECT                                                 @Z40LB66
************************************************************** @Z40LB66
*                                                              @Z40LB66
*        CARTRIDGE SUMMARY LINES                               @Z40LB66
*                                                              @Z40LB66
************************************************************** @Z40LB66
TXT34    DC    Y(TXT34B-TXT34A)        ENTRY LENGTH            @Z40LB66
         DC    X'0000'                 ENTRY FLAG              @Z40LB66
         SPACE 1                                               @Z40LB66
* SPACING CONTROL SUB-STRUCTURE                                @Z40LB66
TXT34A   DC    X'4000'                 SPACING CONTROL FLAG    @Z40LB66
         DC    H'2'                    DOUBLE SPACE            @Z40LB66
         DC    C'R '                   RELATIVE SPACING TYPE   @Z40LB66
*                                                              @Z40LB66
*        TOTAL CARTRIDGES COUNT                                @Z40LB66
*                                                              @Z40LB66
* STATIC TEXT SUB-STRUCTURE                                    @Z40LB66
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB66
         DC    Y(STE341B-STE341A)      TEXT LENGTH             @Z40LB66
         DC    Y(STE341A-TXT34A)       TEXT OFFSET             @Z40LB66
         DC    H'1'                    PRINT COLUMN            @Z40LB66
         DC    Y(STE341B-STE341A)      PRINT FIELD LENGTH      @Z40LB66
         DC    H'0'                    CONVERSION (NONE)       @Z40LB66
* BLOCK DATA SUB-STRUCTURE                                     @Z40LB66
         DC    X'1000'                 DATA BLOCK FLAG         @Z40LB66
         DC    H'4'                    DATA LENGTH             @Z40LB66
         DC    H'32'                   DATA OFFSET             @Z40LB66
         DC    H'30'                   PRINT COLUMN            @Z40LB66
         DC    H'5'                    PRINT FIELD LENGTH      @Z40LB66
         DC    X'10A0'                 CONVERSION (BIN:DEC)    @Z40LB66
*                                                              @Z40LB66
*        MSF 0 CARTRIDGE COUNT                                 @Z40LB66
*                                                              @Z40LB66
* SPACING CONTROL SUB-STRUCTURE                                @Z40LB66
         DC    X'4000'                 SPACING CONTROL FLAG    @Z40LB66
         DC    H'1'                    SINGLE SPACE            @Z40LB66
         DC    C'R '                   RELATIVE SPACING TYPE   @Z40LB66
* STATIC TEXT SUB-STRUCTURE                                    @Z40LB66
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB66
         DC    Y(STE342B-STE342A)      TEXT LENGTH             @Z40LB66
         DC    Y(STE342A-TXT34A)       TEXT OFFSET             @Z40LB66
         DC    H'1'                    PRINT COLUMN            @Z40LB66
         DC    Y(STE342B-STE342A)      PRINT FIELD LENGTH      @Z40LB66
         DC    H'0'                    CONVERSION (NONE)       @Z40LB66
* BLOCK DATA SUB-STRUCTURE                                     @Z40LB66
         DC    X'1000'                 DATA BLOCK FLAG         @Z40LB66
         DC    H'4'                    DATA LENGTH             @Z40LB66
         DC    H'36'                   DATA OFFSET             @Z40LB66
         DC    H'30'                   PRINT COLUMN            @Z40LB66
         DC    H'5'                    PRINT FIELD LENGTH      @Z40LB66
         DC    X'10A0'                 CONVERSION (BIN:DEC)    @Z40LB66
*                                                              @Z40LB66
*        MSF 1 CARTRIDGE COUNT                                 @Z40LB66
*                                                              @Z40LB66
* SPACING CONTROL SUB-STRUCTURE                                @Z40LB66
         DC    X'4000'                 SPACING CONTROL FLAG    @Z40LB66
         DC    H'1'                    SINGLE SPACE            @Z40LB66
         DC    C'R '                   RELATIVE SPACING TYPE   @Z40LB66
* STATIC TEXT SUB-STRUCTURE                                    @Z40LB66
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB66
         DC    Y(STE343B-STE343A)      TEXT LENGTH             @Z40LB66
         DC    Y(STE343A-TXT34A)       TEXT OFFSET             @Z40LB66
         DC    H'1'                    PRINT COLUMN            @Z40LB66
         DC    Y(STE343B-STE343A)      PRINT FIELD LENGTH      @Z40LB66
         DC    H'0'                    CONVERSION (NONE)       @Z40LB66
* BLOCK DATA SUB-STRUCTURE                                     @Z40LB66
         DC    X'1000'                 DATA BLOCK FLAG         @Z40LB66
         DC    H'4'                    DATA LENGTH             @Z40LB66
         DC    H'40'                   DATA OFFSET             @Z40LB66
         DC    H'30'                   PRINT COLUMN            @Z40LB66
         DC    H'5'                    PRINT FIELD LENGTH      @Z40LB66
         DC    X'10A0'                 CONVERSION (BIN:DEC)    @Z40LB66
*                                                              @Z40LB66
*        EJECTED CARTRIDGE COUNT                               @Z40LB66
*                                                              @Z40LB66
* SPACING CONTROL SUB-STRUCTURE                                @Z40LB66
         DC    X'4000'                 SPACING CONTROL FLAG    @Z40LB66
         DC    H'1'                    SINGLE SPACE            @Z40LB66
         DC    C'R '                   RELATIVE SPACING TYPE   @Z40LB66
* STATIC TEXT SUB-STRUCTURE                                    @Z40LB66
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB66
         DC    Y(STE344B-STE344A)      TEXT LENGTH             @Z40LB66
         DC    Y(STE344A-TXT34A)       TEXT OFFSET             @Z40LB66
         DC    H'1'                    PRINT COLUMN            @Z40LB66
         DC    Y(STE344B-STE344A)      PRINT FIELD LENGTH      @Z40LB66
         DC    H'0'                    CONVERSION (NONE)       @Z40LB66
* BLOCK DATA SUB-STRUCTURE                                     @Z40LB66
         DC    X'9000'                 DATA BLOCK FLAG         @Z40LB66
         DC    H'4'                    DATA LENGTH             @Z40LB66
         DC    H'44'                   DATA OFFSET             @Z40LB66
         DC    H'30'                   PRINT COLUMN            @Z40LB66
         DC    H'5'                    PRINT FIELD LENGTH      @Z40LB66
         DC    X'10A0'                 CONVERSION (BIN:DEC)    @Z40LB66
* STATIC TEXT ENTRIES                                          @Z40LB66
STE341A  DC    C'CARTRIDGES LISTED:'                           @Z40LB66
STE341B  EQU   *                                               @Z40LB66
STE342A  DC    C'CARTRIDGES FOR MSF 0 LISTED:'                 @Z40LB66
STE342B  EQU   *                                               @Z40LB66
STE343A  DC    C'CARTRIDGES FOR MSF 1 LISTED:'                 @Z40LB66
STE343B  EQU   *                                               @Z40LB66
STE344A  DC    C'EJECTED CARTRIDGES LISTED:'                   @Z40LB66
STE344B  EQU   *                                               @Z40LB66
TXT34B   EQU   *                                               @Z40LB66
         EJECT                                                 @Z40LB66
************************************************************** @Z40LB66
*                                                              @Z40LB66
* IDC2833I ** CARTRIDGE RECORD (CART SER) NOT FOUND IN         @Z40LB66
*          INVENTORY                                           @Z40LB66
*                                                              @Z40LB66
************************************************************** @Z40LB66
TXT35    DC    Y(TXT35B-TXT35A)        ENTRY LENGTH            @Z40LB66
         DC    X'8000'                 MESSAGE FLAG            @Z40LB66
         SPACE 1                                               @Z40LB66
* SPACING CONTROL SUB-STRUCTURE                                @Z40LB66
TXT35A   DC    X'4000'                 SPACING CONTROL FLAG    @Z40LB66
         DC    H'1'                    SINGLE SPACE            @Z40LB66
         DC    C'R '                   RELATIVE SPACING TYPE   @Z40LB66
* STATIC TEXT SUB-STRUCTURE                                    @Z40LB66
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB66
         DC    Y(STE351B-STE351A)      TEXT LENGTH             @Z40LB66
         DC    Y(STE351A-TXT35A)       TEXT OFFSET             @Z40LB66
         DC    H'1'                    PRINT COLUMN            @Z40LB66
         DC    Y(STE351B-STE351A)      PRINT FIELD LENGTH      @Z40LB66
         DC    H'0'                    CONVERSION (NONE)       @Z40LB66
* BLOCK DATA SUB-STRUCTURE                                     @Z40LB66
         DC    X'1000'                 DATA BLOCK FLAG         @Z40LB66
         DC    H'12'                   DATA LENGTH             @Z40LB66
         DC    H'0'                    DATA OFFSET             @Z40LB66
         DC    H'30'                   PRINT COLUMN            @Z40LB66
         DC    H'12'                   PRINT FIELD LENGTH      @Z40LB66
         DC    H'0'                    CONVERSION (NONE)       @Z40LB66
* STATIC TEXT SUB-STRUCTURE                                    @Z40LB66
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB66
         DC    Y(STE352B-STE352A)      TEXT LENGTH             @Z40LB66
         DC    Y(STE352A-TXT35A)       TEXT OFFSET             @Z40LB66
         DC    H'43'                   PRINT COLUMN            @Z40LB66
         DC    Y(STE352B-STE352A)      PRINT FIELD LENGTH      @Z40LB66
         DC    H'0'                    CONVERSION (NONE)       @Z40LB66
* SPACING CONTROL SUB-STRUCTURE                                @Z40LB66
         DC    X'C000'                 SPACING CONTROL FLAG    @Z40LB66
         DC    H'2'                    DOUBLE SPACE AFTER MSG  @Z40LB66
         DC    C'R '                   RELATIVE SPACING TYPE   @Z40LB66
* STATIC TEXT ENTRIES                                          @Z40LB66
STE351A  DC    C'IDC2833I ** CARTRIDGE RECORD'                 @Z40LB66
STE351B  EQU   *                                               @Z40LB66
STE352A  DC    C'NOT FOUND IN INVENTORY'                       @Z40LB66
STE352B  EQU   *                                               @Z40LB66
TXT35B   EQU   *                                               @Z40LB66
         EJECT                                                 @Z40LB66
************************************************************** @Z40LB66
*                                                              @Z40LB66
* IDC2834I VOL (VOLSER) NOT IN THE INVENTORY FOR CART          @Z40LB66
*          (CART SER)                                          @Z40LB66
*                                                              @Z40LB66
************************************************************** @Z40LB66
TXT36    DC    Y(TXT36B-TXT36A)        ENTRY LENGTH            @Z40LB66
         DC    X'8000'                 MESSAGE FLAG            @Z40LB66
         SPACE 1                                               @Z40LB66
* SPACING CONTROL SUB-STRUCTURE                                @Z40LB66
TXT36A   DC    X'4000'                 SPACING CONTROL FLAG    @Z40LB66
         DC    H'2'                    DOUBLE SPACE            @Z40LB66
         DC    C'R '                   RELATIVE SPACING TYPE   @Z40LB66
* STATIC TEXT SUB-STRUCTURE                                    @Z40LB66
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB66
         DC    Y(STE361B-STE361A)      TEXT LENGTH             @Z40LB66
         DC    Y(STE361A-TXT36A)       TEXT OFFSET             @Z40LB66
         DC    H'1'                    PRINT COLUMN            @Z40LB66
         DC    Y(STE361B-STE361A)      PRINT FIELD LENGTH      @Z40LB66
         DC    H'0'                    CONVERSION (NONE)       @Z40LB66
* BLOCK DATA SUB-STRUCTURE                                     @Z40LB66
         DC    X'1000'                 BLOCK DATA FLAG         @Z40LB66
         DC    H'6'                    DATA LENGTH             @Z40LB66
         DC    H'20'                   DATA OFFSET             @Z40LB66
         DC    H'17'                   PRINT COLUMN            @Z40LB66
         DC    H'6'                    PRINT FIELD LENGTH      @Z40LB66
         DC    H'0'                    CONVERSION (NONE)       @Z40LB66
* STATIC TEXT SUB-STRUCTURE                                    @Z40LB66
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB66
         DC    Y(STE362B-STE362A)      TEXT LENGTH             @Z40LB66
         DC    Y(STE362A-TXT36A)       TEXT OFFSET             @Z40LB66
         DC    H'24'                   PRINT COLUMN            @Z40LB66
         DC    Y(STE362B-STE362A)      PRINT FIELD LENGTH      @Z40LB66
         DC    H'0'                    CONVERSION (NONE)       @Z40LB66
* BLOCK DATA SUB-STRUCTURE                                     @Z40LB66
         DC    X'1000'                 BLOCK DATA FLAG         @Z40LB66
         DC    H'12'                   DATA LENGTH             @Z40LB66
         DC    H'1'                    DATA OFFSET             @Z40LB66
         DC    H'59'                   PRINT COLUMN            @Z40LB66
         DC    H'12'                   PRINT FIELD LENGTH      @Z40LB66
         DC    H'0'                    CONVERSION (NONE)       @Z40LB66
* SPACING CONTROL SUB-STRUCTURE                                @Z40LB66
         DC    X'C000'                 SPACING CONTROL FLAG    @Z40LB66
         DC    H'2'                    DOUBLE SPACE AFTER MSG  @Z40LB66
         DC    C'R '                   RELATIVE SPACING TYPE   @Z40LB66
* STATIC TEXT ENTRIES                                          @Z40LB66
STE361A  DC    C'IDC2834I VOLUME'                              @Z40LB66
STE361B  EQU   *                                               @Z40LB66
STE362A  DC    C'NOT IN THE INVENTORY FOR CARTRIDGE'           @Z40LB66
STE362B  EQU   *                                               @Z40LB66
TXT36B   EQU   *                                               @Z40LB66
         EJECT                                                 @Z40LB66
************************************************************   @Z40LB66
*                                                              @Z40LB66
*        CARTRIDGE REPORT LEGEND                               @Z40LB66
*                                                              @Z40LB66
************************************************************   @Z40LB66
TXT37    DC    Y(TXT37B-TXT37A)        ENTRY LENGTH            @Z40LB66
         DC    X'0000'                 FLAG                    @Z40LB66
         SPACE 1                                               @Z40LB66
* SPACING CONTROL SUB-STRUCTURE                                @Z40LB66
TXT37A   DC    X'4000'                 SPACE CONTROL FLAG      @Z40LB66
         DC    H'1'                    SPACING FACTOR          @Z40LB66
         DC    C'E '                   SPACING TYPE            @Z40LB66
         SPACE 1                                               @Z40LB66
* STATIC TEXT SUB-STRUCTURE                                    @Z40LB66
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB66
         DC    Y(STE371B-STE371A)      TEXT LENGTH             @Z40LB66
         DC    Y(STE371A-TXT37A)       TEXT OFFSET             @Z40LB66
         DC    H'48'                   PRINT COLUMN            @Z40LB66
         DC    Y(STE371B-STE371A)      PRINT FIELD LENGTH      @Z40LB66
         DC    H'0'                    CONVERSION              @Z40LB66
*                                                              @Z40LB66
*        COLUMN DESCRIPTIONS                                   @Z40LB66
*                                                              @Z40LB66
* SPACING CONTROL SUB-STRUCTURE                                @Z40LB66
         DC    X'4000'                 SPACE CONTROL FLAG      @Z40LB66
         DC    H'2'                    SPACING FACTOR          @Z40LB66
         DC    C'R '                   SPACING TYPE            @Z40LB66
         SPACE 1                                               @Z40LB66
* STATIC TEXT SUB-STRUCTURE                                    @Z40LB66
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB66
         DC    Y(STE372B-STE372A)      TEXT LENGTH             @Z40LB66
         DC    Y(STE372A-TXT37A)       TEXT OFFSET             @Z40LB66
         DC    H'1'                    PRINT COLUMN            @Z40LB66
         DC    Y(STE372B-STE372A)      PRINT FIELD LENGTH      @Z40LB66
         DC    H'0'                    CONVERSION              @Z40LB66
*                                                              @Z40LB66
*        ATTRIBUTE LINE                                        @Z40LB66
*                                                              @Z40LB66
* SPACING CONTROL SUB-STRUCTURE                                @Z40LB66
         DC    X'4000'                 SPACE CONTROL FLAG      @Z40LB66
         DC    H'2'                    SPACING FACTOR          @Z40LB66
         DC    C'R '                   SPACING TYPE            @Z40LB66
         SPACE 1                                               @Z40LB66
* STATIC TEXT SUB-STRUCTURE                                    @Z40LB66
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB66
         DC    Y(STE373B-STE373A)      TEXT LENGTH             @Z40LB66
         DC    Y(STE373A-TXT37A)       TEXT OFFSET             @Z40LB66
         DC    H'1'                    PRINT COLUMN            @Z40LB66
         DC    Y(STE373B-STE373A)      PRINT FIELD LENGTH      @Z40LB66
         DC    H'0'                    CONVERSION FLAGS        @Z40LB66
         SPACE 1                                               @Z40LB66
* SPACING CONTROL SUB-STRUCTURE                                @Z40LB66
         DC    X'4000'                 SPACE CONTROL FLAG      @Z40LB66
         DC    H'1'                    SPACING FACTOR          @Z40LB66
         DC    C'R '                   SPACING TYPE            @Z40LB66
         SPACE 1                                               @Z40LB66
* STATIC TEXT SUB-STRUCTURE                                    @Z40LB66
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB66
         DC    Y(STE373D-STE373C)      TEXT LENGTH             @Z40LB66
         DC    Y(STE373C-TXT37A)       TEXT OFFSET             @Z40LB66
         DC    H'24'                   PRINT COLUMN            @Z40LB66
         DC    Y(STE373D-STE373C)      PRINT FIELD LENGTH      @Z40LB66
         DC    H'0'                    CONVERSION FLAGS        @Z40LB66
         SPACE 1                                               @Z40LB66
* SPACING CONTROL SUB-STRUCTURE                                @Z40LB66
         DC    X'4000'                 SPACE CONTROL FLAG      @Z40LB66
         DC    H'1'                    SPACING FACTOR          @Z40LB66
         DC    C'R '                   SPACING TYPE            @Z40LB66
         SPACE 1                                               @Z40LB66
* STATIC TEXT SUB-STRUCTURE                                    @Z40LB66
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB66
         DC    Y(STE373F-STE373E)      TEXT LENGTH             @Z40LB66
         DC    Y(STE373E-TXT37A)       TEXT OFFSET             @Z40LB66
         DC    H'24'                   PRINT COLUMN            @Z40LB66
         DC    Y(STE373F-STE373E)      PRINT FIELD LENGTH      @Z40LB66
         DC    H'0'                    CONVERSION FLAGS        @Z40LB66
         SPACE 1                                               @Z40LB66
* SPACING CONTROL SUB-STRUCTURE                                @Z40LB66
         DC    X'4000'                 SPACE CONTROL FLAG      @Z40LB66
         DC    H'1'                    SPACING FACTOR          @Z40LB66
         DC    C'R '                   SPACING TYPE            @Z40LB66
         SPACE 1                                               @Z40LB66
* STATIC TEXT SUB-STRUCTURE                                    @Z40LB66
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB66
         DC    Y(STE373H-STE373G)      TEXT LENGTH             @Z40LB66
         DC    Y(STE373G-TXT37A)       TEXT OFFSET             @Z40LB66
         DC    H'24'                   PRINT COLUMN            @Z40LB66
         DC    Y(STE373H-STE373G)      PRINT FIELD LENGTH      @Z40LB66
         DC    H'0'                    CONVERSION FLAGS        @Z40LB66
         SPACE 1                                               @Z40LB66
* SPACING CONTROL SUB-STRUCTURE                                @Z40LB66
         DC    X'4000'                 SPACE CONTROL FLAG      @Z40LB66
         DC    H'1'                    SPACING FACTOR          @Z40LB66
         DC    C'R '                   SPACING TYPE            @Z40LB66
         SPACE 1                                               @Z40LB66
* STATIC TEXT SUB-STRUCTURE                                    @Z40LB66
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB66
         DC    Y(STE373J-STE373I)      TEXT LENGTH             @Z40LB66
         DC    Y(STE373I-TXT37A)       TEXT OFFSET             @Z40LB66
         DC    H'24'                   PRINT COLUMN            @Z40LB66
         DC    Y(STE373J-STE373I)      PRINT FIELD LENGTH      @Z40LB66
         DC    H'0'                    CONVERSION FLAGS        @Z40LB66
*                                                              @Z40LB66
*        CARTRIDGE LINE                                        @Z40LB66
*                                                              @Z40LB66
* SPACING CONTROL SUB-STRUCTURE                                @Z40LB66
         DC    X'4000'                 SPACE CONTROL FLAG      @Z40LB66
         DC    H'2'                    SPACING FACTOR          @Z40LB66
         DC    C'R '                   SPACING TYPE            @Z40LB66
         SPACE 1                                               @Z40LB66
* STATIC TEXT SUB-STRUCTURE                                    @Z40LB66
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB66
         DC    Y(STE374B-STE374A)      TEXT LENGTH             @Z40LB66
         DC    Y(STE374A-TXT37A)       TEXT OFFSET             @Z40LB66
         DC    H'1'                    PRINT COLUMN            @Z40LB66
         DC    Y(STE374B-STE374A)      PRINT FIELD LENGTH      @Z40LB66
         DC    H'0'                    CONVERSION FLAGS        @Z40LB66
*                                                              @Z40LB66
*        MSFID LINE                                            @Z40LB66
*                                                              @Z40LB66
* SPACING CONTROL SUB-STRUCTURE                                @Z40LB66
         DC    X'4000'                 SPACE CONTROL FLAG      @Z40LB66
         DC    H'2'                    SPACING FACTOR          @Z40LB66
         DC    C'R '                   SPACING TYPE            @Z40LB66
         SPACE 1                                               @Z40LB66
* STATIC TEXT SUB-STRUCTURE                                    @Z40LB66
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB66
         DC    Y(STE375B-STE375A)      TEXT LENGTH             @Z40LB66
         DC    Y(STE375A-TXT37A)       TEXT OFFSET             @Z40LB66
         DC    H'1'                    PRINT COLUMN            @Z40LB66
         DC    Y(STE375B-STE375A)      PRINT FIELD LENGTH      @Z40LB66
         DC    H'0'                    CONVERSION FLAGS        @Z40LB66
*                                                              @Z40LB66
*        OTHER CARTRIDGE LINE                                  @Z40LB66
*                                                              @Z40LB66
* SPACING CONTROL SUB-STRUCTURE                                @Z40LB66
         DC    X'4000'                 SPACE CONTROL FLAG      @Z40LB66
         DC    H'2'                    SPACING FACTOR          @Z40LB66
         DC    C'R '                   SPACING TYPE            @Z40LB66
         SPACE 1                                               @Z40LB66
* STATIC TEXT SUB-STRUCTURE                                    @Z40LB66
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB66
         DC    Y(STE376B-STE376A)      TEXT LENGTH             @Z40LB66
         DC    Y(STE376A-TXT37A)       TEXT OFFSET             @Z40LB66
         DC    H'1'                    PRINT COLUMN            @Z40LB66
         DC    Y(STE376B-STE376A)      PRINT FIELD LENGTH      @Z40LB66
         DC    H'0'                    CONVERSION FLAGS        @Z40LB66
*                                                              @Z40LB66
*        OWNER LINE                                            @Z40LB66
*                                                              @Z40LB66
* SPACING CONTROL SUB-STRUCTURE                                @Z40LB66
         DC    X'4000'                 SPACE CONTROL FLAG      @Z40LB66
         DC    H'2'                    SPACING FACTOR          @Z40LB66
         DC    C'R '                   SPACING TYPE            @Z40LB66
         SPACE 1                                               @Z40LB66
* STATIC TEXT SUB-STRUCTURE                                    @Z40LB66
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB66
         DC    Y(STE377B-STE377A)      TEXT LENGTH             @Z40LB66
         DC    Y(STE377A-TXT37A)       TEXT OFFSET             @Z40LB66
         DC    H'1'                    PRINT COLUMN            @Z40LB66
         DC    Y(STE377B-STE377A)      PRINT FIELD LENGTH      @Z40LB66
         DC    H'0'                    CONVERSION FLAGS        @Z40LB66
*                                                              @Z40LB66
*        STATE LINE                                            @Z40LB66
*                                                              @Z40LB66
* SPACING CONTROL SUB-STRUCTURE                                @Z40LB66
         DC    X'4000'                 SPACE CONTROL FLAG      @Z40LB66
         DC    H'2'                    SPACING FACTOR          @Z40LB66
         DC    C'R '                   SPACING TYPE            @Z40LB66
         SPACE 1                                               @Z40LB66
* STATIC TEXT SUB-STRUCTURE                                    @Z40LB66
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB66
         DC    Y(STE378B-STE378A)      TEXT LENGTH             @Z40LB66
         DC    Y(STE378A-TXT37A)       TEXT OFFSET             @Z40LB66
         DC    H'1'                    PRINT COLUMN            @Z40LB66
         DC    Y(STE378B-STE378A)      PRINT FIELD LENGTH      @Z40LB66
         DC    H'0'                    CONVERSION FLAGS        @Z40LB66
         SPACE 1                                               @Z40LB66
* SPACING CONTROL SUB-STRUCTURE                                @Z40LB66
         DC    X'4000'                 SPACE CONTROL FLAG      @Z40LB66
         DC    H'1'                    SPACING FACTOR          @Z40LB66
         DC    C'R '                   SPACING TYPE            @Z40LB66
         SPACE 1                                               @Z40LB66
* STATIC TEXT SUB-STRUCTURE                                    @Z40LB66
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB66
         DC    Y(STE378D-STE378C)      TEXT LENGTH             @Z40LB66
         DC    Y(STE378C-TXT37A)       TEXT OFFSET             @Z40LB66
         DC    H'24'                   PRINT COLUMN            @Z40LB66
         DC    Y(STE378D-STE378C)      PRINT FIELD LENGTH      @Z40LB66
         DC    H'0'                    CONVERSION FLAGS        @Z40LB66
         SPACE 1                                               @Z40LB66
* STATIC TEXT SUB-STRUCTURE                                    @Z40LB66
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB66
         DC    Y(STE378F-STE378E)      TEXT LENGTH             @Z40LB66
         DC    Y(STE378E-TXT37A)       TEXT OFFSET             @Z40LB66
         DC    H'61'                   PRINT COLUMN            @Z40LB66
         DC    Y(STE378F-STE378E)      PRINT FIELD LENGTH      @Z40LB66
         DC    H'0'                    CONVERSION FLAGS        @Z40LB66
*                                                              @Z40LB66
*        VOLUME TYPE LINE                                      @Z40LB66
*                                                              @Z40LB66
* SPACING CONTROL SUB-STRUCTURE                                @Z40LB66
         DC    X'4000'                 SPACE CONTROL FLAG      @Z40LB66
         DC    H'2'                    SPACING FACTOR          @Z40LB66
         DC    C'R '                   SPACING TYPE            @Z40LB66
         SPACE 1                                               @Z40LB66
* STATIC TEXT SUB-STRUCTURE                                    @Z40LB66
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB66
         DC    Y(STE379B-STE379A)      TEXT LENGTH             @Z40LB66
         DC    Y(STE379A-TXT37A)       TEXT OFFSET             @Z40LB66
         DC    H'1'                    PRINT COLUMN            @Z40LB66
         DC    Y(STE379B-STE379A)      PRINT FIELD LENGTH      @Z40LB66
         DC    H'0'                    CONVERSION FLAGS        @Z40LB66
         SPACE 1                                               @Z40LB66
* SPACING CONTROL SUB-STRUCTURE                                @Z40LB66
         DC    X'4000'                 SPACE CONTROL FLAG      @Z40LB66
         DC    H'1'                    SPACING FACTOR          @Z40LB66
         DC    C'R '                   SPACING TYPE            @Z40LB66
         SPACE 1                                               @Z40LB66
* STATIC TEXT SUB-STRUCTURE                                    @Z40LB66
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB66
         DC    Y(STE379D-STE379C)      TEXT LENGTH             @Z40LB66
         DC    Y(STE379C-TXT37A)       TEXT OFFSET             @Z40LB66
         DC    H'24'                   PRINT COLUMN            @Z40LB66
         DC    Y(STE379D-STE379C)      PRINT FIELD LENGTH      @Z40LB66
         DC    H'0'                    CONVERSION FLAGS        @Z40LB66
         SPACE 1                                               @Z40LB66
* STATIC TEXT SUB-STRUCTURE                                    @Z40LB66
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB66
         DC    Y(STE379H-STE379G)      TEXT LENGTH             @Z40LB66
         DC    Y(STE379G-TXT37A)       TEXT OFFSET             @Z40LB66
         DC    H'61'                   PRINT COLUMN            @Z40LB66
         DC    Y(STE379H-STE379G)      PRINT FIELD LENGTH      @Z40LB66
         DC    H'0'                    CONVERSION FLAGS        @Z40LB66
         SPACE 1                                               @Z40LB66
* SPACING CONTROL SUB-STRUCTURE                                @Z40LB66
         DC    X'4000'                 SPACE CONTROL FLAG      @Z40LB66
         DC    H'1'                    SPACING FACTOR          @Z40LB66
         DC    C'R '                   SPACING TYPE            @Z40LB66
         SPACE 1                                               @Z40LB66
* STATIC TEXT SUB-STRUCTURE                                    @Z40LB66
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB66
         DC    Y(STE379F-STE379E)      TEXT LENGTH             @Z40LB66
         DC    Y(STE379E-TXT37A)       TEXT OFFSET             @Z40LB66
         DC    H'24'                   PRINT COLUMN            @Z40LB66
         DC    Y(STE379F-STE379E)      PRINT FIELD LENGTH      @Z40LB66
         DC    H'0'                    CONVERSION FLAGS        @Z40LB66
         SPACE 1                                               @Z40LB66
* STATIC TEXT SUB-STRUCTURE                                    @Z40LB66
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB66
         DC    Y(STE379J-STE379I)      TEXT LENGTH             @Z40LB66
         DC    Y(STE379I-TXT37A)       TEXT OFFSET             @Z40LB66
         DC    H'61'                   PRINT COLUMN            @Z40LB66
         DC    Y(STE379J-STE379I)      PRINT FIELD LENGTH      @Z40LB66
         DC    H'0'                    CONVERSION FLAGS        @Z40LB66
         SPACE 1                                               @Z40LB66
* SPACING CONTROL SUB-STRUCTURE                                @Z40LB66
         DC    X'4000'                 SPACE CONTROL FLAG      @Z40LB66
         DC    H'1'                    SPACING FACTOR          @Z40LB66
         DC    C'R '                   SPACING TYPE            @Z40LB66
         SPACE 1                                               @Z40LB66
* STATIC TEXT SUB-STRUCTURE                                    @Z40LB66
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB66
         DC    Y(STE379L-STE379K)      TEXT LENGTH             @Z40LB66
         DC    Y(STE379K-TXT37A)       TEXT OFFSET             @Z40LB66
         DC    H'24'                   PRINT COLUMN            @Z40LB66
         DC    Y(STE379L-STE379K)      PRINT FIELD LENGTH      @Z40LB66
         DC    H'0'                    CONVERSION FLAGS        @Z40LB66
*                                                              @Z40LB66
*        VOLUME LINE                                           @Z40LB66
*                                                              @Z40LB66
* SPACING CONTROL SUB-STRUCTURE                                @Z40LB66
         DC    X'4000'                 SPACE CONTROL FLAG      @Z40LB66
         DC    H'2'                    SPACING FACTOR          @Z40LB66
         DC    C'R '                   SPACING TYPE            @Z40LB66
         SPACE 1                                               @Z40LB66
* STATIC TEXT SUB-STRUCTURE                                    @Z40LB66
         DC    X'8400'                 STATIC TEXT FLAG        @Z40LB66
         DC    Y(STE3710B-STE3710A)    TEXT LENGTH             @Z40LB66
         DC    Y(STE3710A-TXT37A)      TEXT OFFSET             @Z40LB66
         DC    H'1'                    PRINT COLUMN            @Z40LB66
         DC    Y(STE3710B-STE3710A)    PRINT FIELD LENGTH      @Z40LB66
         DC    H'0'                    CONVERSION FLAGS        @Z40LB66
         SPACE 1                                               @Z40LB66
* STATIC TEXT ENTRIES                                          @Z40LB66
STE371A  DC    C'LEGEND'                                       @Z40LB66
STE371B  EQU   *                                               @Z40LB66
STE372A  DC    C'-FIELD-             -DESCRIPTION-'            @Z40LB66
STE372B  EQU   *                                               @Z40LB66
STE373A  DC    C'ATTR                '                         @Z40LB66
         DC    C'ATTRIBUTES OF THE VOLUME INDICATED BY '       @Z40LB66
         DC    C'EITHER A CHARACTER IDENTIFIER IN THE COLUMN ' @Z40LB66
         DC    C'OR A BLANK'                                   @Z40LB66
STE373B  EQU   *                                               @Z40LB66
STE373C  DC    C'B - BIND, BLANK FOR NOBIND'                   @Z40LB66
STE373D  EQU   *                                               @Z40LB66
STE373E  DC    C'R - READONLY, BLANK FOR READWRITE'            @Z40LB66
STE373F  EQU   *                                               @Z40LB66
STE373G  DC    C'D - DASDERASE, BLANK FOR NODASDERASE'         @Z40LB66
STE373H  EQU   *                                               @Z40LB66
STE373I  DC    C'E - EXCLUSIVE, BLANK FOR SHARED'              @Z40LB66
STE373J  EQU   *                                               @Z40LB66
STE374A  DC    C'CARTRIDGE           '                         @Z40LB66
         DC    C'SERIAL NUMBER OF THE CARTRIDGE'               @Z40LB66
STE374B  EQU   *                                               @Z40LB66
STE375A  DC    C'MSFID               '                         @Z40LB66
         DC    C'MSF ID OF CARTRIDGE IF NOT EJECTED;'          @Z40LB66
         DC    C' BLANK IF EJECTED'                            @Z40LB66
STE375B  EQU   *                                               @Z40LB66
STE376A  DC    C'OTHER CARTRIDGE     '                         @Z40LB66
         DC    C'SERIAL NUMBER OF THE OTHER CARTRIDGE OF '     @Z40LB66
         DC    C'THE VOLUME'                                   @Z40LB66
STE376B  EQU   *                                               @Z40LB66
STE377A  DC    C'OWNER               '                         @Z40LB66
         DC    C'OWNER NAME OF THE VOLUME'                     @Z40LB66
STE377B  EQU   *                                               @Z40LB66
STE378A  DC    C'STATE               '                         @Z40LB66
         DC    C'STATUS OF THE VOLUME'                         @Z40LB66
STE378B  EQU   *                                               @Z40LB66
STE378C  DC    C'ACTIV - ACTIVE, MOUNTABLE'                    @Z40LB66
STE378D  EQU   *                                               @Z40LB66
STE378E  DC    C'INACT - INACTIVE, NONMOUNTABLE'               @Z40LB66
STE378F  EQU   *                                               @Z40LB66
STE379A  DC    C'VOL TYPE            '                         @Z40LB66
         DC    C'TYPE OF VOLUME OR ITS COPIES; BLANK'          @Z40LB66
         DC    C' INDICATES NON-GROUPED BASE VOLUME'           @Z40LB66
STE379B  EQU   *                                               @Z40LB66
STE379C  DC    C'BKUP - COPY, BACKUP'                          @Z40LB66
STE379D  EQU   *                                               @Z40LB66
STE379E  DC    C'COPY - COPY, NON-BACKUP'                      @Z40LB66
STE379F  EQU   *                                               @Z40LB66
STE379G  DC    C'GEN  - GENERAL'                               @Z40LB66
STE379H  EQU   *                                               @Z40LB66
STE379I  DC    C'RSTR - RESTRICTED'                            @Z40LB66
STE379J  EQU   *                                               @Z40LB66
STE379K  DC    C'DUP - DUPLICATE'                              @Z40LB66
STE379L  EQU   *                                               @Z40LB66
STE3710A DC    C'VOLUME              '                         @Z40LB66
         DC    C'VOLUME SERIAL NUMBER'                         @Z40LB66
STE3710B EQU   *                                               @Z40LB66
TXT37B   EQU   *                                               @Z40LB66
         EJECT                                                 @Z40LB66
************************************************************** @Z40LB66
*                                                              @Z40LB66
*        CARTRIDGE SUBTITLES - STATUS REPORT                   @Z40LB66
*                                                              @Z40LB66
************************************************************** @Z40LB66
TXT38    DC    Y(TXT38B-TXT38A)        ENTRY LENGTH            @Z40LB66
         DC    X'0100'                 ENTRY TYPE              @Z40LB66
         SPACE 1                                               @Z40LB66
* STATIC TEXT SUB-STRUCTURE                                    @Z40LB66
TXT38A   DC    X'8400'                 STATIC TEXT FLAG        @Z40LB66
         DC    Y(STE381B-STE381A)      TEXT LENGTH             @Z40LB66
         DC    Y(STE381A-TXT38A)       TEXT OFFSET             @Z40LB66
         DC    H'1'                    PRINT COLUMN            @Z40LB66
         DC    Y(STE381B-STE381A)      PRINT FIELD LENGTH      @Z40LB66
         DC    H'0'                    CONVERSION (NONE)       @Z40LB66
* STATIC TEXT ENTRIES                                          @Z40LB66
STE381A  DC    C'0                                        '    @Z40LB66
         DC    C'ATTR                VOL    OTHER        '     @Z40LB66
         DC    C'                                        '     @Z40LB66
         DC    C' CARTRIDGE      VOLUME   MSFID   STATE   '    @Z40LB66
         DC    C'BRDE   OWNER        TYPE   CARTRIDGE    '     @Z40LB66
         DC    C'                                        '     @Z40LB66
STE381B  EQU   *                                               @Z40LB66
TXT38B   EQU   *                                               @Z40LB66
         EJECT                                                 @Z40LB66
************************************************************** @ZA11679
*                                                              @ZA11679
* IDC0832I NO DUPLICATE VOLUME RECORDS EXIST IN THE            @ZA11679
*          INVENTORY                                           @ZA11679
*                                                              @ZA11679
************************************************************** @ZA11679
TXT39    DC    Y(TXT39B-TXT39A)        ENTRY LENGTH            @ZA11679
         DC    X'8000'                 FLAG                    @ZA11679
         SPACE 1                                               @ZA11679
* SPACING CONTROL SUB-STRUCTURE                                @ZA11679
TXT39A   DC    X'4000'                 SPACE CONTROL FLAG      @ZA11679
         DC    H'2'                    SPACING FACTOR          @ZA11679
         DC    C'R '                   SPACING TYPE            @ZA11679
*                                                              @ZA11679
*        MESSAGE TEXT                                          @ZA11679
*                                                              @ZA11679
* STATIC TEXT SUB-STRUCTURE                                    @ZA11679
         DC    X'8400'                 STATIC TEXT FLAG        @ZA11679
         DC    Y(STE391B-STE391A)      TEXT LENGTH             @ZA11679
         DC    Y(STE391A-TXT39A)       TEXT OFFSET             @ZA11679
         DC    H'1'                    PRINT COLUMN            @ZA11679
         DC    Y(STE391B-STE391A)      PRINT FIELD LENGTH      @ZA11679
         DC    H'0'                    CONVERSION FLAGS        @ZA11679
         SPACE 1                                               @ZA11679
* STATIC TEXT ENTRIES                                          @ZA11679
STE391A  DC    C'IDC0832I NO DUPLICATE VOLUME RECORDS EXIST'   @ZA11679
         DC    C' IN THE INVENTORY'                            @ZA11679
STE391B  EQU   *                                               @ZA11679
TXT39B   EQU   *                                               @ZA11679
         EJECT                                                 @ZA11679
************************************************************** @ZA11679
*                                                              @ZA11679
* IDC0832I NO BASE VOLUME RECORDS EXIST IN THE                 @ZA11679
*          INVENTORY                                           @ZA11679
*                                                              @ZA11679
************************************************************** @ZA11679
TXT40    DC    Y(TXT40B-TXT40A)        ENTRY LENGTH            @ZA11679
         DC    X'8000'                 FLAG                    @ZA11679
         SPACE 1                                               @ZA11679
* SPACING CONTROL SUB-STRUCTURE                                @ZA11679
TXT40A   DC    X'4000'                 SPACE CONTROL FLAG      @ZA11679
         DC    H'2'                    SPACING FACTOR          @ZA11679
         DC    C'R '                   SPACING TYPE            @ZA11679
*                                                              @ZA11679
*        MESSAGE TEXT                                          @ZA11679
*                                                              @ZA11679
* STATIC TEXT SUB-STRUCTURE                                    @ZA11679
         DC    X'8400'                 STATIC TEXT FLAG        @ZA11679
         DC    Y(STE401B-STE401A)      TEXT LENGTH             @ZA11679
         DC    Y(STE401A-TXT40A)       TEXT OFFSET             @ZA11679
         DC    H'1'                    PRINT COLUMN            @ZA11679
         DC    Y(STE401B-STE401A)      PRINT FIELD LENGTH      @ZA11679
         DC    H'0'                    CONVERSION FLAGS        @ZA11679
         SPACE 1                                               @ZA11679
* STATIC TEXT ENTRIES                                          @ZA11679
STE401A  DC    C'IDC0832I NO BASE VOLUME RECORDS EXIST'        @ZA11679
         DC    C' IN THE INVENTORY'                            @ZA11679
STE401B  EQU   *                                               @ZA11679
TXT40B   EQU   *                                               @ZA11679
         EJECT                                                 @ZA11679
************************************************************** @ZA11679
*                                                              @ZA11679
* IDC0832I NO PLACE HOLDER RECORDS EXIST IN THE                @ZA11679
*          INVENTORY                                           @ZA11679
*                                                              @ZA11679
************************************************************** @ZA11679
TXT41    DC    Y(TXT41B-TXT41A)        ENTRY LENGTH            @ZA11679
         DC    X'8000'                 FLAG                    @ZA11679
         SPACE 1                                               @ZA11679
* SPACING CONTROL SUB-STRUCTURE                                @ZA11679
TXT41A   DC    X'4000'                 SPACE CONTROL FLAG      @ZA11679
         DC    H'2'                    SPACING FACTOR          @ZA11679
         DC    C'R '                   SPACING TYPE            @ZA11679
*                                                              @ZA11679
*        MESSAGE TEXT                                          @ZA11679
*                                                              @ZA11679
* STATIC TEXT SUB-STRUCTURE                                    @ZA11679
         DC    X'8400'                 STATIC TEXT FLAG        @ZA11679
         DC    Y(STE411B-STE411A)      TEXT LENGTH             @ZA11679
         DC    Y(STE411A-TXT41A)       TEXT OFFSET             @ZA11679
         DC    H'1'                    PRINT COLUMN            @ZA11679
         DC    Y(STE411B-STE411A)      PRINT FIELD LENGTH      @ZA11679
         DC    H'0'                    CONVERSION FLAGS        @ZA11679
         SPACE 1                                               @ZA11679
* STATIC TEXT ENTRIES                                          @ZA11679
STE411A  DC    C'IDC0832I NO PLACE HOLDER RECORDS EXIST'       @ZA11679
         DC    C' IN THE INVENTORY'                            @ZA11679
STE411B  EQU   *                                               @ZA11679
TXT41B   EQU   *                                               @ZA11679
         EJECT                                                 @ZA11679
************************************************************** @ZA11679
*                                                              @ZA11679
* IDC0832I NO CARTRIDGE INDEX RECORDS EXIST IN THE             @ZA11679
*          INVENTORY                                           @ZA11679
*                                                              @ZA11679
************************************************************** @ZA11679
TXT42    DC    Y(TXT42B-TXT42A)        ENTRY LENGTH            @ZA11679
         DC    X'8000'                 FLAG                    @ZA11679
         SPACE 1                                               @ZA11679
* SPACING CONTROL SUB-STRUCTURE                                @ZA11679
TXT42A   DC    X'4000'                 SPACE CONTROL FLAG      @ZA11679
         DC    H'2'                    SPACING FACTOR          @ZA11679
         DC    C'R '                   SPACING TYPE            @ZA11679
*                                                              @ZA11679
*        MESSAGE TEXT                                          @ZA11679
*                                                              @ZA11679
* STATIC TEXT SUB-STRUCTURE                                    @ZA11679
         DC    X'8400'                 STATIC TEXT FLAG        @ZA11679
         DC    Y(STE421B-STE421A)      TEXT LENGTH             @ZA11679
         DC    Y(STE421A-TXT42A)       TEXT OFFSET             @ZA11679
         DC    H'1'                    PRINT COLUMN            @ZA11679
         DC    Y(STE421B-STE421A)      PRINT FIELD LENGTH      @ZA11679
         DC    H'0'                    CONVERSION FLAGS        @ZA11679
         SPACE 1                                               @ZA11679
* STATIC TEXT ENTRIES                                          @ZA11679
STE421A  DC    C'IDC0832I NO CARTRIDGE INDEX RECORDS EXIST'    @ZA11679
         DC    C' IN THE INVENTORY'                            @ZA11679
STE421B  EQU   *                                               @ZA11679
TXT42B   EQU   *                                               @ZA11679
         EJECT                                                 @ZA13476
************************************************************** @ZA13476
*                                                              @ZA13476
* IDC3835I AN MSVI ERROR WAS DETECTED WHILE PROCESSING CART    @ZA13476
*          (CART SER)                                          @ZA13476
*                                                              @ZA13476
************************************************************** @ZA13476
TXT43    DC    Y(TXT43B-TXT43A)        ENTRY LENGTH            @ZA13476
         DC    X'8000'                 MESSAGE FLAG            @ZA13476
         SPACE 1                                               @ZA13476
* SPACING CONTROL SUB-STRUCTURE                                @ZA13476
TXT43A   DC    X'4000'                 SPACING CONTROL FLAG    @ZA13476
         DC    H'2'                    DOUBLE SPACE            @ZA13476
         DC    C'R '                   RELATIVE SPACING TYPE   @ZA13476
* STATIC TEXT SUB-STRUCTURE                                    @ZA13476
         DC    X'0400'                 STATIC TEXT FLAG        @ZA13476
         DC    Y(STE431B-STE431A)      TEXT LENGTH             @ZA13476
         DC    Y(STE431A-TXT43A)       TEXT OFFSET             @ZA13476
         DC    H'1'                    PRINT COLUMN            @ZA13476
         DC    Y(STE431B-STE431A)      PRINT FIELD LENGTH      @ZA13476
         DC    H'0'                    CONVERSION (NONE)       @ZA13476
* BLOCK DATA SUB-STRUCTURE                                     @ZA13476
         DC    X'9000'                 BLOCK DATA FLAG         @ZA13476
         DC    H'12'                   DATA LENGTH             @ZA13476
         DC    H'0'                    DATA OFFSET             @ZA13476
         DC    H'59'                   PRINT COLUMN            @ZA13476
         DC    H'12'                   PRINT FIELD LENGTH      @ZA13476
         DC    H'0'                    CONVERSION (NONE)       @ZA13476
* STATIC TEXT ENTRIES                                          @ZA13476
STE431A  DC    C'IDC3835I AN MSVI ERROR WAS DETECTED WHILE '   @ZA13476
         DC    C'PROCESSING CART'                              @ZA13476
STE431B  EQU   *                                               @ZA13476
TXT43B   EQU   *                                               @ZA13476
         END
