)ATTR DEFAULT(%+_)
    % TYPE(TEXT) INTENS(HIGH) COLOR(WHITE) SKIP(ON)
  Ö TYPE(TEXT) INTENS(LOW) JUST(RIGHT) CAPS(OFF) COLOR(YELLOW)
    + TYPE(TEXT) INTENS(LOW)  COLOR(BLUE) SKIP(ON)
  # TYPE(OUTPUT) INTENS(HIGH) JUST(LEFT) CAPS(OFF)  COLOR(YELLOW)
  ? TYPE(OUTPUT) INTENS(LOW) JUST(LEFT) CAPS(OFF) COLOR(BLUE)
  @ TYPE(OUTPUT) INTENS(LOW) JUST(RIGHT) CAPS(OFF) COLOR(YELLOW)
    ^ TYPE(TEXT) INTENS(HIGH) COLOR(RED)
)BODY EXPAND(\\)
+-\-\-%VSAM DATASET INFORMATION+-\-\-
%COMMAND ===>_ZCMD
+
^DATA SET NAME:#TDSN                                        +
+
^GENERAL DATA:                               CURRENT ALLOCATION:
+   Volume serials:       #VOL1  #VOL2  #VOL3  +Allocated trks:    @ATRK
+   Type:                 #TYPE      +          Allocated extents: @EXTS
+   Ave record length:    #ALEN    +
+   Max record length:    #MLEN    +        ^CURRENT UTILIZATION:
+   Key length:           #KLEN  +              Used trks:         @UTRK
+   Relative key position:#RKP    +             Used percent:      @UPER
+   CI size:              #CISZ    +
+   CI freespace:         #CIFR    +        ^USAGE DATA:
+   CA freespace:         #CAFR    +            Total records:  @RTOT
+   1st extent?ATYP      +#SPRI    +            Records deleted:@RDEL
+   Secondary?BTYP      + #SSEC    +            Records inserted:@RINT
+                                               Records updated:@RUPD
+   Creation date:        #CDATE     +          Records retrieved:@RRET
+   Expiration date:      #EDATE     +          CI splits:      @CISP
#OPTC            #OPTD        #OPTE            +CA splits:      @CASP
#OPT1            #OPT2        #OPT3            #OPT4        #OPT5
#OPT6            #OPT7        #OPT8            #OPTA        #OPTB
)INIT
  &ZCMD = &Z
)PROC
)END
