PLIMIO# TITLE 'PL/1 TERMIO# INTERFACE PREFIX'
        DCMSREGS
PLIMIO# CSECT
         USING *,R15
         L     R1,0(R1)
         L     R15,=V(TERMIO#)
         BR    R15
         LTORG
         END
