         TITLE '''IEDQ22'' - AT+T TWX TRANSLATE TABLE, NON-PARITY'
IEDQ22   CSECT
* NOVEMBER 23, 1970
         DS    0F
         DC    A(OUT)
*                 0 1 2 3 4 5 6 7 8 9 A B C D E F
         DC    X'3F3F3F7C3F403F3F3F3FD7D7F0F03F3F'  0
         DC    X'3F3FC8C84D4D3F3F18183FE73FF83F3F'  1
         DC    X'3F37C4C45B5B3F3F04043FE33FF43F3F'  2
         DC    X'0C0C3FD33F6B3F3F3F3FE1E14C4C3F3F'  3
         DC    X'3F3FC2C27F7F3F3F343F3FD93FF23F3F'  4
         DC    X'15153FD13F5C3F3F3F3FE9E97A7A3F3F'  5
         DC    X'3F3F3FC63F503F3F3F3FE5E5F6F63F3F'  6
         DC    X'3F0ED5D54B4B3F3F3F3F3F4F3F6E3F3F'  7
         DC    X'3F3FC1C15A5A3F3F11113FD83FF13F3F'  8
         DC    X'05053FC93F5D3F3F3F3FE8E8F9F93F3F'  9
         DC    X'2D2D3FC53F6C3F3F3F3FE4E4F5F53F3F'  A
         DC    X'3F26D4D460603F3F3F3F3F493F7E3F3F'  B
         DC    X'3F3F3FC33F7B3F3F3F37E2E2F3F33F3F'  C
         DC    X'3F0BD2D24E4E3F3F3F3F3F793F5E3F3F'  D
         DC    X'3F2FC7C77D7D3F3F3F3F3FE63FF73F3F'  E
         DC    X'0F0F3FD63F613F3F3F3F6D6D6F6F3F07'  F
OUT      EQU   *
*                 0 1 2 3 4 5 6 7 8 9 A B C D E F
         DC    X'FF5D5DB129915DFF5D5D5DD131B171F1' 0
         DC    X'5D895D5D5D515DFF5D5D5D5D5D5D5D5D' 1
         DC    X'5D5D5D5D5D51B15D5D5D5D5D5D5D5DE1' 2
         DC    X'5D5DFF5D495D5DC95D5D5D5DC95D5D5D' 3
         DC    X'055D5D5D5D5D5D5D5DBB5D753D15D57B' 4
         DC    X'655D5D5D5D5D5D5D5D5D85255595DD5D' 5
         DC    X'B5F55D5D5D5D5D5D5D5D5D35A5FB7DFD' 6
         DC    X'5D5D5D5D5D5D5D5D5DDB5DC503E5BD45' 7
         DC    X'5D8343C323A363E313935D5D5D5D5D5D' 8
         DC    X'5D53D333B373F30B8B4B5D5D5D5D5D5D' 9
         DC    X'5D5DCB2BAB6BEB1B9B5B5D5D5D5D5D5D' A
         DC    X'5D5D5D5D5D5D5D5D5D5D5D5D5D5D5D5D' B
         DC    X'5D8343C323A363E313935D5D5D5D5D5D' C
         DC    X'5D53D333B373F30B8B4B5D5D5D5D5D5D' D
         DC    X'5D3BCB2BAB6BEB1B9B5B5D5D5D5D5D5D' E
         DC    X'0D8D4DCD2DAD6DED1D9D5D5D5D5D5D5D' F
         END
