         TITLE 'IGCFQ10D - COPY/REPLACE DEVICE SESSION INFO.'
IGCFQ10D CSECT ,                                                01S0001
@PROLOG  BALR  @12,0                                            01S0001
@PSTART  DS    0H                                               01S0001
         USING @PSTART,@12                                      01S0001
*                                   /*
IGCFQ10D IEDHJN AFTERHJN,HJN
*                                                               01S0624
*   /*****************************************************************/
*   /*                                                               */
*   /* INITIALIZATION                                                */
*   /*                                                               */
*   /*****************************************************************/
*                                                               01S0624
*   ROPCAVT=RPARM;                  /* SET POINTER TO OP. CTL. AVT   */
         LR    ROPCAVT,RPARM                                    01S0624
*   ROPCE=OPCCOPCE;                 /* SET POINTER TO CURRENT OPCE   */
         L     ROPCE,OPCCOPCE(,ROPCAVT)                         01S0625
*   RAVT=OPCAVTPT;                  /* SET POINTER TO TCAM AVT       */
         L     RAVT,OPCAVTPT(,ROPCAVT)                          01S0626
*   RSAVE=ADDR(OPCSAVE);            /* SET POINTER TO SAVE AREA      */
         LA    RSAVE,OPCSAVE(,ROPCAVT)                          01S0627
*   RWRKAREA=OPCWORK;               /* OP. CTL. WORKAREA BASE - USED
*                                      FOR TEMPORARY STORAGE         */
*                                                               01S0628
         L     RWRKAREA,OPCWORK(,ROPCAVT)                       01S0628
*   /*****************************************************************/
*   /*                                                               */
*   /* BASE COMPILER GENERATED DSECT (CREATED BY REENTRANT OPTION)   */
*   /* FOR TEMPORARY STORAGE ON WORK AREA BASE.                      */
*   /*                                                               */
*   /*****************************************************************/
*                                                               01S0629
*   GEN REFS(RWRKAREA);                                         01S0629
*                        /*
         USING @DATD,RWRKAREA    */
*   FLAGS=''B;                      /* INIT FLAGS FIELD              */
*                                                               01S0630
         MVI   FLAGS,X'00'                                      01S0630
*   /*****************************************************************/
*   /*                                                               */
*   /* CALCULATE 50% OF TCAM'S LINE UNITS                            */
*   /*                                                               */
*   /*****************************************************************/
*                                                               01S0631
*   HALFUNIT=AVTNOLBF;              /* # OF TCAM'S LINE UNITS        */
         LH    @14,AVTNOLBF(,RAVT)                              01S0631
         STH   @14,HALFUNIT                                     01S0631
*   SRL(HALFUNIT,1);                /* DIVIDE BY TWO FOR 50%         */
*                                                               01S0632
         SRL   @14,1                                            01S0632
         STH   @14,HALFUNIT                                     01S0632
*   /*****************************************************************/
*   /*                                                               */
*   /* OBTAIN ADDR. OF NEG. PREFIX OF ORIG. OPCE                     */
*   /*                                                               */
*   /*****************************************************************/
*                                                               01S0633
*   ORGNOPCE=OCPTRSAV-LENGTH(IEDQOPCN);/* OBTAIN THE ADDR. OF THE
*                                      START OF THE NEG. PREFIX IN
*                                      THE ORIG. OPCE                */
         L     ORGNOPCE,OCPTRSAV(,ROPCE)                        01S0633
         SH    ORGNOPCE,@CH00045                                01S0633
*                                                               01S0634
*   /*****************************************************************/
*   /*                                                               */
*   /* MAIN PROCDURE                                                 */
*   /*                                                               */
*   /*****************************************************************/
*                                                               01S0634
*   IF OCREDRVE=ON THEN             /* IF THIS IS A REDRIVE OPCE     */
*                                                               01S0634
         TM    OCREDRVE(ROPCE),B'00010000'                      01S0634
         BNO   @RF00634                                         01S0634
*     /***************************************************************/
*     /*                                                             */
*     /* THIS IS A REDRIVE OPCE WITH ATTACHED UNITS.                 */
*     /*                                                             */
*     /***************************************************************/
*                                                               01S0635
*     CALL REDRIVE;                                             01S0635
         BAL   @14,REDRIVE                                      01S0635
*   ELSE                                                        01S0636
*     DO;                                                       01S0636
*                                                               01S0636
         B     @RC00634                                         01S0636
@RF00634 DS    0H                                               01S0637
*       /*************************************************************/
*       /*                                                           */
*       /* THIS IS A RESPONSE OPCE OR A REQUEST FROM IGCFL10D.       */
*       /*                                                           */
*       /*************************************************************/
*                                                               01S0637
*       ORGNOPCE->OCRESPCT=ORGNOPCE->OCRESPCT-1;/* DECREMENT RSP. CT.*/
         SLR   @14,@14                                          01S0637
         ICM   @14,3,OCRESPCT(ORGNOPCE)                         01S0637
         BCTR  @14,0                                            01S0637
         STH   @14,OCRESPCT(,ORGNOPCE)                          01S0637
*                                                               02S0638
*       /*************************************************************/
*       /*                                                           */
*       /* ---------- THIS SEGMENT PROCESSES RESPONSES --------      */
*       /*                                                           */
*       /*************************************************************/
*                                                               02S0638
*       IF OCSWITCH=OCRPLDSI THEN   /* IF REPLACE RESPONSE           */
         CLI   OCSWITCH(ROPCE),X'E4'                            02S0638
         BNE   @RF00638                                         02S0638
*         FREUTFLG=ON;              /* SET FLAG TO FREE UNITS        */
         OI    FREUTFLG,B'10000000'                             02S0639
*       ELSE                                                    02S0640
*         IF OCSWITCH=OCOPYDSI THEN /* IF COPY RESPONSE              */
         B     @RC00638                                         02S0640
@RF00638 CLI   OCSWITCH(ROPCE),X'E3'                            02S0640
         BNE   @RF00640                                         02S0640
*           DO;                                                 02S0641
*                                                               02S0641
*             /*******************************************************/
*             /*                                                     */
*             /* DETERMINE IF REPLACE SHOULD BE DONE.                */
*             /*                                                     */
*             /*******************************************************/
*                                                               02S0642
*                                                               03S0642
*             /*******************************************************/
*             /*                                                     */
*             /* --- THIS SEGMENT PROCESSES "COPY DEVICE SESSION     */
*             /* INFO." RESPONSES                                    */
*             /*                                                     */
*             /*******************************************************/
*                                                               03S0642
*             RFY                                               03S0642
*               IEDDSI1 BASED(ADDR(PRUDATA)+LENGTH(IEDBDU));    03S0642
*             RFY                                               03S0643
*               IEDQTRM BASED(RPARM);                           03S0643
*             IF BDUSYRSP=GOODRSP THEN/* IF GOOD RESPONSE ON COPY    */
         L     @14,OCUNIT(,ROPCE)                               03S0644
         CLI   BDUSYRSP+12(@14),X'60'                           03S0644
         BNE   @RF00644                                         03S0644
*               DO;                                             03S0645
*                 RPARM=OCTRMTBL;   /* OBTAIN TTE .....              */
         SLR   RPARM,RPARM                                      03S0646
         ICM   RPARM,3,OCTRMTBL(ROPCE)                          03S0646
*                 CALL IEDQTNT;     /* .... ADDR.                    */
         L     @15,AVTRNMPT(,RAVT)                              03S0647
         BALR  @14,@15                                          03S0647
*                 RZERO=TRMDDIGA;   /* OBTAIN ADDR. .....            */
         LH    RZERO,@CH02076                                   03S0648
*                 CALL IEDQTL;      /* .... OF DEVICE DEPENDENT FIELD*/
         L     @15,AVTDDFT(,RAVT)                               03S0649
         BALR  @14,@15                                          03S0649
*                 DEVDPADR=RTNCODE; /* ADDR. OF DIAL DIGITS FIELD    */
         LR    DEVDPADR,RTNCODE                                 03S0650
*                                                               04S0651
*                 /***************************************************/
*                 /*                                                 */
*                 /* ------ PLACE RU DIAL DATA IN CONTIGUOUS STORAGE */
*                 /* IN OP. CTL. WORK AREA. SAVE POINTERS TO THE UNIT*/
*                 /* ADDR. AND STARTING ADDR. OF DIAL DATA IN RU FOR */
*                 /* MOVE BACK.-------                               */
*                 /*                                                 */
*                 /***************************************************/
*                                                               04S0651
*                 RFY                                           04S0651
*                   IEDDSI1 BASED(PLMVSD);/* BASE ON PARM LIST SOURCE
*                                      DATA                          */
*                 RFY                                           04S0652
*                   IEDDSI2 BASED(PLMVSD);/* ADDR.                   */
*                 RFY                                           04S0653
*                   IEDDSI3 BASED(PLMVSD);                      04S0653
*                 RFY                                           04S0654
*                   IEDDSI4 BASED(PLMVSD);                      04S0654
*                                                               04S0654
*                 /***************************************************/
*                 /*                                                 */
*                 /* INIT. PARM. LIST FOR IEDMVBFR. THIS ROUTINE IS  */
*                 /* USED TO FIND ADDR. OF DIAL DATA BY MOVING BYTES */
*                 /* INTO THEMSELVES THUS MOVING POINTER.            */
*                 /*                                                 */
*                 /***************************************************/
*                                                               04S0655
*                 IEDPLMV=''B;      /* CLEAR PARM. LIST AREA         */
         LA    @14,PARMLSP                                      04S0655
         XC    IEDPLMV(24,@14),IEDPLMV(@14)                     04S0655
*                 PLMVSU=OCUNIT;    /* SOURCE UNIT ADDR.             */
         L     @05,OCUNIT(,ROPCE)                               04S0656
         ST    @05,PLMVSU(,@14)                                 04S0656
*                 PLMVTU=OCUNIT;    /* TARGET UNIT ADDR.             */
         ST    @05,PLMVTU(,@14)                                 04S0657
*                 PLMVSD=ADDR(PRUDATA)+LENGTH(IEDBDU);/* SOURCE DATA
*                                      ADDR.                         */
         LA    @05,PRUDATA(,@05)                                04S0658
         AH    @05,@CH00080                                     04S0658
         ST    @05,PLMVSD(,@14)                                 04S0658
*                 PLMVTD=ADDR(PRUDATA)+LENGTH(IEDBDU);/* TARGET DATA
*                                      ADDR.                         */
         ST    @05,PLMVTD(,@14)                                 04S0659
*                 PLMVLNTH=DSIPOLNM+LENGTH(IEDDSI1);/* NUMBER OF
*                                      POLLING CHARACTERS            */
*                                                               04S0660
         LA    @07,4                                            04S0660
         SLR   @06,@06                                          04S0660
         IC    @06,DSIPOLNM(,@05)                               04S0660
         ALR   @07,@06                                          04S0660
         STH   @07,PLMVLNTH(,@14)                               04S0660
*                 /***************************************************/
*                 /*                                                 */
*                 /* LOCATE START OF ADDR. CHARS. FIELD              */
*                 /*                                                 */
*                 /***************************************************/
*                                                               04S0661
*                 RPARM=ADDR(PARMLSP);/* ADDR. OF PARM LIST  @YM05982*/
         LR    RPARM,@14                                        04S0661
*                 CALL IEDMVBFR;                                04S0662
         L     @05,AVTSAVTP(,RAVT)                              04S0662
         L     @15,SAVTMVBF(,@05)                               04S0662
         BALR  @14,@15                                          04S0662
*                 PLMVLNTH=DSIADRNM+LENGTH(IEDDSI2);/* NUMBER OF
*                                      ADDRESSING CHARACTERS         */
*                                                               04S0663
         LA    @14,PARMLSP                                      04S0663
         L     @05,PLMVSD(,@14)                                 04S0663
         LA    @07,1                                            04S0663
         SLR   @06,@06                                          04S0663
         IC    @06,DSIADRNM(,@05)                               04S0663
         ALR   @07,@06                                          04S0663
         STH   @07,PLMVLNTH(,@14)                               04S0663
*                 /***************************************************/
*                 /*                                                 */
*                 /* LOCATE INPUT IDENTIFIER FIELD.                  */
*                 /*                                                 */
*                 /***************************************************/
*                                                               04S0664
*                 CALL IEDMVBFR;                                04S0664
*                                                               04S0664
         L     @05,AVTSAVTP(,RAVT)                              04S0664
         L     @15,SAVTMVBF(,@05)                               04S0664
         BALR  @14,@15                                          04S0664
*                 /***************************************************/
*                 /*                                                 */
*                 /* IF INPUT ID IS 0 REMAINING FIELDS IN IEDDSI3 ARE*/
*                 /* NOT PRESENT                                     */
*                 /*                                                 */
*                 /***************************************************/
*                                                               04S0665
*                 IF DSINPTID='00'X THEN/* IF 0                      */
         LA    @14,PARMLSP                                      04S0665
         L     @14,PLMVSD(,@14)                                 04S0665
         CLI   DSINPTID(@14),X'00'                              04S0665
         BNE   @RF00665                                         04S0665
*                   FREUTFLG=ON;    /* THEN SET FLAG         @YM07670*/
         OI    FREUTFLG,B'10000000'                             04S0666
*                 ELSE                                          04S0667
*                   DO;             /*                       @YM07430*/
         B     @RC00665                                         04S0667
@RF00665 DS    0H                                               04S0668
*                     PLMVLNTH=LENGTH(IEDDSI3);/* MOVE LENGTH OF
*                                      IEDDSI3                       */
*                                                               04S0668
         LA    @14,PARMLSP                                      04S0668
         MVC   PLMVLNTH(2,@14),@CH00256                         04S0668
*                     /***********************************************/
*                     /*                                             */
*                     /* LOCATE BEGINNING OF DIAL DATA FIELDS        */
*                     /*                                             */
*                     /***********************************************/
*                                                               04S0669
*                     CALL IEDMVBFR;                            04S0669
*                                                               04S0669
         L     @05,AVTSAVTP(,RAVT)                              04S0669
         L     @15,SAVTMVBF(,@05)                               04S0669
         BALR  @14,@15                                          04S0669
*                     /***********************************************/
*                     /*                                             */
*                     /* SAVE POINTERS FOR UNIT AND START OF DIAL    */
*                     /* DATA                                        */
*                     /*                                             */
*                     /***********************************************/
*                                                               04S0670
*                     UNITSAVE=PLMVTU;                          04S0670
         LA    @14,PARMLSP                                      04S0670
         MVC   UNITSAVE(4),PLMVTU(@14)                          04S0670
*                     DATASAVE=PLMVTD;                          04S0671
*                                                               04S0671
         MVC   DATASAVE(4),PLMVTD(@14)                          04S0671
*                     /***********************************************/
*                     /*                                             */
*                     /* MOVE DIAL DATA INTO CONTIGUOUS STORAGE IN   */
*                     /* WORK AREA.                                  */
*                     /*                                             */
*                     /***********************************************/
*                                                               04S0672
*                     PLMVTU=ADDR(DIALDATA);/* ADDR. IN WRK AREA     */
         LA    @05,DIALSP                                       04S0672
         ST    @05,PLMVTU(,@14)                                 04S0672
*                     PLMVTD=ADDR(DIALDATA);/* ADDR. IN WRK AREA     */
         ST    @05,PLMVTD(,@14)                                 04S0673
*                     PLMVTCTG=ON;  /* FLAG FOR CONTIGUOUS TARGET    */
         OI    PLMVTCTG(@14),B'00100000'                        04S0674
*                     PLMVLNTH=DSIDLCNT+LENCTFLD;/* LENGTH OF DIAL
*                                      DATA                          */
         L     @05,PLMVSD(,@14)                                 04S0675
         LA    @07,1                                            04S0675
         SLR   @06,@06                                          04S0675
         IC    @06,DSIDLCNT(,@05)                               04S0675
         ALR   @07,@06                                          04S0675
         STH   @07,PLMVLNTH(,@14)                               04S0675
*                     CALL IEDMVBFR;                            04S0676
         L     @05,AVTSAVTP(,RAVT)                              04S0676
         L     @15,SAVTMVBF(,@05)                               04S0676
         BALR  @14,@15                                          04S0676
*                     RFY                                       04S0677
*                       IEDDSI1 BASED(ADDR(PRUDATA)+LENGTH(IEDBDU));
*                                   /* RESET BASE FOR START OF DATA
*                                      RECORD                        */
*                   END;            /*                       @YM07430*/
*                                   /* ... WORK AREA FOR EASY   03S0679
*                                      HANDLING ADDR. OF DIAL FIELD
*                                      IN RU PLACED IN RUDIALAD      */
*                 IF FREUTFLG=OFF THEN/*                     @YM07670*/
@RC00665 TM    FREUTFLG,B'10000000'                             03S0679
         BNZ   @RF00679                                         03S0679
*                   DO;             /*                       @YM07430*/
*                     IF TTEDIALN>MAXIMUM THEN/* IF TTE DIAL DATA >
*                                      MAX. ALLOWED                  */
         LA    @14,DIALSP                                       03S0681
         CLC   TTEDIALN(1,DEVDPADR),MAXIMUM(@14)                03S0681
         BNH   @RF00681                                         03S0681
*                       FREUTFLG=ON;/* SET TO FREE OPCE AND RU       */
         OI    FREUTFLG,B'10000000'                             03S0682
*                     ELSE                                      03S0683
*                                                               03S0683
*                       /*********************************************/
*                       /*                                           */
*                       /* REPLACE CAN BE DONE IF DIAL DIGITS DO NOT */
*                       /* MATCH.                                    */
*                       /*                                           */
*                       /*********************************************/
*                                                               03S0683
*                       IF TTEDIALN=ACTUAL THEN/* IF NUMBER OF TTE
*                                      DIAL DIGITS IS SAME AS NO. OF
*                                      RU DIGITS                     */
         B     @RC00681                                         03S0683
@RF00681 LA    @14,DIALSP                                       03S0683
         CLC   TTEDIALN(1,DEVDPADR),ACTUAL(@14)                 03S0683
         BNE   @RF00683                                         03S0683
*                         DO;       /* CONVERT NCP'S DIGITS TO BINARY
*                                      AND COMPARE WITH TCAM'S  03S0684
*                                                            @YM06517*/
*                           DIGITS(1:1)=DIGITS(1:1)&CLEARHI;/*  03S0685
*                                      CONVERT FIRST BYTE    @YM06517*/
         NI    DIGITS(@14),X'0F'                                03S0685
*                           IF ACTUAL>1 THEN/* IF MORE THAN 1 DIGIT
*                                                            @YM06875*/
         CLI   ACTUAL(@14),1                                    03S0686
         BNH   @RF00686                                         03S0686
*                             MVZ(DIGITS(2:ACTUAL),DIGITS(1:ACTUAL-1));
         LA    @05,DIALSP                                       03S0687
         SLR   @07,@07                                          03S0687
         IC    @07,ACTUAL(,@05)                                 03S0687
         BCTR  @07,0                                            03S0687
         BCTR  @07,0                                            03S0687
         EX    @07,@SB02300                                     03S0687
*                                   /* CONVERT REST OF DIGITS   03S0688
*                                                            @YM06517*/
*                           ELSE                                03S0688
*                             ;     /*                       @YM06875*/
@RF00686 DS    0H                                               03S0689
*                           IF TTEDIALD(1:TTEDIALN)=DIGITS(1:TTEDIALN)
*                             THEN  /* IF MATCH                      */
         LA    @14,DIALSP                                       03S0689
         SLR   @05,@05                                          03S0689
         IC    @05,TTEDIALN(,DEVDPADR)                          03S0689
         BCTR  @05,0                                            03S0689
         EX    @05,@SC02302                                     03S0689
         BNE   @RF00689                                         03S0689
*                             FREUTFLG=ON;/* REPLACE DOES NOT NEED TO
*                                      BE DONE - FREE OPCE AND RU    */
         OI    FREUTFLG,B'10000000'                             03S0690
*                           ELSE                                03S0691
*                             BLRPLFLG=ON;/* SET FLAG TO BUILD  03S0691
*                                      REPLACE                       */
         B     @RC00689                                         03S0691
@RF00689 OI    BLRPLFLG,B'01000000'                             03S0691
*                         END;      /*                       @YM06517*/
*                       ELSE                                    03S0693
*                         DO;                                   03S0693
         B     @RC00683                                         03S0693
@RF00683 DS    0H                                               03S0694
*                           RFY                                 03S0694
*                             RTNCODE UNRSTD;                   03S0694
*                           RFY                                 03S0695
*                             IEDPRUQD BASED(UNITSAVE);         03S0695
*                           RFY                                 03S0696
*                             TICFLD BASED(ADDR(PRUTIC));       03S0696
*                                                               03S0696
*                           /*****************************************/
*                           /*                                       */
*                           /* IF THE NUMBER OF DIAL DIGITS IN THE   */
*                           /* TTE IS TOO LARGE FOR CURRENT RU, GET  */
*                           /* ANOTHER UNIT.                         */
*                           /*                                       */
*                           /*****************************************/
*                                                               03S0697
*                           IF TIC^=VALTIC THEN/* IF START OF DIAL
*                                      DATA IS IN THE LAST UNIT      */
         L     @05,UNITSAVE                                     03S0697
         TM    TIC+8(@05),B'00000011'                           03S0697
         BZ    @RF00697                                         03S0697
*                             IF(DATASAVE-UNITSAVE)+(COUNT+1)+(TTEDIALN
*                                 -ACTUAL)>(AVTKEYLE+12) THEN/* IS
*                                      ANOTHER UNIT NEEDED           */
         LCR   @05,@05                                          03S0698
         AL    @05,DATASAVE                                     03S0698
         LA    @15,1                                            03S0698
         LA    @14,DIALSP                                       03S0698
         SLR   @07,@07                                          03S0698
         IC    @07,COUNT(,@14)                                  03S0698
         ALR   @07,@15                                          03S0698
         ALR   @05,@07                                          03S0698
         SLR   @07,@07                                          03S0698
         IC    @07,TTEDIALN(,DEVDPADR)                          03S0698
         SLR   @06,@06                                          03S0698
         IC    @06,ACTUAL(,@14)                                 03S0698
         SLR   @07,@06                                          03S0698
         ALR   @05,@07                                          03S0698
         LA    @14,12                                           03S0698
         AH    @14,AVTKEYLE(,RAVT)                              03S0698
         CR    @05,@14                                          03S0698
         BNH   @RF00698                                         03S0698
*                               DO;                             03S0699
*                                 RPARM=1;/* GET ANOTHER ....        */
         LR    RPARM,@15                                        03S0700
*                                 CALL ALLOCBUF;/* .... UNIT         */
         L     @15,OPCGETBF(,ROPCAVT)                           03S0701
         BALR  @14,@15                                          03S0701
*                                 PRUNUNIT=RPARM;/* SET TIC FIELD OF
*                                      LAST UNIT TO POINT TO NEW UNIT*/
         L     @05,UNITSAVE                                     03S0702
         STCM  RPARM,7,PRUNUNIT(@05)                            03S0702
*                               END;                            03S0703
*                             ELSE                              03S0704
*                               ;                               03S0704
@RF00698 DS    0H                                               03S0705
*                           ELSE                                03S0705
*                             ;                                 03S0705
@RF00697 DS    0H                                               03S0706
*                           RFY                                 03S0706
*                             TICFLD BASED;                     03S0706
*                           RFY                                 03S0707
*                             IEDPRUQD BASED(OCUNIT);           03S0707
*                                                               03S0707
*                           /*****************************************/
*                           /*                                       */
*                           /* RESET COUNT FIELDS FOR PACKED RU AND  */
*                           /* GO BUILD REPLACE DSI                  */
*                           /*                                       */
*                           /*****************************************/
*                                                               03S0708
*                           PRUDATCT=PRUDATCT+(TTEDIALN-ACTUAL);/*
*                                      DATA COUNT IN PACKED RU       */
         L     @05,OCUNIT(,ROPCE)                               03S0708
         LA    @15,DIALSP                                       03S0708
         SLR   @14,@14                                          03S0708
         IC    @14,TTEDIALN(,DEVDPADR)                          03S0708
         SLR   @07,@07                                          03S0708
         IC    @07,ACTUAL(,@15)                                 03S0708
         SLR   @14,@07                                          03S0708
         LH    @07,PRUDATCT(,@05)                               03S0708
         ALR   @07,@14                                          03S0708
         STH   @07,PRUDATCT(,@05)                               03S0708
*                           DSITOTNM=DSITOTNM+(TTEDIALN-ACTUAL);/*
*                                      COUNT IN DATA RECORD          */
         LA    @05,PRUDATA(,@05)                                03S0709
         AH    @05,@CH00080                                     03S0709
         SLR   @07,@07                                          03S0709
         IC    @07,DSITOTNM(,@05)                               03S0709
         ALR   @07,@14                                          03S0709
         STC   @07,DSITOTNM(,@05)                               03S0709
*                           COUNT=COUNT+(TTEDIALN-ACTUAL);/* DIAL
*                                      DATA COUNT FIELD IN WRK AREA  */
         SLR   @05,@05                                          03S0710
         IC    @05,COUNT(,@15)                                  03S0710
         ALR   @14,@05                                          03S0710
         STC   @14,COUNT(,@15)                                  03S0710
*                           BLRPLFLG=ON;/* SET FLAG TO BUILD REPLACE */
         OI    BLRPLFLG,B'01000000'                             03S0711
*                           RFY                                 03S0712
*                             RTNCODE RSTD;                     03S0712
*                         END;                                  03S0713
*                   END;            /*                       @YM07430*/
*                 ELSE                                          03S0715
*                   ;               /*                       @YM07430*/
@RF00679 DS    0H                                               03S0716
*               END;                                            03S0716
*             ELSE                                              03S0717
*               FREUTFLG=ON;        /* FREE OPCE AND RU              */
         B     @RC00644                                         03S0717
@RF00644 OI    FREUTFLG,B'10000000'                             03S0717
*             IF BLRPLFLG=ON THEN   /* IF FLAG INDICATING REPLACE TO
*                                      BE BUILT                      */
@RC00644 TM    BLRPLFLG,B'01000000'                             03S0718
         BNO   @RF00718                                         03S0718
*               DO;                                             03S0719
*                                                               04S0720
*                 /***************************************************/
*                 /*                                                 */
*                 /* --- THIS SEGMENT BUILDS REPLACE DEV. SESSION    */
*                 /* INFO. OPCE- PACKED RU PAIRS ----                */
*                 /*                                                 */
*                 /***************************************************/
*                                                               04S0720
*                 TRMTBLSV=OCTRMTBL;/* SAVE OCTRMTBL                 */
         SLR   TRMTBLSV,TRMTBLSV                                04S0720
         ICM   TRMTBLSV,3,OCTRMTBL(ROPCE)                       04S0720
*                 PTRSAVSV=OCPTRSAV;/* SAVE                          */
         L     @14,OCPTRSAV(,ROPCE)                             04S0721
         ST    @14,PTRSAVSV                                     04S0721
*                 UNITSV=OCUNIT;    /* SAVE                          */
         L     @07,OCUNIT(,ROPCE)                               04S0722
         ST    @07,UNITSV                                       04S0722
*                 IEDQOPCN=''B;     /* CLEAR NEG. PREFIX             */
         LA    @05,8                                            04S0723
         LR    @14,ROPCE                                        04S0723
         SLR   @14,@05                                          04S0723
         XC    IEDQOPCN(8,@14),IEDQOPCN(@14)                    04S0723
*                 IEDQOPCE=''B;     /* CLEAR OPCE                    */
         XC    IEDQOPCE(64,ROPCE),IEDQOPCE(ROPCE)               04S0724
*                 OCTRMTBL=TRMTBLSV;/* RESOURCE TTCIN                */
         STH   TRMTBLSV,OCTRMTBL(,ROPCE)                        04S0725
*                 OCPTRSAV=PTRSAVSV;/* POINTER TO ORIG OPCE          */
         L     @14,PTRSAVSV                                     04S0726
         ST    @14,OCPTRSAV(,ROPCE)                             04S0726
*                 OCUNIT=UNITSV;    /* POINTER TO ATTACHED PACKED RU */
         ST    @07,OCUNIT(,ROPCE)                               04S0727
*                 OCSWITCH=OCRPLDSI;/* REPLACE CMND.                 */
         MVI   OCSWITCH(ROPCE),X'E4'                            04S0728
*                 OCELMPRI=PRIMEDFG;                            04S0729
         MVI   OCELMPRI(ROPCE),X'DF'                            04S0729
*                 OCPRIFLG=OPR02;                               04S0730
         MVI   OCPRIFLG(ROPCE),X'08'                            04S0730
*                 OCWTG=THISMOD;    /* SET TO RETURN TO THIS MODULE  */
         MVC   OCWTG(2,ROPCE),THISMOD                           04S0731
*                 OCACTREQ=ON;      /* SET FOR ACTIVATE REQUEST      */
         OI    OCACTREQ(ROPCE),B'00001000'                      04S0732
*                 PRUTTCIN=OCTRMTBL;/* COPY DEVICE TTCIN     @YM06512*/
         SLR   @14,@14                                          04S0733
         ICM   @14,3,OCTRMTBL(ROPCE)                            04S0733
         STH   @14,PRUTTCIN(,@07)                               04S0733
*                 PRURHTH(1:3)=TRHFID0;/* SET FID0 RH FLAGS          */
         LCR   @05,@05                                          04S0734
         ALR   @05,@07                                          04S0734
         MVC   PRURHTH(3,@05),@CB01815                          04S0734
*                 PRURHTH(4:4)=TTH0BYT0;/* SET FID0 TH FLAGS         */
         MVI   PRURHTH+3(@05),X'0C'                             04S0735
*                 BDUMODIF=CD0CRDSI;/* BDU MODIFIER FOR "REPLACE"    */
         AH    @07,@CH00245                                     04S0736
         MVI   BDUMODIF(@07),X'22'                              04S0736
*                 BDUFNFLG=''B;     /* CLEAR FUNCTION FLAGS          */
         MVI   BDUFNFLG(@07),X'00'                              04S0737
*                 BDUHEADR=ON;      /* SET HEADER FLAG       @YM06147*/
         OI    BDUHEADR(@07),B'01000000'                        04S0738
*                 BDUBDUFG=''B;     /* CLEAR BDU FLAGS               */
         MVI   BDUBDUFG(@07),X'00'                              04S0739
*                 BDUSYRSP=''B;     /* CLEAR SYSTEM RESPONSE         */
         MVI   BDUSYRSP(@07),X'00'                              04S0740
*                 BDUEXRSP=''B;     /* CLEAR EXTENDED RESPONSE       */
         MVI   BDUEXRSP(@07),X'00'                              04S0741
*                 TTEDIALR(1:TTEDIALN+1)=TTEDIAL(1:TTEDIALN+1);/*
*                                      MOVE DIAL DIGITS AND LENGTH
*                                      INTO WORK AREA                */
         LA    @14,DIALSP                                       04S0742
         SLR   @05,@05                                          04S0742
         IC    @05,TTEDIALN(,DEVDPADR)                          04S0742
         EX    @05,@SM02306                                     04S0742
*                 DIGITS(1:1)=DIGITS(1:1)×SETHI;/* CONVERT DIGIT TO
*                                      EBCDIC                @YM06517*/
         OI    DIGITS(@14),X'F0'                                04S0743
*                 IF ACTUAL>1 THEN  /* IF MORE THAN 1 DIGIT  @YM06875*/
         CLI   ACTUAL(@14),1                                    04S0744
         BNH   @RF00744                                         04S0744
*                   MVZ(DIGITS(2:ACTUAL),DIGITS(1:ACTUAL-1));/* 04S0745
*                                      CONVERT REST TO EBCDIC @YM6517*/
         LA    @09,DIALSP                                       04S0745
         SLR   @05,@05                                          04S0745
         IC    @05,ACTUAL(,@09)                                 04S0745
         BCTR  @05,0                                            04S0745
         BCTR  @05,0                                            04S0745
         EX    @05,@SB02300                                     04S0745
*                 ELSE                                          04S0746
*                   ;               /*                       @YM06875*/
@RF00744 DS    0H                                               04S0747
*                 IEDPLMV=''B;      /* CLEAR IEDMVBFR PARM. LIST     */
         LA    @14,PARMLSP                                      04S0747
         XC    IEDPLMV(24,@14),IEDPLMV(@14)                     04S0747
*                 PLMVTU=UNITSAVE;  /* UNIT WHERE RU DIAL DATA STARTS*/
         MVC   PLMVTU(4,@14),UNITSAVE                           04S0748
*                 PLMVTD=DATASAVE;  /* ADDR. OF DIAL DATA IN RU      */
         MVC   PLMVTD(4,@14),DATASAVE                           04S0749
*                 PLMVSU=ADDR(DIALDATA);/* ADDR. OF DIAL DATA IN WRK
*                                      AREA                          */
         LA    @09,DIALSP                                       04S0750
         ST    @09,PLMVSU(,@14)                                 04S0750
*                 PLMVSD=ADDR(DIALDATA);/* DUPLICATE                 */
         ST    @09,PLMVSD(,@14)                                 04S0751
*                 PLMVLNTH=COUNT+1; /* NO. BYTES TO MOVE             */
         LA    @05,1                                            04S0752
         SLR   @07,@07                                          04S0752
         IC    @07,COUNT(,@09)                                  04S0752
         ALR   @05,@07                                          04S0752
         STH   @05,PLMVLNTH(,@14)                               04S0752
*                 PLMVSCTG=ON;      /* 'SOURCE CONTIGUOUS' FLAG      */
         OI    PLMVSCTG(@14),B'01000000'                        04S0753
*                 RPARM=ADDR(PARMLSP);/* ADDR OF PARM LIST   @YM05982*/
         LR    RPARM,@14                                        04S0754
*                 CALL IEDMVBFR;    /* MOVE NEW DIAL DATA INTO RU    */
         L     @09,AVTSAVTP(,RAVT)                              04S0755
         L     @15,SAVTMVBF(,@09)                               04S0755
         BALR  @14,@15                                          04S0755
*                 ORGNOPCE->OCRESPCT=ORGNOPCE->OCRESPCT+1;/* UPDATE
*                                      RESPONSE COUNT                */
         LA    @14,1                                            04S0756
         SLR   @09,@09                                          04S0756
         ICM   @09,3,OCRESPCT(ORGNOPCE)                         04S0756
         ALR   @14,@09                                          04S0756
         STH   @14,OCRESPCT(,ORGNOPCE)                          04S0756
*                 OPCMODID=RUDSPMOD;/* SET TO XCTL TO RU DISPATCHER  */
         MVC   OPCMODID(2,ROPCAVT),RUDSPMOD                     04S0757
*               END;                                            03S0758
*             RFY                                               03S0759
*               IEDDSI1 BASED;                                  03S0759
@RF00718 DS    0H                                               03S0760
*           END;                                                02S0760
*         ELSE                                                  02S0761
*           ;                       /* A REQUEST FROM IGCFL10D, NO
*                                      RESPONSE PROCESSING NEEDED, NO
*                                      ATTACHED UNIT TO FREE.        */
@RF00640 DS    0H                                               02S0762
*       IF FREUTFLG=ON THEN         /* IF UNITS ARE TO BE FREED      */
@RC00638 TM    FREUTFLG,B'10000000'                             02S0762
         BNO   @RF00762                                         02S0762
*         IF ORGNOPCE->OCRESPCT=0 THEN/* IF END OF STEP              */
         ICM   @14,3,OCRESPCT(ORGNOPCE)                         02S0763
         BNZ   @RF00763                                         02S0763
*           DO;                                                 02S0764
*                                                               02S0764
*             /*******************************************************/
*             /*                                                     */
*             /* FREE ONLY ATTACHED RU KEEPING THE OPCE TO INITIATE  */
*             /* NEXT STEP IN PROCESSING.                            */
*             /*                                                     */
*             /*******************************************************/
*                                                               02S0765
*             RZERO=1;              /* DECREMENT OPCADGOT BY 1 ....  */
         LA    RZERO,1                                          02S0765
*             CALL DECRCT;          /* .... AND PRIME R/D ELEMENT    */
         L     @15,OPCDECR(,ROPCAVT)                            02S0766
         BALR  @14,@15                                          02S0766
*             RPARM=OCUNIT;         /* GO FREE ....                  */
         L     RPARM,OCUNIT(,ROPCE)                             02S0767
*             CALL FREEBUFF;        /* .... ATTACHED RU              */
         L     @15,OPCFREBF(,ROPCAVT)                           02S0768
         BALR  @14,@15                                          02S0768
*             OCUNIT=PRUINTIC;      /* SET INVALID TIC IN OPCE       */
         MVC   OCUNIT(4,ROPCE),@CF01781                         02S0769
*           END;                                                02S0770
*         ELSE                                                  02S0771
*           DO;                                                 02S0771
*                                                               02S0771
         B     @RC00763                                         02S0771
@RF00763 DS    0H                                               02S0772
*             /*******************************************************/
*             /*                                                     */
*             /* FREE BOTH OPCE AND RU SINCE NO "REPLACE" MUST BE    */
*             /* DONE.                                               */
*             /*                                                     */
*             /*******************************************************/
*                                                               02S0772
*             RZERO=2;              /* DECREMENT OPCADGOT BY 2 ....  */
         LA    RZERO,2                                          02S0772
*             CALL DECRCT;          /* .... AND PRIME R/D ELEMENT    */
         L     @15,OPCDECR(,ROPCAVT)                            02S0773
         BALR  @14,@15                                          02S0773
*             RPARM=ROPCE;          /* FREE OPCE AND ....            */
         LR    RPARM,ROPCE                                      02S0774
*             CALL FREEBUFF;        /* .... ATTACHED RU              */
         L     @15,OPCFREBF(,ROPCAVT)                           02S0775
         BALR  @14,@15                                          02S0775
*             OPCMODID=CNTLMOD;     /* SET TO XCTL TO CONTROL MOD.   */
         MVC   OPCMODID(2,ROPCAVT),CNTLMOD                      02S0776
*           END;                                                02S0777
*       ELSE                                                    02S0778
*         ;                                                     02S0778
@RF00762 DS    0H                                               02S0779
*       DO WHILE(ORGNOPCE->OCRESPCT=0);/* IF THE RESPONSE COUNT IS 0
*                                      INDICATING THAT NEXT STEP
*                                      SHOULD BE DONE                */
*                                                               01S0779
@RC00762 B     @DE00779                                         01S0779
@DL00779 DS    0H                                               01S0780
*         /***********************************************************/
*         /*                                                         */
*         /* DETERMINE WHAT TO DO NEXT                               */
*         /*                                                         */
*         /***********************************************************/
*                                                               01S0780
*                                                               02S0780
*         /***********************************************************/
*         /*                                                         */
*         /* --------- THIS SEGMENT CHECKS THE NEXT STEP TO BE DONE  */
*         /* -----                                                   */
*         /*                                                         */
*         /***********************************************************/
*                                                               02S0780
*         IF OCSWITCH=OCOPYDSI×OCSWITCH=OCRPLDSI THEN/* IF CURRENT
*                                      OPCE IS FOR COPY/REPLACE 02S0780
*                                      DEVICE SESSION INFORMATION    */
         CLI   OCSWITCH(ROPCE),X'E3'                            02S0780
         BE    @RT00780                                         02S0780
         CLI   OCSWITCH(ROPCE),X'E4'                            02S0780
         BNE   @RF00780                                         02S0780
@RT00780 DS    0H                                               02S0781
*           DO;                                                 02S0781
*                                                               02S0781
*             /*******************************************************/
*             /*                                                     */
*             /* DIAL DIGIT PROCESSING COMPLETE FOR ALL AUTOCALL     */
*             /* RESOURCES UNDER THE NCP, SET TO XCTL TO IGCFJ10D TO */
*             /* START ACTLINK PROCESSING.                           */
*             /*                                                     */
*             /*******************************************************/
*                                                               02S0782
*             OCSWITCH=OCACTLK;     /* SET COMMAND AS ACTLINK        */
         MVI   OCSWITCH(ROPCE),X'50'                            02S0782
*             OPCMODID=RPNCPMOD;    /* SET TO XCTL                   */
         MVC   OPCMODID(2,ROPCAVT),RPNCPMOD                     02S0783
*             ORGNOPCE->OCRESPCT=1; /* SET RESPONSE COUNT            */
         MVC   OCRESPCT(2,ORGNOPCE),@CH00061                    02S0784
*             OCREDRVE=OFF;         /* RESET REDRIVE FLAG            */
         NI    OCREDRVE(ROPCE),B'11101111'                      02S0785
*           END;                                                02S0786
*         ELSE                                                  02S0787
*           DO;                                                 02S0787
*                                                               02S0787
         B     @RC00780                                         02S0787
@RF00780 DS    0H                                               02S0788
*             /*******************************************************/
*             /*                                                     */
*             /* CHECK IF ANY DIAL BSC-SS TERMS WITH AUTODIAL        */
*             /* SPECIFIED. REFORMAT CURRENT OPCE INTO REDRIVE OPCE  */
*             /* FOR COPY DSI                                        */
*             /*                                                     */
*             /*******************************************************/
*                                                               02S0788
*                                                               03S0788
*             /*******************************************************/
*             /*                                                     */
*             /* ------ THIS SEGMENT REFORMATS AN OPCE INTO A REDRIVE*/
*             /* OPCE---                                             */
*             /*                                                     */
*             /*******************************************************/
*                                                               03S0788
*             RFY                                               03S0788
*               IEDSATD BASED(ENTRYPTR);/* SAT BASE FOR LOOP         */
*             RFY                                               03S0789
*               IEDRVTD BASED(SATRNRVT);/* BASE FOR RVT              */
*             OCREDRVE=ON;          /* SET FLAG                      */
         OI    OCREDRVE(ROPCE),B'00010000'                      03S0790
*             OCBUFNED=''B;         /* INIT. BUFFER UNITS NEEDED     */
         SLR   @14,@14                                          03S0791
         STH   @14,OCBUFNED(,ROPCE)                             03S0791
*             OCBUFGOT=''B;         /* INIT. BUFFER UNITS GOT        */
         STH   @14,OCBUFGOT(,ROPCE)                             03S0792
*             OCSWITCH=OCOPYDSI;    /* COPY DEV. SESSION INFO. CODE  */
*                                                               03S0793
         MVI   OCSWITCH(ROPCE),X'E3'                            03S0793
*             /*******************************************************/
*             /*                                                     */
*             /* LOOP THROUGH SAT UNTIL CORRECT RVT FOUND            */
*             /*                                                     */
*             /*******************************************************/
*                                                               03S0794
*             ENTRYPTR=SAVTSAT;     /* ADDR. OF SAT - FIRST ENTRY    */
         L     @14,AVTSAVTP(,RAVT)                              03S0794
         MVC   ENTRYPTR(4),SAVTSAT(@14)                         03S0794
*             DO UNTIL(FDRVTFLG=ON);                            03S0795
@DL00795 DS    0H                                               03S0796
*               IF SATRNRVT^=0 THEN /* IF THIS SUBAREA ACTIVE   03S0796
*                                                            @YM05702*/
         L     @14,ENTRYPTR                                     03S0796
         L     @14,SATRNRVT(,@14)                               03S0796
         LTR   @14,@14                                          03S0796
         BZ    @RF00796                                         03S0796
*                 IF RVTINDEX=OCPTRSAV->OCTRMTBL THEN/* IF THIS IS
*                                      CORRECT RVT                   */
         L     @09,OCPTRSAV(,ROPCE)                             03S0797
         CLC   RVTINDEX(2,@14),OCTRMTBL(@09)                    03S0797
         BNE   @RF00797                                         03S0797
*                   FDRVTFLG=ON;    /* SET FLAG TO GET OUT OF LOOP   */
         OI    FDRVTFLG,B'00100000'                             03S0798
*                 ELSE                                          03S0799
*                   ENTRYPTR=ENTRYPTR+LENGTH(IEDSATD);/* UPDATE PTR.
*                                      TO NEXT SAT ENTRY             */
         B     @RC00797                                         03S0799
@RF00797 LA    @14,8                                            03S0799
         AL    @14,ENTRYPTR                                     03S0799
         ST    @14,ENTRYPTR                                     03S0799
*               ELSE                /*                       @YM05702*/
*                 ENTRYPTR=ENTRYPTR+LENGTH(IEDSATD);/* UPDATE PTR. TO
*                                      NEXT SAT ENTRY        @YM06014*/
         B     @RC00796                                         03S0800
@RF00796 LA    @14,8                                            03S0800
         AL    @14,ENTRYPTR                                     03S0800
         ST    @14,ENTRYPTR                                     03S0800
*             END;                                              03S0801
@RC00796 DS    0H                                               03S0801
@DE00795 TM    FDRVTFLG,B'00100000'                             03S0801
         BNO   @DL00795                                         03S0801
*             ENTRYCT=RVTNUM-1;     /* NO. OF RVT ENTRIES - NCP ENTRY*/
         L     @14,ENTRYPTR                                     03S0802
         L     @14,SATRNRVT(,@14)                               03S0802
         SLR   @09,@09                                          03S0802
         ICM   @09,3,RVTNUM(@14)                                03S0802
         BCTR  @09,0                                            03S0802
         STH   @09,ENTRYCT                                      03S0802
*             ENTRYRVT=SATRNRVT+LENGTH(RVTINDEX);/* SET PTR. IN R/D
*                                      OPCE TO SECOND ENTRY IN THE
*                                      RVT                           */
         AH    @14,@CH00066                                     03S0803
         ST    @14,ENTRYRVT(,ROPCE)                             03S0803
*             RFY                                               03S0804
*               IEDSATD BASED;                                  03S0804
*             RFY                                               03S0805
*               IEDRVTD BASED(ENTRYRVT);                        03S0805
*             ENTRYPTR=ENTRYRVT;    /* POINT TO SECOND ENTRY         */
         ST    @14,ENTRYPTR                                     02S0806
*             DO WHILE(ENTRYCT^=0); /* SET TO LOOP THROUGH RVT       */
         B     @DE00807                                         02S0807
@DL00807 DS    0H                                               02S0808
*               RFY                                             02S0808
*                 IEDRVTD BASED(ENTRYPTR);/* BASE FOR DURATION OF
*                                      LOOP                          */
*               RFY                                             02S0809
*                 IEDQTRM BASED(RPARM);/* BASE FOR DURATION OF LOOP  */
*               IF RVTINDEX^=0 THEN /* IF VALID INDEX                */
         L     @14,ENTRYPTR                                     02S0810
         SLR   @09,@09                                          02S0810
         ICM   @09,3,RVTINDEX(@14)                              02S0810
         LTR   @09,@09                                          02S0810
         BZ    @RF00810                                         02S0810
*                 DO;                                           02S0811
*                   RPARM=RVTINDEX; /* OBTAIN TTE ....               */
         LR    RPARM,@09                                        02S0812
*                   CALL IEDQTNT;   /* .... ADDR. OF RESOURCE        */
         L     @15,AVTRNMPT(,RAVT)                              02S0813
         BALR  @14,@15                                          02S0813
*                   IF TRMTYPE=TRMPSNA THEN/* IF PRE-SNA 3705   02S0814
*                                      TERMINAL                      */
*                                                               02S0814
         LR    @14,RPARM                                        02S0814
         SH    @14,@CH00077                                     02S0814
         CLI   TRMTYPE(@14),X'4F'                               02S0814
         BNE   @RF00814                                         02S0814
*                     /***********************************************/
*                     /*                                             */
*                     /* GO SEE IF AUTOCALL WITH VALID DIAL DIGITS   */
*                     /* SPECIFIED                                   */
*                     /*                                             */
*                     /***********************************************/
*                                                               02S0815
*                                                               03S0815
*                     /***********************************************/
*                     /*                                             */
*                     /* ---- THIS SEGMENT CHECKS IF COPY DSI CMND IS*/
*                     /* NEEDED FOR THIS TERM. -----                 */
*                     /*                                             */
*                     /***********************************************/
*                                                               03S0815
*                     IF TRMAUTOC=ON&TRMDDIG=ON THEN/* IF AUTOCALL
*                                      WITH DIAL DIGITS              */
         TM    TRMAUTOC(@14),B'00100000'                        03S0815
         BNO   @RF00815                                         03S0815
         TM    TRMDDIG(RPARM),B'01000000'                       03S0815
         BNO   @RF00815                                         03S0815
*                       DO;                                     03S0816
*                         RZERO=TRMDDIGA;/* CODE FOR IEDQTL          */
         LH    RZERO,@CH02076                                   03S0817
*                         CALL IEDQTL;/* GET ADDR. OF DIAL DIGITS
*                                      FIELD                         */
         L     @15,AVTDDFT(,RAVT)                               03S0818
         BALR  @14,@15                                          03S0818
*                         DEVDPADR=RTNCODE;/* SAVE ADDR.             */
         LR    DEVDPADR,RTNCODE                                 03S0819
*                         IF TTEDIALN=LENCTFLD&TTEDIALD(1:1)='0F'X THEN
         CLI   TTEDIALN(DEVDPADR),1                             03S0820
         BNE   @RF00820                                         03S0820
         CLI   TTEDIALD(DEVDPADR),X'0F'                         03S0820
         BE    @RT00820                                         03S0820
*                           ;       /* IF INVALID DIAL DATA THEN DO
*                                      NOTHING                       */
*                         ELSE                                  03S0822
*                           DO;                                 03S0822
@RF00820 DS    0H                                               03S0823
*                             ORGNOPCE->OCRESPCT=ORGNOPCE->OCRESPCT+1;
         LA    @14,1                                            03S0823
         SLR   @09,@09                                          03S0823
         ICM   @09,3,OCRESPCT(ORGNOPCE)                         03S0823
         ALR   @14,@09                                          03S0823
         STH   @14,OCRESPCT(,ORGNOPCE)                          03S0823
*                                   /* INCREMENT RESP. COUNT         */
*                             OCBUFNED=OCBUFNED+2;/* UPDATE UNITS
*                                      NEEDED BY 2                   */
         LA    @14,2                                            03S0824
         SLR   @09,@09                                          03S0824
         ICM   @09,3,OCBUFNED(ROPCE)                            03S0824
         ALR   @14,@09                                          03S0824
         STH   @14,OCBUFNED(,ROPCE)                             03S0824
*                           END;                                03S0825
*                       END;                                    03S0826
*                     ELSE                                      03S0827
*                       ;                                       03S0827
@RF00815 DS    0H                                               03S0828
*                   ELSE                                        02S0828
*                     ;                                         02S0828
@RF00814 DS    0H                                               02S0829
*                 END;                                          02S0829
*               ELSE                                            02S0830
*                 ;                                             02S0830
@RF00810 DS    0H                                               02S0831
*               ENTRYCT=ENTRYCT-1;  /* DECREMENT LOOP CTR.           */
@RC00810 LH    @14,ENTRYCT                                      02S0831
         BCTR  @14,0                                            02S0831
         STH   @14,ENTRYCT                                      02S0831
*               ENTRYPTR=ENTRYPTR+LENGTH(RVTINDEX);/* OBTAIN NEXT RVT
*                                      ENTRY                         */
         LA    @14,2                                            02S0832
         AL    @14,ENTRYPTR                                     02S0832
         ST    @14,ENTRYPTR                                     02S0832
*               RFY                                             02S0833
*                 IEDQTRM BASED(RTRM);/* RESTORE BASE                */
*               RFY                                             02S0834
*                 IEDRVTD BASED(ENTRYRVT);/* RESET BASE              */
*             END;                                              02S0835
@DE00807 ICM   @14,3,ENTRYCT                                    02S0835
         BNZ   @DL00807                                         02S0835
*           END;                                                02S0836
*       END;                                                    01S0837
@RC00780 DS    0H                                               01S0837
@DE00779 ICM   @14,3,OCRESPCT(ORGNOPCE)                         01S0837
         BZ    @DL00779                                         01S0837
*       IF OCREDRVE=ON THEN         /* IF CHKSTEP CREATED REDRIVE
*                                      OPCE                          */
         TM    OCREDRVE(ROPCE),B'00010000'                      01S0838
         BNO   @RF00838                                         01S0838
*         DO;                                                   01S0839
*                                                               01S0839
*           /*********************************************************/
*           /*                                                       */
*           /* A REDRIVE OPCE HAS BEEN CREATED FOR COPY DEVICE       */
*           /* SESSION INFORMATION COMMANDS. OBTAIN AS MANY UNITS AS */
*           /* ALLOWABLE UP TO THE NUMBER OF UNITS NEEDED TO SEND OUT*/
*           /* ALL COMMANDS AND THEN ENTER REDRIVE PROCESSING WHICH  */
*           /* BUILDS COPY DEVICE SESSION INFORMATION OPCE- PACKED RU*/
*           /* PAIRS FOR EACH RESOURCE.                              */
*           /*                                                       */
*           /*********************************************************/
*                                                               01S0840
*                                                               02S0840
*           /*********************************************************/
*           /*                                                       */
*           /* OBTAIN AS MANY BUFFER UNITS AS THE OPCE NEEDS UP TO   */
*           /* 50% OF TCAM'S UNITS. CHAIN THEM OFF OCUNIT FIELD OF   */
*           /* THE OPCE.                                             */
*           /*                                                       */
*           /*********************************************************/
*                                                               02S0840
*           UNITPTR=ROPCE;          /* SET TO POINT TO R/D OPCE      */
         LR    UNITPTR,ROPCE                                    02S0840
*           IF OPCADGOT+OCBUFNED>HALFUNIT THEN/* IF TOTAL OF UNITS
*                                      A/D HAS AND UNITS NEEDED 02S0841
*                                      EXCEEDS THE 50% LEVEL         */
         LH    @14,HALFUNIT                                     02S0841
         SLR   @11,@11                                          02S0841
         ICM   @11,3,OPCADGOT(ROPCAVT)                          02S0841
         SLR   @09,@09                                          02S0841
         ICM   @09,3,OCBUFNED(ROPCE)                            02S0841
         ALR   @09,@11                                          02S0841
         CR    @09,@14                                          02S0841
         BNH   @RF00841                                         02S0841
*             UNITSGET=HALFUNIT-OPCADGOT;/* GET UNITS UP TO 50% LEVEL*/
         SLR   @14,@11                                          02S0842
         STH   @14,UNITSGET                                     02S0842
*           ELSE                                                02S0843
*             UNITSGET=OCBUFNED;    /* GET AS MANY UNITS AS NEEDED   */
         B     @RC00841                                         02S0843
@RF00841 MVC   UNITSGET(2),OCBUFNED(ROPCE)                      02S0843
*           DO WHILE(UNITSGET^=0);  /* GO TO ALLOCBUF AS MANY TIMES
*                                      AS NECESSAY TO OBTAIN UNITS   */
@RC00841 B     @DE00844                                         02S0844
@DL00844 DS    0H                                               02S0845
*             IF UNITSGET>MAXUNTGT THEN/* IF FK IS TO GET MORE THAN
*                                      THE # OF UNITS ALLOCBUF CAN
*                                      GIVE PER CALL                 */
         LA    @14,255                                          02S0845
         CH    @14,UNITSGET                                     02S0845
         BNL   @RF00845                                         02S0845
*               RPARM=MAXUNTGT;     /* GET THE MAXIMUM               */
         LR    RPARM,@14                                        02S0846
*             ELSE                                              02S0847
*               RPARM=UNITSGET;     /* GET # TO GET                  */
         B     @RC00845                                         02S0847
@RF00845 LH    RPARM,UNITSGET                                   02S0847
*             CALL ALLOCBUF;        /* GET BUFFER UNITS              */
*                                                               02S0848
@RC00845 L     @15,OPCGETBF(,ROPCAVT)                           02S0848
         BALR  @14,@15                                          02S0848
*             /*******************************************************/
*             /*                                                     */
*             /* LINK UNITS JUST GOTTEN OFF OF OCLINK AT END OF      */
*             /* CURRENT CHAIN OF BUFFERS                            */
*             /*                                                     */
*             /*******************************************************/
*                                                               02S0849
*             RFY                                               02S0849
*               IEDQOPCE BASED(UNITPTR);                        02S0849
*             RFY                                               02S0850
*               TICFLD BASED(ADDR(OCUNIT));                     02S0850
*             DO WHILE(TIC=VALTIC); /* LOOP TO FIND END OF CURRENT
*                                      CHAIN                         */
         B     @DE00851                                         02S0851
@DL00851 DS    0H                                               02S0852
*               UNITPTR=OCUNIT;     /* POINT TO NEXT UNIT            */
         L     UNITPTR,OCUNIT(,UNITPTR)                         02S0852
*             END;                                              02S0853
@DE00851 TM    TIC+8(UNITPTR),B'00000011'                       02S0853
         BZ    @DL00851                                         02S0853
*             OCUNIT=RPARM;         /* POINT TO UNITS JUST GOTTEN    */
         ST    RPARM,OCUNIT(,UNITPTR)                           02S0854
*             RFY                                               02S0855
*               TICFLD BASED;                                   02S0855
*             RFY                                               02S0856
*               IEDQOPCE BASED(ROPCE);                          02S0856
*             UNITSGET=UNITSGET-RZERO;/* UPDATE # OF UNITS TO GET    */
         LH    @14,UNITSGET                                     02S0857
         SLR   @14,RZERO                                        02S0857
         STH   @14,UNITSGET                                     02S0857
*             OCBUFNED=OCBUFNED-RZERO;/* UPDATE # OF UNITS OPCE NEEDS*/
         SLR   @14,@14                                          02S0858
         ICM   @14,3,OCBUFNED(ROPCE)                            02S0858
         SLR   @14,RZERO                                        02S0858
         STH   @14,OCBUFNED(,ROPCE)                             02S0858
*             OCBUFGOT=OCBUFGOT+RZERO;/* UPDATE # OF UNITS OPCE HAS  */
         SLR   @14,@14                                          02S0859
         ICM   @14,3,OCBUFGOT(ROPCE)                            02S0859
         ALR   @14,RZERO                                        02S0859
         STH   @14,OCBUFGOT(,ROPCE)                             02S0859
*             OPCADGOT=OPCADGOT+RZERO;/* UPDATE OPCADGOT             */
         SLR   @14,@14                                          02S0860
         ICM   @14,3,OPCADGOT(ROPCAVT)                          02S0860
         ALR   @14,RZERO                                        02S0860
         STH   @14,OPCADGOT(,ROPCAVT)                           02S0860
*           END;                                                02S0861
@DE00844 ICM   @14,3,UNITSGET                                   02S0861
         BNZ   @DL00844                                         02S0861
*           CALL REDRIVE;                                       01S0862
         BAL   @14,REDRIVE                                      01S0862
*         END;                                                  01S0863
*       ELSE                                                    01S0864
*         ;                         /* EITHER OPCE IS A ACTLINK 01S0864
*                                      REQUEST OPCE OR IS A REPLACE
*                                      DSI COMMAND OPCE. IN EITHER
*                                      CASE, EXIT.                   */
@RF00838 DS    0H                                               01S0865
*     END;                                                      01S0865
*                                                               01S0865
*   /*****************************************************************/
*   /*                                                               */
*   /* EXIT CODE                                                     */
*   /*                                                               */
*   /*****************************************************************/
*                                                               01S0866
*   IF OPCMODID=CNTLMOD THEN        /* IF XCTL IS TO IGC0010D        */
@RC00634 CLC   OPCMODID(2,ROPCAVT),CNTLMOD                      01S0866
         BNE   @RF00866                                         01S0866
*     RZERO=''B;                    /* CLEAR                         */
         SLR   RZERO,RZERO                                      01S0867
*   RPARM=ROPCAVT;                                              01S0868
@RF00866 LR    RPARM,ROPCAVT                                    01S0868
*   DO;                             /* IEDXCTL                       */
*     GEN EXIT REFS(ROPCAVT,OPCTRACE,OPCXCTL) NOSEQFLOW;        01S0870
*                                   /*
         LA    15,OPCXCTL(,ROPCAVT)   POINT TO OPCXCTL LIST
         EX    0,OPCTRACE(,ROPCAVT)    INVOKE XCTL TRACE
         XCTL  SF=(E,(15))             XCTL TO NEXT MODULE
*   END;                            /* END OF IEDXCTL                */
*/* @OZ35627                                                         */
*                                                               01S0872
*   /*****************************************************************/
*   /*                                                               */
*   /* END OF MAIN PROCEDURE                                         */
*   /*                                                               */
*   /*****************************************************************/
*                                                               01S0872
*                                                               01S0872
*/********************************************************************/
*/*              REDRIVE SUBROUTINE                                  */
*/********************************************************************/
*/*                                                                  */
*/* THIS ROUTINE PERFORMS THE REDRIVE PROCESSING:                    */
*/* 1. THE RVT IS SCANNED STARTING WITH THE ENTRY ADDR. (ENTRYRVT)   */
*/*    CONTAINED IN OCMODNME OF THE REDRIVE OPCE. ON THE FIRST PASS, */
*/*    THIS IS SET UP WITH THE 2ND ENTRY IN THE RVT.                 */
*/* 2. USING RVTINDEX, THE TTE IS OBTAINED AND THE TERMINAL IS       */
*/*    VERIFIED AS A BSC-SS DIAL TERM. WITH AUTOCALL SPECIFIED.      */
*/* 3. IF SO, A COPY DEVICE SESSION INFORMATION OPCE IS BUILT IN     */
*/*    THE UNIT POINTED TO BY OCUNIT OF THE REDRIVE OPCE. THE NEXT   */
*/*    UNIT HAS A PACKED RU BUILT IN IT. OCUNIT OF THE REDRIVE OPCE  */
*/*    IS SET TO THE UNIT FOLLOWING THE SECOND UNIT.                 */
*/* 4. THE OPCE=RU PAIR JUST BUILT IS PUT INTO THE CHAIN FOR THE     */
*/*    POST TO AVTOPCOB.                                             */
*/* 5. IF THERE ARE 2 OR MORE UNITS LEFT, THE RVT SCAN IS CONTINED   */
*/*    AND STEPS 2-4 REPEATED.                                       */
*/*                                                                  */
*/********************************************************************/
*                                                               01S0872
*REDRIVE:                                                       01S0872
*   PROC OPTIONS(RETREG,SAVE(14));                              01S0872
REDRIVE  ST    @14,@SA00002                                     01S0872
*   IF OCBUFGOT>=2 THEN             /* IF TWO OR MORE UNITS ATTACHED */
         CLC   OCBUFGOT(2,ROPCE),@CH00066                       01S0873
         BL    @RF00873                                         01S0873
*     DO;                                                       01S0874
*                                                               01S0874
*       /*************************************************************/
*       /*                                                           */
*       /* THERE ARE ENOUGH UNITS                                    */
*       /*                                                           */
*       /*************************************************************/
*                                                               01S0875
*       OPCAQWD1=OCUNIT;            /* SET FIRST WORD OF AQCTL PARM.
*                                      LIST TO POINT TO FIRST UNIT   */
         MVC   OPCAQWD1(4,ROPCAVT),OCUNIT(ROPCE)                01S0875
*       DO WHILE(OCBUFGOT>=2);      /* LOOP WHILE ENOUGH UNITS REMAIN*/
         B     @DE00876                                         01S0876
@DL00876 DS    0H                                               01S0877
*         RFY                                                   01S0877
*           IEDQOPCE BASED(UNITPTR);/* REDEFINE BASE FOR LOOP        */
*         UNITPTR=ROPCE->OCUNIT;    /* POINT TO FIRST UNIT           */
         L     UNITPTR,OCUNIT(,ROPCE)                           01S0878
*         ROPCE->OCUNIT=OCUNIT->OCUNIT;/* SET OCUNIT OF REDRIVE TO
*                                      POINT TO UNIT FOLLOWING UNIT
*                                      FOLLOWING UNIT POINTED TO BY
*                                      UNITPTR                       */
         L     @14,OCUNIT(,UNITPTR)                             01S0879
         L     @11,OCUNIT(,@14)                                 01S0879
         ST    @11,OCUNIT(,ROPCE)                               01S0879
*         OCELEM=ROPCE->OCUNIT;     /* MOVE LINK FOR POST TO AVTOPCOB*/
         ST    @11,OCELEM(,UNITPTR)                             01S0880
*         PRUTIC=PRUINTIC;          /* SET TIC FIELD OF RU INVALID   */
*                                                               01S0881
         MVC   PRUTIC(4,@14),@CB01781                           01S0881
*         /***********************************************************/
*         /*                                                         */
*         /* SET COMMON FIELDS IN OPCE                               */
*         /*                                                         */
*         /***********************************************************/
*                                                               01S0882
*         OCPTRSAV=ROPCE->OCPTRSAV; /* SET ADDR. OF ORIG. OPCE       */
         MVC   OCPTRSAV(4,UNITPTR),OCPTRSAV(ROPCE)              01S0882
*         OCSWITCH=OCOPYDSI;        /* SET COMMAND CODE              */
         MVI   OCSWITCH(UNITPTR),X'E3'                          01S0883
*         OCLINK=ADDR(AVTOPCOB);    /* SET QCB ADDR.                 */
         LA    @14,AVTOPCOB(,RAVT)                              01S0884
         ST    @14,OCLINK(,UNITPTR)                             01S0884
*         OCELMPRI=PRIMEDFG;        /* SET UP POST PRIORITY          */
         MVI   OCELMPRI(UNITPTR),X'DF'                          01S0885
*         OCPRIFLG=OPR02;           /* SET TO ROUTE TO RU DISPATCHER */
         MVI   OCPRIFLG(UNITPTR),X'08'                          01S0886
*         OCWTG=THISMOD;            /* SET TO RETURN TO THIS MOD.    */
         MVC   OCWTG(2,UNITPTR),THISMOD                         01S0887
*         OCACTREQ=ON;              /* ACTIVATE REQUEST              */
         OI    OCACTREQ(UNITPTR),B'00001000'                    01S0888
*         OPCAQWD2=UNITPTR;         /* 'END OF CHAIN' ADDR. IN AQCTL
*                                      PARM. LIST                    */
*                                                               01S0889
         ST    UNITPTR,OPCAQWD2(,ROPCAVT)                       01S0889
*         /***********************************************************/
*         /*                                                         */
*         /* SCAN RVT UNTIL THE TTE OF A DIAL TERM. WITH AUTOCALL AND*/
*         /* VALID DIAL DIGITS IS FOUND. FINISH BUILDING OPCE AND    */
*         /* PACKED RU.                                              */
*         /*                                                         */
*         /***********************************************************/
*                                                               01S0890
*                                                               02S0890
*         /***********************************************************/
*         /*                                                         */
*         /* ------- THIS SEGMENT BUILDS "COPY DEVICE SESSION        */
*         /* INFORMATION" OPCE- PACKED RU PAIRS. -----               */
*         /*                                                         */
*         /***********************************************************/
*                                                               02S0890
*         RFY                                                   02S0890
*           IEDQTRM BASED(RPARM);   /* SET TTE BASE                  */
*         RFY                                                   02S0891
*           IEDQOPCE BASED(ROPCE);  /* SET BASE AS REDRIVE OPCE      */
*         DO UNTIL(BUILTFLG=ON);    /* DO UNTIL CMND. BUILT          */
*                                                               02S0892
@DL00892 DS    0H                                               02S0893
*           /*********************************************************/
*           /*                                                       */
*           /* OBTAIN NEXT RVT ENTRY ADDR. FROM REDRIVE OPCE AND SET */
*           /* OCTRMTBL OF OPCE BEING BUILT TO TTCIN CONTAINED IN RVT*/
*           /* ENTRY.                                                */
*           /*                                                       */
*           /*********************************************************/
*                                                               02S0893
*           UNITPTR->OCTRMTBL=RVTINDEX;/* SET TTCIN FOR OPCE BEING
*                                      BUILT                         */
         L     @14,ENTRYRVT(,ROPCE)                             02S0893
         SLR   @11,@11                                          02S0893
         ICM   @11,3,RVTINDEX(@14)                              02S0893
         STH   @11,OCTRMTBL(,UNITPTR)                           02S0893
*           ENTRYRVT=ENTRYRVT+LENGTH(RVTINDEX);/* UPDATE RVT ENTRY
*                                      PTR. IN R/D OPCE TO POINT TO
*                                      NEXT ENTRY                    */
         AH    @14,@CH00066                                     02S0894
         ST    @14,ENTRYRVT(,ROPCE)                             02S0894
*           RPARM=UNITPTR->OCTRMTBL;/* OBTAIN ADDR. OF ....          */
         LR    RPARM,@11                                        02S0895
*           CALL IEDQTNT;           /* .... TTE                      */
         L     @15,AVTRNMPT(,RAVT)                              02S0896
         BALR  @14,@15                                          02S0896
*           IF TRMTYPE=TRMPSNA&TRMAUTOC=ON&TRMDDIG=ON THEN/* IF 02S0897
*                                      PRE-SNA TERM. WITH AUTOCALL
*                                      AND DIAL DIGITS               */
         LR    @14,RPARM                                        02S0897
         SH    @14,@CH00077                                     02S0897
         CLI   TRMTYPE(@14),X'4F'                               02S0897
         BNE   @RF00897                                         02S0897
         TM    TRMAUTOC(@14),B'00100000'                        02S0897
         BNO   @RF00897                                         02S0897
         TM    TRMDDIG(RPARM),B'01000000'                       02S0897
         BNO   @RF00897                                         02S0897
*             DO;                                               02S0898
*                                                               02S0898
*               /*****************************************************/
*               /*                                                   */
*               /* BUILD COPY DEVICE SESSION INFO. CMND. IF THIS     */
*               /* TERMINAL HAS VALID DIAL DIGITS.                   */
*               /*                                                   */
*               /*****************************************************/
*                                                               02S0899
*               RZERO=TRMDDIGA;     /* OBTAIN ADDR. OF ....          */
         LH    RZERO,@CH02076                                   02S0899
*               CALL IEDQTL;        /* .... DEVICE DEPENDENT FIELD   */
         L     @15,AVTDDFT(,RAVT)                               02S0900
         BALR  @14,@15                                          02S0900
*               DEVDPADR=RTNCODE;   /* COPY ADDR. OF FIELD           */
         LR    DEVDPADR,RTNCODE                                 02S0901
*               IF TTEDIALN=1&TTEDIALD(1:1)='0F'X THEN/* IF INVALID  */
         CLI   TTEDIALN(DEVDPADR),1                             02S0902
         BNE   @RF00902                                         02S0902
         CLI   TTEDIALD(DEVDPADR),X'0F'                         02S0902
         BNE   @RF00902                                         02S0902
*                 BUILTFLG=OFF;     /* CMND. NOT BUILT FOR THIS TERM.
*                                      - CHECK NEXT RVT ENTRY        */
         NI    BUILTFLG,B'11101111'                             02S0903
*               ELSE                                            02S0904
*                 DO;                                           02S0904
*                                                               02S0904
         B     @RC00902                                         02S0904
@RF00902 DS    0H                                               02S0905
*                   /*************************************************/
*                   /*                                               */
*                   /* BUILD PACKED RU                               */
*                   /*                                               */
*                   /*************************************************/
*                                                               02S0905
*                   RFY                                         02S0905
*                     IEDQOPCE BASED(UNITPTR);/* RESET BASE AS OPCE
*                                      BEING BUILT                   */
*                   PRUTTCIN=OCTRMTBL;/* SET RESOURCE TTCIN          */
         L     @14,OCUNIT(,UNITPTR)                             02S0906
         MVC   PRUTTCIN(2,@14),OCTRMTBL(UNITPTR)                02S0906
*                   PRUDATCT=LENGTH(IEDBDU);/* DATA LENGTH IS BDU
*                                      LENGTH                        */
         MVC   PRUDATCT(2,@14),@CH00080                         02S0907
*                   BDUCMND=CD0CTRL;/* CONTROL BDU                   */
         LA    @11,12                                           02S0908
         ALR   @11,@14                                          02S0908
         MVI   BDUCMND(@11),X'08'                               02S0908
*                   BDUMODIF=CD0CCDSI;/* COPY DSI MODIFIER           */
         MVI   BDUMODIF(@11),X'21'                              02S0909
*                   BDUHEADR=ON;    /* TURN ON HEADER FLAG   @YM06147*/
         OI    BDUHEADR(@11),B'01000000'                        02S0910
*                   PRURHTH(1:3)=TRHFID0;/* SET FID0 RH FLAGS        */
         SH    @14,@CH00045                                     02S0911
         MVC   PRURHTH(3,@14),@CB01815                          02S0911
*                   PRURHTH(4:4)=TTH0BYT0;/* SET FID0 TH FLAGS       */
         MVI   PRURHTH+3(@14),X'0C'                             02S0912
*                   BUILTFLG=ON;    /* RU BUILT, RETURN TO REDRIVE   */
         OI    BUILTFLG,B'00010000'                             02S0913
*                 END;                                          02S0914
*             END;                                              02S0915
*           ELSE                                                02S0916
*             BUILTFLG=OFF;         /* CMND. NOT BUILT FOR THIS TERM.
*                                      - CHECK NEXT RVT ENTRY        */
         B     @RC00897                                         02S0916
@RF00897 NI    BUILTFLG,B'11101111'                             02S0916
*         END;                                                  02S0917
@RC00897 DS    0H                                               02S0917
@DE00892 TM    BUILTFLG,B'00010000'                             02S0917
         BNO   @DL00892                                         02S0917
*         RFY                                                   02S0918
*           IEDQTRM BASED(RTRM);    /* RESET BASE FOR TTE            */
*         ROPCE->OCBUFGOT=ROPCE->OCBUFGOT-2;/* DECREMENT # UNITS GOT */
         SLR   @14,@14                                          01S0919
         ICM   @14,3,OCBUFGOT(ROPCE)                            01S0919
         BCTR  @14,0                                            01S0919
         BCTR  @14,0                                            01S0919
         STH   @14,OCBUFGOT(,ROPCE)                             01S0919
*         RFY                                                   01S0920
*           IEDQOPCE BASED(ROPCE);  /* RESET BASE AS REDRIVE OPCE    */
*       END;                                                    01S0921
*                                                               01S0921
@DE00876 CLC   OCBUFGOT(2,ROPCE),@CH00066                       01S0921
         BNL   @DL00876                                         01S0921
*       /*************************************************************/
*       /*                                                           */
*       /* POST OPCE'S TO AVTOPCOB                                   */
*       /*                                                           */
*       /*************************************************************/
*                                                               01S0922
*       OPCAQREQ=CHAINFLG;          /* FINISH BUILDING PARM. LIST BY
*                                      SETTING FLAG FOR CHAIN POST   */
         MVI   OPCAQREQ(ROPCAVT),X'B4'                          01S0922
*       RPARM=ADDR(OPCAQCTL);       /* SET REG 1 TO POINT TO PARM.
*                                      LIST                          */
         LA    RPARM,OPCAQCTL(,ROPCAVT)                         01S0923
*       SVC(102);                   /* POST IT                       */
         SVC   102                                              01S0924
*     END;                          /* END OF REDRIVE PROCESSING     */
*   ELSE                                                        01S0926
*     ;                             /* NOT ENOUGH UNITS, DON'T DO
*                                      REDRIVE                       */
*                                                               01S0926
@RF00873 DS    0H                                               01S0927
*   /*****************************************************************/
*   /*                                                               */
*   /* IF STILL MORE OPCE - RU'S TO BUILD, PLACE REDRIVE ELEMENT BACK*/
*   /* ON WAIT CHAIN                                                 */
*   /*                                                               */
*   /*****************************************************************/
*                                                               01S0927
*   IF OCBUFNED=0 THEN              /* IF PROCESSING DONE            */
         ICM   @14,3,OCBUFNED(ROPCE)                            01S0927
         BNZ   @RF00927                                         01S0927
*     DO;                                                       01S0928
*       RPARM=ROPCE;                /* FREE REDRIVE ....             */
         LR    RPARM,ROPCE                                      01S0929
*       CALL FREEBUFF;              /* .... OPCE                     */
         L     @15,OPCFREBF(,ROPCAVT)                           01S0930
         BALR  @14,@15                                          01S0930
*       RZERO=1;                    /* DECREMENT OPCADGOT AND ....   */
         LA    RZERO,1                                          01S0931
*       CALL DECRCT;                /* .... INITIATE REDRIVE    01S0932
*                                      PROCESSING FOR ANOTHER REDRIVE
*                                      OPCE                          */
         L     @15,OPCDECR(,ROPCAVT)                            01S0932
         BALR  @14,@15                                          01S0932
*     END;                                                      01S0933
*   ELSE                            /* PROCESSING NOT FINISHED       */
*     DO;                                                       01S0934
         B     @RC00927                                         01S0934
@RF00927 DS    0H                                               01S0935
*       OCWTG=THISMOD;              /* SET TO RETURN                 */
         MVC   OCWTG(2,ROPCE),THISMOD                           01S0935
*       OCLINK=OPCBUFWT;            /* PLACE REDRIVE OPCE ....       */
         MVC   OCLINK(4,ROPCE),OPCBUFWT(ROPCAVT)                01S0936
*       OPCBUFWT=ROPCE;             /* .... BACK ON WAIT CHAIN       */
         ST    ROPCE,OPCBUFWT(,ROPCAVT)                         01S0937
*     END;                                                      01S0938
*                                                               01S0938
*   /*****************************************************************/
*   /*                                                               */
*   /* SET TO XCTL TO THE CONTROL MOD. - IGC0010D                    */
*   /*                                                               */
*   /*****************************************************************/
*                                                               01S0939
*   OPCMODID=CNTLMOD;                                           01S0939
@RC00927 MVC   OPCMODID(2,ROPCAVT),CNTLMOD                      01S0939
*   END REDRIVE;                                                01S0940
@EL00002 DS    0H                                               01S0940
@EF00002 DS    0H                                               01S0940
@ER00002 L     @14,@SA00002                                     01S0940
         BR    @14                                              01S0940
*   END IGCFQ10D                                                01S0941
*                                                               01S0941
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */
*/*%INCLUDE SYSLIB  (TAVTD   )                                       */
*/*%INCLUDE SYSLIB  (TBDUD   )                                       */
*/*%INCLUDE SYSLIB  (TCD0D   )                                       */
*/*%INCLUDE SYSLIB  (TDSID   )                                       */
*/*%INCLUDE SYSLIB  (TOPCAVTD)                                       */
*/*%INCLUDE SYSLIB  (TOPCED  )                                       */
*/*%INCLUDE SYSLIB  (TOPRED  )                                       */
*/*%INCLUDE SYSLIB  (TPLMVD  )                                       */
*/*%INCLUDE SYSLIB  (TPRIOR  )                                       */
*/*%INCLUDE SYSLIB  (TPRUD   )                                       */
*/*%INCLUDE SYSLIB  (TRHD    )                                       */
*/*%INCLUDE SYSLIB  (TRVTD   )                                       */
*/*%INCLUDE SYSLIB  (TSATD   )                                       */
*/*%INCLUDE SYSLIB  (TTHD    )                                       */
*/*%INCLUDE SYSLIB  (TTRMD   )                                       */
*/*%INCLUDE SYSUT5  (RSPPROC )                                       */
*/*%INCLUDE SYSUT5  (CPYDSIR )                                       */
*/*%INCLUDE SYSUT5  (GETDIAL )                                       */
*/*%INCLUDE SYSUT5  (BLDREPL )                                       */
*/*%INCLUDE SYSUT5  (CHKSTEP )                                       */
*/*%INCLUDE SYSUT5  (REFORMAT)                                       */
*/*%INCLUDE SYSUT5  (CPYDSICK)                                       */
*/*%INCLUDE SYSUT5  (GETBUFUT)                                       */
*/*%INCLUDE SYSUT5  (BLDOPCE )                                       */
*                                                               01S0941
*       ;                                                       01S0941
@DATA    DS    0H
@CH00061 DC    H'1'
@CH00066 DC    H'2'
@CH00256 DC    H'4'
@CH00080 DC    H'6'
@CH00045 DC    H'8'
@CH00245 DC    H'12'
@CH00077 DC    H'24'
@CH02076 DC    XL2'4000'
@SB02300 MVZ   DIGITS+1(0,@14),DIGITS(@14)
@SC02302 CLC   TTEDIALD(0,DEVDPADR),DIGITS(@14)
@SM02306 MVC   TTEDIALR(0,@14),TTEDIAL(DEVDPADR)
@DATD    DSECT
         DS    0F
@SA00002 DS    1F
IGCFQ10D CSECT
         DS    0F
@CF01781 DC    XL4'08000002'
@DATD    DSECT
         DS    0D
ENTRYPTR DS    A
DATASAVE DS    A
UNITSAVE DS    A
PTRSAVSV DS    A
UNITSV   DS    A
UNITSGET DS    H
HALFUNIT DS    H
DIALSP   DS    CL35
         DS    CL1
PARMLSP  DS    CL24
FLAGS    DS    BL1
         ORG   FLAGS
FREUTFLG DS    BL1
BLRPLFLG EQU   FLAGS+0
FDRVTFLG EQU   FLAGS+0
BUILTFLG EQU   FLAGS+0
         ORG   FLAGS+1
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA
@ENDDATD EQU   *
IGCFQ10D CSECT
         DS    0F
@SIZDATD DC    AL1(0)
         DC    AL3(@ENDDATD-@DATD)
         DS    0D
@CB01781 DC    X'08000002'
@CB01815 DC    X'0B8000'
CNTLMOD  DC    CL2'00'
RPNCPMOD DC    CL2'FJ'
RUDSPMOD DC    CL2'02'
THISMOD  DC    CL2'FQ'
         DS    CL1
ADPATCH  DC    XL100'0'
@00      EQU   00                      EQUATES FOR REGISTERS 0-15
@01      EQU   01
@02      EQU   02
@03      EQU   03
@04      EQU   04
@05      EQU   05
@06      EQU   06
@07      EQU   07
@08      EQU   08
@09      EQU   09
@10      EQU   10
@11      EQU   11
@12      EQU   12
@13      EQU   13
@14      EQU   14
@15      EQU   15
TRMTBLSV EQU   @06
UNITPTR  EQU   @06
ORGNOPCE EQU   @11
DEVDPADR EQU   @09
IEDQAPTR EQU   @04
ROPCAVT  EQU   @02
ROPCE    EQU   @03
IEDPLMVP EQU   @10
IEDQTPTR EQU   @08
RZERO    EQU   @00
RPARM    EQU   @01
RAVT     EQU   @04
RTRM     EQU   @08
RWRKAREA EQU   @10
RSAVE    EQU   @13
RRET     EQU   @14
RBRNCH   EQU   @15
RTNCODE  EQU   @15
RCL14SAV EQU   @11
IEDQAVTD EQU   0
AVTSAVEX EQU   IEDQAVTD+288
AVTREADD EQU   IEDQAVTD+380
AVTBUFSW EQU   IEDQAVTD+384
@NM00004 EQU   IEDQAVTD+388
AVTCKFLG EQU   @NM00004
AVTBASE  EQU   IEDQAVTD+412
AVTPKF   EQU   AVTBASE
AVTRNMPT EQU   IEDQAVTD+424
AVTNOLBF EQU   IEDQAVTD+454
AVTHG02  EQU   IEDQAVTD+528
AVTDISP  EQU   IEDQAVTD+552
AVTHD    EQU   IEDQAVTD+556
AVTSCOPT EQU   AVTHD
AVTSAVTP EQU   IEDQAVTD+612
AVTSAVTF EQU   AVTSAVTP
AVTCKPEL EQU   IEDQAVTD+652
AVTCKRMV EQU   AVTCKPEL
AVTCKELF EQU   IEDQAVTD+680
AVTCKBYT EQU   IEDQAVTD+691
AVTHG01  EQU   IEDQAVTD+692
AVTCKLNK EQU   IEDQAVTD+696
AVTCRELE EQU   IEDQAVTD+708
AVTCCELE EQU   AVTCRELE
AVTCLRHI EQU   IEDQAVTD+716
AVTADBUF EQU   IEDQAVTD+720
AVTSYSER EQU   IEDQAVTD+728
AVTBFRFG EQU   IEDQAVTD+784
AVTCKPQB EQU   IEDQAVTD+804
AVTCKPTB EQU   AVTCKPQB
AVTCKPEC EQU   AVTCKPQB+4
AVTCKPCC EQU   AVTCKPEC
AVTOPCQB EQU   IEDQAVTD+816
AVTOPCOB EQU   AVTOPCQB
AVTOPCEC EQU   AVTOPCQB+4
AVTOPCCC EQU   AVTOPCEC
AVTOLTQB EQU   IEDQAVTD+828
AVTCWFL1 EQU   IEDQAVTD+924
AVTCWFL2 EQU   IEDQAVTD+925
AVTSUBT  EQU   IEDQAVTD+948
AVTIOTR  EQU   IEDQAVTD+949
AVTKEYLE EQU   IEDQAVTD+1032
AVTBIT1  EQU   IEDQAVTD+1050
AVTBIT2  EQU   IEDQAVTD+1051
AVTBIT3  EQU   IEDQAVTD+1052
AVTDDFT  EQU   IEDQAVTD+1064
AVTBIT4  EQU   IEDQAVTD+1136
@NM00083 EQU   IEDQAVTD+1232
IEDNSVTD EQU   0
SAVTDIAG EQU   IEDNSVTD
SAVTDIAF EQU   SAVTDIAG
SAVTSAT  EQU   IEDNSVTD+80
SAVTLUSQ EQU   IEDNSVTD+88
SAVTMVBF EQU   IEDNSVTD+160
SAVTSCLU EQU   IEDNSVTD+168
SAVTTCPU EQU   IEDNSVTD+238
SAVTZELM EQU   IEDNSVTD+270
SAVTRDRV EQU   IEDNSVTD+284
SAVTCKQB EQU   IEDNSVTD+300
SAVTCKTB EQU   SAVTCKQB
SAVTCKEC EQU   SAVTCKQB+4
SAVTCKCC EQU   SAVTCKEC
SAVTNETF EQU   IEDNSVTD+324
SAVTCDRV EQU   IEDNSVTD+332
IEDBDU   EQU   0
BDUCMND  EQU   IEDBDU
BDUMODIF EQU   IEDBDU+1
BDUFNFLG EQU   IEDBDU+2
BDUHEADR EQU   BDUFNFLG
BDUBDUFG EQU   IEDBDU+3
BDURSP   EQU   IEDBDU+4
BDUSYRSP EQU   BDURSP
BDUEXRSP EQU   BDURSP+1
BDUEND   EQU   IEDBDU+6
IEDDSI1  EQU   0
DSITOTNM EQU   IEDDSI1
DSIPOLL  EQU   IEDDSI1+3
DSIPOLNM EQU   DSIPOLL
IEDDSI2  EQU   0
DSIADRNM EQU   IEDDSI2
IEDDSI3  EQU   0
DSINPTID EQU   IEDDSI3
IEDDSI4  EQU   0
DSIDIAL  EQU   IEDDSI4
DSIDLCNT EQU   DSIDIAL
IEDQOPCD EQU   0
OPCAVTPT EQU   IEDQOPCD+8
OPCCOPCE EQU   IEDQOPCD+12
OPCTRACE EQU   IEDQOPCD+32
OPCPGCK  EQU   IEDQOPCD+40
OPCSAVE  EQU   IEDQOPCD+56
OPCWORK  EQU   IEDQOPCD+140
OPCAQCTL EQU   IEDQOPCD+180
OPCXCTL  EQU   IEDQOPCD+204
OPCLDNME EQU   IEDQOPCD+212
OPCMODID EQU   OPCLDNME+3
OPCGETBF EQU   IEDQOPCD+276
OPCFREBF EQU   IEDQOPCD+280
OPCSPEC  EQU   IEDQOPCD+300
OPCADGOT EQU   IEDQOPCD+318
OPCBUFWT EQU   IEDQOPCD+348
OPCDECR  EQU   IEDQOPCD+352
OPCPWCOB EQU   IEDQOPCD+368
OPCPWQCB EQU   OPCPWCOB
OPCPWECB EQU   OPCPWCOB+4
OPCSESS  EQU   IEDQOPCD+384
OPCSFLAG EQU   OPCSESS
OPCSENSE EQU   OPCSESS+8
OPCSNSSY EQU   OPCSENSE
OPCSNSUS EQU   OPCSENSE+2
OPCPCID  EQU   IEDQOPCD+456
OPCUNIQP EQU   OPCPCID+2
OPCSESSF EQU   IEDQOPCD+464
IEDQOPCE EQU   0
OCLINK   EQU   IEDQOPCE
OCELEM   EQU   IEDQOPCE+4
OCELMPRI EQU   OCELEM
OCUNIT   EQU   IEDQOPCE+8
OCRUDEST EQU   OCUNIT
OCCKPKEY EQU   OCRUDEST
OCSCAN   EQU   OCCKPKEY
@NM00130 EQU   OCRUDEST+1
OCUNITBF EQU   @NM00130+2
OCOPTCDE EQU   IEDQOPCE+12
OCPRIFLG EQU   OCOPTCDE
OCSWITCH EQU   IEDQOPCE+13
OCFLAG   EQU   IEDQOPCE+14
OCRLN    EQU   IEDQOPCE+15
OCCIB    EQU   IEDQOPCE+16
OCMSTSAV EQU   OCCIB
OCDEST   EQU   OCMSTSAV
OCTRMTBL EQU   IEDQOPCE+20
OCLINENO EQU   IEDQOPCE+22
OCTIOT   EQU   OCLINENO
OCWTGB   EQU   OCTIOT
OCTRUNIT EQU   IEDQOPCE+24
OCRSID   EQU   OCTRUNIT
OCALSTAT EQU   OCRSID
OCFNAALL EQU   OCALSTAT
OCREDRVE EQU   OCALSTAT
OCACTREQ EQU   OCALSTAT
OCFLAG1  EQU   OCRSID+1
OCPARM   EQU   IEDQOPCE+28
OCWTG    EQU   IEDQOPCE+30
OCBACKUP EQU   IEDQOPCE+32
OCBUFNED EQU   OCBACKUP
OCCOUNT1 EQU   OCBUFNED
OCBUFGOT EQU   OCBACKUP+2
OCCOUNT2 EQU   OCBUFGOT
OCMODNME EQU   IEDQOPCE+40
OCIPLWA  EQU   OCMODNME
OCPTRSAV EQU   OCMODNME+4
OCCKDATA EQU   IEDQOPCE+48
OCRSTGTM EQU   OCCKDATA
OC379RRT EQU   OCRSTGTM
OCNCP    EQU   OCRSTGTM+2
OCOID    EQU   IEDQOPCE+56
IEDQOPCN EQU   0
OCLDNME  EQU   IEDQOPCN
OCLINTTE EQU   OCLDNME
OCRESPCT EQU   OCLINTTE
OCREQFLG EQU   OCLINTTE+2
OCPREFLG EQU   OCLINTTE+3
IEDOPRED EQU   0
OPRESAVE EQU   IEDOPRED+8
OPRETIC  EQU   OPRESAVE
OPRVTCHK EQU   OPRETIC+3
OPREFLG3 EQU   IEDOPRED+14
IEDPLMV  EQU   0
PLMVTU   EQU   IEDPLMV
PLMVTD   EQU   IEDPLMV+4
PLMVSU   EQU   IEDPLMV+8
PLMVSD   EQU   IEDPLMV+12
PLMVLNTH EQU   IEDPLMV+16
PLMVFLGS EQU   IEDPLMV+18
PLMVFLG1 EQU   PLMVFLGS
PLMVSCTG EQU   PLMVFLG1
PLMVTCTG EQU   PLMVFLG1
IEDPRUQD EQU   0
PRUTTCIN EQU   IEDPRUQD
PRUDATCT EQU   IEDPRUQD+2
PRUTIC   EQU   IEDPRUQD+8
PRUNUNIT EQU   PRUTIC+1
PRUVTCHK EQU   PRUNUNIT+2
PRUDATA  EQU   IEDPRUQD+12
IEDPRUND EQU   0
PRURHTH  EQU   IEDPRUND
PRURH    EQU   PRURHTH
PRURHFG0 EQU   PRURH
PRURHFG1 EQU   PRURH+1
PRURHFG2 EQU   PRURH+2
PRUTH    EQU   PRURHTH+3
PRUFIDN  EQU   PRUTH
IEDRH    EQU   0
TRHBYTE0 EQU   IEDRH
TRHBYTE1 EQU   IEDRH+1
TRHBYTE2 EQU   IEDRH+2
IEDRVTD  EQU   0
RVTPREF  EQU   IEDRVTD
RVTLUPDI EQU   RVTPREF+4
RVTNUM   EQU   RVTPREF+10
RVTINDEX EQU   IEDRVTD+12
IEDSATD  EQU   0
SATRNRVT EQU   IEDSATD+4
IEDTH    EQU   0
TTHBYTE0 EQU   IEDTH
TTHSNF   EQU   IEDTH+6
TTHTAG   EQU   TTHSNF
TTHTAG1  EQU   TTHTAG
IEDQTRM  EQU   0
TRMSTATE EQU   IEDQTRM
TRMLOG   EQU   TRMSTATE
TRMDESTQ EQU   IEDQTRM+1
TRMRSTRT EQU   TRMDESTQ+2
TRMINSEQ EQU   IEDQTRM+4
TLISTCNT EQU   TRMINSEQ
TRMSESCT EQU   TLISTCNT
TRMOUTSQ EQU   IEDQTRM+6
TLISTEN  EQU   TRMOUTSQ
TRMDSORG EQU   TLISTEN
TRMPLIM  EQU   TLISTEN+1
TRMALTD  EQU   IEDQTRM+8
TRMPRILK EQU   TRMALTD
TRMDEVFL EQU   IEDQTRM+10
TRMDDIG  EQU   TRMDEVFL
TRMADDC  EQU   TRMDEVFL
TRMNCPI  EQU   TRMDEVFL+1
TRMSTAT  EQU   IEDQTRM+12
TRMAPB   EQU   TRMSTAT
TRMSIO   EQU   TRMAPB
TRMOWNER EQU   TRMSIO
TRMSENSE EQU   TRMAPB+3
IEDNTRM  EQU   0
TRMDIALQ EQU   IEDNTRM+1
TRMBYTE7 EQU   TRMDIALQ+2
TRMATNDX EQU   IEDNTRM+4
TRMINDEX EQU   IEDNTRM+6
TRMCOHTG EQU   IEDNTRM+8
TRMBYTE6 EQU   TRMCOHTG
TRMCDF0  EQU   TRMBYTE6
TRMBYTE5 EQU   TRMCOHTG+1
TRMBYTE4 EQU   IEDNTRM+10
TRMBYTE3 EQU   IEDNTRM+11
TRMBYTE2 EQU   IEDNTRM+12
TRMINPG  EQU   TRMBYTE2
TRMBYTE1 EQU   IEDNTRM+13
TRMSCPRQ EQU   TRMBYTE1
TRMAUTOC EQU   TRMBYTE1
TRMBYTE0 EQU   IEDNTRM+16
TRMNOWCD EQU   TRMBYTE0
TRMSIBPT EQU   IEDNTRM+17
TRMLTRAC EQU   TRMSIBPT
TRMLBUFR EQU   TRMLTRAC
TRMRLMCT EQU   IEDNTRM+20
TRMLGBST EQU   TRMRLMCT
TRMTYPE  EQU   IEDNTRM+21
TTEDIAL  EQU   0
TTEDIALN EQU   TTEDIAL
TTEDIALD EQU   TTEDIAL+1
DIALDATA EQU   0
COUNT    EQU   DIALDATA
MAXIMUM  EQU   DIALDATA+1
TTEDIALR EQU   DIALDATA+2
ACTUAL   EQU   TTEDIALR
DIGITS   EQU   TTEDIALR+1
TICFLD   EQU   0
TIC      EQU   TICFLD+3
ALLOCBUF EQU   0
FREEBUFF EQU   0
IEDQTNT  EQU   0
IEDQTL   EQU   0
DECRCT   EQU   0
IEDMVBFR EQU   0
PROGRTNE EQU   0
RDSI1    EQU   PLMVSD
RDSI2    EQU   PLMVSD
RDSI3    EQU   PLMVSD
RDSI4    EQU   PLMVSD
OPCAQWD  EQU   OPCAQCTL
OPCAQWD1 EQU   OPCAQWD
OPCAQREQ EQU   OPCAQWD1
OPCAQWD2 EQU   OPCAQWD+4
OPCAQWD3 EQU   OPCAQWD+8
@NM00137 EQU   OCCKDATA
@NM00139 EQU   OCCIB
@NM00140 EQU   @NM00139+1
OCCKPKY1 EQU   OCCKPKEY
OCCKPTYP EQU   OCCKPKY1
OCICACTN EQU   OCMODNME
OCICDADR EQU   OCICACTN
OCICSW   EQU   OCICDADR+3
@NM00145 EQU   OCBACKUP
@NM00146 EQU   OCCKDATA
OCMSGFLG EQU   OCPREFLG
OCBKUP1  EQU   OCMODNME
@NM00150 EQU   OCMODNME
OCBKUP2  EQU   OCCKDATA
OCBKUP3  EQU   OCLDNME
OCRESPTR EQU   OCBKUP3+4
OCDIALLN EQU   OCRESPTR
OCIPLDMP EQU   OCLDNME+4
IEDPRUQP EQU   OCUNIT
ENTRYRVT EQU   OCMODNME
IEDQRVTP EQU   ENTRYRVT
IEDQSATP EQU   ENTRYPTR
@NM00188 EQU   TRMSTATE
TRMLUFD0 EQU   TRMBYTE7
TRMSNAST EQU   TRMBYTE6
TRMCDFD0 EQU   TRMBYTE5
TRMPRE1  EQU   TRMBYTE4
TRMNCP1  EQU   TRMBYTE4
TRMLU1   EQU   TRMBYTE4
TRMLINK1 EQU   TRMBYTE4
TRMDCONS EQU   TRMLINK1
TRMPRE   EQU   TRMBYTE3
TRMNCP   EQU   TRMBYTE3
TRMIPLDM EQU   TRMNCP
TRMPU    EQU   TRMBYTE3
TRMLU    EQU   TRMBYTE3
TRMCDMGR EQU   TRMBYTE3
TRMLINK  EQU   TRMBYTE3
ENTRYCT  EQU   UNITSGET
BDUTEXT  EQU   BDUEND
OCLINRRT EQU   OCTRUNIT
OCPCID   EQU   OCBACKUP
OCRSNCDE EQU   OCALSTAT
OCSENSE  EQU   OCBACKUP
TRMOPT   EQU   IEDQTRM+20
TRMPOOLP EQU   TRMINSEQ
TRMSRPTR EQU   TRMPLIM
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS
TRMLDISC EQU   TRMLINK
@NM00207 EQU   TRMLINK
TRMLALOC EQU   TRMLINK
TRMLSTAT EQU   TRMLINK
TRMLINT  EQU   TRMLINK
TRMEPMOD EQU   TRMLINK
TRMCDLOG EQU   TRMCDMGR
@NM00206 EQU   TRMCDMGR
@NM00205 EQU   TRMCDMGR
@NM00204 EQU   TRMCDMGR
@NM00203 EQU   TRMCDMGR
@NM00202 EQU   TRMCDMGR
TRMBKDUP EQU   TRMCDMGR
TRMLULOG EQU   TRMLU
@NM00201 EQU   TRMLU
@NM00200 EQU   TRMLU
@NM00199 EQU   TRMLU
TRMTDIFF EQU   TRMLU
@NM00198 EQU   TRMLU
@NM00197 EQU   TRMLU
@NM00196 EQU   TRMLU
TRMPCONT EQU   TRMPU
TRMPDOCQ EQU   TRMPU
TRMPULOC EQU   TRMPU
TRMPDNAS EQU   TRMPU
TRMPALOC EQU   TRMPU
TRMNCONT EQU   TRMNCP
TRMQUCKN EQU   TRMNCP
TRMSLOWN EQU   TRMNCP
TRMSYGEN EQU   TRMNCP
TRMNCPCL EQU   TRMNCP
TRMCONN  EQU   TRMIPLDM
TRMINOUT EQU   TRMPRE
TRMRDOUT EQU   TRMPRE
TRMNLOUT EQU   TRMPRE
TRMWROUT EQU   TRMPRE
TRMASNXI EQU   TRMPRE
TRMSTMM  EQU   TRMPRE
TRMCMODE EQU   TRMPRE
TRMSTPND EQU   TRMPRE
TRMNCPLK EQU   TRMLINK1
@NM00195 EQU   TRMLINK1
TRMDCONN EQU   TRMDCONS
TRMDCOP  EQU   TRMDCONS
TRMPMARY EQU   TRMLU1
TRMLUNAS EQU   TRMLU1
@NM00194 EQU   TRMLU1
TRMLSCVP EQU   TRMLU1
@NM00193 EQU   TRMLU1
TRMCPOPT EQU   TRMLU1
TRMCPREQ EQU   TRMLU1
@NM00192 EQU   TRMNCP1
TRMANS   EQU   TRMNCP1
TRMLINOP EQU   TRMNCP1
TRMINOP  EQU   TRMNCP1
TRMLYNCH EQU   TRMPRE1
TRMSPOUT EQU   TRMPRE1
TRMERLCK EQU   TRMPRE1
TRMQNPL  EQU   TRMPRE1
TRMSPACT EQU   TRMPRE1
TRMOCNI  EQU   TRMPRE1
TRMSESSN EQU   TRMPRE1
TRMCONT  EQU   TRMPRE1
TRMINERR EQU   TRMCDFD0
TRMLUTM  EQU   TRMCDFD0
TRMLUIT  EQU   TRMCDFD0
TRMLUREQ EQU   TRMCDFD0
TRMCDPRE EQU   TRMCDFD0
TRMWASCD EQU   TRMCDFD0
TRMSRPFG EQU   TRMCDFD0
TRMSESRQ EQU   TRMCDFD0
@NM00191 EQU   TRMSNAST
TRMDRSRC EQU   TRMSNAST
@NM00190 EQU   TRMLUFD0
TRMNOINP EQU   TRMLUFD0
TRMASSOC EQU   TRMLUFD0
TRMAUTO  EQU   TRMLUFD0
@NM00189 EQU   @NM00188
TRMENTRY EQU   @NM00188
@NM00153 EQU   OCIPLDMP
OCACTRQ  EQU   OCIPLDMP
OCDACRQ  EQU   OCIPLDMP
OCIPLRQ  EQU   OCIPLDMP
OCDMPRQ  EQU   OCIPLDMP
@NM00152 EQU   OCRESPTR+2
OCOHNATA EQU   OCDIALLN
OCRRTPTR EQU   OCBKUP3
@NM00151 EQU   OCBKUP2+4
OCNHITTC EQU   OCBKUP2+2
OCLINTTC EQU   OCBKUP2
OCCSIB   EQU   @NM00150
@NM00149 EQU   OCBKUP1+6
OCTARTTC EQU   OCBKUP1+4
OCSRTTC  EQU   OCBKUP1+2
OCRSTTC  EQU   OCBKUP1
@NM00148 EQU   OCMSGFLG
OCRRT    EQU   OCMSGFLG
OCNAME   EQU   OCMSGFLG
OCLU1TTE EQU   @NM00146+5
OCSFLAG  EQU   @NM00146+4
OCLU2TTI EQU   @NM00146+2
OCLU1TTI EQU   @NM00146
OCDISTLN EQU   @NM00145+6
OCDISTAD EQU   @NM00145+2
OCDISTNA EQU   @NM00145
OCICINAC EQU   OCICSW
@NM00144 EQU   OCICSW
OCICATST EQU   OCICDADR+1
OCICTYPE EQU   OCICDADR
@NM00143 EQU   OCCKPKY1
OCCKPENV EQU   OCCKPKY1
OCCKPRST EQU   OCCKPTYP
OCCKPNCP EQU   OCCKPTYP
OCCKPINC EQU   OCCKPTYP
@NM00142 EQU   @NM00139+2
@NM00141 EQU   @NM00140
OCTSTAT  EQU   @NM00140
OCREASON EQU   @NM00139
@NM00138 EQU   @NM00137+4
OCOIDEP  EQU   @NM00137
OPCAQLST EQU   OPCAQWD3+1
OPCAQRQ3 EQU   OPCAQWD3
OPCAQSEC EQU   OPCAQWD2+1
OPCAQRQ2 EQU   OPCAQWD2
OPCAQFST EQU   OPCAQWD1+1
@NM00208 EQU   TICFLD
TRMSUBST EQU   IEDNTRM+22
TRMPRIME EQU   TRMLGBST
TRMOWNR  EQU   TRMLBUFR+1
TRMGPCNT EQU   TRMLBUFR
TRMBUFRD EQU   TRMBYTE0
TRMSNA   EQU   TRMBYTE0
TRMGP    EQU   TRMBYTE0
TRMDIAL  EQU   TRMBYTE0
TRMACDC  EQU   TRMNOWCD
TRMOUTPT EQU   TRMBYTE0
TRMINPUT EQU   TRMBYTE0
TRMUDEF  EQU   TRMBYTE0
TRMCOHRT EQU   IEDNTRM+14
TRMSTOTE EQU   TRMBYTE1
TRMCKPRN EQU   TRMBYTE1
TRMTSATN EQU   TRMBYTE1
TRMTRACE EQU   TRMBYTE1
TRMSWBCK EQU   TRMBYTE1
TRMINPTP EQU   TRMBYTE1
TRMWTNEG EQU   TRMSCPRQ
TRMWRBRK EQU   TRMBYTE2
TRMNOSND EQU   TRMBYTE2
TRMPREP  EQU   TRMBYTE2
TRMGPACT EQU   TRMBYTE2
TRMANDL  EQU   TRMBYTE2
TRMCLOSN EQU   TRMINPG
TRMREMB  EQU   TRMBYTE2
TRMRSACT EQU   TRMBYTE2
TRMCINOP EQU   TRMCDF0
TRMRSTPD EQU   TRMCDF0
TRMCLNXI EQU   TRMCDF0
TRMDVAS0 EQU   TRMCDF0
TRMPURGE EQU   TRMCDF0
TRMCDST  EQU   TRMINDEX
TRMASNDX EQU   TRMATNDX
TRMBYTE8 EQU   TRMDIALQ+1
@NM00187 EQU   TRMDIALQ
@NM00186 EQU   IEDNTRM
TRMOPTBL EQU   IEDQTRM+18
TRMOPNO  EQU   IEDQTRM+17
TRMCHCIN EQU   IEDQTRM+16
TRMLOCAD EQU   TRMSENSE
TRMTEMPR EQU   TRMAPB+2
TRMNADDR EQU   TRMOWNER
@NM00185 EQU   TRMDEVFL+1
TRMTPIN  EQU   TRMDEVFL+1
@NM00184 EQU   TRMNCPI
TRMRNTRM EQU   TRMDEVFL+1
@NM00183 EQU   TRMDEVFL+1
TRMLMD   EQU   TRMDEVFL+1
TRMCONC  EQU   TRMDEVFL+1
TRMTSOB  EQU   TRMDEVFL
TRMBFDY  EQU   TRMDEVFL
TRMTBLK  EQU   TRMDEVFL
TRMSBLK  EQU   TRMDEVFL
TRMBLKS  EQU   TRMDEVFL
TRMSCV   EQU   TRMADDC
TRMBUFS  EQU   TRMDEVFL
TRMSTEAL EQU   TRMPRILK
TRMLGB   EQU   TRMDSORG
TRMUTERM EQU   TRMSESCT
TRMVERIF EQU   TRMRSTRT
@NM00182 EQU   TRMRSTRT
@NM00181 EQU   TRMDESTQ
TRMSCNYN EQU   TRMSTATE
TRMOPTFN EQU   TRMSTATE
TRMHELDN EQU   TRMSTATE
TRMACPTN EQU   TRMSTATE
TRMPREF  EQU   TRMSTATE
TRMPROC  EQU   TRMLOG
TRMLIST  EQU   TRMLOG
TRMLINE  EQU   TRMSTATE
TTHDCF   EQU   IEDTH+8
TTHTAG2  EQU   TTHTAG+1
@NM00180 EQU   TTHTAG1
TTHTAGS  EQU   TTHTAG1
TTHOAF   EQU   IEDTH+4
TTHDAF   EQU   IEDTH+2
TTHBYTE1 EQU   IEDTH+1
TTHEFI   EQU   TTHBYTE0
@NM00179 EQU   TTHBYTE0
TTHEBIU  EQU   TTHBYTE0
TTHBBIU  EQU   TTHBYTE0
TTHFTYPE EQU   TTHBYTE0
SATRNLCB EQU   IEDSATD
@NM00178 EQU   RVTPREF+9
@NM00177 EQU   RVTPREF+8
RVTLCNA  EQU   RVTLUPDI
RVTGMSIZ EQU   RVTPREF
@NM00176 EQU   TRHBYTE2
TRHPDI   EQU   TRHBYTE2
TRHEDI   EQU   TRHBYTE2
TRHCSI   EQU   TRHBYTE2
@NM00175 EQU   TRHBYTE2
TRHCDI   EQU   TRHBYTE2
TRHEB    EQU   TRHBYTE2
TRHBB    EQU   TRHBYTE2
TRHPI    EQU   TRHBYTE1
TRHQRI   EQU   TRHBYTE1
@NM00174 EQU   TRHBYTE1
@NM00173 EQU   TRHBYTE1
TRHER    EQU   TRHBYTE1
TRHDR2   EQU   TRHBYTE1
@NM00172 EQU   TRHBYTE1
TRHDR1   EQU   TRHBYTE1
TRHEC    EQU   TRHBYTE0
TRHBC    EQU   TRHBYTE0
TRHSDI   EQU   TRHBYTE0
TRHFI    EQU   TRHBYTE0
@NM00171 EQU   TRHBYTE0
TRHRUCAT EQU   TRHBYTE0
TRHTYPE  EQU   TRHBYTE0
@NM00170 EQU   IEDPRUND+6
PRUTAG   EQU   IEDPRUND+4
PRUTHEFI EQU   PRUFIDN
PRUTHUSS EQU   PRUFIDN
PRUTHEIU EQU   PRUFIDN
PRUTHBIU EQU   PRUFIDN
PRUTHTYE EQU   PRUFIDN
@NM00169 EQU   PRURHFG2
PRURHCSI EQU   PRURHFG2
@NM00168 EQU   PRURHFG2
PRURHCDI EQU   PRURHFG2
PRURHEB  EQU   PRURHFG2
PRURHBB  EQU   PRURHFG2
PRURHPI  EQU   PRURHFG1
@NM00167 EQU   PRURHFG1
PRURHER  EQU   PRURHFG1
PRURHDR2 EQU   PRURHFG1
@NM00166 EQU   PRURHFG1
PRURHDR1 EQU   PRURHFG1
PRURHEC  EQU   PRURHFG0
PRURHBC  EQU   PRURHFG0
PRURHSDI EQU   PRURHFG0
PRURHFI  EQU   PRURHFG0
@NM00165 EQU   PRURHFG0
PRURUCAT EQU   PRURHFG0
PRURHTYP EQU   PRURHFG0
@NM00164 EQU   PRUVTCHK
PRUITSET EQU   PRUVTCHK
@NM00163 EQU   PRUVTCHK
@NM00162 EQU   PRUNUNIT
@NM00161 EQU   PRUTIC
@NM00160 EQU   IEDPRUQD+4
PLMVUNCA EQU   IEDPLMV+20
PLMVFLG2 EQU   PLMVFLGS+1
@NM00159 EQU   PLMVFLG1
PLMVTRIB EQU   PLMVFLG1
PLMVSRIB EQU   PLMVFLG1
PLMVTSKP EQU   PLMVFLG1
PLMVSSKP EQU   PLMVFLG1
PLMVUNCF EQU   PLMVFLG1
@NM00158 EQU   OPREFLG3
OPREATCH EQU   OPREFLG3
@NM00157 EQU   OPREFLG3
OPREFLG2 EQU   IEDOPRED+13
OPREFLG1 EQU   IEDOPRED+12
@NM00156 EQU   OPRVTCHK
OPRITSET EQU   OPRVTCHK
@NM00155 EQU   OPRVTCHK
@NM00154 EQU   OPRETIC
OPRELINK EQU   IEDOPRED+5
OPREPRI  EQU   IEDOPRED+4
OPREQCB  EQU   IEDOPRED+1
OPREKEY  EQU   IEDOPRED
@NM00147 EQU   OCLDNME+6
OC1SQID  EQU   OCLDNME+4
OCWAITPC EQU   OCPREFLG
OCSRCCLN EQU   OCPREFLG
OCREMCON EQU   OCPREFLG
OCCLNUP  EQU   OCPREFLG
OCTOTEP  EQU   OCPREFLG
OCREPOST EQU   OCPREFLG
OCRSPSNT EQU   OCPREFLG
OCBFREQ  EQU   OCPREFLG
OCIDLE   EQU   OCREQFLG
OCFORCE  EQU   OCREQFLG
OCDCARD  EQU   OCREQFLG
OCPARTAL EQU   OCREQFLG
OCADNCP  EQU   OCREQFLG
OCRMPORQ EQU   OCREQFLG
OCCDLACT EQU   OCREQFLG
OCFLUSHZ EQU   OCREQFLG
@NM00136 EQU   IEDQOPCE+60
OCURC    EQU   OCOID
OCCKPTWA EQU   OCCKDATA+4
OCSRCTTC EQU   OCNCP
OCCKDAT2 EQU   OC379RRT+1
OCCKDAT1 EQU   OC379RRT
OCECHOPT EQU   OCPTRSAV
OCPUADR  EQU   OCIPLWA+2
OCWTGSAV EQU   OCIPLWA
OCDVRDCT EQU   OCBACKUP+6
@NM00135 EQU   OCBACKUP+4
OCBUFRET EQU   OCCOUNT2
OCBUFUSD EQU   OCCOUNT1
OCRESNUM EQU   OCPARM
OCSEQ    EQU   OCTRUNIT+2
OCTYPTRM EQU   OCFLAG1
OCNONE   EQU   OCALSTAT
OCSOME   EQU   OCALSTAT
OCALLFLG EQU   OCALSTAT
OCSEQIND EQU   OCALSTAT
OCDACTIP EQU   OCFNAALL
OCRENTRD EQU   OCALSTAT
OCDIALX  EQU   OCWTGB
OCATNDX  EQU   OCMSTSAV+2
OCREQVAL EQU   OCDEST+1
OCCONID  EQU   OCDEST
OCLOCAD  EQU   OCRLN
OCRESP   EQU   OCFLAG
OCATTACH EQU   OCFLAG
OCSSCP   EQU   OCFLAG
OCOUTPUT EQU   OCFLAG
OCLINE   EQU   OCFLAG
OCMPP    EQU   OCFLAG
OCTOTE   EQU   OCFLAG
OCCONSOL EQU   OCFLAG
@NM00134 EQU   OCSWITCH
OCQUCKN  EQU   OCSWITCH
@NM00133 EQU   OCUNITBF
OCINVTIC EQU   OCUNITBF
@NM00132 EQU   OCUNITBF
@NM00131 EQU   @NM00130
@NM00129 EQU   OCSCAN
OCNOTUCB EQU   OCSCAN
OCNONAME EQU   OCSCAN
OCALLRLN EQU   OCSCAN
OCDDNAME EQU   OCSCAN
OCDDNRLN EQU   OCSCAN
OCADDR   EQU   OCSCAN
OCELMPTR EQU   OCELEM+1
OPCBOTTM EQU   IEDQOPCD+3644
@NM00128 EQU   IEDQOPCD+1948
@NM00127 EQU   IEDQOPCD+1860
@NM00126 EQU   IEDQOPCD+1772
@NM00125 EQU   IEDQOPCD+1696
@NM00124 EQU   IEDQOPCD+1620
OPCDSRWT EQU   IEDQOPCD+1616
@NM00123 EQU   IEDQOPCD+1532
@NM00122 EQU   IEDQOPCD+1336
@NM00121 EQU   IEDQOPCD+1328
@NM00120 EQU   IEDQOPCD+528
OPCRSTRS EQU   IEDQOPCD+524
OPCSAVES EQU   IEDQOPCD+520
OPCRSPBD EQU   IEDQOPCD+516
OPCNFY03 EQU   IEDQOPCD+512
OPCNFY01 EQU   IEDQOPCD+508
OPCURC   EQU   IEDQOPCD+504
OPCCINBD EQU   IEDQOPCD+500
OPCCRKEY EQU   IEDQOPCD+496
OPCDRSET EQU   IEDQOPCD+492
OPCDRCLN EQU   IEDQOPCD+488
OPCDRDEL EQU   IEDQOPCD+484
OPCDRLOD EQU   IEDQOPCD+480
OPCDRLOC EQU   IEDQOPCD+476
OPCDRCVT EQU   IEDQOPCD+472
OPCDRFST EQU   IEDQOPCD+468
OPCLSABC EQU   IEDQOPCD+466
@NM00119 EQU   IEDQOPCD+465
@NM00118 EQU   OPCSESSF
OPCUNIQV EQU   OPCUNIQP+2
OPCUNIQU EQU   OPCUNIQP
OPCOSSCP EQU   OPCPCID
@NM00117 EQU   IEDQOPCD+452
@NM00116 EQU   IEDQOPCD+448
OPCSDUPU EQU   IEDQOPCD+444
OPCSDULU EQU   IEDQOPCD+440
OPCSDRVT EQU   IEDQOPCD+436
OPCSDRET EQU   IEDQOPCD+432
OPCSDHSY EQU   IEDQOPCD+428
OPCSDENQ EQU   IEDQOPCD+424
OPCSDDIA EQU   IEDQOPCD+420
OPCSDAPU EQU   IEDQOPCD+416
OPCSDALU EQU   IEDQOPCD+412
OPCCSKEY EQU   IEDQOPCD+408
OPCSSKEY EQU   IEDQOPCD+404
OPCPRTTE EQU   IEDQOPCD+400
OPCLU2TT EQU   OPCSESS+14
OPCLU1TT EQU   OPCSESS+12
OPCSNSU2 EQU   OPCSNSUS+1
OPCSNSU1 EQU   OPCSNSUS
OPCSNSMN EQU   OPCSNSSY+1
OPCSNSMJ EQU   OPCSNSSY
OPCCSIB  EQU   OPCSESS+4
OPCCTTE  EQU   OPCSESS+1
@NM00115 EQU   OPCSFLAG
OPCISQUD EQU   OPCSFLAG
OPCERRST EQU   OPCSFLAG
OPCISRSP EQU   OPCSFLAG
OPCISQUE EQU   OPCSFLAG
OPCRAPMH EQU   OPCSFLAG
OPCRAPI  EQU   OPCSFLAG
OPCGTSIB EQU   IEDQOPCD+380
@NM00114 EQU   OPCPWCOB+9
@NM00113 EQU   OPCPWCOB+8
@NM00112 EQU   OPCPWECB+1
OPCPWCCC EQU   OPCPWECB
OPCPWCHN EQU   OPCPWQCB+1
OPCPWVTO EQU   OPCPWQCB
OPCWAITV EQU   IEDQOPCD+364
OPCTOTCK EQU   IEDQOPCD+360
OPCAPXTL EQU   IEDQOPCD+356
OPCWRKSP EQU   IEDQOPCD+320
OPCRQCNT EQU   IEDQOPCD+316
OPPOLSTP EQU   IEDQOPCD+312
OPCCKCIB EQU   IEDQOPCD+308
OPCEND   EQU   IEDQOPCD+307
OPCSTCBS EQU   IEDQOPCD+306
OPCHNEND EQU   IEDQOPCD+302
OPCOQSW  EQU   IEDQOPCD+301
@NM00111 EQU   OPCSPEC
@NM00110 EQU   OPCSPEC
@NM00109 EQU   OPCSPEC
@NM00108 EQU   OPCSPEC
OPCFRMCA EQU   OPCSPEC
OPCRSTRT EQU   OPCSPEC
OPCPART  EQU   OPCSPEC
OPCALTD  EQU   OPCSPEC
OPCBFEND EQU   IEDQOPCD+296
OPCBFIRS EQU   IEDQOPCD+292
OPCAVBUF EQU   IEDQOPCD+290
OPCIPLCT EQU   IEDQOPCD+289
OPCCLNTS EQU   IEDQOPCD+288
OPCHA8   EQU   IEDQOPCD+286
OPCBFREQ EQU   IEDQOPCD+284
OPCNEXT  EQU   IEDQOPCD+272
OPCFMDFC EQU   IEDQOPCD+268
OPCSCNC  EQU   IEDQOPCD+264
OPCHORTG EQU   IEDQOPCD+260
OPCHORT  EQU   IEDQOPCD+256
OPCCKPTL EQU   IEDQOPCD+252
OPCCKPTF EQU   IEDQOPCD+248
OPCWAITA EQU   IEDQOPCD+244
OPCWAITR EQU   IEDQOPCD+240
OPCWAITP EQU   IEDQOPCD+236
OPCWAITO EQU   IEDQOPCD+232
OPCWAITN EQU   IEDQOPCD+228
OPCWAITL EQU   IEDQOPCD+224
OPCWAITC EQU   IEDQOPCD+220
@NM00107 EQU   OPCLDNME+5
@NM00106 EQU   OPCLDNME
OPCWAIT  EQU   IEDQOPCD+192
OPCCKERB EQU   IEDQOPCD+164
OPCBFERB EQU   IEDQOPCD+148
OPCFLAG2 EQU   IEDQOPCD+147
OPCFLAG1 EQU   IEDQOPCD+146
OPCWRKSZ EQU   IEDQOPCD+144
OPCRSAVE EQU   IEDQOPCD+132
OPCQCBAD EQU   IEDQOPCD+128
OPCTRMWA EQU   IEDQOPCD+52
OPCPSTWT EQU   IEDQOPCD+48
OPCTNTEA EQU   IEDQOPCD+44
OPCLCB   EQU   IEDQOPCD+36
OPCIPLAD EQU   IEDQOPCD+28
OPCTOFLK EQU   IEDQOPCD+24
OPCOPTLK EQU   IEDQOPCD+20
OPCDCBLK EQU   IEDQOPCD+16
OPCDOUBL EQU   IEDQOPCD
DSIDLDIG EQU   DSIDIAL+3
DSISLACT EQU   DSIDIAL+2
DSIDLMAX EQU   DSIDIAL+1
DSIMODID EQU   IEDDSI3+3
DSISEQNO EQU   IEDDSI3+1
DSIADDR  EQU   IEDDSI2+1
DSIPOLCH EQU   DSIPOLL+1
DSINETAD EQU   IEDDSI1+1
BDUXGRPH EQU   BDUEXRSP
BDUXFINL EQU   BDUEXRSP
BDUXINIT EQU   BDUEXRSP
BDURESP  EQU   BDUSYRSP
BDUPHASE EQU   BDUSYRSP
BDUERROR EQU   BDUSYRSP
BDUXERLK EQU   BDUBDUFG
BDUALTAK EQU   BDUFNFLG
BDUNEGAK EQU   BDUFNFLG
BDUPOSAK EQU   BDUFNFLG
BDUTPTX  EQU   BDUFNFLG
BDUFRSTB EQU   BDUFNFLG
BDULEADG EQU   BDUFNFLG
BDUSTHDR EQU   BDUFNFLG
SAVTSMAX EQU   IEDNSVTD+500
SAVTSINO EQU   IEDNSVTD+498
SAVTAMAX EQU   IEDNSVTD+496
SAVTAENO EQU   IEDNSVTD+494
SAVTAINO EQU   IEDNSVTD+492
SAVTNMAX EQU   IEDNSVTD+490
SAVTNENO EQU   IEDNSVTD+488
SAVTNINO EQU   IEDNSVTD+486
SAVTRSZE EQU   IEDNSVTD+484
SAVTRMAX EQU   IEDNSVTD+482
SAVTRENO EQU   IEDNSVTD+480
SAVTRINO EQU   IEDNSVTD+478
SAVTRMIN EQU   IEDNSVTD+476
SAVTPMID EQU   IEDNSVTD+474
SAVTRRTC EQU   IEDNSVTD+472
SAVTLUSG EQU   IEDNSVTD+468
SAVTACNQ EQU   IEDNSVTD+464
SAVTCM20 EQU   IEDNSVTD+460
SAVTCFDC EQU   IEDNSVTD+456
SAVTCMOT EQU   IEDNSVTD+452
SAVTCMIN EQU   IEDNSVTD+448
SAVTCPCH EQU   IEDNSVTD+444
SAVTCRGT EQU   IEDNSVTD+440
SAVTNALC EQU   IEDNSVTD+436
SAVTATCT EQU   IEDNSVTD+434
SAVTCRIU EQU   IEDNSVTD+432
SAVTCRHI EQU   IEDNSVTD+430
SAVTCRIB EQU   IEDNSVTD+428
SAVTLCQ  EQU   IEDNSVTD+424
SAVTDRSR EQU   IEDNSVTD+420
SAVTATPT EQU   IEDNSVTD+416
SAVTCSMI EQU   IEDNSVTD+412
SAVTNXCR EQU   IEDNSVTD+408
SAVTCRPT EQU   IEDNSVTD+404
SAVTCIPH EQU   IEDNSVTD+400
SAVTBTCO EQU   IEDNSVTD+396
SAVTBTCI EQU   IEDNSVTD+392
SAVTBPCO EQU   IEDNSVTD+388
SAVTBPCI EQU   IEDNSVTD+384
SAVTLLCB EQU   IEDNSVTD+380
SAVTSCF0 EQU   IEDNSVTD+376
SAVTLSNY EQU   IEDNSVTD+372
SAVTLSZP EQU   IEDNSVTD+368
SAVTOMSU EQU   IEDNSVTD+364
SAVTGTSB EQU   IEDNSVTD+360
SAVTHIBL EQU   IEDNSVTD+356
SAVTHISY EQU   IEDNSVTD+352
SAVTNAX2 EQU   IEDNSVTD+348
SAVTCDRU EQU   IEDNSVTD+344
SAVTPOLC EQU   IEDNSVTD+342
SAVTPOLM EQU   IEDNSVTD+340
SAVTPOLR EQU   IEDNSVTD+336
SAVTCDRN EQU   SAVTCDRV
SAVTPOLL EQU   IEDNSVTD+328
SAVTPOLN EQU   IEDNSVTD+326
@NM00105 EQU   IEDNSVTD+325
@NM00104 EQU   SAVTNETF
SAVTSDIS EQU   SAVTNETF
SAVTROUT EQU   SAVTNETF
SAVTNETW EQU   SAVTNETF
SAVTDIAL EQU   IEDNSVTD+320
SAVTRQUT EQU   IEDNSVTD+316
SAVTBITN EQU   IEDNSVTD+312
@NM00103 EQU   SAVTCKQB+8
@NM00102 EQU   SAVTCKEC+1
@NM00101 EQU   SAVTCKCC
SAVTCKPO EQU   SAVTCKCC
SAVTCKWA EQU   SAVTCKCC
SAVTCKCH EQU   SAVTCKTB+1
SAVTCKVT EQU   SAVTCKTB
@NM00100 EQU   IEDNSVTD+297
SAVTRDFG EQU   SAVTRDRV+12
@NM00099 EQU   SAVTRDRV+5
SAVTRDPY EQU   SAVTRDRV+4
SAVTRDQB EQU   SAVTRDRV+1
SAVTRDKY EQU   SAVTRDRV
SAVTNID  EQU   IEDNSVTD+280
SAVTDVAS EQU   IEDNSVTD+276
SAVTPLSZ EQU   IEDNSVTD+274
@NM00098 EQU   IEDNSVTD+273
SAVTSUBL EQU   IEDNSVTD+272
@NM00097 EQU   SAVTZELM+1
SAVTSUBM EQU   SAVTZELM
SAVTMHDX EQU   IEDNSVTD+268
SAVTNAT1 EQU   IEDNSVTD+266
SAVTSH20 EQU   IEDNSVTD+264
SAVTLCBS EQU   IEDNSVTD+260
SAVTRNMP EQU   IEDNSVTD+256
SAVTTNTX EQU   IEDNSVTD+252
SAVTNAX  EQU   IEDNSVTD+248
SAVTSUBV EQU   IEDNSVTD+247
SAVTSUBA EQU   IEDNSVTD+246
SAVTSIBC EQU   IEDNSVTD+244
SAVTBSM  EQU   IEDNSVTD+240
SAVTSCPT EQU   SAVTTCPU
SAVTRQTG EQU   IEDNSVTD+236
SAVTRQCH EQU   IEDNSVTD+232
SAVTMAND EQU   IEDNSVTD+228
SAVTSPLN EQU   IEDNSVTD+224
SAVTNADL EQU   IEDNSVTD+222
SAVTNATL EQU   IEDNSVTD+220
SAVTMHTB EQU   IEDNSVTD+216
SAVTSSMH EQU   IEDNSVTD+212
SAVTQRS  EQU   IEDNSVTD+208
SAVTRQIN EQU   IEDNSVTD+204
SAVTDFCO EQU   IEDNSVTD+200
SAVTSAO  EQU   IEDNSVTD+196
SAVTSARI EQU   IEDNSVTD+192
SAVTSAC  EQU   IEDNSVTD+188
SAVTSAI  EQU   IEDNSVTD+184
SAVTCSCI EQU   IEDNSVTD+180
SAVTSSRP EQU   IEDNSVTD+176
SAVTSSRQ EQU   IEDNSVTD+172
SAVTEP   EQU   SAVTSCLU
SAVTXTRQ EQU   IEDNSVTD+164
@NM00096 EQU   IEDNSVTD+148
SAVTIPCQ EQU   IEDNSVTD+144
@NM00095 EQU   IEDNSVTD+136
SAVTXFMI EQU   IEDNSVTD+132
@NM00094 EQU   IEDNSVTD+124
SAVTXFMO EQU   IEDNSVTD+120
@NM00093 EQU   IEDNSVTD+116
SAVTSSSR EQU   IEDNSVTD+112
SAVTSCPQ EQU   IEDNSVTD+108
SAVTSLCB EQU   IEDNSVTD+104
SAVTLUSR EQU   IEDNSVTD+100
@NM00092 EQU   SAVTLUSQ+8
SAVTLUSP EQU   SAVTLUSQ+4
SAVTLUSB EQU   SAVTLUSQ
@NM00091 EQU   IEDNSVTD+84
SAVTNAT  EQU   IEDNSVTD+76
SAVTCLUP EQU   IEDNSVTD+72
SAVTPIUT EQU   IEDNSVTD+68
SAVTRNTA EQU   IEDNSVTD+64
SAVTDNIR EQU   IEDNSVTD+60
SAVTCNIR EQU   IEDNSVTD+56
SAVTFLDH EQU   IEDNSVTD+52
SAVTSRTN EQU   IEDNSVTD+48
SAVTSREQ EQU   IEDNSVTD+44
SAVTFAIL EQU   IEDNSVTD+42
SAVTSUSE EQU   IEDNSVTD+40
SAVTSIB  EQU   IEDNSVTD+36
SAVTPRTN EQU   IEDNSVTD+32
@NM00090 EQU   IEDNSVTD+28
SAVTWH20 EQU   IEDNSVTD+26
SAVTPWT  EQU   IEDNSVTD+24
SAVTPRTQ EQU   IEDNSVTD+20
SAVTPREQ EQU   IEDNSVTD+16
SAVTPH20 EQU   IEDNSVTD+14
SAVTPUSE EQU   IEDNSVTD+12
SAVTPLCB EQU   IEDNSVTD+8
SAVTPOOL EQU   IEDNSVTD+4
SAVTPRMT EQU   SAVTDIAF
SAVTVIRT EQU   SAVTDIAF
AVTTVT   EQU   IEDQAVTD+1268
AVTSITS  EQU   IEDQAVTD+1264
AVTMSUHI EQU   IEDQAVTD+1260
AVTSITU  EQU   IEDQAVTD+1256
AVTSITP  EQU   IEDQAVTD+1252
AVTPADDR EQU   IEDQAVTD+1248
@NM00089 EQU   IEDQAVTD+1246
AVTCPBNO EQU   IEDQAVTD+1244
AVTHRESS EQU   IEDQAVTD+1243
@NM00088 EQU   IEDQAVTD+1242
@NM00087 EQU   IEDQAVTD+1241
@NM00086 EQU   IEDQAVTD+1240
@NM00085 EQU   IEDQAVTD+1237
@NM00084 EQU   IEDQAVTD+1236
AVTHRESE EQU   @NM00083
AVTRADDR EQU   IEDQAVTD+1228
AVTNADDR EQU   IEDQAVTD+1224
AVTHRESN EQU   IEDQAVTD+1220
AVTVOLRN EQU   IEDQAVTD+1216
AVTTOTNN EQU   IEDQAVTD+1212
AVTTRCYN EQU   IEDQAVTD+1208
AVTRCTRN EQU   IEDQAVTD+1204
AVTNOVON EQU   IEDQAVTD+1200
AVTADEBN EQU   IEDQAVTD+1196
AVTVOLRR EQU   IEDQAVTD+1192
AVTTOTNR EQU   IEDQAVTD+1188
AVTTRCYR EQU   IEDQAVTD+1184
AVTRCTRR EQU   IEDQAVTD+1180
AVTNOVOR EQU   IEDQAVTD+1176
AVTADEBR EQU   IEDQAVTD+1172
AVTLODPT EQU   IEDQAVTD+1168
AVTIOBN  EQU   IEDQAVTD+1164
AVTIOBR  EQU   IEDQAVTD+1160
AVTCPBPT EQU   IEDQAVTD+1156
AVTFCPB  EQU   IEDQAVTD+1152
@NM00082 EQU   IEDQAVTD+1148
AVTINCPQ EQU   IEDQAVTD+1144
@NM00081 EQU   IEDQAVTD+1140
@NM00080 EQU   IEDQAVTD+1137
@NM00079 EQU   AVTBIT4
@NM00078 EQU   AVTBIT4
@NM00077 EQU   AVTBIT4
@NM00076 EQU   AVTBIT4
@NM00075 EQU   AVTBIT4
@NM00074 EQU   AVTBIT4
@NM00073 EQU   AVTBIT4
AVTRUFTN EQU   AVTBIT4
@NM00072 EQU   IEDQAVTD+1132
AVTNOBFQ EQU   IEDQAVTD+1128
@NM00071 EQU   IEDQAVTD+1124
AVTDKENQ EQU   IEDQAVTD+1120
@NM00070 EQU   IEDQAVTD+1116
AVTDKAPQ EQU   IEDQAVTD+1112
AVTCOPY  EQU   IEDQAVTD+1108
AVTIA    EQU   IEDQAVTD+1104
AVTFL    EQU   IEDQAVTD+1100
@NM00069 EQU   IEDQAVTD+1096
AVTNCPBQ EQU   IEDQAVTD+1092
AVTTOTNC EQU   IEDQAVTD+1088
AVTCMAX  EQU   IEDQAVTD+1084
AVTCMIN  EQU   IEDQAVTD+1080
AVTHM02  EQU   IEDQAVTD+1076
AVTOPCIN EQU   IEDQAVTD+1074
AVTDCTLN EQU   IEDQAVTD+1072
AVTOPMSK EQU   IEDQAVTD+1068
AVTSTEAL EQU   IEDQAVTD+1060
AVTOPTN  EQU   IEDQAVTD+1056
AVTDSKCT EQU   IEDQAVTD+1054
AVTCKRST EQU   IEDQAVTD+1053
AVTSTAN  EQU   AVTBIT3
AVTSTACN EQU   AVTBIT3
AVTSTAIN EQU   AVTBIT3
AVTSTAYN EQU   AVTBIT3
AVTOLTBN EQU   AVTBIT3
AVTTSAB  EQU   AVTBIT3
AVTRFULN EQU   AVTBIT3
AVTRECVN EQU   AVTBIT3
@NM00068 EQU   AVTBIT2
@NM00067 EQU   AVTBIT2
AVTOPEIN EQU   AVTBIT2
AVTSTRTN EQU   AVTBIT2
AVTTOPOL EQU   AVTBIT2
AVTCOPYN EQU   AVTBIT2
AVTREUSN EQU   AVTBIT2
AVTEXTSC EQU   AVTBIT2
AVTDISKN EQU   AVTBIT1
AVTQUCKN EQU   AVTBIT1
AVTCLOSN EQU   AVTBIT1
AVTREADN EQU   AVTBIT1
AVTDLAYN EQU   AVTBIT1
AVTAQTAN EQU   AVTBIT1
AVTTSON  EQU   AVTBIT1
AVTAPLKN EQU   AVTBIT1
AVTDUMBR EQU   IEDQAVTD+1048
AVTDLQX  EQU   IEDQAVTD+1046
AVTINTLV EQU   IEDQAVTD+1044
AVTSMCNT EQU   IEDQAVTD+1042
AVTAVFCT EQU   IEDQAVTD+1040
AVTOPCON EQU   IEDQAVTD+1038
AVTOPCNT EQU   IEDQAVTD+1036
AVTLNCNT EQU   IEDQAVTD+1034
AVTHA16  EQU   IEDQAVTD+1030
AVTHA7   EQU   IEDQAVTD+1028
AVTHA4   EQU   IEDQAVTD+1026
AVTHA3   EQU   IEDQAVTD+1024
AVTHA2   EQU   IEDQAVTD+1022
AVTGETMS EQU   IEDQAVTD+1021
@NM00066 EQU   IEDQAVTD+1020
AVTGETMD EQU   IEDQAVTD+1016
AVTGETMN EQU   IEDQAVTD+1012
AVTCWTOT EQU   IEDQAVTD+1008
AVTCWINT EQU   IEDQAVTD+956
AVTDTRAP EQU   IEDQAVTD+952
@NM00065 EQU   IEDQAVTD+950
@NM00064 EQU   AVTIOTR
AVTIOTRH EQU   AVTIOTR
AVTIOTRE EQU   AVTIOTR
@NM00063 EQU   AVTSUBT
AVTSUBPT EQU   AVTSUBT
AVTSUBON EQU   AVTSUBT
AVTAFE30 EQU   IEDQAVTD+944
AVTAFE20 EQU   IEDQAVTD+940
AVTAFE10 EQU   IEDQAVTD+936
AVTCWEC2 EQU   IEDQAVTD+932
AVTCWPM2 EQU   IEDQAVTD+928
AVTCWTS2 EQU   IEDQAVTD+927
AVTCWTS1 EQU   IEDQAVTD+926
AVTCWCLD EQU   AVTCWFL2
AVTCWRAP EQU   AVTCWFL2
@NM00062 EQU   AVTCWFL2
@NM00061 EQU   AVTCWFL2
@NM00060 EQU   AVTCWFL2
@NM00059 EQU   AVTCWFL2
@NM00058 EQU   AVTCWFL2
AVTCWACT EQU   AVTCWFL2
@NM00057 EQU   AVTCWFL1
@NM00056 EQU   AVTCWFL1
@NM00055 EQU   AVTCWFL1
@NM00054 EQU   AVTCWFL1
@NM00053 EQU   AVTCWFL1
@NM00052 EQU   AVTCWFL1
@NM00051 EQU   AVTCWFL1
AVTCOMWN EQU   AVTCWFL1
AVTCWEC1 EQU   IEDQAVTD+920
AVTCWPM1 EQU   IEDQAVTD+916
AVTCAREA EQU   IEDQAVTD+912
AVTFZERO EQU   IEDQAVTD+908
AVTCADDR EQU   IEDQAVTD+904
AVTCOREC EQU   IEDQAVTD+900
@NM00050 EQU   IEDQAVTD+892
AVTCPBCB EQU   IEDQAVTD+888
@NM00049 EQU   IEDQAVTD+880
AVTDSIOB EQU   IEDQAVTD+876
@NM00048 EQU   IEDQAVTD+868
AVTCPRMB EQU   IEDQAVTD+864
@NM00047 EQU   IEDQAVTD+856
AVTCLOSB EQU   IEDQAVTD+852
@NM00046 EQU   IEDQAVTD+844
AVTACTIB EQU   IEDQAVTD+840
@NM00045 EQU   IEDQAVTD+836
AVTOLTEB EQU   IEDQAVTD+832
AVTOLTCH EQU   AVTOLTQB+1
AVTOLTVT EQU   AVTOLTQB
@NM00044 EQU   AVTOPCQB+8
@NM00043 EQU   AVTOPCEC+1
@NM00042 EQU   AVTOPCCC
AVTOPCPO EQU   AVTOPCCC
AVTOPCWA EQU   AVTOPCCC
AVTOPCCH EQU   AVTOPCOB+1
AVTOPCVT EQU   AVTOPCOB
@NM00041 EQU   AVTCKPQB+9
AVTCKPTS EQU   AVTCKPQB+8
@NM00040 EQU   AVTCKPEC+1
@NM00039 EQU   AVTCKPCC
AVTCKPPO EQU   AVTCKPCC
AVTCKPWA EQU   AVTCKPCC
AVTCKPCH EQU   AVTCKPTB+1
AVTCKPVT EQU   AVTCKPTB
@NM00038 EQU   IEDQAVTD+796
AVTBFRTB EQU   IEDQAVTD+792
@NM00037 EQU   IEDQAVTD+788
AVTSELCH EQU   IEDQAVTD+785
AVTBFRTN EQU   AVTBFRFG
AVTBFREB EQU   IEDQAVTD+780
AVTTIMQ  EQU   IEDQAVTD+776
@NM00036 EQU   IEDQAVTD+772
AVTIMQPS EQU   IEDQAVTD+768
AVTINOUT EQU   IEDQAVTD+766
AVTREFTM EQU   IEDQAVTD+764
@NM00035 EQU   IEDQAVTD+752
AVTDELYB EQU   IEDQAVTD+748
AVTOCQPT EQU   IEDQAVTD+744
AVTTSOPT EQU   IEDQAVTD+740
AVTSUPPT EQU   IEDQAVTD+736
AVTCBQCB EQU   IEDQAVTD+732
AVTMSGS  EQU   IEDQAVTD+729
@NM00034 EQU   AVTSYSER
@NM00033 EQU   AVTSYSER
@NM00032 EQU   AVTSYSER
@NM00031 EQU   AVTSYSER
@NM00030 EQU   AVTSYSER
@NM00029 EQU   AVTSYSER
AVTCMAXN EQU   AVTSYSER
AVTCMINN EQU   AVTSYSER
AVT2260L EQU   IEDQAVTD+724
AVTABEPL EQU   AVTADBUF
AVTHFF   EQU   AVTCLRHI+2
@NM00028 EQU   AVTCLRHI
AVTCCLNK EQU   AVTCRELE+5
AVTCCPRI EQU   AVTCRELE+4
AVTCCQCB EQU   AVTCCELE+1
AVTCCKEY EQU   AVTCCELE
AVTDELAD EQU   IEDQAVTD+704
AVTDELEM EQU   IEDQAVTD+700
AVTBSX   EQU   AVTCKLNK
AVTOPETR EQU   AVTHG01
@NM00027 EQU   AVTCKBYT
AVTCKONQ EQU   AVTCKBYT
@NM00026 EQU   AVTCKBYT
@NM00025 EQU   AVTCKBYT
@NM00024 EQU   AVTCKBYT
@NM00023 EQU   AVTCKBYT
@NM00022 EQU   AVTCKBYT
@NM00021 EQU   AVTCKBYT
AVTOPERT EQU   IEDQAVTD+690
AVTOPXCL EQU   IEDQAVTD+688
AVTOPERL EQU   IEDQAVTD+687
@NM00020 EQU   IEDQAVTD+686
AVTCKTIM EQU   IEDQAVTD+684
AVTCKELV EQU   IEDQAVTD+682
AVTCPRCD EQU   IEDQAVTD+681
AVTWARMN EQU   AVTCKELF
AVTCRTLN EQU   AVTCKELF
AVTCPIPN EQU   AVTCKELF
AVTCCLCN EQU   AVTCKELF
AVTCINCN EQU   AVTCKELF
@NM00019 EQU   AVTCKELF
AVTCMCPN EQU   AVTCKELF
AVTNQBCK EQU   AVTCKELF
AVTCKQAD EQU   IEDQAVTD+677
AVTSCBSZ EQU   IEDQAVTD+676
@NM00018 EQU   IEDQAVTD+672
AVTCKELE EQU   IEDQAVTD+668
@NM00017 EQU   AVTCKPEL+8
AVTCKRLK EQU   AVTCKPEL+5
AVTCKRPR EQU   AVTCKPEL+4
AVTCKRMQ EQU   AVTCKRMV+1
AVTCKRKY EQU   AVTCKRMV
AVTHK    EQU   IEDQAVTD+648
AVTHI    EQU   IEDQAVTD+644
AVTIOT   EQU   IEDQAVTD+640
AVTNX    EQU   IEDQAVTD+636
AVTTONE  EQU   IEDQAVTD+632
AVTA3TL  EQU   IEDQAVTD+628
AVTDMECB EQU   IEDQAVTD+624
AVTABEND EQU   IEDQAVTD+618
AVTPLCBN EQU   IEDQAVTD+616
@NM00016 EQU   AVTSAVTP+1
@NM00015 EQU   AVTSAVTF
AVTRAPI  EQU   AVTSAVTF
AVTLCLST EQU   AVTSAVTF
AVT370X  EQU   AVTSAVTF
AVTSNA   EQU   AVTSAVTF
AVTONSNA EQU   AVTSAVTF
AVTVTMCP EQU   AVTSAVTF
AVTTRNOS EQU   IEDQAVTD+608
AVTCMBSS EQU   IEDQAVTD+604
AVTRCV   EQU   IEDQAVTD+600
AVTSEND  EQU   IEDQAVTD+596
AVTCSCH  EQU   IEDQAVTD+592
AVTQ1    EQU   IEDQAVTD+588
AVTE7    EQU   IEDQAVTD+584
AVTHB    EQU   IEDQAVTD+580
AVTR1    EQU   IEDQAVTD+576
AVTBZ    EQU   IEDQAVTD+572
AVTEZ    EQU   IEDQAVTD+568
AVTEC    EQU   IEDQAVTD+564
AVTEW    EQU   IEDQAVTD+560
AVTNDIAL EQU   AVTSCOPT
AVTN2741 EQU   AVTSCOPT
AVTCONCO EQU   AVTSCOPT
AVTCONC  EQU   AVTSCOPT
AVTCMBUF EQU   AVTSCOPT
AVTAPDMP EQU   AVTSCOPT
@NM00014 EQU   AVTSCOPT
AVTHA    EQU   AVTDISP
AVTEA    EQU   IEDQAVTD+548
AVTAX    EQU   IEDQAVTD+544
AVTA3    EQU   IEDQAVTD+540
AVTGD    EQU   IEDQAVTD+536
AVTAL    EQU   IEDQAVTD+532
AVTOLTST EQU   AVTHG02
AVTE8    EQU   IEDQAVTD+524
AVTUI    EQU   IEDQAVTD+520
AVTCOMPT EQU   IEDQAVTD+516
AVTCRSRF EQU   IEDQAVTD+512
@NM00013 EQU   IEDQAVTD+508
AVTKA02  EQU   IEDQAVTD+504
AVTOPTPT EQU   IEDQAVTD+500
AVTPCBPT EQU   IEDQAVTD+496
AVTECBAD EQU   IEDQAVTD+492
AVTOPECA EQU   IEDQAVTD+488
AVTOLECA EQU   IEDQAVTD+484
AVTCKECA EQU   IEDQAVTD+480
AVTCWECA EQU   IEDQAVTD+476
AVTCWTCB EQU   IEDQAVTD+472
AVTOLTCB EQU   IEDQAVTD+468
AVTOCTCB EQU   IEDQAVTD+464
AVTCKTCB EQU   IEDQAVTD+460
AVTAS    EQU   IEDQAVTD+456
AVTNCKPR EQU   IEDQAVTD+453
AVTCIB   EQU   IEDQAVTD+452
AVTSPLPT EQU   IEDQAVTD+448
AVTMVBFR EQU   IEDQAVTD+444
AVTSBTA  EQU   IEDQAVTD+440
AVTRARTN EQU   IEDQAVTD+436
AVTBSCAN EQU   IEDQAVTD+432
AVTRDYA  EQU   IEDQAVTD+428
AVTDISTR EQU   IEDQAVTD+420
AVTPARM3 EQU   IEDQAVTD+416
@NM00012 EQU   AVTPKF
@NM00011 EQU   AVTPKF
@NM00010 EQU   AVTPKF
AVTFTCHF EQU   AVTPKF
@NM00009 EQU   AVTPKF
@NM00008 EQU   AVTPKF
@NM00007 EQU   AVTPKF
@NM00006 EQU   AVTPKF
AVTPARM  EQU   IEDQAVTD+408
AVTEXS2A EQU   IEDQAVTD+402
AVTEXA2S EQU   IEDQAVTD+396
AVTOCGET EQU   IEDQAVTD+392
AVTCKAVT EQU   @NM00004+1
@NM00005 EQU   AVTCKFLG
AVTCKHLT EQU   AVTCKFLG
AVTCKREQ EQU   AVTCKFLG
AVTCKENV EQU   AVTCKFLG
AVTCKNAC EQU   AVTCKFLG
AVTCKTAC EQU   AVTCKFLG
AVTBUENT EQU   IEDQAVTD+386
@NM00003 EQU   IEDQAVTD+385
AVTFULLT EQU   AVTBUFSW
AVTUNCON EQU   AVTBUFSW
AVTTRAPI EQU   AVTBUFSW
@NM00002 EQU   AVTBUFSW
AVTBUFTR EQU   AVTREADD
AVTREADY EQU   IEDQAVTD+376
AVTRACE  EQU   IEDQAVTD+372
AVTTCB   EQU   IEDQAVTD+368
AVTPASWD EQU   IEDQAVTD+360
AVTCTLCH EQU   IEDQAVTD+352
AVTDOUBL EQU   IEDQAVTD+344
AVTDOUBX EQU   IEDQAVTD+336
AVTDPARM EQU   IEDQAVTD+332
AVTCSTCS EQU   IEDQAVTD+328
AVTDLQ   EQU   AVTSAVEX+32
@NM00001 EQU   AVTSAVEX
AVTSAVE4 EQU   IEDQAVTD+216
AVTSAVE3 EQU   IEDQAVTD+144
AVTSAVE2 EQU   IEDQAVTD+72
AVTSAVE1 EQU   IEDQAVTD
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS
@RC00679 EQU   @RC00644
@RC00763 EQU   @RC00762
@RC00797 EQU   @RC00796
@RC00814 EQU   @RC00810
@RC00902 EQU   @RC00897
@RC00683 EQU   @RC00679
@RC00681 EQU   @RC00679
@RC00815 EQU   @RC00814
@RC00689 EQU   @RC00683
@RT00820 EQU   @RC00815
@ENDDATA EQU   *
         END   IGCFQ10D
