//*
//*THE CATALOG CANNOT BE OPENED UNLESS A STEPCAT IS GIVEN AND
//*AN 013 ABEND WILL RESULT IF THE DCB INFORMATION IS NOT
//*SPECIFIED ON THE OUTFILE DD STATEMENT.
//*THE PROGRAM WILL ABEND WITH 0CX IF THE CATALOG CANNOT BE
//*OPENED.  CHECK THE ACCOMPANYING VSAM ERROR MESSAGES.
//*
//S1     EXEC PGM=ICFDUMP
//STEPLIB  DD DSN=AUTH.PGM.LIB,DISP=SHR
//STEPCAT  DD DSN=YOUR.ICF.CATALOG,DISP=SHR
//VSAMDD   DD DSN=YOUR.ICF.CATALOG,DISP=SHR
//OUTFILE  DD DSN=&&TEMP,UNIT=SYSDA,SPACE=(CYL,(1,1)),DISP=(,PASS),
//            DCB=(RECFM=VBS,LRECL=32760,BLKSIZE=6233)
//*
//S2     EXEC SAS
//ICFCAT   DD DSN=&&B,DISP=OLD
//SYSIN    DD DSN=YOUR.SOURCE.LIB(ICFLIST),DISP=SHR
