         TITLE 'IGCVG10D, STOPLINE FOR 3705 LINES                      *
                        '
IGCVG10D CSECT ,                                                01S0001
@PROLOG  DS    0H                                               01S0002
         USING *,RBASE                 ESTABLISH A BASE REG
         LR    RBASE,REG15             SETUP BASE REG
IGCVG10D IEDHJN AFTERHJN,HJN           MODULE IDENTIFICATION MACRO
*   ROPCAVT=RPARM;                  /* SET THE BASE POINTER FOR THE
*                                      OP CONTROL AVT                */
         LR    ROPCAVT,RPARM                                    03S0286
*   RSAVE=ADDR(OPCSAVE);            /* SET THE SAVE AREA ADDRESS REG
*                                      WITH THE ADDRESS OF THE OP
*                                      CONTROL SAVE AREA             */
         LA    RSAVE,OPCSAVE(,ROPCAVT)                          03S0287
*   RAVT=OPCAVTPT;                  /* SET THE BASE POINTER FOR THE
*                                      TCAM ADDRESS VECTOR TABLE     */
         L     RAVT,OPCAVTPT(,ROPCAVT)                          03S0288
*   ROPCE=OPCCOPCE;                 /* SET THE BASE POINTER FOR THE
*                                      OPERATOR CONTROL ELEMENT      */
         L     ROPCE,OPCCOPCE(,ROPCAVT)                         03S0289
*   RPARM=OCTRMTBL;                 /* SET TO GET TTE ADDR   @YM08560*/
         LH    RPARM,OCTRMTBL(,ROPCE)                           03S0290
         N     RPARM,@CF01685                                   03S0290
*   CALL IEDQTNT;                   /* GET TTE ADDRESS       @YM08560*/
         L     @15,AVTRNMPT(,RAVT)                              03S0291
         BALR  @14,@15                                          03S0291
*   RTRM=RPARM-LENGTH(IEDNTRM);     /* SET UP LINE TTE ADDRESS  03S0292
*                                                            @YM08560*/
         LR    RTRM,RPARM                                       03S0292
         SL    RTRM,@CF00035                                    03S0292
*   OPCFLAG1=ZERO;                  /* CLEAR CONTROL SWITCHES        */
         MVI   OPCFLAG1(ROPCAVT),X'00'                          03S0293
*                                                               03S0294
*   /*****************************************************************/
*   /*                                                               */
*   /* PROCESS.RENTRY: TO RE-INTIALIZE IF SECOND ENTRY.              */
*   /*                                                               */
*   /*****************************************************************/
*                                                               03S0294
*   IF OCRENTRD=ON THEN             /* SECOND ENTRY?                 */
         TM    OCRENTRD(ROPCE),B'10000000'                      03S0294
         BNO   @RF00294                                         03S0294
*     DO;                           /* YES                           */
*       RZERO=ADDR(OPCWAITV);       /* INTIALIZE FOR SCAN            */
         LA    RZERO,OPCWAITV(,ROPCAVT)                         03S0296
*       RPARM=OPCWAITV;             /* GET THE FIRST ELEM ON QUE     */
         L     RPARM,OPCWAITV(,ROPCAVT)                         03S0297
*       DO WHILE ROPCE^=RPARM;                                  03S0298
         B     @DE00298                                         03S0298
@DL00298 DS    0H                                               03S0299
*         RZERO=RPARM;              /* LAST OPCE NOT A MATCH         */
         LR    RZERO,RPARM                                      03S0299
*         RPARM=RPARM->OCLINK;      /* GET NEXT TO MATCH             */
         L     RPARM,OCLINK(,RPARM)                             03S0300
*       END;                                                    03S0301
@DE00298 CR    ROPCE,RPARM                                      03S0301
         BNE   @DL00298                                         03S0301
*       RZERO->OCLINK=RPARM->OCLINK;/* DELINK FROM THE CHAIN         */
         L     @14,OCLINK(,RPARM)                               03S0302
         LR    @09,RZERO                                        03S0302
         ST    @14,OCLINK(,@09)                                 03S0302
*       OCLINK=''B;                                             03S0303
         SLR   @14,@14                                          03S0303
         ST    @14,OCLINK(,ROPCE)                               03S0303
*       OCRENTRD=OFF;               /* RESET SWITCH                  */
         NI    OCRENTRD(ROPCE),B'01111111'                      03S0304
*     END;                                                      03S0305
*   ELSE                                                        03S0306
*     ;                             /* FIRST TIME IN GO AHEAD AND
*                                      PROCESS                       */
@RF00294 DS    0H                                               03S0307
*   IF ERRFLG=OFF THEN                                          02S0307
         TM    ERRFLG(ROPCAVT),B'10000000'                      02S0307
         BNZ   @RF00307                                         02S0307
*     DO;                           /* IF NO TOTE ERRORS, CONTINUE   */
*                                                               03S0309
*       /*************************************************************/
*       /*                                                           */
*       /* PROCESS.SRCECHK: IF NOT A CONSOLE OR TOTE REQUEST, CHECK  */
*       /* TO SEE IF SOURCE TERMINAL IS ON LINE BEING STOPPED        */
*       /*                                                           */
*       /*************************************************************/
*                                                               03S0309
*       IF OCCONSOL=OFF&OCTOTE=OFF THEN                         03S0309
         TM    OCCONSOL(ROPCE),B'11000000'                      03S0309
         BNZ   @RF00309                                         03S0309
*         DO;                       /* IF THIS IS NOT A CONSOLE OR
*                                      TOTE REQUEST CONTINUE VALIDITY
*                                      CHECK                         */
*           RPARM=OCDEST;           /* GET TTCIN OF SOURCE TERMINAL  */
         LH    RPARM,OCDEST(,ROPCE)                             03S0311
         N     RPARM,@CF01685                                   03S0311
*           IF RPARM^=ZERO THEN                                 03S0312
         LTR   RPARM,RPARM                                      03S0312
         BZ    @RF00312                                         03S0312
*             DO;                   /* IF THIS IS A VALID       03S0313
*                                      DESTINATION, CONTINUE VALIDITY
*                                      CHECKING                      */
*               CALL IPCHEK;        /* CHECK OUT SOURCE TERMINAL     */
         BAL   @14,IPCHEK                                       03S0314
*               IF ERRFLG=ON THEN                               03S0315
         TM    ERRFLG(ROPCAVT),B'10000000'                      03S0315
         BNO   @RF00315                                         03S0315
*                 DO;               /* IF AN ERROR HAS OCCURRED,
*                                      PROCESS ERROR                 */
*                   RPARM=FOUR;     /* SETUP ERROR RETURN CODE       */
         LA    RPARM,4                                          03S0317
*                   RZERO=MSG13;    /* SETUP MSG ID                  */
         LA    RZERO,13                                         03S0318
*                 END;                                          03S0319
*             END;                                              03S0320
@RF00315 DS    0H                                               03S0321
*         END;                                                  03S0321
@RF00312 DS    0H                                               03S0322
*       IF ERRFLG=OFF THEN                                      02S0322
@RF00309 TM    ERRFLG(ROPCAVT),B'10000000'                      02S0322
         BNZ   @RF00322                                         02S0322
*         DO;                       /* IF NO ERRORS ON SOURCE   02S0323
*                                      TERMINALS, CONTINUE CHECK
*                                      PRIMARY OP CONTROL TERMINAL   */
*                                                               03S0324
*           /*********************************************************/
*           /*                                                       */
*           /* PROCESS.PRIMCHK: VERFIFY THAT THE PRIMARY OP CONTROL  */
*           /* TERM IS NOT ATTACHED IS NOT ATTACHED TO THE LINE BEING*/
*           /* STOPPED                                               */
*           /*                                                       */
*           /*********************************************************/
*                                                               03S0324
*           RPARM=AVTOPCIN;         /* GET TTCIN OF PRIMARY OP  03S0324
*                                      CONTROL TERMINAL      @YM06161*/
         LH    RPARM,AVTOPCIN(,RAVT)                            03S0324
         N     RPARM,@CF01685                                   03S0324
*           IF RPARM^=ZERO THEN                                 03S0325
         LTR   RPARM,RPARM                                      03S0325
         BZ    @RF00325                                         03S0325
*             DO;                   /* IF THERE IS A TTCIN, CONTINUE
*                                      CHECKING TERMINAL             */
*               CALL IPCHEK;        /* CHECK OUT PRIMARY OP CONTROL
*                                      TERMINAL                      */
         BAL   @14,IPCHEK                                       03S0327
*               IF ERRFLG=ON THEN                               03S0328
         TM    ERRFLG(ROPCAVT),B'10000000'                      03S0328
         BNO   @RF00328                                         03S0328
*                 DO;               /* IF ERROR HAS OCCURRED THEN
*                                      PROCESS ERROR                 */
*                   RPARM=FOUR;     /* SETUP ERROR RETURN CODE       */
         LA    RPARM,4                                          03S0330
*                   RZERO=MSG542;   /* SETUP MSG NUMBER              */
         LA    RZERO,542                                        03S0331
*                 END;                                          03S0332
*             END;                                              03S0333
@RF00328 DS    0H                                               03S0334
*         END;                                                  02S0334
@RF00325 DS    0H                                               02S0335
*     END;                                                      02S0335
@RF00322 DS    0H                                               02S0336
*   IF ERRFLG=OFF THEN                                          02S0336
@RF00307 TM    ERRFLG(ROPCAVT),B'10000000'                      02S0336
         BNZ   @RF00336                                         02S0336
*     DO;                           /* NO ERRORS OCCURRED    @YM08560*/
*                                                               03S0338
*       /*************************************************************/
*       /*                                                           */
*       /* PROCESS.TOTECHK: MAKE TOTE CHECKS FOR LINE                */
*       /*                                                           */
*       /*************************************************************/
*                                                               03S0338
*       IF OCTOTE=OFF THEN          /* IF CMD NOT ISSUED BY TOTE
*                                                            @ZM46755*/
         TM    OCTOTE(ROPCE),B'01000000'                        03S0338
         BNZ   @RF00338                                         03S0338
*         DO;                       /* CHECK IF TOTE CONTROLS LINE OR
*                                      SUBORDINATE RESOURCES @ZM46744*/
*           IF OCRLN^=0&TRMSTOTE=ON THEN                        03S0340
         CLI   OCRLN(ROPCE),0                                   03S0340
         BE    @RF00340                                         03S0340
         TM    TRMSTOTE(RTRM),B'00000001'                       03S0340
         BNO   @RF00340                                         03S0340
*             DO;                   /* TOTE CONTROL LINE     @YM08560*/
*               RPARM=FOUR;         /* SETUP ERROR RETURN CODE       */
         LA    RPARM,4                                          03S0342
*               RZERO=MSG49;        /* SETUP ERROR MSG ID            */
         LA    RZERO,49                                         03S0343
*               IF AVTOLTCB=ZERO THEN                           03S0344
         L     @14,AVTOLTCB(,RAVT)                              03S0344
         LTR   @14,@14                                          03S0344
         BNZ   @RF00344                                         03S0344
*                 ERRFLG=ON;        /* IF TOTE ISN'T ACTIVE THEN SET
*                                      ERROR FLAG                    */
         OI    ERRFLG(ROPCAVT),B'10000000'                      03S0345
*             END;                                              03S0346
*           ELSE                    /* CHECK FOR TOTE OWNED     03S0347
*                                      SUBORDINATE RESOURCE          */
*             DO;                   /* BEFORE CONTINUING THE STOPLINE*/
         B     @RC00340                                         03S0347
@RF00340 DS    0H                                               03S0348
*               OCPARM=OCTRMTBL;    /* SAVE ORIGINAL TTCIN   @YM08560*/
         LH    @14,OCTRMTBL(,ROPCE)                             03S0348
         N     @14,@CF01685                                     03S0348
         STH   @14,OCPARM(,ROPCE)                               03S0348
*               DO UNTIL TRMTYPE=TRMGRP×OCRLN^=ZERO;/* FIND GROUP OF
*                                      FIRST LINE            @YM08560*/
@DL00349 DS    0H                                               03S0350
*                 RPARM=IGCVG;      /* ID TO RETURN TO AFTER TOTE
*                                      COMPLETES                     */
         L     RPARM,@CF01671                                   03S0350
*                 CALL CHCKTOTE;    /* VERIFY BEFORE CONTINUING      */
         L     @15,OPCTOTCK(,ROPCAVT)                           03S0351
         BALR  @14,@15                                          03S0351
*                 IF RZERO=SUSPEND THEN/* TOTE OWNERSHIP?            */
         C     RZERO,@CF00060                                   03S0352
         BNE   @RF00352                                         03S0352
*                   DO;             /* YES                           */
*                     OCRENTRD=ON;  /* SET RENTRY FLAG               */
         OI    OCRENTRD(ROPCE),B'10000000'                      03S0354
*                     OCLINK=OPCWAITV;/* LINK TOP ELEM TO OPCE       */
         L     @14,OPCWAITV(,ROPCAVT)                           03S0355
         ST    @14,OCLINK(,ROPCE)                               03S0355
*                     OPCWAITV=ROPCE;/* PUT OPCE ON WAIT CHAIN       */
         ST    ROPCE,OPCWAITV(,ROPCAVT)                         03S0356
*                     OPCMODID=IGC00;/* GIVE CONTROL TO 00           */
         MVC   OPCMODID(2,ROPCAVT),@CC01673                     03S0357
*                   END;                                        03S0358
*                 ELSE                                          03S0359
*                   ;               /* NO TOTE OWNERSHIP CONTINUE    */
@RF00352 DS    0H                                               03S0360
*                 RPARM=TRMCOHTG;   /* GET COHORTG           @YM08560*/
         LH    @14,TRMCOHTG(,RTRM)                              03S0360
         N     @14,@CF01685                                     03S0360
         LR    RPARM,@14                                        03S0360
*                 OCTRMTBL=TRMCOHTG;/* SET OCTRMTBL          @YM08560*/
         STH   @14,OCTRMTBL(,ROPCE)                             03S0361
*                 CALL IEDQTNT;     /* GET TTE ADDRESS       @YM08560*/
         L     @15,AVTRNMPT(,RAVT)                              03S0362
         BALR  @14,@15                                          03S0362
*                 RTRM=RPARM-LENGTH(IEDNTRM);/* SET UP TERM     03S0363
*                                      ADDRESSIBILTY         @YM08560*/
         LR    RTRM,RPARM                                       03S0363
         SL    RTRM,@CF00035                                    03S0363
*               END;                                            03S0364
@DE00349 CLI   TRMTYPE(RTRM),X'00'                              03S0364
         BE    @DC00349                                         03S0364
         CLI   OCRLN(ROPCE),0                                   03S0364
         BE    @DL00349                                         03S0364
@DC00349 DS    0H                                               03S0365
*               OCTRMTBL=OCPARM;    /* RESTORE OCTRMTBL      @YM08560*/
         LH    @14,OCPARM(,ROPCE)                               03S0365
         STH   @14,OCTRMTBL(,ROPCE)                             03S0365
*               OCPARM=ZERO;        /* CLEAR OCPARM          @YM08560*/
         SLR   @14,@14                                          03S0366
         STH   @14,OCPARM(,ROPCE)                               03S0366
*               RZERO=''B;          /* CLEAR REG 0 FOR IGC0010D 03S0367
*                                                            @YM08560*/
         SLR   RZERO,RZERO                                      03S0367
*             END;                                              03S0368
*         END;                      /*                       @ZM46755*/
*       ELSE                                                    03S0370
*         ;                         /*                       @ZM46755*/
@RF00338 DS    0H                                               03S0371
*     END;                          /*                       @YM08560*/
@RC00338 DS    0H                                               02S0372
*   IF ERRFLG=ON THEN                                           02S0372
@RF00336 TM    ERRFLG(ROPCAVT),B'10000000'                      02S0372
         BNO   @RF00372                                         02S0372
*     DO;                           /* IF ANY ERRORS HAVE OCCURRED,
*                                      DO ERROR PROCESSING           */
*                                                               03S0374
*       /*************************************************************/
*       /*                                                           */
*       /* PROCESS.ERRPROC: THIS SEGMENT PERFORMS FINAL ERROR        */
*       /* PROCESSING                                                */
*       /*                                                           */
*       /*************************************************************/
*                                                               03S0374
*       EXITFLG=ON;                 /* INDICATE EXIT                 */
         OI    EXITFLG(ROPCAVT),B'01000000'                     03S0374
*       IF OCTOTE=ON THEN                                       03S0375
         TM    OCTOTE(ROPCE),B'01000000'                        03S0375
         BNO   @RF00375                                         03S0375
*         DO;                       /* IF THIS IS A TOTE REQUEST,    */
*           RZERO=RPARM;            /* SETUP ERR RETURN CODE         */
         LR    RZERO,RPARM                                      03S0377
*           OPCMODID=MOD07;         /* SETUP EXIT MODULE             */
         MVC   OPCMODID(2,ROPCAVT),MOD07                        03S0378
*         END;                                                  03S0379
*       ELSE                                                    03S0380
*         DO;                       /* IF NOT TOTE REQUEST           */
         B     @RC00375                                         03S0380
@RF00375 DS    0H                                               03S0381
*           OCUNIT=INVALTIC;        /* INDICATE INVALID TIC          */
         MVC   OCUNIT(4,ROPCE),@CF01658                         03S0381
*           OPCMODID=MOD03;         /* SETUP EXIT MODULE             */
         MVC   OPCMODID(2,ROPCAVT),MOD03                        03S0382
*         END;                                                  03S0383
*     END;                                                      02S0384
@RC00375 DS    0H                                               02S0385
*   IF EXITFLG=OFF THEN                                         02S0385
@RF00372 TM    EXITFLG(ROPCAVT),B'01000000'                     02S0385
         BNZ   @RF00385                                         02S0385
*     DO;                           /* MORE PROCESSING LEFT?         */
*                                                               03S0387
*       /*************************************************************/
*       /*                                                           */
*       /* PROCESS.EXITPROC: THIS SEGMENT PERFORMS FINAL PROCESSING  */
*       /*                                                           */
*       /*************************************************************/
*                                                               03S0387
*       OPCMODID=MODV8;             /* SETUP EXIT MODULE             */
         MVC   OPCMODID(2,ROPCAVT),MODV8                        03S0387
*       OCPARM=ZERO;                /* RESET RETURN CODE             */
         SLR   @14,@14                                          03S0388
         STH   @14,OCPARM(,ROPCE)                               03S0388
*       OCRESP=OFF;                 /* SETUP REST OF INTERFACE TO
*                                      IGCV810D                      */
         NI    OCRESP(ROPCE),B'11111110'                        03S0389
*       OCALSTAT=ZERO;                                          03S0390
         MVI   OCALSTAT(ROPCE),X'00'                            03S0390
*       IF OCRLN=ZERO THEN                                      03S0391
         CLI   OCRLN(ROPCE),0                                   03S0391
         BNE   @RF00391                                         03S0391
*         OCALLFLG=ON;              /* IF THIS IS A STOPLINE,ALL
*                                      REQUEST THEN INDICATE IN OPCE */
         OI    OCALLFLG(ROPCE),B'00000100'                      03S0392
*     END;                                                      02S0393
@RF00391 DS    0H                                               02S0394
*                                                               02S0394
*   /*****************************************************************/
*   /*                                                               */
*   /* EPILOGUE: THIS SEGMENT COMPLETES THE EPILOGUE CODE THAT WAS   */
*   /* ALTERED BY THE MODULE PROCEDURE STATEMENT. THE XCTL ASSEMBLER */
*   /* MACRO INSTRUCTION IS USED BY THIS SEGMENT TO TRANSFER CONTROL */
*   /* TO THE NEXT MODULE THAT IS TO BE EXECUTED.                    */
*   /*                                                               */
*   /*****************************************************************/
*                                                               02S0394
*   OPCFLAG1=ZERO;                  /* CLEAR FLAG FIELD              */
@RF00385 MVI   OPCFLAG1(ROPCAVT),X'00'                          02S0394
*   RPARM=ROPCAVT;                  /* SET THE ARGUMENT REGISTER IN
*                                      PREPARATION TO TRANSFERRING
*                                      CONTROL TO THE NEXT MODULE    */
         LR    RPARM,ROPCAVT                                    02S0395
*   GEN EXIT REFS(OPCXCTL,ROPCAVT) NOSEQFLOW SETS(REG15);       02S0396
*                                   /*
         XCTL  SF=(E,OPCXCTL(ROPCAVT)) TRANSFER CONTROL MACRO
*                                                               02S0397
*   /*****************************************************************/
*   /*                                                               */
*   /* IPCHEK: THIS INTERNAL PROCEDURE ASSURES THAT THE SOURCE       */
*   /* TERMINAL AND THE PRIMARY OP CONTROL TERMINAL ARE NOT ON THE   */
*   /* SAME LINE AS THE LINE TO BE STOPPED.                          */
*   /*                                                               */
*   /*****************************************************************/
*                                                               02S0397
*IPCHEK:                                                        02S0397
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                            02S0397
IPCHEK   DS    0H                                               02S0398
*   RFY                                                         02S0398
*    (RQCB,                                                     02S0398
*     REG14) RSTD;                                              02S0398
*   OPCWRKSP(1)=REG14;              /* SAVE RETURN REG               */
         ST    REG14,OPCWRKSP(,ROPCAVT)                         02S0399
*   CALL IEDQTNT;                   /* FIND TTE ADDRESS              */
         L     @15,AVTRNMPT(,RAVT)                              02S0400
         BALR  @14,@15                                          02S0400
*   RTRM=RPARM-LENGTH(IEDNTRM);     /* SETUP TERM BASE               */
         LR    RTRM,RPARM                                       02S0401
         SL    RTRM,@CF00035                                    02S0401
*   IF TRMPREF=ON THEN                                          02S0402
         TM    TRMPREF(RTRM),B'00010000'                        02S0402
         BNO   @RF00402                                         02S0402
*     DO;                           /* IF THIS IS A 3705 RESOURCE,
*                                      CONTINUE CHECKING             */
*       DO UNTIL(RZERO=ZERO×TRMLINE=ON);/* IF RESOURCE IN HIERARCHY
*                                      FIND LINE ASSOCIATED WITH IT  */
@DL00404 DS    0H                                               02S0405
*         CALL COHORTLK;            /* FIND NXT HIGHER RESOURCE      */
         L     @15,OPCHORT(,ROPCAVT)                            02S0405
         BALR  @14,@15                                          02S0405
*         RTRM=RPARM-LENGTH(IEDNTRM);/* SETUP TERM BASE              */
         LR    RTRM,RPARM                                       02S0406
         SL    RTRM,@CF00035                                    02S0406
*       END;                                                    02S0407
@DE00404 LTR   RZERO,RZERO                                      02S0407
         BZ    @DC00404                                         02S0407
         TM    TRMLINE(RTRM),B'10000000'                        02S0407
         BNO   @DL00404                                         02S0407
@DC00404 DS    0H                                               02S0408
*       IF RZERO^=ZERO THEN                                     02S0408
         LTR   RZERO,RZERO                                      02S0408
         BZ    @RF00408                                         02S0408
*         DO;                       /* IF RESOURCE IS IN THE    02S0409
*                                      HIERARCHY THEN CHECK IT       */
*           RQCB=TRMDESTQ;          /* GET QCB ADDRESS OF SOURCE     */
         L     RQCB,TRMDESTQ-1(,RTRM)                           02S0410
         LA    RQCB,0(,RQCB)                                    02S0410
*           IF QCBLGBAD=LGBADDR THEN                            02S0411
         CLC   QCBLGBAD(3,RQCB),LGBADDR+40(ROPCE)               02S0411
         BNE   @RF00411                                         02S0411
*             DO;                   /* IF GROUP OF INPUT TTCIN IS
*                                      SAME AS GROUP BEING STOPPED
*                                      THEN CHECK RLN                */
*               IF OCRLN=ZERO×OCRLN=QCBRELLN THEN               02S0413
         CLI   OCRLN(ROPCE),0                                   02S0413
         BE    @RT00413                                         02S0413
         CLC   OCRLN(1,ROPCE),QCBRELLN(RQCB)                    02S0413
         BNE   @RF00413                                         02S0413
@RT00413 DS    0H                                               02S0414
*                 ERRFLG=ON;        /* CHECK FOR RLN OF 'ALL' OR FOR
*                                      SAME RLN                      */
         OI    ERRFLG(ROPCAVT),B'10000000'                      02S0414
*             END;                                              02S0415
*         END;                                                  02S0416
*     END;                                                      02S0417
*   ELSE                                                        02S0418
*     ;                                                         02S0418
@RF00402 DS    0H                                               02S0419
*   RPARM=OCTRMTBL;                 /* SET TO GET TTE ADDR   @OY19593*/
@RC00402 LH    RPARM,OCTRMTBL(,ROPCE)                           02S0419
         N     RPARM,@CF01685                                   02S0419
*   CALL IEDQTNT;                   /* GET TTE ADDRESS       @OY19593*/
         L     @15,AVTRNMPT(,RAVT)                              02S0420
         BALR  @14,@15                                          02S0420
*   RTRM=RPARM-LENGTH(IEDNTRM);     /* SET UP LINE TTE ADDRESS  02S0421
*                                                            @OY19593*/
         LR    RTRM,RPARM                                       02S0421
         SL    RTRM,@CF00035                                    02S0421
*   REG14=OPCWRKSP(1);              /* RESTORE RETURN ADDRESS        */
         L     REG14,OPCWRKSP(,ROPCAVT)                         02S0422
*   RFY                                                         02S0423
*    (RQCB,                                                     02S0423
*     REG14) UNRSTD;                                            02S0423
*   END;                                                        02S0424
@EL00002 DS    0H                                               02S0424
@EF00002 DS    0H                                               02S0424
@ER00002 BR    @14                                              02S0424
*   END IGCVG10D                                                01S0425
*                                                               01S0425
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */
*/*%INCLUDE SYSLIB  (TAVTD   )                                       */
*/*%INCLUDE SYSLIB  (TOPCED  )                                       */
*/*%INCLUDE SYSLIB  (TOPCAVTD)                                       */
*/*%INCLUDE SYSLIB  (TQCBD   )                                       */
*/*%INCLUDE SYSLIB  (TTRMD   )                                       */
*/*%INCLUDE SYSUT5  (RFY     )                                       */
*/*%INCLUDE SYSUT5  (DCL     )                                       */
*/*%INCLUDE SYSUT5  (PROCESS )                                       */
*/*%INCLUDE SYSUT5  (INITIAL )                                       */
*/*%INCLUDE SYSUT5  (RENTRY  )                                       */
*/*%INCLUDE SYSUT5  (SRCECHK )                                       */
*/*%INCLUDE SYSUT5  (PRIMCHK )                                       */
*/*%INCLUDE SYSUT5  (TOTECHK )                                       */
*/*%INCLUDE SYSUT5  (ERRPROC )                                       */
*/*%INCLUDE SYSUT5  (EXITPROC)                                       */
*/*%INCLUDE SYSUT5  (EPILOGUE)                                       */
*/*%INCLUDE SYSUT5  (IPCHEK  )                                       */
*                                                               01S0425
*       ;                                                       01S0425
@DATA    DS    0H
         DS    0F
         DS    0F
@CF00060 DC    F'1'
@CF00035 DC    F'18'
@CF01658 DC    XL4'08000002'
@CF01685 DC    XL4'0000FFFF'
@CF01671 DC    XL2'0'
         DC    C'VG'
         DS    0D
@CC01673 DC    C'00'
MOD03    DC    CL2'03'
MOD07    DC    CL2'07'
MODV8    DC    CL2'V8'
ZAPAREA  DC    XL104'0'
@00      EQU   00                      EQUATES FOR REGISTERS 0-15
@01      EQU   01
@02      EQU   02
@03      EQU   03
@04      EQU   04
@05      EQU   05
@06      EQU   06
@07      EQU   07
@08      EQU   08
@09      EQU   09
@10      EQU   10
@11      EQU   11
@12      EQU   12
@13      EQU   13
@14      EQU   14
@15      EQU   15
ROPCE    EQU   @03
ROPCAVT  EQU   @02
RTRM     EQU   @08
RAVT     EQU   @04
RQCB     EQU   @06
RZERO    EQU   @00
RPARM    EQU   @01
RBASE    EQU   @12
RSAVE    EQU   @13
REG14    EQU   @14
REG15    EQU   @15
IEDQAVTD EQU   0
AVTSAVEX EQU   IEDQAVTD+288
@NM00003 EQU   IEDQAVTD+388
AVTCKFLG EQU   @NM00003
AVTBASE  EQU   IEDQAVTD+412
AVTPKF   EQU   AVTBASE
AVTRNMPT EQU   IEDQAVTD+424
AVTOLTCB EQU   IEDQAVTD+468
AVTOSECB EQU   IEDQAVTD+492
AVTECB1  EQU   AVTOSECB
AVTHG02  EQU   IEDQAVTD+528
AVTDISP  EQU   IEDQAVTD+552
AVTHD    EQU   IEDQAVTD+556
AVTSCOPT EQU   AVTHD
AVTSAVTP EQU   IEDQAVTD+612
AVTSAVTF EQU   AVTSAVTP
AVTCKPEL EQU   IEDQAVTD+652
AVTCKRMV EQU   AVTCKPEL
AVTCKELF EQU   IEDQAVTD+680
AVTCKBYT EQU   IEDQAVTD+691
AVTHG01  EQU   IEDQAVTD+692
AVTCKLNK EQU   IEDQAVTD+696
AVTCRELE EQU   IEDQAVTD+708
AVTCCELE EQU   AVTCRELE
AVTCLRHI EQU   IEDQAVTD+716
AVTADBUF EQU   IEDQAVTD+720
AVTSYSER EQU   IEDQAVTD+728
AVTBFRFG EQU   IEDQAVTD+784
AVTCKPQB EQU   IEDQAVTD+804
AVTCKPTB EQU   AVTCKPQB
AVTCKPEC EQU   AVTCKPQB+4
AVTCKPCC EQU   AVTCKPEC
AVTOPCQB EQU   IEDQAVTD+816
AVTOPCOB EQU   AVTOPCQB
AVTOPCEC EQU   AVTOPCQB+4
AVTOPCCC EQU   AVTOPCEC
AVTOLTQB EQU   IEDQAVTD+828
AVTCWFL1 EQU   IEDQAVTD+924
AVTCWFL2 EQU   IEDQAVTD+925
AVTSUBT  EQU   IEDQAVTD+948
AVTIOTR  EQU   IEDQAVTD+949
AVTBIT1  EQU   IEDQAVTD+1050
AVTBIT2  EQU   IEDQAVTD+1051
AVTBIT3  EQU   IEDQAVTD+1052
AVTOPCIN EQU   IEDQAVTD+1074
AVTBIT4  EQU   IEDQAVTD+1136
@NM00085 EQU   IEDQAVTD+1232
IEDQAPTR EQU   0
IEDNSVTD EQU   0
SAVTDIAG EQU   IEDNSVTD
SAVTDIAF EQU   SAVTDIAG
SAVTLUSQ EQU   IEDNSVTD+88
SAVTTCPU EQU   IEDNSVTD+238
SAVTZELM EQU   IEDNSVTD+270
SAVTRDRV EQU   IEDNSVTD+284
SAVTCKQB EQU   IEDNSVTD+300
SAVTCKTB EQU   SAVTCKQB
SAVTCKEC EQU   SAVTCKQB+4
SAVTCKCC EQU   SAVTCKEC
SAVTNETF EQU   IEDNSVTD+324
SAVTCDRV EQU   IEDNSVTD+332
IEDQOPCE EQU   0
OCLINK   EQU   IEDQOPCE
OCELEM   EQU   IEDQOPCE+4
OCUNIT   EQU   IEDQOPCE+8
OCRUDEST EQU   OCUNIT
OCCKPKEY EQU   OCRUDEST
OCSCAN   EQU   OCCKPKEY
@NM00109 EQU   OCRUDEST+1
OCUNITBF EQU   @NM00109+2
OCOPTCDE EQU   IEDQOPCE+12
OCSWITCH EQU   IEDQOPCE+13
OCFLAG   EQU   IEDQOPCE+14
OCCONSOL EQU   OCFLAG
OCTOTE   EQU   OCFLAG
OCRESP   EQU   OCFLAG
OCRLN    EQU   IEDQOPCE+15
OCCIB    EQU   IEDQOPCE+16
OCMSTSAV EQU   OCCIB
OCDEST   EQU   OCMSTSAV
OCTRMTBL EQU   IEDQOPCE+20
OCLINENO EQU   IEDQOPCE+22
OCTIOT   EQU   OCLINENO
OCWTGB   EQU   OCTIOT
OCTRUNIT EQU   IEDQOPCE+24
OCRSID   EQU   OCTRUNIT
OCALSTAT EQU   OCRSID
OCRENTRD EQU   OCALSTAT
OCALLFLG EQU   OCALSTAT
OCPARM   EQU   IEDQOPCE+28
OCBACKUP EQU   IEDQOPCE+32
OCBUFNED EQU   OCBACKUP
OCBUFGOT EQU   OCBACKUP+2
OCMODNME EQU   IEDQOPCE+40
OCIPLWA  EQU   OCMODNME
OCCKDATA EQU   IEDQOPCE+48
OCRSTGTM EQU   OCCKDATA
OC379RRT EQU   OCRSTGTM
IEDQOPCN EQU   0
OCLDNME  EQU   IEDQOPCN
OCLINTTE EQU   OCLDNME
OCREQFLG EQU   OCLINTTE+2
OCPREFLG EQU   OCLINTTE+3
IEDQOPCD EQU   0
OPCAVTPT EQU   IEDQOPCD+8
OPCCOPCE EQU   IEDQOPCD+12
OPCSAVE  EQU   IEDQOPCD+56
OPCFLAG1 EQU   IEDQOPCD+146
OPCAQCTL EQU   IEDQOPCD+180
OPCXCTL  EQU   IEDQOPCD+204
OPCLDNME EQU   IEDQOPCD+212
OPCMODID EQU   OPCLDNME+3
OPCHORT  EQU   IEDQOPCD+256
OPCSPEC  EQU   IEDQOPCD+300
OPCWRKSP EQU   IEDQOPCD+320
OPCTOTCK EQU   IEDQOPCD+360
OPCWAITV EQU   IEDQOPCD+364
OPCPWCOB EQU   IEDQOPCD+368
OPCPWQCB EQU   OPCPWCOB
OPCPWECB EQU   OPCPWCOB+4
OPCSESS  EQU   IEDQOPCD+384
OPCPCID  EQU   IEDQOPCD+456
OPCUNIQP EQU   OPCPCID+2
OPCSESSF EQU   IEDQOPCD+464
OPCBLIN  EQU   OPCSESSF
IEDQQCB  EQU   0
QCBDSFLG EQU   IEDQQCB
QCBDISK  EQU   QCBDSFLG
QCBELCHN EQU   IEDQQCB+1
QCBEOLDT EQU   IEDQQCB+16
QCBBYTE1 EQU   QCBEOLDT+1
QCBLKRLN EQU   IEDQQCB+18
QCBRETCT EQU   QCBLKRLN
QCBSTAT  EQU   IEDQQCB+19
QCBINSRC EQU   IEDQQCB+21
QCBTSOF2 EQU   QCBINSRC+1
QCBTSOF1 EQU   QCBINSRC+2
QCBINTVL EQU   IEDQQCB+24
QCBPREN  EQU   IEDQQCB+28
QCBLKRRN EQU   QCBPREN+1
QCBRELLN EQU   IEDQQCB+32
QCBDCBAD EQU   IEDQQCB+33
QCBLGBAD EQU   QCBDCBAD
QCBFLAG  EQU   IEDQQCB+36
IEDQQPTR EQU   0
IEDQPQCB EQU   0
QCBFHDLZ EQU   IEDQPQCB+3
QCBFHDTZ EQU   IEDQPQCB+6
QCBINTLF EQU   IEDQPQCB+12
IEDNQCB  EQU   0
QCBSTAT1 EQU   IEDNQCB+4
QCBPLCBA EQU   IEDNQCB+5
IEDTRM   EQU   0
IEDNTRM  EQU   IEDTRM
TRMINDEX EQU   IEDNTRM
TRMCOHTG EQU   IEDNTRM+2
TRMBYTE6 EQU   TRMCOHTG
TRMCDF0  EQU   TRMBYTE6
TRMBYTE5 EQU   TRMCOHTG+1
TRMBYTE4 EQU   IEDNTRM+4
TRMBYTE3 EQU   IEDNTRM+5
TRMBYTE2 EQU   IEDNTRM+6
TRMINPG  EQU   TRMBYTE2
TRMBYTE1 EQU   IEDNTRM+7
TRMSCPRQ EQU   TRMBYTE1
TRMSTOTE EQU   TRMBYTE1
TRMBYTE0 EQU   IEDNTRM+10
TRMNOWCD EQU   TRMBYTE0
TRMSIBPT EQU   IEDNTRM+11
TRMLTRAC EQU   TRMSIBPT
TRMRLMCT EQU   IEDNTRM+14
TRMLGBST EQU   TRMRLMCT
TRMTYPE  EQU   IEDNTRM+15
IEDQTRM  EQU   IEDTRM+18
TRMSTATE EQU   IEDQTRM
TRMLINE  EQU   TRMSTATE
TRMLOG   EQU   TRMSTATE
TRMPREF  EQU   TRMSTATE
TRMDESTQ EQU   IEDQTRM+1
TRMRSTRT EQU   TRMDESTQ+2
TRMINSEQ EQU   IEDQTRM+4
TLISTCNT EQU   TRMINSEQ
TRMSESCT EQU   TLISTCNT
TRMOUTSQ EQU   IEDQTRM+6
TLISTEN  EQU   TRMOUTSQ
TRMDSORG EQU   TLISTEN
TRMPLIM  EQU   TLISTEN+1
TRMALTD  EQU   IEDQTRM+8
TRMPRILK EQU   TRMALTD
TRMDEVFL EQU   IEDQTRM+10
TRMADDC  EQU   TRMDEVFL
TRMNCPI  EQU   TRMDEVFL+1
TRMSTAT  EQU   IEDQTRM+12
TRMSIO   EQU   TRMSTAT
TRMOWNER EQU   TRMSIO
LGBLINE  EQU   0
LGBADDR  EQU   LGBLINE+5
IEDQTNT  EQU   0
COHORTLK EQU   0
CHCKTOTE EQU   0
QCBLDCB  EQU   0
@NM00118 EQU   OCCIB
@NM00119 EQU   @NM00118+1
OCCKPKY1 EQU   OCCKPKEY
OCCKPTYP EQU   OCCKPKY1
OCICACTN EQU   OCMODNME
OCICDADR EQU   OCICACTN
OCICSW   EQU   OCICDADR+3
OCFID0   EQU   OCMODNME
OCFID01  EQU   OCBACKUP
@NM00124 EQU   OCCKDATA
OCMSGFLG EQU   OCPREFLG
OCBKUP1  EQU   OCMODNME
@NM00129 EQU   OCMODNME
OCBKUP2  EQU   OCCKDATA
OCBKUP3  EQU   OCLDNME
OCRESPTR EQU   OCBKUP3+4
OCDIALLN EQU   OCRESPTR
OCIPLDMP EQU   OCLDNME+4
OPCAQWD  EQU   OPCAQCTL
OPCAQWD1 EQU   OPCAQWD
OPCAQWD2 EQU   OPCAQWD+4
OPCAQWD3 EQU   OPCAQWD+8
@NM00154 EQU   QCBFHDLZ
TRMDIALQ EQU   TRMPLIM
@NM00163 EQU   TRMSTATE
TRMCDFD0 EQU   TRMBYTE5
TRMPRE1  EQU   TRMBYTE4
TRMNCP1  EQU   TRMBYTE4
TRMLU1   EQU   TRMBYTE4
TRMLINK1 EQU   TRMBYTE4
TRMDCONS EQU   TRMLINK1
TRMPRE   EQU   TRMBYTE3
TRMNCP   EQU   TRMBYTE3
TRMPU    EQU   TRMBYTE3
TRMLU    EQU   TRMBYTE3
TRMCDMGR EQU   TRMBYTE3
TRMLINK  EQU   TRMBYTE3
FLAGS    EQU   OPCFLAG1
ERRFLG   EQU   FLAGS
EXITFLG  EQU   FLAGS
OCLINRRT EQU   OCTRUNIT
OCPCID   EQU   OCBACKUP
OCRSNCDE EQU   OCALSTAT
TRMOPT   EQU   IEDQTRM+20
TRMPOOLP EQU   TRMINSEQ
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS
TRMLDISC EQU   TRMLINK
@NM00180 EQU   TRMLINK
TRMLALOC EQU   TRMLINK
TRMLSTAT EQU   TRMLINK
TRMLINT  EQU   TRMLINK
TRMEPMOD EQU   TRMLINK
TRMCDLOG EQU   TRMCDMGR
@NM00179 EQU   TRMCDMGR
@NM00178 EQU   TRMCDMGR
@NM00177 EQU   TRMCDMGR
@NM00176 EQU   TRMCDMGR
@NM00175 EQU   TRMCDMGR
TRMBKDUP EQU   TRMCDMGR
TRMLULOG EQU   TRMLU
@NM00174 EQU   TRMLU
@NM00173 EQU   TRMLU
@NM00172 EQU   TRMLU
TRMTDIFF EQU   TRMLU
@NM00171 EQU   TRMLU
@NM00170 EQU   TRMLU
TRMAUTO  EQU   TRMLU
TRMPCONT EQU   TRMPU
TRMPDOCQ EQU   TRMPU
TRMPULOC EQU   TRMPU
TRMPDNAS EQU   TRMPU
TRMPALOC EQU   TRMPU
TRMNCONT EQU   TRMNCP
TRMQUCKN EQU   TRMNCP
TRMSLOWN EQU   TRMNCP
TRMSYGEN EQU   TRMNCP
TRMNCPCL EQU   TRMNCP
TRMIPLDM EQU   TRMNCP
TRMINOUT EQU   TRMPRE
TRMRDOUT EQU   TRMPRE
TRMNLOUT EQU   TRMPRE
TRMWROUT EQU   TRMPRE
TRMASNXI EQU   TRMPRE
TRMSTMM  EQU   TRMPRE
TRMCMODE EQU   TRMPRE
TRMSTPND EQU   TRMPRE
TRMNCPLK EQU   TRMLINK1
@NM00169 EQU   TRMLINK1
TRMDCONN EQU   TRMDCONS
TRMDCOP  EQU   TRMDCONS
TRMPMARY EQU   TRMLU1
@NM00168 EQU   TRMLU1
@NM00167 EQU   TRMLU1
TRMCDSRQ EQU   TRMLU1
TRMLSCVP EQU   TRMLU1
@NM00166 EQU   TRMLU1
@NM00165 EQU   TRMNCP1
TRMANS   EQU   TRMNCP1
TRMLINOP EQU   TRMNCP1
TRMINOP  EQU   TRMNCP1
TRMLYNCH EQU   TRMPRE1
TRMSPOUT EQU   TRMPRE1
TRMERLCK EQU   TRMPRE1
TRMQNPL  EQU   TRMPRE1
TRMSPACT EQU   TRMPRE1
TRMOCNI  EQU   TRMPRE1
TRMSESSN EQU   TRMPRE1
TRMCONT  EQU   TRMPRE1
TRMINERR EQU   TRMCDFD0
TRMLUTM  EQU   TRMCDFD0
TRMLUIT  EQU   TRMCDFD0
TRMLUREQ EQU   TRMCDFD0
TRMCDPRE EQU   TRMCDFD0
TRMWASCD EQU   TRMCDFD0
TRMSRPFG EQU   TRMCDFD0
TRMSESRQ EQU   TRMCDFD0
@NM00164 EQU   @NM00163
TRMENTRY EQU   @NM00163
TRMSRPTR EQU   TRMDIALQ
QCBPFEFO EQU   @NM00154+1
QCBDATFL EQU   @NM00154
OPCAQLST EQU   OPCAQWD3+1
OPCAQRQ3 EQU   OPCAQWD3
OPCAQSEC EQU   OPCAQWD2+1
OPCAQRQ2 EQU   OPCAQWD2
OPCAQFST EQU   OPCAQWD1+1
OPCAQREQ EQU   OPCAQWD1
@NM00132 EQU   OCIPLDMP
OCACTRQ  EQU   OCIPLDMP
OCDACRQ  EQU   OCIPLDMP
OCIPLRQ  EQU   OCIPLDMP
OCDMPRQ  EQU   OCIPLDMP
@NM00131 EQU   OCRESPTR+2
OCOHNATA EQU   OCDIALLN
OCRRTPTR EQU   OCBKUP3
@NM00130 EQU   OCBKUP2+4
OCNHITTC EQU   OCBKUP2+2
OCLINTTC EQU   OCBKUP2
OCCSIB   EQU   @NM00129
@NM00128 EQU   OCBKUP1+6
OCTARTTC EQU   OCBKUP1+4
OCSRTTC  EQU   OCBKUP1+2
OCRSTTC  EQU   OCBKUP1
@NM00127 EQU   OCMSGFLG
OCRRT    EQU   OCMSGFLG
OCNAME   EQU   OCMSGFLG
OCLU1TTE EQU   @NM00124+4
OCLU2TTI EQU   @NM00124+2
OCLU1TTI EQU   @NM00124
OCSLUTNT EQU   OCFID01+6
OCPLUTNT EQU   OCFID01+4
OCBIADDR EQU   OCFID01
OCSRCED  EQU   OCFID0+4
OCSRCEU  EQU   OCFID0
OCICINAC EQU   OCICSW
@NM00123 EQU   OCICSW
OCICATST EQU   OCICDADR+1
OCICTYPE EQU   OCICDADR
@NM00122 EQU   OCCKPKY1
OCCKPENV EQU   OCCKPKY1
OCCKPRST EQU   OCCKPTYP
OCCKPNCP EQU   OCCKPTYP
OCCKPINC EQU   OCCKPTYP
@NM00121 EQU   @NM00118+2
@NM00120 EQU   @NM00119
OCTSTAT  EQU   @NM00119
OCREASON EQU   @NM00118
@NM00181 EQU   LGBLINE+4
LINEADDR EQU   LGBLINE
TRMOPTBL EQU   IEDQTRM+18
TRMOPNO  EQU   IEDQTRM+17
TRMCHCIN EQU   IEDQTRM+16
TRMSENSE EQU   TRMSTAT+3
TRMTEMPR EQU   TRMSTAT+2
TRMNADDR EQU   TRMOWNER
@NM00162 EQU   TRMDEVFL+1
TRMTPIN  EQU   TRMDEVFL+1
@NM00161 EQU   TRMNCPI
TRMRNTRM EQU   TRMDEVFL+1
@NM00160 EQU   TRMDEVFL+1
TRMLMD   EQU   TRMDEVFL+1
TRMCONC  EQU   TRMDEVFL+1
TRMTSOB  EQU   TRMDEVFL
TRMBFDY  EQU   TRMDEVFL
TRMTBLK  EQU   TRMDEVFL
TRMSBLK  EQU   TRMDEVFL
TRMBLKS  EQU   TRMDEVFL
TRMSCV   EQU   TRMADDC
TRMDDIG  EQU   TRMDEVFL
TRMBUFS  EQU   TRMDEVFL
TRMSTEAL EQU   TRMPRILK
TRMLGB   EQU   TRMDSORG
TRMUTERM EQU   TRMSESCT
TRMVERIF EQU   TRMRSTRT
@NM00159 EQU   TRMRSTRT
@NM00158 EQU   TRMDESTQ
TRMSCNYN EQU   TRMSTATE
TRMOPTFN EQU   TRMSTATE
TRMHELDN EQU   TRMSTATE
TRMACPTN EQU   TRMSTATE
TRMPROC  EQU   TRMLOG
TRMLIST  EQU   TRMLOG
TRMSUBST EQU   IEDNTRM+16
TRMPRIME EQU   TRMLGBST
TRMOWNR  EQU   TRMLTRAC+1
TRMGPCNT EQU   TRMLTRAC
TRMBUFRD EQU   TRMBYTE0
TRMSNA   EQU   TRMBYTE0
TRMGP    EQU   TRMBYTE0
TRMDIAL  EQU   TRMBYTE0
TRMACDC  EQU   TRMNOWCD
TRMOUTPT EQU   TRMBYTE0
TRMINPUT EQU   TRMBYTE0
TRMUDEF  EQU   TRMBYTE0
TRMCOHRT EQU   IEDNTRM+8
TRMCKPRN EQU   TRMBYTE1
TRMTSATN EQU   TRMBYTE1
TRMTRACE EQU   TRMBYTE1
TRMSWBCK EQU   TRMBYTE1
TRMAUTOC EQU   TRMBYTE1
TRMINPTP EQU   TRMBYTE1
TRMWTNEG EQU   TRMSCPRQ
TRMWRBRK EQU   TRMBYTE2
TRMNOSND EQU   TRMBYTE2
TRMPREP  EQU   TRMBYTE2
TRMGPACT EQU   TRMBYTE2
TRMANDL  EQU   TRMBYTE2
TRMCLOSN EQU   TRMINPG
TRMREMB  EQU   TRMBYTE2
TRMRSACT EQU   TRMBYTE2
@NM00157 EQU   TRMCDF0
TRMPURGE EQU   TRMCDF0
TRMCDST  EQU   TRMINDEX
QCBTTCIN EQU   QCBPLCBA+1
@NM00156 EQU   QCBPLCBA
@NM00155 EQU   QCBSTAT1
QCBFLUSH EQU   QCBSTAT1
QCBNDXRQ EQU   QCBSTAT1
QCBESIG  EQU   QCBSTAT1
QCBRCVRQ EQU   QCBSTAT1
QCBSNDRQ EQU   QCBSTAT1
QCBWAITC EQU   QCBSTAT1
QCBPLCBN EQU   QCBSTAT1
QCBCHAIN EQU   IEDNQCB
QCBPQBCK EQU   IEDQPQCB+25
QCBPRIPQ EQU   IEDQPQCB+24
QCBCFHDR EQU   IEDQPQCB+21
QCBLFEFO EQU   IEDQPQCB+18
QCBFFEFO EQU   IEDQPQCB+15
QCBPREVF EQU   QCBINTLF
QCBINTFF EQU   IEDQPQCB+9
QCBDATSQ EQU   QCBFHDTZ+1
@NM00153 EQU   QCBFHDTZ
QCBDNHDR EQU   IEDQPQCB
QCBQBACK EQU   IEDQQCB+37
QCBCKPT  EQU   QCBFLAG
QCBPROC  EQU   QCBFLAG
QCBSDFFO EQU   QCBFLAG
QCBTERMQ EQU   QCBFLAG
QCBRSRV  EQU   QCBFLAG
QCBREAD  EQU   QCBFLAG
QCBNOBRK EQU   QCBFLAG
QCBTSSES EQU   QCBFLAG
QCBTJID  EQU   QCBLKRRN+1
QCBCARCT EQU   QCBLKRRN
QCBPRLVL EQU   QCBPREN
QCBMSGCT EQU   IEDQQCB+26
QCBEXTO  EQU   QCBINTVL
QCBDISC  EQU   QCBTSOF1
QCBDELAY EQU   QCBTSOF1
QCBPARTO EQU   QCBTSOF1
QCBSATRD EQU   QCBTSOF1
QCBNOBUF EQU   QCBTSOF1
QCBTPUT  EQU   QCBTSOF1
QCBTGET  EQU   QCBTSOF1
QCBWRBRK EQU   QCBTSOF1
QCBSATLC EQU   QCBTSOF2
QCBSATTI EQU   QCBTSOF2
QCBSATCH EQU   QCBTSOF2
QCBSIMRD EQU   QCBTSOF2
QCBDSSMI EQU   QCBTSOF2
QCBPOSTO EQU   QCBTSOF2
QCBBUFQ  EQU   QCBTSOF2
QCBINHBN EQU   QCBTSOF2
QCBSATCT EQU   QCBINSRC
QCBSCBOF EQU   IEDQQCB+20
QCBTIME  EQU   QCBSTAT
QCBCLOCK EQU   QCBSTAT
QCBSCHDL EQU   QCBSTAT
QCBSMODE EQU   QCBSTAT
QCBSEND  EQU   QCBSTAT
QCBBUFRD EQU   QCBSTAT
QCBTRMHO EQU   QCBSTAT
QCBEOM   EQU   QCBSTAT
QCBHUCT  EQU   QCBRETCT
QCBIEND  EQU   QCBRETCT
QCBEND   EQU   QCBRETCT
QCBNL    EQU   QCBRETCT
QCBLOGCT EQU   QCBRETCT
@NM00152 EQU   QCBBYTE1
QCBRITRM EQU   QCBBYTE1
@NM00151 EQU   QCBEOLDT
QCBSLINK EQU   IEDQQCB+13
QCBSTPRI EQU   IEDQQCB+12
QCBSTCHN EQU   IEDQQCB+9
QCBSTVTO EQU   IEDQQCB+8
QCBLINK  EQU   IEDQQCB+5
QCBPRI   EQU   IEDQQCB+4
QCBCNTEN EQU   QCBELCHN+2
@NM00150 EQU   QCBELCHN+2
@NM00149 EQU   QCBELCHN
QCBHELD  EQU   QCBDSFLG
QCBFQCB  EQU   QCBDSFLG
QCBDRQQ  EQU   QCBDSFLG
QCBALTMH EQU   QCBDSFLG
QCBREUS  EQU   QCBDISK
QCBNREUS EQU   QCBDISK
QCBCORE  EQU   QCBDSFLG
QCBTSQ   EQU   QCBDSFLG
OPCBOTTM EQU   IEDQOPCD+1320
OPCDSRWT EQU   IEDQOPCD+1316
@NM00148 EQU   IEDQOPCD+1232
@NM00147 EQU   IEDQOPCD+1036
@NM00146 EQU   IEDQOPCD+1028
@NM00145 EQU   IEDQOPCD+468
OPCLSABC EQU   IEDQOPCD+466
@NM00144 EQU   IEDQOPCD+465
@NM00143 EQU   OPCBLIN
OPCBLDSC EQU   OPCBLIN
OPCUNIQV EQU   OPCUNIQP+2
OPCUNIQU EQU   OPCUNIQP
OPCOSSCP EQU   OPCPCID
OPCSDUPU EQU   IEDQOPCD+452
OPCSDULU EQU   IEDQOPCD+448
OPCSDRVT EQU   IEDQOPCD+444
OPCSDRET EQU   IEDQOPCD+440
OPCSDHSY EQU   IEDQOPCD+436
OPCSDENQ EQU   IEDQOPCD+432
OPCSDDIA EQU   IEDQOPCD+428
OPCSDCIS EQU   IEDQOPCD+424
OPCSDBIS EQU   IEDQOPCD+420
OPCSDAPU EQU   IEDQOPCD+416
OPCSDALU EQU   IEDQOPCD+412
OPCCSKEY EQU   IEDQOPCD+408
OPCSSKEY EQU   IEDQOPCD+404
OPCPRTTE EQU   IEDQOPCD+400
OPCLU2TT EQU   OPCSESS+14
OPCLU1TT EQU   OPCSESS+12
OPCSENSE EQU   OPCSESS+8
OPCCSIB  EQU   OPCSESS+4
OPCCTTE  EQU   OPCSESS
OPCGTSIB EQU   IEDQOPCD+380
@NM00142 EQU   OPCPWCOB+9
@NM00141 EQU   OPCPWCOB+8
@NM00140 EQU   OPCPWECB+1
OPCPWCCC EQU   OPCPWECB
OPCPWCHN EQU   OPCPWQCB+1
OPCPWVTO EQU   OPCPWQCB
OPCAPXTL EQU   IEDQOPCD+356
OPCDECR  EQU   IEDQOPCD+352
OPCBUFWT EQU   IEDQOPCD+348
OPCADGOT EQU   IEDQOPCD+318
OPCRQCNT EQU   IEDQOPCD+316
OPPOLSTP EQU   IEDQOPCD+312
OPCCKCIB EQU   IEDQOPCD+308
OPCEND   EQU   IEDQOPCD+307
OPCSTCBS EQU   IEDQOPCD+306
OPCHNEND EQU   IEDQOPCD+302
OPCOQSW  EQU   IEDQOPCD+301
@NM00139 EQU   OPCSPEC
@NM00138 EQU   OPCSPEC
@NM00137 EQU   OPCSPEC
@NM00136 EQU   OPCSPEC
OPCFRMCA EQU   OPCSPEC
OPCRSTRT EQU   OPCSPEC
OPCPART  EQU   OPCSPEC
OPCALTD  EQU   OPCSPEC
OPCBFEND EQU   IEDQOPCD+296
OPCBFIRS EQU   IEDQOPCD+292
OPCAVBUF EQU   IEDQOPCD+290
OPCIPLCT EQU   IEDQOPCD+289
OPCCLNTS EQU   IEDQOPCD+288
OPCHA8   EQU   IEDQOPCD+286
OPCBFREQ EQU   IEDQOPCD+284
OPCFREBF EQU   IEDQOPCD+280
OPCGETBF EQU   IEDQOPCD+276
OPCNEXT  EQU   IEDQOPCD+272
OPCFMDFC EQU   IEDQOPCD+268
OPCSCNC  EQU   IEDQOPCD+264
OPCHORTG EQU   IEDQOPCD+260
OPCCKPTL EQU   IEDQOPCD+252
OPCCKPTF EQU   IEDQOPCD+248
OPCWAITA EQU   IEDQOPCD+244
OPCWAITR EQU   IEDQOPCD+240
OPCWAITP EQU   IEDQOPCD+236
OPCWAITO EQU   IEDQOPCD+232
OPCWAITN EQU   IEDQOPCD+228
OPCWAITL EQU   IEDQOPCD+224
OPCWAITC EQU   IEDQOPCD+220
@NM00135 EQU   OPCLDNME+5
@NM00134 EQU   OPCLDNME
OPCWAIT  EQU   IEDQOPCD+192
OPCCKERB EQU   IEDQOPCD+164
OPCBFERB EQU   IEDQOPCD+148
OPCFLAG2 EQU   IEDQOPCD+147
OPCWRKSZ EQU   IEDQOPCD+144
OPCWORK  EQU   IEDQOPCD+140
OPCRSAVE EQU   IEDQOPCD+132
OPCQCBAD EQU   IEDQOPCD+128
OPCTRMWA EQU   IEDQOPCD+52
OPCPSTWT EQU   IEDQOPCD+48
OPCTNTEA EQU   IEDQOPCD+44
OPCPGCK  EQU   IEDQOPCD+40
OPCLCB   EQU   IEDQOPCD+36
@NM00133 EQU   IEDQOPCD+32
OPCIPLAD EQU   IEDQOPCD+28
OPCTOFLK EQU   IEDQOPCD+24
OPCOPTLK EQU   IEDQOPCD+20
OPCDCBLK EQU   IEDQOPCD+16
OPCDOUBL EQU   IEDQOPCD
@NM00126 EQU   OCLDNME+4
@NM00125 EQU   OCPREFLG
OCREMCON EQU   OCPREFLG
OCCLNUP  EQU   OCPREFLG
OCTOTEP  EQU   OCPREFLG
OCREPOST EQU   OCPREFLG
OCRSPSNT EQU   OCPREFLG
OCBFREQ  EQU   OCPREFLG
OCIDLE   EQU   OCREQFLG
OCFORCE  EQU   OCREQFLG
OCDCARD  EQU   OCREQFLG
OCPARTAL EQU   OCREQFLG
OCADNCP  EQU   OCREQFLG
OCRMPORQ EQU   OCREQFLG
OCCDLACT EQU   OCREQFLG
OCFLUSHZ EQU   OCREQFLG
OCRESPCT EQU   OCLINTTE
OCCKPTWA EQU   OCCKDATA+4
OCNCP    EQU   OCRSTGTM+2
OCCKDAT2 EQU   OC379RRT+1
OCCKDAT1 EQU   OC379RRT
OCPTRSAV EQU   OCMODNME+4
OCPUADR  EQU   OCIPLWA+2
OCWTGSAV EQU   OCIPLWA
OCDVRDCT EQU   OCBACKUP+6
@NM00117 EQU   OCBACKUP+4
OCBUFRET EQU   OCBUFGOT
OCBUFUSD EQU   OCBUFNED
OCWTG    EQU   IEDQOPCE+30
OCRESNUM EQU   OCPARM
OCSEQ    EQU   OCTRUNIT+2
@NM00116 EQU   OCRSID+1
OCNONE   EQU   OCALSTAT
OCSOME   EQU   OCALSTAT
OCACTREQ EQU   OCALSTAT
OCREDRVE EQU   OCALSTAT
OCSEQIND EQU   OCALSTAT
@NM00115 EQU   OCALSTAT
OCDIALX  EQU   OCWTGB
@NM00114 EQU   OCMSTSAV+2
OCREQVAL EQU   OCDEST+1
OCCONID  EQU   OCDEST
OCATTACH EQU   OCFLAG
OCSSCP   EQU   OCFLAG
OCOUTPUT EQU   OCFLAG
OCLINE   EQU   OCFLAG
OCMPP    EQU   OCFLAG
@NM00113 EQU   OCSWITCH
OCQUCKN  EQU   OCSWITCH
OCPRIFLG EQU   OCOPTCDE
@NM00112 EQU   OCUNITBF
OCINVTIC EQU   OCUNITBF
@NM00111 EQU   OCUNITBF
@NM00110 EQU   @NM00109
@NM00108 EQU   OCSCAN
OCNOTUCB EQU   OCSCAN
OCNONAME EQU   OCSCAN
OCALLRLN EQU   OCSCAN
OCDDNAME EQU   OCSCAN
OCDDNRLN EQU   OCSCAN
OCADDR   EQU   OCSCAN
OCELMPTR EQU   OCELEM+1
OCELMPRI EQU   OCELEM
SAVTLLCB EQU   IEDNSVTD+380
SAVTSCF0 EQU   IEDNSVTD+376
SAVTLSNY EQU   IEDNSVTD+372
SAVTLSZP EQU   IEDNSVTD+368
SAVTOMSU EQU   IEDNSVTD+364
SAVTGTSB EQU   IEDNSVTD+360
SAVTHIBL EQU   IEDNSVTD+356
SAVTHISY EQU   IEDNSVTD+352
SAVTNAX2 EQU   IEDNSVTD+348
SAVTCDRU EQU   IEDNSVTD+344
SAVTPOLC EQU   IEDNSVTD+342
SAVTPOLM EQU   IEDNSVTD+340
SAVTPOLR EQU   IEDNSVTD+336
SAVTCDRN EQU   SAVTCDRV
SAVTPOLL EQU   IEDNSVTD+328
SAVTPOLN EQU   IEDNSVTD+326
@NM00107 EQU   IEDNSVTD+325
@NM00106 EQU   SAVTNETF
SAVTSDIS EQU   SAVTNETF
SAVTROUT EQU   SAVTNETF
SAVTNETW EQU   SAVTNETF
SAVTDIAL EQU   IEDNSVTD+320
SAVTRQUT EQU   IEDNSVTD+316
SAVTBITN EQU   IEDNSVTD+312
@NM00105 EQU   SAVTCKQB+8
@NM00104 EQU   SAVTCKEC+1
@NM00103 EQU   SAVTCKCC
SAVTCKPO EQU   SAVTCKCC
SAVTCKWA EQU   SAVTCKCC
SAVTCKCH EQU   SAVTCKTB+1
SAVTCKVT EQU   SAVTCKTB
@NM00102 EQU   IEDNSVTD+297
SAVTRDFG EQU   SAVTRDRV+12
@NM00101 EQU   SAVTRDRV+5
SAVTRDPY EQU   SAVTRDRV+4
SAVTRDQB EQU   SAVTRDRV+1
SAVTRDKY EQU   SAVTRDRV
SAVTNID  EQU   IEDNSVTD+280
SAVTDVAS EQU   IEDNSVTD+276
SAVTPLSZ EQU   IEDNSVTD+274
@NM00100 EQU   IEDNSVTD+273
SAVTSUBL EQU   IEDNSVTD+272
@NM00099 EQU   SAVTZELM+1
SAVTSUBM EQU   SAVTZELM
SAVTMHDX EQU   IEDNSVTD+268
SAVTNAT1 EQU   IEDNSVTD+266
SAVTSH20 EQU   IEDNSVTD+264
SAVTLCBS EQU   IEDNSVTD+260
SAVTRNMP EQU   IEDNSVTD+256
SAVTTNTX EQU   IEDNSVTD+252
SAVTNAX  EQU   IEDNSVTD+248
SAVTSUBV EQU   IEDNSVTD+247
SAVTSUBA EQU   IEDNSVTD+246
SAVTSIBC EQU   IEDNSVTD+244
SAVTBSM  EQU   IEDNSVTD+240
SAVTSCPT EQU   SAVTTCPU
SAVTRQTG EQU   IEDNSVTD+236
SAVTRQCH EQU   IEDNSVTD+232
SAVTMAND EQU   IEDNSVTD+228
SAVTSPLN EQU   IEDNSVTD+224
SAVTNADL EQU   IEDNSVTD+222
SAVTNATL EQU   IEDNSVTD+220
SAVTMHTB EQU   IEDNSVTD+216
SAVTSSMH EQU   IEDNSVTD+212
SAVTQRS  EQU   IEDNSVTD+208
SAVTRQIN EQU   IEDNSVTD+204
SAVTDFCO EQU   IEDNSVTD+200
SAVTSAO  EQU   IEDNSVTD+196
SAVTSARI EQU   IEDNSVTD+192
SAVTSAC  EQU   IEDNSVTD+188
SAVTSAI  EQU   IEDNSVTD+184
SAVTCSCI EQU   IEDNSVTD+180
SAVTSSRP EQU   IEDNSVTD+176
SAVTSSRQ EQU   IEDNSVTD+172
SAVTSCLU EQU   IEDNSVTD+168
SAVTXTRQ EQU   IEDNSVTD+164
SAVTMVBF EQU   IEDNSVTD+160
@NM00098 EQU   IEDNSVTD+148
SAVTIPCQ EQU   IEDNSVTD+144
@NM00097 EQU   IEDNSVTD+136
SAVTXFMI EQU   IEDNSVTD+132
@NM00096 EQU   IEDNSVTD+124
SAVTXFMO EQU   IEDNSVTD+120
@NM00095 EQU   IEDNSVTD+116
SAVTSSSR EQU   IEDNSVTD+112
SAVTSCPQ EQU   IEDNSVTD+108
SAVTSLCB EQU   IEDNSVTD+104
SAVTLUSR EQU   IEDNSVTD+100
@NM00094 EQU   SAVTLUSQ+8
SAVTLUSP EQU   SAVTLUSQ+4
SAVTLUSB EQU   SAVTLUSQ
@NM00093 EQU   IEDNSVTD+84
SAVTSAT  EQU   IEDNSVTD+80
SAVTNAT  EQU   IEDNSVTD+76
SAVTCLUP EQU   IEDNSVTD+72
SAVTPIUT EQU   IEDNSVTD+68
SAVTRNTA EQU   IEDNSVTD+64
SAVTDNIR EQU   IEDNSVTD+60
SAVTCNIR EQU   IEDNSVTD+56
SAVTFLDH EQU   IEDNSVTD+52
SAVTSRTN EQU   IEDNSVTD+48
SAVTSREQ EQU   IEDNSVTD+44
SAVTFAIL EQU   IEDNSVTD+42
SAVTSUSE EQU   IEDNSVTD+40
SAVTSIB  EQU   IEDNSVTD+36
SAVTPRTN EQU   IEDNSVTD+32
@NM00092 EQU   IEDNSVTD+28
SAVTWH20 EQU   IEDNSVTD+26
SAVTPWT  EQU   IEDNSVTD+24
SAVTPRTQ EQU   IEDNSVTD+20
SAVTPREQ EQU   IEDNSVTD+16
SAVTPH20 EQU   IEDNSVTD+14
SAVTPUSE EQU   IEDNSVTD+12
SAVTPLCB EQU   IEDNSVTD+8
SAVTPOOL EQU   IEDNSVTD+4
SAVTPRMT EQU   SAVTDIAF
SAVTVIRT EQU   SAVTDIAF
AVTSITS  EQU   IEDQAVTD+1264
AVTMSUHI EQU   IEDQAVTD+1260
AVTSITU  EQU   IEDQAVTD+1256
AVTSITP  EQU   IEDQAVTD+1252
AVTPADDR EQU   IEDQAVTD+1248
@NM00091 EQU   IEDQAVTD+1246
AVTCPBNO EQU   IEDQAVTD+1244
AVTHRESS EQU   IEDQAVTD+1243
@NM00090 EQU   IEDQAVTD+1242
@NM00089 EQU   IEDQAVTD+1241
@NM00088 EQU   IEDQAVTD+1240
@NM00087 EQU   IEDQAVTD+1237
@NM00086 EQU   IEDQAVTD+1236
AVTHRESE EQU   @NM00085
AVTRADDR EQU   IEDQAVTD+1228
AVTNADDR EQU   IEDQAVTD+1224
AVTHRESN EQU   IEDQAVTD+1220
AVTVOLRN EQU   IEDQAVTD+1216
AVTTOTNN EQU   IEDQAVTD+1212
AVTTRCYN EQU   IEDQAVTD+1208
AVTRCTRN EQU   IEDQAVTD+1204
AVTNOVON EQU   IEDQAVTD+1200
AVTADEBN EQU   IEDQAVTD+1196
AVTVOLRR EQU   IEDQAVTD+1192
AVTTOTNR EQU   IEDQAVTD+1188
AVTTRCYR EQU   IEDQAVTD+1184
AVTRCTRR EQU   IEDQAVTD+1180
AVTNOVOR EQU   IEDQAVTD+1176
AVTADEBR EQU   IEDQAVTD+1172
AVTLODPT EQU   IEDQAVTD+1168
AVTIOBN  EQU   IEDQAVTD+1164
AVTIOBR  EQU   IEDQAVTD+1160
AVTCPBPT EQU   IEDQAVTD+1156
AVTFCPB  EQU   IEDQAVTD+1152
@NM00084 EQU   IEDQAVTD+1148
AVTINCPQ EQU   IEDQAVTD+1144
@NM00083 EQU   IEDQAVTD+1140
@NM00082 EQU   IEDQAVTD+1137
@NM00081 EQU   AVTBIT4
@NM00080 EQU   AVTBIT4
@NM00079 EQU   AVTBIT4
@NM00078 EQU   AVTBIT4
@NM00077 EQU   AVTBIT4
@NM00076 EQU   AVTBIT4
@NM00075 EQU   AVTBIT4
AVTRUFTN EQU   AVTBIT4
@NM00074 EQU   IEDQAVTD+1132
AVTNOBFQ EQU   IEDQAVTD+1128
@NM00073 EQU   IEDQAVTD+1124
AVTDKENQ EQU   IEDQAVTD+1120
@NM00072 EQU   IEDQAVTD+1116
AVTDKAPQ EQU   IEDQAVTD+1112
AVTCOPY  EQU   IEDQAVTD+1108
AVTIA    EQU   IEDQAVTD+1104
AVTFL    EQU   IEDQAVTD+1100
@NM00071 EQU   IEDQAVTD+1096
AVTNCPBQ EQU   IEDQAVTD+1092
AVTTOTNC EQU   IEDQAVTD+1088
AVTCMAX  EQU   IEDQAVTD+1084
AVTCMIN  EQU   IEDQAVTD+1080
AVTHM02  EQU   IEDQAVTD+1076
AVTDCTLN EQU   IEDQAVTD+1072
AVTOPMSK EQU   IEDQAVTD+1068
AVTDDFT  EQU   IEDQAVTD+1064
AVTSTEAL EQU   IEDQAVTD+1060
AVTOPTN  EQU   IEDQAVTD+1056
AVTDSKCT EQU   IEDQAVTD+1054
AVTCKRST EQU   IEDQAVTD+1053
AVTSTAN  EQU   AVTBIT3
AVTSTACN EQU   AVTBIT3
AVTSTAIN EQU   AVTBIT3
AVTSTAYN EQU   AVTBIT3
AVTOLTBN EQU   AVTBIT3
AVTTSAB  EQU   AVTBIT3
AVTRFULN EQU   AVTBIT3
AVTRECVN EQU   AVTBIT3
@NM00070 EQU   AVTBIT2
@NM00069 EQU   AVTBIT2
AVTOPEIN EQU   AVTBIT2
AVTSTRTN EQU   AVTBIT2
AVTTOPOL EQU   AVTBIT2
AVTCOPYN EQU   AVTBIT2
AVTREUSN EQU   AVTBIT2
AVTEXTSC EQU   AVTBIT2
AVTDISKN EQU   AVTBIT1
AVTQUCKN EQU   AVTBIT1
AVTCLOSN EQU   AVTBIT1
AVTREADN EQU   AVTBIT1
AVTDLAYN EQU   AVTBIT1
AVTAQTAN EQU   AVTBIT1
AVTTSON  EQU   AVTBIT1
AVTAPLKN EQU   AVTBIT1
AVTDUMBR EQU   IEDQAVTD+1048
AVTDLQX  EQU   IEDQAVTD+1046
AVTINTLV EQU   IEDQAVTD+1044
AVTSMCNT EQU   IEDQAVTD+1042
AVTAVFCT EQU   IEDQAVTD+1040
AVTOPCON EQU   IEDQAVTD+1038
AVTOPCNT EQU   IEDQAVTD+1036
AVTLNCNT EQU   IEDQAVTD+1034
AVTKEYLE EQU   IEDQAVTD+1032
AVTHA16  EQU   IEDQAVTD+1030
AVTHA7   EQU   IEDQAVTD+1028
AVTHA4   EQU   IEDQAVTD+1026
AVTHA3   EQU   IEDQAVTD+1024
AVTHA2   EQU   IEDQAVTD+1022
AVTGETMS EQU   IEDQAVTD+1021
@NM00068 EQU   IEDQAVTD+1020
AVTGETMD EQU   IEDQAVTD+1016
AVTGETMN EQU   IEDQAVTD+1012
AVTCWTOT EQU   IEDQAVTD+1008
AVTCWINT EQU   IEDQAVTD+956
AVTDTRAP EQU   IEDQAVTD+952
@NM00067 EQU   IEDQAVTD+950
@NM00066 EQU   AVTIOTR
AVTIOTRH EQU   AVTIOTR
AVTIOTRE EQU   AVTIOTR
@NM00065 EQU   AVTSUBT
AVTSUBPT EQU   AVTSUBT
AVTSUBON EQU   AVTSUBT
AVTAFE30 EQU   IEDQAVTD+944
AVTAFE20 EQU   IEDQAVTD+940
AVTAFE10 EQU   IEDQAVTD+936
AVTCWEC2 EQU   IEDQAVTD+932
AVTCWPM2 EQU   IEDQAVTD+928
AVTCWTS2 EQU   IEDQAVTD+927
AVTCWTS1 EQU   IEDQAVTD+926
AVTCWCLD EQU   AVTCWFL2
AVTCWRAP EQU   AVTCWFL2
@NM00064 EQU   AVTCWFL2
@NM00063 EQU   AVTCWFL2
@NM00062 EQU   AVTCWFL2
@NM00061 EQU   AVTCWFL2
@NM00060 EQU   AVTCWFL2
AVTCWACT EQU   AVTCWFL2
@NM00059 EQU   AVTCWFL1
@NM00058 EQU   AVTCWFL1
@NM00057 EQU   AVTCWFL1
@NM00056 EQU   AVTCWFL1
@NM00055 EQU   AVTCWFL1
@NM00054 EQU   AVTCWFL1
@NM00053 EQU   AVTCWFL1
AVTCOMWN EQU   AVTCWFL1
AVTCWEC1 EQU   IEDQAVTD+920
AVTCWPM1 EQU   IEDQAVTD+916
AVTCAREA EQU   IEDQAVTD+912
AVTFZERO EQU   IEDQAVTD+908
AVTCADDR EQU   IEDQAVTD+904
AVTCOREC EQU   IEDQAVTD+900
@NM00052 EQU   IEDQAVTD+892
AVTCPBCB EQU   IEDQAVTD+888
@NM00051 EQU   IEDQAVTD+880
AVTDSIOB EQU   IEDQAVTD+876
@NM00050 EQU   IEDQAVTD+868
AVTCPRMB EQU   IEDQAVTD+864
@NM00049 EQU   IEDQAVTD+856
AVTCLOSB EQU   IEDQAVTD+852
@NM00048 EQU   IEDQAVTD+844
AVTACTIB EQU   IEDQAVTD+840
@NM00047 EQU   IEDQAVTD+836
AVTOLTEB EQU   IEDQAVTD+832
AVTOLTCH EQU   AVTOLTQB+1
AVTOLTVT EQU   AVTOLTQB
@NM00046 EQU   AVTOPCQB+8
@NM00045 EQU   AVTOPCEC+1
@NM00044 EQU   AVTOPCCC
AVTOPCPO EQU   AVTOPCCC
AVTOPCWA EQU   AVTOPCCC
AVTOPCCH EQU   AVTOPCOB+1
AVTOPCVT EQU   AVTOPCOB
@NM00043 EQU   AVTCKPQB+9
AVTCKPTS EQU   AVTCKPQB+8
@NM00042 EQU   AVTCKPEC+1
@NM00041 EQU   AVTCKPCC
AVTCKPPO EQU   AVTCKPCC
AVTCKPWA EQU   AVTCKPCC
AVTCKPCH EQU   AVTCKPTB+1
AVTCKPVT EQU   AVTCKPTB
@NM00040 EQU   IEDQAVTD+796
AVTBFRTB EQU   IEDQAVTD+792
@NM00039 EQU   IEDQAVTD+788
AVTSELCH EQU   IEDQAVTD+785
AVTBFRTN EQU   AVTBFRFG
AVTBFREB EQU   IEDQAVTD+780
AVTTIMQ  EQU   IEDQAVTD+776
@NM00038 EQU   IEDQAVTD+772
AVTIMQPS EQU   IEDQAVTD+768
AVTINOUT EQU   IEDQAVTD+766
AVTREFTM EQU   IEDQAVTD+764
@NM00037 EQU   IEDQAVTD+752
AVTDELYB EQU   IEDQAVTD+748
AVTOCQPT EQU   IEDQAVTD+744
AVTTSOPT EQU   IEDQAVTD+740
AVTSUPPT EQU   IEDQAVTD+736
AVTCBQCB EQU   IEDQAVTD+732
AVTMSGS  EQU   IEDQAVTD+729
@NM00036 EQU   AVTSYSER
@NM00035 EQU   AVTSYSER
@NM00034 EQU   AVTSYSER
@NM00033 EQU   AVTSYSER
@NM00032 EQU   AVTSYSER
@NM00031 EQU   AVTSYSER
AVTCMAXN EQU   AVTSYSER
AVTCMINN EQU   AVTSYSER
AVT2260L EQU   IEDQAVTD+724
AVTABEPL EQU   AVTADBUF
AVTHFF   EQU   AVTCLRHI+2
@NM00030 EQU   AVTCLRHI
AVTCCLNK EQU   AVTCRELE+5
AVTCCPRI EQU   AVTCRELE+4
AVTCCQCB EQU   AVTCCELE+1
AVTCCKEY EQU   AVTCCELE
AVTDELAD EQU   IEDQAVTD+704
AVTDELEM EQU   IEDQAVTD+700
AVTBSX   EQU   AVTCKLNK
AVTOPETR EQU   AVTHG01
@NM00029 EQU   AVTCKBYT
AVTCKONQ EQU   AVTCKBYT
@NM00028 EQU   AVTCKBYT
@NM00027 EQU   AVTCKBYT
@NM00026 EQU   AVTCKBYT
@NM00025 EQU   AVTCKBYT
@NM00024 EQU   AVTCKBYT
@NM00023 EQU   AVTCKBYT
AVTOPERT EQU   IEDQAVTD+690
AVTOPXCL EQU   IEDQAVTD+688
AVTOPERL EQU   IEDQAVTD+687
@NM00022 EQU   IEDQAVTD+686
AVTCKTIM EQU   IEDQAVTD+684
AVTCKELV EQU   IEDQAVTD+682
AVTCPRCD EQU   IEDQAVTD+681
AVTWARMN EQU   AVTCKELF
AVTCRTLN EQU   AVTCKELF
AVTCPIPN EQU   AVTCKELF
AVTCCLCN EQU   AVTCKELF
AVTCINCN EQU   AVTCKELF
@NM00021 EQU   AVTCKELF
AVTCMCPN EQU   AVTCKELF
AVTNQBCK EQU   AVTCKELF
AVTCKQAD EQU   IEDQAVTD+677
AVTSCBSZ EQU   IEDQAVTD+676
@NM00020 EQU   IEDQAVTD+672
AVTCKELE EQU   IEDQAVTD+668
@NM00019 EQU   AVTCKPEL+8
AVTCKRLK EQU   AVTCKPEL+5
AVTCKRPR EQU   AVTCKPEL+4
AVTCKRMQ EQU   AVTCKRMV+1
AVTCKRKY EQU   AVTCKRMV
AVTHK    EQU   IEDQAVTD+648
AVTHI    EQU   IEDQAVTD+644
AVTIOT   EQU   IEDQAVTD+640
AVTNX    EQU   IEDQAVTD+636
AVTTONE  EQU   IEDQAVTD+632
AVTA3TL  EQU   IEDQAVTD+628
AVTDMECB EQU   IEDQAVTD+624
AVTABEND EQU   IEDQAVTD+618
AVTPLCBN EQU   IEDQAVTD+616
@NM00018 EQU   AVTSAVTP+1
@NM00017 EQU   AVTSAVTF
AVTSNA   EQU   AVTSAVTF
AVTONSNA EQU   AVTSAVTF
AVTVTMCP EQU   AVTSAVTF
@NM00016 EQU   IEDQAVTD+608
AVTCMBSS EQU   IEDQAVTD+604
AVTRCV   EQU   IEDQAVTD+600
AVTSEND  EQU   IEDQAVTD+596
AVTCSCH  EQU   IEDQAVTD+592
AVTQ1    EQU   IEDQAVTD+588
AVTE7    EQU   IEDQAVTD+584
AVTHB    EQU   IEDQAVTD+580
AVTR1    EQU   IEDQAVTD+576
AVTBZ    EQU   IEDQAVTD+572
AVTEZ    EQU   IEDQAVTD+568
AVTEC    EQU   IEDQAVTD+564
AVTEW    EQU   IEDQAVTD+560
AVTNDIAL EQU   AVTSCOPT
AVTN2741 EQU   AVTSCOPT
AVTCONCO EQU   AVTSCOPT
AVTCONC  EQU   AVTSCOPT
AVTCMBUF EQU   AVTSCOPT
AVTAPDMP EQU   AVTSCOPT
@NM00015 EQU   AVTSCOPT
AVTHA    EQU   AVTDISP
AVTEA    EQU   IEDQAVTD+548
AVTAX    EQU   IEDQAVTD+544
AVTA3    EQU   IEDQAVTD+540
AVTGD    EQU   IEDQAVTD+536
AVTAL    EQU   IEDQAVTD+532
AVTOLTST EQU   AVTHG02
AVTE8    EQU   IEDQAVTD+524
AVTUI    EQU   IEDQAVTD+520
AVTCOMPT EQU   IEDQAVTD+516
AVTCRSRF EQU   IEDQAVTD+512
@NM00014 EQU   IEDQAVTD+508
AVTKA02  EQU   IEDQAVTD+504
AVTOPTPT EQU   IEDQAVTD+500
AVTPCBPT EQU   IEDQAVTD+496
@NM00013 EQU   AVTECB1
AVTCOMP  EQU   AVTECB1
@NM00012 EQU   AVTECB1
AVTOPECA EQU   IEDQAVTD+488
AVTOLECA EQU   IEDQAVTD+484
AVTCKECA EQU   IEDQAVTD+480
AVTCWECA EQU   IEDQAVTD+476
AVTCWTCB EQU   IEDQAVTD+472
AVTOCTCB EQU   IEDQAVTD+464
AVTCKTCB EQU   IEDQAVTD+460
AVTAS    EQU   IEDQAVTD+456
AVTNOLBF EQU   IEDQAVTD+454
AVTNCKPR EQU   IEDQAVTD+453
AVTCIB   EQU   IEDQAVTD+452
AVTSPLPT EQU   IEDQAVTD+448
AVTMVBFR EQU   IEDQAVTD+444
AVTSBTA  EQU   IEDQAVTD+440
AVTRARTN EQU   IEDQAVTD+436
AVTBSCAN EQU   IEDQAVTD+432
AVTRDYA  EQU   IEDQAVTD+428
AVTDISTR EQU   IEDQAVTD+420
AVTPARM3 EQU   IEDQAVTD+416
@NM00011 EQU   AVTPKF
@NM00010 EQU   AVTPKF
@NM00009 EQU   AVTPKF
AVTFTCHF EQU   AVTPKF
@NM00008 EQU   AVTPKF
@NM00007 EQU   AVTPKF
@NM00006 EQU   AVTPKF
@NM00005 EQU   AVTPKF
AVTPARM  EQU   IEDQAVTD+408
AVTEXS2A EQU   IEDQAVTD+402
AVTEXA2S EQU   IEDQAVTD+396
AVTOCGET EQU   IEDQAVTD+392
AVTCKAVT EQU   @NM00003+1
@NM00004 EQU   AVTCKFLG
AVTCKHLT EQU   AVTCKFLG
AVTCKREQ EQU   AVTCKFLG
AVTCKENV EQU   AVTCKFLG
AVTCKNAC EQU   AVTCKFLG
AVTCKTAC EQU   AVTCKFLG
@NM00002 EQU   IEDQAVTD+384
AVTREADD EQU   IEDQAVTD+380
AVTREADY EQU   IEDQAVTD+376
AVTRACE  EQU   IEDQAVTD+372
AVTTCB   EQU   IEDQAVTD+368
AVTPASWD EQU   IEDQAVTD+360
AVTCTLCH EQU   IEDQAVTD+352
AVTDOUBL EQU   IEDQAVTD+344
AVTDOUBX EQU   IEDQAVTD+336
AVTDPARM EQU   IEDQAVTD+332
AVTCSTCS EQU   IEDQAVTD+328
AVTDLQ   EQU   AVTSAVEX+32
@NM00001 EQU   AVTSAVEX
AVTSAVE4 EQU   IEDQAVTD+216
AVTSAVE3 EQU   IEDQAVTD+144
AVTSAVE2 EQU   IEDQAVTD+72
AVTSAVE1 EQU   IEDQAVTD
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS
@RC00340 EQU   @RC00338
@RF00408 EQU   @RC00402
@RF00411 EQU   @RC00402
@RF00413 EQU   @RC00402
@RF00344 EQU   @RC00340
@ENDDATA EQU   *
         END   IGCVG10D,(C'PLS0259',0701,78108)
