//GWDANI00 JOB (8297,,05,19),IPCSAD,MSGLEVEL=(0,0),NOTIFY=GWDANI,
//  MSGCLASS=H
//*
//* REFERENCE: SYS.IPCS.CNTL(CLOSLOG)
//* JOB SUBMITTED BY IPCSLOG CLIST MEMBER OF SYS.IPCS.CLIST WHICH
//* IS INVOKED BY THE SPFIPCS MOD MENU CLIST, IPCSMOD, WHEN A
//* PROBLEM IS BEING CLOSED
//*
/*MAIN L=99,S=ANY
/*ROUTE  PRINT LOCAL
//BKTSO  EXEC PGM=IKJEFT01,REGION=2000K
//SYSTSPRT DD SYSOUT=*
//IPCSDDIR DD DSN=IPCS.DUMMY.DUMPDIR,DISP=SHR
//IPCSPRNT DD SYSOUT=*
//SYSTSIN  DD *
IPCS PARM(00)
SETDEF PRINT NOTERMINAL
 /* *** DO NOT DELETE - REPLACED VIA TSO EDIT FROM IPCSLOG CLIST */
 /* *** DO NOT DELETE - SPECIFY "STATS OFF" WHEN IN SPF EDIT     */
LP OWNER(IPCSAD) ALL /* THIS LINE ALSO REPLACED VIA EDIT */
END
//
