//IPCSAD00 JOB (8297,,05,19),IPCSAD,NOTIFY=IPCSAD,MSGLEVEL=(0,0)
//* *******
//* REFERENCE: SYS.IPCS.CNTL(STATREPO)
//* JOB SUBMITTED FOR THE 08:40 STATUS MEETING.  LISTING CONTAINS
//* ALL OPEN IPCS PROBLEMS FROM OPERATIONS, SYSTEMS PROGRAMMING,
//* PRODUCTION CONTROL, COMMUNICATIONS, AND DISTRIBUTED PROCESSING.
//*
/*MAIN L=99,S=ANY
/*ROUTE  PRINT LOCAL
//BKTSO  EXEC PGM=IKJEFT01,REGION=2000K
//SYSTSPRT DD DUMMY
//IPCSDDIR DD DSN=MIPCS.DUMMY.DUMPDIR,DISP=SHR
//IPCSPRNT DD SYSOUT=(*),COPIES=3
//SYSTSIN  DD *
EX 'SYS.IPCS.CLIST(STATREP)'
//
