ATTNLEVL DSECT
ATTNFWPT DS    1F       FORWARD PTR
ATTNBKPT DS    1F       BACKWARD PTR
ATTNLVID DS    1F       CONSTANT X'F2040000'
ATTNDERB DS    1F       ADDRESS OF FIRST DIRECT ENTRY ROUTINE BLOCK
ATTNAVAL DS    1F       ADDRESS OF FIRST AVAILABLE    QUEUE ENTRY
ATTNDATA DS    1F       ADDRESS OF LAST DE ATTENTION OCCURRENCE
ATTNMLEN DS    1F       MAIN LINE DATA ENTRIES
ATTNFLGA DS    BL1      ATTENTION LEVEL FLAGS A
*                       BIT 0-EOS XY OPTION
*                       BIT 1-EOS REGENERATE OPTION
*                       BIT 2-LP XY OPTION
*                       BIT 3-LP CHARACTER CODE OPTION
*                       BIT 4-LP REGENERATE OPTION
*                       BIT 5-DE DEQUEUE DATA OPTION
*                       BIT 6-DE ACTIVE/NOT ACTIVE
*                       BIT 7-DELAYED DIRECT ENTRY IN PROGRESS
ATTNFLGB DS    BL1      ATTENTION LEVEL FLAGS B
*                       BIT 0-REQATN SEARCH   0=NO   1=YES
ATTNBPID DS    BL1      BACK PTR INDICATOR
ATTNLITE DS    BL1      PF INDICATOR LIGHTS OPTION
ATTNPFLM DS    1F       PF INDICATOR LIGHTS MASK
ATTNPFEN DS    1F       ENABLED PF KEYS FOR LEVEL
ATTNANEN DS    1F       ENABLED A/N SOURCES FOR LEVEL
ATTNPFDE DS    1F       ENABLED PF KEYS FOR DIRECT ENTRY
ATTNANDE DS    1F       ENABLED A/N SOURCES FOR DIRECT ENTRY
ATTNAECB DS    1F       ECB FOR ATTN SOURCE 99
ATTNSETA DS    3F       SETATN DATA AREA
ATTNDECB DS    1F       DELAYED DIRECT ENTRY ECB
