         MACRO
         IEFZB4D5 &DSECT=YES
.*  FROM DATA AREAS, VOL. 2
         AIF ('DSECT' EQ 'NO').DSQDS
DSABQDB  DSECT ,
         AGO   .DSQCOM
.DSQDS    ANOP
DSABQDB  DS    0D
.DSQCOM  ANOP
DSQDBID  DC    CL4'DSAB'     ACRONYM IN EBCDIC -DSAB-
DSQATTRS DS    XL2           QUEUE ATTRIBUTES
DSQRIURB EQU   X'80'           REBUILD RIU TABLE
DSQDBLN  DS    H             QDB LENGTH
DSQNELMS DS    F             NUMBER OF ELEMENTS ON QUEUE
DSQFRSTP DS    A             POINTER TO FIRST ELEMENT
DSQBADBC EQU   X'80'           BACKWARD CHAIN IS INCORRECT
DSQLASTP DS    A             POINTER TO LAST ELEMENT
DSQBADFC EQU   X'80'           FORWARD CHAIN IS INCORRECT
DSQFDSP  DS    H             FORWARD POINTER DISPLACEMENT
DSQBDSP  DS    H             BACKWARD POINTER DISPLACEMENT
DSQPCPID DS    XL4           CELL POOL ID
DSQRIUTP DS    A             RIU TABLE ADDRESS
         MEND  ,
