         MACRO
         IHACSW  &DSECT=
* /* MACCOMP Y-2 SC1D0/SJD48            */
* /* MACSTAT Y-2 73124/021160           */
.* /* START OF SPECIFICATIONS ****
.*
.*01  MODULE-NAME = IHACSW
.*
.*01  COPYRIGHT = NONE
.*
.*01  STATUS = VS2 RELEASE 2 LEVEL 2
.*
.*01  DESCRIPTIVE-NAME = CHANNEL STATUS WORD
.*
.*01  FUNCTION = USED TO MAC THE CHANNEL STATUS WORD.
.*
.*01  MODULE-TYPE = MACRO
.*
.*02    MACRO-SIZE = NA FOR MAPPING MACRO
.*
.*02    PARAMETER-RECEIVED = DSECT
.*
.*03      TYPE = CHARACTER STRING.
.*
.*04        VALUE = 'YES' OR 'NO'.
.*
.*01  TABLES = NONE
.*
.*01  INNER-MACROS = NONE
.*
.*01  SYSTEM-MACROS = NONE
.*
.*01  CHANGE-ACTIVITY = SEE BELOW
.*    VS2 REL 2
.*       MACRO CREATED
.*
.*
.**** END OF SPECIFICATIONS ***/
*
* THIS DSECT DEFINES FIELDS AND ASSOCIATED FLAGS OF THE CHANNEL
* STATUS WORD.
* IF DSECT=YES IS CODED, A DSECT STATEMENT WILL BE EXPANDED. THE
* DEFAULT IS DSECT=YES.
*
* DESCRIPTIVE LAYOUT
*
*    _____________________________________________________
*    ×      ×                  ×            ×            ×
*    × PROT × ADDR OF LAST CCW × STATUS     × RESIDUAL   ×
*    × KEY  × EXECUTED + 8     × FLAGS      × COUNT      ×
*    ×______×__________________×____________×____________×
*
         AIF   ('&DSECT' EQ 'NO').NODSECT  IF DSECT=YES IS NOT CODED
.*                                           DO NOT GIVE DSECT STMT
         DSECT
.NODSECT ANOP
CSW      DS    0D                       BEGINNING BOUNDRY FOR CSW
CSWADDRA DS    0A                       SAME AS CSWADDRB BELOW
CSWKEY   DS    B                        PROTECTION KEY (BITS 4-7 ZERO)
CSWADDRB DS    AL3                      ADDR OF LAST CCW EXECUTED + 8
CSWSTATS DS    0H                       ENDING I/O STATUS BITS
CSWSTAT1 DS    B                        STATUS BYTE ONE (BITS 0-7)
CSWATTN  EQU   X'80'                    ATTENTION BIT
CSWSTMOD EQU   X'40'                    STATUS MODIFIER BIT
CSWCUEND EQU   X'20'                    CONTROL UNIT END BIT
CSWBUSY  EQU   X'10'                    BUSY BIT
CSWCHEND EQU   X'08'                    CHANNEL END BIT
CSWDVEND EQU   X'04'                    DEVICE END BIT
CSWUNCHK EQU   X'02'                    UNIT CHECK BIT
CSWUNEXP EQU   X'01'                    UNIT EXCEPTION BIT
CSWSTAT2 DS    B                        STATUS BYTE TWO (BITS 8-15)
CSWPCI   EQU   X'80'                    PGM CONTROLLED INTERRUPTION BIT
CSWINCOR EQU   X'40'                    INCORRECT LENGTH INDICATION BIT
CSWPGCHK EQU   X'20'                    PROGRAM CHECK BIT
CSWPRCHK EQU   X'10'                    PROTECTION CHECK BIT
CSWCDCHK EQU   X'08'                    CHANNEL DATA CHECK BIT
CSWCCCHK EQU   X'04'                    CHANNEL CONTROL CHECK BIT
CSWICCHK EQU   X'02'                    INTERFACE CONTROL CHECK BIT
CSWCHCHK EQU   X'01'                    CHAINING CHECK BIT
CSWBYTE  DS    H                        BYTE COUNT
         MEND
