         MACRO
&NAME    JCHECK &FILE=
.*
.*       GENERATES A CALL TO WORKFILE I/O MODULE CHECK ROUTINE
.*       TO ISSUE A CHECK FOR A STARTED I/O OPERATION.
.*
         AIF   (K'&FILE EQ 0).ERR1
&NAME    JINST LA,R10,&FILE,FILE
         L     R12,JMLC                 LOAD BASE
         BAL   R9,JCHECK(,R12)          GO TO JCHECK
         MEXIT
.ERR1    MNOTE 8,'PARAMETER ERROR.'
         MEND
