         MACRO
         SGIEW001  &VAL1=(9999*1024),&VAL2=(100*1024),&DPVAL=(44*1024)
.*
.* C210000,C270000,D330000-360000                               SA68152
.*
         LCLC  &EDNAME
.*
&EDNAME  SETC  ' F44'
         AIF   (&DPVAL EQ (44*1024)).NAMED     BC IF F44        SA68152
&EDNAME  SETC  ' F88'
         AIF   (&DPVAL EQ (88*1024)).NAMED    BC IF F88         SA68152
&EDNAME  SETC  'F128'
.*
.NAMED   ANOP
     TITLE 'IEWLMDEF   &EDNAME  EDITOR DEFAULT SIZE PARAMETERS'
IEWLMDEF CSECT
         DC    C'MDEF'         MODULE IDENTIFIER
         DC    AL4(&DPVAL)     DESIGN POINT VALUE
         DC    AL4(&VAL1)      DEFAULT VALUE 1
         DC    AL4(&VAL2)      DEFAULT VALUE 2
         DC    C'&EDNAME'      EDITOR NAME
         SPACE 1
.*
         MEND
