         TITLE 'IEECB901 - CN PROCESSOR FOR VARY COMMAND               *
                        '
IEECB901 CSECT ,                                                   0001
@MAINENT BALR  @15,0                                               0001
         USING *,@15                                               0001
         B     @PROLOG                                             0001
         DC    AL1(16)                                             0001
         DC    C'IEECB901  74.165'                                 0001
         DROP  @15
@PROLOG  STM   @14,@12,12(@13)                                     0001
         BALR  @11,0                                               0001
@PSTART  DS    0H                                                  0001
         USING @PSTART,@11                                         0001
         L     @00,@SIZDATD                                        0001
         GETMAIN  R,LV=(0)
         LR    @12,@01                                             0001
         USING @DATD,@12                                           0001
         ST    @13,@SA00001+4                                      0001
         LM    @00,@01,20(@13)                                     0001
         ST    @12,8(,@13)                                         0001
         LR    @13,@12                                             0001
         MVC   @PC00001(4),0(@01)                                  0001
*   REGPARM=REG1;                   /* SET UP PARM WORKREG PTR       */
         LR    REGPARM,REG1                                        0060
*   CALL SCANCN;                    /* GO PROCESS IT                 */
         BAL   @14,SCANCN                                          0061
*   RETURN;                                                        0062
@EL00001 L     @13,4(,@13)                                         0062
@EF00001 L     @00,@SIZDATD                                        0062
         LR    @01,@12                                             0062
         FREEMAIN R,LV=(0),A=(1)
@ER00001 LM    @14,@12,12(@13)                                     0062
         BR    @14                                                 0062
*SCANCN:                                                           0063
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);                               0063
*                                                                  0063
SCANCN   DS    0H                                                  0064
*   /*****************************************************************/
*   /*                                                               */
*   /* ENTRY IS TO PROCESS THE 'CN' PARAMETER VALUE(S) WHICH SPECIFY */
*   /* UNIQUE CONSOLE UCME(S). INPUT PTR - CONIDPTR - IS POINTING AT */
*   /* THE FIRST CHARACTER PAST THE LEFT PAREN. SUBROUTINES ARE      */
*   /* CALLED TO SCAN THE INPUT - AS FOLLOWS: ..DELIMSCN - INPUT     */
*   /* DELIMITER SCAN FOR COMMA, RIGHT PAREN. ..CONVRT - CONVERTS    */
*   /* VALID INPUT VALUE TO BINARY FOR SCAN OF UCME ARRAY BY         */
*   /* SUBROUTINE 'CONSCAN' . ..CONSCAN - LOCATES THE UCME OF THE    */
*   /* UNIQUE CONSOLE AND UPDATES THE AUTHORITY FIELD OF THE         */
*   /* SUBSYSTEM CONSOLE. NORMAL EXIT IS WHEN A RIGHT PAREN HAS BEEN */
*   /* SCANNED. RETURN TO CALLER. ERROR EXIT IS WHEN FIELD - MSGCODE */
*   /* - IS NON-ZERO. SET UP PARM LIST FOR MSG, CALL IEE0503D TO     */
*   /* ISSUE IT. IF END OF SCAN NOT COMPLETE, CONTINUE. ELSE, RETURN */
*   /* TO CALLER                                                     */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0064
*   SAVE1=REG14;                    /* SAVE RETURN ADDRESS           */
         ST    REG14,SAVE1                                         0064
*   SCANPTR=CONIDPTR;               /* PARM WORK PTR                 */
         L     SCANPTR,CONIDPTR(,REGPARM)                          0065
*   SPINPTR=ONE;                    /* SET LOOP INDICATOR            */
         LA    SPINPTR,1                                           0066
*   MSGCODE=ZERO;                   /* INIT ERROR CODE FIELD         */
         MVI   MSGCODE,X'00'                                       0067
*   DO WHILE(SPINPTR=ONE);                                         0068
         B     @DE00068                                            0068
@DL00068 DS    0H                                                  0069
*     CALL DELIMSCN;                /* PROCESS FOR COMMA, RPAREN     */
         BAL   @14,DELIMSCN                                        0069
*     CALL CONVRT;                  /* CONVERT VALUE FOR UCME SCAN   */
         BAL   @14,CONVRT                                          0070
*     CALL CONSCAN;                 /* SCAN UCME ARRAY, VALID CONSOLE*/
         BAL   @14,CONSCAN                                         0071
*     IF MSGCODE^=ZERO THEN         /* ERROR CONDITION               */
         CLI   MSGCODE,0                                           0072
         BE    @RF00072                                            0072
*       DO;                                                        0073
*         CALL MSGSETUP;            /* SET MSG VARIABLE              */
         BAL   @14,MSGSETUP                                        0074
*         CALL MSGRTN;              /* ISSUE WTO                     */
         BAL   @14,MSGRTN                                          0075
*         MSGCODE=ZERO;             /* RE-SET ERROR CONDITION        */
         MVI   MSGCODE,X'00'                                       0076
*       END;                                                       0077
*     IF SCANPTR->CHAR1=COMMA THEN  /* CONTINUATION DELIMITER        */
@RF00072 CLC   CHAR1(1,SCANPTR),COMMA                              0078
         BNE   @RF00078                                            0078
*       SCANPTR=SCANPTR+ONE;        /* BUMP PAST DELIMITER           */
         AL    SCANPTR,@CF00063                                    0079
*     ELSE                          /* END OF INPUT - RIGHT PAREN    */
*       SPINPTR=ZERO;               /* SET LOOP EXIT                 */
         B     @RC00078                                            0080
@RF00078 SLR   SPINPTR,SPINPTR                                     0080
*   END;                                                           0081
@RC00078 DS    0H                                                  0081
@DE00068 C     SPINPTR,@CF00063                                    0081
         BE    @DL00068                                            0081
*   REG14=SAVE1;                    /* RESTORE RETURN ADDRESS        */
         L     REG14,SAVE1                                         0082
*   END SCANCN;                                                    0083
@EL00002 DS    0H                                                  0083
@EF00002 DS    0H                                                  0083
@ER00002 BR    @14                                                 0083
*DELIMSCN:                                                         0084
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);                               0084
*                                                                  0084
DELIMSCN DS    0H                                                  0085
*   /*****************************************************************/
*   /*                                                               */
*   /* THIS SUBRTN DETERMINES THE LENGTH OF A CONSOLE ID, AS DEFINED */
*   /* BY THE DELIMITERS - COMMA, RIGHT PAREN. A COUNT FIELD - CNT , */
*   /* IS INCREMENTED UNTIL A DELIMITER IS SCANNED. RETURN TO CALLER.*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0085
*   CNT=ZERO;                       /* INIT COUNT FIELD              */
         MVI   CNT,X'00'                                           0085
*   DO WHILE(SCANPTR->CHAR1^=COMMA& /* DELIMITER COMMA               */
*         SCANPTR->CHAR1^=RPAREN);  /* DELIMITER RIGHT PAREN         */
         B     @DE00086                                            0086
@DL00086 DS    0H                                                  0087
*     CNT=CNT+ONE;                  /* INCREMENT COUNT FIELD         */
         LA    @09,1                                               0087
         SLR   @00,@00                                             0087
         IC    @00,CNT                                             0087
         ALR   @09,@00                                             0087
         STC   @09,CNT                                             0087
*     SCANPTR=SCANPTR+ONE;          /* INCREMENT SCAN PTR            */
         AL    SCANPTR,@CF00063                                    0088
*   END;                                                           0089
@DE00086 CLC   CHAR1(1,SCANPTR),COMMA                              0089
         BE    @DC00086                                            0089
         CLC   CHAR1(1,SCANPTR),RPAREN                             0089
         BNE   @DL00086                                            0089
@DC00086 DS    0H                                                  0090
*   END DELIMSCN;                                                  0090
@EL00003 DS    0H                                                  0090
@EF00003 DS    0H                                                  0090
@ER00003 BR    @14                                                 0090
*CONVRT:                                                           0091
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);                               0091
*                                                                  0091
CONVRT   DS    0H                                                  0092
*   /*****************************************************************/
*   /*                                                               */
*   /* CONVERT THE VALUE POINTED TO BY SCANPTR TO BINARY FOR USE IN  */
*   /* THE UCME SCAN RTN - CONSCAN.                                  */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0092
*   DCL                                                            0092
*     1 PAKAREA,                    /* AREA FOR PACK INSTRUCTION     */
*      2 HIBYTE CHAR(2),            /* TWO-BYTE VALUE FIELD          */
*       3 * CHAR(1),                                               0092
*       3 LOWBYTE CHAR(1);          /* ONE-BYTE VALUE                */
*   SAVE2=REG14;                    /* SAVE RETURN ADDRESS           */
         ST    REG14,SAVE2                                         0093
*   PAKAREA=ZERO;                   /* CLEAR AREA FOR PACK           */
         SLR   @09,@09                                             0094
         STCM  @09,3,PAKAREA                                       0094
*   MOVPTR=SCANPTR-CNT;             /* PTR TO BEGINNING OF VALUE     */
         LR    MOVPTR,SCANPTR                                      0095
         SLR   @09,@09                                             0095
         IC    @09,CNT                                             0095
         SLR   MOVPTR,@09                                          0095
*   IF CNT=ONE THEN                 /* ONE VALUE CONSOLE ID          */
         CLI   CNT,1                                               0096
         BNE   @RF00096                                            0096
*     LOWBYTE=MOVPTR->CHAR1;        /* INIT LOW BYTE OF PACK AREA    */
         MVC   LOWBYTE(1),CHAR1(MOVPTR)                            0097
*   ELSE                            /* TWO VALUE CONSOLE ID          */
*     HIBYTE=MOVPTR->CHAR2;         /* INIT PACK AREA                */
         B     @RC00096                                            0098
@RF00096 MVC   HIBYTE(2),CHAR2(MOVPTR)                             0098
*   PACK(PAKAREA,PAKAREA);          /* CONVERT TO PACKED NUM         */
@RC00096 PACK  PAKAREA(2),PAKAREA(2)                               0099
*   CVB(CONID,PAKAREA);             /* CONVERT TO BINARY             */
         XC    @TS00001(8),@TS00001                                0100
         MVC   @TS00001+6(2),PAKAREA                               0100
         CVB   @09,@TS00001                                        0100
         STC   @09,CONID                                           0100
*   REG14=SAVE2;                    /* RESTORE RETURN ADDRESS        */
         L     REG14,SAVE2                                         0101
*   END CONVRT;                                                    0102
@EL00004 DS    0H                                                  0102
@EF00004 DS    0H                                                  0102
@ER00004 BR    @14                                                 0102
*CONSCAN:                                                          0103
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);                               0103
*                                                                  0103
CONSCAN  DS    0H                                                  0104
*   /*****************************************************************/
*   /*                                                               */
*   /* ENTRY HERE IS TO PROCESS A UNIQUE SUBSYSTEM CONSOLE ID. THE   */
*   /* CONSOLE ID IS VALIDITY CHECKED FOR - GREATER THAN ZERO, NOT   */
*   /* GREATER THAN THE LAST UCME PTR ON THE CHAIN. IF INVALID, NO   */
*   /* UPDATES ARE MADE, MSG CODES ARE SET TO ISSUE APPROPRIATE      */
*   /* MESSAGE. IF VALID, THE UPDATE TO THE CONSOLE AUTHORITY FIELD  */
*   /* IS MADE. RETURN TO CALLER.                                    */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0104
*   IF CONID>ZERO THEN              /* CONSOLE ID NOT ZERO           */
         CLI   CONID,0                                             0104
         BNH   @RF00104                                            0104
*     DO;                                                          0105
*       UCMEPTR=UCMVEA+(UCMVEZ*(CONID-ONE));/* OBTAIN CONSOLE UCME 0106
*                                      ADDRESS                       */
         L     @07,CVTPTR                                          0106
         L     @07,UCMBASPT(,@07)                                  0106
         SLR   UCMEPTR,UCMEPTR                                     0106
         IC    UCMEPTR,CONID                                       0106
         BCTR  UCMEPTR,0                                           0106
         LR    @05,UCMEPTR                                         0106
         M     @04,UCMVEZ(,@07)                                    0106
         AL    @05,UCMVEA(,@07)                                    0106
         LR    UCMEPTR,@05                                         0106
*       IF UCMEPTR>UCMVEL THEN      /* INVALID UCME PTR ?            */
         C     UCMEPTR,UCMVEL(,@07)                                0107
         BNH   @RF00107                                            0107
*         MSGCODE=MSG13;            /* SET UP MSG IEE313I            */
         MVI   MSGCODE,X'0D'                                       0108
*       ELSE                        /* VALID UCME PTR                */
*         IF UCMDISPA^='1'B THEN    /* NOT MASTER CONSOLE ?          */
         B     @RC00107                                            0109
@RF00107 TM    UCMDISPA(UCMEPTR),B'10000000'                       0109
         BO    @RF00109                                            0109
*           DO;                                                    0110
*             COMPCODE=ONE;         /* SET SWITCH FOR CALLER ISSUE 0111
*                                      IEE712I MSG                   */
         MVI   COMPCODE(REGPARM),X'01'                             0111
*             UCMAUTHA=AUTHMASK;    /* UPDATE CONSOLE AUTHORITY      */
         MVC   UCMAUTHA(1,UCMEPTR),AUTHMASK(REGPARM)               0112
*           END;                                                   0113
*         ELSE                      /* MASTER CONSOLE , ERROR        */
*           MSGCODE=MSG13;          /* SET UP MSG IEE313I            */
         B     @RC00109                                            0114
@RF00109 MVI   MSGCODE,X'0D'                                       0114
*     END;                                                         0115
*   ELSE                            /* INVALID CONSOLE ID            */
*     MSGCODE=MSG13;                /* SET UP MSG IEE313I            */
         B     @RC00104                                            0116
@RF00104 MVI   MSGCODE,X'0D'                                       0116
*   END CONSCAN;                                                   0117
@EL00005 DS    0H                                                  0117
@EF00005 DS    0H                                                  0117
@ER00005 BR    @14                                                 0117
*MSGSETUP:                                                         0118
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);                               0118
*                                                                  0118
MSGSETUP DS    0H                                                  0119
*   /*****************************************************************/
*   /*                                                               */
*   /* ENTRY IS TO PROCESS MESSAGE AREA VARIABLE FIELD - VERBNAME.   */
*   /* FOR MSGCODE = IEE313I, VERBNAME = 'CN(XX) ' , WHERE 'XX' IS   */
*   /* THE ID OF A UNIQUE CONSOLE. THE FIELD IS FORMATED - CN(00) ,  */
*   /* AND THE PARENTHEZIED VALUE(S) ARE OVERLAID WITH THE UNPACKED  */
*   /* VERSION OF THE CONSOLE ID.THE PTRS AND VALUES FOR THESE FIELDS*/
*   /* ARE SET UP IN SUBRTN CONVRT, AND ARE STILL AVAILABLE TO THIS  */
*   /* SUBRTN. INITIALIZE VARIABLE 'VERBNAME', RETURN TO CALLER      */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0119
*   VERBNAME=CNFILL;                /* INIT 'CN(0 ) '                */
         MVC   VERBNAME(8),CNFILL                                  0119
*   IF CNT=ONE THEN                 /* ONE VALUE CONSOLE ID          */
         CLI   CNT,1                                               0120
         BNE   @RF00120                                            0120
*     CNID=MOVPTR->CHAR1;           /* MOVE IN SINGLE VALUE          */
         MVC   CNID(1),CHAR1(MOVPTR)                               0121
*   ELSE                            /* TWO VALUE CONSOLE ID          */
*     CNID1=MOVPTR->CHAR2;          /* MOVE IN TWO VALUES            */
         B     @RC00120                                            0122
@RF00120 MVC   CNID1(2),CHAR2(MOVPTR)                              0122
*   END MSGSETUP;                                                  0123
@EL00006 DS    0H                                                  0123
@EF00006 DS    0H                                                  0123
@ER00006 BR    @14                                                 0123
*MSGRTN:                                                           0124
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);                               0124
*                                                                  0124
MSGRTN   DS    0H                                                  0125
*   /*****************************************************************/
*   /*                                                               */
*   /* SET UP TO ISSUE MESSAGES VIA MODULE IEE0503D, WHICH MAPS INPUT*/
*   /* TO THE XSA MAPPING MACRO. SET WORKAREA BASED ON XSA, CLEAR    */
*   /* CORE, AND INITIALIZE THE PARM LIST AND CALL MESSAGE MODULE. NO*/
*   /* RETURN CODE EXPECTED - RETURN TO CALLER.                      */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0125
*   DCL                                                            0125
*     MSGMOD ENTRY BASED(REG15);    /* ENTRY TO ESTABLISH CALL     0125
*                                      CAPABILITY TO MSG MODULE ADDR */
*   DCL                                                            0126
*     XSAPTR PTR(31) REGISTER(2);   /* XSA MAPPING PTR               */
*   RFY                                                            0127
*    (REG0,                                                        0127
*     XSAPTR) RESTRICTED;                                          0127
*   SAVE2=REG14;                    /* SAVE RETURN ADDRESS           */
         ST    REG14,SAVE2                                         0128
*   REG2=MSGAPTR;                   /* PTR TO PARM LIST CORE         */
         L     REG2,MSGAPTR(,REGPARM)                              0129
*   REG0=LENGTH(XASVRB);            /* LENGTH OF CORE TO CLEAR       */
         LA    REG0,48                                             0130
*   XSAMAP(1:REG0)=XSAMAP(1:REG0)&&XSAMAP(1:REG0);/* CLEAR CORE      */
         LR    @09,REG0                                            0131
         BCTR  @09,0                                               0131
         EX    @09,@SX01248                                        0131
*   XAE=MSGCODE;                    /* PTR TO APPROPRIATE MSG        */
         MVC   XAE(1,XSAPTR),MSGCODE                               0132
*   XAV=VERBNAME;                   /* FILLER FOR MSG                */
         MVC   XAV(8,XSAPTR),VERBNAME                              0133
*   XAU=CHUCMP;                     /* CONSOLE ID OF ISSUER          */
         L     @09,CSCBPTR(,REGPARM)                               0134
         MVC   XAU(1,XSAPTR),CHUCMP(@09)                           0134
*   REG15=MSGMPTR;                  /* ADDRESS OF IEE0503D           */
         L     REG15,MSGMPTR(,REGPARM)                             0135
*   GEN( STM   0,5,12(13));         /* SAVE REGS FOR RETURN          */
          STM   0,5,12(13)
*   CALL MSGMOD;                    /* ISSUE WTO                     */
         BALR  @14,@15                                             0137
*   GEN( LM    0,5,12(13));         /* RESTORE SAVED REGS            */
          LM    0,5,12(13)
*   REG14=SAVE2;                    /* RESTORE RETURN ADDRESS        */
         L     REG14,SAVE2                                         0139
*   RFY                                                            0140
*    (REG0,                                                        0140
*     XSAPTR) UNRESTRICTED;                                        0140
*   END MSGRTN;                                                    0141
@EL00007 DS    0H                                                  0141
@EF00007 DS    0H                                                  0141
@ER00007 BR    @14                                                 0141
*   END IEECB901                                                   0142
*                                                                  0142
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */
*/*%INCLUDE SYSLIB  (CVT     )                                       */
*/*%INCLUDE SYSLIB  (IEECUCM )                                       */
*/*%INCLUDE SYSLIB  (IEEXSA  )                                       */
*/*%INCLUDE SYSLIB  (IEECHAIN)                                       */
*                                                                  0142
*       ;                                                          0142
@DATA    DS    0H
@SX01248 XC    XSAMAP(0,XSAPTR),XSAMAP(XSAPTR)
@DATD    DSECT
         DS    0F
@SA00001 DS    18F
@PC00001 DS    1F
IEECB901 CSECT
         DS    0F
@CF00063 DC    F'1'
@DATD    DSECT
         DS    0D
MSGCODE  DS    AL1
CONID    DS    AL1
CNT      DS    AL1
         DS    0D
@TS00001 DS    CL8
SAVPTRS  DS    CL8
         ORG   SAVPTRS
SAVE1    DS    AL4
SAVE2    DS    AL4
         ORG   SAVPTRS+8
VERBNAME DS    CL8
         ORG   VERBNAME
CNVAL    DS    CL3
CNID1    DS    CL2
         ORG   CNID1
@NM00019 DS    CL1
CNID     DS    CL1
         ORG   VERBNAME+5
@NM00020 DS    CL3
         ORG   VERBNAME+8
PAKAREA  DS    CL2
         ORG   PAKAREA
HIBYTE   DS    CL2
         ORG   HIBYTE
@NM00021 DS    CL1
LOWBYTE  DS    CL1
         ORG   PAKAREA+2
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA
@ENDDATD EQU   *
IEECB901 CSECT
         DS    0F
@SIZDATD DC    AL1(0)
         DC    AL3(@ENDDATD-@DATD)
         DS    0D
COMMA    DC    CL1','
RPAREN   DC    CL1')'
PATCH    DC    CL30'IEECB901'
CNFILL   DC    CL8'CN(0 )  '
@00      EQU   00                      EQUATES FOR REGISTERS 0-15
@01      EQU   01
@02      EQU   02
@03      EQU   03
@04      EQU   04
@05      EQU   05
@06      EQU   06
@07      EQU   07
@08      EQU   08
@09      EQU   09
@10      EQU   10
@11      EQU   11
@12      EQU   12
@13      EQU   13
@14      EQU   14
@15      EQU   15
SCANPTR  EQU   @08
SPINPTR  EQU   @10
UCMEPTR  EQU   @09
MOVPTR   EQU   @06
XSAPTR   EQU   @02
REG0     EQU   @00
REG1     EQU   @01
REG2     EQU   @02
REGPARM  EQU   @03
REG14    EQU   @14
REG15    EQU   @15
REG13    EQU   @13
CVTPTR   EQU   16
CVTMAP   EQU   0
CVTDAR   EQU   CVTMAP+72
CVTFLGS1 EQU   CVTDAR
CVTCUCB  EQU   CVTMAP+100
CVTDCB   EQU   CVTMAP+116
CVTIERLC EQU   CVTMAP+144
CVTOPTA  EQU   CVTMAP+182
CVTOPTB  EQU   CVTMAP+183
CVTGTF   EQU   CVTMAP+236
CVTGTFST EQU   CVTGTF
CVTGTFS  EQU   CVTGTFST
CVTSTATE EQU   CVTGTFST
CVTTMODE EQU   CVTGTFST
CVTFORM  EQU   CVTGTFST
CVTAQAVT EQU   CVTMAP+240
CVTTCMFG EQU   CVTAQAVT
CVTVOLM2 EQU   CVTMAP+244
CVTTATA  EQU   CVTVOLM2
CVTTSKS  EQU   CVTTATA
CVTVOLF2 EQU   CVTTSKS
CVTTAT   EQU   CVTTATA+1
CVTATER  EQU   CVTMAP+248
CVTEXT1  EQU   CVTMAP+252
CVTPURG  EQU   CVTMAP+260
CVTQMSG  EQU   CVTMAP+268
CVTDMSR  EQU   CVTMAP+272
CVTERPV  EQU   CVTMAP+316
CVTINTLA EQU   CVTMAP+320
CVTAPF   EQU   CVTMAP+324
CVTEXT2  EQU   CVTMAP+328
CVTHJES  EQU   CVTMAP+332
CVTPGSIA EQU   CVTMAP+348
CVTA1F1  EQU   CVTMAP+356
CVTSYSK  EQU   CVTMAP+357
CVTVOLM1 EQU   CVTMAP+380
CVTVOLF1 EQU   CVTVOLM1
CVTATMCT EQU   CVTMAP+388
CVTXTNT1 EQU   0
CVTXTNT2 EQU   0
CVTDSSV  EQU   CVTXTNT2
CVTFLGBT EQU   CVTXTNT2+5
CVTQID   EQU   CVTXTNT2+24
CVTRV400 EQU   CVTXTNT2+52
CVTRV409 EQU   CVTXTNT2+53
CVTATCVT EQU   CVTXTNT2+64
CVTRV429 EQU   CVTXTNT2+84
CVTRV438 EQU   CVTXTNT2+85
CVTRV457 EQU   CVTXTNT2+112
CVTRV466 EQU   CVTXTNT2+113
CVTFIX   EQU   0
CVTRELNO EQU   CVTFIX+252
UCM2EXT  EQU   0
UCM2STA  EQU   UCM2EXT+8
UCM2SFLG EQU   UCM2STA
UCMPRFX  EQU   0
UCMSAVE0 EQU   UCMPRFX+4
UCMSFLGS EQU   UCMPRFX+84
UCMSFLG1 EQU   UCMSFLGS
UCMSFLG2 EQU   UCMSFLGS+1
UCMXSA   EQU   UCMPRFX+104
UCMSDS1  EQU   UCMPRFX+156
UCM2PTR  EQU   0
UCMPRFXP EQU   0
UCM      EQU   0
UCMDECB  EQU   UCM+12
UCMLSTP  EQU   UCM+20
UCMRPYI  EQU   UCM+32
UCMPXB   EQU   UCM+68
UCMMODE  EQU   UCMPXB
UCMVDATA EQU   UCM+72
UCMVEA   EQU   UCMVDATA
UCMVEZ   EQU   UCMVDATA+4
UCMVEL   EQU   UCMVDATA+8
UCMRSV42 EQU   UCM+300
UCMRSV51 EQU   UCM+301
UCMEIL   EQU   0
UCMRECBA EQU   UCMEIL+24
UCMEXIT  EQU   0
UCMUEWPT EQU   0
UCMLIST  EQU   0
UCMSTS   EQU   UCMLIST+24
UCMATR   EQU   UCMLIST+25
UCMXA    EQU   UCMLIST+26
UCMAUTH  EQU   UCMLIST+40
UCMAUTHA EQU   UCMAUTH
UCMDISP  EQU   UCMLIST+42
UCMDISP1 EQU   UCMDISP
UCMDISPA EQU   UCMDISP1
UCMDISP2 EQU   UCMDISP+1
UCMMSG   EQU   UCMLIST+60
UCMMSG1  EQU   UCMMSG
UCMDEVC  EQU   UCMLIST+63
UCMRCT   EQU   UCMLIST+68
UCMSDS5  EQU   UCMRCT
XSAMAP   EQU   0
XASVRB   EQU   XSAMAP
XSA      EQU   XASVRB
XAX      EQU   XASVRB+8
@NM00006 EQU   XASVRB+16
XAE      EQU   @NM00006
@NM00007 EQU   XASVRB+20
XAV      EQU   XASVRB+24
XAS      EQU   XASVRB+32
XAU      EQU   XASVRB+40
EEXSAS01 EQU   0
EEXSAS02 EQU   0
XASDS    EQU   EEXSAS02+2
@NM00012 EQU   EEXSAS02+4
EEXSAS03 EQU   0
XAXMASK  EQU   EEXSAS03
CHAIN    EQU   0
CHFLG    EQU   CHAIN+4
CHSTS    EQU   CHFLG+2
CHACT    EQU   CHFLG+3
CHKEY    EQU   CHAIN+8
CHPKE    EQU   CHAIN+28
CHUCMP   EQU   CHAIN+29
CHTJID   EQU   CHAIN+30
CHPROCSN EQU   CHAIN+32
CHACT1   EQU   CHPROCSN+3
CHASM    EQU   CHAIN+40
CHCIBP   EQU   CHASM+4
CHRGNSZ  EQU   CHASM+8
CHSTEP   EQU   CHASM+24
CHSWT    EQU   CHSTEP
CHSHORT  EQU   CHASM+32
CHAR1    EQU   0
CHAR2    EQU   0
PARMAP   EQU   0
CONIDPTR EQU   PARMAP
CSCBPTR  EQU   PARMAP+4
MSGMPTR  EQU   PARMAP+8
MSGAPTR  EQU   PARMAP+12
AUTHMASK EQU   PARMAP+16
COMPCODE EQU   PARMAP+17
MSGMOD   EQU   0
MSGAREA  EQU   0
PARM     EQU   0
CVTS01   EQU   CVTPGSIA
CVTLPDIA EQU   CVTS01+12
CVTDIRST EQU   CVTLPDIA
CVTSLIDA EQU   CVTS01+24
CVTCTLFG EQU   CVTS01+50
CVTRV210 EQU   CVTS01+424
CVTRV219 EQU   CVTS01+425
CVTRV228 EQU   CVTS01+426
CVTRV237 EQU   CVTS01+427
CVTMFRTR EQU   CVTS01+452
CVTRV262 EQU   CVTS01+468
CVTRV271 EQU   CVTS01+469
CVTRV280 EQU   CVTS01+470
CVTRV289 EQU   CVTS01+471
CVTGSDA  EQU   CVTS01+600
UCMEXTPT EQU   UCM2PTR
UCMMCSPT EQU   UCMPRFXP
UCMBASPT EQU   CVTCUCB
UCMEILPT EQU   UCMLSTP
UCMIECBA EQU   UCMRECBA+4
UCMDVEPT EQU   UCMVEA
CHAINS01 EQU   CHASM
CHTYPE   EQU   CHAINS01+124
CHTRSTAT EQU   CHAINS01+125
CHCSYSO  EQU   CHAINS01+134
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS
CHLAST   EQU   CHAINS01+136
CHSPA    EQU   CHAINS01+135
CHUSERID EQU   CHCSYSO
CHJB     EQU   CHCSYSO
CHDUMP   EQU   CHCSYSO
CHQUE    EQU   CHCSYSO
CHHOLD   EQU   CHCSYSO
CHOUT    EQU   CHCSYSO
CHINN    EQU   CHCSYSO
CHALL    EQU   CHCSYSO
CHINC    EQU   CHAINS01+132
CHPEND   EQU   CHAINS01+128
CHARID   EQU   CHAINS01+127
CHCNID   EQU   CHAINS01+126
@NM00018 EQU   CHTRSTAT
CHTSL    EQU   CHTRSTAT
CHTS     EQU   CHTRSTAT
CHINITL  EQU   CHTRSTAT
CHINIT   EQU   CHTRSTAT
CHJOBSL  EQU   CHTRSTAT
CHJOBS   EQU   CHTRSTAT
CHDEF    EQU   CHTYPE
CHHIAR   EQU   CHTYPE
CHARSV29 EQU   CHTYPE
CHARSV28 EQU   CHTYPE
CHARSV27 EQU   CHTYPE
CHARSV26 EQU   CHTYPE
CHARSV25 EQU   CHTYPE
CHDSTAT  EQU   CHTYPE
CHBUF    EQU   CHAINS01
UCMIECBP EQU   UCMIECBA+1
UCMIECBF EQU   UCMIECBA
CVTRV628 EQU   CVTS01+728
CVTRV627 EQU   CVTS01+724
CVTRV626 EQU   CVTS01+720
CVTRV625 EQU   CVTS01+716
CVTRV624 EQU   CVTS01+712
CVTRV623 EQU   CVTS01+708
CVTRV622 EQU   CVTS01+704
CVTRV621 EQU   CVTS01+700
CVTRV620 EQU   CVTS01+696
CVTRV619 EQU   CVTS01+692
CVTRV618 EQU   CVTS01+688
CVTRV617 EQU   CVTS01+684
CVTRV616 EQU   CVTS01+680
CVTRV615 EQU   CVTS01+676
CVTRV614 EQU   CVTS01+672
CVTRV613 EQU   CVTS01+668
CVTRV612 EQU   CVTS01+664
CVTRV611 EQU   CVTS01+660
CVTRV610 EQU   CVTS01+656
CVTRV609 EQU   CVTS01+652
CVTRV608 EQU   CVTS01+648
CVTRV607 EQU   CVTS01+644
CVTRV606 EQU   CVTS01+640
CVTRV605 EQU   CVTS01+636
CVTRV604 EQU   CVTS01+632
CVTRV603 EQU   CVTS01+628
CVTRV602 EQU   CVTS01+624
CVTSSCR  EQU   CVTS01+620
CVTEVENT EQU   CVTS01+616
CVTCRCA  EQU   CVTS01+612
CVTTPIO  EQU   CVTS01+608
CVTADV   EQU   CVTS01+604
CVTGSDAB EQU   CVTGSDA
CVTQV3   EQU   CVTS01+596
CVTQV2   EQU   CVTS01+592
CVTQV1   EQU   CVTS01+588
CVTRPT   EQU   CVTS01+584
CVTSSRB  EQU   CVTS01+580
CVTCSDRL EQU   CVTS01+576
CVTEXP1  EQU   CVTS01+572
CVTRMPMT EQU   CVTS01+568
CVTRMPTT EQU   CVTS01+564
CVTVPSA  EQU   CVTS01+560
CVTVSTOP EQU   CVTS01+556
CVTGTFR8 EQU   CVTS01+552
CVTQUIT  EQU   CVTS01+548
CVTVACR  EQU   CVTS01+544
CVTWTCB  EQU   CVTS01+540
CVTSTPRS EQU   CVTS01+536
CVT0PT02 EQU   CVTS01+532
CVTDARCM EQU   CVTS01+528
CVTIRECM EQU   CVTS01+524
CVTJRECM EQU   CVTS01+520
CVTVEMS0 EQU   CVTS01+516
CVTSPFRR EQU   CVTS01+512
CVTRLSTG EQU   CVTS01+508
CVT0TC0A EQU   CVTS01+504
CVTGMBR  EQU   CVTS01+500
CVTLFRM  EQU   CVTS01+496
CVTRMBR  EQU   CVTS01+492
CVTVIOP  EQU   CVTS01+488
CVTRV307 EQU   CVTS01+486
CVTRV306 EQU   CVTS01+484
CVTRV305 EQU   CVTS01+482
CVTRV304 EQU   CVTS01+480
CVTRV303 EQU   CVTS01+478
CVTRV302 EQU   CVTS01+476
CVTRV301 EQU   CVTS01+475
CVTRV300 EQU   CVTS01+474
CVTRV299 EQU   CVTS01+473
CVTRV298 EQU   CVTS01+472
CVTRV297 EQU   CVTRV289
CVTRV296 EQU   CVTRV289
CVTRV295 EQU   CVTRV289
CVTRV294 EQU   CVTRV289
CVTRV293 EQU   CVTRV289
CVTRV292 EQU   CVTRV289
CVTRV291 EQU   CVTRV289
CVTRV290 EQU   CVTRV289
CVTRV288 EQU   CVTRV280
CVTRV287 EQU   CVTRV280
CVTRV286 EQU   CVTRV280
CVTRV285 EQU   CVTRV280
CVTRV284 EQU   CVTRV280
CVTRV283 EQU   CVTRV280
CVTRV282 EQU   CVTRV280
CVTRV281 EQU   CVTRV280
CVTRV279 EQU   CVTRV271
CVTRV278 EQU   CVTRV271
CVTRV277 EQU   CVTRV271
CVTRV276 EQU   CVTRV271
CVTRV275 EQU   CVTRV271
CVTRV274 EQU   CVTRV271
CVTRV273 EQU   CVTRV271
CVTRV272 EQU   CVTRV271
CVTRV270 EQU   CVTRV262
CVTRV269 EQU   CVTRV262
CVTRV268 EQU   CVTRV262
CVTRV267 EQU   CVTRV262
CVTRV266 EQU   CVTRV262
CVTRV265 EQU   CVTRV262
CVTRV264 EQU   CVTRV262
CVTRV263 EQU   CVTRV262
CVTVFP   EQU   CVTS01+464
CVTVSI   EQU   CVTS01+460
CVTVPSIB EQU   CVTS01+456
CVTMFACT EQU   CVTMFRTR
CVTMFCTL EQU   CVTS01+448
CVTPVBP  EQU   CVTS01+444
CVTPWI   EQU   CVTS01+440
CVTRV254 EQU   CVTS01+438
CVTRV253 EQU   CVTS01+436
CVTRV252 EQU   CVTS01+434
CVTRV251 EQU   CVTS01+433
CVTRV250 EQU   CVTS01+432
CVTRV249 EQU   CVTS01+431
CVTRV248 EQU   CVTS01+430
CVTRV247 EQU   CVTS01+429
CVTRV246 EQU   CVTS01+428
CVTRV245 EQU   CVTRV237
CVTRV244 EQU   CVTRV237
CVTRV243 EQU   CVTRV237
CVTRV242 EQU   CVTRV237
CVTRV241 EQU   CVTRV237
CVTRV240 EQU   CVTRV237
CVTRV239 EQU   CVTRV237
CVTRV238 EQU   CVTRV237
CVTRV236 EQU   CVTRV228
CVTRV235 EQU   CVTRV228
CVTRV234 EQU   CVTRV228
CVTRV233 EQU   CVTRV228
CVTRV232 EQU   CVTRV228
CVTRV231 EQU   CVTRV228
CVTRV230 EQU   CVTRV228
CVTRV229 EQU   CVTRV228
CVTRV227 EQU   CVTRV219
CVTRV226 EQU   CVTRV219
CVTRV225 EQU   CVTRV219
CVTRV224 EQU   CVTRV219
CVTRV223 EQU   CVTRV219
CVTRV222 EQU   CVTRV219
CVTRV221 EQU   CVTRV219
CVTRV220 EQU   CVTRV219
CVTRV218 EQU   CVTRV210
CVTRV217 EQU   CVTRV210
CVTRV216 EQU   CVTRV210
CVTRV215 EQU   CVTRV210
CVTRV214 EQU   CVTRV210
CVTRV213 EQU   CVTRV210
CVTRV212 EQU   CVTRV210
CVTRV211 EQU   CVTRV210
CVTLCCAT EQU   CVTS01+420
CVTPCCAT EQU   CVTS01+416
CVTIPCRP EQU   CVTS01+412
CVTIPCRI EQU   CVTS01+408
CVTIPCDS EQU   CVTS01+404
CVTAIDVT EQU   CVTS01+400
CVTSSAP  EQU   CVTS01+396
CVTEHCIR EQU   CVTS01+392
CVTEHDEF EQU   CVTS01+388
CVTDAIR  EQU   CVTS01+384
CVTPERFM EQU   CVTS01+380
CVT044R2 EQU   CVTS01+376
CVTFETCH EQU   CVTS01+372
CVTRSTWD EQU   CVTS01+368
CVTSPOST EQU   CVTS01+364
CVTIOBP  EQU   CVTS01+360
CVTASMVT EQU   CVTS01+356
CVTRECRQ EQU   CVTS01+352
CVTWSAC  EQU   CVTS01+348
CVTRV149 EQU   CVTS01+344
CVTWSAL  EQU   CVTS01+340
CVTSPSA  EQU   CVTS01+336
CVTGLMN  EQU   CVTS01+332
CVTVEAC0 EQU   CVTS01+328
CVT062R1 EQU   CVTS01+324
CVTRPOST EQU   CVTS01+320
CVTDQIQE EQU   CVTS01+316
CVTCSD   EQU   CVTS01+312
CVTLKRMA EQU   CVTS01+308
CVTRSPIE EQU   CVTS01+304
CVTRENQ  EQU   CVTS01+300
CVTLQCB  EQU   CVTS01+296
CVTFQCB  EQU   CVTS01+292
CVTQCS01 EQU   CVTS01+288
CVTAPFT  EQU   CVTS01+284
CVTPARRL EQU   CVTS01+280
CVTVWAIT EQU   CVTS01+276
CVTGSPL  EQU   CVTS01+272
CVTLSMQ  EQU   CVTS01+268
CVTGSMQ  EQU   CVTS01+264
CVTEXPRO EQU   CVTS01+260
CVTOPCTP EQU   CVTS01+256
CVTSIC   EQU   CVTS01+252
CVTTPIOS EQU   CVTS01+248
CVTRTMS  EQU   CVTS01+244
CVTSDBF  EQU   CVTS01+240
CVTSCBP  EQU   CVTS01+236
CVTSDMP  EQU   CVTS01+232
CVTSV60  EQU   CVTS01+228
CVTRTMCT EQU   CVTS01+224
CVTASCBL EQU   CVTS01+220
CVTASCBH EQU   CVTS01+216
CVTGDA   EQU   CVTS01+212
CVTASVT  EQU   CVTS01+208
CVTVVMDI EQU   CVTS01+204
CVTAQTOP EQU   CVTS01+200
CVTIOSCS EQU   CVTS01+196
CVTSDRM  EQU   CVTS01+192
CVTOPTE  EQU   CVTS01+188
CVTSTXU  EQU   CVTS01+184
CVTQUIS  EQU   CVTS01+180
CVTPARS  EQU   CVTS01+176
CVTS1EE  EQU   CVTS01+172
CVTFRAS  EQU   CVTS01+168
CVTQSAS  EQU   CVTS01+164
CVTCRAS  EQU   CVTS01+160
CVTCRMN  EQU   CVTS01+156
CVTDELCP EQU   CVTS01+152
CVTFRECL EQU   CVTS01+148
CVTGETCL EQU   CVTS01+144
CVTBLDCP EQU   CVTS01+140
CVTAUTHL EQU   CVTS01+136
CVTSCAN  EQU   CVTS01+132
CVTRV144 EQU   CVTS01+130
CVTMAXMP EQU   CVTS01+128
CVTSTCK  EQU   CVTS01+124
CVTRV139 EQU   CVTS01+123
CVTDSSAC EQU   CVTS01+122
CVTRV513 EQU   CVTS01+121
CVTIOSPL EQU   CVTS01+120
CVTPTGT  EQU   CVTS01+116
CVTCSPIE EQU   CVTS01+112
CVTSMFEX EQU   CVTS01+108
CVTOLT0A EQU   CVTS01+104
CVTSRBRT EQU   CVTS01+100
CVTPUTL  EQU   CVTS01+96
CVTRV519 EQU   CVTS01+92
CVTRV327 EQU   CVTS01+88
CVTRV326 EQU   CVTS01+84
CVTRV325 EQU   CVTS01+80
CVTRV324 EQU   CVTS01+76
CVT0VL01 EQU   CVTS01+72
CVTSHRVM EQU   CVTS01+68
CVTRV332 EQU   CVTS01+64
CVTTAS   EQU   CVTS01+60
CVTRSCN  EQU   CVTS01+56
CVTTRAC2 EQU   CVTS01+54
CVTTRACE EQU   CVTS01+52
CVTAPG   EQU   CVTS01+51
CVTSDTRC EQU   CVTCTLFG
CVTGTRCE EQU   CVTCTLFG
CVTNOMP  EQU   CVTCTLFG
CVTRSV79 EQU   CVTCTLFG
CVTDSTAT EQU   CVTCTLFG
CVTRSV78 EQU   CVTCTLFG
CVTRV333 EQU   CVTCTLFG
CVTRV323 EQU   CVTCTLFG
CVTSPVLK EQU   CVTS01+49
CVTRSV77 EQU   CVTS01+48
CVTRV331 EQU   CVTS01+44
CVTRV330 EQU   CVTS01+40
CVTRV329 EQU   CVTS01+36
CVTRV328 EQU   CVTS01+32
CVTRV322 EQU   CVTS01+28
CVTSLID  EQU   CVTSLIDA+1
CVTSYLK  EQU   CVTSLIDA
CVTRV321 EQU   CVTS01+20
CVTRV320 EQU   CVTS01+16
CVTLPDIR EQU   CVTLPDIA+1
CVTRSV69 EQU   CVTDIRST
CVTRSV68 EQU   CVTDIRST
CVTRSV67 EQU   CVTDIRST
CVTRSV66 EQU   CVTDIRST
CVTRSV65 EQU   CVTDIRST
CVTRSV64 EQU   CVTDIRST
CVTRSV63 EQU   CVTDIRST
CVTDICOM EQU   CVTDIRST
CVTPVTP  EQU   CVTS01+8
CVTLPDSR EQU   CVTS01+4
CVTGETL  EQU   CVTS01
CHARSV16 EQU   CHSHORT+100
CHARSV15 EQU   CHSHORT+96
CHJSCBVS EQU   CHSHORT+92
CHUSCVS  EQU   CHSHORT+88
@NM00017 EQU   CHSHORT+84
@NM00016 EQU   CHSHORT+80
CHSQA    EQU   CHSHORT+44
CHQPA    EQU   CHSHORT+8
CHJCL    EQU   CHSHORT+4
CHSPC    EQU   CHSHORT
CHSPB    EQU   CHSTEP+4
CHTCB    EQU   CHSTEP+1
CHARSV23 EQU   CHSWT
CHARSV22 EQU   CHSWT
CHARSV21 EQU   CHSWT
CHAC     EQU   CHSWT
CHPSF    EQU   CHSWT
CHPSD    EQU   CHSWT
CHJCT    EQU   CHSWT
CHARSV20 EQU   CHSWT
CHCECB   EQU   CHASM+20
CHECB    EQU   CHASM+16
CHRGNAD  EQU   CHASM+12
CHARSV18 EQU   CHRGNSZ+1
CHRPRTY  EQU   CHRGNSZ
@NM00015 EQU   CHCIBP
CHEND    EQU   CHCIBP
CHECBP   EQU   CHASM
CHDER    EQU   CHPROCSN+4
CHARSV10 EQU   CHACT1
CHARSV09 EQU   CHACT1
CHARSV08 EQU   CHACT1
CHARSV07 EQU   CHACT1
CHARSV06 EQU   CHACT1
CHARSV05 EQU   CHACT1
CHARSV04 EQU   CHACT1
CHRDWTR  EQU   CHACT1
CHARSV30 EQU   CHPROCSN+2
CHQID    EQU   CHPROCSN
CHASID   EQU   CHTJID
CHTRKID  EQU   CHPKE
CHCIBCTR EQU   CHAIN+27
CHUNIT   EQU   CHAIN+24
CHCLS    EQU   CHAIN+16
CHPARM   EQU   CHKEY
CHIFY    EQU   CHACT
CHAIFX   EQU   CHACT
CHCLD    EQU   CHACT
CHCL     EQU   CHACT
CHDSI    EQU   CHACT
CHDISC   EQU   CHACT
CHTERM   EQU   CHACT
CHSWAP   EQU   CHACT
CHABTERM EQU   CHSTS
CHFC     EQU   CHSTS
CHDL     EQU   CHSTS
CHAD     EQU   CHSTS
CHQSPC   EQU   CHSTS
CHSOUT   EQU   CHSTS
CHSYS    EQU   CHSTS
CHAP     EQU   CHSTS
CHSZE    EQU   CHFLG+1
CHVCD    EQU   CHFLG
CHPTR    EQU   CHAIN
XAXSACB  EQU   EEXSAS03+4
XAXUTME  EQU   EEXSAS03+2
XAXFREE  EQU   EEXSAS03+1
@NM00014 EQU   XAXMASK
XAXTSL   EQU   XAXMASK
XAXTS    EQU   XAXMASK
@NM00013 EQU   XAXMASK
XAXJOBSL EQU   XAXMASK
XAXJOBS  EQU   XAXMASK
XASOPTR  EQU   @NM00012+1
XASTSAVE EQU   @NM00012
XASPLS3  EQU   EEXSAS02+3
@NM00011 EQU   XASDS
XASSDS5  EQU   XASDS
XASSDS4  EQU   XASDS
XASSDS3  EQU   XASDS
XASSDS2  EQU   XASDS
XASSDS   EQU   XASDS
XASDID   EQU   EEXSAS02+1
XASCID   EQU   EEXSAS02
@NM00010 EQU   EEXSAS01+44
XAT      EQU   EEXSAS01+20
XAF      EQU   EEXSAS01+12
XAI      EQU   EEXSAS01+4
XAH      EQU   EEXSAS01
XASAVSTD EQU   XSAMAP+64
XASAVLOC EQU   XSAMAP+48
@NM00009 EQU   XASVRB+44
XAA      EQU   XASVRB+42
@NM00008 EQU   XASVRB+41
XAL      EQU   @NM00007+1
XAN      EQU   @NM00007
XAR      EQU   @NM00006+1
XAD      EQU   XSA+4
XAP      EQU   XSA
UCMRCTA  EQU   UCMRCT+1
UCMRSV31 EQU   UCMSDS5
UCMSDS5G EQU   UCMSDS5
UCMSDS5F EQU   UCMSDS5
UCMRSV30 EQU   UCMSDS5
UCMRSV29 EQU   UCMSDS5
UCMSDS5C EQU   UCMSDS5
UCMSDS5B EQU   UCMSDS5
UCMSDS5A EQU   UCMSDS5
UCMMLAST EQU   UCMLIST+64
UCMVHRSN EQU   UCMDEVC
UCMDEVG  EQU   UCMDEVC
UCMDEVF  EQU   UCMDEVC
UCMDEVE  EQU   UCMDEVC
UCMDEVD  EQU   UCMDEVC
UCMDEVCC EQU   UCMDEVC
UCMDEVB  EQU   UCMDEVC
UCMDEVA  EQU   UCMDEVC
UCMXOR   EQU   UCMLIST+62
UCMMSG2  EQU   UCMMSG+1
UCMRSV27 EQU   UCMMSG1
UCMRSV26 EQU   UCMMSG1
UCMMSGF  EQU   UCMMSG1
UCMMSGE  EQU   UCMMSG1
UCMMSGD  EQU   UCMMSG1
UCMMSGC  EQU   UCMMSG1
UCMMSGB  EQU   UCMMSG1
UCMMSGA  EQU   UCMMSG1
UCMCOMPC EQU   UCMLIST+56
UCMWLAST EQU   UCMLIST+52
UCMOAOEN EQU   UCMLIST+48
UCMALTEN EQU   UCMLIST+44
UCMRV007 EQU   UCMDISP2
UCMRV006 EQU   UCMDISP2
UCMRV005 EQU   UCMDISP2
UCMRV004 EQU   UCMDISP2
UCMRV003 EQU   UCMDISP2
UCMDISPK EQU   UCMDISP2
UCMDISPJ EQU   UCMDISP2
UCMDISPI EQU   UCMDISP2
UCMDISPH EQU   UCMDISP1
UCMDISPG EQU   UCMDISP1
UCMDISPF EQU   UCMDISP1
UCMDISPE EQU   UCMDISP1
UCMDISPD EQU   UCMDISP1
UCMDISPC EQU   UCMDISP1
UCMDISPB EQU   UCMDISP1
UCMAUTHB EQU   UCMAUTH+1
UCMRSV23 EQU   UCMAUTHA
UCMRSV22 EQU   UCMAUTHA
UCMRSV21 EQU   UCMAUTHA
UCMRSV20 EQU   UCMAUTHA
UCMRSV19 EQU   UCMAUTHA
UCMAUTH3 EQU   UCMAUTHA
UCMAUTH2 EQU   UCMAUTHA
UCMAUTH1 EQU   UCMAUTHA
UCMOUTQ  EQU   UCMLIST+36
UCMRSV18 EQU   UCMLIST+34
UCMRTCD  EQU   UCMLIST+32
UCMXB    EQU   UCMLIST+28
@NM00005 EQU   UCMXA+1
UCMID    EQU   UCMXA
UCMRSV17 EQU   UCMATR
UCMRSV16 EQU   UCMATR
UCMAT04  EQU   UCMATR
UCMLF    EQU   UCMATR
UCMUF    EQU   UCMATR
UCMXF    EQU   UCMATR
UCMIF    EQU   UCMATR
UCMOF    EQU   UCMATR
UCMTC    EQU   UCMSTS
UCMTD    EQU   UCMSTS
UCMTB    EQU   UCMSTS
UCMTA    EQU   UCMSTS
UCMCF    EQU   UCMSTS
UCMBF    EQU   UCMSTS
UCMPF    EQU   UCMSTS
UCMAF    EQU   UCMSTS
UCMNAME  EQU   UCMLIST+16
UCMUCB   EQU   UCMLIST+12
UCMDCB   EQU   UCMLIST+8
UCMSBR   EQU   UCMLIST+4
UCMECB   EQU   UCMLIST
UCMTPSAV EQU   UCMEXIT+208
UCMXTSAV EQU   UCMEXIT+136
UCMDESCD EQU   UCMEXIT+132
UCMROUTC EQU   UCMEXIT+128
UCMMSTXT EQU   UCMEXIT
UCMDECBA EQU   UCMEIL+20
UCMOECBA EQU   UCMEIL+16
UCMAECBA EQU   UCMEIL+12
UCMXECBA EQU   UCMEIL+8
UCMNIPTR EQU   UCMEIL+4
UCMRSV15 EQU   UCMEIL+3
UCMRTCT  EQU   UCMEIL+2
UCMRPYL  EQU   UCMEIL+1
@NM00004 EQU   UCMEIL
UCMRSV60 EQU   UCM+302
UCMRSV59 EQU   UCMRSV51
UCMRSV58 EQU   UCMRSV51
UCMRSV57 EQU   UCMRSV51
UCMRSV56 EQU   UCMRSV51
UCMRSV55 EQU   UCMRSV51
UCMRSV54 EQU   UCMRSV51
UCMRSV53 EQU   UCMRSV51
UCMRSV52 EQU   UCMRSV51
UCMRSV50 EQU   UCMRSV42
UCMRSV49 EQU   UCMRSV42
UCMRSV48 EQU   UCMRSV42
UCMRSV47 EQU   UCMRSV42
UCMRSV46 EQU   UCMRSV42
UCMRSV45 EQU   UCMRSV42
UCMRSV44 EQU   UCMRSV42
UCMRSV43 EQU   UCMRSV42
UCMRSV41 EQU   UCM+296
UCMWAKUP EQU   UCM+292
UCMFRRAD EQU   UCM+288
UCMSWCH  EQU   UCM+284
UCMASCB  EQU   UCM+280
UCMWQECP EQU   UCM+276
UCMORECP EQU   UCM+272
UCMOECBT EQU   UCM+268
UCMOECBH EQU   UCM+264
UCMWECBT EQU   UCM+260
UCMWECBH EQU   UCM+256
UCMMBEND EQU   UCM+252
UCMCTID  EQU   UCM+250
UCMRSV61 EQU   UCM+248
UCMRP2AD EQU   UCM+244
UCMCRAAD EQU   UCM+240
UCMWQLM1 EQU   UCM+238
UCMRV001 EQU   UCM+237
UCMRQLM1 EQU   UCM+236
UCMMBPTR EQU   UCM+232
UCMMQNXT EQU   UCM+228
UCMMQEND EQU   UCM+224
UCMMQPTR EQU   UCM+220
UCMTRECB EQU   UCM+216
UCMMNECB EQU   UCM+212
UCMMNTR  EQU   UCM+208
UCMR9SV  EQU   UCM+204
UCMSAVE4 EQU   UCM+140
UCMSAVE3 EQU   UCM+84
UCMINCR  EQU   UCM+71
UCMMODEL EQU   UCM+70
UCMCORE  EQU   UCM+69
UCMFIX   EQU   UCMMODE
UCMMCS   EQU   UCMMODE
UCMOGCE  EQU   UCMMODE
UCMAMFA  EQU   UCMMODE
UCMRSV14 EQU   UCMMODE
UCMTPUTA EQU   UCMMODE
UCMNOCON EQU   UCMMODE
UCMRSV11 EQU   UCMMODE
UCMPXA   EQU   UCM+64
UCMWQEND EQU   UCM+60
UCMWQNR  EQU   UCM+58
UCMRQNR  EQU   UCM+56
UCMWQECB EQU   UCM+52
UCMRQECB EQU   UCM+48
UCMWQLM  EQU   UCM+46
UCMRQLM  EQU   UCM+45
@NM00003 EQU   UCMRPYI
UCMRPYQ  EQU   UCM+28
UCMWTOQ  EQU   UCM+24
UCMARECB EQU   UCM+16
UCMLECB  EQU   UCMDECB
UCMOECB  EQU   UCM+8
UCMAECB  EQU   UCM+4
UCMXECB  EQU   UCM
UCMGMCNT EQU   UCMPRFX+158
UCMSDS2  EQU   UCMPRFX+157
UCMRSV09 EQU   UCMSDS1
UCMRSV08 EQU   UCMSDS1
UCMRSV07 EQU   UCMSDS1
UCMRSV06 EQU   UCMSDS1
UCMRSV05 EQU   UCMSDS1
UCMRSV04 EQU   UCMSDS1
UCMSDS1B EQU   UCMSDS1
UCMSDS1A EQU   UCMSDS1
UCMDTINT EQU   UCMPRFX+152
UCMLOGAD EQU   UCMPRFX+148
UCMNPECB EQU   UCMPRFX+144
UCMTPPTR EQU   UCMPRFX+140
UCMDOMRT EQU   UCMPRFX+136
UCMRUTCK EQU   UCMPRFX+132
UCMQRTN  EQU   UCMPRFX+128
UCM6WD   EQU   UCMXSA+20
UCM5WD   EQU   UCMXSA+16
UCM4WD   EQU   UCMXSA+12
UCM3WD   EQU   UCMXSA+8
UCM2WD   EQU   UCMXSA+4
UCM1WD   EQU   UCMXSA
UCMRSV03 EQU   UCMPRFX+102
UCMHRDRT EQU   UCMPRFX+100
UCMUEXIT EQU   UCMPRFX+97
UCMXCT   EQU   UCMPRFX+96
UCMHCUCM EQU   UCMPRFX+92
UCMCMID  EQU   UCMPRFX+88
UCMOWTOR EQU   UCMPRFX+86
UCMRSV02 EQU   UCMSFLG2
UCMSYSO  EQU   UCMSFLG2
UCMSYSN  EQU   UCMSFLG2
UCMSYSM  EQU   UCMSFLG2
UCMSYSL  EQU   UCMSFLG2
UCMSYSK  EQU   UCMSFLG2
UCMSYSJ  EQU   UCMSFLG2
UCMSYSI  EQU   UCMSFLG2
UCMRSV35 EQU   UCMSFLG1
UCMSYSG  EQU   UCMSFLG1
UCMSYSF  EQU   UCMSFLG1
UCMSYSE  EQU   UCMSFLG1
UCMSYSD  EQU   UCMSFLG1
UCMSYSC  EQU   UCMSFLG1
UCMSYSB  EQU   UCMSFLG1
UCMRSV01 EQU   UCMSFLG1
UCMWTOX  EQU   UCMPRFX+80
UCMDOME  EQU   UCMPRFX+76
UCMSVR0  EQU   UCMSAVE0+68
UCMSVQ0  EQU   UCMSAVE0+64
UCMSVP0  EQU   UCMSAVE0+60
UCMSVO0  EQU   UCMSAVE0+56
UCMSVN0  EQU   UCMSAVE0+52
UCMSVM0  EQU   UCMSAVE0+48
UCMSVL0  EQU   UCMSAVE0+44
UCMSVK0  EQU   UCMSAVE0+40
UCMSVJ0  EQU   UCMSAVE0+36
UCMSVI0  EQU   UCMSAVE0+32
UCMSVH0  EQU   UCMSAVE0+28
UCMSVG0  EQU   UCMSAVE0+24
UCMSVF0  EQU   UCMSAVE0+20
UCMSVE0  EQU   UCMSAVE0+16
UCMSVD0  EQU   UCMSAVE0+12
UCMSVC0  EQU   UCMSAVE0+8
UCMSVB0  EQU   UCMSAVE0+4
UCMSVA0  EQU   UCMSAVE0
UCMMCENT EQU   UCMPRFX
UCM2PAD  EQU   UCM2EXT+12
UCM2STAA EQU   UCM2STA+1
UCMRV008 EQU   UCM2SFLG
UCMRSV34 EQU   UCM2SFLG
UCMRSV33 EQU   UCM2SFLG
UCMRSV32 EQU   UCM2SFLG
UCM2DSTR EQU   UCM2SFLG
UCM2DTAK EQU   UCM2SFLG
UCM2SENT EQU   UCM2SFLG
UCM2SDWA EQU   UCM2SFLG
UCM2PST  EQU   UCM2EXT+4
UCM2RID  EQU   UCM2EXT+2
UCM2WID  EQU   UCM2EXT
CVTLEVL  EQU   CVTRELNO+2
CVTNUMB  EQU   CVTRELNO
CVTMDL   EQU   CVTFIX+250
@NM00002 EQU   CVTFIX+248
@NM00001 EQU   CVTFIX
CVTRV482 EQU   CVTXTNT2+128
CVTRV481 EQU   CVTXTNT2+124
CVTRV480 EQU   CVTXTNT2+120
CVTRV479 EQU   CVTXTNT2+118
CVTRV478 EQU   CVTXTNT2+117
CVTRV477 EQU   CVTXTNT2+116
CVTRV476 EQU   CVTXTNT2+115
CVTRV475 EQU   CVTXTNT2+114
CVTRV474 EQU   CVTRV466
CVTRV473 EQU   CVTRV466
CVTRV472 EQU   CVTRV466
CVTRV471 EQU   CVTRV466
CVTRV470 EQU   CVTRV466
CVTRV469 EQU   CVTRV466
CVTRV468 EQU   CVTRV466
CVTRV467 EQU   CVTRV466
CVTRV465 EQU   CVTRV457
CVTRV464 EQU   CVTRV457
CVTRV463 EQU   CVTRV457
CVTRV462 EQU   CVTRV457
CVTRV461 EQU   CVTRV457
CVTRV460 EQU   CVTRV457
CVTRV459 EQU   CVTRV457
CVTRV458 EQU   CVTRV457
CVTRV456 EQU   CVTXTNT2+108
CVTRV455 EQU   CVTXTNT2+104
CVTRV454 EQU   CVTXTNT2+100
CVTRV453 EQU   CVTXTNT2+96
CVTRV452 EQU   CVTXTNT2+94
CVTRV451 EQU   CVTXTNT2+92
CVTRV450 EQU   CVTXTNT2+90
CVTRV449 EQU   CVTXTNT2+88
CVTRV448 EQU   CVTXTNT2+87
CVTRV447 EQU   CVTXTNT2+86
CVTRV446 EQU   CVTRV438
CVTRV445 EQU   CVTRV438
CVTRV444 EQU   CVTRV438
CVTRV443 EQU   CVTRV438
CVTRV442 EQU   CVTRV438
CVTRV441 EQU   CVTRV438
CVTRV440 EQU   CVTRV438
CVTRV439 EQU   CVTRV438
CVTRV437 EQU   CVTRV429
CVTRV436 EQU   CVTRV429
CVTRV435 EQU   CVTRV429
CVTRV434 EQU   CVTRV429
CVTRV433 EQU   CVTRV429
CVTRV432 EQU   CVTRV429
CVTRV431 EQU   CVTRV429
CVTRV430 EQU   CVTRV429
CVTRV428 EQU   CVTXTNT2+80
CVTRV427 EQU   CVTXTNT2+76
CVTRV426 EQU   CVTXTNT2+72
CVTRV425 EQU   CVTXTNT2+68
CVTATACT EQU   CVTATCVT
CVTRV423 EQU   CVTXTNT2+62
CVTRV422 EQU   CVTXTNT2+60
CVTRV421 EQU   CVTXTNT2+58
CVTRV420 EQU   CVTXTNT2+56
CVTRV419 EQU   CVTXTNT2+55
CVTRV418 EQU   CVTXTNT2+54
CVTRV417 EQU   CVTRV409
CVTRV416 EQU   CVTRV409
CVTRV415 EQU   CVTRV409
CVTRV414 EQU   CVTRV409
CVTRV413 EQU   CVTRV409
CVTRV412 EQU   CVTRV409
CVTRV411 EQU   CVTRV409
CVTRV410 EQU   CVTRV409
CVTRV408 EQU   CVTRV400
CVTRV407 EQU   CVTRV400
CVTRV406 EQU   CVTRV400
CVTRV405 EQU   CVTRV400
CVTRV404 EQU   CVTRV400
CVTRV403 EQU   CVTRV400
CVTRV402 EQU   CVTRV400
CVTRV401 EQU   CVTRV400
CVTICB   EQU   CVTXTNT2+48
CVTSKTA  EQU   CVTXTNT2+44
CVTRSV99 EQU   CVTXTNT2+40
CVTRSV98 EQU   CVTXTNT2+36
CVTRSV97 EQU   CVTXTNT2+34
CVTRSV96 EQU   CVTXTNT2+32
CVTOLTEP EQU   CVTXTNT2+28
CVTQIDA  EQU   CVTQID+1
CVTRSV95 EQU   CVTQID
CVTRSV94 EQU   CVTXTNT2+20
CVTRSV93 EQU   CVTXTNT2+16
CVTRSV92 EQU   CVTXTNT2+12
CVTDEBVR EQU   CVTXTNT2+8
CVTRSV91 EQU   CVTXTNT2+6
CVTRSV9H EQU   CVTFLGBT
CVTRSV9G EQU   CVTFLGBT
CVTRSV9F EQU   CVTFLGBT
CVTRSV9E EQU   CVTFLGBT
CVTRSV9D EQU   CVTFLGBT
CVTRSV9C EQU   CVTFLGBT
CVTVME   EQU   CVTFLGBT
CVTNPE   EQU   CVTFLGBT
CVTNUCLS EQU   CVTXTNT2+4
CVTDSSVA EQU   CVTDSSV+1
CVTRSV89 EQU   CVTDSSV
CVTRSV88 EQU   CVTXTNT1+8
CVTRSV87 EQU   CVTXTNT1+4
CVTFACHN EQU   CVTXTNT1
CVTRV488 EQU   CVTMAP+412
CVTRV487 EQU   CVTMAP+408
CVTRV486 EQU   CVTMAP+404
CVTRV485 EQU   CVTMAP+400
CVTACTAP EQU   CVTMAP+396
CVTAUTH  EQU   CVTMAP+392
CVTATMCA EQU   CVTATMCT+1
CVTATMST EQU   CVTATMCT
CVTRSV61 EQU   CVTMAP+384
CVTVOLT1 EQU   CVTVOLM1+1
CVTVOLI1 EQU   CVTVOLF1
CVTSTOA  EQU   CVTMAP+376
CVTRSV58 EQU   CVTMAP+374
CVTRSV57 EQU   CVTMAP+372
CVTDDCE  EQU   CVTMAP+368
CVTPNWFR EQU   CVTMAP+364
CVTSMF   EQU   CVTMAP+360
CVTSULK  EQU   CVTMAP+358
CVTSLKO  EQU   CVTSYSK
CVTSLKP  EQU   CVTSYSK
CVTSLKQ  EQU   CVTSYSK
CVTSLKR  EQU   CVTSYSK
CVTRSV56 EQU   CVTSYSK
CVTRSV55 EQU   CVTSYSK
CVTRSV54 EQU   CVTSYSK
CVTRSV53 EQU   CVTSYSK
CVTRSV52 EQU   CVTA1F1
CVTRSV51 EQU   CVTA1F1
CVTRSV50 EQU   CVTA1F1
CVTRSV49 EQU   CVTA1F1
CVTRSV48 EQU   CVTA1F1
CVTRSV47 EQU   CVTA1F1
CVTSRSW  EQU   CVTA1F1
CVTPFSW  EQU   CVTA1F1
CVTPCVT  EQU   CVTMAP+352
CVTRSV46 EQU   CVTMAP+344
CVTRSV45 EQU   CVTMAP+340
CVTRSV44 EQU   CVTMAP+338
CVTRSV43 EQU   CVTMAP+336
CVTHJESA EQU   CVTHJES+1
CVTRSV42 EQU   CVTHJES
CVTEXT2A EQU   CVTEXT2+1
CVTRSV41 EQU   CVTEXT2
CVTAPFA  EQU   CVTAPF+1
CVTRSV40 EQU   CVTAPF
CVTRV518 EQU   CVTINTLA
CVTRV517 EQU   CVTERPV
CVTEORM  EQU   CVTMAP+312
CVTMCHPR EQU   CVTMAP+308
CVTTZ    EQU   CVTMAP+304
CVTJEPS  EQU   CVTMAP+300
CVTJESCT EQU   CVTMAP+296
CVTMODE  EQU   CVTMAP+292
CVTPTRV  EQU   CVTMAP+288
CVTREAL  EQU   CVTMAP+284
CVTRSV39 EQU   CVTMAP+280
CVTRSV38 EQU   CVTMAP+276
CVTDMSRA EQU   CVTDMSR+1
CVTRSV37 EQU   CVTDMSR
CVTQMSGA EQU   CVTQMSG+1
CVTRSV36 EQU   CVTQMSG
CVTAMFF  EQU   CVTMAP+264
CVTPURGA EQU   CVTPURG+1
CVTRSV35 EQU   CVTPURG
CVTCBSP  EQU   CVTMAP+256
CVTATERA EQU   CVTATER+1
CVTSYST  EQU   CVTATER
CVTVOLT2 EQU   CVTTAT
CVTVOLI2 EQU   CVTVOLF2
CVTAQAVB EQU   CVTAQAVT+1
CVTRSV34 EQU   CVTTCMFG
CVTRSV33 EQU   CVTTCMFG
CVTRSV32 EQU   CVTTCMFG
CVTRSV31 EQU   CVTTCMFG
CVTRSV30 EQU   CVTTCMFG
CVTRSV29 EQU   CVTTCMFG
CVTRSV28 EQU   CVTTCMFG
CVTTCRDY EQU   CVTTCMFG
CVTGTFA  EQU   CVTGTF+1
CVTRSV27 EQU   CVTGTFST
CVTRNIO  EQU   CVTGTFST
CVTUSR   EQU   CVTGTFST
CVTRV318 EQU   CVTFORM
CVTRV317 EQU   CVTTMODE
CVTRV316 EQU   CVTSTATE
CVTRV315 EQU   CVTGTFS
CVTGTFAV EQU   CVTGTFS
CVT0SCR1 EQU   CVTMAP+232
CVTRV515 EQU   CVTMAP+228
CVTRMS   EQU   CVTMAP+224
CVTPATCH EQU   CVTMAP+220
CVTTSCE  EQU   CVTMAP+216
CVTLNKSC EQU   CVTMAP+214
CVTQABST EQU   CVTMAP+212
CVTMDLDS EQU   CVTMAP+208
CVTUSER  EQU   CVTMAP+204
CVTABEND EQU   CVTMAP+200
CVTSMCA  EQU   CVTMAP+196
CVTRSV18 EQU   CVTMAP+192
CVTQLPAQ EQU   CVTMAP+188
CVTQCDSR EQU   CVTMAP+184
CVTRSV17 EQU   CVTOPTB
CVTRSV16 EQU   CVTOPTB
CVTFP    EQU   CVTOPTB
CVTAPTHR EQU   CVTOPTB
CVTNLOG  EQU   CVTOPTB
CVTTOD   EQU   CVTOPTB
CVTCTIMS EQU   CVTOPTB
CVTPROT  EQU   CVTOPTB
CVTXPFP  EQU   CVTOPTA
CVTASCII EQU   CVTOPTA
CVTRSV13 EQU   CVTOPTA
CVTRSV12 EQU   CVTOPTA
CVTNIP   EQU   CVTOPTA
CVTDDR   EQU   CVTOPTA
CVTAPR   EQU   CVTOPTA
CVTCCH   EQU   CVTOPTA
CVTSNCTR EQU   CVTMAP+180
CVTQMWR  EQU   CVTMAP+176
CVTQOCR  EQU   CVTMAP+172
CVT1EF00 EQU   CVTMAP+168
CVTMZ00  EQU   CVTMAP+164
CVTHEAD  EQU   CVTMAP+160
CVTRSV11 EQU   CVTMAP+156
CVT0PT01 EQU   CVTMAP+152
CVTMSER  EQU   CVTMAP+148
CVTRV516 EQU   CVTIERLC
CVTILCH  EQU   CVTMAP+140
CVT0DS   EQU   CVTMAP+136
CVTFBOSV EQU   CVTMAP+132
CVTNUCB  EQU   CVTMAP+128
CVTIXAVL EQU   CVTMAP+124
CVTIOQET EQU   CVTMAP+120
CVTDCBA  EQU   CVTMAP+117
CVTMVS2  EQU   CVTDCB
CVT6DAT  EQU   CVTDCB
CVT4MPS  EQU   CVTDCB
CVTRSV09 EQU   CVTDCB
CVT4MS1  EQU   CVTDCB
CVT2SPS  EQU   CVTDCB
CVT1SSS  EQU   CVTDCB
CVTRSV08 EQU   CVTDCB
CVTSTB   EQU   CVTMAP+112
CVTQTD00 EQU   CVTMAP+108
CVTQTE00 EQU   CVTMAP+104
CVTSJQ   EQU   CVTMAP+96
CVTPBLDL EQU   CVTMAP+92
CVTTPC   EQU   CVTMAP+88
CVTSVDCB EQU   CVTMAP+84
CVTBRET  EQU   CVTMAP+82
CVTEXIT  EQU   CVTMAP+80
CVT0FN00 EQU   CVTMAP+76
CVTDARA  EQU   CVTDAR+1
CVTRSV07 EQU   CVTFLGS1
CVTRSV06 EQU   CVTFLGS1
CVTRSV05 EQU   CVTFLGS1
CVTRSV04 EQU   CVTFLGS1
CVTRSV03 EQU   CVTFLGS1
CVTRSV02 EQU   CVTFLGS1
CVTRSV01 EQU   CVTFLGS1
CVTDMPLK EQU   CVTFLGS1
CVTXITP  EQU   CVTMAP+68
CVTZDTAB EQU   CVTMAP+64
CVTMSLT  EQU   CVTMAP+60
CVTDATE  EQU   CVTMAP+56
CVTBTERM EQU   CVTMAP+52
CVTSYSAD EQU   CVTMAP+48
CVTXTLER EQU   CVTMAP+44
CVTILK2  EQU   CVTMAP+40
CVTILK1  EQU   CVTMAP+36
CVTPRLTV EQU   CVTMAP+32
CVTPCNVT EQU   CVTMAP+28
CVT0VL00 EQU   CVTMAP+24
CVTXAPG  EQU   CVTMAP+20
CVTBUF   EQU   CVTMAP+16
CVTJOB   EQU   CVTMAP+12
CVTLINK  EQU   CVTMAP+8
CVT0EF00 EQU   CVTMAP+4
CVTTCBP  EQU   CVTMAP
CVT      EQU   CVTMAP
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS
@RC00104 EQU   @EL00005
@RC00120 EQU   @EL00006
@RC00109 EQU   @RC00104
@RC00107 EQU   @RC00104
@ENDDATA EQU   *
         END   IEECB901,(C'PLS0128',0603,74165)
