         TITLE 'IEEMB803 - SYSTEM LOG INITIALIZATION MODULE            *
                        '
IEEMB803 CSECT ,                                                   0001
@MAINENT BALR  @15,0                                               0001
         USING *,@15                                               0001
         B     @PROLOG                                             0001
         DC    AL1(16)                                             0001
         DC    C'IEEMB803  76.167'                                 0001
         DROP  @15
@PROLOG  BALR  @11,0                                               0001
@PSTART  DS    0H                                                  0001
         USING @PSTART,@11                                         0001
         L     @00,@SIZDATD                                        0001
         GETMAIN  R,LV=(0)
         LR    @12,@01                                             0001
         USING @DATD,@12                                           0001
         ST    @13,@SA00001+4                                      0001
         LR    @13,@12                                             0001
JSCBDISP EQU 188
JSCBAOS1 EQU  72
JSCBAOS2 EQU 192
*   TCBTID='F8'X;                   /* SET LOG ID FIELD FOR COMM TASK
*                                                            @YM06329*/
         L     @03,CVTPTR                                          0205
         L     @03,CVTTCBP(,@03)                                   0205
         L     @03,TCBPTR(,@03)                                    0205
         MVI   TCBTID(@03),X'F8'                                   0205
*LOGSTART:                                                         0206
*                                                                  0206
*   /*****************************************************************/
*   /*                                                               */
*   /* ENTRY HERE IS FROM THE LOG ESTAE RTNS IN MODULE IEEMB806 FOR  */
*   /* RECOVERY OF THE LOG FUNCTION FROM A RECURSIVE ABEND IN THE LOG*/
*   /* TASK , OR FROM AN ABEND IN THE PRIMARY LOG ESTAE RTN IN       */
*   /* IEEMB806 (ESTAE1).INPUT IS A RESTORED BASE REGISTER (REG11)   */
*   /* DATA REGISTER (REG12) AND SAVE AREA REGISTER (REG13).         */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0206
*   DO WHILE(SPINSW=1);                                            0206
LOGSTART B     @DE00206                                            0206
@DL00206 DS    0H                                                  0207
*     RFY                                                          0207
*      (REG3) RESTRICTED;                                          0207
*     REG0=REG12;                   /* SET CORE ADDRESS TO CLEAR     */
         LR    REG0,REG12                                          0208
*     REG2=0000;                    /* SET SECOND OPERAND TO ZERO    */
         SLR   REG2,REG2                                           0209
*     REG3=0000;                    /* SET PADDING VALUE             */
         SLR   REG3,REG3                                           0210
*     GEN;                                                         0211
        L     REG1,@SIZDATD          SET CORE SIZE TO CLEAR
        MVCL  REG0,REG2              CLEAR CORE
*     RFY                                                          0212
*      (REG3) UNRESTRICTED;                                        0212
*     IF MSLOGIPL='0'B THEN         /* ENTRY AT IPL TIME             */
         L     @03,CVTPTR                                          0213
         L     @09,CVTMSER(,@03)                                   0213
         TM    MSLOGIPL(@09),B'00001000'                           0213
         BNZ   @RF00213                                            0213
*       DO;                                                        0214
*                                                                  0214
*         /***********************************************************/
*         /*                                                         */
*         /* FOR FIRST-TIME ENTRY , COMM-TASK WQE AND RQE LIMITS,    */
*         /* USED TO ISSUE WTOS, ARE SET TO THEIR NORMAL VALUES FROM */
*         /* THE HIGH VALUES USED TO ALLOW NIP TO ISSUE ALL ITS WTOS.*/
*         /*                                                         */
*         /***********************************************************/
*                                                                  0215
*         UCMRQLM=UCMRQLM1;         /* RE-SET LIMITS         @YM01992*/
         L     @03,UCMBASPT(,@03)                                  0215
         IC    @08,UCMRQLM1(,@03)                                  0215
         STC   @08,UCMRQLM(,@03)                                   0215
*         UCMWQLM=UCMWQLM1;         /* TO NORMAL VALUES      @YM01992*/
         LH    @08,UCMWQLM1(,@03)                                  0216
         STH   @08,UCMWQLM(,@03)                                   0216
*         MSLOGIPL='1'B;            /* SET FIRST TIME SWITCH         */
         OI    MSLOGIPL(@09),B'00001000'                           0217
*       END;                                                       0218
*     ELSE                          /* ENTRY TO SET LOG WAITING      */
*       DO;                                                        0219
         B     @RC00213                                            0219
@RF00213 DS    0H                                                  0220
*         REG1=ADDR(MSLGSTRT);      /* ECB ADDRESS                   */
         L     @03,CVTPTR                                          0220
         L     REG1,CVTMSER(,@03)                                  0220
         LA    REG1,MSLGSTRT(,REG1)                                0220
*         GEN( WAIT  ECB=(1));      /* WAIT FOR WRITELOG START CMND  */
          WAIT  ECB=(1)
*         MSLGSTRT=0000;            /* CLEAR START ECB               */
         SLR   @03,@03                                             0222
         L     @09,CVTPTR                                          0222
         L     @09,CVTMSER(,@09)                                   0222
         ST    @03,MSLGSTRT(,@09)                                  0222
*         MSLGCLOZ=0000;            /* CLEAR CLOSE ECB       @YM08186*/
         ST    @03,MSLGCLOZ(,@09)                                  0223
*       END;                                                       0224
*     REG15=0000;                   /* PRE-SET NORMAL STAE RETURN    */
@RC00213 SLR   REG15,REG15                                         0225
*     IF MSLOGSTA^='1'B THEN        /* NO STAE ENVIRONMENT           */
         L     @03,CVTPTR                                          0226
         L     @03,CVTMSER(,@03)                                   0226
         TM    MSLOGSTA(@03),B'00000100'                           0226
         BO    @RF00226                                            0226
*       DO;                                                        0227
*         EBASEREG=REG11;           /* PROG BASE REG TO ESTAE PARM   */
         ST    REG11,EBASEREG                                      0228
*         EDATAREG=REG12;           /* DATA BASE REG TO ESTAE PARM   */
         ST    REG12,EDATAREG                                      0229
*         ESAVEREG=REG13;           /* PROG SAVE REG TO ESTAE PARM   */
         ST    REG13,ESAVEREG                                      0230
*         REG1=ADDR(ESTAEPRM);      /* SET UP PARM REG               */
         LA    REG1,ESTAEPRM                                       0231
*         CALL IEEMB806;            /* CREATE ESTAE ENVIRONMENT      */
         L     @15,@CV02191                                        0232
         BALR  @14,@15                                             0232
*       END;                                                       0233
*     IF REG15=0000 THEN            /* STAE SUCCESSFUL               */
@RF00226 LTR   REG15,REG15                                         0234
         BNZ   @RF00234                                            0234
*       DO;                                                        0235
*         MSLOGSTA='1'B;            /* SET STAE ISSUED SWITCH        */
         L     @03,CVTPTR                                          0236
         L     @03,CVTMSER(,@03)                                   0236
         OI    MSLOGSTA(@03),B'00000100'                           0236
*         CALL IEEMB805(LCASAVE);   /* GET LOG CORE , WTL QUEUE POOL
*                                                            @ZA05195*/
         LA    @03,LCASAVE                                         0237
         ST    @03,@AL00001                                        0237
         L     @15,@CV02193                                        0237
         LA    @01,@AL00001                                        0237
         BALR  @14,@15                                             0237
*         LCAPTR=LCASAVE;           /* SET UP LCA ADDRESSIBILITY   0238
*                                                            @ZA05195*/
         L     LCAPTR,LCASAVE                                      0238
*         IF REG15=0000 THEN        /* GOT CORE SUCESSFULLY          */
         LTR   REG15,REG15                                         0239
         BNZ   @RF00239                                            0239
*           DO;                                                    0240
*STAEENT:                           /* RETURN POINT FOR STAE RE-TRY  */
*             CALL ACBINIT;         /* GET, INITIALIZE ACB           */
STAEENT  BAL   @14,ACBINIT                                         0241
*             CALL ALLOCRTN;        /* DYNAM ALLOC LOG DATA SET      */
         BAL   @14,ALLOCRTN                                        0242
*             IF REG15=0000 THEN    /* DYNAMIC ALLOCATE SUCCESSFUL   */
         LTR   REG15,REG15                                         0243
         BNZ   @RF00243                                            0243
*               DO;                                                0244
*                 LCADDONE=DDALNM;  /* SAVE GENERATED DDNAME         */
         MVC   LCADDONE(8,LCAPTR),DDALNM                           0245
*                 CALL OPENRTN;     /* SET UP , OPEN LOG DATA SET    */
         BAL   @14,OPENRTN                                         0246
*                 IF REG15=0000 THEN/* OPEN SUCCESSFUL               */
         SLR   @03,@03                                             0247
         CR    REG15,@03                                           0247
         BNE   @RF00247                                            0247
*                   DO;                                            0248
*                     LCACBONE=ACBPTR;/* SAVE ACB PTR                */
         L     @09,ACBPTR                                          0249
         ST    @09,LCACBONE(,LCAPTR)                               0249
*                     IF BALOG=0000 THEN/* NO LOG ACTIVE             */
         L     @09,CVTPTR                                          0250
         L     @09,CVTMSER(,@09)                                   0250
         C     @03,BALOG(,@09)                                     0250
         BNE   @RF00250                                            0250
*                       DO;                                        0251
*                         CALL NEWLOG;/* SET UP COMM-TASK POST       */
         BAL   @14,NEWLOG                                          0252
*                         NUMMSGS=1;                               0253
         MVI   NUMMSGS,X'01'                                       0253
*                         MSGONE=MSG4;/* SET UP LOG ACTIVE MSG CODE  */
         IC    @03,MSG4                                            0254
         STC   @03,MSGONE                                          0254
*                         REG1=ADDR(MSGPARM);/* PARM REG             */
         LA    REG1,MSGPARM                                        0255
*                         CALL IEEMB807;/* ISSUE WTO                 */
         L     @15,@CV02192                                        0256
         BALR  @14,@15                                             0256
*                       END;                                       0257
*                     LOGWAIT=1;    /* SWITCH FOR WAIT LOOP          */
@RF00250 MVI   LOGWAIT,X'01'                                       0258
*                     DO WHILE(LOGWAIT=1);                         0259
         B     @DE00259                                            0259
@DL00259 DS    0H                                                  0260
*                       REG1=ADDR(LCAELST);/* LOG ECB LIST           */
         LA    REG1,LCAELST(,LCAPTR)                               0260
*                       GEN( WAIT ECBLIST=(1));/* ISSUE MULTIPLE WAIT*/
          WAIT ECBLIST=(1)
*                       CALL CHCKPOST;/* PROCESS POST OF LOG         */
         BAL   @14,CHCKPOST                                        0262
*                     END;                                         0263
@DE00259 CLI   LOGWAIT,1                                           0263
         BE    @DL00259                                            0263
*                   END;                                           0264
*                 ELSE              /* OPEN FAILURE                  */
*                   DO;                                            0265
         B     @RC00247                                            0265
@RF00247 DS    0H                                                  0266
*                     CALL SHUTDOWN;/* SET LOG INACTIVE              */
         BAL   @14,SHUTDOWN                                        0266
*                     CALL LOGERROR;/* UNALLOCATE LOG D/S, FREE ACB  */
         BAL   @14,LOGERROR                                        0267
*                     CALL WTLCLOSE;/* FREE LOG RESOURCES            */
         BAL   @14,WTLCLOSE                                        0268
*                     MSGONE=MSG5;  /* LOG INIT FAILED MSG CODE      */
         IC    @03,MSG5                                            0269
         STC   @03,MSGONE                                          0269
*                   END;                                           0270
*               END;                                               0271
*             ELSE                  /* DYNAMIC ALLOCATION FAILURE    */
*               DO;                                                0272
         B     @RC00243                                            0272
@RF00243 DS    0H                                                  0273
*                 CALL SHUTDOWN;    /* SET LOG INACTIVE              */
         BAL   @14,SHUTDOWN                                        0273
*                 CALL WTLCLOSE;    /* FREE LOG RESOURCES            */
         BAL   @14,WTLCLOSE                                        0274
*                 MSGONE=MSG5;      /* LOG INIT FAILED MSG CODE      */
         IC    @03,MSG5                                            0275
         STC   @03,MSGONE                                          0275
*               END;                                               0276
*           END;                                                   0277
*         ELSE                      /* BLDCPOOL FAILURE              */
*           DO;                                                    0278
         B     @RC00239                                            0278
@RF00239 DS    0H                                                  0279
*             CALL SHUTDOWN;        /* SET LOG INACTIVE      @YM01992*/
         BAL   @14,SHUTDOWN                                        0279
*             CALL WTLCLOSE;        /* FREE LOG RESOURCES            */
         BAL   @14,WTLCLOSE                                        0280
*             MSGONE=MSG5;          /* LOG INIT FAILED MSG CODE      */
         IC    @03,MSG5                                            0281
         STC   @03,MSGONE                                          0281
*           END;                                                   0282
*       END;                                                       0283
*     ELSE                                                         0284
*       DO;                                                        0284
         B     @RC00234                                            0284
@RF00234 DS    0H                                                  0285
*         CALL SHUTDOWN;            /* SET LOG INACTIVE      @YM01992*/
         BAL   @14,SHUTDOWN                                        0285
*         MSGONE=MSG5;              /* LOG INIT FAILED MSG CODE      */
         IC    @03,MSG5                                            0286
         STC   @03,MSGONE                                          0286
*       END;                                                       0287
*     NUMMSGS=2;                    /* WTOS TO ISSUE                 */
@RC00234 MVI   NUMMSGS,X'02'                                       0288
*     MSGTWO=MSG3;                  /* LOG NOT ACTIVE CODE           */
         IC    @03,MSG3                                            0289
         STC   @03,MSGTWO                                          0289
*     REG1=ADDR(MSGPARM);           /* SET UP PARM REG               */
         LA    REG1,MSGPARM                                        0290
*     CALL IEEMB807;                /* ISSUE WTO                     */
         L     @15,@CV02192                                        0291
         BALR  @14,@15                                             0291
*   END;                                                           0292
@DE00206 CLI   SPINSW,1                                            0292
         BE    @DL00206                                            0292
*WTLREC:                                                           0293
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);                               0293
*                                                                  0293
         B     @PB00002                                            0293
WTLREC   DS    0H                                                  0294
*   /*****************************************************************/
*   /*                                                               */
*   /* ENTRY IS TO SET UP THE WTL RECORD ELEMENTS IN CORRECT ORDER   */
*   /* (FIRST IN / FIRST OUT -(FIFO)) FROM THE WTL QUEUE POOL WHICH  */
*   /* WAS SET UP IN (LAST IN / FIRST OUT-(LIFO)) ORDER. EACH RECORD */
*   /* ELEMENT HAS A BACKWARD PTR TO THE PREVIOUS ELEMENT ON THE WTL */
*   /* POOL CHAIN, EXCEPT THE FIRST RECORD ELEMENT, WHICH HAS A ZERO */
*   /* PTR FIELD (CHAINPTR). THE PTR TO THE WTL QUEUE CHAIN AND COUNT*/
*   /* OF RECORD ELEMENTS ON THE CHAIN (LCAQHEAD) IS LOADED INTO AN  */
*   /* EVEN/ODD PAIR OF REGS, AND THE VALUES ARE PROPAGATED TO       */
*   /* ANOTHER EVEN/ODD PAIR OF REGS WITH THE COUNT VALUE DECREMENTED*/
*   /* BY ONE. THE NEW VALUES ARE STORED BACK TO LCAQHEAD USING      */
*   /* COMPARE DOUBLE AND SWAP (CDS) INSTRUCTION FOR SERIALIZATION OF*/
*   /* THE FIELD. THE WTL POOL CHAIN IS SCANNED FOR A ZERO PTR TO    */
*   /* NEXT ELEMENT. THIS IS THE RECORD ELEMENT THAT WILL BE PUT TO  */
*   /* THE SYSTEM LOG DATA SET. THE BACKWARD PTR OF THE PREVIOUS     */
*   /* RECORD ELEMENT IS SET TO ZERO AND THE PUT RTN PUTREC IS CALLED*/
*   /* TO WRITE THE RECORD OUT. RETURN CODES (REG15) ARE DETERMINED  */
*   /* BY THE VALUE OF THE LCAQHEAD COUNT FIELD. IF THE COUNT IS     */
*   /* ZERO, REG15 IS SET ZERO, IF THE COUNT IS NOT ZERO, REG15 IS   */
*   /* SET TO FOUR. RETURN CODES ARE PROCESSED BY CALLER.            */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0294
*   DCL                                                            0294
*     AGAN LABEL;                   /* USED BY 'CDS'                 */
*   RFY                                                            0295
*    (PR1ELCNT,                                                    0295
*     PR1ELAD,                                                     0295
*     PR2ELCNT,                                                    0295
*     PR2ELAD) RESTRICTED;                                         0295
*   REGSAV=REG14;                   /* SAVE RETURN ADDRESS           */
         LR    REGSAV,REG14                                        0296
*   RETCODE=4;                      /* SET LOOP SWITCH       @ZA07784*/
         MVI   RETCODE,X'04'                                       0297
*   DO WHILE(RETCODE=4);            /* SET PUT LOOP          @ZA07784*/
         B     @DE00298                                            0298
@DL00298 DS    0H                                                  0299
*     GEN( LM    PR1ELCNT,PR1ELAD,LCAQHEAD(LCAPTR));/* SET UP      0299
*                                      'CDS'REGS                     */
          LM    PR1ELCNT,PR1ELAD,LCAQHEAD(LCAPTR)
*     IF PR1ELCNT^=0000 THEN        /* ANY QUEUE ELEMENTS TO PUT OUT */
         LTR   PR1ELCNT,PR1ELCNT                                   0300
         BZ    @RF00300                                            0300
*       DO;                                                        0301
*                                                                  0301
*         /***********************************************************/
*         /*                                                         */
*         /* RECORD ELEMENT CHAIN IS NOT EMPTY. SET UP TO DECREMENT  */
*         /* THE ELEMENT COUNT -LCAQHEAD(LCAELCNT) IN REG6 (PR1ELCNT)*/
*         /* USING 'CDS' FOR SERIALIZATION ON THE WTL QUEUE CHAIN PTR*/
*         /* (LCAQHEAD)                                              */
*         /*                                                         */
*         /***********************************************************/
*                                                                  0302
*AGAN:                                                             0302
*         PR2ELCNT=PR1ELCNT-1;      /* DECREMENT ELEMENT COUNT       */
AGAN     LR    PR2ELCNT,PR1ELCNT                                   0302
         BCTR  PR2ELCNT,0                                          0302
*         PR2ELAD=PR1ELAD×REGMASK;  /* SET HI-BIT FLAG ON            */
         LR    PR2ELAD,PR1ELAD                                     0303
         O     PR2ELAD,REGMASK                                     0303
*         IF PR2ELCNT=0000 THEN     /* THIS LAST ELEMENT ON QUEUE    */
         LTR   PR2ELCNT,PR2ELCNT                                   0304
         BNZ   @RF00304                                            0304
*           PR2ELAD=0000;           /* ZERO CHAIN PTR                */
         SLR   PR2ELAD,PR2ELAD                                     0305
*         CDS(PR1ELCNT,PR2ELCNT,LCAQHEAD);/* SWAP IN NEW VALUES      */
@RF00304 CDS   PR1ELCNT,PR2ELCNT,LCAQHEAD(LCAPTR)                  0306
*         BC(7,AGAN);               /* RE-PROCESS IF COMPARE FAILED  */
         BC    7,AGAN                                              0307
*         IF PR2ELCNT^=0000 THEN    /* NOT LAST ELEMENT ON QUEUE     */
         LTR   PR2ELCNT,PR2ELCNT                                   0308
         BZ    @RF00308                                            0308
*           DO;                                                    0309
*                                                                  0309
*             /*******************************************************/
*             /*                                                     */
*             /* SCAN THE WTL QUEUE CHAIN FOR A ZERO PTR TO NEXT     */
*             /* ELEMENT- (CHAINPTR). THE RECORD ELEMENT WITH THIS   */
*             /* PTR IS THE LAST ELEMENT ON THE CHAIN AND WILL BE PUT*/
*             /* TO THE LOG DATA SET THE (CHAINPTR) FIELD OF THE     */
*             /* PREVIOUS ELEMENT WILL BE SET TO ZERO FOR THE NEXT   */
*             /* QUEUE SCAN                                          */
*             /*                                                     */
*             /*******************************************************/
*                                                                  0310
*             DO WHILE(CHAINPTR^=0000);/* SCAN FOR LAST ELEMENT      */
         B     @DE00310                                            0310
@DL00310 DS    0H                                                  0311
*               PREVREG=PR1ELAD;    /* SAVE PREVIOUS ELEMENT PTR     */
         ST    PR1ELAD,PREVREG                                     0311
*               PR1ELAD=CHAINPTR;   /* GET NEXT ELEMENT PTR          */
         L     PR1ELAD,CHAINPTR(,PR1ELAD)                          0312
*               IF PR1ELAD^=0000 THEN/* NOT LAST WTL ELEMENT @ZA07784*/
         LTR   PR1ELAD,PR1ELAD                                     0313
         BZ    @RF00313                                            0313
*                 DO;                                              0314
*                   IF PREVCNT^=SWITCHFD+1 THEN/* BAD CNT    @ZA07784*/
         L     @09,PREVREG                                         0315
         LA    @08,1                                               0315
         AL    @08,SWITCHFD(,PR1ELAD)                              0315
         CL    @08,PREVCNT(,@09)                                   0315
         BE    @RF00315                                            0315
*                     IF MSWTL='1'B THEN/* IN RECURSION      @ZA07784*/
         LA    @09,136                                             0316
         L     @08,CVTPTR                                          0316
         AL    @09,CVTMSER(,@08)                                   0316
         TM    MSWTL(@09),B'00100000'                              0316
         BNO   @RF00316                                            0316
*                       DO;                                        0317
*                         LCASTAE='1'B;/* SET LOG RECURS BIT @ZA07784*/
         MVI   LCASTAE(LCAPTR),X'01'                               0318
*                         MSWTL='0'B;/* ZERO BUFFER RECURS   @ZA07784*/
         NI    MSWTL(@09),B'11011111'                              0319
*                         CALL ABENDRTN;/* GO ISSUE ABEND. NO RETURN
*                                      FROM THIS CALLED RTN. @ZA07784*/
         BAL   @14,ABENDRTN                                        0320
*                       END;                                       0321
*                     ELSE                                         0322
*                       CALL CHAINRTN;/* GO REPAIR CHAIN     @ZA07784*/
         B     @RC00316                                            0322
@RF00316 BAL   @14,CHAINRTN                                        0322
*                   ELSE                                           0323
*                     ;                                            0323
@RF00315 DS    0H                                                  0324
*                 END;                                             0324
@RC00315 DS    0H                                                  0325
*             END;                                                 0325
@RF00313 DS    0H                                                  0325
@DE00310 SLR   @09,@09                                             0325
         C     @09,CHAINPTR(,PR1ELAD)                              0325
         BNE   @DL00310                                            0325
*             ZEROPTR=0000;         /* PREVIOUS ELEMENT PTR FIELD    */
         L     @08,PREVREG                                         0326
         ST    @09,ZEROPTR(,@08)                                   0326
*           END;                                                   0327
*         ELSE                                                     0328
*           RETCODE='00'X;          /* SET LAST WTL INDICATOR        */
         B     @RC00308                                            0328
@RF00308 MVI   RETCODE,X'00'                                       0328
*         CALL PUTREC;              /* CALL PUT RTN                  */
@RC00308 BAL   @14,PUTREC                                          0329
*       END;                                                       0330
*     ELSE                                                         0331
*       RETCODE=0000;               /* NO WTLS TO WRITE      @ZA07784*/
         B     @RC00300                                            0331
@RF00300 MVI   RETCODE,X'00'                                       0331
*   END;                            /*                       @ZA07784*/
@RC00300 DS    0H                                                  0332
@DE00298 CLI   RETCODE,4                                           0332
         BE    @DL00298                                            0332
*   IF RETCODE=4 THEN               /* NOT LAST WTL ON QUEUE         */
         CLI   RETCODE,4                                           0333
         BNE   @RF00333                                            0333
*     REG15=4;                      /* SET RETURN CODE FOR CALLER    */
         LA    REG15,4                                             0334
*   ELSE                            /* ALL WTLS PUT TO LOG           */
*     REG15=0000;                   /* SET RETURN CODE TO CALLER     */
         B     @RC00333                                            0335
@RF00333 SLR   REG15,REG15                                         0335
*   RFY                                                            0336
*    (PR1ELCNT,                                                    0336
*     PR1ELAD,                                                     0336
*     PR2ELCNT,                                                    0336
*     PR2ELAD) UNRESTRICTED;                                       0336
@RC00333 DS    0H                                                  0337
*   REG14=REGSAV;                   /* RESTORE RETURN ADDRESS        */
         LR    REG14,REGSAV                                        0337
*   END WTLREC;                                                    0338
@EL00002 DS    0H                                                  0338
@EF00002 DS    0H                                                  0338
@ER00002 BR    @14                                                 0338
*PUTREC:                                                           0339
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);                               0339
*                                                                  0339
PUTREC   DS    0H                                                  0340
*   /*****************************************************************/
*   /*                                                               */
*   /* ENTRY IS TO INITIALIZE THE RPL CONTROL BLOCK WITH THE SIZE AND*/
*   /* ADDRESS OF THE MESSAGE TEXT TO BE PUT TO THE SYSTEM LOG DATA  */
*   /* SET, AND TO RELEASE THE WTL QUEIE POOL ELEMENT VIA A FREECELL */
*   /* MACRO . FOR THE PUT, REG1 IS SET UP WITH THE ADDRESS OF THE   */
*   /* RPL CONTROL BLOCK AND THE PUT MACRO IS ISSUED. IF THE PUT IS  */
*   /* NOT SUCCESSFUL ( REG15 = FOUR ), THE LOGCORE AND CONTROL AREAS*/
*   /* ARE DUMPED VIA CALL TO DUMPRTN, AND AN ABEND MACRO IS ISSUED. */
*   /* THE LOG ESTAE PROCESSOR, IEEMB806, WILL ATTEMPT LOG RECOVERY. */
*   /* EXIT IS VIA ABEND . OTHERWISE, THE WTL ELEMENT IS RELEASED FOR*/
*   /* RE-USE VIA THE FREECELL MACRO. REG15 IS TESTED FOR A VALUE OF */
*   /* TWENTY AND IF EQUAL, THE FREED ELEMENT WAS THE LAST ELEMENT IN*/
*   /* USE IN A WTL QUEUE POOL EXTENSION AREA. THE POOL EXTENSION IS */
*   /* FREED VIA A FREEMAIN MACRO, WITH REG0 AND REG1 POINTING TO THE*/
*   /* POOL SIZE AND THE POOL ADDRESS. THESE POINTERS ARE RETURNED BY*/
*   /* THE FREECELL PROCESSING WHEN THIS CONDITION EXISTS. RETURN TO */
*   /* CALLER .                                                      */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0340
*   RETREG1=REG14;                  /* SAVE RETURN ADDRESS           */
         LR    RETREG1,REG14                                       0340
*   RFY                                                            0341
*    (REG5) RESTRICTED;                                            0341
*   RPLAREA=ADDR(DATATXT);          /* PTR TO RECORD TO BE PUT       */
         L     @07,LCARPLP(,LCAPTR)                                0342
         LA    @04,DATATXT(,PR1ELAD)                               0342
         ST    @04,RPLAREA(,@07)                                   0342
*   RPLRLEN=DATASIZE-4;             /* RECORD SIZE-HEADER SIZE       */
         LH    @04,DATASIZE(,PR1ELAD)                              0343
         N     @04,@CF02454                                        0343
         SL    @04,@CF00110                                        0343
         ST    @04,RPLRLEN(,@07)                                   0343
*   REG1=LCARPLP;                   /* RPLPTR TO REG                 */
         LR    REG1,@07                                            0344
*   GEN( PUT RPL=(1));              /* ISSUE PUT MACRO               */
          PUT RPL=(1)
*   IF REG15=4 THEN                 /* ERROR ON PUT                  */
         C     REG15,@CF00110                                      0346
         BNE   @RF00346                                            0346
*     CALL ABENDRTN;                /* GO ISSUE ABEND. NO RETURN FROM
*                                      THIS CALLED RTN.      @ZA07784*/
         BAL   @14,ABENDRTN                                        0347
*   REG0=LCACPID;                   /* QUEUE POOL UNIQUE ID          */
@RF00346 L     REG0,LCACPID(,LCAPTR)                               0348
*   REG1=REG5;                      /* ELEMENT ADDRESS FROM CALLER   */
         LR    REG1,REG5                                           0349
*   REG1=REG1&'00FFFFFF'X;          /* CLEAR HI-BIT SW       @YA00803*/
         N     REG1,@CF02363                                       0350
*   GEN( FREECELL CPID=(0),CELL=(1),BRANCH=YES);/* FREE THE RECORD 0351
*                                      ELEMENT                       */
          FREECELL CPID=(0),CELL=(1),BRANCH=YES
*   IF REG15=TWENTY THEN            /* LAST CELL OF POOL EXTENSION   */
         SLR   @07,@07                                             0352
         IC    @07,TWENTY                                          0352
         CR    REG15,@07                                           0352
         BNE   @RF00352                                            0352
*     GEN( FREEMAIN R,LV=(0),A=(1));/* FREE POOL EXTENSION           */
          FREEMAIN R,LV=(0),A=(1)
*   RFY                                                            0354
*    (REG5) UNRESTRICTED;                                          0354
@RF00352 DS    0H                                                  0355
*   REG14=RETREG1;                  /* RESTORE RETURN ADDRESS        */
         LR    REG14,RETREG1                                       0355
*   END PUTREC;                                                    0356
@EL00003 DS    0H                                                  0356
@EF00003 DS    0H                                                  0356
@ER00003 BR    @14                                                 0356
*WTLCLOSE:                                                         0357
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);                               0357
*                                                                  0357
WTLCLOSE DS    0H                                                  0358
*   /*****************************************************************/
*   /*                                                               */
*   /* ENTRY HERE IS TO FREE ALL RESOURCES HELD BY THE SYSTEM LOG    */
*   /* TASK WHEN IT BECOMES INACTIVE VIA A WRITELOG CLOSE COMMAND OR */
*   /* DUE TO LOG TASK ABEND. AS A RESOURCE IS ACQUIRED, A FLAGBIT IS*/
*   /* SET ON BY THE RTN GETTING IT. THESE BITS ARE TESTED AND THE   */
*   /* RESOURCE IS FREED BY THIS RTN.                                */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0358
*   SAVE14=REG14;                   /* SAVE RETURN ADDRESS           */
         LR    SAVE14,REG14                                        0358
*   IF LCASAVE^=0000 THEN           /* LCA FLAG FIELDS AVAILABLE   0359
*                                                            @ZA05195*/
         L     @05,LCASAVE                                         0359
         LTR   @05,@05                                             0359
         BZ    @RF00359                                            0359
*     DO;                           /*                       @ZA05195*/
*       IF LCAACBF='1'B THEN        /* ACB CORE GOTTEN       @ZA05195*/
         TM    LCAACBF(LCAPTR),B'00000100'                         0361
         BNO   @RF00361                                            0361
*         DO;                       /*                       @ZA05195*/
*           CALL FREEACB;           /* FREE ACB CORE         @ZA05195*/
         BAL   @14,FREEACB                                         0363
*           LCAACBF='0'B;           /* CLEAR FLAG            @ZA05195*/
         NI    LCAACBF(LCAPTR),B'11111011'                         0364
*         END;                      /*                       @ZA05195*/
*       IF LCASUBSF='1'B THEN       /* HAVE SUBSYSTEM INTERFACE    0366
*                                                            @ZA05195*/
@RF00361 TM    LCASUBSF(LCAPTR),B'00001000'                        0366
         BNO   @RF00366                                            0366
*         DO;                       /*                       @ZA05195*/
*           CALL FRESUBS;           /* RELEASE INTERFACE     @ZA05195*/
         BAL   @14,FRESUBS                                         0368
*           LCASUBSF='0'B;          /* CLEAR SUBSYSTEM FLAG  @ZA05195*/
         NI    LCASUBSF(LCAPTR),B'11110111'                        0369
*         END;                      /*                       @ZA05195*/
*       IF LCAJSCBF='1'B THEN       /* GOT NEW JSCB          @ZA05195*/
@RF00366 TM    LCAJSCBF(LCAPTR),B'00010000'                        0371
         BNO   @RF00371                                            0371
*         DO;                       /*                       @ZA05195*/
*           CALL FREJSCB;           /* FREE GOTTEN JSCB      @ZA05195*/
         BAL   @14,FREJSCB                                         0373
*           LCAJSCBF='0'B;          /* CLEAR FLAG            @ZA05195*/
         NI    LCAJSCBF(LCAPTR),B'11101111'                        0374
*         END;                      /*                       @ZA05195*/
*       IF LCASSIBF='1'B THEN       /* SSIB CORE GOTTEN      @ZA05195*/
@RF00371 TM    LCASSIBF(LCAPTR),B'00100000'                        0376
         BNO   @RF00376                                            0376
*         DO;                       /*                       @ZA05195*/
*           CALL FRESSIB;           /* FREE SSIB CORE        @ZA05195*/
         BAL   @14,FRESSIB                                         0378
*           LCASSIBF='0'B;          /* CLEAR FLAG            @ZA05195*/
         NI    LCASSIBF(LCAPTR),B'11011111'                        0379
*         END;                      /*                       @ZA05195*/
*       IF LCAPOOLF='1'B THEN       /* BLDCPOOL MACRO SUCCESSFUL   0381
*                                                            @ZA05195*/
@RF00376 TM    LCAPOOLF(LCAPTR),B'01000000'                        0381
         BNO   @RF00381                                            0381
*         DO;                       /*                       @ZA05195*/
*           CALL POOLFREE;          /* FREE WTL QUEUE POOL   @ZA05195*/
         BAL   @14,POOLFREE                                        0383
*           LCAPOOLF='0'B;          /* CLEAR FLAG            @ZA05195*/
         NI    LCAPOOLF(LCAPTR),B'10111111'                        0384
*         END;                      /*                       @ZA05195*/
*       CALL FREELCA;               /* FREE LCA CORE         @ZA05195*/
@RF00381 BAL   @14,FREELCA                                         0386
*     END;                                                         0387
*   REG14=SAVE14;                   /* RESTORE RETURN ADDRESS        */
@RF00359 LR    REG14,SAVE14                                        0388
*   END WTLCLOSE;                                                  0389
@EL00004 DS    0H                                                  0389
@EF00004 DS    0H                                                  0389
@ER00004 BR    @14                                                 0389
*DUMPRTN:                                                          0390
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);                               0390
*                                                                  0390
DUMPRTN  DS    0H                                                  0391
*   /*****************************************************************/
*   /*                                                               */
*   /* ENTRY TO THIS SUB-RTN IS FROM I/O ERROR OR STAE ERROR         */
*   /* PROCESSING . SVC 51 DUMP IS TAKEN OF LSQA , CSA , AND LOG     */
*   /* REGION . IF SUCCESSFUL , A SWITCH IS SET FOR DUMP OPERAND ON  */
*   /* MSG - IEE480I .                                               */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0391
*   DCL                                                            0391
*     DUMPLST CHAR(*) GEND;         /* GENERATED SVC(51) PARM LIST   */
*   DCL                                                            0392
*     DUMPEND GEND;                 /* END OF LIST                   */
*   DCL                                                            0393
*     DUMPLEN PTR(8) INIT(ADDR(DUMPEND)-ADDR(DUMPLST));/* LIST LENGTH*/
*   SAVE14=REG14;                   /* SAVE RETURN ADDRESS OF CALLER */
         LR    SAVE14,REG14                                        0394
*   WORKAREA(1:DUMPLEN)=DUMPLST(1:DUMPLEN);/* MOVE LIST TO CORE      */
         SLR   @07,@07                                             0395
         IC    @07,DUMPLEN                                         0395
         BCTR  @07,0                                               0395
         EX    @07,@SM02459                                        0395
*   REG1=ADDR(WORKAREA);            /* SET REG FOR DUMP              */
         LA    REG1,WORKAREA                                       0396
*   GEN(  SDUMP  MF=(E,(1)));       /* ISSUE DUMP COMMAND            */
           SDUMP  MF=(E,(1))
*   REG14=SAVE14;                   /* RESTORE RETURN ADDRESS        */
         LR    REG14,SAVE14                                        0398
*   END DUMPRTN;                                                   0399
@EL00005 DS    0H                                                  0399
@EF00005 DS    0H                                                  0399
@ER00005 BR    @14                                                 0399
*CHCKPOST:                                                         0400
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);                               0400
*                                                                  0400
CHCKPOST DS    0H                                                  0401
*   /*****************************************************************/
*   /*                                                               */
*   /* ENTRY HERE WHEN THE MULTIPLE ECB WAIT HAS BEEN POSTED TO - .  */
*   /* SET THE LOG TASK INACTIVE - MSLGCLOZ ECB . . SWITCH THE LOG   */
*   /* DATA SETS - MSLGWLOG ECB . . PUT WTL RECORDS TO LOG DATA SET -*/
*   /* MSLGWTR ECB THE POST BIT OF THE ECBS IS TESTED AND THE        */
*   /* REQUIRED PROCESSING IS PERFORMED TO SATISFY THE REQUEST. MSG  */
*   /* MODULE IEEMB807 IS CALLED TO PROCESS MSG CODES AND ISSUE WTOS.*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0401
*   NUMMSGS='00'X;                  /* PRE-SET NULL MSG CODE         */
         MVI   NUMMSGS,X'00'                                       0401
*   MAINSAV=REG14;                  /* SAVE RETURN ADDRESS           */
         ST    REG14,MAINSAV                                       0402
*   LOGLOOP=1;                      /* SET SW FOR POST/PUT LOOP      */
         MVI   LOGLOOP,X'01'                                       0403
*   DO WHILE(LOGLOOP=1);                                           0404
         B     @DE00404                                            0404
@DL00404 DS    0H                                                  0405
*     IF MSCLOSP^='1'B THEN         /* NOT WRITELOG CLOSE ECB        */
         L     @03,CVTPTR                                          0405
         L     @03,CVTMSER(,@03)                                   0405
         TM    MSCLOSP(@03),B'01000000'                            0405
         BO    @RF00405                                            0405
*       IF MSWLOGP^='1'B THEN       /* NOT WRITELOG ECB              */
         TM    MSWLOGP(@03),B'01000000'                            0406
         BO    @RF00406                                            0406
*         IF MSWTRP='1'B THEN       /* PUT RTN ECB                   */
         TM    MSWTRP(@03),B'01000000'                             0407
         BNO   @RF00407                                            0407
*           DO;                                                    0408
*                                                                  0408
*             /*******************************************************/
*             /*                                                     */
*             /* PUT ECB POSTED- RTN WTLREC ISSUES A PUT ON THE      */
*             /* BOTTOM RECORD ON THE WTL QUEUE. IF THIS IS THE LAST */
*             /* RECORD,THE MSLGWTR POST BIT IS TURNED OFF, AND EXIT */
*             /* IS MADE TO RE-ISSUE THE MULTIPLE ECB WAIT IN MAIN-  */
*             /* LINE RTN. ELSE RETURN IS TO TOP OF CHCKPOST RTN TO  */
*             /* TEST FOR A POST OR MSLGCLOZ OR MSLGWLOG ECBS. IF    */
*             /* THEY HAVE BEEN POSTED,THE POST IS PROCESSED, ELSE   */
*             /* THE PUT RTN CONTINUES TO WRITE OUT THE WTL QUEUE.   */
*             /*                                                     */
*             /*******************************************************/
*                                                                  0409
*             CALL WTLREC;          /* PUT RECORD TO LOG DATA SET    */
         BAL   @14,WTLREC                                          0409
*             IF REG15=0000 THEN    /* LAST RECORD PUT TO LOG DATASET*/
         SLR   @03,@03                                             0410
         CR    REG15,@03                                           0410
         BNE   @RF00410                                            0410
*               DO;                                                0411
*                 MSLGWTR=0000;     /* CLEAR PUT ECB                 */
         L     @09,CVTPTR                                          0412
         L     @09,CVTMSER(,@09)                                   0412
         ST    @03,MSLGWTR(,@09)                                   0412
*                 LOGLOOP='00'X;    /* END POST/PUT LOOP             */
         MVI   LOGLOOP,X'00'                                       0413
*               END;                                               0414
*           END;                                                   0415
*         ELSE                                                     0416
*           ;                                                      0416
@RF00407 DS    0H                                                  0417
*       ELSE                        /* LOG DATA SET SWITCH POSTED    */
*         CALL SWITCHDS;            /* PROCESS TO SWITCH DATA SETS   */
         B     @RC00406                                            0417
@RF00406 BAL   @14,SWITCHDS                                        0417
*     ELSE                          /* LOG TERMINATION ECB POSTED    */
*       CALL LOGTERM;               /* PROCESS TO CLOSE LOG          */
         B     @RC00405                                            0418
@RF00405 BAL   @14,LOGTERM                                         0418
*   END;                                                           0419
@RC00405 DS    0H                                                  0419
@DE00404 CLI   LOGLOOP,1                                           0419
         BE    @DL00404                                            0419
*   REG14=MAINSAV;                  /* RESTORE RETURN ADDRESS        */
         L     REG14,MAINSAV                                       0420
*   END CHCKPOST;                                                  0421
@EL00006 DS    0H                                                  0421
@EF00006 DS    0H                                                  0421
@ER00006 BR    @14                                                 0421
*SWITCHDS:                                                         0422
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);                               0422
*                                                                  0422
SWITCHDS DS    0H                                                  0423
*   /*****************************************************************/
*   /*                                                               */
*   /* DATA SET SWITCH ECB POSTED- CALL ALLOCRTN TO GET A NEW LOG    */
*   /* DATA SET. IF NOT SUCCESSFUL,SET 'SWITCH FAILED' MSG           */
*   /* CODE,RETURN TO MULTIPLE WAIT IN MAIN-LINE. CALL NEWACB TO GET */
*   /* ACB CORE ,CALL OPENRTN TO OPEN NEW LOG DATA SET. IF OPEN      */
*   /* FAILS,FREE ACB CORE, CALL UNALLOC RTN TO FREE NEW DATA SET,   */
*   /* SET 'SW FAIL' MSG CODE,RETURN TO MULTI WAIT IN MAIN-LINE.     */
*   /* UPDATE ACB AND DATA SET PTRS, CALL CLOSRTN TO CLOSE 'OLD' LOG */
*   /* DATA SET, UNALLOCATE 'OLD' DATA SET. IF UNALLOCATE FAILS SET  */
*   /* 'DATA LOSS' MSG CODE, ELSE 'Q'ED MSG CODE,RETURN TO MULTI-WAIT*/
*   /* IN MAIN-LINE.                                                 */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0423
*   DCL                                                            0423
*     REDO LABEL;                   /* LABEL FOR 'CS' INSTRUCTION    */
*   REGSAV2=REG14;                  /* SAVE RETURN ADDRESS           */
         ST    REG14,REGSAV2                                       0424
*   MSLGWLOG=0000;                  /* CLEAR WRITELOG ECB            */
         L     @03,CVTPTR                                          0425
         L     @03,CVTMSER(,@03)                                   0425
         SLR   @09,@09                                             0425
         ST    @09,MSLGWLOG(,@03)                                  0425
*   REG15=4;                        /* SET CONTROL SW FOR PUT RTN    */
         LA    REG15,4                                             0426
*   DO WHILE(REG15^=0000);                                         0427
         B     @DE00427                                            0427
@DL00427 DS    0H                                                  0428
*     CALL WTLREC;                  /* PUT WTL QUEUE TO LOG DATA SET */
         BAL   @14,WTLREC                                          0428
*   END;                                                           0429
@DE00427 LTR   REG15,REG15                                         0429
         BNZ   @DL00427                                            0429
*   CALL ALLOCRTN;                  /* GET NEW LOG DATA SET          */
         BAL   @14,ALLOCRTN                                        0430
*   IF REG15=0000 THEN              /* ALLOCATION SUCCESSFUL         */
         LTR   REG15,REG15                                         0431
         BNZ   @RF00431                                            0431
*     DO;                                                          0432
*       CALL NEWACB;                /* GET, INITIALIZE ACB           */
         BAL   @14,NEWACB                                          0433
*       IF REG15=0000 THEN          /* CORE GOTTEN FOR ACB           */
         LTR   REG15,REG15                                         0434
         BNZ   @RF00434                                            0434
*         DO;                                                      0435
*           CALL OPENRTN;           /* OPEN NEW LOG DATA SET         */
         BAL   @14,OPENRTN                                         0436
*           IF REG15=0000 THEN      /* OPEN SUCCESSFUL               */
         LTR   REG15,REG15                                         0437
         BNZ   @RF00437                                            0437
*             DO;                                                  0438
*               LCACBTWO=LCACBONE;  /* OLD ACB PTR FOR CLOSE         */
         L     @03,LCACBONE(,LCAPTR)                               0439
         ST    @03,LCACBTWO(,LCAPTR)                               0439
*               LCACBONE=ACBPTR;    /* CURRENT ACB PTR               */
         L     @09,ACBPTR                                          0440
         ST    @09,LCACBONE(,LCAPTR)                               0440
*               LCADDTWO=LCADDONE;  /* OLD DDNAME PTR FOR UNALLOC    */
         MVC   LCADDTWO(8,LCAPTR),LCADDONE(LCAPTR)                 0441
*               LCADDONE=DDALNM;    /* CURRENT DDNAME PTR            */
         MVC   LCADDONE(8,LCAPTR),DDALNM                           0442
*               ACBPTR=LCACBTWO;    /* SET OLD ACB PTR FOR FREE      */
         ST    @03,ACBPTR                                          0443
*               CALL CLOSRTN;       /* CLOSE OLD DATA SET            */
         BAL   @14,CLOSRTN                                         0444
*               CALL UNALLOC;       /* UNALLOCATE OLD DATA SET       */
         BAL   @14,UNALLOC                                         0445
*               IF REG15=0000 THEN  /* UNALLOCATION SUCCESSFUL       */
         LTR   REG15,REG15                                         0446
         BNZ   @RF00446                                            0446
*                 MSGONE=MSG1;      /* 'Q' TO SYSOUT MSG             */
         IC    @03,MSG1                                            0447
         STC   @03,MSGONE                                          0447
*               ELSE                                               0448
*                 MSGONE=MSG2;      /* UNALLOC FAILED MSG            */
         B     @RC00446                                            0448
@RF00446 IC    @03,MSG2                                            0448
         STC   @03,MSGONE                                          0448
*               MSGCLS=OUTCLS;      /* SET OUTPUT CLASS VALUE        */
@RC00446 IC    @03,OUTCLS                                          0449
         STC   @03,MSGCLS                                          0449
*               LOGLOOP='00'X;      /* END POST/PUT LOOP             */
         MVI   LOGLOOP,X'00'                                       0450
*             END;                                                 0451
*           ELSE                    /* OPEN FAILURE                  */
*             DO;                                                  0452
         B     @RC00437                                            0452
@RF00437 DS    0H                                                  0453
*               LCADDTWO=DDALNM;    /* UNALLOCATE DDNAME             */
         MVC   LCADDTWO(8,LCAPTR),DDALNM                           0453
*               CALL UNALLOC;       /* UNALLOCATE NEW LOG DATA SET   */
         BAL   @14,UNALLOC                                         0454
*               MSGONE=MSG6;        /* D/S SWITCH MSG                */
         IC    @03,MSG6                                            0455
         STC   @03,MSGONE                                          0455
*               LOGLOOP='00'X;      /* END POST/PUT LOOP             */
         MVI   LOGLOOP,X'00'                                       0456
*             END;                                                 0457
*           CALL FREEACB;           /* FREE ACB CORE                 */
@RC00437 BAL   @14,FREEACB                                         0458
*         END;                                                     0459
*       ELSE                        /* GET ACB CORE FAILED           */
*         DO;                                                      0460
         B     @RC00434                                            0460
@RF00434 DS    0H                                                  0461
*           LCADDTWO=DDALNM;        /* ALLOCATED DDNAME              */
         MVC   LCADDTWO(8,LCAPTR),DDALNM                           0461
*           CALL UNALLOC;           /* UNALLOCATE NEW DATA SET       */
         BAL   @14,UNALLOC                                         0462
*           MSGONE=MSG6;            /* D/S SWITCH FAILED MSG         */
         IC    @03,MSG6                                            0463
         STC   @03,MSGONE                                          0463
*           LOGLOOP='00'X;          /* END POST/PUR LOOP             */
         MVI   LOGLOOP,X'00'                                       0464
*         END;                                                     0465
*     END;                                                         0466
*   ELSE                            /* ALLOCATION FAILED             */
*     DO;                                                          0467
         B     @RC00431                                            0467
@RF00431 DS    0H                                                  0468
*       MSGONE=MSG6;                /* D/S SWITCH FAILED MSG         */
         IC    @03,MSG6                                            0468
         STC   @03,MSGONE                                          0468
*       LOGLOOP='00'X;              /* END POST/PUT LOOP             */
         MVI   LOGLOOP,X'00'                                       0469
*     END;                                                         0470
*   POSTWLOG='0'B;                  /* ZERO POSTED BIT IN LCA        */
@RC00431 L     @03,POSTWLOG(,LCAPTR)                               0471
@GL00001 LR    @09,@03                                             0471
         N     @09,@CF02461                                        0471
         CS    @03,@09,POSTWLOG(LCAPTR)                            0471
         BNE   @GL00001                                            0471
*   IF MSGONE^=MSG6 THEN            /* UNSUCCESSFUL D/S SWITCH       */
         CLC   MSGONE(1),MSG6                                      0472
         BE    @RF00472                                            0472
*     DO;                                                          0473
*       RFY                                                        0474
*        (WREG1,                                                   0474
*         WREG2) RESTRICTED;                                       0474
*       WREG1=LCALIMCT;             /* WTL COUNT FOR WRITELOG        */
         L     WREG1,LCALIMCT(,LCAPTR)                             0475
*REDO:                                                             0476
*       WREG2=0000;                 /* SET ZERO VALUE FOR WTL COUNT  */
REDO     SLR   WREG2,WREG2                                         0476
*       CS(WREG1,WREG2,LCALIMCT);   /* SWAP IN ZERO VALUE            */
         CS    WREG1,@07,LCALIMCT(LCAPTR)                          0477
*       BC(7,REDO);                 /* RE-PROCESS IF COMPARE FAILS   */
         BC    7,REDO                                              0478
*       RFY                                                        0479
*        (WREG1,                                                   0479
*         WREG2) UNRESTRICTED;                                     0479
*     END;                                                         0480
*   NUMMSGS=1;                      /* WTOS TO ISSUE                 */
@RF00472 MVI   NUMMSGS,X'01'                                       0481
*   REG1=ADDR(MSGPARM);             /* SET PARM REG                  */
         LA    REG1,MSGPARM                                        0482
*   CALL IEEMB807;                  /* ISSUE WTO MSG                 */
         L     @15,@CV02192                                        0483
         BALR  @14,@15                                             0483
*   REG14=REGSAV2;                  /* RESTORE RETURN ADDRESS        */
         L     REG14,REGSAV2                                       0484
*   END SWITCHDS;                                                  0485
@EL00007 DS    0H                                                  0485
@EF00007 DS    0H                                                  0485
@ER00007 BR    @14                                                 0485
*LOGTERM:                                                          0486
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);                               0486
*                                                                  0486
LOGTERM  DS    0H                                                  0487
*   /*****************************************************************/
*   /*                                                               */
*   /* IF AT LOG CLOSE, THE ECB (MSLGCLOZ) CONTAINS          @YM06135*/
*   /* A COMPLETION CODE OF FOUR, A MESSAGE (IEE775I)        @YM06135*/
*   /* IS ISSUED TO INFORM THE OPERATOR THE LOG              @YM06135*/
*   /* TERMINATION IS IN PROCESS BECAUSE BUFFER CORE         @YM06135*/
*   /* IS NOT AVAILABLE.                                     @YM06135*/
*   /* LOG TASK INACTIVE ECB POSTED - CALL SHUTDOWN TO SET LOG TASK  */
*   /* NOT ACTIVE. CALL WTLREC RTN TO WRITE THE WTL QUEUE TO THE LOG */
*   /* DATA SET. UPDATE ACB AND DDNAME PTRS AND CLOSE AND UNALLOCATE */
*   /* THE LOG DATA SET. SET MSG CODE TO REFLECT RETURN CODE FROM    */
*   /* UNALLOC RTN. CALL WTLCLOSE RTN TO FREE ALL CONTROL BLOCKS AND */
*   /* AREAS CREATED BY LOG TASK. RETURN TO TOP OF MAIN-LINE RTN TO  */
*   /* WAIT ON ECB MSLGSTRT FOR A WRITELOG START COMMAND TO BE       */
*   /* ISSUED.                                                       */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0487
*   DCL                                                            0487
*     1 ECBMAP DEF(MSLGCLOZ),       /* COMPLETION CODE MAPP  @YM06135*/
*      2 * CHAR(3),                                                0487
*      2 ECBCODE CHAR(1);                                          0487
*   REGSAV2=REG14;                  /* SAVE RETURN ADDRESS           */
         ST    REG14,REGSAV2                                       0488
*   IF ECBCODE=4 THEN               /* SVC BLDCPOOL FAIL     @YM06135*/
         L     @03,CVTPTR                                          0489
         L     @03,CVTMSER(,@03)                                   0489
         CLI   ECBCODE(@03),4                                      0489
         BNE   @RF00489                                            0489
*     DO;                                                          0490
*       MSGONE=MSG8;                /* CORE UNAVAILABLE MSG  @YM06135*/
         IC    @03,MSG8                                            0491
         STC   @03,MSGONE                                          0491
*       NUMMSGS=1;                  /* WTOS TO ISSUE         @YM06135*/
         MVI   NUMMSGS,X'01'                                       0492
*       REG1=ADDR(MSGPARM);         /* SET PARM REG          @YM06135*/
         LA    REG1,MSGPARM                                        0493
*       CALL IEEMB807;              /* ISSUE WTO MSG         @YM06135*/
         L     @15,@CV02192                                        0494
         BALR  @14,@15                                             0494
*     END;                                                         0495
*   MSLGCLOZ=0000;                  /* CLEAR CLOSE ECB               */
@RF00489 L     @03,CVTPTR                                          0496
         L     @03,CVTMSER(,@03)                                   0496
         SLR   @09,@09                                             0496
         ST    @09,MSLGCLOZ(,@03)                                  0496
*   CALL SHUTDOWN;                  /* SET LOG NOT ACTIVE            */
         BAL   @14,SHUTDOWN                                        0497
*   REG15=4;                        /* SET CONTROL SW FOR PUT RTN    */
         LA    REG15,4                                             0498
*   DO WHILE(REG15^=0000);                                         0499
         B     @DE00499                                            0499
@DL00499 DS    0H                                                  0500
*     CALL WTLREC;                  /* PUT WTL QUEUE TO LOG DATA SET */
         BAL   @14,WTLREC                                          0500
*   END;                                                           0501
@DE00499 LTR   REG15,REG15                                         0501
         BNZ   @DL00499                                            0501
*   LCADDTWO=LCADDONE;              /* SET DD PTR FOR UNALLOCATE     */
         MVC   LCADDTWO(8,LCAPTR),LCADDONE(LCAPTR)                 0502
*   LCACBTWO=LCACBONE;              /* SET ACB PTR FOR CLOSERTN      */
         L     @03,LCACBONE(,LCAPTR)                               0503
         ST    @03,LCACBTWO(,LCAPTR)                               0503
*   ACBPTR=LCACBONE;                /* SET ACB PTR FOR FREE          */
         ST    @03,ACBPTR                                          0504
*   CALL CLOSRTN;                   /* CLOSE LOG DATA SET            */
         BAL   @14,CLOSRTN                                         0505
*   CALL UNALLOC;                   /* UNALLOCATE LOG DATA SET       */
         BAL   @14,UNALLOC                                         0506
*   IF REG15=0000 THEN              /* UNALLOCATE SUCCESSFUL ?       */
         LTR   REG15,REG15                                         0507
         BNZ   @RF00507                                            0507
*     MSGONE=MSG1;                  /* SET QUEUED DATA MSG CODE      */
         IC    @03,MSG1                                            0508
         STC   @03,MSGONE                                          0508
*   ELSE                                                           0509
*     MSGONE=MSG2;                  /* NO, SET 'DATA LOSS' MSG CODE  */
         B     @RC00507                                            0509
@RF00507 IC    @03,MSG2                                            0509
         STC   @03,MSGONE                                          0509
*   MSGCLS=MSLOGCLS;                /* SET OUTPUT CLASS VALUE        */
@RC00507 L     @03,CVTPTR                                          0510
         L     @03,CVTMSER(,@03)                                   0510
         IC    @09,MSLOGCLS(,@03)                                  0510
         STC   @09,MSGCLS                                          0510
*   CALL WTLCLOSE;                  /* CLEAN UP LOG CORE             */
         BAL   @14,WTLCLOSE                                        0511
*   LOGLOOP='00'X;                  /* EXIT FROM CHCKPOST LOOP       */
         MVI   LOGLOOP,X'00'                                       0512
*   LOGWAIT='00'X;                  /* EXIT FROM MAIN-LINE WAIT LOOP */
         MVI   LOGWAIT,X'00'                                       0513
*   REG14=REGSAV2;                  /* RESTORE RETURN ADDRESS        */
         L     REG14,REGSAV2                                       0514
*   END LOGTERM;                                                   0515
@EL00008 DS    0H                                                  0515
@EF00008 DS    0H                                                  0515
@ER00008 BR    @14                                                 0515
*SHUTDOWN:                                                         0516
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);                               0516
*                                                                  0516
SHUTDOWN DS    0H                                                  0517
*   /*****************************************************************/
*   /*                                                               */
*   /* THE SYSTEM LOG FUNCTION IS BEING MADE INACTIVE DUE TO A       */
*   /* WRITELOG CLOSE COMMAND -(NORMAL) , OR AN ABEND IN THE LOG TASK*/
*   /* -(ABNORMAL,VIA ESTAE PROCESSING). SET LCA PTR IN BASEA(BALOG) */
*   /* TO ZERO , SET COMM-TASK INTERFACE FIELDS , POST COMM-TASK THAT*/
*   /* THE LOG IS INACTIVE. IF ANY LOG SVC(36)S ARE STILL EXECUTING, */
*   /* ISSUE A WAIT ON MULTIPLE LOG ECBS . THE LAST SVC(36) WILL POST*/
*   /* THE LOG TO CLOSE. RETURN TO CALLER.                           */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0517
*   DCL                                                            0517
*     SVCWAIT PTR(8);               /* SWITCH FOR WAIT LOOP          */
*   REGSAV=REG14;                   /* SAVE RETURN ADDRESS           */
         LR    REGSAV,REG14                                        0518
*   BALOG=0000;                     /* ZERO LCA PTR                  */
         L     @09,CVTPTR                                          0519
         L     @08,CVTMSER(,@09)                                   0519
         SLR   @07,@07                                             0519
         ST    @07,BALOG(,@08)                                     0519
*   MSLOGTHD='1'B;                  /* SET COMM-TASK INDICATOR ON    */
         OI    MSLOGTHD(@08),B'01000000'                           0520
*   IF UCMSYSG='1'B THEN            /* LOG = HARDCOPY                */
         L     @09,UCMBASPT(,@09)                                  0521
         LR    @08,@09                                             0521
         AL    @08,@CF02465                                        0521
         L     @08,UCMMCSPT(,@08)                                  0521
         TM    UCMSYSG(@08),B'00000010'                            0521
         BNO   @RF00521                                            0521
*     DO;                                                          0522
*                                                                  0522
*       /*************************************************************/
*       /*                                                           */
*       /* COMM-TASK MUST BE MADE AWARE THAT THE LOG IS CLOSING SET  */
*       /* UP AND POST COMM-TASK ATTENTION ECB.                      */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0523
*       POSTCORE=POSTLIST;          /* MOVE LIST TO GOTTEN CORE      */
         MVC   POSTCORE(12),POSTLIST                               0523
*       UCMSYSO='1'B;               /* SET LOG ATTENTION BIT         */
         OI    UCMSYSO(@08),B'00000010'                            0524
*       REG1=ADDR(POSTCORE);        /* ADDR OF POST PARM LIST        */
         LA    REG1,POSTCORE                                       0525
*       REG2=UCMASCB;               /* COMM-TASK ASCB TO REG         */
         L     REG2,UCMASCB(,@09)                                  0526
*       ECBAD=ADDR(UCMAECB);        /* COMM-TASK ECB ADDR            */
         LA    @09,UCMAECB(,@09)                                   0527
         ST    @09,ECBAD                                           0527
*       GEN( POST ASCB=(2),ERRET=CVTBRET,MF=(E,(1)));              0528
          POST ASCB=(2),ERRET=CVTBRET,MF=(E,(1))
*     END;                                                         0529
*   IF MSLOGSVC^=0000 THEN          /* SVCS STILL EXECUTING          */
@RF00521 L     @09,CVTPTR                                          0530
         L     @09,CVTMSER(,@09)                                   0530
         L     @09,MSLOGSVC(,@09)                                  0530
         LTR   @09,@09                                             0530
         BZ    @RF00530                                            0530
*     DO;                                                          0531
*       SVCWAIT=1;                  /* SET LOOP VALUE                */
         LA    SVCWAIT,1                                           0532
*       DO WHILE(SVCWAIT=1);                                       0533
         B     @DE00533                                            0533
@DL00533 DS    0H                                                  0534
*         REG1=ADDR(LCAELST);       /* ADDR OF LOG ECB LIST          */
         LA    REG1,LCAELST(,LCAPTR)                               0534
*         GEN( WAIT  ECBLIST=(1));  /* WAIT ON ALL ECBS              */
          WAIT  ECBLIST=(1)
*         IF MSWTRP^='1'B THEN      /* NOT POSTED FOR PUT RTN        */
         L     @05,CVTPTR                                          0536
         L     @05,CVTMSER(,@05)                                   0536
         TM    MSWTRP(@05),B'01000000'                             0536
         BO    @RF00536                                            0536
*           SVCWAIT='00'X;          /* EXIT FROM LOOP                */
         SLR   SVCWAIT,SVCWAIT                                     0537
*         ELSE                                                     0538
*           MSWTRSW=MSWTRSW&'00111111'B;/* CLEAR POST BIT , RE-WAIT  */
         B     @RC00536                                            0538
@RF00536 L     @05,CVTPTR                                          0538
         L     @05,CVTMSER(,@05)                                   0538
         LA    @09,63                                              0538
         SLR   @08,@08                                             0538
         IC    @08,MSWTRSW(,@05)                                   0538
         NR    @09,@08                                             0538
         STC   @09,MSWTRSW(,@05)                                   0538
*       END;                                                       0539
@RC00536 DS    0H                                                  0539
@DE00533 C     SVCWAIT,@CF00078                                    0539
         BE    @DL00533                                            0539
*     END;                                                         0540
*   REG14=REGSAV;                   /* RESTORE RETURN ADDRESS        */
@RF00530 LR    REG14,REGSAV                                        0541
*   END SHUTDOWN;                                                  0542
@EL00009 DS    0H                                                  0542
@EF00009 DS    0H                                                  0542
@ER00009 BR    @14                                                 0542
*POOLFREE:                                                         0543
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);                               0543
*                                                                  0543
POOLFREE DS    0H                                                  0544
*   /*****************************************************************/
*   /*                                                               */
*   /* ENTRY HERE IS TO FREE CORE GOTTEN VIA BLDCPOOL MACRO FOR THE  */
*   /* WTL QUEUE POOL.                                               */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0544
*   REGSAV=REG14;                   /* SAVE RETURN ADDRESS           */
         LR    REGSAV,REG14                                        0544
*   REG1=LCACPID;                   /* SET UNIQUE POOL ID            */
         L     REG1,LCACPID(,LCAPTR)                               0545
*   GEN( DELCPOOL  CPID=(1),BRANCH=YES);                           0546
          DELCPOOL  CPID=(1),BRANCH=YES
*   REG14=REGSAV;                   /* RESTORE RETURN ADDRESS        */
         LR    REG14,REGSAV                                        0547
*   END POOLFREE;                                                  0548
@EL00010 DS    0H                                                  0548
@EF00010 DS    0H                                                  0548
@ER00010 BR    @14                                                 0548
*FREELCA:                                                          0549
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);                               0549
*                                                                  0549
FREELCA  DS    0H                                                  0550
*   /*****************************************************************/
*   /*                                                               */
*   /* ENTRY TO THIS RTN IS TO FREE CORE GOTTEN FOR THE LCA AND RPL  */
*   /* CONTROL BLOCKS                                                */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0550
*   REGSAV=REG14;                   /* SAVE RETURN ADDRESS           */
         LR    REGSAV,REG14                                        0550
*   REG0=LCASIZE+LENRPL;            /* LENGTH TO FREE , LCA AND RPL  */
         SLR   REG0,REG0                                           0551
         IC    REG0,LCASIZE                                        0551
         SLR   @05,@05                                             0551
         IC    @05,LENRPL                                          0551
         ALR   REG0,@05                                            0551
*   REG0=REG0×SPNFLD;               /* SUBPOOL = 231                 */
         O     REG0,SPNFLD                                         0552
*   REG1=LCASAVE;                   /* ADDRESS OF GOTTEN CORE        */
         L     REG1,LCASAVE                                        0553
*   GEN( FREEMAIN R,LV=(0),A=(1));  /* FREE LCA , RPL CORE           */
          FREEMAIN R,LV=(0),A=(1)
*   REG14=REGSAV;                   /* RESTORE RETURN ADDRESS        */
         LR    REG14,REGSAV                                        0555
*   END FREELCA;                                                   0556
@EL00011 DS    0H                                                  0556
@EF00011 DS    0H                                                  0556
@ER00011 BR    @14                                                 0556
*FREEACB:                                                          0557
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);                               0557
*                                                                  0557
FREEACB  DS    0H                                                  0558
*   /*****************************************************************/
*   /*                                                               */
*   /* ENTRY HERE IS TO FREE CORE GOTTEN FOR THE ACB CONTROL BLOCK   */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0558
*   REGSAV=REG14;                   /* SAVE RETURN ADDRESS           */
         LR    REGSAV,REG14                                        0558
*   REG0=LENACB2;                   /* LENGTH TO FREE                */
         L     REG0,LENACB2                                        0559
*   REG0=REG0×SPNFLD;               /* SUBPOOL = 231                 */
         O     REG0,SPNFLD                                         0560
*   REG1=ACBPTR;                    /* CORE ADDRESS                  */
         L     REG1,ACBPTR                                         0561
*   GEN( FREEMAIN R,LV=(0),A=(1));  /* FREE CORE                     */
          FREEMAIN R,LV=(0),A=(1)
*   REG14=REGSAV;                   /* RESTORE RETURN ADDRESS        */
         LR    REG14,REGSAV                                        0563
*   END FREEACB;                                                   0564
@EL00012 DS    0H                                                  0564
@EF00012 DS    0H                                                  0564
@ER00012 BR    @14                                                 0564
*ACBINIT:                                                          0565
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);                               0565
*                                                                  0565
ACBINIT  DS    0H                                                  0566
*   /*****************************************************************/
*   /*                                                               */
*   /* THE ACCESS CONTROL BLOCK -ACB- IS USED BY THE OPEN MACRO TO   */
*   /* OPEN AN ALLOCATED LOG DATA SET. ENTRY IS TO GET AND INITIALIZE*/
*   /* CORE FOR AN ACB CONTROL BLOCK                                 */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0566
*   REGSAV=REG14;                   /* SAVE RETURN ADDRESS           */
         LR    REGSAV,REG14                                        0566
*   REG0=LENACB2;                   /* LENGTH OF CORE NEEDED         */
         L     REG0,LENACB2                                        0567
*   REG0=REG0×SPNFLD;               /* SUBPOOL = 231                 */
         O     REG0,SPNFLD                                         0568
*   GEN( GETMAIN R,LV=(0));         /* GET CORE                      */
          GETMAIN R,LV=(0)
*   ACBPTR=REG1;                    /* SAVE ACB ADDRESS              */
         ST    REG1,ACBPTR                                         0570
*   LCAACBF='1'B;                   /* SET ACB CORE GOTTEN BIT       */
         OI    LCAACBF(LCAPTR),B'00000100'                         0571
*   ACBCORE(1:LENACB2)=ACBLIST(1:LENACB2);/* MOVE IN ACB             */
         L     @09,ACBPTR                                          0572
         L     @08,LENACB2                                         0572
         BCTR  @08,0                                               0572
         EX    @08,@SM02467                                        0572
*   REG14=REGSAV;                   /* RESTORE RETURN ADDRESS        */
         LR    REG14,REGSAV                                        0573
*   END ACBINIT;                                                   0574
@EL00013 DS    0H                                                  0574
@EF00013 DS    0H                                                  0574
@ER00013 BR    @14                                                 0574
*NEWACB:                                                           0575
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);                               0575
*                                                                  0575
NEWACB   DS    0H                                                  0576
*   /*****************************************************************/
*   /*                                                               */
*   /* ENTRY HERE IS FROM SUB-RTN SWITCHDS TO GET CORE FOR A NEW ACB */
*   /* CONTROL BLOCK REQUIRED TO PERFORM A LOG DATA SET SWITCH. THE  */
*   /* CORE IS GOTTEN VIA A CONDITIONAL GETMAIN MACRO IN SP 231 IF   */
*   /* GETMAIN IS SUCCESSFUL (REG15 = ZERO), THE ACBPTR FIELD IS     */
*   /* INITIALIZED WITH THE GOTTEN CORE ADDRESS AND THE LIST FORM OF */
*   /* THE ACB IS MOVED INTO CORE . IF GETMAIN FAILS (REG15 = FOUR), */
*   /* NO FURTHER PROCESSING TAKES PLACE IN THIS RTN. RETURN TO      */
*   /* CALLER TO PROCESS THE REG15 RETURN CODE.                      */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0576
*   DCL                                                            0576
*     GETLIST CHAR(*) GEND;         /* LIST FORM OF GETMAIN          */
*   DCL                                                            0577
*     GETEND GEND;                  /* END OF LIST INDICATOR         */
*   DCL                                                            0578
*     GETLEN PTR(8) INIT(ADDR(GETEND)-ADDR(GETLIST));/* LIST LENGTH  */
*   DCL                                                            0579
*     GETADPTR PTR(31);             /* GOTTEN CORE ADDRESS           */
*   REGSAV=REG14;                   /* SAVE RETURN ADDRESS           */
         LR    REGSAV,REG14                                        0580
*   RFY                                                            0581
*    (REG4) RESTRICTED;                                            0581
*   REG1=ADDR(WORKAREA);            /* CORE FOR GETMAIN LIST FORM    */
         LA    REG1,WORKAREA                                       0582
*   WORKAREA(1:GETLEN)=GETLIST(1:GETLEN);/* MOVE IN LIST FORM        */
         SLR   @05,@05                                             0583
         IC    @05,GETLEN                                          0583
         BCTR  @05,0                                               0583
         EX    @05,@SM02469                                        0583
*   REG4=LENACB2;                   /* LENGTH OF CORE NEEDED         */
         L     REG4,LENACB2                                        0584
*   GEN( GETMAIN  LV=(4),A=GETADPTR,MF=(E,(1)));/* ISSUE GETMAIN     */
          GETMAIN  LV=(4),A=GETADPTR,MF=(E,(1))
*   IF REG15=0000 THEN              /* GETMAIN SUCCESSFUL            */
         LTR   REG15,REG15                                         0586
         BNZ   @RF00586                                            0586
*     DO;                                                          0587
*       ACBPTR=GETADPTR;            /* INITIALIZE NEW CORE ADDRESS   */
         L     @05,GETADPTR                                        0588
         ST    @05,ACBPTR                                          0588
*       ACBCORE(1:LENACB2)=ACBLIST(1:LENACB2);/* INITIALIZE NEW ACB
*                                      FROM LIST                     */
         L     @09,LENACB2                                         0589
         BCTR  @09,0                                               0589
         EX    @09,@SM02471                                        0589
*     END;                                                         0590
*   REG14=REGSAV;                   /* RESTORE RETURN ADDRESS        */
@RF00586 LR    REG14,REGSAV                                        0591
*   RFY                                                            0592
*    (REG4) UNRESTRICTED;                                          0592
*   END NEWACB;                                                    0593
@EL00014 DS    0H                                                  0593
@EF00014 DS    0H                                                  0593
@ER00014 BR    @14                                                 0593
*OPENRTN:                                                          0594
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);                               0594
*                                                                  0594
OPENRTN  DS    0H                                                  0595
*   /*****************************************************************/
*   /*                                                               */
*   /* PROCESS THE ALLOCATED LOG DATA SET FOR OPEN VIA ACB . ACB CORE*/
*   /* IS INITIALIZED FROM ITS LIST FORM , ACB PTR IS PUT IN REG2 ,  */
*   /* THE DATA SET DDNAME -(DDALNM)- IS STORED IN ACB , AND THE OPEN*/
*   /* MACRO IS ISSUED. IF OPEN FAILS , SET REG15 RETURN CODE = FOUR.*/
*   /* ELSE INITIALIZE THE RPLDACB FIELD IN THE RPL CONTROL BLK.     */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0595
*   REGSAV=REG14;                   /* SAVE RETURN ADDRESS           */
         LR    REGSAV,REG14                                        0595
*   REG1=ADDR(OPENCORE);            /* PTR TO OPEN MACRO             */
         LA    REG1,OPENCORE                                       0596
*   REG2=ACBPTR;                    /* PTR TO ACB TO OPEN            */
         L     @09,ACBPTR                                          0597
         LR    REG2,@09                                            0597
*   OPENCORE(1:OPENLEN2)=OPENLIST(1:OPENLEN2);/* MOVE IN LIST FORM   */
         L     @08,OPENLEN2                                        0598
         BCTR  @08,0                                               0598
         EX    @08,@SM02473                                        0598
*   ACBDDNM=DDALNM;                 /* LOG DATA SET DDNAME TO ACB    */
         MVC   ACBDDNM(8,@09),DDALNM                               0599
*   GEN( OPEN ((2)),MF=(E,(1)));    /* OPEN THE ACB                  */
          OPEN ((2)),MF=(E,(1))
*   IF ACBOPEN^='1'B THEN           /* OPEN FAILED                   */
         L     @09,ACBPTR                                          0601
         TM    ACBOPEN(@09),B'00010000'                            0601
         BO    @RF00601                                            0601
*     REG15=4;                      /* SET FAILED RETURN CODE        */
         LA    REG15,4                                             0602
*   ELSE                                                           0603
*     DO;                                                          0603
         B     @RC00601                                            0603
@RF00601 DS    0H                                                  0604
*       RPLDACB=ACBPTR;             /* ACB PTR INTO RPL FIELD        */
         L     @09,LCARPLP(,LCAPTR)                                0604
         L     @08,ACBPTR                                          0604
         ST    @08,RPLDACB(,@09)                                   0604
*       REG15=0000;                 /* SET SUCCESSFUL RETURN CODE    */
         SLR   REG15,REG15                                         0605
*     END;                                                         0606
*   REG14=REGSAV;                   /* RESTORE RETURN ADDRESS        */
@RC00601 LR    REG14,REGSAV                                        0607
*   END OPENRTN;                                                   0608
@EL00015 DS    0H                                                  0608
@EF00015 DS    0H                                                  0608
@ER00015 BR    @14                                                 0608
*NEWLOG:                                                           0609
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);                               0609
*                                                                  0609
NEWLOG   DS    0H                                                  0610
*   /*****************************************************************/
*   /*                                                               */
*   /* ENTRY HERE IS FOR A ZERO LCA PTR IN BASEA(BALOG) FIELD. FOR   */
*   /* ENTRY AT IPL , IF THE LOG IS HARDCOPY THE POSTED BIT IS TURNED*/
*   /* ON TO ALLOW COMM-TASK TO ISSUE WTLS TO LOG. REQUIRED BITS ARE */
*   /* SET , COMM-TASK ATTENTION ECB IS POSTED , AND THE SYSTEM LOG  */
*   /* LCA PTR IS INITIALIZED - IEEBASEA(BALOG). RETURN TO CALLER    */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0610
*   MAINSAV=REG14;                  /* SAVE RETURN ADDRESS           */
         ST    REG14,MAINSAV                                       0610
*   IF UCMRQLM1^='00'X THEN         /* THIS IS IPL TIME              */
         L     @03,CVTPTR                                          0611
         L     @03,UCMBASPT(,@03)                                  0611
         CLI   UCMRQLM1(@03),0                                     0611
         BE    @RF00611                                            0611
*     DO;                                                          0612
*       UCMRQLM1='00'X;             /* ZERO FIELD                    */
         MVI   UCMRQLM1(@03),X'00'                                 0613
*       IF UCMSYSG='1'B THEN        /* LOG = HARDCOPY                */
         AL    @03,@CF02465                                        0614
         L     @03,UCMMCSPT(,@03)                                  0614
         TM    UCMSYSG(@03),B'00000010'                            0614
         BNO   @RF00614                                            0614
*         UCMNPECB=UCMNPECB×NIPSW;  /* SET POST BIT IN DUMMY ECB     */
         L     @09,UCMNPECB(,@03)                                  0615
         O     @09,NIPSW                                           0615
         ST    @09,UCMNPECB(,@03)                                  0615
*     END;                                                         0616
@RF00614 DS    0H                                                  0617
*   UCMSYSO='1'B;                   /* LOG ATTENTION BIT             */
@RF00611 L     @03,CVTPTR                                          0617
         L     @09,UCMBASPT(,@03)                                  0617
         LR    @08,@09                                             0617
         AL    @08,@CF02465                                        0617
         L     @08,UCMMCSPT(,@08)                                  0617
         OI    UCMSYSO(@08),B'00000010'                            0617
*   MSLOGTHD='0'B;                  /* LOG ACTIVE BIT                */
         L     @03,CVTMSER(,@03)                                   0618
         NI    MSLOGTHD(@03),B'10111111'                           0618
*   POSTCORE=POSTLIST;              /* MOVE LIST TO GOTTEN CORE      */
         MVC   POSTCORE(12),POSTLIST                               0619
*   REG1=ADDR(POSTCORE);            /* ADDR OF POST PARM LIST        */
         LA    REG1,POSTCORE                                       0620
*   ECBAD=ADDR(UCMAECB);            /* COMM-TASK ECB ADDR TO LIST    */
         LA    @08,UCMAECB(,@09)                                   0621
         ST    @08,ECBAD                                           0621
*   REG2=UCMASCB;                   /* COMM-TASK ASCB PTR            */
         L     REG2,UCMASCB(,@09)                                  0622
*   BALOG=LCAPTR;                   /* LCA PTR INTO BASEA    @YM08121*/
         ST    LCAPTR,BALOG(,@03)                                  0623
*   BALOGINT='1'B;                  /* LOG ACTIVE SWITCH ON  @YM08121*/
         OI    BALOGINT(@03),B'10000000'                           0624
*   GEN( POST ASCB=(2),ERRET=CVTBRET,MF=(E,(1)));/*          @YM08121*/
          POST ASCB=(2),ERRET=CVTBRET,MF=(E,(1))
*   REG14=MAINSAV;                  /* RESTORE RETURN ADDRESS        */
         L     REG14,MAINSAV                                       0626
*   END NEWLOG;                                                    0627
@EL00016 DS    0H                                                  0627
@EF00016 DS    0H                                                  0627
@ER00016 BR    @14                                                 0627
*CLOSRTN:                                                          0628
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);                               0628
*                                                                  0628
CLOSRTN  DS    0H                                                  0629
*   /*****************************************************************/
*   /*                                                               */
*   /* PROCESS THE OLD LOG DATA SET FOR CLOSE. ON ENTRY THE ACB PTR  */
*   /* IS CONTAINED IN FIELD LCACBTWO , AND THE DDNAME IS CONTAINED  */
*   /* IN FIELD LCADDTWO.                                            */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0629
*   REGSAV=REG14;                   /* SAVE RETURN ADDRESS           */
         LR    REGSAV,REG14                                        0629
*   REG2=LCACBTWO;                  /* ACB PTR TO CLOSE              */
         L     REG2,LCACBTWO(,LCAPTR)                              0630
*   REG1=ADDR(CLOSCORE);            /* CLOSE MACRO PARM CORE         */
         LA    REG1,CLOSCORE                                       0631
*   CLOSCORE(1:CLOSLEN2)=CLOSLIST(1:CLOSLEN2);/* MOVE MACRO LIST FORM*/
         L     @09,CLOSLEN2                                        0632
         BCTR  @09,0                                               0632
         EX    @09,@SM02476                                        0632
*   GEN( CLOSE ((2)),MF=(E,(1)));   /* CLOSE THE ACB                 */
          CLOSE ((2)),MF=(E,(1))
*   LCACBTWO=0000;                  /* ZERO ACB PTR                  */
         SLR   @09,@09                                             0634
         ST    @09,LCACBTWO(,LCAPTR)                               0634
*   REG14=REGSAV;                   /* RESTORE RETURN ADDRESS        */
         LR    REG14,REGSAV                                        0635
*   END CLOSRTN;                                                   0636
@EL00017 DS    0H                                                  0636
@EF00017 DS    0H                                                  0636
@ER00017 BR    @14                                                 0636
*LOGERROR:                                                         0637
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);                               0637
*                                                                  0637
LOGERROR DS    0H                                                  0638
*   /*****************************************************************/
*   /*                                                               */
*   /* ENTRY HERE IS TO CLEAN UP LOG CORE BECAUSE OF ABNORMAL        */
*   /* PROCESSING OF THE LOG FUNCTION. THIS RTN IS CALLED BY THE     */
*   /* ESTAE EXIT RTN AND BY LOG INITIALIZATION OPEN FAILURE. THE LOG*/
*   /* DATA SET(S) ARE CLOSED AND DYNAMICALLY UNALLOCATED AND RETURN */
*   /* TO CALLER.                                                    */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0638
*   MAINSAV=REG14;                  /* SAVE RETURN ADDRESS           */
         ST    REG14,MAINSAV                                       0638
*   IF LCADDONE^=ZEROS THEN         /* A DATA SET IS ALLOCATED       */
         CLC   LCADDONE(8,LCAPTR),ZEROS                            0639
         BE    @RF00639                                            0639
*     DO;                                                          0640
*       DO WHILE(LCACBONE^=0000);                                  0641
         B     @DE00641                                            0641
@DL00641 DS    0H                                                  0642
*         IF LCACBTWO^=0000 THEN    /* TWO DATA SETS OPEN            */
         L     @03,LCACBTWO(,LCAPTR)                               0642
         LTR   @03,@03                                             0642
         BZ    @RF00642                                            0642
*           DO;                                                    0643
*             ACBPTR=LCACBTWO;      /* PTR TO SECOND ACB TO FREE     */
         ST    @03,ACBPTR                                          0644
*             CALL CLOSRTN;         /* CLOSE THE DATA SET            */
         BAL   @14,CLOSRTN                                         0645
*             CALL FREEACB;         /* FREE THE ACB CORE             */
         BAL   @14,FREEACB                                         0646
*           END;                                                   0647
*         ELSE                                                     0648
*           DO;                                                    0648
         B     @RC00642                                            0648
@RF00642 DS    0H                                                  0649
*             ACBPTR=LCACBONE;      /* PTR TO FIRST ACB TO FREE      */
         L     @03,LCACBONE(,LCAPTR)                               0649
         ST    @03,ACBPTR                                          0649
*             LCACBTWO=LCACBONE;    /* SET FIELD FOR CLOSE RTN       */
         ST    @03,LCACBTWO(,LCAPTR)                               0650
*             CALL CLOSRTN;         /* CLOSE THE DATA SET            */
         BAL   @14,CLOSRTN                                         0651
*             CALL FREEACB;         /* FREE ACB CORE                 */
         BAL   @14,FREEACB                                         0652
*             LCACBONE=0000;        /* SET LOOP EXIT VALUE           */
         SLR   @03,@03                                             0653
         ST    @03,LCACBONE(,LCAPTR)                               0653
*           END;                                                   0654
*         LCAACBF='0'B;             /* SET CORE FLAG OFF             */
@RC00642 NI    LCAACBF(LCAPTR),B'11111011'                         0655
*       END;                                                       0656
@DE00641 L     @03,LCACBONE(,LCAPTR)                               0656
         LTR   @03,@03                                             0656
         BNZ   @DL00641                                            0656
*       DO WHILE(LCADDONE^=ZEROS);                                 0657
         B     @DE00657                                            0657
@DL00657 DS    0H                                                  0658
*         IF LCADDTWO^=ZEROS THEN   /* TWO DATA SETS ALLOCATED       */
         CLC   LCADDTWO(8,LCAPTR),ZEROS                            0658
         BE    @RF00658                                            0658
*           CALL UNALLOC;           /* UNALLOCATE THE DATA SET       */
         BAL   @14,UNALLOC                                         0659
*         ELSE                                                     0660
*           DO;                                                    0660
         B     @RC00658                                            0660
@RF00658 DS    0H                                                  0661
*             LCADDTWO=LCADDONE;    /* SET PARM FOR UNALLOC RTN      */
         MVC   LCADDTWO(8,LCAPTR),LCADDONE(LCAPTR)                 0661
*             CALL UNALLOC;         /* UNALLOCATE THE DATA SET       */
         BAL   @14,UNALLOC                                         0662
*             LCADDONE=ZEROS;       /* EXIT FROM LOOP                */
         MVC   LCADDONE(8,LCAPTR),ZEROS                            0663
*           END;                                                   0664
*       END;                                                       0665
@RC00658 DS    0H                                                  0665
@DE00657 CLC   LCADDONE(8,LCAPTR),ZEROS                            0665
         BNE   @DL00657                                            0665
*     END;                                                         0666
*   REG14=MAINSAV;                  /* RESTORE RETURN ADDRESS        */
@RF00639 L     REG14,MAINSAV                                       0667
*   END LOGERROR;                                                  0668
@EL00018 DS    0H                                                  0668
@EF00018 DS    0H                                                  0668
@ER00018 BR    @14                                                 0668
*ALLOCRTN:                                                         0669
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);                               0669
*                                                                  0669
ALLOCRTN DS    0H                                                  0670
*   /*****************************************************************/
*   /*                                                               */
*   /* ENTRY IS TO DYNAMICALLY ALLOCATE A SYSOUT DATA SET FOR THE    */
*   /* SYSTEM LOG. THE DYNAM ALLOC INTERFACE IS SET UP , CLASS VALUE */
*   /* IS INITIALIZED FROM BASEA(MSLOGCLS) FIELD , AND THE SVC IS    */
*   /* INVOKED - ?DYNALLOC - . REG15 RETURN CODE WILL BE CHECKED BY  */
*   /* CALLER. RETURN TO CALLER.                                     */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0670
*   REGSAV=REG14;                   /* SAVE RETURN ADDRESS           */
         LR    REGSAV,REG14                                        0670
*   S99RBPTR=ADDR(S99RB);           /* PTR TO DYNAM ALLOC BLOCK      */
         LA    @09,S99RB                                           0671
         ST    @09,S99RBPTR                                        0671
*   S99RBPND='1'B;                  /* SET HI-BIT ON FOR DYNAM ALLOC */
         OI    S99RBPND,B'10000000'                                0672
*   S99RB=S99RB&&S99RB;             /* CLEAR CONTROL BLOCK CORE      */
         XC    S99RB(20),S99RB                                     0673
*   S99RBLN=LENGTH(S99RB);          /* LENGTH OF CONTROL BLOCK       */
         MVI   S99RBLN,X'14'                                       0674
*   S99VERB=S99VRBAL;               /* SET ALLOCATION VERB VALUE     */
         MVI   S99VERB,X'01'                                       0675
*   S99TXTPP=ADDR(ALLOCPTR);        /* PTR TO TEXT UNIT PTRS         */
         LA    @09,ALLOCPTR                                        0676
         ST    @09,S99TXTPP                                        0676
*   DATU1=DATXT1;                   /* MOVE IN SYSOUT TEXT UNIT FLDS */
         MVC   DATU1(7),DATXT1                                     0677
*   OUTCLS=MSLOGCLS;                /* INITIALIZE OUTPUT CLASS VALUE */
         L     @09,CVTPTR                                          0678
         L     @09,CVTMSER(,@09)                                   0678
         MVC   OUTCLS(1),MSLOGCLS(@09)                             0678
*   DATU2=DATXT2;                   /* MOVE IN DDNAME TEXT UNIT FLDS */
         MVC   DATU2(14),DATXT2                                    0679
*   DATU3=DATXT3;                   /* INITIALIZ LRECL FIELD @YA00804*/
         MVC   DATU3(8),DATXT3                                     0680
*   DATU4=DATXT4;                   /* INITIALIZ RECFM FIELD @YA00804*/
         MVC   DATU4(7),DATXT4                                     0681
*   DATP1=ADDR(DATU1);              /* PTR TO SYSOUT TEXT UNIT       */
         LA    @09,DATU1                                           0682
         ST    @09,DATP1                                           0682
*   DATP2=ADDR(DATU2);              /* PTR TO DDNAME TEXT UNIT       */
         LA    @09,DATU2                                           0683
         ST    @09,DATP2                                           0683
*   DATP3=ADDR(DATU3);              /* PTR TO LRECL VALUE    @YA00804*/
         LA    @09,DATU3                                           0684
         ST    @09,DATP3                                           0684
*   DATP4=ADDR(DATU4);              /* PTR TO RECFM VALUE    @YA00804*/
         LA    @09,DATU4                                           0685
         ST    @09,DATP4                                           0685
*   DATP4=DATP4×REGMASK;            /* SET END OF LIST INDICATOR   0686
*                                                            @YA00804*/
         O     @09,REGMASK                                         0686
         ST    @09,DATP4                                           0686
*   REG1=ADDR(S99RBPTR);            /* INPUT REG FOR DYNAM ALLOC SVC */
         LA    REG1,S99RBPTR                                       0687
*/* MACDATE Y-2 73082                                                */
*                                                                  0688
*   SVC(99);                        /* INVOKE DYNAM ALLOCATION       */
         SVC   99                                                  0688
*   REG14=REGSAV;                   /* RESTORE RETURN ADDRESS        */
         LR    REG14,REGSAV                                        0689
*   END ALLOCRTN;                                                  0690
@EL00019 DS    0H                                                  0690
@EF00019 DS    0H                                                  0690
@ER00019 BR    @14                                                 0690
*UNALLOC:                                                          0691
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);                               0691
*                                                                  0691
UNALLOC  DS    0H                                                  0692
*   /*****************************************************************/
*   /*                                                               */
*   /* ENTRY IS TO DYNAMICALLY UNALLOCATE A SYSOUT DATA SET FOR THE  */
*   /* SYSTEM LOG. THE DYNAM UNALLOCATION INTERFACE IS SET UP, THE   */
*   /* DDNAME TO UNALLOCATE IS STORED IN THE TEXT UNIT(DDALNM) FROM  */
*   /* THE LCA FIELD. CLASS VALUE IS TESTED, AND IF DIFFERENT THAN   */
*   /* THAT SPECIFIED IN BASEA(MSLOGCLS) , A SYSOUT TEXT UNIT IS SET */
*   /* UP ( DATU1) AND INITIALIZED. OTHERWISE, NO SYSOUT TEXT UNIT IS*/
*   /* USED. ISSUE THE SVC- ?DYNALLOC . IF REG15 NOT ZERO            */
*   /* (UNSUCCESSFUL) , A WTO IEE531I 'DATA LOSS' , WILL BE ISSUED BY*/
*   /* CALLER .                                                      */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0692
*   REGSAV=REG14;                   /* SAVE RETURN ADDRESS           */
         LR    REGSAV,REG14                                        0692
*   S99RBPTR=ADDR(S99RB);           /* PTR TO DYNAM UNALLOC BLOCK    */
         LA    @09,S99RB                                           0693
         ST    @09,S99RBPTR                                        0693
*   S99RBPND='1'B;                  /* HI-BIT FLAG TO DYNAM ALLOC    */
         OI    S99RBPND,B'10000000'                                0694
*   S99RB=S99RB&&S99RB;             /* CLEAR CONTROL BLOCK CORE      */
         XC    S99RB(20),S99RB                                     0695
*   S99RBLN=LENGTH(S99RB);          /* LENGTH OF CONTROL BLOCK       */
         MVI   S99RBLN,X'14'                                       0696
*   S99VERB=S99VRBUN;               /* SET UNALLOCATE FLAG           */
         MVI   S99VERB,X'02'                                       0697
*   S99TXTPP=ADDR(ALLOCPTR);        /* PTR TO TEXT UNIT PTRS         */
         LA    @09,ALLOCPTR                                        0698
         ST    @09,S99TXTPP                                        0698
*   ALLOCPTR=ALLOCPTR&&ALLOCPTR;    /* CLEAR CORE                    */
         XC    ALLOCPTR(16),ALLOCPTR                               0699
*   DATU2=DUTXT2;                   /* MOVE IN DDNAME TEXT UNIT FLDS */
         MVC   DATU2(14),DUTXT2                                    0700
*   DDALNM=LCADDTWO;                /* DDNAME TO UNALLOCATE          */
         MVC   DDALNM(8),LCADDTWO(LCAPTR)                          0701
*   DATP2=ADDR(DATU2);              /* PTR TO DDNAME TEXT UNIT       */
         LA    @09,DATU2                                           0702
         ST    @09,DATP2                                           0702
*   DATP2=DATP2×REGMASK;            /* END OF LIST INDICATOR         */
         O     @09,REGMASK                                         0703
         ST    @09,DATP2                                           0703
*   IF LCCLASS^='00'X THEN          /* SYSOUT CLASS CHANGED ?        */
         CLI   LCCLASS(LCAPTR),X'00'                               0704
         BE    @RF00704                                            0704
*     IF LCCLASS^=MSLOGCLS THEN     /* NOT SAME AS I P L VALUE ?     */
         L     @09,CVTPTR                                          0705
         L     @09,CVTMSER(,@09)                                   0705
         CLC   LCCLASS(1,LCAPTR),MSLOGCLS(@09)                     0705
         BE    @RF00705                                            0705
*       DO;                                                        0706
*         DATU1=DUTXT1;             /* MOVE IN SYSOUT TEXT UNIT FLDS */
         MVC   DATU1(7),DUTXT1                                     0707
*         OUTCLS=LCCLASS;           /* SET NEW SYSOUT CLASS          */
         MVC   OUTCLS(1),LCCLASS(LCAPTR)                           0708
*         DATP1=ADDR(DATU1);        /* PTR TO SYSOUT TEXT UNIT       */
         LA    @09,DATU1                                           0709
         ST    @09,DATP1                                           0709
*         LCCLASS='00'X;            /* CLEAR SYSOUT CLASS FLD        */
         MVI   LCCLASS(LCAPTR),X'00'                               0710
*       END;                                                       0711
*     ELSE                                                         0712
*       LCCLASS='00'X;              /* CLEAR SYSOUT FIELD            */
         B     @RC00705                                            0712
@RF00705 MVI   LCCLASS(LCAPTR),X'00'                               0712
*   REG1=ADDR(S99RBPTR);            /* INPUT REG FOR DYNAM UNALLOC   */
@RC00705 DS    0H                                                  0713
@RF00704 LA    REG1,S99RBPTR                                       0713
*/* MACDATE Y-2 73082                                                */
*                                                                  0714
*   SVC(99);                        /* INVOKE DYNAM UNALLOCATION     */
         SVC   99                                                  0714
*   LCADDTWO=ZEROS;                 /* CLEAR FIELD                   */
         MVC   LCADDTWO(8,LCAPTR),ZEROS                            0715
*   REG14=REGSAV;                   /* RESTORE RETURN ADDRESS        */
         LR    REG14,REGSAV                                        0716
*   END UNALLOC;                                                   0717
@EL00020 DS    0H                                                  0717
@EF00020 DS    0H                                                  0717
@ER00020 BR    @14                                                 0717
*FRESUBS:                                                          0718
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);                               0718
*                                                                  0718
FRESUBS  DS    0H                                                  0719
*   /*****************************************************************/
*   /*                                                               */
*   /* SSIB, SSOB, JSCB FIELDS ARE ALREADY INITIALIZED WHEN THEY WERE*/
*   /* GOTTEN BY RTN GETCBLKS. THE FUNCTION CODE MUST BE CHANGED TO  */
*   /* INDICATE THE SUB-SYSTEM IS TO RELEASE THE LOG JOB ID. CALL    */
*   /* SUBSYSTEM VIA IEFSSREQ MACRO , RETURN                         */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0719
*   REGSAV=REG14;                   /* SAVE RETURN ADDRESS           */
         LR    REGSAV,REG14                                        0719
*   SSOBFUNC=SSOBRTRN;              /* SET RETURN JO ID FUNCTION     */
*                                                                  0720
         L     @05,LCASSOBP(,LCAPTR)                               0720
         MVC   SSOBFUNC(2,@05),@CH02165                            0720
*   /*****************************************************************/
*   /*                                                               */
*   /* ? IEFSSREQ (SSOB);                                            */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0721
*/*                                                                  */
*/*  PASS CONTROL TO JOB ENTRY SUBSYSTEM TO                          */
*/*  PROCESS REQUEST -                                               */
*/*                                                                  */
*/*    INPUT - REGISTER 1 POINTS TO A ONE-                           */
*/*            WORD PARAMETER LIST WHICH                             */
*/*            POINTS TO THE SSOB                                    */
*/*                                                                  */
*                                                                  0721
*   CALL SSREQ(SSOB);               /* CALL SUB-SYSTEM               */
         ST    @05,@AL00001                                        0721
         MVI   @AL00001,X'80'                                      0721
         L     @05,CVTPTR                                          0721
         L     @05,CVTJESCT(,@05)                                  0721
         L     @15,JESSSREQ(,@05)                                  0721
         LA    @01,@AL00001                                        0721
         BALR  @14,@15                                             0721
*   REG14=REGSAV;                   /* RESTORE RETURN ADDRESS        */
         LR    REG14,REGSAV                                        0722
*   END FRESUBS;                                                   0723
@EL00021 DS    0H                                                  0723
@EF00021 DS    0H                                                  0723
@ER00021 BR    @14                                                 0723
*FREJSCB:                                                          0724
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);                               0724
*                                                                  0724
FREJSCB  DS    0H                                                  0725
*   /*****************************************************************/
*   /*                                                               */
*   /* ENTRY IS TO RELEASE THE GOTTEN JSCB USED FOR LOG PROCESSING   */
*   /* VIA THE FREEJSCB MACRO , AND TO RESTORE THE ORIGINAL JSCB     */
*   /* POINTER BACK TO THE TCB. RETURN TO CALLER.                    */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0725
*   REGSAV=REG14;                   /* SAVE RETURN ADDRESS           */
         LR    REGSAV,REG14                                        0725
*   REG1=TCBJSCB;                   /* ADDR OF JSCB TO FREE          */
         L     @05,CVTPTR                                          0726
         L     @09,CVTTCBP(,@05)                                   0726
         L     @09,TCBPTR(,@09)                                    0726
         L     @08,TCBJSCB(,@09)                                   0726
         LR    REG1,@08                                            0726
*   BALOGCOM=JSCBDBTB;              /* SAVE DEB TABLE ADDRES @ZA05195*/
         L     @05,CVTMSER(,@05)                                   0727
         L     @08,JSCBDBTB(,@08)                                  0727
         ST    @08,BALOGCOM(,@05)                                  0727
*   TCBJSCB=MSLGJSCB;               /* RESTORE ORIG JSCB PTR @YM02642*/
         L     @05,MSLGJSCB(,@05)                                  0728
         ST    @05,TCBJSCB(,@09)                                   0728
*   GEN( FREEJSCB);                 /* FREE GOTTEN JSCB              */
          FREEJSCB
*   REG14=REGSAV;                   /* RESTORE RETURN ADDRESS        */
         LR    REG14,REGSAV                                        0730
*   END FREJSCB;                                                   0731
@EL00022 DS    0H                                                  0731
@EF00022 DS    0H                                                  0731
@ER00022 BR    @14                                                 0731
*FRESSIB:                                                          0732
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);                               0732
*                                                                  0732
FRESSIB  DS    0H                                                  0733
*   /*****************************************************************/
*   /*                                                               */
*   /* ENTRY IS TO FREE CORE FOR SSIB, SSOB, SSRR CONT/BLKS  @ZA07784*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0733
*   REGSAV=REG14;                   /* SAVE RETURN ADDRESS           */
         LR    REGSAV,REG14                                        0733
*   REG0=SSIBSIZE+SSOBSIZE+SSRRSIZE;/* SET FREEMAIN SIZE     @ZA07784*/
         LH    REG0,SSIBSIZE                                       0734
         AH    REG0,SSOBSIZE                                       0734
         AH    REG0,SSRRSIZE                                       0734
*   REG1=LCASSIBP;                  /* CORE ADDRESS          @ZA05195*/
         L     REG1,LCASSIBP(,LCAPTR)                              0735
*   GEN( FREEMAIN R,LV=(0),A=(1));  /* FREE SSIB CORE                */
          FREEMAIN R,LV=(0),A=(1)
*   REG14=REGSAV;                   /* RESTORE RETURN ADDRESS        */
         LR    REG14,REGSAV                                        0737
*   END FRESSIB;                                                   0738
@EL00023 DS    0H                                                  0738
@EF00023 DS    0H                                                  0738
@ER00023 BR    @14                                                 0738
@PB00023 DS    0H                                                  0739
*STAEREGS:                                                         0739
*                                                                  0739
*   /*****************************************************************/
*   /*                                                               */
*   /* ENTRY IS FROM STAE ABEND EXIT ESTAE1 FOR RE-TRY OF SYSTEM LOG */
*   /* REG1 IS PTR TO ESTAE PARM LIST AND IS USED TO RESTORE CRITICAL*/
*   /* REGISTERS. THE PTR TO THE LCA IS GOTTEN FROM BASEA(BALOG)     */
*   /* FIELD AND PUT IN REG10 TO RE-ESTABLISH ADDRESSIBILITY.        */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0739
*   REG11=REG1->BASEADR1;           /* RESTORE BASE REG              */
STAEREGS L     REG11,BASEADR1(,REG1)                               0739
*   REG12=REG1->DATAADR1;           /* RESTORE DATA REG              */
         L     REG12,DATAADR1(,REG1)                               0740
*   REG13=REG1->SAVADR1;            /* RESTORE PROGRAM SAVE AREA REG */
         L     REG13,SAVADR1(,REG1)                                0741
*   IF MSLOGCOM='1'B THEN           /* RE-TRY AT LABEL STAEENT       */
         L     @03,CVTPTR                                          0742
         L     @03,CVTMSER(,@03)                                   0742
         TM    MSLOGCOM(@03),B'00100000'                           0742
         BNO   @RF00742                                            0742
*     DO;                                                          0743
*       MSLOGCOM='0'B;              /* ZERO SWITCH FIELD             */
         NI    MSLOGCOM(@03),B'11011111'                           0744
*       LCAPTR=BALOG;               /* RESTORE LCA PTR               */
         L     LCAPTR,BALOG(,@03)                                  0745
*       GOTO STAEENT;               /* RE-TRY ADDRESS                */
         B     STAEENT                                             0746
*     END;                                                         0747
*   GOTO LOGSTART;                  /* RE-TRY AT TOP OF LOG          */
         B     LOGSTART                                            0748
*STACALL1:                                                         0749
*                                                                  0749
*   /*****************************************************************/
*   /*                                                               */
*   /* ENTRY AT THIS LABEL IS FROM THE ESTAE EXIT RTNS IN MODULE     */
*   /* IEEMB806 TO CLEAN UP LOG CORE AT ABEND. THIS CODE WAS ADDED   */
*   /* FOR PTM 01937.                                                */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0749
*   REG1=ADDR(WORKAREA);            /* SET UP TEMP SAVE AREA @YM01937*/
STACALL1 LA    REG1,WORKAREA                                       0749
*   GEN( STM   14,12,0(1));         /* SAVE REGS             @YM01937*/
          STM   14,12,0(1)
*   IF MSLOGENQ='1'B THEN           /* TERMINATE LOG TASK?   @YM01937*/
         L     @03,CVTPTR                                          0751
         L     @03,CVTMSER(,@03)                                   0751
         TM    MSLOGENQ(@03),B'10000000'                           0751
         BNO   @RF00751                                            0751
*     DO;                                                          0752
*       CALL SHUTDOWN;              /* SET LOG INACTIVE      @YM01937*/
         BAL   @14,SHUTDOWN                                        0753
*       IF LCASAVE^=0000 THEN       /* LCA PTR PRESENT       @YM01937*/
         L     @03,LCASAVE                                         0754
         LTR   @03,@03                                             0754
         BZ    @RF00754                                            0754
*         DO;                                                      0755
*           LCAPTR=LCASAVE;         /* INITIALIZE LCA POINTER      0756
*                                                            @YM01937*/
         LR    LCAPTR,@03                                          0756
*           IF MSLOGDAR='0'B THEN   /* NOT LOG PUT ABEND     @YM01937*/
         L     @03,CVTPTR                                          0757
         L     @03,CVTMSER(,@03)                                   0757
         TM    MSLOGDAR(@03),B'00010000'                           0757
         BNZ   @RF00757                                            0757
*             DO;                                                  0758
*               REG15=4;            /* SET LOOP VALUE        @YM01937*/
         LA    REG15,4                                             0759
*               DO WHILE(REG15^=0000);                             0760
         B     @DE00760                                            0760
@DL00760 DS    0H                                                  0761
*                 CALL WTLREC;      /* WRITE LOG QUEUE TO DATA SET 0761
*                                                            @YM01937*/
         BAL   @14,WTLREC                                          0761
*               END;                                               0762
@DE00760 LTR   REG15,REG15                                         0762
         BNZ   @DL00760                                            0762
*             END;                                                 0763
*           ELSE                    /* RESET ABEND SWITCH    @YM01937*/
*             MSLOGDAR='0'B;                                       0764
         B     @RC00757                                            0764
@RF00757 L     @03,CVTPTR                                          0764
         L     @03,CVTMSER(,@03)                                   0764
         NI    MSLOGDAR(@03),B'11101111'                           0764
*           CALL LOGERROR;          /* UNALLOCATE,FREE LOG DATA SET
*                                                            @YM01937*/
@RC00757 BAL   @14,LOGERROR                                        0765
*           CALL WTLCLOSE;          /* FREE LOG RESOURCES    @YM01937*/
         BAL   @14,WTLCLOSE                                        0766
*         END;                                                     0767
*       MSLOGENQ='0'B;              /* SET OFF TERMINATE SWITCH    0768
*                                                            @YM01937*/
@RF00754 L     @03,CVTPTR                                          0768
         L     @03,CVTMSER(,@03)                                   0768
         NI    MSLOGENQ(@03),B'01111111'                           0768
*     END;                                                         0769
*   IF MSLOGCOM='1'B THEN           /* LOG WILL RE-TRY       @YM01937*/
@RF00751 L     @03,CVTPTR                                          0770
         L     @03,CVTMSER(,@03)                                   0770
         TM    MSLOGCOM(@03),B'00100000'                           0770
         BNO   @RF00770                                            0770
*     CALL LOGERROR;                /* UNALLOCATE ,FREE LOG DATA SET
*                                                            @YM01937*/
         BAL   @14,LOGERROR                                        0771
*   REG1=ADDR(WORKAREA);            /* SET UP REG RESTORE    @YM01937*/
@RF00770 LA    REG1,WORKAREA                                       0772
*   GEN;                                                           0773
*                                                         /*@YM01937*/
        LM    14,12,0(1)             RESTORE CALLER REGS
        BR    14                     RETURN TO ESTAE CALLER
*CHAINRTN:                                                         0774
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);/*                       @ZA07784*/
*                                                                  0774
         B     @PB00024                                            0774
CHAINRTN DS    0H                                                  0775
*   /*****************************************************************/
*   /*                                                               */
*   /* ENTRY HERE IS CAUSED BY DETECTION OF AN INVALID BUFFER CHAIN  */
*   /* POINTER IN RTN WTLREC. SAVE WTLREC CALLER'S ADDRESS, SET      */
*   /* RECURSION SWITCH ON, SET LOG INACTIVE, ISSUE WTO, TAKE DUMP.  */
*   /* RE-SET END OF CHAIN INDICATOR IN THE LAST VALID ELEMENT FOUND */
*   /* AND CALCULATE THE NEW TOTAL OF ELEMENTS ON THE CHAIN. CLEAN UP*/
*   /* THE CHAIN VIA CALL WTLREC. FREE THE LOG INTERNAL BUFFERS, GET */
*   /* NEW BUFFER POOL. IF NOT SUCCESSFUL PROCESS FOR LOG ABEND. IF  */
*   /* SUCCESSFUL, PROCESS FOR RETURN TO WTLREC CALLER.(NORMAL). THIS*/
*   /* SUB-ROUTINE WAS ADDED IN SUPPORT OF APAR OZ07784.             */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0775
*   CHAINSAV=REGSAV;                /* SAVE ADDR OF WTLREC CALLER    */
         ST    REGSAV,CHAINSAV                                     0775
*   MSWTL='1'B;                     /* SET RECURSION BIT ON          */
         L     @03,CVTPTR                                          0776
         L     @03,CVTMSER(,@03)                                   0776
         OI    MSWTL+136(@03),B'00100000'                          0776
*   BALOG=0000;                     /* SET LOG INACTIVE              */
*                                                                  0777
         SLR   @09,@09                                             0777
         ST    @09,BALOG(,@03)                                     0777
*   /*****************************************************************/
*   /*                                                               */
*   /* SET UP TO ISSUE WTO IEE795I RECOVERY MSG                      */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0778
*   MSGONE=MSG9;                    /* MSG CODE TO PARM LIST         */
         IC    @03,MSG9                                            0778
         STC   @03,MSGONE                                          0778
*   NUMMSGS=1;                      /* NUMBER WTOS TO ISSUE          */
         MVI   NUMMSGS,X'01'                                       0779
*   REG1=ADDR(MSGPARM);             /* PARM ADDRESS TO REG 1         */
         LA    REG1,MSGPARM                                        0780
*   CALL IEEMB807;                  /* ISSUE WTO                     */
         L     @15,@CV02192                                        0781
         BALR  @14,@15                                             0781
*   CALL DUMPRTN;                   /* ISSUE SVC 51 DUMP             */
         BAL   @14,DUMPRTN                                         0782
*   ZEROPTR=0000;                   /* RE-SET NEW END-OF-CHAIN       */
         L     @03,PREVREG                                         0783
         SLR   @09,@09                                             0783
         ST    @09,ZEROPTR(,@03)                                   0783
*   LCAELCNT=LCAELCNT-(PREVCNT-1);  /* RE-SET WTL BUFFER COUNT       */
         L     @03,PREVCNT(,@03)                                   0784
         BCTR  @03,0                                               0784
         LCR   @03,@03                                             0784
         AL    @03,LCAELCNT(,LCAPTR)                               0784
         ST    @03,LCAELCNT(,LCAPTR)                               0784
*   CALL WTLREC;                    /* PUT BUFFER TO LOG DATA SET    */
         BAL   @14,WTLREC                                          0785
*   CALL POOLFREE;                  /* FREE LOG BUFFER POOL          */
         BAL   @14,POOLFREE                                        0786
*   GEN( BLDCPOOL SP=231,CSIZE=140,POOLSIZ=4,AUTODEL=YES,BRANCH=YES);
          BLDCPOOL SP=231,CSIZE=140,POOLSIZ=4,AUTODEL=YES,BRANCH=YES
*                                   /* GET NEW LOG BUFFER POOL       */
*   IF REG15=0000 THEN              /* GET SUCCESSFUL                */
         LTR   REG15,REG15                                         0788
         BNZ   @RF00788                                            0788
*     LCACPID=REG0;                 /* SET POOL ID IN LCA            */
         ST    REG0,LCACPID(,LCAPTR)                               0789
*   ELSE                            /* NOT SUCCESSFUL, ABEND LOG     */
*     DO;                                                          0790
         B     @RC00788                                            0790
@RF00788 DS    0H                                                  0791
*       MSWTL='0'B;                 /* TURN OFF BUFFER RECURSION     */
         L     @09,CVTPTR                                          0791
         L     @09,CVTMSER(,@09)                                   0791
         NI    MSWTL+136(@09),B'11011111'                          0791
*       LCASTAE='1'B;               /* SET LOG RECURSION ON          */
         MVI   LCASTAE(LCAPTR),X'01'                               0792
*       LCAPOOLF='0'B;              /* INDICATE NO POOL TO FREE      */
         NI    LCAPOOLF(LCAPTR),B'10111111'                        0793
*       BALOG=LCAPTR;               /* RE-SET LCA PTR FOR CLEAN-UP   */
         ST    LCAPTR,BALOG(,@09)                                  0794
*       CALL ABENDRTN;              /* GO ISSUE ABEND. NO RETURN FROM
*                                      THIS CALLED RTN.      @ZA07784*/
         BAL   @14,ABENDRTN                                        0795
*     END;                                                         0796
*   MSWTL='0'B;                     /* TURN OFF RECURSION            */
@RC00788 L     @09,CVTPTR                                          0797
         L     @09,CVTMSER(,@09)                                   0797
         NI    MSWTL+136(@09),B'11011111'                          0797
*   BALOG=LCAPTR;                   /* RESTORE LCA PTR               */
         ST    LCAPTR,BALOG(,@09)                                  0798
*   BALOGINT='1'B;                  /* SET ACTIVE BIT ON             */
*                                                                  0799
         OI    BALOGINT(@09),B'10000000'                           0799
*   /*****************************************************************/
*   /*                                                               */
*   /* SET UP TO ISSUE WTO IEE041I LOG ACTIVE MSG                    */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0800
*   MSGONE=MSG4;                    /* MSG CODE TO PARM LIST         */
         IC    @09,MSG4                                            0800
         STC   @09,MSGONE                                          0800
*   NUMMSGS=1;                      /* NUMBER WTOS TO ISSUE          */
         MVI   NUMMSGS,X'01'                                       0801
*   REG1=ADDR(MSGPARM);             /* PARM ADDRESS TO REG1          */
         LA    REG1,MSGPARM                                        0802
*   CALL IEEMB807;                  /* ISSUE WTO                     */
         L     @15,@CV02192                                        0803
         BALR  @14,@15                                             0803
*   REG15=0000;                     /* CLEAR RETURN CODE REG         */
         SLR   REG15,REG15                                         0804
*   REG14=CHAINSAV;                 /* RESTORE CALLERS ADDRESS       */
         L     REG14,CHAINSAV                                      0805
*   END CHAINRTN;                   /* RETURN                        */
@EL00024 DS    0H                                                  0806
@EF00024 DS    0H                                                  0806
@ER00024 BR    @14                                                 0806
*ABENDRTN:                                                         0807
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);                               0807
*                                                                  0807
ABENDRTN DS    0H                                                  0808
*   /*****************************************************************/
*   /*                                                               */
*   /* ENTRY HERE IS TO ISSUE AN ABEND FOR THE LOG FUNCTION. CALLERS */
*   /* OF THIS RTN ARE SUB-RTNS WTLREC FOR RECURSIVE BAD CHAIN       */
*   /* PROBLEM, PUTREC FOR NON-ZERO RETURN CODE FROM PUT MACRO, AND  */
*   /* CHAINRTN WHEN IT FAILS TO RE-ACQUIRE A LOG BUFFER POOL VIA THE*/
*   /* BLDCPOOL MACRO. THIS SUB-RTN WAS ADDED AS A RESULT OF APAR    */
*   /* OZ07784.                                                      */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0808
*   MSLGWTR=0000;                   /* CLEAR WRITER ECB              */
         L     @07,CVTPTR                                          0808
         L     @07,CVTMSER(,@07)                                   0808
         SLR   @09,@09                                             0808
         ST    @09,MSLGWTR(,@07)                                   0808
*   LOGLOOP='00'X;                  /* CLEAR CALLER LOOP SWITCH      */
         MVI   LOGLOOP,X'00'                                       0809
*   MSLOGDAR='1'B;                  /* SET LOG ABEND SWITCH          */
         OI    MSLOGDAR(@07),B'00010000'                           0810
*   CALL DUMPRTN;                   /* DUMP LOG CORE AREAS           */
         BAL   @14,DUMPRTN                                         0811
*   GEN( ABEND 3085,,,SYSTEM);      /* RECOVER LOG IN ESTAE PROCESSOR*/
          ABEND 3085,,,SYSTEM
*   END ABENDRTN;                                                  0813
@EL00025 DS    0H                                                  0813
@EF00025 DS    0H                                                  0813
@ER00025 BR    @14                                                 0813
@PB00025 DS    0H                                                  0814
*   GEN;                                                           0814
POSTLIST POST  ASCB=0,ERRET=0,MF=L
DUMPLST SDUMP HDR=' SYSTEM LOG DUMP',SDATA=(PSA,NUC,LSQA,RGN,CSA),MF=L
DUMPEND EQU   *
GETLIST GETMAIN EC,LV=0,A=0,SP=231,MF=L
GETEND  EQU   *
*   END IEEMB803                                                   0815
*                                                                  0815
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */
*/*%INCLUDE SYSLIB  (CVT     )                                       */
*/*%INCLUDE SYSLIB  (IKJTCB  )                                       */
*/*%INCLUDE SYSLIB  (IEEBASEA)                                       */
*/*%INCLUDE SYSLIB  (IEELCA  )                                       */
*/*%INCLUDE SYSLIB  (IEECUCM )                                       */
*/*%INCLUDE SYSLIB  (IEFPTRS )                                       */
*/*%INCLUDE SYSLIB  (IFGRPL  )                                       */
*/*%INCLUDE SYSLIB  (IEZJSCB )                                       */
*/*%INCLUDE SYSLIB  (IFGACB  )                                       */
*/*%INCLUDE SYSLIB  (IEFZB4D0)                                       */
*/*%INCLUDE SYSLIB  (IEFJSSIB)                                       */
*/*%INCLUDE SYSLIB  (IEFJSSOB)                                       */
*/*%INCLUDE SYSLIB  (IEFJESCT)                                       */
*                                                                  0815
*       ;                                                          0815
@EL00001 L     @13,4(,@13)                                         0815
@EF00001 L     @00,@SIZDATD                                        0815
         LR    @01,@12                                             0815
         FREEMAIN R,LV=(0),A=(1)
@ER00001 BR    @14                                                 0815
@DATA    DS    0H
@CH02165 DC    H'21'
@SM02459 MVC   WORKAREA(0),DUMPLST
@SM02467 MVC   ACBCORE(0,@09),ACBLIST
@SM02469 MVC   WORKAREA(0),GETLIST
@SM02471 MVC   ACBCORE(0,@05),ACBLIST
@SM02473 MVC   OPENCORE(0),OPENLIST
@SM02476 MVC   CLOSCORE(0),CLOSLIST
@DATD    DSECT
         DS    0F
@SA00001 DS    18F
@AL00001 DS    1A
IEEMB803 CSECT
         DS    0F
@CF00078 DC    F'1'
@CF00110 DC    F'4'
@CF02465 DC    F'-4'
@CF02363 DC    XL4'00FFFFFF'
@CF02454 DC    XL4'0000FFFF'
@CF02461 DC    BL4'10111111111111111111111111111111'
@DATD    DSECT
         DS    0D
MAINSAV  DS    A
REGSAV2  DS    A
CHAINSAV DS    A
LCASAVE  DS    A
PREVREG  DS    A
ACBPTR   DS    A
S99RBPTR DS    AL4
         ORG   S99RBPTR
S99RBPND DS    BL1
         ORG   S99RBPTR+4
S99TUFP  DS    A
GETADPTR DS    A
S99RB    DS    CL20
         ORG   S99RB
S99RBLN  DS    CL1
S99VERB  DS    CL1
S99FLAG1 DS    CL2
         ORG   S99FLAG1
S99FLG11 DS    CL1
         ORG   S99FLG11
S99ONCNV DS    BL1
S99NOCNV EQU   S99FLG11+0
S99NOMNT EQU   S99FLG11+0
S99JBSYS EQU   S99FLG11+0
         ORG   S99FLAG1+1
S99FLG12 DS    CL1
         ORG   S99RB+4
S99RSC   DS    CL4
         ORG   S99RSC
S99ERROR DS    CL2
S99INFO  DS    CL2
         ORG   S99RB+8
S99TXTPP DS    AL4
S99RSV01 DS    FL4
S99FLAG2 DS    CL4
         ORG   S99FLAG2
S99FLG21 DS    CL1
         ORG   S99FLG21
S99WTVOL DS    BL1
S99WTDSN EQU   S99FLG21+0
S99NORES EQU   S99FLG21+0
S99WTUNT EQU   S99FLG21+0
S99OFFLN EQU   S99FLG21+0
S99TIONQ EQU   S99FLG21+0
S99CATLG EQU   S99FLG21+0
S99MOUNT EQU   S99FLG21+0
         ORG   S99FLAG2+1
S99FLG22 DS    CL1
         ORG   S99FLG22
S99UDEVT DS    BL1
S99PCINT EQU   S99FLG22+0
         ORG   S99FLAG2+2
S99FLG23 DS    CL1
S99FLG24 DS    CL1
         ORG   S99RB+20
POSTCORE DS    CL12
         ORG   POSTCORE
ECBAD    DS    AL4
ASCBAD   DS    AL4
ERRAD    DS    AL4
         ORG   POSTCORE+12
MSGPARM  DS    CL4
         ORG   MSGPARM
NUMMSGS  DS    AL1
MSGONE   DS    AL1
MSGTWO   DS    AL1
MSGCLS   DS    AL1
         ORG   MSGPARM+4
ALLOCPTR DS    CL16
         ORG   ALLOCPTR
DATP1    DS    AL4
DATP2    DS    AL4
DATP3    DS    AL4
DATP4    DS    AL4
         ORG   ALLOCPTR+16
DATU1    DS    CL7
         ORG   DATU1
@NM00080 DS    CL6
OUTCLS   DS    CL1
         ORG   DATU1+7
DATU2    DS    CL14
         ORG   DATU2
@NM00081 DS    CL6
DDALNM   DS    CL8
         ORG   DATU2+14
DATU3    DS    CL8
DATU4    DS    CL7
ESTAEPRM DS    CL12
         ORG   ESTAEPRM
EBASEREG DS    AL4
EDATAREG DS    AL4
ESAVEREG DS    AL4
         ORG   ESTAEPRM+12
WORKAREA DS    CL80
LOGWAIT  DS    CL1
LOGLOOP  DS    CL1
RETCODE  DS    CL1
IEEMB803 CSECT
         DS    0F
@SIZDATD DC    AL1(0)
         DC    AL3(@ENDDATD-@DATD)
@CV02191 DC    V(IEEMB806)
@CV02192 DC    V(IEEMB807)
@CV02193 DC    V(IEEMB805)
         DS    0D
NIPSW    DC    XL4'40000000'
REGMASK  DC    XL4'80000000'
SPNFLD   DC    XL4'E7000000'
SSIBSIZE DC    AL2(36)
SSOBSIZE DC    AL2(20)
SSRRSIZE DC    AL2(8)
MSG1     DC    AL1(4)
MSG2     DC    AL1(8)
MSG3     DC    AL1(12)
MSG4     DC    AL1(16)
MSG5     DC    AL1(20)
MSG6     DC    AL1(24)
MSG8     DC    AL1(32)
MSG9     DC    AL1(36)
LCASIZE  DC    AL1(80)
LENRPL   DC    AL1(76)
SPINSW   DC    XL1'01'
TWENTY   DC    XL1'14'
DUMPLEN  DC    AL1(DUMPEND-DUMPLST)
GETLEN   DC    AL1(GETEND-GETLIST)
DATXT1   DC    X'001800010001C1'
DATXT2   DC    X'00550001000800'
         DC    XL7'0'
DATXT3   DC    X'0042000100020082'
DATXT4   DC    X'004900010001C0'
DUTXT1   DC    X'00180001000100'
DUTXT2   DC    X'000100010008'
         DC    XL8'0'
PATCH    DC    CL160'IEEMB803PATCH'
MSTR     DC    CL4'MSTR'
ZEROS    DC    X'00000000'
         DC    XL4'0'
IEEMB803 CSECT
*                                        /* ACB STRUCTURE   @YM03370*/
ACBLIST ACB   DDNAME=DUMMY,MACRF=(OUT,ADR,SEQ)
LENACB1 EQU   *                                          /* @YM03370*/
LENACB2 DC    A(LENACB1-ACBLIST)                         /* @YM03370*/
IEEMB803 CSECT
*                                          /* CLOSE LIST FORM       */
CLOSLIST CLOSE (2),MF=L
CLOSLEN1 EQU   *
CLOSLEN2 DC    A(CLOSLEN1-CLOSLIST)
@DATD    DSECT
*                                         /* CORE FOR CLOSE MACRO   */
CLOSCORE CLOSE (2),MF=L
IEEMB803 CSECT
*                                           /* OPEN LIST FORM       */
OPENLIST OPEN (2),MF=L
OPENLEN1 EQU  *
OPENLEN2 DC   A(OPENLEN1-OPENLIST)
@DATD    DSECT
*                                  /* OPEN CORE AREA                */
OPENCORE OPEN (2),MF=L
@DATD    DSECT
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA
@ENDDATD EQU   *
IEEMB803 CSECT
@00      EQU   00                      EQUATES FOR REGISTERS 0-15
@01      EQU   01
@02      EQU   02
@03      EQU   03
@04      EQU   04
@05      EQU   05
@06      EQU   06
@07      EQU   07
@08      EQU   08
@09      EQU   09
@10      EQU   10
@11      EQU   11
@12      EQU   12
@13      EQU   13
@14      EQU   14
@15      EQU   15
SVCWAIT  EQU   @04
RETREG1  EQU   @06
REGSAV   EQU   @03
SAVE14   EQU   @04
REG0     EQU   @00
REG1     EQU   @01
REG2     EQU   @02
REG3     EQU   @03
REG4     EQU   @04
REG5     EQU   @05
REG10    EQU   @10
REG11    EQU   @11
REG12    EQU   @12
REG13    EQU   @13
REG14    EQU   @14
REG15    EQU   @15
WREG1    EQU   @06
WREG2    EQU   @07
PR1ELCNT EQU   @04
PR1ELAD  EQU   @05
PR2ELCNT EQU   @06
PR2ELAD  EQU   @07
LCAPTR   EQU   @10
PAIR1LCA EQU   @05
PAIR1SVC EQU   @04
PAIR2LCA EQU   @07
PAIR2SVC EQU   @06
REG6     EQU   @06
REG7     EQU   @07
REG8     EQU   @08
REG9     EQU   @09
         ENTRY STAEREGS
         ENTRY STACALL1
CVTPTR   EQU   16
SSOBPTR  EQU   0
SSOBFLG  EQU   SSOBPTR
UCMPRFXP EQU   0
UCMEILPT EQU   0
UCMEXTPT EQU   0
UCMUEWPT EQU   0
CVTMAP   EQU   0
CVTTCBP  EQU   CVTMAP
CVTDAR   EQU   CVTMAP+72
CVTFLGS1 EQU   CVTDAR
CVTCUCB  EQU   CVTMAP+100
CVTDCB   EQU   CVTMAP+116
CVTIERLC EQU   CVTMAP+144
CVTMSER  EQU   CVTMAP+148
CVTOPTA  EQU   CVTMAP+182
CVTOPTB  EQU   CVTMAP+183
CVTGTF   EQU   CVTMAP+236
CVTGTFST EQU   CVTGTF
CVTGTFS  EQU   CVTGTFST
CVTSTATE EQU   CVTGTFST
CVTTMODE EQU   CVTGTFST
CVTFORM  EQU   CVTGTFST
CVTAQAVT EQU   CVTMAP+240
CVTTCMFG EQU   CVTAQAVT
CVTVOLM2 EQU   CVTMAP+244
CVTTATA  EQU   CVTVOLM2
CVTTSKS  EQU   CVTTATA
CVTVOLF2 EQU   CVTTSKS
CVTTAT   EQU   CVTTATA+1
CVTATER  EQU   CVTMAP+248
CVTEXT1  EQU   CVTMAP+252
CVTPURG  EQU   CVTMAP+260
CVTQMSG  EQU   CVTMAP+268
CVTDMSR  EQU   CVTMAP+272
CVTRSV37 EQU   CVTDMSR
CVTDMSRF EQU   CVTRSV37
CVTJESCT EQU   CVTMAP+296
CVTERPV  EQU   CVTMAP+316
CVTINTLA EQU   CVTMAP+320
CVTAPF   EQU   CVTMAP+324
CVTEXT2  EQU   CVTMAP+328
CVTHJES  EQU   CVTMAP+332
CVTPGSIA EQU   CVTMAP+348
CVTA1F1  EQU   CVTMAP+356
CVTSYSK  EQU   CVTMAP+357
CVTVOLM1 EQU   CVTMAP+380
CVTVOLF1 EQU   CVTVOLM1
CVTATMCT EQU   CVTMAP+388
CVTXTNT1 EQU   0
CVTXTNT2 EQU   0
CVTDSSV  EQU   CVTXTNT2
CVTFLGBT EQU   CVTXTNT2+5
CVTQID   EQU   CVTXTNT2+24
CVTRV400 EQU   CVTXTNT2+52
CVTRV409 EQU   CVTXTNT2+53
CVTATCVT EQU   CVTXTNT2+64
CVTRV429 EQU   CVTXTNT2+84
CVTRV438 EQU   CVTXTNT2+85
CVTRV457 EQU   CVTXTNT2+112
CVTRV466 EQU   CVTXTNT2+113
CVTFIX   EQU   0
CVTRELNO EQU   CVTFIX+252
TCBFIX   EQU   0
TCBFRS   EQU   TCBFIX
TCB      EQU   0
TCBPIE   EQU   TCB+4
TCBPMASK EQU   TCBPIE
TCBCMP   EQU   TCB+16
TCBCMPF  EQU   TCBCMP
TCBCPP   EQU   TCBCMPF
TCBSTCC  EQU   TCBCMPF
TCBCDBL  EQU   TCBCMPF
TCBCWTO  EQU   TCBCMPF
TCBCIND  EQU   TCBCMPF
TCBCMSG  EQU   TCBCMPF
TCBTRN   EQU   TCB+20
TCBABF   EQU   TCBTRN
TCBMSS   EQU   TCB+24
TCBPKF   EQU   TCB+28
TCBFLGS  EQU   TCB+29
TCBFLGS1 EQU   TCBFLGS
TCBFLGS2 EQU   TCBFLGS+1
TCBFLGS3 EQU   TCBFLGS+2
TCBFLGS4 EQU   TCBFLGS+3
TCBFLGS5 EQU   TCBFLGS+4
TCBABWF  EQU   TCBFLGS5
TCBJPQ   EQU   TCB+44
TCBPURGE EQU   TCBJPQ
TCBGRS   EQU   TCB+48
TCBFSA   EQU   TCB+112
TCBTME   EQU   TCB+120
TCBJSTCB EQU   TCB+124
TCBTSFLG EQU   TCB+148
TCBTSTSK EQU   TCBTSFLG
TCBSTAB  EQU   TCB+160
TCBNSTAE EQU   TCBSTAB
TCBTCT   EQU   TCB+164
TCBTCTGF EQU   TCBTCT
TCBSCNDY EQU   TCB+172
TCBNDSP  EQU   TCBSCNDY
TCBNDSP1 EQU   TCBNDSP+1
TCBNDSP2 EQU   TCBNDSP+2
TCBNDSP3 EQU   TCBNDSP+3
TCBJSCB  EQU   TCB+180
TCBRECDE EQU   TCBJSCB
TCBEXT1  EQU   TCB+196
TCBBITS  EQU   TCB+200
TCBNDSP4 EQU   TCBBITS
TCBNDSP5 EQU   TCBBITS+1
TCBFLGS6 EQU   TCBBITS+2
TCBFLGS7 EQU   TCBBITS+3
TCBDAR   EQU   TCB+204
TCBDARC  EQU   TCBDAR
TCBEXT2  EQU   TCB+208
TCBTID   EQU   TCB+238
TCBFOE   EQU   TCB+244
TCBESTAE EQU   TCB+264
TCBESTRM EQU   TCBESTAE+1
TCBFBYT1 EQU   TCB+276
TCBFBYT2 EQU   TCB+277
TCBRV124 EQU   TCB+278
TCBRV133 EQU   TCB+279
TCBXTNT2 EQU   0
TCBGTF   EQU   TCBXTNT2
TCBTFLG  EQU   TCBGTF
TCBRV146 EQU   TCBXTNT2+28
TCBRV155 EQU   TCBXTNT2+29
TCBRV164 EQU   TCBXTNT2+30
TCBRV173 EQU   TCBXTNT2+31
BASE     EQU   0
@NM00009 EQU   BASE+13
BALGSTAT EQU   BASE+24
MSLOGSVC EQU   BALGSTAT
BALOG    EQU   BALGSTAT+4
BALOGINT EQU   BALOG
BASFL    EQU   BASE+36
BARSW    EQU   BASFL
MSLOGST  EQU   BASE+46
MSLOGENQ EQU   MSLOGST
MSLOGTHD EQU   MSLOGST
MSLOGCOM EQU   MSLOGST
MSLOGDAR EQU   MSLOGST
MSLOGIPL EQU   MSLOGST
MSLOGSTA EQU   MSLOGST
BASPBYTE EQU   BASE+47
BAMONITR EQU   BASE+56
BALOGCOM EQU   BASE+76
@NM00031 EQU   BASE+104
MSLOGCLS EQU   @NM00031
MSLGCLOZ EQU   BASE+108
MSCLOSSW EQU   MSLGCLOZ
MSCLOSP  EQU   MSCLOSSW
MSLGWLOG EQU   BASE+112
MSWLOGSW EQU   MSLGWLOG
MSWLOGP  EQU   MSWLOGSW
MSLGWTR  EQU   BASE+116
MSWTRSW  EQU   MSLGWTR
MSWTRP   EQU   MSWTRSW
MSLGSTRT EQU   BASE+120
MSSTRTSW EQU   MSLGSTRT
MSLGJSCB EQU   BASE+124
MS1BASEX EQU   BASE+136
BASES01  EQU   0
MSNTAL   EQU   BASES01
MSSSB    EQU   BASES01+1
MSBTN    EQU   MSSSB
MSPFG    EQU   BASES01+2
MSECBFL  EQU   BASES01+3
MSWTL    EQU   MSECBFL
MSTUS    EQU   BASES01+4
MSSSA    EQU   MSTUS
MSINLSW  EQU   MSSSA
MSREOF   EQU   MSSSA
MSNWP    EQU   MSSSA
MSFHF    EQU   BASES01+5
LCABASE  EQU   0
LCAQHEAD EQU   LCABASE
LCAELCNT EQU   LCAQHEAD
LCAELPTR EQU   LCAQHEAD+4
LCAPTSW  EQU   LCAELPTR
LCACPID  EQU   LCABASE+8
LCALIMCT EQU   LCABASE+12
LCACBONE EQU   LCABASE+20
LCACBTWO EQU   LCABASE+24
LCAELST  EQU   LCABASE+28
LWTRPTR  EQU   LCAELST+8
LWTRBITS EQU   LWTRPTR
LCAPOSTT EQU   LCABASE+40
POSTWLOG EQU   LCAPOSTT
LCASTAE  EQU   LCABASE+41
LCADDONE EQU   LCABASE+42
LCADDTWO EQU   LCABASE+50
LCACLPTR EQU   LCABASE+58
LCCLASS  EQU   LCACLPTR+1
LCARPLP  EQU   LCABASE+60
LCASSIBP EQU   LCABASE+64
LCASSOBP EQU   LCABASE+68
LCASSOBR EQU   LCABASE+72
LCACOREF EQU   LCABASE+76
LCAPOOLF EQU   LCACOREF
LCASSIBF EQU   LCACOREF
LCAJSCBF EQU   LCACOREF
LCASUBSF EQU   LCACOREF
LCAACBF  EQU   LCACOREF
WTLLMPTR EQU   LCABASE+77
UCM2EXT  EQU   0
UCM2STA  EQU   UCM2EXT+8
UCM2SFLG EQU   UCM2STA
UCMPRFX  EQU   0
UCMSAVE0 EQU   UCMPRFX+4
UCMSFLGS EQU   UCMPRFX+84
UCMSFLG1 EQU   UCMSFLGS
UCMSYSG  EQU   UCMSFLG1
UCMSFLG2 EQU   UCMSFLGS+1
UCMSYSO  EQU   UCMSFLG2
UCMXSA   EQU   UCMPRFX+104
UCMNPECB EQU   UCMPRFX+144
UCMSDS1  EQU   UCMPRFX+156
UCM      EQU   0
UCMAECB  EQU   UCM+4
UCMDECB  EQU   UCM+12
UCMRPYI  EQU   UCM+32
UCMRQLM  EQU   UCM+45
UCMWQLM  EQU   UCM+46
UCMPXB   EQU   UCM+68
UCMMODE  EQU   UCMPXB
UCMVDATA EQU   UCM+72
UCMVEA   EQU   UCMVDATA
UCMRQLM1 EQU   UCM+236
UCMWQLM1 EQU   UCM+238
UCMASCB  EQU   UCM+280
UCMRSV42 EQU   UCM+300
UCMRSV51 EQU   UCM+301
UCMEIL   EQU   0
UCMRECBA EQU   UCMEIL+24
UCMEXIT  EQU   0
UCMLIST  EQU   0
UCMSTS   EQU   UCMLIST+24
UCMATR   EQU   UCMLIST+25
UCMXA    EQU   UCMLIST+26
UCMAUTH  EQU   UCMLIST+40
UCMAUTHA EQU   UCMAUTH
UCMDISP  EQU   UCMLIST+42
UCMDISP1 EQU   UCMDISP
UCMDISP2 EQU   UCMDISP+1
UCMMSG   EQU   UCMLIST+60
UCMMSG1  EQU   UCMMSG
UCMDEVC  EQU   UCMLIST+63
UCMRCT   EQU   UCMLIST+68
UCMSDS5  EQU   UCMRCT
TCBASCB  EQU   0
TCBPTR   EQU   TCBASCB+4
IFGRPL   EQU   0
RPLCOMN  EQU   IFGRPL
RPLIDWD  EQU   RPLCOMN
RPLLEN   EQU   RPLIDWD+3
RPLECB   EQU   RPLCOMN+8
RPLFDBWD EQU   RPLCOMN+12
RPLFDBK  EQU   RPLFDBWD+1
RPLRTNCD EQU   RPLFDBK
RPLCNDCD EQU   RPLFDBK+1
RPLCMPON EQU   RPLCNDCD
RPLFDB2  EQU   RPLCMPON
RPLERRCD EQU   RPLCNDCD+1
RPLFDB3  EQU   RPLERRCD
RPLKEYLE EQU   RPLCOMN+16
RPLDACB  EQU   RPLCOMN+24
RPLAREA  EQU   RPLCOMN+32
RPLARG   EQU   RPLCOMN+36
RPLOPTCD EQU   RPLCOMN+40
RPLOPT1  EQU   RPLOPTCD
RPLECBSW EQU   RPLOPT1
RPLOPT2  EQU   RPLOPTCD+1
RPLADR   EQU   RPLOPT2
RPLOPT3  EQU   RPLOPTCD+2
RPLNXTRP EQU   RPLCOMN+44
RPLRLEN  EQU   RPLCOMN+48
RPLOPTC2 EQU   RPLCOMN+56
RPLOPT5  EQU   RPLOPTC2
RPLWRTYP EQU   RPLOPT5
RPLOPT6  EQU   RPLOPTC2+1
RPLUNTYP EQU   RPLOPT6
RPLOPT7  EQU   RPLOPTC2+2
RPLCNOPT EQU   RPLOPT7
RPLOPT8  EQU   RPLOPTC2+3
RPLRBAR  EQU   RPLCOMN+60
RPLAIXID EQU   RPLRBAR+2
RPLEXTDS EQU   RPLCOMN+68
RPLEXTD1 EQU   RPLEXTDS
IEZJSCB  EQU   0
JSCBSEC1 EQU   IEZJSCB+188
JSCHPCE  EQU   JSCBSEC1+4
JSCBDBTB EQU   JSCBSEC1+28
JSCBDCB  EQU   JSCBSEC1+36
JSCBOPTS EQU   JSCBSEC1+48
JSCBSWT1 EQU   JSCBSEC1+55
JSCBWTP  EQU   JSCBSEC1+64
JSCBWTFG EQU   JSCBWTP
JSCBEND1 EQU   IEZJSCB+260
IFGACB   EQU   0
ACBCOMN  EQU   IFGACB
ACBLENG  EQU   ACBCOMN+2
ACBLENG2 EQU   ACBLENG
ACBAMBL  EQU   ACBCOMN+4
ACBJWA   EQU   ACBAMBL
ACBMACRF EQU   ACBCOMN+12
ACBMACR1 EQU   ACBMACRF
ACBADR   EQU   ACBMACR1
ACBCNV   EQU   ACBMACR1
ACBMACR2 EQU   ACBMACRF+1
ACBBUFPL EQU   ACBCOMN+20
ACBMACR3 EQU   ACBBUFPL
ACBRECFM EQU   ACBCOMN+24
ACBCCTYP EQU   ACBCOMN+25
ACBOPT   EQU   ACBCOMN+26
ACBDSORG EQU   ACBOPT
ACBCROPS EQU   ACBDSORG
ACBEXLST EQU   ACBCOMN+36
ACBDDNM  EQU   ACBCOMN+40
ACBAMETH EQU   ACBDDNM+3
ACBOFLGS EQU   ACBCOMN+48
ACBOPEN  EQU   ACBOFLGS
ACBEXFG  EQU   ACBOFLGS
ACBIOSFG EQU   ACBOFLGS
ACBINFLG EQU   ACBCOMN+50
ACBUJFCB EQU   ACBCOMN+52
ACBBLKSZ EQU   ACBCOMN+60
S99TUPL  EQU   0
S99TUPTR EQU   S99TUPL
S99TUP   EQU   0
S99TUNIT EQU   0
S99TUENT EQU   S99TUNIT+4
S99TUFLD EQU   0
SSIB     EQU   0
SSIBFLG1 EQU   SSIB+6
SSOB     EQU   0
SSOBFUNC EQU   SSOB+6
SSRR     EQU   0
JESCT    EQU   0
JESWAA   EQU   JESCT+8
JESSSREQ EQU   JESCT+20
JESALLOC EQU   JESCT+32
JESUNALC EQU   JESCT+36
JESCATL  EQU   JESCT+40
SSREQ    EQU   0
ACBCORE  EQU   0
RECQFMT  EQU   0
CHAINPTR EQU   RECQFMT
SWITCHFD EQU   RECQFMT+4
DATAFLD  EQU   RECQFMT+8
DATASIZE EQU   DATAFLD
DATATXT  EQU   DATAFLD+4
STAEPARM EQU   0
BASEADR1 EQU   STAEPARM
DATAADR1 EQU   STAEPARM+4
SAVADR1  EQU   STAEPARM+8
PREVCHN  EQU   0
ZEROPTR  EQU   PREVCHN
PREVCNT  EQU   PREVCHN+4
IEFAB4F5 EQU   0
IEFBB410 EQU   0
IEFW21SD EQU   0
RPLCORE  EQU   0
SWAMGR   EQU   0
UCM2PTR  EQU   0
UCMBASPT EQU   CVTCUCB
UCMMCSPT EQU   UCMPRFXP
UCMDVEPT EQU   UCMVEA
CVTS01   EQU   CVTPGSIA
CVTLPDIA EQU   CVTS01+12
CVTDIRST EQU   CVTLPDIA
CVTSLIDA EQU   CVTS01+24
CVTCTLFG EQU   CVTS01+50
CVTRV210 EQU   CVTS01+424
CVTRV219 EQU   CVTS01+425
CVTRV228 EQU   CVTS01+426
CVTRV237 EQU   CVTS01+427
CVTMFRTR EQU   CVTS01+452
CVTRV262 EQU   CVTS01+468
CVTRV271 EQU   CVTS01+469
CVTRV280 EQU   CVTS01+470
CVTRV289 EQU   CVTS01+471
CVTGSDA  EQU   CVTS01+600
UCMIECBA EQU   UCMRECBA+4
JSCBSEC2 EQU   JSCBEND1
JSCBSEC3 EQU   JSCBEND1
JSCBJCT  EQU   JSCBSEC3
JSCBJCTA EQU   JSCBJCT+1
JSCBASID EQU   JSCBSEC3+8
JSCBFBYT EQU   JSCBSEC3+10
JSCBJNL  EQU   JSCBSEC3+28
JSCBJJSB EQU   JSCBJNL
JSCBSUB  EQU   JSCBSEC3+40
JSCSCT   EQU   JSCBSEC3+68
JSCRSV45 EQU   JSCBSEC3+112
JSCRSV46 EQU   JSCRSV45
JSCRSV47 EQU   JSCRSV45+2
SSIBPTR  EQU   LCASSIBP
ECBMAP   EQU   MSLGCLOZ
ECBCODE  EQU   ECBMAP+3
*                                      START UNREFERENCED COMPONENTS
@NM00083 EQU   ECBMAP
JSCBEND3 EQU   JSCBSEC3+120
JSCRSV52 EQU   JSCBSEC3+116
JSCRSV51 EQU   JSCRSV47+1
JSCRSV50 EQU   JSCRSV47
JSCRSV49 EQU   JSCRSV46+1
JSCRSV48 EQU   JSCRSV46
JSCRSV44 EQU   JSCBSEC3+108
JSCRSV43 EQU   JSCBSEC3+104
JSCRSV42 EQU   JSCBSEC3+100
JSCBASWA EQU   JSCBSEC3+96
JSCBUFPT EQU   JSCBSEC3+92
JSCBACT  EQU   JSCBSEC3+88
JSCBSWSP EQU   JSCBSEC3+87
JSCRSV33 EQU   JSCBSEC3+86
JSCDDNUM EQU   JSCBSEC3+84
JSCRSV53 EQU   JSCBSEC3+82
JSCDDNNO EQU   JSCBSEC3+80
JSCBVATA EQU   JSCBSEC3+76
JSCTMCOR EQU   JSCBSEC3+72
JSCSCTP  EQU   JSCSCT+1
JSCRSV55 EQU   JSCSCT
JSCRSV54 EQU   JSCBSEC3+64
JSCDSABQ EQU   JSCBSEC3+60
JSCBSSIB EQU   JSCBSEC3+56
JSCBFRBA EQU   JSCBSEC3+48
JSCRSV28 EQU   JSCBSEC3+46
JSCBSONO EQU   JSCBSEC3+44
JSCBSUBA EQU   JSCBSUB+1
JSCRSV31 EQU   JSCBSUB
JSCBSMLR EQU   JSCBSEC3+36
JSCBJNLR EQU   JSCBSEC3+32
JSCBJNLA EQU   JSCBJNL+1
JSCBJSBT EQU   JSCBJJSB
JSCBJSBX EQU   JSCBJJSB
JSCBJSBA EQU   JSCBJJSB
JSCBJSBI EQU   JSCBJJSB
@NM00066 EQU   JSCBJJSB
JSCBJNLE EQU   JSCBJJSB
JSCBJNLF EQU   JSCBJJSB
JSCBJNLN EQU   JSCBJJSB
@NM00065 EQU   JSCBSEC3+24
JSCBJRBA EQU   JSCBSEC3+16
JSCBIECB EQU   JSCBSEC3+12
JSCBRV08 EQU   JSCBSEC3+11
JSCBRV07 EQU   JSCBFBYT
JSCBRV06 EQU   JSCBFBYT
JSCBRV05 EQU   JSCBFBYT
JSCBRV04 EQU   JSCBFBYT
JSCBRV03 EQU   JSCBFBYT
JSCBRV02 EQU   JSCBFBYT
JSCBADSP EQU   JSCBFBYT
JSCBRV01 EQU   JSCBFBYT
JSCBTJID EQU   JSCBASID
JSCBPSCB EQU   JSCBSEC3+4
JSCJCTP  EQU   JSCBJCTA
JSCRSV24 EQU   JSCBJCT
JSCBEND2 EQU   JSCBSEC2
UCMIECBP EQU   UCMIECBA+1
UCMIECBF EQU   UCMIECBA
CVTRV628 EQU   CVTS01+728
CVTRV627 EQU   CVTS01+724
CVTRV626 EQU   CVTS01+720
CVTRV625 EQU   CVTS01+716
CVTRV624 EQU   CVTS01+712
CVTRV623 EQU   CVTS01+708
CVTRV622 EQU   CVTS01+704
CVTRV621 EQU   CVTS01+700
CVTIHASU EQU   CVTS01+696
CVTRV619 EQU   CVTS01+692
CVTRV618 EQU   CVTS01+688
CVTRV617 EQU   CVTS01+684
CVTRV616 EQU   CVTS01+680
CVTRV615 EQU   CVTS01+676
CVTRV614 EQU   CVTS01+672
CVTRV613 EQU   CVTS01+668
CVTTCASP EQU   CVTS01+664
CVT0PT03 EQU   CVTS01+660
CVT0PT0E EQU   CVTS01+656
CVTRV609 EQU   CVTS01+652
CVTCGK   EQU   CVTS01+648
CVTRAC   EQU   CVTS01+644
CVTRV606 EQU   CVTS01+640
CVTRV605 EQU   CVTS01+636
CVTRV604 EQU   CVTS01+632
CVTEFF02 EQU   CVTS01+628
CVTCBBR  EQU   CVTS01+624
CVTSSCR  EQU   CVTS01+620
CVTEVENT EQU   CVTS01+616
CVTCRCA  EQU   CVTS01+612
CVTTPIO  EQU   CVTS01+608
CVTADV   EQU   CVTS01+604
CVTGSDAB EQU   CVTGSDA
CVTQV3   EQU   CVTS01+596
CVTQV2   EQU   CVTS01+592
CVTQV1   EQU   CVTS01+588
CVTRPT   EQU   CVTS01+584
CVTSSRB  EQU   CVTS01+580
CVTCSDRL EQU   CVTS01+576
CVTEXP1  EQU   CVTS01+572
CVTRMPMT EQU   CVTS01+568
CVTRMPTT EQU   CVTS01+564
CVTVPSA  EQU   CVTS01+560
CVTVSTOP EQU   CVTS01+556
CVTGTFR8 EQU   CVTS01+552
CVTQUIT  EQU   CVTS01+548
CVTVACR  EQU   CVTS01+544
CVTWTCB  EQU   CVTS01+540
CVTSTPRS EQU   CVTS01+536
CVT0PT02 EQU   CVTS01+532
CVTDARCM EQU   CVTS01+528
CVTIRECM EQU   CVTS01+524
CVTJRECM EQU   CVTS01+520
CVTVEMS0 EQU   CVTS01+516
CVTSPFRR EQU   CVTS01+512
CVTRLSTG EQU   CVTS01+508
CVT0TC0A EQU   CVTS01+504
CVTGMBR  EQU   CVTS01+500
CVTLFRM  EQU   CVTS01+496
CVTRMBR  EQU   CVTS01+492
CVTVIOP  EQU   CVTS01+488
CVTRV307 EQU   CVTS01+486
CVTRV306 EQU   CVTS01+484
CVTRV305 EQU   CVTS01+482
CVTRV304 EQU   CVTS01+480
CVTRV303 EQU   CVTS01+478
CVTRV302 EQU   CVTS01+476
CVTTRCA  EQU   CVTS01+472
CVTRV297 EQU   CVTRV289
CVTRV296 EQU   CVTRV289
CVTRV295 EQU   CVTRV289
CVTRV294 EQU   CVTRV289
CVTRV293 EQU   CVTRV289
CVTRV292 EQU   CVTRV289
CVTRV291 EQU   CVTRV289
CVTRV290 EQU   CVTRV289
CVTRV288 EQU   CVTRV280
CVTRV287 EQU   CVTRV280
CVTRV286 EQU   CVTRV280
CVTRV285 EQU   CVTRV280
CVTRV284 EQU   CVTRV280
CVTRV283 EQU   CVTRV280
CVTRV282 EQU   CVTRV280
CVTRV281 EQU   CVTRV280
CVTRV279 EQU   CVTRV271
CVTRV278 EQU   CVTRV271
CVTRV277 EQU   CVTRV271
CVTRV276 EQU   CVTRV271
CVTRV275 EQU   CVTRV271
CVTRV274 EQU   CVTRV271
CVTRV273 EQU   CVTRV271
CVTRV272 EQU   CVTRV271
CVTRV270 EQU   CVTRV262
CVTRV269 EQU   CVTRV262
CVTRV268 EQU   CVTRV262
CVTRV267 EQU   CVTRV262
CVTRV266 EQU   CVTRV262
CVTRV265 EQU   CVTRV262
CVTRV264 EQU   CVTRV262
CVTRV263 EQU   CVTRV262
CVTVFP   EQU   CVTS01+464
CVTVSI   EQU   CVTS01+460
CVTVPSIB EQU   CVTS01+456
CVTMFACT EQU   CVTMFRTR
CVTMFCTL EQU   CVTS01+448
CVTPVBP  EQU   CVTS01+444
CVTPWI   EQU   CVTS01+440
CVTRV254 EQU   CVTS01+438
CVTRV253 EQU   CVTS01+436
CVTRV252 EQU   CVTS01+434
CVTRV251 EQU   CVTS01+433
CVTRV250 EQU   CVTS01+432
CVTRV249 EQU   CVTS01+431
CVTRV248 EQU   CVTS01+430
CVTRV247 EQU   CVTS01+429
CVTRV246 EQU   CVTS01+428
CVTRV245 EQU   CVTRV237
CVTRV244 EQU   CVTRV237
CVTRV243 EQU   CVTRV237
CVTRV242 EQU   CVTRV237
CVTRV241 EQU   CVTRV237
CVTRV240 EQU   CVTRV237
CVTRV239 EQU   CVTRV237
CVTRV238 EQU   CVTRV237
CVTRV236 EQU   CVTRV228
CVTRV235 EQU   CVTRV228
CVTRV234 EQU   CVTRV228
CVTRV233 EQU   CVTRV228
CVTRV232 EQU   CVTRV228
CVTRV231 EQU   CVTRV228
CVTRV230 EQU   CVTRV228
CVTRV229 EQU   CVTRV228
CVTRV227 EQU   CVTRV219
CVTRV226 EQU   CVTRV219
CVTRV225 EQU   CVTRV219
CVTRV224 EQU   CVTRV219
CVTRV223 EQU   CVTRV219
CVTRV222 EQU   CVTRV219
CVTRV221 EQU   CVTRV219
CVTRV220 EQU   CVTRV219
CVTRV218 EQU   CVTRV210
CVTRV217 EQU   CVTRV210
CVTRV216 EQU   CVTRV210
CVTRV215 EQU   CVTRV210
CVTRV214 EQU   CVTRV210
CVTRV213 EQU   CVTRV210
CVTRV212 EQU   CVTRV210
CVTRV211 EQU   CVTRV210
CVTLCCAT EQU   CVTS01+420
CVTPCCAT EQU   CVTS01+416
CVTIPCRP EQU   CVTS01+412
CVTIPCRI EQU   CVTS01+408
CVTIPCDS EQU   CVTS01+404
CVTAIDVT EQU   CVTS01+400
CVTSSAP  EQU   CVTS01+396
CVTEHCIR EQU   CVTS01+392
CVTEHDEF EQU   CVTS01+388
CVTDAIR  EQU   CVTS01+384
CVTPERFM EQU   CVTS01+380
CVT044R2 EQU   CVTS01+376
CVTFETCH EQU   CVTS01+372
CVTRSTWD EQU   CVTS01+368
CVTSPOST EQU   CVTS01+364
CVTIOBP  EQU   CVTS01+360
CVTASMVT EQU   CVTS01+356
CVTRECRQ EQU   CVTS01+352
CVTWSAC  EQU   CVTS01+348
CVTRV149 EQU   CVTS01+344
CVTWSAL  EQU   CVTS01+340
CVTSPSA  EQU   CVTS01+336
CVTGLMN  EQU   CVTS01+332
CVTVEAC0 EQU   CVTS01+328
CVT062R1 EQU   CVTS01+324
CVTRPOST EQU   CVTS01+320
CVTDQIQE EQU   CVTS01+316
CVTCSD   EQU   CVTS01+312
CVTLKRMA EQU   CVTS01+308
CVTRSPIE EQU   CVTS01+304
CVTRENQ  EQU   CVTS01+300
CVTLQCB  EQU   CVTS01+296
CVTFQCB  EQU   CVTS01+292
CVTQCS01 EQU   CVTS01+288
CVTAPFT  EQU   CVTS01+284
CVTPARRL EQU   CVTS01+280
CVTVWAIT EQU   CVTS01+276
CVTGSPL  EQU   CVTS01+272
CVTLSMQ  EQU   CVTS01+268
CVTGSMQ  EQU   CVTS01+264
CVTEXPRO EQU   CVTS01+260
CVTOPCTP EQU   CVTS01+256
CVTSIC   EQU   CVTS01+252
CVTTPIOS EQU   CVTS01+248
CVTRTMS  EQU   CVTS01+244
CVTSDBF  EQU   CVTS01+240
CVTSCBP  EQU   CVTS01+236
CVTSDMP  EQU   CVTS01+232
CVTSV60  EQU   CVTS01+228
CVTRTMCT EQU   CVTS01+224
CVTASCBL EQU   CVTS01+220
CVTASCBH EQU   CVTS01+216
CVTGDA   EQU   CVTS01+212
CVTASVT  EQU   CVTS01+208
CVTVVMDI EQU   CVTS01+204
CVTAQTOP EQU   CVTS01+200
CVTIOSCS EQU   CVTS01+196
CVTSDRM  EQU   CVTS01+192
CVTOPTE  EQU   CVTS01+188
CVTSTXU  EQU   CVTS01+184
CVTQUIS  EQU   CVTS01+180
CVTPARS  EQU   CVTS01+176
CVTS1EE  EQU   CVTS01+172
CVTFRAS  EQU   CVTS01+168
CVTQSAS  EQU   CVTS01+164
CVTCRAS  EQU   CVTS01+160
CVTCRMN  EQU   CVTS01+156
CVTDELCP EQU   CVTS01+152
CVTFRECL EQU   CVTS01+148
CVTGETCL EQU   CVTS01+144
CVTBLDCP EQU   CVTS01+140
CVTAUTHL EQU   CVTS01+136
CVTSCAN  EQU   CVTS01+132
CVTRV144 EQU   CVTS01+130
CVTMAXMP EQU   CVTS01+128
CVTSTCK  EQU   CVTS01+124
CVTRV139 EQU   CVTS01+123
CVTDSSAC EQU   CVTS01+122
CVTRV513 EQU   CVTS01+121
CVTIOSPL EQU   CVTS01+120
CVTPTGT  EQU   CVTS01+116
CVTCSPIE EQU   CVTS01+112
CVTSMFEX EQU   CVTS01+108
CVTOLT0A EQU   CVTS01+104
CVTSRBRT EQU   CVTS01+100
CVTPUTL  EQU   CVTS01+96
CVTASCRL EQU   CVTS01+92
CVTASCRF EQU   CVTS01+88
CVTRV326 EQU   CVTS01+84
CVTRV325 EQU   CVTS01+80
CVTRV324 EQU   CVTS01+76
CVT0VL01 EQU   CVTS01+72
CVTSHRVM EQU   CVTS01+68
CVTRV332 EQU   CVTS01+64
CVTTAS   EQU   CVTS01+60
CVTRSCN  EQU   CVTS01+56
CVTTRAC2 EQU   CVTS01+54
CVTTRACE EQU   CVTS01+52
CVTAPG   EQU   CVTS01+51
CVTSDTRC EQU   CVTCTLFG
CVTGTRCE EQU   CVTCTLFG
CVTNOMP  EQU   CVTCTLFG
CVTRSV79 EQU   CVTCTLFG
CVTDSTAT EQU   CVTCTLFG
CVTRSV78 EQU   CVTCTLFG
CVTRV333 EQU   CVTCTLFG
CVTRV323 EQU   CVTCTLFG
CVTSPVLK EQU   CVTS01+49
CVTRSV77 EQU   CVTS01+48
CVTRV331 EQU   CVTS01+44
CVTRV330 EQU   CVTS01+40
CVTRV329 EQU   CVTS01+36
CVTRV328 EQU   CVTS01+32
CVTRV322 EQU   CVTS01+28
CVTSLID  EQU   CVTSLIDA+1
CVTSYLK  EQU   CVTSLIDA
CVTRV321 EQU   CVTS01+20
CVTRV320 EQU   CVTS01+16
CVTLPDIR EQU   CVTLPDIA+1
CVTRSV69 EQU   CVTDIRST
CVTRSV68 EQU   CVTDIRST
CVTRSV67 EQU   CVTDIRST
CVTRSV66 EQU   CVTDIRST
CVTRSV65 EQU   CVTDIRST
CVTRSV64 EQU   CVTDIRST
CVTRSV63 EQU   CVTDIRST
CVTDICOM EQU   CVTDIRST
CVTPVTP  EQU   CVTS01+8
CVTLPDSR EQU   CVTS01+4
CVTGETL  EQU   CVTS01
@NM00082 EQU   DATAFLD+2
ADDRELE  EQU   SWITCHFD+1
SWITCHS  EQU   SWITCHFD
JESPJESN EQU   JESCT+28
JESSSCT  EQU   JESCT+24
JESRESQM EQU   JESCT+16
JESQMGR  EQU   JESCT+12
JESUNITS EQU   JESCT+4
@NM00079 EQU   JESCT
SSRRSECB EQU   SSRR+4
@NM00078 EQU   SSRR+2
SSRRLEN  EQU   SSRR
SSOBINDV EQU   SSOB+16
SSOBRETN EQU   SSOB+12
SSOBSSIB EQU   SSOB+8
SSOBLEN  EQU   SSOB+4
SSOBID   EQU   SSOB
SSIBSUSE EQU   SSIB+32
SSIBRSV1 EQU   SSIB+28
SSIBDEST EQU   SSIB+20
SSIBJBID EQU   SSIB+12
SSIBSSNM EQU   SSIB+8
SSIBRESV EQU   SSIB+7
@NM00077 EQU   SSIBFLG1
SSIBPJES EQU   SSIBFLG1
SSIBLEN  EQU   SSIB+4
SSIBID   EQU   SSIB
S99TUPRM EQU   S99TUFLD+2
S99TULEN EQU   S99TUFLD
S99TUPAR EQU   S99TUENT+2
S99TULNG EQU   S99TUENT
S99TUNUM EQU   S99TUNIT+2
S99TUKEY EQU   S99TUNIT
S99TUPND EQU   S99TUP
S99TUPLN EQU   S99TUPTR
ACBAPID  EQU   ACBCOMN+72
ACBCBMWA EQU   ACBCOMN+68
ACBUAPTR EQU   ACBCOMN+64
ACBLRECL EQU   ACBCOMN+62
ACBMSGLN EQU   ACBBLKSZ
ACBBUFSP EQU   ACBCOMN+56
@NM00076 EQU   ACBUJFCB+1
ACBOPTN  EQU   ACBUJFCB
ACBVVIC  EQU   ACBINFLG
ACBUCRA  EQU   ACBINFLG
ACBSCRA  EQU   ACBINFLG
ACBCAT   EQU   ACBINFLG
ACBIJRQE EQU   ACBINFLG
ACBJEPS  EQU   ACBINFLG
@NM00075 EQU   ACBINFLG
ACBERFLG EQU   ACBCOMN+49
ACBBUSY  EQU   ACBIOSFG
ACBLOCK  EQU   ACBEXFG
@NM00074 EQU   ACBOFLGS
ACBDSERR EQU   ACBOFLGS
ACBEOV   EQU   ACBOFLGS
@NM00073 EQU   ACBOFLGS
ACBDEB   EQU   ACBDDNM+5
ACBERFL  EQU   ACBDDNM+4
ACBAM    EQU   ACBAMETH
ACBINFL  EQU   ACBDDNM+2
ACBTIOT  EQU   ACBDDNM
ACBUEL   EQU   ACBEXLST
ACBPASSW EQU   ACBCOMN+32
ACBMSGAR EQU   ACBCOMN+28
@NM00072 EQU   ACBDSORG+1
ACBDORGA EQU   ACBDSORG+1
@NM00071 EQU   ACBDSORG
ACBCRNRE EQU   ACBCROPS
ACBCRNCK EQU   ACBCROPS
ACBASA   EQU   ACBCCTYP
@NM00070 EQU   ACBCCTYP
ACBRECAF EQU   ACBRECFM
ACBJBUF  EQU   ACBBUFPL+2
ACBMACR4 EQU   ACBBUFPL+1
@NM00069 EQU   ACBMACR3
ACBNCFX  EQU   ACBMACR3
ACBSIS   EQU   ACBMACR3
ACBDFR   EQU   ACBMACR3
ACBICI   EQU   ACBMACR3
ACBGSR   EQU   ACBMACR3
ACBLSR   EQU   ACBMACR3
@NM00068 EQU   ACBMACR3
ACBBUFNI EQU   ACBCOMN+18
ACBBUFND EQU   ACBCOMN+16
ACBSTRNO EQU   ACBCOMN+15
ACBBSTNO EQU   ACBCOMN+14
ACBAIX   EQU   ACBMACR2
ACBDSN   EQU   ACBMACR2
ACBRST   EQU   ACBMACR2
ACBLOGON EQU   ACBMACR2
ACBSKP   EQU   ACBMACR2
@NM00067 EQU   ACBMACR2
ACBUBF   EQU   ACBMACR1
ACBOUT   EQU   ACBMACR1
ACBIN    EQU   ACBMACR1
ACBDIR   EQU   ACBMACR1
ACBSEQ   EQU   ACBMACR1
ACBBLK   EQU   ACBCNV
ACBADD   EQU   ACBADR
ACBKEY   EQU   ACBMACR1
ACBINRTN EQU   ACBCOMN+8
ACBIBCT  EQU   ACBJWA
ACBLEN2  EQU   ACBLENG2
ACBSTYP  EQU   ACBCOMN+1
ACBID    EQU   ACBCOMN
JSCBCSCB EQU   JSCBSEC1+68
JSCBPMG  EQU   JSCBWTP+2
JSCBWTSP EQU   JSCBWTP+1
JSCRSV23 EQU   JSCBWTFG
JSCRSV22 EQU   JSCBWTFG
JSCRSV21 EQU   JSCBWTFG
JSCRSV20 EQU   JSCBWTFG
JSCRSV19 EQU   JSCBWTFG
JSCRSV18 EQU   JSCBWTFG
JSCBRET  EQU   JSCBWTFG
JSCBIOFG EQU   JSCBWTFG
@NM00064 EQU   JSCBSEC1+60
JSCBQMPI EQU   JSCBSEC1+56
JSCBPMSG EQU   JSCBSWT1
JSCRSV16 EQU   JSCBSWT1
JSCRSV15 EQU   JSCBSWT1
JSCRSV14 EQU   JSCBSWT1
JSCRSV13 EQU   JSCBSWT1
JSCRSV12 EQU   JSCBSWT1
JSCRSV11 EQU   JSCBSWT1
JSCBPASS EQU   JSCBSWT1
JSCBTTTR EQU   JSCBSEC1+52
JSCRSV10 EQU   JSCBSEC1+49
JSCBAUTH EQU   JSCBOPTS
JSCSIOTS EQU   JSCBOPTS
JSCRSV08 EQU   JSCBOPTS
JSCRSV07 EQU   JSCBOPTS
JSCRSV06 EQU   JSCBOPTS
JSCBLONG EQU   JSCBOPTS
JSCRSV05 EQU   JSCBOPTS
JSCRSV04 EQU   JSCBOPTS
JSCBSECB EQU   JSCBSEC1+44
JSCRSV03 EQU   JSCBSEC1+41
JSCBSTEP EQU   JSCBSEC1+40
JSCBDCBA EQU   JSCBDCB+1
JSCRSV02 EQU   JSCBDCB
JSCBID   EQU   JSCBSEC1+32
JSCBIJSC EQU   JSCBSEC1+24
JSCBTCBP EQU   JSCBSEC1+20
JSCBPCC  EQU   JSCBSEC1+16
JSCBTCP  EQU   JSCBSEC1+12
JSCBSHR  EQU   JSCBSEC1+8
JSCHPCEA EQU   JSCHPCE+1
JSCRSV32 EQU   JSCHPCE
JSCRSV01 EQU   JSCBSEC1
@NM00063 EQU   IEZJSCB
RPLERMSA EQU   RPLCOMN+72
RPLEMLEN EQU   RPLCOMN+70
RPLACTIV EQU   RPLCOMN+69
RPLBRANC EQU   RPLEXTD1
RPLNIB   EQU   RPLEXTD1
@NM00062 EQU   RPLEXTD1
RPLEXIT  EQU   RPLEXTD1
RPLNEXIT EQU   RPLEXTD1
RPLEXSCH EQU   RPLEXTD1
RPLDDDD  EQU   RPLRBAR+4
@NM00061 EQU   RPLRBAR+3
@NM00060 EQU   RPLAIXID
RPLAXPKP EQU   RPLAIXID
RPLAIXPC EQU   RPLRBAR
RPLRSV88 EQU   RPLOPT8
RPLUNCON EQU   RPLOPT8
RPLACTV  EQU   RPLOPT8
RPLSESS  EQU   RPLOPT8
RPLPEND  EQU   RPLOPT8
RPLODPRM EQU   RPLOPT8
RPLODACP EQU   RPLOPT8
RPLODACQ EQU   RPLOPT8
RPLRSV78 EQU   RPLOPT7
RPLRSV77 EQU   RPLOPT7
RPLRLSOP EQU   RPLOPT7
RPLTPOST EQU   RPLOPT7
RPLQOPT  EQU   RPLOPT7
RPLCNIMM EQU   RPLCNOPT
RPLCNANY EQU   RPLCNOPT
RPLCNALL EQU   RPLCNOPT
RPLRSV68 EQU   RPLOPT6
RPLRSV67 EQU   RPLOPT6
RPLLOCK  EQU   RPLOPT6
RPLNCOND EQU   RPLOPT6
RPLCOND  EQU   RPLOPT6
RPLEOT   EQU   RPLUNTYP
RPLEOM   EQU   RPLUNTYP
RPLEOB   EQU   RPLUNTYP
RPLWROPT EQU   RPLOPT5
RPLNODE  EQU   RPLOPT5
RPLERACE EQU   RPLWRTYP
RPLEAU   EQU   RPLWRTYP
RPLNERAS EQU   RPLWRTYP
RPLPSOPT EQU   RPLOPT5
RPLSSNIN EQU   RPLOPT5
RPLDLGIN EQU   RPLOPT5
RPLBUFL  EQU   RPLCOMN+52
RPLCHAIN EQU   RPLNXTRP
RPLOPT4  EQU   RPLOPTCD+3
RPLALIGN EQU   RPLOPT3
RPLFMT   EQU   RPLOPT3
RPLFLD   EQU   RPLOPT3
RPLVFY   EQU   RPLOPT3
RPLBLK   EQU   RPLOPT3
RPLSFORM EQU   RPLOPT3
RPLEODS  EQU   RPLOPT3
RPLNSP   EQU   RPLOPT2
RPLUPD   EQU   RPLOPT2
@NM00059 EQU   RPLOPT2
RPLLRD   EQU   RPLOPT2
RPLBWD   EQU   RPLOPT2
RPLCNV   EQU   RPLOPT2
RPLADD   EQU   RPLADR
RPLKEY   EQU   RPLOPT2
RPLECBIN EQU   RPLECBSW
RPLGEN   EQU   RPLOPT1
RPLKGE   EQU   RPLOPT1
RPLASY   EQU   RPLOPT1
RPLSKP   EQU   RPLOPT1
RPLSEQ   EQU   RPLOPT1
RPLDIR   EQU   RPLOPT1
RPLLOC   EQU   RPLOPT1
RPLDAF   EQU   RPLARG+2
RPLSAF   EQU   RPLARG
RPLTCBPT EQU   RPLCOMN+28
RPLCCHAR EQU   RPLCOMN+20
RPLSTRID EQU   RPLCOMN+18
RPLKEYL  EQU   RPLKEYLE
RPLRDSOH EQU   RPLFDB3
RPLRLG   EQU   RPLFDB3
RPLLGFRC EQU   RPLFDB3
RPLREOT  EQU   RPLFDB3
RPLREOM  EQU   RPLFDB3
RPLREOB  EQU   RPLFDB3
RPLSV32  EQU   RPLFDB3
RPLUINPT EQU   RPLFDB3
RPLSTSAV EQU   RPLFDB2
RPLCUERR EQU   RPLFDB2
RPLDLGFL EQU   RPLFDB2
RPLIOERR EQU   RPLFDB2
RPLDVUNS EQU   RPLFDB2
RPLATND  EQU   RPLFDB2
RPLRVID  EQU   RPLFDB2
RPLERLK  EQU   RPLFDB2
RPLERREG EQU   RPLRTNCD
RPLSTAT  EQU   RPLFDBWD
RPLPOST  EQU   RPLECB
RPLWAIT  EQU   RPLECB
RPLPLHPT EQU   RPLCOMN+4
RPLLEN2  EQU   RPLLEN
RPLREQ   EQU   RPLIDWD+2
RPLSTYP  EQU   RPLIDWD+1
RPLID    EQU   RPLIDWD
ASCBPTR  EQU   TCBASCB+12
ASCBNEXT EQU   TCBASCB+8
TCBNEXT  EQU   TCBASCB
UCMRCTA  EQU   UCMRCT+1
UCMRSV31 EQU   UCMSDS5
UCMSDS5G EQU   UCMSDS5
UCMSDS5F EQU   UCMSDS5
UCMRSV30 EQU   UCMSDS5
UCMRSV29 EQU   UCMSDS5
UCMSDS5C EQU   UCMSDS5
UCMSDS5B EQU   UCMSDS5
UCMSDS5A EQU   UCMSDS5
UCMMLAST EQU   UCMLIST+64
UCMVHRSN EQU   UCMDEVC
UCMDEVG  EQU   UCMDEVC
UCMDEVF  EQU   UCMDEVC
UCMDEVE  EQU   UCMDEVC
UCMDEVD  EQU   UCMDEVC
UCMDEVCC EQU   UCMDEVC
UCMDEVB  EQU   UCMDEVC
UCMDEVA  EQU   UCMDEVC
UCMXOR   EQU   UCMLIST+62
UCMMSG2  EQU   UCMMSG+1
UCMRSV27 EQU   UCMMSG1
UCMRSV26 EQU   UCMMSG1
UCMMSGF  EQU   UCMMSG1
UCMMSGE  EQU   UCMMSG1
UCMMSGD  EQU   UCMMSG1
UCMMSGC  EQU   UCMMSG1
UCMMSGB  EQU   UCMMSG1
UCMMSGA  EQU   UCMMSG1
UCMCOMPC EQU   UCMLIST+56
UCMWLAST EQU   UCMLIST+52
UCMOAOEN EQU   UCMLIST+48
UCMALTEN EQU   UCMLIST+44
UCMRV007 EQU   UCMDISP2
UCMRV006 EQU   UCMDISP2
UCMRV005 EQU   UCMDISP2
UCMRV004 EQU   UCMDISP2
UCMRV003 EQU   UCMDISP2
UCMDISPK EQU   UCMDISP2
UCMDISPJ EQU   UCMDISP2
UCMDISPI EQU   UCMDISP2
UCMDISPH EQU   UCMDISP1
UCMDISPG EQU   UCMDISP1
UCMDISPF EQU   UCMDISP1
UCMDISPE EQU   UCMDISP1
UCMDISPD EQU   UCMDISP1
UCMDISPC EQU   UCMDISP1
UCMDISPB EQU   UCMDISP1
UCMDISPA EQU   UCMDISP1
UCMAUTHB EQU   UCMAUTH+1
UCMRSV23 EQU   UCMAUTHA
UCMRSV22 EQU   UCMAUTHA
UCMRSV21 EQU   UCMAUTHA
UCMRSV20 EQU   UCMAUTHA
UCMRSV19 EQU   UCMAUTHA
UCMAUTH3 EQU   UCMAUTHA
UCMAUTH2 EQU   UCMAUTHA
UCMAUTH1 EQU   UCMAUTHA
UCMOUTQ  EQU   UCMLIST+36
UCMRSV18 EQU   UCMLIST+34
UCMRTCD  EQU   UCMLIST+32
UCMXB    EQU   UCMLIST+28
@NM00058 EQU   UCMXA+1
UCMID    EQU   UCMXA
UCMRSV17 EQU   UCMATR
UCMRSV16 EQU   UCMATR
UCMAT04  EQU   UCMATR
UCMLF    EQU   UCMATR
UCMUF    EQU   UCMATR
UCMXF    EQU   UCMATR
UCMIF    EQU   UCMATR
UCMOF    EQU   UCMATR
UCMTC    EQU   UCMSTS
UCMTD    EQU   UCMSTS
UCMTB    EQU   UCMSTS
UCMTA    EQU   UCMSTS
UCMCF    EQU   UCMSTS
UCMBF    EQU   UCMSTS
UCMPF    EQU   UCMSTS
UCMAF    EQU   UCMSTS
UCMNAME  EQU   UCMLIST+16
UCMUCB   EQU   UCMLIST+12
UCMDCB   EQU   UCMLIST+8
UCMSBR   EQU   UCMLIST+4
UCMECB   EQU   UCMLIST
UCMTPSAV EQU   UCMEXIT+208
UCMXTSAV EQU   UCMEXIT+136
UCMDESCD EQU   UCMEXIT+132
UCMROUTC EQU   UCMEXIT+128
UCMMSTXT EQU   UCMEXIT
UCMDECBA EQU   UCMEIL+20
UCMOECBA EQU   UCMEIL+16
UCMAECBA EQU   UCMEIL+12
UCMXECBA EQU   UCMEIL+8
UCMNIPTR EQU   UCMEIL+4
UCMRSV15 EQU   UCMEIL+3
UCMRTCT  EQU   UCMEIL+2
UCMRPYL  EQU   UCMEIL+1
@NM00057 EQU   UCMEIL
UCMRSV60 EQU   UCM+302
UCMRSV59 EQU   UCMRSV51
UCMRSV58 EQU   UCMRSV51
UCMRSV57 EQU   UCMRSV51
UCMRSV56 EQU   UCMRSV51
UCMRSV55 EQU   UCMRSV51
UCMRSV54 EQU   UCMRSV51
UCMRSV53 EQU   UCMRSV51
UCMRSV52 EQU   UCMRSV51
UCMRSV50 EQU   UCMRSV42
UCMRSV49 EQU   UCMRSV42
UCMRSV48 EQU   UCMRSV42
UCMRSV47 EQU   UCMRSV42
UCMRSV46 EQU   UCMRSV42
UCMRSV45 EQU   UCMRSV42
UCMRSV44 EQU   UCMRSV42
UCMRSV43 EQU   UCMRSV42
UCMJES3T EQU   UCM+296
UCMWAKUP EQU   UCM+292
UCMFRRAD EQU   UCM+288
UCMSWCH  EQU   UCM+284
UCMWQECP EQU   UCM+276
UCMORECP EQU   UCM+272
UCMOECBT EQU   UCM+268
UCMOECBH EQU   UCM+264
UCMWECBT EQU   UCM+260
UCMWECBH EQU   UCM+256
UCMMBEND EQU   UCM+252
UCMCTID  EQU   UCM+250
UCMRSV61 EQU   UCM+248
UCMRP2AD EQU   UCM+244
UCMCRAAD EQU   UCM+240
UCMRV001 EQU   UCM+237
UCMMBPTR EQU   UCM+232
UCMMQNXT EQU   UCM+228
UCMMQEND EQU   UCM+224
UCMMQPTR EQU   UCM+220
UCMTRECB EQU   UCM+216
UCMMNECB EQU   UCM+212
UCMMNTR  EQU   UCM+208
UCMR9SV  EQU   UCM+204
UCMSAVE4 EQU   UCM+140
UCMSAVE3 EQU   UCM+84
UCMVEL   EQU   UCMVDATA+8
UCMVEZ   EQU   UCMVDATA+4
UCMINCR  EQU   UCM+71
UCMMODEL EQU   UCM+70
UCMCORE  EQU   UCM+69
UCMFIX   EQU   UCMMODE
UCMMCS   EQU   UCMMODE
UCMOGCE  EQU   UCMMODE
UCMAMFA  EQU   UCMMODE
UCMRSV14 EQU   UCMMODE
UCMTPUTA EQU   UCMMODE
UCMNOCON EQU   UCMMODE
UCMRSV11 EQU   UCMMODE
UCMPXA   EQU   UCM+64
UCMWQEND EQU   UCM+60
UCMWQNR  EQU   UCM+58
UCMRQNR  EQU   UCM+56
UCMWQECB EQU   UCM+52
UCMRQECB EQU   UCM+48
@NM00056 EQU   UCMRPYI
UCMRPYQ  EQU   UCM+28
UCMWTOQ  EQU   UCM+24
UCMLSTP  EQU   UCM+20
UCMARECB EQU   UCM+16
UCMLECB  EQU   UCMDECB
UCMOECB  EQU   UCM+8
UCMXECB  EQU   UCM
UCMGMCNT EQU   UCMPRFX+158
UCMSDS2  EQU   UCMPRFX+157
UCMRSV09 EQU   UCMSDS1
UCMRSV08 EQU   UCMSDS1
UCMRSV07 EQU   UCMSDS1
UCMRSV06 EQU   UCMSDS1
UCMRSV05 EQU   UCMSDS1
UCMRSV04 EQU   UCMSDS1
UCMSDS1B EQU   UCMSDS1
UCMSDS1A EQU   UCMSDS1
UCMDTINT EQU   UCMPRFX+152
UCMLOGAD EQU   UCMPRFX+148
UCMTPPTR EQU   UCMPRFX+140
UCMDOMRT EQU   UCMPRFX+136
UCMRUTCK EQU   UCMPRFX+132
UCMQRTN  EQU   UCMPRFX+128
UCM6WD   EQU   UCMXSA+20
UCM5WD   EQU   UCMXSA+16
UCM4WD   EQU   UCMXSA+12
UCM3WD   EQU   UCMXSA+8
UCM2WD   EQU   UCMXSA+4
UCM1WD   EQU   UCMXSA
UCMRSV03 EQU   UCMPRFX+102
UCMHRDRT EQU   UCMPRFX+100
UCMUEXIT EQU   UCMPRFX+97
UCMXCT   EQU   UCMPRFX+96
UCMHCUCM EQU   UCMPRFX+92
UCMCMID  EQU   UCMPRFX+88
UCMOWTOR EQU   UCMPRFX+86
UCMRSV02 EQU   UCMSFLG2
UCMSYSN  EQU   UCMSFLG2
UCMSYSM  EQU   UCMSFLG2
UCMSYSL  EQU   UCMSFLG2
UCMSYSK  EQU   UCMSFLG2
UCMSYSJ  EQU   UCMSFLG2
UCMSYSI  EQU   UCMSFLG2
UCMRSV35 EQU   UCMSFLG1
UCMSYSF  EQU   UCMSFLG1
UCMSYSE  EQU   UCMSFLG1
UCMSYSD  EQU   UCMSFLG1
UCMSYSC  EQU   UCMSFLG1
UCMSYSB  EQU   UCMSFLG1
UCMRSV01 EQU   UCMSFLG1
UCMWTOX  EQU   UCMPRFX+80
UCMDOME  EQU   UCMPRFX+76
UCMSVR0  EQU   UCMSAVE0+68
UCMSVQ0  EQU   UCMSAVE0+64
UCMSVP0  EQU   UCMSAVE0+60
UCMSVO0  EQU   UCMSAVE0+56
UCMSVN0  EQU   UCMSAVE0+52
UCMSVM0  EQU   UCMSAVE0+48
UCMSVL0  EQU   UCMSAVE0+44
UCMSVK0  EQU   UCMSAVE0+40
UCMSVJ0  EQU   UCMSAVE0+36
UCMSVI0  EQU   UCMSAVE0+32
UCMSVH0  EQU   UCMSAVE0+28
UCMSVG0  EQU   UCMSAVE0+24
UCMSVF0  EQU   UCMSAVE0+20
UCMSVE0  EQU   UCMSAVE0+16
UCMSVD0  EQU   UCMSAVE0+12
UCMSVC0  EQU   UCMSAVE0+8
UCMSVB0  EQU   UCMSAVE0+4
UCMSVA0  EQU   UCMSAVE0
UCMMCENT EQU   UCMPRFX
UCM2PAD  EQU   UCM2EXT+12
UCM2STAA EQU   UCM2STA+1
UCMRV008 EQU   UCM2SFLG
UCMRSV34 EQU   UCM2SFLG
UCMRSV33 EQU   UCM2SFLG
UCMRSV32 EQU   UCM2SFLG
UCM2DSTR EQU   UCM2SFLG
UCM2DTAK EQU   UCM2SFLG
UCM2SENT EQU   UCM2SFLG
UCM2SDWA EQU   UCM2SFLG
UCM2PST  EQU   UCM2EXT+4
UCM2RID  EQU   UCM2EXT+2
UCM2WID  EQU   UCM2EXT
@NM00055 EQU   LCABASE+79
WTLPLIM  EQU   WTLLMPTR+1
@NM00054 EQU   WTLLMPTR
@NM00053 EQU   LCACOREF
LCAFLG   EQU   LCACOREF
@NM00052 EQU   LCACLPTR
@NM00051 EQU   LCAPOSTT
POSTCLOZ EQU   LCAPOSTT
@NM00050 EQU   LWTRPTR+1
@NM00049 EQU   LWTRBITS
LECBEND  EQU   LWTRBITS
LWLOGPTR EQU   LCAELST+4
LCLOZPTR EQU   LCAELST
LCAASCB  EQU   LCABASE+16
LCAELEAD EQU   LCAELPTR+1
@NM00048 EQU   LCAPTSW
LCAPOST  EQU   LCAPTSW
MSSPARE  EQU   BASES01+48
MSUCBAL  EQU   BASES01+44
MSUCBPR  EQU   BASES01+40
MSBOBECB EQU   BASES01+36
MSSJQ    EQU   BASES01+32
MSECB    EQU   BASES01+28
MSPBP    EQU   BASES01+24
MSERM    EQU   BASES01+22
MSPASS   EQU   BASES01+14
MSVRB    EQU   BASES01+6
MSQHR    EQU   MSFHF
@NM00047 EQU   MSFHF
MSPSDT   EQU   MSFHF
MSREPLYB EQU   MSFHF
MSFAX    EQU   MSFHF
MSTTT    EQU   MSFHF
MSCSD    EQU   MSFHF
MSNMF    EQU   MSFHF
MSJNF    EQU   MSSSA
MSYOUT   EQU   MSNWP
MSNRP    EQU   MSSSA
MSSRDR   EQU   MSREOF
MSWRLOG  EQU   MSSSA
MSNUPSW  EQU   MSSSA
MSWRPEN  EQU   MSSSA
MSSSSIPL EQU   MSINLSW
MSSUM    EQU   MSECBFL
MSMCR    EQU   MSECBFL
MSYSOUT  EQU   MSECBFL
MSYSIN   EQU   MSECBFL
MSATTN   EQU   MSECBFL
MSWTO    EQU   MSECBFL
MSEXT    EQU   MSECBFL
MSCCS    EQU   MSPFG
MSBSP    EQU   MSPFG
MSSYT    EQU   MSPFG
MSSYN    EQU   MSPFG
MSICR    EQU   MSPFG
MSCMC    EQU   MSPFG
MSPNB    EQU   MSPFG
MSDATE   EQU   MSPFG
@NM00046 EQU   MSBTN
MSTN     EQU   MSBTN
@NM00045 EQU   MSBTN
@NM00044 EQU   MSBTN
MSSO     EQU   MSBTN
MSROLFLG EQU   MSBTN
MSCANFLG EQU   MSBTN
MSCONFLG EQU   MSBTN
MSPNIP   EQU   MSNTAL
MSQNIP   EQU   MSNTAL
MSCURE34 EQU   MSNTAL
@NM00043 EQU   MSNTAL
@NM00042 EQU   MSNTAL
@NM00041 EQU   MSNTAL
@NM00040 EQU   MSNTAL
MSNIP    EQU   MSNTAL
@NM00039 EQU   MS1BASEX+40
@NM00038 EQU   MS1BASEX+20
@NM00037 EQU   MS1BASEX
@NM00036 EQU   BASE+128
@NM00035 EQU   MSSTRTSW
MSSTRTP  EQU   MSSTRTSW
MSSTRTW  EQU   MSSTRTSW
@NM00034 EQU   MSWTRSW
MSWTRW   EQU   MSWTRSW
@NM00033 EQU   MSWLOGSW
MSWLOGW  EQU   MSWLOGSW
@NM00032 EQU   MSCLOSSW
MSCLOSW  EQU   MSCLOSSW
MSLOGLMT EQU   @NM00031+1
BAASCB   EQU   BASE+100
MSSMFPRM EQU   BASE+96
MSCOMMND EQU   BASE+92
BASP12   EQU   BASE+90
BASTCNT  EQU   BASE+88
BASESCT  EQU   BASE+86
BAJNCNT  EQU   BASE+84
BASUBECB EQU   BASE+80
BADACNT  EQU   BASE+74
BATACNT  EQU   BASE+72
BAJBNR   EQU   BASE+64
BASP11   EQU   BASE+62
BALCCNT  EQU   BASE+61
BADUMPID EQU   BASE+60
BABCMAX  EQU   BASE+58
BAMONTR2 EQU   BASE+57
@NM00030 EQU   BAMONITR
BAMACTVE EQU   BAMONITR
@NM00029 EQU   BAMONITR
@NM00028 EQU   BAMONITR
@NM00027 EQU   BAMONITR
@NM00026 EQU   BAMONITR
BASPACE  EQU   BAMONITR
BADSN    EQU   BAMONITR
BADSO    EQU   BASE+52
BALOGECB EQU   BASE+48
@NM00025 EQU   BASPBYTE
@NM00024 EQU   BASPBYTE
@NM00023 EQU   BASPBYTE
@NM00022 EQU   BASPBYTE
@NM00021 EQU   BASPBYTE
BAMASCH  EQU   BASPBYTE
BATRACE  EQU   BASPBYTE
BAMSSTAR EQU   BASPBYTE
@NM00020 EQU   MSLOGST
@NM00019 EQU   MSLOGST
BAMIPAR2 EQU   BASE+44
BAMINPAR EQU   BASE+42
BAPKES   EQU   BASE+40
BAICTR   EQU   BASE+38
@NM00018 EQU   BASE+37
BADSET   EQU   BARSW
BANOSET  EQU   BARSW
BAMIDNT  EQU   BARSW
BAHR     EQU   BARSW
BAVU     EQU   BARSW
BAINTSET EQU   BARSW
MSTODWTO EQU   BARSW
BAIN     EQU   BARSW
BACV     EQU   BASE+32
@NM00017 EQU   BALOG
@NM00016 EQU   BALOG
@NM00015 EQU   BALOG
@NM00014 EQU   BALOG
@NM00013 EQU   BALOG
@NM00012 EQU   BALOG
@NM00011 EQU   BALOG
BAPRC    EQU   BASE+20
BAQ      EQU   BASE+16
BAIPLCC  EQU   @NM00009+2
@NM00010 EQU   @NM00009
BAIPL    EQU   BASE+12
BALAD    EQU   BASE+8
BATRM    EQU   BASE+4
BACHN    EQU   BASE
@NM00008 EQU   TCBXTNT2+32
TCBRV181 EQU   TCBRV173
TCBRV180 EQU   TCBRV173
TCBRV179 EQU   TCBRV173
TCBRV178 EQU   TCBRV173
TCBRV177 EQU   TCBRV173
TCBRV176 EQU   TCBRV173
TCBRV175 EQU   TCBRV173
TCBRV174 EQU   TCBRV173
TCBRV172 EQU   TCBRV164
TCBRV171 EQU   TCBRV164
TCBRV170 EQU   TCBRV164
TCBRV169 EQU   TCBRV164
TCBRV168 EQU   TCBRV164
TCBRV167 EQU   TCBRV164
TCBRV166 EQU   TCBRV164
TCBRV165 EQU   TCBRV164
TCBRV163 EQU   TCBRV155
TCBRV162 EQU   TCBRV155
TCBRV161 EQU   TCBRV155
TCBRV160 EQU   TCBRV155
TCBRV159 EQU   TCBRV155
TCBRV158 EQU   TCBRV155
TCBRV157 EQU   TCBRV155
TCBRV156 EQU   TCBRV155
TCBRV154 EQU   TCBRV146
TCBRV153 EQU   TCBRV146
TCBRV152 EQU   TCBRV146
TCBRV151 EQU   TCBRV146
TCBRV150 EQU   TCBRV146
TCBRV149 EQU   TCBRV146
TCBRV148 EQU   TCBRV146
TCBRV147 EQU   TCBRV146
TCBRV145 EQU   TCBXTNT2+26
TCBRV144 EQU   TCBXTNT2+24
TCBRV143 EQU   TCBXTNT2+20
TCBRV142 EQU   TCBXTNT2+16
TCBRSV49 EQU   TCBXTNT2+12
TCBEVENT EQU   TCBXTNT2+8
TCBRCMP  EQU   TCBXTNT2+5
TCBRSVAB EQU   TCBXTNT2+4
TCBGTFA  EQU   TCBGTF+1
TCBRSV47 EQU   TCBTFLG
TCBRSV46 EQU   TCBTFLG
TCBRSV45 EQU   TCBTFLG
TCBRSV44 EQU   TCBTFLG
TCBRSV43 EQU   TCBTFLG
TCBDSPIT EQU   TCBTFLG
TCBERRTN EQU   TCBTFLG
TCBASYNC EQU   TCBTFLG
@NM00007 EQU   TCB+296
TCBSVCA2 EQU   TCB+292
TCBSWASA EQU   TCB+288
TCBDBTB  EQU   TCB+284
TCBRPT   EQU   TCB+280
TCBRV141 EQU   TCBRV133
TCBRV140 EQU   TCBRV133
TCBRV139 EQU   TCBRV133
TCBRV138 EQU   TCBRV133
TCBRV137 EQU   TCBRV133
TCBRV136 EQU   TCBRV133
TCBRV135 EQU   TCBRV133
TCBRV134 EQU   TCBRV133
TCBRV132 EQU   TCBRV124
TCBRV131 EQU   TCBRV124
TCBRV130 EQU   TCBRV124
TCBRV129 EQU   TCBRV124
TCBRV128 EQU   TCBRV124
TCBRV127 EQU   TCBRV124
TCBRV126 EQU   TCBRV124
TCBRV125 EQU   TCBRV124
TCBRV123 EQU   TCBFBYT2
TCBRV122 EQU   TCBFBYT2
TCBECBNV EQU   TCBFBYT2
TCBSSSYN EQU   TCBFBYT2
TCBFPRAP EQU   TCBFBYT2
TCBFDW   EQU   TCBFBYT2
TCBFMW   EQU   TCBFBYT2
TCBCNCB  EQU   TCBFBYT2
TCBLLH   EQU   TCBFBYT1
TCBRV113 EQU   TCBFBYT1
TCBEOT   EQU   TCBFBYT1
TCBRTM2  EQU   TCBFBYT1
TCBPGNLY EQU   TCBFBYT1
TCBNDIOS EQU   TCBFBYT1
TCBACTIV EQU   TCBFBYT1
TCBEOTFM EQU   TCBFBYT1
TCBAFFN  EQU   TCB+274
TCBCCPVI EQU   TCB+272
TCBUKYSP EQU   TCB+268
TCBMODE  EQU   TCBESTAE+3
TCBERTYP EQU   TCBESTAE+2
TCBRV314 EQU   TCBESTRM
TCBRV313 EQU   TCBESTRM
TCBRV312 EQU   TCBESTRM
TCBRV311 EQU   TCBESTRM
TCBRV310 EQU   TCBESTRM
TCBRV309 EQU   TCBESTRM
TCBRV308 EQU   TCBESTRM
TCBETERM EQU   TCBESTRM
TCBSCBKY EQU   TCBESTAE
TCBRTM12 EQU   TCB+260
TCBTCBID EQU   TCB+256
TCBRSV96 EQU   TCB+252
TCBSWA   EQU   TCB+248
TCBFOEA  EQU   TCBFOE+1
TCBRSV42 EQU   TCBFOE
TCBRV306 EQU   TCB+240
TCBRSV41 EQU   TCB+239
TCBRSVAA EQU   TCB+237
TCBABCUR EQU   TCB+236
TCBTMSAV EQU   TCB+232
TCBIOTIM EQU   TCB+228
TCBRTWA  EQU   TCB+224
TCBBACK  EQU   TCB+220
TCBTIRB  EQU   TCB+216
TCBAECB  EQU   TCB+212
TCBEXT2A EQU   TCBEXT2+1
TCBRSV39 EQU   TCBEXT2
TCBSTMCT EQU   TCB+207
TCBSYSCT EQU   TCB+206
TCBRSV37 EQU   TCB+205
TCBEXSVC EQU   TCBDAR
TCBDARMS EQU   TCBDAR
TCBDARWT EQU   TCBDAR
TCBDARO  EQU   TCBDAR
TCBDARMC EQU   TCBDARC
TCBDARD  EQU   TCBDAR
TCBDARS  EQU   TCBDAR
TCBDARP  EQU   TCBDAR
TCBGTOFM EQU   TCBFLGS7
TCBADMP  EQU   TCBFLGS7
TCBRSTSK EQU   TCBFLGS7
TCBSVCS  EQU   TCBFLGS7
TCBSTACK EQU   TCBFLGS7
TCBRSV34 EQU   TCBFLGS7
TCBRSV33 EQU   TCBFLGS7
TCBGPECB EQU   TCBFLGS7
TCBNTJS  EQU   TCBFLGS6
TCBAPG   EQU   TCBFLGS6
TCBMIGR  EQU   TCBFLGS6
TCBRV303 EQU   TCBFLGS6
TCBSPVLK EQU   TCBFLGS6
TCBCPU   EQU   TCBFLGS6
TCBPIE17 EQU   TCBFLGS6
TCBRV    EQU   TCBFLGS6
TCBRSV79 EQU   TCBNDSP5
TCBRSV78 EQU   TCBNDSP5
TCBRSV77 EQU   TCBNDSP5
TCBRSV76 EQU   TCBNDSP5
TCBRSV75 EQU   TCBNDSP5
TCBRSV74 EQU   TCBNDSP5
TCBRSV95 EQU   TCBNDSP5
TCBRSV94 EQU   TCBNDSP5
TCBRSV93 EQU   TCBNDSP4
TCBRSV92 EQU   TCBNDSP4
TCBRSV91 EQU   TCBNDSP4
TCBRSV90 EQU   TCBNDSP4
TCBRSV89 EQU   TCBNDSP4
TCBRSV88 EQU   TCBNDSP4
TCBRSV87 EQU   TCBNDSP4
TCBRSV86 EQU   TCBNDSP4
TCBEXT1A EQU   TCBEXT1+1
TCBRSV32 EQU   TCBEXT1
TCBEXCPD EQU   TCB+192
TCBIOBRC EQU   TCB+188
TCBDDWTC EQU   TCB+186
TCBDDEXC EQU   TCB+184
TCBJSCBB EQU   TCBJSCB+1
@NM00006 EQU   TCBRECDE
TCBREC   EQU   TCBRECDE
TCBMDIDS EQU   TCB+176
TCBNDINT EQU   TCBNDSP3
TCBRSV27 EQU   TCBNDSP3
TCBRSV26 EQU   TCBNDSP3
TCBRSV25 EQU   TCBNDSP3
TCBRSV24 EQU   TCBNDSP3
TCBSRBND EQU   TCBNDSP3
TCBRV302 EQU   TCBNDSP3
TCBLJSND EQU   TCBNDSP3
TCBABE   EQU   TCBNDSP2
TCBDSS   EQU   TCBNDSP2
TCBOWAIT EQU   TCBNDSP2
TCBIWAIT EQU   TCBNDSP2
TCBNDTS  EQU   TCBNDSP2
TCBNDSVC EQU   TCBNDSP2
TCBSTPP  EQU   TCBNDSP2
TCBABD   EQU   TCBNDSP2
TCBRSV22 EQU   TCBNDSP1
TCBPIEND EQU   TCBNDSP1
TCBTPSP  EQU   TCBNDSP1
TCBDDRND EQU   TCBNDSP1
TCBRSPND EQU   TCBNDSP1
TCBRSTND EQU   TCBNDSP1
TCBDARPN EQU   TCBNDSP1
TCBDARTN EQU   TCBNDSP1
TCBNDSP0 EQU   TCBNDSP
TCBUSER  EQU   TCB+168
TCBTCTB  EQU   TCBTCT+1
TCBRSV9C EQU   TCBTCTGF
TCBRSV9B EQU   TCBTCTGF
TCBRSV9A EQU   TCBTCTGF
TCBRSV99 EQU   TCBTCTGF
TCBRSV98 EQU   TCBTCTGF
TCBRSV97 EQU   TCBTCTGF
TCBRSV20 EQU   TCBTCTGF
TCBSMFGF EQU   TCBTCTGF
TCBSTABB EQU   TCBSTAB+1
TCBSTCUR EQU   TCBNSTAE
TCBRV301 EQU   TCBNSTAE
TCBSYNCH EQU   TCBNSTAE
TCBHALT  EQU   TCBNSTAE
TCBPPSUP EQU   TCBNSTAE
TCB33E   EQU   TCBNSTAE
TCBQUIES EQU   TCBNSTAE
TCBSTABE EQU   TCBNSTAE
TCBAQE   EQU   TCB+156
TCBPQE   EQU   TCB+152
TCBTSDP  EQU   TCB+151
TCBTSLP  EQU   TCB+150
TCBSTPCT EQU   TCB+149
TCBCPUBN EQU   TCBTSFLG
TCBDYDSP EQU   TCBTSFLG
TCBRSV18 EQU   TCBTSFLG
TCBRSV17 EQU   TCBTSFLG
TCBTIOTG EQU   TCBTSFLG
TCBATT   EQU   TCBTSFLG
TCBSTPPR EQU   TCBTSFLG
TCBRV300 EQU   TCBTSTSK
TCBECB   EQU   TCB+144
TCBIQE   EQU   TCB+140
TCBLTC   EQU   TCB+136
TCBOTC   EQU   TCB+132
TCBNTC   EQU   TCB+128
TCBJSTCA EQU   TCBJSTCB+1
TCBRSV16 EQU   TCBJSTCB
TCBTQET  EQU   TCBTME
TCBTCB   EQU   TCB+116
TCBFSAB  EQU   TCBFSA+1
TCBQEL   EQU   TCBFSA
TCBGRS15 EQU   TCBGRS+60
TCBGRS14 EQU   TCBGRS+56
TCBGRS13 EQU   TCBGRS+52
TCBGRS12 EQU   TCBGRS+48
TCBGRS11 EQU   TCBGRS+44
TCBGRS10 EQU   TCBGRS+40
TCBGRS9  EQU   TCBGRS+36
TCBGRS8  EQU   TCBGRS+32
TCBGRS7  EQU   TCBGRS+28
TCBGRS6  EQU   TCBGRS+24
TCBGRS5  EQU   TCBGRS+20
TCBGRS4  EQU   TCBGRS+16
TCBGRS3  EQU   TCBGRS+12
TCBGRS2  EQU   TCBGRS+8
TCBGRS1  EQU   TCBGRS+4
TCBGRS0  EQU   TCBGRS
TCBJPQB  EQU   TCBJPQ+1
TCBRSV15 EQU   TCBPURGE
TCBRSV14 EQU   TCBPURGE
TCBRSV13 EQU   TCBPURGE
TCBRSV12 EQU   TCBPURGE
TCBRSV11 EQU   TCBPURGE
TCBRSV10 EQU   TCBPURGE
TCBRSV09 EQU   TCBPURGE
TCBJPQF  EQU   TCBPURGE
TCBJLB   EQU   TCB+40
TCBLLS   EQU   TCB+36
TCBDSP   EQU   TCB+35
TCBLMP   EQU   TCB+34
TCBPNDSP EQU   TCBFLGS5
TCBFCD1  EQU   TCBFLGS5
TCBSTP   EQU   TCBFLGS5
TCBSYS   EQU   TCBFLGS5
TCBANDSP EQU   TCBFLGS5
TCBPAGE  EQU   TCBFLGS5
TCBUXNDF EQU   TCBABWF
TCBFC    EQU   TCBFLGS5
TCBONDSP EQU   TCBFLGS4
TCBMPCND EQU   TCBFLGS4
TCBMPCVQ EQU   TCBFLGS4
TCBUXNDV EQU   TCBFLGS4
TCBHNDSP EQU   TCBFLGS4
TCBRQENA EQU   TCBFLGS4
TCBSER   EQU   TCBFLGS4
TCBNDUMP EQU   TCBFLGS4
TCBDWSTA EQU   TCBFLGS3
TCBRSV08 EQU   TCBFLGS3
TCBRSV07 EQU   TCBFLGS3
TCBRSV06 EQU   TCBFLGS3
TCBABGM  EQU   TCBFLGS3
TCBABTRM EQU   TCBFLGS3
TCBADINP EQU   TCBFLGS3
TCBFSM   EQU   TCBFLGS3
TCBFTS   EQU   TCBFLGS2
TCBFETXR EQU   TCBFLGS2
TCBFDSOP EQU   TCBFLGS2
TCBFJMC  EQU   TCBFLGS2
TCBFSMC  EQU   TCBFLGS2
TCBFABOP EQU   TCBFLGS2
TCBFSTI  EQU   TCBFLGS2
TCBFOINP EQU   TCBFLGS2
TCBFX    EQU   TCBFLGS1
TCBFS    EQU   TCBFLGS1
TCBFT    EQU   TCBFLGS1
TCBPDUMP EQU   TCBFLGS1
TCBNONPR EQU   TCBFLGS1
TCBFERA  EQU   TCBFLGS1
TCBFE    EQU   TCBFLGS1
TCBFA    EQU   TCBFLGS1
TCBZERO  EQU   TCBPKF
TCBFLAG  EQU   TCBPKF
TCBMSSB  EQU   TCBMSS+1
TCBRSV03 EQU   TCBMSS
TCBTRNB  EQU   TCBTRN+1
TCBRSV02 EQU   TCBABF
TCBOLTEP EQU   TCBABF
TCBTCP   EQU   TCBABF
TCBTCPP  EQU   TCBABF
TCBRSV01 EQU   TCBABF
TCBGRPH  EQU   TCBABF
TCBNOCHK EQU   TCBABF
TCBMOD91 EQU   TCBABF
TCBCMPC  EQU   TCBCMP+1
TCBRV318 EQU   TCBCMSG
TCBRV317 EQU   TCBCIND
TCBRV316 EQU   TCBCWTO
TCBCASID EQU   TCBCDBL
TCBNOCC  EQU   TCBSTCC
TCBDMPO  EQU   TCBCPP
TCBCSTEP EQU   TCBCMPF
TCBCREQ  EQU   TCBCMPF
TCBTIO   EQU   TCB+12
TCBDEB   EQU   TCB+8
TCBPIEA  EQU   TCBPIE+1
TCBPM    EQU   TCBPMASK
@NM00005 EQU   TCBPMASK
TCBRBP   EQU   TCB
TCBFRS6  EQU   TCBFRS+24
TCBFRS4  EQU   TCBFRS+16
TCBFRS2  EQU   TCBFRS+8
TCBFRS0  EQU   TCBFRS
CVTLEVL  EQU   CVTRELNO+2
CVTNUMB  EQU   CVTRELNO
CVTMDL   EQU   CVTFIX+250
@NM00004 EQU   CVTFIX+248
@NM00003 EQU   CVTFIX
CVTRV482 EQU   CVTXTNT2+128
CVTRV481 EQU   CVTXTNT2+124
CVTRV480 EQU   CVTXTNT2+120
CVTRV479 EQU   CVTXTNT2+118
CVTRV478 EQU   CVTXTNT2+117
CVTRV477 EQU   CVTXTNT2+116
CVTRV476 EQU   CVTXTNT2+115
CVTRV475 EQU   CVTXTNT2+114
CVTRV474 EQU   CVTRV466
CVTRV473 EQU   CVTRV466
CVTRV472 EQU   CVTRV466
CVTRV471 EQU   CVTRV466
CVTRV470 EQU   CVTRV466
CVTRV469 EQU   CVTRV466
CVTRV468 EQU   CVTRV466
CVTRV467 EQU   CVTRV466
CVTRV465 EQU   CVTRV457
CVTRV464 EQU   CVTRV457
CVTRV463 EQU   CVTRV457
CVTRV462 EQU   CVTRV457
CVTRV461 EQU   CVTRV457
CVTRV460 EQU   CVTRV457
CVTRV459 EQU   CVTRV457
CVTRV458 EQU   CVTRV457
CVTRV456 EQU   CVTXTNT2+108
CVTRV455 EQU   CVTXTNT2+104
CVTRV454 EQU   CVTXTNT2+100
CVTRV453 EQU   CVTXTNT2+96
CVTRV452 EQU   CVTXTNT2+94
CVTRV451 EQU   CVTXTNT2+92
CVTRV450 EQU   CVTXTNT2+90
CVTRV449 EQU   CVTXTNT2+88
CVTRV448 EQU   CVTXTNT2+87
CVTRV447 EQU   CVTXTNT2+86
CVTRV446 EQU   CVTRV438
CVTRV445 EQU   CVTRV438
CVTRV444 EQU   CVTRV438
CVTRV443 EQU   CVTRV438
CVTRV442 EQU   CVTRV438
CVTRV441 EQU   CVTRV438
CVTRV440 EQU   CVTRV438
CVTRV439 EQU   CVTRV438
CVTRV437 EQU   CVTRV429
CVTRV436 EQU   CVTRV429
CVTRV435 EQU   CVTRV429
CVTRV434 EQU   CVTRV429
CVTRV433 EQU   CVTRV429
CVTRV432 EQU   CVTRV429
CVTRV431 EQU   CVTRV429
CVTRV430 EQU   CVTRV429
CVTRV428 EQU   CVTXTNT2+80
CVTRV427 EQU   CVTXTNT2+76
CVTRV426 EQU   CVTXTNT2+72
CVTRV425 EQU   CVTXTNT2+68
CVTATACT EQU   CVTATCVT
CVTRV423 EQU   CVTXTNT2+62
CVTRV422 EQU   CVTXTNT2+60
CVTRV421 EQU   CVTXTNT2+58
CVTRV420 EQU   CVTXTNT2+56
CVTRV419 EQU   CVTXTNT2+55
CVTRV418 EQU   CVTXTNT2+54
CVTRV417 EQU   CVTRV409
CVTRV416 EQU   CVTRV409
CVTRV415 EQU   CVTRV409
CVTRV414 EQU   CVTRV409
CVTRV413 EQU   CVTRV409
CVTRV412 EQU   CVTRV409
CVTRV411 EQU   CVTRV409
CVTRV410 EQU   CVTRV409
CVTRV408 EQU   CVTRV400
CVTRV407 EQU   CVTRV400
CVTRV406 EQU   CVTRV400
CVTRV405 EQU   CVTRV400
CVTRV404 EQU   CVTRV400
CVTRV403 EQU   CVTRV400
CVTRV402 EQU   CVTRV400
CVTRV401 EQU   CVTRV400
CVTICB   EQU   CVTXTNT2+48
CVTSKTA  EQU   CVTXTNT2+44
CVTRSV99 EQU   CVTXTNT2+40
CVTRSV98 EQU   CVTXTNT2+36
CVTRSV97 EQU   CVTXTNT2+34
CVTRSV96 EQU   CVTXTNT2+32
CVTOLTEP EQU   CVTXTNT2+28
CVTQIDA  EQU   CVTQID+1
CVTRSV95 EQU   CVTQID
CVTRSV94 EQU   CVTXTNT2+20
CVTRSV93 EQU   CVTXTNT2+16
CVTRSV92 EQU   CVTXTNT2+12
CVTDEBVR EQU   CVTXTNT2+8
CVTRSV91 EQU   CVTXTNT2+6
CVTRSV9H EQU   CVTFLGBT
CVTRSV9G EQU   CVTFLGBT
CVTRSV9F EQU   CVTFLGBT
CVTRSV9E EQU   CVTFLGBT
CVTRSV9D EQU   CVTFLGBT
CVTRSV9C EQU   CVTFLGBT
CVTVME   EQU   CVTFLGBT
CVTNPE   EQU   CVTFLGBT
CVTNUCLS EQU   CVTXTNT2+4
CVTDSSVA EQU   CVTDSSV+1
CVTRSV89 EQU   CVTDSSV
CVTRSV88 EQU   CVTXTNT1+8
CVTRSV87 EQU   CVTXTNT1+4
CVTFACHN EQU   CVTXTNT1
CVTRV488 EQU   CVTMAP+412
CVTRV487 EQU   CVTMAP+408
CVTRV486 EQU   CVTMAP+404
CVTRV485 EQU   CVTMAP+400
CVTACTAP EQU   CVTMAP+396
CVTAUTH  EQU   CVTMAP+392
CVTATMCA EQU   CVTATMCT+1
CVTATMST EQU   CVTATMCT
CVTRSV61 EQU   CVTMAP+384
CVTVOLT1 EQU   CVTVOLM1+1
CVTVOLI1 EQU   CVTVOLF1
CVTSTOA  EQU   CVTMAP+376
CVTRSV58 EQU   CVTMAP+374
CVTRSV57 EQU   CVTMAP+372
CVTDDCE  EQU   CVTMAP+368
CVTPNWFR EQU   CVTMAP+364
CVTSMF   EQU   CVTMAP+360
CVTSULK  EQU   CVTMAP+358
CVTSLKO  EQU   CVTSYSK
CVTSLKP  EQU   CVTSYSK
CVTSLKQ  EQU   CVTSYSK
CVTSLKR  EQU   CVTSYSK
CVTRSV56 EQU   CVTSYSK
CVTRSV55 EQU   CVTSYSK
CVTRSV54 EQU   CVTSYSK
CVTRSV53 EQU   CVTSYSK
CVTRSV52 EQU   CVTA1F1
CVTRSV51 EQU   CVTA1F1
CVTRSV50 EQU   CVTA1F1
CVTRSV49 EQU   CVTA1F1
CVTRSV48 EQU   CVTA1F1
CVTRSV47 EQU   CVTA1F1
CVTSRSW  EQU   CVTA1F1
CVTPFSW  EQU   CVTA1F1
CVTPCVT  EQU   CVTMAP+352
CVTRSV46 EQU   CVTMAP+344
CVTRSV45 EQU   CVTMAP+340
CVTRSV44 EQU   CVTMAP+338
CVTRSV43 EQU   CVTMAP+336
CVTHJESA EQU   CVTHJES+1
CVTRSV42 EQU   CVTHJES
CVTEXT2A EQU   CVTEXT2+1
CVTRSV41 EQU   CVTEXT2
CVTAPFA  EQU   CVTAPF+1
CVTRSV40 EQU   CVTAPF
CVTRV518 EQU   CVTINTLA
CVTRV517 EQU   CVTERPV
CVTEORM  EQU   CVTMAP+312
CVTMCHPR EQU   CVTMAP+308
CVTTZ    EQU   CVTMAP+304
CVTJEPS  EQU   CVTMAP+300
CVTMODE  EQU   CVTMAP+292
CVTPTRV  EQU   CVTMAP+288
CVTREAL  EQU   CVTMAP+284
CVTRSV39 EQU   CVTMAP+280
CVTRSV38 EQU   CVTMAP+276
CVTDMSRA EQU   CVTDMSR+1
CVTRV634 EQU   CVTDMSRF
CVTRV633 EQU   CVTDMSRF
CVTRV632 EQU   CVTDMSRF
CVTRV631 EQU   CVTDMSRF
CVTRV630 EQU   CVTDMSRF
CVTRV629 EQU   CVTDMSRF
CVTUDUMP EQU   CVTDMSRF
CVTSDUMP EQU   CVTDMSRF
CVTQMSGA EQU   CVTQMSG+1
CVTRSV36 EQU   CVTQMSG
CVTAMFF  EQU   CVTMAP+264
CVTPURGA EQU   CVTPURG+1
CVTRSV35 EQU   CVTPURG
CVTCBSP  EQU   CVTMAP+256
CVTATERA EQU   CVTATER+1
CVTSYST  EQU   CVTATER
CVTVOLT2 EQU   CVTTAT
CVTVOLI2 EQU   CVTVOLF2
CVTAQAVB EQU   CVTAQAVT+1
CVTRSV34 EQU   CVTTCMFG
CVTRSV33 EQU   CVTTCMFG
CVTRSV32 EQU   CVTTCMFG
CVTRSV31 EQU   CVTTCMFG
CVTRSV30 EQU   CVTTCMFG
CVTRSV29 EQU   CVTTCMFG
CVTRSV28 EQU   CVTTCMFG
CVTTCRDY EQU   CVTTCMFG
CVTGTFA  EQU   CVTGTF+1
CVTRSV27 EQU   CVTGTFST
CVTRNIO  EQU   CVTGTFST
CVTUSR   EQU   CVTGTFST
CVTRV318 EQU   CVTFORM
CVTRV317 EQU   CVTTMODE
CVTRV316 EQU   CVTSTATE
CVTRV315 EQU   CVTGTFS
CVTGTFAV EQU   CVTGTFS
CVT0SCR1 EQU   CVTMAP+232
CVTRV515 EQU   CVTMAP+228
CVTRMS   EQU   CVTMAP+224
CVTPATCH EQU   CVTMAP+220
CVTTSCE  EQU   CVTMAP+216
CVTLNKSC EQU   CVTMAP+214
CVTQABST EQU   CVTMAP+212
CVTMDLDS EQU   CVTMAP+208
CVTUSER  EQU   CVTMAP+204
CVTABEND EQU   CVTMAP+200
CVTSMCA  EQU   CVTMAP+196
CVTRSV18 EQU   CVTMAP+192
CVTQLPAQ EQU   CVTMAP+188
CVTQCDSR EQU   CVTMAP+184
CVTRSV17 EQU   CVTOPTB
CVTRSV16 EQU   CVTOPTB
CVTFP    EQU   CVTOPTB
CVTAPTHR EQU   CVTOPTB
CVTNLOG  EQU   CVTOPTB
CVTTOD   EQU   CVTOPTB
CVTCTIMS EQU   CVTOPTB
CVTPROT  EQU   CVTOPTB
CVTXPFP  EQU   CVTOPTA
CVTASCII EQU   CVTOPTA
CVTRSV13 EQU   CVTOPTA
CVTRSV12 EQU   CVTOPTA
CVTNIP   EQU   CVTOPTA
CVTDDR   EQU   CVTOPTA
CVTAPR   EQU   CVTOPTA
CVTCCH   EQU   CVTOPTA
CVTSNCTR EQU   CVTMAP+180
CVTQMWR  EQU   CVTMAP+176
CVTQOCR  EQU   CVTMAP+172
CVT1EF00 EQU   CVTMAP+168
CVTMZ00  EQU   CVTMAP+164
CVTHEAD  EQU   CVTMAP+160
CVTRSV11 EQU   CVTMAP+156
CVT0PT01 EQU   CVTMAP+152
CVTRV516 EQU   CVTIERLC
CVTILCH  EQU   CVTMAP+140
CVT0DS   EQU   CVTMAP+136
CVTFBOSV EQU   CVTMAP+132
CVTNUCB  EQU   CVTMAP+128
CVTIXAVL EQU   CVTMAP+124
CVTIOQET EQU   CVTMAP+120
CVTDCBA  EQU   CVTMAP+117
CVTMVS2  EQU   CVTDCB
CVT6DAT  EQU   CVTDCB
CVT4MPS  EQU   CVTDCB
CVTRSV09 EQU   CVTDCB
CVT4MS1  EQU   CVTDCB
CVT2SPS  EQU   CVTDCB
CVT1SSS  EQU   CVTDCB
CVTRSV08 EQU   CVTDCB
CVTSTB   EQU   CVTMAP+112
CVTQTD00 EQU   CVTMAP+108
CVTQTE00 EQU   CVTMAP+104
CVTSJQ   EQU   CVTMAP+96
CVTPBLDL EQU   CVTMAP+92
CVTTPC   EQU   CVTMAP+88
CVTSVDCB EQU   CVTMAP+84
CVTBRET  EQU   CVTMAP+82
CVTEXIT  EQU   CVTMAP+80
CVT0FN00 EQU   CVTMAP+76
CVTDARA  EQU   CVTDAR+1
CVTRSV07 EQU   CVTFLGS1
CVTRSV06 EQU   CVTFLGS1
CVTRSV05 EQU   CVTFLGS1
CVTRSV04 EQU   CVTFLGS1
CVTRSV03 EQU   CVTFLGS1
CVTRSV02 EQU   CVTFLGS1
CVTRSV01 EQU   CVTFLGS1
CVTDMPLK EQU   CVTFLGS1
CVTXITP  EQU   CVTMAP+68
CVTZDTAB EQU   CVTMAP+64
CVTMSLT  EQU   CVTMAP+60
CVTDATE  EQU   CVTMAP+56
CVTBTERM EQU   CVTMAP+52
CVTSYSAD EQU   CVTMAP+48
CVTXTLER EQU   CVTMAP+44
CVTILK2  EQU   CVTMAP+40
CVTILK1  EQU   CVTMAP+36
CVTPRLTV EQU   CVTMAP+32
CVTPCNVT EQU   CVTMAP+28
CVT0VL00 EQU   CVTMAP+24
CVTXAPG  EQU   CVTMAP+20
CVTBUF   EQU   CVTMAP+16
CVTJOB   EQU   CVTMAP+12
CVTLINK  EQU   CVTMAP+8
CVT0EF00 EQU   CVTMAP+4
CVT      EQU   CVTMAP
@NM00002 EQU   SSOBPTR+1
@NM00001 EQU   SSOBFLG
SSOBFBIT EQU   SSOBFLG
*                                      END UNREFERENCED COMPONENTS
@RC00239 EQU   @RC00234
@RC00316 EQU   @RC00315
@RC00406 EQU   @RC00405
@RC00434 EQU   @RC00431
@PB00022 EQU   @PB00023
@RF00742 EQU   LOGSTART
@PB00024 EQU   @PB00025
@RC00243 EQU   @RC00239
@RC00407 EQU   @RC00406
@PB00021 EQU   @PB00022
@RC00247 EQU   @RC00243
@RF00410 EQU   @RC00407
@PB00020 EQU   @PB00021
@PB00019 EQU   @PB00020
@PB00018 EQU   @PB00019
@PB00017 EQU   @PB00018
@PB00016 EQU   @PB00017
@PB00015 EQU   @PB00016
@PB00014 EQU   @PB00015
@PB00013 EQU   @PB00014
@PB00012 EQU   @PB00013
@PB00011 EQU   @PB00012
@PB00010 EQU   @PB00011
@PB00009 EQU   @PB00010
@PB00008 EQU   @PB00009
@PB00007 EQU   @PB00008
@PB00006 EQU   @PB00007
@PB00005 EQU   @PB00006
@PB00004 EQU   @PB00005
@PB00003 EQU   @PB00004
@PB00002 EQU   @PB00003
@ENDDATA EQU   *
         END   IEEMB803,(C'PLS2039',0701,76167)
