         TITLE 'UNLOAD PRE-PROCESSOR-IEEMB813                          *
                        '
IEEMB813 CSECT ,                                                   0001
@MAINENT BALR  @15,0                                               0001
         USING *,@15                                               0001
         B     @PROLOG                                             0001
         DC    AL1(16)                                             0001
         DC    C'IEEMB813  74.018'                                 0001
         DROP  @15
@PROLOG  BALR  @12,0                                               0001
@PSTART  DS    0H                                                  0001
         USING @PSTART,@12                                         0001
         LR    @10,@01                                             0001
         L     @00,@SIZDATD                                        0001
         GETMAIN R,LV=(0)
         LR    @11,@01                                             0001
         USING @DATD,@11                                           0001
         LR    @01,@10                                             0001
         ST    @13,@SA00001+4                                      0001
         LR    @13,@11                                             0001
         MVC   @PC00001(4),0(@01)                                  0001
         EJECT
         EJECT
USAVE     EQU   144
         EJECT
*   ONE4SV(1) = R14;                   /* FIRST RTN, SAVE RET ADDR   */
         ST    R14,ONE4SV                                          0048
*                                      /* IN FIRST LEVEL R14 SAVEAREA*/
*   CSCBPTR = R1;                      /* SAVE CSCB PTR              */
         ST    R1,CSCBPTR                                          0049
*   CALL ISSUESTE;                     /* GO SET UP STAE ENVIR.      */
         BAL   @14,ISSUESTE                                        0050
*   IF R15 ^= 0                        /* IF STAE WAS NOT CREATED    */
*       THEN                                                       0051
         LTR   R15,R15                                             0051
         BZ    @RF00051                                            0051
*             DO;                                                  0052
*                  CALL CLEANUPC;      /* FREE CSCB                  */
         BAL   @14,CLEANUPC                                        0053
*                  R14 = ONE4SV(1);    /* RESTORE FIRST LEVEL R14    */
         L     R14,ONE4SV                                          0054
*                  RETURN;             /* FORGET COMMAND             */
@EL00001 L     @13,4(,@13)                                         0055
@EF00001 L     @00,@SIZDATD                                        0055
         LR    @01,@11                                             0055
         FREEMAIN R,LV=(0),A=(1)
@ER00001 BR    @14                                                 0055
*             END;                                                 0056
*   ELSE;                                                          0057
@RF00051 DS    0H                                                  0058
*   GEN (ENQ MF=(E,IEFSD21A));         /* VARY RESOURCE ENQ  @YM5443P*/
         ENQ MF=(E,IEFSD21A)
*   GEN (ENQ MF=(E,IEFSD21B));         /* ENQ TO PROTECT VS VARY OR  */
         ENQ MF=(E,IEFSD21B)
*                                      /*OR UNLOAD, COM TASK OR ALLOC*/
*   CALL SYNTAX;                       /* CALL THE VALIDITY CHECK RTN*/
         BAL   @14,SYNTAX                                          0060
*   IF R15 ^= 0                        /* IF THE SYNTAX ETC.         */
*       THEN                           /* WAS IN ERROR THEN          */
         LTR   R15,R15                                             0061
         BZ    @RF00061                                            0061
*             DO;                                                  0062
*                  R14 = ONE4SV(1);    /* RESTORE FIRST LEVEL R14    */
         L     R14,ONE4SV                                          0063
*                  RETURN;             /* ALL WAS DONE, RET TO CALLER*/
         B     @EL00001                                            0064
*             END;                                                 0065
*   ELSE;                                                          0066
@RF00061 DS    0H                                                  0067
*   IF UCBALOC = '1'B                  /* IT IS ONLINE, IS IT ALLOC? */
*       THEN                           /* YEP, IT IS ALLOCATED TOO   */
         L     @10,UCBPTR                                          0067
         TM    UCBALOC(@10),B'00001000'                            0067
         BNO   @RF00067                                            0067
*             DO;                                                  0068
*                  UCBUNLD = '1'B;                                 0069
         L     @09,UCBUNLD-3(,@10)                                 0069
@GL00001 LR    @08,@09                                             0069
         O     @08,@CF01440                                        0069
         CS    @09,@08,UCBUNLD-3(@10)                              0069
         BNE   @GL00001                                            0069
*                  MSSUM = '1'B;                                   0070
         L     @08,CVTPTR                                          0070
         L     @08,CVTMSER(,@08)                                   0070
         LA    @08,MS1BASEX(,@08)                                  0070
         L     @10,MSSUM-3(,@08)                                   0070
@GL00002 LR    @09,@10                                             0070
         O     @09,@CF01443                                        0070
         CS    @10,@09,MSSUM-3(@08)                                0070
         BNE   @GL00002                                            0070
*                                      /* SET THE UNLOAD-PENDING BIT */
*                                      /* SET ON SEARCH FALG TOO     */
*                  CALL CLEANUPC;      /* FREE CSCB AND DEQ          */
         BAL   @14,CLEANUPC                                        0071
*                  R14 = ONE4SV(1);    /* RESTORE FIRST LEVEL R14    */
         L     R14,ONE4SV                                          0072
*                  RETURN;             /* FINISHED                   */
         B     @EL00001                                            0073
*             END;                                                 0074
*   ELSE                                                           0075
*       DO;                                                        0075
@RF00067 DS    0H                                                  0076
*             CALL SETUPU;             /*SET UP UNLOAD PARAM LIST    */
         BAL   @14,SETUPU                                          0076
*             RESPECIFY (R3,R13)RESTRICTED;                        0077
*             R3 = R1;                                             0078
         LR    R3,R1                                               0078
*             GEN(LOAD EP=IEFAB49C);   /*LOAD TO UNLOAD MOD          */
         LOAD EP=IEFAB49C
*             R15 = R0;                /* ADDR OF IEFAB49C INTO R15  */
         LR    R15,R0                                              0080
*             R1 = R3;                                             0081
         LR    R1,R3                                               0081
*             GEN( BALR R14,R15);      /* GO TO THE UNLOAD PROCESSOR */
          BALR R14,R15
*             RESPECIFY (R15)RESTRICTED;                           0083
*             GEN(LM    R0,R14,USAVE(R1)); /*RESTORE REGS            */
         LM    R0,R14,USAVE(R1)
*             RESPECIFY (R13)UNRESTRICTED;                         0085
*             RESPECIFY (R4)RESTRICTED;                            0086
*             R3 = R1;                                             0087
         LR    R3,R1                                               0087
*             R4 = R15;                /* SAVE UNLOAD'S RET CODE     */
         LR    R4,R15                                              0088
*             GEN(DELETE EP=IEFAB49C);                             0089
         DELETE EP=IEFAB49C
*             R1 = R3;                                             0090
         LR    R1,R3                                               0090
*             RESPECIFY (R3)UNRESTRICTED;                          0091
*             IF R4 = 0                /*IF DEV WAS UNLOADED         */
*                  THEN                /*THEN ISSUE MSG              */
         LTR   R4,R4                                               0092
         BNZ   @RF00092                                            0092
*                       CALL UMSG;     /* UNLOAD MESSAGE             */
         BAL   @14,UMSG                                            0093
*             ELSE;                                                0094
@RF00092 DS    0H                                                  0095
*             CALL CLEANUPU;           /* FREE PARAM CORE            */
         BAL   @14,CLEANUPU                                        0095
*             CALL CLEANUPC;           /* FREE CSCB AND DEQ          */
         BAL   @14,CLEANUPC                                        0096
*             RESPECIFY (R4)UNRESTRICTED;                          0097
*             R14 = ONE4SV(1);         /* RESTORE FIRST LEVEL R14    */
         L     R14,ONE4SV                                          0098
*             RETURN;                                              0099
         B     @EL00001                                            0099
*       END;                                                       0100
*/*                                                                  */
*/*                                                                  */
*   GEN(EJECT);                                                    0101
         EJECT
*   GENERATE;                                                      0102
IEFSD21A ENQ (IEFSQCBS,IEFVQCBS,E,7,SYSTEM),MF=L             @YM05443P
IEFSD21B ENQ (IEFSQCBS,IEFDEVS,E,8,SYSTEM),MF=L
IEFSQCBS DC   C'SYSIEFSD'
IEFDEVS  DC   C'CHNGDEVS'                                     @YM01063
IEFVQCBS DC   C'VARYDEV'                                     @YM05443P
*   GEN (EJECT);                                                   0103
         EJECT
*SYNTAX:                                                           0104
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);                               0104
         B     @PB00002                                            0104
SYNTAX   DS    0H                                                  0105
*   GENERATE;                                                      0105
ESAVE    EQU   144
*/********************************************************************/
*/* THIS IS THE SUBRTN THAT VALIDATES THE SYNTAX OF THE UNLOAD CMD   */
*/* AND THE CORRECTNESS OF THE UNIT SPECIFIED                        */
*/*     1. IF UNIT IS NOT THREE(3) CHARACTERS                        */
*/*           A. CALL SUBRTN TO ISSUE 'DELIM ERR' MSG                */
*/*           B. CALL SUBRTN TO FREE CSCB                            */
*/*           C. RETURN TO MAIN RTN                                  */
*/*     2. CALL SUBRTN TO GET UCB PTR                                */
*/*     3. IF THERE IS NOT UCB:                                      */
*/*           A. CALL SUBRTN TO ISSUE 'UNIT REF. INV.' MSG           */
*/*           B. CALL SUBRTN TO FREE CSCB                            */
*/*           C. RETURN TO MAIN RTN                                  */
*/*     4. IF DEV IS NOT MARKED TAPE OF DA IN UCB                    */
*/*           A. CALL SUBRTN TO ISSUE 'UNIT REF INV' MSG             */
*/*           B. CALL SUBRTN TO FREE CSCB                            */
*/*           C. RETURN TO MAIN RTN                                  */
*/*     5. IF DEV IS MARKED 'SYSTEM RES.' OR 'PERMANENTRLY RES'      */
*/*        IN THE UCB                                                */
*/*           A. CALL SUBRTN TO ISSUE 'UNIT REF INV' MSG             */
*/*           B. CALL SUBRTN TO FREE CSCB                            */
*/*           C. RETURN TO MAIN RTN                                  */
*/*     6. IF DEV IS MARKED 'OFFLINE' IN UCB                         */
*/*           A. CALL SUBRTN TO ISSUE 'UNIT REF INV' MSG             */
*/*           B. CALL SUBRTN TO FREE CSCB                            */
*/*           C. RETURN TO MAIN RTN                                  */
*/*     7. IF DEV IS MARKED 'NOT READY' IN UCB                       */
*/*           A. CALL SUBRTN TO ISSUE 'UNIT NOT AVAILABLE' MSG       */
*/*           B. CALL SUBRTN TO SET UP PARAMS FOR UNLOAD RTN SO      */
*/*              THAT UCB MAY BE CLEANED UP. (IEFAB49C)              */
*/*           C. LOAD TO IEFAB49C                                    */
*/*           D. DELETE IEFAB49C                                     */
*/*           E. CALL SUBRTN TO CLEAN UP UNLOAD RTN'S PARAM CORE     */
*/*           F. CALL SUBRTN TO FREE CSCB                            */
*/*           G. RETURN TO MAIN RTN                                  */
*/*     8. IF NONE OF THE ABOVE IS TRUE, THAN THIS SUBRTN RETURN     */
*/*        TO THE CALLER (THE MAIN RTN)                              */
*/********************************************************************/
*    GEN(EJECT);                                                   0106
         EJECT
*/*                                                                  */
*   ONE4SV(2) = R14;                   /*SAVE 2ND LEVEL R14          */
         ST    R14,ONE4SV+4                                        0107
*   RESPECIFY (R15)RESTRICTED;                                     0108
*   R15 = 0;                           /* PRESET TO NO ERRORS        */
         SLR   R15,R15                                             0109
*   ERRCODE='00'X;                     /* CLEAR ERROR CODE           */
         MVI   ERRCODE,X'00'                                       0110
*   IF CHBUF(4) ^= ' '                 /* IS THIS A 3 CHARACTER UNIT?*/
*       THEN                           /* NO, DELIMITER ERROR        */
         L     @10,CSCBPTR                                         0111
         CLI   CHBUF+3(@10),C' '                                   0111
         BE    @RF00111                                            0111
*             DO;                                                  0112
*                  ERRCODE = '07'X;    /*SET UP FOR DELIM MSG        */
         MVI   ERRCODE,X'07'                                       0113
*                  CALL XSASET;        /* SET UP XSA FOR 0503D       */
         BAL   @14,XSASET                                          0114
*                  CALL CLEANUPC;      /* FREE CSCB, ETC             */
         BAL   @14,CLEANUPC                                        0115
*                  R15 = 4;            /* ERROR RETURN CODE          */
         LA    R15,4                                               0116
*                  R14 = ONE4SV(2);    /* RESTORE 2ND LEVEL R14      */
         L     R14,ONE4SV+4                                        0117
*                  RETURN;             /* RETURN TO CALLER           */
@EL00002 DS    0H                                                  0118
@EF00002 DS    0H                                                  0118
@ER00002 BR    @14                                                 0118
*             END;                                                 0119
*   ELSE;                                                          0120
@RF00111 DS    0H                                                  0121
*   CALL UCBSET;                       /*UCB FIND SUBRTN ,=PTR RET IN*/
         BAL   @14,UCBSET                                          0121
*                                      /* REG 3 OR IT IS = 0 IF NONE */
*   IF UCBPTR = 0                      /* IS THERE A VALID UCB       */
*       THEN                                                       0122
         ICM   @10,15,UCBPTR                                       0122
         BNZ   @RF00122                                            0122
*             DO;                      /* NO UCB WAS FOUND FOR THE   */
*                                      /* SPECIFIED DEVICE           */
*                  ERRCODE = '0D'X;    /* UNIT REF INVALID MSG       */
         MVI   ERRCODE,X'0D'                                       0124
*                  CALL XSASET;                                    0125
         BAL   @14,XSASET                                          0125
*                  CALL CLEANUPC;                                  0126
         BAL   @14,CLEANUPC                                        0126
*                  R15 = 4;                                        0127
         LA    R15,4                                               0127
*                  R14 = ONE4SV(2);    /* RESTORE 2ND LEVEL R14      */
         L     R14,ONE4SV+4                                        0128
*                  RETURN;                                         0129
         B     @EL00002                                            0129
*             END;                                                 0130
*   ELSE;                                                          0131
@RF00122 DS    0H                                                  0132
*    IF UCB3TAPE ^= '1'B & UCB3DACC ^= '1'B                        0132
*                                      /* IF DEV IS A NOT TAPE OR D A*/
*       THEN                           /* NO IT IS NOT               */
         L     @10,UCBPTR                                          0132
         TM    UCB3TAPE(@10),B'10100000'                           0132
         BNZ   @RF00132                                            0132
*             DO;                                                  0133
*                  ERRCODE = '0D'X;    /* UNIT REF INVALID MSG       */
         MVI   ERRCODE,X'0D'                                       0134
*                  CALL XSASET;                                    0135
         BAL   @14,XSASET                                          0135
*                  CALL CLEANUPC;                                  0136
         BAL   @14,CLEANUPC                                        0136
*                  R15 = 4;                                        0137
         LA    R15,4                                               0137
*                  R14 = ONE4SV(2);                                0138
         L     R14,ONE4SV+4                                        0138
*                  RETURN;                                         0139
         B     @EL00002                                            0139
*             END;                                                 0140
*   ELSE;                                                          0141
@RF00132 DS    0H                                                  0142
*   IF UCBSYSR = '1'B × UCBPRES = '1'B                             0142
*                                      /* IF THIS IS A SYSRES OF     */
*                                      /* PRESRES VOLUME             */
*       THEN                           /* IT IS                      */
         L     @10,UCBPTR                                          0142
         TM    UCBSYSR(@10),B'00000110'                            0142
         BZ    @RF00142                                            0142
*             DO;                                                  0143
*                  ERRCODE = '0D'X;    /* UNIT REF INVALID           */
         MVI   ERRCODE,X'0D'                                       0144
*                  CALL XSASET;                                    0145
         BAL   @14,XSASET                                          0145
*                  CALL CLEANUPC;                                  0146
         BAL   @14,CLEANUPC                                        0146
*                  R15 = 4;                                        0147
         LA    R15,4                                               0147
*                  R14 = ONE4SV(2);                                0148
         L     R14,ONE4SV+4                                        0148
*                  RETURN;                                         0149
         B     @EL00002                                            0149
*             END;                                                 0150
*   ELSE;                                                          0151
@RF00142 DS    0H                                                  0152
*   IF UCBONLI ^= '1'B                 /*IS THE DEVICE ONLINE NOW    */
*        THEN                                                      0152
         L     @10,UCBPTR                                          0152
         TM    UCBONLI(@10),B'10000000'                            0152
         BO    @RF00152                                            0152
*             DO;                      /* NOPE                       */
*                  ERRCODE = '0D'X;    /* UNIT REF INVALID MSG       */
         MVI   ERRCODE,X'0D'                                       0154
*                  CALL XSASET;                                    0155
         BAL   @14,XSASET                                          0155
*                  CALL CLEANUPC;                                  0156
         BAL   @14,CLEANUPC                                        0156
*                  R15 = 4;                                        0157
         LA    R15,4                                               0157
*                  R14 = ONE4SV(2);                                0158
         L     R14,ONE4SV+4                                        0158
*                  RETURN;                                         0159
         B     @EL00002                                            0159
*             END;                                                 0160
*   ELSE;                                                          0161
@RF00152 DS    0H                                                  0162
*   IF UCBNRY = '1'B & UCBALOC^='1'B   /* IF DEVICE IS NOT READY     */
*       THEN                           /* NO, IT IS NOT READY        */
         L     @10,UCBPTR                                          0162
         TM    UCBNRY(@10),B'01000000'                             0162
         BNO   @RF00162                                            0162
         TM    UCBALOC(@10),B'00001000'                            0162
         BO    @RF00162                                            0162
*             DO;                                                  0163
*                  ERRCODE = '0E'X;    /* UNIT NOT AVAIL MSG         */
         MVI   ERRCODE,X'0E'                                       0164
*                  CALL XSASET;                                    0165
         BAL   @14,XSASET                                          0165
*                  CALL SETUPU;        /*SET UP UNLOAD PARAM LIST    */
         BAL   @14,SETUPU                                          0166
*                  RESPECIFY (R3,R13)RESTRICTED;                   0167
*                  R3 = R1;                                        0168
         LR    R3,R1                                               0168
*                  GEN(LOAD EP=IEFAB49C); /* LOAD TO UNLOAD          */
         LOAD EP=IEFAB49C
*                  R15 = R0;           /* ADDR OF IEFAB49C INTO R15  */
         LR    R15,R0                                              0170
*                  R1 = R3;                                        0171
         LR    R1,R3                                               0171
*                  GEN( BALR R14,R15); /* GO TO IEFAB49C             */
          BALR R14,R15
*                  GEN(LM    R0,R15,ESAVE(R1)); /*RESTORE REGS       */
         LM    R0,R15,ESAVE(R1)
*                  RESPECIFY (R13)UNRESTRICTED;                    0174
*                  R3 = R1;                                        0175
         LR    R3,R1                                               0175
*                  GEN( DELETE EP=IEFAB49C);                       0176
          DELETE EP=IEFAB49C
*                  R1 = R3;                                        0177
         LR    R1,R3                                               0177
*                  RESPECIFY (R3)UNRESTRICTED;                     0178
*                  CALL CLEANUPU;      /* FREE PARAM CORE            */
         BAL   @14,CLEANUPU                                        0179
*                  CALL CLEANUPC;      /* FREE CSCB                  */
         BAL   @14,CLEANUPC                                        0180
*                  R15 = 4;            /* ERROR RET CODE-NO UNLOAD   */
         LA    R15,4                                               0181
*             END;                                                 0182
*   ELSE;                                                          0183
@RF00162 DS    0H                                                  0184
*   R14 = ONE4SV(2);                                               0184
         L     R14,ONE4SV+4                                        0184
*   RETURN;                                                        0185
         B     @EL00002                                            0185
*END SYNTAX;                                                       0186
@PB00002 DS    0H                                                  0187
*   GEN(EJECT);                                                    0187
         EJECT
*XSASET:                                                           0188
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);                               0188
         B     @PB00003                                            0188
XSASET   DS    0H                                                  0189
*/*                                                                  */
*   GENERATE;                                                      0189
D112 EQU 112
XSAVE    EQU   48
*/*                                                                  */
*/********************************************************************/
*/* THIS SUBRTN IS CALLED WHEN AN ERROR CONDITION HAS BEEN DETECTED  */
*/* AND EXIT MUST BE TAKEN TO THE MSG MODULE IEE0503D                */
*/* TO ISSUE THE ERROR MSG                                           */
*/*      1. 112 BYTES OF CORE IS GETMAINED FOR THE PARAM LIST (WHICH */
*/*         WILL CONTAIN THE ERROR CODE OF THE MSG TO BE ISSUED,     */
*/*         THE UNITNAME OF THE UNIT IN ERROR,                       */
*/*         THE COMMAND IN QUESTION (UNLOAD)                         */
*/*         THE CONSOLE ID OF THE CONSOLE THAT ISSUED THE CMD)       */
*/*         THE ABOVE IS 48 BYTES. THE REMAINING 64 BYTES ARE USED   */
*/*         AS A SAVE AREA FOR IEEMB813'S REGISTERS                  */
*/*      2. IEE0503D'S PARAM LIST IS INITIALIZED                     */
*/*      3. IEE0503D IS LOADED                                       */
*/*      4. IEE0503D IS GIVEN CONTROL                                */
*/*      5. IEE0503D IS DELETED                                      */
*/*      6. THE PARAM CORE IS FREED                                  */
*/*      7. THIS SUBRTN RETURN TO ITS CALLER                         */
*/********************************************************************/
*/*                                                                  */
*   GEN(EJECT);                                                    0190
         EJECT
*   ONE4SV(3) = R14;                   /* SAVE 3RD LEVEL R14         */
         ST    R14,ONE4SV+8                                        0191
*   GEN(   GETMAIN R,LV=D112);                                     0192
            GETMAIN R,LV=D112
*   RESPECIFY (R2)RESTRICTED;                                      0193
*   R2 = R1;                           /* PTR TO XSA FOR 0503D       */
         LR    R2,R1                                               0194
*   RESPECIFY (R13)RESTRICTED;                                     0195
*   GEN(STM   R0,R15,XSAVE(R2));                                   0196
         STM   R0,R15,XSAVE(R2)
*   ERRANDSV(1:48) = ''B;              /* ZERO OUT THE XSA CORE      */
         XC    ERRANDSV(48,R2),ERRANDSV(R2)                        0197
*   ERRXAV(4:8)='';                    /* BLANK OUT LAST 5 CHARS     */
         MVI   ERRXAV+3(R2),C' '                                   0198
         MVC   ERRXAV+4(4,R2),ERRXAV+3(R2)                         0198
*   IF ERRCODE^='07'X THEN             /* UNIT REF. INVALID CODE?    */
         CLI   ERRCODE,X'07'                                       0199
         BE    @RF00199                                            0199
*          ERRXAV(1:3)=CHBUF;          /* YES, INSERT UNIT NAME      */
         L     @10,CSCBPTR                                         0200
         MVC   ERRXAV(3,R2),CHBUF(@10)                             0200
*      ELSE                                                        0201
*          ERRXAV(1:6)=CUNLOAD;        /* NO, INSERT 'UNLOAD'        */
         B     @RC00199                                            0201
@RF00199 MVC   ERRXAV(6,R2),CUNLOAD                                0201
*   ERRXAE = ERRCODE;                  /* INIT MSG CODE FOR 0503D    */
@RC00199 MVC   ERRXAE(1,R2),ERRCODE                                0202
*   ERRXAX = NM0503D;                  /* INIT MSG MODULE NAME       */
         MVC   ERRXAX(8,R2),NM0503D                                0203
*   ERRXAU = CHUCMP;                   /* INIT THE CONSOLE ID AREA   */
         L     @10,CSCBPTR                                         0204
         MVC   ERRXAU(1,R2),CHUCMP(@10)                            0204
*   GEN (LOAD EP=IEE0503D);            /* LOAD THE LOAD MODULE       */
         LOAD EP=IEE0503D
*   R15 = R0;                          /* ADDRESS OF 0503D           */
         LR    R15,R0                                              0206
*   GEN (BALR R14,R15);                /* EXIT TO SEND ERROR MSG     */
         BALR R14,R15
*   GEN(LM  R0,R15,XSAVE(R2));                                     0208
         LM  R0,R15,XSAVE(R2)
*   RESPECIFY (R13)UNRESTRICTED;                                   0209
*   GEN (DELETE EP=IEE0503D);                                      0210
         DELETE EP=IEE0503D
*   R1 = R2;                                                       0211
         LR    R1,R2                                               0211
*   RESPECIFY (R2)UNRESTRICTED;                                    0212
*   R0 = 112;                          /* PRESET TO FREE XSA CORE    */
         LA    R0,112                                              0213
*   GEN (FREEMAIN R,LV=(0),A=(1));                                 0214
         FREEMAIN R,LV=(0),A=(1)
*   R14 = ONE4SV(3);                   /* RESTORE 3RD LEVEL R14      */
         L     R14,ONE4SV+8                                        0215
*   RETURN;                            /* RETURN TO CALLING ROUTINE  */
@EL00003 DS    0H                                                  0216
@EF00003 DS    0H                                                  0216
@ER00003 BR    @14                                                 0216
*END XSASET;                                                       0217
@PB00003 DS    0H                                                  0218
*   GEN (EJECT);                                                   0218
         EJECT
*SETUPU:                                                           0219
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);                               0219
         B     @PB00004                                            0219
SETUPU   DS    0H                                                  0220
*/********************************************************************/
*/* THIS SUBRTN GETS CORE FOR THE PARAM LIST EXPECTED AS INPUT BY THE*/
*/* UNLOAD RTN(IEFAB49C), A STANDARD SAVE AREA FOR IEFAB49C AND A    */
*/* AREA FOR THIS RTN TO STORE SOME REGS BEFORE EXITING TO IEFAB49C  */
*/* THE PARAM LIST IS INITIALIZED HERE AS WELL AS R13 TO PT TO THE   */
*/* IEFAB49C'S SAVE AREA.                                            */
*/********************************************************************/
*/*                                                                  */
*   GENERATE;                                                      0220
D208         EQU   208
*/*                                                                  */
*/*                                                                  */
*   ONE4SV(3) = R14;                   /* STORE 3RD LEVEL R14        */
         ST    R14,ONE4SV+8                                        0221
*   GEN(GETMAIN R,LV=D208);            /* GET CORE FOR PARAM LIST    */
         GETMAIN R,LV=D208
*   REQDSECT(1:208) = ''B;             /* AND CLEAN IT UP            */
         XC    REQDSECT(208,R1),REQDSECT(R1)                       0223
*   GEN(STM  R0,R15,USAVE(R1));        /* AND STORE ALL REGS         */
         STM  R0,R15,USAVE(R1)
*   RESPECIFY (R13)RESTRICTED;                                     0225
*   REQPTRD = ADDR(REQPTD);            /*START INIT PARAM LIST       */
         LA    @10,REQPTD(,R1)                                     0226
         ST    @10,REQPTRD(,R1)                                    0226
*   REQPTD = ADDR(REQD);                                           0227
         LA    @10,REQD(,R1)                                       0227
         ST    @10,REQPTD(,R1)                                     0227
*   VMVUNLOD = '1'B;                   /* UNLOAD CMD INDICATOR       */
*   VMVNOUCB = '1'B;                                               0229
         L     @10,PTREQPTR(,R1)                                   0229
         L     @10,VMVREQBP(,@10)                                  0229
         OI    VMVUNLOD(@10),B'11000000'                           0229
*   VMVUCBP = UCBPTR;                  /* UCB PTR FOR UNLOAD MOD     */
         L     @09,UCBPTR                                          0230
         ST    @09,VMVUCBP(,@10)                                   0230
*   VMVUVLST = UCBVOLI;                /* VOL SER OF DEVICE          */
         MVC   VMVUVLST(6,@10),UCBVOLI(@09)                        0231
*   R13 = ADDR(USAVAREA);              /* SAVE AREA POINTER          */
         LA    R13,USAVAREA(,R1)                                   0232
*   R14 = ONE4SV(3);                   /* RESTORE 3RD LEVEL R14      */
         L     R14,ONE4SV+8                                        0233
*   RETURN;                            /* RETURN TO MAIN PROCESSOR   */
@EL00004 DS    0H                                                  0234
@EF00004 DS    0H                                                  0234
@ER00004 BR    @14                                                 0234
*END SETUPU;                                                       0235
@PB00004 DS    0H                                                  0236
*   GEN (EJECT);                                                   0236
         EJECT
*CLEANUPU:                                                         0237
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);                               0237
         B     @PB00005                                            0237
CLEANUPU DS    0H                                                  0238
*/*                                                                  */
*/********************************************************************/
*/* THIS SUBRTN FREES THE CORE REQUIRED TO BE GOTTEN FOR IEFAB49C.   */
*/* THIS CORE WAS GETMAIN'D IN THE 'SETUPU' SUBRTN                   */
*/********************************************************************/
*/*                                                                  */
*   ONE4SV(3) = R14;                   /* STORE 3RD LEVEL R14        */
         ST    R14,ONE4SV+8                                        0238
*   R0 = 208;                          /* SIZ OF UNLOAD CORE PARAMLST*/
         LA    R0,208                                              0239
*   GEN (FREEMAIN R,LV=(0),A=(1));                                 0240
         FREEMAIN R,LV=(0),A=(1)
*   R14 = ONE4SV(3);                   /* RESTORE 3RD LEVEL R14      */
         L     R14,ONE4SV+8                                        0241
*   RETURN;                            /* RETURN TO CALLING RTN      */
@EL00005 DS    0H                                                  0242
@EF00005 DS    0H                                                  0242
@ER00005 BR    @14                                                 0242
*END CLEANUPU;                                                     0243
@PB00005 DS    0H                                                  0244
*   GEN (EJECT);                                                   0244
         EJECT
*CLEANUPC:                                                         0245
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);                               0245
         B     @PB00006                                            0245
CLEANUPC DS    0H                                                  0246
*/*                                                                  */
*/********************************************************************/
*/* THIS SUBRTN WILL:                                                */
*/* DEQ OFF THE Q4 (UCB) . THE ENQ WAS ISSUED EARLIER IN THE MAIN    */
*/* ROUTINE.                                                         */
*/* ALSO IT WILL FREE THE CSCB                                       */
*/********************************************************************/
*/*                                                                  */
*   ONE4SV(3) = R14;                   /* SAVE 3RD LEVEL R14         */
         ST    R14,ONE4SV+8                                        0246
*   GEN (DEQ MF=(E,IEFSD21D));         /* DEQ OFF THE UCB'S          */
         DEQ MF=(E,IEFSD21D)
*   R1 = CSCBPTR;                      /* CSCB PTR                   */
         L     @10,CSCBPTR                                         0248
         LR    R1,@10                                              0248
*   CHFC = '1'B;                       /* SET TO FREE CSCB           */
         OI    CHFC(@10),B'00000010'                               0249
*   GEN (MGCR (1),CHAIN);                                          0250
         MGCR (1),CHAIN
*   R14 = ONE4SV(3);                   /* RESTORE 3RD LEVEL R14      */
         L     R14,ONE4SV+8                                        0251
*   RETURN;                            /* RETURN TO CALLING RTN      */
@EL00006 DS    0H                                                  0252
@EF00006 DS    0H                                                  0252
@ER00006 BR    @14                                                 0252
*/*                                                                  */
*/*                                                                  */
*   GENERATE;                                                      0253
IEFSD21D DEQ  (IEFSQCBS,IEFDEVS,8,SYSTEM,IEFSQCBS,IEFVQCBS,7,SYSTEM), **
               RET=HAVE,MF=L                                  @YM5443P
*END CLEANUPC;                                                     0254
         B     @EL00006                                            0254
@PB00006 DS    0H                                                  0255
*   GEN (EJECT);                                                   0255
         EJECT
*UMSG:                                                             0256
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);                               0256
         B     @PB00007                                            0256
UMSG     DS    0H                                                  0257
*/*                                                                  */
*/********************************************************************/
*/* THIS SUBRTN ISSUES THE 'IEE734I UNITNAME NOW UNLOADED' MSG       */
*/* WHEN THE DEVICE WAS SUCCESSFULLY UNLOAD BY EIFAB49C              */
*/********************************************************************/
*/*                                                                  */
*/*                                    ON ENTRY R1 PTR TO THE MSGCORE*/
*   ONE4SV(3) = R14;                   /* STORE 3RD LEVEL R14        */
         ST    R14,ONE4SV+8                                        0257
*   RESPECIFY (R2)RESTRICTED;                                      0258
*   R2 = R1;                           /* SAVE BUFFER PTR INTO REG2  */
         LR    R2,R1                                               0259
*   UNMSGBUF = UNLMSG;                 /* MOVE IN MSG TEXT           */
         MVC   UNMSGBUF(38,R1),UNLMSG                              0260
*   UNIT(1:3) = UCBNAME;               /* MOVE IN UNITNAME           */
         L     @10,UCBPTR                                          0261
         MVC   UNIT(3,R1),UCBNAME(@10)                             0261
*   R0 = 0;                            /* PRESET FOR R/I COMMD       */
         SLR   R0,R0                                               0262
*   IF CHUCMP ^= '80'X                 /* IF IT IS NOT PICK THE CONSL*/
*        THEN                          /* ID OF ISSUEING CONSOLE FROM*/
         L     @10,CSCBPTR                                         0263
         CLI   CHUCMP(@10),X'80'                                   0263
         BE    @RF00263                                            0263
*             R0 = CHUCMP;             /* THE CSCB, IF IT IS THE R/I */
         SLR   R0,R0                                               0264
         IC    R0,CHUCMP(,@10)                                     0264
*   ELSE;                              /* THEN LEAVE R0 = 0          */
@RF00263 DS    0H                                                  0266
*   GEN (WTO MF=(E,(1)));                                          0266
         WTO MF=(E,(1))
*   R1 = R2;                           /* RESTORE REG 1              */
         LR    R1,R2                                               0267
*   RESPECIFY (R2)UNRESTRICTED;                                    0268
*   R14 = ONE4SV(3);                   /* RESTORE 3RD LEVEL R14      */
         L     R14,ONE4SV+8                                        0269
*   RETURN;                            /* MSG IS ISSUED,RET TO CALLER*/
@EL00007 DS    0H                                                  0270
@EF00007 DS    0H                                                  0270
@ER00007 BR    @14                                                 0270
*/*                                                                  */
*/*                                                                  */
*/*                                                                  */
*   GENERATE;                                                      0271
UNLMSG    WTO   'IEE734I          NOW UNLOADED ',MF=L,DESC=(5),MCSFLAG==
               (REG0,RESP)
MSGLEN    EQU   *
*END UMSG;                                                         0272
         B     @EL00007                                            0272
@PB00007 DS    0H                                                  0273
*   GEN (EJECT);                                                   0273
         EJECT
*UCBSET:                                                           0274
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);                               0274
         B     @PB00008                                            0274
UCBSET   DS    0H                                                  0275
*/*                                                                  */
*/********************************************************************/
*/* THIS SUBRTN SCANS THROUGH ALL THE UCB'S IN THE SYSTEM UNTIL:     */
*/*     1. IF IT FINDS A UCB WHOSE UCBNAME FIELD MATCHES THE         */
*/*        UNITNAME FIELD IN THE CMD.                                */
*/*        (AREA 'UCBPTR' IN CORE HAS THE ADDRESS OF THAT UCB)       */
*/*     2. RUNS OUT OF UCB'S IN WHICH CASE THE UNITNAME ON THE CMD   */
*/*        IS ASSUMED INCORRECT ( UCBPTR = 0)                        */
*/*     3. RETURNS TO ITS CALLER WITH UCBPTR AS SPECIFIED ABOVE      */
*/********************************************************************/
*/*                                                                  */
*   ONE4SV(3) = R14;                   /* STORE 3RD LEVEL R14        */
         ST    R14,ONE4SV+8                                        0275
*   UCBPTR = 0;                        /* INIT PTR OF UCB TO ZERO    */
         SLR   @10,@10                                             0276
         ST    @10,UCBPTR                                          0276
*   RESPECIFY (R5)RESTRICTED;                                      0277
*   R5 = CVTILK2;                      /*PTR TO SCHEDLR LOOK-UP TABLE*/
         L     @10,CVTPTR                                          0278
         L     R5,CVTILK2(,@10)                                    0278
*   DO WHILE SRTUCBPT ^= 'FFFF'X;      /*X'FFFF'= DELIM OF END OF TAB*/
         B     @DE00279                                            0279
@DL00279 DS    0H                                                  0280
*             IF SRTUCBPT ^= '0000'X   /*X'0000'=DUMMY UCB SLOT      */
*                  THEN                /*OMIT IF IT IS -0000-        */
         SLR   @10,@10                                             0280
         ICM   @10,3,SRTUCBPT(R5)                                  0280
         LTR   @10,@10                                             0280
         BZ    @RF00280                                            0280
*                       DO;            /*IF NON-0000, CHECK IF IT IS */
*                                      /*IF IT IS THE UCB NEEDED,    */
*                                      /* THEN RET, UCBPTR=PTR TO UCB*/
*                                      /* IF THIS IS NOT THE RIGHT   */
*                                      /* CHECK NEXT TILL END OF TAB */
*                           UCBPTR = SRTUCBPT;                     0282
         ST    @10,UCBPTR                                          0282
*                           IF CHBUF(1:3) = UCBNAME                0283
*                                THEN                              0283
         L     @04,CSCBPTR                                         0283
         CLC   CHBUF(3,@04),UCBNAME(@10)                           0283
         BNE   @RF00283                                            0283
*                                     DO;                          0284
*                                          R14 = ONE4SV(3);        0285
         L     R14,ONE4SV+8                                        0285
*                                          RETURN;                 0286
@EL00008 DS    0H                                                  0286
@EF00008 DS    0H                                                  0286
@ER00008 BR    @14                                                 0286
*                                     END;                         0287
*                           ELSE                                   0288
*                                     UCBPTR = 0;                  0288
@RF00283 SLR   @10,@10                                             0288
         ST    @10,UCBPTR                                          0288
*                       END;                                       0289
*             R5 = R5 +2;              /* UP TO NEXT UCB PTR         */
@RF00280 AH    R5,@CH00094                                         0290
*   END;                                                           0291
@DE00279 CLC   SRTUCBPT(2,R5),@CH01430                             0291
         BNE   @DL00279                                            0291
*   R14 = ONE4SV(3);                   /* RESTORE 3RD LEVEL R14      */
         L     R14,ONE4SV+8                                        0292
*   RESPECIFY (R5)UNRESTRICTED;                                    0293
*END UCBSET;                                                       0294
         B     @EL00008                                            0294
@PB00008 DS    0H                                                  0295
*   GEN (EJECT);                                                   0295
         EJECT
*ISSUESTE:                                                         0296
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);                               0296
         B     @PB00009                                            0296
ISSUESTE DS    0H                                                  0297
*/*                                                                  */
*/********************************************************************/
*/* THIS SUBRTN'S FUNCTION IS TO INTERFACE WITH IEECB860 TO SET UP   */
*/* THE STAE ENVIRONMENT FOR THE UNLOAD CMD.                         */
*/*     1. IT WILL GET CORE AND INIT THE PARAM LIST FOR IEECB860     */
*/*     2. LOAD, BALR AND DELETE IEECB860                            */
*/*     3. FREEMAIN THE CORE FOR THE PARAM LIST                      */
*/*     4. RETURN TO THE CALLING MAIN RTN WITH                       */
*/*          A. R15 = 0 IF STAE WAS SUCCESSFULLY INITIALIZED         */
*/*          B. R15 NOT= 0 IF STAE WAS UNSUCCESSFUL                  */
*/********************************************************************/
*/*                                                                  */
*   GENERATE;                                                      0297
RSAVE    EQU   16
*/*                                                                  */
*   ONE4SV(2) = R14;                   /* STORE 2ND LEVEL R14        */
         ST    R14,ONE4SV+4                                        0298
*   GEN (GETMAIN R,LV=80);             /* GET CORE FOR STAE PARM     */
         GETMAIN R,LV=80
*   RESPECIFY (R7)RESTRICTED;                                      0300
*   R7 = R1;                           /* CORE PTR TO REG7           */
         LR    R7,R1                                               0301
*   GEN(STM  R0,R15,RSAVE(R7));                                    0302
         STM  R0,R15,RSAVE(R7)
*   RESPECIFY (R13)RESTRICTED;                                     0303
*   R13 = R7;                                                      0304
         LR    R13,R7                                              0304
*   CSCBADDR = CSCBPTR;                /* CSCB PTR FOR STAE          */
         MVC   CSCBADDR(4,R7),CSCBPTR                              0305
*   BUFPTR = ADDR(STAEBUF);            /* PTR TO CMD PARAM LIST      */
         LA    @10,STAEBUF(,R7)                                    0306
         ST    @10,BUFPTR(,R7)                                     0306
*   CMDSIZE = '06'X;                   /* SIZE OF THE VERB           */
         MVI   CMDSIZE(R7),X'06'                                   0307
*   CMD = CUNLOAD;                     /* MOVE IN THE CMD VERB       */
         MVI   CMD+6(R7),C' '                                      0308
         MVC   CMD(6,R7),CUNLOAD                                   0308
*   GEN (LOAD EP=IEECB860);                                        0309
         LOAD EP=IEECB860
*   R15 = R0;                          /* ADDRES OF STAE RTN         */
         LR    R15,R0                                              0310
*   R1 = R7;                           /* RESTORE PARM PTR TO R1     */
         LR    R1,R7                                               0311
*   GEN (BALR R14,R15);                /* GO TO STAE                 */
         BALR R14,R15
*   R7 = R13;                                                      0313
         LR    R7,R13                                              0313
*   GEN(LM  R0,R14,RSAVE(R7));                                     0314
         LM  R0,R14,RSAVE(R7)
*   RESPECIFY (R13)UNRESTRICTED;                                   0315
*   RESPECIFY (R5)RESTRICTED;                                      0316
*   R5 = R15;                          /* SAVE RETCODE FROM STAE     */
         LR    R5,R15                                              0317
*   GEN (DELETE EP=IEECB860);                                      0318
         DELETE EP=IEECB860
*   R0 = 80;                           /* SIZE OF GOTTEN CORE        */
         LA    R0,80                                               0319
*   R1 = R7;                                                       0320
         LR    R1,R7                                               0320
*   RESPECIFY (R7)UNRESTRICTED;                                    0321
*   GEN (FREEMAIN R,LV=(0),A=(1));     /* FREE THE CORE              */
         FREEMAIN R,LV=(0),A=(1)
*   R15 = R5;                          /* RESTORE RETCODE TO R15     */
         LR    R15,R5                                              0323
*   RESPECIFY (R5)UNRESTRICTED;                                    0324
*   R14 = ONE4SV(2);                   /* RESTORE 2ND LEVEL R14      */
         L     R14,ONE4SV+4                                        0325
*   RETURN;                                                        0326
@EL00009 DS    0H                                                  0326
@EF00009 DS    0H                                                  0326
@ER00009 BR    @14                                                 0326
*END ISSUESTE;                                                     0327
@PB00009 DS    0H                                                  0328
*   GEN (EJECT);                                                   0328
         EJECT
*GENERATE;                                                         0329
PATCH    DC    CL70'***IEEMB813-UNLOAD***'
*END IEEMB813                                                      0330
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.      *
*/*%INCLUDE SYSLIB  (CVT     )                                        *
*/*%INCLUDE SYSLIB  (IEEBASEA)                                        *
*/*%INCLUDE SYSLIB  (IEFUCBOB)                                        *
*/*%INCLUDE SYSLIB  (IEECHAIN)                                        *
*;                                                                 0330
         B     @EL00001                                            0330
@DATA    DS    0H
@CH00094 DC    H'2'
@CH01430 DC    XL2'FFFF'
@DATD    DSECT
         DS    0F
@SA00001 DS    18F
@PC00001 DS    1F
IEEMB813 CSECT
         DS    0F
@CF01440 DC    BL4'00000000000000000000000000010000'
@CF01443 DC    BL4'00000000000000000000000000000001'
@DATD    DSECT
         DS    0D
CSCBPTR  DS    A
UCBPTR   DS    A
ERRCODE  DS    CL1
         DS    CL3
ONE4SV   DS    3A
IEEMB813 CSECT
         DS    0F
@SIZDATD DC    AL1(0)
         DC    AL3(@ENDDATD-@DATD)
         DS    0D
NM0503D  DC    CL8'IEE0503D'
CUNLOAD  DC    CL6'UNLOAD'
@DATD    DSECT
UNLBIT    EQU   X'10'
XMSSUM    EQU   X'01'
@DATD    DSECT
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA
@ENDDATD EQU   *
IEEMB813 CSECT
@00      EQU   00                      EQUATES FOR REGISTERS 0-15
@01      EQU   01
@02      EQU   02
@03      EQU   03
@04      EQU   04
@05      EQU   05
@06      EQU   06
@07      EQU   07
@08      EQU   08
@09      EQU   09
@10      EQU   10
@11      EQU   11
@12      EQU   12
@13      EQU   13
@14      EQU   14
@15      EQU   15
R0       EQU   @00
R1       EQU   @01
R2       EQU   @02
R3       EQU   @03
R4       EQU   @04
R5       EQU   @05
R7       EQU   @07
R13      EQU   @13
R14      EQU   @14
R15      EQU   @15
R10      EQU   @10
R11      EQU   @11
R12      EQU   @12
R6       EQU   @06
R8       EQU   @08
R9       EQU   @09
CVTPTR   EQU   16
SRTUCBPT EQU   0
CVTMAP   EQU   0
CVTILK2  EQU   CVTMAP+40
CVTDAR   EQU   CVTMAP+72
CVTFLGS1 EQU   CVTDAR
CVTDCB   EQU   CVTMAP+116
CVTIERLC EQU   CVTMAP+144
CVTMSER  EQU   CVTMAP+148
CVTOPTA  EQU   CVTMAP+182
CVTOPTB  EQU   CVTMAP+183
CVTGTF   EQU   CVTMAP+236
CVTGTFST EQU   CVTGTF
CVTGTFS  EQU   CVTGTFST
CVTSTATE EQU   CVTGTFST
CVTTMODE EQU   CVTGTFST
CVTFORM  EQU   CVTGTFST
CVTUSR   EQU   CVTGTFST
CVTAQAVT EQU   CVTMAP+240
CVTTCMFG EQU   CVTAQAVT
CVTVOLM2 EQU   CVTMAP+244
CVTTATA  EQU   CVTVOLM2
CVTTSKS  EQU   CVTTATA
CVTVOLF2 EQU   CVTTSKS
CVTTAT   EQU   CVTTATA+1
CVTATER  EQU   CVTMAP+248
CVTEXT1  EQU   CVTMAP+252
CVTPURG  EQU   CVTMAP+260
CVTQMSG  EQU   CVTMAP+268
CVTDMSR  EQU   CVTMAP+272
CVTERPV  EQU   CVTMAP+316
CVTINTLA EQU   CVTMAP+320
CVTAPF   EQU   CVTMAP+324
CVTEXT2  EQU   CVTMAP+328
CVTHJES  EQU   CVTMAP+332
CVTPGSIA EQU   CVTMAP+348
CVTA1F1  EQU   CVTMAP+356
CVTSYSK  EQU   CVTMAP+357
CVTVOLM1 EQU   CVTMAP+380
CVTVOLF1 EQU   CVTVOLM1
CVTATMCT EQU   CVTMAP+388
CVTXTNT1 EQU   0
CVTXTNT2 EQU   0
CVTDSSV  EQU   CVTXTNT2
CVTRSV90 EQU   CVTXTNT2+5
CVTQID   EQU   CVTXTNT2+24
CVTRV400 EQU   CVTXTNT2+52
CVTRV409 EQU   CVTXTNT2+53
CVTATCVT EQU   CVTXTNT2+64
CVTRV429 EQU   CVTXTNT2+84
CVTRV438 EQU   CVTXTNT2+85
CVTRV457 EQU   CVTXTNT2+112
CVTRV466 EQU   CVTXTNT2+113
CVTFIX   EQU   0
CVTRELNO EQU   CVTFIX+252
BASE     EQU   0
@NM00003 EQU   BASE+13
BALGSTAT EQU   BASE+24
BALOG    EQU   BALGSTAT+4
BASFL    EQU   BASE+36
BARSW    EQU   BASFL
MSLOGST  EQU   BASE+46
BASPBYTE EQU   BASE+47
BAMONITR EQU   BASE+56
@NM00025 EQU   BASE+104
MSLGCLOZ EQU   BASE+108
MSCLOSSW EQU   MSLGCLOZ
MSLGWLOG EQU   BASE+112
MSWLOGSW EQU   MSLGWLOG
MSLGWTR  EQU   BASE+116
MSWTRSW  EQU   MSLGWTR
MSLGSTRT EQU   BASE+120
MSSTRTSW EQU   MSLGSTRT
MS1BASEX EQU   BASE+136
BASES01  EQU   0
MSNTAL   EQU   BASES01
MSSSB    EQU   BASES01+1
MSBTN    EQU   MSSSB
MSPFG    EQU   BASES01+2
MSECBFL  EQU   BASES01+3
MSSUM    EQU   MSECBFL
MSTUS    EQU   BASES01+4
MSSSA    EQU   MSTUS
MSINLSW  EQU   MSSSA
MSREOF   EQU   MSSSA
MSNWP    EQU   MSSSA
MSFHF    EQU   BASES01+5
UCB      EQU   0
UCBOB    EQU   0
UCBJBNR  EQU   UCBOB
UCBFL5   EQU   UCBOB+1
UCBAF    EQU   UCBFL5
UCBSTAT  EQU   UCBOB+3
UCBONLI  EQU   UCBSTAT
UCBUNLD  EQU   UCBSTAT
UCBALOC  EQU   UCBSTAT
UCBPRES  EQU   UCBSTAT
UCBSYSR  EQU   UCBSTAT
UCBCHAN  EQU   UCBOB+4
UCBSFLS  EQU   UCBOB+6
UCBFLA   EQU   UCBSFLS
UCBFL1   EQU   UCBFLA
UCBBSY   EQU   UCBFL1
UCBNRY   EQU   UCBFL1
UCBPST   EQU   UCBFL1
UCBCUB   EQU   UCBFL1
UCBFLB   EQU   UCBSFLS+1
UCBCHM   EQU   UCBOB+8
UCBCHM1  EQU   UCBCHM
UCBPTH0  EQU   UCBCHM1
UCBPTH1  EQU   UCBCHM1
UCBWGT   EQU   UCBOB+12
UCBNAME  EQU   UCBOB+13
UCBTYP   EQU   UCBOB+16
UCBTBYT1 EQU   UCBTYP
UCB1FEA5 EQU   UCBTBYT1
UCB1FEA6 EQU   UCBTBYT1
UCBTBYT2 EQU   UCBTYP+1
UCB2OPT2 EQU   UCBTBYT2
UCBDUDN1 EQU   UCB2OPT2
UCB2OPT3 EQU   UCBTBYT2
UCBDUDN2 EQU   UCB2OPT3
UCB2OPT4 EQU   UCBTBYT2
UCB2OPT6 EQU   UCBTBYT2
UCB2OPT7 EQU   UCBTBYT2
UCBTBYT3 EQU   UCBTYP+2
UCBDVCLS EQU   UCBTBYT3
UCB3TAPE EQU   UCBDVCLS
UCB3DACC EQU   UCBDVCLS
UCBTBYT4 EQU   UCBTYP+3
UCBEXTPT EQU   UCBOB+20
UCBFLC   EQU   UCBEXTPT
UCBDEV   EQU   UCBOB+24
UCBCMEXT EQU   0
UCBATI   EQU   UCBCMEXT+3
@NM00045 EQU   UCBATI
UCBFLP1  EQU   UCBCMEXT+5
UCBMT    EQU   0
UCBOCR   EQU   0
UCBUCS   EQU   0
UCBUCSOP EQU   UCBUCS+4
UCBFCBOP EQU   UCBUCS+5
CHAIN    EQU   0
CHFLG    EQU   CHAIN+4
CHSTS    EQU   CHFLG+2
CHFC     EQU   CHSTS
CHACT    EQU   CHFLG+3
CHKEY    EQU   CHAIN+8
CHPKE    EQU   CHAIN+28
CHUCMP   EQU   CHAIN+29
CHTJID   EQU   CHAIN+30
CHACT1   EQU   CHAIN+35
CHASM    EQU   CHAIN+40
CHCIBP   EQU   CHASM+4
CHRGNSZ  EQU   CHASM+8
CHSHORT  EQU   CHASM+24
CHSWT    EQU   CHSHORT
REQPTPRM EQU   0
PTREQPTR EQU   REQPTPRM
VMVREQBP EQU   0
VMVRQBLK EQU   0
VMVFNMAP EQU   VMVRQBLK
VMVOPTB1 EQU   VMVFNMAP
VMVUNLOD EQU   VMVOPTB1
VMVNOUCB EQU   VMVOPTB1
VMVUCBP  EQU   VMVRQBLK+8
VMVUVLST EQU   VMVRQBLK+12
VMVMINFO EQU   VMVRQBLK+40
REQDSECT EQU   0
REQPTPMD EQU   REQDSECT
REQPTRD  EQU   REQPTPMD
REQPTD   EQU   REQDSECT+12
REQD     EQU   REQDSECT+16
USAVAREA EQU   REQDSECT+64
UNMSGBUF EQU   0
UNIT     EQU   UNMSGBUF+12
STAEWORK EQU   0
CSCBADDR EQU   STAEWORK
BUFPTR   EQU   STAEWORK+4
STAEBUF  EQU   STAEWORK+8
CMDSIZE  EQU   STAEBUF
CMD      EQU   STAEBUF+1
ERRANDSV EQU   0
ERRXAX   EQU   ERRANDSV+8
ERRXAE   EQU   ERRANDSV+16
ERRXAV   EQU   ERRANDSV+24
ERRXAU   EQU   ERRANDSV+40
UCBBGN   EQU   0
DUMMY    EQU   0
CVTS01   EQU   CVTPGSIA
CVTLPDIA EQU   CVTS01+12
CVTDIRST EQU   CVTLPDIA
CVTSLIDA EQU   CVTS01+24
CVTCTLFG EQU   CVTS01+50
CVTRV210 EQU   CVTS01+424
CVTRV219 EQU   CVTS01+425
CVTRV228 EQU   CVTS01+426
CVTRV237 EQU   CVTS01+427
CVTMFRTR EQU   CVTS01+452
CVTRV262 EQU   CVTS01+468
CVTRV271 EQU   CVTS01+469
CVTRV280 EQU   CVTS01+470
CVTRV289 EQU   CVTS01+471
CVTGSDA  EQU   CVTS01+600
UCBOBS01 EQU   UCBDEV
UCBVOLI  EQU   UCBOBS01+4
UCBSTAB  EQU   UCBOBS01+10
UCBBSVL  EQU   UCBSTAB
UCBPRSRS EQU   UCBSTAB
UCBDMCT  EQU   UCBOBS01+11
UCBFL4   EQU   UCBOBS01+13
UCBOBS02 EQU   UCBDEV
UCBTFL1  EQU   UCBOBS02+19
UCBXTN   EQU   UCBOBS02+20
UCBVOPT  EQU   UCBXTN
UCBOBS03 EQU   UCBDEV
UCBXTADR EQU   UCBOBS03
UCBOBS04 EQU   UCBDEV
UCBBTA   EQU   UCBOBS04+12
UCBOBS06 EQU   UCBDEV
UCBAOF   EQU   UCBOBS06
UCBAOF1  EQU   UCBAOF
UCBAOF2  EQU   UCBAOF+1
@NM00044 EQU   UCBOBS06+3
UCBIRB   EQU   UCBOBS06+4
UCBGRAF  EQU   UCBIRB
UCBLDNCA EQU   UCBOBS06+8
UCBRDYQ  EQU   UCBLDNCA
UCBIRLN  EQU   UCBRDYQ
UCBLDNCB EQU   UCBRDYQ+1
UCBCTLNK EQU   UCBOBS06+12
UCBOBS07 EQU   UCBDEV
UCBOBS08 EQU   UCBDEV
CHAINS01 EQU   CHASM
CHBUF    EQU   CHAINS01
CHTYPE   EQU   CHAINS01+124
CHTRSTAT EQU   CHAINS01+125
CHCSYSO  EQU   CHAINS01+134
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS
CHLAST   EQU   CHAINS01+136
CHSPA    EQU   CHAINS01+135
CHUSERID EQU   CHCSYSO
CHJB     EQU   CHCSYSO
CHDUMP   EQU   CHCSYSO
CHQUE    EQU   CHCSYSO
CHHOLD   EQU   CHCSYSO
CHOUT    EQU   CHCSYSO
CHINN    EQU   CHCSYSO
CHALL    EQU   CHCSYSO
CHINC    EQU   CHAINS01+132
CHPEND   EQU   CHAINS01+128
CHARID   EQU   CHAINS01+127
CHCNID   EQU   CHAINS01+126
@NM00049 EQU   CHTRSTAT
CHTSL    EQU   CHTRSTAT
CHTS     EQU   CHTRSTAT
CHINITL  EQU   CHTRSTAT
CHINIT   EQU   CHTRSTAT
CHJOBSL  EQU   CHTRSTAT
CHJOBS   EQU   CHTRSTAT
CHDEF    EQU   CHTYPE
CHHIAR   EQU   CHTYPE
CHARSV29 EQU   CHTYPE
CHARSV28 EQU   CHTYPE
CHARSV27 EQU   CHTYPE
CHARSV26 EQU   CHTYPE
CHARSV25 EQU   CHTYPE
CHDSTAT  EQU   CHTYPE
UCBRV042 EQU   UCBOBS08+5
UCBCTCF1 EQU   UCBOBS08+4
UCBCTCAD EQU   UCBOBS08
UCBICNCB EQU   UCBOBS07+4
UCBRV040 EQU   UCBOBS07
UCBCTLNA EQU   UCBCTLNK+1
UCBRLN   EQU   UCBCTLNK
UCBRDYQA EQU   UCBLDNCB
UCBINRLN EQU   UCBIRLN
UCBIRBA  EQU   UCBIRB+1
UCBRV039 EQU   UCBGRAF
UCBDWNR  EQU   UCBGRAF
UCBRPND  EQU   UCBGRAF
UCBUPM   EQU   UCBGRAF
UCBBTAM  EQU   UCBGRAF
UCBDRNO  EQU   UCBGRAF
UCBDRO   EQU   UCBGRAF
UCBOIP   EQU   UCBGRAF
UCBATRCD EQU   @NM00044
UCBSKPFG EQU   @NM00044
UCBRIPND EQU   @NM00044
UCBRTIAC EQU   @NM00044
UCBRSV79 EQU   @NM00044
UCBRSV78 EQU   @NM00044
UCBRSV77 EQU   @NM00044
UCBOLTEP EQU   @NM00044
UCBATNCT EQU   UCBOBS06+2
UCBRSV76 EQU   UCBAOF2
UCBRSV75 EQU   UCBAOF2
UCBRSV74 EQU   UCBAOF2
UCBRSV73 EQU   UCBAOF2
UCBRSV72 EQU   UCBAOF2
UCBRSV71 EQU   UCBAOF2
UCBRSV70 EQU   UCBAOF2
UCBRSV69 EQU   UCBAOF2
UCBRSV68 EQU   UCBAOF1
UCBRSV67 EQU   UCBAOF1
UCBRSV66 EQU   UCBAOF1
UCBRSV65 EQU   UCBAOF1
UCBRSV64 EQU   UCBAOF1
UCBOFNL  EQU   UCBAOF1
UCBOFSP  EQU   UCBAOF1
UCBOFMCR EQU   UCBAOF1
UCBBTB   EQU   UCBBTA+1
UCBDI    EQU   UCBBTA
UCBSNS   EQU   UCBOBS04+8
UCBTEB   EQU   UCBOBS04+4
UCBGCB   EQU   UCBOBS04+3
UCBOPEN  EQU   UCBOBS04+2
UCBSTART EQU   UCBOBS04
UCBXTNB  EQU   UCBXTN+1
UCBRSV22 EQU   UCBVOPT
UCBRSV21 EQU   UCBVOPT
UCBRSV20 EQU   UCBVOPT
UCBESVE  EQU   UCBVOPT
UCBERPC  EQU   UCBVOPT
UCBESVC  EQU   UCBVOPT
UCBEVA   EQU   UCBVOPT
UCBESV   EQU   UCBVOPT
UCBRV009 EQU   UCBTFL1
UCBRV008 EQU   UCBTFL1
UCBRV007 EQU   UCBTFL1
UCBRV006 EQU   UCBTFL1
UCBRV005 EQU   UCBTFL1
UCBRV038 EQU   UCBTFL1
UCBNSLTP EQU   UCBTFL1
UCBNLTP  EQU   UCBTFL1
UCBRES1B EQU   UCBOBS02+18
UCBFSER  EQU   UCBOBS02+12
@NM00043 EQU   UCBOBS02+4
UCBFSEQ  EQU   UCBOBS02+2
UCBFSCT  EQU   UCBOBS02
UCBNEXP  EQU   UCBOBS01+20
UCBBASE  EQU   UCBOBS01+16
UCBRES1A EQU   UCBOBS01+15
UCBUSER  EQU   UCBOBS01+14
UCBFL47  EQU   UCBFL4
UCBFL46  EQU   UCBFL4
UCBFL45  EQU   UCBFL4
UCBFL44  EQU   UCBFL4
UCBDSS   EQU   UCBFL4
UCBRV028 EQU   UCBFL4
UCBWDAV  EQU   UCBFL4
UCBDAVV  EQU   UCBFL4
UCBSQC   EQU   UCBOBS01+12
UCBDATP  EQU   UCBOBS01+12
UCBDMC   EQU   UCBDMCT
UCBMOUNT EQU   UCBDMCT
UCBBNUL  EQU   UCBSTAB
UCBSHAR  EQU   UCBSTAB
UCBBSTR  EQU   UCBSTAB
UCBBPUB  EQU   UCBSTAB
UCBBPRV  EQU   UCBSTAB
UCBBALB  EQU   UCBPRSRS
UCBPGFL  EQU   UCBSTAB
UCBDVSHR EQU   UCBBSVL
UCBVTOC  EQU   UCBOBS01
CVTTPIO  EQU   CVTS01+608
CVTADV   EQU   CVTS01+604
CVTGSDAB EQU   CVTGSDA
CVTQV3   EQU   CVTS01+596
CVTQV2   EQU   CVTS01+592
CVTQV1   EQU   CVTS01+588
CVTRPT   EQU   CVTS01+584
CVTSSRB  EQU   CVTS01+580
CVTCSDRL EQU   CVTS01+576
CVTEXP1  EQU   CVTS01+572
CVTRMPMT EQU   CVTS01+568
CVTRMPTT EQU   CVTS01+564
CVTVPSA  EQU   CVTS01+560
CVTVSTOP EQU   CVTS01+556
CVTGTFR8 EQU   CVTS01+552
CVTQUIT  EQU   CVTS01+548
CVTVACR  EQU   CVTS01+544
CVTWTCB  EQU   CVTS01+540
CVTSTPRS EQU   CVTS01+536
CVT0PT02 EQU   CVTS01+532
CVTDARCM EQU   CVTS01+528
CVTIRECM EQU   CVTS01+524
CVTJRECM EQU   CVTS01+520
CVTVEMS0 EQU   CVTS01+516
CVTSPFRR EQU   CVTS01+512
CVTRLSTG EQU   CVTS01+508
CVT0TC0A EQU   CVTS01+504
CVTGMBR  EQU   CVTS01+500
CVTLFRM  EQU   CVTS01+496
CVTRMBR  EQU   CVTS01+492
CVTVIOP  EQU   CVTS01+488
CVTRV307 EQU   CVTS01+486
CVTRV306 EQU   CVTS01+484
CVTRV305 EQU   CVTS01+482
CVTRV304 EQU   CVTS01+480
CVTRV303 EQU   CVTS01+478
CVTRV302 EQU   CVTS01+476
CVTRV301 EQU   CVTS01+475
CVTRV300 EQU   CVTS01+474
CVTRV299 EQU   CVTS01+473
CVTRV298 EQU   CVTS01+472
CVTRV297 EQU   CVTRV289
CVTRV296 EQU   CVTRV289
CVTRV295 EQU   CVTRV289
CVTRV294 EQU   CVTRV289
CVTRV293 EQU   CVTRV289
CVTRV292 EQU   CVTRV289
CVTRV291 EQU   CVTRV289
CVTRV290 EQU   CVTRV289
CVTRV288 EQU   CVTRV280
CVTRV287 EQU   CVTRV280
CVTRV286 EQU   CVTRV280
CVTRV285 EQU   CVTRV280
CVTRV284 EQU   CVTRV280
CVTRV283 EQU   CVTRV280
CVTRV282 EQU   CVTRV280
CVTRV281 EQU   CVTRV280
CVTRV279 EQU   CVTRV271
CVTRV278 EQU   CVTRV271
CVTRV277 EQU   CVTRV271
CVTRV276 EQU   CVTRV271
CVTRV275 EQU   CVTRV271
CVTRV274 EQU   CVTRV271
CVTRV273 EQU   CVTRV271
CVTRV272 EQU   CVTRV271
CVTRV270 EQU   CVTRV262
CVTRV269 EQU   CVTRV262
CVTRV268 EQU   CVTRV262
CVTRV267 EQU   CVTRV262
CVTRV266 EQU   CVTRV262
CVTRV265 EQU   CVTRV262
CVTRV264 EQU   CVTRV262
CVTRV263 EQU   CVTRV262
CVTVFP   EQU   CVTS01+464
CVTVSI   EQU   CVTS01+460
CVTVPSIB EQU   CVTS01+456
CVTMFACT EQU   CVTMFRTR
CVTMFCTL EQU   CVTS01+448
CVTPVBP  EQU   CVTS01+444
CVTPWI   EQU   CVTS01+440
CVTRV254 EQU   CVTS01+438
CVTRV253 EQU   CVTS01+436
CVTRV252 EQU   CVTS01+434
CVTRV251 EQU   CVTS01+433
CVTRV250 EQU   CVTS01+432
CVTRV249 EQU   CVTS01+431
CVTRV248 EQU   CVTS01+430
CVTRV247 EQU   CVTS01+429
CVTRV246 EQU   CVTS01+428
CVTRV245 EQU   CVTRV237
CVTRV244 EQU   CVTRV237
CVTRV243 EQU   CVTRV237
CVTRV242 EQU   CVTRV237
CVTRV241 EQU   CVTRV237
CVTRV240 EQU   CVTRV237
CVTRV239 EQU   CVTRV237
CVTRV238 EQU   CVTRV237
CVTRV236 EQU   CVTRV228
CVTRV235 EQU   CVTRV228
CVTRV234 EQU   CVTRV228
CVTRV233 EQU   CVTRV228
CVTRV232 EQU   CVTRV228
CVTRV231 EQU   CVTRV228
CVTRV230 EQU   CVTRV228
CVTRV229 EQU   CVTRV228
CVTRV227 EQU   CVTRV219
CVTRV226 EQU   CVTRV219
CVTRV225 EQU   CVTRV219
CVTRV224 EQU   CVTRV219
CVTRV223 EQU   CVTRV219
CVTRV222 EQU   CVTRV219
CVTRV221 EQU   CVTRV219
CVTRV220 EQU   CVTRV219
CVTRV218 EQU   CVTRV210
CVTRV217 EQU   CVTRV210
CVTRV216 EQU   CVTRV210
CVTRV215 EQU   CVTRV210
CVTRV214 EQU   CVTRV210
CVTRV213 EQU   CVTRV210
CVTRV212 EQU   CVTRV210
CVTRV211 EQU   CVTRV210
CVTLCCAT EQU   CVTS01+420
CVTPCCAT EQU   CVTS01+416
CVTIPCRP EQU   CVTS01+412
CVTIPCRI EQU   CVTS01+408
CVTIPCDS EQU   CVTS01+404
CVTAIDVT EQU   CVTS01+400
CVTSSAP  EQU   CVTS01+396
CVTEHCIR EQU   CVTS01+392
CVTEHDEF EQU   CVTS01+388
CVTDAIR  EQU   CVTS01+384
CVTPERFM EQU   CVTS01+380
CVT044R2 EQU   CVTS01+376
CVTFETCH EQU   CVTS01+372
CVTRSTWD EQU   CVTS01+368
CVTSPOST EQU   CVTS01+364
CVTIOBP  EQU   CVTS01+360
CVTASMVT EQU   CVTS01+356
CVTRECRQ EQU   CVTS01+352
CVTWSAC  EQU   CVTS01+348
CVTRV149 EQU   CVTS01+344
CVTWSAL  EQU   CVTS01+340
CVTSPSA  EQU   CVTS01+336
CVTGLMN  EQU   CVTS01+332
CVTVEAC0 EQU   CVTS01+328
CVT062R1 EQU   CVTS01+324
CVTRPOST EQU   CVTS01+320
CVTDQIQE EQU   CVTS01+316
CVTCSD   EQU   CVTS01+312
CVTLKRMA EQU   CVTS01+308
CVTRSPIE EQU   CVTS01+304
CVTRENQ  EQU   CVTS01+300
CVTLQCB  EQU   CVTS01+296
CVTFQCB  EQU   CVTS01+292
CVTQCS01 EQU   CVTS01+288
CVTAPFT  EQU   CVTS01+284
CVTPARRL EQU   CVTS01+280
CVTVWAIT EQU   CVTS01+276
CVTGSPL  EQU   CVTS01+272
CVTLSMQ  EQU   CVTS01+268
CVTGSMQ  EQU   CVTS01+264
CVTEXPRO EQU   CVTS01+260
CVTOPCTP EQU   CVTS01+256
CVTSIC   EQU   CVTS01+252
CVTTPIOS EQU   CVTS01+248
CVTRTMS  EQU   CVTS01+244
CVTSDBF  EQU   CVTS01+240
CVTSCBP  EQU   CVTS01+236
CVTSDMP  EQU   CVTS01+232
CVTSV60  EQU   CVTS01+228
CVTRTMCT EQU   CVTS01+224
CVTASCBL EQU   CVTS01+220
CVTASCBH EQU   CVTS01+216
CVTGDA   EQU   CVTS01+212
CVTASVT  EQU   CVTS01+208
CVTVVMDI EQU   CVTS01+204
CVTAQTOP EQU   CVTS01+200
CVTIOSCS EQU   CVTS01+196
CVTSDRM  EQU   CVTS01+192
CVTOPTE  EQU   CVTS01+188
CVTSTXU  EQU   CVTS01+184
CVTQUIS  EQU   CVTS01+180
CVTPARS  EQU   CVTS01+176
CVTS1EE  EQU   CVTS01+172
CVTFRAS  EQU   CVTS01+168
CVTQSAS  EQU   CVTS01+164
CVTCRAS  EQU   CVTS01+160
CVTCRMN  EQU   CVTS01+156
CVTDELCP EQU   CVTS01+152
CVTFRECL EQU   CVTS01+148
CVTGETCL EQU   CVTS01+144
CVTBLDCP EQU   CVTS01+140
CVTAUTHL EQU   CVTS01+136
CVTSCAN  EQU   CVTS01+132
CVTRV144 EQU   CVTS01+130
CVTMAXMP EQU   CVTS01+128
CVTSTCK  EQU   CVTS01+124
CVTRV139 EQU   CVTS01+123
CVTDSSAC EQU   CVTS01+122
CVTRV513 EQU   CVTS01+121
CVTIOSPL EQU   CVTS01+120
CVTPTGT  EQU   CVTS01+116
CVTCSPIE EQU   CVTS01+112
CVTSMFEX EQU   CVTS01+108
CVTOLT0A EQU   CVTS01+104
CVTSRBRT EQU   CVTS01+100
CVTPUTL  EQU   CVTS01+96
CVTRV519 EQU   CVTS01+92
CVTRV327 EQU   CVTS01+88
CVTRV326 EQU   CVTS01+84
CVTRV325 EQU   CVTS01+80
CVTRV324 EQU   CVTS01+76
CVT0VL01 EQU   CVTS01+72
CVTSHRVM EQU   CVTS01+68
CVTRV332 EQU   CVTS01+64
CVTTAS   EQU   CVTS01+60
CVTRSCN  EQU   CVTS01+56
CVTTRAC2 EQU   CVTS01+54
CVTTRACE EQU   CVTS01+52
CVTAPG   EQU   CVTS01+51
CVTSDTRC EQU   CVTCTLFG
CVTGTRCE EQU   CVTCTLFG
CVTNOMP  EQU   CVTCTLFG
CVTRSV79 EQU   CVTCTLFG
CVTDSTAT EQU   CVTCTLFG
CVTRSV78 EQU   CVTCTLFG
CVTRV333 EQU   CVTCTLFG
CVTRV323 EQU   CVTCTLFG
CVTSPVLK EQU   CVTS01+49
CVTRSV77 EQU   CVTS01+48
CVTRV331 EQU   CVTS01+44
CVTRV330 EQU   CVTS01+40
CVTRV329 EQU   CVTS01+36
CVTRV328 EQU   CVTS01+32
CVTRV322 EQU   CVTS01+28
CVTSLID  EQU   CVTSLIDA+1
CVTSYLK  EQU   CVTSLIDA
CVTRV321 EQU   CVTS01+20
CVTRV320 EQU   CVTS01+16
CVTLPDIR EQU   CVTLPDIA+1
CVTRSV69 EQU   CVTDIRST
CVTRSV68 EQU   CVTDIRST
CVTRSV67 EQU   CVTDIRST
CVTRSV66 EQU   CVTDIRST
CVTRSV65 EQU   CVTDIRST
CVTRSV64 EQU   CVTDIRST
CVTRSV63 EQU   CVTDIRST
CVTDICOM EQU   CVTDIRST
CVTPVTP  EQU   CVTS01+8
CVTLPDSR EQU   CVTS01+4
CVTGETL  EQU   CVTS01
XSV      EQU   ERRANDSV+48
ERRDUM4  EQU   ERRANDSV+41
ERRDUM3  EQU   ERRANDSV+32
ERRDUM2  EQU   ERRANDSV+17
ERRDUM1  EQU   ERRANDSV
REGSAVE  EQU   STAEWORK+16
RTDESC   EQU   UNMSGBUF+34
MSG      EQU   UNMSGBUF+20
MSGID    EQU   UNMSGBUF+4
MCSFLSZ  EQU   UNMSGBUF
USV      EQU   REQDSECT+144
REQPSVD2 EQU   REQPTPMD+8
REQPSVD1 EQU   REQPTPMD+4
VMVVUNTP EQU   VMVRQBLK+44
@NM00050 EQU   VMVMINFO+2
VMVACTON EQU   VMVMINFO+1
VMVMTYPE EQU   VMVMINFO
VMVRETCD EQU   VMVRQBLK+36
VMVJSNMP EQU   VMVRQBLK+32
VMVDSNMP EQU   VMVRQBLK+28
VMVJBNMP EQU   VMVRQBLK+24
VMVMVLSR EQU   VMVRQBLK+18
VMVNREQP EQU   VMVRQBLK+4
VMVOPTB4 EQU   VMVFNMAP+3
VMVOPTB3 EQU   VMVFNMAP+2
VMVOPTB2 EQU   VMVFNMAP+1
VMVVDEND EQU   VMVOPTB1
VMVVRLBL EQU   VMVOPTB1
VMVDWTOR EQU   VMVOPTB1
VMVMTMSG EQU   VMVOPTB1
VMVMOUNT EQU   VMVOPTB1
VMVREWND EQU   VMVOPTB1
REQRESV  EQU   REQPTPRM+4
CHARSV16 EQU   CHSHORT+108
CHARSV15 EQU   CHSHORT+104
CHJSCBVS EQU   CHSHORT+100
CHUSCVS  EQU   CHSHORT+96
@NM00048 EQU   CHSHORT+92
@NM00047 EQU   CHSHORT+88
CHSQA    EQU   CHSHORT+52
CHQPA    EQU   CHSHORT+16
CHJCL    EQU   CHSHORT+12
CHSPC    EQU   CHSHORT+8
CHSPB    EQU   CHSHORT+4
CHTCB    EQU   CHSHORT+1
CHARSV23 EQU   CHSWT
CHARSV22 EQU   CHSWT
CHARSV21 EQU   CHSWT
CHAC     EQU   CHSWT
CHPSF    EQU   CHSWT
CHPSD    EQU   CHSWT
CHJCT    EQU   CHSWT
CHARSV20 EQU   CHSWT
CHCECB   EQU   CHASM+20
CHECB    EQU   CHASM+16
CHRGNAD  EQU   CHASM+12
CHARSV18 EQU   CHRGNSZ+1
CHRPRTY  EQU   CHRGNSZ
@NM00046 EQU   CHCIBP
CHEND    EQU   CHCIBP
CHECBP   EQU   CHASM
CHDER    EQU   CHAIN+36
CHARSV10 EQU   CHACT1
CHARSV09 EQU   CHACT1
CHARSV08 EQU   CHACT1
CHARSV07 EQU   CHACT1
CHARSV06 EQU   CHACT1
CHARSV05 EQU   CHACT1
CHARSV04 EQU   CHACT1
CHRDWTR  EQU   CHACT1
CHARSV30 EQU   CHAIN+34
CHQID    EQU   CHAIN+32
CHASID   EQU   CHTJID
CHTRKID  EQU   CHPKE
CHCIBCTR EQU   CHAIN+27
CHUNIT   EQU   CHAIN+24
CHCLS    EQU   CHAIN+16
CHPARM   EQU   CHKEY
CHIFY    EQU   CHACT
CHAIFX   EQU   CHACT
CHCLD    EQU   CHACT
CHCL     EQU   CHACT
CHDSI    EQU   CHACT
CHDISC   EQU   CHACT
CHTERM   EQU   CHACT
CHSWAP   EQU   CHACT
CHABTERM EQU   CHSTS
CHDL     EQU   CHSTS
CHAD     EQU   CHSTS
CHQSPC   EQU   CHSTS
CHSOUT   EQU   CHSTS
CHSYS    EQU   CHSTS
CHAP     EQU   CHSTS
CHSZE    EQU   CHFLG+1
CHVCD    EQU   CHFLG
CHPTR    EQU   CHAIN
UCBERADR EQU   UCBUCS+12
UCBFCBID EQU   UCBUCS+8
UCBERCNT EQU   UCBUCS+7
UCBRSV51 EQU   UCBUCS+6
UCBRSV50 EQU   UCBFCBOP
UCBRSV49 EQU   UCBFCBOP
UCBRSV48 EQU   UCBFCBOP
UCBRSV47 EQU   UCBFCBOP
UCBRSV46 EQU   UCBFCBOP
UCBRSV45 EQU   UCBFCBOP
UCBRSV44 EQU   UCBFCBOP
UCBFCBO1 EQU   UCBFCBOP
UCBUCSPE EQU   UCBUCSOP
UCBRSV43 EQU   UCBUCSOP
UCBRSV42 EQU   UCBUCSOP
UCBRSV41 EQU   UCBUCSOP
UCBRSV40 EQU   UCBUCSOP
UCBRSV39 EQU   UCBUCSOP
UCBUCSO2 EQU   UCBUCSOP
UCBUCSO1 EQU   UCBUCSOP
UCBUCSID EQU   UCBUCS
UCBRDATA EQU   UCBOCR+4
UCBFRID  EQU   UCBOCR
UCBCLN   EQU   UCBMT+14
UCBERG   EQU   UCBMT+12
UCBMS    EQU   UCBMT+11
UCBNB    EQU   UCBMT+10
UCBPW    EQU   UCBMT+9
UCBPR    EQU   UCBMT+8
UCBSIO   EQU   UCBMT+6
UCBTW    EQU   UCBMT+5
UCBTR    EQU   UCBMT+4
UCBTWT   EQU   UCBMT+3
UCBTRT   EQU   UCBMT+2
UCBCTD   EQU   UCBMT
UCBASID  EQU   UCBCMEXT+14
UCBMFCNT EQU   UCBCMEXT+12
UCBPMSK  EQU   UCBCMEXT+10
UCBCCWOF EQU   UCBCMEXT+8
UCBRV041 EQU   UCBCMEXT+6
UCBRV036 EQU   UCBFLP1
UCBRV035 EQU   UCBFLP1
UCBRV034 EQU   UCBFLP1
UCBRV033 EQU   UCBFLP1
UCBRV032 EQU   UCBFLP1
UCBRV031 EQU   UCBFLP1
UCBRV030 EQU   UCBFLP1
UCBNSRCH EQU   UCBFLP1
UCBSNSCT EQU   UCBCMEXT+4
UCBHPDV  EQU   @NM00045
UCBHALI  EQU   @NM00045
UCBRSV09 EQU   @NM00045
UCBRSV08 EQU   @NM00045
UCBRSV07 EQU   @NM00045
UCBRSV06 EQU   @NM00045
UCBRSV05 EQU   @NM00045
UCBRSV04 EQU   @NM00045
UCBDTI   EQU   UCBCMEXT+2
UCBSTI   EQU   UCBCMEXT+1
UCBETI   EQU   UCBCMEXT
UCBEXTP  EQU   UCBEXTPT+1
UCBDDRSW EQU   UCBFLC
UCBTICBT EQU   UCBFLC
UCBIVRR  EQU   UCBFLC
UCBIVRS  EQU   UCBFLC
UCBITF   EQU   UCBFLC
UCBUDE   EQU   UCBFLC
UCBWAA   EQU   UCBFLC
UCBATTP  EQU   UCBFLC
UCBUNTYP EQU   UCBTBYT4
UCBRSV11 EQU   UCBDVCLS
UCBRSV10 EQU   UCBDVCLS
UCB3CHAR EQU   UCBDVCLS
UCB3UREC EQU   UCBDVCLS
UCB3DISP EQU   UCBDVCLS
UCB3COMM EQU   UCBDVCLS
UCBDVPWR EQU   UCB2OPT7
UCBVLPWR EQU   UCB2OPT6
UCB2OPT5 EQU   UCBTBYT2
UCBRWTAU EQU   UCB2OPT4
UCBRPS   EQU   UCBDUDN2
UCBRR    EQU   UCBDUDN1
UCB2OPT1 EQU   UCBTBYT2
UCB2OPT0 EQU   UCBTBYT2
UCB1FEA7 EQU   UCBTBYT1
UCBD6250 EQU   UCB1FEA6
UCBD1600 EQU   UCB1FEA5
UCB1FEA4 EQU   UCBTBYT1
UCB1FEA3 EQU   UCBTBYT1
UCB1FEA2 EQU   UCBTBYT1
UCB1FEA1 EQU   UCBTBYT1
UCB1FEA0 EQU   UCBTBYT1
UCBRV029 EQU   UCBWGT
UCBVHRSN EQU   UCBWGT
UCBVORSN EQU   UCBWGT
UCBMTPXP EQU   UCBWGT
UCBREW   EQU   UCBWGT
UCBPUB   EQU   UCBWGT
UCBOUT   EQU   UCBWGT
UCBIN    EQU   UCBWGT
UCBCPU   EQU   UCBOB+11
UCBLCI   EQU   UCBOB+10
UCBCNT   EQU   UCBOB+9
UCBRV017 EQU   UCBCHM1
UCBRV016 EQU   UCBCHM1
UCBRV015 EQU   UCBCHM1
UCBRV014 EQU   UCBCHM1
UCBSPB   EQU   UCBPTH1
UCBPPB   EQU   UCBPTH1
UCBSPA   EQU   UCBPTH0
UCBPPA   EQU   UCBPTH0
UCBFLB7  EQU   UCBFLB
UCBFLB6  EQU   UCBFLB
UCBFLB5  EQU   UCBFLB
UCBFLB4  EQU   UCBFLB
UCBRESVH EQU   UCBFLB
UCBSPST  EQU   UCBFLB
UCBASNS  EQU   UCBFLB
UCBIORST EQU   UCBFLB
UCBQISCE EQU   UCBFL1
UCBACTV  EQU   UCBFL1
UCBSAP   EQU   UCBFL1
UCBNOTRC EQU   UCBCUB
UCBPSNS  EQU   UCBFL1
UCBUSING EQU   UCBPST
UCBNOTRD EQU   UCBNRY
UCBBUSYD EQU   UCBBSY
UCBUA    EQU   UCBCHAN+1
UCBCHA   EQU   UCBCHAN
UCBDADI  EQU   UCBSTAT
UCBRESV  EQU   UCBSTAT
UCBCHGS  EQU   UCBSTAT
UCBID    EQU   UCBOB+2
UCBALTPH EQU   UCBFL5
UCBALTCU EQU   UCBFL5
UCBNALOC EQU   UCBFL5
UCBENVRD EQU   UCBFL5
UCBVSDR  EQU   UCBFL5
UCBSASK  EQU   UCBFL5
UCBAMV   EQU   UCBAF
UCBDCC   EQU   UCBFL5
UCBMONT  EQU   UCBJBNR
UCBRV011 EQU   UCBJBNR
UCBRSV02 EQU   UCBJBNR
UCBRSV01 EQU   UCBJBNR
UCBRV003 EQU   UCBJBNR
UCBRV002 EQU   UCBJBNR
UCBJES3  EQU   UCBJBNR
UCBVRDEV EQU   UCBJBNR
UCBCMSEG EQU   UCBOB
UCBPFXND EQU   UCB+512
UCBIOQ   EQU   UCB+508
UCBLOCK  EQU   UCB+504
UCBPXST  EQU   UCB+504
@NM00042 EQU   UCB
MSSPARE  EQU   BASES01+48
MSUCBAL  EQU   BASES01+44
MSUCBPR  EQU   BASES01+40
MSBOBECB EQU   BASES01+36
MSSJQ    EQU   BASES01+32
MSECB    EQU   BASES01+28
MSPBP    EQU   BASES01+24
MSERM    EQU   BASES01+22
MSPASS   EQU   BASES01+14
MSVRB    EQU   BASES01+6
MSQHR    EQU   MSFHF
@NM00041 EQU   MSFHF
MSPSDT   EQU   MSFHF
MSREPLYB EQU   MSFHF
MSFAX    EQU   MSFHF
MSTTT    EQU   MSFHF
MSCSD    EQU   MSFHF
MSNMF    EQU   MSFHF
MSJNF    EQU   MSSSA
MSYOUT   EQU   MSNWP
MSNRP    EQU   MSSSA
MSSRDR   EQU   MSREOF
MSWRLOG  EQU   MSSSA
MSNUPSW  EQU   MSSSA
MSWRPEN  EQU   MSSSA
MSSSSIPL EQU   MSINLSW
MSMCR    EQU   MSECBFL
MSYSOUT  EQU   MSECBFL
MSYSIN   EQU   MSECBFL
MSATTN   EQU   MSECBFL
MSWTL    EQU   MSECBFL
MSWTO    EQU   MSECBFL
MSEXT    EQU   MSECBFL
MSCCS    EQU   MSPFG
MSBSP    EQU   MSPFG
MSSYT    EQU   MSPFG
MSSYN    EQU   MSPFG
MSICR    EQU   MSPFG
MSCMC    EQU   MSPFG
MSPNB    EQU   MSPFG
MSDATE   EQU   MSPFG
@NM00040 EQU   MSBTN
MSTN     EQU   MSBTN
@NM00039 EQU   MSBTN
@NM00038 EQU   MSBTN
MSSO     EQU   MSBTN
MSROLFLG EQU   MSBTN
MSCANFLG EQU   MSBTN
MSCONFLG EQU   MSBTN
MSPNIP   EQU   MSNTAL
MSQNIP   EQU   MSNTAL
MSCURE34 EQU   MSNTAL
@NM00037 EQU   MSNTAL
@NM00036 EQU   MSNTAL
@NM00035 EQU   MSNTAL
@NM00034 EQU   MSNTAL
MSNIP    EQU   MSNTAL
@NM00033 EQU   MS1BASEX+40
@NM00032 EQU   MS1BASEX+20
@NM00031 EQU   MS1BASEX
@NM00030 EQU   BASE+128
MSLGJSCB EQU   BASE+124
@NM00029 EQU   MSSTRTSW
MSSTRTP  EQU   MSSTRTSW
MSSTRTW  EQU   MSSTRTSW
@NM00028 EQU   MSWTRSW
MSWTRP   EQU   MSWTRSW
MSWTRW   EQU   MSWTRSW
@NM00027 EQU   MSWLOGSW
MSWLOGP  EQU   MSWLOGSW
MSWLOGW  EQU   MSWLOGSW
@NM00026 EQU   MSCLOSSW
MSCLOSP  EQU   MSCLOSSW
MSCLOSW  EQU   MSCLOSSW
MSLOGLMT EQU   @NM00025+1
MSLOGCLS EQU   @NM00025
BAASCB   EQU   BASE+100
MSSMFPRM EQU   BASE+96
MSCOMMND EQU   BASE+92
BASP12   EQU   BASE+90
BASTCNT  EQU   BASE+88
BASESCT  EQU   BASE+86
BAJNCNT  EQU   BASE+84
BASUBECB EQU   BASE+80
BALOGCOM EQU   BASE+76
BADACNT  EQU   BASE+74
BATACNT  EQU   BASE+72
BAJBNR   EQU   BASE+64
BASP11   EQU   BASE+62
BALCCNT  EQU   BASE+61
BADUMPID EQU   BASE+60
BABCMAX  EQU   BASE+58
BAMONTR2 EQU   BASE+57
@NM00024 EQU   BAMONITR
BAMACTVE EQU   BAMONITR
@NM00023 EQU   BAMONITR
@NM00022 EQU   BAMONITR
@NM00021 EQU   BAMONITR
@NM00020 EQU   BAMONITR
BASPACE  EQU   BAMONITR
BADSN    EQU   BAMONITR
BADSO    EQU   BASE+52
BALOGECB EQU   BASE+48
@NM00019 EQU   BASPBYTE
@NM00018 EQU   BASPBYTE
@NM00017 EQU   BASPBYTE
@NM00016 EQU   BASPBYTE
@NM00015 EQU   BASPBYTE
BAMASCH  EQU   BASPBYTE
BATRACE  EQU   BASPBYTE
BAMSSTAR EQU   BASPBYTE
@NM00014 EQU   MSLOGST
@NM00013 EQU   MSLOGST
MSLOGSTA EQU   MSLOGST
MSLOGIPL EQU   MSLOGST
MSLOGDAR EQU   MSLOGST
MSLOGCOM EQU   MSLOGST
MSLOGTHD EQU   MSLOGST
MSLOGENQ EQU   MSLOGST
BAMIPAR2 EQU   BASE+44
BAMINPAR EQU   BASE+42
BAPKES   EQU   BASE+40
BAICTR   EQU   BASE+38
@NM00012 EQU   BASE+37
BADSET   EQU   BARSW
BANOSET  EQU   BARSW
BAMIDNT  EQU   BARSW
BAHR     EQU   BARSW
BAVU     EQU   BARSW
BAINTSET EQU   BARSW
MSTODWTO EQU   BARSW
BAIN     EQU   BARSW
BACV     EQU   BASE+32
@NM00011 EQU   BALOG
@NM00010 EQU   BALOG
@NM00009 EQU   BALOG
@NM00008 EQU   BALOG
@NM00007 EQU   BALOG
@NM00006 EQU   BALOG
@NM00005 EQU   BALOG
BALOGINT EQU   BALOG
MSLOGSVC EQU   BALGSTAT
BAPRC    EQU   BASE+20
BAQ      EQU   BASE+16
BAIPLCC  EQU   @NM00003+2
@NM00004 EQU   @NM00003
BAIPL    EQU   BASE+12
BALAD    EQU   BASE+8
BATRM    EQU   BASE+4
BACHN    EQU   BASE
CVTLEVL  EQU   CVTRELNO+2
CVTNUMB  EQU   CVTRELNO
CVTMDL   EQU   CVTFIX+250
@NM00002 EQU   CVTFIX+248
@NM00001 EQU   CVTFIX
CVTRV482 EQU   CVTXTNT2+128
CVTRV481 EQU   CVTXTNT2+124
CVTRV480 EQU   CVTXTNT2+120
CVTRV479 EQU   CVTXTNT2+118
CVTRV478 EQU   CVTXTNT2+117
CVTRV477 EQU   CVTXTNT2+116
CVTRV476 EQU   CVTXTNT2+115
CVTRV475 EQU   CVTXTNT2+114
CVTRV474 EQU   CVTRV466
CVTRV473 EQU   CVTRV466
CVTRV472 EQU   CVTRV466
CVTRV471 EQU   CVTRV466
CVTRV470 EQU   CVTRV466
CVTRV469 EQU   CVTRV466
CVTRV468 EQU   CVTRV466
CVTRV467 EQU   CVTRV466
CVTRV465 EQU   CVTRV457
CVTRV464 EQU   CVTRV457
CVTRV463 EQU   CVTRV457
CVTRV462 EQU   CVTRV457
CVTRV461 EQU   CVTRV457
CVTRV460 EQU   CVTRV457
CVTRV459 EQU   CVTRV457
CVTRV458 EQU   CVTRV457
CVTRV456 EQU   CVTXTNT2+108
CVTRV455 EQU   CVTXTNT2+104
CVTRV454 EQU   CVTXTNT2+100
CVTRV453 EQU   CVTXTNT2+96
CVTRV452 EQU   CVTXTNT2+94
CVTRV451 EQU   CVTXTNT2+92
CVTRV450 EQU   CVTXTNT2+90
CVTRV449 EQU   CVTXTNT2+88
CVTRV448 EQU   CVTXTNT2+87
CVTRV447 EQU   CVTXTNT2+86
CVTRV446 EQU   CVTRV438
CVTRV445 EQU   CVTRV438
CVTRV444 EQU   CVTRV438
CVTRV443 EQU   CVTRV438
CVTRV442 EQU   CVTRV438
CVTRV441 EQU   CVTRV438
CVTRV440 EQU   CVTRV438
CVTRV439 EQU   CVTRV438
CVTRV437 EQU   CVTRV429
CVTRV436 EQU   CVTRV429
CVTRV435 EQU   CVTRV429
CVTRV434 EQU   CVTRV429
CVTRV433 EQU   CVTRV429
CVTRV432 EQU   CVTRV429
CVTRV431 EQU   CVTRV429
CVTRV430 EQU   CVTRV429
CVTRV428 EQU   CVTXTNT2+80
CVTRV427 EQU   CVTXTNT2+76
CVTRV426 EQU   CVTXTNT2+72
CVTRV425 EQU   CVTXTNT2+68
CVTATACT EQU   CVTATCVT
CVTRV423 EQU   CVTXTNT2+62
CVTRV422 EQU   CVTXTNT2+60
CVTRV421 EQU   CVTXTNT2+58
CVTRV420 EQU   CVTXTNT2+56
CVTRV419 EQU   CVTXTNT2+55
CVTRV418 EQU   CVTXTNT2+54
CVTRV417 EQU   CVTRV409
CVTRV416 EQU   CVTRV409
CVTRV415 EQU   CVTRV409
CVTRV414 EQU   CVTRV409
CVTRV413 EQU   CVTRV409
CVTRV412 EQU   CVTRV409
CVTRV411 EQU   CVTRV409
CVTRV410 EQU   CVTRV409
CVTRV408 EQU   CVTRV400
CVTRV407 EQU   CVTRV400
CVTRV406 EQU   CVTRV400
CVTRV405 EQU   CVTRV400
CVTRV404 EQU   CVTRV400
CVTRV403 EQU   CVTRV400
CVTRV402 EQU   CVTRV400
CVTRV401 EQU   CVTRV400
CVTRSVA1 EQU   CVTXTNT2+48
CVTRSVA0 EQU   CVTXTNT2+44
CVTRSV99 EQU   CVTXTNT2+40
CVTRSV98 EQU   CVTXTNT2+36
CVTRSV97 EQU   CVTXTNT2+34
CVTRSV96 EQU   CVTXTNT2+32
CVTOLTEP EQU   CVTXTNT2+28
CVTQIDA  EQU   CVTQID+1
CVTRSV95 EQU   CVTQID
CVTRSV94 EQU   CVTXTNT2+20
CVTRSV93 EQU   CVTXTNT2+16
CVTRSV92 EQU   CVTXTNT2+12
CVTDEBVR EQU   CVTXTNT2+8
CVTRSV91 EQU   CVTXTNT2+6
CVTRSV9H EQU   CVTRSV90
CVTRSV9G EQU   CVTRSV90
CVTRSV9F EQU   CVTRSV90
CVTRSV9E EQU   CVTRSV90
CVTRSV9D EQU   CVTRSV90
CVTRSV9C EQU   CVTRSV90
CVTRSV9B EQU   CVTRSV90
CVTRSV9A EQU   CVTRSV90
CVTNUCLS EQU   CVTXTNT2+4
CVTDSSVA EQU   CVTDSSV+1
CVTRSV89 EQU   CVTDSSV
CVTRSV88 EQU   CVTXTNT1+8
CVTRSV87 EQU   CVTXTNT1+4
CVTFACHN EQU   CVTXTNT1
CVTRV488 EQU   CVTMAP+412
CVTRV487 EQU   CVTMAP+408
CVTRV486 EQU   CVTMAP+404
CVTRV485 EQU   CVTMAP+400
CVTRV484 EQU   CVTMAP+396
CVTAUTH  EQU   CVTMAP+392
CVTATMCA EQU   CVTATMCT+1
CVTATMST EQU   CVTATMCT
CVTRSV61 EQU   CVTMAP+384
CVTVOLT1 EQU   CVTVOLM1+1
CVTVOLI1 EQU   CVTVOLF1
CVTSTOA  EQU   CVTMAP+376
CVTRSV58 EQU   CVTMAP+374
CVTRSV57 EQU   CVTMAP+372
CVTDDCE  EQU   CVTMAP+368
CVTPNWFR EQU   CVTMAP+364
CVTSMF   EQU   CVTMAP+360
CVTSULK  EQU   CVTMAP+358
CVTSLKO  EQU   CVTSYSK
CVTSLKP  EQU   CVTSYSK
CVTSLKQ  EQU   CVTSYSK
CVTSLKR  EQU   CVTSYSK
CVTRSV56 EQU   CVTSYSK
CVTRSV55 EQU   CVTSYSK
CVTRSV54 EQU   CVTSYSK
CVTRSV53 EQU   CVTSYSK
CVTRSV52 EQU   CVTA1F1
CVTRSV51 EQU   CVTA1F1
CVTRSV50 EQU   CVTA1F1
CVTRSV49 EQU   CVTA1F1
CVTRSV48 EQU   CVTA1F1
CVTRSV47 EQU   CVTA1F1
CVTSRSW  EQU   CVTA1F1
CVTPFSW  EQU   CVTA1F1
CVTPCVT  EQU   CVTMAP+352
CVTRSV46 EQU   CVTMAP+344
CVTRSV45 EQU   CVTMAP+340
CVTRSV44 EQU   CVTMAP+338
CVTRSV43 EQU   CVTMAP+336
CVTHJESA EQU   CVTHJES+1
CVTRSV42 EQU   CVTHJES
CVTEXT2A EQU   CVTEXT2+1
CVTRSV41 EQU   CVTEXT2
CVTAPFA  EQU   CVTAPF+1
CVTRSV40 EQU   CVTAPF
CVTRV518 EQU   CVTINTLA
CVTRV517 EQU   CVTERPV
CVTEORM  EQU   CVTMAP+312
CVTMCHPR EQU   CVTMAP+308
CVTTZ    EQU   CVTMAP+304
CVTJEPS  EQU   CVTMAP+300
CVTJESCT EQU   CVTMAP+296
CVTMODE  EQU   CVTMAP+292
CVTPTRV  EQU   CVTMAP+288
CVTREAL  EQU   CVTMAP+284
CVTRSV39 EQU   CVTMAP+280
CVTRSV38 EQU   CVTMAP+276
CVTDMSRA EQU   CVTDMSR+1
CVTRSV37 EQU   CVTDMSR
CVTQMSGA EQU   CVTQMSG+1
CVTRSV36 EQU   CVTQMSG
CVTAMFF  EQU   CVTMAP+264
CVTPURGA EQU   CVTPURG+1
CVTRSV35 EQU   CVTPURG
CVTCBSP  EQU   CVTMAP+256
CVTATERA EQU   CVTATER+1
CVTSYST  EQU   CVTATER
CVTVOLT2 EQU   CVTTAT
CVTVOLI2 EQU   CVTVOLF2
CVTAQAVB EQU   CVTAQAVT+1
CVTRSV34 EQU   CVTTCMFG
CVTRSV33 EQU   CVTTCMFG
CVTRSV32 EQU   CVTTCMFG
CVTRSV31 EQU   CVTTCMFG
CVTRSV30 EQU   CVTTCMFG
CVTRSV29 EQU   CVTTCMFG
CVTRSV28 EQU   CVTTCMFG
CVTTCRDY EQU   CVTTCMFG
CVTGTFA  EQU   CVTGTF+1
CVTRSV27 EQU   CVTGTFST
CVTRNIO  EQU   CVTGTFST
CVTRV319 EQU   CVTUSR
CVTRV318 EQU   CVTFORM
CVTRV317 EQU   CVTTMODE
CVTRV316 EQU   CVTSTATE
CVTRV315 EQU   CVTGTFS
CVTGTFAV EQU   CVTGTFS
CVT0SCR1 EQU   CVTMAP+232
CVTRV515 EQU   CVTMAP+228
CVTRMS   EQU   CVTMAP+224
CVTPATCH EQU   CVTMAP+220
CVTTSCE  EQU   CVTMAP+216
CVTLNKSC EQU   CVTMAP+214
CVTQABST EQU   CVTMAP+212
CVTMDLDS EQU   CVTMAP+208
CVTUSER  EQU   CVTMAP+204
CVTABEND EQU   CVTMAP+200
CVTSMCA  EQU   CVTMAP+196
CVTRSV18 EQU   CVTMAP+192
CVTQLPAQ EQU   CVTMAP+188
CVTQCDSR EQU   CVTMAP+184
CVTRSV17 EQU   CVTOPTB
CVTRSV16 EQU   CVTOPTB
CVTFP    EQU   CVTOPTB
CVTAPTHR EQU   CVTOPTB
CVTNLOG  EQU   CVTOPTB
CVTTOD   EQU   CVTOPTB
CVTCTIMS EQU   CVTOPTB
CVTPROT  EQU   CVTOPTB
CVTXPFP  EQU   CVTOPTA
CVTASCII EQU   CVTOPTA
CVTRSV13 EQU   CVTOPTA
CVTRSV12 EQU   CVTOPTA
CVTNIP   EQU   CVTOPTA
CVTDDR   EQU   CVTOPTA
CVTAPR   EQU   CVTOPTA
CVTCCH   EQU   CVTOPTA
CVTSNCTR EQU   CVTMAP+180
CVTQMWR  EQU   CVTMAP+176
CVTQOCR  EQU   CVTMAP+172
CVT1EF00 EQU   CVTMAP+168
CVTMZ00  EQU   CVTMAP+164
CVTHEAD  EQU   CVTMAP+160
CVTRSV11 EQU   CVTMAP+156
CVT0PT01 EQU   CVTMAP+152
CVTRV516 EQU   CVTIERLC
CVTILCH  EQU   CVTMAP+140
CVT0DS   EQU   CVTMAP+136
CVTFBOSV EQU   CVTMAP+132
CVTNUCB  EQU   CVTMAP+128
CVTIXAVL EQU   CVTMAP+124
CVTIOQET EQU   CVTMAP+120
CVTDCBA  EQU   CVTMAP+117
CVTMVS2  EQU   CVTDCB
CVT6DAT  EQU   CVTDCB
CVT4MPS  EQU   CVTDCB
CVTRSV09 EQU   CVTDCB
CVT4MS1  EQU   CVTDCB
CVT2SPS  EQU   CVTDCB
CVT1SSS  EQU   CVTDCB
CVTRSV08 EQU   CVTDCB
CVTSTB   EQU   CVTMAP+112
CVTQTD00 EQU   CVTMAP+108
CVTQTE00 EQU   CVTMAP+104
CVTCUCB  EQU   CVTMAP+100
CVTSJQ   EQU   CVTMAP+96
CVTPBLDL EQU   CVTMAP+92
CVTTPC   EQU   CVTMAP+88
CVTSVDCB EQU   CVTMAP+84
CVTBRET  EQU   CVTMAP+82
CVTEXIT  EQU   CVTMAP+80
CVT0FN00 EQU   CVTMAP+76
CVTDARA  EQU   CVTDAR+1
CVTRSV07 EQU   CVTFLGS1
CVTRSV06 EQU   CVTFLGS1
CVTRSV05 EQU   CVTFLGS1
CVTRSV04 EQU   CVTFLGS1
CVTRSV03 EQU   CVTFLGS1
CVTRSV02 EQU   CVTFLGS1
CVTRSV01 EQU   CVTFLGS1
CVTDMPLK EQU   CVTFLGS1
CVTXITP  EQU   CVTMAP+68
CVTZDTAB EQU   CVTMAP+64
CVTMSLT  EQU   CVTMAP+60
CVTDATE  EQU   CVTMAP+56
CVTBTERM EQU   CVTMAP+52
CVTSYSAD EQU   CVTMAP+48
CVTXTLER EQU   CVTMAP+44
CVTILK1  EQU   CVTMAP+36
CVTPRLTV EQU   CVTMAP+32
CVTPCNVT EQU   CVTMAP+28
CVT0VL00 EQU   CVTMAP+24
CVTXAPG  EQU   CVTMAP+20
CVTBUF   EQU   CVTMAP+16
CVTJOB   EQU   CVTMAP+12
CVTLINK  EQU   CVTMAP+8
CVT0EF00 EQU   CVTMAP+4
CVTTCBP  EQU   CVTMAP
CVT      EQU   CVTMAP
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS
@ENDDATA EQU   *
         END   IEEMB813
