         TITLE 'IEESB665 - STC RECOVERY EXIT ROUTINE                 '
IEESB665 CSECT ,                                                   0001
@MAINENT DS    0H                                                  0001
         USING *,@15                                               0001
         B     @PROLOG                                             0001
         DC    AL1(16)                                             0001
         DC    C'IEESB665  73.193'                                 0001
         DROP  @15
@PROLOG  BALR  @10,0                                               0001
@PSTART  DS    0H                                                  0001
         USING @PSTART,@10                                         0001
*   SDWAPTR=R1;                     /* POINT TO THE SDWA ON ENTRY    */
         LR    SDWAPTR,R1                                          0024
*   R7=R14;                         /* SAVE THE RETURN ADDRESS       */
         LR    R7,R14                                              0025
*   IF(R0=12)THEN                   /* IF NO SDWA                    */
         CH    R0,@CH01661                                         0026
         BNE   @RF00026                                            0026
*     R15=0;                        /* INDICATE NO RETRY             */
         SR    R15,R15                                             0027
*   ELSE                                                           0028
*     DO;                                                          0028
*                                                                  0028
         B     @RC00026                                            0028
@RF00026 DS    0H                                                  0029
*       /*************************************************************/
*       /*                                                           */
*       /* AUTOMATIC STORAGE MUST BE EXPLICITLY GOTTEN AND FREED     */
*       /* BECAUSE BOTH REGISTERS 0 ND 1 UPON ENTRY TO THIS MODULE   */
*       /* CONTAIN INPUT, AND THE PLS GETMAIN WOULD DESTROY THEN     */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0029
*       GEN;                                                       0029
     L    R0,@SIZDATD
     GETMAIN R,LV=(0)
     LR   R11,R1
     USING  @DATD,R11
     LR   R13,R11
*       STAEPTR=SDWAPARM;           /* ADDRESS THE STAE PARAMETER  0030
*                                      LIST                          */
         L     STAEPTR,SDWAPARM(,SDWAPTR)                          0030
*       IF(STAERTY='1'B)×(SDWAPERC='1'B)THEN/* IF PERCUALTION OR   0031
*                                      RECUSSION THE FREE CSCB AND 0031
*                                      RETURN                        */
*                                                                  0031
         TM    STAERTY(STAEPTR),B'10000000'                        0031
         BO    @RT00031                                            0031
         TM    SDWAPERC(SDWAPTR),B'00010000'                       0031
         BNO   @RF00031                                            0031
@RT00031 DS    0H                                                  0032
*         /***********************************************************/
*         /*                                                         */
*         /* ISSUE ?SETRP RECPARM(SB665) RECORD(YES) RC(0)           */
*         /* WKAREA(SDWAPTR)                                         */
*         /*                                                         */
*         /***********************************************************/
*                                                                  0032
*         DO;                                                      0032
*           DO;                     /* SETRP RECPARM(SB665)        0033
*                                      RECORD(YES) RC(0)           0033
*                                      WKAREA(SDWAPTR)               */
*             RESPECIFY                                            0034
*              (GPR00P,                                            0034
*               GPR01P,                                            0034
*               GPR14P,                                            0034
*               GPR15P)RSTD;                                       0034
*             GPR01P=SDWAPTR;                                      0035
         LR    GPR01P,SDWAPTR                                      0035
*             GPR01P->SDWARCDE=0;   /* SAVE RC VALUE                 */
         MVI   SDWARCDE(GPR01P),X'00'                              0036
*             GPR01P->SDWARCRD='1'B;/* TURN ON RECORD INDICATOR      */
         OI    SDWARCRD(GPR01P),B'10000000'                        0037
*             GPR15P=ADDR(SB665);   /* ACCESS RECORD PARAMETER LIST  */
         LA    GPR15P,SB665                                        0038
*             GPR01P->SDWARECP=GPR15P->I256C(1:24);/* COPY RECORD  0039
*                                      PARAMETERS                    */
         MVC   SDWARECP(24,GPR01P),I256C(GPR15P)                   0039
*             RESPECIFY                                            0040
*              (GPR00P,                                            0040
*               GPR01P,                                            0040
*               GPR14P,                                            0040
*               GPR15P)UNRSTD;                                     0040
*           END;                                                   0041
*           RESPECIFY                                              0042
*             ASCB BASED(SAVEASCB); /* USE PASSED ASCB               */
*           RESPECIFY                                              0043
*             SDWA BASED(SDWAPTR);  /* REBASE THE SDWA               */
*           CSCBPTR=ASCBCSCB;       /* ADDRESS THE CSCB              */
         L     @12,SAVEASCB(,STAEPTR)                              0044
         L     CSCBPTR,ASCBCSCB(,@12)                              0044
*           ASCBJBNS=0;             /* CLEAR THE GTF FIELD           */
         SR    @06,@06                                             0045
         ST    @06,ASCBJBNS(,@12)                                  0045
*           IF CSCBPTR^=0 THEN      /* IF NO CSCB DO NOT TRY TO FREE */
         CR    CSCBPTR,@06                                         0046
         BE    @RF00046                                            0046
*             DO;                                                  0047
*                                                                  0047
*               /*****************************************************/
*               /*                                                   */
*               /* FREE THE CSCB HERE                                */
*               /*                                                   */
*               /*****************************************************/
*                                                                  0048
*               CHDL='1'B;          /* SET THE DELETE BIT IN CSCB    */
*               CHFC='1'B;          /* SET THE FREE THIS CSCB BIT    */
*                                                                  0049
         OI    CHDL(CSCBPTR),B'00000110'                           0049
*               /*****************************************************/
*               /*                                                   */
*               /* USE SETLOCK TO CLEAR ACSBCSCB FIELD IN THE ASCB   */
*               /*                                                   */
*               /*****************************************************/
*                                                                  0050
*ISSUE:                                                            0050
*               DO;                 /* SETLOCK (OBTAIN) MODE(UNCOND)
*                                      TYPE(LOCAL) REGS(SAVE)      0050
*                                      RELATED(ASCB,IEESB665,ISSUE2) */
ISSUE    DS    0H                                                  0051
*                 RFY                                              0051
*                  (GPR11P,                                        0051
*                   GPR12P,                                        0051
*                   GPR13P,                                        0051
*                   GPR14P)RSTD;                                   0051
*                 RFY                                              0052
*                   GPR15P RSTD;                                   0052
*                 GPR15P=GPR13P;    /* ADDRESS OF REGISTER SAVE AREA.*/
         LR    GPR15P,GPR13P                                       0053
*                 GEN(STM GPR11P,GPR14P,0(GPR15P));/* SAVE REGISTERS.*/
         STM GPR11P,GPR14P,0(GPR15P)
*                 GPR13P=PSALITA;   /* ADDRESS OF LOCK INTERFACE   0055
*                                      TABLE.                        */
         L     GPR13P,PSALITA                                      0055
*                 GEN(LM GPR11P,GPR13P,576(GPR13P));/* LOAD LOCKWORD,
*                                      CLHT AND ENTRY ADRS.          */
         LM GPR11P,GPR13P,576(GPR13P)
*                 GEN(BALR GPR14P,GPR13P);/* BALR TO SETLOCK RTN.    */
         BALR GPR14P,GPR13P
*                 GEN(ST GPR13P,16(GPR15P));/* SAVE RETURN CODE IN 0058
*                                      SAVE AREA.                    */
         ST GPR13P,16(GPR15P)
*                 GEN(LM GPR11P,GPR15P,0(GPR15P));/* RESTORE REGS. -
*                                      PUT RETURN CODE IN 15.        */
         LM GPR11P,GPR15P,0(GPR15P)
*                 RFY                                              0060
*                   GPR15P UNRSTD;                                 0060
*                 RFY                                              0061
*                  (GPR11P,                                        0061
*                   GPR12P,                                        0061
*                   GPR13P,                                        0061
*                   GPR14P)UNRSTD;                                 0061
*               END;                /* SETLOCK (OBTAIN) MODE(UNCOND)
*                                      TYPE(LOCAL) REGS(SAVE)      0062
*                                      RELATED(ASCB,IEESB665,ISSUE2) */
*ISSUE3:                                                           0063
*               DO;                 /* SETLOCK (OBTAIN) MODE(UNCOND)
*                                      TYPE(CMS) REGS(SAVE)        0063
*                                      RELATED(ASCB,IEESB665,ISSUE4) */
ISSUE3   DS    0H                                                  0064
*                 RFY                                              0064
*                  (GPR11P,                                        0064
*                   GPR12P,                                        0064
*                   GPR13P,                                        0064
*                   GPR14P)RSTD;                                   0064
*                 RFY                                              0065
*                   GPR15P RSTD;                                   0065
*                 GPR15P=GPR13P;    /* ADDRESS OF REGISTER SAVE AREA.*/
         LR    GPR15P,GPR13P                                       0066
*                 GEN(STM GPR11P,GPR14P,0(GPR15P));/* SAVE REGISTERS.*/
         STM GPR11P,GPR14P,0(GPR15P)
*                 GPR13P=PSALITA;   /* ADDRESS OF LOCK INTERFACE   0068
*                                      TABLE.                        */
         L     GPR13P,PSALITA                                      0068
*                 GEN(LM GPR11P,GPR13P,540(GPR13P));/* LOAD LOCKWORD,
*                                      CLHT AND ENTRY ADRS.          */
         LM GPR11P,GPR13P,540(GPR13P)
*                 GEN(BALR GPR14P,GPR13P);/* BALR TO SETLOCK RTN.    */
         BALR GPR14P,GPR13P
*                 GEN(ST GPR13P,16(GPR15P));/* SAVE RETURN CODE IN 0071
*                                      SAVE AREA.                    */
         ST GPR13P,16(GPR15P)
*                 GEN(LM GPR11P,GPR15P,0(GPR15P));/* RESTORE REGS. -
*                                      PUT RETURN CODE IN 15.        */
         LM GPR11P,GPR15P,0(GPR15P)
*                 RFY                                              0073
*                   GPR15P UNRSTD;                                 0073
*                 RFY                                              0074
*                  (GPR11P,                                        0074
*                   GPR12P,                                        0074
*                   GPR13P,                                        0074
*                   GPR14P)UNRSTD;                                 0074
*               END;                /* SETLOCK (OBTAIN) MODE(UNCOND)
*                                      TYPE(CMS) REGS(SAVE)        0075
*                                      RELATED(ASCB,IEESB665,ISSUE4) */
*               ASCBCSCB=''B;                                      0076
         L     @12,SAVEASCB(,STAEPTR)                              0076
         SR    @06,@06                                             0076
         ST    @06,ASCBCSCB(,@12)                                  0076
*ISSUE4:                                                           0077
*               DO;                 /* SETLOCK (RELEASE) TYPE(CMS) 0077
*                                      REGS(SAVE)                  0077
*                                      RELATED(ASCB,IEESB665,ISSUE3) */
ISSUE4   DS    0H                                                  0078
*                 RFY                                              0078
*                  (GPR11P,                                        0078
*                   GPR12P,                                        0078
*                   GPR13P,                                        0078
*                   GPR14P)RSTD;                                   0078
*                 RFY                                              0079
*                   GPR15P RSTD;                                   0079
*                 GPR15P=GPR13P;    /* ADDRESS OF REGISTER SAVE AREA.*/
         LR    GPR15P,GPR13P                                       0080
*                 GEN(STM GPR11P,GPR14P,0(GPR15P));/* SAVE REGISTERS.*/
         STM GPR11P,GPR14P,0(GPR15P)
*                 GPR13P=PSALITA;   /* ADDRESS OF LOCK INTERFACE   0082
*                                      TABLE.                        */
         L     GPR13P,PSALITA                                      0082
*                 GEN(LM GPR11P,GPR13P,552(GPR13P));/* LOAD LOCKWORD,
*                                      CLHT AND ENTRY ADRS.          */
         LM GPR11P,GPR13P,552(GPR13P)
*                 GEN(BALR GPR14P,GPR13P);/* BALR TO SETLOCK RTN.    */
         BALR GPR14P,GPR13P
*                 GEN(ST GPR13P,16(GPR15P));/* SAVE RETURN CODE IN 0085
*                                      SAVE AREA.                    */
         ST GPR13P,16(GPR15P)
*                 GEN(LM GPR11P,GPR15P,0(GPR15P));/* RESTORE REGS. -
*                                      PUT RETURN CODE IN 15.        */
         LM GPR11P,GPR15P,0(GPR15P)
*                 RFY                                              0087
*                   GPR15P UNRSTD;                                 0087
*                 RFY                                              0088
*                  (GPR11P,                                        0088
*                   GPR12P,                                        0088
*                   GPR13P,                                        0088
*                   GPR14P)UNRSTD;                                 0088
*               END;                /* SETLOCK (RELEASE) TYPE(CMS) 0089
*                                      REGS(SAVE)                  0089
*                                      RELATED(ASCB,IEESB665,ISSUE3) */
*ISSUE2:                                                           0090
*               DO;                 /* SETLOCK (RELEASE) TYPE(LOCAL)
*                                      REGS(SAVE)                  0090
*                                      RELATED(ASCB,IEESB665,ISSUE)  */
ISSUE2   DS    0H                                                  0091
*                 RFY                                              0091
*                  (GPR11P,                                        0091
*                   GPR12P,                                        0091
*                   GPR13P,                                        0091
*                   GPR14P)RSTD;                                   0091
*                 RFY                                              0092
*                   GPR15P RSTD;                                   0092
*                 GPR15P=GPR13P;    /* ADDRESS OF REGISTER SAVE AREA.*/
         LR    GPR15P,GPR13P                                       0093
*                 GEN(STM GPR11P,GPR14P,0(GPR15P));/* SAVE REGISTERS.*/
         STM GPR11P,GPR14P,0(GPR15P)
*                 GPR13P=PSALITA;   /* ADDRESS OF LOCK INTERFACE   0095
*                                      TABLE.                        */
         L     GPR13P,PSALITA                                      0095
*                 GEN(LM GPR11P,GPR13P,588(GPR13P));/* LOAD LOCKWORD,
*                                      CLHT AND ENTRY ADRS.          */
         LM GPR11P,GPR13P,588(GPR13P)
*                 GEN(BALR GPR14P,GPR13P);/* BALR TO SETLOCK RTN.    */
         BALR GPR14P,GPR13P
*                 GEN(ST GPR13P,16(GPR15P));/* SAVE RETURN CODE IN 0098
*                                      SAVE AREA.                    */
         ST GPR13P,16(GPR15P)
*                 GEN(LM GPR11P,GPR15P,0(GPR15P));/* RESTORE REGS. -
*                                      PUT RETURN CODE IN 15.        */
         LM GPR11P,GPR15P,0(GPR15P)
*                 RFY                                              0100
*                   GPR15P UNRSTD;                                 0100
*                 RFY                                              0101
*                  (GPR11P,                                        0101
*                   GPR12P,                                        0101
*                   GPR13P,                                        0101
*                   GPR14P)UNRSTD;                                 0101
*               END;                /* SETLOCK (RELEASE) TYPE(LOCAL)
*                                      REGS(SAVE)                  0102
*                                      RELATED(ASCB,IEESB665,ISSUE)  */
*                                                                  0102
*               /*****************************************************/
*               /*                                                   */
*               /* FREE THE CSCB USING MGCR                          */
*               /*                                                   */
*               /*****************************************************/
*                                                                  0103
*               R1=CSCBPTR;         /* SET THE CSCB PTR              */
         LR    R1,CSCBPTR                                          0103
*               GEN(MGCR (1),CHAIN);/* FREE THE CSCB                 */
         MGCR (1),CHAIN
*             END;                                                 0105
*           R15=0;                  /* INDICATE NO RETRY             */
@RF00046 SR    R15,R15                                             0106
*         END;                                                     0107
*       ELSE                                                       0108
*         DO;                                                      0108
         B     @RC00031                                            0108
@RF00031 DS    0H                                                  0109
*           STAERTY='1'B;           /* SET RECURSION BIT ON          */
         OI    STAERTY(STAEPTR),B'10000000'                        0109
*           SSDUMPC(1:SLSDUMP)=SSDUMP(1:SLSDUMP);/* MOVE IN THE SDUMP*/
         L     @12,SLSDUMP                                         0110
         BCTR  @12,0                                               0110
         EX    @12,@SM01708                                        0110
*           R1=ADDR(SSDUMPC);       /* POINT TO SDUMP PARAMETERS     */
         LA    R1,SSDUMPC                                          0111
*           GEN( SDUMP MF=(E,(1))); /* ISSUE THE SDUMP               */
          SDUMP MF=(E,(1))
*           IF R15^=0 THEN          /* IF SDUMP UNSUCCESSFUL DONT  0113
*                                      TELL OPERATOR                 */
         LTR   R15,R15                                             0113
         BZ    @RF00113                                            0113
*             STAEDUMP='1'B;        /* SET FLAG FOR MSG ROUTINE      */
         OI    STAEDUMP(STAEPTR),B'01000000'                       0114
*           CALL WRITEMSG;          /* WRITE MSG TO CONSOLE          */
@RF00113 BAL   @14,WRITEMSG                                        0115
*           DEQCORE(1:DEQLGTH)=DEQLIST(1:DEQLGTH);/* MOVE IN LIST  0116
*                                      FORM OF DEQ                   */
         L     @12,DEQLGTH                                         0116
         BCTR  @12,0                                               0116
         EX    @12,@SM01711                                        0116
*           R1=ADDR(DEQCORE);       /* POINT TO MACRO EXPANSION      */
         LA    R1,DEQCORE                                          0117
*           GEN( DEQ MF=(E,(1)));   /* ISSUE THE DEQ OFF CSCB        */
          DEQ MF=(E,(1))
*                                                                  0119
*           /*********************************************************/
*           /*                                                       */
*           /* ISSUE THE SETRP MACRO TO RECORD SDWA AND SCHEDULE     */
*           /* RETRY ?SETRP RETADDR(IEESB667) WKAREA(SDWAPTR)        */
*           /* RECORD(YES) RC(4) RECPARM(SB665) FRESDWA(YES);        */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0119
*           DO;                     /* SETRP RETADDR(IEESB667)     0119
*                                      WKAREA(SDWAPTR) RECORD(YES) 0119
*                                      RC(4) RECPARM(SB665)        0119
*                                      FRESDWA(YES)                  */
*             RESPECIFY                                            0120
*              (GPR00P,                                            0120
*               GPR01P,                                            0120
*               GPR14P,                                            0120
*               GPR15P)RSTD;                                       0120
*             GPR01P=SDWAPTR;                                      0121
         LR    GPR01P,SDWAPTR                                      0121
*             GPR01P->SDWARCDE=4;   /* STORE RC INTO SDWA            */
         MVI   SDWARCDE(GPR01P),X'04'                              0122
*             GPR01P->SDWARTYA=ADDR(IEESB667);/* SAVE RETRY ADDRESS  */
         LA    @12,IEESB667                                        0123
         ST    @12,SDWARTYA(,GPR01P)                               0123
*             GPR01P->SDWAFREE='1'B;/* SET FLAG TO FREE SDWA         */
*             GPR01P->SDWARCRD='1'B;/* TURN ON RECORD INDICATOR      */
         OI    SDWAFREE(GPR01P),B'10000100'                        0125
*             GPR15P=ADDR(SB665);   /* ACCESS RECORD PARAMETER LIST  */
         LA    GPR15P,SB665                                        0126
*             GPR01P->SDWARECP=GPR15P->I256C(1:24);/* COPY RECORD  0127
*                                      PARAMETERS                    */
         MVC   SDWARECP(24,GPR01P),I256C(GPR15P)                   0127
*             RESPECIFY                                            0128
*              (GPR00P,                                            0128
*               GPR01P,                                            0128
*               GPR14P,                                            0128
*               GPR15P)UNRSTD;                                     0128
*           END;                                                   0129
*           RESPECIFY                                              0130
*             SDWA BASED(SDWAPTR);  /* REBASE SDWA                   */
*         END;                                                     0131
*                                                                  0132
*       /*************************************************************/
*       /*                                                           */
*       /* THE PLS GOTTEN AREA MUST BE FREED ON EXIT                 */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0132
*       GEN;                                                       0132
@RC00031 DS    0H                                                  0132
     L   R0,@SIZDATD
     FREEMAIN R,LV=(0),A=(R11)
*     END;                                                         0133
*   R14=R7;                         /* RETURN ADDRESS NOW IN R14     */
@RC00026 LR    R14,R7                                              0134
*   GEN( BR  14);                   /* RETURN TO CALLER              */
          BR  14
*                                                                  0136
*   /*****************************************************************/
*   /*                                                               */
*   /* WRITE THE STC FAILED MSG TO THE OPERATOR                      */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0136
*WRITEMSG:                                                         0136
*   PROC OPTIONS(NOSAVEAREA);                                      0136
         B     @PB00002                                            0136
WRITEMSG STM   @14,@12,12(@13)                                     0136
*   RESPECIFY                                                      0137
*     MESAREA BASED(MESSPTR);       /* BASE THE MESSAGE AREA         */
*   MESSPTR=ADDR(MESCORE);          /* ADDRESS THE MESSAGE AREA      */
         LA    MESSPTR,MESCORE                                     0138
*   MESAREA=MESAREA&&MESAREA;       /* CLEAR THE MESSAGE AREA        */
         XC    MESAREA(55,MESSPTR),MESAREA(MESSPTR)                0139
*   MESFLGS=MCSFLGS;                /* MOVE IN MCS FLAGS             */
         MVC   MESFLGS(2,MESSPTR),MCSFLGS                          0140
*   MESID=IEE824I;                  /* PUT MESSAGE ID IN MESSAGE     */
         MVC   MESID(8,MESSPTR),IEE824I                            0141
*   MESLEN=LENGTH(IEE824I)+4;       /* UPDATE LENGTH OF MESSAGE      */
         LA    @12,12                                              0142
         STH   @12,MESLEN(,MESSPTR)                                0142
*   RESPECIFY                                                      0143
*     CHAIN BASED(ASCBCSCB);                                       0143
*   IF ASCBCSCB=0 THEN              /* IF NO CSCB USE STC NAME       */
         L     @06,SAVEASCB(,STAEPTR)                              0144
         ICM   @05,15,ASCBCSCB(@06)                                0144
         BNZ   @RF00144                                            0144
*     DO;                                                          0145
*       STCNAME=STARTED;            /* PUT STC NAME IN MESSAGE       */
         MVC   STCNAME(13,MESSPTR),STARTED                         0146
*       BASEPTR=ADDR(BUILDA);       /* POINT TO MIDDLE OF MESSAGE    */
         LA    @06,BUILDA(,MESSPTR)                                0147
         ST    @06,BASEPTR                                         0147
*       MESLEN=MESLEN+LENGTH(STARTED);/* UPDATE THE LENGTH OF MESSAGE*/
         AH    @12,@CH01592                                        0148
         STH   @12,MESLEN(,MESSPTR)                                0148
*     END;                                                         0149
*   ELSE                                                           0150
*     IF CHCLS=ZERO THEN                                           0150
         B     @RC00144                                            0150
@RF00144 L     @12,SAVEASCB(,STAEPTR)                              0150
         L     @12,ASCBCSCB(,@12)                                  0150
         CLC   CHCLS(8,@12),ZERO                                   0150
         BNE   @RF00150                                            0150
*       DO;                         /* IF NO NAME IN CSCB            */
*         STCNAME=STARTED;          /* PUT STC NAME IN MESSAGE       */
         MVC   STCNAME(13,MESSPTR),STARTED                         0152
*         BASEPTR=ADDR(BUILDA);     /* POINT TO MIDDLE OF MESSAGE    */
         LA    @12,BUILDA(,MESSPTR)                                0153
         ST    @12,BASEPTR                                         0153
*         MESLEN=MESLEN+LENGTH(STARTED);/* UPDATE THE LENGTH OF    0154
*                                      MESSAGE                       */
         LA    @12,13                                              0154
         AH    @12,MESLEN(,MESSPTR)                                0154
         STH   @12,MESLEN(,MESSPTR)                                0154
*       END;                                                       0155
*     ELSE                                                         0156
*       DO;                         /* IF CSCB PRESENT THE USE THE 0156
*                                      NAME IN IT                    */
         B     @RC00150                                            0156
@RF00150 DS    0H                                                  0157
*         TASKNAME=CHCLS;           /* PUT TASK NAME IN MESSAGE      */
         L     @12,SAVEASCB(,STAEPTR)                              0157
         L     @12,ASCBCSCB(,@12)                                  0157
         MVC   TASKNAME(8,MESSPTR),CHCLS(@12)                      0157
*         BASEPTR=ADDR(NEXT);       /* POINT TO MIDDLE OF MESSAGE    */
         LA    @12,NEXT(,MESSPTR)                                  0158
         ST    @12,BASEPTR                                         0158
*         MESLEN=MESLEN+LENGTH(CHCLS)+LENGTH(BLANK);/* UPDATE THE  0159
*                                      LENGTH                        */
         LA    @12,9                                               0159
         AH    @12,MESLEN(,MESSPTR)                                0159
         STH   @12,MESLEN(,MESSPTR)                                0159
*       END;                                                       0160
*   FAILAREA=FAILED;                /* PUT FAILED IN THE MESSAGE     */
@RC00150 DS    0H                                                  0161
@RC00144 L     @12,BASEPTR                                         0161
         MVC   FAILAREA(8,@12),FAILED                              0161
*   MESLEN=MESLEN+LENGTH(FAILED);   /* UPDATE THE MESSAGE LENGTH     */
*                                                                  0162
         LA    @06,8                                               0162
         AH    @06,MESLEN(,MESSPTR)                                0162
         STH   @06,MESLEN(,MESSPTR)                                0162
*   /*****************************************************************/
*   /*                                                               */
*   /* IF THE SVC DUMP WAS O.K THEN PUT DUMPED ON THE END OF THE     */
*   /* MESSAGE. THE STRUCTURE OF THE DECLARES HAS TO HAVE THE DUMPED */
*   /* WORD SPLIT IN TWO PARTS FOR EASE OF MOVING IT IN              */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0163
*   IF STAEDUMP='0'B THEN           /* IF SDUMP O.K. PUT DUMPED IN 0163
*                                      MESSAGE                       */
         TM    STAEDUMP(STAEPTR),B'01000000'                       0163
         BNZ   @RF00163                                            0163
*     DO;                                                          0164
*       TERMITA=TERMITEA;           /* MOVE TERMINTED AND DUM IN   0165
*                                      MESSAGE                       */
         MVC   TERMITA(15,@12),TERMITEA                            0165
*       MESLEN=MESLEN+LENGTH(PED)+LENGTH(TERMITEA);/* UPDATE LENGTH  */
         AH    @06,@CH01704                                        0166
         STH   @06,MESLEN(,MESSPTR)                                0166
*       PEDPART=PED;                /* PUT THE PED ON DUM FOR DUMPED */
         MVI   PEDPART+3(@12),C' '                                 0167
         MVC   PEDPART+4(3,@12),PEDPART+3(@12)                     0167
         MVC   PEDPART(3,@12),PED                                  0167
*       DESFGS=DESCDS;              /* MOVE IN THE DESCRIPTOR FLAGS  */
         MVC   DESFGS(2,@12),DESCDS                                0168
*       ROUFLGS=ROUTCDS;            /* MOVE IN THE ROUTING CODE      */
         MVC   ROUFLGS(2,@12),ROUTCDS                              0169
*     END;                                                         0170
*   ELSE                                                           0171
*     DO;                                                          0171
         B     @RC00163                                            0171
@RF00163 DS    0H                                                  0172
*       TERMITC=TERMITE;            /* MOVE IN TERMINATED            */
         L     @12,BASEPTR                                         0172
         MVC   TERMITC(10,@12),TERMITE                             0172
*       MESLEN=MESLEN+LENGTH(TERMITE);/* UPDATE MESSAGE LENGTH       */
         LA    @06,10                                              0173
         AH    @06,MESLEN(,MESSPTR)                                0173
         STH   @06,MESLEN(,MESSPTR)                                0173
*       DESCFGS=DESCDS;             /* MOVE IN THE DESCRIPTOR FLAGS  */
         MVC   DESCFGS(2,@12),DESCDS                               0174
*       ROUTFLGS=ROUTCDS;           /* MOVE IN THE ROUTDING CODES    */
         MVC   ROUTFLGS(2,@12),ROUTCDS                             0175
*     END;                                                         0176
*   R1=MESSPTR;                     /* POINT TO THE MESSAGE          */
@RC00163 LR    R1,MESSPTR                                          0177
*   GEN(WTO  MF=(E,(1)));           /* ISSUE THE WTO                 */
         WTO  MF=(E,(1))
*   END;                                                           0179
@EL00002 DS    0H                                                  0179
@EF00002 DS    0H                                                  0179
@ER00002 LM    @14,@12,12(@13)                                     0179
         BR    @14                                                 0179
*   RESPECIFY                                                      0180
*     ASCB BASED(ASCBPTR);          /* REBASE THE ASCB               */
*                                                                  0181
*   /*****************************************************************/
*   /*                                                               */
*   /* RETRY ROUTINE FOR STC, TERMINATE STC                          */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0181
*IEESB667:                                                         0181
*   PROC OPTIONS(DONTSAVE);                                        0181
IEESB667 DS    0H                                                  0182
*   GEN( BALR 15,0);                /* RESET ADDRESSING              */
          BALR 15,0
*   GEN( USING *,15);               /* FOR BRANCH IN XCTL            */
          USING *,15
*   R1=ASCBPTR;                                                    0184
         L     @12,CVTPTR                                          0184
         L     @12,CVTTCBP(,@12)                                   0184
         L     R1,ASCBPTR(,@12)                                    0184
*   GEN(XCTL EP=IEEPRTN);           /* XCTL TO END OF STC            */
         XCTL EP=IEEPRTN
*   GEN( DROP  15);                 /* DROP REG 15                   */
          DROP  15
*   END;                                                           0187
@EL00003 DS    0H                                                  0187
@EF00003 DS    0H                                                  0187
@ER00003 BR    @14                                                 0187
@PB00003 DS    0H                                                  0188
*   DCL                                                            0188
*     PATCHLOC FIXED(31)STATIC;                                    0188
*   GEN DATA DEFS(PATCHLOC);                                       0189
*   DECLARE                         /* GENERAL PURPOSE REGISTERS     */
*     GPR00P PTR(31)REG(0),                                        0190
*     GPR01P PTR(31)REG(1),                                        0190
*     GPR11P PTR(31)REG(11),                                       0190
*     GPR12P PTR(31)REG(12),                                       0190
*     GPR13P PTR(31)REG(13),                                       0190
*     GPR14P PTR(31)REG(14),                                       0190
*     GPR15P PTR(31)REG(15);                                       0190
*   DECLARE                         /* COMMON VARIABLES              */
*     I256C CHAR(256)BASED,                                        0191
*     I031F FIXED(31)BASED,                                        0191
*     I031P PTR(31)BASED,                                          0191
*     I015F FIXED(15)BASED,                                        0191
*     I015P PTR(15)BASED,                                          0191
*     I008P PTR(8)BASED,                                           0191
*     I001C CHAR(1)BASED;                                          0191
*   END                                                            0192
*                                                                  0192
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */
*/*%INCLUDE SYSLIB  (CVT     )                                       */
*/*%INCLUDE SYSLIB  (IHASDWA )                                       */
*/*%INCLUDE SYSLIB  (IHAASCB )                                       */
*/*%INCLUDE SYSLIB  (IEFPTRS )                                       */
*/*%INCLUDE SYSLIB  (IEECHAIN)                                       */
*/*%INCLUDE SYSLIB  (IHAPSA  )                                       */
*/*%INCLUDE SYSLIB  (IEEZB820)                                       */
*                                                                  0192
*       ;                                                          0192
@EL00001 L     @13,4(,@13)                                         0192
@EF00001 DS    0H                                                  0192
@ER00001 BR    @14                                                 0192
@DATA    DS    0H
@CH01661 DC    H'12'
@CH01592 DC    H'13'
@CH01704 DC    H'18'
@SM01708 MVC   SSDUMPC(0),SSDUMP
@SM01711 MVC   DEQCORE(0),DEQLIST
@DATD    DSECT
         DS    0F
@SA00001 DS    18F
IEESB665 CSECT
         DS    0F
@DATD    DSECT
         DS    0D
BASEPTR  DS    A
MESCORE  DS    CL55
IEESB665 CSECT
         DS    0F
@SIZDATD DC    AL1(230)
         DC    AL3(@ENDDATD-@DATD)
         DS    0D
SSMAJ    DC    CL8'SYSIEFSD'
SSMIN    DC    CL3'Q10'
IEE824I  DC    CL8'IEE824I '
STARTED  DC    CL13'STARTED TASK '
PED      DC    CL3'PED'
TERMITEA DC    CL15'TERMINATED, DUM'
TERMITE  DC    CL10'TERMINATED'
ZERO     DC    X'00'
         DC    XL7'0'
SB665    DC    CL24'                IEESB665'
FAILED   DC    CL8'FAILED, '
IEESB665 CSECT
LABEL1  WTO ' ',ROUTCDE=2,DESC=(4,6),MF=L
IEESB665 CSECT
SSDUMP SDUMP HDR='STARTED TASK CONTROL',SDATA=(SQA,PSA,LSQA,RGN,      **
               LPA,TRT,CSA,NUC),MF=L
SSLGH   EQU  *
SLSDUMP DC    A(SSLGH-SSDUMP)
@DATD    DSECT
SSDUMPC SDUMP HDR='STARTED TASK CONTROL',SDATA=(SQA,PSA,LSQA,RGN,     **
               LPA,TRT,CSA,NUC),MF=L
IEESB665 CSECT
DEQLIST ENQ  (SSMAJ,SSMIN,E,3,SYSTEM),RET=HAVE,MF=L
DEQLGTH  DC  A(*-DEQLIST)
@DATD    DSECT
DEQCORE ENQ  (SSMAJ,SSMIN,E,3,SYSTEM),RET=HAVE,MF=L
IEESB665 CSECT
         DS   0H
PATCHLOC DC ((@DATA-@PSTART)/20)X'00'
@DATD    DSECT
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA
@ENDDATD EQU   *
IEESB665 CSECT
@00      EQU   00                      EQUATES FOR REGISTERS 0-15
@01      EQU   01
@02      EQU   02
@03      EQU   03
@04      EQU   04
@05      EQU   05
@06      EQU   06
@07      EQU   07
@08      EQU   08
@09      EQU   09
@10      EQU   10
@11      EQU   11
@12      EQU   12
@13      EQU   13
@14      EQU   14
@15      EQU   15
MESSPTR  EQU   @03
STAEPTR  EQU   @04
CSCBPTR  EQU   @03
SDWAPTR  EQU   @02
R0       EQU   @00
R1       EQU   @01
R7       EQU   @07
R11      EQU   @11
R13      EQU   @13
R14      EQU   @14
R15      EQU   @15
GPR00P   EQU   @00
GPR01P   EQU   @01
GPR14P   EQU   @14
GPR15P   EQU   @15
GPR11P   EQU   @11
GPR12P   EQU   @12
GPR13P   EQU   @13
CVTPTR   EQU   16
PSA      EQU   0
FLCRNPSW EQU   PSA
FLCROPSW EQU   PSA+8
FLCICCW2 EQU   PSA+16
PSAEEPSW EQU   PSA+132
PSAESPSW EQU   PSA+136
FLCSVILC EQU   PSAESPSW+1
PSAEPPSW EQU   PSA+140
FLCPIILC EQU   PSAEPPSW+1
FLCPICOD EQU   PSAEPPSW+2
PSAPICOD EQU   FLCPICOD+1
FLCTEA   EQU   PSAEPPSW+4
FLCPER   EQU   PSA+152
FLCMCLA  EQU   PSA+168
FLCIOEL  EQU   FLCMCLA+4
FLCIOA   EQU   FLCMCLA+16
FLCFSA   EQU   FLCMCLA+80
PSASUPER EQU   PSA+552
PSASUP1  EQU   PSASUPER
PSASUP2  EQU   PSASUPER+1
PSASUP3  EQU   PSASUPER+2
PSASUP4  EQU   PSASUPER+3
PSACLHT  EQU   PSA+640
PSALKSA  EQU   PSA+696
PSAHLHI  EQU   PSA+760
PSALITA  EQU   PSA+764
PSADSSFL EQU   PSA+836
PSADSSF1 EQU   PSADSSFL
PSADSSF3 EQU   PSADSSFL+2
PSADSSF4 EQU   PSADSSFL+3
PSARSVT  EQU   PSA+896
CVTMAP   EQU   0
CVTTCBP  EQU   CVTMAP
CVTDAR   EQU   CVTMAP+72
CVTFLGS1 EQU   CVTDAR
CVTDCB   EQU   CVTMAP+116
CVTOPTA  EQU   CVTMAP+182
CVTOPTB  EQU   CVTMAP+183
CVTTSCVT EQU   CVTMAP+228
CVTTSFLG EQU   CVTTSCVT
CVTGTF   EQU   CVTMAP+236
CVTGTFST EQU   CVTGTF
CVTGTFS  EQU   CVTGTFST
CVTSTATE EQU   CVTGTFST
CVTTMODE EQU   CVTGTFST
CVTFORM  EQU   CVTGTFST
CVTUSR   EQU   CVTGTFST
CVTAQAVT EQU   CVTMAP+240
CVTTCMFG EQU   CVTAQAVT
CVTVOLM2 EQU   CVTMAP+244
CVTTATA  EQU   CVTVOLM2
CVTTSKS  EQU   CVTTATA
CVTVOLF2 EQU   CVTTSKS
CVTTAT   EQU   CVTTATA+1
CVTATER  EQU   CVTMAP+248
CVTEXT1  EQU   CVTMAP+252
CVTPURG  EQU   CVTMAP+260
CVTQMSG  EQU   CVTMAP+268
CVTDMSR  EQU   CVTMAP+272
CVTAPF   EQU   CVTMAP+324
CVTEXT2  EQU   CVTMAP+328
CVTHJES  EQU   CVTMAP+332
CVTPGSIA EQU   CVTMAP+348
CVTA1F1  EQU   CVTMAP+356
CVTSYSK  EQU   CVTMAP+357
CVTVOLM1 EQU   CVTMAP+380
CVTVOLF1 EQU   CVTVOLM1
CVTATMCT EQU   CVTMAP+388
CVTXTNT1 EQU   0
CVTXTNT2 EQU   0
CVTDSSV  EQU   CVTXTNT2
CVTRSV90 EQU   CVTXTNT2+5
CVTQID   EQU   CVTXTNT2+24
CVTRV400 EQU   CVTXTNT2+52
CVTRV409 EQU   CVTXTNT2+53
CVTATCVT EQU   CVTXTNT2+64
CVTRV429 EQU   CVTXTNT2+84
CVTRV438 EQU   CVTXTNT2+85
CVTRV457 EQU   CVTXTNT2+112
CVTRV466 EQU   CVTXTNT2+113
CVTFIX   EQU   0
CVTRELNO EQU   CVTFIX+252
SDWA     EQU   0
SDWAPARM EQU   SDWA
SDWAFIOB EQU   SDWA+4
SDWAABCC EQU   SDWAFIOB
SDWACMPF EQU   SDWAABCC
SDWACTL1 EQU   SDWA+8
SDWACMKA EQU   SDWACTL1
SDWAMWPA EQU   SDWACTL1+1
SDWAPMKA EQU   SDWACTL1+4
SDWACTL2 EQU   SDWA+16
SDWACMKP EQU   SDWACTL2
SDWAMWPP EQU   SDWACTL2+1
SDWAPMKP EQU   SDWACTL2+4
SDWAGRSV EQU   SDWA+24
SDWANAME EQU   SDWA+88
SDWAEC1  EQU   SDWA+104
SDWAEMK1 EQU   SDWAEC1
SDWAMWP1 EQU   SDWAEC1+1
SDWAINT1 EQU   SDWAEC1+2
SDWANXT1 EQU   SDWAEC1+4
SDWAAEC1 EQU   SDWA+112
SDWAILC1 EQU   SDWAAEC1+1
SDWAINC1 EQU   SDWAAEC1+2
SDWAICD1 EQU   SDWAINC1+1
SDWAEC2  EQU   SDWA+120
SDWAEMK2 EQU   SDWAEC2
SDWAMWP2 EQU   SDWAEC2+1
SDWAINT2 EQU   SDWAEC2+2
SDWANXT2 EQU   SDWAEC2+4
SDWAAEC2 EQU   SDWA+128
SDWAILC2 EQU   SDWAAEC2+1
SDWAINC2 EQU   SDWAAEC2+2
SDWAICD2 EQU   SDWAINC2+1
SDWASRSV EQU   SDWA+136
SDWAIDNT EQU   SDWA+200
SDWAMCH  EQU   SDWA+204
SDWASTCK EQU   SDWAMCH
SDWAMCHI EQU   SDWAMCH+8
SDWAMCHS EQU   SDWAMCHI
SDWAMCHD EQU   SDWAMCHI+1
SDWARSR1 EQU   SDWAMCH+12
SDWARSR2 EQU   SDWAMCH+13
SDWAFLGS EQU   SDWA+232
SDWAERRA EQU   SDWAFLGS
SDWAERRB EQU   SDWAFLGS+1
SDWAERRC EQU   SDWAFLGS+2
SDWAPERC EQU   SDWAERRC
SDWAERRD EQU   SDWAFLGS+3
SDWAIOFS EQU   SDWA+238
SDWARTYA EQU   SDWA+240
SDWAPARQ EQU   SDWA+252
SDWARCDE EQU   SDWAPARQ
SDWAACF2 EQU   SDWAPARQ+1
SDWARCRD EQU   SDWAACF2
SDWAFREE EQU   SDWAACF2
SDWAACF3 EQU   SDWAPARQ+2
SDWAACF4 EQU   SDWAPARQ+3
SDWALKWA EQU   SDWA+256
SDWALKWS EQU   SDWALKWA
SDWARECP EQU   SDWA+292
SDWASNPA EQU   SDWA+320
SDWADUMP EQU   SDWASNPA
SDWADPFS EQU   SDWADUMP+1
SDWADDAT EQU   SDWASNPA+4
SDWASDAT EQU   SDWADDAT
SDWAPDAT EQU   SDWADDAT+2
SDWADPSA EQU   SDWA+328
SDWADPSL EQU   SDWADPSA
SDWARA   EQU   SDWA+400
SDWADPVA EQU   SDWARA+2
ASCB     EQU   0
ASCBCSCB EQU   ASCB+56
ASCBFW1  EQU   ASCB+100
ASCBRCTF EQU   ASCBFW1+2
ASCBFLG1 EQU   ASCBFW1+3
ASCBDSP1 EQU   ASCB+114
ASCBFLG2 EQU   ASCB+115
ASCBJBNS EQU   ASCB+176
TCBASCB  EQU   0
ASCBPTR  EQU   TCBASCB+12
CHAIN    EQU   0
CHFLG    EQU   CHAIN+4
CHSTS    EQU   CHFLG+2
CHDL     EQU   CHSTS
CHFC     EQU   CHSTS
CHACT    EQU   CHFLG+3
CHKEY    EQU   CHAIN+8
CHCLS    EQU   CHAIN+16
CHPKE    EQU   CHAIN+28
CHTJID   EQU   CHAIN+30
CHACT1   EQU   CHAIN+35
CHASM    EQU   CHAIN+40
CHCIBP   EQU   CHASM+4
CHRGNSZ  EQU   CHASM+8
CHSHORT  EQU   CHASM+24
CHSWT    EQU   CHSHORT
STAELST  EQU   0
JSWAADDR EQU   STAELST
SAVEASCB EQU   JSWAADDR
PARMINFO EQU   STAELST+4
@NM00078 EQU   STAELST+8
STAEFLG  EQU   @NM00078
STAERTY  EQU   STAEFLG
STAEDUMP EQU   STAEFLG
MESAREA  EQU   0
MESLEN   EQU   MESAREA
MESFLGS  EQU   MESAREA+2
MESSAGE  EQU   MESAREA+4
MESID    EQU   MESSAGE
STCNAME  EQU   MESSAGE+8
TASKNAME EQU   STCNAME
BLANK    EQU   STCNAME+8
NEXT     EQU   STCNAME+9
BUILDA   EQU   MESSAGE+21
DUMPTERM EQU   0
FAILAREA EQU   DUMPTERM
DUMPAREA EQU   DUMPTERM+8
TERMITA  EQU   DUMPAREA
TERMITB  EQU   TERMITA
TERMITC  EQU   TERMITB
DESCFGS  EQU   TERMITB+10
ROUTFLGS EQU   TERMITB+12
PEDPART  EQU   DUMPAREA+15
DESFGS   EQU   PEDPART+3
ROUFLGS  EQU   PEDPART+5
I256C    EQU   0
I001C    EQU   0
I008P    EQU   0
I015F    EQU   0
I015P    EQU   0
I031F    EQU   0
I031P    EQU   0
CVTS01   EQU   CVTPGSIA
CVTLPDIA EQU   CVTS01+12
CVTDIRST EQU   CVTLPDIA
CVTSLIDA EQU   CVTS01+24
CVTCTLFG EQU   CVTS01+50
CVTRV100 EQU   CVTS01+116
CVTRV109 EQU   CVTS01+117
CVTRV118 EQU   CVTS01+118
CVTRV127 EQU   CVTS01+119
CVTRV210 EQU   CVTS01+424
CVTRV219 EQU   CVTS01+425
CVTRV228 EQU   CVTS01+426
CVTRV237 EQU   CVTS01+427
CVTMFRTR EQU   CVTS01+452
CVTRV262 EQU   CVTS01+468
CVTRV271 EQU   CVTS01+469
CVTRV280 EQU   CVTS01+470
CVTRV289 EQU   CVTS01+471
CVTGSDA  EQU   CVTS01+600
CHAINS01 EQU   CHASM
CHTYPE   EQU   CHAINS01+124
CHTRSTAT EQU   CHAINS01+125
CHCSYSO  EQU   CHAINS01+134
PSARSVTE EQU   PSARSVT
WTOMAP   EQU   LABEL1
MCSFLGS  EQU   WTOMAP+2
DESCDS   EQU   WTOMAP+5
ROUTCDS  EQU   WTOMAP+7
FLC      EQU   PSA
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS
@NM00083 EQU   WTOMAP+4
@NM00082 EQU   WTOMAP
PSARSAV  EQU   PSARSVTE+60
PSARSTK  EQU   PSARSVTE+56
PSAESAV3 EQU   PSARSVTE+52
PSAESTK3 EQU   PSARSVTE+48
PSAESAV2 EQU   PSARSVTE+44
PSAESTK2 EQU   PSARSVTE+40
PSAESAV1 EQU   PSARSVTE+36
PSAESTK1 EQU   PSARSVTE+32
PSAPSAV  EQU   PSARSVTE+28
PSAPSTK  EQU   PSARSVTE+24
PSAMSAV  EQU   PSARSVTE+20
PSAMSTK  EQU   PSARSVTE+16
PSASSAV  EQU   PSARSVTE+12
PSASSTK  EQU   PSARSVTE+8
PSANSTK  EQU   PSARSVTE+4
PSACSTK  EQU   PSARSVTE
CHLAST   EQU   CHAINS01+136
CHSPA    EQU   CHAINS01+135
CHUSERID EQU   CHCSYSO
CHJB     EQU   CHCSYSO
CHDUMP   EQU   CHCSYSO
CHQUE    EQU   CHCSYSO
CHHOLD   EQU   CHCSYSO
CHOUT    EQU   CHCSYSO
CHINN    EQU   CHCSYSO
CHALL    EQU   CHCSYSO
CHINC    EQU   CHAINS01+132
CHPEND   EQU   CHAINS01+128
CHARID   EQU   CHAINS01+127
CHCNID   EQU   CHAINS01+126
@NM00053 EQU   CHTRSTAT
CHTSL    EQU   CHTRSTAT
CHTS     EQU   CHTRSTAT
CHINITL  EQU   CHTRSTAT
CHINIT   EQU   CHTRSTAT
CHJOBSL  EQU   CHTRSTAT
CHJOBS   EQU   CHTRSTAT
CHDEF    EQU   CHTYPE
CHHIAR   EQU   CHTYPE
CHARSV29 EQU   CHTYPE
CHARSV28 EQU   CHTYPE
CHARSV27 EQU   CHTYPE
CHARSV26 EQU   CHTYPE
CHARSV25 EQU   CHTYPE
CHDSTAT  EQU   CHTYPE
CHBUF    EQU   CHAINS01
CVTTPIO  EQU   CVTS01+608
CVTADV   EQU   CVTS01+604
CVTGSDAB EQU   CVTGSDA
CVTQV3   EQU   CVTS01+596
CVTQV2   EQU   CVTS01+592
CVTQV1   EQU   CVTS01+588
CVTRPT   EQU   CVTS01+584
CVTSSRB  EQU   CVTS01+580
CVTCSDRL EQU   CVTS01+576
CVTEXP1  EQU   CVTS01+572
CVTRMPMT EQU   CVTS01+568
CVTRMPTT EQU   CVTS01+564
CVTVPSA  EQU   CVTS01+560
CVTVSTOP EQU   CVTS01+556
CVTGTFR8 EQU   CVTS01+552
CVTQUIT  EQU   CVTS01+548
CVTVACR  EQU   CVTS01+544
CVTWTCB  EQU   CVTS01+540
CVTSTPRS EQU   CVTS01+536
CVT0PT02 EQU   CVTS01+532
CVTDARCM EQU   CVTS01+528
CVTIRECM EQU   CVTS01+524
CVTJRECM EQU   CVTS01+520
CVTVEMS0 EQU   CVTS01+516
CVTSPFRR EQU   CVTS01+512
CVTRLSTG EQU   CVTS01+508
CVT0TC0A EQU   CVTS01+504
CVTGMBR  EQU   CVTS01+500
CVTLFRM  EQU   CVTS01+496
CVTRMBR  EQU   CVTS01+492
CVTVIOP  EQU   CVTS01+488
CVTRV307 EQU   CVTS01+486
CVTRV306 EQU   CVTS01+484
CVTRV305 EQU   CVTS01+482
CVTRV304 EQU   CVTS01+480
CVTRV303 EQU   CVTS01+478
CVTRV302 EQU   CVTS01+476
CVTRV301 EQU   CVTS01+475
CVTRV300 EQU   CVTS01+474
CVTRV299 EQU   CVTS01+473
CVTRV298 EQU   CVTS01+472
CVTRV297 EQU   CVTRV289
CVTRV296 EQU   CVTRV289
CVTRV295 EQU   CVTRV289
CVTRV294 EQU   CVTRV289
CVTRV293 EQU   CVTRV289
CVTRV292 EQU   CVTRV289
CVTRV291 EQU   CVTRV289
CVTRV290 EQU   CVTRV289
CVTRV288 EQU   CVTRV280
CVTRV287 EQU   CVTRV280
CVTRV286 EQU   CVTRV280
CVTRV285 EQU   CVTRV280
CVTRV284 EQU   CVTRV280
CVTRV283 EQU   CVTRV280
CVTRV282 EQU   CVTRV280
CVTRV281 EQU   CVTRV280
CVTRV279 EQU   CVTRV271
CVTRV278 EQU   CVTRV271
CVTRV277 EQU   CVTRV271
CVTRV276 EQU   CVTRV271
CVTRV275 EQU   CVTRV271
CVTRV274 EQU   CVTRV271
CVTRV273 EQU   CVTRV271
CVTRV272 EQU   CVTRV271
CVTRV270 EQU   CVTRV262
CVTRV269 EQU   CVTRV262
CVTRV268 EQU   CVTRV262
CVTRV267 EQU   CVTRV262
CVTRV266 EQU   CVTRV262
CVTRV265 EQU   CVTRV262
CVTRV264 EQU   CVTRV262
CVTRV263 EQU   CVTRV262
CVTVFP   EQU   CVTS01+464
CVTVSI   EQU   CVTS01+460
CVTVPSIB EQU   CVTS01+456
CVTMFACT EQU   CVTMFRTR
CVTMFCTL EQU   CVTS01+448
CVTPVBP  EQU   CVTS01+444
CVTPWI   EQU   CVTS01+440
CVTRV254 EQU   CVTS01+438
CVTRV253 EQU   CVTS01+436
CVTRV252 EQU   CVTS01+434
CVTRV251 EQU   CVTS01+433
CVTRV250 EQU   CVTS01+432
CVTRV249 EQU   CVTS01+431
CVTRV248 EQU   CVTS01+430
CVTRV247 EQU   CVTS01+429
CVTRV246 EQU   CVTS01+428
CVTRV245 EQU   CVTRV237
CVTRV244 EQU   CVTRV237
CVTRV243 EQU   CVTRV237
CVTRV242 EQU   CVTRV237
CVTRV241 EQU   CVTRV237
CVTRV240 EQU   CVTRV237
CVTRV239 EQU   CVTRV237
CVTRV238 EQU   CVTRV237
CVTRV236 EQU   CVTRV228
CVTRV235 EQU   CVTRV228
CVTRV234 EQU   CVTRV228
CVTRV233 EQU   CVTRV228
CVTRV232 EQU   CVTRV228
CVTRV231 EQU   CVTRV228
CVTRV230 EQU   CVTRV228
CVTRV229 EQU   CVTRV228
CVTRV227 EQU   CVTRV219
CVTRV226 EQU   CVTRV219
CVTRV225 EQU   CVTRV219
CVTRV224 EQU   CVTRV219
CVTRV223 EQU   CVTRV219
CVTRV222 EQU   CVTRV219
CVTRV221 EQU   CVTRV219
CVTRV220 EQU   CVTRV219
CVTRV218 EQU   CVTRV210
CVTRV217 EQU   CVTRV210
CVTRV216 EQU   CVTRV210
CVTRV215 EQU   CVTRV210
CVTRV214 EQU   CVTRV210
CVTRV213 EQU   CVTRV210
CVTRV212 EQU   CVTRV210
CVTRV211 EQU   CVTRV210
CVTLCCAT EQU   CVTS01+420
CVTPCCAT EQU   CVTS01+416
CVTIPCRP EQU   CVTS01+412
CVTIPCRI EQU   CVTS01+408
CVTIPCDS EQU   CVTS01+404
CVTAIDVT EQU   CVTS01+400
CVTSSAP  EQU   CVTS01+396
CVTRV202 EQU   CVTS01+394
CVTRV201 EQU   CVTS01+392
CVTRV200 EQU   CVTS01+390
CVTRV199 EQU   CVTS01+388
CVTRV198 EQU   CVTS01+386
CVTRV197 EQU   CVTS01+384
CVTRV196 EQU   CVTS01+383
CVTRV195 EQU   CVTS01+382
CVTRV194 EQU   CVTS01+381
CVTRV193 EQU   CVTS01+380
CVT044R2 EQU   CVTS01+376
CVTFETCH EQU   CVTS01+372
CVTRSTWD EQU   CVTS01+368
CVTSPOST EQU   CVTS01+364
CVTIOBP  EQU   CVTS01+360
CVTASMVT EQU   CVTS01+356
CVTRECRQ EQU   CVTS01+352
CVTWSAC  EQU   CVTS01+348
CVTWSAG  EQU   CVTS01+344
CVTWSAL  EQU   CVTS01+340
CVTSPSA  EQU   CVTS01+336
CVTGLMN  EQU   CVTS01+332
CVTVEAC0 EQU   CVTS01+328
CVT062R1 EQU   CVTS01+324
CVTRPOST EQU   CVTS01+320
CVTDQIQE EQU   CVTS01+316
CVTCSD   EQU   CVTS01+312
CVTLKRMA EQU   CVTS01+308
CVTRSPIE EQU   CVTS01+304
CVTRENQ  EQU   CVTS01+300
CVTLQCB  EQU   CVTS01+296
CVTFQCB  EQU   CVTS01+292
CVTQCS01 EQU   CVTS01+288
CVTAPFT  EQU   CVTS01+284
CVTPARRL EQU   CVTS01+280
CVTVWAIT EQU   CVTS01+276
CVTGSPL  EQU   CVTS01+272
CVTLSMQ  EQU   CVTS01+268
CVTGSMQ  EQU   CVTS01+264
CVTEXPRO EQU   CVTS01+260
CVTOPCTP EQU   CVTS01+256
CVTSIC   EQU   CVTS01+252
CVTTPIOS EQU   CVTS01+248
CVTRTMS  EQU   CVTS01+244
CVTSDBF  EQU   CVTS01+240
CVTSCBP  EQU   CVTS01+236
CVTSDMP  EQU   CVTS01+232
CVTSV60  EQU   CVTS01+228
CVTRTMCT EQU   CVTS01+224
CVTASCBL EQU   CVTS01+220
CVTASCBH EQU   CVTS01+216
CVTGDA   EQU   CVTS01+212
CVTASVT  EQU   CVTS01+208
CVTVVMDI EQU   CVTS01+204
CVTAQTOP EQU   CVTS01+200
CVTIOSCS EQU   CVTS01+196
CVTSDRM  EQU   CVTS01+192
CVTOPTE  EQU   CVTS01+188
CVTSTXU  EQU   CVTS01+184
CVTQUIS  EQU   CVTS01+180
CVTQREC  EQU   CVTS01+176
CVTS1EE  EQU   CVTS01+172
CVTFRAS  EQU   CVTS01+168
CVTQSAS  EQU   CVTS01+164
CVTCRAS  EQU   CVTS01+160
CVTCRMN  EQU   CVTS01+156
CVTDELCP EQU   CVTS01+152
CVTFRECL EQU   CVTS01+148
CVTGETCL EQU   CVTS01+144
CVTBLDCP EQU   CVTS01+140
CVTAUTHL EQU   CVTS01+136
CVTRV146 EQU   CVTS01+134
CVTRV145 EQU   CVTS01+132
CVTRV144 EQU   CVTS01+130
CVTMAXMP EQU   CVTS01+128
CVTRV142 EQU   CVTS01+126
CVTRV141 EQU   CVTS01+125
CVTRV140 EQU   CVTS01+124
CVTRV139 EQU   CVTS01+123
CVTDSSAC EQU   CVTS01+122
CVTRV513 EQU   CVTS01+121
CVTIOSPL EQU   CVTS01+120
CVTRV135 EQU   CVTRV127
CVTRV134 EQU   CVTRV127
CVTRV133 EQU   CVTRV127
CVTRV132 EQU   CVTRV127
CVTRV131 EQU   CVTRV127
CVTRV130 EQU   CVTRV127
CVTRV129 EQU   CVTRV127
CVTRV128 EQU   CVTRV127
CVTRV126 EQU   CVTRV118
CVTRV125 EQU   CVTRV118
CVTRV124 EQU   CVTRV118
CVTRV123 EQU   CVTRV118
CVTRV122 EQU   CVTRV118
CVTRV121 EQU   CVTRV118
CVTRV120 EQU   CVTRV118
CVTRV119 EQU   CVTRV118
CVTRV117 EQU   CVTRV109
CVTRV116 EQU   CVTRV109
CVTRV115 EQU   CVTRV109
CVTRV114 EQU   CVTRV109
CVTRV113 EQU   CVTRV109
CVTRV112 EQU   CVTRV109
CVTRV111 EQU   CVTRV109
CVTRV110 EQU   CVTRV109
CVTRV108 EQU   CVTRV100
CVTRV107 EQU   CVTRV100
CVTRV106 EQU   CVTRV100
CVTRV105 EQU   CVTRV100
CVTRV104 EQU   CVTRV100
CVTRV103 EQU   CVTRV100
CVTRV102 EQU   CVTRV100
CVTRV101 EQU   CVTRV100
CVTCSPIE EQU   CVTS01+112
CVTSMFEX EQU   CVTS01+108
CVTOLT0A EQU   CVTS01+104
CVTSRBRT EQU   CVTS01+100
CVTRSV82 EQU   CVTS01+98
CVTRSV81 EQU   CVTS01+96
CVTSYSWT EQU   CVTS01+92
CVTRV327 EQU   CVTS01+88
CVTRV326 EQU   CVTS01+84
CVTRV325 EQU   CVTS01+80
CVTRV324 EQU   CVTS01+76
CVT0VL01 EQU   CVTS01+72
CVTSHRVM EQU   CVTS01+68
CVTRV332 EQU   CVTS01+64
CVTTAS   EQU   CVTS01+60
CVTRSCN  EQU   CVTS01+56
CVTTRAC2 EQU   CVTS01+54
CVTTRACE EQU   CVTS01+52
CVTAPG   EQU   CVTS01+51
CVTSDTRC EQU   CVTCTLFG
CVTGTRCE EQU   CVTCTLFG
CVTNOMP  EQU   CVTCTLFG
CVTRSV79 EQU   CVTCTLFG
CVTDSTAT EQU   CVTCTLFG
CVTRSV78 EQU   CVTCTLFG
CVTRV333 EQU   CVTCTLFG
CVTRV323 EQU   CVTCTLFG
CVTSPVLK EQU   CVTS01+49
CVTRSV77 EQU   CVTS01+48
CVTRV331 EQU   CVTS01+44
CVTRV330 EQU   CVTS01+40
CVTRV329 EQU   CVTS01+36
CVTRV328 EQU   CVTS01+32
CVTRV322 EQU   CVTS01+28
CVTSLID  EQU   CVTSLIDA+1
CVTSYLK  EQU   CVTSLIDA
CVTRV321 EQU   CVTS01+20
CVTRV320 EQU   CVTS01+16
CVTLPDIR EQU   CVTLPDIA+1
CVTRSV69 EQU   CVTDIRST
CVTRSV68 EQU   CVTDIRST
CVTRSV67 EQU   CVTDIRST
CVTRSV66 EQU   CVTDIRST
CVTRSV65 EQU   CVTDIRST
CVTRSV64 EQU   CVTDIRST
CVTRSV63 EQU   CVTDIRST
CVTDICOM EQU   CVTDIRST
CVTPVTP  EQU   CVTS01+8
CVTLPDSR EQU   CVTS01+4
CVTRSVA2 EQU   CVTS01
PEDDED   EQU   PEDPART
@NM00081 EQU   TERMITA+14
RETSAVE  EQU   STAELST+12
@NM00080 EQU   @NM00078+1
@NM00079 EQU   STAEFLG
SUPOOL   EQU   PARMINFO+1
SUBNUM   EQU   PARMINFO
CHARSV16 EQU   CHSHORT+108
CHARSV15 EQU   CHSHORT+104
CHJSCBVS EQU   CHSHORT+100
CHUSCVS  EQU   CHSHORT+96
@NM00052 EQU   CHSHORT+92
@NM00051 EQU   CHSHORT+88
CHSQA    EQU   CHSHORT+52
CHQPA    EQU   CHSHORT+16
CHJCL    EQU   CHSHORT+12
CHSPC    EQU   CHSHORT+8
CHSPB    EQU   CHSHORT+4
CHTCB    EQU   CHSHORT+1
CHARSV23 EQU   CHSWT
CHARSV22 EQU   CHSWT
CHARSV21 EQU   CHSWT
CHAC     EQU   CHSWT
CHPSF    EQU   CHSWT
CHPSD    EQU   CHSWT
CHJCT    EQU   CHSWT
CHARSV20 EQU   CHSWT
CHCECB   EQU   CHASM+20
CHECB    EQU   CHASM+16
CHRGNAD  EQU   CHASM+12
CHARSV18 EQU   CHRGNSZ+1
CHRPRTY  EQU   CHRGNSZ
@NM00050 EQU   CHCIBP
CHEND    EQU   CHCIBP
CHECBP   EQU   CHASM
CHDER    EQU   CHAIN+36
CHARSV10 EQU   CHACT1
CHARSV09 EQU   CHACT1
CHARSV08 EQU   CHACT1
CHARSV07 EQU   CHACT1
CHARSV06 EQU   CHACT1
CHARSV05 EQU   CHACT1
CHARSV04 EQU   CHACT1
CHRDWTR  EQU   CHACT1
CHARSV30 EQU   CHAIN+34
CHQID    EQU   CHAIN+32
CHASID   EQU   CHTJID
CHUCMP   EQU   CHAIN+29
CHTRKID  EQU   CHPKE
CHCIBCTR EQU   CHAIN+27
CHUNIT   EQU   CHAIN+24
CHPARM   EQU   CHKEY
CHIFY    EQU   CHACT
CHAIFX   EQU   CHACT
CHCLD    EQU   CHACT
CHCL     EQU   CHACT
CHDSI    EQU   CHACT
CHDISC   EQU   CHACT
CHTERM   EQU   CHACT
CHSWAP   EQU   CHACT
CHABTERM EQU   CHSTS
CHAD     EQU   CHSTS
CHQSPC   EQU   CHSTS
CHSOUT   EQU   CHSTS
CHSYS    EQU   CHSTS
CHAP     EQU   CHSTS
CHSZE    EQU   CHFLG+1
CHVCD    EQU   CHFLG
CHPTR    EQU   CHAIN
ASCBNEXT EQU   TCBASCB+8
TCBPTR   EQU   TCBASCB+4
TCBNEXT  EQU   TCBASCB
ASCBEND  EQU   ASCB+208
ASCBSRBT EQU   ASCB+200
ASCBSWTL EQU   ASCB+196
ASCBRS14 EQU   ASCB+195
ASCBSMCT EQU   ASCB+194
ASCBRS12 EQU   ASCB+192
ASCBPCTT EQU   ASCB+188
ASCBVGTT EQU   ASCB+184
ASCBLGCB EQU   ASCB+180
ASCBJBNI EQU   ASCB+172
ASCBMCC  EQU   ASCB+168
ASCBRTWA EQU   ASCB+164
ASCBIQEA EQU   ASCB+160
ASCBXMPQ EQU   ASCB+156
ASCBRS01 EQU   ASCB+154
ASCBFMCT EQU   ASCB+152
ASCBOUXB EQU   ASCB+148
ASCBOUCB EQU   ASCB+144
ASCBMECB EQU   ASCB+140
ASCBQECB EQU   ASCB+136
ASCBCMSB EQU   ASCB+132
ASCBCMSF EQU   ASCB+128
ASCBTCBS EQU   ASCB+124
ASCBNVSC EQU   ASCB+122
ASCBVSC  EQU   ASCB+120
ASCBSRBS EQU   ASCB+118
ASCBSSRB EQU   ASCB+116
ASCBRV06 EQU   ASCBFLG2
ASCBRV05 EQU   ASCBFLG2
ASCBRV04 EQU   ASCBFLG2
ASCBSNQS EQU   ASCBFLG2
ASCBS2S  EQU   ASCBFLG2
ASCBCEXT EQU   ASCBFLG2
ASCBPXMT EQU   ASCBFLG2
ASCBXMPT EQU   ASCBFLG2
ASCBRF07 EQU   ASCBDSP1
ASCBRF06 EQU   ASCBDSP1
ASCBRF05 EQU   ASCBDSP1
ASCBRF04 EQU   ASCBDSP1
ASCBRF03 EQU   ASCBDSP1
ASCBRF02 EQU   ASCBDSP1
ASCBFAIL EQU   ASCBDSP1
ASCBNOQ  EQU   ASCBDSP1
ASCBSWCT EQU   ASCB+112
ASCBASXB EQU   ASCB+108
ASCBTMCH EQU   ASCB+104
ASCBNSWP EQU   ASCBFLG1
ASCBTYP1 EQU   ASCBFLG1
ASCBSTND EQU   ASCBFLG1
ASCBABNT EQU   ASCBFLG1
ASCBTERM EQU   ASCBFLG1
ASCBS3S  EQU   ASCBFLG1
ASCBCMSH EQU   ASCBFLG1
ASCBTOFF EQU   ASCBFLG1
ASCBRF01 EQU   ASCBRCTF
ASCBTMLW EQU   ASCBRCTF
ASCBOUT  EQU   ASCBRCTF
ASCBWAIT EQU   ASCBRCTF
ASCBFND  EQU   ASCBRCTF
ASCBFQU  EQU   ASCBRCTF
ASCBFRS  EQU   ASCBRCTF
ASCBTMNO EQU   ASCBRCTF
ASCBAFFN EQU   ASCBFW1
ASCBDUMP EQU   ASCB+96
ASCBQSVC EQU   ASCB+92
ASCBUBET EQU   ASCB+88
ASCBECB  EQU   ASCB+84
ASCBJSTL EQU   ASCB+80
ASCBEWST EQU   ASCB+72
ASCBEJST EQU   ASCB+64
ASCBTSB  EQU   ASCB+60
ASCBRSM  EQU   ASCB+52
ASCBLDA  EQU   ASCB+48
ASCBSTOR EQU   ASCB+44
ASCBDP   EQU   ASCB+43
ASCBRV07 EQU   ASCB+42
ASCBIOSM EQU   ASCB+40
ASCBSEQN EQU   ASCB+38
ASCBASID EQU   ASCB+36
ASCBCPUS EQU   ASCB+32
ASCBSPL  EQU   ASCB+28
ASCBLSLQ EQU   ASCB+24
ASCBFSLQ EQU   ASCB+20
ASCBIOSP EQU   ASCB+16
ASCBLOCK EQU   ASCB+12
ASCBBWDP EQU   ASCB+8
ASCBFWDP EQU   ASCB+4
ASCBASCB EQU   ASCB
ASCBEGIN EQU   ASCB
@NM00049 EQU   SDWA+512
SDWAVRA  EQU   SDWARA+4
SDWAURAL EQU   SDWARA+3
@NM00048 EQU   SDWADPVA
SDWAEBC  EQU   SDWADPVA
SDWAHEX  EQU   SDWADPVA
SDWAVRAL EQU   SDWARA
@NM00047 EQU   SDWA+396
SDWACOMP EQU   SDWA+392
SDWARCPL EQU   SDWA+364
@NM00046 EQU   SDWADPSA+32
SDWATO4  EQU   SDWADPSL+28
SDWAFRM4 EQU   SDWADPSL+24
SDWATO3  EQU   SDWADPSL+20
SDWAFRM3 EQU   SDWADPSL+16
SDWATO2  EQU   SDWADPSL+12
SDWAFRM2 EQU   SDWADPSL+8
SDWATO1  EQU   SDWADPSL+4
SDWAFRM1 EQU   SDWADPSL
@NM00045 EQU   SDWADDAT+3
@NM00044 EQU   SDWAPDAT
SDWAUSPL EQU   SDWAPDAT
SDWADPSW EQU   SDWAPDAT
SDWATJPA EQU   SDWAPDAT
SDWATLPA EQU   SDWAPDAT
SDWADREG EQU   SDWAPDAT
SDWADSAH EQU   SDWAPDAT
SDWADSAS EQU   SDWAPDAT
@NM00043 EQU   SDWADDAT+1
@NM00042 EQU   SDWASDAT
SDWAQQS  EQU   SDWASDAT
SDWACBS  EQU   SDWASDAT
SDWAGTF  EQU   SDWASDAT
SDWASWA  EQU   SDWASDAT
SDWALSQA EQU   SDWASDAT
SDWASQA  EQU   SDWASDAT
SDWANUC  EQU   SDWASDAT
@NM00041 EQU   SDWADUMP+2
@NM00040 EQU   SDWADPFS
SDWASLST EQU   SDWADPFS
@NM00039 EQU   SDWADPFS
SDWADLST EQU   SDWADPFS
SDWADPT  EQU   SDWADPFS
SDWADPID EQU   SDWADUMP
SDWADPLA EQU   SDWA+316
SDWAREXN EQU   SDWARECP+16
SDWACSCT EQU   SDWARECP+8
SDWAMODN EQU   SDWARECP
@NM00038 EQU   SDWALKWA+32
SDWATALW EQU   SDWALKWS+28
SDWATDLW EQU   SDWALKWS+24
SDWATNLW EQU   SDWALKWS+20
SDWAAPLW EQU   SDWALKWS+16
SDWAIPLW EQU   SDWALKWS+12
SDWAILLW EQU   SDWALKWS+8
SDWAIULW EQU   SDWALKWS+4
SDWAICLW EQU   SDWALKWS
SDWAFLLK EQU   SDWAACF4
SDWACMS  EQU   SDWAACF4
SDWAOPTM EQU   SDWAACF4
SDWATADB EQU   SDWAACF4
SDWATDNB EQU   SDWAACF4
SDWATNCB EQU   SDWAACF4
SDWAILCH EQU   SDWAACF4
SDWAIUCB EQU   SDWAACF4
SDWAICAT EQU   SDWAACF3
SDWAIPRG EQU   SDWAACF3
SDWASALL EQU   SDWAACF3
SDWAASMP EQU   SDWAACF3
SDWADISP EQU   SDWAACF3
@NM00037 EQU   SDWAACF3
@NM00036 EQU   SDWAACF2
SDWAUPRG EQU   SDWAACF2
@NM00035 EQU   SDWAACF2
SDWASPIN EQU   SDWAACF2
@NM00034 EQU   SDWAACF2
SDWACPUA EQU   SDWA+248
SDWARECA EQU   SDWA+244
@NM00033 EQU   SDWA+239
@NM00032 EQU   SDWAIOFS
SDWANIOP EQU   SDWAIOFS
SDWANOIO EQU   SDWAIOFS
SDWAIOHT EQU   SDWAIOFS
SDWAIOQR EQU   SDWAIOFS
SDWAFMID EQU   SDWA+236
@NM00031 EQU   SDWAERRD
SDWAMCIV EQU   SDWAERRD
SDWARPIV EQU   SDWAERRD
SDWAMABD EQU   SDWAERRD
SDWACTS  EQU   SDWAERRD
SDWASTAE EQU   SDWAERRD
SDWANRBE EQU   SDWAERRD
SDWACLUP EQU   SDWAERRD
@NM00030 EQU   SDWAERRC
SDWAEAS  EQU   SDWAERRC
SDWAIRB  EQU   SDWAERRC
SDWASTAI EQU   SDWAERRC
SDWASTAF EQU   SDWAERRC
SDWASRBM EQU   SDWAERRB
SDWALDIS EQU   SDWAERRB
SDWAENRB EQU   SDWAERRB
SDWATYP1 EQU   SDWAERRB
@NM00029 EQU   SDWAERRB
SDWAPGIO EQU   SDWAERRA
SDWATEXC EQU   SDWAERRA
SDWASVCE EQU   SDWAERRA
SDWAABTM EQU   SDWAERRA
SDWASVCD EQU   SDWAERRA
SDWARKEY EQU   SDWAERRA
SDWAPCHK EQU   SDWAERRA
SDWAMCHK EQU   SDWAERRA
SDWATIME EQU   SDWAMCH+20
SDWARFSA EQU   SDWAMCH+16
@NM00028 EQU   SDWAMCH+14
SDWAVEQR EQU   SDWARSR2
SDWAPGFX EQU   SDWARSR2
SDWAFLSQ EQU   SDWARSR2
SDWAFSQA EQU   SDWARSR2
SDWANUCL EQU   SDWARSR2
SDWASPER EQU   SDWARSR2
SDWAINTC EQU   SDWARSR2
SDWAOFLN EQU   SDWARSR2
SDWACHNG EQU   SDWARSR1
SDWAMSER EQU   SDWARSR1
@NM00027 EQU   SDWARSR1
SDWACPID EQU   SDWAMCH+10
SDWATERR EQU   SDWAMCHD
SDWAFPRX EQU   SDWAMCHD
SDWAINSF EQU   SDWAMCHD
SDWAACR  EQU   SDWAMCHD
SDWASCK  EQU   SDWAMCHD
SDWAPSWU EQU   SDWAMCHD
SDWAREGU EQU   SDWAMCHD
SDWASKYF EQU   SDWAMCHD
@NM00026 EQU   SDWAMCHS
SDWARSRF EQU   SDWAMCHS
SDWARSRC EQU   SDWAMCHS
SDWAINVP EQU   SDWAMCHS
SDWATSVL EQU   SDWAMCHS
SDWARCDF EQU   SDWAMCHS
SDWASRVL EQU   SDWAMCHS
SDWASCKE EQU   SDWASTCK+4
SDWASCKB EQU   SDWASTCK
SDWALNTH EQU   SDWAIDNT+1
SDWASPID EQU   SDWAIDNT
SDWASR15 EQU   SDWASRSV+60
SDWASR14 EQU   SDWASRSV+56
SDWASR13 EQU   SDWASRSV+52
SDWASR12 EQU   SDWASRSV+48
SDWASR11 EQU   SDWASRSV+44
SDWASR10 EQU   SDWASRSV+40
SDWASR09 EQU   SDWASRSV+36
SDWASR08 EQU   SDWASRSV+32
SDWASR07 EQU   SDWASRSV+28
SDWASR06 EQU   SDWASRSV+24
SDWASR05 EQU   SDWASRSV+20
SDWASR04 EQU   SDWASRSV+16
SDWASR03 EQU   SDWASRSV+12
SDWASR02 EQU   SDWASRSV+8
SDWASR01 EQU   SDWASRSV+4
SDWASR00 EQU   SDWASRSV
SDWATRN2 EQU   SDWAAEC2+4
SDWAIPC2 EQU   SDWAICD2
SDWAIMC2 EQU   SDWAICD2
SDWAIPR2 EQU   SDWAICD2
@NM00025 EQU   SDWAINC2
@NM00024 EQU   SDWAILC2
SDWAIL2  EQU   SDWAILC2
@NM00023 EQU   SDWAILC2
@NM00022 EQU   SDWAAEC2
SDWAADD2 EQU   SDWANXT2+1
@NM00021 EQU   SDWANXT2
@NM00020 EQU   SDWAEC2+3
SDWASGN2 EQU   SDWAINT2
SDWAEXP2 EQU   SDWAINT2
SDWADEC2 EQU   SDWAINT2
SDWAFPO2 EQU   SDWAINT2
SDWACC2  EQU   SDWAINT2
@NM00019 EQU   SDWAINT2
SDWAPGM2 EQU   SDWAMWP2
SDWAWAT2 EQU   SDWAMWP2
SDWAMCK2 EQU   SDWAMWP2
SDWAECT2 EQU   SDWAMWP2
SDWAKEY2 EQU   SDWAMWP2
SDWAEXT2 EQU   SDWAEMK2
SDWAIO2  EQU   SDWAEMK2
SDWATRM2 EQU   SDWAEMK2
@NM00018 EQU   SDWAEMK2
SDWAPER2 EQU   SDWAEMK2
@NM00017 EQU   SDWAEMK2
SDWATRAN EQU   SDWAAEC1+4
SDWAIPC1 EQU   SDWAICD1
SDWAIMC1 EQU   SDWAICD1
SDWAIPR1 EQU   SDWAICD1
@NM00016 EQU   SDWAINC1
@NM00015 EQU   SDWAILC1
SDWAIL1  EQU   SDWAILC1
@NM00014 EQU   SDWAILC1
@NM00013 EQU   SDWAAEC1
SDWAADD1 EQU   SDWANXT1+1
@NM00012 EQU   SDWANXT1
@NM00011 EQU   SDWAEC1+3
SDWASGN1 EQU   SDWAINT1
SDWAEXP1 EQU   SDWAINT1
SDWADEC1 EQU   SDWAINT1
SDWAFPO1 EQU   SDWAINT1
SDWACC1  EQU   SDWAINT1
@NM00010 EQU   SDWAINT1
SDWAPGM1 EQU   SDWAMWP1
SDWAWAT1 EQU   SDWAMWP1
SDWAMCK1 EQU   SDWAMWP1
SDWAECT1 EQU   SDWAMWP1
SDWAKEY1 EQU   SDWAMWP1
SDWAEXT1 EQU   SDWAEMK1
SDWAIO1  EQU   SDWAEMK1
SDWATRM1 EQU   SDWAEMK1
@NM00009 EQU   SDWAEMK1
SDWAPER1 EQU   SDWAEMK1
@NM00008 EQU   SDWAEMK1
SDWAIOBR EQU   SDWA+100
SDWAEPA  EQU   SDWA+96
@NM00007 EQU   SDWANAME+4
SDWARBAD EQU   SDWANAME
SDWAGR15 EQU   SDWAGRSV+60
SDWAGR14 EQU   SDWAGRSV+56
SDWAGR13 EQU   SDWAGRSV+52
SDWAGR12 EQU   SDWAGRSV+48
SDWAGR11 EQU   SDWAGRSV+44
SDWAGR10 EQU   SDWAGRSV+40
SDWAGR09 EQU   SDWAGRSV+36
SDWAGR08 EQU   SDWAGRSV+32
SDWAGR07 EQU   SDWAGRSV+28
SDWAGR06 EQU   SDWAGRSV+24
SDWAGR05 EQU   SDWAGRSV+20
SDWAGR04 EQU   SDWAGRSV+16
SDWAGR03 EQU   SDWAGRSV+12
SDWAGR02 EQU   SDWAGRSV+8
SDWAGR01 EQU   SDWAGRSV+4
SDWAGR00 EQU   SDWAGRSV
SDWANXTP EQU   SDWACTL2+5
SDWASGP  EQU   SDWAPMKP
SDWAEUP  EQU   SDWAPMKP
SDWADOP  EQU   SDWAPMKP
SDWAFPP  EQU   SDWAPMKP
SDWACCP  EQU   SDWAPMKP
SDWAILP  EQU   SDWAPMKP
SDWAINTP EQU   SDWACTL2+2
SDWASPVP EQU   SDWAMWPP
SDWAWATP EQU   SDWAMWPP
SDWAMCKP EQU   SDWAMWPP
@NM00006 EQU   SDWAMWPP
SDWAKEYP EQU   SDWAMWPP
SDWAEXTP EQU   SDWACMKP
SDWAIOP  EQU   SDWACMKP
SDWANXTA EQU   SDWACTL1+5
SDWASGA  EQU   SDWAPMKA
SDWAEUA  EQU   SDWAPMKA
SDWADOA  EQU   SDWAPMKA
SDWAFPA  EQU   SDWAPMKA
SDWACCA  EQU   SDWAPMKA
SDWAILA  EQU   SDWAPMKA
SDWAINTA EQU   SDWACTL1+2
SDWASPVA EQU   SDWAMWPA
SDWAWATA EQU   SDWAMWPA
SDWAMCKA EQU   SDWAMWPA
@NM00005 EQU   SDWAMWPA
SDWAKEYA EQU   SDWAMWPA
SDWAEXTA EQU   SDWACMKA
SDWAIOA  EQU   SDWACMKA
SDWACMPC EQU   SDWAABCC+1
@NM00004 EQU   SDWACMPF
SDWASTCC EQU   SDWACMPF
@NM00003 EQU   SDWACMPF
SDWASTEP EQU   SDWACMPF
SDWAREQ  EQU   SDWACMPF
CVTLEVL  EQU   CVTRELNO+2
CVTNUMB  EQU   CVTRELNO
CVTMDL   EQU   CVTFIX+250
@NM00002 EQU   CVTFIX+248
@NM00001 EQU   CVTFIX
CVTRV482 EQU   CVTXTNT2+128
CVTRV481 EQU   CVTXTNT2+124
CVTRV480 EQU   CVTXTNT2+120
CVTRV479 EQU   CVTXTNT2+118
CVTRV478 EQU   CVTXTNT2+117
CVTRV477 EQU   CVTXTNT2+116
CVTRV476 EQU   CVTXTNT2+115
CVTRV475 EQU   CVTXTNT2+114
CVTRV474 EQU   CVTRV466
CVTRV473 EQU   CVTRV466
CVTRV472 EQU   CVTRV466
CVTRV471 EQU   CVTRV466
CVTRV470 EQU   CVTRV466
CVTRV469 EQU   CVTRV466
CVTRV468 EQU   CVTRV466
CVTRV467 EQU   CVTRV466
CVTRV465 EQU   CVTRV457
CVTRV464 EQU   CVTRV457
CVTRV463 EQU   CVTRV457
CVTRV462 EQU   CVTRV457
CVTRV461 EQU   CVTRV457
CVTRV460 EQU   CVTRV457
CVTRV459 EQU   CVTRV457
CVTRV458 EQU   CVTRV457
CVTRV456 EQU   CVTXTNT2+108
CVTRV455 EQU   CVTXTNT2+104
CVTRV454 EQU   CVTXTNT2+100
CVTRV453 EQU   CVTXTNT2+96
CVTRV452 EQU   CVTXTNT2+94
CVTRV451 EQU   CVTXTNT2+92
CVTRV450 EQU   CVTXTNT2+90
CVTRV449 EQU   CVTXTNT2+88
CVTRV448 EQU   CVTXTNT2+87
CVTRV447 EQU   CVTXTNT2+86
CVTRV446 EQU   CVTRV438
CVTRV445 EQU   CVTRV438
CVTRV444 EQU   CVTRV438
CVTRV443 EQU   CVTRV438
CVTRV442 EQU   CVTRV438
CVTRV441 EQU   CVTRV438
CVTRV440 EQU   CVTRV438
CVTRV439 EQU   CVTRV438
CVTRV437 EQU   CVTRV429
CVTRV436 EQU   CVTRV429
CVTRV435 EQU   CVTRV429
CVTRV434 EQU   CVTRV429
CVTRV433 EQU   CVTRV429
CVTRV432 EQU   CVTRV429
CVTRV431 EQU   CVTRV429
CVTRV430 EQU   CVTRV429
CVTRV428 EQU   CVTXTNT2+80
CVTRV427 EQU   CVTXTNT2+76
CVTRV426 EQU   CVTXTNT2+72
CVTRV425 EQU   CVTXTNT2+68
CVTATACT EQU   CVTATCVT
CVTRV423 EQU   CVTXTNT2+62
CVTRV422 EQU   CVTXTNT2+60
CVTRV421 EQU   CVTXTNT2+58
CVTRV420 EQU   CVTXTNT2+56
CVTRV419 EQU   CVTXTNT2+55
CVTRV418 EQU   CVTXTNT2+54
CVTRV417 EQU   CVTRV409
CVTRV416 EQU   CVTRV409
CVTRV415 EQU   CVTRV409
CVTRV414 EQU   CVTRV409
CVTRV413 EQU   CVTRV409
CVTRV412 EQU   CVTRV409
CVTRV411 EQU   CVTRV409
CVTRV410 EQU   CVTRV409
CVTRV408 EQU   CVTRV400
CVTRV407 EQU   CVTRV400
CVTRV406 EQU   CVTRV400
CVTRV405 EQU   CVTRV400
CVTRV404 EQU   CVTRV400
CVTRV403 EQU   CVTRV400
CVTRV402 EQU   CVTRV400
CVTRV401 EQU   CVTRV400
CVTRSVA1 EQU   CVTXTNT2+48
CVTRSVA0 EQU   CVTXTNT2+44
CVTRSV99 EQU   CVTXTNT2+40
CVTRSV98 EQU   CVTXTNT2+36
CVTRSV97 EQU   CVTXTNT2+34
CVTRSV96 EQU   CVTXTNT2+32
CVTOLTEP EQU   CVTXTNT2+28
CVTQIDA  EQU   CVTQID+1
CVTRSV95 EQU   CVTQID
CVTRSV94 EQU   CVTXTNT2+20
CVTRSV93 EQU   CVTXTNT2+16
CVTRAP   EQU   CVTXTNT2+12
CVTDEBVR EQU   CVTXTNT2+8
CVTRSV91 EQU   CVTXTNT2+6
CVTRSV9H EQU   CVTRSV90
CVTRSV9G EQU   CVTRSV90
CVTRSV9F EQU   CVTRSV90
CVTRSV9E EQU   CVTRSV90
CVTRSV9D EQU   CVTRSV90
CVTRSV9C EQU   CVTRSV90
CVTRSV9B EQU   CVTRSV90
CVTRSV9A EQU   CVTRSV90
CVTNUCLS EQU   CVTXTNT2+4
CVTDSSVA EQU   CVTDSSV+1
CVTRSV89 EQU   CVTDSSV
CVTRSV88 EQU   CVTXTNT1+8
CVTRSV87 EQU   CVTXTNT1+4
CVTFACHN EQU   CVTXTNT1
CVTRV488 EQU   CVTMAP+412
CVTRV487 EQU   CVTMAP+408
CVTRV486 EQU   CVTMAP+404
CVTRV485 EQU   CVTMAP+400
CVTRV484 EQU   CVTMAP+396
CVTAUTH  EQU   CVTMAP+392
CVTATMCA EQU   CVTATMCT+1
CVTATMST EQU   CVTATMCT
CVTRSV61 EQU   CVTMAP+384
CVTVOLT1 EQU   CVTVOLM1+1
CVTVOLI1 EQU   CVTVOLF1
CVTSTOA  EQU   CVTMAP+376
CVTRSV58 EQU   CVTMAP+374
CVTRSV57 EQU   CVTMAP+372
CVTDDCE  EQU   CVTMAP+368
CVTPNWFR EQU   CVTMAP+364
CVTSMF   EQU   CVTMAP+360
CVTSULK  EQU   CVTMAP+358
CVTSLKO  EQU   CVTSYSK
CVTSLKP  EQU   CVTSYSK
CVTSLKQ  EQU   CVTSYSK
CVTSLKR  EQU   CVTSYSK
CVTRSV56 EQU   CVTSYSK
CVTRSV55 EQU   CVTSYSK
CVTRSV54 EQU   CVTSYSK
CVTRSV53 EQU   CVTSYSK
CVTRSV52 EQU   CVTA1F1
CVTRSV51 EQU   CVTA1F1
CVTRSV50 EQU   CVTA1F1
CVTRSV49 EQU   CVTA1F1
CVTRSV48 EQU   CVTA1F1
CVTRSV47 EQU   CVTA1F1
CVTSRSW  EQU   CVTA1F1
CVTPFSW  EQU   CVTA1F1
CVTPCVT  EQU   CVTMAP+352
CVTRSV46 EQU   CVTMAP+344
CVTRSV45 EQU   CVTMAP+340
CVTRSV44 EQU   CVTMAP+338
CVTRSV43 EQU   CVTMAP+336
CVTHJESA EQU   CVTHJES+1
CVTRSV42 EQU   CVTHJES
CVTEXT2A EQU   CVTEXT2+1
CVTRSV41 EQU   CVTEXT2
CVTAPFA  EQU   CVTAPF+1
CVTRSV40 EQU   CVTAPF
CVTINTLA EQU   CVTMAP+320
CVTERPV  EQU   CVTMAP+316
CVTEORM  EQU   CVTMAP+312
CVTMCHPR EQU   CVTMAP+308
CVTTZ    EQU   CVTMAP+304
CVTJEPS  EQU   CVTMAP+300
CVTJESCT EQU   CVTMAP+296
CVTMODE  EQU   CVTMAP+292
CVTPTRV  EQU   CVTMAP+288
CVTREAL  EQU   CVTMAP+284
CVTRSV39 EQU   CVTMAP+280
CVTRSV38 EQU   CVTMAP+276
CVTDMSRA EQU   CVTDMSR+1
CVTRSV37 EQU   CVTDMSR
CVTQMSGA EQU   CVTQMSG+1
CVTRSV36 EQU   CVTQMSG
CVTAMFF  EQU   CVTMAP+264
CVTPURGA EQU   CVTPURG+1
CVTRSV35 EQU   CVTPURG
CVTCBSP  EQU   CVTMAP+256
CVTATERA EQU   CVTATER+1
CVTSYST  EQU   CVTATER
CVTVOLT2 EQU   CVTTAT
CVTVOLI2 EQU   CVTVOLF2
CVTAQAVB EQU   CVTAQAVT+1
CVTRSV34 EQU   CVTTCMFG
CVTRSV33 EQU   CVTTCMFG
CVTRSV32 EQU   CVTTCMFG
CVTRSV31 EQU   CVTTCMFG
CVTRSV30 EQU   CVTTCMFG
CVTRSV29 EQU   CVTTCMFG
CVTRSV28 EQU   CVTTCMFG
CVTTCRDY EQU   CVTTCMFG
CVTGTFA  EQU   CVTGTF+1
CVTRSV27 EQU   CVTGTFST
CVTRNIO  EQU   CVTGTFST
CVTRV319 EQU   CVTUSR
CVTRV318 EQU   CVTFORM
CVTRV317 EQU   CVTTMODE
CVTRV316 EQU   CVTSTATE
CVTRV315 EQU   CVTGTFS
CVTGTFAV EQU   CVTGTFS
CVT0SCR1 EQU   CVTMAP+232
CVTTSCVB EQU   CVTTSCVT+1
CVTRSV25 EQU   CVTTSFLG
CVTRSV24 EQU   CVTTSFLG
CVTRSV23 EQU   CVTTSFLG
CVTRSV22 EQU   CVTTSFLG
CVTRSV21 EQU   CVTTSFLG
CVTRSV20 EQU   CVTTSFLG
CVTRSV19 EQU   CVTTSFLG
CVTTSRDY EQU   CVTTSFLG
CVTRMS   EQU   CVTMAP+224
CVTPATCH EQU   CVTMAP+220
CVTTSCE  EQU   CVTMAP+216
CVTLNKSC EQU   CVTMAP+214
CVTQABST EQU   CVTMAP+212
CVTMDLDS EQU   CVTMAP+208
CVTUSER  EQU   CVTMAP+204
CVTABEND EQU   CVTMAP+200
CVTSMCA  EQU   CVTMAP+196
CVTRSV18 EQU   CVTMAP+192
CVTQLPAQ EQU   CVTMAP+188
CVTQCDSR EQU   CVTMAP+184
CVTRSV17 EQU   CVTOPTB
CVTRSV16 EQU   CVTOPTB
CVTFP    EQU   CVTOPTB
CVTAPTHR EQU   CVTOPTB
CVTNLOG  EQU   CVTOPTB
CVTTOD   EQU   CVTOPTB
CVTCTIMS EQU   CVTOPTB
CVTPROT  EQU   CVTOPTB
CVTXPFP  EQU   CVTOPTA
CVTASCII EQU   CVTOPTA
CVTRSV13 EQU   CVTOPTA
CVTRSV12 EQU   CVTOPTA
CVTNIP   EQU   CVTOPTA
CVTDDR   EQU   CVTOPTA
CVTAPR   EQU   CVTOPTA
CVTCCH   EQU   CVTOPTA
CVTSNCTR EQU   CVTMAP+180
CVTQMWR  EQU   CVTMAP+176
CVTQOCR  EQU   CVTMAP+172
CVT1EF00 EQU   CVTMAP+168
CVTMZ00  EQU   CVTMAP+164
CVTHEAD  EQU   CVTMAP+160
CVTRSV11 EQU   CVTMAP+156
CVT0PT01 EQU   CVTMAP+152
CVTMSER  EQU   CVTMAP+148
CVTIERLC EQU   CVTMAP+144
CVTILCH  EQU   CVTMAP+140
CVT0DS   EQU   CVTMAP+136
CVTFBOSV EQU   CVTMAP+132
CVTNUCB  EQU   CVTMAP+128
CVTIXAVL EQU   CVTMAP+124
CVTIOQET EQU   CVTMAP+120
CVTDCBA  EQU   CVTMAP+117
CVTMVS2  EQU   CVTDCB
CVT6DAT  EQU   CVTDCB
CVT4MPS  EQU   CVTDCB
CVTRSV09 EQU   CVTDCB
CVT4MS1  EQU   CVTDCB
CVT2SPS  EQU   CVTDCB
CVT1SSS  EQU   CVTDCB
CVTRSV08 EQU   CVTDCB
CVTSTB   EQU   CVTMAP+112
CVTQTD00 EQU   CVTMAP+108
CVTQTE00 EQU   CVTMAP+104
CVTCUCB  EQU   CVTMAP+100
CVTSJQ   EQU   CVTMAP+96
CVTPBLDL EQU   CVTMAP+92
CVTTPC   EQU   CVTMAP+88
CVTSVDCB EQU   CVTMAP+84
CVTBRET  EQU   CVTMAP+82
CVTEXIT  EQU   CVTMAP+80
CVT0FN00 EQU   CVTMAP+76
CVTDARA  EQU   CVTDAR+1
CVTRSV07 EQU   CVTFLGS1
CVTRSV06 EQU   CVTFLGS1
CVTRSV05 EQU   CVTFLGS1
CVTRSV04 EQU   CVTFLGS1
CVTRSV03 EQU   CVTFLGS1
CVTRSV02 EQU   CVTFLGS1
CVTRSV01 EQU   CVTFLGS1
CVTDMPLK EQU   CVTFLGS1
CVTXITP  EQU   CVTMAP+68
CVTZDTAB EQU   CVTMAP+64
CVTMSLT  EQU   CVTMAP+60
CVTDATE  EQU   CVTMAP+56
CVTBTERM EQU   CVTMAP+52
CVTSYSAD EQU   CVTMAP+48
CVTXTLER EQU   CVTMAP+44
CVTILK2  EQU   CVTMAP+40
CVTILK1  EQU   CVTMAP+36
CVTPRLTV EQU   CVTMAP+32
CVTPCNVT EQU   CVTMAP+28
CVT0VL00 EQU   CVTMAP+24
CVTXAPG  EQU   CVTMAP+20
CVTBUF   EQU   CVTMAP+16
CVTJOB   EQU   CVTMAP+12
CVTLINK  EQU   CVTMAP+8
CVT0EF00 EQU   CVTMAP+4
CVT      EQU   CVTMAP
@NM00077 EQU   PSA+3412
PSASTAK  EQU   PSA+3072
@NM00076 EQU   PSA+1024
PSAUSEND EQU   PSA+1024
PSARV060 EQU   PSA+1020
PSARV059 EQU   PSA+1018
PSASVC13 EQU   PSA+1016
PSALSFCC EQU   PSA+1012
PSASFACC EQU   PSA+1008
PSASTOP  EQU   PSA+992
PSASTART EQU   PSA+976
PSARSPSW EQU   PSA+968
PSASRPSW EQU   PSA+960
PSARV045 EQU   PSA+892
PSARV044 EQU   PSA+888
PSARV043 EQU   PSA+884
PSARV042 EQU   PSA+880
PSARV041 EQU   PSA+876
PSARV040 EQU   PSA+872
PSARV025 EQU   PSA+868
PSADSSED EQU   PSA+868
PSADSSPR EQU   PSA+864
PSADSSFW EQU   PSA+860
PSADSS14 EQU   PSA+856
PSADSSPP EQU   PSA+848
PSADSSRP EQU   PSA+840
PSADSS05 EQU   PSADSSF4
PSADSS10 EQU   PSADSSF4
PSADSSVE EQU   PSADSSF4
PSADSSDE EQU   PSADSSF4
PSADSSC0 EQU   PSADSSF4
PSADSSIE EQU   PSADSSF4
PSADSS12 EQU   PSADSSF4
PSADSSRC EQU   PSADSSF4
PSARV057 EQU   PSADSSF3
PSARV056 EQU   PSADSSF3
PSARV055 EQU   PSADSSF3
PSARV054 EQU   PSADSSF3
PSADSSRW EQU   PSADSSF3
PSADSSNM EQU   PSADSSF3
PSADSSES EQU   PSADSSF3
PSADSSGP EQU   PSADSSF3
PSADSSF2 EQU   PSADSSFL+1
PSADSSPI EQU   PSADSSF1
PSADSSOI EQU   PSADSSF1
PSADSSSP EQU   PSADSSF1
PSADSSTP EQU   PSADSSF1
PSADSSDW EQU   PSADSSF1
PSADSSDD EQU   PSADSSF1
PSADSSDM EQU   PSADSSF1
PSADSSMV EQU   PSADSSF1
PSADSSTS EQU   PSA+816
PSADSSWK EQU   PSA+812
PSADSSR3 EQU   PSA+808
PSADSSR2 EQU   PSA+804
PSADSSRS EQU   PSA+800
PSASTOR  EQU   PSA+796
PSARV058 EQU   PSA+794
PSAVSTAP EQU   PSA+792
PSAWKVAP EQU   PSA+788
PSAWKRAP EQU   PSA+784
PSAMCHIC EQU   PSA+783
PSAMODE  EQU   PSA+782
PSASYMSK EQU   PSA+781
PSAMCHFL EQU   PSA+780
PSACR0   EQU   PSA+776
PSAPSWSV EQU   PSA+768
PSACLHS  EQU   PSAHLHI
PSALKR15 EQU   PSALKSA+60
PSALKR14 EQU   PSALKSA+56
PSALKR13 EQU   PSALKSA+52
PSALKR12 EQU   PSALKSA+48
PSALKR11 EQU   PSALKSA+44
PSALKR10 EQU   PSALKSA+40
PSALKR9  EQU   PSALKSA+36
PSALKR8  EQU   PSALKSA+32
PSALKR7  EQU   PSALKSA+28
PSALKR6  EQU   PSALKSA+24
PSALKR5  EQU   PSALKSA+20
PSALKR4  EQU   PSALKSA+16
PSALKR3  EQU   PSALKSA+12
PSALKR2  EQU   PSALKSA+8
PSALKR1  EQU   PSALKSA+4
PSALKR0  EQU   PSALKSA
PSARV023 EQU   PSACLHT+52
PSALOCAL EQU   PSACLHT+48
PSACMSL  EQU   PSACLHT+44
PSAOPTL  EQU   PSACLHT+40
PSATPACL EQU   PSACLHT+36
PSATPDNL EQU   PSACLHT+32
PSATPNCL EQU   PSACLHT+28
PSAIOSLL EQU   PSACLHT+24
PSAIOSUL EQU   PSACLHT+20
PSAIOSCL EQU   PSACLHT+16
PSAIOSSL EQU   PSACLHT+12
PSASALCL EQU   PSACLHT+8
PSAASML  EQU   PSACLHT+4
PSADISPL EQU   PSACLHT
PSASRSA  EQU   PSA+636
PSARV050 EQU   PSA+634
PSADSSGO EQU   PSA+633
PSARECUR EQU   PSA+632
PSAHLHIS EQU   PSA+628
PSAIPCSA EQU   PSA+624
@NM00075 EQU   PSA+621
PSAIPCDM EQU   PSA+620
PSAIPCD  EQU   PSA+616
@NM00074 EQU   PSA+613
PSAIPCRM EQU   PSA+612
PSAIPCR  EQU   PSA+608
PSAMCHEX EQU   PSA+600
PSAMPSW  EQU   PSA+592
PSAEXPS2 EQU   PSA+584
PSAEXPS1 EQU   PSA+576
PSAPIREG EQU   PSA+572
PSARSREG EQU   PSA+568
PSAGPREG EQU   PSA+556
PSARV022 EQU   PSASUP4
PSARV021 EQU   PSASUP4
PSARV020 EQU   PSASUP4
PSARV019 EQU   PSASUP4
PSARV018 EQU   PSASUP4
PSARV017 EQU   PSASUP4
PSARV016 EQU   PSASUP4
PSARV015 EQU   PSASUP4
PSARV014 EQU   PSASUP3
PSARV013 EQU   PSASUP3
PSARV012 EQU   PSASUP3
PSARV011 EQU   PSASUP3
PSARV010 EQU   PSASUP3
PSARV009 EQU   PSASUP3
PSARV008 EQU   PSASUP3
PSAIOSUP EQU   PSASUP3
PSALCR   EQU   PSASUP2
PSARTM   EQU   PSASUP2
PSAACR   EQU   PSASUP2
PSAIPCE2 EQU   PSASUP2
PSAIPCES EQU   PSASUP2
PSAIPCEC EQU   PSASUP2
PSAGTF   EQU   PSASUP2
PSAIPCRI EQU   PSASUP2
PSAIPCRP EQU   PSASUP1
PSAIPCDR EQU   PSASUP1
PSADISP  EQU   PSASUP1
PSALOCK  EQU   PSASUP1
PSAPI    EQU   PSASUP1
PSAEXT   EQU   PSASUP1
PSASVC   EQU   PSASUP1
PSAIO    EQU   PSASUP1
PSAAOLD  EQU   PSA+548
PSAANEW  EQU   PSA+544
PSATOLD  EQU   PSA+540
PSATNEW  EQU   PSA+536
PSALCCAR EQU   PSA+532
PSALCCAV EQU   PSA+528
PSAPCCAR EQU   PSA+524
PSAPCCAV EQU   PSA+520
PSACPULA EQU   PSA+518
PSACPUPA EQU   PSA+516
PSAPSA   EQU   PSA+512
FLCHDEND EQU   PSA+512
FLCCRSAV EQU   FLCMCLA+280
FLCGRSAV EQU   FLCMCLA+216
FLCFPSAV EQU   FLCMCLA+184
FLCFLA   EQU   FLCMCLA+88
FLCRGNCD EQU   FLCMCLA+84
FLCFSAA  EQU   FLCFSA+1
@NM00073 EQU   FLCFSA
@NM00072 EQU   FLCMCLA+72
FLCMCIC  EQU   FLCMCLA+64
@NM00071 EQU   FLCMCLA+20
FLCIOAA  EQU   FLCIOA+1
@NM00070 EQU   FLCIOA
@NM00069 EQU   FLCMCLA+15
@NM00068 EQU   FLCMCLA+14
@NM00067 EQU   FLCMCLA+12
FLCLCL   EQU   FLCMCLA+8
FLCIOELA EQU   FLCIOEL+1
@NM00066 EQU   FLCIOEL
FLCCHNID EQU   FLCMCLA
@NM00065 EQU   PSA+160
FLCMTRCD EQU   PSA+157
@NM00064 EQU   PSA+156
FLCPERA  EQU   FLCPER+1
@NM00063 EQU   FLCPER
@NM00062 EQU   PSA+151
FLCPERCD EQU   PSA+150
FLCMCNUM EQU   PSA+149
@NM00061 EQU   PSA+148
FLCTEAA  EQU   FLCTEA+1
@NM00060 EQU   FLCTEA
PSAPIPC  EQU   PSAPICOD
PSAPIMC  EQU   PSAPICOD
PSAPIPER EQU   PSAPICOD
PSARV049 EQU   FLCPICOD
FLCPILCB EQU   FLCPIILC
@NM00059 EQU   FLCPIILC
@NM00058 EQU   PSAEPPSW
FLCSVCN  EQU   PSAESPSW+2
FLCSILCB EQU   FLCSVILC
@NM00057 EQU   FLCSVILC
@NM00056 EQU   PSAESPSW
FLCEICOD EQU   PSAEEPSW+2
PSASPAD  EQU   PSAEEPSW
@NM00055 EQU   PSA+128
FLCINPSW EQU   PSA+120
FLCMNPSW EQU   PSA+112
FLCPNPSW EQU   PSA+104
FLCSNPSW EQU   PSA+96
FLCENPSW EQU   PSA+88
FLCTRACE EQU   PSA+84
FLCTIMER EQU   PSA+80
FLCCVT2  EQU   PSA+76
FLCCAW   EQU   PSA+72
FLCCSW   EQU   PSA+64
FLCIOPSW EQU   PSA+56
FLCMOPSW EQU   PSA+48
FLCPOPSW EQU   PSA+40
FLCSOPSW EQU   PSA+32
FLCEOPSW EQU   PSA+24
@NM00054 EQU   FLCICCW2+4
FLCCVT   EQU   FLCICCW2
FLCICCW1 EQU   FLCROPSW
FLCIPPSW EQU   FLCRNPSW
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS
@PB00002 EQU   @PB00003
@ENDDATA EQU   *
         END   IEESB665
