         TITLE 'ISTZIFKG/AKG-VS1/MKG-VS2 -INVITE COMPLETION -BSC SWITCH*
               HED PORT '
ISTZIFKG CSECT ,                                                   0001
@MAINENT DS    0H                                                  0001
         USING *,@15                                               0001
         B     @PROLOG                                             0001
         DC    AL1(16)                                             0001
         DC    C'ISTZIFKG  78.153'                                 0001
         DROP  @15
@PROLOG  DS    0H                                                  0002
*                                                                  0461
*/* TPZSAVE (7,12,14) BASE AC(ICKG)                                  */
*                                                                  0461
*   DO;                                                            0461
*     RFY                                                          0462
*      (GPR01P,                                                    0462
*       GPR12P,                                                    0462
*       GPR13P,                                                    0462
*       GPR14P) RSTD;                                              0462
*     GEN(PRINT OFF);                                              0463
*                                                                  0463
         PRINT OFF
*/* ATBUILD (ISTZSAVE)                                               */
*/* END OF ATBUILD                                                   */
*                                                                  0464
*     GEN(PRINT ON);                                               0464
         PRINT ON
*     RFY                                                          0465
*       ISTZSAVE BASED(GPR13P);                                    0465
*     GEN SETS(ZSAZSVVR)(STM   7,12,ZSAZSVVR+0(13));               0466
         STM   7,12,ZSAZSVVR+0(13)
*     GEN SETS(GPR12P);                                            0467
         BALR  GPR12P,0
@TSTART  DS    0H
         USING @TSTART,GPR12P
*     GEN(PRINT OFF);                                              0468
*                                                                  0468
         PRINT OFF
*/* ATBUILD (ISTZCRR,ISTRPH,ISTCRA) EJECT(NO)                        */
*/* END OF ATBUILD                                                   */
*                                                                  0469
*     GEN(PRINT ON);                                               0469
         PRINT ON
*     GPR01P->RPHCRR->CRACRR->ZCREICKG='1'B;                       0470
         L     @15,RPHCRR(,GPR01P)                                 0470
         L     @15,CRACRR(,@15)                                    0470
         OI    ZCREICKG(@15),B'01000000'                           0470
*     ZSAZACTV='1'B;                                               0471
         OI    ZSAZACTV(GPR13P),B'10000000'                        0471
*     ZSAZTRAC='ICKG';                                             0472
         MVC   ZSAZTRAC(4,GPR13P),@CC04362                         0472
*     ZSAZSVRR=GPR14P;                                             0473
         ST    GPR14P,ZSAZSVRR(,GPR13P)                            0473
*     GPR13P=ZSAZSVFC;                                             0474
         L     GPR13P,ZSAZSVFC(,GPR13P)                            0474
*     RFY                                                          0475
*      (GPR01P) UNRSTD;                                            0475
*     RFY                                                          0476
*      (GPR14P) UNRSTD;                                            0476
*   END;                                                           0477
*                                                                  0477
*/* END TPZSAVE                                                      */
*/* TPDEQ (,LCPFDBA)                                                 */
*                                                                  0478
*   DO;                             /* BEGIN TPDEQ CODE GENERATION   */
*     DCL                                                          0479
*       FMZCA014 BIT(32) CONSTANT('80000000'X);                    0479
*     DCL                                                          0480
*       FMZCB014 BIT(32) CONSTANT('7FFFFFFF'X);                    0480
*     RFY                                                          0481
*      (GPR00P,                                                    0481
*       GPR01P,                                                    0481
*       GPR14P,                                                    0481
*       GPR15P) RSTD;                                              0481
*     RFY                                                          0482
*       ISTWKE;                                                    0482
*     GPR15P=ADDR(LCPFDBA);         /* ADDRESS QUEUE POINTER         */
         LA    GPR15P,LCPFDBA(,ELEMREG)                            0483
*     GPR14P=GPR15P->PABWEQA×FMZCA014;                             0484
         L     @11,@CF01661                                        0484
         L     GPR14P,PABWEQA(,GPR15P)                             0484
         OR    GPR14P,@11                                          0484
*     IF GPR14P=FMZCA014 THEN                                      0485
         CLR   GPR14P,@11                                          0485
         BE    @RT00485                                            0485
*       ;                                                          0486
*     ELSE                                                         0487
*       DO;                                                        0487
*FMZL1014:                                                         0488
*         ;                                                        0488
FMZL1014 DS    0H                                                  0489
*         DO WHILE(GPR14P->WKECHAIN^=FMZCA014);                    0489
         B     @DE00489                                            0489
@DL00489 DS    0H                                                  0490
*           GPR15P=ADDR(GPR14P->WKECHAIN);                         0490
         LA    GPR15P,WKECHAIN(,GPR14P)                            0490
*           GPR14P=GPR15P->PABWEQA;                                0491
         L     GPR14P,PABWEQA(,GPR15P)                             0491
*         END;                                                     0492
@DE00489 L     @11,@CF01661                                        0492
         CL    @11,WKECHAIN(,GPR14P)                               0492
         BNE   @DL00489                                            0492
*         GPR00P=FMZCA014;                                         0493
         LR    GPR00P,@11                                          0493
*         CS(GPR14P,GPR00P,GPR15P->PABWEQA);                       0494
         CS    GPR14P,@00,PABWEQA(GPR15P)                          0494
*         BC(7,FMZL1014);                                          0495
         BC    7,FMZL1014                                          0495
*         GPR14P->WKECHAIN=0;                                      0496
         SLR   @11,@11                                             0496
         ST    @11,WKECHAIN(,GPR14P)                               0496
*       END;                                                       0497
*ISTA0014:                                                         0498
*     ;                                                            0498
@RT00485 DS    0H                                                  0498
ISTA0014 DS    0H                                                  0499
*     GPR14P=GPR14P&FMZCB014;                                      0499
         N     GPR14P,@CF01659                                     0499
*     GPR01P->RPHWEA=GPR14P;                                       0500
         ST    GPR14P,RPHWEA(,GPR01P)                              0500
*     RFY                                                          0501
*      (GPR00P,                                                    0501
*       GPR01P,                                                    0501
*       GPR14P,                                                    0501
*       GPR15P) UNRSTD;                                            0501
*   END;                            /* END TPDEQ GENERATION DEQUE FSB
*                                      FROM WAIT Q LCPB      @XL03HEK*/
*                                                                  0502
*   /*****************************************************************/
*   /*                                                               */
*   /* THE NEXT TWO LINES MOVED FROM AFTER TPQ OF FSB        @ZA32514*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0503
*   DNCACIP=DNCACIP-1;              /* DECREMENT DNCB REQUEST COUNT  */
         SLR   @00,@00                                             0503
         IC    @00,DNCACIP(,DNCBREG)                               0503
         BCTR  @00,0                                               0503
         STC   @00,DNCACIP(,DNCBREG)                               0503
*/* TPDEQ (,FMCLCPBQ)                                                */
*                                                                  0504
*   DO;                             /* BEGIN TPDEQ CODE GENERATION   */
*     RFY                                                          0505
*      (GPR00P,                                                    0505
*       GPR01P,                                                    0505
*       GPR14P,                                                    0505
*       GPR15P) RSTD;                                              0505
*     GPR15P=ADDR(FMCLCPBQ);        /* ADDRESS QUEUE POINTER         */
         LA    GPR15P,FMCLCPBQ(,FMCBREG)                           0506
*     GPR14P=GPR15P->PABWEQA×FMZCA014;                             0507
         L     @11,@CF01661                                        0507
         L     GPR14P,PABWEQA(,GPR15P)                             0507
         OR    GPR14P,@11                                          0507
*     IF GPR14P=FMZCA014 THEN                                      0508
         CLR   GPR14P,@11                                          0508
         BE    @RT00508                                            0508
*       ;                                                          0509
*     ELSE                                                         0510
*       DO;                                                        0510
*FMZL1018:                                                         0511
*         ;                                                        0511
FMZL1018 DS    0H                                                  0512
*         DO WHILE(GPR14P->WKECHAIN^=FMZCA014);                    0512
         B     @DE00512                                            0512
@DL00512 DS    0H                                                  0513
*           GPR15P=ADDR(GPR14P->WKECHAIN);                         0513
         LA    GPR15P,WKECHAIN(,GPR14P)                            0513
*           GPR14P=GPR15P->PABWEQA;                                0514
         L     GPR14P,PABWEQA(,GPR15P)                             0514
*         END;                                                     0515
@DE00512 L     @11,@CF01661                                        0515
         CL    @11,WKECHAIN(,GPR14P)                               0515
         BNE   @DL00512                                            0515
*         GPR00P=FMZCA014;                                         0516
         LR    GPR00P,@11                                          0516
*         CS(GPR14P,GPR00P,GPR15P->PABWEQA);                       0517
         CS    GPR14P,@00,PABWEQA(GPR15P)                          0517
*         BC(7,FMZL1018);                                          0518
         BC    7,FMZL1018                                          0518
*         GPR14P->WKECHAIN=0;                                      0519
         SLR   @11,@11                                             0519
         ST    @11,WKECHAIN(,GPR14P)                               0519
*       END;                                                       0520
*ISTA0018:                                                         0521
*     ;                                                            0521
@RT00508 DS    0H                                                  0521
ISTA0018 DS    0H                                                  0522
*     GPR14P=GPR14P&FMZCB014;                                      0522
         N     GPR14P,@CF01659                                     0522
*     GPR01P->RPHWEA=GPR14P;                                       0523
         ST    GPR14P,RPHWEA(,GPR01P)                              0523
*     RFY                                                          0524
*      (GPR00P,                                                    0524
*       GPR01P,                                                    0524
*       GPR14P,                                                    0524
*       GPR15P) UNRSTD;                                            0524
*   END;                            /* END TPDEQ GENERATION          */
*   ZCRIF0E1='0'B;                  /* INITIALIZE INTERNAL FLAG      */
         L     @15,RPHCRR(,RPHREG)                                 0526
         L     @15,CRACRR(,@15)                                    0526
         NI    ZCRIF0E1(@15),B'11110111'                           0526
*   IF FSBMJRCD=FRLOGICE THEN       /* LOGIC ERROR?          @XL03HEK*/
         CLI   FSBMJRCD+16(BFRREG),X'08'                           0527
         BNE   @RF00527                                            0527
*     CALL ISTZIFIB;                /* YES,LOGIC ERROR RECOVERY    0528
*                                                            @XL03HEK*/
         SLR   @14,@14                                             0528
         ICM   @14,7,PABDVTA+112(FMCBREG)                          0528
         L     @15,ZRCZIFIB(,@14)                                  0528
         BALR  @14,@15                                             0528
*   ELSE                            /* NO LOGIC ERROR        @XL03HEK*/
*     DO;                           /*                       @XL03HEK*/
         B     @RC00527                                            0529
@RF00527 DS    0H                                                  0530
*       DNCSESS=ON;                 /* SET DNCB SESSION      @XA06938*/
         OI    DNCSESS(DNCBREG),B'01000000'                        0530
*       IF FSBMJRCD=FRPHYSC THEN    /* ANY PHYSICAL ERROR ?          */
         CLI   FSBMJRCD+16(BFRREG),X'0C'                           0531
         BNE   @RF00531                                            0531
*         CALL ISTZIFBB;            /* ERROR ANALYSIS        @XL03HEK*/
         SLR   @14,@14                                             0532
         ICM   @14,7,PABDVTA+112(FMCBREG)                          0532
         L     @15,ZRCZIFBB(,@14)                                  0532
         BALR  @14,@15                                             0532
*       ELSE                                                       0533
*         IF FSBMJRCD=FRNETP THEN   /* NETWORK PROC.?        @XL03HEK*/
         B     @RC00531                                            0533
@RF00531 CLI   FSBMJRCD+16(BFRREG),X'80'                           0533
         BNE   @RF00533                                            0533
*           IF BTUDCF=0 THEN        /* NO DATA?              @XL03HEK*/
         ICM   @00,3,BTUDCF+48(BFRREG)                             0534
         BNZ   @RF00534                                            0534
*             DO;                   /* YES (NO DATA)         @XL03HEK*/
*               CALL IFKG00C;       /* PROCESS AS DEV WITH NO ID   0536
*                                      CHARS                 @XL03HEK*/
         BAL   @14,IFKG00C                                         0536
*               RFY                                                0537
*                 RCREG RSTD;       /*                       @XL03HEK*/
*               IF RCREG=4 THEN     /*                       @XL03HEK*/
         CH    RCREG,@CH00113                                      0538
         BNE   @RF00538                                            0538
*                 CALL IFKG000F;    /* TEST FOR DNCB DATA PRESENT  0539
*                                                            @XL03HEK*/
         BAL   @14,IFKG000F                                        0539
*               ELSE                                               0540
*                 ;                 /*                       @XL03HEK*/
@RF00538 DS    0H                                                  0541
*               RFY                                                0541
*                 RCREG UNRSTD;     /*                       @XL03HEK*/
*             END;                  /*                       @XL03HEK*/
*           ELSE                    /* THERE IS DATA         @XL03HEK*/
*                                                                  0543
*             /*******************************************************/
*             /*                                                     */
*             /* SEGMENT(IFKG00A)REQUEST                             */
*             /*                                                     */
*             /*******************************************************/
*                                                                  0543
*             DO;                                                  0543
         B     @RC00534                                            0543
@RF00534 DS    0H                                                  0544
*               GOTO IFKG00A;                                      0544
         B     IFKG00A                                             0544
*IFKG00A#:                                                         0545
*             END;                                                 0545
*         ELSE                      /* NOT NETWORK PROC.     @XL03HEK*/
*           DO;                     /*                       @XL03HEK*/
         B     @RC00533                                            0546
@RF00533 DS    0H                                                  0547
*             CALL IFKG00C;         /*                       @XL03HEK*/
         BAL   @14,IFKG00C                                         0547
*             RFY                                                  0548
*               RCREG RSTD;         /*                       @XL03HEK*/
*             IF RCREG=4 THEN       /*                       @XL03HEK*/
         CH    RCREG,@CH00113                                      0549
         BNE   @RF00549                                            0549
*               CALL IFKG000F;      /* TEST FOR DNCB DATA PRESENT  0550
*                                                            @XL03HEK*/
         BAL   @14,IFKG000F                                        0550
*             ELSE                                                 0551
*               ;                   /*                       @XL03HEK*/
@RF00549 DS    0H                                                  0552
*             RFY                                                  0552
*               RCREG UNRSTD;       /*                       @XL03HEK*/
*           END;                    /*                       @XL03HEK*/
*     END;                          /*                       @XL03HEK*/
@RC00533 DS    0H                                                  0554
@RC00531 DS    0H                                                  0555
*   IF ZCRIF0E1='1'B                /* ANY ID CHARACTERS ?           */
*     THEN                          /* NO                            */
*                                                                  0555
@RC00527 L     @15,RPHCRR(,RPHREG)                                 0555
         L     @15,CRACRR(,@15)                                    0555
         TM    ZCRIF0E1(@15),B'00001000'                           0555
         BNO   @RF00555                                            0555
*     /***************************************************************/
*     /*                                                             */
*     /* QUE FSB AS OLDEST ELEMENT ON DNCB                           */
*     /*                                                             */
*     /***************************************************************/
*                                                                  0556
*     DO;                           /*                       @XL03HEK*/
*       RFY                                                        0557
*         FSBREG RSTD;              /*                       @XL03HEK*/
*       FSBREG=ADDR(ZIBFSB);        /* ADDRESS FSB           @XL03HEK*/
         LA    FSBREG,ZIBFSB(,BFRREG)                              0558
*/*  TPQUE (FSBREG,DNCZC001) FIRST                                   */
*                                                                  0559
*       DO;                                                        0559
*         RFY                                                      0560
*          (GPR00P,                                                0560
*           GPR01P,                                                0560
*           GPR02P,                                                0560
*           GPR14P,                                                0560
*           GPR15P) RSTD;                                          0560
*         GEN REFS(GPR01P) SETS(RPHWORK)                           0561
*             (STM GPR02P,GPR08P,RPHWORK(GPR01P));                 0561
         STM GPR02P,GPR08P,RPHWORK(GPR01P)
*         GPR15P=FSBREG;            /* GET WORK ELEM POINTER         */
         LR    GPR15P,FSBREG                                       0562
*         GPR14P=ADDR(DNCZC001);    /* ADDRESS PAB/QUEUE POINTER     */
         LA    GPR14P,DNCZC001(,DNCBREG)                           0563
*         GPR02P=GPR14P->PABWEQA;                                  0564
         L     GPR02P,PABWEQA(,GPR14P)                             0564
*         GPR00P=GPR02P;                                           0565
         LR    GPR00P,GPR02P                                       0565
*CMZA0023:                                                         0566
*         ;                                                        0566
CMZA0023 DS    0H                                                  0567
*         IF GPR00P=PABWEQG1×GPR00P=0 THEN                         0567
         CL    GPR00P,@CF01661                                     0567
         BE    @RT00567                                            0567
         LTR   GPR00P,GPR00P                                       0567
         BNZ   @RF00567                                            0567
@RT00567 DS    0H                                                  0568
*           DO;                                                    0568
*             GPR15P=GPR15P×PABWEQG1;                              0569
         L     @11,@CF01661                                        0569
         OR    GPR15P,@11                                          0569
*             GPR15P->PABCHAIN=PABWEQG1;                           0570
         ST    @11,PABCHAIN(,GPR15P)                               0570
*             CS(GPR00P,GPR15P,GPR14P->PABWEQA);                   0571
         CS    GPR00P,@15,PABWEQA(GPR14P)                          0571
*             BC(8,CMZB0023);                                      0572
         BC    8,CMZB0023                                          0572
*             GPR02P=GPR00P;                                       0573
         LR    GPR02P,GPR00P                                       0573
*             GOTO CMZA0023;                                       0574
         B     CMZA0023                                            0574
*CMZB0023:                                                         0575
*             ;                                                    0575
CMZB0023 DS    0H                                                  0576
*           END;                                                   0576
*         ELSE                                                     0577
*           DO;                                                    0577
         B     @RC00567                                            0577
@RF00567 DS    0H                                                  0578
*             DO WHILE((GPR02P->PABCHAIN)^=PABCHNG1);              0578
         B     @DE00578                                            0578
@DL00578 DS    0H                                                  0579
*               GPR02P=GPR02P->PABCHAIN;                           0579
         L     GPR02P,PABCHAIN(,GPR02P)                            0579
*             END;                                                 0580
@DE00578 L     @11,@CF01661                                        0580
         CL    @11,PABCHAIN(,GPR02P)                               0580
         BNE   @DL00578                                            0580
*             GPR15P->PABCHAIN=PABCHNG1;                           0581
         ST    @11,PABCHAIN(,GPR15P)                               0581
*             GPR02P->PABCHAIN=GPR15P×PABCHNG1;                    0582
         OR    @11,GPR15P                                          0582
         ST    @11,PABCHAIN(,GPR02P)                               0582
*           END;                                                   0583
*         GEN REFS(RPHWORK,GPR01P) NOSETS                          0584
*             (LM    GPR02P,GPR08P,RPHWORK(GPR01P));               0584
@RC00567 DS    0H                                                  0584
         LM    GPR02P,GPR08P,RPHWORK(GPR01P)
*         RFY                                                      0585
*          (GPR00P,                                                0585
*           GPR01P,                                                0585
*           GPR02P,                                                0585
*           GPR14P,                                                0585
*           GPR15P) UNRSTD;                                        0585
*       END;                        /* *** END OF TPQUE GENERATION   */
*       RFY                                                        0587
*         FSBREG UNRSTD;            /*                       @XL03HEK*/
*     END;                          /*                       @XL03HEK*/
*   ELSE                            /* NO, (NO ID CHARS)     @XL03HEK*/
*                                                                  0589
*     /***************************************************************/
*     /*                                                             */
*     /* SEGMENT(IFKG00K)REQUEST                                     */
*     /*                                                             */
*     /***************************************************************/
*                                                                  0589
*     DO;                                                          0589
         B     @RC00555                                            0589
@RF00555 DS    0H                                                  0590
*       GOTO IFKG00K;                                              0590
         B     IFKG00K                                             0590
*IFKG00K#:                                                         0591
*     END;                          /* INIT FSB AND QUEUE TO PORT  0591
*                                      SOLIC INBOUND PAB     @XL03HEK*/
IFKG00K# DS    0H                                                  0592
*   IF ZCRIF0E2=ON THEN             /* PORT SOLIC IN DIALOG? @XL03HEK*/
@RC00555 L     @15,RPHCRR(,RPHREG)                                 0592
         L     @15,CRACRR(,@15)                                    0592
         TM    ZCRIF0E2(@15),B'00000100'                           0592
         BO    @RT00592                                            0592
*     ;                             /* YES                   @XL03HEK*/
*   ELSE                            /* NO, P.S. NOT IN DIALOG      0594
*                                                            @XL03HEK*/
*     IF DNCZV001=FMCBREG THEN      /* FMCB IN DEV ACTIVE Q? @XL03HEK*/
*                                                                  0594
         SLR   @00,@00                                             0594
         ICM   @00,7,DNCZV001(DNCBREG)                             0594
         CR    FMCBREG,@00                                         0594
         BNE   @RF00594                                            0594
*       /*************************************************************/
*       /*                                                           */
*       /* SEGMENT(IFKG00J)REQUEST                                   */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0595
*       DO;                                                        0595
*         GOTO IFKG00J;                                            0596
         B     IFKG00J                                             0596
*IFKG00J#:                                                         0597
*       END;                        /* SET TERMINAL OUT OF DIALOG  0597
*                                                            @XL03HEK*/
*     ELSE                          /* NO ACTIVE FMCB        @XC36514*/
*       DO;                         /*                       @XC36514*/
         B     @RC00594                                            0598
@RF00594 DS    0H                                                  0599
*         DNCINVIT=OFF;             /* SET OFF DNCB INVITE UP      0599
*                                                            @XC36514*/
         NI    DNCINVIT(DNCBREG),B'11011111'                       0599
*         FMCZFB06=OFF;             /* SET OFF FMCB INVITE UP      0600
*                                                            @XC36514*/
         NI    FMCZFB06(FMCBREG),B'11111101'                       0600
*       END;                        /*                       @XC36514*/
*   RFY                                                            0602
*     RCREG RSTD;                                                  0602
@RC00594 DS    0H                                                  0602
@RT00592 DS    0H                                                  0603
*   IF FMCZH001=FMCZHF61×FMCZH001=FMCZHF71 THEN/* DID PHYSICAL OR  0603
*                                      LOGICAL ERROR OCCUR?  @XL03HEK*/
         CLC   FMCZH001(2,FMCBREG),@CH02124                        0603
         BE    @RT00603                                            0603
         CLC   FMCZH001(2,FMCBREG),@CH02126                        0603
         BNE   @RF00603                                            0603
@RT00603 DS    0H                                                  0604
*     RCREG=ZCRNOSCH;               /* YES, SET RC TO EXIT WITH NO 0604
*                                      SCHEDULING            @XL03HEK*/
         LA    RCREG,32                                            0604
*   ELSE                            /* NO ERROR              @XL03HEK*/
*     DO;                           /*                       @XL03HEK*/
         B     @RC00603                                            0605
@RF00603 DS    0H                                                  0606
*       DNCZRSCH=ON;                /* MARK DEVICE RESCHEDULEABLE  0606
*                                                            @XL03HEK*/
         OI    DNCZRSCH(DNCBREG),B'00000100'                       0606
*       RCREG=ZCRNRSCH;             /* SET RC TO EXIT WITH SCHEDULING
*                                                            @XL03HEK*/
         LA    RCREG,36                                            0607
*       FMCZF002='0'B;              /* OFF I/O SUSPENDED FLAG IN FMCB
*                                                            @XM09560*/
         NI    FMCZF002(FMCBREG),B'10111111'                       0608
*     END;                          /*                       @XL03HEK*/
*/* TPZRETN                                                          */
*                                                                  0610
*   DO;                                                            0610
@RC00603 DS    0H                                                  0611
*     RFY                                                          0611
*      (GPR07P,                                                    0611
*       GPR14P,                                                    0611
*       GPR15P) RSTD;                                              0611
*     GPR13P=ZSAZSVBC;                                             0612
         L     GPR13P,ZSAZSVBC(,GPR13P)                            0612
*     IF GPR13P=0 THEN                                             0613
         LTR   GPR13P,GPR13P                                       0613
         BZ    @RT00613                                            0613
*       ;                           /* TPDVTS ISTZFARR               */
*     ELSE                                                         0615
*       GPR14P=ZSAZSVRR;                                           0615
         L     GPR14P,ZSAZSVRR(,GPR13P)                            0615
*     GEN REFS(ZSAZSVVR)(LM    7,12,ZSAZSVVR+0(13));               0616
@RT00613 DS    0H                                                  0616
         LM    7,12,ZSAZSVVR+0(13)
*     GEN REFS(GPR14P) EXIT NOSEQFLOW(BR    GPR14P);               0617
         BR    GPR14P
*     RFY                                                          0618
*      (GPR07P,                                                    0618
*       GPR14P,                                                    0618
*       GPR15P) UNRSTD;                                            0618
*   END;                                                           0619
*                                                                  0619
*/* END TPZRETN                                                      */
*                                                                  0620
*   GEN(EJECT);                                                    0620
         EJECT
*                                                                  0621
*/*                                                                  */
*/*                           IFKG000A                               */
*/*                                                                  */
*/* SEGMENT(IFKG00A)START                                            */
*                                                                  0621
*   DO;                                                            0621
*     GOTO IFKG00A@;                                               0622
         B     IFKG00A@                                            0622
*IFKG00A:                                                          0623
*   END;                                                           0623
IFKG00A  DS    0H                                                  0624
*   RFY                                                            0624
*     RCREG RSTD;                                                  0624
*   RFY                                                            0625
*     R0 RSTD;                                                     0625
*   WORKREG1=NCBRDTE;               /* ADDRESS PORT RDTE     @XL03HEK*/
         L     WORKREG1,NCBRDTE(,DNCBREG)                          0626
*   IF FSBMNRCD=FRMMTABS            /* TABLE SEARCH NEEDED           */
*     THEN                          /* NO, SEARCH FOR TERMINAL RDTE  */
         CLI   FSBMNRCD+16(BFRREG),X'18'                           0627
         BNE   @RF00627                                            0627
*IFKG4:                                                            0628
*     DO;                                                          0628
IFKG4    DS    0H                                                  0629
*       ZCRCIDSV(1:2)='0000'X;      /* NO SAF                        */
         L     @14,RPHCRR(,RPHREG)                                 0629
         L     @14,CRACRR(,@14)                                    0629
         MVC   ZCRCIDSV(2,@14),@CB02118                            0629
*       ZCRCIDSV(3:4)=BTUTEXT(1:2); /* GET DAF FROM TEXT             */
         MVC   ZCRCIDSV+2(2,@14),BTUTEXT+48(BFRREG)                0630
*       R0=ZCRCIDSV;                                               0631
         L     R0,ZCRCIDSV(,@14)                                   0631
*       CALL IFKG000D;              /* GET @ AND LOCK TERMINAL RDTE  */
         BAL   @14,IFKG000D                                        0632
*       WORKREG2=R0;                /* CIDCTL OUTPUT                 */
         LR    WORKREG2,R0                                         0633
*       IF RCREG=12 THEN            /* RDTE FOUND?           @XL03HEK*/
         CH    RCREG,@CH01126                                      0634
         BNE   @RF00634                                            0634
*         DO;                       /*                       @XM09063*/
*           RPTATERM=WORKREG2;      /* YES, SET ASSOC TERM ENTRY IN
*                                      PORT RDTE             @XL03HEK*/
         ST    WORKREG2,RPTATERM(,WORKREG1)                        0636
*           FSBMNRCD=FRMBSCOK;      /* R.C. TELLS PSOL RESOLUTION  0637
*                                      DONE AND NO READ AHEAD      0637
*                                                            @XM09063*/
         MVI   FSBMNRCD+16(BFRREG),X'1C'                           0637
*         END;                      /*                       @XM09063*/
*       ELSE                        /* NO, GET RDTE FROM DNCB      0639
*                                                            @XL03HEK*/
*         IF RCREG=0 THEN           /* RC FOR DNCB FOUND?    @XL03HEK*/
         B     @RC00634                                            0639
@RF00634 LTR   RCREG,RCREG                                         0639
         BNZ   @RF00639                                            0639
*           DO;                                                    0640
*             WORKREG2=WORKREG2->NCBRDTE;                          0641
         L     WORKREG2,NCBRDTE(,WORKREG2)                         0641
*             R0=ZCRCIDSV;                                         0642
         L     @14,RPHCRR(,RPHREG)                                 0642
         L     @14,CRACRR(,@14)                                    0642
         L     R0,ZCRCIDSV(,@14)                                   0642
*             CALL IFKG000E;        /* RELEASE TERMINAL DNCB LOCK    */
         BAL   @14,IFKG000E                                        0643
*             RPTATERM=WORKREG2;    /* SET ASSOC TERM ENTRY IN PORT
*                                      RDTE                  @XL03HEK*/
         ST    WORKREG2,RPTATERM(,WORKREG1)                        0644
*             FSBMNRCD=FRMBSCOK;    /* R.C. TELLS PSOL RESOLUTION  0645
*                                      DONE AND NO READ AHEAD      0645
*                                                            @XM09063*/
         MVI   FSBMNRCD+16(BFRREG),X'1C'                           0645
*           END;                                                   0646
*         ELSE                      /* BAD RC                @XL03HEK*/
*           FSBMNRCD=FRMUNID;       /* SET FSB MINOR RC: DEVICE    0647
*                                      ASSOCIATION NOT             0647
*                                      POSSIBLE@XL03HEK              */
         B     @RC00639                                            0647
@RF00639 MVI   FSBMNRCD+16(BFRREG),X'14'                           0647
*     END IFKG4;                                                   0648
*   ELSE                                                           0649
*     DO;                           /*                       @XL03HEK*/
         B     @RC00627                                            0649
@RF00627 DS    0H                                                  0650
*       IF FSBMNRCD=FRMBSCER THEN   /* NCP VERIFY FAIL?      @XM03HDP*/
         CLI   FSBMNRCD+16(BFRREG),X'90'                           0650
         BNE   @RF00650                                            0650
*         DO;                       /*                       @XA06938*/
*           FMCZH001=FMCZHF71;      /* PHYS ERR LINE ST.     @XA06938*/
         MVC   FMCZH001(2,FMCBREG),@CH02126                        0652
*           DNCZF001='1'B;          /* YES, SET ERROR LOCK   @XM03HDP*/
         OI    DNCZF001(DNCBREG),B'10000000'                       0653
*         END;                      /*                       @XA06938*/
*       ELSE                                                       0655
*         ;                         /* NOT NCP VERIFY FAILURE      0655
*                                                            @XM03HDP*/
*                                                                  0655
@RF00650 DS    0H                                                  0656
*       /*************************************************************/
*       /*                                                           */
*       /* SEGMENT(IFKG00B)REQUEST                                   */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0656
*       DO;                                                        0656
*         GOTO IFKG00B;                                            0657
         B     IFKG00B                                             0657
*IFKG00B#:                                                         0658
*       END;                        /* SEARCH DIV TABLE              */
IFKG00B# DS    0H                                                  0659
*       IF FSBMNRCD=FRMBSCER×FSBMNRCD=FRMBSCKO THEN/* BSC ID       0659
*                                      VERIFIED?             @XL03HDP*/
         LA    @14,16                                              0659
         ALR   @14,BFRREG                                          0659
         CLI   FSBMNRCD(@14),X'90'                                 0659
         BE    @RT00659                                            0659
         CLI   FSBMNRCD(@14),X'1E'                                 0659
         BNE   @RF00659                                            0659
@RT00659 DS    0H                                                  0660
*         DO;                       /* YES                   @XL03HEK*/
*           DNCINVIT=OFF;           /* SET OFF DNCB INVITE UP      0661
*                                                            @XC36514*/
         NI    DNCINVIT(DNCBREG),B'11011111'                       0661
*           FMCZFB06=OFF;           /* SET OFF FMCB INVITE UP      0662
*                                                            @XC36514*/
         NI    FMCZFB06(FMCBREG),B'11111101'                       0662
*           CALL IFKG000G;          /* SET PORT SOLICITOR IN SESSION
*                                                            @XL03HEK*/
         BAL   @14,IFKG000G                                        0663
*         END;                      /*                       @XL03HEK*/
*       ELSE                                                       0665
*         ;                         /* BSC ID NOT VERIFIED   @XL03HEK*/
@RF00659 DS    0H                                                  0666
*     END;                          /*                       @XL03HEK*/
*/* SEGMENT(IFKG00A)FINISH                                           */
*                                                                  0667
*   DO;                                                            0667
@RC00627 DS    0H                                                  0668
*     GOTO IFKG00A#;                                               0668
         B     IFKG00A#                                            0668
*IFKG00A@:                                                         0669
*   END;                                                           0669
IFKG00A@ DS    0H                                                  0670
*   GEN(EJECT);                                                    0670
         EJECT
*                                                                  0671
*/*                                                                  */
*/*                      IFKG000B                                    */
*/*                                                                  */
*/* SEGMENT(IFKG00B)START                                            */
*                                                                  0671
*   DO;                                                            0671
*     GOTO IFKG00B@;                                               0672
         B     IFKG00B@                                            0672
*IFKG00B:                                                          0673
*   END;                                                           0673
IFKG00B  DS    0H                                                  0674
*   IF RPTDIVT=0                    /* ANY DIVT ?                    */
*     THEN                          /* NO                            */
         ICM   @14,15,RPTDIVT(WORKREG1)                            0674
         BNZ   @RF00674                                            0674
*     ZCRIF0E2='1'B;                /* SET UNSUCCESSFUL SEARCH FLAG  */
         L     @14,RPHCRR(,RPHREG)                                 0675
         L     @14,CRACRR(,@14)                                    0675
         OI    ZCRIF0E2(@14),B'00000100'                           0675
*   ELSE                                                           0676
*IFKG5:                                                            0676
*     DO;                                                          0676
         B     @RC00674                                            0676
@RF00674 DS    0H                                                  0676
IFKG5    DS    0H                                                  0677
*       ZCRIF0E2='0'B;              /* INITIALIZE SEARCH FLAG        */
         L     @14,RPHCRR(,RPHREG)                                 0677
         L     @14,CRACRR(,@14)                                    0677
         NI    ZCRIF0E2(@14),B'11111011'                           0677
*       WORKREG2=RPTDIVT+LENGTH(ISTDIVTH);/* ADDRESS FIRST ENTRY     */
         LA    WORKREG2,8                                          0678
         AL    WORKREG2,RPTDIVT(,WORKREG1)                         0678
*       R0=1;                       /* SET COUNTER                   */
         LA    R0,1                                                0679
*       ZCRIF0E3='1'B;              /* SET LOOP SWITCH               */
         OI    ZCRIF0E3(@14),B'00000010'                           0680
*       DO WHILE ZCRIF0E3='1'B;     /* SEARCH DIVT                   */
         B     @DE00681                                            0681
@DL00681 DS    0H                                                  0682
*         ZCRIF0E3='0'B;            /* SET DEFAULT LOOP EXIT         */
         L     @14,RPHCRR(,RPHREG)                                 0682
         L     @14,CRACRR(,@14)                                    0682
         NI    ZCRIF0E3(@14),B'11111101'                           0682
*         IF DVEBSCAR(1:DVEBSCLN)=BTUTEXT(1:DVEBSCLN)/* ID'S MATCH   */
*           THEN                    /* YES                           */
         SLR   @14,@14                                             0683
         IC    @14,DVEBSCLN(,WORKREG2)                             0683
         BCTR  @14,0                                               0683
         EX    @14,@SC04499                                        0683
         BNE   @RF00683                                            0683
*           RPTATERM=DVERDTEA;      /* MOVE TERMINAL RDTE @ IO PORT
*                                      RDTE                          */
         MVC   RPTATERM(4,WORKREG1),DVERDTEA(WORKREG2)             0684
*         ELSE                      /* NO, THIS ENTRY NOT SAME AS    */
*                                                                  0685
*           /*********************************************************/
*           /*                                                       */
*           /* TERMINAL SENDING ID                                   */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0685
*           IF R0=RPTDIVT->DIVNUME  /* END OF TABLE ?                */
*             THEN                  /* YES, SET NUT FOUND SWITCH     */
         B     @RC00683                                            0685
@RF00683 L     @14,RPTDIVT(,WORKREG1)                              0685
         CH    R0,DIVNUME(,@14)                                    0685
         BNE   @RF00685                                            0685
*             ZCRIF0E2='1'B;                                       0686
         L     @14,RPHCRR(,RPHREG)                                 0686
         L     @14,CRACRR(,@14)                                    0686
         OI    ZCRIF0E2(@14),B'00000100'                           0686
*           ELSE                    /* NO, ADDRESS NEXT ENTRY        */
*             DO;                                                  0687
         B     @RC00685                                            0687
@RF00685 DS    0H                                                  0688
*               R0=R0+1;                                           0688
         AH    R0,@CH00082                                         0688
*               WORKREG2=WORKREG2+LENGTH(ISTDVE)+RPTDIVT->DIVIDLEN;
         LA    @14,5                                               0689
         ALR   @14,WORKREG2                                        0689
         L     @11,RPTDIVT(,WORKREG1)                              0689
         AH    @14,DIVIDLEN(,@11)                                  0689
         LR    WORKREG2,@14                                        0689
*               ZCRIF0E3='1'B;      /* SET CONTINUE TO LOOP          */
         L     @14,RPHCRR(,RPHREG)                                 0690
         L     @14,CRACRR(,@14)                                    0690
         OI    ZCRIF0E3(@14),B'00000010'                           0690
*             END;                                                 0691
*       END;                        /* END OF DO WHILE               */
@RC00685 DS    0H                                                  0692
@RC00683 DS    0H                                                  0692
@DE00681 L     @14,RPHCRR(,RPHREG)                                 0692
         L     @14,CRACRR(,@14)                                    0692
         TM    ZCRIF0E3(@14),B'00000010'                           0692
         BO    @DL00681                                            0692
*     END IFKG5;                                                   0693
*   IF ZCRIF0E2=ON THEN             /* WAS BSC ID FOUND IN DIVT ?    */
@RC00674 L     @14,RPHCRR(,RPHREG)                                 0694
         L     @14,CRACRR(,@14)                                    0694
         TM    ZCRIF0E2(@14),B'00000100'                           0694
         BNO   @RF00694                                            0694
*IFKG6:                                                            0695
*     DO;                           /* NO, CONTINUE          @XL03HEK*/
IFKG6    DS    0H                                                  0696
*       ZCRIF0E2=OFF;               /*                       @XL03HEK*/
         L     @14,RPHCRR(,RPHREG)                                 0696
         L     @14,CRACRR(,@14)                                    0696
         NI    ZCRIF0E2(@14),B'11111011'                           0696
*       IF RPTUTERM=0               /* UNIDENTIFIED ENTRY IN PORT  0697
*                                      RDTE                          */
*         THEN                      /* NO                            */
         ICM   @14,15,RPTUTERM(WORKREG1)                           0697
         BNZ   @RF00697                                            0697
*IFKG7:                                                            0698
*         DO;                                                      0698
IFKG7    DS    0H                                                  0699
*           IF RPTATERM=0           /* ASSOCIATED TERMINAL IN PORT 0699
*                                      RDT                           */
*             THEN                  /* NO, ERROR CONDITION           */
         ICM   @14,15,RPTATERM(WORKREG1)                           0699
         BNZ   @RF00699                                            0699
*IFKG8:                                                            0700
*             DO;                                                  0700
IFKG8    DS    0H                                                  0701
*               IF FSBMNELI='1'B    /* ERROR LOCK SET ?              */
*                 THEN              /* YES                           */
         TM    FSBMNELI+16(BFRREG),B'10000000'                     0701
         BNO   @RF00701                                            0701
*IFKG9:                                                            0702
*                 DO;                                              0702
IFKG9    DS    0H                                                  0703
*                   FSBMNRCD=FRMNUTRM;/* RC = LOCKED SET + ERROR     */
         MVI   FSBMNRCD+16(BFRREG),X'94'                           0703
*                   DNCZF001='1'B;  /* SET DEVICE ERR.LOCK           */
         OI    DNCZF001(DNCBREG),B'10000000'                       0704
*                   ADDR(FMCPAB3)->PABERLOK='1'B;                  0705
*                                                                  0705
         OI    PABERLOK+96(FMCBREG),B'00000100'                    0705
*                   /*************************************************/
*                   /*                                               */
*                   /* SET TOP ERROR LOCK                    @ZA13703*/
*                   /*                                               */
*                   /*************************************************/
*                                                                  0706
*                   FMCZH001=FMCZHF71;/* SET LINE STATE = PHYSICAL 0706
*                                      ERR                           */
         MVC   FMCZH001(2,FMCBREG),@CH02126                        0706
*                 END IFKG9;                                       0707
*               ELSE                /* NCP ERROR LOCK NOT SET      0708
*                                                            @XA07978*/
*                 FSBMNRCD=FRMUNID; /* RESOLUTION IMPOSSIBLE @XA07978*/
         B     @RC00701                                            0708
@RF00701 MVI   FSBMNRCD+16(BFRREG),X'14'                           0708
*             END IFKG8;                                           0709
*           ELSE                                                   0710
*             ;                     /* YES, THERE IS A RPTATERM      */
@RF00699 DS    0H                                                  0711
*         END IFKG7;                                               0711
*       ELSE                        /* YES, THERE IS UNIDENTIFIED  0712
*                                      TERM                          */
*         DO;                                                      0712
         B     @RC00697                                            0712
@RF00697 DS    0H                                                  0713
*           RPTATERM=RPTUTERM;      /* UNIDENTIFIED TERMINAL BECOMES
*                                      PORT ASSOCIATED TERMINAL      */
         MVC   RPTATERM(4,WORKREG1),RPTUTERM(WORKREG1)             0713
*           RFY                                                    0714
*             FSBREG RSTD;          /*                       @XL03HEK*/
*           FSBREG=ADDR(ZIBBTU);    /* COVER BTU             @XL03HEK*/
         LA    FSBREG,ZIBBTU(,BFRREG)                              0715
*           ZCRSVF20=MIN(LENGTH(RTRIDCAS),BTUDCF);/* PUT ID IN ZCR 0716
*                                                            @XM18370*/
         L     @14,RPHCRR(,RPHREG)                                 0716
         L     @14,CRACRR(,@14)                                    0716
         SLR   @11,@11                                             0716
         ICM   @11,3,BTUDCF+48(BFRREG)                             0716
         LA    @10,20                                              0716
         CR    @11,@10                                             0716
         BNH   *+6
         LR    @11,@10                                             0716
         ST    @11,ZCRSVF20(,@14)                                  0716
*FKGLB010:                                                         0717
*           RPTUTERM->RTRIDCAS=BTUTEXT(1:ZCRSVF20);/* MOVE BSC ID TO
*                                      UTERM RDTE            @XM18370*/
FKGLB010 L     @14,RPTUTERM(,WORKREG1)                             0717
         MVI   RTRIDCAS+1(@14),C' '                                0717
         MVC   RTRIDCAS+2(18,@14),RTRIDCAS+1(@14)                  0717
         L     @11,RPHCRR(,RPHREG)                                 0717
         L     @11,CRACRR(,@11)                                    0717
         L     @11,ZCRSVF20(,@11)                                  0717
         BCTR  @11,0                                               0717
         EX    @11,@SM04501                                        0717
*FKGLB020:                                                         0718
*           RPTUTERM->RTRIDLEN=ZCRSVF20;/* SAVE ID CNT       @XM18370*/
FKGLB020 L     @14,RPTUTERM(,WORKREG1)                             0718
         L     @11,RPHCRR(,RPHREG)                                 0718
         L     @11,CRACRR(,@11)                                    0718
         MVC   RTRIDLEN(1,@14),ZCRSVF20+3(@11)                     0718
*           RFY                                                    0719
*             FSBREG UNRSTD;        /*                       @XL03HEK*/
*         END;                                                     0720
*     END IFKG6;                    /*                       @XL03HEK*/
*   ELSE                                                           0722
*     ;                             /* YES TERMINAL ENTRY WAS FOUND
*                                      IN DIV TABLE - EXIT   @XL03HEK*/
@RF00694 DS    0H                                                  0723
*/* SEGMENT(IFKG00B)FINISH                                           */
*                                                                  0723
*   DO;                                                            0723
@RC00694 DS    0H                                                  0724
*     GOTO IFKG00B#;                                               0724
         B     IFKG00B#                                            0724
*IFKG00B@:                                                         0725
*   END;                                                           0725
IFKG00B@ DS    0H                                                  0726
*   GEN(EJECT);                                                    0726
         EJECT
*                                                                  0727
*/*                                                                  */
*/*                      IFKG000C                                    */
*/*                                                                  */
*                                                                  0727
*IFKG00C:                                                          0727
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);/*                       @XL03HEK*/
         B     @PB00002                                            0727
IFKG00C  DS    0H                                                  0728
*   RFY                                                            0728
*     R14 RSTD;                     /*                       @XL03HEK*/
*   ZCRSVF11=R14;                   /* SAVE RETURN REGISTER  @XL03HEK*/
         L     @11,RPHCRR(,RPHREG)                                 0729
         L     @11,CRACRR(,@11)                                    0729
         ST    R14,ZCRSVF11(,@11)                                  0729
*   RFY                                                            0730
*     R14 UNRSTD;                   /*                       @XL03HEK*/
*   WORKREG1=NCBRDTE;               /* ADDRESS PORT RDTE     @XL03HEK*/
         L     WORKREG1,NCBRDTE(,DNCBREG)                          0731
*   IF RPTUTERM=0 THEN              /* ANY UNIDENTIFIED TERM?      0732
*                                                            @XL03HEK*/
         SLR   @14,@14                                             0732
         C     @14,RPTUTERM(,WORKREG1)                             0732
         BNE   @RF00732                                            0732
*     DO;                           /*                       @XL03HEK*/
*       RFY                                                        0734
*         ISTFDB BASED(ADDR(ZIBFDBZ));/* REBASE FDB          @XM18963
*                                      TO TPIOS FDB          @XM18963*/
*       IF(FDBFDBA&'00FFFFFF'X)=0 THEN/* NO, FSB BUFFER ONLY?      0735
*                                                            @XL03HEK*/
         L     @11,FDBFDBA(,BFRREG)                                0735
         N     @11,@CF04426                                        0735
         CR    @11,@14                                             0735
         BE    @RT00735                                            0735
*         ;                         /* YES                   @XL03HEK*/
*       ELSE                        /* NO, OTHER BUFFERS     @XL03HEK*/
*         DO;                       /*                       @XL03HEK*/
*           WORKREG2=ELEMREG;       /* SAVE LCPB/LSCB PTR    @XL03HEK*/
         LR    WORKREG2,ELEMREG                                    0738
*           ELEMREG=FDBFDBA&'00FFFFFF'X;/* SET ADDR OF 1ST OF BUFFER
*                                      CHAIN TO RELEASE      @XL03HEK*/
         L     ELEMREG,FDBFDBA(,BFRREG)                            0739
         N     ELEMREG,@CF04426                                    0739
*           ZCRPCOD1='00'X;                                        0740
         L     @14,RPHCRR(,RPHREG)                                 0740
         L     @14,CRACRR(,@14)                                    0740
         MVI   ZCRPCOD1(@14),X'00'                                 0740
*           ZCRPBUF=ON;             /* SET PARMS TO REL BUFFS      0741
*                                                            @XL03HEK*/
         OI    ZCRPBUF(@14),B'00000100'                            0741
*           CALL ISTZDFB0;          /* BUFFER DEALLOCATION   @XL03HEK*/
         L     @14,ATCZPSVT(,CVTREG)                               0742
         L     @15,ZPSZDFB0(,@14)                                  0742
         BALR  @14,@15                                             0742
*           FDBFDBA=0;              /* ZERO FSB BUFF FRWD PTR      0743
*                                                            @XL03HEK*/
         SLR   @14,@14                                             0743
         ST    @14,FDBFDBA(,BFRREG)                                0743
*           ELEMREG=WORKREG2;       /* RESTORE LCPB/LSCB PTR @XL03HEK*/
         LR    ELEMREG,WORKREG2                                    0744
*           RFY                                                    0745
*             ISTFDB BASED(ADDR(ZIBFDBS));/* REBASE FDB      @XM18963
*                                      TO SYSTEM FDB         @XM18963*/
*         END;                      /*                       @XL03HEK*/
*/* SETTING OF MAJOR RETURN CODE WILL BE DONE LATER...       @XL03HDP*/
*                                                                  0747
*       FSBMNRCD=FRMUNID;           /* RESOLUTION NOT POSSIBLE       */
@RT00735 LA    @14,16                                              0747
         ALR   @14,BFRREG                                          0747
         MVI   FSBMNRCD(@14),X'14'                                 0747
*       FMCZH001=FMCZHF61;          /* LINE STATE = LOGICAL ERROR    */
         MVC   FMCZH001(2,FMCBREG),@CH02124                        0748
*       ADDR(FMCPAB3)->PABERLOK='1'B;/* OUTBOUND PAB ERROR   @ZA13703*/
         OI    PABERLOK+96(FMCBREG),B'00000100'                    0749
*       FSBECI='1'B;                /* LAST FSB FOR LCCW             */
*       FSBELI='1'B;                /* LAST FSB FOR LCPB             */
         OI    FSBECI(@14),B'11000000'                             0751
*       IF FSBMJRCD=FRNETP THEN     /* MAJ RC = NETWORK PROC @XL03HDP*/
         CLI   FSBMJRCD(@14),X'80'                                 0752
         BNE   @RF00752                                            0752
*         RCREG=0;                  /* SET REGISTER 15       @XL03HDP*/
         SLR   RCREG,RCREG                                         0753
*       ELSE                        /* MAJ RC NOT NET PROC   @XL03HDP*/
*         DO;                                                      0754
         B     @RC00752                                            0754
@RF00752 DS    0H                                                  0755
*           FSBMJRCD=FRNETP;        /* SET MAJOR RETURN CODE @XL03HDP*/
         MVI   FSBMJRCD+16(BFRREG),X'80'                           0755
*           RCREG=4;                /*                       @XL03HEK*/
         LA    RCREG,4                                             0756
*         END;                                                     0757
*     END;                          /*                       @XL03HEK*/
*   ELSE                            /*                       @XL03HEK*/
*     DO;                                                          0759
         B     @RC00732                                            0759
@RF00732 DS    0H                                                  0760
*       RPTATERM=RPTUTERM;          /* UTERM IS ASSOCIATED TO PORT   */
         L     @14,RPTUTERM(,WORKREG1)                             0760
         ST    @14,RPTATERM(,WORKREG1)                             0760
*       RPTUTERM->RTRIDCAS=RPTUTERM->RTRIDCAS&&RPTUTERM->RTRIDCAS;/*
*                                      ZERO BSC ID CHARS IN UTERM  0761
*                                      RDTE                  @XL03HEK*/
         XC    RTRIDCAS(20,@14),RTRIDCAS(@14)                      0761
*       IF FSBMJRCD=FRNETP THEN     /* FSB MAJ RC NET PROCG? @XL03HEK*/
         LA    @14,16                                              0762
         ALR   @14,BFRREG                                          0762
         CLI   FSBMJRCD(@14),X'80'                                 0762
         BNE   @RF00762                                            0762
*         IF FSBMNRCD=FRMBSCER      /* FSB MIN RC = NCP VERIFY     0763
*                                      FAILED?               @XL03HEK*/
*             ×FSBMNRCD=FRMBSCKO THEN/* OR VERIFIED ?        @XL03HDP*/
         CLI   FSBMNRCD(@14),X'90'                                 0763
         BE    @RT00763                                            0763
         CLI   FSBMNRCD(@14),X'1E'                                 0763
         BNE   @RF00763                                            0763
@RT00763 DS    0H                                                  0764
*           DO;                     /* YES,                  @XL03HEK*/
*             DNCINVIT=OFF;         /* SET OFF DNCB INVITE UP      0765
*                                                            @XC36514*/
         NI    DNCINVIT(DNCBREG),B'11011111'                       0765
*             FMCZFB06=OFF;         /* SET OFF FMCB INVITE UP      0766
*                                                            @XC36514*/
         NI    FMCZFB06(FMCBREG),B'11111101'                       0766
*             CALL IFKG000G;        /* SET PORT SOL IN SESS  @XL03HEK*/
         BAL   @14,IFKG000G                                        0767
*             IF FSBMNRCD=FRMBSCER THEN/* NCP VERIFY FAILED ?      0768
*                                                            @XL03HDP*/
         CLI   FSBMNRCD+16(BFRREG),X'90'                           0768
         BNE   @RF00768                                            0768
*               DO;                 /*                       @XA06938*/
*                 FMCZH001=FMCZHF71;/* PHYS ERR LINE ST.     @XA06938*/
         MVC   FMCZH001(2,FMCBREG),@CH02126                        0770
*                 DNCZF001=ON;      /* SET ERROR LOCK        @XM03HDP*/
         OI    DNCZF001(DNCBREG),B'10000000'                       0771
*               END;                /*                       @XA06938*/
*             ELSE                                                 0773
*               ;                                                  0773
@RF00768 DS    0H                                                  0774
*           END;                    /*                       @XL03HEK*/
*         ELSE                                                     0775
*           ;                       /* NOT NCP VERIFY FAILURE      0775
*                                                            @XL03HEK*/
@RF00763 DS    0H                                                  0776
*       ELSE                        /* NOT NET PROCESSING    @XL03HEK*/
*         DO;                       /*                       @XL03HEK*/
         B     @RC00762                                            0776
@RF00762 DS    0H                                                  0777
*           FMCZFB06='0'B;          /* TURN OFF FMCB INVITE UP FLAG
*                                                            @ZA08427*/
*           FMCZFA06='1'B;          /* TURN ON FMCB IN SESSION FLAG
*                                                            @ZA08427*/
         OI    FMCZFA06(FMCBREG),B'00000100'                       0778
         NI    FMCZFB06(FMCBREG),B'11111101'                       0778
*           ZCRIF0E1=ON;            /*                       @XL03HEK*/
         L     @14,RPHCRR(,RPHREG)                                 0779
         L     @14,CRACRR(,@14)                                    0779
         OI    ZCRIF0E1(@14),B'00001000'                           0779
*           ZCRPCOD1='00'X;         /* FSB ALLOCATION                */
         MVI   ZCRPCOD1(@14),X'00'                                 0780
*           ZCRPFSB='1'B;           /* PARAMATER                     */
         OI    ZCRPFSB(@14),B'00100000'                            0781
*           CALL ISTZDFA0;          /* GET A FSB             @XL03HEK*/
         L     @14,ATCZPSVT(,CVTREG)                               0782
         L     @15,ZPSZDFA0(,@14)                                  0782
         BALR  @14,@15                                             0782
*           RFY                                                    0783
*             FSBREG RSTD;          /*                       @XL03HEK*/
*           RFY                                                    0784
*             ISTFSB BASED(FSBREG); /* COVER NEW FSB         @XL03HEK*/
*           FSBREG=RPHSRPRM;                                       0785
         L     FSBREG,RPHSRPRM(,RPHREG)                            0785
*           FSBLCPB=ELEMREG;        /* PUT LCPB @ IN FSB             */
         ST    ELEMREG,FSBLCPB(,FSBREG)                            0786
*           FSBLCCWA=LCPNXLCW;      /* LCCW @ IN FSB                 */
         MVC   FSBLCCWA(4,FSBREG),LCPNXLCW(ELEMREG)                0787
*           FSBSAF=FMCSAF;          /* SAF IN FSB                    */
         MVC   FSBSAF(2,FSBREG),FMCSAF(FMCBREG)                    0788
*           FSBDAF=BTUDEST;         /* DAF IN FSB                    */
         MVC   FSBDAF(2,FSBREG),BTUDEST+48(BFRREG)                 0789
*           FSBMJRCD=FRNETP;        /* NETWORK PROCESSING RETURN CODE*/
         MVI   FSBMJRCD(FSBREG),X'80'                              0790
*           FSBMNRCD=FRMBSCOK;      /* R.C. TELLS PSOL RESOLUTION  0791
*                                      DONE AND NO READ AHEAD      0791
*                                                            @XM09063*/
         MVI   FSBMNRCD(FSBREG),X'1C'                              0791
*           FSBECI='1'B;            /* LAST FSB FOR LCCW             */
*           FSBELI='1'B;            /* LAST FSB FOR LCPB             */
*                                                                  0793
         OI    FSBECI(FSBREG),B'11000000'                          0793
*           /*********************************************************/
*           /*                                                       */
*           /* Q NEW FSB TO PORT SOLICITOR INBOUND PAB               */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0794
*/*  TPQUE (FSBREG,FMCPAB2) NORM                                     */
*                                                                  0794
*           DO;                                                    0794
*             RFY                                                  0795
*              (GPR00P,                                            0795
*               GPR01P,                                            0795
*               GPR04P,                                            0795
*               GPR05P,                                            0795
*               GPR15P) RSTD;                                      0795
*             GEN REFS(GPR01P) SETS(RPHWORK)                       0796
*                 (STM GPR02P,GPR08P,RPHWORK(GPR01P));             0796
         STM GPR02P,GPR08P,RPHWORK(GPR01P)
*             GPR00P=0;                                            0797
         SLR   GPR00P,GPR00P                                       0797
*             GPR15P=ADDR(FMCPAB2); /* HOLD PAB PTR                  */
         LA    GPR15P,FMCPAB2(,FMCBREG)                            0798
*             GPR04P=FSBREG;        /* WORK ELE PTR                  */
         LR    GPR04P,FSBREG                                       0799
*             GPR05P=GPR15P;        /* PASS PAB PTR                  */
         LR    GPR05P,GPR15P                                       0800
*             CALL ATCLCPTR->ATCAP37->ISTAPC37;                    0801
         L     @14,ATCLCPTR                                        0801
         L     @15,ATCAP37(,@14)                                   0801
         BALR  @14,@15                                             0801
*             GEN(NOPR  0)                                         0802
*             NOSETS NOREFS;                                       0802
         NOPR  0
*             RFY                                                  0803
*              (GPR00P,                                            0803
*               GPR01P,                                            0803
*               GPR04P,                                            0803
*               GPR05P,                                            0803
*               GPR15P) UNRSTD;                                    0803
*           END;                    /* *** END OF TPQUE GENERATION   */
*           RFY                                                    0805
*             FSBREG UNRSTD;        /*                       @XL03HEK*/
*           RFY                                                    0806
*             ISTFSB BASED(ADDR(ZIBFSB));/* REVERT TO NORMAL COVER 0806
*                                      FOR FSB               @XL03HEK*/
*         END;                      /*                       @XL03HEK*/
*       RCREG=0;                    /*                       @XL03HEK*/
@RC00762 SLR   RCREG,RCREG                                         0808
*     END;                          /*                       @XL03HEK*/
*   RFY                                                            0810
*     R14 RSTD;                     /*                       @XL03HEK*/
@RC00732 DS    0H                                                  0811
*   R14=ZCRSVF11;                   /* RESTORE WORK REGISTER @XL03HEK*/
         L     @11,RPHCRR(,RPHREG)                                 0811
         L     @11,CRACRR(,@11)                                    0811
         L     R14,ZCRSVF11(,@11)                                  0811
*   RFY                                                            0812
*     R14 UNRSTD;                   /*                       @XL03HEK*/
*   END IFKG00C;                    /*                       @XL03HEK*/
@EL00002 DS    0H                                                  0813
@EF00002 DS    0H                                                  0813
@ER00002 BR    @14                                                 0813
@PB00002 DS    0H                                                  0814
*   GEN(EJECT);                                                    0814
         EJECT
*IFKG000D:                                                         0815
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0815
*                                                                  0815
         B     @PB00003                                            0815
IFKG000D DS    0H                                                  0816
*/*                                                                  */
*/* THIS SUBROUTINE WILL SET UP PARAMATERS FOR CIDCTL, ISSUE THE     */
*/* MACRO AND PASS THE RETURN CODE (R15) AND OUTPUT(R0) TO THE       */
*/* CALLER. R0 CONTAINS THE CID ON INPUT.                            */
*/*                                                                  */
*                                                                  0816
*   RFY                                                            0816
*     R14 RSTD;                                                    0816
*   ZCRSVF10=R14;                   /* SAVE RETURN REGISTER          */
         L     @11,RPHCRR(,RPHREG)                                 0817
         L     @10,CRACRR(,@11)                                    0817
         ST    R14,ZCRSVF10(,@10)                                  0817
*   ZCRR2SV=R2;                     /* SAVE CIDCTL PARM. REG         */
         ST    R2,ZCRR2SV(,@10)                                    0818
*   ZCRR13SV=R13;                   /* SAVE TPIOS SAVE AREA CHAIN    */
         ST    R13,ZCRR13SV(,@10)                                  0819
*   R2=R0;                          /* SET UP CIDCTL PARAM           */
         LR    R2,R0                                               0820
*   R13=ADDR(CRASVC);               /* SAVE AREA FOR USE BY CIDCTL   */
         LA    R13,CRASVC(,@11)                                    0821
*   DO;                             /* CIDCTL(FIND) LOCK(XCLUSIVE)   */
*     RFY                                                          0823
*      (EMCR2,                                                     0823
*       EMCR3) RSTD;                                               0823
*     GEN SETS(RPHWORK)                                            0824
*         (STM EMCR0,EMCR15,RPHWORK(RPHPTR) SAVE REGS IN RPH);     0824
         STM EMCR0,EMCR15,RPHWORK(RPHPTR) SAVE REGS IN RPH
*     EMCR3='00'X;                  /* CLEAR EXTRA BITS              */
         SLR   EMCR3,EMCR3                                         0825
*     EMCR3='02'X;                  /* INDICATE EXCLUSIVE LOCK       */
         LA    EMCR3,2                                             0826
*     CALL ATCLCPTR->ATCCDFND->ISTSDCCF;/* PROCESS REQUEST           */
         L     @11,ATCLCPTR                                        0827
         L     @15,ATCCDFND(,@11)                                  0827
         BALR  @14,@15                                             0827
*     RFY                                                          0828
*      (EMCR2,                                                     0828
*       EMCR3) UNRSTD;                                             0828
*   END;                            /* CIDCTL                        */
*   R2=ZCRR2SV;                     /* RESTORE REGS DESTROYED        */
         L     @11,RPHCRR(,RPHREG)                                 0830
         L     @11,CRACRR(,@11)                                    0830
         L     R2,ZCRR2SV(,@11)                                    0830
*   R13=ZCRR13SV;                   /* FOR CIDCTL                    */
         L     R13,ZCRR13SV(,@11)                                  0831
*   R14=ZCRSVF10;                   /* RESTORE WORK REGISTER         */
         L     R14,ZCRSVF10(,@11)                                  0832
*   RFY                                                            0833
*     R14 UNRSTD;                                                  0833
*   END IFKG000D;                                                  0834
@EL00003 DS    0H                                                  0834
@EF00003 DS    0H                                                  0834
@ER00003 BR    @14                                                 0834
@PB00003 DS    0H                                                  0835
*   GEN(EJECT);                                                    0835
         EJECT
*IFKG000E:                                                         0836
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0836
*                                                                  0836
         B     @PB00004                                            0836
IFKG000E DS    0H                                                  0837
*/*                                                                  */
*/* THIS ROUTINE WILL RELEASE DNCB LOCKS VIA CIDCTL.  RO=CID ON      */
*/* ENTRY.                                                           */
*/*                                                                  */
*                                                                  0837
*   RFY                                                            0837
*     R14 RSTD;                                                    0837
*   ZCRSVF10=R14;                   /* SAVE RETURN REGISTER          */
         L     @11,RPHCRR(,RPHREG)                                 0838
         L     @10,CRACRR(,@11)                                    0838
         ST    R14,ZCRSVF10(,@10)                                  0838
*   R2=R0;                          /* CIDCTL PARAMATER              */
         LR    R2,R0                                               0839
*   R13=ADDR(CRASVC);               /* SAVE AREA FOR USE BY CIDCTL   */
         LA    R13,CRASVC(,@11)                                    0840
*   DO;                             /* CIDCTL(FINISH)                */
*     RFY                                                          0842
*      (EMCR2,                                                     0842
*       EMCR3) RSTD;                                               0842
*     GEN SETS(RPHWORK)                                            0843
*         (STM EMCR0,EMCR15,RPHWORK(RPHPTR) SAVE REGS IN RPH);     0843
         STM EMCR0,EMCR15,RPHWORK(RPHPTR) SAVE REGS IN RPH
*     EMCR3='00'X;                  /* CLEAR EXTRA BITS              */
         SLR   EMCR3,EMCR3                                         0844
*     CALL ATCLCPTR->ATCCDFIN->ISTSDCCR;/* PROCESS REQUEST           */
         L     @11,ATCLCPTR                                        0845
         L     @15,ATCCDFIN(,@11)                                  0845
         BALR  @14,@15                                             0845
*     RFY                                                          0846
*      (EMCR2,                                                     0846
*       EMCR3) UNRSTD;                                             0846
*   END;                            /* CIDCTL                        */
*   R2=ZCRR2SV;                     /* RESTORE                       */
         L     @11,RPHCRR(,RPHREG)                                 0848
         L     @11,CRACRR(,@11)                                    0848
         L     R2,ZCRR2SV(,@11)                                    0848
*   R13=ZCRR13SV;                   /* CHANGED                       */
         L     R13,ZCRR13SV(,@11)                                  0849
*   R14=ZCRSVF10;                   /* REGS.                         */
         L     R14,ZCRSVF10(,@11)                                  0850
*   RFY                                                            0851
*     R14 UNRSTD;                                                  0851
*   END IFKG000E;                                                  0852
@EL00004 DS    0H                                                  0852
@EF00004 DS    0H                                                  0852
@ER00004 BR    @14                                                 0852
@PB00004 DS    0H                                                  0853
*   GEN(EJECT);                                                    0853
         EJECT
*                                                                  0854
*/*                                                                  */
*/*                      IFKG000F          ROUTINE S/D CODE: @XL03HEK*/
*/*                                                                  */
*                                                                  0854
*IFKG000F:                                                         0854
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);/*                       @XL03HEK*/
         B     @PB00005                                            0854
IFKG000F DS    0H                                                  0855
*   RFY                                                            0855
*     R14 RSTD;                     /*                       @XL03HEK*/
*   ZCRSVF11=R14;                   /* SAVE RETURN REGISTER  @XL03HEK*/
         L     @11,RPHCRR(,RPHREG)                                 0856
         L     @11,CRACRR(,@11)                                    0856
         ST    R14,ZCRSVF11(,@11)                                  0856
*   RFY                                                            0857
*     R14 UNRSTD;                   /*                       @XL03HEK*/
*   DNCZF008=ON;                    /* SET ON PURGE FLAG     @XL03HEK*/
         OI    DNCZF008(DNCBREG),B'00000001'                       0858
*   IF((ADDR(DNCZC001)->PABWEQA&PABWEQG0)^=0) THEN/* ANY DATA?       */
         L     @14,PABWEQA+96(,DNCBREG)                            0859
         N     @14,@CF01659                                        0859
         LTR   @14,@14                                             0859
         BZ    @RF00859                                            0859
*IFKG00F1:                                                         0860
*     DO WHILE((DNCZF008=ON)&((ADDR(DNCZC001)->PABWEQA&PABWEQG0)^=0));
IFKG00F1 B     @DE00860                                            0860
@DL00860 DS    0H                                                  0861
*                                   /* YES, THERE IS DATA    @XL03HEK*/
*/* TPDEQ (,DNCZC001) RETPTR(BFRREG)                                 */
*                                                                  0861
*       DO;                         /* BEGIN TPDEQ CODE GENERATION   */
*         RFY                                                      0862
*          (GPR00P,                                                0862
*           GPR01P,                                                0862
*           GPR14P,                                                0862
*           GPR15P) RSTD;                                          0862
*         GPR15P=ADDR(DNCZC001);    /* ADDRESS QUEUE POINTER         */
         LA    GPR15P,DNCZC001(,DNCBREG)                           0863
*         GPR14P=GPR15P->PABWEQA×FMZCA014;                         0864
         L     @11,@CF01661                                        0864
         L     GPR14P,PABWEQA(,GPR15P)                             0864
         OR    GPR14P,@11                                          0864
*         IF GPR14P=FMZCA014 THEN                                  0865
         CLR   GPR14P,@11                                          0865
         BE    @RT00865                                            0865
*           ;                                                      0866
*         ELSE                                                     0867
*           DO;                                                    0867
*FMZL1053:                                                         0868
*             ;                                                    0868
FMZL1053 DS    0H                                                  0869
*             DO WHILE(GPR14P->WKECHAIN^=FMZCA014);                0869
         B     @DE00869                                            0869
@DL00869 DS    0H                                                  0870
*               GPR15P=ADDR(GPR14P->WKECHAIN);                     0870
         LA    GPR15P,WKECHAIN(,GPR14P)                            0870
*               GPR14P=GPR15P->PABWEQA;                            0871
         L     GPR14P,PABWEQA(,GPR15P)                             0871
*             END;                                                 0872
@DE00869 L     @11,@CF01661                                        0872
         CL    @11,WKECHAIN(,GPR14P)                               0872
         BNE   @DL00869                                            0872
*             GPR00P=FMZCA014;                                     0873
         LR    GPR00P,@11                                          0873
*             CS(GPR14P,GPR00P,GPR15P->PABWEQA);                   0874
         CS    GPR14P,@00,PABWEQA(GPR15P)                          0874
*             BC(7,FMZL1053);                                      0875
         BC    7,FMZL1053                                          0875
*             GPR14P->WKECHAIN=0;                                  0876
         SLR   @11,@11                                             0876
         ST    @11,WKECHAIN(,GPR14P)                               0876
*           END;                                                   0877
*ISTA0053:                                                         0878
*         ;                                                        0878
@RT00865 DS    0H                                                  0878
ISTA0053 DS    0H                                                  0879
*         GPR14P=GPR14P&FMZCB014;                                  0879
         N     GPR14P,@CF01659                                     0879
*         BFRREG=GPR14P;                                           0880
         LR    BFRREG,GPR14P                                       0880
*         RFY                                                      0881
*          (GPR00P,                                                0881
*           GPR01P,                                                0881
*           GPR14P,                                                0881
*           GPR15P) UNRSTD;                                        0881
*       END;                        /* END TPDEQ GENERATION GET    0882
*                                      OLDEST BUFFER FROM DNCB TIP 0882
*                                                            @XL03HEK*/
*/*  PURGE DNCB TIP UNTIL  PSOL DELIMETER FOUND              @XA06938*/
*                                                                  0883
*       IF FSBXFINS=NCPXEOT×(FSBXFINS=NCPXETX&(DNCZPSRD^=DNCZPSRT& 0883
*           DNCZPSRD^=DNCZPSRC))×(FSBXFINS=NCPXETB&DNCZPSRD=DNCZPSRB)
*         THEN                                                     0883
         TM    FSBXFINS+16(BFRREG),B'00011000'                     0883
         BNO   @GL00006                                            0883
         TM    FSBXFINS+16(BFRREG),B'00000110'                     0883
         BZ    @RT00883                                            0883
@GL00006 TM    FSBXFINS+16(BFRREG),B'00010010'                     0883
         BNO   @GL00005                                            0883
         TM    FSBXFINS+16(BFRREG),B'00001100'                     0883
         BNZ   @GL00005                                            0883
         TM    DNCZPSRD(DNCBREG),B'00000100'                       0883
         BNO   @GL00008                                            0883
         TM    DNCZPSRD(DNCBREG),B'00000010'                       0883
         BZ    @GL00005                                            0883
@GL00008 TM    DNCZPSRD(DNCBREG),B'00000110'                       0883
         BNO   @RT00883                                            0883
@GL00005 TM    FSBXFINS+16(BFRREG),B'00010100'                     0883
         BNO   @RF00883                                            0883
         TM    FSBXFINS+16(BFRREG),B'00001010'                     0883
         BNZ   @RF00883                                            0883
         TM    DNCZPSRD(DNCBREG),B'00000110'                       0883
         BNZ   @RF00883                                            0883
@RT00883 DS    0H                                                  0884
*         DNCZF008=ON;              /* SET ON INTERNAL SWITCH TO END
*                                      LOOP                  @XL03HEK*/
         OI    DNCZF008(DNCBREG),B'00000001'                       0884
*       ELSE                                                       0885
*         ;                                                        0885
@RF00883 DS    0H                                                  0886
*       ZCRPCOD1='00'X;             /* SET PARAMS FOR BUFFER         */
         L     @14,RPHCRR(,RPHREG)                                 0886
         L     @14,CRACRR(,@14)                                    0886
         MVI   ZCRPCOD1(@14),X'00'                                 0886
*       ZCRPCOD2='00'X;             /* DEALLOCATION                  */
         MVI   ZCRPCOD2(@14),X'00'                                 0887
*       ZCRPBUF='1'B;                                              0888
         OI    ZCRPBUF(@14),B'00000100'                            0888
*       WORKREG2=ELEMREG;           /* SAVE LCPB PTR                 */
         LR    WORKREG2,ELEMREG                                    0889
*       ELEMREG=BFRREG;             /* SET ADDR OF BUFFER TO BE    0890
*                                      DEALLOCATED                   */
         LR    ELEMREG,BFRREG                                      0890
*       CALL ISTZDFB0;                                             0891
         L     @14,ATCZPSVT(,CVTREG)                               0891
         L     @15,ZPSZDFB0(,@14)                                  0891
         BALR  @14,@15                                             0891
*       ELEMREG=WORKREG2;           /* RESTORE LCPB PTR              */
         LR    ELEMREG,WORKREG2                                    0892
*     END IFKG00F1;                                                0893
@DE00860 TM    DNCZF008(DNCBREG),B'00000001'                       0893
         BNO   @DC00860                                            0893
         L     @14,PABWEQA+96(,DNCBREG)                            0893
         N     @14,@CF01659                                        0893
         LTR   @14,@14                                             0893
         BNZ   @DL00860                                            0893
@DC00860 DS    0H                                                  0894
*   ELSE                                                           0894
*     ;                             /* NO DATA                       */
@RF00859 DS    0H                                                  0895
*   RFY                                                            0895
*     R14 RSTD;                     /*                       @XL03HEK*/
*   R14=ZCRSVF11;                   /* RESTORE WORK REGISTER @XL03HEK*/
         L     @11,RPHCRR(,RPHREG)                                 0896
         L     @11,CRACRR(,@11)                                    0896
         L     R14,ZCRSVF11(,@11)                                  0896
*   RFY                                                            0897
*     R14 UNRSTD;                   /*                       @XL03HEK*/
*   END IFKG000F;                   /*                       @XL03HEK*/
@EL00005 DS    0H                                                  0898
@EF00005 DS    0H                                                  0898
@ER00005 BR    @14                                                 0898
@PB00005 DS    0H                                                  0899
*   GEN(EJECT);                     /*                       @XL03HEK*/
         EJECT
*                                                                  0900
*/*                                                                  */
*/*                      IFKG000G                  S/D CODE: @XL03HEK*/
*/*                                                                  */
*                                                                  0900
*IFKG000G:                                                         0900
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0900
         B     @PB00006                                            0900
IFKG000G DS    0H                                                  0901
*   RFY                                                            0901
*     R14 RSTD;                                                    0901
*   ZCRSVF10=R14;                   /* SAVE RETURN REGISTER          */
         L     @11,RPHCRR(,RPHREG)                                 0902
         L     @11,CRACRR(,@11)                                    0902
         ST    R14,ZCRSVF10(,@11)                                  0902
*   RFY                                                            0903
*     R14 UNRSTD;                                                  0903
*   ZCRIF0E2=ON;                    /* SET ON PORT SOLICITOR IN    0904
*                                      DIALOG FLAG                   */
         OI    ZCRIF0E2(@11),B'00000100'                           0904
*   DNCSESS=ON;                     /* SET ON DIALOG SESSION         */
         OI    DNCSESS(DNCBREG),B'01000000'                        0905
*   FMCZFA06=ON;                    /* FLAGS                         */
         OI    FMCZFA06(FMCBREG),B'00000100'                       0906
*   DNCZV001=FMCBREG;               /* SET PORT SOLICITOR FMCB AS  0907
*                                      ACTIVE FMCB                   */
         STCM  FMCBREG,7,DNCZV001(DNCBREG)                         0907
*   NCBTSKID=FMCTSKID;              /* SET PORT SOLICITOR TASK ID IN
*                                      DNCB                          */
         MVC   NCBTSKID(4,DNCBREG),FMCTSKID(FMCBREG)               0908
*   ADDR(DNCZC001)->PABDVTA=ADDR(FMCPAB4)->PABDVTA;/* SET DNCB DVT 0909
*                                      ADDR TO REQ COMP DVT ADDR     */
         MVC   PABDVTA+96(3,DNCBREG),PABDVTA+112(FMCBREG)          0909
*   RFY                                                            0910
*     R14 RSTD;                                                    0910
*   R14=ZCRSVF10;                   /* RESTORE WORK REGISTER         */
         L     @11,RPHCRR(,RPHREG)                                 0911
         L     @11,CRACRR(,@11)                                    0911
         L     @11,ZCRSVF10(,@11)                                  0911
         LR    R14,@11                                             0911
*   RFY                                                            0912
*     R14 UNRSTD;                                                  0912
*   END IFKG000G;                                                  0913
@EL00006 DS    0H                                                  0913
@EF00006 DS    0H                                                  0913
@ER00006 BR    @14                                                 0913
@PB00006 DS    0H                                                  0914
*   GEN(EJECT);                     /*                       @XL03HEK*/
         EJECT
*                                                                  0915
*/* SUBROUTINE IFKG000H DELETED FOR DIALOG/PREEMPT REMOVAL   @XC36514*/
*/*                                                                  */
*/*                      IFKG00J                   S/D CODE: @XL03HEK*/
*/*                                                                  */
*/* SEGMENT(IFKG00J)START                                            */
*                                                                  0915
*   DO;                                                            0915
*     GOTO IFKG00J@;                                               0916
         B     IFKG00J@                                            0916
*IFKG00J:                                                          0917
*   END;                                                           0917
*                                                                  0917
IFKG00J  DS    0H                                                  0918
*/* CLEARING OF DNCB SESSION FLAG REMOVED...                 @XA06938*/
*                                                                  0918
*   FMCZFA06=OFF;                                                  0918
         NI    FMCZFA06(FMCBREG),B'11111011'                       0918
*   NCBTSKID=ATCCDTID;              /* VTAM TASK ID IN DNCB          */
         MVC   NCBTSKID(4,DNCBREG),ATCCDTID(CVTREG)                0919
*   ADDR(DNCZC001)->PABDVTA=DNCZV004;/* SET DIALOG SCHED DVT AS DNCB
*                                      TIP DVT                       */
         MVC   PABDVTA+96(3,DNCBREG),DNCZV004+1(DNCBREG)           0920
*   DNCZV001=0;                     /* NO ACTIVE FMCB THIS DEVICE    */
         SLR   @14,@14                                             0921
         STCM  @14,7,DNCZV001(DNCBREG)                             0921
*/* SEGMENT(IFKG00J)FINISH                                           */
*                                                                  0922
*   DO;                                                            0922
*     GOTO IFKG00J#;                                               0923
         B     IFKG00J#                                            0923
*IFKG00J@:                                                         0924
*   END;                                                           0924
IFKG00J@ DS    0H                                                  0925
*   GEN(EJECT);                     /*                       @XL03HEK*/
         EJECT
*                                                                  0926
*/*                                                                  */
*/*                      IFKG00K                   S/D CODE: @XL03HEK*/
*/*                                                                  */
*/* SEGMENT(IFKG00K)START                                            */
*                                                                  0926
*   DO;                                                            0926
*     GOTO IFKG00K@;                                               0927
         B     IFKG00K@                                            0927
*IFKG00K:                                                          0928
*   END;                                                           0928
IFKG00K  DS    0H                                                  0929
*   FSBSAF=FMCSAF;                  /* SOURCE ADDRESS TO FSB         */
         LA    @14,16                                              0929
         ALR   @14,BFRREG                                          0929
         MVC   FSBSAF(2,@14),FMCSAF(FMCBREG)                       0929
*   FSBDAF=BTUDEST;                 /* DESTINATION ADDRESS TO FSB    */
         LA    @11,48                                              0930
         ALR   @11,BFRREG                                          0930
         MVC   FSBDAF(2,@14),BTUDEST(@11)                          0930
*   FSBLCPB=ELEMREG;                /* LCPB ADDRESS TO FSB           */
         ST    ELEMREG,FSBLCPB(,@14)                               0931
*   FSBLCCWA=LCPNXLCW;              /* NEXT LCCW TO FSB              */
         MVC   FSBLCCWA(4,@14),LCPNXLCW(ELEMREG)                   0932
*   FSBECI='1'B;                    /* SET LAST FSB FOR LCCW FLAG    */
*   FSBELI='1'B;                    /* SET LAST FSB FOR LCP FLAG     */
         OI    FSBECI(@14),B'11000000'                             0934
*   ZIBFDBS=ZIBFDBZ;                /* MOVE TPIOS FDB TO SYSTEM FDB  */
         MVC   ZIBFDBS(12,BFRREG),ZIBFDBZ(BFRREG)                  0935
*   FDBOFSET=ADDR(ZIBFDBS)-BFRREG;  /* FDB OFFSET IN ZIBUF           */
*                                                                  0936
         LA    @14,ZIBFDBS(,BFRREG)                                0936
         SLR   @14,BFRREG                                          0936
         STH   @14,FDBOFSET(,@11)                                  0936
*   /*****************************************************************/
*   /*                                                               */
*   /* Q FSB TO PORT SOLICITOR INBOUND PAB                           */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0937
*   RFY                                                            0937
*     FSBREG RSTD;                  /*                       @XL03HEK*/
*   FSBREG=ADDR(ZIBFSB);            /* ADDRESS FSB           @XL03HEK*/
         LA    FSBREG,ZIBFSB(,BFRREG)                              0938
*/*  TPQUE (FSBREG,FMCPAB2) NORM                                     */
*                                                                  0939
*   DO;                                                            0939
*     RFY                                                          0940
*      (GPR00P,                                                    0940
*       GPR01P,                                                    0940
*       GPR04P,                                                    0940
*       GPR05P,                                                    0940
*       GPR15P) RSTD;                                              0940
*     GEN REFS(GPR01P) SETS(RPHWORK)(STM GPR02P,GPR08P,RPHWORK(GPR01P))
*         ;                                                        0941
         STM GPR02P,GPR08P,RPHWORK(GPR01P)
*     GPR00P=0;                                                    0942
         SLR   GPR00P,GPR00P                                       0942
*     GPR15P=ADDR(FMCPAB2);         /* HOLD PAB PTR                  */
         LA    GPR15P,FMCPAB2(,FMCBREG)                            0943
*     GPR04P=FSBREG;                /* WORK ELE PTR                  */
         LR    GPR04P,FSBREG                                       0944
*     GPR05P=GPR15P;                /* PASS PAB PTR                  */
         LR    GPR05P,GPR15P                                       0945
*     CALL ATCLCPTR->ATCAP37->ISTAPC37;                            0946
         L     @14,ATCLCPTR                                        0946
         L     @15,ATCAP37(,@14)                                   0946
         BALR  @14,@15                                             0946
*     GEN(NOPR  0)                                                 0947
*     NOSETS NOREFS;                                               0947
         NOPR  0
*     RFY                                                          0948
*      (GPR00P,                                                    0948
*       GPR01P,                                                    0948
*       GPR04P,                                                    0948
*       GPR05P,                                                    0948
*       GPR15P) UNRSTD;                                            0948
*   END;                            /* *** END OF TPQUE GENERATION   */
*   RFY                                                            0950
*     FSBREG UNRSTD;                /*                       @XL03HEK*/
*/* SEGMENT(IFKG00K)FINISH                                           */
*                                                                  0951
*   DO;                                                            0951
*     GOTO IFKG00K#;                                               0952
         B     IFKG00K#                                            0952
*IFKG00K@:                                                         0953
*   END;                                                           0953
*                                                                  0953
IFKG00K@ DS    0H                                                  0954
*/* TPEPILOG                                                         */
*                                                                  0954
*   GEN(PRINT OFF);                                                0954
         PRINT OFF
*/* TEMPLATE FOR CHAIN FIELD OF WORK ELEMENT */                    0955
*DCL  1  ISTWKE BDY(WORD) BASED(WKEPTR),                           0955
*        2  * CHAR(4),                 /* SPACE                       *
*        2  WKECHAIN PTR(31),          /* CHAIN POINTER               *
*           3 WKEFLAGS BIT(8),         /* FLAGS                       *
*             4 WKEGATE  BIT(1),       /* GATE BIT                    *
*             4 *        BIT(7),       /* RESERVED                    *
*           3 WKECHNGP PTR(24);        /* PTR ADDRESS                 *
*   DCL                                                            0956
*     ISTAPC34 ENTRY BASED(ATCAP34) VALRG(*);/* RESET ROUTINE        */
*   DCL                                                            0957
*     ISTAPC37 ENTRY BASED(ATCAP37) VALRG(*);/* TPQUE ROUTINE        */
*   DECLARE                                                        0958
*     EMCR0 PTR REG(0),                                            0958
*     EMCR1 PTR REG(1),                                            0958
*     EMCR2 PTR REG(2),                                            0958
*     EMCR3 PTR REG(3),                                            0958
*     EMCR4 PTR REG(4),                                            0958
*     EMCR5 PTR REG(5),                                            0958
*     EMCR6 PTR REG(6),                                            0958
*     EMCR7 PTR REG(7),                                            0958
*     EMCR8 PTR REG(8),                                            0958
*     EMCR9 PTR REG(9),                                            0958
*     EMCR10 PTR REG(10),                                          0958
*     EMCR11 PTR REG(11),                                          0958
*     EMCR12 PTR REG(12),                                          0958
*     EMCR13 PTR REG(13),                                          0958
*     EMCR14 PTR REG(14),                                          0958
*     EMCR15 PTR REG(15);                                          0958
*   DECLARE                                                        0959
*     ISTSDCCA ENTRY BASED(ATCCDADD) VALRG(*),/* CIDCTL ADD ROUTINE  */
*     ISTSDCCD ENTRY BASED(ATCCDDEL) VALRG(*),/* CIDCTL DELETE     0959
*                                      ROUTINE                       */
*     ISTSDCCF ENTRY BASED(ATCCDFND) VALRG(*),/* CIDCTL FIND ROUTINE */
*     ISTSDCCN ENTRY BASED(ATCCDFDN) VALRG(*),/* CIDCTL FIND NCB   0959
*                                      ROUTINE                       */
*     ISTSDCCR ENTRY BASED(ATCCDFIN) VALRG(*);/* CIDCTL FINISH     0959
*                                      ROUTINE                       */
*   DCL                                                            0960
*     CMZCIDM FIXED(15) DEFINED(ATCCIDM);/* CIDMASK ALIAS            */
*   GEN(PRINT ON);                                                 0961
*                                                                  0961
         PRINT ON
*/* END OF TPEPILOG                                                  */
*                                                                  0962
*   END ISTZIFKG                    /*                       @XL03HEK*/
*                                                                  0962
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */
*/*%INCLUDE SYSLIB  (CVT     )                                       */
*                                                                  0962
*       ;                                                          0962
@EL00001 DS    0H                                                  0962
@EF00001 DS    0H                                                  0962
@ER00001 BR    @14                                                 0962
@DATA    DS    0H
@CH00082 DC    H'1'
@CH00113 DC    H'4'
@CH01126 DC    H'12'
@CH02124 DC    XL2'9007'
@CH02126 DC    XL2'A007'
@SC04499 CLC   DVEBSCAR(0,WORKREG2),BTUTEXT+48(BFRREG)
@SM04501 MVC   RTRIDCAS(0,@14),BTUTEXT+48(BFRREG)
@DATD    DSECT
         DS    0F
ISTZIFKG CSECT
         DS    0F
@CF01659 DC    XL4'7FFFFFFF'
@CF01661 DC    XL4'80000000'
@CF04426 DC    XL4'00FFFFFF'
@DATD    DSECT
         DS    0D
CVTPTR   DS    A
BDUPTR   DS    A
BTUPTR   DS    A
FSBPTR   DS    A
FMCBPTR  DS    A
DNCBPTR  DS    A
LCPBPTR  DS    A
WKEPTR   DS    A
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA
@ENDDATD EQU   *
ISTZIFKG CSECT
         DS    0F
@SIZDATD DC    AL1(0)
         DC    AL3(@ENDDATD-@DATD)
         DS    0D
@CC04362 DC    C'ICKG'
@CB02118 DC    X'0000'
@00      EQU   00                      EQUATES FOR REGISTERS 0-15
@01      EQU   01
@02      EQU   02
@03      EQU   03
@04      EQU   04
@05      EQU   05
@06      EQU   06
@07      EQU   07
@08      EQU   08
@09      EQU   09
@10      EQU   10
@11      EQU   11
@12      EQU   12
@13      EQU   13
@14      EQU   14
@15      EQU   15
GPR00P   EQU   @00
GPR01P   EQU   @01
GPR02P   EQU   @02
GPR04P   EQU   @04
GPR05P   EQU   @05
GPR07P   EQU   @07
GPR12P   EQU   @12
GPR13P   EQU   @13
GPR14P   EQU   @14
GPR15P   EQU   @15
R0       EQU   @00
RPHREG   EQU   @01
R2       EQU   @02
CVTREG   EQU   @02
R3       EQU   @03
DNCBREG  EQU   @04
FMCBREG  EQU   @05
BFRREG   EQU   @06
ELEMREG  EQU   @07
WORKREG1 EQU   @08
WORKREG2 EQU   @09
FSBREG   EQU   @09
R12      EQU   @12
R13      EQU   @13
R14      EQU   @14
RCREG    EQU   @15
RPHPTR   EQU   @01
EMCR2    EQU   @02
EMCR3    EQU   @03
EMCR0    EQU   @00
EMCR1    EQU   @01
EMCR10   EQU   @10
EMCR11   EQU   @11
EMCR12   EQU   @12
EMCR13   EQU   @13
EMCR14   EQU   @14
EMCR15   EQU   @15
EMCR4    EQU   @04
EMCR5    EQU   @05
EMCR6    EQU   @06
EMCR7    EQU   @07
EMCR8    EQU   @08
EMCR9    EQU   @09
GPR00F   EQU   @00
GPR01F   EQU   @01
GPR02F   EQU   @02
GPR03F   EQU   @03
GPR03P   EQU   @03
GPR04F   EQU   @04
GPR05F   EQU   @05
GPR06F   EQU   @06
GPR06P   EQU   @06
GPR07F   EQU   @07
GPR08F   EQU   @08
GPR08P   EQU   @08
GPR09F   EQU   @09
GPR09P   EQU   @09
GPR10F   EQU   @10
GPR10P   EQU   @10
GPR11F   EQU   @11
GPR11P   EQU   @11
GPR12F   EQU   @12
GPR13F   EQU   @13
GPR14F   EQU   @14
GPR15F   EQU   @15
ATCLCPTR EQU   1032
ISTZIFIB EQU   0
ISTZIFBB EQU   0
ISTZDFB0 EQU   0
ISTZDFA0 EQU   0
CVTMAP   EQU   0
CVTDAR   EQU   CVTMAP+72
CVTFLGS1 EQU   CVTDAR
CVTDCB   EQU   CVTMAP+116
CVTIERLC EQU   CVTMAP+144
CVTOPTA  EQU   CVTMAP+182
CVTOPTB  EQU   CVTMAP+183
CVTGTF   EQU   CVTMAP+236
CVTGTFST EQU   CVTGTF
CVTGTFS  EQU   CVTGTFST
CVTSTATE EQU   CVTGTFST
CVTTMODE EQU   CVTGTFST
CVTFORM  EQU   CVTGTFST
CVTAQAVT EQU   CVTMAP+240
CVTTCMFG EQU   CVTAQAVT
CVTVOLM2 EQU   CVTMAP+244
CVTTATA  EQU   CVTVOLM2
CVTTSKS  EQU   CVTTATA
CVTVOLF2 EQU   CVTTSKS
CVTTAT   EQU   CVTTATA+1
CVTATER  EQU   CVTMAP+248
CVTEXT1  EQU   CVTMAP+252
CVTPURG  EQU   CVTMAP+260
CVTQMSG  EQU   CVTMAP+268
CVTDMSR  EQU   CVTMAP+272
CVTRSV37 EQU   CVTDMSR
CVTDMSRF EQU   CVTRSV37
CVTERPV  EQU   CVTMAP+316
CVTINTLA EQU   CVTMAP+320
CVTAPF   EQU   CVTMAP+324
CVTEXT2  EQU   CVTMAP+328
CVTHJES  EQU   CVTMAP+332
CVTPGSIA EQU   CVTMAP+348
CVTA1F1  EQU   CVTMAP+356
CVTSYSK  EQU   CVTMAP+357
CVTVOLM1 EQU   CVTMAP+380
CVTVOLF1 EQU   CVTVOLM1
CVTATMCT EQU   CVTMAP+388
CVTXTNT1 EQU   0
CVTXTNT2 EQU   0
CVTDSSV  EQU   CVTXTNT2
CVTFLGBT EQU   CVTXTNT2+5
CVTQID   EQU   CVTXTNT2+24
CVTSHS   EQU   CVTXTNT2+40
CVTRV400 EQU   CVTXTNT2+52
CVTRV409 EQU   CVTXTNT2+53
CVTATCVT EQU   CVTXTNT2+64
CVTRV429 EQU   CVTXTNT2+84
CVTRV438 EQU   CVTXTNT2+85
CVTRV457 EQU   CVTXTNT2+112
CVTRV466 EQU   CVTXTNT2+113
CVTFIX   EQU   0
CVTRELNO EQU   CVTFIX+252
ISTBDU   EQU   0
BDUMODIF EQU   ISTBDU+1
BDUMOD1  EQU   BDUMODIF
BDUDAF   EQU   ISTBDU+2
BDUFUNC  EQU   BDUDAF
BDUCHECK EQU   BDUFUNC
BDUFLAGS EQU   BDUDAF+1
ISTFDB   EQU   0
FDBFDBA  EQU   ISTFDB
FDBOFSET EQU   ISTFDB+10
ISTLH    EQU   0
ISTTH    EQU   0
THFLAG1  EQU   ISTTH
THFLGA   EQU   THFLAG1
THMPF    EQU   THFLGA
THFLGB   EQU   THFLAG1+1
ISTTH2   EQU   0
TH2FLAG1 EQU   ISTTH2
TH2MPF   EQU   TH2FLAG1
ISTBTU   EQU   0
BTUBTH   EQU   ISTBTU
BTUFID   EQU   BTUBTH
BTUDEST  EQU   BTUBTH+2
BTUREQ   EQU   BTUBTH+6
BTURQFLG EQU   BTUREQ
BTUDCF   EQU   BTUBTH+8
BTURH    EQU   BTUBTH+10
BTUBDU   EQU   ISTBTU+14
BTUSYSTR EQU   ISTBTU+18
BTUTEXT  EQU   ISTBTU+20
ISTFSB   EQU   0
FSBFSB   EQU   ISTFSB
FSBMNRCD EQU   FSBFSB+2
FSBMNELI EQU   FSBMNRCD
FSBSFLGS EQU   FSBFSB+3
FSBFSBA  EQU   FSBFSB+4
FSBBTH   EQU   FSBFSB+8
FSBCID   EQU   FSBBTH
FSBSAF   EQU   FSBCID
FSBDAF   EQU   FSBCID+2
FSBRQTAG EQU   FSBBTH+4
FSBSEQID EQU   FSBRQTAG
FSBFLAGS EQU   FSBSEQID
FSBSEQ   EQU   FSBSEQID+1
FSBCSWST EQU   FSBBTH+6
FSBTHFLD EQU   FSBCSWST
FSBTH1   EQU   FSBTHFLD
FSBSYSRS EQU   FSBTH1
FSBTH2   EQU   FSBTHFLD+1
FSBEXTRS EQU   FSBTH2
FSBXFSTS EQU   FSBEXTRS
FSBXCODE EQU   FSBEXTRS
FSBXFINS EQU   FSBXCODE
FSBNETRS EQU   FSBFSB+16
FSBSRCAT EQU   FSBNETRS
FSBMJRCD EQU   FSBSRCAT
FSBERC   EQU   FSBNETRS+1
FSBELI   EQU   FSBERC
FSBECI   EQU   FSBERC
FSBFBMI  EQU   FSBERC
FSBDMGRS EQU   FSBFSB+18
FSBSS1   EQU   FSBDMGRS
FSBSS2   EQU   FSBDMGRS+1
FSBLCPB  EQU   FSBFSB+20
FSBMSGID EQU   FSBLCPB
FSBLCCWA EQU   FSBFSB+24
FSBRLSTS EQU   FSBLCCWA
ISTZIBUF EQU   0
ZIBFSM   EQU   ISTZIBUF+4
ISTLOK   EQU   0
LOKCHN   EQU   ISTLOK+1
LOKCHNG  EQU   LOKCHN
@NM00014 EQU   LOKCHNG+2
ISTPAB   EQU   0
PABWQCHN EQU   ISTPAB
PABWEQA  EQU   PABWQCHN
PABCHAIN EQU   PABWQCHN+4
PABDVTA  EQU   ISTPAB+9
PABRPHFG EQU   ISTPAB+12
PABFLAGS EQU   PABRPHFG
PABERLCK EQU   PABFLAGS
PABERRLK EQU   PABERLCK
PABERLOK EQU   PABERRLK
ISTDEVCH EQU   0
DEVSHCH  EQU   ISTDEVCH
DEVCHAR  EQU   DEVSHCH
DEVTCODE EQU   ISTDEVCH+1
DEVFLAGS EQU   ISTDEVCH+3
DEVFCCTL EQU   DEVFLAGS
DEVCHAR3 EQU   DEVFLAGS
ISTPROCD EQU   0
PROPROC  EQU   ISTPROCD
PROPROC1 EQU   PROPROC
PROPROC2 EQU   PROPROC+1
PROPROC3 EQU   PROPROC+2
PROPROC4 EQU   PROPROC+3
PROPROCS EQU   0
PROSETMS EQU   PROPROCS+1
PROSETM2 EQU   PROSETMS
PROSETM3 EQU   PROSETMS+1
PROSETM4 EQU   PROSETMS+2
ISTFMCB  EQU   0
FMCSAF   EQU   ISTFMCB+2
FMCTSKID EQU   ISTFMCB+8
FMCSTAT  EQU   ISTFMCB+28
FMCSTAT1 EQU   ISTFMCB+29
FMCCMDFL EQU   ISTFMCB+31
FMCCMPS1 EQU   ISTFMCB+36
FMCPAB2  EQU   ISTFMCB+80
FMCPAB3  EQU   ISTFMCB+96
FMCPAB4  EQU   ISTFMCB+112
FMCSIPA  EQU   ISTFMCB+148
FMCNXOSQ EQU   ISTFMCB+152
FMCNXCFM EQU   FMCNXOSQ
FMCNXOSC EQU   FMCNXOSQ+2
FMCSSTAT EQU   ISTFMCB+159
FMCPACE  EQU   ISTFMCB+160
FMCPACEN EQU   FMCPACE
FMCPACEM EQU   FMCPACE+1
FMCPACPC EQU   FMCPACE+2
FMCCVAL  EQU   FMCPACE+3
FMCOBCE  EQU   FMCCVAL
FMCCLEXT EQU   ISTFMCB+164
FMCRPLA  EQU   FMCCLEXT
FMCFBA   EQU   FMCCLEXT+4
FMCCMPS2 EQU   FMCCLEXT+16
FMCFLGA  EQU   FMCCMPS2
FMCFLGCL EQU   FMCCMPS2+1
FMCPSCMD EQU   FMCCMPS2+2
FMCPSTAT EQU   FMCCMPS2+3
FMCSTAT2 EQU   ISTFMCB+186
FMCMODEB EQU   ISTFMCB+189
FMCCLSEQ EQU   ISTFMCB+190
FMCRRESP EQU   ISTFMCB+195
FMCSSEGQ EQU   ISTFMCB+200
FMCFBAS  EQU   ISTFMCB+216
FMCZV002 EQU   FMCFBAS
FMCSNCTL EQU   ISTFMCB+224
FMCSCFLG EQU   FMCSNCTL
FMCVS1   EQU   ISTFMCB+232
FMCZFLAG EQU   FMCVS1
FMCZF002 EQU   FMCZFLAG
FMCZF006 EQU   FMCZFLAG
FMCZFA06 EQU   FMCZF006
FMCZFB06 EQU   FMCZF006
FMCZH001 EQU   FMCVS1+4
FMCLBXM  EQU   FMCVS1+12
FMCSHEAQ EQU   FMCLBXM
FMCLCPBQ EQU   FMCVS1+16
FMCLCPAQ EQU   FMCVS1+20
FMCSEQ1  EQU   FMCVS1+34
FMCZFLG2 EQU   FMCVS1+35
FMCCVFLG EQU   FMCVS1+44
FMCFLAG  EQU   0
FMCFLGB  EQU   FMCFLAG
ISTNCB   EQU   0
NCBRDTE  EQU   ISTNCB+4
NCBTSKID EQU   ISTNCB+8
NCBFLAGS EQU   ISTNCB+24
NCBFRAS  EQU   NCBFLAGS+1
NCBFTRIO EQU   NCBFRAS
NCBFLAG1 EQU   NCBFLAGS+2
ISTDNCB  EQU   0
DNCNCB   EQU   ISTDNCB
DNCOS    EQU   ISTDNCB+56
DNCZFLGS EQU   DNCOS
DNCZF001 EQU   DNCZFLGS
DNCSESS  EQU   DNCZFLGS
DNCINVIT EQU   DNCZFLGS
DNCZRSCH EQU   DNCZFLGS
DNCZPSRD EQU   DNCZFLGS+1
DNCZF008 EQU   DNCZFLGS+1
DNCBSCED EQU   DNCOS+2
DNCACIP  EQU   DNCBSCED+1
DNCZV001 EQU   DNCOS+17
DNCZV004 EQU   DNCOS+28
DNCZC001 EQU   DNCOS+40
ISTLCCW  EQU   0
LCCWOP   EQU   ISTLCCW
LCCWRWOP EQU   LCCWOP
LCCWCTL  EQU   LCCWRWOP
LCCWFLAG EQU   ISTLCCW+1
LCCWLSI  EQU   LCCWFLAG
ISTLCPB  EQU   0
LCPREQTG EQU   ISTLCPB+2
LCPFLAGS EQU   LCPREQTG
LCPZF001 EQU   LCPFLAGS
LCPZRT02 EQU   LCPZF001
LCPZF002 EQU   LCPFLAGS
LCPZRT03 EQU   LCPZF002
LCPZF003 EQU   LCPFLAGS
LCPZRT04 EQU   LCPZF003
LCPZF004 EQU   LCPFLAGS
LCPZRT05 EQU   LCPZF004
LCPZRT06 EQU   LCPFLAGS
LCPZRT07 EQU   LCPFLAGS
LCPMNRCD EQU   LCPREQTG+1
LCPZRT08 EQU   LCPMNRCD
LCPZRT09 EQU   LCPMNRCD
LCPCHAIN EQU   ISTLCPB+4
LCPCHAI1 EQU   LCPCHAIN
LCPRUCNT EQU   ISTLCPB+8
LCPFLAG2 EQU   ISTLCPB+9
LCPTLBPI EQU   LCPFLAG2
LCPFID0  EQU   LCPFLAG2
LCPSEQ   EQU   ISTLCPB+10
LCPCID   EQU   ISTLCPB+16
LCPNXLCW EQU   ISTLCPB+20
LCPFDBA  EQU   ISTLCPB+24
LCPFLG1  EQU   ISTLCPB+37
LCPFLCCW EQU   ISTLCPB+40
LCPLCCW  EQU   ISTLCPB+48
LCPPABA  EQU   LCPLCCW+4
LCPRPHA  EQU   LCPPABA
ISTZSAVE EQU   0
ZSAZSVBC EQU   ISTZSAVE
ZSAZSVMS EQU   ZSAZSVBC
ZSAZACTV EQU   ZSAZSVMS
ZSAZSVFC EQU   ISTZSAVE+4
ZSAZSVRR EQU   ISTZSAVE+8
ZSAZSVVR EQU   ISTZSAVE+12
ZSAZTRAC EQU   ISTZSAVE+36
ISTZCRR  EQU   0
ZCRCRR   EQU   ISTZCRR
ZCRFLGS1 EQU   ISTZCRR+12
ZCRFLGS2 EQU   ISTZCRR+13
ZCRIF0E1 EQU   ZCRFLGS2
ZCRIF0E2 EQU   ZCRFLGS2
ZCRIF0E3 EQU   ZCRFLGS2
ZCRSWFLD EQU   ISTZCRR+14
ZCRENDSH EQU   ZCRSWFLD
ZCRNDLCP EQU   ZCRSWFLD
ZCRRESET EQU   ZCRSWFLD
ZCRFLGS3 EQU   ISTZCRR+15
ZCRGENSW EQU   ISTZCRR+16
ZCRPFLGS EQU   ISTZCRR+17
ZCRIBPR  EQU   ISTZCRR+18
ZCRSCPSW EQU   ISTZCRR+19
ZCRPARMS EQU   ISTZCRR+24
ZCRFBPTR EQU   ZCRPARMS
ZCRDFRDA EQU   ZCRPARMS+10
ZCRPCOD1 EQU   ZCRPARMS+12
ZCRPFSB  EQU   ZCRPCOD1
ZCRPLSBF EQU   ZCRPCOD1
ZCRPBUF  EQU   ZCRPCOD1
ZCRPCOD2 EQU   ZCRPARMS+13
ZCRSVRTN EQU   ISTZCRR+56
ZCRSVF10 EQU   ZCRSVRTN+36
ZCRSVF11 EQU   ZCRSVRTN+40
ZCRSVF20 EQU   ZCRSVRTN+76
ZCRWKARA EQU   ISTZCRR+156
ZCRR2SV  EQU   ISTZCRR+184
ZCRR13SV EQU   ISTZCRR+188
ZCRCIDSV EQU   ISTZCRR+192
ZCRAUDIT EQU   ISTZCRR+440
ZCRENTER EQU   ZCRAUDIT+5
ZCREICKG EQU   ZCRENTER+12
ZCRLCPB  EQU   ISTZCRR+480
ZCRRHRU  EQU   ZCRLCPB
ISTRPH   EQU   0
RPHCNTL  EQU   ISTRPH
RPHFLAGS EQU   RPHCNTL+2
RPHAPTYP EQU   RPHFLAGS
RPHFSTLC EQU   RPHFLAGS
RPHFLGB  EQU   RPHCNTL+3
RPHRPHA  EQU   ISTRPH+4
RPHTSKID EQU   ISTRPH+8
RPHRESMA EQU   ISTRPH+16
RPHWPFLG EQU   RPHRESMA
RPHWEA   EQU   ISTRPH+24
RPHCSPA  EQU   RPHWEA
RPHSRPRM EQU   ISTRPH+28
RPHCRR   EQU   ISTRPH+32
RPHPABQA EQU   ISTRPH+36
RPHWORK  EQU   ISTRPH+40
RPHSAVE1 EQU   RPHWORK
RPHSBITS EQU   RPHSAVE1+1
ISTPFCRR EQU   0
PFCCRR   EQU   ISTPFCRR
PFCCRRID EQU   PFCCRR
PFCCRRLN EQU   PFCCRR+2
PFCHDR   EQU   ISTPFCRR+4
PFCCRRO  EQU   PFCHDR
PFCFRRO  EQU   PFCHDR+4
ISTCFCRR EQU   0
CFCAUDIT EQU   ISTCFCRR
CFCNTRD  EQU   CFCAUDIT
CFCCRT   EQU   CFCAUDIT+1
ISTASCRR EQU   0
ASCFLAGS EQU   ISTASCRR+16
ASCFLG1  EQU   ASCFLAGS
ASCFLG2  EQU   ASCFLAGS+2
ASCFLG3  EQU   ASCFLAGS+4
ASCUSRGS EQU   ISTASCRR+28
ISTAPCRR EQU   0
APCATFLG EQU   ISTAPCRR+16
APCRFLG  EQU   ISTAPCRR+18
APCSAVE  EQU   ISTAPCRR+44
APCCOMF  EQU   ISTAPCRR+116
APCCOMF1 EQU   APCCOMF
APC31FLG EQU   ISTAPCRR+132
APC52FLG EQU   ISTAPCRR+133
APC53FLG EQU   ISTAPCRR+134
APC54FLG EQU   ISTAPCRR+135
APC57FLG EQU   ISTAPCRR+136
ISTCRA   EQU   0
CRABASIC EQU   ISTCRA
CRAHDR   EQU   CRABASIC
CRACRR   EQU   CRAHDR
CRALKACT EQU   CRABASIC+8
CRASVC   EQU   ISTCRA+848
CRABUFA  EQU   CRASVC+68
ISTRPRE  EQU   0
RPRCOMID EQU   ISTRPRE+8
RPRFLAGA EQU   ISTRPRE+21
RPRFLAGB EQU   ISTRPRE+22
RPRCAUSE EQU   ISTRPRE+23
RPRFLAGD EQU   ISTRPRE+61
RPRFLAGC EQU   ISTRPRE+62
ISTRCPRE EQU   0
RCPPMODE EQU   ISTRCPRE+91
RCPLGNIN EQU   ISTRCPRE+92
ISTRDT   EQU   0
RDTPLEN  EQU   ISTRDT+72
RDTPRIOR EQU   RDTPLEN
RDTFLAGB EQU   ISTRDT+91
RDTVYRPH EQU   ISTRDT+108
RDTSTCNT EQU   ISTRDT+112
ISTRAP   EQU   0
RAPFLG   EQU   ISTRAP+108
RAPFLGB  EQU   ISTRAP+109
RAPFLGC  EQU   ISTRAP+110
ISTRLC   EQU   0
RLCADR   EQU   ISTRLC+72
RLCFLAG  EQU   RLCADR
ISTRRN   EQU   0
RRNADR   EQU   ISTRRN+136
RRNFLAG  EQU   RRNADR
RRNUCBAD EQU   RRNADR+1
RRNRDF   EQU   ISTRRN+172
RRNRDFA  EQU   RRNRDF
RRNRDFB  EQU   RRNRDF+1
RRNCMF   EQU   ISTRRN+176
RRNCMFA  EQU   RRNCMF
RRNCMFB  EQU   RRNCMF+1
RRNCMFC  EQU   RRNCMF+2
RRNCMFD  EQU   RRNCMF+3
RRNNMDPD EQU   ISTRRN+192
RRNHPRE  EQU   ISTRRN+216
ISTRGP   EQU   0
RGPFLG   EQU   ISTRGP+72
ISTRLN   EQU   0
RLNADR   EQU   ISTRLN+72
RLNFLAG  EQU   RLNADR
RLNUCBAD EQU   RLNADR+1
RLNSTAT1 EQU   ISTRLN+86
RLNSTAT2 EQU   ISTRLN+87
RLNRDF   EQU   ISTRLN+88
RLNRDFA  EQU   RLNRDF
RLNRACNT EQU   RLNRDFA
RLNRDFB  EQU   RLNRDF+1
RLNCRFLG EQU   ISTRLN+102
RLNLSCMD EQU   RLNCRFLG
ISTRPT   EQU   0
RPTLNCID EQU   ISTRPT+116
RPTDITT  EQU   ISTRPT+128
RPTDIVT  EQU   RPTDITT
RPTATERM EQU   ISTRPT+132
RPTUTERM EQU   ISTRPT+136
RPTFLAG1 EQU   ISTRPT+140
ISTRCL   EQU   0
RCLADR   EQU   ISTRCL+72
RCLFLAG  EQU   RCLADR
ISTRTR   EQU   0
RTRADR   EQU   ISTRTR+124
RTRFLAG  EQU   RTRADR
RTRRDFA  EQU   ISTRTR+136
RTRRAALL EQU   RTRRDFA
RTRRDFB  EQU   ISTRTR+137
RTRRDFC  EQU   ISTRTR+138
RTRRDFD  EQU   ISTRTR+139
RTRRDFE  EQU   ISTRTR+140
RTRRDFF  EQU   ISTRTR+141
RTRCRFLG EQU   ISTRTR+143
RTRLSCMD EQU   RTRCRFLG
RTRBSCID EQU   ISTRTR+188
RTRIDLEN EQU   RTRBSCID
RTRIDCAS EQU   RTRBSCID+1
ISTRIN   EQU   0
RINDFD   EQU   ISTRIN+124
RINREMPO EQU   RINDFD
RINNODEF EQU   RINDFD
RINLDISC EQU   RINDFD
RINNODID EQU   ISTRIN+125
RINRLDAF EQU   ISTRIN+126
RINREMOT EQU   ISTRIN+128
RINVPAB  EQU   ISTRIN+132
RINRPHCN EQU   ISTRIN+136
RINNCSPL EQU   ISTRIN+140
RINCNCNT EQU   ISTRIN+144
ISTRDS   EQU   0
ISTDOT   EQU   0
ISTRCC   EQU   0
RCCFLAG  EQU   ISTRCC+73
RCCFLAGB EQU   ISTRCC+74
RCCSTAID EQU   ISTRCC+78
RCCID48  EQU   RCCSTAID+2
RCCCRFLG EQU   ISTRCC+108
ISTRLU   EQU   0
RLUFLAG  EQU   ISTRLU+125
RLUCRFLG EQU   ISTRLU+126
RLUPACE  EQU   ISTRLU+132
RLUNCPPC EQU   ISTRLU+134
RLUUSSTB EQU   ISTRLU+140
RLUMODET EQU   ISTRLU+152
ISTRPX   EQU   0
ISTRLX   EQU   0
RLXFLAGA EQU   ISTRLX+76
ISTRSW   EQU   0
ISTRDA   EQU   0
RDAADR   EQU   ISTRDA+72
RDAFLAG  EQU   RDAADR
RDAUCBAD EQU   RDAADR+1
ISTRLS   EQU   0
ISTDNT   EQU   0
ISTGNT   EQU   0
ISTPAT   EQU   0
PATFLAGA EQU   ISTPAT+7
ISTDIVTH EQU   0
DIVNUME  EQU   ISTDIVTH
DIVIDLEN EQU   ISTDIVTH+4
ISTZPSVT EQU   0
ZPSZDFA0 EQU   ISTZPSVT
ZPSZDFB0 EQU   ISTZPSVT+16
ISTDVE   EQU   0
DVERDTEA EQU   ISTDVE
DVEBSCID EQU   ISTDVE+4
DVEBSCLN EQU   DVEBSCID
DVEBSCAR EQU   DVEBSCID+1
ISTZRCVT EQU   0
ZRCZIFBB EQU   ISTZRCVT+76
ZRCZIFIB EQU   ISTZRCVT+92
ISTDYPAB EQU   0
ISTATCVT EQU   0
ATCCOM   EQU   ISTATCVT
ATCSTAT  EQU   ATCCOM
ATCSTAT1 EQU   ATCSTAT
ATCSTFLG EQU   ATCSTAT+1
ATCPOFLG EQU   ATCSTAT+2
ATCSTAT4 EQU   ATCSTAT+3
ATCIOTRC EQU   ATCCOM+140
ATCTHTRC EQU   ATCIOTRC
ATCCIDM  EQU   ATCCOM+266
ATCCDADD EQU   ISTATCVT+276
ATCCDDEL EQU   ISTATCVT+280
ATCCDFND EQU   ISTATCVT+284
ATCCSMR  EQU   ISTATCVT+296
ATCSHRFG EQU   ISTATCVT+316
ATCHPGM  EQU   ISTATCVT+384
ATCCDFIN EQU   ISTATCVT+460
ATCCDFDN EQU   ISTATCVT+464
ATCVLCNT EQU   ISTATCVT+772
ATCRNO   EQU   ISTATCVT+788
ATCSOPD  EQU   ISTATCVT+792
ATCSIPD  EQU   ISTATCVT+800
ATCSECST EQU   ISTATCVT+812
ATCSTAT2 EQU   ISTATCVT+818
ATCVTBAM EQU   ISTATCVT+908
@NM00057 EQU   ATCVTBAM+3
ATCAOSM  EQU   ISTATCVT+912
ATCGSRBQ EQU   ATCAOSM+4
ATCGSRBG EQU   ATCGSRBQ
ATCAP34  EQU   ATCAOSM+32
ATCZPSVT EQU   ATCAOSM+72
ATCICAPP EQU   ATCAOSM+100
ATCLDAPP EQU   ATCAOSM+120
ATCCDTID EQU   ATCLDAPP
ATCDAPVT EQU   ATCAOSM+140
ATCAP37  EQU   ATCAOSM+264
ATCCRA   EQU   ATCAOSM+280
ATCCRACN EQU   ATCCRA+4
ATCSRB   EQU   ATCAOSM+288
ATCSRBCN EQU   ATCSRB+4
ATCCRPL  EQU   ATCAOSM+296
ATCRPLCN EQU   ATCCRPL+4
ATCSQAFR EQU   ATCAOSM+304
ATCORTBC EQU   ATCSQAFR+4
ATCORSRB EQU   ATCORTBC
@NM00059 EQU   ATCAOSM+332
ATCVTFLG EQU   ATCAOSM+392
ATCZFLAG EQU   ATCAOSM+588
ISTWKE   EQU   0
WKECHAIN EQU   ISTWKE+4
WKEFLAGS EQU   WKECHAIN
ISTAPC37 EQU   0
ISTSDCCF EQU   0
ISTSDCCR EQU   0
ISTAPC34 EQU   0
ISTSDCCA EQU   0
ISTSDCCD EQU   0
ISTSDCCN EQU   0
ZIBSRB   EQU   0
CVTS01   EQU   CVTPGSIA
CVTLPDIA EQU   CVTS01+12
CVTDIRST EQU   CVTLPDIA
CVTSLIDA EQU   CVTS01+24
CVTCTLFG EQU   CVTS01+50
CVTRV210 EQU   CVTS01+424
CVTRV219 EQU   CVTS01+425
CVTRV228 EQU   CVTS01+426
CVTRV237 EQU   CVTS01+427
CVTMFRTR EQU   CVTS01+452
CVTRV262 EQU   CVTS01+468
CVTRV271 EQU   CVTS01+469
CVTRV280 EQU   CVTS01+470
CVTRV289 EQU   CVTS01+471
CVTGSDA  EQU   CVTS01+600
FSBCOMBN EQU   FSBNETRS
FSBRHFLD EQU   FSBCOMBN+1
FSBRH3   EQU   FSBRHFLD+2
FSBLDFLG EQU   FSBRH3
@NM00007 EQU   FSBRQTAG
ZIBDIO   EQU   ZIBFSM
ZIBCCW2  EQU   ZIBDIO+8
ZIBCPTCC EQU   ZIBCCW2
ZIBAIO   EQU   ISTZIBUF
ZIBAIOCM EQU   ZIBAIO
ZIBFDBZ  EQU   ZIBAIOCM
ZIBFIB   EQU   ZIBAIO+16
ZIBFSB   EQU   ZIBFIB
ZIBMDREC EQU   ZIBFSB+4
ZIBMDRIN EQU   ZIBFSB+28
ZIBBTU   EQU   ZIBFIB+32
ZIBFDBS  EQU   ZIBBTU
@NM00010 EQU   ZIBBTU+12
ZIBFID1  EQU   @NM00010+1
ZIBFITXT EQU   ZIBFID1
ZIBSIB   EQU   ZIBFIB
ZIBREC   EQU   ZIBMDRIN
ZIBRECPL EQU   ZIBREC
ZIBRECHD EQU   ZIBRECPL
ZIBRECRS EQU   ZIBREC+8
ZIBRECDT EQU   ZIBREC+10
ZIBMDRRC EQU   ZIBMDREC
ZIBRCPL  EQU   ZIBMDRRC
ZIBRCDT  EQU   ZIBMDRRC+24
@NM00012 EQU   ZIBBTU
LCPZTIE  EQU   LCPCID
LCPZSNAM EQU   LCPZTIE+8
CMZCIDM  EQU   ATCCIDM
RTRDNCBA EQU   ISTRTR+40
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS
LCPZTRV4 EQU   LCPZSNAM+4
LCPZTRV1 EQU   LCPZSNAM
LCPZSNA  EQU   LCPZTIE+4
LCPZFMCA EQU   LCPZTIE
ZIBTH2   EQU   @NM00012+4
ZIBLH    EQU   @NM00012
ZIBRCTXT EQU   ZIBMDRRC+36
ZIBRCRID EQU   ZIBRCDT+10
ZIBRCNAM EQU   ZIBRCDT+2
ZIBRCUA  EQU   ZIBRCDT
ZIBRCPUI EQU   ZIBRCPL+20
ZIBRCPUN EQU   ZIBRCPL+16
ZIBRCTIM EQU   ZIBRCPL+12
ZIBRCDAT EQU   ZIBRCPL+8
ZIBRCRS1 EQU   ZIBRCPL+6
ZIBRCSID EQU   ZIBRCPL+5
ZIBRCID  EQU   ZIBRCPL+4
ZIBRCSW  EQU   ZIBRCPL+2
ZIBRCSYR EQU   ZIBRCPL+1
ZIBRCL   EQU   ZIBRCPL
ZIBRECTX EQU   ZIBREC+22
ZIBRECID EQU   ZIBRECDT+10
ZIBRECNA EQU   ZIBRECDT+2
ZIBRECUA EQU   ZIBRECDT
ZIBRECSV EQU   ZIBRECRS
ZIBRECDA EQU   ZIBRECPL+4
ZIBRECSI EQU   ZIBRECHD+3
ZIBRECDV EQU   ZIBRECHD+2
ZIBRECFL EQU   ZIBRECHD+1
ZIBRECTY EQU   ZIBRECHD
ZIBTEXT  EQU   ZIBSIB+4
ZIBRSV04 EQU   ZIBSIB
ZIBTEXT2 EQU   ZIBFITXT
ZIBTEXT1 EQU   ZIBFIB+52
@NM00011 EQU   @NM00010
@NM00009 EQU   ZIBMDREC
@NM00008 EQU   ZIBFSB
ZIBLNG2  EQU   ZIBAIOCM+14
ZIBRSV03 EQU   ZIBAIOCM+13
ZIBWKBYT EQU   ZIBAIOCM+12
ZIBCPNPK EQU   ZIBCCW2+6
ZIBRSV02 EQU   ZIBCCW2+5
ZIBCPTPF EQU   ZIBCCW2+4
ZIBCPTCA EQU   ZIBCCW2+1
ZIBCPNPC EQU   ZIBCPTCC
ZIBCPRDK EQU   ZIBDIO+6
ZIBRSV01 EQU   ZIBDIO+5
ZIBCPRDF EQU   ZIBDIO+4
ZIBCPTXA EQU   ZIBDIO+1
ZIBCPRDC EQU   ZIBDIO
FSBRT0B  EQU   @NM00007+1
FSBRT0A  EQU   @NM00007+1
FSBRT09  EQU   @NM00007+1
FSBRT08  EQU   @NM00007+1
FSBRT07  EQU   @NM00007
FSBRT06  EQU   @NM00007
FSBRT05  EQU   @NM00007
FSBRT04  EQU   @NM00007
FSBRT03  EQU   @NM00007
FSBRT02  EQU   @NM00007
FSBRT01  EQU   @NM00007
FSBRT00  EQU   @NM00007
FSBLDCUF EQU   FSBLDFLG
FSBLDSIF EQU   FSBLDFLG
FSBLDSOF EQU   FSBLDFLG
FSBLDEBF EQU   FSBLDFLG
FSBLDBBF EQU   FSBLDFLG
FSBLDFME EQU   FSBLDFLG
FSBLDSCF EQU   FSBLDFLG
FSBLDRMF EQU   FSBLDFLG
FSBRH2   EQU   FSBRHFLD+1
FSBRH1   EQU   FSBRHFLD
FSBALIGN EQU   FSBCOMBN
CVTRV628 EQU   CVTS01+728
CVTRV627 EQU   CVTS01+724
CVTRV626 EQU   CVTS01+720
CVTRV625 EQU   CVTS01+716
CVTRV624 EQU   CVTS01+712
CVTRV623 EQU   CVTS01+708
CVTRV622 EQU   CVTS01+704
CVTRV621 EQU   CVTS01+700
CVTRV620 EQU   CVTS01+696
CVTRV619 EQU   CVTS01+692
CVTRV618 EQU   CVTS01+688
CVTRV617 EQU   CVTS01+684
CVTRV616 EQU   CVTS01+680
CVTRV615 EQU   CVTS01+676
CVTRV614 EQU   CVTS01+672
CVTRV613 EQU   CVTS01+668
CVTTCASP EQU   CVTS01+664
CVT0PT03 EQU   CVTS01+660
CVT0PT0E EQU   CVTS01+656
CVTIRM   EQU   CVTS01+652
CVTCGK   EQU   CVTS01+648
CVTRV607 EQU   CVTS01+644
CVTRV606 EQU   CVTS01+640
CVTRV605 EQU   CVTS01+636
CVTRV604 EQU   CVTS01+632
CVTEFF02 EQU   CVTS01+628
CVTCBBR  EQU   CVTS01+624
CVTSSCR  EQU   CVTS01+620
CVTEVENT EQU   CVTS01+616
CVTCRCA  EQU   CVTS01+612
CVTTPIO  EQU   CVTS01+608
CVTADV   EQU   CVTS01+604
CVTGSDAB EQU   CVTGSDA
CVTQV3   EQU   CVTS01+596
CVTQV2   EQU   CVTS01+592
CVTQV1   EQU   CVTS01+588
CVTRPT   EQU   CVTS01+584
CVTSSRB  EQU   CVTS01+580
CVTCSDRL EQU   CVTS01+576
CVTEXP1  EQU   CVTS01+572
CVTRMPMT EQU   CVTS01+568
CVTRMPTT EQU   CVTS01+564
CVTVPSA  EQU   CVTS01+560
CVTVSTOP EQU   CVTS01+556
CVTGTFR8 EQU   CVTS01+552
CVTQUIT  EQU   CVTS01+548
CVTVACR  EQU   CVTS01+544
CVTWTCB  EQU   CVTS01+540
CVTSTPRS EQU   CVTS01+536
CVT0PT02 EQU   CVTS01+532
CVTDARCM EQU   CVTS01+528
CVTIRECM EQU   CVTS01+524
CVTJRECM EQU   CVTS01+520
CVTVEMS0 EQU   CVTS01+516
CVTSPFRR EQU   CVTS01+512
CVTRLSTG EQU   CVTS01+508
CVT0TC0A EQU   CVTS01+504
CVTGMBR  EQU   CVTS01+500
CVTLFRM  EQU   CVTS01+496
CVTRMBR  EQU   CVTS01+492
CVTVIOP  EQU   CVTS01+488
CVTRV307 EQU   CVTS01+486
CVTRV306 EQU   CVTS01+484
CVTRV305 EQU   CVTS01+482
CVTRV304 EQU   CVTS01+480
CVTRV303 EQU   CVTS01+478
CVTRV302 EQU   CVTS01+476
CVTTRCA  EQU   CVTS01+472
CVTRV297 EQU   CVTRV289
CVTRV296 EQU   CVTRV289
CVTRV295 EQU   CVTRV289
CVTRV294 EQU   CVTRV289
CVTRV293 EQU   CVTRV289
CVTRV292 EQU   CVTRV289
CVTRV291 EQU   CVTRV289
CVTRV290 EQU   CVTRV289
CVTRV288 EQU   CVTRV280
CVTRV287 EQU   CVTRV280
CVTRV286 EQU   CVTRV280
CVTRV285 EQU   CVTRV280
CVTRV284 EQU   CVTRV280
CVTRV283 EQU   CVTRV280
CVTRV282 EQU   CVTRV280
CVTRV281 EQU   CVTRV280
CVTRV279 EQU   CVTRV271
CVTRV278 EQU   CVTRV271
CVTRV277 EQU   CVTRV271
CVTRV276 EQU   CVTRV271
CVTRV275 EQU   CVTRV271
CVTRV274 EQU   CVTRV271
CVTRV273 EQU   CVTRV271
CVTRV272 EQU   CVTRV271
CVTRV270 EQU   CVTRV262
CVTRV269 EQU   CVTRV262
CVTRV268 EQU   CVTRV262
CVTRV267 EQU   CVTRV262
CVTRV266 EQU   CVTRV262
CVTRV265 EQU   CVTRV262
CVTRV264 EQU   CVTRV262
CVTRV263 EQU   CVTRV262
CVTVFP   EQU   CVTS01+464
CVTVSI   EQU   CVTS01+460
CVTVPSIB EQU   CVTS01+456
CVTMFACT EQU   CVTMFRTR
CVTMFCTL EQU   CVTS01+448
CVTPVBP  EQU   CVTS01+444
CVTPWI   EQU   CVTS01+440
CVTRV254 EQU   CVTS01+438
CVTRV253 EQU   CVTS01+436
CVTRV252 EQU   CVTS01+434
CVTRV251 EQU   CVTS01+433
CVTRV250 EQU   CVTS01+432
CVTRV249 EQU   CVTS01+431
CVTRV248 EQU   CVTS01+430
CVTRV247 EQU   CVTS01+429
CVTRV246 EQU   CVTS01+428
CVTRV245 EQU   CVTRV237
CVTRV244 EQU   CVTRV237
CVTRV243 EQU   CVTRV237
CVTRV242 EQU   CVTRV237
CVTRV241 EQU   CVTRV237
CVTRV240 EQU   CVTRV237
CVTRV239 EQU   CVTRV237
CVTRV238 EQU   CVTRV237
CVTRV236 EQU   CVTRV228
CVTRV235 EQU   CVTRV228
CVTRV234 EQU   CVTRV228
CVTRV233 EQU   CVTRV228
CVTRV232 EQU   CVTRV228
CVTRV231 EQU   CVTRV228
CVTRV230 EQU   CVTRV228
CVTRV229 EQU   CVTRV228
CVTRV227 EQU   CVTRV219
CVTRV226 EQU   CVTRV219
CVTRV225 EQU   CVTRV219
CVTRV224 EQU   CVTRV219
CVTRV223 EQU   CVTRV219
CVTRV222 EQU   CVTRV219
CVTRV221 EQU   CVTRV219
CVTRV220 EQU   CVTRV219
CVTRV218 EQU   CVTRV210
CVTRV217 EQU   CVTRV210
CVTRV216 EQU   CVTRV210
CVTRV215 EQU   CVTRV210
CVTRV214 EQU   CVTRV210
CVTRV213 EQU   CVTRV210
CVTRV212 EQU   CVTRV210
CVTRV211 EQU   CVTRV210
CVTLCCAT EQU   CVTS01+420
CVTPCCAT EQU   CVTS01+416
CVTIPCRP EQU   CVTS01+412
CVTIPCRI EQU   CVTS01+408
CVTIPCDS EQU   CVTS01+404
CVTAIDVT EQU   CVTS01+400
CVTSSAP  EQU   CVTS01+396
CVTEHCIR EQU   CVTS01+392
CVTEHDEF EQU   CVTS01+388
CVTDAIR  EQU   CVTS01+384
CVTPERFM EQU   CVTS01+380
CVT044R2 EQU   CVTS01+376
CVTFETCH EQU   CVTS01+372
CVTRSTWD EQU   CVTS01+368
CVTSPOST EQU   CVTS01+364
CVTIOBP  EQU   CVTS01+360
CVTASMVT EQU   CVTS01+356
CVTRECRQ EQU   CVTS01+352
CVTWSAC  EQU   CVTS01+348
CVTRV149 EQU   CVTS01+344
CVTWSAL  EQU   CVTS01+340
CVTSPSA  EQU   CVTS01+336
CVTGLMN  EQU   CVTS01+332
CVTVEAC0 EQU   CVTS01+328
CVT062R1 EQU   CVTS01+324
CVTRPOST EQU   CVTS01+320
CVTDQIQE EQU   CVTS01+316
CVTCSD   EQU   CVTS01+312
CVTLKRMA EQU   CVTS01+308
CVTRSPIE EQU   CVTS01+304
CVTRENQ  EQU   CVTS01+300
CVTLQCB  EQU   CVTS01+296
CVTFQCB  EQU   CVTS01+292
CVTQCS01 EQU   CVTS01+288
CVTAPFT  EQU   CVTS01+284
CVTPARRL EQU   CVTS01+280
CVTVWAIT EQU   CVTS01+276
CVTGSPL  EQU   CVTS01+272
CVTLSMQ  EQU   CVTS01+268
CVTGSMQ  EQU   CVTS01+264
CVTEXPRO EQU   CVTS01+260
CVTOPCTP EQU   CVTS01+256
CVTSIC   EQU   CVTS01+252
CVTTPIOS EQU   CVTS01+248
CVTRTMS  EQU   CVTS01+244
CVTSDBF  EQU   CVTS01+240
CVTSCBP  EQU   CVTS01+236
CVTSDMP  EQU   CVTS01+232
CVTSV60  EQU   CVTS01+228
CVTRTMCT EQU   CVTS01+224
CVTASCBL EQU   CVTS01+220
CVTASCBH EQU   CVTS01+216
CVTGDA   EQU   CVTS01+212
CVTASVT  EQU   CVTS01+208
CVTVVMDI EQU   CVTS01+204
CVTAQTOP EQU   CVTS01+200
CVTIOSCS EQU   CVTS01+196
CVTSDRM  EQU   CVTS01+192
CVTOPTE  EQU   CVTS01+188
CVTSTXU  EQU   CVTS01+184
CVTQUIS  EQU   CVTS01+180
CVTPARS  EQU   CVTS01+176
CVTS1EE  EQU   CVTS01+172
CVTFRAS  EQU   CVTS01+168
CVTQSAS  EQU   CVTS01+164
CVTCRAS  EQU   CVTS01+160
CVTCRMN  EQU   CVTS01+156
CVTDELCP EQU   CVTS01+152
CVTFRECL EQU   CVTS01+148
CVTGETCL EQU   CVTS01+144
CVTBLDCP EQU   CVTS01+140
CVTAUTHL EQU   CVTS01+136
CVTSCAN  EQU   CVTS01+132
CVTRV144 EQU   CVTS01+130
CVTMAXMP EQU   CVTS01+128
CVTSTCK  EQU   CVTS01+124
CVTRV139 EQU   CVTS01+123
CVTDSSAC EQU   CVTS01+122
CVTRV513 EQU   CVTS01+121
CVTIOSPL EQU   CVTS01+120
CVTPTGT  EQU   CVTS01+116
CVTCSPIE EQU   CVTS01+112
CVTSMFEX EQU   CVTS01+108
CVTOLT0A EQU   CVTS01+104
CVTSRBRT EQU   CVTS01+100
CVTPUTL  EQU   CVTS01+96
CVTASCRL EQU   CVTS01+92
CVTASCRF EQU   CVTS01+88
CVTRV326 EQU   CVTS01+84
CVTRV325 EQU   CVTS01+80
CVTRV324 EQU   CVTS01+76
CVT0VL01 EQU   CVTS01+72
CVTSHRVM EQU   CVTS01+68
CVTRV332 EQU   CVTS01+64
CVTTAS   EQU   CVTS01+60
CVTRSCN  EQU   CVTS01+56
CVTTRAC2 EQU   CVTS01+54
CVTTRACE EQU   CVTS01+52
CVTAPG   EQU   CVTS01+51
CVTSDTRC EQU   CVTCTLFG
CVTGTRCE EQU   CVTCTLFG
CVTNOMP  EQU   CVTCTLFG
CVTRSV79 EQU   CVTCTLFG
CVTDSTAT EQU   CVTCTLFG
CVTRSV78 EQU   CVTCTLFG
CVTRV333 EQU   CVTCTLFG
CVTRV323 EQU   CVTCTLFG
CVTSPVLK EQU   CVTS01+49
CVTRSV77 EQU   CVTS01+48
CVTRV331 EQU   CVTS01+44
CVTRV330 EQU   CVTS01+40
CVTRV329 EQU   CVTS01+36
CVTRV328 EQU   CVTS01+32
CVTRV322 EQU   CVTS01+28
CVTSLID  EQU   CVTSLIDA+1
CVTSYLK  EQU   CVTSLIDA
CVTRV321 EQU   CVTS01+20
CVTRV320 EQU   CVTS01+16
CVTLPDIR EQU   CVTLPDIA+1
CVTRSV69 EQU   CVTDIRST
CVTRSV68 EQU   CVTDIRST
CVTRSV67 EQU   CVTDIRST
CVTRSV66 EQU   CVTDIRST
CVTRSV65 EQU   CVTDIRST
CVTRSV64 EQU   CVTDIRST
CVTRSV63 EQU   CVTDIRST
CVTDICOM EQU   CVTDIRST
CVTPVTP  EQU   CVTS01+8
CVTLPDSR EQU   CVTS01+4
CVTGETL  EQU   CVTS01
WKECHNGP EQU   WKECHAIN+1
@NM00064 EQU   WKEFLAGS
WKEGATE  EQU   WKEFLAGS
@NM00063 EQU   ISTWKE
ATCAOS   EQU   ISTATCVT+1584
ATCPOPAB EQU   ATCAOSM+640
ATCVIOPM EQU   ATCAOSM+636
ATCTPMMI EQU   ATCAOSM+632
ATCTPMPB EQU   ATCAOSM+600
ATCRSV88 EQU   ATCAOSM+596
ATCRPLCT EQU   ATCAOSM+594
ATCCRACT EQU   ATCAOSM+592
ATCSRBCT EQU   ATCAOSM+590
ATCRSV75 EQU   ATCAOSM+589
ATCRSV66 EQU   ATCZFLAG
ATCZF001 EQU   ATCZFLAG
ATCTPCP1 EQU   ATCAOSM+584
ATCTPCP0 EQU   ATCAOSM+580
ATCAICTN EQU   ATCAOSM+576
ATCZR01  EQU   ATCAOSM+572
ATCMPLTA EQU   ATCAOSM+568
ATCASCB  EQU   ATCAOSM+564
ATCAP86  EQU   ATCAOSM+560
ATCAP85  EQU   ATCAOSM+556
ATCAP84  EQU   ATCAOSM+552
ATCAP83  EQU   ATCAOSM+548
ATCAP82  EQU   ATCAOSM+544
ATCAP69  EQU   ATCAOSM+540
ATCAP66  EQU   ATCAOSM+536
ATCAP62  EQU   ATCAOSM+532
ATCAPC59 EQU   ATCAOSM+528
ATCAP56  EQU   ATCAOSM+524
ATCAP55  EQU   ATCAOSM+520
ATCRCFY0 EQU   ATCAOSM+516
ATCAP41  EQU   ATCAOSM+512
ATCAPC25 EQU   ATCAOSM+508
ATCAP23  EQU   ATCAOSM+504
ATCTPSPB EQU   ATCAOSM+472
ATCTRMPB EQU   ATCAOSM+440
ATCAPBE  EQU   ATCAOSM+436
ATCPSTA  EQU   ATCAOSM+432
ATCSMABF EQU   ATCAOSM+428
ATCSMAPR EQU   ATCAOSM+424
ATCTPWQA EQU   ATCAOSM+420
ATCSMAID EQU   ATCAOSM+416
ATCSMARA EQU   ATCAOSM+412
ATCCACXA EQU   ATCAOSM+408
ATCZLAAB EQU   ATCAOSM+404
ATCATA10 EQU   ATCAOSM+400
ATCHLTCB EQU   ATCAOSM+396
@NM00062 EQU   ATCVTFLG
ATCVTACT EQU   ATCVTFLG
ATCRPT40 EQU   ATCAOSM+388
ATCRPT39 EQU   ATCAOSM+384
ATCRPT38 EQU   ATCAOSM+380
ATCRPT37 EQU   ATCAOSM+376
ATCRPT36 EQU   ATCAOSM+372
ATCRPT35 EQU   ATCAOSM+368
ATCRPT34 EQU   ATCAOSM+364
ATCRPT33 EQU   ATCAOSM+360
ATCRPT32 EQU   ATCAOSM+356
ATCRPT31 EQU   ATCAOSM+352
ATCRPT30 EQU   ATCAOSM+348
ATCRPT29 EQU   ATCAOSM+344
ATCRPT28 EQU   ATCAOSM+340
ATCRPT27 EQU   ATCAOSM+336
@NM00061 EQU   ATCAOSM+333
@NM00060 EQU   @NM00059
ATCSNUF  EQU   @NM00059
ATCOPKL  EQU   @NM00059
ATCABEN  EQU   @NM00059
ATCAIWT  EQU   ATCAOSM+328
ATCINFDD EQU   ATCAOSM+324
ATCORFMG EQU   ATCAOSM+320
ATCORFRL EQU   ATCAOSM+316
ATCOROBT EQU   ATCAOSM+312
ATCORQG  EQU   ATCORSRB
ATCORTBF EQU   ATCSQAFR
ATCRPLAC EQU   ATCRPLCN+2
ATCRPLRC EQU   ATCRPLCN
ATCCRPLQ EQU   ATCCRPL
ATCSRBAC EQU   ATCSRBCN+2
ATCSRBRC EQU   ATCSRBCN
ATCSRBQ  EQU   ATCSRB
ATCCRAAC EQU   ATCCRACN+2
ATCCRARC EQU   ATCCRACN
ATCCRAQ  EQU   ATCCRA
ATCRPT12 EQU   ATCAOSM+276
ATCDMAPP EQU   ATCAOSM+272
ATCAP38  EQU   ATCAOSM+268
ATCZDFJ0 EQU   ATCAOSM+260
ATCAP51  EQU   ATCAOSM+256
ATCZPAB2 EQU   ATCAOSM+224
ATCZPAB1 EQU   ATCAOSM+192
ATCZLFVT EQU   ATCAOSM+188
ATCZLPVT EQU   ATCAOSM+184
ATCZDVTX EQU   ATCAOSM+180
ATCZDVTA EQU   ATCAOSM+176
ATCZDVT9 EQU   ATCAOSM+172
ATCZDVT8 EQU   ATCAOSM+168
ATCZDVT7 EQU   ATCAOSM+164
ATCRSV56 EQU   ATCDAPVT+22
ATCDAPDG EQU   ATCDAPVT+20
ATCDXCEA EQU   ATCDAPVT+16
ATCDCEA  EQU   ATCDAPVT+12
ATCDPCIA EQU   ATCDAPVT+8
ATCDSIOA EQU   ATCDAPVT+4
ATCDEOEA EQU   ATCDAPVT
ATCZLAEA EQU   ATCLDAPP+16
ATCZLCEA EQU   ATCLDAPP+12
ATCRSV17 EQU   ATCLDAPP+8
ATCSMFRR EQU   ATCLDAPP+4
ATCZAEA  EQU   ATCICAPP+16
ATCZCEA  EQU   ATCICAPP+12
ATCCDTCB EQU   ATCICAPP+8
ATCZSIOA EQU   ATCICAPP+4
ATCCDRPH EQU   ATCICAPP
ATCAP65  EQU   ATCAOSM+96
ATCZDVT6 EQU   ATCAOSM+92
ATCZDVT4 EQU   ATCAOSM+88
ATCZDVT3 EQU   ATCAOSM+84
ATCZDVT1 EQU   ATCAOSM+80
ATCICNCB EQU   ATCAOSM+76
ATCZFSVT EQU   ATCAOSM+68
ATCAP64  EQU   ATCAOSM+64
ATCAP63  EQU   ATCAOSM+60
ATCAP61  EQU   ATCAOSM+56
ATCAP58  EQU   ATCAOSM+52
ATCAP57  EQU   ATCAOSM+48
ATCAP54  EQU   ATCAOSM+44
ATCAP53  EQU   ATCAOSM+40
ATCAP52  EQU   ATCAOSM+36
ATCAP32  EQU   ATCAOSM+28
ATCAP31  EQU   ATCAOSM+24
ATCAP12  EQU   ATCAOSM+20
ATCAP11  EQU   ATCAOSM+16
ATCCMTCB EQU   ATCAOSM+12
ATCPRPH  EQU   ATCAOSM+8
ATCGSRBF EQU   ATCGSRBG
ATCSRBRT EQU   ATCAOSM
@NM00058 EQU   @NM00057
ATCVTMAB EQU   @NM00057
@NM00056 EQU   ATCVTBAM
ATCVDLOK EQU   ISTATCVT+904
ATCVFPAB EQU   ISTATCVT+872
ATCVDPAB EQU   ISTATCVT+840
ATCIOECB EQU   ISTATCVT+836
ATCINCW3 EQU   ISTATCVT+832
ATCMODTB EQU   ISTATCVT+828
ATCUSSPT EQU   ISTATCVT+824
ATCSRTAB EQU   ISTATCVT+820
@NM00055 EQU   ISTATCVT+819
@NM00054 EQU   ATCSTAT2
ATCTRSMS EQU   ATCSTAT2
ATCTRLOK EQU   ATCSTAT2
ATCTRPSS EQU   ATCSTAT2
ATCTRESC EQU   ATCSTAT2
ATCTRAPI EQU   ATCSTAT2
ATCNMCTR EQU   ISTATCVT+816
ATCSEC51 EQU   ATCSECST
ATCSEC40 EQU   ATCSIPD+8
ATCSEC30 EQU   ATCSIPD+4
ATCSEC21 EQU   ATCSIPD
ATCSEC10 EQU   ATCSOPD+4
ATCSEC01 EQU   ATCSOPD
ATCPOIA  EQU   ATCRNO+1
@NM00053 EQU   ATCRNO
ATCPODVT EQU   ISTATCVT+784
ATCS49XL EQU   ISTATCVT+780
ATCS49XI EQU   ISTATCVT+776
ATCLCLCT EQU   ATCVLCNT+2
ATCRNCNT EQU   ATCVLCNT
ATCCFEAD EQU   ISTATCVT+768
ATCPTR00 EQU   ISTATCVT+736
ATCRSV10 EQU   ISTATCVT+704
ATCTACB  EQU   ISTATCVT+700
ATCVTINM EQU   ISTATCVT+696
ATCTCLIM EQU   ISTATCVT+692
ATCTCLOM EQU   ISTATCVT+688
ATCVTIPB EQU   ISTATCVT+656
ATCTCIPB EQU   ISTATCVT+624
ATCTIPAB EQU   ISTATCVT+592
ATCOCCCB EQU   ISTATCVT+588
ATCOCCOB EQU   ISTATCVT+584
ATCCDLAD EQU   ISTATCVT+580
ATCCCLAD EQU   ISTATCVT+576
ATCDLRPB EQU   ISTATCVT+544
ATCPGPAB EQU   ISTATCVT+512
ATCVPAB1 EQU   ISTATCVT+480
ATCRSV97 EQU   ISTATCVT+476
ATCRDTLK EQU   ISTATCVT+472
ATCVOCLK EQU   ISTATCVT+468
ATCDVTLK EQU   ISTATCVT+456
ATCAP36  EQU   ISTATCVT+452
ATCAP35  EQU   ISTATCVT+448
ATCAP33  EQU   ISTATCVT+444
ATCRSV99 EQU   ISTATCVT+440
ATCONFIG EQU   ISTATCVT+432
ATCNODDS EQU   ISTATCVT+428
ATCNODEL EQU   ISTATCVT+420
ATCRSV69 EQU   ISTATCVT+416
ATCAPCR5 EQU   ISTATCVT+412
ATCLDECB EQU   ISTATCVT+408
ATCLDNCS EQU   ISTATCVT+404
ATCCDPTR EQU   ISTATCVT+400
ATCADEL  EQU   ISTATCVT+396
ATCTODVT EQU   ISTATCVT+392
ATCDEBCH EQU   ISTATCVT+388
ATCHBSIZ EQU   ATCHPGM+2
ATCHBFNO EQU   ATCHPGM
ATCCRME  EQU   ISTATCVT+380
ATCRVCHS EQU   ISTATCVT+372
ATCECTLP EQU   ISTATCVT+368
ATCZDVTB EQU   ISTATCVT+364
ATCECPRT EQU   ISTATCVT+360
ATCVTLOD EQU   ISTATCVT+356
ATCTRPAB EQU   ISTATCVT+352
ATCMSGM  EQU   ISTATCVT+348
ATCMSGP  EQU   ISTATCVT+344
ATCEPT   EQU   ISTATCVT+340
ATCDVT   EQU   ISTATCVT+336
ATCTRCPT EQU   ISTATCVT+332
ATCDVLOD EQU   ISTATCVT+328
ATCALERT EQU   ISTATCVT+324
ATCEPA   EQU   ISTATCVT+320
ATCSAF   EQU   ISTATCVT+318
ATCXRANG EQU   ISTATCVT+317
ATCLAST  EQU   ATCSHRFG
ATCSHRTN EQU   ISTATCVT+308
ATCUEP   EQU   ISTATCVT+304
ATCOCRT  EQU   ISTATCVT+300
ATCCSMA  EQU   ATCCSMR
ATCESC02 EQU   ISTATCVT+292
ATCESC01 EQU   ISTATCVT+288
ATCMNT   EQU   ISTATCVT+272
ATCRSV16 EQU   ISTATCVT+270
ATCMAXID EQU   ISTATCVT+269
ATCMSGSP EQU   ATCCOM+268
ATCACTRM EQU   ATCCOM+264
ATCNERAP EQU   ATCCOM+260
ATCNESAL EQU   ATCCOM+256
ATCRCC65 EQU   ATCCOM+252
ATCRCC26 EQU   ATCCOM+248
ATCRCC63 EQU   ATCCOM+244
ATCRSV11 EQU   ATCCOM+242
ATCVTMID EQU   ATCCOM+240
ATCAPOST EQU   ATCCOM+236
ATCNERFN EQU   ATCCOM+232
ATCNERNE EQU   ATCCOM+228
ATCNERCV EQU   ATCCOM+224
ATCNERST EQU   ATCCOM+220
ATCDCC61 EQU   ATCCOM+216
ATCDCC60 EQU   ATCCOM+212
ATCSRTDF EQU   ATCCOM+208
ATCSRTAD EQU   ATCCOM+204
ATCFIRA  EQU   ATCCOM+200
ATCSMBQ  EQU   ATCCOM+196
ATCSMRC  EQU   ATCCOM+192
ATCSMRS  EQU   ATCCOM+188
ATCSMQU  EQU   ATCCOM+184
ATCSMRQ  EQU   ATCCOM+180
ATCACDA  EQU   ATCCOM+176
ATCSTMA  EQU   ATCCOM+172
ATCFRSTR EQU   ATCCOM+168
ATCGTSTR EQU   ATCCOM+164
ATCREADA EQU   ATCCOM+160
ATCALOAD EQU   ATCCOM+156
ATCBLDLA EQU   ATCCOM+152
ATCFBRPH EQU   ATCCOM+148
ATCBFTRC EQU   ATCCOM+144
ATCTPBUF EQU   ATCTHTRC
ATCREMOV EQU   ATCCOM+136
ATCADD   EQU   ATCCOM+132
ATCBPDA  EQU   ATCCOM+128
ATCDVTPT EQU   ATCCOM+124
ATCFEPT  EQU   ATCCOM+120
ATCFDVT  EQU   ATCCOM+116
ATCCONFT EQU   ATCCOM+112
ATCPTCHA EQU   ATCCOM+108
ATCAUTHA EQU   ATCCOM+104
ATCACCTA EQU   ATCCOM+100
ATCRDTH  EQU   ATCCOM+96
ATCFRSCH EQU   ATCCOM+92
ATCFSB   EQU   ATCCOM+88
ATCHLTMS EQU   ATCCOM+84
ATCECPRM EQU   ATCCOM+80
ATCECNET EQU   ATCCOM+76
ATCECOPC EQU   ATCCOM+72
ATCVPARM EQU   ATCCOM+68
ATCECVRQ EQU   ATCCOM+64
ATCECSES EQU   ATCCOM+60
ATCOCHA  EQU   ATCCOM+56
ATCDSPLQ EQU   ATCCOM+52
ATCECDSP EQU   ATCCOM+48
ATCVARYQ EQU   ATCCOM+44
ATCECVRY EQU   ATCCOM+40
ATCHALTQ EQU   ATCCOM+36
ATCECHLT EQU   ATCCOM+32
ATCMODQ  EQU   ATCCOM+28
ATCECMOD EQU   ATCCOM+24
ATCASCHD EQU   ATCCOM+20
ATCSRT   EQU   ATCCOM+16
ATCRDT   EQU   ATCCOM+12
ATCDCFRR EQU   ATCCOM+8
ATCAPI   EQU   ATCCOM+4
ATCRSV04 EQU   ATCSTAT4
ATCVTTRC EQU   ATCSTAT4
ATCNCSD  EQU   ATCSTAT4
ATCMTST  EQU   ATCSTAT4
ATCTPRT  EQU   ATCSTAT4
ATCPRTAT EQU   ATCSTAT4
@NM00052 EQU   ATCPOFLG
ATCPOUNS EQU   ATCPOFLG
ATCHSDMF EQU   ATCSTFLG
@NM00051 EQU   ATCSTAT1
ATCMDHLT EQU   ATCSTAT1
ATCINHLT EQU   ATCSTAT1
ATCNETSL EQU   ATCSTAT1
ATCQKHLT EQU   ATCSTAT1
ATCSNHLT EQU   ATCSTAT1
ATCACTIV EQU   ATCSTAT1
ATCSTART EQU   ATCSTAT1
DYPPAB   EQU   ISTDYPAB+16
DYPRSV01 EQU   ISTDYPAB+12
DYPTSKID EQU   ISTDYPAB+8
DYPCHAIN EQU   ISTDYPAB+4
DYPFLGS  EQU   ISTDYPAB+2
DYPLNGTH EQU   ISTDYPAB+1
DYPTYPE  EQU   ISTDYPAB
ZRCZDFWB EQU   ISTZRCVT+120
ZRCZIFJB EQU   ISTZRCVT+116
ZRCZKFCB EQU   ISTZRCVT+112
ZRCZKFBB EQU   ISTZRCVT+108
ZRCZIFTB EQU   ISTZRCVT+104
ZRCZIFSB EQU   ISTZRCVT+100
ZRCZIFX0 EQU   ISTZRCVT+96
ZRCZIFAB EQU   ISTZRCVT+88
ZRCZIFGB EQU   ISTZRCVT+84
ZRCZIFHB EQU   ISTZRCVT+80
ZRCZIFCB EQU   ISTZRCVT+72
ZRCZIFDB EQU   ISTZRCVT+68
ZRCZIFEB EQU   ISTZRCVT+64
ZRCRSV01 EQU   ISTZRCVT+60
ZRCZGFBB EQU   ISTZRCVT+56
ZRCZIFQB EQU   ISTZRCVT+52
ZRCZIFNB EQU   ISTZRCVT+48
ZRCZIFOB EQU   ISTZRCVT+44
ZRCZIFMB EQU   ISTZRCVT+40
ZRCZIFKB EQU   ISTZRCVT+36
ZRCZIFLB EQU   ISTZRCVT+32
@NM00050 EQU   ISTZRCVT+28
@NM00049 EQU   ISTZRCVT+24
@NM00048 EQU   ISTZRCVT+20
@NM00047 EQU   ISTZRCVT+16
@NM00046 EQU   ISTZRCVT+12
ZRCZJF0B EQU   ISTZRCVT+8
ZRCZCFCI EQU   ISTZRCVT+4
ZRCZIF0B EQU   ISTZRCVT
DVEACIND EQU   DVERDTEA
ZPSZDFQR EQU   ISTZPSVT+80
ZPSZDFPR EQU   ISTZPSVT+76
ZPSZDFXR EQU   ISTZPSVT+72
ZPSZWRD5 EQU   ISTZPSVT+68
ZPSZWRD4 EQU   ISTZPSVT+64
ZPSZDFMB EQU   ISTZPSVT+60
ZPSZDFMF EQU   ISTZPSVT+56
ZPSZDFNB EQU   ISTZPSVT+52
@NM00045 EQU   ISTZPSVT+48
ZPSZDFF0 EQU   ISTZPSVT+44
ZPSZTRTT EQU   ISTZPSVT+40
ZPSZBFOB EQU   ISTZPSVT+36
ZPSZBFMB EQU   ISTZPSVT+32
ZPSZBFZ0 EQU   ISTZPSVT+28
ZPSZBFY0 EQU   ISTZPSVT+24
ZPSZDFI0 EQU   ISTZPSVT+20
ZPSZDFH0 EQU   ISTZPSVT+12
ZPSZDFD0 EQU   ISTZPSVT+8
ZPSZDFC0 EQU   ISTZPSVT+4
DIVRSV01 EQU   ISTDIVTH+6
DIVNUMFE EQU   ISTDIVTH+2
PATRSV01 EQU   PATFLAGA
PATUSEFG EQU   PATFLAGA
PATRDCNT EQU   ISTPAT+6
PATGRPID EQU   ISTPAT+5
PATPTHID EQU   ISTPAT+4
PATDINDX EQU   ISTPAT+2
PATGINDX EQU   ISTPAT
GNTGRPNM EQU   ISTGNT
DNTTELNO EQU   ISTDNT+1
DNTCTDIG EQU   ISTDNT
RLSRSV02 EQU   ISTRLS+140
RLSRSV01 EQU   ISTRLS+138
RLSCTELU EQU   ISTRLS+136
RLSPRE   EQU   ISTRLS
RDARSVPT EQU   ISTRDA+84
RDAPUBI  EQU   ISTRDA+83
RDADFCUA EQU   ISTRDA+80
RDACTPCC EQU   ISTRDA+79
RDADACUA EQU   ISTRDA+76
RDALUBA  EQU   RDAUCBAD+1
RDACHQI  EQU   RDAUCBAD
RDARSV01 EQU   RDAFLAG
RDARBISA EQU   RDAFLAG
RDAPRE   EQU   ISTRDA
RSWRSV01 EQU   ISTRSW+152
RSWRSV02 EQU   ISTRSW+150
RSWCTELU EQU   ISTRSW+148
RSWGRUPZ EQU   ISTRSW+146
RSWDIALZ EQU   ISTRSW+144
RSWGRUPT EQU   ISTRSW+140
RSWDIALT EQU   ISTRSW+136
RSWPRE   EQU   ISTRSW
RLXRSV03 EQU   ISTRLX+80
RLXRSV02 EQU   ISTRLX+77
RLXRSV01 EQU   RLXFLAGA
RLXINUSE EQU   RLXFLAGA
RLXNLUX  EQU   ISTRLX+72
RLXPRE   EQU   ISTRLX
RPXRSV01 EQU   ISTRPX+80
RPXRSV02 EQU   ISTRPX+77
RPXMAXLU EQU   ISTRPX+76
RPXFLUX  EQU   ISTRPX+72
RPXPRE   EQU   ISTRPX
RLURSV02 EQU   ISTRLU+172
RLULGMOD EQU   ISTRLU+164
RLUMODEP EQU   RLUMODET+8
RLUMODEN EQU   RLUMODET
RLUUSSPT EQU   RLUUSSTB+8
RLUUSSNM EQU   RLUUSSTB
RLURSV01 EQU   ISTRLU+137
RLULOCAD EQU   ISTRLU+136
RLUNCPPM EQU   RLUNCPPC+1
RLUNCPPN EQU   RLUNCPPC
RLUPACEM EQU   RLUPACE+1
RLUPACEN EQU   RLUPACE
RLUINTA  EQU   ISTRLU+128
RLUSSCFM EQU   ISTRLU+127
RLUCRRSV EQU   RLUCRFLG
RLUACTLU EQU   RLUCRFLG
RLURSV00 EQU   RLUFLAG
RLUNDSES EQU   RLUFLAG
RLUGSTAT EQU   RLUFLAG
RLUBATCH EQU   RLUFLAG
RLURBISA EQU   RLUFLAG
RLUTYPE  EQU   ISTRLU+124
RLUCRPR  EQU   ISTRLU
RCCRVPT2 EQU   ISTRCC+144
RCCXTOSW EQU   ISTRCC+140
RCCSWTOX EQU   ISTRCC+136
RCCRSPT2 EQU   ISTRCC+133
RCCADDR  EQU   ISTRCC+132
RCCPASSL EQU   ISTRCC+131
RCCMXOUT EQU   ISTRCC+130
RCCMXDAT EQU   ISTRCC+128
RCCINDEX EQU   ISTRCC+126
RCCPATHZ EQU   ISTRCC+124
RCCPATHT EQU   ISTRCC+120
RCCDPQ   EQU   ISTRCC+116
RCCTPAB  EQU   ISTRCC+112
RCCRSV02 EQU   ISTRCC+109
RCCCRRSV EQU   RCCCRFLG
RCCCTCFL EQU   RCCCRFLG
RCCACTPU EQU   RCCCRFLG
RCCNCSPL EQU   ISTRCC+104
RCCRPHCN EQU   ISTRCC+100
RCCEPAB  EQU   ISTRCC+96
RCCDPAB  EQU   ISTRCC+92
RCCVPAB  EQU   ISTRCC+88
@NM00044 EQU   ISTRCC+87
RCCSESCT EQU   ISTRCC+86
RCCIDNUM EQU   RCCID48+3
RCCIDBLK EQU   RCCID48+2
RCCIDPA2 EQU   RCCID48+1
RCCIDPUT EQU   RCCID48
RCCIDPA1 EQU   RCCSTAID
RCCCTELU EQU   ISTRCC+76
RCCCNCNT EQU   ISTRCC+75
RCCRTGOH EQU   RCCFLAGB
RCCBRKCN EQU   RCCFLAGB
RCCRESET EQU   RCCFLAGB
RCCFINAL EQU   RCCFLAGB
RCCBNNSP EQU   RCCFLAGB
RCCIRETR EQU   RCCFLAGB
RCCDIALP EQU   RCCFLAGB
RCCDSTCT EQU   RCCFLAGB
RCCCTPGD EQU   RCCFLAG
RCCPRGDN EQU   RCCFLAG
RCCOUERP EQU   RCCFLAG
RCCOHIMM EQU   RCCFLAG
RCCLDISC EQU   RCCFLAG
RCCERPIP EQU   RCCFLAG
RCCCUDIE EQU   RCCFLAG
RCCRBISA EQU   RCCFLAG
RCCTYPE  EQU   ISTRCC+72
RCCPRE   EQU   ISTRCC
DOTADTRM EQU   ISTDOT
RDSADDOT EQU   ISTRDS+76
RDSCTATR EQU   ISTRDS+74
RDSCTTRM EQU   ISTRDS+72
RDSPRE   EQU   ISTRDS
RINRSV05 EQU   ISTRIN+156
RINRSV04 EQU   ISTRIN+152
RINLOCRN EQU   ISTRIN+148
RINRSV02 EQU   ISTRIN+145
RTRCNCNT EQU   RINCNCNT
RTRNCSPL EQU   RINNCSPL
RTRRPHCN EQU   RINRPHCN
RTRVPAB  EQU   RINVPAB
RTRREMOT EQU   RINREMOT
RTRRLDAF EQU   RINRLDAF
RTRNODID EQU   RINNODID
RINRSV01 EQU   RINDFD
RTRLDISC EQU   RINLDISC
RTRNODEF EQU   RINNODEF
RTRREMPO EQU   RINREMPO
RINCRPRE EQU   ISTRIN
RTRRSV04 EQU   ISTRTR+210
RTRLCTI  EQU   ISTRTR+209
RTRRSVDD EQU   ISTRTR+181
RTRRDFG  EQU   ISTRTR+180
RTRDIAA  EQU   ISTRTR+176
RTRPOLA  EQU   ISTRTR+172
RTRCADDR EQU   ISTRTR+164
RTRCTADR EQU   ISTRTR+162
RTRCTPOL EQU   ISTRTR+160
RTRCTDIA EQU   ISTRTR+158
RTRRSV03 EQU   ISTRTR+156
RTRRVPT1 EQU   ISTRTR+152
RTRBHSN1 EQU   ISTRTR+144
RTRCRSV2 EQU   RTRCRFLG
RTRDTRLM EQU   RTRLSCMD
RTRCRSV1 EQU   RTRCRFLG
RTRTRMAX EQU   ISTRTR+142
RTRRSV24 EQU   RTRRDFF
RTRRFDEK EQU   RTRRDFF
RTRRFANK EQU   RTRRDFF
RTRRFPFK EQU   RTRRDFF
RTRRFPEN EQU   RTRRDFF
RTRRFXCT EQU   RTRRDFF
RTRRESCT EQU   RTRRDFE
RTRRESUP EQU   RTRRDFE
RTRREATT EQU   RTRRDFE
RTRRECHK EQU   RTRRDFE
RTRREACR EQU   RTRRDFE
RTRRSV0A EQU   RTRRDFE
RTRREBRK EQU   RTRRDFE
RTRRSV11 EQU   RTRRDFD
RTRRSV10 EQU   RTRRDFD
RTRRDBHI EQU   RTRRDFD
RTRRDBHD EQU   RTRRDFD
RTRRDBHN EQU   RTRRDFD
RTRRSV23 EQU   RTRRDFC
RTRRCXMS EQU   RTRRDFC
RTRRCMSG EQU   RTRRDFC
RTRRCBLK EQU   RTRRDFC
RTRRCPT3 EQU   RTRRDFC
RTRRCIT2 EQU   RTRRDFC
RTRRCIT1 EQU   RTRRDFC
RTRRSV32 EQU   RTRRDFB
RTRRBEND EQU   RTRRDFB
RTRRBECT EQU   RTRRDFB
RTRRSV02 EQU   RTRRDFA
RTRRACTR EQU   RTRRDFA
RTRRSV60 EQU   RTRRDFA
RTRRACDT EQU   RTRRDFA
RTRRAPT3 EQU   RTRRAALL
RTRRAPT2 EQU   RTRRAALL
RTRRAPT1 EQU   RTRRAALL
RTRRAATN EQU   RTRRDFA
RTRRSV45 EQU   ISTRTR+132
RTRRSV01 EQU   ISTRTR+130
RTRCTECM EQU   ISTRTR+128
RTRADRPT EQU   RTRADR+1
RTRRSV22 EQU   RTRFLAG
RTRVTERM EQU   RTRFLAG
RTRRSV51 EQU   RTRFLAG
RTRRBISA EQU   RTRFLAG
RTRRSV21 EQU   RTRFLAG
RTRCRPR  EQU   ISTRTR
RCLRVPT2 EQU   ISTRCL+92
RCLRVPT1 EQU   ISTRCL+88
RCLGPOLA EQU   ISTRCL+84
RCLCTNGP EQU   ISTRCL+82
RCLRSV01 EQU   ISTRCL+80
RCLCTECM EQU   ISTRCL+78
RCLCTETR EQU   ISTRCL+76
RCLGPADR EQU   RCLADR+1
RCLRSV33 EQU   RCLFLAG
RCLBATCH EQU   RCLFLAG
RCLRBISA EQU   RCLFLAG
RCLRSV22 EQU   RCLFLAG
RCLPRE   EQU   ISTRCL
RPTRSV03 EQU   ISTRPT+156
RPTRSV02 EQU   ISTRPT+152
RPTNSNSV EQU   ISTRPT+148
RPTPTHCT EQU   ISTRPT+146
RPTPEPCT EQU   ISTRPT+144
RPTDAFSV EQU   ISTRPT+142
RPTRSV01 EQU   ISTRPT+141
RPTISTAT EQU   RPTFLAG1
RPTDYNAM EQU   RPTFLAG1
RPTVYIMM EQU   RPTFLAG1
RPTVIODN EQU   RPTFLAG1
RPTONLIN EQU   RPTFLAG1
RPTHLVPD EQU   RPTFLAG1
RPTVRYPD EQU   RPTFLAG1
RPTASLEP EQU   RPTFLAG1
RPTCTNM  EQU   ISTRPT+120
RPTLNDAF EQU   RPTLNCID+2
RPTLNSAF EQU   RPTLNCID
RPTLN    EQU   ISTRPT
RLNRVPT2 EQU   ISTRLN+112
RLNNCSPL EQU   ISTRLN+108
RLNX2SW  EQU   ISTRLN+104
@NM00043 EQU   ISTRLN+103
RLNCRRSV EQU   RLNCRFLG
RLNSWEP  EQU   RLNCRFLG
RLNSVSKP EQU   RLNLSCMD
RLNSESLM EQU   RLNLSCMD
RLNNPRLM EQU   RLNLSCMD
RLNSWNCP EQU   RLNCRFLG
RLNACTLN EQU   RLNCRFLG
RLNPAUSE EQU   ISTRLN+101
RLNPOLMT EQU   ISTRLN+100
RLNACTSN EQU   ISTRLN+98
RLNRESV1 EQU   ISTRLN+97
RLNACTRM EQU   ISTRLN+96
RLNCTSES EQU   ISTRLN+95
RLNRDSLM EQU   ISTRLN+94
RLNAUTOA EQU   ISTRLN+92
RLNRDFD  EQU   RLNRDF+3
RLNRDFC  EQU   RLNRDF+2
RLNMULTP EQU   RLNRDFB
RLNRATRN EQU   RLNRDFB
RLNRAPOL EQU   RLNRDFB
RLNTTV   EQU   RLNRDFB
RLNRSV0B EQU   RLNRDFB
RLNAUTOD EQU   RLNRDFB
RLNANSWR EQU   RLNRDFB
RLNRBUSE EQU   RLNRDFB
RLNRAPEP EQU   RLNRDFA
RLNRANCP EQU   RLNRDFA
RLNRAEP  EQU   RLNRDFA
RLNIDV   EQU   RLNRDFA
RLNPORT  EQU   RLNRDFA
RLNGANSW EQU   RLNRDFA
RLNRACAN EQU   RLNRACNT
RLNRACAT EQU   RLNRACNT
RLNRSV04 EQU   RLNSTAT2
RLNINUSE EQU   RLNSTAT2
RLNOHIN  EQU   RLNSTAT2
RLNRSV03 EQU   RLNSTAT1
RLNVD    EQU   RLNSTAT1
RLNINOPP EQU   RLNSTAT1
RLNINOPL EQU   RLNSTAT1
RLNLRST  EQU   RLNSTAT1
RLNTRAP  EQU   RLNSTAT1
RLNACTCT EQU   ISTRLN+84
RLNCTECM EQU   ISTRLN+82
RLNCTEIN EQU   ISTRLN+80
RLNCTETR EQU   ISTRLN+78
RLNCTECL EQU   ISTRLN+76
RLNCUA   EQU   RLNUCBAD
RLNRSV01 EQU   RLNFLAG
RLNRBISA EQU   RLNFLAG
RLNEAM   EQU   RLNFLAG
RLNPRE   EQU   ISTRLN
RGPRVPT2 EQU   ISTRGP+88
RGPRVPT1 EQU   ISTRGP+84
RGPCTECM EQU   ISTRGP+82
RGPCTEIN EQU   ISTRGP+80
RGPCTETR EQU   ISTRGP+78
RGPCTECL EQU   ISTRGP+76
RGPCTELN EQU   ISTRGP+74
RGPRSV03 EQU   ISTRGP+73
RGPRSV02 EQU   RGPFLG
RGPASDLC EQU   RGPFLG
RGPABSC  EQU   RGPFLG
RGPASS   EQU   RGPFLG
RGPADIL  EQU   RGPFLG
RGPPRE   EQU   ISTRGP
RRNRINNM EQU   ISTRRN+248
@NM00042 EQU   ISTRRN+247
RRNRDCUA EQU   ISTRRN+244
RRNLASTE EQU   ISTRRN+240
RRNNCSPL EQU   ISTRRN+236
RRNRPLPT EQU   ISTRRN+232
RRNMSIZE EQU   ISTRRN+228
RRNNCPNM EQU   ISTRRN+221
RRNCTPCC EQU   ISTRRN+220
RRNHBUFS EQU   ISTRRN+218
RRNHLENT EQU   RRNHPRE+1
RRNHLENH EQU   RRNHPRE
RRNNMNCP EQU   ISTRRN+208
RRNDELAY EQU   ISTRRN+206
RRNRSV04 EQU   ISTRRN+200
RRNRSV88 EQU   RRNNMDPD+7
RRNPUBI  EQU   RRNNMDPD+6
RRNDPLUB EQU   RRNNMDPD
RRNEPADR EQU   ISTRRN+190
RRNCPLUB EQU   ISTRRN+184
RRNFLUX  EQU   ISTRRN+180
RRNRSV05 EQU   RRNCMFD
RRNREMPO EQU   RRNCMFD
RRNCDREC EQU   RRNCMFD
RRNCDDSI EQU   RRNCMFD
RRNCDBCK EQU   RRNCMFD
RRNCDDTL EQU   RRNCMFD
RRNCDSTD EQU   RRNCMFD
RRNCDCSP EQU   RRNCMFD
RRNCCCSL EQU   RRNCMFC
RRNCCSIM EQU   RRNCMFC
RRNCCRCM EQU   RRNCMFC
RRNCCRIM EQU   RRNCMFC
RRNCCCRC EQU   RRNCMFC
RRNCCRST EQU   RRNCMFC
RRNCCRDQ EQU   RRNCMFC
RRNCCRCN EQU   RRNCMFC
RRNCBALT EQU   RRNCMFB
RRNCBMOD EQU   RRNCMFB
RRNCBNPL EQU   RRNCMFB
RRNCBRLS EQU   RRNCMFB
RRNCBRDS EQU   RRNCMFB
RRNCBDLR EQU   RRNCMFB
RRNCBDLH EQU   RRNCMFB
RRNCBDLO EQU   RRNCMFB
RRNCADGO EQU   RRNCMFA
RRNCADTD EQU   RRNCMFA
RRNCACDT EQU   RRNCMFA
RRNCAMBH EQU   RRNCMFA
RRNCAATI EQU   RRNCMFA
RRNCAATG EQU   RRNCMFA
RRNCAATD EQU   RRNCMFA
RRNCAALL EQU   RRNCMFA
RRNRSV55 EQU   RRNRDF+3
RRNPTASL EQU   RRNRDFB+1
RRNRSV01 EQU   RRNRDFB+1
RRNVYDON EQU   RRNRDFB+1
RRNRBBUP EQU   RRNRDFB+1
RRNRSV03 EQU   RRNRDFB
RRNRBCT2 EQU   RRNRDFB
RRNRBCT1 EQU   RRNRDFB
RRNRBSEC EQU   RRNRDFB
RRNRBCCT EQU   RRNRDFB
RRNRBCCL EQU   RRNRDFB
RRNRSV02 EQU   RRNRDFB
RRNRBMDL EQU   RRNRDFB
RRNRAPEP EQU   RRNRDFA
RRNRANCP EQU   RRNRDFA
RRNRBREM EQU   RRNRDFA
RRNRAOLT EQU   RRNRDFA
RRNRASYN EQU   RRNRDFA
RRNRADMP EQU   RRNRDFA
RRNRAIPL EQU   RRNRDFA
RRNRASHT EQU   RRNRDFA
RRNCTENT EQU   ISTRRN+170
RRNCTECM EQU   ISTRRN+168
RRNCTEIN EQU   ISTRRN+166
RRNCTETR EQU   ISTRRN+164
RRNCTECL EQU   ISTRRN+162
RRNCTELI EQU   ISTRRN+160
RRNCTEGP EQU   ISTRRN+158
RRNCTBHS EQU   ISTRRN+156
RRNBHSET EQU   ISTRRN+152
RRNTRENT EQU   ISTRRN+148
RRNRLDIP EQU   ISTRRN+147
RRNRNCUA EQU   ISTRRN+144
RRNGRPA  EQU   ISTRRN+140
RRNLUBA  EQU   RRNUCBAD+1
RRNCHQI  EQU   RRNUCBAD
RRNRSV11 EQU   RRNFLAG
RRNDSTCT EQU   RRNFLAG
RRNERPIP EQU   RRNFLAG
RRNLCDIP EQU   RRNFLAG
RRNLCDIE EQU   RRNFLAG
RRNLCSIP EQU   RRNFLAG
RRNRBISA EQU   RRNFLAG
RRNRSV89 EQU   RRNFLAG
RRNPRE   EQU   ISTRRN
RLCRVPT2 EQU   ISTRLC+80
RLCRVPT1 EQU   ISTRLC+79
RLCLCCUA EQU   ISTRLC+76
RLCUCBAD EQU   RLCADR+1
RLCRSVDE EQU   RLCFLAG
RLCACNT  EQU   RLCFLAG
RLCRSV14 EQU   RLCFLAG
RLCRBISA EQU   RLCFLAG
RLCRSV22 EQU   RLCFLAG
RLCPRE   EQU   ISTRLC
RAPRVPT2 EQU   ISTRAP+116
RAPRVPT1 EQU   ISTRAP+112
RAPBFACT EQU   ISTRAP+111
RAPRSV17 EQU   RAPFLGC
RAPRSV16 EQU   RAPFLGC
RAPRSV15 EQU   RAPFLGC
RAPRSV14 EQU   RAPFLGC
RAPRSV13 EQU   RAPFLGC
RAPRSV12 EQU   RAPFLGC
RAPRSV11 EQU   RAPFLGC
RAPRSV10 EQU   RAPFLGC
RAPANVPC EQU   RAPFLGB
RAPASPO  EQU   RAPFLGB
RAPAPPO  EQU   RAPFLGB
RAPAACQ  EQU   RAPFLGB
RAPAPRMT EQU   RAPFLGB
RAPAPASS EQU   RAPFLGB
RAPABLCK EQU   RAPFLGB
RAPALLF  EQU   RAPFLGB
RAPRSV06 EQU   RAPFLG
RAPRSV05 EQU   RAPFLG
RAPRSV04 EQU   RAPFLG
RAPRSV03 EQU   RAPFLG
RAPATLGN EQU   RAPFLG
RAPASLGI EQU   RAPFLG
RAPAQUI  EQU   RAPFLG
RAPABLGN EQU   RAPFLG
RAPACEQD EQU   ISTRAP+106
RAPTRPRE EQU   ISTRAP+104
RAPACEAP EQU   ISTRAP+100
RAPICEAQ EQU   ISTRAP+96
RAPICEAC EQU   ISTRAP+92
RAPICELG EQU   ISTRAP+88
RAPAPPWD EQU   ISTRAP+80
RAPACDEB EQU   ISTRAP+76
RAPACBA  EQU   ISTRAP+72
RAPPRE   EQU   ISTRAP
RDTVSRPL EQU   ISTRDT+132
RDTCRSPW EQU   ISTRDT+124
RDTCRSDS EQU   ISTRDT+116
@NM00041 EQU   ISTRDT+113
RRNSTCNT EQU   RDTSTCNT
RRNVYRPH EQU   RDTVYRPH
RDTTPAB  EQU   ISTRDT+104
RDTDPAB  EQU   ISTRDT+100
RDTEPAB  EQU   ISTRDT+96
RDTVPAB  EQU   ISTRDT+92
RDTRSV01 EQU   RDTFLAGB
RDTBHSET EQU   RDTFLAGB
RDTCTCFL EQU   RDTFLAGB
RDTCTPGD EQU   RDTFLAGB
RDTPRGDN EQU   RDTFLAGB
RDTOUERP EQU   RDTFLAGB
RDTLGCT  EQU   ISTRDT+90
RDTNODID EQU   ISTRDT+89
RDTMAXID EQU   ISTRDT+88
RDTCTSNT EQU   ISTRDT+86
RDTFLAGS EQU   ISTRDT+84
RDTBACK  EQU   ISTRDT+80
RDTFORW  EQU   ISTRDT+76
RDTLEN   EQU   RDTPLEN+1
RDTPRILS EQU   RDTPRIOR
RDTPRISW EQU   RDTPRIOR
RDTPRIRN EQU   RDTPRIOR
RDTPRILC EQU   RDTPRIOR
RDTPRIAP EQU   RDTPRIOR
@NM00040 EQU   RDTPRIOR
RDTPRE   EQU   ISTRDT
RCPRSV05 EQU   ISTRCPRE+120
RCPRSV04 EQU   ISTRCPRE+116
RCPRSV03 EQU   ISTRCPRE+112
RCPINTA  EQU   RCPLGNIN+16
RCPLGNCT EQU   RCPLGNIN+8
RCPLGNAP EQU   RCPLGNIN
@NM00039 EQU   RCPPMODE
RCPRRECD EQU   RCPPMODE
RCPRBASC EQU   RCPPMODE
RCPBFLIM EQU   ISTRCPRE+90
RCPBHSI2 EQU   ISTRCPRE+89
RCPBHSI1 EQU   ISTRCPRE+88
RCPACETR EQU   ISTRCPRE+84
RCPICEAQ EQU   ISTRCPRE+80
RCPLNAPA EQU   ISTRCPRE+76
RCPICELN EQU   ISTRCPRE+72
RCPPRE   EQU   ISTRCPRE
RPRCONID EQU   ISTRPRE+63
RPRCLVPD EQU   RPRFLAGC
RPRINIMM EQU   RPRFLAGD
RPRRSV05 EQU   RPRFLAGD
RPRCONP  EQU   RPRFLAGD
RPRACTP  EQU   RPRFLAGD
RPRRSON  EQU   RPRFLAGD
RPRCONCT EQU   RPRFLAGD
RPRLTASN EQU   RPRFLAGD
RPRPTHCT EQU   ISTRPRE+60
RPRSWDAF EQU   ISTRPRE+58
RPRSTPCT EQU   ISTRPRE+56
RPRRVPT1 EQU   ISTRPRE+52
RPRDEVCH EQU   ISTRPRE+44
RPRNCBA  EQU   ISTRPRE+40
RPRNSNEA EQU   ISTRPRE+36
RPRLGONB EQU   ISTRPRE+32
RPRLGONF EQU   ISTRPRE+28
RPRHDTYP EQU   ISTRPRE+27
RPRTIOCT EQU   ISTRPRE+26
RPRPEPCT EQU   ISTRPRE+24
RPRRSV03 EQU   RPRCAUSE
RPRRSYNC EQU   RPRCAUSE
RPRCRCPT EQU   RPRCAUSE
RPRNOSRT EQU   RPRCAUSE
RPRINTST EQU   RPRFLAGB
RPRVYIMM EQU   RPRFLAGB
RPRHLVPD EQU   RPRFLAGB
RPRONLIN EQU   RPRFLAGB
RPRVIODN EQU   RPRFLAGB
RPRAOPN  EQU   RPRFLAGB
RPRENTVT EQU   RPRFLAGB
RPRENTVH EQU   RPRFLAGB
RPRLIVE  EQU   RPRFLAGA
RPRVRYPD EQU   RPRFLAGA
RPRENTED EQU   RPRFLAGA
RPRENTIO EQU   RPRFLAGA
RPRENTBF EQU   RPRFLAGA
RPRTIED  EQU   RPRFLAGA
RPRINV   EQU   RPRFLAGA
RPRACT   EQU   RPRFLAGA
RPRENTRY EQU   ISTRPRE+20
RPRPELEN EQU   ISTRPRE+18
RPRELEN  EQU   ISTRPRE+16
RPRRLOCK EQU   ISTRPRE+12
RPRDAF   EQU   RPRCOMID+2
RPRSAF   EQU   RPRCOMID
RPRNAME  EQU   ISTRPRE
CRACHAIN EQU   ISTCRA+928
CRARSV02 EQU   ISTCRA+924
CRARSV01 EQU   ISTCRA+920
CRABFTBA EQU   CRABUFA
CRAMASK  EQU   CRASVC+64
CRAHSIZ  EQU   CRASVC+60
CRAASCRR EQU   CRASVC
CRAPROCR EQU   ISTCRA+312
CRAPSS   EQU   ISTCRA+160
CRARPH   EQU   ISTCRA+52
CRALAPTR EQU   CRABASIC+48
CRAL9PTR EQU   CRABASIC+44
CRAL8PTR EQU   CRABASIC+40
CRAL7PTR EQU   CRABASIC+36
CRAL6PTR EQU   CRABASIC+32
CRAL5PTR EQU   CRABASIC+28
CRAL4PTR EQU   CRABASIC+24
CRAL3PTR EQU   CRABASIC+20
CRAL2PTR EQU   CRABASIC+16
CRAL1PTR EQU   CRABASIC+12
CRALEV01 EQU   CRALKACT+3
CRALEV02 EQU   CRALKACT+3
CRALEV03 EQU   CRALKACT+3
CRALEV04 EQU   CRALKACT+3
CRALEV05 EQU   CRALKACT+3
CRALEV06 EQU   CRALKACT+3
CRALEV07 EQU   CRALKACT+3
CRALEV08 EQU   CRALKACT+3
CRALEV09 EQU   CRALKACT+2
CRALEV10 EQU   CRALKACT+2
CRALEV11 EQU   CRALKACT+2
CRALEV12 EQU   CRALKACT+2
CRALEV13 EQU   CRALKACT+2
CRALEV14 EQU   CRALKACT+2
CRALEV15 EQU   CRALKACT+2
CRALEV16 EQU   CRALKACT+2
CRALEV17 EQU   CRALKACT+1
CRALEV18 EQU   CRALKACT+1
CRALEV19 EQU   CRALKACT+1
CRALEV20 EQU   CRALKACT+1
CRALEV21 EQU   CRALKACT+1
CRALEV22 EQU   CRALKACT+1
CRALEV23 EQU   CRALKACT+1
CRALEV24 EQU   CRALKACT+1
CRALEV25 EQU   CRALKACT
CRALEV26 EQU   CRALKACT
CRALEV27 EQU   CRALKACT
CRALEV28 EQU   CRALKACT
CRALEV29 EQU   CRALKACT
CRALEV30 EQU   CRALKACT
CRALEV31 EQU   CRALKACT
CRALEV32 EQU   CRALKACT
CRAFRR   EQU   CRAHDR+4
@NM00038 EQU   ISTAPCRR+137
@NM00037 EQU   APC57FLG
APCNREL  EQU   APC57FLG
APCRECRA EQU   APC57FLG
@NM00036 EQU   APC54FLG
APCRLST  EQU   APC54FLG
APCPR153 EQU   APC53FLG
@NM00035 EQU   APC52FLG
APCWKF   EQU   APC52FLG
APCNWF   EQU   APC52FLG
APCRDQ   EQU   APC52FLG
APCQENQ  EQU   APC52FLG
APCSMSR  EQU   APC52FLG
APCCKRQ  EQU   APC52FLG
@NM00034 EQU   APC31FLG
APCSORT  EQU   APC31FLG
APCRESCH EQU   APC31FLG
APCTPXIT EQU   APC31FLG
APCSWTWD EQU   ISTAPCRR+128
APCSAV2  EQU   ISTAPCRR+124
APCSAV1  EQU   ISTAPCRR+120
APCRETCD EQU   APCCOMF+2
@NM00033 EQU   APCCOMF1+1
APCZLBER EQU   APCCOMF1
APCEXIT  EQU   APCCOMF1
APCRELR  EQU   APCCOMF1
APCIRB2  EQU   APCCOMF1
APCIRB1  EQU   APCCOMF1
APCSMCR  EQU   APCCOMF1
APCUETSK EQU   APCCOMF1
APCSSTSK EQU   APCCOMF1
APCESTAL EQU   APCSAVE
APCFRRPM EQU   ISTAPCRR+40
APCQWFO  EQU   ISTAPCRR+36
APCPABSV EQU   ISTAPCRR+32
APCRTRN  EQU   ISTAPCRR+28
APCTCBA  EQU   ISTAPCRR+24
APCPSTA  EQU   ISTAPCRR+20
@NM00032 EQU   APCRFLG+1
APC31R   EQU   APCRFLG
APC58R   EQU   APCRFLG
APC57R   EQU   APCRFLG
APC56R   EQU   APCRFLG
APC54R   EQU   APCRFLG
APC53R   EQU   APCRFLG
APC52R   EQU   APCRFLG
APC51R   EQU   APCRFLG
@NM00031 EQU   APCATFLG+1
APC31E   EQU   APCATFLG
APC58E   EQU   APCATFLG
APC57E   EQU   APCATFLG
APC56E   EQU   APCATFLG
APC54E   EQU   APCATFLG
APC53E   EQU   APCATFLG
APC52E   EQU   APCATFLG
APC51E   EQU   APCATFLG
APCHDRSV EQU   ISTAPCRR
ASCPSREG EQU   ISTASCRR+44
ASCUSR01 EQU   ASCUSRGS+12
ASCUSR00 EQU   ASCUSRGS+8
ASCUSR15 EQU   ASCUSRGS+4
ASCUSR14 EQU   ASCUSRGS
ASCETRYA EQU   ISTASCRR+24
ASCKEY   EQU   ISTASCRR+23
ASCAUDIT EQU   ASCFLG3
ASCFBDUD EQU   ASCFLG3
ASCLLKF  EQU   ASCFLG3
ASCKEYF  EQU   ASCFLG3
ASCFBDAL EQU   ASCFLG3
ASCFSRGT EQU   ASCFLG3
ASCICR   EQU   ASCFLG2
ASCFSRIC EQU   ASCFLG2
ASCFBDIC EQU   ASCFLG2
ASCFBAIC EQU   ASCFLG2
ASCPASTR EQU   ASCFLG1
ASCFSR   EQU   ASCFLG1
ASCFBD   EQU   ASCFLG1
ASCFBA   EQU   ASCFLG1
ASCPFCRR EQU   ISTASCRR
CCFRSVD1 EQU   CFCCRT
CCFCR2   EQU   CFCCRT
CCFCRP   EQU   CFCCRT
CCFCR1   EQU   CFCCRT
CCFCS2   EQU   CFCCRT
CCFCS1   EQU   CFCCRT
NCFRSVD  EQU   CFCNTRD
NCFCR2   EQU   CFCNTRD
NCFCRP   EQU   CFCNTRD
NCFCR1   EQU   CFCNTRD
NCFCS2   EQU   CFCNTRD
NCFCS1   EQU   CFCNTRD
PFCRSV01 EQU   ISTPFCRR+13
PFCFTA   EQU   ISTPFCRR+12
CRRFRR   EQU   PFCFRRO
CRRCHAIN EQU   PFCCRRO
CRRLEN   EQU   PFCCRRLN
PFCRSV10 EQU   PFCCRR+1
CRRID    EQU   PFCCRRID
RPHNEXPO EQU   ISTRPH+104
RPHSAV16 EQU   RPHWORK+60
RPHSAV15 EQU   RPHWORK+56
RPHSAV14 EQU   RPHWORK+52
RPHSAV13 EQU   RPHWORK+48
RPHSAV12 EQU   RPHWORK+44
RPHSAV11 EQU   RPHWORK+40
RPHSAV10 EQU   RPHWORK+36
RPHSAVE9 EQU   RPHWORK+32
RPHSAVE8 EQU   RPHWORK+28
RPHSAVE7 EQU   RPHWORK+24
RPHSAVE6 EQU   RPHWORK+20
RPHSAVE5 EQU   RPHWORK+16
RPHSAVE4 EQU   RPHWORK+12
RPHSAVE3 EQU   RPHWORK+8
RPHSAVE2 EQU   RPHWORK+4
RPHSHALF EQU   RPHSAVE1+2
RPHSBIT8 EQU   RPHSBITS
RPHSBIT7 EQU   RPHSBITS
RPHSBIT6 EQU   RPHSBITS
RPHSBIT5 EQU   RPHSBITS
RPHSBIT4 EQU   RPHSBITS
RPHSBIT3 EQU   RPHSBITS
RPHSBIT2 EQU   RPHSBITS
RPHSBIT1 EQU   RPHSBITS
RPHSBYTE EQU   RPHSAVE1
RPHPABQP EQU   RPHPABQA+1
RPHPABFG EQU   RPHPABQA
RPHSRP34 EQU   RPHSRPRM+2
RPHSRP12 EQU   RPHSRPRM
RPHWEGT  EQU   RPHCSPA
RPHMAJCB EQU   ISTRPH+21
RPHPABOF EQU   ISTRPH+20
RPHRESUM EQU   RPHRESMA+1
RPHRSV01 EQU   RPHWPFLG
RPHPURGE EQU   RPHWPFLG
RPHPT    EQU   RPHWPFLG
RPHWT    EQU   RPHWPFLG
RPHRSKEY EQU   RPHWPFLG
RPHDVTA  EQU   ISTRPH+12
RPHTIK   EQU   RPHTSKID+3
@NM00030 EQU   RPHTSKID
RPHRPHAP EQU   RPHRPHA+1
@NM00029 EQU   RPHRPHA
RPHGATE  EQU   RPHRPHA
@NM00028 EQU   RPHFLGB
RPHRLCRA EQU   RPHFLGB
RPHNRSAV EQU   RPHFLGB
RPHPGCMP EQU   RPHFLGB
RPHFBAPS EQU   RPHFLGB
RPHBSSP  EQU   RPHFLGB
RPHLOCK  EQU   RPHFLGB
RPHFNFLG EQU   RPHFSTLC
RPHMLTCP EQU   RPHFLAGS
RPHSMCLR EQU   RPHFLAGS
RPHSMTYP EQU   RPHFLAGS
RPHSMQ   EQU   RPHFLAGS
RPHAUTEX EQU   RPHAPTYP
RPHSPGIN EQU   RPHFLAGS
RPHOGIND EQU   RPHFLAGS
RPHLNGTH EQU   RPHCNTL+1
RPHTYPE  EQU   RPHCNTL
ZCRRU    EQU   ZCRRHRU+3
ZCRRH    EQU   ZCRRHRU
ZCRWORDA EQU   ISTZCRR+477
ZCRCMNRC EQU   ISTZCRR+476
ZCRRSV97 EQU   ZCRENTER+18
ZCREIC2B EQU   ZCRENTER+18
ZCREAC2B EQU   ZCRENTER+18
ZCRELCAB EQU   ZCRENTER+18
ZCREDCMF EQU   ZCRENTER+18
ZCREBCIF EQU   ZCRENTER+18
ZCREICSG EQU   ZCRENTER+18
ZCREDCK0 EQU   ZCRENTER+18
ZCRECFY0 EQU   ZCRENTER+17
ZCREKCCB EQU   ZCRENTER+17
ZCREDCNB EQU   ZCRENTER+17
ZCREICOE EQU   ZCRENTER+17
ZCREBCNB EQU   ZCRENTER+17
ZCREBC0L EQU   ZCRENTER+17
ZCREBCAL EQU   ZCRENTER+17
ZCREDCQR EQU   ZCRENTER+17
ZCREDCPR EQU   ZCRENTER+16
ZCREBCSB EQU   ZCRENTER+16
ZCREAC1R EQU   ZCRENTER+16
ZCRECCCI EQU   ZCRENTER+16
ZCRECCAI EQU   ZCRENTER+16
ZCRECCBI EQU   ZCRENTER+16
ZCREBCAR EQU   ZCRENTER+16
ZCREBCDR EQU   ZCRENTER+16
ZCREBCBR EQU   ZCRENTER+15
ZCREDCXR EQU   ZCRENTER+15
ZCREDCWB EQU   ZCRENTER+15
ZCREDCWR EQU   ZCRENTER+15
ZCREKCCN EQU   ZCRENTER+15
ZCREKCBN EQU   ZCRENTER+15
ZCREKCBB EQU   ZCRENTER+15
ZCREJC0B EQU   ZCRENTER+15
ZCREJCDB EQU   ZCRENTER+14
ZCREJCCB EQU   ZCRENTER+14
ZCREJCBB EQU   ZCRENTER+14
ZCREJCAB EQU   ZCRENTER+14
ZCREIC1B EQU   ZCRENTER+14
ZCREIC0B EQU   ZCRENTER+14
ZCREICX0 EQU   ZCRENTER+14
ZCREICWB EQU   ZCRENTER+14
ZCREICVB EQU   ZCRENTER+13
ZCREICUB EQU   ZCRENTER+13
ZCREICTB EQU   ZCRENTER+13
ZCREICSC EQU   ZCRENTER+13
ZCREICSB EQU   ZCRENTER+13
ZCREICRB EQU   ZCRENTER+13
ZCREICQB EQU   ZCRENTER+13
ZCREICQA EQU   ZCRENTER+13
ZCREICOB EQU   ZCRENTER+12
ZCREICOA EQU   ZCRENTER+12
ZCREICNB EQU   ZCRENTER+12
ZCREICNA EQU   ZCRENTER+12
ZCREICMB EQU   ZCRENTER+12
ZCREICLB EQU   ZCRENTER+12
ZCREICKE EQU   ZCRENTER+12
ZCREICKB EQU   ZCRENTER+11
ZCREICJB EQU   ZCRENTER+11
ZCREICID EQU   ZCRENTER+11
ZCREICIB EQU   ZCRENTER+11
ZCREICHB EQU   ZCRENTER+11
ZCREICGB EQU   ZCRENTER+11
ZCREICEB EQU   ZCRENTER+11
ZCREICDB EQU   ZCRENTER+11
ZCREICCI EQU   ZCRENTER+10
ZCREICCB EQU   ZCRENTER+10
ZCREICBI EQU   ZCRENTER+10
ZCREICBB EQU   ZCRENTER+10
ZCREICAB EQU   ZCRENTER+10
ZCREICAA EQU   ZCRENTER+10
ZCREHCAN EQU   ZCRENTER+10
ZCREGC0B EQU   ZCRENTER+10
ZCREGC0A EQU   ZCRENTER+9
ZCREGCLA EQU   ZCRENTER+9
ZCREGCEB EQU   ZCRENTER+9
ZCREGCDB EQU   ZCRENTER+9
@NM00027 EQU   ZCRENTER+9
ZCREGCBB EQU   ZCRENTER+9
ZCREGCAB EQU   ZCRENTER+9
ZCREFCEB EQU   ZCRENTER+9
ZCREFCEA EQU   ZCRENTER+8
ZCREECTA EQU   ZCRENTER+8
ZCREECEA EQU   ZCRENTER+8
ZCREECDA EQU   ZCRENTER+8
ZCREECCB EQU   ZCRENTER+8
ZCREECCA EQU   ZCRENTER+8
ZCREECBB EQU   ZCRENTER+8
ZCREECBA EQU   ZCRENTER+8
ZCREDCMB EQU   ZCRENTER+7
ZCREDCL0 EQU   ZCRENTER+7
ZCREDCKB EQU   ZCRENTER+7
ZCREDCKA EQU   ZCRENTER+7
ZCREDCJ0 EQU   ZCRENTER+7
ZCREDCI0 EQU   ZCRENTER+7
ZCREDCH0 EQU   ZCRENTER+7
ZCREDCF0 EQU   ZCRENTER+7
ZCREDCE0 EQU   ZCRENTER+6
ZCREDCD0 EQU   ZCRENTER+6
ZCREDCC0 EQU   ZCRENTER+6
ZCREDCB0 EQU   ZCRENTER+6
ZCREDCA0 EQU   ZCRENTER+6
ZCRECC2B EQU   ZCRENTER+6
ZCRECC1B EQU   ZCRENTER+6
ZCRECC1A EQU   ZCRENTER+6
ZCRECC0B EQU   ZCRENTER+5
ZCRECC0A EQU   ZCRENTER+5
ZCREBC0B EQU   ZCRENTER+5
ZCREBC0A EQU   ZCRENTER+5
ZCREBCZ0 EQU   ZCRENTER+5
ZCREBCY0 EQU   ZCRENTER+5
ZCREBCX0 EQU   ZCRENTER+5
ZCREBCXA EQU   ZCRENTER+5
ZCREBCSC EQU   ZCRENTER+4
ZCREBCRB EQU   ZCRENTER+4
ZCREBCRA EQU   ZCRENTER+4
ZCREBCQB EQU   ZCRENTER+4
ZCREBCPB EQU   ZCRENTER+4
ZCREBCOB EQU   ZCRENTER+4
ZCREBCNE EQU   ZCRENTER+4
ZCREBCND EQU   ZCRENTER+4
ZCREBCMB EQU   ZCRENTER+3
ZCREBCLB EQU   ZCRENTER+3
ZCREBCLA EQU   ZCRENTER+3
ZCREBCKB EQU   ZCRENTER+3
ZCREBCKA EQU   ZCRENTER+3
ZCREBCJB EQU   ZCRENTER+3
ZCREBCJA EQU   ZCRENTER+3
ZCREBCID EQU   ZCRENTER+3
ZCREBCIB EQU   ZCRENTER+2
ZCREBCIA EQU   ZCRENTER+2
ZCREBCHB EQU   ZCRENTER+2
ZCREBCHA EQU   ZCRENTER+2
ZCREBCGB EQU   ZCRENTER+2
ZCREBCGA EQU   ZCRENTER+2
ZCREBCFB EQU   ZCRENTER+2
ZCREBCFA EQU   ZCRENTER+2
ZCREBCEB EQU   ZCRENTER+1
ZCREBCDI EQU   ZCRENTER+1
ZCREBCCB EQU   ZCRENTER+1
ZCREBCBI EQU   ZCRENTER+1
ZCREBCBB EQU   ZCRENTER+1
ZCREBCBA EQU   ZCRENTER+1
ZCREBCAM EQU   ZCRENTER+1
ZCREBCAI EQU   ZCRENTER+1
ZCREBCAG EQU   ZCRENTER
ZCREBCAE EQU   ZCRENTER
ZCREBCAB EQU   ZCRENTER
ZCREBCAA EQU   ZCRENTER
ZCREAC1B EQU   ZCRENTER
ZCREAC0B EQU   ZCRENTER
ZCREAC0A EQU   ZCRENTER
ZCREAC1A EQU   ZCRENTER
ZCRTNAME EQU   ZCRAUDIT+1
ZCRTID   EQU   ZCRAUDIT
ZCRREMIC EQU   ISTZCRR+436
ZCRSAVEZ EQU   ISTZCRR+196
ZCRDAFSV EQU   ZCRCIDSV+2
ZCRSAFSV EQU   ZCRCIDSV
ZCROPCDE EQU   ISTZCRR+183
ZCRPRMTC EQU   ISTZCRR+182
ZCRRCDSV EQU   ISTZCRR+181
ZCRAWQSW EQU   ISTZCRR+180
ZCRTOPQ  EQU   ISTZCRR+180
ZCRLSTFB EQU   ISTZCRR+180
ZCRXSCHD EQU   ISTZCRR+180
ZCRNXTEL EQU   ISTZCRR+180
ZCRSCANQ EQU   ISTZCRR+180
ZCRMOREL EQU   ISTZCRR+180
ZCRFBPRC EQU   ISTZCRR+180
ZCRFSBSV EQU   ISTZCRR+176
ZCRSVWK5 EQU   ZCRWKARA+16
ZCRSVWK4 EQU   ZCRWKARA+12
ZCRSVWK3 EQU   ZCRWKARA+8
ZCRSVWK2 EQU   ZCRWKARA+4
ZCRSVWK1 EQU   ZCRWKARA
ZCRSVF25 EQU   ZCRSVRTN+96
ZCRSVF24 EQU   ZCRSVRTN+92
ZCRSVF23 EQU   ZCRSVRTN+88
ZCRSVF22 EQU   ZCRSVRTN+84
ZCRSVF21 EQU   ZCRSVRTN+80
ZCRSVF19 EQU   ZCRSVRTN+72
ZCRSVF18 EQU   ZCRSVRTN+68
ZCRSVF17 EQU   ZCRSVRTN+64
ZCRSVF16 EQU   ZCRSVRTN+60
ZCRSVF15 EQU   ZCRSVRTN+56
ZCRSVF14 EQU   ZCRSVRTN+52
ZCRSVF13 EQU   ZCRSVRTN+48
ZCRSVF12 EQU   ZCRSVRTN+44
ZCRSVF9  EQU   ZCRSVRTN+32
ZCRSVF8  EQU   ZCRSVRTN+28
ZCRSVF7  EQU   ZCRSVRTN+24
ZCRSVF6  EQU   ZCRSVRTN+20
ZCRSVF5  EQU   ZCRSVRTN+16
ZCRSVF4  EQU   ZCRSVRTN+12
ZCRSVF3  EQU   ZCRSVRTN+8
ZCRSVF2  EQU   ZCRSVRTN+4
ZCRSVF1  EQU   ZCRSVRTN
ZCRPVZB  EQU   ISTZCRR+52
ZCRZLB   EQU   ISTZCRR+48
ZCRBFPTR EQU   ISTZCRR+44
ZCRCCWA  EQU   ISTZCRR+40
ZCRPSW   EQU   ZCRPARMS+15
ZCRPCHAR EQU   ZCRPARMS+14
ZCRPRES2 EQU   ZCRPCOD2
ZCRPMFGF EQU   ZCRPCOD2
ZCRPFHDR EQU   ZCRPCOD2
ZCRPPG2  EQU   ZCRPCOD2
ZCRPRES  EQU   ZCRPCOD1
ZCRPCFTX EQU   ZCRPCOD1
ZCRPLSCB EQU   ZCRPCOD1
ZCRPLSBQ EQU   ZCRPLSBF
ZCRPLNG  EQU   ZCRPCOD1
ZCRPPG   EQU   ZCRPCOD1
ZCRDTODA EQU   ZCRDFRDA
ZCRMLNG  EQU   ZCRPARMS+8
ZCRTBPTR EQU   ZCRPARMS+4
ZCRCBPTR EQU   ZCRFBPTR
ZCRCRLCP EQU   ISTZCRR+20
ZCRMDATA EQU   ZCRSCPSW
ZCRSKIPT EQU   ZCRSCPSW
ZCRFSBWE EQU   ZCRSCPSW
ZCRPRCMP EQU   ZCRSCPSW
ZCRLREQ  EQU   ZCRSCPSW
ZCRRJLCP EQU   ZCRSCPSW
ZCRTPINV EQU   ZCRSCPSW
ZCRTPEX  EQU   ZCRSCPSW
@NM00026 EQU   ZCRIBPR
ZCR3270R EQU   ZCRIBPR
ZCR3270  EQU   ZCRIBPR
ZCRLCPFD EQU   ZCRIBPR
ZCRLCPFR EQU   ZCRIBPR
ZCRRELK  EQU   ZCRIBPR
ZCRERR   EQU   ZCRIBPR
ZCRNOBUF EQU   ZCRIBPR
@NM00025 EQU   ZCRPFLGS
ZCRQAHED EQU   ZCRPFLGS
ZCRF1RES EQU   ZCRGENSW
ZCRBRIS  EQU   ZCRGENSW
ZCRCLRBD EQU   ZCRGENSW
ZCREXRES EQU   ZCRGENSW
ZCRLCSYN EQU   ZCRGENSW
ZCRRT06  EQU   ZCRGENSW
ZCRTSW2  EQU   ZCRGENSW
ZCRTSW1  EQU   ZCRGENSW
ZCRINLCP EQU   ZCRFLGS3
ZCRWRPTR EQU   ZCRFLGS3
ZCRNOFRE EQU   ZCRFLGS3
ZCREDRIV EQU   ZCRFLGS3
ZCRDISC  EQU   ZCRFLGS3
ZCRTPDIS EQU   ZCRFLGS3
ZCRTPCON EQU   ZCRFLGS3
ZCRTIC   EQU   ZCRFLGS3
ZCRCNLXL EQU   ZCRRESET
ZCRENDAN EQU   ZCRSWFLD
ZCRENDXL EQU   ZCRSWFLD
ZCRENDX  EQU   ZCRSWFLD
ZCROB1   EQU   ZCRNDLCP
ZCRENDPR EQU   ZCRSWFLD
ZCREXTYP EQU   ZCRSWFLD
ZCRSLCP  EQU   ZCRENDSH
ZCROB    EQU   ZCRFLGS2
ZCRFMSED EQU   ZCRFLGS2
ZCRSHEDI EQU   ZCRFLGS2
ZCRLOCAL EQU   ZCRFLGS2
ZCRFEXIT EQU   ZCRFLGS1
ZCRUNSOL EQU   ZCRFLGS1
ZCRENDLP EQU   ZCRFLGS1
ZCRNRMEX EQU   ZCRFLGS1
ZCRWAIT  EQU   ZCRFLGS1
ZCRDEQSW EQU   ZCRFLGS1
ZCRQUESW EQU   ZCRFLGS1
ZCREXSW  EQU   ZCRFLGS1
ZCRFRRA  EQU   ISTZCRR+8
ZCRCHAIN EQU   ISTZCRR+4
ZCRFLAG  EQU   ZCRCRR+3
ZCRLEN   EQU   ZCRCRR+1
ZCRID    EQU   ZCRCRR
LCPFTYPE EQU   LCPRPHA
LCPRSTQH EQU   LCPLCCW
LCPCLREP EQU   ISTLCPB+44
LCPUBFSB EQU   LCPFLCCW
LCPRSV77 EQU   ISTLCPB+39
LCPLCCWC EQU   ISTLCPB+38
LCPRSV78 EQU   LCPFLG1
LCPTRANS EQU   LCPFLG1
LCPSTLB  EQU   LCPFLG1
LCPREDRV EQU   LCPFLG1
LCPDIRPT EQU   LCPFLG1
LCPINTER EQU   LCPFLG1
LCPRESET EQU   LCPFLG1
LCPSTYPE EQU   ISTLCPB+36
LCPFSNCH EQU   ISTLCPB+34
LCPFOSN  EQU   ISTLCPB+32
LCPTLBAD EQU   ISTLCPB+28
LCPFDB2  EQU   LCPFDBA+1
LCPFDB1  EQU   LCPFDBA
LCPDAF   EQU   LCPCID+2
LCPSAF   EQU   LCPCID
LCPLCCW1 EQU   ISTLCPB+12
LCPRRCNT EQU   LCPSEQ+1
LCPRRCCT EQU   LCPSEQ
LCPATOP  EQU   LCPFLAG2
LCPFREE  EQU   LCPFLAG2
LCPDSTAT EQU   LCPFLAG2
LCPEXRES EQU   LCPFID0
LCPZRIMM EQU   LCPTLBPI
LCPRSTRT EQU   LCPFLAG2
LCPASYN  EQU   LCPFLAG2
LCPPRFLG EQU   LCPFLAG2
LCPZMIRC EQU   LCPRUCNT
LCPCHAI2 EQU   LCPCHAIN+1
LCPCHNG  EQU   LCPCHAI1
LCPZRT0B EQU   LCPMNRCD
LCPZRT0A EQU   LCPMNRCD
LCPZRTL9 EQU   LCPZRT09
LCPZRTL8 EQU   LCPZRT08
LCPZRTL7 EQU   LCPZRT07
LCPZRTL6 EQU   LCPZRT06
LCPZRTL5 EQU   LCPZRT05
LCPZRTL4 EQU   LCPZRT04
LCPZRTL3 EQU   LCPZRT03
LCPZRTL2 EQU   LCPZRT02
LCPZRT01 EQU   LCPFLAGS
LCPZRT00 EQU   LCPFLAGS
LCPLNGTH EQU   ISTLCPB+1
LCPTYPE  EQU   ISTLCPB
LCCWDATA EQU   ISTLCCW+4
LCCWCNT  EQU   ISTLCCW+2
LCCWACI  EQU   LCCWFLAG
LCCWRFI  EQU   LCCWFLAG
LCCWPER  EQU   LCCWLSI
LCCWIDAT EQU   LCCWFLAG
LCCWNTVC EQU   LCCWFLAG
LCCWCKPT EQU   LCCWFLAG
LCCWCC   EQU   LCCWFLAG
LCCWCD   EQU   LCCWFLAG
LCCWTYPE EQU   LCCWCTL
LCCWMODE EQU   LCCWCTL
LCCWSOP  EQU   LCCWRWOP
@NM00024 EQU   LCCWRWOP
LCCWSD   EQU   LCCWOP
LCCWSI   EQU   LCCWOP
DNCLOCK  EQU   DNCOS+36
DNCZV005 EQU   DNCOS+32
DNCZV003 EQU   DNCOS+24
DNCZV002 EQU   DNCOS+21
DNCZX001 EQU   DNCOS+20
DNCZX003 EQU   DNCOS+16
DNCZV000 EQU   DNCOS+12
DNCSESCQ EQU   DNCOS+8
DNCSESIQ EQU   DNCOS+4
DNCLICP  EQU   DNCBSCED
DNCPSOL  EQU   DNCZFLGS+1
DNCZF007 EQU   DNCZFLGS+1
DNCZF006 EQU   DNCZFLGS+1
DNCZF005 EQU   DNCZFLGS+1
DNCZF004 EQU   DNCZFLGS+1
DNCZF003 EQU   DNCZFLGS
DNCZF002 EQU   DNCZFLGS
DNCDISC  EQU   DNCZFLGS
DNCCONT  EQU   DNCZFLGS
DNCMODE  EQU   ISTDNCB+49
DNCBHSET EQU   ISTDNCB+48
NCBRSV01 EQU   ISTNCB+46
NCBSWDAF EQU   ISTNCB+44
NCBDEVCH EQU   ISTNCB+36
NCBFMCBP EQU   ISTNCB+32
NCBLTRC  EQU   ISTNCB+30
NCBRVPT1 EQU   ISTNCB+28
NCBNMLLN EQU   NCBFLAGS+3
@NM00023 EQU   NCBFLAG1
NCBFORCE EQU   NCBFLAG1
NCBTTF   EQU   NCBFLAG1
NCBRSYNC EQU   NCBFLAG1
NCBRSTRT EQU   NCBFLAG1
NCBCONF  EQU   NCBFLAG1
NCBSNAI  EQU   NCBFLAG1
NCBFLTIO EQU   NCBFTRIO
NCBCSTAT EQU   NCBFLAGS
NCBNCSL  EQU   ISTNCB+22
NCBNCBA  EQU   ISTNCB+20
NCBFMCBA EQU   ISTNCB+16
NCBNSNA  EQU   ISTNCB+12
NCBDAF   EQU   ISTNCB+2
NCBLNGTH EQU   ISTNCB+1
NCBTYPE  EQU   ISTNCB
FMCFLRSV EQU   FMCFLGB
FMCFLGA8 EQU   FMCFLGB
FMCCLRPH EQU   FMCVS1+45
FMCRSV0X EQU   FMCCVFLG
FMCVYRPH EQU   FMCCVFLG
FMCZV004 EQU   FMCVS1+40
FMCLOCK2 EQU   FMCVS1+36
@NM00022 EQU   FMCZFLG2
FMCZF027 EQU   FMCZFLG2
FMCZF026 EQU   FMCZFLG2
FMCSEQ1B EQU   FMCSEQ1
FMCSEQ1T EQU   FMCSEQ1
FMCZX006 EQU   FMCVS1+33
FMCZX005 EQU   FMCVS1+32
FMCZX004 EQU   FMCVS1+31
FMCZX003 EQU   FMCVS1+30
FMCZX002 EQU   FMCVS1+29
FMCZX001 EQU   FMCVS1+28
FMCZV001 EQU   FMCVS1+24
FMCAWATQ EQU   FMCLCPAQ+1
@NM00021 EQU   FMCLCPAQ
FMCLCPB2 EQU   FMCLCPBQ+1
FMCLCPB1 EQU   FMCLCPBQ
FMCASCDQ EQU   FMCSHEAQ+1
@NM00020 EQU   FMCSHEAQ
FMCSHEDQ EQU   FMCVS1+8
FMCZFCSQ EQU   FMCVS1+6
FMCZF025 EQU   FMCZFLAG+3
FMCZF024 EQU   FMCZFLAG+3
FMCZF023 EQU   FMCZFLAG+3
FMCZF022 EQU   FMCZFLAG+3
FMCZF021 EQU   FMCZFLAG+3
FMCZF020 EQU   FMCZFLAG+3
FMCZF019 EQU   FMCZFLAG+3
FMCZF018 EQU   FMCZFLAG+3
FMCZF017 EQU   FMCZFLAG+2
FMCZF016 EQU   FMCZFLAG+2
FMCZF015 EQU   FMCZFLAG+2
FMCZF014 EQU   FMCZFLAG+2
FMCZF013 EQU   FMCZFLAG+2
FMCZF012 EQU   FMCZFLAG+2
FMCZF011 EQU   FMCZFLAG+2
FMCZF010 EQU   FMCZFLAG+2
FMCZF00F EQU   FMCZFLAG+1
FMCZF00E EQU   FMCZFLAG+1
FMCZF00D EQU   FMCZFLAG+1
FMCZF00C EQU   FMCZFLAG+1
FMCZF00B EQU   FMCZFLAG+1
FMCRSV10 EQU   FMCZFLAG+1
FMCZF009 EQU   FMCZFLAG+1
FMCZFD06 EQU   FMCZF006+1
FMCZFC06 EQU   FMCZF006
FMCZF005 EQU   FMCZFLAG
FMCZF004 EQU   FMCZFLAG
FMCZF003 EQU   FMCZFLAG
FMCZF001 EQU   FMCZFLAG
FMCFRESA EQU   ISTFMCB+228
FMCSCSQN EQU   FMCSNCTL+2
FMCSCCTL EQU   FMCSNCTL+1
FMCSTCTL EQU   FMCSCFLG
FMCSCCLO EQU   FMCSCFLG
FMCAPRO  EQU   FMCSCFLG
FMCLURO  EQU   FMCSCFLG
FMCOBSAC EQU   FMCSCFLG
FMCIBSAC EQU   FMCSCFLG
FMCFBRE  EQU   ISTFMCB+220
FMCFBXM  EQU   FMCZV002
FMCASEGQ EQU   ISTFMCB+212
FMCRDTPT EQU   ISTFMCB+208
FMCLOCK  EQU   ISTFMCB+204
FMCSEGD  EQU   FMCSSEGQ
FMCRSPLM EQU   ISTFMCB+198
FMCPSTRS EQU   ISTFMCB+196
@NM00019 EQU   FMCRRESP
FMCTSLHA EQU   FMCRRESP
FMCFRRN  EQU   FMCRRESP
FMCFME   EQU   FMCRRESP
FMCFEX   EQU   FMCRRESP
FMCFPE   EQU   FMCRRESP
FMCCTLB  EQU   ISTFMCB+194
FMCBSQNO EQU   FMCCLSEQ+2
FMCTSQNO EQU   FMCCLSEQ
FMCOBPRG EQU   FMCMODEB
FMCIBPRG EQU   FMCMODEB
FMCRESOT EQU   FMCMODEB
FMCRSTSR EQU   FMCMODEB
FMCLUQ   EQU   FMCMODEB
FMCAPQ   EQU   FMCMODEB
FMCCLEAR EQU   FMCMODEB
FMCHOLD  EQU   FMCMODEB
FMCIPSEQ EQU   ISTFMCB+188
FMCLUSTR EQU   ISTFMCB+187
FMCRSV87 EQU   FMCSTAT2
FMCSEQI  EQU   FMCSTAT2
FMCCPIP  EQU   FMCSTAT2
FMCALIPR EQU   FMCSTAT2
FMCIAIO  EQU   FMCSTAT2
FMCZF00A EQU   FMCSTAT2
FMCVPIP  EQU   FMCSTAT2
FMCBHSET EQU   ISTFMCB+185
FMCPRMRC EQU   FMCCLEXT+20
FMCRSV89 EQU   FMCPSTAT
FMCPCLSD EQU   FMCPSTAT
FMCDDOCD EQU   FMCPSTAT
FMCIDVFD EQU   FMCPSTAT
FMCELKST EQU   FMCPSTAT
FMCRSV88 EQU   FMCPSCMD
FMCRDBLK EQU   FMCPSCMD
FMCDSEOC EQU   FMCPSCMD
FMCPURGE EQU   FMCPSCMD
FMCRESTI EQU   FMCPSCMD
FMCCNTCT EQU   FMCPSCMD
FMCINVT  EQU   FMCPSCMD
FMCFLGB7 EQU   FMCFLGCL
FMCFLGB6 EQU   FMCFLGCL
FMCFLGB5 EQU   FMCFLGCL
FMCFLGB4 EQU   FMCFLGCL
FMCFLGB3 EQU   FMCFLGCL
FMCFLGB2 EQU   FMCFLGCL
FMCFLGB1 EQU   FMCFLGCL
FMCFLGB0 EQU   FMCFLGCL
FMCFLGA7 EQU   FMCFLGA
FMCFLGA6 EQU   FMCFLGA
FMCFLGA5 EQU   FMCFLGA
FMCFLGA4 EQU   FMCFLGA
FMCFLGA3 EQU   FMCFLGA
FMCFLGA2 EQU   FMCFLGA
FMCFLGA1 EQU   FMCFLGA
FMCFLGA0 EQU   FMCFLGA
FMCDCLOK EQU   FMCCLEXT+12
FMCRAFM  EQU   FMCCLEXT+8
FMCFBPTR EQU   FMCFBA+1
FMCFBRSV EQU   FMCFBA
FMCRPLPT EQU   FMCRPLA+1
FMCRPLRS EQU   FMCRPLA
FMCPRCLS EQU   FMCCVAL
FMCIBCE  EQU   FMCCVAL
FMCONLY  EQU   FMCOBCE
FMCLAST  EQU   FMCOBCE
FMCMIDLE EQU   FMCOBCE
FMCFIRST EQU   FMCOBCE
FMCCPCNT EQU   FMCPACPC
FMCMPCNT EQU   FMCPACEM
FMCNPCNT EQU   FMCPACEN
FMCCONF  EQU   FMCSSTAT
FMCPURCH EQU   FMCSSTAT
FMCNSALU EQU   FMCSSTAT
FMCBIP   EQU   FMCSSTAT
FMCSDTR  EQU   FMCSSTAT
FMCUIPI  EQU   FMCSSTAT
FMCCIPI  EQU   FMCSSTAT
FMCSNBI  EQU   FMCSSTAT
FMCRVD01 EQU   ISTFMCB+158
FMCISSN  EQU   ISTFMCB+156
FMCOASN  EQU   FMCNXOSC
FMCOSSN  EQU   FMCNXCFM
FMCSIP   EQU   FMCSIPA
FMCEXLST EQU   ISTFMCB+144
FMCPAB5  EQU   ISTFMCB+128
FMCPAB1  EQU   ISTFMCB+64
FMCFASYA EQU   ISTFMCB+60
FMCMODE  EQU   ISTFMCB+52
FMCPROCD EQU   ISTFMCB+48
FMCVWT   EQU   ISTFMCB+44
FMCRPLH  EQU   ISTFMCB+40
FMCBUFNB EQU   FMCCMPS1+2
FMCBUFLM EQU   FMCCMPS1
FMCDEBA  EQU   ISTFMCB+32
@NM00018 EQU   FMCCMDFL
FMCSNA   EQU   FMCCMDFL
FMCVSNA  EQU   FMCCMDFL
FMCCMDR  EQU   FMCCMDFL
@NM00017 EQU   ISTFMCB+30
@NM00016 EQU   FMCSTAT1
FMCLTCLS EQU   FMCSTAT1
FMCHPURG EQU   FMCSTAT1
FMCVSP2  EQU   FMCSTAT1
FMCVSP1  EQU   FMCSTAT
FMCLTEAS EQU   FMCSTAT
FMCZF007 EQU   FMCSTAT
FMCDEDSC EQU   FMCSTAT
FMCDEVOF EQU   FMCSTAT
FMCDAPT  EQU   FMCSTAT
FMCPRMTE EQU   FMCSTAT
FMCPRMTR EQU   FMCSTAT
FMCUSFLD EQU   ISTFMCB+24
FMCFMCBA EQU   ISTFMCB+20
FMCDNCBA EQU   ISTFMCB+16
FMCDVTA  EQU   ISTFMCB+12
FMCNXTCB EQU   ISTFMCB+4
FMCLNGTH EQU   ISTFMCB+1
FMCTYPE  EQU   ISTFMCB
PROSRDEF EQU   PROSETM4
PRORSV47 EQU   PROSETM4
PROSCON  EQU   PROSETM4
PRORSV46 EQU   PROSETM3
PROSMONT EQU   PROSETM3
PRORSV45 EQU   PROSETM3
PROSNTO  EQU   PROSETM3
PRORSV44 EQU   PROSETM3
PROCPUID EQU   PROSETM3
PRORSV43 EQU   PROSETM2
PROSNTFL EQU   PROSETM2
PRORSV42 EQU   PROSETM2
PRORSV41 EQU   PROPROCS
PROMODC  EQU   PROPROC4
PROMODT  EQU   PROPROC4
PROMODM  EQU   PROPROC4
PROMODB  EQU   PROPROC4
PRORSV14 EQU   PROPROC4
PRORSV13 EQU   PROPROC4
PRORSV12 EQU   PROPROC4
PROEIB   EQU   PROPROC4
PROMONT3 EQU   PROPROC3
PROMONT2 EQU   PROPROC3
PROMONIT EQU   PROPROC3
PROSUBLK EQU   PROPROC3
PRONTO   EQU   PROPROC3
PROLGIN  EQU   PROPROC3
PROERPI  EQU   PROPROC3
PRORSV07 EQU   PROPROC3
PROCFTX  EQU   PROPROC2
PROEMLC  EQU   PROPROC2
PRONTFL  EQU   PROPROC2
PRORSV05 EQU   PROPROC2
PRORSV04 EQU   PROPROC2
PROLGOT  EQU   PROPROC2
PROERPO  EQU   PROPROC2
PRORSV03 EQU   PROPROC2
PRORPLC  EQU   PROPROC1
PROCS    EQU   PROPROC1
PROCA    EQU   PROPROC1
PRORESPX EQU   PROPROC1
PRODFASY EQU   PROPROC1
PROXPOPT EQU   PROPROC1
PROTRUNC EQU   PROPROC1
PROASYIP EQU   PROPROC1
DEVRSV03 EQU   ISTDEVCH+5
DEVPHYSA EQU   ISTDEVCH+4
DEVCSLPN EQU   DEVCHAR3
DEVCSTCL EQU   DEVCHAR3
DEVCCHEK EQU   DEVCHAR3
DEVCATTN EQU   DEVCHAR3
DEVCSWL  EQU   DEVFCCTL
DEVCRVB  EQU   DEVFCCTL
DEVCSSL  EQU   DEVFCCTL
DEVCBSC  EQU   DEVFCCTL
DEVMCODE EQU   ISTDEVCH+2
DEVCHAR2 EQU   DEVTCODE
DEVRSV01 EQU   DEVCHAR
DEVCCTL  EQU   DEVCHAR
DEVNNSPT EQU   DEVCHAR
DEVSPS   EQU   DEVCHAR
DEVSUBND EQU   DEVCHAR
DEVCONVR EQU   DEVCHAR
DEVOTPUT EQU   DEVCHAR
DEVINPUT EQU   DEVCHAR
PABRPHA  EQU   PABRPHFG+1
PABNODQ  EQU   PABFLAGS
PABINHBT EQU   PABFLAGS
PABSSN   EQU   PABFLAGS
PABDYNAM EQU   PABFLAGS
PABNORPR EQU   PABFLAGS
PABPRIOR EQU   PABFLAGS
PABAPYP  EQU   PABFLAGS
PABOFFST EQU   ISTPAB+8
PABCHNGP EQU   PABCHAIN+1
PABRSV02 EQU   PABCHAIN
PABDELAY EQU   PABCHAIN
PABRUNNG EQU   PABCHAIN
PABRESET EQU   PABCHAIN
PABUNCON EQU   PABCHAIN
PABCDP   EQU   PABCHAIN
PABRESCH EQU   PABCHAIN
PABCHNG  EQU   PABCHAIN
PABWEQP  EQU   PABWEQA+1
PABRSV01 EQU   PABWEQA
PABWEQG  EQU   PABWEQA
LOKXCL   EQU   @NM00014
LOKPRY   EQU   @NM00014
@NM00015 EQU   @NM00014
@NM00013 EQU   LOKCHNG
LOKCT    EQU   ISTLOK
ZIBLNG1  EQU   ZIBFSM
ZIBCHAIN EQU   ISTZIBUF
FSBFDB   EQU   ISTFSB+32
FSBRSV01 EQU   FSBFSB+30
FSBTHCNT EQU   FSBFSB+28
FSBRLRSV EQU   FSBRLSTS
FSBCFTX  EQU   FSBRLSTS
FSBICNCB EQU   FSBMSGID
FSBSSOC  EQU   FSBSS2
FSBSSCC  EQU   FSBSS2
FSBSSDC  EQU   FSBSS2
FSBSSEC  EQU   FSBSS2
FSBSSIR  EQU   FSBSS2
FSBSSCR  EQU   FSBSS2
@NM00006 EQU   FSBSS2
@NM00005 EQU   FSBSS1
FSBSSDE  EQU   FSBSS1
FSBSSUS  EQU   FSBSS1
@NM00004 EQU   FSBSS1
FSBSOHI  EQU   FSBERC
FSBLGI   EQU   FSBERC
FSBLMRI  EQU   FSBFBMI
FSBETI   EQU   FSBERC
FSBEMI   EQU   FSBERC
FSBEBI   EQU   FSBERC
FSBXLCI  EQU   FSBXCODE
FSBXNORM EQU   FSBXFSTS
FSBSCODE EQU   FSBSYSRS
FSBSPHSE EQU   FSBSYSRS
FSBSERR  EQU   FSBSYSRS
FSBCMD   EQU   FSBSEQ
FSBDTRCE EQU   FSBFLAGS
FSBASBTU EQU   FSBFLAGS
FSBINPET EQU   FSBFLAGS
FSBNONCB EQU   FSBFLAGS
FSBLBIND EQU   FSBFLAGS
FSBFFIND EQU   FSBFLAGS
FSBACIND EQU   FSBFLAGS
FSBRFIND EQU   FSBFLAGS
FSBGATE  EQU   FSBFSBA
FSBLATOP EQU   FSBSFLGS
FSBRSV02 EQU   FSBSFLGS
FSBPGBUF EQU   FSBSFLGS
FSBMNSDA EQU   FSBMNRCD
FSBMNOA  EQU   FSBMNRCD
FSBMNDIF EQU   FSBMNRCD
FSBMNEOP EQU   FSBMNRCD
FSBMNDNU EQU   FSBMNRCD
FSBMNATN EQU   FSBMNRCD
FSBMNRVI EQU   FSBMNRCD
FSBLNGTH EQU   FSBFSB+1
FSBTYPE  EQU   FSBFSB
BTUEXTR  EQU   ISTBTU+19
BTURSV02 EQU   BTUSYSTR
BTUPHASE EQU   BTUSYSTR
BTURSV01 EQU   BTUSYSTR
BTUPAD   EQU   BTURH+3
BTURH3   EQU   BTURH+2
BTURH2   EQU   BTURH+1
BTURH1   EQU   BTURH
BTUZRTSC EQU   BTURQFLG+1
BTUZRT0B EQU   BTURQFLG+1
BTUZRT0A EQU   BTURQFLG+1
BTUZRT09 EQU   BTURQFLG+1
BTUZRT08 EQU   BTURQFLG+1
BTUZRT07 EQU   BTURQFLG
BTUZRT06 EQU   BTURQFLG
BTUZRT05 EQU   BTURQFLG
BTUZRT04 EQU   BTURQFLG
BTUZRT03 EQU   BTURQFLG
BTUZRT02 EQU   BTURQFLG
BTUZRT01 EQU   BTURQFLG
BTUZRT00 EQU   BTURQFLG
BTUSORCE EQU   BTUBTH+4
BTUCDF   EQU   BTUFID+1
BTUSCF   EQU   BTUFID+1
BTUPRY   EQU   BTUFID+1
BTUASFL  EQU   BTUFID
BTUPSFL  EQU   BTUFID
BTUMPF   EQU   BTUFID
BTUFIDNO EQU   BTUFID
TH2SNF   EQU   ISTTH2+4
TH2OAF   EQU   ISTTH2+3
TH2DAF   EQU   ISTTH2+2
TH2CDF   EQU   TH2FLAG1+1
TH2SEF   EQU   TH2FLAG1+1
TH2PYF   EQU   TH2FLAG1+1
TH2AFI   EQU   TH2FLAG1
TH2PSI   EQU   TH2FLAG1
TH2CMPLI EQU   TH2MPF
TH2RHI   EQU   TH2MPF
TH2FID   EQU   TH2FLAG1
THDCF    EQU   ISTTH+8
THSNF    EQU   ISTTH+6
THOAF    EQU   ISTTH+4
THDAF    EQU   ISTTH+2
THCDF    EQU   THFLGB
THSEF    EQU   THFLGB
THPYF    EQU   THFLGB
THAFI    EQU   THFLGA
THPSI    EQU   THFLGA
THCMPLI  EQU   THMPF
THRHI    EQU   THMPF
THFID    EQU   THFLAG1
LHVDATA  EQU   ISTLH+4
LHFUNCT  EQU   ISTLH+3
@NM00003 EQU   ISTLH+2
LHLEN    EQU   ISTLH
FDBDATCT EQU   ISTFDB+8
FDBDATAA EQU   ISTFDB+4
BDURSV04 EQU   BDUFLAGS
BDURTOE  EQU   BDUFLAGS
BDUSTPR  EQU   BDUFLAGS
BDURSV03 EQU   BDUFLAGS
BDUALT   EQU   BDUFUNC
BDUNACK  EQU   BDUFUNC
BDUACK   EQU   BDUFUNC
BDUTRPM  EQU   BDUFUNC
BDUFBMI  EQU   BDUFUNC
BDULDGPH EQU   BDUFUNC
BDUHEADP EQU   BDUFUNC
BDUSOH   EQU   BDUCHECK
BDURSV01 EQU   BDUMODIF
BDUMOD0  EQU   BDUMOD1
BDUCOMND EQU   ISTBDU
CVTLEVL  EQU   CVTRELNO+2
CVTNUMB  EQU   CVTRELNO
CVTMDL   EQU   CVTFIX+250
@NM00002 EQU   CVTFIX+248
@NM00001 EQU   CVTFIX
CVTRV482 EQU   CVTXTNT2+128
CVTRV481 EQU   CVTXTNT2+124
CVTRV480 EQU   CVTXTNT2+120
CVTRV479 EQU   CVTXTNT2+118
CVTRV478 EQU   CVTXTNT2+117
CVTRV477 EQU   CVTXTNT2+116
CVTRV476 EQU   CVTXTNT2+115
CVTRV475 EQU   CVTXTNT2+114
CVTRV474 EQU   CVTRV466
CVTRV473 EQU   CVTRV466
CVTRV472 EQU   CVTRV466
CVTRV471 EQU   CVTRV466
CVTRV470 EQU   CVTRV466
CVTRV469 EQU   CVTRV466
CVTRV468 EQU   CVTRV466
CVTRV467 EQU   CVTRV466
CVTRV465 EQU   CVTRV457
CVTRV464 EQU   CVTRV457
CVTRV463 EQU   CVTRV457
CVTRV462 EQU   CVTRV457
CVTRV461 EQU   CVTRV457
CVTRV460 EQU   CVTRV457
CVTRV459 EQU   CVTRV457
CVTRV458 EQU   CVTRV457
CVTRV456 EQU   CVTXTNT2+108
CVTRV455 EQU   CVTXTNT2+104
CVTRV454 EQU   CVTXTNT2+100
CVTRV453 EQU   CVTXTNT2+96
CVTRV452 EQU   CVTXTNT2+94
CVTRV451 EQU   CVTXTNT2+92
CVTRV450 EQU   CVTXTNT2+90
CVTRV449 EQU   CVTXTNT2+88
CVTRV448 EQU   CVTXTNT2+87
CVTRV447 EQU   CVTXTNT2+86
CVTRV446 EQU   CVTRV438
CVTRV445 EQU   CVTRV438
CVTRV444 EQU   CVTRV438
CVTRV443 EQU   CVTRV438
CVTRV442 EQU   CVTRV438
CVTRV441 EQU   CVTRV438
CVTRV440 EQU   CVTRV438
CVTRV439 EQU   CVTRV438
CVTRV437 EQU   CVTRV429
CVTRV436 EQU   CVTRV429
CVTRV435 EQU   CVTRV429
CVTRV434 EQU   CVTRV429
CVTRV433 EQU   CVTRV429
CVTRV432 EQU   CVTRV429
CVTRV431 EQU   CVTRV429
CVTRV430 EQU   CVTRV429
CVTRV428 EQU   CVTXTNT2+80
CVTRV427 EQU   CVTXTNT2+76
CVTRV426 EQU   CVTXTNT2+72
CVTRV425 EQU   CVTXTNT2+68
CVTATACT EQU   CVTATCVT
CVTRV423 EQU   CVTXTNT2+62
CVTRV422 EQU   CVTXTNT2+60
CVTRV421 EQU   CVTXTNT2+58
CVTRV420 EQU   CVTXTNT2+56
CVTRV419 EQU   CVTXTNT2+55
CVTRV418 EQU   CVTXTNT2+54
CVTRV417 EQU   CVTRV409
CVTRV416 EQU   CVTRV409
CVTRV415 EQU   CVTRV409
CVTRV414 EQU   CVTRV409
CVTRV413 EQU   CVTRV409
CVTRV412 EQU   CVTRV409
CVTRV411 EQU   CVTRV409
CVTRV410 EQU   CVTRV409
CVTRV408 EQU   CVTRV400
CVTRV407 EQU   CVTRV400
CVTRV406 EQU   CVTRV400
CVTRV405 EQU   CVTRV400
CVTRV404 EQU   CVTRV400
CVTRV403 EQU   CVTRV400
CVTRV402 EQU   CVTRV400
CVTRV401 EQU   CVTRV400
CVTICB   EQU   CVTXTNT2+48
CVTSKTA  EQU   CVTXTNT2+44
CVTSHSB  EQU   CVTSHS
CVTRSV98 EQU   CVTXTNT2+36
CVTRSV97 EQU   CVTXTNT2+34
CVTRSV96 EQU   CVTXTNT2+32
CVTOLTEP EQU   CVTXTNT2+28
CVTQIDA  EQU   CVTQID+1
CVTRSV95 EQU   CVTQID
CVTRSV94 EQU   CVTXTNT2+20
CVTRSV93 EQU   CVTXTNT2+16
CVTRSV92 EQU   CVTXTNT2+12
CVTDEBVR EQU   CVTXTNT2+8
CVTRSV91 EQU   CVTXTNT2+6
CVTRSV9H EQU   CVTFLGBT
CVTRSV9G EQU   CVTFLGBT
CVTRSV9F EQU   CVTFLGBT
CVTRSV9E EQU   CVTFLGBT
CVTRSV9D EQU   CVTFLGBT
CVTRSV9C EQU   CVTFLGBT
CVTVME   EQU   CVTFLGBT
CVTNPE   EQU   CVTFLGBT
CVTNUCLS EQU   CVTXTNT2+4
CVTDSSVA EQU   CVTDSSV+1
CVTRSV89 EQU   CVTDSSV
CVTRSV88 EQU   CVTXTNT1+8
CVTRSV87 EQU   CVTXTNT1+4
CVTFACHN EQU   CVTXTNT1
CVTRV488 EQU   CVTMAP+412
CVTRV487 EQU   CVTMAP+408
CVTRV486 EQU   CVTMAP+404
CVTRV485 EQU   CVTMAP+400
CVTACTAP EQU   CVTMAP+396
CVTAUTH  EQU   CVTMAP+392
CVTATMCA EQU   CVTATMCT+1
CVTATMST EQU   CVTATMCT
CVTRSV61 EQU   CVTMAP+384
CVTVOLT1 EQU   CVTVOLM1+1
CVTVOLI1 EQU   CVTVOLF1
CVTSTOA  EQU   CVTMAP+376
CVTRSV58 EQU   CVTMAP+374
CVTRSV57 EQU   CVTMAP+372
CVTDDCE  EQU   CVTMAP+368
CVTPNWFR EQU   CVTMAP+364
CVTSMF   EQU   CVTMAP+360
CVTSULK  EQU   CVTMAP+358
CVTSLKO  EQU   CVTSYSK
CVTSLKP  EQU   CVTSYSK
CVTSLKQ  EQU   CVTSYSK
CVTSLKR  EQU   CVTSYSK
CVTRSV56 EQU   CVTSYSK
CVTRSV55 EQU   CVTSYSK
CVTRSV54 EQU   CVTSYSK
CVTRSV53 EQU   CVTSYSK
CVTRSV52 EQU   CVTA1F1
CVTRSV51 EQU   CVTA1F1
CVTRSV50 EQU   CVTA1F1
CVTRSV49 EQU   CVTA1F1
CVTRSV48 EQU   CVTA1F1
CVTRSV47 EQU   CVTA1F1
CVTSRSW  EQU   CVTA1F1
CVTPFSW  EQU   CVTA1F1
CVTPCVT  EQU   CVTMAP+352
CVTRSV46 EQU   CVTMAP+344
CVTRSV45 EQU   CVTMAP+340
CVTRSV44 EQU   CVTMAP+338
CVTRSV43 EQU   CVTMAP+336
CVTHJESA EQU   CVTHJES+1
CVTRSV42 EQU   CVTHJES
CVTEXT2A EQU   CVTEXT2+1
CVTRSV41 EQU   CVTEXT2
CVTAPFA  EQU   CVTAPF+1
CVTRSV40 EQU   CVTAPF
CVTRV518 EQU   CVTINTLA
CVTRV517 EQU   CVTERPV
CVTEORM  EQU   CVTMAP+312
CVTMCHPR EQU   CVTMAP+308
CVTTZ    EQU   CVTMAP+304
CVTJEPS  EQU   CVTMAP+300
CVTJESCT EQU   CVTMAP+296
CVTMODE  EQU   CVTMAP+292
CVTPTRV  EQU   CVTMAP+288
CVTREAL  EQU   CVTMAP+284
CVTRSV39 EQU   CVTMAP+280
CVTRSV38 EQU   CVTMAP+276
CVTDMSRA EQU   CVTDMSR+1
CVTRV634 EQU   CVTDMSRF
CVTRV633 EQU   CVTDMSRF
CVTRV632 EQU   CVTDMSRF
CVTRV631 EQU   CVTDMSRF
CVTRV630 EQU   CVTDMSRF
CVTRV629 EQU   CVTDMSRF
CVTUDUMP EQU   CVTDMSRF
CVTSDUMP EQU   CVTDMSRF
CVTQMSGA EQU   CVTQMSG+1
CVTRSV36 EQU   CVTQMSG
CVTAMFF  EQU   CVTMAP+264
CVTPURGA EQU   CVTPURG+1
CVTRSV35 EQU   CVTPURG
CVTCBSP  EQU   CVTMAP+256
CVTATERA EQU   CVTATER+1
CVTSYST  EQU   CVTATER
CVTVOLT2 EQU   CVTTAT
CVTVOLI2 EQU   CVTVOLF2
CVTAQAVB EQU   CVTAQAVT+1
CVTRSV34 EQU   CVTTCMFG
CVTRSV33 EQU   CVTTCMFG
CVTRSV32 EQU   CVTTCMFG
CVTRSV31 EQU   CVTTCMFG
CVTRSV30 EQU   CVTTCMFG
CVTRSV29 EQU   CVTTCMFG
CVTRSV28 EQU   CVTTCMFG
CVTTCRDY EQU   CVTTCMFG
CVTGTFA  EQU   CVTGTF+1
CVTRSV27 EQU   CVTGTFST
CVTRNIO  EQU   CVTGTFST
CVTUSR   EQU   CVTGTFST
CVTRV318 EQU   CVTFORM
CVTRV317 EQU   CVTTMODE
CVTRV316 EQU   CVTSTATE
CVTRV315 EQU   CVTGTFS
CVTGTFAV EQU   CVTGTFS
CVT0SCR1 EQU   CVTMAP+232
CVTRV515 EQU   CVTMAP+228
CVTRMS   EQU   CVTMAP+224
CVTPATCH EQU   CVTMAP+220
CVTTSCE  EQU   CVTMAP+216
CVTLNKSC EQU   CVTMAP+214
CVTQABST EQU   CVTMAP+212
CVTMDLDS EQU   CVTMAP+208
CVTUSER  EQU   CVTMAP+204
CVTABEND EQU   CVTMAP+200
CVTSMCA  EQU   CVTMAP+196
CVTRSV18 EQU   CVTMAP+192
CVTQLPAQ EQU   CVTMAP+188
CVTQCDSR EQU   CVTMAP+184
CVTRSV17 EQU   CVTOPTB
CVTRSV16 EQU   CVTOPTB
CVTFP    EQU   CVTOPTB
CVTAPTHR EQU   CVTOPTB
CVTNLOG  EQU   CVTOPTB
CVTTOD   EQU   CVTOPTB
CVTCTIMS EQU   CVTOPTB
CVTPROT  EQU   CVTOPTB
CVTXPFP  EQU   CVTOPTA
CVTASCII EQU   CVTOPTA
CVTRSV13 EQU   CVTOPTA
CVTRSV12 EQU   CVTOPTA
CVTNIP   EQU   CVTOPTA
CVTDDR   EQU   CVTOPTA
CVTAPR   EQU   CVTOPTA
CVTCCH   EQU   CVTOPTA
CVTSNCTR EQU   CVTMAP+180
CVTQMWR  EQU   CVTMAP+176
CVTQOCR  EQU   CVTMAP+172
CVT1EF00 EQU   CVTMAP+168
CVTMZ00  EQU   CVTMAP+164
CVTHEAD  EQU   CVTMAP+160
CVTRSV11 EQU   CVTMAP+156
CVT0PT01 EQU   CVTMAP+152
CVTMSER  EQU   CVTMAP+148
CVTRV516 EQU   CVTIERLC
CVTILCH  EQU   CVTMAP+140
CVT0DS   EQU   CVTMAP+136
CVTFBOSV EQU   CVTMAP+132
CVTNUCB  EQU   CVTMAP+128
CVTIXAVL EQU   CVTMAP+124
CVTIOQET EQU   CVTMAP+120
CVTDCBA  EQU   CVTMAP+117
CVTMVS2  EQU   CVTDCB
CVT6DAT  EQU   CVTDCB
CVT4MPS  EQU   CVTDCB
CVTRSV09 EQU   CVTDCB
CVT4MS1  EQU   CVTDCB
CVT2SPS  EQU   CVTDCB
CVT1SSS  EQU   CVTDCB
CVTRSV08 EQU   CVTDCB
CVTSTB   EQU   CVTMAP+112
CVTQTD00 EQU   CVTMAP+108
CVTQTE00 EQU   CVTMAP+104
CVTCUCB  EQU   CVTMAP+100
CVTSJQ   EQU   CVTMAP+96
CVTPBLDL EQU   CVTMAP+92
CVTTPC   EQU   CVTMAP+88
CVTSVDCB EQU   CVTMAP+84
CVTBRET  EQU   CVTMAP+82
CVTEXIT  EQU   CVTMAP+80
CVT0FN00 EQU   CVTMAP+76
CVTDARA  EQU   CVTDAR+1
CVTRSV07 EQU   CVTFLGS1
CVTRSV06 EQU   CVTFLGS1
CVTRSV05 EQU   CVTFLGS1
CVTRSV04 EQU   CVTFLGS1
CVTRSV03 EQU   CVTFLGS1
CVTRSV02 EQU   CVTFLGS1
CVTRSV01 EQU   CVTFLGS1
CVTDMPLK EQU   CVTFLGS1
CVTXITP  EQU   CVTMAP+68
CVTZDTAB EQU   CVTMAP+64
CVTMSLT  EQU   CVTMAP+60
CVTDATE  EQU   CVTMAP+56
CVTBTERM EQU   CVTMAP+52
CVTSYSAD EQU   CVTMAP+48
CVTXTLER EQU   CVTMAP+44
CVTILK2  EQU   CVTMAP+40
CVTILK1  EQU   CVTMAP+36
CVTPRLTV EQU   CVTMAP+32
CVTPCNVT EQU   CVTMAP+28
CVT0VL00 EQU   CVTMAP+24
CVTXAPG  EQU   CVTMAP+20
CVTBUF   EQU   CVTMAP+16
CVTJOB   EQU   CVTMAP+12
CVTLINK  EQU   CVTMAP+8
CVT0EF00 EQU   CVTMAP+4
CVTTCBP  EQU   CVTMAP
CVT      EQU   CVTMAP
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS
@RC00534 EQU   @RC00533
IFKG00A# EQU   @RC00533
IFKG00J# EQU   @RC00594
@RC00639 EQU   @RC00627
@RC00634 EQU   @RC00627
@RC00697 EQU   @RC00694
@RC00752 EQU   @RC00732
@RC00699 EQU   @RC00697
@RC00701 EQU   @RC00699
@ENDDATA EQU   *
         END   ISTZIFKG,(C'PLS2315',0603,78153)
