         TITLE 'ISTZIFAB/AAB-VS1/MAB-VS2 - TPIOS COMMAND RESET PROCESSO*
               OR       '
ISTZIFAB CSECT ,                                                   0001
@MAINENT DS    0H                                                  0001
         USING *,@15                                               0001
         B     @PROLOG                                             0001
         DC    AL1(16)                                             0001
         DC    C'ISTZIFAB  78.018'                                 0001
         DROP  @15
@PROLOG  DS    0H                                                  0002
*                                                                  0406
*/* TPZSAVE (7,12,14) AC(ICAB)BASE                                   */
*                                                                  0406
*   DO;                                                            0406
*     RFY                                                          0407
*      (GPR01P,                                                    0407
*       GPR12P,                                                    0407
*       GPR13P,                                                    0407
*       GPR14P) RSTD;                                              0407
*     GEN(PRINT OFF);                                              0408
*                                                                  0408
         PRINT OFF
*/* ATBUILD (ISTZSAVE)                                               */
*/* END OF ATBUILD                                                   */
*                                                                  0409
*     GEN(PRINT ON);                                               0409
         PRINT ON
*     RFY                                                          0410
*       ISTZSAVE BASED(GPR13P);                                    0410
*     GEN SETS(ZSAZSVVR)(STM   7,12,ZSAZSVVR+0(13));               0411
         STM   7,12,ZSAZSVVR+0(13)
*     GEN SETS(GPR12P);                                            0412
         BALR  GPR12P,0
@TSTART  DS    0H
         USING @TSTART,GPR12P
*     GEN(PRINT OFF);                                              0413
*                                                                  0413
         PRINT OFF
*/* ATBUILD (ISTZCRR,ISTRPH,ISTCRA) EJECT(NO)                        */
*/* END OF ATBUILD                                                   */
*                                                                  0414
*     GEN(PRINT ON);                                               0414
         PRINT ON
*     GPR01P->RPHCRR->CRACRR->ZCREICAB='1'B;                       0415
         L     @09,RPHCRR(,GPR01P)                                 0415
         L     @09,CRACRR(,@09)                                    0415
         OI    ZCREICAB(@09),B'00010000'                           0415
*     ZSAZACTV='1'B;                                               0416
         OI    ZSAZACTV(GPR13P),B'10000000'                        0416
*     ZSAZTRAC='ICAB';                                             0417
         MVC   ZSAZTRAC(4,GPR13P),@CC03706                         0417
*     ZSAZSVRR=GPR14P;                                             0418
         ST    GPR14P,ZSAZSVRR(,GPR13P)                            0418
*     GPR13P=ZSAZSVFC;                                             0419
         L     GPR13P,ZSAZSVFC(,GPR13P)                            0419
*     RFY                                                          0420
*      (GPR01P) UNRSTD;                                            0420
*     RFY                                                          0421
*      (GPR14P) UNRSTD;                                            0421
*   END;                                                           0422
*                                                                  0422
*/* END TPZSAVE                                                      */
*/* TPDEQ (,LSCFDBA)                                                 */
*                                                                  0423
*   DO;                             /* BEGIN TPDEQ CODE GENERATION   */
*     DCL                                                          0424
*       FMZCA020 BIT(32) CONSTANT('80000000'X);                    0424
*     DCL                                                          0425
*       FMZCB020 BIT(32) CONSTANT('7FFFFFFF'X);                    0425
*     RFY                                                          0426
*      (GPR00P,                                                    0426
*       GPR01P,                                                    0426
*       GPR14P,                                                    0426
*       GPR15P) RSTD;                                              0426
*     RFY                                                          0427
*       ISTWKE;                                                    0427
*     GPR15P=ADDR(LSCFDBA);         /* ADDRESS QUEUE POINTER         */
         LA    GPR15P,LSCFDBA(,ELEMREG)                            0428
*     GPR14P=GPR15P->PABWEQA×FMZCA020;                             0429
         L     @09,@CF00850                                        0429
         L     GPR14P,PABWEQA(,GPR15P)                             0429
         OR    GPR14P,@09                                          0429
*     IF GPR14P=FMZCA020 THEN                                      0430
         CLR   GPR14P,@09                                          0430
         BE    @RT00430                                            0430
*       ;                                                          0431
*     ELSE                                                         0432
*       DO;                                                        0432
*FMZL1020:                                                         0433
*         ;                                                        0433
FMZL1020 DS    0H                                                  0434
*         DO WHILE(GPR14P->WKECHAIN^=FMZCA020);                    0434
         B     @DE00434                                            0434
@DL00434 DS    0H                                                  0435
*           GPR15P=ADDR(GPR14P->WKECHAIN);                         0435
         LA    GPR15P,WKECHAIN(,GPR14P)                            0435
*           GPR14P=GPR15P->PABWEQA;                                0436
         L     GPR14P,PABWEQA(,GPR15P)                             0436
*         END;                                                     0437
@DE00434 L     @09,@CF00850                                        0437
         CL    @09,WKECHAIN(,GPR14P)                               0437
         BNE   @DL00434                                            0437
*         GPR00P=FMZCA020;                                         0438
         LR    GPR00P,@09                                          0438
*         CS(GPR14P,GPR00P,GPR15P->PABWEQA);                       0439
         CS    GPR14P,@00,PABWEQA(GPR15P)                          0439
*         BC(7,FMZL1020);                                          0440
         BC    7,FMZL1020                                          0440
*         GPR14P->WKECHAIN=0;                                      0441
         SLR   @09,@09                                             0441
         ST    @09,WKECHAIN(,GPR14P)                               0441
*       END;                                                       0442
*ISTA0020:                                                         0443
*     ;                                                            0443
@RT00430 DS    0H                                                  0443
ISTA0020 DS    0H                                                  0444
*     GPR14P=GPR14P&FMZCB020;                                      0444
         N     GPR14P,@CF00848                                     0444
*     GPR01P->RPHWEA=GPR14P;                                       0445
         ST    GPR14P,RPHWEA(,GPR01P)                              0445
*     RFY                                                          0446
*      (GPR00P,                                                    0446
*       GPR01P,                                                    0446
*       GPR14P,                                                    0446
*       GPR15P) UNRSTD;                                            0446
*   END;                            /* END TPDEQ GENERATION DEQ    0447
*                                      OLDEST FSB FROM WAITQ ELEMENT */
*   IF(BDUCOMND=BCMDW&              /* IF A WRITE COMND      @ZA26355*/
*       (BDUMODIF=BMODWC×           /* WITH                  @ZA26355*/
*       BDUMODIF=BMODWCM×           /* ANY                   @ZA26355*/
*       BDUMODIF=BMODWCT×           /* KIND                  @ZA26355*/
*       BDUMODIF=BMODWCD×           /* OF CONTACT            @ZA26355*/
*       BDUMODIF=BMODWCR)&          /* MODIFIER              @ZA26355*/
*       FSBEXTRS^='00'X) THEN       /* &NON-ZERO EXT RESP    @ZA26355*/
         LA    @14,62                                              0448
         ALR   @14,BFRREG                                          0448
         CLI   BDUCOMND(@14),X'02'                                 0448
         BNE   @RF00448                                            0448
         CLI   BDUMODIF(@14),X'08'                                 0448
         BE    @GL00001                                            0448
         CLI   BDUMODIF(@14),X'09'                                 0448
         BE    @GL00001                                            0448
         CLI   BDUMODIF(@14),X'0A'                                 0448
         BE    @GL00001                                            0448
         CLI   BDUMODIF(@14),X'0B'                                 0448
         BE    @GL00001                                            0448
         CLI   BDUMODIF(@14),X'0E'                                 0448
         BNE   @RF00448                                            0448
@GL00001 CLI   FSBEXTRS+16(BFRREG),X'00'                           0448
         BE    @RF00448                                            0448
*     FMCZFA06=ON;                  /* SET IN SESSION BIT    @ZA26355*/
         OI    FMCZFA06(FMCBREG),B'00000100'                       0449
*   ELSE                                                           0450
*     ;                             /* OTHERWISE DON'T       @ZA26355*/
@RF00448 DS    0H                                                  0451
*   IF FMCZH001=FMCZHF41 THEN       /* IF LINE STATE RESCHEDULE      */
*                                                                  0451
         CLC   FMCZH001(2,FMCBREG),@CH02032                        0451
         BNE   @RF00451                                            0451
*     /***************************************************************/
*     /*                                                             */
*     /* SEGMENT(SEG000C)REQUEST                                     */
*     /*                                                             */
*     /***************************************************************/
*                                                                  0452
*     DO;                                                          0452
*       GOTO SEG000C;                                              0453
         B     SEG000C                                             0453
*SEG000C#:                                                         0454
*     END;                                                         0454
*                                                                  0454
*   /*****************************************************************/
*   /*                                                               */
*   /*                                                       @XM09807*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0455
*                                   /* INITIALIZE FOR SHIPOUT AND SET
*                                      RETURN CODE           @XM09807*/
*   ELSE                            /* FMCB LINE STATE NOT RESCHEDULE
*                                                            @XM09807*/
*     DO;                           /* PROCESS COMND RESET@XM09807   */
*                                                                  0455
         B     @RC00451                                            0455
@RF00451 DS    0H                                                  0456
*       /*************************************************************/
*       /*                                                           */
*       /* SEGMENT(SEG000J)REQUEST                                   */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0456
*       DO;                                                        0456
*         GOTO SEG000J;                                            0457
         B     SEG000J                                             0457
*SEG000J#:                                                         0458
*       END;                        /* CHECK FOR RESET ELEMENT TYPE
*                                                            @XL03HEK*/
SEG000J# DS    0H                                                  0459
*       IF RCDREG=0 THEN            /* IF FEEDBACK TO BE SENT THEN   */
*                                                                  0459
         LTR   RCDREG,RCDREG                                       0459
         BNZ   @RF00459                                            0459
*         /***********************************************************/
*         /*                                                         */
*         /* SEGMENT(SEG000D)REQUEST                                 */
*         /*                                                         */
*         /***********************************************************/
*                                                                  0460
*         DO;                                                      0460
*           GOTO SEG000D;                                          0461
         B     SEG000D                                             0461
*SEG000D#:                                                         0462
*         END;                                                     0462
*                                                                  0462
*       /*************************************************************/
*       /*                                                           */
*       /*                                                   @XL03HCH*/
*       /*                                                           */
*       /*************************************************************/
*                                                                  0463
*                                   /* SET UP FOR RESET FEEDBACK     */
*       ELSE                                                       0463
*         ;                         /* RTN CD=4,NO FDBK      @XL03HCH*/
@RF00459 DS    0H                                                  0464
*       IF FMCZF015=ON THEN         /* IS RESET CLEAN-UP PHASE-1   0464
*                                      COMPLETE?             @XL03HEK*/
@RC00459 TM    FMCZF015(FMCBREG),B'00000100'                       0464
         BO    @RT00464                                            0464
*         ;                         /* YES, (NULL)           @XL03HEK*/
*       ELSE                        /* NO                    @XL03HEK*/
*         CALL ZRCZIFSB;            /* RESET CLEANUP PHASE-1 @XL03HEK*/
         L     @15,ZRCZIFSB(,RCVTREG)                              0466
         BALR  @14,@15                                             0466
*       CALL IFAB000B;              /* CHECK END STATE AND SET RC    */
@RT00464 BAL   @14,IFAB000B                                        0467
*     END;                          /* END COMND RESET PROCESS     0468
*                                                            @XM09807*/
*/* TPZRETN                                                          */
*                                                                  0469
*   DO;                                                            0469
@RC00451 DS    0H                                                  0470
*     RFY                                                          0470
*      (GPR07P,                                                    0470
*       GPR14P,                                                    0470
*       GPR15P) RSTD;                                              0470
*     GPR13P=ZSAZSVBC;                                             0471
         L     GPR13P,ZSAZSVBC(,GPR13P)                            0471
*     IF GPR13P=0 THEN                                             0472
         LTR   GPR13P,GPR13P                                       0472
         BZ    @RT00472                                            0472
*       ;                           /* TPDVTS ISTZFARR               */
*     ELSE                                                         0474
*       GPR14P=ZSAZSVRR;                                           0474
         L     GPR14P,ZSAZSVRR(,GPR13P)                            0474
*     GEN REFS(ZSAZSVVR)(LM    7,12,ZSAZSVVR+0(13));               0475
@RT00472 DS    0H                                                  0475
         LM    7,12,ZSAZSVVR+0(13)
*     GEN REFS(GPR14P) EXIT NOSEQFLOW(BR    GPR14P);               0476
         BR    GPR14P
*     RFY                                                          0477
*      (GPR07P,                                                    0477
*       GPR14P,                                                    0477
*       GPR15P) UNRSTD;                                            0477
*   END;                                                           0478
*                                                                  0478
*/* END TPZRETN                                                      */
*                                                                  0479
*                                                                  0479
*/********************************************************************/
*/*                                                                  */
*/* SUBROUTINE-                                                      */
*/*      IFAB000A                                                    */
*/*                                                                  */
*/* FUNCTION-                                                        */
*/*      1) THE FSB IS INITIALIZED                           @XL03HEK*/
*/*      2) IF THE DEVICE IS A 3270 IN RECORD MODE, THEN     @XL03HEK*/
*/*         ISTZDFQR IS CALLED TO BUILD A FID1 RESPONSE FSB, @XL03HEK*/
*/*         AND THE FSB RETURN CODES ARE SET FOR PURGE.      @XL03HEK*/
*/*      3) THE TPIOS FDB IS MOVED TO THE SYSTEM FDB.        @XL03HEK*/
*/*                                                                  */
*/********************************************************************/
*                                                                  0479
*IFAB000A:                                                         0479
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0479
IFAB000A DS    0H                                                  0480
*   RFY                                                            0480
*     LNKREG RSTD;                  /* TO SAVE RETURN ADDRESS        */
*   ZCRSVF7=LNKREG;                 /* SAVE RETURN ADDRESS           */
         L     @09,RPHCRR(,RPHREG)                                 0481
         L     @09,CRACRR(,@09)                                    0481
         ST    LNKREG,ZCRSVF7(,@09)                                0481
*   RFY                                                            0482
*     LNKREG UNRSTD;                /* SAVED                         */
*   IF LSCTYPE=LSTYPE THEN          /* IF ELEMENT IS A LSCB          */
         CLI   LSCTYPE(ELEMREG),X'DF'                              0483
         BNE   @RF00483                                            0483
*     FSBLCPB=LSCLCPBA;             /* MOVE LCPB ADDRESS FROM LSCB   */
         L     @14,LSCLCPBA(,ELEMREG)                              0484
         ST    @14,FSBLCPB+16(,BFRREG)                             0484
*   ELSE                            /* IF ELEMENT IS A LCPB          */
*     FSBLCPB=ELEMREG;              /* SET ADDRESS IN FSB            */
         B     @RC00483                                            0485
@RF00483 ST    ELEMREG,FSBLCPB+16(,BFRREG)                         0485
*   FSBLCCWA=LSCLCCWA;              /* SET LCCW ADDRESS IN FSB       */
@RC00483 LA    @14,16                                              0486
         ALR   @14,BFRREG                                          0486
         L     @09,LSCLCCWA(,ELEMREG)                              0486
         ST    @09,FSBLCCWA(,@14)                                  0486
*   FSBSAF=BTUSORCE;                /* SET SOURCE ID IN FSB          */
         LA    @09,48                                              0487
         ALR   @09,BFRREG                                          0487
         MVC   FSBSAF(2,@14),BTUSORCE(@09)                         0487
*   FSBDAF=BTUDEST;                 /* SET DESTINATION ID IN FSB     */
         MVC   FSBDAF(2,@14),BTUDEST(@09)                          0488
*   IF FSBMJRCD=FRLOGICE THEN                                      0489
         CLI   FSBMJRCD(@14),X'08'                                 0489
         BE    @RT00489                                            0489
*     ;                             /* IF LOGIC ERROR IGNORE         */
*   ELSE                            /* IF NOT LOGIC ERROR            */
*     DO;                           /* INDICATE OPERATION COMPLETE   */
*       FSBECI='1'B;                /* SET ON LAST FSB FOR LCCW      */
*       FSBELI='1'B;                /* SET ON LAST FSB FOR LCPB      */
         OI    FSBECI+16(BFRREG),B'11000000'                       0493
*     END;                          /* END OF FLAG SETTING           */
*   IF ZCR3270R=ON THEN             /* 3270 IN RECORD MODE@XL03HEK   */
@RT00489 L     @14,RPHCRR(,RPHREG)                                 0495
         L     @14,CRACRR(,@14)                                    0495
         TM    ZCR3270R(@14),B'00000010'                           0495
         BNO   @RF00495                                            0495
*     DO;                           /* YES                   @XL03HEK*/
*       CALL ZPSZDFQR;              /* BUILD A FID1 RESPONSE FSB   0497
*                                                            @XL03HEK*/
         L     @09,ATCZPSVT(,VTCVTREG)                             0497
         L     @15,ZPSZDFQR(,@09)                                  0497
         BALR  @14,@15                                             0497
*       FSBMJRCD=FRPURGE;           /* SET PURGE RC IN FSB@XL03HEK   */
         LA    @14,16                                              0498
         ALR   @14,BFRREG                                          0498
         MVI   FSBMJRCD(@14),X'1C'                                 0498
*       FSBMNRCD=LSCZMIRC;          /* USE WQ ELEM MIN RC    @XL03HEK*/
         MVC   FSBMNRCD(1,@14),LSCZMIRC(ELEMREG)                   0499
*     END;                          /*                       @XL03HEK*/
*   ELSE                                                           0501
*     ;                             /* NOT RECORD 3270       @XL03HEK*/
@RF00495 DS    0H                                                  0502
*   ZIBFDBS=ZIBFDBZ;                /* MOVE TPIOS FDB TO SYS FDB     */
         MVC   ZIBFDBS(12,BFRREG),ZIBFDBZ(BFRREG)                  0502
*   ADDR(ZIBFDBS)->FDBOFSET=LENGTH(ZIBAIOCM)+LENGTH(ZIBFSB);/* SET 0503
*                                      BUFFER OFFSET IN FDB          */
         LA    @14,48                                              0503
         LR    @09,BFRREG                                          0503
         ALR   @09,@14                                             0503
         STH   @14,FDBOFSET(,@09)                                  0503
*   RFY                                                            0504
*     LNKREG RSTD;                  /* TO RESTORE RETURN ADDRESS     */
*   LNKREG=ZCRSVF7;                 /* RESTORE RETURN ADDRESS        */
         L     @09,RPHCRR(,RPHREG)                                 0505
         L     @09,CRACRR(,@09)                                    0505
         L     LNKREG,ZCRSVF7(,@09)                                0505
*   RFY                                                            0506
*     LNKREG UNRSTD;                /* RESTORED                      */
*   END IFAB000A;                   /* END OF SUBROUTINE             */
@EL00002 DS    0H                                                  0507
@EF00002 DS    0H                                                  0507
@ER00002 BR    @14                                                 0507
*                                                                  0508
*/********************************************************************/
*/*                                                                  */
*/* SUBROUTINE-                                                      */
*/*      IFAB000B                                                    */
*/*                                                                  */
*/* FUNCTION-                                                        */
*/*      THIS ROUTINE DETERMINES IF THE CURRENT FEEDBACK BLOCK       */
*/*      IS THE LAST ONE FOR THE ELEMENT.  IF IT IS, THE WAITQ       */
*/*      ELEMENT IS DEQUEUED.  THE ELEMENT IS DISCARDED IF IT        */
*/*      IS AN LSCB. AN LCPB MARKED FOR DEALLOCATION IS      @XL03HEK*/
*/*      DISCARDED. IF NOT SO MARKED, AN LCPB IS LEFT FOR    @XL03HEK*/
*/*      CONTROL LAYER.                                      @XL03HEK*/
*/*      IF IT IS NOT THE LAST FSB FOR THE ELEMENT, THE ELEMENT'S    */
*/*      FSB CHAIN IS SEARCHED FOR ANOTHER ELEMENT ALREADY THERE.    */
*/*      AN APPROPRIATE RETURN CODE IS SET DEPENDING ON THE STATUS   */
*/*      OF THE QUEUES.                                              */
*/*                                                                  */
*/********************************************************************/
*                                                                  0508
*IFAB000B:                                                         0508
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0508
IFAB000B DS    0H                                                  0509
*   RFY                                                            0509
*     LNKREG RSTD;                  /* TO SAVE RETURN ADDRESS        */
*   ZCRSVF7=LNKREG;                 /* SAVE RETURN ADDRESS           */
         L     @09,RPHCRR(,RPHREG)                                 0510
         L     @09,CRACRR(,@09)                                    0510
         ST    LNKREG,ZCRSVF7(,@09)                                0510
*   RFY                                                            0511
*     LNKREG UNRSTD;                /* SAVED                         */
*   IF ZCRLSTFB='1'B THEN           /* IF LAST FSB FOR ELEMENT       */
         TM    ZCRLSTFB(@09),B'00000100'                           0512
         BNO   @RF00512                                            0512
*     DO;                           /* PROCESS LAST FSB              */
*/*                                DEQUEUE OLDEST WAITQ ELEM @XL03HEK*/
*                                                                  0514
*       CALL IFAB000G;              /*                       @XL03HEK*/
         BAL   @14,IFAB000G                                        0514
*       IF LSCTYPE=LSTYPE THEN      /* IF ELEMENT IS A LSCB          */
         CLI   LSCTYPE(ELEMREG),X'DF'                              0515
         BNE   @RF00515                                            0515
*         DO;                       /*                               */
*           IF LSCSMODE=ON THEN     /* CHECK IF SET MODE WAS DONE  0517
*                                                            @XM08886*/
         TM    LSCSMODE(ELEMREG),B'10000000'                       0517
         BNO   @RF00517                                            0517
*             ZCRSCANQ=ON;          /*                       @XM08886*/
         L     @14,RPHCRR(,RPHREG)                                 0518
         L     @14,CRACRR(,@14)                                    0518
         OI    ZCRSCANQ(@14),B'00100000'                           0518
*           ELSE                                                   0519
*             ;                     /* DISCARD LSCB                  */
@RF00517 DS    0H                                                  0520
*           ZCRPCOD1=0;             /* SET UP PARAMETERS             */
         L     @14,RPHCRR(,RPHREG)                                 0520
         L     @14,CRACRR(,@14)                                    0520
         MVI   ZCRPCOD1(@14),X'00'                                 0520
*           ZCRPLSCB='1'B;          /* TO FREE LSCB                  */
         OI    ZCRPLSCB(@14),B'00001000'                           0521
*           CALL ATCZPSVT->ZPSZDFB0;/* CALL BUFFER DEALLOCATION      */
         L     @09,ATCZPSVT(,VTCVTREG)                             0522
         L     @15,ZPSZDFB0(,@09)                                  0522
         BALR  @14,@15                                             0522
*         END;                      /* LSCB DISCARDED                */
*       ELSE                        /* ELEMENT IS A LCPB     @XL03HEK*/
*         IF ZCRNXTEL=ON THEN       /* LCPB DEALLOC ON?      @XL03HEK*/
*                                                                  0524
         B     @RC00515                                            0524
@RF00515 L     @14,RPHCRR(,RPHREG)                                 0524
         L     @14,CRACRR(,@14)                                    0524
         TM    ZCRNXTEL(@14),B'00010000'                           0524
         BNO   @RF00524                                            0524
*           /*********************************************************/
*           /*                                                       */
*           /* RELSTORE BUFADDR(ELEMREG)                             */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0525
*           DO;                                                    0525
*                                                                  0525
*/* ATBUILD (ISTATCVT,ISTRPH)                                        */
*/* END OF ATBUILD                                                   */
*                                                                  0526
*             RFY                                                  0526
*              (GPR02P,                                            0526
*               GPR03P,                                            0526
*               GPR04P,                                            0526
*               GPR15P) RSTD;                                      0526
*             RFY                                                  0527
*              (GPR01P,                                            0527
*               GPR13P) RSTD;                                      0527
*             GENERATE REFS(GPR01P,GPR02P,GPR13P) SETS(RPHWORK);   0528
          STM GPR02P,GPR13P,RPHWORK(GPR01P)
*             RFY                                                  0529
*               GPR13P UNRSTD;                                     0529
*             GPR04P=ELEMREG;                                      0530
         LR    GPR04P,ELEMREG                                      0530
*             DCL                                                  0531
*               1 FMZA0030 FIXED(31) STATIC LOCAL,                 0531
*                2 * FIXED(8) INIT(64),                            0531
*                2 * PTR(24) INIT(0);                              0531
*             GPR03F=FMZA0030;                                     0532
         L     GPR03F,FMZA0030                                     0532
*             DO;                   /* LISATCVT                    0533
*                                      CVTBASE(PAGEABLE,(GPR15P))    */
*               GPR15P=ATCLCPTR;    /* SET UP ATCVT POINTER          */
         L     GPR15P,ATCLCPTR                                     0534
*             END;                  /* LISATCVT                      */
*             GPR02P=GPR15P->ATCBPDA;                              0536
         L     GPR02P,ATCBPDA(,GPR15P)                             0536
*             GPR15P=GPR15P->ATCSMRS;                              0537
         L     GPR15P,ATCSMRS(,GPR15P)                             0537
*             DCL                                                  0538
*               FMZL0030 BASED(GPR15P) LABEL VALUERANGE(*);        0538
*             CALL FMZL0030;                                       0539
         BALR  @14,@15                                             0539
*             RFY                                                  0540
*               GPR13P RSTD;                                       0540
*             GENERATE REFS(GPR01P,RPHWORK) SETS(GPR02P,GPR13P);   0541
          LM GPR02P,GPR13P,RPHWORK(GPR01P)
*             RFY                                                  0542
*              (GPR01P,                                            0542
*               GPR13P) UNRSTD;                                    0542
*             RFY                                                  0543
*              (GPR02P,                                            0543
*               GPR03P,                                            0543
*               GPR04P,                                            0543
*               GPR15P) UNRSTD;                                    0543
*           END;                    /* *********END OF RELSTORE    0544
*                                      EXPANSION********* YES,     0544
*                                      DISCARD THE LCPB      @XL03HEK*/
*         ELSE                                                     0545
*           ;                       /* KEEP LCPB             @XL03HEK*/
@RF00524 DS    0H                                                  0546
*/*                                    CHK IF SCHED CNT HAS TO BE  0546
*                                     DECREMENTED            @XM08886*/
*                                                                  0546
*       IF ZCRSCANQ=ON THEN                                        0546
@RC00515 L     @14,RPHCRR(,RPHREG)                                 0546
         L     @14,CRACRR(,@14)                                    0546
         TM    ZCRSCANQ(@14),B'00100000'                           0546
         BO    @RT00546                                            0546
*         ;                         /* IF CNTL CMND RESET DON'T    0547
*                                      DECRMT DNCB REQ CNT@XM08886   */
*       ELSE                                                       0548
*         DNCACIP=DNCACIP-1;        /* DECRMT DNCB REQ CNT@XL03HCH   */
         SLR   @14,@14                                             0548
         IC    @14,DNCACIP(,DNCBREG)                               0548
         BCTR  @14,0                                               0548
         STC   @14,DNCACIP(,DNCBREG)                               0548
*       RCDREG=ZCRSRCHQ;            /* SET RETURN CODE TO SEARCH   0549
*                                      WAITQ FOR WORK                */
@RT00546 LA    RCDREG,16                                           0549
*     END;                          /* END LAST FSB PROCESSOR        */
*   ELSE                            /* NOT LAST FSB FOR ELEMENT      */
*     IF(LSCFDBA&MASKWORD)^=0 THEN  /* IF MORE FSB'S ON ELEMENT      */
         B     @RC00512                                            0551
@RF00512 L     @14,LSCFDBA(,ELEMREG)                               0551
         N     @14,@CF03660                                        0551
         LTR   @14,@14                                             0551
         BZ    @RF00551                                            0551
*       DO;                         /* SET UP TO PROCESS NEXT ONE    */
*/* TPFEL (,LSCFDBA) RETPTR(BFRREG)                                  */
*                                                                  0553
*         DO;                       /* BEGIN TPFEL CODE GENERATION   */
*           RFY                                                    0554
*            (GPR00P,                                              0554
*             GPR01P,                                              0554
*             GPR14P,                                              0554
*             GPR15P) RSTD;                                        0554
*           GPR15P=ADDR(LSCFDBA);   /* ADDRESS QUEUE POINTER         */
         LA    GPR15P,LSCFDBA(,ELEMREG)                            0555
*           GPR14P=GPR15P->PABWEQA×FMZCA020;                       0556
         L     @09,@CF00850                                        0556
         L     GPR14P,PABWEQA(,GPR15P)                             0556
         OR    GPR14P,@09                                          0556
*           IF GPR14P=FMZCA020 THEN                                0557
         CLR   GPR14P,@09                                          0557
         BE    @RT00557                                            0557
*             ;                                                    0558
*           ELSE                                                   0559
*             DO;                                                  0559
*               GPR00P=FMZCA020;    /* INITIALIZE QUIT FLAG          */
         L     GPR00P,@CF00850                                     0560
*               DO WHILE(GPR00P^=GPR14P->WKECHAIN);                0561
         B     @DE00561                                            0561
@DL00561 DS    0H                                                  0562
*                 GPR14P=GPR14P->WKECHAIN;/* SEARCH FOR END OF CHAIN */
         L     GPR14P,WKECHAIN(,GPR14P)                            0562
*               END;                                               0563
@DE00561 C     GPR00P,WKECHAIN(,GPR14P)                            0563
         BNE   @DL00561                                            0563
*             END;                                                 0564
*           GPR14P=GPR14P&FMZCB020;                                0565
@RT00557 N     GPR14P,@CF00848                                     0565
*           BFRREG=GPR14P;                                         0566
         LR    BFRREG,GPR14P                                       0566
*           RFY                                                    0567
*            (GPR00P,                                              0567
*             GPR01P,                                              0567
*             GPR14P,                                              0567
*             GPR15P) UNRSTD;                                      0567
*         END;                      /* END TPFEL GENERATION ADDRESS
*                                      NEXT ELEMENT                  */
*         BFRREG=BFRREG-LENGTH(ZIBAIOCM);/* POINT TO ELEMENT         */
         SL    BFRREG,@CF01002                                     0569
*         RCDREG=ZCRMRFSB;          /* SET RETURN CODE TO PROCESS  0570
*                                      NEXT FSB                      */
         LA    RCDREG,12                                           0570
*       END;                        /* END NEXT FSB PROCESS          */
*     ELSE                          /* NO MORE FSB'S ON QUEUE        */
*       RCDREG=ZCREXIT;             /* SET RETURN CODE TO EXIT       */
         B     @RC00551                                            0572
@RF00551 LA    RCDREG,20                                           0572
*   RFY                                                            0573
*     LNKREG RSTD;                  /* TO RESTORE RETURN REGISTER    */
@RC00551 DS    0H                                                  0573
@RC00512 DS    0H                                                  0574
*   LNKREG=ZCRSVF7;                 /* RESTORE RETURN ADDRESS        */
         L     @09,RPHCRR(,RPHREG)                                 0574
         L     @09,CRACRR(,@09)                                    0574
         L     LNKREG,ZCRSVF7(,@09)                                0574
*   RFY                                                            0575
*     LNKREG UNRSTD;                /* RESTORED                      */
*   END IFAB000B;                   /* END OF SUBROUTINE             */
@EL00003 DS    0H                                                  0576
@EF00003 DS    0H                                                  0576
@ER00003 BR    @14                                                 0576
*                                                                  0577
*/********************************************************************/
*/*                                                                  */
*/* SEGMENT-                                                         */
*/*      SEG000C                                                     */
*/*                                                                  */
*/* FUNCTION-                                                        */
*/*      THIS SUBROUTINE RESCHEDULES REQUESTS THAT WERE              */
*/*      UNINTENTIONALLY CANCELLED DUE TO A RESET BEING ISSUED.      */
*/*                                                                  */
*/********************************************************************/
*                                                                  0577
*   /*****************************************************************/
*   /*                                                               */
*   /* SEGMENT(SEG000C)START                                         */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0577
*   DO;                                                            0577
*     GOTO SEG000C@;                                               0578
*SEG000C:                                                          0579
*   END;                                                           0579
SEG000C  DS    0H                                                  0580
*   FDBDATAA=ADDR(ZIBBTU);          /* SET DATA ADDRESS IN FDB       */
         LA    @14,ZIBBTU(,BFRREG)                                 0580
         ST    @14,FDBDATAA(,BFRREG)                               0580
*   FDBDATCT=FDBDATCT+LENGTH(ISTBTU);/* SET DATA LENGTH IN FDB       */
         LA    @14,20                                              0581
         AH    @14,FDBDATCT(,BFRREG)                               0581
         STH   @14,FDBDATCT(,BFRREG)                               0581
*   BTUSYSTR=0;                     /* CLEAR SYSTEM RESPONSE FIELD   */
         LA    @14,48                                              0582
         ALR   @14,BFRREG                                          0582
         MVI   BTUSYSTR(@14),X'00'                                 0582
*   BTUEXTR=0;                      /* CLEAR EXTENDED RESPONSE FLD   */
         MVI   BTUEXTR(@14),X'00'                                  0583
*   BTUFID=THSET;                   /* INIT TH BYTES 1&2     @XL03HAH*/
         MVC   BTUFID(2,@14),@CB03658                              0584
*   BTURH=0;                        /* INIT REQUEST HEADR    @XL03HAH*/
         SLR   @09,@09                                             0585
         STCM  @09,15,BTURH(@14)                                   0585
*   BTUDCF=LENGTH(BTURH)+LENGTH(BTUSYSTR)+LENGTH(BTUEXTR)+LENGTH(ISTBDU
*       );                          /* INITIALIZE COUNT      @XL03HAH*/
         MVC   BTUDCF(2,@14),@CH02866                              0586
*   CALL ATCZFSVT->ZFSZEFBB;        /* CALL SHIPOUT                  */
         L     @09,ATCZFSVT(,VTCVTREG)                             0587
         L     @15,ZFSZEFBB(,@09)                                  0587
         BALR  @14,@15                                             0587
*   LSCZRT03='0'B;                  /* TURN OFF LINE STATE ANALYSIS
*                                      FLAG                          */
         NI    LSCZRT03(ELEMREG),B'11101111'                       0588
*   IF(FMCLCPBQ&MASKWORD)=ELEMREG THEN/* IF ONLY ONE ELEM ON WAITQ   */
         L     @14,FMCLCPBQ(,FMCBREG)                              0589
         N     @14,@CF03660                                        0589
         CR    @14,ELEMREG                                         0589
         BNE   @RF00589                                            0589
*     FMCZH001=FMCZHF31;            /* SET LINE STATE TO NULL        */
         SLR   @14,@14                                             0590
         STH   @14,FMCZH001(,FMCBREG)                              0590
*   ELSE                                                           0591
*     ;                             /* OTHERWISE DON'T               */
@RF00589 DS    0H                                                  0592
*   RCDREG=ZCREXIT;                 /* SET RETURN CODE TO EXIT       */
*                                                                  0592
         LA    RCDREG,20                                           0592
*   /*****************************************************************/
*   /*                                                               */
*   /* SEGMENT(SEG000C)FINISH                                        */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0593
*   DO;                                                            0593
*     GOTO SEG000C#;                                               0594
         B     SEG000C#                                            0594
*SEG000C@:                                                         0595
*   END;                                                           0595
SEG000C@ DS    0H                                                  0596
*                                                                  0596
*/********************************************************************/
*/*                                                                  */
*/* SEGMENT-                                                         */
*/*      SEG000D                                                     */
*/*                                                                  */
*/* FUNCTION-                                                        */
*/*      THIS SUBROUTINE INSURES THAT FEEDBACK IS ONLY SHIPPED       */
*/*      FOR THE FIRST ELEMENT ENCOUNTERED THAT HAS BEEN RESET FOR   */
*/*      A LCPB.  THE FIRST ELEMENT ENCOUNTERED IS FED BACK TO THE   */
*/*      CONTROL LAYER, AND ALL OTHERS ARE DISCARDED UNTIL A         */
*/*      LCPB IS ENCOUNTERED.                                        */
*/*        IF AN LCPB ON THE ATOP IS ENCOUNTERED, THE LCPB   @XL03HEK*/
*/*      DEALLOCATION SWITCH (IN THE ZCR) IS SET ON.         @XL03HEK*/
*/*                                                                  */
*/********************************************************************/
*                                                                  0596
*   /*****************************************************************/
*   /*                                                               */
*   /* SEGMENT(SEG000D)START                                         */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0596
*   DO;                                                            0596
*     GOTO SEG000D@;                                               0597
         B     SEG000D@                                            0597
*SEG000D:                                                          0598
*   END;                                                           0598
SEG000D  DS    0H                                                  0599
*   ZCRLSTFB='1'B;                  /* INDICATE LAST FSB FOR ELEM    */
*   ZCRNXTEL=OFF;                   /* SET OFF DEALLOCATE LCPB SWITCH
*                                                            @XL03HEK*/
         L     @14,RPHCRR(,RPHREG)                                 0600
         L     @14,CRACRR(,@14)                                    0600
         OI    ZCRLSTFB(@14),B'00000100'                           0600
         NI    ZCRNXTEL(@14),B'11101111'                           0600
*   IF FMCZF014='1'B THEN           /* IF RESET ALREADY REPORTED     */
         TM    FMCZF014(FMCBREG),B'00001000'                       0601
         BNO   @RF00601                                            0601
*     DO;                           /* CLEAR ANY FLUKY FEEDBACK      */
*       CALL IFAB000I;              /* DEALLOC BUFFERS       @XL03HEK*/
         BAL   @14,IFAB000I                                        0603
*       IF LCPATOP=ON THEN          /* LCPB ON ATOP?         @XL03HEK*/
         TM    LCPATOP(ELEMREG),B'00000001'                        0604
         BNO   @RF00604                                            0604
*         ZCRNXTEL=ON;              /* YES, SET ON LCPB DEALLOC FLAG
*                                                            @XL03HEK*/
         L     @14,RPHCRR(,RPHREG)                                 0605
         L     @14,CRACRR(,@14)                                    0605
         OI    ZCRNXTEL(@14),B'00010000'                           0605
*       ELSE                        /* LCPB NOT ON ATOP      @XL03HEK*/
*         IF LSCTYPE=LSTYPE THEN                                   0606
         B     @RC00604                                            0606
@RF00604 CLI   LSCTYPE(ELEMREG),X'DF'                              0606
         BE    @RT00606                                            0606
*           ;                       /* IGNORE LSCB                   */
*         ELSE                      /* PROCESS FEEDBACK              */
*           DO;                     /* SAVED IN FMCZV004             */
*             FMCZF014='0'B;        /* CLEAR RESET REPORT FLAG       */
         NI    FMCZF014(FMCBREG),B'11110111'                       0609
*             BFRREG=FMCZV004;      /* ADDRESS SAVED BUFFER          */
         L     BFRREG,FMCZV004(,FMCBREG)                           0610
*             FMCZV004=0;           /* CLEAR SAVED ZOB POINTER       */
         SLR   @14,@14                                             0611
         ST    @14,FMCZV004(,FMCBREG)                              0611
*/*                                        QUEUE FSB TO CLIP @XL03HEK*/
*/*  TPQUE (BFRREG,FMCPAB2) NORM                                     */
*                                                                  0612
*             DO;                                                  0612
*               RFY                                                0613
*                (GPR00P,                                          0613
*                 GPR01P,                                          0613
*                 GPR04P,                                          0613
*                 GPR05P,                                          0613
*                 GPR15P) RSTD;                                    0613
*               GEN REFS(GPR01P) SETS(RPHWORK)                     0614
*                   (STM GPR02P,GPR08P,RPHWORK(GPR01P));           0614
         STM GPR02P,GPR08P,RPHWORK(GPR01P)
*               GPR00P=0;                                          0615
         SLR   GPR00P,GPR00P                                       0615
*               GPR15P=ADDR(FMCPAB2);/* HOLD PAB PTR                 */
         LA    GPR15P,FMCPAB2(,FMCBREG)                            0616
*               GPR04P=BFRREG;      /* WORK ELE PTR                  */
         LR    GPR04P,BFRREG                                       0617
*               GPR05P=GPR15P;      /* PASS PAB PTR                  */
         LR    GPR05P,GPR15P                                       0618
*               CALL ATCLCPTR->ATCAP37->ISTAPC37;                  0619
         L     @09,ATCLCPTR                                        0619
         L     @15,ATCAP37(,@09)                                   0619
         BALR  @14,@15                                             0619
*               GEN(NOPR  0)                                       0620
*               NOSETS NOREFS;                                     0620
         NOPR  0
*               RFY                                                0621
*                (GPR00P,                                          0621
*                 GPR01P,                                          0621
*                 GPR04P,                                          0621
*                 GPR05P,                                          0621
*                 GPR15P) UNRSTD;                                  0621
*             END;                  /* *** END OF TPQUE GENERATION 0622
*                                                            @XL03HEK*/
*           END;                    /* END FEEDBACK PROCESS          */
*     END;                          /* END FEEDBACK DISCARD          */
*   ELSE                            /* IF FEEDBACK NOT REPORTED      */
*     DO;                           /* REPORT FEEDBACK TO CTL LAYR   */
         B     @RC00601                                            0625
@RF00601 DS    0H                                                  0626
*       IF LSCTYPE=LSTYPE THEN      /* IS THIS AN LSCB?              */
         CLI   LSCTYPE(ELEMREG),X'DF'                              0626
         BNE   @RF00626                                            0626
*         DO;                       /* YES, SAVE BUFFER              */
*           FMCZF014='1'B;          /* SET RESET REPORT FLAG         */
         OI    FMCZF014(FMCBREG),B'00001000'                       0628
*           CALL IFAB000A;          /* INITIALIZE FSB                */
         BAL   @14,IFAB000A                                        0629
*           FMCZV004=ADDR(ZIBFSB);  /* SAVE RESET FSB ADDR@XL03HEK   */
         LA    @14,ZIBFSB(,BFRREG)                                 0630
         ST    @14,FMCZV004(,FMCBREG)                              0630
*         END;                      /* FEEDBACK SAVED                */
*       ELSE                        /* NOT A LSCB                    */
*         IF LCPATOP=ON THEN        /* LCPB ON ATOP?         @XL03HEK*/
         B     @RC00626                                            0632
@RF00626 TM    LCPATOP(ELEMREG),B'00000001'                        0632
         BNO   @RF00632                                            0632
*           DO;                     /* YES                   @XL03HEK*/
*             CALL IFAB000I;        /* DEALLOC BUFFERS       @XL03HEK*/
         BAL   @14,IFAB000I                                        0634
*             ZCRNXTEL=ON;          /* SET ON LCPB DEALL     @XL03HEK*/
         L     @14,RPHCRR(,RPHREG)                                 0635
         L     @14,CRACRR(,@14)                                    0635
         OI    ZCRNXTEL(@14),B'00010000'                           0635
*           END;                    /*                       @XL03HEK*/
*         ELSE                      /* LCPB NOT ON ATOP      @XL03HEK*/
*           DO;                     /* PROCESS FEEDBACK NOW          */
         B     @RC00632                                            0637
@RF00632 DS    0H                                                  0638
*             CALL IFAB000A;        /* INITIALIZE FSB                */
         BAL   @14,IFAB000A                                        0638
*             CALL IFAB000F;        /* QUEUE FSB TO CLIP             */
         BAL   @14,IFAB000F                                        0639
*           END;                    /* FEEDBACK PROCESSED            */
*     END;                          /* END FEEDBACK REPORTER         */
*                                                                  0641
@RC00632 DS    0H                                                  0641
@RC00626 DS    0H                                                  0642
*   /*****************************************************************/
*   /*                                                               */
*   /* SEGMENT(SEG000D)FINISH                                        */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0642
*   DO;                                                            0642
@RC00601 DS    0H                                                  0643
*     GOTO SEG000D#;                                               0643
         B     SEG000D#                                            0643
*SEG000D@:                                                         0644
*   END;                                                           0644
*                                                                  0645
*/********************************************************************/
*/*                                                                  */
*/* SUBROUTINE-                                                      */
*/*      IFAB000F                                                    */
*/*                                                                  */
*/* FUNCTION-                                                        */
*/*      QUEUE FSB TO CONTROL LAYER INBOUND PAB.                     */
*/*                                                                  */
*/********************************************************************/
*                                                                  0645
*IFAB000F:                                                         0645
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0645
         B     @PB00004                                            0645
IFAB000F DS    0H                                                  0646
*   RFY                                                            0646
*     LNKREG RSTD;                  /* TO SAVE RETURN ADDRESS        */
*   ZCRSVF7=LNKREG;                 /* SAVE RETURN ADDRESS           */
         L     @09,RPHCRR(,RPHREG)                                 0647
         L     @09,CRACRR(,@09)                                    0647
         ST    LNKREG,ZCRSVF7(,@09)                                0647
*   RFY                                                            0648
*     LNKREG UNRSTD;                /* SAVED                         */
*/*  TPQUE (ADDR(ZIBFSB),FMCPAB2) NORM                               */
*                                                                  0649
*   DO;                                                            0649
*     RFY                                                          0650
*      (GPR00P,                                                    0650
*       GPR01P,                                                    0650
*       GPR04P,                                                    0650
*       GPR05P,                                                    0650
*       GPR15P) RSTD;                                              0650
*     GEN REFS(GPR01P) SETS(RPHWORK)(STM GPR02P,GPR08P,RPHWORK(GPR01P))
*         ;                                                        0651
         STM GPR02P,GPR08P,RPHWORK(GPR01P)
*     GPR00P=0;                                                    0652
         SLR   GPR00P,GPR00P                                       0652
*     GPR15P=ADDR(FMCPAB2);         /* HOLD PAB PTR                  */
         LA    GPR15P,FMCPAB2(,FMCBREG)                            0653
*     GPR04P=ADDR(ZIBFSB);          /* WORK ELE PTR                  */
         LA    GPR04P,ZIBFSB(,BFRREG)                              0654
*     GPR05P=GPR15P;                /* PASS PAB PTR                  */
         LR    GPR05P,GPR15P                                       0655
*     CALL ATCLCPTR->ATCAP37->ISTAPC37;                            0656
         L     @09,ATCLCPTR                                        0656
         L     @15,ATCAP37(,@09)                                   0656
         BALR  @14,@15                                             0656
*     GEN(NOPR  0)                                                 0657
*     NOSETS NOREFS;                                               0657
         NOPR  0
*     RFY                                                          0658
*      (GPR00P,                                                    0658
*       GPR01P,                                                    0658
*       GPR04P,                                                    0658
*       GPR05P,                                                    0658
*       GPR15P) UNRSTD;                                            0658
*   END;                            /* *** END OF TPQUE GENERATION   */
*   RFY                                                            0660
*     LNKREG RSTD;                  /* TO RESTORE RETURN ADDRESS     */
*   LNKREG=ZCRSVF7;                 /* RESTORE RETURN ADDRESS        */
         L     @09,RPHCRR(,RPHREG)                                 0661
         L     @09,CRACRR(,@09)                                    0661
         L     LNKREG,ZCRSVF7(,@09)                                0661
*   RFY                                                            0662
*     LNKREG UNRSTD;                /* RESTORED                      */
*   END IFAB000F;                   /* END SUBROUTINE                */
@EL00004 DS    0H                                                  0663
@EF00004 DS    0H                                                  0663
@ER00004 BR    @14                                                 0663
@PB00004 DS    0H                                                  0664
*   GEN NODEFS NOREFS NOSETS(EJECT);/*                       @XL03HEK*/
         EJECT
*                                                                  0665
*/********************************************************************/
*/*                                                                  */
*/* IFAB000G: THIS ROUTINE DEQUEUES THE NEXT (OLDEST) ELEMENT FROM   */
*/*           THE FMCB WAITQ. THE ELEMENT ADDRESS IS RETURNED IN     */
*/*           ELEMREG.                                               */
*/*           NOTE: THE S/D CODE FOR IFAB000G IS: -------->  @XL03HEK*/
*/*                                                                  */
*/********************************************************************/
*                                                                  0665
*IFAB000G:                                                         0665
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0665
         B     @PB00005                                            0665
IFAB000G DS    0H                                                  0666
*   RFY                                                            0666
*     LNKREG RSTD;                                                 0666
*   ZCRSVF8=LNKREG;                 /* SAVE RETURN ADDRESS           */
         L     @09,RPHCRR(,RPHREG)                                 0667
         L     @09,CRACRR(,@09)                                    0667
         ST    LNKREG,ZCRSVF8(,@09)                                0667
*   RFY                                                            0668
*     LNKREG UNRSTD;                                               0668
*                                                                  0668
*/*      REMOVE OLDEST ELEMENT FROM FMCB WAITQ                       */
*/* TPDEQ (,FMCLCPBQ) RETPTR(ELEMREG)                                */
*                                                                  0669
*   DO;                             /* BEGIN TPDEQ CODE GENERATION   */
*     RFY                                                          0670
*      (GPR00P,                                                    0670
*       GPR01P,                                                    0670
*       GPR14P,                                                    0670
*       GPR15P) RSTD;                                              0670
*     GPR15P=ADDR(FMCLCPBQ);        /* ADDRESS QUEUE POINTER         */
         LA    GPR15P,FMCLCPBQ(,FMCBREG)                           0671
*     GPR14P=GPR15P->PABWEQA×FMZCA020;                             0672
         L     @09,@CF00850                                        0672
         L     GPR14P,PABWEQA(,GPR15P)                             0672
         OR    GPR14P,@09                                          0672
*     IF GPR14P=FMZCA020 THEN                                      0673
         CLR   GPR14P,@09                                          0673
         BE    @RT00673                                            0673
*       ;                                                          0674
*     ELSE                                                         0675
*       DO;                                                        0675
*FMZL1066:                                                         0676
*         ;                                                        0676
FMZL1066 DS    0H                                                  0677
*         DO WHILE(GPR14P->WKECHAIN^=FMZCA020);                    0677
         B     @DE00677                                            0677
@DL00677 DS    0H                                                  0678
*           GPR15P=ADDR(GPR14P->WKECHAIN);                         0678
         LA    GPR15P,WKECHAIN(,GPR14P)                            0678
*           GPR14P=GPR15P->PABWEQA;                                0679
         L     GPR14P,PABWEQA(,GPR15P)                             0679
*         END;                                                     0680
@DE00677 L     @09,@CF00850                                        0680
         CL    @09,WKECHAIN(,GPR14P)                               0680
         BNE   @DL00677                                            0680
*         GPR00P=FMZCA020;                                         0681
         LR    GPR00P,@09                                          0681
*         CS(GPR14P,GPR00P,GPR15P->PABWEQA);                       0682
         CS    GPR14P,@00,PABWEQA(GPR15P)                          0682
*         BC(7,FMZL1066);                                          0683
         BC    7,FMZL1066                                          0683
*         GPR14P->WKECHAIN=0;                                      0684
         SLR   @09,@09                                             0684
         ST    @09,WKECHAIN(,GPR14P)                               0684
*       END;                                                       0685
*ISTA0066:                                                         0686
*     ;                                                            0686
@RT00673 DS    0H                                                  0686
ISTA0066 DS    0H                                                  0687
*     GPR14P=GPR14P&FMZCB020;                                      0687
         N     GPR14P,@CF00848                                     0687
*     ELEMREG=GPR14P;                                              0688
         LR    ELEMREG,GPR14P                                      0688
*     RFY                                                          0689
*      (GPR00P,                                                    0689
*       GPR01P,                                                    0689
*       GPR14P,                                                    0689
*       GPR15P) UNRSTD;                                            0689
*   END;                            /* END TPDEQ GENERATION          */
*   RFY                                                            0691
*     LNKREG RSTD;                                                 0691
*   LNKREG=ZCRSVF8;                 /* RESTORE RETURN ADDRESS        */
         L     @09,RPHCRR(,RPHREG)                                 0692
         L     @09,CRACRR(,@09)                                    0692
         L     LNKREG,ZCRSVF8(,@09)                                0692
*   RFY                                                            0693
*     LNKREG UNRSTD;                                               0693
*   END IFAB000G;                                                  0694
@EL00005 DS    0H                                                  0694
@EF00005 DS    0H                                                  0694
@ER00005 BR    @14                                                 0694
*                                                                  0695
*/********************************************************************/
*/*                                                                  */
*/* PROCEDURE-                                               @XL03HEK*/
*/*      IFAB000H                                            @XL03HEK*/
*/*                                                                  */
*/* FUNCTION-                                                        */
*/*      THIS ROUTINE PROCESSES THE SITUATION WHEN A RESET   @XL03HEK*/
*/*      COMMAND IS RESET OR WHEN DISCONNECT IS IN PROGRESS  @XL03HEK*/
*/*      AND FEEDBACK FOR A DISCONNECT IS RECEIVED.          @XL03HEK*/
*/*      (1) IF A RESET COMMAND IS BEING RESET, THEN THE     @XL03HEK*/
*/*          RESET COUNT IN THE FMCB IS DECREMENTED, AND     @XL03HEK*/
*/*          THE RESET LCPB IS CHECKED TO DETERMINE IF IT    @XL03HEK*/
*/*          IS ON THE ATOP. IF SO, THE LCPB IS MARKED FOR   @XL03HEK*/
*/*          DEALLOCATION AND ITS BUFFERS ARE DEALLOCATED.   @XL03HEK*/
*/*          OTHERWISE, A FSB FOR A RESET OF A RESET IS      @XL03HEK*/
*/*          BUILT AND QUEUED TO THERESET LCPB FSB CHAIN. IN @XL03HEK*/
*/*          EITHER CASE, THE ZCR IS MARKED FOR LAST FSB     @XL03HEK*/
*/*          AND RETURN CODE 4 (SEND NO FEEDBACK) IS SET.    @XL03HEK*/
*/*      (2) IF DISCONNECT IS IN PROGRESS AND THE PRESENT    @XL03HEK*/
*/*          COMMAND IS DISCONNECT, THE RESET LCPB IS MARKED @XL03HEK*/
*/*          FOR DEALLOCATION IF IT IS ON THE ATOP. ITS      @XL03HEK*/
*/*          BUFFERS ARE DEALLOCATED, THE ZCR IS MARKED LAST @XL03HEK*/
*/*          FSB, AND RETURN CODE 4 IS SET.                  @XL03HEK*/
*/*      IN ANY OTHER CONDITION, RETURN CODE 0 (SEND         @XL03HEK*/
*/*      FEEDBACK) IS SET.                                   @XL03HEK*/
*/*                                                                  */
*/********************************************************************/
*                                                                  0695
*IFAB000H:                                                         0695
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);/*                       @XL03HEK*/
IFAB000H DS    0H                                                  0696
*   RFY                                                            0696
*     LNKREG RSTD;                  /*                       @XL03HEK*/
*   ZCRSVF8=LNKREG;                 /* SAVE RETURN ADDR      @XL03HEK*/
         L     @09,RPHCRR(,RPHREG)                                 0697
         L     @09,CRACRR(,@09)                                    0697
         ST    LNKREG,ZCRSVF8(,@09)                                0697
*   RFY                                                            0698
*     LNKREG UNRSTD;                /*                       @XL03HEK*/
*   IF BDUCOMND=BCMDZ THEN                                         0699
         CLI   BDUCOMND+62(BFRREG),X'08'                           0699
         BNE   @RF00699                                            0699
*CNTLCMD:                                                          0700
*     DO;                                                          0700
CNTLCMD  DS    0H                                                  0701
*       ZCRSCANQ=ON;                /* SET CNTL CMND RESET FLAG      */
         L     @14,RPHCRR(,RPHREG)                                 0701
         L     @14,CRACRR(,@14)                                    0701
         OI    ZCRSCANQ(@14),B'00100000'                           0701
*       IF BDUMODIF=BMODZEM×        /* IF                            */
*           BDUMODIF=BMODZQM×       /* COMMAND                       */
*           BDUMODIF=BMODZIM×       /* IS                            */
*           BDUMODIF=BMODZOM×       /* A                             */
*           BDUMODIF=BMODZXO×       /* RESET                         */
*           BDUMODIF=BMODZCM×       /*                               */
*           BDUMODIF=BMODZECM THEN  /* THEN                          */
         LA    @14,62                                              0702
         ALR   @14,BFRREG                                          0702
         CLI   BDUMODIF(@14),X'41'                                 0702
         BE    @RT00702                                            0702
         CLI   BDUMODIF(@14),X'42'                                 0702
         BE    @RT00702                                            0702
         CLI   BDUMODIF(@14),X'44'                                 0702
         BE    @RT00702                                            0702
         CLI   BDUMODIF(@14),X'48'                                 0702
         BE    @RT00702                                            0702
         CLI   BDUMODIF(@14),X'43'                                 0702
         BE    @RT00702                                            0702
         CLI   BDUMODIF(@14),X'50'                                 0702
         BE    @RT00702                                            0702
         CLI   BDUMODIF(@14),X'60'                                 0702
         BNE   @RF00702                                            0702
@RT00702 DS    0H                                                  0703
*         DO;                                                      0703
*           FMCZX006=FMCZX006-1;    /* DECREMENT RESET COUNT         */
         SLR   @14,@14                                             0704
         IC    @14,FMCZX006(,FMCBREG)                              0704
         BCTR  @14,0                                               0704
         STC   @14,FMCZX006(,FMCBREG)                              0704
*           IF LCPATOP=ON THEN      /* RESET LCPB ON ATOP    @XL03HEK*/
         TM    LCPATOP(ELEMREG),B'00000001'                        0705
         BNO   @RF00705                                            0705
*             DO;                   /* YES                   @XL03HEK*/
*               LCPFREE=ON;         /* SET ON LCPB DEALL     @XL03HEK*/
         OI    LCPFREE(ELEMREG),B'00000010'                        0707
*               CALL IFAB000I;      /* DEALLOC BUFFERS       @XL03HEK*/
         BAL   @14,IFAB000I                                        0708
*               ZCRLSTFB=ON;        /* SET LAST FSB ON       @XL03HEK*/
         L     @14,RPHCRR(,RPHREG)                                 0709
         L     @14,CRACRR(,@14)                                    0709
         OI    ZCRLSTFB(@14),B'00000100'                           0709
*               RCDREG=4;           /* RC=SEND NO FEEDBACK@XL03HEK   */
         LA    RCDREG,4                                            0710
*             END;                  /*                       @XL03HEK*/
*           ELSE                    /* LCPB NOT ON ATOP      @XL03HEK*/
*             DO;                   /*                       @XL03HEK*/
         B     @RC00705                                            0712
@RF00705 DS    0H                                                  0713
*               CALL IFAB000A;      /* GO INIT FSB                   */
         BAL   @14,IFAB000A                                        0713
*/*  TPQUE (ADDR(ZIBFSB),FSBLCPB->LSCFDBA)                           */
*                                                                  0714
*               DO;                                                0714
*                 RFY                                              0715
*                  (GPR00P,                                        0715
*                   GPR01P,                                        0715
*                   GPR02P,                                        0715
*                   GPR14P,                                        0715
*                   GPR15P) RSTD;                                  0715
*                 GEN REFS(GPR01P) SETS(RPHWORK)                   0716
*                     (STM GPR02P,GPR08P,RPHWORK(GPR01P));         0716
         STM GPR02P,GPR08P,RPHWORK(GPR01P)
*                 GPR15P=ADDR(ZIBFSB);/* GET WORK ELEM POINTER       */
         LA    GPR15P,ZIBFSB(,BFRREG)                              0717
*                 GPR14P=ADDR(FSBLCPB->LSCFDBA);/* ADDRESS PAB/QUEUE
*                                      POINTER                       */
         L     GPR14P,FSBLCPB+16(,BFRREG)                          0718
         LA    GPR14P,LSCFDBA(,GPR14P)                             0718
*                 GPR15P=GPR15P×PABWEQG1;                          0719
         O     GPR15P,@CF00850                                     0719
*                 GPR02P=GPR14P->PABWEQA;/* INITIALIZE WITH QUEUE  0720
*                                      HEADER                        */
         L     GPR02P,PABWEQA(,GPR14P)                             0720
*CMZA0070:                                                         0721
*                 ;                 /* CS FAIL TARGET                */
CMZA0070 DS    0H                                                  0722
*                 GPR00P=GPR02P;    /* SAVE QUEUE CONTENTS           */
         LR    GPR00P,GPR02P                                       0722
*                 GPR15P->PABCHAIN=GPR02P×PABWEQG1;/* FORWARD CHAIN
*                                      WORK ELEMENT                  */
         LR    @09,GPR02P                                          0723
         O     @09,@CF00850                                        0723
         ST    @09,PABCHAIN(,GPR15P)                               0723
*                 CS(GPR02P,GPR15P,GPR14P->PABWEQA);/* CHECK FOR END
*                                      OF QUEUE                      */
         CS    GPR02P,@15,PABWEQA(GPR14P)                          0724
*                 BC(7,CMZA0070);                                  0725
         BC    7,CMZA0070                                          0725
*                 GEN REFS(RPHWORK,GPR01P) NOSETS                  0726
*                     (LM    GPR02P,GPR08P,RPHWORK(GPR01P));       0726
         LM    GPR02P,GPR08P,RPHWORK(GPR01P)
*                 RFY                                              0727
*                  (GPR00P,                                        0727
*                   GPR01P,                                        0727
*                   GPR02P,                                        0727
*                   GPR14P,                                        0727
*                   GPR15P) UNRSTD;                                0727
*               END;                /* *** END OF TPQUE GENERATION 0728
*                                      SAVE ADDR FSB IN RESET LCPB 0728
*                                      FSB CHAIN                     */
*               ZCRLSTFB=ON;        /* SET ON LAST FSB FLAG          */
         L     @14,RPHCRR(,RPHREG)                                 0729
         L     @14,CRACRR(,@14)                                    0729
         OI    ZCRLSTFB(@14),B'00000100'                           0729
*               RCDREG=4;           /* RC= DONT SEND FEEDBACK        */
         LA    RCDREG,4                                            0730
*             END;                  /*                       @XL03HEK*/
*         END;                                                     0732
*       ELSE                                                       0733
*         RCDREG=0;                 /* CNTL COMMAND ^=RESET CMND     */
         B     @RC00702                                            0733
@RF00702 SLR   RCDREG,RCDREG                                       0733
*     END CNTLCMD;                                                 0734
*   ELSE                                                           0735
*NOTCNTL:                                                          0735
*     DO;                                                          0735
         B     @RC00699                                            0735
@RF00699 DS    0H                                                  0735
NOTCNTL  DS    0H                                                  0736
*       IF(BDUCOMND=BCMDI×          /* COMMAND AN INVITE     @ZA05266*/
*           BDUCOMND=BCMDC)&        /* OR A CONTACT, AND     @ZA05266*/
*           NCBNSNA->NCBTYPE=DNTYPE&/* NEXT SCHEDULABLE NODE IS A  0736
*                                      DNCB AND              @ZA05266*/
*           NCBNSNA->DNCZX003>0     /* SESSION CNT>0         @ZA05266*/
*         THEN                                                     0736
         LA    @14,62                                              0736
         ALR   @14,BFRREG                                          0736
         CLI   BDUCOMND(@14),X'05'                                 0736
         BE    @GL00014                                            0736
         CLI   BDUCOMND(@14),X'06'                                 0736
         BNE   @RF00736                                            0736
@GL00014 L     @14,NCBNSNA(,DNCBREG)                               0736
         CLI   NCBTYPE(@14),X'05'                                  0736
         BNE   @RF00736                                            0736
         CLI   DNCZX003(@14),0                                     0736
         BNH   @RF00736                                            0736
*         NCBNSNA->DNCZX003=NCBNSNA->DNCZX003-1;/* DECREMENT SESSION
*                                      COUNT                 @ZA05266*/
         SLR   @09,@09                                             0737
         IC    @09,DNCZX003(,@14)                                  0737
         BCTR  @09,0                                               0737
         STC   @09,DNCZX003(,@14)                                  0737
*       ELSE                                                       0738
*         ;                         /*                       @ZA05266*/
@RF00736 DS    0H                                                  0739
*       ZCRSCANQ=OFF;               /* OFF RESET CMND = CNTL         */
         L     @14,RPHCRR(,RPHREG)                                 0739
         L     @14,CRACRR(,@14)                                    0739
         NI    ZCRSCANQ(@14),B'11011111'                           0739
*       IF FMCZF021=ON&             /* IF TPIOS GENERATED            */
*           BDUCOMND=BCMDD THEN     /* DISCONNECT CMND WAS RESET     */
         TM    FMCZF021(FMCBREG),B'00010000'                       0740
         BNO   @RF00740                                            0740
         CLI   BDUCOMND+62(BFRREG),X'07'                           0740
         BNE   @RF00740                                            0740
*         DO;                                                      0741
*           IF LCPATOP=ON THEN      /* LCPB ON ATOP?         @XL03HEK*/
         TM    LCPATOP(ELEMREG),B'00000001'                        0742
         BNO   @RF00742                                            0742
*             LCPFREE=ON;           /* SET ON LCPB DEALL     @XL03HEK*/
         OI    LCPFREE(ELEMREG),B'00000010'                        0743
*           ELSE                                                   0744
*             ;                     /* LCPB NOT ON ATOP      @XL03HEK*/
@RF00742 DS    0H                                                  0745
*           CALL IFAB000I;          /* DEALLOC BUFFERS       @XL03HEK*/
         BAL   @14,IFAB000I                                        0745
*           ZCRLSTFB=ON;            /* SET ON LAST FSB FLAG          */
         L     @14,RPHCRR(,RPHREG)                                 0746
         L     @14,CRACRR(,@14)                                    0746
         OI    ZCRLSTFB(@14),B'00000100'                           0746
*           RCDREG=4;               /* RC= DONT SEND FEEDBACK        */
         LA    RCDREG,4                                            0747
*         END;                                                     0748
*       ELSE                                                       0749
*         RCDREG=0;                 /* COMND ^= TPIOS GEN DISCONN    */
         B     @RC00740                                            0749
@RF00740 SLR   RCDREG,RCDREG                                       0749
*     END NOTCNTL;                                                 0750
@RC00740 DS    0H                                                  0751
*   RFY                                                            0751
*     LNKREG RSTD;                  /*                       @XL03HEK*/
@RC00699 DS    0H                                                  0752
*   LNKREG=ZCRSVF8;                 /* GET RETURN ADDR       @XL03HEK*/
         L     @09,RPHCRR(,RPHREG)                                 0752
         L     @09,CRACRR(,@09)                                    0752
         L     LNKREG,ZCRSVF8(,@09)                                0752
*   RFY                                                            0753
*     LNKREG UNRSTD;                /*                       @XL03HEK*/
*   END IFAB000H;                   /*                       @XL03HEK*/
@EL00006 DS    0H                                                  0754
@EF00006 DS    0H                                                  0754
@ER00006 BR    @14                                                 0754
*                                                                  0755
*/********************************************************************/
*/*                                                                  */
*/* PROCEDURE-                                                       */
*/*      IFAB000I                                                    */
*/*                                                                  */
*/* FUNCTION-                                                        */
*/*        THIS ROUTINE DEALLOCATES THE BUFFER POINTED TO            */
*/*        BY BFRREG THROUGH A CALL TO ISTZDFB0.                     */
*/*                                                                  */
*/*        THE S/D CODE FOR THIS ROUTINE IS: ------->        @XL03HEK*/
*/*                                                                  */
*/********************************************************************/
*                                                                  0755
*IFAB000I:                                                         0755
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0755
IFAB000I DS    0H                                                  0756
*   RFY                                                            0756
*     LNKREG RSTD;                                                 0756
*FAB000I1:                                                         0757
*   ZCRSVF9=LNKREG;                 /* SAVE RETURN ADDRESS           */
FAB000I1 L     @09,RPHCRR(,RPHREG)                                 0757
         L     @09,CRACRR(,@09)                                    0757
         ST    LNKREG,ZCRSVF9(,@09)                                0757
*   RFY                                                            0758
*     LNKREG UNRSTD;                                               0758
*   RFY                                                            0759
*     WKREGB RSTD;                  /* WORK REGISTER IN USE          */
*FAB000I2:                                                         0760
*   WKREGB=ELEMREG;                 /* SAVE POINTER TO ELEMENT       */
FAB000I2 LR    WKREGB,ELEMREG                                      0760
*   ZCRPCOD1=0;                     /* CLEAR ZCR PARAMETER FLAGS     */
         L     @14,RPHCRR(,RPHREG)                                 0761
         L     @14,CRACRR(,@14)                                    0761
         MVI   ZCRPCOD1(@14),X'00'                                 0761
*   ZCRPBUF='1'B;                   /* INDICATE BUFFER RELEASE       */
         OI    ZCRPBUF(@14),B'00000100'                            0762
*   ELEMREG=BFRREG;                 /* POINT AT BUFFER TO RELEASE    */
         LR    ELEMREG,BFRREG                                      0763
*   CALL ATCZPSVT->ZPSZDFB0;        /* CALL BUFFER RELEASE           */
         L     @14,ATCZPSVT(,VTCVTREG)                             0764
         L     @15,ZPSZDFB0(,@14)                                  0764
         BALR  @14,@15                                             0764
*   ELEMREG=WKREGB;                 /* RESTORE ELEMENT POINTER       */
         LR    ELEMREG,WKREGB                                      0765
*   RFY                                                            0766
*     WKREGB UNRSTD;                /* WORK REGISTER AVAILABLE       */
*   RFY                                                            0767
*     LNKREG RSTD;                                                 0767
*   LNKREG=ZCRSVF9;                 /* RESTORE RETURN ADDRESS        */
         L     @09,RPHCRR(,RPHREG)                                 0768
         L     @09,CRACRR(,@09)                                    0768
         L     LNKREG,ZCRSVF9(,@09)                                0768
*   RFY                                                            0769
*     LNKREG UNRSTD;                                               0769
*   END IFAB000I;                                                  0770
@EL00007 DS    0H                                                  0770
@EF00007 DS    0H                                                  0770
@ER00007 BR    @14                                                 0770
@PB00007 DS    0H                                                  0771
*                                                                  0771
*/********************************************************************/
*/*                                                                  */
*/* SEGMENT - SEG000J                                                */
*/*                                                                  */
*/* FUNCTION-                                                        */
*/*     THIS ROUTINE CHECKS FOR THE TYPE OF RESET ELEMENT.           */
*/*     IF THE ELEMENT RESET IS AN LSCB WITH A ZERO LCPB ADDRESS,    */
*/*     A FSB IS BUILT AND QUEUED TO THE CLIP. OTHERWISE, IFAB000H   */
*/*     IS CALLED TO PROCESS RESET OF A RESET OR DISCONNECT IN       */
*/*     PROGRESS WITH PRESENT COMMAND A DISCONNECT.                  */
*/*                                                                  */
*/*     THE S/D CODE FOR SEG000J IS:                         @XL03HEK*/
*/*                                                                  */
*/********************************************************************/
*/* SEGMENT(SEG000J)START                                            */
*                                                                  0771
*   DO;                                                            0771
*     GOTO SEG000J@;                                               0772
         B     SEG000J@                                            0772
*SEG000J:                                                          0773
*   END;                                                           0773
SEG000J  DS    0H                                                  0774
*   IF LSCTYPE=LSTYPE               /* IS ELEMENT A LSCB?            */
*       &LSCLCPBA=0 THEN            /* YES, IS LCPB ADDR NULL?       */
         CLI   LSCTYPE(ELEMREG),X'DF'                              0774
         BNE   @RF00774                                            0774
         L     @14,LSCLCPBA(,ELEMREG)                              0774
         LTR   @14,@14                                             0774
         BNZ   @RF00774                                            0774
*     DO;                           /* YES                           */
*       CALL IFAB000I;              /* DEALLOCATE FSB        @XM09613*/
         BAL   @14,IFAB000I                                        0776
*       ZCRLSTFB=ON;                /* MARK ZCR FOR LAST FSB COND    */
         L     @14,RPHCRR(,RPHREG)                                 0777
         L     @14,CRACRR(,@14)                                    0777
         OI    ZCRLSTFB(@14),B'00000100'                           0777
*       RCDREG=4;                   /* SET RC FOR SEND NO FEEDBACK   */
         LA    RCDREG,4                                            0778
*     END;                                                         0779
*   ELSE                            /* LCPB ADDR NOT 0               */
*     CALL IFAB000H;                /* CHECK FOR RESET CNTRL CMND    */
         B     @RC00774                                            0780
@RF00774 BAL   @14,IFAB000H                                        0780
*/* SEGMENT(SEG000J)FINISH                                           */
*                                                                  0781
*   DO;                                                            0781
@RC00774 DS    0H                                                  0782
*     GOTO SEG000J#;                                               0782
         B     SEG000J#                                            0782
*SEG000J@:                                                         0783
*   END;                                                           0783
*                                                                  0783
SEG000J@ DS    0H                                                  0784
*/* TPEPILOG                                                         */
*                                                                  0784
*   GEN(PRINT OFF);                                                0784
         PRINT OFF
*/* TEMPLATE FOR CHAIN FIELD OF WORK ELEMENT */                    0785
*DCL  1  ISTWKE BDY(WORD) BASED(WKEPTR),                           0785
*        2  * CHAR(4),                 /* SPACE                       *
*        2  WKECHAIN PTR(31),          /* CHAIN POINTER               *
*           3 WKEFLAGS BIT(8),         /* FLAGS                       *
*             4 WKEGATE  BIT(1),       /* GATE BIT                    *
*             4 *        BIT(7),       /* RESERVED                    *
*           3 WKECHNGP PTR(24);        /* PTR ADDRESS                 *
*   DCL                                                            0786
*     ISTAPC34 ENTRY BASED(ATCAP34) VALRG(*);/* RESET ROUTINE        */
*   DCL                                                            0787
*     ISTAPC37 ENTRY BASED(ATCAP37) VALRG(*);/* TPQUE ROUTINE        */
*   GEN(PRINT ON);                                                 0788
*                                                                  0788
         PRINT ON
*/* END OF TPEPILOG                                                  */
*                                                                  0789
*   END ISTZIFAB                    /*                       @XL03HEK*/
*                                                                  0789
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */
*/*%INCLUDE SYSLIB  (CVT     )                                       */
*                                                                  0789
*       ;                                                          0789
@EL00001 DS    0H                                                  0789
@EF00001 DS    0H                                                  0789
@ER00001 BR    @14                                                 0789
@DATA    DS    0H
@CH02866 DC    H'10'
@CH02032 DC    XL2'0007'
@DATD    DSECT
         DS    0F
ISTZIFAB CSECT
         DS    0F
@CF01002 DC    F'16'
@CF00848 DC    XL4'7FFFFFFF'
@CF00850 DC    XL4'80000000'
@CF03660 DC    XL4'00FFFFFF'
@DATD    DSECT
         DS    0D
CVTPTR   DS    A
LCPBPTR  DS    A
FMCBPTR  DS    A
FSBPTR   DS    A
BDUPTR   DS    A
BTUPTR   DS    A
DNCBPTR  DS    A
WKEPTR   DS    A
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA
@ENDDATD EQU   *
ISTZIFAB CSECT
         DS    0F
@SIZDATD DC    AL1(0)
         DC    AL3(@ENDDATD-@DATD)
         DS    0D
FMZA0030 DS    FL4
         ORG   FMZA0030
@NM00058 DC    AL1(64)
@NM00059 DC    AL3(0)
         ORG   FMZA0030+4
@CC03706 DC    C'ICAB'
@CB03658 DC    X'0E00'
@00      EQU   00                      EQUATES FOR REGISTERS 0-15
@01      EQU   01
@02      EQU   02
@03      EQU   03
@04      EQU   04
@05      EQU   05
@06      EQU   06
@07      EQU   07
@08      EQU   08
@09      EQU   09
@10      EQU   10
@11      EQU   11
@12      EQU   12
@13      EQU   13
@14      EQU   14
@15      EQU   15
GPR00P   EQU   @00
GPR01P   EQU   @01
GPR02P   EQU   @02
GPR03F   EQU   @03
GPR03P   EQU   @03
GPR04P   EQU   @04
GPR05P   EQU   @05
GPR07P   EQU   @07
GPR12P   EQU   @12
GPR13P   EQU   @13
GPR14P   EQU   @14
GPR15P   EQU   @15
RPHPTR   EQU   @01
RPHREG   EQU   @01
VTCVTREG EQU   @02
ICNCBREG EQU   @03
DNCBREG  EQU   @04
FMCBREG  EQU   @05
BFRREG   EQU   @06
ELEMREG  EQU   @07
RCVTREG  EQU   @08
WKREGB   EQU   @09
CDREG    EQU   @12
SVREG    EQU   @13
LNKREG   EQU   @14
RCDREG   EQU   @15
GPR00F   EQU   @00
GPR01F   EQU   @01
GPR02F   EQU   @02
GPR04F   EQU   @04
GPR05F   EQU   @05
GPR06F   EQU   @06
GPR06P   EQU   @06
GPR07F   EQU   @07
GPR08F   EQU   @08
GPR08P   EQU   @08
GPR09F   EQU   @09
GPR09P   EQU   @09
GPR10F   EQU   @10
GPR10P   EQU   @10
GPR11F   EQU   @11
GPR11P   EQU   @11
GPR12F   EQU   @12
GPR13F   EQU   @13
GPR14F   EQU   @14
GPR15F   EQU   @15
WKREGA   EQU   @00
ATCLCPTR EQU   1032
CVTMAP   EQU   0
CVTDAR   EQU   CVTMAP+72
CVTFLGS1 EQU   CVTDAR
CVTDCB   EQU   CVTMAP+116
CVTIERLC EQU   CVTMAP+144
CVTOPTA  EQU   CVTMAP+182
CVTOPTB  EQU   CVTMAP+183
CVTGTF   EQU   CVTMAP+236
CVTGTFST EQU   CVTGTF
CVTGTFS  EQU   CVTGTFST
CVTSTATE EQU   CVTGTFST
CVTTMODE EQU   CVTGTFST
CVTFORM  EQU   CVTGTFST
CVTAQAVT EQU   CVTMAP+240
CVTTCMFG EQU   CVTAQAVT
CVTVOLM2 EQU   CVTMAP+244
CVTTATA  EQU   CVTVOLM2
CVTTSKS  EQU   CVTTATA
CVTVOLF2 EQU   CVTTSKS
CVTTAT   EQU   CVTTATA+1
CVTATER  EQU   CVTMAP+248
CVTEXT1  EQU   CVTMAP+252
CVTPURG  EQU   CVTMAP+260
CVTQMSG  EQU   CVTMAP+268
CVTDMSR  EQU   CVTMAP+272
CVTRSV37 EQU   CVTDMSR
CVTDMSRF EQU   CVTRSV37
CVTERPV  EQU   CVTMAP+316
CVTINTLA EQU   CVTMAP+320
CVTAPF   EQU   CVTMAP+324
CVTEXT2  EQU   CVTMAP+328
CVTHJES  EQU   CVTMAP+332
CVTPGSIA EQU   CVTMAP+348
CVTA1F1  EQU   CVTMAP+356
CVTSYSK  EQU   CVTMAP+357
CVTVOLM1 EQU   CVTMAP+380
CVTVOLF1 EQU   CVTVOLM1
CVTATMCT EQU   CVTMAP+388
CVTXTNT1 EQU   0
CVTXTNT2 EQU   0
CVTDSSV  EQU   CVTXTNT2
CVTFLGBT EQU   CVTXTNT2+5
CVTQID   EQU   CVTXTNT2+24
CVTSHS   EQU   CVTXTNT2+40
CVTRV400 EQU   CVTXTNT2+52
CVTRV409 EQU   CVTXTNT2+53
CVTATCVT EQU   CVTXTNT2+64
CVTRV429 EQU   CVTXTNT2+84
CVTRV438 EQU   CVTXTNT2+85
CVTRV457 EQU   CVTXTNT2+112
CVTRV466 EQU   CVTXTNT2+113
CVTFIX   EQU   0
CVTRELNO EQU   CVTFIX+252
ISTRPH   EQU   0
RPHCNTL  EQU   ISTRPH
RPHFLAGS EQU   RPHCNTL+2
RPHAPTYP EQU   RPHFLAGS
RPHFSTLC EQU   RPHFLAGS
RPHFLGB  EQU   RPHCNTL+3
RPHRPHA  EQU   ISTRPH+4
RPHTSKID EQU   ISTRPH+8
RPHRESMA EQU   ISTRPH+16
RPHWPFLG EQU   RPHRESMA
RPHWEA   EQU   ISTRPH+24
RPHCSPA  EQU   RPHWEA
RPHSRPRM EQU   ISTRPH+28
RPHCRR   EQU   ISTRPH+32
RPHPABQA EQU   ISTRPH+36
RPHWORK  EQU   ISTRPH+40
RPHSAVE1 EQU   RPHWORK
RPHSBITS EQU   RPHSAVE1+1
ISTPAB   EQU   0
PABWQCHN EQU   ISTPAB
PABWEQA  EQU   PABWQCHN
PABCHAIN EQU   PABWQCHN+4
PABRPHFG EQU   ISTPAB+12
PABFLAGS EQU   PABRPHFG
PABERLCK EQU   PABFLAGS
PABERRLK EQU   PABERLCK
ISTDYPAB EQU   0
ISTLOK   EQU   0
LOKCHN   EQU   ISTLOK+1
LOKCHNG  EQU   LOKCHN
@NM00007 EQU   LOKCHNG+2
ISTATCVT EQU   0
ATCCOM   EQU   ISTATCVT
ATCSTAT  EQU   ATCCOM
ATCSTAT1 EQU   ATCSTAT
ATCSTFLG EQU   ATCSTAT+1
ATCPOFLG EQU   ATCSTAT+2
ATCSTAT4 EQU   ATCSTAT+3
ATCBPDA  EQU   ATCCOM+128
ATCIOTRC EQU   ATCCOM+140
ATCTHTRC EQU   ATCIOTRC
ATCSMRS  EQU   ATCCOM+188
ATCCSMR  EQU   ISTATCVT+296
ATCSHRFG EQU   ISTATCVT+316
ATCHPGM  EQU   ISTATCVT+384
ATCVLCNT EQU   ISTATCVT+772
ATCRNO   EQU   ISTATCVT+788
ATCSOPD  EQU   ISTATCVT+792
ATCSIPD  EQU   ISTATCVT+800
ATCSECST EQU   ISTATCVT+812
ATCSTAT2 EQU   ISTATCVT+818
ATCVTBAM EQU   ISTATCVT+908
@NM00015 EQU   ATCVTBAM+3
ATCAOSM  EQU   ISTATCVT+912
ATCGSRBQ EQU   ATCAOSM+4
ATCGSRBG EQU   ATCGSRBQ
ATCAP34  EQU   ATCAOSM+32
ATCZFSVT EQU   ATCAOSM+68
ATCZPSVT EQU   ATCAOSM+72
ATCICAPP EQU   ATCAOSM+100
ATCLDAPP EQU   ATCAOSM+120
ATCDAPVT EQU   ATCAOSM+140
ATCAP37  EQU   ATCAOSM+264
ATCCRA   EQU   ATCAOSM+280
ATCCRACN EQU   ATCCRA+4
ATCSRB   EQU   ATCAOSM+288
ATCSRBCN EQU   ATCSRB+4
ATCCRPL  EQU   ATCAOSM+296
ATCRPLCN EQU   ATCCRPL+4
ATCSQAFR EQU   ATCAOSM+304
ATCORTBC EQU   ATCSQAFR+4
ATCORSRB EQU   ATCORTBC
@NM00017 EQU   ATCAOSM+332
ATCVTFLG EQU   ATCAOSM+392
ATCZFLAG EQU   ATCAOSM+588
ISTLCCW  EQU   0
LCCWOP   EQU   ISTLCCW
LCCWRWOP EQU   LCCWOP
LCCWCTL  EQU   LCCWRWOP
LCCWFLAG EQU   ISTLCCW+1
LCCWLSI  EQU   LCCWFLAG
ISTLSCB  EQU   0
LSC1WORD EQU   ISTLSCB
LSCTYPE  EQU   LSC1WORD
LSCREQTG EQU   LSC1WORD+2
LSCZRT02 EQU   LSCREQTG
LSCZRT03 EQU   LSCREQTG
LSCZRT04 EQU   LSCREQTG
LSCZRT05 EQU   LSCREQTG
LSCZRT06 EQU   LSCREQTG
LSCZRT07 EQU   LSCREQTG
LSCZMNRC EQU   LSCREQTG+1
LSCZRT08 EQU   LSCZMNRC
LSCZRT09 EQU   LSCZMNRC
LSCCHAIN EQU   ISTLSCB+4
LSCCHAI1 EQU   LSCCHAIN
LSCRUCNT EQU   ISTLSCB+8
LSCZMIRC EQU   LSCRUCNT
LSCFLGS  EQU   ISTLSCB+9
LSCSMODE EQU   LSCFLGS
LSCSEQ   EQU   ISTLSCB+10
LSCLCPBA EQU   ISTLSCB+16
LSCLCCWA EQU   ISTLSCB+20
LSCFDBA  EQU   ISTLSCB+24
ISTLCPB  EQU   0
LCPREQTG EQU   ISTLCPB+2
LCPFLAGS EQU   LCPREQTG
LCPZF001 EQU   LCPFLAGS
LCPZRT02 EQU   LCPZF001
LCPZF002 EQU   LCPFLAGS
LCPZRT03 EQU   LCPZF002
LCPZF003 EQU   LCPFLAGS
LCPZRT04 EQU   LCPZF003
LCPZF004 EQU   LCPFLAGS
LCPZRT05 EQU   LCPZF004
LCPZRT06 EQU   LCPFLAGS
LCPZRT07 EQU   LCPFLAGS
LCPMNRCD EQU   LCPREQTG+1
LCPZRT08 EQU   LCPMNRCD
LCPZRT09 EQU   LCPMNRCD
LCPCHAIN EQU   ISTLCPB+4
LCPCHAI1 EQU   LCPCHAIN
LCPRUCNT EQU   ISTLCPB+8
LCPFLAG2 EQU   ISTLCPB+9
LCPTLBPI EQU   LCPFLAG2
LCPFID0  EQU   LCPFLAG2
LCPFREE  EQU   LCPFLAG2
LCPATOP  EQU   LCPFLAG2
LCPSEQ   EQU   ISTLCPB+10
LCPCID   EQU   ISTLCPB+16
LCPFDBA  EQU   ISTLCPB+24
LCPFLG1  EQU   ISTLCPB+37
LCPFLCCW EQU   ISTLCPB+40
LCPLCCW  EQU   ISTLCPB+48
LCPPABA  EQU   LCPLCCW+4
LCPRPHA  EQU   LCPPABA
ISTDEVCH EQU   0
DEVSHCH  EQU   ISTDEVCH
DEVCHAR  EQU   DEVSHCH
DEVTCODE EQU   ISTDEVCH+1
DEVFLAGS EQU   ISTDEVCH+3
DEVFCCTL EQU   DEVFLAGS
DEVCHAR3 EQU   DEVFLAGS
ISTPROCD EQU   0
PROPROC  EQU   ISTPROCD
PROPROC1 EQU   PROPROC
PROPROC2 EQU   PROPROC+1
PROPROC3 EQU   PROPROC+2
PROPROC4 EQU   PROPROC+3
PROPROCS EQU   0
PROSETMS EQU   PROPROCS+1
PROSETM2 EQU   PROSETMS
PROSETM3 EQU   PROSETMS+1
PROSETM4 EQU   PROSETMS+2
ISTFMCB  EQU   0
FMCSTAT  EQU   ISTFMCB+28
FMCSTAT1 EQU   ISTFMCB+29
FMCCMDFL EQU   ISTFMCB+31
FMCCMPS1 EQU   ISTFMCB+36
FMCPAB2  EQU   ISTFMCB+80
FMCSIPA  EQU   ISTFMCB+148
FMCNXOSQ EQU   ISTFMCB+152
FMCNXCFM EQU   FMCNXOSQ
FMCNXOSC EQU   FMCNXOSQ+2
FMCSSTAT EQU   ISTFMCB+159
FMCPACE  EQU   ISTFMCB+160
FMCPACEN EQU   FMCPACE
FMCPACEM EQU   FMCPACE+1
FMCPACPC EQU   FMCPACE+2
FMCCVAL  EQU   FMCPACE+3
FMCOBCE  EQU   FMCCVAL
FMCCLEXT EQU   ISTFMCB+164
FMCRPLA  EQU   FMCCLEXT
FMCFBA   EQU   FMCCLEXT+4
FMCCMPS2 EQU   FMCCLEXT+16
FMCFLGA  EQU   FMCCMPS2
FMCFLGCL EQU   FMCCMPS2+1
FMCPSCMD EQU   FMCCMPS2+2
FMCPSTAT EQU   FMCCMPS2+3
FMCSTAT2 EQU   ISTFMCB+186
FMCMODEB EQU   ISTFMCB+189
FMCCLSEQ EQU   ISTFMCB+190
FMCRRESP EQU   ISTFMCB+195
FMCSSEGQ EQU   ISTFMCB+200
FMCFBAS  EQU   ISTFMCB+216
FMCZV002 EQU   FMCFBAS
FMCSNCTL EQU   ISTFMCB+224
FMCSCFLG EQU   FMCSNCTL
FMCVS1   EQU   ISTFMCB+232
FMCZFLAG EQU   FMCVS1
FMCZF006 EQU   FMCZFLAG
FMCZFA06 EQU   FMCZF006
FMCZF014 EQU   FMCZFLAG+2
FMCZF015 EQU   FMCZFLAG+2
FMCZF021 EQU   FMCZFLAG+3
FMCZH001 EQU   FMCVS1+4
FMCLBXM  EQU   FMCVS1+12
FMCSHEAQ EQU   FMCLBXM
FMCLCPBQ EQU   FMCVS1+16
FMCLCPAQ EQU   FMCVS1+20
FMCZX006 EQU   FMCVS1+33
FMCSEQ1  EQU   FMCVS1+34
FMCZFLG2 EQU   FMCVS1+35
FMCZV004 EQU   FMCVS1+40
FMCCVFLG EQU   FMCVS1+44
FMCFLAG  EQU   0
FMCFLGB  EQU   FMCFLAG
ISTFDB   EQU   0
FDBDATAA EQU   ISTFDB+4
FDBDATCT EQU   ISTFDB+8
FDBOFSET EQU   ISTFDB+10
ISTFSB   EQU   0
FSBFSB   EQU   ISTFSB
FSBMNRCD EQU   FSBFSB+2
FSBSFLGS EQU   FSBFSB+3
FSBFSBA  EQU   FSBFSB+4
FSBBTH   EQU   FSBFSB+8
FSBCID   EQU   FSBBTH
FSBSAF   EQU   FSBCID
FSBDAF   EQU   FSBCID+2
FSBRQTAG EQU   FSBBTH+4
FSBSEQID EQU   FSBRQTAG
FSBFLAGS EQU   FSBSEQID
FSBSEQ   EQU   FSBSEQID+1
FSBCSWST EQU   FSBBTH+6
FSBTHFLD EQU   FSBCSWST
FSBTH1   EQU   FSBTHFLD
FSBSYSRS EQU   FSBTH1
FSBTH2   EQU   FSBTHFLD+1
FSBEXTRS EQU   FSBTH2
FSBXFSTS EQU   FSBEXTRS
FSBXCODE EQU   FSBEXTRS
FSBNETRS EQU   FSBFSB+16
FSBSRCAT EQU   FSBNETRS
FSBMJRCD EQU   FSBSRCAT
FSBERC   EQU   FSBNETRS+1
FSBELI   EQU   FSBERC
FSBECI   EQU   FSBERC
FSBFBMI  EQU   FSBERC
FSBDMGRS EQU   FSBFSB+18
FSBSS1   EQU   FSBDMGRS
FSBSS2   EQU   FSBDMGRS+1
FSBLCPB  EQU   FSBFSB+20
FSBMSGID EQU   FSBLCPB
FSBLCCWA EQU   FSBFSB+24
FSBRLSTS EQU   FSBLCCWA
ISTBDU   EQU   0
BDUCOMND EQU   ISTBDU
BDUMODIF EQU   ISTBDU+1
BDUMOD1  EQU   BDUMODIF
BDUDAF   EQU   ISTBDU+2
BDUFUNC  EQU   BDUDAF
BDUCHECK EQU   BDUFUNC
BDUFLAGS EQU   BDUDAF+1
ISTBTU   EQU   0
BTUBTH   EQU   ISTBTU
BTUFID   EQU   BTUBTH
BTUDEST  EQU   BTUBTH+2
BTUSORCE EQU   BTUBTH+4
BTUREQ   EQU   BTUBTH+6
BTURQFLG EQU   BTUREQ
BTUDCF   EQU   BTUBTH+8
BTURH    EQU   BTUBTH+10
BTUBDU   EQU   ISTBTU+14
BTUSYSTR EQU   ISTBTU+18
BTUEXTR  EQU   ISTBTU+19
ISTLH    EQU   0
ISTTH    EQU   0
THFLAG1  EQU   ISTTH
THFLGA   EQU   THFLAG1
THMPF    EQU   THFLGA
THFLGB   EQU   THFLAG1+1
ISTTH2   EQU   0
TH2FLAG1 EQU   ISTTH2
TH2MPF   EQU   TH2FLAG1
ISTZIBUF EQU   0
ZIBFSM   EQU   ISTZIBUF+4
ISTZSAVE EQU   0
ZSAZSVBC EQU   ISTZSAVE
ZSAZSVMS EQU   ZSAZSVBC
ZSAZACTV EQU   ZSAZSVMS
ZSAZSVFC EQU   ISTZSAVE+4
ZSAZSVRR EQU   ISTZSAVE+8
ZSAZSVVR EQU   ISTZSAVE+12
ZSAZTRAC EQU   ISTZSAVE+36
ISTZCRR  EQU   0
ZCRCRR   EQU   ISTZCRR
ZCRFLGS1 EQU   ISTZCRR+12
ZCRFLGS2 EQU   ISTZCRR+13
ZCRSWFLD EQU   ISTZCRR+14
ZCRENDSH EQU   ZCRSWFLD
ZCRNDLCP EQU   ZCRSWFLD
ZCRRESET EQU   ZCRSWFLD
ZCRFLGS3 EQU   ISTZCRR+15
ZCRGENSW EQU   ISTZCRR+16
ZCRPFLGS EQU   ISTZCRR+17
ZCRIBPR  EQU   ISTZCRR+18
ZCR3270R EQU   ZCRIBPR
ZCRSCPSW EQU   ISTZCRR+19
ZCRPARMS EQU   ISTZCRR+24
ZCRFBPTR EQU   ZCRPARMS
ZCRDFRDA EQU   ZCRPARMS+10
ZCRPCOD1 EQU   ZCRPARMS+12
ZCRPLSBF EQU   ZCRPCOD1
ZCRPLSCB EQU   ZCRPCOD1
ZCRPBUF  EQU   ZCRPCOD1
ZCRPCOD2 EQU   ZCRPARMS+13
ZCRSVRTN EQU   ISTZCRR+56
ZCRSVF7  EQU   ZCRSVRTN+24
ZCRSVF8  EQU   ZCRSVRTN+28
ZCRSVF9  EQU   ZCRSVRTN+32
ZCRWKARA EQU   ISTZCRR+156
ZCRSCANQ EQU   ISTZCRR+180
ZCRNXTEL EQU   ISTZCRR+180
ZCRLSTFB EQU   ISTZCRR+180
ZCRCIDSV EQU   ISTZCRR+192
ZCRAUDIT EQU   ISTZCRR+440
ZCRENTER EQU   ZCRAUDIT+5
ZCREICAB EQU   ZCRENTER+10
ZCRLCPB  EQU   ISTZCRR+480
ZCRRHRU  EQU   ZCRLCPB
ISTPFCRR EQU   0
PFCCRR   EQU   ISTPFCRR
PFCCRRID EQU   PFCCRR
PFCCRRLN EQU   PFCCRR+2
PFCHDR   EQU   ISTPFCRR+4
PFCCRRO  EQU   PFCHDR
PFCFRRO  EQU   PFCHDR+4
ISTCFCRR EQU   0
CFCAUDIT EQU   ISTCFCRR
CFCNTRD  EQU   CFCAUDIT
CFCCRT   EQU   CFCAUDIT+1
ISTASCRR EQU   0
ASCFLAGS EQU   ISTASCRR+16
ASCFLG1  EQU   ASCFLAGS
ASCFLG2  EQU   ASCFLAGS+2
ASCFLG3  EQU   ASCFLAGS+4
ASCUSRGS EQU   ISTASCRR+28
ISTAPCRR EQU   0
APCATFLG EQU   ISTAPCRR+16
APCRFLG  EQU   ISTAPCRR+18
APCSAVE  EQU   ISTAPCRR+44
APCCOMF  EQU   ISTAPCRR+116
APCCOMF1 EQU   APCCOMF
APC31FLG EQU   ISTAPCRR+132
APC52FLG EQU   ISTAPCRR+133
APC53FLG EQU   ISTAPCRR+134
APC54FLG EQU   ISTAPCRR+135
APC57FLG EQU   ISTAPCRR+136
ISTCRA   EQU   0
CRABASIC EQU   ISTCRA
CRAHDR   EQU   CRABASIC
CRACRR   EQU   CRAHDR
CRALKACT EQU   CRABASIC+8
CRASVC   EQU   ISTCRA+848
CRABUFA  EQU   CRASVC+68
ISTNCB   EQU   0
NCBTYPE  EQU   ISTNCB
NCBNSNA  EQU   ISTNCB+12
NCBFLAGS EQU   ISTNCB+24
NCBFRAS  EQU   NCBFLAGS+1
NCBFTRIO EQU   NCBFRAS
NCBFLAG1 EQU   NCBFLAGS+2
NCBDEVCH EQU   ISTNCB+36
ISTDNCB  EQU   0
DNCNCB   EQU   ISTDNCB
DNCOS    EQU   ISTDNCB+56
DNCZFLGS EQU   DNCOS
DNCBSCED EQU   DNCOS+2
DNCACIP  EQU   DNCBSCED+1
DNCZX003 EQU   DNCOS+16
ISTZPSVT EQU   0
ZPSZDFB0 EQU   ISTZPSVT+16
ZPSZDFQR EQU   ISTZPSVT+80
ISTZFSVT EQU   0
ZFSZEFBB EQU   ISTZFSVT
ZFSZEABB EQU   ZFSZEFBB
ZFSZEFAB EQU   ISTZFSVT+4
ZFSZEAAB EQU   ZFSZEFAB
ISTZRCVT EQU   0
ZRCZIFIB EQU   ISTZRCVT+92
ZRCZIFSB EQU   ISTZRCVT+100
ISTWKE   EQU   0
WKECHAIN EQU   ISTWKE+4
WKEFLAGS EQU   WKECHAIN
FMZL0030 EQU   0
ISTAPC37 EQU   0
ISTAPC34 EQU   0
ISTZDFB0 EQU   0
ISTZDFQR EQU   0
ISTZEFBB EQU   0
ISTZIFIB EQU   0
ISTZIFSB EQU   0
ZIBSRB   EQU   0
CVTS01   EQU   CVTPGSIA
CVTLPDIA EQU   CVTS01+12
CVTDIRST EQU   CVTLPDIA
CVTSLIDA EQU   CVTS01+24
CVTCTLFG EQU   CVTS01+50
CVTRV210 EQU   CVTS01+424
CVTRV219 EQU   CVTS01+425
CVTRV228 EQU   CVTS01+426
CVTRV237 EQU   CVTS01+427
CVTMFRTR EQU   CVTS01+452
CVTRV262 EQU   CVTS01+468
CVTRV271 EQU   CVTS01+469
CVTRV280 EQU   CVTS01+470
CVTRV289 EQU   CVTS01+471
CVTGSDA  EQU   CVTS01+600
LCPZTIE  EQU   LCPCID
LCPZSNAM EQU   LCPZTIE+8
FSBCOMBN EQU   FSBNETRS
FSBRHFLD EQU   FSBCOMBN+1
FSBRH3   EQU   FSBRHFLD+2
FSBLDFLG EQU   FSBRH3
@NM00032 EQU   FSBRQTAG
ZIBDIO   EQU   ZIBFSM
ZIBCCW2  EQU   ZIBDIO+8
ZIBCPTCC EQU   ZIBCCW2
ZIBAIO   EQU   ISTZIBUF
ZIBAIOCM EQU   ZIBAIO
ZIBFDBZ  EQU   ZIBAIOCM
ZIBFIB   EQU   ZIBAIO+16
ZIBFSB   EQU   ZIBFIB
ZIBMDREC EQU   ZIBFSB+4
ZIBMDRIN EQU   ZIBFSB+28
ZIBBTU   EQU   ZIBFIB+32
ZIBFDBS  EQU   ZIBBTU
@NM00036 EQU   ZIBBTU+12
ZIBFID1  EQU   @NM00036+1
ZIBFITXT EQU   ZIBFID1
ZIBSIB   EQU   ZIBFIB
ZIBREC   EQU   ZIBMDRIN
ZIBRECPL EQU   ZIBREC
ZIBRECHD EQU   ZIBRECPL
ZIBRECRS EQU   ZIBREC+8
ZIBRECDT EQU   ZIBREC+10
ZIBMDRRC EQU   ZIBMDREC
ZIBRCPL  EQU   ZIBMDRRC
ZIBRCDT  EQU   ZIBMDRRC+24
@NM00038 EQU   ZIBBTU
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS
ZIBTH2   EQU   @NM00038+4
ZIBLH    EQU   @NM00038
ZIBRCTXT EQU   ZIBMDRRC+36
ZIBRCRID EQU   ZIBRCDT+10
ZIBRCNAM EQU   ZIBRCDT+2
ZIBRCUA  EQU   ZIBRCDT
ZIBRCPUI EQU   ZIBRCPL+20
ZIBRCPUN EQU   ZIBRCPL+16
ZIBRCTIM EQU   ZIBRCPL+12
ZIBRCDAT EQU   ZIBRCPL+8
ZIBRCRS1 EQU   ZIBRCPL+6
ZIBRCSID EQU   ZIBRCPL+5
ZIBRCID  EQU   ZIBRCPL+4
ZIBRCSW  EQU   ZIBRCPL+2
ZIBRCSYR EQU   ZIBRCPL+1
ZIBRCL   EQU   ZIBRCPL
ZIBRECTX EQU   ZIBREC+22
ZIBRECID EQU   ZIBRECDT+10
ZIBRECNA EQU   ZIBRECDT+2
ZIBRECUA EQU   ZIBRECDT
ZIBRECSV EQU   ZIBRECRS
ZIBRECDA EQU   ZIBRECPL+4
ZIBRECSI EQU   ZIBRECHD+3
ZIBRECDV EQU   ZIBRECHD+2
ZIBRECFL EQU   ZIBRECHD+1
ZIBRECTY EQU   ZIBRECHD
ZIBTEXT  EQU   ZIBSIB+4
ZIBRSV04 EQU   ZIBSIB
ZIBTEXT2 EQU   ZIBFITXT
ZIBTEXT1 EQU   ZIBFIB+52
@NM00037 EQU   @NM00036
@NM00035 EQU   ZIBMDREC
@NM00034 EQU   ZIBFSB
ZIBLNG2  EQU   ZIBAIOCM+14
ZIBRSV03 EQU   ZIBAIOCM+13
ZIBWKBYT EQU   ZIBAIOCM+12
ZIBCPNPK EQU   ZIBCCW2+6
ZIBRSV02 EQU   ZIBCCW2+5
ZIBCPTPF EQU   ZIBCCW2+4
ZIBCPTCA EQU   ZIBCCW2+1
ZIBCPNPC EQU   ZIBCPTCC
ZIBCPRDK EQU   ZIBDIO+6
ZIBRSV01 EQU   ZIBDIO+5
ZIBCPRDF EQU   ZIBDIO+4
ZIBCPTXA EQU   ZIBDIO+1
ZIBCPRDC EQU   ZIBDIO
FSBRT0B  EQU   @NM00032+1
FSBRT0A  EQU   @NM00032+1
FSBRT09  EQU   @NM00032+1
FSBRT08  EQU   @NM00032+1
FSBRT07  EQU   @NM00032
FSBRT06  EQU   @NM00032
FSBRT05  EQU   @NM00032
FSBRT04  EQU   @NM00032
FSBRT03  EQU   @NM00032
FSBRT02  EQU   @NM00032
FSBRT01  EQU   @NM00032
FSBRT00  EQU   @NM00032
FSBLDCUF EQU   FSBLDFLG
FSBLDSIF EQU   FSBLDFLG
FSBLDSOF EQU   FSBLDFLG
FSBLDEBF EQU   FSBLDFLG
FSBLDBBF EQU   FSBLDFLG
FSBLDFME EQU   FSBLDFLG
FSBLDSCF EQU   FSBLDFLG
FSBLDRMF EQU   FSBLDFLG
FSBRH2   EQU   FSBRHFLD+1
FSBRH1   EQU   FSBRHFLD
FSBALIGN EQU   FSBCOMBN
LCPZTRV4 EQU   LCPZSNAM+4
LCPZTRV1 EQU   LCPZSNAM
LCPZSNA  EQU   LCPZTIE+4
LCPZFMCA EQU   LCPZTIE
CVTRV628 EQU   CVTS01+728
CVTRV627 EQU   CVTS01+724
CVTRV626 EQU   CVTS01+720
CVTRV625 EQU   CVTS01+716
CVTRV624 EQU   CVTS01+712
CVTRV623 EQU   CVTS01+708
CVTRV622 EQU   CVTS01+704
CVTRV621 EQU   CVTS01+700
CVTRV620 EQU   CVTS01+696
CVTRV619 EQU   CVTS01+692
CVTRV618 EQU   CVTS01+688
CVTRV617 EQU   CVTS01+684
CVTRV616 EQU   CVTS01+680
CVTRV615 EQU   CVTS01+676
CVTRV614 EQU   CVTS01+672
CVTRV613 EQU   CVTS01+668
CVTTCASP EQU   CVTS01+664
CVT0PT03 EQU   CVTS01+660
CVT0PT0E EQU   CVTS01+656
CVTIRM   EQU   CVTS01+652
CVTCGK   EQU   CVTS01+648
CVTRV607 EQU   CVTS01+644
CVTRV606 EQU   CVTS01+640
CVTRV605 EQU   CVTS01+636
CVTRV604 EQU   CVTS01+632
CVTEFF02 EQU   CVTS01+628
CVTCBBR  EQU   CVTS01+624
CVTSSCR  EQU   CVTS01+620
CVTEVENT EQU   CVTS01+616
CVTCRCA  EQU   CVTS01+612
CVTTPIO  EQU   CVTS01+608
CVTADV   EQU   CVTS01+604
CVTGSDAB EQU   CVTGSDA
CVTQV3   EQU   CVTS01+596
CVTQV2   EQU   CVTS01+592
CVTQV1   EQU   CVTS01+588
CVTRPT   EQU   CVTS01+584
CVTSSRB  EQU   CVTS01+580
CVTCSDRL EQU   CVTS01+576
CVTEXP1  EQU   CVTS01+572
CVTRMPMT EQU   CVTS01+568
CVTRMPTT EQU   CVTS01+564
CVTVPSA  EQU   CVTS01+560
CVTVSTOP EQU   CVTS01+556
CVTGTFR8 EQU   CVTS01+552
CVTQUIT  EQU   CVTS01+548
CVTVACR  EQU   CVTS01+544
CVTWTCB  EQU   CVTS01+540
CVTSTPRS EQU   CVTS01+536
CVT0PT02 EQU   CVTS01+532
CVTDARCM EQU   CVTS01+528
CVTIRECM EQU   CVTS01+524
CVTJRECM EQU   CVTS01+520
CVTVEMS0 EQU   CVTS01+516
CVTSPFRR EQU   CVTS01+512
CVTRLSTG EQU   CVTS01+508
CVT0TC0A EQU   CVTS01+504
CVTGMBR  EQU   CVTS01+500
CVTLFRM  EQU   CVTS01+496
CVTRMBR  EQU   CVTS01+492
CVTVIOP  EQU   CVTS01+488
CVTRV307 EQU   CVTS01+486
CVTRV306 EQU   CVTS01+484
CVTRV305 EQU   CVTS01+482
CVTRV304 EQU   CVTS01+480
CVTRV303 EQU   CVTS01+478
CVTRV302 EQU   CVTS01+476
CVTTRCA  EQU   CVTS01+472
CVTRV297 EQU   CVTRV289
CVTRV296 EQU   CVTRV289
CVTRV295 EQU   CVTRV289
CVTRV294 EQU   CVTRV289
CVTRV293 EQU   CVTRV289
CVTRV292 EQU   CVTRV289
CVTRV291 EQU   CVTRV289
CVTRV290 EQU   CVTRV289
CVTRV288 EQU   CVTRV280
CVTRV287 EQU   CVTRV280
CVTRV286 EQU   CVTRV280
CVTRV285 EQU   CVTRV280
CVTRV284 EQU   CVTRV280
CVTRV283 EQU   CVTRV280
CVTRV282 EQU   CVTRV280
CVTRV281 EQU   CVTRV280
CVTRV279 EQU   CVTRV271
CVTRV278 EQU   CVTRV271
CVTRV277 EQU   CVTRV271
CVTRV276 EQU   CVTRV271
CVTRV275 EQU   CVTRV271
CVTRV274 EQU   CVTRV271
CVTRV273 EQU   CVTRV271
CVTRV272 EQU   CVTRV271
CVTRV270 EQU   CVTRV262
CVTRV269 EQU   CVTRV262
CVTRV268 EQU   CVTRV262
CVTRV267 EQU   CVTRV262
CVTRV266 EQU   CVTRV262
CVTRV265 EQU   CVTRV262
CVTRV264 EQU   CVTRV262
CVTRV263 EQU   CVTRV262
CVTVFP   EQU   CVTS01+464
CVTVSI   EQU   CVTS01+460
CVTVPSIB EQU   CVTS01+456
CVTMFACT EQU   CVTMFRTR
CVTMFCTL EQU   CVTS01+448
CVTPVBP  EQU   CVTS01+444
CVTPWI   EQU   CVTS01+440
CVTRV254 EQU   CVTS01+438
CVTRV253 EQU   CVTS01+436
CVTRV252 EQU   CVTS01+434
CVTRV251 EQU   CVTS01+433
CVTRV250 EQU   CVTS01+432
CVTRV249 EQU   CVTS01+431
CVTRV248 EQU   CVTS01+430
CVTRV247 EQU   CVTS01+429
CVTRV246 EQU   CVTS01+428
CVTRV245 EQU   CVTRV237
CVTRV244 EQU   CVTRV237
CVTRV243 EQU   CVTRV237
CVTRV242 EQU   CVTRV237
CVTRV241 EQU   CVTRV237
CVTRV240 EQU   CVTRV237
CVTRV239 EQU   CVTRV237
CVTRV238 EQU   CVTRV237
CVTRV236 EQU   CVTRV228
CVTRV235 EQU   CVTRV228
CVTRV234 EQU   CVTRV228
CVTRV233 EQU   CVTRV228
CVTRV232 EQU   CVTRV228
CVTRV231 EQU   CVTRV228
CVTRV230 EQU   CVTRV228
CVTRV229 EQU   CVTRV228
CVTRV227 EQU   CVTRV219
CVTRV226 EQU   CVTRV219
CVTRV225 EQU   CVTRV219
CVTRV224 EQU   CVTRV219
CVTRV223 EQU   CVTRV219
CVTRV222 EQU   CVTRV219
CVTRV221 EQU   CVTRV219
CVTRV220 EQU   CVTRV219
CVTRV218 EQU   CVTRV210
CVTRV217 EQU   CVTRV210
CVTRV216 EQU   CVTRV210
CVTRV215 EQU   CVTRV210
CVTRV214 EQU   CVTRV210
CVTRV213 EQU   CVTRV210
CVTRV212 EQU   CVTRV210
CVTRV211 EQU   CVTRV210
CVTLCCAT EQU   CVTS01+420
CVTPCCAT EQU   CVTS01+416
CVTIPCRP EQU   CVTS01+412
CVTIPCRI EQU   CVTS01+408
CVTIPCDS EQU   CVTS01+404
CVTAIDVT EQU   CVTS01+400
CVTSSAP  EQU   CVTS01+396
CVTEHCIR EQU   CVTS01+392
CVTEHDEF EQU   CVTS01+388
CVTDAIR  EQU   CVTS01+384
CVTPERFM EQU   CVTS01+380
CVT044R2 EQU   CVTS01+376
CVTFETCH EQU   CVTS01+372
CVTRSTWD EQU   CVTS01+368
CVTSPOST EQU   CVTS01+364
CVTIOBP  EQU   CVTS01+360
CVTASMVT EQU   CVTS01+356
CVTRECRQ EQU   CVTS01+352
CVTWSAC  EQU   CVTS01+348
CVTRV149 EQU   CVTS01+344
CVTWSAL  EQU   CVTS01+340
CVTSPSA  EQU   CVTS01+336
CVTGLMN  EQU   CVTS01+332
CVTVEAC0 EQU   CVTS01+328
CVT062R1 EQU   CVTS01+324
CVTRPOST EQU   CVTS01+320
CVTDQIQE EQU   CVTS01+316
CVTCSD   EQU   CVTS01+312
CVTLKRMA EQU   CVTS01+308
CVTRSPIE EQU   CVTS01+304
CVTRENQ  EQU   CVTS01+300
CVTLQCB  EQU   CVTS01+296
CVTFQCB  EQU   CVTS01+292
CVTQCS01 EQU   CVTS01+288
CVTAPFT  EQU   CVTS01+284
CVTPARRL EQU   CVTS01+280
CVTVWAIT EQU   CVTS01+276
CVTGSPL  EQU   CVTS01+272
CVTLSMQ  EQU   CVTS01+268
CVTGSMQ  EQU   CVTS01+264
CVTEXPRO EQU   CVTS01+260
CVTOPCTP EQU   CVTS01+256
CVTSIC   EQU   CVTS01+252
CVTTPIOS EQU   CVTS01+248
CVTRTMS  EQU   CVTS01+244
CVTSDBF  EQU   CVTS01+240
CVTSCBP  EQU   CVTS01+236
CVTSDMP  EQU   CVTS01+232
CVTSV60  EQU   CVTS01+228
CVTRTMCT EQU   CVTS01+224
CVTASCBL EQU   CVTS01+220
CVTASCBH EQU   CVTS01+216
CVTGDA   EQU   CVTS01+212
CVTASVT  EQU   CVTS01+208
CVTVVMDI EQU   CVTS01+204
CVTAQTOP EQU   CVTS01+200
CVTIOSCS EQU   CVTS01+196
CVTSDRM  EQU   CVTS01+192
CVTOPTE  EQU   CVTS01+188
CVTSTXU  EQU   CVTS01+184
CVTQUIS  EQU   CVTS01+180
CVTPARS  EQU   CVTS01+176
CVTS1EE  EQU   CVTS01+172
CVTFRAS  EQU   CVTS01+168
CVTQSAS  EQU   CVTS01+164
CVTCRAS  EQU   CVTS01+160
CVTCRMN  EQU   CVTS01+156
CVTDELCP EQU   CVTS01+152
CVTFRECL EQU   CVTS01+148
CVTGETCL EQU   CVTS01+144
CVTBLDCP EQU   CVTS01+140
CVTAUTHL EQU   CVTS01+136
CVTSCAN  EQU   CVTS01+132
CVTRV144 EQU   CVTS01+130
CVTMAXMP EQU   CVTS01+128
CVTSTCK  EQU   CVTS01+124
CVTRV139 EQU   CVTS01+123
CVTDSSAC EQU   CVTS01+122
CVTRV513 EQU   CVTS01+121
CVTIOSPL EQU   CVTS01+120
CVTPTGT  EQU   CVTS01+116
CVTCSPIE EQU   CVTS01+112
CVTSMFEX EQU   CVTS01+108
CVTOLT0A EQU   CVTS01+104
CVTSRBRT EQU   CVTS01+100
CVTPUTL  EQU   CVTS01+96
CVTASCRL EQU   CVTS01+92
CVTASCRF EQU   CVTS01+88
CVTRV326 EQU   CVTS01+84
CVTRV325 EQU   CVTS01+80
CVTRV324 EQU   CVTS01+76
CVT0VL01 EQU   CVTS01+72
CVTSHRVM EQU   CVTS01+68
CVTRV332 EQU   CVTS01+64
CVTTAS   EQU   CVTS01+60
CVTRSCN  EQU   CVTS01+56
CVTTRAC2 EQU   CVTS01+54
CVTTRACE EQU   CVTS01+52
CVTAPG   EQU   CVTS01+51
CVTSDTRC EQU   CVTCTLFG
CVTGTRCE EQU   CVTCTLFG
CVTNOMP  EQU   CVTCTLFG
CVTRSV79 EQU   CVTCTLFG
CVTDSTAT EQU   CVTCTLFG
CVTRSV78 EQU   CVTCTLFG
CVTRV333 EQU   CVTCTLFG
CVTRV323 EQU   CVTCTLFG
CVTSPVLK EQU   CVTS01+49
CVTRSV77 EQU   CVTS01+48
CVTRV331 EQU   CVTS01+44
CVTRV330 EQU   CVTS01+40
CVTRV329 EQU   CVTS01+36
CVTRV328 EQU   CVTS01+32
CVTRV322 EQU   CVTS01+28
CVTSLID  EQU   CVTSLIDA+1
CVTSYLK  EQU   CVTSLIDA
CVTRV321 EQU   CVTS01+20
CVTRV320 EQU   CVTS01+16
CVTLPDIR EQU   CVTLPDIA+1
CVTRSV69 EQU   CVTDIRST
CVTRSV68 EQU   CVTDIRST
CVTRSV67 EQU   CVTDIRST
CVTRSV66 EQU   CVTDIRST
CVTRSV65 EQU   CVTDIRST
CVTRSV64 EQU   CVTDIRST
CVTRSV63 EQU   CVTDIRST
CVTDICOM EQU   CVTDIRST
CVTPVTP  EQU   CVTS01+8
CVTLPDSR EQU   CVTS01+4
CVTGETL  EQU   CVTS01
WKECHNGP EQU   WKECHAIN+1
@NM00061 EQU   WKEFLAGS
WKEGATE  EQU   WKEFLAGS
@NM00060 EQU   ISTWKE
ZRCZDFWB EQU   ISTZRCVT+120
ZRCZIFJB EQU   ISTZRCVT+116
ZRCZKFCB EQU   ISTZRCVT+112
ZRCZKFBB EQU   ISTZRCVT+108
ZRCZIFTB EQU   ISTZRCVT+104
ZRCZIFX0 EQU   ISTZRCVT+96
ZRCZIFAB EQU   ISTZRCVT+88
ZRCZIFGB EQU   ISTZRCVT+84
ZRCZIFHB EQU   ISTZRCVT+80
ZRCZIFBB EQU   ISTZRCVT+76
ZRCZIFCB EQU   ISTZRCVT+72
ZRCZIFDB EQU   ISTZRCVT+68
ZRCZIFEB EQU   ISTZRCVT+64
ZRCRSV01 EQU   ISTZRCVT+60
ZRCZGFBB EQU   ISTZRCVT+56
ZRCZIFQB EQU   ISTZRCVT+52
ZRCZIFNB EQU   ISTZRCVT+48
ZRCZIFOB EQU   ISTZRCVT+44
ZRCZIFMB EQU   ISTZRCVT+40
ZRCZIFKB EQU   ISTZRCVT+36
ZRCZIFLB EQU   ISTZRCVT+32
@NM00057 EQU   ISTZRCVT+28
@NM00056 EQU   ISTZRCVT+24
@NM00055 EQU   ISTZRCVT+20
@NM00054 EQU   ISTZRCVT+16
@NM00053 EQU   ISTZRCVT+12
ZRCZJF0B EQU   ISTZRCVT+8
ZRCZCFCI EQU   ISTZRCVT+4
ZRCZIF0B EQU   ISTZRCVT
ZFSZWRD4 EQU   ISTZFSVT+36
ZFSZWRD3 EQU   ISTZFSVT+32
ZFSZEFCB EQU   ISTZFSVT+28
ZFSZFFEB EQU   ISTZFSVT+24
ZFSZDFJ0 EQU   ISTZFSVT+20
ZFSZFFFB EQU   ISTZFSVT+16
ZFSZFFDB EQU   ISTZFSVT+12
ZFSZFFCB EQU   ISTZFSVT+8
ZFSZEMAB EQU   ZFSZEAAB
ZFSZEMBB EQU   ZFSZEABB
ZPSZDFPR EQU   ISTZPSVT+76
ZPSZDFXR EQU   ISTZPSVT+72
ZPSZWRD5 EQU   ISTZPSVT+68
ZPSZWRD4 EQU   ISTZPSVT+64
ZPSZDFMB EQU   ISTZPSVT+60
ZPSZDFMF EQU   ISTZPSVT+56
ZPSZDFNB EQU   ISTZPSVT+52
@NM00052 EQU   ISTZPSVT+48
ZPSZDFF0 EQU   ISTZPSVT+44
ZPSZTRTT EQU   ISTZPSVT+40
ZPSZBFOB EQU   ISTZPSVT+36
ZPSZBFMB EQU   ISTZPSVT+32
ZPSZBFZ0 EQU   ISTZPSVT+28
ZPSZBFY0 EQU   ISTZPSVT+24
ZPSZDFI0 EQU   ISTZPSVT+20
ZPSZDFH0 EQU   ISTZPSVT+12
ZPSZDFD0 EQU   ISTZPSVT+8
ZPSZDFC0 EQU   ISTZPSVT+4
ZPSZDFA0 EQU   ISTZPSVT
DNCZC001 EQU   DNCOS+40
DNCLOCK  EQU   DNCOS+36
DNCZV005 EQU   DNCOS+32
DNCZV004 EQU   DNCOS+28
DNCZV003 EQU   DNCOS+24
DNCZV002 EQU   DNCOS+21
DNCZX001 EQU   DNCOS+20
DNCZV001 EQU   DNCOS+17
DNCZV000 EQU   DNCOS+12
DNCSESCQ EQU   DNCOS+8
DNCSESIQ EQU   DNCOS+4
DNCLICP  EQU   DNCBSCED
DNCZF008 EQU   DNCZFLGS+1
DNCZPSRD EQU   DNCZFLGS+1
DNCPSOL  EQU   DNCZFLGS+1
DNCZF007 EQU   DNCZFLGS+1
DNCZF006 EQU   DNCZFLGS+1
DNCZF005 EQU   DNCZFLGS+1
DNCZF004 EQU   DNCZFLGS+1
DNCZF003 EQU   DNCZFLGS
DNCZF002 EQU   DNCZFLGS
DNCZRSCH EQU   DNCZFLGS
DNCDISC  EQU   DNCZFLGS
DNCCONT  EQU   DNCZFLGS
DNCINVIT EQU   DNCZFLGS
DNCSESS  EQU   DNCZFLGS
DNCZF001 EQU   DNCZFLGS
DNCMODE  EQU   ISTDNCB+49
DNCBHSET EQU   ISTDNCB+48
NCBRSV01 EQU   ISTNCB+46
NCBSWDAF EQU   ISTNCB+44
NCBFMCBP EQU   ISTNCB+32
NCBLTRC  EQU   ISTNCB+30
NCBRVPT1 EQU   ISTNCB+28
NCBNMLLN EQU   NCBFLAGS+3
@NM00051 EQU   NCBFLAG1
NCBFORCE EQU   NCBFLAG1
NCBTTF   EQU   NCBFLAG1
NCBRSYNC EQU   NCBFLAG1
NCBRSTRT EQU   NCBFLAG1
NCBCONF  EQU   NCBFLAG1
NCBSNAI  EQU   NCBFLAG1
NCBFLTIO EQU   NCBFTRIO
NCBCSTAT EQU   NCBFLAGS
NCBNCSL  EQU   ISTNCB+22
NCBNCBA  EQU   ISTNCB+20
NCBFMCBA EQU   ISTNCB+16
NCBTSKID EQU   ISTNCB+8
NCBRDTE  EQU   ISTNCB+4
NCBDAF   EQU   ISTNCB+2
NCBLNGTH EQU   ISTNCB+1
CRACHAIN EQU   ISTCRA+928
CRARSV02 EQU   ISTCRA+924
CRARSV01 EQU   ISTCRA+920
CRABFTBA EQU   CRABUFA
CRAMASK  EQU   CRASVC+64
CRAHSIZ  EQU   CRASVC+60
CRAASCRR EQU   CRASVC
CRAPROCR EQU   ISTCRA+312
CRAPSS   EQU   ISTCRA+160
CRARPH   EQU   ISTCRA+52
CRALAPTR EQU   CRABASIC+48
CRAL9PTR EQU   CRABASIC+44
CRAL8PTR EQU   CRABASIC+40
CRAL7PTR EQU   CRABASIC+36
CRAL6PTR EQU   CRABASIC+32
CRAL5PTR EQU   CRABASIC+28
CRAL4PTR EQU   CRABASIC+24
CRAL3PTR EQU   CRABASIC+20
CRAL2PTR EQU   CRABASIC+16
CRAL1PTR EQU   CRABASIC+12
CRALEV01 EQU   CRALKACT+3
CRALEV02 EQU   CRALKACT+3
CRALEV03 EQU   CRALKACT+3
CRALEV04 EQU   CRALKACT+3
CRALEV05 EQU   CRALKACT+3
CRALEV06 EQU   CRALKACT+3
CRALEV07 EQU   CRALKACT+3
CRALEV08 EQU   CRALKACT+3
CRALEV09 EQU   CRALKACT+2
CRALEV10 EQU   CRALKACT+2
CRALEV11 EQU   CRALKACT+2
CRALEV12 EQU   CRALKACT+2
CRALEV13 EQU   CRALKACT+2
CRALEV14 EQU   CRALKACT+2
CRALEV15 EQU   CRALKACT+2
CRALEV16 EQU   CRALKACT+2
CRALEV17 EQU   CRALKACT+1
CRALEV18 EQU   CRALKACT+1
CRALEV19 EQU   CRALKACT+1
CRALEV20 EQU   CRALKACT+1
CRALEV21 EQU   CRALKACT+1
CRALEV22 EQU   CRALKACT+1
CRALEV23 EQU   CRALKACT+1
CRALEV24 EQU   CRALKACT+1
CRALEV25 EQU   CRALKACT
CRALEV26 EQU   CRALKACT
CRALEV27 EQU   CRALKACT
CRALEV28 EQU   CRALKACT
CRALEV29 EQU   CRALKACT
CRALEV30 EQU   CRALKACT
CRALEV31 EQU   CRALKACT
CRALEV32 EQU   CRALKACT
CRAFRR   EQU   CRAHDR+4
@NM00050 EQU   ISTAPCRR+137
@NM00049 EQU   APC57FLG
APCNREL  EQU   APC57FLG
APCRECRA EQU   APC57FLG
@NM00048 EQU   APC54FLG
APCRLST  EQU   APC54FLG
APCPR153 EQU   APC53FLG
@NM00047 EQU   APC52FLG
APCWKF   EQU   APC52FLG
APCNWF   EQU   APC52FLG
APCRDQ   EQU   APC52FLG
APCQENQ  EQU   APC52FLG
APCSMSR  EQU   APC52FLG
APCCKRQ  EQU   APC52FLG
@NM00046 EQU   APC31FLG
APCSORT  EQU   APC31FLG
APCRESCH EQU   APC31FLG
APCTPXIT EQU   APC31FLG
APCSWTWD EQU   ISTAPCRR+128
APCSAV2  EQU   ISTAPCRR+124
APCSAV1  EQU   ISTAPCRR+120
APCRETCD EQU   APCCOMF+2
@NM00045 EQU   APCCOMF1+1
APCZLBER EQU   APCCOMF1
APCEXIT  EQU   APCCOMF1
APCRELR  EQU   APCCOMF1
APCIRB2  EQU   APCCOMF1
APCIRB1  EQU   APCCOMF1
APCSMCR  EQU   APCCOMF1
APCUETSK EQU   APCCOMF1
APCSSTSK EQU   APCCOMF1
APCESTAL EQU   APCSAVE
APCFRRPM EQU   ISTAPCRR+40
APCQWFO  EQU   ISTAPCRR+36
APCPABSV EQU   ISTAPCRR+32
APCRTRN  EQU   ISTAPCRR+28
APCTCBA  EQU   ISTAPCRR+24
APCPSTA  EQU   ISTAPCRR+20
@NM00044 EQU   APCRFLG+1
APC31R   EQU   APCRFLG
APC58R   EQU   APCRFLG
APC57R   EQU   APCRFLG
APC56R   EQU   APCRFLG
APC54R   EQU   APCRFLG
APC53R   EQU   APCRFLG
APC52R   EQU   APCRFLG
APC51R   EQU   APCRFLG
@NM00043 EQU   APCATFLG+1
APC31E   EQU   APCATFLG
APC58E   EQU   APCATFLG
APC57E   EQU   APCATFLG
APC56E   EQU   APCATFLG
APC54E   EQU   APCATFLG
APC53E   EQU   APCATFLG
APC52E   EQU   APCATFLG
APC51E   EQU   APCATFLG
APCHDRSV EQU   ISTAPCRR
ASCPSREG EQU   ISTASCRR+44
ASCUSR01 EQU   ASCUSRGS+12
ASCUSR00 EQU   ASCUSRGS+8
ASCUSR15 EQU   ASCUSRGS+4
ASCUSR14 EQU   ASCUSRGS
ASCETRYA EQU   ISTASCRR+24
ASCKEY   EQU   ISTASCRR+23
ASCAUDIT EQU   ASCFLG3
ASCFBDUD EQU   ASCFLG3
ASCLLKF  EQU   ASCFLG3
ASCKEYF  EQU   ASCFLG3
ASCFBDAL EQU   ASCFLG3
ASCFSRGT EQU   ASCFLG3
ASCICR   EQU   ASCFLG2
ASCFSRIC EQU   ASCFLG2
ASCFBDIC EQU   ASCFLG2
ASCFBAIC EQU   ASCFLG2
ASCPASTR EQU   ASCFLG1
ASCFSR   EQU   ASCFLG1
ASCFBD   EQU   ASCFLG1
ASCFBA   EQU   ASCFLG1
ASCPFCRR EQU   ISTASCRR
CCFRSVD1 EQU   CFCCRT
CCFCR2   EQU   CFCCRT
CCFCRP   EQU   CFCCRT
CCFCR1   EQU   CFCCRT
CCFCS2   EQU   CFCCRT
CCFCS1   EQU   CFCCRT
NCFRSVD  EQU   CFCNTRD
NCFCR2   EQU   CFCNTRD
NCFCRP   EQU   CFCNTRD
NCFCR1   EQU   CFCNTRD
NCFCS2   EQU   CFCNTRD
NCFCS1   EQU   CFCNTRD
PFCRSV01 EQU   ISTPFCRR+13
PFCFTA   EQU   ISTPFCRR+12
CRRFRR   EQU   PFCFRRO
CRRCHAIN EQU   PFCCRRO
CRRLEN   EQU   PFCCRRLN
PFCRSV10 EQU   PFCCRR+1
CRRID    EQU   PFCCRRID
ZCRRU    EQU   ZCRRHRU+3
ZCRRH    EQU   ZCRRHRU
ZCRWORDA EQU   ISTZCRR+477
ZCRCMNRC EQU   ISTZCRR+476
ZCRRSV97 EQU   ZCRENTER+18
ZCREIC2B EQU   ZCRENTER+18
ZCREAC2B EQU   ZCRENTER+18
ZCRELCAB EQU   ZCRENTER+18
ZCREDCMF EQU   ZCRENTER+18
ZCREBCIF EQU   ZCRENTER+18
ZCREICSG EQU   ZCRENTER+18
ZCREDCK0 EQU   ZCRENTER+18
ZCRECFY0 EQU   ZCRENTER+17
ZCREKCCB EQU   ZCRENTER+17
ZCREDCNB EQU   ZCRENTER+17
ZCREICOE EQU   ZCRENTER+17
ZCREBCNB EQU   ZCRENTER+17
ZCREBC0L EQU   ZCRENTER+17
ZCREBCAL EQU   ZCRENTER+17
ZCREDCQR EQU   ZCRENTER+17
ZCREDCPR EQU   ZCRENTER+16
ZCREBCSB EQU   ZCRENTER+16
ZCREAC1R EQU   ZCRENTER+16
ZCRECCCI EQU   ZCRENTER+16
ZCRECCAI EQU   ZCRENTER+16
ZCRECCBI EQU   ZCRENTER+16
ZCREBCAR EQU   ZCRENTER+16
ZCREBCDR EQU   ZCRENTER+16
ZCREBCBR EQU   ZCRENTER+15
ZCREDCXR EQU   ZCRENTER+15
ZCREDCWB EQU   ZCRENTER+15
ZCREDCWR EQU   ZCRENTER+15
ZCREKCCN EQU   ZCRENTER+15
ZCREKCBN EQU   ZCRENTER+15
ZCREKCBB EQU   ZCRENTER+15
ZCREJC0B EQU   ZCRENTER+15
ZCREJCDB EQU   ZCRENTER+14
ZCREJCCB EQU   ZCRENTER+14
ZCREJCBB EQU   ZCRENTER+14
ZCREJCAB EQU   ZCRENTER+14
ZCREIC1B EQU   ZCRENTER+14
ZCREIC0B EQU   ZCRENTER+14
ZCREICX0 EQU   ZCRENTER+14
ZCREICWB EQU   ZCRENTER+14
ZCREICVB EQU   ZCRENTER+13
ZCREICUB EQU   ZCRENTER+13
ZCREICTB EQU   ZCRENTER+13
ZCREICSC EQU   ZCRENTER+13
ZCREICSB EQU   ZCRENTER+13
ZCREICRB EQU   ZCRENTER+13
ZCREICQB EQU   ZCRENTER+13
ZCREICQA EQU   ZCRENTER+13
ZCREICOB EQU   ZCRENTER+12
ZCREICOA EQU   ZCRENTER+12
ZCREICNB EQU   ZCRENTER+12
ZCREICNA EQU   ZCRENTER+12
ZCREICMB EQU   ZCRENTER+12
ZCREICLB EQU   ZCRENTER+12
ZCREICKG EQU   ZCRENTER+12
ZCREICKE EQU   ZCRENTER+12
ZCREICKB EQU   ZCRENTER+11
ZCREICJB EQU   ZCRENTER+11
ZCREICID EQU   ZCRENTER+11
ZCREICIB EQU   ZCRENTER+11
ZCREICHB EQU   ZCRENTER+11
ZCREICGB EQU   ZCRENTER+11
ZCREICEB EQU   ZCRENTER+11
ZCREICDB EQU   ZCRENTER+11
ZCREICCI EQU   ZCRENTER+10
ZCREICCB EQU   ZCRENTER+10
ZCREICBI EQU   ZCRENTER+10
ZCREICBB EQU   ZCRENTER+10
ZCREICAA EQU   ZCRENTER+10
ZCREHCAN EQU   ZCRENTER+10
ZCREGC0B EQU   ZCRENTER+10
ZCREGC0A EQU   ZCRENTER+9
ZCREGCLA EQU   ZCRENTER+9
ZCREGCEB EQU   ZCRENTER+9
ZCREGCDB EQU   ZCRENTER+9
@NM00042 EQU   ZCRENTER+9
ZCREGCBB EQU   ZCRENTER+9
ZCREGCAB EQU   ZCRENTER+9
ZCREFCEB EQU   ZCRENTER+9
ZCREFCEA EQU   ZCRENTER+8
ZCREECTA EQU   ZCRENTER+8
ZCREECEA EQU   ZCRENTER+8
ZCREECDA EQU   ZCRENTER+8
ZCREECCB EQU   ZCRENTER+8
ZCREECCA EQU   ZCRENTER+8
ZCREECBB EQU   ZCRENTER+8
ZCREECBA EQU   ZCRENTER+8
ZCREDCMB EQU   ZCRENTER+7
ZCREDCL0 EQU   ZCRENTER+7
ZCREDCKB EQU   ZCRENTER+7
ZCREDCKA EQU   ZCRENTER+7
ZCREDCJ0 EQU   ZCRENTER+7
ZCREDCI0 EQU   ZCRENTER+7
ZCREDCH0 EQU   ZCRENTER+7
ZCREDCF0 EQU   ZCRENTER+7
ZCREDCE0 EQU   ZCRENTER+6
ZCREDCD0 EQU   ZCRENTER+6
ZCREDCC0 EQU   ZCRENTER+6
ZCREDCB0 EQU   ZCRENTER+6
ZCREDCA0 EQU   ZCRENTER+6
ZCRECC2B EQU   ZCRENTER+6
ZCRECC1B EQU   ZCRENTER+6
ZCRECC1A EQU   ZCRENTER+6
ZCRECC0B EQU   ZCRENTER+5
ZCRECC0A EQU   ZCRENTER+5
ZCREBC0B EQU   ZCRENTER+5
ZCREBC0A EQU   ZCRENTER+5
ZCREBCZ0 EQU   ZCRENTER+5
ZCREBCY0 EQU   ZCRENTER+5
ZCREBCX0 EQU   ZCRENTER+5
ZCREBCXA EQU   ZCRENTER+5
ZCREBCSC EQU   ZCRENTER+4
ZCREBCRB EQU   ZCRENTER+4
ZCREBCRA EQU   ZCRENTER+4
ZCREBCQB EQU   ZCRENTER+4
ZCREBCPB EQU   ZCRENTER+4
ZCREBCOB EQU   ZCRENTER+4
ZCREBCNE EQU   ZCRENTER+4
ZCREBCND EQU   ZCRENTER+4
ZCREBCMB EQU   ZCRENTER+3
ZCREBCLB EQU   ZCRENTER+3
ZCREBCLA EQU   ZCRENTER+3
ZCREBCKB EQU   ZCRENTER+3
ZCREBCKA EQU   ZCRENTER+3
ZCREBCJB EQU   ZCRENTER+3
ZCREBCJA EQU   ZCRENTER+3
ZCREBCID EQU   ZCRENTER+3
ZCREBCIB EQU   ZCRENTER+2
ZCREBCIA EQU   ZCRENTER+2
ZCREBCHB EQU   ZCRENTER+2
ZCREBCHA EQU   ZCRENTER+2
ZCREBCGB EQU   ZCRENTER+2
ZCREBCGA EQU   ZCRENTER+2
ZCREBCFB EQU   ZCRENTER+2
ZCREBCFA EQU   ZCRENTER+2
ZCREBCEB EQU   ZCRENTER+1
ZCREBCDI EQU   ZCRENTER+1
ZCREBCCB EQU   ZCRENTER+1
ZCREBCBI EQU   ZCRENTER+1
ZCREBCBB EQU   ZCRENTER+1
ZCREBCBA EQU   ZCRENTER+1
ZCREBCAM EQU   ZCRENTER+1
ZCREBCAI EQU   ZCRENTER+1
ZCREBCAG EQU   ZCRENTER
ZCREBCAE EQU   ZCRENTER
ZCREBCAB EQU   ZCRENTER
ZCREBCAA EQU   ZCRENTER
ZCREAC1B EQU   ZCRENTER
ZCREAC0B EQU   ZCRENTER
ZCREAC0A EQU   ZCRENTER
ZCREAC1A EQU   ZCRENTER
ZCRTNAME EQU   ZCRAUDIT+1
ZCRTID   EQU   ZCRAUDIT
ZCRREMIC EQU   ISTZCRR+436
ZCRSAVEZ EQU   ISTZCRR+196
ZCRDAFSV EQU   ZCRCIDSV+2
ZCRSAFSV EQU   ZCRCIDSV
ZCRR13SV EQU   ISTZCRR+188
ZCRR2SV  EQU   ISTZCRR+184
ZCROPCDE EQU   ISTZCRR+183
ZCRPRMTC EQU   ISTZCRR+182
ZCRRCDSV EQU   ISTZCRR+181
ZCRAWQSW EQU   ISTZCRR+180
ZCRTOPQ  EQU   ISTZCRR+180
ZCRXSCHD EQU   ISTZCRR+180
ZCRMOREL EQU   ISTZCRR+180
ZCRFBPRC EQU   ISTZCRR+180
ZCRFSBSV EQU   ISTZCRR+176
ZCRSVWK5 EQU   ZCRWKARA+16
ZCRSVWK4 EQU   ZCRWKARA+12
ZCRSVWK3 EQU   ZCRWKARA+8
ZCRSVWK2 EQU   ZCRWKARA+4
ZCRSVWK1 EQU   ZCRWKARA
ZCRSVF25 EQU   ZCRSVRTN+96
ZCRSVF24 EQU   ZCRSVRTN+92
ZCRSVF23 EQU   ZCRSVRTN+88
ZCRSVF22 EQU   ZCRSVRTN+84
ZCRSVF21 EQU   ZCRSVRTN+80
ZCRSVF20 EQU   ZCRSVRTN+76
ZCRSVF19 EQU   ZCRSVRTN+72
ZCRSVF18 EQU   ZCRSVRTN+68
ZCRSVF17 EQU   ZCRSVRTN+64
ZCRSVF16 EQU   ZCRSVRTN+60
ZCRSVF15 EQU   ZCRSVRTN+56
ZCRSVF14 EQU   ZCRSVRTN+52
ZCRSVF13 EQU   ZCRSVRTN+48
ZCRSVF12 EQU   ZCRSVRTN+44
ZCRSVF11 EQU   ZCRSVRTN+40
ZCRSVF10 EQU   ZCRSVRTN+36
ZCRSVF6  EQU   ZCRSVRTN+20
ZCRSVF5  EQU   ZCRSVRTN+16
ZCRSVF4  EQU   ZCRSVRTN+12
ZCRSVF3  EQU   ZCRSVRTN+8
ZCRSVF2  EQU   ZCRSVRTN+4
ZCRSVF1  EQU   ZCRSVRTN
ZCRPVZB  EQU   ISTZCRR+52
ZCRZLB   EQU   ISTZCRR+48
ZCRBFPTR EQU   ISTZCRR+44
ZCRCCWA  EQU   ISTZCRR+40
ZCRPSW   EQU   ZCRPARMS+15
ZCRPCHAR EQU   ZCRPARMS+14
ZCRPRES2 EQU   ZCRPCOD2
ZCRPMFGF EQU   ZCRPCOD2
ZCRPFHDR EQU   ZCRPCOD2
ZCRPPG2  EQU   ZCRPCOD2
ZCRPRES  EQU   ZCRPCOD1
ZCRPCFTX EQU   ZCRPCOD1
ZCRPLSBQ EQU   ZCRPLSBF
ZCRPFSB  EQU   ZCRPCOD1
ZCRPLNG  EQU   ZCRPCOD1
ZCRPPG   EQU   ZCRPCOD1
ZCRDTODA EQU   ZCRDFRDA
ZCRMLNG  EQU   ZCRPARMS+8
ZCRTBPTR EQU   ZCRPARMS+4
ZCRCBPTR EQU   ZCRFBPTR
ZCRCRLCP EQU   ISTZCRR+20
@NM00041 EQU   ZCRSCPSW
ZCRSKIPT EQU   ZCRSCPSW
ZCRFSBWE EQU   ZCRSCPSW
ZCRPRCMP EQU   ZCRSCPSW
ZCRLREQ  EQU   ZCRSCPSW
ZCRRJLCP EQU   ZCRSCPSW
ZCRTPINV EQU   ZCRSCPSW
ZCRTPEX  EQU   ZCRSCPSW
@NM00040 EQU   ZCRIBPR
ZCR3270  EQU   ZCRIBPR
ZCRLCPFD EQU   ZCRIBPR
ZCRLCPFR EQU   ZCRIBPR
ZCRRELK  EQU   ZCRIBPR
ZCRERR   EQU   ZCRIBPR
ZCRNOBUF EQU   ZCRIBPR
@NM00039 EQU   ZCRPFLGS
ZCRQAHED EQU   ZCRPFLGS
ZCRF1RES EQU   ZCRGENSW
ZCRBRIS  EQU   ZCRGENSW
ZCRCLRBD EQU   ZCRGENSW
ZCREXRES EQU   ZCRGENSW
ZCRLCSYN EQU   ZCRGENSW
ZCRRT06  EQU   ZCRGENSW
ZCRTSW2  EQU   ZCRGENSW
ZCRTSW1  EQU   ZCRGENSW
ZCRINLCP EQU   ZCRFLGS3
ZCRWRPTR EQU   ZCRFLGS3
ZCRNOFRE EQU   ZCRFLGS3
ZCREDRIV EQU   ZCRFLGS3
ZCRDISC  EQU   ZCRFLGS3
ZCRTPDIS EQU   ZCRFLGS3
ZCRTPCON EQU   ZCRFLGS3
ZCRTIC   EQU   ZCRFLGS3
ZCRCNLXL EQU   ZCRRESET
ZCRENDAN EQU   ZCRSWFLD
ZCRENDXL EQU   ZCRSWFLD
ZCRENDX  EQU   ZCRSWFLD
ZCROB1   EQU   ZCRNDLCP
ZCRENDPR EQU   ZCRSWFLD
ZCREXTYP EQU   ZCRSWFLD
ZCRSLCP  EQU   ZCRENDSH
ZCRIF0E3 EQU   ZCRFLGS2
ZCRIF0E2 EQU   ZCRFLGS2
ZCRIF0E1 EQU   ZCRFLGS2
ZCROB    EQU   ZCRFLGS2
ZCRFMSED EQU   ZCRFLGS2
ZCRSHEDI EQU   ZCRFLGS2
ZCRLOCAL EQU   ZCRFLGS2
ZCRFEXIT EQU   ZCRFLGS1
ZCRUNSOL EQU   ZCRFLGS1
ZCRENDLP EQU   ZCRFLGS1
ZCRNRMEX EQU   ZCRFLGS1
ZCRWAIT  EQU   ZCRFLGS1
ZCRDEQSW EQU   ZCRFLGS1
ZCRQUESW EQU   ZCRFLGS1
ZCREXSW  EQU   ZCRFLGS1
ZCRFRRA  EQU   ISTZCRR+8
ZCRCHAIN EQU   ISTZCRR+4
ZCRFLAG  EQU   ZCRCRR+3
ZCRLEN   EQU   ZCRCRR+1
ZCRID    EQU   ZCRCRR
ZIBLNG1  EQU   ZIBFSM
ZIBCHAIN EQU   ISTZIBUF
TH2SNF   EQU   ISTTH2+4
TH2OAF   EQU   ISTTH2+3
TH2DAF   EQU   ISTTH2+2
TH2CDF   EQU   TH2FLAG1+1
TH2SEF   EQU   TH2FLAG1+1
TH2PYF   EQU   TH2FLAG1+1
TH2AFI   EQU   TH2FLAG1
TH2PSI   EQU   TH2FLAG1
TH2CMPLI EQU   TH2MPF
TH2RHI   EQU   TH2MPF
TH2FID   EQU   TH2FLAG1
THDCF    EQU   ISTTH+8
THSNF    EQU   ISTTH+6
THOAF    EQU   ISTTH+4
THDAF    EQU   ISTTH+2
THCDF    EQU   THFLGB
THSEF    EQU   THFLGB
THPYF    EQU   THFLGB
THAFI    EQU   THFLGA
THPSI    EQU   THFLGA
THCMPLI  EQU   THMPF
THRHI    EQU   THMPF
THFID    EQU   THFLAG1
LHVDATA  EQU   ISTLH+4
LHFUNCT  EQU   ISTLH+3
@NM00033 EQU   ISTLH+2
LHLEN    EQU   ISTLH
BTUTEXT  EQU   ISTBTU+20
BTURSV02 EQU   BTUSYSTR
BTUPHASE EQU   BTUSYSTR
BTURSV01 EQU   BTUSYSTR
BTUPAD   EQU   BTURH+3
BTURH3   EQU   BTURH+2
BTURH2   EQU   BTURH+1
BTURH1   EQU   BTURH
BTUZRTSC EQU   BTURQFLG+1
BTUZRT0B EQU   BTURQFLG+1
BTUZRT0A EQU   BTURQFLG+1
BTUZRT09 EQU   BTURQFLG+1
BTUZRT08 EQU   BTURQFLG+1
BTUZRT07 EQU   BTURQFLG
BTUZRT06 EQU   BTURQFLG
BTUZRT05 EQU   BTURQFLG
BTUZRT04 EQU   BTURQFLG
BTUZRT03 EQU   BTURQFLG
BTUZRT02 EQU   BTURQFLG
BTUZRT01 EQU   BTURQFLG
BTUZRT00 EQU   BTURQFLG
BTUCDF   EQU   BTUFID+1
BTUSCF   EQU   BTUFID+1
BTUPRY   EQU   BTUFID+1
BTUASFL  EQU   BTUFID
BTUPSFL  EQU   BTUFID
BTUMPF   EQU   BTUFID
BTUFIDNO EQU   BTUFID
BDURSV04 EQU   BDUFLAGS
BDURTOE  EQU   BDUFLAGS
BDUSTPR  EQU   BDUFLAGS
BDURSV03 EQU   BDUFLAGS
BDUALT   EQU   BDUFUNC
BDUNACK  EQU   BDUFUNC
BDUACK   EQU   BDUFUNC
BDUTRPM  EQU   BDUFUNC
BDUFBMI  EQU   BDUFUNC
BDULDGPH EQU   BDUFUNC
BDUHEADP EQU   BDUFUNC
BDUSOH   EQU   BDUCHECK
BDURSV01 EQU   BDUMODIF
BDUMOD0  EQU   BDUMOD1
FSBFDB   EQU   ISTFSB+32
FSBRSV01 EQU   FSBFSB+30
FSBTHCNT EQU   FSBFSB+28
FSBRLRSV EQU   FSBRLSTS
FSBCFTX  EQU   FSBRLSTS
FSBICNCB EQU   FSBMSGID
FSBSSOC  EQU   FSBSS2
FSBSSCC  EQU   FSBSS2
FSBSSDC  EQU   FSBSS2
FSBSSEC  EQU   FSBSS2
FSBSSIR  EQU   FSBSS2
FSBSSCR  EQU   FSBSS2
@NM00031 EQU   FSBSS2
@NM00030 EQU   FSBSS1
FSBSSDE  EQU   FSBSS1
FSBSSUS  EQU   FSBSS1
@NM00029 EQU   FSBSS1
FSBSOHI  EQU   FSBERC
FSBLGI   EQU   FSBERC
FSBLMRI  EQU   FSBFBMI
FSBETI   EQU   FSBERC
FSBEMI   EQU   FSBERC
FSBEBI   EQU   FSBERC
FSBXLCI  EQU   FSBXCODE
FSBXFINS EQU   FSBXCODE
FSBXNORM EQU   FSBXFSTS
FSBSCODE EQU   FSBSYSRS
FSBSPHSE EQU   FSBSYSRS
FSBSERR  EQU   FSBSYSRS
FSBCMD   EQU   FSBSEQ
FSBDTRCE EQU   FSBFLAGS
FSBASBTU EQU   FSBFLAGS
FSBINPET EQU   FSBFLAGS
FSBNONCB EQU   FSBFLAGS
FSBLBIND EQU   FSBFLAGS
FSBFFIND EQU   FSBFLAGS
FSBACIND EQU   FSBFLAGS
FSBRFIND EQU   FSBFLAGS
FSBGATE  EQU   FSBFSBA
FSBLATOP EQU   FSBSFLGS
FSBRSV02 EQU   FSBSFLGS
FSBPGBUF EQU   FSBSFLGS
FSBMNSDA EQU   FSBMNRCD
FSBMNOA  EQU   FSBMNRCD
FSBMNDIF EQU   FSBMNRCD
FSBMNEOP EQU   FSBMNRCD
FSBMNDNU EQU   FSBMNRCD
FSBMNATN EQU   FSBMNRCD
FSBMNRVI EQU   FSBMNRCD
FSBMNELI EQU   FSBMNRCD
FSBLNGTH EQU   FSBFSB+1
FSBTYPE  EQU   FSBFSB
FDBFDBA  EQU   ISTFDB
FMCFLRSV EQU   FMCFLGB
FMCFLGA8 EQU   FMCFLGB
FMCCLRPH EQU   FMCVS1+45
FMCRSV0X EQU   FMCCVFLG
FMCVYRPH EQU   FMCCVFLG
FMCLOCK2 EQU   FMCVS1+36
@NM00028 EQU   FMCZFLG2
FMCZF027 EQU   FMCZFLG2
FMCZF026 EQU   FMCZFLG2
FMCSEQ1B EQU   FMCSEQ1
FMCSEQ1T EQU   FMCSEQ1
FMCZX005 EQU   FMCVS1+32
FMCZX004 EQU   FMCVS1+31
FMCZX003 EQU   FMCVS1+30
FMCZX002 EQU   FMCVS1+29
FMCZX001 EQU   FMCVS1+28
FMCZV001 EQU   FMCVS1+24
FMCAWATQ EQU   FMCLCPAQ+1
@NM00027 EQU   FMCLCPAQ
FMCLCPB2 EQU   FMCLCPBQ+1
FMCLCPB1 EQU   FMCLCPBQ
FMCASCDQ EQU   FMCSHEAQ+1
@NM00026 EQU   FMCSHEAQ
FMCSHEDQ EQU   FMCVS1+8
FMCZFCSQ EQU   FMCVS1+6
FMCZF025 EQU   FMCZFLAG+3
FMCZF024 EQU   FMCZFLAG+3
FMCZF023 EQU   FMCZFLAG+3
FMCZF022 EQU   FMCZFLAG+3
FMCZF020 EQU   FMCZFLAG+3
FMCZF019 EQU   FMCZFLAG+3
FMCZF018 EQU   FMCZFLAG+3
FMCZF017 EQU   FMCZFLAG+2
FMCZF016 EQU   FMCZFLAG+2
FMCZF013 EQU   FMCZFLAG+2
FMCZF012 EQU   FMCZFLAG+2
FMCZF011 EQU   FMCZFLAG+2
FMCZF010 EQU   FMCZFLAG+2
FMCZF00F EQU   FMCZFLAG+1
FMCZF00E EQU   FMCZFLAG+1
FMCZF00D EQU   FMCZFLAG+1
FMCZF00C EQU   FMCZFLAG+1
FMCZF00B EQU   FMCZFLAG+1
FMCRSV10 EQU   FMCZFLAG+1
FMCZF009 EQU   FMCZFLAG+1
FMCZFD06 EQU   FMCZF006+1
FMCZFC06 EQU   FMCZF006
FMCZFB06 EQU   FMCZF006
FMCZF005 EQU   FMCZFLAG
FMCZF004 EQU   FMCZFLAG
FMCZF003 EQU   FMCZFLAG
FMCZF002 EQU   FMCZFLAG
FMCZF001 EQU   FMCZFLAG
FMCFRESA EQU   ISTFMCB+228
FMCSCSQN EQU   FMCSNCTL+2
FMCSCCTL EQU   FMCSNCTL+1
FMCSTCTL EQU   FMCSCFLG
FMCSCCLO EQU   FMCSCFLG
FMCAPRO  EQU   FMCSCFLG
FMCLURO  EQU   FMCSCFLG
FMCOBSAC EQU   FMCSCFLG
FMCIBSAC EQU   FMCSCFLG
FMCFBRE  EQU   ISTFMCB+220
FMCFBXM  EQU   FMCZV002
FMCASEGQ EQU   ISTFMCB+212
FMCRDTPT EQU   ISTFMCB+208
FMCLOCK  EQU   ISTFMCB+204
FMCSEGD  EQU   FMCSSEGQ
FMCRSPLM EQU   ISTFMCB+198
FMCPSTRS EQU   ISTFMCB+196
@NM00025 EQU   FMCRRESP
FMCTSLHA EQU   FMCRRESP
FMCFRRN  EQU   FMCRRESP
FMCFME   EQU   FMCRRESP
FMCFEX   EQU   FMCRRESP
FMCFPE   EQU   FMCRRESP
FMCCTLB  EQU   ISTFMCB+194
FMCBSQNO EQU   FMCCLSEQ+2
FMCTSQNO EQU   FMCCLSEQ
FMCOBPRG EQU   FMCMODEB
FMCIBPRG EQU   FMCMODEB
FMCRESOT EQU   FMCMODEB
FMCRSTSR EQU   FMCMODEB
FMCLUQ   EQU   FMCMODEB
FMCAPQ   EQU   FMCMODEB
FMCCLEAR EQU   FMCMODEB
FMCHOLD  EQU   FMCMODEB
FMCIPSEQ EQU   ISTFMCB+188
FMCLUSTR EQU   ISTFMCB+187
FMCRSV87 EQU   FMCSTAT2
FMCSEQI  EQU   FMCSTAT2
FMCCPIP  EQU   FMCSTAT2
FMCALIPR EQU   FMCSTAT2
FMCIAIO  EQU   FMCSTAT2
FMCZF00A EQU   FMCSTAT2
FMCVPIP  EQU   FMCSTAT2
FMCBHSET EQU   ISTFMCB+185
FMCPRMRC EQU   FMCCLEXT+20
FMCRSV89 EQU   FMCPSTAT
FMCPCLSD EQU   FMCPSTAT
FMCDDOCD EQU   FMCPSTAT
FMCIDVFD EQU   FMCPSTAT
FMCELKST EQU   FMCPSTAT
FMCRSV88 EQU   FMCPSCMD
FMCRDBLK EQU   FMCPSCMD
FMCDSEOC EQU   FMCPSCMD
FMCPURGE EQU   FMCPSCMD
FMCRESTI EQU   FMCPSCMD
FMCCNTCT EQU   FMCPSCMD
FMCINVT  EQU   FMCPSCMD
FMCFLGB7 EQU   FMCFLGCL
FMCFLGB6 EQU   FMCFLGCL
FMCFLGB5 EQU   FMCFLGCL
FMCFLGB4 EQU   FMCFLGCL
FMCFLGB3 EQU   FMCFLGCL
FMCFLGB2 EQU   FMCFLGCL
FMCFLGB1 EQU   FMCFLGCL
FMCFLGB0 EQU   FMCFLGCL
FMCFLGA7 EQU   FMCFLGA
FMCFLGA6 EQU   FMCFLGA
FMCFLGA5 EQU   FMCFLGA
FMCFLGA4 EQU   FMCFLGA
FMCFLGA3 EQU   FMCFLGA
FMCFLGA2 EQU   FMCFLGA
FMCFLGA1 EQU   FMCFLGA
FMCFLGA0 EQU   FMCFLGA
FMCDCLOK EQU   FMCCLEXT+12
FMCRAFM  EQU   FMCCLEXT+8
FMCFBPTR EQU   FMCFBA+1
FMCFBRSV EQU   FMCFBA
FMCRPLPT EQU   FMCRPLA+1
FMCRPLRS EQU   FMCRPLA
FMCPRCLS EQU   FMCCVAL
FMCIBCE  EQU   FMCCVAL
FMCONLY  EQU   FMCOBCE
FMCLAST  EQU   FMCOBCE
FMCMIDLE EQU   FMCOBCE
FMCFIRST EQU   FMCOBCE
FMCCPCNT EQU   FMCPACPC
FMCMPCNT EQU   FMCPACEM
FMCNPCNT EQU   FMCPACEN
FMCCONF  EQU   FMCSSTAT
FMCPURCH EQU   FMCSSTAT
FMCNSALU EQU   FMCSSTAT
FMCBIP   EQU   FMCSSTAT
FMCSDTR  EQU   FMCSSTAT
FMCUIPI  EQU   FMCSSTAT
FMCCIPI  EQU   FMCSSTAT
FMCSNBI  EQU   FMCSSTAT
FMCRVD01 EQU   ISTFMCB+158
FMCISSN  EQU   ISTFMCB+156
FMCOASN  EQU   FMCNXOSC
FMCOSSN  EQU   FMCNXCFM
FMCSIP   EQU   FMCSIPA
FMCEXLST EQU   ISTFMCB+144
FMCPAB5  EQU   ISTFMCB+128
FMCPAB4  EQU   ISTFMCB+112
FMCPAB3  EQU   ISTFMCB+96
FMCPAB1  EQU   ISTFMCB+64
FMCFASYA EQU   ISTFMCB+60
FMCMODE  EQU   ISTFMCB+52
FMCPROCD EQU   ISTFMCB+48
FMCVWT   EQU   ISTFMCB+44
FMCRPLH  EQU   ISTFMCB+40
FMCBUFNB EQU   FMCCMPS1+2
FMCBUFLM EQU   FMCCMPS1
FMCDEBA  EQU   ISTFMCB+32
@NM00024 EQU   FMCCMDFL
FMCSNA   EQU   FMCCMDFL
FMCVSNA  EQU   FMCCMDFL
FMCCMDR  EQU   FMCCMDFL
@NM00023 EQU   ISTFMCB+30
@NM00022 EQU   FMCSTAT1
FMCLTCLS EQU   FMCSTAT1
FMCHPURG EQU   FMCSTAT1
FMCVSP2  EQU   FMCSTAT1
FMCVSP1  EQU   FMCSTAT
FMCLTEAS EQU   FMCSTAT
FMCZF007 EQU   FMCSTAT
FMCDEDSC EQU   FMCSTAT
FMCDEVOF EQU   FMCSTAT
FMCDAPT  EQU   FMCSTAT
FMCPRMTE EQU   FMCSTAT
FMCPRMTR EQU   FMCSTAT
FMCUSFLD EQU   ISTFMCB+24
FMCFMCBA EQU   ISTFMCB+20
FMCDNCBA EQU   ISTFMCB+16
FMCDVTA  EQU   ISTFMCB+12
FMCTSKID EQU   ISTFMCB+8
FMCNXTCB EQU   ISTFMCB+4
FMCSAF   EQU   ISTFMCB+2
FMCLNGTH EQU   ISTFMCB+1
FMCTYPE  EQU   ISTFMCB
PROSRDEF EQU   PROSETM4
PRORSV47 EQU   PROSETM4
PROSCON  EQU   PROSETM4
PRORSV46 EQU   PROSETM3
PROSMONT EQU   PROSETM3
PRORSV45 EQU   PROSETM3
PROSNTO  EQU   PROSETM3
PRORSV44 EQU   PROSETM3
PRORSV43 EQU   PROSETM2
PROSNTFL EQU   PROSETM2
PRORSV42 EQU   PROSETM2
PRORSV41 EQU   PROPROCS
PROMODC  EQU   PROPROC4
PROMODT  EQU   PROPROC4
PROMODM  EQU   PROPROC4
PROMODB  EQU   PROPROC4
PRORSV14 EQU   PROPROC4
PRORSV13 EQU   PROPROC4
PRORSV12 EQU   PROPROC4
PROEIB   EQU   PROPROC4
PROMONT3 EQU   PROPROC3
PROMONT2 EQU   PROPROC3
PROMONIT EQU   PROPROC3
PROSUBLK EQU   PROPROC3
PRONTO   EQU   PROPROC3
PROLGIN  EQU   PROPROC3
PROERPI  EQU   PROPROC3
PRORSV07 EQU   PROPROC3
PROCFTX  EQU   PROPROC2
PROEMLC  EQU   PROPROC2
PRONTFL  EQU   PROPROC2
PRORSV05 EQU   PROPROC2
PRORSV04 EQU   PROPROC2
PROLGOT  EQU   PROPROC2
PROERPO  EQU   PROPROC2
PRORSV03 EQU   PROPROC2
PRORPLC  EQU   PROPROC1
PROCS    EQU   PROPROC1
PROCA    EQU   PROPROC1
PRORESPX EQU   PROPROC1
PRODFASY EQU   PROPROC1
PROXPOPT EQU   PROPROC1
PROTRUNC EQU   PROPROC1
PROASYIP EQU   PROPROC1
DEVRSV03 EQU   ISTDEVCH+5
DEVPHYSA EQU   ISTDEVCH+4
DEVCSLPN EQU   DEVCHAR3
DEVCSTCL EQU   DEVCHAR3
DEVCCHEK EQU   DEVCHAR3
DEVCATTN EQU   DEVCHAR3
DEVCSWL  EQU   DEVFCCTL
DEVCRVB  EQU   DEVFCCTL
DEVCSSL  EQU   DEVFCCTL
DEVCBSC  EQU   DEVFCCTL
DEVMCODE EQU   ISTDEVCH+2
DEVCHAR2 EQU   DEVTCODE
DEVRSV01 EQU   DEVCHAR
DEVCCTL  EQU   DEVCHAR
DEVNNSPT EQU   DEVCHAR
DEVSPS   EQU   DEVCHAR
DEVSUBND EQU   DEVCHAR
DEVCONVR EQU   DEVCHAR
DEVOTPUT EQU   DEVCHAR
DEVINPUT EQU   DEVCHAR
LCPFTYPE EQU   LCPRPHA
LCPRSTQH EQU   LCPLCCW
LCPCLREP EQU   ISTLCPB+44
LCPUBFSB EQU   LCPFLCCW
LCPRSV77 EQU   ISTLCPB+39
LCPLCCWC EQU   ISTLCPB+38
LCPRSV78 EQU   LCPFLG1
LCPTRANS EQU   LCPFLG1
LCPSTLB  EQU   LCPFLG1
LCPREDRV EQU   LCPFLG1
LCPDIRPT EQU   LCPFLG1
LCPINTER EQU   LCPFLG1
LCPRESET EQU   LCPFLG1
LCPSTYPE EQU   ISTLCPB+36
LCPFSNCH EQU   ISTLCPB+34
LCPFOSN  EQU   ISTLCPB+32
LCPTLBAD EQU   ISTLCPB+28
LCPFDB2  EQU   LCPFDBA+1
LCPFDB1  EQU   LCPFDBA
LCPNXLCW EQU   ISTLCPB+20
LCPDAF   EQU   LCPCID+2
LCPSAF   EQU   LCPCID
LCPLCCW1 EQU   ISTLCPB+12
LCPRRCNT EQU   LCPSEQ+1
LCPRRCCT EQU   LCPSEQ
LCPDSTAT EQU   LCPFLAG2
LCPEXRES EQU   LCPFID0
LCPZRIMM EQU   LCPTLBPI
LCPRSTRT EQU   LCPFLAG2
LCPASYN  EQU   LCPFLAG2
LCPPRFLG EQU   LCPFLAG2
LCPZMIRC EQU   LCPRUCNT
LCPCHAI2 EQU   LCPCHAIN+1
LCPCHNG  EQU   LCPCHAI1
LCPZRT0B EQU   LCPMNRCD
LCPZRT0A EQU   LCPMNRCD
LCPZRTL9 EQU   LCPZRT09
LCPZRTL8 EQU   LCPZRT08
LCPZRTL7 EQU   LCPZRT07
LCPZRTL6 EQU   LCPZRT06
LCPZRTL5 EQU   LCPZRT05
LCPZRTL4 EQU   LCPZRT04
LCPZRTL3 EQU   LCPZRT03
LCPZRTL2 EQU   LCPZRT02
LCPZRT01 EQU   LCPFLAGS
LCPZRT00 EQU   LCPFLAGS
LCPLNGTH EQU   ISTLCPB+1
LCPTYPE  EQU   ISTLCPB
LSCTLBAD EQU   ISTLSCB+28
LSCFDB2  EQU   LSCFDBA+1
LSCFDB1  EQU   LSCFDBA
LSCLCCW1 EQU   ISTLSCB+12
LSCRRCNT EQU   LSCSEQ+1
LSCRRCCT EQU   LSCSEQ
LSCATOP  EQU   LSCFLGS
LSCFREE  EQU   LSCFLGS
LSCDSTAT EQU   LSCFLGS
LSCEXRES EQU   LSCFLGS
LSCZRIMM EQU   LSCFLGS
LSCRSV01 EQU   LSCFLGS
LSCCHAI2 EQU   LSCCHAIN+1
LSCCHNG  EQU   LSCCHAI1
LSCZRTSC EQU   LSCZMNRC
LSCZRT0B EQU   LSCZMNRC
LSCZRT0A EQU   LSCZMNRC
LSCZRTL9 EQU   LSCZRT09
LSCZRTL8 EQU   LSCZRT08
LSCZRTL7 EQU   LSCZRT07
LSCZRTL6 EQU   LSCZRT06
LSCZRTL5 EQU   LSCZRT05
LSCZRTL4 EQU   LSCZRT04
LSCZRTL3 EQU   LSCZRT03
LSCZRTL2 EQU   LSCZRT02
LSCZRT01 EQU   LSCREQTG
LSCZRT00 EQU   LSCREQTG
LSCLNGTH EQU   LSC1WORD+1
LCCWDATA EQU   ISTLCCW+4
LCCWCNT  EQU   ISTLCCW+2
LCCWACI  EQU   LCCWFLAG
LCCWRFI  EQU   LCCWFLAG
LCCWPER  EQU   LCCWLSI
LCCWIDAT EQU   LCCWFLAG
LCCWNTVC EQU   LCCWFLAG
LCCWCKPT EQU   LCCWFLAG
LCCWCC   EQU   LCCWFLAG
LCCWCD   EQU   LCCWFLAG
LCCWTYPE EQU   LCCWCTL
LCCWMODE EQU   LCCWCTL
LCCWSOP  EQU   LCCWRWOP
@NM00021 EQU   LCCWRWOP
LCCWSD   EQU   LCCWOP
LCCWSI   EQU   LCCWOP
ATCAOS   EQU   ISTATCVT+1584
ATCPOPAB EQU   ATCAOSM+640
ATCVIOPM EQU   ATCAOSM+636
ATCTPMMI EQU   ATCAOSM+632
ATCTPMPB EQU   ATCAOSM+600
ATCRSV88 EQU   ATCAOSM+596
ATCRPLCT EQU   ATCAOSM+594
ATCCRACT EQU   ATCAOSM+592
ATCSRBCT EQU   ATCAOSM+590
ATCRSV75 EQU   ATCAOSM+589
ATCRSV66 EQU   ATCZFLAG
ATCZF001 EQU   ATCZFLAG
ATCTPCP1 EQU   ATCAOSM+584
ATCTPCP0 EQU   ATCAOSM+580
ATCAICTN EQU   ATCAOSM+576
ATCZR01  EQU   ATCAOSM+572
ATCMPLTA EQU   ATCAOSM+568
ATCASCB  EQU   ATCAOSM+564
ATCAP86  EQU   ATCAOSM+560
ATCAP85  EQU   ATCAOSM+556
ATCAP84  EQU   ATCAOSM+552
ATCAP83  EQU   ATCAOSM+548
ATCAP82  EQU   ATCAOSM+544
ATCAP69  EQU   ATCAOSM+540
ATCAP66  EQU   ATCAOSM+536
ATCAP62  EQU   ATCAOSM+532
ATCAPC59 EQU   ATCAOSM+528
ATCAP56  EQU   ATCAOSM+524
ATCAP55  EQU   ATCAOSM+520
ATCRCFY0 EQU   ATCAOSM+516
ATCAP41  EQU   ATCAOSM+512
ATCAPC25 EQU   ATCAOSM+508
ATCAP23  EQU   ATCAOSM+504
ATCTPSPB EQU   ATCAOSM+472
ATCTRMPB EQU   ATCAOSM+440
ATCAPBE  EQU   ATCAOSM+436
ATCPSTA  EQU   ATCAOSM+432
ATCSMABF EQU   ATCAOSM+428
ATCSMAPR EQU   ATCAOSM+424
ATCTPWQA EQU   ATCAOSM+420
ATCSMAID EQU   ATCAOSM+416
ATCSMARA EQU   ATCAOSM+412
ATCCACXA EQU   ATCAOSM+408
ATCZLAAB EQU   ATCAOSM+404
ATCATA10 EQU   ATCAOSM+400
ATCHLTCB EQU   ATCAOSM+396
@NM00020 EQU   ATCVTFLG
ATCVTACT EQU   ATCVTFLG
ATCRPT40 EQU   ATCAOSM+388
ATCRPT39 EQU   ATCAOSM+384
ATCRPT38 EQU   ATCAOSM+380
ATCRPT37 EQU   ATCAOSM+376
ATCRPT36 EQU   ATCAOSM+372
ATCRPT35 EQU   ATCAOSM+368
ATCRPT34 EQU   ATCAOSM+364
ATCRPT33 EQU   ATCAOSM+360
ATCRPT32 EQU   ATCAOSM+356
ATCRPT31 EQU   ATCAOSM+352
ATCRPT30 EQU   ATCAOSM+348
ATCRPT29 EQU   ATCAOSM+344
ATCRPT28 EQU   ATCAOSM+340
ATCRPT27 EQU   ATCAOSM+336
@NM00019 EQU   ATCAOSM+333
@NM00018 EQU   @NM00017
ATCSNUF  EQU   @NM00017
ATCOPKL  EQU   @NM00017
ATCABEN  EQU   @NM00017
ATCAIWT  EQU   ATCAOSM+328
ATCINFDD EQU   ATCAOSM+324
ATCORFMG EQU   ATCAOSM+320
ATCORFRL EQU   ATCAOSM+316
ATCOROBT EQU   ATCAOSM+312
ATCORQG  EQU   ATCORSRB
ATCORTBF EQU   ATCSQAFR
ATCRPLAC EQU   ATCRPLCN+2
ATCRPLRC EQU   ATCRPLCN
ATCCRPLQ EQU   ATCCRPL
ATCSRBAC EQU   ATCSRBCN+2
ATCSRBRC EQU   ATCSRBCN
ATCSRBQ  EQU   ATCSRB
ATCCRAAC EQU   ATCCRACN+2
ATCCRARC EQU   ATCCRACN
ATCCRAQ  EQU   ATCCRA
ATCRPT12 EQU   ATCAOSM+276
ATCDMAPP EQU   ATCAOSM+272
ATCAP38  EQU   ATCAOSM+268
ATCZDFJ0 EQU   ATCAOSM+260
ATCAP51  EQU   ATCAOSM+256
ATCZPAB2 EQU   ATCAOSM+224
ATCZPAB1 EQU   ATCAOSM+192
ATCZLFVT EQU   ATCAOSM+188
ATCZLPVT EQU   ATCAOSM+184
ATCZDVTX EQU   ATCAOSM+180
ATCZDVTA EQU   ATCAOSM+176
ATCZDVT9 EQU   ATCAOSM+172
ATCZDVT8 EQU   ATCAOSM+168
ATCZDVT7 EQU   ATCAOSM+164
ATCRSV56 EQU   ATCDAPVT+22
ATCDAPDG EQU   ATCDAPVT+20
ATCDXCEA EQU   ATCDAPVT+16
ATCDCEA  EQU   ATCDAPVT+12
ATCDPCIA EQU   ATCDAPVT+8
ATCDSIOA EQU   ATCDAPVT+4
ATCDEOEA EQU   ATCDAPVT
ATCZLAEA EQU   ATCLDAPP+16
ATCZLCEA EQU   ATCLDAPP+12
ATCRSV17 EQU   ATCLDAPP+8
ATCSMFRR EQU   ATCLDAPP+4
ATCCDTID EQU   ATCLDAPP
ATCZAEA  EQU   ATCICAPP+16
ATCZCEA  EQU   ATCICAPP+12
ATCCDTCB EQU   ATCICAPP+8
ATCZSIOA EQU   ATCICAPP+4
ATCCDRPH EQU   ATCICAPP
ATCAP65  EQU   ATCAOSM+96
ATCZDVT6 EQU   ATCAOSM+92
ATCZDVT4 EQU   ATCAOSM+88
ATCZDVT3 EQU   ATCAOSM+84
ATCZDVT1 EQU   ATCAOSM+80
ATCICNCB EQU   ATCAOSM+76
ATCAP64  EQU   ATCAOSM+64
ATCAP63  EQU   ATCAOSM+60
ATCAP61  EQU   ATCAOSM+56
ATCAP58  EQU   ATCAOSM+52
ATCAP57  EQU   ATCAOSM+48
ATCAP54  EQU   ATCAOSM+44
ATCAP53  EQU   ATCAOSM+40
ATCAP52  EQU   ATCAOSM+36
ATCAP32  EQU   ATCAOSM+28
ATCAP31  EQU   ATCAOSM+24
ATCAP12  EQU   ATCAOSM+20
ATCAP11  EQU   ATCAOSM+16
ATCCMTCB EQU   ATCAOSM+12
ATCPRPH  EQU   ATCAOSM+8
ATCGSRBF EQU   ATCGSRBG
ATCSRBRT EQU   ATCAOSM
@NM00016 EQU   @NM00015
ATCVTMAB EQU   @NM00015
@NM00014 EQU   ATCVTBAM
ATCVDLOK EQU   ISTATCVT+904
ATCVFPAB EQU   ISTATCVT+872
ATCVDPAB EQU   ISTATCVT+840
ATCIOECB EQU   ISTATCVT+836
ATCINCW3 EQU   ISTATCVT+832
ATCMODTB EQU   ISTATCVT+828
ATCUSSPT EQU   ISTATCVT+824
ATCSRTAB EQU   ISTATCVT+820
@NM00013 EQU   ISTATCVT+819
@NM00012 EQU   ATCSTAT2
ATCTRSMS EQU   ATCSTAT2
ATCTRLOK EQU   ATCSTAT2
ATCTRPSS EQU   ATCSTAT2
ATCTRESC EQU   ATCSTAT2
ATCTRAPI EQU   ATCSTAT2
ATCNMCTR EQU   ISTATCVT+816
ATCSEC51 EQU   ATCSECST
ATCSEC40 EQU   ATCSIPD+8
ATCSEC30 EQU   ATCSIPD+4
ATCSEC21 EQU   ATCSIPD
ATCSEC10 EQU   ATCSOPD+4
ATCSEC01 EQU   ATCSOPD
ATCPOIA  EQU   ATCRNO+1
@NM00011 EQU   ATCRNO
ATCPODVT EQU   ISTATCVT+784
ATCS49XL EQU   ISTATCVT+780
ATCS49XI EQU   ISTATCVT+776
ATCLCLCT EQU   ATCVLCNT+2
ATCRNCNT EQU   ATCVLCNT
ATCCFEAD EQU   ISTATCVT+768
ATCPTR00 EQU   ISTATCVT+736
ATCRSV10 EQU   ISTATCVT+704
ATCTACB  EQU   ISTATCVT+700
ATCVTINM EQU   ISTATCVT+696
ATCTCLIM EQU   ISTATCVT+692
ATCTCLOM EQU   ISTATCVT+688
ATCVTIPB EQU   ISTATCVT+656
ATCTCIPB EQU   ISTATCVT+624
ATCTIPAB EQU   ISTATCVT+592
ATCOCCCB EQU   ISTATCVT+588
ATCOCCOB EQU   ISTATCVT+584
ATCCDLAD EQU   ISTATCVT+580
ATCCCLAD EQU   ISTATCVT+576
ATCDLRPB EQU   ISTATCVT+544
ATCPGPAB EQU   ISTATCVT+512
ATCVPAB1 EQU   ISTATCVT+480
ATCRSV97 EQU   ISTATCVT+476
ATCRDTLK EQU   ISTATCVT+472
ATCVOCLK EQU   ISTATCVT+468
ATCCDFDN EQU   ISTATCVT+464
ATCCDFIN EQU   ISTATCVT+460
ATCDVTLK EQU   ISTATCVT+456
ATCAP36  EQU   ISTATCVT+452
ATCAP35  EQU   ISTATCVT+448
ATCAP33  EQU   ISTATCVT+444
ATCRSV99 EQU   ISTATCVT+440
ATCONFIG EQU   ISTATCVT+432
ATCNODDS EQU   ISTATCVT+428
ATCNODEL EQU   ISTATCVT+420
ATCRSV69 EQU   ISTATCVT+416
ATCAPCR5 EQU   ISTATCVT+412
ATCLDECB EQU   ISTATCVT+408
ATCLDNCS EQU   ISTATCVT+404
ATCCDPTR EQU   ISTATCVT+400
ATCADEL  EQU   ISTATCVT+396
ATCTODVT EQU   ISTATCVT+392
ATCDEBCH EQU   ISTATCVT+388
ATCHBSIZ EQU   ATCHPGM+2
ATCHBFNO EQU   ATCHPGM
ATCCRME  EQU   ISTATCVT+380
ATCRVCHS EQU   ISTATCVT+372
ATCECTLP EQU   ISTATCVT+368
ATCZDVTB EQU   ISTATCVT+364
ATCECPRT EQU   ISTATCVT+360
ATCVTLOD EQU   ISTATCVT+356
ATCTRPAB EQU   ISTATCVT+352
ATCMSGM  EQU   ISTATCVT+348
ATCMSGP  EQU   ISTATCVT+344
ATCEPT   EQU   ISTATCVT+340
ATCDVT   EQU   ISTATCVT+336
ATCTRCPT EQU   ISTATCVT+332
ATCDVLOD EQU   ISTATCVT+328
ATCALERT EQU   ISTATCVT+324
ATCEPA   EQU   ISTATCVT+320
ATCSAF   EQU   ISTATCVT+318
ATCXRANG EQU   ISTATCVT+317
ATCLAST  EQU   ATCSHRFG
ATCSHRTN EQU   ISTATCVT+308
ATCUEP   EQU   ISTATCVT+304
ATCOCRT  EQU   ISTATCVT+300
ATCCSMA  EQU   ATCCSMR
ATCESC02 EQU   ISTATCVT+292
ATCESC01 EQU   ISTATCVT+288
ATCCDFND EQU   ISTATCVT+284
ATCCDDEL EQU   ISTATCVT+280
ATCCDADD EQU   ISTATCVT+276
ATCMNT   EQU   ISTATCVT+272
ATCRSV16 EQU   ISTATCVT+270
ATCMAXID EQU   ISTATCVT+269
ATCMSGSP EQU   ATCCOM+268
ATCCIDM  EQU   ATCCOM+266
ATCACTRM EQU   ATCCOM+264
ATCNERAP EQU   ATCCOM+260
ATCNESAL EQU   ATCCOM+256
ATCRCC65 EQU   ATCCOM+252
ATCRCC26 EQU   ATCCOM+248
ATCRCC63 EQU   ATCCOM+244
ATCRSV11 EQU   ATCCOM+242
ATCVTMID EQU   ATCCOM+240
ATCAPOST EQU   ATCCOM+236
ATCNERFN EQU   ATCCOM+232
ATCNERNE EQU   ATCCOM+228
ATCNERCV EQU   ATCCOM+224
ATCNERST EQU   ATCCOM+220
ATCDCC61 EQU   ATCCOM+216
ATCDCC60 EQU   ATCCOM+212
ATCSRTDF EQU   ATCCOM+208
ATCSRTAD EQU   ATCCOM+204
ATCFIRA  EQU   ATCCOM+200
ATCSMBQ  EQU   ATCCOM+196
ATCSMRC  EQU   ATCCOM+192
ATCSMQU  EQU   ATCCOM+184
ATCSMRQ  EQU   ATCCOM+180
ATCACDA  EQU   ATCCOM+176
ATCSTMA  EQU   ATCCOM+172
ATCFRSTR EQU   ATCCOM+168
ATCGTSTR EQU   ATCCOM+164
ATCREADA EQU   ATCCOM+160
ATCALOAD EQU   ATCCOM+156
ATCBLDLA EQU   ATCCOM+152
ATCFBRPH EQU   ATCCOM+148
ATCBFTRC EQU   ATCCOM+144
ATCTPBUF EQU   ATCTHTRC
ATCREMOV EQU   ATCCOM+136
ATCADD   EQU   ATCCOM+132
ATCDVTPT EQU   ATCCOM+124
ATCFEPT  EQU   ATCCOM+120
ATCFDVT  EQU   ATCCOM+116
ATCCONFT EQU   ATCCOM+112
ATCPTCHA EQU   ATCCOM+108
ATCAUTHA EQU   ATCCOM+104
ATCACCTA EQU   ATCCOM+100
ATCRDTH  EQU   ATCCOM+96
ATCFRSCH EQU   ATCCOM+92
ATCFSB   EQU   ATCCOM+88
ATCHLTMS EQU   ATCCOM+84
ATCECPRM EQU   ATCCOM+80
ATCECNET EQU   ATCCOM+76
ATCECOPC EQU   ATCCOM+72
ATCVPARM EQU   ATCCOM+68
ATCECVRQ EQU   ATCCOM+64
ATCECSES EQU   ATCCOM+60
ATCOCHA  EQU   ATCCOM+56
ATCDSPLQ EQU   ATCCOM+52
ATCECDSP EQU   ATCCOM+48
ATCVARYQ EQU   ATCCOM+44
ATCECVRY EQU   ATCCOM+40
ATCHALTQ EQU   ATCCOM+36
ATCECHLT EQU   ATCCOM+32
ATCMODQ  EQU   ATCCOM+28
ATCECMOD EQU   ATCCOM+24
ATCASCHD EQU   ATCCOM+20
ATCSRT   EQU   ATCCOM+16
ATCRDT   EQU   ATCCOM+12
ATCDCFRR EQU   ATCCOM+8
ATCAPI   EQU   ATCCOM+4
ATCRSV04 EQU   ATCSTAT4
ATCVTTRC EQU   ATCSTAT4
ATCNCSD  EQU   ATCSTAT4
ATCMTST  EQU   ATCSTAT4
ATCTPRT  EQU   ATCSTAT4
ATCPRTAT EQU   ATCSTAT4
@NM00010 EQU   ATCPOFLG
ATCPOUNS EQU   ATCPOFLG
ATCHSDMF EQU   ATCSTFLG
@NM00009 EQU   ATCSTAT1
ATCMDHLT EQU   ATCSTAT1
ATCINHLT EQU   ATCSTAT1
ATCNETSL EQU   ATCSTAT1
ATCQKHLT EQU   ATCSTAT1
ATCSNHLT EQU   ATCSTAT1
ATCACTIV EQU   ATCSTAT1
ATCSTART EQU   ATCSTAT1
LOKXCL   EQU   @NM00007
LOKPRY   EQU   @NM00007
@NM00008 EQU   @NM00007
@NM00006 EQU   LOKCHNG
LOKCT    EQU   ISTLOK
DYPPAB   EQU   ISTDYPAB+16
DYPRSV01 EQU   ISTDYPAB+12
DYPTSKID EQU   ISTDYPAB+8
DYPCHAIN EQU   ISTDYPAB+4
DYPFLGS  EQU   ISTDYPAB+2
DYPLNGTH EQU   ISTDYPAB+1
DYPTYPE  EQU   ISTDYPAB
PABRPHA  EQU   PABRPHFG+1
PABNODQ  EQU   PABFLAGS
PABINHBT EQU   PABFLAGS
PABERLOK EQU   PABERRLK
PABSSN   EQU   PABFLAGS
PABDYNAM EQU   PABFLAGS
PABNORPR EQU   PABFLAGS
PABPRIOR EQU   PABFLAGS
PABAPYP  EQU   PABFLAGS
PABDVTA  EQU   ISTPAB+9
PABOFFST EQU   ISTPAB+8
PABCHNGP EQU   PABCHAIN+1
PABRSV02 EQU   PABCHAIN
PABDELAY EQU   PABCHAIN
PABRUNNG EQU   PABCHAIN
PABRESET EQU   PABCHAIN
PABUNCON EQU   PABCHAIN
PABCDP   EQU   PABCHAIN
PABRESCH EQU   PABCHAIN
PABCHNG  EQU   PABCHAIN
PABWEQP  EQU   PABWEQA+1
PABRSV01 EQU   PABWEQA
PABWEQG  EQU   PABWEQA
RPHNEXPO EQU   ISTRPH+104
RPHSAV16 EQU   RPHWORK+60
RPHSAV15 EQU   RPHWORK+56
RPHSAV14 EQU   RPHWORK+52
RPHSAV13 EQU   RPHWORK+48
RPHSAV12 EQU   RPHWORK+44
RPHSAV11 EQU   RPHWORK+40
RPHSAV10 EQU   RPHWORK+36
RPHSAVE9 EQU   RPHWORK+32
RPHSAVE8 EQU   RPHWORK+28
RPHSAVE7 EQU   RPHWORK+24
RPHSAVE6 EQU   RPHWORK+20
RPHSAVE5 EQU   RPHWORK+16
RPHSAVE4 EQU   RPHWORK+12
RPHSAVE3 EQU   RPHWORK+8
RPHSAVE2 EQU   RPHWORK+4
RPHSHALF EQU   RPHSAVE1+2
RPHSBIT8 EQU   RPHSBITS
RPHSBIT7 EQU   RPHSBITS
RPHSBIT6 EQU   RPHSBITS
RPHSBIT5 EQU   RPHSBITS
RPHSBIT4 EQU   RPHSBITS
RPHSBIT3 EQU   RPHSBITS
RPHSBIT2 EQU   RPHSBITS
RPHSBIT1 EQU   RPHSBITS
RPHSBYTE EQU   RPHSAVE1
RPHPABQP EQU   RPHPABQA+1
RPHPABFG EQU   RPHPABQA
RPHSRP34 EQU   RPHSRPRM+2
RPHSRP12 EQU   RPHSRPRM
RPHWEGT  EQU   RPHCSPA
RPHMAJCB EQU   ISTRPH+21
RPHPABOF EQU   ISTRPH+20
RPHRESUM EQU   RPHRESMA+1
RPHRSV01 EQU   RPHWPFLG
RPHPURGE EQU   RPHWPFLG
RPHPT    EQU   RPHWPFLG
RPHWT    EQU   RPHWPFLG
RPHRSKEY EQU   RPHWPFLG
RPHDVTA  EQU   ISTRPH+12
RPHTIK   EQU   RPHTSKID+3
@NM00005 EQU   RPHTSKID
RPHRPHAP EQU   RPHRPHA+1
@NM00004 EQU   RPHRPHA
RPHGATE  EQU   RPHRPHA
@NM00003 EQU   RPHFLGB
RPHRLCRA EQU   RPHFLGB
RPHNRSAV EQU   RPHFLGB
RPHPGCMP EQU   RPHFLGB
RPHFBAPS EQU   RPHFLGB
RPHBSSP  EQU   RPHFLGB
RPHLOCK  EQU   RPHFLGB
RPHFNFLG EQU   RPHFSTLC
RPHMLTCP EQU   RPHFLAGS
RPHSMCLR EQU   RPHFLAGS
RPHSMTYP EQU   RPHFLAGS
RPHSMQ   EQU   RPHFLAGS
RPHAUTEX EQU   RPHAPTYP
RPHSPGIN EQU   RPHFLAGS
RPHOGIND EQU   RPHFLAGS
RPHLNGTH EQU   RPHCNTL+1
RPHTYPE  EQU   RPHCNTL
CVTLEVL  EQU   CVTRELNO+2
CVTNUMB  EQU   CVTRELNO
CVTMDL   EQU   CVTFIX+250
@NM00002 EQU   CVTFIX+248
@NM00001 EQU   CVTFIX
CVTRV482 EQU   CVTXTNT2+128
CVTRV481 EQU   CVTXTNT2+124
CVTRV480 EQU   CVTXTNT2+120
CVTRV479 EQU   CVTXTNT2+118
CVTRV478 EQU   CVTXTNT2+117
CVTRV477 EQU   CVTXTNT2+116
CVTRV476 EQU   CVTXTNT2+115
CVTRV475 EQU   CVTXTNT2+114
CVTRV474 EQU   CVTRV466
CVTRV473 EQU   CVTRV466
CVTRV472 EQU   CVTRV466
CVTRV471 EQU   CVTRV466
CVTRV470 EQU   CVTRV466
CVTRV469 EQU   CVTRV466
CVTRV468 EQU   CVTRV466
CVTRV467 EQU   CVTRV466
CVTRV465 EQU   CVTRV457
CVTRV464 EQU   CVTRV457
CVTRV463 EQU   CVTRV457
CVTRV462 EQU   CVTRV457
CVTRV461 EQU   CVTRV457
CVTRV460 EQU   CVTRV457
CVTRV459 EQU   CVTRV457
CVTRV458 EQU   CVTRV457
CVTRV456 EQU   CVTXTNT2+108
CVTRV455 EQU   CVTXTNT2+104
CVTRV454 EQU   CVTXTNT2+100
CVTRV453 EQU   CVTXTNT2+96
CVTRV452 EQU   CVTXTNT2+94
CVTRV451 EQU   CVTXTNT2+92
CVTRV450 EQU   CVTXTNT2+90
CVTRV449 EQU   CVTXTNT2+88
CVTRV448 EQU   CVTXTNT2+87
CVTRV447 EQU   CVTXTNT2+86
CVTRV446 EQU   CVTRV438
CVTRV445 EQU   CVTRV438
CVTRV444 EQU   CVTRV438
CVTRV443 EQU   CVTRV438
CVTRV442 EQU   CVTRV438
CVTRV441 EQU   CVTRV438
CVTRV440 EQU   CVTRV438
CVTRV439 EQU   CVTRV438
CVTRV437 EQU   CVTRV429
CVTRV436 EQU   CVTRV429
CVTRV435 EQU   CVTRV429
CVTRV434 EQU   CVTRV429
CVTRV433 EQU   CVTRV429
CVTRV432 EQU   CVTRV429
CVTRV431 EQU   CVTRV429
CVTRV430 EQU   CVTRV429
CVTRV428 EQU   CVTXTNT2+80
CVTRV427 EQU   CVTXTNT2+76
CVTRV426 EQU   CVTXTNT2+72
CVTRV425 EQU   CVTXTNT2+68
CVTATACT EQU   CVTATCVT
CVTRV423 EQU   CVTXTNT2+62
CVTRV422 EQU   CVTXTNT2+60
CVTRV421 EQU   CVTXTNT2+58
CVTRV420 EQU   CVTXTNT2+56
CVTRV419 EQU   CVTXTNT2+55
CVTRV418 EQU   CVTXTNT2+54
CVTRV417 EQU   CVTRV409
CVTRV416 EQU   CVTRV409
CVTRV415 EQU   CVTRV409
CVTRV414 EQU   CVTRV409
CVTRV413 EQU   CVTRV409
CVTRV412 EQU   CVTRV409
CVTRV411 EQU   CVTRV409
CVTRV410 EQU   CVTRV409
CVTRV408 EQU   CVTRV400
CVTRV407 EQU   CVTRV400
CVTRV406 EQU   CVTRV400
CVTRV405 EQU   CVTRV400
CVTRV404 EQU   CVTRV400
CVTRV403 EQU   CVTRV400
CVTRV402 EQU   CVTRV400
CVTRV401 EQU   CVTRV400
CVTICB   EQU   CVTXTNT2+48
CVTSKTA  EQU   CVTXTNT2+44
CVTSHSB  EQU   CVTSHS
CVTRSV98 EQU   CVTXTNT2+36
CVTRSV97 EQU   CVTXTNT2+34
CVTRSV96 EQU   CVTXTNT2+32
CVTOLTEP EQU   CVTXTNT2+28
CVTQIDA  EQU   CVTQID+1
CVTRSV95 EQU   CVTQID
CVTRSV94 EQU   CVTXTNT2+20
CVTRSV93 EQU   CVTXTNT2+16
CVTRSV92 EQU   CVTXTNT2+12
CVTDEBVR EQU   CVTXTNT2+8
CVTRSV91 EQU   CVTXTNT2+6
CVTRSV9H EQU   CVTFLGBT
CVTRSV9G EQU   CVTFLGBT
CVTRSV9F EQU   CVTFLGBT
CVTRSV9E EQU   CVTFLGBT
CVTRSV9D EQU   CVTFLGBT
CVTRSV9C EQU   CVTFLGBT
CVTVME   EQU   CVTFLGBT
CVTNPE   EQU   CVTFLGBT
CVTNUCLS EQU   CVTXTNT2+4
CVTDSSVA EQU   CVTDSSV+1
CVTRSV89 EQU   CVTDSSV
CVTRSV88 EQU   CVTXTNT1+8
CVTRSV87 EQU   CVTXTNT1+4
CVTFACHN EQU   CVTXTNT1
CVTRV488 EQU   CVTMAP+412
CVTRV487 EQU   CVTMAP+408
CVTRV486 EQU   CVTMAP+404
CVTRV485 EQU   CVTMAP+400
CVTACTAP EQU   CVTMAP+396
CVTAUTH  EQU   CVTMAP+392
CVTATMCA EQU   CVTATMCT+1
CVTATMST EQU   CVTATMCT
CVTRSV61 EQU   CVTMAP+384
CVTVOLT1 EQU   CVTVOLM1+1
CVTVOLI1 EQU   CVTVOLF1
CVTSTOA  EQU   CVTMAP+376
CVTRSV58 EQU   CVTMAP+374
CVTRSV57 EQU   CVTMAP+372
CVTDDCE  EQU   CVTMAP+368
CVTPNWFR EQU   CVTMAP+364
CVTSMF   EQU   CVTMAP+360
CVTSULK  EQU   CVTMAP+358
CVTSLKO  EQU   CVTSYSK
CVTSLKP  EQU   CVTSYSK
CVTSLKQ  EQU   CVTSYSK
CVTSLKR  EQU   CVTSYSK
CVTRSV56 EQU   CVTSYSK
CVTRSV55 EQU   CVTSYSK
CVTRSV54 EQU   CVTSYSK
CVTRSV53 EQU   CVTSYSK
CVTRSV52 EQU   CVTA1F1
CVTRSV51 EQU   CVTA1F1
CVTRSV50 EQU   CVTA1F1
CVTRSV49 EQU   CVTA1F1
CVTRSV48 EQU   CVTA1F1
CVTRSV47 EQU   CVTA1F1
CVTSRSW  EQU   CVTA1F1
CVTPFSW  EQU   CVTA1F1
CVTPCVT  EQU   CVTMAP+352
CVTRSV46 EQU   CVTMAP+344
CVTRSV45 EQU   CVTMAP+340
CVTRSV44 EQU   CVTMAP+338
CVTRSV43 EQU   CVTMAP+336
CVTHJESA EQU   CVTHJES+1
CVTRSV42 EQU   CVTHJES
CVTEXT2A EQU   CVTEXT2+1
CVTRSV41 EQU   CVTEXT2
CVTAPFA  EQU   CVTAPF+1
CVTRSV40 EQU   CVTAPF
CVTRV518 EQU   CVTINTLA
CVTRV517 EQU   CVTERPV
CVTEORM  EQU   CVTMAP+312
CVTMCHPR EQU   CVTMAP+308
CVTTZ    EQU   CVTMAP+304
CVTJEPS  EQU   CVTMAP+300
CVTJESCT EQU   CVTMAP+296
CVTMODE  EQU   CVTMAP+292
CVTPTRV  EQU   CVTMAP+288
CVTREAL  EQU   CVTMAP+284
CVTRSV39 EQU   CVTMAP+280
CVTRSV38 EQU   CVTMAP+276
CVTDMSRA EQU   CVTDMSR+1
CVTRV634 EQU   CVTDMSRF
CVTRV633 EQU   CVTDMSRF
CVTRV632 EQU   CVTDMSRF
CVTRV631 EQU   CVTDMSRF
CVTRV630 EQU   CVTDMSRF
CVTRV629 EQU   CVTDMSRF
CVTUDUMP EQU   CVTDMSRF
CVTSDUMP EQU   CVTDMSRF
CVTQMSGA EQU   CVTQMSG+1
CVTRSV36 EQU   CVTQMSG
CVTAMFF  EQU   CVTMAP+264
CVTPURGA EQU   CVTPURG+1
CVTRSV35 EQU   CVTPURG
CVTCBSP  EQU   CVTMAP+256
CVTATERA EQU   CVTATER+1
CVTSYST  EQU   CVTATER
CVTVOLT2 EQU   CVTTAT
CVTVOLI2 EQU   CVTVOLF2
CVTAQAVB EQU   CVTAQAVT+1
CVTRSV34 EQU   CVTTCMFG
CVTRSV33 EQU   CVTTCMFG
CVTRSV32 EQU   CVTTCMFG
CVTRSV31 EQU   CVTTCMFG
CVTRSV30 EQU   CVTTCMFG
CVTRSV29 EQU   CVTTCMFG
CVTRSV28 EQU   CVTTCMFG
CVTTCRDY EQU   CVTTCMFG
CVTGTFA  EQU   CVTGTF+1
CVTRSV27 EQU   CVTGTFST
CVTRNIO  EQU   CVTGTFST
CVTUSR   EQU   CVTGTFST
CVTRV318 EQU   CVTFORM
CVTRV317 EQU   CVTTMODE
CVTRV316 EQU   CVTSTATE
CVTRV315 EQU   CVTGTFS
CVTGTFAV EQU   CVTGTFS
CVT0SCR1 EQU   CVTMAP+232
CVTRV515 EQU   CVTMAP+228
CVTRMS   EQU   CVTMAP+224
CVTPATCH EQU   CVTMAP+220
CVTTSCE  EQU   CVTMAP+216
CVTLNKSC EQU   CVTMAP+214
CVTQABST EQU   CVTMAP+212
CVTMDLDS EQU   CVTMAP+208
CVTUSER  EQU   CVTMAP+204
CVTABEND EQU   CVTMAP+200
CVTSMCA  EQU   CVTMAP+196
CVTRSV18 EQU   CVTMAP+192
CVTQLPAQ EQU   CVTMAP+188
CVTQCDSR EQU   CVTMAP+184
CVTRSV17 EQU   CVTOPTB
CVTRSV16 EQU   CVTOPTB
CVTFP    EQU   CVTOPTB
CVTAPTHR EQU   CVTOPTB
CVTNLOG  EQU   CVTOPTB
CVTTOD   EQU   CVTOPTB
CVTCTIMS EQU   CVTOPTB
CVTPROT  EQU   CVTOPTB
CVTXPFP  EQU   CVTOPTA
CVTASCII EQU   CVTOPTA
CVTRSV13 EQU   CVTOPTA
CVTRSV12 EQU   CVTOPTA
CVTNIP   EQU   CVTOPTA
CVTDDR   EQU   CVTOPTA
CVTAPR   EQU   CVTOPTA
CVTCCH   EQU   CVTOPTA
CVTSNCTR EQU   CVTMAP+180
CVTQMWR  EQU   CVTMAP+176
CVTQOCR  EQU   CVTMAP+172
CVT1EF00 EQU   CVTMAP+168
CVTMZ00  EQU   CVTMAP+164
CVTHEAD  EQU   CVTMAP+160
CVTRSV11 EQU   CVTMAP+156
CVT0PT01 EQU   CVTMAP+152
CVTMSER  EQU   CVTMAP+148
CVTRV516 EQU   CVTIERLC
CVTILCH  EQU   CVTMAP+140
CVT0DS   EQU   CVTMAP+136
CVTFBOSV EQU   CVTMAP+132
CVTNUCB  EQU   CVTMAP+128
CVTIXAVL EQU   CVTMAP+124
CVTIOQET EQU   CVTMAP+120
CVTDCBA  EQU   CVTMAP+117
CVTMVS2  EQU   CVTDCB
CVT6DAT  EQU   CVTDCB
CVT4MPS  EQU   CVTDCB
CVTRSV09 EQU   CVTDCB
CVT4MS1  EQU   CVTDCB
CVT2SPS  EQU   CVTDCB
CVT1SSS  EQU   CVTDCB
CVTRSV08 EQU   CVTDCB
CVTSTB   EQU   CVTMAP+112
CVTQTD00 EQU   CVTMAP+108
CVTQTE00 EQU   CVTMAP+104
CVTCUCB  EQU   CVTMAP+100
CVTSJQ   EQU   CVTMAP+96
CVTPBLDL EQU   CVTMAP+92
CVTTPC   EQU   CVTMAP+88
CVTSVDCB EQU   CVTMAP+84
CVTBRET  EQU   CVTMAP+82
CVTEXIT  EQU   CVTMAP+80
CVT0FN00 EQU   CVTMAP+76
CVTDARA  EQU   CVTDAR+1
CVTRSV07 EQU   CVTFLGS1
CVTRSV06 EQU   CVTFLGS1
CVTRSV05 EQU   CVTFLGS1
CVTRSV04 EQU   CVTFLGS1
CVTRSV03 EQU   CVTFLGS1
CVTRSV02 EQU   CVTFLGS1
CVTRSV01 EQU   CVTFLGS1
CVTDMPLK EQU   CVTFLGS1
CVTXITP  EQU   CVTMAP+68
CVTZDTAB EQU   CVTMAP+64
CVTMSLT  EQU   CVTMAP+60
CVTDATE  EQU   CVTMAP+56
CVTBTERM EQU   CVTMAP+52
CVTSYSAD EQU   CVTMAP+48
CVTXTLER EQU   CVTMAP+44
CVTILK2  EQU   CVTMAP+40
CVTILK1  EQU   CVTMAP+36
CVTPRLTV EQU   CVTMAP+32
CVTPCNVT EQU   CVTMAP+28
CVT0VL00 EQU   CVTMAP+24
CVTXAPG  EQU   CVTMAP+20
CVTBUF   EQU   CVTMAP+16
CVTJOB   EQU   CVTMAP+12
CVTLINK  EQU   CVTMAP+8
CVT0EF00 EQU   CVTMAP+4
CVTTCBP  EQU   CVTMAP
CVT      EQU   CVTMAP
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS
SEG000C# EQU   @RC00451
SEG000D# EQU   @RC00459
@RT00606 EQU   @RC00601
@RC00604 EQU   @RC00601
SEG000D@ EQU   @PB00004
@RC00702 EQU   @RC00699
@PB00006 EQU   @PB00007
@PB00005 EQU   @PB00006
@RC00705 EQU   @RC00702
@ENDDATA EQU   *
         END   ISTZIFAB,(C'PLS1955',0603,78018)
