//TEC0169I JOB (T369055000),TIM.BAKER,CLASS=B,NOTIFY=TEC0169,MSGCLASS=X
/*JOBPARM ROOM=2,S=C033
//*
//*******************************************************************
//*                                                                 *
//*  THIS USER MOD ADDS AN OPTION TO THE DATA SET UTILITY DRIVER    *
//*  ROUTINE TO PRINT A INDEX LISTING WITH SPF STATS EVEN IF LOAD   *
//*  STATS ARE PRESENT.  THE NEW OPTION IS S.                       *
//*  THIS FIX MUST BE APPLIED WITH FE70006.  JOB SPFUDA1 SHOULD BE  *
//*  RUN AFTER BOTH USER MODS ARE APPLIED TO ASSEMBLE AND LINK      *
//*  UDA AND UDX THEN SPFUDA IS LINKED.                             *
//*                                                                 *
//*******************************************************************
//*
//COPYOUT EXEC PGM=IEBCOPY,REGION=1024K
//SYSPRINT  DD SYSOUT=*
//SYSIN     DD *
  COPY INDD=SYSUT1,OUTDD=SYSUT2
  SELECT MEMBER=((ISPUDX,ISPUDXO))
//SYSUT1    DD DSN=SYS9.SPF100P1.SOURCE,DISP=SHR
//SYSUT2    DD DSN=&TEMP,DISP=(NEW,KEEP),UNIT=VIO,SPACE=(CYL,(1,1,1)),
//             DCB=*.SYSUT1
//*
//COPYIN  EXEC PGM=IEBCOPY,REGION=1024K
//SYSPRINT  DD SYSOUT=*
//SYSIN     DD *
  COPY INDD=SYSUT1,OUTDD=SYSUT2
  SELECT MEMBER=(ISPUDXO)
//SYSUT1    DD DSN=&TEMP,DISP=(OLD,DELETE)
//SYSUT2    DD DSN=SYS9.SPF100P1.SOURCE,DISP=SHR
//*
//CHANGE  EXEC PGM=IEBUPDTE
//SYSPRINT  DD SYSOUT=*
//SYSUT1    DD DSN=SYS9.SPF100P1.SOURCE,DISP=SHR
//SYSUT2    DD DSN=SYS9.SPF100P1.SOURCE,DISP=SHR
//SYSIN     DD *
./ CHANGE NAME=ISPUDX
         CLI   UDAOPT(UDXCOMMP),C'S'  OPTION S ?               F.E.D.S.
         BE    @RF00287               YES, PROCESS SPF STATS   F.E.D.S.
         CLI   UDAOPT(UDXCOMMP),C'S'  OPTION S ?               F.E.D.S.
         BE    @RF00507               YES, NO TOTALS           F.E.D.S.
UDAOPT   EQU   UDACOMM+256                                     F.E.D.S.
./ ENDUP
