//TEC0169I JOB (T369055000),TIM.BAKER,CLASS=B,NOTIFY=TEC4666,MSGCLASS=X
/*JOBPARM ROOM=2,S=C033
//*
//*******************************************************************
//*                                                                 *
//*  THIS USER MOD CHANGES THE 3.8 OUTLIST OPTION TO DO A LIST      *
//*  AFTER A 'DUPLICATE JOBNAME' OR 'JOB NOT FOUND' MESSAGE.  JOB   *
//*  SPFUOL SHOULD BE RUN AFTER THIS SOURCE CHANGE TO ASSEMBLE AND  *
//*  LINK THE NEW MODULE.  IF USER MOD FE70001 IS APPLIED THE       *
//*  IEBCOPY WILL NOT DESTROY THE ORIGINAL SOURCE.                  *
//*                                                                 *
//*******************************************************************
//*
//COPYOUT EXEC PGM=IEBCOPY,REGION=1024K
//SYSPRINT  DD SYSOUT=*
//SYSIN     DD *
  COPY INDD=SYSUT1,OUTDD=SYSUT2
  SELECT MEMBER=((ISPUOL,ISPUOLO))
//SYSUT1    DD DSN=SYS9.SPF100P1.SOURCE,DISP=SHR
//SYSUT2    DD DSN=&TEMP,DISP=(NEW,KEEP),UNIT=VIO,SPACE=(TRK,(1,1,1)),
//             DCB=*.SYSUT1
//*
//COPYIN  EXEC PGM=IEBCOPY,REGION=1024K
//SYSPRINT  DD SYSOUT=*
//SYSIN     DD *
  COPY INDD=SYSUT1,OUTDD=SYSUT2
  SELECT MEMBER=(ISPUOLO)
//SYSUT1    DD DSN=&TEMP,DISP=(OLD,DELETE)
//SYSUT2    DD DSN=SYS9.SPF100P1.SOURCE,DISP=SHR
//*
//CHANGE  EXEC PGM=IEBUPDTE
//SYSPRINT  DD SYSOUT=*
//SYSUT1    DD DSN=SYS9.SPF100P1.SOURCE,DISP=SHR
//SYSUT2    DD DSN=SYS9.SPF100P1.SOURCE,DISP=SHR
//SYSIN     DD *
./ CHANGE NAME=ISPUOL
*    DO OPTION 'L' IF DATA SET EMPTY                           F.E.D.S.
         MVI   UOLOPT,C'L'           CHANGE OPTION L
         MVI   UOLCMD,C' '           CLEAR 1'ST BYTE OF COMMAND AREA
         MVC   UOLCMD+1(143),UOLCMD  CLEAR REST OF COMMAND AREA
         MVC   UOLCMD(12),STATUS     MOVE NEW COMMAND TO COMMAND AREA
         MVC   UOLSJOB(8),UOLJOB     INTIAL WITH JOBNAME FROM SCREEN
         B     @RF00090              DO OPTION L
*    DO OPTION 'L' IF DATA SET EMPTY                           F.E.D.S.
STATUS   DC    CL12'STATUS <4W8>'    STATUS COMMAND            F.E.D.S.
./ ENDUP
/*
//
