&TUTORIAL --- BACKGROUND - FORTRAN (G1) COMPILE ONLY - LIST OUTPUT -----
&NEXT SELECTION ===>%SELECT                             &
$
$  LIST OUTPUT FROM THE FORTRAN COMPILER IS SENT DIRECTLY TO A SYSOUT QU
$  IF THE FOLLOWING BACKGROUND FORTRAN MENU FIELD IS SPECIFIED:
$
$SYSOUT CLASS&===> A              $
$
$  THEN THE LIST OUTPUT WILL BE SENT TO SYSOUT=(A).
$
$  NOTE THAT THE COMPILER OPTIONS "LIST" AND/OR "XREF" MUST BE SPECIFIED
$  IN THE "COMPILE OPTIONS" FIELD AS YOU DESIRE.
<ACTION>
1 SELECT CHAR(36) CURSOR;
2 SELECT CHAR(8)  LIST(' ') RETURN (' ');
3 * CHAR(8) INIT('HJOB5   ');
4 * CHAR(8) INIT('HJOB522 ');
5 * CHAR(8) INIT('        ');
<END>
