)ATTR DEFAULT(%+_)
    % TYPE(TEXT) INTENS(HIGH) COLOR(WHITE) SKIP(ON)
    Ö TYPE(TEXT) INTENS(HIGH) COLOR(YELLOW)
    + TYPE(TEXT) INTENS(LOW)  COLOR(TURQ) SKIP(ON)
    _ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED)
    ^ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED) PAD(_)
    | TYPE(INPUT) INTENS(HIGH) CAPS(OFF)
)BODY EXPAND(\\)
+-\-\-ÖO.B    BROWSE Subcommand+-\-\-
%OPTION  ===>|ZCMD
%
+Enter the member group name for%BROWSE:
%===>|LOPER

+
+Operands:%memgroup+      (e.g., *; start:end; start:; first*pat; range*
+
+
+Defaults: memgroup
)INIT
  &LOPER  = '&OPERS'
  .CURSOR = LOPER
  .HELP   = P85OPHH
  IF(&LOPER  = &Z) &LOPER=&P85#BR1
)PROC
 &P85#BR1=&LOPER
 &PDSZSEL='Browse  &LOPER'
)END
