)ATTR DEFAULT(%+_)
    % TYPE(TEXT) INTENS(HIGH) COLOR(WHITE) SKIP(ON)
    Ö TYPE(TEXT) INTENS(HIGH) COLOR(YELLOW)
    + TYPE(TEXT) INTENS(LOW)  COLOR(TURQ) SKIP(ON)
    _ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED)
    ^ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED) PAD(_)
    | TYPE(INPUT) INTENS(HIGH) CAPS(OFF)
)BODY EXPAND(\\)
%TUTORIAL  +-\-\-ÖPDS LISTA Block Commands+-\-\-
%OPTION  ===>_ZCMD

  The following doubled letters may be used to delimit block line comman
    %AA+-+Execute alternate command
    %BB+-+Browse data set
    %CC+-+Change to data set
    %EE+-+Edit data set
    %LL+-+Log line
    %MM+-+Memlist all
    %OO+-+O line command for option list
    %PP+-+Prompt for member group
    %SS+-+Select data set
    %UU+-+Usage of data set
    %ZZ+-+Compress data set
    %XX+-+Drop from the list
    %==+-+Repeat last line command


  Note: the block line command range must be started and completed on th
  same screen.  UP and DOWN functions are not allowed until all block ra
  have been completed.
)END
