PROC 0 DEBUG DATASET() MEMBER() VOLUME()
IF &DEBUG = &STR(DEBUG) THEN -
  CONTROL MSG NOFLUSH LIST CONLIST SYMLIST PROMPT ASIS
ELSE -
  CONTROL NOMSG NOFLUSH NOLIST NOCONLIST NOSYMLIST ASIS

ISPEXEC CONTROL ERRORS RETURN
IF &MEMBER = &STR() THEN -
  IF &VOLUME = &STR() THEN -
    ISPEXEC VIEW DATASET('&DATASET')
  ELSE -
    ISPEXEC VIEW DATASET('&DATASET') VOLUME(&VOLUME)
ELSE -
  IF &VOLUME = &STR() THEN -
    ISPEXEC VIEW DATASET('&DATASET(&MEMBER)')
  ELSE -
    ISPEXEC VIEW DATASET('&DATASET(&MEMBER)') VOLUME(&VOLUME)
ISPEXEC CONTROL ERRORS CANCEL

EXIT CODE(0)

/* J.KALINICH, X4521 */
/* CLIST TO INVOKE ISPF "VIEW" AS A PDS 8.5 LINE/PRIMARY COMMAND */
/* SEE MEMBER $$$CUSTM                                           */
