         TITLE 'IFG0RR0A -- RECOVERY ROUTINE INITIALIZATION && ERROR RE*
               ECORDING  '
IFG0RR0A CSECT ,                                                   0001
@MAINENT DS    0H                                                  0001
         USING *,@15                                               0001
         B     @PROLOG                                             0001
         DC    AL1(16)                                             0001
         DC    C'IFG0RR0A  76.023'                                 0001
         DROP  @15
@PROLOG  BALR  @03,0                                               0001
@PSTART  DS    0H                                                  0001
         USING @PSTART,@03                                         0001
JSCBDISP EQU 188
JSCBAOS1 EQU  72
JSCBAOS2 EQU 192
START0A  DS    0H                                                  0125
*   IF R0=12 THEN                   /* WAS AN RTCA OBTAINED          */
         C     R0,@CF00067                                         0125
         BNE   @RF00125                                            0125
*     DO;                           /* NO                            */
*       RRRF=R2->IECRRPRM;          /* GET RRPLIST PTR               */
         L     RRRF,IECRRPRM(,R2)                                  0127
*       RA=R2;                      /* SAVE PASSED ADDR              */
         LR    RA,R2                                               0128
*       R2=RA->IECCORKY;            /* GET PROPER KEY                */
         SLR   R2,R2                                               0129
         IC    R2,IECCORKY(,RA)                                    0129
*       GEN(MODESET KEYADDR=(2),WORKREG=2);/* SET PROPER KEY         */
         MODESET KEYADDR=(2),WORKREG=2
*       RRFNRTCA=ON;                /* INDICATE NO RTCA              */
         OI    RRFNRTCA(RRRF),B'01000000'                          0131
*       RRFWORK=R1;                 /* SET UP TO CHK ABEND CODE      */
         ST    R1,RRFWORK(,RRRF)                                   0132
*       IF RRFWKB4=TERM THEN        /* IS THIS A TERM ENTRY          */
         CLI   RRFWKB4(RRRF),X'22'                                 0133
         BNE   @RF00133                                            0133
*         RRFTERM=ON;               /* YES, INDICATE TERM ENTRY      */
         OI    RRFTERM(RRRF),B'00001000'                           0134
*       RRFWORK=RET;                /* SAVE RTM RETURN ADDR          */
@RF00133 ST    RET,RRFWORK(,RRRF)                                  0135
*     END;                                                         0136
*   ELSE                            /* AN RTCA WAS OBTAINED          */
*     DO;                                                          0137
         B     @RC00125                                            0137
@RF00125 DS    0H                                                  0138
*       GEN;                                                       0138
         MODESET EXTKEY=SUPR            INSURE KEY ZERO
         STM   14,12,12(13)             SAVE REGS
*       SDWAPTR=R1;                 /* RTCA PTR TO REG 7             */
         LR    SDWAPTR,R1                                          0139
*       RA=SDWAPARM;                /* GET PASSED PTR TO PREFIX      */
         L     RA,SDWAPARM(,SDWAPTR)                               0140
*       RRRF=RA->IECRRPRM;          /* GET RRPLIST PTR               */
         L     RRRF,IECRRPRM(,RA)                                  0141
*       R2=RA->IECCORKY;            /* GET PROPER KEY                */
         SLR   R2,R2                                               0142
         IC    R2,IECCORKY(,RA)                                    0142
*LVL20A:                                                           0143
*       GEN(MODESET KEYADDR=(2),WORKREG=2);/* SET PROPER KEY         */
LVL20A   MODESET KEYADDR=(2),WORKREG=2
*       IF SDWACLUP=ON THEN         /* IS THIS A TERM ENTRY          */
         TM    SDWACLUP(SDWAPTR),B'10000000'                       0144
         BNO   @RF00144                                            0144
*         RRFTERM=ON;               /* YES, INDICATE TERM ENTRY      */
         OI    RRFTERM(RRRF),B'00001000'                           0145
*       RRFWORK=RD;                 /* SAVE REG 13                   */
@RF00144 ST    RD,RRFWORK(,RRRF)                                   0146
*       RR1WRKAR=SDWAPTR;           /* SAVE RTCA PTR                 */
         ST    SDWAPTR,RR1WRKAR(,RRRF)                             0147
*     END;                                                         0148
*   R2=RA->IECCORKY;                /* INDICATE KEY                  */
@RC00125 SLR   R2,R2                                               0149
         IC    R2,IECCORKY(,RA)                                    0149
*   RFY                                                            0150
*     R4 RSTD;                      /* RESTRICT REG                  */
*   R4=R2;                          /* GET KEY IN REG 4              */
         LR    R4,R2                                               0151
*   SRL(R4,4);                      /* POSITION KEY FOR IECRES       */
         SRL   R4,4                                                0152
*   RFY                                                            0153
*     RF RSTD;                      /* RESTRICT REG                  */
*   RF=RA;                          /* SAVE PASSED PTR TO PREFIX     */
         LR    RF,RA                                               0154
*   R0=LENGTH(TRREXTX)+LENGTH(TRRWA);/* CORE SIZE REQUIRED           */
         LA    R0,792                                              0155
*   GEN(IECRES GET,PREFIX=FIRST,LV=(0),KEY=(R4),ID=RR0A)           0156
*   REFS(CVT,CVTDMSR);              /* GET CORE FOR TRR PROCESSING   */
         IECRES GET,PREFIX=FIRST,LV=(0),KEY=(R4),ID=RR0A
*   RFY                                                            0157
*     R4 UNRSTD;                    /* MAKE REG UNRESTRICTED         */
*   RD=R1;                          /* TRR W/A EXTENDED PREFIX PTR   */
         LR    RD,R1                                               0158
*   RA=RF;                          /* GET SAVED PTR TO PREFIX       */
         LR    RA,RF                                               0159
*   RFY                                                            0160
*     RF UNRSTD;                    /* MAKE REG UNRESTRICTED         */
*   GEN;                                                           0161
         BALR  RBASE,0                  SET RBASE FOR BASE REG CALC
BASECALC EQU   *                        LABEL TO RECALCULATE BASE
         LA    RBASE,0(RBASE)           INSURE HI-ORDER BYTE IS ZERO
         LA    RF,BASECALC-START0A      SET RF FOR BASE REG CALC
         SR    RBASE,RF                 SET RBASE AS BASE REG
*   RRRF=RA->IECRRPRM;              /* RESTORE RRPLIST PTR           */
         L     RRRF,IECRRPRM(,RA)                                  0162
*   RWTG=RA->IECWTGTB;              /* RESTORE WTG TABLE PTR         */
         L     RWTG,IECWTGTB(,RA)                                  0163
*   R2=RA->IECCORKY;                /* RESTORE PROPER KEY IN REG     */
         SLR   R2,R2                                               0164
         IC    R2,IECCORKY(,RA)                                    0164
*   SACALLER=RRFWORK;               /* IF AN RTCA EXISTS, THIS STMT
*                                      CHAINS THE RTM SAVE AREA. IF
*                                      AN RTCA DOES NOT EXIST, THIS
*                                      STMT SAVES THE RTM RETURN   0165
*                                      ADDRESS.                      */
         L     @15,RRFWORK(,RRRF)                                  0165
         ST    @15,SACALLER(,RD)                                   0165
*   IF RRFNRTCA=OFF THEN            /* IF AN RTCA EXISTS THEN        */
         TM    RRFNRTCA(RRRF),B'01000000'                          0166
         BNZ   @RF00166                                            0166
*     DO;                                                          0167
*       GEN(MODESET EXTKEY=SUPR);   /* SET SUPERVISOR KEY            */
         MODESET EXTKEY=SUPR
*       RRFWORK->SACALLED=RD;       /* CHAIN TRR SAVE AREA           */
         L     @15,RRFWORK(,RRRF)                                  0169
         ST    RD,SACALLED(,@15)                                   0169
*       GEN(MODESET KEYADDR=(2),WORKREG=2);/* SET PROPER KEY         */
         MODESET KEYADDR=(2),WORKREG=2
*       SDWAPTR=RR1WRKAR;           /* RESTORE RTCA PTR              */
         L     SDWAPTR,RR1WRKAR(,RRRF)                             0171
*     END;                                                         0172
*   RR1WRKAR=RD+LENGTH(TRREXTPR);   /* SAVE TRR WORK AREA POINTER    */
@RF00166 LA    @15,288                                             0173
         ALR   @15,RD                                              0173
         ST    @15,RR1WRKAR(,RRRF)                                 0173
*   TRRPFXP=ADDR(TRRPREFX);         /* SET BASE PREFIX PTR     YM4614*/
         LR    @15,RD                                              0174
         SL    @15,@CF00092                                        0174
         ST    @15,TRRPFXP(,RD)                                    0174
*   SARETRY=ADDR(OKSWAP);           /* SETUP RETRY ADDRESS     YM8511*/
         LA    @15,OKSWAP                                          0175
         ST    @15,SARETRY(,RD)                                    0175
*   RR1RETRY=ADDR(RETRY0A);         /* RETRY THIS MODULE       YM8511*/
         LA    @15,RETRY0A                                         0176
         ST    @15,RR1RETRY(,RRRF)                                 0176
*   GEN REFS(IECREGSV,IECEXTPR,TRRWTG,CVT,CVTDMSR);                0177
*        IECRES LOAD,EXTPR=(RD),MODNM=RR0A,BRANCH=NO  OPTIONAL TRACE
         LR    15,RD                    GET PTR TO EXT PREFIX    Y02080
         STM   15,12,IECREGSV-IECEXTPR+16(15) SAVE REGISTERS     Y02080
         LA    1,32                     BACK UP REGISTER 15 TO   Y02080
         SR    15,1                     POINT TO START OF PREFIX Y02080
         MVC   TRRWTG(12,13),RR0A       MOVE MODULE NAME & EPA   Y02080
         LA    6,TRRWTG(,13)            LOAD PTR TO WTG MOD NAME Y02080
         L     5,CVTPTR                 GET ADDRESS OF CVT       Y02080
         L     5,CVTDMSR-CVT(,5)        ADDRESS OF RESIDENT RTN  Y02080
         BAL   14,24(5)                 LOAD AND RETURN          Y02080
         LM    14,12,44(15)             RESTORE REGISTERS        Y02080
*   GEN(EJECT);                                                    0178
         EJECT
*                                                                  0179
*/********************************************************************/
*/*                  INVOKE SYSEVENT OKSWAP ROUTINE                  */
*/********************************************************************/
*                                                                  0179
*OKSWAP:                            /* SYSEVENT CLEANUP        YM8511*/
*   SARETRY=ADDR(FORCEDMP);         /* SETUP RETRY ADDRESS     YM8511*/
OKSWAP   LA    @15,FORCEDMP                                        0179
         ST    @15,SARETRY(,RD)                                    0179
*   CALL SYSEVENT;                  /* CALL SYSEVENT OKSWAP    YM8511*/
         BAL   @14,SYSEVENT                                        0180
*FORCEDMP:                          /* CHECK FOR SDUMP       @ZA01557*/
*   SARETRY=ADDR(ERRREC0A);         /* SETUP RETRY ADDRESS     YM8511*/
FORCEDMP LA    @15,ERRREC0A                                        0181
         ST    @15,SARETRY(,RD)                                    0181
*   IF CVTDUMPF=ON THEN             /* FORCE DUMP REQUEST    @ZA01557*/
         L     @15,CVTPTR                                          0182
         TM    CVTDUMPF(@15),B'10000000'                           0182
         BNO   @RF00182                                            0182
*     CALL SUBDUMP;                 /* CALL SDUMP            @ZA01557*/
         BAL   @14,SUBDUMP                                         0183
*   ELSE                                                           0184
*     ;                                                            0184
@RF00182 DS    0H                                                  0185
         EJECT
*                                                                  0185
*/********************************************************************/
*/*             ERROR RECORDING SUBROUTINE DETERMINATION             */
*/********************************************************************/
*                                                                  0185
*ERRREC0A:                                                         0185
*   SARETRY=ADDR(NEXTMOD);          /* SETUP RETRY ADDRESS     YM8511*/
ERRREC0A LA    @15,NEXTMOD                                         0185
         ST    @15,SARETRY(,RD)                                    0185
*   LIMIT=DIM(A);                   /* SET DEFAULT RTNS      @ZA01557*/
         MVI   LIMIT(RD),X'02'                                     0186
*   ARYPTR=ADDR(A);                 /* SUB230 & SUBGTF       @ZA01557*/
         LA    @15,A                                               0187
         ST    @15,ARYPTR(,RD)                                     0187
*   SARETRY=ADDR(ERRECALL);         /* SET UP FOR RETRY      @ZA01557*/
         LA    @15,ERRECALL                                        0188
         ST    @15,SARETRY(,RD)                                    0188
*   IF RRFNRTCA=OFF THEN            /* IF RTCA EXISTS        @ZA01557*/
         TM    RRFNRTCA(RRRF),B'01000000'                          0189
         BNZ   @RF00189                                            0189
*     IF SDWAPERC=OFF THEN          /* IF NO PERCOLATION     @ZA01557*/
         TM    SDWAPERC(SDWAPTR),B'00010000'                       0190
         BNZ   @RF00190                                            0190
*       IF USERKEY=OFF THEN         /* SYS KEY ABEND         @ZA01557*/
         TM    USERKEY(SDWAPTR),B'10000000'                        0191
         BNZ   @RF00191                                            0191
*         IF RRFFIN1=ON THEN        /* 1ST LOAD COMPLETE     @ZA01557*/
         TM    RRFFIN1(RRRF),B'10000000'                           0192
         BNO   @RF00192                                            0192
*           IF SDWAPCHK=ON THEN     /* SYS KEY PCK           @ZA01557*/
         TM    SDWAPCHK(SDWAPTR),B'01000000'                       0193
         BNO   @RF00193                                            0193
*             DO;                   /* APAR PROBLEM          @ZA01557*/
*               WADUMP=ON;          /* SDUMP INDICATOR       @ZA01557*/
         OI    WADUMP(RD),B'00100000'                              0195
*               LIMIT=DIM(B);       /* SETUP COPY WA         @ZA01557*/
         MVI   LIMIT(RD),X'04'                                     0196
*               ARYPTR=ADDR(B);     /* GTF, LOG, WTP         @ZA01557*/
         LA    @15,B                                               0197
         ST    @15,ARYPTR(,RD)                                     0197
*               TRRMSGID=MSGIDS;    /* SET MSG ID            @ZA01557*/
         MVC   TRRMSGID(8,RD),MSGIDS                               0198
*             END;                                                 0199
*           ELSE                                                   0200
*             IF SDWAMCHK=ON×       /* MCH CHK OR            @ZA01557*/
*                 SDWARKEY=ON THEN  /* RESTART KEY = SKIP    @ZA01557*/
         B     @RC00193                                            0200
@RF00193 TM    SDWAMCHK(SDWAPTR),B'10100000'                       0200
         BNZ   @RT00200                                            0200
*               GOTO NEXTMOD;       /* GO TO NEXT RTN        @ZA01557*/
*             ELSE                                                 0202
*               ;                                                  0202
*         ELSE                                                     0203
*           IF SDWAPCHK=ON THEN     /* SYS KEY PCK           @ZA05466*/
         B     @RC00192                                            0203
@RF00192 TM    SDWAPCHK(SDWAPTR),B'01000000'                       0203
         BNO   @RF00203                                            0203
*             DO;                   /* APAR PROBLEM          @ZA05466*/
*               LIMIT=DIM(C);       /* SETUP COPY WA         @ZA05466*/
         MVI   LIMIT(RD),X'03'                                     0205
*               ARYPTR=ADDR(C);     /* GTF, WTP              @ZA05466*/
         LA    @15,C                                               0206
         ST    @15,ARYPTR(,RD)                                     0206
*               TRRMSGID=MSGIDU;    /* SET MSG ID            @ZA05466*/
         MVC   TRRMSGID(8,RD),MSGIDU                               0207
*             END;                                                 0208
*           ELSE                                                   0209
*             IF SDWAPCHK=ON THEN   /* SYS KEY PCK           @ZA01557*/
         B     @RC00203                                            0209
@RF00203 TM    SDWAPCHK(SDWAPTR),B'01000000'                       0209
         BNO   @RF00209                                            0209
*               DO;                 /* APAR PROBLEM          @ZA01557*/
*                 LIMIT=DIM(C);     /* SETUP COPY WA         @ZA01557*/
         MVI   LIMIT(RD),X'03'                                     0211
*                 ARYPTR=ADDR(C);   /* GTF, WTP              @ZA01557*/
         LA    @15,C                                               0212
         ST    @15,ARYPTR(,RD)                                     0212
*                 TRRMSGID=MSGIDU;  /* SET MSG ID            @ZA01557*/
         MVC   TRRMSGID(8,RD),MSGIDU                               0213
*               END;                                               0214
*             ELSE                                                 0215
*               ;                                                  0215
@RF00209 DS    0H                                                  0216
*       ELSE                                                       0216
*         GOTO NEXTMOD;             /* GO TO NEXT RTN        @ZA01557*/
*     ELSE                                                         0217
*       ;                                                          0217
@RF00190 DS    0H                                                  0218
         EJECT
*                                                                  0218
*/********************************************************************/
*/*                 CALL ERROR RECORDING SUBROUTINES                 */
*/********************************************************************/
*                                                                  0218
*ERRECALL:                                                         0218
*   SARETRY=ADDR(RETCALL);          /* SET SAVED RETRY ADDRESS       */
@RC00190 DS    0H                                                  0218
@RF00189 DS    0H                                                  0218
ERRECALL LA    @15,RETCALL                                         0218
         ST    @15,SARETRY(,RD)                                    0218
*   RR1RETRY=ADDR(RETRY0A);         /* SET UP RETRY ADDR             */
         LA    @15,RETRY0A                                         0219
         ST    @15,RR1RETRY(,RRRF)                                 0219
*   DO I=1 TO LIMIT;                /* DO LOOP TO CALL SUBROUTINES   */
         LA    @15,1                                               0220
         B     @DE00220                                            0220
@DL00220 DS    0H                                                  0221
*     RFY                                                          0221
*       RF RSTD;                                                   0221
*     RF=DUMARY(I);                                                0222
         LH    @11,I(,RD)                                          0222
         SLA   @11,2                                               0222
         L     @05,ARYPTR(,RD)                                     0222
         AL    @05,@CF02725                                        0222
         L     RF,DUMARY(@11,@05)                                  0222
*     CALL SUB;                     /* CALL SUBROUTINES              */
         BALR  @14,@15                                             0223
*     RFY                                                          0224
*       RF UNRSTD;                                                 0224
*RETCALL:                           /* RETURN FROM SUBROUTINE        */
*   END;                                                           0225
*                                                                  0225
RETCALL  LA    @15,1                                               0225
         AH    @15,I(,RD)                                          0225
@DE00220 STH   @15,I(,RD)                                          0225
         SLR   @11,@11                                             0225
         IC    @11,LIMIT(,RD)                                      0225
         CR    @15,@11                                             0225
         BNH   @DL00220                                            0225
*/********************************************************************/
*/*               DETERMINE AND BRANCH TO NEXT MODULE                */
*/********************************************************************/
*                                                                  0226
*NEXTMOD:                                                          0226
*   RR1RETRY=0;                     /* 1ST LEVEL RETRY       @ZA01557*/
NEXTMOD  SLR   @15,@15                                             0226
         ST    @15,RR1RETRY(,RRRF)                                 0226
*   RFY                                                            0227
*     RF RSTD;                      /* RESTRICT REG                  */
*   IF RRFNRTCA=ON×                 /* IF NO RTCA EXISTS OR          */
*       RRFDADSM=ON×                /* A DADSM ENTRY WAS MADE OR     */
*       RRFRJFCB=ON THEN            /* A RDJFCB ENTRY WAS MADE       */
         TM    RRFNRTCA(RRRF),B'01000000'                          0228
         BO    @RT00228                                            0228
         TM    RRFDADSM(RRRF),B'11000000'                          0228
         BZ    @RF00228                                            0228
@RT00228 DS    0H                                                  0229
*     RF=RR0E(9:12);                /* SET UP TO GO TO CLEAN UP      */
         ICM   RF,15,RR0E+8                                        0229
*   ELSE                            /* OTHERWISE                     */
*     RF=RR0B(9:12);                /* SET UP TO GO TO FORCE CLOSE   */
         B     @RC00228                                            0230
@RF00228 ICM   RF,15,RR0B+8                                        0230
*   GEN(BR    RF);                  /* BRANCH TO SELECTED MODULE     */
@RC00228 DS    0H                                                  0231
         BR    RF
*   RFY                                                            0232
*     RF UNRSTD;                    /* MAKE REG UNRESTRICTED         */
*   GEN(EJECT);                                                    0233
         EJECT
*                                                                  0234
*/********************************************************************/
*/*                      SYSEVENT OKSWAP ROUTINE                     */
*/********************************************************************/
*                                                                  0234
*SYSEVENT:                                                         0234
*   PROC OPTIONS(NOSAVEAREA);       /* SYSEVENT OKSWAP EPA     YM8511*/
         B     @PB00002                                            0234
SYSEVENT STM   @14,@12,12(@13)                                     0234
*   RFY                                                            0235
*     RWTGC RSTD;                                                  0235
*   RFY                                                            0236
*     RCORE RSTD;                                                  0236
*   RFY                                                            0237
*     DSMADTRL BASED(RRRF-24);      /* DADSM AUDIT TRAIL       YM8511*/
*   IF RRFDADSM=ON THEN             /* IF DADSM THEN           YM8511*/
         TM    RRFDADSM(RRRF),B'10000000'                          0238
         BNO   @RF00238                                            0238
*     IF DSMASWAP=ON THEN           /* CHECK FOR SYSEVENT      YM8511*/
         LR    @15,RRRF                                            0239
         AL    @15,@CF02726                                        0239
         TM    DSMASWAP(@15),B'00000001'                           0239
         BNO   @RF00239                                            0239
*       GEN(SYSEVENT OKSWAP);       /* CALL SYSEVENT           YM8511*/
         SYSEVENT OKSWAP
*     ELSE                                                         0241
*       ;                           /* RETURN                  YM8511*/
@RF00239 DS    0H                                                  0242
*   ELSE                            /* NOT DADSM ENTRY         YM8511*/
*     DO RWTGC=RWTG+LENGTH(WTG) BY LENGTH(WTGENTRY) TO IECRRPRM-16;/*
*                                      OCE WORK AREA LOOP      YM8511*/
         B     @RC00238                                            0242
@RF00238 LA    RWTGC,32                                            0242
         ALR   RWTGC,RWTG                                          0242
         B     @DE00242                                            0242
@DL00242 DS    0H                                                  0243
*       RCORE=WTGCORE;              /* INIT WORK AREA PTR      YM8511*/
         L     RCORE,WTGCORE-1(,RWTGC)                             0243
         LA    RCORE,0(,RCORE)                                     0243
*       IF RCORE^=0 THEN            /* IF VALID WORKAREA       YM8511*/
         LTR   RCORE,RCORE                                         0244
         BZ    @RF00244                                            0244
*         IF DXECB(1)=POSTFLAG THEN /* POSTED YET? ZA00115           */
         CLI   DXECB(RCORE),X'80'                                  0245
         BNE   @RF00245                                            0245
*           DO;                     /* ZA00115                       */
*             PURGELST=PURGELST&&PURGELST;/* CLEAR PARMLIST ZA00115  */
         XC    PURGELST(12,RD),PURGELST(RD)                        0247
*             PURGBYT0=PURGEFLG;    /* SET PURGE FLAGS ZA00115       */
         MVI   PURGBYT0(RD),B'11100100'                            0248
*             PURGEDEB=ADDR(DXDEB); /* INIT DEB ADDR ZA00115         */
         LA    @15,DXDEB(,RCORE)                                   0249
         STCM  @15,7,PURGEDEB(RD)                                  0249
*             R1=ADDR(PURGELST);    /* R1 POINTS TO LIST ZA00115     */
         LA    R1,PURGELST(,RD)                                    0250
*             GEN(PURGE (1));       /* PURGE I/O ZA00115             */
         PURGE (1)
*             IF DXECB(1)=POSTFLAG THEN/* POSTED YET? ZA00115        */
         CLI   DXECB(RCORE),X'80'                                  0252
         BNE   @RF00252                                            0252
*               GEN REFS(DXECB)(POST DXECB(0,4));/* POST ECB ZA00115 */
         POST DXECB(0,4)
*           END;                                                   0254
@RF00252 DS    0H                                                  0255
*       IF DXATSWAP=ON THEN         /* CHECK FOR SYSEVENT      YM8511*/
@RF00245 DS    0H                                                  0255
@RF00244 TM    DXATSWAP(RCORE),B'01000000'                         0255
         BNO   @RF00255                                            0255
*         GEN(SYSEVENT OKSWAP);     /* CALL SYSEVENT           YM8511*/
         SYSEVENT OKSWAP
*     END;                          /* LOOP                    YM8511*/
@RF00255 AL    RWTGC,@CF00062                                      0257
@DE00242 L     @15,WTGPREFX(,RWTG)                                 0257
         L     @15,IECRRPRM(,@15)                                  0257
         SL    @15,@CF00197                                        0257
         CR    RWTGC,@15                                           0257
         BNH   @DL00242                                            0257
*   RFY                                                            0258
*     RWTGC UNRSTD;                                                0258
*   RFY                                                            0259
*     RCORE UNRSTD;                                                0259
*   END SYSEVENT;                   /* RETURN TO CALLER        YM8511*/
@EL00002 DS    0H                                                  0260
@EF00002 DS    0H                                                  0260
@ER00002 LM    @14,@12,12(@13)                                     0260
         BR    @14                                                 0260
@PB00002 DS    0H                                                  0261
*   GEN(EJECT);                                                    0261
         EJECT
*                                                                  0262
*/********************************************************************/
*/*                SET UP DATA FOR SYS1.LOGREC RECORD                */
*/********************************************************************/
*                                                                  0262
*SUBLOG:                                                           0262
*   PROC OPTIONS(NOSAVEAREA);       /* LOGREC SET UP SUBROUTINE      */
         B     @PB00003                                            0262
SUBLOG   STM   @14,@12,12(@13)                                     0262
*   RECERMOD=WTGMODNM;              /* SET UP ERROR MODULE NAME      */
         MVC   RECERMOD(8,RD),WTGMODNM(RWTG)                       0263
*   RECERCST=WTGMODNM;              /* SET UP ERROR CSECT NAME       */
         MVC   RECERCST(8,RD),WTGMODNM(RWTG)                       0264
*   RECRRID=RR0A;                   /* SET UP TRR ID                 */
         MVC   RECRRID(8,RD),RR0A                                  0265
*   GEN(MODESET EXTKEY=SUPR);       /* INSURE KEY ZERO               */
         MODESET EXTKEY=SUPR
*   DO;                             /* SETRP RECPARM(RECPARML)RECORD(
*                                      YES)WKAREA(SDWAPTR)           */
*     RESPECIFY                                                    0268
*      (GPR00P,                                                    0268
*       GPR01P,                                                    0268
*       GPR14P,                                                    0268
*       GPR15P) RSTD;                                              0268
*     GPR01P=SDWAPTR;                                              0269
         LR    GPR01P,SDWAPTR                                      0269
*     GPR01P->SDWARCDE=0;           /* SAVE RC VALUE                 */
         MVI   SDWARCDE(GPR01P),X'00'                              0270
*     GPR01P->SDWARCRD='1'B;        /* TURN ON RECORD INDICATOR      */
         OI    SDWARCRD(GPR01P),B'10000000'                        0271
*     GPR15P=ADDR(RECPARML);        /* ACCESS RECORD PARAMETER LIST  */
         LA    GPR15P,RECPARML(,RD)                                0272
*     GPR01P->SDWARECP=GPR15P->I256C(1:24);/* COPY RECORD PARAMETERS */
         MVC   SDWARECP(24,GPR01P),I256C(GPR15P)                   0273
*     RESPECIFY                                                    0274
*      (GPR00P,                                                    0274
*       GPR01P,                                                    0274
*       GPR14P,                                                    0274
*       GPR15P) UNRSTD;                                            0274
*   END;                            /* UPDATE RTCA FOR RECORDING   0275
*                                      YM7871                        */
*   IF SDWAVRAL>=LENGTH(IECRRPL) THEN/* WILL IECRRPL FIT IN RTCA     */
         CLC   SDWAVRAL(2,SDWAPTR),@CH00034                        0276
         BL    @RF00276                                            0276
*     DO;                           /* YES                           */
*       SDWAVRA(1:LENGTH(IECRRPL))=IECRRPL;/* COPY IECRRPL TO RTCA   */
         MVC   SDWAVRA(24,SDWAPTR),IECRRPL(RRRF)                   0278
*       SDWAURAL=LENGTH(IECRRPL);   /* SET LENGTH BYTE               */
         MVI   SDWAURAL(SDWAPTR),X'18'                             0279
*       SDWAHEX=ON;                 /* DATA TO BE DUMPED IN HEX      */
         OI    SDWAHEX(SDWAPTR),B'10000000'                        0280
*     END;                                                         0281
*   GEN(MODESET KEYADDR=(2),WORKREG=2);/* RETURN TO CORRECT KEY      */
@RF00276 DS    0H                                                  0282
         MODESET KEYADDR=(2),WORKREG=2
*   END SUBLOG;                     /* RETURN TO CALLER              */
@EL00003 DS    0H                                                  0283
@EF00003 DS    0H                                                  0283
@ER00003 LM    @14,@12,12(@13)                                     0283
         BR    @14                                                 0283
@PB00003 DS    0H                                                  0284
*   GEN(EJECT);                                                    0284
         EJECT
*                                                                  0285
*/********************************************************************/
*/*                           ISSUE SDUMP                            */
*/********************************************************************/
*                                                                  0285
*SUBDUMP:                                                          0285
*   PROC OPTIONS(NOSAVEAREA);                                      0285
         B     @PB00004                                            0285
SUBDUMP  STM   @14,@12,12(@13)                                     0285
*   MSGBUF=IEC999I;                 /* SETUP HEADER          @ZA01557*/
         MVC   MSGBUF(70,RD),IEC999I                               0286
*   TCSUBNM=WTGMODNM;               /* GET ERROR MOD         @ZA01557*/
         MVC   TCSUBNM(8,RD),WTGMODNM(RWTG)                        0287
*   RFY                                                            0288
*     R7 RSTD;                                                     0288
*   R7=TCBTIO;                      /* GET TIOT PTR          @ZA01557*/
         L     @15,CVTPTR                                          0289
         L     @15,CVTTCBP(,@15)                                   0289
         L     @15,TCBPTR(,@15)                                    0289
         L     R7,TCBTIO(,@15)                                     0289
*   IF R7^=0 THEN                   /* CHECK FOR TIOT        @ZA01557*/
         LTR   R7,R7                                               0290
         BZ    @RF00290                                            0290
*     DO;                           /* JOB & STEP NAME       @ZA01557*/
*       GEN REFS(WAJOBNM,WASTEPNM);                                0292
         MVC   WAJOBNM(8,RD),WAJOBNM-WAJOBNM(R7) JOBNAME       @ZA05466
         MVC   WASTEPNM(8,RD),WASTEPNM-WASTEPNM+8(R7) STEP     @ZA05466
*     END;                                                         0293
*   ELSE                                                           0294
*     ;                                                            0294
@RF00290 DS    0H                                                  0295
*   RFY                                                            0295
*     R7 UNRSTD;                                                   0295
*   SDUMPHDR=MSGLNG-4;              /* SET MSG LENGTH        @ZA01557*/
         LH    @15,MSGLNG(,RD)                                     0296
         SL    @15,@CF00065                                        0296
         STC   @15,SDUMPHDR(,RD)                                   0296
*   RF=ADDR(TRRPREFX);              /* GET WORKAREA PTR      @ZA05466*/
         LR    RF,RD                                               0297
         SL    RF,@CF00092                                         0297
*   SLL(RF,8);                      /* PREPARE FOR UNPK      @ZA05466*/
         SLL   RF,8                                                0298
*   WORKWORD=RF;                    /* STORE WRKA PTR        @ZA05466*/
         ST    RF,WORKWORD(,RD)                                    0299
*   UNPK(WDWORD(1:7),WORKWRDC(1:4));/* UNPACK WRKA PTR       @ZA01557*/
         UNPK  WDWORD(7,RD),WORKWRDC(4,RD)                         0300
*   TR(WDWORD(1:6),TRTABL);         /* WRKA PTR TO EBCDIC    @ZA01557*/
         TR    WDWORD(6,RD),TRTABL                                 0301
*   MSGDEBAD=WDWORD;                /* WRKA ADDR FOR MSG     @ZA01557*/
         MVC   MSGDEBAD(6,RD),WDWORD(RD)                           0302
*   SDUMPPRM=SDUMPLST;              /* SET UP PARM LIST      @ZA01557*/
         MVC   SDUMPPRM(24,RD),SDUMPLST                            0303
*   R1=ADDR(SDUMPPRM);              /* SDUMP PARM LIST       @ZA01557*/
         LA    R1,SDUMPPRM(,RD)                                    0304
*   GEN REFS(SDUMPHDR);                                            0305
         MODESET EXTKEY=ZERO            SET KEY ZERO             YM7871
         SDUMP HDRAD=SDUMPHDR(,RD),MF=(E,(1)) ISSUE SDUMP      @ZA01557
         MODESET KEYADDR=(2),WORKREG=2  RESET TO PROPER KEY
*   RETURN CODE(0);                 /* RETURN CODE ZERO      @ZA01557*/
         SLR   @15,@15                                             0306
         L     @14,12(,@13)                                        0306
         LM    @00,@12,20(@13)                                     0306
         BR    @14                                                 0306
*   END SUBDUMP;                    /* RETURN TO CALLER      @ZA01557*/
         EJECT
*                                                                  0308
*/********************************************************************/
*/*                      BUILD MESSAGE IEC999I                       */
*/********************************************************************/
*                                                                  0308
*SUBWTP:                                                           0308
*   PROC OPTIONS(NOSAVEAREA);                                      0308
SUBWTP   STM   @14,@12,12(@13)                                     0308
*   TRRMCS=MCSFLGS;                 /* SET MCS FLAGS                 */
         MVI   TRRMCS+1(RD),X'00'                                  0309
         MVI   TRRMCS(RD),X'80'                                    0309
*   TRRERMOD=WTGMODNM;              /* SET ERROR MODULE NAME         */
         MVC   TRRERMOD(8,RD),WTGMODNM(RWTG)                       0310
*   TRRCOMMA=COMMA;                 /* MOVE IN COMMA                 */
         MVI   TRRCOMMA(RD),C','                                   0311
*   RA=ADDR(TRRREST);               /* PT TO REMAINING MSG BFR       */
         LA    RA,TRRREST(,RD)                                     0312
*   TRRMSG(1:8)=TIOCNJOB;           /* MOVE IN JOBNAME               */
         L     @15,CVTPTR                                          0313
         L     @15,CVTTCBP(,@15)                                   0313
         L     @15,TCBPTR(,@15)                                    0313
         L     @15,TIOTPTR(,@15)                                   0313
         MVC   TRRMSG(8,RA),TIOCNJOB(@15)                          0313
*   RA=RA+7;                        /* INCR MSG PTR                  */
         LA    RA,7(,RA)                                           0314
*   CALL SUBLANKA;                  /* GO REMOVE TRAILING BLANKS     */
         BAL   @14,SUBLANKA                                        0315
*   TRRMSG(1:8)=TIOCSTEP;           /* MOVE IN STEPNAME              */
         L     @15,CVTPTR                                          0316
         L     @15,CVTTCBP(,@15)                                   0316
         L     @15,TCBPTR(,@15)                                    0316
         L     @15,TIOTPTR(,@15)                                   0316
         MVC   TRRMSG(8,RA),TIOCSTEP(@15)                          0316
*   RA=RA+7;                        /* INCR MSG PTR                  */
         LA    RA,7(,RA)                                           0317
*   CALL SUBLANKA;                  /* GO REMOVE TRAILING BLANKS     */
         BAL   @14,SUBLANKA                                        0318
*   IF RRFDADSM=ON THEN             /* IS THIS A DADSM ENTRY         */
         TM    RRFDADSM(RRRF),B'10000000'                          0319
         BNO   @RF00319                                            0319
*     DO;                           /* YES                           */
*       IF RRUCBPTR^=0 THEN         /* IS THE UCB ADDR SPECIFIED     */
         SLR   @15,@15                                             0321
         L     @11,RRUCBPTR(,RRRF)                                 0321
         CR    @11,@15                                             0321
         BE    @RF00321                                            0321
*         DO;                       /* YES                           */
*           TRRMSG(1:3)=RRUCBPTR->UCBNAME;/* MOVE IN UCBNAME   YM3999*/
         MVC   TRRMSG(3,RA),UCBNAME(@11)                           0323
*           RA=RA+3;                /* INCR MSG PTR                  */
         LA    RA,3(,RA)                                           0324
*           TRRMSG(1)=COMMA;        /* MOVE IN COMMA                 */
         MVI   TRRMSG(RA),C','                                     0325
*           RA=RA+1;                /* INCR MSG PTR                  */
         LA    RA,1(,RA)                                           0326
*           IF RRUCBPTR->UCBVOLI(1)^=0 THEN/* VOLSER EXIST     YM3999*/
         SLR   @05,@05                                             0327
         IC    @05,UCBVOLI(,@11)                                   0327
         CR    @15,@05                                             0327
         BE    @RF00327                                            0327
*             DO;                   /* YES                           */
*               TRRMSG(1:6)=RRUCBPTR->UCBVOLI;/* MOVE TO MSG   YM3999*/
         MVC   TRRMSG(6,RA),UCBVOLI(@11)                           0329
*               RA=RA+6;            /* INCR MSG PTR                  */
         LA    RA,6(,RA)                                           0330
*             END;                                                 0331
*           TRRMSG(1)=COMMA;        /* MOVE IN COMMA           YM5341*/
@RF00327 MVI   TRRMSG(RA),C','                                     0332
*           RA=RA+1;                /* INCR MSG PTR            YM5341*/
         LA    RA,1(,RA)                                           0333
*         END;                                                     0334
*       ELSE                        /* NO UCB ADDR SPECIFIED         */
*         DO;                                                      0335
         B     @RC00321                                            0335
@RF00321 DS    0H                                                  0336
*           TRRMSG(1:2)=COMMAS;     /* MOVE IN COMMAS                */
         MVC   TRRMSG(2,RA),COMMAS                                 0336
*           RA=RA+2;                /* INCR MSG PTR                  */
         LA    RA,2(,RA)                                           0337
*         END;                                                     0338
*       RFY                                                        0339
*         DSMADTRL BASED(RRRF-24);                                 0339
@RC00321 DS    0H                                                  0340
*       IF DSMADTW3^=0&             /* IF FIELD CONTAINS PTR AND     */
*           DSMVIO=OFF THEN         /* NOT A VIO ALLOCATE ENTRY      */
         LR    @15,RRRF                                            0340
         SL    @15,@CF00034                                        0340
         L     @11,DSMADTW3(,@15)                                  0340
         LTR   @11,@11                                             0340
         BZ    @RF00340                                            0340
         TM    DSMVIO(@15),B'01000000'                             0340
         BNZ   @RF00340                                            0340
*         DO;                       /* THEN A PTR IS TO A DSNAME     */
*           TRRMSG(1:44)=DSNLOC;    /* MOVE DSNAME TO MSG            */
         MVC   TRRMSG(44,RA),DSNLOC(@11)                           0342
*           R9=RA;                  /* SAVE PTR TO START OF DSNAME   */
         LR    R9,RA                                               0343
*           RA=RA+43;               /* INCR MSG PTR            YM5341*/
         LA    RA,43(,RA)                                          0344
*           CALL SUBLANKA;          /* GO REMOVE TRAILING BLANKS   0345
*                                                              YM5341*/
         BAL   @14,SUBLANKA                                        0345
*         END;                                                     0346
*       RA=RA-1;                    /* BACK PTR PAST COMMA     YM5341*/
@RF00340 BCTR  RA,0                                                0347
*       DO WHILE MSGCHAR1=COMMA;    /* REMOVE TRAILING COMMA(S) FROM
*                                      MESSAGE                 YM5341*/
         B     @DE00348                                            0348
@DL00348 DS    0H                                                  0349
*         RA=RA-1;                  /* PT TO PRECEDING CHAR    YM5341*/
         BCTR  RA,0                                                0349
*       END;                        /*                         YM5341*/
@DE00348 CLI   MSGCHAR1(RA),C','                                   0350
         BE    @DL00348                                            0350
*       RA=RA+1;                    /* PT PAST LAST CHAR       YM5341*/
         LA    RA,1(,RA)                                           0351
*       CALL ISSUEWTO;              /* GO ISSUE WTO                  */
         BAL   @14,ISSUEWTO                                        0352
*       IF RA=0 THEN                /* IF 2ND WTO NEEDED THEN        */
         LTR   RA,RA                                               0353
         BNZ   @RF00353                                            0353
*         DO;                                                      0354
*           TRRDSN=DSNLOC;          /* MOVE DSNAME TO MSG            */
         LR    @15,RRRF                                            0355
         AL    @15,@CF02728                                        0355
         L     @15,DSMADTW3-8(,@15)                                0355
         MVC   TRRDSN(44,RD),DSNLOC(@15)                           0355
*           RA=ADDR(TRRDSN)+LENGTH(DSNLOC);/* INCR MSG PTR     YM5398*/
         LA    RA,TRRDSN(,RD)                                      0356
         LA    RA,44(,RA)                                          0356
*           CALL ISSUEWTO;          /* GO ISSUE WTO                  */
         BAL   @14,ISSUEWTO                                        0357
*         END;                                                     0358
*     END;                                                         0359
*   ELSE                            /* NOT A DADSM ENTRY             */
*     DO;                                                          0360
         B     @RC00319                                            0360
@RF00319 DS    0H                                                  0361
*       RA=RA-1;                    /* DECR MSG PTR TO ELIMINATE   0361
*                                      TRAILING COMMA          YM3999*/
         BCTR  RA,0                                                0361
*       CALL ISSUEWTO;              /* GO ISSUE WTO                  */
         BAL   @14,ISSUEWTO                                        0362
*     END;                                                         0363
*   END SUBWTP;                     /* RETURN TO CALLER              */
@EL00005 DS    0H                                                  0364
@EF00005 DS    0H                                                  0364
@ER00005 LM    @14,@12,12(@13)                                     0364
         BR    @14                                                 0364
*/********************************************************************/
*/*               REMOVE TRAILING BLANKS FROM MESSAGE                */
*/********************************************************************/
*                                                                  0365
*SUBLANKA:                                                         0365
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0365
SUBLANKA DS    0H                                                  0366
*   DO WHILE MSGCHAR2^=COMMA;                                      0366
         B     @DE00366                                            0366
@DL00366 DS    0H                                                  0367
*     IF MSGCHAR1=BLANK THEN        /* BLANK CHARACTER IN MESSAGE    */
         CLI   MSGCHAR1(RA),C' '                                   0367
         BNE   @RF00367                                            0367
*       RA=RA-1;                    /* YES, PT TO PRECEDING CHAR     */
         BCTR  RA,0                                                0368
*     ELSE                          /* NO,                           */
*       MSGCHAR2=COMMA;             /* PUT COMMA IN MESSAGE          */
         B     @RC00367                                            0369
@RF00367 MVI   MSGCHAR2(RA),C','                                   0369
*   END;                                                           0370
@RC00367 DS    0H                                                  0370
@DE00366 CLI   MSGCHAR2(RA),C','                                   0370
         BNE   @DL00366                                            0370
*   RA=RA+2;                        /* UPDATE MSG BUFFER PTR         */
         LA    RA,2(,RA)                                           0371
*   END SUBLANKA;                   /* RETURN TO CALLER              */
@EL00006 DS    0H                                                  0372
@EF00006 DS    0H                                                  0372
@ER00006 BR    @14                                                 0372
*/********************************************************************/
*/*                    ISSUE WRITE-TO-PROGRAMMER                     */
*/********************************************************************/
*                                                                  0373
*ISSUEWTO:                                                         0373
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0373
ISSUEWTO DS    0H                                                  0374
*   IF RA-ADDR(TRRWTP)>76 THEN      /* IF MSG IS TOO LONG FOR ONE    */
         LA    @15,TRRWTP(,RD)                                     0374
         LR    @11,RA                                              0374
         SLR   @11,@15                                             0374
         C     @11,@CF02667                                        0374
         BNH   @RF00374                                            0374
*     DO;                           /* LINE THEN                     */
*       R9->TRRMSG(1:4)=ROUTCOD;    /* SET ROUTE CODE FOR 1ST WTO    */
         MVC   TRRMSG(4,R9),ROUTCOD                                0376
*       RA=0;                       /* INDICATE 2ND WTO NEEDED       */
         SLR   RA,RA                                               0377
*       TRRMSGLN=R9-ADDR(TRRWTP);   /* SET MSG LNG                   */
         LCR   @15,@15                                             0378
         ALR   @15,R9                                              0378
         STH   @15,TRRMSGLN(,RD)                                   0378
*     END;                                                         0379
*   ELSE                            /* ONLY ONE WTO NEEDED           */
*     DO;                                                          0380
         B     @RC00374                                            0380
@RF00374 DS    0H                                                  0381
*       TRRMSG(1:4)=ROUTCOD;        /* SET ROUTE CODE FOR ONLY WTO   */
         MVC   TRRMSG(4,RA),ROUTCOD                                0381
*       TRRMSGLN=RA-ADDR(TRRWTP);   /* SET MSG LNG             YM3999*/
         LA    @15,TRRWTP(,RD)                                     0382
         LCR   @15,@15                                             0382
         ALR   @15,RA                                              0382
         STH   @15,TRRMSGLN(,RD)                                   0382
*     END;                                                         0383
*   R1=ADDR(TRRWTP);                /* PT TO MSG BFR FOR WTO         */
@RC00374 LA    R1,TRRWTP(,RD)                                      0384
*   GEN(WTO   MF=(E,(1)));          /* ISSUE WTO                     */
         WTO   MF=(E,(1))
*   END ISSUEWTO;                   /* RETURN TO CALLER              */
@EL00007 DS    0H                                                  0386
@EF00007 DS    0H                                                  0386
@ER00007 BR    @14                                                 0386
@PB00007 DS    0H                                                  0387
*   GEN(EJECT);                                                    0387
         EJECT
*                                                                  0388
*/********************************************************************/
*/*          BUILD RECOVERY ROUTINE CONTROL BLOCK SAVE AREA          */
*/********************************************************************/
*                                                                  0388
*SUB230:                                                           0388
*   PROC OPTIONS(NOSAVEAREA);                                      0388
         B     @PB00008                                            0388
SUB230   STM   @14,@12,12(@13)                                     0388
*   RFY                                                            0389
*     IECPREFX BASED(RA);           /* RESPECIFY BASE FOR PREFIX     */
*   RFY                                                            0390
*     DSMADTRL BASED(RRRF-24);      /* RFY DADSM AUDIT TRAIL BASE    */
*   R0=0;                           /* INIT LNG REG TO ZERO    YM5910*/
         SLR   R0,R0                                               0391
*   IF RRFDADSM=ON THEN             /* IF DADSM ENTRY THEN     YM5910*/
         TM    RRFDADSM(RRRF),B'10000000'                          0392
         BNO   @RF00392                                            0392
*     DO;                                                          0393
*       IF RRFUNCTN=RRFALLOC THEN   /* IF ALLOCATE THEN        YM5910*/
         CLI   RRFUNCTN(RRRF),X'A0'                                0394
         BNE   @RF00394                                            0394
*         DO;                                                      0395
*           IF DSMISAM=ON THEN      /* IF ISAM ALLOCATE THEN   YM5910*/
         LR    @15,RRRF                                            0396
         SL    @15,@CF00034                                        0396
         TM    DSMISAM(@15),B'10000000'                            0396
         BNO   @RF00396                                            0396
*             DO;                                                  0397
*               R0=4;               /* SET DSAB LIST INCR      YM5910*/
         LA    R0,4                                                0398
*               R7=DSMADTW3;        /* PT TO DSAB LIST         YM5910*/
         L     R7,DSMADTW3(,@15)                                   0399
*               DO WHILE DSABLIST(1)^=0;/* CALC DSAB LIST LNG  YM5910*/
         B     @DE00400                                            0400
@DL00400 DS    0H                                                  0401
*                 R0=R0+4;          /* INCR LNG REG            YM5910*/
         AL    R0,@CF00065                                         0401
*               END;                /* CONTINUE TO CALC LNG    YM5910*/
@DE00400 LR    @15,RRRF                                            0402
         AL    @15,@CF02728                                        0402
         L     @15,DSMADTW3-8(,@15)                                0402
         L     @15,DSABLIST(,@15)                                  0402
         LTR   @15,@15                                             0402
         BNZ   @DL00400                                            0402
*               TRRWORK3=R0;        /* SAVE DSAB LIST LNG      YM5910*/
         ST    R0,TRRWORK3(,RD)                                    0403
*             END;                                                 0404
*           ELSE                    /* NOT ISAM ALLOCATE       YM5910*/
*             IF DSMVIO=ON THEN     /* IF VIO ALLOCATE THEN    YM5910*/
         B     @RC00396                                            0405
@RF00396 LR    @15,RRRF                                            0405
         AL    @15,@CF02726                                        0405
         TM    DSMVIO(@15),B'01000000'                             0405
         BNO   @RF00405                                            0405
*               R0=LENGTH(VDSCB);   /* SET LENGTH OF VDSCB     YM5910*/
         LA    R0,205                                              0406
*         END;                                                     0407
*     END;                                                         0408
*   ELSE                            /* NOT A DADSM ENTRY       YM5910*/
*     R0=IECCORLN;                  /* GET CORE LNG FR PFX     YM5910*/
         B     @RC00392                                            0409
@RF00392 L     R0,IECCORLN(,RA)                                    0409
*   IF R0^=0 THEN                   /* IF RRCBSA IS NEEDED THEN    0410
*                                                              YM5910*/
@RC00392 SLR   @15,@15                                             0410
         CR    R0,@15                                              0410
         BE    @RF00410                                            0410
*     DO;                                                          0411
*       R0=R0+LENGTH(RRCBSAHD)+MAXALIGN;/* SET INITIAL RRCBSA LENGTH
*                                                              YM5910*/
         AL    R0,@CF02718                                         0412
*       TRRWORK1=0;                 /* SET PREFIX INDICATOR          */
         ST    @15,TRRWORK1(,RD)                                   0413
*       CALL GET230;                /* GO OBTAIN CORE                */
         BAL   @14,GET230                                          0414
*       TRRWORK1=R1;                /* SAVE RRCBSA PREFIX PTR        */
         ST    R1,TRRWORK1(,RD)                                    0415
*       RRCBSAHD=CBSHEAD;           /* INITIALIZE RRCBSA             */
         MVC   RRCBSAHD(256,RRCBSPTR),CBSHEAD                      0416
*       RRCBSJOB=TIOCNJOB;          /* SET JOB NAME IN RRCBSA        */
         L     @15,CVTPTR                                          0417
         L     @15,CVTTCBP(,@15)                                   0417
         L     @15,TCBPTR(,@15)                                    0417
         L     @15,TIOTPTR(,@15)                                   0417
         MVC   RRCBSJOB(8,RRCBSPTR),TIOCNJOB(@15)                  0417
*       RRCBSSTP=TIOCSTEP;          /* SET STEP NAME IN RRCBSA       */
         MVC   RRCBSSTP(8,RRCBSPTR),TIOCSTEP(@15)                  0418
*       GEN REFS(TRRWORK2);                                        0419
         TIME  DEC,ZONE=LT,ERRET=TIMERR OBTAIN TIME AND DATE
         STCM  R1,7,TRRWORK2(RD)        SAVE PACKED DATE RESULT
*       ED(RRCBDATP,TRRWORK2);      /* MAKE DATE PRINTABLE           */
         ED    RRCBDATP(7,RRCBSPTR),TRRWORK2(RD)                   0420
*       RRCBDATP(1)=BLANK;          /* BLANK PATTERN FILLER CHAR     */
         MVI   RRCBDATP(RRCBSPTR),C' '                             0421
*       TRRWORK2=R0;                /* SAVE PACKED TIME RESULT       */
         ST    R0,TRRWORK2(,RD)                                    0422
*       ED(RRCBTIMP,TRRWORK2);      /* MAKE TIME PRINTABLE           */
         ED    RRCBTIMP(9,RRCBSPTR),TRRWORK2(RD)                   0423
*       RRCBTIMP(1)=BLANK;          /* BLANK PATTERN FILLER CHAR     */
         MVI   RRCBTIMP(RRCBSPTR),C' '                             0424
*TIMERR:                            /* TIME MACRO ERROR RETURN PT    */
*       IF RRCBDATP(1)^=BLANK THEN  /* IF TIME MACRO ERROR THEN      */
TIMERR   CLI   RRCBDATP(RRCBSPTR),C' '                             0425
         BE    @RF00425                                            0425
*         DO;                                                      0426
*           RRCBDATP(1:9)=UNAVAIL;  /* INDICATE DATE UNAVAILABLE     */
         MVC   RRCBDATP(9,RRCBSPTR),UNAVAIL                        0427
*           RRCBTIMP=UNAVAIL;       /* INDICATE TIME UNAVAILABLE     */
         MVC   RRCBTIMP(9,RRCBSPTR),UNAVAIL                        0428
*         END;                                                     0429
*       RRCBSPTR=RRCBSPTR+LENGTH(RRCBSA);/* SET PTR FOR 1ST COPY     */
@RF00425 LA    RRCBSPTR,256(,RRCBSPTR)                             0430
*       CALL COPY230;               /* GO COPY THE FOLLOWING: O/C/E
*                                      BASE PREFIX OR ISAM ALLOCATE
*                                      DSAB LIST OR VIO ALLOCATE   0431
*                                      VDSCB                   YM5910*/
         BAL   @14,COPY230                                         0431
*       IF SAREG8->RRFDADSM=OFF THEN/* IF NOT DADSM THEN       YM5933*/
         L     @15,SAREG8(,RD)                                     0432
         TM    RRFDADSM(@15),B'10000000'                           0432
         BNZ   @RF00432                                            0432
*         DO;                                                      0433
*           GEN(MODESET EXTKEY=ZERO);/* SET KEY ZERO                 */
         MODESET EXTKEY=ZERO
*           DO WHILE IECCORP2^=IECCORPS&/* DO THE FOLLOWING WHILE END
*                                      OF CHAIN IS NOT REACHED AND   */
*                 IECCORP2->IECCORP1=RA;/* BACK CHAIN PTR OF NEXT  0435
*                                      PREFIX IS VALID               */
         B     @DE00435                                            0435
@DL00435 DS    0H                                                  0436
*             RA=IECCORP2;          /* PT TO NEXT PREFIX             */
         L     RA,IECCORP2(,RA)                                    0436
*             R0=IECCORLN+MAXALIGN; /* SET NECESSARY CORE LENGTH     */
         L     @15,IECCORLN(,RA)                                   0437
         LA    @15,24(,@15)                                        0437
         LR    R0,@15                                              0437
*             CALL GET230;          /* GO OBTAIN CORE                */
         BAL   @14,GET230                                          0438
*             GEN(MODESET EXTKEY=ZERO);/* SET KEY ZERO       @ZA07689*/
         MODESET EXTKEY=ZERO
*             CALL COPY230;         /* GO MAKE COPY                  */
         BAL   @14,COPY230                                         0440
*           END;                                                   0441
@DE00435 L     @15,IECCORP2(,RA)                                   0441
         C     @15,IECCORPS(,RA)                                   0441
         BE    @DC00435                                            0441
         C     RA,IECCORP1(,@15)                                   0441
         BE    @DL00435                                            0441
@DC00435 DS    0H                                                  0442
*           R2=SAREG10->IECCORKY;   /* GET KEY OF CALLER             */
         L     @15,SAREG10(,RD)                                    0442
         SLR   R2,R2                                               0442
         IC    R2,IECCORKY(,@15)                                   0442
*           GEN(MODESET KEYADDR=(2),WORKREG=2);/* SET KEY OF CALLER  */
         MODESET KEYADDR=(2),WORKREG=2
*         END;                                                     0444
*     END;                                                         0445
*   END SUB230;                     /* RETURN TO CALLER              */
@EL00008 DS    0H                                                  0446
@EF00008 DS    0H                                                  0446
@ER00008 LM    @14,@12,12(@13)                                     0446
         BR    @14                                                 0446
*/********************************************************************/
*/*                      GET STORAGE FOR RRCBSA                      */
*/********************************************************************/
*                                                                  0447
*GET230:                                                           0447
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0447
GET230   DS    0H                                                  0448
*   RFY                                                            0448
*     R4 RSTD;                      /* RESTRICT REG                  */
*   R4=IECCORKY;                    /* PICK UP KEY                   */
         SLR   R4,R4                                               0449
         IC    R4,IECCORKY(,RA)                                    0449
*   SRL(R4,4);                      /* POSITION KEY FOR IECRES       */
         SRL   R4,4                                                0450
*   RFY                                                            0451
*     RF RSTD;                      /* RESTRICT REG                  */
*   RF=ADDR(TRRSAV2);               /* GET PTR TO A SAVE AREA        */
         LA    RF,TRRSAV2(,RD)                                     0452
*   R7=IECCORSP;                    /* INDICATE SUBPOOL NUMBER       */
         SLR   R7,R7                                               0453
         IC    R7,IECCORSP(,RA)                                    0453
*   R1=TRRWORK1;                    /* SET PREFIX INDICATOR          */
         L     R1,TRRWORK1(,RD)                                    0454
*   GEN REFS(CVT,CVTDMSR);                                         0455
*                                       /*GET CORE FOR RRCBSA        */
         IECRES GET,LV=(0),SP=(R7),KEY=(R4),A=(R1),ID=CBSA,            *
               PREFIX=YES,STM=(2,14,0(RF))
*   RFY                                                            0456
*    (R4,                                                          0456
*     RF) UNRSTD;                   /* MAKE REGS UNRESTRICTED        */
*   RRCBSPTR=((R1+31)/32)*32;       /* ADJUST GOTTEN CORE PTR TO   0457
*                                      ALIGN THE RRCBSA WITHIN THE 0457
*                                      EBCDIC COLUMN OF A DUMP       */
         LA    @15,32                                              0457
         LA    @04,31                                              0457
         ALR   @04,R1                                              0457
         SRDA  @04,32                                              0457
         DR    @04,@15                                             0457
         SLA   @05,5                                               0457
         LR    RRCBSPTR,@05                                        0457
*   EVAL(R1-32)->IECCORAD=RRCBSPTR; /* ADJUST PTR FIELD              */
         LCR   @15,@15                                             0458
         ALR   @15,R1                                              0458
         ST    RRCBSPTR,IECCORAD(,@15)                             0458
*   END GET230;                     /* RETURN TO CALLER              */
@EL00009 DS    0H                                                  0459
@EF00009 DS    0H                                                  0459
@ER00009 BR    @14                                                 0459
*/********************************************************************/
*/*               MAKE COPY OF CONTROL BLOCK/WORK AREA               */
*/********************************************************************/
*                                                                  0460
*COPY230:                                                          0460
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0460
COPY230  DS    0H                                                  0461
*   IF SAREG8->RRFDADSM=OFF THEN    /* IF NOT DADSM THEN       YM5933*/
         L     @15,SAREG8(,RD)                                     0461
         TM    RRFDADSM(@15),B'10000000'                           0461
         BNZ   @RF00461                                            0461
*     R9=IECCORLN;                  /* SET SOURCE COPY LNG     YM5910*/
         L     R9,IECCORLN(,RA)                                    0462
*   ELSE                            /* DADSM ENTRY             YM5910*/
*     DO;                                                          0463
         B     @RC00461                                            0463
@RF00461 DS    0H                                                  0464
*       RFY                                                        0464
*         DSMADTRL BASED(SAREG8-24);                               0464
*       RA=DSMADTW3;                /* SET DSABLIST/VDSCB PTR  YM5910*/
         L     @15,SAREG8(,RD)                                     0465
         SL    @15,@CF00034                                        0465
         L     RA,DSMADTW3(,@15)                                   0465
*       IF DSMISAM=ON THEN          /* IF ISAM ALLOCATE THEN   YM5910*/
         TM    DSMISAM(@15),B'10000000'                            0466
         BNO   @RF00466                                            0466
*         R9=TRRWORK3;              /* SET DSAB LIST LENGTH    YM5910*/
         L     R9,TRRWORK3(,RD)                                    0467
*       ELSE                        /* MUST BE VIO ALLOCATE    YM5910*/
*         R9=LENGTH(VDSCB);         /* SET VDSCB LENGTH        YM5910*/
         B     @RC00466                                            0468
@RF00466 LA    R9,205                                              0468
*     END;                                                         0469
@RC00466 DS    0H                                                  0470
*   RFY                                                            0470
*     RB RSTD;                      /* RESTRICT REG                  */
@RC00461 DS    0H                                                  0471
*   RB=R9;                          /* SET UP RECEIVER COPY LENGTH   */
         LR    RB,R9                                               0471
*   TRRWORK2=RA;                    /* SAVE SOURCE PTR ACROSS MVCL   */
         ST    RA,TRRWORK2(,RD)                                    0472
*   MVCL(RRCBSPTR,RA);              /* MAKE COPY                     */
         MVCL  RRCBSPTR,RA                                         0473
*   RFY                                                            0474
*     RB UNRSTD;                    /* MAKE REG UNRESTRICTED         */
*   RA=TRRWORK2;                    /* RESTORE SOURCE PTR            */
         L     RA,TRRWORK2(,RD)                                    0475
*   END COPY230;                    /* RETURN TO CALLER              */
@EL00010 DS    0H                                                  0476
@EF00010 DS    0H                                                  0476
@ER00010 BR    @14                                                 0476
@PB00010 DS    0H                                                  0477
*   GEN(EJECT);                                                    0477
         EJECT
*                                                                  0478
*/********************************************************************/
*/*                           GTRACE RRCBSA                          */
*/********************************************************************/
*                                                                  0478
*SUBGTF:                                                           0478
*   PROC OPTIONS(NOSAVEAREA);                                      0478
         B     @PB00011                                            0478
SUBGTF   STM   @14,@12,12(@13)                                     0478
*   IF TRRWORK1^=0 THEN             /* IF AN RRCBSA EXISTS THEN      */
         L     @15,TRRWORK1(,RD)                                   0479
         LTR   @15,@15                                             0479
         BZ    @RF00479                                            0479
*     DO;                                                          0480
*       RA=TRRWORK1-32;             /* PT TO FIRST RRCBSA PREFIX     */
         SL    @15,@CF00092                                        0481
         LR    RA,@15                                              0481
*       GTRACFID=RRFID;             /* SET ZERO FID FOR HEX FORMAT   */
         MVC   GTRACFID(2,RD),RRFID                                0482
*       R1=ADDR(GTRACBUF);          /* PT TO GTRACE PARM LIST        */
         LA    R1,GTRACBUF(,RD)                                    0483
*       CALL GTFCALL;               /* GO TRACE DATA                 */
         BAL   @14,GTFCALL                                         0484
*       GEN(MODESET EXTKEY=ZERO);   /* SET KEY ZERO                  */
         MODESET EXTKEY=ZERO
*       DO WHILE IECCORP2^=IECCORPS;/* DO THE FOLLOWING WHILE END OF
*                                      CHAIN IS NOT REACHED          */
         B     @DE00486                                            0486
@DL00486 DS    0H                                                  0487
*         RA=IECCORP2;              /* PT TO NEXT PREFIX             */
         L     RA,IECCORP2(,RA)                                    0487
*         CALL GTFCALL;             /* GO TRACE DATA                 */
         BAL   @14,GTFCALL                                         0488
*       END;                                                       0489
@DE00486 L     @15,IECCORPS(,RA)                                   0489
         C     @15,IECCORP2(,RA)                                   0489
         BNE   @DL00486                                            0489
*       R2=IECCORPS->IECCORKY;      /* GET PROPER KEY                */
         SLR   R2,R2                                               0490
         IC    R2,IECCORKY(,@15)                                   0490
*       GEN(MODESET KEYADDR=(2),WORKREG=2);/* SET PROPER KEY         */
         MODESET KEYADDR=(2),WORKREG=2
*     END;                                                         0492
*   END SUBGTF;                                                    0493
*                                                                  0493
@EL00011 DS    0H                                                  0493
@EF00011 DS    0H                                                  0493
@ER00011 LM    @14,@12,12(@13)                                     0493
         BR    @14                                                 0493
*/********************************************************************/
*/*                        ISSUE GTRACE MACRO                        */
*/********************************************************************/
*                                                                  0494
*GTFCALL:                                                          0494
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0494
GTFCALL  DS    0H                                                  0495
*   RC=RA;                          /* SET REG AS DATA PTR           */
         LR    RC,RA                                               0495
*   R9=IECCORLN;                    /* SET REG WITH DATA LENGTH      */
         L     R9,IECCORLN(,RA)                                    0496
*   RFY                                                            0497
*     RF RSTD;                      /* RESTRICT REG                  */
*   RF=0;                           /* INIT RETURN CODE REG TO 0     */
         SLR   RF,RF                                               0498
*   DO WHILE RF=0&                  /* TRACE WHILE GTRACE RETURN     */
*         R9>0;                     /* CODE = 0 & DATA LNG IS > 0    */
         B     @DE00499                                            0499
@DL00499 DS    0H                                                  0500
*     IF R9>256 THEN                /* IF DATA LNG IS > 256 THEN     */
         LA    @11,256                                             0500
         CR    R9,@11                                              0500
         BNH   @RF00500                                            0500
*       GTRACLNG=256;               /* SET DATA LNG OF 256           */
         STH   @11,GTRACLNG(,RD)                                   0501
*     ELSE                          /* DATA LNG < 256                */
*       GTRACLNG=R9;                /* SET DATA LNG < 256            */
         B     @RC00500                                            0502
@RF00500 STH   R9,GTRACLNG(,RD)                                    0502
*     GTRACDAP=RC;                  /* SET DATA PTR FIELD            */
@RC00500 ST    RC,GTRACDAP(,RD)                                    0503
*     GEN(GTRACE ID=4095,PAGEIN=YES,MF=(E,(1)));/* GTRACE      YM7364*/
         GTRACE ID=4095,PAGEIN=YES,MF=(E,(1))
*     R9=R9-256;                    /* DECREMENT DATA LNG COUNTER    */
         LA    @11,256                                             0505
         SLR   R9,@11                                              0505
*     RC=RC+256;                    /* INCREMENT DATA PTR            */
         ALR   RC,@11                                              0506
*   END;                            /* CHK FOR END OF LOOP           */
@DE00499 SLR   @11,@11                                             0507
         CR    RF,@11                                              0507
         BNE   @DC00499                                            0507
         CR    R9,@11                                              0507
         BH    @DL00499                                            0507
@DC00499 DS    0H                                                  0508
*   RFY                                                            0508
*     RF UNRSTD;                    /* MAKE REG UNRESTRICTED         */
*   END GTFCALL;                    /* RETURN TO CALLER              */
@EL00012 DS    0H                                                  0509
@EF00012 DS    0H                                                  0509
@ER00012 BR    @14                                                 0509
@PB00012 DS    0H                                                  0510
*   GEN(EJECT);                                                    0510
         EJECT
*                                                                  0511
*/********************************************************************/
*/*                      IFG0RR0A RETRY ROUTINE                      */
*/********************************************************************/
*                                                                  0511
*RETRY0A:                                                          0511
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0511
         B     @PB00013                                            0511
RETRY0A  DS    0H                                                  0512
*   RD=R1+32;                       /* PT TO TRR WORK AREA           */
         LA    RD,32(,R1)                                          0512
*   R2=R1->IECCORKY;                /* GET PROPER KEY                */
         SLR   R2,R2                                               0513
         IC    R2,IECCORKY(,R1)                                    0513
*   GEN(MODESET KEYADDR=(2),WORKREG=2);/* SET PROPER KEY             */
         MODESET KEYADDR=(2),WORKREG=2
*   LM(RET,RC,TRRSAV1(13:72));      /* GET PROPER REGISTERS          */
         LM    RET,RC,TRRSAV1+12(RD)                               0515
*   TRRWTG=RR0A;                    /* SET ID OF THIS MODULE         */
         MVC   TRRWTG(12,RD),RR0A                                  0516
*   END RETRY0A;                    /* GO CONTINUE PROCESSING        */
@EL00013 DS    0H                                                  0517
@EF00013 DS    0H                                                  0517
@ER00013 BR    @14                                                 0517
@PB00013 DS    0H                                                  0518
*   GEN(EJECT);                                                    0518
         EJECT
*                                                                  0519
*/********************************************************************/
*/*                            CONSTANTS                             */
*/********************************************************************/
*                                                                  0519
*   GEN DATA DEFS(RR0A,RR0B,RR0E,SDUMPLST,IEC999I,TRTABL);         0519
*   DECLARE                         /* GENERAL PURPOSE REGISTERS     */
*     GPR00P PTR(31) REG(0),                                       0520
*     GPR01P PTR(31) REG(1),                                       0520
*     GPR14P PTR(31) REG(14),                                      0520
*     GPR15P PTR(31) REG(15);                                      0520
*   DECLARE                         /* COMMON VARIABLES              */
*     I256C CHAR(256) BASED,                                       0521
*     I031F FIXED(31) BASED,                                       0521
*     I031P PTR(31) BASED,                                         0521
*     I015F FIXED(15) BASED,                                       0521
*     I015P PTR(15) BASED,                                         0521
*     I008P PTR(8) BASED,                                          0521
*     I001C CHAR(1) BASED;                                         0521
*   END IFG0RR0A                                                   0522
*                                                                  0522
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */
*/*%INCLUDE SYSLIB  (IECDSECT)                                       */
*/*%INCLUDE SYSLIB  (IECDSECS)                                       */
*/*%INCLUDE SYSLIB  (IHASDWA )                                       */
*/*%INCLUDE SYSLIB  (CVT     )                                       */
*/*%INCLUDE SYSLIB  (IKJTCB  )                                       */
*/*%INCLUDE SYSLIB  (IEZJSCB )                                       */
*/*%INCLUDE SYSLIB  (IDDVDSCB)                                       */
*/*%INCLUDE SYSLIB  (IEFTIOT1)                                       */
*/*%INCLUDE SYSLIB  (IEFUCBOB)                                       */
*                                                                  0522
*       ;                                                          0522
@EL00001 DS    0H                                                  0522
@EF00001 DS    0H                                                  0522
@ER00001 BR    @14                                                 0522
@DATA    DS    0H
@DATD    DSECT
         DS    0F
IFG0RR0A CSECT
         DS    0F
@CF00065 DC    F'4'
@CF00062 DC    F'8'
@CF00067 DC    F'12'
@CF00197 DC    F'16'
@CF00034 DC    F'24'
@CH00034 EQU   @CF00034+2
@CF00092 DC    F'32'
@CF02667 DC    F'76'
@CF02718 DC    F'280'
@CF02726 DC    F'-24'
@CF02728 DC    F'-16'
@CF02725 DC    F'-4'
@DATD    DSECT
         DS    0D
IFG0RR0A CSECT
         DS    0F
@SIZDATD DC    AL1(0)
         DC    AL3(@ENDDATD-@DATD)
         DS    0D
UNAVAIL  DC    CL9' UNAVAIL.'
CBSHEAD  DS    CL256
         ORG   CBSHEAD
@NM00001 DC    CL32'                                '
         DC    CL32'    O.C.E.D RECOVERY ROUTINE    '
         DC    CL32'    CONTROL BLOCK SAVE AREA     '
         DC    CL32'    JOBNAME ....... JJJJJJJJ    '
         DC    CL32'    STEPNAME ...... SSSSSSSS    '
@NM00002 DS    CL32
         ORG   @NM00002
@NM00003 DC    CL19'    DATE ..........'
@NM00004 DC    X'F021204B202020'
@NM00005 DC    CL6'      '
         ORG   CBSHEAD+192
@NM00006 DS    CL32
         ORG   @NM00006
@NM00007 DC    CL19'    TIME ..........'
@NM00008 DC    X'F021204B20204B2020'
@NM00009 DC    CL4'    '
         ORG   CBSHEAD+224
@NM00010 DC    CL32'                                '
         ORG   CBSHEAD+256
MSGIDS   DC    CL8'IEC999I '
MSGIDU   DC    CL8'IEC223I '
COMMAS   DC    CL2',,'
ROUTCOD  DC    X'04000060'
RRFID    DC    X'0000'
         DS    CL3
A        DC    AL4(SUB230)
         DC    AL4(SUBGTF)
B        DC    AL4(SUBLOG)
         DC    AL4(SUBWTP)
         DC    AL4(SUB230)
         DC    AL4(SUBGTF)
C        DC    AL4(SUBWTP)
         DC    AL4(SUB230)
         DC    AL4(SUBGTF)
@DATD    DSECT
         EJECT
IFG0RR0A CSECT
SDUMPLST SDUMP SDATA=(RGN),MF=L         SDUMP LIST             @ZA05466
         EJECT
IEC999I  WTO   'IEC999I IFG0RR0A,IFG0RR0F,        ,        ,WORKAREA = 9
               999999 ',                                       @ZA01557*
               ROUTCDE=(10,11),DESC=(6),MF=L                   @ZA01557
TRTABL   EQU   *-240                    TRANSLATE TABLE ORIGIN   YM7871
         DC    C'0123456789ABCDEF'      TRANSLATE TABLE CHARS    YM7871
         EJECT
XCTLTABL XCTLTABL ID=(RR0A,IFG0RR0A,RR0B,IFG0RR0B,RR0E,IFG0RR0E),      *
               BRT=YES,LENGTH=
         EJECT
@DATD    DSECT
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA
@ENDDATD EQU   *
IFG0RR0A CSECT
@00      EQU   00                      EQUATES FOR REGISTERS 0-15
@01      EQU   01
@02      EQU   02
@03      EQU   03
@04      EQU   04
@05      EQU   05
@06      EQU   06
@07      EQU   07
@08      EQU   08
@09      EQU   09
@10      EQU   10
@11      EQU   11
@12      EQU   12
@13      EQU   13
@14      EQU   14
@15      EQU   15
R0       EQU   @00
R1       EQU   @01
R2       EQU   @02
RBASE    EQU   @03
RCORE    EQU   @04
R4       EQU   @04
RWTG     EQU   @06
SDWAPTR  EQU   @07
R7       EQU   @07
RRRF     EQU   @08
RRCBSPTR EQU   @08
R9       EQU   @09
RA       EQU   @10
UCBPTR   EQU   @10
RB       EQU   @11
RC       EQU   @12
RWTGC    EQU   @12
RD       EQU   @13
RET      EQU   @14
RF       EQU   @15
GPR00P   EQU   @00
GPR01P   EQU   @01
GPR14P   EQU   @14
GPR15P   EQU   @15
R5       EQU   @05
CVTPTR   EQU   16
DUMARY   EQU   0
SUB      EQU   0
RRCBSA   EQU   0
RRCBSAHD EQU   RRCBSA
RRCBSJOB EQU   RRCBSAHD+116
RRCBSSTP EQU   RRCBSAHD+148
RRCBDATP EQU   RRCBSAHD+179
RRCBTIMP EQU   RRCBSAHD+211
SAVAREA  EQU   0
SACALLER EQU   SAVAREA+4
SACALLED EQU   SAVAREA+8
SARETRY  EQU   SAVAREA+12
SAREG8   EQU   SAVAREA+52
SAREG10  EQU   SAVAREA+60
TRRPREFX EQU   0
TRREXTPR EQU   0
TRRSAV1  EQU   TRREXTPR
TRREXTX  EQU   TRREXTPR+80
TRRWTG   EQU   TRREXTX+4
TRRPFXP  EQU   TRREXTX+20
TRRSAV2  EQU   TRREXTX+24
TRRWORK1 EQU   TRREXTX+168
TRRWORK2 EQU   TRREXTX+172
TRRWORK3 EQU   TRREXTX+176
SUBWORDS EQU   TRREXTPR+260
ARYPTR   EQU   SUBWORDS
I        EQU   SUBWORDS+4
LIMIT    EQU   SUBWORDS+6
@NM00019 EQU   SUBWORDS+7
WADUMP   EQU   @NM00019
WORKWORD EQU   SUBWORDS+8
WORKWRDC EQU   WORKWORD
COMPCODE EQU   WORKWRDC
SYSCODE  EQU   COMPCODE+2
WDWORD   EQU   TRREXTPR+272
TRRXEND  EQU   TRREXTPR+288
FORCORE  EQU   0
DXDSCB   EQU   FORCORE
DXECB    EQU   FORCORE+276
DXDAADDR EQU   FORCORE+312
DXDEB    EQU   DXDAADDR+4
DXDCB    EQU   FORCORE+320
DXCCW    EQU   FORCORE+368
DXCCW1   EQU   DXCCW
DXCCW5   EQU   DXCCW+32
DXCCW8   EQU   DXCCW+56
DXCCW12  EQU   DXCCW+88
DXXCTL   EQU   FORCORE+472
DXVOLSR  EQU   FORCORE+500
DXVOLSR1 EQU   DXVOLSR
DXVOLSR2 EQU   DXVOLSR+6
DXVOLSR3 EQU   DXVOLSR+12
DXRESSW  EQU   FORCORE+524
DXUCBSAV EQU   FORCORE+564
DXUDCBAD EQU   FORCORE+568
DXPDCBAD EQU   FORCORE+572
DXATCOM1 EQU   FORCORE+588
DXATGENS EQU   DXATCOM1
DXATVGIV EQU   DXATGENS
DXATOUTA EQU   DXATCOM1+2
DXATDACC EQU   DXATCOM1+3
DXATCOM2 EQU   FORCORE+592
DXATEOV  EQU   DXATCOM2
DXATOPEN EQU   DXATCOM2+1
DXATALL  EQU   DXATCOM2+2
DXATSWAP EQU   DXATALL
DXATEXC1 EQU   FORCORE+604
DXATEXB1 EQU   DXATEXC1
DXATEXC2 EQU   FORCORE+608
DSECTSIZ EQU   FORCORE+612
TRRMSG   EQU   0
MSGCHARS EQU   0
MSGCHAR1 EQU   MSGCHARS
MSGCHAR2 EQU   MSGCHARS+1
DSNLOC   EQU   0
DSABLIST EQU   0
TCBPTRS  EQU   0
TCBPTR   EQU   TCBPTRS+4
IECPREFX EQU   0
IECCORLN EQU   IECPREFX+8
IECCORAD EQU   IECPREFX+12
IECCORKY EQU   IECPREFX+16
IECCORSP EQU   IECPREFX+19
IECCORPS EQU   IECPREFX+20
IECCORP1 EQU   IECPREFX+24
IECCORP2 EQU   IECPREFX+28
IECEXTPR EQU   IECPREFX+32
IECREGSV EQU   IECEXTPR
IECWTGTB EQU   IECEXTPR+72
IECRRPRM EQU   IECEXTPR+76
IECUPRML EQU   IECEXTPR+80
IECRESWA EQU   IECEXTPR+84
RWARESWA EQU   0
RWAPREFX EQU   RWARESWA
USERPRML EQU   0
IECRRPL  EQU   0
RRPLIST  EQU   IECRRPL
RRFUNCTN EQU   RRPLIST
RRFDADSM EQU   RRFUNCTN
RRFRJFCB EQU   RRFUNCTN
RRFLAGS1 EQU   RRPLIST+1
RRFLAGS2 EQU   RRPLIST+2
RRFFIN1  EQU   RRFLAGS2
RRFLAGS3 EQU   RRPLIST+3
RRFNRTCA EQU   RRFLAGS3
RRFTERM  EQU   RRFLAGS3
RR1WRKAR EQU   RRPLIST+4
RR1RETRY EQU   RRPLIST+8
RRXRETRY EQU   RRPLIST+12
RRUCBPTR EQU   RRXRETRY
RRFWORK  EQU   RRPLIST+20
DSMADTRL EQU   0
DSMADTW1 EQU   DSMADTRL
DSMADTB1 EQU   DSMADTW1
DSMISAM  EQU   DSMADTB1
DSMVIO   EQU   DSMADTB1
DSMASWAP EQU   DSMADTB1
DSMADTB2 EQU   DSMADTW1+1
DSMADTW3 EQU   DSMADTRL+8
WTGTABLE EQU   0
WTGWTOPR EQU   WTGTABLE
WTG      EQU   0
WTGAREA  EQU   WTG
WTGMODNM EQU   WTGAREA
WTGPREFX EQU   WTGAREA+16
WTGPATHS EQU   WTG+30
WTGENTRY EQU   0
WTGIDTTR EQU   WTGENTRY
WTGCORE  EQU   WTGENTRY+5
APPNMTBL EQU   0
APPENTRY EQU   APPNMTBL+4
SDWA     EQU   0
SDWAPARM EQU   SDWA
SDWAFIOB EQU   SDWA+4
SDWAABCC EQU   SDWAFIOB
SDWACMPF EQU   SDWAABCC
SDWACTL1 EQU   SDWA+8
SDWACMKA EQU   SDWACTL1
SDWAMWPA EQU   SDWACTL1+1
SDWAKEYA EQU   SDWAMWPA
SDWAPMKA EQU   SDWACTL1+4
SDWACTL2 EQU   SDWA+16
SDWACMKP EQU   SDWACTL2
SDWAMWPP EQU   SDWACTL2+1
SDWAPMKP EQU   SDWACTL2+4
SDWAGRSV EQU   SDWA+24
SDWANAME EQU   SDWA+88
SDWAEC1  EQU   SDWA+104
SDWAEMK1 EQU   SDWAEC1
SDWAMWP1 EQU   SDWAEC1+1
SDWAINT1 EQU   SDWAEC1+2
SDWANXT1 EQU   SDWAEC1+4
SDWAAEC1 EQU   SDWA+112
SDWAILC1 EQU   SDWAAEC1+1
SDWAINC1 EQU   SDWAAEC1+2
SDWAICD1 EQU   SDWAINC1+1
SDWAEC2  EQU   SDWA+120
SDWAEMK2 EQU   SDWAEC2
SDWAMWP2 EQU   SDWAEC2+1
SDWAINT2 EQU   SDWAEC2+2
SDWANXT2 EQU   SDWAEC2+4
SDWAAEC2 EQU   SDWA+128
SDWAILC2 EQU   SDWAAEC2+1
SDWAINC2 EQU   SDWAAEC2+2
SDWAICD2 EQU   SDWAINC2+1
SDWASRSV EQU   SDWA+136
SDWAIDNT EQU   SDWA+200
SDWAMCH  EQU   SDWA+204
SDWASTCK EQU   SDWAMCH
SDWAMCHI EQU   SDWAMCH+8
SDWAMCHS EQU   SDWAMCHI
SDWAMCHD EQU   SDWAMCHI+1
SDWARSR1 EQU   SDWAMCH+12
SDWARSR2 EQU   SDWAMCH+13
SDWAFLGS EQU   SDWA+232
SDWAERRA EQU   SDWAFLGS
SDWAMCHK EQU   SDWAERRA
SDWAPCHK EQU   SDWAERRA
SDWARKEY EQU   SDWAERRA
SDWAERRB EQU   SDWAFLGS+1
SDWAERRC EQU   SDWAFLGS+2
SDWAPERC EQU   SDWAERRC
SDWAERRD EQU   SDWAFLGS+3
SDWACLUP EQU   SDWAERRD
SDWAIOFS EQU   SDWA+238
SDWACPUA EQU   SDWA+248
SDWAPARQ EQU   SDWA+252
SDWARCDE EQU   SDWAPARQ
SDWAACF2 EQU   SDWAPARQ+1
SDWARCRD EQU   SDWAACF2
SDWAACF3 EQU   SDWAPARQ+2
SDWAACF4 EQU   SDWAPARQ+3
SDWALKWA EQU   SDWA+256
SDWALKWS EQU   SDWALKWA
SDWARECP EQU   SDWA+292
SDWASNPA EQU   SDWA+320
SDWADUMP EQU   SDWASNPA
SDWADPFS EQU   SDWADUMP+1
SDWADDAT EQU   SDWASNPA+4
SDWASDAT EQU   SDWADDAT
SDWAPDAT EQU   SDWADDAT+2
SDWADPSA EQU   SDWA+328
SDWADPSL EQU   SDWADPSA
SDWARA   EQU   SDWA+400
SDWAVRAL EQU   SDWARA
SDWADPVA EQU   SDWARA+2
SDWAHEX  EQU   SDWADPVA
SDWAURAL EQU   SDWARA+3
SDWAVRA  EQU   SDWARA+4
CVTMAP   EQU   0
CVT      EQU   CVTMAP
CVTTCBP  EQU   CVTMAP
CVTDAR   EQU   CVTMAP+72
CVTFLGS1 EQU   CVTDAR
CVTDCB   EQU   CVTMAP+116
CVTIERLC EQU   CVTMAP+144
CVTOPTA  EQU   CVTMAP+182
CVTOPTB  EQU   CVTMAP+183
CVTGTF   EQU   CVTMAP+236
CVTGTFST EQU   CVTGTF
CVTGTFS  EQU   CVTGTFST
CVTSTATE EQU   CVTGTFST
CVTTMODE EQU   CVTGTFST
CVTFORM  EQU   CVTGTFST
CVTAQAVT EQU   CVTMAP+240
CVTTCMFG EQU   CVTAQAVT
CVTVOLM2 EQU   CVTMAP+244
CVTTATA  EQU   CVTVOLM2
CVTTSKS  EQU   CVTTATA
CVTVOLF2 EQU   CVTTSKS
CVTTAT   EQU   CVTTATA+1
CVTATER  EQU   CVTMAP+248
CVTEXT1  EQU   CVTMAP+252
CVTPURG  EQU   CVTMAP+260
CVTQMSG  EQU   CVTMAP+268
CVTDMSR  EQU   CVTMAP+272
CVTERPV  EQU   CVTMAP+316
CVTINTLA EQU   CVTMAP+320
CVTAPF   EQU   CVTMAP+324
CVTEXT2  EQU   CVTMAP+328
CVTHJES  EQU   CVTMAP+332
CVTPGSIA EQU   CVTMAP+348
CVTA1F1  EQU   CVTMAP+356
CVTSYSK  EQU   CVTMAP+357
CVTVOLM1 EQU   CVTMAP+380
CVTVOLF1 EQU   CVTVOLM1
CVTATMCT EQU   CVTMAP+388
CVTXTNT1 EQU   0
CVTXTNT2 EQU   0
CVTDSSV  EQU   CVTXTNT2
CVTFLGBT EQU   CVTXTNT2+5
CVTQID   EQU   CVTXTNT2+24
CVTRV400 EQU   CVTXTNT2+52
CVTRV409 EQU   CVTXTNT2+53
CVTATCVT EQU   CVTXTNT2+64
CVTRV429 EQU   CVTXTNT2+84
CVTRV438 EQU   CVTXTNT2+85
CVTRV457 EQU   CVTXTNT2+112
CVTRV466 EQU   CVTXTNT2+113
CVTFIX   EQU   0
CVTRELNO EQU   CVTFIX+252
TCBFIX   EQU   0
TCBFRS   EQU   TCBFIX
TCB      EQU   0
TCBPIE   EQU   TCB+4
TCBPMASK EQU   TCBPIE
TCBTIO   EQU   TCB+12
TCBCMP   EQU   TCB+16
TCBCMPF  EQU   TCBCMP
TCBCPP   EQU   TCBCMPF
TCBSTCC  EQU   TCBCMPF
TCBCDBL  EQU   TCBCMPF
TCBCWTO  EQU   TCBCMPF
TCBCIND  EQU   TCBCMPF
TCBCMSG  EQU   TCBCMPF
TCBTRN   EQU   TCB+20
TCBABF   EQU   TCBTRN
TCBMSS   EQU   TCB+24
TCBPKF   EQU   TCB+28
TCBFLGS  EQU   TCB+29
TCBFLGS1 EQU   TCBFLGS
TCBFLGS2 EQU   TCBFLGS+1
TCBFLGS3 EQU   TCBFLGS+2
TCBFLGS4 EQU   TCBFLGS+3
TCBFLGS5 EQU   TCBFLGS+4
TCBABWF  EQU   TCBFLGS5
TCBJPQ   EQU   TCB+44
TCBPURGE EQU   TCBJPQ
TCBGRS   EQU   TCB+48
TCBFSA   EQU   TCB+112
TCBTME   EQU   TCB+120
TCBJSTCB EQU   TCB+124
TCBTSFLG EQU   TCB+148
TCBTSTSK EQU   TCBTSFLG
TCBSTAB  EQU   TCB+160
TCBNSTAE EQU   TCBSTAB
TCBTCT   EQU   TCB+164
TCBTCTGF EQU   TCBTCT
TCBSCNDY EQU   TCB+172
TCBNDSP  EQU   TCBSCNDY
TCBNDSP1 EQU   TCBNDSP+1
TCBNDSP2 EQU   TCBNDSP+2
TCBNDSP3 EQU   TCBNDSP+3
TCBJSCB  EQU   TCB+180
TCBRECDE EQU   TCBJSCB
TCBEXT1  EQU   TCB+196
TCBBITS  EQU   TCB+200
TCBNDSP4 EQU   TCBBITS
TCBNDSP5 EQU   TCBBITS+1
TCBFLGS6 EQU   TCBBITS+2
TCBFLGS7 EQU   TCBBITS+3
TCBDAR   EQU   TCB+204
TCBDARC  EQU   TCBDAR
TCBEXT2  EQU   TCB+208
TCBFOE   EQU   TCB+244
TCBESTAE EQU   TCB+264
TCBESTRM EQU   TCBESTAE+1
TCBFBYT1 EQU   TCB+276
TCBFBYT2 EQU   TCB+277
TCBRV124 EQU   TCB+278
TCBRV133 EQU   TCB+279
TCBXTNT2 EQU   0
TCBGTF   EQU   TCBXTNT2
TCBTFLG  EQU   TCBGTF
TCBRV146 EQU   TCBXTNT2+28
TCBRV155 EQU   TCBXTNT2+29
TCBRV164 EQU   TCBXTNT2+30
TCBRV173 EQU   TCBXTNT2+31
IEZJSCB  EQU   0
JSCBSEC1 EQU   IEZJSCB+188
JSCHPCE  EQU   JSCBSEC1+4
JSCBDCB  EQU   JSCBSEC1+36
JSCBOPTS EQU   JSCBSEC1+48
JSCBSWT1 EQU   JSCBSEC1+55
JSCBWTP  EQU   JSCBSEC1+64
JSCBWTFG EQU   JSCBWTP
JSCBEND1 EQU   IEZJSCB+260
VDSCB    EQU   0
TIOT1    EQU   0
TIOCNJOB EQU   TIOT1
TIOCSTEP EQU   TIOT1+8
UCB      EQU   0
UCBOB    EQU   0
UCBJBNR  EQU   UCBOB
UCBFL5   EQU   UCBOB+1
UCBAF    EQU   UCBFL5
UCBSTAT  EQU   UCBOB+3
UCBCHAN  EQU   UCBOB+4
UCBSFLS  EQU   UCBOB+6
UCBFLA   EQU   UCBSFLS
UCBFL1   EQU   UCBFLA
UCBBSY   EQU   UCBFL1
UCBNRY   EQU   UCBFL1
UCBPST   EQU   UCBFL1
UCBCUB   EQU   UCBFL1
UCBFLB   EQU   UCBSFLS+1
UCBCHM   EQU   UCBOB+8
UCBCHM1  EQU   UCBCHM
UCBPTH0  EQU   UCBCHM1
UCBPTH1  EQU   UCBCHM1
UCBWGT   EQU   UCBOB+12
UCBNAME  EQU   UCBOB+13
UCBTYP   EQU   UCBOB+16
UCBTBYT1 EQU   UCBTYP
UCB1FEA5 EQU   UCBTBYT1
UCB1FEA6 EQU   UCBTBYT1
UCBTBYT2 EQU   UCBTYP+1
UCB2OPT2 EQU   UCBTBYT2
UCBDUDN1 EQU   UCB2OPT2
UCB2OPT3 EQU   UCBTBYT2
UCBDUDN2 EQU   UCB2OPT3
UCB2OPT4 EQU   UCBTBYT2
UCBRWTAU EQU   UCB2OPT4
UCB2OPT6 EQU   UCBTBYT2
UCB2OPT7 EQU   UCBTBYT2
UCBTBYT3 EQU   UCBTYP+2
UCBDVCLS EQU   UCBTBYT3
UCBTBYT4 EQU   UCBTYP+3
UCBEXTPT EQU   UCBOB+20
UCBFLC   EQU   UCBEXTPT
UCBDEV   EQU   UCBOB+24
UCBCMEXT EQU   0
UCBATI   EQU   UCBCMEXT+3
@NM00120 EQU   UCBATI
UCBFLP1  EQU   UCBCMEXT+5
UCBMT    EQU   0
UCBOCR   EQU   0
UCB3540X EQU   0
UCBDKBYT EQU   UCB3540X+6
UCBUCS   EQU   0
UCBUCSOP EQU   UCBUCS+4
UCBFCBOP EQU   UCBUCS+5
I256C    EQU   0
I001C    EQU   0
I008P    EQU   0
I015F    EQU   0
I015P    EQU   0
I031F    EQU   0
I031P    EQU   0
UCBBGN   EQU   0
RRFWKB4  EQU   RRFWORK+3
TRRWA    EQU   TRRXEND
RECPARML EQU   TRRWA+4
RECERMOD EQU   RECPARML
RECERCST EQU   RECPARML+8
RECRRID  EQU   RECPARML+16
GTRACBUF EQU   TRRWA+28
GTRACLNG EQU   GTRACBUF
GTRACFID EQU   GTRACBUF+2
GTRACDAP EQU   GTRACBUF+4
GTRACDAT EQU   GTRACBUF+8
TRRWTP   EQU   TRRWA+400
TRRMSGLN EQU   TRRWTP
TRRMCS   EQU   TRRWTP+2
TRRMSGID EQU   TRRWTP+4
TRRERMOD EQU   TRRWTP+12
TRRDSN   EQU   TRRERMOD
TRRCOMMA EQU   TRRWTP+20
TRRREST  EQU   TRRWTP+21
SDUMPPRM EQU   TRRWA+504
MESSAGE  EQU   TRRWTP
MSGBUF   EQU   MESSAGE
MSGLNG   EQU   MSGBUF
MSGMCS   EQU   MSGBUF+2
SDUMPHDR EQU   MSGMCS+1
TCMODNM  EQU   MSGBUF+12
TCSUBNM  EQU   MSGBUF+21
WAJOBNM  EQU   MSGBUF+30
WASTEPNM EQU   MSGBUF+39
TCDEBAD  EQU   MSGBUF+47
ROUTE1   EQU   TCDEBAD
MSGDEBAD EQU   MSGBUF+59
VDSCBPTR EQU   DSMADTW3
PURGELST EQU   TRRXEND
PURGBYT0 EQU   PURGELST
PURGEDEB EQU   PURGELST+1
TIOTPTR  EQU   TCBTIO
DXXWTG   EQU   DSECTSIZ
DXXAREA  EQU   DSECTSIZ+4
DXXMODNM EQU   DXXAREA
DXXLNG   EQU   DXXAREA+29
DXXENTRY EQU   DXXAREA+32
DXXIDTTR EQU   DXXENTRY
DXREGSAV EQU   DXCCW8
DXREG1   EQU   DXREGSAV+28
DXIDENT  EQU   DXCCW12
DXRETMOD EQU   DXIDENT+2
@NM00055 EQU   DXXCTL
DXSAVMOD EQU   @NM00055+2
@NM00056 EQU   DXRESSW
USERKEY  EQU   SDWAKEYA
CVTDMSRF EQU   CVTDMSR
CVTDUMPF EQU   CVTDMSRF
CVTS01   EQU   CVTPGSIA
CVTLPDIA EQU   CVTS01+12
CVTDIRST EQU   CVTLPDIA
CVTSLIDA EQU   CVTS01+24
CVTCTLFG EQU   CVTS01+50
CVTRV210 EQU   CVTS01+424
CVTRV219 EQU   CVTS01+425
CVTRV228 EQU   CVTS01+426
CVTRV237 EQU   CVTS01+427
CVTMFRTR EQU   CVTS01+452
CVTRV262 EQU   CVTS01+468
CVTRV271 EQU   CVTS01+469
CVTRV280 EQU   CVTS01+470
CVTRV289 EQU   CVTS01+471
CVTGSDA  EQU   CVTS01+600
JSCBSEC2 EQU   JSCBEND1
JSCBSEC3 EQU   JSCBEND1
JSCBJCT  EQU   JSCBSEC3
JSCBJCTA EQU   JSCBJCT+1
JSCBASID EQU   JSCBSEC3+8
JSCBJNL  EQU   JSCBSEC3+28
JSCBJJSB EQU   JSCBJNL
JSCBSUB  EQU   JSCBSEC3+40
JSCSCT   EQU   JSCBSEC3+68
JSCRSV35 EQU   JSCBSEC3+96
JSCRSV36 EQU   JSCRSV35
JSCRSV37 EQU   JSCRSV35+2
JSCRSV45 EQU   JSCBSEC3+112
JSCRSV46 EQU   JSCRSV45
JSCRSV47 EQU   JSCRSV45+2
TIOENTRY EQU   TIOT1+24
TIOESTTA EQU   TIOENTRY+1
TIOERLOC EQU   TIOENTRY+2
TIOELINK EQU   TIOERLOC+1
TIOESYOT EQU   TIOELINK
TIOESTTC EQU   TIOENTRY+15
TIOESTTB EQU   TIOENTRY+16
POOLSTAR EQU   TIOENTRY+20
TIOEDEVE EQU   TIOESTTB
TIOSTTB  EQU   TIOEDEVE
UCBOBS01 EQU   UCBDEV
UCBVOLI  EQU   UCBOBS01+4
UCBSTAB  EQU   UCBOBS01+10
UCBBSVL  EQU   UCBSTAB
UCBPRSRS EQU   UCBSTAB
UCBDMCT  EQU   UCBOBS01+11
UCBFL4   EQU   UCBOBS01+13
UCBOBS02 EQU   UCBDEV
UCBTFL1  EQU   UCBOBS02+19
UCBXTN   EQU   UCBOBS02+20
UCBVOPT  EQU   UCBXTN
UCBOBS03 EQU   UCBDEV
UCBXTADR EQU   UCBOBS03
UCBOBS04 EQU   UCBDEV
UCBBTA   EQU   UCBOBS04+12
UCBOBS06 EQU   UCBDEV
UCBAOF   EQU   UCBOBS06
UCBAOF1  EQU   UCBAOF
UCBAOF2  EQU   UCBAOF+1
@NM00119 EQU   UCBOBS06+3
UCBIRB   EQU   UCBOBS06+4
UCBGRAF  EQU   UCBIRB
UCBLDNCA EQU   UCBOBS06+8
UCBRDYQ  EQU   UCBLDNCA
UCBIRLN  EQU   UCBRDYQ
UCBLDNCB EQU   UCBRDYQ+1
UCBCTLNK EQU   UCBOBS06+12
UCBOBS07 EQU   UCBDEV
UCBOBS08 EQU   UCBDEV
UCBOBS09 EQU   UCBDEV
DXBTAMX  EQU   DXREG1
DXCCW1A  EQU   DXCCW1
DXDSNAME EQU   DXCCW5
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS
UCBRV066 EQU   UCBOBS09+4
UCBIOSBA EQU   UCBOBS09
UCBRV042 EQU   UCBOBS08+5
UCBCTCF1 EQU   UCBOBS08+4
UCBCTCAD EQU   UCBOBS08
UCBICNCB EQU   UCBOBS07+4
UCBRV040 EQU   UCBOBS07
UCBCTLNA EQU   UCBCTLNK+1
UCBRLN   EQU   UCBCTLNK
UCBRDYQA EQU   UCBLDNCB
UCBINRLN EQU   UCBIRLN
UCBIRBA  EQU   UCBIRB+1
UCBRV039 EQU   UCBGRAF
UCBDWNR  EQU   UCBGRAF
UCBRPND  EQU   UCBGRAF
UCBUPM   EQU   UCBGRAF
UCBBTAM  EQU   UCBGRAF
UCBDRNO  EQU   UCBGRAF
UCBDRO   EQU   UCBGRAF
UCBOIP   EQU   UCBGRAF
UCBATRCD EQU   @NM00119
UCBSKPFG EQU   @NM00119
UCBRIPND EQU   @NM00119
UCBRTIAC EQU   @NM00119
UCBRSV79 EQU   @NM00119
UCBRSV78 EQU   @NM00119
UCBRSV77 EQU   @NM00119
UCBOLTEP EQU   @NM00119
UCBATNCT EQU   UCBOBS06+2
UCBRSV76 EQU   UCBAOF2
UCBRSV75 EQU   UCBAOF2
UCBRSV74 EQU   UCBAOF2
UCBRSV73 EQU   UCBAOF2
UCBRSV72 EQU   UCBAOF2
UCBRSV71 EQU   UCBAOF2
UCBRSV70 EQU   UCBAOF2
UCBRSV69 EQU   UCBAOF2
UCBRSV68 EQU   UCBAOF1
UCBRSV67 EQU   UCBAOF1
UCBRSV66 EQU   UCBAOF1
UCBRSV65 EQU   UCBAOF1
UCBRSV64 EQU   UCBAOF1
UCBOFNL  EQU   UCBAOF1
UCBOFSP  EQU   UCBAOF1
UCBOFMCR EQU   UCBAOF1
UCBBTB   EQU   UCBBTA+1
UCBDI    EQU   UCBBTA
UCBSNS   EQU   UCBOBS04+8
UCBTEB   EQU   UCBOBS04+4
UCBGCB   EQU   UCBOBS04+3
UCBOPEN  EQU   UCBOBS04+2
UCBSTART EQU   UCBOBS04
UCBXTNB  EQU   UCBXTN+1
UCBRSV22 EQU   UCBVOPT
UCBRSV21 EQU   UCBVOPT
UCBRSV20 EQU   UCBVOPT
UCBESVE  EQU   UCBVOPT
UCBERPC  EQU   UCBVOPT
UCBESVC  EQU   UCBVOPT
UCBEVA   EQU   UCBVOPT
UCBESV   EQU   UCBVOPT
UCBRV009 EQU   UCBTFL1
UCBRV008 EQU   UCBTFL1
UCBRV007 EQU   UCBTFL1
UCBRV006 EQU   UCBTFL1
UCBRV005 EQU   UCBTFL1
UCBRV038 EQU   UCBTFL1
UCBNSLTP EQU   UCBTFL1
UCBNLTP  EQU   UCBTFL1
UCBRES1B EQU   UCBOBS02+18
UCBFSER  EQU   UCBOBS02+12
@NM00118 EQU   UCBOBS02+4
UCBFSEQ  EQU   UCBOBS02+2
UCBFSCT  EQU   UCBOBS02
UCBNEXP  EQU   UCBOBS01+20
UCBBASE  EQU   UCBOBS01+16
UCBRES1A EQU   UCBOBS01+15
UCBUSER  EQU   UCBOBS01+14
UCBFL47  EQU   UCBFL4
UCBFL46  EQU   UCBFL4
UCBFL45  EQU   UCBFL4
UCBRV065 EQU   UCBFL4
UCBDSS   EQU   UCBFL4
UCBRV028 EQU   UCBFL4
UCBWDAV  EQU   UCBFL4
UCBDAVV  EQU   UCBFL4
UCBSQC   EQU   UCBOBS01+12
UCBDATP  EQU   UCBOBS01+12
UCBDMC   EQU   UCBDMCT
UCBMOUNT EQU   UCBDMCT
UCBBNUL  EQU   UCBSTAB
UCBSHAR  EQU   UCBSTAB
UCBBSTR  EQU   UCBSTAB
UCBBPUB  EQU   UCBSTAB
UCBBPRV  EQU   UCBSTAB
UCBBALB  EQU   UCBPRSRS
UCBPGFL  EQU   UCBSTAB
UCBDVSHR EQU   UCBBSVL
UCBVTOC  EQU   UCBOBS01
TIOUCBP  EQU   TIOEDEVE+1
TIOVERF  EQU   TIOSTTB
TIOUNLD  EQU   TIOSTTB
TIOMNTD  EQU   TIOSTTB
TIOSETU  EQU   TIOSTTB
TIOVLSR  EQU   TIOSTTB
TIOPVIO  EQU   TIOSTTB
TIOREQD  EQU   TIOSTTB
TIOUSED  EQU   TIOSTTB
TIOTFEND EQU   POOLSTAR+16
TIOPSLOT EQU   POOLSTAR+13
TIOPSTTB EQU   POOLSTAR+12
TIOPPOOL EQU   POOLSTAR+4
TIOPNSRT EQU   POOLSTAR+3
@NM00116 EQU   POOLSTAR+2
TIOPNSLT EQU   POOLSTAR+1
@NM00115 EQU   POOLSTAR
TIOEFSRT EQU   TIOENTRY+17
TIOSVERF EQU   TIOESTTB
TIOSUNLD EQU   TIOESTTB
TIOSMNTD EQU   TIOESTTB
TIOSSETU EQU   TIOESTTB
TIOSVLSR EQU   TIOESTTB
TIOSPVIO EQU   TIOESTTB
TIOSREQD EQU   TIOESTTB
TIOSUSED EQU   TIOESTTB
TIOSBALS EQU   TIOESTTC
TIOSBALP EQU   TIOESTTC
TIOSVOLS EQU   TIOESTTC
TIOSVOLP EQU   TIOESTTC
TIOSAFFS EQU   TIOESTTC
TIOSAFFP EQU   TIOESTTC
TIOSDEFR EQU   TIOESTTC
TIOSDKCR EQU   TIOESTTC
TIOEJFCB EQU   TIOENTRY+12
TIOEDDNM EQU   TIOENTRY+4
TIOTREM  EQU   TIOELINK
TIOESSDS EQU   TIOESYOT
TIOESYIN EQU   TIOELINK
TIOEQNAM EQU   TIOELINK
TIOEDYNM EQU   TIOELINK
TIOTTERM EQU   TIOELINK
TIOTRV01 EQU   TIOELINK
TIOSYOUT EQU   TIOELINK
TIOEWTCT EQU   TIOERLOC
TIOSDSP2 EQU   TIOESTTA
TIOSDSP1 EQU   TIOESTTA
TIOSLABL EQU   TIOESTTA
TIOSDADS EQU   TIOESTTA
TIOSJBLB EQU   TIOESTTA
TIOSPLTS EQU   TIOESTTA
TIOSPLTP EQU   TIOESTTA
TIOSLTYP EQU   TIOESTTA
TIOELNGH EQU   TIOENTRY
JSCBEND3 EQU   JSCBSEC3+120
JSCRSV52 EQU   JSCBSEC3+116
JSCRSV51 EQU   JSCRSV47+1
JSCRSV50 EQU   JSCRSV47
JSCRSV49 EQU   JSCRSV46+1
JSCRSV48 EQU   JSCRSV46
JSCRSV44 EQU   JSCBSEC3+108
JSCRSV43 EQU   JSCBSEC3+104
JSCRSV42 EQU   JSCBSEC3+100
JSCRSV41 EQU   JSCRSV37+1
JSCRSV40 EQU   JSCRSV37
JSCRSV39 EQU   JSCRSV36+1
JSCRSV38 EQU   JSCRSV36
JSCBUFPT EQU   JSCBSEC3+92
JSCBACT  EQU   JSCBSEC3+88
JSCBSWSP EQU   JSCBSEC3+87
JSCRSV33 EQU   JSCBSEC3+86
JSCDDNUM EQU   JSCBSEC3+84
JSCRSV53 EQU   JSCBSEC3+82
JSCDDNNO EQU   JSCBSEC3+80
JSCBVATA EQU   JSCBSEC3+76
JSCTMCOR EQU   JSCBSEC3+72
JSCSCTP  EQU   JSCSCT+1
JSCRSV55 EQU   JSCSCT
JSCRSV54 EQU   JSCBSEC3+64
JSCDSABQ EQU   JSCBSEC3+60
JSCBSSIB EQU   JSCBSEC3+56
JSCBFRBA EQU   JSCBSEC3+48
JSCRSV28 EQU   JSCBSEC3+46
JSCBSONO EQU   JSCBSEC3+44
JSCBSUBA EQU   JSCBSUB+1
JSCRSV31 EQU   JSCBSUB
JSCBSMLR EQU   JSCBSEC3+36
JSCBJNLR EQU   JSCBSEC3+32
JSCBJNLA EQU   JSCBJNL+1
JSCBJSBT EQU   JSCBJJSB
JSCBJSBX EQU   JSCBJJSB
JSCBJSBA EQU   JSCBJJSB
JSCBJSBI EQU   JSCBJJSB
@NM00114 EQU   JSCBJJSB
JSCBJNLE EQU   JSCBJJSB
JSCBJNLF EQU   JSCBJJSB
JSCBJNLN EQU   JSCBJJSB
@NM00113 EQU   JSCBSEC3+24
JSCBJRBA EQU   JSCBSEC3+16
JSCBIECB EQU   JSCBSEC3+12
JSCRSV25 EQU   JSCBSEC3+10
JSCBTJID EQU   JSCBASID
JSCBPSCB EQU   JSCBSEC3+4
JSCJCTP  EQU   JSCBJCTA
JSCRSV24 EQU   JSCBJCT
JSCBEND2 EQU   JSCBSEC2
CVTRV628 EQU   CVTS01+728
CVTRV627 EQU   CVTS01+724
CVTRV626 EQU   CVTS01+720
CVTRV625 EQU   CVTS01+716
CVTRV624 EQU   CVTS01+712
CVTRV623 EQU   CVTS01+708
CVTRV622 EQU   CVTS01+704
CVTRV621 EQU   CVTS01+700
CVTRV620 EQU   CVTS01+696
CVTRV619 EQU   CVTS01+692
CVTRV618 EQU   CVTS01+688
CVTRV617 EQU   CVTS01+684
CVTRV616 EQU   CVTS01+680
CVTRV615 EQU   CVTS01+676
CVTRV614 EQU   CVTS01+672
CVTRV613 EQU   CVTS01+668
CVTRV612 EQU   CVTS01+664
CVTRV611 EQU   CVTS01+660
CVTRV610 EQU   CVTS01+656
CVTRV609 EQU   CVTS01+652
CVTRV608 EQU   CVTS01+648
CVTRV607 EQU   CVTS01+644
CVTRV606 EQU   CVTS01+640
CVTRV605 EQU   CVTS01+636
CVTRV604 EQU   CVTS01+632
CVTEFF02 EQU   CVTS01+628
CVTCBBR  EQU   CVTS01+624
CVTSSCR  EQU   CVTS01+620
CVTEVENT EQU   CVTS01+616
CVTCRCA  EQU   CVTS01+612
CVTTPIO  EQU   CVTS01+608
CVTADV   EQU   CVTS01+604
CVTGSDAB EQU   CVTGSDA
CVTQV3   EQU   CVTS01+596
CVTQV2   EQU   CVTS01+592
CVTQV1   EQU   CVTS01+588
CVTRPT   EQU   CVTS01+584
CVTSSRB  EQU   CVTS01+580
CVTCSDRL EQU   CVTS01+576
CVTEXP1  EQU   CVTS01+572
CVTRMPMT EQU   CVTS01+568
CVTRMPTT EQU   CVTS01+564
CVTVPSA  EQU   CVTS01+560
CVTVSTOP EQU   CVTS01+556
CVTGTFR8 EQU   CVTS01+552
CVTQUIT  EQU   CVTS01+548
CVTVACR  EQU   CVTS01+544
CVTWTCB  EQU   CVTS01+540
CVTSTPRS EQU   CVTS01+536
CVT0PT02 EQU   CVTS01+532
CVTDARCM EQU   CVTS01+528
CVTIRECM EQU   CVTS01+524
CVTJRECM EQU   CVTS01+520
CVTVEMS0 EQU   CVTS01+516
CVTSPFRR EQU   CVTS01+512
CVTRLSTG EQU   CVTS01+508
CVT0TC0A EQU   CVTS01+504
CVTGMBR  EQU   CVTS01+500
CVTLFRM  EQU   CVTS01+496
CVTRMBR  EQU   CVTS01+492
CVTVIOP  EQU   CVTS01+488
CVTRV307 EQU   CVTS01+486
CVTRV306 EQU   CVTS01+484
CVTRV305 EQU   CVTS01+482
CVTRV304 EQU   CVTS01+480
CVTRV303 EQU   CVTS01+478
CVTRV302 EQU   CVTS01+476
CVTTRCA  EQU   CVTS01+472
CVTRV297 EQU   CVTRV289
CVTRV296 EQU   CVTRV289
CVTRV295 EQU   CVTRV289
CVTRV294 EQU   CVTRV289
CVTRV293 EQU   CVTRV289
CVTRV292 EQU   CVTRV289
CVTRV291 EQU   CVTRV289
CVTRV290 EQU   CVTRV289
CVTRV288 EQU   CVTRV280
CVTRV287 EQU   CVTRV280
CVTRV286 EQU   CVTRV280
CVTRV285 EQU   CVTRV280
CVTRV284 EQU   CVTRV280
CVTRV283 EQU   CVTRV280
CVTRV282 EQU   CVTRV280
CVTRV281 EQU   CVTRV280
CVTRV279 EQU   CVTRV271
CVTRV278 EQU   CVTRV271
CVTRV277 EQU   CVTRV271
CVTRV276 EQU   CVTRV271
CVTRV275 EQU   CVTRV271
CVTRV274 EQU   CVTRV271
CVTRV273 EQU   CVTRV271
CVTRV272 EQU   CVTRV271
CVTRV270 EQU   CVTRV262
CVTRV269 EQU   CVTRV262
CVTRV268 EQU   CVTRV262
CVTRV267 EQU   CVTRV262
CVTRV266 EQU   CVTRV262
CVTRV265 EQU   CVTRV262
CVTRV264 EQU   CVTRV262
CVTRV263 EQU   CVTRV262
CVTVFP   EQU   CVTS01+464
CVTVSI   EQU   CVTS01+460
CVTVPSIB EQU   CVTS01+456
CVTMFACT EQU   CVTMFRTR
CVTMFCTL EQU   CVTS01+448
CVTPVBP  EQU   CVTS01+444
CVTPWI   EQU   CVTS01+440
CVTRV254 EQU   CVTS01+438
CVTRV253 EQU   CVTS01+436
CVTRV252 EQU   CVTS01+434
CVTRV251 EQU   CVTS01+433
CVTRV250 EQU   CVTS01+432
CVTRV249 EQU   CVTS01+431
CVTRV248 EQU   CVTS01+430
CVTRV247 EQU   CVTS01+429
CVTRV246 EQU   CVTS01+428
CVTRV245 EQU   CVTRV237
CVTRV244 EQU   CVTRV237
CVTRV243 EQU   CVTRV237
CVTRV242 EQU   CVTRV237
CVTRV241 EQU   CVTRV237
CVTRV240 EQU   CVTRV237
CVTRV239 EQU   CVTRV237
CVTRV238 EQU   CVTRV237
CVTRV236 EQU   CVTRV228
CVTRV235 EQU   CVTRV228
CVTRV234 EQU   CVTRV228
CVTRV233 EQU   CVTRV228
CVTRV232 EQU   CVTRV228
CVTRV231 EQU   CVTRV228
CVTRV230 EQU   CVTRV228
CVTRV229 EQU   CVTRV228
CVTRV227 EQU   CVTRV219
CVTRV226 EQU   CVTRV219
CVTRV225 EQU   CVTRV219
CVTRV224 EQU   CVTRV219
CVTRV223 EQU   CVTRV219
CVTRV222 EQU   CVTRV219
CVTRV221 EQU   CVTRV219
CVTRV220 EQU   CVTRV219
CVTRV218 EQU   CVTRV210
CVTRV217 EQU   CVTRV210
CVTRV216 EQU   CVTRV210
CVTRV215 EQU   CVTRV210
CVTRV214 EQU   CVTRV210
CVTRV213 EQU   CVTRV210
CVTRV212 EQU   CVTRV210
CVTRV211 EQU   CVTRV210
CVTLCCAT EQU   CVTS01+420
CVTPCCAT EQU   CVTS01+416
CVTIPCRP EQU   CVTS01+412
CVTIPCRI EQU   CVTS01+408
CVTIPCDS EQU   CVTS01+404
CVTAIDVT EQU   CVTS01+400
CVTSSAP  EQU   CVTS01+396
CVTEHCIR EQU   CVTS01+392
CVTEHDEF EQU   CVTS01+388
CVTDAIR  EQU   CVTS01+384
CVTPERFM EQU   CVTS01+380
CVT044R2 EQU   CVTS01+376
CVTFETCH EQU   CVTS01+372
CVTRSTWD EQU   CVTS01+368
CVTSPOST EQU   CVTS01+364
CVTIOBP  EQU   CVTS01+360
CVTASMVT EQU   CVTS01+356
CVTRECRQ EQU   CVTS01+352
CVTWSAC  EQU   CVTS01+348
CVTRV149 EQU   CVTS01+344
CVTWSAL  EQU   CVTS01+340
CVTSPSA  EQU   CVTS01+336
CVTGLMN  EQU   CVTS01+332
CVTVEAC0 EQU   CVTS01+328
CVT062R1 EQU   CVTS01+324
CVTRPOST EQU   CVTS01+320
CVTDQIQE EQU   CVTS01+316
CVTCSD   EQU   CVTS01+312
CVTLKRMA EQU   CVTS01+308
CVTRSPIE EQU   CVTS01+304
CVTRENQ  EQU   CVTS01+300
CVTLQCB  EQU   CVTS01+296
CVTFQCB  EQU   CVTS01+292
CVTQCS01 EQU   CVTS01+288
CVTAPFT  EQU   CVTS01+284
CVTPARRL EQU   CVTS01+280
CVTVWAIT EQU   CVTS01+276
CVTGSPL  EQU   CVTS01+272
CVTLSMQ  EQU   CVTS01+268
CVTGSMQ  EQU   CVTS01+264
CVTEXPRO EQU   CVTS01+260
CVTOPCTP EQU   CVTS01+256
CVTSIC   EQU   CVTS01+252
CVTTPIOS EQU   CVTS01+248
CVTRTMS  EQU   CVTS01+244
CVTSDBF  EQU   CVTS01+240
CVTSCBP  EQU   CVTS01+236
CVTSDMP  EQU   CVTS01+232
CVTSV60  EQU   CVTS01+228
CVTRTMCT EQU   CVTS01+224
CVTASCBL EQU   CVTS01+220
CVTASCBH EQU   CVTS01+216
CVTGDA   EQU   CVTS01+212
CVTASVT  EQU   CVTS01+208
CVTVVMDI EQU   CVTS01+204
CVTAQTOP EQU   CVTS01+200
CVTIOSCS EQU   CVTS01+196
CVTSDRM  EQU   CVTS01+192
CVTOPTE  EQU   CVTS01+188
CVTSTXU  EQU   CVTS01+184
CVTQUIS  EQU   CVTS01+180
CVTPARS  EQU   CVTS01+176
CVTS1EE  EQU   CVTS01+172
CVTFRAS  EQU   CVTS01+168
CVTQSAS  EQU   CVTS01+164
CVTCRAS  EQU   CVTS01+160
CVTCRMN  EQU   CVTS01+156
CVTDELCP EQU   CVTS01+152
CVTFRECL EQU   CVTS01+148
CVTGETCL EQU   CVTS01+144
CVTBLDCP EQU   CVTS01+140
CVTAUTHL EQU   CVTS01+136
CVTSCAN  EQU   CVTS01+132
CVTRV144 EQU   CVTS01+130
CVTMAXMP EQU   CVTS01+128
CVTSTCK  EQU   CVTS01+124
CVTRV139 EQU   CVTS01+123
CVTDSSAC EQU   CVTS01+122
CVTRV513 EQU   CVTS01+121
CVTIOSPL EQU   CVTS01+120
CVTPTGT  EQU   CVTS01+116
CVTCSPIE EQU   CVTS01+112
CVTSMFEX EQU   CVTS01+108
CVTOLT0A EQU   CVTS01+104
CVTSRBRT EQU   CVTS01+100
CVTPUTL  EQU   CVTS01+96
CVTRV519 EQU   CVTS01+92
CVTRV327 EQU   CVTS01+88
CVTRV326 EQU   CVTS01+84
CVTRV325 EQU   CVTS01+80
CVTRV324 EQU   CVTS01+76
CVT0VL01 EQU   CVTS01+72
CVTSHRVM EQU   CVTS01+68
CVTRV332 EQU   CVTS01+64
CVTTAS   EQU   CVTS01+60
CVTRSCN  EQU   CVTS01+56
CVTTRAC2 EQU   CVTS01+54
CVTTRACE EQU   CVTS01+52
CVTAPG   EQU   CVTS01+51
CVTSDTRC EQU   CVTCTLFG
CVTGTRCE EQU   CVTCTLFG
CVTNOMP  EQU   CVTCTLFG
CVTRSV79 EQU   CVTCTLFG
CVTDSTAT EQU   CVTCTLFG
CVTRSV78 EQU   CVTCTLFG
CVTRV333 EQU   CVTCTLFG
CVTRV323 EQU   CVTCTLFG
CVTSPVLK EQU   CVTS01+49
CVTRSV77 EQU   CVTS01+48
CVTRV331 EQU   CVTS01+44
CVTRV330 EQU   CVTS01+40
CVTRV329 EQU   CVTS01+36
CVTRV328 EQU   CVTS01+32
CVTRV322 EQU   CVTS01+28
CVTSLID  EQU   CVTSLIDA+1
CVTSYLK  EQU   CVTSLIDA
CVTRV321 EQU   CVTS01+20
CVTRV320 EQU   CVTS01+16
CVTLPDIR EQU   CVTLPDIA+1
CVTRSV69 EQU   CVTDIRST
CVTRSV68 EQU   CVTDIRST
CVTRSV67 EQU   CVTDIRST
CVTRSV66 EQU   CVTDIRST
CVTRSV65 EQU   CVTDIRST
CVTRSV64 EQU   CVTDIRST
CVTRSV63 EQU   CVTDIRST
CVTDICOM EQU   CVTDIRST
CVTPVTP  EQU   CVTS01+8
CVTLPDSR EQU   CVTS01+4
CVTGETL  EQU   CVTS01
CVTDUMPU EQU   CVTDMSRF
DXRESIND EQU   @NM00056
DXSAVOFF EQU   @NM00055+7
DXSAVADR EQU   DXSAVMOD+2
DXSAVID  EQU   DXSAVMOD
DXABCODE EQU   @NM00055
DXRETCOD EQU   DXIDENT+7
DXRETTTR EQU   DXRETMOD+2
DXRETID  EQU   DXRETMOD
DXCALLID EQU   DXIDENT
DXREG0   EQU   DXREGSAV+24
DXREGE   EQU   DXREGSAV+20
DXREGD   EQU   DXREGSAV+16
DXREGC   EQU   DXREGSAV+12
DXREGB   EQU   DXREGSAV+8
DXREGA   EQU   DXREGSAV+4
DXREG9   EQU   DXREGSAV
DXXEND   EQU   DXXAREA+48
DXXLAST  EQU   DXXAREA+40
DXXCORE  EQU   DXXENTRY+5
DXETTR   EQU   DXXIDTTR+2
DXEID    EQU   DXXIDTTR
DXXPATHS EQU   DXXAREA+30
DXOPCLSW EQU   DXXLNG
DXXTXTLN EQU   DXXAREA+27
DXXMODSZ EQU   DXXAREA+24
DXXATTRB EQU   DXXAREA+22
@NM00040 EQU   DXXAREA+20
DXXPREFX EQU   DXXAREA+16
@NM00039 EQU   DXXAREA+12
DXXMODEP EQU   DXXAREA+8
DXXMODID EQU   DXXMODNM+6
@NM00038 EQU   DXXMODNM
DXXWTOPR EQU   DXXWTG
PURGEIOB EQU   PURGELST+8
PURGETCB EQU   PURGELST+4
ROUTE2   EQU   MSGBUF+66
@NM00025 EQU   MSGBUF+65
TCOMMA4  EQU   ROUTE1
TCOMMA3  EQU   MSGBUF+38
TCOMMA2  EQU   MSGBUF+29
TCSIFG0  EQU   TCSUBNM
TCOMMA1  EQU   MSGBUF+20
TCMIFG0  EQU   TCMODNM
MSGID    EQU   MSGBUF+4
@NM00024 EQU   MSGMCS
@NM00023 EQU   TRRWA+498
@NM00022 EQU   TRRWA+396
TRRUNALL EQU   TRRWA+350
TRRVOLSR EQU   TRRWA+344
TRRDEQV  EQU   TRRWA+332
TRRDEQD  EQU   TRRWA+316
TRRDEQT  EQU   TRRWA+304
TRRDEQP  EQU   TRRWA+292
GTRACODE EQU   GTRACDAT
SPDCBMSK EQU   TRRWA
UCBERADR EQU   UCBUCS+12
UCBFCBID EQU   UCBUCS+8
UCBERCNT EQU   UCBUCS+7
UCBRSV51 EQU   UCBUCS+6
UCBRSV50 EQU   UCBFCBOP
UCBRSV49 EQU   UCBFCBOP
UCBRSV48 EQU   UCBFCBOP
UCBRSV47 EQU   UCBFCBOP
UCBRSV46 EQU   UCBFCBOP
UCBRSV45 EQU   UCBFCBOP
UCBRSV44 EQU   UCBFCBOP
UCBFCBO1 EQU   UCBFCBOP
UCBUCSPE EQU   UCBUCSOP
UCBRSV43 EQU   UCBUCSOP
UCBRSV42 EQU   UCBUCSOP
UCBRSV41 EQU   UCBUCSOP
UCBRSV40 EQU   UCBUCSOP
UCBRSV39 EQU   UCBUCSOP
UCBUCSO2 EQU   UCBUCSOP
UCBUCSO1 EQU   UCBUCSOP
UCBUCSID EQU   UCBUCS
UCBRV073 EQU   UCB3540X+7
UCBRV072 EQU   UCBDKBYT
UCBRV071 EQU   UCBDKBYT
UCBRV070 EQU   UCBDKBYT
UCBRV069 EQU   UCBDKBYT
UCBRV068 EQU   UCBDKBYT
UCBRV067 EQU   UCBDKBYT
UCBVLVER EQU   UCBDKBYT
UCBDKAMX EQU   UCBDKBYT
UCBVLSER EQU   UCB3540X
UCBRDATA EQU   UCBOCR+4
UCBFRID  EQU   UCBOCR
UCBCLN   EQU   UCBMT+14
UCBERG   EQU   UCBMT+12
UCBMS    EQU   UCBMT+11
UCBNB    EQU   UCBMT+10
UCBPW    EQU   UCBMT+9
UCBPR    EQU   UCBMT+8
UCBSIO   EQU   UCBMT+6
UCBTW    EQU   UCBMT+5
UCBTR    EQU   UCBMT+4
UCBTWT   EQU   UCBMT+3
UCBTRT   EQU   UCBMT+2
UCBCTD   EQU   UCBMT
UCBWTOID EQU   UCBCMEXT+17
UCBRV043 EQU   UCBCMEXT+16
UCBASID  EQU   UCBCMEXT+14
UCBMFCNT EQU   UCBCMEXT+12
UCBPMSK  EQU   UCBCMEXT+10
UCBCCWOF EQU   UCBCMEXT+8
UCBRV041 EQU   UCBCMEXT+6
UCBRV036 EQU   UCBFLP1
UCBRV035 EQU   UCBFLP1
UCBRV034 EQU   UCBFLP1
UCBRV033 EQU   UCBFLP1
UCBRV032 EQU   UCBFLP1
UCBRV031 EQU   UCBFLP1
UCBSHRUP EQU   UCBFLP1
UCBNSRCH EQU   UCBFLP1
UCBSNSCT EQU   UCBCMEXT+4
UCBHPDV  EQU   @NM00120
UCBHALI  EQU   @NM00120
UCBRSV09 EQU   @NM00120
UCBRSV08 EQU   @NM00120
UCBRSV07 EQU   @NM00120
UCBRSV06 EQU   @NM00120
UCBRSV05 EQU   @NM00120
UCBRSV04 EQU   @NM00120
UCBDTI   EQU   UCBCMEXT+2
UCBSTI   EQU   UCBCMEXT+1
UCBETI   EQU   UCBCMEXT
UCBEXTP  EQU   UCBEXTPT+1
UCBDDRSW EQU   UCBFLC
UCBTICBT EQU   UCBFLC
UCBIVRR  EQU   UCBFLC
UCBIVRS  EQU   UCBFLC
UCBITF   EQU   UCBFLC
UCBUDE   EQU   UCBFLC
UCBWAA   EQU   UCBFLC
UCBATTP  EQU   UCBFLC
UCBUNTYP EQU   UCBTBYT4
UCBRSV11 EQU   UCBDVCLS
UCBRSV10 EQU   UCBDVCLS
UCB3CHAR EQU   UCBDVCLS
UCB3UREC EQU   UCBDVCLS
UCB3DISP EQU   UCBDVCLS
UCB3DACC EQU   UCBDVCLS
UCB3COMM EQU   UCBDVCLS
UCB3TAPE EQU   UCBDVCLS
UCBDVPWR EQU   UCB2OPT7
UCBVLPWR EQU   UCB2OPT6
UCB2OPT5 EQU   UCBTBYT2
UCBRVDEV EQU   UCBRWTAU
UCBRPS   EQU   UCBDUDN2
UCBRR    EQU   UCBDUDN1
UCB2OPT1 EQU   UCBTBYT2
UCB2OPT0 EQU   UCBTBYT2
UCB1FEA7 EQU   UCBTBYT1
UCBD6250 EQU   UCB1FEA6
UCBD1600 EQU   UCB1FEA5
UCB1FEA4 EQU   UCBTBYT1
UCB1FEA3 EQU   UCBTBYT1
UCB1FEA2 EQU   UCBTBYT1
UCB1FEA1 EQU   UCBTBYT1
UCB1FEA0 EQU   UCBTBYT1
UCBRV029 EQU   UCBWGT
UCBVHRSN EQU   UCBWGT
UCBVORSN EQU   UCBWGT
UCBMTPXP EQU   UCBWGT
UCBREW   EQU   UCBWGT
UCBPUB   EQU   UCBWGT
UCBOUT   EQU   UCBWGT
UCBIN    EQU   UCBWGT
UCBCPU   EQU   UCBOB+11
UCBLCI   EQU   UCBOB+10
UCBCNT   EQU   UCBOB+9
UCBRV017 EQU   UCBCHM1
UCBRV016 EQU   UCBCHM1
UCBRV015 EQU   UCBCHM1
UCBRV014 EQU   UCBCHM1
UCBSPB   EQU   UCBPTH1
UCBPPB   EQU   UCBPTH1
UCBSPA   EQU   UCBPTH0
UCBPPA   EQU   UCBPTH0
UCBFLB7  EQU   UCBFLB
UCBVALPH EQU   UCBFLB
UCBCRHSN EQU   UCBFLB
UCBCRHRV EQU   UCBFLB
UCBRESVH EQU   UCBFLB
UCBSPST  EQU   UCBFLB
UCBASNS  EQU   UCBFLB
UCBIORST EQU   UCBFLB
UCBQISCE EQU   UCBFL1
UCBACTV  EQU   UCBFL1
UCBSAP   EQU   UCBFL1
UCBNOTRC EQU   UCBCUB
UCBPSNS  EQU   UCBFL1
UCBUSING EQU   UCBPST
UCBNOTRD EQU   UCBNRY
UCBBUSYD EQU   UCBBSY
UCBUA    EQU   UCBCHAN+1
UCBCHA   EQU   UCBCHAN
UCBDADI  EQU   UCBSTAT
UCBSYSR  EQU   UCBSTAT
UCBPRES  EQU   UCBSTAT
UCBALOC  EQU   UCBSTAT
UCBUNLD  EQU   UCBSTAT
UCBRESV  EQU   UCBSTAT
UCBCHGS  EQU   UCBSTAT
UCBONLI  EQU   UCBSTAT
UCBID    EQU   UCBOB+2
UCBALTPH EQU   UCBFL5
UCBALTCU EQU   UCBFL5
UCBNALOC EQU   UCBFL5
UCBENVRD EQU   UCBFL5
UCBVSDR  EQU   UCBFL5
UCBSASK  EQU   UCBFL5
UCBAMV   EQU   UCBAF
UCBDCC   EQU   UCBFL5
UCBMONT  EQU   UCBJBNR
UCBRV011 EQU   UCBJBNR
UCBRSV02 EQU   UCBJBNR
UCBOLDSM EQU   UCBJBNR
UCBRV003 EQU   UCBJBNR
UCBRV002 EQU   UCBJBNR
UCBJES3  EQU   UCBJBNR
UCBVRDEV EQU   UCBJBNR
UCBCMSEG EQU   UCBOB
UCBPFXND EQU   UCB+512
UCBIOQ   EQU   UCB+508
UCBLOCK  EQU   UCB+504
UCBPXST  EQU   UCB+504
@NM00117 EQU   UCB
VDSDSCB  EQU   VDSCB+80
VDSRBN   EQU   VDSCB+76
VDSNMTRK EQU   VDSCB+74
VDSABSTT EQU   VDSCB+72
VDSWINSI EQU   VDSCB+70
VDSTRKSI EQU   VDSCB+68
VDSWINDW EQU   VDSCB+64
VDSVBPPL EQU   VDSCB+60
VDSWICB  EQU   VDSCB+56
VDSDSPCT EQU   VDSCB+52
VDSSEEKA EQU   VDSCB+45
VDSUCB   EQU   VDSCB
JSCBCSCB EQU   JSCBSEC1+68
JSCBPMG  EQU   JSCBWTP+2
JSCBWTSP EQU   JSCBWTP+1
JSCRSV23 EQU   JSCBWTFG
JSCRSV22 EQU   JSCBWTFG
JSCRSV21 EQU   JSCBWTFG
JSCRSV20 EQU   JSCBWTFG
JSCRSV19 EQU   JSCBWTFG
JSCRSV18 EQU   JSCBWTFG
JSCBRET  EQU   JSCBWTFG
JSCBIOFG EQU   JSCBWTFG
@NM00112 EQU   JSCBSEC1+60
JSCBQMPI EQU   JSCBSEC1+56
JSCBPMSG EQU   JSCBSWT1
JSCRSV16 EQU   JSCBSWT1
JSCRSV15 EQU   JSCBSWT1
JSCRSV14 EQU   JSCBSWT1
JSCRSV13 EQU   JSCBSWT1
JSCRSV12 EQU   JSCBSWT1
JSCRSV11 EQU   JSCBSWT1
JSCBPASS EQU   JSCBSWT1
JSCBTTTR EQU   JSCBSEC1+52
JSCRSV10 EQU   JSCBSEC1+49
JSCBAUTH EQU   JSCBOPTS
JSCSIOTS EQU   JSCBOPTS
JSCRSV08 EQU   JSCBOPTS
JSCRSV07 EQU   JSCBOPTS
JSCRSV06 EQU   JSCBOPTS
JSCBLONG EQU   JSCBOPTS
JSCRSV05 EQU   JSCBOPTS
JSCRSV04 EQU   JSCBOPTS
JSCBSECB EQU   JSCBSEC1+44
JSCRSV03 EQU   JSCBSEC1+41
JSCBSTEP EQU   JSCBSEC1+40
JSCBDCBA EQU   JSCBDCB+1
JSCRSV02 EQU   JSCBDCB
JSCBID   EQU   JSCBSEC1+32
JSCBDBTB EQU   JSCBSEC1+28
JSCBIJSC EQU   JSCBSEC1+24
JSCBTCBP EQU   JSCBSEC1+20
JSCBPCC  EQU   JSCBSEC1+16
JSCBTCP  EQU   JSCBSEC1+12
JSCBSHR  EQU   JSCBSEC1+8
JSCHPCEA EQU   JSCHPCE+1
JSCRSV32 EQU   JSCHPCE
JSCRSV01 EQU   JSCBSEC1
@NM00111 EQU   IEZJSCB
@NM00110 EQU   TCBXTNT2+32
TCBRV181 EQU   TCBRV173
TCBRV180 EQU   TCBRV173
TCBRV179 EQU   TCBRV173
TCBRV178 EQU   TCBRV173
TCBRV177 EQU   TCBRV173
TCBRV176 EQU   TCBRV173
TCBRV175 EQU   TCBRV173
TCBRV174 EQU   TCBRV173
TCBRV172 EQU   TCBRV164
TCBRV171 EQU   TCBRV164
TCBRV170 EQU   TCBRV164
TCBRV169 EQU   TCBRV164
TCBRV168 EQU   TCBRV164
TCBRV167 EQU   TCBRV164
TCBRV166 EQU   TCBRV164
TCBRV165 EQU   TCBRV164
TCBRV163 EQU   TCBRV155
TCBRV162 EQU   TCBRV155
TCBRV161 EQU   TCBRV155
TCBRV160 EQU   TCBRV155
TCBRV159 EQU   TCBRV155
TCBRV158 EQU   TCBRV155
TCBRV157 EQU   TCBRV155
TCBRV156 EQU   TCBRV155
TCBRV154 EQU   TCBRV146
TCBRV153 EQU   TCBRV146
TCBRV152 EQU   TCBRV146
TCBRV151 EQU   TCBRV146
TCBRV150 EQU   TCBRV146
TCBRV149 EQU   TCBRV146
TCBRV148 EQU   TCBRV146
TCBRV147 EQU   TCBRV146
TCBRV145 EQU   TCBXTNT2+26
TCBRV144 EQU   TCBXTNT2+24
TCBRV143 EQU   TCBXTNT2+20
TCBRV142 EQU   TCBXTNT2+16
TCBRSV49 EQU   TCBXTNT2+12
TCBRSV48 EQU   TCBXTNT2+8
TCBRCMP  EQU   TCBXTNT2+5
TCBRSVAB EQU   TCBXTNT2+4
TCBGTFA  EQU   TCBGTF+1
TCBRSV47 EQU   TCBTFLG
TCBRSV46 EQU   TCBTFLG
TCBRSV45 EQU   TCBTFLG
TCBRSV44 EQU   TCBTFLG
TCBRSV43 EQU   TCBTFLG
TCBDSPIT EQU   TCBTFLG
TCBERRTN EQU   TCBTFLG
TCBASYNC EQU   TCBTFLG
@NM00109 EQU   TCB+296
TCBSCBQ  EQU   TCB+292
TCBSWASA EQU   TCB+288
TCBDBTB  EQU   TCB+284
TCBRPT   EQU   TCB+280
TCBRV141 EQU   TCBRV133
TCBRV140 EQU   TCBRV133
TCBRV139 EQU   TCBRV133
TCBRV138 EQU   TCBRV133
TCBRV137 EQU   TCBRV133
TCBRV136 EQU   TCBRV133
TCBRV135 EQU   TCBRV133
TCBRV134 EQU   TCBRV133
TCBRV132 EQU   TCBRV124
TCBRV131 EQU   TCBRV124
TCBRV130 EQU   TCBRV124
TCBRV129 EQU   TCBRV124
TCBRV128 EQU   TCBRV124
TCBRV127 EQU   TCBRV124
TCBRV126 EQU   TCBRV124
TCBRV125 EQU   TCBRV124
TCBRV123 EQU   TCBFBYT2
TCBRV122 EQU   TCBFBYT2
TCBECBNV EQU   TCBFBYT2
TCBSSSYN EQU   TCBFBYT2
TCBFPRAP EQU   TCBFBYT2
TCBFDW   EQU   TCBFBYT2
TCBFMW   EQU   TCBFBYT2
TCBCNCB  EQU   TCBFBYT2
TCBLLH   EQU   TCBFBYT1
TCBRV113 EQU   TCBFBYT1
TCBEOT   EQU   TCBFBYT1
TCBRTM2  EQU   TCBFBYT1
TCBPGNLY EQU   TCBFBYT1
TCBNDIOS EQU   TCBFBYT1
TCBACTIV EQU   TCBFBYT1
TCBEOTFM EQU   TCBFBYT1
TCBAFFN  EQU   TCB+274
TCBCCPVI EQU   TCB+272
TCBUKYSP EQU   TCB+268
TCBMODE  EQU   TCBESTAE+3
TCBERTYP EQU   TCBESTAE+2
TCBRV314 EQU   TCBESTRM
TCBRV313 EQU   TCBESTRM
TCBRV312 EQU   TCBESTRM
TCBRV311 EQU   TCBESTRM
TCBRV310 EQU   TCBESTRM
TCBRV309 EQU   TCBESTRM
TCBRV308 EQU   TCBESTRM
TCBETERM EQU   TCBESTRM
TCBSCBKY EQU   TCBESTAE
TCBRTM12 EQU   TCB+260
TCBTCBID EQU   TCB+256
TCBRSV96 EQU   TCB+252
TCBSWA   EQU   TCB+248
TCBFOEA  EQU   TCBFOE+1
TCBRSV42 EQU   TCBFOE
TCBRV306 EQU   TCB+240
TCBRSV41 EQU   TCB+239
TCBTID   EQU   TCB+238
TCBRSVAA EQU   TCB+237
TCBABCUR EQU   TCB+236
TCBTMSAV EQU   TCB+232
TCBIOTIM EQU   TCB+228
TCBRTWA  EQU   TCB+224
TCBBACK  EQU   TCB+220
TCBTIRB  EQU   TCB+216
TCBAECB  EQU   TCB+212
TCBEXT2A EQU   TCBEXT2+1
TCBRSV39 EQU   TCBEXT2
TCBSTMCT EQU   TCB+207
TCBSYSCT EQU   TCB+206
TCBRSV37 EQU   TCB+205
TCBEXSVC EQU   TCBDAR
TCBRSV36 EQU   TCBDAR
TCBDARWT EQU   TCBDAR
TCBDARO  EQU   TCBDAR
TCBDARMC EQU   TCBDARC
TCBDARD  EQU   TCBDAR
TCBDARS  EQU   TCBDAR
TCBDARP  EQU   TCBDAR
TCBGTOFM EQU   TCBFLGS7
TCBADMP  EQU   TCBFLGS7
TCBRSTSK EQU   TCBFLGS7
TCBRSV35 EQU   TCBFLGS7
TCBSTACK EQU   TCBFLGS7
TCBRSV34 EQU   TCBFLGS7
TCBRSV33 EQU   TCBFLGS7
TCBGPECB EQU   TCBFLGS7
TCBNTJS  EQU   TCBFLGS6
TCBAPG   EQU   TCBFLGS6
TCBMIGR  EQU   TCBFLGS6
TCBRV303 EQU   TCBFLGS6
TCBSPVLK EQU   TCBFLGS6
TCBCPU   EQU   TCBFLGS6
TCBPIE17 EQU   TCBFLGS6
TCBRV    EQU   TCBFLGS6
TCBRSV79 EQU   TCBNDSP5
TCBRSV78 EQU   TCBNDSP5
TCBRSV77 EQU   TCBNDSP5
TCBRSV76 EQU   TCBNDSP5
TCBRSV75 EQU   TCBNDSP5
TCBRSV74 EQU   TCBNDSP5
TCBRSV95 EQU   TCBNDSP5
TCBRSV94 EQU   TCBNDSP5
TCBRSV93 EQU   TCBNDSP4
TCBRSV92 EQU   TCBNDSP4
TCBRSV91 EQU   TCBNDSP4
TCBRSV90 EQU   TCBNDSP4
TCBRSV89 EQU   TCBNDSP4
TCBRSV88 EQU   TCBNDSP4
TCBRSV87 EQU   TCBNDSP4
TCBRSV86 EQU   TCBNDSP4
TCBEXT1A EQU   TCBEXT1+1
TCBRSV32 EQU   TCBEXT1
TCBEXCPD EQU   TCB+192
TCBIOBRC EQU   TCB+188
TCBDDWTC EQU   TCB+186
TCBDDEXC EQU   TCB+184
TCBJSCBB EQU   TCBJSCB+1
@NM00108 EQU   TCBRECDE
TCBREC   EQU   TCBRECDE
TCBMDIDS EQU   TCB+176
TCBNDINT EQU   TCBNDSP3
TCBRSV27 EQU   TCBNDSP3
TCBRSV26 EQU   TCBNDSP3
TCBRSV25 EQU   TCBNDSP3
TCBRSV24 EQU   TCBNDSP3
TCBSRBND EQU   TCBNDSP3
TCBRV302 EQU   TCBNDSP3
TCBLJSND EQU   TCBNDSP3
TCBABE   EQU   TCBNDSP2
TCBDSS   EQU   TCBNDSP2
TCBOWAIT EQU   TCBNDSP2
TCBIWAIT EQU   TCBNDSP2
TCBNDTS  EQU   TCBNDSP2
TCBNDSVC EQU   TCBNDSP2
TCBSTPP  EQU   TCBNDSP2
TCBABD   EQU   TCBNDSP2
TCBRSV22 EQU   TCBNDSP1
TCBPIEND EQU   TCBNDSP1
TCBTPSP  EQU   TCBNDSP1
TCBDDRND EQU   TCBNDSP1
TCBRSPND EQU   TCBNDSP1
TCBRSTND EQU   TCBNDSP1
TCBDARPN EQU   TCBNDSP1
TCBDARTN EQU   TCBNDSP1
TCBNDSP0 EQU   TCBNDSP
TCBUSER  EQU   TCB+168
TCBTCTB  EQU   TCBTCT+1
TCBRSV9C EQU   TCBTCTGF
TCBRSV9B EQU   TCBTCTGF
TCBRSV9A EQU   TCBTCTGF
TCBRSV99 EQU   TCBTCTGF
TCBRSV98 EQU   TCBTCTGF
TCBRSV97 EQU   TCBTCTGF
TCBRSV20 EQU   TCBTCTGF
TCBSMFGF EQU   TCBTCTGF
TCBSTABB EQU   TCBSTAB+1
TCBSTCUR EQU   TCBNSTAE
TCBRV301 EQU   TCBNSTAE
TCBSYNCH EQU   TCBNSTAE
TCBHALT  EQU   TCBNSTAE
TCBPPSUP EQU   TCBNSTAE
TCB33E   EQU   TCBNSTAE
TCBQUIES EQU   TCBNSTAE
TCBSTABE EQU   TCBNSTAE
TCBAQE   EQU   TCB+156
TCBPQE   EQU   TCB+152
TCBTSDP  EQU   TCB+151
TCBTSLP  EQU   TCB+150
TCBSTPCT EQU   TCB+149
TCBCPUBN EQU   TCBTSFLG
TCBDYDSP EQU   TCBTSFLG
TCBRSV18 EQU   TCBTSFLG
TCBRSV17 EQU   TCBTSFLG
TCBTIOTG EQU   TCBTSFLG
TCBATT   EQU   TCBTSFLG
TCBSTPPR EQU   TCBTSFLG
TCBRV300 EQU   TCBTSTSK
TCBECB   EQU   TCB+144
TCBIQE   EQU   TCB+140
TCBLTC   EQU   TCB+136
TCBOTC   EQU   TCB+132
TCBNTC   EQU   TCB+128
TCBJSTCA EQU   TCBJSTCB+1
TCBRSV16 EQU   TCBJSTCB
TCBTQET  EQU   TCBTME
TCBTCB   EQU   TCB+116
TCBFSAB  EQU   TCBFSA+1
TCBQEL   EQU   TCBFSA
TCBGRS15 EQU   TCBGRS+60
TCBGRS14 EQU   TCBGRS+56
TCBGRS13 EQU   TCBGRS+52
TCBGRS12 EQU   TCBGRS+48
TCBGRS11 EQU   TCBGRS+44
TCBGRS10 EQU   TCBGRS+40
TCBGRS9  EQU   TCBGRS+36
TCBGRS8  EQU   TCBGRS+32
TCBGRS7  EQU   TCBGRS+28
TCBGRS6  EQU   TCBGRS+24
TCBGRS5  EQU   TCBGRS+20
TCBGRS4  EQU   TCBGRS+16
TCBGRS3  EQU   TCBGRS+12
TCBGRS2  EQU   TCBGRS+8
TCBGRS1  EQU   TCBGRS+4
TCBGRS0  EQU   TCBGRS
TCBJPQB  EQU   TCBJPQ+1
TCBRSV15 EQU   TCBPURGE
TCBRSV14 EQU   TCBPURGE
TCBRSV13 EQU   TCBPURGE
TCBRSV12 EQU   TCBPURGE
TCBRSV11 EQU   TCBPURGE
TCBRSV10 EQU   TCBPURGE
TCBRSV09 EQU   TCBPURGE
TCBJPQF  EQU   TCBPURGE
TCBJLB   EQU   TCB+40
TCBLLS   EQU   TCB+36
TCBDSP   EQU   TCB+35
TCBLMP   EQU   TCB+34
TCBPNDSP EQU   TCBFLGS5
TCBFCD1  EQU   TCBFLGS5
TCBSTP   EQU   TCBFLGS5
TCBSYS   EQU   TCBFLGS5
TCBANDSP EQU   TCBFLGS5
TCBPAGE  EQU   TCBFLGS5
TCBUXNDF EQU   TCBABWF
TCBFC    EQU   TCBFLGS5
TCBONDSP EQU   TCBFLGS4
TCBMPCND EQU   TCBFLGS4
TCBMPCVQ EQU   TCBFLGS4
TCBUXNDV EQU   TCBFLGS4
TCBHNDSP EQU   TCBFLGS4
TCBRQENA EQU   TCBFLGS4
TCBSER   EQU   TCBFLGS4
TCBNDUMP EQU   TCBFLGS4
TCBDWSTA EQU   TCBFLGS3
TCBRSV08 EQU   TCBFLGS3
TCBRSV07 EQU   TCBFLGS3
TCBRSV06 EQU   TCBFLGS3
TCBABGM  EQU   TCBFLGS3
TCBABTRM EQU   TCBFLGS3
TCBADINP EQU   TCBFLGS3
TCBFSM   EQU   TCBFLGS3
TCBFTS   EQU   TCBFLGS2
TCBFETXR EQU   TCBFLGS2
TCBFDSOP EQU   TCBFLGS2
TCBFJMC  EQU   TCBFLGS2
TCBFSMC  EQU   TCBFLGS2
TCBFABOP EQU   TCBFLGS2
TCBFSTI  EQU   TCBFLGS2
TCBFOINP EQU   TCBFLGS2
TCBFX    EQU   TCBFLGS1
TCBFS    EQU   TCBFLGS1
TCBFT    EQU   TCBFLGS1
TCBPDUMP EQU   TCBFLGS1
TCBRSV04 EQU   TCBFLGS1
TCBFERA  EQU   TCBFLGS1
TCBFE    EQU   TCBFLGS1
TCBFA    EQU   TCBFLGS1
TCBZERO  EQU   TCBPKF
TCBFLAG  EQU   TCBPKF
TCBMSSB  EQU   TCBMSS+1
TCBRSV03 EQU   TCBMSS
TCBTRNB  EQU   TCBTRN+1
TCBRSV02 EQU   TCBABF
TCBOLTEP EQU   TCBABF
TCBTCP   EQU   TCBABF
TCBTCPP  EQU   TCBABF
TCBRSV01 EQU   TCBABF
TCBGRPH  EQU   TCBABF
TCBNOCHK EQU   TCBABF
TCBMOD91 EQU   TCBABF
TCBCMPC  EQU   TCBCMP+1
TCBRV318 EQU   TCBCMSG
TCBRV317 EQU   TCBCIND
TCBRV316 EQU   TCBCWTO
TCBCASID EQU   TCBCDBL
TCBNOCC  EQU   TCBSTCC
TCBDMPO  EQU   TCBCPP
TCBCSTEP EQU   TCBCMPF
TCBCREQ  EQU   TCBCMPF
TCBDEB   EQU   TCB+8
TCBPIEA  EQU   TCBPIE+1
TCBPM    EQU   TCBPMASK
@NM00107 EQU   TCBPMASK
TCBRBP   EQU   TCB
TCBFRS6  EQU   TCBFRS+24
TCBFRS4  EQU   TCBFRS+16
TCBFRS2  EQU   TCBFRS+8
TCBFRS0  EQU   TCBFRS
CVTLEVL  EQU   CVTRELNO+2
CVTNUMB  EQU   CVTRELNO
CVTMDL   EQU   CVTFIX+250
@NM00106 EQU   CVTFIX+248
@NM00105 EQU   CVTFIX
CVTRV482 EQU   CVTXTNT2+128
CVTRV481 EQU   CVTXTNT2+124
CVTRV480 EQU   CVTXTNT2+120
CVTRV479 EQU   CVTXTNT2+118
CVTRV478 EQU   CVTXTNT2+117
CVTRV477 EQU   CVTXTNT2+116
CVTRV476 EQU   CVTXTNT2+115
CVTRV475 EQU   CVTXTNT2+114
CVTRV474 EQU   CVTRV466
CVTRV473 EQU   CVTRV466
CVTRV472 EQU   CVTRV466
CVTRV471 EQU   CVTRV466
CVTRV470 EQU   CVTRV466
CVTRV469 EQU   CVTRV466
CVTRV468 EQU   CVTRV466
CVTRV467 EQU   CVTRV466
CVTRV465 EQU   CVTRV457
CVTRV464 EQU   CVTRV457
CVTRV463 EQU   CVTRV457
CVTRV462 EQU   CVTRV457
CVTRV461 EQU   CVTRV457
CVTRV460 EQU   CVTRV457
CVTRV459 EQU   CVTRV457
CVTRV458 EQU   CVTRV457
CVTRV456 EQU   CVTXTNT2+108
CVTRV455 EQU   CVTXTNT2+104
CVTRV454 EQU   CVTXTNT2+100
CVTRV453 EQU   CVTXTNT2+96
CVTRV452 EQU   CVTXTNT2+94
CVTRV451 EQU   CVTXTNT2+92
CVTRV450 EQU   CVTXTNT2+90
CVTRV449 EQU   CVTXTNT2+88
CVTRV448 EQU   CVTXTNT2+87
CVTRV447 EQU   CVTXTNT2+86
CVTRV446 EQU   CVTRV438
CVTRV445 EQU   CVTRV438
CVTRV444 EQU   CVTRV438
CVTRV443 EQU   CVTRV438
CVTRV442 EQU   CVTRV438
CVTRV441 EQU   CVTRV438
CVTRV440 EQU   CVTRV438
CVTRV439 EQU   CVTRV438
CVTRV437 EQU   CVTRV429
CVTRV436 EQU   CVTRV429
CVTRV435 EQU   CVTRV429
CVTRV434 EQU   CVTRV429
CVTRV433 EQU   CVTRV429
CVTRV432 EQU   CVTRV429
CVTRV431 EQU   CVTRV429
CVTRV430 EQU   CVTRV429
CVTRV428 EQU   CVTXTNT2+80
CVTRV427 EQU   CVTXTNT2+76
CVTRV426 EQU   CVTXTNT2+72
CVTRV425 EQU   CVTXTNT2+68
CVTATACT EQU   CVTATCVT
CVTRV423 EQU   CVTXTNT2+62
CVTRV422 EQU   CVTXTNT2+60
CVTRV421 EQU   CVTXTNT2+58
CVTRV420 EQU   CVTXTNT2+56
CVTRV419 EQU   CVTXTNT2+55
CVTRV418 EQU   CVTXTNT2+54
CVTRV417 EQU   CVTRV409
CVTRV416 EQU   CVTRV409
CVTRV415 EQU   CVTRV409
CVTRV414 EQU   CVTRV409
CVTRV413 EQU   CVTRV409
CVTRV412 EQU   CVTRV409
CVTRV411 EQU   CVTRV409
CVTRV410 EQU   CVTRV409
CVTRV408 EQU   CVTRV400
CVTRV407 EQU   CVTRV400
CVTRV406 EQU   CVTRV400
CVTRV405 EQU   CVTRV400
CVTRV404 EQU   CVTRV400
CVTRV403 EQU   CVTRV400
CVTRV402 EQU   CVTRV400
CVTRV401 EQU   CVTRV400
CVTICB   EQU   CVTXTNT2+48
CVTSKTA  EQU   CVTXTNT2+44
CVTRSV99 EQU   CVTXTNT2+40
CVTRSV98 EQU   CVTXTNT2+36
CVTRSV97 EQU   CVTXTNT2+34
CVTRSV96 EQU   CVTXTNT2+32
CVTOLTEP EQU   CVTXTNT2+28
CVTQIDA  EQU   CVTQID+1
CVTRSV95 EQU   CVTQID
CVTRSV94 EQU   CVTXTNT2+20
CVTRSV93 EQU   CVTXTNT2+16
CVTRSV92 EQU   CVTXTNT2+12
CVTDEBVR EQU   CVTXTNT2+8
CVTRSV91 EQU   CVTXTNT2+6
CVTRSV9H EQU   CVTFLGBT
CVTRSV9G EQU   CVTFLGBT
CVTRSV9F EQU   CVTFLGBT
CVTRSV9E EQU   CVTFLGBT
CVTRSV9D EQU   CVTFLGBT
CVTRSV9C EQU   CVTFLGBT
CVTVME   EQU   CVTFLGBT
CVTNPE   EQU   CVTFLGBT
CVTNUCLS EQU   CVTXTNT2+4
CVTDSSVA EQU   CVTDSSV+1
CVTRSV89 EQU   CVTDSSV
CVTRSV88 EQU   CVTXTNT1+8
CVTRSV87 EQU   CVTXTNT1+4
CVTFACHN EQU   CVTXTNT1
CVTRV488 EQU   CVTMAP+412
CVTRV487 EQU   CVTMAP+408
CVTRV486 EQU   CVTMAP+404
CVTRV485 EQU   CVTMAP+400
CVTACTAP EQU   CVTMAP+396
CVTAUTH  EQU   CVTMAP+392
CVTATMCA EQU   CVTATMCT+1
CVTATMST EQU   CVTATMCT
CVTRSV61 EQU   CVTMAP+384
CVTVOLT1 EQU   CVTVOLM1+1
CVTVOLI1 EQU   CVTVOLF1
CVTSTOA  EQU   CVTMAP+376
CVTRSV58 EQU   CVTMAP+374
CVTRSV57 EQU   CVTMAP+372
CVTDDCE  EQU   CVTMAP+368
CVTPNWFR EQU   CVTMAP+364
CVTSMF   EQU   CVTMAP+360
CVTSULK  EQU   CVTMAP+358
CVTSLKO  EQU   CVTSYSK
CVTSLKP  EQU   CVTSYSK
CVTSLKQ  EQU   CVTSYSK
CVTSLKR  EQU   CVTSYSK
CVTRSV56 EQU   CVTSYSK
CVTRSV55 EQU   CVTSYSK
CVTRSV54 EQU   CVTSYSK
CVTRSV53 EQU   CVTSYSK
CVTRSV52 EQU   CVTA1F1
CVTRSV51 EQU   CVTA1F1
CVTRSV50 EQU   CVTA1F1
CVTRSV49 EQU   CVTA1F1
CVTRSV48 EQU   CVTA1F1
CVTRSV47 EQU   CVTA1F1
CVTSRSW  EQU   CVTA1F1
CVTPFSW  EQU   CVTA1F1
CVTPCVT  EQU   CVTMAP+352
CVTRSV46 EQU   CVTMAP+344
CVTRSV45 EQU   CVTMAP+340
CVTRSV44 EQU   CVTMAP+338
CVTRSV43 EQU   CVTMAP+336
CVTHJESA EQU   CVTHJES+1
CVTRSV42 EQU   CVTHJES
CVTEXT2A EQU   CVTEXT2+1
CVTRSV41 EQU   CVTEXT2
CVTAPFA  EQU   CVTAPF+1
CVTRSV40 EQU   CVTAPF
CVTRV518 EQU   CVTINTLA
CVTRV517 EQU   CVTERPV
CVTEORM  EQU   CVTMAP+312
CVTMCHPR EQU   CVTMAP+308
CVTTZ    EQU   CVTMAP+304
CVTJEPS  EQU   CVTMAP+300
CVTJESCT EQU   CVTMAP+296
CVTMODE  EQU   CVTMAP+292
CVTPTRV  EQU   CVTMAP+288
CVTREAL  EQU   CVTMAP+284
CVTRSV39 EQU   CVTMAP+280
CVTRSV38 EQU   CVTMAP+276
CVTDMSRA EQU   CVTDMSR+1
CVTRSV37 EQU   CVTDMSR
CVTQMSGA EQU   CVTQMSG+1
CVTRSV36 EQU   CVTQMSG
CVTAMFF  EQU   CVTMAP+264
CVTPURGA EQU   CVTPURG+1
CVTRSV35 EQU   CVTPURG
CVTCBSP  EQU   CVTMAP+256
CVTATERA EQU   CVTATER+1
CVTSYST  EQU   CVTATER
CVTVOLT2 EQU   CVTTAT
CVTVOLI2 EQU   CVTVOLF2
CVTAQAVB EQU   CVTAQAVT+1
CVTRSV34 EQU   CVTTCMFG
CVTRSV33 EQU   CVTTCMFG
CVTRSV32 EQU   CVTTCMFG
CVTRSV31 EQU   CVTTCMFG
CVTRSV30 EQU   CVTTCMFG
CVTRSV29 EQU   CVTTCMFG
CVTRSV28 EQU   CVTTCMFG
CVTTCRDY EQU   CVTTCMFG
CVTGTFA  EQU   CVTGTF+1
CVTRSV27 EQU   CVTGTFST
CVTRNIO  EQU   CVTGTFST
CVTUSR   EQU   CVTGTFST
CVTRV318 EQU   CVTFORM
CVTRV317 EQU   CVTTMODE
CVTRV316 EQU   CVTSTATE
CVTRV315 EQU   CVTGTFS
CVTGTFAV EQU   CVTGTFS
CVT0SCR1 EQU   CVTMAP+232
CVTRV515 EQU   CVTMAP+228
CVTRMS   EQU   CVTMAP+224
CVTPATCH EQU   CVTMAP+220
CVTTSCE  EQU   CVTMAP+216
CVTLNKSC EQU   CVTMAP+214
CVTQABST EQU   CVTMAP+212
CVTMDLDS EQU   CVTMAP+208
CVTUSER  EQU   CVTMAP+204
CVTABEND EQU   CVTMAP+200
CVTSMCA  EQU   CVTMAP+196
CVTRSV18 EQU   CVTMAP+192
CVTQLPAQ EQU   CVTMAP+188
CVTQCDSR EQU   CVTMAP+184
CVTRSV17 EQU   CVTOPTB
CVTRSV16 EQU   CVTOPTB
CVTFP    EQU   CVTOPTB
CVTAPTHR EQU   CVTOPTB
CVTNLOG  EQU   CVTOPTB
CVTTOD   EQU   CVTOPTB
CVTCTIMS EQU   CVTOPTB
CVTPROT  EQU   CVTOPTB
CVTXPFP  EQU   CVTOPTA
CVTASCII EQU   CVTOPTA
CVTRSV13 EQU   CVTOPTA
CVTRSV12 EQU   CVTOPTA
CVTNIP   EQU   CVTOPTA
CVTDDR   EQU   CVTOPTA
CVTAPR   EQU   CVTOPTA
CVTCCH   EQU   CVTOPTA
CVTSNCTR EQU   CVTMAP+180
CVTQMWR  EQU   CVTMAP+176
CVTQOCR  EQU   CVTMAP+172
CVT1EF00 EQU   CVTMAP+168
CVTMZ00  EQU   CVTMAP+164
CVTHEAD  EQU   CVTMAP+160
CVTRSV11 EQU   CVTMAP+156
CVT0PT01 EQU   CVTMAP+152
CVTMSER  EQU   CVTMAP+148
CVTRV516 EQU   CVTIERLC
CVTILCH  EQU   CVTMAP+140
CVT0DS   EQU   CVTMAP+136
CVTFBOSV EQU   CVTMAP+132
CVTNUCB  EQU   CVTMAP+128
CVTIXAVL EQU   CVTMAP+124
CVTIOQET EQU   CVTMAP+120
CVTDCBA  EQU   CVTMAP+117
CVTMVS2  EQU   CVTDCB
CVT6DAT  EQU   CVTDCB
CVT4MPS  EQU   CVTDCB
CVTRSV09 EQU   CVTDCB
CVT4MS1  EQU   CVTDCB
CVT2SPS  EQU   CVTDCB
CVT1SSS  EQU   CVTDCB
CVTRSV08 EQU   CVTDCB
CVTSTB   EQU   CVTMAP+112
CVTQTD00 EQU   CVTMAP+108
CVTQTE00 EQU   CVTMAP+104
CVTCUCB  EQU   CVTMAP+100
CVTSJQ   EQU   CVTMAP+96
CVTPBLDL EQU   CVTMAP+92
CVTTPC   EQU   CVTMAP+88
CVTSVDCB EQU   CVTMAP+84
CVTBRET  EQU   CVTMAP+82
CVTEXIT  EQU   CVTMAP+80
CVT0FN00 EQU   CVTMAP+76
CVTDARA  EQU   CVTDAR+1
CVTRSV07 EQU   CVTFLGS1
CVTRSV06 EQU   CVTFLGS1
CVTRSV05 EQU   CVTFLGS1
CVTRSV04 EQU   CVTFLGS1
CVTRSV03 EQU   CVTFLGS1
CVTRSV02 EQU   CVTFLGS1
CVTRSV01 EQU   CVTFLGS1
CVTDMPLK EQU   CVTFLGS1
CVTXITP  EQU   CVTMAP+68
CVTZDTAB EQU   CVTMAP+64
CVTMSLT  EQU   CVTMAP+60
CVTDATE  EQU   CVTMAP+56
CVTBTERM EQU   CVTMAP+52
CVTSYSAD EQU   CVTMAP+48
CVTXTLER EQU   CVTMAP+44
CVTILK2  EQU   CVTMAP+40
CVTILK1  EQU   CVTMAP+36
CVTPRLTV EQU   CVTMAP+32
CVTPCNVT EQU   CVTMAP+28
CVT0VL00 EQU   CVTMAP+24
CVTXAPG  EQU   CVTMAP+20
CVTBUF   EQU   CVTMAP+16
CVTJOB   EQU   CVTMAP+12
CVTLINK  EQU   CVTMAP+8
CVT0EF00 EQU   CVTMAP+4
@NM00104 EQU   SDWA+512
@NM00103 EQU   SDWADPVA
SDWAEBC  EQU   SDWADPVA
@NM00102 EQU   SDWA+396
SDWACOMP EQU   SDWA+392
SDWARCPL EQU   SDWA+364
@NM00101 EQU   SDWADPSA+32
SDWATO4  EQU   SDWADPSL+28
SDWAFRM4 EQU   SDWADPSL+24
SDWATO3  EQU   SDWADPSL+20
SDWAFRM3 EQU   SDWADPSL+16
SDWATO2  EQU   SDWADPSL+12
SDWAFRM2 EQU   SDWADPSL+8
SDWATO1  EQU   SDWADPSL+4
SDWAFRM1 EQU   SDWADPSL
@NM00100 EQU   SDWADDAT+3
@NM00099 EQU   SDWAPDAT
SDWAUSPL EQU   SDWAPDAT
SDWADPSW EQU   SDWAPDAT
SDWATJPA EQU   SDWAPDAT
SDWATLPA EQU   SDWAPDAT
SDWADREG EQU   SDWAPDAT
SDWADSAH EQU   SDWAPDAT
SDWADSAS EQU   SDWAPDAT
@NM00098 EQU   SDWADDAT+1
@NM00097 EQU   SDWASDAT
SDWAQQS  EQU   SDWASDAT
SDWACBS  EQU   SDWASDAT
SDWAGTF  EQU   SDWASDAT
SDWASWA  EQU   SDWASDAT
SDWALSQA EQU   SDWASDAT
SDWASQA  EQU   SDWASDAT
SDWANUC  EQU   SDWASDAT
@NM00096 EQU   SDWADUMP+2
@NM00095 EQU   SDWADPFS
SDWASLST EQU   SDWADPFS
@NM00094 EQU   SDWADPFS
SDWADLST EQU   SDWADPFS
SDWADPT  EQU   SDWADPFS
SDWADPID EQU   SDWADUMP
SDWADPLA EQU   SDWA+316
SDWAREXN EQU   SDWARECP+16
SDWACSCT EQU   SDWARECP+8
SDWAMODN EQU   SDWARECP
@NM00093 EQU   SDWALKWA+32
SDWATALW EQU   SDWALKWS+28
SDWATDLW EQU   SDWALKWS+24
SDWATNLW EQU   SDWALKWS+20
SDWAAPLW EQU   SDWALKWS+16
SDWAIPLW EQU   SDWALKWS+12
SDWAILLW EQU   SDWALKWS+8
SDWAIULW EQU   SDWALKWS+4
SDWAICLW EQU   SDWALKWS
SDWAFLLK EQU   SDWAACF4
SDWACMS  EQU   SDWAACF4
SDWAOPTM EQU   SDWAACF4
SDWATADB EQU   SDWAACF4
SDWATDNB EQU   SDWAACF4
SDWATNCB EQU   SDWAACF4
SDWAILCH EQU   SDWAACF4
SDWAIUCB EQU   SDWAACF4
SDWAICAT EQU   SDWAACF3
SDWAIPRG EQU   SDWAACF3
SDWASALL EQU   SDWAACF3
SDWAASMP EQU   SDWAACF3
SDWADISP EQU   SDWAACF3
@NM00092 EQU   SDWAACF3
@NM00091 EQU   SDWAACF2
SDWAFREE EQU   SDWAACF2
SDWAUPRG EQU   SDWAACF2
@NM00090 EQU   SDWAACF2
SDWASPIN EQU   SDWAACF2
@NM00089 EQU   SDWAACF2
SDWALCPU EQU   SDWACPUA+2
@NM00088 EQU   SDWACPUA
SDWARECA EQU   SDWA+244
SDWARTYA EQU   SDWA+240
@NM00087 EQU   SDWA+239
@NM00086 EQU   SDWAIOFS
SDWANIOP EQU   SDWAIOFS
SDWANOIO EQU   SDWAIOFS
SDWAIOHT EQU   SDWAIOFS
SDWAIOQR EQU   SDWAIOFS
SDWAFMID EQU   SDWA+236
@NM00085 EQU   SDWAERRD
SDWAMCIV EQU   SDWAERRD
SDWARPIV EQU   SDWAERRD
SDWAMABD EQU   SDWAERRD
SDWACTS  EQU   SDWAERRD
SDWASTAE EQU   SDWAERRD
SDWANRBE EQU   SDWAERRD
@NM00084 EQU   SDWAERRC
SDWAEAS  EQU   SDWAERRC
SDWAIRB  EQU   SDWAERRC
SDWASTAI EQU   SDWAERRC
SDWASTAF EQU   SDWAERRC
SDWASRBM EQU   SDWAERRB
SDWALDIS EQU   SDWAERRB
SDWAENRB EQU   SDWAERRB
SDWATYP1 EQU   SDWAERRB
@NM00083 EQU   SDWAERRB
SDWAPGIO EQU   SDWAERRA
SDWATEXC EQU   SDWAERRA
SDWASVCE EQU   SDWAERRA
SDWAABTM EQU   SDWAERRA
SDWASVCD EQU   SDWAERRA
SDWATIME EQU   SDWAMCH+20
SDWARFSA EQU   SDWAMCH+16
@NM00082 EQU   SDWAMCH+14
SDWAVEQR EQU   SDWARSR2
SDWAPGFX EQU   SDWARSR2
SDWAFLSQ EQU   SDWARSR2
SDWAFSQA EQU   SDWARSR2
SDWANUCL EQU   SDWARSR2
SDWASPER EQU   SDWARSR2
SDWAINTC EQU   SDWARSR2
SDWAOFLN EQU   SDWARSR2
SDWACHNG EQU   SDWARSR1
SDWAMSER EQU   SDWARSR1
@NM00081 EQU   SDWARSR1
SDWACPID EQU   SDWAMCH+10
SDWATERR EQU   SDWAMCHD
SDWAFPRX EQU   SDWAMCHD
SDWAINSF EQU   SDWAMCHD
SDWAACR  EQU   SDWAMCHD
SDWASCK  EQU   SDWAMCHD
SDWAPSWU EQU   SDWAMCHD
SDWAREGU EQU   SDWAMCHD
SDWASKYF EQU   SDWAMCHD
@NM00080 EQU   SDWAMCHS
SDWARSRF EQU   SDWAMCHS
SDWARSRC EQU   SDWAMCHS
SDWAINVP EQU   SDWAMCHS
SDWATSVL EQU   SDWAMCHS
SDWARCDF EQU   SDWAMCHS
SDWASRVL EQU   SDWAMCHS
SDWASCKE EQU   SDWASTCK+4
SDWASCKB EQU   SDWASTCK
SDWALNTH EQU   SDWAIDNT+1
SDWASPID EQU   SDWAIDNT
SDWASR15 EQU   SDWASRSV+60
SDWASR14 EQU   SDWASRSV+56
SDWASR13 EQU   SDWASRSV+52
SDWASR12 EQU   SDWASRSV+48
SDWASR11 EQU   SDWASRSV+44
SDWASR10 EQU   SDWASRSV+40
SDWASR09 EQU   SDWASRSV+36
SDWASR08 EQU   SDWASRSV+32
SDWASR07 EQU   SDWASRSV+28
SDWASR06 EQU   SDWASRSV+24
SDWASR05 EQU   SDWASRSV+20
SDWASR04 EQU   SDWASRSV+16
SDWASR03 EQU   SDWASRSV+12
SDWASR02 EQU   SDWASRSV+8
SDWASR01 EQU   SDWASRSV+4
SDWASR00 EQU   SDWASRSV
SDWATRN2 EQU   SDWAAEC2+4
SDWAIPC2 EQU   SDWAICD2
SDWAIMC2 EQU   SDWAICD2
SDWAIPR2 EQU   SDWAICD2
@NM00079 EQU   SDWAINC2
@NM00078 EQU   SDWAILC2
SDWAIL2  EQU   SDWAILC2
@NM00077 EQU   SDWAILC2
@NM00076 EQU   SDWAAEC2
SDWAADD2 EQU   SDWANXT2+1
@NM00075 EQU   SDWANXT2
@NM00074 EQU   SDWAEC2+3
SDWASGN2 EQU   SDWAINT2
SDWAEXP2 EQU   SDWAINT2
SDWADEC2 EQU   SDWAINT2
SDWAFPO2 EQU   SDWAINT2
SDWACC2  EQU   SDWAINT2
@NM00073 EQU   SDWAINT2
SDWAPGM2 EQU   SDWAMWP2
SDWAWAT2 EQU   SDWAMWP2
SDWAMCK2 EQU   SDWAMWP2
SDWAECT2 EQU   SDWAMWP2
SDWAKEY2 EQU   SDWAMWP2
SDWAEXT2 EQU   SDWAEMK2
SDWAIO2  EQU   SDWAEMK2
SDWATRM2 EQU   SDWAEMK2
@NM00072 EQU   SDWAEMK2
SDWAPER2 EQU   SDWAEMK2
@NM00071 EQU   SDWAEMK2
SDWATRAN EQU   SDWAAEC1+4
SDWAIPC1 EQU   SDWAICD1
SDWAIMC1 EQU   SDWAICD1
SDWAIPR1 EQU   SDWAICD1
@NM00070 EQU   SDWAINC1
@NM00069 EQU   SDWAILC1
SDWAIL1  EQU   SDWAILC1
@NM00068 EQU   SDWAILC1
@NM00067 EQU   SDWAAEC1
SDWAADD1 EQU   SDWANXT1+1
@NM00066 EQU   SDWANXT1
@NM00065 EQU   SDWAEC1+3
SDWASGN1 EQU   SDWAINT1
SDWAEXP1 EQU   SDWAINT1
SDWADEC1 EQU   SDWAINT1
SDWAFPO1 EQU   SDWAINT1
SDWACC1  EQU   SDWAINT1
@NM00064 EQU   SDWAINT1
SDWAPGM1 EQU   SDWAMWP1
SDWAWAT1 EQU   SDWAMWP1
SDWAMCK1 EQU   SDWAMWP1
SDWAECT1 EQU   SDWAMWP1
SDWAKEY1 EQU   SDWAMWP1
SDWAEXT1 EQU   SDWAEMK1
SDWAIO1  EQU   SDWAEMK1
SDWATRM1 EQU   SDWAEMK1
@NM00063 EQU   SDWAEMK1
SDWAPER1 EQU   SDWAEMK1
@NM00062 EQU   SDWAEMK1
SDWAIOBR EQU   SDWA+100
SDWAEPA  EQU   SDWA+96
@NM00061 EQU   SDWANAME+4
SDWARBAD EQU   SDWANAME
SDWAGR15 EQU   SDWAGRSV+60
SDWAGR14 EQU   SDWAGRSV+56
SDWAGR13 EQU   SDWAGRSV+52
SDWAGR12 EQU   SDWAGRSV+48
SDWAGR11 EQU   SDWAGRSV+44
SDWAGR10 EQU   SDWAGRSV+40
SDWAGR09 EQU   SDWAGRSV+36
SDWAGR08 EQU   SDWAGRSV+32
SDWAGR07 EQU   SDWAGRSV+28
SDWAGR06 EQU   SDWAGRSV+24
SDWAGR05 EQU   SDWAGRSV+20
SDWAGR04 EQU   SDWAGRSV+16
SDWAGR03 EQU   SDWAGRSV+12
SDWAGR02 EQU   SDWAGRSV+8
SDWAGR01 EQU   SDWAGRSV+4
SDWAGR00 EQU   SDWAGRSV
SDWANXTP EQU   SDWACTL2+5
SDWASGP  EQU   SDWAPMKP
SDWAEUP  EQU   SDWAPMKP
SDWADOP  EQU   SDWAPMKP
SDWAFPP  EQU   SDWAPMKP
SDWACCP  EQU   SDWAPMKP
SDWAILP  EQU   SDWAPMKP
SDWAINTP EQU   SDWACTL2+2
SDWASPVP EQU   SDWAMWPP
SDWAWATP EQU   SDWAMWPP
SDWAMCKP EQU   SDWAMWPP
@NM00060 EQU   SDWAMWPP
SDWAKEYP EQU   SDWAMWPP
SDWAEXTP EQU   SDWACMKP
SDWAIOP  EQU   SDWACMKP
SDWANXTA EQU   SDWACTL1+5
SDWASGA  EQU   SDWAPMKA
SDWAEUA  EQU   SDWAPMKA
SDWADOA  EQU   SDWAPMKA
SDWAFPA  EQU   SDWAPMKA
SDWACCA  EQU   SDWAPMKA
SDWAILA  EQU   SDWAPMKA
SDWAINTA EQU   SDWACTL1+2
SDWASPVA EQU   SDWAMWPA
SDWAWATA EQU   SDWAMWPA
SDWAMCKA EQU   SDWAMWPA
@NM00059 EQU   SDWAMWPA
SDWAEXTA EQU   SDWACMKA
SDWAIOA  EQU   SDWACMKA
SDWACMPC EQU   SDWAABCC+1
@NM00058 EQU   SDWACMPF
SDWASTCC EQU   SDWACMPF
@NM00057 EQU   SDWACMPF
SDWASTEP EQU   SDWACMPF
SDWAREQ  EQU   SDWACMPF
APPNAMID EQU   APPNMTBL+24
APPOFFST EQU   APPENTRY+2
APPCOUNT EQU   APPENTRY
APPSIZE  EQU   APPNMTBL+2
APPBAL   EQU   APPNMTBL
WTGETTR  EQU   WTGIDTTR+2
WTGEID   EQU   WTGIDTTR
WTGOPD   EQU   WTGPATHS+1
WTGRECHK EQU   WTGPATHS+1
WTGTSENQ EQU   WTGPATHS+1
@NM00054 EQU   WTGPATHS+1
WTGTRACE EQU   WTGPATHS+1
@NM00053 EQU   WTGPATHS
WTGJFCBW EQU   WTGPATHS
WTGSMF   EQU   WTGPATHS
WTGTCOS  EQU   WTGPATHS
WTGNSL   EQU   WTGPATHS
WTGPRLSE EQU   WTGPATHS
WTGLNG   EQU   WTG+29
WTGTXTLN EQU   WTGAREA+27
WTGMODSZ EQU   WTGAREA+24
WTGATTRB EQU   WTGAREA+22
@NM00052 EQU   WTGAREA+20
@NM00051 EQU   WTGAREA+12
WTGMODEP EQU   WTGAREA+8
WTGMODID EQU   WTGMODNM+6
@NM00050 EQU   WTGMODNM
DSMADTW6 EQU   DSMADTRL+20
DSMADTW5 EQU   DSMADTRL+16
DSMADTW4 EQU   DSMADTRL+12
DSMADTW2 EQU   DSMADTRL+4
DSMADTB4 EQU   DSMADTW1+3
DSMADTB3 EQU   DSMADTW1+2
@NM00049 EQU   DSMADTB2
DSMDSNE  EQU   DSMADTB2
DSMTIOTE EQU   DSMADTB2
DSMSMCE  EQU   DSMADTB2
DSMVTOCR EQU   DSMADTB2
DSMUCBAL EQU   DSMADTB1
DSMRPSAP EQU   DSMADTB1
DSMLOCK  EQU   DSMADTB1
@NM00048 EQU   DSMADTB1
RRMLRTRY EQU   RRPLIST+16
@NM00047 EQU   RRFLAGS3
RRFFCEXC EQU   RRFLAGS3
RRFFINFC EQU   RRFLAGS3
@NM00046 EQU   RRFLAGS3
RRFENQUL EQU   RRFLAGS2
RRFPRDET EQU   RRFLAGS2
@NM00045 EQU   RRFLAGS2
RRFQMNGR EQU   RRFLAGS2
RRFENQPW EQU   RRFLAGS2
@NM00044 EQU   RRFLAGS2
RRFTRACE EQU   RRFLAGS1
RRFSMF   EQU   RRFLAGS1
RRFNSL   EQU   RRFLAGS1
RRFAMSTR EQU   RRFLAGS1
RRFAMEXR EQU   RRFLAGS1
RRFAMEXG EQU   RRFLAGS1
RRFUSREX EQU   RRFLAGS1
@NM00043 EQU   RRFLAGS1
DXDCBLST EQU   USERPRML
RWALIST  EQU   RWARESWA+12
RWAPARM  EQU   RWAPREFX+8
RWATRBUF EQU   RWAPREFX+4
RWATRACE EQU   RWAPREFX
IECQMNGR EQU   IECEXTPR+92
IECMSGQA EQU   IECEXTPR+88
IECDCBNO EQU   IECUPRML
@NM00042 EQU   IECPREFX+17
@NM00041 EQU   IECPREFX+4
IECCORID EQU   IECPREFX
@NM00026 EQU   TCBPTRS
DXATEXB2 EQU   DXATEXC2
DXEXHASP EQU   DXATEXB1
DXATCOM4 EQU   FORCORE+600
DXATCOM3 EQU   FORCORE+596
@NM00037 EQU   DXATCOM2+3
@NM00036 EQU   DXATALL
DXATFC   EQU   DXATALL
@NM00035 EQU   DXATOPEN
DXATDFIN EQU   DXATOPEN
DXATDSIN EQU   DXATOPEN
DXATMODM EQU   DXATOPEN
DXATMODE EQU   DXATOPEN
DXATMODS EQU   DXATOPEN
DXATIGN  EQU   DXATOPEN
DXATVCAT EQU   DXATEOV
DXATDADM EQU   DXATEOV
DXATREMT EQU   DXATEOV
DXATDNEW EQU   DXATEOV
DXATDFRE EQU   DXATEOV
DXATDCHN EQU   DXATEOV
DXATNVOL EQU   DXATEOV
DXATCCAT EQU   DXATEOV
DXATRDDB EQU   DXATDACC
DXATEOF  EQU   DXATDACC
@NM00034 EQU   DXATDACC
DXATSMF  EQU   DXATDACC
DXATUPDB EQU   DXATDACC
DXATDRCT EQU   DXATDACC
DXATTRAK EQU   DXATDACC
DXATF1CE EQU   DXATDACC
DXATNSL  EQU   DXATOUTA
DXATTTM2 EQU   DXATOUTA
DXATTTM1 EQU   DXATOUTA
DXATTRL2 EQU   DXATOUTA
DXATTRL1 EQU   DXATOUTA
DXATDATM EQU   DXATOUTA
DXATHDTM EQU   DXATOUTA
DXATVLHD EQU   DXATOUTA
DXATCLOS EQU   DXATCOM1+1
DXATSRET EQU   DXATGENS
DXATVCIG EQU   DXATVGIV
DXATVTMG EQU   DXATVGIV
DXATVSMG EQU   DXATVGIV
DXATJFCB EQU   DXATGENS
DXATDISP EQU   DXATGENS
DXATREFR EQU   DXATGENS
DXATDMCT EQU   DXATGENS
DXMSGADR EQU   FORCORE+584
DXPRPARC EQU   FORCORE+580
DXUDCBML EQU   FORCORE+578
DXUDCBPL EQU   FORCORE+576
DXPACBAD EQU   DXPDCBAD+1
@NM00033 EQU   DXPDCBAD
DXUACBAD EQU   DXUDCBAD+1
@NM00032 EQU   DXUDCBAD
DXUCBSVV EQU   DXUCBSAV+1
@NM00031 EQU   DXUCBSAV
DXUCBADR EQU   FORCORE+560
DXTIOTAD EQU   FORCORE+556
DXDEBXAD EQU   FORCORE+552
DXDSAB   EQU   FORCORE+548
DXDSABAD EQU   FORCORE+544
DXDSABQD EQU   FORCORE+540
DXJSCBAD EQU   FORCORE+536
DXTCBADR EQU   FORCORE+532
DXASCBAD EQU   FORCORE+528
DXEXTSW  EQU   FORCORE+527
DXUKEY   EQU   FORCORE+526
DXWKEYSV EQU   FORCORE+525
DXUNITOF EQU   FORCORE+522
DXNOUNIT EQU   FORCORE+520
DXVOLSEQ EQU   FORCORE+518
DXVOLMT3 EQU   DXVOLSR3
DXVOLMT2 EQU   DXVOLSR2
DXVOLMT1 EQU   DXVOLSR1
DXWORK4  EQU   FORCORE+496
DXWORK3  EQU   FORCORE+492
DXWORK2  EQU   FORCORE+488
DXWORK1  EQU   FORCORE+484
DXWORK   EQU   FORCORE+480
@NM00030 EQU   FORCORE+464
DXCCW11  EQU   DXCCW+80
DXCCW10  EQU   DXCCW+72
DXCCW9   EQU   DXCCW+64
DXCCW7   EQU   DXCCW+48
DXCCW6   EQU   DXCCW+40
DXCCW4   EQU   DXCCW+24
DXCCW3   EQU   DXCCW+16
DXCCW2   EQU   DXCCW+8
DXDCBDEB EQU   DXDCB+44
@NM00029 EQU   DXDCB+24
DXDEBDCB EQU   DXDCB+20
@NM00028 EQU   DXDCB
@NM00027 EQU   DXDAADDR
DXIOB    EQU   FORCORE+280
DXJBF    EQU   FORCORE+100
DSCCORE  EQU   FORCORE+96
DXLBL    EQU   DXDSCB
TRRMODSV EQU   TRREXTPR+280
LOBYTE   EQU   SYSCODE+1
@NM00021 EQU   SYSCODE
@NM00020 EQU   COMPCODE
SDWARR0F EQU   @NM00019
IGBIT    EQU   @NM00019
IDAMB    EQU   @NM00019
TRRSAV3  EQU   TRREXTX+96
TRRRWTGC EQU   TRREXTX+16
TRRWTGPR EQU   TRREXTX
TRRLISTP EQU   TRREXTPR+76
TRRWTGP  EQU   TRREXTPR+72
SAREG12  EQU   SAVAREA+68
SAREG11  EQU   SAVAREA+64
SAREG9   EQU   SAVAREA+56
SAREG7   EQU   SAVAREA+48
SAREG6   EQU   SAVAREA+44
SAREG5   EQU   SAVAREA+40
SAREG4   EQU   SAVAREA+36
SAREG3   EQU   SAVAREA+32
SAREG2   EQU   SAVAREA+28
SAREG1   EQU   SAVAREA+24
SAREG0   EQU   SAVAREA+20
SAREG15  EQU   SAVAREA+16
@NM00018 EQU   SAVAREA
@NM00017 EQU   RRCBSAHD+220
RRCBSTIM EQU   RRCBTIMP+1
@NM00016 EQU   RRCBTIMP
@NM00015 EQU   RRCBSAHD+186
RRCBSDAT EQU   RRCBDATP+1
@NM00014 EQU   RRCBDATP
@NM00013 EQU   RRCBSAHD+156
@NM00012 EQU   RRCBSAHD+124
@NM00011 EQU   RRCBSAHD
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS
@RT00200 EQU   NEXTMOD
@RF00191 EQU   NEXTMOD
@RC00191 EQU   @RC00190
@RC00238 EQU   @EL00002
@RC00319 EQU   @EL00005
@PB00006 EQU   @PB00007
@RF00394 EQU   @RC00392
@RF00405 EQU   @RC00392
@RC00396 EQU   @RC00392
@RF00410 EQU   @EL00008
@RF00432 EQU   @EL00008
@PB00009 EQU   @PB00010
@RF00479 EQU   @EL00011
@PB00011 EQU   @PB00012
@RC00203 EQU   @RC00191
@RC00192 EQU   @RC00191
@RF00353 EQU   @RC00319
@PB00005 EQU   @PB00006
@PB00008 EQU   @PB00009
@RC00193 EQU   @RC00192
@PB00004 EQU   @PB00005
@ENDDATA EQU   *
         END   IFG0RR0A,(C'PLS2353',0701,76023)
