         TITLE 'IDA0192I - MVM  ISAM INTERFACE OPEN                    *
                        '
IDA0192I CSECT ,                                                   0001
@MAINENT DS    0H                                                  0001
         USING *,@15                                               0001
         B     @PROLOG                                             0001
         DC    AL1(16)                                             0001
         DC    C'IDA0192I  78.144'                                 0001
         DROP  @15
@PROLOG  STM   @14,@12,12(@13)                                     0001
         BALR  @12,0                                               0001
@PSTART  DS    0H                                                  0001
         USING @PSTART,@12                                         0001
*   IIRSAVE=R13;                    /* SAVE PTR TO SAVE AREA         */
         ST    R13,IIRSAVE(,RCORE)                                 0172
*   RIICB=ZERO;                     /* INDICATE IICB NOT OBTAINED  0173
*                                                            @Y021130*/
         SLR   RIICB,RIICB                                         0173
*   IIAUDPTR=ZERO;                  /* INDICATE NO AUDITING HAS BEEN
*                                      DONE                  @Y021130*/
         SLR   @15,@15                                             0174
         ST    @15,IIAUDPTR(,RCORE)                                0174
*   DO;                             /* MODESET KEYADDR(DXUKEY)       */
*     SPKA(DXUKEY);                 /* SET PSW KEY                   */
         SLR   @15,@15                                             0176
         IC    @15,DXUKEY(,RCORE)                                  0176
         SPKA  0(@15)                                              0176
*   END;                            /* MODESET KEYADDR(DXUKEY) ASSUME
*                                      USER KEY              @Y021130*/
*   RDCB=DXUDCBAD;                  /* INIT DCB POINTER TO DCB COPY
*                                                            @Y021130*/
         L     RDCB,DXUDCBAD(,RCORE)                               0178
*   ISAMDCB=PCOPYDCB;               /* REFRESH USER DCB FROM       0179
*                                      PROTECTED COPY        @Y021130*/
         L     @15,DXPDCBAD(,RCORE)                                0179
         MVC   ISAMDCB+16(236,RDCB),PCOPYDCB(@15)                  0179
*   RESPECIFY                                                      0180
*    (RRPL) UNRESTRICTED;           /*                       @Y021130*/
*   CALL BLDIICB;                   /* BUILD THE IICB,ACB & EXLST    */
         BAL   @14,BLDIICB                                         0181
*   CALL INITIICB;                  /* INIT THE IICB, ACB & EXLST    */
         BAL   @14,INITIICB                                        0182
*   CALL ACBMERGE;                  /* MERGE FROM DCB TO ACB         */
         BAL   @14,ACBMERGE                                        0183
*   CALL OPENACB;                   /* OPEN THE ACB                  */
         BAL   @14,OPENACB                                         0184
*   IF DCBOFOPN=OFF THEN            /* IF UNSUCCESSFUL OPEN          */
         TM    DCBOFOPN+40(RDCB),B'00010000'                       0185
         BZ    @RT00185                                            0185
*     GO TO EXIT;                   /* RETURN TO USER                */
*   CALL DCBMERGE;                  /* MERGE FROM JFCB TO DCB        */
         BAL   @14,DCBMERGE                                        0187
*   CALL AMSMERGE;                  /* MERGE DATA SET ATTRIBUTES     */
         BAL   @14,AMSMERGE                                        0188
*   CALL DCBEXIT;                   /* ISAM DCB EXIT                 */
         BAL   @14,DCBEXIT                                         0189
*   CALL VALIDCHK;                  /* VALIDITY CHECK ATTRIBUTES     */
         BAL   @14,VALIDCHK                                        0190
*   CALL BFRMERGE;                  /* MERGE BUFFER RELATED INFO     */
         BAL   @14,BFRMERGE                                        0191
*   CALL BUILDDEB;                  /* BUILD DUMMY ISAM DEB          */
         BAL   @14,BUILDDEB                                        0192
*   CALL LOADMOD;                   /* LOAD II PROCESSING MODULES    */
         BAL   @14,LOADMOD                                         0193
*   CALL BLDRPL;                    /* COMPUTE RPL & BUFFER SIZE     */
         BAL   @14,BLDRPL                                          0194
*   CALL INITRPL;                   /* INIT RPL, RPLE & ERROR MSG    */
         BAL   @14,INITRPL                                         0195
*   CALL BLDBUFR;                   /* BUILD BUFFERS                 */
         BAL   @14,BLDBUFR                                         0196
*   CALL DCBINIT;                   /* FINAL DCB INITIALIZATION      */
         BAL   @14,DCBINIT                                         0197
*EXIT:                                                             0198
*   R13=IIRSAVE;                                                   0198
EXIT     L     R13,IIRSAVE(,RCORE)                                 0198
*   DO;                             /* MODESET EXTKEY(ZERO)          */
*     SPKA(0);                      /* SET PSW KEY                   */
         SLR   @15,@15                                             0200
         SPKA  0(@15)                                              0200
*   END;                            /* MODESET EXTKEY(ZERO) ASSUME 0201
*                                      SYSTEM KEY            @Y021130*/
*   PCOPYDCB=ISAMDCB;               /* REFRESH COPY DCB      @YM03981*/
         L     @15,DXPDCBAD(,RCORE)                                0202
         MVC   PCOPYDCB(236,@15),ISAMDCB+16(RDCB)                  0202
*   RETURN;                                                        0203
@EL00001 DS    0H                                                  0203
@EF00001 DS    0H                                                  0203
@ER00001 LM    @14,@12,12(@13)                                     0203
         BR    @14                                                 0203
*                                                                  0204
*/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
**                                                                    *
**   FUNCTION = BUILD IICB                                            *
**       THIS ROUTINE CALCULATES THE AMOUNT OF CORE NEEDED AND        *
**       CALLS THE GETMAIN ROUTINE TO GET CORE IN THE USER'S          *
**       REGION FOR THE IICB, ACB AND EXLST.  THESE BLOCKS WILL BE    *
**       USED FOR THE DCB THAT IS BEING OPENED.                       *
**                                                                    *
**   INPUT =                                                          *
**       REGISTER 1 - RDCB - DCB POINTER                              *
**       REGISTER 4 - RCORE - I/O SUPPORT WORK AREA POINTER           *
**                                                                    *
**   OUTPUT =                                                         *
**       REGISTER 1 - RDCB - DCB POINTER                              *
**       REGISTER 2 - RIICB - IICB POINTER                            *
**       REGISTER 4 - RCORE - I/O SUPPORT WORK AREA POINTER           *
**                                                                    *
**       CONTROL BLOCK FIELDS INITIALIZED                             *
**         IIACBL                                                     *
**                                                                    *
**   PROTECTION KEY = SEE BELOW                                       *
**       KEY ON ENTRY - USER KEY                                      *
**       KEY ON EXIT - USER KEY                                       *
**       INTERIM KEYS ASSUMED = NONE                                  *
**                                                                    *
**                                                                    *
** * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
*                                                                  0204
*BLDIICB:                                                          0204
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0204
BLDIICB  DS    0H                                                  0205
*   RESPECIFY                                                      0205
*    (RLKRETSV) RESTRICTED;         /*                       @Y021130*/
*   RLKRETSV=R14;                   /* SAVE RETURN ADDRESS   @Y021130*/
         LR    RLKRETSV,R14                                        0206
*   RESPECIFY                                                      0207
*    (RGMLEN) RESTRICTED;           /*                       @Y021130*/
*   RGMLEN=LENGTH(IDAIICB)+         /* INIT AMT OF CORE REQUIRED     */
*       LENGTH(IFGACB)+             /*                       @Y021130*/
*       20;                                                        0208
         LA    RGMLEN,264                                          0208
*   RESPECIFY                                                      0209
*    (RGMSP) RESTRICTED;            /*                       @Y021130*/
*   RGMSP=USERPOOL;                 /* SUBPOOL FOR USER REGION     0210
*                                                            @Y021130*/
         LA    RGMSP,250                                           0210
*   CALL GETMAIN;                   /* GET CORE                      */
         BAL   @14,GETMAIN                                         0211
*   RESPECIFY                                                      0212
*    (RGMSP,                                                       0212
*     RGMLEN,                                                      0212
*     RLKRETSV) UNRESTRICTED;       /*                       @Y021130*/
*   RIICB=MAINADDR;                 /* INIT IICB REG                 */
         L     RIICB,MAINADDR(,RCORE)                              0213
*   IIACBL=MAINLEN;                 /* SAVE LENGTH / SUBPOOL         */
         MVC   IIACBL(3,RIICB),MAINLEN(RCORE)                      0214
*   R14=IIRSAVE1;                   /* RESTORE RETURN ADDR           */
         L     R14,IIRSAVE1(,RCORE)                                0215
*   END BLDIICB;                                                   0216
@EL00002 DS    0H                                                  0216
@EF00002 DS    0H                                                  0216
@ER00002 BR    @14                                                 0216
*                                                                  0217
*/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
**                                                                    *
**   FUNCTION = GETMAIN                                               *
**       THIS ROUTINE IS CALLED BY THE BLDIICB, BUILDDEB AND          *
**       BLDRPL ROUTINES IN THIS MODULE.  ALL ISAM INTERFACE          *
**       CORE IS OBTAINED BY THIS ROUTINE.                            *
**                                                                    *
**   INPUT =                                                          *
**       REGISTER 1 - RDCB - DCB POINTER                              *
**       REGISTER 4 - RCORE - I/O SUPPORT WORK AREA POINTER           *
**       REGISTER 8 - RGMSP = SUBPOOL NUMBER FOR GETMAIN              *
**       REGISTER 9 - RGMLEN = LENGTH FOR GETMAIN                     *
**       REGISTER 10 - RLKRETSV = CALLER'S SAVED LINKAGE              *
**                                                                    *
**   OUTPUT =                                                         *
**       SAME AS ABOVE                                                *
**       MAINADDR = ADDRESS OF CORE OBTAINED                          *
**                                                                    *
**   PROTECTION KEY = SEE BELOW                                       *
**       KEY ON ENTRY - USER KEY                                      *
**       KEY ON EXIT - USER KEY                                       *
**       INTERIM KEYS ASSUMED = DATA MANAGEMENT KEY 5                 *
**                                                                    *
**                                                                    *
** * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
*                                                                  0217
*GETMAIN:                                                          0217
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0217
GETMAIN  DS    0H                                                  0218
*   RESPECIFY                                                      0218
*    (RGMSP,                                                       0218
*     RGMLEN,                                                      0218
*     RLKRETSV,                                                    0218
*     RRPL) RESTRICTED;             /*                       @ZA02670*/
*   DO;                             /* MODESET EXTKEY(DATAMGT)       */
*     SPKA(80);                     /* SET PSW KEY                   */
         LA    @15,80                                              0220
         SPKA  0(@15)                                              0220
*   END;                            /* MODESET EXTKEY(DATAMGT) ASSUME
*                                      DATA MANAGEMENT KEY FOR     0221
*                                      STORING INTO THE OPEN WORK  0221
*                                      AREA                  @Y021130*/
*   IIRSAVE1=RLKRETSV;              /* SAVE CALLER'S LINKAGE @Y021130*/
         ST    RLKRETSV,IIRSAVE1(,RCORE)                           0222
*   MAINLEN=RGMLEN;                 /* SAVE LENGTH           @Y021130*/
         STCM  RGMLEN,7,MAINLEN(RCORE)                             0223
*   MAINPOOL=RGMSP;                 /* SAVE SUBPOOL          @Y021130*/
         STC   RGMSP,MAINPOOL(,RCORE)                              0224
*   RESPECIFY                                                      0225
*    (RGMSP,                                                       0225
*     RGMLEN,                                                      0225
*     RLKRETSV) UNRESTRICTED;       /*                       @Y021130*/
*   IIRSAVE2=R14;                   /* SAVE RETURN ADDR              */
         ST    R14,IIRSAVE2(,RCORE)                                0226
*   IIRSAVE3=RDCB;                  /* SAVE DCB POINTER              */
         ST    RDCB,IIRSAVE3(,RCORE)                               0227
*   RESPECIFY                                                      0228
*    (R0,                                                          0228
*     R1,                                                          0228
*     R15) RESTRICTED;                                             0228
*   R0=MAINR0;                      /* LOAD R0 FOR GETMAIN           */
         L     R0,MAINR0(,RCORE)                                   0229
*   GEN(GETMAIN R,LV=(0));          /*                       @Y021130*/
         GETMAIN R,LV=(0)
*   MAINADDR=R1;                    /* SAVE RESULTS                  */
         ST    R1,MAINADDR(,RCORE)                                 0231
*   RESPECIFY                                                      0232
*    (R8,                                                          0232
*     R9,                                                          0232
*     R10,                                                         0232
*     R11) RESTRICTED;                                             0232
*   R8=R1;                          /* ADDR OF CORE                  */
         LR    R8,R1                                               0233
*   R9=MAINLEN;                     /* SIZE OF CORE                  */
         L     R9,MAINLEN-1(,RCORE)                                0234
         LA    R9,0(,R9)                                           0234
*   R11=ZERO;                       /* ZERO PADDING AND SIZE         */
         SLR   R11,R11                                             0235
*   IF MAINPOOL=USERPOOL THEN                                      0236
         CLI   MAINPOOL(RCORE),250                                 0236
         BNE   @RF00236                                            0236
*     DO;                           /* MODESET KEYADDR(DXUKEY)       */
*       SPKA(DXUKEY);               /* SET PSW KEY                   */
         SLR   @07,@07                                             0238
         IC    @07,DXUKEY(,RCORE)                                  0238
         SPKA  0(@07)                                              0238
*     END;                          /* MODESET KEYADDR(DXUKEY) ASSUME
*                                      USER KEY              @Y021130*/
*   GEN(MVCL R8,R10);               /* CLEAR CORE                    */
*                                                                  0240
@RF00236 DS    0H                                                  0240
         MVCL R8,R10
*   /*****************************************************************/
*   /*                                                               */
*   /* AUDIT SET UP AUDIT TRAIL IF FIRST GETMAIN             @Y021130*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0241
*   IF IIAUDPTR=ZERO THEN           /* IF THIS IS FIRST GETMAIN WHICH
*                                      IS FOR IICB THEN              */
         L     @07,IIAUDPTR(,RCORE)                                0241
         LTR   @07,@07                                             0241
         BNZ   @RF00241                                            0241
*     DO;                           /* INIT AUDIT POINTER TO IICB    */
*       DO;                         /* MODESET EXTKEY(DATAMGT)       */
*         SPKA(80);                 /* SET PSW KEY                   */
         LA    @07,80                                              0244
         SPKA  0(@07)                                              0244
*       END;                        /* MODESET EXTKEY(DATAMGT) POINT
*                                      AUDIT TRAIL TO IICB ANCHORED
*                                      IN FORCORE                    */
*       RIICB=MAINADDR;             /* GET ADDR OF IICB      @Y021130*/
         L     RIICB,MAINADDR(,RCORE)                              0246
*       IIAUDPTR=RIICB;             /* SAVE IN OPEN CLOSE WORK AREA
*                                                            @Y021130*/
         ST    RIICB,IIAUDPTR(,RCORE)                              0247
*       DO;                         /* MODESET KEYADDR(DXUKEY)       */
*         SPKA(DXUKEY);             /* SET PSW KEY                   */
         SLR   @07,@07                                             0249
         IC    @07,DXUKEY(,RCORE)                                  0249
         SPKA  0(@07)                                              0249
*       END;                        /* MODESET KEYADDR(DXUKEY) KEY OF
*                                      IICB                  @Y021130*/
*       IIGMCNTR=LENGTH(IIAUDHDR);  /* SET OFFSET TO GETMAIN ENTRY 0251
*                                      PAST HEADER           @Y021130*/
         MVC   IIGMCNTR(2,RIICB),@CH00199                          0251
*     END;                          /*                       @Y021130*/
*                                                                  0252
*   /*****************************************************************/
*   /*                                                               */
*   /* AUDIT GETMAIN                                         @Y021130*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0253
*   DO;                             /* MODESET KEYADDR(DXUKEY)       */
@RF00241 DS    0H                                                  0254
*     SPKA(DXUKEY);                 /* SET PSW KEY                   */
         SLR   @07,@07                                             0254
         IC    @07,DXUKEY(,RCORE)                                  0254
         SPKA  0(@07)                                              0254
*   END;                            /* MODESET KEYADDR(DXUKEY) GET 0255
*                                      INTO USER KEY         @Y021130*/
*   IF IIGMCNTR<LENGTH(IIAUD) THEN                                 0256
         LH    @07,IIGMCNTR(,RIICB)                                0256
         C     @07,@CF02486                                        0256
         BNL   @RF00256                                            0256
*     DO;                           /* ONLY AUDIT IF WON'T OVERLAY 0257
*                                      LENGTH PROVIDED       @Y021130*/
*       IIGMADDR=MAINADDR;          /* SAVE ADDR OF CORE     @Y021130*/
         LA    @05,IIAUD(,RIICB)                                   0258
         ALR   @05,@07                                             0258
         MVC   IIGMADDR(4,@05),MAINADDR(RCORE)                     0258
*       IIGMSPLG=MAINR0;            /* SUBPOOL/LENGTH        @Y021130*/
         MVC   IIGMSPLG(4,@05),MAINR0(RCORE)                       0259
*       IIGMCNTR=IIGMCNTR+IIGMINCR; /* POINT TO NEXT SLOT AVAILABLE
*                                                            @Y021130*/
         AL    @07,@CF00045                                        0260
         STH   @07,IIGMCNTR(,RIICB)                                0260
*     END;                          /* END AUDIT             @Y021130*/
*   RDCB=IIRSAVE3;                  /* RESTORE DCB POINTER           */
@RF00256 L     RDCB,IIRSAVE3(,RCORE)                               0262
*   RESPECIFY                                                      0263
*    (R8,                                                          0263
*     R9,                                                          0263
*     R10,                                                         0263
*     R11) UNRESTRICTED;                                           0263
*   R14=IIRSAVE2;                   /* RESTORE RETURN ADDRESS        */
         L     R14,IIRSAVE2(,RCORE)                                0264
*   RESPECIFY                                                      0265
*    (R0,                                                          0265
*     R15,                                                         0265
*     RRPL) UNRESTRICTED;           /*                       @ZA02670*/
*   END GETMAIN;                                                   0266
@EL00003 DS    0H                                                  0266
@EF00003 DS    0H                                                  0266
@ER00003 BR    @14                                                 0266
*                                                                  0267
*/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
**                                                                    *
**   FUNCTION = INITIALIZE IICB                                       *
**       THIS ROUTINE PERFORMS BASIC INITIALIZATION OF THE IICB       *
**       ACB AND EXIT LIST.                                           *
**                                                                    *
**   INPUT =                                                          *
**       REGISTER 1 - RDCB - DCB POINTER                              *
**       REGISTER 2 - RIICB - IICB POINTER                            *
**                                                                    *
**   OUTPUT =                                                         *
**       REGISTER 1 - RDCB - DCB POINTER                              *
**       REGISTER 2 - RIICB - IICB POINTER                            *
**       REGISTER 6 - RACB - ACB POINTER                              *
**                                                                    *
**       CONTROL BLOCK FIELDS INITIALIZED                             *
**         ACBDORGA                                                   *
**         ACBEXFG                                                    *
**         ACBEXLST                                                   *
**         ACBID                                                      *
**         ACBKEY                                                     *
**         ACBPASSW                                                   *
**         EXLID                                                      *
**         EXLLEN                                                     *
**         IIACBPTR                                                   *
**         IICBID                                                     *
**         IICBLEN                                                    *
**         IIDCBPTR                                                   *
**                                                                    *
**   PROTECTION KEY = SEE BELOW                                       *
**       KEY ON ENTRY - USER KEY                                      *
**       KEY ON EXIT - USER KEY                                       *
**       INTERIM KEYS ASSUMED = NONE                                  *
**                                                                    *
**                                                                    *
** * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
*                                                                  0267
*INITIICB:                                                         0267
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);/* INITIALIZE THE IICB           */
INITIICB DS    0H                                                  0268
*   IICBID='80'X;                   /* IICB ID X'80'                 */
         MVI   IICBID(RIICB),X'80'                                 0268
*   IICBLEN=LENGTH(IDAIICB);        /* LENGTH OF IICB                */
         LA    @15,168                                             0269
         STH   @15,IICBLEN(,RIICB)                                 0269
*   IIDCBPTR=RDCB;                  /* DCB POINTER INITIALIZE ACB    */
         ST    RDCB,IIDCBPTR(,RIICB)                               0270
*   RACB=RIICB+LENGTH(IDAIICB);     /* INIT ACB PTR                  */
         ALR   @15,RIICB                                           0271
         LR    RACB,@15                                            0271
*   IIACBPTR=RACB;                  /* ACB POINTER                   */
         ST    RACB,IIACBPTR(,RIICB)                               0272
*   ACBID='A0'X;                    /* SET ACB IDENTIFIER            */
         MVI   ACBID(RACB),X'A0'                                   0273
*   ACBLENG=LENGTH(IFGACB);         /* SET ACB LENGTH                */
         LA    @15,76                                              0274
         STH   @15,ACBLENG(,RACB)                                  0274
*   ACBDORGA=ON;                    /* SET DSORG ACB BIT             */
         OI    ACBDORGA(RACB),B'00001000'                          0275
*   ACBPASSW='';                    /* SET PASSWORD TO BLANKS        */
         SLR   @07,@07                                             0276
         ST    @07,ACBPASSW(,RACB)                                 0276
*   ACBEXLST=RACB+LENGTH(IFGACB);   /* INIT EXLST PTR IN ACB OFLGS -
*                                      LOCK BIT                      */
         ALR   @15,RACB                                            0277
         ST    @15,ACBEXLST(,RACB)                                 0277
*   ACBEXFG=ON;                     /* SET NO USER EXITS FLAG        */
         OI    ACBEXFG(RACB),B'00000010'                           0278
*   ACBKEY=ON;                      /* MACRF - KEY INITIALIZE EXIT 0279
*                                      LIST                          */
         OI    ACBKEY(RACB),B'10000000'                            0279
*   EXLID='81'X;                    /* SET EXLST IDENTIFIER          */
         MVI   EXLID(@15),X'81'                                    0280
*   EXLLEN=20;                      /* LENGTH OF EXLST-3 ENTRIES EXIT
*                                      FLAGS AND POINTERS ARE      0281
*                                      INITIALIZED IN THE LOADMOD  0281
*                                      ROUTINE                       */
         MVC   EXLLEN(2,@15),@CH02175                              0281
*   END INITIICB;                                                  0282
@EL00004 DS    0H                                                  0282
@EF00004 DS    0H                                                  0282
@ER00004 BR    @14                                                 0282
*                                                                  0283
*/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
**                                                                    *
**   FUNCTION = ACB MERGE                                             *
**       THIS ROUTINE INITIALIZES THE REMAINING FIELDS THAT ARE       *
**       NEEDED TO OPEN THE ACB.  THE DDNAME IS MERGED FROM THE       *
**       TIOT AND THE MACRO FORMAT IS MAPPED FROM THE DCB.  ALL       *
**       OTHER FIELDS DEFAULT TO THE VALUES SPECIFIED DURING AMS      *
**       DEFINE AND SPECIFIED ON THE DD CARD.  II OPEN WAS ENTERED    *
**       WITH THE FOUNDATION PORTION OF THE DCB INITIALIZED TO THE    *
**       FORMAT AFTER OPEN.                                           *
**                                                                    *
**   INPUT =                                                          *
**       REGISTER 1 - RDCB - DCB POINTER                              *
**       REGISTER 6 - RACB - ACB POINTER                              *
**                                                                    *
**   OUTPUT =                                                         *
**       REGISTERS - SAME AS ABOVE                                    *
**                                                                    *
**       CONTROL BLOCK FIELDS INITIALIZED                             *
**         ACBDDNM                                                    *
**         ACBMACR1                                                   *
**                                                                    *
**   PROTECTION KEY = SEE BELOW                                       *
**       KEY ON ENTRY - USER KEY                                      *
**       KEY ON EXIT - USER KEY                                       *
**       INTERIM KEYS ASSUMED = NONE                                  *
**                                                                    *
**                                                                    *
** * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
*                                                                  0283
*ACBMERGE:                                                         0283
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0283
ACBMERGE DS    0H                                                  0284
*   RESPECIFY                                                      0284
*    (RTIOT) RESTRICTED;            /* LOCATE DDNAME IN TIOT         */
*   RTIOT=DXTIOTAD;                 /*                       @Y021130*/
         L     RTIOT,DXTIOTAD(,RCORE)                              0285
*   ACBDDNM=TIOEDDNM;               /* GET DDNAME FROM TIOT          */
         MVC   ACBDDNM(8,RACB),TIOEDDNM(RTIOT)                     0286
*   RESPECIFY                                                      0287
*     RTIOT UNRESTRICTED;                                          0287
*                                                                  0287
*   /*****************************************************************/
*   /*                                                               */
*   /* MACRO FORMAT MAPPING FROM THE DCB TO THE ACB                  */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0288
*                                   /* IF GET OR PUT                 */
*   IF DCBMFGET=ON×DCBMFPUT=ON THEN                                0288
         LA    @15,40                                              0288
         ALR   @15,RDCB                                            0288
         TM    DCBMFGET(@15),B'01000000'                           0288
         BO    @RT00288                                            0288
         TM    DCBMFPUT(@15),B'01000000'                           0288
         BNO   @RF00288                                            0288
@RT00288 DS    0H                                                  0289
*     ACBSEQ=ON;                    /* THEN SEQUENTIAL IF BISAM (READ
*                                      OR WIRTE)                     */
         OI    ACBSEQ(RACB),B'00010000'                            0289
*   IF DCBMFRD=ON×DCBMFWRT=ON THEN                                 0290
@RF00288 LA    @15,40                                              0290
         ALR   @15,RDCB                                            0290
         TM    DCBMFRD(@15),B'00100000'                            0290
         BO    @RT00290                                            0290
         TM    DCBMFWRT(@15),B'00100000'                           0290
         BNO   @RF00290                                            0290
@RT00290 DS    0H                                                  0291
*     ACBDIR=ON;                    /* THEN DIRECT IF GET OR READ    */
         OI    ACBDIR(RACB),B'00001000'                            0291
*   IF DCBMFGET=ON×DCBMFRD=ON THEN                                 0292
@RF00290 TM    DCBMFGET+40(RDCB),B'01100000'                       0292
         BZ    @RF00292                                            0292
*     ACBIN=ON;                     /* THEN INPUT IF PUT OR WRITE    */
         OI    ACBIN(RACB),B'00000100'                             0293
*   IF DCBMFPUT=ON×DCBMFWRT=ON THEN                                0294
@RF00292 TM    DCBMFPUT+40(RDCB),B'01100000'                       0294
         BZ    @RF00294                                            0294
*     ACBOUT=ON;                    /* THEN OUTPUT                   */
         OI    ACBOUT(RACB),B'00000010'                            0295
*   END ACBMERGE;                                                  0296
@EL00005 DS    0H                                                  0296
@EF00005 DS    0H                                                  0296
@ER00005 BR    @14                                                 0296
*                                                                  0297
*/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
**                                                                    *
**   FUNCTION = OPEN ACB                                              *
**       THIS ROUTINE INITIALIZES THE OPEN PARAMETER LIST AND         *
**       OPENS THE ACB.  IT CHECKS TO SEE IF THE ACB WAS SUCCESSFULLY *
**       OPENED AND SETS THE DCB OPEN BIT APPROPRIATELY.  FOR AN      *
**       UNSUCCESSFUL OPEN, THIS ROUTINE TURNS THE DCB LOCK           *
**       BIT OFF AND FREES THE CORE FOR THE IICB, AND AND EXLST.      *
**       IF THE OPEN WAS SUCCESSFUL BUT ERROR CODE 116 WAS RETURNED   *
**       THEN ABEND 03B WILL BE ISSUED.                               *
**                                                                    *
**   INPUT =                                                          *
**       REGISTER 1 - RDCB - DCB POINTER                              *
**       REGISTER 2 - RIICB - IICB POINTER                            *
**       REGISTER 4 - RCORE - I/O SUPPORT WORK AREA POINTER           *
**       REGISTER 6 - RACB - ACB POINTER                              *
**                                                                    *
**   OUTPUT=                                                          *
**       REGISTERS - SAME AS ABOVE                                    *
**                                                                    *
**       CONTROL BLOCK FIELDS INITIALIZED                             *
**         DCBOFLGS                                                   *
**                                                                    *
**   PROTECTION KEY = SEE BELOW                                       *
**       KEY ON ENTRY - USER KEY                                      *
**       KEY ON EXIT - USER KEY                                       *
**       INTERIM KEYS ASSUMED = NONE                                  *
**                                                                    *
**                                                                    *
** * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
*                                                                  0297
*OPENACB:                                                          0297
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0297
OPENACB  DS    0H                                                  0298
*   RESPECIFY                                                      0298
*    (RWORK2,                                                      0298
*     RLKRETSV) RESTRICTED;         /*                       @Y021130*/
*   RFY                                                            0299
*    (R15,                                                         0299
*     R0) RSTD;                     /* RESTRICT REGS         @OY08151*/
*   RLKRETSV=R14;                   /* SAVE RETURN ADDR      @Y021130*/
         LR    RLKRETSV,R14                                        0300
*   RWORK2=ADDR(IIACBPTR);          /* OPEN PARM LIST PTR            */
         LA    RWORK2,IIACBPTR(,RIICB)                             0301
*   PARCOPT(1)=ON;                  /* BIT FOR LAST ACB IN LIST      */
*                                                                  0302
         MVI   PARCOPT(RPARC),B'10000000'                          0302
*   /*****************************************************************/
*   /*                                                               */
*   /* AUDIT ACB OPEN HAS BEEN ISSUED                        @Y021130*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0303
*   AUDACBOP=ON;                    /* SET FLAG IN IICB      @Y021130*/
         OI    AUDACBOP(RIICB),B'10000000'                         0303
*   R15=ADDR(SYNCHACB);             /* ADDR OF OPEN RTN      @OY08151*/
         LA    R15,SYNCHACB                                        0304
*   R0=RWORK2;                      /* PASS ACB ADDR         @OY08151*/
         LR    R0,RWORK2                                           0305
*   GEN(SYNCH (15));                /* OPEN THE VSAM ACB     @OY08151*/
*                                                                  0306
         SYNCH (15)
*   /*****************************************************************/
*   /*                                                               */
*   /* AUDIT THAT ACB OPEN HAS RETURNED                      @Y021130*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0307
*   AUDACBRO=ON;                    /* SET FLAG IN IICB      @Y021130*/
         OI    AUDACBRO(RIICB),B'01000000'                         0307
*   PARCOPT(1)=OFF;                 /* CLEAR ACB PTR IN IICB         */
         MVI   PARCOPT(RPARC),B'00000000'                          0308
*   RDCB=DXUDCBAD;                  /* RESTORE DCB PTR       @Y021130*/
         L     RDCB,DXUDCBAD(,RCORE)                               0309
*   DCBOFLGS=ZERO;                  /* CLEAR OPEN FLAGS              */
         LA    @11,40                                              0310
         ALR   @11,RDCB                                            0310
         MVI   DCBOFLGS(@11),X'00'                                 0310
*   IF ACBOPEN=ON&ACBERFLG^=OPERR116 THEN/* IF SUCCESSFUL OPEN AND 0311
*                                      DID NOT GET OPEN ERROR CODE 0311
*                                      116                   @ZA32474*/
         TM    ACBOPEN(RACB),B'00010000'                           0311
         BNO   @RF00311                                            0311
         CLI   ACBERFLG(RACB),116                                  0311
         BE    @RF00311                                            0311
*     DCBOFOPN=ON;                  /* SET DCB OPEN BIT ON           */
         OI    DCBOFOPN(@11),B'00010000'                           0312
*   ELSE                            /* UNSUCCESSFUL OPEN             */
*     DO;                           /* OPEN AND BUSY BITS OFF        */
         B     @RC00311                                            0313
@RF00311 DS    0H                                                  0314
*       IF ACBOPEN=ON&ACBERFLG=OPERR116 THEN/* IF ERROR CODE 116 THEN
*                                                            @ZA32474*/
         TM    ACBOPEN(RACB),B'00010000'                           0314
         BNO   @RF00314                                            0314
         CLI   ACBERFLG(RACB),116                                  0314
         BNE   @RF00314                                            0314
*         DO;                       /*                       @ZA32474*/
*           DO;                     /* ABEND(ABEND3B) DUMP SYSTEM    */
*             RESPECIFY                                            0317
*              (GPR01F) RESTRICTED;                                0317
*             GPR01F=((ABEND3B)&'00000FFF'X)*4096;/* COMP CODE IN  0318
*                                      BITS 8-19                     */
         L     GPR01F,@CF02487                                     0318
*             GPR01F=GPR01F×'80000000'X;/* DUMP/STEP/DUMPOPTS FLAG   */
         O     GPR01F,@CF02428                                     0319
*             SVC(13);              /* ISSUE ABEND SVC               */
         SVC   13                                                  0320
*             RESPECIFY                                            0321
*              (GPR01F) UNRESTRICTED;                              0321
*           END;                    /* ABEND(ABEND3B) DUMP SYSTEM  0322
*                                      X'03B' - ISSUE ABEND  @ZA32474*/
*         END;                      /*                       @ZA32474*/
*       DCBOFUEX=ON;                /* LOCK BIT OFF (=1) FREE CORE 0324
*                                      FOR IICB,ACB,EXL              */
@RF00314 OI    DCBOFUEX+40(RDCB),B'00000010'                       0324
*       RESPECIFY                                                  0325
*        (R0,                                                      0325
*         R1) RESTRICTED;                                          0325
*       DO;                         /* MODESET EXTKEY(DATAMGT)       */
*         SPKA(80);                 /* SET PSW KEY                   */
         LA    @11,80                                              0327
         SPKA  0(@11)                                              0327
*       END;                        /* MODESET EXTKEY(DATAMGT) DATA
*                                      MGT KEY               @ZA02267*/
*       IIRSAVE3=RDCB;              /* SAVE DCB PTR          @ZA02670*/
         ST    RDCB,IIRSAVE3(,RCORE)                               0329
*       DO;                         /* MODESET KEYADDR(DXUKEY)       */
*         SPKA(DXUKEY);             /* SET PSW KEY                   */
         SLR   @11,@11                                             0331
         IC    @11,DXUKEY(,RCORE)                                  0331
         SPKA  0(@11)                                              0331
*       END;                        /* MODESET KEYADDR(DXUKEY) RETURN
*                                      TO USER KEY           @ZA02267*/
*       R0=MAINR0;                  /* INIT LENGTH / SUBPOOL         */
         L     R0,MAINR0(,RCORE)                                   0333
*       R1=MAINADDR;                /* INIT PTR TO CORE              */
         L     R1,MAINADDR(,RCORE)                                 0334
*       GEN(FREEMAIN R,LV=(0),A=(1));/* FREEMAIN             @Y021130*/
         FREEMAIN R,LV=(0),A=(1)
*       RDCB=IIRSAVE3;              /* RESTORE DCB ADDR      @OZ02670*/
         L     RDCB,IIRSAVE3(,RCORE)                               0336
*       RESPECIFY                                                  0337
*        (R0,                                                      0337
*         R1) UNRESTRICTED;                                        0337
*       RESPECIFY                                                  0338
*        (RTIOT) RESTRICTED;        /*                       @Y021130
*                                      LOCATE DDNAME IN TIOT         */
*       RTIOT=DXTIOTAD;             /*                       @Y021130*/
         L     RTIOT,DXTIOTAD(,RCORE)                              0339
*       DCBDDNAM=TIOEDDNM;          /* GET DDNAME FROM TIOT          */
*                                                                  0340
         MVC   DCBDDNAM+40(8,RDCB),TIOEDDNM(RTIOT)                 0340
*       /*************************************************************/
*       /*                                                           */
*       /* AUDIT INDICATE IICB NO LONGER AVAILABLE           @Y021130*/
*       /*                                                           */
*       /*************************************************************/
*                                                                  0341
*       DO;                         /* MODESET EXTKEY(DATAMGT)       */
*         SPKA(80);                 /* SET PSW KEY                   */
         LA    @11,80                                              0342
         SPKA  0(@11)                                              0342
*       END;                        /* MODESET EXTKEY(DATAMGT) DATA
*                                      MGT KEY               @Y021130*/
*       IIAUDPTR=ZERO;              /* IICB NO LONGER AVAILABLE    0344
*                                                            @Y021130*/
         SLR   @11,@11                                             0344
         ST    @11,IIAUDPTR(,RCORE)                                0344
*       DO;                         /* MODESET KEYADDR(DXUKEY)       */
*         SPKA(DXUKEY);             /* SET PSW KEY                   */
         SLR   @11,@11                                             0346
         IC    @11,DXUKEY(,RCORE)                                  0346
         SPKA  0(@11)                                              0346
*       END;                        /* MODESET KEYADDR(DXUKEY) RETURN
*                                      TO USER KEY           @Y021130*/
*       RESPECIFY                                                  0348
*         RTIOT UNRESTRICTED;       /*                       @Y021130*/
*     END;                                                         0349
*   R14=RLKRETSV;                   /* RESTORE RETURN ADDRESS      0350
*                                                            @Y021130*/
@RC00311 LR    R14,RLKRETSV                                        0350
*   RESPECIFY                                                      0351
*    (RWORK2,                                                      0351
*     RLKRETSV) UNRESTRICTED;       /*                       @Y021130*/
*   RFY                                                            0352
*    (R15,                                                         0352
*     R0) UNRSTD;                   /* FREE REGS             @OY08151*/
*   END OPENACB;                                                   0353
@EL00006 DS    0H                                                  0353
@EF00006 DS    0H                                                  0353
@ER00006 BR    @14                                                 0353
*SYNCHACB:                          /*                       @OY08151*/
*/********************************************************** @OY08151*/
*/*                                                          @OY08151*/
*/* FUNCTION = ISSUE THE OPEN FOR THE ACB                    @OY08151*/
*/*                                                          @OY08151*/
*/********************************************************** @OY08151*/
*                                                                  0354
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0354
SYNCHACB DS    0H                                                  0355
*   RFY                                                            0355
*    (R0,                                                          0355
*     R1,                                                          0355
*     RWORK3,                                                      0355
*     RWORK2,                                                      0355
*     R14,                                                         0355
*     R15) RSTD;                    /* GET REGS              @OY08151*/
*   RWORK3=R14;                     /* SAVE RETURN ADDR      @OY08151*/
         LR    RWORK3,R14                                          0356
*   RWORK2=R0;                      /* GET ACB ADDR          @OY08151*/
         LR    RWORK2,R0                                           0357
*   GEN(OPEN MF=(E,(RWORK2)));      /* OPEN THE VSAM ACB     @OY08151*/
         OPEN MF=(E,(RWORK2))
*   R14=RWORK3;                     /* RESTORE RET ADDR      @OY08151*/
         LR    R14,RWORK3                                          0359
*   RFY                                                            0360
*    (RWORK3,                                                      0360
*     RWORK2) UNRSTD;               /* FREE WORK REGS        @OY08151*/
*   END SYNCHACB;                   /* END OPEN ACB RTN      @OY08151*/
@EL00007 DS    0H                                                  0361
@EF00007 DS    0H                                                  0361
@ER00007 BR    @14                                                 0361
*                                                                  0362
*/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
**                                                                    *
**   FUNCTION = DCB MERGE                                             *
**       THIS ROUTINE SIMULATES THE ISAM DCB MERGE FROM THE DD CARD   *
**       AND THE DSCB TO THE DCB.  INFORMATION THAT WAS SPECIFIED     *
**       IN THE AMP PARAMETER IS MERGED FROM THE JFCB.  II OPEN WAS   *
**       ENTERED WITH THE FOUNDATION SECTION OF THE DCB INITIALIZED   *
**       TO THE FORMAT AFTER OPEN.  ANOTHER FUNCTION IS TO SIMULATE   *
**       THE DS2NOBTY FIELD IN A FORMAT 2 DSCB TO SUPPORT ISAM        *
**       PROGRAMS THAT REFERENCE IT IN THE DCB EXIT ROUTINE.          *
**                                                                    *
**   INPUT =                                                          *
**       REGISTER 1 - RDCB - DCB POINTER                              *
**       REGISTER 2 - RIICB - IICB POINTER                            *
**       REGISTER 4 - RCORE - I/O SUPPORT WORK AREA POINTER           *
**       REGISTER 6 - RACB - ACB POINTER                              *
**                                                                    *
**   OUTPUT =                                                         *
**       REGISTERS - SAME AS ABOVE                                    *
**                                                                    *
**       CONTROL BLOCK FIELDS INITIALIZED                             *
**         DCBNCP                                                     *
**         DCBNCRNI                                                   *
**         JFCOPTCD  -->  DCBOPTCD                                    *
**         AMDWCK    -->  DCBOPTCD                                    *
**         JFCRECFM  -->  DCBRECFM                                    *
**         DS2NOBYT                                                   *
**                                                                    *
**   PROTECTION KEY = SEE BELOW                                       *
**       KEY ON ENTRY - USER KEY                                      *
**       KEY ON EXIT - USER KEY                                       *
**       INTERIM KEYS ASSUMED = NONE                                  *
**                                                                    *
**                                                                    *
** * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
*                                                                  0362
*DCBMERGE:                                                         0362
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0362
DCBMERGE DS    0H                                                  0363
*   RESPECIFY                                                      0363
*    (JFCBPTR) RESTRICTED;                                         0363
*   JFCBPTR=ADDR(DXJBF);            /* INIT JFCB PTR         @Y021130*/
         LA    JFCBPTR,DXJBF(,RCORE)                               0364
*   IF DCBRECL=BZERO THEN           /* IF RECFM NOT IN DCB MACRO     */
         LA    @08,28                                              0365
         ALR   @08,RDCB                                            0365
         TM    DCBRECL(@08),B'11000000'                            0365
         BNZ   @RF00365                                            0365
*     DO;                                                          0366
*       IF JFCRECFM=ZERO THEN       /* IF RECFM NOT IN AMP PARM      */
         CLI   JFCRECFM(JFCBPTR),0                                 0367
         BNE   @RF00367                                            0367
*         DCBRECL='01'B;            /* DEFAULT TO UNBLK VARIABLE     */
         NI    DCBRECL(@08),B'01111111'                            0368
         OI    DCBRECL(@08),B'01000000'                            0368
*       ELSE                                                       0369
*         DCBRECFM=JFCRECFM;        /* MERGE RECFM FROM AMP          */
         B     @RC00367                                            0369
@RF00367 MVC   DCBRECFM+28(1,RDCB),JFCRECFM(JFCBPTR)               0369
*       MRECFM=ON;                  /* SET MODIFICATION MASK         */
@RC00367 OI    MRECFM(RIICB),B'00001000'                           0370
*     END;                          /* MAP OPTCD FROM JFCB TO DCB    */
*   DCBOPTI=OFF;                    /* TURN OFF DCB OPTCD=I          */
@RF00365 LA    @08,52                                              0372
         ALR   @08,RDCB                                            0372
         NI    DCBOPTI(@08),B'11101111'                            0372
*   IF JFCDEL=ON×DCBOPTL=ON THEN    /* TURN OFF DCB OPTCD=I          */
         TM    JFCDEL(JFCBPTR),B'00000010'                         0373
         BO    @RT00373                                            0373
         TM    DCBOPTL(@08),B'00000010'                            0373
         BNO   @RF00373                                            0373
@RT00373 DS    0H                                                  0374
*     DO;                           /* THEN                          */
*       DCBOPTL=ON;                 /* TURN ON DCB OPTCD=L           */
         LA    @08,52                                              0375
         ALR   @08,RDCB                                            0375
         OI    DCBOPTL(@08),B'00000010'                            0375
*       IF JFCIND=ON THEN           /* IF OPTCD=I IN AMP PARM        */
         TM    JFCIND(JFCBPTR),B'00010000'                         0376
         BNO   @RF00376                                            0376
*         DCBOPTI=ON;               /* TURN ON DCB OPTCD=I           */
         OI    DCBOPTI(@08),B'00010000'                            0377
*       MOPTCD=ON;                  /* SET MODIFICATION MASK         */
@RF00376 OI    MOPTCD(RIICB),B'00010000'                           0378
*     END;                                                         0379
*   RESPECIFY                                                      0380
*     JFCBPTR UNRESTRICTED;                                        0380
@RF00373 DS    0H                                                  0381
*   IF DCBOPTW=OFF THEN             /* OPTCD=W NOT IN DCB MACRO      */
         LA    @07,52                                              0381
         ALR   @07,RDCB                                            0381
         TM    DCBOPTW(@07),B'10000000'                            0381
         BNZ   @RF00381                                            0381
*     DO;                                                          0382
*       IF AMDWCK=ON THEN           /* WRT CHK OPTION FROM DEFINE    */
         L     @05,ACBAMBL(,RACB)                                  0383
         L     @05,AMBLDTA(,@05)                                   0383
         L     @05,AMBDSB(,@05)                                    0383
         TM    AMDWCK(@05),B'01000000'                             0383
         BNO   @RF00383                                            0383
*         DCBOPTW=ON;                                              0384
         OI    DCBOPTW(@07),B'10000000'                            0384
*       MOPTCD=ON;                  /* SET MODIFICATION MASK         */
@RF00383 OI    MOPTCD(RIICB),B'00010000'                           0385
*     END;                                                         0386
*   IF(DCBMFRD=ON×                  /* IF BISAM (READ OR WRITE)      */
*       DCBMFWRT=ON)&               /* AND                           */
*       DCBNCP=ZERO THEN            /* NCP IS ZERO THEN SET          */
@RF00381 LA    @07,40                                              0387
         ALR   @07,RDCB                                            0387
         TM    DCBMFRD(@07),B'00100000'                            0387
         BO    @GL00006                                            0387
         TM    DCBMFWRT(@07),B'00100000'                           0387
         BNO   @RF00387                                            0387
@GL00006 LA    @07,52                                              0387
         ALR   @07,RDCB                                            0387
         CLI   DCBNCP(@07),0                                       0387
         BNE   @RF00387                                            0387
*     DCBNCP=ONE;                   /* NCP TO DEFAULT OF ONE         */
*                                                                  0388
         MVI   DCBNCP(@07),X'01'                                   0388
*   /*****************************************************************/
*   /*                                                               */
*   /* DCBDEBAD CONTAINS THE ADDRESS OF THE I/O SUPPORT WORK AREA TO */
*   /* ENABLE THE DCB EXIT ROUTINE TO REFERENCE THE F2 DSCB. DS2NOBYT*/
*   /* AND DCBNCRHI ARE BOTH DEFINED AS THE NUMBER OF BYTES NEEDED TO*/
*   /* HOLD THE HIGHEST LEVEL INDEX IN MAIN STORAGE. SINCE THIS FIELD*/
*   /* IS NOT USED BY THE ISAM INTER- FACE OR VSAM IT IS INITIALIZED */
*   /* TO SUPPORT PL/I AND OTHER PROGRAMS THAT REFERENCE IT AT DCB   */
*   /* EXIT TIME. THESE FIELDS ARE SET TO A LOW VALUE RATHER THAN    */
*   /* ZERO TO PREVENT A GETMAIN FAILURE IN THE ISAM PROBLEM PROGRAM */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0389
*   DCBNCRHI=EIGHT;                 /* INIT DCB                      */
@RF00387 MVC   DCBNCRHI+52(2,RDCB),@CH00045                        0389
*   END DCBMERGE;                                                  0390
@EL00008 DS    0H                                                  0390
@EF00008 DS    0H                                                  0390
@ER00008 BR    @14                                                 0390
*                                                                  0391
*/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
**                                                                    *
**   FUNCTION = AMS MERGE                                             *
**       THIS ROUTINE MERGES THE DATA SET ATTRIBUTES FROM THE AMDSB   *
**       TO THE DCB WHEN THE CORRESPONDING DCB FIELD IS ZERO. THESE   *
**       ARE THE CHARACTERISTICS THAT WERE USED WHEN DEFINING THE     *
**       VSAM DATA SET WITH AMS.  WHEN PROCESSING WITH ISAM, THESE    *
**       FIELDS MAY BE SPECIFIED IN THE ISAM DCB EXIT ROUTINE FOR     *
**       LOAD MODE.  FOR SCAN MODE AND BISAM, THEY ARE MERGED FROM    *
**       THE DSCB TO THE DCB.  HOWEVER, THIS MERGE MUST TAKE PLACE    *
**       PRIOR TO THE DCB EXIT TO SUPPORT PL/I.                       *
**                                                                    *
**   INPUT =                                                          *
**       REGISTER 1 - RDCB - DCB POINTER                              *
**       REGISTER 2 - RIICB - IICB POINTER                            *
**       REGISTER 6 - RACB - ACB POINTER                              *
**                                                                    *
**   OUTPUT =                                                         *
**       REGISTERS - SAME AS ABOVE                                    *
**                                                                    *
**       CONTROL BLOCK FIELDS INITIALIZED                             *
**         DCBLRECL  -->  DCBBLKSI                                    *
**         AMDKEYLN  -->  DCBKEYLE                                    *
**         AMDLRECL  -->  DCBLRECL                                    *
**         AMDRKP    -->  DCBRKP                                      *
**                                                                    *
**   PROTECTION KEY = SEE BELOW                                       *
**       KEY ON ENTRY - USER KEY                                      *
**       KEY ON EXIT - USER KEY                                       *
**       INTERIM KEYS ASSUMED = NONE                                  *
**                                                                    *
**                                                                    *
** * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
*                                                                  0391
*AMSMERGE:                                                         0391
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0391
*                                                                  0391
AMSMERGE DS    0H                                                  0392
*   /*****************************************************************/
*   /*                                                               */
*   /* PL/I REQUIRES THAT KEYLE AND RKP BE SPECIFIED IN THE DD. IF   */
*   /* THESE FIELDS ARE NOT MERGED PRIOR TO THE DCB EXIT THE KEYLE   */
*   /* GETS SET TO 1 IN THE DCB EXIT.                                */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0392
*   IF DCBKEYLE=ZERO THEN           /* IF KEYLE NOT IN DCB MACRO     */
         LA    @07,16                                              0392
         ALR   @07,RDCB                                            0392
         CLI   DCBKEYLE(@07),0                                     0392
         BNE   @RF00392                                            0392
*     DO;                                                          0393
*       DCBKEYLE=AMDKEYLN;          /* KEYLE FROM AMS DEFINE         */
         L     @05,ACBAMBL(,RACB)                                  0394
         L     @05,AMBLDTA(,@05)                                   0394
         L     @05,AMBDSB(,@05)                                    0394
         LH    @05,AMDKEYLN(,@05)                                  0394
         STC   @05,DCBKEYLE(,@07)                                  0394
*       MKEYLE=ON;                  /* SET MODIFICATION MASK         */
         OI    MKEYLE(RIICB),B'00000001'                           0395
*     END;                                                         0396
*   IF DCBRKP=ZERO THEN             /* IF RKP NOT IN DCB MACRO       */
@RF00392 LA    @07,52                                              0397
         ALR   @07,RDCB                                            0397
         LH    @05,DCBRKP(,@07)                                    0397
         LTR   @05,@05                                             0397
         BNZ   @RF00397                                            0397
*     DO;                                                          0398
*       DCBRKP=AMDRKP;              /* RKP FROM AMS DEFINE           */
         L     @05,ACBAMBL(,RACB)                                  0399
         L     @05,AMBLDTA(,@05)                                   0399
         L     @05,AMBDSB(,@05)                                    0399
         LH    @05,AMDRKP(,@05)                                    0399
         STH   @05,DCBRKP(,@07)                                    0399
*       MRKP=ON;                    /* SET MODIFICATION MASK         */
         OI    MRKP(RIICB),B'10000000'                             0400
*       IF DCBRECL='01'B THEN       /* IF VARIABLE LENGTH RECORDS    */
         TM    DCBRECL+28(RDCB),B'01000000'                        0401
         BNO   @RF00401                                            0401
         TM    DCBRECL+28(RDCB),B'10000000'                        0401
         BNZ   @RF00401                                            0401
*         DCBRKP=DCBRKP+4;          /* ADD 4 TO RKP FOR RDW          */
         AL    @05,@CF00199                                        0402
         STH   @05,DCBRKP(,@07)                                    0402
*     END;                                                         0403
*                                                                  0403
@RF00401 DS    0H                                                  0404
*   /*****************************************************************/
*   /*                                                               */
*   /* LRECL AND BLKSIZE ARE MERGED PRIOR TO TAKING THE DCB EXIT     */
*   /* BECAUSE PL/I REQUIRES BLKSIZE, LRECL (REQUIRED FOR BLOCKED    */
*   /* RECORDS) AND RECFM TO BE SPECIFIED TOGETHER IN EITHER THE DD  */
*   /* CARD OR THE ENVIRON ATTRIBUTE. IF THESE ATTRIBUTES ARE NOT    */
*   /* MERGED THEN PL/I DEFAULTS TO 125 BYTES                        */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0404
*   IF DCBLRECL=ZERO THEN           /* IF LRECL NOT IN DCB MACRO     */
@RF00397 SLR   @07,@07                                             0404
         LA    @05,52                                              0404
         ALR   @05,RDCB                                            0404
         CH    @07,DCBLRECL(,@05)                                  0404
         BNE   @RF00404                                            0404
*     DO;                                                          0405
*       DCBLRECL=AMDLRECL;          /* LRECL FROM AMS DEFINE         */
         L     @03,ACBAMBL(,RACB)                                  0406
         L     @03,AMBLDTA(,@03)                                   0406
         L     @03,AMBDSB(,@03)                                    0406
         L     @03,AMDLRECL(,@03)                                  0406
         STH   @03,DCBLRECL(,@05)                                  0406
*       MLRECL=ON;                  /* SET MODIFICATION MASK         */
         OI    MLRECL(RIICB),B'01000000'                           0407
*       IF DCBRECL='10'B&           /* IF FIXED LENGTH RECORDS       */
*           DCBRECBR=OFF&           /* UNBLOCKED AND                 */
*           DCBRKP=ZERO THEN        /* RKP = 0 THEN SUB KEYLENGTH TO
*                                      LRECL                         */
         LA    @11,28                                              0408
         ALR   @11,RDCB                                            0408
         TM    DCBRECL(@11),B'10000000'                            0408
         BNO   @RF00408                                            0408
         TM    DCBRECL(@11),B'01000000'                            0408
         BNZ   @RF00408                                            0408
         TM    DCBRECBR(@11),B'00010000'                           0408
         BNZ   @RF00408                                            0408
         CH    @07,DCBRKP(,@05)                                    0408
         BNE   @RF00408                                            0408
*         DCBLRECL=DCBLRECL-DCBKEYLE;                              0409
         SLR   @07,@07                                             0409
         IC    @07,DCBKEYLE+16(,RDCB)                              0409
         SLR   @03,@07                                             0409
         STH   @03,DCBLRECL(,@05)                                  0409
*       IF DCBRECL='01'B THEN       /* IF VARIABLE LENGTH RECORDS    */
@RF00408 TM    DCBRECL+28(RDCB),B'01000000'                        0410
         BNO   @RF00410                                            0410
         TM    DCBRECL+28(RDCB),B'10000000'                        0410
         BNZ   @RF00410                                            0410
*         DCBLRECL=DCBLRECL+4;      /* ADD 4 TO LRECL FOR RDW        */
         LA    @07,52                                              0411
         ALR   @07,RDCB                                            0411
         LA    @05,4                                               0411
         AH    @05,DCBLRECL(,@07)                                  0411
         STH   @05,DCBLRECL(,@07)                                  0411
*     END;                                                         0412
@RF00410 DS    0H                                                  0413
*   IF DCBBLKSI=ZERO THEN           /* IF BLKSI NOT IN DCB MACRO     */
@RF00404 LA    @07,52                                              0413
         ALR   @07,RDCB                                            0413
         LH    @05,DCBBLKSI(,@07)                                  0413
         LTR   @05,@05                                             0413
         BNZ   @RF00413                                            0413
*     DO;                                                          0414
*       DCBBLKSI=DCBLRECL;          /* SET BLKSI TO COMPUTED LEN     */
         LH    @05,DCBLRECL(,@07)                                  0415
         STH   @05,DCBBLKSI(,@07)                                  0415
*       MBLKSI=ON;                  /* SET MODIFICATION MASK         */
         OI    MBLKSI(RIICB),B'00100000'                           0416
*       IF DCBRECL='01'B THEN       /* IF VARIABLE LENGTH RECORDS    */
         TM    DCBRECL+28(RDCB),B'01000000'                        0417
         BNO   @RF00417                                            0417
         TM    DCBRECL+28(RDCB),B'10000000'                        0417
         BNZ   @RF00417                                            0417
*         DCBBLKSI=DCBBLKSI+4;      /* ADD 4 TO BLKSIZE FOR RDW      */
         AL    @05,@CF00199                                        0418
         STH   @05,DCBBLKSI(,@07)                                  0418
*     END;                                                         0419
*   END AMSMERGE;                                                  0420
@EL00009 DS    0H                                                  0420
@EF00009 DS    0H                                                  0420
@ER00009 BR    @14                                                 0420
*                                                                  0421
*/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
**                                                                    *
**   FUNCTION = DCB EXIT                                              *
**       THIS ROUTINE GIVES CONTROL TO THE ISAM DCB EXIT ROUTINE      *
**       IF ONE IS SPECIFIED IN THE DCB EXIT LIST.  REGISTERS ARE     *
**       SAVED IN THE SVRB BEFORE ISSUING A SYNCH TO GIVE THE EXIT    *
**       ROUTINE CONTROL.                                             *
**                                                                    *
**   INPUT =                                                          *
**       REGISTER 1 - RDCB - DCB POINTER                              *
**       REGISTER 2 - RIICB - IICB POINTER                            *
**       REGISTER 4 - RCORE - I/O SUPPORT WORK AREA POINTER           *
**                                                                    *
**   OUTPUT =                                                         *
**       REGISTERS - SAME AS ABOVE                                    *
**                                                                    *
**   PROTECTION KEY = SEE BELOW                                       *
**       KEY ON ENTRY - USER KEY                                      *
**       KEY ON EXIT - USER KEY                                       *
**       INTERIM KEYS ASSUMED = DATA MANAGEMENT KEY 5                 *
**                              SYSTEM KEY 0                          *
**                                                                    *
** * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
*                                                                  0421
*DCBEXIT:                                                          0421
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0421
DCBEXIT  DS    0H                                                  0422
*   RESPECIFY                                                      0422
*    (R15,                                                         0422
*     RLKRETSV,                                                    0422
*     RWORK2) RESTRICTED;                                          0422
*   RLKRETSV=R14;                   /* SAVE RETURN ADDR      @Y021130*/
         LR    RLKRETSV,R14                                        0423
*   IIFTEST=OFF;                                                   0424
         NI    IIFTEST(RIICB),B'11111011'                          0424
*   IF DCBEXLSA^=ZERO THEN          /* IF EXIT LIST IS PROVIDED      */
         L     @11,DCBEXLSA+27(,RDCB)                              0425
         LA    @11,0(,@11)                                         0425
         LTR   @11,@11                                             0425
         BZ    @RF00425                                            0425
*     DO RWORK2=DCBEXLSA BY LENGTH(EXLST) WHILE IIFTEST=OFF;       0426
         LR    RWORK2,@11                                          0426
         B     @DE00426                                            0426
@DL00426 DS    0H                                                  0427
*       IF EXCODE=EXDCB×            /* IF DCB EXIT FOUND,            */
*           EXCODE=EXDCBL THEN      /* PASS CONTROL                  */
         CLI   EXCODE(RWORK2),B'00000101'                          0427
         BE    @RT00427                                            0427
         CLI   EXCODE(RWORK2),B'10000101'                          0427
         BNE   @RF00427                                            0427
@RT00427 DS    0H                                                  0428
*         DO;                                                      0428
*           R15=EXADDR;             /* GET ADDR OF USER EXIT         */
         L     R15,EXADDR-1(,RWORK2)                               0429
         LA    R15,0(,R15)                                         0429
*           R14=ADDR(SVRB);         /* GET ADDR OF SVRB              */
         L     @11,CVTPTR                                          0430
         L     @11,CVTTCBDW(,@11)                                  0430
         L     @11,TCBPTR(,@11)                                    0430
         L     R14,SVRBPTR(,@11)                                   0430
*           DO;                     /* MODESET EXTKEY(ZERO)          */
*             SPKA(0);              /* SET PSW KEY                   */
         SLR   @11,@11                                             0432
         SPKA  0(@11)                                              0432
*           END;                    /* MODESET EXTKEY(ZERO) KEY ZERO
*                                      FOR STORE INTO SVRB   @Y021130*/
*                                                                  0433
*           /*********************************************************/
*           /*                                                       */
*           /* DCBDEBAD CONTAINS THE ADDRESS OF THE I/O SUPPORT WORK */
*           /* AREA TO ENABLE THE DCB EXIT ROUTINE TO REF- ERENCE THE*/
*           /* FORMAT 2 DSCB.                                @Y021130*/
*           /* DSCCORE (THE POINTER TO THE FORMAT 2 DSCB FOR ISAM) IS*/
*           /* INITIALIZED TO POINT TO HEX 40 BYTES BEFORE THE DCB   */
*           /* FIELD DCBNCHRI. THIS WILL SUPPORT THE FIELD DS2NOBYT  */
*           /* WHICH IS IN THE FORMAT 2 DSCB AT AN OFFSET OF HEX 40  */
*           /* BYTES BY MAKING THE OFF- SET TO DS2NOBYT COINCIDE WITH*/
*           /* THE FIELD DCBNCHRI. DCBNCHRI WAS INITIALIZED IN THE   */
*           /* ROUTINE DCBMERGE.                                     */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0434
*           DSCCORE=ADDR(DCBESETL)+2;/* SIMULATE THE F2 DSCB POINTER
*                                      FOR REFERENCE TO DS2NOBYT   0434
*                                                            @Y021130*/
         LA    @11,DCBESETL+52(,RDCB)                              0434
         AL    @11,@CF00098                                        0434
         ST    @11,DSCCORE(,RCORE)                                 0434
*           GEN SETS(XRBXSAV);                                     0435
*                                       /*                   @Y021130*/
                 STM R2,R13,XRBXSAV(R14)   SAVE REGS-EXTENDED SAVE A
*           DO;                     /* MODESET KEYADDR(DXUKEY)       */
*             SPKA(DXUKEY);         /* SET PSW KEY                   */
         SLR   @11,@11                                             0437
         IC    @11,DXUKEY(,RCORE)                                  0437
         SPKA  0(@11)                                              0437
*           END;                    /* MODESET KEYADDR(DXUKEY) USER
*                                      KEY FOR EXIT          @Y021130*/
*                                                                  0438
*           /*********************************************************/
*           /*                                                       */
*           /* AUDIT DCB EXIT IS BEING TAKEN                 @Y021130*/
*           /*                                                       */
*           /*********************************************************/
*                                                                  0439
*           AUDDCBEX=ON;            /* SET FLAG IN IICB      @Y021130*/
         OI    AUDDCBEX(RIICB),B'00100000'                         0439
*           GEN REFS(XRBREG);                                      0440
*                                       /*                   @Y021130*/
                 LM  R2,R13,XRBREG+8(R14)  RELOAD USER REGS
*           DCBOFUEX=OFF;           /* TURN ON DCB LOCK BIT (0)      */
         NI    DCBOFUEX+40(RDCB),B'11111101'                       0441
*           GEN(SYNCH (15));        /* GO TO USER DCB EXIT           */
         SYNCH (15)
*           R14=ADDR(SVRB);         /* FIND SVRB AGAIN RELOAD REGS   */
         L     @11,CVTPTR                                          0443
         L     @11,CVTTCBDW(,@11)                                  0443
         L     @11,TCBPTR(,@11)                                    0443
         L     R14,SVRBPTR(,@11)                                   0443
*           GEN REFS(XRBXSAV);                                     0444
                 LM  R2,R13,XRBXSAV(R14)
*           DO;                     /* MODESET EXTKEY(DATAMGT)       */
*             SPKA(80);             /* SET PSW KEY                   */
         LA    @11,80                                              0446
         SPKA  0(@11)                                              0446
*           END;                    /* MODESET EXTKEY(DATAMGT) ASSUME
*                                      DATA MANAGEMENT KEY   @Y021130*/
*           DSCCORE=ZERO;           /* RESET F2 DSCB POINTER TO ZERO
*                                                            @Y021130*/
         SLR   @11,@11                                             0448
         ST    @11,DSCCORE(,RCORE)                                 0448
*           DO;                     /* MODESET KEYADDR(DXUKEY)       */
*             SPKA(DXUKEY);         /* SET PSW KEY                   */
         SLR   @11,@11                                             0450
         IC    @11,DXUKEY(,RCORE)                                  0450
         SPKA  0(@11)                                              0450
*           END;                    /* MODESET KEYADDR(DXUKEY) USER
*                                      KEY FOR EXIT          @Y021130*/
*                                                                  0451
*           /*********************************************************/
*           /*                                                       */
*           /* AUDIT THAT DCB EXIT HAS RETURNED              @Y021130*/
*           /*                                                       */
*           /*********************************************************/
*                                                                  0452
*           AUDDCBRT=ON;            /* SET FLAG IN IICB      @Y021130*/
         OI    AUDDCBRT(RIICB),B'00010000'                         0452
*           RDCB=DXUDCBAD;          /* RESTORE DCB PTR       @Y021130*/
         L     RDCB,DXUDCBAD(,RCORE)                               0453
*           DCBOFUEX=ON;            /* TURN OFF DCB LOCK BIT (1)   0454
*                                                            @Y021130*/
         OI    DCBOFUEX+40(RDCB),B'00000010'                       0454
*         END;                      /* NO DCB EXIT IN EXLST          */
*       IF EXLAST=ON THEN           /* IF LAST ENTRY                 */
@RF00427 TM    EXLAST(RWORK2),B'10000000'                          0456
         BNO   @RF00456                                            0456
*         IIFTEST=ON;               /* STOP SEARCHING                */
         OI    IIFTEST(RIICB),B'00000100'                          0457
*     END;                                                         0458
@RF00456 AL    RWORK2,@CF00199                                     0458
@DE00426 TM    IIFTEST(RIICB),B'00000100'                          0458
         BZ    @DL00426                                            0458
*   R14=RLKRETSV;                   /* RESTORE RETURN ADDRESS      0459
*                                                            @Y021130*/
@RF00425 LR    R14,RLKRETSV                                        0459
*   RESPECIFY                                                      0460
*    (R15,                                                         0460
*     RLKRETSV,                                                    0460
*     RWORK2) UNRESTRICTED;                                        0460
*   END DCBEXIT;                                                   0461
@EL00010 DS    0H                                                  0461
@EF00010 DS    0H                                                  0461
@ER00010 BR    @14                                                 0461
*                                                                  0462
*/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
**                                                                    *
**   FUNCTION = VALIDITY CHECK                                        *
**       THIS ROUTINE VALIDITY CHECKS THE DATA SET ATTRIBUTES THAT    *
**       WERE SPECIFIED WHEN THE VSAM DATA SET WAS DEFINED BY AMS.    *
**       THIS CHECK WILL BE PERFORMED BY COMPARING THE VALUES FOR     *
**       KEYLE, RKP AND LRECL IN THE DCB WITH THE CORRESPONDING       *
**       FIELDS IN THE VSAM AMDSB.  THIS COMPARE IS UNABLE TO DETECT  *
**       AMS DEFINE ERRORS IF THESE FIELDS WERE SPECIFIED IN THE DD   *
**       CARD WHEN ISAM WAS USED.  THIS ROUTINE WILL ABEND IF THE     *
**       ABOVE VALIDITY CHECK FAILS OR IF DISP=OLD IS SPECIFIED WHEN  *
**       THE DCB IS OPENED FOR OUTPUT (LOAD MODE) SINCE THE ISAM      *
**       INTERFACE DOES NOT SUPPORT RELOADING THE DATA SET.           *
**                                                                    *
**   INPUT =                                                          *
**       REGISTER 1 - RDCB - DCB POINTER                              *
**       REGISTER 4 - RCORE - I/O SUPPORT WORK AREA POINTER           *
**       REGISTER 6 - RACB - ACB POINTER                              *
**                                                                    *
**   OUTPUT =                                                         *
**       SAME AS ABOVE                                                *
**       ABEND 03B - ERROR                                            *
**                                                                    *
**   PROTECTION KEY = SEE BELOW                                       *
**       KEY ON ENTRY - USER KEY                                      *
**       KEY ON EXIT - USER KEY                                       *
**       INTERIM KEYS ASSUMED = NONE                                  *
**                                                                    *
** * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
*                                                                  0462
*VALIDCHK:                                                         0462
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0462
VALIDCHK DS    0H                                                  0463
*   RESPECIFY                                                      0463
*    (JFCBPTR) RESTRICTED;                                         0463
*   JFCBPTR=ADDR(DXJBF);            /* INIT JFCB POINTER     @Y021130*/
         LA    JFCBPTR,DXJBF(,RCORE)                               0464
*   IF JFCDISP='01'B&               /* IF DISP = OLD AND             */
*       AMDNLR>ZERO&                /* DATA SET CONTAINS RECORDS     */
*       (DCBMFMVP=ON×               /* AND LOAD MODE (PUT MOVE       */
*       DCBMFLCP=ON) THEN           /* OR PUT LOCATE)                */
         TM    JFCDISP(JFCBPTR),B'01000000'                        0465
         BNO   @RF00465                                            0465
         TM    JFCDISP(JFCBPTR),B'10000000'                        0465
         BNZ   @RF00465                                            0465
         L     @15,ACBAMBL(,RACB)                                  0465
         L     @15,AMBLDTA(,@15)                                   0465
         L     @15,AMBDSB(,@15)                                    0465
         L     @15,AMDNLR(,@15)                                    0465
         LTR   @15,@15                                             0465
         BNP   @RF00465                                            0465
         TM    DCBMFMVP+40(RDCB),B'00011000'                       0465
         BNZ   @RT00465                                            0465
*     GO TO EXIT3B;                 /* THEN ABEND BECAUSE RELOAD IS
*                                      NOT SUPPORTED                 */
*   RESPECIFY                                                      0467
*    (JFCBPTR) UNRESTRICTED;                                       0467
@RF00465 DS    0H                                                  0468
*   IF DCBKEYLE=AMDKEYLN&           /* IF KEY LENGTH IS OK CHECK   0468
*                                      RELATIVE KEY POSITN           */
*       ((DCBRECL='10'B&            /* RKP IS OK IF IT IS THE        */
*       AMDRKP=DCBRKP)×             /* SAME FOR FIXED LENGTH RCDS    */
*       (DCBRECL='01'B&             /* OR 4 HAS BEEN SUBTRACTED      */
*       AMDRKP=DCBRKP-4))&          /* FOR VARIABLE LENGTH RECDS   0468
*                                      CHECK LOGICAL RECORD LEN      */
*       (DCBRECL='10'B&             /* LRECL IS OK IF KEY LENGTH     */
*       (DCBRECBR=OFF&              /* HAS BEEN ADDED FOR FIXED,     */
*       (DCBRKP=ZERO&               /* UNBLKD, RKP=0 RECORDS OR      */
*       AMDLRECL=DCBLRECL+DCBKEYLE)×(DCBRKP>ZERO&/* LRECL IS THE SAME
*                                      FOR                           */
*       AMDLRECL=DCBLRECL))×        /* FIXED, UNBLKD, RKP>0 OR       */
*       (DCBRECBR=ON&               /* LRECL IS THE SAME FOR         */
*       AMDLRECL=DCBLRECL))×        /* FIXED, BLOCKED RECORDS OR     */
*       (DCBRECL='01'B&             /* 4 HAS BEEN SUBTRACTED FOR     */
*       AMDLRECL=DCBLRECL-4) THEN   /* VARIABLE LENGTH RECORDS       */
         L     @15,ACBAMBL(,RACB)                                  0468
         L     @15,AMBLDTA(,@15)                                   0468
         L     @15,AMBDSB(,@15)                                    0468
         SLR   @07,@07                                             0468
         IC    @07,DCBKEYLE+16(,RDCB)                              0468
         CH    @07,AMDKEYLN(,@15)                                  0468
         BNE   @GL00013                                            0468
         TM    DCBRECL+28(RDCB),B'10000000'                        0468
         BNO   @GL00016                                            0468
         TM    DCBRECL+28(RDCB),B'01000000'                        0468
         BNZ   @GL00016                                            0468
         CLC   AMDRKP(2,@15),DCBRKP+52(RDCB)                       0468
         BE    @GL00014                                            0468
@GL00016 TM    DCBRECL+28(RDCB),B'01000000'                        0468
         BNO   @GL00013                                            0468
         TM    DCBRECL+28(RDCB),B'10000000'                        0468
         BNZ   @GL00013                                            0468
         L     @15,ACBAMBL(,RACB)                                  0468
         L     @15,AMBLDTA(,@15)                                   0468
         L     @15,AMBDSB(,@15)                                    0468
         LH    @07,DCBRKP+52(,RDCB)                                0468
         SL    @07,@CF00199                                        0468
         CH    @07,AMDRKP(,@15)                                    0468
         BNE   @GL00013                                            0468
@GL00014 LA    @15,28                                              0468
         ALR   @15,RDCB                                            0468
         TM    DCBRECL(@15),B'10000000'                            0468
         BNO   @GL00019                                            0468
         TM    DCBRECL(@15),B'01000000'                            0468
         BNZ   @GL00019                                            0468
         TM    DCBRECBR(@15),B'00010000'                           0468
         BNZ   @GL00021                                            0468
         LA    @15,52                                              0468
         ALR   @15,RDCB                                            0468
         LH    @07,DCBRKP(,@15)                                    0468
         LTR   @07,@07                                             0468
         BNZ   @GL00021                                            0468
         L     @07,ACBAMBL(,RACB)                                  0468
         L     @07,AMBLDTA(,@07)                                   0468
         L     @07,AMBDSB(,@07)                                    0468
         SLR   @05,@05                                             0468
         IC    @05,DCBKEYLE+16(,RDCB)                              0468
         AH    @05,DCBLRECL(,@15)                                  0468
         C     @05,AMDLRECL(,@07)                                  0468
         BE    @RT00468                                            0468
@GL00021 LA    @15,52                                              0468
         ALR   @15,RDCB                                            0468
         LH    @07,DCBRKP(,@15)                                    0468
         LTR   @07,@07                                             0468
         BNP   @GL00019                                            0468
         L     @07,ACBAMBL(,RACB)                                  0468
         L     @07,AMBLDTA(,@07)                                   0468
         L     @07,AMBDSB(,@07)                                    0468
         L     @07,AMDLRECL(,@07)                                  0468
         CH    @07,DCBLRECL(,@15)                                  0468
         BE    @RT00468                                            0468
@GL00019 TM    DCBRECBR+28(RDCB),B'00010000'                       0468
         BNO   @GL00013                                            0468
         L     @15,ACBAMBL(,RACB)                                  0468
         L     @15,AMBLDTA(,@15)                                   0468
         L     @15,AMBDSB(,@15)                                    0468
         L     @15,AMDLRECL(,@15)                                  0468
         CH    @15,DCBLRECL+52(,RDCB)                              0468
         BE    @RT00468                                            0468
@GL00013 TM    DCBRECL+28(RDCB),B'01000000'                        0468
         BNO   @RF00468                                            0468
         TM    DCBRECL+28(RDCB),B'10000000'                        0468
         BNZ   @RF00468                                            0468
         L     @15,ACBAMBL(,RACB)                                  0468
         L     @15,AMBLDTA(,@15)                                   0468
         L     @15,AMBDSB(,@15)                                    0468
         LH    @07,DCBLRECL+52(,RDCB)                              0468
         SL    @07,@CF00199                                        0468
         C     @07,AMDLRECL(,@15)                                  0468
         BE    @RT00468                                            0468
*     GO TO ENDCHECK;               /* KEYLE, LRECL & RKP ARE OK     */
*   ELSE                                                           0470
*     DO;                                                          0470
@RF00468 DS    0H                                                  0471
*EXIT3B:                                                           0471
*       DO;                         /* ABEND(ABEND3B) DUMP SYSTEM    */
EXIT3B   DS    0H                                                  0472
*         RESPECIFY                                                0472
*          (GPR01F) RESTRICTED;                                    0472
*         GPR01F=((ABEND3B)&'00000FFF'X)*4096;/* COMP CODE IN BITS 0473
*                                      8-19                          */
         L     GPR01F,@CF02487                                     0473
*         GPR01F=GPR01F×'80000000'X;/* DUMP/STEP/DUMPOPTS FLAG       */
         O     GPR01F,@CF02428                                     0474
*         SVC(13);                  /* ISSUE ABEND SVC               */
         SVC   13                                                  0475
*         RESPECIFY                                                0476
*          (GPR01F) UNRESTRICTED;                                  0476
*       END;                        /* ABEND(ABEND3B) DUMP SYSTEM  0477
*                                      X'03B' - ISSUE ABEND  @Y021130*/
*     END;                                                         0478
*ENDCHECK:                                                         0479
*   END VALIDCHK;                                                  0479
@EL00011 DS    0H                                                  0479
@EF00011 DS    0H                                                  0479
@ER00011 BR    @14                                                 0479
*                                                                  0480
*/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
**                                                                    *
**   FUNCTION = BUFFER MERGE                                          *
**       THIS ROUTINE MERGES THE BUFFER RELATED FIELDS TO THE DCB     *
**       FIELDS THAT ARE ZERO.                                        *
**                                                                    *
**   INPUT =                                                          *
**       REGISTER 1 - RDCB - DCB POINTER                              *
**       REGISTER 2 - RIICB - IICB POINTER                            *
**       REGISTER 6 - RACB - ACB POINTER                              *
**                                                                    *
**   OUTPUT =                                                         *
**       REGISTERS - SAME AS ABOVE                                    *
**       CONTROL BLOCK FIELDS INITIALIZED                             *
**         DCBFA                                                      *
**         DCBUFNO                                                    *
**         DCBBUFL                                                    *
**         AMBLNST   -->  DCBBUFNO                                    *
**         IIBUFL                                                     *
**         IIBUFNO                                                    *
**                                                                    *
**   PROTECTION KEY = SEE BELOW                                       *
**       KEY ON ENTRY - USER KEY                                      *
**       KEY ON EXIT - USER KEY                                       *
**       INTERIM KEYS ASSUMED = NONE                                  *
**                                                                    *
** * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
*                                                                  0480
*BFRMERGE:                                                         0480
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0480
BFRMERGE DS    0H                                                  0481
*   IF DCBBFA=BZERO THEN            /* BFALN NOT IN DCB MACRO        */
         LA    @15,28                                              0481
         ALR   @15,RDCB                                            0481
         TM    DCBBFA(@15),B'00000011'                             0481
         BNZ   @RF00481                                            0481
*     DO;                                                          0482
*       MBFALN=ON;                  /* SET DEB MODIFICATION MASK     */
         OI    MBFALN(RIICB),B'10000000'                           0483
*       DCBBFA='10'B;               /* DEFAULT TO DOUBLEWORD         */
         NI    DCBBFA(@15),B'11111110'                             0484
         OI    DCBBFA(@15),B'00000010'                             0484
*     END;                                                         0485
*   IIBUFNO=CMBNST;                 /* II BUFFER NO = STRING NO    0486
*                                                            @Z30SSRL
*                                      IF QISAM                      */
@RF00481 L     @15,ACBAMBL(,RACB)                                  0486
         L     @15,AMBLCMB(,@15)                                   0486
         IC    @07,CMBNST(,@15)                                    0486
         STC   @07,IIBUFNO(,RIICB)                                 0486
*   IF DCBMFGET=ON×DCBMFPUT=ON THEN                                0487
         LA    @15,40                                              0487
         ALR   @15,RDCB                                            0487
         TM    DCBMFGET(@15),B'01000000'                           0487
         BO    @RT00487                                            0487
         TM    DCBMFPUT(@15),B'01000000'                           0487
         BNO   @RF00487                                            0487
@RT00487 DS    0H                                                  0488
*     DO;                                                          0488
*       IIBUFNO=ONE;                /* INIT II BUFFER NUMBER         */
         MVI   IIBUFNO(RIICB),X'01'                                0489
*       IF DCBBUFCA=ONE THEN        /* IF BUFFERS HAVE NOT BEEN      */
         LA    @15,16                                              0490
         ALR   @15,RDCB                                            0490
         CLC   DCBBUFCA(3,@15),@CF00087+1                          0490
         BNE   @RF00490                                            0490
*         DCBBUFNO=ONE;             /* SUPPLIED, SET BUFNO=ONE       */
         MVI   DCBBUFNO(@15),X'01'                                 0491
*     END;                                                         0492
@RF00490 DS    0H                                                  0493
*   IF DCBBUFNO=ZERO THEN           /* IF BUFNO NOT IN DCB MACRO     */
@RF00487 LA    @15,16                                              0493
         ALR   @15,RDCB                                            0493
         CLI   DCBBUFNO(@15),0                                     0493
         BNE   @RF00493                                            0493
*     DO;                                                          0494
*       DCBBUFNO=IIBUFNO;           /* SET BUFNO TO II BUFFER NO     */
         IC    @07,IIBUFNO(,RIICB)                                 0495
         STC   @07,DCBBUFNO(,@15)                                  0495
*       MBUFNO=ON;                  /* SET MODIFICATION MASK         */
         OI    MBUFNO(RIICB),B'00000010'                           0496
*     END;                                                         0497
*   IF AMDLRECL>DCBLRECL THEN       /* SET II BUFFER LENGTH TO       */
@RF00493 L     @15,ACBAMBL(,RACB)                                  0498
         L     @15,AMBLDTA(,@15)                                   0498
         L     @15,AMBDSB(,@15)                                    0498
         L     @15,AMDLRECL(,@15)                                  0498
         CH    @15,DCBLRECL+52(,RDCB)                              0498
         BNH   @RF00498                                            0498
*     IIBUFL=AMDLRECL;              /* THE GREATER VALUE OF          */
         STH   @15,IIBUFL(,RIICB)                                  0499
*   ELSE                                                           0500
*     IIBUFL=DCBLRECL;              /* AMDLRECL OR DCBLRECL          */
         B     @RC00498                                            0500
@RF00498 LH    @15,DCBLRECL+52(,RDCB)                              0500
         STH   @15,IIBUFL(,RIICB)                                  0500
*   IIMAXLRL=IIBUFL;                /* SAVE MAXIMUM LOGICAL REC    0501
*                                      LENGTH                @Y021130*/
@RC00498 LH    @15,IIBUFL(,RIICB)                                  0501
         STH   @15,IIMAXLRL(,RIICB)                                0501
*   RESPECIFY                                                      0502
*     RWORK2 RESTRICTED;                                           0502
*   RWORK2=IIBUFL;                  /* RECORD LENGTH         @YM05335*/
         LR    RWORK2,@15                                          0503
*   RWORK2=((RWORK2+7)/8)*8;        /* ROUND TO MULTIPLE OF 8      0504
*                                                            @YM05335*/
         LA    @15,8                                               0504
         LA    @08,7                                               0504
         ALR   @08,RWORK2                                          0504
         SRDA  @08,32                                              0504
         DR    @08,@15                                             0504
         SLA   @09,3                                               0504
         LR    RWORK2,@09                                          0504
*   IIBUFL=RWORK2;                  /* BUFFER LENGTH         @YM05335*/
         STH   RWORK2,IIBUFL(,RIICB)                               0505
*   RESPECIFY                                                      0506
*     RWORK2 UNRESTRICTED;                                         0506
*   IF DCBBFA='01'B THEN            /* IF FULLWORD ALIGNMENT         */
         TM    DCBBFA+28(RDCB),B'00000001'                         0507
         BNO   @RF00507                                            0507
         TM    DCBBFA+28(RDCB),B'00000010'                         0507
         BNZ   @RF00507                                            0507
*     IIBUFL=IIBUFL+8;              /* ADD 8 BYTES                   */
         LH    @07,IIBUFL(,RIICB)                                  0508
         ALR   @07,@15                                             0508
         STH   @07,IIBUFL(,RIICB)                                  0508
*   IF DCBMFRD=ON×                  /* IF BISAM              @YM05335*/
*       DCBMFWRT=ON THEN            /* THEN ADD 16 BYTES     @YM05335*/
@RF00507 LA    @15,40                                              0509
         ALR   @15,RDCB                                            0509
         TM    DCBMFRD(@15),B'00100000'                            0509
         BO    @RT00509                                            0509
         TM    DCBMFWRT(@15),B'00100000'                           0509
         BNO   @RF00509                                            0509
@RT00509 DS    0H                                                  0510
*     IIBUFL=IIBUFL+16;             /* FOR PAD AND LINK      @YM05335*/
         LA    @15,16                                              0510
         AH    @15,IIBUFL(,RIICB)                                  0510
         STH   @15,IIBUFL(,RIICB)                                  0510
*   IF DCBBUFL=ZERO THEN            /* IF BUFL NOT IN DCB MACRO      */
@RF00509 LA    @15,16                                              0511
         ALR   @15,RDCB                                            0511
         LH    @07,DCBBUFL(,@15)                                   0511
         LTR   @07,@07                                             0511
         BNZ   @RF00511                                            0511
*     DO;                                                          0512
*       DCBBUFL=IIBUFL;             /* CALCULATE BUFFER LENGTH       */
         LH    @07,IIBUFL(,RIICB)                                  0513
         STH   @07,DCBBUFL(,@15)                                   0513
*       MBUFL=ON;                   /* SET DEB MODIFICATION MASK     */
         OI    MBUFL(RIICB),B'00000100'                            0514
*     END;                                                         0515
*   END BFRMERGE;                                                  0516
@EL00012 DS    0H                                                  0516
@EF00012 DS    0H                                                  0516
@ER00012 BR    @14                                                 0516
*                                                                  0517
*/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
**                                                                    *
**   FUNCTION = BUILD DEB                                             *
**       THIS ROUTINE BUILDS AN ISAM INTERFACE DUMMY DEB.  IT IS      *
**       CHAINED TO THE CURRENT TCB AND THE ISAM DCB.  THE DEB        *
**       POINTS TO THE IICB TO LINK THE ISAM AND VSAM BLOCKS.         *
**       THE PURPOSE OF THIS DEB IS TO SUPPORT ISAM PROBLEM PROGRAM   *
**       REFERENCES, CHECKPOINT/RESTART, SUPERVISOR TASK              *
**       TERMINATION AND ABEND.                                       *
**                                                                    *
**   INPUT =                                                          *
**       REGISTER 1 - RDCB - DCB POINTER                              *
**       REGISTER 4 - RCORE - I/O SUPPORT WORK AREA POINTER           *
**                                                                    *
**   OUTPUT =                                                         *
**       REGISTER 1 - RDCB - DCB POINTER                              *
**       REGISTER 4 - RCORE - I/O SUPPORT WORK AREA POINTER           *
**       REGISTER 11 - RDEB - DEB POINTER                             *
**                                                                    *
**       CONTROL BLOCK FIELDS INITIALIZED                             *
**         DCBDEBAD (USER DCB)                                        *
**         DCBDEVT (USER DCB)                                         *
**         DCBDEBAD (COPY DCB - FIELD DXPDEBAD FORMERLY USED)         *
**         TCBDEB                                                     *
**                                                                    *
**         DEB                                                        *
**         SECTION               BYTES      FIELDS                    *
**         APPEND                 20                          @OX02677*
**         PREFIX                 16        LNGTH, XTNP               *
**         BASIC                  32        TCBAD, AMLNG, DEBAD, OFLGS*
**                                          OPATB, FLGS1, NMEXT, PRIOR*
**                                          PROTG, DEBID, DCBAD, EXSCL*
**                                          APPAD                     *
**         ISAM DEVICE            16        EXPTR, FPEAD              *
**         DIRECT ACCESS          16        UCBAD                     *
**         ISAM ACCESS METHOD     28        WKPT5                     *
**         EXTENSION                        XDBPR                     *
**                                                                    *
**   PROTECTION KEY = SEE BELOW                                       *
**       KEY ON ENTRY - USER KEY                                      *
**       KEY ON EXIT - USER KEY                                       *
**       INTERIM KEYS ASSUMED = DATA MANAGEMENT KEY 5                 *
**                              SYSTEM KEY 0                          *
**                                                                    *
** * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
*                                                                  0517
*BUILDDEB:                                                         0517
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0517
BUILDDEB DS    0H                                                  0518
*   RESPECIFY                                                      0518
*    (RWORK2,                                                      0518
*     JFCBPTR,                                                     0518
*     RLKRETSV,                                                    0518
*     RTIOT,                                                       0518
*     RPARC) RESTRICTED;                                           0518
*   RLKRETSV=R14;                   /* SAVE RETURN ADDR      @Y021130
*                                      LENGTH OF DUMMY DEB           */
         LR    RLKRETSV,R14                                        0519
*   RWORK2=(LENGTH(DEB)+            /* APPEND, PREFIX,       @OZ02677*/
*       LENGTH(DEBBASIC)+           /* BASIC,                @Y021130*/
*       LENGTH(DEBISAM)+            /* ISAM DEPENDENT SECTION,       */
*       LENGTH(DEBDASD)+            /* ONE DUMMY EXTENT,             */
*       LENGTH(DEBACS08));          /* AND BISAM EXTENSION           */
         LA    RWORK2,128                                          0520
*   RESPECIFY                                                      0521
*    (RGMLEN) RESTRICTED;           /*                       @Y021130*/
*   RGMLEN=((RWORK2+7)/8)*8;        /* ROUND TO A DOUBLE WORD      0522
*                                                            @Y021130*/
         LA    @08,7                                               0522
         ALR   @08,RWORK2                                          0522
         SRDA  @08,32                                              0522
         D     @08,@CF00045                                        0522
         SLA   RGMLEN,3                                            0522
*   RESPECIFY                                                      0523
*    (RGMSP) RESTRICTED;            /*                       @Y021130*/
*   RGMSP=DEBPOOL;                  /* INIT SUBPOOL NUMBER   @Y021130*/
         LA    RGMSP,230                                           0524
*   CALL GETMAIN;                   /* GET CORE FOR DEB AND ZERO     */
         BAL   @14,GETMAIN                                         0525
*   RESPECIFY                                                      0526
*    (RWORK2,                                                      0526
*     RGMSP,                                                       0526
*     RGMLEN,                                                      0526
*     RLKRETSV) UNRESTRICTED;                                      0526
*   RESPECIFY                                                      0527
*     RDEB RESTRICTED;                                             0527
*   RDEB=MAINADDR;                  /* POINTER TO OBTAINED CORE      */
*                                                                  0528
         L     RDEB,MAINADDR(,RCORE)                               0528
*   /*****************************************************************/
*   /*                                                               */
*   /* INITIALIZE THE ISAM INTERFACE DUMMY DEB                       */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0529
*   RDEB=RDEB+LENGTH(DEB);          /* BASIC SECTION PTR     @OZ02677*/
         LA    @15,36                                              0529
         ALR   RDEB,@15                                            0529
*   DCBDEBA=RDEB;                   /* INIT DCB PTR TO DEB   @Y021130*/
         STCM  RDEB,7,DCBDEBA+40(RDCB)                             0530
*   RTIOT=DXTIOTAD;                 /* LOCATE DD ENTRY IN OPEN WORK
*                                      AREA                  @Y021130*/
         L     RTIOT,DXTIOTAD(,RCORE)                              0531
*   DCBDEVT=UCBTYP;                 /* DCB DEV TYPE          @Y021130*/
         LA    @10,16                                              0532
         LR    @08,RDCB                                            0532
         ALR   @08,@10                                             0532
         L     @05,TIOEFSRT-1(,RTIOT)                              0532
         LA    @05,0(,@05)                                         0532
         MVC   DCBDEVT(1,@08),UCBTYP(@05)                          0532
*   DO;                             /* MODESET EXTKEY(DATAMGT)       */
*     SPKA(80);                     /* SET PSW KEY                   */
         LA    @08,80                                              0534
         SPKA  0(@08)                                              0534
*   END;                            /* MODESET EXTKEY(DATAMGT) DATA
*                                      MANAGEMENT KEY FOR DEB      0535
*                                                            @Y021130*/
*   DEBUCBA=TIOEFSRT;               /* VSAM UCB PTR          @Y021130*/
         LA    @08,DEBISAM(,RDEB)                                  0536
         ALR   @08,@10                                             0536
         STCM  @05,7,DEBUCBA(@08)                                  0536
*   RESPECIFY                                                      0537
*    (RTIOT) UNRESTRICTED;          /*                       @Y021130*/
*   DEBAPPB=RDEB-LENGTH(DEB);       /* ADDRESSABILITY FOR LNGTH      */
         LCR   @15,@15                                             0538
         ALR   @15,RDEB                                            0538
         STCM  @15,7,DEBAPPB(RDEB)                                 0538
*   DEBLNGTH=MAINLEN/EIGHT;         /* DOUBLEWORK LENGTH IN DEB      */
         L     @10,MAINLEN-1(,RCORE)                               0539
         LA    @10,0(,@10)                                         0539
         SRL   @10,3                                               0539
         STC   @10,DEBLNGTH(,@15)                                  0539
*   DEBTCBB=TCBPTR;                 /* INIT DEB PTR TO TCB           */
         L     @15,CVTPTR                                          0540
         L     @15,CVTTCBDW(,@15)                                  0540
         MVC   DEBTCBB(3,RDEB),TCBPTR+1(@15)                       0540
*   DEBAMLNG=LENGTH(DEBACS08);      /* ACCESS METHOD SECTION LEN     */
         MVI   DEBAMLNG(RDEB),X'1C'                                0541
*   JFCBPTR=ADDR(DXJBF);            /* INIT JFCB POINTER     @Y021130*/
         LA    JFCBPTR,DXJBF(,RCORE)                               0542
*   DEBOFLGS='11'B;                 /* DISP BITS TO BE MAPPED        */
         MVI   DEBOFLGS(RDEB),B'11000000'                          0543
*   DEBOFLGS=DEBOFLGS&JFCBIND2;     /* INSERT DISP FROM THE JFCB     */
         NC    DEBOFLGS(1,RDEB),JFCBIND2(JFCBPTR)                  0544
*   RESPECIFY                                                      0545
*     JFCBPTR UNRESTRICTED;                                        0545
*   R13=IIRSAVE;                    /* RESTORE SAVE AREA POINTER     */
         L     R13,IIRSAVE(,RCORE)                                 0546
*   GEN(L RPARC,48(R13));           /* RESTORE RPARC                 */
         L RPARC,48(R13)
*   DEBOPATB=PARCOPT;               /* MOVE OPTION BYTE FROM I/O   0548
*                                      (REFERENCED BY COBOL)         */
         MVC   DEBOPATB(1,RDEB),PARCOPT(RPARC)                     0548
*   RESPECIFY                                                      0549
*     RPARC UNRESTRICTED;           /* PARM LIST-HIGH ORDER BIT      */
*   DEBABEND=OFF;                   /* TO 0 TO INIT DEBACCS          */
         NI    DEBABEND(RDEB),B'01111111'                          0550
*   DEBCINDI=ON;                    /* TURN ON INTERFACE (CI) BIT    */
*   DEBXTNIN=ON;                    /* SHOW EXTSN EXISTS     @OZ18535*/
         OI    DEBCINDI(RDEB),B'00001001'                          0552
*   DEBNMEXT=2;                     /* TWO EXTENTS PRESENT           */
         MVI   DEBNMEXT(RDEB),X'02'                                0553
*   DEBPRIOR=TCBDSP;                /* MOVE PRIORITY FROM TCB        */
         L     @15,CVTPTR                                          0554
         L     @15,CVTTCBDW(,@15)                                  0554
         L     @15,TCBPTR(,@15)                                    0554
         IC    @10,TCBDSP(,@15)                                    0554
         STC   @10,DEBPRIOR(,RDEB)                                 0554
*   DEBDCBB=RDCB;                   /* INIT DEB DCB POINTER          */
         STCM  RDCB,7,DEBDCBB(RDEB)                                0555
*   DEBPROTG=DXUKEY×DEBID;          /* TCB PROTECT KEY/DEB ID        */
         MVC   DEBPROTG(1,RDEB),DXUKEY(RCORE)                      0556
         OC    DEBPROTG(1,RDEB),DEBID                              0556
*   DEBEXSCL=4;                     /* DA EXTENT SCALE       @OZ02677*/
         MVI   DEBEXSCL(RDEB),X'04'                                0557
*   DEBEXPTA=RDEB+                  /* ADDR OF ISAM AM SECTION       */
*       (LENGTH(DEBBASIC))+LENGTH(DEBISAM)+LENGTH(DEBDASD);/*      0558
*                                                            @Y021130*/
         LA    @10,64                                              0558
         ALR   @10,RDEB                                            0558
         STCM  @10,7,DEBEXPTA(RDEB)                                0558
*   DEBFPEB=ADDR(DEBDASD);          /* SUPPORT PP TO GET TO UCB      */
         LA    @10,DEBISAM(,RDEB)                                  0559
         AL    @10,@CF00210                                        0559
         STCM  @10,7,DEBFPEB(RDEB)                                 0559
*   DEBWKPT5=RIICB;                 /* ADDR OF IICB                  */
         L     @10,DEBEXPT(,RDEB)                                  0560
         ST    RIICB,DEBWKPT5(,@10)                                0560
*   DEBXTNP=DXDEBXAD;               /* CONNECT DEB EXTENSION TO DEB
*                                      USING PTR IN OPEN WORK AREA 0561
*                                                            @Y021130*/
         L     @10,DXDEBXAD(,RCORE)                                0561
         LR    @07,RDEB                                            0561
         AL    @07,@CF02508                                        0561
         ST    @10,DEBXTNP-28(,@07)                                0561
*   DEBXDBPR=RDEB;                  /* POINT DEB EXTENSION TO BASIC
*                                      DEB                   @Y021130*/
*                                                                  0562
         ST    RDEB,DEBXDBPR(,@10)                                 0562
*   /*****************************************************************/
*   /*                                                               */
*   /* CHAIN THE DEB                                                 */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0563
*   DO;                             /* MODESET EXTKEY(ZERO)          */
*     SPKA(0);                      /* SET PSW KEY                   */
         SLR   @10,@10                                             0564
         SPKA  0(@10)                                              0564
*   END;                            /* MODESET EXTKEY(ZERO) ASSUME 0565
*                                      KEY ZERO FOR STORE IN TCB   0565
*                                                            @Y021130*/
*   RESPECIFY                                                      0566
*    (RWORK2,                                                      0566
*     R10) RESTRICTED;              /*                       @Y021130*/
*   R10=TCBPTR;                     /* GET ADDRESSIBILITY ON TCB   0567
*                                                            @Y021130*/
         LR    R10,@15                                             0567
*   RESPECIFY                                                      0568
*    (TCB) BASED(R10);              /* HOLD IN REG DOING DEB CHAINING
*                                                            @Y021130*/
*   RWORK2=TCBDEB;                  /* PREPARE FOR COMPARE AND SWAP
*                                      FOR ADDING DEB TO CHAIN     0569
*                                                            @Y021130*/
         L     RWORK2,TCBDEB(,R10)                                 0569
*CSRETRY:                                                          0570
*   DEBDEBB=RWORK2;                 /* UPDATE OUR DEB TO POINT TO  0570
*                                      PREVIOUS              @Y021130*/
CSRETRY  STCM  RWORK2,7,DEBDEBB(RDEB)                              0570
*   CS(RWORK2,RDEB,TCBDEB);         /* ADD OUR DEB TO CHAIN  @Y021130*/
         CS    RWORK2,@11,TCBDEB(R10)                              0571
*   BC(7,CSRETRY);                  /* LOOP UNTIL SUCCESSFUL @Y021130*/
         BC    7,CSRETRY                                           0572
*   DO;                             /* MODESET EXTKEY(DATAMGT)       */
*     SPKA(80);                     /* SET PSW KEY                   */
         LA    @15,80                                              0574
         SPKA  0(@15)                                              0574
*   END;                            /* MODESET EXTKEY(DATAMGT) DATA
*                                      MANAGEMENT KEY FOR DEB      0575
*                                                            @Y021130*/
*   RESPECIFY                                                      0576
*    (RWORK2,                                                      0576
*     R10) UNRESTRICTED;            /*                       @Y021130*/
*   RESPECIFY                                                      0577
*    (TCB) BASED(TCBPTR);           /* RESET ORIGINAL        @Y021130*/
*   RDCB=DXUDCBAD;                  /* RESTORE DCB PTR       @Y021130
*                                      ISAM ACCESS METHOD TYPE NEEDED
*                                      FOR FREEDBUF DEBCHK           */
         L     RDCB,DXUDCBAD(,RCORE)                               0578
*   GEN(DEBCHK (1),TYPE=ADD,AM=ISAM);                              0579
         DEBCHK (1),TYPE=ADD,AM=ISAM
*   RESPECIFY                                                      0580
*     IHADCB BASED(DXPDCBAD);       /* USE COPY DCB          @Y021130*/
*   DCBDEBA=R1;                     /* SAVE DEB ADDR IN DCB COPY   0581
*                                                            @Y021130*/
         L     @15,DXPDCBAD(,RCORE)                                0581
         STCM  R1,7,DCBDEBA+40(@15)                                0581
*   RESPECIFY                                                      0582
*     IHADCB BASED(RDCB);           /* USER DCB              @Y021130*/
*   RDCB=DXUDCBAD;                  /* RESTORE DCB PTR       @Y021130*/
         L     RDCB,DXUDCBAD(,RCORE)                               0583
*   R14=IIRSAVE1;                   /* RESTORE RETURN ADDRESS        */
         L     R14,IIRSAVE1(,RCORE)                                0584
*   DO;                             /* MODESET KEYADDR(DXUKEY)       */
*     SPKA(DXUKEY);                 /* SET PSW KEY                   */
         SLR   @15,@15                                             0586
         IC    @15,DXUKEY(,RCORE)                                  0586
         SPKA  0(@15)                                              0586
*   END;                            /* MODESET KEYADDR(DXUKEY)     0587
*                                      RESTORE USER KEY      @Y021130*/
*   END BUILDDEB;                                                  0588
@EL00013 DS    0H                                                  0588
@EF00013 DS    0H                                                  0588
@ER00013 BR    @14                                                 0588
*                                                                  0589
*/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
**                                                                    *
**   FUNCTION = LOAD MODULE                                           *
**       DETERMINE THE ISAM INTERFACE MODULES THAT NEED TO BE         *
**       LOADED AND INITIALIZE THE APPROPRIATE DCB AND DEB VECTOR     *
**       POINTERS.  THE ISAM SYNAD ROUTINE IS LOADED IF IT WAS        *
**       SPECIFIED IN THE AMP PARAMETER.                              *
**                                                                    *
**   INPUT =                                                          *
**       REGISTER 1 - RDCB - DCB POINTER                              *
**       REGISTER 2 - RIICB - IICB POINTER                            *
**       REGISTER 6 - RACB - ACB POINTER                              *
**                                                                    *
**   OUTPUT =                                                         *
**       REGISTERS - SAME AS ABOVE                                    *
**                                                                    *
**       CONTROL BLOCK FIELDS INITIALIZED                             *
**         DCBESETL                                                   *
**         DCBFREED                                                   *
**         DCBIIGET                                                   *
**         DCBIIPUT                                                   *
**         DCBLRAN                                                    *
**         DCBLWKN                                                    *
**         DCBSETL                                                    *
**         DCBSVCXA                                                   *
**         DCBSYNAD                                                   *
**         DEBFREED                                                   *
**         EXLEODF                                                    *
**         EXLEODP                                                    *
**         EXLLERF                                                    *
**         EXLLERP                                                    *
**         EXLSYNF                                                    *
**         EXLSYNP                                                    *
**         IISAMSYN                                                   *
**         IISVCLST                                                   *
**                                                                    *
**   PROTECTION KEY = SEE BELOW                                       *
**       KEY ON ENTRY - USER KEY                                      *
**       KEY ON EXIT - USER KEY                                       *
**       INTERIM KEYS ASSUMED = DATA MANAGEMENT KEY 5                 *
**                                                                    *
** * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
*                                                                  0589
*LOADMOD:                                                          0589
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0589
LOADMOD  DS    0H                                                  0590
*   RESPECIFY                                                      0590
*    (R0,                                                          0590
*     R1,                                                          0590
*     RWORK2,                                                      0590
*     RLKRETSV) RESTRICTED;         /*                       @Y021130*/
*   RESPECIFY                                                      0591
*     IHADCB BASED(RWORK2);                                        0591
*   RWORK2=RDCB;                    /* SET DCB BASE                  */
         LR    RWORK2,RDCB                                         0592
*   RLKRETSV=R14;                   /* SAVE RETURN ADDR      @Y021130
*                                      IF BISAM                      */
         LR    RLKRETSV,R14                                        0593
*   IF DCBMFRD=ON×DCBMFWRT=ON THEN                                 0594
         LA    @15,40                                              0594
         ALR   @15,RWORK2                                          0594
         TM    DCBMFRD(@15),B'00100000'                            0594
         BO    @RT00594                                            0594
         TM    DCBMFWRT(@15),B'00100000'                           0594
         BNO   @RF00594                                            0594
@RT00594 DS    0H                                                  0595
*     DO;                                                          0595
*       R1=CVTSVDCB;                /* PT TO DCB FOR SYS1.SVCLIB LOAD
*                                      II BISAM MODULE               */
         L     @15,CVTPTR                                          0596
         L     R1,CVTSVDCB(,@15)                                   0596
*       GEN(LOAD EP=IDAIIPM3,DCB=(1));                             0597
*                                                                  0597
         LOAD EP=IDAIIPM3,DCB=(1)
*       /*************************************************************/
*       /*                                                           */
*       /* AUDIT MODULE IDAIIPM3 HAS BEEN LOADED SUCCESSFULLY        */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0598
*       AUDPRMOD=MODPM3SW;          /* SET FLAG IN IICB      @Y021130*/
         OI    AUDPRMOD(RIICB),B'00001100'                         0598
*       DCBSETL=R0;                 /* II CHECK ENTRY                */
         LA    @15,52                                              0599
         ALR   @15,RWORK2                                          0599
         ST    R0,DCBSETL(,@15)                                    0599
*       DCBLRAN=R0+6;               /* II READ/WRITE ENTRY           */
         LA    @05,6                                               0600
         ALR   @05,R0                                              0600
         ST    @05,DCBLRAN(,@15)                                   0600
*       DCBLWKN=R0+6;               /* II WRITE KEY NEW ENTRY        */
         ST    @05,DCBLWKN(,@15)                                   0601
*       IF DCBMFDBF=ON THEN         /* IF DYNAMIC BUFFERING          */
         TM    DCBMFDBF+40(RWORK2),B'00000100'                     0602
         BNO   @RF00602                                            0602
*         DO;                                                      0603
*           R1=CVTSVDCB;            /* PT TO DCB FOR SYS1.SVCLIB     */
         L     @15,CVTPTR                                          0604
         L     R1,CVTSVDCB(,@15)                                   0604
*           GEN(LOAD EP=IDAIIFBF,DCB=(1));                         0605
*                                                                  0605
         LOAD EP=IDAIIFBF,DCB=(1)
*           /*********************************************************/
*           /*                                                       */
*           /* AUDIT IDAIIFBF LOADED SUCCESSFULLY            @Y021130*/
*           /*                                                       */
*           /*********************************************************/
*                                                                  0606
*           AUDIIFBF=ON;            /* SFLAG IN IICB         @Y021130*/
         OI    AUDIIFBF(RIICB),B'10000000'                         0606
*           DCBFREED=R0;            /* II DYNAMIC BUFFER ENTRY       */
         ST    R0,DCBFREED+52(,RWORK2)                             0607
*           DO;                     /* MODESET EXTKEY(DATAMGT)       */
*             SPKA(80);             /* SET PSW KEY                   */
         LA    @15,80                                              0609
         SPKA  0(@15)                                              0609
*           END;                    /* MODESET EXTKEY(DATAMGT) SET 0610
*                                      DATA MANAGEMENT KEY FOR DEB 0610
*                                                            @Y021130*/
*           DEBFREED=R0;            /* II DYNAMIC BUFFER ENTRY       */
         L     @15,DEBEXPT(,RDEB)                                  0611
         ST    R0,DEBFREED(,@15)                                   0611
*           DO;                     /* MODESET KEYADDR(DXUKEY)       */
*             SPKA(DXUKEY);         /* SET PSW KEY                   */
         SLR   @15,@15                                             0613
         IC    @15,DXUKEY(,RCORE)                                  0613
         SPKA  0(@15)                                              0613
*           END;                    /* MODESET KEYADDR(DXUKEY) RESUME
*                                      USER KEY              @Y021130*/
*         END;                                                     0615
*     END;                                                         0616
@RF00602 DS    0H                                                  0617
*   IF DCBMFGET=ON THEN             /* IF QISAM SCAN                 */
@RF00594 TM    DCBMFGET+40(RWORK2),B'01000000'                     0617
         BNO   @RF00617                                            0617
*     DO;                           /* LOAD II SCAN MODULE           */
*       R1=CVTSVDCB;                /* PT TO DCB FOR SYS1.SVCLIB     */
         L     @15,CVTPTR                                          0619
         L     R1,CVTSVDCB(,@15)                                   0619
*       GEN(LOAD EP=IDAIIPM2,DCB=(1));                             0620
*                                                                  0620
         LOAD EP=IDAIIPM2,DCB=(1)
*       /*************************************************************/
*       /*                                                           */
*       /* AUDIT THAT MODULE IDAIIPM2 HAS BEEN LOADED SUCCESSFULLY   */
*       /*                                                   @Y021130*/
*       /*                                                           */
*       /*************************************************************/
*                                                                  0621
*       AUDPRMOD=MODPM2SW;          /* SET FLAG IN IICB      @Y021130*/
         NI    AUDPRMOD(RIICB),B'11111011'                         0621
         OI    AUDPRMOD(RIICB),B'00001000'                         0621
*       RESPECIFY                                                  0622
*         R8 RESTRICTED;            /* DCBGET + 4 - PUTX DCBGET + 8 -
*                                      RELSE                         */
*       R8=R0;                                                     0623
         LR    R8,R0                                               0623
*       DCBIIGET=SCANPTR;           /* II GET ENTRY                  */
         MVC   DCBIIGET+48(3,RWORK2),SCANPTR+1(R8)                 0624
*       R8=R8+4;                                                   0625
         LA    @15,4                                               0625
         ALR   R8,@15                                              0625
*       DCBSETL=SCANPTR;            /* II SETL ENTRY                 */
         LA    @09,52                                              0626
         ALR   @09,RWORK2                                          0626
         L     @05,SCANPTR(,R8)                                    0626
         ST    @05,DCBSETL(,@09)                                   0626
*       R8=R8+4;                                                   0627
         ALR   R8,@15                                              0627
*       DCBESETL=SCANPTR;           /* II ESETL ENTRY                */
         L     @05,SCANPTR(,R8)                                    0628
         ST    @05,DCBESETL(,@09)                                  0628
*       R8=R8+4;                                                   0629
         ALR   R8,@15                                              0629
*       EXLEODP=SCANPTR;            /* II EODAD ENTRY-ACB EXLST      */
         L     @15,ACBEXLST(,RACB)                                 0630
         MVC   EXLEODP(4,@15),SCANPTR(R8)                          0630
*       RESPECIFY                                                  0631
*         R8 UNRESTRICTED;                                         0631
*       EXLEODF(1)=ON;              /* MARK EODAD PRESENT            */
*       EXLEODF(2)=ON;              /* MARK EODAD ACTIVE             */
         OI    EXLEODF(@15),B'11000000'                            0633
*     END;                                                         0634
*   ELSE                                                           0635
*     IF DCBMFPUT=ON THEN           /* IF LOAD MODE                  */
         B     @RC00617                                            0635
@RF00617 TM    DCBMFPUT+40(RWORK2),B'01000000'                     0635
         BNO   @RF00635                                            0635
*       DO;                         /* LOAD II LOAD MODE MODULE      */
*         R1=CVTSVDCB;              /* PT TO DCB FOR SYS1.SVCLIB     */
         L     @15,CVTPTR                                          0637
         L     R1,CVTSVDCB(,@15)                                   0637
*         GEN(LOAD EP=IDAIIPM1,DCB=(1));                           0638
*                                                                  0638
         LOAD EP=IDAIIPM1,DCB=(1)
*         /***********************************************************/
*         /*                                                         */
*         /* AUDIT THAT MODULE IDAIIPM1 HAS BEEN LOADED SUCCESSFULLY */
*         /*                                                 @Y021130*/
*         /*                                                         */
*         /***********************************************************/
*                                                                  0639
*         AUDPRMOD=MODPM1SW;        /* SET FLAG IN IICB      @Y021130*/
         NI    AUDPRMOD(RIICB),B'11110111'                         0639
         OI    AUDPRMOD(RIICB),B'00000100'                         0639
*         DCBIIPUT=R0;              /* II PUT ENTRY                  */
         STCM  R0,7,DCBIIPUT+48(RWORK2)                            0640
*       END;                        /* LOAD II SYNAD MODULE          */
*   R1=CVTSVDCB;                    /* PT TO DCB FOR SYS1.SVCLIB     */
@RF00635 DS    0H                                                  0642
@RC00617 L     @15,CVTPTR                                          0642
         L     R1,CVTSVDCB(,@15)                                   0642
*   GEN(LOAD EP=IDAIISM1,DCB=(1));                                 0643
*                                                                  0643
         LOAD EP=IDAIISM1,DCB=(1)
*   /*****************************************************************/
*   /*                                                               */
*   /* AUDIT THAT MODULE IDAIISM1 HAS BEEN LOADED SUCCESSFULLY       */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0644
*   AUDIISYN=ON;                    /* SET FLAG IN IICB      @Y021130*/
         OI    AUDIISYN(RIICB),B'00000010'                         0644
*   EXLSYNP=R0;                     /* SYNAD ENTRY-ACB EXLST         */
         L     @15,ACBEXLST(,RACB)                                 0645
         STCM  R0,15,EXLSYNP(@15)                                  0645
*   EXLSYNF(1)=ON;                  /* MARK SYNAD PRESENT            */
*   EXLSYNF(2)=ON;                  /* MARK SYNAD ACTIVE             */
         OI    EXLSYNF(@15),B'11000000'                            0647
*   EXLLERP=R0;                     /* LERAD ENTRY-ACB EXLST         */
         STCM  R0,15,EXLLERP(@15)                                  0648
*   EXLLERF(1)=ON;                  /* MARK LERAD PRESENT            */
*   EXLLERF(2)=ON;                  /* MARK LERAD ACTIVE             */
         OI    EXLLERF(@15),B'11000000'                            0650
*   IISVCLST=R0+4;                  /* SYNADAF ENTRY                 */
         LA    @15,4                                               0651
         ALR   @15,R0                                              0651
         ST    @15,IISVCLST(,RIICB)                                0651
*   DCBSVCXA=ADDR(IISVCLST);        /* PTR TO SVC EXIT LIST          */
*                                                                  0652
         LA    @15,IISVCLST(,RIICB)                                0652
         STCM  @15,7,DCBSVCXA+28(RWORK2)                           0652
*   /*****************************************************************/
*   /*                                                               */
*   /* LOAD THE ISAM SYNAD ROUTINE WHEN IT IS SPECIFIED IN THE AMP   */
*   /* PARAMETER                                                     */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0653
*   RESPECIFY                                                      0653
*     JFCBPTR RESTRICTED;                                          0653
*   JFCBPTR=ADDR(DXJBF);            /* INIT PTR TO JFCB      @Y021130*/
         LA    JFCBPTR,DXJBF(,RCORE)                               0654
*   IF JFCAMSYN(1:4)^=ZERO THEN     /* IF SYNAD SPECIFIED IN AMP     */
         ICM   @15,15,JFCAMSYN(JFCBPTR)                            0655
         BZ    @RF00655                                            0655
*     DO;                           /* YES                           */
*       RESPECIFY                                                  0657
*        (R15) RESTRICTED;                                         0657
*       IISAMSYN=JFCAMSYN;          /* SAVE ISAM SYNAD NAME          */
         MVC   IISAMSYN(8,RIICB),JFCAMSYN(JFCBPTR)                 0658
*       R15=ADDR(SYNCHRTN);         /* ADDR TO SYNCH TO IN ORDER TO
*                                      LOAD FROM JOBLIB      @YM04603*/
         LA    R15,SYNCHRTN                                        0659
*       GEN(SYNCH (R15));           /* ENTER PROBLEM PROGRAM STATE 0660
*                                                            @YM04603*/
*                                                                  0660
         SYNCH (R15)
*       /*************************************************************/
*       /*                                                           */
*       /* RETURN FROM LOADING USER SPECIFIED SYNAD ROUTINE          */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0661
*       DO;                         /* MODESET KEYADDR(DXUKEY)       */
*         SPKA(DXUKEY);             /* SET PSW KEY                   */
         SLR   @08,@08                                             0662
         IC    @08,DXUKEY(,RCORE)                                  0662
         SPKA  0(@08)                                              0662
*       END;                        /* MODESET KEYADDR(DXUKEY) INSURE
*                                      USER KEY              @YM04603*/
*       RESPECIFY                                                  0664
*        (R15) UNRESTRICTED;                                       0664
*     END;                                                         0665
*   RDCB=RWORK2;                    /* RESTORE DCB POINTER           */
@RF00655 LR    RDCB,RWORK2                                         0666
*   R14=RLKRETSV;                   /* RESTORE RET ADDR      @Y021130*/
         LR    R14,RLKRETSV                                        0667
*   RETURN;                         /* RETURN TO MAINLINE    @YM04603*/
*                                                                  0668
@EL00014 DS    0H                                                  0668
@EF00014 DS    0H                                                  0668
@ER00014 BR    @14                                                 0668
*   /*****************************************************************/
*   /*                                                               */
*   /* THE FOLLOWING LABEL IS USED WHEN IT IS NECESSARY TO LOAD A    */
*   /* USER SYNAD ROUTINE FROM THE JOBLIB. THIS MUST BE DONE IN USER */
*   /* KEY AND PROBLEM PROGRAM STATE.                                */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0669
*SYNCHRTN:                                                         0669
*   RESPECIFY                                                      0669
*    (R8,                                                          0669
*     R9) RESTRICTED;               /*                       @YM04603*/
SYNCHRTN DS    0H                                                  0670
*   R9=R14;                         /* SAVE RET TO SVC       @YM04603*/
         LR    R9,R14                                              0670
*   R8=ADDR(IISAMSYN);              /* INIT PTR TO SYNAD NAME      0671
*                                                            @YM04603*/
         LA    R8,IISAMSYN(,RIICB)                                 0671
*   GEN(LOAD EPLOC=(R8));           /* LOAD ISAM SYNAD MODULE      0672
*                                                            @YM04603*/
*                                                                  0672
         LOAD EPLOC=(R8)
*   /*****************************************************************/
*   /*                                                               */
*   /* AUDIT THAT THE USER SYNAD MODULE WAS LOADED SUCESSFULLY       */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0673
*   AUDURSYN=ON;                    /* SET FLAG IN IICB      @YM04603*/
         OI    AUDURSYN(RIICB),B'00000001'                         0673
*   DCBSYNAD=R0;                    /* INIT SYNAD ENTRY PT - DCB   0674
*                                                            @YM04603*/
         ST    R0,DCBSYNAD+52(,RWORK2)                             0674
*   R14=R9;                         /* RETURN TO SVC         @YM04603*/
         LR    R14,R9                                              0675
*   RESPECIFY                                                      0676
*     IHADCB BASED(RDCB);           /*                       @YM04603*/
*   RESPECIFY                                                      0677
*    (JFCBPTR,                                                     0677
*     R0,                                                          0677
*     RWORK2,                                                      0677
*     RLKRETSV,                                                    0677
*     R8,                                                          0677
*     R9)                           /*                       @YM04603*/
*         UNRESTRICTED;             /*                       @YM04603*/
*   END LOADMOD;                                                   0678
         B     @EL00014                                            0678
*                                                                  0679
*/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
**                                                                    *
**   FUNCTION = BUILD RPL                                             *
**       THIS ROUTINE COMPUTES SIZES AND GETS CORE IN THE USERS       *
**       REGION FOR THE ISAM INTERFACE RPLS, RPL EXTENSIONS, ERROR    *
**       MESSAGE AREAS, KEYSAVE AREA AND ISAM INTERFACE BUFFERS.      *
**                                                                    *
**   INPUT =                                                          *
**       REGISTER 1 - RDCB - DCB POINTER                              *
**       REGISTER 2 - RIICB - IICB POINTER                            *
**       REGISTER 4 - RCORE - I/O SUPPORT WORK AREA POINTER           *
**                                                                    *
**   OUTPUT =                                                         *
**       REGISTER 1 - RDCB - DCB POINTER                              *
**       REGISTER 2 - RIICB - IICB POINTER                            *
**       REGISTER 3 - RRPL - RPL POINTER                              *
**       REGISTER 4 - RCORE - I/O SUPPORT WORK AREA POINTER           *
**                                                                    *
**       CONTROL BLOCK FIELDS INITIALIZED                             *
**         IIKEYSL                                                    *
**         IIRPLL                                                     *
**         IIRPLPTR                                                   *
**         IITBUFL                                                    *
**         IIMSGL                                                     *
**         IIMSGPTR                                                   *
**                                                                    *
**   PROTECTION KEY = SEE BELOW                                       *
**       KEY ON ENTRY - USER KEY                                      *
**       KEY ON EXIT - USER KEY                                       *
**       INTERIM KEYS ASSUMED = NONE                                  *
**                                                                    *
** * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
*                                                                  0679
*BLDRPL:                                                           0679
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0679
BLDRPL   DS    0H                                                  0680
*   RESPECIFY                                                      0680
*     RRPL RESTRICTED;                                             0680
*                                                                  0680
*   /*****************************************************************/
*   /*                                                               */
*   /* IIBUFL AND IIBUFNO ARE SET IN THE BFRMERGE ROUTINE. IIBUFNO = */
*   /* STRING NUMBER FOR BISAM, AND IS = ONE FOR QISAM. FINALLY,     */
*   /* COMPUTE RPL AND RPLE SIZE.                                    */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0681
*   IIRPLL=(LENGTH(IFGRPL)+         /* RPL LENGTH                    */
*       LENGTH(IDARPLE))            /* RPL EXTENSION LENGTH          */
*       *IIBUFNO;                   /* TIMES BUFFER NO               */
*                                                                  0681
         SLR   @15,@15                                             0681
         IC    @15,IIBUFNO(,RIICB)                                 0681
         LR    @10,@15                                             0681
         MH    @10,@CH02106                                        0681
         STCM  @10,7,IIRPLL(RIICB)                                 0681
*   /*****************************************************************/
*   /*                                                               */
*   /* COMPUTE II BUFFER SIZE                                        */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0682
*   RESPECIFY                                                      0682
*     RWORK2 RESTRICTED;                                           0682
*   RWORK2=IIBUFL;                  /* LRECL FOR BUFFERS TOTAL CORE
*                                      FOR BUFFERS                   */
         LH    RWORK2,IIBUFL(,RIICB)                               0683
*   RWORK2=(RWORK2*IIBUFNO)+8;      /* LRECL*BUFNO+BCB LENGTH        */
         LA    @10,8                                               0684
         LR    @09,@15                                             0684
         MR    @08,RWORK2                                          0684
         ALR   @09,@10                                             0684
         LR    RWORK2,@09                                          0684
*   IITBUFL=RWORK2;                 /* SAVE BUFFER LENGTH            */
*                                                                  0685
         STCM  RWORK2,7,IITBUFL(RIICB)                             0685
*   /*****************************************************************/
*   /*                                                               */
*   /* COMPUTE KEYSAVE AREA SIZE FOR QISAM PUT LOCATE REQUEST        */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0686
*   IF DCBMFLCP=ON THEN             /* IF PUT LOCATE THEN KEYSAVE  0686
*                                      AREA NEEDED CALCULATE LENGTH
*                                      NEEDED                        */
         TM    DCBMFLCP+40(RDCB),B'00001000'                       0686
         BNO   @RF00686                                            0686
*     IIKEYSL=((DCBKEYLE+7)/8)*8;                                  0687
*                                                                  0687
         LA    @08,7                                               0687
         SLR   @15,@15                                             0687
         IC    @15,DCBKEYLE+16(,RDCB)                              0687
         ALR   @08,@15                                             0687
         SRDA  @08,32                                              0687
         DR    @08,@10                                             0687
         SLA   @09,3                                               0687
         STH   @09,IIKEYSL(,RIICB)                                 0687
*   /*****************************************************************/
*   /*                                                               */
*   /* GET CORE FOR RPL'S, BUFFERS AND KEYSAVE                       */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0688
*   RESPECIFY                                                      0688
*    (RGMLEN) RESTRICTED;           /*                       @Y021130*/
@RF00686 DS    0H                                                  0689
*   RGMLEN=IIKEYSL+                 /* KEYSAVE LENGTH PLUS           */
*       IITBUFL+                    /* BUFFER LENGTH PLUS            */
*       IIRPLL;                     /* RPL LENGTH FOR GETMAIN      0689
*                                                            @Y021130*/
         L     RGMLEN,IITBUFL-1(,RIICB)                            0689
         LA    RGMLEN,0(,RGMLEN)                                   0689
         AH    RGMLEN,IIKEYSL(,RIICB)                              0689
         L     @15,IIRPLL-1(,RIICB)                                0689
         LA    @15,0(,@15)                                         0689
         ALR   RGMLEN,@15                                          0689
*   RESPECIFY                                                      0690
*    (RGMSP) RESTRICTED;            /*                       @Y021130*/
*   RGMSP=USERPOOL;                 /* USER REGION SUBPOOL   @Y021130*/
         LA    RGMSP,250                                           0691
*   RESPECIFY                                                      0692
*    (RLKRETSV) RESTRICTED;         /*                       @Y021130*/
*   RLKRETSV=R14;                   /* SAVE LINK REG         @Y021130*/
         LR    RLKRETSV,R14                                        0693
*   CALL GETMAIN;                   /* GET CORE FOR RPL'S            */
         BAL   @14,GETMAIN                                         0694
*   RESPECIFY                                                      0695
*    (RGMSP,                                                       0695
*     RGMLEN,                                                      0695
*     RLKRETSV) UNRESTRICTED;       /*                       @Y021130*/
*   RRPL=MAINADDR;                  /* INIT RPL PTR                  */
         L     RRPL,MAINADDR(,RCORE)                               0696
*   IIRPLPTR=RRPL;                  /* SAVE PTR TO 1ST RPL           */
*                                                                  0697
         ST    RRPL,IIRPLPTR(,RIICB)                               0697
*   /*****************************************************************/
*   /*                                                               */
*   /* COMPUTE THE SIZE AND GET CORE FOR ERROR MESSAGE AREAS         */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0698
*   RWORK2=LENGTH(IDAERMSG);        /* INIT ERROR MSG LENGTH FOR   0698
*                                      GETMAIN/FREEMAIN - ROUNDED TO
*                                      DOUBLE WORD TIMES BUFFER NO   */
         LA    RWORK2,128                                          0698
*   IIMSGL=((RWORK2+7)/8)*8*IIBUFNO;                               0699
         LA    @08,7                                               0699
         ALR   @08,RWORK2                                          0699
         SRDA  @08,32                                              0699
         D     @08,@CF00045                                        0699
         SLA   @09,3                                               0699
         SLR   @15,@15                                             0699
         IC    @15,IIBUFNO(,RIICB)                                 0699
         MR    @08,@15                                             0699
         STCM  @09,7,IIMSGL(RIICB)                                 0699
*   RESPECIFY                                                      0700
*     RWORK2 UNRESTRICTED;                                         0700
*   RESPECIFY                                                      0701
*    (RGMLEN) RESTRICTED;           /*                       @Y021130*/
*   RGMLEN=IIMSGL;                  /* INIT LENGTH FOR GETMAIN     0702
*                                                            @Y021130*/
         L     @15,IIMSGL-1(,RIICB)                                0702
         LA    @15,0(,@15)                                         0702
         LR    RGMLEN,@15                                          0702
*   RESPECIFY                                                      0703
*    (RGMSP) RESTRICTED;            /*                       @Y021130*/
*   RGMSP=USERPOOL;                 /* USER REGION SUBPOOL   @Y021130*/
         LA    RGMSP,250                                           0704
*   RESPECIFY                                                      0705
*    (RLKRETSV) RESTRICTED;         /*                       @Y021130*/
*   RLKRETSV=IIRSAVE1;              /* PREVIOUSLY SAVED LINK REG   0706
*                                                            @Y021130*/
         L     RLKRETSV,IIRSAVE1(,RCORE)                           0706
*   CALL GETMAIN;                   /* GET CORE FOR ERROR MSG        */
         BAL   @14,GETMAIN                                         0707
*   RESPECIFY                                                      0708
*    (RGMSP,                                                       0708
*     RGMLEN,                                                      0708
*     RLKRETSV) UNRESTRICTED;       /*                       @Y021130*/
*   IIMSGPTR=MAINADDR;              /* SAVE MSG AREA PTR             */
         L     @15,MAINADDR(,RCORE)                                0709
         ST    @15,IIMSGPTR(,RIICB)                                0709
*   R14=IIRSAVE1;                   /* RESTORE RETURN ADDRESS        */
         L     R14,IIRSAVE1(,RCORE)                                0710
*   END BLDRPL;                                                    0711
@EL00015 DS    0H                                                  0711
@EF00015 DS    0H                                                  0711
@ER00015 BR    @14                                                 0711
*                                                                  0712
*/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
**                                                                    *
**   FUNCTION = INITIALIZE RPL                                        *
**       INITIALIZE THE ISAM INTERFACE RPL, RPL EXTENSION AND         *
**       ERROR MESSAGE AREAS.  THE RPL EXTENSION IS LOCATED           *
**       IMMEDIATELY AFTER EACH RPL.  THE FIRST RPL IS POINTED        *
**       TO BY THE IICB.  THE REST ARE CHAINED TOGETHER IN THE        *
**       RPL EXTENSION.  THE RPL EXTENSION IS ALSO USED BY THE ISAM   *
**       INTERFACE TO POINT TO THE IICB, DECB AND THE II BUFFER.      *
**                                                                    *
**   INPUT =                                                          *
**       REGISTER 2 - RIICB - IICB POINTER                            *
**       REGISTER 3 - RRPL - RPL POINTER                              *
**       REGISTER 4 - RCORE - I/O SUPPORT WORK AREA POINTER           *
**       REGISTER 6 - RACB - ACB POINTER                              *
**                                                                    *
**   OUTPUT =                                                         *
**       REGISTERS - SAME AS ABOVE                                    *
**                                                                    *
**       CONTROL BLOCK FIELDS INITIALIZED                             *
**         RPLBUFL                                                    *
**         RPLDACB                                                    *
**         RPLEMLEN                                                   *
**         RPLERMSA                                                   *
**         RPLID                                                      *
**         RPLIICB                                                    *
**         RPLKEY                                                     *
**         RPLKEYLE                                                   *
**         RPLLEN                                                     *
**         RPLOPTCD                                                   *
**         RPLRLEN                                                    *
**         RPLRPLPT                                                   *
**                                                                    *
**   PROTECTION KEY = SEE BELOW                                       *
**       KEY ON ENTRY - USER KEY                                      *
**       KEY ON EXIT - USER KEY                                       *
**       INTERIM KEYS ASSUMED = NONE                                  *
**                                                                    *
** * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
*                                                                  0712
*INITRPL:                                                          0712
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0712
INITRPL  DS    0H                                                  0713
*   RESPECIFY                                                      0713
*     RWORK2 RESTRICTED;                                           0713
*   RWORK2=IIMSGPTR;                /* INIT MSG AREA PTR             */
         L     RWORK2,IIMSGPTR(,RIICB)                             0714
*   RESPECIFY                                                      0715
*    (R10) RESTRICTED;              /*                       @Y021130*/
*   DO R10=ONE BY ONE TO IIBUFNO;   /*                       @Y021130*/
         LA    R10,1                                               0716
         B     @DE00716                                            0716
@DL00716 DS    0H                                                  0717
*     RPLRPLPT=RRPL                 /* INIT PTR TO NEXT RPL          */
*         +LENGTH(IFGRPL)           /*                               */
*         +LENGTH(IDARPLE);         /*                               */
         LA    @15,104                                             0717
         ALR   @15,RRPL                                            0717
         ST    @15,RPLRPLPT+76(,RRPL)                              0717
*     RPLERMSA=RWORK2;              /* INIT RPL PTR TO MSG AREA      */
         ST    RWORK2,RPLERMSA(,RRPL)                              0718
*     RPLID='00'X;                  /* SET RPL IDENTIFIER            */
         MVI   RPLID(RRPL),X'00'                                   0719
*     RPLLEN=LENGTH(IFGRPL);        /* SET RPL LENGTH                */
         MVI   RPLLEN(RRPL),X'4C'                                  0720
*     RPLKEY=ON;                    /* KEYED ACCESS                  */
         OI    RPLKEY(RRPL),B'10000000'                            0721
*     IF ACBSEQ=ON THEN                                            0722
         TM    ACBSEQ(RACB),B'00010000'                            0722
         BNO   @RF00722                                            0722
*       RPLSEQ=ON;                  /* SEQUENTIAL                    */
         OI    RPLSEQ(RRPL),B'00100000'                            0723
*     IF ACBDIR=ON THEN                                            0724
@RF00722 TM    ACBDIR(RACB),B'00001000'                            0724
         BNO   @RF00724                                            0724
*       RPLDIR=ON;                  /* DIRECT                        */
         OI    RPLDIR(RRPL),B'01000000'                            0725
*     IF DCBMFUIP=ON THEN                                          0726
@RF00724 TM    DCBMFUIP+40(RDCB),B'00000100'                       0726
         BNO   @RF00726                                            0726
*       RPLUPD=ON;                  /* UPDATE - SCAN                 */
         OI    RPLUPD(RRPL),B'00000010'                            0727
*     RPLKEYLE=AMDKEYLN;            /* KEY LENGTH                    */
@RF00726 L     @15,ACBAMBL(,RACB)                                  0728
         L     @15,AMBLDTA(,@15)                                   0728
         L     @15,AMBDSB(,@15)                                    0728
         LH    @05,AMDKEYLN(,@15)                                  0728
         STH   @05,RPLKEYLE(,RRPL)                                 0728
*     RPLDACB=IIACBPTR;             /* ACB PTR                       */
         L     @05,IIACBPTR(,RIICB)                                0729
         ST    @05,RPLDACB(,RRPL)                                  0729
*     RPLRLEN=AMDLRECL;             /* RECORD LENGTH                 */
         L     @15,AMDLRECL(,@15)                                  0730
         ST    @15,RPLRLEN(,RRPL)                                  0730
*     RPLBUFL=IIBUFL;               /* AREA LENGTH ERROR MSG       0731
*                                      LEN-ROUND DWORD               */
         LH    @15,IIBUFL(,RIICB)                                  0731
         ST    @15,RPLBUFL(,RRPL)                                  0731
*     RPLEMLEN=((LENGTH(IDAERMSG)+7)/8)*8;                         0732
         LA    @15,128                                             0732
         STH   @15,RPLEMLEN(,RRPL)                                 0732
*     RPLIICB=RIICB;                /* IICB PTR                      */
         LA    @05,76                                              0733
         ALR   @05,RRPL                                            0733
         ST    RIICB,RPLIICB(,@05)                                 0733
*     RWORK2=RWORK2+RPLEMLEN;       /* ADD ERROR MSG LENGTH          */
         ALR   RWORK2,@15                                          0734
*     RRPL=RPLRPLPT;                /* INIT BASE FOR NEXT RPL        */
         L     @15,RPLRPLPT(,@05)                                  0735
         LR    RRPL,@15                                            0735
*   END;                                                           0736
         AL    R10,@CF00087                                        0736
@DE00716 SLR   @15,@15                                             0736
         IC    @15,IIBUFNO(,RIICB)                                 0736
         CR    R10,@15                                             0736
         BNH   @DL00716                                            0736
*   RESPECIFY                                                      0737
*    (R10) UNRESTRICTED;            /*                       @Y021130*/
*   RRPL=RRPL-(LENGTH(IFGRPL)       /* BACK UP RPL PTR               */
*       +LENGTH(IDARPLE));                                         0738
         SL    RRPL,@CF02106                                       0738
*   RPLRPLPT=ZERO;                  /* CLEAR RPL CHAIN               */
         SLR   @15,@15                                             0739
         ST    @15,RPLRPLPT+76(,RRPL)                              0739
*   RESPECIFY                                                      0740
*    (RWORK2) UNRESTRICTED;                                        0740
*   END INITRPL;                                                   0741
@EL00016 DS    0H                                                  0741
@EF00016 DS    0H                                                  0741
@ER00016 BR    @14                                                 0741
*                                                                  0742
*/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
**                                                                    *
**   FUNCTION = BUILD BUFFERS                                         *
**                                                                    *
**       THIS ROUTINE INITIALIZES THE POINTERS TO THE ISAM            *
**       INTERFACE BUFFERS AND KEYSAVE AREA.  THE ISAM INTERFACE      *
**       BUILDS ONE BUFFER FOR QISAM AND USES STRING NUMBER TO        *
**       BUILD BUFFERS FOR BISAM.  THE ISAM INTERFACE BUFFERS ARE     *
**       NEEDED FOR LOCATE MODE, DYNAMIC BUFFERING, SETL WITH KEY,    *
**       STAND ALONE WRITE (ADD), AND FOR FIXED, UNVLOCKED RECORDS    *
**       WITH RKP = 0 (DATA-ONLY RETRIEVAL).                          *
**                                                                    *
**   INPUT =                                                          *
**       REGISTER 1 - RDCB - DCB POINTER                              *
**       REGISTER 2 - RIICB - IICB POINTER                            *
**       REGISTER 3 - RRPL - RPL POINTER                              *
**       REGISTER 4 - RCORE - I/O SUPPORT WORK AREA POINTER           *
**                                                                    *
**   OUTPUT =                                                         *
**       REGISTERS - SAME AS ABOVE                                    *
**                                                                    *
**       CONTROL BLOCK FIELDS INITIALIZED                             *
**         BCBBUFL                                                    *
**         BCBBUFNO                                                   *
**         BCBFSBUF                                                   *
**         BCBBUFLINK                                                 *
**         DCBBUFCA                                                   *
**         IIKEYPT                                                    *
**         IIQBFRS                                                    *
**         RPLIIBFR                                                   *
**                                                                    *
**   PROTECTION KEY = SEE BELOW                                       *
**       KEY ON ENTRY - USER KEY                                      *
**       KEY ON EXIT - USER KEY                                       *
**       INTERIM KEYS ASSUMED = NONE                                  *
**                                                                    *
** * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
*                                                                  0742
*BLDBUFR:                                                          0742
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0742
BLDBUFR  DS    0H                                                  0743
*   RESPECIFY                                                      0743
*    (RBUFF) RESTRICTED;                                           0743
*   RBUFF=IIRPLPTR+IIRPLL;          /* INIT BUFFER POINTER           */
         L     RBUFF,IIRPLL-1(,RIICB)                              0744
         LA    RBUFF,0(,RBUFF)                                     0744
         AL    RBUFF,IIRPLPTR(,RIICB)                              0744
*   IF DCBMFLCP=ON THEN             /* IF PUT LOCATE                 */
         TM    DCBMFLCP+40(RDCB),B'00001000'                       0745
         BNO   @RF00745                                            0745
*     DO;                                                          0746
*       IIKEYPT=RBUFF;              /* INIT PTR TO KEYSAVE           */
         ST    RBUFF,IIKEYPT(,RIICB)                               0747
*       RBUFF=RBUFF+IIKEYSL;        /* ADD KEYSAVE LENGTH            */
         AH    RBUFF,IIKEYSL(,RIICB)                               0748
*     END;                                                         0749
*   RRPL=IIRPLPTR;                  /* INIT PTR TO 1ST RPL           */
*                                                                  0750
@RF00745 L     RRPL,IIRPLPTR(,RIICB)                               0750
*   /*****************************************************************/
*   /*                                                               */
*   /* WHEN A VALID BUFFER ADDRESS IS SPECIFIED IN THE DCB, OR A     */
*   /* BISAM DCB, ONLY THE RPL BUFFER POINTER IS INITIALIZED BY THE  */
*   /* ISAM INTERFACE.                                               */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0751
*   RESPECIFY                                                      0751
*    (R10) RESTRICTED;              /*                       @Y021130*/
*   IF(DCBMFRD=ON×                  /* IF BISAM (READ        @YM05335*/
*       DCBMFWRT=ON) THEN           /* OR WRITE)             @YM05335*/
         LA    @15,40                                              0752
         ALR   @15,RDCB                                            0752
         TM    DCBMFRD(@15),B'00100000'                            0752
         BO    @RT00752                                            0752
         TM    DCBMFWRT(@15),B'00100000'                           0752
         BNO   @RF00752                                            0752
@RT00752 DS    0H                                                  0753
*     RBUFF=RBUFF+16;               /* ADD PAD AND LINK BYTES      0753
*                                                            @YM05335*/
         AL    RBUFF,@CF00210                                      0753
*   IF(DCBMFRD=ON×                  /* IF BISAM (READ OR WRITE)      */
*       DCBMFWRT=ON)×               /* OR                            */
*       BUFADDR(32)='0'B THEN       /* VALID BUFFER ADDR IN DCB      */
@RF00752 LA    @15,40                                              0754
         ALR   @15,RDCB                                            0754
         TM    DCBMFRD(@15),B'00100000'                            0754
         BO    @RT00754                                            0754
         TM    DCBMFWRT(@15),B'00100000'                           0754
         BO    @RT00754                                            0754
         TM    BUFADDR+19(RDCB),B'00000001'                        0754
         BNZ   @RF00754                                            0754
@RT00754 DS    0H                                                  0755
*     DO R10=ONE BY ONE TO IIBUFNO; /*                       @Y021130*/
         LA    R10,1                                               0755
         B     @DE00755                                            0755
@DL00755 DS    0H                                                  0756
*       RPLIIBFR=RBUFF;             /* INIT RPL BUFFER POINTER       */
         LA    @15,76                                              0756
         ALR   @15,RRPL                                            0756
         ST    RBUFF,RPLIIBFR(,@15)                                0756
*       RRPL=RPLRPLPT;              /* BUMP RPL PTR                  */
         L     @15,RPLRPLPT(,@15)                                  0757
         LR    RRPL,@15                                            0757
*       RBUFF=RBUFF+IIBUFL;         /* BUMP BUFFER POINTER           */
         AH    RBUFF,IIBUFL(,RIICB)                                0758
*     END;                          /* LOOP BACK                     */
         AL    R10,@CF00087                                        0759
@DE00755 SLR   @15,@15                                             0759
         IC    @15,IIBUFNO(,RIICB)                                 0759
         CR    R10,@15                                             0759
         BNH   @DL00755                                            0759
*   ELSE                                                           0760
*     DO;                           /* IF QISAM W/O BUFFERS THEN TURN
*                                      ON BIT TO PREVENT FREEMAIN OF
*                                      BUFFERS IN CLOSE - USER ISSUES
*                                      FREE-                         */
         B     @RC00754                                            0760
@RF00754 DS    0H                                                  0761
*       IIQBFRS=ON;                 /* POOL AFTER CLOSE              */
         OI    IIQBFRS(RIICB),B'00000001'                          0761
*       DCBBUFCA=RBUFF;             /* INIT BUFR CONTROL BLK PTR     */
         LA    @15,16                                              0762
         ALR   @15,RDCB                                            0762
         STCM  RBUFF,7,DCBBUFCA(@15)                               0762
*       BCBBUFNO=IIBUFNO;           /* INIT BUFR NO IN BCB           */
         L     @15,DCBBUFCB(,@15)                                  0763
         SLR   @07,@07                                             0763
         IC    @07,IIBUFNO(,RIICB)                                 0763
         STH   @07,BCBBUFNO(,@15)                                  0763
*       BCBBUFL=IIBUFL;             /* INIT BUFR LENGTH IN BCB       */
         LH    @07,IIBUFL(,RIICB)                                  0764
         STH   @07,BCBBUFL(,@15)                                   0764
*       RBUFF=RBUFF+8;              /* ADD LENGTH OF BCB             */
         LA    @15,8                                               0765
         ALR   RBUFF,@15                                           0765
*       IF DCBBFA='01'B THEN        /* IF FULL WORD ALIGN            */
         TM    DCBBFA+28(RDCB),B'00000001'                         0766
         BNO   @RF00766                                            0766
         TM    DCBBFA+28(RDCB),B'00000010'                         0766
         BNZ   @RF00766                                            0766
*         RBUFF=RBUFF+8;            /* ADJUST POINTER                */
         ALR   RBUFF,@15                                           0767
*       BCBFSBUF=RBUFF;             /* SET PTR TO 1ST BUFFER         */
@RF00766 L     @15,DCBBUFCB+16(,RDCB)                              0768
         ST    RBUFF,BCBFSBUF(,@15)                                0768
*       IF IIBUFNO>1 THEN                                          0769
         CLI   IIBUFNO(RIICB),1                                    0769
         BNH   @RF00769                                            0769
*         DO R10=ONE BY ONE TO IIBUFNO-1;/*                  @Y021130*/
         LA    R10,1                                               0770
         B     @DE00770                                            0770
@DL00770 DS    0H                                                  0771
*           BUFLINK=RBUFF+IIBUFL;   /* INIT BUFFER LINK FIELD        */
         LR    @15,RBUFF                                           0771
         AH    @15,IIBUFL(,RIICB)                                  0771
         ST    @15,BUFLINK(,RBUFF)                                 0771
*           RPLIIBFR=RBUFF;         /* INIT RPL PTR TO BUFFER        */
         LA    @07,76                                              0772
         ALR   @07,RRPL                                            0772
         ST    RBUFF,RPLIIBFR(,@07)                                0772
*           RBUFF=BUFLINK;          /* BUMP BUFFER PTR BY BUFL       */
         LR    RBUFF,@15                                           0773
*           RRPL=RPLRPLPT;          /* POINT TO NEXT RPL             */
         L     @15,RPLRPLPT(,@07)                                  0774
         LR    RRPL,@15                                            0774
*         END;                                                     0775
         AL    R10,@CF00087                                        0775
@DE00770 SLR   @15,@15                                             0775
         IC    @15,IIBUFNO(,RIICB)                                 0775
         BCTR  @15,0                                               0775
         CR    R10,@15                                             0775
         BNH   @DL00770                                            0775
*       RPLIIBFR=RBUFF;             /* INIT RPL PTR TO BUFFER        */
@RF00769 ST    RBUFF,RPLIIBFR+76(,RRPL)                            0776
*       BUFLINK=ZERO;               /* LAST BUFR LINK = ZERO         */
         SLR   @15,@15                                             0777
         ST    @15,BUFLINK(,RBUFF)                                 0777
*     END;                                                         0778
*   RESPECIFY                                                      0779
*    (RBUFF,                                                       0779
*     R10) UNRESTRICTED;                                           0779
@RC00754 DS    0H                                                  0780
*   RRPL=IIRPLPTR;                  /* RESTORE RRPL          @OX19980*/
         L     RRPL,IIRPLPTR(,RIICB)                               0780
*   END BLDBUFR;                                                   0781
@EL00017 DS    0H                                                  0781
@EF00017 DS    0H                                                  0781
@ER00017 BR    @14                                                 0781
*                                                                  0782
*/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
**                                                                    *
**   FUNCTION = DCB INITIALIZATION                                    *
**       THIS ROUTINE PERFORMS FINAL INITIALIZATION OF FIELDS FOR     *
**       THE ISAM INTERFACE.                                          *
**                                                                    *
**   INPUT =                                                          *
**       REGISTER 1 - RDCB - DCB POINTER                              *
**       REGISTER 2 - RIICB - IICB POINTER                            *
**       REGISTER 3 - RRPL - RPL POINTER                              *
**       REGISTER 6 - RACB - ACB POINTER                              *
**                                                                    *
**   OUTPUT =                                                         *
**       REGISTERS - SAME AS ABOVE                                    *
**                                                                    *
**       CONTROL BLOCK FIELDS INITIALIZED                             *
**         DCBOFLGS                                                   *
**           OPEN BIT ON                                              *
**           LOCK BIT OFF                                             *
**           BUSY BIT OFF                                             *
**         DCBOPTCD                                                   *
**         DCBRORG1                                                   *
**         DCBRORG2                                                   *
**         DCBRORG3                                                   *
**         DCBWKPT6                                                   *
**         IISEQCHK                                                   *
**         IIW1CBF                                                    *
**                                                                    *
**   PROTECTION KEY = SEE BELOW                                       *
**       KEY ON ENTRY - USER KEY                                      *
**       KEY ON EXIT - USER KEY                                       *
**       INTERIM KEYS ASSUMED = NONE                                  *
**                                                                    *
** * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
*                                                                  0782
*DCBINIT:                                                          0782
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0782
DCBINIT  DS    0H                                                  0783
*   RESPECIFY                                                      0783
*    (JFCBPTR) RESTRICTED;          /* II SUPPORT-DCB WORK AREA      */
*   IF DCBMFGET=ON THEN             /* IF SCAN MODE                  */
         TM    DCBMFGET+40(RDCB),B'01000000'                       0784
         BNO   @RF00784                                            0784
*     DO;                           /* REFERENCED BY COBOL           */
*       DCBWKPT1=ADDR(IIW1CBF)-112; /* QISAM SCAN - WA + 112 =     0786
*                                      W1CBF-CURRENT BUFFER PTR      */
         LA    @15,IIW1CBF(,RIICB)                                 0786
         SL    @15,@CF02483                                        0786
         ST    @15,DCBWKPT1+52(,RDCB)                              0786
*       IIW1CBF=RPLIIBFR;           /* USED BY COBOL FOR PUTX      0787
*                                                            @XM01562*/
         L     @15,RPLIIBFR+76(,RRPL)                              0787
         ST    @15,IIW1CBF(,RIICB)                                 0787
*     END;                          /* AFTER GET             @XM01562*/
*   DCBWKPT5=RIICB;                 /* INIT DCB TO POINT TO IICB   0789
*                                      REFERENCED BY PL/I            */
@RF00784 LA    @15,52                                              0789
         ALR   @15,RDCB                                            0789
         ST    RIICB,DCBWKPT5(,@15)                                0789
*   IF DCBMFLCP=ON THEN             /* IF PUT LOCATE                 */
         TM    DCBMFLCP+40(RDCB),B'00001000'                       0790
         BNO   @RF00790                                            0790
*     DCBWKPT6=ADDR(IIKEYPT)-4;     /* QISAM LOAD - ISLVPTR PTR    0791
*                                      ISLVPTRS + 4 = KEYSAVE        */
         LA    @10,IIKEYPT(,RIICB)                                 0791
         SL    @10,@CF00199                                        0791
         ST    @10,DCBWKPT6(,@15)                                  0791
*   IF(DCBMFMVP=ON×                 /* IF LOAD MODE          @XM01562
*                                      (PUT MOVE OR PUT      @XM01562*/
*       DCBMFLCP=ON)&               /* LOCATE) AND THE       @XM01562*/
*       AMDNLR>ZERO THEN            /* DATA SET CONTAINS     @XM01562*/
@RF00790 TM    DCBMFMVP+40(RDCB),B'00011000'                       0792
         BZ    @RF00792                                            0792
         L     @15,ACBAMBL(,RACB)                                  0792
         L     @15,AMBLDTA(,@15)                                   0792
         L     @15,AMBDSB(,@15)                                    0792
         L     @15,AMDNLR(,@15)                                    0792
         LTR   @15,@15                                             0792
         BNP   @RF00792                                            0792
*     DCBSTLOD=ON;                  /* TURN ON RESUME LOAD BIT     0793
*                                                            @XM01562*/
         OI    DCBSTLOD+52(RDCB),B'00100000'                       0793
*   ELSE                                                           0794
*     DCBSTLOD=OFF;                 /* ELSE TURN RL BIT OFF  @XM01562
*                                      MAP OPTCD FROM JFCB TO DCB TO
*                                      OVERRIDE DCB EXIT CHGS        */
         B     @RC00792                                            0794
@RF00792 NI    DCBSTLOD+52(RDCB),B'11011111'                       0794
*   JFCBPTR=ADDR(DXJBF);            /* INIT JFCB PTR         @Y021130*/
@RC00792 LA    JFCBPTR,DXJBF(,RCORE)                               0795
*   IF JFCDEL=ON×DCBOPTL=ON THEN    /* IF OPTCD=L IN AMP OR DCB      */
         TM    JFCDEL(JFCBPTR),B'00000010'                         0796
         BO    @RT00796                                            0796
         TM    DCBOPTL+52(RDCB),B'00000010'                        0796
         BNO   @RF00796                                            0796
@RT00796 DS    0H                                                  0797
*     DO;                                                          0797
*       DCBOPTI=OFF;                /* TURN OFF DCB OPTCD=I          */
*       DCBOPTL=ON;                 /* TURN ON DCB OPTCD=L           */
         LA    @15,52                                              0799
         ALR   @15,RDCB                                            0799
         OI    DCBOPTL(@15),B'00000010'                            0799
         NI    DCBOPTI(@15),B'11101111'                            0799
*       IF JFCIND=ON THEN           /* IF OPTCD=I IN AMP PARM        */
         TM    JFCIND(JFCBPTR),B'00010000'                         0800
         BNO   @RF00800                                            0800
*         DCBOPTI=ON;               /* TURN ON DCB OPTCD=I           */
         OI    DCBOPTI(@15),B'00010000'                            0801
*     END;                                                         0802
@RF00800 DS    0H                                                  0803
*   DCBRORG1=ZERO;                  /* INIT DCB REORGANIZATION       */
@RF00796 SLR   @15,@15                                             0803
         LA    @10,52                                              0803
         ALR   @10,RDCB                                            0803
         STH   @15,DCBRORG1(,@10)                                  0803
*   DCBRORG2=IIRORG2;               /* FIELDS FOR REFERENCES         */
         MVC   DCBRORG2(2,@10),IIRORG2                             0804
*   DCBRORG3=ZERO;                  /* BY ISAM PROBLEM PROGRAMS      */
         ST    @15,DCBRORG3(,@10)                                  0805
*   DCBOFLGS=ZERO;                  /* CLEAR OFLAGS                  */
         LA    @15,40                                              0806
         ALR   @15,RDCB                                            0806
         MVI   DCBOFLGS(@15),X'00'                                 0806
*   DCBOFOPN=ON;                    /* OPEN BIT ON - SUCCESSFUL      */
*   DCBOFUEX=ON;                    /* LOCK BIT OFF (=1)             */
         OI    DCBOFOPN(@15),B'00010010'                           0808
*   RESPECIFY                                                      0809
*    (JFCBPTR) UNRESTRICTED;                                       0809
*   END DCBINIT;                                                   0810
@EL00018 DS    0H                                                  0810
@EF00018 DS    0H                                                  0810
@ER00018 BR    @14                                                 0810
*   GEN(IDAPATCH);                                                 0811
         IDAPATCH
*   END IDA0192I                                                   0812
*                                                                  0812
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */
*/*%INCLUDE SYSLIB  (IDAIIREG)                                       */
*/*%INCLUDE SYSLIB  (IDAIICB )                                       */
*/*%INCLUDE SYSLIB  (IHADCBDF)                                       */
*/*%INCLUDE SYSLIB  (IHADCB  )                                       */
*/*%INCLUDE SYSLIB  (IFGRPL  )                                       */
*/*%INCLUDE SYSLIB  (IDARPLE )                                       */
*/*%INCLUDE SYSLIB  (IKJTCB  )                                       */
*/*%INCLUDE SYSLIB  (IEFJFCBN)                                       */
*/*%INCLUDE SYSLIB  (IEZDEB  )                                       */
*/*%INCLUDE SYSLIB  (IFGACB  )                                       */
*/*%INCLUDE SYSLIB  (IFGEXLST)                                       */
*/*%INCLUDE SYSLIB  (IDAAMBL )                                       */
*/*%INCLUDE SYSLIB  (IDAAMB  )                                       */
*/*%INCLUDE SYSLIB  (IDAAMDSB)                                       */
*/*%INCLUDE SYSLIB  (IDACMB  )                                       */
*/*%INCLUDE SYSLIB  (IDAERMSG)                                       */
*/*%INCLUDE SYSLIB  (IDAERRCD)                                       */
*/*%INCLUDE SYSLIB  (IECDSECT)                                       */
*                                                                  0812
*       ;                                                          0812
         B     @EL00001                                            0812
@DATA    DS    0H
@CH02175 DC    H'20'
@DATD    DSECT
         DS    0F
IDA0192I CSECT
         DS    0F
@CF00087 DC    F'1'
@CF00098 DC    F'2'
@CF00199 DC    F'4'
@CH00199 EQU   @CF00199+2
@CF00045 DC    F'8'
@CH00045 EQU   @CF00045+2
@CF00210 DC    F'16'
@CF02486 DC    F'36'
@CF02106 DC    F'104'
@CH02106 EQU   @CF02106+2
@CF02483 DC    F'112'
@CF02487 DC    F'241664'
@CF02508 DC    F'-8'
@CF02428 DC    XL4'80000000'
@DATD    DSECT
         DS    0D
DEBDAPTR DS    A
DEBEXPTR DS    A
DEBSBPTR DS    A
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA
@ENDDATD EQU   *
IDA0192I CSECT
         DS    0F
@SIZDATD DC    AL1(0)
         DC    AL3(@ENDDATD-@DATD)
         DS    0D
DEBID    DC    X'0F'
IIRORG2  DC    X'7FFF'
@00      EQU   00                      EQUATES FOR REGISTERS 0-15
@01      EQU   01
@02      EQU   02
@03      EQU   03
@04      EQU   04
@05      EQU   05
@06      EQU   06
@07      EQU   07
@08      EQU   08
@09      EQU   09
@10      EQU   10
@11      EQU   11
@12      EQU   12
@13      EQU   13
@14      EQU   14
@15      EQU   15
GPR01F   EQU   @01
R0       EQU   @00
R1       EQU   @01
RDCB     EQU   @01
RIICB    EQU   @02
RRPL     EQU   @03
RCORE    EQU   @04
RBUFF    EQU   @05
RACB     EQU   @06
RPARC    EQU   @07
RWORK2   EQU   @07
R8       EQU   @08
RWORK3   EQU   @08
RGMSP    EQU   @08
R9       EQU   @09
JFCBPTR  EQU   @09
RTIOT    EQU   @09
RGMLEN   EQU   @09
R10      EQU   @10
RLKRETSV EQU   @10
R11      EQU   @11
RDEB     EQU   @11
DEBPTR   EQU   @11
R13      EQU   @13
R14      EQU   @14
R15      EQU   @15
GPR00F   EQU   @00
GPR00P   EQU   @00
GPR01P   EQU   @01
GPR14F   EQU   @14
GPR14P   EQU   @14
GPR15F   EQU   @15
GPR15P   EQU   @15
RDECB    EQU   @01
RFMADDR  EQU   @07
RWORK1   EQU   @06
R12      EQU   @12
R2       EQU   @02
R3       EQU   @03
R4       EQU   @04
R5       EQU   @05
R6       EQU   @06
R7       EQU   @07
CVTPTR   EQU   16
IDAIICB  EQU   0
IICBID   EQU   IDAIICB
IICBLEN  EQU   IDAIICB+2
IIDCBPTR EQU   IDAIICB+4
IIACBPTR EQU   IDAIICB+8
IIRPLPTR EQU   IDAIICB+12
IIW1CBF  EQU   IDAIICB+16
IIMAXLRL EQU   IIW1CBF+2
IIKEYPT  EQU   IDAIICB+20
IIFLAG1  EQU   IDAIICB+24
IIFTEST  EQU   IIFLAG1
IIQBFRS  EQU   IIFLAG1
IIACBL   EQU   IDAIICB+25
IIFLAG2  EQU   IDAIICB+28
MRKP     EQU   IIFLAG2
MLRECL   EQU   IIFLAG2
MBLKSI   EQU   IIFLAG2
MOPTCD   EQU   IIFLAG2
MRECFM   EQU   IIFLAG2
MBUFL    EQU   IIFLAG2
MBUFNO   EQU   IIFLAG2
MKEYLE   EQU   IIFLAG2
IIRPLL   EQU   IDAIICB+29
IIKEYSL  EQU   IDAIICB+32
IIBUFL   EQU   IDAIICB+34
IIFLAG3  EQU   IDAIICB+36
MBFALN   EQU   IIFLAG3
IIMSGL   EQU   IDAIICB+37
IIMSGPTR EQU   IDAIICB+40
IIBUFNO  EQU   IDAIICB+44
IITBUFL  EQU   IDAIICB+45
IISVCLST EQU   IDAIICB+48
IISAMSYN EQU   IDAIICB+52
IIREGSAV EQU   IDAIICB+60
IIAUD    EQU   IDAIICB+132
IIAUDHDR EQU   IIAUD
IIAUDFL1 EQU   IIAUDHDR
AUDACBOP EQU   IIAUDFL1
AUDACBRO EQU   IIAUDFL1
AUDDCBEX EQU   IIAUDFL1
AUDDCBRT EQU   IIAUDFL1
AUDPRMOD EQU   IIAUDFL1
AUDIISYN EQU   IIAUDFL1
AUDURSYN EQU   IIAUDFL1
IIAUDFL2 EQU   IIAUDHDR+1
AUDIIFBF EQU   IIAUDFL2
IIGMCNTR EQU   IIAUDHDR+2
IIGMAUD  EQU   IIAUD+4
AUDCSPLI EQU   IIGMAUD+4
AUDCSPLD EQU   IIGMAUD+12
AUDCSPLB EQU   IIGMAUD+20
AUDCSPLM EQU   IIGMAUD+28
IIGMNTRY EQU   0
IIGMADDR EQU   IIGMNTRY
IIGMSPLG EQU   IIGMNTRY+4
IHADCB   EQU   0
IHADCS00 EQU   0
DCBFDAD  EQU   IHADCS00+5
IHADCS01 EQU   0
DCBDVTBL EQU   IHADCS01
IHADCS11 EQU   0
DCBRELB  EQU   IHADCS11
DCBKEYLE EQU   DCBRELB
DCBREL   EQU   DCBRELB+1
DCBDEVT  EQU   DCBREL
DCBBUFCB EQU   IHADCS11+4
DCBBUFNO EQU   DCBBUFCB
DCBBUFCA EQU   DCBBUFCB+1
DCBBUFL  EQU   IHADCS11+8
DCBDSORG EQU   IHADCS11+10
DCBDSRG1 EQU   DCBDSORG
DCBDSRG2 EQU   DCBDSORG+1
DCBIOBAD EQU   IHADCS11+12
DCBODEB  EQU   DCBIOBAD
DCBLNP   EQU   DCBODEB
DCBQSLM  EQU   DCBLNP
DCBIOBAA EQU   DCBODEB+1
IHADCS50 EQU   0
DCBSVCXL EQU   IHADCS50
DCBSVCXA EQU   DCBSVCXL+1
DCBEODAD EQU   IHADCS50+4
DCBBFALN EQU   DCBEODAD
DCBHIARC EQU   DCBBFALN
DCBBFTEK EQU   DCBHIARC
DCBBFT   EQU   DCBBFTEK
DCBBFA   EQU   DCBBFTEK
DCBEXLST EQU   IHADCS50+8
DCBRECFM EQU   DCBEXLST
DCBRECLA EQU   DCBRECFM
DCBRECL  EQU   DCBRECLA
DCBRECBR EQU   DCBRECFM
DCBEXLSA EQU   DCBEXLST+1
IHADCS24 EQU   0
DCBDDNAM EQU   IHADCS24
DCBOFLGS EQU   IHADCS24+8
DCBOFLWR EQU   DCBOFLGS
DCBOFOPN EQU   DCBOFLGS
DCBOFUEX EQU   DCBOFLGS
DCBIFLG  EQU   IHADCS24+9
DCBIBPCT EQU   DCBIFLG
DCBMACR  EQU   IHADCS24+10
DCBMACR1 EQU   DCBMACR
DCBMRFE  EQU   DCBMACR1
DCBMRGET EQU   DCBMRFE
DCBMRAPG EQU   DCBMACR1
DCBMRRD  EQU   DCBMRAPG
DCBMRCI  EQU   DCBMACR1
DCBMRMVG EQU   DCBMRCI
DCBMRLCG EQU   DCBMACR1
DCBMRABC EQU   DCBMACR1
DCBMRPT1 EQU   DCBMRABC
DCBMRSBG EQU   DCBMRPT1
DCBMRCRL EQU   DCBMACR1
DCBMRCHK EQU   DCBMRCRL
DCBMRRDX EQU   DCBMRCHK
DCBMRDMG EQU   DCBMACR1
DCBMACR2 EQU   DCBMACR+1
DCBMRPUT EQU   DCBMACR2
DCBMRWRT EQU   DCBMACR2
DCBMRMVP EQU   DCBMACR2
DCBMR5WD EQU   DCBMACR2
DCBMRLDM EQU   DCBMR5WD
DCBMRLCP EQU   DCBMRLDM
DCBMR4WD EQU   DCBMACR2
DCBMRPT2 EQU   DCBMR4WD
DCBMRTMD EQU   DCBMRPT2
DCBMR3WD EQU   DCBMACR2
DCBMRCTL EQU   DCBMR3WD
DCBMRSTK EQU   DCBMRCTL
DCBMR1WD EQU   DCBMACR2
DCBMRSWA EQU   DCBMR1WD
DCBMRDMD EQU   DCBMRSWA
IHADCS25 EQU   0
DCBMACRF EQU   IHADCS25+2
DCBMACF1 EQU   DCBMACRF
DCBMFFE  EQU   DCBMACF1
DCBMFGET EQU   DCBMFFE
DCBMFAPG EQU   DCBMACF1
DCBMFRD  EQU   DCBMFAPG
DCBMFCI  EQU   DCBMACF1
DCBMFMVG EQU   DCBMFCI
DCBMFLCG EQU   DCBMACF1
DCBMFABC EQU   DCBMACF1
DCBMFPT1 EQU   DCBMFABC
DCBMFSBG EQU   DCBMFPT1
DCBMFDBF EQU   DCBMFSBG
DCBMFCRL EQU   DCBMACF1
DCBMFCHK EQU   DCBMFCRL
DCBMFDMG EQU   DCBMACF1
DCBMACF2 EQU   DCBMACRF+1
DCBMFPUT EQU   DCBMACF2
DCBMFWRT EQU   DCBMACF2
DCBMFMVP EQU   DCBMACF2
DCBMF5WD EQU   DCBMACF2
DCBMFLDM EQU   DCBMF5WD
DCBMFLCP EQU   DCBMFLDM
DCBMF4WD EQU   DCBMACF2
DCBMFPT2 EQU   DCBMF4WD
DCBMFTMD EQU   DCBMFPT2
DCBMFUIP EQU   DCBMFTMD
DCBMF3WD EQU   DCBMACF2
DCBMFCTL EQU   DCBMF3WD
DCBMFSTK EQU   DCBMFCTL
DCBMF1WD EQU   DCBMACF2
DCBMFSWA EQU   DCBMF1WD
DCBMFDMD EQU   DCBMFSWA
DCBDEBAD EQU   IHADCS25+4
DCBIFLGS EQU   DCBDEBAD
DCBIFPCT EQU   DCBIFLGS
DCBDEBA  EQU   DCBDEBAD+1
IHADCS27 EQU   0
DCBGET   EQU   IHADCS27
DCBPUT   EQU   DCBGET
DCBGETA  EQU   DCBPUT+1
IHADCS29 EQU   0
DCBOPTCD EQU   IHADCS29
DCBOPTW  EQU   DCBOPTCD
DCBOPTI  EQU   DCBOPTCD
DCBOPTL  EQU   DCBOPTCD
DCBMAC   EQU   IHADCS29+1
DCBSYNAD EQU   IHADCS29+4
DCBRKP   EQU   IHADCS29+8
DCBBLKSI EQU   IHADCS29+10
DCBMSHI  EQU   IHADCS29+20
DCBNCP   EQU   DCBMSHI
DCBSETL  EQU   IHADCS29+24
DCBEXCD1 EQU   IHADCS29+28
DCBEXCD2 EQU   IHADCS29+29
DCBEXLTH EQU   DCBEXCD2
DCBLRECL EQU   IHADCS29+30
DCBESETL EQU   IHADCS29+32
DCBLRAN  EQU   IHADCS29+36
DCBLWKN  EQU   IHADCS29+40
DCBFREED EQU   IHADCS29+56
DCBNCRHI EQU   IHADCS29+98
DCBRORG3 EQU   IHADCS29+100
DCBST    EQU   IHADCS29+108
DCBSTLOD EQU   DCBST
DCBRORG2 EQU   IHADCS29+154
DCBRORG1 EQU   IHADCS29+172
DCBWKPT1 EQU   IHADCS29+176
DCBWKPT5 EQU   IHADCS29+192
DCBWKPT6 EQU   IHADCS29+196
IHADCS55 EQU   0
IFGRPL   EQU   0
RPLCOMN  EQU   IFGRPL
RPLIDWD  EQU   RPLCOMN
RPLID    EQU   RPLIDWD
RPLLEN   EQU   RPLIDWD+3
RPLECB   EQU   RPLCOMN+8
RPLFDBWD EQU   RPLCOMN+12
RPLFDBK  EQU   RPLFDBWD+1
RPLRTNCD EQU   RPLFDBK
RPLCNDCD EQU   RPLFDBK+1
RPLCMPON EQU   RPLCNDCD
RPLFDB2  EQU   RPLCMPON
RPLERRCD EQU   RPLCNDCD+1
RPLFDB3  EQU   RPLERRCD
RPLKEYLE EQU   RPLCOMN+16
RPLDACB  EQU   RPLCOMN+24
RPLARG   EQU   RPLCOMN+36
RPLOPTCD EQU   RPLCOMN+40
RPLOPT1  EQU   RPLOPTCD
RPLDIR   EQU   RPLOPT1
RPLSEQ   EQU   RPLOPT1
RPLECBSW EQU   RPLOPT1
RPLOPT2  EQU   RPLOPTCD+1
RPLKEY   EQU   RPLOPT2
RPLADR   EQU   RPLOPT2
RPLUPD   EQU   RPLOPT2
RPLOPT3  EQU   RPLOPTCD+2
RPLNXTRP EQU   RPLCOMN+44
RPLRLEN  EQU   RPLCOMN+48
RPLBUFL  EQU   RPLCOMN+52
RPLOPTC2 EQU   RPLCOMN+56
RPLOPT5  EQU   RPLOPTC2
RPLWRTYP EQU   RPLOPT5
RPLOPT6  EQU   RPLOPTC2+1
RPLUNTYP EQU   RPLOPT6
RPLOPT7  EQU   RPLOPTC2+2
RPLCNOPT EQU   RPLOPT7
RPLOPT8  EQU   RPLOPTC2+3
RPLRBAR  EQU   RPLCOMN+60
RPLAIXID EQU   RPLRBAR+2
RPLEXTDS EQU   RPLCOMN+68
RPLEXTD1 EQU   RPLEXTDS
RPLEMLEN EQU   RPLCOMN+70
RPLERMSA EQU   RPLCOMN+72
IDARPLE  EQU   0
RPLIICB  EQU   IDARPLE
RPLIIBFR EQU   IDARPLE+8
RPLRPLPT EQU   IDARPLE+12
TCBFIX   EQU   0
TCBFRS   EQU   TCBFIX
TCBPTR   EQU   4
TCB      EQU   0
TCBPIE   EQU   TCB+4
TCBPMASK EQU   TCBPIE
TCBDEB   EQU   TCB+8
TCBCMP   EQU   TCB+16
TCBCMPF  EQU   TCBCMP
TCBCPP   EQU   TCBCMPF
TCBSTCC  EQU   TCBCMPF
TCBCDBL  EQU   TCBCMPF
TCBCWTO  EQU   TCBCMPF
TCBCIND  EQU   TCBCMPF
TCBCMSG  EQU   TCBCMPF
TCBTRN   EQU   TCB+20
TCBABF   EQU   TCBTRN
TCBMSS   EQU   TCB+24
TCBPKF   EQU   TCB+28
TCBFLGS  EQU   TCB+29
TCBFLGS1 EQU   TCBFLGS
TCBFLGS2 EQU   TCBFLGS+1
TCBFLGS3 EQU   TCBFLGS+2
TCBFLGS4 EQU   TCBFLGS+3
TCBFLGS5 EQU   TCBFLGS+4
TCBABWF  EQU   TCBFLGS5
TCBDSP   EQU   TCB+35
TCBJPQ   EQU   TCB+44
TCBPURGE EQU   TCBJPQ
TCBGRS   EQU   TCB+48
TCBFSA   EQU   TCB+112
TCBTME   EQU   TCB+120
TCBJSTCB EQU   TCB+124
TCBTSFLG EQU   TCB+148
TCBTSTSK EQU   TCBTSFLG
TCBSTAB  EQU   TCB+160
TCBNSTAE EQU   TCBSTAB
TCBTCT   EQU   TCB+164
TCBTCTGF EQU   TCBTCT
TCBSCNDY EQU   TCB+172
TCBNDSP  EQU   TCBSCNDY
TCBNDSP1 EQU   TCBNDSP+1
TCBNDSP2 EQU   TCBNDSP+2
TCBNDSP3 EQU   TCBNDSP+3
TCBJSCB  EQU   TCB+180
TCBRECDE EQU   TCBJSCB
TCBEXT1  EQU   TCB+196
TCBBITS  EQU   TCB+200
TCBNDSP4 EQU   TCBBITS
TCBNDSP5 EQU   TCBBITS+1
TCBFLGS6 EQU   TCBBITS+2
TCBFLGS7 EQU   TCBBITS+3
TCBDAR   EQU   TCB+204
TCBDARC  EQU   TCBDAR
TCBEXT2  EQU   TCB+208
TCBFOE   EQU   TCB+244
TCBESTAE EQU   TCB+264
TCBESTRM EQU   TCBESTAE+1
TCBFBYT1 EQU   TCB+276
TCBFBYT2 EQU   TCB+277
TCBRV124 EQU   TCB+278
TCBRV133 EQU   TCB+279
TCBXTNT2 EQU   0
TCBGTF   EQU   TCBXTNT2
TCBTFLG  EQU   TCBGTF
TCBRV146 EQU   TCBXTNT2+28
TCBRV155 EQU   TCBXTNT2+29
TCBRV164 EQU   TCBXTNT2+30
TCBRV173 EQU   TCBXTNT2+31
INFMJFCB EQU   0
JFCBDSNM EQU   INFMJFCB
JFCBELNM EQU   INFMJFCB+44
JFCBTSDM EQU   INFMJFCB+52
JFCFCBID EQU   INFMJFCB+56
JFCBFRID EQU   JFCFCBID
JFCBLTYP EQU   INFMJFCB+66
JFCBOTTR EQU   INFMJFCB+67
JFCBUFOF EQU   JFCBOTTR
JFCBFLSQ EQU   JFCBOTTR+1
JFCFUNC  EQU   JFCBFLSQ
JFCBMASK EQU   INFMJFCB+72
JFCBFLG1 EQU   JFCBMASK+5
JFCOPEN  EQU   JFCBFLG1
JFCBFLG2 EQU   JFCBMASK+6
JFCDEFER EQU   JFCBFLG2
JFCBIND1 EQU   INFMJFCB+86
JFCBIND2 EQU   INFMJFCB+87
JFCDISP  EQU   JFCBIND2
JFCAMPTR EQU   INFMJFCB+88
JFCBUFRQ EQU   JFCAMPTR
JFCBUFNO EQU   JFCBUFRQ
JFCBGNCP EQU   JFCAMPTR+1
JFCBHIAR EQU   JFCBGNCP
JFCBFALN EQU   JFCBHIAR
JFCBFTEK EQU   JFCBFALN
JFCBBFTA EQU   JFCBFTEK
JFCEROPT EQU   INFMJFCB+92
JFCTRTCH EQU   INFMJFCB+93
DEBBASIC EQU   0
DEBTCBAD EQU   DEBBASIC
DEBTCBB  EQU   DEBTCBAD+1
DEBDEBAD EQU   DEBBASIC+4
DEBAMLNG EQU   DEBDEBAD
DEBDEBB  EQU   DEBDEBAD+1
DEBIRBAD EQU   DEBBASIC+8
DEBOFLGS EQU   DEBIRBAD
DEBOPATB EQU   DEBBASIC+12
DEBABEND EQU   DEBOPATB
DEBFLGS1 EQU   DEBBASIC+14
DEBCINDI EQU   DEBFLGS1
DEBXTNIN EQU   DEBFLGS1
DEBUSRPG EQU   DEBBASIC+16
DEBNMEXT EQU   DEBUSRPG
DEBRRQ   EQU   DEBBASIC+20
DEBECBAD EQU   DEBRRQ
DEBPRIOR EQU   DEBECBAD
DEBDCBAD EQU   DEBBASIC+24
DEBPROTG EQU   DEBDCBAD
DEBDCBB  EQU   DEBDCBAD+1
DEBAPPAD EQU   DEBBASIC+28
DEBEXSCL EQU   DEBAPPAD
DEBAPPB  EQU   DEBAPPAD+1
DEBBASND EQU   DEBBASIC+32
DEBDASD  EQU   0
DEBUCBAD EQU   DEBDASD
DEBUCBA  EQU   DEBUCBAD+1
DEBACSMD EQU   0
DEBVOLSQ EQU   DEBACSMD
DEBVOLBT EQU   DEBVOLSQ
DEBDSNM  EQU   DEBACSMD+4
DEBUTSAA EQU   DEBDSNM
DEBACS01 EQU   0
DEBDSNAM EQU   DEBACS01
DEBACS02 EQU   0
DEBDBLK  EQU   DEBACS02
DEBACS03 EQU   0
DEBACS04 EQU   0
DEBTBFRA EQU   DEBACS04
DEBTCCWA EQU   DEBACS04+4
DEBACS05 EQU   0
DEBFUCBA EQU   DEBACS05
DEBLUCBA EQU   DEBACS05+4
DEBACS06 EQU   0
DEBACS07 EQU   0
DEBWKPT5 EQU   DEBACS07+12
DEBACS08 EQU   0
DEBFREED EQU   DEBACS08+16
DEBSUBNM EQU   0
DEB      EQU   0
DEBAVT   EQU   DEB
DEBEOEA  EQU   DEBAVT
DEBEOEAB EQU   DEBEOEA
DEBSIOA  EQU   DEBAVT+4
DEBSIOAB EQU   DEBSIOA
DEBPCIA  EQU   DEBAVT+8
DEBPCIAB EQU   DEBPCIA
DEBCEA   EQU   DEBAVT+12
DEBCEAB  EQU   DEBCEA
DEBXCEA  EQU   DEBAVT+16
DEBXCEAB EQU   DEBXCEA
DEBPREFX EQU   DEB+20
DEBXTNP  EQU   DEBPREFX+8
DEBLNGTH EQU   DEBPREFX+12
DEBXTN   EQU   0
DEBXFLG1 EQU   DEBXTN+2
DEBXDBPR EQU   DEBXTN+12
IFGACB   EQU   0
ACBCOMN  EQU   IFGACB
ACBID    EQU   ACBCOMN
ACBLENG  EQU   ACBCOMN+2
ACBLENG2 EQU   ACBLENG
ACBAMBL  EQU   ACBCOMN+4
ACBJWA   EQU   ACBAMBL
ACBMACRF EQU   ACBCOMN+12
ACBMACR1 EQU   ACBMACRF
ACBKEY   EQU   ACBMACR1
ACBADR   EQU   ACBMACR1
ACBCNV   EQU   ACBMACR1
ACBSEQ   EQU   ACBMACR1
ACBDIR   EQU   ACBMACR1
ACBIN    EQU   ACBMACR1
ACBOUT   EQU   ACBMACR1
ACBMACR2 EQU   ACBMACRF+1
ACBBUFPL EQU   ACBCOMN+20
ACBMACR3 EQU   ACBBUFPL
ACBRECFM EQU   ACBCOMN+24
ACBCCTYP EQU   ACBCOMN+25
ACBOPT   EQU   ACBCOMN+26
ACBDSORG EQU   ACBOPT
ACBCROPS EQU   ACBDSORG
ACBDORGA EQU   ACBDSORG+1
ACBPASSW EQU   ACBCOMN+32
ACBEXLST EQU   ACBCOMN+36
ACBDDNM  EQU   ACBCOMN+40
ACBAMETH EQU   ACBDDNM+3
ACBOFLGS EQU   ACBCOMN+48
ACBOPEN  EQU   ACBOFLGS
ACBEXFG  EQU   ACBOFLGS
ACBIOSFG EQU   ACBOFLGS
ACBERFLG EQU   ACBCOMN+49
ACBINFLG EQU   ACBCOMN+50
ACBUJFCB EQU   ACBCOMN+52
ACBBLKSZ EQU   ACBCOMN+60
IFGEXLST EQU   0
EXLCOMN  EQU   IFGEXLST
EXLID    EQU   EXLCOMN
EXLLEN   EQU   EXLCOMN+2
EXLEODF  EQU   EXLCOMN+5
EXLEODP  EQU   EXLCOMN+6
EXLSYNF  EQU   EXLCOMN+10
EXLSYNP  EQU   EXLCOMN+11
EXLLERF  EQU   EXLCOMN+15
EXLLERP  EQU   EXLCOMN+16
EXLSCIPF EQU   EXLCOMN+20
EXLUPADF EQU   EXLSCIPF
EXLSCIPS EQU   EXLUPADF
EXLSCIPA EQU   EXLUPADF
EXLSCIPK EQU   EXLUPADF
EXLSCIPP EQU   EXLCOMN+21
EXLLGNF  EQU   EXLCOMN+25
EXLJRNF  EQU   EXLCOMN+30
EXLOPNF  EQU   EXLCOMN+35
IFGEXLEF EQU   0
EXLENTRY EQU   IFGEXLEF
EXLFLAG  EQU   EXLENTRY
EXLENFL  EQU   EXLFLAG
EXLEXITP EQU   EXLENTRY+1
IDAAMBL  EQU   0
AMBLEOV  EQU   IDAAMBL+12
AMBLEFLG EQU   AMBLEOV
AMBLDDNM EQU   IDAAMBL+16
AMBLIDF  EQU   AMBLDDNM
AMBLQ    EQU   AMBLIDF+7
AMBLVC   EQU   IDAAMBL+28
AMBLTYPE EQU   IDAAMBL+30
AMBLSHAR EQU   IDAAMBL+33
AMBLFLG1 EQU   IDAAMBL+35
AMBLFLG2 EQU   IDAAMBL+36
AMBLDTA  EQU   IDAAMBL+52
AMBLCMB  EQU   IDAAMBL+64
IDAAMB   EQU   0
AMBDSB   EQU   IDAAMB+20
AMBEOVR  EQU   IDAAMB+24
AMBFLG0  EQU   AMBEOVR
AMBFLG1  EQU   IDAAMB+25
AMBDSORG EQU   IDAAMB+26
AMBIOBAD EQU   IDAAMB+28
AMBINFL  EQU   IDAAMB+42
AMBDEBPT EQU   IDAAMB+44
AMBOFLGS EQU   IDAAMB+48
AMBFLG2  EQU   IDAAMB+49
AMBEOVPT EQU   IDAAMB+56
AMBCSWD1 EQU   IDAAMB+84
AMBAFLG  EQU   AMBCSWD1
IDAAMDSB EQU   0
AMDATTR  EQU   IDAAMDSB+1
AMDWCK   EQU   AMDATTR
AMDNEST  EQU   IDAAMDSB+4
AMDRKP   EQU   IDAAMDSB+6
AMDKEYLN EQU   IDAAMDSB+8
AMDLRECL EQU   IDAAMDSB+24
AMDHLRBA EQU   IDAAMDSB+28
AMDSSRBA EQU   IDAAMDSB+32
AMDATTR3 EQU   IDAAMDSB+40
AMDSTAT  EQU   IDAAMDSB+48
AMDNLR   EQU   AMDSTAT+12
IDACMB   EQU   0
CMBFLGS  EQU   IDACMB+4
CMBNST   EQU   IDACMB+5
CMBPTRS  EQU   IDACMB+8
IDAERMSG EQU   0
ERBASE   EQU   IDAERMSG
ERLGTH   EQU   ERBASE
ERDEVD   EQU   ERBASE+107
FORCORE  EQU   0
DXDSCB   EQU   FORCORE
DSCCORE  EQU   FORCORE+96
DXJBF    EQU   FORCORE+100
DXDAADDR EQU   FORCORE+312
DXDCB    EQU   FORCORE+320
DXCCW    EQU   FORCORE+368
DXVOLSR  EQU   FORCORE+500
DXVOLSR1 EQU   DXVOLSR
DXVOLSR2 EQU   DXVOLSR+6
DXVOLSR3 EQU   DXVOLSR+12
DXUKEY   EQU   FORCORE+526
DXDEBXAD EQU   FORCORE+552
DXTIOTAD EQU   FORCORE+556
DXUCBSAV EQU   FORCORE+564
DXUDCBAD EQU   FORCORE+568
DXPDCBAD EQU   FORCORE+572
DXATCOM1 EQU   FORCORE+588
DXATGENS EQU   DXATCOM1
DXATVGIV EQU   DXATGENS
DXATOUTA EQU   DXATCOM1+2
DXATDACC EQU   DXATCOM1+3
DXATCOM2 EQU   FORCORE+592
DXATEOV  EQU   DXATCOM2
DXATOPEN EQU   DXATCOM2+1
DXATALL  EQU   DXATCOM2+2
DXATCOM4 EQU   FORCORE+600
DXATEXC1 EQU   FORCORE+604
DXATEXB1 EQU   DXATEXC1
DXATEXC2 EQU   FORCORE+608
PARCNTRY EQU   0
PARCOPT  EQU   PARCNTRY
SCANPTR  EQU   0
EXLST    EQU   0
EXCODE   EQU   EXLST
EXLAST   EQU   EXCODE
EXADDR   EQU   EXLST+1
PCOPYDCB EQU   16
BCB      EQU   0
BCBFSBUF EQU   BCB
BCBBUFNO EQU   BCB+4
BCBBUFL  EQU   BCB+6
BUFLINK  EQU   0
CVTSVDCB EQU   84
CVTTCBDW EQU   0
TIOTDD   EQU   0
TIOEDDNM EQU   TIOTDD+4
TIOEFSRT EQU   TIOTDD+17
UCBTYP   EQU   19
SVRBPTR  EQU   0
SVRB     EQU   0
XRBREG   EQU   SVRB+32
XRBXSAV  EQU   SVRB+96
IKEBC    EQU   0
IKEBF15  EQU   0
IKEBF31  EQU   0
IKEBP15  EQU   0
IKEBP31  EQU   0
IKEBP8   EQU   0
KEYAREA  EQU   0
TIOTPTR  EQU   12
JFCKEYLE EQU   JFCTRTCH
JFCCODE  EQU   JFCKEYLE
JFCSTACK EQU   JFCTRTCH
JFCMODE  EQU   JFCSTACK
JFCSPPRT EQU   JFCTRTCH
JFCBABFS EQU   JFCSPPRT+2
JFCLIMCT EQU   JFCBABFS
JFCDSORG EQU   JFCSPPRT+5
JFCDSRG1 EQU   JFCDSORG
JFCDSRG2 EQU   JFCDSORG+1
JFCRECFM EQU   JFCSPPRT+7
JFCRCFM  EQU   JFCRECFM
JFCOPTCD EQU   JFCSPPRT+8
JFCWVCSP EQU   JFCOPTCD
JFCWVCIS EQU   JFCWVCSP
JFCWVCBD EQU   JFCWVCIS
JFCALLOW EQU   JFCOPTCD
JFCRSV17 EQU   JFCALLOW
JFCOVER  EQU   JFCRSV17
JFCPCIBT EQU   JFCOPTCD
JFCMAST  EQU   JFCPCIBT
JFCEXT   EQU   JFCMAST
JFCBCKPT EQU   JFCOPTCD
JFCIND   EQU   JFCBCKPT
JFCRSV18 EQU   JFCOPTCD
JFCCYL   EQU   JFCRSV18
JFCACT   EQU   JFCCYL
JFCREDUC EQU   JFCOPTCD
JFCRSV19 EQU   JFCREDUC
JFCRSV20 EQU   JFCRSV19
JFCRSV21 EQU   JFCOPTCD
JFCDEL   EQU   JFCRSV21
JFCOPTJ  EQU   JFCOPTCD
JFCREORG EQU   JFCOPTJ
JFCBLKSI EQU   JFCSPPRT+9
JFCBUFSI EQU   JFCBLKSI
JFCAMSYN EQU   JFCSPPRT+11
JFCNCP   EQU   JFCAMSYN+2
JFCNTM   EQU   JFCAMSYN+3
JFCBFSEQ EQU   JFCNTM
JFCPCI   EQU   JFCBFSEQ
JFCRESRV EQU   JFCAMSYN+4
JFCUCSEG EQU   JFCRESRV
JFCUCSOP EQU   JFCUCSEG+4
JFCOUTLI EQU   JFCUCSEG+5
JFCTHRSH EQU   JFCOUTLI
JFCCPRI  EQU   JFCTHRSH
JFCBVOLS EQU   JFCUCSEG+10
JFCBS001 EQU   JFCBVOLS
JFCBPQTY EQU   JFCBS001+34
JFCBCTRI EQU   JFCBS001+37
JFCBSQTY EQU   JFCBS001+38
JFCFLGS1 EQU   JFCBS001+41
JFCBSPNM EQU   JFCBS001+45
JFCBFLG3 EQU   JFCBSPNM
DEBBAS02 EQU   DEBBASND
DEBDDS1  EQU   DEBBAS02
DEBSUCBA EQU   DEBDDS1
DEBDEVED EQU   DEBDDS1+4
DEBRDCB  EQU   DEBDDS1+4
DEBPDCB  EQU   DEBDDS1+8
DEBWDCB  EQU   DEBDDS1+12
DEBACS09 EQU   DEBDEVED
DEBASC09 EQU   DEBACS09
DEBEAMFG EQU   DEBASC09+3
DEBDSID  EQU   DEBASC09+4
DEBEOD   EQU   DEBASC09+12
DEBBOE   EQU   DEBEOD
DEBEODRV EQU   DEBBOE
DEBEODTT EQU   DEBBOE+1
DEBEOD0  EQU   DEBBOE+2
DEBEODSS EQU   DEBBOE+3
DEBBAS01 EQU   DEBBASND
DEBISAM  EQU   DEBBAS01
DEBFIEAD EQU   DEBISAM
DEBFPEAD EQU   DEBISAM+4
DEBFPEB  EQU   DEBFPEAD+1
DEBFOEAD EQU   DEBISAM+8
DEBEXPT  EQU   DEBISAM+12
DEBRPSID EQU   DEBEXPT
DEBEXPTA EQU   DEBEXPT+1
IIWAOWA  EQU   DXCCW
IIRSAVE1 EQU   IIWAOWA
IIRSAVE2 EQU   IIWAOWA+4
IIRSAVE3 EQU   IIWAOWA+8
@NM00097 EQU   IIWAOWA+16
MAINADDR EQU   @NM00097
MAINR0   EQU   IIWAOWA+20
MAINPOOL EQU   MAINR0
MAINLEN  EQU   MAINR0+1
IIRSAVE  EQU   IIWAOWA+28
DCBII    EQU   DCBGET
DCBIIGET EQU   DCBII+1
DCBIIPUT EQU   DCBIIGET
ISAMDCB  EQU   DCBKEYLE
IIAUDPTR EQU   DXATCOM4+8
BUFADDR  EQU   DCBBUFCB
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS
@NM00101 EQU   DCBII
@NM00099 EQU   IIWAOWA+32
@NM00098 EQU   IIWAOWA+24
@NM00096 EQU   IIWAOWA+12
DEBRSV12 EQU   DEBRPSID
DEBRSV11 EQU   DEBRPSID
DEBRSV10 EQU   DEBRPSID
DEBRSV09 EQU   DEBRPSID
DEBRPSAP EQU   DEBRPSID
DEBRPSO  EQU   DEBRPSID
DEBRPSI  EQU   DEBRPSID
DEBRPSP  EQU   DEBRPSID
DEBFOEB  EQU   DEBFOEAD+1
DEBNOEE  EQU   DEBFOEAD
DEBNPEE  EQU   DEBFPEAD
DEBFIEB  EQU   DEBFIEAD+1
DEBNIEE  EQU   DEBFIEAD
DEBBOESS EQU   DEBEODSS
DEBBOE0  EQU   DEBEOD0
DEBBOETT EQU   DEBEODTT
DEBBOERV EQU   DEBEODRV
DEBRV008 EQU   DEBDSID+7
DEBWTPTI EQU   DEBDSID+6
DEBEXDTE EQU   DEBDSID
DEBRV007 EQU   DEBEAMFG
DEBRV006 EQU   DEBEAMFG
DEBRV005 EQU   DEBEAMFG
DEBRV004 EQU   DEBEAMFG
DEBSECVL EQU   DEBEAMFG
DEBVAMSG EQU   DEBEAMFG
DEBDSOPN EQU   DEBEAMFG
DEBMULTI EQU   DEBEAMFG
DEBVSEQU EQU   DEBASC09+2
DEBDSSQL EQU   DEBASC09+1
DEBVOLAC EQU   DEBASC09
DEBWDCBA EQU   DEBWDCB+1
DEBRSV08 EQU   DEBWDCB
DEBPDCBA EQU   DEBPDCB+1
DEBRSV07 EQU   DEBPDCB
DEBRDCBA EQU   DEBRDCB+1
DEBRSV06 EQU   DEBRDCB
DEBSUCBB EQU   DEBSUCBA+1
DEBSDVM  EQU   DEBSUCBA
JFCBEND  EQU   JFCBS001+58
JFCBSPTN EQU   JFCBS001+57
JFCBVLCT EQU   JFCBS001+56
JFCBDRLH EQU   JFCBS001+53
JFCBSBNM EQU   JFCBS001+50
JFCBABST EQU   JFCBS001+48
JFCBRV08 EQU   JFCBSPNM+1
JFCBRV07 EQU   JFCBFLG3
JFCBRV06 EQU   JFCBFLG3
JFCBRV05 EQU   JFCBFLG3
JFCBRV04 EQU   JFCBFLG3
JFCBRV03 EQU   JFCBFLG3
JFCBRV02 EQU   JFCBFLG3
JFCBEXP  EQU   JFCBFLG3
JFCDQDSP EQU   JFCBFLG3
JFCBDQTY EQU   JFCBS001+42
JFCBUAFF EQU   JFCFLGS1
JFCRSV45 EQU   JFCFLGS1
JFCVRDS  EQU   JFCFLGS1
JFCBCEOV EQU   JFCFLGS1
JFCRSV42 EQU   JFCFLGS1
JFCBADSP EQU   JFCFLGS1
JFCTOPEN EQU   JFCFLGS1
JFCBDLET EQU   JFCFLGS1
JFCRQID  EQU   JFCBSQTY
JFCROUND EQU   JFCBCTRI
JFCALX   EQU   JFCBCTRI
JFCMIXG  EQU   JFCBCTRI
JFCONTIG EQU   JFCBCTRI
JFCRSV29 EQU   JFCBCTRI
JFCBMSGP EQU   JFCBCTRI
JFCBSPAC EQU   JFCBCTRI
JFCRUNIT EQU   JFCBPQTY
JFCBEXAD EQU   JFCBS001+31
JFCBEXTL EQU   JFCBS001+30
JFCMSVGP EQU   JFCBS001+22
@NM00038 EQU   JFCBS001
JFCAVOLS EQU   JFCBVOLS
JFCBNVOL EQU   JFCUCSEG+9
JFCBNTCS EQU   JFCUCSEG+8
JFCSOWA  EQU   JFCOUTLI+1
JFCSEND  EQU   JFCCPRI
JFCEQUAL EQU   JFCCPRI
JFCRECV  EQU   JFCCPRI
JFCRSV34 EQU   JFCCPRI
JFCRSV33 EQU   JFCCPRI
JFCRSV55 EQU   JFCCPRI
JFCRSV54 EQU   JFCCPRI
JFCRSV53 EQU   JFCCPRI
JFCRSV27 EQU   JFCUCSOP
JFCRSV26 EQU   JFCUCSOP
JFCFCBVR EQU   JFCUCSOP
JFCFCBAL EQU   JFCUCSOP
JFCVER   EQU   JFCUCSOP
JFCRSV25 EQU   JFCUCSOP
JFCFOLD  EQU   JFCUCSOP
JFCBEXTP EQU   JFCUCSOP
JFCUCSID EQU   JFCUCSEG
JFCINTVL EQU   JFCSPPRT+19
JFCDBUFN EQU   JFCRESRV+3
JFCCYLOF EQU   JFCRESRV+2
JFCRKP   EQU   JFCRESRV
JFCPCIR2 EQU   JFCPCI
JFCPCIR1 EQU   JFCPCI
JFCPCIN2 EQU   JFCPCI
JFCPCIN1 EQU   JFCPCI
JFCPCIA2 EQU   JFCPCI
JFCPCIA1 EQU   JFCPCI
JFCPCIX2 EQU   JFCPCI
JFCPCIX1 EQU   JFCPCI
JFCBUFMX EQU   JFCNCP
JFCLRECL EQU   JFCAMSYN
JFCBAXBF EQU   JFCBUFSI
JFCREL   EQU   JFCREORG
JFCRSV22 EQU   JFCDEL
JFCSRCHD EQU   JFCRSV20
JFCOPTQ  EQU   JFCACT
JFCFEED  EQU   JFCIND
JFCCBWU  EQU   JFCEXT
JFCWUMSG EQU   JFCOVER
JFCSDNAM EQU   JFCWVCBD
@NM00037 EQU   JFCRECFM
JFCCHAR  EQU   JFCRECFM
JFCRFS   EQU   JFCRECFM
JFCRFB   EQU   JFCRECFM
JFCRFO   EQU   JFCRCFM
JFCFMREC EQU   JFCRCFM
JFCRSV16 EQU   JFCDSRG2
JFCRSV15 EQU   JFCDSRG2
JFCORGTR EQU   JFCDSRG2
JFCORGAM EQU   JFCDSRG2
JFCRSV13 EQU   JFCDSRG2
JFCORGTQ EQU   JFCDSRG2
JFCORGTX EQU   JFCDSRG2
JFCORGGS EQU   JFCDSRG2
JFCORGU  EQU   JFCDSRG1
JFCORGPO EQU   JFCDSRG1
JFCORGMQ EQU   JFCDSRG1
JFCORGCQ EQU   JFCDSRG1
JFCORGCX EQU   JFCDSRG1
JFCORGDA EQU   JFCDSRG1
JFCORGPS EQU   JFCDSRG1
JFCORGIS EQU   JFCDSRG1
JFCTRKBL EQU   JFCLIMCT+1
@NM00036 EQU   JFCLIMCT
JFCDEN   EQU   JFCSPPRT+1
JFCPRTSP EQU   JFCSPPRT
JFCONE   EQU   JFCMODE
JFCTWO   EQU   JFCMODE
JFCRSV07 EQU   JFCMODE
JFCRSV06 EQU   JFCMODE
JFCMODER EQU   JFCMODE
JFCMODEO EQU   JFCMODE
JFCEBCD  EQU   JFCMODE
JFCBIN   EQU   JFCMODE
JFCRSV32 EQU   JFCCODE
JFCTTY   EQU   JFCCODE
JFCASCII EQU   JFCCODE
JFCNCR   EQU   JFCCODE
JFCBUR   EQU   JFCCODE
JFCFRI   EQU   JFCCODE
JFCBCD   EQU   JFCCODE
JFCNOCON EQU   JFCCODE
@NM00104 EQU   SVRB
@NM00103 EQU   TIOTDD+12
@NM00102 EQU   TIOTDD
PARCDCB  EQU   PARCNTRY+1
PARCACCS EQU   PARCOPT
@NM00100 EQU   PARCOPT
DSECTSIZ EQU   FORCORE+612
DXATEXB2 EQU   DXATEXC2
DXEXHASP EQU   DXATEXB1
DXATCOM3 EQU   FORCORE+596
@NM00095 EQU   DXATCOM2+3
@NM00094 EQU   DXATALL
DXATSWAP EQU   DXATALL
DXATFC   EQU   DXATALL
@NM00093 EQU   DXATOPEN
DXATDFIN EQU   DXATOPEN
DXATDSIN EQU   DXATOPEN
DXATMODM EQU   DXATOPEN
DXATMODE EQU   DXATOPEN
DXATMODS EQU   DXATOPEN
DXATIGN  EQU   DXATOPEN
DXATVCAT EQU   DXATEOV
DXATDADM EQU   DXATEOV
DXATREMT EQU   DXATEOV
DXATDNEW EQU   DXATEOV
DXATDFRE EQU   DXATEOV
DXATDCHN EQU   DXATEOV
DXATNVOL EQU   DXATEOV
DXATCCAT EQU   DXATEOV
DXATRDDB EQU   DXATDACC
DXATEOF  EQU   DXATDACC
@NM00092 EQU   DXATDACC
DXATSMF  EQU   DXATDACC
DXATUPDB EQU   DXATDACC
DXATDRCT EQU   DXATDACC
DXATTRAK EQU   DXATDACC
DXATF1CE EQU   DXATDACC
DXATNSL  EQU   DXATOUTA
DXATTTM2 EQU   DXATOUTA
DXATTTM1 EQU   DXATOUTA
DXATTRL2 EQU   DXATOUTA
DXATTRL1 EQU   DXATOUTA
DXATDATM EQU   DXATOUTA
DXATHDTM EQU   DXATOUTA
DXATVLHD EQU   DXATOUTA
DXATCLOS EQU   DXATCOM1+1
DXATSRET EQU   DXATGENS
DXATVCIG EQU   DXATVGIV
DXATVTMG EQU   DXATVGIV
DXATVSMG EQU   DXATVGIV
DXATJFCB EQU   DXATGENS
DXATDISP EQU   DXATGENS
DXATREFR EQU   DXATGENS
DXATDMCT EQU   DXATGENS
DXMSGADR EQU   FORCORE+584
DXPRPARC EQU   FORCORE+580
DXUDCBML EQU   FORCORE+578
DXUDCBPL EQU   FORCORE+576
DXPACBAD EQU   DXPDCBAD+1
@NM00091 EQU   DXPDCBAD
DXUACBAD EQU   DXUDCBAD+1
@NM00090 EQU   DXUDCBAD
DXUCBSVV EQU   DXUCBSAV+1
@NM00089 EQU   DXUCBSAV
DXUCBADR EQU   FORCORE+560
DXDSAB   EQU   FORCORE+548
DXDSABAD EQU   FORCORE+544
DXDSABQD EQU   FORCORE+540
DXJSCBAD EQU   FORCORE+536
DXTCBADR EQU   FORCORE+532
DXASCBAD EQU   FORCORE+528
DXEXTSW  EQU   FORCORE+527
DXWKEYSV EQU   FORCORE+525
DXRESSW  EQU   FORCORE+524
DXUNITOF EQU   FORCORE+522
DXNOUNIT EQU   FORCORE+520
DXVOLSEQ EQU   FORCORE+518
DXVOLMT3 EQU   DXVOLSR3
DXVOLMT2 EQU   DXVOLSR2
DXVOLMT1 EQU   DXVOLSR1
DXWORK4  EQU   FORCORE+496
DXWORK3  EQU   FORCORE+492
DXWORK2  EQU   FORCORE+488
DXWORK1  EQU   FORCORE+484
DXWORK   EQU   FORCORE+480
DXXCTL   EQU   FORCORE+472
@NM00088 EQU   FORCORE+464
DXCCW12  EQU   DXCCW+88
DXCCW11  EQU   DXCCW+80
DXCCW10  EQU   DXCCW+72
DXCCW9   EQU   DXCCW+64
DXCCW8   EQU   DXCCW+56
DXCCW7   EQU   DXCCW+48
DXCCW6   EQU   DXCCW+40
DXCCW5   EQU   DXCCW+32
DXCCW4   EQU   DXCCW+24
DXCCW3   EQU   DXCCW+16
DXCCW2   EQU   DXCCW+8
DXCCW1   EQU   DXCCW
DXDCBDEB EQU   DXDCB+44
@NM00087 EQU   DXDCB+24
DXDEBDCB EQU   DXDCB+20
@NM00086 EQU   DXDCB
DXDEB    EQU   DXDAADDR+4
@NM00085 EQU   DXDAADDR
DXIOB    EQU   FORCORE+280
DXECB    EQU   FORCORE+276
DXLBL    EQU   DXDSCB
ERDAAM   EQU   ERDEVD+15
ERDACOM  EQU   ERDEVD+14
ERDASEEK EQU   ERDEVD
COMMA8   EQU   ERBASE+106
ERDESC   EQU   ERBASE+91
COMMA7   EQU   ERBASE+90
EROPER   EQU   ERBASE+84
COMMA6   EQU   ERBASE+83
ERDDNM   EQU   ERBASE+75
COMMA5   EQU   ERBASE+74
ERUNTYPE EQU   ERBASE+72
COMMA4   EQU   ERBASE+71
ERUNIT   EQU   ERBASE+68
COMMA3   EQU   ERBASE+67
ERSTEPNM EQU   ERBASE+59
COMMA2   EQU   ERBASE+58
ERJOBNM  EQU   ERBASE+50
COMMA1   EQU   ERBASE+49
ERMVOL   EQU   ERBASE+43
COMMA9   EQU   ERBASE+42
ERMDSID  EQU   ERBASE+36
COMMA05  EQU   ERBASE+35
ERRBA    EQU   ERBASE+27
COMMA0   EQU   ERBASE+26
ERTIME   EQU   ERBASE+18
ERCOMMA  EQU   ERBASE+17
ERDATE   EQU   ERBASE+12
ERMBFRA  EQU   ERBASE+8
ERMZERO2 EQU   ERLGTH+6
ERMLL2   EQU   ERLGTH+4
ERMZERO1 EQU   ERLGTH+2
ERMLL1   EQU   ERLGTH
@NM00084 EQU   CMBPTRS+52
CMBFXDPT EQU   CMBPTRS+48
CMBPUSPT EQU   CMBPTRS+44
CMBPSTPT EQU   CMBPTRS+40
CMBEDBPT EQU   CMBPTRS+36
CMBDEBPT EQU   CMBPTRS+32
CMBUBFPT EQU   CMBPTRS+28
CMBBFRPT EQU   CMBPTRS+24
CMBUFSPT EQU   CMBPTRS+20
CMBFSTPT EQU   CMBPTRS+16
CMBUSPTR EQU   CMBPTRS+12
CMBSTPTR EQU   CMBPTRS+8
CMBPRPTR EQU   CMBPTRS+4
CMBUSRPT EQU   CMBPTRS
CMBCNT   EQU   IDACMB+6
CMBOUT   EQU   CMBFLGS
CMBLEN   EQU   IDACMB+2
@NM00083 EQU   IDACMB+1
CMBID    EQU   IDACMB
AMDEXCP  EQU   AMDSTAT+44
AMDNCAS  EQU   AMDSTAT+40
AMDNCIS  EQU   AMDSTAT+36
AMDASPA  EQU   AMDSTAT+32
AMDRETR  EQU   AMDSTAT+28
AMDUPR   EQU   AMDSTAT+24
AMDIREC  EQU   AMDSTAT+20
AMDDELR  EQU   AMDSTAT+16
AMDNEXT  EQU   AMDSTAT+10
AMDNIL   EQU   AMDSTAT+8
AMDSTSP  EQU   AMDSTAT
@NM00082 EQU   IDAAMDSB+41
@NM00081 EQU   AMDATTR3
AMDLM    EQU   AMDATTR3
AMDWAIT  EQU   AMDATTR3
AMDBIND  EQU   AMDATTR3
AMDFAULT EQU   AMDATTR3
AMDUNQ   EQU   AMDATTR3
AMDPARDB EQU   IDAAMDSB+36
AMDMAXRR EQU   AMDSSRBA
AMDNSLOT EQU   AMDHLRBA
AMDCINV  EQU   IDAAMDSB+20
AMDFSCI  EQU   IDAAMDSB+16
AMDFSCA  EQU   IDAAMDSB+14
AMDCIPCA EQU   IDAAMDSB+12
AMDPCTCI EQU   IDAAMDSB+11
AMDPCTCA EQU   IDAAMDSB+10
AMDAXRKP EQU   AMDNEST
AMDLEN   EQU   IDAAMDSB+2
AMDSPAN  EQU   AMDATTR
AMDRRDS  EQU   AMDATTR
AMDRANGE EQU   AMDATTR
AMDORDER EQU   AMDATTR
AMDREPL  EQU   AMDATTR
AMDSDT   EQU   AMDATTR
AMDDST   EQU   AMDATTR
AMDSBID  EQU   IDAAMDSB
AMBTRACE EQU   IDAAMB+120
AMBVIOT  EQU   IDAAMB+116
AMBSZCP  EQU   IDAAMB+114
AMBSZFW  EQU   IDAAMB+112
AMBSZWR  EQU   IDAAMB+110
AMBSZRD  EQU   IDAAMB+108
AMBEXEX  EQU   IDAAMB+100
AMBWSHD  EQU   IDAAMB+96
AMBCPA   EQU   IDAAMB+92
AMBBM2SH EQU   IDAAMB+88
AMBRDCNT EQU   AMBCSWD1+2
@NM00080 EQU   AMBCSWD1+1
@NM00079 EQU   AMBAFLG
AMBCFX   EQU   AMBAFLG
AMBSIS   EQU   AMBAFLG
AMBDFR   EQU   AMBAFLG
AMBICI   EQU   AMBAFLG
AMBGSR   EQU   AMBAFLG
AMBLSR   EQU   AMBAFLG
@NM00078 EQU   AMBAFLG
AMBUPLH  EQU   IDAAMB+80
AMBPAMBL EQU   IDAAMB+76
AMBPIXP  EQU   IDAAMB+72
@NM00077 EQU   IDAAMB+68
AMBIWA   EQU   IDAAMB+64
AMBWKA   EQU   IDAAMB+60
AMBAMBXN EQU   AMBEOVPT
AMBEDB   EQU   IDAAMB+52
AMBRPT   EQU   IDAAMB+50
AMBPUG   EQU   AMBFLG2
AMBBUSY  EQU   AMBOFLGS
AMBEXFG  EQU   AMBOFLGS
@NM00076 EQU   AMBOFLGS
AMBOPEN  EQU   AMBOFLGS
@NM00075 EQU   AMBOFLGS
AMBDEBAD EQU   AMBDEBPT+1
AMBIFLGS EQU   AMBDEBPT
AMBAMETH EQU   IDAAMB+43
AMBUPX   EQU   AMBINFL
AMBUCRA  EQU   AMBINFL
AMBSCRA  EQU   AMBINFL
AMBCAT   EQU   AMBINFL
@NM00074 EQU   AMBINFL
@NM00073 EQU   AMBINFL
AMBTIOT  EQU   IDAAMB+40
@NM00072 EQU   IDAAMB+38
AMBDDSN  EQU   IDAAMB+35
AMBCDSN  EQU   IDAAMB+32
AMBIOMB  EQU   AMBIOBAD
@NM00071 EQU   AMBDSORG+1
AMBDORGA EQU   AMBDSORG+1
@NM00070 EQU   AMBDSORG
AMBINBUF EQU   AMBFLG1
AMBJRN   EQU   AMBFLG1
AMBUBF   EQU   AMBFLG1
AMBSPEED EQU   AMBFLG1
AMBPCAT  EQU   AMBFLG1
AMBMCAT  EQU   AMBFLG1
AMBTYPE  EQU   AMBFLG1
AMBCREAT EQU   AMBFLG1
@NM00069 EQU   AMBFLG0
AMBPSDS  EQU   AMBFLG0
AMBCACB  EQU   IDAAMB+16
AMBPH    EQU   IDAAMB+12
AMBBUFC  EQU   IDAAMB+8
AMBLINK  EQU   IDAAMB+4
AMBLEN   EQU   IDAAMB+2
AMBRSC   EQU   IDAAMB+1
AMBID    EQU   IDAAMB
AMBLBIB  EQU   IDAAMBL+60
AMBLIX   EQU   IDAAMBL+56
AMBLMIDS EQU   IDAAMBL+42
AMBLNIDS EQU   IDAAMBL+41
@NM00068 EQU   IDAAMBL+40
AMBLNUM  EQU   IDAAMBL+38
AMBLNST  EQU   IDAAMBL+37
@NM00067 EQU   AMBLFLG2
AMBLSTAG EQU   AMBLFLG2
@NM00066 EQU   AMBLFLG2
AMBLDUMY EQU   AMBLFLG1
AMBLCAT  EQU   AMBLFLG1
AMBLUCRA EQU   AMBLFLG1
AMBLSCRA EQU   AMBLFLG1
AMBLVVIC EQU   AMBLFLG1
AMBLUPD  EQU   AMBLFLG1
AMBLCINV EQU   AMBLFLG1
AMBLFULL EQU   AMBLFLG1
AMBLLEN  EQU   IDAAMBL+34
@NM00065 EQU   AMBLSHAR
AMBLWRIT EQU   AMBLSHAR
AMBLCATO EQU   AMBLSHAR
AMBLPRIM EQU   AMBLSHAR
AMBLID   EQU   IDAAMBL+32
@NM00064 EQU   IDAAMBL+31
@NM00063 EQU   AMBLTYPE
AMBLFIX  EQU   AMBLTYPE
AMBLBASE EQU   AMBLTYPE
AMBLAIX  EQU   AMBLTYPE
AMBLUPGR EQU   AMBLTYPE
AMBLPATH EQU   AMBLTYPE
AMBLENO  EQU   AMBLVC+1
AMBLVRT  EQU   AMBLVC
AMBLXPT  EQU   IDAAMBL+24
AMBLDFR  EQU   AMBLQ
AMBLESDS EQU   AMBLQ
AMBLKSDS EQU   AMBLQ
AMBLUBF  EQU   AMBLQ
AMBLFSTP EQU   AMBLQ
AMBLLSR  EQU   AMBLQ
AMBLGSR  EQU   AMBLQ
AMBLDDC  EQU   AMBLQ
AMBLDCI  EQU   AMBLIDF+4
AMBLCACB EQU   AMBLIDF
@NM00062 EQU   AMBLEOV+2
AMBLCOMP EQU   AMBLEOV+1
AMBLESET EQU   AMBLEFLG
AMBLWAIT EQU   AMBLEFLG
AMBLACB  EQU   IDAAMBL+8
AMBLSCHN EQU   IDAAMBL+4
AMBLPCHN EQU   IDAAMBL
EXLEADDR EQU   EXLEXITP
@NM00061 EQU   EXLENFL
EXLLNK   EQU   EXLENFL
EXLACTM  EQU   EXLENFL
EXLSPEC  EQU   EXLENFL
EXLOPNP  EQU   EXLCOMN+36
@NM00060 EQU   EXLOPNF
EXLOPNK  EQU   EXLOPNF
EXLOPNA  EQU   EXLOPNF
EXLOPNS  EQU   EXLOPNF
EXLJRNP  EQU   EXLCOMN+31
@NM00059 EQU   EXLJRNF
EXLJRNK  EQU   EXLJRNF
EXLJRNA  EQU   EXLJRNF
EXLJRNS  EQU   EXLJRNF
EXLLGNP  EQU   EXLCOMN+26
@NM00058 EQU   EXLLGNF
EXLLGNK  EQU   EXLLGNF
EXLLGNA  EQU   EXLLGNF
EXLLGNS  EQU   EXLLGNF
EXLUPADP EQU   EXLSCIPP
@NM00057 EQU   EXLUPADF
EXLUPADK EQU   EXLSCIPK
EXLUPADA EQU   EXLSCIPA
EXLUPADS EQU   EXLSCIPS
@NM00056 EQU   EXLLERF
EXLLERK  EQU   EXLLERF
EXLLERA  EQU   EXLLERF
EXLLERS  EQU   EXLLERF
@NM00055 EQU   EXLSYNF
EXLSYNK  EQU   EXLSYNF
EXLSYNA  EQU   EXLSYNF
EXLSYNS  EQU   EXLSYNF
@NM00054 EQU   EXLEODF
EXLEODK  EQU   EXLEODF
EXLEODA  EQU   EXLEODF
EXLEODS  EQU   EXLEODF
@NM00053 EQU   EXLCOMN+4
EXLLEN2  EQU   EXLLEN
EXLSTYP  EQU   EXLCOMN+1
ACBAPID  EQU   ACBCOMN+72
ACBCBMWA EQU   ACBCOMN+68
ACBUAPTR EQU   ACBCOMN+64
ACBLRECL EQU   ACBCOMN+62
ACBMSGLN EQU   ACBBLKSZ
ACBBUFSP EQU   ACBCOMN+56
@NM00052 EQU   ACBUJFCB+1
ACBOPTN  EQU   ACBUJFCB
ACBVVIC  EQU   ACBINFLG
ACBUCRA  EQU   ACBINFLG
ACBSCRA  EQU   ACBINFLG
ACBCAT   EQU   ACBINFLG
ACBIJRQE EQU   ACBINFLG
ACBJEPS  EQU   ACBINFLG
@NM00051 EQU   ACBINFLG
ACBBUSY  EQU   ACBIOSFG
ACBLOCK  EQU   ACBEXFG
@NM00050 EQU   ACBOFLGS
ACBDSERR EQU   ACBOFLGS
ACBEOV   EQU   ACBOFLGS
@NM00049 EQU   ACBOFLGS
ACBDEB   EQU   ACBDDNM+5
ACBERFL  EQU   ACBDDNM+4
ACBAM    EQU   ACBAMETH
ACBINFL  EQU   ACBDDNM+2
ACBTIOT  EQU   ACBDDNM
ACBUEL   EQU   ACBEXLST
ACBMSGAR EQU   ACBCOMN+28
@NM00048 EQU   ACBDSORG+1
@NM00047 EQU   ACBDSORG
ACBCRNRE EQU   ACBCROPS
ACBCRNCK EQU   ACBCROPS
ACBASA   EQU   ACBCCTYP
@NM00046 EQU   ACBCCTYP
ACBRECAF EQU   ACBRECFM
ACBJBUF  EQU   ACBBUFPL+2
ACBMACR4 EQU   ACBBUFPL+1
@NM00045 EQU   ACBMACR3
ACBNCFX  EQU   ACBMACR3
ACBSIS   EQU   ACBMACR3
ACBDFR   EQU   ACBMACR3
ACBICI   EQU   ACBMACR3
ACBGSR   EQU   ACBMACR3
ACBLSR   EQU   ACBMACR3
@NM00044 EQU   ACBMACR3
ACBBUFNI EQU   ACBCOMN+18
ACBBUFND EQU   ACBCOMN+16
ACBSTRNO EQU   ACBCOMN+15
ACBBSTNO EQU   ACBCOMN+14
ACBAIX   EQU   ACBMACR2
ACBDSN   EQU   ACBMACR2
ACBRST   EQU   ACBMACR2
ACBLOGON EQU   ACBMACR2
ACBSKP   EQU   ACBMACR2
@NM00043 EQU   ACBMACR2
ACBUBF   EQU   ACBMACR1
ACBBLK   EQU   ACBCNV
ACBADD   EQU   ACBADR
ACBINRTN EQU   ACBCOMN+8
ACBIBCT  EQU   ACBJWA
ACBLEN2  EQU   ACBLENG2
ACBSTYP  EQU   ACBCOMN+1
DEBXSAMB EQU   DEBXTN+28
DEBXOPNJ EQU   DEBXTN+24
DEBXXARG EQU   DEBXTN+20
DEBXMCF2 EQU   DEBXTN+19
DEBXMCF1 EQU   DEBXTN+18
DEBXDSO2 EQU   DEBXTN+17
DEBXDSO1 EQU   DEBXTN+16
DEBXDCBM EQU   DEBXTN+8
DEBXDSAB EQU   DEBXTN+4
DEBXRV48 EQU   DEBXTN+3
DEBXRV47 EQU   DEBXFLG1
DEBXRV46 EQU   DEBXFLG1
DEBXRV45 EQU   DEBXFLG1
DEBXRV44 EQU   DEBXFLG1
DEBXRV43 EQU   DEBXFLG1
DEBXDSSI EQU   DEBXFLG1
DEBXTSKC EQU   DEBXFLG1
DEBXCDCB EQU   DEBXFLG1
DEBXLNGH EQU   DEBXTN
DEBTBLOF EQU   DEBPREFX+14
DEBAMTYP EQU   DEBPREFX+13
DEBDCBMK EQU   DEBXTNP
DEBDSCBA EQU   DEBPREFX+1
DEBWKARA EQU   DEBPREFX
DEBXCEAD EQU   DEBXCEA+1
DEBXCENP EQU   DEBXCEAB
DEBRSV35 EQU   DEBXCEAB
DEBRSV34 EQU   DEBXCEAB
DEBRSV33 EQU   DEBXCEAB
DEBRSV32 EQU   DEBXCEAB
DEBCEAD  EQU   DEBCEA+1
DEBCENP  EQU   DEBCEAB
DEBRSV31 EQU   DEBCEAB
DEBRSV30 EQU   DEBCEAB
DEBRSV29 EQU   DEBCEAB
DEBRSV28 EQU   DEBCEAB
DEBPCIAD EQU   DEBPCIA+1
DEBPCINP EQU   DEBPCIAB
DEBRSV27 EQU   DEBPCIAB
DEBRSV26 EQU   DEBPCIAB
DEBRSV25 EQU   DEBPCIAB
DEBRSV24 EQU   DEBPCIAB
DEBSIOAD EQU   DEBSIOA+1
DEBSIONP EQU   DEBSIOAB
DEBFIX   EQU   DEBSIOAB
DEBIOVR  EQU   DEBSIOAB
DEBSIOX  EQU   DEBSIOAB
DEBPGFX  EQU   DEBSIOAB
DEBEOEAD EQU   DEBEOEA+1
DEBEOENP EQU   DEBEOEAB
DEBRSV22 EQU   DEBEOEAB
DEBRSV21 EQU   DEBEOEAB
DEBRSV20 EQU   DEBEOEAB
DEBESMVR EQU   DEBEOEAB
DEBSUBID EQU   DEBSUBNM
DEBSIOA2 EQU   DEBACS08+24
DEBRPSIO EQU   DEBACS08+20
@NM00042 EQU   DEBACS08+12
@NM00041 EQU   DEBACS08+8
DEBDISAD EQU   DEBACS08+4
@NM00040 EQU   DEBACS08
DEBRPSST EQU   DEBACS07+64
DEBARECK EQU   DEBACS07+60
DEBAREWT EQU   DEBACS07+56
DEBACHK  EQU   DEBACS07+52
DEBAWRIT EQU   DEBACS07+48
DEBASETL EQU   DEBACS07+44
DEBAREAD EQU   DEBACS07+40
DEBCRECK EQU   DEBACS07+36
DEBCREWT EQU   DEBACS07+32
DEBCCHK  EQU   DEBACS07+28
DEBCWRIT EQU   DEBACS07+24
DEBCSETL EQU   DEBACS07+20
DEBCREAD EQU   DEBACS07+16
DEBWKPT4 EQU   DEBACS07+8
DEBGET   EQU   DEBACS07+4
@NM00039 EQU   DEBACS07
DEBPUT   EQU   DEBACS06+4
DEBDCBFA EQU   DEBACS06
DEBLUCBB EQU   DEBLUCBA+1
DEBRSV18 EQU   DEBLUCBA
DEBFUCBB EQU   DEBFUCBA+1
DEBRSV17 EQU   DEBFUCBA
DEBTCCWB EQU   DEBTCCWA+1
DEBRSV16 EQU   DEBTCCWA
DEBTBFRB EQU   DEBTBFRA+1
DEBRSV15 EQU   DEBTBFRA
DEBDBPEF EQU   DEBACS03+8
DEBDBPP  EQU   DEBACS03+4
DEBDTPP  EQU   DEBACS03
DEBDBPE  EQU   DEBDBLK+1
DEBDBPT  EQU   DEBDBLK
DEBEXTNM EQU   DEBDSNAM
DEBLRECL EQU   DEBACSMD+14
DEBBLKSI EQU   DEBACSMD+12
DEBRSV14 EQU   DEBDSNM+4
DEBUTSAB EQU   DEBUTSAA+1
DEBRSV13 EQU   DEBUTSAA
DEBVOLNM EQU   DEBACSMD+2
DEBVLSEQ EQU   DEBVOLSQ+1
DEBRSV42 EQU   DEBVOLBT
DEBRSV41 EQU   DEBVOLBT
DEBRSV40 EQU   DEBVOLBT
DEBRSV39 EQU   DEBVOLBT
DEBRSV38 EQU   DEBVOLBT
DEBRSV37 EQU   DEBVOLBT
DEBRSV36 EQU   DEBVOLBT
DEBEXFUL EQU   DEBVOLBT
DEBNMTRK EQU   DEBDASD+14
DEBENDHH EQU   DEBDASD+12
DEBENDCC EQU   DEBDASD+10
DEBSTRHH EQU   DEBDASD+8
DEBSTRCC EQU   DEBDASD+6
DEBBINUM EQU   DEBDASD+4
DEBDVMOD EQU   DEBUCBAD
DEBDEBID EQU   DEBPROTG
DEBECBB  EQU   DEBECBAD+1
DEBUSRPB EQU   DEBUSRPG+1
DEBRSV05 EQU   DEBBASIC+15
DEBAPFIN EQU   DEBFLGS1
DEBF1CEV EQU   DEBFLGS1
DEBRSV02 EQU   DEBFLGS1
DEBRSIOA EQU   DEBFLGS1
DEBEOFDF EQU   DEBFLGS1
DEBPWCKD EQU   DEBFLGS1
DEBQSCNT EQU   DEBBASIC+13
DEBACCS  EQU   DEBOPATB
DEBPOSIT EQU   DEBOPATB
DEBZERO  EQU   DEBOPATB
DEBIRBB  EQU   DEBIRBAD+1
DEBRERR  EQU   DEBOFLGS
DEBLABEL EQU   DEBOFLGS
DEBSPLIT EQU   DEBOFLGS
DEBDCB   EQU   DEBOFLGS
DEBRLSE  EQU   DEBOFLGS
DEBEOF   EQU   DEBOFLGS
DEBDISP  EQU   DEBOFLGS
DEBNMSUB EQU   DEBTCBAD
JFCRSV05 EQU   JFCEROPT
JFCRSV04 EQU   JFCEROPT
JFCRSV03 EQU   JFCEROPT
JFCRSV02 EQU   JFCEROPT
JFCTOPT  EQU   JFCEROPT
JFCABN   EQU   JFCEROPT
JFCSKP   EQU   JFCEROPT
JFCACC   EQU   JFCEROPT
JFCBUFL  EQU   JFCAMPTR+2
JFCFWORD EQU   JFCBFTEK
JFCDWORD EQU   JFCBFTEK
JFCHIER1 EQU   JFCBFTEK
JFCDYN   EQU   JFCBFTEK
JFCEXC   EQU   JFCBFTEK
JFCBBFTR EQU   JFCBBFTA
JFCSIM   EQU   JFCBBFTA
JFCHIER  EQU   JFCBFTEK
JFCBFOUT EQU   JFCBUFNO
JFCBUFIN EQU   JFCBUFNO
JFCTEMP  EQU   JFCBIND2
JFCREQ   EQU   JFCBIND2
JFCENT   EQU   JFCBIND2
JFCSHARE EQU   JFCBIND2
JFCSECUR EQU   JFCBIND2
JFCPDS   EQU   JFCBIND1
JFCGDG   EQU   JFCBIND1
JFCADDED EQU   JFCBIND1
JFCLOC   EQU   JFCBIND1
JFCRLSE  EQU   JFCBIND1
JFCBXPDT EQU   INFMJFCB+83
JFCBCRDT EQU   INFMJFCB+80
JFCBOPS2 EQU   JFCBMASK+7
JFCRCTLG EQU   JFCBFLG2
JFCBBUFF EQU   JFCBFLG2
JFCTRACE EQU   JFCBFLG2
JFCSDRPS EQU   JFCBFLG2
JFCMODNW EQU   JFCBFLG2
JFCNRPS  EQU   JFCDEFER
JFCOUTOP EQU   JFCBFLG2
JFCINOP  EQU   JFCBFLG2
JFCBPWBP EQU   JFCOPEN
@NM00035 EQU   JFCOPEN
JFCDUAL  EQU   JFCBFLG1
JFCSLDES EQU   JFCBFLG1
JFCSLCRE EQU   JFCBFLG1
JFCSTAND EQU   JFCBFLG1
JFCBOPS1 EQU   JFCBMASK
JFCBVLSQ EQU   INFMJFCB+70
JFCRSV31 EQU   JFCFUNC
JFCFNCBT EQU   JFCFUNC
JFCFNCBX EQU   JFCFUNC
JFCFNCBD EQU   JFCFUNC
JFCFNCBW EQU   JFCFUNC
JFCFNCBP EQU   JFCFUNC
JFCFNCBR EQU   JFCFUNC
JFCFNCBI EQU   JFCFUNC
JFCBFOFL EQU   JFCBUFOF
JFCNL    EQU   JFCBLTYP
JFCSL    EQU   JFCBLTYP
JFCNSL   EQU   JFCBLTYP
JFCSUL   EQU   JFCBLTYP
JFCBLP   EQU   JFCBLTYP
JFCBLTM  EQU   JFCBLTYP
JFCBAL   EQU   JFCBLTYP
JFCRSV38 EQU   JFCBLTYP
JFCVINDX EQU   INFMJFCB+64
JFCNLREC EQU   INFMJFCB+62
JFCBADBF EQU   INFMJFCB+60
JFCAMSTR EQU   JFCBFRID+2
JFCAMCRO EQU   JFCBFRID
JFCBDSCB EQU   INFMJFCB+53
JFCPAT   EQU   JFCBTSDM
JFCNDCB  EQU   JFCBTSDM
JFCNDSCB EQU   JFCBTSDM
JFCNWRIT EQU   JFCBTSDM
JFCTTR   EQU   JFCBTSDM
JFCSDS   EQU   JFCBTSDM
JFCVSL   EQU   JFCBTSDM
JFCCAT   EQU   JFCBTSDM
JFCIPLTX EQU   JFCBELNM
JFCBQNAM EQU   JFCBDSNM
@NM00034 EQU   TCBXTNT2+32
TCBRV181 EQU   TCBRV173
TCBRV180 EQU   TCBRV173
TCBRV179 EQU   TCBRV173
TCBRV178 EQU   TCBRV173
TCBRV177 EQU   TCBRV173
TCBRV176 EQU   TCBRV173
TCBRV175 EQU   TCBRV173
TCBRV174 EQU   TCBRV173
TCBRV172 EQU   TCBRV164
TCBRV171 EQU   TCBRV164
TCBRV170 EQU   TCBRV164
TCBRV169 EQU   TCBRV164
TCBRV168 EQU   TCBRV164
TCBRV167 EQU   TCBRV164
TCBRV166 EQU   TCBRV164
TCBRV165 EQU   TCBRV164
TCBRV163 EQU   TCBRV155
TCBRV162 EQU   TCBRV155
TCBRV161 EQU   TCBRV155
TCBRV160 EQU   TCBRV155
TCBRV159 EQU   TCBRV155
TCBRV158 EQU   TCBRV155
TCBRV157 EQU   TCBRV155
TCBRV156 EQU   TCBRV155
TCBRV154 EQU   TCBRV146
TCBRV153 EQU   TCBRV146
TCBRV152 EQU   TCBRV146
TCBRV151 EQU   TCBRV146
TCBRV150 EQU   TCBRV146
TCBRV149 EQU   TCBRV146
TCBRV148 EQU   TCBRV146
TCBRV147 EQU   TCBRV146
TCBRV145 EQU   TCBXTNT2+26
TCBRV144 EQU   TCBXTNT2+24
TCBCAUF  EQU   TCBXTNT2+20
TCBRV142 EQU   TCBXTNT2+16
TCBRSV49 EQU   TCBXTNT2+12
TCBEVENT EQU   TCBXTNT2+8
TCBRCMP  EQU   TCBXTNT2+5
TCBRSVAB EQU   TCBXTNT2+4
TCBGTFA  EQU   TCBGTF+1
TCBRSV47 EQU   TCBTFLG
TCBRSV46 EQU   TCBTFLG
TCBRSV45 EQU   TCBTFLG
TCBRSV44 EQU   TCBTFLG
TCBRSV43 EQU   TCBTFLG
TCBDSPIT EQU   TCBTFLG
TCBERRTN EQU   TCBTFLG
TCBASYNC EQU   TCBTFLG
@NM00033 EQU   TCB+296
TCBSVCA2 EQU   TCB+292
TCBSWASA EQU   TCB+288
TCBDBTB  EQU   TCB+284
TCBRPT   EQU   TCB+280
TCBRV141 EQU   TCBRV133
TCBRV140 EQU   TCBRV133
TCBRV139 EQU   TCBRV133
TCBRV138 EQU   TCBRV133
TCBRV137 EQU   TCBRV133
TCBRV136 EQU   TCBRV133
TCBRV135 EQU   TCBRV133
TCBRV134 EQU   TCBRV133
TCBRV132 EQU   TCBRV124
TCBRV131 EQU   TCBRV124
TCBRV130 EQU   TCBRV124
TCBRV129 EQU   TCBRV124
TCBRV128 EQU   TCBRV124
TCBRV127 EQU   TCBRV124
TCBRV126 EQU   TCBRV124
TCBRV125 EQU   TCBRV124
TCBRV123 EQU   TCBFBYT2
TCBRV122 EQU   TCBFBYT2
TCBECBNV EQU   TCBFBYT2
TCBSSSYN EQU   TCBFBYT2
TCBFPRAP EQU   TCBFBYT2
TCBFDW   EQU   TCBFBYT2
TCBFMW   EQU   TCBFBYT2
TCBCNCB  EQU   TCBFBYT2
TCBLLH   EQU   TCBFBYT1
TCBRV113 EQU   TCBFBYT1
TCBEOT   EQU   TCBFBYT1
TCBRTM2  EQU   TCBFBYT1
TCBPGNLY EQU   TCBFBYT1
TCBNDIOS EQU   TCBFBYT1
TCBACTIV EQU   TCBFBYT1
TCBEOTFM EQU   TCBFBYT1
TCBAFFN  EQU   TCB+274
TCBCCPVI EQU   TCB+272
TCBUKYSP EQU   TCB+268
TCBMODE  EQU   TCBESTAE+3
TCBERTYP EQU   TCBESTAE+2
TCBRV314 EQU   TCBESTRM
TCBRV313 EQU   TCBESTRM
TCBRV312 EQU   TCBESTRM
TCBRV311 EQU   TCBESTRM
TCBRV310 EQU   TCBESTRM
TCBRV309 EQU   TCBESTRM
TCBRV308 EQU   TCBESTRM
TCBETERM EQU   TCBESTRM
TCBSCBKY EQU   TCBESTAE
TCBRTM12 EQU   TCB+260
TCBTCBID EQU   TCB+256
TCBRSV96 EQU   TCB+252
TCBSWA   EQU   TCB+248
TCBFOEA  EQU   TCBFOE+1
TCBRSV42 EQU   TCBFOE
TCBRV306 EQU   TCB+240
TCBRSV41 EQU   TCB+239
TCBTID   EQU   TCB+238
TCBRSVAA EQU   TCB+237
TCBABCUR EQU   TCB+236
TCBTMSAV EQU   TCB+232
TCBIOTIM EQU   TCB+228
TCBRTWA  EQU   TCB+224
TCBBACK  EQU   TCB+220
TCBTIRB  EQU   TCB+216
TCBAECB  EQU   TCB+212
TCBEXT2A EQU   TCBEXT2+1
TCBRSV39 EQU   TCBEXT2
TCBSTMCT EQU   TCB+207
TCBSYSCT EQU   TCB+206
TCBRSV37 EQU   TCB+205
TCBEXSVC EQU   TCBDAR
TCBDARMS EQU   TCBDAR
TCBDARWT EQU   TCBDAR
TCBDARO  EQU   TCBDAR
TCBDARMC EQU   TCBDARC
TCBDARD  EQU   TCBDAR
TCBDARS  EQU   TCBDAR
TCBDARP  EQU   TCBDAR
TCBGTOFM EQU   TCBFLGS7
TCBADMP  EQU   TCBFLGS7
TCBRSTSK EQU   TCBFLGS7
TCBSVCS  EQU   TCBFLGS7
TCBSTACK EQU   TCBFLGS7
TCBRSV34 EQU   TCBFLGS7
TCBRSV33 EQU   TCBFLGS7
TCBGPECB EQU   TCBFLGS7
TCBNTJS  EQU   TCBFLGS6
TCBAPG   EQU   TCBFLGS6
TCBMIGR  EQU   TCBFLGS6
TCBRV303 EQU   TCBFLGS6
TCBSPVLK EQU   TCBFLGS6
TCBCPU   EQU   TCBFLGS6
TCBPIE17 EQU   TCBFLGS6
TCBRV    EQU   TCBFLGS6
TCBRSV79 EQU   TCBNDSP5
TCBRSV78 EQU   TCBNDSP5
TCBRSV77 EQU   TCBNDSP5
TCBRSV76 EQU   TCBNDSP5
TCBRSV75 EQU   TCBNDSP5
TCBRSV74 EQU   TCBNDSP5
TCBRSV95 EQU   TCBNDSP5
TCBRSV94 EQU   TCBNDSP5
TCBRSV93 EQU   TCBNDSP4
TCBRSV92 EQU   TCBNDSP4
TCBRSV91 EQU   TCBNDSP4
TCBRSV90 EQU   TCBNDSP4
TCBRSV89 EQU   TCBNDSP4
TCBRSV88 EQU   TCBNDSP4
TCBRSV87 EQU   TCBNDSP4
TCBRSV86 EQU   TCBNDSP4
TCBEXT1A EQU   TCBEXT1+1
TCBRSV32 EQU   TCBEXT1
TCBEXCPD EQU   TCB+192
TCBIOBRC EQU   TCB+188
TCBDDWTC EQU   TCB+186
TCBDDEXC EQU   TCB+184
TCBJSCBB EQU   TCBJSCB+1
@NM00032 EQU   TCBRECDE
TCBREC   EQU   TCBRECDE
TCBMDIDS EQU   TCB+176
TCBNDINT EQU   TCBNDSP3
TCBRSV27 EQU   TCBNDSP3
TCBRSV26 EQU   TCBNDSP3
TCBRSV25 EQU   TCBNDSP3
TCBRSV24 EQU   TCBNDSP3
TCBSRBND EQU   TCBNDSP3
TCBRV302 EQU   TCBNDSP3
TCBLJSND EQU   TCBNDSP3
TCBABE   EQU   TCBNDSP2
TCBDSS   EQU   TCBNDSP2
TCBOWAIT EQU   TCBNDSP2
TCBIWAIT EQU   TCBNDSP2
TCBNDTS  EQU   TCBNDSP2
TCBNDSVC EQU   TCBNDSP2
TCBSTPP  EQU   TCBNDSP2
TCBABD   EQU   TCBNDSP2
TCBRSV22 EQU   TCBNDSP1
TCBPIEND EQU   TCBNDSP1
TCBTPSP  EQU   TCBNDSP1
TCBDDRND EQU   TCBNDSP1
TCBRSPND EQU   TCBNDSP1
TCBRSTND EQU   TCBNDSP1
TCBDARPN EQU   TCBNDSP1
TCBDARTN EQU   TCBNDSP1
TCBNDSP0 EQU   TCBNDSP
TCBUSER  EQU   TCB+168
TCBTCTB  EQU   TCBTCT+1
TCBRSV9C EQU   TCBTCTGF
TCBRSV9B EQU   TCBTCTGF
TCBRSV9A EQU   TCBTCTGF
TCBRSV99 EQU   TCBTCTGF
TCBRSV98 EQU   TCBTCTGF
TCBRSV97 EQU   TCBTCTGF
TCBRSV20 EQU   TCBTCTGF
TCBSMFGF EQU   TCBTCTGF
TCBSTABB EQU   TCBSTAB+1
TCBSTCUR EQU   TCBNSTAE
TCBRV301 EQU   TCBNSTAE
TCBSYNCH EQU   TCBNSTAE
TCBHALT  EQU   TCBNSTAE
TCBPPSUP EQU   TCBNSTAE
TCB33E   EQU   TCBNSTAE
TCBQUIES EQU   TCBNSTAE
TCBSTABE EQU   TCBNSTAE
TCBAQE   EQU   TCB+156
TCBPQE   EQU   TCB+152
TCBTSDP  EQU   TCB+151
TCBTSLP  EQU   TCB+150
TCBSTPCT EQU   TCB+149
TCBCPUBN EQU   TCBTSFLG
TCBDYDSP EQU   TCBTSFLG
TCBRSV18 EQU   TCBTSFLG
TCBRSV17 EQU   TCBTSFLG
TCBTIOTG EQU   TCBTSFLG
TCBATT   EQU   TCBTSFLG
TCBSTPPR EQU   TCBTSFLG
TCBRV300 EQU   TCBTSTSK
TCBECB   EQU   TCB+144
TCBIQE   EQU   TCB+140
TCBLTC   EQU   TCB+136
TCBOTC   EQU   TCB+132
TCBNTC   EQU   TCB+128
TCBJSTCA EQU   TCBJSTCB+1
TCBRSV16 EQU   TCBJSTCB
TCBTQET  EQU   TCBTME
TCBTCB   EQU   TCB+116
TCBFSAB  EQU   TCBFSA+1
TCBQEL   EQU   TCBFSA
TCBGRS15 EQU   TCBGRS+60
TCBGRS14 EQU   TCBGRS+56
TCBGRS13 EQU   TCBGRS+52
TCBGRS12 EQU   TCBGRS+48
TCBGRS11 EQU   TCBGRS+44
TCBGRS10 EQU   TCBGRS+40
TCBGRS9  EQU   TCBGRS+36
TCBGRS8  EQU   TCBGRS+32
TCBGRS7  EQU   TCBGRS+28
TCBGRS6  EQU   TCBGRS+24
TCBGRS5  EQU   TCBGRS+20
TCBGRS4  EQU   TCBGRS+16
TCBGRS3  EQU   TCBGRS+12
TCBGRS2  EQU   TCBGRS+8
TCBGRS1  EQU   TCBGRS+4
TCBGRS0  EQU   TCBGRS
TCBJPQB  EQU   TCBJPQ+1
TCBRSV15 EQU   TCBPURGE
TCBRSV14 EQU   TCBPURGE
TCBRSV13 EQU   TCBPURGE
TCBRSV12 EQU   TCBPURGE
TCBRSV11 EQU   TCBPURGE
TCBRSV10 EQU   TCBPURGE
TCBRSV09 EQU   TCBPURGE
TCBJPQF  EQU   TCBPURGE
TCBJLB   EQU   TCB+40
TCBLLS   EQU   TCB+36
TCBLMP   EQU   TCB+34
TCBPNDSP EQU   TCBFLGS5
TCBFCD1  EQU   TCBFLGS5
TCBSTP   EQU   TCBFLGS5
TCBSYS   EQU   TCBFLGS5
TCBANDSP EQU   TCBFLGS5
TCBPAGE  EQU   TCBFLGS5
TCBUXNDF EQU   TCBABWF
TCBFC    EQU   TCBFLGS5
TCBONDSP EQU   TCBFLGS4
TCBMPCND EQU   TCBFLGS4
TCBMPCVQ EQU   TCBFLGS4
TCBUXNDV EQU   TCBFLGS4
TCBHNDSP EQU   TCBFLGS4
TCBRQENA EQU   TCBFLGS4
TCBSER   EQU   TCBFLGS4
TCBNDUMP EQU   TCBFLGS4
TCBDWSTA EQU   TCBFLGS3
TCBRSV08 EQU   TCBFLGS3
TCBRSV07 EQU   TCBFLGS3
TCBRSV06 EQU   TCBFLGS3
TCBABGM  EQU   TCBFLGS3
TCBABTRM EQU   TCBFLGS3
TCBADINP EQU   TCBFLGS3
TCBFSM   EQU   TCBFLGS3
TCBFTS   EQU   TCBFLGS2
TCBFETXR EQU   TCBFLGS2
TCBFDSOP EQU   TCBFLGS2
TCBFJMC  EQU   TCBFLGS2
TCBFSMC  EQU   TCBFLGS2
TCBFABOP EQU   TCBFLGS2
TCBFSTI  EQU   TCBFLGS2
TCBFOINP EQU   TCBFLGS2
TCBFX    EQU   TCBFLGS1
TCBFS    EQU   TCBFLGS1
TCBFT    EQU   TCBFLGS1
TCBPDUMP EQU   TCBFLGS1
TCBNONPR EQU   TCBFLGS1
TCBFERA  EQU   TCBFLGS1
TCBFE    EQU   TCBFLGS1
TCBFA    EQU   TCBFLGS1
TCBZERO  EQU   TCBPKF
TCBFLAG  EQU   TCBPKF
TCBMSSB  EQU   TCBMSS+1
TCBRSV03 EQU   TCBMSS
TCBTRNB  EQU   TCBTRN+1
TCBRSV02 EQU   TCBABF
TCBOLTEP EQU   TCBABF
TCBTCP   EQU   TCBABF
TCBTCPP  EQU   TCBABF
TCBRSV01 EQU   TCBABF
TCBGRPH  EQU   TCBABF
TCBNOCHK EQU   TCBABF
TCBMOD91 EQU   TCBABF
TCBCMPC  EQU   TCBCMP+1
TCBRV318 EQU   TCBCMSG
TCBRV317 EQU   TCBCIND
TCBRV316 EQU   TCBCWTO
TCBCASID EQU   TCBCDBL
TCBNOCC  EQU   TCBSTCC
TCBDMPO  EQU   TCBCPP
TCBCSTEP EQU   TCBCMPF
TCBCREQ  EQU   TCBCMPF
TCBTIO   EQU   TCB+12
TCBPIEA  EQU   TCBPIE+1
TCBPM    EQU   TCBPMASK
@NM00031 EQU   TCBPMASK
TCBRBP   EQU   TCB
TCBFRS6  EQU   TCBFRS+24
TCBFRS4  EQU   TCBFRS+16
TCBFRS2  EQU   TCBFRS+8
TCBFRS0  EQU   TCBFRS
RPLSAVE2 EQU   IDARPLE+24
RPLSAVE  EQU   IDARPLE+20
@NM00030 EQU   IDARPLE+17
RPLIITSB EQU   IDARPLE+16
RPLDECB  EQU   IDARPLE+4
RPLACTIV EQU   RPLCOMN+69
RPLBRANC EQU   RPLEXTD1
RPLNIB   EQU   RPLEXTD1
@NM00029 EQU   RPLEXTD1
RPLEXIT  EQU   RPLEXTD1
RPLNEXIT EQU   RPLEXTD1
RPLEXSCH EQU   RPLEXTD1
RPLDDDD  EQU   RPLRBAR+4
@NM00028 EQU   RPLRBAR+3
@NM00027 EQU   RPLAIXID
RPLAXPKP EQU   RPLAIXID
RPLAIXPC EQU   RPLRBAR
RPLRSV88 EQU   RPLOPT8
RPLUNCON EQU   RPLOPT8
RPLACTV  EQU   RPLOPT8
RPLSESS  EQU   RPLOPT8
RPLPEND  EQU   RPLOPT8
RPLODPRM EQU   RPLOPT8
RPLODACP EQU   RPLOPT8
RPLODACQ EQU   RPLOPT8
RPLRSV78 EQU   RPLOPT7
RPLRSV77 EQU   RPLOPT7
RPLRLSOP EQU   RPLOPT7
RPLTPOST EQU   RPLOPT7
RPLQOPT  EQU   RPLOPT7
RPLCNIMM EQU   RPLCNOPT
RPLCNANY EQU   RPLCNOPT
RPLCNALL EQU   RPLCNOPT
RPLRSV68 EQU   RPLOPT6
RPLRSV67 EQU   RPLOPT6
RPLLOCK  EQU   RPLOPT6
RPLNCOND EQU   RPLOPT6
RPLCOND  EQU   RPLOPT6
RPLEOT   EQU   RPLUNTYP
RPLEOM   EQU   RPLUNTYP
RPLEOB   EQU   RPLUNTYP
RPLWROPT EQU   RPLOPT5
RPLNODE  EQU   RPLOPT5
RPLERACE EQU   RPLWRTYP
RPLEAU   EQU   RPLWRTYP
RPLNERAS EQU   RPLWRTYP
RPLPSOPT EQU   RPLOPT5
RPLSSNIN EQU   RPLOPT5
RPLDLGIN EQU   RPLOPT5
RPLCHAIN EQU   RPLNXTRP
RPLOPT4  EQU   RPLOPTCD+3
RPLALIGN EQU   RPLOPT3
RPLFMT   EQU   RPLOPT3
RPLFLD   EQU   RPLOPT3
RPLVFY   EQU   RPLOPT3
RPLBLK   EQU   RPLOPT3
RPLSFORM EQU   RPLOPT3
RPLEODS  EQU   RPLOPT3
RPLNSP   EQU   RPLOPT2
RPLWAITX EQU   RPLOPT2
RPLLRD   EQU   RPLOPT2
RPLBWD   EQU   RPLOPT2
RPLCNV   EQU   RPLOPT2
RPLADD   EQU   RPLADR
RPLECBIN EQU   RPLECBSW
RPLGEN   EQU   RPLOPT1
RPLKGE   EQU   RPLOPT1
RPLASY   EQU   RPLOPT1
RPLSKP   EQU   RPLOPT1
RPLLOC   EQU   RPLOPT1
RPLDAF   EQU   RPLARG+2
RPLSAF   EQU   RPLARG
RPLAREA  EQU   RPLCOMN+32
RPLTCBPT EQU   RPLCOMN+28
RPLCCHAR EQU   RPLCOMN+20
RPLSTRID EQU   RPLCOMN+18
RPLKEYL  EQU   RPLKEYLE
RPLRDSOH EQU   RPLFDB3
RPLRLG   EQU   RPLFDB3
RPLLGFRC EQU   RPLFDB3
RPLREOT  EQU   RPLFDB3
RPLREOM  EQU   RPLFDB3
RPLREOB  EQU   RPLFDB3
RPLSV32  EQU   RPLFDB3
RPLUINPT EQU   RPLFDB3
RPLSTSAV EQU   RPLFDB2
RPLCUERR EQU   RPLFDB2
RPLDLGFL EQU   RPLFDB2
RPLIOERR EQU   RPLFDB2
RPLDVUNS EQU   RPLFDB2
RPLATND  EQU   RPLFDB2
RPLRVID  EQU   RPLFDB2
RPLERLK  EQU   RPLFDB2
RPLERREG EQU   RPLRTNCD
RPLSTAT  EQU   RPLFDBWD
RPLPOST  EQU   RPLECB
RPLWAIT  EQU   RPLECB
RPLPLHPT EQU   RPLCOMN+4
RPLLEN2  EQU   RPLLEN
RPLREQ   EQU   RPLIDWD+2
RPLSTYP  EQU   RPLIDWD+1
DCBLPDT  EQU   IHADCS55
DCBWKPT4 EQU   IHADCS29+188
DCBWKPT3 EQU   IHADCS29+184
DCBWKPT2 EQU   IHADCS29+180
@NM00026 EQU   IHADCS29+174
DCBLIOV  EQU   IHADCS29+164
DCBNOREC EQU   IHADCS29+162
@NM00025 EQU   IHADCS29+161
DCBLEMI1 EQU   IHADCS29+156
@NM00024 EQU   IHADCS29+153
DCBLECI  EQU   IHADCS29+148
DCBNBOV  EQU   IHADCS29+146
DCBOVDEV EQU   IHADCS29+145
DCBLETI  EQU   IHADCS29+140
DCBLPDA  EQU   IHADCS29+132
DCBFTHI  EQU   IHADCS29+125
DCBNTHI  EQU   IHADCS29+124
DCBFTMI1 EQU   IHADCS29+117
DCBHIIOV EQU   IHADCS29+116
DCBFTCI  EQU   IHADCS29+109
DCBSTLTF EQU   DCBST
DCBSTLBF EQU   DCBST
DCBSTNMC EQU   DCBST
@NM00023 EQU   DCBST
DCBSTNCY EQU   DCBST
DCBSTKSQ EQU   DCBST
DCBSTSSM EQU   DCBST
DCBNREC  EQU   IHADCS29+104
DCBTDC   EQU   IHADCS29+96
DCBHIRSH EQU   IHADCS29+95
DCBHIROV EQU   IHADCS29+94
DCBHIRPD EQU   IHADCS29+93
DCBHIRCM EQU   IHADCS29+92
DCBLDT   EQU   IHADCS29+90
DCBHMASK EQU   IHADCS29+89
DCBFIRSH EQU   IHADCS29+86
DCBNLEV  EQU   IHADCS29+85
DCBLEMI3 EQU   IHADCS29+80
DCBFTMI3 EQU   IHADCS29+73
DCBLEMI2 EQU   IHADCS29+68
DCBFTMI2 EQU   IHADCS29+61
DCBHIRTI EQU   IHADCS29+60
DCBRELEX EQU   IHADCS29+52
DCBPUTX  EQU   IHADCS29+48
DCBRELSE EQU   IHADCS29+44
@NM00022 EQU   DCBEXCD2
DCBEXRDE EQU   DCBEXLTH
DCBEXOFL EQU   DCBEXCD2
DCBEXCLD EQU   DCBEXCD2
DCBEXDUP EQU   DCBEXCD2
DCBEXSEQ EQU   DCBEXCD2
DCBEXBLU EQU   DCBEXCD1
DCBEXBLI EQU   DCBEXCD1
DCBEXOER EQU   DCBEXCD1
DCBEXIER EQU   DCBEXCD1
DCBEXINV EQU   DCBEXCD1
DCBEXNSP EQU   DCBEXCD1
DCBEXIDA EQU   DCBEXCD1
DCBEXNKY EQU   DCBEXCD1
DCBMSHIA EQU   DCBMSHI+1
DCBSMSW  EQU   IHADCS29+18
DCBSMSI  EQU   IHADCS29+16
DCBMSWA  EQU   IHADCS29+12
DCBCYLOF EQU   IHADCS29+3
DCBNTM   EQU   IHADCS29+2
DCBMACRE EQU   DCBMAC
DCBMACAW EQU   DCBMAC
DCBMACUW EQU   DCBMAC
DCBMACUR EQU   DCBMAC
@NM00021 EQU   DCBMAC
DCBOPTR  EQU   DCBOPTCD
@NM00020 EQU   DCBOPTCD
DCBOPTY  EQU   DCBOPTCD
DCBOPTM  EQU   DCBOPTCD
DCBOPTUF EQU   DCBOPTCD
DCBPUTA  EQU   DCBGETA
@NM00019 EQU   DCBPUT
@NM00018 EQU   DCBIFLGS
DCBIFIOE EQU   DCBIFLGS
DCBCH12  EQU   DCBIFPCT
DCBCH9   EQU   DCBIFPCT
DCBIFEC  EQU   DCBIFLGS
DCBMFSTI EQU   DCBMFDMD
DCBMFAWR EQU   DCBMFSTK
DCBMFIDW EQU   DCBMFLCP
DCBMFWRK EQU   DCBMFMVP
DCBMFRDQ EQU   DCBMFWRT
DCBMFGTQ EQU   DCBMFPUT
DCBMFSTL EQU   DCBMACF2
DCBMFCK  EQU   DCBMFDMG
DCBMFRDX EQU   DCBMFCHK
DCBMFRDI EQU   DCBMFLCG
DCBMFRDK EQU   DCBMFMVG
DCBMFWRQ EQU   DCBMFRD
DCBMFPTQ EQU   DCBMFGET
DCBMFECP EQU   DCBMACF1
DCBTIOT  EQU   IHADCS25
DCBMRSTI EQU   DCBMRDMD
DCBMRAWR EQU   DCBMRSTK
DCBMRUIP EQU   DCBMRTMD
DCBMRIDW EQU   DCBMRLCP
DCBMRWRK EQU   DCBMRMVP
DCBMRRDQ EQU   DCBMRWRT
DCBMRGTQ EQU   DCBMRPUT
DCBMRSTL EQU   DCBMACR2
DCBMRCK  EQU   DCBMRDMG
DCBPGFXA EQU   DCBMRRDX
DCBMRDBF EQU   DCBMRSBG
DCBMRRDI EQU   DCBMRLCG
DCBMRRDK EQU   DCBMRMVG
DCBMRWRQ EQU   DCBMRRD
DCBMRPTQ EQU   DCBMRGET
DCBMRECP EQU   DCBMACR1
@NM00017 EQU   DCBIFLG
DCBIBIOE EQU   DCBIFLG
DCBICH12 EQU   DCBIBPCT
DCBICH9  EQU   DCBIBPCT
DCBIBEC  EQU   DCBIFLG
DCBOFIOF EQU   DCBOFLGS
DCBOFTM  EQU   DCBOFLGS
DCBOFPPC EQU   DCBOFLGS
DCBOFEOV EQU   DCBOFLGS
DCBOFLRB EQU   DCBOFLGS
DCBOFIOD EQU   DCBOFLWR
DCBRECKL EQU   DCBRECFM
DCBRECCC EQU   DCBRECFM
DCBRECSB EQU   DCBRECFM
DCBRECTO EQU   DCBRECLA
DCBEODA  EQU   DCBEODAD+1
DCBH0    EQU   DCBBFTEK
DCBBFTKD EQU   DCBBFTEK
DCBBFTE  EQU   DCBBFT
DCBBFTKR EQU   DCBBFT
DCBBFTS  EQU   DCBBFT
DCBH1    EQU   DCBBFTEK
@NM00016 EQU   DCBSVCXL
DCBODEBA EQU   DCBIOBAA
@NM00015 EQU   DCBQSLM
DCBUPDBT EQU   DCBQSLM
DCBUPDCM EQU   DCBQSLM
DCB1DVDS EQU   DCBQSLM
@NM00014 EQU   DCBDSRG2
DCBDSGTR EQU   DCBDSRG2
DCBACBM  EQU   DCBDSRG2
@NM00013 EQU   DCBDSRG2
DCBDSGTQ EQU   DCBDSRG2
DCBDSGTX EQU   DCBDSRG2
DCBDSGGS EQU   DCBDSRG2
DCBDSGU  EQU   DCBDSRG1
DCBDSGPO EQU   DCBDSRG1
@NM00012 EQU   DCBDSRG1
@NM00011 EQU   DCBDSRG1
DCBDSGCX EQU   DCBDSRG1
DCBDSGDA EQU   DCBDSRG1
DCBDSGPS EQU   DCBDSRG1
DCBDSGIS EQU   DCBDSRG1
DCBTRBAL EQU   IHADCS01+6
@NM00010 EQU   IHADCS01+5
@NM00009 EQU   IHADCS01+4
DCBDVTBA EQU   DCBDVTBL+1
@NM00008 EQU   DCBDVTBL
DCBKEYCN EQU   IHADCS00+4
DCBRELAD EQU   IHADCS00
@NM00007 EQU   IHADCB
IIGMLEN  EQU   IIGMSPLG+1
IIGMPOOL EQU   IIGMSPLG
AUDCLM   EQU   AUDCSPLM+1
AUDCSPM  EQU   AUDCSPLM
AUDCMSGA EQU   IIGMAUD+24
AUDCLB   EQU   AUDCSPLB+1
AUDCSPB  EQU   AUDCSPLB
AUDCBFRS EQU   IIGMAUD+16
AUDCLD   EQU   AUDCSPLD+1
AUDCSPD  EQU   AUDCSPLD
AUDCDEB  EQU   IIGMAUD+8
AUDCLI   EQU   AUDCSPLI+1
AUDCSPI  EQU   AUDCSPLI
AUDCIICB EQU   IIGMAUD
@NM00006 EQU   IIAUDFL2
AUDDEBXF EQU   IIAUDFL2
AUDBFRRT EQU   IIAUDFL2
AUDBFREX EQU   IIAUDFL2
AUDACBRC EQU   IIAUDFL2
AUDACBCL EQU   IIAUDFL2
@NM00005 EQU   IIREGSAV+12
IIREGFC  EQU   IIREGSAV+8
IIREGBC  EQU   IIREGSAV+4
@NM00004 EQU   IIREGSAV
@NM00003 EQU   IIFLAG3
@NM00002 EQU   IIFLAG1
IIDATA   EQU   IIFLAG1
IIFCLOSE EQU   IIFLAG1
IIFACBCL EQU   IIFLAG1
IIFGET   EQU   IIFLAG1
IIFSCAN  EQU   IIFLAG1
IISAVLRL EQU   IIW1CBF
@NM00001 EQU   IDAIICB+1
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS
@RT00185 EQU   EXIT
@RF00294 EQU   @EL00005
@RF00413 EQU   @EL00009
@RF00417 EQU   @EL00009
@RT00465 EQU   EXIT3B
ENDCHECK EQU   @EL00011
@RF00511 EQU   @EL00012
@RT00468 EQU   ENDCHECK
@ENDDATA EQU   *
         END   IDA0192I,(C'PLS1414',0701,78144)
