*
**  STANDARD COMMUNICATIONS REGION                                   **
*
COMM     DSECT
         USING *,GRDIC        GRDIC ALWAYS POINTS AT COMMUNICATIONS RGN
*
SAVE0    DS    F              REGISTER SAVE AREA
SAVE1    DS    F
SAVE2    DS    F
SAVE3    DS    F
SAVE4    DS    F
SAVE5    DS    F
SAVE6    DS    F
SAVE7    DS    F
SAVE8    DS    F
SAVE9    DS    F
SAVE10   DS    F
SAVE11   DS    F
SAVE12   DS    F
SAVE13   DS    F
SAVE14   DS    F
SAVE15   DS    F              REGISTER SAVE AREA
ZTV      DS    F              CONTROL PHASE BASE
ZTRAN1   DS    F              EXTERNAL TO INTERNAL TRANSLATE TABLE
ZTRAN2   DS    F              INTERNAL TO EXTERNAL TRANSLATE TABLE
ZNXTD    DS    F              NEXT AVAILABLE DICTIONARY LOCATION
ZERRD    DS    F
ZERRS    DS    F              FIRST LOCATIONS OF ERROR CHAINS
ZERRW    DS    F
ZERRC    DS    F
ZDNXT    DS    F
ZSNXT    DS    F              CURRENT ENDS OF ERROR CHAINS
ZWNXT    DS    F
ZCNXT    DS    F
ZMYNAM   DS    F              NAME OF LAST PHASE ENTERED
DICTP    DS    H
ZCNCHR   DS    H              SOURCE COLUMN CONTAINING CONTROL CHAR
ZPROCH   DS    F              CHAIN OF CREATED PROCEDURES
ZSTAT    DS    F              CURRENT STATEMENT NUMBER
PAR1     DS    F              PARAMETER WORD 1
PAR2     DS    F
PAR3     DS    F
PAR4     DS    F
PAR5     DS    F
PAR6     DS    F
PAR7     DS    F
PAR8     DS    F              PARAMETER WORD 8
CORLFT   DS    F              AMOUNT OF CORE LEFT FOR COMPILATION
LKNAME   DS    CL8            MEMBER NAME OF MODULE PRODUCED BY COMP
ZOBSAD   DS    F              ADDRESS OF OVERFLOW BLOCK
TERMSW   DS    H              COMPILATION TERMINATING SWITCH
OFDNAM   DS    H
SPLNAM   DS    H              NAME OF PHASE IN CONTROL WHEN SPILL OPND
ZOBNUM   DS    H              OVERFLOW BLOCK NUMBER
SCNOP    DS    CL1            PHASE DIRECTORY SCAN SWITCH
SCCNF    DS    CL1            ON IF IN SECOND HALF OF COMPILER
ZDROLF   DS    CL1            OVERLAY SWITCH
AREA     DS    CL1            CODE WORD FOR DUMMY ROUTINES (PHASE AD)
ZM91     DS    CL1            (USED FOR MODEL 91 SYSTEMS)
PERRSW   DS    CL1            PRINT ERROR SWITCH
BERSW    DS    CL1            *PROCESS ERROR BYTE
IOERSW   DS    CL1            I/O ERROR SWITCH
ZPAGE    DS    H              NUMBER OF LINES IN PAGE
ZLINE    DS    H              NUMBER OF CHARACTERS IN A LINE
ZOPT     DS    CL1            CODE WORD OF LOADING OF OPTIMIZING PHASES
PARMLEN  DS    CL1            LENGTH OF OPTIONS FIELD IN *PROCESS CARD
MAXFON   DS    H              NUMBER OF OFFSET SLOTS IN A DICT BLOCK
ZDICTSP  DS    F              USEFULL DICTIONARY BLOCK SIZE
ZNXTOF   DS    F              OFFSET OF NEXT DICTIONARY ENTRY
FONOF    DS    F              OFFSET OF OFFSET SLOTS IN DICT BLOCK
FSTDRF   DS    3F             DICTIONARY REFERENCE OF LAST DICT ENTRY
ERCODE   DS    F              ERROR MESSAGE CODES
MCSIZE   DS    F              M/C SIZE THIS RUN
CCCODE   DS    F              CONTROL CARD REQUESTS
HDR      DS    F              ADDRESS OF PHASE DIRECTORY
TLR      DS    F              TIMER LAST READ
TRT      DS    F              TOTAL RUN TIME
ARINT    DS    F              ARITHMETIC INTERRUPT
BR2      DS    F              SECOND BASE FOR CONTROL PHASE
STARTX   DS    F              START OF TEXT
DICTSZ   DS    F              DICTIONARY BLOCK SIZE
TXTSZ    DS    F              SPACE AVAILABLE IN TEXT BLOCK
RDSIZE   DS    F              SIZE OF READ AREA
INCOD    DS    CL1            INTERRUPT CODE
ARMASK   DS    CL1            ARITHMETIC ERROR MASK
LOCK     DS    H              DICTIONARY LOCK SLOT
ZNXTLC   DS    F              END OF CURRENT TEXT
ZSHIFT   DS    F              NUMBER OF BITS IN DICT REF OFFSET
ZMASK    DS    H              MASK TO REMOVE BLOCK NUMBERS
ZMASK1   DS    H              MASK TO REMOVE OFFSET
ZSOR     DS    H              INPUT RECORD SOURCE
ZMAG     DS    CL14           INPUT RECORD MARGIN
ZCOMM    DS    0CL1
ZCALLC   DS    CL4            START OF CALL CHAIN
ZLABTB   DS    CL4            START OF LABEL CHAIN
ZATTID   DS    0CL4           POINTER TO ATTRIBUTE TIDY-UP AREA
ZPCOP    DS    CL4
ZALLCH   DS    CL4            START OF ALLOCATE CHAIN
ZFLAG1   DS    CL1            FLAG BYTES,
ZFLAG2   DS    CL1              MAINLY USED FOR
ZFLAG3   DS    CL1              OPTIONAL PHASE
ZFLAG4   DS    CL1              MARKING
ZFLAG5   DS    0CL1
ZSYSOT   DS    CL2            DICT. REF. SYSOUT
         DS    CL2
ZSCRCH   DS    CL1
         DS    CL3
ZHASH    DS    0CL4           START OF HASH TABLE
ZINCL    DS    CL4            INCLUDE CARD POINTER
ZEQTA3   DS    CL4            ASSIGNED OFFSET TABLE
ZFATTB   DS    0CL4           START OF FACTORED ATTRIBUTE
ZLCONS   DS    CL2            LAST CONSTANT IN STATIC
ZEOCS    DS    CL2            END OF STATIC
ZCDIMC   DS    0CL4           START CONSTANT DIMENSION
ZSMREG   DS    CL4            CURRENT SYMBOLIC REGISTER
Z2FILE   DS    CL4            START OF SECOND FILE
ZDLFST   DS    0CL4           DEFINED STORAGE AREA
ZFXTEX   DS    CL4            FIRST EXTERNAL ITEM
ZDCBLD   DS    0CL4           DICTIONARY BUILD AREA
ZPRSIZ   DS    CL4            SIZE OF COMPILED PROGRAM
ZMPSTK   DS    0CL4           PROGRAM MAP STACK
ZSICSZ   DS    CL4            STATIC INTERNAL SIZE
ZUPIC    DS    0CL4           START OF PICTURE CHAIN
ZSTALC   DS    CL4            STORAGE LOCATION COUNTER
ZPROC1   DS    CL4            START OF ENTRY TYPE 1 CHAIN
ZSTACH   DS    CL6            START OF STATIC CHAIN (6 BYTES)
ZVDIMC   DS    CL4            START OF VARIABLE DIMENSION CHAIN
ZCONCH   DS    CL2            START OF CONSTANTS CHAIN
ZDEFCH   DS    0CL2           CHAIN OF DEFINED ITEMS
ZCITEM   DS    CL2            CHAIN OF CONTROLLED ITEMS
ZLTKCH   DS    0CL2           CHAIN OF LIKE ITEMS
ZEQMAX   DS    CL2            MAX LABEL NUMBER
ZPOLCH   DS    CL2            CHAIN OF POOL ITEMS
ZCOBOL   DS    0CL2           HEAD OF COBOL STRUCTURE CHAIN
ZDCOM1   DS    CL4            LATEST DICT  REF
ZDCOM2   DS    CL4            FLAGS FOR DICT BUILD INTERFACE (8 BYTES)
ZDSA     DS    CL6            HEAD OF STATIC DSA CHAIN
ZCPOFF   DS    CL4            OFFSET OF FIRST CONSTANTS POOL WITHIN
*                               STATIC INTERNAL
*
         EJECT
