         MACRO
         IGFIORMS
IGFIORMS DSECT               OVERLAY FOR IORMSCOM USED BY ALLOC
         DS    5F            USED BY CCH
         DS    12F           USED BY DDR
ALLOCECB DS    1F            ALLOCATION ECB
ALLOCTCB DS    1F            TCB ADDR OF TASK USING ALLOC
         DS    2F            USED BY DDR
ALLOTJID DS    1F            TJID OF TASK USING ALLOC
         MEND
