         MACRO
         IGGCP6 &OPTCD=
.*         RELEASE 23 DELETIONS/CHANGES
.*         RELEASE 22 DELETIONS/CHANGES
.*         RELEASE 21 DELETIONS/CHANGES
* CP6    SEARCHES AN OVERFLOW CHAIN TO READ OR WRITE OFLO RECORDS
CA26     CCW   SIDEQ,0,CC,5  SCH FOR 1ST RCD IN OVFLO CHAIN
CA27     CCW   TIC,CA26-V6,0,0
CA28     CCW   SKEQ,0,CC,0  CHECK KEY IN OVFLO RCD
CA29     CCW   TIC,CA32-V6,0,0  NOT EQ.- GO TO NEXT IN CHAIN
CA30     CCW   TIC,CA31-V6,0,0 EQ-READ(CA31) OR WRT(CA40) RCD
CA31     CCW   RDATA,0,0,0  READ THE OVFLO RCD
CA31B    CCW   RDSECT,0,0,1  END OF CP
CA32     CCW   RDATA,CA34+7-V6,CC+SILI,10 RD LINK FLD TO NXT
CA33     CCW   TIC,CA36-V6,0,0
CA34     DC    C'-------M'       LINK FIELD
CA35     DC    C'BBCCHHRF'       LINK FIELD
CA36     CCW   C'P',CA35-V6,CC,6 SEEK NEXT RCD IN OVFLO
CA37     CCW   SIDEQ,CA35+2-V6,CC,5 SCH FOR OVFLO RCD
CA38     CCW   TIC,CA37-V6,0,0
CA39     CCW   TIC,CA28-V6,0,0  FOUND- CHECK KEY
CA40     CCW   RDATA,0,CC+SILI,10   READ LINK FLD
CA40A    CCW   TIC,CA41-V6,CC,1      TIC/RDSECT SWITCH
CA40B    CCW   SETSECT,0,CC,1  POSITION TO RCD AGAIN
CA41     CCW   SIDEQ,CA35+2-V6,CC,5   SCH FOR IT
CA42     CCW   TIC,CA41-V6,0,0
         AIF   ('&OPTCD' NE 'W' AND '&OPTCD' NE 'VW').NOCC
CA43     CCW   WD,0,CC,0     WRITE THE RECORD
SZ6      EQU   CA43+8-CA26
         AGO   .COMMON
.NOCC    ANOP
CA43     CCW   WD,0,0,0                 WRITE THE RECORD
.COMMON  ANOP
         AIF   ('&OPTCD' NE 'W' AND '&OPTCD' NE 'VW').END
* CP6W   VALIDITY CHECKS OVERFLOW RECORDS.
CA430    CCW   NOP,CA42+4-V6,CC+SILI,1 NOP/SETSECT SWITCH
CA43A    CCW   SIDEQ,CA35+2-V6,CC,5   FIND RCD AGAIN
CA43B    CCW   TIC,CA43A-V6,0,0
CA43C    CCW   RDATA,0,SKIP,0    READ IT BACK
SZ6W     EQU   SZ6+CA43C+8-CA430
.END     ANOP
V6       EQU   V4
         MEND
