         MACRO
&NAME    IGGCP47 &OPTCD=
         GBLB    &CPOPS
.*          RELEASE 23 DELETIONS/CHANGES
.*          RELEASE 22 DELETIONS/CHANGES
.*          RELEASE 21 DELETIONS/CHANGES
         AIF     (&CPOPS).NOCPOPS
&CPOPS   SETB    1
         IGGCPOPS
.NOCPOPS ANOP
&NAME    DSECT
CP4      DS    0D
         IGGCP4
CP5      DS    0D
         IGGCP5  OPTCD=&OPTCD
CP6      DS    0D
         IGGCP6  OPTCD=&OPTCD
CP7      DS    0D
         IGGCP7  OPTCD=&OPTCD
         MEND
