         MACRO
         IGGCP16   &OPTCD=
.*         RELEASE 23 DELETIONS/CHANGES
.*         RELEASE 22 DELETIONS/CHANGES
.*         RELEASE 21 DELETIONS/CHANGES
*  CP16--SEARCH AN OVERFLOW CHAIN FOR LAST RECORD OR FOR THE RECORD
*        PRECEDING THE NEW RECORD TO BE ADDED.
CJ1      CCW   SIDEQ,0,CC,5             SEARCH FOR NEXT OFLOW IN CHAIN
CJ2      CCW   TIC,CJ1-CB1,0,0
CJ3      CCW   SKEQHI,0,CC,0            SEE IF DESIRED RECORD
CJ4      CCW   TIC,CJ10-CB1,X'00',0     NO, READ LINK FIELD
CJ4A     CCW   NOP,0,CC+SILI,1          SET SECTOR IF RPS
CJ5      CCW   SIDEQ,0,CC,5             SEARCH FOR OVERFLOW REC AGAIN
CJ6      CCW   TIC,CJ5-CB1,X'00',0
CJ7      CCW   SKEQ,0,CC,0              TEST IF KEY = USER KEY
CJ8      CCW   NOP,0,SILI,1             NO, STOP HERE
         AIF   ('&OPTCD' NE 'V' AND '&OPTCD' NE 'VW').NOTVLR
CJ9      CCW   RDATA,0,SILI,19          RD LINK, BDW, RDW, AND DEL BYTE
CJ10     CCW   RDATA,0,SILI,0           READ DATA
         AGO   .OUT
.NOTVLR  ANOP
CJ9      CCW   RDATA,0,SILI,11          RD LINK FIELD AND DELETE BYTE
CJ10     CCW   RDATA,0,X'00',0          READ DATA
.OUT     ANOP
CJ11     DC    D'0'                     M B B C C H H R OF PRIOR RECORD
SZ16     EQU   CJ11+8-CJ1
SZ16V    EQU   SZ16
         MEND
