//NET     PROC
//IEFPROC EXEC PGM=ISTINM01,TIME=1440,REGION=4096K,DPRTY=(14,15)
//VTAMLST  DD  DSN=SYS1.VTAMLST,DISP=SHR
//VTAMLIB  DD  DSN=SYS1.VTAMLIB,DISP=SHR
//VTAMOBJ  DD  DSN=SYS1.VTAMOBJ,DISP=SHR
