//SMPASML PROC M=MISSING
//ASM     EXEC PGM=IFOX00,
//             REGION=4096K,
//             PARM='LIST,XREF(SHORT),DECK,NOOBJECT'
//SYSPRINT DD  SYSOUT=*
//SYSTERM  DD  SYSOUT=*
//SYSPUNCH DD  DISP=(,PASS),
//             UNIT=3350,
//             SPACE=(CYL,(1,1)),
//             DCB=(LRECL=80,BLKSIZE=3120,RECFM=FB)
//SYSLIB   DD  DISP=SHR,DSN=SYS1.MACLIB,DCB=BLKSIZE=32720
//         DD  DISP=SHR,DSN=SYS1.AMODGEN
//         DD  DISP=SHR,DSN=SYS1.UMODMAC
//         DD  DISP=SHR,DSN=SYS1.UMODSRC
//         DD  DISP=SHR,DSN=SYS1.HASPSRC
//         DD  DISP=SHR,DSN=SYS1.APVTMACS
//SYSUT1   DD  UNIT=VIO,SPACE=(CYL,(2,1))
//SYSUT2   DD  UNIT=VIO,SPACE=(CYL,(2,1))
//SYSUT3   DD  UNIT=VIO,SPACE=(CYL,(2,1))
//SYSIN    DD  DISP=SHR,DSN=SYS1.UMODSRC(&M)
//LINK    EXEC PGM=IEWL,PARM='LIST,MAP,XREF',REGION=512K
//SYSPRINT DD  SYSOUT=*
//SYSLIN   DD  DISP=(OLD,PASS),DSN=*.ASM.SYSPUNCH
//         DD  DDNAME=SYSIN
//SYSLIB   DD  DISP=SHR,DSN=SYS1.UMODOBJ
//SYSLMOD  DD  DISP=SHR,DSN=SYS1.UMODLIB(&M)
