//TSOLOGON PROC
//IKJACCNT EXEC PGM=IKJEFT01,PARM=USRLOGON,DYNAMNBR=64
//SYSHELP  DD  DISP=SHR,DSN=SYS1.HELP
//SYSPROC  DD  DISP=SHR,DSN=SYS1.CMDPROC
//         DD  DISP=SHR,DSN=SYS2.CMDPROC
