         MACRO
&NM      XSPACE &LIN,&VCON=XPSPC
&NM      MACPARM R1,&LIN,NULL=1
         MACPARM R15,=V(&VCON),OP=L
         BASR  R14,R15
         MEND  ,
