//*--------------------------------------------------------*
//* *  INSTALL THE 'ECHO' TSO COMMAND                      *
//*--------------------------------------------------------*
//ASSEMH   EXEC ASMHCL,
//         PARM.ASM='LOAD,NODECK,TERM,NOLIST,ALIGN',
//         PARM.LKED='LIST,MAP,RENT,REUS,REFR'
//SYSIN    DD DSN=SSJDM.MVS.SHARE.TSOSRC(ECHO),DISP=SHR
//SYSTERM  DD SYSOUT=*
//LKED.SYSPRINT DD SYSOUT=*
//LKED.SYSLMOD DD DSN=SYS1.SADSC.CMDLIB,UNIT=,DISP=SHR,SPACE=
//LKED.SYSIN DD *
 NAME ECHO(R)
/*
