//HERC01   JOB (TSO),'WHOHAS',CLASS=A,
//         MSGCLASS=X,NOTIFY=HERC01
//HELP     EXEC PGM=IEBUPDTE
//SYSPRINT DD SYSOUT=*
//SYSUT2   DD DSN=SYS2.HELP,DISP=SHR
//SYSIN    DD *
./HELP    ADD NAME=WHOHAS
)F FUNCTION -
  THE WHOHAS COMMAND LISTS ALL USERS AND/OR JOBS THAT HAVE ENQUED ON THE
  SPECIFIED DATA SET NAME(S).
)X SYNTAX -
         WHOHAS  'DATA SET NAME LIST'  OLD
  REQUIRED - NONE
  DEFAULTS - 'SHR' AND 'OLD' ENQUED DATA SETS.
  ALIAS    - DSN
  **NOTE** - IF THE DATA SET NAME IS NOT SPECIFIED, ONLY THE USER ID
             IS USED.
)O OPERANDS -
  'DATA SET NAME LIST' -
              SPECIFIES THE DATA SET NAME(S) ON WHICH USERS AND/OR
              JOBS HAVE ENQUED.
  OLD       - SPECIFIES THAT ONLY DATA SETS ALLOCATED AS 'OLD'
              ARE TO BE LISTED.
/*
