//*--------------------------------------------------------------*
//*       INSTALL 'WTC' TSO COMMAND PROCESSOR                    *
//*--------------------------------------------------------------*
//WTC       EXEC ASMHCL,PARM.ASM='ALIGN,TERM,RENT',SYSOUT='*',
//          PARM.LKED='RENT'
//SYSPRINT DD DUMMY
//SYSTERM  DD SYSOUT=*
//SYSIN   DD DSN=SS.SS02.MVS.SADSC.TSOSRC(WTC),DISP=SHR
//LKED.SYSLMOD DD DSN=SYS1.LINKLOAD,DISP=SHR,UNIT=,SPACE=
//LKED.SYSIN DD *
 NAME WTC(R)
/*
