//COPY JOB 01,PRINS
//STEP01 EXEC PGM=IEBCOPY
//SYSPRINT DD SYSOUT=*
//I DD DSN=RPF.LOAD,DISP=SHR
//O DD DSN=SYS2.CMDLIB,DISP=SHR
//SYSIN DD *
 C I=((I,R)),O=O
 E M=FAIRMOD,FAIRNTE,FAIRREC,FAIROPN,FAIRCLS,FAIRPNT,FAIRLOC
/*
