         MACRO
         IGGCP13C &OPTCD=
.*         RELEASE 23 DELETIONS/CHANGES
.*         RELEASE 22 DELETIONS/CHANGES
.*         RELEASE 21 DELETIONS/CHANGES
* CP13C  WRITES BACK BLOCK IF THE INSERTION IS A RECORD WITH A KEY
*        IDENTICAL TO THAT OF A RECORD, WHICH ALTHOUGH LOGICALLY
*        DELETED,IS STILL PHYSICAL PRESENT WITHIN THE BLOCK.
CL5      CCW   SIDEQ,0,CC,5              SEARCH FOR BLOCK INSERTION
CL6      CCW   TIC,CL5-CB1,0,0            POINT
         AIF   ('&OPTCD' NE 'W').SWC
CL7      CCW   WD,0,CC,0                 REPLACE BLOCK
         AGO   .WC
.SWC     ANOP
CL7      CCW   WD,0,0,0                 REPLACE BLOCK
.WC      ANOP
SZ13C    EQU   CL7+8-CL5
         AIF   ('&OPTCD' NE 'W').END
* 13CW   WRITE VALIDITY CHECK
CL70     CCW   NOP,0,CC+SILI,1
CL7A     CCW   SIDEQ,0,CC,5              FIND RECORD AGAIN
CL7B     CCW   TIC,CL7A-CB1,0,0
CL7C     CCW   RDATA,0,SKIP,0               READ IT BACK
SZ13CW   EQU   CL7C+8-CL70+SZ13C
.END     MEND
