//FORTXLM PROC MODCYL=4,UCYLS=4,OUTTRKS=200,SPCEOPT=',,ROUND',         *
//            MODDEV=SYSWK,DAUTIL=SYSWK,LNKEDIT=IEWLF880,              *
//            LSIZE='120K,28K',LOUTBLK=3509,LOPTION='LET,MAP',         *
//            MNAME=GO,OPTION=,LPART=128K,PART=128K,                   *
//            OUTDCB='RECFM=FBSA,LRECL=133,BLKSIZE=3458'
//LKED EXEC PGM=&LNKEDIT,PARM='LIST,&LOPTION,SIZE=(&LSIZE)',           *
//            REGION=&LPART,ACCT='FORTXLM'
//SYSABEND DD SYSOUT=A
//SYSLIB   DD DSNAME=SYS1.MOD2LIB,DISP=SHR
//SYSPRINT DD SYSOUT=A,DCB=(RECFM=FBSA,BLKSIZE=&LOUTBLK),              *
//            SPACE=(3520,(&OUTTRKS,5),&SPCEOPT)
//SYSLIN   DD DDNAME=SYSIN
//SYSLMOD  DD DSNAME=&&GOSET(&MNAME),UNIT=&MODDEV,DISP=(MOD,PASS),     *
//            SPACE=(CYL,(&MODCYL,1,1))
//SYSUT1   DD UNIT=(&DAUTIL,SEP=(SYSLIB,SYSLIN,SYSLMOD)),              *
//            SPACE=(CYL,(&UCYLS,1))
//GO EXEC PGM=PLEATRAP,PARM='FORTRAN/&OPTION',REGION=&PART,            *
//            COND=(4,LT,LKED)
//STEPLIB  DD DSN=&&GOSET,DISP=(OLD,DELETE)
//         DD DSN=SYS1.PLEA,DISP=SHR
//TRACE    DD DSN=&&TRACE,DISP=(,PASS),UNIT=SYSWK,SPACE=(CYL,(2,1))
//FT05F001 DD DDNAME=SYSIN
//FT06F001 DD SYSOUT=A,SPACE=(3520,(&OUTTRKS,5),&SPCEOPT),             *
//            UNIT=(&DAUTIL,SEP=FT05F001),DCB=(&OUTDCB)
//REPORT EXEC PGM=PLOTAB,PARM='NR,ISA(4K)',COND=(4,LT,LKED)
//STEPLIB  DD DSN=SYS1.PLEA,DISP=SHR
//         DD DSN=SYS1.PLI.LINKLIB,DISP=SHR
//SYSPRINT DD SYSOUT=A
//PLIDUMP  DD SYSOUT=A
//TRACE    DD DSN=&&TRACE,DISP=(OLD,DELETE)
//SYSOUT   DD SYSOUT=A
//SORTLIB  DD DSN=SYS1.SORTLIB,DISP=SHR
//SORTIN   DD UNIT=SYSDA,SPACE=(CYL,(1,1)),
//            DCB=(RECFM=FB,LRECL=28,BLKSIZE=560)
//SORTOUT  DD UNIT=SYSDA,SPACE=(CYL,(1,1)),
//            DCB=(RECFM=FB,LRECL=28,BLKSIZE=560)
//SORTWK01 DD UNIT=SYSDA,SPACE=(TRK,(100),,CONTIG)
//SORTWK02 DD UNIT=SYSDA,SPACE=(TRK,(100),,CONTIG)
//SORTWK03 DD UNIT=SYSDA,SPACE=(TRK,(100),,CONTIG)
//SORTWK04 DD UNIT=SYSDA,SPACE=(TRK,(100),,CONTIG)
//SORTWK05 DD UNIT=SYSDA,SPACE=(TRK,(100),,CONTIG)
//SORTWK06 DD UNIT=SYSDA,SPACE=(TRK,(100),,CONTIG)
