         TITLE 'IGG0CLBA, TESTS                                        *
                        '
IGG0CLBA CSECT ,                                                   0001
@MAINENT DS    0H                                                  0001
         USING *,@15                                               0001
         B     @PROLOG                                             0001
         DC    AL1(16)                                             0001
         DC    C'IGG0CLBA  78.152'                                 0001
         DROP  @15
@PROLOG  DS    0H                                                  0002
         USING @MAINENT,@15
         USING @DATD-(CCATEMPS-IGGCCA),R11
         DS 0F
         DC CL8'IGGPTSTS'
         EJECT
         B     @PB00002                                            0072
IGGPTSTS DS    0H                                                  0073
         ENTRY IGGPTSTS
         DROP @15
Z003     DS    0H                                                  0075
Z003TSTS DS    0H                                                  0076
         STM 12,14,12(13)
         LA 13,12(13)
         BALR 12,0
IGGSEGST DS 0H
         USING *,12
*   CCAURAB=CCARABF;                /* GET FIRST RCD AREA PTR        */
         L     @10,CCARABF(,R11)                                   0083
         ST    @10,CCAURAB(,R11)                                   0083
*   DO WHILE CCAURAB<=CCARABL;      /* FREE ALL BUFFERS              */
         B     @DE00084                                            0084
@DL00084 DS    0H                                                  0085
*     CCARBU1=OFF;                  /* MAKE BUFFER AVAILABLE         */
*     CCARBU2=OFF;                  /* MAKE BUFFER AVAILABLE         */
         L     @10,CCAURAB(,R11)                                   0086
         NI    CCARBU1(@10),B'10011111'                            0086
*     CCAURAB=CCAURAB+LENGTH(CCARAB);/* GET NEXT RCD AREA PTR        */
         AL    @10,@CF00042                                        0087
         ST    @10,CCAURAB(,R11)                                   0087
*   END;                            /* END FREEING                   */
@DE00084 CLC   CCAURAB(4,R11),CCARABL(R11)                         0088
         BNH   @DL00084                                            0088
*   IF CCATNREL=1 THEN              /* CHECK IF FIRST CALL FOR THIS
*                                      FIELD CHAIN                   */
         CLC   CCATNREL(2,R11),@CH00048                            0089
         BNE   @RF00089                                            0089
*     CCATNO=0;                     /* SET NUMBER OF SUCCESSFUL    0090
*                                      RELREPNOS (TOTAL)             */
         SLR   @10,@10                                             0090
         STH   @10,CCATNO(,R11)                                    0090
*   ELSE                                                           0091
*     ;                             /* NOT FIRST CALL                */
@RF00089 DS    0H                                                  0092
*   CCALREL=CCATNREL;               /* GET NEXT RELREPNO FOR       0092
*                                      RELREPNOS                     */
         LH    @10,CCATNREL(,R11)                                  0092
         STH   @10,CCALREL(,R11)                                   0092
*   CCATNUM=0;                      /* NUMBER SUCCESSFUL RELREPNOS 0093
*                                      INITIALLY ZERO                */
         SLR   @10,@10                                             0093
         STH   @10,CCATNUM(,R11)                                   0093
*   CCATEX=OFF;                     /* ENTER PROCESSING LOOP         */
         NI    CCATEX(R11),B'11111011'                             0094
*   DO WHILE(CCACD1=RCS&CCATEX=OFF);/* PROCESS TESTS FOR ALL       0095
*                                      RELREPNOS                     */
         B     @DE00095                                            0095
@DL00095 DS    0H                                                  0096
*     CCATEST=CTGFLCHN;             /* GET FIRST TEST                */
         L     @10,CCAFLPT(,R11)                                   0096
         L     @10,CTGFLCHN(,@10)                                  0096
         ST    @10,CCATEST(,R11)                                   0096
*     CCATHIT=ON;                   /* ASSUME SUCCESSFUL FOR THIS  0097
*                                      RELREPNO                      */
         OI    CCATHIT(R11),B'00001000'                            0097
*     CCATCOMP=OFF;                 /* ASSUME NOT COMPLETE           */
         NI    CCATCOMP(R11),B'11111110'                           0098
*     CCATEX1=OFF;                  /* BEGIN PROCESSING EACH TEST    */
         NI    CCATEX1(R11),B'11111101'                            0099
*     DO WHILE(CCATEST^=0&CCATEX1=OFF&/* PROCESS THIS                */
*           CCACD1=RCS);            /* PARTICULAR TEST               */
         B     @DE00100                                            0100
@DL00100 DS    0H                                                  0101
*       RFY                                                        0101
*         CTGFL BASED(CCATEST);     /* TEST POINTER BASE             */
*       CTGFLDTS=OFF;               /* ASSUME TEST SUCCESSFUL        */
         L     @10,CCATEST(,R11)                                   0102
         NI    CTGFLDTS(@10),B'11111110'                           0102
*       IF DICTFLGS=DTSCC&          /* IS THIS CNTREPNO FIELD        */
*           DICTST=DTCNT THEN       /* TO BE PROCESSED               */
         LA    @05,4                                               0103
         ALR   @05,@10                                             0103
         CLI   DICTFLGS(@05),X'60'                                 0103
         BNE   @RF00103                                            0103
         CLI   DICTST(@05),2                                       0103
         BNE   @RF00103                                            0103
*         DO;                       /* PROCESS CNTREPNO              */
*           IF CCATNO>=USERD(1:2) THEN/* HAS LIMIT OF RELREPNOS BEEN
*                                      EXCEEDED                      */
         L     @10,CTGFLPT(,@10)                                   0105
         LH    @05,CCATNO(,R11)                                    0105
         SLR   @15,@15                                             0105
         ICM   @15,3,USERD(@10)                                    0105
         CR    @05,@15                                             0105
         BL    @RF00105                                            0105
*             DO;                   /* INDICATE FINISHED             */
*               CCATHIT=OFF;        /* NOT SUCCESSFUL FOR THIS     0107
*                                      RELREPNO                      */
*               CCATEX=ON;          /* PROCESS NO MORE RELREPNOS     */
*               CCATEX1=ON;         /* PROCESS NO MORE TESTS         */
         OI    CCATEX(R11),B'00000110'                             0109
         NI    CCATHIT(R11),B'11110111'                            0109
*               CCATCOMP=ON;        /* TESTS COMPLETE                */
         OI    CCATCOMP(R11),B'00000001'                           0110
*             END;                  /* END INDICATE FINISHED         */
*           ELSE                                                   0112
*             ;                     /* LIMIT NOT EXCEEDED            */
@RF00105 DS    0H                                                  0113
*         END;                      /* END PROCESS CNTREPNO          */
*       ELSE                        /* NOT CNTREPND FIELD            */
*         DO;                       /* PROCESS TEST FIELD            */
         B     @RC00103                                            0114
@RF00103 DS    0H                                                  0115
*           CCARBAL=0;              /* SET INITIAL DISPLACEMENT INTO
*                                      RBA HOLDER FIELD              */
         SLR   @10,@10                                             0115
         STH   @10,CCARBAL(,R11)                                   0115
*           CCALFT=ON;              /* INDICATE FIRST TIME           */
         OI    CCALFT(R11),B'00000010'                             0116
*           CCAGVEXT=0;             /* NO EXTENSION                  */
         STCM  @10,7,CCAGVEXT(R11)                                 0117
*           CCADICT=CTGFLDWA;       /* SET DICTIONARY INFO           */
         L     @10,CCATEST(,R11)                                   0118
         MVC   CCADICT(4,R11),CTGFLDWA(@10)                        0118
*           CCAGVNC=ON;             /* START GETVAL PROCESSING       */
         OI    CCAGVNC(R11),B'00100000'                            0119
*           DO WHILE(CCACD1=RCS&    /* TEST VALUE BY MULTIPLE        */
*                 CCAGVNC=ON);      /* CALLS TO GETVAL               */
         B     @DE00120                                            0120
@DL00120 DS    0H                                                  0121
*Z004GVAL:                                                         0121
*             CALL IGGPGVAL;        /* CALL GETVAL                   */
Z004GVAL BAL   @14,IGGPGVAL                                        0121
*             IF CCACD1^=RCS×       /* CHECK FOR ERROR OR NO         */
*                 CCAGVNBS=ON THEN  /* BUFFER SPACE                  */
         CLI   CCACD1(R11),0                                       0122
         BNE   @RT00122                                            0122
         TM    CCAGVNBS(R11),B'00001000'                           0122
         BNO   @RF00122                                            0122
@RT00122 DS    0H                                                  0123
*               DO;                 /* PROCESS CONDITION             */
*                 CCATHIT=OFF;      /* NOT SUCCESSFUL FOR THIS     0124
*                                      RELREPNO                      */
*                 CCATEX=ON;        /* EXIT FROM RELREPNO LOOP       */
*                 CCATEX1=ON;       /* EXIT FROM TEST LOOP           */
         OI    CCATEX(R11),B'00000110'                             0126
         NI    CCATHIT(R11),B'11110111'                            0126
*                 CCAGVNC=OFF;      /* EXIT FROM GETVAL LOOP         */
         NI    CCAGVNC(R11),B'11011111'                            0127
*                 CCALREL=CCALREL-1;/* SET UP FOR NEXT RELREPNO      */
         LH    @10,CCALREL(,R11)                                   0128
         BCTR  @10,0                                               0128
         STH   @10,CCALREL(,R11)                                   0128
*               END;                /* END PROCESS CONDITION         */
*             ELSE                  /* THERE WAS BUFFER SPACE        */
*               IF CCAGVNF=ON×      /* IF NOT FOUND OR FIELD         */
*                   (CCASUPFD=ON&   /* SUPPRESSION IS IN EFFECT      */
*                   DICTGC=PSWDGC) THEN/* FOR THIS GROUP CODE        */
         B     @RC00122                                            0130
@RF00122 TM    CCAGVNF(R11),B'00010000'                            0130
         BO    @RT00130                                            0130
         TM    CCASUPFD(R11),B'00001000'                           0130
         BNO   @RF00130                                            0130
         L     @10,CCATEST(,R11)                                   0130
         CLI   DICTGC+4(@10),4                                     0130
         BNE   @RF00130                                            0130
@RT00130 DS    0H                                                  0131
*                 DO;               /* PROCESS NOT FOUND             */
*                   CCATHIT=OFF;    /* NOT SUCCESSFUL FOR THIS     0132
*                                      RELREPNO                      */
         NI    CCATHIT(R11),B'11110111'                            0132
*                   CCATCOMP=ON;    /* COMPLETE                      */
         OI    CCATCOMP(R11),B'00000001'                           0133
*                   CCATEX=ON;      /* EXIT FROM RELREPNO LOOP       */
*                   CCATEX1=ON;     /* EXIST FROM TEST LOOP          */
         OI    CCATEX(R11),B'00000110'                             0135
*                   CCAGVNC=OFF;    /* EXIT FROM GETVAL LOOP         */
         NI    CCAGVNC(R11),B'11011111'                            0136
*                 END;              /* END PROCESS NOT FOUND         */
*               ELSE                /* RELREPNO FOUND                */
*                 DO;               /* PERFORM COMPARISON            */
         B     @RC00130                                            0138
@RF00130 DS    0H                                                  0139
*                   IF CCALFT=ON THEN/* IF FIRST TIME                */
         TM    CCALFT(R11),B'00000010'                             0139
         BNO   @RF00139                                            0139
*                     DO;           /* MAKE BUFFER UNAVAILABLE       */
*                       IF CCAGOPLN=CATGOPLN THEN/* IF NOT VOLUME  0141
*                                                            @XM01569*/
         CLC   CCAGOPLN(2,R11),@CH00065                            0141
         BNE   @RF00141                                            0141
*                         CCARBU2=ON;/* SAVE I/O             @XM01569*/
         L     @10,CCAURAB(,R11)                                   0142
         OI    CCARBU2(@10),B'00100000'                            0142
*                       ELSE                                       0143
*                         ;         /* VOLUME RCD            @XM01569*/
@RF00141 DS    0H                                                  0144
*                       CCARABPT=CCAURAB;/* SAVE RAB ADDR            */
         L     @10,CCAURAB(,R11)                                   0144
         ST    @10,CCARABPT(,R11)                                  0144
*                       CCALFT=OFF; /* NOT FIRST TIME HEREAFTER      */
         NI    CCALFT(R11),B'11111101'                             0145
*                     END;          /* END BUFFER UNAVAILABLE        */
*                   ELSE                                           0147
*                     ;             /* NOT FIRST TIME                */
@RF00139 DS    0H                                                  0148
*Z005TCMP:                                                         0148
*                   CALL IGGPTCMP;  /* CALL TESTS COMPARE            */
Z005TCMP BAL   @14,IGGPTCMP                                        0148
*                   IF CCAGVNC=OFF& /* IF COMPLETE AND NO HIT        */
*                       CCATHIT=OFF THEN/* WAS GOTTEN                */
         TM    CCAGVNC(R11),B'00100000'                            0149
         BNZ   @RF00149                                            0149
         TM    CCATHIT(R11),B'00001000'                            0149
         BNZ   @RF00149                                            0149
*                     DO;           /* MAKE BUFFER AVAIL             */
*                       CCARABPT->CCARBU2=OFF;/* MAKE BUFFER AVAIL   */
         L     @10,CCARABPT(,R11)                                  0151
         NI    CCARBU2(@10),B'11011111'                            0151
*                     END;          /* END MAKE BUFFER AVAIL         */
*                   ELSE                                           0153
*                     ;             /* INCOMPLETE OR HIT             */
@RF00149 DS    0H                                                  0154
*                 END;              /* END PERFORM COMPARISON        */
*           END;                    /* END TEST VALUE                */
@RC00130 DS    0H                                                  0155
@RC00122 DS    0H                                                  0155
@DE00120 CLI   CCACD1(R11),0                                       0155
         BNE   @DC00120                                            0155
         TM    CCAGVNC(R11),B'00100000'                            0155
         BO    @DL00120                                            0155
@DC00120 DS    0H                                                  0156
*         END;                      /* END PROCESS TEST FIELD        */
*       CCATEST=CTGFLCHN;           /* GET NEXT TEST                 */
@RC00103 L     @10,CCATEST(,R11)                                   0157
         L     @10,CTGFLCHN(,@10)                                  0157
         ST    @10,CCATEST(,R11)                                   0157
*     END;                          /* END PROCESS TEST              */
@DE00100 L     @10,CCATEST(,R11)                                   0158
         LTR   @10,@10                                             0158
         BZ    @DC00100                                            0158
         TM    CCATEX1(R11),B'00000010'                            0158
         BNZ   @DC00100                                            0158
         CLI   CCACD1(R11),0                                       0158
         BE    @DL00100                                            0158
@DC00100 DS    0H                                                  0159
*     IF CCATHIT=ON THEN            /* IF ALL TESTS SUCCESSFUL       */
         TM    CCATHIT(R11),B'00001000'                            0159
         BNO   @RF00159                                            0159
*       DO;                         /* SUCCESSFUL PROCESSING         */
*         IF CCAGOPLN=CATGOPLN THEN /* IF NOT VOL            @XM01569*/
         CLC   CCAGOPLN(2,R11),@CH00065                            0161
         BNE   @RF00161                                            0161
*           CCARABB->CCARBU1=ON;    /* SET BUFFER UNAVAILABLE      0162
*                                                            @XM01569*/
         L     @10,CCARABB(,R11)                                   0162
         OI    CCARBU1(@10),B'01000000'                            0162
*         ELSE                                                     0163
*           ;                       /* VOLUME RCD            @XM01569*/
@RF00161 DS    0H                                                  0164
*         CCATNUM=CCATNUM+1;        /* INCR NO. SUCCESSFUL RELREPNOS */
         LA    @10,1                                               0164
         LH    @05,CCATNUM(,R11)                                   0164
         ALR   @05,@10                                             0164
         STH   @05,CCATNUM(,R11)                                   0164
*         CCATREL(CCATNUM)=CCALREL; /* SAVE RELREPNO                 */
         ALR   @05,@05                                             0165
         LH    @15,CCALREL(,R11)                                   0165
         STH   @15,CCATREL-2(@05,R11)                              0165
*         CCATNO=CCATNO+1;          /* INCR TOTAL NO. OF SUCCESSFUL
*                                      RELREPNOS                     */
         AH    @10,CCATNO(,R11)                                    0166
         STH   @10,CCATNO(,R11)                                    0166
*       END;                        /* END SUCCESSFUL PROCESSING     */
*     ELSE                                                         0168
*       ;                           /* TESTS NOT SUCCESSFUL          */
@RF00159 DS    0H                                                  0169
*     CCALREL=CCALREL+1;            /* GET NEXT RELREPNO             */
         LA    @10,1                                               0169
         AH    @10,CCALREL(,R11)                                   0169
         STH   @10,CCALREL(,R11)                                   0169
*     CCATNREL=CCALREL;             /* SET NEXT RELREPNO             */
         STH   @10,CCATNREL(,R11)                                  0170
*     IF CCATNUM>=TESTNUM THEN      /* LIMIT OF RELREPNOS REACHED    */
         LH    @10,CCATNUM(,R11)                                   0171
         C     @10,@CF00044                                        0171
         BL    @RF00171                                            0171
*       DO;                         /* PROCESS FOR RETURN            */
*         CCATEX=ON;                /* EXIT FROM PROCESSING RELREPNOS*/
         OI    CCATEX(R11),B'00000100'                             0173
*       END;                        /* END PROCESS                   */
*     ELSE                                                         0175
*       ;                           /* LIMIT NOT REACHED             */
@RF00171 DS    0H                                                  0176
*     RFY                                                          0176
*       CTGFL BASED(CCAFLPT);       /* ORIGINAL BASE                 */
*     CCATEST=CTGFLCHN;             /* GET FIRST TEST                */
         L     @10,CCAFLPT(,R11)                                   0177
         L     @10,CTGFLCHN(,@10)                                  0177
         ST    @10,CCATEST(,R11)                                   0177
*     RFY                                                          0178
*       CTGFL BASED(CCATEST);       /* TEST FIELD PTR BASE           */
*     IF DICTREP=ON THEN            /* SEE IF REPEATING              */
         TM    DICTREP+4(@10),B'01000000'                          0179
         BNO   @RF00179                                            0179
*       IF CCATCOMP=ON THEN         /* ARE TESTS COMPLETE            */
         TM    CCATCOMP(R11),B'00000001'                           0180
         BNO   @RF00180                                            0180
*         DO WHILE(CCATEST^=0);     /* SET TEST FIELD INDICATOR      */
         B     @DE00181                                            0181
@DL00181 DS    0H                                                  0182
*           IF CCATNO>0 THEN        /* IF SUCCESSFUL RELREPNOS       */
         LH    @10,CCATNO(,R11)                                    0182
         LTR   @10,@10                                             0182
         BNP   @RF00182                                            0182
*             CTGFLDTS=OFF;         /* TEST SUCCESSFUL               */
         L     @10,CCATEST(,R11)                                   0183
         NI    CTGFLDTS(@10),B'11111110'                           0183
*           ELSE                    /* NO SUCCESSFUL RELREPNOS       */
*             CTGFLDTS=ON;          /* TEST UNSUCCESSFUL             */
         B     @RC00182                                            0184
@RF00182 L     @10,CCATEST(,R11)                                   0184
         OI    CTGFLDTS(@10),B'00000001'                           0184
*           CCATEST=CTGFLCHN;       /* GET NEXT TEST                 */
@RC00182 L     @10,CCATEST(,R11)                                   0185
         L     @10,CTGFLCHN(,@10)                                  0185
         ST    @10,CCATEST(,R11)                                   0185
*         END;                      /* END TEST PROCESSING           */
@DE00181 L     @10,CCATEST(,R11)                                   0186
         LTR   @10,@10                                             0186
         BNZ   @DL00181                                            0186
*       ELSE                                                       0187
*         ;                         /* TESTS NOT COMPLETE            */
@RF00180 DS    0H                                                  0188
*     ELSE                          /* NOT REPEATING                 */
*       DO;                         /* MUST EXIT WITHOUT RETURN      */
         B     @RC00179                                            0188
@RF00179 DS    0H                                                  0189
*         CCATCOMP=ON;              /* TESTS COMPLETE                */
         OI    CCATCOMP(R11),B'00000001'                           0189
*         CCATEX=ON;                /* EXIT FROM RELREPNO LOOP       */
         OI    CCATEX(R11),B'00000100'                             0190
*       END;                        /* END EXIT PROCESSING           */
*   END;                            /* END PROCESS RELREPNOS         */
@RC00179 DS    0H                                                  0192
@DE00095 CLI   CCACD1(R11),0                                       0192
         BNE   @DC00095                                            0192
         TM    CCATEX(R11),B'00000100'                             0192
         BZ    @DL00095                                            0192
@DC00095 DS    0H                                                  0193
*   CCAURAB=CCARABF;                /* GET FIRST RCD AREA PTR        */
         L     @10,CCARABF(,R11)                                   0193
         ST    @10,CCAURAB(,R11)                                   0193
*   DO WHILE(CCAURAB<=CCARABL);     /* FREE ALL BUFFERS              */
         B     @DE00194                                            0194
@DL00194 DS    0H                                                  0195
*     CCARBU1=OFF;                  /* FREE BUFFER                   */
*     CCARBU2=OFF;                  /* FREE BUFFER                   */
         L     @10,CCAURAB(,R11)                                   0196
         NI    CCARBU1(@10),B'10011111'                            0196
*     CCAURAB=CCAURAB+LENGTH(CCARAB);/* GET NEXT RAB                 */
         AL    @10,@CF00042                                        0197
         ST    @10,CCAURAB(,R11)                                   0197
*   END;                            /* END FREEING                   */
@DE00194 CLC   CCAURAB(4,R11),CCARABL(R11)                         0198
         BNH   @DL00194                                            0198
*   IF CCAGOPLN=VOLGOPLN THEN       /* IF VOLUME RCD         @XM01569*/
         CLC   CCAGOPLN(2,R11),@CH00063                            0199
         BNE   @RF00199                                            0199
*     DO;                           /* REREAD BASE RCD       @XM01569*/
*       CCASRID=CCACBASE;           /* SET BASE RCD ARG      @XM01569*/
         MVC   CCASRID(3,R11),CCACBASE(R11)                        0201
*Z006GREC:                                                         0202
*       CALL IGGPGREC;              /* READ BASE             @XM01569*/
Z006GREC BAL   @14,IGGPGREC                                        0202
*     END;                          /* END REREAD            @XM01569*/
*   ELSE                                                           0204
*     ;                             /* NOT VOLUME RCD        @XM01569*/
@RF00199 DS    0H                                                  0205
*   RFY                                                            0205
*     CTGFL BASED(CCAFLPT);         /* ORIGINAL BASE                 */
*   CALL EXIT;                      /* RETURN TO CALLER              */
         BAL   @14,EXIT                                            0206
*   GEN(DS 0F);                     /* FULLWORD BOUNDARY ALIGNMENT   */
         DS 0F
*   GEN(DC CL8'IGGPTCMP');          /* NAME OF FOLLOWING PROCEDURE   */
         DC CL8'IGGPTCMP'
*   END;                            /* END OF INNER PROCEDURE        */
@EL00002 DS    0H                                                  0209
@EF00002 DS    0H                                                  0209
@ER00002 BR    @14                                                 0209
@PB00002 DS    0H                                                  0210
*   GEN(EJECT);                     /* GO TO A NEW PRINT PAGE        */
         EJECT
*                                                                  0211
*/********************************************************************/
*/*                                                                  */
*/*        IGGPTCMP  -  PROCEDURE  INTERNALLY  CALLED  NESTED        */
*/*                                                                  */
*/********************************************************************/
*                                                                  0211
*IGGPTCMP:                                                         0211
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);/* SPECIFY PROCEDURE OPTIONS     */
         B     @PB00003                                            0211
IGGPTCMP DS    0H                                                  0212
*Z007:                              /* LABEL FOR PROCEDURE TRACKING  */
*Z007TCMP:                          /* LABEL FOR PROCEDURE TRACKING  */
*   RFY                                                            0212
*    (R5,                                                          0212
*     R6,                                                          0212
*     R7,                                                          0212
*     R8,                                                          0212
*     R9,                                                          0212
*     R10) UNRSTD;                  /* PL/S COMPILER WORK REGISTERS  */
Z007     DS    0H                                                  0212
Z007TCMP DS    0H                                                  0213
*   RFY                                                            0213
*    (R2,                                                          0213
*     R3,                                                          0213
*     R4) RSTD;                     /* RESTRICT LOCAL WORK REGISTERS */
*   GEN(STM 12,14,12(13));          /* SAVE REGISTERS OF CALLER      */
         STM 12,14,12(13)
*   GEN(LA 13,12(13));              /* POINT TO NEXT SAVE AREA     0215
*                                      PROCEDURE                     */
         LA 13,12(13)
*/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
**   MODULE NAME =  IGGPTCMP (IGG0CLBA)                               *
**                                                                    *
**   DESCRIPTIVE NAME =  TEST COMPARE                                 *
**                                                                    *
**   FUNCTION =                                                       *
**      THIS SUB-FUNCTION TAKES THE SINGLE INPUT TEST FPL AND MAKES   *
**      THE USER SPECIFIED COMPARISON WITH THE RETRIEVED CATALOG DATA *
**      AND THE USER INPUT TEST FPL DATA. THE PROCESSING IS AS        *
**      FOLLOWS:                                                      *
**      1. IF THE TEST FPL FIELD NAME IS TRBAEXT, TEST EACH LOGICAL   *
**         EXTENT DESCRIPTOR TO DETERMINE WHETHER THE INPUT RBA IS    *
**         WITHIN THE LOGICAL EXTENT.  IN THIS CASE, MULTIPLE CALLS   *
**         TO IGGPGVAL MAY BE NECESSARY TO RETRIEVE ADDITIONAL EXTENT *
**         DESCRIPTOR SEGMENTS.                                       *
**      2. IF THE CATALOG FIELD TO BE TESTED IS NON-EXISTENT,         *
**         INDICATE THE TEST FPL HAS FAILED.                          *
**      3. IF THE CATALOG FIELD IS A NON-FLAG FIELD, MAKE THE TEST    *
**         COMPARISON BY CLC (COMPARE LOGICAL CHARACTER), OTHERWISE,  *
**         IF THE CATALOG FIELD IS A FLAG FIELD, MAKE THE TEST        *
**         COMPARISON BY TM (TEST UNDER MASK).                        *
**                                                                    *
**   INPUT =                                                          *
**      CCATEST - ADDRESS OF TEST FPL TO BE PROCESSED.                *
**      CCARBAL - CURRENT DISPLACEMENT OF NEXT EXTENT DESCRIPTOR TO   *
**                BE PROCESSED.                                       *
**                                                                    *
**   OUTPUT =                                                         *
**      CCATHIT - IF SET ON, INDICATES TEST WAS SUCCESSFUL.           *
**      CCAGVNC - INDICATES WHETHER IGGPGVAL MUST BE CALLED AGAIN.    *
**      CCATEX1 - IF SET ON, INDICATES NO MORE TESTS SHOULD BE        *
**                PROCESSED AGAINST THIS RELREPNO.                    *
**      CCARBAL - SAME AS ABOVE                                       *
**      IEZCTGFL - THE FOLLOWING FIELD IS SET IN THE FPL:             *
**         CTGFLDRE - TEST COMPARISON RESULT.                         *
**           CTGFLDTS - IF SET ON, INDICATES TEST FAILED. OTHERWISE,  *
**                    INDICATES TEST WAS SUCCESSFUL.                  *
**                                                                    *
**                                                                    *
** * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
*                                                                  0216
*   DCL                                                            0216
*     TESTCOND BIT(8) CONSTANT('F0'X);/* TEST CONDITION              */
*   DCL                                                            0217
*     INSERT4 CHAR(512) BASED(CCAIDPT);/* INSERTION INFO             */
*   RFY                                                            0218
*     CTGFL BASED(CCATEST);         /* TEST FIELD PTR BASE           */
*   IF DIC2FLGS=DTSTR THEN          /* IS THIS TRBAEXT               */
         CLI   DIC2FLGS+372(R11),X'E8'                             0219
         BNE   @RF00219                                            0219
*     DO;                           /* PROCESS TRBAEXT               */
*       RFY                                                        0221
*        (R5,                                                      0221
*         R6,                                                      0221
*         R7) RSTD;                 /* TEST REGS                     */
*       CCATEX2=OFF;                /* ENTER RBA COMPARE LOOP        */
*       CCATHIT=OFF;                /* ASSUME UNSUCCESSFUL TEST    0223
*                                                            @ZA04701*/
*       CCATEX1=ON;                 /* ASSUME NO MORE TESTS  @ZA04701*/
         OI    CCATEX1(R11),B'00000010'                            0224
         NI    CCATEX2(R11),B'11110110'                            0224
*       CCATLNG=0;                  /* SET INITIAL LENGTH TESTED     */
         SLR   @10,@10                                             0225
         STH   @10,CCATLNG(,R11)                                   0225
*       CCAILNG=CCAILNG-LENGTH(VARLEN);/* GET FIELD LENGTH           */
         LA    @10,2                                               0226
         L     @15,CCAILNG(,R11)                                   0226
         SLR   @15,@10                                             0226
         ST    @15,CCAILNG(,R11)                                   0226
*       CCACPE7=CCACPE7+LENGTH(VARLEN);/* GET FIELD ADDRESS          */
         AL    @10,CCACPE7(,R11)                                   0227
         ST    @10,CCACPE7(,R11)                                   0227
*       DO WHILE(CCATEX2=OFF);      /* RBA COMPARE LOOP              */
         B     @DE00228                                            0228
@DL00228 DS    0H                                                  0229
*         R2=MIN(EXTLEN,CCAILNG-CCATLNG);/* GET MINIMUM LENGTH       */
         LA    @10,20                                              0229
         LH    @15,CCATLNG(,R11)                                   0229
         L     R2,CCAILNG(,R11)                                    0229
         SLR   R2,@15                                              0229
         CR    R2,@10                                              0229
         BNH   *+6
         LR    R2,@10                                              0229
*         R3=MIN(R2,EXTLEN-CCARBAL);/* GET MINIMUM MOVE LENGTH       */
         LH    @14,CCARBAL(,R11)                                   0230
         SLR   @10,@14                                             0230
         CR    @10,R2                                              0230
         BNH   *+6
         LR    @10,R2                                              0230
         LR    R3,@10                                              0230
*         IF R3^=0 THEN             /* SOMETHING TO MOVE             */
*                                                                  0231
         LTR   R3,R3                                               0231
         BZ    @RF00231                                            0231
*           /*********************************************************/
*           /*                                                       */
*           /* SET EXTENT DESCRIPTOR SEGMENT-SSCCHHCCHHTTDDDDOODD    */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0232
*           CCARBA(1+CCARBAL:R3+CCARBAL)=/* MOVE (PARTIAL)           */
*               INSERT4(1+CCATLNG:R3+CCATLNG);/* EXTENT              */
         ALR   @14,R11                                             0232
         LH    @10,CCARBAL(,R11)                                   0232
         LR    @09,R3                                              0232
         ALR   @09,@10                                             0232
         SLR   @09,@10                                             0232
         BCTR  @09,0                                               0232
         L     @10,CCAIDPT(,R11)                                   0232
         ALR   @10,@15                                             0232
         EX    @09,@SM02791                                        0232
*         ELSE                                                     0233
*           ;                       /* NOTHING TO MOVE               */
@RF00231 DS    0H                                                  0234
*         IF CCATLNG>CCAILNG-EXTLEN THEN/* PARTIAL EXTENT LEFT       */
         L     @10,CCAILNG(,R11)                                   0234
         SL    @10,@CF00042                                        0234
         CH    @10,CCATLNG(,R11)                                   0234
         BNL   @RF00234                                            0234
*           DO;                     /* SET UP FOR NEXT PASS          */
*             CCARBAL=R3;           /* SAVE PARTIAL LENGTH           */
         STH   R3,CCARBAL(,R11)                                    0236
*             CCATEX2=ON;           /* NO MORE COMPARES              */
         OI    CCATEX2(R11),B'00000001'                            0237
*           END;                    /* END SET UP                    */
*         ELSE                      /* FULL EXTENT                   */
*           DO;                     /* COMPARE AND SET UP FOR NEXT 0239
*                                      PASS                          */
         B     @RC00234                                            0239
@RF00234 DS    0H                                                  0240
*             CCARBAL=0;            /* NO PARTIAL EXTENT             */
         SLR   @10,@10                                             0240
         STH   @10,CCARBAL(,R11)                                   0240
*             CCATLNG=CCATLNG+R3;   /* INCR TESTED LENGTH            */
         LR    @10,R3                                              0241
         AH    @10,CCATLNG(,R11)                                   0241
         STH   @10,CCATLNG(,R11)                                   0241
*             IF USERD(1:4)>=CCARBA1&/* COMPARE HIGH AND LOW         */
*                 USERD(1:4)<=CCARBA2 THEN/* RBAS                    */
         L     @10,CCATEST(,R11)                                   0242
         L     @10,CTGFLPT(,@10)                                   0242
         CLC   USERD(4,@10),CCARBA1(R11)                           0242
         BL    @RF00242                                            0242
         CLC   USERD(4,@10),CCARBA2(R11)                           0242
         BH    @RF00242                                            0242
*               DO;                 /* INDICATE SUCCESSFUL           */
*                 CCATEX2=ON;       /* NO MORE COMPARES              */
*                 CCATHIT=ON;       /* SUCCESSFUL INDICATOR          */
         OI    CCATEX2(R11),B'00001001'                            0245
*                 CCAGVNC=OFF;      /* DONT CALL GETVAL AGAIN        */
         NI    CCAGVNC(R11),B'11011111'                            0246
*                 CCATEX1=OFF;      /* CONTINUE TESTING FPLS         */
         NI    CCATEX1(R11),B'11111101'                            0247
*               END;                /* END INDICATE SUCCESSFUL       */
*             ELSE                                                 0249
*               ;                   /* DOESNT COMPARE        @ZA04701*/
@RF00242 DS    0H                                                  0250
*           END;                    /* END COMPARE, SETUP            */
*       END;                        /* END RDA COMPARE               */
@RC00234 DS    0H                                                  0251
@DE00228 TM    CCATEX2(R11),B'00000001'                            0251
         BZ    @DL00228                                            0251
*     END;                          /* END PROCESS TRBAEXT           */
*   ELSE                            /* NOT TRBAEXT                   */
*     IF CCAGVNE=ON THEN            /* IF NON- EXISTENT FIELD        */
         B     @RC00219                                            0253
@RF00219 TM    CCAGVNE(R11),B'00000010'                            0253
         BNO   @RF00253                                            0253
*       DO;                         /* PROCESS FIELD                 */
*         CTGFLDTS=ON;              /* TEST FAILED                   */
         L     @10,CCATEST(,R11)                                   0255
         OI    CTGFLDTS(@10),B'00000001'                           0255
*         CCATHIT=OFF;              /* NOT SUCCESSFUL                */
*         CCATEX1=ON;               /* NO MORE TESTS PROCESSED       */
         OI    CCATEX1(R11),B'00000010'                            0257
         NI    CCATHIT(R11),B'11110111'                            0257
*         CCAGVNC=OFF;              /* DONT RETURN                   */
         NI    CCAGVNC(R11),B'11011111'                            0258
*       END;                        /* END PROCESS FIELD             */
*     ELSE                          /* NOT NON-EXISTENT FIXED LENGTH
*                                      FIELD                         */
*       DO;                         /* PROCESS FIELD                 */
         B     @RC00253                                            0260
@RF00253 DS    0H                                                  0261
*         R2=MIN(CCAILNG,CTGFLNG(1));/* GET MIN LENGTH FOR COMPARE   */
         L     @10,CCATEST(,R11)                                   0261
         L     R2,CCAILNG(,R11)                                    0261
         L     @15,CTGFLNG(,@10)                                   0261
         CR    R2,@15                                              0261
         BNH   *+6
         LR    R2,@15                                              0261
*         R2=R2-1;                  /* DECR LENGTH FOR COMPARE       */
         BCTR  R2,0                                                0262
*         R3=CTGFLDCD&TESTCOND;     /* GET TEST CONDITION            */
         LA    R3,240                                              0263
         SLR   @15,@15                                             0263
         IC    @15,CTGFLDCD(,@10)                                  0263
         NR    R3,@15                                              0263
*         R4=CTGFLPT(1);            /* INPUT DATA POINTER            */
         L     R4,CTGFLPT(,@10)                                    0264
*         R5=CCACPE7;               /* ADDR OF VALUE IN RECORD       */
         L     R5,CCACPE7(,R11)                                    0265
*         IF DIC2FLG=OFF THEN       /* IF NOT FLAG FIELD             */
         LA    @10,372                                             0266
         ALR   @10,R11                                             0266
         TM    DIC2FLG(@10),B'00010000'                            0266
         BNZ   @RF00266                                            0266
*           DO;                     /* COMPARE VALUES                */
*             IF DIC2VAR=ON THEN    /* IF VARIABLE LENGTH FIELD      */
         TM    DIC2VAR(@10),B'10000000'                            0268
         BNO   @RF00268                                            0268
*               DO;                 /* ADJUST DATA LENGTH AND      0269
*                                      ADDRESSES                     */
*                 R4=R4+LENGTH(VARLEN);/* VARIABLE USER DATA         */
         LA    @10,2                                               0270
         ALR   R4,@10                                              0270
*                 R5=R5+LENGTH(VARLEN);/* VARIABLE CATALOG DATA      */
         ALR   R5,@10                                              0271
*                 R2=R2-LENGTH(VARLEN);/* GET COMPARE LENGTH         */
         SLR   R2,@10                                              0272
*               END;                /* END ADJUST                    */
*             ELSE                                                 0274
*               ;                   /* NOT VARIABLE FIELD            */
@RF00268 DS    0H                                                  0275
*             GEN;                                                 0275
*                                       /* EXECUTE CODE             */
         EX    R2,CLC1                  COMPARE VALUES
VALNE    EX    R3,BC1                   BRANCH IF HIT
*             CTGFLDTS=ON;          /* TEST FAILED                   */
         L     @10,CCATEST(,R11)                                   0276
         OI    CTGFLDTS(@10),B'00000001'                           0276
*             CCATHIT=OFF;          /* NOT SUCCESSFUL                */
*             CCATEX1=ON;           /* NO MORE TESTS PROCESSED       */
         OI    CCATEX1(R11),B'00000010'                            0278
         NI    CCATHIT(R11),B'11110111'                            0278
*           END;                    /* END COMPARE                   */
*         ELSE                      /* TEST FLAG FIELD               */
*           DO;                     /* COMPARE VALUES                */
         B     @RC00266                                            0280
@RF00266 DS    0H                                                  0281
*             GEN;                                                 0281
*                                       /* EXECUTE CODE             */
         IC    R4,0(R4)                 GET MASK
         EX    R4,TM1                   TEST UNDER MASK
         EX    R3,BC1                   BRANCH IF HIT
*             CTGFLDTS=ON;          /* TEST FAILED                   */
         L     @10,CCATEST(,R11)                                   0282
         OI    CTGFLDTS(@10),B'00000001'                           0282
*             CCATHIT=OFF;          /* NOT SUCCESSFUL                */
*             CCATEX1=ON;           /* NO MORE TESTS PROCESSED       */
         OI    CCATEX1(R11),B'00000010'                            0284
         NI    CCATHIT(R11),B'11110111'                            0284
*           END;                    /* END COMPARE                   */
*HIT1:                                                             0286
*         ;                         /* EXECUTE BRANCH POINT          */
@RC00266 DS    0H                                                  0286
HIT1     DS    0H                                                  0287
*         CCAGVNC=OFF;              /* DONT RETURN                   */
         NI    CCAGVNC(R11),B'11011111'                            0287
*       END;                        /* END PROCESS FIELD             */
*   CALL EXIT;                      /* RETURN TO CALLER              */
@RC00253 DS    0H                                                  0289
@RC00219 BAL   @14,EXIT                                            0289
*   GEN;                                                           0290
*                                       /* COMPARE CODE           *//*
Z        EQU   0                        ZERO
CLC1     CLC   0(Z,R5),0(R4)            COMPARE VALUES
TM1      TM    0(R5),Z                  TEST UNDER MASK
BC1      BC    0,HIT1                   BRANCH IF HIT
*   RFY                                                            0291
*     CTGFL BASED(CCAFLPT);         /* ORIGINAL BASE                 */
*   RFY                                                            0292
*    (R5,                                                          0292
*     R6,                                                          0292
*     R7) UNRSTD;                   /* FREE TEST REGS                */
*   CALL EXIT;                      /* RETURN TO CALLER              */
         BAL   @14,EXIT                                            0293
*   GEN(DS 0F);                     /* FULLWORD BOUNDARY ALIGNMENT   */
         DS 0F
*   GEN(DC CL8'IGGPGVAL');          /* NAME OF FOLLOWING PROCEDURE   */
         DC CL8'IGGPGVAL'
*   END;                            /* END OF INNER PROCEDURE        */
@EL00003 DS    0H                                                  0296
@EF00003 DS    0H                                                  0296
@ER00003 BR    @14                                                 0296
@PB00003 DS    0H                                                  0297
*   GEN(EJECT);                     /* GO TO A NEW PRINT PAGE        */
         EJECT
*                                                                  0298
*/********************************************************************/
*/*                                                                  */
*/*        IGGPGVAL  -  PROCEDURE  EXTERNALLY  CALLED  NESTED        */
*/*                                                                  */
*/********************************************************************/
*                                                                  0298
*IGGPGVAL:                                                         0298
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);/* SPECIFY PROCEDURE OPTIONS     */
         B     @PB00004                                            0298
IGGPGVAL DS    0H                                                  0299
*   GEN(ENTRY IGGPGVAL );           /* IDENTIFY ENTRY-POINT SYMBOL   */
         ENTRY IGGPGVAL
*Z008:                              /* LABEL FOR PROCEDURE TRACKING  */
*Z008GVAL:                          /* LABEL FOR PROCEDURE TRACKING  */
*   RFY                                                            0300
*    (R5,                                                          0300
*     R6,                                                          0300
*     R7,                                                          0300
*     R8,                                                          0300
*     R9,                                                          0300
*     R10) UNRSTD;                  /* PL/S COMPILER WORK REGISTERS  */
Z008     DS    0H                                                  0300
Z008GVAL DS    0H                                                  0301
*   RFY                                                            0301
*    (R2,                                                          0301
*     R3,                                                          0301
*     R4) RSTD;                     /* RESTRICT LOCAL WORK REGISTERS */
*   GEN(STM 12,14,12(13));          /* SAVE REGISTERS OF CALLER      */
         STM 12,14,12(13)
*   GEN(LA 13,12(13));              /* POINT TO NEXT SAVE AREA       */
         LA 13,12(13)
*   GEN(BALR 12,0);                 /* ESTABLISH ADDRESSABILITY      */
         BALR 12,0
*   GEN(LA 15,*-IGGSEGST(0,0));     /* COMPUTE MODULE BASE           */
         LA 15,*-IGGSEGST(0,0)
*   GEN(SR 12,15);                  /* SET BASE TO MODULE BASE       */
         SR 12,15
*/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
**   MODULE NAME =  IGGPGVAL(IGG0CLBA)                                *
**                                                                    *
**   DESCRIPTIVE NAME =  GET FIELD VALUE                              *
**                                                                    *
**   FUNCTION =                                                       *
**      THIS SUB-FUNCTION IS THE FUNDAMENTAL CATALOG FIELD MANAGEMENT *
**      RETRIEVAL ROUTINE.  IT RETRIEVES INDIVIDUAL NON-REPEATING AND *
**      REPEATING FIXED LENGTH AND VARIABLE LENGTH FIELDS FROM A      *
**      PARTICULAR GROUP OCCURRENCE.  IN THE CASE OF A VARIABLE       *
**      LENGTH FIELD WHICH SPANS PHYSICAL RECORDS, THIS SUB-FUNCTION  *
**      MAY BE REPETITIVELY CALLED TO RETRIEVE EACH VARIABLE LENGTH   *
**      SEQMENT.  THIS SUB-FUNCTION MAY PASS BACK NO CATALOG FIELD    *
**      DATA, IF THERE IS NO AVAILABLE RECORD AREA FOR READING A      *
**      NECESSARY PHYSICAL RECORD, OR IF THE OCCURRENCE WITH THE      *
**      INPUT SEQUENCE NUMBER (I.E. RELREPNO) DOES NOT EXIST, OR IF   *
**      THE OCCURRENCE EXISTS, BUT THE REQUESTED FIELD DOES NOT EXIST *
**      WITHIN THE OCCURRENCE.  WHEN CATALOG FIELD DATA IS RETURNED,  *
**      THE ADDRESS OF THE RECORD AREA IS INDICATED AND THE SEVEN     *
**      BASIC FIELD POINTERS ARE SET ALONG WITH THE LENGTH OF THE     *
**      CATALOG FIELD REQUESTED.  THE PROCESSING IS AS FOLLOWS:       *
**      0. CALL IGGPXVAL TO PERFORM DERIVED VOLUME ENTRY PROCESSING   *
**      1. SET UP FOR READING A PHYSICAL RECORD, IF A SUCCEEDING      *
**         VARIABLE LENGTH SEQMENT IS TO BE RETRIEVED.                *
**      2. CALL IGGPGREC TO READ ANY NECESSARY PHYSICAL RECORD, CHECK-*
**         ING THAT THERE WAS AN AVAILABLE RECORD AREA.               *
**      3. CALL IGGPLVAL TO LOCATE THE FIELD VALUE AND TO ESTABLISH:  *
**         A. WHETHER THE OCCURRENCE EXISTS.                          *
**         B. WHETHER THE FIELD IS EXISTENT.                          *
**         C. WHETHER ANOTHER PHYSICAL RECORD MUST BE READ.           *
**         RECALL STEP 2 IF NECESSARY.                                *
**                                                                    *
**   INPUT =                                                          *
**      CCALREL - SEQUENCE NUMBER OF OCCURRENCE (RELREPNO) TO BE      *
**                RETRIEVED.                                          *
**      CCADICT - DICTIONARY INFORMATION FOR A NON-COMBINATION FIELD  *
**                TO BE RETRIEVED.                                    *
**      CCAGVEXT - CONTROL INTERVAL (CI) NUMBER OF SUCCEEDING PHYSICAL*
**                 RECORD CONTAINING THE NEXT VARIABLE LENGTH SEGMENT.*
**      CURRENT AVAILABLE RECORD AREAS (INDICATED BY CCARBU1,CCARBU2, *
**      AND CCARBUR BEING OFF IN THE ASSOCIATED RAB).                 *
**                                                                    *
**   OUTPUT =                                                         *
**      CCAGVBS - IF SET ON, INDICATES NO RECORD AREAS WERE AVAILABLE *
**                FOR A NECESSARY I/O.                                *
**      CCAGVNF - IF SET ON, INDICATES THE INPUT SEQUENCE NUMBER WAS  *
**                NOT FOUND AND NO OCCURRENCE EXISTS WITH A HIGHER    *
**                SEQUENCE NUMBER.                                    *
**      CCAGVNE - IF SET ON, INDICATES THE REQUESTED FIELD IS NOT     *
**                EXISTENT. IF FIXED LENGTH, A ONE BYTE FIELD OF HEX  *
**                FF IS RETURNED. IF VARIABLE LENGTH, A 2 BYTE FIELD  *
**                OF ZEROS IS RETURNED.                               *
**      CCAGVNC - IF SET ON, INDICATES ANOTHER PHYSICAL RECORD        *
**                CONTAINS THE NEXT SEQMENT OF A VARIABLE LENGTH      *
**                FIELD.                                              *
**      CCAGVEXT - IF CCAGVNC IS ON, THIS FIELD CONTAINS THE CI       *
**                 NUMBER OF THE NEXT PHYSICAL RECORD TO BE RETRIEVED.*
**      THE RECORD AREA CONTAINING THE CATALOG FIELD RETRIEVED HAS    *
**      THE FOLLOWING POINTERS SET:                                   *
**         CCAURAB - RAB ADDRESS OF THE LOCATED RECORD AREA.          *
**         CCACPE1 - ADDRESS OF THE LOGICAL CATALOG RECORD.           *
**         CCACPE2 - ADDRESS OF THE REPEATING CONTROL INFORMATION.    *
**         CCACPE3 - ADDRESS OF THE FIRST OCCURRENCE IN THE LOGICAL   *
**                   RECORD.                                          *
**         CCACPE4 - ADDRESS OF THE END OF THE LOGICAL RECORD.        *
**         CCACPE5 - ADDRESS OF THE GROUP OCCURRENCE POINTER.         *
**         CCACPE6 - ADDRESS OF THE OCCURRENCE CONTAING THE CATALOG   *
**                   FIELD.                                           *
**         CCACPE7 - ADDRESS OF THE CATALOG FIELD.                    *
**         CCAILNG - LENGTH OF THE CATALOG FIELD.                     *
**      CCALREL - UPDATED SEQUENCE NUMBER OF THE OCCURRENCE RETRIEVED,*
**                I.E. DELETED OCCURRENCES ARE AUTOMATICALLY SKIPPED. *
**      IF A PHYSICAL I/O GET IS REQUIRED AND THE WRITE BIT (CCARBWR) *
**      IS SET ON, THEN THE RECORD AREA IS WRITTEN OUT BEFORE THE I/O *
**      GET IS PERFORMED.                                             *
**                                                                    *
**                                                                    *
** * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
*                                                                  0307
*   /*****************************************************************/
*   /*                                                               */
*   /* CALL TO MODULE IGG0CLBS                                       */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0307
*Z009XVAL:                                                         0307
*   CALL IGGPXVAL;                  /* GVAL TRANSLATION OF OLD VOLUME
*                                      ENTRY REQUESTS                */
Z009XVAL L     @15,@CV00039                                        0307
         BALR  @14,@15                                             0307
*   CCAGVNC=OFF;                    /* ASSUME COMPLETE               */
*   CCAGVNF=OFF;                    /* ASSUME FOUND                  */
         NI    CCAGVNC(R11),B'11001111'                            0309
*   IF CCAGVEXT^=0 THEN             /* CHECK WHETHER EXT GIVEN       */
         ICM   @10,7,CCAGVEXT(R11)                                 0310
         BZ    @RF00310                                            0310
*     DO;                           /* SET UP FOR GETREC             */
*       CCASRID=CCAGVEXT;           /* INITLZ EXTESION CI NO.        */
         MVC   CCASRID(3,R11),CCAGVEXT(R11)                        0312
*     END;                          /* END SET UP FOR GETREC         */
*   ELSE                            /* NO EXTENSION GIVEN            */
*     DO;                           /* SET UP FOR GETREC             */
         B     @RC00310                                            0314
@RF00310 DS    0H                                                  0315
*       CCAURAB=CCARABB;            /* GET BASE RAB                  */
         L     @10,CCARABB(,R11)                                   0315
         ST    @10,CCAURAB(,R11)                                   0315
*       CCASRID=RCDCINO;            /* INITLZ BASE CI NO.            */
         L     @10,CCACPE1(,@10)                                   0316
         MVC   CCASRID(3,R11),RCDCINO(@10)                         0316
*     END;                          /* END SET UP FOR GETREC         */
*   CCAGVEX=OFF;                    /* EXIT INDICATOR OFF            */
@RC00310 NI    CCAGVEX(R11),B'11111011'                            0318
*   DO WHILE CCAGVEX=OFF;           /* PROCESS EXTENSION RCDS        */
         B     @DE00319                                            0319
@DL00319 DS    0H                                                  0320
*Z010GREC:                                                         0320
*     CALL IGGPGREC;                /* CALL GETREC                   */
Z010GREC BAL   @14,IGGPGREC                                        0320
*     IF CCAGVNBS=ON×               /* IF NO BUFFER SPACE OR         */
*         CCACD1^=RCS THEN          /* ERROR RETURN                  */
         TM    CCAGVNBS(R11),B'00001000'                           0321
         BO    @RT00321                                            0321
         CLI   CCACD1(R11),0                                       0321
         BE    @RF00321                                            0321
@RT00321 DS    0H                                                  0322
*       CCAGVEX=ON;                 /* EXIT INDICATOR                */
         OI    CCAGVEX(R11),B'00000100'                            0322
*     ELSE                          /* FOUND BUFFER FOR RCD          */
*       DO;                         /* LOCATE VALUE                  */
         B     @RC00321                                            0323
@RF00321 DS    0H                                                  0324
*Z011LVAL:                                                         0324
*         CALL IGGPLVAL;            /* CALL LOCVAL                   */
Z011LVAL BAL   @14,IGGPLVAL                                        0324
*         IF CCAGVNF=ON THEN        /* SEE IF NOT FOUND VALUE        */
         TM    CCAGVNF(R11),B'00010000'                            0325
         BNO   @RF00325                                            0325
*           CCAGVEX=ON;             /* EXIT INDICATOR ON             */
         OI    CCAGVEX(R11),B'00000100'                            0326
*         ELSE                      /* FOUND SOMTHING                */
*           IF CCAILNG^=0 THEN      /* CHECK DATA LENGTH             */
         B     @RC00325                                            0327
@RF00325 SLR   @10,@10                                             0327
         C     @10,CCAILNG(,R11)                                   0327
         BE    @RF00327                                            0327
*             DO;                   /* VALUE FOUND                   */
*               CCAGVEX=ON;         /* EXIT INDICATOR ON             */
         OI    CCAGVEX(R11),B'00000100'                            0329
*               IF CCAGVEXT^=0 THEN /* CHECK IF EXTENSION EXISTS     */
         SLR   @05,@05                                             0330
         ICM   @05,7,CCAGVEXT(R11)                                 0330
         CR    @10,@05                                             0330
         BE    @RF00330                                            0330
*                 CCAGVNC=ON;       /* NOT COMPLETE                  */
         OI    CCAGVNC(R11),B'00100000'                            0331
*               ELSE                                               0332
*                 ;                 /* NO EXTENSION                  */
@RF00330 DS    0H                                                  0333
*             END;                  /* END VALUE FOUND               */
*           ELSE                    /* VALUE NOT FOUND               */
*             CCASRID=CCAGVEXT;     /* SET UP FOR GET RECORD         */
         B     @RC00327                                            0334
@RF00327 MVC   CCASRID(3,R11),CCAGVEXT(R11)                        0334
*       END;                        /* END LOCATE VALUE              */
@RC00327 DS    0H                                                  0335
@RC00325 DS    0H                                                  0336
*   END;                            /* END PROCESS                   */
@RC00321 DS    0H                                                  0336
@DE00319 TM    CCAGVEX(R11),B'00000100'                            0336
         BZ    @DL00319                                            0336
*   CALL EXIT;                      /* RETURN TO CALLER              */
         BAL   @14,EXIT                                            0337
*   GEN(DS 0F);                     /* FULLWORD BOUNDARY ALIGNMENT   */
         DS 0F
*   GEN(DC CL8'IGGPGREC');          /* NAME OF FOLLOWING PROCEDURE   */
         DC CL8'IGGPGREC'
*   END;                            /* END OF INNER PROCEDURE        */
@EL00004 DS    0H                                                  0340
@EF00004 DS    0H                                                  0340
@ER00004 BR    @14                                                 0340
@PB00004 DS    0H                                                  0341
*   GEN(EJECT);                     /* GO TO A NEW PRINT PAGE        */
         EJECT
*                                                                  0342
*/********************************************************************/
*/*                                                                  */
*/*        IGGPGREC  -  PROCEDURE  EXTERNALLY  CALLED  NESTED        */
*/*                                                                  */
*/********************************************************************/
*                                                                  0342
*IGGPGREC:                                                         0342
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);/* SPECIFY PROCEDURE OPTIONS     */
         B     @PB00005                                            0342
IGGPGREC DS    0H                                                  0343
*   GEN(ENTRY IGGPGREC );           /* IDENTIFY ENTRY-POINT SYMBOL   */
         ENTRY IGGPGREC
*Z012:                              /* LABEL FOR PROCEDURE TRACKING  */
*Z012GREC:                          /* LABEL FOR PROCEDURE TRACKING  */
*   RFY                                                            0344
*    (R5,                                                          0344
*     R6,                                                          0344
*     R7,                                                          0344
*     R8,                                                          0344
*     R9,                                                          0344
*     R10) UNRSTD;                  /* PL/S COMPILER WORK REGISTERS  */
Z012     DS    0H                                                  0344
Z012GREC DS    0H                                                  0345
*   RFY                                                            0345
*    (R2,                                                          0345
*     R3,                                                          0345
*     R4) RSTD;                     /* RESTRICT LOCAL WORK REGISTERS */
*   GEN(STM 12,14,12(13));          /* SAVE REGISTERS OF CALLER      */
         STM 12,14,12(13)
*   GEN(LA 13,12(13));              /* POINT TO NEXT SAVE AREA       */
         LA 13,12(13)
*   GEN(BALR 12,0);                 /* ESTABLISH ADDRESSABILITY      */
         BALR 12,0
*   GEN(LA 15,*-IGGSEGST(0,0));     /* COMPUTE MODULE BASE           */
         LA 15,*-IGGSEGST(0,0)
*   GEN(SR 12,15);                  /* SET BASE TO MODULE BASE       */
         SR 12,15
*/* PROCEDURE                                                        */
*/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
**   MODULE NAME =  IGGPGREC(IGG0CLBA)                                *
**                                                                    *
**   DESCRIPTIVE NAME =  GET CATALOG RECORD                           *
**                                                                    *
**   FUNCTION =                                                       *
**      THIS SUB-FUNCTION RETRIEVES A REQUESTED CATALOG RECORD BY     *
**      CONTROL INTERVAL (CI) NUMBER, PROVIDED THERE IS AN AVAILABLE  *
**      RECORD AREA. THE PROCESSING IS AS FOLLOWS:                    *
**      1. CHECK WHETHER THE REQUESTED RECORD IS ALREADY IN CORE.     *
**      2. FIND AN AVAILABLE RECORD AREA FOR THE RECORD TO BE READ:   *
**         A. IF THE BASE RECORD OR A HORIZONTAL EXTENSION OF THE     *
**            BASE RECORD IS TO BE USED, USE THE RECORD AREA POINTED  *
**            TO BY CCARABB.                                          *
**         B. OTHERWISE USE A RECORD AREA OTHER THAN THE ONE POINTED  *
**            TO BY CCARABB.                                          *
**      3. CALL IGGPPREC, IF THE RECORD AREA FOUND ALREADY CONTAINS   *
**         A CATALOG RECORD TO BE WRITTEN.                            *
**      4. CALL IGGPGET TO READ THE REQUESTED RECORD.                 *
**      5. CALL IGGPSMFG FOR SMF ALTER PROCESSING.                    *
**                                                                    *
**   INPUT =                                                          *
**      CCASRID - CONTROL INTERVAL (CI) NUMBER OF THE RECORD TO BE    *
**                READ.                                               *
**      CURRENT AVAILABLE RECORD AREAS.                               *
**                                                                    *
**   OUTPUT =                                                         *
**      CCAGVNBS - IF SET ON, AN AVAILABLE RECORD AREA WAS NOT FOUND. *
**      CCAURAB - RAB ADDRESS OF THE RECORD AREA CONTAINING THE       *
**                CATALOG RECORD READ.                                *
**      IF THE RECORD AREA CONTAINED A RECORD TO BE WRITTEN (I.E.     *
**      CCARBWR SET ON), THE RECORD AREA IS WRITTEN OUT, BEFORE BEING *
**      USED FOR THE READ.                                            *
**                                                                    *
**                                                                    *
** * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
*                                                                  0351
*   DCL                                                            0351
*     FREEID CHAR(1) CONSTANT('F'); /* FREE RECORD ID        @Y30SSRS*/
*   CCAEGREC=OFF;                   /* ASSUME RCD NOT IN-CORE        */
         NI    CCAEGREC(R11),B'11111110'                           0352
*   CCAURAB=CCARABF;                /* FIRST RECORD AREA BLOCK       */
         L     @10,CCARABF(,R11)                                   0353
         ST    @10,CCAURAB(,R11)                                   0353
*   R4=0;                           /* ZERO RAB PTR          @ZA32536*/
         SLR   R4,R4                                               0354
*   DO WHILE CCAURAB<=CCARABL&      /* SEE IF REQUESTED RECORD       */
*         CCAEGREC=OFF;             /* IS IN SOME RECORD AREA        */
         B     @DE00355                                            0355
@DL00355 DS    0H                                                  0356
*     IF CCACPE2^=0&                /* CHECK IF RECORD IS IN         */
*         RCDCINO=CCASRID&          /* SOME NON-EMPTY AREA AND       */
*         RCDID^=FREEID&            /* NOT FREE RCD AND      @Y30SSRS*/
*         CCARBUR=OFF&              /* AVAIL FOR USE AND             */
*         RCDKEYTY=LOWKEYTY THEN    /* NOT TRUE NAME ENTRY           */
         L     @10,CCAURAB(,R11)                                   0356
         L     @05,CCACPE2(,@10)                                   0356
         LTR   @05,@05                                             0356
         BZ    @RF00356                                            0356
         L     @05,CCACPE1(,@10)                                   0356
         CLC   RCDCINO(3,@05),CCASRID(R11)                         0356
         BNE   @RF00356                                            0356
         CLI   RCDID(@05),C'F'                                     0356
         BE    @RF00356                                            0356
         TM    CCARBUR(@10),B'10000000'                            0356
         BNZ   @RF00356                                            0356
         CLI   RCDKEYTY(@05),X'00'                                 0356
         BNE   @RF00356                                            0356
*       DO;                         /* FOUND RECORD                  */
*         CCAGVNBS=OFF;             /* INDICATE FOUND BUFFER         */
         NI    CCAGVNBS(R11),B'11110111'                           0358
*         CCAEGREC=ON;              /* INDICATE FOUND RECORD         */
         OI    CCAEGREC(R11),B'00000001'                           0359
*       END;                        /* END FOUND RECORD              */
*     ELSE                          /* NOT CORRECT RCD AREA          */
*       CCAURAB=CCAURAB+LENGTH(CCARAB);/* GET NEXT RAB PTR           */
         B     @RC00356                                            0361
@RF00356 LA    @10,20                                              0361
         AL    @10,CCAURAB(,R11)                                   0361
         ST    @10,CCAURAB(,R11)                                   0361
*   END;                            /* END SEARCH                    */
@RC00356 DS    0H                                                  0362
@DE00355 CLC   CCAURAB(4,R11),CCARABL(R11)                         0362
         BH    @DC00355                                            0362
         TM    CCAEGREC(R11),B'00000001'                           0362
         BZ    @DL00355                                            0362
@DC00355 DS    0H                                                  0363
*   IF CCAEGREC=OFF THEN            /* SEE IF RCD NOT IN-CORE        */
         TM    CCAEGREC(R11),B'00000001'                           0363
         BNZ   @RF00363                                            0363
*     DO;                           /* TRY TO GET RCD IN-CORE        */
*       CCAGVNBS=ON;                /* ASSUME NO BUFFER SPACE        */
         OI    CCAGVNBS(R11),B'00001000'                           0365
*       CCAURAB=CCARABB;            /* GET BASE RCD AREA             */
         L     @10,CCARABB(,R11)                                   0366
         ST    @10,CCAURAB(,R11)                                   0366
*       IF EXTGOCI=CCASRID          /* CHECK IF BASE EXTENSION       */
*           ×CCACBASE=CCASRID THEN                                 0367
         L     @10,CCACPE2(,@10)                                   0367
         CLC   EXTGOCI(3,@10),CCASRID(R11)                         0367
         BE    @RT00367                                            0367
         CLC   CCACBASE(3,R11),CCASRID(R11)                        0367
         BNE   @RF00367                                            0367
@RT00367 DS    0H                                                  0368
*         IF CCARBU1=OFF&           /* WITH BUFFER AVAILABLE         */
*             CCARBU2=OFF THEN      /* FOR USE                       */
         L     @10,CCAURAB(,R11)                                   0368
         TM    CCARBU1(@10),B'01100000'                            0368
         BNZ   @RF00368                                            0368
*           DO;                     /* BASE BUFFER AVAILABLE         */
*             CCAGVNBS=OFF;         /* INDICATE FOUND                */
         NI    CCAGVNBS(R11),B'11110111'                           0370
*           END;                    /* END BASE BUFFER AVAIL         */
*         ELSE                                                     0372
*           ;                       /* NO BUFFER AVAILABLE           */
@RF00368 DS    0H                                                  0373
*       ELSE                        /* NOT BASE EXTENSION            */
*         DO;                       /* CHECK FOR FREE BUFFER         */
         B     @RC00367                                            0373
@RF00367 DS    0H                                                  0374
*           IF CCAEXT=OFF&CCAMOD=OFF THEN/* IF LOC OR UPD            */
         TM    CCAEXT(R11),B'00000011'                             0374
         BNZ   @RF00374                                            0374
*             DO;                   /* FIND UNUSED BUFFER            */
*               CCAURAB=CCARABF;    /* GET FIRST RCD AREA PTR        */
         L     @10,CCARABF(,R11)                                   0376
         ST    @10,CCAURAB(,R11)                                   0376
*               DO WHILE CCAURAB<=CCARABL&/* SEE IF THERE IS FREE    */
*                     CCAEGREC=OFF; /* BUFFER AVAILABLE              */
         B     @DE00377                                            0377
@DL00377 DS    0H                                                  0378
*                 IF CCARBUR=OFF&   /* SEE IF THIS NON-BASE          */
*                     CCARBU1=OFF&  /* BUFFER IS AVAILABLE FOR       */
*                     CCAURAB^=CCARABB&/* USE AND NOT USED           */
*                     RCDCINO=0&    /* PREVIOUSLY                    */
*                     CCARBU2=OFF THEN                             0378
         L     @10,CCAURAB(,R11)                                   0378
         TM    CCARBUR(@10),B'11000000'                            0378
         BNZ   @RF00378                                            0378
         C     @10,CCARABB(,R11)                                   0378
         BE    @RF00378                                            0378
         L     @05,CCACPE1(,@10)                                   0378
         L     @05,RCDCINO-1(,@05)                                 0378
         LA    @05,0(,@05)                                         0378
         LTR   @05,@05                                             0378
         BNZ   @RF00378                                            0378
         TM    CCARBU2(@10),B'00100000'                            0378
         BNZ   @RF00378                                            0378
*                   DO;             /* BUFFER AVAIL                  */
*                     CCAGVNBS=OFF; /* INDICATE FOUND                */
         NI    CCAGVNBS(R11),B'11110111'                           0380
*                     CCAEGREC=ON;  /* INDICATE FOUND                */
         OI    CCAEGREC(R11),B'00000001'                           0381
*                   END;            /* END BUFFER AVAIL              */
*                 ELSE              /* UNAVAILABLE                   */
*                   CCAURAB=CCAURAB+LENGTH(CCARAB);/* GET NEXT RAB   */
         B     @RC00378                                            0383
@RF00378 LA    @10,20                                              0383
         AL    @10,CCAURAB(,R11)                                   0383
         ST    @10,CCAURAB(,R11)                                   0383
*               END;                /* END SEARCH                    */
@RC00378 DS    0H                                                  0384
@DE00377 CLC   CCAURAB(4,R11),CCARABL(R11)                         0384
         BH    @DC00377                                            0384
         TM    CCAEGREC(R11),B'00000001'                           0384
         BZ    @DL00377                                            0384
@DC00377 DS    0H                                                  0385
*             END;                  /* END FIND                      */
*           ELSE                    /* MODIFY OR EXTRACT             */
*             CCAURAB=CCARABL+LENGTH(CCARAB);/* SET UP FOR SCAN      */
         B     @RC00374                                            0386
@RF00374 LA    @10,20                                              0386
         AL    @10,CCARABL(,R11)                                   0386
         ST    @10,CCAURAB(,R11)                                   0386
*           DO WHILE CCAURAB-LENGTH(CCARAB)>=CCARABF&/* SEE IF THERE
*                                      IS A FREE             @ZA05943*/
*                 CCAEGREC=OFF;     /* BUFFER AVAILABLE              */
@RC00374 B     @DE00387                                            0387
@DL00387 DS    0H                                                  0388
*             CCAURAB=CCAURAB-LENGTH(CCARAB);/* GET NEXT RAB         */
         L     @10,CCAURAB(,R11)                                   0388
         SL    @10,@CF00042                                        0388
         ST    @10,CCAURAB(,R11)                                   0388
*             IF CCARBUR=OFF&       /* SEE IF THIS NON-BASE          */
*                 CCARBU1=OFF&      /* BUFFER IS AVAILABLE FOR       */
*                 CCAURAB^=CCARABB& /* USE                           */
*                 CCARBU2=OFF THEN                                 0389
         TM    CCARBUR(@10),B'11000000'                            0389
         BNZ   @RF00389                                            0389
         C     @10,CCARABB(,R11)                                   0389
         BE    @RF00389                                            0389
         TM    CCARBU2(@10),B'00100000'                            0389
         BNZ   @RF00389                                            0389
*               DO;                 /* BUFFER AVAIL                  */
*                 IF CCACPE2=0×     /* RECORD AREA EMPTY     @ZA32536*/
*                     (CCACPE2^=0&RCDCINO^=CCASVCI1) THEN/* NOT LAST
*                                      USED RA               @ZA32536*/
         SLR   @05,@05                                             0391
         L     @15,CCACPE2(,@10)                                   0391
         CR    @15,@05                                             0391
         BE    @RT00391                                            0391
         CR    @15,@05                                             0391
         BE    @RF00391                                            0391
         L     @10,CCACPE1(,@10)                                   0391
         CLC   RCDCINO(3,@10),CCASVCI1(R11)                        0391
         BE    @RF00391                                            0391
@RT00391 DS    0H                                                  0392
*                   DO;             /* USE THIS RA           @ZA32536*/
*                     CCAGVNBS=OFF; /* INDICATE FOUND                */
         NI    CCAGVNBS(R11),B'11110111'                           0393
*                     CCAEGREC=ON;  /* INDICATE FOUND                */
         OI    CCAEGREC(R11),B'00000001'                           0394
*                   END;                                           0395
*                 ELSE              /* LAST UPDATED RA       @ZA32536*/
*                   R4=CCAURAB;     /* SAVE RAB PTR          @ZA32536*/
         B     @RC00391                                            0396
@RF00391 L     R4,CCAURAB(,R11)                                    0396
*               END;                /* END BUFFER AVAIL              */
*             ELSE                                                 0398
*               ;                   /* UNAVAILABLE                   */
@RF00389 DS    0H                                                  0399
*           END;                    /* END SEARCH                    */
@RC00389 DS    0H                                                  0399
@DE00387 L     @10,CCAURAB(,R11)                                   0399
         SL    @10,@CF00042                                        0399
         C     @10,CCARABF(,R11)                                   0399
         BL    @DC00387                                            0399
         TM    CCAEGREC(R11),B'00000001'                           0399
         BZ    @DL00387                                            0399
@DC00387 DS    0H                                                  0400
*         END;                      /* END CHECK                     */
*       IF CCAGVNBS=OFF×R4^=0 THEN  /* IF FOUND BUFFER       @ZA32536*/
@RC00367 TM    CCAGVNBS(R11),B'00001000'                           0401
         BZ    @RT00401                                            0401
         LTR   R4,R4                                               0401
         BZ    @RF00401                                            0401
@RT00401 DS    0H                                                  0402
*         DO;                       /* PROCESS FOUND BUFFER          */
*           IF CCAGVNBS=ON THEN     /* BUFFER FOUND WAS LAST UPDATED
*                                      BUFFER                @ZA32536*/
         TM    CCAGVNBS(R11),B'00001000'                           0403
         BNO   @RF00403                                            0403
*             DO;                   /* USE THIS BUFFER       @ZA32536*/
*               CCAURAB=R4;         /* SET BUFFER ADDR       @ZA32536*/
         ST    R4,CCAURAB(,R11)                                    0405
*               CCAGVNBS=OFF;       /* INDICATE FOUND        @ZA32536*/
         NI    CCAGVNBS(R11),B'11110111'                           0406
*               CCAEGREC=ON;        /* INDICATE FOUND        @ZA32536*/
         OI    CCAEGREC(R11),B'00000001'                           0407
*             END;                                                 0408
*           ELSE                                                   0409
*             ;                     /* BUFFER FOUND WAS NOT THE LAST
*                                      UPDATED               @ZA32536*/
@RF00403 DS    0H                                                  0410
*           IF CCARBWR=ON THEN      /* SEE IF BUFFER MUST BE         */
         L     @10,CCAURAB(,R11)                                   0410
         TM    CCARBWR(@10),B'00010000'                            0410
         BNO   @RF00410                                            0410
*             DO;                   /* WRITE BUFFER OUT              */
*               CCASVCI1=CCASRID;   /* SAVE GET CI                   */
*                                                                  0412
         MVC   CCASVCI1(3,R11),CCASRID(R11)                        0412
*               /*****************************************************/
*               /*                                                   */
*               /* CALL TO MODULE IGG0CLAW                           */
*               /*                                                   */
*               /*****************************************************/
*                                                                  0413
*Z013PREC:                                                         0413
*               CALL IGGPPREC;      /* CALL PUT CI                   */
Z013PREC L     @15,@CV00038                                        0413
         BALR  @14,@15                                             0413
*               CCASRID=CCASVCI1;   /* RESTORE GET CI                */
         MVC   CCASRID(3,R11),CCASVCI1(R11)                        0414
*             END;                  /* END WRITE BUFFER OUT          */
*           ELSE                                                   0416
*             ;                     /* BUFFER NEED NOT BE WRITTEN OUT*/
@RF00410 DS    0H                                                  0417
*           DO;                                                    0417
*             CCAF1KEY=OFF;         /* GET BY CI NO.                 */
*             CCAF1KGE=OFF;         /* NOT GET NEXT                  */
*             CCAF1UP=ON;           /* GET FOR UPD                   */
*                                                                  0420
         OI    CCAF1UP(R11),B'00000010'                            0420
         NI    CCAF1KEY(R11),B'11100111'                           0420
*             /*******************************************************/
*             /*                                                     */
*             /* CALL TO MODULE IGG0CLBI                             */
*             /*                                                     */
*             /*******************************************************/
*                                                                  0421
*Z015GET:                                                          0421
*             CALL IGGPGET;         /* GET RECORD                    */
Z015GET  L     @15,@CV00037                                        0421
         BALR  @14,@15                                             0421
*           END;                    /* CALL GET CI                   */
*           CCASVCI1=RCDCINO;       /* SAVE LAST GOTTEN CI   @ZA32536*/
*                                                                  0423
         L     @10,CCAURAB(,R11)                                   0423
         L     @10,CCACPE1(,@10)                                   0423
         MVC   CCASVCI1(3,R11),RCDCINO(@10)                        0423
*           /*********************************************************/
*           /*                                                       */
*           /* CALL TO MODULE IGG0CLB3                               */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0424
*Z016SMFG:                                                         0424
*           CALL IGGPSMFG;          /* SMF GET FOR ALTER             */
Z016SMFG L     @15,@CV00036                                        0424
         BALR  @14,@15                                             0424
*         END;                      /* END PROCESS FOUND BUFFER      */
*       ELSE                                                       0426
*         ;                         /* NO BUFFER SPACE               */
@RF00401 DS    0H                                                  0427
*     END;                          /* END TRY                       */
*   ELSE                                                           0428
*     ;                             /* RECORD IN-CORE                */
@RF00363 DS    0H                                                  0429
*   CALL EXIT;                      /* RETURN TO CALLER              */
         BAL   @14,EXIT                                            0429
*   GEN(DS 0F);                     /* FULLWORD BOUNDARY ALIGNMENT   */
         DS 0F
*   GEN(DC CL8'IGGPLVAL');          /* NAME OF FOLLOWING PROCEDURE   */
         DC CL8'IGGPLVAL'
*   END;                            /* END OF INNER PROCEDURE        */
@EL00005 DS    0H                                                  0432
@EF00005 DS    0H                                                  0432
@ER00005 BR    @14                                                 0432
@PB00005 DS    0H                                                  0433
*   GEN(EJECT);                     /* GO TO A NEW PRINT PAGE        */
         EJECT
*                                                                  0434
*/********************************************************************/
*/*                                                                  */
*/*        IGGPLVAL  -  PROCEDURE  INTERNALLY  CALLED  NESTED        */
*/*                                                                  */
*/********************************************************************/
*                                                                  0434
*IGGPLVAL:                                                         0434
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);/* SPECIFY PROCEDURE OPTIONS     */
         B     @PB00006                                            0434
IGGPLVAL DS    0H                                                  0435
*Z017:                              /* LABEL FOR PROCEDURE TRACKING  */
*Z017LVAL:                          /* LABEL FOR PROCEDURE TRACKING  */
*   RFY                                                            0435
*    (R5,                                                          0435
*     R6,                                                          0435
*     R7,                                                          0435
*     R8,                                                          0435
*     R9,                                                          0435
*     R10) UNRSTD;                  /* PL/S COMPILER WORK REGISTERS  */
Z017     DS    0H                                                  0435
Z017LVAL DS    0H                                                  0436
*   RFY                                                            0436
*    (R2,                                                          0436
*     R3,                                                          0436
*     R4) RSTD;                     /* RESTRICT LOCAL WORK REGISTERS */
*   GEN(STM 12,14,12(13));          /* SAVE REGISTERS OF CALLER      */
         STM 12,14,12(13)
*   GEN(LA 13,12(13));              /* POINT TO NEXT SAVE AREA     0438
*                                      PROCEDURE                     */
         LA 13,12(13)
*/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
**   MODULE NAME =  IGGPLVAL(IGG0CLBA)                                *
**                                                                    *
**   DESCRIPTIVE NAME =  LOCATE FIELD VALUE                           *
**                                                                    *
**   FUNCTION =                                                       *
**      THIS SUB-FUNCTION LOCATES A NON-REPEATING OR REPEATING FIXED  *
**      LENGTH OR VARIABLE LENGTH CATALOG FIELD WITHIN A GIVEN        *
**      PHYSICAL RECORD AND IN A PARTICULAR OCCURRENCE.  IF THERE ARE *
**      NO MORE OCCURRENCES TO BE FOUND, A NOT FOUND INDICATOR IS     *
**      SET. OTHERWISE, AN EXTENSION POINTER TO THE ACTUAL DATA IS    *
**      PASSED BACK (INDICATING THE NECESSARY PHYSICAL RECORD MUST    *
**      BE READ IN) OR THE REQUESTED FIELD DATA IS RETURNED.  IF A    *
**      VARIABLE LENGTH FIELD IS CONTINUED INTO ANOTHER PHYSICAL      *
**      RECORD, THE CI NUMBER OF THIS RECORD IS ALSO RETURNED.  THE   *
**      PROCESSING IS AS FOLLOWS:                                     *
**      1. IF THE FIELD IS NON-REPEATING, CALL IGGPCKLC TO INSURE THE *
**         FIELD IS EXISTENT. IF CONTROL IS RETURNED, LOCATE THE      *
**         REQUESTED CATALOG FIELD.                                   *
**      2. OTHERWISE, SCAN THE GROUP OCCURRENCE POINTERS FOR THE      *
**         PARTICULAR OCCURRENCE SEQUENCE NUMBER (DELETED OCCURRENCE  *
**         SEQUENCE NUMBERS ARE SKIPPED).                             *
**         A. IF THERE ARE NO MORE OCCURRENCES, SET THE NOT FOUND     *
**            INDICATOR.                                              *
**         B. IF THE FIELD IS RELREPNO, PASS THE UPDATED OCCURRENCE   *
**            SEQUENCE NUMBER.                                        *
**         C. IF THE OCCURRENCE POINTER POINTS TO ANOTHER PHYSICAL    *
**            RECORD, PASS BACK ITS CI NUMBER.                        *
**         D. OTHERWISE, CALL IGGPCKLC TO INSURE THE FIELD IS         *
**            EXISTENT. IF CONTROL IS RETURNED, LOCATE THE REQUESTED  *
**            FIELD.                                                  *
**                                                                    *
**   INPUT =                                                          *
**      CCALREL - SEQUENCE NUMBER OF OCCURRENCE CONTAINING REQUESTED  *
**                FIELD.                                              *
**      CCADICT - DICTIONARY INFORMATION FOR REQUESTED FIELD (MUST BE *
**                NON-COMBINATION FIELD. THE ONLY SPECIAL FIELD       *
**                ALLOWED IS RELREPNO).                               *
**      CCAURAB - RAB ADDRESS OF RECORD AREA TO BE PROCESSED BY THIS  *
**                ROUTINE.                                            *
**                                                                    *
**   OUTPUT =                                                         *
**      CCAGVNF - IF SET ON, THERE ARE NO MORE OCCURRENCES TO BE      *
**                FOUND.                                              *
**      CCAGVNE - IF SET ON, THE REQUESTED FIELD DOES NOT EXIST IN THE*
**                ENTRY OR OCCURRENCE FOUND.                          *
**      CCAGVEXT - IF NON-ZERO, CONTAINS THE CI NUMBER OF A PHYSICAL  *
**                 RECORD TO BE READ, WHICH CONTAINS THE ACTUAL GROUP *
**                 DATA (CCAILNG = 0), OR CONTAINS THE CI NUMBER OF A *
**                 VARIABLE LENGTH FIELD (CCAILNG NOT = 0).           *
**      CCACPE5 - ADDRESS OF GROUP OCCURRENCE POINTER.                *
**      CCACPE6 - ADDRESS OF GROUP OCCURRENCE CONTAINING THE FIELD.   *
**      CCACPE7 - ADDRESS OF THE REQUESTED CATALOG FIELD.             *
**      CCAILNG - LENGTH OF THE REQUESTED CATALOG FIELD.              *
**      CCALREL - UPDATED SEQUENCE NUMBER OF THE OCCURRENCE RETRIEVED.*
**                                                                    *
**                                                                    *
** * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
*                                                                  0439
*   CCAGVNE=OFF;                    /* ASSUME EXISTENT               */
         NI    CCAGVNE(R11),B'11111101'                            0439
*   CCAGVEXT=0;                     /* ASSUME NO EXTENSION           */
         SLR   @10,@10                                             0440
         STCM  @10,7,CCAGVEXT(R11)                                 0440
*   IF DIC2REP=OFF THEN             /* CHECK IF NON-REPEATING        */
         TM    DIC2REP+372(R11),B'01000000'                        0441
         BNZ   @RF00441                                            0441
*     DO;                           /* PROCESS NON-REPEATING         */
*       CCAGVNF=OFF;                /* FOUND VALUE                   */
         NI    CCAGVNF(R11),B'11101111'                            0443
*       CCACPE5=CCACPE1;            /* BEGIN NON-REP FIELDS          */
         L     @10,CCAURAB(,R11)                                   0444
         L     @10,CCACPE1(,@10)                                   0444
         ST    @10,CCACPE5(,R11)                                   0444
*       CCACPE6=ADDR(NREPCV);       /* GET ADDR OF CONTROL INFO      */
         LA    @10,NREPCV(,@10)                                    0445
         ST    @10,CCACPE6(,R11)                                   0445
*Z018CKLC:                                                         0446
*       CALL IGGPCKLC;              /* CALL CHECK LENGTH COUNT       */
Z018CKLC BAL   @14,IGGPCKLC                                        0446
*       IF DIC2VAR=ON THEN          /* IF VARIABLE LENGTH            */
         TM    DIC2VAR+372(R11),B'10000000'                        0447
         BNO   @RF00447                                            0447
*         DO;                       /* PROCESS VAR LENGTH FIELD      */
*           CCACPE7=NREPLF+CCACPE1; /* POINT TO FIRST VAR FIELD      */
         L     @10,CCAURAB(,R11)                                   0449
         L     @10,CCACPE1(,@10)                                   0449
         SLR   @05,@05                                             0449
         IC    @05,NREPLF(,@10)                                    0449
         ALR   @05,@10                                             0449
         ST    @05,CCACPE7(,R11)                                   0449
*           DO CCAGVCT=2 TO DIC2LC; /* SKIP TO FIELD                 */
         LA    @10,2                                               0450
         B     @DE00450                                            0450
@DL00450 DS    0H                                                  0451
*             CCACPE7=VARLEN+CCACPE7+LENGTH(VARLEN);/* GET NEXT FIELD
*                                                            @Y30SSRS*/
         L     @10,CCACPE7(,R11)                                   0451
         ICM   @05,12,VARLEN(@10)                                  0451
         SRA   @05,16                                              0451
         ALR   @05,@10                                             0451
         AL    @05,@CF00067                                        0451
         ST    @05,CCACPE7(,R11)                                   0451
*           END;                    /* END SKIP                      */
         LA    @10,1                                               0452
         AH    @10,CCAGVCT(,R11)                                   0452
@DE00450 STH   @10,CCAGVCT(,R11)                                   0452
         SLR   @05,@05                                             0452
         IC    @05,DIC2LC+372(,R11)                                0452
         CR    @10,@05                                             0452
         BNH   @DL00450                                            0452
*           CCAILNG=VARLEN+LENGTH(VARLEN);/* SET LENGTH      @Y30SSRS*/
         L     @10,CCACPE7(,R11)                                   0453
         LA    @05,2                                               0453
         ICM   @10,12,VARLEN(@10)                                  0453
         SRA   @10,16                                              0453
         ALR   @05,@10                                             0453
         ST    @05,CCAILNG(,R11)                                   0453
*         END;                      /* END PROCESS                   */
*       ELSE                        /* FIXED LENGTH FIELD            */
*         DO;                       /* PROCESS FIXED LEN FIELD       */
         B     @RC00447                                            0455
@RF00447 DS    0H                                                  0456
*           CCACPE7=CCACPE1+DIC2ST; /* POINT TO FIXED VALUE          */
         L     @10,CCAURAB(,R11)                                   0456
         LA    @05,372                                             0456
         ALR   @05,R11                                             0456
         SLR   @15,@15                                             0456
         IC    @15,DIC2ST(,@05)                                    0456
         AL    @15,CCACPE1(,@10)                                   0456
         ST    @15,CCACPE7(,R11)                                   0456
*           CCAILNG=DIC2LC;         /* SET FIXED LENGTH              */
         SLR   @10,@10                                             0457
         IC    @10,DIC2LC(,@05)                                    0457
         ST    @10,CCAILNG(,R11)                                   0457
*         END;                      /* END PROCESS FIXED LEN FLD     */
*     END;                          /* END PROCESS NON-REPEATING     */
*   ELSE                            /* REPEATING FIELD               */
*     DO;                           /* PROCESS REPEATING             */
         B     @RC00441                                            0460
@RF00441 DS    0H                                                  0461
*       CCAGVNF=ON;                 /* ASSUME NOT FOUND RELREPNO     */
         OI    CCAGVNF(R11),B'00010000'                            0461
*       CCACPE5=ADDR(REPGOPT);      /* GET FIRST GOP                 */
         L     @10,CCAURAB(,R11)                                   0462
         L     @10,CCACPE2(,@10)                                   0462
         LA    @10,REPGOPT(,@10)                                   0462
         ST    @10,CCACPE5(,R11)                                   0462
*       DO CCAGVCT=1 TO REPCNT      /* SCAN GROUP OCCURRENCE         */
*             WHILE CCAGVNF=ON;     /* POINTERS FOR RELREPNO         */
         LA    @10,1                                               0463
         B     @DE00463                                            0463
@DL00463 TM    CCAGVNF(R11),B'00010000'                            0463
         BNO   @DC00463                                            0463
*         CCASN=0;                  /* ZERO SEQUENCE NO.             */
*                                                                  0464
         SLR   @10,@10                                             0464
         STH   @10,CCASN(,R11)                                     0464
*         /***********************************************************/
*         /*                                                         */
*         /* GET SEQUENCE NUMBER OF ONE OR TWO BYTES                 */
*         /*                                                         */
*         /***********************************************************/
*                                                                  0465
*         CCASN1(LENGTH(CCASN)+1-CCASL:LENGTH(CCASN))=CATSN(1:CCASL);
         LA    @10,3                                               0465
         SH    @10,CCASL(,R11)                                     0465
         ST    @10,@TF00001                                        0465
         ALR   @10,R11                                             0465
         LA    @05,2                                               0465
         SL    @05,@TF00001                                        0465
         L     @15,CCACPE5(,R11)                                   0465
         EX    @05,@SM02795                                        0465
*         IF DIC2GC=(CATGOGC1&TRUEGC)&/* CHECK FOR EQ GROUP CODE     */
*             CCALREL=CCASN THEN    /* AND EQ RELREPNO               */
         LA    @10,63                                              0466
         SLR   @05,@05                                             0466
         IC    @05,CATGOGC1(,@15)                                  0466
         NR    @10,@05                                             0466
         SLR   @05,@05                                             0466
         IC    @05,DIC2GC+372(,R11)                                0466
         CR    @10,@05                                             0466
         BNE   @RF00466                                            0466
         CLC   CCALREL(2,R11),CCASN(R11)                           0466
         BNE   @RF00466                                            0466
*           IF CATGODEL=OFF THEN    /* IF NOT DELETED GOP            */
         TM    CATGODEL(@15),B'01000000'                           0467
         BNZ   @RF00467                                            0467
*             CCAGVNF=OFF;          /* FOUND IT INDICATOR            */
         NI    CCAGVNF(R11),B'11101111'                            0468
*           ELSE                    /* DELETED GOP                   */
*             DO;                   /* SKIP GOP                      */
         B     @RC00467                                            0469
@RF00467 DS    0H                                                  0470
*               CCALREL=CCALREL+1;  /* SKIP DELETED GOP              */
         LA    @10,1                                               0470
         AH    @10,CCALREL(,R11)                                   0470
         STH   @10,CCALREL(,R11)                                   0470
*               CCACPE5=CCACPE5+CCAGOPLN;/* GET NEXT GOP             */
         LH    @10,CCAGOPLN(,R11)                                  0471
         AL    @10,CCACPE5(,R11)                                   0471
         ST    @10,CCACPE5(,R11)                                   0471
*             END;                  /* END SKIP GOP                  */
*         ELSE                      /* NOT CORRECT POINTER           */
*           CCACPE5=CCACPE5+CCAGOPLN;/* GET NEXT GOP                 */
         B     @RC00466                                            0473
@RF00466 LH    @10,CCAGOPLN(,R11)                                  0473
         AL    @10,CCACPE5(,R11)                                   0473
         ST    @10,CCACPE5(,R11)                                   0473
*       END;                        /* END SCAN                      */
@RC00466 LA    @10,1                                               0474
         AH    @10,CCAGVCT(,R11)                                   0474
@DE00463 STH   @10,CCAGVCT(,R11)                                   0474
         L     @05,CCAURAB(,R11)                                   0474
         L     @05,CCACPE2(,@05)                                   0474
         SLR   @15,@15                                             0474
         IC    @15,REPCNT(,@05)                                    0474
         CR    @10,@15                                             0474
         BNH   @DL00463                                            0474
@DC00463 DS    0H                                                  0475
*       IF CCAGVNF=ON THEN          /* CHECK IF NOT FOUND            */
         TM    CCAGVNF(R11),B'00010000'                            0475
         BNO   @RF00475                                            0475
*         DO;                       /* PROCESS NOT FOUND             */
*           CCAGVEXT=EXTGOCI;       /* SET HORIZONTAL EXT PTR        */
         L     @10,CCAURAB(,R11)                                   0477
         L     @10,CCACPE2(,@10)                                   0477
         MVC   CCAGVEXT(3,R11),EXTGOCI(@10)                        0477
*           CCAILNG=0;              /* SET LENGTH                    */
         SLR   @10,@10                                             0478
         ST    @10,CCAILNG(,R11)                                   0478
*           IF CCAGVEXT^=0 THEN     /* CHECK FOR HORIZONTAL EXT      */
         SLR   @05,@05                                             0479
         ICM   @05,7,CCAGVEXT(R11)                                 0479
         CR    @10,@05                                             0479
         BE    @RF00479                                            0479
*             DO;                   /* SET OUTPUT                    */
*               CCAGVNF=OFF;        /* FURTHER PROCESSING OF EXT     */
         NI    CCAGVNF(R11),B'11101111'                            0481
*             END;                  /* END SET OUTPUT                */
*           ELSE                                                   0483
*             ;                     /* NO HORIZONTAL EXT             */
@RF00479 DS    0H                                                  0484
*         END;                      /* END PROCESS NOT FOUND         */
*       ELSE                        /* FOUND RELREPNO                */
*         IF DIC2FLGS=DTSRR THEN    /* CHECK FOR RELREPNO            */
         B     @RC00475                                            0485
@RF00475 LA    @10,372                                             0485
         ALR   @10,R11                                             0485
         CLI   DIC2FLGS(@10),X'60'                                 0485
         BNE   @RF00485                                            0485
*           DO;                     /* SET RELREPNO DATA INFO        */
*             CCACPE7=ADDR(CCALREL);/* SET ADDR OF 2-BYTE RELREPNO   */
         LA    @05,CCALREL(,R11)                                   0487
         ST    @05,CCACPE7(,R11)                                   0487
*             CCAILNG=DIC2LC;       /* SET LENGTH OF RELREPNO        */
         SLR   @05,@05                                             0488
         IC    @05,DIC2LC(,@10)                                    0488
         ST    @05,CCAILNG(,R11)                                   0488
*           END;                    /* END SET RELREPNO              */
*         ELSE                      /* NOT RELREPNO                  */
*           IF CATGOEXT=ON THEN     /* SEE IF VERTICAL EXT PTR       */
         B     @RC00485                                            0490
@RF00485 L     @10,CCACPE5(,R11)                                   0490
         TM    CATGOEXT(@10),B'10000000'                           0490
         BNO   @RF00490                                            0490
*             DO;                   /* INITLZ OUTPUT                 */
*               CCAILNG=0;          /* SET LENGTH OF DATA            */
         SLR   @05,@05                                             0492
         ST    @05,CCAILNG(,R11)                                   0492
*               CCAGVEXT=CATGOCI;   /* SET VERTICAL EXT PTR          */
         MVC   CCAGVEXT(3,R11),CATGOCI(@10)                        0493
*             END;                  /* END INITLZ OUTPUT             */
*           ELSE                    /* NO VERTCAL EXT PTR            */
*             DO;                   /* GET REPEATING INFO IN RCD     */
         B     @RC00490                                            0495
@RF00490 DS    0H                                                  0496
*               CCACPE6=CCACPE3+CATGODSP;/* SET OCCURRENCE PTR       */
         L     @10,CCAURAB(,R11)                                   0496
         L     @05,CCACPE5(,R11)                                   0496
         ICM   @05,12,CATGODSP(@05)                                0496
         SRA   @05,16                                              0496
         AL    @05,CCACPE3(,@10)                                   0496
         ST    @05,CCACPE6(,R11)                                   0496
*Z019CKLC:                                                         0497
*               CALL IGGPCKLC;      /* CHECK LENGTH COUNT            */
Z019CKLC BAL   @14,IGGPCKLC                                        0497
*               CCAGVEXT=EXTGOCI;   /* SET EXTENSION POINTER         */
         L     @10,CCAURAB(,R11)                                   0498
         L     @10,CCACPE2(,@10)                                   0498
         MVC   CCAGVEXT(3,R11),EXTGOCI(@10)                        0498
*               IF DIC2VAR=ON THEN  /* IF VARIABLE LENGTH            */
         TM    DIC2VAR+372(R11),B'10000000'                        0499
         BNO   @RF00499                                            0499
*                 DO;               /* PROCESS VARIABLE FIELD        */
*                   CCACPE7=LENFIX+CCACPE6;/* FIRST VAR FIELD        */
         L     @10,CCACPE6(,R11)                                   0501
         SLR   @05,@05                                             0501
         IC    @05,LENFIX(,@10)                                    0501
         ALR   @05,@10                                             0501
         ST    @05,CCACPE7(,R11)                                   0501
*                   DO CCAGVCT=2 TO DIC2LC;/* SKIP TO FIELD          */
         LA    @10,2                                               0502
         B     @DE00502                                            0502
@DL00502 DS    0H                                                  0503
*                     CCACPE7=VARLEN+CCACPE7+LENGTH(VARLEN);/* GET 0503
*                                      NEXT FIELD            @Y30SSRS*/
         L     @10,CCACPE7(,R11)                                   0503
         ICM   @05,12,VARLEN(@10)                                  0503
         SRA   @05,16                                              0503
         ALR   @05,@10                                             0503
         AL    @05,@CF00067                                        0503
         ST    @05,CCACPE7(,R11)                                   0503
*                   END;            /* END SKIP TO FIELD             */
         LA    @10,1                                               0504
         AH    @10,CCAGVCT(,R11)                                   0504
@DE00502 STH   @10,CCAGVCT(,R11)                                   0504
         SLR   @05,@05                                             0504
         IC    @05,DIC2LC+372(,R11)                                0504
         CR    @10,@05                                             0504
         BNH   @DL00502                                            0504
*                   CCAILNG=VARLEN+LENGTH(VARLEN);/* SET FIELD LENGTH
*                                                            @Y30SSRS*/
         L     @10,CCACPE7(,R11)                                   0505
         LA    @05,2                                               0505
         ICM   @10,12,VARLEN(@10)                                  0505
         SRA   @10,16                                              0505
         ALR   @05,@10                                             0505
         ST    @05,CCAILNG(,R11)                                   0505
*                 END;              /* END PROCESS VARIABLE FLD      */
*               ELSE                /* FIXED LENGTH FIELD            */
*                 DO;               /* PROCESS FIXED LENGTH FLD      */
         B     @RC00499                                            0507
@RF00499 DS    0H                                                  0508
*                   CCACPE7=CCACPE6+DIC2ST;/* SET ADDR               */
         LA    @10,372                                             0508
         ALR   @10,R11                                             0508
         SLR   @05,@05                                             0508
         IC    @05,DIC2ST(,@10)                                    0508
         AL    @05,CCACPE6(,R11)                                   0508
         ST    @05,CCACPE7(,R11)                                   0508
*                   CCAILNG=DIC2LC; /* SET LENGTH                    */
         SLR   @05,@05                                             0509
         IC    @05,DIC2LC(,@10)                                    0509
         ST    @05,CCAILNG(,R11)                                   0509
*                   CCAGVEXT=0;     /* DON'T RETURN                  */
         SLR   @10,@10                                             0510
         STCM  @10,7,CCAGVEXT(R11)                                 0510
*                 END;              /* END PROCESS                   */
*             END;                  /* END GET REPEATING INFO        */
@RC00499 DS    0H                                                  0513
*     END;                          /* END PROCESS REPEATING         */
@RC00490 DS    0H                                                  0513
@RC00485 DS    0H                                                  0513
@RC00475 DS    0H                                                  0514
*   CALL EXIT;                      /* RETURN TO CALLER              */
@RC00441 BAL   @14,EXIT                                            0514
*   GEN(DS 0F);                     /* FULLWORD BOUNDARY ALIGNMENT   */
         DS 0F
*   GEN(DC CL8'IGGPCKLC');          /* NAME OF FOLLOWING PROCEDURE   */
         DC CL8'IGGPCKLC'
*   END;                            /* END OF INNER PROCEDURE        */
@EL00006 DS    0H                                                  0517
@EF00006 DS    0H                                                  0517
@ER00006 BR    @14                                                 0517
@PB00006 DS    0H                                                  0518
*   GEN(EJECT);                     /* GO TO A NEW PRINT PAGE        */
         EJECT
*                                                                  0519
*/********************************************************************/
*/*                                                                  */
*/*        IGGPCKLC  -  PROCEDURE  INTERNALLY  CALLED  NESTED        */
*/*                                                                  */
*/********************************************************************/
*                                                                  0519
*IGGPCKLC:                                                         0519
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);/* SPECIFY PROCEDURE OPTIONS     */
         B     @PB00007                                            0519
IGGPCKLC DS    0H                                                  0520
*Z020:                              /* LABEL FOR PROCEDURE TRACKING  */
*Z020CKLC:                          /* LABEL FOR PROCEDURE TRACKING  */
*   RFY                                                            0520
*    (R5,                                                          0520
*     R6,                                                          0520
*     R7,                                                          0520
*     R8,                                                          0520
*     R9,                                                          0520
*     R10) UNRSTD;                  /* PL/S COMPILER WORK REGISTERS  */
Z020     DS    0H                                                  0520
Z020CKLC DS    0H                                                  0521
*   RFY                                                            0521
*    (R2,                                                          0521
*     R3,                                                          0521
*     R4) RSTD;                     /* RESTRICT LOCAL WORK REGISTERS */
*   GEN(STM 12,14,12(13));          /* SAVE REGISTERS OF CALLER      */
         STM 12,14,12(13)
*   GEN(LA 13,12(13));              /* POINT TO NEXT SAVE AREA       */
         LA 13,12(13)
*/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
**   MODULE NAME =  IGGPCKLC(IGG0CLBA)                                *
**                                                                    *
**   DESCRIPTIVE NAME =                                               *
**      CHECK LENGTH/COUNT OF CATALOG FIELD.                          *
**                                                                    *
**   FUNCTION =                                                       *
**      THIS SUB-FUNCTION INSURES THAT THE REQUESTED CATALOG FIELD    *
**      ACTUALLY EXISTS IN THE ENTRY AND IN THE OCCURRENCE BEING      *
**      PROCESSED.  THE PROCESSING IS AS FOLLOWS:                     *
**      1. CHECK THAT IF THE FIELD IS NON-REPEATING AND FIXED, IT IS  *
**         IN THE CORRECT VOLUME OR NON-VOLUME ENTRY.                 *
**      2. IF THE FIELD IS VARIABLE LENGTH, CHECK THAT THERE ARE A    *
**         SUFFICENT NUMBER OF VARIABLE LENGTH FIELDS.                *
**      3. OTHERWISE, CHECK THAT THE TOTAL LENGTH OF FIXED LENGTH     *
**         FIELDS IS SUFFICIENT.                                      *
**      NOTE:  IF THE FIELD IS NON-EXISTENT, CONTROL IS NOT RETURNED  *
**             TO THE CALLER IGGPLVAL, BUT TO IGGPGVAL.               *
**                                                                    *
**   INPUT =                                                          *
**      CCACPE6 - ADDRESS OF THE 2 BYTE CONTROL FIELD CONTAINING      *
**                THE COUNT OF VARIABLE FIELDS AND THE LENGTH OF ALL  *
**                FIXED LENGTH FIELDS.                                *
**      CCADICT - DICTIONARY INFORMATION OF THE FIELD TO BE CHECKED.  *
**                                                                    *
**   OUTPUT =                                                         *
**      CCAGVNE - SET ON, IF THE REQUESTED FIELD IS NON-EXISTENT. IN  *
**                THIS CASE:                                          *
**         CCAILNG IS SET TO 2, IF THE FIELD IS VARIABLE LENGTH.      *
**         OTHERWISE TO 1, IF FIXED LENGTH.                           *
**         CCACPE7 POINTS TO A 2 BYTE FIELD CONTAINING ZEROS, IF      *
**         THE FIELD IS VARIABLE LENGTH. OTHERWISE TO HEX FF, IF FIXED*
**         LENGTH.                                                    *
**                                                                    *
**                                                                    *
** * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
*                                                                  0524
*   DCL                                                            0524
*     VOLGC FIXED(31) CONSTANT(6);  /* VOLUME GROUP CODE LOW         */
*   DCL                                                            0525
*     CATGC FIXED(31) CONSTANT(4);  /* CATALOG GROUP CODE HI         */
*   DCL                                                            0526
*     NONRGC FIXED(31) CONSTANT(0); /* CATALOG NON REP GRP CODE      */
*   DCL                                                            0527
*     COMDATLN FIXED(31) CONSTANT(49);/* COMMON DATA LENGTH          */
*   DCL                                                            0528
*     ZLEN BIT(16) CONSTANT('0000'X),/* ZERO LENGTH                  */
*     NEI BIT(8) CONSTANT('FF'X);   /* NON-EXISTENT VALUE            */
*   CCAGVNE=OFF;                    /* ASSUME EXISTENT               */
         NI    CCAGVNE(R11),B'11111101'                            0529
*   IF(CCAGOPLN=VOLGOPLN&DIC2GC>=VOLGC)×/* IF VALID REQUEST          */
*       (CCAGOPLN=CATGOPLN&DIC2GC<=CATGC)×/* FOR VOLUME FIELD        */
*       (DIC2VAR=OFF&DIC2GC=NONRGC& /* OR CATALOG FIELD OR           */
*       DIC2ST<=COMDATLN) THEN                                     0530
         CLC   CCAGOPLN(2,R11),@CH00063                            0530
         BNE   @GL00030                                            0530
         CLI   DIC2GC+372(R11),6                                   0530
         BNL   @RT00530                                            0530
@GL00030 CLC   CCAGOPLN(2,R11),@CH00065                            0530
         BNE   @GL00029                                            0530
         CLI   DIC2GC+372(R11),4                                   0530
         BNH   @RT00530                                            0530
@GL00029 LA    @10,372                                             0530
         ALR   @10,R11                                             0530
         TM    DIC2VAR(@10),B'10000000'                            0530
         BNZ   @RF00530                                            0530
         CLI   DIC2GC(@10),0                                       0530
         BNE   @RF00530                                            0530
         CLI   DIC2ST(@10),49                                      0530
         BNH   @RT00530                                            0530
*     ;                             /* COMMON FIELD, EXISTENT        */
*   ELSE                            /* NON-EXISTENT                  */
*     CCAGVNE=ON;                   /* NON-EXISTENT FIELD            */
@RF00530 OI    CCAGVNE(R11),B'00000010'                            0532
*   IF DIC2VAR=ON THEN              /* CHECK IF VARIABLE FIELD       */
@RT00530 LA    @10,372                                             0533
         ALR   @10,R11                                             0533
         TM    DIC2VAR(@10),B'10000000'                            0533
         BNO   @RF00533                                            0533
*     IF DIC2LC<=CNTVAR&CCAGVNE=OFF THEN/* CHK VAR FIELD             */
         L     @05,CCACPE6(,R11)                                   0534
         CLC   DIC2LC(1,@10),CNTVAR(@05)                           0534
         BH    @RF00534                                            0534
         TM    CCAGVNE(R11),B'00000010'                            0534
         BNZ   @RF00534                                            0534
*       CALL EXIT;                  /* RETURN TO CALLER              */
         BAL   @14,EXIT                                            0535
*     ELSE                          /* VAR FIELD NOT THERE           */
*       DO;                         /* PROCESS NON-EXISTENT          */
         B     @RC00534                                            0536
@RF00534 DS    0H                                                  0537
*         CCAGVNE=ON;               /* NON-EXISTENT INDICATOR        */
         OI    CCAGVNE(R11),B'00000010'                            0537
*         CCAILNG=LENGTH(VARLEN);   /* INDICATE CONDITION            */
         MVC   CCAILNG(4,R11),@CF00067                             0538
*         CCANEVV=ZLEN;             /* INITLZ NON-EXISTENT VARIABLE
*                                      VALUE                         */
         MVC   CCANEVV(2,R11),@CB02757                             0539
*         CCAIDPT=ADDR(CCANEVV);    /* SET ADDR OF NON-EXISTENT VALUE*/
         LA    @10,CCANEVV(,R11)                                   0540
         ST    @10,CCAIDPT(,R11)                                   0540
*       END;                        /* END PROCESS                   */
*   ELSE                            /* FIXED LENGTH FIELD            */
*     IF DIC2ST<LENFIX&CCAGVNE=OFF THEN/* CHK FIXED FIELD            */
         B     @RC00533                                            0542
@RF00533 L     @10,CCACPE6(,R11)                                   0542
         CLC   DIC2ST+372(1,R11),LENFIX(@10)                       0542
         BNL   @RF00542                                            0542
         TM    CCAGVNE(R11),B'00000010'                            0542
         BNZ   @RF00542                                            0542
*       CALL EXIT;                  /* RETURN TO CALLER              */
         BAL   @14,EXIT                                            0543
*     ELSE                          /* FIELD NOT THERE               */
*       DO;                         /* PROCESS NON-EXISTENT          */
         B     @RC00542                                            0544
@RF00542 DS    0H                                                  0545
*         CCAGVNE=ON;               /* NON-EXISTENT INDICATOR        */
         OI    CCAGVNE(R11),B'00000010'                            0545
*         CCAILNG=DIC2LC;           /* INDICATE CONDITION            */
         SLR   @10,@10                                             0546
         IC    @10,DIC2LC+372(,R11)                                0546
         ST    @10,CCAILNG(,R11)                                   0546
*         CCANEFV=NEI;              /* INITLZ NON-EXISTENT FIXED   0547
*                                      VALUE                         */
         MVI   CCANEFV(R11),X'FF'                                  0547
*         CCAIDPT=ADDR(CCANEFV);    /* SET ADDR OF NON-EXISTENT VALUE*/
         LA    @10,CCANEFV(,R11)                                   0548
         ST    @10,CCAIDPT(,R11)                                   0548
*       END;                        /* END PROCESS                   */
*   GEN;                                                           0550
@RC00542 DS    0H                                                  0550
@RC00533 DS    0H                                                  0550
*                                       /* RESTORE REGS OF LOCVAL   */
*                                       /* CALLER                   */
         LM    R12,R14,0(R13)           RESTORE
*   CALL EXIT;                      /* RETURN TO CALLER              */
         BAL   @14,EXIT                                            0551
*   END;                            /* END OF INNER PROCEDURE        */
@EL00007 DS    0H                                                  0552
@EF00007 DS    0H                                                  0552
@ER00007 BR    @14                                                 0552
@PB00007 DS    0H                                                  0553
*   GEN(EJECT);                     /* GO TO A NEW PRINT PAGE        */
         EJECT
*                                                                  0554
*/********************************************************************/
*/*                                                                  */
*/*         RETURN-TO-CALLER  PROCEDURE-EXITING  SUBFUNCTION         */
*/*                                                                  */
*/********************************************************************/
*                                                                  0554
*EXIT:                                                             0554
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);/* SPECIFY PROCEDURE OPTIONS     */
         B     @PB00008                                            0554
EXIT     DS    0H                                                  0555
*   GEN(LM 12,14,0(13));            /* RESTORE REGISTERS OF CALLER   */
         LM 12,14,0(13)
*   GEN(MVI 12(13),255);            /* MARK END OF PDL               */
         MVI 12(13),255
*   GEN(BR 14);                     /* RETURN TO CALLER              */
         BR 14
*PATCH:                                                            0558
*   GEN(DC (12+((*+139-@MAINENT)/140))A(0));/* PATCH AREA            */
PATCH    DC (12+((*+139-@MAINENT)/140))A(0)
*   END;                            /* END OF EXIT PROCEDURE         */
@EL00008 DS    0H                                                  0559
@EF00008 DS    0H                                                  0559
@ER00008 BR    @14                                                 0559
*   END                             /* END PROCEDURE                 */
*                                                                  0560
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */
*/*%INCLUDE SYSLIB  (IGGMCDCL)                                       */
*/*%INCLUDE SYSLIB  (IGGMCTRC)                                       */
*/*%INCLUDE SYSLIB  (IGGCCA  )                                       */
*/*%INCLUDE SYSLIB  (IEZCTGPL)                                       */
*/*%INCLUDE SYSLIB  (IEZCTGFL)                                       */
*/*%INCLUDE SYSLIB  (CVT     )                                       */
*/*%INCLUDE SYSLIB  (IKJTCB  )                                       */
*/*%INCLUDE SYSLIB  (IHAPSA  )                                       */
*/*%INCLUDE SYSLIB  (IFGACB  )                                       */
*/*%INCLUDE SYSLIB  (AMCBS   )                                       */
*/*%INCLUDE SYSLIB  (IGGCAXWA)                                       */
*/*%INCLUDE SYSLIB  (IEZCTGFV)                                       */
*/*%INCLUDE SYSLIB  (IEZCTGWA)                                       */
*/*%INCLUDE SYSLIB  (IEZCTGVL)                                       */
*/*%INCLUDE SYSLIB  (IEZCTGCV)                                       */
*                                                                  0560
*       ;                                                          0560
@EL00001 DS    0H                                                  0560
@EF00001 DS    0H                                                  0560
@ER00001 BR    @14                                                 0560
@DATA    DS    0H
@CH00048 DC    H'1'
@CH00065 DC    H'5'
@CH00063 DC    H'6'
@SM02791 MVC   CCARBA(0,@14),INSERT4(@10)
@SM02795 MVC   CCASN1-1(0,@10),CATSN+4(@15)
@DATD    DSECT
         DS    0F
@TF00001 DS    F
IGG0CLBA CSECT
         DS    0F
@CF00067 DC    F'2'
@CF00044 DC    F'16'
@CF00042 DC    F'20'
@DATD    DSECT
         DS    0D
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA
@ENDDATD EQU   *
IGG0CLBA CSECT
         DS    0F
@SIZDATD DC    AL1(0)
         DC    AL3(@ENDDATD-@DATD)
@CV00036 DC    V(IGGPSMFG)
@CV00037 DC    V(IGGPGET)
@CV00038 DC    V(IGGPPREC)
@CV00039 DC    V(IGGPXVAL)
         DS    0D
@CB02757 DC    X'0000'
@00      EQU   00                      EQUATES FOR REGISTERS 0-15
@01      EQU   01
@02      EQU   02
@03      EQU   03
@04      EQU   04
@05      EQU   05
@06      EQU   06
@07      EQU   07
@08      EQU   08
@09      EQU   09
@10      EQU   10
@11      EQU   11
@12      EQU   12
@13      EQU   13
@14      EQU   14
@15      EQU   15
IGGSEGBR EQU   @12
RWA      EQU   @02
R2       EQU   @02
R3       EQU   @03
R4       EQU   @04
R5       EQU   @05
R6       EQU   @06
R7       EQU   @07
R8       EQU   @08
R9       EQU   @09
R10      EQU   @10
R11      EQU   @11
R12      EQU   @12
RET      EQU   @14
RFLD     EQU   @04
RGO      EQU   @15
RNDX     EQU   @03
RP0      EQU   @00
RP1      EQU   @01
RSAVE    EQU   @13
RWK1     EQU   @06
RWK2     EQU   @07
RWK3     EQU   @08
RWK4     EQU   @09
RZERO    EQU   @00
R0       EQU   @00
R1       EQU   @01
R13      EQU   @13
R14      EQU   @14
R15      EQU   @15
WKR2     EQU   @02
WKR3     EQU   @03
WKR4     EQU   @04
CVTPTR   EQU   16
PSA      EQU   0
FLCRNPSW EQU   PSA
FLCROPSW EQU   PSA+8
FLCICCW2 EQU   PSA+16
PSAEEPSW EQU   PSA+132
PSAESPSW EQU   PSA+136
FLCSVILC EQU   PSAESPSW+1
PSAEPPSW EQU   PSA+140
FLCPIILC EQU   PSAEPPSW+1
FLCPICOD EQU   PSAEPPSW+2
PSAPICOD EQU   FLCPICOD+1
FLCTEA   EQU   PSAEPPSW+4
FLCPER   EQU   PSA+152
FLCMCLA  EQU   PSA+168
FLCIOEL  EQU   FLCMCLA+4
FLCIOA   EQU   FLCMCLA+16
FLCFSA   EQU   FLCMCLA+80
PSASUPER EQU   PSA+552
PSASUP1  EQU   PSASUPER
PSASUP2  EQU   PSASUPER+1
PSASUP3  EQU   PSASUPER+2
PSASUP4  EQU   PSASUPER+3
PSACLHT  EQU   PSA+640
PSALKSA  EQU   PSA+696
PSAHLHI  EQU   PSA+760
PSADSSFL EQU   PSA+836
PSADSSF1 EQU   PSADSSFL
PSADSSF3 EQU   PSADSSFL+2
PSADSSF4 EQU   PSADSSFL+3
PSARSVT  EQU   PSA+896
USERD    EQU   0
IGGCCA   EQU   0
CCAPROB  EQU   IGGCCA+4
CCAERRCD EQU   CCAPROB+2
CCAREASN EQU   CCAERRCD
CCARETRN EQU   CCAERRCD+1
CCACD1   EQU   CCARETRN
CCAFLG1  EQU   IGGCCA+14
CCAF1KEY EQU   CCAFLG1
CCAF1KGE EQU   CCAFLG1
CCAF1UP  EQU   CCAFLG1
CCAFLG2  EQU   IGGCCA+15
CCAF2COB EQU   CCAFLG2
CCAFLG3  EQU   IGGCCA+16
CCALFT   EQU   CCAFLG3
CCAEGREC EQU   CCAFLG3
CCAFLG4  EQU   IGGCCA+17
CCAGVNC  EQU   CCAFLG4
CCAGVNF  EQU   CCAFLG4
CCAGVNBS EQU   CCAFLG4
CCAGVEX  EQU   CCAFLG4
CCAGVNE  EQU   CCAFLG4
CCATCOMP EQU   CCAFLG4
CCAFLG5  EQU   IGGCCA+18
CCATHIT  EQU   CCAFLG5
CCATEX   EQU   CCAFLG5
CCATEX1  EQU   CCAFLG5
CCATEX2  EQU   CCAFLG5
CCAFLG6  EQU   IGGCCA+19
CCASUPFD EQU   CCAFLG6
CCAEXT   EQU   CCAFLG6
CCAMOD   EQU   CCAFLG6
CCATCB   EQU   IGGCCA+20
CCARB    EQU   IGGCCA+24
CCACPL   EQU   IGGCCA+28
CCAACB   EQU   IGGCCA+32
CCAURAB  EQU   IGGCCA+40
CCASRCH  EQU   IGGCCA+44
CCASRID  EQU   CCASRCH
CCARAB0  EQU   IGGCCA+88
CCAR0FLG EQU   CCARAB0
CCAR0SEG EQU   CCARAB0+8
CCARAB1  EQU   IGGCCA+108
CCAR1FLG EQU   CCARAB1
CCAR1SEG EQU   CCARAB1+8
CCARAB2  EQU   IGGCCA+128
CCAR2FLG EQU   CCARAB2
CCAR2SEG EQU   CCARAB2+8
CCARAB3  EQU   IGGCCA+148
CCAR3FLG EQU   CCARAB3
CCAR3SEG EQU   CCARAB3+8
CCARAB4  EQU   IGGCCA+168
CCAR4FLG EQU   CCARAB4
CCAR4SEG EQU   CCARAB4+8
CCARAB5  EQU   IGGCCA+188
CCAR5FLG EQU   CCARAB5
CCAR5SEG EQU   CCARAB5+8
CCATIQRN EQU   IGGCCA+212
CCADESA  EQU   IGGCCA+224
CCAEXTDE EQU   CCADESA+4
CCAEXTAD EQU   CCAEXTDE+2
CCAEQDQ  EQU   IGGCCA+280
CCAEDOPT EQU   CCAEQDQ+2
CCAMSSPL EQU   IGGCCA+300
CCACMS   EQU   IGGCCA+316
CCACPE5  EQU   IGGCCA+324
CCACPE6  EQU   IGGCCA+340
CCACPE61 EQU   IGGCCA+344
CCACPE7  EQU   IGGCCA+348
CCAIDPT  EQU   CCACPE7
CCAGOPLN EQU   IGGCCA+356
CCASL    EQU   IGGCCA+358
CCAILNG  EQU   IGGCCA+360
CCAFLPT  EQU   IGGCCA+364
CCARABPT EQU   IGGCCA+368
CCADICT  EQU   IGGCCA+372
CCAXCPL  EQU   IGGCCA+376
CCARABB  EQU   IGGCCA+380
CCARABF  EQU   IGGCCA+384
CCARABL  EQU   IGGCCA+388
CCACBASE EQU   IGGCCA+392
CCALREL  EQU   IGGCCA+396
CCASN    EQU   IGGCCA+398
CCASN1   EQU   CCASN
CCATNREL EQU   IGGCCA+406
CCATNUM  EQU   IGGCCA+408
CCATREL  EQU   IGGCCA+410
CCATNO   EQU   IGGCCA+442
CCATEST  EQU   IGGCCA+444
CCARBA   EQU   IGGCCA+448
CCACRAVL EQU   CCARBA
CCACRADT EQU   CCARBA+6
CCARBA1  EQU   CCARBA+12
CCARBA2  EQU   CCARBA+16
CCATLNG  EQU   IGGCCA+468
CCARBAL  EQU   IGGCCA+470
CCAIDPT3 EQU   IGGCCA+480
CCAGVCT  EQU   IGGCCA+484
CCANEVV  EQU   IGGCCA+486
CCAGVEXT EQU   IGGCCA+488
CCANEFV  EQU   IGGCCA+491
CCAGRGC  EQU   IGGCCA+493
CCAGRHI  EQU   IGGCCA+494
CCASSEQ  EQU   CCAGRHI
CCASVCI1 EQU   IGGCCA+509
CCAFLG7  EQU   IGGCCA+552
CCAFLG8  EQU   IGGCCA+553
CCAFLG9  EQU   IGGCCA+554
CCASMFLG EQU   IGGCCA+562
CCASMFG1 EQU   CCASMFLG
CCASMFUC EQU   CCASMFG1
CCASMFSR EQU   CCASMFG1
CCABMINP EQU   IGGCCA+684
CCABMFLG EQU   CCABMINP+6
CCABMOUT EQU   IGGCCA+692
CCABMOFG EQU   CCABMOUT+4
CCATEMPS EQU   IGGCCA+744
CCAMNCAT EQU   IGGCCA+784
CCAMNAT  EQU   CCAMNCAT
MNATTOP  EQU   CCAMNAT
MNATFLGS EQU   CCAMNAT+240
CCAARFWA EQU   IGGCCA+1040
ARFGMLEN EQU   CCAARFWA
CCARVFG1 EQU   IGGCCA+1056
CCAFLG11 EQU   IGGCCA+1059
CCAREGS  EQU   IGGCCA+1060
CCABZSAV EQU   IGGCCA+1408
CCARALSA EQU   IGGCCA+1440
CCAFLG10 EQU   IGGCCA+1444
CCASMFP  EQU   IGGCCA+1480
CCAPROBX EQU   IGGCCA+1484
CCAERCDX EQU   CCAPROBX+2
CCADGDGA EQU   IGGCCA+1488
CTGPL    EQU   0
CTGOPTN1 EQU   CTGPL
CTGOPTN2 EQU   CTGPL+1
CTGEXT   EQU   CTGOPTN2
CTGERASE EQU   CTGOPTN2
CTGSMF   EQU   CTGERASE
CTGREL   EQU   CTGSMF
CTGPURG  EQU   CTGOPTN2
CTGVMNT  EQU   CTGPURG
CTGOPTN3 EQU   CTGPL+2
CTGOPTN4 EQU   CTGPL+3
CTGENT   EQU   CTGPL+4
CTGFVT   EQU   CTGENT
CTGCAT   EQU   CTGPL+8
CTGCVOL  EQU   CTGCAT
CTGWKA   EQU   CTGPL+12
CTGDSORG EQU   CTGPL+16
CTGDDNM  EQU   CTGPL+20
CTGNEWNM EQU   CTGDDNM
CTGFBFLG EQU   CTGNEWNM+2
CTGJSCB  EQU   CTGPL+24
CTGFL    EQU   0
CTGFLDCD EQU   CTGFL+1
CTGFLDGC EQU   CTGFL+2
CTGFLDRE EQU   CTGFL+3
CTGFLDTS EQU   CTGFLDRE
CTGFLDWA EQU   CTGFL+4
CTGFLDNM EQU   CTGFL+8
CTGFLCHN EQU   CTGFL+12
CTGFLDAT EQU   CTGFL+16
CTGFLNG  EQU   CTGFLDAT
CTGFLPT  EQU   CTGFLDAT+4
USERWKA  EQU   0
WKA      EQU   USERWKA+4
ENTNAMES EQU   WKA
DICTENT  EQU   0
DICTFLGS EQU   DICTENT
DICTREP  EQU   DICTFLGS
DICTST   EQU   DICTENT+1
DICTGC   EQU   DICTENT+3
DIC2ENT  EQU   0
DIC2FLGS EQU   DIC2ENT
DIC2VAR  EQU   DIC2FLGS
DIC2REP  EQU   DIC2FLGS
DIC2FLG  EQU   DIC2FLGS
DIC2ST   EQU   DIC2ENT+1
DIC2LC   EQU   DIC2ENT+2
DIC2GC   EQU   DIC2ENT+3
CCARAB   EQU   0
CCARABFL EQU   CCARAB
CCARBUR  EQU   CCARABFL
CCARBU1  EQU   CCARABFL
CCARBU2  EQU   CCARABFL
CCARBWR  EQU   CCARABFL
CCACPE1  EQU   CCARAB+4
CCACPE2  EQU   CCARAB+8
CCACPE3  EQU   CCARAB+12
CATGOPT  EQU   0
CATGOCI  EQU   CATGOPT
CATGOFLG EQU   CATGOCI
CATGODSP EQU   CATGOCI+1
CATGOGC1 EQU   CATGOPT+3
CATGOEXT EQU   CATGOGC1
CATGODEL EQU   CATGOGC1
CATGOSEQ EQU   CATGOPT+4
CATSN    EQU   0
CATRCD   EQU   0
RCDKEYTY EQU   CATRCD
RCDCINO  EQU   CATRCD+1
RCDID    EQU   CATRCD+44
NREPCV   EQU   CATRCD+47
NREPLF   EQU   CATRCD+48
REPCNTRL EQU   0
EXTRCDPT EQU   REPCNTRL
EXTGOCI  EQU   EXTRCDPT
REPCNT   EQU   REPCNTRL+5
REPGOPT  EQU   REPCNTRL+6
VARFIELD EQU   0
VARLEN   EQU   VARFIELD
CNTRLINF EQU   0
CNTVAR   EQU   CNTRLINF
LENFIX   EQU   CNTRLINF+1
CVTMAP   EQU   0
CVTTCBP  EQU   CVTMAP
CVTDAR   EQU   CVTMAP+72
CVTFLGS1 EQU   CVTDAR
CVTDCB   EQU   CVTMAP+116
CVTIOQET EQU   CVTMAP+120
CVTIERLC EQU   CVTMAP+144
CVTHEAD  EQU   CVTMAP+160
CVTSV76C EQU   CVTHEAD
CVTOPTA  EQU   CVTMAP+182
CVTOPTB  EQU   CVTMAP+183
CVTGTF   EQU   CVTMAP+236
CVTGTFST EQU   CVTGTF
CVTGTFS  EQU   CVTGTFST
CVTSTATE EQU   CVTGTFST
CVTTMODE EQU   CVTGTFST
CVTFORM  EQU   CVTGTFST
CVTAQAVT EQU   CVTMAP+240
CVTTCMFG EQU   CVTAQAVT
CVTVOLM2 EQU   CVTMAP+244
CVTTATA  EQU   CVTVOLM2
CVTTSKS  EQU   CVTTATA
CVTVOLF2 EQU   CVTTSKS
CVTTAT   EQU   CVTTATA+1
CVTATER  EQU   CVTMAP+248
CVTEXT1  EQU   CVTMAP+252
CVTCBSP  EQU   CVTMAP+256
CVTPURG  EQU   CVTMAP+260
CVTAMFF  EQU   CVTMAP+264
CVTQMSG  EQU   CVTMAP+268
CVTDMSR  EQU   CVTMAP+272
CVTRSV37 EQU   CVTDMSR
CVTDMSRF EQU   CVTRSV37
CVTERPV  EQU   CVTMAP+316
CVTINTLA EQU   CVTMAP+320
CVTAPF   EQU   CVTMAP+324
CVTEXT2  EQU   CVTMAP+328
CVTHJES  EQU   CVTMAP+332
CVTPGSIA EQU   CVTMAP+348
CVTA1F1  EQU   CVTMAP+356
CVTSYSK  EQU   CVTMAP+357
CVTVOLM1 EQU   CVTMAP+380
CVTVOLF1 EQU   CVTVOLM1
CVTATMCT EQU   CVTMAP+388
CVTXTNT1 EQU   0
CVTXTNT2 EQU   0
CVTDSSV  EQU   CVTXTNT2
CVTFLGBT EQU   CVTXTNT2+5
CVTQID   EQU   CVTXTNT2+24
CVTRV400 EQU   CVTXTNT2+52
CVTRV409 EQU   CVTXTNT2+53
CVTATCVT EQU   CVTXTNT2+64
CVTRV429 EQU   CVTXTNT2+84
CVTRV438 EQU   CVTXTNT2+85
CVTRV457 EQU   CVTXTNT2+112
CVTRV466 EQU   CVTXTNT2+113
CVTFIX   EQU   0
CVTRELNO EQU   CVTFIX+252
TCBWORDS EQU   0
TCBPTR   EQU   TCBWORDS+4
TCBFIX   EQU   0
TCBFRS   EQU   TCBFIX
TCB      EQU   0
TCBPIE   EQU   TCB+4
TCBPMASK EQU   TCBPIE
TCBCMP   EQU   TCB+16
TCBCMPF  EQU   TCBCMP
TCBCPP   EQU   TCBCMPF
TCBSTCC  EQU   TCBCMPF
TCBCDBL  EQU   TCBCMPF
TCBCWTO  EQU   TCBCMPF
TCBCIND  EQU   TCBCMPF
TCBCMSG  EQU   TCBCMPF
TCBTRN   EQU   TCB+20
TCBABF   EQU   TCBTRN
TCBMSS   EQU   TCB+24
TCBPKF   EQU   TCB+28
TCBFLGS  EQU   TCB+29
TCBFLGS1 EQU   TCBFLGS
TCBFLGS2 EQU   TCBFLGS+1
TCBFLGS3 EQU   TCBFLGS+2
TCBFLGS4 EQU   TCBFLGS+3
TCBFLGS5 EQU   TCBFLGS+4
TCBABWF  EQU   TCBFLGS5
TCBJPQ   EQU   TCB+44
TCBPURGE EQU   TCBJPQ
TCBGRS   EQU   TCB+48
TCBFSA   EQU   TCB+112
TCBTME   EQU   TCB+120
TCBJSTCB EQU   TCB+124
TCBTSFLG EQU   TCB+148
TCBTSTSK EQU   TCBTSFLG
TCBSTAB  EQU   TCB+160
TCBNSTAE EQU   TCBSTAB
TCBTCT   EQU   TCB+164
TCBTCTGF EQU   TCBTCT
TCBSCNDY EQU   TCB+172
TCBNDSP  EQU   TCBSCNDY
TCBNDSP1 EQU   TCBNDSP+1
TCBNDSP2 EQU   TCBNDSP+2
TCBNDSP3 EQU   TCBNDSP+3
TCBJSCB  EQU   TCB+180
TCBRECDE EQU   TCBJSCB
TCBEXT1  EQU   TCB+196
TCBBITS  EQU   TCB+200
TCBNDSP4 EQU   TCBBITS
TCBNDSP5 EQU   TCBBITS+1
TCBFLGS6 EQU   TCBBITS+2
TCBFLGS7 EQU   TCBBITS+3
TCBDAR   EQU   TCB+204
TCBDARC  EQU   TCBDAR
TCBEXT2  EQU   TCB+208
TCBFOE   EQU   TCB+244
TCBESTAE EQU   TCB+264
TCBESTRM EQU   TCBESTAE+1
TCBFBYT1 EQU   TCB+276
TCBFBYT2 EQU   TCB+277
TCBRV124 EQU   TCB+278
TCBRV133 EQU   TCB+279
TCBXTNT2 EQU   0
TCBGTF   EQU   TCBXTNT2
TCBTFLG  EQU   TCBGTF
TCBRV146 EQU   TCBXTNT2+28
TCBRV155 EQU   TCBXTNT2+29
TCBRV164 EQU   TCBXTNT2+30
TCBRV173 EQU   TCBXTNT2+31
IFGACB   EQU   0
ACBCOMN  EQU   IFGACB
ACBLENG  EQU   ACBCOMN+2
ACBLENG2 EQU   ACBLENG
ACBAMBL  EQU   ACBCOMN+4
ACBJWA   EQU   ACBAMBL
ACBMACRF EQU   ACBCOMN+12
ACBMACR1 EQU   ACBMACRF
ACBADR   EQU   ACBMACR1
ACBCNV   EQU   ACBMACR1
ACBMACR2 EQU   ACBMACRF+1
ACBBUFPL EQU   ACBCOMN+20
ACBMACR3 EQU   ACBBUFPL
ACBRECFM EQU   ACBCOMN+24
ACBCCTYP EQU   ACBCOMN+25
ACBOPT   EQU   ACBCOMN+26
ACBDSORG EQU   ACBOPT
ACBCROPS EQU   ACBDSORG
ACBEXLST EQU   ACBCOMN+36
ACBDDNM  EQU   ACBCOMN+40
ACBAMETH EQU   ACBDDNM+3
ACBOFLGS EQU   ACBCOMN+48
ACBEXFG  EQU   ACBOFLGS
ACBIOSFG EQU   ACBOFLGS
ACBINFLG EQU   ACBCOMN+50
ACBUJFCB EQU   ACBCOMN+52
ACBBLKSZ EQU   ACBCOMN+60
ACBUAPTR EQU   ACBCOMN+64
AMCBS    EQU   0
CBSCMP   EQU   AMCBS+16
CBSVSRT  EQU   AMCBS+32
IGGCAXWA EQU   0
CAXFLGS  EQU   IGGCAXWA+8
CAXFLG2  EQU   IGGCAXWA+9
CAXFLG3  EQU   IGGCAXWA+10
CAXCCR   EQU   IGGCAXWA+32
CAXCNAM  EQU   IGGCAXWA+52
CAXOPLST EQU   IGGCAXWA+96
COPTS    EQU   CAXOPLST
CTGFV    EQU   0
CTGFVPRO EQU   CTGFV+1
CTGFVSPC EQU   CTGFV+52
CTGFVAMD EQU   CTGFV+56
CTGFVLMT EQU   CTGFV+72
CTGFVGAT EQU   CTGFV+76
CTGWA    EQU   0
CTGWAVL  EQU   CTGWA
CTGVL    EQU   0
CTGVLX   EQU   0
CTGCV    EQU   0
CTGCVDSN EQU   CTGCV+6
MWA      EQU   0
VLST     EQU   MWA+2
CVOLIND  EQU   MWA+252
INSERT4  EQU   0
CI       EQU   0
CTGVLDSP EQU   0
FIELDNM  EQU   0
TNAM     EQU   0
@NM00036 EQU   CTGDDNM
CTGPROB  EQU   @NM00036
CTGREASN EQU   CTGPROB+2
CVTS01   EQU   CVTPGSIA
CVTLPDIA EQU   CVTS01+12
CVTDIRST EQU   CVTLPDIA
CVTSLIDA EQU   CVTS01+24
CVTCTLFG EQU   CVTS01+50
CVTRV210 EQU   CVTS01+424
CVTRV219 EQU   CVTS01+425
CVTRV228 EQU   CVTS01+426
CVTRV237 EQU   CVTS01+427
CVTMFRTR EQU   CVTS01+452
CVTRV262 EQU   CVTS01+468
CVTRV271 EQU   CVTS01+469
CVTRV280 EQU   CVTS01+470
CVTRV289 EQU   CVTS01+471
CVTGSDA  EQU   CVTS01+600
PSARSVTE EQU   PSARSVT
MCATDSTR EQU   CVTAMFF
CVTAMF1  EQU   MCATDSTR
FLC      EQU   PSA
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS
@NM00086 EQU   MCATDSTR+1
@NM00085 EQU   CVTAMF1
AMF1NONX EQU   CVTAMF1
AMF1OPEN EQU   CVTAMF1
PSARSAV  EQU   PSARSVTE+60
PSARSTK  EQU   PSARSVTE+56
PSAESAV3 EQU   PSARSVTE+52
PSAESTK3 EQU   PSARSVTE+48
PSAESAV2 EQU   PSARSVTE+44
PSAESTK2 EQU   PSARSVTE+40
PSAESAV1 EQU   PSARSVTE+36
PSAESTK1 EQU   PSARSVTE+32
PSAPSAV  EQU   PSARSVTE+28
PSAPSTK  EQU   PSARSVTE+24
PSAMSAV  EQU   PSARSVTE+20
PSAMSTK  EQU   PSARSVTE+16
PSASSAV  EQU   PSARSVTE+12
PSASSTK  EQU   PSARSVTE+8
PSANSTK  EQU   PSARSVTE+4
PSACSTK  EQU   PSARSVTE
CVTRV628 EQU   CVTS01+728
CVTRV627 EQU   CVTS01+724
CVTRV626 EQU   CVTS01+720
CVTRV625 EQU   CVTS01+716
CVTRV624 EQU   CVTS01+712
CVTRV623 EQU   CVTS01+708
CVTRV622 EQU   CVTS01+704
CVTRV621 EQU   CVTS01+700
CVTIHASU EQU   CVTS01+696
CVTRV619 EQU   CVTS01+692
CVTRV618 EQU   CVTS01+688
CVTRV617 EQU   CVTS01+684
CVTRV616 EQU   CVTS01+680
CVTRV615 EQU   CVTS01+676
CVTRV614 EQU   CVTS01+672
CVTRV613 EQU   CVTS01+668
CVTTCASP EQU   CVTS01+664
CVT0PT03 EQU   CVTS01+660
CVT0PT0E EQU   CVTS01+656
CVTRV609 EQU   CVTS01+652
CVTCGK   EQU   CVTS01+648
CVTRAC   EQU   CVTS01+644
CVTHSM   EQU   CVTS01+640
CVTRV605 EQU   CVTS01+636
CVTRV604 EQU   CVTS01+632
CVTEFF02 EQU   CVTS01+628
CVTCBBR  EQU   CVTS01+624
CVTSSCR  EQU   CVTS01+620
CVTEVENT EQU   CVTS01+616
CVTCRCA  EQU   CVTS01+612
CVTTPIO  EQU   CVTS01+608
CVTADV   EQU   CVTS01+604
CVTGSDAB EQU   CVTGSDA
CVTQV3   EQU   CVTS01+596
CVTQV2   EQU   CVTS01+592
CVTQV1   EQU   CVTS01+588
CVTRPT   EQU   CVTS01+584
CVTSSRB  EQU   CVTS01+580
CVTCSDRL EQU   CVTS01+576
CVTEXP1  EQU   CVTS01+572
CVTRMPMT EQU   CVTS01+568
CVTRMPTT EQU   CVTS01+564
CVTVPSA  EQU   CVTS01+560
CVTVSTOP EQU   CVTS01+556
CVTGTFR8 EQU   CVTS01+552
CVTQUIT  EQU   CVTS01+548
CVTVACR  EQU   CVTS01+544
CVTWTCB  EQU   CVTS01+540
CVTSTPRS EQU   CVTS01+536
CVT0PT02 EQU   CVTS01+532
CVTDARCM EQU   CVTS01+528
CVTIRECM EQU   CVTS01+524
CVTJRECM EQU   CVTS01+520
CVTVEMS0 EQU   CVTS01+516
CVTSPFRR EQU   CVTS01+512
CVTRLSTG EQU   CVTS01+508
CVT0TC0A EQU   CVTS01+504
CVTGMBR  EQU   CVTS01+500
CVTLFRM  EQU   CVTS01+496
CVTRMBR  EQU   CVTS01+492
CVTVIOP  EQU   CVTS01+488
CVTRV307 EQU   CVTS01+486
CVTRV306 EQU   CVTS01+484
CVTRV305 EQU   CVTS01+482
CVTRV304 EQU   CVTS01+480
CVTRV303 EQU   CVTS01+478
CVTRV302 EQU   CVTS01+476
CVTTRCA  EQU   CVTS01+472
CVTRV297 EQU   CVTRV289
CVTRV296 EQU   CVTRV289
CVTRV295 EQU   CVTRV289
CVTRV294 EQU   CVTRV289
CVTRV293 EQU   CVTRV289
CVTRV292 EQU   CVTRV289
CVTRV291 EQU   CVTRV289
CVTRV290 EQU   CVTRV289
CVTRV288 EQU   CVTRV280
CVTRV287 EQU   CVTRV280
CVTRV286 EQU   CVTRV280
CVTRV285 EQU   CVTRV280
CVTRV284 EQU   CVTRV280
CVTRV283 EQU   CVTRV280
CVTRV282 EQU   CVTRV280
CVTRV281 EQU   CVTRV280
CVTRV279 EQU   CVTRV271
CVTRV278 EQU   CVTRV271
CVTRV277 EQU   CVTRV271
CVTRV276 EQU   CVTRV271
CVTRV275 EQU   CVTRV271
CVTRV274 EQU   CVTRV271
CVTRV273 EQU   CVTRV271
CVTRV272 EQU   CVTRV271
CVTRV270 EQU   CVTRV262
CVTRV269 EQU   CVTRV262
CVTRV268 EQU   CVTRV262
CVTRV267 EQU   CVTRV262
CVTRV266 EQU   CVTRV262
CVTRV265 EQU   CVTRV262
CVTRV264 EQU   CVTRV262
CVTRV263 EQU   CVTRV262
CVTVFP   EQU   CVTS01+464
CVTVSI   EQU   CVTS01+460
CVTVPSIB EQU   CVTS01+456
CVTMFACT EQU   CVTMFRTR
CVTMFCTL EQU   CVTS01+448
CVTPVBP  EQU   CVTS01+444
CVTPWI   EQU   CVTS01+440
CVTRV254 EQU   CVTS01+438
CVTRV253 EQU   CVTS01+436
CVTRV252 EQU   CVTS01+434
CVTRV251 EQU   CVTS01+433
CVTRV250 EQU   CVTS01+432
CVTRV249 EQU   CVTS01+431
CVTRV248 EQU   CVTS01+430
CVTRV247 EQU   CVTS01+429
CVTRV246 EQU   CVTS01+428
CVTRV245 EQU   CVTRV237
CVTRV244 EQU   CVTRV237
CVTRV243 EQU   CVTRV237
CVTRV242 EQU   CVTRV237
CVTRV241 EQU   CVTRV237
CVTRV240 EQU   CVTRV237
CVTRV239 EQU   CVTRV237
CVTRV238 EQU   CVTRV237
CVTRV236 EQU   CVTRV228
CVTRV235 EQU   CVTRV228
CVTRV234 EQU   CVTRV228
CVTRV233 EQU   CVTRV228
CVTRV232 EQU   CVTRV228
CVTRV231 EQU   CVTRV228
CVTRV230 EQU   CVTRV228
CVTRV229 EQU   CVTRV228
CVTRV227 EQU   CVTRV219
CVTRV226 EQU   CVTRV219
CVTRV225 EQU   CVTRV219
CVTRV224 EQU   CVTRV219
CVTRV223 EQU   CVTRV219
CVTRV222 EQU   CVTRV219
CVTRV221 EQU   CVTRV219
CVTRV220 EQU   CVTRV219
CVTRV218 EQU   CVTRV210
CVTRV217 EQU   CVTRV210
CVTRV216 EQU   CVTRV210
CVTRV215 EQU   CVTRV210
CVTRV214 EQU   CVTRV210
CVTRV213 EQU   CVTRV210
CVTRV212 EQU   CVTRV210
CVTRV211 EQU   CVTRV210
CVTLCCAT EQU   CVTS01+420
CVTPCCAT EQU   CVTS01+416
CVTIPCRP EQU   CVTS01+412
CVTIPCRI EQU   CVTS01+408
CVTIPCDS EQU   CVTS01+404
CVTAIDVT EQU   CVTS01+400
CVTSSAP  EQU   CVTS01+396
CVTEHCIR EQU   CVTS01+392
CVTEHDEF EQU   CVTS01+388
CVTDAIR  EQU   CVTS01+384
CVTPERFM EQU   CVTS01+380
CVT044R2 EQU   CVTS01+376
CVTFETCH EQU   CVTS01+372
CVTRSTWD EQU   CVTS01+368
CVTSPOST EQU   CVTS01+364
CVTIOBP  EQU   CVTS01+360
CVTASMVT EQU   CVTS01+356
CVTRECRQ EQU   CVTS01+352
CVTWSAC  EQU   CVTS01+348
CVTRV149 EQU   CVTS01+344
CVTWSAL  EQU   CVTS01+340
CVTSPSA  EQU   CVTS01+336
CVTGLMN  EQU   CVTS01+332
CVTVEAC0 EQU   CVTS01+328
CVT062R1 EQU   CVTS01+324
CVTRPOST EQU   CVTS01+320
CVTDQIQE EQU   CVTS01+316
CVTCSD   EQU   CVTS01+312
CVTLKRMA EQU   CVTS01+308
CVTRSPIE EQU   CVTS01+304
CVTRENQ  EQU   CVTS01+300
CVTLQCB  EQU   CVTS01+296
CVTFQCB  EQU   CVTS01+292
CVTQCS01 EQU   CVTS01+288
CVTAPFT  EQU   CVTS01+284
CVTPARRL EQU   CVTS01+280
CVTVWAIT EQU   CVTS01+276
CVTGSPL  EQU   CVTS01+272
CVTLSMQ  EQU   CVTS01+268
CVTGSMQ  EQU   CVTS01+264
CVTEXPRO EQU   CVTS01+260
CVTOPCTP EQU   CVTS01+256
CVTSIC   EQU   CVTS01+252
CVTTPIOS EQU   CVTS01+248
CVTRTMS  EQU   CVTS01+244
CVTSDBF  EQU   CVTS01+240
CVTSCBP  EQU   CVTS01+236
CVTSDMP  EQU   CVTS01+232
CVTSV60  EQU   CVTS01+228
CVTRTMCT EQU   CVTS01+224
CVTASCBL EQU   CVTS01+220
CVTASCBH EQU   CVTS01+216
CVTGDA   EQU   CVTS01+212
CVTASVT  EQU   CVTS01+208
CVTVVMDI EQU   CVTS01+204
CVTAQTOP EQU   CVTS01+200
CVTIOSCS EQU   CVTS01+196
CVTSDRM  EQU   CVTS01+192
CVTOPTE  EQU   CVTS01+188
CVTSTXU  EQU   CVTS01+184
CVTQUIS  EQU   CVTS01+180
CVTPARS  EQU   CVTS01+176
CVTS1EE  EQU   CVTS01+172
CVTFRAS  EQU   CVTS01+168
CVTQSAS  EQU   CVTS01+164
CVTCRAS  EQU   CVTS01+160
CVTCRMN  EQU   CVTS01+156
CVTDELCP EQU   CVTS01+152
CVTFRECL EQU   CVTS01+148
CVTGETCL EQU   CVTS01+144
CVTBLDCP EQU   CVTS01+140
CVTAUTHL EQU   CVTS01+136
CVTSCAN  EQU   CVTS01+132
CVTRV144 EQU   CVTS01+130
CVTMAXMP EQU   CVTS01+128
CVTSTCK  EQU   CVTS01+124
CVTRV139 EQU   CVTS01+123
CVTDSSAC EQU   CVTS01+122
CVTRV513 EQU   CVTS01+121
CVTIOSPL EQU   CVTS01+120
CVTPTGT  EQU   CVTS01+116
CVTCSPIE EQU   CVTS01+112
CVTSMFEX EQU   CVTS01+108
CVTOLT0A EQU   CVTS01+104
CVTSRBRT EQU   CVTS01+100
CVTPUTL  EQU   CVTS01+96
CVTASCRL EQU   CVTS01+92
CVTASCRF EQU   CVTS01+88
CVTRV326 EQU   CVTS01+84
CVTRV325 EQU   CVTS01+80
CVTRV324 EQU   CVTS01+76
CVT0VL01 EQU   CVTS01+72
CVTSHRVM EQU   CVTS01+68
CVTRV332 EQU   CVTS01+64
CVTTAS   EQU   CVTS01+60
CVTRSCN  EQU   CVTS01+56
CVTTRAC2 EQU   CVTS01+54
CVTTRACE EQU   CVTS01+52
CVTAPG   EQU   CVTS01+51
CVTSDTRC EQU   CVTCTLFG
CVTGTRCE EQU   CVTCTLFG
CVTNOMP  EQU   CVTCTLFG
CVTRSV79 EQU   CVTCTLFG
CVTDSTAT EQU   CVTCTLFG
CVTRSV78 EQU   CVTCTLFG
CVTRV333 EQU   CVTCTLFG
CVTRV323 EQU   CVTCTLFG
CVTSPVLK EQU   CVTS01+49
CVTRSV77 EQU   CVTS01+48
CVTRV331 EQU   CVTS01+44
CVTRV330 EQU   CVTS01+40
CVTRV329 EQU   CVTS01+36
CVTRV328 EQU   CVTS01+32
CVTRV322 EQU   CVTS01+28
CVTSLID  EQU   CVTSLIDA+1
CVTSYLK  EQU   CVTSLIDA
CVTRV321 EQU   CVTS01+20
CVTRV320 EQU   CVTS01+16
CVTLPDIR EQU   CVTLPDIA+1
CVTRSV69 EQU   CVTDIRST
CVTRSV68 EQU   CVTDIRST
CVTRSV67 EQU   CVTDIRST
CVTRSV66 EQU   CVTDIRST
CVTRSV65 EQU   CVTDIRST
CVTRSV64 EQU   CVTDIRST
CVTRSV63 EQU   CVTDIRST
CVTDICOM EQU   CVTDIRST
CVTPVTP  EQU   CVTS01+8
CVTLPDSR EQU   CVTS01+4
CVTGETL  EQU   CVTS01
CTGREAS2 EQU   CTGREASN+1
CTGREAS1 EQU   CTGREASN
CTGMODID EQU   CTGPROB
CVLSER   EQU   MWA+259
TTR2     EQU   MWA+256
BIN0     EQU   CVOLIND+3
TTR1     EQU   CVOLIND
@NM00095 EQU   MWA+242
FSN      EQU   VLST+10
VOLSER   EQU   VLST+4
DEVTYP   EQU   VLST
VOLENTCT EQU   MWA
CTGCVCC  EQU   CTGCV+50
CTGCVDEV EQU   CTGCVDSN
CTGCVVOL EQU   CTGCV
CTGVLTTR EQU   CTGVLX+12
@NM00094 EQU   CTGVLX
CTGVLSEQ EQU   CTGVL+10
CTGVLDEV EQU   CTGVL+6
CTGVLVOL EQU   CTGVL
CTGWAGB  EQU   CTGWA+12
CTGWAGCT EQU   CTGWA+10
CTGWAUCT EQU   CTGWA+8
CTGWAVCT EQU   CTGWA+6
CTGWALV  EQU   CTGWA+4
CTGFVWKA EQU   CTGFV+88
CTGFVPWD EQU   CTGFV+84
CTGFVNAM EQU   CTGFV+80
CTGFVUPG EQU   CTGFVGAT
CTGFVEXT EQU   CTGFVLMT
CTGFVLRS EQU   CTGFV+68
CTGFVBUF EQU   CTGFV+64
CTGFVATR EQU   CTGFV+60
CTGFVFSN EQU   CTGFVAMD
CTGFVTTR EQU   CTGFVSPC
CTGFVDVT EQU   CTGFV+48
CTGFVRNG EQU   CTGFV+44
CTGFVVLT EQU   CTGFV+40
CTGFVCRE EQU   CTGFV+36
CTGFVEXP EQU   CTGFV+32
CTGFVOWN EQU   CTGFV+28
CTGFVSTY EQU   CTGFV+24
CTGFVENT EQU   CTGFV+20
CTGFVIND EQU   CTGFV+16
CTGFVVCH EQU   CTGFV+12
CTGFVICH EQU   CTGFV+8
CTGFVDCH EQU   CTGFV+4
@NM00093 EQU   CTGFV+3
CTGFVELM EQU   CTGFV+2
@NM00092 EQU   CTGFVPRO
CTGFVDRC EQU   CTGFVPRO
CTGFVNDC EQU   CTGFVPRO
CTGFVRVL EQU   CTGFVPRO
CTGFVAVL EQU   CTGFVPRO
CTGFVTYP EQU   CTGFV
CAXCRACB EQU   IGGCAXWA+112
CAXJDE   EQU   IGGCAXWA+108
CAXCCA   EQU   IGGCAXWA+104
CAXOPEWA EQU   IGGCAXWA+100
COPACB   EQU   CAXOPLST+1
@NM00091 EQU   COPTS
CENLST   EQU   COPTS
@NM00090 EQU   CAXCNAM+22
CAXRADDN EQU   CAXCNAM+14
CAXRATEP EQU   CAXCNAM+10
CAXRACTS EQU   CAXCNAM+6
CAXVOLID EQU   CAXCNAM
CAXRPL   EQU   IGGCAXWA+48
CAXRPLCT EQU   IGGCAXWA+46
CAXASID  EQU   IGGCAXWA+44
CAXFDCI  EQU   CAXCCR+9
CAXCDCI  EQU   CAXCCR+6
CAXNFCI  EQU   CAXCCR+3
CAXHACI  EQU   CAXCCR
CAXUCB   EQU   IGGCAXWA+28
CAXACB   EQU   IGGCAXWA+24
CAXDRWP  EQU   IGGCAXWA+20
CAXSCHWA EQU   IGGCAXWA+16
CAXATIOT EQU   IGGCAXWA+12
CAXACT   EQU   IGGCAXWA+11
@NM00089 EQU   CAXFLG3
CAXF3B6  EQU   CAXFLG3
CAXF3B5  EQU   CAXFLG3
@NM00088 EQU   CAXFLG3
CAXF3ANE EQU   CAXFLG3
CAXF3AT  EQU   CAXFLG3
CAXF2VTU EQU   CAXFLG2
CAXF2REC EQU   CAXFLG2
CAXF2CA  EQU   CAXFLG2
CAXF2CLR EQU   CAXFLG2
CAXF2IOE EQU   CAXFLG2
CAXF2NCR EQU   CAXFLG2
CAXF2NDD EQU   CAXFLG2
CAXF2DT  EQU   CAXFLG2
CAXSCR   EQU   CAXFLGS
CAXCMR   EQU   CAXFLGS
CAXMCT   EQU   CAXFLGS
CAXCMP   EQU   CAXFLGS
CAXEOV   EQU   CAXFLGS
CAXCLS   EQU   CAXFLGS
CAXOPN   EQU   CAXFLGS
CAXBLD   EQU   CAXFLGS
CAXCHN   EQU   IGGCAXWA+4
@NM00087 EQU   IGGCAXWA+1
CAXID    EQU   IGGCAXWA
CBSVPTR  EQU   CBSVSRT+4
CBSVUSE  EQU   CBSVSRT
CBSCRTCB EQU   AMCBS+28
CBSCRACA EQU   AMCBS+24
CBSCAXCN EQU   AMCBS+20
CBSMCUCB EQU   CBSCMP
CBSCBP   EQU   AMCBS+12
CBSACB   EQU   AMCBS+8
CBSMCSTA EQU   AMCBS+4
CBSSIZ   EQU   AMCBS+2
CBSID    EQU   AMCBS
ACBAPID  EQU   ACBCOMN+72
ACBCBMWA EQU   ACBCOMN+68
ACBLRECL EQU   ACBCOMN+62
ACBMSGLN EQU   ACBBLKSZ
ACBBUFSP EQU   ACBCOMN+56
@NM00084 EQU   ACBUJFCB+1
ACBOPTN  EQU   ACBUJFCB
ACBVVIC  EQU   ACBINFLG
ACBUCRA  EQU   ACBINFLG
ACBSCRA  EQU   ACBINFLG
ACBCAT   EQU   ACBINFLG
ACBIJRQE EQU   ACBINFLG
ACBJEPS  EQU   ACBINFLG
@NM00083 EQU   ACBINFLG
ACBERFLG EQU   ACBCOMN+49
ACBBUSY  EQU   ACBIOSFG
ACBLOCK  EQU   ACBEXFG
@NM00082 EQU   ACBOFLGS
ACBDSERR EQU   ACBOFLGS
ACBOPEN  EQU   ACBOFLGS
ACBEOV   EQU   ACBOFLGS
@NM00081 EQU   ACBOFLGS
ACBDEB   EQU   ACBDDNM+5
ACBERFL  EQU   ACBDDNM+4
ACBAM    EQU   ACBAMETH
ACBINFL  EQU   ACBDDNM+2
ACBTIOT  EQU   ACBDDNM
ACBUEL   EQU   ACBEXLST
ACBPASSW EQU   ACBCOMN+32
ACBMSGAR EQU   ACBCOMN+28
@NM00080 EQU   ACBDSORG+1
ACBDORGA EQU   ACBDSORG+1
@NM00079 EQU   ACBDSORG
ACBCRNRE EQU   ACBCROPS
ACBCRNCK EQU   ACBCROPS
ACBASA   EQU   ACBCCTYP
@NM00078 EQU   ACBCCTYP
ACBRECAF EQU   ACBRECFM
ACBJBUF  EQU   ACBBUFPL+2
ACBMACR4 EQU   ACBBUFPL+1
@NM00077 EQU   ACBMACR3
ACBNCFX  EQU   ACBMACR3
ACBSIS   EQU   ACBMACR3
ACBDFR   EQU   ACBMACR3
ACBICI   EQU   ACBMACR3
ACBGSR   EQU   ACBMACR3
ACBLSR   EQU   ACBMACR3
@NM00076 EQU   ACBMACR3
ACBBUFNI EQU   ACBCOMN+18
ACBBUFND EQU   ACBCOMN+16
ACBSTRNO EQU   ACBCOMN+15
ACBBSTNO EQU   ACBCOMN+14
ACBAIX   EQU   ACBMACR2
ACBDSN   EQU   ACBMACR2
ACBRST   EQU   ACBMACR2
ACBLOGON EQU   ACBMACR2
ACBSKP   EQU   ACBMACR2
@NM00075 EQU   ACBMACR2
ACBUBF   EQU   ACBMACR1
ACBOUT   EQU   ACBMACR1
ACBIN    EQU   ACBMACR1
ACBDIR   EQU   ACBMACR1
ACBSEQ   EQU   ACBMACR1
ACBBLK   EQU   ACBCNV
ACBADD   EQU   ACBADR
ACBKEY   EQU   ACBMACR1
ACBINRTN EQU   ACBCOMN+8
ACBIBCT  EQU   ACBJWA
ACBLEN2  EQU   ACBLENG2
ACBSTYP  EQU   ACBCOMN+1
ACBID    EQU   ACBCOMN
@NM00050 EQU   TCBXTNT2+32
TCBRV181 EQU   TCBRV173
TCBRV180 EQU   TCBRV173
TCBRV179 EQU   TCBRV173
TCBRV178 EQU   TCBRV173
TCBRV177 EQU   TCBRV173
TCBRV176 EQU   TCBRV173
TCBRV175 EQU   TCBRV173
TCBRV174 EQU   TCBRV173
TCBRV172 EQU   TCBRV164
TCBRV171 EQU   TCBRV164
TCBRV170 EQU   TCBRV164
TCBRV169 EQU   TCBRV164
TCBRV168 EQU   TCBRV164
TCBRV167 EQU   TCBRV164
TCBRV166 EQU   TCBRV164
TCBRV165 EQU   TCBRV164
TCBRV163 EQU   TCBRV155
TCBRV162 EQU   TCBRV155
TCBRV161 EQU   TCBRV155
TCBRV160 EQU   TCBRV155
TCBRV159 EQU   TCBRV155
TCBRV158 EQU   TCBRV155
TCBRV157 EQU   TCBRV155
TCBRV156 EQU   TCBRV155
TCBRV154 EQU   TCBRV146
TCBRV153 EQU   TCBRV146
TCBRV152 EQU   TCBRV146
TCBRV151 EQU   TCBRV146
TCBRV150 EQU   TCBRV146
TCBRV149 EQU   TCBRV146
TCBRV148 EQU   TCBRV146
TCBRV147 EQU   TCBRV146
TCBRV145 EQU   TCBXTNT2+26
TCBRV144 EQU   TCBXTNT2+24
TCBCAUF  EQU   TCBXTNT2+20
TCBRV142 EQU   TCBXTNT2+16
TCBRSV49 EQU   TCBXTNT2+12
TCBEVENT EQU   TCBXTNT2+8
TCBRCMP  EQU   TCBXTNT2+5
TCBRSVAB EQU   TCBXTNT2+4
TCBGTFA  EQU   TCBGTF+1
TCBRSV47 EQU   TCBTFLG
TCBRSV46 EQU   TCBTFLG
TCBRSV45 EQU   TCBTFLG
TCBRSV44 EQU   TCBTFLG
TCBRSV43 EQU   TCBTFLG
TCBDSPIT EQU   TCBTFLG
TCBERRTN EQU   TCBTFLG
TCBASYNC EQU   TCBTFLG
@NM00049 EQU   TCB+296
TCBSVCA2 EQU   TCB+292
TCBSWASA EQU   TCB+288
TCBDBTB  EQU   TCB+284
TCBRPT   EQU   TCB+280
TCBRV141 EQU   TCBRV133
TCBRV140 EQU   TCBRV133
TCBRV139 EQU   TCBRV133
TCBRV138 EQU   TCBRV133
TCBRV137 EQU   TCBRV133
TCBRV136 EQU   TCBRV133
TCBRV135 EQU   TCBRV133
TCBRV134 EQU   TCBRV133
TCBRV132 EQU   TCBRV124
TCBRV131 EQU   TCBRV124
TCBRV130 EQU   TCBRV124
TCBRV129 EQU   TCBRV124
TCBRV128 EQU   TCBRV124
TCBRV127 EQU   TCBRV124
TCBRV126 EQU   TCBRV124
TCBRV125 EQU   TCBRV124
TCBRV123 EQU   TCBFBYT2
TCBRV122 EQU   TCBFBYT2
TCBECBNV EQU   TCBFBYT2
TCBSSSYN EQU   TCBFBYT2
TCBFPRAP EQU   TCBFBYT2
TCBFDW   EQU   TCBFBYT2
TCBFMW   EQU   TCBFBYT2
TCBCNCB  EQU   TCBFBYT2
TCBLLH   EQU   TCBFBYT1
TCBRV113 EQU   TCBFBYT1
TCBEOT   EQU   TCBFBYT1
TCBRTM2  EQU   TCBFBYT1
TCBPGNLY EQU   TCBFBYT1
TCBNDIOS EQU   TCBFBYT1
TCBACTIV EQU   TCBFBYT1
TCBEOTFM EQU   TCBFBYT1
TCBAFFN  EQU   TCB+274
TCBCCPVI EQU   TCB+272
TCBUKYSP EQU   TCB+268
TCBMODE  EQU   TCBESTAE+3
TCBERTYP EQU   TCBESTAE+2
TCBRV314 EQU   TCBESTRM
TCBRV313 EQU   TCBESTRM
TCBRV312 EQU   TCBESTRM
TCBRV311 EQU   TCBESTRM
TCBRV310 EQU   TCBESTRM
TCBRV309 EQU   TCBESTRM
TCBRV308 EQU   TCBESTRM
TCBETERM EQU   TCBESTRM
TCBSCBKY EQU   TCBESTAE
TCBRTM12 EQU   TCB+260
TCBTCBID EQU   TCB+256
TCBRSV96 EQU   TCB+252
TCBSWA   EQU   TCB+248
TCBFOEA  EQU   TCBFOE+1
TCBRSV42 EQU   TCBFOE
TCBRV306 EQU   TCB+240
TCBRSV41 EQU   TCB+239
TCBTID   EQU   TCB+238
TCBRSVAA EQU   TCB+237
TCBABCUR EQU   TCB+236
TCBTMSAV EQU   TCB+232
TCBIOTIM EQU   TCB+228
TCBRTWA  EQU   TCB+224
TCBBACK  EQU   TCB+220
TCBTIRB  EQU   TCB+216
TCBAECB  EQU   TCB+212
TCBEXT2A EQU   TCBEXT2+1
TCBRSV39 EQU   TCBEXT2
TCBSTMCT EQU   TCB+207
TCBSYSCT EQU   TCB+206
TCBRSV37 EQU   TCB+205
TCBEXSVC EQU   TCBDAR
TCBDARMS EQU   TCBDAR
TCBDARWT EQU   TCBDAR
TCBDARO  EQU   TCBDAR
TCBDARMC EQU   TCBDARC
TCBDARD  EQU   TCBDAR
TCBDARS  EQU   TCBDAR
TCBDARP  EQU   TCBDAR
TCBGTOFM EQU   TCBFLGS7
TCBADMP  EQU   TCBFLGS7
TCBRSTSK EQU   TCBFLGS7
TCBSVCS  EQU   TCBFLGS7
TCBSTACK EQU   TCBFLGS7
TCBRSV34 EQU   TCBFLGS7
TCBRSV33 EQU   TCBFLGS7
TCBGPECB EQU   TCBFLGS7
TCBNTJS  EQU   TCBFLGS6
TCBAPG   EQU   TCBFLGS6
TCBMIGR  EQU   TCBFLGS6
TCBRV303 EQU   TCBFLGS6
TCBSPVLK EQU   TCBFLGS6
TCBCPU   EQU   TCBFLGS6
TCBPIE17 EQU   TCBFLGS6
TCBRV    EQU   TCBFLGS6
TCBRSV79 EQU   TCBNDSP5
TCBRSV78 EQU   TCBNDSP5
TCBRSV77 EQU   TCBNDSP5
TCBRSV76 EQU   TCBNDSP5
TCBRSV75 EQU   TCBNDSP5
TCBRSV74 EQU   TCBNDSP5
TCBRSV95 EQU   TCBNDSP5
TCBRSV94 EQU   TCBNDSP5
TCBRSV93 EQU   TCBNDSP4
TCBRSV92 EQU   TCBNDSP4
TCBRSV91 EQU   TCBNDSP4
TCBRSV90 EQU   TCBNDSP4
TCBRSV89 EQU   TCBNDSP4
TCBRSV88 EQU   TCBNDSP4
TCBRSV87 EQU   TCBNDSP4
TCBRSV86 EQU   TCBNDSP4
TCBEXT1A EQU   TCBEXT1+1
TCBRSV32 EQU   TCBEXT1
TCBEXCPD EQU   TCB+192
TCBIOBRC EQU   TCB+188
TCBDDWTC EQU   TCB+186
TCBDDEXC EQU   TCB+184
TCBJSCBB EQU   TCBJSCB+1
@NM00048 EQU   TCBRECDE
TCBREC   EQU   TCBRECDE
TCBMDIDS EQU   TCB+176
TCBNDINT EQU   TCBNDSP3
TCBRSV27 EQU   TCBNDSP3
TCBRSV26 EQU   TCBNDSP3
TCBRSV25 EQU   TCBNDSP3
TCBRSV24 EQU   TCBNDSP3
TCBSRBND EQU   TCBNDSP3
TCBRV302 EQU   TCBNDSP3
TCBLJSND EQU   TCBNDSP3
TCBABE   EQU   TCBNDSP2
TCBDSS   EQU   TCBNDSP2
TCBOWAIT EQU   TCBNDSP2
TCBIWAIT EQU   TCBNDSP2
TCBNDTS  EQU   TCBNDSP2
TCBNDSVC EQU   TCBNDSP2
TCBSTPP  EQU   TCBNDSP2
TCBABD   EQU   TCBNDSP2
TCBRSV22 EQU   TCBNDSP1
TCBPIEND EQU   TCBNDSP1
TCBTPSP  EQU   TCBNDSP1
TCBDDRND EQU   TCBNDSP1
TCBRSPND EQU   TCBNDSP1
TCBRSTND EQU   TCBNDSP1
TCBDARPN EQU   TCBNDSP1
TCBDARTN EQU   TCBNDSP1
TCBNDSP0 EQU   TCBNDSP
TCBUSER  EQU   TCB+168
TCBTCTB  EQU   TCBTCT+1
TCBRSV9C EQU   TCBTCTGF
TCBRSV9B EQU   TCBTCTGF
TCBRSV9A EQU   TCBTCTGF
TCBRSV99 EQU   TCBTCTGF
TCBRSV98 EQU   TCBTCTGF
TCBRSV97 EQU   TCBTCTGF
TCBRSV20 EQU   TCBTCTGF
TCBSMFGF EQU   TCBTCTGF
TCBSTABB EQU   TCBSTAB+1
TCBSTCUR EQU   TCBNSTAE
TCBRV301 EQU   TCBNSTAE
TCBSYNCH EQU   TCBNSTAE
TCBHALT  EQU   TCBNSTAE
TCBPPSUP EQU   TCBNSTAE
TCB33E   EQU   TCBNSTAE
TCBQUIES EQU   TCBNSTAE
TCBSTABE EQU   TCBNSTAE
TCBAQE   EQU   TCB+156
TCBPQE   EQU   TCB+152
TCBTSDP  EQU   TCB+151
TCBTSLP  EQU   TCB+150
TCBSTPCT EQU   TCB+149
TCBCPUBN EQU   TCBTSFLG
TCBDYDSP EQU   TCBTSFLG
TCBRSV18 EQU   TCBTSFLG
TCBRSV17 EQU   TCBTSFLG
TCBTIOTG EQU   TCBTSFLG
TCBATT   EQU   TCBTSFLG
TCBSTPPR EQU   TCBTSFLG
TCBRV300 EQU   TCBTSTSK
TCBECB   EQU   TCB+144
TCBIQE   EQU   TCB+140
TCBLTC   EQU   TCB+136
TCBOTC   EQU   TCB+132
TCBNTC   EQU   TCB+128
TCBJSTCA EQU   TCBJSTCB+1
TCBRSV16 EQU   TCBJSTCB
TCBTQET  EQU   TCBTME
TCBTCB   EQU   TCB+116
TCBFSAB  EQU   TCBFSA+1
TCBQEL   EQU   TCBFSA
TCBGRS15 EQU   TCBGRS+60
TCBGRS14 EQU   TCBGRS+56
TCBGRS13 EQU   TCBGRS+52
TCBGRS12 EQU   TCBGRS+48
TCBGRS11 EQU   TCBGRS+44
TCBGRS10 EQU   TCBGRS+40
TCBGRS9  EQU   TCBGRS+36
TCBGRS8  EQU   TCBGRS+32
TCBGRS7  EQU   TCBGRS+28
TCBGRS6  EQU   TCBGRS+24
TCBGRS5  EQU   TCBGRS+20
TCBGRS4  EQU   TCBGRS+16
TCBGRS3  EQU   TCBGRS+12
TCBGRS2  EQU   TCBGRS+8
TCBGRS1  EQU   TCBGRS+4
TCBGRS0  EQU   TCBGRS
TCBJPQB  EQU   TCBJPQ+1
TCBRSV15 EQU   TCBPURGE
TCBRSV14 EQU   TCBPURGE
TCBRSV13 EQU   TCBPURGE
TCBRSV12 EQU   TCBPURGE
TCBRSV11 EQU   TCBPURGE
TCBRSV10 EQU   TCBPURGE
TCBRSV09 EQU   TCBPURGE
TCBJPQF  EQU   TCBPURGE
TCBJLB   EQU   TCB+40
TCBLLS   EQU   TCB+36
TCBDSP   EQU   TCB+35
TCBLMP   EQU   TCB+34
TCBPNDSP EQU   TCBFLGS5
TCBFCD1  EQU   TCBFLGS5
TCBSTP   EQU   TCBFLGS5
TCBSYS   EQU   TCBFLGS5
TCBANDSP EQU   TCBFLGS5
TCBPAGE  EQU   TCBFLGS5
TCBUXNDF EQU   TCBABWF
TCBFC    EQU   TCBFLGS5
TCBONDSP EQU   TCBFLGS4
TCBMPCND EQU   TCBFLGS4
TCBMPCVQ EQU   TCBFLGS4
TCBUXNDV EQU   TCBFLGS4
TCBHNDSP EQU   TCBFLGS4
TCBRQENA EQU   TCBFLGS4
TCBSER   EQU   TCBFLGS4
TCBNDUMP EQU   TCBFLGS4
TCBDWSTA EQU   TCBFLGS3
TCBRSV08 EQU   TCBFLGS3
TCBRSV07 EQU   TCBFLGS3
TCBRSV06 EQU   TCBFLGS3
TCBABGM  EQU   TCBFLGS3
TCBABTRM EQU   TCBFLGS3
TCBADINP EQU   TCBFLGS3
TCBFSM   EQU   TCBFLGS3
TCBFTS   EQU   TCBFLGS2
TCBFETXR EQU   TCBFLGS2
TCBFDSOP EQU   TCBFLGS2
TCBFJMC  EQU   TCBFLGS2
TCBFSMC  EQU   TCBFLGS2
TCBFABOP EQU   TCBFLGS2
TCBFSTI  EQU   TCBFLGS2
TCBFOINP EQU   TCBFLGS2
TCBFX    EQU   TCBFLGS1
TCBFS    EQU   TCBFLGS1
TCBFT    EQU   TCBFLGS1
TCBPDUMP EQU   TCBFLGS1
TCBNONPR EQU   TCBFLGS1
TCBFERA  EQU   TCBFLGS1
TCBFE    EQU   TCBFLGS1
TCBFA    EQU   TCBFLGS1
TCBZERO  EQU   TCBPKF
TCBFLAG  EQU   TCBPKF
TCBMSSB  EQU   TCBMSS+1
TCBRSV03 EQU   TCBMSS
TCBTRNB  EQU   TCBTRN+1
TCBRSV02 EQU   TCBABF
TCBOLTEP EQU   TCBABF
TCBTCP   EQU   TCBABF
TCBTCPP  EQU   TCBABF
TCBRSV01 EQU   TCBABF
TCBGRPH  EQU   TCBABF
TCBNOCHK EQU   TCBABF
TCBMOD91 EQU   TCBABF
TCBCMPC  EQU   TCBCMP+1
TCBRV318 EQU   TCBCMSG
TCBRV317 EQU   TCBCIND
TCBRV316 EQU   TCBCWTO
TCBCASID EQU   TCBCDBL
TCBNOCC  EQU   TCBSTCC
TCBDMPO  EQU   TCBCPP
TCBCSTEP EQU   TCBCMPF
TCBCREQ  EQU   TCBCMPF
TCBTIO   EQU   TCB+12
TCBDEB   EQU   TCB+8
TCBPIEA  EQU   TCBPIE+1
TCBPM    EQU   TCBPMASK
@NM00047 EQU   TCBPMASK
TCBRBP   EQU   TCB
TCBFRS6  EQU   TCBFRS+24
TCBFRS4  EQU   TCBFRS+16
TCBFRS2  EQU   TCBFRS+8
TCBFRS0  EQU   TCBFRS
NEXTTCB  EQU   TCBWORDS
CVTLEVL  EQU   CVTRELNO+2
CVTNUMB  EQU   CVTRELNO
CVTMDL   EQU   CVTFIX+250
@NM00046 EQU   CVTFIX+248
@NM00045 EQU   CVTFIX
CVTRV482 EQU   CVTXTNT2+128
CVTRV481 EQU   CVTXTNT2+124
CVTRV480 EQU   CVTXTNT2+120
CVTRV479 EQU   CVTXTNT2+118
CVTRV478 EQU   CVTXTNT2+117
CVTRV477 EQU   CVTXTNT2+116
CVTRV476 EQU   CVTXTNT2+115
CVTRV475 EQU   CVTXTNT2+114
CVTRV474 EQU   CVTRV466
CVTRV473 EQU   CVTRV466
CVTRV472 EQU   CVTRV466
CVTRV471 EQU   CVTRV466
CVTRV470 EQU   CVTRV466
CVTRV469 EQU   CVTRV466
CVTRV468 EQU   CVTRV466
CVTRV467 EQU   CVTRV466
CVTRV465 EQU   CVTRV457
CVTRV464 EQU   CVTRV457
CVTRV463 EQU   CVTRV457
CVTRV462 EQU   CVTRV457
CVTRV461 EQU   CVTRV457
CVTRV460 EQU   CVTRV457
CVTRV459 EQU   CVTRV457
CVTRV458 EQU   CVTRV457
CVTRV456 EQU   CVTXTNT2+108
CVTRV455 EQU   CVTXTNT2+104
CVTRV454 EQU   CVTXTNT2+100
CVTRV453 EQU   CVTXTNT2+96
CVTRV452 EQU   CVTXTNT2+94
CVTRV451 EQU   CVTXTNT2+92
CVTRV450 EQU   CVTXTNT2+90
CVTRV449 EQU   CVTXTNT2+88
CVTRV448 EQU   CVTXTNT2+87
CVTRV447 EQU   CVTXTNT2+86
CVTRV446 EQU   CVTRV438
CVTRV445 EQU   CVTRV438
CVTRV444 EQU   CVTRV438
CVTRV443 EQU   CVTRV438
CVTRV442 EQU   CVTRV438
CVTRV441 EQU   CVTRV438
CVTRV440 EQU   CVTRV438
CVTRV439 EQU   CVTRV438
CVTRV437 EQU   CVTRV429
CVTRV436 EQU   CVTRV429
CVTRV435 EQU   CVTRV429
CVTRV434 EQU   CVTRV429
CVTRV433 EQU   CVTRV429
CVTRV432 EQU   CVTRV429
CVTRV431 EQU   CVTRV429
CVTRV430 EQU   CVTRV429
CVTRV428 EQU   CVTXTNT2+80
CVTRV427 EQU   CVTXTNT2+76
CVTRV426 EQU   CVTXTNT2+72
CVTRV425 EQU   CVTXTNT2+68
CVTATACT EQU   CVTATCVT
CVTRV423 EQU   CVTXTNT2+62
CVTRV422 EQU   CVTXTNT2+60
CVTRV421 EQU   CVTXTNT2+58
CVTRV420 EQU   CVTXTNT2+56
CVTRV419 EQU   CVTXTNT2+55
CVTRV418 EQU   CVTXTNT2+54
CVTRV417 EQU   CVTRV409
CVTRV416 EQU   CVTRV409
CVTRV415 EQU   CVTRV409
CVTRV414 EQU   CVTRV409
CVTRV413 EQU   CVTRV409
CVTRV412 EQU   CVTRV409
CVTRV411 EQU   CVTRV409
CVTRV410 EQU   CVTRV409
CVTRV408 EQU   CVTRV400
CVTRV407 EQU   CVTRV400
CVTRV406 EQU   CVTRV400
CVTRV405 EQU   CVTRV400
CVTRV404 EQU   CVTRV400
CVTRV403 EQU   CVTRV400
CVTRV402 EQU   CVTRV400
CVTRV401 EQU   CVTRV400
CVTICB   EQU   CVTXTNT2+48
CVTSKTA  EQU   CVTXTNT2+44
CVTCCVT  EQU   CVTXTNT2+40
CVTRSV98 EQU   CVTXTNT2+36
CVTRSV97 EQU   CVTXTNT2+34
CVTRSV96 EQU   CVTXTNT2+32
CVTOLTEP EQU   CVTXTNT2+28
CVTQIDA  EQU   CVTQID+1
CVTRSV95 EQU   CVTQID
CVTRSV94 EQU   CVTXTNT2+20
CVTRSV93 EQU   CVTXTNT2+16
CVTRSV92 EQU   CVTXTNT2+12
CVTDEBVR EQU   CVTXTNT2+8
CVTRSV91 EQU   CVTXTNT2+6
CVTRSV9H EQU   CVTFLGBT
CVTRSV9G EQU   CVTFLGBT
CVTRSV9F EQU   CVTFLGBT
CVTRSV9E EQU   CVTFLGBT
CVTRSV9D EQU   CVTFLGBT
CVTRSV9C EQU   CVTFLGBT
CVTVME   EQU   CVTFLGBT
CVTNPE   EQU   CVTFLGBT
CVTNUCLS EQU   CVTXTNT2+4
CVTDSSVA EQU   CVTDSSV+1
CVTRSV89 EQU   CVTDSSV
CVTRSV88 EQU   CVTXTNT1+8
CVTRSV87 EQU   CVTXTNT1+4
CVTFACHN EQU   CVTXTNT1
CVTRV488 EQU   CVTMAP+412
CVTRV487 EQU   CVTMAP+408
CVTRV486 EQU   CVTMAP+404
CVTRV485 EQU   CVTMAP+400
CVTACTAP EQU   CVTMAP+396
CVTAUTH  EQU   CVTMAP+392
CVTATMCA EQU   CVTATMCT+1
CVTATMST EQU   CVTATMCT
CVTRSV61 EQU   CVTMAP+384
CVTVOLT1 EQU   CVTVOLM1+1
CVTVOLI1 EQU   CVTVOLF1
CVTSTOA  EQU   CVTMAP+376
CVTRSV58 EQU   CVTMAP+374
CVTRSV57 EQU   CVTMAP+372
CVTDDCE  EQU   CVTMAP+368
CVTPNWFR EQU   CVTMAP+364
CVTSMF   EQU   CVTMAP+360
CVTSULK  EQU   CVTMAP+358
CVTSLKO  EQU   CVTSYSK
CVTSLKP  EQU   CVTSYSK
CVTSLKQ  EQU   CVTSYSK
CVTSLKR  EQU   CVTSYSK
CVTRSV56 EQU   CVTSYSK
CVTRSV55 EQU   CVTSYSK
CVTRSV54 EQU   CVTSYSK
CVTRSV53 EQU   CVTSYSK
CVTRSV52 EQU   CVTA1F1
CVTRSV51 EQU   CVTA1F1
CVTRSV50 EQU   CVTA1F1
CVTRSV49 EQU   CVTA1F1
CVTRSV48 EQU   CVTA1F1
CVTRSV47 EQU   CVTA1F1
CVTSRSW  EQU   CVTA1F1
CVTPFSW  EQU   CVTA1F1
CVTPCVT  EQU   CVTMAP+352
CVTRSV46 EQU   CVTMAP+344
CVTRSV45 EQU   CVTMAP+340
CVTRSV44 EQU   CVTMAP+338
CVTRSV43 EQU   CVTMAP+336
CVTHJESA EQU   CVTHJES+1
CVTRSV42 EQU   CVTHJES
CVTEXT2A EQU   CVTEXT2+1
CVTRSV41 EQU   CVTEXT2
CVTAPFA  EQU   CVTAPF+1
CVTRSV40 EQU   CVTAPF
CVTRV518 EQU   CVTINTLA
CVTRV517 EQU   CVTERPV
CVTEORM  EQU   CVTMAP+312
CVTMCHPR EQU   CVTMAP+308
CVTTZ    EQU   CVTMAP+304
CVTJEPS  EQU   CVTMAP+300
CVTJESCT EQU   CVTMAP+296
CVTMODE  EQU   CVTMAP+292
CVTPTRV  EQU   CVTMAP+288
CVTREAL  EQU   CVTMAP+284
CVTRSV39 EQU   CVTMAP+280
CVTRSV38 EQU   CVTMAP+276
CVTDMSRA EQU   CVTDMSR+1
CVTRV634 EQU   CVTDMSRF
CVTRV633 EQU   CVTDMSRF
CVTRV632 EQU   CVTDMSRF
CVTRV631 EQU   CVTDMSRF
CVTRV630 EQU   CVTDMSRF
CVTRV629 EQU   CVTDMSRF
CVTUDUMP EQU   CVTDMSRF
CVTSDUMP EQU   CVTDMSRF
CVTQMSGA EQU   CVTQMSG+1
CVTRSV36 EQU   CVTQMSG
CVTPURGA EQU   CVTPURG+1
CVTRSV35 EQU   CVTPURG
CVTATERA EQU   CVTATER+1
CVTSYST  EQU   CVTATER
CVTVOLT2 EQU   CVTTAT
CVTVOLI2 EQU   CVTVOLF2
CVTAQAVB EQU   CVTAQAVT+1
CVTRSV34 EQU   CVTTCMFG
CVTRSV33 EQU   CVTTCMFG
CVTRSV32 EQU   CVTTCMFG
CVTRSV31 EQU   CVTTCMFG
CVTRSV30 EQU   CVTTCMFG
CVTRSV29 EQU   CVTTCMFG
CVTRSV28 EQU   CVTTCMFG
CVTTCRDY EQU   CVTTCMFG
CVTGTFA  EQU   CVTGTF+1
CVTRSV27 EQU   CVTGTFST
CVTRNIO  EQU   CVTGTFST
CVTUSR   EQU   CVTGTFST
CVTRV318 EQU   CVTFORM
CVTRV317 EQU   CVTTMODE
CVTRV316 EQU   CVTSTATE
CVTRV315 EQU   CVTGTFS
CVTGTFAV EQU   CVTGTFS
CVT0SCR1 EQU   CVTMAP+232
CVTRV515 EQU   CVTMAP+228
CVTRMS   EQU   CVTMAP+224
CVTPATCH EQU   CVTMAP+220
CVTTSCE  EQU   CVTMAP+216
CVTLNKSC EQU   CVTMAP+214
CVTQABST EQU   CVTMAP+212
CVTMDLDS EQU   CVTMAP+208
CVTUSER  EQU   CVTMAP+204
CVTABEND EQU   CVTMAP+200
CVTSMCA  EQU   CVTMAP+196
CVTRSV18 EQU   CVTMAP+192
CVTQLPAQ EQU   CVTMAP+188
CVTQCDSR EQU   CVTMAP+184
CVTRSV17 EQU   CVTOPTB
CVTRSV16 EQU   CVTOPTB
CVTFP    EQU   CVTOPTB
CVTAPTHR EQU   CVTOPTB
CVTNLOG  EQU   CVTOPTB
CVTTOD   EQU   CVTOPTB
CVTCTIMS EQU   CVTOPTB
CVTPROT  EQU   CVTOPTB
CVTXPFP  EQU   CVTOPTA
CVTASCII EQU   CVTOPTA
CVTRSV13 EQU   CVTOPTA
CVTRSV12 EQU   CVTOPTA
CVTNIP   EQU   CVTOPTA
CVTDDR   EQU   CVTOPTA
CVTAPR   EQU   CVTOPTA
CVTCCH   EQU   CVTOPTA
CVTSNCTR EQU   CVTMAP+180
CVTQMWR  EQU   CVTMAP+176
CVTQOCR  EQU   CVTMAP+172
CVT1EF00 EQU   CVTMAP+168
CVTMZ00  EQU   CVTMAP+164
CVTSV76Q EQU   CVTSV76C
CVTRSV11 EQU   CVTMAP+156
CVT0PT01 EQU   CVTMAP+152
CVTMSER  EQU   CVTMAP+148
CVTRV516 EQU   CVTIERLC
CVTILCH  EQU   CVTMAP+140
CVT0DS   EQU   CVTMAP+136
CVTFBOSV EQU   CVTMAP+132
CVTNUCB  EQU   CVTMAP+128
CVTIXAVL EQU   CVTMAP+124
CVTSV76M EQU   CVTIOQET
CVTDCBA  EQU   CVTMAP+117
CVTMVS2  EQU   CVTDCB
CVT6DAT  EQU   CVTDCB
CVT4MPS  EQU   CVTDCB
CVTRSV09 EQU   CVTDCB
CVT4MS1  EQU   CVTDCB
CVT2SPS  EQU   CVTDCB
CVT1SSS  EQU   CVTDCB
CVTRSV08 EQU   CVTDCB
CVTSTB   EQU   CVTMAP+112
CVTQTD00 EQU   CVTMAP+108
CVTQTE00 EQU   CVTMAP+104
CVTCUCB  EQU   CVTMAP+100
CVTSJQ   EQU   CVTMAP+96
CVTPBLDL EQU   CVTMAP+92
CVTTPC   EQU   CVTMAP+88
CVTSVDCB EQU   CVTMAP+84
CVTBRET  EQU   CVTMAP+82
CVTEXIT  EQU   CVTMAP+80
CVT0FN00 EQU   CVTMAP+76
CVTDARA  EQU   CVTDAR+1
CVTRSV07 EQU   CVTFLGS1
CVTRSV06 EQU   CVTFLGS1
CVTRSV05 EQU   CVTFLGS1
CVTRSV04 EQU   CVTFLGS1
CVTRSV03 EQU   CVTFLGS1
CVTRSV02 EQU   CVTFLGS1
CVTRSV01 EQU   CVTFLGS1
CVTDMPLK EQU   CVTFLGS1
CVTXITP  EQU   CVTMAP+68
CVTZDTAB EQU   CVTMAP+64
CVTMSLT  EQU   CVTMAP+60
CVTDATE  EQU   CVTMAP+56
CVTBTERM EQU   CVTMAP+52
CVTSYSAD EQU   CVTMAP+48
CVTXTLER EQU   CVTMAP+44
CVTILK2  EQU   CVTMAP+40
CVTILK1  EQU   CVTMAP+36
CVTPRLTV EQU   CVTMAP+32
CVTPCNVT EQU   CVTMAP+28
CVT0VL00 EQU   CVTMAP+24
CVTXAPG  EQU   CVTMAP+20
CVTBUF   EQU   CVTMAP+16
CVTJOB   EQU   CVTMAP+12
CVTLINK  EQU   CVTMAP+8
CVT0EF00 EQU   CVTMAP+4
CVT      EQU   CVTMAP
VARINFO  EQU   VARFIELD+2
@NM00044 EQU   EXTRCDPT+3
RCDSIZ   EQU   CATRCD+45
@NM00043 EQU   CATRCD+26
RCDDICTS EQU   CATRCD+22
RCDRACTS EQU   CATRCD+18
RCDCRADT EQU   CATRCD+14
RCDCRACI EQU   CATRCD+11
RCDCRAVL EQU   CATRCD+5
RCDRELID EQU   CATRCD+4
CATGOGC  EQU   CATGOGC1
@NM00042 EQU   CATGOFLG
CCACPE4  EQU   CCARAB+16
@NM00041 EQU   CCARAB+2
CCARABRI EQU   CCARAB+1
CCARBUPD EQU   CCARABFL
@NM00040 EQU   CCARABFL
CCARBPA  EQU   CCARABFL
@NM00039 EQU   DIC2FLGS
DIC2UPGD EQU   DIC2FLGS
DIC2SCRA EQU   DIC2FLGS
DIC2MV   EQU   DIC2FLGS
DIC2COMB EQU   DIC2FLGS
DICTLC   EQU   DICTENT+2
@NM00038 EQU   DICTFLGS
DICTUPGD EQU   DICTFLGS
DICTSCRA EQU   DICTFLGS
DICTMV   EQU   DICTFLGS
DICTFLG  EQU   DICTFLGS
DICTCOMB EQU   DICTFLGS
DICTVAR  EQU   DICTFLGS
ENTNAMEV EQU   ENTNAMES+1
ENTNAMET EQU   ENTNAMES
WKALEN2  EQU   USERWKA+2
WKALEN1  EQU   USERWKA
@NM00037 EQU   CTGFLDRE
CTGFLDNO EQU   CTGFL
CTGFIELD EQU   CTGPL+28
CTGPSWD  EQU   CTGJSCB
@NM00035 EQU   CTGFBFLG
CTGNGDSN EQU   CTGFBFLG
CTGGDGB  EQU   CTGFBFLG
CTGKEEP  EQU   CTGFBFLG
CTGPAR   EQU   CTGFBFLG
CTGFDBK  EQU   CTGNEWNM
CTGNOFLD EQU   CTGPL+19
CTGTYPE  EQU   CTGPL+18
@NM00034 EQU   CTGDSORG
CTGOPTNS EQU   CTGDSORG
@NM00033 EQU   CTGOPTN4
CTGTIOT  EQU   CTGOPTN4
CTGBYPMT EQU   CTGOPTN4
CTGCOIN  EQU   CTGOPTN4
@NM00032 EQU   CTGOPTN4
CTGDOCAT EQU   CTGOPTN4
CTGLBASE EQU   CTGOPTN4
CTGAM0   EQU   CTGOPTN3
CTGNUM   EQU   CTGOPTN3
CTGSRH   EQU   CTGOPTN3
CTGGDGL  EQU   CTGOPTN3
CTGSUPLT EQU   CTGOPTN3
CTGFUNC  EQU   CTGOPTN3
@NM00031 EQU   CTGOPTN2
CTGSCR   EQU   CTGOPTN2
CTGOVRID EQU   CTGOPTN2
CTGDISC  EQU   CTGOPTN2
CTGGTNXT EQU   CTGOPTN2
CTGRCATN EQU   CTGVMNT
CTGGTALL EQU   CTGREL
CTGNSVS  EQU   CTGEXT
CTGGENLD EQU   CTGOPTN1
CTGCNAME EQU   CTGOPTN1
CTGNAME  EQU   CTGOPTN1
CTGREAD  EQU   CTGOPTN1
CTGUPD   EQU   CTGOPTN1
CTGCI    EQU   CTGOPTN1
CTGMAST  EQU   CTGOPTN1
CTGBYPSS EQU   CTGOPTN1
CCAEND   EQU   IGGCCA+1492
CCASAVMN EQU   CCADGDGA
CCARETRX EQU   CCAERCDX+1
CCARESNX EQU   CCAERCDX
CCAMODDX EQU   CCAPROBX
CCASMFCD EQU   CCASMFP+3
CCASMFRC EQU   CCASMFP+2
CCASMFMD EQU   CCASMFP
CCAREWKA EQU   IGGCCA+1476
CCAVTS   EQU   IGGCCA+1468
CCARAVCA EQU   IGGCCA+1460
CCARANCA EQU   IGGCCA+1452
CCADICTS EQU   IGGCCA+1448
CCASUMTT EQU   IGGCCA+1445
ENQPCCB  EQU   CCAFLG10
CCADEFUN EQU   CCAFLG10
CCAPRANX EQU   CCAFLG10
CCARARTC EQU   CCAFLG10
CCARAFEV EQU   CCAFLG10
CCACATAC EQU   CCAFLG10
CCAPDMW  EQU   CCAFLG10
CCAINCPL EQU   CCAFLG10
@NM00030 EQU   CCARALSA+2
CCACRABT EQU   CCARALSA
CCARAREC EQU   IGGCCA+1436
CCARARBA EQU   IGGCCA+1432
CCARARPL EQU   IGGCCA+1428
CCARAACB EQU   IGGCCA+1424
CCACRACI EQU   IGGCCA+1420
CCASBASE EQU   IGGCCA+1417
CCATNQCT EQU   IGGCCA+1416
CCACUMPL EQU   IGGCCA+1412
CCADSPWA EQU   CCABZSAV
CCAMODNM EQU   CCAREGS+4
@NM00029 EQU   CCAREGS
@NM00028 EQU   CCAFLG11
CCAF11B6 EQU   CCAFLG11
CCAF11B5 EQU   CCAFLG11
@NM00027 EQU   CCAFLG11
@NM00026 EQU   IGGCCA+1057
@NM00025 EQU   CCARVFG1
RVESBOR  EQU   CCARVFG1
RVESBO   EQU   CCARVFG1
RVCMSFG  EQU   CCARVFG1
RVARFI   EQU   CCARVFG1
RVCCAV   EQU   CCARVFG1
ARFSBECH EQU   CCAARFWA+12
ARFSBSCH EQU   CCAARFWA+8
ARFGMADR EQU   CCAARFWA+4
ARFLEN   EQU   ARFGMLEN+1
ARFGMLP  EQU   ARFGMLEN
CCAMNADR EQU   CCAMNCAT+252
CCAMNLEN EQU   CCAMNCAT+249
CCAMNLL  EQU   CCAMNCAT+248
MNATARG2 EQU   CCAMNAT+244
MNATARG1 EQU   CCAMNAT+241
MNATSCLS EQU   MNATFLGS
@NM00024 EQU   MNATFLGS
MNATVAL  EQU   MNATFLGS
@NM00023 EQU   CCAMNAT+1
@NM00022 EQU   MNATTOP
MNATFULL EQU   MNATTOP
CCABMRB2 EQU   IGGCCA+740
CCABMRB1 EQU   IGGCCA+736
CCABMWK4 EQU   IGGCCA+732
CCABMWK3 EQU   IGGCCA+728
CCABMWK2 EQU   IGGCCA+724
CCABMWK1 EQU   IGGCCA+720
CCABMSTR EQU   IGGCCA+718
CCABMBYT EQU   IGGCCA+716
CCABMBTL EQU   IGGCCA+714
CCABMBT1 EQU   IGGCCA+712
CCABMEND EQU   IGGCCA+708
CCABMPTR EQU   IGGCCA+704
CCABMGOP EQU   IGGCCA+700
CCABMPAD EQU   IGGCCA+699
@NM00021 EQU   IGGCCA+697
CCABMOST EQU   CCABMOFG
CCABMOTR EQU   CCABMOUT+2
CCABMONN EQU   CCABMOUT
@NM00020 EQU   CCABMINP+7
CCABMLST EQU   CCABMFLG
CCABMCCK EQU   CCABMFLG
CCABMSET EQU   CCABMFLG
CCABMCHK EQU   CCABMFLG
CCABMST  EQU   CCABMFLG
CCABMMIN EQU   CCABMINP+4
CCABMLIM EQU   CCABMINP+2
CCABMTRK EQU   CCABMINP
CCAR14S  EQU   IGGCCA+680
CCAXLATE EQU   IGGCCA+640
CCADEL2  EQU   IGGCCA+637
CCADEL1  EQU   IGGCCA+634
CCAVAR1  EQU   IGGCCA+614
CCAVAR   EQU   IGGCCA+594
CCADELN  EQU   IGGCCA+592
CCAVARPT EQU   IGGCCA+588
CCARBASE EQU   IGGCCA+584
CCARRAB  EQU   IGGCCA+580
CCAVARLN EQU   IGGCCA+578
CCACI3   EQU   IGGCCA+575
CCACI2   EQU   IGGCCA+572
CCACI1   EQU   IGGCCA+569
CCACHAIN EQU   IGGCCA+566
CCASMFLN EQU   IGGCCA+564
CCASMFG2 EQU   CCASMFLG+1
@NM00019 EQU   CCASMFG1
CCASMFAL EQU   CCASMFSR
CCASMFDF EQU   CCASMFUC
CCASMFCT EQU   IGGCCA+560
CCASMFRD EQU   IGGCCA+556
CCANORBA EQU   IGGCCA+555
CCARESUM EQU   CCAFLG9
CCARAICI EQU   CCAFLG9
CCARAACT EQU   CCAFLG9
CCAUCRA  EQU   CCAFLG9
CCARACR  EQU   CCAFLG9
CCARALRD EQU   CCAFLG9
CCARAEOV EQU   CCAFLG9
CCARABYC EQU   CCAFLG9
CCAAUCAT EQU   CCAFLG8
CCALEOD  EQU   CCAFLG8
CCAVRIND EQU   CCAFLG8
CCALPIND EQU   CCAFLG8
CCASCICK EQU   CCAFLG8
CCASCRA  EQU   CCAFLG8
CCAVBUFI EQU   CCAFLG8
CCADSRCL EQU   CCAFLG8
CCACRABU EQU   CCAFLG7
CCAFEOV  EQU   CCAFLG7
CCAROREQ EQU   CCAFLG7
CCAONCE  EQU   CCAFLG7
CCASMFBR EQU   CCAFLG7
CCASMFA  EQU   CCAFLG7
CCASMFEX EQU   CCAFLG7
CCALSP   EQU   CCAFLG7
CCALCPL  EQU   IGGCCA+548
CCASMFPT EQU   IGGCCA+544
CCAALPTR EQU   IGGCCA+540
CCAILNG2 EQU   IGGCCA+536
CCAILNG3 EQU   IGGCCA+532
CCASDWAP EQU   IGGCCA+528
CCACWAP  EQU   IGGCCA+524
CCACDTCT EQU   IGGCCA+522
CCADTCT  EQU   IGGCCA+520
CCACDTA  EQU   IGGCCA+516
CCADTA   EQU   IGGCCA+512
CCASVCI  EQU   IGGCCA+506
CCADISP  EQU   IGGCCA+504
CCAREPCT EQU   IGGCCA+502
CCADIFF  EQU   IGGCCA+500
CCADLEN  EQU   IGGCCA+498
CCAIXTPL EQU   IGGCCA+496
CCAGRHI1 EQU   CCASSEQ
CCARCDID EQU   CCAGRGC
CCASAVID EQU   IGGCCA+492
CCARABSM EQU   CCAIDPT3
CCAIDPT2 EQU   IGGCCA+476
CCASMFIX EQU   IGGCCA+474
CCACNIX  EQU   IGGCCA+472
CCATLEN  EQU   CCATLNG
CCATT    EQU   CCARBA+10
CCACCHH2 EQU   CCACRADT
CCACCHH1 EQU   CCACRAVL+2
CCASS    EQU   CCACRAVL
CCAIXREL EQU   IGGCCA+404
CCAIXFPL EQU   IGGCCA+402
@NM00018 EQU   IGGCCA+400
CCALREL1 EQU   CCALREL
CCAGC    EQU   IGGCCA+395
CCAMCPL  EQU   CCAXCPL
CCATFLPT EQU   CCAFLPT
CCACPE71 EQU   IGGCCA+352
CCARABSE EQU   CCACPE61
CCACPE53 EQU   IGGCCA+336
CCACPE52 EQU   IGGCCA+332
CCACPE51 EQU   IGGCCA+328
CCALUME  EQU   IGGCCA+324
CCAEXCMS EQU   CCACMS+4
CCACMSWA EQU   CCACMS
CCARPRM  EQU   IGGCCA+312
@NM00017 EQU   CCAMSSPL+10
CCAMNSPL EQU   CCAMSSPL+9
@NM00016 EQU   CCAMSSPL+8
CCAMNPTR EQU   CCAMSSPL+4
CCAMNLLP EQU   CCAMSSPL
CCAMLRET EQU   IGGCCA+296
CCAEDUCB EQU   CCAEQDQ+12
CCAEDRNM EQU   CCAEQDQ+8
CCAEDQNM EQU   CCAEQDQ+4
CCAEDRCD EQU   CCAEQDQ+3
@NM00015 EQU   CCAEDOPT
CCAEDSHR EQU   CCAEDOPT
CCAEDRLN EQU   CCAEQDQ+1
CCAEDXFF EQU   CCAEQDQ
CCAASCI  EQU   IGGCCA+271
CCAASCIX EQU   IGGCCA+270
CCACRRP  EQU   IGGCCA+269
CCAASCIK EQU   IGGCCA+268
CCAEXTTH EQU   CCAEXTDE+6
CCAEXTHH EQU   CCAEXTAD+2
CCAEXTCC EQU   CCAEXTAD
CCAEXTSS EQU   CCAEXTDE
CCASSVOL EQU   CCADESA+2
CCAIXEXT EQU   CCADESA+1
CCANDEXT EQU   CCADESA
CCARPL1  EQU   IGGCCA+220
CCAQLEN  EQU   IGGCCA+219
CCASC    EQU   IGGCCA+218
CCATQDB  EQU   CCATIQRN+2
CCATASID EQU   CCATIQRN
CCARPLT  EQU   IGGCCA+211
CCARPLX  EQU   IGGCCA+210
CCARPLF  EQU   IGGCCA+209
CCARPLK  EQU   IGGCCA+208
CCACPE45 EQU   CCAR5SEG+8
CCACPE35 EQU   CCAR5SEG+4
CCACPE25 EQU   CCAR5SEG
CCAR5REC EQU   CCARAB5+4
@NM00014 EQU   CCARAB5+2
CCAR5RPL EQU   CCARAB5+1
CCAR5UPD EQU   CCAR5FLG
@NM00013 EQU   CCAR5FLG
CCAR5PA  EQU   CCAR5FLG
CCAR5WR  EQU   CCAR5FLG
CCAR5U2  EQU   CCAR5FLG
CCAR5U1  EQU   CCAR5FLG
CCAR5UR  EQU   CCAR5FLG
CCACPE44 EQU   CCAR4SEG+8
CCACPE34 EQU   CCAR4SEG+4
CCACPE24 EQU   CCAR4SEG
CCAR4REC EQU   CCARAB4+4
@NM00012 EQU   CCARAB4+2
CCAR4RPL EQU   CCARAB4+1
CCAR4UPD EQU   CCAR4FLG
@NM00011 EQU   CCAR4FLG
CCAR4PA  EQU   CCAR4FLG
CCAR4WR  EQU   CCAR4FLG
CCAR4U2  EQU   CCAR4FLG
CCAR4U1  EQU   CCAR4FLG
CCAR4UR  EQU   CCAR4FLG
CCACPE43 EQU   CCAR3SEG+8
CCACPE33 EQU   CCAR3SEG+4
CCACPE23 EQU   CCAR3SEG
CCAR3REC EQU   CCARAB3+4
@NM00010 EQU   CCARAB3+2
CCAR3RPL EQU   CCARAB3+1
CCAR3UPD EQU   CCAR3FLG
@NM00009 EQU   CCAR3FLG
CCAR3PA  EQU   CCAR3FLG
CCAR3WR  EQU   CCAR3FLG
CCAR3U2  EQU   CCAR3FLG
CCAR3U1  EQU   CCAR3FLG
CCAR3UR  EQU   CCAR3FLG
CCACPE42 EQU   CCAR2SEG+8
CCACPE32 EQU   CCAR2SEG+4
CCACPE22 EQU   CCAR2SEG
CCAR2REC EQU   CCARAB2+4
@NM00008 EQU   CCARAB2+2
CCAR2RPL EQU   CCARAB2+1
CCAR2UPD EQU   CCAR2FLG
@NM00007 EQU   CCAR2FLG
CCAR2PA  EQU   CCAR2FLG
CCAR2WR  EQU   CCAR2FLG
CCAR2U2  EQU   CCAR2FLG
CCAR2U1  EQU   CCAR2FLG
CCAR2UR  EQU   CCAR2FLG
CCACPE41 EQU   CCAR1SEG+8
CCACPE31 EQU   CCAR1SEG+4
CCACPE21 EQU   CCAR1SEG
CCAR1REC EQU   CCARAB1+4
@NM00006 EQU   CCARAB1+2
CCAR1RPL EQU   CCARAB1+1
CCAR1UPD EQU   CCAR1FLG
@NM00005 EQU   CCAR1FLG
CCAR1PA  EQU   CCAR1FLG
CCAR1WR  EQU   CCAR1FLG
CCAR1U2  EQU   CCAR1FLG
CCAR1U1  EQU   CCAR1FLG
CCAR1UR  EQU   CCAR1FLG
CCACPE40 EQU   CCAR0SEG+8
CCACPE30 EQU   CCAR0SEG+4
CCACPE20 EQU   CCAR0SEG
CCAR0REC EQU   CCARAB0+4
@NM00004 EQU   CCARAB0+2
CCAR0RPL EQU   CCARAB0+1
CCAR0UPD EQU   CCAR0FLG
@NM00003 EQU   CCAR0FLG
CCAR0PA  EQU   CCAR0FLG
CCAR0WR  EQU   CCAR0FLG
CCAR0U2  EQU   CCAR0FLG
CCAR0U1  EQU   CCAR0FLG
CCAR0UR  EQU   CCAR0FLG
@NM00002 EQU   CCASRCH+3
CCASRCIN EQU   CCASRID
CCANPCCB EQU   IGGCCA+36
CCADPL   EQU   CCARB
CCALBCYL EQU   CCATCB
CCAREUSE EQU   CCAFLG6
CCAINIT  EQU   CCAFLG6
CCAMNOSP EQU   CCAFLG6
CCADELP  EQU   CCAFLG6
CCAMCODR EQU   CCAFLG6
CCAMODPA EQU   CCAFLG5
CCAMEX1  EQU   CCAFLG5
CCAMEX   EQU   CCAFLG5
CCAMEX2  EQU   CCAFLG5
CCAF4BYS EQU   CCAFLG4
CCAF4DRQ EQU   CCAFLG4
CCAELC2  EQU   CCAFLG3
CCANF    EQU   CCAFLG3
CCAEXGR2 EQU   CCAFLG3
CCAGDSP  EQU   CCAFLG3
CCAGC4   EQU   CCAFLG3
CCAEXGR1 EQU   CCAFLG3
CCAF2SMO EQU   CCAFLG2
CCAF2CB  EQU   CCAF2COB
CCAF2CO  EQU   CCAF2COB
CCAF2RHS EQU   CCAFLG2
CCAF2XEQ EQU   CCAFLG2
CCAF2CCT EQU   CCAFLG2
CCAF2NVC EQU   CCAFLG2
CCAF2SYS EQU   CCAFLG2
CCAF1DK  EQU   CCAFLG1
CCAF1CR  EQU   CCAFLG1
CCAF1LRD EQU   CCAFLG1
CCAF1CNS EQU   CCAFLG1
CCAF1LPS EQU   CCAFLG1
CCACD2   EQU   IGGCCA+13
@NM00001 EQU   IGGCCA+8
CCACDR   EQU   CCAREASN
CCAMODID EQU   CCAPROB
CCASZ    EQU   IGGCCA+2
CCAID    EQU   IGGCCA
@NM00074 EQU   PSA+3668
PSASTAK  EQU   PSA+3072
@NM00073 EQU   PSA+1048
PSAUSEND EQU   PSA+1048
PSARV062 EQU   PSA+1044
PSACDAL  EQU   PSA+1040
PSAWTCOD EQU   PSA+1036
PSAATCVT EQU   PSA+1032
PSAPCPSW EQU   PSA+1024
PSAPIR2  EQU   PSA+1020
PSARV059 EQU   PSA+1018
PSASVC13 EQU   PSA+1016
PSALSFCC EQU   PSA+1012
PSASFACC EQU   PSA+1008
PSASTOP  EQU   PSA+992
PSASTART EQU   PSA+976
PSARSPSW EQU   PSA+968
PSASRPSW EQU   PSA+960
PSARV045 EQU   PSA+892
PSARV044 EQU   PSA+888
PSARV043 EQU   PSA+884
PSARV042 EQU   PSA+880
PSARV041 EQU   PSA+876
PSARV040 EQU   PSA+872
PSARV025 EQU   PSA+868
PSADSSED EQU   PSA+868
PSADSSPR EQU   PSA+864
PSADSSFW EQU   PSA+860
PSADSS14 EQU   PSA+856
PSADSSPP EQU   PSA+848
PSADSSRP EQU   PSA+840
PSADSS05 EQU   PSADSSF4
PSADSS10 EQU   PSADSSF4
PSADSSVE EQU   PSADSSF4
PSADSSDE EQU   PSADSSF4
PSADSSC0 EQU   PSADSSF4
PSADSSIE EQU   PSADSSF4
PSADSS12 EQU   PSADSSF4
PSADSSRC EQU   PSADSSF4
PSARV057 EQU   PSADSSF3
PSARV056 EQU   PSADSSF3
PSARV055 EQU   PSADSSF3
PSADSSMC EQU   PSADSSF3
PSADSSRW EQU   PSADSSF3
PSADSSNM EQU   PSADSSF3
PSADSSES EQU   PSADSSF3
PSADSSGP EQU   PSADSSF3
PSADSSF2 EQU   PSADSSFL+1
PSADSSPI EQU   PSADSSF1
PSADSSOI EQU   PSADSSF1
PSADSSSP EQU   PSADSSF1
PSADSSTP EQU   PSADSSF1
PSADSSDW EQU   PSADSSF1
PSADSSDD EQU   PSADSSF1
PSADSSDM EQU   PSADSSF1
PSADSSMV EQU   PSADSSF1
PSADSSTS EQU   PSA+816
PSADSSWK EQU   PSA+812
PSADSSR3 EQU   PSA+808
PSADSSR2 EQU   PSA+804
PSADSSRS EQU   PSA+800
PSASTOR  EQU   PSA+796
PSACPUSA EQU   PSA+794
PSAVSTAP EQU   PSA+792
PSAWKVAP EQU   PSA+788
PSAWKRAP EQU   PSA+784
PSAMCHIC EQU   PSA+783
PSARV061 EQU   PSA+782
PSASYMSK EQU   PSA+781
PSAMCHFL EQU   PSA+780
PSACR0   EQU   PSA+776
PSAPSWSV EQU   PSA+768
PSALITA  EQU   PSA+764
PSACLHS  EQU   PSAHLHI
PSALKR15 EQU   PSALKSA+60
PSALKR14 EQU   PSALKSA+56
PSALKR13 EQU   PSALKSA+52
PSALKR12 EQU   PSALKSA+48
PSALKR11 EQU   PSALKSA+44
PSALKR10 EQU   PSALKSA+40
PSALKR9  EQU   PSALKSA+36
PSALKR8  EQU   PSALKSA+32
PSALKR7  EQU   PSALKSA+28
PSALKR6  EQU   PSALKSA+24
PSALKR5  EQU   PSALKSA+20
PSALKR4  EQU   PSALKSA+16
PSALKR3  EQU   PSALKSA+12
PSALKR2  EQU   PSALKSA+8
PSALKR1  EQU   PSALKSA+4
PSALKR0  EQU   PSALKSA
PSARV023 EQU   PSACLHT+52
PSALOCAL EQU   PSACLHT+48
PSACMSL  EQU   PSACLHT+44
PSAOPTL  EQU   PSACLHT+40
PSATPACL EQU   PSACLHT+36
PSATPDNL EQU   PSACLHT+32
PSATPNCL EQU   PSACLHT+28
PSAIOSLL EQU   PSACLHT+24
PSAIOSUL EQU   PSACLHT+20
PSAIOSCL EQU   PSACLHT+16
PSAIOSSL EQU   PSACLHT+12
PSASALCL EQU   PSACLHT+8
PSAASML  EQU   PSACLHT+4
PSADISPL EQU   PSACLHT
PSASRSA  EQU   PSA+636
PSARV050 EQU   PSA+634
PSADSSGO EQU   PSA+633
PSARECUR EQU   PSA+632
PSAHLHIS EQU   PSA+628
PSAIPCSA EQU   PSA+624
@NM00072 EQU   PSA+621
PSAIPCDM EQU   PSA+620
PSAIPCD  EQU   PSA+616
@NM00071 EQU   PSA+613
PSAIPCRM EQU   PSA+612
PSAIPCR  EQU   PSA+608
PSAMCHEX EQU   PSA+600
PSAMPSW  EQU   PSA+592
PSAEXPS2 EQU   PSA+584
PSAEXPS1 EQU   PSA+576
PSAPIREG EQU   PSA+572
PSARSREG EQU   PSA+568
PSAGPREG EQU   PSA+556
PSARV022 EQU   PSASUP4
PSARV021 EQU   PSASUP4
PSARV020 EQU   PSASUP4
PSARV019 EQU   PSASUP4
PSARV018 EQU   PSASUP4
PSARV017 EQU   PSASUP4
PSARV016 EQU   PSASUP4
PSARV015 EQU   PSASUP4
PSARV014 EQU   PSASUP3
PSARV013 EQU   PSASUP3
PSARV012 EQU   PSASUP3
PSAESTA  EQU   PSASUP3
PSASPR   EQU   PSASUP3
PSAPSREG EQU   PSASUP3
PSAPI2   EQU   PSASUP3
PSAIOSUP EQU   PSASUP3
PSALCR   EQU   PSASUP2
PSARTM   EQU   PSASUP2
PSAACR   EQU   PSASUP2
PSAIPCE2 EQU   PSASUP2
PSAIPCES EQU   PSASUP2
PSAIPCEC EQU   PSASUP2
PSAGTF   EQU   PSASUP2
PSAIPCRI EQU   PSASUP2
PSATYPE6 EQU   PSASUP1
PSATCTL  EQU   PSASUP1
PSADISP  EQU   PSASUP1
PSALOCK  EQU   PSASUP1
PSAPI    EQU   PSASUP1
PSAEXT   EQU   PSASUP1
PSASVC   EQU   PSASUP1
PSAIO    EQU   PSASUP1
PSAAOLD  EQU   PSA+548
PSAANEW  EQU   PSA+544
PSATOLD  EQU   PSA+540
PSATNEW  EQU   PSA+536
PSALCCAR EQU   PSA+532
PSALCCAV EQU   PSA+528
PSAPCCAR EQU   PSA+524
PSAPCCAV EQU   PSA+520
PSACPULA EQU   PSA+518
PSACPUPA EQU   PSA+516
PSAPSA   EQU   PSA+512
FLCHDEND EQU   PSA+512
FLCCRSAV EQU   FLCMCLA+280
FLCGRSAV EQU   FLCMCLA+216
FLCFPSAV EQU   FLCMCLA+184
FLCFLA   EQU   FLCMCLA+88
FLCRGNCD EQU   FLCMCLA+84
FLCFSAA  EQU   FLCFSA+1
@NM00070 EQU   FLCFSA
@NM00069 EQU   FLCMCLA+72
FLCMCIC  EQU   FLCMCLA+64
@NM00068 EQU   FLCMCLA+20
FLCIOAA  EQU   FLCIOA+1
@NM00067 EQU   FLCIOA
@NM00066 EQU   FLCMCLA+15
@NM00065 EQU   FLCMCLA+14
@NM00064 EQU   FLCMCLA+12
FLCLCL   EQU   FLCMCLA+8
FLCIOELA EQU   FLCIOEL+1
@NM00063 EQU   FLCIOEL
FLCCHNID EQU   FLCMCLA
@NM00062 EQU   PSA+160
FLCMTRCD EQU   PSA+157
@NM00061 EQU   PSA+156
FLCPERA  EQU   FLCPER+1
@NM00060 EQU   FLCPER
@NM00059 EQU   PSA+151
FLCPERCD EQU   PSA+150
FLCMCNUM EQU   PSA+149
@NM00058 EQU   PSA+148
FLCTEAA  EQU   FLCTEA+1
@NM00057 EQU   FLCTEA
PSAPIPC  EQU   PSAPICOD
PSAPIMC  EQU   PSAPICOD
PSAPIPER EQU   PSAPICOD
PSARV049 EQU   FLCPICOD
FLCPILCB EQU   FLCPIILC
@NM00056 EQU   FLCPIILC
@NM00055 EQU   PSAEPPSW
FLCSVCN  EQU   PSAESPSW+2
FLCSILCB EQU   FLCSVILC
@NM00054 EQU   FLCSVILC
@NM00053 EQU   PSAESPSW
FLCEICOD EQU   PSAEEPSW+2
PSASPAD  EQU   PSAEEPSW
@NM00052 EQU   PSA+128
FLCINPSW EQU   PSA+120
FLCMNPSW EQU   PSA+112
FLCPNPSW EQU   PSA+104
FLCSNPSW EQU   PSA+96
FLCENPSW EQU   PSA+88
FLCTRACE EQU   PSA+84
FLCTIMER EQU   PSA+80
FLCCVT2  EQU   PSA+76
FLCCAW   EQU   PSA+72
FLCCSW   EQU   PSA+64
FLCIOPSW EQU   PSA+56
FLCMOPSW EQU   PSA+48
FLCPOPSW EQU   PSA+40
FLCSOPSW EQU   PSA+32
FLCEOPSW EQU   PSA+24
@NM00051 EQU   FLCICCW2+4
FLCCVT   EQU   FLCICCW2
FLCICCW1 EQU   FLCROPSW
FLCIPPSW EQU   FLCRNPSW
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS
@RC00391 EQU   @RC00389
@RC00447 EQU   @RC00441
@RC00467 EQU   @RC00466
@RC00534 EQU   @RC00533
@PB00008 EQU   @EL00001
@ENDDATA EQU   *
         END   IGG0CLBA,(C'PLS1039',0701,78152)
