         TITLE 'IGG0CLAX, ALTER CATALOG FIELD (MODIFY)                 *
                        '
IGG0CLAX CSECT ,                                                   0001
@MAINENT DS    0H                                                  0001
         USING *,@15                                               0001
         B     @PROLOG                                             0001
         DC    AL1(16)                                             0001
         DC    C'IGG0CLAX  75.011'                                 0001
         DROP  @15
@PROLOG  DS    0H                                                  0002
         USING @MAINENT,@15
         USING @DATD-(CCATEMPS-IGGCCA),R11
         DS 0F
         DC CL8'IGGPALT2'
         EJECT
         B     @PB00002                                            0085
IGGPALT2 DS    0H                                                  0086
         ENTRY IGGPALT2
         DROP @15
Z003     DS    0H                                                  0088
Z003ALT2 DS    0H                                                  0089
         STM 12,14,12(13)
         LA 13,12(13)
         BALR 12,0
IGGSEGST DS 0H
         USING *,12
*   CCAELC2=OFF;                    /* ENTER LOOP                    */
         NI    CCAELC2(R11),B'11111011'                            0096
*   CCACNIX=0;                      /* COMB INDEX TO FIRST           */
         SLR   @10,@10                                             0097
         STH   @10,CCACNIX(,R11)                                   0097
*   CCAIDPT2=CTGFLPT(1);            /* GET FIRST USER INFO           */
         L     @10,CCAFLPT(,R11)                                   0098
         L     @10,CTGFLPT(,@10)                                   0098
         ST    @10,CCAIDPT2(,R11)                                  0098
*   DO WHILE(CCAELC2=OFF&CCACD1=RCS);/* PROCESS FIELD LIST           */
         B     @DE00099                                            0099
@DL00099 DS    0H                                                  0100
*     IF(DICTFLGS&DTCMBMK)=DTCMB THEN/* IF COMB FIELD        @Y30SSRS
*                                      GET NEXT DICT FIELD INFO      */
         LA    @10,4                                               0100
         AL    @10,CCAFLPT(,R11)                                   0100
         MVC   @TS00001(1),DICTFLGS(@10)                           0100
         NI    @TS00001,X'F0'                                      0100
         CLI   @TS00001,X'20'                                      0100
         BNE   @RF00100                                            0100
*       DO;                         /* PROCESS COMB FIELD            */
*         CCADICT=DTINFO(CDTENT(CCACNIX+DICTST));/* GET DICT FIELD   */
         LH    @05,CCACNIX(,R11)                                   0102
         SLR   @15,@15                                             0102
         IC    @15,DICTST(,@10)                                    0102
         ALR   @15,@05                                             0102
         L     @01,CCACDTA(,R11)                                   0102
         AL    @01,@CF02880                                        0102
         SLR   @14,@14                                             0102
         IC    @14,CDTENT(@15,@01)                                 0102
         SLA   @14,3                                               0102
         L     @01,CCADTA(,R11)                                    0102
         ALR   @01,@14                                             0102
         AL    @01,@CF02881                                        0102
         MVC   CCADICT(4,R11),DTINFO-4(@01)                        0102
*         CCACNIX=CCACNIX+1;        /* INCR TO NEXT FIELD            */
         AL    @05,@CF00080                                        0103
         STH   @05,CCACNIX(,R11)                                   0103
*         IF CCACNIX>=DICTLC THEN   /* IF LAST FIELD IN COMB         */
         SLR   @15,@15                                             0104
         IC    @15,DICTLC(,@10)                                    0104
         CR    @05,@15                                             0104
         BL    @RF00104                                            0104
*           CCAELC2=ON;             /* EXIT AFTER PROCESS FIELD      */
         OI    CCAELC2(R11),B'00000100'                            0105
*         ELSE                                                     0106
*           ;                       /* NOT LAST FIELD                */
@RF00104 DS    0H                                                  0107
*       END;                        /* END PROCESS COMB FIELD        */
*     ELSE                          /* NOT COMBINATION FIELD         */
*       DO;                         /* PROCESS NON-COMB FIELD        */
         B     @RC00100                                            0108
@RF00100 DS    0H                                                  0109
*         CCAELC2=ON;               /* EXIT AFTER ONE FIELD DONE     */
         OI    CCAELC2(R11),B'00000100'                            0109
*         CCADICT=CTGFLDWA;         /* GET DICTIONARY INFO           */
         L     @10,CCAFLPT(,R11)                                   0110
         MVC   CCADICT(4,R11),CTGFLDWA(@10)                        0110
*       END;                        /* END PROCESS NON-COMB          */
*     IF DIC2FLGS=DTSRR&DIC2ST=DTREL THEN/* TEST RELREPNO            */
@RC00100 LA    @10,372                                             0112
         ALR   @10,R11                                             0112
         CLI   DIC2FLGS(@10),X'60'                                 0112
         BNE   @RF00112                                            0112
         CLI   DIC2ST(@10),3                                       0112
         BNE   @RF00112                                            0112
*       CCAILNG=DIC2LC;             /* SET LENGTH                    */
         SLR   @05,@05                                             0113
         IC    @05,DIC2LC(,@10)                                    0113
         ST    @05,CCAILNG(,R11)                                   0113
*     ELSE                          /* NOT RELREPNO                  */
*       DO;                         /* PROCESS FIELD                 */
         B     @RC00112                                            0114
@RF00112 DS    0H                                                  0115
*         CCANF=ON;                 /* ASSUME NOT FOUND              */
         OI    CCANF(R11),B'00001000'                              0115
*         CCAGVNC=ON;               /* SET GETVAL INCOMPLETE         */
         OI    CCAGVNC(R11),B'00100000'                            0116
*         CCAGVEXT=0;               /* SETUP EXTENSION FIELD         */
         SLR   @10,@10                                             0117
         STCM  @10,7,CCAGVEXT(R11)                                 0117
*         DO WHILE(CCAGVNC=ON&      /* MODIFY FIELD INFO             */
*               CCACD1=RCS);        /* WHILE NO ERROR                */
*                                                                  0118
         B     @DE00118                                            0118
@DL00118 DS    0H                                                  0119
*           /*********************************************************/
*           /*                                                       */
*           /* CALL TO MODULE IGG0CLBA                               */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0119
*Z004GVAL:                                                         0119
*           CALL IGGPGVAL;          /* CALL GETVAL                   */
Z004GVAL L     @15,@CV00038                                        0119
         BALR  @14,@15                                             0119
*           IF CCACD1^=RCS THEN                                    0120
         CLI   CCACD1(R11),0                                       0120
         BNE   @RT00120                                            0120
*             ;                     /* IF ERROR IN GETVAL            */
*           ELSE                    /* NO ERROR                      */
*             IF CCAGVNF=ON THEN    /* NOT FOUND                     */
         TM    CCAGVNF(R11),B'00010000'                            0122
         BNO   @RF00122                                            0122
*               CCAELC2=ON;         /* EXIT                          */
         OI    CCAELC2(R11),B'00000100'                            0123
*             ELSE                  /* FOUND RELREPNO                */
*               IF CCAGVNE=ON THEN  /* NON-EXISTENT FIELD            */
*                                                                  0124
         B     @RC00122                                            0124
@RF00122 TM    CCAGVNE(R11),B'00000010'                            0124
         BNO   @RF00124                                            0124
*                 /***************************************************/
*                 /*                                                 */
*                 /* SET CCAMODID='AX', CCAREASN=RSN0,               */
*                 /* CCARETRN=RCSYSFLD                               */
*                 /*                                                 */
*                 /***************************************************/
*                                                                  0125
*                 CCAPROB=IGGSEGID+(RSN0*K256)+RCSYSFLD;/* SET ERR 0125
*                                      CODE                  @Y30SSRS*/
         MVC   CCAPROB(4,R11),@CF02875                             0125
*               ELSE                /* FOUND EXISTENT FIELD          */
*                 DO;               /* PROCESS FIELD                 */
         B     @RC00124                                            0126
@RF00124 DS    0H                                                  0127
*                   IF DIC2REP=ON THEN/* IF REPEATING                */
         TM    DIC2REP+372(R11),B'01000000'                        0127
         BNO   @RF00127                                            0127
*                     CCANF=OFF;    /* FOUND                         */
         NI    CCANF(R11),B'11110111'                              0128
*                   ELSE                                           0129
*                     ;             /* NON-REPEATING                 */
@RF00127 DS    0H                                                  0130
*                   IF DIC2VAR=ON THEN/* IF VAIRABLE LENGTH FIELD    */
         TM    DIC2VAR+372(R11),B'10000000'                        0130
         BNO   @RF00130                                            0130
*                     DO;           /* MODIFY FIELD                  */
*Z006MVAR:                                                         0132
*                       CALL IGGPMVAR;/* MODIFY VARIABLE FIELD       */
Z006MVAR BAL   @14,IGGPMVAR                                        0132
*                       CCAGVNC=OFF;/* COMPLETE                      */
         NI    CCAGVNC(R11),B'11011111'                            0133
*                     END;          /* END MODIFY FIELD              */
*                   ELSE            /* FIX LEN OR UPDATE CALLER      */
*                     DO;           /* UPDATE FIELD                  */
         B     @RC00130                                            0135
@RF00130 DS    0H                                                  0136
*                       CCARBWR=ON; /* MUST WRITE THIS BUFFER        */
         L     @10,CCAURAB(,R11)                                   0136
         OI    CCARBWR(@10),B'00010000'                            0136
*                       INSERT1(1:CCAILNG)=/* UPDATE CATALOG RECORD  */
*                           INSERT2(1:CCAILNG);/* WITH USER INFO     */
         L     @10,CCAIDPT(,R11)                                   0137
         L     @05,CCAILNG(,R11)                                   0137
         BCTR  @05,0                                               0137
         L     @01,CCAIDPT2(,R11)                                  0137
         EX    @05,@SM02888                                        0137
*                     END;          /* END UPDATE FIELD              */
*                 END;              /* END PROCESS FIELD             */
@RC00130 DS    0H                                                  0140
*         END;                      /* END MODIFY FIELD INFO         */
@RC00124 DS    0H                                                  0140
@RC00122 DS    0H                                                  0140
@RT00120 DS    0H                                                  0140
@DE00118 TM    CCAGVNC(R11),B'00100000'                            0140
         BNO   @DC00118                                            0140
         CLI   CCACD1(R11),0                                       0140
         BE    @DL00118                                            0140
@DC00118 DS    0H                                                  0141
*       END;                        /* END PROCESS FIELD             */
*     IF CTGFLDNO>1 THEN            /* SEE IF MORE ONE FIELD PTR     */
@RC00112 L     @10,CCAFLPT(,R11)                                   0142
         CLI   CTGFLDNO(@10),1                                     0142
         BNH   @RF00142                                            0142
*       CCAIDPT2=CTGFLPT(1+CCACNIX);/* SET DATA PTR                  */
         LH    @05,CCACNIX(,R11)                                   0143
         SLA   @05,3                                               0143
         L     @10,CTGFLPT(@05,@10)                                0143
         ST    @10,CCAIDPT2(,R11)                                  0143
*     ELSE                          /* ONE FIELD                     */
*       CCAIDPT2=CCAIDPT2+CCAILNG;  /* SET DATA PTR                  */
         B     @RC00142                                            0144
@RF00142 L     @10,CCAIDPT2(,R11)                                  0144
         AL    @10,CCAILNG(,R11)                                   0144
         ST    @10,CCAIDPT2(,R11)                                  0144
*   END;                            /* END PROCESS FIELD LIST        */
@RC00142 DS    0H                                                  0145
@DE00099 TM    CCAELC2(R11),B'00000100'                            0145
         BNZ   @DC00099                                            0145
         CLI   CCACD1(R11),0                                       0145
         BE    @DL00099                                            0145
@DC00099 DS    0H                                                  0146
*   CALL EXIT;                      /* RETURN TO CALLER              */
         BAL   @14,EXIT                                            0146
*   GEN(DS 0F);                     /* FULLWORD BOUNDARY ALIGNMENT   */
         DS 0F
*   GEN(DC CL8'IGGPMVAR');          /* NAME OF FOLLOWING PROCEDURE   */
         DC CL8'IGGPMVAR'
*   END;                            /* END OF INNER PROCEDURE        */
@EL00002 DS    0H                                                  0149
@EF00002 DS    0H                                                  0149
@ER00002 BR    @14                                                 0149
@PB00002 DS    0H                                                  0150
*   GEN(EJECT);                     /* GO TO A NEW PRINT PAGE        */
         EJECT
*                                                                  0151
*/********************************************************************/
*/*                                                                  */
*/*        IGGPMVAR  -  PROCEDURE  INTERNALLY  CALLED  NESTED        */
*/*                                                                  */
*/********************************************************************/
*                                                                  0151
*IGGPMVAR:                                                         0151
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);/* SPECIFY PROCEDURE OPTIONS     */
         B     @PB00003                                            0151
IGGPMVAR DS    0H                                                  0152
*Z007:                              /* LABEL FOR PROCEDURE TRACKING  */
*Z007MVAR:                          /* LABEL FOR PROCEDURE TRACKING  */
*   RFY                                                            0152
*    (R5,                                                          0152
*     R6,                                                          0152
*     R7,                                                          0152
*     R8,                                                          0152
*     R9,                                                          0152
*     R10) UNRSTD;                  /* PL/S COMPILER WORK REGISTERS  */
Z007     DS    0H                                                  0152
Z007MVAR DS    0H                                                  0153
*   RFY                                                            0153
*    (R2,                                                          0153
*     R3,                                                          0153
*     R4) RSTD;                     /* RESTRICT LOCAL WORK REGISTERS */
*   GEN(STM 12,14,12(13));          /* SAVE REGISTERS OF CALLER      */
         STM 12,14,12(13)
*   GEN(LA 13,12(13));              /* POINT TO NEXT SAVE AREA     0155
*                                      PROCEDURE                     */
         LA 13,12(13)
*/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
**   MODULE NAME =  IGGPMVAR(IGG0CLAX)                                *
**                                                                    *
**   DESCRIPTIVE NAME =  MODIFY VARIABLE LENGTH FIELD                 *
**                                                                    *
**   FUNCTION =                                                       *
**      THIS SUB-FUNCTION MODIFIES A VARIABLE LENGTH FIELD.  IF NO    *
**      DISPLACEMENT IS SPECIFIED THE ENTIRE VARIABLE LENGTH FIELD IS *
**      REPLACED WITH USER SUPPLIED FIELD DATA. OTHERWISE, THE        *
**      VARIABLE LENGTH FIELD IS MODIFIED AT THE SPECIFIED DISPLACE-  *
**      MENT BY DELETING A CERTAIN PORTION AND INSERTING A NEW        *
**      PORTION.  THE PROCESSING IS AS FOLLOWS:                       *
**      1. SET UP FOR MODIFYING THE VARIABLE FIELD.                   *
**      2. IF THE MODIFICATION IS OCCURRING IN THE BASE RECORD OR IF  *
**         THE OCCURRENCE DOES NOT SPAN EXTENSION RECORDS, THEN:      *
**         A. IF THE MODIFICATION WILL REDUCE THE RECORD SIZE, CALL   *
**            IGGPSHNK. OR IF THE EXPANSION CAN BE CONTAINED WITHIN   *
**            THE CURRENT RECORD CALL IGGPEXPD TO COMPLETE THE MODIFY *
**            OPERATION.                                              *
**         B. IF THE MODIFICATION IS TO OCCUR WITHIN A BASE RECORD,   *
**            CALL IGGPMBGO TO MOVE THE AFFECTED OCCURRENCE INTO AN   *
**            EXTENSION RECORD AND CALL IGGPGVAL TO RE-ESTABLISH THE  *
**            OCCURRENCE'S LOCATION.  IF THE EXPANSION CAN NOW BE     *
**            DONE, CALL IGGPEXPD TO PERFORM THE MODIFICATION.        *
**         C. USE SUB-FUNCTIONS IGGPAXCI,IGGPGNEX,IGGPGREC,IGGPGVAL,  *
**            IGGPMGO, AND IGGPEXPD TO MOVE OCCURRENCES OUT OF THE    *
**            CURRENT EXTENSION RECORD UNTIL ONLY ONE REMAINS OR THE  *
**            MODIFY-EXPANSION HAS BEEN DONE.                         *
**      3. IF THE MODIFY OPERATION MUST STILL BE PERFORMED, CALL      *
**         IGGPDEIN.  THIS CALL WILL OCCUR WHEN THE GROUP OCCURRENCE  *
**         INVOLVED SPANS MORE THAN ONE EXTENSION RECORD.             *
**                                                                    *
**   INPUT =                                                          *
**      SEE IGGPMOD INPUT DESCRIBED IN MODULE IGG0CLAV.               *
**                                                                    *
**   OUTPUT =                                                         *
**      SEE IGGPMOD OUTPUT DESCRIBED IN MODULE IGG0CLAV.              *
**                                                                    *
**                                                                    *
** * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
*                                                                  0156
*   RFY                                                            0156
*     VARFIELD BASED(CCAIDPT2);     /* MAP USER INFO                 */
*   IF CTGFLDNO>1 THEN              /* MORE THAN ONE FIELD DATA      */
         L     @10,CCAFLPT(,R11)                                   0157
         CLI   CTGFLDNO(@10),1                                     0157
         BNH   @RF00157                                            0157
*     CCAILNG2=CTGFLNG(CCACNIX)-LENGTH(VARLEN);/* GET INSERT LEN     */
         LH    @05,CCACNIX(,R11)                                   0158
         SLA   @05,3                                               0158
         L     @10,CTGFLNG-8(@05,@10)                              0158
         BCTR  @10,0                                               0158
         BCTR  @10,0                                               0158
         ST    @10,CCAILNG2(,R11)                                  0158
*   ELSE                            /* ONE PAIR DATA/LENGTH          */
*     CCAILNG2=VARLEN;              /* GET INSERT LENGTH             */
         B     @RC00157                                            0159
@RF00157 L     @10,CCAIDPT2(,R11)                                  0159
         ICM   @10,12,VARLEN(@10)                                  0159
         SRA   @10,16                                              0159
         ST    @10,CCAILNG2(,R11)                                  0159
*   RFY                                                            0160
*     VARFIELD BASED(CCACPE7);      /* ORGINAL BASE                  */
@RC00157 DS    0H                                                  0161
*   IF CTGVLDSP^=0&CCAMOD=ON THEN   /* IF MODIFY OF VARIABLE LENGTH
*                                      FIELD                         */
         L     @10,CCAFLPT(,R11)                                   0161
         LH    @05,CTGVLDSP+2(,@10)                                0161
         LTR   @05,@05                                             0161
         BZ    @RF00161                                            0161
         TM    CCAMOD(R11),B'00000001'                             0161
         BNO   @RF00161                                            0161
*     DO;                           /* SET INSERT/DELETE INFO        */
*       CCADISP=CTGVLDSP;           /* DISPLACEMENT                  */
         STH   @05,CCADISP(,R11)                                   0163
*       CCADLEN=CTGFLNG(1);         /* DELETE LENGTH                 */
         L     @10,CTGFLNG(,@10)                                   0164
         STH   @10,CCADLEN(,R11)                                   0164
*       CCADIFF=CCAILNG2-CCADLEN;   /* DIFFERENCE                    */
         LCR   @10,@10                                             0165
         AL    @10,CCAILNG2(,R11)                                  0165
         STH   @10,CCADIFF(,R11)                                   0165
*     END;                          /* END SET                       */
*   ELSE                            /* NOT MODIFY OF VAR FIELD       */
*     DO;                           /* SET UP FOR ALTER              */
         B     @RC00161                                            0167
@RF00161 DS    0H                                                  0168
*       CCADISP=LENGTH(VARLEN);     /* DISPLACEMENT                  */
         LA    @10,2                                               0168
         STH   @10,CCADISP(,R11)                                   0168
*       CCADLEN=CCAILNG-LENGTH(VARLEN);/* DELETE LENGTH              */
         L     @05,CCAILNG(,R11)                                   0169
         LR    @15,@05                                             0169
         SLR   @15,@10                                             0169
         STH   @15,CCADLEN(,R11)                                   0169
*       CCADIFF=CCAILNG2-CCAILNG+LENGTH(VARLEN);/* DIFFERENCE        */
         LCR   @05,@05                                             0170
         AL    @05,CCAILNG2(,R11)                                  0170
         ALR   @05,@10                                             0170
         STH   @05,CCADIFF(,R11)                                   0170
*     END;                          /* END SET UP                    */
*   CCAGVNC=ON;                     /* PROCESSING NOT COMPLETE       */
@RC00161 OI    CCAGVNC(R11),B'00100000'                            0172
*   IF CCAGVEXT=0×CCAURAB=CCARABB THEN/* IF OCCURRENCE TOTALLY IN ONE
*                                      RECORD                        */
         ICM   @10,7,CCAGVEXT(R11)                                 0173
         BZ    @RT00173                                            0173
         CLC   CCAURAB(4,R11),CCARABB(R11)                         0173
         BNE   @RF00173                                            0173
@RT00173 DS    0H                                                  0174
*     DO;                           /* PROCESS RECORD                */
*       IF CCADIFF<=0 THEN          /* IF THIS IS SHRINK OF VAR    0175
*                                      LENGTH FIELD                  */
         LH    @10,CCADIFF(,R11)                                   0175
         LTR   @10,@10                                             0175
         BP    @RF00175                                            0175
*         DO;                       /* SHRINK FIELD                  */
*Z008SHNK:                                                         0177
*           CALL IGGPSHNK;          /* SHRINK FIELD                  */
Z008SHNK BAL   @14,IGGPSHNK                                        0177
*           CCAGVNC=OFF;            /* PROCESSING COMPLETE           */
         NI    CCAGVNC(R11),B'11011111'                            0178
*         END;                      /* END SHRINK FIELD              */
*       ELSE                        /* EXPAND OF FIELD               */
*         IF RCDSIZ+CCADIFF<=MXRCD THEN/* IF VAR LEN FIELD WILL FIT  */
         B     @RC00175                                            0180
@RF00175 L     @10,CCAURAB(,R11)                                   0180
         L     @10,CCACPE1(,@10)                                   0180
         ICM   @10,12,RCDSIZ(@10)                                  0180
         SRA   @10,16                                              0180
         AH    @10,CCADIFF(,R11)                                   0180
         C     @10,@CF00055                                        0180
         BH    @RF00180                                            0180
*           DO;                     /* EXPAND FIELD                  */
*Z009EXPD:                                                         0182
*             CALL IGGPEXPD;        /* EXPAND FIELD                  */
Z009EXPD BAL   @14,IGGPEXPD                                        0182
*             CCAGVNC=OFF;          /* PROCESSING COMPLETE           */
         NI    CCAGVNC(R11),B'11011111'                            0183
*           END;                    /* END EXPAND                    */
*         ELSE                      /* VAR LEN FIELD NOT FIT         */
*           DO;                     /* MOVE OCCURRENCES              */
         B     @RC00180                                            0185
@RF00180 DS    0H                                                  0186
*             IF CCAURAB=CCARABB THEN/* IF BASE RCD AREA             */
         CLC   CCAURAB(4,R11),CCARABB(R11)                         0186
         BNE   @RF00186                                            0186
*               DO;                 /* MOVE BASE OCCURRENCES         */
*Z010MBGO:                                                         0188
*                 CALL IGGPMBGO;    /* MOVE BASE OCCURRENCES         */
Z010MBGO BAL   @14,IGGPMBGO                                        0188
*                 CCAGVEXT=0;       /* NO EXTENSION                  */
*                                                                  0189
         SLR   @10,@10                                             0189
         STCM  @10,7,CCAGVEXT(R11)                                 0189
*                 /***************************************************/
*                 /*                                                 */
*                 /* CALL TO MODULE IGG0CLBA                         */
*                 /*                                                 */
*                 /***************************************************/
*                                                                  0190
*Z011GVAL:                                                         0190
*                 CALL IGGPGVAL;    /* RE-EST DATA PTR               */
Z011GVAL L     @15,@CV00038                                        0190
         BALR  @14,@15                                             0190
*                 IF RCDSIZ+CCADIFF<=MXRCD&/* IF VAR LEN FIELD FIT 0191
*                                      NOW                           */
*                     CCACD1=RCS THEN/* AND NO PREVIOUS ERROR        */
         L     @10,CCAURAB(,R11)                                   0191
         L     @10,CCACPE1(,@10)                                   0191
         ICM   @10,12,RCDSIZ(@10)                                  0191
         SRA   @10,16                                              0191
         AH    @10,CCADIFF(,R11)                                   0191
         C     @10,@CF00055                                        0191
         BH    @RF00191                                            0191
         CLI   CCACD1(R11),0                                       0191
         BNE   @RF00191                                            0191
*                   DO;             /* EXPAND FIELD                  */
*Z012EXPD:                                                         0193
*                     CALL IGGPEXPD;/* EXPAND FIELD                  */
Z012EXPD BAL   @14,IGGPEXPD                                        0193
*                     CCAGVNC=OFF;  /* PROCESSING COMPLETE           */
         NI    CCAGVNC(R11),B'11011111'                            0194
*                   END;            /* END EXPAND                    */
*                 ELSE              /* INFO NOT FIT                  */
*                   CCAGVNC=ON;     /* STILL INCOMPLETE              */
         B     @RC00191                                            0196
@RF00191 OI    CCAGVNC(R11),B'00100000'                            0196
*               END;                /* END MOVE BASE                 */
*             ELSE                                                 0198
*               ;                   /* NOT BASE                      */
@RF00186 DS    0H                                                  0199
*             CCARBU1=ON;           /* DONT USE BUFFER               */
@RC00186 L     @10,CCAURAB(,R11)                                   0199
         OI    CCARBU1(@10),B'01000000'                            0199
*             IF CCAGVNC=OFF×CCACD1^=RCS×/* IF THIS PROCESSING       */
*                 REPCNT=1 THEN                                    0200
         TM    CCAGVNC(R11),B'00100000'                            0200
         BZ    @RT00200                                            0200
         CLI   CCACD1(R11),0                                       0200
         BNE   @RT00200                                            0200
         L     @10,CCACPE2(,@10)                                   0200
         CLI   REPCNT(@10),1                                       0200
         BE    @RT00200                                            0200
*               ;                   /* IS COMPLETE                   */
*             ELSE                  /* PROCESSING NOT COMPLETE       */
*               DO;                 /* SPLIT RECORD                  */
*                 CCARABPT=CCAURAB; /* OCCURRENCES TO BE MOVED       */
         L     @10,CCAURAB(,R11)                                   0203
         ST    @10,CCARABPT(,R11)                                  0203
*                 RFY                                              0204
*                   CCARAB BASED(CCARABB);/* MAP AASE RAB            */
*                 CCASRID=CATSPCI;  /* SET UP TO GET SPACE RCD       */
         L     @05,CCARABB(,R11)                                   0205
         L     @05,CCACPE2(,@05)                                   0205
         MVC   CCASRID(3,R11),CATSPCI+6(@05)                       0205
*                 RFY                                              0206
*                   CCARAB BASED(CCAURAB);/* ORGINAL BASE            */
*                 IF CCASRID=RCDCINO×/* IF SPACE RCD IS              */
*                     CCASRID=0 THEN/* IN-USE OR NOT EXIST           */
         SLR   @05,@05                                             0207
         ICM   @05,7,CCASRID(R11)                                  0207
         L     @10,CCACPE1(,@10)                                   0207
         L     @10,RCDCINO-1(,@10)                                 0207
         LA    @10,0(,@10)                                         0207
         CR    @05,@10                                             0207
         BE    @RT00207                                            0207
         LTR   @05,@05                                             0207
         BNZ   @RF00207                                            0207
@RT00207 DS    0H                                                  0208
*                   DO;             /* GET NEW RECORD FOR MOVE       */
*                                                                  0208
*                     /***********************************************/
*                     /*                                             */
*                     /* CALL TO MODULE IGG0CLAG                     */
*                     /*                                             */
*                     /***********************************************/
*                                                                  0209
*Z013AXCI:                                                         0209
*                     CALL IGGPAXCI;/* ASSIGN CI                     */
Z013AXCI L     @15,@CV00040                                        0209
         BALR  @14,@15                                             0209
*                     RFY                                          0210
*                       CCARAB BASED(CCARABB);/* MAP BASE            */
*                     CATSPCI=CCAASCI(1);/* SET NEW SPACE PTR        */
         L     @10,CCARABB(,R11)                                   0211
         L     @05,CCACPE2(,@10)                                   0211
         MVC   CATSPCI+6(3,@05),CCAASCI(R11)                       0211
*                     CCARBWR=ON;   /* WRITE RECORD                  */
         OI    CCARBWR(@10),B'00010000'                            0212
*                     RFY                                          0213
*                       CCARAB BASED(CCAURAB);/* ORGINAL BASE        */
*                                                                  0213
*                     /***********************************************/
*                     /*                                             */
*                     /* CALL TO MODULE IGG0CLAW                     */
*                     /*                                             */
*                     /***********************************************/
*                                                                  0214
*Z014GNEX:                                                         0214
*                     CALL IGGPGNEX;/* FORMAT NEW RECORD             */
Z014GNEX L     @15,@CV00036                                        0214
         BALR  @14,@15                                             0214
*                   END;            /* END GET NEW RCD               */
*                 ELSE              /* SPACE RCD NOT IN-USE          */
*                   DO;             /* GET RCD                       */
*                                                                  0216
         B     @RC00207                                            0216
@RF00207 DS    0H                                                  0217
*                     /***********************************************/
*                     /*                                             */
*                     /* CALL TO MODULE IGG0CLBA                     */
*                     /*                                             */
*                     /***********************************************/
*                                                                  0217
*Z015GREC:                                                         0217
*                     CALL IGGPGREC;/* READ RECORD                   */
Z015GREC L     @15,@CV00037                                        0217
         BALR  @14,@15                                             0217
*                   END;            /* END GET RECORD                */
*                 CATGODEL=ON;      /* MARK EXPANDING OCCURR AS    0219
*                                      DELETED SO WONT BE MOVED      */
@RC00207 L     @10,CCACPE5(,R11)                                   0219
         OI    CATGODEL(@10),B'01000000'                           0219
*                 CCACPE52=CCACPE5; /* SAVE POINTER TO EXPANDING GOP */
         ST    @10,CCACPE52(,R11)                                  0220
*                 CCAMEX1=OFF;      /* ENTER LOOP                    */
         NI    CCAMEX1(R11),B'11011111'                            0221
*                 DO WHILE(CCAMEX1=OFF&CCACD1=RCS);/* MOVE FOR SPACE */
         B     @DE00222                                            0222
@DL00222 DS    0H                                                  0223
*                   RFY                                            0223
*                     CCARAB BASED(CCARABPT);/* MAP OCCURR TO BE   0223
*                                      MOVED                         */
*                   RFY                                            0224
*                     CATGOPT BASED(CCACPE51);/* MAP GOP             */
*                   IF REPCNT=1 THEN/* IF NO MORE OCCURR MOVE        */
         L     @10,CCARABPT(,R11)                                  0225
         L     @05,CCACPE2(,@10)                                   0225
         CLI   REPCNT(@05),1                                       0225
         BNE   @RF00225                                            0225
*                     DO;           /* UPDATE GOPS           @Y30SSRS*/
*                       CCAMEX1=ON; /* EXIT                          */
         OI    CCAMEX1(R11),B'00100000'                            0227
*                       RFY                                        0228
*                         CATGOPT BASED(CCACPE52);/* MAP GOP @Y30SSRS*/
*                       IF CCACPE52<CCACPE3 THEN/* CHECK FOR GOP   0229
*                                      UPDATE                        */
         L     @05,CCACPE52(,R11)                                  0229
         C     @05,CCACPE3(,@10)                                   0229
         BNL   @RF00229                                            0229
*                         CATGODEL=OFF;/* INDICATE NOT DELETED       */
         NI    CATGODEL(@05),B'10111111'                           0230
*                       ELSE                                       0231
*                         ;         /* NO GOP UPDATE         @Y30SSRS*/
@RF00229 DS    0H                                                  0232
*                       RFY                                        0232
*                         CATGOPT BASED(CCACPE3-CCAGOPLN);/* MAP GOP */
*                       CATGODEL=OFF;/* INDICATE NOT DELETED         */
         L     @10,CCARABPT(,R11)                                  0233
         L     @10,CCACPE3(,@10)                                   0233
         SH    @10,CCAGOPLN(,R11)                                  0233
         NI    CATGODEL(@10),B'10111111'                           0233
*                       RFY                                        0234
*                         CATGOPT BASED(CCACPE51);/* REMAP GOP     0234
*                                                            @Y30SSRS*/
*                       CCAGVEXT=0; /* SETUP FOR GVAL INTERFACE      */
*                                                                  0235
         SLR   @10,@10                                             0235
         STCM  @10,7,CCAGVEXT(R11)                                 0235
*                       /*********************************************/
*                       /*                                           */
*                       /* CALL TO MODULE IGG0CLBA                   */
*                       /*                                           */
*                       /*********************************************/
*                                                                  0236
*Z016GVAL:                                                         0236
*                       CALL IGGPGVAL;/* CALL GVAL           @Y30SSRS*/
Z016GVAL L     @15,@CV00038                                        0236
         BALR  @14,@15                                             0236
*                       CCAGVNC=ON; /* NOT COMPLETE                  */
         OI    CCAGVNC(R11),B'00100000'                            0237
*                     END;          /* END UPDATE            @Y30SSRS*/
*                   ELSE            /* MOVE OCCURRENCE               */
*                     DO;           /* MOVE                          */
         B     @RC00225                                            0239
@RF00225 DS    0H                                                  0240
*                       CCACPE51=CCACPE3-CCAGOPLN;/* POINT NEXT GO 0240
*                                      MOVE                          */
         L     @10,CCARABPT(,R11)                                  0240
         LH    @05,CCAGOPLN(,R11)                                  0240
         L     @10,CCACPE3(,@10)                                   0240
         SLR   @10,@05                                             0240
         ST    @10,CCACPE51(,R11)                                  0240
*                       IF CATGODEL=ON THEN/* IF DELETED GOP         */
         TM    CATGODEL(@10),B'01000000'                           0241
         BNO   @RF00241                                            0241
*                         CCACPE51=CCACPE51-CCAGOPLN;/* ADJUST GOP 0242
*                                      PTR                           */
         SLR   @10,@05                                             0242
         ST    @10,CCACPE51(,R11)                                  0242
*                       ELSE                                       0243
*                         ;         /* NOT DELETED                   */
@RF00241 DS    0H                                                  0244
*Z017MGO:                                                          0244
*                       CALL IGGPMGO;/* MOVE OCCURRENCE              */
Z017MGO  BAL   @14,IGGPMGO                                         0244
*                       IF CCAMNOSP=ON THEN/* IF NO SPACE            */
         TM    CCAMNOSP(R11),B'00100000'                           0245
         BNO   @RF00245                                            0245
*                         DO;       /* SET UP TO GET MOVE SPACE      */
*                                                                  0246
*                           /*****************************************/
*                           /*                                       */
*                           /* CALL TO MODULE IGG0CLAG               */
*                           /*                                       */
*                           /*****************************************/
*                                                                  0247
*Z018AXCI:                                                         0247
*                           CALL IGGPAXCI;/* EET NEW EXTENSION       */
Z018AXCI L     @15,@CV00040                                        0247
         BALR  @14,@15                                             0247
*                           RFY                                    0248
*                             CCARAB BASED(CCARABB);/* MAP BASE RAB  */
*                           CATSPCI=CCAASCI(1);/* SET SPACE CI       */
         L     @10,CCARABB(,R11)                                   0249
         L     @05,CCACPE2(,@10)                                   0249
         MVC   CATSPCI+6(3,@05),CCAASCI(R11)                       0249
*                           CCARBWR=ON;/* WRITE RECORD               */
         OI    CCARBWR(@10),B'00010000'                            0250
*                           RFY                                    0251
*                             CCARAB BASED(CCARABPT);/* OLD BASE     */
*                                                                  0251
*                           /*****************************************/
*                           /*                                       */
*                           /* CALL TO MODULE IGG0CLAW               */
*                           /*                                       */
*                           /*****************************************/
*                                                                  0252
*Z019GNEX:                                                         0252
*                           CALL IGGPGNEX;/* GET NEW ESTENSION       */
Z019GNEX L     @15,@CV00036                                        0252
         BALR  @14,@15                                             0252
*Z020MGO:                                                          0253
*                           CALL IGGPMGO;/* MOVE OCCURRENCE          */
Z020MGO  BAL   @14,IGGPMGO                                         0253
*                         END;      /* END SET UP                    */
*                       ELSE                                       0255
*                         ;         /* MOVE DONE                     */
@RF00245 DS    0H                                                  0256
*                       IF RCDSIZ+CCADIFF<=MXRCD&/* IF ENOUGH ROOM   */
*                           CCACD1=RCS THEN/* FOR NEW INFO           */
         L     @10,CCARABPT(,R11)                                  0256
         L     @05,CCACPE1(,@10)                                   0256
         ICM   @05,12,RCDSIZ(@05)                                  0256
         SRA   @05,16                                              0256
         AH    @05,CCADIFF(,R11)                                   0256
         C     @05,@CF00055                                        0256
         BH    @RF00256                                            0256
         CLI   CCACD1(R11),0                                       0256
         BNE   @RF00256                                            0256
*                         DO;       /* EXPAND RECORD                 */
*                           RFY                                    0258
*                             CATGOPT BASED(CCACPE52);/* MAP GOP     */
*                           IF CCACPE52<CCACPE3 THEN/* IF PTR STILL
*                                      VALID                         */
         L     @05,CCACPE52(,R11)                                  0259
         C     @05,CCACPE3(,@10)                                   0259
         BNL   @RF00259                                            0259
*                             CATGODEL=OFF;/* MARK NOT DELETED       */
         NI    CATGODEL(@05),B'10111111'                           0260
*                           ELSE                                   0261
*                             ;     /* NOT VALID                     */
@RF00259 DS    0H                                                  0262
*                           RFY                                    0262
*                             CATGOPT BASED(CCACPE3-CCAGOPLN);/* MAP
*                                      GOP                           */
*                           CATGODEL=OFF;/* NOT DELETED              */
         L     @10,CCARABPT(,R11)                                  0263
         L     @10,CCACPE3(,@10)                                   0263
         SH    @10,CCAGOPLN(,R11)                                  0263
         NI    CATGODEL(@10),B'10111111'                           0263
*                           CCAGVEXT=0;/* SET UP FOR GET VALUE       */
*                                                                  0264
         SLR   @10,@10                                             0264
         STCM  @10,7,CCAGVEXT(R11)                                 0264
*                           /*****************************************/
*                           /*                                       */
*                           /* CALL TO MODULE IGG0CLBA               */
*                           /*                                       */
*                           /*****************************************/
*                                                                  0265
*Z021GVAL:                                                         0265
*                           CALL IGGPGVAL;/* CALL GETVAL             */
Z021GVAL L     @15,@CV00038                                        0265
         BALR  @14,@15                                             0265
*                           IF CCACD1=RCS THEN/* IF NO ERROR         */
         CLI   CCACD1(R11),0                                       0266
         BNE   @RF00266                                            0266
*                             DO;   /* EXPAND FIELD                  */
*Z022EXPD:                                                         0268
*                               CALL IGGPEXPD;/* CALL EXPAND         */
Z022EXPD BAL   @14,IGGPEXPD                                        0268
*                               CCAGVNC=OFF;/* PROCESS COMPLETE      */
         NI    CCAGVNC(R11),B'11011111'                            0269
*                               CCAMEX1=ON;/* EXIT                   */
         OI    CCAMEX1(R11),B'00100000'                            0270
*                             END;  /* END EXPAND                    */
*                           ELSE                                   0272
*                             ;     /* ERROR                         */
@RF00266 DS    0H                                                  0273
*                         END;      /* END EXPAND                    */
*                       ELSE                                       0274
*                         ;         /* NOT ENOUGH ROOM               */
@RF00256 DS    0H                                                  0275
*                     END;          /* END MOVE                      */
*                 END;              /* END MOVE FOR SPACE            */
@RC00225 DS    0H                                                  0276
@DE00222 TM    CCAMEX1(R11),B'00100000'                            0276
         BNZ   @DC00222                                            0276
         CLI   CCACD1(R11),0                                       0276
         BE    @DL00222                                            0276
@DC00222 DS    0H                                                  0277
*               END;                /* END SPLIT RECORD              */
*           END;                    /* END MOVE OCCURRENCES          */
*     END;                          /* END PROCESS RECORD            */
*   ELSE                                                           0280
*     ;                             /* OCCURRENCE SPANS RECORDS      */
@RF00173 DS    0H                                                  0281
*   CCARBU1=OFF;                    /* BUFFER FREE AFTER SPLIT       */
@RC00173 L     @10,CCARABPT(,R11)                                  0281
         NI    CCARBU1(@10),B'10111111'                            0281
*   IF CCAGVNC=OFF×CCACD1^=RCS THEN                                0282
         TM    CCAGVNC(R11),B'00100000'                            0282
         BZ    @RT00282                                            0282
         CLI   CCACD1(R11),0                                       0282
         BNE   @RT00282                                            0282
*     ;                             /* IF DONE OR ERROR              */
*   ELSE                            /* NOT DONE                      */
*     DO;                           /* PROCESS SINGLE OCCURR IN    0284
*                                      RECORD                        */
*                                                                  0284
*       /*************************************************************/
*       /*                                                           */
*       /* CALL TO MODULE IGG0CLBW                                   */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0285
*Z023DEIN:                                                         0285
*       CALL IGGPDEIN;              /* DELETE/INSERT                 */
Z023DEIN L     @15,@CV00041                                        0285
         BALR  @14,@15                                             0285
*     END;                          /* END PROCESS                   */
*   CCAILNG=CCAILNG2+LENGTH(VARLEN);/* NEW VAR FIELD LENGTH          */
@RT00282 LA    @10,2                                               0287
         AL    @10,CCAILNG2(,R11)                                  0287
         ST    @10,CCAILNG(,R11)                                   0287
*   RFY                                                            0288
*     CCARAB BASED(CCAURAB);        /* MAP ORGINAL BASE              */
*   RFY                                                            0289
*     CATGOPT BASED(CCACPE5);       /* ORGINAL BASE                  */
*   CALL EXIT;                      /* RETURN TO CALLER              */
         BAL   @14,EXIT                                            0290
*   GEN(DS 0F);                     /* FULLWORD BOUNDARY ALIGNMENT   */
         DS 0F
*   GEN(DC CL8'IGGPEXPD');          /* NAME OF FOLLOWING PROCEDURE   */
         DC CL8'IGGPEXPD'
*   END;                            /* END OF INNER PROCEDURE        */
@EL00003 DS    0H                                                  0293
@EF00003 DS    0H                                                  0293
@ER00003 BR    @14                                                 0293
@PB00003 DS    0H                                                  0294
*   GEN(EJECT);                     /* GO TO A NEW PRINT PAGE        */
         EJECT
*                                                                  0295
*/********************************************************************/
*/*                                                                  */
*/*        IGGPEXPD  -  PROCEDURE  EXTERNALLY  CALLED  NESTED        */
*/*                                                                  */
*/********************************************************************/
*                                                                  0295
*IGGPEXPD:                                                         0295
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);/* SPECIFY PROCEDURE OPTIONS     */
         B     @PB00004                                            0295
IGGPEXPD DS    0H                                                  0296
*   GEN(ENTRY IGGPEXPD );           /* IDENTIFY ENTRY-POINT SYMBOL   */
         ENTRY IGGPEXPD
*Z024:                              /* LABEL FOR PROCEDURE TRACKING  */
*Z024EXPD:                          /* LABEL FOR PROCEDURE TRACKING  */
*   RFY                                                            0297
*    (R5,                                                          0297
*     R6,                                                          0297
*     R7,                                                          0297
*     R8,                                                          0297
*     R9,                                                          0297
*     R10) UNRSTD;                  /* PL/S COMPILER WORK REGISTERS  */
Z024     DS    0H                                                  0297
Z024EXPD DS    0H                                                  0298
*   RFY                                                            0298
*    (R2,                                                          0298
*     R3,                                                          0298
*     R4) RSTD;                     /* RESTRICT LOCAL WORK REGISTERS */
*   GEN(STM 12,14,12(13));          /* SAVE REGISTERS OF CALLER      */
         STM 12,14,12(13)
*   GEN(LA 13,12(13));              /* POINT TO NEXT SAVE AREA       */
         LA 13,12(13)
*   GEN(BALR 12,0);                 /* ESTABLISH ADDRESSABILITY      */
         BALR 12,0
*   GEN(LA 15,*-IGGSEGST(0,0));     /* COMPUTE MODULE BASE           */
         LA 15,*-IGGSEGST(0,0)
*   GEN(SR 12,15);                  /* SET BASE TO MODULE BASE     0303
*                                      PROCEDURE                     */
         SR 12,15
*/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
**   MODULE NAME =  IGGPEXPD(IGG0CLAX)                                *
**                                                                    *
**   DESCRIPTIVE NAME =  EXPAND CATALOG FIELD                         *
**                                                                    *
**   FUNCTION =                                                       *
**      THIS SUB-FUNCTION EXPANDS A VARIABLE LENGTH CATALOG FIELD BY  *
**      DELETING A CERTAIN PORTION AND ADDING A LARGER PORTION.  THE  *
**      PROCESSING IS AS FOLLOWS:                                     *
**      1. SHIFT THE CATALOG RECORD TO THE RIGHT AT THE POINT IN THE  *
**         VARIABLE LENGTH FIELD WHERE THE DELETE/INSERT IS TO OCCUR. *
**      2. UPDATE THE CATALOG POINTERS AND SIZES.                     *
**      3. INSERT THE USER DATA.                                      *
**                                                                    *
**   INPUT =                                                          *
**      IGGCCA INPUT:                                                 *
**         CCAURAB - RAB ADDRESS OF CATALOG RECORD CONTAINING FIELD   *
**                   TO BE EXPANDED.                                  *
**         CCACPE7 - ADDRESS OF VARIABLE LENGTH FIELD IN THE CATALOG  *
**                   RECORD.                                          *
**         CCAIDPT2 - ADDRESS OF USER INSERT INFORMATION              *
**         CCADISP - DISPLACEMENT INTO VARIABLE LENGTH FIELD WHERE    *
**                   DELETE/INSERT IS TO OCCUR.                       *
**         CCADLEN - LENGTH OF VARIABLE INFORMATION TO BE DELETED.    *
**         CCADIFF - DIFFERENCE BETWEEN INSERT LENGTH AND DELETE      *
**                   LENGTH.                                          *
**         CCAILNG2 - USER INSERT DATA LENGTH.                        *
**                                                                    *
**   OUTPUT =                                                         *
**      EXPAND OPERATION COMPLETED                                    *
**      IGGCCA OUTPUT:                                                *
**         CCARBWR - SET ON IN RAB ADDRESSED BY CCAURAB.              *
**                                                                    *
**                                                                    *
** * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
*                                                                  0304
*   RFY                                                            0304
*     RCDMV1 BASED(R3-R4);          /* DATA TO BE MOVED              */
*   RFY                                                            0305
*     RCDMV2 BASED(R3);             /* MOVE AREA                     */
*   R3=CCACPE7+CCADISP+CCADLEN;     /* POINT TO START OF MOVE        */
         LH    R3,CCADISP(,R11)                                    0306
         AL    R3,CCACPE7(,R11)                                    0306
         AH    R3,CCADLEN(,R11)                                    0306
*   R4=CCADIFF;                     /* ADDED LENGTH                  */
         LH    R4,CCADIFF(,R11)                                    0307
*   R2=CCACPE4-R3+R4;               /* GET MOVE LENGTH               */
         L     @10,CCAURAB(,R11)                                   0308
         L     R2,CCACPE4(,@10)                                    0308
         SLR   R2,R3                                               0308
         ALR   R2,R4                                               0308
*   DO WHILE(R2>R4&R4^=0);          /* SHIFT RECORD FOR VAR F1D      */
         B     @DE00309                                            0309
@DL00309 DS    0H                                                  0310
*     RCDMV2(R2-R4+1:R2)=           /* MOVE RECORD                   */
*         RCDMV1(R2-R4+1:R2);       /* MOVE RECORD                   */
         LR    @10,R2                                              0310
         SLR   @10,R4                                              0310
         ST    @10,@TF00001                                        0310
         ALR   @10,R3                                              0310
         LR    @05,R2                                              0310
         SL    @05,@TF00001                                        0310
         BCTR  @05,0                                               0310
         LR    @15,R3                                              0310
         SLR   @15,R4                                              0310
         AL    @15,@TF00001                                        0310
         EX    @05,@SM02892                                        0310
*     R2=R2-R4;                     /* DECR SEGMENT MOVE             */
         SLR   R2,R4                                               0311
*   END;                            /* END SHIFT                     */
@DE00309 CR    R2,R4                                               0312
         BNH   @DC00309                                            0312
         LTR   R4,R4                                               0312
         BNZ   @DL00309                                            0312
@DC00309 DS    0H                                                  0313
*   R2=CCACPE7-CCACPE3;             /* DISPLACEMENT TO VAR LEN FIELD */
         L     @10,CCAURAB(,R11)                                   0313
         L     R2,CCACPE7(,R11)                                    0313
         SL    R2,CCACPE3(,@10)                                    0313
*   RFY                                                            0314
*     CATGOPT BASED(R3);            /* GOP MAP                       */
*   R3=ADDR(REPGOPT);               /* POINT TO FIRST GOP            */
         L     R3,CCACPE2(,@10)                                    0315
         LA    R3,REPGOPT(,R3)                                     0315
*   DO CCAGVCT=1 TO REPCNT;         /* UPDATE DISPLACEMENTS          */
         LA    @10,1                                               0316
         B     @DE00316                                            0316
@DL00316 DS    0H                                                  0317
*     IF CATGOEXT=OFF&CATGODEL=OFF& /* IF THIS IS NON-DELETED,       */
*         CATGODSP>R2 THEN          /* NON-EXT GOP FOR UPDATE        */
         TM    CATGOEXT(R3),B'11000000'                            0317
         BNZ   @RF00317                                            0317
         ICM   @10,12,CATGODSP(R3)                                 0317
         SRA   @10,16                                              0317
         CR    @10,R2                                              0317
         BNH   @RF00317                                            0317
*       CATGODSP=CATGODSP+R4;       /* RESET DISPLACEMENT            */
         ALR   @10,R4                                              0318
         STCM  @10,3,CATGODSP(R3)                                  0318
*     ELSE                                                         0319
*       ;                           /* NO UPDATE GOP                 */
@RF00317 DS    0H                                                  0320
*     R3=R3+CCAGOPLN;               /* GET NEXT GOP                  */
         AH    R3,CCAGOPLN(,R11)                                   0320
*   END;                            /* END UPDATE                    */
         LA    @10,1                                               0321
         AH    @10,CCAGVCT(,R11)                                   0321
@DE00316 STH   @10,CCAGVCT(,R11)                                   0321
         L     @05,CCAURAB(,R11)                                   0321
         L     @05,CCACPE2(,@05)                                   0321
         SLR   @15,@15                                             0321
         IC    @15,REPCNT(,@05)                                    0321
         CR    @10,@15                                             0321
         BNH   @DL00316                                            0321
*   RCDSIZ=RCDSIZ+R4;               /* UPDATE RECORD SIZE            */
         L     @10,CCAURAB(,R11)                                   0322
         L     @05,CCACPE1(,@10)                                   0322
         ICM   @15,12,RCDSIZ(@05)                                  0322
         SRA   @15,16                                              0322
         ALR   @15,R4                                              0322
         STCM  @15,3,RCDSIZ(@05)                                   0322
*   CCACPE4=CCACPE4+R4;             /* UPDATE END RECORD PTR         */
         LR    @05,R4                                              0323
         AL    @05,CCACPE4(,@10)                                   0323
         ST    @05,CCACPE4(,@10)                                   0323
*   VARLEN=VARLEN+CCADIFF;          /* UPDATE LENGTH FIELD           */
         L     @05,CCACPE7(,R11)                                   0324
         ICM   @15,12,VARLEN(@05)                                  0324
         SRA   @15,16                                              0324
         AH    @15,CCADIFF(,R11)                                   0324
         STCM  @15,3,VARLEN(@05)                                   0324
*   CCARBWR=ON;                     /* MUST WRITE THIS RECORD        */
         OI    CCARBWR(@10),B'00010000'                            0325
*   IF CCAILNG2^=0 THEN             /* IS THERE INSERT DATA          */
         L     @10,CCAILNG2(,R11)                                  0326
         LTR   @10,@10                                             0326
         BZ    @RF00326                                            0326
*     VARINFO2(1:CCAILNG2)=VARINFO1(1:CCAILNG2);/* PUT IN INSERT     */
         AH    @05,CCADISP(,R11)                                   0327
         BCTR  @10,0                                               0327
         L     @01,CCAIDPT2(,R11)                                  0327
         EX    @10,@SM02894                                        0327
*   ELSE                                                           0328
*     ;                             /* NO DATA                       */
@RF00326 DS    0H                                                  0329
*   RFY                                                            0329
*     CATGOPT BASED(CCACPE5);       /* ORIGINAL BASE                 */
*   CALL EXIT;                      /* RETURN TO CALLER              */
         BAL   @14,EXIT                                            0330
*   GEN(DS 0F);                     /* FULLWORD BOUNDARY ALIGNMENT   */
         DS 0F
*   GEN(DC CL8'IGGPSHNK');          /* NAME OF FOLLOWING PROCEDURE   */
         DC CL8'IGGPSHNK'
*   END;                            /* END OF INNER PROCEDURE        */
@EL00004 DS    0H                                                  0333
@EF00004 DS    0H                                                  0333
@ER00004 BR    @14                                                 0333
@PB00004 DS    0H                                                  0334
*   GEN(EJECT);                     /* GO TO A NEW PRINT PAGE        */
         EJECT
*                                                                  0335
*/********************************************************************/
*/*                                                                  */
*/*        IGGPSHNK  -  PROCEDURE  EXTERNALLY  CALLED  NESTED        */
*/*                                                                  */
*/********************************************************************/
*                                                                  0335
*IGGPSHNK:                                                         0335
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);/* SPECIFY PROCEDURE OPTIONS     */
         B     @PB00005                                            0335
IGGPSHNK DS    0H                                                  0336
*   GEN(ENTRY IGGPSHNK );           /* IDENTIFY ENTRY-POINT SYMBOL   */
         ENTRY IGGPSHNK
*Z025:                              /* LABEL FOR PROCEDURE TRACKING  */
*Z025SHNK:                          /* LABEL FOR PROCEDURE TRACKING  */
*   RFY                                                            0337
*    (R5,                                                          0337
*     R6,                                                          0337
*     R7,                                                          0337
*     R8,                                                          0337
*     R9,                                                          0337
*     R10) UNRSTD;                  /* PL/S COMPILER WORK REGISTERS  */
Z025     DS    0H                                                  0337
Z025SHNK DS    0H                                                  0338
*   RFY                                                            0338
*    (R2,                                                          0338
*     R3,                                                          0338
*     R4) RSTD;                     /* RESTRICT LOCAL WORK REGISTERS */
*   GEN(STM 12,14,12(13));          /* SAVE REGISTERS OF CALLER      */
         STM 12,14,12(13)
*   GEN(LA 13,12(13));              /* POINT TO NEXT SAVE AREA       */
         LA 13,12(13)
*   GEN(BALR 12,0);                 /* ESTABLISH ADDRESSABILITY      */
         BALR 12,0
*   GEN(LA 15,*-IGGSEGST(0,0));     /* COMPUTE MODULE BASE           */
         LA 15,*-IGGSEGST(0,0)
*   GEN(SR 12,15);                  /* SET BASE TO MODULE BASE     0343
*                                      PROCEDURE                     */
         SR 12,15
*/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
**   MODULE NAME =  IGGPSHNK(IGG0CLAX)                                *
**                                                                    *
**   DESCRIPTIVE NAME =  SHRINK CATALOG FIELD                         *
**                                                                    *
**   FUNCTION =                                                       *
**      THIS SUB-FUNCTION SHRINKS A VARIABLE LENGTH CATALOG FIELD BY  *
**      DELETING A CERTAIN PORTION AND ADDING A SMALLER PORTION.  THE *
**      PROCESSING IS AS FOLLOWS:                                     *
**      1. SHIFT THE CATALOG RECORD TO THE LEFT TO THE POINT IN THE   *
**         VARIABLE LENGTH FIELD WHERE THE DELETE/INSERT IS TO OCCUR. *
**      2. UPDATE THE CATALOG RECORD POINTERS AND SIZES.              *
**      3. INSERT ANY USER PROVIDED DATA.                             *
**                                                                    *
**   INPUT =                                                          *
**      IGGCCA INPUT:                                                 *
**         CCAURAB - RAB ADDRESS OF CATALOG RECORD CONTAINING FIELD   *
**                   TO BE SHRUNK.                                    *
**         CCACPE7 - ADDRESS OF VARIABLE LENGTH FIELD IN THE CATALOG  *
**                   RECORD.                                          *
**         CCAIDPT2 - ADDRESS OF USER INSERT INFORMATION.             *
**         CCADISP - DISPLACEMENT INTO VARIABLE LENGTH FIELD WHERE    *
**                   DELETE/INSERT IS TO OCCURR.                      *
**         CCADLEN - LENGTH OF VARIABLE INFORMATION TO BE DELETED.    *
**         CCADIFF - DIFFERENCE BETWEEN INSERT LENGTH AND DELETE      *
**                   LENGTH.                                          *
**         CCAILNG2 - USER INSERT DATA LENGTH.                        *
**                                                                    *
**   OUTPUT =                                                         *
**      SHRINK OPERATION COMPLETED.                                   *
**      IGGCCA OUTPUT:                                                *
**         CCARBWR - SET ON IN RAB ADDRESSED BY CCAURAB.              *
**                                                                    *
**                                                                    *
** * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
*                                                                  0344
*   RFY                                                            0344
*     RCDAR1 BASED(R3);             /* MOVE AREA                     */
*   RFY                                                            0345
*     RCDAR2 BASED(R4);             /* MOVE AREA                     */
*   R3=CCACPE7+CCADISP+CCAILNG2;    /* POINT TO NEW END OF VAR LENGTH
*                                      SEGMENT                       */
         LH    @10,CCADISP(,R11)                                   0346
         AL    @10,CCACPE7(,R11)                                   0346
         LR    R3,@10                                              0346
         AL    R3,CCAILNG2(,R11)                                   0346
*   R4=CCACPE7+CCADISP+CCADLEN;     /* OLD END VAR SEGMENT           */
         AH    @10,CCADLEN(,R11)                                   0347
         LR    R4,@10                                              0347
*   R2=CCACPE4-R4;                  /* GET MOVE LENGTH               */
         L     @10,CCAURAB(,R11)                                   0348
         L     R2,CCACPE4(,@10)                                    0348
         SLR   R2,R4                                               0348
*   IF R2^=0&R3^=R4 THEN            /* IF SOMETHING TO MOVE          */
         LTR   R2,R2                                               0349
         BZ    @RF00349                                            0349
         CR    R3,R4                                               0349
         BE    @RF00349                                            0349
*     IF R2>MXM THEN                /* IF MULTIPLE MOVE              */
         C     R2,@CF00053                                         0350
         BNH   @RF00350                                            0350
*       DO;                         /* MOVE TWICE                    */
*         RCDAR1(1:MXM)=RCDAR2(1:MXM);/* MOVE ONE PIECE              */
         MVC   RCDAR1(256,R3),RCDAR2(R4)                           0352
*         RCDAR1(MXM+1:R2)=RCDAR2(MXM+1:R2);/* MOVE OTHER PIECE      */
         LR    @10,R2                                              0353
         SL    @10,@CF02876                                        0353
         EX    @10,@SM02896                                        0353
*       END;                        /* END MOVE TWICE                */
*     ELSE                          /* NOT MULTILE MOVE              */
*       RCDAR1(1:R2)=RCDAR2(1:R2);  /* MOVE ONCE                     */
         B     @RC00350                                            0355
@RF00350 LR    @10,R2                                              0355
         BCTR  @10,0                                               0355
         EX    @10,@SM02898                                        0355
*   ELSE                                                           0356
*     ;                             /* NOTHEING TO MOVE              */
@RF00349 DS    0H                                                  0357
*   RCDSIZ=RCDSIZ+CCADIFF;          /* UPDATE RECORD SIZE            */
@RC00349 L     @10,CCAURAB(,R11)                                   0357
         L     @05,CCACPE1(,@10)                                   0357
         LH    @15,CCADIFF(,R11)                                   0357
         ICM   @14,12,RCDSIZ(@05)                                  0357
         SRA   @14,16                                              0357
         ALR   @14,@15                                             0357
         STCM  @14,3,RCDSIZ(@05)                                   0357
*   CCACPE4=CCACPE4+CCADIFF;        /* UPDATE END POINTER            */
         AL    @15,CCACPE4(,@10)                                   0358
         ST    @15,CCACPE4(,@10)                                   0358
*   R2=CCACPE7-CCACPE3;             /* SET DISPLACEMENT              */
         L     R2,CCACPE7(,R11)                                    0359
         SL    R2,CCACPE3(,@10)                                    0359
*   RFY                                                            0360
*     CATGOPT BASED(R3);            /* MAP GOP                       */
*   R3=ADDR(REPGOPT);               /* POINT TO FIRST GOP            */
         L     R3,CCACPE2(,@10)                                    0361
         LA    R3,REPGOPT(,R3)                                     0361
*   DO CCAGVCT=1 TO REPCNT;         /* UPDATE GOPS                   */
         LA    @10,1                                               0362
         B     @DE00362                                            0362
@DL00362 DS    0H                                                  0363
*     IF CATGOEXT=OFF&CATGODEL=OFF& /* IF NON-DELETED, NON-EXT       */
*         CATGODSP>R2 THEN          /* GOP FOR UPDATE                */
         TM    CATGOEXT(R3),B'11000000'                            0363
         BNZ   @RF00363                                            0363
         ICM   @10,12,CATGODSP(R3)                                 0363
         SRA   @10,16                                              0363
         CR    @10,R2                                              0363
         BNH   @RF00363                                            0363
*       CATGODSP=CATGODSP+CCADIFF;  /* SET NEW DISPLACEMENT          */
         AH    @10,CCADIFF(,R11)                                   0364
         STCM  @10,3,CATGODSP(R3)                                  0364
*     ELSE                                                         0365
*       ;                           /* NOT GOP FOR UPDATE            */
@RF00363 DS    0H                                                  0366
*     R3=R3+CCAGOPLN;               /* GET NEXT GOP                  */
         AH    R3,CCAGOPLN(,R11)                                   0366
*   END;                            /* END UPDATE GOP5               */
         LA    @10,1                                               0367
         AH    @10,CCAGVCT(,R11)                                   0367
@DE00362 STH   @10,CCAGVCT(,R11)                                   0367
         L     @05,CCAURAB(,R11)                                   0367
         L     @05,CCACPE2(,@05)                                   0367
         SLR   @15,@15                                             0367
         IC    @15,REPCNT(,@05)                                    0367
         CR    @10,@15                                             0367
         BNH   @DL00362                                            0367
*   VARLEN=VARLEN+CCADIFF;          /* UPDATE LEN FIELD              */
         L     @10,CCACPE7(,R11)                                   0368
         ICM   @05,12,VARLEN(@10)                                  0368
         SRA   @05,16                                              0368
         AH    @05,CCADIFF(,R11)                                   0368
         STCM  @05,3,VARLEN(@10)                                   0368
*   CCARBWR=ON;                     /* MUST WRITE THIS RECORD        */
         L     @05,CCAURAB(,R11)                                   0369
         OI    CCARBWR(@05),B'00010000'                            0369
*   IF CCAILNG2^=0 THEN             /* IS THERE INSERT DATA          */
         L     @05,CCAILNG2(,R11)                                  0370
         LTR   @05,@05                                             0370
         BZ    @RF00370                                            0370
*     VARINFO2(1:CCAILNG2)=VARINFO1(1:CCAILNG2);/* PUT IN INSERT     */
         AH    @10,CCADISP(,R11)                                   0371
         BCTR  @05,0                                               0371
         L     @01,CCAIDPT2(,R11)                                  0371
         EX    @05,@SM02900                                        0371
*   ELSE                                                           0372
*     ;                             /* NO DATA                       */
@RF00370 DS    0H                                                  0373
*   RFY                                                            0373
*     CATGOPT BASED(CCACPE5);       /* ORIGINAL BASE                 */
*   CALL EXIT;                      /* RETURN TO CALLER              */
         BAL   @14,EXIT                                            0374
*   GEN(DS 0F);                     /* FULLWORD BOUNDARY ALIGNMENT   */
         DS 0F
*   GEN(DC CL8'IGGPMBGO');          /* NAME OF FOLLOWING PROCEDURE   */
         DC CL8'IGGPMBGO'
*   END;                            /* END OF INNER PROCEDURE        */
@EL00005 DS    0H                                                  0377
@EF00005 DS    0H                                                  0377
@ER00005 BR    @14                                                 0377
@PB00005 DS    0H                                                  0378
*   GEN(EJECT);                     /* GO TO A NEW PRINT PAGE        */
         EJECT
*                                                                  0379
*/********************************************************************/
*/*                                                                  */
*/*        IGGPMBGO  -  PROCEDURE  INTERNALLY  CALLED  NESTED        */
*/*                                                                  */
*/********************************************************************/
*                                                                  0379
*IGGPMBGO:                                                         0379
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);/* SPECIFY PROCEDURE OPTIONS     */
         B     @PB00006                                            0379
IGGPMBGO DS    0H                                                  0380
*Z026:                              /* LABEL FOR PROCEDURE TRACKING  */
*Z026MBGO:                          /* LABEL FOR PROCEDURE TRACKING  */
*   RFY                                                            0380
*    (R5,                                                          0380
*     R6,                                                          0380
*     R7,                                                          0380
*     R8,                                                          0380
*     R9,                                                          0380
*     R10) UNRSTD;                  /* PL/S COMPILER WORK REGISTERS  */
Z026     DS    0H                                                  0380
Z026MBGO DS    0H                                                  0381
*   RFY                                                            0381
*    (R2,                                                          0381
*     R3,                                                          0381
*     R4) RSTD;                     /* RESTRICT LOCAL WORK REGISTERS */
*   GEN(STM 12,14,12(13));          /* SAVE REGISTERS OF CALLER      */
         STM 12,14,12(13)
*   GEN(LA 13,12(13));              /* POINT TO NEXT SAVE AREA     0383
*                                      PROCEDURE                     */
         LA 13,12(13)
*/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
**   MODULE NAME =  IGGPMBGO(IGG0CLAX)                                *
**                                                                    *
**   DESCRIPTIVE NAME =  MOVE BASE GROUP OCCURRENCE                   *
**                                                                    *
**   FUNCTION =                                                       *
**      THIS SUB-FUNCTION MOVES AN OCCURRENCE IN THE BASE RECORD INTO *
**      AN EXTENSION RECORD.  THE PROCESSING IS AS FOLLOWS:           *
**      1. IF THE AVAILABLE SPACE POINTER DOES NOT HAVE AN EXTENSION  *
**         CI NUMBER, CALL IGGPAXCI(IGG0CLAG) AND IGGPGNEX(IGG0CLAW)  *
**         TO OBTAIN THE EXTENSION WITH AVAILABLE SPACE.              *
**      2. CALL IGGPMGO TO MOVE THE OCCURRENCE TO THE EXTENSION RECORD*
**      3. IF THERE IS NO SPACE IN THE EXTENSION RECORD FOR THE       *
**         OCCURRENCE, CALL IGGPAXCI(IGG0CLAG) AND IGGPGNEX(IGG0CLAW) *
**         TO OBTAIN A NEW EXTENSION AND RE-CALL IGGPMGO TO SUCCESS-  *
**         FULLY MOVE THE OCCURRENCE.                                 *
**                                                                    *
**   INPUT =                                                          *
**      IGGCCA INPUT:                                                 *
**         CCACPE5 - ADDRESS OF GOP POINTING TO OCCURRENCE TO BE MOVED*
**      BASE RECORD ADDRESS                                           *
**                                                                    *
**   OUTPUT =                                                         *
**      GROUP OCCURRENCE MOVED FROM BASE RECORD TO EXTENSION RECORD.  *
**                                                                    *
**                                                                    *
** * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
*                                                                  0384
*   RFY                                                            0384
*     CCARAB BASED(CCARABB);        /* MAP BASE RAB                  */
*   CCACPE51=CCACPE5;               /* AFFECTED OCCURRENCE           */
         L     @10,CCACPE5(,R11)                                   0385
         ST    @10,CCACPE51(,R11)                                  0385
*   IF CATSPCI=0 THEN               /* NO AVAIL SPACE RCD CHECK      */
         L     @10,CCARABB(,R11)                                   0386
         L     @10,CCACPE2(,@10)                                   0386
         ICM   @05,7,CATSPCI+6(@10)                                0386
         BNZ   @RF00386                                            0386
*     DO;                           /* GET NEW SPACE                 */
*                                                                  0387
*       /*************************************************************/
*       /*                                                           */
*       /* CALL TO MODULE IGG0CLAG                                   */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0388
*Z027AXCI:                                                         0388
*       CALL IGGPAXCI;              /* ASSIGN CI                     */
Z027AXCI L     @15,@CV00040                                        0388
         BALR  @14,@15                                             0388
*       CATSPCI=CCAASCI(1);         /* SAVE AVAIL SPACE CI           */
*                                                                  0389
         L     @10,CCARABB(,R11)                                   0389
         L     @10,CCACPE2(,@10)                                   0389
         MVC   CATSPCI+6(3,@10),CCAASCI(R11)                       0389
*       /*************************************************************/
*       /*                                                           */
*       /* CALL TO MODULE IGG0CLAW                                   */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0390
*Z028GNEX:                                                         0390
*       CALL IGGPGNEX;              /* GET NEW EXTENSION             */
Z028GNEX L     @15,@CV00036                                        0390
         BALR  @14,@15                                             0390
*     END;                          /* END GET NEW SPACE             */
*   ELSE                            /* EXISTENT SPACE RCD            */
*     DO;                           /* READ RECORD                   */
         B     @RC00386                                            0392
@RF00386 DS    0H                                                  0393
*       CCASRID=CATSPCI;            /* SET SEARCH ARGUMENT           */
*                                                                  0393
         L     @10,CCARABB(,R11)                                   0393
         L     @10,CCACPE2(,@10)                                   0393
         MVC   CCASRID(3,R11),CATSPCI+6(@10)                       0393
*       /*************************************************************/
*       /*                                                           */
*       /* CALL TO MODULE IGG0CLBA                                   */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0394
*Z029GREC:                                                         0394
*       CALL IGGPGREC;              /* GET RECORD                    */
Z029GREC L     @15,@CV00037                                        0394
         BALR  @14,@15                                             0394
*     END;                          /* END READ RECORD               */
*   CCARABPT=CCARABB;               /* SET BASE RAB ADDR             */
@RC00386 L     @10,CCARABB(,R11)                                   0396
         ST    @10,CCARABPT(,R11)                                  0396
*   CCAONCE=ON;                     /* ONE MOVE                      */
         OI    CCAONCE(R11),B'00001000'                            0397
*Z030MGO:                                                          0398
*   CALL IGGPMGO;                   /* MOVE OCCURRENCES              */
Z030MGO  BAL   @14,IGGPMGO                                         0398
*   IF CCAMNOSP=ON THEN             /* IF NO SPACE                   */
         TM    CCAMNOSP(R11),B'00100000'                           0399
         BNO   @RF00399                                            0399
*     DO;                           /* GET ADDITIONAL SPACE          */
*                                                                  0400
*       /*************************************************************/
*       /*                                                           */
*       /* CALL TO MODULE IGG0CLAG                                   */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0401
*Z031AXCI:                                                         0401
*       CALL IGGPAXCI;              /* ASSIGN CI                     */
Z031AXCI L     @15,@CV00040                                        0401
         BALR  @14,@15                                             0401
*       CATSPCI=CCAASCI(1);         /* SAVE SPACE CI                 */
*                                                                  0402
         L     @10,CCARABB(,R11)                                   0402
         L     @10,CCACPE2(,@10)                                   0402
         MVC   CATSPCI+6(3,@10),CCAASCI(R11)                       0402
*       /*************************************************************/
*       /*                                                           */
*       /* CALL TO MODULE IGG0CLAW                                   */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0403
*Z032GNEX:                                                         0403
*       CALL IGGPGNEX;              /* FORMAT NEW RECORD             */
Z032GNEX L     @15,@CV00036                                        0403
         BALR  @14,@15                                             0403
*Z033MGO:                                                          0404
*       CALL IGGPMGO;               /* MOVE BASE OCCURR              */
Z033MGO  BAL   @14,IGGPMGO                                         0404
*     END;                          /* END GET ADD SPACE             */
*   ELSE                                                           0406
*     ;                             /* MOVE OCCURR COMPLETE          */
@RF00399 DS    0H                                                  0407
*   CCAONCE=OFF;                    /* END ONE MOVE                  */
         NI    CCAONCE(R11),B'11110111'                            0407
*   RFY                                                            0408
*     CCARAB BASED(CCAURAB);        /* ORGINAL BASED                 */
*   CALL EXIT;                      /* RETURN TO CALLER              */
         BAL   @14,EXIT                                            0409
*   GEN(DS 0F);                     /* FULLWORD BOUNDARY ALIGNMENT   */
         DS 0F
*   GEN(DC CL8'IGGPMGO');           /* NAME OF FOLLOWING PROCEDURE   */
         DC CL8'IGGPMGO'
*   END;                            /* END OF INNER PROCEDURE        */
@EL00006 DS    0H                                                  0412
@EF00006 DS    0H                                                  0412
@ER00006 BR    @14                                                 0412
@PB00006 DS    0H                                                  0413
*   GEN(EJECT);                     /* GO TO A NEW PRINT PAGE        */
         EJECT
*                                                                  0414
*/********************************************************************/
*/*                                                                  */
*/*        IGGPMGO  -  PROCEDURE  EXTERNALLY  CALLED  NESTED         */
*/*                                                                  */
*/********************************************************************/
*                                                                  0414
*IGGPMGO:                                                          0414
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);/* SPECIFY PROCEDURE OPTIONS     */
         B     @PB00007                                            0414
IGGPMGO  DS    0H                                                  0415
*   GEN(ENTRY IGGPMGO );            /* IDENTIFY ENTRY-POINT SYMBOL   */
         ENTRY IGGPMGO
*Z034:                              /* LABEL FOR PROCEDURE TRACKING  */
*Z034MGO:                           /* LABEL FOR PROCEDURE TRACKING  */
*   RFY                                                            0416
*    (R5,                                                          0416
*     R6,                                                          0416
*     R7,                                                          0416
*     R8,                                                          0416
*     R9,                                                          0416
*     R10) UNRSTD;                  /* PL/S COMPILER WORK REGISTERS  */
Z034     DS    0H                                                  0416
Z034MGO  DS    0H                                                  0417
*   RFY                                                            0417
*    (R2,                                                          0417
*     R3,                                                          0417
*     R4) RSTD;                     /* RESTRICT LOCAL WORK REGISTERS */
*   GEN(STM 12,14,12(13));          /* SAVE REGISTERS OF CALLER      */
         STM 12,14,12(13)
*   GEN(LA 13,12(13));              /* POINT TO NEXT SAVE AREA       */
         LA 13,12(13)
*   GEN(BALR 12,0);                 /* ESTABLISH ADDRESSABILITY      */
         BALR 12,0
*   GEN(LA 15,*-IGGSEGST(0,0));     /* COMPUTE MODULE BASE           */
         LA 15,*-IGGSEGST(0,0)
*   GEN(SR 12,15);                  /* SET BASE TO MODULE BASE       */
         SR 12,15
*/* PROCEDURE                                                        */
*/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
**   MODULE NAME =  IGGPMGO (IGG0CLAX)                                *
**                                                                    *
**   DESCRIPTIVE NAME =  MOVE GROUP OCCURRENCES                       *
**                                                                    *
**   FUNCTION =                                                       *
**      THIS SUB-FUNCTION MOVES OCCURRENCES FROM ONE CATALOG RECORD TO*
**      ANOTHER CATALOG RECORD.  THE PROCESSING IS AS FOLLOWS:        *
**      1. MOVE ONE OCCURRENCE AT A TIME BY SCANNING THE GOP'S OF THE *
**         RECORD CONTAINING THE OCCURRENCES TO BE MOVED (FIRST       *
**         RECORD).                                                   *
**      2. DO NOT MOVE OCCURRENCES WHICH ARE IN EXTENSION RECORDS,    *
**         WHICH ARE DELETED, WHICH HAVE AN ASSOCIATION OR AN AMDSB   *
**         GROUP CODE.                                                *
**      3. COMPUTE THE LENGTH OF THE OCCURRENCE TO BE MOVED.          *
**      4. IF THERE IS NO ROOM IN THE SECOND RECORD FOR THIS          *
**         OCCURRENCE, EXIT INDICATING THIS CONDITION.                *
**      5. CALL IGGPSGOP(IGG0CLAV) TO FIND A PLACE FOR THE NEW GOP IN *
**         THE SECOND RECORD. CALL IGGPIGOP(IGG0CLAW) TO INSERT THIS  *
**         NEW GOP. CALL IGGPCGO TO COPY THE OLD OCCURRENCE IN THE    *
**         FIRST RECORD INTO THE SECOND RECORD. AND CALL IGGPDGO TO   *
**         DELETE THE OLD OCCURRENCE IN THE FIRST RECORD.             *
**      6. IF THE OLD GROUP OCCURRENCE WAS NOT IN A BASE RECORD, CALL *
**         IGGPDGOP TO DELETE THE OLD GROUP OCCURRENCE POINTER, AND   *
**         UPDATE THE BASE RECORD CONTAINING THE MOVED OCCURRENCES.   *
**         OTHERWISE, ONLY UPDATE THE BASE RECORD GOP.                *
**                                                                    *
**   INPUT =                                                          *
**      IGGCCA INPUT:                                                 *
**         CCARABPT - ADDRESS OF RAB WITH OCCURRENCES TO BE MOVED.    *
**         CCACPE51 - ADDRESS OF GOP FOR FIRST OCCURRENCE TO BE MOVED.*
**         CCAURAB - ADDRESS OF RAB WHERE OCCURRENCES ARE TO BE MOVED *
**                   TO.                                              *
**         CCAONCE - IF ON, ONLY ONE OCCURRENCE IS MOVED.             *
**                                                                    *
**   OUTPUT =                                                         *
**      IGGCCA OUTPUT:                                                *
**         CCAMNOSP - IF ON, INDICATE THAT MORE OCCURRENCES MUST BE   *
**                    MOVED, BUT THERE WAS NO MORE SPACE IN THE RECORD*
**                    ADDRESSED BY CCARABPT.                          *
**                                                                    *
**                                                                    *
** * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
*                                                                  0423
*   DCL                                                            0423
*     VOLRCDID CHAR(1) CONSTANT('V');/* VOL RCD ID                   */
*   DCL                                                            0424
*     CATGOPT1 CHAR(6) BASED(CCACPE5);/* GROUP OCCURR PTR            */
*                                                                  0424
*   /*****************************************************************/
*   /*                                                               */
*   /* DECLARATION OF FIELD INFO FOR MOVE                            */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0425
*   RFY                                                            0425
*     CATGOPT BASED(CCACPE51);      /* MAP GOP                       */
*   DCL                                                            0426
*     CATASCGC FIXED(31) CONSTANT(2);/* ASSOC GRP CODE               */
*   DCL                                                            0427
*     CATDSBGC FIXED(31) CONSTANT(1);/* DSB GRP CODE                 */
*   CCAMNOSP=OFF;                   /* ASSUME SPACE                  */
         NI    CCAMNOSP(R11),B'11011111'                           0428
*   CCAMEX=OFF;                     /* ENTER LOOP                    */
         NI    CCAMEX(R11),B'10111111'                             0429
*   RFY                                                            0430
*     CCARAB BASED(CCARABPT);       /* MAP RAB TO BE COPIED          */
*   DO WHILE(CCACPE51<CCACPE3&CCAMEX=OFF);/* MOVE GROUP OCCURRENCES  */
         B     @DE00431                                            0431
@DL00431 DS    0H                                                  0432
*     IF CATGOEXT=ON×CATGODEL=ON×   /* IF EXT OR DELETED RO          */
*         CATGOGC1=CATASCGC×CATGOGC1=CATDSBGC THEN                 0432
         L     @10,CCACPE51(,R11)                                  0432
         TM    CATGOEXT(@10),B'11000000'                           0432
         BNZ   @RT00432                                            0432
         CLI   CATGOGC1(@10),2                                     0432
         BE    @RT00432                                            0432
         CLI   CATGOGC1(@10),1                                     0432
         BE    @RT00432                                            0432
*       ;                           /* ASSOC OR DSB                  */
*     ELSE                          /* RIGHT GROUP CODE              */
*       DO;                         /* MOVE OCCURRENCE               */
*                                                                  0434
*         /***********************************************************/
*         /*                                                         */
*         /* GET SEQUENCE NO. OF ONE OR TWO BYTES                    */
*         /*                                                         */
*         /***********************************************************/
*                                                                  0435
*         CCAGRHI=0;                /* ZERO SEQ. NO.                 */
         SLR   @10,@10                                             0435
         STH   @10,CCAGRHI(,R11)                                   0435
*         CCAGRHI1(LENGTH(CCASN)+1-CCASL:LENGTH(CCASN))=CATSN(1:CCASL);
         LA    @10,3                                               0436
         SH    @10,CCASL(,R11)                                     0436
         ST    @10,@TF00001                                        0436
         ALR   @10,R11                                             0436
         LA    @05,2                                               0436
         SL    @05,@TF00001                                        0436
         L     @15,CCACPE51(,R11)                                  0436
         EX    @05,@SM02902                                        0436
*         CCAGRGC=(CATGOGC1&TRUEGC);/* SET GROUP CODE                */
         LA    @10,63                                              0437
         SLR   @05,@05                                             0437
         IC    @05,CATGOGC1(,@15)                                  0437
         NR    @10,@05                                             0437
         STC   @10,CCAGRGC(,R11)                                   0437
*         DO;                       /* MOVE GO IF SPACE              */
*           R2=CCACPE3+CATGODSP;    /* POINT TO OCCURRENCE           */
         L     @10,CCARABPT(,R11)                                  0439
         ICM   R2,12,CATGODSP(@15)                                 0439
         SRA   R2,16                                               0439
         AL    R2,CCACPE3(,@10)                                    0439
*           RFY                                                    0440
*             VARFIELD BASED(R4);   /* MAP VARIABLE FIELD BY REG     */
*           RFY                                                    0441
*             CNTRLINF BASED(R2);   /* MAP OCCURR CONTROL INFO       */
*           R4=R2+LENFIX;           /* POINT TO FIRST VAR FIELD      */
         LR    R4,R2                                               0442
         SLR   @10,@10                                             0442
         IC    @10,LENFIX(,R2)                                     0442
         ALR   R4,@10                                              0442
*           DO R3=1 TO CNTVAR;      /* POINT END OCCURR              */
         LA    R3,1                                                0443
         B     @DE00443                                            0443
@DL00443 DS    0H                                                  0444
*             R4=R4+VARLEN+LENGTH(VARLEN);/* POINT END VAR FIELD     */
         LR    @10,R4                                              0444
         ICM   @05,12,VARLEN(R4)                                   0444
         SRA   @05,16                                              0444
         ALR   @10,@05                                             0444
         AL    @10,@CF00082                                        0444
         LR    R4,@10                                              0444
*           END;                    /* END POINT                     */
         AL    R3,@CF00080                                         0445
@DE00443 SLR   @10,@10                                             0445
         IC    @10,CNTVAR(,R2)                                     0445
         CR    R3,@10                                              0445
         BNH   @DL00443                                            0445
*           R3=R4-R2;               /* LENGTH OCCURR                 */
         LR    R3,R4                                               0446
         SLR   R3,R2                                               0446
*           RFY                                                    0447
*             CCARAB BASED(CCAURAB);/* MAP RAB FOR COPY              */
*           IF RCDSIZ+R3+CCAGOPLN>MXRCD/* IF OCCURRENCE AND          */
*             THEN                  /* POINTER NOT FIT               */
         L     @10,CCAURAB(,R11)                                   0448
         L     @10,CCACPE1(,@10)                                   0448
         ICM   @10,12,RCDSIZ(@10)                                  0448
         SRA   @10,16                                              0448
         ALR   @10,R3                                              0448
         LH    @05,CCAGOPLN(,R11)                                  0448
         ALR   @10,@05                                             0448
         C     @10,@CF00055                                        0448
         BNH   @RF00448                                            0448
*             DO;                   /* SET UP EXIT                   */
*               CCAMEX=ON;          /* EXIT INDICATOR                */
         OI    CCAMEX(R11),B'01000000'                             0450
*               CCAMNOSP=ON;        /* NO SPACE                      */
         OI    CCAMNOSP(R11),B'00100000'                           0451
*               CCACPE51=CCACPE51-CCAGOPLN;/* SET UP FOR NEXT CALL   */
         LCR   @05,@05                                             0452
         AL    @05,CCACPE51(,R11)                                  0452
         ST    @05,CCACPE51(,R11)                                  0452
*             END;                  /* END SET UP EXIT               */
*           ELSE                    /* CAN DO MOVE                   */
*             DO;                   /* MOVE                          */
*                                                                  0454
         B     @RC00448                                            0454
@RF00448 DS    0H                                                  0455
*               /*****************************************************/
*               /*                                                   */
*               /* CALL TO MODULE IGG0CLAV                           */
*               /*                                                   */
*               /*****************************************************/
*                                                                  0455
*Z035SGOP:                                                         0455
*               CALL IGGPSGOP;      /* GET GOP POSITION              */
Z035SGOP L     @15,@CV00042                                        0455
         BALR  @14,@15                                             0455
*               CCADELP=OFF;        /* NOT DELETED                   */
*                                                                  0456
         NI    CCADELP(R11),B'10111111'                            0456
*               /*****************************************************/
*               /*                                                   */
*               /* CALL TO MODULE IGG0CLAW                           */
*               /*                                                   */
*               /*****************************************************/
*                                                                  0457
*Z036IGOP:                                                         0457
*               CALL IGGPIGOP;      /* INSERT GOP                    */
Z036IGOP L     @15,@CV00039                                        0457
         BALR  @14,@15                                             0457
*Z037CGO:                                                          0458
*               CALL IGGPCGO;       /* COPY OCCURRENCE               */
Z037CGO  BAL   @14,IGGPCGO                                         0458
*Z038DGO:                                                          0459
*               CALL IGGPDGO;       /* DELETE OLD OCCURRENCE         */
Z038DGO  BAL   @14,IGGPDGO                                         0459
*               IF CCARABPT^=CCARABB THEN/* IF NOT BASE              */
         CLC   CCARABPT(4,R11),CCARABB(R11)                        0460
         BE    @RF00460                                            0460
*                 DO;               /* DELETE GOP, UPDATE BASE       */
*Z039DGOP:                                                         0462
*                   CALL IGGPDGOP;  /* CALL DELETE GOP               */
Z039DGOP BAL   @14,IGGPDGOP                                        0462
*                   RFY                                            0463
*                     CCARAB BASED(CCARABB);/* MAP BASE RAB          */
*                   R2=ADDR(REPGOPT);/* POINT FIRST GOP              */
         L     @10,CCARABB(,R11)                                   0464
         L     R2,CCACPE2(,@10)                                    0464
         LA    R2,REPGOPT(,R2)                                     0464
*                   DO WHILE(R2<CCACPE3);/* SEARCH FOR GOP IN BASE   */
         B     @DE00465                                            0465
@DL00465 DS    0H                                                  0466
*                     RFY                                          0466
*                       CATGOPT BASED(R2);/* MAP GOP                 */
*                     CCASN=0;      /* ZERO SEQ. NO.                 */
*                                                                  0467
         SLR   @10,@10                                             0467
         STH   @10,CCASN(,R11)                                     0467
*                     /***********************************************/
*                     /*                                             */
*                     /* GET VARIABLE LENGTH SEQUENCE NUMBER         */
*                     /*                                             */
*                     /***********************************************/
*                                                                  0468
*                     CCASN1(LENGTH(CCASN)+1-CCASL:LENGTH(CCASN))=CATSN
*                         (1:CCASL);                               0468
         LA    @10,3                                               0468
         SH    @10,CCASL(,R11)                                     0468
         ST    @10,@TF00001                                        0468
         ALR   @10,R11                                             0468
         LA    @05,2                                               0468
         SL    @05,@TF00001                                        0468
         EX    @05,@SM02904                                        0468
*                     IF CCAGRGC=(CATGOGC1&TRUEGC)&/* IF EQUAL GROUP
*                                      CODES                         */
*                         CCASN=CCAGRHI THEN/* AND SEQUENCE NUMBERS  */
         LA    @10,63                                              0469
         SLR   @05,@05                                             0469
         IC    @05,CATGOGC1(,R2)                                   0469
         NR    @10,@05                                             0469
         SLR   @05,@05                                             0469
         IC    @05,CCAGRGC(,R11)                                   0469
         CR    @10,@05                                             0469
         BNE   @RF00469                                            0469
         CLC   CCASN(2,R11),CCAGRHI(R11)                           0469
         BNE   @RF00469                                            0469
*                       DO;         /* UPDATE GOP                    */
*                         CCARBWR=ON;/* WRITE BASE RCD               */
         L     @10,CCARABB(,R11)                                   0471
         OI    CCARBWR(@10),B'00010000'                            0471
*                         CATGOEXT=ON;/* EXTENSION PTR               */
         OI    CATGOEXT(R2),B'10000000'                            0472
*                         RFY                                      0473
*                           CCARAB BASED(CCAURAB);/* MAP COPIED RAB
*                                      AREA                          */
*                         CATGOCI=RCDCINO;/* SET CI NUMBER           */
         L     @10,CCAURAB(,R11)                                   0474
         L     @10,CCACPE1(,@10)                                   0474
         MVC   CATGOCI(3,R2),RCDCINO(@10)                          0474
*                       END;        /* END UPDATE GOP                */
*                     ELSE                                         0476
*                       ;           /* NOT RIGHT GOP                 */
@RF00469 DS    0H                                                  0477
*                     R2=R2+CCAGOPLN;/* TRY NEXT ONE                 */
         AH    R2,CCAGOPLN(,R11)                                   0477
*                   END;            /* END SEARCH                    */
@DE00465 L     @10,CCARABB(,R11)                                   0478
         C     R2,CCACPE3(,@10)                                    0478
         BL    @DL00465                                            0478
*                 END;              /* END DELETE, UPDATE BASE       */
*               ELSE                /* BASE                          */
*                 DO;               /* UPDATE GOP                    */
         B     @RC00460                                            0480
@RF00460 DS    0H                                                  0481
*                   RFY                                            0481
*                     CATGOPT BASED(CCACPE51);/* MAP GOP             */
*                   CATGOEXT=ON;    /* EXTENSION                     */
         L     @10,CCACPE51(,R11)                                  0482
         OI    CATGOEXT(@10),B'10000000'                           0482
*                   RFY                                            0483
*                     CCARAB BASED(CCAURAB);/* MAP COPIED RAB AREA   */
*                   CATGOCI=RCDCINO;/* SET CI NUMBER                 */
         L     @05,CCAURAB(,R11)                                   0484
         L     @05,CCACPE1(,@05)                                   0484
         MVC   CATGOCI(3,@10),RCDCINO(@05)                         0484
*                 END;              /* END UPDATE GOP                */
*             END;                  /* END MOVE                      */
@RC00460 DS    0H                                                  0487
*         END;                      /* END MOVE GO IF SPACE          */
@RC00448 DS    0H                                                  0488
*       END;                        /* END MOVE OCCURRENCE           */
*     IF CCAONCE=ON THEN            /* IF ONE MOVE                   */
@RT00432 TM    CCAONCE(R11),B'00001000'                            0489
         BNO   @RF00489                                            0489
*       CCAMEX=ON;                  /* EXIT                          */
         OI    CCAMEX(R11),B'01000000'                             0490
*     ELSE                                                         0491
*       ;                           /* NOT ONE OCCURR MOVE           */
@RF00489 DS    0H                                                  0492
*     CCACPE51=CCACPE51+CCAGOPLN;   /* GET NEXT GOP                  */
         LH    @10,CCAGOPLN(,R11)                                  0492
         AL    @10,CCACPE51(,R11)                                  0492
         ST    @10,CCACPE51(,R11)                                  0492
*   END;                            /* END MOVE OCCURRENCES          */
@DE00431 L     @10,CCARABPT(,R11)                                  0493
         CLC   CCACPE51(4,R11),CCACPE3(@10)                        0493
         BNL   @DC00431                                            0493
         TM    CCAMEX(R11),B'01000000'                             0493
         BZ    @DL00431                                            0493
@DC00431 DS    0H                                                  0494
*   RFY                                                            0494
*     CATGOPT BASED(CCACPE5);       /* ORIGINAL BASE                 */
*   RFY                                                            0495
*     CCARAB BASED(CCAURAB);        /* ORGINAL BASE                  */
*   RFY                                                            0496
*     VARFIELD BASED(CCACPE7);      /* ORGINAL BASE                  */
*   RFY                                                            0497
*     CNTRLINF BASED(CCACPE6);      /* ORGINAL BASE                  */
*   CALL EXIT;                      /* RETURN TO CALLER              */
         BAL   @14,EXIT                                            0498
*   GEN(DS 0F);                     /* FULLWORD BOUNDARY ALIGNMENT   */
         DS 0F
*   GEN(DC CL8'IGGPCGO');           /* NAME OF FOLLOWING PROCEDURE   */
         DC CL8'IGGPCGO'
*   END;                            /* END OF INNER PROCEDURE        */
@EL00007 DS    0H                                                  0501
@EF00007 DS    0H                                                  0501
@ER00007 BR    @14                                                 0501
@PB00007 DS    0H                                                  0502
*   GEN(EJECT);                     /* GO TO A NEW PRINT PAGE        */
         EJECT
*                                                                  0503
*/********************************************************************/
*/*                                                                  */
*/*        IGGPCGO  -  PROCEDURE  INTERNALLY  CALLED  NESTED         */
*/*                                                                  */
*/********************************************************************/
*                                                                  0503
*IGGPCGO:                                                          0503
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);/* SPECIFY PROCEDURE OPTIONS     */
         B     @PB00008                                            0503
IGGPCGO  DS    0H                                                  0504
*Z040:                              /* LABEL FOR PROCEDURE TRACKING  */
*Z040CGO:                           /* LABEL FOR PROCEDURE TRACKING  */
*   RFY                                                            0504
*    (R5,                                                          0504
*     R6,                                                          0504
*     R7,                                                          0504
*     R8,                                                          0504
*     R9,                                                          0504
*     R10) UNRSTD;                  /* PL/S COMPILER WORK REGISTERS  */
Z040     DS    0H                                                  0504
Z040CGO  DS    0H                                                  0505
*   RFY                                                            0505
*    (R2,                                                          0505
*     R3,                                                          0505
*     R4) RSTD;                     /* RESTRICT LOCAL WORK REGISTERS */
*   GEN(STM 12,14,12(13));          /* SAVE REGISTERS OF CALLER      */
         STM 12,14,12(13)
*   GEN(LA 13,12(13));              /* POINT TO NEXT SAVE AREA     0507
*                                      PROCEDURE                     */
         LA 13,12(13)
*/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
**   MODULE NAME =  IGGPCGO(IGG0CLAX)                                 *
**                                                                    *
**   DESCRIPTIVE NAME =  COPY GROUP OCCURRENCE                        *
**                                                                    *
**   FUNCTION =                                                       *
**      THIS SUB-FUNCTION COPIES A GROUP OCCURRENCE FROM ONE RECORD   *
**      TO ANOTHER RECORD.  IT DOES THIS BY USING THE OLD AND NEW     *
**      GROUP OCCURRENCE POINTERS IN THE TWO RECORDS.                 *
**                                                                    *
**   INPUT =                                                          *
**      IGGCCA INPUT:                                                 *
**         CCARABPT - ADDRESS OF RAB WITH GROUP OCCURRENCE TO BE      *
**                    COPIED.                                         *
**         CCACPE51 - ADDRESS OF GOP ASSOCIATED WITH OCCURRENCE TO    *
**                    BE COPIED.                                      *
**         CCAURAB - ADDRESS OF RAB FOR RECORD TO CONTAIN COPIED      *
**                   OCCURRENCE.                                      *
**         CCACPE5 - ADDRESS OF GOP FOR COPIED OCCURRENCE IN RECORD   *
**                   ADDRESSED BY CCAURAB.                            *
**                                                                    *
**   OUTPUT =                                                         *
**      IGGCCA OUTPUT:                                                *
**         CCACPE6 - ADDRESS OF COPIED OCCURRENCE IN CCAURAB GROUP    *
**                   OCCURRENCE. COPY OPERATION COMPLETED.            *
**                                                                    *
**                                                                    *
** * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
*                                                                  0508
*   RFY                                                            0508
*     RCDAR2 BASED(CCACPE61);       /* OCCURR TO BE MOVED            */
*   RFY                                                            0509
*     RCDAR1 BASED(CCACPE6);        /* COPY OF OCCURR                */
*   RFY                                                            0510
*     CCARAB BASED(CCARABPT);       /* RAB WITH OCCUR FOR MOVE       */
*   RFY                                                            0511
*     CATGOPT BASED(CCACPE51);      /* GOP WITH OCCURR FOR MOVE      */
*   CCACPE61=CCACPE3+CATGODSP;      /* POINT TO OCCURRENCE           */
         L     @10,CCARABPT(,R11)                                  0512
         L     @05,CCACPE51(,R11)                                  0512
         ICM   @05,12,CATGODSP(@05)                                0512
         SRA   @05,16                                              0512
         AL    @05,CCACPE3(,@10)                                   0512
         ST    @05,CCACPE61(,R11)                                  0512
*   RFY                                                            0513
*     CNTRLINF BASED(CCACPE61);     /* CONTROL INFO FOR OCCURR TO BE
*                                      MOVED                         */
*   R2=CCACPE61+LENFIX;             /* GET TO FIRST VAR FIELD        */
         SLR   R2,R2                                               0514
         IC    R2,LENFIX(,@05)                                     0514
         ALR   R2,@05                                              0514
*   DO R3=1 TO CNTVAR;              /* GET TO END OF OCCURR          */
         LA    R3,1                                                0515
         B     @DE00515                                            0515
@DL00515 DS    0H                                                  0516
*     RFY                                                          0516
*       VARFIELD BASED(R2);         /* MAP VAR LENGTH FIELD          */
*     R2=R2+VARLEN+LENGTH(VARLEN);  /* GET PTR TO NEXT FIELD         */
         LR    @10,R2                                              0517
         ICM   @05,12,VARLEN(R2)                                   0517
         SRA   @05,16                                              0517
         ALR   @10,@05                                             0517
         AL    @10,@CF00082                                        0517
         LR    R2,@10                                              0517
*   END;                            /* END GET TO END                */
         AL    R3,@CF00080                                         0518
@DE00515 L     @10,CCACPE61(,R11)                                  0518
         SLR   @05,@05                                             0518
         IC    @05,CNTVAR(,@10)                                    0518
         CR    R3,@05                                              0518
         BNH   @DL00515                                            0518
*   R2=R2-CCACPE61;                 /* GET LENGTH OF OCCURR          */
         L     @10,CCACPE61(,R11)                                  0519
         SLR   R2,@10                                              0519
*   RFY                                                            0520
*     CCARAB BASED(CCAURAB);        /* MAP RCD AREA FOR INSERT       */
*   CCACPE6=CCACPE4;                /* POINT TO OCCURRENCE AREA      */
         L     @05,CCAURAB(,R11)                                   0521
         L     @05,CCACPE4(,@05)                                   0521
         ST    @05,CCACPE6(,R11)                                   0521
*   IF R2^=0 THEN                   /* IF NON-ZERO MOVE LENGTH       */
         LTR   R2,R2                                               0522
         BZ    @RF00522                                            0522
*     IF R2>MXM THEN                /* IF EXCEEDS MAX MOVE           */
         C     R2,@CF00053                                         0523
         BNH   @RF00523                                            0523
*       DO;                         /* MOVE TWICE                    */
*         RCDAR1(1:MXM)=RCDAR2(1:MXM);/* MOVE OCCURRENCE             */
         MVC   RCDAR1(256,@05),RCDAR2(@10)                         0525
*         RCDAR1(MXM+1:R2)=RCDAR2(MXM+1:R2);/* MOVE OCCURRENCE       */
         LR    @15,R2                                              0526
         SL    @15,@CF02876                                        0526
         EX    @15,@SM02907                                        0526
*       END;                        /* END MOVE                      */
*     ELSE                          /* LESS THAN OR EQ MAX MOVE      */
*       RCDAR1(1:R2)=RCDAR2(1:R2);  /* MOVE ONCE                     */
         B     @RC00523                                            0528
@RF00523 L     @10,CCACPE6(,R11)                                   0528
         LR    @05,R2                                              0528
         BCTR  @05,0                                               0528
         L     @01,CCACPE61(,R11)                                  0528
         EX    @05,@SM02909                                        0528
*   ELSE                                                           0529
*     ;                             /* NOTHING TO MOVE               */
@RF00522 DS    0H                                                  0530
*   CCACPE4=CCACPE4+R2;             /* UPDATE END RECORD PTR         */
@RC00522 L     @10,CCAURAB(,R11)                                   0530
         LR    @05,R2                                              0530
         AL    @05,CCACPE4(,@10)                                   0530
         ST    @05,CCACPE4(,@10)                                   0530
*   RCDSIZ=RCDSIZ+R2;               /* UPDATE RECORD SIZE            */
         L     @05,CCACPE1(,@10)                                   0531
         ICM   @15,12,RCDSIZ(@05)                                  0531
         SRA   @15,16                                              0531
         ALR   @15,R2                                              0531
         STCM  @15,3,RCDSIZ(@05)                                   0531
*   RFY                                                            0532
*     CATGOPT BASED(CCACPE5);       /* ORIGINAL BASE                 */
*   CATGOCI=0;                      /* ZERO CI/DISPLACEMENT FLD      */
         L     @05,CCACPE5(,R11)                                   0533
         SLR   @15,@15                                             0533
         STCM  @15,7,CATGOCI(@05)                                  0533
*   CATGODSP=CCACPE6-CCACPE3;       /* DISPLACEMENT TO OCCURR        */
         L     @15,CCACPE6(,R11)                                   0534
         SL    @15,CCACPE3(,@10)                                   0534
         STCM  @15,3,CATGODSP(@05)                                 0534
*   CCARBWR=ON;                     /* WRITE THIS RECORD             */
         OI    CCARBWR(@10),B'00010000'                            0535
*   RFY                                                            0536
*     CNTRLINF BASED(CCACPE6);      /* ORIGINAL BASE                 */
*   RFY                                                            0537
*     VARFIELD BASED(CCACPE7);      /* ORIGINAL BASE                 */
*   CALL EXIT;                      /* RETURN TO CALLER              */
         BAL   @14,EXIT                                            0538
*   GEN(DS 0F);                     /* FULLWORD BOUNDARY ALIGNMENT   */
         DS 0F
*   GEN(DC CL8'IGGPDGO');           /* NAME OF FOLLOWING PROCEDURE   */
         DC CL8'IGGPDGO'
*   END;                            /* END OF INNER PROCEDURE        */
@EL00008 DS    0H                                                  0541
@EF00008 DS    0H                                                  0541
@ER00008 BR    @14                                                 0541
@PB00008 DS    0H                                                  0542
*   GEN(EJECT);                     /* GO TO A NEW PRINT PAGE        */
         EJECT
*                                                                  0543
*/********************************************************************/
*/*                                                                  */
*/*        IGGPDGO  -  PROCEDURE  EXTERNALLY  CALLED  NESTED         */
*/*                                                                  */
*/********************************************************************/
*                                                                  0543
*IGGPDGO:                                                          0543
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);/* SPECIFY PROCEDURE OPTIONS     */
         B     @PB00009                                            0543
IGGPDGO  DS    0H                                                  0544
*   GEN(ENTRY IGGPDGO );            /* IDENTIFY ENTRY-POINT SYMBOL   */
         ENTRY IGGPDGO
*Z041:                              /* LABEL FOR PROCEDURE TRACKING  */
*Z041DGO:                           /* LABEL FOR PROCEDURE TRACKING  */
*   RFY                                                            0545
*    (R5,                                                          0545
*     R6,                                                          0545
*     R7,                                                          0545
*     R8,                                                          0545
*     R9,                                                          0545
*     R10) UNRSTD;                  /* PL/S COMPILER WORK REGISTERS  */
Z041     DS    0H                                                  0545
Z041DGO  DS    0H                                                  0546
*   RFY                                                            0546
*    (R2,                                                          0546
*     R3,                                                          0546
*     R4) RSTD;                     /* RESTRICT LOCAL WORK REGISTERS */
*   GEN(STM 12,14,12(13));          /* SAVE REGISTERS OF CALLER      */
         STM 12,14,12(13)
*   GEN(LA 13,12(13));              /* POINT TO NEXT SAVE AREA       */
         LA 13,12(13)
*   GEN(BALR 12,0);                 /* ESTABLISH ADDRESSABILITY      */
         BALR 12,0
*   GEN(LA 15,*-IGGSEGST(0,0));     /* COMPUTE MODULE BASE           */
         LA 15,*-IGGSEGST(0,0)
*   GEN(SR 12,15);                  /* SET BASE TO MODULE BASE     0551
*                                      PROCEDURE                     */
         SR 12,15
*/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
**   MODULE NAME =  IGGPDGO(IGG0CLAX)                                 *
**                                                                    *
**   DESCRIPTIVE NAME =  DELETE GROUP OCCURRENCE                      *
**                                                                    *
**   FUNCTION =                                                       *
**      THIS SUB-FUNCTION DELETES A GROUP OCCURRENCE FROM A VSAM      *
**      CATALOG RECORD.                                               *
**                                                                    *
**   INPUT =                                                          *
**      IGGCCA INPUT:                                                 *
**         CCARABPT - ADDRESS OF RAB CONTAINING OCCURRENCE TO BE      *
**                    DELETED.                                        *
**         CCACPE51 - ADDRESS OF GOP ASSOCIATED WITH OCCURRENCE TO BE *
**                    DELETED.                                        *
**                                                                    *
**   OUTPUT =                                                         *
**      DELETE GROUP OCCURRENCE OPERATION COMPLETED.                  *
**                                                                    *
**                                                                    *
** * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
*                                                                  0552
*   RFY                                                            0552
*     CCARAB BASED(CCARABPT);       /* MAP DELETE OCCURR RCD AREA    */
*   RFY                                                            0553
*     CATGOPT BASED(CCACPE51);      /* MAP DELETE OCCURR PTR         */
*   CCARBWR=ON;                     /* WRITE RCD                     */
         L     @10,CCARABPT(,R11)                                  0554
         OI    CCARBWR(@10),B'00010000'                            0554
*   CCACPE61=CCACPE3+CATGODSP;      /* POINT TO OCCURRENCE           */
         L     @05,CCACPE51(,R11)                                  0555
         ICM   @05,12,CATGODSP(@05)                                0555
         SRA   @05,16                                              0555
         AL    @05,CCACPE3(,@10)                                   0555
         ST    @05,CCACPE61(,R11)                                  0555
*   RFY                                                            0556
*     CNTRLINF BASED(CCACPE61);     /* MAP CONTROL INFO FOR        0556
*                                      OCCURRENCE                    */
*   R4=CCACPE61+LENFIX;             /* POINT FIRST VAR FIELD         */
         SLR   R4,R4                                               0557
         IC    R4,LENFIX(,@05)                                     0557
         ALR   R4,@05                                              0557
*   DO R3=1 TO CNTVAR;              /* GET END OCCURRENCE            */
         LA    R3,1                                                0558
         B     @DE00558                                            0558
@DL00558 DS    0H                                                  0559
*     RFY                                                          0559
*       VARFIELD BASED(R4);         /* MAP VAR LENGTH FIELD          */
*     R4=R4+VARLEN+LENGTH(VARLEN);  /* GET PTR TO NEXT VAR FLD       */
         LR    @10,R4                                              0560
         ICM   @05,12,VARLEN(R4)                                   0560
         SRA   @05,16                                              0560
         ALR   @10,@05                                             0560
         AL    @10,@CF00082                                        0560
         LR    R4,@10                                              0560
*   END;                            /* END GET END                   */
         AL    R3,@CF00080                                         0561
@DE00558 L     @10,CCACPE61(,R11)                                  0561
         SLR   @05,@05                                             0561
         IC    @05,CNTVAR(,@10)                                    0561
         CR    R3,@05                                              0561
         BNH   @DL00558                                            0561
*   R3=R4;                          /* KEEP PTR TO END OCCURR        */
         LR    R3,R4                                               0562
*   R4=R4-CCACPE61;                 /* GET OCCURR LENGTH             */
         L     @10,CCACPE61(,R11)                                  0563
         SLR   R4,@10                                              0563
*   RCDSIZ=RCDSIZ-R4;               /* REDUCE RECORD SIZE            */
         L     @05,CCARABPT(,R11)                                  0564
         L     @15,CCACPE1(,@05)                                   0564
         ICM   @14,12,RCDSIZ(@15)                                  0564
         SRA   @14,16                                              0564
         SLR   @14,R4                                              0564
         STCM  @14,3,RCDSIZ(@15)                                   0564
*   R2=CCACPE4-R3;                  /* GET MOVE LENGTH               */
         L     @15,CCACPE4(,@05)                                   0565
         LR    R2,@15                                              0565
         SLR   R2,R3                                               0565
*   CCACPE4=CCACPE4-R4;             /* POINT TO END RECORD           */
         SLR   @15,R4                                              0566
         ST    @15,CCACPE4(,@05)                                   0566
*   RFY                                                            0567
*     RCDAR1 BASED(CCACPE61);       /* MAP FOR SHIFT                 */
*   RFY                                                            0568
*     RCDAR2 BASED(R3);             /* MAP FOR LEFT SHIFT            */
*   IF R2^=0 THEN                   /* SOMETHING TO MOVE             */
         LTR   R2,R2                                               0569
         BZ    @RF00569                                            0569
*     IF R2>MXM THEN                /* MAX MOVE EXCEEDED             */
         C     R2,@CF00053                                         0570
         BNH   @RF00570                                            0570
*       DO;                         /* USE TWO MOVES                 */
*         RCDAR1(1:MXM)=RCDAR2(1:MXM);/* MOVE FIRST PART             */
         MVC   RCDAR1(256,@10),RCDAR2(R3)                          0572
*         RCDAR1(MXM+1:R2)=RCDAR2(MXM+1:R2);/* MOVE SECOND PART      */
         LR    @05,R2                                              0573
         SL    @05,@CF02876                                        0573
         EX    @05,@SM02911                                        0573
*       END;                        /* END USE                       */
*     ELSE                          /* USE ONE MOVE                  */
*       RCDAR1(1:R2)=RCDAR2(1:R2);  /* MOVE                          */
         B     @RC00570                                            0575
@RF00570 L     @10,CCACPE61(,R11)                                  0575
         LR    @05,R2                                              0575
         BCTR  @05,0                                               0575
         EX    @05,@SM02913                                        0575
*   ELSE                                                           0576
*     ;                             /* NOTHING TO MOVE               */
@RF00569 DS    0H                                                  0577
*   R2=CCACPE61-CCACPE3;            /* GET DELETED OCCURR          0577
*                                      DISPLACEMENT                  */
@RC00569 L     @10,CCARABPT(,R11)                                  0577
         L     R2,CCACPE61(,R11)                                   0577
         SL    R2,CCACPE3(,@10)                                    0577
*   RFY                                                            0578
*     CATGOPT BASED(R3);            /* MAP GOP                       */
*   R3=ADDR(REPGOPT);               /* POINT TO FIRST GOP            */
         L     R3,CCACPE2(,@10)                                    0579
         LA    R3,REPGOPT(,R3)                                     0579
*   DO CCAGVCT=1 TO REPCNT;         /* UPDATE DISPLACEMENTS          */
         LA    @10,1                                               0580
         B     @DE00580                                            0580
@DL00580 DS    0H                                                  0581
*     IF CATGOEXT=OFF&(CATGODEL=OFF×/* CHECK IF GOP SHOULD           */
*         (CATGODEL=ON&CATGODSP^=0))&/* BE UPDATED                   */
*         CATGODSP>R2 THEN          /* BE UPDATED                    */
         TM    CATGOEXT(R3),B'10000000'                            0581
         BNZ   @RF00581                                            0581
         TM    CATGODEL(R3),B'01000000'                            0581
         BZ    @GL00021                                            0581
         TM    CATGODEL(R3),B'01000000'                            0581
         BNO   @RF00581                                            0581
         ICM   @10,3,CATGODSP(R3)                                  0581
         BZ    @RF00581                                            0581
@GL00021 ICM   @10,12,CATGODSP(R3)                                 0581
         SRA   @10,16                                              0581
         CR    @10,R2                                              0581
         BNH   @RF00581                                            0581
*       CATGODSP=CATGODSP-R4;       /* DECR DISPLACEMENT             */
         SLR   @10,R4                                              0582
         STCM  @10,3,CATGODSP(R3)                                  0582
*     ELSE                                                         0583
*       ;                           /* DONT UPDATE GOP               */
@RF00581 DS    0H                                                  0584
*     R3=R3+CCAGOPLN;               /* GET NEXT GOP                  */
         AH    R3,CCAGOPLN(,R11)                                   0584
*   END;                            /* END UPDATE                    */
         LA    @10,1                                               0585
         AH    @10,CCAGVCT(,R11)                                   0585
@DE00580 STH   @10,CCAGVCT(,R11)                                   0585
         L     @05,CCARABPT(,R11)                                  0585
         L     @05,CCACPE2(,@05)                                   0585
         SLR   @15,@15                                             0585
         IC    @15,REPCNT(,@05)                                    0585
         CR    @10,@15                                             0585
         BNH   @DL00580                                            0585
*   RFY                                                            0586
*     CCARAB BASED(CCAURAB);        /* ORIGINAL BASE                 */
*   RFY                                                            0587
*     CATGOPT BASED(CCACPE5);       /* ORIGINAL BASE                 */
*   RFY                                                            0588
*     CNTRLINF BASED(CCACPE6);      /* ORIGINAL BASE                 */
*   RFY                                                            0589
*     VARFIELD BASED(CCACPE7);      /* ORIGINAL BASE                 */
*   CALL EXIT;                      /* RETURN TO CALLER              */
         BAL   @14,EXIT                                            0590
*   GEN(DS 0F);                     /* FULLWORD BOUNDARY ALIGNMENT   */
         DS 0F
*   GEN(DC CL8'IGGPDGOP');          /* NAME OF FOLLOWING PROCEDURE   */
         DC CL8'IGGPDGOP'
*   END;                            /* END OF INNER PROCEDURE        */
@EL00009 DS    0H                                                  0593
@EF00009 DS    0H                                                  0593
@ER00009 BR    @14                                                 0593
@PB00009 DS    0H                                                  0594
*   GEN(EJECT);                     /* GO TO A NEW PRINT PAGE        */
         EJECT
*                                                                  0595
*/********************************************************************/
*/*                                                                  */
*/*        IGGPDGOP  -  PROCEDURE  EXTERNALLY  CALLED  NESTED        */
*/*                                                                  */
*/********************************************************************/
*                                                                  0595
*IGGPDGOP:                                                         0595
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);/* SPECIFY PROCEDURE OPTIONS     */
         B     @PB00010                                            0595
IGGPDGOP DS    0H                                                  0596
*   GEN(ENTRY IGGPDGOP );           /* IDENTIFY ENTRY-POINT SYMBOL   */
         ENTRY IGGPDGOP
*Z042:                              /* LABEL FOR PROCEDURE TRACKING  */
*Z042DGOP:                          /* LABEL FOR PROCEDURE TRACKING  */
*   RFY                                                            0597
*    (R5,                                                          0597
*     R6,                                                          0597
*     R7,                                                          0597
*     R8,                                                          0597
*     R9,                                                          0597
*     R10) UNRSTD;                  /* PL/S COMPILER WORK REGISTERS  */
Z042     DS    0H                                                  0597
Z042DGOP DS    0H                                                  0598
*   RFY                                                            0598
*    (R2,                                                          0598
*     R3,                                                          0598
*     R4) RSTD;                     /* RESTRICT LOCAL WORK REGISTERS */
*   GEN(STM 12,14,12(13));          /* SAVE REGISTERS OF CALLER      */
         STM 12,14,12(13)
*   GEN(LA 13,12(13));              /* POINT TO NEXT SAVE AREA       */
         LA 13,12(13)
*   GEN(BALR 12,0);                 /* ESTABLISH ADDRESSABILITY      */
         BALR 12,0
*   GEN(LA 15,*-IGGSEGST(0,0));     /* COMPUTE MODULE BASE           */
         LA 15,*-IGGSEGST(0,0)
*   GEN(SR 12,15);                  /* SET BASE TO MODULE BASE     0603
*                                      PROCEDURE                     */
         SR 12,15
*/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
**   MODULE NAME =  IGGPDGOP(IGG0CLAX)                                *
**                                                                    *
**   DESCRIPTIVE NAME =  DELETE GROUP OCCURRENCE POINTER              *
**                                                                    *
**   FUNCTION =                                                       *
**      THIS SUB-FUNCTION DELETES A GROUP OCCURRENCE POINTER FROM A   *
**      CATALOG RECORD.                                               *
**                                                                    *
**   INPUT =                                                          *
**      IGGCCA INPUT:                                                 *
**         CCARABPT - ADDRESS OF RAB CONTAINING GROUP OCCURRENCE      *
**                    POINTER TO BE DELETED.                          *
**         CCACPE51 - ADDRESS OF GOP TO BE DELETED.                   *
**                                                                    *
**   OUTPUT =                                                         *
**      DELETE GROUP OCCURRENCE POINTER OPERATION COMPLETED.          *
**                                                                    *
**                                                                    *
** * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
*                                                                  0604
*   RFY                                                            0604
*     RCDAR1 BASED(CCACPE51);       /* SHIFT RECORD INFO             */
*   RFY                                                            0605
*     RCDAR2 BASED(R3);             /* SHIFT RECORD INFO             */
*   RFY                                                            0606
*     CCARAB BASED(CCARABPT);       /* RCD AREA FOR DELETION         */
*   RCDSIZ=RCDSIZ-CCAGOPLN;         /* REDUCE RECORD SIZE            */
         L     @10,CCARABPT(,R11)                                  0607
         L     @05,CCACPE1(,@10)                                   0607
         LH    @15,CCAGOPLN(,R11)                                  0607
         ICM   @14,12,RCDSIZ(@05)                                  0607
         SRA   @14,16                                              0607
         SLR   @14,@15                                             0607
         STCM  @14,3,RCDSIZ(@05)                                   0607
*   REPCNT=REPCNT-1;                /* DECR OCCURR PTR COUNT         */
         L     @05,CCACPE2(,@10)                                   0608
         SLR   @14,@14                                             0608
         IC    @14,REPCNT(,@05)                                    0608
         BCTR  @14,0                                               0608
         STC   @14,REPCNT(,@05)                                    0608
*   CCACPE3=CCACPE3-CCAGOPLN;       /* POINT TO FIRST OCCURR         */
         L     @05,CCACPE3(,@10)                                   0609
         SLR   @05,@15                                             0609
         ST    @05,CCACPE3(,@10)                                   0609
*   R3=CCACPE51+CCAGOPLN;           /* POINT TO INFO FOR MOVE        */
         L     @05,CCACPE51(,R11)                                  0610
         LR    R3,@05                                              0610
         ALR   R3,@15                                              0610
*   R2=CCACPE4-R3;                  /* GET MOVE LENGTH               */
         L     @14,CCACPE4(,@10)                                   0611
         LR    R2,@14                                              0611
         SLR   R2,R3                                               0611
*   CCACPE4=CCACPE4-CCAGOPLN;       /* GET END OF RCD POINTER        */
         SLR   @14,@15                                             0612
         ST    @14,CCACPE4(,@10)                                   0612
*   IF R2^=0 THEN                   /* SOMETHING TO MOVE             */
         LTR   R2,R2                                               0613
         BZ    @RF00613                                            0613
*     IF R2>MXM THEN                /* MULTIPLE MOVE                 */
         C     R2,@CF00053                                         0614
         BNH   @RF00614                                            0614
*       DO;                         /* USE TWO MOVES                 */
*         RCDAR1(1:MXM)=RCDAR2(1:MXM);/* MOVE FIRST PART             */
         MVC   RCDAR1(256,@05),RCDAR2(R3)                          0616
*         RCDAR1(MXM+1:R2)=RCDAR2(MXM+1:R2);/* MOVE SECOND PART      */
         LR    @10,R2                                              0617
         SL    @10,@CF02876                                        0617
         EX    @10,@SM02915                                        0617
*       END;                        /* END USE TWO                   */
*     ELSE                          /* USE ONE MOVE                  */
*       RCDAR1(1:R2)=RCDAR2(1:R2);  /* MOVE                          */
         B     @RC00614                                            0619
@RF00614 L     @10,CCACPE51(,R11)                                  0619
         LR    @05,R2                                              0619
         BCTR  @05,0                                               0619
         EX    @05,@SM02913                                        0619
*   ELSE                                                           0620
*     ;                             /* NOTHING TO MOVE               */
@RF00613 DS    0H                                                  0621
*   CCARBWR=ON;                     /* WRITE RECORD                  */
@RC00613 L     @10,CCARABPT(,R11)                                  0621
         OI    CCARBWR(@10),B'00010000'                            0621
*   RFY                                                            0622
*     CCARAB BASED(CCAURAB);        /* ORIGINAL BASE                 */
*   CALL EXIT;                      /* RETURN TO CALLER              */
         BAL   @14,EXIT                                            0623
*   END;                            /* END OF INNER PROCEDURE        */
@EL00010 DS    0H                                                  0624
@EF00010 DS    0H                                                  0624
@ER00010 BR    @14                                                 0624
@PB00010 DS    0H                                                  0625
*   GEN(EJECT);                     /* GO TO A NEW PRINT PAGE        */
         EJECT
*                                                                  0626
*/********************************************************************/
*/*                                                                  */
*/*         RETURN-TO-CALLER  PROCEDURE-EXITING  SUBFUNCTION         */
*/*                                                                  */
*/********************************************************************/
*                                                                  0626
*EXIT:                                                             0626
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);/* SPECIFY PROCEDURE OPTIONS     */
         B     @PB00011                                            0626
EXIT     DS    0H                                                  0627
*   GEN(LM 12,14,0(13));            /* RESTORE REGISTERS OF CALLER   */
         LM 12,14,0(13)
*   GEN(MVI 12(13),255);            /* MARK END OF PDL               */
         MVI 12(13),255
*   GEN(BR 14);                     /* RETURN TO CALLER              */
         BR 14
*PATCH:                                                            0630
*   GEN(DC (12+((*+139-@MAINENT)/140))A(0));/* PATCH AREA            */
PATCH    DC (12+((*+139-@MAINENT)/140))A(0)
*   END;                            /* END OF EXIT PROCEDURE         */
@EL00011 DS    0H                                                  0631
@EF00011 DS    0H                                                  0631
@ER00011 BR    @14                                                 0631
*   END                             /* END PROCEDURE                 */
*                                                                  0632
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */
*/*%INCLUDE SYSLIB  (IGGMCDCL)                                       */
*/*%INCLUDE SYSLIB  (IGGMCTRC)                                       */
*/*%INCLUDE SYSLIB  (IGGCCA  )                                       */
*/*%INCLUDE SYSLIB  (IEZCTGPL)                                       */
*/*%INCLUDE SYSLIB  (IEZCTGFL)                                       */
*/*%INCLUDE SYSLIB  (CVT     )                                       */
*/*%INCLUDE SYSLIB  (IKJTCB  )                                       */
*/*%INCLUDE SYSLIB  (IHAPSA  )                                       */
*/*%INCLUDE SYSLIB  (IFGACB  )                                       */
*/*%INCLUDE SYSLIB  (AMCBS   )                                       */
*/*%INCLUDE SYSLIB  (IGGCAXWA)                                       */
*/*%INCLUDE SYSLIB  (IEZCTGFV)                                       */
*/*%INCLUDE SYSLIB  (IEZCTGWA)                                       */
*/*%INCLUDE SYSLIB  (IEZCTGVL)                                       */
*/*%INCLUDE SYSLIB  (IEZCTGCV)                                       */
*                                                                  0632
*       ;                                                          0632
@EL00001 DS    0H                                                  0632
@EF00001 DS    0H                                                  0632
@ER00001 BR    @14                                                 0632
@DATA    DS    0H
@SM02888 MVC   INSERT1(0,@10),INSERT2(@01)
@SM02892 MVC   RCDMV2(0,@10),RCDMV1(@15)
@SM02894 MVC   VARINFO2(0,@05),VARINFO1+2(@01)
@SM02896 MVC   RCDAR1+256(0,R3),RCDAR2+256(R4)
@SM02898 MVC   RCDAR1(0,R3),RCDAR2(R4)
@SM02900 MVC   VARINFO2(0,@10),VARINFO1+2(@01)
@SM02902 MVC   CCAGRHI1-1(0,@10),CATSN+4(@15)
@SM02904 MVC   CCASN1-1(0,@10),CATSN+4(R2)
@SM02907 MVC   RCDAR1+256(0,@05),RCDAR2+256(@10)
@SM02909 MVC   RCDAR1(0,@10),RCDAR2(@01)
@SM02911 MVC   RCDAR1+256(0,@10),RCDAR2+256(R3)
@SM02913 MVC   RCDAR1(0,@10),RCDAR2(R3)
@SM02915 MVC   RCDAR1+256(0,@05),RCDAR2+256(R3)
@DATD    DSECT
         DS    0F
@TF00001 DS    F
IGG0CLAX CSECT
         DS    0F
@CF00080 DC    F'1'
@CF00082 DC    F'2'
@CF00053 DC    F'256'
@CF02876 DC    F'257'
@CF00055 DC    F'505'
@CF02875 DC    F'-1041825672'
@CF02881 DC    F'-4'
@CF02880 DC    F'-1'
@DATD    DSECT
         DS    0D
@TS00001 DS    CL1
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA
@ENDDATD EQU   *
IGG0CLAX CSECT
         DS    0F
@SIZDATD DC    AL1(0)
         DC    AL3(@ENDDATD-@DATD)
@CV00036 DC    V(IGGPGNEX)
@CV00037 DC    V(IGGPGREC)
@CV00038 DC    V(IGGPGVAL)
@CV00039 DC    V(IGGPIGOP)
@CV00040 DC    V(IGGPAXCI)
@CV00041 DC    V(IGGPDEIN)
@CV00042 DC    V(IGGPSGOP)
         DS    0D
@00      EQU   00                      EQUATES FOR REGISTERS 0-15
@01      EQU   01
@02      EQU   02
@03      EQU   03
@04      EQU   04
@05      EQU   05
@06      EQU   06
@07      EQU   07
@08      EQU   08
@09      EQU   09
@10      EQU   10
@11      EQU   11
@12      EQU   12
@13      EQU   13
@14      EQU   14
@15      EQU   15
IGGSEGBR EQU   @12
R3       EQU   @03
RWA      EQU   @02
R2       EQU   @02
R4       EQU   @04
R5       EQU   @05
R6       EQU   @06
R7       EQU   @07
R8       EQU   @08
R9       EQU   @09
R10      EQU   @10
R11      EQU   @11
R12      EQU   @12
RET      EQU   @14
RFLD     EQU   @04
RGO      EQU   @15
RNDX     EQU   @03
RP0      EQU   @00
RP1      EQU   @01
RSAVE    EQU   @13
RWK1     EQU   @06
RWK2     EQU   @07
RWK3     EQU   @08
RWK4     EQU   @09
RZERO    EQU   @00
R0       EQU   @00
R1       EQU   @01
R13      EQU   @13
R14      EQU   @14
R15      EQU   @15
WKR2     EQU   @02
WKR3     EQU   @03
WKR4     EQU   @04
CVTPTR   EQU   16
PSA      EQU   0
FLCRNPSW EQU   PSA
FLCROPSW EQU   PSA+8
FLCICCW2 EQU   PSA+16
PSAEEPSW EQU   PSA+132
PSAESPSW EQU   PSA+136
FLCSVILC EQU   PSAESPSW+1
PSAEPPSW EQU   PSA+140
FLCPIILC EQU   PSAEPPSW+1
FLCPICOD EQU   PSAEPPSW+2
PSAPICOD EQU   FLCPICOD+1
FLCTEA   EQU   PSAEPPSW+4
FLCPER   EQU   PSA+152
FLCMCLA  EQU   PSA+168
FLCIOEL  EQU   FLCMCLA+4
FLCIOA   EQU   FLCMCLA+16
FLCFSA   EQU   FLCMCLA+80
PSASUPER EQU   PSA+552
PSASUP1  EQU   PSASUPER
PSASUP2  EQU   PSASUPER+1
PSASUP3  EQU   PSASUPER+2
PSASUP4  EQU   PSASUPER+3
PSACLHT  EQU   PSA+640
PSALKSA  EQU   PSA+696
PSAHLHI  EQU   PSA+760
PSADSSFL EQU   PSA+836
PSADSSF1 EQU   PSADSSFL
PSADSSF3 EQU   PSADSSFL+2
PSADSSF4 EQU   PSADSSFL+3
PSARSVT  EQU   PSA+896
RCDAR2   EQU   0
RCDAR1   EQU   0
RCDMV2   EQU   0
RCDMV1   EQU   0
INSERT1  EQU   0
INSERT2  EQU   0
DTENT    EQU   0
DTINFO   EQU   DTENT+4
CDTENT   EQU   0
VARINFO1 EQU   0
VARINFO2 EQU   0
CATGOSP  EQU   0
CATSPCI  EQU   CATGOSP
IGGCCA   EQU   0
CCAPROB  EQU   IGGCCA+4
CCAERRCD EQU   CCAPROB+2
CCAREASN EQU   CCAERRCD
CCARETRN EQU   CCAERRCD+1
CCACD1   EQU   CCARETRN
CCAFLG1  EQU   IGGCCA+14
CCAFLG2  EQU   IGGCCA+15
CCAF2COB EQU   CCAFLG2
CCAFLG3  EQU   IGGCCA+16
CCANF    EQU   CCAFLG3
CCAELC2  EQU   CCAFLG3
CCAFLG4  EQU   IGGCCA+17
CCAGVNC  EQU   CCAFLG4
CCAGVNF  EQU   CCAFLG4
CCAGVNE  EQU   CCAFLG4
CCAFLG5  EQU   IGGCCA+18
CCAMEX   EQU   CCAFLG5
CCAMEX1  EQU   CCAFLG5
CCAFLG6  EQU   IGGCCA+19
CCADELP  EQU   CCAFLG6
CCAMNOSP EQU   CCAFLG6
CCAMOD   EQU   CCAFLG6
CCATCB   EQU   IGGCCA+20
CCARB    EQU   IGGCCA+24
CCACPL   EQU   IGGCCA+28
CCAACB   EQU   IGGCCA+32
CCAURAB  EQU   IGGCCA+40
CCASRCH  EQU   IGGCCA+44
CCASRID  EQU   CCASRCH
CCARAB0  EQU   IGGCCA+88
CCAR0FLG EQU   CCARAB0
CCAR0SEG EQU   CCARAB0+8
CCARAB1  EQU   IGGCCA+108
CCAR1FLG EQU   CCARAB1
CCAR1SEG EQU   CCARAB1+8
CCARAB2  EQU   IGGCCA+128
CCAR2FLG EQU   CCARAB2
CCAR2SEG EQU   CCARAB2+8
CCARAB3  EQU   IGGCCA+148
CCAR3FLG EQU   CCARAB3
CCAR3SEG EQU   CCARAB3+8
CCARAB4  EQU   IGGCCA+168
CCAR4FLG EQU   CCARAB4
CCAR4SEG EQU   CCARAB4+8
CCARAB5  EQU   IGGCCA+188
CCAR5FLG EQU   CCARAB5
CCAR5SEG EQU   CCARAB5+8
CCADESA  EQU   IGGCCA+224
CCAEXTDE EQU   CCADESA+4
CCAEXTAD EQU   CCAEXTDE+2
CCAASCI  EQU   IGGCCA+271
CCAEQDQ  EQU   IGGCCA+280
CCAEDOPT EQU   CCAEQDQ+2
CCAMSSPL EQU   IGGCCA+300
CCACMS   EQU   IGGCCA+316
CCACPE5  EQU   IGGCCA+324
CCACPE51 EQU   IGGCCA+328
CCACPE52 EQU   IGGCCA+332
CCACPE6  EQU   IGGCCA+340
CCACPE61 EQU   IGGCCA+344
CCACPE7  EQU   IGGCCA+348
CCAIDPT  EQU   CCACPE7
CCAGOPLN EQU   IGGCCA+356
CCASL    EQU   IGGCCA+358
CCAILNG  EQU   IGGCCA+360
CCAFLPT  EQU   IGGCCA+364
CCARABPT EQU   IGGCCA+368
CCADICT  EQU   IGGCCA+372
CCAXCPL  EQU   IGGCCA+376
CCARABB  EQU   IGGCCA+380
CCALREL  EQU   IGGCCA+396
CCASN    EQU   IGGCCA+398
CCASN1   EQU   CCASN
CCARBA   EQU   IGGCCA+448
CCACRAVL EQU   CCARBA
CCACRADT EQU   CCARBA+6
CCATLNG  EQU   IGGCCA+468
CCACNIX  EQU   IGGCCA+472
CCAIDPT2 EQU   IGGCCA+476
CCAIDPT3 EQU   IGGCCA+480
CCAGVCT  EQU   IGGCCA+484
CCAGVEXT EQU   IGGCCA+488
CCAGRGC  EQU   IGGCCA+493
CCAGRHI  EQU   IGGCCA+494
CCASSEQ  EQU   CCAGRHI
CCAGRHI1 EQU   CCASSEQ
CCADLEN  EQU   IGGCCA+498
CCADIFF  EQU   IGGCCA+500
CCADISP  EQU   IGGCCA+504
CCADTA   EQU   IGGCCA+512
CCACDTA  EQU   IGGCCA+516
CCAILNG2 EQU   IGGCCA+536
CCAFLG7  EQU   IGGCCA+552
CCAONCE  EQU   CCAFLG7
CCAFLG8  EQU   IGGCCA+553
CCAFLG9  EQU   IGGCCA+554
CCASMFLG EQU   IGGCCA+562
CCASMFG1 EQU   CCASMFLG
CCASMFUC EQU   CCASMFG1
CCASMFSR EQU   CCASMFG1
CCABMINP EQU   IGGCCA+684
CCABMFLG EQU   CCABMINP+6
CCABMOUT EQU   IGGCCA+692
CCABMOFG EQU   CCABMOUT+4
CCATEMPS EQU   IGGCCA+744
CCAMNCAT EQU   IGGCCA+784
CCAMNAT  EQU   CCAMNCAT
MNATTOP  EQU   CCAMNAT
MNATFLGS EQU   CCAMNAT+240
CCAARFWA EQU   IGGCCA+1040
ARFGMLEN EQU   CCAARFWA
CCARVFG1 EQU   IGGCCA+1056
CCAREGS  EQU   IGGCCA+1060
CCABZSAV EQU   IGGCCA+1408
CCARALSA EQU   IGGCCA+1440
CCAFLG10 EQU   IGGCCA+1444
CCASMFP  EQU   IGGCCA+1480
CCAPROBX EQU   IGGCCA+1484
CCAERCDX EQU   CCAPROBX+2
CTGPL    EQU   0
CTGOPTN1 EQU   CTGPL
CTGOPTN2 EQU   CTGPL+1
CTGEXT   EQU   CTGOPTN2
CTGERASE EQU   CTGOPTN2
CTGSMF   EQU   CTGERASE
CTGREL   EQU   CTGSMF
CTGPURG  EQU   CTGOPTN2
CTGVMNT  EQU   CTGPURG
CTGOPTN3 EQU   CTGPL+2
CTGOPTN4 EQU   CTGPL+3
CTGENT   EQU   CTGPL+4
CTGFVT   EQU   CTGENT
CTGCAT   EQU   CTGPL+8
CTGCVOL  EQU   CTGCAT
CTGWKA   EQU   CTGPL+12
CTGDSORG EQU   CTGPL+16
CTGDDNM  EQU   CTGPL+20
CTGNEWNM EQU   CTGDDNM
CTGFBFLG EQU   CTGNEWNM+2
CTGJSCB  EQU   CTGPL+24
CTGFL    EQU   0
CTGFLDNO EQU   CTGFL
CTGFLDGC EQU   CTGFL+2
CTGFLDRE EQU   CTGFL+3
CTGFLDWA EQU   CTGFL+4
CTGFLDNM EQU   CTGFL+8
CTGFLDAT EQU   CTGFL+16
CTGFLNG  EQU   CTGFLDAT
CTGFLPT  EQU   CTGFLDAT+4
USERWKA  EQU   0
WKA      EQU   USERWKA+4
ENTNAMES EQU   WKA
CTGVLDSP EQU   0
DICTENT  EQU   0
DICTFLGS EQU   DICTENT
DICTST   EQU   DICTENT+1
DICTLC   EQU   DICTENT+2
DIC2ENT  EQU   0
DIC2FLGS EQU   DIC2ENT
DIC2VAR  EQU   DIC2FLGS
DIC2REP  EQU   DIC2FLGS
DIC2ST   EQU   DIC2ENT+1
DIC2LC   EQU   DIC2ENT+2
CCARAB   EQU   0
CCARABFL EQU   CCARAB
CCARBU1  EQU   CCARABFL
CCARBWR  EQU   CCARABFL
CCACPE1  EQU   CCARAB+4
CCACPE2  EQU   CCARAB+8
CCACPE3  EQU   CCARAB+12
CCACPE4  EQU   CCARAB+16
CATGOPT  EQU   0
CATGOCI  EQU   CATGOPT
CATGOFLG EQU   CATGOCI
CATGODSP EQU   CATGOCI+1
CATGOGC1 EQU   CATGOPT+3
CATGOEXT EQU   CATGOGC1
CATGODEL EQU   CATGOGC1
CATGOSEQ EQU   CATGOPT+4
CATSN    EQU   0
CATRCD   EQU   0
RCDCINO  EQU   CATRCD+1
RCDSIZ   EQU   CATRCD+45
REPCNTRL EQU   0
EXTRCDPT EQU   REPCNTRL
REPCNT   EQU   REPCNTRL+5
REPGOPT  EQU   REPCNTRL+6
VARFIELD EQU   0
VARLEN   EQU   VARFIELD
CNTRLINF EQU   0
CNTVAR   EQU   CNTRLINF
LENFIX   EQU   CNTRLINF+1
CVTMAP   EQU   0
CVTTCBP  EQU   CVTMAP
CVTDAR   EQU   CVTMAP+72
CVTFLGS1 EQU   CVTDAR
CVTDCB   EQU   CVTMAP+116
CVTIERLC EQU   CVTMAP+144
CVTOPTA  EQU   CVTMAP+182
CVTOPTB  EQU   CVTMAP+183
CVTGTF   EQU   CVTMAP+236
CVTGTFST EQU   CVTGTF
CVTGTFS  EQU   CVTGTFST
CVTSTATE EQU   CVTGTFST
CVTTMODE EQU   CVTGTFST
CVTFORM  EQU   CVTGTFST
CVTAQAVT EQU   CVTMAP+240
CVTTCMFG EQU   CVTAQAVT
CVTVOLM2 EQU   CVTMAP+244
CVTTATA  EQU   CVTVOLM2
CVTTSKS  EQU   CVTTATA
CVTVOLF2 EQU   CVTTSKS
CVTTAT   EQU   CVTTATA+1
CVTATER  EQU   CVTMAP+248
CVTEXT1  EQU   CVTMAP+252
CVTCBSP  EQU   CVTMAP+256
CVTPURG  EQU   CVTMAP+260
CVTAMFF  EQU   CVTMAP+264
CVTQMSG  EQU   CVTMAP+268
CVTDMSR  EQU   CVTMAP+272
CVTERPV  EQU   CVTMAP+316
CVTINTLA EQU   CVTMAP+320
CVTAPF   EQU   CVTMAP+324
CVTEXT2  EQU   CVTMAP+328
CVTHJES  EQU   CVTMAP+332
CVTPGSIA EQU   CVTMAP+348
CVTA1F1  EQU   CVTMAP+356
CVTSYSK  EQU   CVTMAP+357
CVTVOLM1 EQU   CVTMAP+380
CVTVOLF1 EQU   CVTVOLM1
CVTATMCT EQU   CVTMAP+388
CVTXTNT1 EQU   0
CVTXTNT2 EQU   0
CVTDSSV  EQU   CVTXTNT2
CVTFLGBT EQU   CVTXTNT2+5
CVTQID   EQU   CVTXTNT2+24
CVTRV400 EQU   CVTXTNT2+52
CVTRV409 EQU   CVTXTNT2+53
CVTATCVT EQU   CVTXTNT2+64
CVTRV429 EQU   CVTXTNT2+84
CVTRV438 EQU   CVTXTNT2+85
CVTRV457 EQU   CVTXTNT2+112
CVTRV466 EQU   CVTXTNT2+113
CVTFIX   EQU   0
CVTRELNO EQU   CVTFIX+252
TCBWORDS EQU   0
TCBPTR   EQU   TCBWORDS+4
TCBFIX   EQU   0
TCBFRS   EQU   TCBFIX
TCB      EQU   0
TCBPIE   EQU   TCB+4
TCBPMASK EQU   TCBPIE
TCBCMP   EQU   TCB+16
TCBCMPF  EQU   TCBCMP
TCBCPP   EQU   TCBCMPF
TCBSTCC  EQU   TCBCMPF
TCBCDBL  EQU   TCBCMPF
TCBCWTO  EQU   TCBCMPF
TCBCIND  EQU   TCBCMPF
TCBCMSG  EQU   TCBCMPF
TCBTRN   EQU   TCB+20
TCBABF   EQU   TCBTRN
TCBMSS   EQU   TCB+24
TCBPKF   EQU   TCB+28
TCBFLGS  EQU   TCB+29
TCBFLGS1 EQU   TCBFLGS
TCBFLGS2 EQU   TCBFLGS+1
TCBFLGS3 EQU   TCBFLGS+2
TCBFLGS4 EQU   TCBFLGS+3
TCBFLGS5 EQU   TCBFLGS+4
TCBABWF  EQU   TCBFLGS5
TCBJPQ   EQU   TCB+44
TCBPURGE EQU   TCBJPQ
TCBGRS   EQU   TCB+48
TCBFSA   EQU   TCB+112
TCBTME   EQU   TCB+120
TCBJSTCB EQU   TCB+124
TCBTSFLG EQU   TCB+148
TCBTSTSK EQU   TCBTSFLG
TCBSTAB  EQU   TCB+160
TCBNSTAE EQU   TCBSTAB
TCBTCT   EQU   TCB+164
TCBTCTGF EQU   TCBTCT
TCBSCNDY EQU   TCB+172
TCBNDSP  EQU   TCBSCNDY
TCBNDSP1 EQU   TCBNDSP+1
TCBNDSP2 EQU   TCBNDSP+2
TCBNDSP3 EQU   TCBNDSP+3
TCBJSCB  EQU   TCB+180
TCBRECDE EQU   TCBJSCB
TCBEXT1  EQU   TCB+196
TCBBITS  EQU   TCB+200
TCBNDSP4 EQU   TCBBITS
TCBNDSP5 EQU   TCBBITS+1
TCBFLGS6 EQU   TCBBITS+2
TCBFLGS7 EQU   TCBBITS+3
TCBDAR   EQU   TCB+204
TCBDARC  EQU   TCBDAR
TCBEXT2  EQU   TCB+208
TCBFOE   EQU   TCB+244
TCBESTAE EQU   TCB+264
TCBESTRM EQU   TCBESTAE+1
TCBFBYT1 EQU   TCB+276
TCBFBYT2 EQU   TCB+277
TCBRV124 EQU   TCB+278
TCBRV133 EQU   TCB+279
TCBXTNT2 EQU   0
TCBGTF   EQU   TCBXTNT2
TCBTFLG  EQU   TCBGTF
TCBRV146 EQU   TCBXTNT2+28
TCBRV155 EQU   TCBXTNT2+29
TCBRV164 EQU   TCBXTNT2+30
TCBRV173 EQU   TCBXTNT2+31
IFGACB   EQU   0
ACBCOMN  EQU   IFGACB
ACBLENG  EQU   ACBCOMN+2
ACBLENG2 EQU   ACBLENG
ACBAMBL  EQU   ACBCOMN+4
ACBJWA   EQU   ACBAMBL
ACBMACRF EQU   ACBCOMN+12
ACBMACR1 EQU   ACBMACRF
ACBADR   EQU   ACBMACR1
ACBCNV   EQU   ACBMACR1
ACBMACR2 EQU   ACBMACRF+1
ACBBUFPL EQU   ACBCOMN+20
ACBMACR3 EQU   ACBBUFPL
ACBRECFM EQU   ACBCOMN+24
ACBCCTYP EQU   ACBCOMN+25
ACBOPT   EQU   ACBCOMN+26
ACBDSORG EQU   ACBOPT
ACBCROPS EQU   ACBDSORG
ACBEXLST EQU   ACBCOMN+36
ACBDDNM  EQU   ACBCOMN+40
ACBAMETH EQU   ACBDDNM+3
ACBOFLGS EQU   ACBCOMN+48
ACBEXFG  EQU   ACBOFLGS
ACBIOSFG EQU   ACBOFLGS
ACBINFLG EQU   ACBCOMN+50
ACBUJFCB EQU   ACBCOMN+52
ACBBLKSZ EQU   ACBCOMN+60
ACBUAPTR EQU   ACBCOMN+64
AMCBS    EQU   0
CBSCMP   EQU   AMCBS+16
CBSVSRT  EQU   AMCBS+32
IGGCAXWA EQU   0
CAXFLGS  EQU   IGGCAXWA+8
CAXFLG2  EQU   IGGCAXWA+9
CAXFLG3  EQU   IGGCAXWA+10
CAXCCR   EQU   IGGCAXWA+32
CAXCNAM  EQU   IGGCAXWA+52
CAXOPLST EQU   IGGCAXWA+96
COPTS    EQU   CAXOPLST
CTGFV    EQU   0
CTGFVPRO EQU   CTGFV+1
CTGFVSPC EQU   CTGFV+52
CTGFVAMD EQU   CTGFV+56
CTGFVLMT EQU   CTGFV+72
CTGFVGAT EQU   CTGFV+76
CTGWA    EQU   0
CTGWAVL  EQU   CTGWA
CTGVL    EQU   0
CTGVLX   EQU   0
CTGCV    EQU   0
CTGCVDSN EQU   CTGCV+6
MWA      EQU   0
VLST     EQU   MWA+2
CVOLIND  EQU   MWA+252
CATGOPT1 EQU   0
CI       EQU   0
FIELDNM  EQU   0
TNAM     EQU   0
@NM00037 EQU   CTGDDNM
CTGPROB  EQU   @NM00037
CTGREASN EQU   CTGPROB+2
CVTS01   EQU   CVTPGSIA
CVTLPDIA EQU   CVTS01+12
CVTDIRST EQU   CVTLPDIA
CVTSLIDA EQU   CVTS01+24
CVTCTLFG EQU   CVTS01+50
CVTRV210 EQU   CVTS01+424
CVTRV219 EQU   CVTS01+425
CVTRV228 EQU   CVTS01+426
CVTRV237 EQU   CVTS01+427
CVTMFRTR EQU   CVTS01+452
CVTRV262 EQU   CVTS01+468
CVTRV271 EQU   CVTS01+469
CVTRV280 EQU   CVTS01+470
CVTRV289 EQU   CVTS01+471
CVTGSDA  EQU   CVTS01+600
PSARSVTE EQU   PSARSVT
MCATDSTR EQU   CVTAMFF
CVTAMF1  EQU   MCATDSTR
FLC      EQU   PSA
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS
@NM00087 EQU   MCATDSTR+1
@NM00086 EQU   CVTAMF1
AMF1NONX EQU   CVTAMF1
AMF1OPEN EQU   CVTAMF1
PSARSAV  EQU   PSARSVTE+60
PSARSTK  EQU   PSARSVTE+56
PSAESAV3 EQU   PSARSVTE+52
PSAESTK3 EQU   PSARSVTE+48
PSAESAV2 EQU   PSARSVTE+44
PSAESTK2 EQU   PSARSVTE+40
PSAESAV1 EQU   PSARSVTE+36
PSAESTK1 EQU   PSARSVTE+32
PSAPSAV  EQU   PSARSVTE+28
PSAPSTK  EQU   PSARSVTE+24
PSAMSAV  EQU   PSARSVTE+20
PSAMSTK  EQU   PSARSVTE+16
PSASSAV  EQU   PSARSVTE+12
PSASSTK  EQU   PSARSVTE+8
PSANSTK  EQU   PSARSVTE+4
PSACSTK  EQU   PSARSVTE
CVTRV628 EQU   CVTS01+728
CVTRV627 EQU   CVTS01+724
CVTRV626 EQU   CVTS01+720
CVTRV625 EQU   CVTS01+716
CVTRV624 EQU   CVTS01+712
CVTRV623 EQU   CVTS01+708
CVTRV622 EQU   CVTS01+704
CVTRV621 EQU   CVTS01+700
CVTRV620 EQU   CVTS01+696
CVTRV619 EQU   CVTS01+692
CVTRV618 EQU   CVTS01+688
CVTRV617 EQU   CVTS01+684
CVTRV616 EQU   CVTS01+680
CVTRV615 EQU   CVTS01+676
CVTRV614 EQU   CVTS01+672
CVTRV613 EQU   CVTS01+668
CVTRV612 EQU   CVTS01+664
CVTRV611 EQU   CVTS01+660
CVTRV610 EQU   CVTS01+656
CVTRV609 EQU   CVTS01+652
CVTRV608 EQU   CVTS01+648
CVTRV607 EQU   CVTS01+644
CVTRV606 EQU   CVTS01+640
CVTRV605 EQU   CVTS01+636
CVTRV604 EQU   CVTS01+632
CVTEFF02 EQU   CVTS01+628
CVTCBBR  EQU   CVTS01+624
CVTSSCR  EQU   CVTS01+620
CVTEVENT EQU   CVTS01+616
CVTCRCA  EQU   CVTS01+612
CVTTPIO  EQU   CVTS01+608
CVTADV   EQU   CVTS01+604
CVTGSDAB EQU   CVTGSDA
CVTQV3   EQU   CVTS01+596
CVTQV2   EQU   CVTS01+592
CVTQV1   EQU   CVTS01+588
CVTRPT   EQU   CVTS01+584
CVTSSRB  EQU   CVTS01+580
CVTCSDRL EQU   CVTS01+576
CVTEXP1  EQU   CVTS01+572
CVTRMPMT EQU   CVTS01+568
CVTRMPTT EQU   CVTS01+564
CVTVPSA  EQU   CVTS01+560
CVTVSTOP EQU   CVTS01+556
CVTGTFR8 EQU   CVTS01+552
CVTQUIT  EQU   CVTS01+548
CVTVACR  EQU   CVTS01+544
CVTWTCB  EQU   CVTS01+540
CVTSTPRS EQU   CVTS01+536
CVT0PT02 EQU   CVTS01+532
CVTDARCM EQU   CVTS01+528
CVTIRECM EQU   CVTS01+524
CVTJRECM EQU   CVTS01+520
CVTVEMS0 EQU   CVTS01+516
CVTSPFRR EQU   CVTS01+512
CVTRLSTG EQU   CVTS01+508
CVT0TC0A EQU   CVTS01+504
CVTGMBR  EQU   CVTS01+500
CVTLFRM  EQU   CVTS01+496
CVTRMBR  EQU   CVTS01+492
CVTVIOP  EQU   CVTS01+488
CVTRV307 EQU   CVTS01+486
CVTRV306 EQU   CVTS01+484
CVTRV305 EQU   CVTS01+482
CVTRV304 EQU   CVTS01+480
CVTRV303 EQU   CVTS01+478
CVTRV302 EQU   CVTS01+476
CVTRV301 EQU   CVTS01+475
CVTRV300 EQU   CVTS01+474
CVTRV299 EQU   CVTS01+473
CVTRV298 EQU   CVTS01+472
CVTRV297 EQU   CVTRV289
CVTRV296 EQU   CVTRV289
CVTRV295 EQU   CVTRV289
CVTRV294 EQU   CVTRV289
CVTRV293 EQU   CVTRV289
CVTRV292 EQU   CVTRV289
CVTRV291 EQU   CVTRV289
CVTRV290 EQU   CVTRV289
CVTRV288 EQU   CVTRV280
CVTRV287 EQU   CVTRV280
CVTRV286 EQU   CVTRV280
CVTRV285 EQU   CVTRV280
CVTRV284 EQU   CVTRV280
CVTRV283 EQU   CVTRV280
CVTRV282 EQU   CVTRV280
CVTRV281 EQU   CVTRV280
CVTRV279 EQU   CVTRV271
CVTRV278 EQU   CVTRV271
CVTRV277 EQU   CVTRV271
CVTRV276 EQU   CVTRV271
CVTRV275 EQU   CVTRV271
CVTRV274 EQU   CVTRV271
CVTRV273 EQU   CVTRV271
CVTRV272 EQU   CVTRV271
CVTRV270 EQU   CVTRV262
CVTRV269 EQU   CVTRV262
CVTRV268 EQU   CVTRV262
CVTRV267 EQU   CVTRV262
CVTRV266 EQU   CVTRV262
CVTRV265 EQU   CVTRV262
CVTRV264 EQU   CVTRV262
CVTRV263 EQU   CVTRV262
CVTVFP   EQU   CVTS01+464
CVTVSI   EQU   CVTS01+460
CVTVPSIB EQU   CVTS01+456
CVTMFACT EQU   CVTMFRTR
CVTMFCTL EQU   CVTS01+448
CVTPVBP  EQU   CVTS01+444
CVTPWI   EQU   CVTS01+440
CVTRV254 EQU   CVTS01+438
CVTRV253 EQU   CVTS01+436
CVTRV252 EQU   CVTS01+434
CVTRV251 EQU   CVTS01+433
CVTRV250 EQU   CVTS01+432
CVTRV249 EQU   CVTS01+431
CVTRV248 EQU   CVTS01+430
CVTRV247 EQU   CVTS01+429
CVTRV246 EQU   CVTS01+428
CVTRV245 EQU   CVTRV237
CVTRV244 EQU   CVTRV237
CVTRV243 EQU   CVTRV237
CVTRV242 EQU   CVTRV237
CVTRV241 EQU   CVTRV237
CVTRV240 EQU   CVTRV237
CVTRV239 EQU   CVTRV237
CVTRV238 EQU   CVTRV237
CVTRV236 EQU   CVTRV228
CVTRV235 EQU   CVTRV228
CVTRV234 EQU   CVTRV228
CVTRV233 EQU   CVTRV228
CVTRV232 EQU   CVTRV228
CVTRV231 EQU   CVTRV228
CVTRV230 EQU   CVTRV228
CVTRV229 EQU   CVTRV228
CVTRV227 EQU   CVTRV219
CVTRV226 EQU   CVTRV219
CVTRV225 EQU   CVTRV219
CVTRV224 EQU   CVTRV219
CVTRV223 EQU   CVTRV219
CVTRV222 EQU   CVTRV219
CVTRV221 EQU   CVTRV219
CVTRV220 EQU   CVTRV219
CVTRV218 EQU   CVTRV210
CVTRV217 EQU   CVTRV210
CVTRV216 EQU   CVTRV210
CVTRV215 EQU   CVTRV210
CVTRV214 EQU   CVTRV210
CVTRV213 EQU   CVTRV210
CVTRV212 EQU   CVTRV210
CVTRV211 EQU   CVTRV210
CVTLCCAT EQU   CVTS01+420
CVTPCCAT EQU   CVTS01+416
CVTIPCRP EQU   CVTS01+412
CVTIPCRI EQU   CVTS01+408
CVTIPCDS EQU   CVTS01+404
CVTAIDVT EQU   CVTS01+400
CVTSSAP  EQU   CVTS01+396
CVTEHCIR EQU   CVTS01+392
CVTEHDEF EQU   CVTS01+388
CVTDAIR  EQU   CVTS01+384
CVTPERFM EQU   CVTS01+380
CVT044R2 EQU   CVTS01+376
CVTFETCH EQU   CVTS01+372
CVTRSTWD EQU   CVTS01+368
CVTSPOST EQU   CVTS01+364
CVTIOBP  EQU   CVTS01+360
CVTASMVT EQU   CVTS01+356
CVTRECRQ EQU   CVTS01+352
CVTWSAC  EQU   CVTS01+348
CVTRV149 EQU   CVTS01+344
CVTWSAL  EQU   CVTS01+340
CVTSPSA  EQU   CVTS01+336
CVTGLMN  EQU   CVTS01+332
CVTVEAC0 EQU   CVTS01+328
CVT062R1 EQU   CVTS01+324
CVTRPOST EQU   CVTS01+320
CVTDQIQE EQU   CVTS01+316
CVTCSD   EQU   CVTS01+312
CVTLKRMA EQU   CVTS01+308
CVTRSPIE EQU   CVTS01+304
CVTRENQ  EQU   CVTS01+300
CVTLQCB  EQU   CVTS01+296
CVTFQCB  EQU   CVTS01+292
CVTQCS01 EQU   CVTS01+288
CVTAPFT  EQU   CVTS01+284
CVTPARRL EQU   CVTS01+280
CVTVWAIT EQU   CVTS01+276
CVTGSPL  EQU   CVTS01+272
CVTLSMQ  EQU   CVTS01+268
CVTGSMQ  EQU   CVTS01+264
CVTEXPRO EQU   CVTS01+260
CVTOPCTP EQU   CVTS01+256
CVTSIC   EQU   CVTS01+252
CVTTPIOS EQU   CVTS01+248
CVTRTMS  EQU   CVTS01+244
CVTSDBF  EQU   CVTS01+240
CVTSCBP  EQU   CVTS01+236
CVTSDMP  EQU   CVTS01+232
CVTSV60  EQU   CVTS01+228
CVTRTMCT EQU   CVTS01+224
CVTASCBL EQU   CVTS01+220
CVTASCBH EQU   CVTS01+216
CVTGDA   EQU   CVTS01+212
CVTASVT  EQU   CVTS01+208
CVTVVMDI EQU   CVTS01+204
CVTAQTOP EQU   CVTS01+200
CVTIOSCS EQU   CVTS01+196
CVTSDRM  EQU   CVTS01+192
CVTOPTE  EQU   CVTS01+188
CVTSTXU  EQU   CVTS01+184
CVTQUIS  EQU   CVTS01+180
CVTPARS  EQU   CVTS01+176
CVTS1EE  EQU   CVTS01+172
CVTFRAS  EQU   CVTS01+168
CVTQSAS  EQU   CVTS01+164
CVTCRAS  EQU   CVTS01+160
CVTCRMN  EQU   CVTS01+156
CVTDELCP EQU   CVTS01+152
CVTFRECL EQU   CVTS01+148
CVTGETCL EQU   CVTS01+144
CVTBLDCP EQU   CVTS01+140
CVTAUTHL EQU   CVTS01+136
CVTSCAN  EQU   CVTS01+132
CVTRV144 EQU   CVTS01+130
CVTMAXMP EQU   CVTS01+128
CVTSTCK  EQU   CVTS01+124
CVTRV139 EQU   CVTS01+123
CVTDSSAC EQU   CVTS01+122
CVTRV513 EQU   CVTS01+121
CVTIOSPL EQU   CVTS01+120
CVTPTGT  EQU   CVTS01+116
CVTCSPIE EQU   CVTS01+112
CVTSMFEX EQU   CVTS01+108
CVTOLT0A EQU   CVTS01+104
CVTSRBRT EQU   CVTS01+100
CVTPUTL  EQU   CVTS01+96
CVTRV519 EQU   CVTS01+92
CVTRV327 EQU   CVTS01+88
CVTRV326 EQU   CVTS01+84
CVTRV325 EQU   CVTS01+80
CVTRV324 EQU   CVTS01+76
CVT0VL01 EQU   CVTS01+72
CVTSHRVM EQU   CVTS01+68
CVTRV332 EQU   CVTS01+64
CVTTAS   EQU   CVTS01+60
CVTRSCN  EQU   CVTS01+56
CVTTRAC2 EQU   CVTS01+54
CVTTRACE EQU   CVTS01+52
CVTAPG   EQU   CVTS01+51
CVTSDTRC EQU   CVTCTLFG
CVTGTRCE EQU   CVTCTLFG
CVTNOMP  EQU   CVTCTLFG
CVTRSV79 EQU   CVTCTLFG
CVTDSTAT EQU   CVTCTLFG
CVTRSV78 EQU   CVTCTLFG
CVTRV333 EQU   CVTCTLFG
CVTRV323 EQU   CVTCTLFG
CVTSPVLK EQU   CVTS01+49
CVTRSV77 EQU   CVTS01+48
CVTRV331 EQU   CVTS01+44
CVTRV330 EQU   CVTS01+40
CVTRV329 EQU   CVTS01+36
CVTRV328 EQU   CVTS01+32
CVTRV322 EQU   CVTS01+28
CVTSLID  EQU   CVTSLIDA+1
CVTSYLK  EQU   CVTSLIDA
CVTRV321 EQU   CVTS01+20
CVTRV320 EQU   CVTS01+16
CVTLPDIR EQU   CVTLPDIA+1
CVTRSV69 EQU   CVTDIRST
CVTRSV68 EQU   CVTDIRST
CVTRSV67 EQU   CVTDIRST
CVTRSV66 EQU   CVTDIRST
CVTRSV65 EQU   CVTDIRST
CVTRSV64 EQU   CVTDIRST
CVTRSV63 EQU   CVTDIRST
CVTDICOM EQU   CVTDIRST
CVTPVTP  EQU   CVTS01+8
CVTLPDSR EQU   CVTS01+4
CVTGETL  EQU   CVTS01
CTGREAS2 EQU   CTGREASN+1
CTGREAS1 EQU   CTGREASN
CTGMODID EQU   CTGPROB
CVLSER   EQU   MWA+259
TTR2     EQU   MWA+256
BIN0     EQU   CVOLIND+3
TTR1     EQU   CVOLIND
@NM00096 EQU   MWA+242
FSN      EQU   VLST+10
VOLSER   EQU   VLST+4
DEVTYP   EQU   VLST
VOLENTCT EQU   MWA
CTGCVCC  EQU   CTGCV+50
CTGCVDEV EQU   CTGCVDSN
CTGCVVOL EQU   CTGCV
CTGVLTTR EQU   CTGVLX+12
@NM00095 EQU   CTGVLX
CTGVLSEQ EQU   CTGVL+10
CTGVLDEV EQU   CTGVL+6
CTGVLVOL EQU   CTGVL
CTGWAGB  EQU   CTGWA+12
CTGWAGCT EQU   CTGWA+10
CTGWAUCT EQU   CTGWA+8
CTGWAVCT EQU   CTGWA+6
CTGWALV  EQU   CTGWA+4
CTGFVWKA EQU   CTGFV+88
CTGFVPWD EQU   CTGFV+84
CTGFVNAM EQU   CTGFV+80
CTGFVUPG EQU   CTGFVGAT
CTGFVEXT EQU   CTGFVLMT
CTGFVLRS EQU   CTGFV+68
CTGFVBUF EQU   CTGFV+64
CTGFVATR EQU   CTGFV+60
CTGFVFSN EQU   CTGFVAMD
CTGFVTTR EQU   CTGFVSPC
CTGFVDVT EQU   CTGFV+48
CTGFVRNG EQU   CTGFV+44
CTGFVVLT EQU   CTGFV+40
CTGFVCRE EQU   CTGFV+36
CTGFVEXP EQU   CTGFV+32
CTGFVOWN EQU   CTGFV+28
CTGFVSTY EQU   CTGFV+24
CTGFVENT EQU   CTGFV+20
CTGFVIND EQU   CTGFV+16
CTGFVVCH EQU   CTGFV+12
CTGFVICH EQU   CTGFV+8
CTGFVDCH EQU   CTGFV+4
@NM00094 EQU   CTGFV+3
CTGFVELM EQU   CTGFV+2
@NM00093 EQU   CTGFVPRO
CTGFVDRC EQU   CTGFVPRO
CTGFVNDC EQU   CTGFVPRO
CTGFVRVL EQU   CTGFVPRO
CTGFVAVL EQU   CTGFVPRO
CTGFVTYP EQU   CTGFV
CAXCRACB EQU   IGGCAXWA+112
CAXJDE   EQU   IGGCAXWA+108
CAXCCA   EQU   IGGCAXWA+104
CAXOPEWA EQU   IGGCAXWA+100
COPACB   EQU   CAXOPLST+1
@NM00092 EQU   COPTS
CENLST   EQU   COPTS
@NM00091 EQU   CAXCNAM+22
CAXRADDN EQU   CAXCNAM+14
CAXRATEP EQU   CAXCNAM+10
CAXRACTS EQU   CAXCNAM+6
CAXVOLID EQU   CAXCNAM
CAXRPL   EQU   IGGCAXWA+48
CAXRPLCT EQU   IGGCAXWA+46
CAXASID  EQU   IGGCAXWA+44
CAXFDCI  EQU   CAXCCR+9
CAXCDCI  EQU   CAXCCR+6
CAXNFCI  EQU   CAXCCR+3
CAXHACI  EQU   CAXCCR
CAXUCB   EQU   IGGCAXWA+28
CAXACB   EQU   IGGCAXWA+24
CAXDRWP  EQU   IGGCAXWA+20
CAXSCHWA EQU   IGGCAXWA+16
CAXATIOT EQU   IGGCAXWA+12
CAXACT   EQU   IGGCAXWA+11
@NM00090 EQU   CAXFLG3
CAXF3B6  EQU   CAXFLG3
CAXF3B5  EQU   CAXFLG3
@NM00089 EQU   CAXFLG3
CAXF3ANE EQU   CAXFLG3
CAXF3AT  EQU   CAXFLG3
CAXF2VTU EQU   CAXFLG2
CAXF2REC EQU   CAXFLG2
CAXF2CA  EQU   CAXFLG2
CAXF2CLR EQU   CAXFLG2
CAXF2IOE EQU   CAXFLG2
CAXF2NCR EQU   CAXFLG2
CAXF2NDD EQU   CAXFLG2
CAXF2DT  EQU   CAXFLG2
CAXSCR   EQU   CAXFLGS
CAXCMR   EQU   CAXFLGS
CAXMCT   EQU   CAXFLGS
CAXCMP   EQU   CAXFLGS
CAXEOV   EQU   CAXFLGS
CAXCLS   EQU   CAXFLGS
CAXOPN   EQU   CAXFLGS
CAXBLD   EQU   CAXFLGS
CAXCHN   EQU   IGGCAXWA+4
@NM00088 EQU   IGGCAXWA+1
CAXID    EQU   IGGCAXWA
CBSVPTR  EQU   CBSVSRT+4
CBSVUSE  EQU   CBSVSRT
CBSCRTCB EQU   AMCBS+28
CBSCRACA EQU   AMCBS+24
CBSCAXCN EQU   AMCBS+20
CBSMCUCB EQU   CBSCMP
CBSCBP   EQU   AMCBS+12
CBSACB   EQU   AMCBS+8
CBSMCSTA EQU   AMCBS+4
CBSSIZ   EQU   AMCBS+2
CBSID    EQU   AMCBS
ACBAPID  EQU   ACBCOMN+72
ACBCBMWA EQU   ACBCOMN+68
ACBLRECL EQU   ACBCOMN+62
ACBMSGLN EQU   ACBBLKSZ
ACBBUFSP EQU   ACBCOMN+56
@NM00085 EQU   ACBUJFCB+1
ACBOPTN  EQU   ACBUJFCB
ACBVVIC  EQU   ACBINFLG
ACBUCRA  EQU   ACBINFLG
ACBSCRA  EQU   ACBINFLG
ACBCAT   EQU   ACBINFLG
ACBIJRQE EQU   ACBINFLG
ACBJEPS  EQU   ACBINFLG
@NM00084 EQU   ACBINFLG
ACBERFLG EQU   ACBCOMN+49
ACBBUSY  EQU   ACBIOSFG
ACBLOCK  EQU   ACBEXFG
@NM00083 EQU   ACBOFLGS
ACBDSERR EQU   ACBOFLGS
ACBOPEN  EQU   ACBOFLGS
ACBEOV   EQU   ACBOFLGS
@NM00082 EQU   ACBOFLGS
ACBDEB   EQU   ACBDDNM+5
ACBERFL  EQU   ACBDDNM+4
ACBAM    EQU   ACBAMETH
ACBINFL  EQU   ACBDDNM+2
ACBTIOT  EQU   ACBDDNM
ACBUEL   EQU   ACBEXLST
ACBPASSW EQU   ACBCOMN+32
ACBMSGAR EQU   ACBCOMN+28
@NM00081 EQU   ACBDSORG+1
ACBDORGA EQU   ACBDSORG+1
@NM00080 EQU   ACBDSORG
ACBCRNRE EQU   ACBCROPS
ACBCRNCK EQU   ACBCROPS
ACBASA   EQU   ACBCCTYP
@NM00079 EQU   ACBCCTYP
ACBRECAF EQU   ACBRECFM
ACBJBUF  EQU   ACBBUFPL+2
ACBMACR4 EQU   ACBBUFPL+1
@NM00078 EQU   ACBMACR3
ACBNCFX  EQU   ACBMACR3
ACBSIS   EQU   ACBMACR3
ACBDFR   EQU   ACBMACR3
ACBICI   EQU   ACBMACR3
ACBGSR   EQU   ACBMACR3
ACBLSR   EQU   ACBMACR3
@NM00077 EQU   ACBMACR3
ACBBUFNI EQU   ACBCOMN+18
ACBBUFND EQU   ACBCOMN+16
ACBSTRNO EQU   ACBCOMN+15
ACBBSTNO EQU   ACBCOMN+14
ACBAIX   EQU   ACBMACR2
ACBDSN   EQU   ACBMACR2
ACBRST   EQU   ACBMACR2
ACBLOGON EQU   ACBMACR2
ACBSKP   EQU   ACBMACR2
@NM00076 EQU   ACBMACR2
ACBUBF   EQU   ACBMACR1
ACBOUT   EQU   ACBMACR1
ACBIN    EQU   ACBMACR1
ACBDIR   EQU   ACBMACR1
ACBSEQ   EQU   ACBMACR1
ACBBLK   EQU   ACBCNV
ACBADD   EQU   ACBADR
ACBKEY   EQU   ACBMACR1
ACBINRTN EQU   ACBCOMN+8
ACBIBCT  EQU   ACBJWA
ACBLEN2  EQU   ACBLENG2
ACBSTYP  EQU   ACBCOMN+1
ACBID    EQU   ACBCOMN
@NM00051 EQU   TCBXTNT2+32
TCBRV181 EQU   TCBRV173
TCBRV180 EQU   TCBRV173
TCBRV179 EQU   TCBRV173
TCBRV178 EQU   TCBRV173
TCBRV177 EQU   TCBRV173
TCBRV176 EQU   TCBRV173
TCBRV175 EQU   TCBRV173
TCBRV174 EQU   TCBRV173
TCBRV172 EQU   TCBRV164
TCBRV171 EQU   TCBRV164
TCBRV170 EQU   TCBRV164
TCBRV169 EQU   TCBRV164
TCBRV168 EQU   TCBRV164
TCBRV167 EQU   TCBRV164
TCBRV166 EQU   TCBRV164
TCBRV165 EQU   TCBRV164
TCBRV163 EQU   TCBRV155
TCBRV162 EQU   TCBRV155
TCBRV161 EQU   TCBRV155
TCBRV160 EQU   TCBRV155
TCBRV159 EQU   TCBRV155
TCBRV158 EQU   TCBRV155
TCBRV157 EQU   TCBRV155
TCBRV156 EQU   TCBRV155
TCBRV154 EQU   TCBRV146
TCBRV153 EQU   TCBRV146
TCBRV152 EQU   TCBRV146
TCBRV151 EQU   TCBRV146
TCBRV150 EQU   TCBRV146
TCBRV149 EQU   TCBRV146
TCBRV148 EQU   TCBRV146
TCBRV147 EQU   TCBRV146
TCBRV145 EQU   TCBXTNT2+26
TCBRV144 EQU   TCBXTNT2+24
TCBRV143 EQU   TCBXTNT2+20
TCBRV142 EQU   TCBXTNT2+16
TCBRSV49 EQU   TCBXTNT2+12
TCBRSV48 EQU   TCBXTNT2+8
TCBRCMP  EQU   TCBXTNT2+5
TCBRSVAB EQU   TCBXTNT2+4
TCBGTFA  EQU   TCBGTF+1
TCBRSV47 EQU   TCBTFLG
TCBRSV46 EQU   TCBTFLG
TCBRSV45 EQU   TCBTFLG
TCBRSV44 EQU   TCBTFLG
TCBRSV43 EQU   TCBTFLG
TCBDSPIT EQU   TCBTFLG
TCBERRTN EQU   TCBTFLG
TCBASYNC EQU   TCBTFLG
@NM00050 EQU   TCB+296
TCBSCBQ  EQU   TCB+292
TCBSWASA EQU   TCB+288
TCBDBTB  EQU   TCB+284
TCBRPT   EQU   TCB+280
TCBRV141 EQU   TCBRV133
TCBRV140 EQU   TCBRV133
TCBRV139 EQU   TCBRV133
TCBRV138 EQU   TCBRV133
TCBRV137 EQU   TCBRV133
TCBRV136 EQU   TCBRV133
TCBRV135 EQU   TCBRV133
TCBRV134 EQU   TCBRV133
TCBRV132 EQU   TCBRV124
TCBRV131 EQU   TCBRV124
TCBRV130 EQU   TCBRV124
TCBRV129 EQU   TCBRV124
TCBRV128 EQU   TCBRV124
TCBRV127 EQU   TCBRV124
TCBRV126 EQU   TCBRV124
TCBRV125 EQU   TCBRV124
TCBRV123 EQU   TCBFBYT2
TCBRV122 EQU   TCBFBYT2
TCBECBNV EQU   TCBFBYT2
TCBSSSYN EQU   TCBFBYT2
TCBFPRAP EQU   TCBFBYT2
TCBFDW   EQU   TCBFBYT2
TCBFMW   EQU   TCBFBYT2
TCBCNCB  EQU   TCBFBYT2
TCBLLH   EQU   TCBFBYT1
TCBRV113 EQU   TCBFBYT1
TCBEOT   EQU   TCBFBYT1
TCBRTM2  EQU   TCBFBYT1
TCBPGNLY EQU   TCBFBYT1
TCBNDIOS EQU   TCBFBYT1
TCBACTIV EQU   TCBFBYT1
TCBEOTFM EQU   TCBFBYT1
TCBAFFN  EQU   TCB+274
TCBCCPVI EQU   TCB+272
TCBUKYSP EQU   TCB+268
TCBMODE  EQU   TCBESTAE+3
TCBERTYP EQU   TCBESTAE+2
TCBRV314 EQU   TCBESTRM
TCBRV313 EQU   TCBESTRM
TCBRV312 EQU   TCBESTRM
TCBRV311 EQU   TCBESTRM
TCBRV310 EQU   TCBESTRM
TCBRV309 EQU   TCBESTRM
TCBRV308 EQU   TCBESTRM
TCBETERM EQU   TCBESTRM
TCBSCBKY EQU   TCBESTAE
TCBRTM12 EQU   TCB+260
TCBTCBID EQU   TCB+256
TCBRSV96 EQU   TCB+252
TCBSWA   EQU   TCB+248
TCBFOEA  EQU   TCBFOE+1
TCBRSV42 EQU   TCBFOE
TCBRV306 EQU   TCB+240
TCBRSV41 EQU   TCB+239
TCBTID   EQU   TCB+238
TCBRSVAA EQU   TCB+237
TCBABCUR EQU   TCB+236
TCBTMSAV EQU   TCB+232
TCBIOTIM EQU   TCB+228
TCBRTWA  EQU   TCB+224
TCBBACK  EQU   TCB+220
TCBTIRB  EQU   TCB+216
TCBAECB  EQU   TCB+212
TCBEXT2A EQU   TCBEXT2+1
TCBRSV39 EQU   TCBEXT2
TCBSTMCT EQU   TCB+207
TCBSYSCT EQU   TCB+206
TCBRSV37 EQU   TCB+205
TCBEXSVC EQU   TCBDAR
TCBRSV36 EQU   TCBDAR
TCBDARWT EQU   TCBDAR
TCBDARO  EQU   TCBDAR
TCBDARMC EQU   TCBDARC
TCBDARD  EQU   TCBDAR
TCBDARS  EQU   TCBDAR
TCBDARP  EQU   TCBDAR
TCBGTOFM EQU   TCBFLGS7
TCBADMP  EQU   TCBFLGS7
TCBRSTSK EQU   TCBFLGS7
TCBRSV35 EQU   TCBFLGS7
TCBSTACK EQU   TCBFLGS7
TCBRSV34 EQU   TCBFLGS7
TCBRSV33 EQU   TCBFLGS7
TCBGPECB EQU   TCBFLGS7
TCBNTJS  EQU   TCBFLGS6
TCBAPG   EQU   TCBFLGS6
TCBMIGR  EQU   TCBFLGS6
TCBRV303 EQU   TCBFLGS6
TCBSPVLK EQU   TCBFLGS6
TCBCPU   EQU   TCBFLGS6
TCBPIE17 EQU   TCBFLGS6
TCBRV    EQU   TCBFLGS6
TCBRSV79 EQU   TCBNDSP5
TCBRSV78 EQU   TCBNDSP5
TCBRSV77 EQU   TCBNDSP5
TCBRSV76 EQU   TCBNDSP5
TCBRSV75 EQU   TCBNDSP5
TCBRSV74 EQU   TCBNDSP5
TCBRSV95 EQU   TCBNDSP5
TCBRSV94 EQU   TCBNDSP5
TCBRSV93 EQU   TCBNDSP4
TCBRSV92 EQU   TCBNDSP4
TCBRSV91 EQU   TCBNDSP4
TCBRSV90 EQU   TCBNDSP4
TCBRSV89 EQU   TCBNDSP4
TCBRSV88 EQU   TCBNDSP4
TCBRSV87 EQU   TCBNDSP4
TCBRSV86 EQU   TCBNDSP4
TCBEXT1A EQU   TCBEXT1+1
TCBRSV32 EQU   TCBEXT1
TCBEXCPD EQU   TCB+192
TCBIOBRC EQU   TCB+188
TCBDDWTC EQU   TCB+186
TCBDDEXC EQU   TCB+184
TCBJSCBB EQU   TCBJSCB+1
@NM00049 EQU   TCBRECDE
TCBREC   EQU   TCBRECDE
TCBMDIDS EQU   TCB+176
TCBNDINT EQU   TCBNDSP3
TCBRSV27 EQU   TCBNDSP3
TCBRSV26 EQU   TCBNDSP3
TCBRSV25 EQU   TCBNDSP3
TCBRSV24 EQU   TCBNDSP3
TCBSRBND EQU   TCBNDSP3
TCBRV302 EQU   TCBNDSP3
TCBLJSND EQU   TCBNDSP3
TCBABE   EQU   TCBNDSP2
TCBDSS   EQU   TCBNDSP2
TCBOWAIT EQU   TCBNDSP2
TCBIWAIT EQU   TCBNDSP2
TCBNDTS  EQU   TCBNDSP2
TCBNDSVC EQU   TCBNDSP2
TCBSTPP  EQU   TCBNDSP2
TCBABD   EQU   TCBNDSP2
TCBRSV22 EQU   TCBNDSP1
TCBPIEND EQU   TCBNDSP1
TCBTPSP  EQU   TCBNDSP1
TCBDDRND EQU   TCBNDSP1
TCBRSPND EQU   TCBNDSP1
TCBRSTND EQU   TCBNDSP1
TCBDARPN EQU   TCBNDSP1
TCBDARTN EQU   TCBNDSP1
TCBNDSP0 EQU   TCBNDSP
TCBUSER  EQU   TCB+168
TCBTCTB  EQU   TCBTCT+1
TCBRSV9C EQU   TCBTCTGF
TCBRSV9B EQU   TCBTCTGF
TCBRSV9A EQU   TCBTCTGF
TCBRSV99 EQU   TCBTCTGF
TCBRSV98 EQU   TCBTCTGF
TCBRSV97 EQU   TCBTCTGF
TCBRSV20 EQU   TCBTCTGF
TCBSMFGF EQU   TCBTCTGF
TCBSTABB EQU   TCBSTAB+1
TCBSTCUR EQU   TCBNSTAE
TCBRV301 EQU   TCBNSTAE
TCBSYNCH EQU   TCBNSTAE
TCBHALT  EQU   TCBNSTAE
TCBPPSUP EQU   TCBNSTAE
TCB33E   EQU   TCBNSTAE
TCBQUIES EQU   TCBNSTAE
TCBSTABE EQU   TCBNSTAE
TCBAQE   EQU   TCB+156
TCBPQE   EQU   TCB+152
TCBTSDP  EQU   TCB+151
TCBTSLP  EQU   TCB+150
TCBSTPCT EQU   TCB+149
TCBCPUBN EQU   TCBTSFLG
TCBDYDSP EQU   TCBTSFLG
TCBRSV18 EQU   TCBTSFLG
TCBRSV17 EQU   TCBTSFLG
TCBTIOTG EQU   TCBTSFLG
TCBATT   EQU   TCBTSFLG
TCBSTPPR EQU   TCBTSFLG
TCBRV300 EQU   TCBTSTSK
TCBECB   EQU   TCB+144
TCBIQE   EQU   TCB+140
TCBLTC   EQU   TCB+136
TCBOTC   EQU   TCB+132
TCBNTC   EQU   TCB+128
TCBJSTCA EQU   TCBJSTCB+1
TCBRSV16 EQU   TCBJSTCB
TCBTQET  EQU   TCBTME
TCBTCB   EQU   TCB+116
TCBFSAB  EQU   TCBFSA+1
TCBQEL   EQU   TCBFSA
TCBGRS15 EQU   TCBGRS+60
TCBGRS14 EQU   TCBGRS+56
TCBGRS13 EQU   TCBGRS+52
TCBGRS12 EQU   TCBGRS+48
TCBGRS11 EQU   TCBGRS+44
TCBGRS10 EQU   TCBGRS+40
TCBGRS9  EQU   TCBGRS+36
TCBGRS8  EQU   TCBGRS+32
TCBGRS7  EQU   TCBGRS+28
TCBGRS6  EQU   TCBGRS+24
TCBGRS5  EQU   TCBGRS+20
TCBGRS4  EQU   TCBGRS+16
TCBGRS3  EQU   TCBGRS+12
TCBGRS2  EQU   TCBGRS+8
TCBGRS1  EQU   TCBGRS+4
TCBGRS0  EQU   TCBGRS
TCBJPQB  EQU   TCBJPQ+1
TCBRSV15 EQU   TCBPURGE
TCBRSV14 EQU   TCBPURGE
TCBRSV13 EQU   TCBPURGE
TCBRSV12 EQU   TCBPURGE
TCBRSV11 EQU   TCBPURGE
TCBRSV10 EQU   TCBPURGE
TCBRSV09 EQU   TCBPURGE
TCBJPQF  EQU   TCBPURGE
TCBJLB   EQU   TCB+40
TCBLLS   EQU   TCB+36
TCBDSP   EQU   TCB+35
TCBLMP   EQU   TCB+34
TCBPNDSP EQU   TCBFLGS5
TCBFCD1  EQU   TCBFLGS5
TCBSTP   EQU   TCBFLGS5
TCBSYS   EQU   TCBFLGS5
TCBANDSP EQU   TCBFLGS5
TCBPAGE  EQU   TCBFLGS5
TCBUXNDF EQU   TCBABWF
TCBFC    EQU   TCBFLGS5
TCBONDSP EQU   TCBFLGS4
TCBMPCND EQU   TCBFLGS4
TCBMPCVQ EQU   TCBFLGS4
TCBUXNDV EQU   TCBFLGS4
TCBHNDSP EQU   TCBFLGS4
TCBRQENA EQU   TCBFLGS4
TCBSER   EQU   TCBFLGS4
TCBNDUMP EQU   TCBFLGS4
TCBDWSTA EQU   TCBFLGS3
TCBRSV08 EQU   TCBFLGS3
TCBRSV07 EQU   TCBFLGS3
TCBRSV06 EQU   TCBFLGS3
TCBABGM  EQU   TCBFLGS3
TCBABTRM EQU   TCBFLGS3
TCBADINP EQU   TCBFLGS3
TCBFSM   EQU   TCBFLGS3
TCBFTS   EQU   TCBFLGS2
TCBFETXR EQU   TCBFLGS2
TCBFDSOP EQU   TCBFLGS2
TCBFJMC  EQU   TCBFLGS2
TCBFSMC  EQU   TCBFLGS2
TCBFABOP EQU   TCBFLGS2
TCBFSTI  EQU   TCBFLGS2
TCBFOINP EQU   TCBFLGS2
TCBFX    EQU   TCBFLGS1
TCBFS    EQU   TCBFLGS1
TCBFT    EQU   TCBFLGS1
TCBPDUMP EQU   TCBFLGS1
TCBRSV04 EQU   TCBFLGS1
TCBFERA  EQU   TCBFLGS1
TCBFE    EQU   TCBFLGS1
TCBFA    EQU   TCBFLGS1
TCBZERO  EQU   TCBPKF
TCBFLAG  EQU   TCBPKF
TCBMSSB  EQU   TCBMSS+1
TCBRSV03 EQU   TCBMSS
TCBTRNB  EQU   TCBTRN+1
TCBRSV02 EQU   TCBABF
TCBOLTEP EQU   TCBABF
TCBTCP   EQU   TCBABF
TCBTCPP  EQU   TCBABF
TCBRSV01 EQU   TCBABF
TCBGRPH  EQU   TCBABF
TCBNOCHK EQU   TCBABF
TCBMOD91 EQU   TCBABF
TCBCMPC  EQU   TCBCMP+1
TCBRV318 EQU   TCBCMSG
TCBRV317 EQU   TCBCIND
TCBRV316 EQU   TCBCWTO
TCBCASID EQU   TCBCDBL
TCBNOCC  EQU   TCBSTCC
TCBDMPO  EQU   TCBCPP
TCBCSTEP EQU   TCBCMPF
TCBCREQ  EQU   TCBCMPF
TCBTIO   EQU   TCB+12
TCBDEB   EQU   TCB+8
TCBPIEA  EQU   TCBPIE+1
TCBPM    EQU   TCBPMASK
@NM00048 EQU   TCBPMASK
TCBRBP   EQU   TCB
TCBFRS6  EQU   TCBFRS+24
TCBFRS4  EQU   TCBFRS+16
TCBFRS2  EQU   TCBFRS+8
TCBFRS0  EQU   TCBFRS
NEXTTCB  EQU   TCBWORDS
CVTLEVL  EQU   CVTRELNO+2
CVTNUMB  EQU   CVTRELNO
CVTMDL   EQU   CVTFIX+250
@NM00047 EQU   CVTFIX+248
@NM00046 EQU   CVTFIX
CVTRV482 EQU   CVTXTNT2+128
CVTRV481 EQU   CVTXTNT2+124
CVTRV480 EQU   CVTXTNT2+120
CVTRV479 EQU   CVTXTNT2+118
CVTRV478 EQU   CVTXTNT2+117
CVTRV477 EQU   CVTXTNT2+116
CVTRV476 EQU   CVTXTNT2+115
CVTRV475 EQU   CVTXTNT2+114
CVTRV474 EQU   CVTRV466
CVTRV473 EQU   CVTRV466
CVTRV472 EQU   CVTRV466
CVTRV471 EQU   CVTRV466
CVTRV470 EQU   CVTRV466
CVTRV469 EQU   CVTRV466
CVTRV468 EQU   CVTRV466
CVTRV467 EQU   CVTRV466
CVTRV465 EQU   CVTRV457
CVTRV464 EQU   CVTRV457
CVTRV463 EQU   CVTRV457
CVTRV462 EQU   CVTRV457
CVTRV461 EQU   CVTRV457
CVTRV460 EQU   CVTRV457
CVTRV459 EQU   CVTRV457
CVTRV458 EQU   CVTRV457
CVTRV456 EQU   CVTXTNT2+108
CVTRV455 EQU   CVTXTNT2+104
CVTRV454 EQU   CVTXTNT2+100
CVTRV453 EQU   CVTXTNT2+96
CVTRV452 EQU   CVTXTNT2+94
CVTRV451 EQU   CVTXTNT2+92
CVTRV450 EQU   CVTXTNT2+90
CVTRV449 EQU   CVTXTNT2+88
CVTRV448 EQU   CVTXTNT2+87
CVTRV447 EQU   CVTXTNT2+86
CVTRV446 EQU   CVTRV438
CVTRV445 EQU   CVTRV438
CVTRV444 EQU   CVTRV438
CVTRV443 EQU   CVTRV438
CVTRV442 EQU   CVTRV438
CVTRV441 EQU   CVTRV438
CVTRV440 EQU   CVTRV438
CVTRV439 EQU   CVTRV438
CVTRV437 EQU   CVTRV429
CVTRV436 EQU   CVTRV429
CVTRV435 EQU   CVTRV429
CVTRV434 EQU   CVTRV429
CVTRV433 EQU   CVTRV429
CVTRV432 EQU   CVTRV429
CVTRV431 EQU   CVTRV429
CVTRV430 EQU   CVTRV429
CVTRV428 EQU   CVTXTNT2+80
CVTRV427 EQU   CVTXTNT2+76
CVTRV426 EQU   CVTXTNT2+72
CVTRV425 EQU   CVTXTNT2+68
CVTATACT EQU   CVTATCVT
CVTRV423 EQU   CVTXTNT2+62
CVTRV422 EQU   CVTXTNT2+60
CVTRV421 EQU   CVTXTNT2+58
CVTRV420 EQU   CVTXTNT2+56
CVTRV419 EQU   CVTXTNT2+55
CVTRV418 EQU   CVTXTNT2+54
CVTRV417 EQU   CVTRV409
CVTRV416 EQU   CVTRV409
CVTRV415 EQU   CVTRV409
CVTRV414 EQU   CVTRV409
CVTRV413 EQU   CVTRV409
CVTRV412 EQU   CVTRV409
CVTRV411 EQU   CVTRV409
CVTRV410 EQU   CVTRV409
CVTRV408 EQU   CVTRV400
CVTRV407 EQU   CVTRV400
CVTRV406 EQU   CVTRV400
CVTRV405 EQU   CVTRV400
CVTRV404 EQU   CVTRV400
CVTRV403 EQU   CVTRV400
CVTRV402 EQU   CVTRV400
CVTRV401 EQU   CVTRV400
CVTICB   EQU   CVTXTNT2+48
CVTSKTA  EQU   CVTXTNT2+44
CVTRSV99 EQU   CVTXTNT2+40
CVTRSV98 EQU   CVTXTNT2+36
CVTRSV97 EQU   CVTXTNT2+34
CVTRSV96 EQU   CVTXTNT2+32
CVTOLTEP EQU   CVTXTNT2+28
CVTQIDA  EQU   CVTQID+1
CVTRSV95 EQU   CVTQID
CVTRSV94 EQU   CVTXTNT2+20
CVTRSV93 EQU   CVTXTNT2+16
CVTRSV92 EQU   CVTXTNT2+12
CVTDEBVR EQU   CVTXTNT2+8
CVTRSV91 EQU   CVTXTNT2+6
CVTRSV9H EQU   CVTFLGBT
CVTRSV9G EQU   CVTFLGBT
CVTRSV9F EQU   CVTFLGBT
CVTRSV9E EQU   CVTFLGBT
CVTRSV9D EQU   CVTFLGBT
CVTRSV9C EQU   CVTFLGBT
CVTVME   EQU   CVTFLGBT
CVTNPE   EQU   CVTFLGBT
CVTNUCLS EQU   CVTXTNT2+4
CVTDSSVA EQU   CVTDSSV+1
CVTRSV89 EQU   CVTDSSV
CVTRSV88 EQU   CVTXTNT1+8
CVTRSV87 EQU   CVTXTNT1+4
CVTFACHN EQU   CVTXTNT1
CVTRV488 EQU   CVTMAP+412
CVTRV487 EQU   CVTMAP+408
CVTRV486 EQU   CVTMAP+404
CVTRV485 EQU   CVTMAP+400
CVTACTAP EQU   CVTMAP+396
CVTAUTH  EQU   CVTMAP+392
CVTATMCA EQU   CVTATMCT+1
CVTATMST EQU   CVTATMCT
CVTRSV61 EQU   CVTMAP+384
CVTVOLT1 EQU   CVTVOLM1+1
CVTVOLI1 EQU   CVTVOLF1
CVTSTOA  EQU   CVTMAP+376
CVTRSV58 EQU   CVTMAP+374
CVTRSV57 EQU   CVTMAP+372
CVTDDCE  EQU   CVTMAP+368
CVTPNWFR EQU   CVTMAP+364
CVTSMF   EQU   CVTMAP+360
CVTSULK  EQU   CVTMAP+358
CVTSLKO  EQU   CVTSYSK
CVTSLKP  EQU   CVTSYSK
CVTSLKQ  EQU   CVTSYSK
CVTSLKR  EQU   CVTSYSK
CVTRSV56 EQU   CVTSYSK
CVTRSV55 EQU   CVTSYSK
CVTRSV54 EQU   CVTSYSK
CVTRSV53 EQU   CVTSYSK
CVTRSV52 EQU   CVTA1F1
CVTRSV51 EQU   CVTA1F1
CVTRSV50 EQU   CVTA1F1
CVTRSV49 EQU   CVTA1F1
CVTRSV48 EQU   CVTA1F1
CVTRSV47 EQU   CVTA1F1
CVTSRSW  EQU   CVTA1F1
CVTPFSW  EQU   CVTA1F1
CVTPCVT  EQU   CVTMAP+352
CVTRSV46 EQU   CVTMAP+344
CVTRSV45 EQU   CVTMAP+340
CVTRSV44 EQU   CVTMAP+338
CVTRSV43 EQU   CVTMAP+336
CVTHJESA EQU   CVTHJES+1
CVTRSV42 EQU   CVTHJES
CVTEXT2A EQU   CVTEXT2+1
CVTRSV41 EQU   CVTEXT2
CVTAPFA  EQU   CVTAPF+1
CVTRSV40 EQU   CVTAPF
CVTRV518 EQU   CVTINTLA
CVTRV517 EQU   CVTERPV
CVTEORM  EQU   CVTMAP+312
CVTMCHPR EQU   CVTMAP+308
CVTTZ    EQU   CVTMAP+304
CVTJEPS  EQU   CVTMAP+300
CVTJESCT EQU   CVTMAP+296
CVTMODE  EQU   CVTMAP+292
CVTPTRV  EQU   CVTMAP+288
CVTREAL  EQU   CVTMAP+284
CVTRSV39 EQU   CVTMAP+280
CVTRSV38 EQU   CVTMAP+276
CVTDMSRA EQU   CVTDMSR+1
CVTRSV37 EQU   CVTDMSR
CVTQMSGA EQU   CVTQMSG+1
CVTRSV36 EQU   CVTQMSG
CVTPURGA EQU   CVTPURG+1
CVTRSV35 EQU   CVTPURG
CVTATERA EQU   CVTATER+1
CVTSYST  EQU   CVTATER
CVTVOLT2 EQU   CVTTAT
CVTVOLI2 EQU   CVTVOLF2
CVTAQAVB EQU   CVTAQAVT+1
CVTRSV34 EQU   CVTTCMFG
CVTRSV33 EQU   CVTTCMFG
CVTRSV32 EQU   CVTTCMFG
CVTRSV31 EQU   CVTTCMFG
CVTRSV30 EQU   CVTTCMFG
CVTRSV29 EQU   CVTTCMFG
CVTRSV28 EQU   CVTTCMFG
CVTTCRDY EQU   CVTTCMFG
CVTGTFA  EQU   CVTGTF+1
CVTRSV27 EQU   CVTGTFST
CVTRNIO  EQU   CVTGTFST
CVTUSR   EQU   CVTGTFST
CVTRV318 EQU   CVTFORM
CVTRV317 EQU   CVTTMODE
CVTRV316 EQU   CVTSTATE
CVTRV315 EQU   CVTGTFS
CVTGTFAV EQU   CVTGTFS
CVT0SCR1 EQU   CVTMAP+232
CVTRV515 EQU   CVTMAP+228
CVTRMS   EQU   CVTMAP+224
CVTPATCH EQU   CVTMAP+220
CVTTSCE  EQU   CVTMAP+216
CVTLNKSC EQU   CVTMAP+214
CVTQABST EQU   CVTMAP+212
CVTMDLDS EQU   CVTMAP+208
CVTUSER  EQU   CVTMAP+204
CVTABEND EQU   CVTMAP+200
CVTSMCA  EQU   CVTMAP+196
CVTRSV18 EQU   CVTMAP+192
CVTQLPAQ EQU   CVTMAP+188
CVTQCDSR EQU   CVTMAP+184
CVTRSV17 EQU   CVTOPTB
CVTRSV16 EQU   CVTOPTB
CVTFP    EQU   CVTOPTB
CVTAPTHR EQU   CVTOPTB
CVTNLOG  EQU   CVTOPTB
CVTTOD   EQU   CVTOPTB
CVTCTIMS EQU   CVTOPTB
CVTPROT  EQU   CVTOPTB
CVTXPFP  EQU   CVTOPTA
CVTASCII EQU   CVTOPTA
CVTRSV13 EQU   CVTOPTA
CVTRSV12 EQU   CVTOPTA
CVTNIP   EQU   CVTOPTA
CVTDDR   EQU   CVTOPTA
CVTAPR   EQU   CVTOPTA
CVTCCH   EQU   CVTOPTA
CVTSNCTR EQU   CVTMAP+180
CVTQMWR  EQU   CVTMAP+176
CVTQOCR  EQU   CVTMAP+172
CVT1EF00 EQU   CVTMAP+168
CVTMZ00  EQU   CVTMAP+164
CVTHEAD  EQU   CVTMAP+160
CVTRSV11 EQU   CVTMAP+156
CVT0PT01 EQU   CVTMAP+152
CVTMSER  EQU   CVTMAP+148
CVTRV516 EQU   CVTIERLC
CVTILCH  EQU   CVTMAP+140
CVT0DS   EQU   CVTMAP+136
CVTFBOSV EQU   CVTMAP+132
CVTNUCB  EQU   CVTMAP+128
CVTIXAVL EQU   CVTMAP+124
CVTIOQET EQU   CVTMAP+120
CVTDCBA  EQU   CVTMAP+117
CVTMVS2  EQU   CVTDCB
CVT6DAT  EQU   CVTDCB
CVT4MPS  EQU   CVTDCB
CVTRSV09 EQU   CVTDCB
CVT4MS1  EQU   CVTDCB
CVT2SPS  EQU   CVTDCB
CVT1SSS  EQU   CVTDCB
CVTRSV08 EQU   CVTDCB
CVTSTB   EQU   CVTMAP+112
CVTQTD00 EQU   CVTMAP+108
CVTQTE00 EQU   CVTMAP+104
CVTCUCB  EQU   CVTMAP+100
CVTSJQ   EQU   CVTMAP+96
CVTPBLDL EQU   CVTMAP+92
CVTTPC   EQU   CVTMAP+88
CVTSVDCB EQU   CVTMAP+84
CVTBRET  EQU   CVTMAP+82
CVTEXIT  EQU   CVTMAP+80
CVT0FN00 EQU   CVTMAP+76
CVTDARA  EQU   CVTDAR+1
CVTRSV07 EQU   CVTFLGS1
CVTRSV06 EQU   CVTFLGS1
CVTRSV05 EQU   CVTFLGS1
CVTRSV04 EQU   CVTFLGS1
CVTRSV03 EQU   CVTFLGS1
CVTRSV02 EQU   CVTFLGS1
CVTRSV01 EQU   CVTFLGS1
CVTDMPLK EQU   CVTFLGS1
CVTXITP  EQU   CVTMAP+68
CVTZDTAB EQU   CVTMAP+64
CVTMSLT  EQU   CVTMAP+60
CVTDATE  EQU   CVTMAP+56
CVTBTERM EQU   CVTMAP+52
CVTSYSAD EQU   CVTMAP+48
CVTXTLER EQU   CVTMAP+44
CVTILK2  EQU   CVTMAP+40
CVTILK1  EQU   CVTMAP+36
CVTPRLTV EQU   CVTMAP+32
CVTPCNVT EQU   CVTMAP+28
CVT0VL00 EQU   CVTMAP+24
CVTXAPG  EQU   CVTMAP+20
CVTBUF   EQU   CVTMAP+16
CVTJOB   EQU   CVTMAP+12
CVTLINK  EQU   CVTMAP+8
CVT0EF00 EQU   CVTMAP+4
CVT      EQU   CVTMAP
VARINFO  EQU   VARFIELD+2
@NM00045 EQU   EXTRCDPT+3
EXTGOCI  EQU   EXTRCDPT
NREPLF   EQU   CATRCD+48
NREPCV   EQU   CATRCD+47
RCDID    EQU   CATRCD+44
@NM00044 EQU   CATRCD+26
RCDDICTS EQU   CATRCD+22
RCDRACTS EQU   CATRCD+18
RCDCRADT EQU   CATRCD+14
RCDCRACI EQU   CATRCD+11
RCDCRAVL EQU   CATRCD+5
RCDRELID EQU   CATRCD+4
RCDKEYTY EQU   CATRCD
CATGOGC  EQU   CATGOGC1
@NM00043 EQU   CATGOFLG
@NM00042 EQU   CCARAB+2
CCARABRI EQU   CCARAB+1
CCARBUPD EQU   CCARABFL
@NM00041 EQU   CCARABFL
CCARBPA  EQU   CCARABFL
CCARBU2  EQU   CCARABFL
CCARBUR  EQU   CCARABFL
DIC2GC   EQU   DIC2ENT+3
@NM00040 EQU   DIC2FLGS
DIC2UPGD EQU   DIC2FLGS
DIC2SCRA EQU   DIC2FLGS
DIC2MV   EQU   DIC2FLGS
DIC2FLG  EQU   DIC2FLGS
DIC2COMB EQU   DIC2FLGS
DICTGC   EQU   DICTENT+3
@NM00039 EQU   DICTFLGS
DICTUPGD EQU   DICTFLGS
DICTSCRA EQU   DICTFLGS
DICTMV   EQU   DICTFLGS
DICTFLG  EQU   DICTFLGS
DICTCOMB EQU   DICTFLGS
DICTREP  EQU   DICTFLGS
DICTVAR  EQU   DICTFLGS
ENTNAMEV EQU   ENTNAMES+1
ENTNAMET EQU   ENTNAMES
WKALEN2  EQU   USERWKA+2
WKALEN1  EQU   USERWKA
CTGFLCHN EQU   CTGFL+12
CTGFLDTS EQU   CTGFLDRE
@NM00038 EQU   CTGFLDRE
CTGFLDCD EQU   CTGFL+1
CTGFIELD EQU   CTGPL+28
CTGPSWD  EQU   CTGJSCB
@NM00036 EQU   CTGFBFLG
CTGNGDSN EQU   CTGFBFLG
CTGGDGB  EQU   CTGFBFLG
CTGKEEP  EQU   CTGFBFLG
CTGPAR   EQU   CTGFBFLG
CTGFDBK  EQU   CTGNEWNM
CTGNOFLD EQU   CTGPL+19
CTGTYPE  EQU   CTGPL+18
@NM00035 EQU   CTGDSORG
CTGOPTNS EQU   CTGDSORG
@NM00034 EQU   CTGOPTN4
CTGDOCAT EQU   CTGOPTN4
CTGLBASE EQU   CTGOPTN4
CTGAM0   EQU   CTGOPTN3
CTGNUM   EQU   CTGOPTN3
CTGSRH   EQU   CTGOPTN3
CTGGDGL  EQU   CTGOPTN3
CTGSUPLT EQU   CTGOPTN3
CTGFUNC  EQU   CTGOPTN3
@NM00033 EQU   CTGOPTN2
CTGSCR   EQU   CTGOPTN2
CTGOVRID EQU   CTGOPTN2
CTGDISC  EQU   CTGOPTN2
CTGGTNXT EQU   CTGOPTN2
CTGRCATN EQU   CTGVMNT
CTGGTALL EQU   CTGREL
CTGNSVS  EQU   CTGEXT
CTGGENLD EQU   CTGOPTN1
CTGCNAME EQU   CTGOPTN1
CTGNAME  EQU   CTGOPTN1
CTGREAD  EQU   CTGOPTN1
CTGUPD   EQU   CTGOPTN1
CTGCI    EQU   CTGOPTN1
CTGMAST  EQU   CTGOPTN1
CTGBYPSS EQU   CTGOPTN1
CCAEND   EQU   IGGCCA+1492
CCADGDGA EQU   IGGCCA+1488
CCARETRX EQU   CCAERCDX+1
CCARESNX EQU   CCAERCDX
CCAMODDX EQU   CCAPROBX
CCASMFCD EQU   CCASMFP+3
CCASMFRC EQU   CCASMFP+2
CCASMFMD EQU   CCASMFP
CCAREWKA EQU   IGGCCA+1476
CCAVTS   EQU   IGGCCA+1468
CCARAVCA EQU   IGGCCA+1460
CCARANCA EQU   IGGCCA+1452
CCADICTS EQU   IGGCCA+1448
CCASUMTT EQU   IGGCCA+1445
@NM00032 EQU   CCAFLG10
CCAPRANX EQU   CCAFLG10
CCARARTC EQU   CCAFLG10
CCARAFEV EQU   CCAFLG10
CCACATAC EQU   CCAFLG10
CCAPDMW  EQU   CCAFLG10
CCAINCPL EQU   CCAFLG10
@NM00031 EQU   CCARALSA+2
CCACRABT EQU   CCARALSA
CCARAREC EQU   IGGCCA+1436
CCARARBA EQU   IGGCCA+1432
CCARARPL EQU   IGGCCA+1428
CCARAACB EQU   IGGCCA+1424
CCACRACI EQU   IGGCCA+1420
CCASBASE EQU   IGGCCA+1417
@NM00030 EQU   IGGCCA+1416
CCACUMPL EQU   IGGCCA+1412
CCADSPWA EQU   CCABZSAV
CCAMODNM EQU   CCAREGS+4
@NM00029 EQU   CCAREGS
@NM00028 EQU   IGGCCA+1057
@NM00027 EQU   CCARVFG1
RVESBOR  EQU   CCARVFG1
RVESBO   EQU   CCARVFG1
RVCMSFG  EQU   CCARVFG1
RVARFI   EQU   CCARVFG1
RVCCAV   EQU   CCARVFG1
ARFSBECH EQU   CCAARFWA+12
ARFSBSCH EQU   CCAARFWA+8
ARFGMADR EQU   CCAARFWA+4
ARFLEN   EQU   ARFGMLEN+1
ARFGMLP  EQU   ARFGMLEN
CCAMNADR EQU   CCAMNCAT+252
CCAMNLEN EQU   CCAMNCAT+249
CCAMNLL  EQU   CCAMNCAT+248
MNATARG2 EQU   CCAMNAT+244
MNATARG1 EQU   CCAMNAT+241
MNATSCLS EQU   MNATFLGS
@NM00026 EQU   MNATFLGS
MNATVAL  EQU   MNATFLGS
@NM00025 EQU   CCAMNAT+1
@NM00024 EQU   MNATTOP
MNATFULL EQU   MNATTOP
CCABMRB2 EQU   IGGCCA+740
CCABMRB1 EQU   IGGCCA+736
CCABMWK4 EQU   IGGCCA+732
CCABMWK3 EQU   IGGCCA+728
CCABMWK2 EQU   IGGCCA+724
CCABMWK1 EQU   IGGCCA+720
CCABMSTR EQU   IGGCCA+718
CCABMBYT EQU   IGGCCA+716
CCABMBTL EQU   IGGCCA+714
CCABMBT1 EQU   IGGCCA+712
CCABMEND EQU   IGGCCA+708
CCABMPTR EQU   IGGCCA+704
CCABMGOP EQU   IGGCCA+700
CCABMPAD EQU   IGGCCA+699
@NM00023 EQU   IGGCCA+697
CCABMOST EQU   CCABMOFG
CCABMOTR EQU   CCABMOUT+2
CCABMONN EQU   CCABMOUT
@NM00022 EQU   CCABMINP+7
CCABMLST EQU   CCABMFLG
CCABMCCK EQU   CCABMFLG
CCABMSET EQU   CCABMFLG
CCABMCHK EQU   CCABMFLG
CCABMST  EQU   CCABMFLG
CCABMMIN EQU   CCABMINP+4
CCABMLIM EQU   CCABMINP+2
CCABMTRK EQU   CCABMINP
CCAR14S  EQU   IGGCCA+680
CCAXLATE EQU   IGGCCA+640
CCADEL2  EQU   IGGCCA+637
CCADEL1  EQU   IGGCCA+634
CCAVAR1  EQU   IGGCCA+614
CCAVAR   EQU   IGGCCA+594
CCADELN  EQU   IGGCCA+592
CCAVARPT EQU   IGGCCA+588
CCARBASE EQU   IGGCCA+584
CCARRAB  EQU   IGGCCA+580
CCAVARLN EQU   IGGCCA+578
CCACI3   EQU   IGGCCA+575
CCACI2   EQU   IGGCCA+572
CCACI1   EQU   IGGCCA+569
CCACHAIN EQU   IGGCCA+566
CCASMFLN EQU   IGGCCA+564
CCASMFG2 EQU   CCASMFLG+1
@NM00021 EQU   CCASMFG1
CCASMFAL EQU   CCASMFSR
CCASMFDF EQU   CCASMFUC
CCASMFCT EQU   IGGCCA+560
CCASMFRD EQU   IGGCCA+556
CCANORBA EQU   IGGCCA+555
CCARESUM EQU   CCAFLG9
CCARAICI EQU   CCAFLG9
CCARAACT EQU   CCAFLG9
CCAUCRA  EQU   CCAFLG9
CCARACR  EQU   CCAFLG9
CCARALRD EQU   CCAFLG9
CCARAEOV EQU   CCAFLG9
CCARABYC EQU   CCAFLG9
CCAAUCAT EQU   CCAFLG8
CCALEOD  EQU   CCAFLG8
CCAVRIND EQU   CCAFLG8
CCALPIND EQU   CCAFLG8
CCASCICK EQU   CCAFLG8
CCASCRA  EQU   CCAFLG8
CCAVBUFI EQU   CCAFLG8
CCADSRCL EQU   CCAFLG8
CCACRABU EQU   CCAFLG7
CCAFEOV  EQU   CCAFLG7
CCAROREQ EQU   CCAFLG7
CCASMFBR EQU   CCAFLG7
CCASMFA  EQU   CCAFLG7
CCASMFEX EQU   CCAFLG7
CCALSP   EQU   CCAFLG7
CCALCPL  EQU   IGGCCA+548
CCASMFPT EQU   IGGCCA+544
CCAALPTR EQU   IGGCCA+540
CCAILNG3 EQU   IGGCCA+532
CCASDWAP EQU   IGGCCA+528
CCACWAP  EQU   IGGCCA+524
CCACDTCT EQU   IGGCCA+522
CCADTCT  EQU   IGGCCA+520
CCASVCI1 EQU   IGGCCA+509
CCASVCI  EQU   IGGCCA+506
CCAREPCT EQU   IGGCCA+502
CCAIXTPL EQU   IGGCCA+496
CCARCDID EQU   CCAGRGC
@NM00020 EQU   IGGCCA+492
CCANEFV  EQU   IGGCCA+491
CCANEVV  EQU   IGGCCA+486
CCARABSM EQU   CCAIDPT3
CCASMFIX EQU   IGGCCA+474
CCARBAL  EQU   IGGCCA+470
CCATLEN  EQU   CCATLNG
CCARBA2  EQU   CCARBA+16
CCARBA1  EQU   CCARBA+12
CCATT    EQU   CCARBA+10
CCACCHH2 EQU   CCACRADT
CCACCHH1 EQU   CCACRAVL+2
CCASS    EQU   CCACRAVL
CCATEST  EQU   IGGCCA+444
CCATNO   EQU   IGGCCA+442
CCATREL  EQU   IGGCCA+410
CCATNUM  EQU   IGGCCA+408
CCATNREL EQU   IGGCCA+406
CCAIXREL EQU   IGGCCA+404
CCAIXFPL EQU   IGGCCA+402
@NM00019 EQU   IGGCCA+400
CCALREL1 EQU   CCALREL
CCAGC    EQU   IGGCCA+395
CCACBASE EQU   IGGCCA+392
CCARABL  EQU   IGGCCA+388
CCARABF  EQU   IGGCCA+384
CCAMCPL  EQU   CCAXCPL
CCATFLPT EQU   CCAFLPT
CCACPE71 EQU   IGGCCA+352
CCARABSE EQU   CCACPE61
CCACPE53 EQU   IGGCCA+336
CCALUME  EQU   IGGCCA+324
CCAEXCMS EQU   CCACMS+4
CCACMSWA EQU   CCACMS
CCARPRM  EQU   IGGCCA+312
@NM00018 EQU   CCAMSSPL+10
CCAMNSPL EQU   CCAMSSPL+9
@NM00017 EQU   CCAMSSPL+8
CCAMNPTR EQU   CCAMSSPL+4
CCAMNLLP EQU   CCAMSSPL
CCAMLRET EQU   IGGCCA+296
CCAEDUCB EQU   CCAEQDQ+12
CCAEDRNM EQU   CCAEQDQ+8
CCAEDQNM EQU   CCAEQDQ+4
CCAEDRCD EQU   CCAEQDQ+3
@NM00016 EQU   CCAEDOPT
CCAEDSHR EQU   CCAEDOPT
CCAEDRLN EQU   CCAEQDQ+1
CCAEDXFF EQU   CCAEQDQ
CCAASCIX EQU   IGGCCA+270
CCACRRP  EQU   IGGCCA+269
CCAASCIK EQU   IGGCCA+268
CCAEXTTH EQU   CCAEXTDE+6
CCAEXTHH EQU   CCAEXTAD+2
CCAEXTCC EQU   CCAEXTAD
CCAEXTSS EQU   CCAEXTDE
CCASSVOL EQU   CCADESA+2
CCAIXEXT EQU   CCADESA+1
CCANDEXT EQU   CCADESA
CCARPL1  EQU   IGGCCA+220
CCAQLEN  EQU   IGGCCA+219
CCASC    EQU   IGGCCA+218
@NM00015 EQU   IGGCCA+212
CCARPLT  EQU   IGGCCA+211
CCARPLX  EQU   IGGCCA+210
CCARPLF  EQU   IGGCCA+209
CCARPLK  EQU   IGGCCA+208
CCACPE45 EQU   CCAR5SEG+8
CCACPE35 EQU   CCAR5SEG+4
CCACPE25 EQU   CCAR5SEG
CCAR5REC EQU   CCARAB5+4
@NM00014 EQU   CCARAB5+2
CCAR5RPL EQU   CCARAB5+1
CCAR5UPD EQU   CCAR5FLG
@NM00013 EQU   CCAR5FLG
CCAR5PA  EQU   CCAR5FLG
CCAR5WR  EQU   CCAR5FLG
CCAR5U2  EQU   CCAR5FLG
CCAR5U1  EQU   CCAR5FLG
CCAR5UR  EQU   CCAR5FLG
CCACPE44 EQU   CCAR4SEG+8
CCACPE34 EQU   CCAR4SEG+4
CCACPE24 EQU   CCAR4SEG
CCAR4REC EQU   CCARAB4+4
@NM00012 EQU   CCARAB4+2
CCAR4RPL EQU   CCARAB4+1
CCAR4UPD EQU   CCAR4FLG
@NM00011 EQU   CCAR4FLG
CCAR4PA  EQU   CCAR4FLG
CCAR4WR  EQU   CCAR4FLG
CCAR4U2  EQU   CCAR4FLG
CCAR4U1  EQU   CCAR4FLG
CCAR4UR  EQU   CCAR4FLG
CCACPE43 EQU   CCAR3SEG+8
CCACPE33 EQU   CCAR3SEG+4
CCACPE23 EQU   CCAR3SEG
CCAR3REC EQU   CCARAB3+4
@NM00010 EQU   CCARAB3+2
CCAR3RPL EQU   CCARAB3+1
CCAR3UPD EQU   CCAR3FLG
@NM00009 EQU   CCAR3FLG
CCAR3PA  EQU   CCAR3FLG
CCAR3WR  EQU   CCAR3FLG
CCAR3U2  EQU   CCAR3FLG
CCAR3U1  EQU   CCAR3FLG
CCAR3UR  EQU   CCAR3FLG
CCACPE42 EQU   CCAR2SEG+8
CCACPE32 EQU   CCAR2SEG+4
CCACPE22 EQU   CCAR2SEG
CCAR2REC EQU   CCARAB2+4
@NM00008 EQU   CCARAB2+2
CCAR2RPL EQU   CCARAB2+1
CCAR2UPD EQU   CCAR2FLG
@NM00007 EQU   CCAR2FLG
CCAR2PA  EQU   CCAR2FLG
CCAR2WR  EQU   CCAR2FLG
CCAR2U2  EQU   CCAR2FLG
CCAR2U1  EQU   CCAR2FLG
CCAR2UR  EQU   CCAR2FLG
CCACPE41 EQU   CCAR1SEG+8
CCACPE31 EQU   CCAR1SEG+4
CCACPE21 EQU   CCAR1SEG
CCAR1REC EQU   CCARAB1+4
@NM00006 EQU   CCARAB1+2
CCAR1RPL EQU   CCARAB1+1
CCAR1UPD EQU   CCAR1FLG
@NM00005 EQU   CCAR1FLG
CCAR1PA  EQU   CCAR1FLG
CCAR1WR  EQU   CCAR1FLG
CCAR1U2  EQU   CCAR1FLG
CCAR1U1  EQU   CCAR1FLG
CCAR1UR  EQU   CCAR1FLG
CCACPE40 EQU   CCAR0SEG+8
CCACPE30 EQU   CCAR0SEG+4
CCACPE20 EQU   CCAR0SEG
CCAR0REC EQU   CCARAB0+4
@NM00004 EQU   CCARAB0+2
CCAR0RPL EQU   CCARAB0+1
CCAR0UPD EQU   CCAR0FLG
@NM00003 EQU   CCAR0FLG
CCAR0PA  EQU   CCAR0FLG
CCAR0WR  EQU   CCAR0FLG
CCAR0U2  EQU   CCAR0FLG
CCAR0U1  EQU   CCAR0FLG
CCAR0UR  EQU   CCAR0FLG
@NM00002 EQU   CCASRCH+3
CCASRCIN EQU   CCASRID
CCANPCCB EQU   IGGCCA+36
CCADPL   EQU   CCARB
CCALBCYL EQU   CCATCB
CCAEXT   EQU   CCAFLG6
CCAREUSE EQU   CCAFLG6
CCASUPFD EQU   CCAFLG6
CCAINIT  EQU   CCAFLG6
CCAMCODR EQU   CCAFLG6
CCATEX2  EQU   CCAFLG5
CCATEX1  EQU   CCAFLG5
CCATEX   EQU   CCAFLG5
CCATHIT  EQU   CCAFLG5
CCAMODPA EQU   CCAFLG5
CCAMEX2  EQU   CCAFLG5
CCATCOMP EQU   CCAFLG4
CCAGVEX  EQU   CCAFLG4
CCAGVNBS EQU   CCAFLG4
CCAF4BYS EQU   CCAFLG4
CCAF4DRQ EQU   CCAFLG4
CCAEGREC EQU   CCAFLG3
CCALFT   EQU   CCAFLG3
CCAEXGR2 EQU   CCAFLG3
CCAGDSP  EQU   CCAFLG3
CCAGC4   EQU   CCAFLG3
CCAEXGR1 EQU   CCAFLG3
CCAF2SMO EQU   CCAFLG2
CCAF2CB  EQU   CCAF2COB
CCAF2CO  EQU   CCAF2COB
CCAF2RHS EQU   CCAFLG2
CCAF2XEQ EQU   CCAFLG2
CCAF2CCT EQU   CCAFLG2
CCAF2NVC EQU   CCAFLG2
CCAF2SYS EQU   CCAFLG2
CCAF1DK  EQU   CCAFLG1
CCAF1UP  EQU   CCAFLG1
CCAF1CR  EQU   CCAFLG1
CCAF1KGE EQU   CCAFLG1
CCAF1KEY EQU   CCAFLG1
CCAF1LRD EQU   CCAFLG1
CCAF1CNS EQU   CCAFLG1
CCAF1LPS EQU   CCAFLG1
CCACD2   EQU   IGGCCA+13
@NM00001 EQU   IGGCCA+8
CCACDR   EQU   CCAREASN
CCAMODID EQU   CCAPROB
CCASZ    EQU   IGGCCA+2
CCAID    EQU   IGGCCA
CATSPSN  EQU   CATGOSP+4
CATSPGC  EQU   CATGOSP+3
DTNAM    EQU   DTENT
@NM00075 EQU   PSA+3412
PSASTAK  EQU   PSA+3072
@NM00074 EQU   PSA+1040
PSAUSEND EQU   PSA+1040
PSARV062 EQU   PSA+1036
PSAATCVT EQU   PSA+1032
PSAPCPSW EQU   PSA+1024
PSARV060 EQU   PSA+1020
PSARV059 EQU   PSA+1018
PSASVC13 EQU   PSA+1016
PSALSFCC EQU   PSA+1012
PSASFACC EQU   PSA+1008
PSASTOP  EQU   PSA+992
PSASTART EQU   PSA+976
PSARSPSW EQU   PSA+968
PSASRPSW EQU   PSA+960
PSARV045 EQU   PSA+892
PSARV044 EQU   PSA+888
PSARV043 EQU   PSA+884
PSARV042 EQU   PSA+880
PSARV041 EQU   PSA+876
PSARV040 EQU   PSA+872
PSARV025 EQU   PSA+868
PSADSSED EQU   PSA+868
PSADSSPR EQU   PSA+864
PSADSSFW EQU   PSA+860
PSADSS14 EQU   PSA+856
PSADSSPP EQU   PSA+848
PSADSSRP EQU   PSA+840
PSADSS05 EQU   PSADSSF4
PSADSS10 EQU   PSADSSF4
PSADSSVE EQU   PSADSSF4
PSADSSDE EQU   PSADSSF4
PSADSSC0 EQU   PSADSSF4
PSADSSIE EQU   PSADSSF4
PSADSS12 EQU   PSADSSF4
PSADSSRC EQU   PSADSSF4
PSARV057 EQU   PSADSSF3
PSARV056 EQU   PSADSSF3
PSARV055 EQU   PSADSSF3
PSADSSMC EQU   PSADSSF3
PSADSSRW EQU   PSADSSF3
PSADSSNM EQU   PSADSSF3
PSADSSES EQU   PSADSSF3
PSADSSGP EQU   PSADSSF3
PSADSSF2 EQU   PSADSSFL+1
PSADSSPI EQU   PSADSSF1
PSADSSOI EQU   PSADSSF1
PSADSSSP EQU   PSADSSF1
PSADSSTP EQU   PSADSSF1
PSADSSDW EQU   PSADSSF1
PSADSSDD EQU   PSADSSF1
PSADSSDM EQU   PSADSSF1
PSADSSMV EQU   PSADSSF1
PSADSSTS EQU   PSA+816
PSADSSWK EQU   PSA+812
PSADSSR3 EQU   PSA+808
PSADSSR2 EQU   PSA+804
PSADSSRS EQU   PSA+800
PSASTOR  EQU   PSA+796
PSACPUSA EQU   PSA+794
PSAVSTAP EQU   PSA+792
PSAWKVAP EQU   PSA+788
PSAWKRAP EQU   PSA+784
PSAMCHIC EQU   PSA+783
PSARV061 EQU   PSA+782
PSASYMSK EQU   PSA+781
PSAMCHFL EQU   PSA+780
PSACR0   EQU   PSA+776
PSAPSWSV EQU   PSA+768
PSALITA  EQU   PSA+764
PSACLHS  EQU   PSAHLHI
PSALKR15 EQU   PSALKSA+60
PSALKR14 EQU   PSALKSA+56
PSALKR13 EQU   PSALKSA+52
PSALKR12 EQU   PSALKSA+48
PSALKR11 EQU   PSALKSA+44
PSALKR10 EQU   PSALKSA+40
PSALKR9  EQU   PSALKSA+36
PSALKR8  EQU   PSALKSA+32
PSALKR7  EQU   PSALKSA+28
PSALKR6  EQU   PSALKSA+24
PSALKR5  EQU   PSALKSA+20
PSALKR4  EQU   PSALKSA+16
PSALKR3  EQU   PSALKSA+12
PSALKR2  EQU   PSALKSA+8
PSALKR1  EQU   PSALKSA+4
PSALKR0  EQU   PSALKSA
PSARV023 EQU   PSACLHT+52
PSALOCAL EQU   PSACLHT+48
PSACMSL  EQU   PSACLHT+44
PSAOPTL  EQU   PSACLHT+40
PSATPACL EQU   PSACLHT+36
PSATPDNL EQU   PSACLHT+32
PSATPNCL EQU   PSACLHT+28
PSAIOSLL EQU   PSACLHT+24
PSAIOSUL EQU   PSACLHT+20
PSAIOSCL EQU   PSACLHT+16
PSAIOSSL EQU   PSACLHT+12
PSASALCL EQU   PSACLHT+8
PSAASML  EQU   PSACLHT+4
PSADISPL EQU   PSACLHT
PSASRSA  EQU   PSA+636
PSARV050 EQU   PSA+634
PSADSSGO EQU   PSA+633
PSARECUR EQU   PSA+632
PSAHLHIS EQU   PSA+628
PSAIPCSA EQU   PSA+624
@NM00073 EQU   PSA+621
PSAIPCDM EQU   PSA+620
PSAIPCD  EQU   PSA+616
@NM00072 EQU   PSA+613
PSAIPCRM EQU   PSA+612
PSAIPCR  EQU   PSA+608
PSAMCHEX EQU   PSA+600
PSAMPSW  EQU   PSA+592
PSAEXPS2 EQU   PSA+584
PSAEXPS1 EQU   PSA+576
PSAPIREG EQU   PSA+572
PSARSREG EQU   PSA+568
PSAGPREG EQU   PSA+556
PSARV022 EQU   PSASUP4
PSARV021 EQU   PSASUP4
PSARV020 EQU   PSASUP4
PSARV019 EQU   PSASUP4
PSARV018 EQU   PSASUP4
PSARV017 EQU   PSASUP4
PSARV016 EQU   PSASUP4
PSARV015 EQU   PSASUP4
PSARV014 EQU   PSASUP3
PSARV013 EQU   PSASUP3
PSARV012 EQU   PSASUP3
PSARV011 EQU   PSASUP3
PSARV010 EQU   PSASUP3
PSARV009 EQU   PSASUP3
PSARV008 EQU   PSASUP3
PSAIOSUP EQU   PSASUP3
PSALCR   EQU   PSASUP2
PSARTM   EQU   PSASUP2
PSAACR   EQU   PSASUP2
PSAIPCE2 EQU   PSASUP2
PSAIPCES EQU   PSASUP2
PSAIPCEC EQU   PSASUP2
PSAGTF   EQU   PSASUP2
PSAIPCRI EQU   PSASUP2
PSAIPCRP EQU   PSASUP1
PSAIPCDR EQU   PSASUP1
PSADISP  EQU   PSASUP1
PSALOCK  EQU   PSASUP1
PSAPI    EQU   PSASUP1
PSAEXT   EQU   PSASUP1
PSASVC   EQU   PSASUP1
PSAIO    EQU   PSASUP1
PSAAOLD  EQU   PSA+548
PSAANEW  EQU   PSA+544
PSATOLD  EQU   PSA+540
PSATNEW  EQU   PSA+536
PSALCCAR EQU   PSA+532
PSALCCAV EQU   PSA+528
PSAPCCAR EQU   PSA+524
PSAPCCAV EQU   PSA+520
PSACPULA EQU   PSA+518
PSACPUPA EQU   PSA+516
PSAPSA   EQU   PSA+512
FLCHDEND EQU   PSA+512
FLCCRSAV EQU   FLCMCLA+280
FLCGRSAV EQU   FLCMCLA+216
FLCFPSAV EQU   FLCMCLA+184
FLCFLA   EQU   FLCMCLA+88
FLCRGNCD EQU   FLCMCLA+84
FLCFSAA  EQU   FLCFSA+1
@NM00071 EQU   FLCFSA
@NM00070 EQU   FLCMCLA+72
FLCMCIC  EQU   FLCMCLA+64
@NM00069 EQU   FLCMCLA+20
FLCIOAA  EQU   FLCIOA+1
@NM00068 EQU   FLCIOA
@NM00067 EQU   FLCMCLA+15
@NM00066 EQU   FLCMCLA+14
@NM00065 EQU   FLCMCLA+12
FLCLCL   EQU   FLCMCLA+8
FLCIOELA EQU   FLCIOEL+1
@NM00064 EQU   FLCIOEL
FLCCHNID EQU   FLCMCLA
@NM00063 EQU   PSA+160
FLCMTRCD EQU   PSA+157
@NM00062 EQU   PSA+156
FLCPERA  EQU   FLCPER+1
@NM00061 EQU   FLCPER
@NM00060 EQU   PSA+151
FLCPERCD EQU   PSA+150
FLCMCNUM EQU   PSA+149
@NM00059 EQU   PSA+148
FLCTEAA  EQU   FLCTEA+1
@NM00058 EQU   FLCTEA
PSAPIPC  EQU   PSAPICOD
PSAPIMC  EQU   PSAPICOD
PSAPIPER EQU   PSAPICOD
PSARV049 EQU   FLCPICOD
FLCPILCB EQU   FLCPIILC
@NM00057 EQU   FLCPIILC
@NM00056 EQU   PSAEPPSW
FLCSVCN  EQU   PSAESPSW+2
FLCSILCB EQU   FLCSVILC
@NM00055 EQU   FLCSVILC
@NM00054 EQU   PSAESPSW
FLCEICOD EQU   PSAEEPSW+2
PSASPAD  EQU   PSAEEPSW
@NM00053 EQU   PSA+128
FLCINPSW EQU   PSA+120
FLCMNPSW EQU   PSA+112
FLCPNPSW EQU   PSA+104
FLCSNPSW EQU   PSA+96
FLCENPSW EQU   PSA+88
FLCTRACE EQU   PSA+84
FLCTIMER EQU   PSA+80
FLCCVT2  EQU   PSA+76
FLCCAW   EQU   PSA+72
FLCCSW   EQU   PSA+64
FLCIOPSW EQU   PSA+56
FLCMOPSW EQU   PSA+48
FLCPOPSW EQU   PSA+40
FLCSOPSW EQU   PSA+32
FLCEOPSW EQU   PSA+24
@NM00052 EQU   FLCICCW2+4
FLCCVT   EQU   FLCICCW2
FLCICCW1 EQU   FLCROPSW
FLCIPPSW EQU   FLCRNPSW
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS
@RC00191 EQU   @RC00186
@RC00180 EQU   @RC00173
@RC00175 EQU   @RC00173
@RT00200 EQU   @RC00173
@RC00350 EQU   @RC00349
@RC00523 EQU   @RC00522
@RC00570 EQU   @RC00569
@RC00614 EQU   @RC00613
@PB00011 EQU   @EL00001
@ENDDATA EQU   *
         END   IGG0CLAX,(C'PLS2316',0602,75011)
