*        %GOTO CIWAPLS;                                              /*
         MACRO
         IEACIWA &DSECT=YES
         AGO  .CIWARND
***********************************************************************
*                                                                     *
* STATUS -                                                            *
*    CHANGE LEVEL 0 (OS/VS2 REL 2 VERSION)                            *
* FUNCTION -                                                          *
*    MAPPING MACRO FOR COMMON INTERNAL WORK AREA                      *
* ENTRY POINTS -                                                      *
*     IEACIWA MACRO CALL                                              *
* INPUT -                                                             *
*    SEE IEACIWA MACRO DEFINITION                                     *
* OUTPUT -                                                            *
*    COMMON INTERNAL WORK AREA MAPPING MACRO                          *
* EXTERNAL REFERENCES -                                               *
*    N/A                                                              *
* EXITS, NORMAL -                                                     *
*    N/A                                                              *
* EXITS, ERROR -                                                      *
*    N/A                                                              *
* TABLES/WORK AREAS -                                                 *
*    N/A                                                              *
* ATTRIBUTES -                                                        *
*    BILINGUAL MACRO                                                  *
* CHARACTER CODE DEPENDENCY -                                         *
*    NONE                                                             *
* NOTES -                                                             *
*    NONE                                                             *
*                                                                     *
***********************************************************************
.CIWARND ANOP
         IEZBITS
***********************************************************************
*                  CIWA MAPPING     9/17/73                           *
***********************************************************************
         AIF   ('&DSECT' EQ 'NO').CIWA001
CIWA     DSECT , CIWAPTR
         AGO   .CIWA002
.CIWA001 ANOP
CIWA     DS    0F
.CIWA002 ANOP
CIWFLG1  DS    BL1 -                FIRST INTERNAL FLAG FIELD
CIWSVC2  EQU   BIT0 -               PSI ENTERED AT IGC112
CIWSVC3  EQU   BIT1 -               PSI ENTERED AT IGC113
CIWBREX  EQU   BIT3 -               PSI ENTERED VIA BRANCH ENTRY
*                                   FROM NON-RSM ROUTINE AT
*                                   IEAVPSIB/IEAVPSIX/IEAVPSIF.
CIWBRIN  EQU   BIT4 -               PSI ENTERED AT IEAVPSII
CIWOUTKR EQU   BIT5 -               INTERNAL KEEPREAL FLAG (PGOUT)
CIWFIXC  EQU   BIT6 -               PGFIX IS CALLING PGFREE
CIWNOPST EQU   BIT7 -               DO NOT POST REQUESTOR ECB FLAG.
*                                   SET BY PGFIX/PGLOAD MODULE
CIWFLG2  DS    BL1 -                RESERVED FLAG FIELD
CIWOPFL1 DS    BL1 -                FIRST BYTE OF INPUT VSL ENTRY
CIWCONT  EQU   BIT0 -               CONTINUATION/LIST FORM FLAG
CIWFIX   EQU   BIT1 -               PGFIX FLAG
CIWFREE  EQU   BIT2 -               PGFREE FLAG
CIWLOAD  EQU   BIT3 -               PGLOAD FLAG
CIWRLS   EQU   BIT4 -               PGRLSE FLAG
CIWLONG  EQU   BIT6 -               LONG-FIX OPTION FLAG
CIWOPFL2 DS    BL1 -                FIFTH BYTE OF INPUT VSL ENTRY
CIWLAST  EQU   BIT0 -               LAST ENTRY FLAG
CIWNULL  EQU   BIT1 -               NULL ENTRY FLAG
CIWRAO   EQU   BIT2 -               REAL ADDRESS OPTION FLAG
CIWERR   EQU   BIT3 -               ERROR FLAG
CIWPGOUT EQU   BIT5 -               PGOUT FLAG
CIWKEPRL EQU   BIT6 -               KEEPREAL OPTION FLAG
CIWEXTRS EQU   BIT7 -               RESERVED FOR EXTENDABILITY
CIWRETC  DS    FL1 -                RETURN CODE FIELD USED BY
*                                   SERVICE MODULES TO COMMUNICATE
*                                   RETURN CODES BACK TO PSI
CIWSAVRC DS    FL1 -                RETURN CODE SAVE AREA USED BY
*                                   PAGE SERVICES MODULES WHEN
*                                   CALLING ANOTHER PAGE SERVICES
*                                   MODULE
CIWKEY   DS    FL1 -                THE CALLER'S PROTECTION KEY
         DS    FL1 -                RESERVED
CIWINVSL DS    A -                  VSA OF THE REQUESTOR SUPPLIED
*                                   VSL. ZERO IF REGISTER FORM ENTRY
*                                   USED.
CIWCUVSL DS    A -                  VSA OF THE CURRENT VSL ENTRY
*                                   BEING PROCESSED. ZERO FOR
*                                   REGISTER ENTRY REQUEST.
CIWVSL   DS    0D -                 INTERNAL VSL ENTRY WHERE CURRENT
*                                   VSL ENTRY IS PLACED WHILE BEING
*                                   PROCESSED.
CIWSTRT  DS    0F -                 FULLWORD REFERENCE TO FIRST WORD
*                                   OF VSL
CIWIFLG1 DS    BL1 -                FIRST BYTE OF VSL ENTRY
CIWICONT EQU   BIT0 -               CONTINUATION/LIST FORM FLAG
CIWIFIX  EQU   BIT1 -               PGFIX FLAG
CIWIFREE EQU   BIT2 -               PGFREE FLAG
CIWILOAD EQU   BIT3 -               PGLOAD FLAG
CIWIRLS  EQU   BIT4 -               PGRLSE FLAG
CIWILONG EQU   BIT6 -               LONG-FIX OPTION FLAG
CIWSTRTA DS    AL3 -                START ADDR OF VIRTUAL SUBAREA
CIWEND1  DS    0F -                 FULLWORD REFERENCE TO LAST WORD
*                                   OF VSL
CIWIFLG2 DS    BL1 -                FIFTH BYTE OF VSL ENTRY
CIWILAST EQU   BIT0 -               LAST ENTRY FLAG
CIWINULL EQU   BIT1 -               NULL ENTRY FLAG
CIWIRAO  EQU   BIT2 -               REAL ADDRESS OPTION FLAG
CIWIERR  EQU   BIT3 -               ERROR FLAG
CIWIOUT  EQU   BIT5 -               PGOUT FLAG
CIWIKPRL EQU   BIT6 -               KEEPREAL OPTION FLAG
CIWEND1A DS    AL3 -                END ADDR+1 OF VIRTUAL SUBAREA
CIWTCB   DS    A -                  ADDRESS OF REQUESTOR TCB
CIWECB   DS    A -                  ADDRESS OF REQUESTOR SUPPLIED ECB
CIWCURPG DS    A -                  ADDRESS OF CURRENT VIRTUAL PAGE
*                                   BEING PROCESSED
CIWLSTPG DS    A -                  ADDRESS OF LAST VIRTUAL PAGE TO
*                                   BE PROCESSED
CIWRETRN DS    A -                  SAVE AREA FOR RETURN ADDR TO PSI.
*                                   USED BY SERVICE MODULES WHEN
*                                   CALLED BY PSI
CIWWRK1  DS    F -                  FIRST WORK AREA
CIWWRK2  DS    F -                  SECOND WORK AREA
CIWWRK3  DS    F -                  THIRD WORK AREA
CIWWRK4  DS    F -                  FOURTH WORK AREA
CIWWRK5  DS    F -                  FIFTH WORK AREA
CIWALEN  EQU   *-CIWA -             LENGTH OF CIWA
         MEND  , */
*%CIWAPLS :  ;
* /*******************************************************************/
* /*               CIWA MAPPING     9/17/73                          */
* /*******************************************************************/
*        %IF CIWA9999 ^= ','        /* IF THIS IS LAST BLOCK         */
*          %THEN %CIWA9999 = ';';   /* THEN CLOSE DCL STATEMENT      */
*        %IF CIWALEVL ^= ''         /* IF THIS IS CONCATENATED       */
*          %THEN %GOTO CIWAPLS1;    /* THEN SKIP DCL                 */
*DCL 1 CIWA BASED (CIWAPTR)         /* DECLARE CIWA LEVEL 1          */
*        %GO TO CIWAPLS2;           /* AND SKIP LEVEL TWO DCL        */
*%CIWAPLS1: CIWADUM=CIWALEVL ××' CIWA'; /* SET LEVEL FOR MINOR       */
*    CIWADUM                        /* MINOR STRUCTURE NAME PARM     */
*%CIWAPLS2:;
*        BDY(WORD),
*    3 CIWFLG1  BIT(8),             /* FIRST INTERNAL FLAG FIELD     */
*        5 CIWSVC2  BIT(1),         /* PSI ENTERED AT IGC112         */
*        5 CIWSVC3  BIT(1),         /* PSI ENTERED AT IGC113         */
*        5 *        BIT(1),         /* RESERVED                      */
*        5 CIWBREX  BIT(1),         /* PSI ENTERED VIA BRANCH ENTRY
*                                      FROM NON-RSM ROUTINE AT
*                                      IEAVPSIB/IEAVPSIX/IEAVPSIF.   */
*        5 CIWBRIN  BIT(1),         /* PSI ENTERED AT IEAVPSII       */
*        5 CIWOUTKR BIT(1),         /* INTERNAL KEEPREAL FLAG (PGOUT)*/
*        5 CIWFIXC  BIT(1),         /* PGFIX IS CALLING PGFREE       */
*        5 CIWNOPST BIT(1),         /* DO NOT POST REQUESTOR ECB
*                                      FLAG. SET BY PGFIX/PGLOAD MOD */
*    3 CIWFLG2  BIT(8),             /* RESERVED FLAG FIELD           */
*    3 CIWOPFL1 BIT(8),             /* FIRST BYTE OF INPUT VSL ENTRY */
*        5 CIWCONT  BIT(1),         /* CONTINUATION FLAG             */
*        5 CIWFIX   BIT(1),         /* PGFIX FLAG                    */
*        5 CIWFREE  BIT(1),         /* PGFREE FLAG                   */
*        5 CIWLOAD  BIT(1),         /* PGLOAD FLAG                   */
*        5 CIWRLS   BIT(1),         /* PGRLSE FLAG                   */
*        5 *        BIT(1),         /* RESERVED FOR VS1              */
*        5 CIWLONG  BIT(1),         /* LONG-FIX OPTION FLAG          */
*        5 *        BIT(1),         /* RESERVED FOR VS1              */
*    3 CIWOPFL2 BIT(8),             /* FIFTH BYTE OF INPUT VSL ENTRY */
*        5 CIWLAST  BIT(1),         /* LAST ENTRY FLAG               */
*        5 CIWNULL  BIT(1),         /* NULL ENTRY FLAG               */
*        5 CIWRAO   BIT(1),         /* REAL ADDRESS OPTION FLAG      */
*        5 CIWERR   BIT(1),         /* ERROR FLAG                    */
*        5 *        BIT(1),         /* RESERVED                      */
*        5 CIWPGOUT BIT(1),         /* PGOUT FLAG                    */
*        5 CIWKEPRL BIT(1),         /* KEEPREAL OPTION FLAG          */
*        5 CIWEXTRS BIT(1),         /* RESERVED FOR EXTENDABILITY    */
*    3 CIWRETC  FIXED(8),           /* RETURN CODE FIELD USED BY
*                                      SERVICE MODULES TO COMMUNICATE
*                                      RETURN CODES BACK TO PSI      */
*    3 CIWSAVRC FIXED(8),           /* RETURN CODE SAVE AREA USED BY
*                                      PAGE SERVICES MODULES WHEN
*                                      CALLING ANOTHER PAGE SERVICES
*                                      MODULE                        */
*    3 CIWKEY   FIXED(8),           /* THE CALLER'S PROTECTION KEY   */
*    3 *        FIXED(8),           /* RESERVED                      */
*    3 CIWINVSL PTR(31),            /* VSA OF THE REQUESTOR SUPPLIED
*                                      VSL. ZERO IF REGISTER FORM
*                                      ENTRY IS USED.                */
*    3 CIWCUVSL PTR(31),            /* VSA OF THE CURRENT VSL ENTRY
*                                      BEING PROCESSED. ZERO FOR
*                                      REGISTER ENTRY REQUESTS.      */
*    3 CIWVSL BDY(WORD)  CHAR(8),   /* INTERNAL VSL ENTRY WHERE
*                                      CURRENT VSL ENTRY IS PLACED
*                                      WHILE BEING PROCESSED.        */
*        5 CIWSTRT BDY(WORD),       /* FULLWORD REFERNCE TO FIRST
*                                      WORD OF VSL                   */
*          7 CIWIFLG1 BIT(8),       /* FIRST BYTE OF INPUT VSL ENTRY */
*             9 CIWICONT  BIT(1),   /* CONTINUATION FLAG             */
*             9 CIWIFIX   BIT(1),   /* PGFIX FLAG                    */
*             9 CIWIFREE  BIT(1),   /* PGFREE FLAG                   */
*             9 CIWILOAD  BIT(1),   /* PGLOAD FLAG                   */
*             9 CIWIRLS   BIT(1),   /* PGRLSE FLAG                   */
*             9 *         BIT(1),   /* RESERVED FOR VS1              */
*             9 CIWILONG  BIT(1),   /* LONG-FIX OPTION FLAG          */
*             9 *         BIT(1),   /* RESERVED FOR VS1              */
*          7 CIWSTRTA PTR(24),      /* START ADDR OF VIRTUAL SUBAREA */
*        5 CIWEND1 BDY(WORD),       /* FULLWORD REFERENCE TO LAST
*                                       WORD OF VSL                  */
*          7 CIWIFLG2 BIT(8),       /* FIFTH BYTE OF INPUT VSL ENTRY */
*             9 CIWILAST  BIT(1),   /* LAST ENTRY FLAG               */
*             9 CIWINULL  BIT(1),   /* NULL ENTRY FLAG               */
*             9 CIWIRAO   BIT(1),   /* REAL ADDRESS OPTION FLAG      */
*             9 CIWIERR   BIT(1),   /* ERROR FLAG                    */
*             9 *         BIT(1),   /* RESERVED                      */
*             9 CIWIOUT   BIT(1),   /* PGOUT FLAG                    */
*             9 CIWIKPRL  BIT(1),   /* KEAPREAL OPTION FLAG          */
*             9 *         BIT(1),   /* RESERVED FOR EXTENDABILITY    */
*          7 CIWEND1A PTR(24),      /* END ADDR+1 OF VIRTUAL AREA
*                                      SUBLIST                       */
*    3 CIWTCB   PTR(31),            /* ADDRESS OF REQUESTOR TCB      */
*    3 CIWECB   PTR(31),            /* ADDR OF REQUESTOR SUPPLIED
*                                      ECB                           */
*    3 CIWCURPG PTR(31),            /* ADDR OF CURRENT VIRTUAL
*                                      PAGE BEING PROCESSED          */
*    3 CIWLSTPG PTR(31),            /* ADDR OF LAST PAGE TO BE
*                                      PROCESSED                     */
*    3 CIWRETRN PTR(31),            /* SAVE AREA FOR RETURN ADDR
*                                      TO PSI. USED BY SERVICE
*                                      MODULES WHEN CALLED BY PSI    */
*    3 CIWWRK1  PTR(31),            /* FIRST  WORK AREA              */
*    3 CIWWRK2  PTR(31),            /* SECOND WORK AREA              */
*    3 CIWWRK3  PTR(31),            /* THIRD  WORK AREA              */
*    3 CIWWRK4  PTR(31),            /* FOURTH WORK AREA              */
*    3 CIWWRK5  PTR(31) CIWA9999    /* FIFTH  WORK AREA              */
*        %CIWALEN = 'LENGTH(CIWA)'; /* OBTAIN LENGTH OF CIWA         */
