         MACRO
&NAME  GECV  &SIZE            ENTER CHAR MODE VARIABLE
         GBLA  &IHBBLC,&IHBBLIM,&IHBCRSZ
         IHBGAM3
&IHBBLC    SETA  &IHBBLC+2              UPDATE BUFFER-LOC COUNTER
       AIF   (&IHBBLC LE &IHBBLIM).PROC
         IHBERMAC 182
.PROC    AIF   (T'&SIZE EQ 'O').NOTE    VALIDATE CHARACTER SIZE
         AIF   ('&SIZE'(1,1) EQ 'B').BASRT
         AIF   ('&SIZE'(1,1) EQ 'L').LARRT
         AIF   ('&SIZE'(1,1) EQ 'S').SMART
         AIF   ('&SIZE'(1,1) EQ 'U').UNCHR
.NOTE    IHBERMAC  180,SIZE,UNCHANGED
.UNCHR ANOP
&NAME  DC      H'10835'
       MEXIT
.BASRT ANOP
&NAME  DC      H'10832'
&IHBCRSZ SETA    1
       MEXIT
.SMART ANOP
&NAME  DC      H'10834'
&IHBCRSZ   SETA  0
       MEXIT
.LARRT ANOP
&NAME  DC      H'10833'
&IHBCRSZ   SETA  2
       MEND
