         MACRO
&NAME    POSTRCV
         GBLB  &SW,&RCV,&SEN,&RHDR,&SHDR
         GBLC  &SEND,&TEXT,&MGTP
         AIF   ('&NAME' EQ '').NONAME
&NAME    DS    0H
.NONAME  AIF   (&RCV AND NOT &SEN).OK
         MNOTE 12,'*** IHB071  SEQUENCE ERROR IN LPS DELIMITER MACRO'
.OK      AIF   ('&TEXT' EQ '' OR '&MGTP' EQ '').NOEQU
&MGTP    EQU   *
.NOEQU   ANOP
&RCV     SETB  0
&SEN     SETB  1
&RHDR    SETB  0
&SHDR    SETB  0
&TEXT    L     15,0(13)            ADDRESS OF LPS QUEUE IN IGG019NG
         B     312(15)             BUFFER CLEANUP ROUTINE
&TEXT    SETC  ''
&MGTP    SETC  'P'
         MEND
