         MACRO
&NAME    IEDMHGEN &TOTE=NO,&SSCP=YES
.*A-000000-999999                                              @Y17XAMN
.* &IEDQRN(8) - FEATURE FLAGS (&IEDQRN(1) - MH3705 FEATURE CODED
.* &IEDNCT - NUMBER OF TOTE ENTRIES
         GBLA  &IEDNCT
         GBLB  &IEDQRN(8)
         AIF   ('&SSCP' NE 'YES').SSCPNO SSCP=YES?
         AIF   (NOT &IEDQRN(1)).SSCPERR MH3705 FEATURE CODED?
         IEDSCPMH
         AGO   .CHKTOTE
.SSCPERR MNOTE 12,'*** IED060 SSCP MH INVALID FOR DEFINED MCP.'
         AGO   .CHKTOTE
.SSCPNO  AIF   ('&SSCP' EQ 'NO').CHKTOTE
         MNOTE 12,'*** IED061 INVALID SSCP OPERAND.'
.CHKTOTE AIF   ('&TOTE' NE 'YES').TOTENO TOTE=YES?
         AIF   ('&IEDNCT' EQ '0' ).TOTEERR ANY TOTE ENTRIES?
         IEDTOTMH
         AGO   .MEND
.TOTEERR MNOTE 12,'*** IED062 TOTE MH INVALID FOR DEFINED MCP.'
         AGO   .MEND
.TOTENO  AIF   ('&TOTE' EQ 'NO').MEND
         MNOTE 12,'*** IED063 INVALID TOTE OPERAND.'
.MEND    MEND
