         MACRO
&NAME    IEDQDID &DVCID,&B=(0,1,2)
.*060000,680000                                                  Y01004
         GBLA  &IEDQAR(64)
         LCLC  &IEDQIDN
         LCLA  &L,&D,&O
         SPACE 1
IEDQDVCC CSECT
&O       SETA  82-&IEDQAR(1)
&IEDQIDN  SETC 'IED'.'&IEDQAR(45)'.'&B(&IEDQAR(44))'
         AIF   ( '&DVCID' NE 'CONC').ID1
         CNOP  0,4
&IEDQIDN   DC  XL2'0',AL1(&IEDQAR(47)),X'0'  CONTROL WORD
&D       SETA  &IEDQAR(47)-4
         DC    X'01',X'FF'  CONC DVCID
         DC    AL2((&NAME-IEDQTNT-&O)/&IEDQAR(1))  CONC TNT OFFSET
         AGO   .IDEND
.ID1     ANOP
&L       SETA  (K'&DVCID+1)/2
&D       SETA  (&IEDQAR(47)-(&L+3))
         ORG   *-1  OVERLAY PREVIOUS END OF TABLE
&IEDQIDN DC    X'&L',XL&L'&DVCID'  ATTACHED TRM DVCID
         DC    AL2((&NAME-IEDQTNT-&O)/&IEDQAR(1))  ATT TRM TNT OFFSET
.IDEND   ANOP
         AIF   (&D EQ 0).FIN
         DC    XL&D'0'  FILLER
.FIN     ANOP
         DC    X'FE'  END OF TABLE
&IEDQAR(45) SETA &IEDQAR(45)+1
         AIF   ( &IEDQAR(45) LE 9999).IDE2
&IEDQAR(44) SETA &IEDQAR(44)+1
.IDE2    ANOP
         SPACE 1
IEDQTRMC CSECT                                                   Y01004
         MEND
