TMBM     TITLE ' IGTMBM -- USER CALL EXIT INTERFACE                    *
                        '
IGTMBM   CSECT ,                                                01S0001
@MAINENT DS    0H                                               01S0001
         USING *,@15                                            01S0001
         B     @PROLOG                                          01S0001
         DC    AL1(16)                                          01S0001
         DC    C'IGTMBM    77.093'                              01S0001
         DROP  @15
@PROLOG  STM   @14,@12,12(@13)                                  01S0001
         BALR  @07,0                                            01S0001
@PSTART  DS    0H                                               01S0001
         USING @PSTART,@07                                      01S0001
         L     @00,@SIZDATD                                     01S0001
         IGTYGSV  R,LV=(0)
         LR    @06,@01                                          01S0001
         USING @DATD,@06                                        01S0001
         ST    @13,@SA00001+4                                   01S0001
         LM    @00,@01,20(@13)                                  01S0001
         ST    @06,8(,@13)                                      01S0001
         LR    @13,@06                                          01S0001
         EJECT
*                                                               01S0086
*   /*****************************************************************/
*   /*                                                               */
*   /* FIND REQUESTED EXIT ROUTINE. SET DUSEREXT TO ADDRESS OF EXLST */
*   /* ENTRY. IF NO EXIT ROUTINE EXISTS, SET DUSEREXT TO 0.          */
*   /*                                                               */
*   /*****************************************************************/
*                                                               01S0086
*   DO;                             /* START OF CODE                 */
*                                                               02S0086
*     /***************************************************************/
*     /*                                                             */
*     /* DETERMINE TYPE OF ERROR (LOGICAL/PHYSICAL). IF LOGICAL, USE */
*     /* THE EXLLERF EXIT. IF PHYSICAL, USE THE EXLSYNP EXIT. THE    */
*     /* PYSICAL EXIT IS USED ONLY IF THE SPECIFIED ERROR            */
*     /* (APCWINT1-APCWINT3) IS SPECIFIED IN APCXINTV. SET DUSEREXT  */
*     /* TO THE ADDRESS OF THE SPECIFIED EXLST ENTRY. IF THE EXLST   */
*     /* ENTRY DOES NOT EXIST OR IS NOT ACTIVE, SET DUSEREXT TO 0.   */
*     /*                                                             */
*     /***************************************************************/
*                                                               02S0087
*     DUSEREXT=0;                   /* DEFAULT TO NO EXIT            */
         SLR   DUSEREXT,DUSEREXT                                02S0087
*     IF APCWACB>0&                 /* INSURE ACB EXISTS             */
*         ACBEXLST>1 THEN           /* INSURE EXLST EXISTS           */
         L     @09,APCWACB(,APCWPTR)                            02S0088
         LTR   @09,@09                                          02S0088
         BNP   @RF00088                                         02S0088
         L     @09,ACBEXLST(,@09)                               02S0088
         C     @09,@CF00056                                     02S0088
         BNH   @RF00088                                         02S0088
*       IF APCWINT0^=0 THEN         /* IF LOGICAL ERROR AND          */
         CLI   APCWINT0(APCWPTR),0                              02S0089
         BE    @RF00089                                         02S0089
*         IF EXLLEN>=20&            /* EXLST CONTAINS LERAD ENTRY    */
*             EXLLERA=BON THEN      /* AND ENTRY IS ACTIVE,          */
         LH    @03,EXLLEN(,@09)                                 02S0090
         C     @03,@CF01213                                     02S0090
         BL    @RF00090                                         02S0090
         TM    EXLLERA(@09),B'01000000'                         02S0090
         BNO   @RF00090                                         02S0090
*           DUSEREXT=ADDR(EXLLERF); /* RETURN LERAD ENTRY.           */
         LA    DUSEREXT,EXLLERF(,@09)                           02S0091
*         ELSE                                                  02S0092
*           ;                       /* COMPILER REQIREMENT           */
@RF00090 DS    0H                                               02S0093
*       ELSE                        /* IF PHYSICAL ERROR AND EXIT TO */
*         IF(APCWINTV&APCXINTV&CLRLOG)^=0&/* BE PROCESSED, AND       */
*             EXLLEN>=15&           /* EXLST CONTAINS SYNAD ENTRY    */
*             EXLSYNA=BON THEN      /* AND ENTRY IS ACTIVE, IF       */
         B     @RC00089                                         02S0093
@RF00089 L     @09,APCWACB(,APCWPTR)                            02S0093
         L     @03,ACBAMAX(,@09)                                02S0093
         L     @15,APCWINTV(,APCWPTR)                           02S0093
         N     @15,APCXINTV(,@03)                               02S0093
         N     @15,CLRLOG                                       02S0093
         LTR   @15,@15                                          02S0093
         BZ    @RF00093                                         02S0093
         L     @09,ACBEXLST(,@09)                               02S0093
         LH    @03,EXLLEN(,@09)                                 02S0093
         C     @03,@CF00043                                     02S0093
         BL    @RF00093                                         02S0093
         TM    EXLSYNA(@09),B'01000000'                         02S0093
         BNO   @RF00093                                         02S0093
*           DUSEREXT=ADDR(EXLSYNF); /* RETURN SYNAD ENTRY.           */
         LA    DUSEREXT,EXLSYNF(,@09)                           02S0094
*         ELSE                                                  02S0095
*           ;                       /* COMPILER REQIREMENT           */
@RF00093 DS    0H                                               02S0096
*     ELSE                                                      02S0096
*       ;                           /* COMPILER REQUIREMENT          */
*                                                               02S0096
@RF00088 DS    0H                                               02S0097
*     /***************************************************************/
*     /*                                                             */
*     /* DUSEREXT SET TO ADDRESS OF EXLST ENTRY OR TO 0              */
*     /*                                                             */
*     /***************************************************************/
*                                                               02S0097
*   END;                            /* END OF CODE                   */
@RC00088 DS    0H                                               02S0098
*   IF DUSEREXT^=0×                 /* IF USER & INSTALLATION EXITS  */
*       APCT1MBM^=ADDR(APCTBR14) THEN/* DO NOT EXIST, THEN DONE.     */
         LTR   DUSEREXT,DUSEREXT                                01S0098
         BNZ   @RT00098                                         01S0098
         LA    @09,APCTBR14(,APCTPTR)                           01S0098
         C     @09,APCT1MBM(,APCTPTR)                           01S0098
         BE    @RF00098                                         01S0098
@RT00098 DS    0H                                               01S0099
*     DO;                           /* OTHERWISE, CALL EXIT(S).      */
         EJECT
*                                                               01S0100
*       /*************************************************************/
*       /*                                                           */
*       /* BUILD PARAMETER LIST. SET DPARMPTR TO THE ADDRESS OF THIS */
*       /* LIST.                                                     */
*       /*                                                           */
*       /*************************************************************/
*                                                               01S0100
*       DO;                         /* START OF CODE                 */
*                                                               02S0100
*         /***********************************************************/
*         /*                                                         */
*         /* BUILD THE PARAMETER LIST TO BE PASSED TO THE USER'S AND */
*         /* INSTALLATION'S EXIT ROUTINE. ALSO BUILD EXIT-INTERFACE  */
*         /* BLOCK.                                                  */
*         /*                                                         */
*         /***********************************************************/
*                                                               02S0101
*                                                               02S0101
*         /***********************************************************/
*         /*                                                         */
*         /* BUILD INTERFACE BLOCK                                   */
*         /*                                                         */
*         /***********************************************************/
*                                                               02S0101
*         DRETCODE=RETCODE;         /* MOVE CODE & ADDR(EXITRTNR)    */
*                                                               02S0101
         MVC   DRETCODE(10),RETCODE                             02S0101
*         /***********************************************************/
*         /*                                                         */
*         /* BUILD PARAMETER LIST                                    */
*         /*                                                         */
*         /***********************************************************/
*                                                               02S0102
*         DPARMS=CPARMS;            /* INITIALIZE PARM LIST TO ADCONS
*                                      FOR 'DUMMY'.                  */
*                                                               02S0102
         MVC   DPARMS(60),CPARMS                                02S0102
*         /***********************************************************/
*         /*                                                         */
*         /* FOLLOWING FIELDS ALWAYS APPEAR                          */
*         /*                                                         */
*         /***********************************************************/
*                                                               02S0103
*         DAPIN=APCWAPIN;           /* USER'S INPUT PARAMETER LIST   */
         L     @09,APCWAPIN(,APCWPTR)                           02S0103
         ST    @09,DAPIN                                        02S0103
*         DAPEM=ADDR(APCWEMSG);     /* ERROR MESSAGE                 */
         LA    @09,APCWEMSG(,APCWPTR)                           02S0104
         ST    @09,DAPEM                                        02S0104
*         DR15C=ADDR(APCWR15C);     /* REGISTER 15 RETURN CODE       */
         LA    @09,APCWR15C(,APCWPTR)                           02S0105
         ST    @09,DR15C                                        02S0105
*         DRCDE=ADDR(APCWRCDE);     /* ERROR CODE                    */
         LA    @09,APCWRCDE(,APCWPTR)                           02S0106
         ST    @09,DRCDE                                        02S0106
*         DAPFN=ADDR(APCWAPFN);     /* CALL FUNCTION MNEMONIC        */
         LA    @09,APCWAPFN(,APCWPTR)                           02S0107
         ST    @09,DAPFN                                        02S0107
*         DAPUT=ADDR(APUT);         /* ARRAY PROCESSOR USER TABLE    */
         L     @09,APCWAPUT(,APCWPTR)                           02S0108
         ST    @09,DAPUT                                        02S0108
*         DWKAREA=ADDR(XWRKAREA);   /* 1K USER WORKAREA              */
*                                                               02S0109
         LA    @09,XWRKAREA                                     02S0109
         ST    @09,DWKAREA                                      02S0109
*         /***********************************************************/
*         /*                                                         */
*         /* FOLLOWING FIELDS CONDITIONALLY APPEAR. IF MISSING, THE  */
*         /* PARAMETER LIST ENTRY POINTS TO THE VARIABLE 'DUMMY'     */
*         /*                                                         */
*         /***********************************************************/
*                                                               02S0110
*         IF APCWACB>0 THEN         /* FOLLOWING FIELDS REQUIRE ACB  */
         SLR   @09,@09                                          02S0110
         L     @03,APCWACB(,APCWPTR)                            02S0110
         CR    @03,@09                                          02S0110
         BNH   @RF00110                                         02S0110
*           DO;                     /* IF MISSING, POINT TO 'DUMMY'  */
*             DACB=APCWACB;         /* ARRAY PROCESSOR ACB           */
         ST    @03,DACB                                         02S0112
*             IF APCWAPRL>0 THEN    /* FOLLOWING FIELDS REQUIRE APRL */
         L     @03,APCWAPRL(,APCWPTR)                           02S0113
         CR    @03,@09                                          02S0113
         BNH   @RF00113                                         02S0113
*               DO;                 /* IF MISSING, POINT TO 'DUMMY'  */
*                 DAPRL=APCWAPRL;   /* ARRAY PROCESSOR ACB REQUEST   */
         ST    @03,DAPRL                                        02S0115
*                 IF(APCWAPIO>0)&   /* IF APIO EXISTS AND PHYSICAL   */
*                     (APCWINTV&CLRLOG)^=0 THEN/* ERROR OCCURRED,    */
         L     @03,APCWAPIO(,APCWPTR)                           02S0116
         CR    @03,@09                                          02S0116
         BNH   @RF00116                                         02S0116
         L     @15,APCWINTV(,APCWPTR)                           02S0116
         N     @15,CLRLOG                                       02S0116
         CLR   @15,@09                                          02S0116
         BE    @RF00116                                         02S0116
*                   DO;             /* THEN POINT TO I/O DATA.       */
*                     DCSW=APIOVCSW;/* ADDRESS OF VIRTUAL CSW        */
         L     @09,APIOVCSW(,@03)                               02S0118
         ST    @09,DCSW                                         02S0118
*                     DCCW=APIOCCW; /* ADDRESS OF CHANNEL PROGRAM
*                                      (PROTECTED COPY)              */
         L     @09,APIOCCW(,@03)                                02S0119
         ST    @09,DCCW                                         02S0119
*                     DAPCI=APIOAPCI;/* 3838 COMMAND INTERFACE TABLE */
         L     @09,APIOAPCI(,@03)                               02S0120
         ST    @09,DAPCI                                        02S0120
*                     IF APIOVSNS=BON THEN/* IF SENSE DATA VALID,    */
         TM    APIOVSNS(@03),B'01000000'                        02S0121
         BNO   @RF00121                                         02S0121
*                       DO;         /* GIVE MORE INFORMATION         */
*                         RFY                                   02S0123
*                           APSN BASED(ADDR(APIOSNSE));/* SENSE DATA */
*                         DSNSE=ADDR(APSN);/* POINT TO SENSE DATA    */
         AL    @03,@CF01724                                     02S0124
         ST    @03,DSNSE                                        02S0124
*                         IF APSNCIDS>0 THEN/* IF APCI ENTRY OFFSET  */
         LH    @03,APSNCIDS(,@03)                               02S0125
         N     @03,@CF01803                                     02S0125
         LTR   @03,@03                                          02S0125
         BNP   @RF00125                                         02S0125
*                           DLAPCI=APIOAPCI+APSNCIDS;/* TELL USER    */
         ALR   @09,@03                                          02S0126
         ST    @09,DLAPCI                                       02S0126
*                         IF APIOVINX=BON THEN/* IF VALID 3838 INDEX */
@RF00125 L     @09,APCWAPIO(,APCWPTR)                           02S0127
         TM    APIOVINX(@09),B'00100000'                        02S0127
         BNO   @RF00127                                         02S0127
*                           DXREGS=ADDR(APIOINDX);/* REGS, TELL USER */
         LA    @09,APIOINDX(,@09)                               02S0128
         ST    @09,DXREGS                                       02S0128
*                         RFY                                   02S0129
*                           APSN;   /* FINISHED WITH SENSE           */
@RF00127 DS    0H                                               02S0130
*                       END;        /* SENSE DATA PROCESSED          */
*                   END;            /* APIO DATA PROCESSED           */
@RF00121 DS    0H                                               02S0132
*               END;                /* APRL/APIO DATA PROCESSED      */
@RF00116 DS    0H                                               02S0133
*           END;                    /* ACB/APRL/APIO DATA PROCESSED  */
@RF00113 DS    0H                                               02S0134
*         DPARMFLG=BON;             /* SET LAST ENTRY FLAG           */
@RF00110 OI    DPARMFLG,B'10000000'                             02S0134
*       END;                        /* END OF CODE                   */
         EJECT
*                                                               01S0136
*       /*************************************************************/
*       /*                                                           */
*       /* CALL INSTALLATION AND/OR USER EXIT.                       */
*       /*                                                           */
*       /*************************************************************/
*                                                               01S0136
*       RFY                                                     01S0136
*        (APEXLPTR) RSTD;           /* SET APEXLPTR TO ADDRESS OF    */
*       RFY                                                     01S0137
*        (IFGEXLEF) BASED(APEXLPTR);/* EXLST ENTRY.                  */
*       IF APCT1MBM^=ADDR(APCTBR14) THEN/* IF INSTALLATION EXIT      */
         L     @11,APCT1MBM(,APCTPTR)                           01S0138
         LA    @09,APCTBR14(,APCTPTR)                           01S0138
         CR    @11,@09                                          01S0138
         BE    @RF00138                                         01S0138
*         DO;                       /* EXISTS, THEN CALL IT.         */
*           APEXLPTR=ADDR(DEXLST);  /* EXLST WORKAREA FOR INSTAL.EXIT*/
         LA    APEXLPTR,DEXLST                                  01S0140
*           EXLFLAG=0;              /* BUILD DUMMY EXLST ENTRY       */
         MVI   EXLFLAG(APEXLPTR),X'00'                          01S0141
*           EXLSPEC=BON;            /* FOR THE INSTALLATION          */
*           EXLACTM=BON;            /* EXIT. MOVE ADDRESS INTO       */
         OI    EXLSPEC(APEXLPTR),B'11000000'                    01S0143
*           EXLEXITP=APCT1MBM;      /* THE EXLST.                    */
         STCM  @11,15,EXLEXITP(APEXLPTR)                        01S0144
*           CALL EXITRTN;           /* CALL INTERFACE ROUTINE        */
         BAL   @14,EXITRTN                                      01S0145
*         END;                      /* INSTALLATION EXIT PROCESSED   */
*       APEXLPTR=DUSEREXT;          /* USER EXLST ENTRY.             */
@RF00138 LR    APEXLPTR,DUSEREXT                                01S0147
*       IF APEXLPTR^=0 THEN         /* IF EXLST ENTRY EXISTS THEN    */
         LTR   APEXLPTR,APEXLPTR                                01S0148
         BZ    @RF00148                                         01S0148
*         CALL EXITRTN;             /* CALL INTERFACE ROUTINE.       */
         BAL   @14,EXITRTN                                      01S0149
*     END;                          /* USER/INSTALLATION EXITS DONE  */
*   RFY                                                         01S0151
*     IFGEXLEF;                     /* FINISHED WITH EXLST OVERLAY   */
*   RFY                                                         01S0152
*    (APEXLPTR) UNRSTD;             /* FINISHED WITH EXLST POINTER   */
*   RETURN;                         /* RETURN TO CALLER              */
@EL00001 L     @13,4(,@13)                                      01S0153
@EF00001 L     @00,@SIZDATD                                     01S0153
         LR    @01,@06                                          01S0153
         IGTYFSV  R,LV=(0),A=(1)
@ER00001 LM    @14,@12,12(@13)                                  01S0153
         BR    @14                                              01S0153
         EJECT
*EXITRTN:                           /* USER EXIT ROUTINE INTERFACE   */
*   PROCEDURE;                      /* APEXLPTR IS INPUT             */
*                                                               01S0154
EXITRTN  STM   @14,@12,@SA00002                                 01S0154
*   /*****************************************************************/
*   /*                                                               */
*   /* CALL THE SPECIFIED EXIT ROUTINE. 'APEXLPTR' CONTAINS THE      */
*   /* ADDRESS OF THE EXLST ENTRY. ON ENTRY TO THE EXIT, REGISTER 0  */
*   /* IS UNUSED, REGISTER 1 POINTS TO THE PARAMETER LIST, REGISTERS */
*   /* 2 THRU 13 ARE THE SAME AS ON ENTRY TO VPSS, REGISTER 14       */
*   /* CONTAINS THE RETURN ADDRESS, AND REGISTER 15 CONTAINS THE EXIT*/
*   /* ROUTINE'S ENTRY POINT ADDRESS. ON RETURN, REGISTER 14 MUST BE */
*   /* UNCHANGED.                                                    */
*   /*                                                               */
*   /*****************************************************************/
*                                                               01S0155
*   RFY                                                         01S0155
*    (APEXLPTR) RSTD;               /* POINTER TO EXIT LIST ENTRY    */
*   RFY                                                         01S0156
*     IFGEXLEF BASED(APEXLPTR);     /* EXIT LIST ENTRY ADDRESS       */
*   RFY                                                         01S0157
*    (R0P,                                                      01S0157
*     R1P,                                                      01S0157
*     R14P,                                                     01S0157
*     R15P) RSTD;                   /* REGISTERS USED                */
*                                                               01S0157
*   /*****************************************************************/
*   /*                                                               */
*   /* SAVE CONTENTS OF USER'S INPUT SAVEAREA                        */
*   /*                                                               */
*   /*****************************************************************/
*                                                               01S0158
*   DAPSV=APCWAPSV->APSV(1:APSVOSLN);/* ALLOW REUSE OF SAVEAREA      */
         L     @11,APCWAPSV(,APCWPTR)                           01S0158
         MVC   DAPSV(72),APSV(@11)                              01S0158
*   APCWAPSV->APSVNEXT=0;           /* REMOVE VPSS SAVEAREA POINTER  */
         SLR   @09,@09                                          01S0159
         ST    @09,APSVNEXT(,@11)                               01S0159
*   R15P=EXLEXITP;                  /* EXIT RTN ADDRESS OR NAME      */
         ICM   R15P,15,EXLEXITP(APEXLPTR)                       01S0160
*   IF EXLLNK=BON THEN              /* IF MODULE NAME SPECIFIED      */
         TM    EXLLNK(APEXLPTR),B'00100000'                     01S0161
         BNO   @RF00161                                         01S0161
*     DO;                           /* IN EXLST ENTRY, THEN          */
*       GEN(LOAD  EPLOC=(15));      /* LOAD THE MODULE. R0-> EP      */
         LOAD  EPLOC=(15)
*       R15P=R0P;                   /* SET R15 TO ENTRY POINT.       */
         LR    R15P,R0P                                         01S0164
*     END;                          /* R15 -> EXIT ROUTINE ENTRY PT. */
*   IF APCWAPRL>0 THEN              /* IF APRL EXISTS, INDICATE      */
@RF00161 L     @11,APCWAPRL(,APCWPTR)                           01S0166
         LTR   @11,@11                                          01S0166
         BNP   @RF00166                                         01S0166
*     APRLEXTA=BON;                 /* IN EXIT ROUTINE.              */
         OI    APRLEXTA(@11),B'10000000'                        01S0167
*   R1P=ADDR(DPARMS);               /* PARAMETER LIST ADDRESS        */
@RF00166 LA    R1P,DPARMS                                       01S0168
*   R14P=ADDR(DRET);                /* RETURN ADDRESS                */
         LA    R14P,DRET                                        01S0169
*   STM(R0P,R15P,DRETSAVE);         /* SAVE REGISTERS ACROSS EXIT    */
         STM   R0P,R15P,DRETSAVE                                01S0170
*   APSVPTR=APCWAPSV;               /* RESTORE REGISTERS 2-13 AS     */
         L     APSVPTR,APCWAPSV(,APCWPTR)                       01S0171
*   GEN(LM    2,12,APSVRG2-APSV(APSVPTR))/* ON ENTRY TO VPSS         */
*   REFS(APSVRG2,APSV,APSVPTR);                                 01S0172
         LM    2,12,APSVRG2-APSV(APSVPTR)
*   GEN(BR R15P)                    /* CALL EXIT ROUTINE             */
*   REFS(R15P)                      /* CONTROL RETURN TO 'EXITRTNR'  */
*       FLOWS(EXITRTNR)             /* VIA 'DRET' CODE OR USER       */
*       EXIT;                       /* MAY NOT RETURN AT ALL.        */
*                                                               01S0173
         BR R15P
*   /*****************************************************************/
*   /*                                                               */
*   /* EXIT ROUTINE WILL RETURN ON REGISTER 14. THIS IS ADDRESS OF   */
*   /* CODE IN THE DYNAMIC AREA WHICH BRANCHES TO 'EXITRTNR' AFTER   */
*   /* SETTING REGISTER 14 TO THE ADDRESS OF 'DSAVE'.                */
*   /*                                                               */
*   /*****************************************************************/
*                                                               01S0174
*EXITRTNR:                                                      01S0174
*                                                               01S0174
*   /*****************************************************************/
*   /*                                                               */
*   /* CONTROL PASSES HERE ON RETURN FROM EXIT ROUTINE. REGISTER 14  */
*   /* POINTS TO DSAVE. RESTORE SAVED REGISTERS, DELETE THE EXIT     */
*   /* ROUTINE, IF REQUIRED, & RETURN TO THE CALLER.                 */
*   /*                                                               */
*   /*****************************************************************/
*                                                               01S0174
*   GEN(LM    0,15,4(14));          /* RESTORE VPSS'S REGISTERS      */
*                                                               01S0174
EXITRTNR LM    0,15,4(14)
*   /*****************************************************************/
*   /*                                                               */
*   /* RESTORE CONTENTS OF USER'S INPUT SAVEAREA                     */
*   /*                                                               */
*   /*****************************************************************/
*                                                               01S0175
*   APCWAPSV->APSV(1:APSVOSLN)=DAPSV;/* RESTORE USER'S SAVEAREA      */
         L     @11,APCWAPSV(,APCWPTR)                           01S0175
         MVC   APSV(72,@11),DAPSV                               01S0175
*   IF EXLLNK=BON THEN              /* IF EXIT ROUTINE LOADED,       */
         TM    EXLLNK(APEXLPTR),B'00100000'                     01S0176
         BNO   @RF00176                                         01S0176
*     DO;                           /* THEN DELETE IT NOW.           */
*       R15P=EXLEXITP;              /* POINT TO MODULE NAME          */
         ICM   R15P,15,EXLEXITP(APEXLPTR)                       01S0178
*       GEN(DELETE EPLOC=(15));     /* ISSUE DELETE                  */
         DELETE EPLOC=(15)
*     END;                          /* MODULE ELIMINATED             */
*   IF APCWAPRL>0 THEN              /* IF APRL EXISTS, INDICATE      */
@RF00176 L     @11,APCWAPRL(,APCWPTR)                           01S0181
         LTR   @11,@11                                          01S0181
         BNP   @RF00181                                         01S0181
*     APRLEXTA=BOFF;                /* NO LONGER IN EXIT ROUTINE.    */
         NI    APRLEXTA(@11),B'01111111'                        01S0182
*   RFY                                                         01S0183
*    (APEXLPTR,                                                 01S0183
*     R0P,                                                      01S0183
*     R1P,                                                      01S0183
*     R14P,                                                     01S0183
*     R15P) UNRSTD;                 /* FINISHED WITH REGISTERS       */
*   RFY                                                         01S0184
*    (IFGEXLEF);                    /* FINISHED WITH EXIT LIST       */
*   END EXITRTN;                    /* RETURN TO CALLER              */
@EL00002 DS    0H                                               01S0185
@EF00002 DS    0H                                               01S0185
@ER00002 LM    @14,@12,@SA00002                                 01S0185
         BR    @14                                              01S0185
         EJECT
*                                   /* IGTXEPLG                      */
*                                                               01S0186
*   /*****************************************************************/
*   /*                                                               */
*   /* SYSTEM DECLARES                                               */
*   /*                                                               */
*   /*****************************************************************/
*                                                               01S0186
*   DECLARE                         /* COMMON VARIABLES              */
*     I256C CHAR(256) BASED,                                    01S0186
*     I031F FIXED(31) BASED,                                    01S0186
*     I031P PTR(31) BASED,                                      01S0186
*     I015F FIXED(15) BASED,                                    01S0186
*     I015P PTR(15) BASED,                                      01S0186
*     I008P PTR(8) BASED,                                       01S0186
*     I001C CHAR(1) BASED;                                      01S0186
*                                                               01S0187
*   /*****************************************************************/
*   /*                                                               */
*   /* MODULE PATCH AREA                                             */
*   /*                                                               */
*   /*****************************************************************/
*                                                               01S0187
*   DCL                                                         01S0187
*     APPATCH CHAR(*) INT STATIC LOCAL GEND;                    01S0187
*   GENERATE DATA DEFS(APPATCH);                                01S0188
*                                                               01S0189
*   /*****************************************************************/
*   /*                                                               */
*   /* GENERAL REGISTER DECLARES                                     */
*   /*                                                               */
*   /*****************************************************************/
*                                                               01S0189
*   DCL                                                         01S0189
*     R0F FIXED(31) REG(0),                                     01S0189
*     R0P PTR(24) REG(0),                                       01S0189
*     R0RSTD PTR(31) REG(0),                                    01S0189
*     R1F FIXED(31) REG(1),                                     01S0189
*     R1P PTR(24) REG(1),                                       01S0189
*     R1RSTD PTR(31) REG(1),                                    01S0189
*     R2F FIXED(31) REG(2),                                     01S0189
*     R2P PTR(24) REG(2),                                       01S0189
*     R2RSTD PTR(31) REG(2),                                    01S0189
*     R3F FIXED(31) REG(3),                                     01S0189
*     R3P PTR(24) REG(3),                                       01S0189
*     R3RSTD PTR(31) REG(3),                                    01S0189
*     R4F FIXED(31) REG(4),                                     01S0189
*     R4P PTR(24) REG(4),                                       01S0189
*     R4RSTD PTR(31) REG(4),                                    01S0189
*     R5F FIXED(31) REG(5),                                     01S0189
*     R5P PTR(24) REG(5),                                       01S0189
*     R5RSTD PTR(31) REG(5),                                    01S0189
*     R6F FIXED(31) REG(6),                                     01S0189
*     R6P PTR(24) REG(6),                                       01S0189
*     R6RSTD PTR(31) REG(6),                                    01S0189
*     R7F FIXED(31) REG(7),                                     01S0189
*     R7P PTR(24) REG(7),                                       01S0189
*     R7RSTD PTR(31) REG(7),                                    01S0189
*     R8F FIXED(31) REG(8),                                     01S0189
*     R8P PTR(24) REG(8),                                       01S0189
*     R8RSTD PTR(31) REG(8),                                    01S0189
*     R9F FIXED(31) REG(9),                                     01S0189
*     R9P PTR(24) REG(9),                                       01S0189
*     R9RSTD PTR(31) REG(9),                                    01S0189
*     R10F FIXED(31) REG(10),                                   01S0189
*     R10P PTR(24) REG(10),                                     01S0189
*     R10RSTD PTR(31) REG(10),                                  01S0189
*     R11F FIXED(31) REG(11),                                   01S0189
*     R11P PTR(24) REG(11),                                     01S0189
*     R11RSTD PTR(31) REG(11),                                  01S0189
*     R12F FIXED(31) REG(12),                                   01S0189
*     R12P PTR(24) REG(12),                                     01S0189
*     R12RSTD PTR(31) REG(12),                                  01S0189
*     R13F FIXED(31) REG(13),                                   01S0189
*     R13P PTR(24) REG(13),                                     01S0189
*     R13RSTD PTR(31) REG(13),                                  01S0189
*     R14F FIXED(31) REG(14),                                   01S0189
*     R14P PTR(24) REG(14),                                     01S0189
*     R14RSTD PTR(31) REG(14),                                  01S0189
*     R15F FIXED(31) REG(15),                                   01S0189
*     R15P PTR(24) REG(15),                                     01S0189
*     R15RSTD PTR(31) REG(15),                                  01S0189
*                                                               01S0189
*     /***************************************************************/
*     /*                                                             */
*     /* VPSS CONTROL BLOCK POINTER DECLARES                         */
*     /*                                                             */
*     /***************************************************************/
*                                                               01S0189
*     APSMPTR PTR(24) REG(01),      /* STORAGE MANAGEMENT BLOCK 01S0189
*                                      (SUGGESTED POINTER)           */
*     APSCPTR PTR(24) REG(01),      /* STORAGE MANAGEMENT CONTROL
*                                      WORD (SUGGESTED POINTER)      */
*     APINPTR PTR(24) REG(01),      /* USER'S INPUT PARAMETER LIST
*                                      (SUGGESTED POINTER)           */
*/*                                                                  */
*                                                               01S0189
*     APDATA PTR(24) REG(06),       /* ADDRESS OF DYNAMIC DATA  01S0189
*                                      WORKAREA (DATAREG)            */
*     APCODE PTR(24) REG(07),       /* PROGRAM CODE BASE REGISTER
*                                      (CODEREG)                     */
*     APDEBPTR PTR(24) REG(08),     /* VPSS DEB (SUGGESTED POINTER)  */
*     APNPPTR PTR(24) REG(08),      /* SUBSYSTEM INITIALIZATION 01S0189
*                                      WORKAREA BLOCK (ONLY USED BY
*                                      SUBSYSTEM INITIALIZATION)     */
*     APRLPTR PTR(24) REG(08),      /* VPSS ACB REQUEST LIST    01S0189
*                                      (SUGGESTED POINTER)           */
*     APCIPTR PTR(24) REG(08),      /* 3838 CONTROL TABLE (SUGGESTED
*                                      POINTER)                      */
*     APCWPTR PTR(24) REG(08),      /* CALL INTERFACE WORKAREA  01S0189
*                                      (SUGGESTED POINTER)           */
*     APERPTR PTR(24) REG(08),      /* ERP/IO APPENDAGE WORKAREA
*                                      (SUGGESTED POINTER)           */
*     APACBPTR PTR(24) REG(09),     /* VPSS ACB (SUGGESTED POINTER)  */
*     APCQPTR PTR(24) REG(09),      /* COMMAND QUEUE ELEMENT    01S0189
*                                      (SUGGESTED POINTER)           */
*     APOTPTR PTR(24) REG(09),      /* OPTION TABLE (SUGGESTED  01S0189
*                                      POINTER)                      */
*     APIOPTR PTR(24) REG(10),      /* I/O ELEMENT (SUGGESTED   01S0189
*                                      POINTER)                      */
*     APEXLPTR PTR(24) REG(10),     /* VPSS EXLST (SUGGESTED POINTER)*/
*     APUBPTR PTR(24) REG(10),      /* UNIT BLOCK (SUGGESTED POINTER)*/
*     APAXPTR PTR(24) REG(10),      /* VPSS ACB EXTENSION (SUGGESTED
*                                      POINTER)                      */
*     APCPPTR PTR(24) REG(10),      /* VPSS CALL PROCESSING     01S0189
*                                      INDICATORS (SUGGESTED POINTER)*/
*     APOCPTR PTR(24) REG(10),      /* VPSS OPEN/CLOSE SUBSYSTEM
*                                      WORKAREA (REQUIRED POINTER)   */
*     APATPTR PTR(24) REG(11),      /* VPSS ACB TABLE (SUGGESTED
*                                      POINTER)                      */
*     APLBPTR PTR(24) REG(11),      /* LABEL RESOLUTION TABLE   01S0189
*                                      (SUGGESTED POINTER)           */
*     APUTPTR PTR(24) REG(11),      /* USER TABLE (SUGGESTED POINTER)*/
*     APDSPTR PTR(24) REG(11),      /* VPSS DATASET ENTRY (SUGGESTED
*                                      POINTER)                      */
*     APXLPTR PTR(24) REG(11),      /* TRANSLATION TABLE (SUGGESTED
*                                      POINTER)                      */
*     APDXPTR PTR(24) REG(11),      /* VPSS DEB EXTENSION (SUGGESTED
*                                      POINTER)                      */
*     APCTPTR PTR(24) REG(12) RSTD, /* CONTROL TABLE (REQUIRED  01S0189
*                                      POINTER)                      */
*     APSVPTR PTR(24) REG(13) RSTD, /* OS/VPSS SAVEAREA/WORKAREA
*                                      (REQUIRED POINTER)            */
*     APRETURN PTR(24) REG(14),     /* RETURN ADDRESS FOR SUBROUTINE
*                                      LINKAGE                       */
*     APENTRY PTR(24) REG(15),      /* SUBROUTINE ENTRY POINT LINKAGE*/
*     APRCODE PTR(24) REG(15);      /* CONTAINS SUBROUTINE RETURN
*                                      CODE                          */
*                                                               01S0190
*   /*****************************************************************/
*   /*                                                               */
*   /* USER REGISTER DECLARES                                        */
*   /*                                                               */
*   /*****************************************************************/
*                                                               01S0190
*   END IGTMBM                                                  01S0190
*                                                               01S0190
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */
*/*%INCLUDE SYSLIB  (IGTXSYSI)                                       */
*/*%INCLUDE SYSLIB  (IGTXSYSI)                                       */
*/*%INCLUDE SYSLIB  (IGTXSYSI)                                       */
*/*%INCLUDE SYSLIB  (IGTXSYSI)                                       */
*/*%INCLUDE SYSLIB  (IGTXSYSI)                                       */
*/*%INCLUDE SYSLIB  (IGTXSYSI)                                       */
*/*%INCLUDE SYSLIB  (IGTXSYSI)                                       */
*/*%INCLUDE SYSLIB  (IGTXSYSI)                                       */
*/*%INCLUDE SYSLIB  (IGTXSYSI)                                       */
*/*%INCLUDE SYSLIB  (IGTXSYSI)                                       */
*/*%INCLUDE SYSLIB  (IGTXSYSI)                                       */
*/*%INCLUDE SYSLIB  (IGTXSYSI)                                       */
*/*%INCLUDE SYSLIB  (IGTXSYSI)                                       */
*/*%INCLUDE SYSLIB  (IGTXSYSI)                                       */
*/*%INCLUDE SYSLIB  (IGTXSYSI)                                       */
*/*%INCLUDE SYSLIB  (IGTXSYSI)                                       */
*/*%INCLUDE SYSLIB  (IFGACB  )                                       */
*/*%INCLUDE SYSLIB  (IFGEXLST)                                       */
*/*%INCLUDE SYSLIB  (IGTXAPRL)                                       */
*/*%INCLUDE SYSLIB  (IGTXAPAX)                                       */
*/*%INCLUDE SYSLIB  (IGTXAPCI)                                       */
*/*%INCLUDE SYSLIB  (IGTXAPCP)                                       */
*/*%INCLUDE SYSLIB  (IGTXAPCT)                                       */
*/*%INCLUDE SYSLIB  (IGTXAPCV)                                       */
*/*%INCLUDE SYSLIB  (IGTXAPCW)                                       */
*/*%INCLUDE SYSLIB  (IGTXAPCX)                                       */
*/*%INCLUDE SYSLIB  (IGTXAPDX)                                       */
*/*%INCLUDE SYSLIB  (IGTXAPEM)                                       */
*/*%INCLUDE SYSLIB  (IGTXAPIN)                                       */
*/*%INCLUDE SYSLIB  (IGTXAPIO)                                       */
*/*%INCLUDE SYSLIB  (IGTXAPSN)                                       */
*/*%INCLUDE SYSLIB  (IGTXAPSV)                                       */
*/*%INCLUDE SYSLIB  (IGTXAPUT)                                       */
*/*%INCLUDE SYSUT5  (LEXIT   )                                       */
*/*%INCLUDE SYSUT5  (BPARMS  )                                       */
*                                                               01S0190
*       ;                                                       01S0190
         B     @EL00001                                         01S0190
@DATA    DS    0H
@DATD    DSECT
         DS    0F
@SA00001 DS    20F
@SA00002 DS    15F
IGTMBM   CSECT
         DS    0F
@CF00056 DC    F'1'
@CF00043 DC    F'15'
@CF01213 DC    F'20'
@CF01724 DC    F'256'
@CF01803 DC    XL4'0000FFFF'
@DATD    DSECT
         DS    0D
         DS    CL2
DRET     DS    CL74
         ORG   DRET
DRETCODE DS    CL10
         ORG   DRETCODE
DRETL14  DS    CL4
DRETBALR DS    CL2
DRETADDR DS    AL4
         ORG   DRET+10
DRETSAVE DS    CL64
         ORG   DRET+74
DAPSV    DS    CL72
DEXLST   DS    CL5
         DS    CL7
XWRKAREA DS    CL1024
DPARMS   DS    CL60
         ORG   DPARMS
DAPIN    DS    AL4
DAPEM    DS    AL4
DR15C    DS    AL4
DRCDE    DS    AL4
DAPFN    DS    AL4
DAPUT    DS    AL4
DWKAREA  DS    AL4
DACB     DS    AL4
DAPRL    DS    AL4
DCSW     DS    AL4
DCCW     DS    AL4
DAPCI    DS    AL4
DLAPCI   DS    AL4
DSNSE    DS    AL4
DXREGS   DS    AL4
         ORG   DXREGS
DPARMLST DS    BL1
         ORG   DPARMLST
DPARMFLG DS    BL1
@NM00199 EQU   DPARMLST+0
         ORG   DXREGS+1
@NM00200 DS    AL3
         ORG   DPARMS+60
IGTMBM   CSECT
         DS    0F
@SIZDATD DC    AL1(0)
         DC    AL3(@ENDDATD-@DATD)
         DS    0D
CLRLOG   DC    X'00FFFFFF'
CPARMS   DS    CL60
         ORG   CPARMS
CPARMSX  DC    15AL4(DUMMY)
         ORG   CPARMS+60
DUMMY    DC    CL8'NULL    '
IGTMBM   CSECT
*                                   /* & TO OBTAINED SAVED REGS ADDR.*/
         CNOP  2,4                  HALFWORD, NON-FULLWORD BOUNDARY
RETCODE  L     R14P,6(,R14P)        LOAD ADDR(EXITRTNR)
         BALR  R14P,R14P            GOTO EXITRTNR.
         DC    A(EXITRTNR)          REG_14+4 -> SAVED REGS
IGTMBM   CSECT
*                                   /* GENERATE PATCH
         IGTXZAP ,                 GENERATE PATCH AREA
@DATD    DSECT
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA
@ENDDATD EQU   *
IGTMBM   CSECT
@00      EQU   00                      EQUATES FOR REGISTERS 0-15
@01      EQU   01
@02      EQU   02
@03      EQU   03
@04      EQU   04
@05      EQU   05
@06      EQU   06
@07      EQU   07
@08      EQU   08
@09      EQU   09
@10      EQU   10
@11      EQU   11
@12      EQU   12
@13      EQU   13
@14      EQU   14
@15      EQU   15
DUSEREXT EQU   @02
APCODE   EQU   @07
APDATA   EQU   @06
APCTPTR  EQU   @12
APSVPTR  EQU   @13
R14P     EQU   @14
APCWPTR  EQU   @08
APEXLPTR EQU   @10
R0P      EQU   @00
R1P      EQU   @01
R15P     EQU   @15
APACBPTR EQU   @09
APATPTR  EQU   @11
APAXPTR  EQU   @10
APCIPTR  EQU   @08
APCPPTR  EQU   @10
APCQPTR  EQU   @09
APDEBPTR EQU   @08
APDSPTR  EQU   @11
APDXPTR  EQU   @11
APENTRY  EQU   @15
APERPTR  EQU   @08
APINPTR  EQU   @01
APIOPTR  EQU   @10
APLBPTR  EQU   @11
APNPPTR  EQU   @08
APOCPTR  EQU   @10
APOTPTR  EQU   @09
APRCODE  EQU   @15
APRETURN EQU   @14
APRLPTR  EQU   @08
APSCPTR  EQU   @01
APSMPTR  EQU   @01
APUBPTR  EQU   @10
APUTPTR  EQU   @11
APXLPTR  EQU   @11
R0F      EQU   @00
R0RSTD   EQU   @00
R1F      EQU   @01
R1RSTD   EQU   @01
R10F     EQU   @10
R10P     EQU   @10
R10RSTD  EQU   @10
R11F     EQU   @11
R11P     EQU   @11
R11RSTD  EQU   @11
R12F     EQU   @12
R12P     EQU   @12
R12RSTD  EQU   @12
R13F     EQU   @13
R13P     EQU   @13
R13RSTD  EQU   @13
R14F     EQU   @14
R14RSTD  EQU   @14
R15F     EQU   @15
R15RSTD  EQU   @15
R2F      EQU   @02
R2P      EQU   @02
R2RSTD   EQU   @02
R3F      EQU   @03
R3P      EQU   @03
R3RSTD   EQU   @03
R4F      EQU   @04
R4P      EQU   @04
R4RSTD   EQU   @04
R5F      EQU   @05
R5P      EQU   @05
R5RSTD   EQU   @05
R6F      EQU   @06
R6P      EQU   @06
R6RSTD   EQU   @06
R7F      EQU   @07
R7P      EQU   @07
R7RSTD   EQU   @07
R8F      EQU   @08
R8P      EQU   @08
R8RSTD   EQU   @08
R9F      EQU   @09
R9P      EQU   @09
R9RSTD   EQU   @09
IFGACB   EQU   0
ACBCOMN  EQU   IFGACB
ACBLENG  EQU   ACBCOMN+2
ACBLENG2 EQU   ACBLENG
ACBAMBL  EQU   ACBCOMN+4
ACBJWA   EQU   ACBAMBL
ACBIBCT  EQU   ACBJWA
ACBAMWAP EQU   ACBIBCT
ACBMACRF EQU   ACBCOMN+12
ACBMACR1 EQU   ACBMACRF
ACBADR   EQU   ACBMACR1
ACBCNV   EQU   ACBMACR1
ACBMACR2 EQU   ACBMACRF+1
ACBBUFPL EQU   ACBCOMN+20
ACBMACR3 EQU   ACBBUFPL
ACBRECFM EQU   ACBCOMN+24
ACBCCTYP EQU   ACBCOMN+25
ACBOPT   EQU   ACBCOMN+26
ACBDSORG EQU   ACBOPT
ACBCROPS EQU   ACBDSORG
ACBEXLST EQU   ACBCOMN+36
ACBDDNM  EQU   ACBCOMN+40
ACBAMETH EQU   ACBDDNM+3
ACBOFLGS EQU   ACBCOMN+48
ACBEXFG  EQU   ACBOFLGS
ACBIOSFG EQU   ACBOFLGS
ACBINFLG EQU   ACBCOMN+50
ACBUJFCB EQU   ACBCOMN+52
ACBBLKSZ EQU   ACBCOMN+60
ACBAPID  EQU   ACBCOMN+72
ACBAMAX  EQU   ACBAPID
IFGEXLST EQU   0
EXLCOMN  EQU   IFGEXLST
EXLLEN   EQU   EXLCOMN+2
EXLEODF  EQU   EXLCOMN+5
EXLSYNF  EQU   EXLCOMN+10
EXLSYNA  EQU   EXLSYNF
EXLLERF  EQU   EXLCOMN+15
EXLLERA  EQU   EXLLERF
EXLSCIPF EQU   EXLCOMN+20
EXLLGNF  EQU   EXLCOMN+25
EXLJRNF  EQU   EXLCOMN+30
EXLOPNF  EQU   EXLCOMN+35
IFGEXLEF EQU   0
EXLENTRY EQU   IFGEXLEF
EXLFLAG  EQU   EXLENTRY
EXLENFL  EQU   EXLFLAG
EXLSPEC  EQU   EXLENFL
EXLACTM  EQU   EXLENFL
EXLLNK   EQU   EXLENFL
EXLEXITP EQU   EXLENTRY+1
APRL     EQU   0
APRLECB  EQU   APRL+8
APRLECBC EQU   APRLECB
APRLFDBK EQU   APRL+12
APRLOPTS EQU   APRL+40
APRLOPT0 EQU   APRLOPTS
APRLOPT1 EQU   APRLOPTS+1
APRLOPT2 EQU   APRLOPTS+2
APRLOPT3 EQU   APRLOPTS+3
APRLOPTZ EQU   APRL+56
APRLOPT4 EQU   APRLOPTZ
APRLOPT5 EQU   APRLOPTZ+1
APRLOPT6 EQU   APRLOPTZ+2
APRLOPT7 EQU   APRLOPTZ+3
APRLEXTS EQU   APRL+68
APRLEXTA EQU   APRLEXTS
APAX     EQU   0
APAXFLGS EQU   APAX+45
APAXFLG0 EQU   APAXFLGS
APAXFLG1 EQU   APAXFLGS+1
APAXFLG2 EQU   APAXFLGS+2
APCI     EQU   0
APCIHDR  EQU   APCI
APCIHFGS EQU   APCIHDR+2
APCIHFG0 EQU   APCIHFGS
APCIHFG1 EQU   APCIHFGS+1
APCP     EQU   0
APCT     EQU   0
APCTENQM EQU   APCT+12
APCTSMIN EQU   APCT+32
APCTSMAD EQU   APCT+36
APCTZ@@@ EQU   APCT+40
APCTU@@@ EQU   APCT+440
APCTBR14 EQU   APCT+840
APCTERRS EQU   APCT+876
@NM00110 EQU   APCT+936
APCTSTAT EQU   @NM00110
APCTPRSW EQU   @NM00110+1
APCTAPCQ EQU   APCT+944
APCTCQAQ EQU   APCT+952
APCTZ@@1 EQU   APCT+1120
APCW     EQU   0
APCWAPIN EQU   APCW+8
APCWAPUT EQU   APCW+12
APCWAPSV EQU   APCW+16
APCWACB  EQU   APCW+20
APCWAPRL EQU   APCW+24
APCWAPIO EQU   APCW+28
APCWAPCP EQU   APCW+32
APCWSWS  EQU   APCW+46
APCWSW0  EQU   APCWSWS
APCWAPFN EQU   APCW+56
APCWOPF  EQU   APCW+62
APCWR15C EQU   APCW+64
APCWRCDE EQU   APCW+68
APCWINTV EQU   APCW+72
APCWINT0 EQU   APCWINTV
APCWINT1 EQU   APCWINTV+1
APCWINT2 EQU   APCWINTV+2
APCWINT3 EQU   APCWINTV+3
APCWAPEM EQU   APCW+112
APCWEMSG EQU   APCWAPEM
APCX     EQU   0
APCXUSRI EQU   APCX+8
APCXFLGS EQU   APCXUSRI+4
APCXFLG0 EQU   APCXFLGS
APCXINTV EQU   APCXUSRI+24
APDX     EQU   0
APDX252A EQU   APDX+28
APDXDXL  EQU   APDX+32
APDXSWS  EQU   APDX+130
APDXSW0  EQU   APDXSWS
APDXSW1  EQU   APDXSWS+1
APEM     EQU   0
APEMMSG  EQU   APEM+92
APEMVALU EQU   APEM+108
APIN     EQU   0
APINAUNT EQU   APIN
APINAFNC EQU   APIN+4
APINFMTS EQU   APIN+8
APIO     EQU   0
APIOIOCB EQU   APIO
APIOVCSW EQU   APIO+208
APIOCCW  EQU   APIO+220
APIOAPCI EQU   APIO+224
APIOFLGS EQU   APIO+248
APIOFLGA EQU   APIOFLGS
APIOFLG0 EQU   APIOFLGA
APIOFLG2 EQU   APIOFLGA+2
APIOVSNS EQU   APIOFLG2
APIOVINX EQU   APIOFLG2
APIOFLG3 EQU   APIOFLGA+3
APIOFLGB EQU   APIOFLGS+4
APIOFLG7 EQU   APIOFLGB+3
APIOSNSE EQU   APIO+256
APIOINDX EQU   APIO+288
APIOSAVE EQU   APIOINDX
APIOTR   EQU   APIO+360
APIOGMSZ EQU   APIO+376
APIONBR  EQU   APIO+384
APSN     EQU   0
APSNSTND EQU   APSN
APSNRQST EQU   APSN+1
APSNCMPN EQU   APSN+2
APSNCIOP EQU   APSN+4
APSNCIDS EQU   APSN+6
APSNFMTD EQU   APSN+8
APSV     EQU   0
APSVNEXT EQU   APSV+8
APSVREGS EQU   APSV+12
APSVRG2  EQU   APSVREGS+16
APUT     EQU   0
APUTFLGS EQU   APUT+24
APUTFLG0 EQU   APUTFLGS
APCVZDAL EQU   0
APCVZDAP EQU   0
APCVZDBK EQU   0
APCVZDDA EQU   0
APCVZDDQ EQU   0
APCVZDEQ EQU   0
APCVZDID EQU   0
APCVZDIO EQU   0
APCVZDIP EQU   0
APCVZDMD EQU   0
APCVZDMM EQU   0
APCVZDQR EQU   0
APCVZDRI EQU   0
APCVZDUA EQU   0
APCVZDUL EQU   0
APCVZDWI EQU   0
APCVZDWT EQU   0
APCVZDX1 EQU   0
APCVZDX2 EQU   0
APCVZDX3 EQU   0
APCVZDX4 EQU   0
APCVZD10 EQU   0
APCVZD20 EQU   0
APCVZD4E EQU   0
APCVZD40 EQU   0
APCVZD41 EQU   0
APCVZD42 EQU   0
APCVZD43 EQU   0
APCVZD44 EQU   0
APCVZD45 EQU   0
APCVZD46 EQU   0
APCVZD47 EQU   0
APCVZD48 EQU   0
APCVZD49 EQU   0
APCVZD60 EQU   0
APCVZD80 EQU   0
APCVZD81 EQU   0
APCVZD82 EQU   0
APCVZD83 EQU   0
APCVZJAA EQU   0
APCVZJAD EQU   0
APCVZJAG EQU   0
APCVZJAJ EQU   0
APCVZJAM EQU   0
APCVZJAP EQU   0
APCVZJAX EQU   0
APCVZJAY EQU   0
APCVZJBA EQU   0
APCVZJBD EQU   0
APCVZJBG EQU   0
APCVZJBJ EQU   0
APCVZJBM EQU   0
APCVZJDA EQU   0
APCVZJDD EQU   0
APCVZJDG EQU   0
APCVZJDJ EQU   0
APCVZJDM EQU   0
APCVZJHC EQU   0
APCVZJHE EQU   0
APCVZJHF EQU   0
APCVZJHO EQU   0
APCVZJHQ EQU   0
APCVZJHR EQU   0
APCVZJHT EQU   0
APCVZJHW EQU   0
APCVZJH0 EQU   0
APCVZJH6 EQU   0
APCVZJI0 EQU   0
APCVZJI3 EQU   0
APCVZJJ0 EQU   0
APCVZKAA EQU   0
APCVZKBA EQU   0
APCVZKBB EQU   0
APCVZKBC EQU   0
APCVZKBD EQU   0
APCVZKBE EQU   0
APCVZKBF EQU   0
APCVZKCA EQU   0
APCVZKDA EQU   0
APCVZKGA EQU   0
APCVZKGB EQU   0
APCVZKGC EQU   0
APCVZKGD EQU   0
APCVZLCA EQU   0
APCVZLCB EQU   0
APCVZMBA EQU   0
APCVZMBD EQU   0
APCVZMBG EQU   0
APCVZMBH EQU   0
APCVZMBK EQU   0
APCVZMBM EQU   0
APCVZMIB EQU   0
APCVZMIC EQU   0
APCVZMIF EQU   0
APCVZMJB EQU   0
APCVZMJC EQU   0
APCVZMJH EQU   0
APCVZMJI EQU   0
APCVZMMA EQU   0
APCVZUAA EQU   0
APCVZUAB EQU   0
APCVZUAC EQU   0
APCVZUAD EQU   0
APCVZUAE EQU   0
APCVZUAF EQU   0
APCVZUAG EQU   0
APCVZUBB EQU   0
APCVZUFA EQU   0
APCVZUHA EQU   0
APCVZUHB EQU   0
APCVZUJA EQU   0
APCVZUKA EQU   0
APCV1CMD EQU   0
APCV1JAA EQU   0
APCV1JBJ EQU   0
APCV1JHC EQU   0
APCV1JHL EQU   0
APCV1JHT EQU   0
APCV1MAB EQU   0
APCV1MBD EQU   0
APCV2JHC EQU   0
APCV2JHL EQU   0
APCV2MBD EQU   0
APINACI  EQU   0
APINACW  EQU   0
APINAPRL EQU   0
APINBIV  EQU   0
APINBLB  EQU   0
APINCHB  EQU   0
APINCHC  EQU   0
APINCHS  EQU   0
APINCHX  EQU   0
APINCXC  EQU   0
APINCXS  EQU   0
APINCXX  EQU   0
APINDLB  EQU   0
APINDSV  EQU   0
APINERR  EQU   0
APINFUNC EQU   0
APINICI  EQU   0
APINICW  EQU   0
APINKYVF EQU   0
APINKYVL EQU   0
APINKYVP EQU   0
APINKYWD EQU   0
APINPXB  EQU   0
APINPXC  EQU   0
APINPXF  EQU   0
APINPXP  EQU   0
APINSTB  EQU   0
APINSTD  EQU   0
APINUNIT EQU   0
APINUST  EQU   0
APINXBS  EQU   0
APINXBX  EQU   0
APINXCD  EQU   0
APINXCT  EQU   0
APINXID  EQU   0
APINXI1  EQU   0
APINXI2  EQU   0
APINXLB  EQU   0
APINXST  EQU   0
APINYST  EQU   0
I001C    EQU   0
I008P    EQU   0
I015F    EQU   0
I015P    EQU   0
I031F    EQU   0
I031P    EQU   0
I256C    EQU   0
@NM00047 EQU   APCI
APCIOPID EQU   @NM00047
APCIODTA EQU   @NM00047+4
APCIXDTA EQU   APCIODTA
APCIXIMM EQU   APCIXDTA+4
APCIXCC  EQU   APCIXDTA+8
APCIIDTA EQU   APCIODTA
APCIISZ  EQU   APCIIDTA+2
APCIADTA EQU   APCIODTA
APCIASO  EQU   APCIADTA
APCIASO0 EQU   APCIASO
APCIASO1 EQU   APCIASO+1
APCIAVCT EQU   APCIADTA+4
APCIAFS  EQU   APCIAVCT+8
APCIAF0  EQU   APCIAFS
APCIAF1  EQU   APCIAFS+1
@NM00054 EQU   APCIAVCT
APCIAV1  EQU   @NM00054
APCIAFS1 EQU   APCIAV1+8
APCIAF01 EQU   APCIAFS1
APCIAF11 EQU   APCIAFS1+1
APCIAV2  EQU   @NM00054+16
APCIAFS2 EQU   APCIAV2+8
APCIAF02 EQU   APCIAFS2
APCIAF12 EQU   APCIAFS2+1
APCIAV3  EQU   @NM00054+32
APCIAFS3 EQU   APCIAV3+8
APCIAF03 EQU   APCIAFS3
APCIAF13 EQU   APCIAFS3+1
APCIZDTA EQU   APCIODTA
APCIZV1  EQU   APCIZDTA+4
APCIZFS1 EQU   APCIZV1+8
APCIZF01 EQU   APCIZFS1
APCIZF11 EQU   APCIZFS1+1
APCIZV2  EQU   APCIZDTA+20
APCIZFS2 EQU   APCIZV2+8
APCIZF02 EQU   APCIZFS2
APCIZF12 EQU   APCIZFS2+1
@NM00071 EQU   APCP
APCPOPF  EQU   @NM00071+6
APCPSWS  EQU   @NM00071+32
APCPSACB EQU   APCPSWS
APCPSBLD EQU   APCPSWS+1
APCPSOP  EQU   APCPSWS+2
APCPSAR  EQU   APCPSWS+3
APCPSIO  EQU   APCPSWS+4
APCPSWX  EQU   APCPSWS+9
APCPSFN  EQU   APCPSWS+10
APCPSRCL EQU   APCPSWS+11
APCPSEML EQU   APCPSWS+12
APCTZ    EQU   APCTZ@@@
APCTZUAA EQU   APCTZ
APCTZUAB EQU   APCTZ+4
APCTZUAC EQU   APCTZ+8
APCTZUAD EQU   APCTZ+12
APCTZUAE EQU   APCTZ+16
APCTZUBB EQU   APCTZ+24
APCTZD10 EQU   APCTZ+28
APCTZD20 EQU   APCTZ+32
APCTZD40 EQU   APCTZ+36
APCTZD41 EQU   APCTZ+40
APCTZD42 EQU   APCTZ+44
APCTZD43 EQU   APCTZ+48
APCTZD44 EQU   APCTZ+52
APCTZD45 EQU   APCTZ+56
APCTZD46 EQU   APCTZ+60
APCTZD47 EQU   APCTZ+64
APCTZD48 EQU   APCTZ+68
APCTZD49 EQU   APCTZ+72
APCTZD60 EQU   APCTZ+76
APCTZD80 EQU   APCTZ+80
APCTZD4E EQU   APCTZ+84
APCTZMBA EQU   APCTZ+88
APCTZMBD EQU   APCTZ+92
APCTZMBG EQU   APCTZ+96
APCTZDX1 EQU   APCTZ+104
APCTZDX2 EQU   APCTZ+108
APCTZDX3 EQU   APCTZ+112
APCTZDX4 EQU   APCTZ+116
APCTZMBH EQU   APCTZ+120
APCTZMBK EQU   APCTZ+124
APCTZMBM EQU   APCTZ+128
APCTZMJB EQU   APCTZ+132
APCTZMJC EQU   APCTZ+136
APCTZMJH EQU   APCTZ+140
APCTZMMA EQU   APCTZ+144
APCTZDMD EQU   APCTZ+148
APCTZD81 EQU   APCTZ+152
APCTZDID EQU   APCTZ+156
APCTZDRI EQU   APCTZ+160
APCTZMJI EQU   APCTZ+164
APCTZDWT EQU   APCTZ+168
APCTZDMM EQU   APCTZ+172
APCTZDAL EQU   APCTZ+176
APCTZDBK EQU   APCTZ+180
APCTZDIP EQU   APCTZ+184
APCTZDDA EQU   APCTZ+188
APCTZDUL EQU   APCTZ+192
APCTZDEQ EQU   APCTZ+196
APCTZDDQ EQU   APCTZ+200
APCTZDUA EQU   APCTZ+204
APCTZUAF EQU   APCTZ+208
APCTZUAG EQU   APCTZ+212
APCTZDIO EQU   APCTZ+216
APCTZUHA EQU   APCTZ+220
APCTZUHB EQU   APCTZ+224
APCTZJAA EQU   APCTZ+232
APCTZJAD EQU   APCTZ+236
APCTZJAG EQU   APCTZ+240
APCTZJAJ EQU   APCTZ+244
APCTZJAM EQU   APCTZ+248
APCTZJAP EQU   APCTZ+252
APCTZJAY EQU   APCTZ+256
APCTZUFA EQU   APCTZ+260
APCTZUJA EQU   APCTZ+264
APCTZDAP EQU   APCTZ+268
APCTZKAA EQU   APCTZ+272
APCTZD82 EQU   APCTZ+276
APCTZMIB EQU   APCTZ+280
APCTZMIC EQU   APCTZ+284
APCTZD83 EQU   APCTZ+288
APCTZMIF EQU   APCTZ+296
APCTZJH0 EQU   APCTZ+300
APCTZJI0 EQU   APCTZ+304
APCTZJI3 EQU   APCTZ+308
APCTZJJ0 EQU   APCTZ+312
APCTZJBA EQU   APCTZ+316
APCTZJBD EQU   APCTZ+320
APCTZJBG EQU   APCTZ+324
APCTZJBJ EQU   APCTZ+328
APCTZJBM EQU   APCTZ+332
APCTZKCA EQU   APCTZ+340
APCTZKDA EQU   APCTZ+344
APCTZJDA EQU   APCTZ+356
APCTZJDJ EQU   APCTZ+360
APCTZJH6 EQU   APCTZ+364
APCTZJHO EQU   APCTZ+368
APCTZJHF EQU   APCTZ+372
APCTZJHE EQU   APCTZ+376
APCTZDQR EQU   APCTZ+380
APCTZJHR EQU   APCTZ+384
APCTZJHT EQU   APCTZ+388
APCTZJHW EQU   APCTZ+392
APCTZ1   EQU   APCTZ@@1
APCTZKBA EQU   APCTZ1
APCTZKBC EQU   APCTZ1+4
APCTZKBB EQU   APCTZ1+8
APCTZJHC EQU   APCTZ1+20
APCTZJHQ EQU   APCTZ1+24
APCTZKBD EQU   APCTZ1+28
APCTZKBE EQU   APCTZ1+40
APCTZUKA EQU   APCTZ1+56
APCTZKBF EQU   APCTZ1+60
APCTZJDD EQU   APCTZ1+64
APCTZJDG EQU   APCTZ1+68
APCTZJDM EQU   APCTZ1+72
APCTZLCA EQU   APCTZ1+76
APCTZLCB EQU   APCTZ1+80
APCTZDWI EQU   APCTZ1+84
APCTZJAX EQU   APCTZ1+88
APCTZKGA EQU   APCTZ1+92
APCTZKGB EQU   APCTZ1+96
APCTZKGC EQU   APCTZ1+100
APCTZKGD EQU   APCTZ1+104
APCTU    EQU   APCTU@@@
APCT1MAB EQU   APCTU
APCT1MBD EQU   APCTU+4
APCT2MBD EQU   APCTU+8
APCT1CMD EQU   APCTU+12
APCT1MBM EQU   APCTU+16
APCT1JAA EQU   APCTU+20
APCT1JHC EQU   APCTU+24
APCT2JHC EQU   APCTU+28
APCT1JHT EQU   APCTU+32
APCT1JHL EQU   APCTU+36
APCT2JHL EQU   APCTU+40
APCT1JBJ EQU   APCTU+44
APINFMT1 EQU   APINFMTS
APINAERR EQU   APINFMT1
@NM00168 EQU   APINFMT1+4
APINAKYW EQU   @NM00168
APINAKYV EQU   @NM00168+4
APINFMT2 EQU   APINFMTS
APINAAR  EQU   APINFMT2
APINFMT3 EQU   APINFMTS
APINASTB EQU   APINFMT3
APINAACW EQU   APINFMT3+4
APINAICW EQU   APINFMT3+8
APINAACI EQU   APINFMT3+12
APINAICI EQU   APINFMT3+16
APINFMT4 EQU   APINFMTS
APINAXI1 EQU   APINFMT4
APINAXI2 EQU   APINFMT4+4
APINAXLB EQU   APINFMT4+8
APINAXCD EQU   APINFMT4+12
APINFMT5 EQU   APINFMTS
APINADLB EQU   APINFMT5
APINFMT6 EQU   APINFMTS
APINABIV EQU   APINFMT6
APINABLB EQU   APINFMT6+4
APINFMT7 EQU   APINFMTS
APINACHS EQU   APINFMT7
APINACHC EQU   APINFMT7+4
APINACHB EQU   APINFMT7+8
APINACHX EQU   APINFMT7+12
APINFMT8 EQU   APINFMTS
APINACXS EQU   APINFMT8
APINACXC EQU   APINFMT8+4
APINACXX EQU   APINFMT8+8
APINFMT9 EQU   APINFMTS
APINASTD EQU   APINFMT9
APINADSV EQU   APINFMT9+4
APINAYST EQU   APINFMT9+8
APINAXST EQU   APINFMT9+12
APINAUST EQU   APINFMT9+16
APINFM10 EQU   APINFMTS
APINAXBS EQU   APINFM10
APINAXCT EQU   APINFM10+4
APINAXBX EQU   APINFM10+8
APINAXID EQU   APINFM10+12
APINAPMS EQU   APIN
APINAP1  EQU   APINAPMS
APINAP2  EQU   APINAPMS+4
APINAP3  EQU   APINAPMS+8
APINAP4  EQU   APINAPMS+12
@NM00180 EQU   APIOIOCB
@NM00181 EQU   APIOIOCB
APSNFMT0 EQU   APSNFMTD
APSNPRTY EQU   APSNFMT0
APSNADCK EQU   APSNFMT0+1
APSNCPST EQU   APSNFMT0+2
APSNAEST EQU   APSNFMT0+3
APSNXCPS EQU   APSNFMT0+4
APSNXCP0 EQU   APSNXCPS
APSNXCP1 EQU   APSNXCPS+1
APSNFMT1 EQU   APSNFMTD
APSNPMES EQU   APSNFMT1+2
APSNFMT2 EQU   APSNFMTD
APSNDDST EQU   APSNFMT2
APSNDDS0 EQU   APSNDDST
APSNDDS1 EQU   APSNDDST+1
APSNAECK EQU   APSNFMT2+2
APSNAEC0 EQU   APSNAECK
APSNAEC1 EQU   APSNAECK+1
APSNFMT4 EQU   APSNFMTD
APSN4IOS EQU   APSNFMT4+1
APSN4IO0 EQU   APSN4IOS
APSN4IO1 EQU   APSN4IOS+1
APSN4IO2 EQU   APSN4IOS+2
APSN4CPC EQU   APSNFMT4+4
APSN4CMC EQU   APSNFMT4+6
APSN4CM0 EQU   APSN4CMC
APSN4CM1 EQU   APSN4CMC+1
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS
APSN4CIC EQU   APSNFMT4+14
@NM00193 EQU   APSNFMT4+12
APSN4CAR EQU   APSNFMT4+10
APSN4CDA EQU   APSNFMT4+8
@NM00192 EQU   APSN4CM1
APSN4EBT EQU   APSN4CM1
APSN4IAD EQU   APSN4CM1
APSN4IAI EQU   APSN4CM1
@NM00191 EQU   APSN4CM1
APSN4SPD EQU   APSN4CM1
APSN4SPI EQU   APSN4CM1
APSN4CSP EQU   APSN4CM0
APSN4BPW EQU   APSN4CM0
APSN4BPR EQU   APSN4CM0
@NM00190 EQU   APSN4CM0
APSN4CMS EQU   APSNFMT4+5
@NM00189 EQU   APSN4CPC
APSN4IVI EQU   APSN4CPC
APSN4IVA EQU   APSN4CPC
APSN4DVZ EQU   APSN4CPC
APSN4EQC EQU   APSN4CPC
APSN4IMB EQU   APSN4CPC
@NM00188 EQU   APSN4CPC
APSN4ONL EQU   APSN4IO2
APSN4STN EQU   APSN4IO2
APSN4ACK EQU   APSN4IO2
APSN4DCK EQU   APSN4IO2
APSN4STP EQU   APSN4IO2
APSN4SO  EQU   APSN4IO2
APSN4BOP EQU   APSN4IO2
APSN4CR  EQU   APSN4IO2
APSN4IDC EQU   APSN4IO1
APSN4SR  EQU   APSN4IO1
APSN4DI  EQU   APSN4IO1
APSN4CSY EQU   APSN4IO1
APSN4CPR EQU   APSN4IO1
APSN4SNS EQU   APSN4IO1
APSN4WRT EQU   APSN4IO1
APSN4RD  EQU   APSN4IO1
APSN4BSY EQU   APSN4IO0
APSN4SM  EQU   APSN4IO0
APSN4UC  EQU   APSN4IO0
APSN4CE  EQU   APSN4IO0
APSN4IDS EQU   APSN4IO0
@NM00187 EQU   APSN4IO0
APSN4SID EQU   APSNFMT4
APSNBRCT EQU   APSNFMT2+4
APSNAC15 EQU   APSNAEC1
APSNAC14 EQU   APSNAEC1
APSNAC13 EQU   APSNAEC1
APSNAC12 EQU   APSNAEC1
APSNAC11 EQU   APSNAEC1
APSNAC10 EQU   APSNAEC1
APSNAC09 EQU   APSNAEC1
APSNAC08 EQU   APSNAEC1
APSNAC07 EQU   APSNAEC0
APSNAC06 EQU   APSNAEC0
APSNAC05 EQU   APSNAEC0
APSNAC04 EQU   APSNAEC0
APSNAC03 EQU   APSNAEC0
@NM00186 EQU   APSNAEC0
APSNASTP EQU   APSNDDS1
APSNCNVT EQU   APSNDDS1
APSNBSLM EQU   APSNDDS1
APSNXDVZ EQU   APSNDDS1
APSNXOVF EQU   APSNDDS1
APSNXBR  EQU   APSNDDS0
APSNIBR  EQU   APSNDDS0
APSNICPM EQU   APSNDDS0
APSNICOP EQU   APSNDDS0
APSNCILM EQU   APSNDDS0
APSNCIOV EQU   APSNDDS0
APSNIOLN EQU   APSNDDS0
APSNIOLM EQU   APSNDDS0
APSNPMDT EQU   APSNPMES
APSNPMBS EQU   APSNPMES
APSNPMAE EQU   APSNPMES
APSNPMCP EQU   APSNPMES
APSNPMEC EQU   APSNFMT1+1
APSNPMXC EQU   APSNFMT1
APSNIOCW EQU   APSNFMT0+12
APSNCPAR EQU   APSNFMT0+10
APSNCPIC EQU   APSNFMT0+8
APSNPGNR EQU   APSNFMT0+6
@NM00185 EQU   APSNXCP1
APSNXIBS EQU   APSNXCP1
APSNXSIE EQU   APSNXCP1
APSNXIRA EQU   APSNXCP1
APSNXAFC EQU   APSNXCP0
APSNXAEI EQU   APSNXCP0
APSNXTCB EQU   APSNXCP0
APSNXDTI EQU   APSNXCP0
APSNXIOC EQU   APSNXCP0
APSNXIOI EQU   APSNXCP0
APSNXCDZ EQU   APSNXCP0
APSNXINS EQU   APSNXCP0
APSNWSC  EQU   APSNAEST
APSNAINS EQU   APSNAEST
APSNEDBO EQU   APSNCPST
APSNEDBR EQU   APSNCPST
APSNEDBT EQU   APSNCPST
APSNCINS EQU   APSNCPST
APSNACPP EQU   APSNADCK
APSNABS  EQU   APSNADCK
APSNPAWC EQU   APSNPRTY
APSNPAEW EQU   APSNPRTY
APSNPCPC EQU   APSNPRTY
APSNPCPP EQU   APSNPRTY
APSNPBS  EQU   APSNPRTY
APIOIOB  EQU   @NM00181+160
@NM00182 EQU   @NM00181
APIOSRB  EQU   @NM00180+128
APIOIOSB EQU   @NM00180
APINAP4P EQU   APINAP4+1
@NM00172 EQU   APINAP4
APINAP4E EQU   APINAP4
APINAP3P EQU   APINAP3+1
@NM00171 EQU   APINAP3
APINAP3E EQU   APINAP3
APINAP2P EQU   APINAP2+1
@NM00170 EQU   APINAP2
APINAP2E EQU   APINAP2
APINAP1P EQU   APINAP1+1
@NM00169 EQU   APINAP1
APINAP1E EQU   APINAP1
@NM00142 EQU   APCTU+48
@NM00141 EQU   APCTZ1+108
@NM00140 EQU   APCTZ1+52
@NM00139 EQU   APCTZ1+48
@NM00138 EQU   APCTZ1+44
@NM00137 EQU   APCTZ1+36
@NM00136 EQU   APCTZ1+32
@NM00135 EQU   APCTZ1+16
@NM00134 EQU   APCTZ1+12
@NM00133 EQU   APCTZ+396
@NM00132 EQU   APCTZ+352
@NM00131 EQU   APCTZ+348
@NM00130 EQU   APCTZ+336
@NM00129 EQU   APCTZ+292
APCTZJFA EQU   APCTZ+228
APCTZMBR EQU   APCTZ+100
@NM00128 EQU   APCTZ+20
@NM00097 EQU   @NM00071+96
APCPAPAL EQU   @NM00071+48
@NM00096 EQU   APCPSWS+13
@NM00095 EQU   APCPSEML
APCPSEMA EQU   APCPSEML
APCPSEMR EQU   APCPSEML
@NM00094 EQU   APCPSRCL
APCPSRCP EQU   APCPSRCL
APCPSRCA EQU   APCPSRCL
APCPSRCR EQU   APCPSRCL
@NM00093 EQU   APCPSFN
APCPSFFK EQU   APCPSFN
APCPSFNK EQU   APCPSFN
APCPSFNS EQU   APCPSFN
APCPSFNV EQU   APCPSFN
@NM00092 EQU   APCPSWX
APCPSUSV EQU   APCPSWX
@NM00091 EQU   APCPSWX
@NM00090 EQU   APCPSWS+5
@NM00089 EQU   APCPSIO
@NM00088 EQU   APCPSIO
@NM00087 EQU   APCPSIO
@NM00086 EQU   APCPSIO
APCPSIOR EQU   APCPSIO
@NM00085 EQU   APCPSAR
@NM00084 EQU   APCPSAR
@NM00083 EQU   APCPSAR
@NM00082 EQU   APCPSAR
APCPSARR EQU   APCPSAR
@NM00081 EQU   APCPSOP
APCPSOPW EQU   APCPSOP
APCPSOPN EQU   APCPSOP
@NM00080 EQU   APCPSOP
APCPSOPR EQU   APCPSOP
@NM00079 EQU   APCPSBLD
APCPSBLW EQU   APCPSBLD
@NM00078 EQU   APCPSBLD
@NM00077 EQU   APCPSBLD
APCPSBLR EQU   APCPSBLD
@NM00076 EQU   APCPSACB
APCPSACW EQU   APCPSACB
APCPSACN EQU   APCPSACB
@NM00075 EQU   APCPSACB
APCPSACR EQU   APCPSACB
@NM00074 EQU   @NM00071+24
@NM00073 EQU   @NM00071+20
APCPMINP EQU   @NM00071+18
APCPMAXP EQU   @NM00071+16
APCPUSRX EQU   @NM00071+12
APCPRTN  EQU   @NM00071+8
APCPAPOP EQU   APCPOPF
@NM00072 EQU   @NM00071+4
APCPAPFN EQU   @NM00071
APCIZXN2 EQU   APCIZV2+14
APCIZXD2 EQU   APCIZV2+12
APCIZXB2 EQU   APCIZV2+10
@NM00069 EQU   APCIZF12
@NM00068 EQU   APCIZF02
APCIZST2 EQU   APCIZF02
APCIZTC2 EQU   APCIZF02
@NM00067 EQU   APCIZF02
APCIZFN2 EQU   APCIZF02
APCIZFP2 EQU   APCIZF02
APCIZRS2 EQU   APCIZF02
APCIZNB2 EQU   APCIZV2+6
APCIZDL2 EQU   APCIZV2+4
APCIZBS2 EQU   APCIZV2
APCIZXN1 EQU   APCIZV1+14
APCIZXD1 EQU   APCIZV1+12
APCIZXB1 EQU   APCIZV1+10
@NM00066 EQU   APCIZF11
@NM00065 EQU   APCIZF01
APCIZST1 EQU   APCIZF01
APCIZTC1 EQU   APCIZF01
@NM00064 EQU   APCIZF01
APCIZFN1 EQU   APCIZF01
APCIZFP1 EQU   APCIZF01
APCIZRS1 EQU   APCIZF01
APCIZNB1 EQU   APCIZV1+6
APCIZDL1 EQU   APCIZV1+4
APCIZBS1 EQU   APCIZV1
APCIZX2  EQU   APCIZDTA+2
APCIZX1  EQU   APCIZDTA
APCIAXN3 EQU   APCIAV3+14
APCIAXD3 EQU   APCIAV3+12
APCIAXB3 EQU   APCIAV3+10
@NM00063 EQU   APCIAF13
@NM00062 EQU   APCIAF03
APCIAST3 EQU   APCIAF03
APCIATC3 EQU   APCIAF03
@NM00061 EQU   APCIAF03
APCIAFN3 EQU   APCIAF03
APCIAFP3 EQU   APCIAF03
APCIARS3 EQU   APCIAF03
APCIANB3 EQU   APCIAV3+6
APCIADL3 EQU   APCIAV3+4
APCIABS3 EQU   APCIAV3
APCIAXN2 EQU   APCIAV2+14
APCIAXD2 EQU   APCIAV2+12
APCIAXB2 EQU   APCIAV2+10
@NM00060 EQU   APCIAF12
@NM00059 EQU   APCIAF02
APCIAST2 EQU   APCIAF02
APCIATC2 EQU   APCIAF02
@NM00058 EQU   APCIAF02
APCIAFN2 EQU   APCIAF02
APCIAFP2 EQU   APCIAF02
APCIARS2 EQU   APCIAF02
APCIANB2 EQU   APCIAV2+6
APCIADL2 EQU   APCIAV2+4
APCIABS2 EQU   APCIAV2
APCIAXN1 EQU   APCIAV1+14
APCIAXD1 EQU   APCIAV1+12
APCIAXB1 EQU   APCIAV1+10
@NM00057 EQU   APCIAF11
@NM00056 EQU   APCIAF01
APCIAST1 EQU   APCIAF01
APCIATC1 EQU   APCIAF01
@NM00055 EQU   APCIAF01
APCIAFN1 EQU   APCIAF01
APCIAFP1 EQU   APCIAF01
APCIARS1 EQU   APCIAF01
APCIANB1 EQU   APCIAV1+6
APCIADL1 EQU   APCIAV1+4
APCIABS1 EQU   APCIAV1
@NM00053 EQU   APCIADTA+20
APCIAXN  EQU   APCIAVCT+14
APCIAXD  EQU   APCIAVCT+12
APCIAXB  EQU   APCIAVCT+10
@NM00052 EQU   APCIAF1
@NM00051 EQU   APCIAF0
APCIASTR EQU   APCIAF0
APCIATCM EQU   APCIAF0
@NM00050 EQU   APCIAF0
APCIAFNG EQU   APCIAF0
APCIAFPS EQU   APCIAF0
APCIARSN EQU   APCIAF0
APCIANBR EQU   APCIAVCT+6
APCIADLT EQU   APCIAVCT+4
APCIABSA EQU   APCIAVCT
APCIADO  EQU   APCIADTA+2
@NM00049 EQU   APCIASO1
APCIASSK EQU   APCIASO1
@NM00048 EQU   APCIASO0
APCIASCE EQU   APCIASO0
APCIASUD EQU   APCIASO0
APCIASUF EQU   APCIASO0
APCIASOV EQU   APCIASO0
APCIIBSA EQU   APCIIDTA+4
APCIIX2  EQU   APCIISZ
APCIIX   EQU   APCIIDTA
APCIXBRO EQU   APCIXDTA+10
APCIXBSX EQU   APCIXCC
APCIXBSA EQU   APCIXIMM
APCIXID2 EQU   APCIXDTA+2
APCIXID1 EQU   APCIXDTA
APCIOPSZ EQU   @NM00047+2
APCIOPCD EQU   APCIOPID+1
APCIOPTP EQU   APCIOPID
@NM00198 EQU   APUT+160
APUTAPEM EQU   APUT+32
APUTRCDE EQU   APUT+28
@NM00197 EQU   APUT+26
APUTFLG1 EQU   APUTFLGS+1
@NM00196 EQU   APUTFLG0
APUTACT  EQU   APUTFLG0
@NM00195 EQU   APUT+18
APUTSIZE EQU   APUT+16
APUTAPCT EQU   APUT+12
APUTAPAT EQU   APUT+8
APUTUSER EQU   APUT+4
APUTID   EQU   APUT
APSVWORK EQU   APSV+80
@NM00194 EQU   APSV+80
APSVFREE EQU   APSV+76
APSVAPSM EQU   APSV+72
APSVRG12 EQU   APSVREGS+56
APSVRG11 EQU   APSVREGS+52
APSVRG10 EQU   APSVREGS+48
APSVRG9  EQU   APSVREGS+44
APSVRG8  EQU   APSVREGS+40
APSVRG7  EQU   APSVREGS+36
APSVRG6  EQU   APSVREGS+32
APSVRG5  EQU   APSVREGS+28
APSVRG4  EQU   APSVREGS+24
APSVRG3  EQU   APSVREGS+20
APSVRG1  EQU   APSVREGS+12
APSVRG0  EQU   APSVREGS+8
APSVRG15 EQU   APSVREGS+4
APSVRG14 EQU   APSVREGS
APSVPREV EQU   APSV+4
APSVAPSC EQU   APSV
APSNCIO1 EQU   APSNCIOP+1
APSNCIO0 EQU   APSNCIOP
APSNFMT  EQU   APSN+3
@NM00184 EQU   APSNCMPN
APSNCPM  EQU   APSNCMPN
APSNCCPX EQU   APSNCMPN
APSNCDTC EQU   APSNCMPN
APSNCAE  EQU   APSNCMPN
APSNCIO  EQU   APSNCMPN
APSNCCP  EQU   APSNCMPN
@NM00183 EQU   APSNRQST
APSNINPW EQU   APSNRQST
APSNRQDE EQU   APSNRQST
APSNRQUR EQU   APSNRQST
APSNRQRS EQU   APSNRQST
APSNPRIO EQU   APSNSTND
APSNINIT EQU   APSNSTND
APSNOVRN EQU   APSNSTND
APSNDTCK EQU   APSNSTND
APSNEQCK EQU   APSNSTND
APSNBOP  EQU   APSNSTND
APSNINTV EQU   APSNSTND
APSNCMD  EQU   APSNSTND
@NM00179 EQU   APIO+424
@NM00178 EQU   APIO+400
APIOTMEE EQU   APIO+396
APIOTMES EQU   APIO+392
APIOXTME EQU   APIO+388
APIONBRI EQU   APIONBR+2
APIONBRX EQU   APIONBR
APIOAPCT EQU   APIO+380
APIOGMS1 EQU   APIOGMSZ+2
@NM00177 EQU   APIOGMSZ+1
APIOGMSP EQU   APIOGMSZ
APIOGMAD EQU   APIO+372
APIOCISZ EQU   APIO+370
APIOSIZE EQU   APIO+368
APIORB   EQU   APIOTR+4
APIOTCB  EQU   APIOTR
APIOECB  EQU   APIO+356
APIOTERM EQU   APIO+352
APIOASCB EQU   APIO+348
APIOTCSW EQU   APIOSAVE
APIOACTV EQU   APIOFLG7
APIOFLG6 EQU   APIOFLGB+2
APIOFLG5 EQU   APIOFLGB+1
APIOFLG4 EQU   APIOFLGB
@NM00176 EQU   APIOFLG3
APIOPGFS EQU   APIOFLG3
APIOPGIP EQU   APIOFLG3
APIORSME EQU   APIOFLG3
APIORET  EQU   APIOFLG3
APIONPST EQU   APIOFLG3
APIOIOCT EQU   APIOFLG3
@NM00175 EQU   APIOFLG2
APIODMPT EQU   APIOFLG2
APIODUMP EQU   APIOFLG2
APIOCSWT EQU   APIOFLG2
APIOEXCL EQU   APIOFLG2
APIOFLG1 EQU   APIOFLGA+1
@NM00174 EQU   APIOFLG0
APIOSU50 EQU   APIOFLG0
APIOSYNC EQU   APIOFLG0
APIOFXED EQU   APIOFLG0
@NM00173 EQU   APIO+246
APIOOLAP EQU   APIO+244
APIOIOAP EQU   APIO+240
APIORGN  EQU   APIO+236
APIOPGFL EQU   APIO+232
APIOPGFX EQU   APIO+228
APIODEB  EQU   APIO+216
APIOAPXL EQU   APIO+212
APIOAPUB EQU   APIO+204
APIOAPIO EQU   APIO+200
APIOUSER EQU   APIO+196
APIOID   EQU   APIO+192
@NM00167 EQU   APEM+128
APEMSSNM EQU   APEM+124
APEMCM17 EQU   APEM+123
APEMAPRL EQU   APEM+117
APEMCM16 EQU   APEM+116
APEMVALN EQU   APEMVALU+4
APEMVALP EQU   APEMVALU
APEMCM15 EQU   APEM+107
@NM00166 EQU   APEMMSG+4
APEMMSGN EQU   APEMMSG
APEMCM13 EQU   APEM+91
APEMCCWC EQU   APEM+85
APEMCM12 EQU   APEM+84
APEMDDN  EQU   APEM+76
APEMCM11 EQU   APEM+75
APEMDVTP EQU   APEM+73
APEMCM10 EQU   APEM+72
APEMUNIT EQU   APEM+69
APEMCM09 EQU   APEM+68
APEMSTEP EQU   APEM+60
APEMCM08 EQU   APEM+59
APEMJOB  EQU   APEM+51
APEMCM07 EQU   APEM+50
APEMCICT EQU   APEM+48
APEMCM06 EQU   APEM+47
APEMCIOP EQU   APEM+43
APEMCM05 EQU   APEM+42
APEMCINM EQU   APEM+38
APEMCM04 EQU   APEM+37
APEMNAME EQU   APEM+33
APEMCM03 EQU   APEM+32
APEMERCD EQU   APEM+26
APEMCM02 EQU   APEM+25
APEMTIME EQU   APEM+18
APEMCM01 EQU   APEM+17
APEMDATE EQU   APEM+12
APEMREG1 EQU   APEM+8
APEMZ2   EQU   APEM+6
APEMSZ2  EQU   APEM+4
APEMZ1   EQU   APEM+2
APEMSZ1  EQU   APEM
APDXAPIO EQU   APDX+136
@NM00165 EQU   APDX+136
@NM00164 EQU   APDX+133
@NM00163 EQU   APDX+132
@NM00162 EQU   APDXSW1
@NM00161 EQU   APDXSW0
APDXSSMF EQU   APDXSW0
APDXSEOT EQU   APDXSW0
APDXSOPN EQU   APDXSW0
APDXIOCT EQU   APDX+128
@NM00160 EQU   APDX+52
@NM00159 EQU   APDX+50
APDXNDMP EQU   APDX+48
APDXDEB  EQU   APDX+44
APDXAPOC EQU   APDX+40
APDXDXA  EQU   APDX+36
APDXSIZE EQU   APDXDXL+2
@NM00158 EQU   APDXDXL
APDXAPMF EQU   APDX252A
APDX252L EQU   APDX+24
APDX000A EQU   APDX+20
APDX000L EQU   APDX+16
APDXAPDS EQU   APDX+12
APDXAPCT EQU   APDX+8
APDXUSER EQU   APDX+4
APDXID   EQU   APDX
APCXAPUT EQU   APCX+36
APCXINTF EQU   APCXINTV
APCXBSAD EQU   APCXUSRI+20
APCXARCD EQU   APCXUSRI+16
APCXAFNC EQU   APCXUSRI+12
APCXACCW EQU   APCXUSRI+8
APCXFLG3 EQU   APCXFLGS+3
APCXFLG2 EQU   APCXFLGS+2
APCXFLG1 EQU   APCXFLGS+1
@NM00157 EQU   APCXFLG0
APCXOWN  EQU   APCXFLG0
APCXREG  EQU   APCXUSRI
APCXUSER EQU   APCX+4
APCXID   EQU   APCX
@NM00156 EQU   APCW+240
@NM00155 EQU   APCW+112
@NM00154 EQU   APCW+80
@NM00153 EQU   APCW+76
APCWZCNV EQU   APCWINT3
APCWZFLO EQU   APCWINT3
APCWZFLU EQU   APCWINT3
APCWZFLD EQU   APCWINT3
APCWZIDX EQU   APCWINT3
APCWZFLN EQU   APCWINT3
@NM00152 EQU   APCWINT3
APCWZLGC EQU   APCWINT2
APCWZHDW EQU   APCWINT2
APCWZUKN EQU   APCWINT2
@NM00151 EQU   APCWINT2
@NM00150 EQU   APCWINT1
APCWZAM  EQU   APCWINT0
@NM00149 EQU   APCWINT0
APCWRCN  EQU   APCWRCDE+3
APCWRCC  EQU   APCWRCDE+2
APCWRCT  EQU   APCWRCDE+1
APCWRC0  EQU   APCWRCDE
APCWR15B EQU   APCWR15C+3
@NM00148 EQU   APCWR15C
APCWAPOP EQU   APCWOPF
@NM00147 EQU   APCW+60
@NM00146 EQU   APCW+52
APCWNBRI EQU   APCW+48
APCWSW1  EQU   APCWSWS+1
@NM00145 EQU   APCWSW0
APCWSVAL EQU   APCWSW0
APCWSIX  EQU   APCWSW0
@NM00144 EQU   APCW+44
APCWAPAL EQU   APCW+40
@NM00143 EQU   APCW+36
APCWACBF EQU   APCWACB
APCWUSER EQU   APCW+4
APCWID   EQU   APCW
@NM00127 EQU   APCT+1556
APCTSVCT EQU   APCT+1552
APCTDAVT EQU   APCT+1548
APCTLOGL EQU   APCT+1544
@NM00126 EQU   APCT+1540
APCTDMPU EQU   APCT+1536
APCTDMPM EQU   APCT+1532
APCTNDMP EQU   APCT+1530
APCTASID EQU   APCT+1528
APCTLGPG EQU   APCT+1526
APCTLGLN EQU   APCT+1524
APCTAPVU EQU   APCT+1520
APCTABR  EQU   APCT+1116
APCTACTR EQU   APCT+1112
APCTLOGD EQU   APCT+1108
APCTDCLD EQU   APCT+1104
APCTIOAP EQU   APCT+1100
@NM00125 EQU   APCT+1080
@NM00124 EQU   APCT+1078
APCTKCAX EQU   APCT+1076
APCTABND EQU   APCT+1072
@NM00123 EQU   APCT+1068
APCTAPIO EQU   APCT+1064
APCTCSCT EQU   APCT+1060
APCTSTDF EQU   APCT+1056
APCTSTMX EQU   APCT+1052
APCTRGMX EQU   APCT+1048
APCTSIZE EQU   APCT+1046
APCTCTUB EQU   APCT+1045
APCTMFID EQU   APCT+1044
APCTMFSZ EQU   APCT+1040
APCTCRTN EQU   APCT+1036
APCTAPCP EQU   APCT+1032
APCTAMNA EQU   APCT+1028
APCTEMNA EQU   APCT+1024
APCTAALP EQU   APCT+1020
APCTEALP EQU   APCT+1016
@NM00122 EQU   APCT+1012
@NM00121 EQU   APCT+1008
@NM00120 EQU   APCT+1004
APCTEIPL EQU   APCT+1000
@NM00119 EQU   APCT+996
@NM00118 EQU   APCT+992
@NM00117 EQU   APCT+988
@NM00116 EQU   APCT+984
@NM00115 EQU   APCT+980
APCTECPW EQU   APCT+976
APCTEULD EQU   APCT+972
APCTECPT EQU   APCT+968
APCTEALC EQU   APCT+964
APCTECBL EQU   APCT+960
APCTECIT EQU   APCT+956
APCTCQAF EQU   APCTCQAQ
APCTCQL  EQU   APCTAPCQ+4
APCTCQF  EQU   APCTAPCQ
APCTCQLK EQU   APCT+940
@NM00114 EQU   @NM00110+2
@NM00113 EQU   APCTPRSW
APCTAPST EQU   APCTPRSW
@NM00112 EQU   APCTPRSW
@NM00111 EQU   APCTSTAT
APCTWARM EQU   APCTSTAT
APCTTERM EQU   APCTSTAT
APCTHALT EQU   APCTSTAT
APCTQSCE EQU   APCTSTAT
APCTSTRT EQU   APCTSTAT
APCTACT  EQU   APCTSTAT
@NM00109 EQU   APCT+935
APCTSOUT EQU   APCT+934
APCTDAID EQU   APCT+933
APCTSV34 EQU   APCT+932
APCTMJOB EQU   APCT+928
APCTTCB  EQU   APCT+924
APCTASCB EQU   APCT+920
APCTDCNW EQU   APCT+918
APCTDCNR EQU   APCT+916
@NM00108 EQU   APCT+912
@NM00107 EQU   APCT+908
@NM00106 EQU   APCT+904
@NM00105 EQU   APCT+900
@NM00104 EQU   APCTERRS+22
APCTERTJ EQU   APCTERRS+20
APCTERTD EQU   APCTERRS+18
APCTERTC EQU   APCTERRS+16
APCTERTB EQU   APCTERRS+14
APCTERTA EQU   APCTERRS+12
APCTERT9 EQU   APCTERRS+10
APCTERT3 EQU   APCTERRS+8
APCTERT2 EQU   APCTERRS+6
APCTERT1 EQU   APCTERRS+4
APCTERT0 EQU   APCTERRS+2
APCTERTT EQU   APCTERRS
APCTDSAP EQU   APCT+872
APCTISUB EQU   APCT+868
APCTUBAP EQU   APCT+864
APCTAPDS EQU   APCT+860
APCTUBIC EQU   APCT+856
APCTUBIS EQU   APCT+852
APCTAPUB EQU   APCT+848
APCTUBLK EQU   APCT+844
APCTBR1A EQU   APCTBR14+2
@NM00103 EQU   APCTBR14
APCTSMSZ EQU   APCTSMAD+2
@NM00102 EQU   APCTSMAD+1
@NM00101 EQU   APCTSMAD
APCTSMIS EQU   APCTSMIN+2
@NM00100 EQU   APCTSMIN+1
APCTSMSP EQU   APCTSMIN
@NM00099 EQU   APCT+30
APCTLINE EQU   APCT+28
APCTLBSZ EQU   APCT+24
APCTREG  EQU   APCT+20
APCTSSID EQU   APCTENQM+4
@NM00098 EQU   APCTENQM
APCTSSVT EQU   APCT+8
APCTUSER EQU   APCT+4
APCTID   EQU   APCT
APCPFRST EQU   APCP+16
@NM00070 EQU   APCP+12
APCPLAST EQU   APCP+8
APCPUSER EQU   APCP+4
APCPID   EQU   APCP
APCIHELM EQU   APCI+4
@NM00046 EQU   APCIHDR+4
@NM00045 EQU   APCIHFG1
@NM00044 EQU   APCIHFG0
@NM00043 EQU   APCIHDR
@NM00042 EQU   APAX+72
@NM00041 EQU   APAX+68
@NM00040 EQU   APAX+64
APAXIOCT EQU   APAX+60
APAXLCIT EQU   APAX+56
APAXAPRL EQU   APAX+52
APAXSTAT EQU   APAX+48
@NM00039 EQU   APAXFLG2
APAXBDSW EQU   APAXFLG2
@NM00038 EQU   APAXFLG1
@NM00037 EQU   APAXFLG0
APAXSVSW EQU   APAX+44
APAXARBL EQU   APAX+40
APAXAPLB EQU   APAX+36
APAXCIE  EQU   APAX+32
APAXCIN  EQU   APAX+28
APAXCIS  EQU   APAX+24
APAXCCWE EQU   APAX+20
APAXCCWN EQU   APAX+16
APAXCCWS EQU   APAX+12
APAXAPSV EQU   APAX+8
APAXUSER EQU   APAX+4
APAXID   EQU   APAX
@NM00036 EQU   APRL+80
@NM00035 EQU   APRL+76
APRLEMSP EQU   APRL+72
APRLEMSL EQU   APRL+70
APRLACTV EQU   APRL+69
@NM00034 EQU   APRLEXTS
@NM00033 EQU   APRL+60
APRLPGFX EQU   APRLOPT7
APRLDUMP EQU   APRLOPT7
@NM00032 EQU   APRLOPT7
@NM00031 EQU   APRLOPT6
@NM00030 EQU   APRLOPT5
@NM00029 EQU   APRLOPT4
@NM00028 EQU   APRL+52
@NM00027 EQU   APRL+48
APRLAPRL EQU   APRL+44
@NM00026 EQU   APRLOPT3
@NM00025 EQU   APRLOPT2
@NM00024 EQU   APRLOPT1
APRLNRC  EQU   APRLOPT0
@NM00023 EQU   APRLOPT0
APRLXIO  EQU   APRLOPT0
APRLASY  EQU   APRLOPT0
@NM00022 EQU   APRLOPT0
APRLCCW  EQU   APRL+36
APRLAPIO EQU   APRL+32
APRLTCB  EQU   APRL+28
APRLACB  EQU   APRL+24
APRLURCP EQU   APRL+20
APRLVALN EQU   APRL+18
APRLMSGN EQU   APRL+16
APRLRCN  EQU   APRLFDBK+3
APRLRCC  EQU   APRLFDBK+2
APRLRCT  EQU   APRLFDBK+1
@NM00021 EQU   APRLFDBK
APRLECBA EQU   APRLECB+1
@NM00020 EQU   APRLECBC
APRLECBP EQU   APRLECBC
APRLECBW EQU   APRLECBC
APRLUSER EQU   APRL+4
APRLID   EQU   APRL
EXLEADDR EQU   EXLEXITP
@NM00019 EQU   EXLENFL
EXLOPNP  EQU   EXLCOMN+36
@NM00018 EQU   EXLOPNF
EXLOPNK  EQU   EXLOPNF
EXLOPNA  EQU   EXLOPNF
EXLOPNS  EQU   EXLOPNF
EXLJRNP  EQU   EXLCOMN+31
@NM00017 EQU   EXLJRNF
EXLJRNK  EQU   EXLJRNF
EXLJRNA  EQU   EXLJRNF
EXLJRNS  EQU   EXLJRNF
EXLLGNP  EQU   EXLCOMN+26
@NM00016 EQU   EXLLGNF
EXLLGNK  EQU   EXLLGNF
EXLLGNA  EQU   EXLLGNF
EXLLGNS  EQU   EXLLGNF
EXLSCIPP EQU   EXLCOMN+21
@NM00015 EQU   EXLSCIPF
EXLSCIPK EQU   EXLSCIPF
EXLSCIPA EQU   EXLSCIPF
EXLSCIPS EQU   EXLSCIPF
EXLLERP  EQU   EXLCOMN+16
@NM00014 EQU   EXLLERF
EXLLERK  EQU   EXLLERF
EXLLERS  EQU   EXLLERF
EXLSYNP  EQU   EXLCOMN+11
@NM00013 EQU   EXLSYNF
EXLSYNK  EQU   EXLSYNF
EXLSYNS  EQU   EXLSYNF
EXLEODP  EQU   EXLCOMN+6
@NM00012 EQU   EXLEODF
EXLEODK  EQU   EXLEODF
EXLEODA  EQU   EXLEODF
EXLEODS  EQU   EXLEODF
@NM00011 EQU   EXLCOMN+4
EXLLEN2  EQU   EXLLEN
EXLSTYP  EQU   EXLCOMN+1
EXLID    EQU   EXLCOMN
ACBCBMWA EQU   ACBCOMN+68
ACBUAPTR EQU   ACBCOMN+64
ACBLRECL EQU   ACBCOMN+62
ACBMSGLN EQU   ACBBLKSZ
ACBBUFSP EQU   ACBCOMN+56
@NM00010 EQU   ACBUJFCB+1
ACBOPTN  EQU   ACBUJFCB
ACBVVIC  EQU   ACBINFLG
ACBUCRA  EQU   ACBINFLG
ACBSCRA  EQU   ACBINFLG
ACBCAT   EQU   ACBINFLG
ACBIJRQE EQU   ACBINFLG
ACBJEPS  EQU   ACBINFLG
@NM00009 EQU   ACBINFLG
ACBERFLG EQU   ACBCOMN+49
ACBBUSY  EQU   ACBIOSFG
ACBLOCK  EQU   ACBEXFG
@NM00008 EQU   ACBOFLGS
ACBDSERR EQU   ACBOFLGS
ACBOPEN  EQU   ACBOFLGS
ACBEOV   EQU   ACBOFLGS
@NM00007 EQU   ACBOFLGS
ACBDEB   EQU   ACBDDNM+5
ACBERFL  EQU   ACBDDNM+4
ACBAM    EQU   ACBAMETH
ACBINFL  EQU   ACBDDNM+2
ACBTIOT  EQU   ACBDDNM
ACBUEL   EQU   ACBEXLST
ACBPASSW EQU   ACBCOMN+32
ACBMSGAR EQU   ACBCOMN+28
@NM00006 EQU   ACBDSORG+1
ACBDORGA EQU   ACBDSORG+1
@NM00005 EQU   ACBDSORG
ACBCRNRE EQU   ACBCROPS
ACBCRNCK EQU   ACBCROPS
ACBASA   EQU   ACBCCTYP
@NM00004 EQU   ACBCCTYP
ACBRECAF EQU   ACBRECFM
ACBJBUF  EQU   ACBBUFPL+2
ACBMACR4 EQU   ACBBUFPL+1
@NM00003 EQU   ACBMACR3
ACBNCFX  EQU   ACBMACR3
ACBSIS   EQU   ACBMACR3
ACBDFR   EQU   ACBMACR3
ACBICI   EQU   ACBMACR3
ACBGSR   EQU   ACBMACR3
ACBLSR   EQU   ACBMACR3
@NM00002 EQU   ACBMACR3
ACBBUFNI EQU   ACBCOMN+18
ACBBUFND EQU   ACBCOMN+16
ACBSTRNO EQU   ACBCOMN+15
ACBBSTNO EQU   ACBCOMN+14
ACBAIX   EQU   ACBMACR2
ACBDSN   EQU   ACBMACR2
ACBRST   EQU   ACBMACR2
ACBLOGON EQU   ACBMACR2
ACBSKP   EQU   ACBMACR2
@NM00001 EQU   ACBMACR2
ACBUBF   EQU   ACBMACR1
ACBOUT   EQU   ACBMACR1
ACBIN    EQU   ACBMACR1
ACBDIR   EQU   ACBMACR1
ACBSEQ   EQU   ACBMACR1
ACBBLK   EQU   ACBCNV
ACBADD   EQU   ACBADR
ACBKEY   EQU   ACBMACR1
ACBINRTN EQU   ACBCOMN+8
ACBLEN2  EQU   ACBLENG2
ACBSTYP  EQU   ACBCOMN+1
ACBID    EQU   ACBCOMN
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS
@RC00089 EQU   @RC00088
@RF00098 EQU   @EL00001
@RF00148 EQU   @EL00001
@RF00181 EQU   @EL00002
@ENDDATA EQU   *
         END   IGTMBM,(C'PLS0016',0701,77093)
