//*                      *****************
//*                      *  P P T O S I  *
//*                      *****************
//*
//*     THIS PROC WILL RESET SYSTEM FOR RUNNING IN SINGLE IMAGE
//*                   MODE AS IT NORMALLY DOES.
//*
//CMND01 EXEC PGM=NST560,PARM='P OMEGAMON'
//*
//CMND02 EXEC PGM=NST560,PARM='SET IPS=00'
//*
//CMND03 EXEC PGM=NST560,PARM='$C A,ALL'
//*
//CMND04 EXEC PGM=NST560,PARM='S JES2AUTO'
//*
//CMND05 EXEC PGM=SYS425,
//         PARM='WAIT=120;D A,OMEGAMON'
//*
//CMND06 EXEC PGM=NST560,PARM='S OMEGAMON'
//*
