         TITLE 'IEAVPREF - PREFERRED AREA ALLOCATION STEAL             *
                        '
*                         /*ENTRY CODE*/
IEAVPREF CSECT
         MODID BR=NO
         ENTRY IEAVPRE2
IEAVPRE2 DS    0H
         STM   REG0,REG14,MYSAVE(PVTPTR) SAVE THE INPUT REGS (CHANGE)
         BALR  BASEREG,0
         USING *,BASEREG
*   RBN=REG1;                       /* GET RBN (CONVERT) OR ZERO   0067
*                                                            @ZA16816*/
         LR    RBN,REG1                                            0067
*   RESPECIFY                                                      0068
*    (REG1) UNRSTD;                 /*                       @ZA16816*/
*   IF RBN=0 THEN                   /* IF STEAL OPTION THEN  @ZA16816*/
         LTR   RBN,RBN                                             0069
         BNZ   @RF00069                                            0069
*     DO;                           /* TRY TO STEAL A FRAME  @ZA16816*/
*       PASS=REG0;                  /* GET THE PASS NUMBER   @ZA16816*/
         LR    PASS,REG0                                           0071
*       RESPECIFY                                                  0072
*        (REG0) UNRSTD;             /*                       @ZA16816*/
*       RSMHDPTR=PSAAOLD->ASCBRSM;  /* SET TO CURRENT RSMHD  @ZA16816*/
         L     @09,PSAAOLD                                         0073
         L     RSMHDPTR,ASCBRSM(,@09)                              0073
*       RESPECIFY                                                  0074
*        (FRAMEPTR,                                                0074
*         ASCBPTR) RSTD;            /*                       @ZA16816*/
*       SAVER15='00000004'X;        /* SET RC=4 INITIALLY    @ZA16816*/
         MVC   SAVER15(4,PVTPTR),@CB01815                          0075
*START:                             /*                       @ZA16816*/
*                                                                  0076
*       /*************************************************************/
*       /*                                                           */
*       /* START SEARCH WITH THE CURRENT LOCAL FRAME QUEUE   @ZA16816*/
*       /* IF NOT IN TRAS MODE.                              @ZA29043*/
*       /*                                                           */
*       /*************************************************************/
*                                                                  0076
*       IF LCCAASID=0 THEN          /* IN TRAS MODE ?        @ZA29043*/
START    L     @06,LCCAPTR                                         0076
         L     @06,LCCAASID(,@06)                                  0076
         LTR   @06,@06                                             0076
         BNZ   @RF00076                                            0076
*         DO;                       /* NO, SEARCH CURRENT LFQ      0077
*                                                            @ZA29043*/
*           ASCBPTR=0;              /* NO ASCB FOR CURRENT LFQ     0078
*                                                            @ZA16816*/
         SLR   ASCBPTR,ASCBPTR                                     0078
*           RBN=RSMLFQF;            /* GET 1ST PFTE RBN ON CUR LFQ 0079
*                                                            @ZA16816*/
         LH    RBN,RSMLFQF(,RSMHDPTR)                              0079
         N     RBN,@CF01844                                        0079
*           CALL QSCAN;             /* SEARCH THE CURRENT LFQ      0080
*                                                            @ZA16816*/
         BAL   @14,QSCAN                                           0080
*         END;                      /*                       @ZA29043*/
*       ELSE                        /* WE ARE IN TRAS MODE   @ZA29043*/
*         REG15=4;                  /* ENSURE WE SEARCH CFQ  @ZA29043*/
         B     @RC00076                                            0082
@RF00076 LA    REG15,4                                             0082
*       IF REG15^=0 THEN            /* IF A FRAME WAS NOT FOUND,   0083
*                                                            @ZA16816*/
@RC00076 LTR   REG15,REG15                                         0083
         BZ    @RF00083                                            0083
*         DO;                       /* CONTINUE THE SEARCH   @ZA16816*/
*/*  *****************************************************************/
*/*                                                                  */
*/*          SEARCH THE COMMON FRAME QUEUE SECOND            @ZA16816*/
*/*                                                                  */
*/*                  NOTE WELL...........                    @ZA29043*/
*/*                                                                  */
*/*     THE VIRTUAL ADDRESS OF THE SEGMENT TABLE MUST BE     @ZA29043*/
*/*     IDENTICAL FOR ALL ADDRESS SPACES.  IF THEY ARE       @ZA29043*/
*/*     NOT, UNPREDICTABLE RESULTS MAY OCCUR WHEN THE        @ZA29043*/
*/*     SYSTEM IS IN TRAS MODE.                              @ZA29043*/
*/*  *****************************************************************/
*                                                                  0085
*           RBN=PVTCFQF;            /* GET 1ST PFTE RBN ON CFQ     0085
*                                                            @ZA16816*/
         LH    RBN,PVTCFQF(,PVTPTR)                                0085
         N     RBN,@CF01844                                        0085
*           CALL QSCAN;             /* SEARCH THE CFQ        @ZA16816*/
         BAL   @14,QSCAN                                           0086
*           IF REG15^=0             /* IF A FRAME NOT FOUND, @ZA16816*/
*               &LCCAASID=0 THEN    /* AND NOT IN TRAS MODE, @ZA29043*/
         SLR   @14,@14                                             0087
         CR    REG15,@14                                           0087
         BE    @RF00087                                            0087
         L     @06,LCCAPTR                                         0087
         CL    @14,LCCAASID(,@06)                                  0087
         BNE   @RF00087                                            0087
*             DO;                   /* CONTINUE THE SEARCH   @ZA16816*/
*               RESPECIFY                                          0089
*                (REG0) RSTD;       /*                       @ZA16816*/
*                                                                  0089
*               /*****************************************************/
*               /*                                                   */
*               /* SEARCH ALL FOREIGN LOCAL FRAME QUEUES 3RD @ZA16816*/
*               /* IF NOT IN TRAS MODE.                      @ZA29043*/
*               /*                                                   */
*               /*****************************************************/
*                                                                  0090
*               REG0=BASEREG;       /* SAVE BASE REGISTER    @ZA16816*/
         LR    REG0,BASEREG                                        0090
*               RFY                                                0091
*                (REG13) RSTD;      /*                       @ZA28519*/
*               GENERATE REFS(PSALITA,PSA,PSACPULA,PSAHLHI);       0092
         SETLOCK OBTAIN,TYPE=DISP,MODE=UNCOND,RELATED=(PREF)
*               BASEREG=REG0;       /* RESTORE BASE REGISTER @ZA16816*/
         LR    BASEREG,REG0                                        0093
*               IF REG13=0 THEN     /* DISP LOCK OBTAINED ?  @ZA28519*/
         LTR   REG13,REG13                                         0094
         BNZ   @RF00094                                            0094
*                 RCADISP='1'B;     /* YES, NOTE NEED FOR RELEASE  0095
*                                                            @ZA28519*/
         L     @01,RCAPTR(,PVTPTR)                                 0095
         OI    RCADISP(@01),B'00000010'                            0095
*               RFY                                                0096
*                (REG13) UNRSTD;    /*                       @ZA28519*/
@RF00094 DS    0H                                                  0097
*               ASCBPTR=CVTASCBH;   /* GET 1ST ASCB ON READY QUEUE 0097
*                                                            @ZA16816*/
         L     @06,CVTPTR                                          0097
         L     ASCBPTR,CVTASCBH(,@06)                              0097
*               RESPECIFY                                          0098
*                (REG15) RSTD;      /*                       @ZA16816*/
*               DO UNTIL REG15=0;   /* SEARCH UNTIL HIT OR END OF  0099
*                                      ASCBS                 @ZA16816*/
@DL00099 DS    0H                                                  0100
*                 IF ASCBPTR=0 THEN /* IF NO MORE ASCBS THEN @ZA16816*/
         LTR   ASCBPTR,ASCBPTR                                     0100
         BNZ   @RF00100                                            0100
*                   REG15=0;        /* CLEAR R15 TO EXIT LOOP      0101
*                                                            @ZA16816*/
         SLR   REG15,REG15                                         0101
*                 ELSE              /* IF ANOTHER ASCB THEN  @ZA16816*/
*                   DO;             /* SCAN ITS LOCAL FRAME QUEUE  0102
*                                                            @ZA16816*/
         B     @RC00100                                            0102
@RF00100 DS    0H                                                  0103
*                     RBN=ASCBPTR->ASCBRSM->RSMLFQF;/*       @ZA16816*/
         L     @01,ASCBRSM(,ASCBPTR)                               0103
         LH    RBN,RSMLFQF(,@01)                                   0103
         N     RBN,@CF01844                                        0103
*                     CALL QSCAN;   /* SEARCH THE LFQ        @ZA16816*/
         BAL   @14,QSCAN                                           0104
*                     ASCBPTR=ASCBFWDP;/* GET NEXT ASCB ON RETRY QUE
*                                                            @ZA16816*/
         L     ASCBPTR,ASCBFWDP(,ASCBPTR)                          0105
*                   END;            /*                       @ZA16816*/
*               END;                /*                       @ZA16816*/
@RC00100 DS    0H                                                  0107
@DE00099 LTR   REG15,REG15                                         0107
         BNZ   @DL00099                                            0107
*               RESPECIFY                                          0108
*                (REG15) UNRSTD;    /*                       @ZA16816*/
*               IF RCADISP='1'B THEN/* RELEASE DISP LOCK?    @ZA28519*/
         L     @01,RCAPTR(,PVTPTR)                                 0109
         TM    RCADISP(@01),B'00000010'                            0109
         BNO   @RF00109                                            0109
*                 DO;               /* YES                   @ZA28519*/
*                   REG0=BASEREG;   /* SAVE BASE REGISTER    @ZA16816*/
         LR    REG0,BASEREG                                        0111
*                   GENERATE REFS(PSALITA,PSA,PSACPULA,PSAHLHI);   0112
         SETLOCK RELEASE,TYPE=DISP,RELATED=(PREF)
*                   BASEREG=REG0;   /* RESTORE BASE REGISTER @ZA16816*/
         LR    BASEREG,REG0                                        0113
*                   RCADISP='0'B;   /* NOTE DISP LOCK RELEASED     0114
*                                                            @ZA28519*/
         L     @01,RCAPTR(,PVTPTR)                                 0114
         NI    RCADISP(@01),B'11111101'                            0114
*                 END;              /* END RELEASE OF DISP LOCK    0115
*                                                            @ZA28519*/
*               RESPECIFY                                          0116
*                (REG0) UNRSTD;     /*                       @ZA16816*/
@RF00109 DS    0H                                                  0117
*               IF RC^=0&           /* IF STILL NO PFTE FOUND      0117
*                                                            @ZA16816*/
*                   PVTRSBQF^=0 THEN/* AND RSB Q NOT EMPTY,  @ZA16816*/
         CLI   RC(PVTPTR),0                                        0117
         BE    @RF00117                                            0117
         LH    @06,PVTRSBQF(,PVTPTR)                               0117
         N     @06,@CF01844                                        0117
         LTR   @06,@06                                             0117
         BZ    @RF00117                                            0117
*                 DO;               /* THEN TRY THE RSB QUEUE      0118
*                                                            @ZA16816*/
*                                                                  0118
*                   /*************************************************/
*                   /*                                               */
*                   /* SEARCH REAL STORAGE BUFFER QUEUE FOURTH       */
*                   /*                                       @ZA16816*/
*                   /*                                               */
*                   /*************************************************/
*                                                                  0119
*                   RESPECIFY                                      0119
*                    (REG1) RSTD;   /*                       @ZA16816*/
*                   REG1=PASS;      /* GET PASS NO FOR PRSB  @ZA16816*/
         LR    REG1,PASS                                           0120
*                   CALL IEAVPRSS;  /* TRY TO STEAL A FRAME  @ZA16816*/
         L     @15,@CV01797                                        0121
         BALR  @14,@15                                             0121
*                   RESPECIFY                                      0122
*                    (REG1) UNRSTD; /*                       @ZA16816*/
*                   RESPECIFY                                      0123
*                    (REG15) RSTD;  /*                       @ZA16816*/
*                   IF REG15^=0 THEN/* IF SUCCESSFUL         @ZA16816*/
         LTR   REG15,REG15                                         0124
         BZ    @RF00124                                            0124
*                     DO;           /* THEN                  @ZA16816*/
*                       SAVER0=REG15;/* SAVE ADDRESS OF PFTE @ZA16816*/
         ST    REG15,SAVER0(,PVTPTR)                               0126
*                       RC=0;       /* SET FINAL RC TO ZERO  @ZA16816*/
         MVI   RC(PVTPTR),X'00'                                    0127
*                       REG15->PFTSTEAL='0'B;/* INITIALIZE FLAG    0128
*                                                            @ZA16816*/
         NI    PFTSTEAL(REG15),B'11110111'                         0128
*                       REG15->PFTUIC=0;/* INITIALIZE UIC    @ZA16816*/
         MVI   PFTUIC(REG15),X'00'                                 0129
*                     END;          /*                       @ZA16816*/
*                   RESPECIFY                                      0131
*                    (REG15) UNRSTD;/*                       @ZA16816*/
@RF00124 DS    0H                                                  0132
*                 END;              /* END RSB QUEUE PROCESS @ZA16816*/
*             END;                  /* END FOREIGN LFQ SEARCH      0133
*                                                            @ZA16816*/
@RF00117 DS    0H                                                  0134
*         END;                      /* END CFQ SEARCH        @ZA16816*/
@RF00087 DS    0H                                                  0135
*       RESPECIFY                                                  0135
*        (FRAMEPTR,                                                0135
*         ASCBPTR) UNRSTD;          /*                       @ZA16816*/
*                                                                  0135
@RF00083 DS    0H                                                  0136
*       /*************************************************************/
*       /*                                                           */
*       /* AT THIS POINT, PREF HAS (1) FOUND THE DESIRED FRAME-      */
*       /* (SAVER15=0 AND SAVER0=PFTE ADDR) OR (2) IF PASS 1, FOUND  */
*       /* CHANGED PREFERRED FRAME - (SAVER15=8 AND SAVER0=PFTE ADDR)*/
*       /* OR (3) NOT FOUND A SUITABLE FRAME - (SAVER15=4)   @ZA16816*/
*       /*                                                           */
*       /*************************************************************/
*                                                                  0136
*       IF PASS=3&RC=4 THEN         /* NO LUCK ON PASS 3 THEN      0136
*                                                            @ZA16816*/
         C     PASS,@CF00187                                       0136
         BNE   @RF00136                                            0136
         CLI   RC(PVTPTR),4                                        0136
         BNE   @RF00136                                            0136
*         DO;                       /* RESTART SEARCH (PASS=4)     0137
*                                                            @ZA16816*/
*           PASS=4;                 /* LOOKING FOR A V=R     @ZA16816*/
         LA    PASS,4                                              0138
*           GOTO START;             /* INTERCEPTED FRAME     @ZA16816*/
         B     START                                               0139
*         END;                      /*                       @ZA16816*/
*       IF PASS=4&RC=0 THEN         /* IF SUCCESS ON PASS 4, @ZA16816*/
@RF00136 C     PASS,@CF00085                                       0141
         BNE   @RF00141                                            0141
         CLI   RC(PVTPTR),0                                        0141
         BNE   @RF00141                                            0141
*         DO;                       /* CANCEL THE V=R JOB    @ZA16816*/
*                                                                  0142
*           /*********************************************************/
*           /*                                                       */
*           /* SCAN THE PCBR V=R WAIT QUEUE IN SEARCH OF THE PCBR    */
*           /* WAITING FOR THE STOLEN V=R INTERCEPTED FRAME. WHEN    */
*           /* FOUND, CALL IEAVEQRI TO CANCEL THE ASSOCIATED V=R JOB.*/
*           /*                                               @ZA16816*/
*           /*                                                       */
*           /*********************************************************/
*                                                                  0143
*           RESPECIFY                                              0143
*            (PCBRPTR) RSTD;        /*                       @ZA16816*/
*           PCBRPTR=PVTVROOT;       /* GET 1ST V=R PCBR      @ZA16816*/
         L     PCBRPTR,PVTVROOT(,PVTPTR)                           0144
*           RBN=SAVER0-PVTPFTP;     /* GET RBN SEARCH ARGUMENT     0145
*                                                            @ZA16816*/
         L     RBN,SAVER0(,PVTPTR)                                 0145
         SL    RBN,PVTPFTP(,PVTPTR)                                0145
*PCBRLOOP:                          /*                       @ZA16816*/
*           IF PCBRPTR=0 THEN       /* IF ZERO, AN ERROR -   @ZA16816*/
PCBRLOOP LTR   PCBRPTR,PCBRPTR                                     0146
         BNZ   @RF00146                                            0146
*             DO;                   /* RECORD ERROR          @ZA16816*/
*               RCARCRD='08'X;      /* SET REASON CODE       @ZA16816*/
         L     @06,RCAPTR(,PVTPTR)                                 0148
         MVI   RCARCRD(@06),X'08'                                  0148
*               GENERATE;                                          0149
              ABEND X'C0D',,,SYSTEM      ABEND CODE
*               SAVER0->PFTVRINT='0'B;/* CLEAR INTERCEPT FLAG      0150
*                                                            @ZA16816*/
         L     @06,SAVER0(,PVTPTR)                                 0150
         NI    PFTVRINT(@06),B'10111111'                           0150
*             END;                  /*                       @ZA16816*/
*           ELSE                    /* HAVE A PCBR TO LOOK AT      0152
*                                                            @ZA16816*/
*                                                                  0152
*             /*******************************************************/
*             /*                                                     */
*             /* DETERMINE IF THE STOLEN FRAME IS WITHIN THE REGION  */
*             /* DEFINED BY THIS ROOT PCB. PCBRWRK1 AND PCBRWRK2     */
*             /* CONTAIN THE START AND END RBNS OF THE V=R REGION    */
*             /* REPRESENTED BY THIS ROOT PCB.               @ZA16816*/
*             /*                                                     */
*             /*******************************************************/
*                                                                  0152
*             IF RBN^<PCBRWRK1&     /* IF THE CORRECT        @ZA16816*/
*                 RBN^>PCBRWRK2 THEN/* ROOT PCBR IS FOUND    @ZA16816*/
         B     @RC00146                                            0152
@RF00146 C     RBN,PCBRWRK1(,PCBRPTR)                              0152
         BL    @RF00152                                            0152
         C     RBN,PCBRWRK2(,PCBRPTR)                              0152
         BH    @RF00152                                            0152
*               DO;                 /* CANCEL THE V=R JOB    @ZA16816*/
*                 PCBRFAIL='1'B;    /* SET CANCEL FLAG       @ZA16816*/
         OI    PCBRFAIL(PCBRPTR),B'00001000'                       0154
*                 IF PCBRINT='0'B THEN/* IF NOT PREVIOUSLY   @ZA16816*/
         TM    PCBRINT(PCBRPTR),B'10000000'                        0155
         BNZ   @RF00155                                            0155
*                   DO;             /* TERMINATED, CALL EQRI @ZA16816*/
*                     RESPECIFY                                    0157
*                      (REG1,                                      0157
*                       REG6) RSTD; /*                       @ZA16816*/
*                     REG1=RBN;     /* R1=RBN FOR IEAVEQRI   @ZA16816*/
         LR    REG1,RBN                                            0158
*                     REG6=SAVER0;  /* R6=PFTE ADDR FOR EQRI @ZA16816*/
         L     REG6,SAVER0(,PVTPTR)                                0159
*                     CALL IEAVEQRI;/* CANCEL THE V=R JOB    @ZA16816*/
         L     @15,PVTPVRIN(,PVTPTR)                               0160
         BALR  @14,@15                                             0160
*                     RESPECIFY                                    0161
*                      (REG1,                                      0161
*                       REG6) UNRSTD;/*                      @ZA16816*/
*                   END;            /*                       @ZA16816*/
*               END;                /*                       @ZA16816*/
*             ELSE                  /* HERE IF WRONG PCBR    @ZA16816*/
*               DO;                 /*                       @ZA16816*/
         B     @RC00152                                            0164
@RF00152 DS    0H                                                  0165
*                 PCBRPTR=PCBRWRK3; /* GET THE NEXT PCBR     @ZA16816*/
         L     PCBRPTR,PCBRWRK3(,PCBRPTR)                          0165
*                 GOTO PCBRLOOP;    /* GO CHECK ITS RANGE    @ZA16816*/
         B     PCBRLOOP                                            0166
*               END;                /*                       @ZA16816*/
*         END;                      /*                       @ZA16816*/
*     END;                          /* END OF STEAL OPTION   @ZA16816*/
*   ELSE                            /* WANT TO CONVERT A UNIT TO   0170
*                                      PREFERRED                     */
*     DO;                           /* DO THE CONVERSION             */
         B     @RC00069                                            0170
@RF00069 DS    0H                                                  0171
*       RESPECIFY                                                  0171
*        (MASK) RSTD;                                              0171
*       MASK=((PVTRSUS-1)&&ALLFOXES)*16;/* CONVERT THE # OF FRAMES IN
*                                      A STORAGE UNIT TO A MASK TO BE
*                                      USED TO ROUND A RBN TO A BOX
*                                      BOUNDARY                      */
         LH    @06,PVTRSUS(,PVTPTR)                                0172
         N     @06,@CF01844                                        0172
         BCTR  @06,0                                               0172
         LR    MASK,@06                                            0172
         X     MASK,@CF01805                                       0172
         SLL   MASK,4                                              0172
*       RBN=RBN&MASK;               /* ROUND THE INPUT RBN TO A LOWER
*                                      BOX BOUNDARY                  */
         NR    RBN,MASK                                            0173
*       RFY                                                        0174
*        (MASK) UNRSTD;                                            0174
*       RFY                                                        0175
*        (ENDPFTE,                                                 0175
*         PFTEPTR) RSTD;                                           0175
*       ENDPFTE=PVTPFTP+(RBN+((PVTRSUS-1)*LENGTH(PFTE)));/* GET END
*                                      OF LOOP. IS THE HIGHEST PFTE
*                                      IN A STORAGE UNIT             */
         L     @05,PVTPFTP(,PVTPTR)                                0176
         SLA   @06,4                                               0176
         ALR   @06,RBN                                             0176
         ALR   @06,@05                                             0176
         LR    ENDPFTE,@06                                         0176
*       DO PFTEPTR=PVTPFTP+RBN TO ENDPFTE BY LENGTH(PFTE);/* PROCESS
*                                      EACH PFTE IN THE STORAGE BOX  */
         ALR   @05,RBN                                             0177
         LR    PFTEPTR,@05                                         0177
         B     @DE00177                                            0177
@DL00177 DS    0H                                                  0178
*         IF PFTVR='0'B THEN        /* IF NOT A V=R FRAME,   @ZA16816*/
         TM    PFTVR(PFTEPTR),B'00100000'                          0178
         BNZ   @RF00178                                            0178
*           PFTPREF='1'B;           /* INDICATE PFTE IS PREFERRED    */
         OI    PFTPREF(PFTEPTR),B'00000100'                        0179
*       END;                                                       0180
@RF00178 AL    PFTEPTR,@CF00060                                    0180
@DE00177 CR    PFTEPTR,ENDPFTE                                     0180
         BNH   @DL00177                                            0180
*       RFY                                                        0181
*        (PFTEPTR,                                                 0181
*         ENDPFTE) UNRSTD;                                         0181
*       PVTPMSG='1'B;               /* INDICATE MSG ISSUED   @ZA16816*/
         OI    PVTPMSG(PVTPTR),B'10000000'                         0182
*       RFY                                                        0183
*        (MSGPTR,                                                  0183
*         MSGLEN) RSTD;                                            0183
*       MSGPTR=ADDR(PREFMSG);       /* GET ADDR OF THE MSG           */
         LA    MSGPTR,PREFMSG                                      0184
*       MSGLEN=LENGTH(PREFMSG);     /* GET MSG LENGTH                */
         LA    MSGLEN,4                                            0185
*       RFY                                                        0186
*        (REG13) RSTD;                                             0186
*       REG13=ADDR(PVTWSA14);       /* PASS AN UNUSED SAVE AREA      */
         LA    REG13,PVTWSA14(,PVTPTR)                             0187
*       GEN CODE;                                                  0188
*                                                                  0188
*                        /*ISSUE CONVERSION MESSAGE*/
         RECORD TYPE=WTO,RCVRY=SETFRR,DATAADR=(MSGPTR),BUFFER=NO,LENGTHH
               =(MSGLEN)
*       /*************************************************************/
*       /*                                                           */
*       /* DO NOT BOTHER TO CHECK RETURN CODE. IF BAD R.C., THERE IS */
*       /* NOTHING THAT CAN BE DONE BECAUSE LOGREC IS NOT AVAILABLE  */
*       /* TO RECORD AN ERROR.                                       */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0189
*       RFY                                                        0189
*        (MSGPTR,                                                  0189
*         MSGLEN,                                                  0189
*         REG13) UNRSTD;                                           0189
*     END;                          /* END OF CONVERT OPTION @ZA16816*/
*   GENERATE CODE;                                                 0191
@RC00069 DS    0H                                                  0191
         LM REG0,REG15,MYSAVE(PVTPTR)
         BR REG14         RETURN TO CALLER
*                                                                  0192
*/* ******************************************************************/
*/*                                                                  */
*/*            QSCAN SUBROUTINE  -  USED BY THE STEAL OPTION         */
*/*                                                                  */
*/*               FUNCTION - QSCAN WILL SCAN THE PFTE'S OF A GIVEN   */
*/*                          PFTE QUEUE IN SEARCH OF A STEALABLE     */
*/*                          FRAME THAT MEETS THE INPUT PASS CRITERIA*/
*/*                                                                  */
*/*               INPUT- RBN      = RBN OF 1ST PFTE ON A QUEUE       */
*/*                      PASS     = PASS NUMBER                      */
*/*                      PVTPTR   = ADDRESS OF PVT                   */
*/*                      RSMHDPTR = CURRENT ADDRESS SPACE RSMHD      */
*/*                                 ADDRESS                          */
*/*                      ASCBPTR  = ASCB PTR IF FOREIGN LFQ-ELSE 0   */
*/*                      REG14    = RETURN ADDRESS                   */
*/*                                                                  */
*/*               OUTPUT- (1) IF DESIRED PFTE FOUND                  */
*/*                               A. REG15=0                         */
*/*                               B. SAVER0=ADDRESS OF PFTE          */
*/*                               C. SAVER15=0                       */
*/*                       (2) IF PASS=1 AND CHANGED PREF PFTE FOUND  */
*/*                               A. REG15=4                         */
*/*                               B. SAVER0=ADDRESS OF PFTE          */
*/*                               C. SAVER1=0 (IF CURRENT LFQ OR     */
*/*                                            CFQ)  OR              */
*/*                                  SAVER1=ASCB ADDR                */
*/*                               D. SAVER15=8                       */
*/*                       (3) IF NO ACCEPTABLE PFTE FOUND            */
*/*                               A. REG15=4                         */
*/*                               B. SAVER15=AS ON INPUT             */
*/*                                                          @ZA16816*/
*/* ******************************************************************/
*                                                                  0192
*QSCAN:                                                            0192
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0192
QSCAN    DS    0H                                                  0193
*   RESPECIFY                                                      0193
*    (REG6,                                                        0193
*     FRAMEPTR,                                                    0193
*     PASS,                                                        0193
*     ASCBPTR,                                                     0193
*     REG14) RSTD;                  /*                       @ZA16816*/
*   REG6=REG14;                     /* SAVE RETURN ADDRESS   @ZA16816*/
         LR    REG6,REG14                                          0194
*   RESPECIFY                                                      0195
*    (REG14) UNRSTD;                /*                       @ZA16816*/
*   RESPECIFY                                                      0196
*    (REG15) RSTD;                  /*                       @ZA16816*/
*   REG15=4;                        /* INITIALIZE TO RC=4    @ZA16816*/
         LA    REG15,4                                             0197
*   DO WHILE RBN^=0;                /* EXAMINE EACH PFTE ON Q      0198
*                                                            @ZA16816*/
         B     @DE00198                                            0198
@DL00198 DS    0H                                                  0199
*     FRAMEPTR=PVTPFTP+RBN;         /* GET PFTE ADDRESS      @ZA16816*/
*                                                                  0199
         L     @14,PVTPFTP(,PVTPTR)                                0199
         LR    @11,RBN                                             0199
         ALR   @11,@14                                             0199
         LR    FRAMEPTR,@11                                        0199
*     /***************************************************************/
*     /*                                                             */
*     /* A PFTE IS STEALABLE IF IT IS (1) NOT FIXED, (2) NOT         */
*     /* ASSOCIATED WITH ANY PCB, (3) NOT ALLOCATED TO A V=R JOB, (4)*/
*     /* NOT DEFERRED RELEASED, (5) NOT A BAD PAGE, AND (6) NOT      */
*     /* OFFLINE INTERCEPTED                                 @ZA16816*/
*     /*                                                             */
*     /***************************************************************/
*                                                                  0200
*     RESPECIFY                                                    0200
*       PFTE BASED(FRAMEPTR);       /*                       @ZA16816*/
*     IF PFTFXCT=0&                 /* FIRST CHECK TO SEE IF @ZA16816*/
*         PFTPCBSI='0'B&            /* THE PFTE IS STEALABLE @ZA16816*/
*         PFTVRALC='0'B&            /*                       @ZA16816*/
*         PFTOFINT='0'B&            /* IF STEALABLE, THEN    @ZA16816*/
*         PFTBADPG='0'B&            /*                       @ZA16816*/
*         PFTDFRLS='0'B THEN        /*                       @ZA16816*/
         LH    @11,PFTFXCT(,FRAMEPTR)                              0201
         LTR   @11,@11                                             0201
         BNZ   @RF00201                                            0201
         TM    PFTPCBSI(FRAMEPTR),B'00001111'                      0201
         BNZ   @RF00201                                            0201
         TM    PFTDFRLS(FRAMEPTR),B'10000000'                      0201
         BNZ   @RF00201                                            0201
*       DO;                         /* DO FURTHER CHECKS     @ZA16816*/
*         IF PFTIRRG='0'B THEN      /* IF NOT AN IRRG FRAME, @ZA16816*/
         TM    PFTIRRG(FRAMEPTR),B'00010000'                       0203
         BNZ   @RF00203                                            0203
*           DO;                     /* ENSURE PAGE IS UNCHNGD      0204
*                                                            @ZA16816*/
*             RESPECIFY                                            0205
*              (REG0,                                              0205
*               REG1) RSTD;         /*                       @ZA16816*/
*             REG1=256*(FRAMEPTR-PVTPFTP);/* R1 =RSA 1ST 2K  @ZA16816*/
         LCR   @14,@14                                             0206
         ALR   @14,FRAMEPTR                                        0206
         SLA   @14,8                                               0206
         LR    REG1,@14                                            0206
*             GENERATE CODE REFS(CHBITMSK);                        0207
           ISK REG0,REG1          GET STG KEY FOR 1ST 2K
           N   REG0,CHBITMSK      ISOLATE THE CHANGE BIT - FIRST 2K
           BNZ PREFTST1           TO PREFTST1 IF BLOCK CHANGED
           LA  REG1,2048(REG1)    R1 =RSA OF 2ND 2K
           ISK REG0,REG1          GET STG KEY FOR 2ND 2K - SECOND 2K
           N   REG0,CHBITMSK      ISOLATE THE CHANGE BIT
           BZ  PREFTST2           TO PREFTST2 IF NOT CHANGED
*             RESPECIFY                                            0208
*              (REG0,                                              0208
*               REG1) UNRSTD;                                      0208
*PREFTST1:                          /* HERE IF CHANGED PAGE  @ZA16816*/
*             IF PFTPREF='1'B&      /* SAVE THE PFTE IF IT IS      0209
*                                                            @ZA16816*/
*                 RC=4&             /* A PREF, PASS=1,       @ZA16816*/
*                 PASS=1&           /* NONE SAVED PREVIOUSLY,      0209
*                                                            @ZA16816*/
*                 PVTRSMGM='0'B THEN/* AND NOT RSM GETMAIN   @ZA16816*/
PREFTST1 TM    PFTPREF(FRAMEPTR),B'00000100'                       0209
         BNO   @RF00209                                            0209
         CLI   RC(PVTPTR),4                                        0209
         BNE   @RF00209                                            0209
         C     PASS,@CF00038                                       0209
         BNE   @RF00209                                            0209
         TM    PVTRSMGM(PVTPTR),B'10000000'                        0209
         BNZ   @RF00209                                            0209
*               DO;                 /*                       @ZA16816*/
*                 SAVER0=FRAMEPTR;  /* SAVE PFTE PTR         @ZA16816*/
         ST    FRAMEPTR,SAVER0(,PVTPTR)                            0211
*                 SAVER1=ASCBPTR;   /* SAVE ASCB ADDRESS     @ZA16816*/
         ST    ASCBPTR,SAVER1(,PVTPTR)                             0212
*                 RC=8;             /* SET FOR RC=8          @ZA16816*/
         MVI   RC(PVTPTR),X'08'                                    0213
*               END;                /*                       @ZA16816*/
*             RBN=PFTFQPTR;         /* GET NEXT PFTE RBN AND @ZA16816*/
@RF00209 LH    @14,PFTFQPTR(,FRAMEPTR)                             0215
         N     @14,@CF01844                                        0215
         LR    RBN,@14                                             0215
*             GOTO LOOPEND;         /* CONTINUE THE SEARCH   @ZA16816*/
         B     LOOPEND                                             0216
*           END;                    /*                       @ZA16816*/
*PREFTST2:                          /* HERE IF PAGE UNCHANGED      0218
*                                                            @ZA16816*/
*                                                                  0218
*         /***********************************************************/
*         /*                                                         */
*         /* NOW HAVE A STEALABLE FRAME BACKING AN UNCHANGED PAGE. IT*/
*         /* IS ACCEPTABLE IF (1) IT IS A PREFERRED FRAME, OR (2)    */
*         /* PASS=2,3 OR 4 AND THE FRAME IS NON-V=R, OR (3) IT IS    */
*         /* PASS 3 OR 4 AND THE FRAME IS NOT V=R INTERCEPTED, OR (4)*/
*         /* IT IS PASS 4.                                   @ZA16816*/
*         /*                                                         */
*         /***********************************************************/
*                                                                  0218
*         IF PFTPREF='1'B×          /*                       @ZA16816*/
*             (PASS>1&(PFTVR='0'B×  /*                       @ZA16816*/
*             (PASS>2&(PFTVRINT='0'B×/*                      @ZA16816*/
*             PASS=4)))) THEN       /* IF ACCEPTABLE FRAME   @ZA16816*/
@RF00203 DS    0H                                                  0218
PREFTST2 TM    PFTPREF(FRAMEPTR),B'00000100'                       0218
         BO    @RT00218                                            0218
         C     PASS,@CF00038                                       0218
         BNH   @RF00218                                            0218
         TM    PFTVR(FRAMEPTR),B'00100000'                         0218
         BZ    @RT00218                                            0218
         C     PASS,@CF00217                                       0218
         BNH   @RF00218                                            0218
         TM    PFTVRINT(FRAMEPTR),B'01000000'                      0218
         BZ    @RT00218                                            0218
         C     PASS,@CF00085                                       0218
         BNE   @RF00218                                            0218
@RT00218 DS    0H                                                  0219
*           DO;                     /* TRY TO STEAL IT       @ZA16816*/
*             IF PFTIRRG='1'B THEN  /* IF AN IRRG FRAME THEN @ZA16816*/
         TM    PFTIRRG(FRAMEPTR),B'00010000'                       0220
         BNO   @RF00220                                            0220
*               DO;                 /* STEAL IT DIRECTLY     @ZA16816*/
*                 IF ASCBPTR^=0 THEN/* IF THERE IS AN ASCB,  @ZA16816*/
         LTR   ASCBPTR,ASCBPTR                                     0222
         BZ    @RF00222                                            0222
*                   DO;             /* DEQUEUE THE PFTE NOW  @ZA16816*/
*                     RESPECIFY                                    0224
*                      (REG0) RSTD; /*                       @ZA16816*/
*                     REG0=FRAMEPTR-PVTPFTP;/* GET RBN       @ZA16816*/
         LR    REG0,FRAMEPTR                                       0225
         SL    REG0,PVTPFTP(,PVTPTR)                               0225
*                     REG0=REG0×(65536*PFTNQN);/* INDICATE DEQ     0226
*                                                            @ZA16816*/
         O     REG0,@CF01839                                       0226
*                     RSMHDPTR=ASCBRSM;/* FROM RSMHD         @ZA16816*/
         L     RSMHDPTR,ASCBRSM(,ASCBPTR)                          0227
*                     CALL IEAVPFTE;/* DEQ THE PFTE          @ZA16816*/
         L     @15,PVTPFTE(,PVTPTR)                                0228
         BALR  @14,@15                                             0228
*                     RSMHDPTR=PSAAOLD->ASCBRSM;/* RESTORE RSMHD   0229
*                                                            @ZA16816*/
         L     @14,PSAAOLD                                         0229
         L     RSMHDPTR,ASCBRSM(,@14)                              0229
*                     RESPECIFY                                    0230
*                      (REG0) UNRSTD;/*                      @ZA16816*/
*                   END;            /*                       @ZA16816*/
*                                                                  0231
*                 /***************************************************/
*                 /*                                                 */
*                 /* INITIALIZE THE PFTE (IRRG) FOR USE BY THE CALLER*/
*                 /* AND INDICATE THAT THE PFTE WAS STOLEN.  @ZA16816*/
*                 /*                                                 */
*                 /***************************************************/
*                                                                  0232
*                 PFTIRRG='0'B;     /* CLEAR IRRG FLAG       @ZA16816*/
@RF00222 DS    0H                                                  0233
*                 PFTSTEAL='0'B;    /* CLEAR STEAL FLAG      @ZA16816*/
         NI    PFTIRRG(FRAMEPTR),B'11100111'                       0233
*                 PFTUIC=0;         /* INITIALIZE UIC        @ZA16816*/
         MVI   PFTUIC(FRAMEPTR),X'00'                              0234
*                 SAVER0=FRAMEPTR;  /* SAVE PTR TO PFTE      @ZA16816*/
         ST    FRAMEPTR,SAVER0(,PVTPTR)                            0235
*                 RC=0;             /* SET FINAL RC=0        @ZA16816*/
         MVI   RC(PVTPTR),X'00'                                    0236
*                 RBN=0;            /* KILL DO WHILE LOOP    @ZA16816*/
         SLR   RBN,RBN                                             0237
*                 REG15=0;          /* SET QSCAN RC TO 0     @ZA16816*/
         SLR   REG15,REG15                                         0238
*               END;                /* END OF IRRG PROCESSING      0239
*                                                            @ZA16816*/
*             ELSE                  /* IF FRAME NOT IRRG THEN      0240
*                                                            @ZA16816*/
*               DO;                 /* TRY TO STEAL IT.      @ZA16816*/
         B     @RC00220                                            0240
@RF00220 DS    0H                                                  0241
*                 RESPECIFY                                        0241
*                  (REG0,                                          0241
*                   REG1) RSTD;     /*                       @ZA16816*/
*                 REG1=PFTVBN*256;  /* R1=VSA FOR FINDPAGE   @ZA16816*/
         LH    REG1,PFTVBN(,FRAMEPTR)                              0242
         N     REG1,@CF01844                                       0242
         SLA   REG1,8                                              0242
*                 IF ASCBPTR^=0 THEN/* IF A FOREIGN LFQ, THEN      0243
*                                                            @ZA16816*/
         LTR   ASCBPTR,ASCBPTR                                     0243
         BZ    @RF00243                                            0243
*                   DO;             /* TRAS TO OTHER ADDR SP.      0244
*                                                            @ZA16816*/
*                     PVTTASID=ASCBASID;/* SET TO ASID FOR RCV     0245
*                                                            @ZA16816*/
         MVC   PVTTASID(2,PVTPTR),ASCBASID(ASCBPTR)                0245
*                     LCCAASID=ASCBASID;/* SET TO ASID FOR RTM     0246
*                                                            @ZA16816*/
         L     @14,LCCAPTR                                         0246
         XC    LCCAASID+2(2,@14),LCCAASID+2(@14)                   0246
         MVC   LCCAASID(2,@14),ASCBASID(ASCBPTR)                   0246
*                     GENERATE CODE REFS(ASCBSTOR);                0247
                LCTL 1,1,ASCBSTOR(ASCBPTR)  -----TRAS -----
*                     RSMHDPTR=ASCBRSM;/* GET RSMHD FOR FINDPAGE   0248
*                                                            @ZA16816*/
         L     RSMHDPTR,ASCBRSM(,ASCBPTR)                          0248
*                   END;            /*                       @ZA16816*/
*                 CALL IEAVFP2;     /* INVALIDATE THE PAGE   @ZA16816*/
@RF00243 L     @15,PVTPFP2(,PVTPTR)                                0250
         BALR  @14,@15                                             0250
*                 RSMHDPTR=PSAAOLD->ASCBRSM;/* RESET RSMHD PTR     0251
*                                                            @ZA16816*/
         L     @14,PSAAOLD                                         0251
         L     RSMHDPTR,ASCBRSM(,@14)                              0251
*                 IF REG15^=0 THEN  /* IF FINDPAGE FAILED,   @ZA16816*/
         SLR   @11,@11                                             0252
         CR    REG15,@11                                           0252
         BE    @RF00252                                            0252
*                   DO;             /* C0D AND TRY NEXT PFTE @ZA16816*/
*                     IF ASCBPTR^=0 THEN/* IF DID A TRAS, THEN     0254
*                                                            @ZA16816*/
         CR    ASCBPTR,@11                                         0254
         BE    @RF00254                                            0254
*                       DO;         /* TRAS BACK TO CURRENT  @ZA16816*/
*                         REG1=PSAAOLD;/* GET CURRENT ASCB   @ZA16816*/
         LR    REG1,@14                                            0256
*                         GENERATE CODE REFS(ASCBSTOR);            0257
                     LCTL 1,1,ASCBSTOR(REG1)  -----TRAS BACK-----
*                         LCCAASID=0;/* CLEAR RTM TRAS IND.  @ZA16816*/
         SLR   @14,@14                                             0258
         L     @11,LCCAPTR                                         0258
         ST    @14,LCCAASID(,@11)                                  0258
*                         PVTTASID=0;/* CLEAR RCV TRAS IND.  @ZA16816*/
         STH   @14,PVTTASID(,PVTPTR)                               0259
*                       END;        /*                       @ZA16816*/
*                     RCARCRD='01'X;/* SET REASON CODE       @ZA16816*/
@RF00254 L     @14,RCAPTR(,PVTPTR)                                 0261
         MVI   RCARCRD(@14),X'01'                                  0261
*                     GEN NOFLOWS SETS(REG1)(ABEND X'C0D',,,SYSTEM);
         ABEND X'C0D',,,SYSTEM
*                     RBN=PFTFQPTR; /* GET NEXT PFTE RBN     @ZA16816*/
         LH    @14,PFTFQPTR(,FRAMEPTR)                             0263
         N     @14,@CF01844                                        0263
         LR    RBN,@14                                             0263
*                     REG15=4;      /* INSURE RC STILL INITIALIZED 0264
*                                                            @ZA16816*/
         LA    REG15,4                                             0264
*                   END;            /* END FINDPAGE FAILURE  @ZA16816*/
*                 ELSE              /* SUCCESSFUL FINDPAGE   @ZA16816*/
*                   DO;             /* NOW INVALIDATE PAGE   @ZA16816*/
         B     @RC00252                                            0266
@RF00252 DS    0H                                                  0267
*                     REG1=REG0;    /* SET R1=PGTE ADDR      @ZA16816*/
         LR    REG1,REG0                                           0267
*                     CALL IEAVINV; /* INVALIDATE THE PAGE   @ZA16816*/
*                                                                  0268
         L     @15,PVTPINV(,PVTPTR)                                0268
         BALR  @14,@15                                             0268
*                     /***********************************************/
*                     /*                                             */
*                     /* PAGE IS INVALIDATED. NOW MUST RECHECK TO    */
*                     /* ENSURE PAGE IS STILL UNCHANGED. THIS IS     */
*                     /* NECESSARY IF MP                     @ZA16816*/
*                     /*                                             */
*                     /***********************************************/
*                                                                  0269
*                     REG15=256*(FRAMEPTR-PVTPFTP);/* RSA 1ST 2K   0269
*                                                            @ZA16816*/
         LR    REG15,FRAMEPTR                                      0269
         SL    REG15,PVTPFTP(,PVTPTR)                              0269
         SLA   REG15,8                                             0269
*                     GENERATE CODE REFS(CHBITMSK);                0270
                  ISK REG0,REG15       GET STG KEY FOR 1ST 2K BLOCK
                  N   REG0,CHBITMSK    ISOLATE THE CHANGE BIT - 1ST 2K
                  BNZ REVALID          TO REVALID IF BLOCK CHANGED
                  LA  REG15,2048(REG15) GET    RSA OF 2ND 2K BLOCK
                  ISK REG0,REG15       GET STG KEY FOR 2ND 2K BLOCK
                  N   REG0,CHBITMSK    ISOLATE THE CHANGE BIT - 2ND 2K
                  BZ  STOLEN           TO STOLEN IF 2ND 2K UNCHANGED
*REVALID:                                                          0271
*                     REG1->PGTPVM='0'B;/* REVALIDATE THE PAGE     0271
*                                                            @ZA16816*/
REVALID  NI    PGTPVM(REG1),B'11110111'                            0271
*                     IF ASCBPTR^=0 THEN/* IF DID A TRAS, THEN     0272
*                                                            @ZA16816*/
         LTR   ASCBPTR,ASCBPTR                                     0272
         BZ    @RF00272                                            0272
*                       DO;         /* TRAS BACK TO CURRENT  @ZA16816*/
*                         REG1=PSAAOLD;/* GET CURRENT ASCB   @ZA16816*/
         L     REG1,PSAAOLD                                        0274
*                         GENERATE CODE REFS(ASCBSTOR);            0275
                     LCTL 1,1,ASCBSTOR(REG1) -----TRAS BACK-----
*                         LCCAASID=0;/* CLEAR RTM TRAS IND.  @ZA16816*/
         SLR   @14,@14                                             0276
         L     @11,LCCAPTR                                         0276
         ST    @14,LCCAASID(,@11)                                  0276
*                         PVTTASID=0;/* CLEAR RCV TRAS IND.  @ZA16816*/
         STH   @14,PVTTASID(,PVTPTR)                               0277
*                       END;                                       0278
*                     RBN=FRAMEPTR-PVTPFTP;/* RESTORE ORIGINAL RBN 0279
*                                                            @ZA16816*/
@RF00272 LR    @14,FRAMEPTR                                        0279
         SL    @14,PVTPFTP(,PVTPTR)                                0279
         LR    RBN,@14                                             0279
*                     REG15=4;      /* INSURE RC STILL INITIALIZED 0280
*                                                            @ZA16816*/
         LA    REG15,4                                             0280
*                     GOTO LOOPEND; /* CONTINUE SEARCH WITH THE SAME
*                                      PFTE                  @ZA16816*/
         B     LOOPEND                                             0281
*STOLEN:                                                           0282
*                                                                  0282
*                     /***********************************************/
*                     /*                                             */
*                     /* NON-IRRG FRAME CAN BE STOLEN. IF FROM A     */
*                     /* FOREIGN LOCAL FRAME QUEUE, DEQUEUE THE PFTE */
*                     /* NOW.                                @ZA16816*/
*                     /*                                             */
*                     /***********************************************/
*                                                                  0282
*                     IF ASCBPTR^=0 THEN/* IF ASCB NOT ZERO, @ZA16816*/
STOLEN   LTR   ASCBPTR,ASCBPTR                                     0282
         BZ    @RF00282                                            0282
*                       DO;         /* TRAS BACK AND DEQ     @ZA16816*/
*                         REG1=PSAAOLD;/* GET CUR ASCB       @ZA16816*/
         L     REG1,PSAAOLD                                        0284
*                         GENERATE CODE REFS(ASCBSTOR);            0285
                    LCTL 1,1,ASCBSTOR(REG1) -----TRAS BACK-----
*                         LCCAASID=0;/* CLEAR RTM TRAS IND.  @ZA16816*/
         SLR   @14,@14                                             0286
         L     @11,LCCAPTR                                         0286
         ST    @14,LCCAASID(,@11)                                  0286
*                         PVTTASID=0;/* CLEAR RCV TRAS IND.  @ZA16816*/
         STH   @14,PVTTASID(,PVTPTR)                               0287
*                         REG0=FRAMEPTR-PVTPFTP;/* GET THE RBN     0288
*                                                            @ZA16816*/
         LR    REG0,FRAMEPTR                                       0288
         SL    REG0,PVTPFTP(,PVTPTR)                               0288
*                         REG0=REG0×(65536*PFTNQN);/* INDICATE DEQ 0289
*                                                            @ZA16816*/
         O     REG0,@CF01839                                       0289
*                         RSMHDPTR=ASCBRSM;/* FROM RSMHD     @ZA16816*/
         L     RSMHDPTR,ASCBRSM(,ASCBPTR)                          0290
*                         CALL IEAVPFTE;/* DEQ THE PFTE      @ZA16816*/
         L     @15,PVTPFTE(,PVTPTR)                                0291
         BALR  @14,@15                                             0291
*                         RSMHDPTR=PSAAOLD->ASCBRSM;/* RESTORE PTR 0292
*                                                            @ZA16816*/
         L     @14,PSAAOLD                                         0292
         L     RSMHDPTR,ASCBRSM(,@14)                              0292
*                       END;        /*                       @ZA16816*/
*                                                                  0293
*                     /***********************************************/
*                     /*                                             */
*                     /* INITIALIZE THE PFTE (NON-IRREG) FOR USE BY  */
*                     /* THE CALLER AND INDICATE THAT THE PFTE WAS   */
*                     /* STOLEN.                             @ZA16816*/
*                     /*                                             */
*                     /***********************************************/
*                                                                  0294
*                     PFTSTEAL='0'B;/* CLEAR THE STEAL FLAG  @ZA16816*/
@RF00282 NI    PFTSTEAL(FRAMEPTR),B'11110111'                      0294
*                     PFTUIC=0;     /* INITIALIZE UIC        @ZA16816*/
         MVI   PFTUIC(FRAMEPTR),X'00'                              0295
*                     SAVER0=FRAMEPTR;/* SAVE PTR TO PFTE    @ZA16816*/
         ST    FRAMEPTR,SAVER0(,PVTPTR)                            0296
*                     RC=0;         /* SET RINAL RC=0        @ZA16816*/
         MVI   RC(PVTPTR),X'00'                                    0297
*                     RBN=0;        /* KILL DO WHILE LOOP    @ZA16816*/
         SLR   RBN,RBN                                             0298
*                     REG15=0;      /* SET QSCAN RC TO ZERO  @ZA16816*/
         SLR   REG15,REG15                                         0299
*                   END;            /* END SUCCESSFUL FP     @ZA16816*/
*               END;                /* END NON-IRREG PROCESS @ZA16816*/
*           END;                    /* END ACCEPTABLE FRAME  @ZA16816*/
*         ELSE                      /* IF NOT ACCEPTABLE THEN      0303
*                                                            @ZA16816*/
*           RBN=PFTFQPTR;           /* GET NEXT PFTE RBN     @ZA16816*/
         B     @RC00218                                            0303
@RF00218 LH    @14,PFTFQPTR(,FRAMEPTR)                             0303
         N     @14,@CF01844                                        0303
         LR    RBN,@14                                             0303
*       END;                        /* END STEALABLE FRAME   @ZA16816*/
*     ELSE                          /* IF NOT STEALABLE THEN @ZA16816*/
*       RBN=PFTFQPTR;               /* GET THE NEXT PFTE RBN @ZA16816*/
         B     @RC00201                                            0305
@RF00201 LH    @14,PFTFQPTR(,FRAMEPTR)                             0305
         N     @14,@CF01844                                        0305
         LR    RBN,@14                                             0305
*LOOPEND:                                                          0306
*   END;                            /* END OF DO WHILE       @ZA16816*/
@RC00201 DS    0H                                                  0306
LOOPEND  DS    0H                                                  0306
@DE00198 LTR   RBN,RBN                                             0306
         BNZ   @DL00198                                            0306
*   GENERATE CODE(BR REG6);         /* RETURN TO CALLER      @ZA16816*/
         BR REG6
*   RESPECIFY                                                      0308
*     PFTE BASED(PFTEPTR);          /*                       @ZA16816*/
*   RESPECIFY                                                      0309
*    (REG6,                                                        0309
*     FRAMEPTR,                                                    0309
*     PASS,                                                        0309
*     ASCBPTR,                                                     0309
*     REG15) UNRSTD;                /*                       @ZA16816*/
*   END;                            /* END OF QSCAN ROUTINE  @ZA16816*/
@EL00002 DS    0H                                                  0310
@EF00002 DS    0H                                                  0310
@ER00002 BR    @14                                                 0310
*   END IEAVPREF                                                   0311
*                                                                  0311
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */
*/*%INCLUDE SYSLIB  (IHAPVT  )                                       */
*/*%INCLUDE SYSLIB  (IHARSMHD)                                       */
*/*%INCLUDE SYSLIB  (IHAPFTE )                                       */
*/*%INCLUDE SYSLIB  (IHAPGTE )                                       */
*/*%INCLUDE SYSLIB  (IHAXPTE )                                       */
*/*%INCLUDE SYSLIB  (CVT     )                                       */
*/*%INCLUDE SYSLIB  (IHAPSA  )                                       */
*/*%INCLUDE SYSLIB  (IHARCA  )                                       */
*/*%INCLUDE SYSLIB  (IHALCCA )                                       */
*/*%INCLUDE SYSLIB  (IHAASCB )                                       */
*/*%INCLUDE SYSLIB  (IHAPCBR )                                       */
*                                                                  0311
*       ;                                                          0311
@DATA    DS    0H
         DS    0F
         DS    0F
@CF00038 DC    F'1'
@CF00217 DC    F'2'
@CF00187 DC    F'3'
@CF00085 DC    F'4'
@CF00060 DC    F'16'
@CF01839 DC    F'16711680'
@CF01805 DC    XL4'FFFFFFFF'
@CF01844 DC    XL4'0000FFFF'
@CV01797 DC    V(IEAVPRSS)
         DS    0D
@CB01815 DC    X'00000004'
         DS    CL4
CHBITMSK DC    X'00000002'
IEAVPREF CSECT
PREFMSG WTO 'IEA988I PREFERRED AREA HAS EXPANDED. RECONFIGURABILITY MAYY
                BE IMPAIRED.',ROUTCDE=(2),DESC=(4),MF=L
IEAVPREF CSECT
@00      EQU   00                      EQUATES FOR REGISTERS 0-15
@01      EQU   01
@02      EQU   02
@03      EQU   03
@04      EQU   04
@05      EQU   05
@06      EQU   06
@07      EQU   07
@08      EQU   08
@09      EQU   09
@10      EQU   10
@11      EQU   11
@12      EQU   12
@13      EQU   13
@14      EQU   14
@15      EQU   15
PVTPTR   EQU   @03
RSMHDPTR EQU   @02
PFTEPTR  EQU   @04
ASCBPTR  EQU   @09
PCBRPTR  EQU   @09
REG0     EQU   @00
REG1     EQU   @01
REG6     EQU   @06
FRAMEPTR EQU   @07
RBN      EQU   @07
PASS     EQU   @08
ENDPFTE  EQU   @09
MASK     EQU   @09
MSGPTR   EQU   @10
MSGLEN   EQU   @11
BASEREG  EQU   @12
REG13    EQU   @13
REG14    EQU   @14
REG15    EQU   @15
REG10    EQU   @10
REG11    EQU   @11
REG12    EQU   @12
REG2     EQU   @02
REG3     EQU   @03
REG4     EQU   @04
REG5     EQU   @05
REG8     EQU   @08
SAVEPFTP EQU   @06
VBN      EQU   @05
CVTPTR   EQU   16
PSA      EQU   0
FLCRNPSW EQU   PSA
FLCROPSW EQU   PSA+8
FLCICCW2 EQU   PSA+16
PSAEEPSW EQU   PSA+132
PSAESPSW EQU   PSA+136
FLCSVILC EQU   PSAESPSW+1
PSAEPPSW EQU   PSA+140
FLCPIILC EQU   PSAEPPSW+1
FLCPICOD EQU   PSAEPPSW+2
PSAPICOD EQU   FLCPICOD+1
FLCTEA   EQU   PSAEPPSW+4
FLCPER   EQU   PSA+152
FLCMCLA  EQU   PSA+168
FLCIOEL  EQU   FLCMCLA+4
FLCIOA   EQU   FLCMCLA+16
FLCFSA   EQU   FLCMCLA+80
PSACPULA EQU   PSA+518
PSALCCAV EQU   PSA+528
PSAAOLD  EQU   PSA+548
PSASUPER EQU   PSA+552
PSASUP1  EQU   PSASUPER
PSASUP2  EQU   PSASUPER+1
PSASUP3  EQU   PSASUPER+2
PSASUP4  EQU   PSASUPER+3
PSACLHT  EQU   PSA+640
PSALKSA  EQU   PSA+696
PSAHLHI  EQU   PSA+760
PSALITA  EQU   PSA+764
PSADSSFL EQU   PSA+836
PSADSSF1 EQU   PSADSSFL
PSADSSF3 EQU   PSADSSFL+2
PSADSSF4 EQU   PSADSSFL+3
PSARSVT  EQU   PSA+896
PVT      EQU   0
PVTFLAG1 EQU   PVT
PVTPMSG  EQU   PVTFLAG1
PVTFLAG2 EQU   PVT+1
PVTRSMGM EQU   PVTFLAG2
PVTPFTP  EQU   PVT+12
PVTVROOT EQU   PVT+40
PVTRSUS  EQU   PVT+44
PVTPRCA  EQU   PVT+52
PVTPFTE  EQU   PVT+108
PVTPFP2  EQU   PVT+116
PVTPVRIN EQU   PVT+140
PVTPINV  EQU   PVT+172
PVTQS    EQU   PVT+304
PVTCFQF  EQU   PVTQS+8
PVTRSBQF EQU   PVTQS+16
PVTWSAX  EQU   PVT+344
PVTWSA14 EQU   PVTWSAX+968
PVTWSA16 EQU   PVTWSAX+1112
PVTPCBQS EQU   PVT+1852
PVTTASID EQU   PVT+1942
RSMHD    EQU   0
RSMFLG1  EQU   RSMHD+12
RSMQS    EQU   RSMHD+20
RSMLFQ   EQU   RSMQS
RSMLFQF  EQU   RSMLFQ
RSMLSQA  EQU   RSMQS+4
RSMLIOQ  EQU   RSMQS+8
PFTE     EQU   0
PFTPGID  EQU   PFTE
PFTVBN   EQU   PFTPGID+2
PFTQPTRS EQU   PFTE+4
PFTFQPTR EQU   PFTQPTRS
PFTFXCT  EQU   PFTE+8
PFTFLAGS EQU   PFTE+12
PFTFLAG1 EQU   PFTFLAGS
PFTVRINT EQU   PFTFLAG1
PFTPCBSI EQU   PFTFLAG1
PFTBADPG EQU   PFTFLAG1
PFTVRALC EQU   PFTFLAG1
PFTOFINT EQU   PFTFLAG1
PFTFLAG2 EQU   PFTFLAGS+1
PFTDFRLS EQU   PFTFLAG2
PFTVR    EQU   PFTFLAG2
PFTIRRG  EQU   PFTFLAG2
PFTSTEAL EQU   PFTFLAG2
PFTPREF  EQU   PFTFLAG2
PFTUIC   EQU   PFTE+15
PGTPTE   EQU   0
PGTRSA   EQU   PGTPTE
PGTBITS  EQU   PGTRSA+1
PGTPVM   EQU   PGTBITS
PTEPTR   EQU   0
XPTE     EQU   0
XPTFLAGS EQU   XPTE+2
XPTFLAG2 EQU   XPTE+3
XPTLPID  EQU   XPTE+4
XPTLGN   EQU   XPTLPID
XPTLPN   EQU   XPTLPID+4
XPTEPTR  EQU   0
CVTMAP   EQU   0
CVTDAR   EQU   CVTMAP+72
CVTFLGS1 EQU   CVTDAR
CVTDCB   EQU   CVTMAP+116
CVTIOQET EQU   CVTMAP+120
CVTIERLC EQU   CVTMAP+144
CVTHEAD  EQU   CVTMAP+160
CVTSV76C EQU   CVTHEAD
CVTOPTA  EQU   CVTMAP+182
CVTOPTB  EQU   CVTMAP+183
CVTGTF   EQU   CVTMAP+236
CVTGTFST EQU   CVTGTF
CVTGTFS  EQU   CVTGTFST
CVTSTATE EQU   CVTGTFST
CVTTMODE EQU   CVTGTFST
CVTFORM  EQU   CVTGTFST
CVTAQAVT EQU   CVTMAP+240
CVTTCMFG EQU   CVTAQAVT
CVTVOLM2 EQU   CVTMAP+244
CVTTATA  EQU   CVTVOLM2
CVTTSKS  EQU   CVTTATA
CVTVOLF2 EQU   CVTTSKS
CVTTAT   EQU   CVTTATA+1
CVTATER  EQU   CVTMAP+248
CVTEXT1  EQU   CVTMAP+252
CVTPURG  EQU   CVTMAP+260
CVTQMSG  EQU   CVTMAP+268
CVTDMSR  EQU   CVTMAP+272
CVTRSV37 EQU   CVTDMSR
CVTDMSRF EQU   CVTRSV37
CVTERPV  EQU   CVTMAP+316
CVTINTLA EQU   CVTMAP+320
CVTAPF   EQU   CVTMAP+324
CVTEXT2  EQU   CVTMAP+328
CVTHJES  EQU   CVTMAP+332
CVTPGSIA EQU   CVTMAP+348
CVTA1F1  EQU   CVTMAP+356
CVTSYSK  EQU   CVTMAP+357
CVTVOLM1 EQU   CVTMAP+380
CVTVOLF1 EQU   CVTVOLM1
CVTXTNT1 EQU   0
CVTXTNT2 EQU   0
CVTDSSV  EQU   CVTXTNT2
CVTFLGBT EQU   CVTXTNT2+5
CVTQID   EQU   CVTXTNT2+24
CVTRV400 EQU   CVTXTNT2+52
CVTRV409 EQU   CVTXTNT2+53
CVTATCVT EQU   CVTXTNT2+64
CVTRV429 EQU   CVTXTNT2+84
CVTRV438 EQU   CVTXTNT2+85
CVTRV457 EQU   CVTXTNT2+112
CVTRV466 EQU   CVTXTNT2+113
CVTFIX   EQU   0
CVTRELNO EQU   CVTFIX+252
RCA      EQU   0
RCANAME7 EQU   RCA+8
RCAFLAGS EQU   RCA+10
RCADISP  EQU   RCAFLAGS
RCARCRD  EQU   RCA+11
RCANAMES EQU   RCA+12
RCANAME1 EQU   RCANAMES
RCANAME2 EQU   RCANAMES+1
RCANAME3 EQU   RCANAMES+2
RCANAME4 EQU   RCANAMES+3
RCANAME5 EQU   RCANAMES+4
RCANAME6 EQU   RCANAMES+5
LCCA     EQU   0
LCCAIHRC EQU   LCCA+520
LCCAIHR1 EQU   LCCAIHRC
LCCAIHR2 EQU   LCCAIHRC+1
LCCAIHR3 EQU   LCCAIHRC+2
LCCAIHR4 EQU   LCCAIHRC+3
LCCASPIN EQU   LCCA+524
LCCASPN1 EQU   LCCASPIN
LCCASPN2 EQU   LCCASPIN+1
LCCASPN3 EQU   LCCASPIN+2
LCCASPN4 EQU   LCCASPIN+3
LCCADSF1 EQU   LCCA+540
LCCADSF2 EQU   LCCA+541
LCCASPSA EQU   LCCA+544
LCCACRFL EQU   LCCA+692
LCCACREX EQU   LCCA+693
LCCALKFG EQU   LCCA+694
LCCASRBF EQU   LCCA+720
LCCAASID EQU   LCCA+732
ASCB     EQU   0
ASCBFWDP EQU   ASCB+4
ASCBSUPC EQU   ASCB+16
ASCBASID EQU   ASCB+36
ASCBSTOR EQU   ASCB+44
ASCBRSM  EQU   ASCB+52
ASCBRSMF EQU   ASCBRSM
ASCBFW1  EQU   ASCB+100
ASCBRCTF EQU   ASCBFW1+2
ASCBFLG1 EQU   ASCBFW1+3
ASCBDSP1 EQU   ASCB+114
ASCBFLG2 EQU   ASCB+115
ASCBLKGP EQU   ASCB+128
ASCBSRQ  EQU   ASCB+180
ASCBSRQ1 EQU   ASCBSRQ
ASCBSRQ2 EQU   ASCBSRQ+1
ASCBSRQ3 EQU   ASCBSRQ+2
ASCBSRQ4 EQU   ASCBSRQ+3
PCBR     EQU   0
PCBRTCB  EQU   PCBR
PCBRFLAG EQU   PCBRTCB
PCBRINT  EQU   PCBRFLAG
PCBRFAIL EQU   PCBRFLAG
PCBRWRK1 EQU   PCBR+20
PCBRWRK2 EQU   PCBR+24
PCBRWRK3 EQU   PCBR+28
IEAVPFTE EQU   0
IEAVFP2  EQU   0
IEAVINV  EQU   0
IEAVEQRI EQU   0
PGTEND   EQU   0
CVTS01   EQU   CVTPGSIA
CVTLPDIA EQU   CVTS01+12
CVTDIRST EQU   CVTLPDIA
CVTSLIDA EQU   CVTS01+24
CVTCTLFG EQU   CVTS01+50
CVTASCBH EQU   CVTS01+216
CVTRV210 EQU   CVTS01+424
CVTRV219 EQU   CVTS01+425
CVTRV228 EQU   CVTS01+426
CVTRV237 EQU   CVTS01+427
CVTMFRTR EQU   CVTS01+452
CVTRV262 EQU   CVTS01+468
CVTRV271 EQU   CVTS01+469
CVTRV280 EQU   CVTS01+470
CVTRV289 EQU   CVTS01+471
CVTGSDA  EQU   CVTS01+600
PSARSVTE EQU   PSARSVT
RCAPTR   EQU   PVTPRCA
LCCAPTR  EQU   PSALCCAV
MYSAVE   EQU   PVTWSA16
SAVER0   EQU   MYSAVE
SAVER1   EQU   MYSAVE+4
SAVER15  EQU   MYSAVE+60
RC       EQU   SAVER15+3
FLC      EQU   PSA
*                                      START UNREFERENCED COMPONENTS
@NM00042 EQU   SAVER15
THEREGS  EQU   MYSAVE+8
PSARSAV  EQU   PSARSVTE+60
PSARSTK  EQU   PSARSVTE+56
PSAESAV3 EQU   PSARSVTE+52
PSAESTK3 EQU   PSARSVTE+48
PSAESAV2 EQU   PSARSVTE+44
PSAESTK2 EQU   PSARSVTE+40
PSAESAV1 EQU   PSARSVTE+36
PSAESTK1 EQU   PSARSVTE+32
PSAPSAV  EQU   PSARSVTE+28
PSAPSTK  EQU   PSARSVTE+24
PSAMSAV  EQU   PSARSVTE+20
PSAMSTK  EQU   PSARSVTE+16
PSASSAV  EQU   PSARSVTE+12
PSASSTK  EQU   PSARSVTE+8
PSANSTK  EQU   PSARSVTE+4
PSACSTK  EQU   PSARSVTE
CVTRV628 EQU   CVTS01+728
CVTRV627 EQU   CVTS01+724
CVTRV626 EQU   CVTS01+720
CVTRV625 EQU   CVTS01+716
CVTRV624 EQU   CVTS01+712
CVTRV623 EQU   CVTS01+708
CVTRV622 EQU   CVTS01+704
CVTRV621 EQU   CVTS01+700
CVTIHASU EQU   CVTS01+696
CVTSUSP  EQU   CVTS01+692
CVTT6SVC EQU   CVTS01+688
CVTCDAL  EQU   CVTS01+684
CVTTCTL  EQU   CVTS01+680
CVTRSUME EQU   CVTS01+676
CVTJTERM EQU   CVTS01+672
CVTASMRM EQU   CVTS01+668
CVTTCASP EQU   CVTS01+664
CVT0PT03 EQU   CVTS01+660
CVT0PT0E EQU   CVTS01+656
CVTRV609 EQU   CVTS01+652
CVTCGK   EQU   CVTS01+648
CVTRAC   EQU   CVTS01+644
CVTHSM   EQU   CVTS01+640
CVTRV605 EQU   CVTS01+636
CVTRV604 EQU   CVTS01+632
CVTEFF02 EQU   CVTS01+628
CVTCBBR  EQU   CVTS01+624
CVTSSCR  EQU   CVTS01+620
CVTEVENT EQU   CVTS01+616
CVTCRCA  EQU   CVTS01+612
CVTTPIO  EQU   CVTS01+608
CVTADV   EQU   CVTS01+604
CVTGSDAB EQU   CVTGSDA
CVTQV3   EQU   CVTS01+596
CVTQV2   EQU   CVTS01+592
CVTQV1   EQU   CVTS01+588
CVTRPT   EQU   CVTS01+584
CVTSSRB  EQU   CVTS01+580
CVTCSDRL EQU   CVTS01+576
CVTEXP1  EQU   CVTS01+572
CVTRMPMT EQU   CVTS01+568
CVTRMPTT EQU   CVTS01+564
CVTVPSA  EQU   CVTS01+560
CVTVSTOP EQU   CVTS01+556
CVTGTFR8 EQU   CVTS01+552
CVTQUIT  EQU   CVTS01+548
CVTVACR  EQU   CVTS01+544
CVTWTCB  EQU   CVTS01+540
CVTSTPRS EQU   CVTS01+536
CVT0PT02 EQU   CVTS01+532
CVTDARCM EQU   CVTS01+528
CVTIRECM EQU   CVTS01+524
CVTJRECM EQU   CVTS01+520
CVTVEMS0 EQU   CVTS01+516
CVTSPFRR EQU   CVTS01+512
CVTRLSTG EQU   CVTS01+508
CVT0TC0A EQU   CVTS01+504
CVTGMBR  EQU   CVTS01+500
CVTLFRM  EQU   CVTS01+496
CVTRMBR  EQU   CVTS01+492
CVTVIOP  EQU   CVTS01+488
CVTRV307 EQU   CVTS01+486
CVTRV306 EQU   CVTS01+484
CVTRV305 EQU   CVTS01+482
CVTRV304 EQU   CVTS01+480
CVTRV303 EQU   CVTS01+478
CVTRV302 EQU   CVTS01+476
CVTTRCA  EQU   CVTS01+472
CVTRV297 EQU   CVTRV289
CVTRV296 EQU   CVTRV289
CVTRV295 EQU   CVTRV289
CVTRV294 EQU   CVTRV289
CVTRV293 EQU   CVTRV289
CVTRV292 EQU   CVTRV289
CVTRV291 EQU   CVTRV289
CVTRV290 EQU   CVTRV289
CVTRV288 EQU   CVTRV280
CVTRV287 EQU   CVTRV280
CVTRV286 EQU   CVTRV280
CVTRV285 EQU   CVTRV280
CVTRV284 EQU   CVTRV280
CVTRV283 EQU   CVTRV280
CVTRV282 EQU   CVTRV280
CVTRV281 EQU   CVTRV280
CVTRV279 EQU   CVTRV271
CVTRV278 EQU   CVTRV271
CVTRV277 EQU   CVTRV271
CVTRV276 EQU   CVTRV271
CVTRV275 EQU   CVTRV271
CVTRV274 EQU   CVTRV271
CVTRV273 EQU   CVTRV271
CVTRV272 EQU   CVTRV271
CVTRV270 EQU   CVTRV262
CVTRV269 EQU   CVTRV262
CVTRV268 EQU   CVTRV262
CVTRV267 EQU   CVTRV262
CVTRV266 EQU   CVTRV262
CVTRV265 EQU   CVTRV262
CVTRV264 EQU   CVTRV262
CVTRV263 EQU   CVTRV262
CVTVFP   EQU   CVTS01+464
CVTVSI   EQU   CVTS01+460
CVTVPSIB EQU   CVTS01+456
CVTMFACT EQU   CVTMFRTR
CVTMFCTL EQU   CVTS01+448
CVTPVBP  EQU   CVTS01+444
CVTPWI   EQU   CVTS01+440
CVTRV254 EQU   CVTS01+438
CVTRV253 EQU   CVTS01+436
CVTRV252 EQU   CVTS01+434
CVTRV251 EQU   CVTS01+433
CVTRV250 EQU   CVTS01+432
CVTRV249 EQU   CVTS01+431
CVTRV248 EQU   CVTS01+430
CVTRV247 EQU   CVTS01+429
CVTRV246 EQU   CVTS01+428
CVTRV245 EQU   CVTRV237
CVTRV244 EQU   CVTRV237
CVTRV243 EQU   CVTRV237
CVTRV242 EQU   CVTRV237
CVTRV241 EQU   CVTRV237
CVTRV240 EQU   CVTRV237
CVTRV239 EQU   CVTRV237
CVTRV238 EQU   CVTRV237
CVTRV236 EQU   CVTRV228
CVTRV235 EQU   CVTRV228
CVTRV234 EQU   CVTRV228
CVTRV233 EQU   CVTRV228
CVTRV232 EQU   CVTRV228
CVTRV231 EQU   CVTRV228
CVTRV230 EQU   CVTRV228
CVTRV229 EQU   CVTRV228
CVTRV227 EQU   CVTRV219
CVTRV226 EQU   CVTRV219
CVTRV225 EQU   CVTRV219
CVTRV224 EQU   CVTRV219
CVTRV223 EQU   CVTRV219
CVTRV222 EQU   CVTRV219
CVTRV221 EQU   CVTRV219
CVTRV220 EQU   CVTRV219
CVTRV218 EQU   CVTRV210
CVTRV217 EQU   CVTRV210
CVTRV216 EQU   CVTRV210
CVTRV215 EQU   CVTRV210
CVTRV214 EQU   CVTRV210
CVTRV213 EQU   CVTRV210
CVTRV212 EQU   CVTRV210
CVTRV211 EQU   CVTRV210
CVTLCCAT EQU   CVTS01+420
CVTPCCAT EQU   CVTS01+416
CVTIPCRP EQU   CVTS01+412
CVTIPCRI EQU   CVTS01+408
CVTIPCDS EQU   CVTS01+404
CVTAIDVT EQU   CVTS01+400
CVTSSAP  EQU   CVTS01+396
CVTEHCIR EQU   CVTS01+392
CVTEHDEF EQU   CVTS01+388
CVTDAIR  EQU   CVTS01+384
CVTPERFM EQU   CVTS01+380
CVT044R2 EQU   CVTS01+376
CVTFETCH EQU   CVTS01+372
CVTRSTWD EQU   CVTS01+368
CVTSPOST EQU   CVTS01+364
CVTIOBP  EQU   CVTS01+360
CVTASMVT EQU   CVTS01+356
CVTRECRQ EQU   CVTS01+352
CVTWSAC  EQU   CVTS01+348
CVTRV149 EQU   CVTS01+344
CVTWSAL  EQU   CVTS01+340
CVTSPSA  EQU   CVTS01+336
CVTGLMN  EQU   CVTS01+332
CVTVEAC0 EQU   CVTS01+328
CVT062R1 EQU   CVTS01+324
CVTRPOST EQU   CVTS01+320
CVTDQIQE EQU   CVTS01+316
CVTCSD   EQU   CVTS01+312
CVTLKRMA EQU   CVTS01+308
CVTRSPIE EQU   CVTS01+304
CVTRENQ  EQU   CVTS01+300
CVTLQCB  EQU   CVTS01+296
CVTFQCB  EQU   CVTS01+292
CVTQCS01 EQU   CVTS01+288
CVTAPFT  EQU   CVTS01+284
CVTPARRL EQU   CVTS01+280
CVTVWAIT EQU   CVTS01+276
CVTGSPL  EQU   CVTS01+272
CVTLSMQ  EQU   CVTS01+268
CVTGSMQ  EQU   CVTS01+264
CVTEXPRO EQU   CVTS01+260
CVTOPCTP EQU   CVTS01+256
CVTSIC   EQU   CVTS01+252
CVTTPIOS EQU   CVTS01+248
CVTRTMS  EQU   CVTS01+244
CVTSDBF  EQU   CVTS01+240
CVTSCBP  EQU   CVTS01+236
CVTSDMP  EQU   CVTS01+232
CVTSV60  EQU   CVTS01+228
CVTRTMCT EQU   CVTS01+224
CVTASCBL EQU   CVTS01+220
CVTGDA   EQU   CVTS01+212
CVTASVT  EQU   CVTS01+208
CVTVVMDI EQU   CVTS01+204
CVTAQTOP EQU   CVTS01+200
CVTIOSCS EQU   CVTS01+196
CVTSDRM  EQU   CVTS01+192
CVTOPTE  EQU   CVTS01+188
CVTSTXU  EQU   CVTS01+184
CVTQUIS  EQU   CVTS01+180
CVTPARS  EQU   CVTS01+176
CVTS1EE  EQU   CVTS01+172
CVTFRAS  EQU   CVTS01+168
CVTQSAS  EQU   CVTS01+164
CVTCRAS  EQU   CVTS01+160
CVTCRMN  EQU   CVTS01+156
CVTDELCP EQU   CVTS01+152
CVTFRECL EQU   CVTS01+148
CVTGETCL EQU   CVTS01+144
CVTBLDCP EQU   CVTS01+140
CVTAUTHL EQU   CVTS01+136
CVTSCAN  EQU   CVTS01+132
CVTRV144 EQU   CVTS01+130
CVTMAXMP EQU   CVTS01+128
CVTSTCK  EQU   CVTS01+124
CVTRV139 EQU   CVTS01+123
CVTDSSAC EQU   CVTS01+122
CVTRV513 EQU   CVTS01+121
CVTIOSPL EQU   CVTS01+120
CVTPTGT  EQU   CVTS01+116
CVTCSPIE EQU   CVTS01+112
CVTSMFEX EQU   CVTS01+108
CVTOLT0A EQU   CVTS01+104
CVTSRBRT EQU   CVTS01+100
CVTPUTL  EQU   CVTS01+96
CVTASCRL EQU   CVTS01+92
CVTASCRF EQU   CVTS01+88
CVTRV326 EQU   CVTS01+84
CVTRV325 EQU   CVTS01+80
CVTRV324 EQU   CVTS01+76
CVT0VL01 EQU   CVTS01+72
CVTSHRVM EQU   CVTS01+68
CVTRV332 EQU   CVTS01+64
CVTTAS   EQU   CVTS01+60
CVTRSCN  EQU   CVTS01+56
CVTTRAC2 EQU   CVTS01+54
CVTTRACE EQU   CVTS01+52
CVTAPG   EQU   CVTS01+51
CVTSDTRC EQU   CVTCTLFG
CVTGTRCE EQU   CVTCTLFG
CVTNOMP  EQU   CVTCTLFG
CVTRSV79 EQU   CVTCTLFG
CVTDSTAT EQU   CVTCTLFG
CVTRSV78 EQU   CVTCTLFG
CVTRV333 EQU   CVTCTLFG
CVTRV323 EQU   CVTCTLFG
CVTSPVLK EQU   CVTS01+49
CVTRSV77 EQU   CVTS01+48
CVTRV331 EQU   CVTS01+44
CVTRV330 EQU   CVTS01+40
CVTRV329 EQU   CVTS01+36
CVTRV328 EQU   CVTS01+32
CVTRV322 EQU   CVTS01+28
CVTSLID  EQU   CVTSLIDA+1
CVTSYLK  EQU   CVTSLIDA
CVTRV321 EQU   CVTS01+20
CVTRV320 EQU   CVTS01+16
CVTLPDIR EQU   CVTLPDIA+1
CVTRSV69 EQU   CVTDIRST
CVTRSV68 EQU   CVTDIRST
CVTRSV67 EQU   CVTDIRST
CVTRSV66 EQU   CVTDIRST
CVTRSV65 EQU   CVTDIRST
CVTRSV64 EQU   CVTDIRST
CVTRSV63 EQU   CVTDIRST
CVTDICOM EQU   CVTDIRST
CVTPVTP  EQU   CVTS01+8
CVTLPDSR EQU   CVTS01+4
CVTGETL  EQU   CVTS01
PCBRWRKB EQU   PCBR+60
PCBRWRKA EQU   PCBR+56
PCBRWRK9 EQU   PCBR+52
PCBRWRK8 EQU   PCBR+48
PCBRWRK7 EQU   PCBR+44
PCBRWRK6 EQU   PCBR+40
PCBRWRK5 EQU   PCBR+36
PCBRWRK4 EQU   PCBR+32
PCBRRSV1 EQU   PCBR+18
PCBRCNT  EQU   PCBR+16
PCBRASCB EQU   PCBR+12
PCBRECB  EQU   PCBR+8
PCBRGOTO EQU   PCBR+4
PCBRTCBA EQU   PCBRTCB+1
PCBRPOF  EQU   PCBRFLAG
PCBRFECB EQU   PCBRFLAG
PCBRLOAD EQU   PCBRFLAG
PCBRFPCB EQU   PCBRFLAG
PCBRPB   EQU   PCBRFLAG
PCBRETRY EQU   PCBRFLAG
ASCBEND  EQU   ASCB+208
ASCBSRBT EQU   ASCB+200
ASCBSWTL EQU   ASCB+196
ASCBRS14 EQU   ASCB+195
ASCBSMCT EQU   ASCB+194
ASCBRS12 EQU   ASCB+192
ASCBPCTT EQU   ASCB+188
ASCBVGTT EQU   ASCB+184
ASCBRV43 EQU   ASCBSRQ4
ASCBRV42 EQU   ASCBSRQ4
ASCBRV41 EQU   ASCBSRQ4
ASCBRV40 EQU   ASCBSRQ4
ASCBRV39 EQU   ASCBSRQ4
ASCBRV38 EQU   ASCBSRQ4
ASCBRV37 EQU   ASCBSRQ4
ASCBRV36 EQU   ASCBSRQ4
ASCBRV35 EQU   ASCBSRQ3
ASCBRV34 EQU   ASCBSRQ3
ASCBRV33 EQU   ASCBSRQ3
ASCBRV32 EQU   ASCBSRQ3
ASCBRV31 EQU   ASCBSRQ3
ASCBRV30 EQU   ASCBSRQ3
ASCBRV29 EQU   ASCBSRQ3
ASCBRV28 EQU   ASCBSRQ3
ASCBRV27 EQU   ASCBSRQ2
ASCBRV26 EQU   ASCBSRQ2
ASCBRV25 EQU   ASCBSRQ2
ASCBRV24 EQU   ASCBSRQ2
ASCBRV23 EQU   ASCBSRQ2
ASCBRV22 EQU   ASCBSRQ2
ASCBRV21 EQU   ASCBSRQ2
ASCBRV20 EQU   ASCBSRQ2
ASCBRV19 EQU   ASCBSRQ1
ASCBRV18 EQU   ASCBSRQ1
ASCBRV17 EQU   ASCBSRQ1
ASCBRV16 EQU   ASCBSRQ1
ASCBRV15 EQU   ASCBSRQ1
ASCBRV14 EQU   ASCBSRQ1
ASCBRV13 EQU   ASCBSRQ1
ASCBSTA  EQU   ASCBSRQ1
ASCBJBNS EQU   ASCB+176
ASCBJBNI EQU   ASCB+172
ASCBMCC  EQU   ASCB+168
ASCBRTWA EQU   ASCB+164
ASCBIQEA EQU   ASCB+160
ASCBXMPQ EQU   ASCB+156
ASCBRS01 EQU   ASCB+154
ASCBFMCT EQU   ASCB+152
ASCBOUXB EQU   ASCB+148
ASCBOUCB EQU   ASCB+144
ASCBMECB EQU   ASCB+140
ASCBQECB EQU   ASCB+136
ASCBLSQH EQU   ASCBLKGP+4
ASCBLOCK EQU   ASCBLKGP
ASCBTCBS EQU   ASCB+124
ASCBNVSC EQU   ASCB+122
ASCBVSC  EQU   ASCB+120
ASCBSRBS EQU   ASCB+118
ASCBSSRB EQU   ASCB+116
ASCBRV06 EQU   ASCBFLG2
ASCBRV05 EQU   ASCBFLG2
ASCBRV04 EQU   ASCBFLG2
ASCBSNQS EQU   ASCBFLG2
ASCBS2S  EQU   ASCBFLG2
ASCBCEXT EQU   ASCBFLG2
ASCBPXMT EQU   ASCBFLG2
ASCBXMPT EQU   ASCBFLG2
ASCBRF07 EQU   ASCBDSP1
ASCBRF06 EQU   ASCBDSP1
ASCBRF05 EQU   ASCBDSP1
ASCBRF04 EQU   ASCBDSP1
ASCBRF03 EQU   ASCBDSP1
ASCBRF02 EQU   ASCBDSP1
ASCBFAIL EQU   ASCBDSP1
ASCBNOQ  EQU   ASCBDSP1
ASCBSWCT EQU   ASCB+112
ASCBASXB EQU   ASCB+108
ASCBTMCH EQU   ASCB+104
ASCBNSWP EQU   ASCBFLG1
ASCBTYP1 EQU   ASCBFLG1
ASCBSTND EQU   ASCBFLG1
ASCBABNT EQU   ASCBFLG1
ASCBTERM EQU   ASCBFLG1
ASCBS3S  EQU   ASCBFLG1
ASCBCMSH EQU   ASCBFLG1
ASCBTOFF EQU   ASCBFLG1
ASCBRF01 EQU   ASCBRCTF
ASCBTMLW EQU   ASCBRCTF
ASCBOUT  EQU   ASCBRCTF
ASCBWAIT EQU   ASCBRCTF
ASCBRV08 EQU   ASCBRCTF
ASCBFQU  EQU   ASCBRCTF
ASCBFRS  EQU   ASCBRCTF
ASCBTMNO EQU   ASCBRCTF
ASCBAFFN EQU   ASCBFW1
ASCBDUMP EQU   ASCB+96
ASCBRV44 EQU   ASCB+92
ASCBUBET EQU   ASCB+88
ASCBECB  EQU   ASCB+84
ASCBJSTL EQU   ASCB+80
ASCBEWST EQU   ASCB+72
ASCBEJST EQU   ASCB+64
ASCBTSB  EQU   ASCB+60
ASCBCSCB EQU   ASCB+56
ASCBRSMA EQU   ASCBRSM+1
ASCBRV54 EQU   ASCBRSMF
ASCBRV53 EQU   ASCBRSMF
ASCBRV52 EQU   ASCBRSMF
ASCBRV51 EQU   ASCBRSMF
ASCBVEQR EQU   ASCBRSMF
ASCBN2LP EQU   ASCBRSMF
ASCB1LPU EQU   ASCBRSMF
ASCB2LPU EQU   ASCBRSMF
ASCBLDA  EQU   ASCB+48
ASCBDP   EQU   ASCB+43
ASCBRV07 EQU   ASCB+42
ASCBIOSM EQU   ASCB+40
ASCBSEQN EQU   ASCB+38
ASCBCPUS EQU   ASCB+32
ASCBSPL  EQU   ASCB+28
ASCBIOSP EQU   ASCB+24
ASCBSYNC EQU   ASCBSUPC+4
ASCBSVRB EQU   ASCBSUPC
ASCBCMSF EQU   ASCB+12
ASCBBWDP EQU   ASCB+8
ASCBASCB EQU   ASCB
ASCBEGIN EQU   ASCB
LCCAR125 EQU   LCCA+964
LCCAR124 EQU   LCCA+960
LCCASGPR EQU   LCCA+896
LCCADRT2 EQU   LCCA+888
LCCADRT1 EQU   LCCA+880
LCCAR103 EQU   LCCA+876
LCCAESS2 EQU   LCCA+872
LCCASPLJ EQU   LCCA+868
LCCASMQJ EQU   LCCA+864
LCCAIRT  EQU   LCCA+736
LCCARV89 EQU   LCCA+728
LCCAPGTA EQU   LCCASRBF+2
LCCASAFN EQU   LCCASRBF
LCCAECSA EQU   LCCA+716
LCCAICR0 EQU   LCCA+712
LCCALWTM EQU   LCCA+704
LCCARV78 EQU   LCCA+700
LCCAPINV EQU   LCCA+696
LCCARV88 EQU   LCCA+695
LCCARV87 EQU   LCCALKFG
LCCARV86 EQU   LCCALKFG
LCCARV85 EQU   LCCALKFG
LCCARV84 EQU   LCCALKFG
LCCALKRD EQU   LCCALKFG
LCCALKAQ EQU   LCCALKFG
LCCALKSA EQU   LCCALKFG
LCCALKDP EQU   LCCALKFG
LCCACRST EQU   LCCACREX
LCCACRDP EQU   LCCACREX
LCCACRLM EQU   LCCACREX
LCCACRIN EQU   LCCACREX
LCCACRRT EQU   LCCACREX
LCCACRLE EQU   LCCACREX
LCCACRRM EQU   LCCACREX
LCCACREF EQU   LCCACREX
LCCAVARY EQU   LCCACRFL
LCCARV73 EQU   LCCACRFL
LCCARV72 EQU   LCCACRFL
LCCARV71 EQU   LCCACRFL
LCCARV70 EQU   LCCACRFL
LCCARV69 EQU   LCCACRFL
LCCACLMS EQU   LCCACRFL
LCCACRTM EQU   LCCACRFL
LCCALCR0 EQU   LCCA+688
LCCACRLC EQU   LCCA+684
LCCARCPU EQU   LCCA+680
LCCADCPU EQU   LCCA+676
LCCASRBJ EQU   LCCA+672
LCCADSSR EQU   LCCA+668
LCCADSSC EQU   LCCA+660
LCCADSS3 EQU   LCCA+648
LCCADSS2 EQU   LCCA+636
LCCADSS1 EQU   LCCA+624
LCCAWTIM EQU   LCCA+616
LCCAITOD EQU   LCCA+608
LCCADTOD EQU   LCCA+600
LCCASTOD EQU   LCCA+592
LCCARIR5 EQU   LCCASPSA+44
LCCARIR4 EQU   LCCASPSA+40
LCCARIR3 EQU   LCCASPSA+36
LCCARIR2 EQU   LCCASPSA+32
LCCARPR5 EQU   LCCASPSA+28
LCCARPR4 EQU   LCCASPSA+24
LCCARPR3 EQU   LCCASPSA+20
LCCARPR2 EQU   LCCASPSA+16
LCCADSR5 EQU   LCCASPSA+12
LCCADSR4 EQU   LCCASPSA+8
LCCADSR3 EQU   LCCASPSA+4
LCCADSR2 EQU   LCCASPSA
LCCARV68 EQU   LCCA+543
LCCAPSMK EQU   LCCA+542
LCCARV67 EQU   LCCADSF2
LCCARV66 EQU   LCCADSF2
LCCARV65 EQU   LCCADSF2
LCCARV64 EQU   LCCADSF2
LCCADSRW EQU   LCCADSF2
LCCADSPL EQU   LCCADSF2
LCCAGSRB EQU   LCCADSF2
LCCASRBM EQU   LCCADSF2
LCCARV61 EQU   LCCADSF1
LCCARV60 EQU   LCCADSF1
LCCARV59 EQU   LCCADSF1
LCCARV58 EQU   LCCADSF1
LCCATIMR EQU   LCCADSF1
LCCADSS  EQU   LCCADSF1
LCCAVCPU EQU   LCCADSF1
LCCAACR  EQU   LCCADSF1
LCCACPUS EQU   LCCA+536
LCCAASCP EQU   LCCA+532
LCCAESSA EQU   LCCA+528
LCCARV55 EQU   LCCASPN4
LCCARV54 EQU   LCCASPN4
LCCARV53 EQU   LCCASPN4
LCCARV52 EQU   LCCASPN4
LCCARV51 EQU   LCCASPN4
LCCARV50 EQU   LCCASPN4
LCCARV49 EQU   LCCASPN4
LCCARV48 EQU   LCCASPN4
LCCARV47 EQU   LCCASPN3
LCCARV46 EQU   LCCASPN3
LCCARV45 EQU   LCCASPN3
LCCARV44 EQU   LCCASPN3
LCCARV43 EQU   LCCASPN3
LCCARV42 EQU   LCCASPN3
LCCARV41 EQU   LCCASPN3
LCCARV40 EQU   LCCASPN3
LCCARV39 EQU   LCCASPN2
LCCARV38 EQU   LCCASPN2
LCCARV37 EQU   LCCASPN2
LCCARV36 EQU   LCCASPN2
LCCARV35 EQU   LCCASPN2
LCCARV34 EQU   LCCASPN2
LCCARV33 EQU   LCCASPN2
LCCARV32 EQU   LCCASPN2
LCCARV31 EQU   LCCASPN1
LCCARV30 EQU   LCCASPN1
LCCAMFIO EQU   LCCASPN1
LCCARSTR EQU   LCCASPN1
LCCATSPN EQU   LCCASPN1
LCCALOCK EQU   LCCASPN1
LCCASIGP EQU   LCCASPN1
LCCAPTLB EQU   LCCASPN1
LCCARV27 EQU   LCCAIHR4
LCCARV26 EQU   LCCAIHR4
LCCARV25 EQU   LCCAIHR4
LCCARV24 EQU   LCCAIHR4
LCCARV23 EQU   LCCAIHR4
LCCARV22 EQU   LCCAIHR4
LCCARV21 EQU   LCCAIHR4
LCCARV20 EQU   LCCAIHR4
LCCARV19 EQU   LCCAIHR3
LCCARV18 EQU   LCCAIHR3
LCCARV17 EQU   LCCAIHR3
LCCARV16 EQU   LCCAIHR3
LCCARV15 EQU   LCCAIHR3
LCCARV14 EQU   LCCAIHR3
LCCARV13 EQU   LCCAIHR3
LCCARV12 EQU   LCCAIHR3
LCCARV11 EQU   LCCAIHR2
LCCARV10 EQU   LCCAIHR2
LCCARV09 EQU   LCCAIHR2
LCCARV08 EQU   LCCAIHR2
LCCARV07 EQU   LCCAIHR2
LCCARV06 EQU   LCCAIHR2
LCCARV05 EQU   LCCAIHR2
LCCARV04 EQU   LCCAIHR2
LCCARV03 EQU   LCCAIHR1
LCCARV02 EQU   LCCAIHR1
LCCARV01 EQU   LCCAIHR1
LCCAPPIE EQU   LCCAIHR1
LCCAPSG1 EQU   LCCAIHR1
LCCAPDAT EQU   LCCAIHR1
LCCAXRC2 EQU   LCCAIHR1
LCCAXRC1 EQU   LCCAIHR1
LCCAIOPS EQU   LCCA+512
LCCAGPGR EQU   LCCA+448
LCCAR133 EQU   LCCA+444
LCCAR132 EQU   LCCA+440
LCCAR131 EQU   LCCA+436
LCCAR130 EQU   LCCA+432
LCCAR129 EQU   LCCA+428
LCCAR128 EQU   LCCA+424
LCCAR127 EQU   LCCA+420
LCCAR126 EQU   LCCA+416
LCCARSGR EQU   LCCA+352
LCCAXGR3 EQU   LCCA+288
LCCAXGR2 EQU   LCCA+224
LCCAXGR1 EQU   LCCA+160
LCCACR0  EQU   LCCA+156
LCCAMCR1 EQU   LCCA+152
LCCAPVAD EQU   LCCA+148
LCCAPINT EQU   LCCA+144
LCCAPPSW EQU   LCCA+136
LCCAPGR2 EQU   LCCA+72
LCCAPGR1 EQU   LCCA+8
LCCARV77 EQU   LCCA+6
LCCACPUA EQU   LCCA+4
LCCALCCA EQU   LCCA
RCARETAD EQU   RCA+20
RCATASID EQU   RCA+18
RCAREP1  EQU   RCANAME6
RCAPSIF  EQU   RCANAME6
RCAPSIX  EQU   RCANAME6
RCAVEQRP EQU   RCANAME6
RCARCFC  EQU   RCANAME6
RCACSGB  EQU   RCANAME6
RCAFXL   EQU   RCANAME6
RCAPS113 EQU   RCANAME6
RCAFREE  EQU   RCANAME5
RCARFR2  EQU   RCANAME5
RCACPBR  EQU   RCANAME5
RCAOPBR  EQU   RCANAME5
RCASORT  EQU   RCANAME5
RCASIRT  EQU   RCANAME5
RCARELV  EQU   RCANAME5
RCARELF  EQU   RCANAME5
RCAGFAD  EQU   RCANAME4
RCAVEQRI EQU   RCANAME4
RCAVEQRF EQU   RCANAME4
RCAVEQRC EQU   RCANAME4
RCATERM  EQU   RCANAME4
RCASQA   EQU   RCANAME4
RCASWIN  EQU   RCANAME4
RCASOUT  EQU   RCANAME4
RCARFR   EQU   RCANAME3
RCARELS  EQU   RCANAME3
RCARCFI  EQU   RCANAME3
RCARCF   EQU   RCANAME3
RCAPSII  EQU   RCANAME3
RCAPSIB  EQU   RCANAME3
RCAPS112 EQU   RCANAME3
RCAPIX   EQU   RCANAME3
RCAPIOP  EQU   RCANAME2
RCASWPC  EQU   RCANAME2
RCASWPP  EQU   RCANAME2
RCAPFTE  EQU   RCANAME2
RCAPCB   EQU   RCANAME2
RCAOUT   EQU   RCANAME2
RCAITAS  EQU   RCANAME2
RCAIOCP  EQU   RCANAME2
RCAINV   EQU   RCANAME1
RCAGFA   EQU   RCANAME1
RCAFXLD  EQU   RCANAME1
RCAVEQR  EQU   RCANAME1
RCADSEG  EQU   RCANAME1
RCADLAS  EQU   RCANAME1
RCACSEG  EQU   RCANAME1
RCAVAMSI EQU   RCANAME1
@NM00041 EQU   RCAFLAGS
@NM00040 EQU   RCAFLAGS
RCAQS    EQU   RCAFLAGS
RCAPSIER EQU   RCAFLAGS
RCAABEND EQU   RCAFLAGS
RCALL    EQU   RCAFLAGS
RCASAL   EQU   RCAFLAGS
RCACSECT EQU   RCA+9
@NM00039 EQU   RCANAME7
RCAPRSS  EQU   RCANAME7
RCAPRSR  EQU   RCANAME7
RCAPRSB  EQU   RCANAME7
RCAPSIY  EQU   RCANAME7
RCAPIOI  EQU   RCANAME7
RCAPARM1 EQU   RCA+4
RCAPARM0 EQU   RCA
CVTLEVL  EQU   CVTRELNO+2
CVTNUMB  EQU   CVTRELNO
CVTMDL   EQU   CVTFIX+250
@NM00014 EQU   CVTFIX+248
@NM00013 EQU   CVTFIX
CVTRV482 EQU   CVTXTNT2+128
CVTRV481 EQU   CVTXTNT2+124
CVTRV480 EQU   CVTXTNT2+120
CVTRV479 EQU   CVTXTNT2+118
CVTRV478 EQU   CVTXTNT2+117
CVTRV477 EQU   CVTXTNT2+116
CVTRV476 EQU   CVTXTNT2+115
CVTRV475 EQU   CVTXTNT2+114
CVTRV474 EQU   CVTRV466
CVTRV473 EQU   CVTRV466
CVTRV472 EQU   CVTRV466
CVTRV471 EQU   CVTRV466
CVTRV470 EQU   CVTRV466
CVTRV469 EQU   CVTRV466
CVTRV468 EQU   CVTRV466
CVTRV467 EQU   CVTRV466
CVTRV465 EQU   CVTRV457
CVTRV464 EQU   CVTRV457
CVTRV463 EQU   CVTRV457
CVTRV462 EQU   CVTRV457
CVTRV461 EQU   CVTRV457
CVTRV460 EQU   CVTRV457
CVTRV459 EQU   CVTRV457
CVTRV458 EQU   CVTRV457
CVTRV456 EQU   CVTXTNT2+108
CVTRV455 EQU   CVTXTNT2+104
CVTRV454 EQU   CVTXTNT2+100
CVTRV453 EQU   CVTXTNT2+96
CVTRV452 EQU   CVTXTNT2+94
CVTRV451 EQU   CVTXTNT2+92
CVTRV450 EQU   CVTXTNT2+90
CVTRV449 EQU   CVTXTNT2+88
CVTRV448 EQU   CVTXTNT2+87
CVTRV447 EQU   CVTXTNT2+86
CVTRV446 EQU   CVTRV438
CVTRV445 EQU   CVTRV438
CVTRV444 EQU   CVTRV438
CVTRV443 EQU   CVTRV438
CVTRV442 EQU   CVTRV438
CVTRV441 EQU   CVTRV438
CVTRV440 EQU   CVTRV438
CVTRV439 EQU   CVTRV438
CVTRV437 EQU   CVTRV429
CVTRV436 EQU   CVTRV429
CVTRV435 EQU   CVTRV429
CVTRV434 EQU   CVTRV429
CVTRV433 EQU   CVTRV429
CVTRV432 EQU   CVTRV429
CVTRV431 EQU   CVTRV429
CVTRV430 EQU   CVTRV429
CVTRV428 EQU   CVTXTNT2+80
CVTRV427 EQU   CVTXTNT2+76
CVTRV426 EQU   CVTXTNT2+72
CVTRV425 EQU   CVTXTNT2+68
CVTATACT EQU   CVTATCVT
CVTRV423 EQU   CVTXTNT2+62
CVTRV422 EQU   CVTXTNT2+60
CVTRV421 EQU   CVTXTNT2+58
CVTRV420 EQU   CVTXTNT2+56
CVTRV419 EQU   CVTXTNT2+55
CVTRV418 EQU   CVTXTNT2+54
CVTRV417 EQU   CVTRV409
CVTRV416 EQU   CVTRV409
CVTRV415 EQU   CVTRV409
CVTRV414 EQU   CVTRV409
CVTRV413 EQU   CVTRV409
CVTRV412 EQU   CVTRV409
CVTRV411 EQU   CVTRV409
CVTRV410 EQU   CVTRV409
CVTRV408 EQU   CVTRV400
CVTRV407 EQU   CVTRV400
CVTRV406 EQU   CVTRV400
CVTRV405 EQU   CVTRV400
CVTRV404 EQU   CVTRV400
CVTRV403 EQU   CVTRV400
CVTRV402 EQU   CVTRV400
CVTRV401 EQU   CVTRV400
CVTICB   EQU   CVTXTNT2+48
CVTSKTA  EQU   CVTXTNT2+44
CVTCCVT  EQU   CVTXTNT2+40
CVTRSV98 EQU   CVTXTNT2+36
CVTRSV97 EQU   CVTXTNT2+34
CVTRSV96 EQU   CVTXTNT2+32
CVTOLTEP EQU   CVTXTNT2+28
CVTQIDA  EQU   CVTQID+1
CVTRSV95 EQU   CVTQID
CVTRSV94 EQU   CVTXTNT2+20
CVTRSV93 EQU   CVTXTNT2+16
CVTRSV92 EQU   CVTXTNT2+12
CVTDEBVR EQU   CVTXTNT2+8
CVTRSV91 EQU   CVTXTNT2+6
CVTRSV9H EQU   CVTFLGBT
CVTRSV9G EQU   CVTFLGBT
CVTRSV9F EQU   CVTFLGBT
CVTRSV9E EQU   CVTFLGBT
CVTRSV9D EQU   CVTFLGBT
CVTBAH   EQU   CVTFLGBT
CVTVME   EQU   CVTFLGBT
CVTNPE   EQU   CVTFLGBT
CVTNUCLS EQU   CVTXTNT2+4
CVTDSSVA EQU   CVTDSSV+1
CVTRSV89 EQU   CVTDSSV
CVTRSV88 EQU   CVTXTNT1+8
CVTRSV87 EQU   CVTXTNT1+4
CVTFACHN EQU   CVTXTNT1
CVTRV488 EQU   CVTMAP+412
CVTRV487 EQU   CVTMAP+408
CVTRV486 EQU   CVTMAP+404
CVTRV485 EQU   CVTMAP+400
CVTACTAP EQU   CVTMAP+396
CVTAUTH  EQU   CVTMAP+392
CVTRV490 EQU   CVTMAP+388
CVTSU    EQU   CVTMAP+384
CVTVOLT1 EQU   CVTVOLM1+1
CVTVOLI1 EQU   CVTVOLF1
CVTSTOA  EQU   CVTMAP+376
CVTRSV58 EQU   CVTMAP+374
CVTRSV57 EQU   CVTMAP+372
CVTDDCE  EQU   CVTMAP+368
CVTPNWFR EQU   CVTMAP+364
CVTSMF   EQU   CVTMAP+360
CVTSULK  EQU   CVTMAP+358
CVTSLKO  EQU   CVTSYSK
CVTSLKP  EQU   CVTSYSK
CVTSLKQ  EQU   CVTSYSK
CVTSLKR  EQU   CVTSYSK
CVTRSV56 EQU   CVTSYSK
CVTRSV55 EQU   CVTSYSK
CVTRSV54 EQU   CVTSYSK
CVTRSV53 EQU   CVTSYSK
CVTRSV52 EQU   CVTA1F1
CVTRSV51 EQU   CVTA1F1
CVTRSV50 EQU   CVTA1F1
CVTRSV49 EQU   CVTA1F1
CVTRSV48 EQU   CVTA1F1
CVTRSV47 EQU   CVTA1F1
CVTSRSW  EQU   CVTA1F1
CVTPFSW  EQU   CVTA1F1
CVTPCVT  EQU   CVTMAP+352
CVTRSV46 EQU   CVTMAP+344
CVTRSV45 EQU   CVTMAP+340
CVTRSV44 EQU   CVTMAP+338
CVTRSV43 EQU   CVTMAP+336
CVTHJESA EQU   CVTHJES+1
CVTRSV42 EQU   CVTHJES
CVTEXT2A EQU   CVTEXT2+1
CVTRSV41 EQU   CVTEXT2
CVTAPFA  EQU   CVTAPF+1
CVTRSV40 EQU   CVTAPF
CVTRV518 EQU   CVTINTLA
CVTRV517 EQU   CVTERPV
CVTEORM  EQU   CVTMAP+312
CVTMCHPR EQU   CVTMAP+308
CVTTZ    EQU   CVTMAP+304
CVTJEPS  EQU   CVTMAP+300
CVTJESCT EQU   CVTMAP+296
CVTMODE  EQU   CVTMAP+292
CVTPTRV  EQU   CVTMAP+288
CVTREAL  EQU   CVTMAP+284
CVTRSV39 EQU   CVTMAP+280
CVTRSV38 EQU   CVTMAP+276
CVTDMSRA EQU   CVTDMSR+1
CVTRV634 EQU   CVTDMSRF
CVTRV633 EQU   CVTDMSRF
CVTRV632 EQU   CVTDMSRF
CVTRV631 EQU   CVTDMSRF
CVTRV630 EQU   CVTDMSRF
CVTRV629 EQU   CVTDMSRF
CVTUDUMP EQU   CVTDMSRF
CVTSDUMP EQU   CVTDMSRF
CVTQMSGA EQU   CVTQMSG+1
CVTRSV36 EQU   CVTQMSG
CVTAMFF  EQU   CVTMAP+264
CVTPURGA EQU   CVTPURG+1
CVTRSV35 EQU   CVTPURG
CVTCBSP  EQU   CVTMAP+256
CVTATERA EQU   CVTATER+1
CVTSYST  EQU   CVTATER
CVTVOLT2 EQU   CVTTAT
CVTVOLI2 EQU   CVTVOLF2
CVTAQAVB EQU   CVTAQAVT+1
CVTRSV34 EQU   CVTTCMFG
CVTRSV33 EQU   CVTTCMFG
CVTRSV32 EQU   CVTTCMFG
CVTRSV31 EQU   CVTTCMFG
CVTRSV30 EQU   CVTTCMFG
CVTRSV29 EQU   CVTTCMFG
CVTLDEV  EQU   CVTTCMFG
CVTTCRDY EQU   CVTTCMFG
CVTGTFA  EQU   CVTGTF+1
CVTRSV27 EQU   CVTGTFST
CVTRNIO  EQU   CVTGTFST
CVTUSR   EQU   CVTGTFST
CVTRV318 EQU   CVTFORM
CVTRV317 EQU   CVTTMODE
CVTRV316 EQU   CVTSTATE
CVTRV315 EQU   CVTGTFS
CVTGTFAV EQU   CVTGTFS
CVT0SCR1 EQU   CVTMAP+232
CVTRV515 EQU   CVTMAP+228
CVTRMS   EQU   CVTMAP+224
CVTPATCH EQU   CVTMAP+220
CVTTSCE  EQU   CVTMAP+216
CVTLNKSC EQU   CVTMAP+214
CVTQABST EQU   CVTMAP+212
CVTMDLDS EQU   CVTMAP+208
CVTUSER  EQU   CVTMAP+204
CVTABEND EQU   CVTMAP+200
CVTSMCA  EQU   CVTMAP+196
CVTRSV18 EQU   CVTMAP+192
CVTQLPAQ EQU   CVTMAP+188
CVTQCDSR EQU   CVTMAP+184
CVTVS1B  EQU   CVTOPTB
CVTVS1A  EQU   CVTOPTB
CVTFP    EQU   CVTOPTB
CVTAPTHR EQU   CVTOPTB
CVTNLOG  EQU   CVTOPTB
CVTTOD   EQU   CVTOPTB
CVTCTIMS EQU   CVTOPTB
CVTPROT  EQU   CVTOPTB
CVTXPFP  EQU   CVTOPTA
CVTASCII EQU   CVTOPTA
CVTRSV13 EQU   CVTOPTA
CVTRSV12 EQU   CVTOPTA
CVTNIP   EQU   CVTOPTA
CVTDDR   EQU   CVTOPTA
CVTAPR   EQU   CVTOPTA
CVTCCH   EQU   CVTOPTA
CVTSNCTR EQU   CVTMAP+180
CVTQMWR  EQU   CVTMAP+176
CVTQOCR  EQU   CVTMAP+172
CVT1EF00 EQU   CVTMAP+168
CVTMZ00  EQU   CVTMAP+164
CVTSV76Q EQU   CVTSV76C
CVTRSV11 EQU   CVTMAP+156
CVT0PT01 EQU   CVTMAP+152
CVTMSER  EQU   CVTMAP+148
CVTRV516 EQU   CVTIERLC
CVTILCH  EQU   CVTMAP+140
CVT0DS   EQU   CVTMAP+136
CVTFBOSV EQU   CVTMAP+132
CVTNUCB  EQU   CVTMAP+128
CVTIXAVL EQU   CVTMAP+124
CVTSV76M EQU   CVTIOQET
CVTDCBA  EQU   CVTMAP+117
CVTMVS2  EQU   CVTDCB
CVT6DAT  EQU   CVTDCB
CVT4MPS  EQU   CVTDCB
CVTRSV09 EQU   CVTDCB
CVT4MS1  EQU   CVTDCB
CVT2SPS  EQU   CVTDCB
CVT1SSS  EQU   CVTDCB
CVTRSV08 EQU   CVTDCB
CVTSTB   EQU   CVTMAP+112
CVTQTD00 EQU   CVTMAP+108
CVTQTE00 EQU   CVTMAP+104
CVTCUCB  EQU   CVTMAP+100
CVTSJQ   EQU   CVTMAP+96
CVTPBLDL EQU   CVTMAP+92
CVTTPC   EQU   CVTMAP+88
CVTSVDCB EQU   CVTMAP+84
CVTBRET  EQU   CVTMAP+82
CVTEXIT  EQU   CVTMAP+80
CVT0FN00 EQU   CVTMAP+76
CVTDARA  EQU   CVTDAR+1
CVTRSV07 EQU   CVTFLGS1
CVTRSV06 EQU   CVTFLGS1
CVTRSV05 EQU   CVTFLGS1
CVTRSV04 EQU   CVTFLGS1
CVTRSV03 EQU   CVTFLGS1
CVTRSV02 EQU   CVTFLGS1
CVTRSV01 EQU   CVTFLGS1
CVTDMPLK EQU   CVTFLGS1
CVTXITP  EQU   CVTMAP+68
CVTZDTAB EQU   CVTMAP+64
CVTMSLT  EQU   CVTMAP+60
CVTDATE  EQU   CVTMAP+56
CVTBTERM EQU   CVTMAP+52
CVTSYSAD EQU   CVTMAP+48
CVTXTLER EQU   CVTMAP+44
CVTILK2  EQU   CVTMAP+40
CVTILK1  EQU   CVTMAP+36
CVTPRLTV EQU   CVTMAP+32
CVTPCNVT EQU   CVTMAP+28
CVT0VL00 EQU   CVTMAP+24
CVTXAPG  EQU   CVTMAP+20
CVTBUF   EQU   CVTMAP+16
CVTJOB   EQU   CVTMAP+12
CVTLINK  EQU   CVTMAP+8
CVT0EF00 EQU   CVTMAP+4
CVTTCBP  EQU   CVTMAP
CVT      EQU   CVTMAP
XPTLSID2 EQU   XPTLPN
XPTLSID  EQU   XPTLGN
@NM00012 EQU   XPTFLAG2
XPTIOERR EQU   XPTFLAG2
XPTPOINP EQU   XPTFLAG2
XPTRES1  EQU   XPTFLAG2
XPTVALID EQU   XPTFLAG2
XPTRSV4  EQU   XPTFLAGS
XPTDEFER EQU   XPTFLAGS
XPTRES2  EQU   XPTFLAGS
XPTVIO   EQU   XPTFLAGS
@NM00011 EQU   XPTFLAGS
XPTCKF   EQU   XPTFLAGS
XPTXAV   EQU   XPTFLAGS
XPTVIOLP EQU   XPTFLAGS
XPTRSV1  EQU   XPTE+1
XPTPROT  EQU   XPTE
PGTPAM   EQU   PGTBITS
@NM00010 EQU   PGTBITS
@NM00009 EQU   PGTBITS
@NM00008 EQU   PGTBITS
@NM00007 EQU   PGTBITS
@NM00006 EQU   PGTBITS
@NM00005 EQU   PGTBITS
PGTREAL  EQU   PGTRSA
PFTQNDX  EQU   PFTE+14
@NM00004 EQU   PFTFLAG2
@NM00003 EQU   PFTFLAG2
PFTOFFLN EQU   PFTFLAG2
PFTVRPLT EQU   PFTFLAG1
PFTLSQA  EQU   PFTFLAG1
PFTONAVQ EQU   PFTFLAG1
PFTRSV1  EQU   PFTE+10
PFTBQPTR EQU   PFTQPTRS+2
PFTASID  EQU   PFTPGID
RSMASMHD EQU   RSMHD+40
RSMFOEQ  EQU   RSMHD+36
RSMLIOQL EQU   RSMLIOQ+4
RSMLIOQF EQU   RSMLIOQ
RSMLSQAL EQU   RSMLSQA+2
RSMLSQAF EQU   RSMLSQA
RSMLFQL  EQU   RSMLFQ+2
RSMRSV2  EQU   RSMHD+16
RSMCNTFX EQU   RSMHD+14
RSMRSV1  EQU   RSMHD+13
@NM00002 EQU   RSMFLG1
RSMFAIL  EQU   RSMFLG1
RSMGFADD EQU   RSMFLG1
RSMCPNC  EQU   RSMFLG1
RSMCPNU  EQU   RSMFLG1
RSMGFAD  EQU   RSMFLG1
RSMIOCPC EQU   RSMFLG1
RSMIOCPU EQU   RSMFLG1
RSMASCB  EQU   RSMHD+8
RSMSPCT  EQU   RSMHD+4
RSMVSTO  EQU   RSMHD
PVTEND   EQU   PVT+1944
PVTXXXXX EQU   PVT+1940
PVTMVCLC EQU   PVT+1936
PVTVCONS EQU   PVT+1896
PVTPRSB  EQU   PVT+1892
PVTCIOQL EQU   PVTPCBQS+36
PVTCIOQF EQU   PVTPCBQS+32
PVTGFADL EQU   PVTPCBQS+28
PVTGFADF EQU   PVTPCBQS+24
PVTFPCBL EQU   PVTPCBQS+20
PVTFPCBF EQU   PVTPCBQS+16
PVTPCBQR EQU   PVTPCBQS
PVTLPAFX EQU   PVT+1850
PVTLSQAF EQU   PVT+1848
PVTLPAR  EQU   PVT+1844
PVTLPAI  EQU   PVT+1840
PVTLPAFC EQU   PVT+1838
PVTCHUIC EQU   PVT+1836
PVTCOMFX EQU   PVT+1834
PVTSQAFX EQU   PVT+1832
PVTCNTFX EQU   PVT+1830
PVTDEFFX EQU   PVT+1828
PVTFIXOK EQU   PVT+1826
PVTPEROK EQU   PVT+1824
PVTMAXFX EQU   PVT+1822
PVTPERFX EQU   PVT+1820
PVTRSRB  EQU   PVT+1776
PVTRESV5 EQU   PVT+1773
PVTSRBS  EQU   PVT+1772
PVTSSRB  EQU   PVT+1768
PVTACA   EQU   PVTWSAX+1400
PVTSAVE  EQU   PVTWSAX+1328
PVTWSA18 EQU   PVTWSAX+1256
PVTWSA17 EQU   PVTWSAX+1184
PVTWSA15 EQU   PVTWSAX+1040
PVTWSA13 EQU   PVTWSAX+896
PVTWSA12 EQU   PVTWSAX+824
PVTWSA11 EQU   PVTWSAX+752
PVTWSA10 EQU   PVTWSAX+672
PVTWSA9  EQU   PVTWSAX+592
PVTWSA8  EQU   PVTWSAX+504
PVTWSA7  EQU   PVTWSAX+432
PVTWSA6  EQU   PVTWSAX+360
PVTWSA5  EQU   PVTWSAX+288
PVTWSA4  EQU   PVTWSAX+216
PVTWSA3  EQU   PVTWSAX+144
PVTWSA2  EQU   PVTWSAX+72
PVTWSA1  EQU   PVTWSAX
PVTPFTQR EQU   PVTQS+20
PVTRSBQL EQU   PVTQS+18
PVTSQAQL EQU   PVTQS+14
PVTSQAQF EQU   PVTQS+12
PVTCFQL  EQU   PVTQS+10
PVTRSRVL EQU   PVTQS+6
PVTRSRVF EQU   PVTQS+4
PVTAFQL  EQU   PVTQS+2
PVTAFQF  EQU   PVTQS
PVTSPFR  EQU   PVT+302
PVTCFMCT EQU   PVT+300
PVTSPREC EQU   PVT+296
PVTCAREC EQU   PVT+292
PVTCAOUT EQU   PVT+288
PVTCAIN  EQU   PVT+284
PVTNSWPS EQU   PVT+280
PVTNPREC EQU   PVT+276
PVTSPOUT EQU   PVT+272
PVTSPIN  EQU   PVT+268
PVTVAMR  EQU   PVT+264
PVTVAMO  EQU   PVT+260
PVTVAMI  EQU   PVT+256
PVTNPOUT EQU   PVT+252
PVTNPIN  EQU   PVT+248
PVTPRSET EQU   PVT+244
PVTFRSLT EQU   PVT+240
PVTPAGIO EQU   PVT+236
PVTSWPIO EQU   PVT+232
PVTPSWPP EQU   PVT+228
PVTPPREF EQU   PVT+224
PVTPOPBR EQU   PVT+220
PVTPRELF EQU   PVT+216
PVTPRELV EQU   PVT+212
PVTPFREE EQU   PVT+208
PVTPRELS EQU   PVT+204
PVTPOUT  EQU   PVT+200
PVTPFXLD EQU   PVT+196
PVTPITAS EQU   PVT+192
PVTPSRBP EQU   PVT+188
PVTPDSEG EQU   PVT+184
PVTPCSGB EQU   PVT+180
PVTPCSEG EQU   PVT+176
PVTPSWPC EQU   PVT+168
PVTPSOUT EQU   PVT+164
PVTPSWIN EQU   PVT+160
PVTPRCV  EQU   PVT+156
PVTPRCFI EQU   PVT+152
PVTPRCF  EQU   PVT+148
PVTPVRC  EQU   PVT+144
PVTPVRLS EQU   PVT+136
PVTPVEQR EQU   PVT+132
PVTPPIOI EQU   PVT+128
PVTPVRPO EQU   PVT+124
PVTPRFR  EQU   PVT+120
PVTPFP   EQU   PVT+112
PVTPCB   EQU   PVT+104
PVTREP2  EQU   PVT+100
PVTPIOCP EQU   PVT+96
PVTPIOP  EQU   PVT+92
PVTPGFAD EQU   PVT+88
PVTPGFA  EQU   PVT+84
PVTPSQA  EQU   PVT+80
PVTPSINT EQU   PVT+76
PVTPSIB  EQU   PVT+72
PVTSRBID EQU   PVT+68
PVTPCIWA EQU   PVT+64
PVTHQSA  EQU   PVT+62
PVTLQSA  EQU   PVT+60
PVTOROOT EQU   PVT+56
PVTREUS  EQU   PVT+48
PVTSQNPC EQU   PVT+47
PVTSQVRC EQU   PVT+46
PVTPCBLO EQU   PVT+38
PVTPCBCT EQU   PVT+36
PVTDFRS  EQU   PVT+34
PVTRSQA  EQU   PVT+32
PVTPTLB  EQU   PVT+31
PVTPCBNO EQU   PVT+30
PVTSRBNO EQU   PVT+29
PVTSQDC  EQU   PVT+28
PVTLCSA  EQU   PVT+26
PVTLPRIV EQU   PVT+24
PVTLVR   EQU   PVT+22
PVTFVR   EQU   PVT+20
PVTLPFN  EQU   PVT+18
PVTFPFN  EQU   PVT+16
PVTSSPIN EQU   PVT+11
PVTPCBS  EQU   PVT+10
PVTPOOL  EQU   PVT+8
PVTAFCOK EQU   PVT+6
PVTAFCLO EQU   PVT+4
PVTAFC   EQU   PVT+2
@NM00001 EQU   PVTFLAG2
PVTDUMP  EQU   PVTFLAG1
PVTSIT   EQU   PVTFLAG1
PVTLSI   EQU   PVTFLAG1
PVTAPREF EQU   PVTFLAG1
PVTPCBLT EQU   PVTFLAG1
PVTSRBIU EQU   PVTFLAG1
PVTBGMS  EQU   PVTFLAG1
@NM00038 EQU   PSA+3668
PSASTAK  EQU   PSA+3072
@NM00037 EQU   PSA+1048
PSAUSEND EQU   PSA+1048
PSARV062 EQU   PSA+1044
PSACDAL  EQU   PSA+1040
PSAWTCOD EQU   PSA+1036
PSAATCVT EQU   PSA+1032
PSAPCPSW EQU   PSA+1024
PSAPIR2  EQU   PSA+1020
PSARV059 EQU   PSA+1018
PSASVC13 EQU   PSA+1016
PSALSFCC EQU   PSA+1012
PSASFACC EQU   PSA+1008
PSASTOP  EQU   PSA+992
PSASTART EQU   PSA+976
PSARSPSW EQU   PSA+968
PSASRPSW EQU   PSA+960
PSARV045 EQU   PSA+892
PSARV044 EQU   PSA+888
PSARV043 EQU   PSA+884
PSARV042 EQU   PSA+880
PSARV041 EQU   PSA+876
PSARV040 EQU   PSA+872
PSARV025 EQU   PSA+868
PSADSSED EQU   PSA+868
PSADSSPR EQU   PSA+864
PSADSSFW EQU   PSA+860
PSADSS14 EQU   PSA+856
PSADSSPP EQU   PSA+848
PSADSSRP EQU   PSA+840
PSADSS05 EQU   PSADSSF4
PSADSS10 EQU   PSADSSF4
PSADSSVE EQU   PSADSSF4
PSADSSDE EQU   PSADSSF4
PSADSSC0 EQU   PSADSSF4
PSADSSIE EQU   PSADSSF4
PSADSS12 EQU   PSADSSF4
PSADSSRC EQU   PSADSSF4
PSARV057 EQU   PSADSSF3
PSARV056 EQU   PSADSSF3
PSARV055 EQU   PSADSSF3
PSADSSMC EQU   PSADSSF3
PSADSSRW EQU   PSADSSF3
PSADSSNM EQU   PSADSSF3
PSADSSES EQU   PSADSSF3
PSADSSGP EQU   PSADSSF3
PSADSSF2 EQU   PSADSSFL+1
PSADSSPI EQU   PSADSSF1
PSADSSOI EQU   PSADSSF1
PSADSSSP EQU   PSADSSF1
PSADSSTP EQU   PSADSSF1
PSADSSDW EQU   PSADSSF1
PSADSSDD EQU   PSADSSF1
PSADSSDM EQU   PSADSSF1
PSADSSMV EQU   PSADSSF1
PSADSSTS EQU   PSA+816
PSADSSWK EQU   PSA+812
PSADSSR3 EQU   PSA+808
PSADSSR2 EQU   PSA+804
PSADSSRS EQU   PSA+800
PSASTOR  EQU   PSA+796
PSACPUSA EQU   PSA+794
PSAVSTAP EQU   PSA+792
PSAWKVAP EQU   PSA+788
PSAWKRAP EQU   PSA+784
PSAMCHIC EQU   PSA+783
PSARV061 EQU   PSA+782
PSASYMSK EQU   PSA+781
PSAMCHFL EQU   PSA+780
PSACR0   EQU   PSA+776
PSAPSWSV EQU   PSA+768
PSACLHS  EQU   PSAHLHI
PSALKR15 EQU   PSALKSA+60
PSALKR14 EQU   PSALKSA+56
PSALKR13 EQU   PSALKSA+52
PSALKR12 EQU   PSALKSA+48
PSALKR11 EQU   PSALKSA+44
PSALKR10 EQU   PSALKSA+40
PSALKR9  EQU   PSALKSA+36
PSALKR8  EQU   PSALKSA+32
PSALKR7  EQU   PSALKSA+28
PSALKR6  EQU   PSALKSA+24
PSALKR5  EQU   PSALKSA+20
PSALKR4  EQU   PSALKSA+16
PSALKR3  EQU   PSALKSA+12
PSALKR2  EQU   PSALKSA+8
PSALKR1  EQU   PSALKSA+4
PSALKR0  EQU   PSALKSA
PSARV023 EQU   PSACLHT+52
PSALOCAL EQU   PSACLHT+48
PSACMSL  EQU   PSACLHT+44
PSAOPTL  EQU   PSACLHT+40
PSATPACL EQU   PSACLHT+36
PSATPDNL EQU   PSACLHT+32
PSATPNCL EQU   PSACLHT+28
PSAIOSLL EQU   PSACLHT+24
PSAIOSUL EQU   PSACLHT+20
PSAIOSCL EQU   PSACLHT+16
PSAIOSSL EQU   PSACLHT+12
PSASALCL EQU   PSACLHT+8
PSAASML  EQU   PSACLHT+4
PSADISPL EQU   PSACLHT
PSASRSA  EQU   PSA+636
PSARV050 EQU   PSA+634
PSADSSGO EQU   PSA+633
PSARECUR EQU   PSA+632
PSAHLHIS EQU   PSA+628
PSAIPCSA EQU   PSA+624
@NM00036 EQU   PSA+621
PSAIPCDM EQU   PSA+620
PSAIPCD  EQU   PSA+616
@NM00035 EQU   PSA+613
PSAIPCRM EQU   PSA+612
PSAIPCR  EQU   PSA+608
PSAMCHEX EQU   PSA+600
PSAMPSW  EQU   PSA+592
PSAEXPS2 EQU   PSA+584
PSAEXPS1 EQU   PSA+576
PSAPIREG EQU   PSA+572
PSARSREG EQU   PSA+568
PSAGPREG EQU   PSA+556
PSARV022 EQU   PSASUP4
PSARV021 EQU   PSASUP4
PSARV020 EQU   PSASUP4
PSARV019 EQU   PSASUP4
PSARV018 EQU   PSASUP4
PSARV017 EQU   PSASUP4
PSARV016 EQU   PSASUP4
PSARV015 EQU   PSASUP4
PSARV014 EQU   PSASUP3
PSAULCMS EQU   PSASUP3
PSARV012 EQU   PSASUP3
PSAESTA  EQU   PSASUP3
PSASPR   EQU   PSASUP3
PSAPSREG EQU   PSASUP3
PSAPI2   EQU   PSASUP3
PSAIOSUP EQU   PSASUP3
PSALCR   EQU   PSASUP2
PSARTM   EQU   PSASUP2
PSAACR   EQU   PSASUP2
PSAIPCE2 EQU   PSASUP2
PSAIPCES EQU   PSASUP2
PSAIPCEC EQU   PSASUP2
PSAGTF   EQU   PSASUP2
PSAIPCRI EQU   PSASUP2
PSATYPE6 EQU   PSASUP1
PSATCTL  EQU   PSASUP1
PSADISP  EQU   PSASUP1
PSALOCK  EQU   PSASUP1
PSAPI    EQU   PSASUP1
PSAEXT   EQU   PSASUP1
PSASVC   EQU   PSASUP1
PSAIO    EQU   PSASUP1
PSAANEW  EQU   PSA+544
PSATOLD  EQU   PSA+540
PSATNEW  EQU   PSA+536
PSALCCAR EQU   PSA+532
PSAPCCAR EQU   PSA+524
PSAPCCAV EQU   PSA+520
PSACPUPA EQU   PSA+516
PSAPSA   EQU   PSA+512
FLCHDEND EQU   PSA+512
FLCCRSAV EQU   FLCMCLA+280
FLCGRSAV EQU   FLCMCLA+216
FLCFPSAV EQU   FLCMCLA+184
FLCFLA   EQU   FLCMCLA+88
FLCRGNCD EQU   FLCMCLA+84
FLCFSAA  EQU   FLCFSA+1
@NM00034 EQU   FLCFSA
@NM00033 EQU   FLCMCLA+72
FLCMCIC  EQU   FLCMCLA+64
@NM00032 EQU   FLCMCLA+20
FLCIOAA  EQU   FLCIOA+1
@NM00031 EQU   FLCIOA
@NM00030 EQU   FLCMCLA+15
@NM00029 EQU   FLCMCLA+14
@NM00028 EQU   FLCMCLA+12
FLCLCL   EQU   FLCMCLA+8
FLCIOELA EQU   FLCIOEL+1
@NM00027 EQU   FLCIOEL
FLCCHNID EQU   FLCMCLA
@NM00026 EQU   PSA+160
FLCMTRCD EQU   PSA+157
@NM00025 EQU   PSA+156
FLCPERA  EQU   FLCPER+1
@NM00024 EQU   FLCPER
@NM00023 EQU   PSA+151
FLCPERCD EQU   PSA+150
FLCMCNUM EQU   PSA+149
@NM00022 EQU   PSA+148
FLCTEAA  EQU   FLCTEA+1
@NM00021 EQU   FLCTEA
PSAPIPC  EQU   PSAPICOD
PSAPIMC  EQU   PSAPICOD
PSAPIPER EQU   PSAPICOD
PSARV049 EQU   FLCPICOD
FLCPILCB EQU   FLCPIILC
@NM00020 EQU   FLCPIILC
@NM00019 EQU   PSAEPPSW
FLCSVCN  EQU   PSAESPSW+2
FLCSILCB EQU   FLCSVILC
@NM00018 EQU   FLCSVILC
@NM00017 EQU   PSAESPSW
FLCEICOD EQU   PSAEEPSW+2
PSASPAD  EQU   PSAEEPSW
@NM00016 EQU   PSA+128
FLCINPSW EQU   PSA+120
FLCMNPSW EQU   PSA+112
FLCPNPSW EQU   PSA+104
FLCSNPSW EQU   PSA+96
FLCENPSW EQU   PSA+88
FLCTRACE EQU   PSA+84
FLCTIMER EQU   PSA+80
FLCCVT2  EQU   PSA+76
FLCCAW   EQU   PSA+72
FLCCSW   EQU   PSA+64
FLCIOPSW EQU   PSA+56
FLCMOPSW EQU   PSA+48
FLCPOPSW EQU   PSA+40
FLCSOPSW EQU   PSA+32
FLCEOPSW EQU   PSA+24
@NM00015 EQU   FLCICCW2+4
FLCCVT   EQU   FLCICCW2
FLCICCW1 EQU   FLCROPSW
FLCIPPSW EQU   FLCRNPSW
*                                      END UNREFERENCED COMPONENTS
@RF00141 EQU   @RC00069
@RC00152 EQU   @RC00069
@RC00146 EQU   @RC00069
@RC00218 EQU   @RC00201
@RF00155 EQU   @RC00152
@RC00220 EQU   @RC00218
@RC00252 EQU   @RC00218
@ENDDATA EQU   *
         END   IEAVPREF,(C'PLS2003',0701,78164)
