         MACRO
&L       PSAPROT &MODE=UNDEF
         LCLC  &M
&M       SETC  '&MODE'
         AIF   ('&M' EQ 'UNDEF').ERROR
         AIF   ('&M' EQ 'OFF').OFF
         AIF   ('&M' EQ 'ON').ON
.ERROR   MNOTE 8,'INVALID MODE SPECIFIED: &MODE'
         MEXIT
.OFF     ANOP
&L       STCTL R0,R0,PSAPROT1           SAVE CALLERS REG 0
         MVC   PSAPROT2(4),PSAPROT1     MOVE CONTROL REG FOR CHANGE
         NI    PSAPROT2,ALLBIT-BIT3     SWITCH PROTECTION OFF
         LCTL  R0,R0,PSAPROT2           LOAD CREG 0
         MEXIT
.ON      ANOP
&L       LCTL  R0,R0,PSAPROT1           RELOAD CALLERS CREG
         MEND
