*          DATA SET AM005000   AT LEVEL 010 AS OF 08/27/75
*                                                                     *
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
*                                                                     *
*                            DATA PICTURE TABLE 0                     *
*                                                                     *
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
*                                                                     *
         USING DATAGRP0,R5              BASIC
DPTBL0   DS    0CL1027
DP001    TCDPGEN 001,ACCTNO,DE001
DP002    TCDPGEN 002,RECTYP,DE002
DP003    TCDPGEN 003,DEP/IN,DE003
DP004    TCDPGEN 004,SIC/IN,DE004
DP005    TCDPGEN 005,4TH/IN,DE005
DP006    TCDPGEN 006,EPP/IN,DE006
DP007    TCDPGEN 007,TRC/IN,DE007
DP008    TCDPGEN 008,MT1/IN,DE008
DP009    TCDPGEN 009,CM1/IN,DE009
DP010    TCDPGEN 010,MT2/IN,DE010
DP011    TCDPGEN 011,CM2/IN,DE011
DP012    TCDPGEN 012,MT3/IN,DE012
DP013    TCDPGEN 013,CM3/IN,DE013
DP014    TCDPGEN 014,MT4/IN,DE014
DP015    TCDPGEN 015,CM4/IN,DE015
DP016    TCDPGEN 016,SERADD,DE016
DP017    TCDPGEN 017,TRSTNO,DE017
DP099    TCDPGEN 099,OH/UNG,DE099
DP098    TCDPGEN 098,CDESIZ,DE098
DP018    TCDPGEN 018,R/DDTE,DE018
DP019    TCDPGEN 019,RD/SEQ,DE019
DP020    TCDPGEN 020,MTRLOC,DE020
DP021    TCDPGEN 021,MTINST,DE021
DP022    TCDPGEN 022,C/NAME,DE022
DP023    TCDPGEN 023,2ND/LN,DE023
DP024    TCDPGEN 024,3RD/LN,DE024
DP026    TCDPGEN 026,ZIP/CD,DE026
DP027    TCDPGEN 027,CNTYCD,DE027
DP028    TCDPGEN 028,TXEXMT,DE028
DP029    TCDPGEN 029,XTRACP,DE029
DP030    TCDPGEN 030,SPCDES,DE030
DP031    TCDPGEN 031,LSADIS,DE031
DP032    TCDPGEN 032,ACSTAT,DE032
DP033    TCDPGEN 033,TYPRES,DE033
DP034    TCDPGEN 034,PRAMT1,DE034
DP035    TCDPGEN 035,PRAMT2,DE035
DP036    TCDPGEN 036,PRAMT3,DE036
DP037    TCDPGEN 037,TOTBIL,DE037
DP038    TCDPGEN 038,CURAMT,DE038
DP039    TCDPGEN 039,ARR/30,DE039
DP040    TCDPGEN 040,ARR/60,DE040
DP041    TCDPGEN 041,ARPST1,DE041
DP042    TCDPGEN 042,ARSOU1,DE042
DP043    TCDPGEN 043,ARDAT1,DE043
DP044    TCDPGEN 044,ARAMT1,DE044
DP045    TCDPGEN 045,ARPST2,DE045
DP046    TCDPGEN 046,ARSOU2,DE046
DP047    TCDPGEN 047,ARDAT2,DE047
DP048    TCDPGEN 048,ARAMT2,DE048
DP049    TCDPGEN 049,ARPST3,DE049
DP050    TCDPGEN 050,ARSOU3,DE050
DP051    TCDPGEN 051,ARDAT3,DE051
DP052    TCDPGEN 052,ARAMT3,DE052
DP053    TCDPGEN 053,ARPST4,DE053
DP054    TCDPGEN 054,ARSOU4,DE054
DP055    TCDPGEN 055,ARDAT4,DE055
DP056    TCDPGEN 056,ARAMT4,DE056
DP057    TCDPGEN 057,ARPST5,DE057
DP058    TCDPGEN 058,ARSOU5,DE058
DP059    TCDPGEN 059,ARDAT5,DE059
DP060    TCDPGEN 060,ARAMT5,DE060
DP061    TCDPGEN 061,ARPST6,DE061
DP062    TCDPGEN 062,ARSOU6,DE062
DP063    TCDPGEN 063,ARDAT6,DE063
DP064    TCDPGEN 064,ARPST6,DE064
DP065    TCDPGEN 065,ARBUMP,DE065
DP066    TCDPGEN 066,ARBDUE,DE066
DP067    TCDPGEN 067,CRCODE,DE067
DP068    TCDPGEN 068,HLDCUT,DE068
DP069    TCDPGEN 069,CUTCNT,DE069
DP070    TCDPGEN 070,BADCHK,DE070
DP071    TCDPGEN 071,NOTTYP,DE071
DP072    TCDPGEN 072,NOTCNT,DE072
DP073    TCDPGEN 073,ALELEC,DE073
DP074    TCDPGEN 074,WTRHTR,DE074
DP075    TCDPGEN 075,PRECAL,DE075
DP076    TCDPGEN 076,HTCOOL,DE076
DP077    TCDPGEN 077,DMDLES,DE077
DP078    TCDPGEN 078,LASCUT,DE078
DP079    TCDPGEN 079,LASTFM,DE079
DP080    TCDPGEN 080,FUELAD,DE080
DP107NEW TCDPGEN 107,REASNO,DE107NEW
DP093    TCDPGEN 093,FUELRF,DE093
DP094    TCDPGEN 094,FRANCH,DE094
         DC    C'END'                   END OF THIS TABLE
