*          DATA SET GU027900   AT LEVEL 001 AS OF 06/21/77
         TITLE 'GU027900 - OSDATE FOR FORTRAN USING SROSDATE(GU008900)'
*              AUTHOR.   DON HIGGINS.
*              DATE.     06/21/77.
*              REMARKS.  THIS SUBROUTINE RETURNS DATE IN THE FORM OF A
*                        8 BYTE FIELD MM/DD/YY. IT USES SRODATE.
OSDATE   CSECT
         USING OSDATE,15
         L     15,=V(SROSDATE)
         BR    15
         LTORG
         END
