)ATTR
 | TYPE(INPUT) INTENS(HIGH) CAPS(OFF)
)BODY
%--------------------------  O.IF    If       Subcommand  --------------
%OPTION ===>|ZCMD
+Enter the member group name and any operands for%IF: +
%===>|LOPER

+Operands:  memgroup   (for example, *; start:end; start:; part1/part2;
+           ABOVE(Count1)  BELOW(Count2)  ALIAS/NOALIAS  HASALIAS/NOHASA
+           AMODE24/AMODE31/AMODEANY/NOAMODE24/NOAMODE31/NOAMODEANY
+           APFERR/NOAPFERR  APPARENTALIAS/NOAPPARENTALIAS  AUTH/NOAUTH
+           LKED(Partl)  CHANGED(mm/dd/yy:mm/dd/yy) CREATED(mm/dd/yy:mm/
+           DC/NODC  EDIT/NOEDIT  EXEC/NOEXEC  FLEVEL/NOFLEVEL  IOERR/NO
+           BLOCKERR/NOBLOCKERR  LKEDERR/NOLKEDERR  LOADERR/NOLOADERR
+           LOADONLY/NOLOADONLY  LRECLERR/NOLRECLERR  MODULE(Partm)
+           NAMEERR/NONAMEERR  NULL/NONULL  ORPHAN/NOORPHAN  OVERLAY/NOO
+           PAGE/NOPAGE  REFR/NOREFR  RENT/NORENT  REUS/NOREUS  RLDERR/N
+           RLDZERO/NORLDZERO  RMODE24/RMODEANY/NORMODE24/NORMODEANY
+           SCTR/NOSCTR SSI(hexdata)/SSI/NOSSI  TEST/NOTEST  TRAN(Partt)
+           TTR(Lttr:Httr)  USER(Partu)  VSLKED/NOVSLKEDZAP(Partz)
+         THEN(ATTRIB/BROWSE/DIRENTRY/DELETE/END/FIND/FSE/HISTORY/LIST/
+              MAP/MEMBERS/MEMLIST/OUTCOPY/PRINTOFF/REVIEW/SUBLIST/VERIF
+         ELSE(ATTRIB/BROWSE/DIRENTRY/DELETE/END/FIND/FSE/HISTORY/LIST/
+              MAP/MEMBERS/MEMLIST/OUTCOPY/PRINTOFF/REVIEW/SUBLIST/VERIF
+Defaults:  memgroup, THEN(ATTRIB) if neither THEN nor ELSE is entered.
)INIT

  &LOPER = '&OPERS'
  .CURSOR = LOPER
  .HELP   = P71OPHH
)PROC
  &PDSZSEL='If  &LOPER'
)END
