./ ADD NAME=SUPERC                                 12SEP93 17.34 --
)CM
)CM *****     JOB CARD GENERATED ON THE FLY BY JCI MACRO  *****
)CM
//*
//*   JCL FOR BATCH EXECUTION OF SEARCH-FOR (ISPF OPTION 3.14)
//*
)CM
)CM *****     SUPERC WITH SEARCH-FOR OPTION                 *****
)CM
//SUPERC   EXEC  PGM=ISRSUPC,PARM=(SRCHCMP,ANYC)
//NEWDD    DD  DSN=&NEWDD,
//             DISP=SHR&NEWVOL
//OUTDD    DD  SYSOUT=*
)SEL &SFS1 ^= &Z
&SRCH1 &SFS1
)ENDSEL
)SEL &SFS2 ^= &Z
&SRCH2 &SFS2
)ENDSEL
)SEL &SFS3 ^= &Z
&SRCH3 &SFS3
)ENDSEL
)SEL &SFS4 ^= &Z
&SRCH4 &SFS4
)ENDSEL
)SEL &SFS5 ^= &Z
&SRCH5 &SFS5
)ENDSEL
)SEL &SFS6 ^= &Z
&SRCH6 &SFS6
)ENDSEL
)SEL &SFS7 ^= &Z
&SRCH7 &SFS7
)ENDSEL
)SEL &SFS8 ^= &Z
&SRCH8 &SFS8
)ENDSEL
)SEL &SFS9 ^= &Z
&SRCH9 &SFS9
)ENDSEL
)SEL &SFS10 ^= &Z
&SRCH10 &SFS10
)ENDSEL
