)ATTR DEFAULT(%+_)
    % TYPE(TEXT) INTENS(HIGH) COLOR(WHITE) SKIP(ON)
    Ö TYPE(TEXT) INTENS(HIGH) COLOR(YELLOW)
    + TYPE(TEXT) INTENS(LOW)  COLOR(TURQ) SKIP(ON)
    _ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED)
    ^ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED) PAD(_)
    | TYPE(INPUT) INTENS(HIGH) CAPS(OFF)
)BODY EXPAND(\\)
+-\-\-ÖPDS+Dsname Entry Panel+-\-\-
%COMMAND ===>|ZCMD


                         +
+ The data set name you entered can not be used; the data set name
+ is either not in the catalog or not on the volume indicated.
+
+ Modify and reenter the dataset name above
  + or press%ENTER+to use the formatted data set name
  + or enter * to use the currently allocated data set
  + or enter another dataset name
  + or enter%END+to terminate PDS
)PROC
 &PDSZSEL='&ZCMD'
)END
