)ATTR DEFAULT(%+_)
    % TYPE(TEXT) INTENS(HIGH) COLOR(WHITE) SKIP(ON)
    ÷ TYPE(TEXT) INTENS(HIGH) COLOR(YELLOW)
    + TYPE(TEXT) INTENS(LOW)  COLOR(TURQ) SKIP(ON)
    _ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED)
    ^ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED) PAD(_)
    | TYPE(INPUT) INTENS(HIGH) CAPS(OFF)
)BODY EXPAND(\\)
+-\-\-÷PDS Function Selection+-\-\-
%OPTION  ===>_ZCMD
+
+
 Choose one of the following:
+
    %FUNCTION+- Display function status and selection panel
    %VI      +- View log prompt
    %8       +- View log
    %MEMLIST +- Member list  (ML for short)
    %LISTA   +- List allocation prompt
    %LA      +- Switch to LISTA display
    %LISTC   +- List file prompt
    %LISTF   +- List file prompt
    %LC/LF   +- Switch to LISTC/LISTF display
    %LISTV   +- List volume prompt
    %LV      +- Switch to LISTV display
    %CAX     +- Switch to CAX display  (active catalog list)
    %TCT     +- Switch to TCT display  (TSO command table)
    %CANCEL  +- Cancel pending line command prompt (CAN for short)
    %QUIT    +- Terminate÷PDS+ (Q for short)
)INIT
 .HELP = P84FN@PH
)PROC
 &PDSZSEL=TRANS(TRUNC(&ZCMD,'.')
         LISTV,'PANEL(P84LVLTV)'
            LV,'LISTV'
         LISTA,'PANEL(P84LALTA)'
            LA,'LISTA'
         LISTF,'PANEL(P84LCLTC)'
            LF,'LISTF'
         LISTC,'PANEL(P84LCLTC)'
            LC,'LISTC'
            ML,'ML'
          MEML,'MEMLIST'
       MEMLIST,'MEMLIST'
           CAX,'CAX'
           TCT,'TCT'
             8,8
             V,'PANEL(P84VIVI)'
            VI,'PANEL(P84VIVI)'
           VIE,'PANEL(P84VIVI)'
          VIEW,'PANEL(P84VIVI)'
            FU,'FUNCTION'
          FUNC,'FUNCTION'
      FUNCTION,'FUNCTION'
        CANCEL,'PANEL(P84FUCN)'
           CAN,'PANEL(P84FUCN)'
             Q,'QUIT'
            QU,'QUIT'
           QUI,'QUIT'
          QUIT,'QUIT'
           ' ',' '
             *,'?')
 &ZTRAIL=.TRAIL
 &OPERS=.TRAIL
)END
