)ATTR DEFAULT(%+_)
    % TYPE(TEXT) INTENS(HIGH) COLOR(WHITE) SKIP(ON)
    Ö TYPE(TEXT) INTENS(HIGH) COLOR(YELLOW)
    + TYPE(TEXT) INTENS(LOW)  COLOR(TURQ) SKIP(ON)
    _ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED)
    ^ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED) PAD(_)
    | TYPE(INPUT) INTENS(HIGH) CAPS(OFF)
)BODY EXPAND(\\)
+-\-\-Öo.al    Alias line command+-\-\-
%OPTION  ===>|ZCMD
%
+Enter the alias name below for%ALIAS  &PDSMEM
%===>|LOPER

+
+Operands: aliasname
+
+Defaults: none
)INIT
  &LOPER  = '&OPERS'
  .CURSOR = LOPER
  .HELP   = P84LOHH
  IF(&LOPER  = &Z) &LOPER=&P84#AL3
)PROC
 &P84#AL3=&LOPER
 &PDSZSEL='Alias  &PDSMEM &LOPER'
)END
