)ATTR DEFAULT(%+_)
    % TYPE(TEXT) INTENS(HIGH) COLOR(WHITE) SKIP(ON)
    Ö TYPE(TEXT) INTENS(HIGH) COLOR(YELLOW)
    + TYPE(TEXT) INTENS(LOW)  COLOR(TURQ) SKIP(ON)
    _ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED)
    ^ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED) PAD(_)
    | TYPE(INPUT) INTENS(HIGH) CAPS(OFF)
)BODY EXPAND(\\)
+-\-\-ÖBuild LISTFILE using VTOC command+-\-\-
%OPTION  ===>|ZCMD
%
+Enter any operands below for%VTOC
%VOLUMEs===>|CPVOL1+===>|CPVOL2+===>|CPVOL3+
%===>|LOPER

+Operands:+  AND1/OR1('KEYWORD' 'OPER' 'VALUE')  AND2/OR2(...  AND3/OR3(
             CONTAINING('DSNAME-STRING')
             ENDING('DSNAME-END')
             LEVEL('DSNAME-START')
             LIMIT('KEYWORD' 'OPER' 'VALUE')
+
)INIT
  &LOPER  = '&OPERS'
  &CPVOL1 = &PDSCPVOL
  .CURSOR = CPVOL1
  .HELP   = P84LOHH
  IF(&LOPER  = &Z) &LOPER=&P84#VTO
  &LOPER=&P84#VTO
)PROC
 VER(&CPVOL1,NB)
 &PDSCPVOL = &CPVOL1
 &P84#VTO=&LOPER
 /* xxxx in following command is where the buf control word is placed*/
 &PDSZSEL='xxxxvtoc (&CPVOL1 &CPVOL2 &CPVOL3) NOSORT &LOPER'
)END
