)ATTR DEFAULT(%+_)
    % TYPE(TEXT) INTENS(HIGH) COLOR(WHITE) SKIP(ON)
    ^ TYPE(TEXT) INTENS(HIGH) COLOR(YELLOW)
    + TYPE(TEXT) INTENS(LOW)  COLOR(TURQ) SKIP(ON)
    _ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED)
    | TYPE(INPUT) INTENS(HIGH) CAPS(OFF)
)BODY EXPAND(\\)
+-\-\-^PDS o.ut   clist line command+-\-\-
%OPTION  ===>|ZCMD
%
+Enter command or clist for &PDSDSN(&PDSMEM) vol(&PDSVOL)
%===>|LOPER

                                                      +
%DSNAME with quotes  ===>_QU + (Yes/No)
%MEMBER name imbed    ==>_ML +  Yes to imbed the member into the
+                                   dataset name in standard format
+                               No to allow the member name to be placed
+                               seperately using the < symbol
%Conditional volume  ===>_CV                                           +
+       the above operands will be added to end of the command only if
+       the volume is none blank
+ Construct the above command or clist using the symbols  / Ö <
+   the above symbols will be substituted with the dataset name (/)
+   the volume name(Ö) and the member name (<) if not imbeded
+   Use the conditional volume field to avoid entering an volume key
+   word with no value
+   example:  ALLOCATE DA(/) F(ddname) SHR
+             <conditional vol > VOL(Ö) UNIT(SYSALLDA)
+   with imbed NO
+             MYCMD < /  operands
)INIT
  .CURSOR = LOPER
  &LOPER=&P84#CL1
  &QU=&P84#CLQ1
  &ML=&P84#CLM1
  &CV=&P84#CLV1
  if (&QU = &Z )
    &QU='YES'
  if (&ML = &Z )
    &ML='YES'
)PROC
 &P84#CL1=&LOPER
 &P84#CLV1=&CV
  &QU=TRANS(TRUNC(&QU,1),Y,YES,N,NO,' ',YES,*,*)
  &ML=TRANS(TRUNC(&ML,1),Y,YES,N,NO,' ',YES,*,*)
  VER(&QU,NB,LIST,YES,NO)
  VER(&ML,NB,LIST,YES,NO)
  &P84#CLQ1=&QU
  &P84#CLM1=&ML
  IF (&ML = 'YES')
     &DSNT='&PDSDSN(&PDSMEM)'
  IF (&ML = 'NO')
     &DSNT='&PDSDSN'
  IF (&QU = 'YES')
     &DSNT='''&DSNT'''
  IF (&QU = 'NO')
     &DSNT='&DSNT'
  &PART1=TRUNC(&LOPER,'/')
  &PART2=.TRAIL
  IF (&PART1=&LOPER)
     VER(&LOPER,NB,LIST,'/')
  &PART1='&PART1 &DSNT &PART2'
  IF (&PDSVOL^=&Z)
     &PART1='&PART1 &CV'
     &PART2=TRUNC(&PART1,'Ö')
     &PART3=.TRAIL
     IF (&PART1^=&PART2)
        &PART1='&PART2&PDSVOL&PART3'
  IF (&ML = 'NO')
     &PART2=TRUNC(&PART1,'<')
     &PART3=.TRAIL
     IF (&PART1^=&PART2)
        &PART1='&PART2 &PDSMEM &PART3'
  &PDSZSEL='CMD(&PART1)'
)END
