)ATTR DEFAULT(%+_)
    % TYPE(TEXT) INTENS(HIGH) COLOR(WHITE) SKIP(ON)
    Ö TYPE(TEXT) INTENS(HIGH) COLOR(YELLOW)
    + TYPE(TEXT) INTENS(LOW)  COLOR(TURQ) SKIP(ON)
    _ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED)
    ^ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED) PAD(_)
    | TYPE(INPUT) INTENS(HIGH) CAPS(OFF)
)BODY EXPAND(\\)
+-\-\-Öo.rev    REVIEW line command+-\-\-
%OPTION  ===>|ZCMD
%
+Enter any operands below for%REVIEW  &PDSMEM
%===>|LOPER

+
+Operands:  none
+
+Defaults:  none
)INIT
  &LOPER  = '&OPERS'
  .CURSOR = LOPER
  .HELP   = P84OPHH
  IF(&LOPER  = &Z) &LOPER=&P84#RV3
)PROC
 &P84#RV3=&LOPER
 &PDSZSEL='Review  &PDSMEM &LOPER'
)END
