)ATTR DEFAULT(%+_)
    % TYPE(TEXT) INTENS(HIGH) COLOR(WHITE) SKIP(ON)
    Ö TYPE(TEXT) INTENS(HIGH) COLOR(YELLOW)
    + TYPE(TEXT) INTENS(LOW)  COLOR(TURQ) SKIP(ON)
    _ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED)
    ^ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED) PAD(_)
    | TYPE(INPUT) INTENS(HIGH) CAPS(OFF)
)BODY EXPAND(\\)
+-\-\-ÖMEMLIST Prompt+-\-\-
%OPTION ===>|ZCMD
+
+Choose%one+of the following member specifications:
+%  +Combination       %===>_CMEM1   + Range substring (or 6 for all)
+                      %===>_CMEM2   + Pattern substring (optional)
+
+%OR+member/group list or short hand requests   TODAY, 6 (for all member
+(_GROUP
+
+%OR+Pattern           %===>_PMEM1   + imbedded substring 1
+                      %===>_PMEM2   + imbedded substring 2 (optional)
+
+%OR+Range of Members  %===>_RMEM1   + From substring
+                      %===>_RMEM2   + Through substring (optional)
+
+Modify the following%YES/NO+options if desired:
+    Prompting         %===>_PROM+   + (Yes, prompt for filtering operan
+    RESET Member list %===>_RSET+   + (Yes, reinitialize; No, merge mem
+    Linkage edit date %===>_LKDT+   + (Yes, read IDRDATA; No, show modu
+    Default LKEDDATE  %===>_DLKD+   + (Yes, read IDRDATA; No, show modu
)INIT
  &DLKD = &PDSLKDT
  IF (&DLKD=&Z) &DLKD='NO'
  .HELP   = P84OPHH
  .CURSOR = CMEM1
  &MEMS = &Z
  &RSET = 'NO'
  &LKDT = &DLKD
  &PROM = 'NO'
  &ZCMD = &Z
)PROC
  &PROM = TRANS(TRUNC(&PROM,1),Y,YES,N,NO,*,*)
  &RSET = TRANS(TRUNC(&RSET,1),Y,YES,N,NO,*,*)
  &LKDT = TRANS(TRUNC(&LKDT,1),Y,YES,N,NO,*,*)
  &DLKD = TRANS(TRUNC(&DLKD,1),Y,YES,N,NO,*,*)
  VER(&PROM,NB,LIST,YES,NO)
  VER(&RSET,NB,LIST,YES,NO)
  VER(&LKDT,NB,LIST,YES,NO)
  VER(&DLKD,NB,LIST,YES,NO)
  &PDSLKDT=&DLKD
  &ADDON=&Z
  VER(&RMEM1,NAME)
  VER(&RMEM2,NAME)
  IF (&CMEM1 ^= &Z)
      IF (&CMEM1 = '6')
          &MEMS = ':'
          &CMEM1=&Z
  VER(&CMEM1,NAME)
  IF (&CMEM1 ^= &Z)
         &MEMS = '&CMEM1*&CMEM2'
  IF (&MEMS = &Z)  /* NO MEMBER NAME SO FAR*/
      IF (&GROUP = '6')
          &MEMS = ':'
          &GROUP=&Z
      IF (&GROUP = 'TODAY')
          &MEMS = ':'
          &ADDON='TODAY'
  IF (&MEMS = &Z)  /* NO MEMBER NAME SO FAR*/
     IF (&GROUP ^= &Z)
        &MEMS='(&GROUP)'
  IF (&MEMS = &Z) /* NO MEMBER NAME SO FAR*/
         &MEMS = '&PMEM1/&PMEM2'
         IF (&MEMS = '/')
            &MEMS = &Z
  IF (&MEMS = &Z)  /* NO MEMBER NAME SO FAR*/
         &MEMS = '&RMEM1:&RMEM2'
         IF (&MEMS = ':')
            &MEMS = &Z
  IF (&MEMS = &Z)
      &MEMS = '*'
  IF (&RSET= 'YES') &ADDON='&ADDON RESET'
  IF (&LKDT= 'YES') &ADDON='&ADDON LKEDDATE'
  IF (&LKDT= 'NO') &ADDON='&ADDON NOLKEDDATE'
  IF (&PROM  = 'NO')
     &PDSZSEL ='MEMLIST &MEMS &ADDON'
  IF (&PROM  = 'YES')
     &OPERS = '&MEMS &ADDON'
     &PDSZSEL ='?'
     &ZCMD  = &Z
)END
