)ATTR DEFAULT(%+_)
    % TYPE(TEXT) INTENS(HIGH) COLOR(WHITE) SKIP(ON)
    Ö TYPE(TEXT) INTENS(HIGH) COLOR(YELLOW)
    + TYPE(TEXT) INTENS(LOW)  COLOR(TURQ) SKIP(ON)
    _ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED)
    ^ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED) PAD(_)
    | TYPE(INPUT) INTENS(HIGH) CAPS(OFF)
)BODY EXPAND(\\)
+-\-\-ÖO.L    LIST Subcommand+-\-\-
%OPTION  ===>|ZCMD
%
+Enter the member group name and any operands below for%LIST:
%===>|LOPER

+
+Operands: %memgroup +    (e.g., *; start:end; start:; first*pat; range*
%           NUM / SNUM / NONUM / LBLOCK / LDUMP / BLOCK / DUMP
%           OFFSET(hex)    MODULE(Partname)
%           MAXIN(num)     MAXLEN(num)      MAXOUT(num)
%           SKIPCOL(num)   SKIPREC(num)
+
+Defaults:  memgroup, NUM or the previous LIST/FIND/REPLACE format
)INIT
  &LOPER  = '&OPERS'
  .CURSOR = LOPER
  .HELP   = P84OPHH
  IF(&LOPER  = &Z) &LOPER=&P84#LI1
)PROC
 &P84#LI1=&LOPER
 &PDSZSEL='List  &LOPER'
)END
