)ATTR DEFAULT(%+_)
    % TYPE(TEXT) INTENS(HIGH) COLOR(WHITE) SKIP(ON)
    Ö TYPE(TEXT) INTENS(HIGH) COLOR(YELLOW)
    + TYPE(TEXT) INTENS(LOW)  COLOR(TURQ) SKIP(ON)
    _ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED)
    ^ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED) PAD(_)
    | TYPE(INPUT) INTENS(HIGH) CAPS(OFF)
)BODY EXPAND(\\)
%TUTORIAL  +-\-\-ÖPDS+CAX Display Panel+-\-\-
%OPTION  ===>_ZCMD
%               ---------------------------------------------
%               × CAX Active Catalog Display    %           ×
%               ---------------------------------------------
+
   This display provides a list of active catalogs as indicated by the
   CAXWA (Catalog AuXiliary Work Area) control block chain. These
   catalogs are allocated by one or more users. The display is sorted
   in the order of the CAXWA control block chain unless the SORT command
   is used to change the order.

   The following topics are presented in sequence or may be requested by
    %1+ Primary commands          %4+ Line commands
    %2+ F (find) command          %5+ Block line commands
    %3+ SORT command              %6+ Output interpretation
   The following optional topic may be requested by number:
    %7+ ISPF commands and PF keys
)PROC
  &ZSEL = TRANS(&ZCMD  1,P84PNOP
                       2,P84PNOF
                       3,P84PNOS
                       4,P84PNOL
                       5,P84PNOB
                       6,P84PNOO
                       7,*ISP01304  *,'?')
)END
