)ATTR DEFAULT(%+_)
    % TYPE(TEXT) INTENS(HIGH) COLOR(WHITE) SKIP(ON)
    Ö TYPE(TEXT) INTENS(HIGH) COLOR(YELLOW)
    + TYPE(TEXT) INTENS(LOW)  COLOR(TURQ) SKIP(ON)
    _ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED)
    ^ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED) PAD(_)
    | TYPE(INPUT) INTENS(HIGH) CAPS(OFF)
)BODY EXPAND(\\)
+-\-\-ÖPDS+LISTA Outputs+-\-\-
%OPTION  ===>_ZCMD
+
   The first LISTC panel shows basic dataset information like:
   DSNAME, VOLUME, attributes
   Command error messages are provided under the DATA header as follows:
    %*INVALID -+This line command is not supported

   The Second LISTC panel provides the full 44 character dataset name
   which only lieves room for little attribute information.

   The Third LISTC panel is a Triple line panel with most of dataset
   attribute and space information.

   The C and V field are to indecate if the dataset is cataloged and/or
   on the volume:  Y for yes or N for no or "-" for not unknown or check
)END
