)ATTR DEFAULT(%+_)
    % TYPE(TEXT) INTENS(HIGH) COLOR(WHITE) SKIP(ON)
    Ö TYPE(TEXT) INTENS(HIGH) COLOR(YELLOW)
    + TYPE(TEXT) INTENS(LOW)  COLOR(TURQ) SKIP(ON)
    _ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED)
    ^ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED) PAD(_)
    | TYPE(INPUT) INTENS(HIGH) CAPS(OFF)
)BODY EXPAND(\\)
+-\-\-ÖPDS Set Default Selection+-\-\-
%OPTION  ===>_ZCMD
+
+
 Choose one of the following:
+
    %SETENV  +- Set default enviornmental options
    %SETSEL  +- Set default select alias commands
    %SETLOG  +- Set default Log limit values
    %SETML   +- Set default member list options
    %SETV    +- Set default LISTV options
    %SETLF   +- Set default LISTFILE/LISTC options
    %SETTRAP +- Set default TRAP  options
)INIT
 .HELP = P84OP@PH
)PROC
 &PDSZSEL=TRANS(TRUNC(&ZCMD,'.')
        SETENV,'SETENV'
         SETEN,'SETENV'
          SETE,'SETENV'
        SETSEL,'SETSEL'
         SETSE,'SETSEL'
          SETS,'SETSEL'
        SETLOG,'SETLOG'
         SETLO,'SETLOG'
          SETL,'SETLOG'
         SETLF,'SETLF'
         SETML,'SETML'
          SETM,'SETML'
          SETV,'SETV'
       SETTRAP,'SETTRAP'
        SETTRA,'SETTRAP'
         SETTR,'SETTRAP'
          SETT,'SETTRAP'
           ' ',' '
             *,'?')
 &ZTRAIL=.TRAIL
 &OPERS=.TRAIL
)END
