)ATTR DEFAULT(%+_)
    % TYPE(TEXT) INTENS(HIGH) COLOR(WHITE) SKIP(ON)
    Ö TYPE(TEXT) INTENS(HIGH) COLOR(YELLOW)
    + TYPE(TEXT) INTENS(LOW)  COLOR(TURQ) SKIP(ON)
    _ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED)
    ^ TYPE(INPUT) INTENS(HIGH) CAPS(ON) JUST(LEFT) COLOR(RED) PAD(_)
    | TYPE(INPUT) INTENS(HIGH) CAPS(OFF)
)BODY EXPAND(\\)
+-\-\-ÖPASTE prompt panel+-\-\-+
%COMMAND ===>_ZCMD                                                     +
%
%Action       ====>_ACTN    +ÖZERO, KEEP, DEFAULTS, or blank for normal
+    Enter ÖEND key for no action
%CUT table name===>_CT+      Öany two charactor name for this one time
+                             blank for default
+
+  ZERO will delete previously CUT lines after the PASTE operation
+  KEEP will keep previously CUT lines after the PASTE operation to
+       be used by a later PASTE or added to by later CUT operations
+  DEFAULTS will display panel to set defaults
+  blank for normat action set by default
)INIT
  .CURSOR=ACTN
  .HELP=PASTEPR@
  IF (&CUTLIMIT=&Z) &CUTLIMIT=2000
  &CUTCOUNT=&CUTLIMIT
)PROC
 &ACTN=TRANS(TRUNC(&ACTN,1),
                              Z,ZERO
                              K,KEEP
                              D,DEFAULTS
                              H,HELP
                              P,PROMPT
                              *,'&ACTN')
 VER(&ACTN,LIST,ZERO,KEEP,DEFAULTS,HELP,PROMPT)
 VER(&CUTCOUNT,NB,RANGE,100,99999)
)END
%PASTE default ===>_PASTEDEF+ÖKEEP or ZERO
