//PDSGEN PROC  MEMBER=MISSING,
//             INSTLIB='PDS.INSTALL.LIBRARY'        <<=== INSTALL LIB
//ONE    EXEC  PGM=IEV90,REGION=2048K,
//             PARM=(DECK,NOOBJECT,NORLD,RENT,TERM,'XREF(SHORT)')
//SYSUT1   DD  UNIT=SYSDA,SPACE=(CYL,(10,5))
//SYSUT2   DD  UNIT=SYSDA,SPACE=(CYL,(10,5))
//SYSUT3   DD  UNIT=SYSDA,SPACE=(CYL,(10,5))
//SYSPUNCH DD  UNIT=SYSDA,SPACE=(TRK,(5,5)),DISP=(MOD,PASS),DSN=&&X,
//             DCB=BLKSIZE=3120
//SYSPRINT DD  SYSOUT=*
//SYSTERM  DD  SYSOUT=*
//SYSIN    DD  DISP=SHR,DSN=&INSTLIB.(&MEMBER)
//SYSLIB   DD  DSN=SYS1.AMODGEN,DISP=SHR,DCB=BLKSIZE=16000
//         DD  DSN=SYS1.MACLIB,DISP=SHR
//         DD  DSN=&INSTLIB,DISP=SHR
//       PEND
//*
//PDSMAIN  EXEC  PDSGEN,MEMBER=@PDSMAIN
//*
//SUBS     EXEC  PDSGEN,MEMBER=@SUBS
//*
//PARSE    EXEC  PDSGEN,MEMBER=@PARSE
//*
//DIALOG   EXEC  PDSGEN,MEMBER=@DIALOG
//*
//*
//LK1    EXEC  PGM=IEWL,PARM='MAP,RENT,REUS,REFR,NCAL',COND=(0,LT)
//SYSPRINT DD  SYSOUT=*
//IN       DD  DSN=&&X,DISP=(OLD,DELETE)
//SYSLMOD  DD  DISP=SHR,DSN=LINKLIST.LIB            <<=== LINK TARGET
//SYSUT1   DD  UNIT=SYSDA,SPACE=(TRK,(5,5))
//SYSLIN   DD  *
  INCLUDE  IN
  ENTRY    PDSMAIN
  ORDER    PDSMAIN(P)
  NAME     PDS84(R)                                 <<=== LOADMOD NAME
