//HERC01WT JOB (DELAY),'do a DELAY',CLASS=A,MSGCLASS=X
//********************************************************************
//*
//* Name: SYS2.JCLLIB(DELAY)
//*
//* Desc: Run the DELAY program
//*
//********************************************************************
//DELAY11 EXEC PGM=BSPDELAY,PARM=11   Delay 11 seconds
