//HERC01DL JOB (EREP),'Dump LOGREC',CLASS=A,MSGCLASS=X
//* USER=HERC01,PASSWORD=xxxxxxxx
//*
//*********************************************************************
//*
//* Name: SYS2.JCLLIB(EREP0000)
//*
//* Desc: Dump SYS1.LOGREC to new generation data set
//*
//*********************************************************************
//DUMPIT EXEC DUMPEREP
