//PROGLST JOB  (TSO),
//             'List password',
//             CLASS=A,
//             MSGCLASS=A,
//             COND=(0,NE),
//             MSGLEVEL=(1,1)
//*********************************************************************
//*
//* Name: SYS2.JCLLIB(PROGLST)
//*
//* Desc: List a password entry using IEHPROGM
//*
//*********************************************************************
//*
//PROTECT EXEC PGM=IEHPROGM
//SYSPRINT DD  SYSOUT=*
//SYSIN    DD  *
          LIST DSNAME=HERC01.TEST.CNTL,        Name of data set        C
               PASWORD1=YYYYYYYY               current password
