//SPZAP001 JOB (JCLLIB),
//             'DUMP an LMOD',
//             CLASS=A,
//             MSGCLASS=A,
//             REGION=2048K,
//             MSGLEVEL=(0,0),
//             NOTIFY=HERC01
//********************************************************************
//*
//* Name: SYS2.JCLLIB(SPZAP001)
//*
//* Desc: Dump a load module
//*
//********************************************************************
//COPYPDS EXEC PGM=AMASPZAP
//SYSPRINT DD  SYSOUT=*
//SYSLIB   DD  DISP=SHR,DSN=SYS1.NUCLEUS
//SYSIN    DD  *
 DUMP  IEANUC01 IGC018
 DUMPT IEANUC01 IGC018
//
