//SP2DTR   JOB ,JACK,CLASS=9,MSGCLASS=A
/*JOBPARM Q=F,I
/*SETUP        TAPE9,1
//*
//* DISTRIBUTION TAPE FOR NERDC VERSION OF JES2 SP2 STUFF.
//*
//* FILE1 - IEBCOPY DUMP OF NERDC QUEUE COMMAND. (SEE $UFDOC)
//*         (SUPPORT OF NJE OR SP2 VERSIONS VIA SYSPARM OPTIONS)
//*         (SOME OF THIS MAY BE ASSEMBLER H DEPENDENT)
//* FILE2 - COPY OF FILE1 JUST IN CASE THERE ARE PROBLEMS
//*         WITH THE TAPE.
//*
//* FOR FURTHER INFORMATION, CONTACT:
//*   JACK SCHUDEL
//*   NORTHEAST REGIONAL DATA CENTER
//*   ROOM 233 SSRB
//*   UNIVERSITY OF FLORIDA
//*   GAINESVILLE, FLORIDA  32611
//*   (904) 392-4601
//*
//COPY   EXEC  VEBCOPY
//SYSPRINT DD  SYSOUT=T
//IN       DD  DSN=NER.S685.NEW.QUEUE,DISP=SHR
//OUT      DD  DSN=NER.S685.QTEMP,DISP=(,PASS),
//             UNIT=SYSDA,VOL=SER=WORK03,
//             SPACE=(CYL,(3,3,36),RLSE)
//SYSIN    DD  *
 COPY INDD=IN,OUTDD=OUT
/*
//SCR    EXEC  PGM=IUTPROGM
//SYSPRINT DD  SYSOUT=T
//SYSIN    DD  *
 SCR MEMBER=$DTRDOC,DSN=NER.S685.QTEMP,V=WORK03
 CC  0
/*
//INITT  EXEC  PGM=IEHINITT
//SYSPRINT DD  SYSOUT=A
//TAPE1    DD  UNIT=(TAPE9,,DEFER),DCB=(DEN=4)
//SYSIN    DD  *
TAPE1    INITT SER=NERDTR,OWNER='NERDC.MODS'
/*
//F1     EXEC  VEBCOPY
//IN       DD  DSN=NER.S685.QTEMP,DISP=(OLD,DELETE)
//OUT1     DD  UNIT=TAPE9,VOL=SER=NERDTR,DISP=(,PASS),
//             LABEL=(1,SL),DSN=NER.JES2.QUEUE
//OUT2     DD  UNIT=TAPE9,VOL=SER=NERDTR,DISP=(,PASS),
//             LABEL=(2,SL),DSN=NER.JES2.QUEUE
//SYSIN    DD  *
 COPY INDD=IN,OUTDD=OUT1
 COPY INDD=IN,OUTDD=OUT2
/*
//*
//MAP    EXEC  PGM=TAPEMAP
//STEPLIB  DD  DSN=NER.S685.MNM.LOAD,DISP=SHR
//SYSPRINT DD  SYSOUT=A
//SYSPRNT2 DD  SYSOUT=A
//SYSUT1   DD  UNIT=TAPE9,VOL=SER=NERDTR,DISP=OLD
//SYSIN    DD  DUMMY
