//BLDLINIT     EXEC ASMVCL,
//   PARM.ASM='LOAD,NODECK,TERM,STMT,NUM',
//   PARM.LKED='MAP,LIST,XREF,NCAL,LET'
//ASM.SYSIN    DD   DSN=MVS.ASM(BLDLINIT),DISP=SHR
//LKED.SYSLMOD DD   DSN=MVS.LOAD,DISP=SHR
//LKED.SYSIN   DD   *
 ENTRY BLDLINIT
 SETCODE AC(1)
 NAME  BLDLINIT(R)
