++USERMOD(AK00002).
++VER(Z038) FMID(EBB1102) PRE(UZ22638)
/*   ZAP CSA LOWER BOUND FROM 8 MEG TO 6 MEG    */.
++ZAP(IEAVNIP0) .
NAME IEAVNIP0
VER 2E74 0080,0000     <-OLD VALUE OF NVTLSQAS
REP 2E74 0060,0000     <-NEW VALUE OF NVTLSQAS
IDRDATA AK00002
