++USERMOD(DC00002).
++ VER (Z038) FMID(EDM1102).
++UPDTE(IECSDSL1).
./ CHANGE NAME=IECSDSL1
         ORG   DS1SYSCD-1                                       HKG
DS1MODD  DS    XL3                 LAST-MOD-DATE (YY,DDDD)      DBC
DS1MODT  DS    XL2                 LAST-MOD-TOD (HH,MM)         DBC
DS1PROJ  DS    XL8                 YCC PROJECT STUFF            DBC
DS1RAC   DS    X                   SECURITY BYTE
DS1RBITS EQU   X'F0'              FIRST 4 BITS FOR READ
DS1WBITS EQU   X'0F'              NEXT FOR WRITE
DS1RSHFT EQU   4                  BIT SHIFT FOR READ DATA
DS1WHO   EQU   X'03'              EACH HAS 2 BITS FOR ACCESS SCOPE
DS1USER  EQU   X'00'              00 IS USER
DS1PRJCT EQU   X'01'              01 IS PROJECT
DS1DEPT  EQU   X'02'              10IS PROJECT GROUP (DEPARTMENT)
DS1ALL   EQU   X'03'              11 ANYONE CAN USE IT
DS1RFLG  EQU   X'0C'              TWO BITS OF SPECIAL FLAGS
DS1NOISE EQU   X'08'              PERMIT WITH MESSAGE
DS1LOG   EQU   X'04'              PERMIT BUT LOG ACCESS
