++USERMOD(HG00062)
     /* ZAP THE SEND COMMAND SO MESSAGES ARE NOT ROLLABLE */.
++ VER (Z038) FMID(EBB1102) PRE(UZ28726).
++ZAP(IKJEES11).
 NAME IKJEES11
 VER 062A 0005
 REP 062A 4000
 IDRDATA HG00062
