//S35607B  JOB (91004,4E),'BILL HORTON IEBCOPY',CLASS=A
/*NOTIFY ECDMVS1.S35607
/*CGROUP 08
/*NOTE THE OUTPUT TAPE WILL HAVE TO BE LABELED - IS CURRENTLY NL.
//IEBCOPY EXEC PGM=IEBCOPY,REGION=5000K,COND=(0,NE)
//SYSPRINT DD  SYSOUT=$
//SYSUT3   DD  UNIT=SYSDA,SPACE=(CYL,(25,20))
//SYSUT4   DD  UNIT=SYSDA,SPACE=(CYL,(25,20))
//IN1      DD  DSN=S35607.SHARE.CNTL,DISP=SHR
//OUT1     DD  DSN=SHARE.TEC.MODS,UNIT=3400-6,VOL=SER=SHRV27,
//             LABEL=EXPDT=98000,DISP=(NEW,KEEP)
//SYSIN    DD  *
 COPY INDD=IN1,OUTDD=OUT1
/*
