         TITLE 'IKJCT431 EXEC COMMAND SYMBOLIC PARAMETER DEFINITION    *
                        '
IKJCT431 CSECT ,                                                   0001
@MAINENT DS    0H                                                  0001
         USING *,@15                                               0001
         B     @PROLOG                                             0001
         DC    AL1(16)                                             0001
         DC    C'IKJCT431  78.048'                                 0001
         DROP  @15
@PROLOG  STM   @14,@12,12(@13)                                     0001
         BALR  @11,0                                               0001
@PSTART  LA    @12,4095(,@11)                                      0001
         USING @PSTART,@11                                         0001
         USING @PSTART+4095,@12                                    0001
         L     @00,@SIZDATD                                        0001
         GETMAIN  R,LV=(0)
         LR    @10,@01                                             0001
         USING @DATD,@10                                           0001
         ST    @13,@SA00001+4                                      0001
         LM    @00,@01,20(@13)                                     0001
         ST    @10,8(,@13)                                         0001
         LR    @13,@10                                             0001
         MVC   @PC00001(4),0(@01)                                  0001
*   ECDAPTR=R1;                     /* SAVE ADDRESS OF COMMON DATA   */
         LR    ECDAPTR,R1                                          0093
*   RFY                                                            0094
*     R1 UNRSTD;                                                   0094
*   LINELNG=RECLNG-CON4;            /* LINE LENGTH FOR FIRST RECORD  */
         L     @06,ECDAIREC(,ECDAPTR)                              0095
         LH    @06,RECLNG(,@06)                                    0095
         SL    @06,@CF00062                                        0095
         ST    @06,LINELNG                                         0095
*   ECB=CON0;                       /* INIT AN ECB FOR SERVICE RTNS  */
         SLR   @06,@06                                             0096
         ST    @06,ECB                                             0096
*   FLGCT431='';                    /* INITIALIZE FLAG AREA          */
         MVI   FLGCT431,X'00'                                      0097
*   ERRPTR=ADDR(ERRPARMS);          /* SERVICE RTN PARMLIST AREA     */
*                                                                  0098
         LA    @06,ERRPARMS                                        0098
         ST    @06,ERRPTR                                          0098
*   /*****************************************************************/
*   /*                                                               */
*   /* ISSUE GETMAIN FOR: LSD, EXECDATA, SNTAB, SVTAB AND THE FIRST  */
*   /* COMMAND PROCEDURE BLOCK                                       */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0099
*   RFY                                                            0099
*     R15 RSTD;                     /* ISSUE GETMAIN FOR STANDARD    */
*   DO;                             /* GETMAIN (EC) LV(GETSIZE)    0100
*                                      A(ECDAGADD) SP(78) RTCD(R15)  */
*     RESPECIFY                                                    0101
*      (GPR01P,                                                    0101
*       GPR15F) RESTRICTED;                                        0101
*     I004=I004&&I004;              /* INIT LIST                     */
         XC    I004(10),I004                                       0102
*     I00404='20'X;                 /* TYPE                          */
         MVI   I00404,X'20'                                        0103
*     I00401=GETSIZE;               /* LENGTH                        */
         MVC   I00401(4),@CF01243                                  0104
*     I00403=ADDR(ECDAGADD);        /* ADDR OF ADDR LIST             */
         LA    @14,ECDAGADD(,ECDAPTR)                              0105
         STCM  @14,7,I00403                                        0105
*     I00405=78;                    /* SUBPOOL VALUE                 */
         MVI   I00405,X'4E'                                        0106
*     GPR01P=ADDR(I004);            /* REG1 POINTS TO LIST           */
         LA    GPR01P,I004                                         0107
*     SVC(4);                       /* STANDARD-FORM OF GETMAIN      */
         SVC   4                                                   0108
*     R15=GPR15F;                   /* SET RETURN CODE               */
*     RESPECIFY                                                    0110
*      (GPR01P,                                                    0110
*       GPR15F) UNRESTRICTED;                                      0110
*   END;                            /* GETMAIN (EC) LV(GETSIZE)    0111
*                                      A(ECDAGADD) SP(78) RTCD(R15)
*                                      EXEC                          */
*                                                                  0112
*   /*****************************************************************/
*   /*                                                               */
*   /* CHECK GETMAIN RETURN CODE                                     */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0112
*   IF R15^=CON0 THEN               /* CONTROL BLOCKS                */
         LTR   R15,R15                                             0112
         BZ    @RF00112                                            0112
*     DO;                           /* IF STORAGE COULD NOT BE       */
*       RFY                                                        0114
*         R15 UNRSTD;               /* OBTAINED THEN NOTIFY USER AND */
*       EXMSGID=M511;               /* RETURN RC=16                  */
         MVC   EXMSGID(4),@CC01271                                 0115
*       CALL MSGRTN;                /* ISSUE MESSAGE                 */
         BAL   @14,MSGRTN                                          0116
*       NOTEXEC=YES;                /* COMMAND PROCEDURE NOT       0117
*                                      EXECUTABLE                    */
         OI    NOTEXEC(ECDAPTR),B'01000000'                        0117
*       CT431RET=CON16;                                            0118
         MVC   CT431RET(4),@CF01028                                0118
*     END;                          /* CONTROL RETURNS TO EXIT POINT */
*                                                                  0119
*   /*****************************************************************/
*   /*                                                               */
*   /* IF ERRORS HAVE OCCURRED THEN CONTROL RETURNS TO IKJCT431 EXIT */
*   /* POINT                                                         */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0120
*                                                                  0120
*   /*****************************************************************/
*   /*                                                               */
*   /* INITIALIZE THE EXEC CONTROL BLOCKS - FIRST THE LSD            */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0120
*   ELSE                            /* GETMAIN SUCCESSFUL - CONTINUE */
*     DO;                                                          0120
         B     @RC00112                                            0120
@RF00112 DS    0H                                                  0121
*       SP78BLK=YES;                /* INDICATE CORE HAS BEEN GOTTEN */
*       SP78CORE=YES;                                              0122
         OI    SP78BLK(ECDAPTR),B'00100100'                        0122
*       ECDALSD=ECDAGADD;           /* LSD IS FIRST BLOCK IN INITIAL */
         L     @06,ECDAGADD(,ECDAPTR)                              0123
         ST    @06,ECDALSD(,ECDAPTR)                               0123
*       LSDRCLEN=CON0;              /* GETMAIN AREA - RECLEN IS      */
         SLR   @15,@15                                             0124
         L     @14,LSDPTR(,ECDAPTR)                                0124
         STH   @15,LSDRCLEN(,@14)                                  0124
*       LSDADATA=ECDAGADD+HALF;     /* VARIABLE                      */
         LA    @09,2048                                            0125
         LR    @08,@06                                             0125
         ALR   @08,@09                                             0125
         ST    @08,LSDADATA(,@14)                                  0125
*       LSDANEXT=LSDADATA+CON12;    /* UPDATE PAST BLOCK HEADER      */
         LA    @05,12                                              0126
         ALR   @08,@05                                             0126
         ST    @08,LSDANEXT(,@14)                                  0126
*       LSDBLKID=CON1;              /* INIT TO ID OF FIRST BLOCK     */
         MVI   LSDBLKID(@14),X'01'                                 0127
*       LSDADAID=CON1;                                             0128
         MVI   LSDADAID(@14),X'01'                                 0128
*       LSDEXEC=ECDALSD+((LENGTH(LSD)+CON7)/CON8*CON8);/* PLACE    0129
*                                      EXECDATA ON DOUBLE WORD     0129
*                                      BOUNDRY                       */
*                                                                  0129
         AL    @06,@CF01028                                        0129
         ST    @06,LSDEXEC(,@14)                                   0129
*       /*************************************************************/
*       /*                                                           */
*       /* INITIALIZE THE COMMAND PROCEDURE BLOCK HEADER INFORMATION */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0130
*       ECDACBLK=LSDADATA;          /* INITIALIZE COMMAND PROCEDURE  */
         L     @08,LSDADATA(,@14)                                  0130
         ST    @08,ECDACBLK(,ECDAPTR)                              0130
*       ECDACNXT=LSDANEXT;                                         0131
         L     @14,LSDANEXT(,@14)                                  0131
         ST    @14,ECDACNXT(,ECDAPTR)                              0131
*       ECDACPRE=ECDACNXT;          /* SAME AS NEXT PTR INITIALLY    */
         ST    @14,ECDACPRE(,ECDAPTR)                              0132
*       COMPRNXT=CON0;              /* INDICATE NO MORE BLOCKS       */
         STCM  @15,7,COMPRNXT(@08)                                 0133
*       COMPRID=CON1;               /* THIS IS FIRST BLOCK           */
         MVI   COMPRID(@08),X'01'                                  0134
*       COMPRLNG=HALF;              /* ORIGIONAL SIZE IS HALF OF PAGE*/
         ST    @09,COMPRLNG(,@08)                                  0135
*       COMPRUSE=CON12;                                            0136
         ST    @05,COMPRUSE(,@08)                                  0136
*                                                                  0137
*       /*************************************************************/
*       /*                                                           */
*       /* INITIALIZE THE EXEC DATA CONTROL BLOCK                    */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0137
*       EXECDATA=EXECDATA&&EXECDATA;/* CLEAR CORE                    */
         XC    EXECDATA(64,@06),EXECDATA(@06)                      0137
*       IF NESTED=YES THEN          /* IF THIS IS A NESTED EXEC THEN */
         TM    NESTED(ECDAPTR),B'00000010'                         0138
         BNO   @RF00138                                            0138
*         GEXECDAT=ECDAGDAT->GEXECDAT;/* PICK UP ADDRESS OF NEXT   0139
*                                      LOWER EXECDATA OTHERWISE      */
         L     @01,ECDAGDAT(,ECDAPTR)                              0139
         L     @15,GEXECDAT(,@01)                                  0139
         ST    @15,GEXECDAT(,@06)                                  0139
*       ELSE                        /* SAVE THE ADDRESS OF FIRST     */
*         GEXECDAT=ADDR(EXECDATA);  /* LEVEL EXECDATA                */
         B     @RC00138                                            0140
@RF00138 L     @06,LSDPTR(,ECDAPTR)                                0140
         L     @06,LSDEXEC(,@06)                                   0140
         ST    @06,GEXECDAT(,@06)                                  0140
*       SNTABFST=LSDEXEC+(LENGTH(EXECDATA)+CON7)/CON8*CON8;/* SPLIT  */
@RC00138 L     @06,LSDPTR(,ECDAPTR)                                0141
         L     @06,LSDEXEC(,@06)                                   0141
         LA    @15,64                                              0141
         ALR   @15,@06                                             0141
         ST    @15,SNTABFST(,@06)                                  0141
*       SNTABPTR=SNTABFST;          /* REMAINING CORE BETWEEN SNTAB
*                                      AND SVTAB                     */
         ST    @15,SNTABPTR                                        0142
*       SVTABFST=SNTABPTR+((((CPBLKPTR-SNTABBLK)/CON2)+CON7)/CON8*CON8)
*           ;                                                      0143
         L     @14,SNTABBLK-1                                      0143
         LA    @14,0(,@14)                                         0143
         L     @05,CPBLKPTR-1(,ECDAPTR)                            0143
         LA    @05,0(,@05)                                         0143
         LR    @00,@05                                             0143
         SLR   @00,@14                                             0143
         SRDA  @00,32                                              0143
         D     @00,@CF00064                                        0143
         LR    @02,@01                                             0143
         AL    @02,@CF00139                                        0143
         SRDA  @02,32                                              0143
         D     @02,@CF00078                                        0143
         SLA   @03,3                                               0143
         ALR   @03,@15                                             0143
         ST    @03,SVTABFST(,@06)                                  0143
*       SVTABPTR=SVTABFST;                                         0144
*                                                                  0144
         ST    @03,SVTABPTR                                        0144
*       /*************************************************************/
*       /*                                                           */
*       /* INITIALIZE FIRST SNTAB                                    */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0145
*       SNTABNXT=CON0;              /* ONLY ONE BLOCK                */
         SLR   @06,@06                                             0145
         ST    @06,SNTABNXT(,@15)                                  0145
*       SNTABLNG=SVTABBLK-SNTABBLK; /* TOTAL LENGTH                  */
         L     @04,SVTABBLK-1                                      0146
         LA    @04,0(,@04)                                         0146
         LCR   @14,@14                                             0146
         ALR   @14,@04                                             0146
         ST    @14,SNTABLNG(,@15)                                  0146
*       SNTABUSE=LENGTH(SNTAB);     /* 12 BYTES OCCUPIED BY HEADER   */
         MVC   SNTABUSE(4,@15),@CF01091                            0147
*       SNTELPTR=ADDR(SNTELFST);    /* FIRST AVAILABLE SLOT          */
*                                                                  0148
         LA    SNTELPTR,SNTELFST(,@15)                             0148
*       /*************************************************************/
*       /*                                                           */
*       /* INITIALIZE FIRST SVTAB                                    */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0149
*       SVTABNXT=CON0;              /* ONLY ONE BLOCK                */
         ST    @06,SVTABNXT(,@03)                                  0149
*       SVTABLNG=CPBLKPTR-SVTABBLK; /* TOTAL LENGTH                  */
         SLR   @05,@04                                             0150
         ST    @05,SVTABLNG(,@03)                                  0150
*       SVTABUSE=LENGTH(SVTAB);     /* 16 BYTES OCCUPIED BY HEADER   */
         MVC   SVTABUSE(4,@03),@CF01028                            0151
*       SVTABFRE=CON0;              /* NO UNUSED BYTES               */
         ST    @06,SVTABFRE(,@03)                                  0152
*       SVTELPTR=ADDR(SVTELFST);    /* ALL CONTROL BLOCKS ARE BUILT  */
         LA    SVTELPTR,SVTELFST(,@03)                             0153
*       SP78BLK=NO;                                                0154
         NI    SP78BLK(ECDAPTR),B'11111011'                        0154
*                                                                  0155
*       /*************************************************************/
*       /*                                                           */
*       /* INITIALIZE THE CONTROL VARIABLES INITIALIZE A NULL VALUE  */
*       /* ELEMENT AND ALL CONTROL VARIABLES WITH A NULL VALUE LIST  */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0155
*       SVTELPTR->SVTLNG=CON0;      /* NULL ELEMENT LENGTH           */
         STH   @06,SVTLNG(,SVTELPTR)                               0155
*       SVTELPTR->SVTORIG=CON0;     /* NULL ELEMENT FREE LENGTH      */
         STH   @06,SVTORIG(,SVTELPTR)                              0156
*       CALL SVTELUPT;                                             0157
         BAL   @14,SVTELUPT                                        0157
*       RFY                                                        0158
*        (R2,                                                      0158
*         R3,                                                      0158
*         R4,                                                      0158
*         R5) RSTD;                                                0158
*       R2=ADDR(CVARMAP);           /* ADDRESS OF CVAR AREA          */
         L     R2,SNTABPTR                                         0159
         LA    R2,CVARMAP(,R2)                                     0159
*       R3=LENGTH(CVARMAP);         /* LENGTH TO INITIALIZE          */
         LA    R3,272                                              0160
*       R4=R2;                      /* NO DATA TO MOVE               */
         LR    R4,R2                                               0161
*       R5=CON0;                    /* PADS CVARMAP WITH ZEROS       */
         SLR   R5,R5                                               0162
*       MVCL(R2,R4);                /* ZERO AREA                     */
         MVCL  R2,R4                                               0163
*       RFY                                                        0164
*        (R2,                                                      0164
*         R3,                                                      0164
*         R4,                                                      0164
*         R5) UNRSTD;                                              0164
*       DO ICTR=1 TO DIM(NULLVAR);  /* INITIALIZE NULL VALUE       0165
*                                      VARIABLES                     */
         LA    ICTR,1                                              0165
@DL00165 DS    0H                                                  0166
*         SNTDATA(1:NULLEN(ICTR))=NULLADR(ICTR)->NULLVDAT(1:NULLEN(ICTR
*             ));                                                  0166
         LR    @15,ICTR                                            0166
         SLA   @15,2                                               0166
         SLR   @14,@14                                             0166
         IC    @14,NULLEN-4(@15)                                   0166
         LR    @05,@14                                             0166
         BCTR  @05,0                                               0166
         L     @01,NULLADR-5(@15)                                  0166
         EX    @05,@SM01540                                        0166
*         SNTLNG=NULLEN(ICTR);                                     0167
         STH   @14,SNTLNG(,SNTELPTR)                               0167
*         SNTVLPTR=ADDR(SVTELFST);                                 0168
         L     @01,SVTABPTR                                        0168
         LA    @15,SVTELFST(,@01)                                  0168
         ST    @15,SNTVLPTR(,SNTELPTR)                             0168
*         IF ICTR<CON11 THEN        /* FIRST 10 VARIABLES REQUIRE    */
         C     ICTR,@CF01262                                       0169
         BNL   @RF00169                                            0169
*           SNTEVAL=YES;            /* IMMEDIATE EVALUATION          */
         OI    SNTEVAL(SNTELPTR),B'00000010'                       0170
*         IF ICTR<=CON15 THEN       /* FIRST 15 VARIABLES CAN NOT    */
@RF00169 C     ICTR,@CF00059                                       0171
         BH    @RF00171                                            0171
*           SNTNAUTH=YES;           /* BE SET BY USER                */
         OI    SNTNAUTH(SNTELPTR),B'00000100'                      0172
*         SNTABUSE=SNTABUSE+SNTLNG+LENGTH(SNTELEM);                0173
@RF00171 L     @15,SNTABPTR                                        0173
         LA    @14,8                                               0173
         LH    @05,SNTLNG(,SNTELPTR)                               0173
         L     @04,SNTABUSE(,@15)                                  0173
         ALR   @04,@05                                             0173
         ALR   @04,@14                                             0173
         ST    @04,SNTABUSE(,@15)                                  0173
*         SNTELPTR=SNTELPTR+SNTLNG+LENGTH(SNTELEM);                0174
         ALR   @05,SNTELPTR                                        0174
         ALR   @05,@14                                             0174
         LR    SNTELPTR,@05                                        0174
*       END;                                                       0175
         AL    ICTR,@CF00035                                       0175
         C     ICTR,@CF01397                                       0175
         BNH   @DL00165                                            0175
*       RFY                                                        0176
*         SVTELEM BASED(SVTELPTR);                                 0176
*                                                                  0177
*       /*************************************************************/
*       /*                                                           */
*       /* INITIALIZE THOSE CONTROL VARIABLES REQUIRING VALUES       */
*       /* -SYSUID                                                   */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0177
*       SVTDATA(1:PSCBUSRL)=PSCBUSER(1:PSCBUSRL);                  0177
         L     @06,CPPLPTR(,ECDAPTR)                               0177
         L     @06,PSCBPTR(,@06)                                   0177
         SLR   @15,@15                                             0177
         IC    @15,PSCBUSRL(,@06)                                  0177
         LR    @14,@15                                             0177
         BCTR  @14,0                                               0177
         EX    @14,@SM01544                                        0177
*       SVTLNG=PSCBUSRL;            /* USERID LENGTH                 */
         STH   @15,SVTLNG(,SVTELPTR)                               0178
*       SVTORIG=SVTLNG;             /* ORIGIONAL LENGTH SAME         */
         STH   @15,SVTORIG(,SVTELPTR)                              0179
*       CUIDVAL=SVTELPTR;           /* SNTAB VALUE POINTER           */
         L     @06,SNTABPTR                                        0180
         STCM  SVTELPTR,15,CUIDVAL(@06)                            0180
*       CALL SVTELUPT;                                             0181
*                                                                  0181
         BAL   @14,SVTELUPT                                        0181
*       /*************************************************************/
*       /*                                                           */
*       /* -SYSPROC                                                  */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0182
*       DO;                         /* EXTRACT (TIOTPTR,'S')       0182
*                                      FIELDS(TIOT)                  */
*         RESPECIFY                                                0183
*          (GPR01P) RESTRICTED;                                    0183
*         I040=I040&&I040;          /* ZERO OUT THE LIST             */
         XC    I040(12),I040                                       0184
*         I04001=ADDR(TIOTPTR);     /* SET ANSWER AREA ADDR IN LIST  */
         LA    @06,TIOTPTR                                         0185
         ST    @06,I04001                                          0185
*         I04002=0;                 /* INDICATE CURRENT TASK         */
         SLR   @06,@06                                             0186
         ST    @06,I04002                                          0186
*         I04003='0000001000000000'B;/* SET TCB EXTRACT FIELD BITS   */
         MVC   I04003(2),@CB01458                                  0187
*         GPR01P=ADDR(I040);        /* LOAD ADDRESS OF LIST          */
         LA    GPR01P,I040                                         0188
*         SVC(40);                  /* ISSUE EXTRACT SVC             */
         SVC   40                                                  0189
*         RESPECIFY                                                0190
*          (GPR01P) UNRESTRICTED;                                  0190
*       END;                        /* EXTRACT (TIOTPTR,'S')       0191
*                                      FIELDS(TIOT)                  */
*       DO ICTR=8 TO 1 BY-1 WHILE(TIOTPROC(ICTR)=BLANK);/* DETERMINE */
         LA    ICTR,8                                              0192
@DL00192 L     @01,TIOTPTR                                         0192
         ALR   @01,ICTR                                            0192
         CLI   TIOTPROC-1(@01),C' '                                0192
         BNE   @DC00192                                            0192
*       END;                        /* LENGTH OF THE PROCEDURE NAME  */
         BCTR  ICTR,0                                              0193
         LTR   ICTR,ICTR                                           0193
         BP    @DL00192                                            0193
@DC00192 DS    0H                                                  0194
*       IF ICTR>CON0 THEN           /* MOVE PROCNAME IN IF PRESENT   */
         LTR   ICTR,ICTR                                           0194
         BNP   @RF00194                                            0194
*         DO;                                                      0195
*           SVTDATA(1:ICTR)=TIOTPROC(1:ICTR);                      0196
         LR    @15,ICTR                                            0196
         BCTR  @15,0                                               0196
         L     @01,TIOTPTR                                         0196
         EX    @15,@SM01546                                        0196
*           SVTLNG=ICTR;                                           0197
         STH   ICTR,SVTLNG(,SVTELPTR)                              0197
*           SVTORIG=ICTR;                                          0198
         STH   ICTR,SVTORIG(,SVTELPTR)                             0198
*           CPROCVAL=SVTELPTR;                                     0199
         L     @06,SNTABPTR                                        0199
         STCM  SVTELPTR,15,CPROCVAL(@06)                           0199
*           CALL SVTELUPT;                                         0200
         BAL   @14,SVTELUPT                                        0200
*         END;                                                     0201
*       ELSE                        /* IF NO PROCNAME THEN SET TO    */
*         CPROCVAL=ADDR(SVTELFST);  /* NULL ELEMENT                  */
         B     @RC00194                                            0202
@RF00194 L     @06,SVTABPTR                                        0202
         LA    @06,SVTELFST(,@06)                                  0202
         L     @01,SNTABPTR                                        0202
         STCM  @06,15,CPROCVAL(@01)                                0202
*                                                                  0203
*       /*************************************************************/
*       /*                                                           */
*       /* - LASTCC                                                  */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0203
*       SVTDATA(1)=CONC0;           /* LASTCC INITIALIZED TO ZERO    */
@RC00194 MVI   SVTDATA(SVTELPTR),C'0'                              0203
*       SVTLNG=LENGTH(CONC0);                                      0204
         MVC   SVTLNG(2,SVTELPTR),@CH00035                         0204
*       SVTORIG=CON4;               /* RESERVE FOUR BYTES            */
         MVC   SVTORIG(2,SVTELPTR),@CH00062                        0205
*       CLCCVAL=SVTELPTR;                                          0206
         L     @06,SNTABPTR                                        0206
         STCM  SVTELPTR,15,CLCCVAL(@06)                            0206
*       SVTABFRE=SVTABFRE+CON3;     /* UP FREE SPACE                 */
         L     @06,SVTABPTR                                        0207
         LA    @15,3                                               0207
         AL    @15,SVTABFRE(,@06)                                  0207
         ST    @15,SVTABFRE(,@06)                                  0207
*       CALL SVTELUPT;                                             0208
*                                                                  0208
         BAL   @14,SVTELUPT                                        0208
*       /*************************************************************/
*       /*                                                           */
*       /* -MAXCC                                                    */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0209
*       SVTDATA(1)=CONC0;                                          0209
         MVI   SVTDATA(SVTELPTR),C'0'                              0209
*       SVTLNG=LENGTH(CONC0);                                      0210
         MVC   SVTLNG(2,SVTELPTR),@CH00035                         0210
*       SVTORIG=CON4;                                              0211
         MVC   SVTORIG(2,SVTELPTR),@CH00062                        0211
*       CMCCVAL=SVTELPTR;                                          0212
         L     @06,SNTABPTR                                        0212
         ST    SVTELPTR,CMCCVAL(,@06)                              0212
*       SVTABFRE=SVTABFRE+CON3;                                    0213
         L     @06,SVTABPTR                                        0213
         LA    @15,3                                               0213
         AL    @15,SVTABFRE(,@06)                                  0213
         ST    @15,SVTABFRE(,@06)                                  0213
*       CALL SVTELUPT;                                             0214
*                                                                  0214
         BAL   @14,SVTELUPT                                        0214
*       /*************************************************************/
*       /*                                                           */
*       /* -SYSSCAN                                                  */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0215
*       SVTDATA(1:2)=CONC16;        /* DEFAULT IS 16                 */
         MVC   SVTDATA(2,SVTELPTR),@CC01349                        0215
*       SVTLNG=LENGTH(CONC16);                                     0216
         LA    @06,2                                               0216
         STH   @06,SVTLNG(,SVTELPTR)                               0216
*       SVTORIG=CON4;               /* FOUR BYTES ALLOCATED TO THIS  */
         MVC   SVTORIG(2,SVTELPTR),@CH00062                        0217
*       CSCANVAL=SVTELPTR;          /* VARIABLE                      */
         L     @01,SNTABPTR                                        0218
         STCM  SVTELPTR,15,CSCANVAL(@01)                           0218
*       SVTABFRE=SVTABFRE+CON2;                                    0219
         L     @15,SVTABPTR                                        0219
         AL    @06,SVTABFRE(,@15)                                  0219
         ST    @06,SVTABFRE(,@15)                                  0219
*       CALL SVTELUPT;                                             0220
         BAL   @14,SVTELUPT                                        0220
*                                                                  0221
*       /*************************************************************/
*       /*                                                           */
*       /* -SYSDLM                                                   */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0221
*       SVTDATA(1)=CONC0;           /* DEFAULT VALUE IS 0            */
         MVI   SVTDATA(SVTELPTR),C'0'                              0221
*       SVTLNG=LENGTH(CONC0);                                      0222
         LA    @06,1                                               0222
         STH   @06,SVTLNG(,SVTELPTR)                               0222
*       SVTORIG=CON2;                                              0223
         MVC   SVTORIG(2,SVTELPTR),@CH00064                        0223
*       CDLMVAL=SVTELPTR;                                          0224
         L     @01,SNTABPTR                                        0224
         STCM  SVTELPTR,15,CDLMVAL(@01)                            0224
*       SVTABFRE=SVTABFRE+CON1;                                    0225
         L     @15,SVTABPTR                                        0225
         AL    @06,SVTABFRE(,@15)                                  0225
         ST    @06,SVTABFRE(,@15)                                  0225
*       CALL SVTELUPT;                                             0226
*                                                                  0226
         BAL   @14,SVTELUPT                                        0226
*       /*************************************************************/
*       /*                                                           */
*       /* -SYSNEST                                                  */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0227
*       IF NESTED=YES THEN          /* IF WE ARE EXECUTING IN A      */
         TM    NESTED(ECDAPTR),B'00000010'                         0227
         BNO   @RF00227                                            0227
*         DO;                       /* NESTED LEVEL THEN VALUE IS    */
*           SVTDATA(1:LENGTH(NYES))=NYES;/* YES                      */
         MVC   SVTDATA(3,SVTELPTR),@CC01325                        0229
*           SVTORIG=LENGTH(NYES);                                  0230
         MVC   SVTORIG(2,SVTELPTR),@CH00187                        0230
*         END;                                                     0231
*       ELSE                        /* ELSE IT IS NO                 */
*         DO;                                                      0232
         B     @RC00227                                            0232
@RF00227 DS    0H                                                  0233
*           SVTDATA(1:LENGTH(NNO))=NNO;                            0233
         MVC   SVTDATA(2,SVTELPTR),@CC01327                        0233
*           SVTORIG=LENGTH(NNO);                                   0234
         MVC   SVTORIG(2,SVTELPTR),@CH00064                        0234
*         END;                                                     0235
*       SVTLNG=SVTORIG;             /* LENGTH IS SAME AS ORIGIONAL 0236
*                                      LNG                           */
@RC00227 LH    @06,SVTORIG(,SVTELPTR)                              0236
         STH   @06,SVTLNG(,SVTELPTR)                               0236
*       CNESTVAL=SVTELPTR;          /* SAVE ADDRESS OF VALUE         */
         L     @06,SNTABPTR                                        0237
         ST    SVTELPTR,CNESTVAL(,@06)                             0237
*       CALL SVTELUPT;                                             0238
*                                                                  0238
         BAL   @14,SVTELUPT                                        0238
*       /*************************************************************/
*       /*                                                           */
*       /* -SYSICMD                                                  */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0239
*       IF IMPLICIT=YES THEN        /* INIT TO IMPLICIT INVOC NAME   */
         TM    IMPLICIT(ECDAPTR),B'10000000'                       0239
         BNO   @RF00239                                            0239
*         DO;                                                      0240
*           SVTDATA(1:ECDAILNG)=PROCNAME(1:ECDAILNG);/* IMPLICIT NME */
         SLR   @06,@06                                             0241
         IC    @06,ECDAILNG(,ECDAPTR)                              0241
         LR    @15,@06                                             0241
         BCTR  @15,0                                               0241
         L     @01,ECDAINME(,ECDAPTR)                              0241
         EX    @15,@SM01548                                        0241
*           SVTORIG=ECDAILNG;       /* SAVE LENGTH                   */
         STH   @06,SVTORIG(,SVTELPTR)                              0242
*           SVTLNG=SVTORIG;                                        0243
         STH   @06,SVTLNG(,SVTELPTR)                               0243
*           CICMDVAL=SVTELPTR;      /* ADDR OF VALUE                 */
         L     @06,SNTABPTR                                        0244
         STCM  SVTELPTR,15,CICMDVAL(@06)                           0244
*           CALL SVTELUPT;          /* UPDATE TABLE INFO             */
         BAL   @14,SVTELUPT                                        0245
*         END;                                                     0246
*       ECDALNEL=ADDR(CSCANVAL);                                   0247
@RF00239 L     @15,SNTABPTR                                        0247
         LA    @14,CSCANVAL(,@15)                                  0247
         ST    @14,ECDALNEL(,ECDAPTR)                              0247
*       USNTABST=SNTABPTR+SNTABUSE;                                0248
         LR    @14,@15                                             0248
         AL    @14,SNTABUSE(,@15)                                  0248
         ST    @14,USNTABST                                        0248
*       RFY                                                        0249
*         SVTELEM BASED(SNTVLPTR);                                 0249
*                                                                  0249
*       /*************************************************************/
*       /*                                                           */
*       /* DETERMINE IF FIRST STATEMENT IS A PROC STATEMENT          */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0250
*       ICTR=CON1;                                                 0250
         LA    ICTR,1                                              0250
*       CALL SKIPSEP;               /* SKIP LEADING SEPERATORS       */
         BAL   @14,SKIPSEP                                         0251
*       SCTR=ICTR;                  /* SAVE START OF PARM            */
         LR    SCTR,ICTR                                           0252
*       CALL FINDSEP;               /* LOCATE THE NEXT SEPERATOR     */
         BAL   @14,FINDSEP                                         0253
*       IF(ICTR-SCTR)^=LENGTH(CPROC)×RECORD(SCTR:ICTR-CON1)^=CPROC THEN
         LR    @09,ICTR                                            0254
         SLR   @09,SCTR                                            0254
         C     @09,@CF00062                                        0254
         BNE   @RT00254                                            0254
         L     @03,ECDAIREC(,ECDAPTR)                              0254
         BCTR  @09,0                                               0254
         ALR   @03,SCTR                                            0254
         EX    @09,@SC01550                                        0254
         BE    @RF00254                                            0254
@RT00254 DS    0H                                                  0255
*         DO;                                                      0255
*           IF(IMPLICIT=NO&(VLST=YES&VLSTLNG^=CON0))×(IMPLICIT=YES&
*               ECTNOPD=NO) THEN    /* IF THERE WERE PARMS IN        */
         TM    IMPLICIT(ECDAPTR),B'10000000'                       0256
         BNZ   @GL00002                                            0256
         L     @06,ECDAEANS(,ECDAPTR)                              0256
         TM    VLST(@06),B'10000000'                               0256
         BNO   @GL00002                                            0256
         LH    @06,VLSTLNG(,@06)                                   0256
         LTR   @06,@06                                             0256
         BNZ   @RT00256                                            0256
@GL00002 TM    IMPLICIT(ECDAPTR),B'10000000'                       0256
         BNO   @RF00256                                            0256
         L     @06,CPPLPTR(,ECDAPTR)                               0256
         L     @06,ECTPTR(,@06)                                    0256
         TM    ECTNOPD(@06),B'10000000'                            0256
         BNZ   @RF00256                                            0256
@RT00256 DS    0H                                                  0257
*             DO;                   /* VALUE LIST AND NO PROC STMT   */
*               EXMSGID=A529;       /* THEN TELL USER THE VALUE LIST
*                                      PARMS ARE IGNORED             */
         MVC   EXMSGID(4),@CC01281                                 0258
*               IF IMPLICIT=NO THEN /* EXPLICIT - PICK UP ADDRESS OF */
         TM    IMPLICIT(ECDAPTR),B'10000000'                       0259
         BNZ   @RF00259                                            0259
*                 DO;               /* VALUE LIST FROM PARSE PDL     */
*                   MVAR(1)=VLSTPTR;                               0261
         L     @06,ECDAEANS(,ECDAPTR)                              0261
         L     @03,VLSTPTR(,@06)                                   0261
         ST    @03,MVAR                                            0261
*                   MVARLEN(1)=VLSTLNG;                            0262
         LH    @06,VLSTLNG(,@06)                                   0262
         STC   @06,MVARLEN                                         0262
*                 END;                                             0263
*               ELSE                /* IMPLICIT - PICK UP ADDRESS    */
*                 DO;               /* OF VALUE LIST ADDRESS USING   */
         B     @RC00259                                            0264
@RF00259 DS    0H                                                  0265
*                   MVAR(1)=ADDR(CBUFTEXT)+CBUFOFF;/* CMD BUFFER   0265
*                                      OFFSETS                       */
         L     @06,CPPLPTR(,ECDAPTR)                               0265
         L     @06,CPPLCBUF(,@06)                                  0265
         LA    @03,CBUFTEXT(,@06)                                  0265
         LH    @15,CBUFOFF(,@06)                                   0265
         ALR   @03,@15                                             0265
         ST    @03,MVAR                                            0265
*                   MVARLEN(1)=CBUFLNG-CBUFOFF;                    0266
         LCR   @15,@15                                             0266
         AH    @15,CBUFLNG(,@06)                                   0266
         STC   @15,MVARLEN                                         0266
*                 END;                                             0267
*               CALL MSGRTN;                                       0268
@RC00259 BAL   @14,MSGRTN                                          0268
*             END;                                                 0269
*           IF SCTR>LINELNG THEN    /* IF NOT PROC STMT OR IS NULL   */
@RF00256 C     SCTR,LINELNG                                        0270
         BNH   @RF00270                                            0270
*             CT431RET=CON4;        /* THEN RETURN, NULL STMTS ARE 0271
*                                      LOST                          */
         MVC   CT431RET(4),@CF00062                                0271
*           ELSE                    /* STMTS OTHER THAN PROC STMT ARE
*                                      RETURNED TO IKJCT430 SO THEY  */
*             CT431RET=CON0;        /* WILL BE PROCESSED BY IKJCT432 */
         B     @RC00270                                            0272
@RF00270 SLR   @15,@15                                             0272
         ST    @15,CT431RET                                        0272
*         END;                                                     0273
*                                                                  0273
*       /*************************************************************/
*       /*                                                           */
*       /* CONTROL RETURNS TO IKJCT431 EXIT POINT                    */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0274
*                                                                  0274
*       /*************************************************************/
*       /*                                                           */
*       /* SYNTAX CHECK THE POSITIONAL SPECIFICATION                 */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0274
*       ELSE                        /* CHECK POSIT SPECIFICATION     */
*         DO;                                                      0274
         B     @RC00254                                            0274
@RF00254 DS    0H                                                  0275
*           CT431RET=CON4;                                         0275
         MVC   CT431RET(4),@CF00062                                0275
*           CALL SKIPSEP;           /* FIND START OF NUMBER          */
         BAL   @14,SKIPSEP                                         0276
*           SCTR=ICTR;                                             0277
         LR    SCTR,ICTR                                           0277
*           CALL FINDSEP;           /* FIND END OF NUMBER            */
         BAL   @14,FINDSEP                                         0278
*           IF ICTR-SCTR>CON0&ICTR-SCTR<CON9 THEN/* IF NUMBER EIGHT
*                                      OR LESS BYTES                 */
         LR    @09,ICTR                                            0279
         SLR   @09,SCTR                                            0279
         LTR   @09,@09                                             0279
         BNP   @RF00279                                            0279
         C     @09,@CF01264                                        0279
         BNL   @RF00279                                            0279
*             DO;                   /* LONG THEN IT MAY BE VALID-    */
*               PCTR=CON8;          /* OVER EIGHT BYTES IT IS INVALID*/
         LA    PCTR,8                                              0281
*               PACKLOC='';                                        0282
*                                                                  0282
         MVI   PACKLOC,C' '                                        0282
         MVC   PACKLOC+1(7),PACKLOC                                0282
*               /*****************************************************/
*               /*                                                   */
*               /* PREPARE TO PACK AND CONVERT POSITIONAL            */
*               /* SPECIFICATION                                     */
*               /*                                                   */
*               /*****************************************************/
*                                                                  0283
*               DO JCTR=ICTR-CON1 TO SCTR BY-1 WHILE RECORD(JCTR)^<
*                     CONC0&RECORD(JCTR)^>CONC9;                   0283
         LR    @09,ICTR                                            0283
         BCTR  @09,0                                               0283
         ST    @09,JCTR                                            0283
         B     @DE00283                                            0283
@DL00283 L     @04,ECDAIREC(,ECDAPTR)                              0283
         ALR   @09,@04                                             0283
         CLI   RECORD-1(@09),C'0'                                  0283
         BL    @DC00283                                            0283
         L     @09,JCTR                                            0283
         ALR   @09,@04                                             0283
         CLI   RECORD-1(@09),C'9'                                  0283
         BH    @DC00283                                            0283
*                 PACKLOC(PCTR)=RECORD(JCTR);/* POSITIONAL         0284
*                                      SPECIFICATION MUST            */
         LA    @09,PACKLOC-1(PCTR)                                 0284
         L     @03,JCTR                                            0284
         ALR   @04,@03                                             0284
         MVC   0(1,@09),RECORD-1(@04)                              0284
*                 PCTR=PCTR-CON1;   /* BE NUMERIC                    */
         BCTR  PCTR,0                                              0285
*               END;                                               0286
         BCTR  @03,0                                               0286
         LR    @09,@03                                             0286
         ST    @09,JCTR                                            0286
@DE00283 CR    @09,SCTR                                            0286
         BNL   @DL00283                                            0286
@DC00283 DS    0H                                                  0287
*               IF JCTR^<SCTR THEN  /* IF ALL DIGITS WERE NOT MOVED  */
         C     SCTR,JCTR                                           0287
         BH    @RF00287                                            0287
*                 POSPCERR=YES;     /* IN THEN ONE OF THE DIGITS WAS
*                                      NOT NUMERIC - INDICATE      0288
*                                      POSITIONAL SPECIFICATION    0288
*                                      INVALID                       */
         OI    POSPCERR,B'01000000'                                0288
*               ELSE                /* CONVERT THE NUMBER TO BINARY  */
*                 DO;               /* AND SAVE                      */
         B     @RC00287                                            0289
@RF00287 DS    0H                                                  0290
*                   PACK(CVERTLOC,PACKLOC);                        0290
         PACK  CVERTLOC(8),PACKLOC(8)                              0290
*                   CVB(POSNUM,CVERTLOC);                          0291
         CVB   @09,CVERTLOC                                        0291
         ST    @09,POSNUM                                          0291
*                 END;                                             0292
*             END;                                                 0293
*           ELSE                                                   0294
*             POSPCERR=YES;                                        0294
         B     @RC00279                                            0294
@RF00279 OI    POSPCERR,B'01000000'                                0294
*           IF POSPCERR=YES THEN    /* IF POSITIONAL SPECIFICATION   */
@RC00279 TM    POSPCERR,B'01000000'                                0295
         BNO   @RF00295                                            0295
*             DO;                   /* INVALID NOTIFY USER AND       */
*               NOTEXEC=YES;        /* EXIT TO IKJCT430              */
         OI    NOTEXEC(ECDAPTR),B'01000000'                        0297
*               MVAR(1)=ADDR(RECORD(SCTR));                        0298
         L     @03,ECDAIREC(,ECDAPTR)                              0298
         LA    @03,RECORD-1(SCTR,@03)                              0298
         ST    @03,MVAR                                            0298
*               MVARLEN(1)=ICTR-SCTR;                              0299
         LR    @03,ICTR                                            0299
         SLR   @03,SCTR                                            0299
         STC   @03,MVARLEN                                         0299
*               EXMSGID=M506;                                      0300
         MVC   EXMSGID(4),@CC01369                                 0300
*               CALL MSGRTN;                                       0301
         BAL   @14,MSGRTN                                          0301
*             END;                                                 0302
*                                                                  0303
*           /*********************************************************/
*           /*                                                       */
*           /* SYNTAX CHECK EACH POSITIONAL PARAMETER                */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0303
*           ELSE                    /* POSIT SPECIFICATION O.K.      */
*             DO;                                                  0303
         B     @RC00295                                            0303
@RF00295 DS    0H                                                  0304
*               POSCHAR=CON0;                                      0304
         SLR   POSCHAR,POSCHAR                                     0304
*               CALL SKIPSEP;       /* SKIP PRECEEDING SEPERATORS    */
         BAL   @14,SKIPSEP                                         0305
*               DO PCTR=1 TO POSNUM WHILE ICTR<=LINELNG&STABERR=NO;/*
*                                      FIND PARAMETER START          */
         LA    PCTR,1                                              0306
         B     @DE00306                                            0306
@DL00306 C     ICTR,LINELNG                                        0306
         BH    @DC00306                                            0306
         TM    STABERR,B'10000000'                                 0306
         BNZ   @DC00306                                            0306
*                 SCTR=ICTR;        /* SAVE START OF PARAMETER       */
         LR    SCTR,ICTR                                           0307
*                 POSERR=NO;                                       0308
         NI    POSERR,B'11011111'                                  0308
*                 IF(RECORD(SCTR)^<CONCA&/* FIRST CHARACTER MUST BE  */
*                     RECORD(SCTR)^>CONCI)×(RECORD(SCTR)^<CONCJ&RECORD(
*                     SCTR)^>CONCR)×(RECORD(SCTR)^<CONCS&RECORD(SCTR)^>
*                     CONCZ) THEN   /* ALPHA                         */
         L     @09,ECDAIREC(,ECDAPTR)                              0309
         LR    @04,@09                                             0309
         ALR   @04,SCTR                                            0309
         CLI   RECORD-1(@04),C'A'                                  0309
         BL    @GL00010                                            0309
         ALR   @09,SCTR                                            0309
         CLI   RECORD-1(@09),C'I'                                  0309
         BNH   @RT00309                                            0309
@GL00010 L     @09,ECDAIREC(,ECDAPTR)                              0309
         LR    @04,@09                                             0309
         ALR   @04,SCTR                                            0309
         CLI   RECORD-1(@04),C'J'                                  0309
         BL    @GL00009                                            0309
         ALR   @09,SCTR                                            0309
         CLI   RECORD-1(@09),C'R'                                  0309
         BNH   @RT00309                                            0309
@GL00009 L     @09,ECDAIREC(,ECDAPTR)                              0309
         LR    @04,@09                                             0309
         ALR   @04,SCTR                                            0309
         CLI   RECORD-1(@04),C'S'                                  0309
         BL    @RF00309                                            0309
         ALR   @09,SCTR                                            0309
         CLI   RECORD-1(@09),C'Z'                                  0309
         BH    @RF00309                                            0309
@RT00309 DS    0H                                                  0310
*                   CALL VALIDATE;                                 0310
         BAL   @14,VALIDATE                                        0310
*                 ELSE              /* IF FIRST CHARACTER NOT ALPHA  */
*                   POSERR=YES;     /* THEN IT IS AN ERROR           */
         B     @RC00309                                            0311
@RF00309 OI    POSERR,B'00100000'                                  0311
*                 IF POSERR=NO&     /* IF THERE HAVE BEEN NO ERRORS  */
*                     VALIDERR=NO&  /* AND THE PARAMETER HAS A GOOD  */
*                     JCTR-SCTR<CON253 THEN/* LENGTH                 */
@RC00309 TM    POSERR,B'00100100'                                  0312
         BNZ   @RF00312                                            0312
         L     @09,JCTR                                            0312
         SLR   @09,SCTR                                            0312
         C     @09,@CF01249                                        0312
         BNL   @RF00312                                            0312
*                   DO;                                            0313
*                     PARMADR=ADDR(RECORD(SCTR));/* USE THE        0314
*                                      SNTAB/SVTAB                   */
         L     @04,ECDAIREC(,ECDAPTR)                              0314
         LA    @04,RECORD-1(SCTR,@04)                              0314
         ST    @04,PARMADR                                         0314
*                     PARMLNG=JCTR-SCTR;/* UPDATE ROUTINE TO PLACE IN*/
         ST    @09,PARMLNG                                         0315
*                     POSCHAR=POSCHAR+PARMLNG;/* TABLES              */
         ALR   POSCHAR,@09                                         0316
*                     PARMTYPE=POSIT;                              0317
         SLR   @09,@09                                             0317
         STH   @09,PARMTYPE                                        0317
*                     CALL SNTABUPT;                               0318
         BAL   @14,SNTABUPT                                        0318
*                   END;                                           0319
*                 ELSE                                             0320
*                   DO;                                            0320
         B     @RC00312                                            0320
@RF00312 DS    0H                                                  0321
*                     IF ICTR-SCTR^<CON253 THEN/* USE INVALID PARM 0321
*                                      LENGTH                        */
         LR    @09,ICTR                                            0321
         SLR   @09,SCTR                                            0321
         C     @09,@CF01249                                        0321
         BL    @RF00321                                            0321
*                       EXMSGID=A507;/* MESSAGE                      */
         MVC   EXMSGID(4),@CC01279                                 0322
*                     ELSE          /* OTHERWISE EXPLAIN WHY PARM    */
*                       DO;         /* INVALID                       */
         B     @RC00321                                            0323
@RF00321 DS    0H                                                  0324
*                         EXMSGID=M507;                            0324
         MVC   EXMSGID(4),@CC01273                                 0324
*                         ICTR=ICTR+CON1;                          0325
         AL    ICTR,@CF00035                                       0325
*                       END;                                       0326
*                     MVAR(1)=ADDR(CPOSIT);                        0327
@RC00321 LA    @09,@CC01304                                        0327
         ST    @09,MVAR                                            0327
*                     MVARLEN(1)=LENGTH(CPOSIT);                   0328
         MVI   MVARLEN,X'0A'                                       0328
*                     MVAR(2)=ADDR(RECORD(SCTR));                  0329
         L     @09,ECDAIREC(,ECDAPTR)                              0329
         LA    @09,RECORD-1(SCTR,@09)                              0329
         ST    @09,MVAR+4                                          0329
*                     MVARLEN(2)=ICTR-SCTR;                        0330
         LR    @09,ICTR                                            0330
         SLR   @09,SCTR                                            0330
         STC   @09,MVARLEN+4                                       0330
*                     IF ICTR-SCTR>CON127 THEN/* TRUNCATE            */
         C     @09,@CF01251                                        0331
         BNH   @RF00331                                            0331
*                       MVARLEN(2)=CON127;/* LENGTHS GT 127          */
         MVI   MVARLEN+4,X'7F'                                     0332
*                     NOTEXEC=YES;  /* PROCEDURE HAS ERRORS          */
@RF00331 OI    NOTEXEC(ECDAPTR),B'01000000'                        0333
*                     CALL MSGRTN;  /* ISSUE MESSAGE TO USER         */
         BAL   @14,MSGRTN                                          0334
*                     CALL SKIPSEP; /* FIND START OF NEXT PARM       */
         BAL   @14,SKIPSEP                                         0335
*                   END;                                           0336
*               END;                                               0337
@RC00312 AL    PCTR,@CF00035                                       0337
@DE00306 C     PCTR,POSNUM                                         0337
         BNH   @DL00306                                            0337
@DC00306 DS    0H                                                  0338
*               IF PCTR<=POSNUM&STABERR=NO THEN/* IF WE DID NOT    0338
*                                      PROCESS ENOUGH                */
         C     PCTR,POSNUM                                         0338
         BH    @RF00338                                            0338
         TM    STABERR,B'10000000'                                 0338
         BNZ   @RF00338                                            0338
*                 DO;               /* PARMS THEN NOTIFY USER        */
*                   NOTEXEC=YES;                                   0340
         OI    NOTEXEC(ECDAPTR),B'01000000'                        0340
*                   EXMSGID=M509;                                  0341
         MVC   EXMSGID(4),@CC01391                                 0341
*                   CALL MSGRTN;                                   0342
         BAL   @14,MSGRTN                                          0342
*                 END;                                             0343
*                                                                  0344
*               /*****************************************************/
*               /*                                                   */
*               /* SYNTAX CHECK KEYWORD SPECIFICATIONS               */
*               /*                                                   */
*               /*****************************************************/
*                                                                  0344
*               KEYWORD=YES;        /* CURRENTLY PROCESSING KEYWORDS */
@RF00338 OI    KEYWORD,B'00001000'                                 0344
*               KEYWCHAR=CON0;                                     0345
         SLR   KEYWCHAR,KEYWCHAR                                   0345
*               KEYCHAR=CON0;                                      0346
         SLR   KEYCHAR,KEYCHAR                                     0346
*               KEYWNUM=CON0;                                      0347
         SLR   @09,@09                                             0347
         ST    @09,KEYWNUM                                         0347
*               KEYNUM=CON0;                                       0348
         ST    @09,KEYNUM                                          0348
*               DO WHILE ICTR<=LINELNG&STABERR=NO;                 0349
         B     @DE00349                                            0349
@DL00349 DS    0H                                                  0350
*                 SCTR=ICTR;                                       0350
         LR    SCTR,ICTR                                           0350
*                 KEYERR=NO;                                       0351
         NI    KEYERR,B'11101111'                                  0351
*                 IF(RECORD(SCTR)^<CONCA&/* FIRST CHARACTER MUST BE
*                                      ALPHA                         */
*                     RECORD(SCTR)^>CONCI)×(RECORD(SCTR)^<CONCJ&RECORD(
*                     SCTR)^>CONCR)×(RECORD(SCTR)^<CONCS&RECORD(SCTR)^>
*                     CONCZ) THEN                                  0352
         L     @09,ECDAIREC(,ECDAPTR)                              0352
         LR    @01,@09                                             0352
         ALR   @01,SCTR                                            0352
         CLI   RECORD-1(@01),C'A'                                  0352
         BL    @GL00017                                            0352
         ALR   @09,SCTR                                            0352
         CLI   RECORD-1(@09),C'I'                                  0352
         BNH   @RT00352                                            0352
@GL00017 L     @09,ECDAIREC(,ECDAPTR)                              0352
         LR    @01,@09                                             0352
         ALR   @01,SCTR                                            0352
         CLI   RECORD-1(@01),C'J'                                  0352
         BL    @GL00016                                            0352
         ALR   @09,SCTR                                            0352
         CLI   RECORD-1(@09),C'R'                                  0352
         BNH   @RT00352                                            0352
@GL00016 L     @09,ECDAIREC(,ECDAPTR)                              0352
         LR    @01,@09                                             0352
         ALR   @01,SCTR                                            0352
         CLI   RECORD-1(@01),C'S'                                  0352
         BL    @RF00352                                            0352
         ALR   @09,SCTR                                            0352
         CLI   RECORD-1(@09),C'Z'                                  0352
         BH    @RF00352                                            0352
@RT00352 DS    0H                                                  0353
*                   CALL VALIDATE;                                 0353
         BAL   @14,VALIDATE                                        0353
*                 ELSE              /* OTHERWISE IT IS AN ERROR      */
*                   KEYERR=YES;                                    0354
         B     @RC00352                                            0354
@RF00352 OI    KEYERR,B'00010000'                                  0354
*                 IF(KEYERR=NO&VALIDERR=NO)&JCTR-SCTR<=CON31 THEN/*
*                                      IF THERE HAVE BEEN NO ERRORS  */
@RC00352 TM    KEYERR,B'00010100'                                  0355
         BNZ   @RF00355                                            0355
         L     @09,JCTR                                            0355
         SLR   @09,SCTR                                            0355
         C     @09,@CF00040                                        0355
         BH    @RF00355                                            0355
*                   DO;             /* THEN PREPARE FOR SNTAB ENTRY  */
*                     PARMADR=ADDR(RECORD(SCTR));                  0357
         L     @15,ECDAIREC(,ECDAPTR)                              0357
         LA    @14,RECORD-1(SCTR,@15)                              0357
         ST    @14,PARMADR                                         0357
*                     PARMLNG=JCTR-SCTR;/* IF THE NEXT NON SEPERATOR
*                                      IS                            */
         ST    @09,PARMLNG                                         0358
*                     IF ICTR<=LINELNG&RECORD(ICTR)=LFPAREN THEN/* A
*                                      LEFT PAREN THEN IT A          */
         C     ICTR,LINELNG                                        0359
         BH    @RF00359                                            0359
         ALR   @15,ICTR                                            0359
         CLI   RECORD-1(@15),C'('                                  0359
         BNE   @RF00359                                            0359
*                       DO;         /* KEYWORD WITH VALUE            */
*                         PARMTYPE=KEYW;                           0361
         MVC   PARMTYPE(2),@CH00187                                0361
*                         KEYWCHAR=KEYWCHAR+PARMLNG;               0362
         ALR   KEYWCHAR,@09                                        0362
*                         KEYWNUM=KEYWNUM+CON1;                    0363
         LA    @09,1                                               0363
         AL    @09,KEYWNUM                                         0363
         ST    @09,KEYWNUM                                         0363
*                         CALL VALUECHK;/* SYNTAX CHECK THE VALUE    */
         BAL   @14,VALUECHK                                        0364
*                         IF VALSTR^=CON0 THEN                     0365
         L     @09,VALSTR                                          0365
         LTR   @09,@09                                             0365
         BZ    @RF00365                                            0365
*                           DO;                                    0366
*                             VALLNG=VALEND-VALSTR+CON1;           0367
         L     @02,VALEND                                          0367
         SLR   @02,@09                                             0367
         AL    @02,@CF00035                                        0367
         ST    @02,VALLNG                                          0367
*                             VALADR=ADDR(RECORD(VALSTR));         0368
         L     @02,ECDAIREC(,ECDAPTR)                              0368
         LA    @09,RECORD-1(@09,@02)                               0368
         ST    @09,VALADR                                          0368
*                           END;                                   0369
*                         ELSE                                     0370
*                           VALLNG=CON0;                           0370
         B     @RC00365                                            0370
@RF00365 SLR   @09,@09                                             0370
         ST    @09,VALLNG                                          0370
*                       END;                                       0371
*                     ELSE          /* IF CHARACTER NOT A LEFT PAREN */
*                       DO;         /* THEN IT A KEYWORD WITH NO     */
         B     @RC00359                                            0372
@RF00359 DS    0H                                                  0373
*                         KEYCHAR=KEYCHAR+PARMLNG;/* VALUE           */
         AL    KEYCHAR,PARMLNG                                     0373
*                         PARMTYPE=KEYWO;                          0374
         LA    @09,1                                               0374
         STH   @09,PARMTYPE                                        0374
*                         KEYNUM=KEYNUM+CON1;                      0375
         AL    @09,KEYNUM                                          0375
         ST    @09,KEYNUM                                          0375
*                       END;                                       0376
*                     CALL SNTABUPT;/* CREATE ENTRY IN SNTAB/SVTAB   */
@RC00359 BAL   @14,SNTABUPT                                        0377
*                   END;                                           0378
*                 ELSE              /* IF ERRORS HAD BEEN DETECTED   */
*                   DO;                                            0379
         B     @RC00355                                            0379
@RF00355 DS    0H                                                  0380
*                     IF JCTR-SCTR>CON31 THEN/* THEN NOTIFY USER AND
*                                      CONTINUE                      */
         L     @09,JCTR                                            0380
         SLR   @09,SCTR                                            0380
         C     @09,@CF00040                                        0380
         BNH   @RF00380                                            0380
*                       EXMSGID=A507;/* SYNTAX CHECKING ANY OTHER    */
         MVC   EXMSGID(4),@CC01279                                 0381
*                     ELSE          /* PARMS ON PROC STATEMENT       */
*                       DO;                                        0382
         B     @RC00380                                            0382
@RF00380 DS    0H                                                  0383
*                         EXMSGID=M507;                            0383
         MVC   EXMSGID(4),@CC01273                                 0383
*                         ICTR=ICTR+CON1;                          0384
         AL    ICTR,@CF00035                                       0384
*                       END;                                       0385
*                     MVAR(1)=ADDR(CKEYWORD);                      0386
@RC00380 LA    @09,@CC01307                                        0386
         ST    @09,MVAR                                            0386
*                     MVARLEN(1)=LENGTH(CKEYWORD);                 0387
         MVI   MVARLEN,X'07'                                       0387
*                     MVAR(2)=ADDR(RECORD(SCTR));                  0388
         L     @09,ECDAIREC(,ECDAPTR)                              0388
         LA    @09,RECORD-1(SCTR,@09)                              0388
         ST    @09,MVAR+4                                          0388
*                     MVARLEN(2)=ICTR-SCTR;                        0389
         LR    @09,ICTR                                            0389
         SLR   @09,SCTR                                            0389
         STC   @09,MVARLEN+4                                       0389
*                     NOTEXEC=YES;                                 0390
         OI    NOTEXEC(ECDAPTR),B'01000000'                        0390
*                     CALL MSGRTN;                                 0391
         BAL   @14,MSGRTN                                          0391
*                   END;                                           0392
*                 CALL SKIPSEP;     /* UPDATE TO NEXT KEYWORD        */
@RC00355 BAL   @14,SKIPSEP                                         0393
*               END;                                               0394
@DE00349 C     ICTR,LINELNG                                        0394
         BH    @DC00349                                            0394
         TM    STABERR,B'10000000'                                 0394
         BZ    @DL00349                                            0394
@DC00349 DS    0H                                                  0395
*               IF NOTEXEC=YES×(POSNUM+KEYNUM+KEYWNUM=CON0) THEN   0395
         TM    NOTEXEC(ECDAPTR),B'01000000'                        0395
         BO    @RT00395                                            0395
         L     @06,POSNUM                                          0395
         AL    @06,KEYNUM                                          0395
         AL    @06,KEYWNUM                                         0395
         LTR   @06,@06                                             0395
         BNZ   @RF00395                                            0395
@RT00395 DS    0H                                                  0396
*                 DO;                                              0396
*                   IF NOTEXEC=NO THEN                             0397
         TM    NOTEXEC(ECDAPTR),B'01000000'                        0397
         BNZ   @RF00397                                            0397
*                     DO;                                          0398
*                       IF(IMPLICIT=NO&(VLST=YES&VLSTLNG^=CON0))×( 0399
*                           IMPLICIT=YES&ECTNOPD=NO) THEN          0399
         TM    IMPLICIT(ECDAPTR),B'10000000'                       0399
         BNZ   @GL00025                                            0399
         L     @06,ECDAEANS(,ECDAPTR)                              0399
         TM    VLST(@06),B'10000000'                               0399
         BNO   @GL00025                                            0399
         LH    @06,VLSTLNG(,@06)                                   0399
         LTR   @06,@06                                             0399
         BNZ   @RT00399                                            0399
@GL00025 TM    IMPLICIT(ECDAPTR),B'10000000'                       0399
         BNO   @RF00399                                            0399
         L     @06,CPPLPTR(,ECDAPTR)                               0399
         L     @06,ECTPTR(,@06)                                    0399
         TM    ECTNOPD(@06),B'10000000'                            0399
         BNZ   @RF00399                                            0399
@RT00399 DS    0H                                                  0400
*                         DO;                                      0400
*                           EXMSGID=B529;                          0401
         MVC   EXMSGID(4),@CC01283                                 0401
*                           IF IMPLICIT=NO THEN/* EXPLICIT - PICK UP
*                                      ADDR FROM                     */
         TM    IMPLICIT(ECDAPTR),B'10000000'                       0402
         BNZ   @RF00402                                            0402
*                             DO;   /* FROM PDL                      */
*                               MVAR(1)=VLSTPTR;                   0404
         L     @06,ECDAEANS(,ECDAPTR)                              0404
         L     @15,VLSTPTR(,@06)                                   0404
         ST    @15,MVAR                                            0404
*                               MVARLEN(1)=VLSTLNG;                0405
         LH    @06,VLSTLNG(,@06)                                   0405
         STC   @06,MVARLEN                                         0405
*                             END;                                 0406
*                           ELSE    /* IMPLICIT - PICK UP ADDR USING */
*                             DO;                                  0407
         B     @RC00402                                            0407
@RF00402 DS    0H                                                  0408
*                               MVAR(1)=ADDR(CBUFTEXT)+CBUFOFF;    0408
         L     @06,CPPLPTR(,ECDAPTR)                               0408
         L     @06,CPPLCBUF(,@06)                                  0408
         LA    @15,CBUFTEXT(,@06)                                  0408
         LH    @14,CBUFOFF(,@06)                                   0408
         ALR   @15,@14                                             0408
         ST    @15,MVAR                                            0408
*                               MVARLEN(1)=CBUFLNG-CBUFOFF;        0409
         LCR   @14,@14                                             0409
         AH    @14,CBUFLNG(,@06)                                   0409
         STC   @14,MVARLEN                                         0409
*                             END;                                 0410
*                           CALL MSGRTN;                           0411
@RC00402 BAL   @14,MSGRTN                                          0411
*                         END;                                     0412
*                     END;                                         0413
*                 END;                                             0414
*                                                                  0414
*               /*****************************************************/
*               /*                                                   */
*               /* IF ERRORS HAVE OCCURRED THEN CONTROL GOES TO EXIT */
*               /* AT THIS POINT                                     */
*               /*                                                   */
*               /*****************************************************/
*                                                                  0415
*                                                                  0415
*               /*****************************************************/
*               /*                                                   */
*               /* GET CORE FOR THE VALUE LIST PCL                   */
*               /*                                                   */
*               /*****************************************************/
*                                                                  0415
*               ELSE                /* PARAMETER SYNTAX O.K.         */
*                 DO;                                              0415
         B     @RC00395                                            0415
@RF00395 DS    0H                                                  0416
*                   POSAR=POSNUM*LENGTH(IDMOD)+POSCHAR;/* AMOUNT   0416
*                                      NEEDED FOR POSITIONAL       0416
*                                      PARAMETERS                    */
         L     POSAR,POSNUM                                        0416
         MH    POSAR,@CH01405                                      0416
         ALR   POSAR,POSCHAR                                       0416
*                   KEYAR=KEYNUM*LENGTH(KWMOD)+KEYCHAR;/* AMOUNT   0417
*                                      NEEDED FOR KEYWORDS WITHOUT 0417
*                                      VALUES                        */
         L     @09,KEYNUM                                          0417
         MH    @09,@CH01262                                        0417
         ALR   @09,KEYCHAR                                         0417
         ST    @09,KEYAR                                           0417
*                   KEYWAR=KEYWNUM*(LENGTH(KWMOD)+CON2+LENGTH(SUBMOD)+
*                       LENGTH(VIDMAP))+KEYWCHAR*CON2;/* AMOUNT FOR
*                                      KEYWORDS WITH VALUES          */
         L     KEYWAR,KEYWNUM                                      0418
         MH    KEYWAR,@CH01533                                     0418
         LR    @06,KEYWCHAR                                        0418
         ALR   @06,@06                                             0418
         ALR   KEYWAR,@06                                          0418
*                   GETAMT=POSAR+KEYAR+KEYWAR+LENGTH(PCEHEAD)+LENGTH(
*                       PCEEND);                                   0419
         ALR   @09,POSAR                                           0419
         ALR   @09,KEYWAR                                          0419
         AL    @09,@CF00078                                        0419
         ST    @09,GETAMT                                          0419
*                   PCLAMT=GETAMT;  /* SAVE LENGTH OF PCL            */
*                                                                  0420
         ST    @09,PCLAMT                                          0420
*                   /*************************************************/
*                   /*                                               */
*                   /* IF THIS IS AN EXPLICIT EXEC WITH A VALUE LIST */
*                   /* THEN GET EXTRA SO WE CAN COPY OVER THE VALUE  */
*                   /* LIST                                          */
*                   /*                                               */
*                   /*************************************************/
*                                                                  0421
*                   IF IMPLICIT=NO&VLST=YES&VLSTLNG^=CON0 THEN/* IF
*                                      EXPLICIT THEN                 */
         TM    IMPLICIT(ECDAPTR),B'10000000'                       0421
         BNZ   @RF00421                                            0421
         L     @06,ECDAEANS(,ECDAPTR)                              0421
         TM    VLST(@06),B'10000000'                               0421
         BNO   @RF00421                                            0421
         LH    @06,VLSTLNG(,@06)                                   0421
         LTR   @06,@06                                             0421
         BZ    @RF00421                                            0421
*                     DO;           /* ADD EXTRA                     */
*                       GETAMT=GETAMT+VLSTLNG+CON4;                0423
         ALR   @09,@06                                             0423
         AL    @09,@CF00062                                        0423
         ST    @09,GETAMT                                          0423
*                       COPYVLST=YES;                              0424
         OI    COPYVLST,B'00000010'                                0424
*                     END;                                         0425
*                   RFY                                            0426
*                     R15 RSTD;                                    0426
@RF00421 DS    0H                                                  0427
*                   DO;             /* GETMAIN (EC) LV(GETAMT)     0427
*                                      A(GETADR) SP(1)               */
*                     RESPECIFY                                    0428
*                      (GPR01P) RESTRICTED;                        0428
*                     I004=I004&&I004;/* INIT LIST                   */
         XC    I004(10),I004                                       0429
*                     I00404='20'X; /* TYPE                          */
         MVI   I00404,X'20'                                        0430
*                     I00401=GETAMT;/* LENGTH                        */
         L     @14,GETAMT                                          0431
         ST    @14,I00401                                          0431
*                     I00403=ADDR(GETADR);/* ADDR OF ADDR LIST       */
         LA    @14,GETADR                                          0432
         STCM  @14,7,I00403                                        0432
*                     I00405=1;     /* SUBPOOL VALUE                 */
         MVI   I00405,X'01'                                        0433
*                     GPR01P=ADDR(I004);/* REG1 POINTS TO LIST       */
         LA    GPR01P,I004                                         0434
*                     SVC(4);       /* STANDARD-FORM OF GETMAIN      */
         SVC   4                                                   0435
*                     RESPECIFY                                    0436
*                      (GPR01P) UNRESTRICTED;                      0436
*                   END;            /* GETMAIN (EC) LV(GETAMT)     0437
*                                      A(GETADR) SP(1)               */
*                   IF R15^=CON0 THEN/* IF STORAGE COULD NOT BE      */
         LTR   R15,R15                                             0438
         BZ    @RF00438                                            0438
*                     DO;           /* OBTAINED THEN NOTIFY USER     */
*                       EXMSGID=M511;/* AND TERMINATE                */
         MVC   EXMSGID(4),@CC01271                                 0440
*                       NOTEXEC=YES;                               0441
         OI    NOTEXEC(ECDAPTR),B'01000000'                        0441
*                       CT431RET=CON16;                            0442
         MVC   CT431RET(4),@CF01028                                0442
*                       CALL MSGRTN;                               0443
         BAL   @14,MSGRTN                                          0443
*                     END;                                         0444
*                   ELSE                                           0445
*                     DO;                                          0445
         B     @RC00438                                            0445
@RF00438 DS    0H                                                  0446
*                       PCLCUR=GETADR;/* INIT ADDRESS OF CURRENT PCL */
         L     PCLCUR,GETADR                                       0446
*                       PCLLNG=PCLAMT;/* LENGTH OF PCL               */
         L     @14,PCLAMT                                          0447
         STH   @14,PCLLNG(,PCLCUR)                                 0447
*                       PCLBASE=PCLCUR;                            0448
         LR    PCLBASE,PCLCUR                                      0448
*                       PCLKEYOF=POSAR+LENGTH(PCEHEAD);/* OFFSET TO
*                                      KEYWORDS ADDRESS OF START OF
*                                      SUBFIELD AREA                 */
         LA    @14,6                                               0449
         LR    @06,POSAR                                           0449
         ALR   @06,@14                                             0449
         STH   @06,PCLKEYOF(,PCLCUR)                               0449
*                       SBFCUR=PCLCUR+LENGTH(PCEHEAD)+POSAR+KEYAR+ 0450
*                           KEYWNUM*(LENGTH(KWMOD)+CON2)+KEYWCHAR; 0450
         LR    SBFCUR,PCLCUR                                       0450
         ALR   SBFCUR,@14                                          0450
         ALR   SBFCUR,POSAR                                        0450
         AL    SBFCUR,KEYAR                                        0450
         L     @06,KEYWNUM                                         0450
         MH    @06,@CH01531                                        0450
         ALR   SBFCUR,@06                                          0450
         ALR   SBFCUR,KEYWCHAR                                     0450
*                       SBFBASE=SBFCUR;                            0451
         ST    SBFCUR,SBFBASE                                      0451
*                       PCLCUR=PCLCUR+LENGTH(PCEHEAD);/* UPDATE TO 0452
*                                      NEXT PCE                      */
         ALR   PCLCUR,@14                                          0452
*                       PDLCUR=CON8;/* DSECT OFFSET PAST PDL HEADER  */
         LA    PDLCUR,8                                            0453
*                                                                  0454
*                       /*********************************************/
*                       /*                                           */
*                       /* INITIALIZE PCES FOR THE POSITIONAL        */
*                       /* PARAMETERS                                */
*                       /*                                           */
*                       /*********************************************/
*                                                                  0454
*                       SNTELPTR=USNTABST;/* ELEMENT BASE TO FIRST 0454
*                                      USER                          */
         L     SNTELPTR,USNTABST                                   0454
*                       SNTABPTR=SNTABFST;/* PARM                    */
         L     @14,LSDPTR(,ECDAPTR)                                0455
         L     @14,LSDEXEC(,@14)                                   0455
         L     @14,SNTABFST(,@14)                                  0455
         ST    @14,SNTABPTR                                        0455
*                       DO PCTR=1 TO POSNUM;/* MOVE IN A COPY OF THE
*                                      MODEL                         */
         LA    PCTR,1                                              0456
         B     @DE00456                                            0456
@DL00456 DS    0H                                                  0457
*                         PCELMT(1:LENGTH(IDMOD))=IDMOD;           0457
         MVC   PCELMT(56,PCLCUR),IDMOD                             0457
*                         IDPRNME(1:SNTLNG)=SNTDATA(1:SNTLNG);/* COPY
*                                      POSIT PARM NAME               */
         LH    @14,SNTLNG(,SNTELPTR)                               0458
         LR    @06,@14                                             0458
         BCTR  @06,0                                               0458
         EX    @06,@SM01557                                        0458
*                         IDLNG=IDLNG+SNTLNG;/* ADJUST TOTAL LENGTH
*                                      TO INCLUDE NAME               */
         ICM   @06,12,IDLNG(PCLCUR)                                0459
         SRA   @06,16                                              0459
         ALR   @06,@14                                             0459
         STCM  @06,3,IDLNG(PCLCUR)                                 0459
*                         IF IDPRMLNG+SNTLNG>CON223 THEN/* IF PROMPT
*                                      INFO TOO LARGE                */
         SLR   @06,@06                                             0460
         IC    @06,IDPRMLNG(,PCLCUR)                               0460
         ALR   @14,@06                                             0460
         C     @14,@CF01247                                        0460
         BNH   @RF00460                                            0460
*                           IDPRMLNG=CON223;/* FOR PARSE PROMPT    0461
*                                      MESSAGE THEN                  */
         MVI   IDPRMLNG(PCLCUR),X'DF'                              0461
*                         ELSE                                     0462
*                           IDPRMLNG=IDPRMLNG+SNTLNG;              0462
         B     @RC00460                                            0462
@RF00460 SLR   @14,@14                                             0462
         IC    @14,IDPRMLNG(,PCLCUR)                               0462
         AH    @14,SNTLNG(,SNTELPTR)                               0462
         STC   @14,IDPRMLNG(,PCLCUR)                               0462
*                         IDPDLOFF=PDLCUR;/* OFFSET TO PCE           */
@RC00460 STCM  PDLCUR,3,IDPDLOFF(PCLCUR)                           0463
*                         PCLCUR=PCLCUR+IDLNG;/* UPDATE TO START OF
*                                      NEXT PCE                      */
         ICM   @14,12,IDLNG(PCLCUR)                                0464
         SRA   @14,16                                              0464
         ALR   PCLCUR,@14                                          0464
*                         PDLCUR=PDLCUR+LENGTH(IDENTPDE);/* UPDATE TO
*                                      NEXT PDE                      */
         AL    PDLCUR,@CF00078                                     0465
*                         IF SNTLAST=YES THEN/* IF THIS IS LAST SNTAB
*                                      ELEMENT                       */
         TM    SNTLAST(SNTELPTR),B'00000001'                       0466
         BNO   @RF00466                                            0466
*                           DO;     /* UPDATE TO NEXT SNTAB TABLE    */
*                             SNTABPTR=SNTABNXT;                   0468
         L     @14,SNTABPTR                                        0468
         L     @14,SNTABNXT(,@14)                                  0468
         ST    @14,SNTABPTR                                        0468
*                             SNTELPTR=SNTABPTR+LENGTH(SNTAB);     0469
         AL    @14,@CF01091                                        0469
         LR    SNTELPTR,@14                                        0469
*                           END;                                   0470
*                         ELSE      /* OTHERWISE STEP UP TO NEXT     */
*                           SNTELPTR=SNTELPTR+SNTLNG+LENGTH(SNTELEM);
         B     @RC00466                                            0471
@RF00466 LR    @14,SNTELPTR                                        0471
         AH    @14,SNTLNG(,SNTELPTR)                               0471
         AL    @14,@CF00078                                        0471
         LR    SNTELPTR,@14                                        0471
*                                   /* ELEMENT                       */
*                       END;                                       0472
@RC00466 AL    PCTR,@CF00035                                       0472
@DE00456 C     PCTR,POSNUM                                         0472
         BNH   @DL00456                                            0472
*                                                                  0473
*                       /*********************************************/
*                       /*                                           */
*                       /* BUILD PCES FOR EACH KEYWORD ENTRY         */
*                       /*                                           */
*                       /*********************************************/
*                                                                  0473
*                       DO PCTR=1 TO(KEYWNUM+KEYNUM);/* MOVE IN MODEL
*                                      PCL                           */
         LA    PCTR,1                                              0473
         B     @DE00473                                            0473
@DL00473 DS    0H                                                  0474
*                         PCELMT(1:LENGTH(KWMOD))=KWMOD;           0474
         MVC   PCELMT(11,PCLCUR),KWMOD                             0474
*                         KWPDLOFF=PDLCUR;/* SAVE OFFSET TO PDL      */
         STCM  PDLCUR,3,KWPDLOFF(PCLCUR)                           0475
*                         NADAT(1:SNTLNG)=SNTDATA(1:SNTLNG);/* COPY
*                                      NAME AND                      */
         LH    @14,SNTLNG(,SNTELPTR)                               0476
         LR    @06,@14                                             0476
         BCTR  @06,0                                               0476
         EX    @06,@SM01559                                        0476
*                         NALNG=SNTLNG+LENGTH(NAMPCE);/* LENGTH FROM
*                                      SNTAB                         */
         LA    @01,5                                               0477
         ALR   @01,@14                                             0477
         STCM  @01,3,NALNG(PCLCUR)                                 0477
*                         NADATLNG=SNTLNG-CON1;                    0478
         STC   @06,NADATLNG(,PCLCUR)                               0478
*                         PDLCUR=PDLCUR+LENGTH(KEYPDE);/* UPDATE TO
*                                      NEXT PDL                      */
         LA    @00,2                                               0479
         ALR   PDLCUR,@00                                          0479
*                         IF SNTKEYW=YES THEN/* IF THIS A KEYWORD  0480
*                                      WITH                          */
         TM    SNTKEYW(SNTELPTR),B'00100000'                       0480
         BNO   @RF00480                                            0480
*                           DO;     /* WITH VALUE THEN BUILD SUBFIELD*/
*                             NALNG=NALNG+CON2;/* ADD TWO BYTES FOR
*                                      SBFD OFFSET                   */
         ALR   @01,@00                                             0482
         STCM  @01,3,NALNG(PCLCUR)                                 0482
*                             KWSUBFLD=YES;/* SET SUBFLD INDICATOR   */
         OI    KWSUBFLD(PCLCUR),B'00000100'                        0483
*                             PCLCUR=PCLCUR+KEYLNG+NALNG;/* UPDATE TO
*                                      NEXT PCE                      */
         LR    @14,PCLCUR                                          0484
         ICM   @01,12,KEYLNG(PCLCUR)                               0484
         SRA   @01,16                                              0484
         ALR   @14,@01                                             0484
         ICM   @01,12,NALNG(PCLCUR)                                0484
         SRA   @01,16                                              0484
         ALR   @14,@01                                             0484
         LR    PCLCUR,@14                                          0484
*                             SBFOFF=SBFCUR-PCLBASE+CON1;/* SAVE   0485
*                                      OFFSET TO SUBFIELD            */
         LCR   @00,@00                                             0485
         ALR   @00,PCLCUR                                          0485
         LR    @14,SBFCUR                                          0485
         SLR   @14,PCLBASE                                         0485
         LA    @01,1                                               0485
         ALR   @01,@14                                             0485
         ST    @14,@TF00001                                        0485
         LR    @14,@00                                             0485
         STH   @01,SBFOFF(,@14)                                    0485
*                             SBFELMT(1:LENGTH(SUBMOD))=SUBMOD;/*  0486
*                                      COPY MODEL SUBFLD             */
         MVC   SBFELMT(3,SBFCUR),SUBMOD                            0486
*                             SUBNXSUB=SBFCUR-PCLBASE+LENGTH(SUBFLD)+
*                                 LENGTH(VIDMAP)+SNTLNG;/* FIND    0487
*                                      OFFSET TO NEXT SUBFIELD       */
         LA    @14,56                                              0487
         AL    @14,@TF00001                                        0487
         LH    @01,SNTLNG(,SNTELPTR)                               0487
         ALR   @14,@01                                             0487
         STCM  @14,3,SUBNXSUB(SBFCUR)                              0487
*                             SBFCUR=SBFCUR+LENGTH(SUBFLD);/* UPDATE
*                                      TO NEXT JBF PCE               */
         LA    @14,3                                               0488
         ALR   SBFCUR,@14                                          0488
*                             SBFELMT(1:LENGTH(VIDMAP))=IDMOD;/* COPY
*                                      IDENT MODEL                   */
         MVC   SBFELMT(53,SBFCUR),IDMOD                            0489
*                             SBFCUR->IDMODTYP=KEYTYPE;/* MODIFY TYPE
*                                      TO KEYWORD                    */
         MVC   IDMODTYP(21,SBFCUR),@CC01285                        0490
*                             SBFCUR->VIDPRINF=KEYTYPE;            0491
         MVC   VIDPRINF(18,SBFCUR),@CC01285                        0491
*                             SBFCUR->VIDNAME(1:SNTLNG)=SNTDATA(1: 0492
*                                 SNTLNG);/* KEY-NAME                */
         EX    @06,@SM01561                                        0492
*                             SBFCUR->IDPRMLNG=SBFCUR->IDPRMLNG+SNTLNG-
*                                 CON3;                            0493
         SLR   @06,@06                                             0493
         IC    @06,IDPRMLNG(,SBFCUR)                               0493
         ALR   @06,@01                                             0493
         SLR   @06,@14                                             0493
         STC   @06,IDPRMLNG(,SBFCUR)                               0493
*                             SBFCUR->IDLNG=SBFCUR->IDLNG+SNTLNG-CON3;
         ICM   @06,12,IDLNG(SBFCUR)                                0494
         SRA   @06,16                                              0494
         ALR   @01,@06                                             0494
         SLR   @01,@14                                             0494
         STCM  @01,3,IDLNG(SBFCUR)                                 0494
*                                   /* SAVE PCE LENGTH               */
*                             SBFCUR->IDCHAR=YES;/* INDICATE IDENT IS
*                                      CHARACTER                     */
         OI    IDCHAR(SBFCUR),B'00001000'                          0495
*                             SBFCUR->IDPDLOFF=PDLCUR;/* PDL OFFSET
*                                      FOR THIS PCE                  */
         STCM  PDLCUR,3,IDPDLOFF(SBFCUR)                           0496
*                             SBFCUR=SBFCUR+SBFCUR->IDLNG;/* UPDATE
*                                      TO NEXT SBF PCE               */
         ALR   SBFCUR,@01                                          0497
*                             PDLCUR=PDLCUR+LENGTH(IDENTPDE);/* NEXT
*                                      AVAILABLE PDE                 */
         AL    PDLCUR,@CF00078                                     0498
*                           END;                                   0499
*                         ELSE      /* FOR KEYWORDS WITHOUT VALUES   */
*                           PCLCUR=PCLCUR+KEYLNG+NALNG;/* NO SUBFIELD
*                                      NECESSARY                     */
         B     @RC00480                                            0500
@RF00480 LR    @14,PCLCUR                                          0500
         ICM   @06,12,KEYLNG(PCLCUR)                               0500
         SRA   @06,16                                              0500
         ALR   @14,@06                                             0500
         ICM   @06,12,NALNG(PCLCUR)                                0500
         SRA   @06,16                                              0500
         ALR   @14,@06                                             0500
         LR    PCLCUR,@14                                          0500
*                         IF SNTLAST=YES THEN/* IF LAST ELEMENT THEN
*                                      UPDATE                        */
@RC00480 TM    SNTLAST(SNTELPTR),B'00000001'                       0501
         BNO   @RF00501                                            0501
*                           DO;     /* TO NEXT SNTAB                 */
*                             SNTABPTR=SNTABNXT;                   0503
         L     @14,SNTABPTR                                        0503
         L     @14,SNTABNXT(,@14)                                  0503
         ST    @14,SNTABPTR                                        0503
*                             SNTELPTR=SNTABPTR+LENGTH(SNTAB);     0504
         AL    @14,@CF01091                                        0504
         LR    SNTELPTR,@14                                        0504
*                           END;                                   0505
*                         ELSE      /* OTHERWISE-STEP TO NEXT ELEMT  */
*                           SNTELPTR=SNTELPTR+SNTLNG+LENGTH(SNTELEM);
         B     @RC00501                                            0506
@RF00501 LR    @14,SNTELPTR                                        0506
         AH    @14,SNTLNG(,SNTELPTR)                               0506
         AL    @14,@CF00078                                        0506
         LR    SNTELPTR,@14                                        0506
*                       END;                                       0507
@RC00501 AL    PCTR,@CF00035                                       0507
@DE00473 L     @14,KEYWNUM                                         0507
         AL    @14,KEYNUM                                          0507
         CR    PCTR,@14                                            0507
         BNH   @DL00473                                            0507
*                       SBFELMT(1)=ENDMOD;/* INITIALIZE THE END PCE  */
         MVC   SBFELMT(1,SBFCUR),ENDMOD                            0508
*                       PCLBASE->PDLLNG=PDLCUR;/* UPDATE FINAL PDL 0509
*                                      LENGTH                        */
         STH   PDLCUR,PDLLNG(,PCLBASE)                             0509
*                                                                  0510
*                       /*********************************************/
*                       /*                                           */
*                       /* PARSE THE VALUE LIST                      */
*                       /*                                           */
*                       /*********************************************/
*                                                                  0510
*                       PPLPTR=ADDR(SERVBLK);/* SET UP PARSE PARMS   */
         LA    PPLPTR,SERVBLK                                      0510
*                       PPLUPT=CPPLUPT;                            0511
         L     @14,CPPLPTR(,ECDAPTR)                               0511
         L     @06,CPPLUPT(,@14)                                   0511
         ST    @06,PPLUPT(,PPLPTR)                                 0511
*                       PPLPCL=PCLBASE;                            0512
         ST    PCLBASE,PPLPCL(,PPLPTR)                             0512
*                       PPLECT=CPPLECT;                            0513
         L     @14,CPPLECT(,@14)                                   0513
         ST    @14,PPLECT(,PPLPTR)                                 0513
*                       PPLECB=ADDR(ECB);                          0514
         LA    @14,ECB                                             0514
         ST    @14,PPLECB(,PPLPTR)                                 0514
*                       PPLANS=ADDR(VLSTANS);                      0515
         LA    @14,VLSTANS                                         0515
         ST    @14,PPLANS(,PPLPTR)                                 0515
*                       IF COPYVLST=YES THEN/* COPY OVER THE VALUE   */
         TM    COPYVLST,B'00000010'                                0516
         BNO   @RF00516                                            0516
*                         DO;       /* LIST IF NECESSARY             */
*                           RFY                                    0518
*                            (R2,                                  0518
*                             R3,                                  0518
*                             R4,                                  0518
*                             R5) RSTD;                            0518
*                           R4=VLSTPTR;/* ADDRESS OF VALUE LIST      */
         L     @14,ECDAEANS(,ECDAPTR)                              0519
         L     R4,VLSTPTR(,@14)                                    0519
*                           R3=VLSTLNG;/* LENGTH OF VALUE LIST       */
         LH    @14,VLSTLNG(,@14)                                   0520
         LR    R3,@14                                              0520
*                           R5=R3;  /* NEW LENGTH IS SAME            */
         LR    R5,R3                                               0521
*                           R2=PCLBASE+PCLAMT;/* ADDR OF NEW VLIST   */
         LR    R2,PCLBASE                                          0522
         AL    R2,PCLAMT                                           0522
*                           R2->NVLSTLNG=VLSTLNG+CON4;/* INIT      0523
*                                      STANDARD                      */
         LA    @06,4                                               0523
         ALR   @14,@06                                             0523
         STH   @14,NVLSTLNG(,R2)                                   0523
*                           R2->NVLSTOFF=CON0;/* LENGTH AND OFFSET   */
         SLR   @14,@14                                             0524
         STH   @14,NVLSTOFF(,R2)                                   0524
*                           PPLCBUF=R2;/* ADDRESS OF VALUE LIST      */
         ST    R2,PPLCBUF(,PPLPTR)                                 0525
*                           R2=R2+CON4;/* UPDATE TO DATA AREA        */
         ALR   R2,@06                                              0526
*                           MVCL(R2,R4);/* MOVE DATA                 */
         MVCL  R2,R4                                               0527
*                           RFY                                    0528
*                            (R2,                                  0528
*                             R3,                                  0528
*                             R4,                                  0528
*                             R5) UNRSTD;                          0528
*                         END;                                     0529
*                       ELSE        /* SET ADDRESS OF THE VALUE LIST */
*                         PPLCBUF=CPPLCBUF;                        0530
         B     @RC00516                                            0530
@RF00516 L     @14,CPPLPTR(,ECDAPTR)                               0530
         L     @14,CPPLCBUF(,@14)                                  0530
         ST    @14,PPLCBUF(,PPLPTR)                                0530
*                       RFY                                        0531
*                        (R1,                                      0531
*                         R15) RSTD;                               0531
@RC00516 DS    0H                                                  0532
*                       R1=PPLPTR;                                 0532
         LR    R1,PPLPTR                                           0532
*                       DO;         /* CALLTSSR EP(IKJPARS)          */
*                         RESPECIFY                                0534
*                           GPR01P RSTD;                           0534
*                         IF CVTPARS=0 THEN                        0535
         L     @14,CVTPTR                                          0535
         L     @14,CVTPARS(,@14)                                   0535
         LTR   @14,@14                                             0535
         BNZ   @RF00535                                            0535
*                           GEN(LINK EP=IKJPARS);                  0536
         LINK EP=IKJPARS
*                         ELSE                                     0537
*                           CALL CVTPARS;                          0537
         B     @RC00535                                            0537
@RF00535 L     @08,CVTPTR                                          0537
         L     @15,CVTPARS(,@08)                                   0537
         BALR  @14,@15                                             0537
*                         RESPECIFY                                0538
*                           GPR01P UNRSTD;                         0538
@RC00535 DS    0H                                                  0539
*                       END;                                       0539
*                       RFY                                        0540
*                         R1 UNRSTD;                               0540
*                                                                  0541
*                       /*********************************************/
*                       /*                                           */
*                       /* IF THE PARSE RETURN CODE IS NON ZERO THEN */
*                       /* CALL IKJEFF19 TO ANALIZE THE PARSE ERROR  */
*                       /* CODE AND ISSUE A MESSAGE                  */
*                       /*                                           */
*                       /*********************************************/
*                                                                  0541
*                       IF R15^=CON0 THEN/* IF PARSE ERROR THEN USE  */
         SLR   @14,@14                                             0541
         CR    R15,@14                                             0541
         BE    @RF00541                                            0541
*                         DO;       /* IKJEFF19 TO DIAGNOSE          */
*                           GFPARMS=GFPARMS&&GFPARMS;              0543
         L     @08,ERRPTR                                          0543
         XC    GFPARMS(44,@08),GFPARMS(@08)                        0543
*                           GFRCODE=R15;                           0544
         ST    R15,GFRCODE(,@08)                                   0544
*                           RFY                                    0545
*                             R15 UNRSTD;                          0545
*                           GFCPPLP=CPPLPTR;                       0546
         L     @06,CPPLPTR(,ECDAPTR)                               0546
         ST    @06,GFCPPLP(,@08)                                   0546
*                           GFCALLID=GFPARSE;                      0547
         MVC   GFCALLID(2,@08),@CH00309                            0547
*                           GF02PTR=CON0;                          0548
         ST    @14,GF02PTR(,@08)                                   0548
*                           RFY                                    0549
*                             R1 RSTD;                             0549
*                           R1=ADDR(ERRPTR);                       0550
         LA    R1,ERRPTR                                           0550
*                           DO;     /* LINK EP(IKJEFF19)             */
*                             I00601='00'X;/* EP/DE FLAG             */
         MVI   I00601,X'00'                                        0552
*                             I00602=ADDR(IKJEFF19);/* ADDR OF EP/DE */
         LA    @08,@CC01292                                        0553
         STCM  @08,7,I00602                                        0553
*                             I00604=0;/* DCB PTR                    */
         STCM  @14,7,I00604                                        0554
*                             I00603='00'X;/* ERRET FLAG             */
         MVI   I00603,X'00'                                        0555
*                             RESPECIFY                            0556
*                              (GPR15P) RESTRICTED;                0556
*                             GPR15P=ADDR(I006);/* ADDR OF LINK LIST */
         LA    GPR15P,I006                                         0557
*                             SVC(6);/* ISSUE LINK SVC               */
         SVC   6                                                   0558
*                             RESPECIFY                            0559
*                              (GPR15P) UNRESTRICTED;              0559
*                           END;    /* LINK EP(IKJEFF19)             */
*                           RFY                                    0561
*                             R1 UNRSTD;                           0561
*                           NOTEXEC=YES;                           0562
         OI    NOTEXEC(ECDAPTR),B'01000000'                        0562
*                         END;                                     0563
*                       ELSE        /* PARSE SUCCESSFUL - CONTINUE   */
*                         DO;                                      0564
         B     @RC00541                                            0564
@RF00541 DS    0H                                                  0565
*                           SNTABPTR=SNTABFST;/* RESET BASES TO START
*                                      OF PROC                       */
         L     @06,LSDPTR(,ECDAPTR)                                0565
         L     @06,LSDEXEC(,@06)                                   0565
         L     @06,SNTABFST(,@06)                                  0565
         ST    @06,SNTABPTR                                        0565
*                           SNTELPTR=USNTABST;/* PARMS LOOP CONTROL  */
         L     SNTELPTR,USNTABST                                   0566
*                           PDLCUR=VLSTANS+LENGTH(PDLHEAD);/* RESET
*                                      BASES- PDLSTART               */
         LA    PDLCUR,8                                            0567
         AL    PDLCUR,VLSTANS                                      0567
*                           PCLCUR=PCLBASE+LENGTH(PCEHEAD);/* -    0568
*                                      PCLSTART                      */
         LA    PCLCUR,6                                            0568
         ALR   PCLCUR,PCLBASE                                      0568
*                           SBFCUR=SBFBASE+LENGTH(SUBFLD);/* -     0569
*                                      SUBSTART                      */
*                                                                  0569
         LA    SBFCUR,3                                            0569
         AL    SBFCUR,SBFBASE                                      0569
*                           /*****************************************/
*                           /*                                       */
*                           /* PLACE POSITIONAL PARAMETER VALUES IN  */
*                           /* SVTAB                                 */
*                           /*                                       */
*                           /*****************************************/
*                                                                  0570
*                           DO PCTR=1 TO POSNUM WHILE STABERR=NO;  0570
         LA    PCTR,1                                              0570
         B     @DE00570                                            0570
@DL00570 TM    STABERR,B'10000000'                                 0570
         BNZ   @DC00570                                            0570
*                             VALADR=IDPDEPTR;/* VALUE ADDRESS       */
         MVC   VALADR(4),IDPDEPTR(PDLCUR)                          0571
*                             VALLNG=IDPDELNG;/* VALUE LENGTH        */
         ICM   @06,12,IDPDELNG(PDLCUR)                             0572
         SRA   @06,16                                              0572
         ST    @06,VALLNG                                          0572
*                             RFY                                  0573
*                               R15 RSTD;                          0573
*                             CALL SVTABUPT;/* CREATE VALUE ENTRY    */
         BAL   @14,SVTABUPT                                        0574
*                             RFY                                  0575
*                               R15 UNRSTD;                        0575
*                             IF SNTLAST=YES THEN/* IF THIS IS LAST
*                                      ELEMT IN THIS                 */
         TM    SNTLAST(SNTELPTR),B'00000001'                       0576
         BNO   @RF00576                                            0576
*                               DO; /* TABLE THEN UPDATE TO NEXT     */
*                                 SNTABPTR=SNTABNXT;               0578
         L     @06,SNTABPTR                                        0578
         L     @06,SNTABNXT(,@06)                                  0578
         ST    @06,SNTABPTR                                        0578
*                                 SNTELPTR=SNTABPTR+LENGTH(SNTAB); 0579
         AL    @06,@CF01091                                        0579
         LR    SNTELPTR,@06                                        0579
*                               END;                               0580
*                             ELSE  /* OTHERWISE UPDATE TO NEXT    0581
*                                      ELEMENT IN THE CURRENT SNTAB  */
*                               SNTELPTR=SNTELPTR+SNTLNG+LENGTH(SNTELEM
*                                   );                             0581
         B     @RC00576                                            0581
@RF00576 LR    @06,SNTELPTR                                        0581
         AH    @06,SNTLNG(,SNTELPTR)                               0581
         AL    @06,@CF00078                                        0581
         LR    SNTELPTR,@06                                        0581
*                             PDLCUR=PDLCUR+LENGTH(IDENTPDE);      0582
@RC00576 AL    PDLCUR,@CF00078                                     0582
*                           END;                                   0583
         AL    PCTR,@CF00035                                       0583
@DE00570 C     PCTR,POSNUM                                         0583
         BNH   @DL00570                                            0583
@DC00570 DS    0H                                                  0584
*                                                                  0584
*                           /*****************************************/
*                           /*                                       */
*                           /* PLACE KEYWORD VALUES IN SVTAB         */
*                           /*                                       */
*                           /*****************************************/
*                                                                  0584
*                           DO PCTR=1 TO(KEYNUM+KEYWNUM) WHILE STABERR=
*                                 NO;                              0584
         LA    PCTR,1                                              0584
         B     @DE00584                                            0584
@DL00584 TM    STABERR,B'10000000'                                 0584
         BNZ   @DC00584                                            0584
*                             IF SNTKEY=YES THEN/* IF THIS IS A    0585
*                                      KEYWORD WITHOUT               */
         TM    SNTKEY(SNTELPTR),B'01000000'                        0585
         BNO   @RF00585                                            0585
*                               DO; /* VALUE THEN CHECK PDL TO SEE IF
*                                      FOUND OR NOT                  */
*                                 IF KEYPDEP=CON1 THEN/* IF FOUND IN
*                                      VALUE LIST THEN               */
         CLC   KEYPDEP(2,PDLCUR),@CH00035                          0587
         BNE   @RF00587                                            0587
*                                   DO;/* CONVERT IT TO A KEYWORD  0588
*                                      WITH VALUE WITH ITS VALUE THE */
*                                    VALADR=ADDR(SNTDATA);/* KEYWORD
*                                      NAME                          */
         LA    @06,SNTDATA(,SNTELPTR)                              0589
         ST    @06,VALADR                                          0589
*                                    VALLNG=SNTLNG;                0590
         LH    @06,SNTLNG(,SNTELPTR)                               0590
         ST    @06,VALLNG                                          0590
*                                   END;                           0591
*                                 ELSE/* IF NOT FOUND-STILL CONVERT  */
*                                   DO;/* HOWEVER IT HAS A NULL VLAUE*/
         B     @RC00587                                            0592
@RF00587 DS    0H                                                  0593
*                                    VALADR=ADDR(SNTDATA);         0593
         LA    @06,SNTDATA(,SNTELPTR)                              0593
         ST    @06,VALADR                                          0593
*                                    VALLNG=CON0;                  0594
         SLR   @06,@06                                             0594
         ST    @06,VALLNG                                          0594
*                                   END;                           0595
*                               END;                               0596
*                             ELSE  /* OTHERWISE UPDATE THE SVTAB  0597
*                                      WITH THE NEW VALUE IF IT WAS  */
*                               DO; /* SPECIFIED                     */
         B     @RC00585                                            0597
@RF00585 DS    0H                                                  0598
*                                 IF KEYPDEP=CON1 THEN/* IF KEYWORD
*                                      FOUND THEN                    */
         CLC   KEYPDEP(2,PDLCUR),@CH00035                          0598
         BNE   @RF00598                                            0598
*                                   DO;/* REPLACE OLD VALUE          */
*                                    VALADR=VIPDEPTR;              0600
         LA    @06,2                                               0600
         ALR   @06,PDLCUR                                          0600
         MVC   VALADR(4),VIPDEPTR(@06)                             0600
*                                    VALLNG=VIPDELNG;              0601
         ICM   @06,12,VIPDELNG(@06)                                0601
         SRA   @06,16                                              0601
         ST    @06,VALLNG                                          0601
*                                   END;                           0602
*                               END;                               0603
@RF00598 DS    0H                                                  0604
*                             IF SNTKEY=YES×/* IF THE KEYWORD VALUE
*                                      HAS                           */
*                                 KEYPDEP=CON1 THEN/* BEEN CHANGED 0604
*                                      THEN GO UPDATE                */
@RC00585 TM    SNTKEY(SNTELPTR),B'01000000'                        0604
         BO    @RT00604                                            0604
         CLC   KEYPDEP(2,PDLCUR),@CH00035                          0604
         BNE   @RF00604                                            0604
@RT00604 DS    0H                                                  0605
*                               DO; /* THE SVTAB                     */
*                                 RFY                              0606
*                                   R15 RSTD;                      0606
*                                 CALL SVTABUPT;/* UPDATE SVTAB      */
         BAL   @14,SVTABUPT                                        0607
*                                 RFY                              0608
*                                   R15 UNRSTD;                    0608
*                               END;                               0609
*                             IF SNTKEY=YES THEN/* UPDATE PDLCUR FOR
*                                      KEYWORDS                      */
@RF00604 TM    SNTKEY(SNTELPTR),B'01000000'                        0610
         BNO   @RF00610                                            0610
*                               PDLCUR=PDLCUR+LENGTH(KEYPDE);      0611
         AL    PDLCUR,@CF00064                                     0611
*                             ELSE  /* UPEATE PDLCUR FOR KEYWORDS  0612
*                                      WITH VALUE                    */
*                               PDLCUR=PDLCUR+LENGTH(KEYPDE)+LENGTH(
*                                   IDENTPDE);                     0612
         B     @RC00610                                            0612
@RF00610 AL    PDLCUR,@CF01109                                     0612
*                             IF SNTLAST=YES THEN/* IF THIS IS THE 0613
*                                      LAST ELMT IN                  */
@RC00610 TM    SNTLAST(SNTELPTR),B'00000001'                       0613
         BNO   @RF00613                                            0613
*                               DO; /* SNTAB THEN UPDATE TO NEXT     */
*                                 SNTABPTR=SNTABNXT;               0615
         L     @06,SNTABPTR                                        0615
         L     @06,SNTABNXT(,@06)                                  0615
         ST    @06,SNTABPTR                                        0615
*                                 SNTELPTR=SNTABPTR+LENGTH(SNTAB); 0616
         AL    @06,@CF01091                                        0616
         LR    SNTELPTR,@06                                        0616
*                               END;                               0617
*                             ELSE  /* OTHERWISE UPDATE TO NEXT ELMT
*                                      IN THE CURRENT SNTAB          */
*                               SNTELPTR=SNTELPTR+SNTLNG+LENGTH(SNTELEM
*                                   );                             0618
         B     @RC00613                                            0618
@RF00613 LR    @06,SNTELPTR                                        0618
         AH    @06,SNTLNG(,SNTELPTR)                               0618
         AL    @06,@CF00078                                        0618
         LR    SNTELPTR,@06                                        0618
*                           END;                                   0619
@RC00613 AL    PCTR,@CF00035                                       0619
@DE00584 L     @06,KEYNUM                                          0619
         AL    @06,KEYWNUM                                         0619
         CR    PCTR,@06                                            0619
         BNH   @DL00584                                            0619
@DC00584 DS    0H                                                  0620
*                         END;                                     0620
*                       GEN(IKJRLSA VLSTANS);/* FREE VALUE LIST PDL
*                                      CORE                          */
@RC00541 DS    0H                                                  0621
         IKJRLSA VLSTANS
*                       FREEADR=PCLBASE;/* FREE THE VALUE LIST PCL   */
         ST    PCLBASE,FREEADR                                     0622
*                       FREEAMT=PCLBASE->PCLLNG;/* FREE LENGTH       */
         LH    @08,PCLLNG(,PCLBASE)                                0623
         ST    @08,FREEAMT                                         0623
*                       IF COPYVLST=YES THEN/* IF VALUE LIST WAS     */
         TM    COPYVLST,B'00000010'                                0624
         BNO   @RF00624                                            0624
*                         FREEAMT=FREEAMT+VLSTLNG+CON4;/* COPIED THEN
*                                      UP THE AMT TO BE FREED        */
         L     @06,ECDAEANS(,ECDAPTR)                              0625
         AH    @08,VLSTLNG(,@06)                                   0625
         AL    @08,@CF00062                                        0625
         ST    @08,FREEAMT                                         0625
*                       DO;         /* FREEMAIN (E) LV(FREEAMT)    0626
*                                      A(FREEADR) SP(CON1)           */
@RF00624 DS    0H                                                  0627
*                         RESPECIFY                                0627
*                          (GPR01P) RESTRICTED;                    0627
*                         I005=I005&&I005;/* INIT LIST               */
         XC    I005(10),I005                                       0628
*                         I00505='00'X;/* SET TYPE                   */
         MVI   I00505,X'00'                                        0629
*                         I00502=FREEAMT;/* LENGTH                   */
         MVC   I00502(3),FREEAMT+1                                 0630
*                         I00504=ADDR(FREEADR);/* ADDR OF ADDR LIST  */
         LA    @00,FREEADR                                         0631
         STCM  @00,7,I00504                                        0631
*                         I00506=CON1;/* SUBPOOL VALUE               */
         MVI   I00506,X'01'                                        0632
*                         GPR01P=ADDR(I005);/* REG1 POINTS TO LIST   */
         LA    GPR01P,I005                                         0633
*                         SVC(5);   /* STANDARD-FORM OF GETMAIN      */
         SVC   5                                                   0634
*                         RESPECIFY                                0635
*                          (GPR01P) UNRESTRICTED;                  0635
*                       END;        /* FREEMAIN (E) LV(FREEAMT)    0636
*                                      A(FREEADR) SP(CON1)           */
*                     END;                                         0637
*                 END;                                             0638
@RC00438 DS    0H                                                  0639
*             END;                                                 0639
@RC00395 DS    0H                                                  0640
*         END;                                                     0640
@RC00295 DS    0H                                                  0641
*     END;                                                         0641
*                                                                  0641
@RC00254 DS    0H                                                  0642
*   /*****************************************************************/
*   /*                                                               */
*   /* IKJCT431 EXIT POINT                                           */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0642
*   RETURN CODE(CT431RET);                                         0642
@RC00112 L     @09,CT431RET                                        0642
         L     @13,4(,@13)                                         0642
         L     @00,@SIZDATD                                        0642
         LR    @01,@10                                             0642
         FREEMAIN R,LV=(0),A=(1)
         LR    @15,@09                                             0642
         L     @14,12(,@13)                                        0642
         LM    @00,@12,20(@13)                                     0642
         BR    @14                                                 0642
*                                                                  0643
*   /*****************************************************************/
*   /*                                                               */
*   /* SVTELUPT - UPDATES THE SVTABUSE WITH THE LENGTH OF THE VALUE  */
*   /* JUST ADDED AND UPDATES SNTELPTR TO THE NEXT AVAILABLE SLOT    */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0643
*SVTELUPT:                                                         0643
*   PROC;                                                          0643
SVTELUPT STM   @14,@08,12(@13)                                     0643
         STM   @10,@12,60(@13)                                     0643
*   RFY                                                            0644
*     SVTELEM BASED(SVTELPTR);                                     0644
*   SVTABUSE=SVTABUSE+LENGTH(SVTELEM)+SVTORIG;                     0645
         L     @08,SVTABPTR                                        0645
         LA    @15,4                                               0645
         L     @14,SVTABUSE(,@08)                                  0645
         ALR   @14,@15                                             0645
         LH    @07,SVTORIG(,SVTELPTR)                              0645
         ALR   @14,@07                                             0645
         ST    @14,SVTABUSE(,@08)                                  0645
*   SVTELPTR=SVTELPTR+LENGTH(SVTELEM)+SVTORIG;                     0646
         ALR   @15,SVTELPTR                                        0646
         ALR   @15,@07                                             0646
         LR    SVTELPTR,@15                                        0646
*   RFY                                                            0647
*     SVTELEM BASED(SNTVLPTR);                                     0647
*   END SVTELUPT;                                                  0648
@EL00002 DS    0H                                                  0648
@EF00002 DS    0H                                                  0648
@ER00002 LM    @14,@08,12(@13)                                     0648
         LM    @10,@12,60(@13)                                     0648
         BR    @14                                                 0648
*                                                                  0649
*   /*****************************************************************/
*   /*                                                               */
*   /* SKIPSEP- SKIP BLANKS, COMMAS, TABS AND COMMENTS IN THE INPUT  */
*   /* RECORD LOCATED BY ECDAIREC                                    */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0649
*SKIPSEP:                                                          0649
*   PROC;                                                          0649
SKIPSEP  STM   @14,@05,12(@13)                                     0649
         STM   @07,@08,48(@13)                                     0649
         STM   @10,@12,60(@13)                                     0649
*   CYCLE=CON1;                                                    0650
         LA    CYCLE,1                                             0650
*   DO WHILE CYCLE=CON1;                                           0651
         B     @DE00651                                            0651
@DL00651 DS    0H                                                  0652
*     DO ICTR=ICTR TO LINELNG WHILE RECORD(ICTR)=BLANK×RECORD(ICTR)=
*           COMMA×RECORD(ICTR)=TAB;                                0652
         B     @DE00652                                            0652
@DL00652 L     @08,ECDAIREC(,ECDAPTR)                              0652
         LR    @01,@08                                             0652
         ALR   @01,ICTR                                            0652
         CLI   RECORD-1(@01),C' '                                  0652
         BE    @DB00652                                            0652
         LR    @01,@08                                             0652
         ALR   @01,ICTR                                            0652
         CLI   RECORD-1(@01),C','                                  0652
         BE    @DB00652                                            0652
         ALR   @08,ICTR                                            0652
         CLI   RECORD-1(@08),X'05'                                 0652
         BNE   @DC00652                                            0652
@DB00652 DS    0H                                                  0653
*     END;                                                         0653
         AL    ICTR,@CF00035                                       0653
@DE00652 C     ICTR,LINELNG                                        0653
         BNH   @DL00652                                            0653
@DC00652 DS    0H                                                  0654
*     IF ICTR<LINELNG&RECORD(ICTR:ICTR+CON1)=SLASHAST THEN         0654
         C     ICTR,LINELNG                                        0654
         BNL   @RF00654                                            0654
         L     @08,ECDAIREC(,ECDAPTR)                              0654
         ALR   @08,ICTR                                            0654
         CLC   RECORD-1(2,@08),@CC01353                            0654
         BNE   @RF00654                                            0654
*       DO;                                                        0655
*         DO ICTR=(ICTR+CON2) TO(LINELNG-CON1) WHILE RECORD(ICTR:ICTR+
*               CON1)^=ASTSLASH;                                   0656
         LA    @08,2                                               0656
         ALR   @08,ICTR                                            0656
         LR    ICTR,@08                                            0656
         B     @DE00656                                            0656
@DL00656 L     @08,ECDAIREC(,ECDAPTR)                              0656
         ALR   @08,ICTR                                            0656
         CLC   RECORD-1(2,@08),@CC01355                            0656
         BE    @DC00656                                            0656
*         END;                                                     0657
         AL    ICTR,@CF00035                                       0657
@DE00656 L     @08,LINELNG                                         0657
         BCTR  @08,0                                               0657
         CR    ICTR,@08                                            0657
         BNH   @DL00656                                            0657
@DC00656 DS    0H                                                  0658
*         IF ICTR=LINELNG THEN                                     0658
         C     ICTR,LINELNG                                        0658
         BNE   @RF00658                                            0658
*           DO;                                                    0659
*             CYCLE=CON0;                                          0660
         SLR   CYCLE,CYCLE                                         0660
*             ICTR=ICTR+CON1;                                      0661
         AL    ICTR,@CF00035                                       0661
*           END;                                                   0662
*         ELSE                                                     0663
*           ICTR=ICTR+CON2;                                        0663
         B     @RC00658                                            0663
@RF00658 AL    ICTR,@CF00064                                       0663
*       END;                                                       0664
*     ELSE                                                         0665
*       CYCLE=CON0;                                                0665
         B     @RC00654                                            0665
@RF00654 SLR   CYCLE,CYCLE                                         0665
*   END;                                                           0666
@RC00654 DS    0H                                                  0666
@DE00651 C     CYCLE,@CF00035                                      0666
         BE    @DL00651                                            0666
*   END;                            /* PROCEDURE END                 */
@EL00003 DS    0H                                                  0667
@EF00003 DS    0H                                                  0667
@ER00003 LM    @14,@05,12(@13)                                     0667
         LM    @07,@08,48(@13)                                     0667
         LM    @10,@12,60(@13)                                     0667
         BR    @14                                                 0667
*                                                                  0668
*   /*****************************************************************/
*   /*                                                               */
*   /* FINDSEP - FINDS NEXT SEPERATOR IN RECORD LOCATED BY TCDAIBUF  */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0668
*FINDSEP:                                                          0668
*   PROC;                                                          0668
FINDSEP  STM   @14,@05,12(@13)                                     0668
         STM   @07,@12,48(@13)                                     0668
*   CYCLE=CON1;                                                    0669
         LA    CYCLE,1                                             0669
*   DO WHILE CYCLE=CON1;                                           0670
         B     @DE00670                                            0670
@DL00670 DS    0H                                                  0671
*     DO ICTR=ICTR TO LINELNG WHILE RECORD(ICTR)^=BLANK&RECORD(ICTR)^=
*           COMMA&RECORD(ICTR)^=TAB&RECORD(ICTR)^=SLASH;           0671
         B     @DE00671                                            0671
@DL00671 L     @08,ECDAIREC(,ECDAPTR)                              0671
         LR    @01,@08                                             0671
         ALR   @01,ICTR                                            0671
         CLI   RECORD-1(@01),C' '                                  0671
         BE    @DC00671                                            0671
         LR    @01,@08                                             0671
         ALR   @01,ICTR                                            0671
         CLI   RECORD-1(@01),C','                                  0671
         BE    @DC00671                                            0671
         LR    @01,@08                                             0671
         ALR   @01,ICTR                                            0671
         CLI   RECORD-1(@01),X'05'                                 0671
         BE    @DC00671                                            0671
         ALR   @08,ICTR                                            0671
         CLI   RECORD-1(@08),C'/'                                  0671
         BE    @DC00671                                            0671
*     END;                                                         0672
*                                                                  0672
         AL    ICTR,@CF00035                                       0672
@DE00671 C     ICTR,LINELNG                                        0672
         BNH   @DL00671                                            0672
@DC00671 DS    0H                                                  0673
*     /***************************************************************/
*     /*                                                             */
*     /* IF NOT OPENING COMMENT THEN CONTINUE SEARCH                 */
*     /*                                                             */
*     /***************************************************************/
*                                                                  0673
*     IF RECORD(ICTR)=SLASH&(ICTR=LINELNG×ICTR<LINELNG&RECORD(ICTR:ICTR
*         +CON1)^=SLASHAST) THEN                                   0673
         L     @08,ECDAIREC(,ECDAPTR)                              0673
         LR    @01,@08                                             0673
         ALR   @01,ICTR                                            0673
         CLI   RECORD-1(@01),C'/'                                  0673
         BNE   @RF00673                                            0673
         L     @15,LINELNG                                         0673
         CR    ICTR,@15                                            0673
         BE    @RT00673                                            0673
         CR    ICTR,@15                                            0673
         BNL   @RF00673                                            0673
         ALR   @08,ICTR                                            0673
         CLC   RECORD-1(2,@08),@CC01353                            0673
         BE    @RF00673                                            0673
@RT00673 DS    0H                                                  0674
*       ICTR=ICTR+CON1;                                            0674
         AL    ICTR,@CF00035                                       0674
*     ELSE                                                         0675
*       CYCLE=CON0;                                                0675
         B     @RC00673                                            0675
@RF00673 SLR   CYCLE,CYCLE                                         0675
*   END;                                                           0676
@RC00673 DS    0H                                                  0676
@DE00670 C     CYCLE,@CF00035                                      0676
         BE    @DL00670                                            0676
*   END;                            /* END OF FINDSEP PROCEDURE      */
@EL00004 DS    0H                                                  0677
@EF00004 DS    0H                                                  0677
@ER00004 LM    @14,@05,12(@13)                                     0677
         LM    @07,@12,48(@13)                                     0677
         BR    @14                                                 0677
*                                                                  0678
*   /*****************************************************************/
*   /*                                                               */
*   /* VALIDATE ROUTINE - THIS SUBROUTINE VERIFIES THAT REMAINING    */
*   /* CHARACTERS OF A SYMBOLIC PARAMETER UP TO FIRST SEPERATOR (OR  */
*   /* LEFT PAREN FOR KEYWORDS) ARE VALID ALPHANUMERIC               */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0678
*VALIDATE:                                                         0678
*   PROC;                                                          0678
VALIDATE STM   @14,@05,@SA00005                                    0678
         STM   @07,@12,@SA00005+32                                 0678
*   VALIDERR=NO;                                                   0679
         NI    VALIDERR,B'11111011'                                0679
*   CYCLE=CON1;                                                    0680
         LA    CYCLE,1                                             0680
*   DO ICTR=ICTR TO LINELNG WHILE CYCLE=CON1&VALIDERR=NO;          0681
         B     @DE00681                                            0681
@DL00681 C     CYCLE,@CF00035                                      0681
         BNE   @DC00681                                            0681
         TM    VALIDERR,B'00000100'                                0681
         BNZ   @DC00681                                            0681
*     IF RECORD(ICTR)<CONCA×        /* IF THE CHARACTER IS NOT A THRU*/
*         (RECORD(ICTR)>CONCI&      /* Z OR O THRU 9 THEN MAKE SURE  */
*         RECORD(ICTR)<CONCJ)×      /* IT WAS A SEPERATOR BY CALLING */
*         (RECORD(ICTR)>CONCR&RECORD(ICTR)<CONCS)×(RECORD(ICTR)>CONCZ&
*         RECORD(ICTR)<CONC0)×RECORD(ICTR)>CONC9 THEN/* SKIPSEP - IF
*                                      OFFSETS DIFFER                */
         L     @08,ECDAIREC(,ECDAPTR)                              0682
         LR    @01,@08                                             0682
         ALR   @01,ICTR                                            0682
         CLI   RECORD-1(@01),C'A'                                  0682
         BL    @RT00682                                            0682
         LR    @01,@08                                             0682
         ALR   @01,ICTR                                            0682
         CLI   RECORD-1(@01),C'I'                                  0682
         BNH   @GL00044                                            0682
         ALR   @08,ICTR                                            0682
         CLI   RECORD-1(@08),C'J'                                  0682
         BL    @RT00682                                            0682
@GL00044 L     @08,ECDAIREC(,ECDAPTR)                              0682
         LR    @01,@08                                             0682
         ALR   @01,ICTR                                            0682
         CLI   RECORD-1(@01),C'R'                                  0682
         BNH   @GL00043                                            0682
         ALR   @08,ICTR                                            0682
         CLI   RECORD-1(@08),C'S'                                  0682
         BL    @RT00682                                            0682
@GL00043 L     @08,ECDAIREC(,ECDAPTR)                              0682
         LR    @01,@08                                             0682
         ALR   @01,ICTR                                            0682
         CLI   RECORD-1(@01),C'Z'                                  0682
         BNH   @GL00042                                            0682
         ALR   @08,ICTR                                            0682
         CLI   RECORD-1(@08),C'0'                                  0682
         BL    @RT00682                                            0682
@GL00042 L     @08,ECDAIREC(,ECDAPTR)                              0682
         ALR   @08,ICTR                                            0682
         CLI   RECORD-1(@08),C'9'                                  0682
         BNH   @RF00682                                            0682
@RT00682 DS    0H                                                  0683
*       DO;                         /* UPON RETURN THEN IT IS AN     */
*         JCTR=ICTR;                /* ERROR SYNTAX UNLESS THIS IS   */
         ST    ICTR,JCTR                                           0684
*         CALL SKIPSEP;             /* A KEYWORD WITH VALUE          */
         BAL   @14,SKIPSEP                                         0685
*         IF ICTR=JCTR THEN                                        0686
         C     ICTR,JCTR                                           0686
         BNE   @RF00686                                            0686
*           IF KEYWORD=YES&RECORD(ICTR)=LFPAREN THEN               0687
         TM    KEYWORD,B'00001000'                                 0687
         BNO   @RF00687                                            0687
         L     @08,ECDAIREC(,ECDAPTR)                              0687
         ALR   @08,ICTR                                            0687
         CLI   RECORD-1(@08),C'('                                  0687
         BNE   @RF00687                                            0687
*             CYCLE=CON0;                                          0688
         SLR   CYCLE,CYCLE                                         0688
*           ELSE                                                   0689
*             VALIDERR=YES;                                        0689
         B     @RC00687                                            0689
@RF00687 OI    VALIDERR,B'00000100'                                0689
*         ELSE                                                     0690
*           CYCLE=CON0;                                            0690
         B     @RC00686                                            0690
@RF00686 SLR   CYCLE,CYCLE                                         0690
*       END;                                                       0691
@RC00686 DS    0H                                                  0692
*   END;                                                           0692
@RF00682 AL    ICTR,@CF00035                                       0692
@DE00681 C     ICTR,LINELNG                                        0692
         BNH   @DL00681                                            0692
@DC00681 DS    0H                                                  0693
*   IF CYCLE=CON1 THEN                                             0693
         C     CYCLE,@CF00035                                      0693
         BNE   @RF00693                                            0693
*     JCTR=ICTR;                                                   0694
         ST    ICTR,JCTR                                           0694
*   ELSE                                                           0695
*     ICTR=ICTR-CON1;                                              0695
         B     @RC00693                                            0695
@RF00693 BCTR  ICTR,0                                              0695
*   END;                            /* END OF VALIDATE PROCEDURE     */
@EL00005 DS    0H                                                  0696
@EF00005 DS    0H                                                  0696
@ER00005 LM    @14,@05,@SA00005                                    0696
         LM    @07,@12,@SA00005+32                                 0696
         BR    @14                                                 0696
*                                                                  0697
*   /*****************************************************************/
*   /*                                                               */
*   /* SNTABUPT = THE SNTABUPT ROUTINE UPDATES THE SNTAB(AND SVTAB)  */
*   /* BASED ON AN INPUT OPERATION CODE AND PARM TYPE PARMOP=CREATE-0*/
*   /* CREATE AN ENTRY PARMOP=LOCATE-1 LOCATE AN ENTRY (OR CREATE AN */
*   /* ENTRY IF ENTRY NOT FOUND AND THIS IS NOT A LABLE REQUEST      */
*   /* PARMTYPE=POSIT-1 POSITIONAL PARAMETER =KEY -2 KEYWORD WITHOUT */
*   /* VALUE =KEYWV-3 KEYWORD WITH VALUE                             */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0697
*SNTABUPT:                                                         0697
*   PROC;                                                          0697
SNTABUPT STM   @14,@07,@SA00006                                    0697
         STM   @09,@12,@SA00006+40                                 0697
*   SNTABPTR=SNTABFST;                                             0698
         L     @06,LSDPTR(,ECDAPTR)                                0698
         L     @06,LSDEXEC(,@06)                                   0698
         L     @06,SNTABFST(,@06)                                  0698
         ST    @06,SNTABPTR                                        0698
*   UPTPTR1=SNTABFST+LENGTH(SNTAB); /* ADDRESS OF FIRST ELEMENT      */
*                                                                  0699
         AL    @06,@CF01091                                        0699
         LR    UPTPTR1,@06                                         0699
*   /*****************************************************************/
*   /*                                                               */
*   /* DETERMINE IF NAME ALREADY DEFINED IN SNTAB                    */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0700
*   CYCLE=CON1;                                                    0700
         LA    CYCLE,1                                             0700
*   DO WHILE UPTPTR1^=SNTELPTR&CYCLE=CON1;                         0701
         B     @DE00701                                            0701
@DL00701 DS    0H                                                  0702
*     IF UPTPTR1->SNTLNG=PARMLNG&UPTPTR1->SNTDATA(1:UPTPTR1->SNTLNG)=
*         PARMDAT(1:UPTPTR1->SNTLNG) THEN                          0702
         LH    @06,SNTLNG(,UPTPTR1)                                0702
         C     @06,PARMLNG                                         0702
         BNE   @RF00702                                            0702
         BCTR  @06,0                                               0702
         L     @03,PARMADR                                         0702
         EX    @06,@SC01563                                        0702
         BNE   @RF00702                                            0702
*       CYCLE=CON0;                                                0703
         SLR   CYCLE,CYCLE                                         0703
*     ELSE                                                         0704
*       IF UPTPTR1->SNTLAST=YES THEN                               0704
         B     @RC00702                                            0704
@RF00702 TM    SNTLAST(UPTPTR1),B'00000001'                        0704
         BNO   @RF00704                                            0704
*         DO;                                                      0705
*           SNTABPTR=SNTABNXT;                                     0706
         L     @06,SNTABPTR                                        0706
         L     @06,SNTABNXT(,@06)                                  0706
         ST    @06,SNTABPTR                                        0706
*           UPTPTR1=SNTABPTR+LENGTH(SNTAB);                        0707
         AL    @06,@CF01091                                        0707
         LR    UPTPTR1,@06                                         0707
*         END;                                                     0708
*       ELSE                                                       0709
*         UPTPTR1=UPTPTR1+UPTPTR1->SNTLNG+LENGTH(SNTELEM);         0709
         B     @RC00704                                            0709
@RF00704 LR    @06,UPTPTR1                                         0709
         AH    @06,SNTLNG(,UPTPTR1)                                0709
         AL    @06,@CF00078                                        0709
         LR    UPTPTR1,@06                                         0709
*   END;                                                           0710
@RC00704 DS    0H                                                  0710
@RC00702 DS    0H                                                  0710
@DE00701 CR    UPTPTR1,SNTELPTR                                    0710
         BE    @DC00701                                            0710
         C     CYCLE,@CF00035                                      0710
         BE    @DL00701                                            0710
@DC00701 DS    0H                                                  0711
*   IF CYCLE=CON0 THEN              /* CYCLE SET TO ZERO IF PARAMETER*/
         LTR   CYCLE,CYCLE                                         0711
         BNZ   @RF00711                                            0711
*     DO;                           /* IS MULTIPLY DEFINED           */
*       EXMSGID=M530;                                              0713
         MVC   EXMSGID(4),@CC01275                                 0713
*       MVAR(1)=ADDR(MSGINS);                                      0714
         LA    @09,@CC01288                                        0714
         ST    @09,MVAR                                            0714
*       MVARLEN(1)=LENGTH(MSGINS);                                 0715
         MVI   MVARLEN,X'06'                                       0715
*       MVAR(2)=PARMADR;                                           0716
         L     @09,PARMADR                                         0716
         ST    @09,MVAR+4                                          0716
*       MVARLEN(2)=PARMLNG;                                        0717
         L     @09,PARMLNG                                         0717
         STC   @09,MVARLEN+4                                       0717
*       NOTEXEC=YES;                                               0718
         OI    NOTEXEC(ECDAPTR),B'01000000'                        0718
*       CALL MSGRTN;                                               0719
         BAL   @14,MSGRTN                                          0719
*     END;                                                         0720
*   ELSE                            /* PARAMETER WAS NOT ALREADY     */
*     DO;                           /* DEFINED SO WE MUST CREATE AN
*                                      ENTRY                         */
         B     @RC00711                                            0721
@RF00711 DS    0H                                                  0722
*       IF NOTEXEC=NO&(SNTABLNG-SNTABUSE<PARMLNG+LENGTH(SNTELEM)) THEN
         TM    NOTEXEC(ECDAPTR),B'01000000'                        0722
         BNZ   @RF00722                                            0722
         L     @09,SNTABPTR                                        0722
         L     @06,SNTABLNG(,@09)                                  0722
         L     @15,SNTABUSE(,@09)                                  0722
         LR    @14,@06                                             0722
         SLR   @14,@15                                             0722
         LA    @05,8                                               0722
         L     @04,PARMLNG                                         0722
         ALR   @04,@05                                             0722
         CR    @14,@04                                             0722
         BNL   @RF00722                                            0722
*         DO;                       /* IF REMAINING SNTAB NOT LARGE
*                                      ENOUGH THEN GET A NEW BLOCK   */
*           ECDALNEL->SNTLAST=YES;  /* INDICATE LAST ELEMENT IN    0724
*                                      CURRENT SNTAB                 */
*                                                                  0724
         L     @01,ECDALNEL(,ECDAPTR)                              0724
         OI    SNTLAST(@01),B'00000001'                            0724
*           /*********************************************************/
*           /*                                                       */
*           /* FREE UNUSED AMOUNT                                    */
*           /*                                                       */
*           /*********************************************************/
*                                                                  0725
*           FREEADR=(SNTABPTR+SNTABUSE+CON7)/CON8*CON8;            0725
         LR    @00,@09                                             0725
         ALR   @00,@15                                             0725
         AL    @00,@CF00139                                        0725
         SRDA  @00,32                                              0725
         DR    @00,@05                                             0725
         SLA   @01,3                                               0725
         ST    @01,FREEADR                                         0725
*           FREEAMT=SNTABPTR+SNTABLNG-FREEADR;                     0726
         ALR   @06,@09                                             0726
         SLR   @06,@01                                             0726
         ST    @06,FREEAMT                                         0726
*           SNTABLNG=SNTABUSE;                                     0727
         ST    @15,SNTABLNG(,@09)                                  0727
*           DO;                     /* FREEMAIN (E) LV(FREEAMT)    0728
*                                      A(FREEADR) SP(78)             */
*             RESPECIFY                                            0729
*              (GPR01P) RESTRICTED;                                0729
*             I005=I005&&I005;      /* INIT LIST                     */
         XC    I005(10),I005                                       0730
*             I00505='00'X;         /* SET TYPE                      */
         MVI   I00505,X'00'                                        0731
*             I00502=FREEAMT;       /* LENGTH                        */
         STCM  @06,7,I00502                                        0732
*             I00504=ADDR(FREEADR); /* ADDR OF ADDR LIST             */
         LA    @09,FREEADR                                         0733
         STCM  @09,7,I00504                                        0733
*             I00506=78;            /* SUBPOOL VALUE                 */
         MVI   I00506,X'4E'                                        0734
*             GPR01P=ADDR(I005);    /* REG1 POINTS TO LIST           */
         LA    GPR01P,I005                                         0735
*             SVC(5);               /* STANDARD-FORM OF GETMAIN      */
         SVC   5                                                   0736
*             RESPECIFY                                            0737
*              (GPR01P) UNRESTRICTED;                              0737
*           END;                    /* FREEMAIN (E) LV(FREEAMT)    0738
*                                      A(FREEADR) SP(78)             */
*           GETAMT=(SNTABLNG+FREEAMT+PARMLNG+CON7)/CON8*CON8;      0739
         L     @09,SNTABPTR                                        0739
         L     @00,SNTABLNG(,@09)                                  0739
         AL    @00,FREEAMT                                         0739
         AL    @00,PARMLNG                                         0739
         AL    @00,@CF00139                                        0739
         SRDA  @00,32                                              0739
         D     @00,@CF00078                                        0739
         SLA   @01,3                                               0739
         ST    @01,GETAMT                                          0739
*           RFY                                                    0740
*             R15 RSTD;                                            0740
*           DO;                     /* GETMAIN (EC) LV(GETAMT)     0741
*                                      A(GETADR) SP(78) RTCD(R15)    */
*             RESPECIFY                                            0742
*              (GPR01P,                                            0742
*               GPR15F) RESTRICTED;                                0742
*             I004=I004&&I004;      /* INIT LIST                     */
         XC    I004(10),I004                                       0743
*             I00404='20'X;         /* TYPE                          */
         MVI   I00404,X'20'                                        0744
*             I00401=GETAMT;        /* LENGTH                        */
         L     @14,GETAMT                                          0745
         ST    @14,I00401                                          0745
*             I00403=ADDR(GETADR);  /* ADDR OF ADDR LIST             */
         LA    @14,GETADR                                          0746
         STCM  @14,7,I00403                                        0746
*             I00405=78;            /* SUBPOOL VALUE                 */
         MVI   I00405,X'4E'                                        0747
*             GPR01P=ADDR(I004);    /* REG1 POINTS TO LIST           */
         LA    GPR01P,I004                                         0748
*             SVC(4);               /* STANDARD-FORM OF GETMAIN      */
         SVC   4                                                   0749
*             R15=GPR15F;           /* SET RETURN CODE               */
*             RESPECIFY                                            0751
*              (GPR01P,                                            0751
*               GPR15F) UNRESTRICTED;                              0751
*           END;                    /* GETMAIN (EC) LV(GETAMT)     0752
*                                      A(GETADR) SP(78) RTCD(R15)    */
*           IF R15^=CON0 THEN       /* RETURN CODE NON ZERO NOTIFY   */
         LTR   R15,R15                                             0753
         BZ    @RF00753                                            0753
*             DO;                   /* TYE USER -NOT ENOUGH STORAGE  */
*               RFY                                                0755
*                 R15 UNRSTD;                                      0755
*               EXMSGID=M511;                                      0756
         MVC   EXMSGID(4),@CC01271                                 0756
*               NOTEXEC=YES;                                       0757
         OI    NOTEXEC(ECDAPTR),B'01000000'                        0757
*               CALL MSGRTN;                                       0758
         BAL   @14,MSGRTN                                          0758
*               CT431RET=CON16;                                    0759
         MVC   CT431RET(4),@CF01028                                0759
*               STABERR=YES;        /* SET ERROR FLAG TO             */
         OI    STABERR,B'10000000'                                 0760
*             END;                  /* AVOID ANY FURHTER PARMS       */
*           ELSE                    /* GETMAIN SUCCESSFUL -          */
*             DO;                   /* INITIALIZE HEADER OF NEW      */
         B     @RC00753                                            0762
@RF00753 DS    0H                                                  0763
*               GETADR->SNTABNXT=CON0;/* BLOCK                       */
         L     @09,GETADR                                          0763
         SLR   @06,@06                                             0763
         ST    @06,SNTABNXT(,@09)                                  0763
*               GETADR->SNTABLNG=GETAMT;                           0764
         L     @06,GETAMT                                          0764
         ST    @06,SNTABLNG(,@09)                                  0764
*               GETADR->SNTABUSE=LENGTH(SNTAB);                    0765
         LA    @06,12                                              0765
         ST    @06,SNTABUSE(,@09)                                  0765
*               SNTABNXT=GETADR;                                   0766
         L     @01,SNTABPTR                                        0766
         ST    @09,SNTABNXT(,@01)                                  0766
*               SNTABPTR=SNTABNXT;                                 0767
         ST    @09,SNTABPTR                                        0767
*               SNTELPTR=SNTABPTR+LENGTH(SNTAB);                   0768
         ALR   @09,@06                                             0768
         LR    SNTELPTR,@09                                        0768
*             END;                                                 0769
*         END;                                                     0770
@RC00753 DS    0H                                                  0771
*       IF NOTEXEC=NO THEN          /* MOVE IN NAME OF SYMBOLIC PARM */
@RF00722 TM    NOTEXEC(ECDAPTR),B'01000000'                        0771
         BNZ   @RF00771                                            0771
*         DO;                                                      0772
*           SNTDATA(1:PARMLNG)=PARMDAT(1:PARMLNG);                 0773
         L     @09,PARMLNG                                         0773
         LR    @06,@09                                             0773
         BCTR  @06,0                                               0773
         L     @01,PARMADR                                         0773
         EX    @06,@SM01567                                        0773
*           SNTLNG=PARMLNG;                                        0774
         STH   @09,SNTLNG(,SNTELPTR)                               0774
*           SNTFLAGS=SNTFLAGS&&SNTFLAGS;                           0775
         XC    SNTFLAGS(2,SNTELPTR),SNTFLAGS(SNTELPTR)             0775
*           SNTVLPTR=ADDR(SVTELFST);                               0776
         L     @06,SVTABPTR                                        0776
         LA    @06,SVTELFST(,@06)                                  0776
         ST    @06,SNTVLPTR(,SNTELPTR)                             0776
*           SNTABUSE=SNTABUSE+SNTLNG+LENGTH(SNTELEM);              0777
         L     @06,SNTABPTR                                        0777
         AL    @09,SNTABUSE(,@06)                                  0777
         AL    @09,@CF00078                                        0777
         ST    @09,SNTABUSE(,@06)                                  0777
*           IF PARMTYPE=POSIT THEN  /* TURN ON APPROPRIATE SNTFLAGS  */
         LH    @09,PARMTYPE                                        0778
         LTR   @09,@09                                             0778
         BNZ   @RF00778                                            0778
*             SNTPOSIT=YES;                                        0779
         OI    SNTPOSIT(SNTELPTR),B'10000000'                      0779
*           ELSE                                                   0780
*             IF PARMTYPE=KEYWO THEN/* IS IT A KEYWORD WITHOUT VALUE */
         B     @RC00778                                            0780
@RF00778 CLC   PARMTYPE(2),@CH00035                                0780
         BNE   @RF00780                                            0780
*               SNTKEY=YES;                                        0781
         OI    SNTKEY(SNTELPTR),B'01000000'                        0781
*             ELSE                  /* IF IT IS A KEYWORD WITH VALUE */
*               DO;                 /* THEN ASSIGN A VTABELEMENT     */
         B     @RC00780                                            0782
@RF00780 DS    0H                                                  0783
*                 SNTKEYW=YES;                                     0783
         OI    SNTKEYW(SNTELPTR),B'00100000'                       0783
*                 CALL SVTABUPT;                                   0784
         BAL   @14,SVTABUPT                                        0784
*               END;                                               0785
*           ECDALNEL=SNTELPTR;                                     0786
@RC00780 DS    0H                                                  0786
@RC00778 ST    SNTELPTR,ECDALNEL(,ECDAPTR)                         0786
*           SNTELPTR=SNTELPTR+SNTLNG+LENGTH(SNTELEM);              0787
         LR    @09,SNTELPTR                                        0787
         AH    @09,SNTLNG(,SNTELPTR)                               0787
         AL    @09,@CF00078                                        0787
         LR    SNTELPTR,@09                                        0787
*         END;                                                     0788
*     END;                                                         0789
*   END;                            /* END OF SNTAB UPDATE PROCEDURE */
@EL00006 DS    0H                                                  0790
@EF00006 DS    0H                                                  0790
@ER00006 LM    @14,@07,@SA00006                                    0790
         LM    @09,@12,@SA00006+40                                 0790
         BR    @14                                                 0790
*                                                                  0791
*   /*****************************************************************/
*   /*                                                               */
*   /* SVTABUPT - SVTABUPT ROUTINE WILL CREATE OR ASSIGN A NEW VALUE */
*   /* ELEMENT FOR THE VALUE SPECIFIED IN THE SNTAB/SVTAB PARM BLOCK */
*   /* UPON ENTRY THE SNTELPTR IS POINTING TO THE SNTAB ELEMENT      */
*   /* REQUIRING A VALUE ELEMENT                                     */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0791
*SVTABUPT:                                                         0791
*   PROC;                                                          0791
SVTABUPT STM   @14,@07,@SA00007                                    0791
         STM   @09,@12,@SA00007+40                                 0791
*   TOBEADD=SNTELPTR;                                              0792
         LR    TOBEADD,SNTELPTR                                    0792
*   SVTABPTR=SVTABFST;                                             0793
*                                                                  0793
         L     @06,LSDPTR(,ECDAPTR)                                0793
         L     @06,LSDEXEC(,@06)                                   0793
         L     @06,SVTABFST(,@06)                                  0793
         ST    @06,SVTABPTR                                        0793
*   /*****************************************************************/
*   /*                                                               */
*   /* FIRST DETERMINE IF THE NEW VALUE WILL FIT IN THE OLD SLOT     */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0794
*   IF VALLNG>SVTORIG THEN          /* IF A NEW ELEMENT MUST BE      */
         L     @15,SNTVLPTR(,SNTELPTR)                             0794
         LH    @14,SVTORIG(,@15)                                   0794
         C     @14,VALLNG                                          0794
         BNL   @RF00794                                            0794
*     DO;                           /* ASSIGNED THEN ADD THE CURRENT */
*       IF SNTVLPTR^=ADDR(SVTELFST) THEN/* ELEMENT LENGTH TO THE     */
         LA    @05,SVTELFST(,@06)                                  0796
         CR    @15,@05                                             0796
         BE    @RF00796                                            0796
*         SVTABFRE=SVTABFRE+SVTORIG+LENGTH(SVTELEM);/* FREE SPACE    */
*                                                                  0797
         AL    @14,SVTABFRE(,@06)                                  0797
         AL    @14,@CF00062                                        0797
         ST    @14,SVTABFRE(,@06)                                  0797
*       /*************************************************************/
*       /*                                                           */
*       /* IF THE NEW VALUE WILL NOT FIT IN THE EXISTING SVTAB       */
*       /* ELEMENT THEN A NEW ELEMENT MUST BE ASSIGNED FROM THE      */
*       /* REMAINING SPACE IN THE SVTAB.                             */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0798
*       IF(VALLNG+LENGTH(SVTELEM))>(SVTABLNG-SVTABUSE) THEN/* IF   0798
*                                      VALUE                         */
@RF00796 L     @06,VALLNG                                          0798
         LA    @15,4                                               0798
         ALR   @15,@06                                             0798
         L     @14,SVTABPTR                                        0798
         L     @05,SVTABLNG(,@14)                                  0798
         L     @04,SVTABUSE(,@14)                                  0798
         LR    @03,@05                                             0798
         SLR   @03,@04                                             0798
         CR    @15,@03                                             0798
         BNH   @RF00798                                            0798
*         DO;                       /* WILL NOT FIX IN EXISTING SVTAB
*                                      THEN WE WILL HAVE TO GET A NEW
*                                      SVTAB                         */
*           GETAMT=SVTABUSE-SVTABFRE;                              0800
         SL    @04,SVTABFRE(,@14)                                  0800
         ST    @04,GETAMT                                          0800
*           GETAMT=MAX(GETAMT,SVTABLNG);/* SELECT THE MAXIMUM OF THE
*                                      AMOUNT CALCULATED ABOVE AND 0801
*                                      THE LENGTH OF THE CURRENT   0801
*                                      SVTAB TABLE                   */
         CR    @04,@05                                             0801
         BNL   *+6
         LR    @04,@05                                             0801
         ST    @04,GETAMT                                          0801
*           GETAMT=GETAMT+MAX(GETAMT/2,VALLNG+GAS);                0802
         LR    @00,@04                                             0802
         SRDA  @00,32                                              0802
         D     @00,@CF00064                                        0802
         AL    @06,@CF01269                                        0802
         CR    @01,@06                                             0802
         BNL   *+6
         LR    @01,@06                                             0802
         ALR   @04,@01                                             0802
         ST    @04,GETAMT                                          0802
*           RFY                                                    0803
*             R15 RSTD;                                            0803
*           DO;                     /* GETMAIN (EC) LV(GETAMT)     0804
*                                      A(GETADR) SP(78) RTCD(R15)    */
*             RESPECIFY                                            0805
*              (GPR01P,                                            0805
*               GPR15F) RESTRICTED;                                0805
*             I004=I004&&I004;      /* INIT LIST                     */
         XC    I004(10),I004                                       0806
*             I00404='20'X;         /* TYPE                          */
         MVI   I00404,X'20'                                        0807
*             I00401=GETAMT;        /* LENGTH                        */
         ST    @04,I00401                                          0808
*             I00403=ADDR(GETADR);  /* ADDR OF ADDR LIST             */
         LA    @14,GETADR                                          0809
         STCM  @14,7,I00403                                        0809
*             I00405=78;            /* SUBPOOL VALUE                 */
         MVI   I00405,X'4E'                                        0810
*             GPR01P=ADDR(I004);    /* REG1 POINTS TO LIST           */
         LA    GPR01P,I004                                         0811
*             SVC(4);               /* STANDARD-FORM OF GETMAIN      */
         SVC   4                                                   0812
*             R15=GPR15F;           /* SET RETURN CODE               */
*             RESPECIFY                                            0814
*              (GPR01P,                                            0814
*               GPR15F) UNRESTRICTED;                              0814
*           END;                    /* GETMAIN (EC) LV(GETAMT)     0815
*                                      A(GETADR) SP(78) RTCD(R15)    */
*           IF R15^=CON0 THEN                                      0816
         LTR   R15,R15                                             0816
         BZ    @RF00816                                            0816
*             DO;                                                  0817
*               RFY                                                0818
*                 R15 UNRSTD;                                      0818
*               EXMSGID=M511;                                      0819
         MVC   EXMSGID(4),@CC01271                                 0819
*               CT431RET=CON16;                                    0820
         MVC   CT431RET(4),@CF01028                                0820
*               NOTEXEC=YES;                                       0821
         OI    NOTEXEC(ECDAPTR),B'01000000'                        0821
*               CALL MSGRTN;                                       0822
         BAL   @14,MSGRTN                                          0822
*               STABERR=YES;                                       0823
         OI    STABERR,B'10000000'                                 0823
*               RETURN;                                            0824
@EL00007 DS    0H                                                  0824
@EF00007 DS    0H                                                  0824
@ER00007 LM    @14,@07,@SA00007                                    0824
         LM    @09,@12,@SA00007+40                                 0824
         BR    @14                                                 0824
*             END;                                                 0825
*           ELSE                    /* INITIAL SVTAB HEADER FIELDS   */
*             DO;                   /* IN THE NEW BLOCK              */
@RF00816 DS    0H                                                  0827
*               GETADR->SVTABNXT=CON0;                             0827
         SLR   @02,@02                                             0827
         L     @15,GETADR                                          0827
         ST    @02,SVTABNXT(,@15)                                  0827
*               GETADR->SVTABLNG=GETAMT;                           0828
         L     @14,GETAMT                                          0828
         ST    @14,SVTABLNG(,@15)                                  0828
*               GETADR->SVTABUSE=LENGTH(SVTAB);                    0829
         LA    @14,16                                              0829
         ST    @14,SVTABUSE(,@15)                                  0829
*               GETADR->SVTABFRE=CON0;                             0830
         ST    @02,SVTABFRE(,@15)                                  0830
*               SVTABNXT=GETADR;                                   0831
         L     @01,SVTABPTR                                        0831
         ST    @15,SVTABNXT(,@01)                                  0831
*               NEWVELEM=SVTABNXT+LENGTH(SVTAB);/* FITST ASSIGNABLE
*                                      ELEMENT IN NEW SVTAB          */
         ALR   @14,@15                                             0832
         LR    NEWVELEM,@14                                        0832
*               NEWVELEM->SVTLNG=CON0;/* CREATE A NULL ELEMENT AS    */
         STH   @02,SVTLNG(,NEWVELEM)                               0833
*               NEWVELEM->SVTORIG=CON0;/* FIRST ELEMENT IN NEW SVTAB */
         STH   @02,SVTORIG(,NEWVELEM)                              0834
*               NEWVELEM=NEWVELEM+LENGTH(SVTELEM);                 0835
         LA    @02,4                                               0835
         ALR   NEWVELEM,@02                                        0835
*               SVTABNXT->SVTABUSE=SVTABNXT->SVTABUSE+LENGTH(SVTELEM);
         AL    @02,SVTABUSE(,@15)                                  0836
         ST    @02,SVTABUSE(,@15)                                  0836
*               SAVSNTAB=SNTABPTR;  /* SAVE ADDRESS OF CURRENT SNTAB
*                                      ESTABLISH BASE TO FIRST SNTAB */
         L     @02,SNTABPTR                                        0837
         ST    @02,SAVSNTAB                                        0837
*               SNTABPTR=SNTABFST;  /* AND FIRST SNTAB ELEMENT       */
         L     @02,LSDPTR(,ECDAPTR)                                0838
         L     @02,LSDEXEC(,@02)                                   0838
         L     @02,SNTABFST(,@02)                                  0838
         ST    @02,SNTABPTR                                        0838
*               SNTELPTR=SNTABPTR+LENGTH(SNTAB);                   0839
         AL    @02,@CF01091                                        0839
         LR    SNTELPTR,@02                                        0839
*               RFY                                                0840
*                (R2) RSTD;                                        0840
*               R2=NEWVELEM;        /* REGISTER TWO IS START OF FREE
*                                      SPACE IN NEW SVTAB, UPDATED 0841
*                                      AUTO BY MVCL                  */
*                                                                  0841
         LR    R2,NEWVELEM                                         0841
*               /*****************************************************/
*               /*                                                   */
*               /* COPY VALUE ELEMENTS TO NEW TABLE                  */
*               /*                                                   */
*               /*****************************************************/
*                                                                  0842
*               LASTELMT=ECDALNEL+ECDALNEL->SNTLNG+LENGTH(SNTELEM);
         L     @03,ECDALNEL(,ECDAPTR)                              0842
         LH    LASTELMT,SNTLNG(,@03)                               0842
         ALR   LASTELMT,@03                                        0842
         AL    LASTELMT,@CF00078                                   0842
*               DO WHILE SNTELPTR^=LASTELMT;                       0843
         B     @DE00843                                            0843
@DL00843 DS    0H                                                  0844
*                 IF SNTELPTR^=TOBEADD THEN/* IF WE ARE AT THE     0844
*                                      ELEMENT                       */
         CR    SNTELPTR,TOBEADD                                    0844
         BE    @RF00844                                            0844
*                   DO;             /* THAT IS CHANGING THEN BYPASS
*                                      THE VALUE MOVE                */
*                     IF SNTVLPTR^=ADDR(SVTELFST) THEN/* IF THIS IS
*                                      NOT                           */
         L     @03,SNTVLPTR(,SNTELPTR)                             0846
         L     @01,SVTABPTR                                        0846
         LA    @15,SVTELFST(,@01)                                  0846
         CR    @03,@15                                             0846
         BE    @RF00846                                            0846
*                       DO;         /* A NULL VALUE THEN COPY VALUE  */
*                         RFY                                      0848
*                          (R3,                                    0848
*                           R4,                                    0848
*                           R5) RSTD;                              0848
*                         R4=SNTVLPTR;                             0849
         L     @15,SNTVLPTR(,SNTELPTR)                             0849
         LR    R4,@15                                              0849
*                         R3=SVTORIG+LENGTH(SVTELEM);              0850
         LA    R3,4                                                0850
         AH    R3,SVTORIG(,@15)                                    0850
*                         R5=R3;                                   0851
         LR    R5,R3                                               0851
*                         VLPTR=R2;                                0852
         ST    R2,VLPTR                                            0852
*                         MVCL(R2,R4);                             0853
         MVCL  R2,R4                                               0853
*                         SVTABNXT->SVTABUSE=SVTABNXT->SVTABUSE+SVTORIG
*                             +LENGTH(SVTELEM);                    0854
         L     @01,SVTABPTR                                        0854
         L     @15,SVTABNXT(,@01)                                  0854
         L     @14,SNTVLPTR(,SNTELPTR)                             0854
         LH    @01,SVTORIG(,@14)                                   0854
         L     @00,SVTABUSE(,@15)                                  0854
         ALR   @00,@01                                             0854
         AL    @00,@CF00062                                        0854
         ST    @00,SVTABUSE(,@15)                                  0854
*                         SVTABNXT->SVTABFRE=SVTABNXT->SVTABFRE+(  0855
*                             SVTORIG-SVTLNG);                     0855
         SH    @01,SVTLNG(,@14)                                    0855
         AL    @01,SVTABFRE(,@15)                                  0855
         ST    @01,SVTABFRE(,@15)                                  0855
*                         SNTVLPTR=VLPTR;                          0856
         L     @15,VLPTR                                           0856
         ST    @15,SNTVLPTR(,SNTELPTR)                             0856
*                         RFY                                      0857
*                          (R3,                                    0857
*                           R4,                                    0857
*                           R5) UNRSTD;                            0857
*                       END;                                       0858
*                     ELSE          /* OTHERWISE IF NULL ASSIGN VALUE*/
*                       SNTVLPTR=SVTABNXT+LENGTH(SVTAB);/* TO FIRST
*                                      ENTRY IN NEW SVTAB            */
         B     @RC00846                                            0859
@RF00846 LA    @03,16                                              0859
         L     @01,SVTABPTR                                        0859
         AL    @03,SVTABNXT(,@01)                                  0859
         ST    @03,SNTVLPTR(,SNTELPTR)                             0859
*                   END;                                           0860
@RC00846 DS    0H                                                  0861
*                 IF SNTLAST=YES THEN/* IF AT LAST ELEMENT IN SNTAB  */
@RF00844 TM    SNTLAST(SNTELPTR),B'00000001'                       0861
         BNO   @RF00861                                            0861
*                   DO;             /* THEN UPDATE TO NEXT SNTAB     */
*                     SNTABPTR=SNTABNXT;/* AND ITS FIRST ELEMENT     */
         L     @03,SNTABPTR                                        0863
         L     @03,SNTABNXT(,@03)                                  0863
         ST    @03,SNTABPTR                                        0863
*                     SNTELPTR=SNTABPTR+LENGTH(SNTAB);             0864
         AL    @03,@CF01091                                        0864
         LR    SNTELPTR,@03                                        0864
*                   END;                                           0865
*                 ELSE              /* OTHERWISE UPDATE TO NEXT      */
*                   SNTELPTR=SNTELPTR+SNTLNG+LENGTH(SNTELEM);/*    0866
*                                      ELEMENT IN THE CURRENT SNTAB
*                                      TABLE                         */
         B     @RC00861                                            0866
@RF00861 LR    @03,SNTELPTR                                        0866
         AH    @03,SNTLNG(,SNTELPTR)                               0866
         AL    @03,@CF00078                                        0866
         LR    SNTELPTR,@03                                        0866
*               END;                                               0867
@RC00861 DS    0H                                                  0867
@DE00843 CR    SNTELPTR,LASTELMT                                   0867
         BNE   @DL00843                                            0867
*               RFY                                                0868
*                 R2 UNRSTD;                                       0868
*               FREEADR=SVTABPTR;   /* FREE THE OLD SVTAB WHEN ALL   */
         L     @08,SVTABPTR                                        0869
         ST    @08,FREEADR                                         0869
*               FREEAMT=SVTABLNG;   /* VALUES HAVE BEEN COPIED       */
         L     @06,SVTABLNG(,@08)                                  0870
         ST    @06,FREEAMT                                         0870
*               SVTABFST=SVTABNXT;                                 0871
         L     @01,LSDPTR(,ECDAPTR)                                0871
         L     @01,LSDEXEC(,@01)                                   0871
         L     @08,SVTABNXT(,@08)                                  0871
         ST    @08,SVTABFST(,@01)                                  0871
*               SVTABPTR=SVTABFST;                                 0872
         ST    @08,SVTABPTR                                        0872
*               DO;                 /* FREEMAIN (E) LV(FREEAMT)    0873
*                                      A(FREEADR) SP(78)             */
*                 RESPECIFY                                        0874
*                  (GPR01P) RESTRICTED;                            0874
*                 I005=I005&&I005;  /* INIT LIST                     */
         XC    I005(10),I005                                       0875
*                 I00505='00'X;     /* SET TYPE                      */
         MVI   I00505,X'00'                                        0876
*                 I00502=FREEAMT;   /* LENGTH                        */
         STCM  @06,7,I00502                                        0877
*                 I00504=ADDR(FREEADR);/* ADDR OF ADDR LIST          */
         LA    @08,FREEADR                                         0878
         STCM  @08,7,I00504                                        0878
*                 I00506=78;        /* SUBPOOL VALUE                 */
         MVI   I00506,X'4E'                                        0879
*                 GPR01P=ADDR(I005);/* REG1 POINTS TO LIST           */
         LA    GPR01P,I005                                         0880
*                 SVC(5);           /* STANDARD-FORM OF GETMAIN      */
         SVC   5                                                   0881
*                 RESPECIFY                                        0882
*                  (GPR01P) UNRESTRICTED;                          0882
*               END;                /* FREEMAIN (E) LV(FREEAMT)    0883
*                                      A(FREEADR) SP(78)             */
*             END;                                                 0884
*           SNTABPTR=SAVSNTAB;      /* RESTORE TO CURRENT SNTAB      */
         L     @06,SAVSNTAB                                        0885
         ST    @06,SNTABPTR                                        0885
*           SNTELPTR=TOBEADD;       /* RESTORE SNTAB ELEMENT BASE    */
         LR    SNTELPTR,TOBEADD                                    0886
*         END;                                                     0887
*       SVTELPTR=SVTABFST+SVTABUSE; /* PLACE NEW ELEMENT AT END OF   */
@RF00798 L     @06,LSDPTR(,ECDAPTR)                                0888
         L     @06,LSDEXEC(,@06)                                   0888
         L     @15,SVTABPTR                                        0888
         L     @14,SVTABUSE(,@15)                                  0888
         L     SVTELPTR,SVTABFST(,@06)                             0888
         ALR   SVTELPTR,@14                                        0888
*       SNTVLPTR=SVTELPTR;          /* THE OLD (OR NEW) TABLE        */
         ST    SVTELPTR,SNTVLPTR(,SNTELPTR)                        0889
*       SVTORIG=VALLNG;             /* NEW ELEMENTS ARE EXACT IN     */
         L     @09,SNTVLPTR(,SNTELPTR)                             0890
         L     @06,VALLNG                                          0890
         STH   @06,SVTORIG(,@09)                                   0890
*       SVTLNG=SVTORIG;             /* SIZE                          */
         STH   @06,SVTLNG(,@09)                                    0891
*       SVTABUSE=SVTABUSE+SVTORIG+LENGTH(SVTELEM);                 0892
         ALR   @14,@06                                             0892
         AL    @14,@CF00062                                        0892
         ST    @14,SVTABUSE(,@15)                                  0892
*     END;                                                         0893
*                                                                  0893
*   /*****************************************************************/
*   /*                                                               */
*   /* PLACE THE NEW VALUE INTO THE SVTAB ELEMENT                    */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0894
*   SVTABFRE=SVTABFRE-(VALLNG-SVTLNG);/* ADJUST THE FREE AREA TO TAKE
*                                      INTO ACCOUNT ANY DIFFERENCE IN
*                                      THE ORIGIONAL LENGTH          */
@RF00794 L     @09,SVTABPTR                                        0894
         L     @06,VALLNG                                          0894
         L     @15,SNTVLPTR(,SNTELPTR)                             0894
         LR    @14,@06                                             0894
         SH    @14,SVTLNG(,@15)                                    0894
         LCR   @14,@14                                             0894
         AL    @14,SVTABFRE(,@09)                                  0894
         ST    @14,SVTABFRE(,@09)                                  0894
*   SVTLNG=VALLNG;                  /* SET NEW LENGTH                */
         STH   @06,SVTLNG(,@15)                                    0895
*   RFY                                                            0896
*    (R2,                                                          0896
*     R3,                                                          0896
*     R4,                                                          0896
*     R5) RSTD;                                                    0896
*   R2=ADDR(SVTDATA);               /* MOVE TO ADDRESS               */
         LA    R2,SVTDATA(,@15)                                    0897
*   R4=VALADR;                      /* MOVE FROM ADDRESS             */
         L     R4,VALADR                                           0898
*   R3=VALLNG;                      /* LENGTH OF MOVE                */
         LR    R3,@06                                              0899
*   R5=R3;                                                         0900
         LR    R5,R3                                               0900
*   MVCL(R2,R4);                    /* MOVE DATA                     */
         MVCL  R2,R4                                               0901
*   RFY                                                            0902
*    (R2,                                                          0902
*     R3,                                                          0902
*     R4,                                                          0902
*     R5) UNRSTD;                                                  0902
*   END SVTABUPT;                                                  0903
         B     @EL00007                                            0903
*                                                                  0904
*   /*****************************************************************/
*   /*                                                               */
*   /* VALUECHK - LOCATES THE START AND ENDING POSITIONS FOR THE     */
*   /* VLAUE OF A KEYWORD AND VERIFIES THAT IT IS EITHER A QUOTED    */
*   /* STRING OR A CHARACTER STRING                                  */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0904
*VALUECHK:                                                         0904
*   PROC;                                                          0904
VALUECHK STM   @14,@05,@SA00008                                    0904
         STM   @07,@12,@SA00008+32                                 0904
*   LFPARCTR=CON1;                                                 0905
         LA    @08,1                                               0905
         LR    LFPARCTR,@08                                        0905
*   VALSTR=CON0;                                                   0906
         SLR   @03,@03                                             0906
         ST    @03,VALSTR                                          0906
*   VALEND=CON0;                                                   0907
         ST    @03,VALEND                                          0907
*   ICTR=ICTR+CON1;                 /* INCREMENT PAST LEFT PAREN     */
         ALR   ICTR,@08                                            0908
*   CALL SKIPSEP;                                                  0909
         BAL   @14,SKIPSEP                                         0909
*   IF ICTR^>LINELNG THEN                                          0910
         C     ICTR,LINELNG                                        0910
         BH    @RF00910                                            0910
*     DO;                                                          0911
*       IF RECORD(ICTR)=QUOTE THEN  /* QUOTED STRING PROCESSING      */
         L     @03,ECDAIREC(,ECDAPTR)                              0912
         ALR   @03,ICTR                                            0912
         CLI   RECORD-1(@03),C''''                                 0912
         BNE   @RF00912                                            0912
*         DO;                                                      0913
*           ICTR=ICTR+CON1;         /* INCREMENT PAST FIRST QUOTE    */
         LA    @08,1                                               0914
         ALR   ICTR,@08                                            0914
*           VALSTR=ICTR;            /* SAVE START OF VALUE           */
         ST    ICTR,VALSTR                                         0915
*           CYCLE=CON1;             /* LOOP CONTROL SEARCH FOR VALUE
*                                      END                           */
         LR    CYCLE,@08                                           0916
*           DO ICTR=ICTR TO LINELNG WHILE CYCLE=CON1;              0917
         B     @DE00917                                            0917
@DL00917 LA    @08,1                                               0917
         CR    CYCLE,@08                                           0917
         BNE   @DC00917                                            0917
*             IF RECORD(ICTR)=QUOTE THEN/* CHECK FOR ENDING QUOTE    */
         L     @15,ECDAIREC(,ECDAPTR)                              0918
         LR    @14,@15                                             0918
         ALR   @14,ICTR                                            0918
         CLI   RECORD-1(@14),C''''                                 0918
         BNE   @RF00918                                            0918
*               DO;                 /* IF THIS IS A DOUBLE QUOTE THEN
*                                      REMOVE ONE FROM VALUE AND   0919
*                                      CONTINUE SEARCH FOR VALUE END */
*                 IF ICTR<LINELNG&RECORD(ICTR+CON1)=QUOTE THEN     0920
         L     @14,LINELNG                                         0920
         CR    ICTR,@14                                            0920
         BNL   @RF00920                                            0920
         LR    @01,@15                                             0920
         ALR   @01,ICTR                                            0920
         CLI   RECORD(@01),C''''                                   0920
         BNE   @RF00920                                            0920
*                   DO;                                            0921
*                     RFY                                          0922
*                      (R2,                                        0922
*                       R3,                                        0922
*                       R4,                                        0922
*                       R5) RSTD;                                  0922
*                     R2=ADDR(RECORD(ICTR));                       0923
         LA    R2,RECORD-1(ICTR,@15)                               0923
*                     R4=ADDR(RECORD(ICTR+CON1));                  0924
         LA    R4,RECORD(ICTR,@15)                                 0924
*                     R3=LINELNG-ICTR+CON1;                        0925
         SLR   @14,ICTR                                            0925
         ALR   @14,@08                                             0925
         LR    R3,@14                                              0925
*                     R5=R3;                                       0926
         LR    R5,R3                                               0926
*                     MVCL(R2,R4);                                 0927
         MVCL  R2,R4                                               0927
*                     RFY                                          0928
*                      (R2,                                        0928
*                       R3,                                        0928
*                       R4,                                        0928
*                       R5) UNRSTD;                                0928
*                     LINELNG=LINELNG-CON1;                        0929
         L     @08,LINELNG                                         0929
         BCTR  @08,0                                               0929
         ST    @08,LINELNG                                         0929
*                   END;                                           0930
*                 ELSE              /* IF NOT DOUBLE QUOTES THEN THIS*/
*                   DO;             /* IS THE VALUE END              */
         B     @RC00920                                            0931
@RF00920 DS    0H                                                  0932
*                     VALEND=ICTR-CON1;                            0932
         LR    @08,ICTR                                            0932
         BCTR  @08,0                                               0932
         ST    @08,VALEND                                          0932
*                     CYCLE=CON0;                                  0933
         SLR   CYCLE,CYCLE                                         0933
*                     ICTR=ICTR+CON1;                              0934
         AL    ICTR,@CF00035                                       0934
*                     CALL SKIPSEP; /* FIND END OF VALUE (END PAREN) */
         BAL   @14,SKIPSEP                                         0935
*                     IF ICTR<=LINELNG THEN/* IF CLOSING PAREN NOT   */
         C     ICTR,LINELNG                                        0936
         BH    @RF00936                                            0936
*                       DO;                                        0937
*                         IF RECORD(ICTR)^=RTPAREN THEN/* FOUND THEN
*                                      IT                            */
         L     @08,ECDAIREC(,ECDAPTR)                              0938
         LR    @01,@08                                             0938
         ALR   @01,ICTR                                            0938
         CLI   RECORD-1(@01),C')'                                  0938
         BE    @RF00938                                            0938
*                           DO;     /* IS AN ERROR                   */
*                             EXMSGID=M508;                        0940
         MVC   EXMSGID(4),@CC01387                                 0940
*                             MVAR(1)=PARMADR;                     0941
         L     @15,PARMADR                                         0941
         ST    @15,MVAR                                            0941
*                             MVARLEN(1)=ADDR(RECORD(ICTR))-PARMADR+
*                                 CON1;                            0942
         LA    @08,RECORD-1(ICTR,@08)                              0942
         SLR   @08,@15                                             0942
         AL    @08,@CF00035                                        0942
         STC   @08,MVARLEN                                         0942
*                             NOTEXEC=YES;                         0943
         OI    NOTEXEC(ECDAPTR),B'01000000'                        0943
*                             CALL MSGRTN;                         0944
         BAL   @14,MSGRTN                                          0944
*                           END;                                   0945
*                       END;                                       0946
@RF00938 DS    0H                                                  0947
*                   END;                                           0947
@RF00936 DS    0H                                                  0948
*               END;                                               0948
@RC00920 DS    0H                                                  0949
*           END;                    /* IF WE DID NOT FIND END OF THE */
@RF00918 AL    ICTR,@CF00035                                       0949
@DE00917 C     ICTR,LINELNG                                        0949
         BNH   @DL00917                                            0949
@DC00917 DS    0H                                                  0950
*           IF CYCLE=CON1 THEN      /* VALUE THEN ASSUME END AT      */
         C     CYCLE,@CF00035                                      0950
         BNE   @RF00950                                            0950
*             DO;                   /* RECORD END                    */
*               EXMSGID=M527;                                      0952
         MVC   EXMSGID(4),@CC01277                                 0952
*               MVAR(1)=PARMADR;                                   0953
         L     @15,PARMADR                                         0953
         ST    @15,MVAR                                            0953
*               MVARLEN(1)=ADDR(RECORD(ICTR))-PARMADR;             0954
         L     @01,ECDAIREC(,ECDAPTR)                              0954
         LA    @14,RECORD-1(ICTR,@01)                              0954
         SLR   @14,@15                                             0954
         STC   @14,MVARLEN                                         0954
*               CALL MSGRTN;                                       0955
         BAL   @14,MSGRTN                                          0955
*               VALEND=ICTR-CON1;                                  0956
         LR    @15,ICTR                                            0956
         BCTR  @15,0                                               0956
         ST    @15,VALEND                                          0956
*             END;                  /* IF THE VALUE WAS A NULL QUOTED*/
*           IF VALEND<VALSTR THEN   /* STRING THEN MAKE IT LOOK LIKE */
@RF00950 L     @15,VALEND                                          0958
         C     @15,VALSTR                                          0958
         BNL   @RF00958                                            0958
*             DO;                   /* WE FOUND NOTHING              */
*               VALEND=CON0;                                       0960
         SLR   @15,@15                                             0960
         ST    @15,VALEND                                          0960
*               VALSTR=CON0;                                       0961
         ST    @15,VALSTR                                          0961
*             END;                                                 0962
*         END;                                                     0963
*                                                                  0963
*       /*************************************************************/
*       /*                                                           */
*       /* CHARACTER STRING VALUE PROCESSING                         */
*       /*                                                           */
*       /*************************************************************/
*                                                                  0964
*       ELSE                                                       0964
*         DO;                                                      0964
         B     @RC00912                                            0964
@RF00912 DS    0H                                                  0965
*           VALSTR=ICTR;            /* SAVE VALUE START              */
         ST    ICTR,VALSTR                                         0965
*           CYCLE=CON1;                                            0966
         LA    CYCLE,1                                             0966
*           DO ICTR=ICTR TO LINELNG WHILE CYCLE=CON1;              0967
         B     @DE00967                                            0967
@DL00967 LA    @08,1                                               0967
         CR    CYCLE,@08                                           0967
         BNE   @DC00967                                            0967
*             IF RECORD(ICTR)=LFPAREN THEN/* IF LEFT PAREN FOUND UP  */
         L     @03,ECDAIREC(,ECDAPTR)                              0968
         ALR   @03,ICTR                                            0968
         CLI   RECORD-1(@03),C'('                                  0968
         BNE   @RF00968                                            0968
*               LFPARCTR=LFPARCTR+CON1;/* COUNT                      */
         ALR   LFPARCTR,@08                                        0969
*             ELSE                                                 0970
*               IF RECORD(ICTR)=RTPAREN THEN/* IF THIS IS A RIGHT    */
         B     @RC00968                                            0970
@RF00968 L     @08,ECDAIREC(,ECDAPTR)                              0970
         ALR   @08,ICTR                                            0970
         CLI   RECORD-1(@08),C')'                                  0970
         BNE   @RF00970                                            0970
*                 DO;               /* PAREN THEN DETERMINE IF WE ARE
*                                      AT END OF THE VALUE           */
*                   LFPARCTR=LFPARCTR-CON1;                        0972
         BCTR  LFPARCTR,0                                          0972
*                   IF LFPARCTR=CON0 THEN                          0973
         LTR   LFPARCTR,LFPARCTR                                   0973
         BNZ   @RF00973                                            0973
*                     DO;                                          0974
*                       VALEND=ICTR-CON1;                          0975
         LR    @08,ICTR                                            0975
         BCTR  @08,0                                               0975
         ST    @08,VALEND                                          0975
*                       CYCLE=CON0;                                0976
         SLR   CYCLE,CYCLE                                         0976
*                     END;                                         0977
*                 END;                                             0978
*               ELSE                /* IF THIS IS A DELIMITER THEN   */
*                 DO;               /* IT IS END OF THE VALUE        */
         B     @RC00970                                            0979
@RF00970 DS    0H                                                  0980
*                   IF RECORD(ICTR)=BLANK×RECORD(ICTR)=COMMA×RECORD(
*                       ICTR)=TAB×(RECORD(ICTR)=SLASH&(ICTR<LINELNG&
*                       RECORD(ICTR:ICTR+CON1)=SLASHAST)) THEN     0980
         L     @08,ECDAIREC(,ECDAPTR)                              0980
         LR    @03,@08                                             0980
         ALR   @03,ICTR                                            0980
         CLI   RECORD-1(@03),C' '                                  0980
         BE    @RT00980                                            0980
         LR    @03,@08                                             0980
         ALR   @03,ICTR                                            0980
         CLI   RECORD-1(@03),C','                                  0980
         BE    @RT00980                                            0980
         LR    @03,@08                                             0980
         ALR   @03,ICTR                                            0980
         CLI   RECORD-1(@03),X'05'                                 0980
         BE    @RT00980                                            0980
         LR    @03,@08                                             0980
         ALR   @03,ICTR                                            0980
         CLI   RECORD-1(@03),C'/'                                  0980
         BNE   @RF00980                                            0980
         C     ICTR,LINELNG                                        0980
         BNL   @RF00980                                            0980
         ALR   @08,ICTR                                            0980
         CLC   RECORD-1(2,@08),@CC01353                            0980
         BNE   @RF00980                                            0980
@RT00980 DS    0H                                                  0981
*                     DO;                                          0981
*                       CYCLE=CON0;                                0982
         SLR   CYCLE,CYCLE                                         0982
*                       VALEND=ICTR-CON1;                          0983
         LR    @08,ICTR                                            0983
         BCTR  @08,0                                               0983
         ST    @08,VALEND                                          0983
*                       CALL SKIPSEP;                              0984
         BAL   @14,SKIPSEP                                         0984
*                       IF ICTR<=LINELNG THEN                      0985
         C     ICTR,LINELNG                                        0985
         BH    @RF00985                                            0985
*                         DO;       /* IF NO ENDING PAREN COULD BE   */
*                           IF RECORD(ICTR)^=RTPAREN THEN/* THEN   0987
*                                      NOTIFY                        */
         L     @08,ECDAIREC(,ECDAPTR)                              0987
         LR    @03,@08                                             0987
         ALR   @03,ICTR                                            0987
         CLI   RECORD-1(@03),C')'                                  0987
         BE    @RF00987                                            0987
*                             DO;   /* USER AND RETURN TO SYNTAX ANY */
*                               EXMSGID=M508;/* REMAINING PARMS      */
         MVC   EXMSGID(4),@CC01387                                 0989
*                               MVAR(1)=PARMADR;                   0990
         L     @03,PARMADR                                         0990
         ST    @03,MVAR                                            0990
*                               MVARLEN(1)=ADDR(RECORD(ICTR))-PARMADR+
*                                   CON1;                          0991
         LA    @08,RECORD-1(ICTR,@08)                              0991
         SLR   @08,@03                                             0991
         AL    @08,@CF00035                                        0991
         STC   @08,MVARLEN                                         0991
*                               NOTEXEC=YES;                       0992
         OI    NOTEXEC(ECDAPTR),B'01000000'                        0992
*                               CALL MSGRTN;                       0993
         BAL   @14,MSGRTN                                          0993
*                             END;                                 0994
*                         END;                                     0995
@RF00987 DS    0H                                                  0996
*                     END;                                         0996
@RF00985 DS    0H                                                  0997
*                 END;                                             0997
@RF00980 DS    0H                                                  0998
*           END;                    /* IF WE DID NOT FIND END OF     */
@RC00970 DS    0H                                                  0998
@RC00968 AL    ICTR,@CF00035                                       0998
@DE00967 C     ICTR,LINELNG                                        0998
         BNH   @DL00967                                            0998
@DC00967 DS    0H                                                  0999
*           IF CYCLE=CON1 THEN      /* VALUE THEN ASSUME END AT END  */
         C     CYCLE,@CF00035                                      0999
         BNE   @RF00999                                            0999
*             VALEND=ICTR-CON1;     /* OF RECORD                     */
         LR    @15,ICTR                                            1000
         BCTR  @15,0                                               1000
         ST    @15,VALEND                                          1000
*         END;                                                     1001
*     END;                                                         1002
*   END;                                                           1003
*                                                                  1003
@EL00008 DS    0H                                                  1003
@EF00008 DS    0H                                                  1003
@ER00008 LM    @14,@05,@SA00008                                    1003
         LM    @07,@12,@SA00008+32                                 1003
         BR    @14                                                 1003
*   /*****************************************************************/
*   /*                                                               */
*   /* END OF VALUE CHECK PROCEDURE                                  */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1004
*                                                                  1004
*   /*****************************************************************/
*   /*                                                               */
*   /* MSGRTN - THE MESSAGE ROUTINE BUILDS THE IKJEFF02 PARAMETER    */
*   /* LIST AND THEN INVOKES IKJEFF02 TO ISSUE A MESSAGE             */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  1004
*MSGRTN:                                                           1004
*   PROC OPTIONS(SAVEAREA);                                        1004
MSGRTN   STM   @14,@12,12(@13)                                     1004
         ST    @13,@SA00009+4                                      1004
         LA    @14,@SA00009                                        1004
         ST    @14,8(,@13)                                         1004
         LR    @13,@14                                             1004
*   MSGTABLE=MSGTABLE&&MSGTABLE;    /* INITIALIZE IKJEFF02 PARMLIST  */
         L     @06,ERRPTR                                          1005
         XC    MSGTABLE(52,@06),MSGTABLE(@06)                      1005
*   LISTPTR=ADDR(MSGCSECT);         /* START OF MESSAGE PARMS        */
         LA    @15,MSGCSECT(,@06)                                  1006
         ST    @15,LISTPTR(,@06)                                   1006
*   TMCTPTR=CPPLPTR;                /* ADDRESS OF THE CPPL           */
         L     @15,CPPLPTR(,ECDAPTR)                               1007
         ST    @15,TMCTPTR(,@06)                                   1007
*   ECBPTR=ADDR(ECB);               /* DUMMY ECB ADDRESS             */
         LA    @15,ECB                                             1008
         ST    @15,ECBPTR(,@06)                                    1008
*   MSGCSECT=ADDR(IKJCT435);        /* IKJCT435 IS MESSAGE CSECT     */
         L     @15,@CV01232                                        1009
         ST    @15,MSGCSECT(,@06)                                  1009
*   MTPUTLSW=YES;                   /* PUTLINE MESSAGE REUESTED      */
*   MTHEXSW=YES;                    /* PRINT RETURN CODES IN HEX     */
         OI    MTPUTLSW(@06),B'01010000'                           1011
*   MSGID=EXMSGID;                  /* ID OF THE MESSAGE TO BE ISSUED*/
         MVC   MSGID(4,@06),EXMSGID                                1012
*   DO MCTR=1 TO DIM(MVAR);         /* INITIALIZE INSERTION VARIABLES*/
         LA    MCTR,1                                              1013
@DL01013 DS    0H                                                  1014
*     MTINSRT(MCTR)=MVAR(MCTR);     /* MVAR HAS BEEN PREVIOUSLY SET  */
         LR    @06,MCTR                                            1014
         SLA   @06,2                                               1014
         L     @03,MVAR-4(@06)                                     1014
         L     @01,ERRPTR                                          1014
         ST    @03,MTINSRT-4(@06,@01)                              1014
*   END;                                                           1015
         AL    MCTR,@CF00035                                       1015
         C     MCTR,@CF00064                                       1015
         BNH   @DL01013                                            1015
*   RFY                                                            1016
*     R1 RSTD;                                                     1016
*   R1=ERRPTR;                      /* ADDRESS OF MSGTABLE           */
         L     R1,ERRPTR                                           1017
*   RFY                                                            1018
*     R1 UNRSTD;                                                   1018
*   DO;                             /* LINK EP(IKJEFF02)             */
*     I00601='00'X;                 /* EP/DE FLAG                    */
         MVI   I00601,X'00'                                        1020
*     I00602=ADDR(IKJEFF02);        /* ADDR OF EP/DE                 */
         LA    @06,@CC01290                                        1021
         STCM  @06,7,I00602                                        1021
*     I00604=0;                     /* DCB PTR                       */
         SLR   @06,@06                                             1022
         STCM  @06,7,I00604                                        1022
*     I00603='00'X;                 /* ERRET FLAG                    */
         MVI   I00603,X'00'                                        1023
*     RESPECIFY                                                    1024
*      (GPR15P) RESTRICTED;                                        1024
*     GPR15P=ADDR(I006);            /* ADDR OF LINK LIST             */
         LA    GPR15P,I006                                         1025
*     SVC(6);                       /* ISSUE LINK SVC                */
         SVC   6                                                   1026
*     RESPECIFY                                                    1027
*      (GPR15P) UNRESTRICTED;                                      1027
*   END;                            /* LINK EP(IKJEFF02) USE IKJEFF02
*                                      TO ISSUE MESSAGE              */
*   END MSGRTN;                     /* END OF MSGRTN                 */
@EL00009 L     @13,4(,@13)                                         1029
@EF00009 DS    0H                                                  1029
@ER00009 LM    @14,@12,12(@13)                                     1029
         BR    @14                                                 1029
*   DCL                                                            1030
*     FEPATCH FIXED(31) STATIC;                                    1030
*   GEN DATA DEFS(FEPATCH);                                        1031
*   DECLARE                         /* GENERAL PURPOSE REGISTERS     */
*     GPR15F FIXED(31) REG(15),                                    1032
*     GPR00P PTR(31) REG(0),                                       1032
*     GPR01P PTR(31) REG(1),                                       1032
*     GPR02P PTR(31) REG(2),                                       1032
*     GPR03P PTR(31) REG(3),                                       1032
*     GPR04P PTR(31) REG(4),                                       1032
*     GPR05P PTR(31) REG(5),                                       1032
*     GPR06P PTR(31) REG(6),                                       1032
*     GPR07P PTR(31) REG(7),                                       1032
*     GPR08P PTR(31) REG(8),                                       1032
*     GPR09P PTR(31) REG(9),                                       1032
*     GPR14P PTR(31) REG(14),                                      1032
*     GPR15P PTR(31) REG(15);                                      1032
*   DCL                                                            1033
*     1 I004 DEF(ILIST) BDY(WORD),  /* LIST FOR GETMAIN              */
*      2 I00401 PTR(31),            /* LENGTH                        */
*      2 I00402 CHAR(1),            /* HIARCHY                       */
*      2 I00403 PTR(24),            /* ADDR OF ADDR LIST             */
*      2 I00404 CHAR(1),            /* TYPE OF REQUEST               */
*      2 I00405 PTR(8);             /* SUBPOOL VALUE                 */
*   DCL                                                            1034
*     1 I005 DEF(ILIST) BDY(WORD),  /* LIST FOR FREEMAIN             */
*       3 I00501 PTR(8),            /* RESERVED                      */
*       3 I00502 PTR(24),           /* LENGTH                        */
*       3 I00503 PTR(8),            /* RESERVED                      */
*       3 I00504 PTR(24),           /* ADDR OF ADDR LIST             */
*       3 I00505 BIT(8),            /* TYPE OF FREEMAIN              */
*       3 I00506 PTR(8);            /* SUBPOOL VALUE                 */
*   DCL                                                            1035
*     1 I006 DEF(ILIST),            /* DEFINE LIST                   */
*      2 I00601 CHAR(1),            /* EP/DE FLAG                    */
*      2 I00602 PTR(24),            /* EP/DE PTR                     */
*      2 I00603 CHAR(1),            /* ERRET FLAG                    */
*      2 I00604 PTR(24),            /* DCB PTR                       */
*      2 I00605 PTR(31);            /* ERRET PTR                     */
*   DCL                                                            1036
*     1 I040 DEF(ILIST) BDY(WORD),  /* LIST FOR EXTRACT              */
*      2 I04001 PTR(31),            /* ADDRESS OF USERS ANSWER AREA  */
*      2 I04002 PTR(31),            /* ADDRESS OF TCB                */
*      2 I04003 BIT(16),            /* FLAGS INDICATING TCB FIELDS TO
*                                      EXTRACT                       */
*      2 I04004 CHAR(2);            /* RESERVED SPACE                */
*   DECLARE                                                        1037
*     ILIST CHAR(12) BDY(DWORD);    /* STANDARD LIST                 */
*   DECLARE                         /* COMMON VARIABLES              */
*     I256C CHAR(256) BASED,                                       1038
*     I031F FIXED(31) BASED,                                       1038
*     I031P PTR(31) BASED,                                         1038
*     I015F FIXED(15) BASED,                                       1038
*     I015P PTR(15) BASED,                                         1038
*     I008P PTR(8) BASED,                                          1038
*     I001C CHAR(1) BASED;                                         1038
*   END                                                            1039
*                                                                  1039
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */
*/*%INCLUDE SYSLIB  (IKJCPPL )                                       */
*/*%INCLUDE SYSLIB  (IKJEXEC )                                       */
*/*%INCLUDE SYSLIB  (IKJLSD  )                                       */
*/*%INCLUDE SYSLIB  (IKJEFFMT)                                       */
*/*%INCLUDE SYSLIB  (IKJEFFGF)                                       */
*/*%INCLUDE SYSLIB  (IKJECT  )                                       */
*/*%INCLUDE SYSLIB  (IKJPSCB )                                       */
*/*%INCLUDE SYSLIB  (IKJPPL  )                                       */
*/*%INCLUDE SYSLIB  (CVT     )                                       */
*                                                                  1039
*       ;                                                          1039
@EL00001 L     @13,4(,@13)                                         1039
@EF00001 L     @00,@SIZDATD                                        1039
         LR    @01,@10                                             1039
         FREEMAIN R,LV=(0),A=(1)
@ER00001 LM    @14,@12,12(@13)                                     1039
         BR    @14                                                 1039
@DATA    DS    0H
@CH00187 DC    H'3'
@CH01531 DC    H'13'
@CH00309 DC    H'21'
@CH01405 DC    H'56'
@CH01533 DC    H'69'
@SM01540 MVC   SNTDATA(0,SNTELPTR),NULLVDAT(@01)
@SM01544 MVC   SVTDATA(0,SVTELPTR),PSCBUSER(@06)
@SM01546 MVC   SVTDATA(0,SVTELPTR),TIOTPROC(@01)
@SM01548 MVC   SVTDATA(0,SVTELPTR),PROCNAME(@01)
@SC01550 CLC   RECORD-1(0,@03),@CC01359
@SM01557 MVC   IDPRNME(0,PCLCUR),SNTDATA(SNTELPTR)
@SM01559 MVC   NADAT(0,PCLCUR),SNTDATA(SNTELPTR)
@SM01561 MVC   VIDNAME(0,SBFCUR),SNTDATA(SNTELPTR)
@SC01563 CLC   SNTDATA(0,UPTPTR1),PARMDAT(@03)
@SM01567 MVC   SNTDATA(0,SNTELPTR),PARMDAT(@01)
@DATD    DSECT
         DS    0F
@SA00001 DS    18F
@PC00001 DS    1F
@SA00009 DS    18F
@SA00007 DS    14F
@SA00006 DS    14F
@SA00005 DS    14F
@SA00008 DS    14F
@TF00001 DS    F
IKJCT431 CSECT
         DS    0F
@CF00035 DC    F'1'
@CH00035 EQU   @CF00035+2
@CF00064 DC    F'2'
@CH00064 EQU   @CF00064+2
@CF00062 DC    F'4'
@CH00062 EQU   @CF00062+2
@CF00139 DC    F'7'
@CF00078 DC    F'8'
@CF01264 DC    F'9'
@CF01109 DC    F'10'
@CF01262 DC    F'11'
@CH01262 EQU   @CF01262+2
@CF01091 DC    F'12'
@CF00059 DC    F'15'
@CF01028 DC    F'16'
@CF01397 DC    F'19'
@CF00040 DC    F'31'
@CF01251 DC    F'127'
@CF01247 DC    F'223'
@CF01249 DC    F'253'
@CF01269 DC    F'300'
@CF01243 DC    F'4096'
@DATD    DSECT
         DS    0D
SNTABPTR DS    A
SVTABPTR DS    A
ERRPTR   DS    A
TIOTPTR  DS    A
POSNUM   DS    F
KEYNUM   DS    F
KEYWNUM  DS    F
SBFBASE  DS    A
PCLAMT   DS    F
ECB      DS    F
VLSTANS  DS    A
JCTR     DS    F
SAVSNTAB DS    A
CT431RET DS    F
VLPTR    DS    A
VALEND   DS    F
KEYAR    DS    F
USNTABST DS    A
LINELNG  DS    F
VALSTR   DS    F
FREEADR  DS    AL4
         ORG   FREEADR
GETADR   DS    AL4
         ORG   FREEADR+4
FREEAMT  DS    FL4
         ORG   FREEAMT
GETAMT   DS    FL4
         ORG   FREEAMT+4
ERRPARMS DS    CL52
SERVBLK  DS    CL28
EXMSGID  DS    CL4
PACKLOC  DS    CL8
         DS    CL4
CVERTLOC DS    CL8
FLGCT431 DS    BL1
         ORG   FLGCT431
STABERR  DS    BL1
POSPCERR EQU   FLGCT431+0
POSERR   EQU   FLGCT431+0
KEYERR   EQU   FLGCT431+0
KEYWORD  EQU   FLGCT431+0
VALIDERR EQU   FLGCT431+0
COPYVLST EQU   FLGCT431+0
         ORG   FLGCT431+1
         DS    CL3
NTUPTPRM DS    CL20
         ORG   NTUPTPRM
PARMADR  DS    AL4
PARMLNG  DS    FL4
PARMTYPE DS    FL2
PARMOP   DS    FL2
VALADR   DS    AL4
VALLNG   DS    FL4
         ORG   NTUPTPRM+20
ILIST    DS    CL12
MVAR     DS    AL4
         ORG   MVAR+0
MVARLEN  DS    AL1
         ORG   MVARLEN+0
MVARHEX  DS    BL1
         ORG   MVAR+8
IKJCT431 CSECT
         DS    0F
@SIZDATD DC    AL1(1)
         DC    AL3(@ENDDATD-@DATD)
@CV01232 DC    V(IKJCT435)
         DS    0D
@CC01285 DC    C'VALUE FOR KEYWORD    '
@CC01304 DC    C'POSITIONAL'
@CC01290 DC    C'IKJEFF02'
@CC01292 DC    C'IKJEFF19'
@CC01345 DC    C'DATATYPE'
@CC01300 DC    C'SYSTIME'
@CC01302 DC    C'SYSPROC'
@CC01307 DC    C'KEYWORD'
@CC01309 DC    C'SYSSCAN'
@CC01321 DC    C'SYSDATE'
@CC01323 DC    C'SYSNEST'
@CC01329 DC    C'SYSPREF'
@CC01331 DC    C'SYSDVAL'
@CC01333 DC    C'SYSPCMD'
@CC01335 DC    C'SYSSCMD'
@CC01337 DC    C'SYSICMD'
@CC01288 DC    C'STMT 1'
@CC01311 DC    C'LASTCC'
@CC01315 DC    C'SYSUID'
@CC01319 DC    C'SUBSTR'
@CC01341 DC    C'SYSDLM'
@CC01343 DC    C'LENGTH'
@CC01313 DC    C'MAXCC'
@CC01271 DC    C'M511'
@CC01273 DC    C'M507'
@CC01275 DC    C'M530'
@CC01277 DC    C'M527'
@CC01279 DC    C'A507'
@CC01281 DC    C'A529'
@CC01283 DC    C'B529'
@CC01339 DC    C'EVAL'
@CC01359 DC    C'PROC'
@CC01369 DC    C'M506'
@CC01387 DC    C'M508'
@CC01391 DC    C'M509'
@CC01317 DC    C'STR'
@CC01325 DC    C'YES'
@CC01327 DC    C'NO'
@CC01349 DC    C'16'
@CC01353 DC    C'/*'
@CC01355 DC    C'*/'
@CB01458 DC    B'0000001000000000'
IDMOD    DS    CL56
         ORG   IDMOD
@NM00045 DC    X'9000'
@NM00046 DC    FL2'56'
@NM00047 DC    FL4'0'
@NM00048 DC    AL1(0)
@NM00049 DC    FL2'25'
@NM00050 DC    X'0012'
@NM00051 DC    CL21'POSITIONAL PARAMETER '
@NM00052 DC    AL1(20)
@NM00053 DC    CL21'POSITIONAL PARAMETER '
         ORG   IDMOD+56
KWMOD    DS    CL11
         ORG   KWMOD
@NM00055 DC    X'4000'
@NM00056 DC    FL2'6'
@NM00057 DS    FL2
@NM00058 DC    X'6000'
@NM00059 DS    CL3
         ORG   KWMOD+11
SUBMOD   DC    X'000000'
ENDMOD   DC    X'00'
NULLVARX DS    AL4
         ORG   NULLVARX+0
NULLENX  DC    AL1(7)
NULLADRX DC    AL3(@CC01300)
         ORG   NULLVARX+4
         ORG   NULLVARX+4
         DC    AL1(7)
         DC    AL3(@CC01333)
         ORG   NULLVARX+8
         ORG   NULLVARX+8
         DC    AL1(7)
         DC    AL3(@CC01335)
         ORG   NULLVARX+12
         ORG   NULLVARX+12
         DC    AL1(7)
         DC    AL3(@CC01321)
         ORG   NULLVARX+16
         ORG   NULLVARX+16
         DC    AL1(7)
         DC    AL3(@CC01329)
         ORG   NULLVARX+20
         ORG   NULLVARX+20
         DC    AL1(6)
         DC    AL3(@CC01343)
         ORG   NULLVARX+24
         ORG   NULLVARX+24
         DC    AL1(8)
         DC    AL3(@CC01345)
         ORG   NULLVARX+28
         ORG   NULLVARX+28
         DC    AL1(3)
         DC    AL3(@CC01317)
         ORG   NULLVARX+32
         ORG   NULLVARX+32
         DC    AL1(6)
         DC    AL3(@CC01319)
         ORG   NULLVARX+36
         ORG   NULLVARX+36
         DC    AL1(4)
         DC    AL3(@CC01339)
         ORG   NULLVARX+40
         ORG   NULLVARX+40
         DC    AL1(7)
         DC    AL3(@CC01337)
         ORG   NULLVARX+44
         ORG   NULLVARX+44
         DC    AL1(6)
         DC    AL3(@CC01341)
         ORG   NULLVARX+48
         ORG   NULLVARX+48
         DC    AL1(6)
         DC    AL3(@CC01315)
         ORG   NULLVARX+52
         ORG   NULLVARX+52
         DC    AL1(7)
         DC    AL3(@CC01302)
         ORG   NULLVARX+56
         ORG   NULLVARX+56
         DC    AL1(7)
         DC    AL3(@CC01323)
         ORG   NULLVARX+60
         ORG   NULLVARX+60
         DC    AL1(7)
         DC    AL3(@CC01331)
         ORG   NULLVARX+64
         ORG   NULLVARX+64
         DC    AL1(6)
         DC    AL3(@CC01311)
         ORG   NULLVARX+68
         ORG   NULLVARX+68
         DC    AL1(5)
         DC    AL3(@CC01313)
         ORG   NULLVARX+72
         ORG   NULLVARX+72
         DC    AL1(7)
         DC    AL3(@CC01309)
         ORG   NULLVARX+76
IKJCT431 CSECT
         DS   0H
FEPATCH DC ((@DATA-@PSTART)/20)X'00'
@DATD    DSECT
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA
@ENDDATD EQU   *
IKJCT431 CSECT
@00      EQU   00                      EQUATES FOR REGISTERS 0-15
@01      EQU   01
@02      EQU   02
@03      EQU   03
@04      EQU   04
@05      EQU   05
@06      EQU   06
@07      EQU   07
@08      EQU   08
@09      EQU   09
@10      EQU   10
@11      EQU   11
@12      EQU   12
@13      EQU   13
@14      EQU   14
@15      EQU   15
UPTPTR1  EQU   @02
TOBEADD  EQU   @09
SVTELPTR EQU   @09
KEYWAR   EQU   @02
POSAR    EQU   @08
NEWVELEM EQU   @03
LASTELMT EQU   @06
LFPARCTR EQU   @02
SCTR     EQU   @02
PCTR     EQU   @05
MCTR     EQU   @02
ICTR     EQU   @06
CYCLE    EQU   @09
KEYWCHAR EQU   @05
KEYCHAR  EQU   @04
PCLBASE  EQU   @09
POSCHAR  EQU   @03
PDLCUR   EQU   @03
SBFCUR   EQU   @04
PCLCUR   EQU   @02
PPLPTR   EQU   @08
SNTELPTR EQU   @08
ECDAPTR  EQU   @07
R11      EQU   @11
R12      EQU   @12
R1       EQU   @01
R2       EQU   @02
R3       EQU   @03
R4       EQU   @04
R5       EQU   @05
R15      EQU   @15
GPR01P   EQU   @01
GPR15F   EQU   @15
GPR15P   EQU   @15
GPR00P   EQU   @00
GPR02P   EQU   @02
GPR03P   EQU   @03
GPR04P   EQU   @04
GPR05P   EQU   @05
GPR06P   EQU   @06
GPR07P   EQU   @07
GPR08P   EQU   @08
GPR09P   EQU   @09
GPR14P   EQU   @14
CVTPTR   EQU   16
CPPL     EQU   0
CPPLCBUF EQU   CPPL
CPPLUPT  EQU   CPPL+4
CPPLPSCB EQU   CPPL+8
CPPLECT  EQU   CPPL+12
ECDA     EQU   0
ECDACPPL EQU   ECDA
ECDAGADD EQU   ECDA+4
ECDAEANS EQU   ECDA+8
ECDALSD  EQU   ECDA+12
ECDAIREC EQU   ECDA+16
ECDACBLK EQU   ECDA+20
ECDACPRE EQU   ECDA+24
ECDACNXT EQU   ECDA+28
ECDALNEL EQU   ECDA+40
ECDAFLAG EQU   ECDA+56
IMPLICIT EQU   ECDAFLAG
NOTEXEC  EQU   ECDAFLAG
SP78CORE EQU   ECDAFLAG
SP78BLK  EQU   ECDAFLAG
NESTED   EQU   ECDAFLAG
ECDAGDAT EQU   ECDA+64
ECDAINME EQU   ECDA+72
ECDAILNG EQU   ECDAINME
EXECDATA EQU   0
SNTABFST EQU   EXECDATA
SVTABFST EQU   EXECDATA+4
GEXECDAT EQU   EXECDATA+8
@NM00004 EQU   EXECDATA+16
EXDATFLG EQU   EXECDATA+32
@NM00005 EQU   EXDATFLG
COMPROC  EQU   0
COMPRPTR EQU   COMPROC
COMPRID  EQU   COMPRPTR
COMPRNXT EQU   COMPRPTR+1
COMPRLNG EQU   COMPROC+4
COMPRUSE EQU   COMPROC+8
SNTAB    EQU   0
SNTABNXT EQU   SNTAB
SNTABLNG EQU   SNTAB+4
SNTABUSE EQU   SNTAB+8
SNTELFST EQU   SNTAB+12
SNTELEM  EQU   0
SNTVLPTR EQU   SNTELEM
SNTFLAGS EQU   SNTELEM+4
SNTPOSIT EQU   SNTFLAGS
SNTKEY   EQU   SNTFLAGS
SNTKEYW  EQU   SNTFLAGS
SNTNAUTH EQU   SNTFLAGS
SNTEVAL  EQU   SNTFLAGS
SNTLAST  EQU   SNTFLAGS
SNTLNG   EQU   SNTELEM+6
SNTDATA  EQU   SNTELEM+8
SVTAB    EQU   0
SVTABNXT EQU   SVTAB
SVTABLNG EQU   SVTAB+4
SVTABUSE EQU   SVTAB+8
SVTABFRE EQU   SVTAB+12
SVTELFST EQU   SVTAB+16
SVTELEM  EQU   0
SVTLNG   EQU   SVTELEM
SVTORIG  EQU   SVTELEM+2
SVTDATA  EQU   SVTELEM+4
LSD      EQU   0
LSDADATA EQU   LSD
LSDRCLEN EQU   LSD+4
LSDANEXT EQU   LSD+8
LSDEXEC  EQU   LSD+12
MSGTABLE EQU   0
LISTPTR  EQU   MSGTABLE
TMCTPTR  EQU   MSGTABLE+4
ECBPTR   EQU   MSGTABLE+8
@NM00008 EQU   MSGTABLE+12
MSGCSECT EQU   MSGTABLE+16
SW       EQU   MSGTABLE+20
MTPUTLSW EQU   SW
MTHEXSW  EQU   SW
RETMSG   EQU   MSGTABLE+21
SW2      EQU   MSGTABLE+24
MSGID    EQU   MSGTABLE+40
MTINSRTS EQU   MSGTABLE+44
MTINSRT  EQU   MTINSRTS
MTLEN    EQU   MTINSRT
RET      EQU   0
GFPARMS  EQU   0
GFRCODE  EQU   GFPARMS+4
GF02PTR  EQU   GFPARMS+8
GFCALLID EQU   GFPARMS+12
GFBITS   EQU   GFPARMS+14
GFCPPLP  EQU   GFPARMS+16
ECT      EQU   0
ECTIOWA  EQU   ECT+4
ECTSWS   EQU   ECT+28
ECTNOPD  EQU   ECTSWS
ECTSWS2  EQU   ECT+40
ECTSWS21 EQU   ECTSWS2
PSCB     EQU   0
PSCBUSER EQU   PSCB
PSCBUSRL EQU   PSCB+7
PSCBATR1 EQU   PSCB+16
PPL      EQU   0
PPLUPT   EQU   PPL
PPLECT   EQU   PPL+4
PPLECB   EQU   PPL+8
PPLPCL   EQU   PPL+12
PPLANS   EQU   PPL+16
PPLCBUF  EQU   PPL+20
CVTMAP   EQU   0
CVTDAR   EQU   CVTMAP+72
CVTFLGS1 EQU   CVTDAR
CVTDCB   EQU   CVTMAP+116
CVTIERLC EQU   CVTMAP+144
CVTOPTA  EQU   CVTMAP+182
CVTOPTB  EQU   CVTMAP+183
CVTGTF   EQU   CVTMAP+236
CVTGTFST EQU   CVTGTF
CVTGTFS  EQU   CVTGTFST
CVTSTATE EQU   CVTGTFST
CVTTMODE EQU   CVTGTFST
CVTFORM  EQU   CVTGTFST
CVTAQAVT EQU   CVTMAP+240
CVTTCMFG EQU   CVTAQAVT
CVTVOLM2 EQU   CVTMAP+244
CVTTATA  EQU   CVTVOLM2
CVTTSKS  EQU   CVTTATA
CVTVOLF2 EQU   CVTTSKS
CVTTAT   EQU   CVTTATA+1
CVTATER  EQU   CVTMAP+248
CVTEXT1  EQU   CVTMAP+252
CVTPURG  EQU   CVTMAP+260
CVTQMSG  EQU   CVTMAP+268
CVTDMSR  EQU   CVTMAP+272
CVTRSV37 EQU   CVTDMSR
CVTDMSRF EQU   CVTRSV37
CVTERPV  EQU   CVTMAP+316
CVTINTLA EQU   CVTMAP+320
CVTAPF   EQU   CVTMAP+324
CVTEXT2  EQU   CVTMAP+328
CVTHJES  EQU   CVTMAP+332
CVTPGSIA EQU   CVTMAP+348
CVTA1F1  EQU   CVTMAP+356
CVTSYSK  EQU   CVTMAP+357
CVTVOLM1 EQU   CVTMAP+380
CVTVOLF1 EQU   CVTVOLM1
CVTATMCT EQU   CVTMAP+388
CVTXTNT1 EQU   0
CVTXTNT2 EQU   0
CVTDSSV  EQU   CVTXTNT2
CVTFLGBT EQU   CVTXTNT2+5
CVTQID   EQU   CVTXTNT2+24
CVTRV400 EQU   CVTXTNT2+52
CVTRV409 EQU   CVTXTNT2+53
CVTATCVT EQU   CVTXTNT2+64
CVTRV429 EQU   CVTXTNT2+84
CVTRV438 EQU   CVTXTNT2+85
CVTRV457 EQU   CVTXTNT2+112
CVTRV466 EQU   CVTXTNT2+113
CVTFIX   EQU   0
CVTRELNO EQU   CVTFIX+252
IOSRL    EQU   0
IOSTELM  EQU   IOSRL
INSTACK  EQU   0
INSCODE  EQU   INSTACK
NULLVDAT EQU   0
TIOT     EQU   0
TIOTPROC EQU   TIOT+8
PROCNAME EQU   0
IREC     EQU   0
RECLNG   EQU   IREC
RECORD   EQU   IREC+4
PARMDAT  EQU   0
PCELMT   EQU   0
SBFELMT  EQU   0
IDENTPDE EQU   0
IDPDEPTR EQU   IDENTPDE
IDPDELNG EQU   IDENTPDE+4
IDPDEFLG EQU   IDENTPDE+6
KEYPDE   EQU   0
KEYPDEP  EQU   KEYPDE
PDLHEAD  EQU   0
VIDENPDE EQU   0
VIPDEPTR EQU   VIDENPDE
VIPDELNG EQU   VIDENPDE+4
VIPDEFLG EQU   VIDENPDE+6
IDENTMAP EQU   0
IDLNG    EQU   IDENTMAP+2
IDPDLOFF EQU   IDENTMAP+4
IDCHAR   EQU   IDENTMAP+6
IDMODTYP EQU   IDENTMAP+13
IDPRMLNG EQU   IDENTMAP+34
IDPRNME  EQU   IDENTMAP+56
KEYWDMAP EQU   0
KEYLNG   EQU   KEYWDMAP+2
KWPDLOFF EQU   KEYWDMAP+4
KWSUBFLD EQU   KEYWDMAP+6
SBFOFF   EQU   0
SUBFLD   EQU   0
SUBNXSUB EQU   SUBFLD+1
PCEHEAD  EQU   0
PCLLNG   EQU   PCEHEAD
PDLLNG   EQU   PCEHEAD+2
PCLKEYOF EQU   PCEHEAD+4
PCEEND   EQU   0
EXPAROUT EQU   0
DSNFLG   EQU   EXPAROUT+14
MEMFLG   EQU   EXPAROUT+22
PSWDFLG  EQU   EXPAROUT+30
VLSTPTR  EQU   EXPAROUT+32
VLSTLNG  EQU   EXPAROUT+36
VLSTFLG  EQU   EXPAROUT+38
VLST     EQU   VLSTFLG
CMDBUFF  EQU   0
CBUFLNG  EQU   CMDBUFF
CBUFOFF  EQU   CMDBUFF+2
CBUFTEXT EQU   CMDBUFF+4
NEWVLST  EQU   0
NVLSTLNG EQU   NEWVLST
NVLSTOFF EQU   NEWVLST+2
VIDMAP   EQU   0
VIDPRINF EQU   VIDMAP+35
VIDNAME  EQU   VIDMAP+53
I001C    EQU   0
I008P    EQU   0
I015F    EQU   0
I015P    EQU   0
I031F    EQU   0
I031P    EQU   0
I256C    EQU   0
MSGECB   EQU   0
MSGTMCT  EQU   0
VLSTBUF  EQU   0
APARM    EQU   0
CPPLPTR  EQU   ECDACPPL
CVARMAP  EQU   SNTELFST
CICMDVAL EQU   CVARMAP+142
CDLMVAL  EQU   CVARMAP+157
CUIDVAL  EQU   CVARMAP+171
CPROCVAL EQU   CVARMAP+185
CNESTVAL EQU   CVARMAP+200
CLCCVAL  EQU   CVARMAP+230
CMCCVAL  EQU   CVARMAP+244
CSCANVAL EQU   CVARMAP+257
LSDPTR   EQU   ECDALSD
ECTPTR   EQU   CPPLECT
PSCBPTR  EQU   CPPLPSCB
CVTS01   EQU   CVTPGSIA
CVTLPDIA EQU   CVTS01+12
CVTDIRST EQU   CVTLPDIA
CVTSLIDA EQU   CVTS01+24
CVTCTLFG EQU   CVTS01+50
CVTPARS  EQU   CVTS01+176
CVTRV210 EQU   CVTS01+424
CVTRV219 EQU   CVTS01+425
CVTRV228 EQU   CVTS01+426
CVTRV237 EQU   CVTS01+427
CVTMFRTR EQU   CVTS01+452
CVTRV262 EQU   CVTS01+468
CVTRV271 EQU   CVTS01+469
CVTRV280 EQU   CVTS01+470
CVTRV289 EQU   CVTS01+471
CVTGSDA  EQU   CVTS01+600
LSDANXT  EQU   LSDANEXT
LSDBLKID EQU   LSDANXT
LSDADAT  EQU   LSDADATA
LSDADAID EQU   LSDADAT
NAMPCE   EQU   KEYWDMAP+6
NALNG    EQU   NAMPCE+2
NADATLNG EQU   NAMPCE+4
NADAT    EQU   NAMPCE+5
CPBLKPTR EQU   ECDACBLK+1
SNTABBLK EQU   SNTABPTR+1
SVTABBLK EQU   SVTABPTR+1
NULLVAR  EQU   NULLVARX
NULLEN   EQU   NULLVAR
NULLADR  EQU   NULLVAR+1
I004     EQU   ILIST
I00401   EQU   I004
I00403   EQU   I004+5
I00404   EQU   I004+8
I00405   EQU   I004+9
I040     EQU   ILIST
I04001   EQU   I040
I04002   EQU   I040+4
I04003   EQU   I040+8
I006     EQU   ILIST
I00601   EQU   I006
I00602   EQU   I006+1
I00603   EQU   I006+4
I00604   EQU   I006+5
I005     EQU   ILIST
I00502   EQU   I005+1
I00504   EQU   I005+5
I00505   EQU   I005+8
I00506   EQU   I005+9
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS
I00503   EQU   I005+4
I00501   EQU   I005
I00605   EQU   I006+8
I04004   EQU   I040+10
I00402   EQU   I004+4
NAMFLG   EQU   NAMPCE
CVTRV628 EQU   CVTS01+728
CVTRV627 EQU   CVTS01+724
CVTRV626 EQU   CVTS01+720
CVTRV625 EQU   CVTS01+716
CVTRV624 EQU   CVTS01+712
CVTRV623 EQU   CVTS01+708
CVTRV622 EQU   CVTS01+704
CVTRV621 EQU   CVTS01+700
CVTIHASU EQU   CVTS01+696
CVTRV619 EQU   CVTS01+692
CVTRV618 EQU   CVTS01+688
CVTRV617 EQU   CVTS01+684
CVTRV616 EQU   CVTS01+680
CVTRV615 EQU   CVTS01+676
CVTRV614 EQU   CVTS01+672
CVTRV613 EQU   CVTS01+668
CVTTCASP EQU   CVTS01+664
CVT0PT03 EQU   CVTS01+660
CVT0PT0E EQU   CVTS01+656
CVTRV609 EQU   CVTS01+652
CVTCGK   EQU   CVTS01+648
CVTRAC   EQU   CVTS01+644
CVTRV606 EQU   CVTS01+640
CVTRV605 EQU   CVTS01+636
CVTRV604 EQU   CVTS01+632
CVTEFF02 EQU   CVTS01+628
CVTCBBR  EQU   CVTS01+624
CVTSSCR  EQU   CVTS01+620
CVTEVENT EQU   CVTS01+616
CVTCRCA  EQU   CVTS01+612
CVTTPIO  EQU   CVTS01+608
CVTADV   EQU   CVTS01+604
CVTGSDAB EQU   CVTGSDA
CVTQV3   EQU   CVTS01+596
CVTQV2   EQU   CVTS01+592
CVTQV1   EQU   CVTS01+588
CVTRPT   EQU   CVTS01+584
CVTSSRB  EQU   CVTS01+580
CVTCSDRL EQU   CVTS01+576
CVTEXP1  EQU   CVTS01+572
CVTRMPMT EQU   CVTS01+568
CVTRMPTT EQU   CVTS01+564
CVTVPSA  EQU   CVTS01+560
CVTVSTOP EQU   CVTS01+556
CVTGTFR8 EQU   CVTS01+552
CVTQUIT  EQU   CVTS01+548
CVTVACR  EQU   CVTS01+544
CVTWTCB  EQU   CVTS01+540
CVTSTPRS EQU   CVTS01+536
CVT0PT02 EQU   CVTS01+532
CVTDARCM EQU   CVTS01+528
CVTIRECM EQU   CVTS01+524
CVTJRECM EQU   CVTS01+520
CVTVEMS0 EQU   CVTS01+516
CVTSPFRR EQU   CVTS01+512
CVTRLSTG EQU   CVTS01+508
CVT0TC0A EQU   CVTS01+504
CVTGMBR  EQU   CVTS01+500
CVTLFRM  EQU   CVTS01+496
CVTRMBR  EQU   CVTS01+492
CVTVIOP  EQU   CVTS01+488
CVTRV307 EQU   CVTS01+486
CVTRV306 EQU   CVTS01+484
CVTRV305 EQU   CVTS01+482
CVTRV304 EQU   CVTS01+480
CVTRV303 EQU   CVTS01+478
CVTRV302 EQU   CVTS01+476
CVTTRCA  EQU   CVTS01+472
CVTRV297 EQU   CVTRV289
CVTRV296 EQU   CVTRV289
CVTRV295 EQU   CVTRV289
CVTRV294 EQU   CVTRV289
CVTRV293 EQU   CVTRV289
CVTRV292 EQU   CVTRV289
CVTRV291 EQU   CVTRV289
CVTRV290 EQU   CVTRV289
CVTRV288 EQU   CVTRV280
CVTRV287 EQU   CVTRV280
CVTRV286 EQU   CVTRV280
CVTRV285 EQU   CVTRV280
CVTRV284 EQU   CVTRV280
CVTRV283 EQU   CVTRV280
CVTRV282 EQU   CVTRV280
CVTRV281 EQU   CVTRV280
CVTRV279 EQU   CVTRV271
CVTRV278 EQU   CVTRV271
CVTRV277 EQU   CVTRV271
CVTRV276 EQU   CVTRV271
CVTRV275 EQU   CVTRV271
CVTRV274 EQU   CVTRV271
CVTRV273 EQU   CVTRV271
CVTRV272 EQU   CVTRV271
CVTRV270 EQU   CVTRV262
CVTRV269 EQU   CVTRV262
CVTRV268 EQU   CVTRV262
CVTRV267 EQU   CVTRV262
CVTRV266 EQU   CVTRV262
CVTRV265 EQU   CVTRV262
CVTRV264 EQU   CVTRV262
CVTRV263 EQU   CVTRV262
CVTVFP   EQU   CVTS01+464
CVTVSI   EQU   CVTS01+460
CVTVPSIB EQU   CVTS01+456
CVTMFACT EQU   CVTMFRTR
CVTMFCTL EQU   CVTS01+448
CVTPVBP  EQU   CVTS01+444
CVTPWI   EQU   CVTS01+440
CVTRV254 EQU   CVTS01+438
CVTRV253 EQU   CVTS01+436
CVTRV252 EQU   CVTS01+434
CVTRV251 EQU   CVTS01+433
CVTRV250 EQU   CVTS01+432
CVTRV249 EQU   CVTS01+431
CVTRV248 EQU   CVTS01+430
CVTRV247 EQU   CVTS01+429
CVTRV246 EQU   CVTS01+428
CVTRV245 EQU   CVTRV237
CVTRV244 EQU   CVTRV237
CVTRV243 EQU   CVTRV237
CVTRV242 EQU   CVTRV237
CVTRV241 EQU   CVTRV237
CVTRV240 EQU   CVTRV237
CVTRV239 EQU   CVTRV237
CVTRV238 EQU   CVTRV237
CVTRV236 EQU   CVTRV228
CVTRV235 EQU   CVTRV228
CVTRV234 EQU   CVTRV228
CVTRV233 EQU   CVTRV228
CVTRV232 EQU   CVTRV228
CVTRV231 EQU   CVTRV228
CVTRV230 EQU   CVTRV228
CVTRV229 EQU   CVTRV228
CVTRV227 EQU   CVTRV219
CVTRV226 EQU   CVTRV219
CVTRV225 EQU   CVTRV219
CVTRV224 EQU   CVTRV219
CVTRV223 EQU   CVTRV219
CVTRV222 EQU   CVTRV219
CVTRV221 EQU   CVTRV219
CVTRV220 EQU   CVTRV219
CVTRV218 EQU   CVTRV210
CVTRV217 EQU   CVTRV210
CVTRV216 EQU   CVTRV210
CVTRV215 EQU   CVTRV210
CVTRV214 EQU   CVTRV210
CVTRV213 EQU   CVTRV210
CVTRV212 EQU   CVTRV210
CVTRV211 EQU   CVTRV210
CVTLCCAT EQU   CVTS01+420
CVTPCCAT EQU   CVTS01+416
CVTIPCRP EQU   CVTS01+412
CVTIPCRI EQU   CVTS01+408
CVTIPCDS EQU   CVTS01+404
CVTAIDVT EQU   CVTS01+400
CVTSSAP  EQU   CVTS01+396
CVTEHCIR EQU   CVTS01+392
CVTEHDEF EQU   CVTS01+388
CVTDAIR  EQU   CVTS01+384
CVTPERFM EQU   CVTS01+380
CVT044R2 EQU   CVTS01+376
CVTFETCH EQU   CVTS01+372
CVTRSTWD EQU   CVTS01+368
CVTSPOST EQU   CVTS01+364
CVTIOBP  EQU   CVTS01+360
CVTASMVT EQU   CVTS01+356
CVTRECRQ EQU   CVTS01+352
CVTWSAC  EQU   CVTS01+348
CVTRV149 EQU   CVTS01+344
CVTWSAL  EQU   CVTS01+340
CVTSPSA  EQU   CVTS01+336
CVTGLMN  EQU   CVTS01+332
CVTVEAC0 EQU   CVTS01+328
CVT062R1 EQU   CVTS01+324
CVTRPOST EQU   CVTS01+320
CVTDQIQE EQU   CVTS01+316
CVTCSD   EQU   CVTS01+312
CVTLKRMA EQU   CVTS01+308
CVTRSPIE EQU   CVTS01+304
CVTRENQ  EQU   CVTS01+300
CVTLQCB  EQU   CVTS01+296
CVTFQCB  EQU   CVTS01+292
CVTQCS01 EQU   CVTS01+288
CVTAPFT  EQU   CVTS01+284
CVTPARRL EQU   CVTS01+280
CVTVWAIT EQU   CVTS01+276
CVTGSPL  EQU   CVTS01+272
CVTLSMQ  EQU   CVTS01+268
CVTGSMQ  EQU   CVTS01+264
CVTEXPRO EQU   CVTS01+260
CVTOPCTP EQU   CVTS01+256
CVTSIC   EQU   CVTS01+252
CVTTPIOS EQU   CVTS01+248
CVTRTMS  EQU   CVTS01+244
CVTSDBF  EQU   CVTS01+240
CVTSCBP  EQU   CVTS01+236
CVTSDMP  EQU   CVTS01+232
CVTSV60  EQU   CVTS01+228
CVTRTMCT EQU   CVTS01+224
CVTASCBL EQU   CVTS01+220
CVTASCBH EQU   CVTS01+216
CVTGDA   EQU   CVTS01+212
CVTASVT  EQU   CVTS01+208
CVTVVMDI EQU   CVTS01+204
CVTAQTOP EQU   CVTS01+200
CVTIOSCS EQU   CVTS01+196
CVTSDRM  EQU   CVTS01+192
CVTOPTE  EQU   CVTS01+188
CVTSTXU  EQU   CVTS01+184
CVTQUIS  EQU   CVTS01+180
CVTS1EE  EQU   CVTS01+172
CVTFRAS  EQU   CVTS01+168
CVTQSAS  EQU   CVTS01+164
CVTCRAS  EQU   CVTS01+160
CVTCRMN  EQU   CVTS01+156
CVTDELCP EQU   CVTS01+152
CVTFRECL EQU   CVTS01+148
CVTGETCL EQU   CVTS01+144
CVTBLDCP EQU   CVTS01+140
CVTAUTHL EQU   CVTS01+136
CVTSCAN  EQU   CVTS01+132
CVTRV144 EQU   CVTS01+130
CVTMAXMP EQU   CVTS01+128
CVTSTCK  EQU   CVTS01+124
CVTRV139 EQU   CVTS01+123
CVTDSSAC EQU   CVTS01+122
CVTRV513 EQU   CVTS01+121
CVTIOSPL EQU   CVTS01+120
CVTPTGT  EQU   CVTS01+116
CVTCSPIE EQU   CVTS01+112
CVTSMFEX EQU   CVTS01+108
CVTOLT0A EQU   CVTS01+104
CVTSRBRT EQU   CVTS01+100
CVTPUTL  EQU   CVTS01+96
CVTASCRL EQU   CVTS01+92
CVTASCRF EQU   CVTS01+88
CVTRV326 EQU   CVTS01+84
CVTRV325 EQU   CVTS01+80
CVTRV324 EQU   CVTS01+76
CVT0VL01 EQU   CVTS01+72
CVTSHRVM EQU   CVTS01+68
CVTRV332 EQU   CVTS01+64
CVTTAS   EQU   CVTS01+60
CVTRSCN  EQU   CVTS01+56
CVTTRAC2 EQU   CVTS01+54
CVTTRACE EQU   CVTS01+52
CVTAPG   EQU   CVTS01+51
CVTSDTRC EQU   CVTCTLFG
CVTGTRCE EQU   CVTCTLFG
CVTNOMP  EQU   CVTCTLFG
CVTRSV79 EQU   CVTCTLFG
CVTDSTAT EQU   CVTCTLFG
CVTRSV78 EQU   CVTCTLFG
CVTRV333 EQU   CVTCTLFG
CVTRV323 EQU   CVTCTLFG
CVTSPVLK EQU   CVTS01+49
CVTRSV77 EQU   CVTS01+48
CVTRV331 EQU   CVTS01+44
CVTRV330 EQU   CVTS01+40
CVTRV329 EQU   CVTS01+36
CVTRV328 EQU   CVTS01+32
CVTRV322 EQU   CVTS01+28
CVTSLID  EQU   CVTSLIDA+1
CVTSYLK  EQU   CVTSLIDA
CVTRV321 EQU   CVTS01+20
CVTRV320 EQU   CVTS01+16
CVTLPDIR EQU   CVTLPDIA+1
CVTRSV69 EQU   CVTDIRST
CVTRSV68 EQU   CVTDIRST
CVTRSV67 EQU   CVTDIRST
CVTRSV66 EQU   CVTDIRST
CVTRSV65 EQU   CVTDIRST
CVTRSV64 EQU   CVTDIRST
CVTRSV63 EQU   CVTDIRST
CVTDICOM EQU   CVTDIRST
CVTPVTP  EQU   CVTS01+8
CVTLPDSR EQU   CVTS01+4
CVTGETL  EQU   CVTS01
SYSSCAN  EQU   CVARMAP+265
CSCANLNG EQU   CVARMAP+263
CSCANFLG EQU   CVARMAP+261
MAXCC    EQU   CVARMAP+252
CMCCLNG  EQU   CVARMAP+250
CMCCFLG  EQU   CVARMAP+248
LASTCC   EQU   CVARMAP+238
CLCCLNG  EQU   CVARMAP+236
CLCCFLG  EQU   CVARMAP+234
SYSDVAL  EQU   CVARMAP+223
CDVALLNG EQU   CVARMAP+221
CDVALFLG EQU   CVARMAP+219
CDVALVAL EQU   CVARMAP+215
SYSNEST  EQU   CVARMAP+208
CNESTLNG EQU   CVARMAP+206
CNESTFLG EQU   CVARMAP+204
SYSPROC  EQU   CVARMAP+193
CPROCLNG EQU   CVARMAP+191
CPROCFLG EQU   CVARMAP+189
SYSUID   EQU   CVARMAP+179
CUIDLNG  EQU   CVARMAP+177
CUIDFLG  EQU   CVARMAP+175
SYSDLM   EQU   CVARMAP+165
CDLMLNG  EQU   CVARMAP+163
CDLMFLG  EQU   CVARMAP+161
SYSICMD  EQU   CVARMAP+150
CICMDLNG EQU   CVARMAP+148
CICMDFLG EQU   CVARMAP+146
EVAL     EQU   CVARMAP+138
CEVALLNG EQU   CVARMAP+136
CEVALFLG EQU   CVARMAP+134
CEVALVAL EQU   CVARMAP+130
SUBSTR   EQU   CVARMAP+124
CSSTRLNG EQU   CVARMAP+122
CSSTRFLG EQU   CVARMAP+120
CSSTRVAL EQU   CVARMAP+116
STRING   EQU   CVARMAP+113
CSTRLNG  EQU   CVARMAP+111
CSTRFLG  EQU   CVARMAP+109
CSTRVAL  EQU   CVARMAP+105
DATATYPE EQU   CVARMAP+97
CTYPELNG EQU   CVARMAP+95
CTYPEFLG EQU   CVARMAP+93
CTYPEVAL EQU   CVARMAP+89
CLENGTH  EQU   CVARMAP+83
CLENLNG  EQU   CVARMAP+81
CLENFLG  EQU   CVARMAP+79
CLENVAL  EQU   CVARMAP+75
SYSPREF  EQU   CVARMAP+68
CPREFLNG EQU   CVARMAP+66
CPREFLG  EQU   CVARMAP+64
CPREFVAL EQU   CVARMAP+60
SYSDATE  EQU   CVARMAP+53
CDATELNG EQU   CVARMAP+51
CDATEFLG EQU   CVARMAP+49
CDATEVAL EQU   CVARMAP+45
SYSSCMD  EQU   CVARMAP+38
CSCMDLNG EQU   CVARMAP+36
CSCMDFLG EQU   CVARMAP+34
CSCMDVAL EQU   CVARMAP+30
SYSPCMD  EQU   CVARMAP+23
CPCMDLNG EQU   CVARMAP+21
CPCMDFLG EQU   CVARMAP+19
CPCMDVAL EQU   CVARMAP+15
SYSTIME  EQU   CVARMAP+8
CTIMELNG EQU   CVARMAP+6
CTIMEFLG EQU   CVARMAP+4
CTIMEVAL EQU   CVARMAP
VIDPRLNG EQU   VIDMAP+34
@NM00054 EQU   VIDMAP
NVLSTDAT EQU   NEWVLST+4
PRMPPDE  EQU   EXPAROUT+42
LISTPDE  EQU   EXPAROUT+40
@NM00044 EQU   EXPAROUT+39
@NM00043 EQU   EXPAROUT+31
PSWD     EQU   PSWDFLG
PSWDLNG  EQU   EXPAROUT+28
PSWDPTR  EQU   EXPAROUT+24
@NM00042 EQU   EXPAROUT+23
MEM      EQU   MEMFLG
MEMLNG   EQU   EXPAROUT+20
MEMPTR   EQU   EXPAROUT+16
@NM00041 EQU   EXPAROUT+15
DSNQTE   EQU   DSNFLG
DSN      EQU   DSNFLG
DSNLNG   EQU   EXPAROUT+12
DSNPTR   EQU   EXPAROUT+8
EPDLLNG  EQU   EXPAROUT+6
EPDLSPNO EQU   EXPAROUT+4
EPDLNXT  EQU   EXPAROUT
@NM00040 EQU   SUBFLD
KWNAMDAT EQU   KEYWDMAP+11
KWNAMLNG EQU   KEYWDMAP+10
KWLNG    EQU   KEYWDMAP+8
@NM00039 EQU   KEYWDMAP+6
@NM00038 EQU   KEYWDMAP+6
@NM00037 EQU   KEYWDMAP
IDPRINFO EQU   IDENTMAP+35
@NM00036 EQU   IDENTMAP+7
@NM00035 EQU   IDENTMAP+6
@NM00034 EQU   IDENTMAP+6
@NM00033 EQU   IDENTMAP
IDPROMPT EQU   IDENTMAP
@NM00032 EQU   IDENTMAP
VIPDEP   EQU   VIPDEFLG
PDLLEN   EQU   PDLHEAD+6
PDLSPNO  EQU   PDLHEAD+4
PDLNXT   EQU   PDLHEAD
IDPDEP   EQU   IDPDEFLG
RECOFF   EQU   IREC+2
TIOTSTP  EQU   TIOT+16
TIOTNJOB EQU   TIOT
INSADLSD EQU   INSTACK+1
INSLIST  EQU   INSCODE
INSPROC  EQU   INSCODE
INSPROM  EQU   INSCODE
INSEXEC  EQU   INSCODE
INSOTDD  EQU   INSCODE
INSINDD  EQU   INSCODE
INSSTOR  EQU   INSCODE
INSDATA  EQU   INSCODE
@NM00031 EQU   IOSRL+12
IOSNELM  EQU   IOSRL+10
IOSTLEN  EQU   IOSRL+8
IOSBELM  EQU   IOSRL+4
CVTLEVL  EQU   CVTRELNO+2
CVTNUMB  EQU   CVTRELNO
CVTMDL   EQU   CVTFIX+250
@NM00030 EQU   CVTFIX+248
@NM00029 EQU   CVTFIX
CVTRV482 EQU   CVTXTNT2+128
CVTRV481 EQU   CVTXTNT2+124
CVTRV480 EQU   CVTXTNT2+120
CVTRV479 EQU   CVTXTNT2+118
CVTRV478 EQU   CVTXTNT2+117
CVTRV477 EQU   CVTXTNT2+116
CVTRV476 EQU   CVTXTNT2+115
CVTRV475 EQU   CVTXTNT2+114
CVTRV474 EQU   CVTRV466
CVTRV473 EQU   CVTRV466
CVTRV472 EQU   CVTRV466
CVTRV471 EQU   CVTRV466
CVTRV470 EQU   CVTRV466
CVTRV469 EQU   CVTRV466
CVTRV468 EQU   CVTRV466
CVTRV467 EQU   CVTRV466
CVTRV465 EQU   CVTRV457
CVTRV464 EQU   CVTRV457
CVTRV463 EQU   CVTRV457
CVTRV462 EQU   CVTRV457
CVTRV461 EQU   CVTRV457
CVTRV460 EQU   CVTRV457
CVTRV459 EQU   CVTRV457
CVTRV458 EQU   CVTRV457
CVTRV456 EQU   CVTXTNT2+108
CVTRV455 EQU   CVTXTNT2+104
CVTRV454 EQU   CVTXTNT2+100
CVTRV453 EQU   CVTXTNT2+96
CVTRV452 EQU   CVTXTNT2+94
CVTRV451 EQU   CVTXTNT2+92
CVTRV450 EQU   CVTXTNT2+90
CVTRV449 EQU   CVTXTNT2+88
CVTRV448 EQU   CVTXTNT2+87
CVTRV447 EQU   CVTXTNT2+86
CVTRV446 EQU   CVTRV438
CVTRV445 EQU   CVTRV438
CVTRV444 EQU   CVTRV438
CVTRV443 EQU   CVTRV438
CVTRV442 EQU   CVTRV438
CVTRV441 EQU   CVTRV438
CVTRV440 EQU   CVTRV438
CVTRV439 EQU   CVTRV438
CVTRV437 EQU   CVTRV429
CVTRV436 EQU   CVTRV429
CVTRV435 EQU   CVTRV429
CVTRV434 EQU   CVTRV429
CVTRV433 EQU   CVTRV429
CVTRV432 EQU   CVTRV429
CVTRV431 EQU   CVTRV429
CVTRV430 EQU   CVTRV429
CVTRV428 EQU   CVTXTNT2+80
CVTRV427 EQU   CVTXTNT2+76
CVTRV426 EQU   CVTXTNT2+72
CVTRV425 EQU   CVTXTNT2+68
CVTATACT EQU   CVTATCVT
CVTRV423 EQU   CVTXTNT2+62
CVTRV422 EQU   CVTXTNT2+60
CVTRV421 EQU   CVTXTNT2+58
CVTRV420 EQU   CVTXTNT2+56
CVTRV419 EQU   CVTXTNT2+55
CVTRV418 EQU   CVTXTNT2+54
CVTRV417 EQU   CVTRV409
CVTRV416 EQU   CVTRV409
CVTRV415 EQU   CVTRV409
CVTRV414 EQU   CVTRV409
CVTRV413 EQU   CVTRV409
CVTRV412 EQU   CVTRV409
CVTRV411 EQU   CVTRV409
CVTRV410 EQU   CVTRV409
CVTRV408 EQU   CVTRV400
CVTRV407 EQU   CVTRV400
CVTRV406 EQU   CVTRV400
CVTRV405 EQU   CVTRV400
CVTRV404 EQU   CVTRV400
CVTRV403 EQU   CVTRV400
CVTRV402 EQU   CVTRV400
CVTRV401 EQU   CVTRV400
CVTICB   EQU   CVTXTNT2+48
CVTSKTA  EQU   CVTXTNT2+44
CVTRSV99 EQU   CVTXTNT2+40
CVTRSV98 EQU   CVTXTNT2+36
CVTRSV97 EQU   CVTXTNT2+34
CVTRSV96 EQU   CVTXTNT2+32
CVTOLTEP EQU   CVTXTNT2+28
CVTQIDA  EQU   CVTQID+1
CVTRSV95 EQU   CVTQID
CVTRSV94 EQU   CVTXTNT2+20
CVTRSV93 EQU   CVTXTNT2+16
CVTRSV92 EQU   CVTXTNT2+12
CVTDEBVR EQU   CVTXTNT2+8
CVTRSV91 EQU   CVTXTNT2+6
CVTRSV9H EQU   CVTFLGBT
CVTRSV9G EQU   CVTFLGBT
CVTRSV9F EQU   CVTFLGBT
CVTRSV9E EQU   CVTFLGBT
CVTRSV9D EQU   CVTFLGBT
CVTRSV9C EQU   CVTFLGBT
CVTVME   EQU   CVTFLGBT
CVTNPE   EQU   CVTFLGBT
CVTNUCLS EQU   CVTXTNT2+4
CVTDSSVA EQU   CVTDSSV+1
CVTRSV89 EQU   CVTDSSV
CVTRSV88 EQU   CVTXTNT1+8
CVTRSV87 EQU   CVTXTNT1+4
CVTFACHN EQU   CVTXTNT1
CVTRV488 EQU   CVTMAP+412
CVTRV487 EQU   CVTMAP+408
CVTRV486 EQU   CVTMAP+404
CVTRV485 EQU   CVTMAP+400
CVTACTAP EQU   CVTMAP+396
CVTAUTH  EQU   CVTMAP+392
CVTATMCA EQU   CVTATMCT+1
CVTATMST EQU   CVTATMCT
CVTRSV61 EQU   CVTMAP+384
CVTVOLT1 EQU   CVTVOLM1+1
CVTVOLI1 EQU   CVTVOLF1
CVTSTOA  EQU   CVTMAP+376
CVTRSV58 EQU   CVTMAP+374
CVTRSV57 EQU   CVTMAP+372
CVTDDCE  EQU   CVTMAP+368
CVTPNWFR EQU   CVTMAP+364
CVTSMF   EQU   CVTMAP+360
CVTSULK  EQU   CVTMAP+358
CVTSLKO  EQU   CVTSYSK
CVTSLKP  EQU   CVTSYSK
CVTSLKQ  EQU   CVTSYSK
CVTSLKR  EQU   CVTSYSK
CVTRSV56 EQU   CVTSYSK
CVTRSV55 EQU   CVTSYSK
CVTRSV54 EQU   CVTSYSK
CVTRSV53 EQU   CVTSYSK
CVTRSV52 EQU   CVTA1F1
CVTRSV51 EQU   CVTA1F1
CVTRSV50 EQU   CVTA1F1
CVTRSV49 EQU   CVTA1F1
CVTRSV48 EQU   CVTA1F1
CVTRSV47 EQU   CVTA1F1
CVTSRSW  EQU   CVTA1F1
CVTPFSW  EQU   CVTA1F1
CVTPCVT  EQU   CVTMAP+352
CVTRSV46 EQU   CVTMAP+344
CVTRSV45 EQU   CVTMAP+340
CVTRSV44 EQU   CVTMAP+338
CVTRSV43 EQU   CVTMAP+336
CVTHJESA EQU   CVTHJES+1
CVTRSV42 EQU   CVTHJES
CVTEXT2A EQU   CVTEXT2+1
CVTRSV41 EQU   CVTEXT2
CVTAPFA  EQU   CVTAPF+1
CVTRSV40 EQU   CVTAPF
CVTRV518 EQU   CVTINTLA
CVTRV517 EQU   CVTERPV
CVTEORM  EQU   CVTMAP+312
CVTMCHPR EQU   CVTMAP+308
CVTTZ    EQU   CVTMAP+304
CVTJEPS  EQU   CVTMAP+300
CVTJESCT EQU   CVTMAP+296
CVTMODE  EQU   CVTMAP+292
CVTPTRV  EQU   CVTMAP+288
CVTREAL  EQU   CVTMAP+284
CVTRSV39 EQU   CVTMAP+280
CVTRSV38 EQU   CVTMAP+276
CVTDMSRA EQU   CVTDMSR+1
CVTRV634 EQU   CVTDMSRF
CVTRV633 EQU   CVTDMSRF
CVTRV632 EQU   CVTDMSRF
CVTRV631 EQU   CVTDMSRF
CVTRV630 EQU   CVTDMSRF
CVTRV629 EQU   CVTDMSRF
CVTUDUMP EQU   CVTDMSRF
CVTSDUMP EQU   CVTDMSRF
CVTQMSGA EQU   CVTQMSG+1
CVTRSV36 EQU   CVTQMSG
CVTAMFF  EQU   CVTMAP+264
CVTPURGA EQU   CVTPURG+1
CVTRSV35 EQU   CVTPURG
CVTCBSP  EQU   CVTMAP+256
CVTATERA EQU   CVTATER+1
CVTSYST  EQU   CVTATER
CVTVOLT2 EQU   CVTTAT
CVTVOLI2 EQU   CVTVOLF2
CVTAQAVB EQU   CVTAQAVT+1
CVTRSV34 EQU   CVTTCMFG
CVTRSV33 EQU   CVTTCMFG
CVTRSV32 EQU   CVTTCMFG
CVTRSV31 EQU   CVTTCMFG
CVTRSV30 EQU   CVTTCMFG
CVTRSV29 EQU   CVTTCMFG
CVTRSV28 EQU   CVTTCMFG
CVTTCRDY EQU   CVTTCMFG
CVTGTFA  EQU   CVTGTF+1
CVTRSV27 EQU   CVTGTFST
CVTRNIO  EQU   CVTGTFST
CVTUSR   EQU   CVTGTFST
CVTRV318 EQU   CVTFORM
CVTRV317 EQU   CVTTMODE
CVTRV316 EQU   CVTSTATE
CVTRV315 EQU   CVTGTFS
CVTGTFAV EQU   CVTGTFS
CVT0SCR1 EQU   CVTMAP+232
CVTRV515 EQU   CVTMAP+228
CVTRMS   EQU   CVTMAP+224
CVTPATCH EQU   CVTMAP+220
CVTTSCE  EQU   CVTMAP+216
CVTLNKSC EQU   CVTMAP+214
CVTQABST EQU   CVTMAP+212
CVTMDLDS EQU   CVTMAP+208
CVTUSER  EQU   CVTMAP+204
CVTABEND EQU   CVTMAP+200
CVTSMCA  EQU   CVTMAP+196
CVTRSV18 EQU   CVTMAP+192
CVTQLPAQ EQU   CVTMAP+188
CVTQCDSR EQU   CVTMAP+184
CVTRSV17 EQU   CVTOPTB
CVTRSV16 EQU   CVTOPTB
CVTFP    EQU   CVTOPTB
CVTAPTHR EQU   CVTOPTB
CVTNLOG  EQU   CVTOPTB
CVTTOD   EQU   CVTOPTB
CVTCTIMS EQU   CVTOPTB
CVTPROT  EQU   CVTOPTB
CVTXPFP  EQU   CVTOPTA
CVTASCII EQU   CVTOPTA
CVTRSV13 EQU   CVTOPTA
CVTRSV12 EQU   CVTOPTA
CVTNIP   EQU   CVTOPTA
CVTDDR   EQU   CVTOPTA
CVTAPR   EQU   CVTOPTA
CVTCCH   EQU   CVTOPTA
CVTSNCTR EQU   CVTMAP+180
CVTQMWR  EQU   CVTMAP+176
CVTQOCR  EQU   CVTMAP+172
CVT1EF00 EQU   CVTMAP+168
CVTMZ00  EQU   CVTMAP+164
CVTHEAD  EQU   CVTMAP+160
CVTRSV11 EQU   CVTMAP+156
CVT0PT01 EQU   CVTMAP+152
CVTMSER  EQU   CVTMAP+148
CVTRV516 EQU   CVTIERLC
CVTILCH  EQU   CVTMAP+140
CVT0DS   EQU   CVTMAP+136
CVTFBOSV EQU   CVTMAP+132
CVTNUCB  EQU   CVTMAP+128
CVTIXAVL EQU   CVTMAP+124
CVTIOQET EQU   CVTMAP+120
CVTDCBA  EQU   CVTMAP+117
CVTMVS2  EQU   CVTDCB
CVT6DAT  EQU   CVTDCB
CVT4MPS  EQU   CVTDCB
CVTRSV09 EQU   CVTDCB
CVT4MS1  EQU   CVTDCB
CVT2SPS  EQU   CVTDCB
CVT1SSS  EQU   CVTDCB
CVTRSV08 EQU   CVTDCB
CVTSTB   EQU   CVTMAP+112
CVTQTD00 EQU   CVTMAP+108
CVTQTE00 EQU   CVTMAP+104
CVTCUCB  EQU   CVTMAP+100
CVTSJQ   EQU   CVTMAP+96
CVTPBLDL EQU   CVTMAP+92
CVTTPC   EQU   CVTMAP+88
CVTSVDCB EQU   CVTMAP+84
CVTBRET  EQU   CVTMAP+82
CVTEXIT  EQU   CVTMAP+80
CVT0FN00 EQU   CVTMAP+76
CVTDARA  EQU   CVTDAR+1
CVTRSV07 EQU   CVTFLGS1
CVTRSV06 EQU   CVTFLGS1
CVTRSV05 EQU   CVTFLGS1
CVTRSV04 EQU   CVTFLGS1
CVTRSV03 EQU   CVTFLGS1
CVTRSV02 EQU   CVTFLGS1
CVTRSV01 EQU   CVTFLGS1
CVTDMPLK EQU   CVTFLGS1
CVTXITP  EQU   CVTMAP+68
CVTZDTAB EQU   CVTMAP+64
CVTMSLT  EQU   CVTMAP+60
CVTDATE  EQU   CVTMAP+56
CVTBTERM EQU   CVTMAP+52
CVTSYSAD EQU   CVTMAP+48
CVTXTLER EQU   CVTMAP+44
CVTILK2  EQU   CVTMAP+40
CVTILK1  EQU   CVTMAP+36
CVTPRLTV EQU   CVTMAP+32
CVTPCNVT EQU   CVTMAP+28
CVT0VL00 EQU   CVTMAP+24
CVTXAPG  EQU   CVTMAP+20
CVTBUF   EQU   CVTMAP+16
CVTJOB   EQU   CVTMAP+12
CVTLINK  EQU   CVTMAP+8
CVT0EF00 EQU   CVTMAP+4
CVTTCBP  EQU   CVTMAP
CVT      EQU   CVTMAP
PPLUWA   EQU   PPL+24
PSCBU    EQU   PSCB+64
PSCBRSZ  EQU   PSCB+60
PSCBLINE EQU   PSCB+59
PSCBCHAR EQU   PSCB+58
PSCBUPTL EQU   PSCB+56
PSCBUPT  EQU   PSCB+52
PSCBRLGB EQU   PSCB+48
PSCBDEST EQU   PSCB+40
@NM00028 EQU   PSCB+36
@NM00027 EQU   PSCB+32
@NM00026 EQU   PSCB+28
PSCBLTI2 EQU   PSCB+24
PSCBLTIM EQU   PSCB+20
PSCBATR2 EQU   PSCB+18
@NM00025 EQU   PSCBATR1
@NM00024 EQU   PSCBATR1
@NM00023 EQU   PSCBATR1
PSCBATTN EQU   PSCBATR1
PSCBVMNT EQU   PSCBATR1
PSCBJCL  EQU   PSCBATR1
PSCBACCT EQU   PSCBATR1
PSCBCTRL EQU   PSCBATR1
PSCBGPNM EQU   PSCB+8
@NM00022 EQU   ECT+52
@NM00021 EQU   ECT+48
@NM00020 EQU   ECT+44
@NM00019 EQU   ECTSWS2+1
@NM00018 EQU   ECTSWS21
ECTTABND EQU   ECTSWS21
ECTDEFCS EQU   ECTSWS21
ECTBKPB  EQU   ECT+36
ECTUSER  EQU   ECT+32
ECTDDNUM EQU   ECT+29
ECTATTN  EQU   ECTSWS
ECTBKGRD EQU   ECTSWS
ECTNNOT  EQU   ECTSWS
ECTNMAL  EQU   ECTSWS
ECTLOGF  EQU   ECTSWS
ECTATRM  EQU   ECTSWS
@NM00017 EQU   ECTSWS
ECTSCMD  EQU   ECT+20
ECTPCMD  EQU   ECT+12
ECTSMSG  EQU   ECT+9
ECTMSGF  EQU   ECT+8
ECTRTCD  EQU   ECT+1
ECTRCDF  EQU   ECT
@NM00016 EQU   GFPARMS+40
@NM00015 EQU   GFPARMS+36
GFPGMNP  EQU   GFPARMS+32
GFDSNP   EQU   GFPARMS+28
GFPGMNL  EQU   GFPARMS+26
GFDSNLEN EQU   GFPARMS+24
GFECBP   EQU   GFPARMS+20
@NM00014 EQU   GFPARMS+15
@NM00013 EQU   GFBITS
GFWTPSW  EQU   GFBITS
GFSUBSYS EQU   GFBITS
GFKEYN08 EQU   GFBITS
GFCBPTR  EQU   GFPARMS
RETCHAR  EQU   RET+2
RETSIZE  EQU   RET
MTADDR   EQU   MTINSRT+1
MTHIGHL  EQU   MTLEN
@NM00012 EQU   MSGTABLE+36
@NM00011 EQU   MSGTABLE+32
MTOLDPTR EQU   MSGTABLE+28
@NM00010 EQU   MSGTABLE+25
@NM00009 EQU   SW2
MTPGMSW  EQU   SW2
MTNPLMSW EQU   SW2
MTNOXQSW EQU   SW2
MTDOMSW  EQU   SW2
MT2OLDSW EQU   SW2
MTNHEXSW EQU   SW
MTWTPSW  EQU   SW
MTJOBISW EQU   SW
MTKEY1SW EQU   SW
MTWTOSW  EQU   SW
MTNOIDSW EQU   SW
MTHIGH   EQU   @NM00008
MTCPPL   EQU   TMCTPTR
LSDTOTLN EQU   LSD+6
@NM00007 EQU   SNTFLAGS+1
SNTGLOB  EQU   SNTFLAGS+1
SNTNOSCN EQU   SNTFLAGS
SNTLABEL EQU   SNTFLAGS
SNTGVAL  EQU   SNTVLPTR
COMRCDS  EQU   COMPROC+12
@NM00006 EQU   EXECDATA+60
FILEDCBS EQU   EXECDATA+56
RETPTR2  EQU   EXECDATA+52
ATACTEND EQU   EXECDATA+48
ATACTSTR EQU   EXECDATA+44
EXDLMPTR EQU   EXECDATA+40
GEXECCNT EQU   EXECDATA+36
NOLASTCC EQU   @NM00005+1
ATINCNTL EQU   @NM00005+1
ATTNCMD  EQU   @NM00005
NOMSG    EQU   @NM00005
CMAIN    EQU   @NM00005
ERINCNTL EQU   @NM00005
SYMLST   EQU   @NM00005
NOFLUSH  EQU   @NM00005
ERRCMD   EQU   @NM00005
CONLST   EQU   @NM00005
RETPTR   EQU   EXECDATA+28
ERACTEND EQU   EXECDATA+24
ERACTSTR EQU   EXECDATA+20
EXINSAVE EQU   @NM00004
LASTTSO  EQU   EXECDATA+12
ECDACPGM EQU   ECDA+68
ECDAGETL EQU   ECDA+60
@NM00003 EQU   ECDA+58
@NM00002 EQU   ECDAFLAG
@NM00001 EQU   ECDAFLAG
ECDAAEND EQU   ECDA+52
ECDAELNG EQU   ECDA+50
ECDANDO  EQU   ECDA+48
ECDAGCNT EQU   ECDA+44
ECDALCTR EQU   ECDA+36
ECDASPTR EQU   ECDA+32
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS
@RC00270 EQU   @RC00254
@RC00287 EQU   @RC00279
@RC00365 EQU   @RC00359
@RF00397 EQU   @RC00395
@RF00399 EQU   @RC00395
@RC00587 EQU   @RC00585
@RC00658 EQU   @RC00654
@RC00687 EQU   @RC00686
@RC00693 EQU   @EL00005
@RC00711 EQU   @EL00006
@RF00771 EQU   @EL00006
@RF00973 EQU   @RC00970
@RF00910 EQU   @EL00008
@RC00912 EQU   @EL00008
@RF00999 EQU   @EL00008
@RF00958 EQU   @RC00912
@ENDDATA EQU   *
         END   IKJCT431,(C'PLS1810',0701,78048)
