)ATTR DEFAULT(%+_)
       %   TYPE(TEXT)   INTENS(HIGH)
       +   TYPE(TEXT)   INTENS(LOW)
       _   TYPE(INPUT)  INTENS(HIGH) CAPS(ON)
       ^   TYPE(INPUT)  INTENS(HIGH) CAPS(ON) NUMERIC(ON)
       $   TYPE(OUTPUT) INTENS(HIGH) COLOR(YELLOW)
       ~   TYPE(TEXT)   INTENS(HIGH) HILITE(USCORE) COLOR(TURQ)
       `   TYPE(TEXT)   INTENS(HIGH) HILITE(USCORE) COLOR(PINK)
       @   TYPE(TEXT)   INTENS(HIGH) COLOR(YELLOW)
       ×   TYPE(TEXT)   INTENS(HIGH) COLOR(YELLOW) HILITE(USCORE)
)BODY
%--------------------------- $REASID   +$REASVR % ----------------------
%COMMAND ===>_ZZCMD

                                 `P R O F I L E+

~Data Presentation Options                            Command Set Option

 CHAR/HEX data length ===>^#I+    (        ×1-9+)     OS mode ===>_#OS+
 Perform AUTO actions ===>_#UC+   (     ×Yes/No+)
 DSECT names format   ===>_#DC   +(×Name/Offset+)
 Branch FORWARD  max  ===>^#A+    (        ×0-9+)     Packed  ===>_#PC+
 Branch BACKWARD max  ===>^#B+    (       ×0-99+)     Float   ===>_#FC+
 AUTOSAVE mode value  ===>^#T +   (   ×0-99/Off+)

                                                     ~Valid OS modes:+

                                                     ×360+ - IBM/360   c
                                                     ×370+ - IBM/370   c
                                                      ×XA+ - MVS SP/XA c
                                                     ×ESA+ - ESA       c



)INIT
  .HELP  = REAPRW00
  &ZZCMD = ' '

  VGET (REAINIT #I #UC #DC #A #B #T #OS #PC #FC) PROFILE
  IF (&REAINIT = ' ')
      &#I  = 4
      &#UC = 'YES'
      &#DC = 'NAME'
      &#A  = '12'
      &#B  = '8'
      &#T  = '0'
      &#OS = 'XA'
      &#PC = 'NO'
      &#FC = 'NO'
  &REAINIT = '*'

  IF (&#NOND ^= ' ')
     .RESP = END

)PROC
  VER (&#I,  NONBLANK)
  &#UC = TRANS (TRUNC (&#UC,1)  Y,YES N,NO  MSG=REAS067)
  IF (&#UC = 'YES')
     &#U = 1
  ELSE
     &#U = 0
  &#DC = TRANS (TRUNC (&#DC,1)  N,NAME O,OFFSET MSG=REAS067)
  IF (&#DC = 'OFFSET')
     &#D = 1
  ELSE
     &#D = 0
  VER (&#A,  NONBLANK)
  VER (&#B,  NONBLANK)
  VER (&#T,  NONBLANK)

  VER (&#OS, NONBLANK)
  VER (&#OS,LIST,360,370,SP,XA,ESA)
  &#O = TRANS (&#OS  360,1 370,2 SP,3 XA,3 ESA,4)

  VER (&#PC, NONBLANK)
  &#PC = TRANS (TRUNC (&#PC,1)  Y,YES N,NO  MSG=REAS067)
  IF (&#PC = 'YES')
     &#P = 1
  ELSE
     &#P = 0

  VER (&#FC, NONBLANK)
  &#FC = TRANS (TRUNC (&#FC,1)  Y,YES N,NO  MSG=REAS067)
  IF (&#FC = 'YES')
     &#F = 1
  ELSE
     &#F = 0

  VPUT (REAINIT #I #UC #DC #A #B #T #OS #PC #FC) PROFILE

)END
