         TITLE 'SUBSYSTEM INTERFACE INITIALIZATION ROUTINE - IEFJSINT  *
                        '
IEFJSINT CSECT ,                                                   0001
@MAINENT DS    0H                                                  0001
         USING *,@15                                               0001
         B     @PROLOG                                             0001
         DC    AL1(16)                                             0001
         DC    C'IEFJSINT  76.329'                                 0001
         DROP  @15
@PROLOG  STM   @14,@12,12(@13)                                     0001
         BALR  @12,0                                               0001
@PSTART  DS    0H                                                  0001
         USING @PSTART,@12                                         0001
         L     @00,@SIZDATD                                        0001
         GETMAIN  R,LV=(0)
         LR    @11,@01                                             0001
         USING @DATD,@11                                           0001
         ST    @13,@SA00001+4                                      0001
         LM    @00,@01,20(@13)                                     0001
         ST    @11,8(,@13)                                         0001
         LR    @13,@11                                             0001
*                                                                  0103
*   /*****************************************************************/
*   /*                                                               */
*   /* START OF IEFJSINT PROCESSING                          @G29ANSS*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0103
*   JESTBPTR=ADDR(IEFJTBNM);        /* SET JES NAMES TABLE PTR       */
         L     JESTBPTR,@CV00079                                   0103
*   JESPJESN=TBLENTRY;              /* SET PRIMARY JOB ENTRY       0104
*                                      SUBSYSTEM NAME IN JESCT       */
*                                                                  0104
         L     @10,CVTPTR                                          0104
         L     @10,CVTJESCT(,@10)                                  0104
         MVC   JESPJESN(4,@10),TBLENTRY(JESTBPTR)                  0104
*   /*****************************************************************/
*   /*                                                               */
*   /* LOAD ADDRESS OF SUBSYSTEM REQUEST ROUTINE - IEFJSREQ          */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0105
*   RESPECIFY                                                      0105
*    (R0PTR) RESTRICTED;                                           0105
*   GEN(LOAD  EP=IEFJSREQ);                                        0106
         LOAD  EP=IEFJSREQ
*   GEN(SPACE);                                                    0107
         SPACE
*   JESSSREQ=R0PTR;                 /* SET ADDRESS IN JESCT          */
         L     @10,CVTPTR                                          0108
         L     @01,CVTJESCT(,@10)                                  0108
         ST    R0PTR,JESSSREQ(,@01)                                0108
*   RESPECIFY                                                      0109
*    (R0PTR) UNRESTRICTED;                                         0109
*   GEN(DELETE EP=IEFJSREQ);                                       0110
         DELETE EP=IEFJSREQ
         EJECT
*                                                                  0111
*   /*****************************************************************/
*   /*                                                               */
*   /* THE FOLLOWING LOOP WILL GO THROUGH THE ENTRIES IN THE JES     */
*   /* NAMES TABLE. FOR EACH ENTRY SCANSSCT IS CALLED WHICH CHECKS TO*/
*   /* SEE IF THE ENTRY IS A DUPLICATE OF A SUBSYSTEM NAME. IF IT IS */
*   /* THEN SKIP IT OTHERWISE BLDSSCVT IS CALLED WHICH BUILDS A SSCVT*/
*   /* FOR THE SUBSYSTEM NAME, CHAINS THE SSCVT OFF THE JESCT AND    */
*   /* KEEPS A COUNT OF THE NUMBER OF DEFINED SUBSYSTEMS. WHEN THE   */
*   /* SSCVT IS BUILT FOR THE MASTER SUBSYSTEM THEN BLDSSCVT CALLS   */
*   /* BLDMSSVT TO BUILD THE MASTER SUBSYSTEM VECTOR TABLE.  @G29ANSS*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0111
*   NUMSUBS=ZERO;                   /* INITIALIZE COUNT OF DEFINED 0111
*                                      SUBSYSTEMS            @G29AN2F*/
         SLR   NUMSUBS,NUMSUBS                                     0111
*   DO WHILE(TBLENTRY^='00000000'X);                               0112
         B     @DE00112                                            0112
@DL00112 DS    0H                                                  0113
*     CALL SCANSSCT(TBLENTRY);      /* SCAN SSCVT CHAIN SEARCHING FOR
*                                      A DUPLICATE SUBSYSTEM NAME. 0113
*                                      DUPSW IS SET ON OR OFF BY   0113
*                                      SCANSSCT              @G29ANSS*/
         ST    JESTBPTR,@AL00001                                   0113
         LA    @01,@AL00001                                        0113
         BAL   @14,SCANSSCT                                        0113
*     IF DUPSW=OFF THEN             /* ANY DUPLICATES FOUND? @G29ANSS*/
         TM    DUPSW,B'10000000'                                   0114
         BNZ   @RF00114                                            0114
*       CALL BLDSSCVT(TBLENTRY);    /* NO, BUILD THE SSCVT FOR THE 0115
*                                      SUBSYSTEM. PASS THE NAME OF 0115
*                                      THE SUBSYSTEM TO BE BUILT.  0115
*                                                            @G29ANSS*/
         ST    JESTBPTR,@AL00001                                   0115
         LA    @01,@AL00001                                        0115
         BAL   @14,BLDSSCVT                                        0115
*     JESTBPTR=JESTBPTR+NTRYSIZ;    /* UPDATE JES NAMES TABLE ENTRY
*                                      POINTER                       */
@RF00114 AL    JESTBPTR,@CF00063                                   0116
*   END;                                                           0117
@DE00112 CLC   TBLENTRY(4,JESTBPTR),@CB01082                       0117
         BNE   @DL00112                                            0117
         EJECT
*                                                                  0118
*   /*****************************************************************/
*   /*                                                               */
*   /* CHECK TO SEE IF THIS IS AN SU29 SYSTEM. IF SO THEN FIND THE   */
*   /* MODULE IEFJSSNT(CONTAINS THE NAMES AND INITIALIZATION ENTRY   */
*   /* POINTS OF SUBSYSTEMS). LINK TO EACH SUBSYSTEM INITIALIZATION  */
*   /* ROUTINES.                                             @G29ANSS*/
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0118
*   IF SU29BIT=ON THEN              /* IS THIS AN SU29 SYSTEM?     0118
*                                                            @G29ANSS*/
         L     @10,CVTPTR                                          0118
         L     @10,CVTIHASU(,@10)                                  0118
         TM    SU29BIT(@10),B'00000100'                            0118
         BNO   @RF00118                                            0118
*     DO;                           /* YES, FIND IEFJSSNT    @G29ANSS*/
*                                                                  0119
*       /*************************************************************/
*       /*                                                           */
*       /* FIND MODULE IEFJSSNT IN CONCATENATED SYS1.LINKLIB @G29ANSS*/
*       /*                                                           */
*       /*************************************************************/
*                                                                  0120
*       BLDLNUM=ONE;                /* NUM ENTRIES IN BLDL LIST    0120
*                                                            @G29ANSS*/
         MVC   BLDLNUM(2),@CH00047                                 0120
*       BLDLLEN=LENGTH(BLDLENTR);   /* LEN OF ENTRY          @G29ANSS*/
         MVC   BLDLLEN(2),@CH00087                                 0121
*       BLDLNAME=JSSNT;             /* THE NAME TO LOCATE    @G29ANSS*/
         MVC   BLDLNAME(8),@CC00102                                0122
*       BLDLDATA=BLDLDATA&&BLDLDATA;/* CLEAR FIELDS          @G29ANSS*/
         XC    BLDLDATA(52),BLDLDATA                               0123
*       GEN REFS(BLDLLIST) SETS(BLDLDATA);                         0124
*                                            /* FIND JSSNT   @G29ANSS*/
         BLDL  0,BLDLLIST         FIND MODULE IEFJSSNT         @G29ANSS
*       RFY                                                        0125
*         R15 RSTD;                 /*                       @G29ANSS*/
*       IF R15=ZERO THEN            /* WAS IEFJSSNT FOUND?   @G29ANSS*/
         LTR   R15,R15                                             0126
         BNZ   @RF00126                                            0126
*         DO;                       /* YES, LOAD IT          @G29ANSS*/
*                                                                  0127
*           /*********************************************************/
*           /*                                                       */
*           /* LOAD MODULE IEFJSSNT                          @G29ANSS*/
*           /*                                                       */
*           /*********************************************************/
*                                                                  0128
*           RFY                                                    0128
*             R0 RSTD;              /*                       @G29ANSS*/
*           DO;                     /* LOAD DE(BLDLENTR)           0129
*                                      ERRET(LOADERR)                */
*             RESPECIFY                                            0130
*              (GPR00P,                                            0130
*               GPR01P,                                            0130
*               GPR15F) RESTRICTED;                                0130
*             GPR00P=-ADDR(BLDLENTR);/* LOAD NEGATIVE OF LIST ENTRY
*                                      ADDR                          */
         LA    GPR00P,BLDLENTR                                     0131
         LCR   GPR00P,GPR00P                                       0131
*             GPR01P=0;             /* JOBLIB OR LINKLIB DCB         */
         SLR   GPR01P,GPR01P                                       0132
*             GPR01P=GPR01P×'80000000'X;/* ERROR RETURN LABEL      0133
*                                      SPECIFIED                     */
         O     GPR01P,@CF01088                                     0133
*             SVC(8);               /* ISSUE LOAD SVC                */
         SVC   8                                                   0134
*             IF GPR15F^=0 THEN     /* LOAD WAS UNSUCCESSFUL         */
         LTR   GPR15F,GPR15F                                       0135
         BNZ   @RT00135                                            0135
*               GOTO LOADERR;       /* BRANCH TO ERROR LOCATION      */
*             RESPECIFY                                            0137
*              (GPR00P,                                            0137
*               GPR01P,                                            0137
*               GPR15F) UNRESTRICTED;                              0137
*           END;                    /* LOAD DE(BLDLENTR)           0138
*                                      ERRET(LOADERR) THE ERRET LABEL
*                                      SHOULD NEVER RECEIVE CONTROL
*                                      FROM THIS LOAD. THE ERRET   0138
*                                      EXISTS TO PREVENT JSINT FROM
*                                      ABENDING.             @G29ANSS*/
*           JSSNTPTR=R0;            /* ADDR OF 1ST SUBSYSTEM NAME IN
*                                      IEFJSSNT              @G29ANSS*/
         LR    JSSNTPTR,R0                                         0139
*           RFY                                                    0140
*            (R0,                                                  0140
*             R15) UNRSTD;          /*                       @G29ANSS*/
*                                                                  0140
*           /*********************************************************/
*           /*                                                       */
*           /* INITIALIZE THE SUBSYSTEMS - LOOP THROUGH THE          */
*           /* SUBSYSTEMS NAMES TABLE. FOR EACH VALID SUBSYSTEM NAME */
*           /* ENTRY THAT IS NOT A DUPLICATE, CALL BLDSSCVT TO BUILD */
*           /* AN SSCVT AND CHAIN IT TO THE PREVIOUS SSCVT'S @G29ANSS*/
*           /*                                                       */
*           /*********************************************************/
*                                                                  0141
*           DO WHILE(JSSNTNAM^=JSSNTEND);/* LOOP UNTIL END OF      0141
*                                      IEFJSSNT FOUND        @G29ANSS*/
         B     @DE00141                                            0141
@DL00141 DS    0H                                                  0142
*             IF JSSNTNAM(ONE:ONE)^=BLANK THEN/* IS ENTRY A DUMMY  0142
*                                      ENTRY?                @G29ANSS*/
         CLI   JSSNTNAM(JSSNTPTR),C' '                             0142
         BE    @RF00142                                            0142
*               DO;                 /* NO, VALID SUBSYSTEM NAME    0143
*                                                            @G29ANSS*/
*                 CALL SCANSSCT(JSSNTNAM);/* SCAN SSCVT CHAIN      0144
*                                      SEARCHING FOR A DUPLICATE   0144
*                                      SUBSYSTEM NAME. DUPSW IS SET
*                                      ON OR OFF IN SCANSSCT.      0144
*                                                            @G29ANSS*/
         ST    JSSNTPTR,@AL00001                                   0144
         LA    @01,@AL00001                                        0144
         BAL   @14,SCANSSCT                                        0144
*                 IF DUPSW=OFF THEN /* ANY DUPLICATES FOUND? @G29ANSS*/
         TM    DUPSW,B'10000000'                                   0145
         BNZ   @RF00145                                            0145
*                   CALL BLDSSCVT(JSSNTNAM);/* NO, BUILD THE SSCVT 0146
*                                      FOR THE SUBSYSTEM. PASS THE 0146
*                                      SUBSYSTEM NAME.       @G29ANSS*/
         ST    JSSNTPTR,@AL00001                                   0146
         LA    @01,@AL00001                                        0146
         BAL   @14,BLDSSCVT                                        0146
*               END;                /*                       @G29ANSS*/
@RF00145 DS    0H                                                  0148
*             JSSNTPTR=JSSNTPTR+LENGTH(JSSNTENT);/* GET NEXT ENTRY IN
*                                      IEFJSSNT              @G29ANSS*/
@RF00142 AL    JSSNTPTR,@CF00092                                   0148
*           END;                    /* OF DO WHILE           @G29ANSS*/
@DE00141 CLC   JSSNTNAM(4,JSSNTPTR),@CB00100                       0149
         BNE   @DL00141                                            0149
*           DO;                     /* DELETE DE(BLDLENTR)           */
*             RESPECIFY                                            0151
*              (GPR00P) RESTRICTED;                                0151
*             GPR00P=ADDR(BLDLENTR);/* ->ENTRY NAME                  */
         LA    GPR00P,BLDLENTR                                     0152
*             SVC(9);               /* DELETE SVC                    */
         SVC   9                                                   0153
*             RESPECIFY                                            0154
*              (GPR00P) UNRESTRICTED;                              0154
*           END;                    /* DELETE DE(BLDLENTR) DELETE  0155
*                                      IEFJSSNT              @G29ANSS*/
*LOADERR:                                                          0156
*           ;                       /* THIS LABEL RECEIVES CONTROL 0156
*                                      FROM THE LOAD FOR IEFJSSNT IF
*                                      AN ERROR OCCURS. IT SHOULD  0156
*                                      NEVER RECEIVE CONTROL FROM  0156
*                                      THERE.                @G29ANSS*/
LOADERR  DS    0H                                                  0157
*         END;                      /* OF IEFJSSNT FOUND     @G29ANSS*/
         EJECT
*                                                                  0158
*/********************************************************************/
*/*  THE FOLLOWING SECTION OF CODE WILL DO:                  @G29AN2F*/
*/*                                                          @G29AN2F*/
*/*      - CALCULATE THE SIZE OF THE SUBSYSTEM ALLOCATION    @G29AN2F*/
*/*        SEQUENCE TABLE(SAST) REQUIRED BASED ON THE NUMBER @G29AN2F*/
*/*        OF SSCVT'S CREATED.                               @G29AN2F*/
*/*      - GETMAIN THE REQUIRED AREA FROM SUBPOOL 241.       @G29AN2F*/
*/*      - CHAIN THE TABLE TO JESCT.                         @G29AN2F*/
*/*      - INITIALIZE THE TABLE WITH THE SUBSYSTEM NAMES BY  @G29AN2F*/
*/*        SCANNING THE SSCVT CHAIN. NOTE THAT THE NAME OF   @G29AN2F*/
*/*        THE MASTER SUBSYSTEM IS PLACED IN THE LAST ENTRY  @G29AN2F*/
*/*        IN THE TABLE.                                     @G29AN2F*/
*/*                                                          @G29AN2F*/
*/********************************************************************/
*                                                                  0158
*       TBLSIZE=NUMSUBS*LENGTH(SASTENRY);/* CALCULATE SIZE OF      0158
*                                      VARIABLE PORTION      @G29AN2F*/
@RF00126 LR    TBLSIZE,NUMSUBS                                     0158
         MH    TBLSIZE,@CH00145                                    0158
*       RESPECIFY                                                  0159
*        (R1) RESTRICTED;           /* RESTRICT REG 1        @G29AN2F*/
*       DO;                         /* GETMAIN (R) LV(TBLSIZE+LENGTH(
*                                      JSASTHDR))SP('F1'X)           */
*         RESPECIFY                                                0161
*          (GPR01F,                                                0161
*           GPR00F) RESTRICTED;                                    0161
*         GPR00F=TBLSIZE+LENGTH(JSASTHDR);/* LENGTH REQUESTED        */
         LA    GPR00F,8                                            0162
         ALR   GPR00F,TBLSIZE                                      0162
*         GPR01F='F1'X;             /* SP IN REG 1                   */
         LA    GPR01F,241                                          0163
*         GEN(SLL   GPR01F,24)                                     0164
*         NODEFS NOREFS NOSETS NOEXIT NOFLOWS SEQFLOW;             0164
         SLL   GPR01F,24
*         GPR00F=GPR00F×GPR01F;     /* SP IN HIGH BYTE               */
         OR    GPR00F,GPR01F                                       0165
*         GPR01F=-1;                /* INDICATE A GETMAIN REQUEST    */
         SLR   GPR01F,GPR01F                                       0166
         BCTR  GPR01F,0                                            0166
*         SVC(10);                  /* R-FORM OF GETMAIN             */
         SVC   10                                                  0167
*         RESPECIFY                                                0168
*          (GPR01F,                                                0168
*           GPR00F) UNRESTRICTED;                                  0168
*       END;                        /* GETMAIN (R) LV(TBLSIZE+LENGTH(
*                                      JSASTHDR))SP('F1'X)           */
*                                                                  0169
*       /*************************************************************/
*       /*                                                           */
*       /* GET JSAST CORE                                    @G29AN2F*/
*       /*                                                           */
*       /*************************************************************/
*                                                                  0170
*       JESSASTA=R1;                /* SET POINTER TO AREA   @G29AN2F*/
         L     @10,CVTPTR                                          0170
         L     @10,CVTJESCT(,@10)                                  0170
         ST    R1,JESSASTA(,@10)                                   0170
*       RESPECIFY                                                  0171
*        (R1) UNRESTRICTED;         /* RELEASE REG 1         @G29AN2F*/
*       JSASTHDR=JSASTHDR&&JSASTHDR;/* CLEAR HEADER AREA     @G29AN2F*/
         L     @07,CVTPTR                                          0172
         L     @07,CVTJESCT(,@07)                                  0172
         L     @07,JESSASTA(,@07)                                  0172
         XC    JSASTHDR(8,@07),JSASTHDR(@07)                       0172
*       JSASTID=SASTID;             /* SET JSAST IDENTIFIER  @G29AN2F*/
         MVC   JSASTID(4,@07),@CC00066                             0173
*       JSASTTBS=TBLSIZE;           /* SET SIZE OF TABLE NEEDED BY 0174
*                                      ALLOCATION            @G29AN2F*/
         STH   TBLSIZE,JSASTTBS(,@07)                              0174
*       SSCTPTR=JESSSCT;            /* START SSCVT SCAN      @G29AN2F*/
         L     SSCTPTR,JESSSCT(,@10)                               0175
*       I=1;                        /* SET ARRAY INDEX       @G29AN2F*/
         LA    I,1                                                 0176
*       RFY                                                        0177
*         SASTTBLE BASED(ADDR(JSASTTBL));/* SET TABLE BASE   @G29AN2F*/
*       DO WHILE SSCTPTR^=ZERO;     /* SCAN THE SSCVT CHAIN  @G29AN2F*/
         B     @DE00178                                            0178
@DL00178 DS    0H                                                  0179
*         IF SSCTSNAM^=MSSNAME THEN /* IS NAME NOT THAT OF THE MASTER
*                                      SUBSYSTEM ?           @G29AN2F*/
         CLC   SSCTSNAM(4,SSCTPTR),@CC00064                        0179
         BE    @RF00179                                            0179
*           DO;                     /* YES, PROCESS NAME     @G29AN2F*/
*             SASTENRY(I)=SASTENRY(I)&&SASTENRY(I);/* CLEAR ENTRY  0181
*                                      AREA                  @G29AN2F*/
         LR    @10,I                                               0181
         MH    @10,@CH00145                                        0181
         L     @07,CVTPTR                                          0181
         L     @07,CVTJESCT(,@07)                                  0181
         LA    @04,8                                               0181
         AL    @04,JESSASTA(,@07)                                  0181
         ST    @10,@TF00001                                        0181
         ALR   @10,@04                                             0181
         AL    @10,@CF01139                                        0181
         XC    SASTENRY(12,@10),SASTENRY(@10)                      0181
*             SASTSSNM(I)=SSCTSNAM; /* PUT NAME IN TABLE     @G29AN2F*/
         AL    @04,@TF00001                                        0182
         AL    @04,@CF01139                                        0182
         MVC   SASTSSNM(4,@04),SSCTSNAM(SSCTPTR)                   0182
*             I=I+1;                /* UP ARRAY INDEX        @G29AN2F*/
         AL    I,@CF00047                                          0183
*           END;                    /*                       @G29AN2F*/
*         SSCTPTR=SSCTSCTA;         /* GET NEXT SSCVT PTR    @G29AN2F*/
@RF00179 L     SSCTPTR,SSCTSCTA(,SSCTPTR)                          0185
*       END;                        /* END DD                @G29AN2F*/
@DE00178 LTR   SSCTPTR,SSCTPTR                                     0186
         BNZ   @DL00178                                            0186
*       SASTSSNM(I)=MSSNAME;        /* PUT MASTER IN LAST ELEMENT IN
*                                      TABLE                 @G29AN2F*/
         LR    @10,I                                               0187
         MH    @10,@CH00145                                        0187
         L     @07,CVTPTR                                          0187
         L     @07,CVTJESCT(,@07)                                  0187
         L     @07,JESSASTA(,@07)                                  0187
         ALR   @10,@07                                             0187
         AL    @10,@CF01140                                        0187
         MVC   SASTSSNM(4,@10),@CC00064                            0187
*       JSASTTCT=NUMSUBS;           /* SET NO OF ENTRIES     @G29AN2F*/
         STH   NUMSUBS,JSASTTCT(,@07)                              0188
*     END;                          /* OF SU29 PROCESSING    @G29ANSS*/
*   RETURN;                         /* PROCESSING IS COMPLETE      0190
*                                                            @G29ANSS*/
@EL00001 L     @13,4(,@13)                                         0190
@EF00001 L     @00,@SIZDATD                                        0190
         LR    @01,@11                                             0190
         FREEMAIN R,LV=(0),A=(1)
@ER00001 LM    @14,@12,12(@13)                                     0190
         BR    @14                                                 0190
         EJECT
*                                                                  0191
*/********************************************************************/
*/*                                                          @G29ANSS*/
*/* PROCEDURE - SCANSSCT                                     @G29ANSS*/
*/*                                                          @G29ANSS*/
*/* FUNCTION  - SCAN THE SSCVT CHAIN SEARCHING FOR A         @G29ANSS*/
*/*             SUBSYSTEM NAME WHICH MATCHES THE NAME PASSED @G29ANSS*/
*/*             TO THIS ROUTINE.                             @G29ANSS*/
*/*                                                          @G29ANSS*/
*/* OPERATION - SCAN SSCVT CHAIN SEARCHING FOR A MATCH. IF   @G29ANSS*/
*/*             FOUND THEN SET DUPSW ON AND RETURN.          @G29ANSS*/
*/*                                                          @G29ANSS*/
*/* INPUT     - JESSSCT: ADDRESS OF THE 1ST SSCVT            @G29ANSS*/
*/*             NAMESS : NAME OF SUBSYSTEM SEARCHING FOR     @G29ANSS*/
*/*                                                          @G29ANSS*/
*/* OUTPUT    - DUPSW  : ON IF A MATCH IS FOUND,             @G29ANSS*/
*/*                      OFF OTHERWISE                       @G29ANSS*/
*/*                                                          @G29ANSS*/
*/********************************************************************/
*                                                                  0191
*SCANSSCT:                                                         0191
*   PROC(NAMESS) OPTIONS(NOSAVE,NOSAVEAREA);/*               @G29ANSS*/
         B     @EL00001                                            0191
SCANSSCT MVC   @PC00002(4),0(@01)                                  0191
*   DCL                                                            0192
*     NAMESS CHAR(4);               /* NAME OF SUBSYSTEM FOR WHICH A
*                                      DUPLICATE IS TO BE FOUND.   0192
*                                                            @G29ANSS*/
*   DUPSW=OFF;                      /* NO DUPLICATES FOUND YET     0193
*                                                            @G29ANSS*/
         NI    DUPSW,B'01111111'                                   0193
*   SSCTPTR=JESSSCT;                /* BEGINNING OF SSCT CHAIN     0194
*                                                            @G29ANSS*/
         L     @10,CVTPTR                                          0194
         L     @10,CVTJESCT(,@10)                                  0194
         L     SSCTPTR,JESSSCT(,@10)                               0194
*   DO WHILE(DUPSW=OFF&SSCTPTR^=ZERO);/* LOOP UNTIL A DUPLICATE IS 0195
*                                      FOUND OR THE END OF THE     0195
*                                      SSCVT'S IS REACHED.   @G29ANSS*/
         B     @DE00195                                            0195
@DL00195 DS    0H                                                  0196
*     IF NAMESS=SSCTSNAM THEN       /* DUPLICATE SUBSYSTEM NAME?   0196
*                                                            @G29ANSS*/
         L     @10,@PC00002                                        0196
         CLC   NAMESS(4,@10),SSCTSNAM(SSCTPTR)                     0196
         BNE   @RF00196                                            0196
*       DUPSW=ON;                   /* YES, STOP LOOPING     @G29ANSS*/
         OI    DUPSW,B'10000000'                                   0197
*     ELSE                          /* NO, DUPLICATE NAME    @G29ANSS*/
*       SSCTPTR=SSCTSCTA;           /* POINT TO NEXT SSCVT   @G29ANSS*/
         B     @RC00196                                            0198
@RF00196 L     SSCTPTR,SSCTSCTA(,SSCTPTR)                          0198
*   END;                            /* OF DO WHILE           @G29ANSS*/
@RC00196 DS    0H                                                  0199
@DE00195 TM    DUPSW,B'10000000'                                   0199
         BNZ   @DC00195                                            0199
         LTR   SSCTPTR,SSCTPTR                                     0199
         BNZ   @DL00195                                            0199
@DC00195 DS    0H                                                  0200
*   END SCANSSCT;                   /*                       @G29ANSS*/
@EL00002 DS    0H                                                  0200
@EF00002 DS    0H                                                  0200
@ER00002 BR    @14                                                 0200
         EJECT
*                                                                  0201
*/********************************************************************/
*/*                                                          @G29ANSS*/
*/* PROCEDURE - BLDSSCVT                                     @G29ANSS*/
*/*                                                          @G29ANSS*/
*/* FUNCTION  - BUILD AN SSCVT FOR THE SUBSYSTEM NAME PASSED @G29ANSS*/
*/*             AS A PARAMETER.                              @G29ANSS*/
*/*                                                          @G29ANSS*/
*/* OPERATION - . GETMAIN STORAGE FOR THE SSCVT FROM         @G29ANSS*/
*/*               SUBPOOL 241.                               @G29ANSS*/
*/*             . CHAIN TO THE PREVIOUS SSCVT OR JESCT       @G29ANSS*/
*/*             . IF THE SUBSYSTEM IS THE MASTER'S THEN CALL @G29ANSS*/
*/*               BLDMSSVT TO BUILD AND INITIALIZE AN SSVT.  @G29ANSS*/
*/*                                                          @G29ANSS*/
*/* INPUT     - NAMESUBS: PARAMETER PASSED BY CALLING        @G29ANSS*/
*/*             ROUTINE. CONTAINS NAME OF SUBSYSTEM FOR      @G29ANSS*/
*/*             WHICH A SSCVT IS TO BE BUILT.                @G29ANSS*/
*/*                                                          @G29ANSS*/
*/* OUTPUT    - SSCVT IS CHAINED TO PREVIOUS SSCVT OR JESCT  @G29ANSS*/
*/*             SSCTOLD: PTR TO LAST SSCVT IN CHAIN.         @G29ANSS*/
*/*             NUMSUBS: NUMBER OF SSCVT'S CHAINED.          @G29ANSS*/
*/*                                                          @G29ANSS*/
*/********************************************************************/
*                                                                  0201
*BLDSSCVT:                                                         0201
*   PROC(NAMESUBS) OPTIONS(SAVE,SAVEAREA);/*                 @G29ANSS*/
BLDSSCVT STM   @14,@05,12(@13)                                     0201
         STM   @08,@12,52(@13)                                     0201
         ST    @13,@SA00003+4                                      0201
         LA    @14,@SA00003                                        0201
         ST    @14,8(,@13)                                         0201
         LR    @13,@14                                             0201
         MVC   @PC00003(4),0(@01)                                  0201
*   DCL                                                            0202
*     NAMESUBS CHAR(4);             /* NAME OF SUBSYSTEM FOR WHICH AN
*                                      SSCVT IS TO BE BUILT. @G29ANSS*/
*   RESPECIFY                                                      0203
*    (R0,                                                          0203
*     R1) RESTRICTED;                                              0203
*   R0=LENGTH(SSCT);                /* CALCULATE SSCVT LENGTH        */
         LA    R0,24                                               0204
*   R0=R0×'F1000000'X;              /* SET SUBPOOL NUMBER            */
         O     R0,@CF01108                                         0205
*   GEN(GETMAIN R,LV=(R0));         /* GET SSCVT CORE                */
         GETMAIN R,LV=(R0)
*   SSCTPTR=R1;                     /* SET POINTER TO SSCVT          */
         LR    SSCTPTR,R1                                          0207
*   RESPECIFY                                                      0208
*    (R0,                                                          0208
*     R1) UNRESTRICTED;                                            0208
*   SSCT=SSCT&&SSCT;                /* CLEAR SSCVT CORE              */
         XC    SSCT(24,SSCTPTR),SSCT(SSCTPTR)                      0209
*   NUMSUBS=NUMSUBS+1;              /* INCREMENT COUNT OF DEFINED  0210
*                                      SUBSYSTEMS            @G29AN2F*/
         AL    NUMSUBS,@CF00047                                    0210
*   IF NAMESUBS=JESPJESN THEN       /* IF PROCESSING FOR PRIMARY JOB
*                                      ENTRY SUBSYSTEM SSCVT @G29ANSS*/
         L     @10,@PC00003                                        0211
         L     @02,CVTPTR                                          0211
         L     @02,CVTJESCT(,@02)                                  0211
         CLC   NAMESUBS(4,@10),JESPJESN(@02)                       0211
         BNE   @RF00211                                            0211
*     JESSSCT=SSCTPTR;              /* THEN INITIALIZE JESCT PTR TO
*                                      SSCVT CHAIN                   */
         ST    SSCTPTR,JESSSCT(,@02)                               0212
*   ELSE                            /* OTHERWISE -CHAIN THIS SSCVT   */
*     SSCTOLD->SSCTSCTA=SSCTPTR;    /* TO PREVIOUS SSCVT             */
         B     @RC00211                                            0213
@RF00211 ST    SSCTPTR,SSCTSCTA(,SSCTOLD)                          0213
*   SSCTOLD=SSCTPTR;                /* SAVE SSCVT POINTER            */
@RC00211 LR    SSCTOLD,SSCTPTR                                     0214
*   SSCTID=SSCVTID;                 /* SET SSCVT IDENTIFIER          */
         MVC   SSCTID(4,SSCTPTR),@CC00068                          0215
*   SSCTSNAM=NAMESUBS;              /* SET SUBSYSTEM NAME    @G29ANSS*/
         L     @10,@PC00003                                        0216
         MVC   SSCTSNAM(4,SSCTPTR),NAMESUBS(@10)                   0216
*   IF NAMESUBS=MSSNAME THEN        /* IF PROCESSING FOR MASTER    0217
*                                      SUBSYSTEM THEN CREATE AND   0217
*                                      INITIALIZE THE MASTER       0217
*                                      SUBSYSTEM VECTOR TABLE      0217
*                                                            @G29ANSS*/
         CLC   NAMESUBS(4,@10),@CC00064                            0217
         BNE   @RF00217                                            0217
*     CALL BLDMSSVT;                /*                       @G29ANSS*/
         BAL   @14,BLDMSSVT                                        0218
*   END BLDSSCVT;                   /*                       @G29ANSS*/
@EL00003 L     @13,4(,@13)                                         0219
@EF00003 DS    0H                                                  0219
@ER00003 LM    @14,@05,12(@13)                                     0219
         LM    @08,@12,52(@13)                                     0219
         BR    @14                                                 0219
         EJECT
*                                                                  0220
*/********************************************************************/
*/*                                                                  */
*/* PROCEDURE - BLDMSSVT                                     @G29ANSS*/
*/*                                                                  */
*/* FUNCTION  - CREATE AND INITIALIZE THE MASTER SUBSYSTEM   @G29ANSS*/
*/*             VECTOR TABLE(SSVT).                          @G29ANSS*/
*/*                                                          @G29ANSS*/
*/* OPERATION - . GETMAIN THE MASTER SUBSYSTEM VECTOR TABLE  @G29ANSS*/
*/*               FROM SUBPOOL 241.                          @G29ANSS*/
*/*             . INITIALIZE THE SSVT:                       @G29ANSS*/
*/*               .SET SSVT POINTER IN SSCVT                         */
*/*               .NUMBER OF FUNCTIONS SUPPORTED                     */
*/*               .POINTERS TO FUNCTION ROUTINES                     */
*/*               .FUNCTION MATRIX                                   */
*/*                                                                  */
*/* INPUT     - SSCVT(MASTER'S)                              @G29ANSS*/
*/*                                                          @G29ANSS*/
*/* OUTPUT    - SSVT(MASTER'S INITIALIZED)                   @G29ANSS*/
*/*                                                          @G29ANSS*/
*/********************************************************************/
*                                                                  0220
*BLDMSSVT:                                                         0220
*   PROC OPTIONS(SAVE,SAVEAREA);    /*                       @G29ANSS*/
*                                                                  0220
BLDMSSVT STM   @14,@12,12(@13)                                     0220
         ST    @13,@SA00004+4                                      0220
         LA    @14,@SA00004                                        0220
         ST    @14,8(,@13)                                         0220
         LR    @13,@14                                             0220
*   /*****************************************************************/
*   /*                                                               */
*   /* CALCULATE MASTER SUBSYSTEM VECTOR TABLE SIZE: SSVT FIXED AREA */
*   /* SIZE PLUS NUMBER OF 'FUNCTION ROUTINE POINTER' FIELDS * 4.    */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0221
*   RESPECIFY                                                      0221
*    (R6,                                                          0221
*     R0,                                                          0221
*     R1) RESTRICTED;                                              0221
*   R0=LENGTH(SSVTFSIZ)+MSSFUNC*4;                                 0222
         LA    R0,284                                              0222
*   R6=R0;                          /* SAVE SSVT LENGTH              */
         LR    R6,R0                                               0223
*   R0=R0×'F1000000'X;              /* SET SUBPOOL NUMBER            */
         O     R0,@CF01108                                         0224
*   GEN(GETMAIN R,LV=(R0));         /* GET MASTER SSVT               */
         GETMAIN R,LV=(R0)
*   SSCTSSVT=R1;                    /* SET SSVT POINTER IN SSCVT     */
         ST    R1,SSCTSSVT(,SSCTPTR)                               0226
*/********************************************************************/
*/*            FOLLOWING ROUTINE CLEARS GOTTEN CORE:                 */
*/*              INPUT:  R1 - BEGINNING ADDRESS OF AREA              */
*/*                           TO BE CLEARED                          */
*/*                      R6 - LENGTH OF AREA TO BE CLEARED           */
*/********************************************************************/
*                                                                  0227
*   DO WHILE(R6>256);                                              0227
*                                                                  0227
         B     @DE00227                                            0227
@DL00227 DS    0H                                                  0228
*     /***************************************************************/
*     /*                                                             */
*     /* CLEAR 256 BYTES                                             */
*     /*                                                             */
*     /***************************************************************/
*                                                                  0228
*     CORAREA(1:256)=CORAREA(1:256)&&CORAREA(1:256);               0228
         XC    CORAREA(256,R1),CORAREA(R1)                         0228
*     R6=R6-256;                    /* DECREASE LENGTH OF AREA TO BE
*                                      CLEARED                       */
         LA    @10,256                                             0229
         SLR   R6,@10                                              0229
*     R1=R1+256;                    /* BUMP PTR TO AREA TO BE CLEARED*/
         ALR   R1,@10                                              0230
*   END;                                                           0231
*                                                                  0231
@DE00227 C     R6,@CF00082                                         0231
         BH    @DL00227                                            0231
*   /*****************************************************************/
*   /*                                                               */
*   /* CLEAR REMAINING CORE                                          */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0232
*   CORAREA(1:R6)=CORAREA(1:R6)&&CORAREA(1:R6);                    0232
         LR    @10,R6                                              0232
         BCTR  @10,0                                               0232
         EX    @10,@SX01143                                        0232
*   RESPECIFY                                                      0233
*    (R6,                                                          0233
*     R0,                                                          0233
*     R1) UNRESTRICTED;                                            0233
*   SSVTFNUM=MSSFUNC;               /* SET NUMBER OF FUNCTIONS     0234
*                                      SUPPORTED BY MASTER SUBSYSTEM */
         L     @10,SSCTSSVT(,SSCTPTR)                              0234
         MVC   SSVTFNUM(2,@10),@CH00072                            0234
         EJECT
*                                                                  0235
*/********************************************************************/
*/*                SET UP ARGUMENT LIST FOR CALLING ROUTINE THAT     */
*/*                INITIALIZES SSVT FUNCTION MATRIX AND FUNCTION     */
*/*                ROUTINE POINTERS -                                */
*/*                                                                  */
*/*                  ARGUMENT 1 - FUNCTION ROUTINE NAME TO BE LOADED */
*/*                  ARGUMENT 2 - FUNCTION BYTE VALUE (STORED IN SSVT*/
*/*                               FUNCTION MATRIX AND USED AS        */
*/*                               SUBSCRIPT TO FUNCTION ROUTINE PTR) */
*/*                                                                  */
*/*                  ARGUMENT 3 - NUMBER OF ARRAY ELEMENTS PASSED    */
*/*                  ARGUMENT 4 - ARRAY OF SSOB FUNCTION CODES FOR   */
*/*                               THIS MASTER SUBSYSTEM FUNCTION     */
*/*                                                                  */
*/********************************************************************/
*                                                                  0235
*   /*****************************************************************/
*   /*                                                               */
*   /* **** SUBSYSTEM JOB SELECT FUNCTION -                          */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0235
*   FUNCRTNA='IEFJSUBI';            /* SET FUNCTION ROUTINE NAME     */
         MVC   FUNCRTNA(8),@CC01113                                0235
*   FVALUEA=1;                      /* SET FUNCTION BYTE VALUE       */
         MVI   FVALUEA,X'01'                                       0236
*   ARAYSIZA=1;                     /* SET ARRAY SIZE                */
         MVI   ARAYSIZA,X'01'                                      0237
*   FCODEA(1)=SSOBJBSL;             /* SET FUNCTION CODE             */
         MVC   FCODEA(2),@CH00104                                  0238
*   CALL SSVTINIT(FUNCRTNA,FVALUEA,ARAYSIZA,FCODEA);               0239
*                                                                  0239
         LA    @10,FUNCRTNA                                        0239
         ST    @10,@AL00001                                        0239
         LA    @10,FVALUEA                                         0239
         ST    @10,@AL00001+4                                      0239
         LA    @10,ARAYSIZA                                        0239
         ST    @10,@AL00001+8                                      0239
         LA    @10,FCODEA                                          0239
         ST    @10,@AL00001+12                                     0239
         LA    @01,@AL00001                                        0239
         BAL   @14,SSVTINIT                                        0239
*   /*****************************************************************/
*   /*                                                               */
*   /* **** DATA SET NAME CREATION FUNCTION -                        */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0240
*   FUNCRTNA='IEFJDSNA';                                           0240
         MVC   FUNCRTNA(8),@CC01115                                0240
*   FVALUEA=2;                                                     0241
         MVI   FVALUEA,X'02'                                       0241
*   ARAYSIZA=1;                                                    0242
         MVI   ARAYSIZA,X'01'                                      0242
*   FCODEA(1)=SSOBALOC;                                            0243
         MVC   FCODEA(2),@CH00072                                  0243
*   CALL SSVTINIT(FUNCRTNA,FVALUEA,ARAYSIZA,FCODEA);               0244
*                                                                  0244
         LA    @10,FUNCRTNA                                        0244
         ST    @10,@AL00001                                        0244
         LA    @10,FVALUEA                                         0244
         ST    @10,@AL00001+4                                      0244
         LA    @10,ARAYSIZA                                        0244
         ST    @10,@AL00001+8                                      0244
         LA    @10,FCODEA                                          0244
         ST    @10,@AL00001+12                                     0244
         LA    @01,@AL00001                                        0244
         BAL   @14,SSVTINIT                                        0244
*   /*****************************************************************/
*   /*                                                               */
*   /* **** SUBSYSTEM DETERMINATION FUNCTION                         */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0245
*   FUNCRTNA='IEFJSDTN';                                           0245
         MVC   FUNCRTNA(8),@CC01116                                0245
*   FVALUEA=3;                                                     0246
         MVI   FVALUEA,X'03'                                       0246
*   ARAYSIZA=1;                                                    0247
         MVI   ARAYSIZA,X'01'                                      0247
*   FCODEA(1)=SSOBVERS;                                            0248
         MVC   FCODEA(2),@CH00042                                  0248
*   CALL SSVTINIT(FUNCRTNA,FVALUEA,ARAYSIZA,FCODEA);               0249
         LA    @10,FUNCRTNA                                        0249
         ST    @10,@AL00001                                        0249
         LA    @10,FVALUEA                                         0249
         ST    @10,@AL00001+4                                      0249
         LA    @10,ARAYSIZA                                        0249
         ST    @10,@AL00001+8                                      0249
         LA    @10,FCODEA                                          0249
         ST    @10,@AL00001+12                                     0249
         LA    @01,@AL00001                                        0249
         BAL   @14,SSVTINIT                                        0249
*                                                                  0250
*   /*****************************************************************/
*   /*                                                               */
*   /* **** ROUTE TO ALL ACTIVE JOB ENTRY **** SUBSYSTEMS FUNCTIONS  */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0250
*   FUNCRTNA='IEFJRASP';                                           0250
         MVC   FUNCRTNA(8),@CC01117                                0250
*   FVALUEA=4;                                                     0251
         MVI   FVALUEA,X'04'                                       0251
*   ARAYSIZA=6;                     /*                       @Z30BPSV*/
         MVI   ARAYSIZA,X'06'                                      0252
*   FCODEA(1)=SSOBEOM;                                             0253
         MVC   FCODEA(2),@CH00070                                  0253
*   FCODEA(2)=SSOBWTO;                                             0254
         MVC   FCODEA+2(2),@CH00188                                0254
*   FCODEA(3)=SSOBCMND;                                            0255
         MVC   FCODEA+4(2),@CH00202                                0255
*   FCODEA(4)=SSOBDOM;                                             0256
         MVC   FCODEA+6(2),@CH00227                                0256
*   FCODEA(5)=SSOBEOT;              /*                       @Z30BPSV*/
         MVC   FCODEA+8(2),@CH00063                                0257
*   FCODEA(6)=SSOBCFCD;             /*                       @Z30BPSV*/
         MVC   FCODEA+10(2),@CH00099                               0258
*   CALL SSVTINIT(FUNCRTNA,FVALUEA,ARAYSIZA,FCODEA);               0259
*                                                                  0259
         LA    @10,FUNCRTNA                                        0259
         ST    @10,@AL00001                                        0259
         LA    @10,FVALUEA                                         0259
         ST    @10,@AL00001+4                                      0259
         LA    @10,ARAYSIZA                                        0259
         ST    @10,@AL00001+8                                      0259
         LA    @10,FCODEA                                          0259
         ST    @10,@AL00001+12                                     0259
         LA    @01,@AL00001                                        0259
         BAL   @14,SSVTINIT                                        0259
*   /*****************************************************************/
*   /*                                                               */
*   /* **** JOB DELETE FUNCTION -                                    */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0260
*   FUNCRTNA='IEFJJTRM';                                           0260
         MVC   FUNCRTNA(8),@CC01118                                0260
*   FVALUEA=5;                                                     0261
         MVI   FVALUEA,X'05'                                       0261
*   ARAYSIZA=1;                                                    0262
         MVI   ARAYSIZA,X'01'                                      0262
*   FCODEA(1)=SSOBTERM;                                            0263
         MVC   FCODEA(2),@CH00145                                  0263
*   CALL SSVTINIT(FUNCRTNA,FVALUEA,ARAYSIZA,FCODEA);               0264
*                                                                  0264
         LA    @10,FUNCRTNA                                        0264
         ST    @10,@AL00001                                        0264
         LA    @10,FVALUEA                                         0264
         ST    @10,@AL00001+4                                      0264
         LA    @10,ARAYSIZA                                        0264
         ST    @10,@AL00001+8                                      0264
         LA    @10,FCODEA                                          0264
         ST    @10,@AL00001+12                                     0264
         LA    @01,@AL00001                                        0264
         BAL   @14,SSVTINIT                                        0264
*/********************************************************************/
*/*                IF ADDITIONAL MASTER SUBSYSTEM FUNCTIONS          */
*/*                ARE DEFINED:                                      */
*/*                  - INITIALIZE THE ARGUMENTS DEFINED ABOVE.       */
*/*                                                                  */
*/*                IF AN EXISTING MASTER SUBSYSTEM FUNCTION          */
*/*                IS EXPANDED:                                      */
*/*                  - INCREASE ARAYSIZA BY THE NUMBER OF ADDITIONAL */
*/*                    SSOB FUNCTIONS BEING SUPPORTED.               */
*/*                  - INITIALIZE FCODEA ENTRIES WITH THE SSOB       */
*/*                    EXTENSION ID CONSTANTS FOR THE ADDITIONAL     */
*/*                    SSOB FUNCTIONS BEING SUPPORTED.               */
*/*                   -CHECK IF DIMENSION IN DCL FOR                 */
*/*                    FCODE SHOULD BE INCREASED.                    */
*/********************************************************************/
*                                                                  0265
*   END BLDMSSVT;                   /*                       @G29ANSS*/
@EL00004 L     @13,4(,@13)                                         0265
@EF00004 DS    0H                                                  0265
@ER00004 LM    @14,@12,12(@13)                                     0265
         BR    @14                                                 0265
         EJECT
*SSVTINIT:                                                         0266
*   PROCEDURE(FUNCRTNP,FVALUEP,ARAYSIZP,FCODEP) OPTIONS(NOSAVEAREA);
*                                                                  0266
SSVTINIT STM   @14,@12,12(@13)                                     0266
         MVC   @PC00005(16),0(@01)                                 0266
*/*   PROCEDURE TO INITIALIZE SSVT FUNCTION MATRIX AND FUNCTION      */
*/*   ROUTINE POINTERS -                                             */
*/*   SSVTINIT INPUT PARAMETERS                                      */
*                                                                  0267
*   DCL                                                            0267
*     FUNCRTNP CHAR(8);             /* FUNCTION ROUTINE NAME         */
*   DCL                                                            0268
*     FVALUEP PTR(8);               /* FUNCTION BYTE VALUE           */
*   DCL                                                            0269
*     ARAYSIZP PTR(8);              /* NUMBER OF ARRAY ELEMENTS      */
*   DCL                                                            0270
*     FCODEP(*) FIXED(15);          /* FUNCTION CODE ARGUMENT ARRAY  */
*   RESPECIFY                                                      0271
*    (R7,                                                          0271
*     R0PTR) RESTRICTED;                                           0271
*   R7=ADDR(FUNCRTNP);              /* SET FUNCTION ROUTINE ADDRESS  */
         L     R7,@PC00005                                         0272
*   GEN(LOAD EPLOC=(R7));           /* LOAD FUNCTION ROUTINE         */
         LOAD EPLOC=(R7)
*   SSVTFRTN(FVALUEP)=R0PTR;        /* SET ROUTINE ADDRESS IN SSVT   */
         L     @10,@PC00005+4                                      0274
         SLR   @06,@06                                             0274
         IC    @06,FVALUEP(,@10)                                   0274
         SLA   @06,2                                               0274
         L     @01,SSCTSSVT(,SSCTPTR)                              0274
         ST    R0PTR,SSVTFRTN-4(@06,@01)                           0274
*   GEN(DELETE EPLOC=(R7));         /* DELETE FUNCTION ROUTINE       */
*                                                                  0275
         DELETE EPLOC=(R7)
*   /*****************************************************************/
*   /*                                                               */
*   /* INITIALIZE SSVT FUNCTION CODE MATRIX - SSOB FUNCTION ID IS    */
*   /* USED AS SUBSCRIPT INTO FUNCTION MATRIX                        */
*   /*                                                               */
*   /*****************************************************************/
*                                                                  0276
*   DO R7=1 TO ARAYSIZP;                                           0276
         LA    R7,1                                                0276
         B     @DE00276                                            0276
@DL00276 DS    0H                                                  0277
*     SSVTFCOD(FCODEP(R7))=FVALUEP;                                0277
         LR    @10,R7                                              0277
         ALR   @10,@10                                             0277
         L     @06,@PC00005+12                                     0277
         BCTR  @06,0                                               0277
         BCTR  @06,0                                               0277
         LH    @01,FCODEP(@10,@06)                                 0277
         L     @10,SSCTSSVT(,SSCTPTR)                              0277
         L     @06,@PC00005+4                                      0277
         SLR   @02,@02                                             0277
         IC    @02,FVALUEP(,@06)                                   0277
         STC   @02,SSVTFCOD-1(@01,@10)                             0277
*   END;                                                           0278
         AL    R7,@CF00047                                         0278
@DE00276 L     @10,@PC00005+8                                      0278
         SLR   @06,@06                                             0278
         IC    @06,ARAYSIZP(,@10)                                  0278
         CR    R7,@06                                              0278
         BNH   @DL00276                                            0278
*   RESPECIFY                                                      0279
*    (R7,                                                          0279
*     R0PTR) UNRESTRICTED;                                         0279
*   END SSVTINIT;                                                  0280
@EL00005 DS    0H                                                  0280
@EF00005 DS    0H                                                  0280
@ER00005 LM    @14,@12,12(@13)                                     0280
         BR    @14                                                 0280
         EJECT
*   DECLARE                         /* GENERAL PURPOSE REGISTERS     */
*     GPR00F FIXED(31) REG(0),                                     0281
*     GPR01F FIXED(31) REG(1),                                     0281
*     GPR15F FIXED(31) REG(15),                                    0281
*     GPR00P PTR(31) REG(0),                                       0281
*     GPR01P PTR(31) REG(1);                                       0281
*   DECLARE                         /* COMMON VARIABLES              */
*     I256C CHAR(256) BASED,                                       0282
*     I031F FIXED(31) BASED,                                       0282
*     I031P PTR(31) BASED,                                         0282
*     I015F FIXED(15) BASED,                                       0282
*     I015P PTR(15) BASED,                                         0282
*     I008P PTR(8) BASED,                                          0282
*     I001C CHAR(1) BASED;          /*                       @G29AN2F*/
*   END IEFJSINT                                                   0283
*                                                                  0283
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */
*/*%INCLUDE SYSLIB  (IEFJSSOB)                                       */
*/*%INCLUDE SYSLIB  (CVT     )                                       */
*/*%INCLUDE SYSLIB  (IEFJESCT)                                       */
*/*%INCLUDE SYSLIB  (IEFJSAST)                                       */
*/*%INCLUDE SYSLIB  (IEFJSCVT)                                       */
*/*%INCLUDE SYSLIB  (IEFJSSVT)                                       */
*/*%INCLUDE SYSLIB  (IHASUBIT)                                       */
*                                                                  0283
*       ;                                                          0283
@DATA    DS    0H
@CH00104 DC    H'5'
@CH00072 DC    H'6'
@CH00070 DC    H'8'
@CH00188 DC    H'9'
@CH00202 DC    H'10'
@CH00145 DC    H'12'
@CH00227 DC    H'14'
@CH00042 DC    H'15'
@CH00099 DC    H'32'
@CH00087 DC    H'60'
@SX01143 XC    CORAREA(0,R1),CORAREA(R1)
@DATD    DSECT
         DS    0F
@SA00001 DS    18F
@PC00002 DS    1F
@SA00003 DS    18F
@PC00003 DS    1F
@SA00004 DS    18F
@PC00005 DS    4F
@AL00001 DS    4A
@TF00001 DS    F
IEFJSINT CSECT
         DS    0F
@CF00047 DC    F'1'
@CH00047 EQU   @CF00047+2
@CF00063 DC    F'4'
@CH00063 EQU   @CF00063+2
@CF00092 DC    F'80'
@CF00082 DC    F'256'
@CF01139 DC    F'-12'
@CF01140 DC    F'-4'
@CF01088 DC    XL4'80000000'
@CF01108 DC    XL4'F1000000'
@DATD    DSECT
         DS    0D
FVALUEA  DS    AL1
ARAYSIZA DS    AL1
DUPSW    DS    BL1
FUNCRTNA DS    CL8
         DS    CL1
BLDLLIST DS    CL64
         ORG   BLDLLIST
BLDLNUM  DS    FL2
BLDLLEN  DS    FL2
BLDLENTR DS    CL60
         ORG   BLDLENTR
BLDLNAME DS    CL8
BLDLDATA DS    CL52
         ORG   BLDLLIST+64
FCODEA   DS    6H
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA
@ENDDATD EQU   *
IEFJSINT CSECT
         DS    0F
@SIZDATD DC    AL1(0)
         DC    AL3(@ENDDATD-@DATD)
@CV00079 DC    V(IEFJTBNM)
         DS    0D
@CC00102 DC    C'IEFJSSNT'
@CC01113 DC    C'IEFJSUBI'
@CC01115 DC    C'IEFJDSNA'
@CC01116 DC    C'IEFJSDTN'
@CC01117 DC    C'IEFJRASP'
@CC01118 DC    C'IEFJJTRM'
@CC00064 DC    C'MSTR'
@CC00066 DC    C'SAST'
@CC00068 DC    C'SSCT'
@CB00100 DC    X'FFFFFFFF'
@CB01082 DC    X'00000000'
SSIPATCH DC    CL64'*** IEFJSINT PATCH AREA ***'
@00      EQU   00                      EQUATES FOR REGISTERS 0-15
@01      EQU   01
@02      EQU   02
@03      EQU   03
@04      EQU   04
@05      EQU   05
@06      EQU   06
@07      EQU   07
@08      EQU   08
@09      EQU   09
@10      EQU   10
@11      EQU   11
@12      EQU   12
@13      EQU   13
@14      EQU   14
@15      EQU   15
JSSNTPTR EQU   @05
JESTBPTR EQU   @02
SSCTOLD  EQU   @07
SSCTPTR  EQU   @03
TBLSIZE  EQU   @03
NUMSUBS  EQU   @06
I        EQU   @05
R0PTR    EQU   @00
R0       EQU   @00
R1       EQU   @01
R6       EQU   @06
R7       EQU   @07
R15      EQU   @15
GPR00P   EQU   @00
GPR01P   EQU   @01
GPR15F   EQU   @15
GPR01F   EQU   @01
GPR00F   EQU   @00
CVTPTR   EQU   16
TBLENTRY EQU   0
CORAREA  EQU   0
JSSNTENT EQU   0
JSSNTNAM EQU   JSSNTENT
SSJS     EQU   0
SSJSFLG1 EQU   SSJS+6
SSJSPASS EQU   SSJS+40
SSJSPAS2 EQU   SSJS+49
SSAL     EQU   0
SSALFLG1 EQU   SSAL+2
SSEN     EQU   0
SSENFLAG EQU   SSEN+6
SSWT     EQU   0
SSCM     EQU   0
SSJT     EQU   0
SSJTFLG1 EQU   SSJT+2
SSDM     EQU   0
SSVS     EQU   0
SSVSFLG1 EQU   SSVS+2
SSET     EQU   0
SSETFLAG EQU   SSET+6
SSCF     EQU   0
CVTMAP   EQU   0
CVTDAR   EQU   CVTMAP+72
CVTFLGS1 EQU   CVTDAR
CVTDCB   EQU   CVTMAP+116
CVTIERLC EQU   CVTMAP+144
CVTOPTA  EQU   CVTMAP+182
CVTOPTB  EQU   CVTMAP+183
CVTGTF   EQU   CVTMAP+236
CVTGTFST EQU   CVTGTF
CVTGTFS  EQU   CVTGTFST
CVTSTATE EQU   CVTGTFST
CVTTMODE EQU   CVTGTFST
CVTFORM  EQU   CVTGTFST
CVTAQAVT EQU   CVTMAP+240
CVTTCMFG EQU   CVTAQAVT
CVTVOLM2 EQU   CVTMAP+244
CVTTATA  EQU   CVTVOLM2
CVTTSKS  EQU   CVTTATA
CVTVOLF2 EQU   CVTTSKS
CVTTAT   EQU   CVTTATA+1
CVTATER  EQU   CVTMAP+248
CVTEXT1  EQU   CVTMAP+252
CVTPURG  EQU   CVTMAP+260
CVTQMSG  EQU   CVTMAP+268
CVTDMSR  EQU   CVTMAP+272
CVTRSV37 EQU   CVTDMSR
CVTDMSRF EQU   CVTRSV37
CVTJESCT EQU   CVTMAP+296
CVTERPV  EQU   CVTMAP+316
CVTINTLA EQU   CVTMAP+320
CVTAPF   EQU   CVTMAP+324
CVTEXT2  EQU   CVTMAP+328
CVTHJES  EQU   CVTMAP+332
CVTPGSIA EQU   CVTMAP+348
CVTA1F1  EQU   CVTMAP+356
CVTSYSK  EQU   CVTMAP+357
CVTVOLM1 EQU   CVTMAP+380
CVTVOLF1 EQU   CVTVOLM1
CVTATMCT EQU   CVTMAP+388
CVTXTNT1 EQU   0
CVTXTNT2 EQU   0
CVTDSSV  EQU   CVTXTNT2
CVTFLGBT EQU   CVTXTNT2+5
CVTQID   EQU   CVTXTNT2+24
CVTRV400 EQU   CVTXTNT2+52
CVTRV409 EQU   CVTXTNT2+53
CVTATCVT EQU   CVTXTNT2+64
CVTRV429 EQU   CVTXTNT2+84
CVTRV438 EQU   CVTXTNT2+85
CVTRV457 EQU   CVTXTNT2+112
CVTRV466 EQU   CVTXTNT2+113
CVTFIX   EQU   0
CVTRELNO EQU   CVTFIX+252
JESCT    EQU   0
JESWAA   EQU   JESCT+8
JESSSREQ EQU   JESCT+20
JESSSCT  EQU   JESCT+24
JESPJESN EQU   JESCT+28
JESALLOC EQU   JESCT+32
JESUNALC EQU   JESCT+36
JESCATL  EQU   JESCT+40
JESSASTA EQU   JESCT+48
SASTTBLE EQU   0
SASTENRY EQU   SASTTBLE
SASTSSNM EQU   SASTENRY
JSAST    EQU   0
JSASTHDR EQU   JSAST
JSASTID  EQU   JSASTHDR
JSASTTBS EQU   JSASTHDR+4
JSASTTCT EQU   JSASTHDR+6
JSASTTBL EQU   JSAST+8
SSCT     EQU   0
SSCTID   EQU   SSCT
SSCTSCTA EQU   SSCT+4
SSCTSNAM EQU   SSCT+8
SSCTFLG1 EQU   SSCT+12
SSCTSSVT EQU   SSCT+16
SSVT     EQU   0
SSVTFSIZ EQU   SSVT
SSVTFNUM EQU   SSVTFSIZ+2
SSVTFCOD EQU   SSVTFSIZ+4
SSVTFRTN EQU   SSVT+260
SUBITS   EQU   0
SUBYTE1  EQU   SUBITS
SUBYTE2  EQU   SUBITS+1
SUBYTE3  EQU   SUBITS+2
SUBYTE4  EQU   SUBITS+3
SU29BIT  EQU   SUBYTE4
SUBYTE5  EQU   SUBITS+4
SUBYTE6  EQU   SUBITS+5
SUBYTE7  EQU   SUBITS+6
SUBYTE8  EQU   SUBITS+7
SUBYTE9  EQU   SUBITS+8
SUBYTE10 EQU   SUBITS+9
SUBYTE11 EQU   SUBITS+10
SUBYTE12 EQU   SUBITS+11
SUBYTE13 EQU   SUBITS+12
IEFAB4F5 EQU   0
IEFBB410 EQU   0
IEFW21SD EQU   0
I001C    EQU   0
I008P    EQU   0
I015F    EQU   0
I015P    EQU   0
I031F    EQU   0
I031P    EQU   0
I256C    EQU   0
SSREQ    EQU   0
SWAMGR   EQU   0
NAMESS   EQU   0
NAMESUBS EQU   0
FUNCRTNP EQU   0
FVALUEP  EQU   0
ARAYSIZP EQU   0
FCODEP   EQU   0
CVTS01   EQU   CVTPGSIA
CVTLPDIA EQU   CVTS01+12
CVTDIRST EQU   CVTLPDIA
CVTSLIDA EQU   CVTS01+24
CVTCTLFG EQU   CVTS01+50
CVTRV210 EQU   CVTS01+424
CVTRV219 EQU   CVTS01+425
CVTRV228 EQU   CVTS01+426
CVTRV237 EQU   CVTS01+427
CVTMFRTR EQU   CVTS01+452
CVTRV262 EQU   CVTS01+468
CVTRV271 EQU   CVTS01+469
CVTRV280 EQU   CVTS01+470
CVTRV289 EQU   CVTS01+471
CVTGSDA  EQU   CVTS01+600
CVTIHASU EQU   CVTS01+696
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS
CVTRV628 EQU   CVTS01+728
CVTRV627 EQU   CVTS01+724
CVTRV626 EQU   CVTS01+720
CVTRV625 EQU   CVTS01+716
CVTRV624 EQU   CVTS01+712
CVTRV623 EQU   CVTS01+708
CVTRV622 EQU   CVTS01+704
CVTRV621 EQU   CVTS01+700
CVTSUSP  EQU   CVTS01+692
CVTT6SVC EQU   CVTS01+688
CVTCDAL  EQU   CVTS01+684
CVTTCTL  EQU   CVTS01+680
CVTRSUME EQU   CVTS01+676
CVTJTERM EQU   CVTS01+672
CVTASMRM EQU   CVTS01+668
CVTTCASP EQU   CVTS01+664
CVT0PT03 EQU   CVTS01+660
CVT0PT0E EQU   CVTS01+656
CVTRV609 EQU   CVTS01+652
CVTCGK   EQU   CVTS01+648
CVTRAC   EQU   CVTS01+644
CVTRV606 EQU   CVTS01+640
CVTRV605 EQU   CVTS01+636
CVTRV604 EQU   CVTS01+632
CVTEFF02 EQU   CVTS01+628
CVTCBBR  EQU   CVTS01+624
CVTSSCR  EQU   CVTS01+620
CVTEVENT EQU   CVTS01+616
CVTCRCA  EQU   CVTS01+612
CVTTPIO  EQU   CVTS01+608
CVTADV   EQU   CVTS01+604
CVTGSDAB EQU   CVTGSDA
CVTQV3   EQU   CVTS01+596
CVTQV2   EQU   CVTS01+592
CVTQV1   EQU   CVTS01+588
CVTRPT   EQU   CVTS01+584
CVTSSRB  EQU   CVTS01+580
CVTCSDRL EQU   CVTS01+576
CVTEXP1  EQU   CVTS01+572
CVTRMPMT EQU   CVTS01+568
CVTRMPTT EQU   CVTS01+564
CVTVPSA  EQU   CVTS01+560
CVTVSTOP EQU   CVTS01+556
CVTGTFR8 EQU   CVTS01+552
CVTQUIT  EQU   CVTS01+548
CVTVACR  EQU   CVTS01+544
CVTWTCB  EQU   CVTS01+540
CVTSTPRS EQU   CVTS01+536
CVT0PT02 EQU   CVTS01+532
CVTDARCM EQU   CVTS01+528
CVTIRECM EQU   CVTS01+524
CVTJRECM EQU   CVTS01+520
CVTVEMS0 EQU   CVTS01+516
CVTSPFRR EQU   CVTS01+512
CVTRLSTG EQU   CVTS01+508
CVT0TC0A EQU   CVTS01+504
CVTGMBR  EQU   CVTS01+500
CVTLFRM  EQU   CVTS01+496
CVTRMBR  EQU   CVTS01+492
CVTVIOP  EQU   CVTS01+488
CVTRV307 EQU   CVTS01+486
CVTRV306 EQU   CVTS01+484
CVTRV305 EQU   CVTS01+482
CVTRV304 EQU   CVTS01+480
CVTRV303 EQU   CVTS01+478
CVTRV302 EQU   CVTS01+476
CVTTRCA  EQU   CVTS01+472
CVTRV297 EQU   CVTRV289
CVTRV296 EQU   CVTRV289
CVTRV295 EQU   CVTRV289
CVTRV294 EQU   CVTRV289
CVTRV293 EQU   CVTRV289
CVTRV292 EQU   CVTRV289
CVTRV291 EQU   CVTRV289
CVTRV290 EQU   CVTRV289
CVTRV288 EQU   CVTRV280
CVTRV287 EQU   CVTRV280
CVTRV286 EQU   CVTRV280
CVTRV285 EQU   CVTRV280
CVTRV284 EQU   CVTRV280
CVTRV283 EQU   CVTRV280
CVTRV282 EQU   CVTRV280
CVTRV281 EQU   CVTRV280
CVTRV279 EQU   CVTRV271
CVTRV278 EQU   CVTRV271
CVTRV277 EQU   CVTRV271
CVTRV276 EQU   CVTRV271
CVTRV275 EQU   CVTRV271
CVTRV274 EQU   CVTRV271
CVTRV273 EQU   CVTRV271
CVTRV272 EQU   CVTRV271
CVTRV270 EQU   CVTRV262
CVTRV269 EQU   CVTRV262
CVTRV268 EQU   CVTRV262
CVTRV267 EQU   CVTRV262
CVTRV266 EQU   CVTRV262
CVTRV265 EQU   CVTRV262
CVTRV264 EQU   CVTRV262
CVTRV263 EQU   CVTRV262
CVTVFP   EQU   CVTS01+464
CVTVSI   EQU   CVTS01+460
CVTVPSIB EQU   CVTS01+456
CVTMFACT EQU   CVTMFRTR
CVTMFCTL EQU   CVTS01+448
CVTPVBP  EQU   CVTS01+444
CVTPWI   EQU   CVTS01+440
CVTRV254 EQU   CVTS01+438
CVTRV253 EQU   CVTS01+436
CVTRV252 EQU   CVTS01+434
CVTRV251 EQU   CVTS01+433
CVTRV250 EQU   CVTS01+432
CVTRV249 EQU   CVTS01+431
CVTRV248 EQU   CVTS01+430
CVTRV247 EQU   CVTS01+429
CVTRV246 EQU   CVTS01+428
CVTRV245 EQU   CVTRV237
CVTRV244 EQU   CVTRV237
CVTRV243 EQU   CVTRV237
CVTRV242 EQU   CVTRV237
CVTRV241 EQU   CVTRV237
CVTRV240 EQU   CVTRV237
CVTRV239 EQU   CVTRV237
CVTRV238 EQU   CVTRV237
CVTRV236 EQU   CVTRV228
CVTRV235 EQU   CVTRV228
CVTRV234 EQU   CVTRV228
CVTRV233 EQU   CVTRV228
CVTRV232 EQU   CVTRV228
CVTRV231 EQU   CVTRV228
CVTRV230 EQU   CVTRV228
CVTRV229 EQU   CVTRV228
CVTRV227 EQU   CVTRV219
CVTRV226 EQU   CVTRV219
CVTRV225 EQU   CVTRV219
CVTRV224 EQU   CVTRV219
CVTRV223 EQU   CVTRV219
CVTRV222 EQU   CVTRV219
CVTRV221 EQU   CVTRV219
CVTRV220 EQU   CVTRV219
CVTRV218 EQU   CVTRV210
CVTRV217 EQU   CVTRV210
CVTRV216 EQU   CVTRV210
CVTRV215 EQU   CVTRV210
CVTRV214 EQU   CVTRV210
CVTRV213 EQU   CVTRV210
CVTRV212 EQU   CVTRV210
CVTRV211 EQU   CVTRV210
CVTLCCAT EQU   CVTS01+420
CVTPCCAT EQU   CVTS01+416
CVTIPCRP EQU   CVTS01+412
CVTIPCRI EQU   CVTS01+408
CVTIPCDS EQU   CVTS01+404
CVTAIDVT EQU   CVTS01+400
CVTSSAP  EQU   CVTS01+396
CVTEHCIR EQU   CVTS01+392
CVTEHDEF EQU   CVTS01+388
CVTDAIR  EQU   CVTS01+384
CVTPERFM EQU   CVTS01+380
CVT044R2 EQU   CVTS01+376
CVTFETCH EQU   CVTS01+372
CVTRSTWD EQU   CVTS01+368
CVTSPOST EQU   CVTS01+364
CVTIOBP  EQU   CVTS01+360
CVTASMVT EQU   CVTS01+356
CVTRECRQ EQU   CVTS01+352
CVTWSAC  EQU   CVTS01+348
CVTRV149 EQU   CVTS01+344
CVTWSAL  EQU   CVTS01+340
CVTSPSA  EQU   CVTS01+336
CVTGLMN  EQU   CVTS01+332
CVTVEAC0 EQU   CVTS01+328
CVT062R1 EQU   CVTS01+324
CVTRPOST EQU   CVTS01+320
CVTDQIQE EQU   CVTS01+316
CVTCSD   EQU   CVTS01+312
CVTLKRMA EQU   CVTS01+308
CVTRSPIE EQU   CVTS01+304
CVTRENQ  EQU   CVTS01+300
CVTLQCB  EQU   CVTS01+296
CVTFQCB  EQU   CVTS01+292
CVTQCS01 EQU   CVTS01+288
CVTAPFT  EQU   CVTS01+284
CVTPARRL EQU   CVTS01+280
CVTVWAIT EQU   CVTS01+276
CVTGSPL  EQU   CVTS01+272
CVTLSMQ  EQU   CVTS01+268
CVTGSMQ  EQU   CVTS01+264
CVTEXPRO EQU   CVTS01+260
CVTOPCTP EQU   CVTS01+256
CVTSIC   EQU   CVTS01+252
CVTTPIOS EQU   CVTS01+248
CVTRTMS  EQU   CVTS01+244
CVTSDBF  EQU   CVTS01+240
CVTSCBP  EQU   CVTS01+236
CVTSDMP  EQU   CVTS01+232
CVTSV60  EQU   CVTS01+228
CVTRTMCT EQU   CVTS01+224
CVTASCBL EQU   CVTS01+220
CVTASCBH EQU   CVTS01+216
CVTGDA   EQU   CVTS01+212
CVTASVT  EQU   CVTS01+208
CVTVVMDI EQU   CVTS01+204
CVTAQTOP EQU   CVTS01+200
CVTIOSCS EQU   CVTS01+196
CVTSDRM  EQU   CVTS01+192
CVTOPTE  EQU   CVTS01+188
CVTSTXU  EQU   CVTS01+184
CVTQUIS  EQU   CVTS01+180
CVTPARS  EQU   CVTS01+176
CVTS1EE  EQU   CVTS01+172
CVTFRAS  EQU   CVTS01+168
CVTQSAS  EQU   CVTS01+164
CVTCRAS  EQU   CVTS01+160
CVTCRMN  EQU   CVTS01+156
CVTDELCP EQU   CVTS01+152
CVTFRECL EQU   CVTS01+148
CVTGETCL EQU   CVTS01+144
CVTBLDCP EQU   CVTS01+140
CVTAUTHL EQU   CVTS01+136
CVTSCAN  EQU   CVTS01+132
CVTRV144 EQU   CVTS01+130
CVTMAXMP EQU   CVTS01+128
CVTSTCK  EQU   CVTS01+124
CVTRV139 EQU   CVTS01+123
CVTDSSAC EQU   CVTS01+122
CVTRV513 EQU   CVTS01+121
CVTIOSPL EQU   CVTS01+120
CVTPTGT  EQU   CVTS01+116
CVTCSPIE EQU   CVTS01+112
CVTSMFEX EQU   CVTS01+108
CVTOLT0A EQU   CVTS01+104
CVTSRBRT EQU   CVTS01+100
CVTPUTL  EQU   CVTS01+96
CVTASCRL EQU   CVTS01+92
CVTASCRF EQU   CVTS01+88
CVTRV326 EQU   CVTS01+84
CVTRV325 EQU   CVTS01+80
CVTRV324 EQU   CVTS01+76
CVT0VL01 EQU   CVTS01+72
CVTSHRVM EQU   CVTS01+68
CVTRV332 EQU   CVTS01+64
CVTTAS   EQU   CVTS01+60
CVTRSCN  EQU   CVTS01+56
CVTTRAC2 EQU   CVTS01+54
CVTTRACE EQU   CVTS01+52
CVTAPG   EQU   CVTS01+51
CVTSDTRC EQU   CVTCTLFG
CVTGTRCE EQU   CVTCTLFG
CVTNOMP  EQU   CVTCTLFG
CVTRSV79 EQU   CVTCTLFG
CVTDSTAT EQU   CVTCTLFG
CVTRSV78 EQU   CVTCTLFG
CVTRV333 EQU   CVTCTLFG
CVTRV323 EQU   CVTCTLFG
CVTSPVLK EQU   CVTS01+49
CVTRSV77 EQU   CVTS01+48
CVTRV331 EQU   CVTS01+44
CVTRV330 EQU   CVTS01+40
CVTRV329 EQU   CVTS01+36
CVTRV328 EQU   CVTS01+32
CVTRV322 EQU   CVTS01+28
CVTSLID  EQU   CVTSLIDA+1
CVTSYLK  EQU   CVTSLIDA
CVTRV321 EQU   CVTS01+20
CVTRV320 EQU   CVTS01+16
CVTLPDIR EQU   CVTLPDIA+1
CVTRSV69 EQU   CVTDIRST
CVTRSV68 EQU   CVTDIRST
CVTRSV67 EQU   CVTDIRST
CVTRSV66 EQU   CVTDIRST
CVTRSV65 EQU   CVTDIRST
CVTRSV64 EQU   CVTDIRST
CVTRSV63 EQU   CVTDIRST
CVTDICOM EQU   CVTDIRST
CVTPVTP  EQU   CVTS01+8
CVTLPDSR EQU   CVTS01+4
CVTGETL  EQU   CVTS01
SURV104  EQU   SUBITS+13
SURV103  EQU   SUBYTE13
SURV102  EQU   SUBYTE13
SURV101  EQU   SUBYTE13
SU100BT  EQU   SUBYTE13
SU99BIT  EQU   SUBYTE13
SU98BIT  EQU   SUBYTE13
SU97BIT  EQU   SUBYTE13
SU96BIT  EQU   SUBYTE13
SU95BIT  EQU   SUBYTE12
SU94BIT  EQU   SUBYTE12
SU93BIT  EQU   SUBYTE12
SU92BIT  EQU   SUBYTE12
SU91BIT  EQU   SUBYTE12
SU90BIT  EQU   SUBYTE12
SU89BIT  EQU   SUBYTE12
SU88BIT  EQU   SUBYTE12
SU87BIT  EQU   SUBYTE11
SU86BIT  EQU   SUBYTE11
SU85BIT  EQU   SUBYTE11
SU84BIT  EQU   SUBYTE11
SU83BIT  EQU   SUBYTE11
SU82BIT  EQU   SUBYTE11
SU81BIT  EQU   SUBYTE11
SU80BIT  EQU   SUBYTE11
SU79BIT  EQU   SUBYTE10
SU78BIT  EQU   SUBYTE10
SU77BIT  EQU   SUBYTE10
SU76BIT  EQU   SUBYTE10
SU75BIT  EQU   SUBYTE10
SU74BIT  EQU   SUBYTE10
SU73BIT  EQU   SUBYTE10
SU72BIT  EQU   SUBYTE10
SU71BIT  EQU   SUBYTE9
SU70BIT  EQU   SUBYTE9
SU69BIT  EQU   SUBYTE9
SU68BIT  EQU   SUBYTE9
SU67BIT  EQU   SUBYTE9
SU66BIT  EQU   SUBYTE9
SU65BIT  EQU   SUBYTE9
SU64BIT  EQU   SUBYTE9
SU63BIT  EQU   SUBYTE8
SU62BIT  EQU   SUBYTE8
SU61BIT  EQU   SUBYTE8
SU60BIT  EQU   SUBYTE8
SU59BIT  EQU   SUBYTE8
SU58BIT  EQU   SUBYTE8
SU57BIT  EQU   SUBYTE8
SU56BIT  EQU   SUBYTE8
SU55BIT  EQU   SUBYTE7
SU54BIT  EQU   SUBYTE7
SU53BIT  EQU   SUBYTE7
SU52BIT  EQU   SUBYTE7
SU51BIT  EQU   SUBYTE7
SU50BIT  EQU   SUBYTE7
SU49BIT  EQU   SUBYTE7
SU48BIT  EQU   SUBYTE7
SU47BIT  EQU   SUBYTE6
SU46BIT  EQU   SUBYTE6
SU45BIT  EQU   SUBYTE6
SU44BIT  EQU   SUBYTE6
SU43BIT  EQU   SUBYTE6
SU42BIT  EQU   SUBYTE6
SU41BIT  EQU   SUBYTE6
SU40BIT  EQU   SUBYTE6
SU39BIT  EQU   SUBYTE5
SU38BIT  EQU   SUBYTE5
SU37BIT  EQU   SUBYTE5
SU36BIT  EQU   SUBYTE5
SU35BIT  EQU   SUBYTE5
SU34BIT  EQU   SUBYTE5
SU33BIT  EQU   SUBYTE5
SU32BIT  EQU   SUBYTE5
SU31BIT  EQU   SUBYTE4
SU30BIT  EQU   SUBYTE4
SU28BIT  EQU   SUBYTE4
SU27BIT  EQU   SUBYTE4
SU26BIT  EQU   SUBYTE4
SU25BIT  EQU   SUBYTE4
SU24BIT  EQU   SUBYTE4
SU23BIT  EQU   SUBYTE3
SU22BIT  EQU   SUBYTE3
SU21BIT  EQU   SUBYTE3
SU20BIT  EQU   SUBYTE3
SU19BIT  EQU   SUBYTE3
SU18BIT  EQU   SUBYTE3
SU17BIT  EQU   SUBYTE3
SU16BIT  EQU   SUBYTE3
SU15BIT  EQU   SUBYTE2
SU14BIT  EQU   SUBYTE2
SU13BIT  EQU   SUBYTE2
SU12BIT  EQU   SUBYTE2
SU11BIT  EQU   SUBYTE2
SU10BIT  EQU   SUBYTE2
SU9BIT   EQU   SUBYTE2
SU8BIT   EQU   SUBYTE2
SU7BIT   EQU   SUBYTE1
SU6BIT   EQU   SUBYTE1
SU5BIT   EQU   SUBYTE1
SU4BIT   EQU   SUBYTE1
SU3BIT   EQU   SUBYTE1
SU2BIT   EQU   SUBYTE1
SU1BIT   EQU   SUBYTE1
SU0BIT   EQU   SUBYTE1
SSVTRSV1 EQU   SSVTFSIZ
SSCTSUSE EQU   SSCT+20
SSCTRSV1 EQU   SSCT+13
@NM00020 EQU   SSCTFLG1
SSCTUPSS EQU   SSCTFLG1
SSCTSFOR EQU   SSCTFLG1
SASTNOGP EQU   SASTENRY+10
SASTNORQ EQU   SASTENRY+8
SASTSPTR EQU   SASTENRY+4
JESNUCBS EQU   JESCT+44
JESRESQM EQU   JESCT+16
JESQMGR  EQU   JESCT+12
JESUNITS EQU   JESCT+4
@NM00019 EQU   JESCT
CVTLEVL  EQU   CVTRELNO+2
CVTNUMB  EQU   CVTRELNO
CVTMDL   EQU   CVTFIX+250
@NM00018 EQU   CVTFIX+248
@NM00017 EQU   CVTFIX
CVTRV482 EQU   CVTXTNT2+128
CVTRV481 EQU   CVTXTNT2+124
CVTRV480 EQU   CVTXTNT2+120
CVTRV479 EQU   CVTXTNT2+118
CVTRV478 EQU   CVTXTNT2+117
CVTRV477 EQU   CVTXTNT2+116
CVTRV476 EQU   CVTXTNT2+115
CVTRV475 EQU   CVTXTNT2+114
CVTRV474 EQU   CVTRV466
CVTRV473 EQU   CVTRV466
CVTRV472 EQU   CVTRV466
CVTRV471 EQU   CVTRV466
CVTRV470 EQU   CVTRV466
CVTRV469 EQU   CVTRV466
CVTRV468 EQU   CVTRV466
CVTRV467 EQU   CVTRV466
CVTRV465 EQU   CVTRV457
CVTRV464 EQU   CVTRV457
CVTRV463 EQU   CVTRV457
CVTRV462 EQU   CVTRV457
CVTRV461 EQU   CVTRV457
CVTRV460 EQU   CVTRV457
CVTRV459 EQU   CVTRV457
CVTRV458 EQU   CVTRV457
CVTRV456 EQU   CVTXTNT2+108
CVTRV455 EQU   CVTXTNT2+104
CVTRV454 EQU   CVTXTNT2+100
CVTRV453 EQU   CVTXTNT2+96
CVTRV452 EQU   CVTXTNT2+94
CVTRV451 EQU   CVTXTNT2+92
CVTRV450 EQU   CVTXTNT2+90
CVTRV449 EQU   CVTXTNT2+88
CVTRV448 EQU   CVTXTNT2+87
CVTRV447 EQU   CVTXTNT2+86
CVTRV446 EQU   CVTRV438
CVTRV445 EQU   CVTRV438
CVTRV444 EQU   CVTRV438
CVTRV443 EQU   CVTRV438
CVTRV442 EQU   CVTRV438
CVTRV441 EQU   CVTRV438
CVTRV440 EQU   CVTRV438
CVTRV439 EQU   CVTRV438
CVTRV437 EQU   CVTRV429
CVTRV436 EQU   CVTRV429
CVTRV435 EQU   CVTRV429
CVTRV434 EQU   CVTRV429
CVTRV433 EQU   CVTRV429
CVTRV432 EQU   CVTRV429
CVTRV431 EQU   CVTRV429
CVTRV430 EQU   CVTRV429
CVTRV428 EQU   CVTXTNT2+80
CVTRV427 EQU   CVTXTNT2+76
CVTRV426 EQU   CVTXTNT2+72
CVTRV425 EQU   CVTXTNT2+68
CVTATACT EQU   CVTATCVT
CVTRV423 EQU   CVTXTNT2+62
CVTRV422 EQU   CVTXTNT2+60
CVTRV421 EQU   CVTXTNT2+58
CVTRV420 EQU   CVTXTNT2+56
CVTRV419 EQU   CVTXTNT2+55
CVTRV418 EQU   CVTXTNT2+54
CVTRV417 EQU   CVTRV409
CVTRV416 EQU   CVTRV409
CVTRV415 EQU   CVTRV409
CVTRV414 EQU   CVTRV409
CVTRV413 EQU   CVTRV409
CVTRV412 EQU   CVTRV409
CVTRV411 EQU   CVTRV409
CVTRV410 EQU   CVTRV409
CVTRV408 EQU   CVTRV400
CVTRV407 EQU   CVTRV400
CVTRV406 EQU   CVTRV400
CVTRV405 EQU   CVTRV400
CVTRV404 EQU   CVTRV400
CVTRV403 EQU   CVTRV400
CVTRV402 EQU   CVTRV400
CVTRV401 EQU   CVTRV400
CVTICB   EQU   CVTXTNT2+48
CVTSKTA  EQU   CVTXTNT2+44
CVTRSV99 EQU   CVTXTNT2+40
CVTRSV98 EQU   CVTXTNT2+36
CVTRSV97 EQU   CVTXTNT2+34
CVTRSV96 EQU   CVTXTNT2+32
CVTOLTEP EQU   CVTXTNT2+28
CVTQIDA  EQU   CVTQID+1
CVTRSV95 EQU   CVTQID
CVTRSV94 EQU   CVTXTNT2+20
CVTRSV93 EQU   CVTXTNT2+16
CVTRSV92 EQU   CVTXTNT2+12
CVTDEBVR EQU   CVTXTNT2+8
CVTRSV91 EQU   CVTXTNT2+6
CVTRSV9H EQU   CVTFLGBT
CVTRSV9G EQU   CVTFLGBT
CVTRSV9F EQU   CVTFLGBT
CVTRSV9E EQU   CVTFLGBT
CVTRSV9D EQU   CVTFLGBT
CVTRSV9C EQU   CVTFLGBT
CVTVME   EQU   CVTFLGBT
CVTNPE   EQU   CVTFLGBT
CVTNUCLS EQU   CVTXTNT2+4
CVTDSSVA EQU   CVTDSSV+1
CVTRSV89 EQU   CVTDSSV
CVTRSV88 EQU   CVTXTNT1+8
CVTRSV87 EQU   CVTXTNT1+4
CVTFACHN EQU   CVTXTNT1
CVTRV488 EQU   CVTMAP+412
CVTRV487 EQU   CVTMAP+408
CVTRV486 EQU   CVTMAP+404
CVTRV485 EQU   CVTMAP+400
CVTACTAP EQU   CVTMAP+396
CVTAUTH  EQU   CVTMAP+392
CVTATMCA EQU   CVTATMCT+1
CVTATMST EQU   CVTATMCT
CVTRSV61 EQU   CVTMAP+384
CVTVOLT1 EQU   CVTVOLM1+1
CVTVOLI1 EQU   CVTVOLF1
CVTSTOA  EQU   CVTMAP+376
CVTRSV58 EQU   CVTMAP+374
CVTRSV57 EQU   CVTMAP+372
CVTDDCE  EQU   CVTMAP+368
CVTPNWFR EQU   CVTMAP+364
CVTSMF   EQU   CVTMAP+360
CVTSULK  EQU   CVTMAP+358
CVTSLKO  EQU   CVTSYSK
CVTSLKP  EQU   CVTSYSK
CVTSLKQ  EQU   CVTSYSK
CVTSLKR  EQU   CVTSYSK
CVTRSV56 EQU   CVTSYSK
CVTRSV55 EQU   CVTSYSK
CVTRSV54 EQU   CVTSYSK
CVTRSV53 EQU   CVTSYSK
CVTRSV52 EQU   CVTA1F1
CVTRSV51 EQU   CVTA1F1
CVTRSV50 EQU   CVTA1F1
CVTRSV49 EQU   CVTA1F1
CVTRSV48 EQU   CVTA1F1
CVTRSV47 EQU   CVTA1F1
CVTSRSW  EQU   CVTA1F1
CVTPFSW  EQU   CVTA1F1
CVTPCVT  EQU   CVTMAP+352
CVTRSV46 EQU   CVTMAP+344
CVTRSV45 EQU   CVTMAP+340
CVTRSV44 EQU   CVTMAP+338
CVTRSV43 EQU   CVTMAP+336
CVTHJESA EQU   CVTHJES+1
CVTRSV42 EQU   CVTHJES
CVTEXT2A EQU   CVTEXT2+1
CVTRSV41 EQU   CVTEXT2
CVTAPFA  EQU   CVTAPF+1
CVTRSV40 EQU   CVTAPF
CVTRV518 EQU   CVTINTLA
CVTRV517 EQU   CVTERPV
CVTEORM  EQU   CVTMAP+312
CVTMCHPR EQU   CVTMAP+308
CVTTZ    EQU   CVTMAP+304
CVTJEPS  EQU   CVTMAP+300
CVTMODE  EQU   CVTMAP+292
CVTPTRV  EQU   CVTMAP+288
CVTREAL  EQU   CVTMAP+284
CVTRSV39 EQU   CVTMAP+280
CVTRSV38 EQU   CVTMAP+276
CVTDMSRA EQU   CVTDMSR+1
CVTRV634 EQU   CVTDMSRF
CVTRV633 EQU   CVTDMSRF
CVTRV632 EQU   CVTDMSRF
CVTRV631 EQU   CVTDMSRF
CVTRV630 EQU   CVTDMSRF
CVTRV629 EQU   CVTDMSRF
CVTUDUMP EQU   CVTDMSRF
CVTSDUMP EQU   CVTDMSRF
CVTQMSGA EQU   CVTQMSG+1
CVTRSV36 EQU   CVTQMSG
CVTAMFF  EQU   CVTMAP+264
CVTPURGA EQU   CVTPURG+1
CVTRSV35 EQU   CVTPURG
CVTCBSP  EQU   CVTMAP+256
CVTATERA EQU   CVTATER+1
CVTSYST  EQU   CVTATER
CVTVOLT2 EQU   CVTTAT
CVTVOLI2 EQU   CVTVOLF2
CVTAQAVB EQU   CVTAQAVT+1
CVTRSV34 EQU   CVTTCMFG
CVTRSV33 EQU   CVTTCMFG
CVTRSV32 EQU   CVTTCMFG
CVTRSV31 EQU   CVTTCMFG
CVTRSV30 EQU   CVTTCMFG
CVTRSV29 EQU   CVTTCMFG
CVTLDEV  EQU   CVTTCMFG
CVTTCRDY EQU   CVTTCMFG
CVTGTFA  EQU   CVTGTF+1
CVTRSV27 EQU   CVTGTFST
CVTRNIO  EQU   CVTGTFST
CVTUSR   EQU   CVTGTFST
CVTRV318 EQU   CVTFORM
CVTRV317 EQU   CVTTMODE
CVTRV316 EQU   CVTSTATE
CVTRV315 EQU   CVTGTFS
CVTGTFAV EQU   CVTGTFS
CVT0SCR1 EQU   CVTMAP+232
CVTRV515 EQU   CVTMAP+228
CVTRMS   EQU   CVTMAP+224
CVTPATCH EQU   CVTMAP+220
CVTTSCE  EQU   CVTMAP+216
CVTLNKSC EQU   CVTMAP+214
CVTQABST EQU   CVTMAP+212
CVTMDLDS EQU   CVTMAP+208
CVTUSER  EQU   CVTMAP+204
CVTABEND EQU   CVTMAP+200
CVTSMCA  EQU   CVTMAP+196
CVTRSV18 EQU   CVTMAP+192
CVTQLPAQ EQU   CVTMAP+188
CVTQCDSR EQU   CVTMAP+184
CVTRSV17 EQU   CVTOPTB
CVTRSV16 EQU   CVTOPTB
CVTFP    EQU   CVTOPTB
CVTAPTHR EQU   CVTOPTB
CVTNLOG  EQU   CVTOPTB
CVTTOD   EQU   CVTOPTB
CVTCTIMS EQU   CVTOPTB
CVTPROT  EQU   CVTOPTB
CVTXPFP  EQU   CVTOPTA
CVTASCII EQU   CVTOPTA
CVTRSV13 EQU   CVTOPTA
CVTRSV12 EQU   CVTOPTA
CVTNIP   EQU   CVTOPTA
CVTDDR   EQU   CVTOPTA
CVTAPR   EQU   CVTOPTA
CVTCCH   EQU   CVTOPTA
CVTSNCTR EQU   CVTMAP+180
CVTQMWR  EQU   CVTMAP+176
CVTQOCR  EQU   CVTMAP+172
CVT1EF00 EQU   CVTMAP+168
CVTMZ00  EQU   CVTMAP+164
CVTHEAD  EQU   CVTMAP+160
CVTRSV11 EQU   CVTMAP+156
CVT0PT01 EQU   CVTMAP+152
CVTMSER  EQU   CVTMAP+148
CVTRV516 EQU   CVTIERLC
CVTILCH  EQU   CVTMAP+140
CVT0DS   EQU   CVTMAP+136
CVTFBOSV EQU   CVTMAP+132
CVTNUCB  EQU   CVTMAP+128
CVTIXAVL EQU   CVTMAP+124
CVTIOQET EQU   CVTMAP+120
CVTDCBA  EQU   CVTMAP+117
CVTMVS2  EQU   CVTDCB
CVT6DAT  EQU   CVTDCB
CVT4MPS  EQU   CVTDCB
CVTRSV09 EQU   CVTDCB
CVT4MS1  EQU   CVTDCB
CVT2SPS  EQU   CVTDCB
CVT1SSS  EQU   CVTDCB
CVTRSV08 EQU   CVTDCB
CVTSTB   EQU   CVTMAP+112
CVTQTD00 EQU   CVTMAP+108
CVTQTE00 EQU   CVTMAP+104
CVTCUCB  EQU   CVTMAP+100
CVTSJQ   EQU   CVTMAP+96
CVTPBLDL EQU   CVTMAP+92
CVTTPC   EQU   CVTMAP+88
CVTSVDCB EQU   CVTMAP+84
CVTBRET  EQU   CVTMAP+82
CVTEXIT  EQU   CVTMAP+80
CVT0FN00 EQU   CVTMAP+76
CVTDARA  EQU   CVTDAR+1
CVTRSV07 EQU   CVTFLGS1
CVTRSV06 EQU   CVTFLGS1
CVTRSV05 EQU   CVTFLGS1
CVTRSV04 EQU   CVTFLGS1
CVTRSV03 EQU   CVTFLGS1
CVTRSV02 EQU   CVTFLGS1
CVTRSV01 EQU   CVTFLGS1
CVTDMPLK EQU   CVTFLGS1
CVTXITP  EQU   CVTMAP+68
CVTZDTAB EQU   CVTMAP+64
CVTMSLT  EQU   CVTMAP+60
CVTDATE  EQU   CVTMAP+56
CVTBTERM EQU   CVTMAP+52
CVTSYSAD EQU   CVTMAP+48
CVTXTLER EQU   CVTMAP+44
CVTILK2  EQU   CVTMAP+40
CVTILK1  EQU   CVTMAP+36
CVTPRLTV EQU   CVTMAP+32
CVTPCNVT EQU   CVTMAP+28
CVT0VL00 EQU   CVTMAP+24
CVTXAPG  EQU   CVTMAP+20
CVTBUF   EQU   CVTMAP+16
CVTJOB   EQU   CVTMAP+12
CVTLINK  EQU   CVTMAP+8
CVT0EF00 EQU   CVTMAP+4
CVTTCBP  EQU   CVTMAP
CVT      EQU   CVTMAP
SSCFRSV1 EQU   SSCF+12
SSCFMRRC EQU   SSCF+8
SSCFBFAD EQU   SSCF+4
SSCFRSV0 EQU   SSCF+2
SSCFLEN  EQU   SSCF
SSETASCB EQU   SSET+12
SSETCBA  EQU   SSET+8
@NM00016 EQU   SSET+7
@NM00015 EQU   SSETFLAG
SSETYPE  EQU   SSETFLAG
SSETASID EQU   SSET+4
@NM00014 EQU   SSET+2
SSETLEN  EQU   SSET
SSVSSCTP EQU   SSVS+4
SSVSFLG2 EQU   SSVS+3
@NM00013 EQU   SSVSFLG1
SSVSUPSS EQU   SSVSFLG1
SSVSLEN  EQU   SSVS
SSDMDMCB EQU   SSDM+4
@NM00012 EQU   SSDM+2
SSDMLEN  EQU   SSDM
SSJTSNUM EQU   SSJT+20
SSJTPSN2 EQU   SSJT+16
SSJTPSN1 EQU   SSJT+12
SSJTPCOD EQU   SSJT+8
SSJTJMR  EQU   SSJT+4
SSJTRSV1 EQU   SSJT+3
@NM00011 EQU   SSJTFLG1
SSJTABND EQU   SSJTFLG1
SSJTCFAL EQU   SSJTFLG1
SSJTJFAL EQU   SSJTFLG1
SSJTLEN  EQU   SSJT
SSCMSCID EQU   SSCM+8
SSCMBUFF EQU   SSCM+4
@NM00010 EQU   SSCM+2
SSCMLEN  EQU   SSCM
SSWTORE  EQU   SSWT+12
SSWTMIN  EQU   SSWT+8
SSWTWQE  EQU   SSWT+4
@NM00009 EQU   SSWT+2
SSWTLEN  EQU   SSWT
SSENASCB EQU   SSEN+12
SSENJBNM EQU   SSEN+8
@NM00008 EQU   SSEN+7
@NM00007 EQU   SSENFLAG
SSENTYPE EQU   SSENFLAG
SSENASID EQU   SSEN+4
@NM00006 EQU   SSEN+2
SSENLEN  EQU   SSEN
SSALCNCL EQU   SSAL+60
SSALSSCM EQU   SSAL+56
SSALJFCB EQU   SSAL+52
SSALSSNM EQU   SSAL+48
SSALCOPY EQU   SSAL+44
SSALADSP EQU   SSAL+40
SSALCLAS EQU   SSAL+36
SSALFORM EQU   SSAL+32
SSALPGMN EQU   SSAL+28
SSALUNIT EQU   SSAL+24
SSALSOUT EQU   SSAL+20
SSALDUMY EQU   SSAL+16
SSALDISP EQU   SSAL+12
SSALDEST EQU   SSAL+8
SSALDDNM EQU   SSAL+4
@NM00005 EQU   SSAL+3
SSALKEEP EQU   SSALFLG1
SSALASNM EQU   SSALFLG1
SSALSPIN EQU   SSALFLG1
SSALTRKM EQU   SSALFLG1
SSALWAIT EQU   SSALFLG1
SSALNHLD EQU   SSALFLG1
SSALHOLD EQU   SSALFLG1
SSALDELT EQU   SSALFLG1
SSALLEN  EQU   SSAL
SSJSPSW2 EQU   SSJSPAS2+1
SSJSPSL2 EQU   SSJSPAS2
SSJSPSWD EQU   SSJSPASS+1
SSJSPSLN EQU   SSJSPASS
SSJSAIAD EQU   SSJS+36
SSJSSERR EQU   SSJS+32
SSJSJMR  EQU   SSJS+28
SSJSIPRM EQU   SSJS+24
SSJSTACB EQU   SSJS+20
SSJSJACB EQU   SSJS+16
SSJSMACB EQU   SSJS+12
SSJSLCT  EQU   SSJS+8
@NM00004 EQU   SSJS+7
@NM00003 EQU   SSJSFLG1
SSJSAIFG EQU   SSJSFLG1
SSJSWARM EQU   SSJSFLG1
@NM00002 EQU   SSJSFLG1
SSJSCNRS EQU   SSJSFLG1
SSJSCHRS EQU   SSJSFLG1
SSJSSTRS EQU   SSJSFLG1
SSJSSTEP EQU   SSJS+4
@NM00001 EQU   SSJS+2
SSJSLEN  EQU   SSJS
JSSNTCOM EQU   JSSNTENT+12
JSSNTINT EQU   JSSNTENT+4
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS
@RT00135 EQU   LOADERR
@RF00118 EQU   @EL00001
@RF00217 EQU   @EL00003
@ENDDATA EQU   *
         END   IEFJSINT,(C'PLS1839',0701,76329)
