//MVS0220 JOB  (SETUP),
//             'ADD COBOL',
//             CLASS=A,
//             MSGCLASS=A,
//             MSGLEVEL=(1,1),
//             COND=(0,NE),
//             REGION=3072K
//SUBMIT  EXEC PGM=IEBGENER
//SYSIN    DD  DUMMY
//SYSPRINT DD  DUMMY
//SYSUT1   DD  DISP=SHR,DSN=SYS1.SETUP.CNTL(MVTCOBOL)
//SYSUT2   DD  SYSOUT=(A,INTRDR)
