//MVTPL1   JOB (001),'RELOAD MVT PL1',CLASS=A,MSGCLASS=A
//*
//* ***************************************************************** *
//* RELOAD MVT PL1 FROM TAPE                                          *
//* ***************************************************************** *
//*
//RELOAD  EXEC PGM=IEBCOPY,REGION=1024K
//SYSPRINT DD  SYSOUT=A
//TAPEIN1  DD  DSN=PL1.LOAD,UNIT=TAPE,DISP=(OLD,KEEP),
//             VOL=(PRIVATE,RETAIN,SER=000901),LABEL=(1,SL)
//TAPEIN2  DD  DSN=PL1.LIB,UNIT=AFF=TAPEIN1,DISP=(OLD,KEEP),
//             VOL=(PRIVATE,RETAIN,SER=000901),LABEL=(2,SL)
//TAPEIN3  DD  DSN=PL1.PROCS,UNIT=AFF=TAPEIN1,DISP=(OLD,KEEP),
//             VOL=(PRIVATE,RETAIN,SER=000901),LABEL=(3,SL)
//LIBOUT1  DD  DSN=&&PL1LOAD,DISP=(NEW,PASS),
//             UNIT=SYSDA,SPACE=(CYL,(5,5,45)),
//             DCB=(RECFM=U,BLKSIZE=13030)
//LIBOUT2  DD  DSN=&&PL1LIB,DISP=(NEW,PASS),
//             UNIT=SYSDA,SPACE=(CYL,(5,5,95)),
//             DCB=(RECFM=U,BLKSIZE=13030)
//PROCLIB  DD  DSN=SYS2.PROCLIB,DISP=SHR
//SYSUT3   DD  UNIT=SYSDA,SPACE=(80,(60,45)),DISP=(NEW,DELETE)
//SYSIN    DD  *
  COPY INDD=TAPEIN1,OUTDD=LIBOUT1
  COPY INDD=TAPEIN2,OUTDD=LIBOUT2
  COPY INDD=((TAPEIN3,R)),OUTDD=PROCLIB
/*
//*
//LINK001 EXEC PGM=IEWL,REGION=512K,
//             PARM='LET,LIST,XREF,NCAL,DC'
//SYSPRINT DD  SYSOUT=A
//SYSUT1   DD  SPACE=(CYL,(5,1)),UNIT=SYSDA
//SYSLMOD  DD  DSN=SYS2.LINKLIB,DISP=OLD         <== TARGET
//INLIB    DD  DSN=&&PL1LOAD,DISP=(OLD,PASS)
//SYSLIN   DD  *
               ENTRY     IEMAA
          ALIAS     IEMAAA
     INCLUDE   INLIB(IEMAA)
 NAME     IEMAA(R)
               ENTRY     IEMAB
     INCLUDE   INLIB(IEMAB)
 NAME     IEMAB(R)
               ENTRY     IEMAC
     INCLUDE   INLIB(IEMAC)
 NAME     IEMAC(R)
               ENTRY     IEMAD
     INCLUDE   INLIB(IEMAD)
 NAME     IEMAD(R)
               ENTRY     IEMAE
     INCLUDE   INLIB(IEMAE)
 NAME     IEMAE(R)
               ENTRY     IEMAG
     INCLUDE   INLIB(IEMAG)
 NAME     IEMAG(R)
               ENTRY     IEMAH
     INCLUDE   INLIB(IEMAH)
 NAME     IEMAH(R)
               ENTRY     IEMAI
     INCLUDE   INLIB(IEMAI)
 NAME     IEMAI(R)
               ENTRY     IEMAJ
     INCLUDE   INLIB(IEMAJ)
 NAME     IEMAJ(R)
               ENTRY     IEMAK
     INCLUDE   INLIB(IEMAK)
 NAME     IEMAK(R)
               ENTRY     IEMAL
     INCLUDE   INLIB(IEMAL)
 NAME     IEMAL(R)
               ENTRY     IEMAM
     INCLUDE   INLIB(IEMAM)
 NAME     IEMAM(R)
               ENTRY     IEMAN
     INCLUDE   INLIB(IEMAN)
 NAME     IEMAN(R)
               ENTRY     IEMAS
     INCLUDE   INLIB(IEMAS)
 NAME     IEMAS(R)
               ENTRY     IEMAT
     INCLUDE   INLIB(IEMAT)
 NAME     IEMAT(R)
               ENTRY     IEMAV
     INCLUDE   INLIB(IEMAV)
 NAME     IEMAV(R)
               ENTRY     IEMBC
     INCLUDE   INLIB(IEMBC)
 NAME     IEMBC(R)
               ENTRY     IEMBE
     INCLUDE   INLIB(IEMBE)
 NAME     IEMBE(R)
               ENTRY     IEMBF
     INCLUDE   INLIB(IEMBF)
 NAME     IEMBF(R)
               ENTRY     IEMBG
     INCLUDE   INLIB(IEMBG)
 NAME     IEMBG(R)
               ENTRY     IEMBI
     INCLUDE   INLIB(IEMBI)
 NAME     IEMBI(R)
               ENTRY     IEMBJ
     INCLUDE   INLIB(IEMBJ)
 NAME     IEMBJ(R)
               ENTRY     IEMBM
     INCLUDE   INLIB(IEMBM)
 NAME     IEMBM(R)
               ENTRY     IEMBN
     INCLUDE   INLIB(IEMBN)
 NAME     IEMBN(R)
               ENTRY     IEMBO
     INCLUDE   INLIB(IEMBO)
 NAME     IEMBO(R)
               ENTRY     IEMBP
     INCLUDE   INLIB(IEMBP)
 NAME     IEMBP(R)
               ENTRY     IEMBR
     INCLUDE   INLIB(IEMBR)
 NAME     IEMBR(R)
               ENTRY     IEMBS
     INCLUDE   INLIB(IEMBS)
 NAME     IEMBS(R)
               ENTRY     IEMBT
     INCLUDE   INLIB(IEMBT)
 NAME     IEMBT(R)
               ENTRY     IEMBU
     INCLUDE   INLIB(IEMBU)
 NAME     IEMBU(R)
               ENTRY     IEMBV
     INCLUDE   INLIB(IEMBV)
 NAME     IEMBV(R)
               ENTRY     IEMBW
     INCLUDE   INLIB(IEMBW)
 NAME     IEMBW(R)
               ENTRY     IEMBX
     INCLUDE   INLIB(IEMBX)
 NAME     IEMBX(R)
               ENTRY     IEMCA
     INCLUDE   INLIB(IEMCA)
 NAME     IEMCA(R)
               ENTRY     IEMCC
     INCLUDE   INLIB(IEMCC)
 NAME     IEMCC(R)
               ENTRY     IEMCE
     INCLUDE   INLIB(IEMCE)
 NAME     IEMCE(R)
               ENTRY     IEMCG
     INCLUDE   INLIB(IEMCG)
 NAME     IEMCG(R)
               ENTRY     IEMCI
     INCLUDE   INLIB(IEMCI)
 NAME     IEMCI(R)
               ENTRY     IEMCK
     INCLUDE   INLIB(IEMCK)
 NAME     IEMCK(R)
               ENTRY     IEMCL
     INCLUDE   INLIB(IEMCL)
 NAME     IEMCL(R)
               ENTRY     IEMCM
     INCLUDE   INLIB(IEMCM)
 NAME     IEMCM(R)
               ENTRY     IEMCN
     INCLUDE   INLIB(IEMCN)
 NAME     IEMCN(R)
               ENTRY     IEMCO
     INCLUDE   INLIB(IEMCO)
 NAME     IEMCO(R)
               ENTRY     IEMCP
     INCLUDE   INLIB(IEMCP)
 NAME     IEMCP(R)
               ENTRY     IEMCR
     INCLUDE   INLIB(IEMCR)
 NAME     IEMCR(R)
               ENTRY     IEMCS
     INCLUDE   INLIB(IEMCS)
 NAME     IEMCS(R)
               ENTRY     IEMCT
     INCLUDE   INLIB(IEMCT)
 NAME     IEMCT(R)
               ENTRY     IEMCV
     INCLUDE   INLIB(IEMCV)
 NAME     IEMCV(R)
               ENTRY     IEMCW
     INCLUDE   INLIB(IEMCW)
 NAME     IEMCW(R)
               ENTRY     IEMED
     INCLUDE   INLIB(IEMED)
 NAME     IEMED(R)
               ENTRY     IEMEF
     INCLUDE   INLIB(IEMEF)
 NAME     IEMEF(R)
               ENTRY     IEMEG
     INCLUDE   INLIB(IEMEG)
 NAME     IEMEG(R)
               ENTRY     IEMEH
     INCLUDE   INLIB(IEMEH)
 NAME     IEMEH(R)
               ENTRY     IEMEI
     INCLUDE   INLIB(IEMEI)
 NAME     IEMEI(R)
               ENTRY     IEMEJ
     INCLUDE   INLIB(IEMEJ)
 NAME     IEMEJ(R)
               ENTRY     IEMEK
     INCLUDE   INLIB(IEMEK)
 NAME     IEMEK(R)
               ENTRY     IEMEL
     INCLUDE   INLIB(IEMEL)
 NAME     IEMEL(R)
               ENTRY     IEMEM
     INCLUDE   INLIB(IEMEM)
 NAME     IEMEM(R)
               ENTRY     IEMEP
     INCLUDE   INLIB(IEMEP)
 NAME     IEMEP(R)
               ENTRY     IEMEV
     INCLUDE   INLIB(IEMEV)
 NAME     IEMEV(R)
               ENTRY     IEMEW
     INCLUDE   INLIB(IEMEW)
 NAME     IEMEW(R)
               ENTRY     IEMEX
     INCLUDE   INLIB(IEMEX)
 NAME     IEMEX(R)
               ENTRY     IEMEY
     INCLUDE   INLIB(IEMEY)
 NAME     IEMEY(R)
               ENTRY     IEMEZ
     INCLUDE   INLIB(IEMEZ)
 NAME     IEMEZ(R)
               ENTRY     IEMFA
     INCLUDE   INLIB(IEMFA)
 NAME     IEMFA(R)
               ENTRY     IEMFB
     INCLUDE   INLIB(IEMFB)
 NAME     IEMFB(R)
               ENTRY     IEMFE
     INCLUDE   INLIB(IEMFE)
 NAME     IEMFE(R)
               ENTRY     IEMFF
     INCLUDE   INLIB(IEMFF)
 NAME     IEMFF(R)
               ENTRY     IEMFI
     INCLUDE   INLIB(IEMFI)
 NAME     IEMFI(R)
               ENTRY     IEMFO
     INCLUDE   INLIB(IEMFO)
 NAME     IEMFO(R)
               ENTRY     IEMFP
     INCLUDE   INLIB(IEMFP)
 NAME     IEMFP(R)
               ENTRY     IEMFQ
     INCLUDE   INLIB(IEMFQ)
 NAME     IEMFQ(R)
               ENTRY     IEMFT
     INCLUDE   INLIB(IEMFT)
 NAME     IEMFT(R)
               ENTRY     IEMFU
     INCLUDE   INLIB(IEMFU)
 NAME     IEMFU(R)
               ENTRY     IEMFV
     INCLUDE   INLIB(IEMFV)
 NAME     IEMFV(R)
               ENTRY     IEMFW
     INCLUDE   INLIB(IEMFW)
 NAME     IEMFW(R)
               ENTRY     IEMFX
     INCLUDE   INLIB(IEMFX)
 NAME     IEMFX(R)
               ENTRY     IEMFY
     INCLUDE   INLIB(IEMFY)
 NAME     IEMFY(R)
               ENTRY     IEMF1
     INCLUDE   INLIB(IEMF1)
 NAME     IEMF1(R)
               ENTRY     IEMGA
     INCLUDE   INLIB(IEMGA)
 NAME     IEMGA(R)
               ENTRY     IEMGC
     INCLUDE   INLIB(IEMGC)
 NAME     IEMGC(R)
               ENTRY     IEMGK
     INCLUDE   INLIB(IEMGK)
 NAME     IEMGK(R)
               ENTRY     IEMGO
     INCLUDE   INLIB(IEMGO)
 NAME     IEMGO(R)
               ENTRY     IEMGP
     INCLUDE   INLIB(IEMGP)
 NAME     IEMGP(R)
               ENTRY     IEMGQ
     INCLUDE   INLIB(IEMGQ)
 NAME     IEMGQ(R)
               ENTRY     IEMGR
     INCLUDE   INLIB(IEMGR)
 NAME     IEMGR(R)
               ENTRY     IEMGU
     INCLUDE   INLIB(IEMGU)
 NAME     IEMGU(R)
               ENTRY     IEMGV
     INCLUDE   INLIB(IEMGV)
 NAME     IEMGV(R)
               ENTRY     IEMHF
     INCLUDE   INLIB(IEMHF)
 NAME     IEMHF(R)
               ENTRY     IEMHG
     INCLUDE   INLIB(IEMHG)
 NAME     IEMHG(R)
               ENTRY     IEMHK
     INCLUDE   INLIB(IEMHK)
 NAME     IEMHK(R)
               ENTRY     IEMHL
     INCLUDE   INLIB(IEMHL)
 NAME     IEMHL(R)
               ENTRY     IEMHP
     INCLUDE   INLIB(IEMHP)
 NAME     IEMHP(R)
               ENTRY     IEMIA
     INCLUDE   INLIB(IEMIA)
 NAME     IEMIA(R)
               ENTRY     IEMIB
     INCLUDE   INLIB(IEMIB)
 NAME     IEMIB(R)
               ENTRY     IEMIG
     INCLUDE   INLIB(IEMIG)
 NAME     IEMIG(R)
               ENTRY     IEMIK
     INCLUDE   INLIB(IEMIK)
 NAME     IEMIK(R)
               ENTRY     IEMIL
     INCLUDE   INLIB(IEMIL)
 NAME     IEMIL(R)
               ENTRY     IEMIM
     INCLUDE   INLIB(IEMIM)
 NAME     IEMIM(R)
               ENTRY     IEMIN
     INCLUDE   INLIB(IEMIN)
 NAME     IEMIN(R)
               ENTRY     IEMIP
     INCLUDE   INLIB(IEMIP)
 NAME     IEMIP(R)
               ENTRY     IEMIQ
     INCLUDE   INLIB(IEMIQ)
 NAME     IEMIQ(R)
               ENTRY     IEMIT
     INCLUDE   INLIB(IEMIT)
 NAME     IEMIT(R)
               ENTRY     IEMIX
     INCLUDE   INLIB(IEMIX)
 NAME     IEMIX(R)
               ENTRY     IEMJD
     INCLUDE   INLIB(IEMJD)
 NAME     IEMJD(R)
               ENTRY     IEMJI
     INCLUDE   INLIB(IEMJI)
 NAME     IEMJI(R)
               ENTRY     IEMJJ
     INCLUDE   INLIB(IEMJJ)
 NAME     IEMJJ(R)
               ENTRY     IEMJK
     INCLUDE   INLIB(IEMJK)
 NAME     IEMJK(R)
               ENTRY     IEMJL
     INCLUDE   INLIB(IEMJL)
 NAME     IEMJL(R)
               ENTRY     IEMJM
     INCLUDE   INLIB(IEMJM)
 NAME     IEMJM(R)
               ENTRY     IEMJP
     INCLUDE   INLIB(IEMJP)
 NAME     IEMJP(R)
               ENTRY     IEMJZ
     INCLUDE   INLIB(IEMJZ)
 NAME     IEMJZ(R)
               ENTRY     IEMKA
     INCLUDE   INLIB(IEMKA)
 NAME     IEMKA(R)
               ENTRY     IEMKB
     INCLUDE   INLIB(IEMKB)
 NAME     IEMKB(R)
               ENTRY     IEMKC
     INCLUDE   INLIB(IEMKC)
 NAME     IEMKC(R)
               ENTRY     IEMKE
     INCLUDE   INLIB(IEMKE)
 NAME     IEMKE(R)
               ENTRY     IEMKG
     INCLUDE   INLIB(IEMKG)
 NAME     IEMKG(R)
               ENTRY     IEMKJ
     INCLUDE   INLIB(IEMKJ)
 NAME     IEMKJ(R)
               ENTRY     IEMKN
     INCLUDE   INLIB(IEMKN)
 NAME     IEMKN(R)
               ENTRY     IEMKO
     INCLUDE   INLIB(IEMKO)
 NAME     IEMKO(R)
               ENTRY     IEMKP
     INCLUDE   INLIB(IEMKP)
 NAME     IEMKP(R)
               ENTRY     IEMKQ
     INCLUDE   INLIB(IEMKQ)
 NAME     IEMKQ(R)
               ENTRY     IEMKT
     INCLUDE   INLIB(IEMKT)
 NAME     IEMKT(R)
               ENTRY     IEMKU
     INCLUDE   INLIB(IEMKU)
 NAME     IEMKU(R)
               ENTRY     IEMKV
     INCLUDE   INLIB(IEMKV)
 NAME     IEMKV(R)
               ENTRY     IEMLB
     INCLUDE   INLIB(IEMLB)
 NAME     IEMLB(R)
               ENTRY     IEMLC
     INCLUDE   INLIB(IEMLC)
 NAME     IEMLC(R)
               ENTRY     IEMLD
     INCLUDE   INLIB(IEMLD)
 NAME     IEMLD(R)
               ENTRY     IEMLG
     INCLUDE   INLIB(IEMLG)
 NAME     IEMLG(R)
               ENTRY     IEMLH
     INCLUDE   INLIB(IEMLH)
 NAME     IEMLH(R)
               ENTRY     IEMLR
     INCLUDE   INLIB(IEMLR)
 NAME     IEMLR(R)
               ENTRY     IEMLS
     INCLUDE   INLIB(IEMLS)
 NAME     IEMLS(R)
               ENTRY     IEMLT
     INCLUDE   INLIB(IEMLT)
 NAME     IEMLT(R)
               ENTRY     IEMLU
     INCLUDE   INLIB(IEMLU)
 NAME     IEMLU(R)
               ENTRY     IEMLV
     INCLUDE   INLIB(IEMLV)
 NAME     IEMLV(R)
               ENTRY     IEMLW
     INCLUDE   INLIB(IEMLW)
 NAME     IEMLW(R)
               ENTRY     IEMLX
     INCLUDE   INLIB(IEMLX)
 NAME     IEMLX(R)
               ENTRY     IEMLY
     INCLUDE   INLIB(IEMLY)
 NAME     IEMLY(R)
               ENTRY     IEMMA
     INCLUDE   INLIB(IEMMA)
 NAME     IEMMA(R)
               ENTRY     IEMMB
     INCLUDE   INLIB(IEMMB)
 NAME     IEMMB(R)
               ENTRY     IEMMC
     INCLUDE   INLIB(IEMMC)
 NAME     IEMMC(R)
               ENTRY     IEMMD
     INCLUDE   INLIB(IEMMD)
 NAME     IEMMD(R)
               ENTRY     IEMME
     INCLUDE   INLIB(IEMME)
 NAME     IEMME(R)
               ENTRY     IEMMF
     INCLUDE   INLIB(IEMMF)
 NAME     IEMMF(R)
               ENTRY     IEMMG
     INCLUDE   INLIB(IEMMG)
 NAME     IEMMG(R)
               ENTRY     IEMMH
     INCLUDE   INLIB(IEMMH)
 NAME     IEMMH(R)
               ENTRY     IEMMI
     INCLUDE   INLIB(IEMMI)
 NAME     IEMMI(R)
               ENTRY     IEMMJ
     INCLUDE   INLIB(IEMMJ)
 NAME     IEMMJ(R)
               ENTRY     IEMMK
     INCLUDE   INLIB(IEMMK)
 NAME     IEMMK(R)
               ENTRY     IEMML
     INCLUDE   INLIB(IEMML)
 NAME     IEMML(R)
               ENTRY     IEMMM
     INCLUDE   INLIB(IEMMM)
 NAME     IEMMM(R)
               ENTRY     IEMMN
     INCLUDE   INLIB(IEMMN)
 NAME     IEMMN(R)
               ENTRY     IEMMO
     INCLUDE   INLIB(IEMMO)
 NAME     IEMMO(R)
               ENTRY     IEMMP
     INCLUDE   INLIB(IEMMP)
 NAME     IEMMP(R)
               ENTRY     IEMMS
     INCLUDE   INLIB(IEMMS)
 NAME     IEMMS(R)
               ENTRY     IEMMT
     INCLUDE   INLIB(IEMMT)
 NAME     IEMMT(R)
               ENTRY     IEMNA
     INCLUDE   INLIB(IEMNA)
 NAME     IEMNA(R)
               ENTRY     IEMNB
     INCLUDE   INLIB(IEMNB)
 NAME     IEMNB(R)
               ENTRY     IEMNG
     INCLUDE   INLIB(IEMNG)
 NAME     IEMNG(R)
               ENTRY     IEMNH
     INCLUDE   INLIB(IEMNH)
 NAME     IEMNH(R)
               ENTRY     IEMNJ
     INCLUDE   INLIB(IEMNJ)
 NAME     IEMNJ(R)
               ENTRY     IEMNK
     INCLUDE   INLIB(IEMNK)
 NAME     IEMNK(R)
               ENTRY     IEMNM
     INCLUDE   INLIB(IEMNM)
 NAME     IEMNM(R)
               ENTRY     IEMNN
     INCLUDE   INLIB(IEMNN)
 NAME     IEMNN(R)
               ENTRY     IEMNT
     INCLUDE   INLIB(IEMNT)
 NAME     IEMNT(R)
               ENTRY     IEMNU
     INCLUDE   INLIB(IEMNU)
 NAME     IEMNU(R)
               ENTRY     IEMNV
     INCLUDE   INLIB(IEMNV)
 NAME     IEMNV(R)
               ENTRY     IEMOB
     INCLUDE   INLIB(IEMOB)
 NAME     IEMOB(R)
               ENTRY     IEMOC
     INCLUDE   INLIB(IEMOC)
 NAME     IEMOC(R)
               ENTRY     IEMOD
     INCLUDE   INLIB(IEMOD)
 NAME     IEMOD(R)
               ENTRY     IEMOE
     INCLUDE   INLIB(IEMOE)
 NAME     IEMOE(R)
               ENTRY     IEMOF
     INCLUDE   INLIB(IEMOF)
 NAME     IEMOF(R)
               ENTRY     IEMOG
     INCLUDE   INLIB(IEMOG)
 NAME     IEMOG(R)
               ENTRY     IEMOH
     INCLUDE   INLIB(IEMOH)
 NAME     IEMOH(R)
               ENTRY     IEMOI
     INCLUDE   INLIB(IEMOI)
 NAME     IEMOI(R)
               ENTRY     IEMOL
     INCLUDE   INLIB(IEMOL)
 NAME     IEMOL(R)
               ENTRY     IEMOM
     INCLUDE   INLIB(IEMOM)
 NAME     IEMOM(R)
               ENTRY     IEMON
     INCLUDE   INLIB(IEMON)
 NAME     IEMON(R)
               ENTRY     IEMOO
     INCLUDE   INLIB(IEMOO)
 NAME     IEMOO(R)
               ENTRY     IEMOP
     INCLUDE   INLIB(IEMOP)
 NAME     IEMOP(R)
               ENTRY     IEMOS
     INCLUDE   INLIB(IEMOS)
 NAME     IEMOS(R)
               ENTRY     IEMOT
     INCLUDE   INLIB(IEMOT)
 NAME     IEMOT(R)
               ENTRY     IEMOU
     INCLUDE   INLIB(IEMOU)
 NAME     IEMOU(R)
               ENTRY     IEMPD
     INCLUDE   INLIB(IEMPD)
 NAME     IEMPD(R)
               ENTRY     IEMPH
     INCLUDE   INLIB(IEMPH)
 NAME     IEMPH(R)
               ENTRY     IEMPL
     INCLUDE   INLIB(IEMPL)
 NAME     IEMPL(R)
               ENTRY     IEMPM
     INCLUDE   INLIB(IEMPM)
 NAME     IEMPM(R)
               ENTRY     IEMPO
     INCLUDE   INLIB(IEMPO)
 NAME     IEMPO(R)
               ENTRY     IEMPP
     INCLUDE   INLIB(IEMPP)
 NAME     IEMPP(R)
               ENTRY     IEMPT
     INCLUDE   INLIB(IEMPT)
 NAME     IEMPT(R)
               ENTRY     IEMPU
     INCLUDE   INLIB(IEMPU)
 NAME     IEMPU(R)
               ENTRY     IEMPV
     INCLUDE   INLIB(IEMPV)
 NAME     IEMPV(R)
               ENTRY     IEMQF
     INCLUDE   INLIB(IEMQF)
 NAME     IEMQF(R)
               ENTRY     IEMQG
     INCLUDE   INLIB(IEMQG)
 NAME     IEMQG(R)
               ENTRY     IEMQH
     INCLUDE   INLIB(IEMQH)
 NAME     IEMQH(R)
               ENTRY     IEMQJ
     INCLUDE   INLIB(IEMQJ)
 NAME     IEMQJ(R)
               ENTRY     IEMQK
     INCLUDE   INLIB(IEMQK)
 NAME     IEMQK(R)
               ENTRY     IEMQL
     INCLUDE   INLIB(IEMQL)
 NAME     IEMQL(R)
               ENTRY     IEMQU
     INCLUDE   INLIB(IEMQU)
 NAME     IEMQU(R)
               ENTRY     IEMQX
     INCLUDE   INLIB(IEMQX)
 NAME     IEMQX(R)
               ENTRY     IEMRA
     INCLUDE   INLIB(IEMRA)
 NAME     IEMRA(R)
               ENTRY     IEMRB
     INCLUDE   INLIB(IEMRB)
 NAME     IEMRB(R)
               ENTRY     IEMRC
     INCLUDE   INLIB(IEMRC)
 NAME     IEMRC(R)
               ENTRY     IEMRD
     INCLUDE   INLIB(IEMRD)
 NAME     IEMRD(R)
               ENTRY     IEMRF
     INCLUDE   INLIB(IEMRF)
 NAME     IEMRF(R)
               ENTRY     IEMRG
     INCLUDE   INLIB(IEMRG)
 NAME     IEMRG(R)
               ENTRY     IEMTF
     INCLUDE   INLIB(IEMTF)
 NAME     IEMTF(R)
               ENTRY     IEMTJ
     INCLUDE   INLIB(IEMTJ)
 NAME     IEMTJ(R)
               ENTRY     IEMTK
     INCLUDE   INLIB(IEMTK)
 NAME     IEMTK(R)
               ENTRY     IEMTO
     INCLUDE   INLIB(IEMTO)
 NAME     IEMTO(R)
               ENTRY     IEMTP
     INCLUDE   INLIB(IEMTP)
 NAME     IEMTP(R)
               ENTRY     IEMTQ
     INCLUDE   INLIB(IEMTQ)
 NAME     IEMTQ(R)
               ENTRY     IEMTT
     INCLUDE   INLIB(IEMTT)
 NAME     IEMTT(R)
               ENTRY     IEMTU
     INCLUDE   INLIB(IEMTU)
 NAME     IEMTU(R)
               ENTRY     IEMUA
     INCLUDE   INLIB(IEMUA)
 NAME     IEMUA(R)
               ENTRY     IEMUB
     INCLUDE   INLIB(IEMUB)
 NAME     IEMUB(R)
               ENTRY     IEMUC
     INCLUDE   INLIB(IEMUC)
 NAME     IEMUC(R)
               ENTRY     IEMUD
     INCLUDE   INLIB(IEMUD)
 NAME     IEMUD(R)
               ENTRY     IEMUE
     INCLUDE   INLIB(IEMUE)
 NAME     IEMUE(R)
               ENTRY     IEMUF
     INCLUDE   INLIB(IEMUF)
 NAME     IEMUF(R)
               ENTRY     IEMUG
     INCLUDE   INLIB(IEMUG)
 NAME     IEMUG(R)
               ENTRY     IEMUH
     INCLUDE   INLIB(IEMUH)
 NAME     IEMUH(R)
               ENTRY     IEMUI
     INCLUDE   INLIB(IEMUI)
 NAME     IEMUI(R)
               ENTRY     IEMXA
     INCLUDE   INLIB(IEMXA)
 NAME     IEMXA(R)
               ENTRY     IEMXB
     INCLUDE   INLIB(IEMXB)
 NAME     IEMXB(R)
               ENTRY     IEMXC
     INCLUDE   INLIB(IEMXC)
 NAME     IEMXC(R)
               ENTRY     IEMXF
     INCLUDE   INLIB(IEMXF)
 NAME     IEMXF(R)
               ENTRY     IEMXG
     INCLUDE   INLIB(IEMXG)
 NAME     IEMXG(R)
               ENTRY     IEMXH
     INCLUDE   INLIB(IEMXH)
 NAME     IEMXH(R)
               ENTRY     IEMXI
     INCLUDE   INLIB(IEMXI)
 NAME     IEMXI(R)
               ENTRY     IEMXJ
     INCLUDE   INLIB(IEMXJ)
 NAME     IEMXJ(R)
               ENTRY     IEMXO
     INCLUDE   INLIB(IEMXO)
 NAME     IEMXO(R)
               ENTRY     IEMXP
     INCLUDE   INLIB(IEMXP)
 NAME     IEMXP(R)
               ENTRY     IEMXQ
     INCLUDE   INLIB(IEMXQ)
 NAME     IEMXQ(R)
               ENTRY     IEMXR
     INCLUDE   INLIB(IEMXR)
 NAME     IEMXR(R)
               ENTRY     IEMXS
     INCLUDE   INLIB(IEMXS)
 NAME     IEMXS(R)
               ENTRY     IEMXT
     INCLUDE   INLIB(IEMXT)
 NAME     IEMXT(R)
               ENTRY     IEMXU
     INCLUDE   INLIB(IEMXU)
 NAME     IEMXU(R)
               ENTRY     IEMXV
     INCLUDE   INLIB(IEMXV)
 NAME     IEMXV(R)
               ENTRY     IEMXW
     INCLUDE   INLIB(IEMXW)
 NAME     IEMXW(R)
               ENTRY     IEMYL
     INCLUDE   INLIB(IEMYL)
 NAME     IEMYL(R)
               ENTRY     IEMYM
     INCLUDE   INLIB(IEMYM)
 NAME     IEMYM(R)
               ENTRY     IEMYN
     INCLUDE   INLIB(IEMYN)
 NAME     IEMYN(R)
               ENTRY     IEMYO
     INCLUDE   INLIB(IEMYO)
 NAME     IEMYO(R)
               ENTRY     IEMYP
     INCLUDE   INLIB(IEMYP)
 NAME     IEMYP(R)
               ENTRY     IEMYQ
     INCLUDE   INLIB(IEMYQ)
 NAME     IEMYQ(R)
               ENTRY     IEMYX
     INCLUDE   INLIB(IEMYX)
 NAME     IEMYX(R)
               ENTRY     IEMYY
     INCLUDE   INLIB(IEMYY)
 NAME     IEMYY(R)
/*
//*
//LINK002 EXEC PGM=IEWL,REGION=512K,
//             PARM='LET,LIST,XREF,NCAL'
//SYSPRINT DD  SYSOUT=A
//SYSUT1   DD  SPACE=(CYL,(5,1)),UNIT=SYSDA
//SYSLMOD  DD  DSN=SYS2.LINKLIB,DISP=OLD         <== TARGET
//INLIB    DD  DSN=&&PL1LOAD,DISP=(OLD,PASS)
//SYSLIN   DD  *
               ENTRY     IEMAF
     INCLUDE   INLIB(IEMAF)
 NAME     IEMAF(R)
/*
//*
//LINK003 EXEC PGM=IEWL,REGION=512K,
//             PARM='LET,LIST,XREF,NCAL,DC,AC=1'
//SYSPRINT DD  SYSOUT=A
//SYSUT1   DD  SPACE=(CYL,(5,1)),UNIT=SYSDA
//SYSLMOD  DD  DSN=SYS2.LINKLIB,DISP=OLD         <== TARGET
//INLIB    DD  DSN=&&PL1LOAD,DISP=(OLD,PASS)
//SYSLIN   DD  *
               ENTRY     IEMAP
     INCLUDE   INLIB(IEMAP)
 NAME     IEMAP(R)
               ENTRY     IEMFZ
     INCLUDE   INLIB(IEMFZ)
 NAME     IEMFZ(R)
               ENTRY     IEMGB
     INCLUDE   INLIB(IEMGB)
 NAME     IEMGB(R)
               ENTRY     IEMIC
     INCLUDE   INLIB(IEMIC)
 NAME     IEMIC(R)
               ENTRY     IEMOQ
     INCLUDE   INLIB(IEMOQ)
 NAME     IEMOQ(R)
               ENTRY     IEMPA
     INCLUDE   INLIB(IEMPA)
 NAME     IEMPA(R)
/*
//*
//CLEANUP EXEC PGM=IDCAMS
//SYSPRINT DD  SYSOUT=*
//SYSIN    DD  *
 DELETE SYS1.PL1LIB NONVSAM
 SET LASTCC=0
 SET MAXCC=0
//LINK004 EXEC PGM=IEWL,REGION=512K,
//             PARM='LET,LIST,XREF,NCAL,RENT,REUS,REFR'
//SYSPRINT DD  SYSOUT=A
//SYSUT1   DD  SPACE=(CYL,(5,1)),UNIT=SYSDA
//SYSLMOD  DD  DSN=SYS1.PL1LIB,DISP=(,CATLG),    <== TARGET
//             UNIT=3350,VOL=SER=MVSRES,
//             SPACE=(TRK,(90,30,95)),
//             DCB=(SYS1.LINKLIB)
//INLIB    DD  DSN=&&PL1LIB,DISP=(OLD,PASS)
//SYSLIN   DD  *
               ENTRY     IHEABN
     INCLUDE   INLIB(IHEABND)
 NAME     IHEABND(R)
               ENTRY     IHEABU
     INCLUDE   INLIB(IHEABU0)
 NAME     IHEABU0(R)
               ENTRY     IHEABV
     INCLUDE   INLIB(IHEABV0)
 NAME     IHEABV0(R)
               ENTRY     IHEABW
     INCLUDE   INLIB(IHEABW0)
 NAME     IHEABW0(R)
               ENTRY     IHEABZ
     INCLUDE   INLIB(IHEABZ0)
 NAME     IHEABZ0(R)
               ENTRY     IHEADD
     INCLUDE   INLIB(IHEADD0)
 NAME     IHEADD0(R)
               ENTRY     IHEADV
     INCLUDE   INLIB(IHEADV0)
 NAME     IHEADV0(R)
               ENTRY     IHEAPD
          ALIAS     IHEAPDB
     INCLUDE   INLIB(IHEAPDA)
 NAME     IHEAPDA(R)
               ENTRY     IHEATL
          ALIAS     IHEATL3
          ALIAS     IHEATL2
          ALIAS     IHEATL1
     INCLUDE   INLIB(IHEATL4)
 NAME     IHEATL4(R)
               ENTRY     IHEATS
          ALIAS     IHEATS4
          ALIAS     IHEATS3
          ALIAS     IHEATS2
     INCLUDE   INLIB(IHEATS1)
 NAME     IHEATS1(R)
               ENTRY     IHEATW
          ALIAS     IHEATWH
     INCLUDE   INLIB(IHEATWN)
 NAME     IHEATWN(R)
               ENTRY     IHEATZ
          ALIAS     IHEATZH
     INCLUDE   INLIB(IHEATZN)
 NAME     IHEATZN(R)
               ENTRY     IHEBEG
          ALIAS     IHEBEGA
     INCLUDE   INLIB(IHEBEGN)
 NAME     IHEBEGN(R)
               ENTRY     IHEBSA
     INCLUDE   INLIB(IHEBSA0)
 NAME     IHEBSA0(R)
               ENTRY     IHEBSC
     INCLUDE   INLIB(IHEBSC0)
 NAME     IHEBSC0(R)
               ENTRY     IHEBSD
     INCLUDE   INLIB(IHEBSD0)
 NAME     IHEBSD0(R)
               ENTRY     IHEBSF
     INCLUDE   INLIB(IHEBSF0)
 NAME     IHEBSF0(R)
               ENTRY     IHEBSI
     INCLUDE   INLIB(IHEBSI0)
 NAME     IHEBSI0(R)
               ENTRY     IHEBSK
          ALIAS     IHEBSKR
          ALIAS     IHEBSKA
     INCLUDE   INLIB(IHEBSKK)
 NAME     IHEBSKK(R)
               ENTRY     IHEBSM
          ALIAS     IHEBSMZ
          ALIAS     IHEBSMV
     INCLUDE   INLIB(IHEBSMF)
 NAME     IHEBSMF(R)
               ENTRY     IHEBSN
     INCLUDE   INLIB(IHEBSN0)
 NAME     IHEBSN0(R)
               ENTRY     IHEBSO
     INCLUDE   INLIB(IHEBSO0)
 NAME     IHEBSO0(R)
               ENTRY     IHEBSS
          ALIAS     IHEBSS3
     INCLUDE   INLIB(IHEBSS2)
 NAME     IHEBSS2(R)
               ENTRY     IHEBST
     INCLUDE   INLIB(IHEBSTA)
 NAME     IHEBSTA(R)
               ENTRY     IHEBSV
     INCLUDE   INLIB(IHEBSVA)
 NAME     IHEBSVA(R)
               ENTRY     IHECFA
     INCLUDE   INLIB(IHECFAA)
 NAME     IHECFAA(R)
               ENTRY     IHECFB
     INCLUDE   INLIB(IHECFBA)
 NAME     IHECFBA(R)
               ENTRY     IHECFC
     INCLUDE   INLIB(IHECFCA)
 NAME     IHECFCA(R)
               ENTRY     IHECKP
          ALIAS     IHECKPS
     INCLUDE   INLIB(IHECKPT)
 NAME     IHECKPT(R)
               ENTRY     IHECLS
     INCLUDE   INLIB(IHECLSA)
 NAME     IHECLSA(R)
               ENTRY     IHECLT
          ALIAS     IHECLTB
     INCLUDE   INLIB(IHECLTA)
 NAME     IHECLTA(R)
               ENTRY     IHECNT
          ALIAS     IHECNTB
     INCLUDE   INLIB(IHECNTA)
 NAME     IHECNTA(R)
               ENTRY     IHECSC
     INCLUDE   INLIB(IHECSC0)
 NAME     IHECSC0(R)
               ENTRY     IHECSI
     INCLUDE   INLIB(IHECSI0)
 NAME     IHECSI0(R)
               ENTRY     IHECSK
          ALIAS     IHECSKR
     INCLUDE   INLIB(IHECSKK)
 NAME     IHECSKK(R)
               ENTRY     IHECSM
          ALIAS     IHECSMV
          ALIAS     IHECSML
          ALIAS     IHECSMH
          ALIAS     IHECSMB
     INCLUDE   INLIB(IHECSMF)
 NAME     IHECSMF(R)
               ENTRY     IHECSS
          ALIAS     IHECSS3
     INCLUDE   INLIB(IHECSS2)
 NAME     IHECSS2(R)
               ENTRY     IHECST
     INCLUDE   INLIB(IHECSTA)
 NAME     IHECSTA(R)
               ENTRY     IHECSV
     INCLUDE   INLIB(IHECSVA)
 NAME     IHECSVA(R)
               ENTRY     IHECTT
          ALIAS     IHECTTC
          ALIAS     IHECTTB
     INCLUDE   INLIB(IHECTTA)
 NAME     IHECTTA(R)
               ENTRY     IHEDBN
          ALIAS     IHEDBN
     INCLUDE   INLIB(IHEDBNA)
 NAME     IHEDBNA(R)
               ENTRY     IHEDCN
          ALIAS     IHEDCNB
          ALIAS     IHEDCN
     INCLUDE   INLIB(IHEDCNA)
 NAME     IHEDCNA(R)
               ENTRY     IHEDDI
          ALIAS     IHEDDIB
     INCLUDE   INLIB(IHEDDIA)
 NAME     IHEDDIA(R)
               ENTRY     IHEDDJ
          ALIAS     IHEDDJ
     INCLUDE   INLIB(IHEDDJA)
 NAME     IHEDDJA(R)
               ENTRY     IHEDDO
          ALIAS     IHEDDOE
          ALIAS     IHEDDOD
          ALIAS     IHEDDOC
          ALIAS     IHEDDOB
          ALIAS     IHEDDO
     INCLUDE   INLIB(IHEDDOA)
 NAME     IHEDDOA(R)
               ENTRY     IHEDDP
          ALIAS     IHEDDPD
          ALIAS     IHEDDPC
          ALIAS     IHEDDPB
          ALIAS     IHEDDP
     INCLUDE   INLIB(IHEDDPA)
 NAME     IHEDDPA(R)
               ENTRY     IHEDDT
          ALIAS     IHEDDTE
          ALIAS     IHEDDTD
          ALIAS     IHEDDTC
          ALIAS     IHEDDTB
          ALIAS     IHEDDT
     INCLUDE   INLIB(IHEDDTA)
 NAME     IHEDDTA(R)
               ENTRY     IHEDIA
          ALIAS     IHEDIAB
          ALIAS     IHEDIA
     INCLUDE   INLIB(IHEDIAA)
 NAME     IHEDIAA(R)
               ENTRY     IHEDIB
          ALIAS     IHEDIBB
     INCLUDE   INLIB(IHEDIBA)
 NAME     IHEDIBA(R)
               ENTRY     IHEDID
     INCLUDE   INLIB(IHEDIDA)
 NAME     IHEDIDA(R)
               ENTRY     IHEDIE
          ALIAS     IHEDIE
     INCLUDE   INLIB(IHEDIEA)
 NAME     IHEDIEA(R)
               ENTRY     IHEDIL
          ALIAS     IHEDILB
     INCLUDE   INLIB(IHEDILA)
 NAME     IHEDILA(R)
               ENTRY     IHEDIM
     INCLUDE   INLIB(IHEDIMA)
 NAME     IHEDIMA(R)
               ENTRY     IHEDMA
          ALIAS     IHEDMA
     INCLUDE   INLIB(IHEDMAA)
 NAME     IHEDMAA(R)
               ENTRY     IHEDNB
          ALIAS     IHEDNB
     INCLUDE   INLIB(IHEDNBA)
 NAME     IHEDNBA(R)
               ENTRY     IHEDNC
          ALIAS     IHEDNC
     INCLUDE   INLIB(IHEDNCA)
 NAME     IHEDNCA(R)
               ENTRY     IHEDOA
          ALIAS     IHEDOAB
          ALIAS     IHEDOA
     INCLUDE   INLIB(IHEDOAA)
 NAME     IHEDOAA(R)
               ENTRY     IHEDOB
          ALIAS     IHEDOBC
          ALIAS     IHEDOBB
     INCLUDE   INLIB(IHEDOBA)
 NAME     IHEDOBA(R)
               ENTRY     IHEDOD
          ALIAS     IHEDODB
     INCLUDE   INLIB(IHEDODA)
 NAME     IHEDODA(R)
               ENTRY     IHEDOE
          ALIAS     IHEDOE
     INCLUDE   INLIB(IHEDOEA)
 NAME     IHEDOEA(R)
               ENTRY     IHEDOM
     INCLUDE   INLIB(IHEDOMA)
 NAME     IHEDOMA(R)
               ENTRY     IHEDSP
     INCLUDE   INLIB(IHEDSPA)
 NAME     IHEDSPA(R)
               ENTRY     IHEDUM
          ALIAS     IHEDUMT
          ALIAS     IHEDUMJ
          ALIAS     IHEDUMC
     INCLUDE   INLIB(IHEDUMP)
 NAME     IHEDUMP(R)
               ENTRY     IHEDVU
     INCLUDE   INLIB(IHEDVU0)
 NAME     IHEDVU0(R)
               ENTRY     IHEDVV
     INCLUDE   INLIB(IHEDVV0)
 NAME     IHEDVV0(R)
               ENTRY     IHEDZW
     INCLUDE   INLIB(IHEDZW0)
 NAME     IHEDZW0(R)
               ENTRY     IHEDZZ
     INCLUDE   INLIB(IHEDZZ0)
 NAME     IHEDZZ0(R)
               ENTRY     IHEEFL
          ALIAS     IHEEFLF
     INCLUDE   INLIB(IHEEFLC)
 NAME     IHEEFLC(R)
               ENTRY     IHEEFS
          ALIAS     IHEEFSC
     INCLUDE   INLIB(IHEEFSF)
 NAME     IHEEFSF(R)
               ENTRY     IHEERD
     INCLUDE   INLIB(IHEERDA)
 NAME     IHEERDA(R)
               ENTRY     IHEERE
     INCLUDE   INLIB(IHEEREA)
 NAME     IHEEREA(R)
               ENTRY     IHEERI
     INCLUDE   INLIB(IHEERIA)
 NAME     IHEERIA(R)
               ENTRY     IHEERN
     INCLUDE   INLIB(IHEERNA)
 NAME     IHEERNA(R)
               ENTRY     IHEERO
     INCLUDE   INLIB(IHEEROA)
 NAME     IHEEROA(R)
               ENTRY     IHEERP
     INCLUDE   INLIB(IHEERPA)
 NAME     IHEERPA(R)
               ENTRY     IHEERR
          ALIAS     IHEERRD
          ALIAS     IHEERRC
          ALIAS     IHEERRB
     INCLUDE   INLIB(IHEERRA)
 NAME     IHEERRA(R)
               ENTRY     IHEERS
          ALIAS     IHEERSB
     INCLUDE   INLIB(IHEERSA)
 NAME     IHEERSA(R)
               ENTRY     IHEERT
     INCLUDE   INLIB(IHEERTA)
 NAME     IHEERTA(R)
               ENTRY     IHEESM
          ALIAS     IHEESMB
     INCLUDE   INLIB(IHEESMA)
 NAME     IHEESMA(R)
               ENTRY     IHEESS
          ALIAS     IHEESSB
     INCLUDE   INLIB(IHEESSA)
 NAME     IHEESSA(R)
               ENTRY     IHEEXL
     INCLUDE   INLIB(IHEEXL0)
 NAME     IHEEXL0(R)
               ENTRY     IHEEXS
     INCLUDE   INLIB(IHEEXS0)
 NAME     IHEEXS0(R)
               ENTRY     IHEEXW
     INCLUDE   INLIB(IHEEXW0)
 NAME     IHEEXW0(R)
               ENTRY     IHEEXZ
     INCLUDE   INLIB(IHEEXZ0)
 NAME     IHEEXZ0(R)
               ENTRY     IHEHTL
     INCLUDE   INLIB(IHEHTL0)
 NAME     IHEHTL0(R)
               ENTRY     IHEHTS
     INCLUDE   INLIB(IHEHTS0)
 NAME     IHEHTS0(R)
               ENTRY     IHEIBT
          ALIAS     IHEIBTE
          ALIAS     IHEIBTD
          ALIAS     IHEIBTC
          ALIAS     IHEIBTB
     INCLUDE   INLIB(IHEIBTA)
 NAME     IHEIBTA(R)
               ENTRY     IHEIGT
     INCLUDE   INLIB(IHEIGTA)
 NAME     IHEIGTA(R)
               ENTRY     IHEINT
     INCLUDE   INLIB(IHEINTA)
 NAME     IHEINTA(R)
               ENTRY     IHEIOA
          ALIAS     IHEIOAD
          ALIAS     IHEIOAC
          ALIAS     IHEIOAB
     INCLUDE   INLIB(IHEIOAA)
 NAME     IHEIOAA(R)
               ENTRY     IHEIOB
          ALIAS     IHEIOBE
          ALIAS     IHEIOBD
          ALIAS     IHEIOBC
          ALIAS     IHEIOBB
     INCLUDE   INLIB(IHEIOBA)
 NAME     IHEIOBA(R)
               ENTRY     IHEIOC
          ALIAS     IHEIOCC
          ALIAS     IHEIOCB
     INCLUDE   INLIB(IHEIOCA)
 NAME     IHEIOCA(R)
               ENTRY     IHEIOD
          ALIAS     IHEIODP
     INCLUDE   INLIB(IHEIODG)
 NAME     IHEIODG(R)
               ENTRY     IHEIOF
     INCLUDE   INLIB(IHEIOFA)
 NAME     IHEIOFA(R)
               ENTRY     IHEIOG
     INCLUDE   INLIB(IHEIOGA)
 NAME     IHEIOGA(R)
               ENTRY     IHEION
     INCLUDE   INLIB(IHEIONA)
 NAME     IHEIONA(R)
               ENTRY     IHEIOP
          ALIAS     IHEIOPC
          ALIAS     IHEIOPB
     INCLUDE   INLIB(IHEIOPA)
 NAME     IHEIOPA(R)
               ENTRY     IHEIOX
          ALIAS     IHEIOXC
          ALIAS     IHEIOXB
     INCLUDE   INLIB(IHEIOXA)
 NAME     IHEIOXA(R)
               ENTRY     IHEITB
     INCLUDE   INLIB(IHEITBA)
 NAME     IHEITBA(R)
               ENTRY     IHEITC
     INCLUDE   INLIB(IHEITCA)
 NAME     IHEITCA(R)
               ENTRY     IHEITD
     INCLUDE   INLIB(IHEITDA)
 NAME     IHEITDA(R)
               ENTRY     IHEITE
     INCLUDE   INLIB(IHEITEA)
 NAME     IHEITEA(R)
               ENTRY     IHEITF
     INCLUDE   INLIB(IHEITFA)
 NAME     IHEITFA(R)
               ENTRY     IHEITG
     INCLUDE   INLIB(IHEITGA)
 NAME     IHEITGA(R)
               ENTRY     IHEITH
     INCLUDE   INLIB(IHEITHA)
 NAME     IHEITHA(R)
               ENTRY     IHEITJ
     INCLUDE   INLIB(IHEITJA)
 NAME     IHEITJA(R)
               ENTRY     IHEITK
     INCLUDE   INLIB(IHEITKA)
 NAME     IHEITKA(R)
               ENTRY     IHEITL
     INCLUDE   INLIB(IHEITLA)
 NAME     IHEITLA(R)
               ENTRY     IHEITM
     INCLUDE   INLIB(IHEITMA)
 NAME     IHEITMA(R)
               ENTRY     IHEITN
     INCLUDE   INLIB(IHEITNA)
 NAME     IHEITNA(R)
               ENTRY     IHEITO
     INCLUDE   INLIB(IHEITOA)
 NAME     IHEITOA(R)
               ENTRY     IHEITP
     INCLUDE   INLIB(IHEITPA)
 NAME     IHEITPA(R)
               ENTRY     IHEJXI
          ALIAS     IHEJXIY
     INCLUDE   INLIB(IHEJXII)
 NAME     IHEJXII(R)
               ENTRY     IHEJXS
          ALIAS     IHEJXSY
     INCLUDE   INLIB(IHEJXSI)
 NAME     IHEJXSI(R)
               ENTRY     IHEKCA
          ALIAS     IHEKCA
     INCLUDE   INLIB(IHEKCAA)
 NAME     IHEKCAA(R)
               ENTRY     IHEKCB
          ALIAS     IHEKCB
     INCLUDE   INLIB(IHEKCBA)
 NAME     IHEKCBA(R)
               ENTRY     IHEKCD
          ALIAS     IHEKCDB
          ALIAS     IHEKCD
     INCLUDE   INLIB(IHEKCDA)
 NAME     IHEKCDA(R)
               ENTRY     IHELDI
          ALIAS     IHELDID
          ALIAS     IHELDIC
          ALIAS     IHELDIB
     INCLUDE   INLIB(IHELDIA)
 NAME     IHELDIA(R)
               ENTRY     IHELDO
          ALIAS     IHELDOC
          ALIAS     IHELDOB
     INCLUDE   INLIB(IHELDOA)
 NAME     IHELDOA(R)
               ENTRY     IHELNL
          ALIAS     IHELNLE
          ALIAS     IHELNLD
     INCLUDE   INLIB(IHELNL2)
 NAME     IHELNL2(R)
               ENTRY     IHELNS
          ALIAS     IHELNSE
          ALIAS     IHELNSD
     INCLUDE   INLIB(IHELNS2)
 NAME     IHELNS2(R)
               ENTRY     IHELNW
     INCLUDE   INLIB(IHELNW0)
 NAME     IHELNW0(R)
               ENTRY     IHELNZ
     INCLUDE   INLIB(IHELNZ0)
 NAME     IHELNZ0(R)
               ENTRY     IHELSP
          ALIAS     IHELSPE
          ALIAS     IHELSPD
          ALIAS     IHELSPC
          ALIAS     IHELSPB
     INCLUDE   INLIB(IHELSPA)
 NAME     IHELSPA(R)
               ENTRY     IHELTTA
     INCLUDE   INLIB(IHELTTA)
 NAME     IHELTTA(R)
               ENTRY     IHEPRD
     INCLUDE   INLIB(IHELTVA)
 NAME     IHELTVA(R)
               ENTRY     IHEMAIN
     INCLUDE   INLIB(IHEMAIN)
 NAME     IHEMAIN(R)
               ENTRY     IHEMPU
     INCLUDE   INLIB(IHEMPU0)
 NAME     IHEMPU0(R)
               ENTRY     IHEMPV
     INCLUDE   INLIB(IHEMPV0)
 NAME     IHEMPV0(R)
               ENTRY     IHEMXB
          ALIAS     IHEMXBN
     INCLUDE   INLIB(IHEMXBX)
 NAME     IHEMXBX(R)
               ENTRY     IHEMXD
          ALIAS     IHEMXDN
     INCLUDE   INLIB(IHEMXDX)
 NAME     IHEMXDX(R)
               ENTRY     IHEMXL
          ALIAS     IHEMXLN
     INCLUDE   INLIB(IHEMXLX)
 NAME     IHEMXLX(R)
               ENTRY     IHEMXS
          ALIAS     IHEMXSN
     INCLUDE   INLIB(IHEMXSX)
 NAME     IHEMXSX(R)
               ENTRY     IHEMZU
          ALIAS     IHEMZUD
     INCLUDE   INLIB(IHEMZUM)
 NAME     IHEMZUM(R)
               ENTRY     IHEMZV
          ALIAS     IHEMZVD
     INCLUDE   INLIB(IHEMZVM)
 NAME     IHEMZVM(R)
               ENTRY     IHEMZW
     INCLUDE   INLIB(IHEMZW0)
 NAME     IHEMZW0(R)
               ENTRY     IHEMZZ
     INCLUDE   INLIB(IHEMZZ0)
 NAME     IHEMZZ0(R)
               ENTRY     IHEM91
          ALIAS     IHEM91C
          ALIAS     IHEM91B
          ALIAS     IHEM91
     INCLUDE   INLIB(IHEM91A)
 NAME     IHEM91A(R)
               ENTRY     IHENL1
          ALIAS     IHENL1L
          ALIAS     IHENL1A
     INCLUDE   INLIB(IHENL1N)
 NAME     IHENL1N(R)
               ENTRY     IHENL2
          ALIAS     IHENL2L
          ALIAS     IHENL2A
     INCLUDE   INLIB(IHENL2N)
 NAME     IHENL2N(R)
               ENTRY     IHEOCL
          ALIAS     IHEOCLD
          ALIAS     IHEOCLC
          ALIAS     IHEOCLB
     INCLUDE   INLIB(IHEOCLA)
 NAME     IHEOCLA(R)
               ENTRY     IHEOCT
          ALIAS     IHEOCTD
          ALIAS     IHEOCTC
          ALIAS     IHEOCTB
     INCLUDE   INLIB(IHEOCTA)
 NAME     IHEOCTA(R)
               ENTRY     IHEOPN
     INCLUDE   INLIB(IHEOPNA)
 NAME     IHEOPNA(R)
               ENTRY     IHEOPO
     INCLUDE   INLIB(IHEOPOA)
 NAME     IHEOPOA(R)
               ENTRY     IHEOPP
     INCLUDE   INLIB(IHEOPPA)
 NAME     IHEOPPA(R)
               ENTRY     IHEOPQ
     INCLUDE   INLIB(IHEOPQA)
 NAME     IHEOPQA(R)
               ENTRY     IHEOPZ
     INCLUDE   INLIB(IHEOPZA)
 NAME     IHEOPZA(R)
               ENTRY     IHEOSD
     INCLUDE   INLIB(IHEOSDA)
 NAME     IHEOSDA(R)
               ENTRY     IHEOSE
     INCLUDE   INLIB(IHEOSEA)
 NAME     IHEOSEA(R)
               ENTRY     IHEOSI
     INCLUDE   INLIB(IHEOSIA)
 NAME     IHEOSIA(R)
               ENTRY     IHEOSS
     INCLUDE   INLIB(IHEOSSA)
 NAME     IHEOSSA(R)
               ENTRY     IHEOST
     INCLUDE   INLIB(IHEOSTA)
 NAME     IHEOSTA(R)
               ENTRY     IHEOSW
     INCLUDE   INLIB(IHEOSWA)
 NAME     IHEOSWA(R)
               ENTRY     IHEPDF
     INCLUDE   INLIB(IHEPDF0)
 NAME     IHEPDF0(R)
               ENTRY     IHEPDL
     INCLUDE   INLIB(IHEPDL0)
 NAME     IHEPDL0(R)
               ENTRY     IHEPDS
     INCLUDE   INLIB(IHEPDS0)
 NAME     IHEPDS0(R)
               ENTRY     IHEPDW
     INCLUDE   INLIB(IHEPDW0)
 NAME     IHEPDW0(R)
               ENTRY     IHEPDX
     INCLUDE   INLIB(IHEPDX0)
 NAME     IHEPDX0(R)
               ENTRY     IHEPDZ
     INCLUDE   INLIB(IHEPDZ0)
 NAME     IHEPDZ0(R)
               ENTRY     IHEPRD
     INCLUDE   INLIB(IHEPRDA)
 NAME     IHEPRDA(R)
               ENTRY     IHEPRT
          ALIAS     IHEPRTB
     INCLUDE   INLIB(IHEPRTA)
 NAME     IHEPRTA(R)
               ENTRY     IHEPSF
     INCLUDE   INLIB(IHEPSF0)
 NAME     IHEPSF0(R)
               ENTRY     IHEPSL
     INCLUDE   INLIB(IHEPSL0)
 NAME     IHEPSL0(R)
               ENTRY     IHEPSS
     INCLUDE   INLIB(IHEPSS0)
 NAME     IHEPSS0(R)
               ENTRY     IHEPSW
     INCLUDE   INLIB(IHEPSW0)
 NAME     IHEPSW0(R)
               ENTRY     IHEPSX
     INCLUDE   INLIB(IHEPSX0)
 NAME     IHEPSX0(R)
               ENTRY     IHEPSZ
     INCLUDE   INLIB(IHEPSZ0)
 NAME     IHEPSZ0(R)
               ENTRY     IHEPTT
          ALIAS     IHEPTTB
     INCLUDE   INLIB(IHEPTTA)
 NAME     IHEPTTA(R)
               ENTRY     IHERES
          ALIAS     IHERESN
     INCLUDE   INLIB(IHEREST)
 NAME     IHEREST(R)
               ENTRY     IHESAPA
          ALIAS     IHESAPD
          ALIAS     IHESAPC
          ALIAS     IHESAPB
          ALIAS     IHESADA
     INCLUDE   INLIB(IHESAPA)
 NAME     IHESAPA(R)
               ENTRY     IHESHL
          ALIAS     IHESHLC
     INCLUDE   INLIB(IHESHLS)
 NAME     IHESHLS(R)
               ENTRY     IHESHS
          ALIAS     IHESHSC
     INCLUDE   INLIB(IHESHSS)
 NAME     IHESHSS(R)
               ENTRY     IHESIZ
     INCLUDE   INLIB(IHESIZE)
 NAME     IHESIZE(R)
               ENTRY     IHESMF
     INCLUDE   INLIB(IHESMF0)
 NAME     IHESMF0(R)
               ENTRY     IHESMG
          ALIAS     IHESMGR
     INCLUDE   INLIB(IHESMGC)
 NAME     IHESMGC(R)
               ENTRY     IHESMH
          ALIAS     IHESMHR
     INCLUDE   INLIB(IHESMHC)
 NAME     IHESMHC(R)
               ENTRY     IHESMX
     INCLUDE   INLIB(IHESMX0)
 NAME     IHESMX0(R)
               ENTRY     IHESNL
          ALIAS     IHESNLZ
          ALIAS     IHESNLS
          ALIAS     IHESNLC
     INCLUDE   INLIB(IHESNLK)
 NAME     IHESNLK(R)
               ENTRY     IHESNS
          ALIAS     IHESNSZ
          ALIAS     IHESNSK
          ALIAS     IHESNSC
     INCLUDE   INLIB(IHESNSS)
 NAME     IHESNSS(R)
               ENTRY     IHESNW
          ALIAS     IHESNWZ
          ALIAS     IHESNWS
          ALIAS     IHESNWC
     INCLUDE   INLIB(IHESNWK)
 NAME     IHESNWK(R)
               ENTRY     IHESNZ
          ALIAS     IHESNZZ
          ALIAS     IHESNZS
          ALIAS     IHESNZC
     INCLUDE   INLIB(IHESNZK)
 NAME     IHESNZK(R)
               ENTRY     IHESPRT
     INCLUDE   INLIB(IHESPRT)
 NAME     IHESPRT(R)
               ENTRY     IHESQL
     INCLUDE   INLIB(IHESQL0)
 NAME     IHESQL0(R)
               ENTRY     IHESQS
     INCLUDE   INLIB(IHESQS0)
 NAME     IHESQS0(R)
               ENTRY     IHESQW
     INCLUDE   INLIB(IHESQW0)
 NAME     IHESQW0(R)
               ENTRY     IHESQZ
     INCLUDE   INLIB(IHESQZ0)
 NAME     IHESQZ0(R)
               ENTRY     IHESRC
          ALIAS     IHESRCF
          ALIAS     IHESRCE
          ALIAS     IHESRCD
          ALIAS     IHESRCC
          ALIAS     IHESRCB
     INCLUDE   INLIB(IHESRCA)
 NAME     IHESRCA(R)
               ENTRY     IHESRD
     INCLUDE   INLIB(IHESRDA)
 NAME     IHESRDA(R)
               ENTRY     IHESRT
          ALIAS     IHESRTD
          ALIAS     IHESRTC
          ALIAS     IHESRTB
     INCLUDE   INLIB(IHESRTA)
 NAME     IHESRTA(R)
               ENTRY     IHESSF
     INCLUDE   INLIB(IHESSF0)
 NAME     IHESSF0(R)
               ENTRY     IHESSG
          ALIAS     IHESSGR
     INCLUDE   INLIB(IHESSGC)
 NAME     IHESSGC(R)
               ENTRY     IHESSH
          ALIAS     IHESSHR
     INCLUDE   INLIB(IHESSHC)
 NAME     IHESSHC(R)
               ENTRY     IHESSX
     INCLUDE   INLIB(IHESSX0)
 NAME     IHESSX0(R)
               ENTRY     IHESTA
     INCLUDE   INLIB(IHESTAA)
 NAME     IHESTAA(R)
               ENTRY     IHESTG
          ALIAS     IHESTGB
     INCLUDE   INLIB(IHESTGA)
 NAME     IHESTGA(R)
               ENTRY     IHESTP
     INCLUDE   INLIB(IHESTPA)
 NAME     IHESTPA(R)
               ENTRY     IHESTR
          ALIAS     IHESTRC
          ALIAS     IHESTRB
     INCLUDE   INLIB(IHESTRA)
 NAME     IHESTRA(R)
               ENTRY     IHESUB
     INCLUDE   INLIB(IHESUBA)
 NAME     IHESUBA(R)
               ENTRY     IHETAB
     INCLUDE   INLIB(IHETABS)
 NAME     IHETABS(R)
               ENTRY     IHETCV
          ALIAS     IHETCVB
     INCLUDE   INLIB(IHETCVA)
 NAME     IHETCVA(R)
               ENTRY     IHETEA
     INCLUDE   INLIB(IHETEAA)
 NAME     IHETEAA(R)
               ENTRY     IHETER
          ALIAS     IHETER
     INCLUDE   INLIB(IHETERA)
 NAME     IHETERA(R)
               ENTRY     IHETEV
     INCLUDE   INLIB(IHETEVA)
 NAME     IHETEVA(R)
               ENTRY     IHETEX
          ALIAS     IHETEXC
          ALIAS     IHETEXB
     INCLUDE   INLIB(IHETEXA)
 NAME     IHETEXA(R)
               ENTRY     IHETHL
     INCLUDE   INLIB(IHETHL0)
 NAME     IHETHL0(R)
               ENTRY     IHETHS
     INCLUDE   INLIB(IHETHS0)
 NAME     IHETHS0(R)
               ENTRY     IHETNL
          ALIAS     IHETNLR
     INCLUDE   INLIB(IHETNLD)
 NAME     IHETNLD(R)
               ENTRY     IHETNS
          ALIAS     IHETNSR
     INCLUDE   INLIB(IHETNSD)
 NAME     IHETNSD(R)
               ENTRY     IHETNW
          ALIAS     IHETNWN
     INCLUDE   INLIB(IHETNWH)
 NAME     IHETNWH(R)
               ENTRY     IHETNZ
          ALIAS     IHETNZN
     INCLUDE   INLIB(IHETNZH)
 NAME     IHETNZH(R)
               ENTRY     IHETOM
          ALIAS     IHETOME
          ALIAS     IHETOMD
          ALIAS     IHETOMC
          ALIAS     IHETOMB
     INCLUDE   INLIB(IHETOMA)
 NAME     IHETOMA(R)
               ENTRY     IHETPB
     INCLUDE   INLIB(IHETPBA)
 NAME     IHETPBA(R)
               ENTRY     IHETPR
     INCLUDE   INLIB(IHETPRA)
 NAME     IHETPRA(R)
               ENTRY     IHETSA
          ALIAS     IHETSAD
          ALIAS     IHETSAA
     INCLUDE   INLIB(IHETSAP)
 NAME     IHETSAP(R)
               ENTRY     IHETSE
     INCLUDE   INLIB(IHETSEA)
 NAME     IHETSEA(R)
               ENTRY     IHETSS
     INCLUDE   INLIB(IHETSSA)
 NAME     IHETSSA(R)
               ENTRY     IHETSW
     INCLUDE   INLIB(IHETSWA)
 NAME     IHETSWA(R)
               ENTRY     IHEUPA
          ALIAS     IHEUPAB
          ALIAS     IHEUPA
     INCLUDE   INLIB(IHEUPAA)
 NAME     IHEUPAA(R)
               ENTRY     IHEUPB
          ALIAS     IHEUPBB
          ALIAS     IHEUPB
     INCLUDE   INLIB(IHEUPBA)
 NAME     IHEUPBA(R)
               ENTRY     IHEVCA
          ALIAS     IHEVCA
     INCLUDE   INLIB(IHEVCAA)
 NAME     IHEVCAA(R)
               ENTRY     IHEVCS
          ALIAS     IHEVCSB
          ALIAS     IHEVCS
     INCLUDE   INLIB(IHEVCSA)
 NAME     IHEVCSA(R)
               ENTRY     IHEVFA
          ALIAS     IHEVFA
     INCLUDE   INLIB(IHEVFAA)
 NAME     IHEVFAA(R)
               ENTRY     IHEVFB
          ALIAS     IHEVFB
     INCLUDE   INLIB(IHEVFBA)
 NAME     IHEVFBA(R)
               ENTRY     IHEVFC
          ALIAS     IHEVFC
     INCLUDE   INLIB(IHEVFCA)
 NAME     IHEVFCA(R)
               ENTRY     IHEVFD
          ALIAS     IHEVFD
     INCLUDE   INLIB(IHEVFDA)
 NAME     IHEVFDA(R)
               ENTRY     IHEVFE
          ALIAS     IHEVFE
     INCLUDE   INLIB(IHEVFEA)
 NAME     IHEVFEA(R)
               ENTRY     IHEVKB
          ALIAS     IHEVKB
     INCLUDE   INLIB(IHEVKBA)
 NAME     IHEVKBA(R)
               ENTRY     IHEVKC
          ALIAS     IHEVKC
     INCLUDE   INLIB(IHEVKCA)
 NAME     IHEVKCA(R)
               ENTRY     IHEVKF
          ALIAS     IHEVKF
     INCLUDE   INLIB(IHEVKFA)
 NAME     IHEVKFA(R)
               ENTRY     IHEVKG
          ALIAS     IHEVKG
     INCLUDE   INLIB(IHEVKGA)
 NAME     IHEVKGA(R)
               ENTRY     IHEVPA
          ALIAS     IHEVPA
     INCLUDE   INLIB(IHEVPAA)
 NAME     IHEVPAA(R)
               ENTRY     IHEVPB
          ALIAS     IHEVPB
     INCLUDE   INLIB(IHEVPBA)
 NAME     IHEVPBA(R)
               ENTRY     IHEVPC
          ALIAS     IHEVPC
     INCLUDE   INLIB(IHEVPCA)
 NAME     IHEVPCA(R)
               ENTRY     IHEVPD
          ALIAS     IHEVPD
     INCLUDE   INLIB(IHEVPDA)
 NAME     IHEVPDA(R)
               ENTRY     IHEVPE
          ALIAS     IHEVPE
     INCLUDE   INLIB(IHEVPEA)
 NAME     IHEVPEA(R)
               ENTRY     IHEVPF
          ALIAS     IHEVPF
     INCLUDE   INLIB(IHEVPFA)
 NAME     IHEVPFA(R)
               ENTRY     IHEVPG
          ALIAS     IHEVPG
     INCLUDE   INLIB(IHEVPGA)
 NAME     IHEVPGA(R)
               ENTRY     IHEVPH
          ALIAS     IHEVPH
     INCLUDE   INLIB(IHEVPHA)
 NAME     IHEVPHA(R)
               ENTRY     IHEVQA
     INCLUDE   INLIB(IHEVQAA)
 NAME     IHEVQAA(R)
               ENTRY     IHEVQB
          ALIAS     IHEVQB
     INCLUDE   INLIB(IHEVQBA)
 NAME     IHEVQBA(R)
               ENTRY     IHEVQC
          ALIAS     IHEVQC
     INCLUDE   INLIB(IHEVQCA)
 NAME     IHEVQCA(R)
               ENTRY     IHEVSA
          ALIAS     IHEVSA
     INCLUDE   INLIB(IHEVSAA)
 NAME     IHEVSAA(R)
               ENTRY     IHEVSB
          ALIAS     IHEVSB
     INCLUDE   INLIB(IHEVSBA)
 NAME     IHEVSBA(R)
               ENTRY     IHEVSC
          ALIAS     IHEVSC
     INCLUDE   INLIB(IHEVSCA)
 NAME     IHEVSCA(R)
               ENTRY     IHEVSD
          ALIAS     IHEVSDB
          ALIAS     IHEVSD
     INCLUDE   INLIB(IHEVSDA)
 NAME     IHEVSDA(R)
               ENTRY     IHEVSE
          ALIAS     IHEVSEB
          ALIAS     IHEVSE
     INCLUDE   INLIB(IHEVSEA)
 NAME     IHEVSEA(R)
               ENTRY     IHEVSF
          ALIAS     IHEVSF
     INCLUDE   INLIB(IHEVSFA)
 NAME     IHEVSFA(R)
               ENTRY     IHEVTB
     INCLUDE   INLIB(IHEVTBA)
 NAME     IHEVTBA(R)
               ENTRY     IHEXIB
     INCLUDE   INLIB(IHEXIB0)
 NAME     IHEXIB0(R)
               ENTRY     IHEXID
     INCLUDE   INLIB(IHEXID0)
 NAME     IHEXID0(R)
               ENTRY     IHEXIL
     INCLUDE   INLIB(IHEXIL0)
 NAME     IHEXIL0(R)
               ENTRY     IHEXIS
     INCLUDE   INLIB(IHEXIS0)
 NAME     IHEXIS0(R)
               ENTRY     IHEXIU
     INCLUDE   INLIB(IHEXIU0)
 NAME     IHEXIU0(R)
               ENTRY     IHEXIV
     INCLUDE   INLIB(IHEXIV0)
 NAME     IHEXIV0(R)
               ENTRY     IHEXIW
     INCLUDE   INLIB(IHEXIW0)
 NAME     IHEXIW0(R)
               ENTRY     IHEXIZ
     INCLUDE   INLIB(IHEXIZ0)
 NAME     IHEXIZ0(R)
               ENTRY     IHEXXL
     INCLUDE   INLIB(IHEXXL0)
 NAME     IHEXXL0(R)
               ENTRY     IHEXXS
     INCLUDE   INLIB(IHEXXS0)
 NAME     IHEXXS0(R)
               ENTRY     IHEXXW
     INCLUDE   INLIB(IHEXXW0)
 NAME     IHEXXW0(R)
               ENTRY     IHEXXZ
     INCLUDE   INLIB(IHEXXZ0)
 NAME     IHEXXZ0(R)
               ENTRY     IHEYGF
          ALIAS     IHEYGFS
     INCLUDE   INLIB(IHEYGFV)
 NAME     IHEYGFV(R)
               ENTRY     IHEYGL
          ALIAS     IHEYGLS
     INCLUDE   INLIB(IHEYGLV)
 NAME     IHEYGLV(R)
               ENTRY     IHEYGS
          ALIAS     IHEYGSS
     INCLUDE   INLIB(IHEYGSV)
 NAME     IHEYGSV(R)
               ENTRY     IHEYGW
          ALIAS     IHEYGWS
     INCLUDE   INLIB(IHEYGWV)
 NAME     IHEYGWV(R)
               ENTRY     IHEYGX
          ALIAS     IHEYGXS
     INCLUDE   INLIB(IHEYGXV)
 NAME     IHEYGXV(R)
               ENTRY     IHEYGZ
          ALIAS     IHEYGZS
     INCLUDE   INLIB(IHEYGZV)
 NAME     IHEYGZV(R)
               ENTRY     IHEZZA
     INCLUDE   INLIB(IHEZZAA)
 NAME     IHEZZAA(R)
               ENTRY     IHEZZB
     INCLUDE   INLIB(IHEZZBA)
 NAME     IHEZZBA(R)
               ENTRY     IHEZZC
     INCLUDE   INLIB(IHEZZCA)
 NAME     IHEZZCA(R)
               ENTRY     IHEZZF
     INCLUDE   INLIB(IHEZZFA)
 NAME     IHEZZFA(R)
/*
//*
//LINK005 EXEC PGM=IEWL,REGION=512K,
//             PARM='LET,LIST,XREF,NCAL,RENT,REUS'
//SYSPRINT DD  SYSOUT=A
//SYSUT1   DD  SPACE=(CYL,(5,1)),UNIT=SYSDA
//SYSLMOD  DD  DSN=SYS1.PL1LIB,DISP=(MOD,PASS),  <== TARGET
//             SPACE=(TRK,(90,30,95))
//INLIB    DD  DSN=&&PL1LIB,DISP=(OLD,PASS)
//SYSLIN   DD  *
               ENTRY     IHCGSP01
     INCLUDE   INLIB(IHEGSP01)
 NAME     IHEGSP01(R)
               ENTRY     IHCGSP02
     INCLUDE   INLIB(IHEGSP02)
 NAME     IHEGSP02(R)
/*
//*
//LINK006 EXEC PGM=IEWL,REGION=512K,
//             PARM='LET,LIST,XREF,NCAL'
//SYSPRINT DD  SYSOUT=A
//SYSUT1   DD  SPACE=(CYL,(5,1)),UNIT=SYSDA
//SYSLMOD  DD  DSN=SYS1.PL1LIB,DISP=(MOD,PASS),  <== TARGET
//             SPACE=(TRK,(90,30,95))
//INLIB    DD  DSN=&&PL1LIB,DISP=(OLD,PASS)
//SYSLIN   DD  *
               ENTRY     IHEGSP03
     INCLUDE   INLIB(IHEGSP03)
 NAME     IHEGSP03(R)
               ENTRY     IHGUADEL
     INCLUDE   INLIB(IHGUADEL)
 NAME     IHGUADEL(R)
/*
//*
//LINK007 EXEC PGM=IEWL,REGION=512K,
//             PARM='LET,LIST,XREF,NCAL,OVLY'
//SYSPRINT DD  SYSOUT=A
//SYSUT1   DD  SPACE=(CYL,(5,1)),UNIT=SYSDA
//SYSLMOD  DD  DSN=SYS1.PL1LIB,DISP=(MOD,PASS),  <== TARGET
//             SPACE=(TRK,(90,30,95))
//INLIB    DD  DSN=&&PL1LIB,DISP=(OLD,PASS)
//SYSLIN   DD  *
               ENTRY     IHGROOT
     INCLUDE   INLIB(IHGUAP)
          INSERT IHGROOT
     OVERLAY OVLY001
          INSERT IHGURD
     OVERLAY OVLY001
          INSERT IHGANY
     OVERLAY OVLY003
          INSERT IHGCTB
     OVERLAY OVLY003
          INSERT IHGUALOG
 OVERLAY REGION2(REGION)
          INSERT IHGTAB
 NAME     IHGUAP(R)
/*
//*
//LINK008 EXEC PGM=IEWL,REGION=512K,
//             PARM='LET,LIST,XREF,NCAL,REUS'
//SYSPRINT DD  SYSOUT=A
//SYSUT1   DD  SPACE=(CYL,(5,1)),UNIT=SYSDA
//SYSLMOD  DD  DSN=SYS1.PL1LIB,DISP=(MOD,CATLG), <== TARGET
//             SPACE=(TRK,(90,30,95),RLSE)
//INLIB    DD  DSN=&&PL1LIB,DISP=(OLD,PASS)
//SYSLIN   DD  *
               ENTRY     IHLGTF01
     INCLUDE   INLIB(IHLGTF)
 NAME     IHLGTF(R)
               ENTRY     IHLGTF11
     INCLUDE   INLIB(IHLGTF1)
 NAME     IHLGTF1(R)
               ENTRY     IHLINT21
     INCLUDE   INLIB(IHLINT2)
 NAME     IHLINT2(R)
               ENTRY     IHLINT31
     INCLUDE   INLIB(IHLINT3)
 NAME     IHLINT3(R)
               ENTRY     IHLINT41
     INCLUDE   INLIB(IHLINT4)
 NAME     IHLINT4(R)
               ENTRY     IHLRMON
     INCLUDE   INLIB(IHLRMON)
 NAME     IHLRMON(R)
               ENTRY     IHLROUT
     INCLUDE   INLIB(IHLROUT)
 NAME     IHLROUT(R)
               ENTRY     IHLSCAN1
     INCLUDE   INLIB(IHLSCAN)
 NAME     IHLSCAN(R)
               ENTRY     IHLTAIR1
     INCLUDE   INLIB(IHLTAIR)
 NAME     IHLTAIR(R)
               ENTRY     IHLTAR2
     INCLUDE   INLIB(IHLTAR2)
 NAME     IHLTAR2(R)
               ENTRY     IHLTAR3
     INCLUDE   INLIB(IHLTAR3)
 NAME     IHLTAR3(R)
               ENTRY     IHLTAR4
     INCLUDE   INLIB(IHLTAR4)
 NAME     IHLTAR4(R)
               ENTRY     IHLTAR5
     INCLUDE   INLIB(IHLTAR5)
 NAME     IHLTAR5(R)
               ENTRY     IHLTAR6
     INCLUDE   INLIB(IHLTAR6)
 NAME     IHLTAR6(R)
               ENTRY     IHLTCTL1
     INCLUDE   INLIB(IHLTCTL)
 NAME     IHLTCTL(R)
               ENTRY     IHLTDCB
     INCLUDE   INLIB(IHLTDCB)
 NAME     IHLTDCB(R)
               ENTRY     IHLTERM
     INCLUDE   INLIB(IHLTERM)
 NAME     IHLTERM(R)
               ENTRY     IHLTFIL
     INCLUDE   INLIB(IHLTFIL)
 NAME     IHLTFIL(R)
               ENTRY     IHLTMG1
     INCLUDE   INLIB(IHLTMG1)
 NAME     IHLTMG1(R)
               ENTRY     IHLTPED
     INCLUDE   INLIB(IHLTPED)
 NAME     IHLTPED(R)
               ENTRY     IHLTPMT
     INCLUDE   INLIB(IHLTPMT)
 NAME     IHLTPMT(R)
               ENTRY     IHLTSCN
     INCLUDE   INLIB(IHLTSCN)
 NAME     IHLTSCN(R)
               ENTRY     IHLTSIO
     INCLUDE   INLIB(IHLTSIO)
 NAME     IHLTSIO(R)
               ENTRY     IHLTSV1
     INCLUDE   INLIB(IHLTSVC)
 NAME     IHLTSVC(R)
               ENTRY     IHLTSYSV
     INCLUDE   INLIB(IHLTSYSV)
 NAME     IHLTSYSV(R)
               ENTRY     IHLTTAB
     INCLUDE   INLIB(IHLTTAB)
 NAME     IHLTTAB(R)
               ENTRY     IHLTUSR
     INCLUDE   INLIB(IHLTUSR)
 NAME     IHLTUSR(R)
               ENTRY     IHLT103
     INCLUDE   INLIB(IHLT103)
 NAME     IHLT103(R)
               ENTRY     IHLWRAP
     INCLUDE   INLIB(IHLWRAP)
 NAME     IHLWRAP(R)
/*
//*
//SUBMIT  EXEC PGM=IEBGENER
//SYSIN    DD  DUMMY
//SYSPRINT DD  DUMMY
//SYSUT1   DD  DISP=SHR,DSN=SYS2.JCLLIB(TESTPL1)
//SYSUT2   DD  SYSOUT=(A,INTRDR)
