         PRINT NOGEN
         DMSMACRO TYPE=DSECT
         PRINT ON,GEN
MCH0     TITLE 'D M S M C H 0  MACHINE CHECK DATA SAVE ROUTINE OF DMS'
         SPACE 3
* NOTE THAT THIS ROUTINE DOES NOT NEED A BASE REGISTER ASSIGNMENT
         SPACE 3
DMSMCH0  CSECT
         USING *,R15
         USING DMSCONST,DMSREG
         USING PSA,PSAREG
         SR    R15,R15                  INDICATE RECORD TO BE SAVED
         BR    R14                      RETURN
         CSECTID DMSMCH0
         END
