//HPZ$TPOS JOB ,ZBIEGIEN,MSGCLASS=W,CLASS=3
/*JOBPARM ROOM=3426
//TIMETAKE PROC STPLIB=PRODLIB,
//             PGRMR=XYZ,              PROGRAMMER'S INITIALS
//             DISPD='(,PASS,DELETE)',  DISP OF DATA FILE
//             BLKS=160   40640 TIMINGS SECONDARY ALLOCATION
//*   TAKE TIME SAMPLES OF A PROGRAM
//*   CREATED  MAY 15,1978 H ZBIEGIEN
//TIMETAKE EXEC  PGM=TIMETAKE
//STEPLIB  DD   DSN=&PGRMR..TESTLIB,
//             DISP=SHR
//         DD   DSN=&STPLIB,
//             DISP=SHR
//TIMEDATA DD   DSN=&&PGRMR,
//             DISP=&DISPD,
//             UNIT=SYSDA,
//             DCB=(LRECL=4,RECFM=FBS,BLKSIZE=1016),  254 SAMPLES
//             SPACE=(1016,(32,&BLKS),RLSE)    8128 SAMPLES
//SYSUDUMP DD   SYSOUT=W
//*   ADD  TIMEPARM DD *  CARD FOLLOWED BY 1 DATA CARD
//*   FIRST 8 COLUMNS OF DATA CARD IS THE PROGRAM NAME TO BE SAMPLED
//*   NEXT 5 COLUMNS IS THE TIME INTERVAL IN UNITS OF 26.0416 MICRO SEC
//*  A VALUE OF 00380 IS 10 MILLI SECONDS,OR 100 SAMPLES PER CPU SEC
// PEND
//A EXEC TIMETAKE,PGRMR=HPZ
//TIMEPARM DD *
POSA    00020
//CARDS   DD *  THE REST OF YOUR JCL AS YOU NORMALLY WOULD HAVE
PTM99505013179
PTM10604252550108D 120
//CE    DD SYSOUT=W,DCB=(LRECL=133,RECFM=FB,BLKSIZE=1729)
//WORKFILE DD UNIT=SYSDA,SPACE=(6160,(10,20)),
//    DCB=(LRECL=80,RECFM=FBS,BLKSIZE=6160)
//POSTABLE    DD UNIT=SYSDA,SPACE=(6228,(4,4)),
//   DCB=(LRECL=12,RECFM=FBS,BLKSIZE=6228)
//CHNGCRDS   DD UNIT=SYSDA,SPACE=(6160,(10,20)),
//   DCB=(LRECL=77,RECFM=FBS,BLKSIZE=6160)
//IGZSRTCD DD DUMMY
//SYSOUT   DD SYSOUT=W
//SORTLIB  DD DSN=SYS1.SORTLIB,DISP=SHR
//SORTWK01 DD UNIT=SYSDA,SPACE=(CYL,1)
//SORTWK02 DD UNIT=SYSDA,SPACE=(CYL,1)
//SORTWK03 DD UNIT=SYSDA,SPACE=(CYL,1)
