PROC 0
/*--------------------------------------------------------*/
/*      ISPF/PDF CLIST FOR SADSC PANELS FOR USE           */
/*               DOING TSO 'ACCOUNT' FUNCTIONS            */
/*--------------------------------------------------------*/
CONTROL NOMSG PROMPT
        ISPEXEC  FTOPEN   TEMP
        ISPEXEC  FTINCL   ACCT#S6
        ISPEXEC  FTCLOSE
        ISPEXEC  VGET     ZTEMPF
        EX    '&ZTEMPF'
        DEL   '&ZTEMPF'
