)ATTR
  +  TYPE(TEXT) INTENS(LOW) SKIP(ON)
  %  TYPE(TEXT) INTENS(HIGH) SKIP(ON)
  _  TYPE(INPUT) INTENS(HIGH)
)BODY
+
+----%IBM   I N F O R M A T I O N  /  S Y S T E M +--------------------
+
+    ENTER SYSOUT CLASS%===>_SYSOUT        +PRINT CLASS
+
+        ENTER PRT DEST%===>_RMT           +PRT DEST FOR PRINT,
+                                            DEFAULT IS LOCAL
+       ENTER FILE OPTS%===>_FILES
+
+  FILE OPTIONS:
+
+  A - ALL FILES                     H - HELP INFORMATION
+  B - PRODUCT INFORMATION           P - PTF/PLC INFORMATION
+  C - SOFTWARE CATALOG              Q - Q&A FROM SUPPORT CENTERS
+  D - SRL/TNL DOCUMENT STATUS       S - 'SECOM' ENTRIES
+  E - EARLY WARNING SYSTEM (EWS)    T - EDUCATION OFFERINGS
+  G - SUPPORT CENTER DOCUMENTS      U - USER GENERATED DATA
+
)INIT
 .CURSOR = SYSOUT
 &SYSOUT  = TRANS (&SYSOUT ' ',A,*,*)
 &RMT     = TRANS (&RMT ' ',' ',*,*)
 &FILES   = TRANS (&FILES ' ',BDGU,*,*)
)PROC
 IF (&RMT  ^= ' ')
     VER (&RMT,NONBLANK) VER(&RMT,NAME)
 VER(&SYSOUT,NONBLANK)  VER(&SYSOUT,LIST,A,C)
 VER (&FILES,NONBLANK)
 &SEL  =  'CMD(%INFOS#C)'
)END
