PROC 0 DEBUG
IF &DEBUG = DEBUG THEN CONTROL MSG LIST CONLIST SYMLIST NOFLUSH PROMPT
                  ELSE CONTROL NOMSG
FREE F(SYSLIB SYSPUNCH SYSPRINT IN )
DELETE ACTMODS.REPORT
DELETE ACTMODS.PUNCH
CONTROL MSG
ISPEXEC VGET CNTLDSN
ALLOC F(SYSLIB) DS(&CNTLDSN) SHR
ALLOC F(SYSPUNCH) DS(ACTMODS.PUNCH) NEW SPA(10,10) T
ALLOC F(SYSPRINT) DUMMY
$P IEBPDSUT 'PUNCH'
FREE F(SYSPRINT SYSPUNCH)
ALLOC F(SYSPRINT) DS(ACTMODS.REPORT) NEW SPA(10,10) T
ALLOC F(IN) DS(ACTMODS.PUNCH)
$P ACTMODS
FREE F(IN SYSLIB SYSPRINT)
CONTROL NOMSG
DELETE ACTMODS.PUNCH
CONTROL MSG
%GENPRINT DSN(ACTMODS.REPORT) DEOPT(P)
