PROC 0
ISPEXEC CONTROL SPLIT ENABLE
ISPEXEC DISPLAY PANEL(BLKS)
IF &LRECL= -
THEN DO
     END
ELSE DO
         BLK3380 &LRECL KEYLEN(&KEY) NUMBER(&K)
         ISPEXEC CONTROL DISPLAY LINE
     END
