PROC 0
ISPEXEC CONTROL SPLIT ENABLE
ISPEXEC DISPLAY PANEL(COMPARE)
IF &DSN= -
   THEN DO
        END
   ELSE DO
        IF &VOL= -
        THEN DO
    ISPEXEC CONTROL DISPLAY LINE
    UTILEXEC PDSAA &DSN COMPARE &MEMA &MEMB
             END
        ELSE DO
    ISPEXEC CONTROL DISPLAY LINE
    UTILEXEC PDSAA &DSN VOL(&VOL) COMPARE &MEMA &MEMB
             END
        END
