PROC 0
ISPEXEC DISPLAY PANEL(FINDMOD)
IF &MODULE= -
THEN DO
     END
ELSE DO
       ISPEXEC CONTROL DISPLAY LINE
       WRITE
       WRITE LOOKING FOR PROGRAM &MODULE
       WRITE
       FINDMOD &MODULE
       WRITE
       WRITE SEARCH PROCESS HAS FINISHED
    END
