PROC 0
ISPEXEC CONTROL SPLIT ENABLE
ISPEXEC DISPLAY PANEL(LOCDSN)
IF &DSNAME= -
   THEN DO
        END
   ELSE DO
           LOCDSN &DSNAME
           ISPEXEC CONTROL DISPLAY REFRESH
        END
