PROC 0
ISPEXEC CONTROL SPLIT ENABLE
ISPEXEC DISPLAY PANEL(MAP)
IF &DSN= -
   THEN DO
        END
   ELSE DO
        IF &VOL= -
        THEN DO
      ISPEXEC CONTROL DISPLAY LINE
      UTILEXEC PDSAA &DSN MAP &MEM
             END
        ELSE DO
      ISPEXEC CONTROL DISPLAY LINE
             UTILEXEC PDSAA &DSN VOL(&VOL) MAP &MEM
             END
        END
