//TEC3166T JOB (T369057000),'BEN/TAPECOPY',CLASS=Z,MSGCLASS=X,
//             NOTIFY=TEC3166,MSGLEVEL=(2,0)
/*SETUP MOD2 - I WILL BRING TAPE
/*JOBPARM R=1
//STEP1   EXEC PGM=IEBGENER
//SYSPRINT DD  SYSOUT=*
//SYSUT1   DD  DSN=GENERAL.ELECTRIC,UNIT=TAPE,VOL=SER=MOD2,
//             DISP=(,PASS),DCB=(LRECL=80,BLKSIZE=400,RECFM=FB),
//             LABEL=(2,BLP,EXPDT=98000)
//SYSUT2   DD  DSN=SHARE.FILE014.DATA(IEF285I),DISP=OLD
//SYSIN    DD  DUMMY
