//TEC3166R JOB (T369057000),'BEN/ROCKWELL',CLASS=Z,MSGCLASS=X,
//             NOTIFY=TEC3166,TYPRUN=HOLD
/*SETUP ROCK - I WILL BRING TAPE
/*JOBPARM R=1
//REST    EXEC PGM=IEBGENER
//*
//*        COPY ROCKWELL MODS
//*
//SYSPRINT DD SYSOUT=*
//SYSUT1   DD DSN=ROCKWELL.MODS,
//            UNIT=TAPE,VOL=(,RETAIN,,SER=ROCK),
//            DCB=(LRECL=80,BLKSIZE=6160,RECFM=FB),
//            DISP=OLD,LABEL=(1,NL,EXPDT=98000)
//SYSUT2   DD DSN=SHARE.ROCKWELL.FILE1,DISP=SHR
//SYSIN    DD  DUMMY
